{
    "title": "Denise: Deep Robust Principal Component Analysis for Positive Semidefinite Matrices. (arXiv:2004.13612v4 [stat.ML] UPDATED)",
    "abstract": "The robust PCA of covariance matrices plays an essential role when isolating key explanatory features. The currently available methods for performing such a low-rank plus sparse decomposition are matrix specific, meaning, those algorithms must re-run for every new matrix. Since these algorithms are computationally expensive, it is preferable to learn and store a function that nearly instantaneously performs this decomposition when evaluated. Therefore, we introduce Denise, a deep learning-based algorithm for robust PCA of covariance matrices, or more generally, of symmetric positive semidefinite matrices, which learns precisely such a function. Theoretical guarantees for Denise are provided. These include a novel universal approximation theorem adapted to our geometric deep learning problem and convergence to an optimal solution to the learning problem. Our experiments show that Denise matches state-of-the-art performance in terms of decomposition quality, while being approximately $20",
    "link": "http://arxiv.org/abs/2004.13612",
    "context": "Title: Denise: Deep Robust Principal Component Analysis for Positive Semidefinite Matrices. (arXiv:2004.13612v4 [stat.ML] UPDATED)\nAbstract: The robust PCA of covariance matrices plays an essential role when isolating key explanatory features. The currently available methods for performing such a low-rank plus sparse decomposition are matrix specific, meaning, those algorithms must re-run for every new matrix. Since these algorithms are computationally expensive, it is preferable to learn and store a function that nearly instantaneously performs this decomposition when evaluated. Therefore, we introduce Denise, a deep learning-based algorithm for robust PCA of covariance matrices, or more generally, of symmetric positive semidefinite matrices, which learns precisely such a function. Theoretical guarantees for Denise are provided. These include a novel universal approximation theorem adapted to our geometric deep learning problem and convergence to an optimal solution to the learning problem. Our experiments show that Denise matches state-of-the-art performance in terms of decomposition quality, while being approximately $20",
    "path": "papers/20/04/2004.13612.json",
    "total_tokens": 903,
    "translated_title": "Denise: 面向半正定矩阵的深度健壮主成分分析",
    "translated_abstract": "协方差矩阵的健壮主成分分析在隔离关键解释特征方面发挥着至关重要的作用。目前可用的执行低秩加稀疏分解的方法是针对特定矩阵的，也就是说，这些算法必须针对每个新的矩阵重新运行。由于这些算法的计算成本很高，因此最好学习和存储一个函数，在评估时几乎立即执行此分解。因此，我们引入了 Denise，一种基于深度学习的协方差矩阵的健壮主成分分析算法，或更一般地说，对称半正定矩阵，它学习到了这样一个函数。我们提供了 Denise 的理论保证。这些包括一个新的通用逼近定理，适用于我们的几何深度学习问题，并趋于学习问题的最优解。我们的实验表明，Denise 在分解质量方面与最先进的性能相匹配，同时近乎接近20倍的加速。",
    "tldr": "Denise是一种基于深度学习的算法，用于对协方差矩阵进行低秩加稀疏分解，达到了与最先进技术相当的性能而且近乎接近20倍的加速。",
    "en_tdlr": "Denise is a deep learning-based algorithm for low-rank plus sparse decomposition of covariance matrices, which matches state-of-the-art performance while being approximately 20 times faster, and provides novel theoretical guarantees including a universal approximation theorem."
}