{
    "title": "Extrapolation-based Prediction-Correction Methods for Time-varying Convex Optimization. (arXiv:2004.11709v4 [math.OC] UPDATED)",
    "abstract": "In this paper, we focus on the solution of online optimization problems that arise often in signal processing and machine learning, in which we have access to streaming sources of data. We discuss algorithms for online optimization based on the prediction-correction paradigm, both in the primal and dual space. In particular, we leverage the typical regularized least-squares structure appearing in many signal processing problems to propose a novel and tailored prediction strategy, which we call extrapolation-based. By using tools from operator theory, we then analyze the convergence of the proposed methods as applied both to primal and dual problems, deriving an explicit bound for the tracking error, that is, the distance from the time-varying optimal solution. We further discuss the empirical performance of the algorithm when applied to signal processing, machine learning, and robotics problems.",
    "link": "http://arxiv.org/abs/2004.11709",
    "context": "Title: Extrapolation-based Prediction-Correction Methods for Time-varying Convex Optimization. (arXiv:2004.11709v4 [math.OC] UPDATED)\nAbstract: In this paper, we focus on the solution of online optimization problems that arise often in signal processing and machine learning, in which we have access to streaming sources of data. We discuss algorithms for online optimization based on the prediction-correction paradigm, both in the primal and dual space. In particular, we leverage the typical regularized least-squares structure appearing in many signal processing problems to propose a novel and tailored prediction strategy, which we call extrapolation-based. By using tools from operator theory, we then analyze the convergence of the proposed methods as applied both to primal and dual problems, deriving an explicit bound for the tracking error, that is, the distance from the time-varying optimal solution. We further discuss the empirical performance of the algorithm when applied to signal processing, machine learning, and robotics problems.",
    "path": "papers/20/04/2004.11709.json",
    "total_tokens": 806,
    "translated_title": "基于外推的时变凸优化预测校正方法",
    "translated_abstract": "本文针对信号处理和机器学习中经常遇到、具有数据流的在线优化问题，讨论了基于预测校正范式的在线优化算法，包括原始问题和对偶问题。特别地，我们利用出现在许多信号处理问题中的典型正则化最小二乘结构，提出了一种新的定制预测策略，即基于外推的策略。然后，通过运用算子理论工具，我们分别分析了该方法作用于原始问题和对偶问题时的收敛性，推导出了追踪误差（即与时变最优解距离）的显式界限。我们进一步讨论了该算法应用于信号处理、机器学习和机器人问题时的实证表现。",
    "tldr": "本文提出了一种基于外推策略的在线优化算法，解决了大量信号处理和机器学习中的实时优化问题，并且通过使用算子理论工具，分析了原始问题和对偶问题的显式界限。",
    "en_tdlr": "This paper proposes an online optimization algorithm based on extrapolation strategy, which solves real-time optimization problems in a large amount of signal processing and machine learning, and analyzes the explicit bounds of primal and dual problems by using operator theory tools."
}