{
    "title": "Equilibrium Selection in Data Markets: Multiple-Principal, Multiple-Agent Problems with Non-Rivalrous Goods. (arXiv:2004.00196v2 [cs.GT] UPDATED)",
    "abstract": "There are several aspects of data markets that distinguish them from a typical commodity market: asymmetric information, the non-rivalrous nature of data, and informational externalities. Formally, this gives rise to a new class of games which we call multiple-principal, multiple-agent problem with non-rivalrous goods. Under the assumption that the principal's payoff is quasilinear in the payments given to agents, we show that there is a fundamental degeneracy in the market of non-rivalrous goods. This multiplicity of equilibria also affects common refinements of equilibrium definitions intended to uniquely select an equilibrium: both variational equilibria and normalized equilibria will be non-unique in general. This implies that most existing equilibrium concepts cannot provide predictions on the outcomes of data markets emerging today. The results support the idea that modifications to payment contracts themselves are unlikely to yield a unique equilibrium, and either changes to the",
    "link": "http://arxiv.org/abs/2004.00196",
    "context": "Title: Equilibrium Selection in Data Markets: Multiple-Principal, Multiple-Agent Problems with Non-Rivalrous Goods. (arXiv:2004.00196v2 [cs.GT] UPDATED)\nAbstract: There are several aspects of data markets that distinguish them from a typical commodity market: asymmetric information, the non-rivalrous nature of data, and informational externalities. Formally, this gives rise to a new class of games which we call multiple-principal, multiple-agent problem with non-rivalrous goods. Under the assumption that the principal's payoff is quasilinear in the payments given to agents, we show that there is a fundamental degeneracy in the market of non-rivalrous goods. This multiplicity of equilibria also affects common refinements of equilibrium definitions intended to uniquely select an equilibrium: both variational equilibria and normalized equilibria will be non-unique in general. This implies that most existing equilibrium concepts cannot provide predictions on the outcomes of data markets emerging today. The results support the idea that modifications to payment contracts themselves are unlikely to yield a unique equilibrium, and either changes to the",
    "path": "papers/20/04/2004.00196.json",
    "total_tokens": 906,
    "translated_title": "数据市场中的均衡选择：多主体、多代理问题中的非竞争性商品",
    "translated_abstract": "数据市场与典型的商品市场存在几个不同之处，如信息不对称、数据的非竞争性和信息外部性。正式地，这些特点引出了一类新的博弈问题，我们称之为多主体、多代理非竞争性商品问题。假设主体的收益是支付给代理商的收益的拟线性函数，我们发现非竞争性商品市场存在根本的退化。这种均衡的多样性也影响到了均衡定义的普遍反复修正：变分均衡和归一化均衡在一般情况下都是不唯一的。这意味着大多数现有的均衡概念不能对当今出现的数据市场结果进行预测。研究结果支持了这样一个想法：即对支付合同本身的修改不太可能产生唯一的均衡，而需要调整数据市场的制度框架或引入外部力量来解决根本的退化问题。",
    "tldr": "数据市场的均衡选择是多元化的，现有的均衡概念不能预测结果。需要修改数据市场的制度框架或引入外部力量来解决根本问题。",
    "en_tdlr": "Equilibrium selection in data markets is diverse, and existing equilibrium concepts cannot predict results. Changes to the institutional framework of data markets or the introduction of external forces are needed to solve the fundamental problem."
}