{
    "title": "Nucleus I: Adjunction spectra in recommender systems and descent. (arXiv:2004.07353v4 [math.CT] UPDATED)",
    "abstract": "Recommender systems build user profiles using concept analysis of usage matrices. The concepts are mined as spectra and form Galois connections. Descent is a general method for spectral decomposition in algebraic geometry and topology which also leads to generalized Galois connections. Both recommender systems and descent theory are vast research areas, separated by a technical gap so large that trying to establish a link would seem foolish. Yet a formal link emerged, all on its own, bottom-up, against authors' intentions and better judgment. Familiar problems of data analysis led to a novel solution in category theory. The present paper arose from a series of earlier efforts to provide a top-down account of these developments.",
    "link": "http://arxiv.org/abs/2004.07353",
    "context": "Title: Nucleus I: Adjunction spectra in recommender systems and descent. (arXiv:2004.07353v4 [math.CT] UPDATED)\nAbstract: Recommender systems build user profiles using concept analysis of usage matrices. The concepts are mined as spectra and form Galois connections. Descent is a general method for spectral decomposition in algebraic geometry and topology which also leads to generalized Galois connections. Both recommender systems and descent theory are vast research areas, separated by a technical gap so large that trying to establish a link would seem foolish. Yet a formal link emerged, all on its own, bottom-up, against authors' intentions and better judgment. Familiar problems of data analysis led to a novel solution in category theory. The present paper arose from a series of earlier efforts to provide a top-down account of these developments.",
    "path": "papers/20/04/2004.07353.json",
    "total_tokens": 897,
    "translated_title": "Nucleus I: 推荐系统和下降中的附加谱 (arXiv:2004.07353v4 [math.CT] 更新)",
    "translated_abstract": "推荐系统通过对使用矩阵进行概念分析来构建用户配置文件。这些概念被视为谱并形成伽罗华连接。下降是代数几何和拓扑中谱分解的一种通用方法，也导致了广义伽罗华连接。推荐系统和下降理论都是广泛的研究领域，由于技术差距过大，试图建立联系似乎是愚蠢的。然而，一个形式链接自己形成，自底向上，在作者的意图和最佳判断之外。熟悉的数据分析问题导致了范畴论中的一种新颖解决方案。本文是一系列早期努力的结果，旨在提供对这些发展的自上而下的说明。",
    "tldr": "这篇论文介绍了在推荐系统和下降理论中的附加谱，并解释了它们之间的联系。通过对使用矩阵进行概念分析，推荐系统构建用户配置文件，并形成伽罗华连接。下降是一种用于代数几何和拓扑的谱分解方法，也导致了广义伽罗华连接。这篇论文对数据分析问题提出了新颖的范畴论解决方案。",
    "en_tdlr": "This paper presents the adjunction spectra in recommender systems and descent theory, explaining their connection. Recommender systems build user profiles using concept analysis of usage matrices, forming Galois connections. Descent is a general method for spectral decomposition in algebraic geometry and topology, leading to generalized Galois connections. The paper provides a novel categorical solution to familiar data analysis problems."
}