{
    "title": "DDCoT: Duty-Distinct Chain-of-Thought Prompting for Multimodal Reasoning in Language Models. (arXiv:2310.16436v1 [cs.CV])",
    "abstract": "A long-standing goal of AI systems is to perform complex multimodal reasoning like humans. Recently, large language models (LLMs) have made remarkable strides in such multi-step reasoning on the language modality solely by leveraging the chain of thought (CoT) to mimic human thinking. However, the transfer of these advancements to multimodal contexts introduces heightened challenges, including but not limited to the impractical need for labor-intensive annotation and the limitations in terms of flexibility, generalizability, and explainability. To evoke CoT reasoning in multimodality, this work first conducts an in-depth analysis of these challenges posed by multimodality and presents two key insights: \"keeping critical thinking\" and \"letting everyone do their jobs\" in multimodal CoT reasoning. Furthermore, this study proposes a novel DDCoT prompting that maintains a critical attitude through negative-space prompting and incorporates multimodality into reasoning by first dividing the r",
    "link": "http://arxiv.org/abs/2310.16436",
    "context": "Title: DDCoT: Duty-Distinct Chain-of-Thought Prompting for Multimodal Reasoning in Language Models. (arXiv:2310.16436v1 [cs.CV])\nAbstract: A long-standing goal of AI systems is to perform complex multimodal reasoning like humans. Recently, large language models (LLMs) have made remarkable strides in such multi-step reasoning on the language modality solely by leveraging the chain of thought (CoT) to mimic human thinking. However, the transfer of these advancements to multimodal contexts introduces heightened challenges, including but not limited to the impractical need for labor-intensive annotation and the limitations in terms of flexibility, generalizability, and explainability. To evoke CoT reasoning in multimodality, this work first conducts an in-depth analysis of these challenges posed by multimodality and presents two key insights: \"keeping critical thinking\" and \"letting everyone do their jobs\" in multimodal CoT reasoning. Furthermore, this study proposes a novel DDCoT prompting that maintains a critical attitude through negative-space prompting and incorporates multimodality into reasoning by first dividing the r",
    "path": "papers/23/10/2310.16436.json",
    "total_tokens": 925,
    "translated_title": "DDCoT: 多模态语言模型中的职责分明的思路链刺激",
    "translated_abstract": "人工智能系统的一个长远目标是实现类似人类的复杂多模态推理。最近，大型语言模型在语言模态上利用思路链（CoT）模拟人类思维，在多步推理方面取得了显著进展。然而，将这些进展转移到多模态环境中引入了更高的挑战，包括但不限于对劳动密集型注释的需求以及灵活性、一般化和可解释性方面的限制。为了在多模态环境中唤起CoT推理，本研究首先对多模态环境中的这些挑战进行了深入分析，并提出了两个关键洞见：“保持批判性思考”和“让每个人发挥自己的作用”。此外，本研究提出了一种新颖的DDCoT刺激方法，通过负空间刺激保持批判态度，并通过首先划分责任明确国多模态推理。",
    "tldr": "DDCoT是一种职责分明的思路链刺激方法，通过负空间刺激保持批判态度，并在多模态推理中结合了关键洞见“保持批判性思考”和“让每个人发挥自己的作用”。",
    "en_tdlr": "DDCoT is a duty-distinct chain-of-thought prompting method that maintains a critical attitude through negative-space prompting and incorporates the key insights of \"keeping critical thinking\" and \"letting everyone do their jobs\" in multimodal reasoning."
}