{
    "title": "Integrating 3D City Data through Knowledge Graphs. (arXiv:2310.11555v1 [cs.DB])",
    "abstract": "CityGML is a widely adopted standard by the Open Geospatial Consortium (OGC) for representing and exchanging 3D city models. The representation of semantic and topological properties in CityGML makes it possible to query such 3D city data to perform analysis in various applications, e.g., security management and emergency response, energy consumption and estimation, and occupancy measurement. However, the potential of querying CityGML data has not been fully exploited. The official GML/XML encoding of CityGML is only intended as an exchange format but is not suitable for query answering. The most common way of dealing with CityGML data is to store them in the 3DCityDB system as relational tables and then query them with the standard SQL query language. Nevertheless, for end users, it remains a challenging task to formulate queries over 3DCityDB directly for their ad-hoc analytical tasks, because there is a gap between the conceptual semantics of CityGML and the relational schema adopte",
    "link": "http://arxiv.org/abs/2310.11555",
    "context": "Title: Integrating 3D City Data through Knowledge Graphs. (arXiv:2310.11555v1 [cs.DB])\nAbstract: CityGML is a widely adopted standard by the Open Geospatial Consortium (OGC) for representing and exchanging 3D city models. The representation of semantic and topological properties in CityGML makes it possible to query such 3D city data to perform analysis in various applications, e.g., security management and emergency response, energy consumption and estimation, and occupancy measurement. However, the potential of querying CityGML data has not been fully exploited. The official GML/XML encoding of CityGML is only intended as an exchange format but is not suitable for query answering. The most common way of dealing with CityGML data is to store them in the 3DCityDB system as relational tables and then query them with the standard SQL query language. Nevertheless, for end users, it remains a challenging task to formulate queries over 3DCityDB directly for their ad-hoc analytical tasks, because there is a gap between the conceptual semantics of CityGML and the relational schema adopte",
    "path": "papers/23/10/2310.11555.json",
    "total_tokens": 974,
    "translated_title": "通过知识图谱整合3D城市数据",
    "translated_abstract": "CityGML是由开放地理空间联盟（OGC）广泛采用的用于表示和交换3D城市模型的标准。CityGML中语义和拓扑属性的表示使得可以对这些3D城市数据进行查询，用于各种应用的分析，例如安全管理和应急响应、能源消耗和估计以及占用测量。然而，查询CityGML数据的潜力尚未完全开发。CityGML的官方GML/XML编码只是用作交换格式，不适合进行查询回答。处理CityGML数据的最常见方式是将其存储在3DCityDB系统中作为关系表，然后使用标准的SQL查询语言进行查询。然而，对于终端用户来说，直接在3DCityDB上为他们的特定分析任务制定查询仍然是一项具有挑战性的任务，因为CityGML的概念语义与所采用的关系模式之间存在差距。",
    "tldr": "通过知识图谱整合3D城市数据，能够利用CityGML的语义和拓扑属性对该数据进行查询，实现各种应用的分析。目前关于查询CityGML数据的潜力尚未充分开发，常见的处理方式是将其存储在3DCityDB系统中，使用SQL查询语言进行操作。然而，终端用户在针对特定任务制定查询时仍然面临一些挑战，因为CityGML的概念语义与关系模式之间存在差距。",
    "en_tdlr": "Integrating 3D city data through knowledge graphs allows for querying and analyzing the data for various applications. However, the potential of querying CityGML data is not fully exploited, and there is a gap between the conceptual semantics of CityGML and the relational schema used for querying."
}