{
    "title": "General Identifiability and Achievability for Causal Representation Learning. (arXiv:2310.15450v1 [cs.LG])",
    "abstract": "This paper focuses on causal representation learning (CRL) under a general nonparametric causal latent model and a general transformation model that maps the latent data to the observational data. It establishes \\textbf{identifiability} and \\textbf{achievability} results using two hard \\textbf{uncoupled} interventions per node in the latent causal graph. Notably, one does not know which pair of intervention environments have the same node intervened (hence, uncoupled environments). For identifiability, the paper establishes that perfect recovery of the latent causal model and variables is guaranteed under uncoupled interventions. For achievability, an algorithm is designed that uses observational and interventional data and recovers the latent causal model and variables with provable guarantees for the algorithm. This algorithm leverages score variations across different environments to estimate the inverse of the transformer and, subsequently, the latent variables. The analysis, addit",
    "link": "http://arxiv.org/abs/2310.15450",
    "context": "Title: General Identifiability and Achievability for Causal Representation Learning. (arXiv:2310.15450v1 [cs.LG])\nAbstract: This paper focuses on causal representation learning (CRL) under a general nonparametric causal latent model and a general transformation model that maps the latent data to the observational data. It establishes \\textbf{identifiability} and \\textbf{achievability} results using two hard \\textbf{uncoupled} interventions per node in the latent causal graph. Notably, one does not know which pair of intervention environments have the same node intervened (hence, uncoupled environments). For identifiability, the paper establishes that perfect recovery of the latent causal model and variables is guaranteed under uncoupled interventions. For achievability, an algorithm is designed that uses observational and interventional data and recovers the latent causal model and variables with provable guarantees for the algorithm. This algorithm leverages score variations across different environments to estimate the inverse of the transformer and, subsequently, the latent variables. The analysis, addit",
    "path": "papers/23/10/2310.15450.json",
    "total_tokens": 929,
    "translated_title": "通用因果表达学习的可识别性和可实现性",
    "translated_abstract": "本文关注通用非参数因果潜变量模型和将潜变量数据映射到观测数据的通用转换模型下的因果表达学习。通过在潜在因果图中每个节点进行两个硬性非耦合干预来建立可识别性和可实现性结果。值得注意的是，人们不知道哪个干预环境对应的节点是相同的（因此是非耦合环境）。在可识别性方面，本文确保在非耦合干预下能够完美恢复潜在的因果模型和变量。在可实现性方面，设计了一个算法，利用观测和干预数据，并提供了对该算法的可验证的保证，以恢复潜在的因果模型和变量。该算法利用不同环境中的得分变化来估计转换器的逆和随后的潜变量。该分析还...",
    "tldr": "本文在通用非参数因果潜变量模型和通用转换模型下，通过非耦合干预建立了因果表达学习的可识别性和可实现性结果。在不知道具体干预对应的节点的情况下，这些结果保证了潜在的因果模型和变量的完美恢复，并设计了一个算法来实现这一目标。",
    "en_tdlr": "This paper establishes identifiability and achievability results for causal representation learning under a general nonparametric causal latent model and a general transformation model. Using uncoupled interventions, the paper guarantees perfect recovery of the latent causal model and variables, and designs an algorithm that achieves this goal even when the specific intervened nodes are unknown."
}