{
    "title": "Application of deep and reinforcement learning to boundary control problems. (arXiv:2310.15191v1 [cs.LG])",
    "abstract": "The boundary control problem is a non-convex optimization and control problem in many scientific domains, including fluid mechanics, structural engineering, and heat transfer optimization. The aim is to find the optimal values for the domain boundaries such that the enclosed domain adhering to the governing equations attains the desired state values. Traditionally, non-linear optimization methods, such as the Interior-Point method (IPM), are used to solve such problems.  This project explores the possibilities of using deep learning and reinforcement learning to solve boundary control problems. We adhere to the framework of iterative optimization strategies, employing a spatial neural network to construct well-informed initial guesses, and a spatio-temporal neural network learns the iterative optimization algorithm using policy gradients. Synthetic data, generated from the problems formulated in the literature, is used for training, testing and validation. The numerical experiments ind",
    "link": "http://arxiv.org/abs/2310.15191",
    "context": "Title: Application of deep and reinforcement learning to boundary control problems. (arXiv:2310.15191v1 [cs.LG])\nAbstract: The boundary control problem is a non-convex optimization and control problem in many scientific domains, including fluid mechanics, structural engineering, and heat transfer optimization. The aim is to find the optimal values for the domain boundaries such that the enclosed domain adhering to the governing equations attains the desired state values. Traditionally, non-linear optimization methods, such as the Interior-Point method (IPM), are used to solve such problems.  This project explores the possibilities of using deep learning and reinforcement learning to solve boundary control problems. We adhere to the framework of iterative optimization strategies, employing a spatial neural network to construct well-informed initial guesses, and a spatio-temporal neural network learns the iterative optimization algorithm using policy gradients. Synthetic data, generated from the problems formulated in the literature, is used for training, testing and validation. The numerical experiments ind",
    "path": "papers/23/10/2310.15191.json",
    "total_tokens": 978,
    "translated_title": "将深度学习和强化学习应用于边界控制问题的研究",
    "translated_abstract": "边界控制问题是许多科学领域中的非凸优化和控制问题，包括流体力学、结构工程和热传递优化。其目标是找到使符合控制方程要求的封闭域内的状态值达到期望值的最优边界值。传统上，使用非线性优化方法，如内点法（IPM）来解决这类问题。本研究探讨了使用深度学习和强化学习解决边界控制问题的可能性。我们遵循迭代优化策略的框架，利用空间神经网络构建有启发性的初始猜测，并使用策略梯度的方法来学习迭代优化算法的时空神经网络。使用从文献中提出的问题生成的合成数据进行训练、测试和验证。数值实验表明，深度学习和强化学习方法在解决边界控制问题方面具有潜在优势。",
    "tldr": "本研究将深度学习和强化学习应用于解决边界控制问题，通过使用空间神经网络构建初始猜测以及利用策略梯度方法学习迭代优化算法的时空神经网络，通过使用生成的合成数据进行训练和验证，研究发现深度学习和强化学习方法在解决边界控制问题方面具有潜在优势。",
    "en_tdlr": "This study applies deep learning and reinforcement learning to address boundary control problems. By utilizing spatial neural networks to construct informed initial guesses and employing policy gradients to learn iterative optimization algorithms in spatio-temporal neural networks, and training and validating using synthetic data generated from literature problems, it is found that deep learning and reinforcement learning approaches have potential advantages in solving boundary control problems."
}