{
    "title": "Conceptual Framework for Autonomous Cognitive Entities. (arXiv:2310.06775v2 [cs.HC] UPDATED)",
    "abstract": "The rapid development and adoption of Generative AI (GAI) technology in the form of chatbots such as ChatGPT and Claude has greatly increased interest in agentic machines. This paper introduces the Autonomous Cognitive Entity (ACE) model, a novel framework for a cognitive architecture, enabling machines and software agents to operate more independently. Drawing inspiration from the OSI model, the ACE framework presents layers of abstraction to conceptualize artificial cognitive architectures. The model is designed to harness the capabilities of the latest generative AI technologies, including large language models (LLMs) and multimodal generative models (MMMs), to build autonomous, agentic systems. The ACE framework comprises six layers: the Aspirational Layer, Global Strategy, Agent Model, Executive Function, Cognitive Control, and Task Prosecution. Each layer plays a distinct role, ranging from setting the moral compass and strategic thinking to task selection and execution. The ACE ",
    "link": "http://arxiv.org/abs/2310.06775",
    "context": "Title: Conceptual Framework for Autonomous Cognitive Entities. (arXiv:2310.06775v2 [cs.HC] UPDATED)\nAbstract: The rapid development and adoption of Generative AI (GAI) technology in the form of chatbots such as ChatGPT and Claude has greatly increased interest in agentic machines. This paper introduces the Autonomous Cognitive Entity (ACE) model, a novel framework for a cognitive architecture, enabling machines and software agents to operate more independently. Drawing inspiration from the OSI model, the ACE framework presents layers of abstraction to conceptualize artificial cognitive architectures. The model is designed to harness the capabilities of the latest generative AI technologies, including large language models (LLMs) and multimodal generative models (MMMs), to build autonomous, agentic systems. The ACE framework comprises six layers: the Aspirational Layer, Global Strategy, Agent Model, Executive Function, Cognitive Control, and Task Prosecution. Each layer plays a distinct role, ranging from setting the moral compass and strategic thinking to task selection and execution. The ACE ",
    "path": "papers/23/10/2310.06775.json",
    "total_tokens": 939,
    "translated_title": "自主认知实体的概念框架",
    "translated_abstract": "在ChatGPT和Claude等聊天机器人形式的生成式人工智能（GAI）技术的快速发展和采用中，对代理机器的兴趣大大增加。本文介绍了自主认知实体（ACE）模型，这是一个用于认知架构的新型框架，使得机器和软件代理能够更加独立地运行。受OSI模型启发，ACE框架提供了一系列抽象层来概念化人工认知架构。该模型旨在利用最新的生成式人工智能技术，包括大型语言模型（LLM）和多模态生成模型（MMM），构建自主的代理系统。ACE框架包括六个层次：愿景层、全局策略、代理模型、执行功能、认知控制和任务执行。每个层次都扮演着不同的角色，从设定道德指南和战略思考到任务选择和执行。",
    "tldr": "本文介绍了自主认知实体（ACE）模型，这是一个新型的认知架构框架，通过利用生成式人工智能技术，使机器和软件代理能够更加独立地运行。该模型包括六个层次，用于设置道德指南、制定全局策略、建立代理模型、执行功能、认知控制和任务执行。",
    "en_tdlr": "This paper introduces the Autonomous Cognitive Entity (ACE) model, a novel framework for cognitive architectures that enables machines and software agents to operate more independently. The ACE framework comprises six layers and utilizes generative AI technologies to build autonomous systems with distinct roles in moral compass, strategic thinking, agent modeling, executive function, cognitive control, and task execution."
}