{
    "title": "Substitutes markets with budget constraints: solving for competitive and optimal prices. (arXiv:2310.03692v1 [econ.TH])",
    "abstract": "Markets with multiple divisible goods have been studied widely from the perspective of revenue and welfare. In general, it is well known that envy-free revenue-maximal outcomes can result in lower welfare than competitive equilibrium outcomes. We study a market in which buyers have quasilinear utilities with linear substitutes valuations and budget constraints, and the seller must find prices and an envy-free allocation that maximise revenue or welfare. Our setup mirrors markets such as ad auctions and auctions for the exchange of financial assets. We prove that the unique competitive equilibrium prices are also envy-free revenue-maximal. This coincidence of maximal revenue and welfare is surprising and breaks down even when buyers have piecewise-linear valuations. We present a novel characterisation of the set of \"feasible\" prices at which demand does not exceed supply, show that this set has an elementwise minimal price vector, and demonstrate that these prices maximise revenue and w",
    "link": "http://arxiv.org/abs/2310.03692",
    "context": "Title: Substitutes markets with budget constraints: solving for competitive and optimal prices. (arXiv:2310.03692v1 [econ.TH])\nAbstract: Markets with multiple divisible goods have been studied widely from the perspective of revenue and welfare. In general, it is well known that envy-free revenue-maximal outcomes can result in lower welfare than competitive equilibrium outcomes. We study a market in which buyers have quasilinear utilities with linear substitutes valuations and budget constraints, and the seller must find prices and an envy-free allocation that maximise revenue or welfare. Our setup mirrors markets such as ad auctions and auctions for the exchange of financial assets. We prove that the unique competitive equilibrium prices are also envy-free revenue-maximal. This coincidence of maximal revenue and welfare is surprising and breaks down even when buyers have piecewise-linear valuations. We present a novel characterisation of the set of \"feasible\" prices at which demand does not exceed supply, show that this set has an elementwise minimal price vector, and demonstrate that these prices maximise revenue and w",
    "path": "papers/23/10/2310.03692.json",
    "total_tokens": 965,
    "translated_title": "有预算限制的替代市场：解决竞争和最优价格问题",
    "translated_abstract": "多个可分割商品的市场从收入和福利的角度得到了广泛的研究。一般来说，众所周知，无嫉妒收入最大化的结果可能会导致比竞争均衡的结果更低的福利。我们研究了一个市场，买家具有准线性效用和线性替代估值，并且有预算限制，卖家必须找到最大化收入或福利的价格和无嫉妒的分配。我们的设置与广告拍卖和金融资产交换拍卖等市场相似。我们证明了唯一的竞争均衡价格也是无嫉妒收入最大化的。这种最大收入和福利的巧合令人惊讶，在买家具有分段线性估值时甚至会失败。我们提供了一个对“可行”价格集的新颖描述，表明这个集合有一个按元素最小的价格向量，证明了这些价格最大化收入和福利。",
    "tldr": "本文研究了一个有预算限制的市场，买家具有准线性效用和线性替代估值，卖家需要找到最大化收入或福利的价格和无嫉妒的分配。研究发现竞争均衡价格也是无嫉妒收入最大化的，并提供了对“可行”价格集的新颖描述。"
}