{
    "title": "Bias in Emotion Recognition with ChatGPT. (arXiv:2310.11753v1 [cs.RO])",
    "abstract": "This technical report explores the ability of ChatGPT in recognizing emotions from text, which can be the basis of various applications like interactive chatbots, data annotation, and mental health analysis. While prior research has shown ChatGPT's basic ability in sentiment analysis, its performance in more nuanced emotion recognition is not yet explored. Here, we conducted experiments to evaluate its performance of emotion recognition across different datasets and emotion labels. Our findings indicate a reasonable level of reproducibility in its performance, with noticeable improvement through fine-tuning. However, the performance varies with different emotion labels and datasets, highlighting an inherent instability and possible bias. The choice of dataset and emotion labels significantly impacts ChatGPT's emotion recognition performance. This paper sheds light on the importance of dataset and label selection, and the potential of fine-tuning in enhancing ChatGPT's emotion recogniti",
    "link": "http://arxiv.org/abs/2310.11753",
    "context": "Title: Bias in Emotion Recognition with ChatGPT. (arXiv:2310.11753v1 [cs.RO])\nAbstract: This technical report explores the ability of ChatGPT in recognizing emotions from text, which can be the basis of various applications like interactive chatbots, data annotation, and mental health analysis. While prior research has shown ChatGPT's basic ability in sentiment analysis, its performance in more nuanced emotion recognition is not yet explored. Here, we conducted experiments to evaluate its performance of emotion recognition across different datasets and emotion labels. Our findings indicate a reasonable level of reproducibility in its performance, with noticeable improvement through fine-tuning. However, the performance varies with different emotion labels and datasets, highlighting an inherent instability and possible bias. The choice of dataset and emotion labels significantly impacts ChatGPT's emotion recognition performance. This paper sheds light on the importance of dataset and label selection, and the potential of fine-tuning in enhancing ChatGPT's emotion recogniti",
    "path": "papers/23/10/2310.11753.json",
    "total_tokens": 884,
    "translated_title": "ChatGPT中的情绪识别偏差",
    "translated_abstract": "本技术报告探讨了ChatGPT在从文本中识别情绪的能力，这可以作为交互式聊天机器人、数据标注和心理健康分析等各种应用的基础。虽然先前的研究已经展示了ChatGPT在情感分析方面的基本能力，但其在更微妙的情绪识别方面的表现尚未被探索。我们在此进行了一系列实验，评估了它在不同数据集和情绪标签上的情绪识别性能。我们的研究结果表明，其性能具有合理的可重复性，并且通过微调可以明显改善。然而，性能在不同情绪标签和数据集上存在差异，突显了内在的不稳定性和潜在的偏差。数据集和情绪标签的选择对ChatGPT的情绪识别性能有着重要影响。本文论述了数据集和标签选择的重要性，以及通过微调提升ChatGPT情绪识别能力的潜力。",
    "tldr": "这项技术报告探讨了ChatGPT在从文本中识别情绪方面的能力，并发现其在不同情绪标签和数据集上的性能有所差异，突显了内在的不稳定性和潜在的偏差。",
    "en_tdlr": "This technical report investigates the ability of ChatGPT to recognize emotions from text, revealing variations in performance across different emotion labels and datasets, highlighting inherent instability and potential bias."
}