{
    "title": "Learning to Search Feasible and Infeasible Regions of Routing Problems with Flexible Neural k-Opt. (arXiv:2310.18264v1 [cs.LG])",
    "abstract": "In this paper, we present Neural k-Opt (NeuOpt), a novel learning-to-search (L2S) solver for routing problems. It learns to perform flexible k-opt exchanges based on a tailored action factorization method and a customized recurrent dual-stream decoder. As a pioneering work to circumvent the pure feasibility masking scheme and enable the autonomous exploration of both feasible and infeasible regions, we then propose the Guided Infeasible Region Exploration (GIRE) scheme, which supplements the NeuOpt policy network with feasibility-related features and leverages reward shaping to steer reinforcement learning more effectively. Additionally, we equip NeuOpt with Dynamic Data Augmentation (D2A) for more diverse searches during inference. Extensive experiments on the Traveling Salesman Problem (TSP) and Capacitated Vehicle Routing Problem (CVRP) demonstrate that our NeuOpt not only significantly outstrips existing (masking-based) L2S solvers, but also showcases superiority over the learning-",
    "link": "http://arxiv.org/abs/2310.18264",
    "context": "Title: Learning to Search Feasible and Infeasible Regions of Routing Problems with Flexible Neural k-Opt. (arXiv:2310.18264v1 [cs.LG])\nAbstract: In this paper, we present Neural k-Opt (NeuOpt), a novel learning-to-search (L2S) solver for routing problems. It learns to perform flexible k-opt exchanges based on a tailored action factorization method and a customized recurrent dual-stream decoder. As a pioneering work to circumvent the pure feasibility masking scheme and enable the autonomous exploration of both feasible and infeasible regions, we then propose the Guided Infeasible Region Exploration (GIRE) scheme, which supplements the NeuOpt policy network with feasibility-related features and leverages reward shaping to steer reinforcement learning more effectively. Additionally, we equip NeuOpt with Dynamic Data Augmentation (D2A) for more diverse searches during inference. Extensive experiments on the Traveling Salesman Problem (TSP) and Capacitated Vehicle Routing Problem (CVRP) demonstrate that our NeuOpt not only significantly outstrips existing (masking-based) L2S solvers, but also showcases superiority over the learning-",
    "path": "papers/23/10/2310.18264.json",
    "total_tokens": 958,
    "translated_title": "学习搜索具有灵活神经k-Opt的路径问题的可行和不可行区域",
    "translated_abstract": "本文介绍了一种用于路径问题的学习搜索（L2S）求解器Neural k-Opt（NeuOpt）。它基于定制的动作因子分解方法和定制的双流循环解码器，学习执行灵活的k-opt交换。作为绕过纯可行性掩盖方案并实现可行和不可行区域的自主探索的开创性工作，我们提出了Guided Infeasible Region Exploration（GIRE）方案，它为NeuOpt策略网络补充了与可行性相关的特征，并利用奖励塑造更有效地引导强化学习。此外，我们还为NeuOpt配备了Dynamic Data Augmentation（D2A），以在推理过程中进行更多样化的搜索。在旅行商问题（TSP）和有容量车辆路径问题（CVRP）上进行的大量实验证明，我们的NeuOpt不仅明显超过现有的（基于掩码的）L2S求解器，而且还展示了在学习的同时提供了更好的解决方案的优越性。",
    "tldr": "本文介绍了一种名为Neural k-Opt的学习搜索求解器，用于路径问题。通过灵活的k-opt交换和自主的可行和不可行区域探索，该算法在旅行商问题和有容量车辆路径问题上表现出优越性能。",
    "en_tdlr": "This paper presents a learning-to-search solver Neural k-Opt (NeuOpt) for routing problems. It incorporates flexible k-opt exchanges and autonomous exploration of feasible and infeasible regions, outperforming existing L2S solvers on the Traveling Salesman Problem and the Capacitated Vehicle Routing Problem."
}