{
    "title": "The Benefit of Noise-Injection for Dynamic Gray-Box Model Creation. (arXiv:2310.01517v1 [cs.LG])",
    "abstract": "Gray-box models offer significant benefit over black-box approaches for equipment emulator development for equipment since their integration of physics provides more confidence in the model outside of the training domain. However, challenges such as model nonlinearity, unmodeled dynamics, and local minima introduce uncertainties into grey-box creation that contemporary approaches have failed to overcome, leading to their under-performance compared with black-box models. This paper seeks to address these uncertainties by injecting noise into the training dataset. This noise injection enriches the dataset and provides a measure of robustness against such uncertainties. A dynamic model for a water-to-water heat exchanger has been used as a demonstration case for this approach and tested using a pair of real devices with live data streaming. Compared to the unprocessed signal data, the application of noise injection resulted in a significant reduction in modeling error (root mean square er",
    "link": "http://arxiv.org/abs/2310.01517",
    "context": "Title: The Benefit of Noise-Injection for Dynamic Gray-Box Model Creation. (arXiv:2310.01517v1 [cs.LG])\nAbstract: Gray-box models offer significant benefit over black-box approaches for equipment emulator development for equipment since their integration of physics provides more confidence in the model outside of the training domain. However, challenges such as model nonlinearity, unmodeled dynamics, and local minima introduce uncertainties into grey-box creation that contemporary approaches have failed to overcome, leading to their under-performance compared with black-box models. This paper seeks to address these uncertainties by injecting noise into the training dataset. This noise injection enriches the dataset and provides a measure of robustness against such uncertainties. A dynamic model for a water-to-water heat exchanger has been used as a demonstration case for this approach and tested using a pair of real devices with live data streaming. Compared to the unprocessed signal data, the application of noise injection resulted in a significant reduction in modeling error (root mean square er",
    "path": "papers/23/10/2310.01517.json",
    "total_tokens": 908,
    "translated_title": "噪声注入对于动态灰箱模型创建的益处",
    "translated_abstract": "灰箱模型相比于黑箱方法在设备仿真器开发中具有显著优势，因为其集成了物理学，在训练领域之外提供了更多的模型信心。然而，模型的非线性、未建模的动态和局部极小值等挑战引入了不确定性，这些挑战是现有方法无法克服的，导致其性能低于黑箱模型。本文旨在通过向训练数据集中注入噪声来解决这些不确定性。噪声注入丰富了数据集，并提供了对这些不确定性的鲁棒性衡量。以水-水换热器的动态模型作为演示案例，并使用一对实际设备和实时数据流测试。与未处理的信号数据相比，噪声注入的应用导致建模误差显著减小（均方根误差减少）。",
    "tldr": "本文研究了噪声注入在动态灰箱模型创建中的益处。通过向训练数据集中注入噪声，可以解决模型的非线性、未建模的动态和局部极小值等挑战，在水-水换热器的动态模型测试中取得了显著的建模误差减小。",
    "en_tdlr": "This paper investigates the benefit of noise injection for dynamic gray-box model creation. By injecting noise into the training dataset, it addresses challenges such as model nonlinearity, unmodeled dynamics, and local minima, resulting in a significant reduction in modeling error in the test of a water-to-water heat exchanger's dynamic model."
}