{
    "title": "Creating an Atlas of Normal Tissue for Pruning WSI Patching Through Anomaly Detection. (arXiv:2310.03106v1 [eess.IV])",
    "abstract": "Patching gigapixel whole slide images (WSIs) is an important task in computational pathology. Some methods have been proposed to select a subset of patches as WSI representation for downstream tasks. While most of the computational pathology tasks are designed to classify or detect the presence of pathological lesions in each WSI, the confounding role and redundant nature of normal histology in tissue samples are generally overlooked in WSI representations. In this paper, we propose and validate the concept of an \"atlas of normal tissue\" solely using samples of WSIs obtained from normal tissue biopsies. Such atlases can be employed to eliminate normal fragments of tissue samples and hence increase the representativeness collection of patches. We tested our proposed method by establishing a normal atlas using 107 normal skin WSIs and demonstrated how established indexes and search engines like Yottixel can be improved. We used 553 WSIs of cutaneous squamous cell carcinoma (cSCC) to show",
    "link": "http://arxiv.org/abs/2310.03106",
    "context": "Title: Creating an Atlas of Normal Tissue for Pruning WSI Patching Through Anomaly Detection. (arXiv:2310.03106v1 [eess.IV])\nAbstract: Patching gigapixel whole slide images (WSIs) is an important task in computational pathology. Some methods have been proposed to select a subset of patches as WSI representation for downstream tasks. While most of the computational pathology tasks are designed to classify or detect the presence of pathological lesions in each WSI, the confounding role and redundant nature of normal histology in tissue samples are generally overlooked in WSI representations. In this paper, we propose and validate the concept of an \"atlas of normal tissue\" solely using samples of WSIs obtained from normal tissue biopsies. Such atlases can be employed to eliminate normal fragments of tissue samples and hence increase the representativeness collection of patches. We tested our proposed method by establishing a normal atlas using 107 normal skin WSIs and demonstrated how established indexes and search engines like Yottixel can be improved. We used 553 WSIs of cutaneous squamous cell carcinoma (cSCC) to show",
    "path": "papers/23/10/2310.03106.json",
    "total_tokens": 997,
    "translated_title": "创建一个正常组织的图谱，通过异常检测对WSI补丁进行修剪",
    "translated_abstract": "在计算病理学中，修剪千兆像素的全尺寸切片图像（WSI）是一个重要的任务。已提出一些方法来选择一部分补丁作为WSI表示进行下游任务。尽管大多数计算病理学任务都旨在对每个WSI中的病理损伤进行分类或检测，但常规组织样本中正常组织的困扰作用和冗余性质通常被忽视在WSI表示中。在本文中，我们提出并验证了使用从正常组织活检中获得的WSI样本仅仅用于构建“正常组织图谱”的概念。这样的图谱可以用于消除正常组织样本的正常片段，从而增加补丁集合的代表性。我们通过使用107个正常皮肤WSI建立了一个正常图谱，并展示了如何改进已建立的指标和搜索引擎，如Yottixel。我们使用了553个表皮鳞状细胞癌（cSCC）的WSI来展示...",
    "tldr": "本研究提出了使用正常组织样本构建“正常组织图谱”的概念，并展示了如何通过这种图谱来提高WSI的代表性。通过在107个正常皮肤WSI上建立正常图谱，并使用553个表皮鳞状细胞癌（cSCC）的WSI进行验证，我们证明了该方法的有效性。"
}