{
    "title": "The Temporal Structure of Language Processing in the Human Brain Corresponds to The Layered Hierarchy of Deep Language Models. (arXiv:2310.07106v1 [cs.CL])",
    "abstract": "Deep Language Models (DLMs) provide a novel computational paradigm for understanding the mechanisms of natural language processing in the human brain. Unlike traditional psycholinguistic models, DLMs use layered sequences of continuous numerical vectors to represent words and context, allowing a plethora of emerging applications such as human-like text generation. In this paper we show evidence that the layered hierarchy of DLMs may be used to model the temporal dynamics of language comprehension in the brain by demonstrating a strong correlation between DLM layer depth and the time at which layers are most predictive of the human brain. Our ability to temporally resolve individual layers benefits from our use of electrocorticography (ECoG) data, which has a much higher temporal resolution than noninvasive methods like fMRI. Using ECoG, we record neural activity from participants listening to a 30-minute narrative while also feeding the same narrative to a high-performing DLM (GPT2-XL)",
    "link": "http://arxiv.org/abs/2310.07106",
    "context": "Title: The Temporal Structure of Language Processing in the Human Brain Corresponds to The Layered Hierarchy of Deep Language Models. (arXiv:2310.07106v1 [cs.CL])\nAbstract: Deep Language Models (DLMs) provide a novel computational paradigm for understanding the mechanisms of natural language processing in the human brain. Unlike traditional psycholinguistic models, DLMs use layered sequences of continuous numerical vectors to represent words and context, allowing a plethora of emerging applications such as human-like text generation. In this paper we show evidence that the layered hierarchy of DLMs may be used to model the temporal dynamics of language comprehension in the brain by demonstrating a strong correlation between DLM layer depth and the time at which layers are most predictive of the human brain. Our ability to temporally resolve individual layers benefits from our use of electrocorticography (ECoG) data, which has a much higher temporal resolution than noninvasive methods like fMRI. Using ECoG, we record neural activity from participants listening to a 30-minute narrative while also feeding the same narrative to a high-performing DLM (GPT2-XL)",
    "path": "papers/23/10/2310.07106.json",
    "total_tokens": 937,
    "translated_title": "《人脑中语言处理的时态结构与深度语言模型的层次结构相符》",
    "translated_abstract": "深度语言模型(DLMs)提供了一种理解人脑自然语言处理机制的新的计算范式。与传统的心理语言学模型不同，DLMs使用分层的连续数值向量序列来表示单词和上下文，使得诸多新的应用成为可能，如类人生成文本。本文通过展示DLMs的分层结构可能用于模拟大脑语言理解的时间动态，证明了DLM层次深度与最能预测人脑的层次时间之间的强相关性。我们之所以能够在时间上解析出每个层次的优势在于我们采用了电子皮质图(ECoG)数据，其时间分辨率比功能性磁共振成像(fMRI)等无损测量方法更高。我们利用ECoG从参与者听30分钟叙述时记录神经活动，同时将相同叙述提供给高性能DLM(GPT2-XL)。",
    "tldr": "本文展示了深度语言模型(DLMs)的分层结构与人脑语言理解的时间动态之间存在强相关性，通过采用电子皮层图(ECoG)数据来优化时间分辨率，为深入了解人脑语言处理机制提供了新的视角。",
    "en_tdlr": "This paper demonstrates a strong correlation between the layered hierarchy of deep language models (DLMs) and the temporal dynamics of language comprehension in the human brain. By utilizing electrocorticography (ECoG) data for higher temporal resolution, it provides a new perspective for understanding the mechanisms of human language processing."
}