{
    "title": "FROST: Towards Energy-efficient AI-on-5G Platforms -- A GPU Power Capping Evaluation. (arXiv:2310.11131v1 [cs.LG])",
    "abstract": "The Open Radio Access Network (O-RAN) is a burgeoning market with projected growth in the upcoming years. RAN has the highest CAPEX impact on the network and, most importantly, consumes 73% of its total energy. That makes it an ideal target for optimisation through the integration of Machine Learning (ML). However, the energy consumption of ML is frequently overlooked in such ecosystems. Our work addresses this critical aspect by presenting FROST Flexible Reconfiguration method with Online System Tuning - a solution for energy-aware ML pipelines that adhere to O-RAN's specifications and principles. FROST is capable of profiling the energy consumption of an ML pipeline and optimising the hardware accordingly, thereby limiting the power draw. Our findings indicate that FROST can achieve energy savings of up to 26.4% without compromising the model's accuracy or introducing significant time delays.",
    "link": "http://arxiv.org/abs/2310.11131",
    "context": "Title: FROST: Towards Energy-efficient AI-on-5G Platforms -- A GPU Power Capping Evaluation. (arXiv:2310.11131v1 [cs.LG])\nAbstract: The Open Radio Access Network (O-RAN) is a burgeoning market with projected growth in the upcoming years. RAN has the highest CAPEX impact on the network and, most importantly, consumes 73% of its total energy. That makes it an ideal target for optimisation through the integration of Machine Learning (ML). However, the energy consumption of ML is frequently overlooked in such ecosystems. Our work addresses this critical aspect by presenting FROST Flexible Reconfiguration method with Online System Tuning - a solution for energy-aware ML pipelines that adhere to O-RAN's specifications and principles. FROST is capable of profiling the energy consumption of an ML pipeline and optimising the hardware accordingly, thereby limiting the power draw. Our findings indicate that FROST can achieve energy savings of up to 26.4% without compromising the model's accuracy or introducing significant time delays.",
    "path": "papers/23/10/2310.11131.json",
    "total_tokens": 872,
    "translated_title": "FROST:面向能效AI-on-5G平台的GPU功耗调整评估",
    "translated_abstract": "开放无线接入网络（O-RAN）是一个迅速增长的市场，在未来几年有着预计的增长。无线接入网络（RAN）对网络的设备支出具有最大的影响，更重要的是，它消耗了总能耗的73%。这使得它成为通过集成机器学习（ML）来优化的理想目标。然而，在这样的生态系统中，ML的能耗常常被忽视。我们的工作通过提出FROST灵活重构与在线系统调优方法来解决这一关键问题，这是一个符合O-RAN规范和原则的能量感知ML管道解决方案。FROST能够对ML管道的能量消耗进行分析，并相应地优化硬件，从而限制功耗。我们的研究结果表明，FROST能够实现高达26.4%的能量节约，同时不影响模型的准确性或引入显著的时间延迟。",
    "tldr": "FROST是一个能够通过对ML管道能量消耗进行分析并优化硬件的解决方案，能够在不降低模型准确性或引入延迟的情况下实现高达26.4%的能量节约。"
}