{
    "title": "The Newtonian Mechanics of Demand. (arXiv:2310.17423v1 [eess.SY])",
    "abstract": "Economic engineering is a new field wherein economic systems are modelled in the same manner as traditional mechanical and electrical engineering systems. In this paper, we use Newton's theory of motion as the basis for the theory of demand; thereby establishing a theoretical foundation for economic engineering. We follow Newton's original development, as set forth in the Principia, to determine economic analogs to his three laws of motion. The pivotal result is an operational definition for an economic force, i.e. a want or a desire, in terms of a price adjustment. With this, we model the price effects of scarcity and trade friction in analogy with the models for the spring and damping force. In turn, we define economic benefits and surplus as analogous to the definitions of mechanical work and energy. These are then used to interpret the various types of economic equilibrium considered by economists from a mechanical perspective. The effectiveness of the analogy is illustrated by app",
    "link": "http://arxiv.org/abs/2310.17423",
    "context": "Title: The Newtonian Mechanics of Demand. (arXiv:2310.17423v1 [eess.SY])\nAbstract: Economic engineering is a new field wherein economic systems are modelled in the same manner as traditional mechanical and electrical engineering systems. In this paper, we use Newton's theory of motion as the basis for the theory of demand; thereby establishing a theoretical foundation for economic engineering. We follow Newton's original development, as set forth in the Principia, to determine economic analogs to his three laws of motion. The pivotal result is an operational definition for an economic force, i.e. a want or a desire, in terms of a price adjustment. With this, we model the price effects of scarcity and trade friction in analogy with the models for the spring and damping force. In turn, we define economic benefits and surplus as analogous to the definitions of mechanical work and energy. These are then used to interpret the various types of economic equilibrium considered by economists from a mechanical perspective. The effectiveness of the analogy is illustrated by app",
    "path": "papers/23/10/2310.17423.json",
    "total_tokens": 928,
    "translated_title": "需求的牛顿力学",
    "translated_abstract": "经济工程是一个新的领域，其中经济系统被建模为传统机械和电气工程系统一样。在本文中，我们以牛顿的运动理论为基础，建立了经济工程的理论基础。我们按照牛顿在《自然哲学的数学原理》中的原始发展，确定了经济力学中对应于他的三个运动定律的经济模型。关键的结果是通过价格调整来对经济力（需求或欲望）进行操作性定义。借此，我们模拟了稀缺和贸易摩擦的价格效应，类比了弹簧和阻尼力的模型。同时，我们将经济效益和剩余定义为机械功和能量的类比。然后，我们利用这些类比从机械的角度解释了经济学家研究的各种类型的经济均衡。通过应用示例，展示了类比的有效性。",
    "tldr": "本文以牛顿力学为基础，将经济系统建模为传统工程系统，提出了经济力学的理论基础。通过类比机械力学的概念，我们定义了经济力、经济效益和剩余，并利用这些类比解释了各种类型的经济均衡。此类比对经济工程具有实际应用的有效性。",
    "en_tdlr": "This paper establishes the theoretical foundation of economic engineering by modeling economic systems based on Newtonian mechanics. The concepts of economic force, benefits, and surplus are defined by analogizing the principles of mechanical work and energy, which allows for interpretation of various types of economic equilibrium. The efficacy of this analogy is demonstrated through practical application."
}