{
    "title": "Stable Estimation of Survival Causal Effects. (arXiv:2310.02278v1 [stat.ME])",
    "abstract": "We study the problem of estimating survival causal effects, where the aim is to characterize the impact of an intervention on survival times, i.e., how long it takes for an event to occur. Applications include determining if a drug reduces the time to ICU discharge or if an advertising campaign increases customer dwell time. Historically, the most popular estimates have been based on parametric or semiparametric (e.g. proportional hazards) models; however, these methods suffer from problematic levels of bias. Recently debiased machine learning approaches are becoming increasingly popular, especially in applications to large datasets. However, despite their appealing theoretical properties, these estimators tend to be unstable because the debiasing step involves the use of the inverses of small estimated probabilities -- small errors in the estimated probabilities can result in huge changes in their inverses and therefore the resulting estimator. This problem is exacerbated in survival ",
    "link": "http://arxiv.org/abs/2310.02278",
    "context": "Title: Stable Estimation of Survival Causal Effects. (arXiv:2310.02278v1 [stat.ME])\nAbstract: We study the problem of estimating survival causal effects, where the aim is to characterize the impact of an intervention on survival times, i.e., how long it takes for an event to occur. Applications include determining if a drug reduces the time to ICU discharge or if an advertising campaign increases customer dwell time. Historically, the most popular estimates have been based on parametric or semiparametric (e.g. proportional hazards) models; however, these methods suffer from problematic levels of bias. Recently debiased machine learning approaches are becoming increasingly popular, especially in applications to large datasets. However, despite their appealing theoretical properties, these estimators tend to be unstable because the debiasing step involves the use of the inverses of small estimated probabilities -- small errors in the estimated probabilities can result in huge changes in their inverses and therefore the resulting estimator. This problem is exacerbated in survival ",
    "path": "papers/23/10/2310.02278.json",
    "total_tokens": 801,
    "translated_title": "稳定估计生存因果效应",
    "translated_abstract": "本文研究了估计生存因果效应的问题，即表征干预对生存时间的影响，例如药物是否缩短了入住ICU的时间或广告活动是否增加了顾客停留时间。 过去最流行的估计方法是基于参数化或半参数化模型（例如比例风险模型），然而，这些方法存在显著的偏差问题。最近，非倾斜机器学习方法在大数据集应用中变得越来越流行。然而，尽管这些估计方法具有吸引人的理论性质，但它们往往是不稳定的，因为非倾斜化步骤涉及使用小估计概率的倒数-估计概率的小误差可能导致倒数和结果估计量发生巨大变化。在生存问题中，这个问题更加突出。",
    "tldr": "这篇论文研究了稳定估计生存因果效应的问题，研究表明传统的估计方法存在偏差，而近期非倾斜机器学习方法尽管理论上有吸引力，但在生存问题中存在不稳定性。"
}