{
    "title": "Learning Diverse Skills for Local Navigation under Multi-constraint Optimality. (arXiv:2310.02440v1 [cs.RO])",
    "abstract": "Despite many successful applications of data-driven control in robotics, extracting meaningful diverse behaviors remains a challenge. Typically, task performance needs to be compromised in order to achieve diversity. In many scenarios, task requirements are specified as a multitude of reward terms, each requiring a different trade-off. In this work, we take a constrained optimization viewpoint on the quality-diversity trade-off and show that we can obtain diverse policies while imposing constraints on their value functions which are defined through distinct rewards. In line with previous work, further control of the diversity level can be achieved through an attract-repel reward term motivated by the Van der Waals force. We demonstrate the effectiveness of our method on a local navigation task where a quadruped robot needs to reach the target within a finite horizon. Finally, our trained policies transfer well to the real 12-DoF quadruped robot, Solo12, and exhibit diverse agile behavi",
    "link": "http://arxiv.org/abs/2310.02440",
    "context": "Title: Learning Diverse Skills for Local Navigation under Multi-constraint Optimality. (arXiv:2310.02440v1 [cs.RO])\nAbstract: Despite many successful applications of data-driven control in robotics, extracting meaningful diverse behaviors remains a challenge. Typically, task performance needs to be compromised in order to achieve diversity. In many scenarios, task requirements are specified as a multitude of reward terms, each requiring a different trade-off. In this work, we take a constrained optimization viewpoint on the quality-diversity trade-off and show that we can obtain diverse policies while imposing constraints on their value functions which are defined through distinct rewards. In line with previous work, further control of the diversity level can be achieved through an attract-repel reward term motivated by the Van der Waals force. We demonstrate the effectiveness of our method on a local navigation task where a quadruped robot needs to reach the target within a finite horizon. Finally, our trained policies transfer well to the real 12-DoF quadruped robot, Solo12, and exhibit diverse agile behavi",
    "path": "papers/23/10/2310.02440.json",
    "total_tokens": 1009,
    "translated_title": "学习多重约束下局部导航的多样技能",
    "translated_abstract": "尽管数据驱动控制在机器人技术中有许多成功的应用，但提取有意义的多样行为仍然是一个挑战。通常情况下，为了实现多样性，需要在任务执行上做出妥协。在许多场景中，任务要求被指定为多个奖励项，每个奖励项都需要不同的权衡。在这项工作中，我们以约束优化视角研究了质量多样性权衡，并展示了如何通过对数值函数进行约束来获得多样的策略，其中数值函数是通过不同的奖励定义的。与先前的工作一致，通过Van der Waals力激发的吸引-排斥奖励项可以实现对多样性水平的进一步控制。我们通过在一个局部导航任务上展示了我们方法的有效性，其中一个四足机器人需要在有限时间内到达目标。最后，我们训练的策略在真实的12-Dof四足机器人Solo12上得到良好的转移，并展现出多样的灵敏行为",
    "tldr": "本研究提出了一种约束优化视角的方法，克服了在数据驱动控制中提取多样性行为的挑战。通过对数值函数进行约束，我们能够获得多样的策略。通过引入吸引-排斥奖励项，我们可以进一步控制多样性水平。实验证明了我们方法在局部导航任务上的有效性，并且在真实机器人上展现出多样的灵敏行为。",
    "en_tdlr": "This paper proposes a constrained optimization approach to overcome the challenge of extracting diverse behaviors in data-driven control. By imposing constraints on the value functions, diverse policies can be obtained. The introduction of an attract-repel reward term allows for further control of the diversity level. The effectiveness of the method is demonstrated in a local navigation task, showing diverse agile behaviors in a real robot."
}