{
    "title": "A Formal Transaction Cost-Based Analysis of the Economic Feasibility of Data Spaces and Service Ecosystems. (arXiv:2310.03157v1 [econ.TH])",
    "abstract": "Data spaces and service ecosystems such as Gaia-X are expected to fuel the emerging data economy. It is well known, however, that this type of network-based economic governance structures occupies a potentially unstable position between the two stable (governance) endpoints, namely the firm (i.e., hierarchical governance) and the (open) market (i.e., coordination through the monetary system).  This paper develops a formal (mathematical) theory of the economic value for (data or service) ecosystem participants by extending transaction costs economics using certain elements from service-dominant logic. Within this theory, we derive several theorems on (i) necessary conditions for the economic feasibility of ecosystem-based transactions, (ii) scaling requirements for ecosystem stability, and (iii) a generic feasibility condition for arbitrary data or service provider-consumer ecosystems. Finally, we present an algebraic definition of business ecosystems and relate it to existing informal ",
    "link": "http://arxiv.org/abs/2310.03157",
    "context": "Title: A Formal Transaction Cost-Based Analysis of the Economic Feasibility of Data Spaces and Service Ecosystems. (arXiv:2310.03157v1 [econ.TH])\nAbstract: Data spaces and service ecosystems such as Gaia-X are expected to fuel the emerging data economy. It is well known, however, that this type of network-based economic governance structures occupies a potentially unstable position between the two stable (governance) endpoints, namely the firm (i.e., hierarchical governance) and the (open) market (i.e., coordination through the monetary system).  This paper develops a formal (mathematical) theory of the economic value for (data or service) ecosystem participants by extending transaction costs economics using certain elements from service-dominant logic. Within this theory, we derive several theorems on (i) necessary conditions for the economic feasibility of ecosystem-based transactions, (ii) scaling requirements for ecosystem stability, and (iii) a generic feasibility condition for arbitrary data or service provider-consumer ecosystems. Finally, we present an algebraic definition of business ecosystems and relate it to existing informal ",
    "path": "papers/23/10/2310.03157.json",
    "total_tokens": 971,
    "translated_title": "数据空间和服务生态的经济可行性的正式交易成本分析",
    "translated_abstract": "数据空间和服务生态（如Gaia-X）被期望推动新兴的数据经济。然而，众所周知，这种基于网络的经济治理结构在两个稳定的（治理）端点之间占据了一个潜在不稳定的位置，即公司（即分层治理）和（开放的）市场（即通过货币系统协调）。本文通过使用服务主导逻辑的某些元素，基于交易成本经济学，发展了一个关于（数据或服务）生态系统参与者经济价值的正式（数学）理论。在该理论框架内，我们推导出几个关于生态系统交易经济可行性的必要条件、生态系统稳定性的规模要求和任意数据或服务提供者-消费者生态系统的一般可行性条件的定理。最后，我们提出了业务生态系统的代数定义，并将其与现有的非正式概念进行了联系。",
    "tldr": "本文通过扩展交易成本经济学和服务主导逻辑，发展了一个正式的理论框架来分析数据空间和服务生态的经济可行性。其贡献包括对生态系统交易经济可行性的必要条件、生态系统稳定性的规模要求和任意数据或服务提供者-消费者生态系统的一般可行性条件的推导，并提出了业务生态系统的代数定义。"
}