{
    "title": "CosmosDSR -- a methodology for automated detection and tracking of orbital debris using the Unscented Kalman Filter. (arXiv:2310.17158v1 [astro-ph.EP])",
    "abstract": "The Kessler syndrome refers to the escalating space debris from frequent space activities, threatening future space exploration. Addressing this issue is vital. Several AI models, including Convolutional Neural Networks (CNN), Kernel Principal Component Analysis (KPCA), and Model-Agnostic Meta-Learning (MAML), have been assessed with various data types. Earlier studies highlighted the combination of the YOLO object detector and a linear Kalman filter for object detection and tracking. Building on this, our project introduces CosmosDSR, a novel methodology combining YOLOv3 with an Unscented Kalman Filter for tracking satellites in sequential images, compared to a linear Kalman filter. Using the SPARK dataset from the University of Luxembourg for training and testing, the YOLOv3 precisely detected and classified all satellite categories (mAP=97.18%, F1=0.95) with few errors (TP=4163, FP=209, FN=237). Both CosmosDSR and the LKF tracked satellites accurately (UKF: MSE=2.83/RMSE=1.66, LKF: ",
    "link": "http://arxiv.org/abs/2310.17158",
    "context": "Title: CosmosDSR -- a methodology for automated detection and tracking of orbital debris using the Unscented Kalman Filter. (arXiv:2310.17158v1 [astro-ph.EP])\nAbstract: The Kessler syndrome refers to the escalating space debris from frequent space activities, threatening future space exploration. Addressing this issue is vital. Several AI models, including Convolutional Neural Networks (CNN), Kernel Principal Component Analysis (KPCA), and Model-Agnostic Meta-Learning (MAML), have been assessed with various data types. Earlier studies highlighted the combination of the YOLO object detector and a linear Kalman filter for object detection and tracking. Building on this, our project introduces CosmosDSR, a novel methodology combining YOLOv3 with an Unscented Kalman Filter for tracking satellites in sequential images, compared to a linear Kalman filter. Using the SPARK dataset from the University of Luxembourg for training and testing, the YOLOv3 precisely detected and classified all satellite categories (mAP=97.18%, F1=0.95) with few errors (TP=4163, FP=209, FN=237). Both CosmosDSR and the LKF tracked satellites accurately (UKF: MSE=2.83/RMSE=1.66, LKF: ",
    "path": "papers/23/10/2310.17158.json",
    "total_tokens": 1022,
    "translated_title": "CosmosDSR -- 一种使用无味卡尔曼滤波器自动检测和跟踪轨道碎片的方法论",
    "translated_abstract": "Kessler综合征是指频繁的太空活动产生的升级的太空碎片，威胁到未来的太空探索。解决这个问题至关重要。过去的研究强调了YOLO目标检测器和线性卡尔曼滤波器的组合用于物体检测和跟踪。在此基础上，我们的项目引入了CosmosDSR，一种新颖的方法，将YOLOv3与无味卡尔曼滤波器结合起来，用于在序列图像中跟踪卫星，与线性卡尔曼滤波器相比。使用卢森堡大学的SPARK数据集进行训练和测试，YOLOv3准确地检测和分类了所有卫星类别（mAP=97.18％，F1=0.95），出现了少量错误（TP=4163，FP=209，FN=237）。CosmosDSR和LKF都准确跟踪卫星（UKF：MSE=2.83/RMSE=1.66，LKF：...",
    "tldr": "CosmosDSR是一种新颖的方法，将YOLOv3与无味卡尔曼滤波器结合起来，用于自动检测和跟踪轨道碎片。在使用SPARK数据集进行训练和测试时，YOLOv3表现出很高的准确度，并且CosmosDSR和LKF都能准确地跟踪卫星。",
    "en_tdlr": "CosmosDSR is a novel methodology that combines YOLOv3 with an Unscented Kalman Filter for automated detection and tracking of orbital debris. With high accuracy in the SPARK dataset, both YOLOv3 and CosmosDSR accurately detect and track satellites."
}