{
    "title": "Eliciting Model Steering Interactions from Users via Data and Visual Design Probes. (arXiv:2310.09314v1 [cs.HC])",
    "abstract": "Domain experts increasingly use automated data science tools to incorporate machine learning (ML) models in their work but struggle to \"debug\" these models when they are incorrect. For these experts, semantic interactions can provide an accessible avenue to guide and refine ML models without having to programmatically dive into its technical details. In this research, we conduct an elicitation study using data and visual design probes to examine if and how experts with a spectrum of ML expertise use semantic interactions to update a simple classification model. We use our design probes to facilitate an interactive dialogue with 20 participants and codify their interactions as a set of target-interaction pairs. Interestingly, our findings revealed that many targets of semantic interactions do not directly map to ML model parameters, but instead aim to augment the data a model uses for training. We also identify reasons that participants would hesitate to interact with ML models, includi",
    "link": "http://arxiv.org/abs/2310.09314",
    "context": "Title: Eliciting Model Steering Interactions from Users via Data and Visual Design Probes. (arXiv:2310.09314v1 [cs.HC])\nAbstract: Domain experts increasingly use automated data science tools to incorporate machine learning (ML) models in their work but struggle to \"debug\" these models when they are incorrect. For these experts, semantic interactions can provide an accessible avenue to guide and refine ML models without having to programmatically dive into its technical details. In this research, we conduct an elicitation study using data and visual design probes to examine if and how experts with a spectrum of ML expertise use semantic interactions to update a simple classification model. We use our design probes to facilitate an interactive dialogue with 20 participants and codify their interactions as a set of target-interaction pairs. Interestingly, our findings revealed that many targets of semantic interactions do not directly map to ML model parameters, but instead aim to augment the data a model uses for training. We also identify reasons that participants would hesitate to interact with ML models, includi",
    "path": "papers/23/10/2310.09314.json",
    "total_tokens": 891,
    "translated_title": "通过数据和可视化设计探针从用户那里引出模型调整交互",
    "translated_abstract": "领域专家越来越多地使用自动化数据科学工具将机器学习（ML）模型纳入工作中，但在这些模型错误时很难进行“调试”。对于这些专家来说，语义交互可以提供一种可访问的途径，以引导和完善ML模型，而无需深入其技术细节。在本研究中，我们使用数据和可视化设计探针进行调查研究，以检查具有各种ML专业知识的专家如何使用语义交互来更新简单的分类模型。我们使用设计探针与20个参与者进行交互式对话，并将其交互行为编码为一组目标-交互对。有趣的是，我们的研究结果显示，许多语义交互的目标并不直接映射到ML模型参数，而是旨在增强模型用于训练的数据。我们还确定了参与者对于与ML模型进行交互犹豫的原因，包括...",
    "tldr": "本研究使用数据和可视化设计探针来研究领域专家如何通过语义交互更新分类模型，发现许多语义交互的目标是增强模型的训练数据，而不是直接调整模型参数。",
    "en_tdlr": "This research examines how domain experts update classification models through semantic interactions using data and visual design probes. The study found that many semantic interactions aim to augment training data rather than directly adjusting model parameters."
}