{
    "title": "Evaluating General-Purpose AI with Psychometrics. (arXiv:2310.16379v1 [cs.AI])",
    "abstract": "Artificial intelligence (AI) has witnessed an evolution from task-specific to general-purpose systems that trend toward human versatility. As AI systems begin to play pivotal roles in society, it is important to ensure that they are adequately evaluated. Current AI benchmarks typically assess performance on collections of specific tasks. This has drawbacks when used for assessing general-purpose AI systems. First, it is difficult to predict whether AI systems could complete a new task it has never seen or that did not previously exist. Second, these benchmarks often focus on overall performance metrics, potentially overlooking the finer details crucial for making informed decisions. Lastly, there are growing concerns about the reliability of existing benchmarks and questions about what is being measured. To solve these challenges, this paper suggests that psychometrics, the science of psychological measurement, should be placed at the core of evaluating general-purpose AI. Psychometric",
    "link": "http://arxiv.org/abs/2310.16379",
    "context": "Title: Evaluating General-Purpose AI with Psychometrics. (arXiv:2310.16379v1 [cs.AI])\nAbstract: Artificial intelligence (AI) has witnessed an evolution from task-specific to general-purpose systems that trend toward human versatility. As AI systems begin to play pivotal roles in society, it is important to ensure that they are adequately evaluated. Current AI benchmarks typically assess performance on collections of specific tasks. This has drawbacks when used for assessing general-purpose AI systems. First, it is difficult to predict whether AI systems could complete a new task it has never seen or that did not previously exist. Second, these benchmarks often focus on overall performance metrics, potentially overlooking the finer details crucial for making informed decisions. Lastly, there are growing concerns about the reliability of existing benchmarks and questions about what is being measured. To solve these challenges, this paper suggests that psychometrics, the science of psychological measurement, should be placed at the core of evaluating general-purpose AI. Psychometric",
    "path": "papers/23/10/2310.16379.json",
    "total_tokens": 797,
    "translated_title": "用心理测量学评估通用人工智能",
    "translated_abstract": "人工智能（AI）已经从特定任务向通用系统的发展，趋向于人类的多功能性。随着AI系统开始在社会中发挥重要作用，确保对其进行充分评估变得很重要。目前的AI基准通常在特定任务集合上评估性能。然而，对于评估通用AI系统来说，这有一些缺点。首先，很难预测AI系统是否能完成一项它从未见过或之前不存在的新任务。其次，这些基准常常关注整体性能指标，可能忽视了对做出明智决策至关重要的细节。最后，对现有基准的可靠性存在越来越多的担忧，并对正在进行的测量提出了疑问。为解决这些挑战，本文建议将心理测量学，即心理测量的科学，放在评估通用AI的核心位置。",
    "tldr": "本文提出将心理测量学放在评估通用人工智能的核心位置，以解决传统基准的一些挑战和缺点。",
    "en_tdlr": "This paper suggests placing psychometrics at the core of evaluating general-purpose AI to address the challenges and drawbacks of traditional benchmarks."
}