{
    "title": "Chinese Painting Style Transfer Using Deep Generative Models. (arXiv:2310.09978v2 [cs.CV] UPDATED)",
    "abstract": "Artistic style transfer aims to modify the style of the image while preserving its content. Style transfer using deep learning models has been widely studied since 2015, and most of the applications are focused on specific artists like Van Gogh, Monet, Cezanne. There are few researches and applications on traditional Chinese painting style transfer. In this paper, we will study and leverage different state-of-the-art deep generative models for Chinese painting style transfer and evaluate the performance both qualitatively and quantitatively. In addition, we propose our own algorithm that combines several style transfer models for our task. Specifically, we will transfer two main types of traditional Chinese painting style, known as \"Gong-bi\" and \"Shui-mo\" (to modern images like nature objects, portraits and landscapes.",
    "link": "http://arxiv.org/abs/2310.09978",
    "context": "Title: Chinese Painting Style Transfer Using Deep Generative Models. (arXiv:2310.09978v2 [cs.CV] UPDATED)\nAbstract: Artistic style transfer aims to modify the style of the image while preserving its content. Style transfer using deep learning models has been widely studied since 2015, and most of the applications are focused on specific artists like Van Gogh, Monet, Cezanne. There are few researches and applications on traditional Chinese painting style transfer. In this paper, we will study and leverage different state-of-the-art deep generative models for Chinese painting style transfer and evaluate the performance both qualitatively and quantitatively. In addition, we propose our own algorithm that combines several style transfer models for our task. Specifically, we will transfer two main types of traditional Chinese painting style, known as \"Gong-bi\" and \"Shui-mo\" (to modern images like nature objects, portraits and landscapes.",
    "path": "papers/23/10/2310.09978.json",
    "total_tokens": 802,
    "translated_title": "使用深度生成模型进行中国绘画风格转换",
    "translated_abstract": "艺术风格转换旨在在保留图像内容的同时修改其风格。自2015年以来，使用深度学习模型进行风格转换已经被广泛研究，大多数应用都集中在像梵高、莫奈、塞尚这样的特定艺术家上。然而，在传统中国绘画风格转换方面的研究和应用较少。本文将研究和利用不同的最新深度生成模型进行中国绘画风格转换，并在定性和定量方面评估其性能。此外，我们还提出了一种结合了几种风格转换模型的算法。具体而言，我们将把传统中国绘画的两种主要风格，即“工笔”和“水墨”，应用到现代图像中，如自然对象、肖像和风景。",
    "tldr": "本文研究和利用不同的深度生成模型进行中国绘画风格转换，并提出了一种结合了多种模型的算法。在定性和定量方面评估了其性能。",
    "en_tdlr": "This paper studies and utilizes different deep generative models for Chinese painting style transfer, and proposes an algorithm that combines multiple models. The performance is evaluated qualitatively and quantitatively."
}