{
    "title": "Light Schr\\\"odinger Bridge",
    "abstract": "arXiv:2310.01174v2 Announce Type: replace  Abstract: Despite the recent advances in the field of computational Schrodinger Bridges (SB), most existing SB solvers are still heavy-weighted and require complex optimization of several neural networks. It turns out that there is no principal solver which plays the role of simple-yet-effective baseline for SB just like, e.g., $k$-means method in clustering, logistic regression in classification or Sinkhorn algorithm in discrete optimal transport. We address this issue and propose a novel fast and simple SB solver. Our development is a smart combination of two ideas which recently appeared in the field: (a) parameterization of the Schrodinger potentials with sum-exp quadratic functions and (b) viewing the log-Schrodinger potentials as the energy functions. We show that combined together these ideas yield a lightweight, simulation-free and theoretically justified SB solver with a simple straightforward optimization objective. As a result, it a",
    "link": "https://arxiv.org/abs/2310.01174",
    "context": "Title: Light Schr\\\"odinger Bridge\nAbstract: arXiv:2310.01174v2 Announce Type: replace  Abstract: Despite the recent advances in the field of computational Schrodinger Bridges (SB), most existing SB solvers are still heavy-weighted and require complex optimization of several neural networks. It turns out that there is no principal solver which plays the role of simple-yet-effective baseline for SB just like, e.g., $k$-means method in clustering, logistic regression in classification or Sinkhorn algorithm in discrete optimal transport. We address this issue and propose a novel fast and simple SB solver. Our development is a smart combination of two ideas which recently appeared in the field: (a) parameterization of the Schrodinger potentials with sum-exp quadratic functions and (b) viewing the log-Schrodinger potentials as the energy functions. We show that combined together these ideas yield a lightweight, simulation-free and theoretically justified SB solver with a simple straightforward optimization objective. As a result, it a",
    "path": "papers/23/10/2310.01174.json",
    "total_tokens": 881,
    "translated_title": "光谢尔宾格桥",
    "translated_abstract": "尽管计算谢尔宾格桥（SB）领域取得了最新进展，但大多数现有的SB求解器仍然过重，并需要对多个神经网络进行复杂优化。事实证明，目前不存在主要的求解器可以像聚类中的$k$-means方法、分类中的逻辑回归或离散最优输运中的Sinkhorn算法那样起到简单而有效的基准作用。我们解决了这个问题，提出了一种新颖的快速简单的SB求解器。我们的方法是最近出现在该领域的两个观点的巧妙结合：（a）使用总和-指数二次函数对谢尔宾格势能进行参数化，（b）将对数谢尔宾格势能视为能量函数。我们展示了将这些观点结合起来，可以产生一个轻量级、无需模拟且在理论上证明合理的SB求解器，具有简单直接的优化目标。因此，它是",
    "tldr": "提出了一种新颖的光谢尔宾格桥快速简单求解器，将谢尔宾格势能参数化为总和-指数二次函数，视为能量函数，实现了轻量级、无需模拟、理论上合理的求解器设计。",
    "en_tdlr": "Introduced a novel fast and simple solver for Light Schrödinger Bridge, by parameterizing the Schrödinger potentials with sum-exp quadratic functions and viewing log-Schrödinger potentials as energy functions, achieving a lightweight, simulation-free, and theoretically justified solver design."
}