{
    "title": "Reimagining Synthetic Tabular Data Generation through Data-Centric AI: A Comprehensive Benchmark. (arXiv:2310.16981v1 [cs.LG])",
    "abstract": "Synthetic data serves as an alternative in training machine learning models, particularly when real-world data is limited or inaccessible. However, ensuring that synthetic data mirrors the complex nuances of real-world data is a challenging task. This paper addresses this issue by exploring the potential of integrating data-centric AI techniques which profile the data to guide the synthetic data generation process. Moreover, we shed light on the often ignored consequences of neglecting these data profiles during synthetic data generation -- despite seemingly high statistical fidelity. Subsequently, we propose a novel framework to evaluate the integration of data profiles to guide the creation of more representative synthetic data. In an empirical study, we evaluate the performance of five state-of-the-art models for tabular data generation on eleven distinct tabular datasets. The findings offer critical insights into the successes and limitations of current synthetic data generation te",
    "link": "http://arxiv.org/abs/2310.16981",
    "context": "Title: Reimagining Synthetic Tabular Data Generation through Data-Centric AI: A Comprehensive Benchmark. (arXiv:2310.16981v1 [cs.LG])\nAbstract: Synthetic data serves as an alternative in training machine learning models, particularly when real-world data is limited or inaccessible. However, ensuring that synthetic data mirrors the complex nuances of real-world data is a challenging task. This paper addresses this issue by exploring the potential of integrating data-centric AI techniques which profile the data to guide the synthetic data generation process. Moreover, we shed light on the often ignored consequences of neglecting these data profiles during synthetic data generation -- despite seemingly high statistical fidelity. Subsequently, we propose a novel framework to evaluate the integration of data profiles to guide the creation of more representative synthetic data. In an empirical study, we evaluate the performance of five state-of-the-art models for tabular data generation on eleven distinct tabular datasets. The findings offer critical insights into the successes and limitations of current synthetic data generation te",
    "path": "papers/23/10/2310.16981.json",
    "total_tokens": 869,
    "translated_title": "通过数据中心的AI重新构想合成表格数据生成：一个全面的基准",
    "translated_abstract": "合成数据在训练机器学习模型时是现实世界数据有限或无法访问的替代品。然而，确保合成数据反映现实世界数据的复杂细微差异是一项具有挑战性的任务。本文通过探索整合数据中心的AI技术的潜力，来指导合成数据生成过程，解决了这个问题。此外，我们还揭示了在合成数据生成过程中忽视这些数据配置文件的常常被忽视的后果，尽管看似统计上高度真实。随后，我们提出了一个新的框架来评估集成数据配置文件以指导更具代表性的合成数据的创建。在一项实证研究中，我们评估了五个最先进的表格数据生成模型在十一个不同的表格数据集上的性能。研究结果对当前合成数据生成技术的成功和限制提供了关键见解。",
    "tldr": "本文通过整合数据中心的AI技术，解决了合成数据生成过程中反映真实世界数据复杂细微差异的问题。通过提出新的评估框架，研究对合成数据生成技术的成功和限制提供了关键见解。",
    "en_tdlr": "This paper solves the problem of reflecting the complex nuances of real-world data in synthetic data generation through integrating data-centric AI techniques. The research provides critical insights into the successes and limitations of current synthetic data generation methods by proposing a novel evaluation framework."
}