{
    "title": "2SFGL: A Simple And Robust Protocol For Graph-Based Fraud Detection. (arXiv:2310.08335v1 [cs.CR])",
    "abstract": "Financial crime detection using graph learning improves financial safety and efficiency. However, criminals may commit financial crimes across different institutions to avoid detection, which increases the difficulty of detection for financial institutions which use local data for graph learning. As most financial institutions are subject to strict regulations in regards to data privacy protection, the training data is often isolated and conventional learning technology cannot handle the problem. Federated learning (FL) allows multiple institutions to train a model without revealing their datasets to each other, hence ensuring data privacy protection. In this paper, we proposes a novel two-stage approach to federated graph learning (2SFGL): The first stage of 2SFGL involves the virtual fusion of multiparty graphs, and the second involves model training and inference on the virtual graph. We evaluate our framework on a conventional fraud detection task based on the FraudAmazonDataset an",
    "link": "http://arxiv.org/abs/2310.08335",
    "context": "Title: 2SFGL: A Simple And Robust Protocol For Graph-Based Fraud Detection. (arXiv:2310.08335v1 [cs.CR])\nAbstract: Financial crime detection using graph learning improves financial safety and efficiency. However, criminals may commit financial crimes across different institutions to avoid detection, which increases the difficulty of detection for financial institutions which use local data for graph learning. As most financial institutions are subject to strict regulations in regards to data privacy protection, the training data is often isolated and conventional learning technology cannot handle the problem. Federated learning (FL) allows multiple institutions to train a model without revealing their datasets to each other, hence ensuring data privacy protection. In this paper, we proposes a novel two-stage approach to federated graph learning (2SFGL): The first stage of 2SFGL involves the virtual fusion of multiparty graphs, and the second involves model training and inference on the virtual graph. We evaluate our framework on a conventional fraud detection task based on the FraudAmazonDataset an",
    "path": "papers/23/10/2310.08335.json",
    "total_tokens": 958,
    "translated_title": "2SFGL：一种用于基于图的欺诈检测的简单而健壮的协议",
    "translated_abstract": "使用图学习进行金融犯罪检测可以提高金融安全和效率。然而，犯罪分子可能在不同机构之间进行金融犯罪，以避免被发现，这增加了金融机构使用本地数据进行图学习的难度。由于大多数金融机构在数据隐私保护方面受到严格的监管，训练数据通常是孤立的，传统的学习技术无法解决这个问题。联邦学习（FL）允许多个机构在不将数据集展示给其他机构的情况下训练模型，从而确保数据隐私保护。在本文中，我们提出了一种新颖的联邦图学习（2SFGL）方法：2SFGL的第一阶段涉及多方图的虚拟融合，第二阶段涉及在虚拟图上进行模型训练和推理。我们在传统欺诈检测任务FraudAmazonDataset上评估了我们的框架。",
    "tldr": "本论文提出了一种简单而健壮的协议2SFGL，用于基于图的欺诈检测。该协议采用联邦学习的方式，通过虚拟融合多方图并在虚拟图上进行模型训练和推理，来解决因金融犯罪跨机构造成的数据隐私保护问题。",
    "en_tdlr": "This paper proposes a simple and robust protocol, 2SFGL, for graph-based fraud detection. The protocol utilizes federated learning to address the data privacy protection issue caused by financial crimes committed across different institutions. It involves the virtual fusion of multiparty graphs and model training and inference on the virtual graph."
}