{
    "title": "Robust and Efficient Interference Neural Networks for Defending Against Adversarial Attacks in ImageNet. (arXiv:2310.05947v1 [cs.CV])",
    "abstract": "The existence of adversarial images has seriously affected the task of image recognition and practical application of deep learning, it is also a key scientific problem that deep learning urgently needs to solve. By far the most effective approach is to train the neural network with a large number of adversarial examples. However, this adversarial training method requires a huge amount of computing resources when applied to ImageNet, and has not yet achieved satisfactory results for high-intensity adversarial attacks. In this paper, we construct an interference neural network by applying additional background images and corresponding labels, and use pre-trained ResNet-152 to efficiently complete the training. Compared with the state-of-the-art results under the PGD attack, it has a better defense effect with much smaller computing resources. This work provides new ideas for academic research and practical applications of effective defense against adversarial attacks.",
    "link": "http://arxiv.org/abs/2310.05947",
    "context": "Title: Robust and Efficient Interference Neural Networks for Defending Against Adversarial Attacks in ImageNet. (arXiv:2310.05947v1 [cs.CV])\nAbstract: The existence of adversarial images has seriously affected the task of image recognition and practical application of deep learning, it is also a key scientific problem that deep learning urgently needs to solve. By far the most effective approach is to train the neural network with a large number of adversarial examples. However, this adversarial training method requires a huge amount of computing resources when applied to ImageNet, and has not yet achieved satisfactory results for high-intensity adversarial attacks. In this paper, we construct an interference neural network by applying additional background images and corresponding labels, and use pre-trained ResNet-152 to efficiently complete the training. Compared with the state-of-the-art results under the PGD attack, it has a better defense effect with much smaller computing resources. This work provides new ideas for academic research and practical applications of effective defense against adversarial attacks.",
    "path": "papers/23/10/2310.05947.json",
    "total_tokens": 900,
    "translated_title": "鲁棒高效的干扰神经网络用于防御ImageNet中的对抗攻击",
    "translated_abstract": "对抗图像的存在严重影响了图像识别任务和深度学习的实际应用，也是深度学习急需解决的关键科学问题。到目前为止最有效的方法是用大量对抗样本训练神经网络。然而，当应用于ImageNet时，这种对抗训练方法需要大量的计算资源，并且在高强度对抗攻击下尚未取得令人满意的结果。本文通过应用额外背景图像和相应标签构建干扰神经网络，并使用预训练的ResNet-152来高效完成训练。与PGD攻击下的最新技术结果相比，它具有更好的防御效果并需要更少的计算资源。这项工作为防御对抗攻击提供了学术研究和实际应用的新思路。",
    "tldr": "本文构建了一个干扰神经网络来防御ImageNet中的对抗攻击，通过应用额外背景图像和相应标签，并使用预训练的ResNet-152来高效完成训练。与PGD攻击下的最新技术结果相比，它具有更好的防御效果并需要更少的计算资源。",
    "en_tdlr": "This paper constructs an interference neural network to defend against adversarial attacks in ImageNet, by applying additional background images and corresponding labels, and utilizing the pre-trained ResNet-152 for efficient training. It achieves better defense results with fewer computing resources compared to state-of-the-art techniques under the PGD attack."
}