{
    "title": "PsyCoT: Psychological Questionnaire as Powerful Chain-of-Thought for Personality Detection. (arXiv:2310.20256v1 [cs.CL])",
    "abstract": "Recent advances in large language models (LLMs), such as ChatGPT, have showcased remarkable zero-shot performance across various NLP tasks. However, the potential of LLMs in personality detection, which involves identifying an individual's personality from their written texts, remains largely unexplored. Drawing inspiration from Psychological Questionnaires, which are carefully designed by psychologists to evaluate individual personality traits through a series of targeted items, we argue that these items can be regarded as a collection of well-structured chain-of-thought (CoT) processes. By incorporating these processes, LLMs can enhance their capabilities to make more reasonable inferences on personality from textual input. In light of this, we propose a novel personality detection method, called PsyCoT, which mimics the way individuals complete psychological questionnaires in a multi-turn dialogue manner. In particular, we employ a LLM as an AI assistant with a specialization in tex",
    "link": "http://arxiv.org/abs/2310.20256",
    "context": "Title: PsyCoT: Psychological Questionnaire as Powerful Chain-of-Thought for Personality Detection. (arXiv:2310.20256v1 [cs.CL])\nAbstract: Recent advances in large language models (LLMs), such as ChatGPT, have showcased remarkable zero-shot performance across various NLP tasks. However, the potential of LLMs in personality detection, which involves identifying an individual's personality from their written texts, remains largely unexplored. Drawing inspiration from Psychological Questionnaires, which are carefully designed by psychologists to evaluate individual personality traits through a series of targeted items, we argue that these items can be regarded as a collection of well-structured chain-of-thought (CoT) processes. By incorporating these processes, LLMs can enhance their capabilities to make more reasonable inferences on personality from textual input. In light of this, we propose a novel personality detection method, called PsyCoT, which mimics the way individuals complete psychological questionnaires in a multi-turn dialogue manner. In particular, we employ a LLM as an AI assistant with a specialization in tex",
    "path": "papers/23/10/2310.20256.json",
    "total_tokens": 863,
    "translated_title": "PsyCoT: 将心理问卷作为强大的思维链条用于个性检测",
    "translated_abstract": "最近大型语言模型（LLM）的进展，如ChatGPT，展示了在各种NLP任务中remarkable的零-shot表现。然而，LLM在个性检测方面的潜力，即通过写作文本来识别个体的个性，仍然未被充分探索。受到心理问卷的启发，心理问卷由心理学家精心设计，通过一系列有针对性的项目评估个体的个性特征，我们认为这些项目可以被视为一组良好结构化的思维链条过程。通过整合这些过程，LLM可以增强其从文本输入中对个性的合理推断能力。基于此，我们提出了一种新颖的个性检测方法，称为PsyCoT，它模仿个体以多轮对话方式完成心理问卷的方式。具体而言，我们将LLM作为一个在文本处理方向上具有专长的AI助手使用。",
    "tldr": "提出一种名为PsyCoT的新颖个性检测方法，将心理问卷作为思维链条进行个性识别，并利用大型语言模型来增强对个性的合理推断能力。",
    "en_tdlr": "Proposed a novel personality detection method, called PsyCoT, which uses psychological questionnaires as chain-of-thought processes for personality identification, and leverages large language models to enhance reasonable inference on personality traits from textual input."
}