{
    "title": "Trust, Accountability, and Autonomy in Knowledge Graph-based AI for Self-determination. (arXiv:2310.19503v2 [cs.AI] UPDATED)",
    "abstract": "Knowledge Graphs (KGs) have emerged as fundamental platforms for powering intelligent decision-making and a wide range of Artificial Intelligence (AI) services across major corporations such as Google, Walmart, and AirBnb. KGs complement Machine Learning (ML) algorithms by providing data context and semantics, thereby enabling further inference and question-answering capabilities. The integration of KGs with neuronal learning (e.g., Large Language Models (LLMs)) is currently a topic of active research, commonly named neuro-symbolic AI. Despite the numerous benefits that can be accomplished with KG-based AI, its growing ubiquity within online services may result in the loss of self-determination for citizens as a fundamental societal issue. The more we rely on these technologies, which are often centralised, the less citizens will be able to determine their own destinies. To counter this threat, AI regulation, such as the European Union (EU) AI Act, is being proposed in certain regions.",
    "link": "http://arxiv.org/abs/2310.19503",
    "context": "Title: Trust, Accountability, and Autonomy in Knowledge Graph-based AI for Self-determination. (arXiv:2310.19503v2 [cs.AI] UPDATED)\nAbstract: Knowledge Graphs (KGs) have emerged as fundamental platforms for powering intelligent decision-making and a wide range of Artificial Intelligence (AI) services across major corporations such as Google, Walmart, and AirBnb. KGs complement Machine Learning (ML) algorithms by providing data context and semantics, thereby enabling further inference and question-answering capabilities. The integration of KGs with neuronal learning (e.g., Large Language Models (LLMs)) is currently a topic of active research, commonly named neuro-symbolic AI. Despite the numerous benefits that can be accomplished with KG-based AI, its growing ubiquity within online services may result in the loss of self-determination for citizens as a fundamental societal issue. The more we rely on these technologies, which are often centralised, the less citizens will be able to determine their own destinies. To counter this threat, AI regulation, such as the European Union (EU) AI Act, is being proposed in certain regions.",
    "path": "papers/23/10/2310.19503.json",
    "total_tokens": 899,
    "translated_title": "基于知识图谱的自主决策AI中的信任、问责和自主性",
    "translated_abstract": "知识图谱成为了推动智能决策和各种人工智能服务的基础平台，被谷歌、沃尔玛和AirBnb等主要公司广泛采用。知识图谱通过提供数据上下文和语义来补充机器学习算法，从而实现进一步的推理和问答能力。将知识图谱与神经网络学习（例如大型语言模型）结合起来的研究被称为神经符号人工智能。尽管基于知识图谱的人工智能可以带来许多好处，但其在在线服务中越来越普及可能导致市民失去自主决策的问题。我们越依赖这些通常是集中化的技术，市民就越无法决定自己的命运。为了应对这一威胁，在某些地区提出了人工智能管制，例如欧盟的人工智能法案。",
    "tldr": "基于知识图谱的人工智能技术带来了许多好处，但其普及可能导致市民的自主决策权受限。为了解决这个问题，一些地区提出了人工智能管制措施。",
    "en_tdlr": "KG-based AI technologies have many benefits, but their widespread adoption may limit citizens' self-determination. To address this issue, AI regulation is being proposed in some regions."
}