{
    "title": "Pixel-Level Clustering Network for Unsupervised Image Segmentation. (arXiv:2310.16234v1 [cs.CV])",
    "abstract": "While image segmentation is crucial in various computer vision applications, such as autonomous driving, grasping, and robot navigation, annotating all objects at the pixel-level for training is nearly impossible. Therefore, the study of unsupervised image segmentation methods is essential. In this paper, we present a pixel-level clustering framework for segmenting images into regions without using ground truth annotations. The proposed framework includes feature embedding modules with an attention mechanism, a feature statistics computing module, image reconstruction, and superpixel segmentation to achieve accurate unsupervised segmentation. Additionally, we propose a training strategy that utilizes intra-consistency within each superpixel, inter-similarity/dissimilarity between neighboring superpixels, and structural similarity between images. To avoid potential over-segmentation caused by superpixel-based losses, we also propose a post-processing method. Furthermore, we present an e",
    "link": "http://arxiv.org/abs/2310.16234",
    "context": "Title: Pixel-Level Clustering Network for Unsupervised Image Segmentation. (arXiv:2310.16234v1 [cs.CV])\nAbstract: While image segmentation is crucial in various computer vision applications, such as autonomous driving, grasping, and robot navigation, annotating all objects at the pixel-level for training is nearly impossible. Therefore, the study of unsupervised image segmentation methods is essential. In this paper, we present a pixel-level clustering framework for segmenting images into regions without using ground truth annotations. The proposed framework includes feature embedding modules with an attention mechanism, a feature statistics computing module, image reconstruction, and superpixel segmentation to achieve accurate unsupervised segmentation. Additionally, we propose a training strategy that utilizes intra-consistency within each superpixel, inter-similarity/dissimilarity between neighboring superpixels, and structural similarity between images. To avoid potential over-segmentation caused by superpixel-based losses, we also propose a post-processing method. Furthermore, we present an e",
    "path": "papers/23/10/2310.16234.json",
    "total_tokens": 1027,
    "translated_title": "无监督图像分割的像素级聚类网络",
    "translated_abstract": "尽管图像分割在各种计算机视觉应用中都至关重要，如自动驾驶、抓取和机器人导航，但为训练所有像素级别上的对象进行注释几乎是不可能的。因此，研究无监督图像分割方法非常重要。在本文中，我们提出了一个像素级聚类框架，将图像分割成区域，而不使用地面真值注释。所提出的框架包括具有注意机制的特征嵌入模块、特征统计计算模块、图像重构和超像素分割，以实现准确的无监督分割。此外，我们提出了一种训练策略，利用每个超像素内部一致性、邻近超像素之间的相似性/不相似性以及图像的结构相似性。为了避免超像素损失引起的过分分割，我们还提出了一种后处理方法。此外，我们还介绍了一种新的评价指标，用于评估分割性能并与现有方法进行比较。",
    "tldr": "本文提出了一个无监督的像素级聚类框架，用于将图像分割成区域，而不需要使用地面真值注释。通过特征嵌入、特征统计计算、图像重构和超像素分割等模块，以及利用超像素内部一致性和邻近超像素之间的相似性/不相似性进行训练策略，实现了准确的无监督分割。此外，还提出了后处理方法来避免过分分割。"
}