{
    "title": "A Novel Skip Orthogonal List for Dynamic Optimal Transport Problem. (arXiv:2310.18446v4 [cs.DS] UPDATED)",
    "abstract": "Optimal transport is a fundamental topic that has attracted a great amount of attention from the optimization community in the past decades. In this paper, we consider an interesting discrete dynamic optimal transport problem: can we efficiently update the optimal transport plan when the weights or the locations of the data points change? This problem is naturally motivated by several applications in machine learning. For example, we often need to compute the optimal transport cost between two different data sets; if some changes happen to a few data points, should we re-compute the high complexity cost function or update the cost by some efficient dynamic data structure? We are aware that several dynamic maximum flow algorithms have been proposed before, however, the research on dynamic minimum cost flow problem is still quite limited, to the best of our knowledge. We propose a novel 2D Skip Orthogonal List together with some dynamic tree techniques. Although our algorithm is based on",
    "link": "http://arxiv.org/abs/2310.18446",
    "context": "Title: A Novel Skip Orthogonal List for Dynamic Optimal Transport Problem. (arXiv:2310.18446v4 [cs.DS] UPDATED)\nAbstract: Optimal transport is a fundamental topic that has attracted a great amount of attention from the optimization community in the past decades. In this paper, we consider an interesting discrete dynamic optimal transport problem: can we efficiently update the optimal transport plan when the weights or the locations of the data points change? This problem is naturally motivated by several applications in machine learning. For example, we often need to compute the optimal transport cost between two different data sets; if some changes happen to a few data points, should we re-compute the high complexity cost function or update the cost by some efficient dynamic data structure? We are aware that several dynamic maximum flow algorithms have been proposed before, however, the research on dynamic minimum cost flow problem is still quite limited, to the best of our knowledge. We propose a novel 2D Skip Orthogonal List together with some dynamic tree techniques. Although our algorithm is based on",
    "path": "papers/23/10/2310.18446.json",
    "total_tokens": 803,
    "translated_title": "动态最优传输问题的一种新型跳跃正交列表",
    "translated_abstract": "最优传输是过去几十年来引起了优化社区极大关注的一个基本主题。本文研究了一个有趣的离散动态最优传输问题：当数据点的权重或位置发生变化时，我们是否可以高效地更新最优传输方案？这个问题在机器学习中有多个应用。我们经常需要计算两个不同数据集之间的最优传输成本；如果一些数据点发生了变化，我们应该重新计算高复杂度的成本函数，还是通过一些高效的动态数据结构来更新成本？我们注意到先前已提出了几种动态最大流算法，但据我们所知，对于动态最小费用流问题的研究仍然非常有限。我们提出了一种新型的2D跳跃正交列表，结合一些动态树技术。",
    "tldr": "本论文提出了一种新型的跳跃正交列表来解决动态最优传输问题，在考虑数据点权重或位置变化时能够有效地更新最优传输方案。",
    "en_tdlr": "This paper proposes a novel skip orthogonal list to solve the dynamic optimal transport problem, allowing for efficient updates of the optimal transport plan when the weights or locations of the data points change."
}