{
    "title": "Beyond Sharing Weights in Decoupling Feature Learning Network for UAV RGB-Infrared Vehicle Re-Identification. (arXiv:2310.08026v1 [cs.CV])",
    "abstract": "Owing to the capacity of performing full-time target search, cross-modality vehicle re-identification (Re-ID) based on unmanned aerial vehicle (UAV) is gaining more attention in both video surveillance and public security. However, this promising and innovative research has not been studied sufficiently due to the data inadequacy issue. Meanwhile, the cross-modality discrepancy and orientation discrepancy challenges further aggravate the difficulty of this task. To this end, we pioneer a cross-modality vehicle Re-ID benchmark named UAV Cross-Modality Vehicle Re-ID (UCM-VeID), containing 753 identities with 16015 RGB and 13913 infrared images. Moreover, to meet cross-modality discrepancy and orientation discrepancy challenges, we present a hybrid weights decoupling network (HWDNet) to learn the shared discriminative orientation-invariant features. For the first challenge, we proposed a hybrid weights siamese network with a well-designed weight restrainer and its corresponding objective ",
    "link": "http://arxiv.org/abs/2310.08026",
    "context": "Title: Beyond Sharing Weights in Decoupling Feature Learning Network for UAV RGB-Infrared Vehicle Re-Identification. (arXiv:2310.08026v1 [cs.CV])\nAbstract: Owing to the capacity of performing full-time target search, cross-modality vehicle re-identification (Re-ID) based on unmanned aerial vehicle (UAV) is gaining more attention in both video surveillance and public security. However, this promising and innovative research has not been studied sufficiently due to the data inadequacy issue. Meanwhile, the cross-modality discrepancy and orientation discrepancy challenges further aggravate the difficulty of this task. To this end, we pioneer a cross-modality vehicle Re-ID benchmark named UAV Cross-Modality Vehicle Re-ID (UCM-VeID), containing 753 identities with 16015 RGB and 13913 infrared images. Moreover, to meet cross-modality discrepancy and orientation discrepancy challenges, we present a hybrid weights decoupling network (HWDNet) to learn the shared discriminative orientation-invariant features. For the first challenge, we proposed a hybrid weights siamese network with a well-designed weight restrainer and its corresponding objective ",
    "path": "papers/23/10/2310.08026.json",
    "total_tokens": 970,
    "translated_title": "超越权重共享的无人机RGB-红外车辆再识别特征学习网络",
    "translated_abstract": "由于能够全天候进行目标搜索，基于无人机的跨模态车辆再识别（Re-ID）在视频监控和公共安全领域越来越受关注。然而，由于数据不足的问题，这个有前景和创新的研究尚未得到充分的研究。与此同时，跨模态差异和旋向差异进一步增加了这一任务的难度。为此，我们首次提出了一个名为无人机跨模态车辆再识别（UCM-VeID）的跨模态车辆Re-ID基准，包含753个身份，16015个RGB图像和13913个红外图像。此外，为了应对跨模态差异和旋向差异的挑战，我们提出了一个混合权重分离网络（HWDNet），用于学习共享的判别性旋向不变特征。",
    "tldr": "本论文提出了一个基于无人机的跨模态车辆再识别（Re-ID）的创新研究，旨在解决数据不足、跨模态差异和旋向差异的问题。提出了一个跨模态车辆Re-ID基准，并设计了一个混合权重分离网络（HWDNet）来学习共享的判别性旋向不变特征。",
    "en_tdlr": "This paper presents an innovative research on cross-modality vehicle re-identification (Re-ID) based on unmanned aerial vehicle (UAV), aiming to address the issues of data inadequacy, cross-modality discrepancy, and orientation discrepancy. It proposes a benchmark for cross-modality vehicle Re-ID and designs a hybrid weight decoupling network (HWDNet) to learn shared discriminative orientation-invariant features."
}