{
    "title": "Analyzing and Improving OT-based Adversarial Networks. (arXiv:2310.02611v1 [cs.LG])",
    "abstract": "Optimal Transport (OT) problem aims to find a transport plan that bridges two distributions while minimizing a given cost function. OT theory has been widely utilized in generative modeling. In the beginning, OT distance has been used as a measure for assessing the distance between data and generated distributions. Recently, OT transport map between data and prior distributions has been utilized as a generative model. These OT-based generative models share a similar adversarial training objective. In this paper, we begin by unifying these OT-based adversarial methods within a single framework. Then, we elucidate the role of each component in training dynamics through a comprehensive analysis of this unified framework. Moreover, we suggest a simple but novel method that improves the previously best-performing OT-based model. Intuitively, our approach conducts a gradual refinement of the generated distribution, progressively aligning it with the data distribution. Our approach achieves a",
    "link": "http://arxiv.org/abs/2310.02611",
    "context": "Title: Analyzing and Improving OT-based Adversarial Networks. (arXiv:2310.02611v1 [cs.LG])\nAbstract: Optimal Transport (OT) problem aims to find a transport plan that bridges two distributions while minimizing a given cost function. OT theory has been widely utilized in generative modeling. In the beginning, OT distance has been used as a measure for assessing the distance between data and generated distributions. Recently, OT transport map between data and prior distributions has been utilized as a generative model. These OT-based generative models share a similar adversarial training objective. In this paper, we begin by unifying these OT-based adversarial methods within a single framework. Then, we elucidate the role of each component in training dynamics through a comprehensive analysis of this unified framework. Moreover, we suggest a simple but novel method that improves the previously best-performing OT-based model. Intuitively, our approach conducts a gradual refinement of the generated distribution, progressively aligning it with the data distribution. Our approach achieves a",
    "path": "papers/23/10/2310.02611.json",
    "total_tokens": 907,
    "translated_title": "分析和改进基于OT的对抗网络",
    "translated_abstract": "最优输运（OT）问题旨在找到一种输运方案，它在最小化给定的成本函数的同时连接两个分布。OT理论已经广泛应用于生成模型。最初，OT距离被用作评估数据和生成分布之间的距离的一种度量。最近，OT传输映射在数据和先验分布之间被用作生成模型。这些基于OT的生成模型具有相似的对抗训练目标。在本文中，我们首先在一个统一的框架中统一了这些基于OT的对抗方法。然后，通过对这个统一框架的全面分析，我们阐明了每个组件在训练动力学中的作用。此外，我们提出了一个简单但新颖的方法，改进了先前表现最佳的基于OT的模型。直观地说，我们的方法通过逐步调整生成分布，逐渐使其与数据分布对齐，实现了渐进的改进。",
    "tldr": "本文分析和改进了基于OT的对抗网络，首先在一个统一的框架中统一了这些方法，然后通过全面分析展示了各组件在训练中的作用，最后提出了一个简单但新颖的方法以改进最优生成模型，该方法通过逐步调整生成分布逐渐使其与数据分布对齐"
}