{
    "title": "Leader-Follower Neural Networks with Local Error Signals Inspired by Complex Collectives. (arXiv:2310.07885v1 [cs.LG])",
    "abstract": "The collective behavior of a network with heterogeneous, resource-limited information processing units (e.g., group of fish, flock of birds, or network of neurons) demonstrates high self-organization and complexity. These emergent properties arise from simple interaction rules where certain individuals can exhibit leadership-like behavior and influence the collective activity of the group. Motivated by the intricacy of these collectives, we propose a neural network (NN) architecture inspired by the rules observed in nature's collective ensembles. This NN structure contains workers that encompass one or more information processing units (e.g., neurons, filters, layers, or blocks of layers). Workers are either leaders or followers, and we train a leader-follower neural network (LFNN) by leveraging local error signals and optionally incorporating backpropagation (BP) and global loss. We investigate worker behavior and evaluate LFNNs through extensive experimentation. Our LFNNs trained wit",
    "link": "http://arxiv.org/abs/2310.07885",
    "context": "Title: Leader-Follower Neural Networks with Local Error Signals Inspired by Complex Collectives. (arXiv:2310.07885v1 [cs.LG])\nAbstract: The collective behavior of a network with heterogeneous, resource-limited information processing units (e.g., group of fish, flock of birds, or network of neurons) demonstrates high self-organization and complexity. These emergent properties arise from simple interaction rules where certain individuals can exhibit leadership-like behavior and influence the collective activity of the group. Motivated by the intricacy of these collectives, we propose a neural network (NN) architecture inspired by the rules observed in nature's collective ensembles. This NN structure contains workers that encompass one or more information processing units (e.g., neurons, filters, layers, or blocks of layers). Workers are either leaders or followers, and we train a leader-follower neural network (LFNN) by leveraging local error signals and optionally incorporating backpropagation (BP) and global loss. We investigate worker behavior and evaluate LFNNs through extensive experimentation. Our LFNNs trained wit",
    "path": "papers/23/10/2310.07885.json",
    "total_tokens": 1016,
    "translated_title": "基于复杂群体的局部误差信号启发的领导者-跟随者神经网络",
    "translated_abstract": "网络中具有异质、资源有限的信息处理单元（例如，一群鱼、一群鸟或一组神经元网络）的集体行为表现出高度的自组织和复杂性。这些 emergent properties是通过简单的相互作用规则产生的，其中某些个体能够表现出领导行为并影响群体的活动。受到这些群体的复杂性的启发，我们提出了一种神经网络（NN）架构，该架构受到自然群体集合中观察到的规则的启发。这个NN结构包含了包含一个或多个信息处理单元（如神经元、滤波器、层或层块）的工作人员。工作人员可以是领导者或跟随者，我们通过利用局部误差信号训练了一个领导者-跟随者神经网络（LFNN），并选择性地结合反向传播（BP）和全局损失。我们通过大量的实验研究工作人员的行为并评估了LFNN。我们训练了使用局部误差信号的LFNNs，可选择性地将反向传播和全局损失结合在一起。",
    "tldr": "领导者-跟随者神经网络是受到自然群体集合中观察到的规则启发的一种神经网络架构，利用局部误差信号训练并可选择性地结合反向传播和全局损失。通过大量实验研究工作人员行为和评估，这种神经网络具有高度的自组织和复杂性。",
    "en_tdlr": "Leader-Follower Neural Networks are inspired by the rules observed in nature's collective ensembles, and trained using local error signals while optionally incorporating backpropagation and global loss. Through extensive experimentation on worker behavior and evaluation, these neural networks exhibit high self-organization and complexity."
}