{
    "title": "Transcending the Attention Paradigm: Representation Learning from Geospatial Social Media Data. (arXiv:2310.05378v3 [cs.CL] UPDATED)",
    "abstract": "While transformers have pioneered attention-driven architectures as a cornerstone of language modeling, their dependence on explicitly contextual information underscores limitations in their abilities to tacitly learn overarching textual themes. This study challenges the heuristic paradigm of performance benchmarking by investigating social media data as a source of distributed patterns. In stark contrast to networks that rely on capturing complex long-term dependencies, models of online data inherently lack structure and are forced to detect latent structures in the aggregate. To properly represent these abstract relationships, this research dissects empirical social media corpora into their elemental components, analyzing over two billion tweets across population-dense locations. We create Bag-of-Word embedding specific to each city and compare their respective representations. This finds that even amidst noisy data, geographic location has a considerable influence on online communic",
    "link": "http://arxiv.org/abs/2310.05378",
    "context": "Title: Transcending the Attention Paradigm: Representation Learning from Geospatial Social Media Data. (arXiv:2310.05378v3 [cs.CL] UPDATED)\nAbstract: While transformers have pioneered attention-driven architectures as a cornerstone of language modeling, their dependence on explicitly contextual information underscores limitations in their abilities to tacitly learn overarching textual themes. This study challenges the heuristic paradigm of performance benchmarking by investigating social media data as a source of distributed patterns. In stark contrast to networks that rely on capturing complex long-term dependencies, models of online data inherently lack structure and are forced to detect latent structures in the aggregate. To properly represent these abstract relationships, this research dissects empirical social media corpora into their elemental components, analyzing over two billion tweets across population-dense locations. We create Bag-of-Word embedding specific to each city and compare their respective representations. This finds that even amidst noisy data, geographic location has a considerable influence on online communic",
    "path": "papers/23/10/2310.05378.json",
    "total_tokens": 982,
    "translated_title": "超越注意力范式：从地理社交媒体数据中学习表示",
    "translated_abstract": "虽然transformers作为语言建模的基石开创了注意力驱动的架构，但它们对显式上下文信息的依赖强调了它们在暗示性学习总体文本主题方面的局限性。本研究挑战了性能基准的启发式范式，通过将社交媒体数据作为分布式模式的源头进行研究。与依赖于捕捉复杂长期依赖性的网络形成鲜明对比的是，在线数据的模型本质上缺乏结构，被迫在聚合中检测潜在的结构。为了正确地表示这些抽象关系，本研究分解了经验社交媒体语料库成为其元素组成部分，分析了超过20亿条发表在人口密集地区的推文。我们创建了针对每个城市的词袋嵌入，并比较了它们的表示。发现即使在嘈杂的数据中，地理位置对在线沟通有着重要的影响。",
    "tldr": "本研究通过分析地理社交媒体数据发现，传统的基于注意力的架构存在局限性，无法隐含学习总体文本主题。相比于捕捉复杂长期依赖性的网络，在线数据的模型缺乏结构，需要在聚合中检测潜在的结构。此研究使用了20亿条推文进行实证分析，并比较了不同城市的词袋嵌入表示，发现地理位置对在线沟通有重要影响。",
    "en_tdlr": "This study challenges the limitations of attention-driven architectures in language modeling and proposes using social media data as a source of distributed patterns. By analyzing over two billion tweets, the research finds that geographic location has a significant influence on online communication, highlighting the importance of detecting latent structures in online data."
}