{
    "title": "Taking the human out of decomposition-based optimization via artificial intelligence: Part I. Learning when to decompose. (arXiv:2310.07068v1 [math.OC])",
    "abstract": "In this paper, we propose a graph classification approach for automatically determining whether to use a monolithic or a decomposition-based solution method. In this approach, an optimization problem is represented as a graph that captures the structural and functional coupling among the variables and constraints of the problem via an appropriate set of features. Given this representation, a graph classifier is built to determine the best solution method for a given problem. The proposed approach is used to develop a classifier that determines whether a convex Mixed Integer Nonlinear Programming problem should be solved using branch and bound or the outer approximation algorithm. Finally, it is shown how the learned classifier can be incorporated into existing mixed integer optimization solvers.",
    "link": "http://arxiv.org/abs/2310.07068",
    "context": "Title: Taking the human out of decomposition-based optimization via artificial intelligence: Part I. Learning when to decompose. (arXiv:2310.07068v1 [math.OC])\nAbstract: In this paper, we propose a graph classification approach for automatically determining whether to use a monolithic or a decomposition-based solution method. In this approach, an optimization problem is represented as a graph that captures the structural and functional coupling among the variables and constraints of the problem via an appropriate set of features. Given this representation, a graph classifier is built to determine the best solution method for a given problem. The proposed approach is used to develop a classifier that determines whether a convex Mixed Integer Nonlinear Programming problem should be solved using branch and bound or the outer approximation algorithm. Finally, it is shown how the learned classifier can be incorporated into existing mixed integer optimization solvers.",
    "path": "papers/23/10/2310.07068.json",
    "total_tokens": 730,
    "translated_title": "通过人工智能实现基于分解的优化方法的自动化选择：第一部分 - 学习何时分解",
    "translated_abstract": "本文提出了一种图分类方法，用于自动确定是使用整体式解法还是基于分解的解法。在这个方法中，优化问题被表示为一个图，通过适当的特征捕捉问题的变量和约束之间的结构和功能关联。基于这种表示，建立一个图分类器来确定给定问题的最佳解法。所提出的方法用于开发一个分类器，确定是否应使用分支定界法或外部逼近算法来解决凸混合整数非线性规划问题。最后，展示了如何将学习到的分类器纳入现有的混合整数优化求解器中。",
    "tldr": "本文提出了一种用于自动确定是使用整体式解法还是基于分解的解法的图分类方法，并展示了如何将该分类器应用于凸混合整数非线性规划问题的求解。",
    "en_tdlr": "This paper proposes a graph classification approach to automatically determine whether to use a monolithic or a decomposition-based solution method, and demonstrates how this classifier can be applied to solve convex Mixed Integer Nonlinear Programming problems."
}