{
    "title": "Emergent Communication in Interactive Sketch Question Answering. (arXiv:2310.15597v1 [cs.AI])",
    "abstract": "Vision-based emergent communication (EC) aims to learn to communicate through sketches and demystify the evolution of human communication. Ironically, previous works neglect multi-round interaction, which is indispensable in human communication. To fill this gap, we first introduce a novel Interactive Sketch Question Answering (ISQA) task, where two collaborative players are interacting through sketches to answer a question about an image in a multi-round manner. To accomplish this task, we design a new and efficient interactive EC system, which can achieve an effective balance among three evaluation factors, including the question answering accuracy, drawing complexity and human interpretability. Our experimental results including human evaluation demonstrate that multi-round interactive mechanism facilitates targeted and efficient communication between intelligent agents with decent human interpretability.",
    "link": "http://arxiv.org/abs/2310.15597",
    "context": "Title: Emergent Communication in Interactive Sketch Question Answering. (arXiv:2310.15597v1 [cs.AI])\nAbstract: Vision-based emergent communication (EC) aims to learn to communicate through sketches and demystify the evolution of human communication. Ironically, previous works neglect multi-round interaction, which is indispensable in human communication. To fill this gap, we first introduce a novel Interactive Sketch Question Answering (ISQA) task, where two collaborative players are interacting through sketches to answer a question about an image in a multi-round manner. To accomplish this task, we design a new and efficient interactive EC system, which can achieve an effective balance among three evaluation factors, including the question answering accuracy, drawing complexity and human interpretability. Our experimental results including human evaluation demonstrate that multi-round interactive mechanism facilitates targeted and efficient communication between intelligent agents with decent human interpretability.",
    "path": "papers/23/10/2310.15597.json",
    "total_tokens": 838,
    "translated_title": "交互式素描问答中的紧急沟通",
    "translated_abstract": "基于视觉的紧急沟通（EC）旨在通过素描学习沟通，并揭示人类沟通的演变过程。然而，以前的研究忽视了多轮交互，在人类沟通中是不可或缺的。为了填补这一空白，我们首先引入了一项新颖的交互式素描问答（ISQA）任务，其中两个合作玩家通过素描进行多轮交互，以回答关于一张图片的问题。为了完成这个任务，我们设计了一个新的高效的交互式EC系统，它可以在问题回答准确性、绘画复杂度和人类可解释性这三个评估因素之间取得有效平衡。我们的实验结果，包括人类评估，表明多轮交互机制能够促进智能agent之间的有针对性、高效的沟通，并具有较好的人类可解释性。",
    "tldr": "本文研究了基于视觉的紧急沟通，提出了一个新颖的交互式素描问答任务，通过多轮交互实现了智能agent之间的有针对性、高效的沟通，并具有较好的人类可解释性。",
    "en_tdlr": "This paper investigates vision-based emergent communication and introduces a novel Interactive Sketch Question Answering task. The study demonstrates that multi-round interactive mechanism enables targeted and efficient communication between intelligent agents with decent human interpretability."
}