{
    "title": "RaceLens: A Machine Intelligence-Based Application for Racing Photo Analysis. (arXiv:2310.13515v1 [cs.CV])",
    "abstract": "This paper presents RaceLens, a novel application utilizing advanced deep learning and computer vision models for comprehensive analysis of racing photos. The developed models have demonstrated their efficiency in a wide array of tasks, including detecting racing cars, recognizing car numbers, detecting and quantifying car details, and recognizing car orientations. We discuss the process of collecting a robust dataset necessary for training our models, and describe an approach we have designed to augment and improve this dataset continually. Our method leverages a feedback loop for continuous model improvement, thus enhancing the performance and accuracy of RaceLens over time. A significant part of our study is dedicated to illustrating the practical application of RaceLens, focusing on its successful deployment by NASCAR teams over four seasons. We provide a comprehensive evaluation of our system's performance and its direct impact on the team's strategic decisions and performance met",
    "link": "http://arxiv.org/abs/2310.13515",
    "context": "Title: RaceLens: A Machine Intelligence-Based Application for Racing Photo Analysis. (arXiv:2310.13515v1 [cs.CV])\nAbstract: This paper presents RaceLens, a novel application utilizing advanced deep learning and computer vision models for comprehensive analysis of racing photos. The developed models have demonstrated their efficiency in a wide array of tasks, including detecting racing cars, recognizing car numbers, detecting and quantifying car details, and recognizing car orientations. We discuss the process of collecting a robust dataset necessary for training our models, and describe an approach we have designed to augment and improve this dataset continually. Our method leverages a feedback loop for continuous model improvement, thus enhancing the performance and accuracy of RaceLens over time. A significant part of our study is dedicated to illustrating the practical application of RaceLens, focusing on its successful deployment by NASCAR teams over four seasons. We provide a comprehensive evaluation of our system's performance and its direct impact on the team's strategic decisions and performance met",
    "path": "papers/23/10/2310.13515.json",
    "total_tokens": 905,
    "translated_title": "RaceLens:一种基于机器智能的赛车照片分析应用",
    "translated_abstract": "本文介绍了RaceLens，一种利用先进的深度学习和计算机视觉模型对赛车照片进行全面分析的创新应用。我们开发的模型在多项任务中展示了高效性，包括检测赛车、识别车牌号码、检测和量化车辆细节以及识别车辆方向等。我们讨论了为训练模型所需的鲁棒数据集的收集过程，并描述了一种我们设计的持续改进和增强数据集的方法。我们的方法利用反馈循环不断改进模型，从而提高RaceLens的性能和准确性。本研究的重要部分是介绍RaceLens的实际应用，重点是其在四个赛季中由NASCAR车队成功部署的案例。我们对系统的性能及其对车队战略决策和表现的直接影响进行了全面评估。",
    "tldr": "RaceLens是一种基于机器智能的赛车照片分析应用，利用先进的深度学习和计算机视觉模型对赛车照片进行全面分析。通过持续改进和增强数据集的方法，RaceLens的性能和准确性得到了提高，并成功应用于NASCAR车队，对其战略决策和表现产生了直接影响。",
    "en_tdlr": "RaceLens is a machine intelligence-based application that utilizes advanced deep learning and computer vision models to comprehensively analyze racing photos. By continuously improving and enhancing the dataset, RaceLens has improved its performance and accuracy, and successfully deployed in NASCAR teams, directly impacting their strategic decisions and performance."
}