{
    "title": "Two-Stage Triplet Loss Training with Curriculum Augmentation for Audio-Visual Retrieval. (arXiv:2310.13451v1 [cs.SD])",
    "abstract": "The cross-modal retrieval model leverages the potential of triple loss optimization to learn robust embedding spaces. However, existing methods often train these models in a singular pass, overlooking the distinction between semi-hard and hard triples in the optimization process. The oversight of not distinguishing between semi-hard and hard triples leads to suboptimal model performance. In this paper, we introduce a novel approach rooted in curriculum learning to address this problem. We propose a two-stage training paradigm that guides the model's learning process from semi-hard to hard triplets. In the first stage, the model is trained with a set of semi-hard triplets, starting from a low-loss base. Subsequently, in the second stage, we augment the embeddings using an interpolation technique. This process identifies potential hard negatives, alleviating issues arising from high-loss functions due to a scarcity of hard triples. Our approach then applies hard triplet mining in the aug",
    "link": "http://arxiv.org/abs/2310.13451",
    "context": "Title: Two-Stage Triplet Loss Training with Curriculum Augmentation for Audio-Visual Retrieval. (arXiv:2310.13451v1 [cs.SD])\nAbstract: The cross-modal retrieval model leverages the potential of triple loss optimization to learn robust embedding spaces. However, existing methods often train these models in a singular pass, overlooking the distinction between semi-hard and hard triples in the optimization process. The oversight of not distinguishing between semi-hard and hard triples leads to suboptimal model performance. In this paper, we introduce a novel approach rooted in curriculum learning to address this problem. We propose a two-stage training paradigm that guides the model's learning process from semi-hard to hard triplets. In the first stage, the model is trained with a set of semi-hard triplets, starting from a low-loss base. Subsequently, in the second stage, we augment the embeddings using an interpolation technique. This process identifies potential hard negatives, alleviating issues arising from high-loss functions due to a scarcity of hard triples. Our approach then applies hard triplet mining in the aug",
    "path": "papers/23/10/2310.13451.json",
    "total_tokens": 910,
    "translated_title": "两阶段三元组损失训练与课程增强在音视频检索中的应用",
    "translated_abstract": "跨模态检索模型利用三元组损失优化来学习鲁棒的嵌入空间。然而，现有方法通常在单次训练中对这些模型进行训练，忽视了优化过程中半硬和硬三元组之间的区别。没有区分半硬和硬三元组的疏忽导致了模型性能的次优。本文引入了一种基于课程学习的新方法来解决这个问题。我们提出了一个两阶段的训练范式，引导模型的学习过程从半硬三元组到硬三元组。在第一阶段，模型从低损失基础开始，使用一组半硬三元组进行训练。随后，在第二阶段，我们使用插值技术对嵌入进行增强。这个过程可以识别潜在的困难负样本，缓解由于困难三元组稀缺导致的高损失函数的问题。我们的方法还在增强后的嵌入中应用了硬三元组挖掘。",
    "tldr": "本研究提出了一种基于课程学习的两阶段训练方法，通过在训练过程中区分半硬和硬三元组，提高了跨模态检索模型的性能。",
    "en_tdlr": "This paper proposes a two-stage training approach based on curriculum learning to improve the performance of cross-modal retrieval models by distinguishing between semi-hard and hard triplets during the training process."
}