{
    "title": "If our aim is to build morality into an artificial agent, how might we begin to go about doing so?. (arXiv:2310.08295v1 [cs.AI])",
    "abstract": "As Artificial Intelligence (AI) becomes pervasive in most fields, from healthcare to autonomous driving, it is essential that we find successful ways of building morality into our machines, especially for decision-making. However, the question of what it means to be moral is still debated, particularly in the context of AI. In this paper, we highlight the different aspects that should be considered when building moral agents, including the most relevant moral paradigms and challenges. We also discuss the top-down and bottom-up approaches to design and the role of emotion and sentience in morality. We then propose solutions including a hybrid approach to design and a hierarchical approach to combining moral paradigms. We emphasize how governance and policy are becoming ever more critical in AI Ethics and in ensuring that the tasks we set for moral agents are attainable, that ethical behavior is achieved, and that we obtain good AI.",
    "link": "http://arxiv.org/abs/2310.08295",
    "context": "Title: If our aim is to build morality into an artificial agent, how might we begin to go about doing so?. (arXiv:2310.08295v1 [cs.AI])\nAbstract: As Artificial Intelligence (AI) becomes pervasive in most fields, from healthcare to autonomous driving, it is essential that we find successful ways of building morality into our machines, especially for decision-making. However, the question of what it means to be moral is still debated, particularly in the context of AI. In this paper, we highlight the different aspects that should be considered when building moral agents, including the most relevant moral paradigms and challenges. We also discuss the top-down and bottom-up approaches to design and the role of emotion and sentience in morality. We then propose solutions including a hybrid approach to design and a hierarchical approach to combining moral paradigms. We emphasize how governance and policy are becoming ever more critical in AI Ethics and in ensuring that the tasks we set for moral agents are attainable, that ethical behavior is achieved, and that we obtain good AI.",
    "path": "papers/23/10/2310.08295.json",
    "total_tokens": 955,
    "translated_title": "如果我们的目标是向人工智能中构建道德，我们该如何着手？",
    "translated_abstract": "随着人工智能在各个领域的普及，从医疗保健到自动驾驶，构建道德的机器变得至关重要，特别是对于决策。然而，道德的含义在人工智能的背景下仍然存在争议。在本文中，我们强调了构建道德机器时应考虑的不同方面，包括最相关的道德范式和挑战。我们还讨论了自顶向下和自底向上的设计方法以及情感和感知在道德中的作用。然后，我们提出了解决方案，包括设计的混合方法和结合道德范式的层次化方法。我们强调治理和政策在人工智能伦理和确保我们给道德机器设置的任务可行性、实现道德行为和获得良好人工智能方面的重要性。",
    "tldr": "本文讨论了将道德建立在人工智能代理中的方法，并就道德的含义提出了不同的看法。作者提出了自顶向下和自底向上的设计方法，并强调情感和感知在道德中的作用。此外，作者还提出了设计的混合方法和结合道德范式的层次化方法。对于人工智能伦理来说，治理和政策的重要性也得到了强调。"
}