{
    "title": "Human Reliability Assessment method applied to investigate human factors in NDT -- The case of the interpretation of radiograms in the French nuclear sector. (arXiv:2310.14697v1 [q-fin.RM])",
    "abstract": "This communication reports on a study carried out in the context of the collaborative FOEHN project (Human and Organizational Factors in Non-Destructive Evaluation) supported by the French National Research Agency. The motivation of this project comes from the observation that human and Organizational factors (HOF) are not sufficiently considered by the NDT community. Its goal is to analyse and model the influence of the HOF on selected cases of study in the perspective of a better evaluation of the performance of inspections. The communication is focused on a radiographic test (RT) case of study in which it appeared that several successive inspections had failed to detect an existing in-service defect. The analysis and modelling of HOF related to interpretation of films has been achieved in the framework of the CREAM (Cognitive and Reliability and Error Analysis Method). A survey has been conducted during the training and the maintaining of the proficiency of NDT (Non Destructive Test",
    "link": "http://arxiv.org/abs/2310.14697",
    "context": "Title: Human Reliability Assessment method applied to investigate human factors in NDT -- The case of the interpretation of radiograms in the French nuclear sector. (arXiv:2310.14697v1 [q-fin.RM])\nAbstract: This communication reports on a study carried out in the context of the collaborative FOEHN project (Human and Organizational Factors in Non-Destructive Evaluation) supported by the French National Research Agency. The motivation of this project comes from the observation that human and Organizational factors (HOF) are not sufficiently considered by the NDT community. Its goal is to analyse and model the influence of the HOF on selected cases of study in the perspective of a better evaluation of the performance of inspections. The communication is focused on a radiographic test (RT) case of study in which it appeared that several successive inspections had failed to detect an existing in-service defect. The analysis and modelling of HOF related to interpretation of films has been achieved in the framework of the CREAM (Cognitive and Reliability and Error Analysis Method). A survey has been conducted during the training and the maintaining of the proficiency of NDT (Non Destructive Test",
    "path": "papers/23/10/2310.14697.json",
    "total_tokens": 884,
    "translated_title": "将人可靠性评估方法应用于调查法国核能行业放射图像解释中的人为因素 - FOEHN项目案例研究",
    "translated_abstract": "本研究报告是在法国国家研究机构支持下进行的FOEHN项目（非破坏性评估中的人与组织因素）的研究。该项目的动机来源于观察到NDT社区对人和组织因素（HOF）的考虑不足。其目标是分析和建模HOF对选定的研究案例的影响，以更好地评估检验的性能。本研究聚焦于放射图像检验（RT）案例，发现多次检验未能发现现有的运行中缺陷。在CREAM框架下，对与片片解释相关的HOF进行了分析和建模。在NDT的培训和能力维持期间进行了一项调查。",
    "tldr": "本研究旨在调查法国核能行业放射图像解释中的人为因素对非破坏性评估的影响，并以FOEHN项目中的一个案例为研究对象。研究使用了人可靠性评估方法和认知可靠性和错误分析方法进行分析和建模。",
    "en_tdlr": "This study investigates the influence of human factors on non-destructive evaluation in the interpretation of radiograms in the French nuclear sector, using the Human Reliability Assessment method and Cognitive Reliability and Error Analysis Method."
}