{
    "title": "Mind the Gap Between Conversations for Improved Long-Term Dialogue Generation. (arXiv:2310.15415v1 [cs.CL])",
    "abstract": "Knowing how to end and resume conversations over time is a natural part of communication, allowing for discussions to span weeks, months, or years. The duration of gaps between conversations dictates which topics are relevant and which questions to ask, and dialogue systems which do not explicitly model time may generate responses that are unnatural. In this work we explore the idea of making dialogue models aware of time, and present GapChat, a multi-session dialogue dataset in which the time between each session varies. While the dataset is constructed in real-time, progress on events in speakers' lives is simulated in order to create realistic dialogues occurring across a long timespan. We expose time information to the model and compare different representations of time and event progress. In human evaluation we show that time-aware models perform better in metrics that judge the relevance of the chosen topics and the information gained from the conversation.",
    "link": "http://arxiv.org/abs/2310.15415",
    "context": "Title: Mind the Gap Between Conversations for Improved Long-Term Dialogue Generation. (arXiv:2310.15415v1 [cs.CL])\nAbstract: Knowing how to end and resume conversations over time is a natural part of communication, allowing for discussions to span weeks, months, or years. The duration of gaps between conversations dictates which topics are relevant and which questions to ask, and dialogue systems which do not explicitly model time may generate responses that are unnatural. In this work we explore the idea of making dialogue models aware of time, and present GapChat, a multi-session dialogue dataset in which the time between each session varies. While the dataset is constructed in real-time, progress on events in speakers' lives is simulated in order to create realistic dialogues occurring across a long timespan. We expose time information to the model and compare different representations of time and event progress. In human evaluation we show that time-aware models perform better in metrics that judge the relevance of the chosen topics and the information gained from the conversation.",
    "path": "papers/23/10/2310.15415.json",
    "total_tokens": 852,
    "translated_title": "注意对话之间的差距，以提高长期对话生成的效果",
    "translated_abstract": "知道如何结束和恢复对话是交流的自然部分，允许讨论跨越数周、数月或数年。对话之间的间隔持续时间决定了哪些话题是相关的，以及要问哪些问题，而不明确模拟时间的对话系统可能生成不自然的回应。在这项工作中，我们探索了使对话模型意识到时间的想法，并提出了GapChat，这是一个多次对话的数据集，其中每个对话之间的时间不同。虽然数据集是实时构建的，但演讲者生活中事件的进展是模拟的，以创建发生在长时间跨度内的现实对话。我们将时间信息暴露给模型，并比较不同的时间和事件进展表示。在人工评估中，我们展示了时间感知模型在判断选择话题的相关性和从对话中获得的信息的度量标准上表现更好。",
    "tldr": "本研究探索了使对话模型意识到时间的想法，并提出了一个多次对话的数据集GapChat，显示出时间感知的模型在判断话题相关性和从对话中获取信息的度量标准方面表现更好。",
    "en_tdlr": "This research explores the idea of making dialogue models aware of time and presents a dataset called GapChat for multi-session dialogue. The study demonstrates that time-aware models perform better in judging the relevance of topics and the information gained from the conversation."
}