{
    "title": "Burning the Adversarial Bridges: Robust Windows Malware Detection Against Binary-level Mutations. (arXiv:2310.03285v1 [cs.LG])",
    "abstract": "Toward robust malware detection, we explore the attack surface of existing malware detection systems. We conduct root-cause analyses of the practical binary-level black-box adversarial malware examples. Additionally, we uncover the sensitivity of volatile features within the detection engines and exhibit their exploitability. Highlighting volatile information channels within the software, we introduce three software pre-processing steps to eliminate the attack surface, namely, padding removal, software stripping, and inter-section information resetting. Further, to counter the emerging section injection attacks, we propose a graph-based section-dependent information extraction scheme for software representation. The proposed scheme leverages aggregated information within various sections in the software to enable robust malware detection and mitigate adversarial settings. Our experimental results show that traditional malware detection models are ineffective against adversarial threats",
    "link": "http://arxiv.org/abs/2310.03285",
    "context": "Title: Burning the Adversarial Bridges: Robust Windows Malware Detection Against Binary-level Mutations. (arXiv:2310.03285v1 [cs.LG])\nAbstract: Toward robust malware detection, we explore the attack surface of existing malware detection systems. We conduct root-cause analyses of the practical binary-level black-box adversarial malware examples. Additionally, we uncover the sensitivity of volatile features within the detection engines and exhibit their exploitability. Highlighting volatile information channels within the software, we introduce three software pre-processing steps to eliminate the attack surface, namely, padding removal, software stripping, and inter-section information resetting. Further, to counter the emerging section injection attacks, we propose a graph-based section-dependent information extraction scheme for software representation. The proposed scheme leverages aggregated information within various sections in the software to enable robust malware detection and mitigate adversarial settings. Our experimental results show that traditional malware detection models are ineffective against adversarial threats",
    "path": "papers/23/10/2310.03285.json",
    "total_tokens": 917,
    "translated_title": "燃烧对抗性桥梁：针对二进制级变异的强健Windows恶意软件检测",
    "translated_abstract": "为了强健的恶意软件检测，我们探索了现有恶意软件检测系统的攻击面。我们对实际的二进制级黑盒对抗恶意软件示例进行了根本原因分析。此外，我们揭示了检测引擎中易受攻击的易失性特征，并展示了它们的可利用性。通过突出软件中的易失性信息渠道，我们引入了三个软件预处理步骤来消除攻击面，即填充去除、软件剥离和交叉信息重置。此外，为了应对新兴的节段注入攻击，我们提出了一种基于图的节段依赖信息提取方案，用于软件表示。所提出的方案利用软件中各个节段内的汇集信息，实现了强健的恶意软件检测和缓解对抗环境。我们的实验结果表明，传统的恶意软件检测模型对抗对抗性威胁无效。",
    "tldr": "本文针对二进制级变异的强健Windows恶意软件检测问题，分析了现有检测系统的攻击面，并提出了一种基于软件预处理和图像提取的方案以应对对抗环境。实验结果表明传统模型对抗威胁无效。",
    "en_tdlr": "This paper addresses the problem of robust Windows malware detection against binary-level mutations. It analyzes the attack surface of existing detection systems and proposes a solution based on software pre-processing and graph-based information extraction to counter adversarial settings. Experimental results show the ineffectiveness of traditional models against adversarial threats."
}