{
    "title": "Unsupervised Candidate Answer Extraction through Differentiable Masker-Reconstructor Model. (arXiv:2310.13106v1 [cs.CL])",
    "abstract": "Question generation is a widely used data augmentation approach with extensive applications, and extracting qualified candidate answers from context passages is a critical step for most question generation systems. However, existing methods for candidate answer extraction are reliant on linguistic rules or annotated data that face the partial annotation issue and challenges in generalization. To overcome these limitations, we propose a novel unsupervised candidate answer extraction approach that leverages the inherent structure of context passages through a Differentiable Masker-Reconstructor (DMR) Model with the enforcement of self-consistency for picking up salient information tokens. We curated two datasets with exhaustively-annotated answers and benchmark a comprehensive set of supervised and unsupervised candidate answer extraction methods. We demonstrate the effectiveness of the DMR model by showing its performance is superior among unsupervised methods and comparable to supervis",
    "link": "http://arxiv.org/abs/2310.13106",
    "context": "Title: Unsupervised Candidate Answer Extraction through Differentiable Masker-Reconstructor Model. (arXiv:2310.13106v1 [cs.CL])\nAbstract: Question generation is a widely used data augmentation approach with extensive applications, and extracting qualified candidate answers from context passages is a critical step for most question generation systems. However, existing methods for candidate answer extraction are reliant on linguistic rules or annotated data that face the partial annotation issue and challenges in generalization. To overcome these limitations, we propose a novel unsupervised candidate answer extraction approach that leverages the inherent structure of context passages through a Differentiable Masker-Reconstructor (DMR) Model with the enforcement of self-consistency for picking up salient information tokens. We curated two datasets with exhaustively-annotated answers and benchmark a comprehensive set of supervised and unsupervised candidate answer extraction methods. We demonstrate the effectiveness of the DMR model by showing its performance is superior among unsupervised methods and comparable to supervis",
    "path": "papers/23/10/2310.13106.json",
    "total_tokens": 895,
    "translated_title": "通过可微的模型实现无监督候选答案提取",
    "translated_abstract": "问题生成是一种广泛应用、有着广泛应用的数据增强方法，从上下文中提取合格的候选答案是大多数问题生成系统的关键步骤。然而，现有的候选答案提取方法依赖于语言规则或注释过的数据，面临部分注释问题和泛化挑战。为了克服这些限制，我们提出了一种新颖的无监督候选答案提取方法，通过可微分的遮罩-重构模型(DMR)利用上下文中的内在结构，并通过自一致性来选择显著的信息标记。我们策划了两个经过详尽注释的答案数据集，并对一组全面的受监督和无监督候选答案提取方法进行了基准测试。我们通过展示DMR模型的性能表明它在无监督方法中表现出色，并与受监督方法相媲美。",
    "tldr": "提出了一种无监督候选答案提取方法，利用可微的遮罩-重构模型(DMR)来提取上下文中的候选答案，通过自一致性选择显著的信息标记。实验结果表明该方法在无监督方法中表现出色，并与受监督方法相媲美。"
}