{
    "title": "Hybrid Minimax-MCTS and Difficulty Adjustment for General Game Playing. (arXiv:2310.16581v1 [cs.AI])",
    "abstract": "Board games are a great source of entertainment for all ages, as they create a competitive and engaging environment, as well as stimulating learning and strategic thinking. It is common for digital versions of board games, as any other type of digital games, to offer the option to select the difficulty of the game. This is usually done by customizing the search parameters of the AI algorithm. However, this approach cannot be extended to General Game Playing agents, as different games might require different parametrization for each difficulty level. In this paper, we present a general approach to implement an artificial intelligence opponent with difficulty levels for zero-sum games, together with a propose of a Minimax-MCTS hybrid algorithm, which combines the minimax search process with GGP aspects of MCTS. This approach was tested in our mobile application LoBoGames, an extensible board games platform, that is intended to have an broad catalog of games, with an emphasis on accessibi",
    "link": "http://arxiv.org/abs/2310.16581",
    "context": "Title: Hybrid Minimax-MCTS and Difficulty Adjustment for General Game Playing. (arXiv:2310.16581v1 [cs.AI])\nAbstract: Board games are a great source of entertainment for all ages, as they create a competitive and engaging environment, as well as stimulating learning and strategic thinking. It is common for digital versions of board games, as any other type of digital games, to offer the option to select the difficulty of the game. This is usually done by customizing the search parameters of the AI algorithm. However, this approach cannot be extended to General Game Playing agents, as different games might require different parametrization for each difficulty level. In this paper, we present a general approach to implement an artificial intelligence opponent with difficulty levels for zero-sum games, together with a propose of a Minimax-MCTS hybrid algorithm, which combines the minimax search process with GGP aspects of MCTS. This approach was tested in our mobile application LoBoGames, an extensible board games platform, that is intended to have an broad catalog of games, with an emphasis on accessibi",
    "path": "papers/23/10/2310.16581.json",
    "total_tokens": 942,
    "translated_title": "混合最小最大-蒙特卡洛树搜索和难度调整的通用游戏对战",
    "translated_abstract": "棋盘游戏是一种适合各个年龄段的娱乐方式，它创造了竞争和吸引人的环境，同时也促进了学习和战略思考。对于数字版本的棋盘游戏（以及其他类型的数字游戏），通常可以选择游戏的难度。通常通过自定义AI算法的搜索参数来实现。然而，这种方法无法扩展到通用游戏对战代理程序，因为不同的游戏可能需要不同的参数设置来适应各个难度级别。本文提出了一种通用方法来实现具有难度级别的零和博弈的人工智能对手，并提出了一个最小最大-蒙特卡洛树搜索混合算法，它结合了最小最大搜索过程和GGP（通用游戏对战）中的MCTS（蒙特卡洛树搜索）的特点。这种方法在我们的移动应用程序LoBoGames中进行了测试，该应用程序是一个可扩展的棋盘游戏平台，旨在拥有广泛的游戏目录，并注重可访问性。",
    "tldr": "本论文提出了一种混合最小最大-蒙特卡洛树搜索算法和难度调整的通用游戏对战策略，可以在零和博弈中实现具有不同难度级别的人工智能对手。",
    "en_tdlr": "This paper presents a hybrid minimax-MCTS algorithm and difficulty adjustment strategy for general game playing, allowing for the implementation of artificial intelligence opponents with different difficulty levels in zero-sum games."
}