{
    "title": "Comparative Analysis of Imbalanced Malware Byteplot Image Classification using Transfer Learning. (arXiv:2310.02742v1 [cs.LG])",
    "abstract": "Cybersecurity is a major concern due to the increasing reliance on technology and interconnected systems. Malware detectors help mitigate cyber-attacks by comparing malware signatures. Machine learning can improve these detectors by automating feature extraction, identifying patterns, and enhancing dynamic analysis. In this paper, the performance of six multiclass classification models is compared on the Malimg dataset, Blended dataset, and Malevis dataset to gain insights into the effect of class imbalance on model performance and convergence. It is observed that the more the class imbalance less the number of epochs required for convergence and a high variance across the performance of different models. Moreover, it is also observed that for malware detectors ResNet50, EfficientNetB0, and DenseNet169 can handle imbalanced and balanced data well. A maximum precision of 97% is obtained for the imbalanced dataset, a maximum precision of 95% is obtained on the intermediate imbalance data",
    "link": "http://arxiv.org/abs/2310.02742",
    "context": "Title: Comparative Analysis of Imbalanced Malware Byteplot Image Classification using Transfer Learning. (arXiv:2310.02742v1 [cs.LG])\nAbstract: Cybersecurity is a major concern due to the increasing reliance on technology and interconnected systems. Malware detectors help mitigate cyber-attacks by comparing malware signatures. Machine learning can improve these detectors by automating feature extraction, identifying patterns, and enhancing dynamic analysis. In this paper, the performance of six multiclass classification models is compared on the Malimg dataset, Blended dataset, and Malevis dataset to gain insights into the effect of class imbalance on model performance and convergence. It is observed that the more the class imbalance less the number of epochs required for convergence and a high variance across the performance of different models. Moreover, it is also observed that for malware detectors ResNet50, EfficientNetB0, and DenseNet169 can handle imbalanced and balanced data well. A maximum precision of 97% is obtained for the imbalanced dataset, a maximum precision of 95% is obtained on the intermediate imbalance data",
    "path": "papers/23/10/2310.02742.json",
    "total_tokens": 990,
    "translated_title": "借助迁移学习比较不平衡恶意软件Byteplot图像分类的比较分析",
    "translated_abstract": "随着对科技和互联系统的日益依赖，网络安全成为一个主要关注的问题。恶意软件检测器通过比较恶意软件特征来缓解网络攻击。机器学习可以通过自动化特征提取、识别模式和增强动态分析来改进这些检测器。本文比较了六种多类别分类模型在Malimg数据集、混合数据集和Malevis数据集上的性能，以了解类别不平衡对模型性能和收敛性的影响。观察到类别不平衡的程度越高，收敛所需的迭代次数越少，不同模型的性能差异也越大。此外，还观察到对于恶意软件检测器，ResNet50、EfficientNetB0和DenseNet169可以很好地处理不平衡和平衡的数据。在不平衡数据集上获得了最高97%的精度，在中等不平衡数据上获得了最高95%的精度。",
    "tldr": "本文通过比较分析了不平衡恶意软件图像分类的六种模型性能，发现类别不平衡程度越高，收敛所需的迭代次数越少，不同模型的性能差异也越大。同时，研究发现ResNet50、EfficientNetB0和DenseNet169可以很好地处理不平衡和平衡的数据，对于恶意软件检测器具有较高的精度。",
    "en_tdlr": "This paper presents a comparative analysis of six models for imbalanced malware image classification, revealing that higher class imbalance leads to fewer epochs required for convergence and significant performance variations across models. Additionally, ResNet50, EfficientNetB0, and DenseNet169 are found to effectively handle imbalanced and balanced data, achieving high precision for malware detection."
}