{
    "title": "Perpetual Futures Pricing. (arXiv:2310.11771v1 [q-fin.PR])",
    "abstract": "Perpetual futures are contracts without expiration date in which the anchoring of the futures price to the spot price is ensured by periodic funding payments from long to short. We derive explicit expressions for the no-arbitrage price of various perpetual contracts, including linear, inverse, and quantos futures in both discrete and continuous-time. In particular, we show that the futures price is given by the risk-neutral expectation of the spot sampled at a random time that reflects the intensity of the price anchoring. Furthermore, we identify funding specifications that guarantee the coincidence of futures and spot prices, and show that for such specifications perpetual futures contracts can be replicated by dynamic trading in primitive securities.",
    "link": "http://arxiv.org/abs/2310.11771",
    "context": "Title: Perpetual Futures Pricing. (arXiv:2310.11771v1 [q-fin.PR])\nAbstract: Perpetual futures are contracts without expiration date in which the anchoring of the futures price to the spot price is ensured by periodic funding payments from long to short. We derive explicit expressions for the no-arbitrage price of various perpetual contracts, including linear, inverse, and quantos futures in both discrete and continuous-time. In particular, we show that the futures price is given by the risk-neutral expectation of the spot sampled at a random time that reflects the intensity of the price anchoring. Furthermore, we identify funding specifications that guarantee the coincidence of futures and spot prices, and show that for such specifications perpetual futures contracts can be replicated by dynamic trading in primitive securities.",
    "path": "papers/23/10/2310.11771.json",
    "total_tokens": 801,
    "translated_title": "永久期货定价",
    "translated_abstract": "永久期货是没有到期日期的合约，通过长期向空头支付定期融资来确保期货价格与现货价格的锚定。我们推导了各种永久期货的无套利价格的明确表达式，包括线性、反向和量化期货，在离散和连续时间下研究。特别地，我们表明期货价格由风险中性预期在反映价格锚定密集度的随机时间抽样得到。此外，我们确定了可以保证期货和现货价格相一致的融资规格，并且证明对于这些规格，可以通过原始证券的动态交易复制永久期货合约。",
    "tldr": "本论文研究了永久期货的定价，并推导出了各种永久期货合约的无套利价格表达式。研究发现期货价格是根据风险中性预期以及反映价格锚定程度的随机时间抽样得到的。此外，还通过动态交易复制证明了一些融资规格保证期货和现货价格一致。",
    "en_tdlr": "This paper investigates the pricing of perpetual futures and derives explicit expressions for the no-arbitrage price of various perpetual contracts. The study finds that the futures price is determined by the risk-neutral expectation of the spot price sampled at a random time reflecting the intensity of the price anchoring. Additionally, it demonstrates that certain funding specifications ensure the coincidence of futures and spot prices through dynamic trading replication."
}