{
    "title": "Personalized human mobility prediction for HuMob challenge. (arXiv:2310.12900v1 [cs.LG])",
    "abstract": "We explain the methodology used to create the data submitted to HuMob Challenge, a data analysis competition for human mobility prediction. We adopted a personalized model to predict the individual's movement trajectory from their data, instead of predicting from the overall movement, based on the hypothesis that human movement is unique to each person. We devised the features such as the date and time, activity time, days of the week, time of day, and frequency of visits to POI (Point of Interest). As additional features, we incorporated the movement of other individuals with similar behavior patterns through the employment of clustering. The machine learning model we adopted was the Support Vector Regression (SVR). We performed accuracy through offline assessment and carried out feature selection and parameter tuning. Although overall dataset provided consists of 100,000 users trajectory, our method use only 20,000 target users data, and do not need to use other 80,000 data. Despite ",
    "link": "http://arxiv.org/abs/2310.12900",
    "context": "Title: Personalized human mobility prediction for HuMob challenge. (arXiv:2310.12900v1 [cs.LG])\nAbstract: We explain the methodology used to create the data submitted to HuMob Challenge, a data analysis competition for human mobility prediction. We adopted a personalized model to predict the individual's movement trajectory from their data, instead of predicting from the overall movement, based on the hypothesis that human movement is unique to each person. We devised the features such as the date and time, activity time, days of the week, time of day, and frequency of visits to POI (Point of Interest). As additional features, we incorporated the movement of other individuals with similar behavior patterns through the employment of clustering. The machine learning model we adopted was the Support Vector Regression (SVR). We performed accuracy through offline assessment and carried out feature selection and parameter tuning. Although overall dataset provided consists of 100,000 users trajectory, our method use only 20,000 target users data, and do not need to use other 80,000 data. Despite ",
    "path": "papers/23/10/2310.12900.json",
    "total_tokens": 907,
    "translated_title": "个性化的人类移动预测方法及其贡献",
    "translated_abstract": "我们介绍了用于创建提交给HuMob Challenge的数据的方法，这是一个用于人类移动预测的数据分析竞赛。我们采用了一个个性化模型基于个体的数据来预测其运动轨迹，而不是基于整体运动的预测，基于人类运动对于每个人而言是独特的假设。我们设计了特征，如日期和时间，活动时间，周几，一天中的时间和POI（兴趣点）访问频率等。作为额外的特征，我们通过聚类来融合具有相似行为模式的其他个体的运动。我们采用的机器学习模型是支持向量回归（SVR）。我们通过离线评估进行准确性检验，并进行特征选择和参数调整。尽管总体数据集包含10万名用户的轨迹，但我们的方法只使用了2万名目标用户的数据，并不需要使用其他8万名用户的数据。",
    "tldr": "该论文介绍了一种个性化的人类移动预测方法，基于个体数据而不是整体数据进行预测，并成功运用于HuMob Challenge竞赛中。采用了特征设计和机器学习模型SVR，通过离线评估和特征选择和参数调整，使预测准确性得到验证。",
    "en_tdlr": "This paper presents a personalized approach to predict human mobility, using individual data instead of overall data, and successfully applies it to the HuMob Challenge competition. The method includes feature design and the adoption of the SVR machine learning model, which is validated through offline assessment, feature selection, and parameter tuning."
}