{
    "title": "Equation Discovery with Bayesian Spike-and-Slab Priors and Efficient Kernels. (arXiv:2310.05387v1 [cs.LG])",
    "abstract": "Discovering governing equations from data is important to many scientific and engineering applications. Despite promising successes, existing methods are still challenged by data sparsity as well as noise issues, both of which are ubiquitous in practice. Moreover, state-of-the-art methods lack uncertainty quantification and/or are costly in training. To overcome these limitations, we propose a novel equation discovery method based on Kernel learning and BAyesian Spike-and-Slab priors (KBASS). We use kernel regression to estimate the target function, which is flexible, expressive, and more robust to data sparsity and noises. We combine it with a Bayesian spike-and-slab prior -- an ideal Bayesian sparse distribution -- for effective operator selection and uncertainty quantification. We develop an expectation propagation expectation-maximization (EP-EM) algorithm for efficient posterior inference and function estimation. To overcome the computational challenge of kernel regression, we pla",
    "link": "http://arxiv.org/abs/2310.05387",
    "context": "Title: Equation Discovery with Bayesian Spike-and-Slab Priors and Efficient Kernels. (arXiv:2310.05387v1 [cs.LG])\nAbstract: Discovering governing equations from data is important to many scientific and engineering applications. Despite promising successes, existing methods are still challenged by data sparsity as well as noise issues, both of which are ubiquitous in practice. Moreover, state-of-the-art methods lack uncertainty quantification and/or are costly in training. To overcome these limitations, we propose a novel equation discovery method based on Kernel learning and BAyesian Spike-and-Slab priors (KBASS). We use kernel regression to estimate the target function, which is flexible, expressive, and more robust to data sparsity and noises. We combine it with a Bayesian spike-and-slab prior -- an ideal Bayesian sparse distribution -- for effective operator selection and uncertainty quantification. We develop an expectation propagation expectation-maximization (EP-EM) algorithm for efficient posterior inference and function estimation. To overcome the computational challenge of kernel regression, we pla",
    "path": "papers/23/10/2310.05387.json",
    "total_tokens": 957,
    "translated_title": "基于贝叶斯Spike-and-Slab先验和高效核函数的方程式发现方法",
    "translated_abstract": "从数据中发现控制方程对于许多科学和工程应用非常重要。然而，尽管有一些有希望的成功案例，现有方法仍然面临着数据稀疏性和噪声问题的挑战，这在实践中随处可见。此外，最先进的方法缺乏不确定性量化和/或训练成本高昂。为了克服这些局限性，我们提出了一种基于核学习和贝叶斯Spike-and-Slab先验（KBASS）的新型方程式发现方法。我们使用核回归来估计目标函数，这种方法具有灵活性、表达力，并且对于数据稀疏性和噪声更加稳健。我们将其与贝叶斯Spike-and-Slab先验结合使用，后者是一种理想的贝叶斯稀疏分布，用于有效的算子选择和不确定性量化。我们开发了一种基于期望传播期望最大化（EP-EM）算法的有效后验推断和函数估计方法。为了克服核回归的计算挑战，我们使用了一种快速方法。",
    "tldr": "该论文提出了一种基于核学习和贝叶斯Spike-and-Slab先验的方程式发现方法，通过核回归和贝叶斯稀疏分布，能够有效处理数据稀疏性和噪声问题，并进行不确定性量化和高效的后验推断和函数估计。"
}