{
    "title": "Excision and Recovery: Enhancing Surface Anomaly Detection with Attention-based Single Deterministic Masking. (arXiv:2310.04010v1 [cs.CV])",
    "abstract": "Anomaly detection (AD) in surface inspection is an essential yet challenging task in manufacturing due to the quantity imbalance problem of scarce abnormal data. To overcome the above, a reconstruction encoder-decoder (ED) such as autoencoder or U-Net which is trained with only anomaly-free samples is widely adopted, in the hope that unseen abnormals should yield a larger reconstruction error than normal. Over the past years, researches on self-supervised reconstruction-by-inpainting have been reported. They mask out suspected defective regions for inpainting in order to make them invisible to the reconstruction ED to deliberately cause inaccurate reconstruction for abnormals. However, their limitation is multiple random masking to cover the whole input image due to defective regions not being known in advance. We propose a novel reconstruction-by-inpainting method dubbed Excision and Recovery (EAR) that features single deterministic masking. For this, we exploit a pre-trained spatial ",
    "link": "http://arxiv.org/abs/2310.04010",
    "context": "Title: Excision and Recovery: Enhancing Surface Anomaly Detection with Attention-based Single Deterministic Masking. (arXiv:2310.04010v1 [cs.CV])\nAbstract: Anomaly detection (AD) in surface inspection is an essential yet challenging task in manufacturing due to the quantity imbalance problem of scarce abnormal data. To overcome the above, a reconstruction encoder-decoder (ED) such as autoencoder or U-Net which is trained with only anomaly-free samples is widely adopted, in the hope that unseen abnormals should yield a larger reconstruction error than normal. Over the past years, researches on self-supervised reconstruction-by-inpainting have been reported. They mask out suspected defective regions for inpainting in order to make them invisible to the reconstruction ED to deliberately cause inaccurate reconstruction for abnormals. However, their limitation is multiple random masking to cover the whole input image due to defective regions not being known in advance. We propose a novel reconstruction-by-inpainting method dubbed Excision and Recovery (EAR) that features single deterministic masking. For this, we exploit a pre-trained spatial ",
    "path": "papers/23/10/2310.04010.json",
    "total_tokens": 864,
    "translated_title": "使用基于注意力的单确定性遮罩增强表面异常检测",
    "translated_abstract": "表面检测中的异常检测是制造业中一个至关重要但具有挑战性的任务，由于稀缺异常数据的数量不平衡问题。为了克服上述问题，广泛采用仅使用无异常样本训练的重建编码-解码器（ED），例如自编码器或U-Net，希望未见过的异常应该产生比正常情况更大的重建误差。在过去的几年中，有关自我监督重建-修复的研究已经报道。他们遮挡了可疑的缺陷区域以进行修复，以使它们对重建ED不可见，从而故意导致异常的不准确重建。然而，他们的局限性在于多次随机遮罩以覆盖整个输入图像，因为不会事先知道缺陷区域。我们提出了一种名为Excision and Recovery (EAR)的新型重建-修复方法，具有单确定性遮罩的特点。为此，我们利用了一个预训练的空间",
    "tldr": "本文提出了一种名为Excision and Recovery (EAR)的新型重建-修复方法，通过使用单确定性遮罩来增强表面异常检测任务。"
}