{
    "title": "A Review of Digital Learning Environments for Teaching Natural Language Processing in K-12 Education. (arXiv:2310.01603v1 [cs.CL])",
    "abstract": "Natural Language Processing (NLP) plays a significant role in our daily lives and has become an essential part of Artificial Intelligence (AI) education in K-12. As children grow up with NLP-powered applications, it is crucial to introduce NLP concepts to them, fostering their understanding of language processing, language generation, and ethical implications of AI and NLP. This paper presents a comprehensive review of digital learning environments for teaching NLP in K-12. Specifically, it explores existing digital learning tools, discusses how they support specific NLP tasks and procedures, and investigates their explainability and evaluation results in educational contexts. By examining the strengths and limitations of these tools, this literature review sheds light on the current state of NLP learning tools in K-12 education. It aims to guide future research efforts to refine existing tools, develop new ones, and explore more effective and inclusive strategies for integrating NLP i",
    "link": "http://arxiv.org/abs/2310.01603",
    "context": "Title: A Review of Digital Learning Environments for Teaching Natural Language Processing in K-12 Education. (arXiv:2310.01603v1 [cs.CL])\nAbstract: Natural Language Processing (NLP) plays a significant role in our daily lives and has become an essential part of Artificial Intelligence (AI) education in K-12. As children grow up with NLP-powered applications, it is crucial to introduce NLP concepts to them, fostering their understanding of language processing, language generation, and ethical implications of AI and NLP. This paper presents a comprehensive review of digital learning environments for teaching NLP in K-12. Specifically, it explores existing digital learning tools, discusses how they support specific NLP tasks and procedures, and investigates their explainability and evaluation results in educational contexts. By examining the strengths and limitations of these tools, this literature review sheds light on the current state of NLP learning tools in K-12 education. It aims to guide future research efforts to refine existing tools, develop new ones, and explore more effective and inclusive strategies for integrating NLP i",
    "path": "papers/23/10/2310.01603.json",
    "total_tokens": 971,
    "translated_title": "K-12教育中教授自然语言处理的数字学习环境综述",
    "translated_abstract": "自然语言处理（NLP）在我们的日常生活中起着重要作用，并且已成为K-12人工智能教育的重要组成部分。随着孩子们在NLP驱动的应用程序中成长，向他们介绍NLP概念对培养他们对语言处理、语言生成以及人工智能和NLP的伦理问题的理解至关重要。本文综述了K-12教育中教授NLP的数字学习环境。具体而言，它探讨了现有的数字学习工具，讨论了它们如何支持特定的NLP任务和流程，并调查了它们在教育环境中的解释性和评估结果。通过检查这些工具的优点和限制，本文综述为我们了解当前K-12教育中NLP学习工具的现状提供了指导。它旨在引导未来的研究努力，以改进现有工具、开发新工具，并探索更有效和包容性的NLP整合策略。",
    "tldr": "这篇综述论文介绍了K-12教育中教授自然语言处理的数字学习环境，并讨论了现有工具的支持、解释性和评估结果，以指导未来研究努力改进现有工具、开发新工具，并探索更有效和包容性的NLP整合策略。",
    "en_tdlr": "This review paper presents a comprehensive overview of digital learning environments for teaching Natural Language Processing (NLP) in K-12 education. It discusses existing tools, their support, explainability, and evaluation results, aiming to guide future research efforts in improving existing tools, developing new ones, and exploring more effective and inclusive strategies for integrating NLP in education."
}