{
    "title": "Octopus: A Multitask Model and Toolkit for Arabic Natural Language Generation. (arXiv:2310.16127v1 [cs.CL])",
    "abstract": "Understanding Arabic text and generating human-like responses is a challenging endeavor. While many researchers have proposed models and solutions for individual problems, there is an acute shortage of a comprehensive Arabic natural language generation toolkit that is capable of handling a wide range of tasks. In this work, we present a novel Arabic text-to-text Transformer model, namely AraT5v2. Our new model is methodically trained on extensive and diverse data, utilizing an extended sequence length of 2,048 tokens. We explore various pretraining strategies including unsupervised, supervised, and joint pertaining, under both single and multitask settings. Our models outperform competitive baselines with large margins. We take our work one step further by developing and publicly releasing Octopus, a Python-based package and command-line toolkit tailored for eight Arabic generation tasks all exploiting a single model. We release the models and the toolkit on our public repository.",
    "link": "http://arxiv.org/abs/2310.16127",
    "context": "Title: Octopus: A Multitask Model and Toolkit for Arabic Natural Language Generation. (arXiv:2310.16127v1 [cs.CL])\nAbstract: Understanding Arabic text and generating human-like responses is a challenging endeavor. While many researchers have proposed models and solutions for individual problems, there is an acute shortage of a comprehensive Arabic natural language generation toolkit that is capable of handling a wide range of tasks. In this work, we present a novel Arabic text-to-text Transformer model, namely AraT5v2. Our new model is methodically trained on extensive and diverse data, utilizing an extended sequence length of 2,048 tokens. We explore various pretraining strategies including unsupervised, supervised, and joint pertaining, under both single and multitask settings. Our models outperform competitive baselines with large margins. We take our work one step further by developing and publicly releasing Octopus, a Python-based package and command-line toolkit tailored for eight Arabic generation tasks all exploiting a single model. We release the models and the toolkit on our public repository.",
    "path": "papers/23/10/2310.16127.json",
    "total_tokens": 912,
    "translated_title": "Octopus: 用于阿拉伯语自然语言生成的多任务模型和工具包",
    "translated_abstract": "理解阿拉伯文本并产生人类化的回复是一项具有挑战性的任务。尽管许多研究人员提出了针对特定问题的模型和解决方案，但目前缺乏一个全面的阿拉伯语自然语言生成工具包，能够处理各种任务。本研究中，我们提出了一种新颖的阿拉伯文本到文本Transformer模型，名为AraT5v2。我们的新模型在广泛而多样化的数据上进行了系统训练，利用了扩展的序列长度达到2,048个标记。我们探索了各种预训练策略，包括无监督、有监督和联合训练，单任务和多任务设置下的表现。我们的模型在性能上超过了竞争基准线。我们进一步开发并公开发布了Octopus，一个基于Python的套件和命令行工具，专门针对八项阿拉伯语生成任务，全部利用单个模型。我们在我们的公共代码库上发布了模型和工具包。",
    "tldr": "Octopus是一个用于阿拉伯语自然语言生成的多任务模型和工具包，通过新颖的AraT5v2模型和系统训练，在各种预训练策略下实现了优于竞争基准线的性能。"
}