{
    "title": "Efficient machine-learning surrogates for large-scale geological carbon and energy storage. (arXiv:2310.07461v1 [cs.CE])",
    "abstract": "Geological carbon and energy storage are pivotal for achieving net-zero carbon emissions and addressing climate change. However, they face uncertainties due to geological factors and operational limitations, resulting in possibilities of induced seismic events or groundwater contamination. To overcome these challenges, we propose a specialized machine-learning (ML) model to manage extensive reservoir models efficiently.  While ML approaches hold promise for geological carbon storage, the substantial computational resources required for large-scale analysis are the obstacle. We've developed a method to reduce the training cost for deep neural operator models, using domain decomposition and a topology embedder to link spatio-temporal points. This approach allows accurate predictions within the model's domain, even for untrained data, enhancing ML efficiency for large-scale geological storage applications.",
    "link": "http://arxiv.org/abs/2310.07461",
    "context": "Title: Efficient machine-learning surrogates for large-scale geological carbon and energy storage. (arXiv:2310.07461v1 [cs.CE])\nAbstract: Geological carbon and energy storage are pivotal for achieving net-zero carbon emissions and addressing climate change. However, they face uncertainties due to geological factors and operational limitations, resulting in possibilities of induced seismic events or groundwater contamination. To overcome these challenges, we propose a specialized machine-learning (ML) model to manage extensive reservoir models efficiently.  While ML approaches hold promise for geological carbon storage, the substantial computational resources required for large-scale analysis are the obstacle. We've developed a method to reduce the training cost for deep neural operator models, using domain decomposition and a topology embedder to link spatio-temporal points. This approach allows accurate predictions within the model's domain, even for untrained data, enhancing ML efficiency for large-scale geological storage applications.",
    "path": "papers/23/10/2310.07461.json",
    "total_tokens": 828,
    "translated_title": "大规模地质碳和能源储存的高效机器学习替代品",
    "translated_abstract": "地质碳和能源储存对于实现净零碳排放和应对气候变化至关重要。然而，由于地质因素和操作限制，它们面临不确定性，可能引发地震事件或地下水污染。为了克服这些挑战，我们提出了一种专门的机器学习（ML）模型，以高效地管理广泛的储层模型。虽然机器学习方法在地质碳储存方面具有潜力，但大规模分析所需的计算资源是一个障碍。我们开发了一种方法，通过域分解和拓扑嵌入器来降低深度神经算子模型的训练成本，以链接时空点，从而实现在模型领域内对未经训练的数据进行精确预测，提高机器学习在大规模地质储存应用中的效率。",
    "tldr": "本研究提出了一种专门的机器学习（ML）模型，通过域分解和拓扑嵌入器降低训练成本，提高机器学习在大规模地质储存应用中的效率。"
}