{
    "title": "Mean-field Libor market model and valuation of long term guarantees. (arXiv:2310.09022v1 [q-fin.RM])",
    "abstract": "Existence and uniqueness of solutions to the multi-dimensional mean-field Libor market model (introduced by [7]) is shown. This is used as the basis for a numerical asset-liability management (ALM) model capable of calculating future discretionary benefits in accordance with Solvency~II regulation. This ALM model is complimented with aggregated life insurance data to perform a realistic numerical study. This yields numerical evidence for heuristic assumptions which allow to derive estimators of lower and upper bounds for future discretionary benefits. These estimators are applied to publicly available life insurance data.",
    "link": "http://arxiv.org/abs/2310.09022",
    "context": "Title: Mean-field Libor market model and valuation of long term guarantees. (arXiv:2310.09022v1 [q-fin.RM])\nAbstract: Existence and uniqueness of solutions to the multi-dimensional mean-field Libor market model (introduced by [7]) is shown. This is used as the basis for a numerical asset-liability management (ALM) model capable of calculating future discretionary benefits in accordance with Solvency~II regulation. This ALM model is complimented with aggregated life insurance data to perform a realistic numerical study. This yields numerical evidence for heuristic assumptions which allow to derive estimators of lower and upper bounds for future discretionary benefits. These estimators are applied to publicly available life insurance data.",
    "path": "papers/23/10/2310.09022.json",
    "total_tokens": 801,
    "translated_title": "均场Libor市场模型和长期保证的估值",
    "translated_abstract": "本研究证明了多维均场Libor市场模型（由[7]引入）的解的存在和唯一性。这一模型被用作能够根据Solvency~II规定计算未来福利的数值资产负债管理（ALM）模型的基础。此ALM模型结合了综合寿险数据进行实际的数值研究，从而提供了对启发性假设的数值证据，这些假设可以用来推导未来福利的下限和上限的估计量。这些估计量被应用到公开可得到的寿险数据中。",
    "tldr": "该论文展示了多维均场Libor市场模型的解的存在和唯一性，并基于此模型构建了一个能够根据Solvency~II规定计算未来福利的数值资产负债管理模型。通过综合寿险数据进行数值研究，论文提供了对未来福利下限和上限的估计量的启发性假设的数值证据。这些估计量被应用到公开可得到的寿险数据中。",
    "en_tdlr": "This paper demonstrates the existence and uniqueness of solutions for the multi-dimensional mean-field Libor market model and develops a numerical asset-liability management model based on this, capable of calculating future discretionary benefits according to Solvency~II regulation. The study provides numerical evidence for heuristic assumptions on lower and upper bounds of future discretionary benefits, applied to publicly available life insurance data."
}