{
    "title": "Differentiable Learning of Generalized Structured Matrices for Efficient Deep Neural Networks",
    "abstract": "arXiv:2310.18882v2 Announce Type: replace-cross  Abstract: This paper investigates efficient deep neural networks (DNNs) to replace dense unstructured weight matrices with structured ones that possess desired properties. The challenge arises because the optimal weight matrix structure in popular neural network models is obscure in most cases and may vary from layer to layer even in the same network. Prior structured matrices proposed for efficient DNNs were mostly hand-crafted without a generalized framework to systematically learn them. To address this issue, we propose a generalized and differentiable framework to learn efficient structures of weight matrices by gradient descent. We first define a new class of structured matrices that covers a wide range of structured matrices in the literature by adjusting the structural parameters. Then, the frequency-domain differentiable parameterization scheme based on the Gaussian-Dirichlet kernel is adopted to learn the structural parameters b",
    "link": "https://arxiv.org/abs/2310.18882",
    "context": "Title: Differentiable Learning of Generalized Structured Matrices for Efficient Deep Neural Networks\nAbstract: arXiv:2310.18882v2 Announce Type: replace-cross  Abstract: This paper investigates efficient deep neural networks (DNNs) to replace dense unstructured weight matrices with structured ones that possess desired properties. The challenge arises because the optimal weight matrix structure in popular neural network models is obscure in most cases and may vary from layer to layer even in the same network. Prior structured matrices proposed for efficient DNNs were mostly hand-crafted without a generalized framework to systematically learn them. To address this issue, we propose a generalized and differentiable framework to learn efficient structures of weight matrices by gradient descent. We first define a new class of structured matrices that covers a wide range of structured matrices in the literature by adjusting the structural parameters. Then, the frequency-domain differentiable parameterization scheme based on the Gaussian-Dirichlet kernel is adopted to learn the structural parameters b",
    "path": "papers/23/10/2310.18882.json",
    "total_tokens": 689,
    "translated_title": "可微学习广义结构化矩阵以实现高效深度神经网络",
    "translated_abstract": "本文研究了有效的深度神经网络（DNNs），通过具有所需属性的结构化矩阵取代密集非结构化权重矩阵。我们提出了一个广义和可微的框架，通过梯度下降学习权重矩阵的高效结构。我们首先定义了一类新的结构化矩阵，通过调整结构参数覆盖了文献中广泛的结构化矩阵。然后，采用基于高斯-狄利克雷核的频域可微参数化方案来学习结构参数。",
    "tldr": "提出了一种可微的广义框架，通过梯度下降学习高效的权重矩阵结构。"
}