{
    "title": "Potential Factors Leading to Popularity Unfairness in Recommender Systems: A User-Centered Analysis. (arXiv:2310.02961v1 [cs.IR])",
    "abstract": "Popularity bias is a well-known issue in recommender systems where few popular items are over-represented in the input data, while majority of other less popular items are under-represented. This disparate representation often leads to bias in exposure given to the items in the recommendation results. Extensive research examined this bias from item perspective and attempted to mitigate it by enhancing the recommendation of less popular items. However, a recent research has revealed the impact of this bias on users. Users with different degree of tolerance toward popular items are not fairly served by the recommendation system: users interested in less popular items receive more popular items in their recommendations, while users interested in popular items are recommended what they want. This is mainly due to the popularity bias that popular items are over-recommended. In this paper, we aim at investigating the factors leading to this user-side unfairness of popularity bias in recommen",
    "link": "http://arxiv.org/abs/2310.02961",
    "context": "Title: Potential Factors Leading to Popularity Unfairness in Recommender Systems: A User-Centered Analysis. (arXiv:2310.02961v1 [cs.IR])\nAbstract: Popularity bias is a well-known issue in recommender systems where few popular items are over-represented in the input data, while majority of other less popular items are under-represented. This disparate representation often leads to bias in exposure given to the items in the recommendation results. Extensive research examined this bias from item perspective and attempted to mitigate it by enhancing the recommendation of less popular items. However, a recent research has revealed the impact of this bias on users. Users with different degree of tolerance toward popular items are not fairly served by the recommendation system: users interested in less popular items receive more popular items in their recommendations, while users interested in popular items are recommended what they want. This is mainly due to the popularity bias that popular items are over-recommended. In this paper, we aim at investigating the factors leading to this user-side unfairness of popularity bias in recommen",
    "path": "papers/23/10/2310.02961.json",
    "total_tokens": 864,
    "translated_title": "推荐系统中导致流行度不公平的潜在因素：基于用户的分析",
    "translated_abstract": "流行度偏差是推荐系统中众所周知的问题，其中少数流行物品在输入数据中被过度代表，而其他大部分不那么流行的物品则被低估。这种不平等的代表往往导致推荐结果中物品的暴露存在偏见。已有大量研究从物品的角度研究了这种偏差，并试图通过增强对不那么流行物品的推荐来缓解。然而，最近的研究揭示了这种偏差对用户的影响。对于对流行物品有着不同容忍度的用户而言，推荐系统并不能公平地为他们提供服务：对于对不那么流行物品感兴趣的用户，在他们的推荐中会得到更多的流行物品，而对于对流行物品感兴趣的用户，则被推荐了他们想要的物品。主要原因是流行度偏差使得流行物品被过度推荐。本文旨在探究导致推荐系统中用户端流行度偏见不公平的因素。",
    "tldr": "该论文研究了导致推荐系统中用户端流行度偏见不公平的因素。"
}