{
    "title": "CSG: Curriculum Representation Learning for Signed Graph. (arXiv:2310.11083v1 [cs.LG])",
    "abstract": "Signed graphs are valuable for modeling complex relationships with positive and negative connections, and Signed Graph Neural Networks (SGNNs) have become crucial tools for their analysis. However, prior to our work, no specific training plan existed for SGNNs, and the conventional random sampling approach did not address varying learning difficulties within the graph's structure. We proposed a curriculum-based training approach, where samples progress from easy to complex, inspired by human learning. To measure learning difficulty, we introduced a lightweight mechanism and created the Curriculum representation learning framework for Signed Graphs (CSG). This framework optimizes the order in which samples are presented to the SGNN model. Empirical validation across six real-world datasets showed impressive results, enhancing SGNN model accuracy by up to 23.7% in link sign prediction (AUC) and significantly improving stability with an up to 8.4 reduction in the standard deviation of AUC",
    "link": "http://arxiv.org/abs/2310.11083",
    "context": "Title: CSG: Curriculum Representation Learning for Signed Graph. (arXiv:2310.11083v1 [cs.LG])\nAbstract: Signed graphs are valuable for modeling complex relationships with positive and negative connections, and Signed Graph Neural Networks (SGNNs) have become crucial tools for their analysis. However, prior to our work, no specific training plan existed for SGNNs, and the conventional random sampling approach did not address varying learning difficulties within the graph's structure. We proposed a curriculum-based training approach, where samples progress from easy to complex, inspired by human learning. To measure learning difficulty, we introduced a lightweight mechanism and created the Curriculum representation learning framework for Signed Graphs (CSG). This framework optimizes the order in which samples are presented to the SGNN model. Empirical validation across six real-world datasets showed impressive results, enhancing SGNN model accuracy by up to 23.7% in link sign prediction (AUC) and significantly improving stability with an up to 8.4 reduction in the standard deviation of AUC",
    "path": "papers/23/10/2310.11083.json",
    "total_tokens": 914,
    "translated_title": "CSG: 用于有符号图的课程表示学习",
    "translated_abstract": "有符号图对于建模具有正负连接的复杂关系非常有价值，有符号图神经网络已成为其分析的重要工具。然而，在我们的工作之前，没有针对有符号图神经网络的特定训练方案，并且传统的随机抽样方法没有解决图结构中不同学习困难的问题。我们提出了一种基于课程的训练方法，其中样本从易到难，灵感来自于人类学习。为了衡量学习困难，我们引入了一个轻量级机制，并创建了用于有符号图的课程表示学习框架（CSG）。通过对六个真实数据集的实证验证，我们取得了令人印象深刻的结果，在链接符号预测（AUC）方面将SGNN模型的准确性提高了高达23.7％，并且在AUC的标准差方面显著提高了稳定性，最多减少了8.4。",
    "tldr": "本文提出了一种用于有符号图的课程表示学习框架（CSG），通过引入课程化训练方法和轻量级机制，实现了按难易程度优化样本展示顺序，从而提高有符号图神经网络（SGNN）模型的准确性和稳定性。",
    "en_tdlr": "This paper proposes a curriculum representation learning framework (CSG) for signed graphs, which optimizes the order of sample presentation to improve the accuracy and stability of Signed Graph Neural Networks (SGNNs) by introducing a curriculum-based training approach and a lightweight mechanism for measuring learning difficulty."
}