{
    "title": "MusicAgent: An AI Agent for Music Understanding and Generation with Large Language Models. (arXiv:2310.11954v1 [cs.CL])",
    "abstract": "AI-empowered music processing is a diverse field that encompasses dozens of tasks, ranging from generation tasks (e.g., timbre synthesis) to comprehension tasks (e.g., music classification). For developers and amateurs, it is very difficult to grasp all of these task to satisfy their requirements in music processing, especially considering the huge differences in the representations of music data and the model applicability across platforms among various tasks. Consequently, it is necessary to build a system to organize and integrate these tasks, and thus help practitioners to automatically analyze their demand and call suitable tools as solutions to fulfill their requirements. Inspired by the recent success of large language models (LLMs) in task automation, we develop a system, named MusicAgent, which integrates numerous music-related tools and an autonomous workflow to address user requirements. More specifically, we build 1) toolset that collects tools from diverse sources, includi",
    "link": "http://arxiv.org/abs/2310.11954",
    "context": "Title: MusicAgent: An AI Agent for Music Understanding and Generation with Large Language Models. (arXiv:2310.11954v1 [cs.CL])\nAbstract: AI-empowered music processing is a diverse field that encompasses dozens of tasks, ranging from generation tasks (e.g., timbre synthesis) to comprehension tasks (e.g., music classification). For developers and amateurs, it is very difficult to grasp all of these task to satisfy their requirements in music processing, especially considering the huge differences in the representations of music data and the model applicability across platforms among various tasks. Consequently, it is necessary to build a system to organize and integrate these tasks, and thus help practitioners to automatically analyze their demand and call suitable tools as solutions to fulfill their requirements. Inspired by the recent success of large language models (LLMs) in task automation, we develop a system, named MusicAgent, which integrates numerous music-related tools and an autonomous workflow to address user requirements. More specifically, we build 1) toolset that collects tools from diverse sources, includi",
    "path": "papers/23/10/2310.11954.json",
    "total_tokens": 844,
    "translated_title": "MusicAgent：一种用于音乐理解和生成的人工智能代理，基于大型语言模型",
    "translated_abstract": "AI-加强的音乐处理是一个多样化的领域，涵盖了许多任务，从生成任务（例如音色合成）到理解任务（例如音乐分类）。对于开发人员和业余爱好者来说，很难掌握所有这些任务，以满足他们在音乐处理方面的需求，尤其考虑到音乐数据的表示和不同任务之间的模型适用性在各个平台上存在巨大差异。因此，建立一个系统来组织和集成这些任务，并帮助从业者自动分析他们的需求并调用适当的工具作为解决方案来满足他们的要求是必要的。受大型语言模型（LLMs）在任务自动化方面的最新成功启示，我们开发了一个名为MusicAgent的系统，它集成了众多与音乐相关的工具和自主工作流程，以满足用户的需求。",
    "tldr": "MusicAgent是一个使用大型语言模型的AI代理，通过集成音乐相关工具和自主工作流程，帮助用户自动分析需求并调用合适的工具进行音乐处理。"
}