{
    "title": "Optimization-Free Test-Time Adaptation for Cross-Person Activity Recognition",
    "abstract": "Human Activity Recognition (HAR) models often suffer from performance degradation in real-world applications due to distribution shifts in activity patterns across individuals. Test-Time Adaptation (TTA) is an emerging learning paradigm that aims to utilize the test stream to adjust predictions in real-time inference, which has not been explored in HAR before. However, the high computational cost of optimization-based TTA algorithms makes it intractable to run on resource-constrained edge devices. In this paper, we propose an Optimization-Free Test-Time Adaptation (OFTTA) framework for sensor-based HAR. OFTTA adjusts the feature extractor and linear classifier simultaneously in an optimization-free manner. For the feature extractor, we propose Exponential DecayTest-time Normalization (EDTN) to replace the conventional batch normalization (CBN) layers. EDTN combines CBN and Test-time batch Normalization (TBN) to extract reliable features against domain shifts with TBN's influence decrea",
    "link": "https://arxiv.org/abs/2310.18562",
    "context": "Title: Optimization-Free Test-Time Adaptation for Cross-Person Activity Recognition\nAbstract: Human Activity Recognition (HAR) models often suffer from performance degradation in real-world applications due to distribution shifts in activity patterns across individuals. Test-Time Adaptation (TTA) is an emerging learning paradigm that aims to utilize the test stream to adjust predictions in real-time inference, which has not been explored in HAR before. However, the high computational cost of optimization-based TTA algorithms makes it intractable to run on resource-constrained edge devices. In this paper, we propose an Optimization-Free Test-Time Adaptation (OFTTA) framework for sensor-based HAR. OFTTA adjusts the feature extractor and linear classifier simultaneously in an optimization-free manner. For the feature extractor, we propose Exponential DecayTest-time Normalization (EDTN) to replace the conventional batch normalization (CBN) layers. EDTN combines CBN and Test-time batch Normalization (TBN) to extract reliable features against domain shifts with TBN's influence decrea",
    "path": "papers/23/10/2310.18562.json",
    "total_tokens": 973,
    "translated_title": "无需优化的测试时适应性跨人活动识别",
    "translated_abstract": "由于活动模式在个体间存在分布偏移，人体活动识别（HAR）模型在实际应用中往往会遭受性能下降。测试时适应（TTA）是一种新兴的学习范式，旨在利用测试数据流在实时推理中调整预测结果，而这在HAR领域尚未得到探索。然而，基于优化的TTA算法的高计算成本使得其在资源受限的边缘设备上无法执行。本文提出了一种无需优化的测试时适应（OFTTA）框架，用于基于传感器的HAR。OFTTA以无需优化的方式同时调整特征提取器和线性分类器。对于特征提取器，我们提出了指数衰减测试时归一化（EDTN）来替代传统的批归一化（CBN）层。EDTN通过结合CBN和测试时批归一化（TBN）来提取可靠的特征以应对领域偏移，其中TBN的影响逐渐减小。",
    "tldr": "本文提出了一种无需优化的测试时适应（OFTTA）框架，用于解决人体活动识别中的个体间分布偏移问题。该框架通过调整特征提取器和线性分类器的方式来适应不同个体的活动模式，并采用指数衰减测试时归一化（EDTN）替代传统批归一化来提取可靠的特征。"
}