{
    "title": "MLatom 3: Platform for machine learning-enhanced computational chemistry simulations and workflows. (arXiv:2310.20155v1 [physics.chem-ph])",
    "abstract": "Machine learning (ML) is increasingly becoming a common tool in computational chemistry. At the same time, the rapid development of ML methods requires a flexible software framework for designing custom workflows. MLatom 3 is a program package designed to leverage the power of ML to enhance typical computational chemistry simulations and to create complex workflows. This open-source package provides plenty of choice to the users who can run simulations with the command line options, input files, or with scripts using MLatom as a Python package, both on their computers and on the online XACS cloud computing at XACScloud.com. Computational chemists can calculate energies and thermochemical properties, optimize geometries, run molecular and quantum dynamics, and simulate (ro)vibrational, one-photon UV/vis absorption, and two-photon absorption spectra with ML, quantum mechanical, and combined models. The users can choose from an extensive library of methods containing pre-trained ML models",
    "link": "http://arxiv.org/abs/2310.20155",
    "context": "Title: MLatom 3: Platform for machine learning-enhanced computational chemistry simulations and workflows. (arXiv:2310.20155v1 [physics.chem-ph])\nAbstract: Machine learning (ML) is increasingly becoming a common tool in computational chemistry. At the same time, the rapid development of ML methods requires a flexible software framework for designing custom workflows. MLatom 3 is a program package designed to leverage the power of ML to enhance typical computational chemistry simulations and to create complex workflows. This open-source package provides plenty of choice to the users who can run simulations with the command line options, input files, or with scripts using MLatom as a Python package, both on their computers and on the online XACS cloud computing at XACScloud.com. Computational chemists can calculate energies and thermochemical properties, optimize geometries, run molecular and quantum dynamics, and simulate (ro)vibrational, one-photon UV/vis absorption, and two-photon absorption spectra with ML, quantum mechanical, and combined models. The users can choose from an extensive library of methods containing pre-trained ML models",
    "path": "papers/23/10/2310.20155.json",
    "total_tokens": 853,
    "translated_title": "MLatom 3: 用于增强计算化学模拟和工作流的机器学习平台",
    "translated_abstract": "机器学习在计算化学中越来越成为常用工具。MLatom 3 是一个程序包，旨在利用机器学习的强大能力增强典型的计算化学模拟，并创建复杂的工作流。这个开源包提供了多种选择，用户可以通过命令行选项、输入文件或使用MLatom作为Python包的脚本在他们的计算机上或通过XACS云计算平台运行模拟。计算化学家可以使用ML、量子力学和组合模型计算能量和热化学性质，优化几何结构，运行分子和量子动力学，并模拟(转动)振动，单光子UV/可见吸收和双光子吸收谱。用户可以从包含预训练ML模型的广泛方法库中进行选择。",
    "tldr": "MLatom 3是一个机器学习平台，用于增强计算化学模拟和创建复杂工作流。用户可以选择多种模拟方法和预训练的ML模型进行能量计算、优化几何结构和模拟光谱等计算化学任务。"
}