{
    "title": "Utilizing Weak Supervision To Generate Indonesian Conservation Dataset. (arXiv:2310.11258v2 [cs.CL] UPDATED)",
    "abstract": "Weak supervision has emerged as a promising approach for rapid and large-scale dataset creation in response to the increasing demand for accelerated NLP development. By leveraging labeling functions, weak supervision allows practitioners to generate datasets quickly by creating learned label models that produce soft-labeled datasets. This paper aims to show how such an approach can be utilized to build an Indonesian NLP dataset from conservation news text. We construct two types of datasets: multi-class classification and sentiment classification. We then provide baseline experiments using various pretrained language models. These baseline results demonstrate test performances of 59.79% accuracy and 55.72% F1-score for sentiment classification, 66.87% F1-score-macro, 71.5% F1-score-micro, and 83.67% ROC-AUC for multi-class classification. Additionally, we release the datasets and labeling functions used in this work for further research and exploration.",
    "link": "http://arxiv.org/abs/2310.11258",
    "context": "Title: Utilizing Weak Supervision To Generate Indonesian Conservation Dataset. (arXiv:2310.11258v2 [cs.CL] UPDATED)\nAbstract: Weak supervision has emerged as a promising approach for rapid and large-scale dataset creation in response to the increasing demand for accelerated NLP development. By leveraging labeling functions, weak supervision allows practitioners to generate datasets quickly by creating learned label models that produce soft-labeled datasets. This paper aims to show how such an approach can be utilized to build an Indonesian NLP dataset from conservation news text. We construct two types of datasets: multi-class classification and sentiment classification. We then provide baseline experiments using various pretrained language models. These baseline results demonstrate test performances of 59.79% accuracy and 55.72% F1-score for sentiment classification, 66.87% F1-score-macro, 71.5% F1-score-micro, and 83.67% ROC-AUC for multi-class classification. Additionally, we release the datasets and labeling functions used in this work for further research and exploration.",
    "path": "papers/23/10/2310.11258.json",
    "total_tokens": 877,
    "translated_title": "利用弱监督生成印尼保护数据集",
    "translated_abstract": "弱监督已经成为一种快速和大规模数据集创建的有希望的方法，以响应加速自然语言处理开发的需求增加。通过利用标注函数，弱监督允许从产生软标签数据集的学习到的标签模型创建数据集。本文旨在展示如何利用这种方法从保护新闻文本构建印尼自然语言处理数据集。我们构建了两种类型的数据集：多类别分类和情感分类。然后我们使用各种预训练语言模型进行基线实验。这些基线结果展示了情感分类为59.79%准确率和55.72% F1分数，多类别分类为66.87% F1分数-宏平均，71.5% F1分数-微平均和83.67% ROC-AUC的测试性能。此外，我们还发布了在这项工作中使用的数据集和标注函数，供进一步的研究和探索使用。",
    "tldr": "本文展示了如何利用弱监督方法从保护新闻文本构建一种印尼自然语言处理数据集，并提供了多类别分类和情感分类的基线实验结果。此外，作者还发布了使用的数据集和标注函数供进一步研究和探索。",
    "en_tdlr": "This paper demonstrates how to utilize weak supervision to build an Indonesian NLP dataset from conservation news text. The authors provide baseline experiments for multi-class classification and sentiment classification, as well as release the datasets and labeling functions for further research and exploration."
}