{
    "title": "Poverty during Covid-19 in North Macedonia: Analysis of the distributional impact of the crisis and government response. (arXiv:2310.05114v1 [econ.GN])",
    "abstract": "In this paper we simulate the poverty effect of the Covid-19 pandemic in North Macedonia and we analyze the income-saving power of three key government measures: the employment-retention scheme, the relaxed Guaranteed Minimum Income support, and one-off cash allowances. In this attempt, the counterfactual scenarios are simulated by using MK-MOD, the Macedonian Tax and Benefit Microsimulation Model, incorporating actual data on the shock-s magnitude from the second quarter of 2020. The results suggest that without the government interventions, of the country-s two million citizens, an additional 120,000 people would have been pushed into poverty by COVID-19, where 340,000 were already poor before the pandemic. Of the 120,000 newly poor about 16,000 would have been pushed into destitute poverty. The government-s automatic stabilizers worked to shield the poorest people, though these were clearly pro-feminine. In all, the analyzed government measures recovered more than half of the income",
    "link": "http://arxiv.org/abs/2310.05114",
    "context": "Title: Poverty during Covid-19 in North Macedonia: Analysis of the distributional impact of the crisis and government response. (arXiv:2310.05114v1 [econ.GN])\nAbstract: In this paper we simulate the poverty effect of the Covid-19 pandemic in North Macedonia and we analyze the income-saving power of three key government measures: the employment-retention scheme, the relaxed Guaranteed Minimum Income support, and one-off cash allowances. In this attempt, the counterfactual scenarios are simulated by using MK-MOD, the Macedonian Tax and Benefit Microsimulation Model, incorporating actual data on the shock-s magnitude from the second quarter of 2020. The results suggest that without the government interventions, of the country-s two million citizens, an additional 120,000 people would have been pushed into poverty by COVID-19, where 340,000 were already poor before the pandemic. Of the 120,000 newly poor about 16,000 would have been pushed into destitute poverty. The government-s automatic stabilizers worked to shield the poorest people, though these were clearly pro-feminine. In all, the analyzed government measures recovered more than half of the income",
    "path": "papers/23/10/2310.05114.json",
    "total_tokens": 970,
    "translated_title": "Covid-19疫情对北马其顿贫困的影响：危机和政府反应的分析",
    "translated_abstract": "本文模拟了Covid-19在北马其顿的贫困影响，并分析了三项关键政府措施的收入保护能力：就业保留计划、放宽的保障最低收入支持和一次性现金津贴。我们使用MK-MOD，即北马其顿税收和福利微观模拟模型，通过将2020年第二季度的实际数据纳入考虑，模拟了反事实情景。研究结果表明，如果没有政府的干预，该国200万公民中会有额外的12万人因COVID-19而陷入贫困，其中34万人在疫情之前就已经贫困。其中，这12万人中约有1.6万人将被推入赤贫。政府的自动稳定器起到了保护最贫困人口的作用，尽管这些措施明显偏向女性。总体而言，分析的政府措施恢复了超过一半的收入。",
    "tldr": "本文模拟了Covid-19在北马其顿的贫困影响，分析了三项政府措施的收入保护能力。研究结果显示，如果没有政府干预，将有12万人因疫情陷入贫困，其中1.6万人将被推入赤贫。",
    "en_tdlr": "This paper simulates the poverty effect of Covid-19 in North Macedonia and analyzes the income-saving power of three key government measures. The results indicate that without government interventions, 120,000 people would have fallen into poverty, with 16,000 being pushed into destitute poverty."
}