{
    "title": "YOLO-BEV: Generating Bird's-Eye View in the Same Way as 2D Object Detection. (arXiv:2310.17379v1 [cs.CV])",
    "abstract": "Vehicle perception systems strive to achieve comprehensive and rapid visual interpretation of their surroundings for improved safety and navigation. We introduce YOLO-BEV, an efficient framework that harnesses a unique surrounding cameras setup to generate a 2D bird's-eye view of the vehicular environment. By strategically positioning eight cameras, each at a 45-degree interval, our system captures and integrates imagery into a coherent 3x3 grid format, leaving the center blank, providing an enriched spatial representation that facilitates efficient processing. In our approach, we employ YOLO's detection mechanism, favoring its inherent advantages of swift response and compact model structure. Instead of leveraging the conventional YOLO detection head, we augment it with a custom-designed detection head, translating the panoramically captured data into a unified bird's-eye view map of ego car. Preliminary results validate the feasibility of YOLO-BEV in real-time vehicular perception ta",
    "link": "http://arxiv.org/abs/2310.17379",
    "context": "Title: YOLO-BEV: Generating Bird's-Eye View in the Same Way as 2D Object Detection. (arXiv:2310.17379v1 [cs.CV])\nAbstract: Vehicle perception systems strive to achieve comprehensive and rapid visual interpretation of their surroundings for improved safety and navigation. We introduce YOLO-BEV, an efficient framework that harnesses a unique surrounding cameras setup to generate a 2D bird's-eye view of the vehicular environment. By strategically positioning eight cameras, each at a 45-degree interval, our system captures and integrates imagery into a coherent 3x3 grid format, leaving the center blank, providing an enriched spatial representation that facilitates efficient processing. In our approach, we employ YOLO's detection mechanism, favoring its inherent advantages of swift response and compact model structure. Instead of leveraging the conventional YOLO detection head, we augment it with a custom-designed detection head, translating the panoramically captured data into a unified bird's-eye view map of ego car. Preliminary results validate the feasibility of YOLO-BEV in real-time vehicular perception ta",
    "path": "papers/23/10/2310.17379.json",
    "total_tokens": 962,
    "translated_title": "YOLO-BEV：以与2D物体检测相同的方式生成鸟瞰图",
    "translated_abstract": "车辆感知系统旨在通过全面快速地解释其周围环境以改善安全性和导航能力。我们介绍了YOLO-BEV，这是一个高效的框架，利用独特的周围摄像头设置生成车辆环境的2D鸟瞰图。通过在45度间隔处策略性地放置八个摄像头，我们的系统捕获并整合图像到一个连贯的3x3网格格式，中心留空，提供了一个丰富的空间表示，便于高效处理。在我们的方法中，我们采用了YOLO的检测机制，借助其快速响应和紧凑的模型结构的固有优势。我们没有使用常规的YOLO检测头部，而是使用自定义设计的检测头部，将全景捕获的数据转化为统一的自车鸟瞰视图地图。初步结果验证了YOLO-BEV在实时车辆感知任务中的可行性。",
    "tldr": "YOLO-BEV是一个高效的框架，利用独特的摄像头设置生成车辆环境的2D鸟瞰图。它采用了YOLO的检测机制，并通过自定义设计的检测头部将全景数据转化为统一的鸟瞰视图地图。这种方法在实时车辆感知任务中具有实际可行性。",
    "en_tdlr": "YOLO-BEV is an efficient framework that generates a 2D bird's-eye view of the vehicular environment using a unique camera setup. It employs YOLO's detection mechanism and translates panoramic data into a unified bird's-eye view map through a custom-designed detection head. This approach is feasible for real-time vehicle perception tasks."
}