{
    "title": "Data-Driven Score-Based Models for Generating Stable Structures with Adaptive Crystal Cells. (arXiv:2310.10695v1 [physics.comp-ph])",
    "abstract": "The discovery of new functional and stable materials is a big challenge due to its complexity. This work aims at the generation of new crystal structures with desired properties, such as chemical stability and specified chemical composition, by using machine learning generative models. Compared to the generation of molecules, crystal structures pose new difficulties arising from the periodic nature of the crystal and from the specific symmetry constraints related to the space group. In this work, score-based probabilistic models based on annealed Langevin dynamics, which have shown excellent performance in various applications, are adapted to the task of crystal generation. The novelty of the presented approach resides in the fact that the lattice of the crystal cell is not fixed. During the training of the model, the lattice is learned from the available data, whereas during the sampling of a new chemical structure, two denoising processes are used in parallel to generate the lattice ",
    "link": "http://arxiv.org/abs/2310.10695",
    "context": "Title: Data-Driven Score-Based Models for Generating Stable Structures with Adaptive Crystal Cells. (arXiv:2310.10695v1 [physics.comp-ph])\nAbstract: The discovery of new functional and stable materials is a big challenge due to its complexity. This work aims at the generation of new crystal structures with desired properties, such as chemical stability and specified chemical composition, by using machine learning generative models. Compared to the generation of molecules, crystal structures pose new difficulties arising from the periodic nature of the crystal and from the specific symmetry constraints related to the space group. In this work, score-based probabilistic models based on annealed Langevin dynamics, which have shown excellent performance in various applications, are adapted to the task of crystal generation. The novelty of the presented approach resides in the fact that the lattice of the crystal cell is not fixed. During the training of the model, the lattice is learned from the available data, whereas during the sampling of a new chemical structure, two denoising processes are used in parallel to generate the lattice ",
    "path": "papers/23/10/2310.10695.json",
    "total_tokens": 867,
    "translated_title": "基于数据驱动的评分模型用于生成具有自适应晶胞的稳定结构",
    "translated_abstract": "由于其复杂性，发现新的功能性和稳定的材料是一个巨大的挑战。本研究旨在通过使用机器学习生成模型生成具有所需属性（例如化学稳定性和指定的化学成分）的新晶体结构。与生成分子相比，晶体结构由于晶体的周期性以及与空间群相关的特定对称性约束而带来新的困难。本研究采用基于退火Langevin动力学的评分概率模型来适应晶体生成任务。所提出的方法的创新之处在于晶胞的晶格不是固定的。在模型的训练过程中，晶格从可用数据中进行学习，而在生成新的化学结构的采样过程中，使用两个去噪过程并行生成晶格。",
    "tldr": "本研究提出了一种基于数据驱动的评分模型来生成具有自适应晶胞的稳定结构。该方法通过学习可用数据中的晶格，使用两个去噪过程并行生成晶格，以实现对具有所需属性的新晶体结构的生成。",
    "en_tdlr": "This paper introduces a data-driven score-based model to generate stable structures with adaptive crystal cells. By learning the lattice from available data and using two denoising processes in parallel, the proposed approach enables the generation of new crystal structures with desired properties."
}