{
    "title": "Multi-Resolution Audio-Visual Feature Fusion for Temporal Action Localization. (arXiv:2310.03456v1 [cs.CV])",
    "abstract": "Temporal Action Localization (TAL) aims to identify actions' start, end, and class labels in untrimmed videos. While recent advancements using transformer networks and Feature Pyramid Networks (FPN) have enhanced visual feature recognition in TAL tasks, less progress has been made in the integration of audio features into such frameworks. This paper introduces the Multi-Resolution Audio-Visual Feature Fusion (MRAV-FF), an innovative method to merge audio-visual data across different temporal resolutions. Central to our approach is a hierarchical gated cross-attention mechanism, which discerningly weighs the importance of audio information at diverse temporal scales. Such a technique not only refines the precision of regression boundaries but also bolsters classification confidence. Importantly, MRAV-FF is versatile, making it compatible with existing FPN TAL architectures and offering a significant enhancement in performance when audio data is available.",
    "link": "http://arxiv.org/abs/2310.03456",
    "context": "Title: Multi-Resolution Audio-Visual Feature Fusion for Temporal Action Localization. (arXiv:2310.03456v1 [cs.CV])\nAbstract: Temporal Action Localization (TAL) aims to identify actions' start, end, and class labels in untrimmed videos. While recent advancements using transformer networks and Feature Pyramid Networks (FPN) have enhanced visual feature recognition in TAL tasks, less progress has been made in the integration of audio features into such frameworks. This paper introduces the Multi-Resolution Audio-Visual Feature Fusion (MRAV-FF), an innovative method to merge audio-visual data across different temporal resolutions. Central to our approach is a hierarchical gated cross-attention mechanism, which discerningly weighs the importance of audio information at diverse temporal scales. Such a technique not only refines the precision of regression boundaries but also bolsters classification confidence. Importantly, MRAV-FF is versatile, making it compatible with existing FPN TAL architectures and offering a significant enhancement in performance when audio data is available.",
    "path": "papers/23/10/2310.03456.json",
    "total_tokens": 910,
    "translated_title": "多分辨率音频-视觉特征融合用于时域动作定位",
    "translated_abstract": "时域动作定位（TAL）旨在在未剪辑视频中识别动作的开始、结束和类别标签。虽然最近使用Transformer网络和特征金字塔网络（FPN）在TAL任务中增强了视觉特征识别，但在将音频特征整合到此类框架中方面取得的进展较少。本文介绍了多分辨率音频-视觉特征融合（MRAV-FF），这是一种将不同时间分辨率的音频-视觉数据合并的创新方法。我们方法的核心是一种分层门控交叉注意力机制，可以分辨地权衡不同时间尺度上音频信息的重要性。这种技术不仅可以提高回归边界的精度，还可以增强分类的置信度。重要的是，MRAV-FF具有通用性，它与现有的FPN TAL架构兼容，并在音频数据可用时提供了显著的性能提升。",
    "tldr": "本论文提出了一种多分辨率音频-视觉特征融合的方法，通过分层门控交叉注意力机制将不同时间分辨率的音频-视觉数据进行合并，在时域动作定位任务中有效地整合了音频特征，并取得了显著的性能提升。",
    "en_tdlr": "This paper proposes a method called Multi-Resolution Audio-Visual Feature Fusion (MRAV-FF) that effectively integrates audio features into temporal action localization tasks using a hierarchical gated cross-attention mechanism, leading to significant performance improvement."
}