{
    "title": "Data-Efficient Power Flow Learning for Network Contingencies. (arXiv:2310.00763v2 [cs.LG] UPDATED)",
    "abstract": "This work presents an efficient data-driven method to learn power flows in grids with network contingencies and to estimate corresponding probabilistic voltage envelopes (PVE). First, a network-aware Gaussian process (GP) termed Vertex-Degree Kernel (VDK-GP), developed in prior work, is used to estimate voltage-power functions for a few network configurations. The paper introduces a novel multi-task vertex degree kernel (MT-VDK) that amalgamates the learned VDK-GPs to determine power flows for unseen networks, with a significant reduction in the computational complexity and hyperparameter requirements compared to alternate approaches. Simulations on the IEEE 30-Bus network demonstrate the retention and transfer of power flow knowledge in both N-1 and N-2 contingency scenarios. The MT-VDK-GP approach achieves over 50% reduction in mean prediction error for novel N-1 contingency network configurations in low training data regimes (50-250 samples) over VDK-GP. Additionally, MT-VDK-GP outp",
    "link": "http://arxiv.org/abs/2310.00763",
    "context": "Title: Data-Efficient Power Flow Learning for Network Contingencies. (arXiv:2310.00763v2 [cs.LG] UPDATED)\nAbstract: This work presents an efficient data-driven method to learn power flows in grids with network contingencies and to estimate corresponding probabilistic voltage envelopes (PVE). First, a network-aware Gaussian process (GP) termed Vertex-Degree Kernel (VDK-GP), developed in prior work, is used to estimate voltage-power functions for a few network configurations. The paper introduces a novel multi-task vertex degree kernel (MT-VDK) that amalgamates the learned VDK-GPs to determine power flows for unseen networks, with a significant reduction in the computational complexity and hyperparameter requirements compared to alternate approaches. Simulations on the IEEE 30-Bus network demonstrate the retention and transfer of power flow knowledge in both N-1 and N-2 contingency scenarios. The MT-VDK-GP approach achieves over 50% reduction in mean prediction error for novel N-1 contingency network configurations in low training data regimes (50-250 samples) over VDK-GP. Additionally, MT-VDK-GP outp",
    "path": "papers/23/10/2310.00763.json",
    "total_tokens": 1018,
    "translated_title": "数据高效的网络事故电力流学习方法",
    "translated_abstract": "本研究提出了一种高效的数据驱动方法，用于学习具有网络事故的电网中的电力流，并估计相应的概率性电压包络（PVE）。首先，使用前期研究中开发的网络感知高斯过程（GP），称为顶点度核（VDK-GP），来估计少数网络配置的电压-功率函数。文章引入了一种新颖的多任务顶点度核（MT-VDK），将学习到的VDK-GP汇集在一起，以确定未见网络的电力流，与其他方法相比，计算复杂度和超参数要求显著降低。在IEEE 30-Bus网络上的模拟实验中，在N-1和N-2事故情况下表明了电力流知识的保留和传递。在低训练数据情况下（50-250个样本），MT-VDK-GP方法在新颖的N-1事故网络配置上的平均预测误差较VDK-GP减少了50%以上。此外，MT-VDK-GP在N-1事故网络配置的低训练数据情况下（50-250个样本）达到了平均预测误差降低50%以上的效果。",
    "tldr": "本论文提出了一种数据高效的方法，用于学习具有网络事故的电网中的电力流，并估计电力流的概率性。通过使用网络感知高斯过程和多任务顶点度核，该方法实现了对未见网络的电力流推断，并在低训练数据情况下比现有方法具有更好的性能。",
    "en_tdlr": "This paper proposes a data-efficient method for learning power flows in grids with network contingencies and estimating their probabilistic distribution. By utilizing a network-aware Gaussian process and a multi-task vertex degree kernel, the proposed approach achieves better performance in inferring power flows for unseen networks with less training data compared to existing methods."
}