{
    "title": "Using Logic Programming and Kernel-Grouping for Improving Interpretability of Convolutional Neural Networks. (arXiv:2310.13073v1 [cs.LG])",
    "abstract": "Within the realm of deep learning, the interpretability of Convolutional Neural Networks (CNNs), particularly in the context of image classification tasks, remains a formidable challenge. To this end we present a neurosymbolic framework, NeSyFOLD-G that generates a symbolic rule-set using the last layer kernels of the CNN to make its underlying knowledge interpretable. What makes NeSyFOLD-G different from other similar frameworks is that we first find groups of similar kernels in the CNN (kernel-grouping) using the cosine-similarity between the feature maps generated by various kernels. Once such kernel groups are found, we binarize each kernel group's output in the CNN and use it to generate a binarization table which serves as input data to FOLD-SE-M which is a Rule Based Machine Learning (RBML) algorithm. FOLD-SE-M then generates a rule-set that can be used to make predictions. We present a novel kernel grouping algorithm and show that grouping similar kernels leads to a significant",
    "link": "http://arxiv.org/abs/2310.13073",
    "context": "Title: Using Logic Programming and Kernel-Grouping for Improving Interpretability of Convolutional Neural Networks. (arXiv:2310.13073v1 [cs.LG])\nAbstract: Within the realm of deep learning, the interpretability of Convolutional Neural Networks (CNNs), particularly in the context of image classification tasks, remains a formidable challenge. To this end we present a neurosymbolic framework, NeSyFOLD-G that generates a symbolic rule-set using the last layer kernels of the CNN to make its underlying knowledge interpretable. What makes NeSyFOLD-G different from other similar frameworks is that we first find groups of similar kernels in the CNN (kernel-grouping) using the cosine-similarity between the feature maps generated by various kernels. Once such kernel groups are found, we binarize each kernel group's output in the CNN and use it to generate a binarization table which serves as input data to FOLD-SE-M which is a Rule Based Machine Learning (RBML) algorithm. FOLD-SE-M then generates a rule-set that can be used to make predictions. We present a novel kernel grouping algorithm and show that grouping similar kernels leads to a significant",
    "path": "papers/23/10/2310.13073.json",
    "total_tokens": 950,
    "translated_title": "使用逻辑编程和核组合来提高卷积神经网络的可解释性",
    "translated_abstract": "在深度学习领域中，卷积神经网络（CNNs），尤其是在图像分类任务中的可解释性仍然是一个巨大的挑战。为此，我们提出了一个神经符号框架NeSyFOLD-G，它使用CNN的最后一层核来生成一个符号规则集，以使其底层知识具有可解释性。NeSyFOLD-G与其他类似框架的不同之处在于，我们首先使用各个核生成的特征图之间的余弦相似度来找到CNN中相似核的组合（核组合）。一旦找到了这样的核组，我们对CNN的每个核组的输出进行二值化，并使用它生成一个二值化表作为FOLD-SE-M的输入数据，FOLD-SE-M是一种基于规则的机器学习（RBML）算法。FOLD-SE-M然后生成一个可用于进行预测的规则集。我们提出了一种新颖的核组合算法，并证明组合相似核可以显著提升模型的可解释性。",
    "tldr": "本论文提出了一个使用逻辑编程和核组合的神经符号框架，能够提高卷积神经网络的可解释性。通过找到相似的核并生成规则集，该框架使得底层知识更加容易理解。",
    "en_tdlr": "This paper presents a neurosymbolic framework that improves the interpretability of Convolutional Neural Networks (CNNs) by using logic programming and kernel-grouping. The framework generates symbolic rule-sets based on the last layer kernels of the CNN, making the underlying knowledge more interpretable."
}