{
    "title": "Wavelet Scattering Transform for Improving Generalization in Low-Resourced Spoken Language Identification. (arXiv:2310.00602v2 [eess.AS] UPDATED)",
    "abstract": "Commonly used features in spoken language identification (LID), such as mel-spectrogram or MFCC, lose high-frequency information due to windowing. The loss further increases for longer temporal contexts. To improve generalization of the low-resourced LID systems, we investigate an alternate feature representation, wavelet scattering transform (WST), that compensates for the shortcomings. To our knowledge, WST is not explored earlier in LID tasks. We first optimize WST features for multiple South Asian LID corpora. We show that LID requires low octave resolution and frequency-scattering is not useful. Further, cross-corpora evaluations show that the optimal WST hyper-parameters depend on both train and test corpora. Hence, we develop fused ECAPA-TDNN based LID systems with different sets of WST hyper-parameters to improve generalization for unknown data. Compared to MFCC, EER is reduced upto 14.05% and 6.40% for same-corpora and blind VoxLingua107 evaluations, respectively.",
    "link": "http://arxiv.org/abs/2310.00602",
    "context": "Title: Wavelet Scattering Transform for Improving Generalization in Low-Resourced Spoken Language Identification. (arXiv:2310.00602v2 [eess.AS] UPDATED)\nAbstract: Commonly used features in spoken language identification (LID), such as mel-spectrogram or MFCC, lose high-frequency information due to windowing. The loss further increases for longer temporal contexts. To improve generalization of the low-resourced LID systems, we investigate an alternate feature representation, wavelet scattering transform (WST), that compensates for the shortcomings. To our knowledge, WST is not explored earlier in LID tasks. We first optimize WST features for multiple South Asian LID corpora. We show that LID requires low octave resolution and frequency-scattering is not useful. Further, cross-corpora evaluations show that the optimal WST hyper-parameters depend on both train and test corpora. Hence, we develop fused ECAPA-TDNN based LID systems with different sets of WST hyper-parameters to improve generalization for unknown data. Compared to MFCC, EER is reduced upto 14.05% and 6.40% for same-corpora and blind VoxLingua107 evaluations, respectively.",
    "path": "papers/23/10/2310.00602.json",
    "total_tokens": 997,
    "translated_title": "提升低资源口语语种识别泛化性能的小波散射变换",
    "translated_abstract": "口语语种识别（LID）中常用的特征，如mel-spectrogram或MFCC，由于窗口化导致了高频信息的丢失。对于较长的时间上下文，信息丢失进一步增加。为了提升低资源LID系统的泛化能力，我们研究了替代特征表示方法，即小波散射变换（WST），以弥补上述缺陷。据我们所知，在LID任务中尚未有关于WST的研究。我们首先针对多个南亚LID语料库对WST特征进行优化。我们发现LID需要低八度分辨率，而频率散射并不有用。此外，跨语料库评估表明，最佳的WST超参数取决于训练和测试语料库。因此，我们基于不同的WST超参数开发了融合的基于ECAPA-TDNN的LID系统，以提高对未知数据的泛化能力。与MFCC相比，EER在同一语料库和盲目的VoxLingua107评估中分别降低了14.05%和6.40%。",
    "tldr": "该论文研究了在低资源情况下提升口语语种识别系统泛化能力的方法，提出了一种新的特征表示方法——小波散射变换（WST），并通过优化超参数和开发融合系统，成功降低了错误识别率。",
    "en_tdlr": "This paper investigates the improvement of generalization in low-resourced spoken language identification systems by proposing a new feature representation called wavelet scattering transform (WST). By optimizing the hyperparameters and developing a fused system, the proposed method successfully reduces the error rate compared to traditional MFCC features."
}