{
    "title": "Exploring the Landscape of Large Language Models In Medical Question Answering: Observations and Open Questions. (arXiv:2310.07225v1 [cs.CL])",
    "abstract": "Large Language Models (LLMs) have shown promise in medical question answering by achieving passing scores in standardised exams and have been suggested as tools for supporting healthcare workers. Deploying LLMs into such a high-risk context requires a clear understanding of the limitations of these models. With the rapid development and release of new LLMs, it is especially valuable to identify patterns which exist across models and may, therefore, continue to appear in newer versions. In this paper, we evaluate a wide range of popular LLMs on their knowledge of medical questions in order to better understand their properties as a group. From this comparison, we provide preliminary observations and raise open questions for further research.",
    "link": "http://arxiv.org/abs/2310.07225",
    "context": "Title: Exploring the Landscape of Large Language Models In Medical Question Answering: Observations and Open Questions. (arXiv:2310.07225v1 [cs.CL])\nAbstract: Large Language Models (LLMs) have shown promise in medical question answering by achieving passing scores in standardised exams and have been suggested as tools for supporting healthcare workers. Deploying LLMs into such a high-risk context requires a clear understanding of the limitations of these models. With the rapid development and release of new LLMs, it is especially valuable to identify patterns which exist across models and may, therefore, continue to appear in newer versions. In this paper, we evaluate a wide range of popular LLMs on their knowledge of medical questions in order to better understand their properties as a group. From this comparison, we provide preliminary observations and raise open questions for further research.",
    "path": "papers/23/10/2310.07225.json",
    "total_tokens": 775,
    "translated_title": "在医学问题回答中探索大型语言模型的领域: 观察和开放问题",
    "translated_abstract": "大型语言模型(LLMs)在医学问题回答领域显示出潜力，通过在标准化考试中取得及格分数，并被认为是支持医疗保健工作者的工具。将LLMs部署到如此高风险的环境中需要对这些模型的限制有清晰的理解。随着新的LLMs的快速发展和发布，识别跨模型存在的模式，并因此可能出现在新版本中，特别有价值。在本文中，我们评估了多种流行LLM在医学问题方面的知识，以更好地了解它们作为一个群体的特性。通过这个比较，我们提供了初步的观察，并提出了进一步研究的开放问题。",
    "tldr": "通过评估多种流行的大型语言模型在医学问题方面的知识，本研究提供了对这些模型作为一个群体的初步观察，并提出了进一步研究的开放问题。",
    "en_tdlr": "This paper evaluates a wide range of popular LLMs on their knowledge of medical questions, providing preliminary observations and open questions for further research on the properties of these models as a group."
}