{
    "title": "DALE: Generative Data Augmentation for Low-Resource Legal NLP. (arXiv:2310.15799v1 [cs.CL])",
    "abstract": "We present DALE, a novel and effective generative Data Augmentation framework for low-resource LEgal NLP. DALE addresses the challenges existing frameworks pose in generating effective data augmentations of legal documents - legal language, with its specialized vocabulary and complex semantics, morphology, and syntax, does not benefit from data augmentations that merely rephrase the source sentence. To address this, DALE, built on an Encoder-Decoder Language Model, is pre-trained on a novel unsupervised text denoising objective based on selective masking - our masking strategy exploits the domain-specific language characteristics of templatized legal documents to mask collocated spans of text. Denoising these spans helps DALE acquire knowledge about legal concepts, principles, and language usage. Consequently, it develops the ability to generate coherent and diverse augmentations with novel contexts. Finally, DALE performs conditional generation to generate synthetic augmentations for ",
    "link": "http://arxiv.org/abs/2310.15799",
    "context": "Title: DALE: Generative Data Augmentation for Low-Resource Legal NLP. (arXiv:2310.15799v1 [cs.CL])\nAbstract: We present DALE, a novel and effective generative Data Augmentation framework for low-resource LEgal NLP. DALE addresses the challenges existing frameworks pose in generating effective data augmentations of legal documents - legal language, with its specialized vocabulary and complex semantics, morphology, and syntax, does not benefit from data augmentations that merely rephrase the source sentence. To address this, DALE, built on an Encoder-Decoder Language Model, is pre-trained on a novel unsupervised text denoising objective based on selective masking - our masking strategy exploits the domain-specific language characteristics of templatized legal documents to mask collocated spans of text. Denoising these spans helps DALE acquire knowledge about legal concepts, principles, and language usage. Consequently, it develops the ability to generate coherent and diverse augmentations with novel contexts. Finally, DALE performs conditional generation to generate synthetic augmentations for ",
    "path": "papers/23/10/2310.15799.json",
    "total_tokens": 944,
    "translated_title": "DALE: 用于低资源法律NLP的生成式数据增强",
    "translated_abstract": "我们提出了DALE，一个针对低资源法律NLP的新颖有效的生成式数据增强框架。DALE解决了现有框架在生成法律文件的有效数据增强方面存在的挑战 - 法律语言具有专门的词汇和复杂的语义、形态和句法，并不能从仅仅对源句子进行改述的数据增强中受益。为了解决这个问题，DALE是基于编码器-解码器语言模型构建的，它在一种新颖的无监督文本去噪目标上进行了预训练，该目标基于选择性掩码 - 我们的掩码策略利用模板化法律文件的领域特定语言特征来掩盖文本的连续范围。去噪这些范围有助于DALE获取关于法律概念、原则和语言使用的知识。因此，它具备了生成连贯且多样化的增强以及新颖上下文的能力。最后，DALE进行条件生成，用于生成合成增强。",
    "tldr": "DALE是一个用于低资源法律NLP的生成式数据增强框架，通过基于选择性掩码的无监督文本去噪目标预训练，在解决法律语言特异性的同时生成连贯且多样化的增强。",
    "en_tdlr": "DALE is a generative data augmentation framework for low-resource legal NLP. It addresses the challenge of generating effective data augmentations for legal documents by pre-training on a novel unsupervised text denoising objective based on selective masking. It can generate coherent and diverse augmentations while considering the specialized language of legal documents."
}