{
    "title": "Interactive Generalized Additive Model and Its Applications in Electric Load Forecasting. (arXiv:2310.15662v1 [cs.LG])",
    "abstract": "Electric load forecasting is an indispensable component of electric power system planning and management. Inaccurate load forecasting may lead to the threat of outages or a waste of energy. Accurate electric load forecasting is challenging when there is limited data or even no data, such as load forecasting in holiday, or under extreme weather conditions. As high-stakes decision-making usually follows after load forecasting, model interpretability is crucial for the adoption of forecasting models. In this paper, we propose an interactive GAM which is not only interpretable but also can incorporate specific domain knowledge in electric power industry for improved performance. This boosting-based GAM leverages piecewise linear functions and can be learned through our efficient algorithm. In both public benchmark and electricity datasets, our interactive GAM outperforms current state-of-the-art methods and demonstrates good generalization ability in the cases of extreme weather events. We",
    "link": "http://arxiv.org/abs/2310.15662",
    "context": "Title: Interactive Generalized Additive Model and Its Applications in Electric Load Forecasting. (arXiv:2310.15662v1 [cs.LG])\nAbstract: Electric load forecasting is an indispensable component of electric power system planning and management. Inaccurate load forecasting may lead to the threat of outages or a waste of energy. Accurate electric load forecasting is challenging when there is limited data or even no data, such as load forecasting in holiday, or under extreme weather conditions. As high-stakes decision-making usually follows after load forecasting, model interpretability is crucial for the adoption of forecasting models. In this paper, we propose an interactive GAM which is not only interpretable but also can incorporate specific domain knowledge in electric power industry for improved performance. This boosting-based GAM leverages piecewise linear functions and can be learned through our efficient algorithm. In both public benchmark and electricity datasets, our interactive GAM outperforms current state-of-the-art methods and demonstrates good generalization ability in the cases of extreme weather events. We",
    "path": "papers/23/10/2310.15662.json",
    "total_tokens": 967,
    "translated_title": "交互式广义可加模型及其在电力负荷预测中的应用",
    "translated_abstract": "电力负荷预测是电力系统规划和管理中不可或缺的组成部分。不准确的负荷预测可能导致停电威胁或能源浪费。在数据有限甚至没有数据的情况下，例如节假日负荷预测或极端天气条件下的负荷预测，准确的电力负荷预测具有挑战性。由于负荷预测之后往往会做出重大决策,模型的可解释性对于预测模型的采用至关重要。在本文中，我们提出了一种交互式广义可加模型，既可解释性又能融入电力行业的特定领域知识以提高性能。这种基于提升的广义可加模型利用分段线性函数，并可以通过我们的高效算法进行学习。在公共基准和电力数据集中，我们的交互式广义可加模型优于当前最先进的方法，并在极端天气事件的情况下表现出良好的泛化能力。",
    "tldr": "本文提出了一种交互式广义可加模型，既可解释性又能融入电力行业的特定领域知识以提高性能。通过使用分段线性函数和高效算法，我们的模型在公共基准和电力数据集中表现优异，并在极端天气事件的情况下具有良好的泛化能力。",
    "en_tdlr": "This paper proposes an interactive generalized additive model that is both interpretable and can incorporate domain knowledge in the electric power industry for improved performance. Our model, utilizing piecewise linear functions and an efficient algorithm, outperforms current state-of-the-art methods in public benchmark and electricity datasets, and demonstrates good generalization ability in extreme weather events."
}