{
    "title": "De novo protein design using geometric vector field networks. (arXiv:2310.11802v1 [cs.CE])",
    "abstract": "Innovations like protein diffusion have enabled significant progress in de novo protein design, which is a vital topic in life science. These methods typically depend on protein structure encoders to model residue backbone frames, where atoms do not exist. Most prior encoders rely on atom-wise features, such as angles and distances between atoms, which are not available in this context. Thus far, only several simple encoders, such as IPA, have been proposed for this scenario, exposing the frame modeling as a bottleneck. In this work, we proffer the Vector Field Network (VFN), which enables network layers to perform learnable vector computations between coordinates of frame-anchored virtual atoms, thus achieving a higher capability for modeling frames. The vector computation operates in a manner similar to a linear layer, with each input channel receiving 3D virtual atom coordinates instead of scalar values. The multiple feature vectors output by the vector computation are then used to ",
    "link": "http://arxiv.org/abs/2310.11802",
    "context": "Title: De novo protein design using geometric vector field networks. (arXiv:2310.11802v1 [cs.CE])\nAbstract: Innovations like protein diffusion have enabled significant progress in de novo protein design, which is a vital topic in life science. These methods typically depend on protein structure encoders to model residue backbone frames, where atoms do not exist. Most prior encoders rely on atom-wise features, such as angles and distances between atoms, which are not available in this context. Thus far, only several simple encoders, such as IPA, have been proposed for this scenario, exposing the frame modeling as a bottleneck. In this work, we proffer the Vector Field Network (VFN), which enables network layers to perform learnable vector computations between coordinates of frame-anchored virtual atoms, thus achieving a higher capability for modeling frames. The vector computation operates in a manner similar to a linear layer, with each input channel receiving 3D virtual atom coordinates instead of scalar values. The multiple feature vectors output by the vector computation are then used to ",
    "path": "papers/23/10/2310.11802.json",
    "total_tokens": 903,
    "translated_title": "使用几何矢量场网络进行全新蛋白质设计",
    "translated_abstract": "利用蛋白质扩散等创新技术，在全新蛋白质设计方面取得了显著进展，这是生命科学中一个重要的课题。这些方法通常依赖蛋白质结构编码器来建模残基骨架帧，在这种情况下不存在原子。大多数先前的编码器依赖原子级特征，如原子之间的角度和距离，这些特征在这种情况下是不可用的。迄今为止，只有几个简单的编码器（例如IPA）被提出用于这种情况，使得帧模型成为一个瓶颈。在这项工作中，我们提出了矢量场网络（VFN），它使得网络层能够在帧锚定的虚拟原子坐标之间进行可学习的矢量计算，从而实现更高的帧模型能力。矢量计算的操作方式类似于线性层，每个输入通道接收3D虚拟原子坐标而不是标量值。矢量计算输出的多个特征向量然后被用于...",
    "tldr": "创新点是引入了Vector Field Network (VFN)来提高蛋白质结构编码器的建模能力，在全新蛋白质设计中取得了显著进展。"
}