{
    "title": "Masked Pretraining for Multi-Agent Decision Making. (arXiv:2310.11846v1 [cs.AI])",
    "abstract": "Building a single generalist agent with zero-shot capability has recently sparked significant advancements in decision-making. However, extending this capability to multi-agent scenarios presents challenges. Most current works struggle with zero-shot capabilities, due to two challenges particular to the multi-agent settings: a mismatch between centralized pretraining and decentralized execution, and varying agent numbers and action spaces, making it difficult to create generalizable representations across diverse downstream tasks. To overcome these challenges, we propose a \\textbf{Mask}ed pretraining framework for \\textbf{M}ulti-\\textbf{a}gent decision making (MaskMA). This model, based on transformer architecture, employs a mask-based collaborative learning strategy suited for decentralized execution with partial observation. Moreover, MaskMA integrates a generalizable action representation by dividing the action space into actions toward self-information and actions related to other ",
    "link": "http://arxiv.org/abs/2310.11846",
    "context": "Title: Masked Pretraining for Multi-Agent Decision Making. (arXiv:2310.11846v1 [cs.AI])\nAbstract: Building a single generalist agent with zero-shot capability has recently sparked significant advancements in decision-making. However, extending this capability to multi-agent scenarios presents challenges. Most current works struggle with zero-shot capabilities, due to two challenges particular to the multi-agent settings: a mismatch between centralized pretraining and decentralized execution, and varying agent numbers and action spaces, making it difficult to create generalizable representations across diverse downstream tasks. To overcome these challenges, we propose a \\textbf{Mask}ed pretraining framework for \\textbf{M}ulti-\\textbf{a}gent decision making (MaskMA). This model, based on transformer architecture, employs a mask-based collaborative learning strategy suited for decentralized execution with partial observation. Moreover, MaskMA integrates a generalizable action representation by dividing the action space into actions toward self-information and actions related to other ",
    "path": "papers/23/10/2310.11846.json",
    "total_tokens": 899,
    "translated_title": "多智能体决策的掩码预训练",
    "translated_abstract": "最近，在决策领域，构建具有零样本能力的通用单智能体日益取得重大进展。然而，将这种能力扩展到多智能体场景存在挑战。大多数现有工作在零样本能力方面存在困难，原因是多智能体环境中存在两个特定挑战：集中式预训练和分散式执行之间存在不匹配，以及不同的智能体数量和动作空间，使得难以创建适用于不同下游任务的可泛化表示。为了克服这些挑战，我们提出了一种适用于多智能体决策的掩码预训练框架(MaskMA)。该模型基于变压器架构，采用适合于带有部分观测的分散式执行的基于掩码的协作学习策略。此外，MaskMA通过将动作空间划分为面向自身信息的动作和与他人相关的动作，融入了可泛化的动作表示。",
    "tldr": "我们提出了一个掩码预训练框架(MaskMA)用于解决多智能体决策中的挑战。这个框架采用变压器架构，并使用基于掩码的协作学习策略，同时整合了可泛化的动作表示。",
    "en_tdlr": "We propose a masked pretraining framework (MaskMA) to address challenges in multi-agent decision making. This framework utilizes a transformer architecture and employs a mask-based collaborative learning strategy, while integrating a generalizable action representation."
}