{
    "title": "Decentralised, Scalable and Privacy-Preserving Synthetic Data Generation. (arXiv:2310.20062v1 [cs.CR])",
    "abstract": "Synthetic data is emerging as a promising way to harness the value of data, while reducing privacy risks. The potential of synthetic data is not limited to privacy-friendly data release, but also includes complementing real data in use-cases such as training machine learning algorithms that are more fair and robust to distribution shifts etc. There is a lot of interest in algorithmic advances in synthetic data generation for providing better privacy and statistical guarantees and for its better utilisation in machine learning pipelines. However, for responsible and trustworthy synthetic data generation, it is not sufficient to focus only on these algorithmic aspects and instead, a holistic view of the synthetic data generation pipeline must be considered. We build a novel system that allows the contributors of real data to autonomously participate in differentially private synthetic data generation without relying on a trusted centre. Our modular, general and scalable solution is based",
    "link": "http://arxiv.org/abs/2310.20062",
    "context": "Title: Decentralised, Scalable and Privacy-Preserving Synthetic Data Generation. (arXiv:2310.20062v1 [cs.CR])\nAbstract: Synthetic data is emerging as a promising way to harness the value of data, while reducing privacy risks. The potential of synthetic data is not limited to privacy-friendly data release, but also includes complementing real data in use-cases such as training machine learning algorithms that are more fair and robust to distribution shifts etc. There is a lot of interest in algorithmic advances in synthetic data generation for providing better privacy and statistical guarantees and for its better utilisation in machine learning pipelines. However, for responsible and trustworthy synthetic data generation, it is not sufficient to focus only on these algorithmic aspects and instead, a holistic view of the synthetic data generation pipeline must be considered. We build a novel system that allows the contributors of real data to autonomously participate in differentially private synthetic data generation without relying on a trusted centre. Our modular, general and scalable solution is based",
    "path": "papers/23/10/2310.20062.json",
    "total_tokens": 900,
    "translated_title": "去中心化、可扩展且保护隐私的合成数据生成",
    "translated_abstract": "合成数据作为一种有潜力的方式在降低隐私风险的同时发挥数据价值。合成数据的潜力不仅局限于隐私友好的数据发布，还包括在培训机器学习算法等使用案例中补充真实数据，使其更公平、更能抵抗分布转变等。对于提供更好的隐私和统计保证以及更好地在机器学习流程中利用合成数据的算法进展引起了广泛兴趣。然而，对于负责任和值得信赖的合成数据生成来说，仅关注这些算法方面是不够的，而应该考虑合成数据生成流程的整体视角。我们构建了一个新的系统，允许真实数据的贡献者在没有依赖于值得信赖的中心的情况下自主参与差分隐私合成数据生成。我们的模块化、通用化和可扩展的解决方案基于...",
    "tldr": "这篇论文介绍了一种去中心化、可扩展且保护隐私的合成数据生成系统，使真实数据的贡献者能够参与差分隐私合成数据生成，从而提供更好的隐私和统计保证，并在机器学习流程中更好地利用合成数据。",
    "en_tdlr": "This paper presents a decentralized, scalable, and privacy-preserving synthetic data generation system that allows contributors of real data to participate in differentially private synthetic data generation, providing better privacy and statistical guarantees, and better utilization of synthetic data in machine learning pipelines."
}