{
    "title": "A Hybrid Transfer Learning Assisted Decision Support System for Accurate Prediction of Alzheimer Disease. (arXiv:2310.08888v1 [cs.CV])",
    "abstract": "Alzheimer's disease (AD) is the most common long-term illness in elderly people. In recent years, deep learning has become popular in the area of medical imaging and has had a lot of success there. It has become the most effective way to look at medical images. When it comes to detecting AD, the deep neural model is more accurate and effective than general machine learning. Our research contributes to the development of a more comprehensive understanding and detection of the disease by identifying four distinct classes that are predictive of AD with a high weighted accuracy of 98.91%. A unique strategy has been proposed to improve the accuracy of the imbalance dataset classification problem via the combination of ensemble averaging models and five different transfer learning models in this study. EfficientNetB0+Resnet152(effnet+res152) and InceptionV3+EfficientNetB0+Resnet50(incep+effnet+res50) models have been fine-tuned and have reached the highest weighted accuracy for multi-class A",
    "link": "http://arxiv.org/abs/2310.08888",
    "context": "Title: A Hybrid Transfer Learning Assisted Decision Support System for Accurate Prediction of Alzheimer Disease. (arXiv:2310.08888v1 [cs.CV])\nAbstract: Alzheimer's disease (AD) is the most common long-term illness in elderly people. In recent years, deep learning has become popular in the area of medical imaging and has had a lot of success there. It has become the most effective way to look at medical images. When it comes to detecting AD, the deep neural model is more accurate and effective than general machine learning. Our research contributes to the development of a more comprehensive understanding and detection of the disease by identifying four distinct classes that are predictive of AD with a high weighted accuracy of 98.91%. A unique strategy has been proposed to improve the accuracy of the imbalance dataset classification problem via the combination of ensemble averaging models and five different transfer learning models in this study. EfficientNetB0+Resnet152(effnet+res152) and InceptionV3+EfficientNetB0+Resnet50(incep+effnet+res50) models have been fine-tuned and have reached the highest weighted accuracy for multi-class A",
    "path": "papers/23/10/2310.08888.json",
    "total_tokens": 948,
    "translated_title": "一种混合迁移学习辅助决策支持系统用于准确预测阿尔茨海默病",
    "translated_abstract": "阿尔茨海默病(AD)是老年人最常见的长期疾病。近年来，深度学习在医学影像领域变得流行，并取得了很多成功。它已成为查看医学影像的最有效方法。在检测AD方面，深度神经模型比一般的机器学习更准确和有效。本研究通过识别预测AD的四个不同类别，为该疾病的更全面理解和检测做出了贡献，其中加权准确率高达98.91%。本研究提出了一种独特的策略，通过集成平均模型和五种不同的迁移学习模型的组合，改善了数据不平衡的分类问题的准确率。EfficientNetB0+Resnet152(effnet+res152)和InceptionV3+EfficientNetB0+Resnet50(incep+effnet+res50)模型进行了微调，并达到了多类别A的最高加权准确率。",
    "tldr": "本研究提出了一种混合迁移学习辅助决策支持系统，通过识别四个预测阿尔茨海默病的不同类别，实现了对该疾病的准确预测，加权准确率达到了98.91%。"
}