{
    "title": "Network-Aware AutoML Framework for Software-Defined Sensor Networks. (arXiv:2310.12914v2 [cs.CR] UPDATED)",
    "abstract": "As the current detection solutions of distributed denial of service attacks (DDoS) need additional infrastructures to handle high aggregate data rates, they are not suitable for sensor networks or the Internet of Things. Besides, the security architecture of software-defined sensor networks needs to pay attention to the vulnerabilities of both software-defined networks and sensor networks. In this paper, we propose a network-aware automated machine learning (AutoML) framework which detects DDoS attacks in software-defined sensor networks. Our framework selects an ideal machine learning algorithm to detect DDoS attacks in network-constrained environments, using metrics such as variable traffic load, heterogeneous traffic rate, and detection time while preventing over-fitting. Our contributions are two-fold: (i) we first investigate the trade-off between the efficiency of ML algorithms and network/traffic state in the scope of DDoS detection. (ii) we design and implement a software archi",
    "link": "http://arxiv.org/abs/2310.12914",
    "context": "Title: Network-Aware AutoML Framework for Software-Defined Sensor Networks. (arXiv:2310.12914v2 [cs.CR] UPDATED)\nAbstract: As the current detection solutions of distributed denial of service attacks (DDoS) need additional infrastructures to handle high aggregate data rates, they are not suitable for sensor networks or the Internet of Things. Besides, the security architecture of software-defined sensor networks needs to pay attention to the vulnerabilities of both software-defined networks and sensor networks. In this paper, we propose a network-aware automated machine learning (AutoML) framework which detects DDoS attacks in software-defined sensor networks. Our framework selects an ideal machine learning algorithm to detect DDoS attacks in network-constrained environments, using metrics such as variable traffic load, heterogeneous traffic rate, and detection time while preventing over-fitting. Our contributions are two-fold: (i) we first investigate the trade-off between the efficiency of ML algorithms and network/traffic state in the scope of DDoS detection. (ii) we design and implement a software archi",
    "path": "papers/23/10/2310.12914.json",
    "total_tokens": 881,
    "translated_title": "面向软件定义传感器网络的网络感知自动机器学习框架",
    "translated_abstract": "鉴于当前分布式拒绝服务攻击（DDoS）的检测解决方案需要额外的基础设施来处理高聚合数据速率，因此它们不适用于传感器网络或物联网。此外，软件定义传感器网络的安全架构需要注意软件定义网络和传感器网络的漏洞。在本文中，我们提出了一个网络感知自动机器学习（AutoML）框架，用于检测软件定义传感器网络中的DDoS攻击。我们的框架根据变量流量负载、异构流量速率和检测时间等指标，在网络限制环境下选择理想的机器学习算法来检测DDoS攻击，同时防止过拟合。我们的贡献有两个方面：(i)我们首次在DDoS检测范围内探讨了机器学习算法的效率与网络/流量状态之间的权衡。(ii)我们设计并实现了一个软件架构",
    "tldr": "这项研究提出了一个面向软件定义传感器网络的网络感知自动机器学习框架，能够在网络限制环境下选择合适的机器学习算法来检测DDoS攻击，并防止过拟合。",
    "en_tdlr": "This study presents a network-aware automated machine learning framework for software-defined sensor networks, capable of selecting suitable machine learning algorithms to detect DDoS attacks in network-constrained environments and prevent overfitting."
}