{
    "title": "Synthesizing Efficiently Monitorable Formulas in Metric Temporal Logic. (arXiv:2310.17410v1 [cs.AI])",
    "abstract": "In runtime verification, manually formalizing a specification for monitoring system executions is a tedious and error-prone process. To address this issue, we consider the problem of automatically synthesizing formal specifications from system executions. To demonstrate our approach, we consider the popular specification language Metric Temporal Logic (MTL), which is particularly tailored towards specifying temporal properties for cyber-physical systems (CPS). Most of the classical approaches for synthesizing temporal logic formulas aim at minimizing the size of the formula. However, for efficiency in monitoring, along with the size, the amount of \"lookahead\" required for the specification becomes relevant, especially for safety-critical applications. We formalize this notion and devise a learning algorithm that synthesizes concise formulas having bounded lookahead. To do so, our algorithm reduces the synthesis task to a series of satisfiability problems in Linear Real Arithmetic (LRA)",
    "link": "http://arxiv.org/abs/2310.17410",
    "context": "Title: Synthesizing Efficiently Monitorable Formulas in Metric Temporal Logic. (arXiv:2310.17410v1 [cs.AI])\nAbstract: In runtime verification, manually formalizing a specification for monitoring system executions is a tedious and error-prone process. To address this issue, we consider the problem of automatically synthesizing formal specifications from system executions. To demonstrate our approach, we consider the popular specification language Metric Temporal Logic (MTL), which is particularly tailored towards specifying temporal properties for cyber-physical systems (CPS). Most of the classical approaches for synthesizing temporal logic formulas aim at minimizing the size of the formula. However, for efficiency in monitoring, along with the size, the amount of \"lookahead\" required for the specification becomes relevant, especially for safety-critical applications. We formalize this notion and devise a learning algorithm that synthesizes concise formulas having bounded lookahead. To do so, our algorithm reduces the synthesis task to a series of satisfiability problems in Linear Real Arithmetic (LRA)",
    "path": "papers/23/10/2310.17410.json",
    "total_tokens": 860,
    "translated_title": "在度量时序逻辑中合成高效的可监控公式",
    "translated_abstract": "在运行时验证中，手动为监控系统执行规范化一个规范是一项繁琐且容易出错的过程。为了解决这个问题，我们考虑了从系统执行中自动合成形式化规范的问题。为了展示我们的方法，我们考虑了流行的规范语言度量时序逻辑（MTL），该语言特别适用于为网络物理系统（CPS）指定时间属性。大多数传统的合成时序逻辑公式的方法旨在最小化公式的大小。然而，对于监控的效率而言，除了大小，规范所需的“先行查看”量也变得相关，尤其对于安全关键应用来说。我们形式化了这个概念，并设计了一种学习算法，用于合成具有有限先行查看的简洁公式。为此，我们的算法将合成任务简化为一系列线性实数算术问题的可满足性问题。",
    "tldr": "本论文提出了一种自动化合成从系统执行中得到形式规范的方法，通过将合成任务简化为线性实数算术问题的可满足性问题，并设计了一种学习算法，合成了具有有限先行查看的简洁公式。"
}