{
    "title": "Model Selection of Zero-shot Anomaly Detectors in the Absence of Labeled Validation Data",
    "abstract": "Anomaly detection requires detecting abnormal samples in large unlabeled datasets. While progress in deep learning and the advent of foundation models has produced powerful zero-shot anomaly detection methods, their deployment in practice is often hindered by the lack of labeled data -- without it, their detection performance cannot be evaluated reliably. In this work, we propose SWSA (Selection With Synthetic Anomalies): a general-purpose framework to select image-based anomaly detectors with a generated synthetic validation set. Our proposed anomaly generation method assumes access to only a small support set of normal images and requires no training or fine-tuning. Once generated, our synthetic validation set is used to create detection tasks that compose a validation framework for model selection. In an empirical study, we find that SWSA often selects models that match selections made with a ground-truth validation set, resulting in higher AUROCs than baseline methods. We also find",
    "link": "https://arxiv.org/abs/2310.10461",
    "context": "Title: Model Selection of Zero-shot Anomaly Detectors in the Absence of Labeled Validation Data\nAbstract: Anomaly detection requires detecting abnormal samples in large unlabeled datasets. While progress in deep learning and the advent of foundation models has produced powerful zero-shot anomaly detection methods, their deployment in practice is often hindered by the lack of labeled data -- without it, their detection performance cannot be evaluated reliably. In this work, we propose SWSA (Selection With Synthetic Anomalies): a general-purpose framework to select image-based anomaly detectors with a generated synthetic validation set. Our proposed anomaly generation method assumes access to only a small support set of normal images and requires no training or fine-tuning. Once generated, our synthetic validation set is used to create detection tasks that compose a validation framework for model selection. In an empirical study, we find that SWSA often selects models that match selections made with a ground-truth validation set, resulting in higher AUROCs than baseline methods. We also find",
    "path": "papers/23/10/2310.10461.json",
    "total_tokens": 880,
    "translated_title": "无标签验证数据下零样本异常检测器的模型选择",
    "translated_abstract": "异常检测需要在大型无标签数据集中检测异常样本。尽管深度学习的进步和基础模型的出现产生了强大的零样本异常检测方法，但其在实践中的应用常常受到标签数据的缺乏的限制 - 在没有标签数据的情况下，无法可靠地评估其检测性能。在这项工作中，我们提出了一种通用框架SWSA（Selection With Synthetic Anomalies）来选择基于图像的异常检测器，并使用生成的合成验证集。我们提出的异常生成方法假设只有少量的正常图像支持集，并且不需要训练或微调。生成后，我们的合成验证集被用于创建模型选择的验证框架中的检测任务。在实证研究中，我们发现SWSA常常选择与真实验证集选择相匹配的模型，结果比基线方法的AUROC更高。",
    "tldr": "本研究提出了一个通用框架SWSA（Selection With Synthetic Anomalies），用于在没有标签验证数据的情况下选择基于图像的零样本异常检测器。通过生成合成验证集，该方法能够实现模型选择，并在实证研究中展示了比基线方法更高的AUROC。"
}