{
    "title": "Automated Chest X-Ray Report Generator Using Multi-Model Deep Learning Approach. (arXiv:2310.05969v1 [eess.IV])",
    "abstract": "Reading and interpreting chest X-ray images is one of the most radiologist's routines. However, it still can be challenging, even for the most experienced ones. Therefore, we proposed a multi-model deep learning-based automated chest X-ray report generator system designed to assist radiologists in their work. The basic idea of the proposed system is by utilizing multi binary-classification models for detecting multi abnormalities, with each model responsible for detecting one abnormality, in a single image. In this study, we limited the radiology abnormalities detection to only cardiomegaly, lung effusion, and consolidation. The system generates a radiology report by performing the following three steps: image pre-processing, utilizing deep learning models to detect abnormalities, and producing a report. The aim of the image pre-processing step is to standardize the input by scaling it to 128x128 pixels and slicing it into three segments, which covers the upper, lower, and middle parts",
    "link": "http://arxiv.org/abs/2310.05969",
    "context": "Title: Automated Chest X-Ray Report Generator Using Multi-Model Deep Learning Approach. (arXiv:2310.05969v1 [eess.IV])\nAbstract: Reading and interpreting chest X-ray images is one of the most radiologist's routines. However, it still can be challenging, even for the most experienced ones. Therefore, we proposed a multi-model deep learning-based automated chest X-ray report generator system designed to assist radiologists in their work. The basic idea of the proposed system is by utilizing multi binary-classification models for detecting multi abnormalities, with each model responsible for detecting one abnormality, in a single image. In this study, we limited the radiology abnormalities detection to only cardiomegaly, lung effusion, and consolidation. The system generates a radiology report by performing the following three steps: image pre-processing, utilizing deep learning models to detect abnormalities, and producing a report. The aim of the image pre-processing step is to standardize the input by scaling it to 128x128 pixels and slicing it into three segments, which covers the upper, lower, and middle parts",
    "path": "papers/23/10/2310.05969.json",
    "total_tokens": 992,
    "translated_title": "使用多模型深度学习方法的自动化胸部X光报告生成器",
    "translated_abstract": "阅读和解读胸部X光图像是大多数放射科医生的例行工作之一。然而，即使对于经验最丰富的医生来说，这仍然可能是具有挑战性的。因此，我们提出了一种基于多模型深度学习的自动化胸部X光报告生成系统，旨在辅助放射科医生的工作。所提出的系统的基本思想是利用多个二元分类模型来检测多种异常，每个模型负责检测一种异常，在单个图像中。在本研究中，我们将放射学异常检测限制为心脏肥大、肺积液和实变。系统通过执行以下三个步骤生成放射学报告：图像预处理，利用深度学习模型检测异常，并生成报告。图像预处理步骤的目的是通过将其缩放为128x128像素并分割成三个部分来使输入标准化，分别涵盖上部、下部和中部。",
    "tldr": "提出了一种基于多模型深度学习的自动化胸部X光报告生成器系统，通过利用多个二元分类模型检测多种异常，在单个图像中辅助放射科医生的工作。该系统将放射学异常检测限制为心脏肥大、肺积液和实变，并通过三个步骤生成放射学报告：图像预处理、深度学习模型检测异常和生成报告。"
}