{
    "title": "What would it cost to connect the unconnected? Estimating global universal broadband infrastructure investment. (arXiv:2310.03694v1 [econ.GN])",
    "abstract": "Roughly 3 billion citizens remain offline, equating to approximately 40 percent of the global population. Therefore, providing Internet connectivity is an essential part of the Sustainable Development Goals (SDGs) (Goal 9). In this paper a high-resolution global model is developed to evaluate the necessary investment requirements to achieve affordable universal broadband. The results indicate that approximately $418 billion needs to be mobilized to connect all unconnected citizens globally (targeting 40-50 GB/Month per user with 95 percent reliability). The bulk of additional investment is for emerging market economies (73 percent) and low-income developing countries (24 percent). To our knowledge, the paper contributes the first high-resolution global assessment which quantifies universal broadband investment at the sub-national level to achieve SDG Goal 9.",
    "link": "http://arxiv.org/abs/2310.03694",
    "context": "Title: What would it cost to connect the unconnected? Estimating global universal broadband infrastructure investment. (arXiv:2310.03694v1 [econ.GN])\nAbstract: Roughly 3 billion citizens remain offline, equating to approximately 40 percent of the global population. Therefore, providing Internet connectivity is an essential part of the Sustainable Development Goals (SDGs) (Goal 9). In this paper a high-resolution global model is developed to evaluate the necessary investment requirements to achieve affordable universal broadband. The results indicate that approximately $418 billion needs to be mobilized to connect all unconnected citizens globally (targeting 40-50 GB/Month per user with 95 percent reliability). The bulk of additional investment is for emerging market economies (73 percent) and low-income developing countries (24 percent). To our knowledge, the paper contributes the first high-resolution global assessment which quantifies universal broadband investment at the sub-national level to achieve SDG Goal 9.",
    "path": "papers/23/10/2310.03694.json",
    "total_tokens": 816,
    "translated_title": "连接无连接者需要多少成本？估计全球普遍宽带基础设施投资",
    "translated_abstract": "大约有30亿公民仍然没有上网，相当于全球人口的40%左右。因此，提供互联网连接是可持续发展目标（目标9）的重要组成部分。本文开发了一个高分辨率的全球模型，以评估实现负担得起的普遍宽带所需的投资需求。结果表明，连接全球所有未连接的公民需要动员约4180亿美元（目标为每位用户每月40-50 GB，可靠性为95%）。额外投资的大部分用于新兴市场经济体（73%）和低收入发展中国家（24%）。据我们所知，本文首次提供了一个高分辨率的全球评估，以量化实现可持续发展目标9所需的普遍宽带投资。",
    "tldr": "本研究开发了一个全球模型，估计实现负担得起的普遍宽带所需的投资需求为约4180亿美元，其中大部分投资将用于新兴市场经济体和低收入发展中国家。",
    "en_tdlr": "This study developed a global model and estimated that approximately $418 billion investment is needed to achieve affordable universal broadband, with the bulk of the investment going to emerging market economies and low-income developing countries."
}