{
    "title": "Learning-based Scheduling for Information Accuracy and Freshness in Wireless Networks. (arXiv:2310.15705v1 [cs.AI])",
    "abstract": "We consider a system of multiple sources, a single communication channel, and a single monitoring station. Each source measures a time-varying quantity with varying levels of accuracy and one of them sends its update to the monitoring station via the channel. The probability of success of each attempted communication is a function of the source scheduled for transmitting its update. Both the probability of correct measurement and the probability of successful transmission of all the sources are unknown to the scheduler. The metric of interest is the reward received by the system which depends on the accuracy of the last update received by the destination and the Age-of-Information (AoI) of the system. We model our scheduling problem as a variant of the multi-arm bandit problem with sources as different arms. We compare the performance of all $4$ standard bandit policies, namely, ETC, $\\epsilon$-greedy, UCB, and TS suitably adjusted to our system model via simulations. In addition, we p",
    "link": "http://arxiv.org/abs/2310.15705",
    "context": "Title: Learning-based Scheduling for Information Accuracy and Freshness in Wireless Networks. (arXiv:2310.15705v1 [cs.AI])\nAbstract: We consider a system of multiple sources, a single communication channel, and a single monitoring station. Each source measures a time-varying quantity with varying levels of accuracy and one of them sends its update to the monitoring station via the channel. The probability of success of each attempted communication is a function of the source scheduled for transmitting its update. Both the probability of correct measurement and the probability of successful transmission of all the sources are unknown to the scheduler. The metric of interest is the reward received by the system which depends on the accuracy of the last update received by the destination and the Age-of-Information (AoI) of the system. We model our scheduling problem as a variant of the multi-arm bandit problem with sources as different arms. We compare the performance of all $4$ standard bandit policies, namely, ETC, $\\epsilon$-greedy, UCB, and TS suitably adjusted to our system model via simulations. In addition, we p",
    "path": "papers/23/10/2310.15705.json",
    "total_tokens": 831,
    "translated_title": "基于学习的无线网络信息准确性和新鲜度调度",
    "translated_abstract": "本文考虑了一个多源、单通信信道和单个监测站的系统。每个源都以不同准确度测量一个时间变化的数量，其中一个源通过信道将其更新发送到监测站。每次尝试通信的成功概率取决于被调度用于传输更新的源。调度器不知道所有源的测量正确性和传输成功概率。我们关注的度量是系统接收到的奖励，该奖励取决于目的地收到的最后一次更新的准确性和信息年龄（Age-of-Information，AoI）。我们将调度问题建模为多臂赌博机问题的一种变体，其中各个源作为不同的臂。通过模拟，我们比较了所有四种标准的赌博机策略，即ETC、epsilon-greedy、UCB和TS在我们的系统模型下适当调整后的性能。",
    "tldr": "本文研究了基于学习的无线网络调度问题，通过比较四种标准的赌博机策略的性能，以提高信息准确性和新鲜度。",
    "en_tdlr": "This paper investigates the learning-based scheduling problem in wireless networks and compares the performance of four standard bandit policies to improve information accuracy and freshness."
}