{
    "title": "Super resolution of histopathological frozen sections via deep learning preserving tissue structure. (arXiv:2310.11112v1 [eess.IV])",
    "abstract": "Histopathology plays a pivotal role in medical diagnostics. In contrast to preparing permanent sections for histopathology, a time-consuming process, preparing frozen sections is significantly faster and can be performed during surgery, where the sample scanning time should be optimized. Super-resolution techniques allow imaging the sample in lower magnification and sparing scanning time. In this paper, we present a new approach to super resolution for histopathological frozen sections, with focus on achieving better distortion measures, rather than pursuing photorealistic images that may compromise critical diagnostic information. Our deep-learning architecture focuses on learning the error between interpolated images and real images, thereby it generates high-resolution images while preserving critical image details, reducing the risk of diagnostic misinterpretation. This is done by leveraging the loss functions in the frequency domain, assigning higher weights to the reconstruction ",
    "link": "http://arxiv.org/abs/2310.11112",
    "context": "Title: Super resolution of histopathological frozen sections via deep learning preserving tissue structure. (arXiv:2310.11112v1 [eess.IV])\nAbstract: Histopathology plays a pivotal role in medical diagnostics. In contrast to preparing permanent sections for histopathology, a time-consuming process, preparing frozen sections is significantly faster and can be performed during surgery, where the sample scanning time should be optimized. Super-resolution techniques allow imaging the sample in lower magnification and sparing scanning time. In this paper, we present a new approach to super resolution for histopathological frozen sections, with focus on achieving better distortion measures, rather than pursuing photorealistic images that may compromise critical diagnostic information. Our deep-learning architecture focuses on learning the error between interpolated images and real images, thereby it generates high-resolution images while preserving critical image details, reducing the risk of diagnostic misinterpretation. This is done by leveraging the loss functions in the frequency domain, assigning higher weights to the reconstruction ",
    "path": "papers/23/10/2310.11112.json",
    "total_tokens": 832,
    "translated_title": "使用深度学习保持组织结构的组织冰冻切片的超分辨率",
    "translated_abstract": "组织病理学在医学诊断中起着关键作用。与准备永久性切片相比，制备冰冻切片的过程更快，可以在手术期间进行，样本扫描时间应得到优化。超分辨率技术可以在低放大倍数下对样本进行成像，从而节省扫描时间。本文提出了一种新的组织病理冰冻切片的超分辨率方法，重点是获得更好的畸变度量，而不是追求可能会损害关键诊断信息的逼真图像。我们的深度学习架构通过学习插值图像与真实图像之间的误差，生成高分辨率图像，同时保留关键图像细节，减少诊断错误的风险。通过在频域中使用损失函数，将更高的权重分配给重建的图像。",
    "tldr": "本文提出了一种使用深度学习的超分辨率方法，可用于组织病理冰冻切片，通过保留关键图像细节，减少诊断错误的风险。"
}