{
    "title": "Triple Simplex Matrix Completion for Expense Forecasting. (arXiv:2310.15275v1 [cs.LG])",
    "abstract": "Forecasting project expenses is a crucial step for businesses to avoid budget overruns and project failures. Traditionally, this has been done by financial analysts or data science techniques such as time-series analysis. However, these approaches can be uncertain and produce results that differ from the planned budget, especially at the start of a project with limited data points. This paper proposes a constrained non-negative matrix completion model that predicts expenses by learning the likelihood of the project correlating with certain expense patterns in the latent space. The model is constrained on three probability simplexes, two of which are on the factor matrices and the third on the missing entries. Additionally, the predicted expense values are guaranteed to meet the budget constraint without the need of post-processing. An inexact alternating optimization algorithm is developed to solve the associated optimization problem and is proven to converge to a stationary point. Res",
    "link": "http://arxiv.org/abs/2310.15275",
    "context": "Title: Triple Simplex Matrix Completion for Expense Forecasting. (arXiv:2310.15275v1 [cs.LG])\nAbstract: Forecasting project expenses is a crucial step for businesses to avoid budget overruns and project failures. Traditionally, this has been done by financial analysts or data science techniques such as time-series analysis. However, these approaches can be uncertain and produce results that differ from the planned budget, especially at the start of a project with limited data points. This paper proposes a constrained non-negative matrix completion model that predicts expenses by learning the likelihood of the project correlating with certain expense patterns in the latent space. The model is constrained on three probability simplexes, two of which are on the factor matrices and the third on the missing entries. Additionally, the predicted expense values are guaranteed to meet the budget constraint without the need of post-processing. An inexact alternating optimization algorithm is developed to solve the associated optimization problem and is proven to converge to a stationary point. Res",
    "path": "papers/23/10/2310.15275.json",
    "total_tokens": 836,
    "translated_title": "三重单纯形矩阵完成用于费用预测",
    "translated_abstract": "预测项目费用是企业避免预算超支和项目失败的关键步骤。传统上，这是由财务分析师或数据科学技术（如时间序列分析）完成的。然而，这些方法可能存在不确定性，并产生与计划预算不同的结果，特别是在项目开始时数据点有限的情况下。本文提出了一种受约束的非负矩阵完成模型，通过学习项目与潜在空间中某些费用模式的相关性，预测费用的可能性。该模型在因子矩阵和缺失条目上受到三个概率单纯形的约束。此外，预测的费用值保证满足预算约束，无需后处理。一个非精确的交替优化算法被开发用于解决相关优化问题，并证明收敛到一个稳定点。",
    "tldr": "本文提出了一种使用三重单纯形矩阵完成方法进行费用预测的模型。该模型通过学习项目与潜在空间中的费用模式相关性来预测费用，同时满足预算约束并保证预测结果的准确性。"
}