{
    "title": "Toward a Critical Toponymy Framework for Named Entity Recognition: A Case Study of Airbnb in New York City. (arXiv:2310.15302v1 [cs.CL])",
    "abstract": "Critical toponymy examines the dynamics of power, capital, and resistance through place names and the sites to which they refer. Studies here have traditionally focused on the semantic content of toponyms and the top-down institutional processes that produce them. However, they have generally ignored the ways in which toponyms are used by ordinary people in everyday discourse, as well as the other strategies of geospatial description that accompany and contextualize toponymic reference. Here, we develop computational methods to measure how cultural and economic capital shape the ways in which people refer to places, through a novel annotated dataset of 47,440 New York City Airbnb listings from the 2010s. Building on this dataset, we introduce a new named entity recognition (NER) model able to identify important discourse categories integral to the characterization of place. Our findings point toward new directions for critical toponymy and to a range of previously understudied linguist",
    "link": "http://arxiv.org/abs/2310.15302",
    "context": "Title: Toward a Critical Toponymy Framework for Named Entity Recognition: A Case Study of Airbnb in New York City. (arXiv:2310.15302v1 [cs.CL])\nAbstract: Critical toponymy examines the dynamics of power, capital, and resistance through place names and the sites to which they refer. Studies here have traditionally focused on the semantic content of toponyms and the top-down institutional processes that produce them. However, they have generally ignored the ways in which toponyms are used by ordinary people in everyday discourse, as well as the other strategies of geospatial description that accompany and contextualize toponymic reference. Here, we develop computational methods to measure how cultural and economic capital shape the ways in which people refer to places, through a novel annotated dataset of 47,440 New York City Airbnb listings from the 2010s. Building on this dataset, we introduce a new named entity recognition (NER) model able to identify important discourse categories integral to the characterization of place. Our findings point toward new directions for critical toponymy and to a range of previously understudied linguist",
    "path": "papers/23/10/2310.15302.json",
    "total_tokens": 894,
    "translated_title": "基于批评地名学的命名实体识别框架：以纽约市Airbnb为例",
    "translated_abstract": "批评地名学通过地名和相关地点研究权力、资本和抵抗的动态。传统研究主要关注地名的语义内容和自上而下的制度过程，但通常忽视了普通人在日常话语中使用地名的方式，以及与地名相关的地理空间描述策略。本文通过对2010年代的47,440个纽约市Airbnb房源进行创新的注释数据集构建，开发计算方法以衡量文化和经济资本如何影响人们对地点的称谓方式。基于该数据集，我们引入了一个新的命名实体识别（NER）模型，能够识别与地点特征化相关的重要话语类别。我们的研究结果指向批评地名学的新方向，以及一系列以前未被充分研究的语言学问题。",
    "tldr": "通过研究纽约市Airbnb房源数据集，本文提出了一个基于批评地名学的命名实体识别（NER）模型，能够识别与地点特征化相关的重要话语类别，为批评地名学研究指明了新的方向。",
    "en_tdlr": "This paper proposes a named entity recognition (NER) model based on critical toponymy, using a dataset of Airbnb listings in New York City to identify important discourse categories related to place characterization. The findings provide new directions for critical toponymy research."
}