{
    "title": "Graph Neural Networks for Recommendation: Reproducibility, Graph Topology, and Node Representation. (arXiv:2310.11270v2 [cs.IR] UPDATED)",
    "abstract": "Graph neural networks (GNNs) have gained prominence in recommendation systems in recent years. By representing the user-item matrix as a bipartite and undirected graph, GNNs have demonstrated their potential to capture short- and long-distance user-item interactions, thereby learning more accurate preference patterns than traditional recommendation approaches. In contrast to previous tutorials on the same topic, this tutorial aims to present and examine three key aspects that characterize GNNs for recommendation: (i) the reproducibility of state-of-the-art approaches, (ii) the potential impact of graph topological characteristics on the performance of these models, and (iii) strategies for learning node representations when training features from scratch or utilizing pre-trained embeddings as additional item information (e.g., multimodal features). The goal is to provide three novel theoretical and practical perspectives on the field, currently subject to debate in graph learning but l",
    "link": "http://arxiv.org/abs/2310.11270",
    "context": "Title: Graph Neural Networks for Recommendation: Reproducibility, Graph Topology, and Node Representation. (arXiv:2310.11270v2 [cs.IR] UPDATED)\nAbstract: Graph neural networks (GNNs) have gained prominence in recommendation systems in recent years. By representing the user-item matrix as a bipartite and undirected graph, GNNs have demonstrated their potential to capture short- and long-distance user-item interactions, thereby learning more accurate preference patterns than traditional recommendation approaches. In contrast to previous tutorials on the same topic, this tutorial aims to present and examine three key aspects that characterize GNNs for recommendation: (i) the reproducibility of state-of-the-art approaches, (ii) the potential impact of graph topological characteristics on the performance of these models, and (iii) strategies for learning node representations when training features from scratch or utilizing pre-trained embeddings as additional item information (e.g., multimodal features). The goal is to provide three novel theoretical and practical perspectives on the field, currently subject to debate in graph learning but l",
    "path": "papers/23/10/2310.11270.json",
    "total_tokens": 884,
    "translated_title": "推荐系统中的图神经网络: 可复现性、图拓扑和节点表示",
    "translated_abstract": "最近几年，图神经网络（GNNs）在推荐系统中变得越来越重要。通过将用户-物品矩阵表示为一个二部图和无向图，GNN能够捕捉用户-物品之间的近距离和远距离交互，从而比传统推荐方法学习到更准确的偏好模式。与之前的同类教程不同，本教程旨在展示和探讨推荐中GNNs的三个关键方面：（i）最先进方法的可复现性，（ii）图拓扑特征对模型性能的潜在影响，以及（iii）在从零开始训练特征或利用预训练嵌入作为额外物品信息（例如多模态特征）时，学习节点表示的策略。我们的目标是为该领域提供三个新颖的理论和实践视角，目前在图学习中存在争议。",
    "tldr": "本教程针对推荐中的图神经网络的三个关键方面进行了探讨：最先进方法的可复现性，图拓扑特征对模型性能的影响，以及学习节点表示的策略。",
    "en_tdlr": "This tutorial explores three key aspects of graph neural networks (GNNs) for recommendation: the reproducibility of state-of-the-art approaches, the potential impact of graph topological characteristics on model performance, and strategies for learning node representations."
}