{
    "title": "Experimental quantum natural gradient optimization in photonics. (arXiv:2310.07371v1 [quant-ph])",
    "abstract": "Variational quantum algorithms (VQAs) combining the advantages of parameterized quantum circuits and classical optimizers, promise practical quantum applications in the Noisy Intermediate-Scale Quantum era. The performance of VQAs heavily depends on the optimization method. Compared with gradient-free and ordinary gradient descent methods, the quantum natural gradient (QNG), which mirrors the geometric structure of the parameter space, can achieve faster convergence and avoid local minima more easily, thereby reducing the cost of circuit executions. We utilized a fully programmable photonic chip to experimentally estimate the QNG in photonics for the first time. We obtained the dissociation curve of the He-H$^+$ cation and achieved chemical accuracy, verifying the outperformance of QNG optimization on a photonic device. Our work opens up a vista of utilizing QNG in photonics to implement practical near-term quantum applications.",
    "link": "http://arxiv.org/abs/2310.07371",
    "context": "Title: Experimental quantum natural gradient optimization in photonics. (arXiv:2310.07371v1 [quant-ph])\nAbstract: Variational quantum algorithms (VQAs) combining the advantages of parameterized quantum circuits and classical optimizers, promise practical quantum applications in the Noisy Intermediate-Scale Quantum era. The performance of VQAs heavily depends on the optimization method. Compared with gradient-free and ordinary gradient descent methods, the quantum natural gradient (QNG), which mirrors the geometric structure of the parameter space, can achieve faster convergence and avoid local minima more easily, thereby reducing the cost of circuit executions. We utilized a fully programmable photonic chip to experimentally estimate the QNG in photonics for the first time. We obtained the dissociation curve of the He-H$^+$ cation and achieved chemical accuracy, verifying the outperformance of QNG optimization on a photonic device. Our work opens up a vista of utilizing QNG in photonics to implement practical near-term quantum applications.",
    "path": "papers/23/10/2310.07371.json",
    "total_tokens": 848,
    "translated_title": "光子学中的实验量子自然梯度优化",
    "translated_abstract": "变分量子算法（VQA）将参数化量子电路和经典优化器的优点结合起来，为噪声中间尺度量子时代的实际应用提供了可能。VQA的性能严重依赖于优化方法。相比无梯度和普通梯度下降方法，量子自然梯度（QNG）可以更快地收敛，更容易避免局部极小值，从而减少电路执行成本。我们利用一个全可编程的光子芯片首次在光子学中实验估计了QNG。我们获得了He-H$^+$阳离子的解离曲线，并达到了化学精度，验证了QNG优化在光子设备上的超越性能。我们的工作为在光子学中利用QNG实现实用的近期量子应用开辟了新的前景。",
    "tldr": "该论文在光子学领域首次使用光子实验估计了量子自然梯度（QNG），并通过获得He-H$^+$阳离子的解离曲线并达到化学精度，验证了QNG优化在光子设备上的超越性能。"
}