{
    "title": "Adversarial Masked Image Inpainting for Robust Detection of Mpox and Non-Mpox. (arXiv:2310.06318v1 [eess.IV])",
    "abstract": "Due to the lack of efficient mpox diagnostic technology, mpox cases continue to increase. Recently, the great potential of deep learning models in detecting mpox and non-mpox has been proven. However, existing models learn image representations via image classification, which results in they may be easily susceptible to interference from real-world noise, require diverse non-mpox images, and fail to detect abnormal input. These drawbacks make classification models inapplicable in real-world settings. To address these challenges, we propose \"Mask, Inpainting, and Measure\" (MIM). In MIM's pipeline, a generative adversarial network only learns mpox image representations by inpainting the masked mpox images. Then, MIM determines whether the input belongs to mpox by measuring the similarity between the inpainted image and the original image. The underlying intuition is that since MIM solely models mpox images, it struggles to accurately inpaint non-mpox images in real-world settings. Withou",
    "link": "http://arxiv.org/abs/2310.06318",
    "context": "Title: Adversarial Masked Image Inpainting for Robust Detection of Mpox and Non-Mpox. (arXiv:2310.06318v1 [eess.IV])\nAbstract: Due to the lack of efficient mpox diagnostic technology, mpox cases continue to increase. Recently, the great potential of deep learning models in detecting mpox and non-mpox has been proven. However, existing models learn image representations via image classification, which results in they may be easily susceptible to interference from real-world noise, require diverse non-mpox images, and fail to detect abnormal input. These drawbacks make classification models inapplicable in real-world settings. To address these challenges, we propose \"Mask, Inpainting, and Measure\" (MIM). In MIM's pipeline, a generative adversarial network only learns mpox image representations by inpainting the masked mpox images. Then, MIM determines whether the input belongs to mpox by measuring the similarity between the inpainted image and the original image. The underlying intuition is that since MIM solely models mpox images, it struggles to accurately inpaint non-mpox images in real-world settings. Withou",
    "path": "papers/23/10/2310.06318.json",
    "total_tokens": 1028,
    "translated_title": "对抗性掩蔽图像修复在鲁棒检测 Mpox 和非 Mpox 中的应用",
    "translated_abstract": "由于缺乏有效的 Mpox 诊断技术，Mpox 病例不断增加。最近，深度学习模型在检测 Mpox 和非 Mpox 方面显示出巨大潜力。然而，现有模型通过图像分类学习图像表示，结果可能容易受到现实世界噪声的干扰，需要多样化的非 Mpox 图像，并且无法检测异常输入。这些缺点使得分类模型在实际环境中无法应用。为了解决这些挑战，我们提出了“掩蔽、修复和测量”（MIM）方法。在 MIM 的流程中，生成对抗网络仅通过修复掩蔽的 Mpox 图像来学习 Mpox 图像表示。然后，MIM通过测量修复图像与原始图像之间的相似性来确定输入是否属于 Mpox。其基本思想是，由于 MIM 仅模拟 Mpox 图像，它在实际环境中无法准确修复非 Mpox 图像。",
    "tldr": "本研究提出了一种对抗性掩蔽图像修复方法(MIM)，通过修复掩蔽的 Mpox 图像来学习 Mpox 图像表示，并通过测量修复图像与原始图像之间的相似性来判断输入是否属于 Mpox。这种方法有效解决了现有模型受到现实世界噪声干扰、需要多样化的非 Mpox 图像以及无法检测异常输入的问题。",
    "en_tdlr": "This study proposes an adversarial masked image inpainting method (MIM) that learns mpox image representations by inpainting masked mpox images and determines whether an input belongs to mpox by measuring the similarity between the inpainted image and the original image. This method effectively addresses the challenges faced by existing models in terms of susceptibility to real-world noise, the requirement for diverse non-mpox images, and the inability to detect abnormal input."
}