{
    "title": "Regret-Minimization Algorithms for Multi-Agent Cooperative Learning Systems. (arXiv:2310.19468v1 [cs.LG])",
    "abstract": "A Multi-Agent Cooperative Learning (MACL) system is an artificial intelligence (AI) system where multiple learning agents work together to complete a common task. Recent empirical success of MACL systems in various domains (e.g. traffic control, cloud computing, robotics) has sparked active research into the design and analysis of MACL systems for sequential decision making problems. One important metric of the learning algorithm for decision making problems is its regret, i.e. the difference between the highest achievable reward and the actual reward that the algorithm gains. The design and development of a MACL system with low-regret learning algorithms can create huge economic values. In this thesis, I analyze MACL systems for different sequential decision making problems. Concretely, the Chapter 3 and 4 investigate the cooperative multi-agent multi-armed bandit problems, with full-information or bandit feedback, in which multiple learning agents can exchange their information throu",
    "link": "http://arxiv.org/abs/2310.19468",
    "context": "Title: Regret-Minimization Algorithms for Multi-Agent Cooperative Learning Systems. (arXiv:2310.19468v1 [cs.LG])\nAbstract: A Multi-Agent Cooperative Learning (MACL) system is an artificial intelligence (AI) system where multiple learning agents work together to complete a common task. Recent empirical success of MACL systems in various domains (e.g. traffic control, cloud computing, robotics) has sparked active research into the design and analysis of MACL systems for sequential decision making problems. One important metric of the learning algorithm for decision making problems is its regret, i.e. the difference between the highest achievable reward and the actual reward that the algorithm gains. The design and development of a MACL system with low-regret learning algorithms can create huge economic values. In this thesis, I analyze MACL systems for different sequential decision making problems. Concretely, the Chapter 3 and 4 investigate the cooperative multi-agent multi-armed bandit problems, with full-information or bandit feedback, in which multiple learning agents can exchange their information throu",
    "path": "papers/23/10/2310.19468.json",
    "total_tokens": 933,
    "translated_title": "多智能体合作学习系统中的遗憾最小化算法",
    "translated_abstract": "多智能体合作学习(MACL)系统是一种人工智能系统，多个学习智能体共同完成一个共同任务。最近在各个领域（如交通控制、云计算、机器人技术）中，MACL系统取得了良好的实证成功，这激发了对设计和分析用于顺序决策问题的MACL系统的研究。决策问题中学习算法的重要指标是遗憾，即算法实际获得的奖励与最高可达奖励之间的差异。设计和开发具有低遗憾学习算法的MACL系统可以创造巨大的经济价值。本文分析了不同顺序决策问题下的MACL系统。具体而言，第3章和第4章研究了具有全信息或者信息有限反馈的合作多智能体多臂老虎机问题，在这些问题中，多个学习智能体可以通过交换信息来改善学习效果。",
    "tldr": "本文研究了多智能体合作学习系统中的遗憾最小化算法。通过分析不同顺序决策问题下的MACL系统，本文提出了在合作多智能体多臂老虎机问题中使用全信息或信息有限反馈的方法，通过交换信息来改善学习效果。",
    "en_tdlr": "This paper investigates regret-minimization algorithms for multi-agent cooperative learning systems. The author analyzes MACL systems for different sequential decision making problems and proposes methods for cooperative multi-agent multi-armed bandit problems with full-information or bandit feedback, aiming to improve learning performance by exchanging information."
}