{
    "title": "Learning characteristic parameters and dynamics of centrifugal pumps under multi-phase flow using physics-informed neural networks. (arXiv:2310.03001v1 [cs.LG])",
    "abstract": "Electrical submersible pumps (ESP) are the second most used artificial lifting equipment in the oil and gas industry due to their high flow rates and boost pressures. They often have to handle multiphase flows, which usually contain a mixture of hydrocarbons, water, and/or sediments. Given these circumstances, emulsions are commonly formed. It is a liquid-liquid flow composed of two immiscible fluids whose effective viscosity and density differ from the single phase separately. In this context, accurate modeling of ESP systems is crucial for optimizing oil production and implementing control strategies. However, real-time and direct measurement of fluid and system characteristics is often impractical due to time constraints and economy. Hence, indirect methods are generally considered to estimate the system parameters. In this paper, we formulate a machine learning model based on Physics-Informed Neural Networks (PINNs) to estimate crucial system parameters. In order to study the effic",
    "link": "http://arxiv.org/abs/2310.03001",
    "context": "Title: Learning characteristic parameters and dynamics of centrifugal pumps under multi-phase flow using physics-informed neural networks. (arXiv:2310.03001v1 [cs.LG])\nAbstract: Electrical submersible pumps (ESP) are the second most used artificial lifting equipment in the oil and gas industry due to their high flow rates and boost pressures. They often have to handle multiphase flows, which usually contain a mixture of hydrocarbons, water, and/or sediments. Given these circumstances, emulsions are commonly formed. It is a liquid-liquid flow composed of two immiscible fluids whose effective viscosity and density differ from the single phase separately. In this context, accurate modeling of ESP systems is crucial for optimizing oil production and implementing control strategies. However, real-time and direct measurement of fluid and system characteristics is often impractical due to time constraints and economy. Hence, indirect methods are generally considered to estimate the system parameters. In this paper, we formulate a machine learning model based on Physics-Informed Neural Networks (PINNs) to estimate crucial system parameters. In order to study the effic",
    "path": "papers/23/10/2310.03001.json",
    "total_tokens": 852,
    "translated_title": "使用物理信息神经网络学习多相流下离心泵的特性参数和动力学",
    "translated_abstract": "电潜泵（ESP）由于其高流量和增压，是油气工业中第二常用的人工提升设备。它们经常需要处理多相流动，这些流体通常包含烃类、水和/或沉积物的混合物。在这种情况下，通常会形成乳液，它是由两种不互溶流体组成的液液流动，其有效粘度和密度与单独的单相流动有所不同。在此背景下，准确建模ESP系统对于优化油田生产和实施控制策略至关重要。然而，由于时间限制和经济原因，实时和直接测量流体和系统特性通常是不可实现的。因此，一般考虑间接方法来估计系统参数。本文提出了一个基于物理信息神经网络（PINNs）的机器学习模型，用于估计关键的系统参数。",
    "tldr": "本文提出了一种基于物理信息神经网络（PINNs）的机器学习模型，用于估计离心泵在多相流下的特性参数和动力学。",
    "en_tdlr": "This paper proposes a machine learning model based on Physics-Informed Neural Networks (PINNs) to estimate the characteristic parameters and dynamics of centrifugal pumps under multi-phase flow."
}