{
    "title": "Navigating Uncertainty in ESG Investing. (arXiv:2310.02163v1 [q-fin.PM])",
    "abstract": "The widespread confusion among investors regarding Environmental, Social, and Governance (ESG) rankings assigned by rating agencies has underscored a critical issue in sustainable investing. To address this uncertainty, our research has devised methods that not only recognize this ambiguity but also offer tailored investment strategies for different investor profiles. By developing ESG ensemble strategies and integrating ESG scores into a Reinforcement Learning (RL) model, we aim to optimize portfolios that cater to both financial returns and ESG-focused outcomes. Additionally, by proposing the Double-Mean-Variance model, we classify three types of investors based on their risk preferences. We also introduce ESG-adjusted Capital Asset Pricing Models (CAPMs) to assess the performance of these optimized portfolios. Ultimately, our comprehensive approach provides investors with tools to navigate the inherent ambiguities of ESG ratings, facilitating more informed investment decisions.",
    "link": "http://arxiv.org/abs/2310.02163",
    "context": "Title: Navigating Uncertainty in ESG Investing. (arXiv:2310.02163v1 [q-fin.PM])\nAbstract: The widespread confusion among investors regarding Environmental, Social, and Governance (ESG) rankings assigned by rating agencies has underscored a critical issue in sustainable investing. To address this uncertainty, our research has devised methods that not only recognize this ambiguity but also offer tailored investment strategies for different investor profiles. By developing ESG ensemble strategies and integrating ESG scores into a Reinforcement Learning (RL) model, we aim to optimize portfolios that cater to both financial returns and ESG-focused outcomes. Additionally, by proposing the Double-Mean-Variance model, we classify three types of investors based on their risk preferences. We also introduce ESG-adjusted Capital Asset Pricing Models (CAPMs) to assess the performance of these optimized portfolios. Ultimately, our comprehensive approach provides investors with tools to navigate the inherent ambiguities of ESG ratings, facilitating more informed investment decisions.",
    "path": "papers/23/10/2310.02163.json",
    "total_tokens": 1016,
    "translated_title": "在ESG投资中导航不确定性",
    "translated_abstract": "投资者对评级机构对环境、社会和公司治理(ESG)所分配的排名普遍存在困惑，凸显出可持续投资中的一个关键问题。为了解决这种不确定性，我们的研究提出了一种方法，不仅可识别出这种模糊性，而且为不同投资者提供量身定制的投资策略。通过开发ESG集合策略，并将ESG评分整合到强化学习模型中，我们旨在优化既能获得金融回报又能关注ESG目标的投资组合。此外，通过提出双效均值方差模型，我们基于风险偏好对投资者进行分类。我们还引入了ESG调整的资本资产定价模型(CAPM)来评估这些优化投资组合的表现。最终，我们综合的方法为投资者提供了导航ESG评级固有模糊性的工具，促进更明智的投资决策。",
    "tldr": "该论文提出了一种方法来解决ESG投资中的不确定性问题。通过开发ESG集合策略和将ESG评分整合到强化学习模型中，研究提供了量身定制的投资策略，并引入了双效均值方差模型来分类投资者。此外，引入ESG调整的CAPM模型评估优化投资组合的表现。最终，该方法为投资者提供了导航ESG评级固有模糊性的工具，帮助做出更明智的投资决策。"
}