{
    "title": "Synergistic Fusion of Graph and Transformer Features for Enhanced Molecular Property Prediction. (arXiv:2310.03027v1 [physics.chem-ph])",
    "abstract": "Molecular property prediction is a critical task in computational drug discovery. While recent advances in Graph Neural Networks (GNNs) and Transformers have shown to be effective and promising, they face the following limitations: Transformer self-attention does not explicitly consider the underlying molecule structure while GNN feature representation alone is not sufficient to capture granular and hidden interactions and characteristics that distinguish similar molecules. To address these limitations, we propose SYNFUSION, a novel approach that synergistically combines pre-trained features from GNNs and Transformers. This approach provides a comprehensive molecular representation, capturing both the global molecule structure and the individual atom characteristics. Experimental results on MoleculeNet benchmarks demonstrate superior performance, surpassing previous models in 5 out of 7 classification datasets and 4 out of 6 regression datasets. The performance of SYN-FUSION has been",
    "link": "http://arxiv.org/abs/2310.03027",
    "context": "Title: Synergistic Fusion of Graph and Transformer Features for Enhanced Molecular Property Prediction. (arXiv:2310.03027v1 [physics.chem-ph])\nAbstract: Molecular property prediction is a critical task in computational drug discovery. While recent advances in Graph Neural Networks (GNNs) and Transformers have shown to be effective and promising, they face the following limitations: Transformer self-attention does not explicitly consider the underlying molecule structure while GNN feature representation alone is not sufficient to capture granular and hidden interactions and characteristics that distinguish similar molecules. To address these limitations, we propose SYNFUSION, a novel approach that synergistically combines pre-trained features from GNNs and Transformers. This approach provides a comprehensive molecular representation, capturing both the global molecule structure and the individual atom characteristics. Experimental results on MoleculeNet benchmarks demonstrate superior performance, surpassing previous models in 5 out of 7 classification datasets and 4 out of 6 regression datasets. The performance of SYN-FUSION has been",
    "path": "papers/23/10/2310.03027.json",
    "total_tokens": 864,
    "translated_title": "图和Transformer特征的协同融合可增强分子性质预测",
    "translated_abstract": "分子性质预测是计算药物发现中的关键任务。最近图神经网络（GNN）和Transformer的进展表明它们是有效且有希望的，但它们存在以下限制：Transformer自注意机制在明确考虑底层分子结构方面不足，而仅依靠GNN特征表示不足以捕捉细粒度和隐藏的分子间相互作用和特征，这使得相似分子之间难以区分。为了解决这些限制，我们提出了SYNFUSION，一种新颖的方法，它协同组合了来自GNN和Transformer的预训练特征。这种方法提供了全面的分子表示，捕捉了全局分子结构和各个原子的特性。在MoleculeNet基准测试中的实验结果表明，SYNFUSION具有优越的性能，在5个分类数据集和6个回归数据集中超过了以前的模型。",
    "tldr": "本论文提出了一种名为SYNFUSION的新方法，通过协同融合GNN和Transformer的预训练特征，实现了全面的分子表示，在分子性质预测任务中超越了以往的模型。",
    "en_tdlr": "This paper proposes a novel approach called SYNFUSION, which synergistically combines pre-trained features from GNNs and Transformers to provide a comprehensive molecular representation. Experimental results show that SYNFUSION outperforms previous models in molecular property prediction."
}