{
    "title": "A Semiparametric Instrumented Difference-in-Differences Approach to Policy Learning. (arXiv:2310.09545v1 [stat.ME])",
    "abstract": "Recently, there has been a surge in methodological development for the difference-in-differences (DiD) approach to evaluate causal effects. Standard methods in the literature rely on the parallel trends assumption to identify the average treatment effect on the treated. However, the parallel trends assumption may be violated in the presence of unmeasured confounding, and the average treatment effect on the treated may not be useful in learning a treatment assignment policy for the entire population. In this article, we propose a general instrumented DiD approach for learning the optimal treatment policy. Specifically, we establish identification results using a binary instrumental variable (IV) when the parallel trends assumption fails to hold. Additionally, we construct a Wald estimator, novel inverse probability weighting (IPW) estimators, and a class of semiparametric efficient and multiply robust estimators, with theoretical guarantees on consistency and asymptotic normality, even ",
    "link": "http://arxiv.org/abs/2310.09545",
    "context": "Title: A Semiparametric Instrumented Difference-in-Differences Approach to Policy Learning. (arXiv:2310.09545v1 [stat.ME])\nAbstract: Recently, there has been a surge in methodological development for the difference-in-differences (DiD) approach to evaluate causal effects. Standard methods in the literature rely on the parallel trends assumption to identify the average treatment effect on the treated. However, the parallel trends assumption may be violated in the presence of unmeasured confounding, and the average treatment effect on the treated may not be useful in learning a treatment assignment policy for the entire population. In this article, we propose a general instrumented DiD approach for learning the optimal treatment policy. Specifically, we establish identification results using a binary instrumental variable (IV) when the parallel trends assumption fails to hold. Additionally, we construct a Wald estimator, novel inverse probability weighting (IPW) estimators, and a class of semiparametric efficient and multiply robust estimators, with theoretical guarantees on consistency and asymptotic normality, even ",
    "path": "papers/23/10/2310.09545.json",
    "total_tokens": 860,
    "translated_title": "一种半参数的工具变差分方法用于政策学习",
    "translated_abstract": "最近，针对差异对差异（DiD）方法进行因果效应评估的方法学发展有所增加。文献中的标准方法依赖于平行趋势假设来识别对待处理的平均处理效应。然而，在存在未测定混淆的情况下，平行趋势假设可能会被违反，并且对待处理的平均处理效应可能对整个人群的治疗分配政策学习没有用处。在本文中，我们提出了一种通用的工具变差分方法来学习最优的治疗政策。具体来说，我们建立了一个二进制工具变量（IV）的识别结果，当平行趋势假设不成立时。此外，我们构建了瓦尔德估计器、新颖的反概率加权估计器（IPW）和一类半参数有效且多重鲁棒估计器，具有一致性和渐近正态性的理论保证，",
    "tldr": "提出了一种半参数的工具变差分方法，用于学习最优治疗政策，并构建了一些估计器来解决平行趋势假设不成立的问题。",
    "en_tdlr": "A semiparametric instrumented difference-in-differences approach is proposed for learning the optimal treatment policy, with constructed estimators to address the violation of parallel trends assumption."
}