{
    "title": "Antarlekhaka: A Comprehensive Tool for Multi-task Natural Language Annotation. (arXiv:2310.07826v1 [cs.CL])",
    "abstract": "One of the primary obstacles in the advancement of Natural Language Processing (NLP) technologies for low-resource languages is the lack of annotated datasets for training and testing machine learning models. In this paper, we present Antarlekhaka, a tool for manual annotation of a comprehensive set of tasks relevant to NLP. The tool is Unicode-compatible, language-agnostic, Web-deployable and supports distributed annotation by multiple simultaneous annotators. The system sports user-friendly interfaces for 8 categories of annotation tasks. These, in turn, enable the annotation of a considerably larger set of NLP tasks. The task categories include two linguistic tasks not handled by any other tool, namely, sentence boundary detection and deciding canonical word order, which are important tasks for text that is in the form of poetry. We propose the idea of sequential annotation based on small text units, where an annotator performs several tasks related to a single text unit before proc",
    "link": "http://arxiv.org/abs/2310.07826",
    "context": "Title: Antarlekhaka: A Comprehensive Tool for Multi-task Natural Language Annotation. (arXiv:2310.07826v1 [cs.CL])\nAbstract: One of the primary obstacles in the advancement of Natural Language Processing (NLP) technologies for low-resource languages is the lack of annotated datasets for training and testing machine learning models. In this paper, we present Antarlekhaka, a tool for manual annotation of a comprehensive set of tasks relevant to NLP. The tool is Unicode-compatible, language-agnostic, Web-deployable and supports distributed annotation by multiple simultaneous annotators. The system sports user-friendly interfaces for 8 categories of annotation tasks. These, in turn, enable the annotation of a considerably larger set of NLP tasks. The task categories include two linguistic tasks not handled by any other tool, namely, sentence boundary detection and deciding canonical word order, which are important tasks for text that is in the form of poetry. We propose the idea of sequential annotation based on small text units, where an annotator performs several tasks related to a single text unit before proc",
    "path": "papers/23/10/2310.07826.json",
    "total_tokens": 919,
    "translated_title": "Antarlekhaka：一个全面的多任务自然语言标注工具",
    "translated_abstract": "自然语言处理（NLP）技术在低资源语言中的推进面临的主要障碍之一是缺乏用于训练和测试机器学习模型的标注数据集。在本文中，我们介绍了Antarlekhaka，一个用于手动标注与NLP相关的一整套任务的工具。该工具兼容Unicode，与语言无关，可在Web上部署，并支持多个同时注释者的分布式注释。该系统提供了用户友好的界面，支持8个类别的标注任务。这些任务类别又能够支持更多的NLP任务的标注。其中包括两个其他工具没有处理的语言任务，即句子边界检测和决定规范词序，这些对于诗歌形式的文本是重要的任务。我们提出了基于小文本单元的顺序标注的想法，其中注释者在处理一个文本单元之前会执行多个与之相关的任务。",
    "tldr": "Antarlekhaka是一个全面的多任务自然语言标注工具，可用于手动标注与NLP相关的任务。它兼容Unicode，支持分布式注释，并提供用户友好的界面。其中包括两个其他工具没有处理的任务，即句子边界检测和决定规范词序，这对于诗歌形式的文本是重要的。",
    "en_tdlr": "Antarlekhaka is a comprehensive tool for manual annotation of a wide range of NLP tasks. It is Unicode-compatible, supports distributed annotation, and provides user-friendly interfaces. It includes two linguistic tasks not handled by other tools, namely sentence boundary detection and deciding canonical word order, which are important for poetry."
}