{
    "title": "Cheap Talking Algorithms. (arXiv:2310.07867v1 [econ.TH])",
    "abstract": "We simulate behaviour of independent reinforcement learning algorithms playing the Crawford and Sobel (1982) game of strategic information transmission. We show that a sender and a receiver training together converge to strategies close to the exante optimal equilibrium of the game. Hence, communication takes place to the largest extent predicted by Nash equilibrium given the degree of conflict of interest between agents. The conclusion is shown to be robust to alternative specifications of the hyperparameters and of the game. We discuss implications for theories of equilibrium selection in information transmission games, for work on emerging communication among algorithms in computer science and for the economics of collusions in markets populated by artificially intelligent agents.",
    "link": "http://arxiv.org/abs/2310.07867",
    "context": "Title: Cheap Talking Algorithms. (arXiv:2310.07867v1 [econ.TH])\nAbstract: We simulate behaviour of independent reinforcement learning algorithms playing the Crawford and Sobel (1982) game of strategic information transmission. We show that a sender and a receiver training together converge to strategies close to the exante optimal equilibrium of the game. Hence, communication takes place to the largest extent predicted by Nash equilibrium given the degree of conflict of interest between agents. The conclusion is shown to be robust to alternative specifications of the hyperparameters and of the game. We discuss implications for theories of equilibrium selection in information transmission games, for work on emerging communication among algorithms in computer science and for the economics of collusions in markets populated by artificially intelligent agents.",
    "path": "papers/23/10/2310.07867.json",
    "total_tokens": 854,
    "translated_title": "廉价对话算法",
    "translated_abstract": "我们模拟独立的强化学习算法在克劳福德和索贝尔（1982）的战略信息传递游戏中的行为。我们表明，一个发送者和一个接收者一起进行训练，收敛到接近游戏先验最优均衡的策略。因此，通信在与代理之间的利益冲突程度给出的纳什均衡下，按照最大程度进行。这一结论对超参数和游戏的备选规范稳健。我们讨论了信息传递游戏中均衡选择理论、计算机科学中算法间新兴通信工作以及由人工智能代理组成的市场中的宫斗经济学的影响。",
    "tldr": "该论文研究了在战略信息传递游戏中，利用独立强化学习算法进行训练的发送者和接收者可以收敛到接近最优均衡策略，并且在代理之间的利益冲突下实现了最大化的通信。这一结论稳健，并对信息传递游戏中的均衡选择理论、计算机科学中的算法间通信和人工智能代理市场中的经济学产生了影响。",
    "en_tdlr": "This paper investigates the behavior of independent reinforcement learning algorithms in the strategic information transmission game, showing that both the sender and receiver can converge to strategies close to the ex ante optimal equilibrium. Communication is maximized according to Nash equilibrium given the degree of conflict between agents. The findings have implications for equilibrium selection theories, the communication among algorithms in computer science, and the economics of markets populated by artificially intelligent agents."
}