{
    "title": "Learning Cyber Defence Tactics from Scratch with Multi-Agent Reinforcement Learning. (arXiv:2310.05939v1 [cs.CR])",
    "abstract": "Recent advancements in deep learning techniques have opened new possibilities for designing solutions for autonomous cyber defence. Teams of intelligent agents in computer network defence roles may reveal promising avenues to safeguard cyber and kinetic assets. In a simulated game environment, agents are evaluated on their ability to jointly mitigate attacker activity in host-based defence scenarios. Defender systems are evaluated against heuristic attackers with the goals of compromising network confidentiality, integrity, and availability. Value-based Independent Learning and Centralized Training Decentralized Execution (CTDE) cooperative Multi-Agent Reinforcement Learning (MARL) methods are compared revealing that both approaches outperform a simple multi-agent heuristic defender. This work demonstrates the ability of cooperative MARL to learn effective cyber defence tactics against varied threats.",
    "link": "http://arxiv.org/abs/2310.05939",
    "context": "Title: Learning Cyber Defence Tactics from Scratch with Multi-Agent Reinforcement Learning. (arXiv:2310.05939v1 [cs.CR])\nAbstract: Recent advancements in deep learning techniques have opened new possibilities for designing solutions for autonomous cyber defence. Teams of intelligent agents in computer network defence roles may reveal promising avenues to safeguard cyber and kinetic assets. In a simulated game environment, agents are evaluated on their ability to jointly mitigate attacker activity in host-based defence scenarios. Defender systems are evaluated against heuristic attackers with the goals of compromising network confidentiality, integrity, and availability. Value-based Independent Learning and Centralized Training Decentralized Execution (CTDE) cooperative Multi-Agent Reinforcement Learning (MARL) methods are compared revealing that both approaches outperform a simple multi-agent heuristic defender. This work demonstrates the ability of cooperative MARL to learn effective cyber defence tactics against varied threats.",
    "path": "papers/23/10/2310.05939.json",
    "total_tokens": 820,
    "translated_title": "从零开始使用多智能体强化学习学习网络防御战术",
    "translated_abstract": "深度学习技术的最新进展为自主网络防御解决方案的设计开辟了新的可能性。在计算机网络防御角色中，智能代理团队可能展现出保护网络和动能资产的有希望的途径。在模拟的游戏环境中，代理根据其在主机防御场景中共同减轻攻击者活动的能力进行评估。守方系统会面对能破坏网络机密性、完整性和可用性的启发式攻击者。对比了基于价值的独立学习和集中培训分散执行的合作多智能体强化学习方法，发现这两种方法都胜过简单的多智能体启发式防御者。这项工作表明，合作多智能体强化学习能够学习有效的网络防御战术，以抵御各种威胁。",
    "tldr": "学习网络防御战术的新方法，使用多智能体强化学习来进行自主网络防御，证明了合作多智能体强化学习能够对抗各种威胁。",
    "en_tdlr": "New method for learning cyber defense tactics using multi-agent reinforcement learning for autonomous network defense, demonstrating the effectiveness of cooperative multi-agent reinforcement learning against various threats."
}