{
    "title": "Heterogeneous Graph Neural Networks for Data-driven Traffic Assignment. (arXiv:2310.13193v1 [cs.LG])",
    "abstract": "The traffic assignment problem is one of the significant components of traffic flow analysis for which various solution approaches have been proposed. However, deploying these approaches for large-scale networks poses significant challenges. In this paper, we leverage the power of heterogeneous graph neural networks to propose a novel data-driven approach for traffic assignment and traffic flow learning. The proposed model is capable of capturing spatial traffic patterns across different links, yielding highly accurate results. We present numerical experiments on urban transportation networks and show that the proposed heterogeneous graph neural network model outperforms other conventional neural network models in terms of convergence rate, training loss, and prediction accuracy. Notably, the proposed heterogeneous graph neural network model can also be generalized to different network topologies. This approach offers a promising solution for complex traffic flow analysis and predictio",
    "link": "http://arxiv.org/abs/2310.13193",
    "context": "Title: Heterogeneous Graph Neural Networks for Data-driven Traffic Assignment. (arXiv:2310.13193v1 [cs.LG])\nAbstract: The traffic assignment problem is one of the significant components of traffic flow analysis for which various solution approaches have been proposed. However, deploying these approaches for large-scale networks poses significant challenges. In this paper, we leverage the power of heterogeneous graph neural networks to propose a novel data-driven approach for traffic assignment and traffic flow learning. The proposed model is capable of capturing spatial traffic patterns across different links, yielding highly accurate results. We present numerical experiments on urban transportation networks and show that the proposed heterogeneous graph neural network model outperforms other conventional neural network models in terms of convergence rate, training loss, and prediction accuracy. Notably, the proposed heterogeneous graph neural network model can also be generalized to different network topologies. This approach offers a promising solution for complex traffic flow analysis and predictio",
    "path": "papers/23/10/2310.13193.json",
    "total_tokens": 870,
    "translated_title": "基于异构图神经网络的数据驱动交通分配研究",
    "translated_abstract": "交通分配问题是交通流分析的重要组成部分之一，已经提出了各种解决方法。然而，将这些方法应用于大规模网络面临重大挑战。在本文中，我们利用异构图神经网络的强大能力，提出了一种新颖的基于数据驱动的交通分配和交通流学习方法。所提出的模型能够捕捉不同链路之间的空间交通模式，从而产生高度准确的结果。我们在城市交通网络上进行了数值实验，并展示了该异构图神经网络模型在收敛速度、训练损失和预测准确度方面优于其他传统神经网络模型的表现。值得注意的是，所提出的异构图神经网络模型还可以推广到不同的网络拓扑。这种方法为复杂交通流分析和预测提供了一种有希望的解决方案。",
    "tldr": "本论文提出了一种基于异构图神经网络的数据驱动交通分配和交通流学习方法，该方法能够准确捕捉不同链路之间的空间交通模式，优于其他传统神经网络模型，在大规模网络中有着广泛的应用潜力。",
    "en_tdlr": "This paper proposes a novel data-driven approach for traffic assignment and traffic flow learning using heterogeneous graph neural networks, which can accurately capture spatial traffic patterns across different links. It outperforms other conventional neural network models and has the potential for wide application in large-scale networks."
}