{
    "title": "Spatial-Temporal Hypergraph Neural Network for Traffic Forecasting. (arXiv:2310.16070v1 [cs.LG])",
    "abstract": "Traffic forecasting, which benefits from mobile Internet development and position technologies, plays a critical role in Intelligent Transportation Systems. It helps to implement rich and varied transportation applications and bring convenient transportation services to people based on collected traffic data. Most existing methods usually leverage graph-based deep learning networks to model the complex road network for traffic forecasting shallowly. Despite their effectiveness, these methods are generally limited in fully capturing high-order spatial dependencies caused by road network topology and high-order temporal dependencies caused by traffic dynamics. To tackle the above issues, we focus on the essence of traffic system and propose STHODE: Spatio-Temporal Hypergraph Neural Ordinary Differential Equation Network, which combines road network topology and traffic dynamics to capture high-order spatio-temporal dependencies in traffic data. Technically, STHODE consists of a spatial m",
    "link": "http://arxiv.org/abs/2310.16070",
    "context": "Title: Spatial-Temporal Hypergraph Neural Network for Traffic Forecasting. (arXiv:2310.16070v1 [cs.LG])\nAbstract: Traffic forecasting, which benefits from mobile Internet development and position technologies, plays a critical role in Intelligent Transportation Systems. It helps to implement rich and varied transportation applications and bring convenient transportation services to people based on collected traffic data. Most existing methods usually leverage graph-based deep learning networks to model the complex road network for traffic forecasting shallowly. Despite their effectiveness, these methods are generally limited in fully capturing high-order spatial dependencies caused by road network topology and high-order temporal dependencies caused by traffic dynamics. To tackle the above issues, we focus on the essence of traffic system and propose STHODE: Spatio-Temporal Hypergraph Neural Ordinary Differential Equation Network, which combines road network topology and traffic dynamics to capture high-order spatio-temporal dependencies in traffic data. Technically, STHODE consists of a spatial m",
    "path": "papers/23/10/2310.16070.json",
    "total_tokens": 912,
    "translated_title": "空间-时间超图神经网络用于交通预测",
    "translated_abstract": "交通预测在智能交通系统中起着至关重要的作用，它依靠移动互联网发展和定位技术，通过收集的交通数据来实现丰富多样的交通应用，并为人们带来便捷的交通服务。目前大部分现有方法通常利用基于图的深度学习网络浅层建模复杂的道路网络进行交通预测。然而，尽管这些方法的有效性，但它们通常在完全捕捉道路网络拓扑引起的高阶空间依赖性和交通动态引起的高阶时空依赖性方面存在局限性。为了解决以上问题，我们关注交通系统的本质，提出了STHODE（Spatio-Temporal Hypergraph Neural Ordinary Differential Equation Network），它结合了道路网络拓扑和交通动态，以捕捉交通数据中的高阶空间-时间依赖性。从技术上讲，STHODE由一个空间部分和一个时间部分组成，在高阶空间依赖性建模方面使用超图表示道路网络拓扑，同时使用普通微分方程网络来建模高阶时间依赖性。",
    "tldr": "本文提出了一种名为STHODE的空间-时间超图神经网络用于交通预测，该网络结合了道路网络拓扑和交通动态，能够有效捕捉交通数据中的高阶空间-时间依赖性。",
    "en_tdlr": "This paper proposes a spatial-temporal hypergraph neural network called STHODE for traffic forecasting, which combines road network topology and traffic dynamics to effectively capture high-order spatio-temporal dependencies in traffic data."
}