{
    "title": "DySurv: Dynamic Deep Learning Model for Survival Prediction in the ICU",
    "abstract": "arXiv:2310.18681v2 Announce Type: replace  Abstract: Survival analysis focuses on estimating time-to-event distributions which can help in dynamic risk prediction in healthcare. Extending beyond the classical Cox model, deep learning techniques have been developed which moved away from the constraining assumptions of proportional hazards. Traditional statistical models often only include static information where, in this work, we propose a novel conditional variational autoencoder-based method called DySurv, which uses a combination of static and time-series measurements from patient electronic health records to estimate the risk of death dynamically. DySurv has been tested on several time-to-event benchmarks where it outperforms existing methods, including deep learning methods, and we evaluate it on real-world intensive care unit data from MIMIC-IV and eICU. The predictive capacity of DySurv is consistent and the survival estimates remain disentangled across different datasets suppor",
    "link": "https://arxiv.org/abs/2310.18681",
    "context": "Title: DySurv: Dynamic Deep Learning Model for Survival Prediction in the ICU\nAbstract: arXiv:2310.18681v2 Announce Type: replace  Abstract: Survival analysis focuses on estimating time-to-event distributions which can help in dynamic risk prediction in healthcare. Extending beyond the classical Cox model, deep learning techniques have been developed which moved away from the constraining assumptions of proportional hazards. Traditional statistical models often only include static information where, in this work, we propose a novel conditional variational autoencoder-based method called DySurv, which uses a combination of static and time-series measurements from patient electronic health records to estimate the risk of death dynamically. DySurv has been tested on several time-to-event benchmarks where it outperforms existing methods, including deep learning methods, and we evaluate it on real-world intensive care unit data from MIMIC-IV and eICU. The predictive capacity of DySurv is consistent and the survival estimates remain disentangled across different datasets suppor",
    "path": "papers/23/10/2310.18681.json",
    "total_tokens": 864,
    "translated_title": "DySurv：ICU中生存预测的动态深度学习模型",
    "translated_abstract": "生存分析侧重于估计时间至事件分布，可帮助在医疗保健中进行动态风险预测。扩展经典的Cox模型，发展了深度学习技术，摆脱了比例风险的约束性假设。传统统计模型通常仅包含静态信息，在这项工作中，我们提出了一种名为DySurv的新型基于条件变分自动编码器的方法，它利用患者电子健康记录中的静态信息和时间序列测量的组合来动态估计死亡风险。DySurv在多个时间至事件基准测试中进行了测试，优于现有方法，包括深度学习方法，并且我们在来自MIMIC-IV和eICU的现实世界重症监护数据上进行了评估。 DySurv的预测能力持续稳定，生存估计在不同数据集上保持解耦。",
    "tldr": "DySurv是一种新型的动态深度学习模型，结合静态和时间序列测量，用于估计ICU患者的死亡风险，在多个基准测试中表现优异，并在实际世界的ICU数据上进行了评估。",
    "en_tdlr": "DySurv is a novel dynamic deep learning model that combines static and time-series measurements for estimating the risk of death in ICU patients, outperforming existing methods in multiple benchmark tests and evaluated on real-world ICU data."
}