{
    "title": "Navigating protein landscapes with a machine-learned transferable coarse-grained model. (arXiv:2310.18278v1 [q-bio.BM])",
    "abstract": "The most popular and universally predictive protein simulation models employ all-atom molecular dynamics (MD), but they come at extreme computational cost. The development of a universal, computationally efficient coarse-grained (CG) model with similar prediction performance has been a long-standing challenge. By combining recent deep learning methods with a large and diverse training set of all-atom protein simulations, we here develop a bottom-up CG force field with chemical transferability, which can be used for extrapolative molecular dynamics on new sequences not used during model parametrization. We demonstrate that the model successfully predicts folded structures, intermediates, metastable folded and unfolded basins, and the fluctuations of intrinsically disordered proteins while it is several orders of magnitude faster than an all-atom model. This showcases the feasibility of a universal and computationally efficient machine-learned CG model for proteins.",
    "link": "http://arxiv.org/abs/2310.18278",
    "context": "Title: Navigating protein landscapes with a machine-learned transferable coarse-grained model. (arXiv:2310.18278v1 [q-bio.BM])\nAbstract: The most popular and universally predictive protein simulation models employ all-atom molecular dynamics (MD), but they come at extreme computational cost. The development of a universal, computationally efficient coarse-grained (CG) model with similar prediction performance has been a long-standing challenge. By combining recent deep learning methods with a large and diverse training set of all-atom protein simulations, we here develop a bottom-up CG force field with chemical transferability, which can be used for extrapolative molecular dynamics on new sequences not used during model parametrization. We demonstrate that the model successfully predicts folded structures, intermediates, metastable folded and unfolded basins, and the fluctuations of intrinsically disordered proteins while it is several orders of magnitude faster than an all-atom model. This showcases the feasibility of a universal and computationally efficient machine-learned CG model for proteins.",
    "path": "papers/23/10/2310.18278.json",
    "total_tokens": 904,
    "translated_title": "使用机器学习的可传递的粗粒化模型导航蛋白质空间景观",
    "translated_abstract": "最受欢迎且具有普遍预测能力的蛋白质模拟模型采用全原子分子动力学（MD），但它们的计算成本极高。开发一个具有类似预测性能的通用、计算效率高的粗粒化（CG）模型一直是一个长期存在的挑战。通过将最近的深度学习方法与大量多样的全原子蛋白质模拟训练集相结合，我们在此开发了一种自底向上的具有化学可传递性的CG力场模型，可用于对未在模型参数化期间使用的新序列进行外推分子动力学。我们证明了该模型成功预测了折叠结构、中间体、亚稳定的折叠和未折叠盆地以及无序蛋白质的波动，同时速度比全原子模型快几个数量级。这展示了一种针对蛋白质的通用且计算效率高的机器学习CG模型的可行性。",
    "tldr": "本文通过结合深度学习方法和大规模的训练集，开发了一种可传递的粗粒化模型，能够快速且准确地预测蛋白质的结构和性质。",
    "en_tdlr": "This paper develops a transferable coarse-grained model for protein simulation, using deep learning methods and a diverse training set. The model successfully predicts protein structures and properties with high accuracy and computational efficiency."
}