{
    "title": "CFDBench: A Comprehensive Benchmark for Machine Learning Methods in Fluid Dynamics. (arXiv:2310.05963v1 [cs.LG])",
    "abstract": "In recent years, applying deep learning to solve physics problems has attracted much attention. Data-driven deep learning methods produce operators that can learn solutions to the whole system of partial differential equations. However, the existing methods are only evaluated on simple flow equations (e.g., Burger's equation), and only consider the generalization ability on different initial conditions. In this paper, we construct CFDBench, a benchmark with four classic problems in computational fluid dynamics (CFD): lid-driven cavity flow, laminar boundary layer flow in circular tubes, dam flows through the steps, and periodic Karman vortex street. Each flow problem includes data with different boundary conditions, fluid physical properties, and domain geometry. Compared to existing datasets, the advantages of CFDBench are (1) comprehensive. It contains common physical parameters such as velocity, pressure, and cavity fraction. (2) realistic. It is very suitable for deep learning solu",
    "link": "http://arxiv.org/abs/2310.05963",
    "context": "Title: CFDBench: A Comprehensive Benchmark for Machine Learning Methods in Fluid Dynamics. (arXiv:2310.05963v1 [cs.LG])\nAbstract: In recent years, applying deep learning to solve physics problems has attracted much attention. Data-driven deep learning methods produce operators that can learn solutions to the whole system of partial differential equations. However, the existing methods are only evaluated on simple flow equations (e.g., Burger's equation), and only consider the generalization ability on different initial conditions. In this paper, we construct CFDBench, a benchmark with four classic problems in computational fluid dynamics (CFD): lid-driven cavity flow, laminar boundary layer flow in circular tubes, dam flows through the steps, and periodic Karman vortex street. Each flow problem includes data with different boundary conditions, fluid physical properties, and domain geometry. Compared to existing datasets, the advantages of CFDBench are (1) comprehensive. It contains common physical parameters such as velocity, pressure, and cavity fraction. (2) realistic. It is very suitable for deep learning solu",
    "path": "papers/23/10/2310.05963.json",
    "total_tokens": 919,
    "translated_title": "CFDBench：流体动力学中机器学习方法的综合基准测试",
    "translated_abstract": "近年来，将深度学习应用于解决物理问题已经引起了广泛关注。数据驱动的深度学习方法可以生成能学习解决整个偏微分方程系统的算子。然而，现有方法仅在简单的流动方程（如Burger方程）上进行评估，并且仅考虑了对不同初始条件的泛化能力。本文构建了CFDBench，一个针对计算流体力学（CFD）中四个经典问题的基准测试：驱动腔流动、圆管中的层流边界层流动、通过台阶的坝流动和周期性的卡门涡街流动。每个流动问题都包括具有不同边界条件、流体物理特性和域几何的数据。与现有数据集相比，CFDBench具有以下优势：（1）综合。它包含常用的物理参数，如速度、压力和腔体比例。（2）真实。非常适合深度学习解决方案。",
    "tldr": "这个论文介绍了CFDBench，这是一个针对计算流体动力学中四个经典问题的基准测试。它包含了不同边界条件、流体物理特性和域几何的数据，能帮助评估深度学习方法在解决物理问题中的表现。",
    "en_tdlr": "This paper introduces CFDBench, a benchmark for four classic problems in computational fluid dynamics. It includes data with different boundary conditions, fluid physical properties, and domain geometry, which can help evaluate the performance of deep learning methods in solving physics problems."
}