{
    "title": "Enhancing drug and cell line representations via contrastive learning for improved anti-cancer drug prioritization. (arXiv:2310.13725v2 [cs.LG] UPDATED)",
    "abstract": "Due to cancer's complex nature and variable response to therapy, precision oncology informed by omics sequence analysis has become the current standard of care. However, the amount of data produced for each patients makes it difficult to quickly identify the best treatment regimen. Moreover, limited data availability has hindered computational methods' abilities to learn patterns associated with effective drug-cell line pairs. In this work, we propose the use of contrastive learning to improve learned drug and cell line representations by preserving relationship structures associated with drug mechanism of action and cell line cancer types. In addition to achieving enhanced performance relative to a state-of-the-art method, we find that classifiers using our learned representations exhibit a more balances reliance on drug- and cell line-derived features when making predictions. This facilitates more personalized drug prioritizations that are informed by signals related to drug resistan",
    "link": "http://arxiv.org/abs/2310.13725",
    "context": "Title: Enhancing drug and cell line representations via contrastive learning for improved anti-cancer drug prioritization. (arXiv:2310.13725v2 [cs.LG] UPDATED)\nAbstract: Due to cancer's complex nature and variable response to therapy, precision oncology informed by omics sequence analysis has become the current standard of care. However, the amount of data produced for each patients makes it difficult to quickly identify the best treatment regimen. Moreover, limited data availability has hindered computational methods' abilities to learn patterns associated with effective drug-cell line pairs. In this work, we propose the use of contrastive learning to improve learned drug and cell line representations by preserving relationship structures associated with drug mechanism of action and cell line cancer types. In addition to achieving enhanced performance relative to a state-of-the-art method, we find that classifiers using our learned representations exhibit a more balances reliance on drug- and cell line-derived features when making predictions. This facilitates more personalized drug prioritizations that are informed by signals related to drug resistan",
    "path": "papers/23/10/2310.13725.json",
    "total_tokens": 965,
    "translated_title": "通过对比学习增强药物和细胞系表征，以改善抗癌药物优先级排序",
    "translated_abstract": "鉴于癌症的复杂性和对治疗的可变反应，通过基因组学序列分析进行的精确个体化癌症治疗已成为当前的标准。然而，每个患者产生的数据量使得快速识别最佳治疗方案变得困难。此外，受限的数据可用性妨碍了计算方法学习与有效药物-细胞系配对相关的模式。在这项工作中，我们提出使用对比学习改进学习到的药物和细胞系表征，以保留与药物作用机制和细胞系癌症类型相关的关系结构。除了相对于最先进的方法实现了卓越的性能外，我们发现使用我们学习到的表征的分类器在进行预测时更加平衡地依赖于药物和细胞系特征。这有助于更个性化的药物优先级排序，其基于与药物耐药性相关的信号。",
    "tldr": "通过对比学习，该研究提出了一种改进药物和细胞系表征的方法，以保留与药物作用机制和细胞系癌症类型相关的关系结构，并实现了卓越的性能。使用这种方法可以更好地平衡对药物和细胞系特征的依赖，从而实现更个性化的药物优先级排序。"
}