{
    "title": "How Robust is Federated Learning to Communication Error? A Comparison Study Between Uplink and Downlink Channels. (arXiv:2310.16652v1 [cs.LG])",
    "abstract": "Because of its privacy-preserving capability, federated learning (FL) has attracted significant attention from both academia and industry. However, when being implemented over wireless networks, it is not clear how much communication error can be tolerated by FL. This paper investigates the robustness of FL to the uplink and downlink communication error. Our theoretical analysis reveals that the robustness depends on two critical parameters, namely the number of clients and the numerical range of model parameters. It is also shown that the uplink communication in FL can tolerate a higher bit error rate (BER) than downlink communication, and this difference is quantified by a proposed formula. The findings and theoretical analyses are further validated by extensive experiments.",
    "link": "http://arxiv.org/abs/2310.16652",
    "context": "Title: How Robust is Federated Learning to Communication Error? A Comparison Study Between Uplink and Downlink Channels. (arXiv:2310.16652v1 [cs.LG])\nAbstract: Because of its privacy-preserving capability, federated learning (FL) has attracted significant attention from both academia and industry. However, when being implemented over wireless networks, it is not clear how much communication error can be tolerated by FL. This paper investigates the robustness of FL to the uplink and downlink communication error. Our theoretical analysis reveals that the robustness depends on two critical parameters, namely the number of clients and the numerical range of model parameters. It is also shown that the uplink communication in FL can tolerate a higher bit error rate (BER) than downlink communication, and this difference is quantified by a proposed formula. The findings and theoretical analyses are further validated by extensive experiments.",
    "path": "papers/23/10/2310.16652.json",
    "total_tokens": 741,
    "translated_title": "Federated Learning在通信错误方面的鲁棒性有多强？来自上行和下行通道的比较研究。",
    "translated_abstract": "由于其保护隐私的能力，联邦学习（FL）在学术界和工业界引起了广泛关注。然而，当在无线网络上实现时，FL能够容忍多少通信错误尚不清楚。本文研究了FL对上行和下行通信错误的鲁棒性。我们的理论分析揭示了鲁棒性取决于两个关键参数，即客户端数量和模型参数的数值范围。同时，我们证明了FL的上行通信可以容忍更高的误码率（BER）比下行通信，并提出了一个定量的差异公式。通过大量实验进一步验证了这些发现和理论分析。",
    "tldr": "本文研究了联邦学习对上行和下行通信错误的鲁棒性。理论分析表明，鲁棒性取决于客户端数量和模型参数的数值范围。实验证明上行通信可以容忍更高的误码率比下行通信。"
}