{
    "title": "Dual-Class Stocks: Can They Serve as Effective Predictors?. (arXiv:2310.16845v1 [q-fin.ST])",
    "abstract": "Kardemir Karabuk Iron Steel Industry Trade & Co. Inc., ranked as the 24th largest industrial company in Turkey, offers three distinct stocks listed on the Borsa Istanbul: KRDMA, KRDMB, and KRDMD. These stocks, sharing the sole difference in voting power, have exhibited significant price divergence over an extended period. This paper conducts an in-depth analysis of the divergence patterns observed in these three stock prices from January 2001 to July 2023. Additionally, it introduces an innovative training set selection rule tailored for LSTM models, incorporating a rolling training set, and demonstrates its significant predictive superiority over the conventional use of LSTM models with large training sets. Despite their strong correlation, the study found no compelling evidence supporting the efficiency of dual-class stocks as predictors of each other's performance.",
    "link": "http://arxiv.org/abs/2310.16845",
    "context": "Title: Dual-Class Stocks: Can They Serve as Effective Predictors?. (arXiv:2310.16845v1 [q-fin.ST])\nAbstract: Kardemir Karabuk Iron Steel Industry Trade & Co. Inc., ranked as the 24th largest industrial company in Turkey, offers three distinct stocks listed on the Borsa Istanbul: KRDMA, KRDMB, and KRDMD. These stocks, sharing the sole difference in voting power, have exhibited significant price divergence over an extended period. This paper conducts an in-depth analysis of the divergence patterns observed in these three stock prices from January 2001 to July 2023. Additionally, it introduces an innovative training set selection rule tailored for LSTM models, incorporating a rolling training set, and demonstrates its significant predictive superiority over the conventional use of LSTM models with large training sets. Despite their strong correlation, the study found no compelling evidence supporting the efficiency of dual-class stocks as predictors of each other's performance.",
    "path": "papers/23/10/2310.16845.json",
    "total_tokens": 900,
    "translated_title": "双重股票：它们能成为有效的预测指标吗？",
    "translated_abstract": "Kardemir Karabuk钢铁工业贸易有限公司是土耳其第24大工业公司，在Borsa Istanbul上列出了三种不同的股票：KRDMA，KRDMB和KRDMD。这些股票在投票权方面存在唯一的差异，并且在一个长时间段内显示出显著的价格分歧。本文深入分析了这三种股票价格从2001年1月至2023年7月观察到的分歧模式。此外，本文引入了一种创新的训练集选择规则，为LSTM模型量身定制，结合滚动训练集，并且证明了它相比于使用大型训练集的传统LSTM模型具有显著的预测优势。尽管它们之间存在强烈的相关性，但研究发现没有令人信服的证据支持双重股票作为彼此表现的预测指标的效率。",
    "tldr": "本文分析了Kardemir Karabuk钢铁工业贸易有限公司的三种不同股票之间的价格分歧模式，并引入了一种新的训练集选择规则为LSTM模型提供了显著的预测优势，同时表示双重股票并不能作为彼此表现的预测指标。",
    "en_tdlr": "This paper analyzes the price divergence patterns among three different stocks of Kardemir Karabuk Iron Steel Industry Trade & Co. Inc. and introduces a novel training set selection rule that provides significant predictive superiority for LSTM models. However, dual-class stocks are not found to be efficient predictors of each other's performance."
}