{
    "title": "An Integrative Survey on Mental Health Conversational Agents to Bridge Computer Science and Medical Perspectives. (arXiv:2310.17017v1 [cs.CL])",
    "abstract": "Mental health conversational agents (a.k.a. chatbots) are widely studied for their potential to offer accessible support to those experiencing mental health challenges. Previous surveys on the topic primarily consider papers published in either computer science or medicine, leading to a divide in understanding and hindering the sharing of beneficial knowledge between both domains. To bridge this gap, we conduct a comprehensive literature review using the PRISMA framework, reviewing 534 papers published in both computer science and medicine. Our systematic review reveals 136 key papers on building mental health-related conversational agents with diverse characteristics of modeling and experimental design techniques. We find that computer science papers focus on LLM techniques and evaluating response quality using automated metrics with little attention to the application while medical papers use rule-based conversational agents and outcome metrics to measure the health outcomes of parti",
    "link": "http://arxiv.org/abs/2310.17017",
    "context": "Title: An Integrative Survey on Mental Health Conversational Agents to Bridge Computer Science and Medical Perspectives. (arXiv:2310.17017v1 [cs.CL])\nAbstract: Mental health conversational agents (a.k.a. chatbots) are widely studied for their potential to offer accessible support to those experiencing mental health challenges. Previous surveys on the topic primarily consider papers published in either computer science or medicine, leading to a divide in understanding and hindering the sharing of beneficial knowledge between both domains. To bridge this gap, we conduct a comprehensive literature review using the PRISMA framework, reviewing 534 papers published in both computer science and medicine. Our systematic review reveals 136 key papers on building mental health-related conversational agents with diverse characteristics of modeling and experimental design techniques. We find that computer science papers focus on LLM techniques and evaluating response quality using automated metrics with little attention to the application while medical papers use rule-based conversational agents and outcome metrics to measure the health outcomes of parti",
    "path": "papers/23/10/2310.17017.json",
    "total_tokens": 922,
    "translated_title": "基于计算机科学和医学视角的心理健康对话代理综合调查",
    "translated_abstract": "心理健康对话代理（也称为聊天机器人）被广泛研究，因其提供对那些面临心理健康挑战的人可及性支持的潜力。之前对该主题的调查主要考虑在计算机科学或医学领域发表的论文，导致理解上的分裂，阻碍了两个领域之间有益知识的共享。为了弥合这一鸿沟，我们使用PRISMA框架进行全面的文献综述，审查了534篇在计算机科学和医学领域发表的论文。我们的系统综述揭示了136篇关键论文，涵盖了建立与心理健康相关的对话代理的多种建模和实验设计技术特征。我们发现，计算机科学论文侧重于LLM技术和使用自动度量评估响应质量，对应用应用关注较少，而医学论文则使用基于规则的对话代理和结果度量来衡量参与者的健康结果。",
    "tldr": "本研究使用PRISMA框架综述了计算机科学和医学领域发表的534篇论文，发现了136篇关键论文，涵盖了心理健康对话代理的多种建模和实验设计技术特征。",
    "en_tdlr": "This study conducted a comprehensive literature review using the PRISMA framework, reviewing 534 papers published in both computer science and medicine. It found 136 key papers covering diverse characteristics of modeling and experimental design techniques for mental health conversational agents."
}