{
    "title": "EMBERSim: A Large-Scale Databank for Boosting Similarity Search in Malware Analysis. (arXiv:2310.01835v1 [cs.LG])",
    "abstract": "In recent years there has been a shift from heuristics-based malware detection towards machine learning, which proves to be more robust in the current heavily adversarial threat landscape. While we acknowledge machine learning to be better equipped to mine for patterns in the increasingly high amounts of similar-looking files, we also note a remarkable scarcity of the data available for similarity-targeted research. Moreover, we observe that the focus in the few related works falls on quantifying similarity in malware, often overlooking the clean data. This one-sided quantification is especially dangerous in the context of detection bypass. We propose to address the deficiencies in the space of similarity research on binary files, starting from EMBER - one of the largest malware classification data sets. We enhance EMBER with similarity information as well as malware class tags, to enable further research in the similarity space. Our contribution is threefold: (1) we publish EMBERSim, ",
    "link": "http://arxiv.org/abs/2310.01835",
    "context": "Title: EMBERSim: A Large-Scale Databank for Boosting Similarity Search in Malware Analysis. (arXiv:2310.01835v1 [cs.LG])\nAbstract: In recent years there has been a shift from heuristics-based malware detection towards machine learning, which proves to be more robust in the current heavily adversarial threat landscape. While we acknowledge machine learning to be better equipped to mine for patterns in the increasingly high amounts of similar-looking files, we also note a remarkable scarcity of the data available for similarity-targeted research. Moreover, we observe that the focus in the few related works falls on quantifying similarity in malware, often overlooking the clean data. This one-sided quantification is especially dangerous in the context of detection bypass. We propose to address the deficiencies in the space of similarity research on binary files, starting from EMBER - one of the largest malware classification data sets. We enhance EMBER with similarity information as well as malware class tags, to enable further research in the similarity space. Our contribution is threefold: (1) we publish EMBERSim, ",
    "path": "papers/23/10/2310.01835.json",
    "total_tokens": 945,
    "translated_title": "EMBERSim: 用于提高恶意软件分析相似性搜索的大规模数据库",
    "translated_abstract": "近年来，从启发式的恶意软件检测向机器学习的转变，证明在当前充满敌对性威胁的环境下更加强大。虽然我们承认机器学习在挖掘日益增多的相似文件中的模式方面更加有优势，但我们还观察到在相似性研究领域中可用数据的明显缺乏。此外，我们观察到在少数相关工作中，重点放在量化恶意软件的相似性上，往往忽视了清洁数据。在检测绕过的背景下，这种单方面的量化尤其危险。我们提出解决二进制文件相似性研究空白领域的不足，从最大的恶意软件分类数据集EMBER开始。我们将EMBER与相似性信息以及恶意软件类别标签相结合，以支持相似性空间中的进一步研究。我们的贡献有三个方面：(1)我们发布EMBERSim，",
    "tldr": "EMBERSim是一个大规模数据库，用于提高恶意软件分析中的相似性搜索。它通过从最大的恶意软件分类数据集EMBER开始，并将相似性信息和恶意软件类别标签相结合，解决了相似性研究领域的不足。",
    "en_tdlr": "EMBERSim is a large-scale database that enhances similarity search in malware analysis. It addresses the deficiencies in the research on similarity in binary files by starting from the largest malware classification dataset, EMBER, and combining it with similarity information and malware class tags."
}