{
    "title": "Hybrid Quantum-Classical Machine Learning for Sentiment Analysis. (arXiv:2310.10672v1 [cs.CL])",
    "abstract": "The collaboration between quantum computing and classical machine learning offers potential advantages in natural language processing, particularly in the sentiment analysis of human emotions and opinions expressed in large-scale datasets. In this work, we propose a methodology for sentiment analysis using hybrid quantum-classical machine learning algorithms. We investigate quantum kernel approaches and variational quantum circuit-based classifiers and integrate them with classical dimension reduction techniques such as PCA and Haar wavelet transform. The proposed methodology is evaluated using two distinct datasets, based on English and Bengali languages. Experimental results show that after dimensionality reduction of the data, performance of the quantum-based hybrid algorithms were consistent and better than classical methods.",
    "link": "http://arxiv.org/abs/2310.10672",
    "context": "Title: Hybrid Quantum-Classical Machine Learning for Sentiment Analysis. (arXiv:2310.10672v1 [cs.CL])\nAbstract: The collaboration between quantum computing and classical machine learning offers potential advantages in natural language processing, particularly in the sentiment analysis of human emotions and opinions expressed in large-scale datasets. In this work, we propose a methodology for sentiment analysis using hybrid quantum-classical machine learning algorithms. We investigate quantum kernel approaches and variational quantum circuit-based classifiers and integrate them with classical dimension reduction techniques such as PCA and Haar wavelet transform. The proposed methodology is evaluated using two distinct datasets, based on English and Bengali languages. Experimental results show that after dimensionality reduction of the data, performance of the quantum-based hybrid algorithms were consistent and better than classical methods.",
    "path": "papers/23/10/2310.10672.json",
    "total_tokens": 801,
    "translated_title": "融合量子和经典机器学习的情感分析方法",
    "translated_abstract": "量子计算与经典机器学习的合作在自然语言处理中具有潜在优势，特别是在处理大规模数据集中表达的人类情感和观点的情感分析方面。本文提出了一种使用混合量子-经典机器学习算法进行情感分析的方法。我们研究了量子核方法和基于变分量子电路的分类器，并将它们与经典的降维技术（如PCA和Haar小波变换）结合起来。该方法在基于英语和孟加拉语的两个不同数据集上进行了评估。实验结果表明，在对数据进行降维处理后，基于量子的混合算法的性能一致且优于经典方法。",
    "tldr": "本文提出了一种使用混合量子-经典机器学习算法进行情感分析的方法，通过研究量子核方法和基于变分量子电路的分类器，并结合经典的降维技术，实现了在处理大规模数据集中表达的人类情感和观点的情感分析，并取得了相对于传统方法更好的性能。",
    "en_tdlr": "This paper proposes a methodology for sentiment analysis using hybrid quantum-classical machine learning algorithms, which combines quantum kernel approaches and variational quantum circuit-based classifiers with classical dimension reduction techniques. The proposed method achieves better performance in sentiment analysis of human emotions and opinions expressed in large-scale datasets compared to classical methods."
}