{
    "title": "Open-Set Knowledge-Based Visual Question Answering with Inference Paths. (arXiv:2310.08148v1 [cs.LG])",
    "abstract": "Given an image and an associated textual question, the purpose of Knowledge-Based Visual Question Answering (KB-VQA) is to provide a correct answer to the question with the aid of external knowledge bases. Prior KB-VQA models are usually formulated as a retriever-classifier framework, where a pre-trained retriever extracts textual or visual information from knowledge graphs and then makes a prediction among the candidates. Despite promising progress, there are two drawbacks with existing models. Firstly, modeling question-answering as multi-class classification limits the answer space to a preset corpus and lacks the ability of flexible reasoning. Secondly, the classifier merely consider \"what is the answer\" without \"how to get the answer\", which cannot ground the answer to explicit reasoning paths. In this paper, we confront the challenge of \\emph{explainable open-set} KB-VQA, where the system is required to answer questions with entities at wild and retain an explainable reasoning pa",
    "link": "http://arxiv.org/abs/2310.08148",
    "context": "Title: Open-Set Knowledge-Based Visual Question Answering with Inference Paths. (arXiv:2310.08148v1 [cs.LG])\nAbstract: Given an image and an associated textual question, the purpose of Knowledge-Based Visual Question Answering (KB-VQA) is to provide a correct answer to the question with the aid of external knowledge bases. Prior KB-VQA models are usually formulated as a retriever-classifier framework, where a pre-trained retriever extracts textual or visual information from knowledge graphs and then makes a prediction among the candidates. Despite promising progress, there are two drawbacks with existing models. Firstly, modeling question-answering as multi-class classification limits the answer space to a preset corpus and lacks the ability of flexible reasoning. Secondly, the classifier merely consider \"what is the answer\" without \"how to get the answer\", which cannot ground the answer to explicit reasoning paths. In this paper, we confront the challenge of \\emph{explainable open-set} KB-VQA, where the system is required to answer questions with entities at wild and retain an explainable reasoning pa",
    "path": "papers/23/10/2310.08148.json",
    "total_tokens": 873,
    "translated_title": "基于开放集知识的视觉问答系统及推理路径",
    "translated_abstract": "在给定一张图片和相关的文本问题的情况下，基于知识的视觉问答系统的目的是通过外部知识库提供正确的答案。先前的基于知识的视觉问答系统通常被形式化为一个检索器-分类器框架，在这个框架中，一个预训练的检索器从知识图谱中提取文本或视觉信息，然后在候选答案中进行预测。尽管取得了一些进展，但现有模型存在两个缺点。首先，将问题回答建模为多类别分类将答案空间限制在预设的语料库中，缺乏灵活推理的能力。其次，分类器仅仅考虑\"答案是什么\"而没有考虑\"如何得到答案\"，无法将答案与明确的推理路径进行关联。在本文中，我们面对着解释性开放集知识视觉问答系统的挑战，该系统要求能够回答涉及任意实体的问题，并保留可解释的推理路径。",
    "tldr": "本文提出了一种基于开放集知识的视觉问答系统，解决了现有模型中的分类限制和缺乏推理路径的问题。"
}