{
    "title": "The Search-and-Mix Paradigm in Approximate Nash Equilibrium Algorithms. (arXiv:2310.08066v1 [cs.GT])",
    "abstract": "AI in Math deals with mathematics in a constructive manner so that reasoning becomes automated, less laborious, and less error-prone. For algorithms, the question becomes how to automate analyses for specific problems. For the first time, this work provides an automatic method for approximation analysis on a well-studied problem in theoretical computer science: computing approximate Nash equilibria in two-player games. We observe that such algorithms can be reformulated into a search-and-mix paradigm, which involves a search phase followed by a mixing phase. By doing so, we are able to fully automate the procedure of designing and analyzing the mixing phase. For example, we illustrate how to perform our method with a program to analyze the approximation bounds of all the algorithms in the literature. Same approximation bounds are computed without any hand-written proof. Our automatic method heavily relies on the LP-relaxation structure in approximate Nash equilibria. Since many approxi",
    "link": "http://arxiv.org/abs/2310.08066",
    "context": "Title: The Search-and-Mix Paradigm in Approximate Nash Equilibrium Algorithms. (arXiv:2310.08066v1 [cs.GT])\nAbstract: AI in Math deals with mathematics in a constructive manner so that reasoning becomes automated, less laborious, and less error-prone. For algorithms, the question becomes how to automate analyses for specific problems. For the first time, this work provides an automatic method for approximation analysis on a well-studied problem in theoretical computer science: computing approximate Nash equilibria in two-player games. We observe that such algorithms can be reformulated into a search-and-mix paradigm, which involves a search phase followed by a mixing phase. By doing so, we are able to fully automate the procedure of designing and analyzing the mixing phase. For example, we illustrate how to perform our method with a program to analyze the approximation bounds of all the algorithms in the literature. Same approximation bounds are computed without any hand-written proof. Our automatic method heavily relies on the LP-relaxation structure in approximate Nash equilibria. Since many approxi",
    "path": "papers/23/10/2310.08066.json",
    "total_tokens": 922,
    "translated_title": "在近似纳什均衡算法中的搜索与混合范式",
    "translated_abstract": "数学中的人工智能以一种构造性的方式处理数学问题，使得推理自动化、减少劳动量和减少错误。对于算法来说，问题变成了如何自动化分析特定问题。本文首次提供了一种自动方法，用于在理论计算机科学中研究的一个经典问题上进行近似分析：计算二人博弈中的近似纳什均衡。我们观察到这样的算法可以重写为一个搜索和混合的范式，其中包括搜索阶段和混合阶段。通过这样做，我们能够完全自动化设计和分析混合阶段的过程。例如，我们演示了如何使用我们的方法来分析文献中所有算法的近似界限。同样的近似界限可以在没有任何手写证明的情况下计算出来。我们的自动方法严重依赖于近似纳什均衡中的线性松弛结构。",
    "tldr": "本研究提出了一种搜索和混合范式的自动方法，用于近似计算二人博弈中的纳什均衡。这种方法可以完全自动化设计和分析混合阶段，并且能够对已经存在的算法进行近似界限的分析，无需手写证明。",
    "en_tdlr": "This paper proposes an automatic method based on the search-and-mix paradigm for approximating Nash equilibria in two-player games. It fully automates the design and analysis of the mixing phase, and allows for the analysis of approximation bounds of existing algorithms without the need for manual proof."
}