{
    "title": "Spike-based Neuromorphic Computing for Next-Generation Computer Vision",
    "abstract": "arXiv:2310.09692v2 Announce Type: replace-cross  Abstract: Neuromorphic Computing promises orders of magnitude improvement in energy efficiency compared to traditional von Neumann computing paradigm. The goal is to develop an adaptive, fault-tolerant, low-footprint, fast, low-energy intelligent system by learning and emulating brain functionality which can be realized through innovation in different abstraction layers including material, device, circuit, architecture and algorithm. As the energy consumption in complex vision tasks keep increasing exponentially due to larger data set and resource-constrained edge devices become increasingly ubiquitous, spike-based neuromorphic computing approaches can be viable alternative to deep convolutional neural network that is dominating the vision field today. In this book chapter, we introduce neuromorphic computing, outline a few representative examples from different layers of the design stack (devices, circuits and algorithms) and conclude w",
    "link": "https://arxiv.org/abs/2310.09692",
    "context": "Title: Spike-based Neuromorphic Computing for Next-Generation Computer Vision\nAbstract: arXiv:2310.09692v2 Announce Type: replace-cross  Abstract: Neuromorphic Computing promises orders of magnitude improvement in energy efficiency compared to traditional von Neumann computing paradigm. The goal is to develop an adaptive, fault-tolerant, low-footprint, fast, low-energy intelligent system by learning and emulating brain functionality which can be realized through innovation in different abstraction layers including material, device, circuit, architecture and algorithm. As the energy consumption in complex vision tasks keep increasing exponentially due to larger data set and resource-constrained edge devices become increasingly ubiquitous, spike-based neuromorphic computing approaches can be viable alternative to deep convolutional neural network that is dominating the vision field today. In this book chapter, we introduce neuromorphic computing, outline a few representative examples from different layers of the design stack (devices, circuits and algorithms) and conclude w",
    "path": "papers/23/10/2310.09692.json",
    "total_tokens": 856,
    "translated_title": "面向下一代计算机视觉的基于脉冲的神经形态计算",
    "translated_abstract": "神经形态计算承诺在能量效率上比传统的冯·诺依曼计算范式有数量级的改进。其目标是通过学习和模拟大脑功能来开发一种自适应、容错、低占地面积、快速、低能耗的智能系统，可以通过不同抽象层次的创新来实现，包括材料、器件、电路、架构和算法。由于在复杂视觉任务中的能量消耗因数据集增大而呈指数级增长，而资源受限的边缘设备变得越来越普遍，基于脉冲的神经形态计算方法可以作为今天主导视觉领域的深度卷积神经网络的可行替代方案。在本书章节中，我们介绍了神经形态计算，概述了设计堆栈的不同层面（器件、电路和算法）中的一些代表性示例，并得出结论。",
    "tldr": "基于脉冲的神经形态计算作为对今天主导视觉领域的深度卷积神经网络的可行替代，承诺能够实现数量级的能量效率提升。",
    "en_tdlr": "Spike-based neuromorphic computing, as a viable alternative to the dominant deep convolutional neural networks in the vision field today, promises orders of magnitude improvement in energy efficiency."
}