{
    "title": "Arabic Fine-Grained Entity Recognition. (arXiv:2310.17333v1 [cs.CL])",
    "abstract": "Traditional NER systems are typically trained to recognize coarse-grained entities, and less attention is given to classifying entities into a hierarchy of fine-grained lower-level subtypes. This article aims to advance Arabic NER with fine-grained entities. We chose to extend Wojood (an open-source Nested Arabic Named Entity Corpus) with subtypes. In particular, four main entity types in Wojood, geopolitical entity (GPE), location (LOC), organization (ORG), and facility (FAC), are extended with 31 subtypes. To do this, we first revised Wojood's annotations of GPE, LOC, ORG, and FAC to be compatible with the LDC's ACE guidelines, which yielded 5, 614 changes. Second, all mentions of GPE, LOC, ORG, and FAC (~44K) in Wojood are manually annotated with the LDC's ACE sub-types. We refer to this extended version of Wojood as WojoodF ine. To evaluate our annotations, we measured the inter-annotator agreement (IAA) using both Cohen's Kappa and F1 score, resulting in 0.9861 and 0.9889, respect",
    "link": "http://arxiv.org/abs/2310.17333",
    "context": "Title: Arabic Fine-Grained Entity Recognition. (arXiv:2310.17333v1 [cs.CL])\nAbstract: Traditional NER systems are typically trained to recognize coarse-grained entities, and less attention is given to classifying entities into a hierarchy of fine-grained lower-level subtypes. This article aims to advance Arabic NER with fine-grained entities. We chose to extend Wojood (an open-source Nested Arabic Named Entity Corpus) with subtypes. In particular, four main entity types in Wojood, geopolitical entity (GPE), location (LOC), organization (ORG), and facility (FAC), are extended with 31 subtypes. To do this, we first revised Wojood's annotations of GPE, LOC, ORG, and FAC to be compatible with the LDC's ACE guidelines, which yielded 5, 614 changes. Second, all mentions of GPE, LOC, ORG, and FAC (~44K) in Wojood are manually annotated with the LDC's ACE sub-types. We refer to this extended version of Wojood as WojoodF ine. To evaluate our annotations, we measured the inter-annotator agreement (IAA) using both Cohen's Kappa and F1 score, resulting in 0.9861 and 0.9889, respect",
    "path": "papers/23/10/2310.17333.json",
    "total_tokens": 994,
    "translated_title": "阿拉伯精细化实体识别",
    "translated_abstract": "传统的NER系统通常被训练来识别粗粒度实体，并且对将实体分类为细粒度的低层级子类型的关注较少。本文旨在通过精细化实体提升阿拉伯NER。我们选择扩展Wojood（一个开源的嵌套阿拉伯命名实体语料库）的子类型。尤其是，Wojood中的四种主要实体类型，地缘政治实体（GPE），位置（LOC），组织（ORG）和设施（FAC），被扩展为31个子类型。为了做到这一点，我们首先修订了Wojood对GPE，LOC，ORG和FAC的注释，使其与LDC的ACE指南兼容，结果有5614处更改。其次，我们人工注释了Wojood中所有GPE，LOC，ORG和FAC的提及（约44K），使用LDC的ACE子类型。我们将这个扩展版本的Wojood称为WojoodFine。为了评估我们的注释，我们使用Cohen's Kappa和F1得分来测量评注者一致性（IAA），结果分别为0.9861和0.9889",
    "tldr": "本论文提出了一种阿拉伯精细化实体识别方法，通过扩展现有的阿拉伯命名实体语料库，将地缘政治实体、位置、组织和设施等四种主要实体类型扩展为31个子类型，并通过评估评注者一致性证明了扩展后的效果。",
    "en_tdlr": "This paper proposes an approach for Arabic fine-grained entity recognition by extending an existing Arabic Named Entity Corpus with 31 subtypes. The evaluation of the extended corpus shows promising results in terms of inter-annotator agreement."
}