{
    "title": "Intrinsic Gaussian Vector Fields on Manifolds. (arXiv:2310.18824v1 [stat.ML])",
    "abstract": "Various applications ranging from robotics to climate science require modeling signals on non-Euclidean domains, such as the sphere. Gaussian process models on manifolds have recently been proposed for such tasks, in particular when uncertainty quantification is needed. In the manifold setting, vector-valued signals can behave very differently from scalar-valued ones, with much of the progress so far focused on modeling the latter. The former, however, are crucial for many applications, such as modeling wind speeds or force fields of unknown dynamical systems. In this paper, we propose novel Gaussian process models for vector-valued signals on manifolds that are intrinsically defined and account for the geometry of the space in consideration. We provide computational primitives needed to deploy the resulting Hodge-Mat\\'ern Gaussian vector fields on the two-dimensional sphere and the hypertori. Further, we highlight two generalization directions: discrete two-dimensional meshes and \"ide",
    "link": "http://arxiv.org/abs/2310.18824",
    "context": "Title: Intrinsic Gaussian Vector Fields on Manifolds. (arXiv:2310.18824v1 [stat.ML])\nAbstract: Various applications ranging from robotics to climate science require modeling signals on non-Euclidean domains, such as the sphere. Gaussian process models on manifolds have recently been proposed for such tasks, in particular when uncertainty quantification is needed. In the manifold setting, vector-valued signals can behave very differently from scalar-valued ones, with much of the progress so far focused on modeling the latter. The former, however, are crucial for many applications, such as modeling wind speeds or force fields of unknown dynamical systems. In this paper, we propose novel Gaussian process models for vector-valued signals on manifolds that are intrinsically defined and account for the geometry of the space in consideration. We provide computational primitives needed to deploy the resulting Hodge-Mat\\'ern Gaussian vector fields on the two-dimensional sphere and the hypertori. Further, we highlight two generalization directions: discrete two-dimensional meshes and \"ide",
    "path": "papers/23/10/2310.18824.json",
    "total_tokens": 930,
    "translated_title": "球面上的内在高斯向量场",
    "translated_abstract": "从机器人技术到气候科学等各种应用都需要对非欧几里得域（如球面）上的信号进行建模。最近，在流行度量空间上提出了高斯过程模型，尤其是在需要进行不确定性量化的任务中。在流形设置中，与标量值信号相比，矢量值信号可能表现出截然不同的行为，迄今为止的大部分进展都集中在对前者进行建模。然而，对于许多应用，如对未知动力系统的风速或力场进行建模，后者至关重要。本文提出了一种在流形上为矢量值信号提供内在定义并考虑空间几何的新型高斯过程模型。我们提供了部署所得到的Hodge-Mat\\'ern高斯向量场在二维球面和超曲面上所需的计算基元。此外，我们还强调了两个推广方向：离散的二维网格和”ide“（暂且译为：想法）。",
    "tldr": "本文提出了一种新型的在流形上处理矢量值信号的高斯过程模型，具有内在定义和考虑空间几何的特点，并为部署在二维球面和超曲面上的Hodge-Mat\\'ern高斯向量场提供了计算基元。",
    "en_tdlr": "This paper proposes a novel Gaussian process model for handling vector-valued signals on manifolds, which is intrinsically defined and takes into account the geometry of the space. It provides computational primitives for deploying Hodge-Mat\\'ern Gaussian vector fields on the two-dimensional sphere and hypertori, and highlights two generalization directions: discrete two-dimensional meshes and \"ide\" (ideas, concepts)."
}