{
    "title": "Big data-driven prediction of airspace congestion. (arXiv:2310.08982v1 [cs.AI])",
    "abstract": "Air Navigation Service Providers (ANSP) worldwide have been making a considerable effort for the development of a better method to measure and predict aircraft counts within a particular airspace, also referred to as airspace density. An accurate measurement and prediction of airspace density is crucial for a better managed airspace, both strategically and tactically, yielding a higher level of automation and thereby reducing the air traffic controller's workload. Although the prior approaches have been able to address the problem to some extent, data management and query processing of ever-increasing vast volume of air traffic data at high rates, for various analytics purposes such as predicting aircraft counts, still remains a challenge especially when only linear prediction models are used.  In this paper, we present a novel data management and prediction system that accurately predicts aircraft counts for a particular airspace sector within the National Airspace System (NAS). The i",
    "link": "http://arxiv.org/abs/2310.08982",
    "context": "Title: Big data-driven prediction of airspace congestion. (arXiv:2310.08982v1 [cs.AI])\nAbstract: Air Navigation Service Providers (ANSP) worldwide have been making a considerable effort for the development of a better method to measure and predict aircraft counts within a particular airspace, also referred to as airspace density. An accurate measurement and prediction of airspace density is crucial for a better managed airspace, both strategically and tactically, yielding a higher level of automation and thereby reducing the air traffic controller's workload. Although the prior approaches have been able to address the problem to some extent, data management and query processing of ever-increasing vast volume of air traffic data at high rates, for various analytics purposes such as predicting aircraft counts, still remains a challenge especially when only linear prediction models are used.  In this paper, we present a novel data management and prediction system that accurately predicts aircraft counts for a particular airspace sector within the National Airspace System (NAS). The i",
    "path": "papers/23/10/2310.08982.json",
    "total_tokens": 805,
    "translated_title": "基于大数据的航空领域拥堵预测",
    "translated_abstract": "国际上的航空导航服务提供商一直在努力开发一种更好的方法来测量和预测特定空域内的飞机数量，也称为空域密度。精确测量和预测空域密度对于更好地管理空域至关重要，无论是战略上还是战术上，都能实现更高级别的自动化，从而减轻空中交通管制员的工作负担。尽管以前的方法在某种程度上已经能够解决这个问题，但在处理不断增长的庞大的空中交通数据时，数据管理和查询处理仍然是一个挑战，特别是在使用线性预测模型的情况下。在本文中，我们提出了一种新颖的数据管理和预测系统，可以准确预测国家空域系统（NAS）内特定空域部门的飞机数量。",
    "tldr": "本文提出了一种基于大数据的航空领域拥堵预测系统，可以准确预测国家空域系统（NAS）内特定空域部门的飞机数量。",
    "en_tdlr": "This paper presents a big data-driven prediction system for airspace congestion in the National Airspace System (NAS), accurately predicting aircraft counts for specific airspace sectors."
}