{
    "title": "Federated Quantum Machine Learning with Differential Privacy. (arXiv:2310.06973v1 [quant-ph])",
    "abstract": "The preservation of privacy is a critical concern in the implementation of artificial intelligence on sensitive training data. There are several techniques to preserve data privacy but quantum computations are inherently more secure due to the no-cloning theorem, resulting in a most desirable computational platform on top of the potential quantum advantages. There have been prior works in protecting data privacy by Quantum Federated Learning (QFL) and Quantum Differential Privacy (QDP) studied independently. However, to the best of our knowledge, no prior work has addressed both QFL and QDP together yet. Here, we propose to combine these privacy-preserving methods and implement them on the quantum platform, so that we can achieve comprehensive protection against data leakage (QFL) and model inversion attacks (QDP). This implementation promises more efficient and secure artificial intelligence. In this paper, we present a successful implementation of these privacy-preservation methods b",
    "link": "http://arxiv.org/abs/2310.06973",
    "context": "Title: Federated Quantum Machine Learning with Differential Privacy. (arXiv:2310.06973v1 [quant-ph])\nAbstract: The preservation of privacy is a critical concern in the implementation of artificial intelligence on sensitive training data. There are several techniques to preserve data privacy but quantum computations are inherently more secure due to the no-cloning theorem, resulting in a most desirable computational platform on top of the potential quantum advantages. There have been prior works in protecting data privacy by Quantum Federated Learning (QFL) and Quantum Differential Privacy (QDP) studied independently. However, to the best of our knowledge, no prior work has addressed both QFL and QDP together yet. Here, we propose to combine these privacy-preserving methods and implement them on the quantum platform, so that we can achieve comprehensive protection against data leakage (QFL) and model inversion attacks (QDP). This implementation promises more efficient and secure artificial intelligence. In this paper, we present a successful implementation of these privacy-preservation methods b",
    "path": "papers/23/10/2310.06973.json",
    "total_tokens": 822,
    "translated_title": "具有差分隐私的联邦量子机器学习",
    "translated_abstract": "在敏感训练数据上实施人工智能时，隐私保护是一个重要问题。有几种保护数据隐私的技术，但由于无克隆定理，量子计算在本质上更安全，因此成为最理想的计算平台之一。先前的研究中曾独立研究过量子联邦学习（QFL）和量子差分隐私（QDP）保护数据隐私的方法。然而，据我们所知，先前的研究尚未同时解决QFL和QDP。在本文中，我们提出了将这些隐私保护方法结合起来，并在量子平台上实施，以实现对数据泄露（QFL）和模型反演攻击（QDP）的全面保护。这种实现承诺更高效和安全的人工智能。",
    "tldr": "本文提出了将量子联邦学习（QFL）和量子差分隐私（QDP）相结合的方法，并在量子平台上实施，以实现对数据泄露和模型反演攻击的全面保护。",
    "en_tdlr": "This paper proposes a method that combines quantum federated learning (QFL) and quantum differential privacy (QDP) to achieve comprehensive protection against data leakage and model inversion attacks."
}