{
    "title": "Representing and Computing Uncertainty in Phonological Reconstruction. (arXiv:2310.12727v1 [cs.CL])",
    "abstract": "Despite the inherently fuzzy nature of reconstructions in historical linguistics, most scholars do not represent their uncertainty when proposing proto-forms. With the increasing success of recently proposed approaches to automating certain aspects of the traditional comparative method, the formal representation of proto-forms has also improved. This formalization makes it possible to address both the representation and the computation of uncertainty. Building on recent advances in supervised phonological reconstruction, during which an algorithm learns how to reconstruct words in a given proto-language relying on previously annotated data, and inspired by improved methods for automated word prediction from cognate sets, we present a new framework that allows for the representation of uncertainty in linguistic reconstruction and also includes a workflow for the computation of fuzzy reconstructions from linguistic data.",
    "link": "http://arxiv.org/abs/2310.12727",
    "context": "Title: Representing and Computing Uncertainty in Phonological Reconstruction. (arXiv:2310.12727v1 [cs.CL])\nAbstract: Despite the inherently fuzzy nature of reconstructions in historical linguistics, most scholars do not represent their uncertainty when proposing proto-forms. With the increasing success of recently proposed approaches to automating certain aspects of the traditional comparative method, the formal representation of proto-forms has also improved. This formalization makes it possible to address both the representation and the computation of uncertainty. Building on recent advances in supervised phonological reconstruction, during which an algorithm learns how to reconstruct words in a given proto-language relying on previously annotated data, and inspired by improved methods for automated word prediction from cognate sets, we present a new framework that allows for the representation of uncertainty in linguistic reconstruction and also includes a workflow for the computation of fuzzy reconstructions from linguistic data.",
    "path": "papers/23/10/2310.12727.json",
    "total_tokens": 744,
    "translated_title": "在音韵重构中表示和计算不确定性",
    "translated_abstract": "尽管历史语言学中的重构本质上是模糊的，大多数学者在提出原型形式时并不表示不确定性。随着自动化传统比较方法某些方面的最近提出的方法的成功，原型形式的形式化也得到了改善。这种形式化使得可以同时处理表示和计算不确定性。基于监督音韵重构的最新进展，其中算法通过先前注释的数据学习如何重构给定原始语言中的单词，并受到来自同源词集自动预测的改进方法的启发，我们提出了一个新的框架，可以在语言重构中表示不确定性，并包括从语言数据计算模糊重构的工作流程。",
    "tldr": "该论文提出了一个新的框架，用于在语言重构中表示和计算不确定性，通过借鉴监督音韵重构和自动预测方法，实现了模糊重构的工作流程。",
    "en_tdlr": "The paper presents a new framework for representing and computing uncertainty in linguistic reconstruction, using supervised phonological reconstruction and automated prediction methods, enabling a workflow for fuzzy reconstructions."
}