{
    "title": "Coherent Distorted Beliefs. (arXiv:2310.09879v1 [econ.TH])",
    "abstract": "Many models of economics assume that individuals distort objective probabilities. We propose a simple consistency condition on distortion functions, which we term distortion coherence, that ensures that the function commutes with conditioning on an event. We show that distortion coherence restricts belief distortions to have a particular function form: power-weighted distortions, where distorted beliefs are proportional to the original beliefs raised to a power and weighted by a state-specific value. We generalize our findings to allow for distortions of the probabilities assigned to both states and signals, which nests the functional forms widely used in studying probabilistic biases (e.g., Grether, 1980 and Benjamin, 2019). We show how coherent distorted beliefs are tightly related to several extant models of motivated beliefs: they are the outcome of maximizing anticipated expected utility subject to a generalized Kullback-Liebler cost of distortion. Moreover, in the domain of lotte",
    "link": "http://arxiv.org/abs/2310.09879",
    "context": "Title: Coherent Distorted Beliefs. (arXiv:2310.09879v1 [econ.TH])\nAbstract: Many models of economics assume that individuals distort objective probabilities. We propose a simple consistency condition on distortion functions, which we term distortion coherence, that ensures that the function commutes with conditioning on an event. We show that distortion coherence restricts belief distortions to have a particular function form: power-weighted distortions, where distorted beliefs are proportional to the original beliefs raised to a power and weighted by a state-specific value. We generalize our findings to allow for distortions of the probabilities assigned to both states and signals, which nests the functional forms widely used in studying probabilistic biases (e.g., Grether, 1980 and Benjamin, 2019). We show how coherent distorted beliefs are tightly related to several extant models of motivated beliefs: they are the outcome of maximizing anticipated expected utility subject to a generalized Kullback-Liebler cost of distortion. Moreover, in the domain of lotte",
    "path": "papers/23/10/2310.09879.json",
    "total_tokens": 970,
    "translated_title": "一致扭曲信念",
    "translated_abstract": "许多经济模型假设个体会扭曲客观概率。我们提出了一个简单的一致性条件，称为扭曲一致性，它确保函数在对事件进行条件编码时满足交换律。我们表明，扭曲一致性限制了信念扭曲具有特定的函数形式：功率加权扭曲，其中扭曲的信念与原始信念以一定的幂次相关，并由一个特定的状态值加权。我们将我们的发现推广到对状态和信号的概率扭曲，这嵌套了广泛应用于研究概率偏差的功能形式（例如，Grether，1980年和Benjamin，2019年）。我们展示了一致扭曲信念与几个现有的激励信念模型密切相关：它们是在最大化预期期望效用的同时，受到扭曲的广义Kullback-Liebler成本的影响的结果。此外，在彩票领域中，这些扭曲信念与行为经济学中的相关文献相一致。",
    "tldr": "经济模型中，个体扭曲客观概率的假设很常见。本文提出了一个一致性条件，即扭曲一致性，它限制了信念扭曲的函数形式为功率加权扭曲。这些一致的扭曲信念与几个现有的激励信念模型密切相关，是通过最大化预期效用来实现的。",
    "en_tdlr": "Distorting objective probabilities is a common assumption in economic models. This paper introduces a consistency condition, called distortion coherence, which limits belief distortions to a specific function form known as power-weighted distortions. These coherent distorted beliefs are closely related to existing models of motivated beliefs and are achieved by maximizing anticipated utility."
}