{
    "title": "A Deep Instance Generative Framework for MILP Solvers Under Limited Data Availability. (arXiv:2310.02807v1 [cs.LG])",
    "abstract": "In the past few years, there has been an explosive surge in the use of machine learning (ML) techniques to address combinatorial optimization (CO) problems, especially mixed-integer linear programs (MILPs). Despite the achievements, the limited availability of real-world instances often leads to sub-optimal decisions and biased solver assessments, which motivates a suite of synthetic MILP instance generation techniques. However, existing methods either rely heavily on expert-designed formulations or struggle to capture the rich features of real-world instances. To tackle this problem, we propose G2MILP, which to the best of our knowledge is the first deep generative framework for MILP instances. Specifically, G2MILP represents MILP instances as bipartite graphs, and applies a masked variational autoencoder to iteratively corrupt and replace parts of the original graphs to generate new ones. The appealing feature of G2MILP is that it can learn to generate novel and realistic MILP instan",
    "link": "http://arxiv.org/abs/2310.02807",
    "context": "Title: A Deep Instance Generative Framework for MILP Solvers Under Limited Data Availability. (arXiv:2310.02807v1 [cs.LG])\nAbstract: In the past few years, there has been an explosive surge in the use of machine learning (ML) techniques to address combinatorial optimization (CO) problems, especially mixed-integer linear programs (MILPs). Despite the achievements, the limited availability of real-world instances often leads to sub-optimal decisions and biased solver assessments, which motivates a suite of synthetic MILP instance generation techniques. However, existing methods either rely heavily on expert-designed formulations or struggle to capture the rich features of real-world instances. To tackle this problem, we propose G2MILP, which to the best of our knowledge is the first deep generative framework for MILP instances. Specifically, G2MILP represents MILP instances as bipartite graphs, and applies a masked variational autoencoder to iteratively corrupt and replace parts of the original graphs to generate new ones. The appealing feature of G2MILP is that it can learn to generate novel and realistic MILP instan",
    "path": "papers/23/10/2310.02807.json",
    "total_tokens": 884,
    "translated_title": "有限数据条件下用于MILP求解器的深度实例生成框架",
    "translated_abstract": "在过去的几年中，使用机器学习技术解决组合优化问题，特别是混合整数线性规划问题（MILP），出现了爆炸式增长。尽管取得了一些成果，但真实世界实例的有限可用性往往会导致次优决策和有偏见的求解器评估，这就需要一系列合成MILP实例生成技术。然而，现有方法要么过于依赖专家设计的表达式，要么难以捕捉真实世界实例的丰富特征。为了解决这个问题，我们提出了G2MILP，据我们所知这是第一个用于MILP实例的深度生成框架。具体来说，G2MILP将MILP实例表示为二分图，并应用遮蔽变分自编码器来迭代地破坏和替换原始图的部分以生成新的实例。G2MILP的一个吸引人的特点是它可以学会生成新颖而逼真的MILP实例。",
    "tldr": "本文提出了G2MILP，这是第一个用于MILP实例的深度生成框架，它可以生成新颖而逼真的MILP实例。",
    "en_tdlr": "This paper proposes G2MILP, the first deep generative framework for MILP instances, capable of generating novel and realistic instances."
}