{
    "title": "Enabling energy-Efficient object detection with surrogate gradient descent in spiking neural networks. (arXiv:2310.12985v1 [cs.CV])",
    "abstract": "Spiking Neural Networks (SNNs) are a biologically plausible neural network model with significant advantages in both event-driven processing and spatio-temporal information processing, rendering SNNs an appealing choice for energyefficient object detection. However, the non-differentiability of the biological neuronal dynamics model presents a challenge during the training of SNNs. Furthermore, a suitable decoding strategy for object detection in SNNs is currently lacking. In this study, we introduce the Current Mean Decoding (CMD) method, which solves the regression problem to facilitate the training of deep SNNs for object detection tasks. Based on the gradient surrogate and CMD, we propose the SNN-YOLOv3 model for object detection. Our experiments demonstrate that SNN-YOLOv3 achieves a remarkable performance with an mAP of 61.87% on the PASCAL VOC dataset, requiring only 6 time steps. Compared to SpikingYOLO, we have managed to increase mAP by nearly 10% while reducing energy consum",
    "link": "http://arxiv.org/abs/2310.12985",
    "context": "Title: Enabling energy-Efficient object detection with surrogate gradient descent in spiking neural networks. (arXiv:2310.12985v1 [cs.CV])\nAbstract: Spiking Neural Networks (SNNs) are a biologically plausible neural network model with significant advantages in both event-driven processing and spatio-temporal information processing, rendering SNNs an appealing choice for energyefficient object detection. However, the non-differentiability of the biological neuronal dynamics model presents a challenge during the training of SNNs. Furthermore, a suitable decoding strategy for object detection in SNNs is currently lacking. In this study, we introduce the Current Mean Decoding (CMD) method, which solves the regression problem to facilitate the training of deep SNNs for object detection tasks. Based on the gradient surrogate and CMD, we propose the SNN-YOLOv3 model for object detection. Our experiments demonstrate that SNN-YOLOv3 achieves a remarkable performance with an mAP of 61.87% on the PASCAL VOC dataset, requiring only 6 time steps. Compared to SpikingYOLO, we have managed to increase mAP by nearly 10% while reducing energy consum",
    "path": "papers/23/10/2310.12985.json",
    "total_tokens": 952,
    "translated_title": "通过替代梯度下降在脉冲神经网络中实现能源高效的目标检测",
    "translated_abstract": "脉冲神经网络（SNNs）是一种生物可行的神经网络模型，具有事件驱动处理和时空信息处理的显著优势，使得SNNs成为能源高效的目标检测的吸引人选择。然而，生物神经元动力学模型的非可微性在SNNs的训练过程中提出了挑战。此外，目前缺乏适合SNNs中目标检测的解码策略。在本研究中，我们引入了当前均值解码（CMD）方法，解决了回归问题，以促进对象检测任务中深层SNNs的训练。基于梯度替代和CMD，我们提出了SNN-YOLOv3模型用于目标检测。我们的实验表明，SNN-YOLOv3在PASCAL VOC数据集上实现了令人瞩目的性能，mAP达到了61.87%，仅需6个时间步。与SpikingYOLO相比，我们成功将mAP提高了近10%，同时降低了能量消耗。",
    "tldr": "在本研究中，我们提出了一种基于当前均值解码（CMD）方法的SNN-YOLOv3模型，用于实现能源高效的目标检测。实验结果表明，在PASCAL VOC数据集上，SNN-YOLOv3具有令人瞩目的性能，只需6个时间步，mAP达到了61.87%，比SpikingYOLO提高了近10%的mAP，同时能够降低能量消耗。"
}