{
    "title": "RobustEdge: Low Power Adversarial Detection for Cloud-Edge Systems. (arXiv:2310.06845v1 [cs.CR])",
    "abstract": "In practical cloud-edge scenarios, where a resource constrained edge performs data acquisition and a cloud system (having sufficient resources) performs inference tasks with a deep neural network (DNN), adversarial robustness is critical for reliability and ubiquitous deployment. Adversarial detection is a prime adversarial defence technique used in prior literature. However, in prior detection works, the detector is attached to the classifier model and both detector and classifier work in tandem to perform adversarial detection that requires a high computational overhead which is not available at the low-power edge. Therefore, prior works can only perform adversarial detection at the cloud and not at the edge. This means that in case of adversarial attacks, the unfavourable adversarial samples must be communicated to the cloud which leads to energy wastage at the edge device. Therefore, a low-power edge-friendly adversarial detection method is required to improve the energy efficiency",
    "link": "http://arxiv.org/abs/2310.06845",
    "context": "Title: RobustEdge: Low Power Adversarial Detection for Cloud-Edge Systems. (arXiv:2310.06845v1 [cs.CR])\nAbstract: In practical cloud-edge scenarios, where a resource constrained edge performs data acquisition and a cloud system (having sufficient resources) performs inference tasks with a deep neural network (DNN), adversarial robustness is critical for reliability and ubiquitous deployment. Adversarial detection is a prime adversarial defence technique used in prior literature. However, in prior detection works, the detector is attached to the classifier model and both detector and classifier work in tandem to perform adversarial detection that requires a high computational overhead which is not available at the low-power edge. Therefore, prior works can only perform adversarial detection at the cloud and not at the edge. This means that in case of adversarial attacks, the unfavourable adversarial samples must be communicated to the cloud which leads to energy wastage at the edge device. Therefore, a low-power edge-friendly adversarial detection method is required to improve the energy efficiency",
    "path": "papers/23/10/2310.06845.json",
    "total_tokens": 849,
    "translated_title": "RobustEdge：面向云边系统的低功耗对抗检测",
    "translated_abstract": "在实际的云边场景中，边缘设备进行数据采集，拥有足够资源的云系统使用深度神经网络进行推理任务，对抗鲁棒性对于可靠性和普及部署至关重要。对抗检测是先前文献中使用的主要对抗防御技术。然而，在先前的检测方法中，检测器附加在分类器模型上，检测器和分类器一起进行对抗检测，这需要很高的计算开销，在低功耗边缘设备上不可行。因此，先前的方法只能在云端进行对抗检测，而不能在边缘设备上进行。这意味着在遭受对抗攻击时，不利的对抗样本必须传送到云端，导致边缘设备的能量浪费。因此，需要一种低功耗、适用于边缘设备的对抗检测方法来提高能量效率。",
    "tldr": "RobustEdge是一种低功耗、适用于边缘设备的对抗检测方法，解决了在云边系统中能量浪费和计算开销问题。",
    "en_tdlr": "RobustEdge is a low-power adversarial detection method for edge devices, solving the issues of energy wastage and computational overhead in cloud-edge systems."
}