{
    "title": "FLEEK: Factual Error Detection and Correction with Evidence Retrieved from External Knowledge. (arXiv:2310.17119v1 [cs.CL])",
    "abstract": "Detecting factual errors in textual information, whether generated by large language models (LLM) or curated by humans, is crucial for making informed decisions. LLMs' inability to attribute their claims to external knowledge and their tendency to hallucinate makes it difficult to rely on their responses. Humans, too, are prone to factual errors in their writing. Since manual detection and correction of factual errors is labor-intensive, developing an automatic approach can greatly reduce human effort. We present FLEEK, a prototype tool that automatically extracts factual claims from text, gathers evidence from external knowledge sources, evaluates the factuality of each claim, and suggests revisions for identified errors using the collected evidence. Initial empirical evaluation on fact error detection (77-85\\% F1) shows the potential of FLEEK. A video demo of FLEEK can be found at https://youtu.be/NapJFUlkPdQ.",
    "link": "http://arxiv.org/abs/2310.17119",
    "context": "Title: FLEEK: Factual Error Detection and Correction with Evidence Retrieved from External Knowledge. (arXiv:2310.17119v1 [cs.CL])\nAbstract: Detecting factual errors in textual information, whether generated by large language models (LLM) or curated by humans, is crucial for making informed decisions. LLMs' inability to attribute their claims to external knowledge and their tendency to hallucinate makes it difficult to rely on their responses. Humans, too, are prone to factual errors in their writing. Since manual detection and correction of factual errors is labor-intensive, developing an automatic approach can greatly reduce human effort. We present FLEEK, a prototype tool that automatically extracts factual claims from text, gathers evidence from external knowledge sources, evaluates the factuality of each claim, and suggests revisions for identified errors using the collected evidence. Initial empirical evaluation on fact error detection (77-85\\% F1) shows the potential of FLEEK. A video demo of FLEEK can be found at https://youtu.be/NapJFUlkPdQ.",
    "path": "papers/23/10/2310.17119.json",
    "total_tokens": 885,
    "translated_title": "FLEEK: 从外部知识中检测和修正事实错误",
    "translated_abstract": "检测文本信息中的事实错误对于做出明智决策至关重要，无论是由大规模语言模型（LLM）生成的还是由人类策划的。LLMs无法将它们的主张归因于外部知识，且易于产生虚构，这使得依赖它们的回答变得困难。人类在写作过程中也容易出现事实错误。由于手动检测和修正事实错误需要大量的人力投入，因此开发自动化方法可以极大地减少人力工作。我们提出了FLEEK，一个原型工具，它可以自动从文本中提取事实主张，从外部知识源收集证据，评估每个主张的真实性，并使用收集的证据提出修正建议。初步的实证评估显示FLEEK在事实错误检测方面具有潜力（77-85％的F1）。FLEEK的视频演示可在https://youtu.be/NapJFUlkPdQ中找到。",
    "tldr": "本论文提出了FLEEK，一个能自动从文本中提取事实主张并使用外部知识源进行评估和修正的工具，以减少文本中的事实错误。初步实证评估显示FLEEK具有潜力。",
    "en_tdlr": "This paper presents FLEEK, a tool that automatically extracts factual claims from text and evaluates/corrects them using external knowledge sources to reduce factual errors. Initial empirical evaluation shows the potential of FLEEK."
}