{
    "title": "Learning under Label Proportions for Text Classification. (arXiv:2310.11707v1 [cs.LG])",
    "abstract": "We present one of the preliminary NLP works under the challenging setup of Learning from Label Proportions (LLP), where the data is provided in an aggregate form called bags and only the proportion of samples in each class as the ground truth. This setup is inline with the desired characteristics of training models under Privacy settings and Weakly supervision. By characterizing some irregularities of the most widely used baseline technique DLLP, we propose a novel formulation that is also robust. This is accompanied with a learnability result that provides a generalization bound under LLP. Combining this formulation with a self-supervised objective, our method achieves better results as compared to the baselines in almost 87% of the experimental configurations which include large scale models for both long and short range texts across multiple metrics.",
    "link": "http://arxiv.org/abs/2310.11707",
    "context": "Title: Learning under Label Proportions for Text Classification. (arXiv:2310.11707v1 [cs.LG])\nAbstract: We present one of the preliminary NLP works under the challenging setup of Learning from Label Proportions (LLP), where the data is provided in an aggregate form called bags and only the proportion of samples in each class as the ground truth. This setup is inline with the desired characteristics of training models under Privacy settings and Weakly supervision. By characterizing some irregularities of the most widely used baseline technique DLLP, we propose a novel formulation that is also robust. This is accompanied with a learnability result that provides a generalization bound under LLP. Combining this formulation with a self-supervised objective, our method achieves better results as compared to the baselines in almost 87% of the experimental configurations which include large scale models for both long and short range texts across multiple metrics.",
    "path": "papers/23/10/2310.11707.json",
    "total_tokens": 788,
    "translated_title": "学习文本分类的标签比例",
    "translated_abstract": "我们在学习从标签比例(LLP)的具有挑战性的设置下进行了初步的自然语言处理工作，其中数据以袋状聚合形式提供，仅用每个类别中样本的比例作为真值。这个设置与在隐私设置和弱监督下训练模型的期望特性相吻合。通过对最广泛使用的基线技术DLLP的一些不规则进行表征，我们提出了一个新的鲁棒公式。这伴随着一个学习结果，在LLP下提供了一个泛化界限。将这个公式与一个自监督目标相结合，我们的方法在包括长文本和短文本的大规模模型以及多个指标的多个实验配置中与基线方法相比表现更好，达到了近87%的实验配置。",
    "tldr": "这篇论文提出了一种在标签比例(LLP)的挑战性环境中进行文本分类的方法，通过对最广泛使用的基线技术进行改进，结合自监督目标，取得了较好的结果。",
    "en_tdlr": "This paper presents an approach for text classification under the challenging setup of Learning from Label Proportions(LLP), achieving better results by improving the widely used baseline technique and combining it with a self-supervised objective."
}