{
    "title": "SAM-OCTA: Prompting Segment-Anything for OCTA Image Segmentation. (arXiv:2310.07183v1 [cs.LG])",
    "abstract": "In the analysis of optical coherence tomography angiography (OCTA) images, the operation of segmenting specific targets is necessary. Existing methods typically train on supervised datasets with limited samples (approximately a few hundred), which can lead to overfitting. To address this, the low-rank adaptation technique is adopted for foundation model fine-tuning and proposed corresponding prompt point generation strategies to process various segmentation tasks on OCTA datasets. This method is named SAM-OCTA and has been experimented on the publicly available OCTA-500 and ROSE datasets. This method achieves or approaches state-of-the-art segmentation performance metrics. The effect and applicability of prompt points are discussed in detail for the retinal vessel, foveal avascular zone, capillary, artery, and vein segmentation tasks. Furthermore, SAM-OCTA accomplishes local vessel segmentation and effective artery-vein segmentation, which was not well-solved in previous works. The cod",
    "link": "http://arxiv.org/abs/2310.07183",
    "context": "Title: SAM-OCTA: Prompting Segment-Anything for OCTA Image Segmentation. (arXiv:2310.07183v1 [cs.LG])\nAbstract: In the analysis of optical coherence tomography angiography (OCTA) images, the operation of segmenting specific targets is necessary. Existing methods typically train on supervised datasets with limited samples (approximately a few hundred), which can lead to overfitting. To address this, the low-rank adaptation technique is adopted for foundation model fine-tuning and proposed corresponding prompt point generation strategies to process various segmentation tasks on OCTA datasets. This method is named SAM-OCTA and has been experimented on the publicly available OCTA-500 and ROSE datasets. This method achieves or approaches state-of-the-art segmentation performance metrics. The effect and applicability of prompt points are discussed in detail for the retinal vessel, foveal avascular zone, capillary, artery, and vein segmentation tasks. Furthermore, SAM-OCTA accomplishes local vessel segmentation and effective artery-vein segmentation, which was not well-solved in previous works. The cod",
    "path": "papers/23/10/2310.07183.json",
    "total_tokens": 1073,
    "translated_title": "SAM-OCTA: 用于OCTA图像分割的分段辅助策略",
    "translated_abstract": "在光学相干断层扫描血流动力学(OCTA)图像分析中，分割特定目标是必要的操作。现有方法通常在限定样本数（大约数百个）的有标注数据集上进行训练，这可能导致过拟合。为了解决这个问题，本文采用了低秩适应技术进行基础模型微调，并提出相应的提示点生成策略，以处理OCTA数据集上的各种分割任务。这种方法被命名为SAM-OCTA，并在公开可用的OCTA-500和ROSE数据集上进行了实验证明。该方法实现了或接近了最先进的分割性能指标。详细讨论了提示点对视网膜血管、黄斑无血管区、毛细血管、动脉和静脉分割任务的效果和适用性。此外，SAM-OCTA实现了局部血管分割和有效的动脉-静脉分割，这是之前的研究中尚未解决的问题。",
    "tldr": "本文提出了一种名为SAM-OCTA的方法，通过低秩适应技术和提示点生成策略，在OCTA图像分割任务中实现了令人瞩目的性能。这种方法解决了在有限样本训练中可能导致的过拟合问题，并成功处理了视网膜血管、黄斑无血管区、毛细血管、动脉和静脉等各种分割任务，同时还实现了局部血管分割和动脉-静脉分割等以前未解决的问题。"
}