{
    "title": "Defect Analysis of 3D Printed Cylinder Object Using Transfer Learning Approaches. (arXiv:2310.08645v1 [cs.CV])",
    "abstract": "Additive manufacturing (AM) is gaining attention across various industries like healthcare, aerospace, and automotive. However, identifying defects early in the AM process can reduce production costs and improve productivity - a key challenge. This study explored the effectiveness of machine learning (ML) approaches, specifically transfer learning (TL) models, for defect detection in 3D-printed cylinders. Images of cylinders were analyzed using models including VGG16, VGG19, ResNet50, ResNet101, InceptionResNetV2, and MobileNetV2. Performance was compared across two datasets using accuracy, precision, recall, and F1-score metrics. In the first study, VGG16, InceptionResNetV2, and MobileNetV2 achieved perfect scores. In contrast, ResNet50 had the lowest performance, with an average F1-score of 0.32. Similarly, in the second study, MobileNetV2 correctly classified all instances, while ResNet50 struggled with more false positives and fewer true positives, resulting in an F1-score of 0.75.",
    "link": "http://arxiv.org/abs/2310.08645",
    "context": "Title: Defect Analysis of 3D Printed Cylinder Object Using Transfer Learning Approaches. (arXiv:2310.08645v1 [cs.CV])\nAbstract: Additive manufacturing (AM) is gaining attention across various industries like healthcare, aerospace, and automotive. However, identifying defects early in the AM process can reduce production costs and improve productivity - a key challenge. This study explored the effectiveness of machine learning (ML) approaches, specifically transfer learning (TL) models, for defect detection in 3D-printed cylinders. Images of cylinders were analyzed using models including VGG16, VGG19, ResNet50, ResNet101, InceptionResNetV2, and MobileNetV2. Performance was compared across two datasets using accuracy, precision, recall, and F1-score metrics. In the first study, VGG16, InceptionResNetV2, and MobileNetV2 achieved perfect scores. In contrast, ResNet50 had the lowest performance, with an average F1-score of 0.32. Similarly, in the second study, MobileNetV2 correctly classified all instances, while ResNet50 struggled with more false positives and fewer true positives, resulting in an F1-score of 0.75.",
    "path": "papers/23/10/2310.08645.json",
    "total_tokens": 932,
    "translated_title": "使用迁移学习方法对3D打印圆柱物体的缺陷进行分析",
    "translated_abstract": "添加制造（AM）在医疗保健、航空航天和汽车等各个行业引起了关注。然而，早期识别AM过程中的缺陷可以降低生产成本并提高生产效率-这是一个关键挑战。本研究探讨了机器学习（ML）方法，特别是迁移学习（TL）模型在3D打印圆柱体缺陷检测中的有效性。使用包括VGG16、VGG19、ResNet50、ResNet101、InceptionResNetV2和MobileNetV2等模型对圆柱体的图像进行分析。通过准确率、精确率、召回率和F1-score指标比较了两个数据集的性能。在第一项研究中，VGG16、InceptionResNetV2和MobileNetV2达到了完美的得分。相反，ResNet50的性能最差，平均F1-score为0.32。同样地，在第二项研究中，MobileNetV2正确分类了所有实例，而ResNet50则出现了更多的假阳性和较少的真阳性，导致F1-score为0.75。",
    "tldr": "本研究通过使用迁移学习模型分析了3D打印圆柱体中的缺陷，结果发现MobileNetV2在分类性能方面表现最好。"
}