{
    "title": "Convolutional Neural Network Model for Diabetic Retinopathy Feature Extraction and Classification. (arXiv:2310.10806v1 [eess.IV])",
    "abstract": "The application of Artificial Intelligence in the medical market brings up increasing concerns but aids in more timely diagnosis of silent progressing diseases like Diabetic Retinopathy. In order to diagnose Diabetic Retinopathy (DR), ophthalmologists use color fundus images, or pictures of the back of the retina, to identify small distinct features through a difficult and time-consuming process. Our work creates a novel CNN model and identifies the severity of DR through fundus image input. We classified 4 known DR features, including micro-aneurysms, cotton wools, exudates, and hemorrhages, through convolutional layers and were able to provide an accurate diagnostic without additional user input. The proposed model is more interpretable and robust to overfitting. We present initial results with a sensitivity of 97% and an accuracy of 71%. Our contribution is an interpretable model with similar accuracy to more complex models. With that, our model advances the field of DR detection an",
    "link": "http://arxiv.org/abs/2310.10806",
    "context": "Title: Convolutional Neural Network Model for Diabetic Retinopathy Feature Extraction and Classification. (arXiv:2310.10806v1 [eess.IV])\nAbstract: The application of Artificial Intelligence in the medical market brings up increasing concerns but aids in more timely diagnosis of silent progressing diseases like Diabetic Retinopathy. In order to diagnose Diabetic Retinopathy (DR), ophthalmologists use color fundus images, or pictures of the back of the retina, to identify small distinct features through a difficult and time-consuming process. Our work creates a novel CNN model and identifies the severity of DR through fundus image input. We classified 4 known DR features, including micro-aneurysms, cotton wools, exudates, and hemorrhages, through convolutional layers and were able to provide an accurate diagnostic without additional user input. The proposed model is more interpretable and robust to overfitting. We present initial results with a sensitivity of 97% and an accuracy of 71%. Our contribution is an interpretable model with similar accuracy to more complex models. With that, our model advances the field of DR detection an",
    "path": "papers/23/10/2310.10806.json",
    "total_tokens": 1028,
    "translated_title": "用于糖尿病视网膜病变特征提取和分类的卷积神经网络模型",
    "translated_abstract": "在医疗市场上应用人工智能引起了越来越多的关注，但它在像糖尿病视网膜病变这样的悄无声息的疾病的及时诊断方面提供了帮助。为了诊断糖尿病视网膜病变（DR），眼科医生使用视网膜后面的彩色底片照片来通过一个困难而耗时的过程识别小的鲜明特征。我们的工作通过卷积神经网络模型创建了一个新颖的模型，并通过底片图像输入来识别DR的严重程度。我们通过卷积层对4种已知的DR特征进行分类，包括微小动脉瘤、棉丝斑、渗出物和出血，在不需要额外用户输入的情况下能够提供准确的诊断。所提出的模型更易解释和抗过拟合。我们展示了初步结果，敏感性为97%，准确率为71%。我们的贡献是提出了一个可解释性较强且准确率与更复杂模型相当的模型。因此，我们的模型推动了DR检测领域的发展。",
    "tldr": "通过卷积神经网络模型识别糖尿病视网膜病变，提供准确的诊断结果，模型更易解释和抗过拟合，准确率达到71%。推动了糖尿病视网膜病变检测领域的发展。",
    "en_tdlr": "A convolutional neural network model is proposed for the recognition of diabetic retinopathy, providing accurate diagnosis with an interpretation-friendly and overfitting-resistant model, achieving an accuracy of 71%. This work advances the field of diabetic retinopathy detection."
}