{
    "title": "Neural Potential Field for Obstacle-Aware Local Motion Planning. (arXiv:2310.16362v1 [cs.RO])",
    "abstract": "Model predictive control (MPC) may provide local motion planning for mobile robotic platforms. The challenging aspect is the analytic representation of collision cost for the case when both the obstacle map and robot footprint are arbitrary. We propose a Neural Potential Field: a neural network model that returns a differentiable collision cost based on robot pose, obstacle map, and robot footprint. The differentiability of our model allows its usage within the MPC solver. It is computationally hard to solve problems with a very high number of parameters. Therefore, our architecture includes neural image encoders, which transform obstacle maps and robot footprints into embeddings, which reduce problem dimensionality by two orders of magnitude. The reference data for network training are generated based on algorithmic calculation of a signed distance function. Comparative experiments showed that the proposed approach is comparable with existing local planners: it provides trajectories w",
    "link": "http://arxiv.org/abs/2310.16362",
    "context": "Title: Neural Potential Field for Obstacle-Aware Local Motion Planning. (arXiv:2310.16362v1 [cs.RO])\nAbstract: Model predictive control (MPC) may provide local motion planning for mobile robotic platforms. The challenging aspect is the analytic representation of collision cost for the case when both the obstacle map and robot footprint are arbitrary. We propose a Neural Potential Field: a neural network model that returns a differentiable collision cost based on robot pose, obstacle map, and robot footprint. The differentiability of our model allows its usage within the MPC solver. It is computationally hard to solve problems with a very high number of parameters. Therefore, our architecture includes neural image encoders, which transform obstacle maps and robot footprints into embeddings, which reduce problem dimensionality by two orders of magnitude. The reference data for network training are generated based on algorithmic calculation of a signed distance function. Comparative experiments showed that the proposed approach is comparable with existing local planners: it provides trajectories w",
    "path": "papers/23/10/2310.16362.json",
    "total_tokens": 889,
    "translated_title": "基于神经潜力场的考虑障碍物的局部运动规划",
    "translated_abstract": "模型预测控制（MPC）可能为移动机器人平台提供局部运动规划。挑战在于当障碍物地图和机器人足迹都是任意的情况下，对碰撞成本进行分析表示。我们提出了一种神经潜力场：一个神经网络模型，根据机器人姿态、障碍物地图和机器人足迹返回可微分的碰撞成本。我们模型的可微性允许其在MPC求解器中使用。对于具有非常多参数的问题，计算上非常困难。因此，我们的架构包括神经图像编码器，将障碍物地图和机器人足迹转化为嵌入，从而将问题的维度降低两个数量级。网络训练的参考数据是基于算法计算的有符号距离函数。比较实验表明，所提出的方法与现有的局部规划器相当：它提供轨迹...",
    "tldr": "提出了一种基于神经网络的局部运动规划方法，通过神经潜力场模型返回可微分的碰撞成本，利用神经图像编码器将问题维度降低两个数量级，实验结果表明与现有方法相当。"
}