{
    "title": "Utilizing Language Models for Energy Load Forecasting. (arXiv:2310.17788v1 [cs.AI])",
    "abstract": "Energy load forecasting plays a crucial role in optimizing resource allocation and managing energy consumption in buildings and cities. In this paper, we propose a novel approach that leverages language models for energy load forecasting. We employ prompting techniques to convert energy consumption data into descriptive sentences, enabling fine-tuning of language models. By adopting an autoregressive generating approach, our proposed method enables predictions of various horizons of future energy load consumption. Through extensive experiments on real-world datasets, we demonstrate the effectiveness and accuracy of our proposed method. Our results indicate that utilizing language models for energy load forecasting holds promise for enhancing energy efficiency and facilitating intelligent decision-making in energy systems.",
    "link": "http://arxiv.org/abs/2310.17788",
    "context": "Title: Utilizing Language Models for Energy Load Forecasting. (arXiv:2310.17788v1 [cs.AI])\nAbstract: Energy load forecasting plays a crucial role in optimizing resource allocation and managing energy consumption in buildings and cities. In this paper, we propose a novel approach that leverages language models for energy load forecasting. We employ prompting techniques to convert energy consumption data into descriptive sentences, enabling fine-tuning of language models. By adopting an autoregressive generating approach, our proposed method enables predictions of various horizons of future energy load consumption. Through extensive experiments on real-world datasets, we demonstrate the effectiveness and accuracy of our proposed method. Our results indicate that utilizing language models for energy load forecasting holds promise for enhancing energy efficiency and facilitating intelligent decision-making in energy systems.",
    "path": "papers/23/10/2310.17788.json",
    "total_tokens": 811,
    "translated_title": "利用语言模型进行能量负荷预测",
    "translated_abstract": "能量负荷预测在优化资源分配和管理建筑物和城市的能源消耗方面发挥着关键作用。本文提出了一种利用语言模型进行能量负荷预测的新方法。我们采用提示技术将能源消耗数据转化为描述性语句，从而实现语言模型的微调。通过采用自回归生成方法，我们的方法能够预测未来能量负荷消耗的各种时间范围。通过对真实数据集进行广泛实验，我们证明了我们的方法的有效性和准确性。我们的结果表明，利用语言模型进行能量负荷预测有望增强能源效率并促进能源系统智能决策的实施。",
    "tldr": "本文提出了一种利用语言模型进行能量负荷预测的新方法，通过采用提示技术和自回归生成方法，可以将能源消耗数据转化为描述性语句并实现预测未来能量负荷消耗的准确性，从而为提高能源效率和促进能源系统智能决策提供了有希望的途径。"
}