{
    "title": "Brain Age Revisited: Investigating the State vs. Trait Hypotheses of EEG-derived Brain-Age Dynamics with Deep Learning. (arXiv:2310.07029v1 [q-bio.NC])",
    "abstract": "The brain's biological age has been considered as a promising candidate for a neurologically significant biomarker. However, recent results based on longitudinal magnetic resonance imaging data have raised questions on its interpretation. A central question is whether an increased biological age of the brain is indicative of brain pathology and if changes in brain age correlate with diagnosed pathology (state hypothesis). Alternatively, could the discrepancy in brain age be a stable characteristic unique to each individual (trait hypothesis)? To address this question, we present a comprehensive study on brain aging based on clinical EEG, which is complementary to previous MRI-based investigations. We apply a state-of-the-art Temporal Convolutional Network (TCN) to the task of age regression. We train on recordings of the Temple University Hospital EEG Corpus (TUEG) explicitly labeled as non-pathological and evaluate on recordings of subjects with non-pathological as well as pathologica",
    "link": "http://arxiv.org/abs/2310.07029",
    "context": "Title: Brain Age Revisited: Investigating the State vs. Trait Hypotheses of EEG-derived Brain-Age Dynamics with Deep Learning. (arXiv:2310.07029v1 [q-bio.NC])\nAbstract: The brain's biological age has been considered as a promising candidate for a neurologically significant biomarker. However, recent results based on longitudinal magnetic resonance imaging data have raised questions on its interpretation. A central question is whether an increased biological age of the brain is indicative of brain pathology and if changes in brain age correlate with diagnosed pathology (state hypothesis). Alternatively, could the discrepancy in brain age be a stable characteristic unique to each individual (trait hypothesis)? To address this question, we present a comprehensive study on brain aging based on clinical EEG, which is complementary to previous MRI-based investigations. We apply a state-of-the-art Temporal Convolutional Network (TCN) to the task of age regression. We train on recordings of the Temple University Hospital EEG Corpus (TUEG) explicitly labeled as non-pathological and evaluate on recordings of subjects with non-pathological as well as pathologica",
    "path": "papers/23/10/2310.07029.json",
    "total_tokens": 965,
    "translated_title": "大脑年龄再访：用深度学习研究基于脑电图的大脑年龄动态的状态假说与特质假说",
    "translated_abstract": "大脑的生物年龄被认为是一个有潜力的神经学显著生物标记物。然而，基于纵向磁共振成像数据的最新结果引发了对其解释的质疑。一个核心问题是大脑的生物年龄是否指示了脑病变，并且大脑年龄的变化是否与诊断出的病理相关（状态假说）。或者，大脑年龄的差异是否是每个个体独特的稳定特征（特质假说）？为了回答这个问题，我们对基于临床脑电图的大脑衰老进行了全面的研究，这是对之前基于核磁共振成像的调查的补充。我们采用了最先进的时序卷积网络（TCN）进行年龄回归任务。我们用被明确标记为非病理的Temple大学医院脑电图语料库（TUEG）记录进行训练，并在非病理和病理主题的记录上进行评估。",
    "tldr": "这项研究使用深度学习方法，通过对临床脑电图的研究来探讨大脑的生物年龄动态。研究结果对于理解大脑的状态和特质假说以及脑病变具有重要意义。",
    "en_tdlr": "This study investigates the dynamics of brain age using deep learning on clinical EEG data, providing insights into the state and trait hypotheses of the brain, as well as its relationship with brain pathology."
}