{
    "title": "Chatmap : Large Language Model Interaction with Cartographic Data. (arXiv:2310.01429v1 [cs.CL])",
    "abstract": "The swift advancement and widespread availability of foundational Large Language Models (LLMs), complemented by robust fine-tuning methodologies, have catalyzed their adaptation for innovative and industrious applications. Enabling LLMs to recognize and interpret geospatial data, while offering a linguistic access to vast cartographic datasets, is of significant importance. OpenStreetMap (OSM) is the most ambitious open-source global initiative offering detailed urban and rural geographic data, curated by a community of over 10 million contributors, which constitutes a great potential for LLM applications. In this study, we demonstrate the proof of concept and details of the process of fine-tuning a relatively small scale (1B parameters) LLM with a relatively small artificial dataset curated by a more capable teacher model, in order to provide a linguistic interface to the OSM data of an arbitrary urban region. Through this interface, users can inquire about a location's attributes, co",
    "link": "http://arxiv.org/abs/2310.01429",
    "context": "Title: Chatmap : Large Language Model Interaction with Cartographic Data. (arXiv:2310.01429v1 [cs.CL])\nAbstract: The swift advancement and widespread availability of foundational Large Language Models (LLMs), complemented by robust fine-tuning methodologies, have catalyzed their adaptation for innovative and industrious applications. Enabling LLMs to recognize and interpret geospatial data, while offering a linguistic access to vast cartographic datasets, is of significant importance. OpenStreetMap (OSM) is the most ambitious open-source global initiative offering detailed urban and rural geographic data, curated by a community of over 10 million contributors, which constitutes a great potential for LLM applications. In this study, we demonstrate the proof of concept and details of the process of fine-tuning a relatively small scale (1B parameters) LLM with a relatively small artificial dataset curated by a more capable teacher model, in order to provide a linguistic interface to the OSM data of an arbitrary urban region. Through this interface, users can inquire about a location's attributes, co",
    "path": "papers/23/10/2310.01429.json",
    "total_tokens": 869,
    "translated_title": "Chatmap：大型语言模型与地图数据的交互",
    "translated_abstract": "大型语言模型（LLMs）的快速发展和广泛可用性，结合强大的微调方法，催生了创新和务实应用的需求。使LLMs能够识别和解释地理空间数据，并提供对庞大的地图数据集的语言访问能力非常重要。OpenStreetMap（OSM）是最雄心勃勃的开源全球倡议，提供详细的城市和农村地理数据，由超过1000万的贡献者社区策划，为LLM应用提供了巨大潜力。在本研究中，我们演示了使用相对较小规模（10亿参数）的LLM通过较强大的教师模型策划的相对较小的人工数据集进行微调的概念验证和详细过程，以提供对任意城市区域的OSM数据的语言界面。通过该界面，用户可以查询位置的属性、协同性和趋势。",
    "tldr": "本研究通过微调相对较小规模的大型语言模型（LLM），以提供对OpenStreetMap（OSM）数据的语言接口。用户可以通过该界面查询有关特定地理位置的属性和趋势。"
}