{
    "title": "Beyond Yes and No: Improving Zero-Shot LLM Rankers via Scoring Fine-Grained Relevance Labels",
    "abstract": "arXiv:2310.14122v3 Announce Type: replace  Abstract: Zero-shot text rankers powered by recent LLMs achieve remarkable ranking performance by simply prompting. Existing prompts for pointwise LLM rankers mostly ask the model to choose from binary relevance labels like \"Yes\" and \"No\". However, the lack of intermediate relevance label options may cause the LLM to provide noisy or biased answers for documents that are partially relevant to the query. We propose to incorporate fine-grained relevance labels into the prompt for LLM rankers, enabling them to better differentiate among documents with different levels of relevance to the query and thus derive a more accurate ranking. We study two variants of the prompt template, coupled with different numbers of relevance levels. Our experiments on 8 BEIR data sets show that adding fine-grained relevance labels significantly improves the performance of LLM rankers.",
    "link": "https://arxiv.org/abs/2310.14122",
    "context": "Title: Beyond Yes and No: Improving Zero-Shot LLM Rankers via Scoring Fine-Grained Relevance Labels\nAbstract: arXiv:2310.14122v3 Announce Type: replace  Abstract: Zero-shot text rankers powered by recent LLMs achieve remarkable ranking performance by simply prompting. Existing prompts for pointwise LLM rankers mostly ask the model to choose from binary relevance labels like \"Yes\" and \"No\". However, the lack of intermediate relevance label options may cause the LLM to provide noisy or biased answers for documents that are partially relevant to the query. We propose to incorporate fine-grained relevance labels into the prompt for LLM rankers, enabling them to better differentiate among documents with different levels of relevance to the query and thus derive a more accurate ranking. We study two variants of the prompt template, coupled with different numbers of relevance levels. Our experiments on 8 BEIR data sets show that adding fine-grained relevance labels significantly improves the performance of LLM rankers.",
    "path": "papers/23/10/2310.14122.json",
    "total_tokens": 785,
    "translated_title": "超越是与否：通过得分细粒度相关性标签来改进零样本LLM排序器",
    "translated_abstract": "最近LLM技术驱动的零样本文本排序器通过简单的提示获得了显著的排序性能。 现有的逐点LLM排序器提示大多要求模型从“是”和“否”等二元相关性标签中进行选择。然而，缺少中间相关性标签选项可能会导致LLM在部分相关于查询的文档上提供嘈杂或有偏见的答案。我们提出将细粒度相关性标签纳入LLM排序器的提示中，使其能够更好地区分具有不同相关性水平的文档，从而得出更准确的排序。我们研究了两种变体的提示模板，配合不同数量的相关性级别。我们在8个BEIR数据集上的实验表明，添加细粒度相关性标签显著提高了LLM排序器的性能。",
    "tldr": "通过将细粒度相关性标签纳入LLM排序器提示中，可以显著改进零样本LLM排序器的性能"
}