{
    "title": "A Gale-Shapley View of Unique Stable Marriages. (arXiv:2310.18736v1 [cs.GT])",
    "abstract": "Stable marriage of a two-sided market with unit demand is a classic problem that arises in many real-world scenarios. In addition, a unique stable marriage in this market simplifies a host of downstream desiderata. In this paper, we explore a new set of sufficient conditions for unique stable matching (USM) under this setup. Unlike other approaches that also address this question using the structure of preference profiles, we use an algorithmic viewpoint and investigate if this question can be answered using the lens of the deferred acceptance (DA) algorithm (Gale and Shapley, 1962). Our results yield a set of sufficient conditions for USM (viz., MaxProp and MaxRou) and show that these are disjoint from the previously known sufficiency conditions like sequential preference and no crossing. We also provide a characterization of MaxProp that makes it efficiently verifiable, and shows the gap between MaxProp and the entire USM class. These results give a more detailed view of the sub-stru",
    "link": "http://arxiv.org/abs/2310.18736",
    "context": "Title: A Gale-Shapley View of Unique Stable Marriages. (arXiv:2310.18736v1 [cs.GT])\nAbstract: Stable marriage of a two-sided market with unit demand is a classic problem that arises in many real-world scenarios. In addition, a unique stable marriage in this market simplifies a host of downstream desiderata. In this paper, we explore a new set of sufficient conditions for unique stable matching (USM) under this setup. Unlike other approaches that also address this question using the structure of preference profiles, we use an algorithmic viewpoint and investigate if this question can be answered using the lens of the deferred acceptance (DA) algorithm (Gale and Shapley, 1962). Our results yield a set of sufficient conditions for USM (viz., MaxProp and MaxRou) and show that these are disjoint from the previously known sufficiency conditions like sequential preference and no crossing. We also provide a characterization of MaxProp that makes it efficiently verifiable, and shows the gap between MaxProp and the entire USM class. These results give a more detailed view of the sub-stru",
    "path": "papers/23/10/2310.18736.json",
    "total_tokens": 966,
    "translated_title": "独特稳定婚姻的Gale-Shapley观点",
    "translated_abstract": "二边市场的稳定婚姻问题是一个经典问题，在许多实际场景中都会出现。此外，在这个市场上的独特稳定婚姻可以简化一系列下游需求。在本文中，我们探讨了在这个设置下关于独特稳定匹配的一组充分条件。与其他也使用偏好配置的结构来回答这个问题的方法不同，我们使用算法的视角，并研究是否可以用Gale和Shapley算法的观点来回答这个问题。我们的结果给出了一组充分条件，包括MaxProp和MaxRou，并证明了这些条件与以前已知的条件如顺序偏好和无交叉是不相交的。我们还提供了一个使MaxProp可以高效验证的特征，并展示了MaxProp与整个独特稳定婚姻类之间的差距。这些结果提供了对子结构的更详细视角。",
    "tldr": "本文探讨了一种新的关于独特稳定婚姻的充分条件，使用了Gale-Shapley算法的观点。结果给出了MaxProp和MaxRou等条件，并与以前的顺序偏好和无交叉条件不相交。此外，我们还提供了使MaxProp可有效验证的特征，并展示了与整个独特稳定婚姻类的差距。",
    "en_tdlr": "This paper explores a new set of sufficient conditions for unique stable matching using the Gale-Shapley algorithm. The results provide conditions such as MaxProp and MaxRou, which are disjoint from previous conditions like sequential preference and no crossing. Additionally, the paper presents a characterization of MaxProp that is efficiently verifiable and demonstrates the gap between MaxProp and the entire class of unique stable marriages."
}