{
    "title": "Efficient and Interpretable Bandit Algorithms",
    "abstract": "Motivated by the importance of explainability in modern machine learning, we design bandit algorithms that are efficient and interpretable. A bandit algorithm is interpretable if it explores with the objective of reducing uncertainty in the unknown model parameter. To quantify the interpretability, we introduce a novel metric of model error, which compares the rate reduction of the mean reward estimates to their actual means among all the plausible actions. We propose CODE, a bandit algorithm based on a Constrained Optimal DEsign, that is interpretable and maximally reduces the uncertainty. The key idea in CODE is to explore among all plausible actions, determined by a statistical constraint, to achieve interpretability. We implement CODE efficiently in both multi-armed and linear bandits and derive near-optimal regret bounds by leveraging the optimality criteria of the approximate optimal design. CODE can be also viewed as removing phases in conventional phased elimination, which make",
    "link": "https://arxiv.org/abs/2310.14751",
    "context": "Title: Efficient and Interpretable Bandit Algorithms\nAbstract: Motivated by the importance of explainability in modern machine learning, we design bandit algorithms that are efficient and interpretable. A bandit algorithm is interpretable if it explores with the objective of reducing uncertainty in the unknown model parameter. To quantify the interpretability, we introduce a novel metric of model error, which compares the rate reduction of the mean reward estimates to their actual means among all the plausible actions. We propose CODE, a bandit algorithm based on a Constrained Optimal DEsign, that is interpretable and maximally reduces the uncertainty. The key idea in CODE is to explore among all plausible actions, determined by a statistical constraint, to achieve interpretability. We implement CODE efficiently in both multi-armed and linear bandits and derive near-optimal regret bounds by leveraging the optimality criteria of the approximate optimal design. CODE can be also viewed as removing phases in conventional phased elimination, which make",
    "path": "papers/23/10/2310.14751.json",
    "total_tokens": 890,
    "translated_title": "高效且可解释的赌博算法",
    "translated_abstract": "考虑到现代机器学习中解释性的重要性，我们设计了高效且可解释的赌博算法。如果一个赌博算法探索的目标是减小未知模型参数的不确定性，那么它就具有可解释性。为了衡量可解释性，我们引入了一种新的模型误差度量，对比了所有可能操作的平均奖励估计的减少率与它们的实际均值之间的差异。我们提出了一种基于约束最优设计的赌博算法CODE，它具有可解释性，并最大程度地减小了不确定性。CODE的关键思想是在符合统计约束条件的所有可能操作中进行探索，以实现可解释性。我们在多臂赌博机和线性赌博机中高效地实现了CODE，并通过利用近似最优设计的最优性准则推导出了接近最优的后悔界限。CODE还可以看作是去除传统的相位消除中的阶段，这使得算法更加高效。",
    "tldr": "这个论文设计了一种高效且可解释的赌博算法，其中关注了模型参数的解释性和减小不确定性的目标。提出的CODE算法通过在符合约束条件的所有可能操作中进行探索，实现了最大程度的解释性和不确定性的减小。",
    "en_tdlr": "This paper presents an efficient and interpretable bandit algorithm that focuses on the interpretability of model parameters and the minimization of uncertainty. The proposed CODE algorithm explores among all plausible actions within statistical constraints, achieving maximum interpretability and uncertainty reduction."
}