{
    "title": "Active-Perceptive Motion Generation for Mobile Manipulation",
    "abstract": "arXiv:2310.00433v2 Announce Type: replace-cross  Abstract: Mobile Manipulation (MoMa) systems incorporate the benefits of mobility and dexterity, due to the enlarged space in which they can move and interact with their environment. However, even when equipped with onboard sensors, e.g., an embodied camera, extracting task-relevant visual information in unstructured and cluttered environments, such as households, remains challenging. In this work, we introduce an active perception pipeline for mobile manipulators to generate motions that are informative toward manipulation tasks, such as grasping in unknown, cluttered scenes. Our proposed approach, ActPerMoMa, generates robot paths in a receding horizon fashion by sampling paths and computing path-wise utilities. These utilities trade-off maximizing the visual Information Gain (IG) for scene reconstruction and the task-oriented objective, e.g., grasp success, by maximizing grasp reachability. We show the efficacy of our method in simula",
    "link": "https://arxiv.org/abs/2310.00433",
    "context": "Title: Active-Perceptive Motion Generation for Mobile Manipulation\nAbstract: arXiv:2310.00433v2 Announce Type: replace-cross  Abstract: Mobile Manipulation (MoMa) systems incorporate the benefits of mobility and dexterity, due to the enlarged space in which they can move and interact with their environment. However, even when equipped with onboard sensors, e.g., an embodied camera, extracting task-relevant visual information in unstructured and cluttered environments, such as households, remains challenging. In this work, we introduce an active perception pipeline for mobile manipulators to generate motions that are informative toward manipulation tasks, such as grasping in unknown, cluttered scenes. Our proposed approach, ActPerMoMa, generates robot paths in a receding horizon fashion by sampling paths and computing path-wise utilities. These utilities trade-off maximizing the visual Information Gain (IG) for scene reconstruction and the task-oriented objective, e.g., grasp success, by maximizing grasp reachability. We show the efficacy of our method in simula",
    "path": "papers/23/10/2310.00433.json",
    "total_tokens": 846,
    "translated_title": "移动操纵的主动感知运动生成",
    "translated_abstract": "移动操纵系统结合了机动性和灵巧性的优点，由于它们可以在更大的空间中移动并与环境进行交互。然而，即使配备了机载传感器，例如具有实体相机的移动操纵系统，在无结构和杂乱的环境中提取任务相关的视觉信息，例如家庭环境，仍然具有挑战性。在这项工作中，我们介绍了一个主动感知流水线，用于移动操纵器生成对操纵任务有信息性的运动，例如在未知的杂乱场景中抓取。我们提出的方法 ActPerMoMa 通过对路径进行采样和计算路径相关的效用，在滑动地平线的方式下生成机器人路径。这些效用权衡了最大化视觉信息增益（IG）用于场景重建和面向任务的目的，例如最大化抓取可达性的任务成功率。我们展示了我们的方法在模拟中的有效性。",
    "tldr": "介绍了一种用于移动操纵器的主动感知流水线，可以生成对操纵任务有信息性的运动，通过最大化视觉信息增益和任务目标的权衡来提高抓取成功率。",
    "en_tdlr": "Introduces an active perception pipeline for mobile manipulators to generate informative motions for manipulation tasks by balancing the maximization of visual information gain and task-oriented objectives to improve grasp success rate."
}