{
    "title": "DIG-MILP: a Deep Instance Generator for Mixed-Integer Linear Programming with Feasibility Guarantee. (arXiv:2310.13261v1 [cs.LG])",
    "abstract": "Mixed-integer linear programming (MILP) stands as a notable NP-hard problem pivotal to numerous crucial industrial applications. The development of effective algorithms, the tuning of solvers, and the training of machine learning models for MILP resolution all hinge on access to extensive, diverse, and representative data. Yet compared to the abundant naturally occurring data in image and text realms, MILP is markedly data deficient, underscoring the vital role of synthetic MILP generation. We present DIG-MILP, a deep generative framework based on variational auto-encoder (VAE), adept at extracting deep-level structural features from highly limited MILP data and producing instances that closely mirror the target data. Notably, by leveraging the MILP duality, DIG-MILP guarantees a correct and complete generation space as well as ensures the boundedness and feasibility of the generated instances. Our empirical study highlights the novelty and quality of the instances generated by DIG-MIL",
    "link": "http://arxiv.org/abs/2310.13261",
    "context": "Title: DIG-MILP: a Deep Instance Generator for Mixed-Integer Linear Programming with Feasibility Guarantee. (arXiv:2310.13261v1 [cs.LG])\nAbstract: Mixed-integer linear programming (MILP) stands as a notable NP-hard problem pivotal to numerous crucial industrial applications. The development of effective algorithms, the tuning of solvers, and the training of machine learning models for MILP resolution all hinge on access to extensive, diverse, and representative data. Yet compared to the abundant naturally occurring data in image and text realms, MILP is markedly data deficient, underscoring the vital role of synthetic MILP generation. We present DIG-MILP, a deep generative framework based on variational auto-encoder (VAE), adept at extracting deep-level structural features from highly limited MILP data and producing instances that closely mirror the target data. Notably, by leveraging the MILP duality, DIG-MILP guarantees a correct and complete generation space as well as ensures the boundedness and feasibility of the generated instances. Our empirical study highlights the novelty and quality of the instances generated by DIG-MIL",
    "path": "papers/23/10/2310.13261.json",
    "total_tokens": 961,
    "translated_title": "DIG-MILP: 一种具有可行性保证的混合整数线性规划的深度样例生成器",
    "translated_abstract": "混合整数线性规划（MILP）是许多关键工业应用中一个重要的NP难问题。有效算法的开发，求解器的调优以及用于MILP解析的机器学习模型的训练都依赖于大量、多样和代表性的数据。然而，与图像和文本领域丰富的自然数据相比，MILP的数据缺乏，凸显了合成MILP生成的重要作用。我们提出了DIG-MILP，这是一个基于变分自编码器（VAE）的深度生成框架，能够从非常有限的MILP数据中提取深层结构特征，并生成与目标数据非常接近的样例。值得注意的是，通过利用MILP的对偶性，DIG-MILP保证了正确和完整的生成空间，并确保了生成实例的有界性和可行性。我们的实证研究突出了DIG-MILP生成的样例的新颖性和质量。",
    "tldr": "DIG-MILP是一个深度生成框架，利用变分自编码器从非常有限的MILP数据中提取深层结构特征，并生成与目标数据非常接近的样例。它通过利用MILP的对偶性来确保生成空间的正确性、完整性以及生成实例的有界性和可行性。"
}