{
    "title": "Can neural networks count digit frequency?. (arXiv:2310.04431v1 [cs.LG])",
    "abstract": "In this research, we aim to compare the performance of different classical machine learning models and neural networks in identifying the frequency of occurrence of each digit in a given number. It has various applications in machine learning and computer vision, e.g. for obtaining the frequency of a target object in a visual scene. We considered this problem as a hybrid of classification and regression tasks. We carefully create our own datasets to observe systematic differences between different methods. We evaluate each of the methods using different metrics across multiple datasets.The metrics of performance used were the root mean squared error and mean absolute error for regression evaluation, and accuracy for classification performance evaluation. We observe that decision trees and random forests overfit to the dataset, due to their inherent bias, and are not able to generalize well. We also observe that the neural networks significantly outperform the classical machine learning",
    "link": "http://arxiv.org/abs/2310.04431",
    "context": "Title: Can neural networks count digit frequency?. (arXiv:2310.04431v1 [cs.LG])\nAbstract: In this research, we aim to compare the performance of different classical machine learning models and neural networks in identifying the frequency of occurrence of each digit in a given number. It has various applications in machine learning and computer vision, e.g. for obtaining the frequency of a target object in a visual scene. We considered this problem as a hybrid of classification and regression tasks. We carefully create our own datasets to observe systematic differences between different methods. We evaluate each of the methods using different metrics across multiple datasets.The metrics of performance used were the root mean squared error and mean absolute error for regression evaluation, and accuracy for classification performance evaluation. We observe that decision trees and random forests overfit to the dataset, due to their inherent bias, and are not able to generalize well. We also observe that the neural networks significantly outperform the classical machine learning",
    "path": "papers/23/10/2310.04431.json",
    "total_tokens": 823,
    "translated_title": "神经网络能否计算数字频率？",
    "translated_abstract": "在这项研究中，我们旨在比较不同的传统机器学习模型和神经网络在识别给定数字中每个数字出现频率方面的性能。它在机器学习和计算机视觉中有多种应用，例如在视觉场景中获取目标对象的频率。我们将这个问题视为分类和回归任务的混合。我们精心创建了自己的数据集，以观察不同方法之间的系统差异。我们使用不同的指标评估每种方法在多个数据集上的表现。所使用的性能指标包括回归评估中的均方根误差和平均绝对误差，以及分类性能评估中的准确率。我们观察到决策树和随机森林会过拟合到数据集，由于它们的固有偏差，无法很好地泛化。我们还观察到神经网络明显优于传统机器学习方法。",
    "tldr": "本研究旨在比较不同机器学习模型和神经网络在识别数字频率方面的性能。结果表明，神经网络明显优于传统机器学习方法。",
    "en_tdlr": "This research aims to compare the performance of different machine learning models and neural networks in identifying digit frequency. The results show that neural networks outperform traditional machine learning methods."
}