{
    "title": "Online Learning and Planning in Cognitive Hierarchies. (arXiv:2310.12386v1 [cs.AI])",
    "abstract": "Complex robot behaviour typically requires the integration of multiple robotic and Artificial Intelligence (AI) techniques and components. Integrating such disparate components into a coherent system, while also ensuring global properties and behaviours, is a significant challenge for cognitive robotics. Using a formal framework to model the interactions between components can be an important step in dealing with this challenge. In this paper we extend an existing formal framework [Clark et al., 2016] to model complex integrated reasoning behaviours of robotic systems; from symbolic planning through to online learning of policies and transition systems. Furthermore the new framework allows for a more flexible modelling of the interactions between different reasoning components.",
    "link": "http://arxiv.org/abs/2310.12386",
    "context": "Title: Online Learning and Planning in Cognitive Hierarchies. (arXiv:2310.12386v1 [cs.AI])\nAbstract: Complex robot behaviour typically requires the integration of multiple robotic and Artificial Intelligence (AI) techniques and components. Integrating such disparate components into a coherent system, while also ensuring global properties and behaviours, is a significant challenge for cognitive robotics. Using a formal framework to model the interactions between components can be an important step in dealing with this challenge. In this paper we extend an existing formal framework [Clark et al., 2016] to model complex integrated reasoning behaviours of robotic systems; from symbolic planning through to online learning of policies and transition systems. Furthermore the new framework allows for a more flexible modelling of the interactions between different reasoning components.",
    "path": "papers/23/10/2310.12386.json",
    "total_tokens": 744,
    "translated_title": "在认知层次中的在线学习与规划",
    "translated_abstract": "复杂的机器人行为通常需要整合多种机器人和人工智能技术和组件。在保证全局性质和行为的同时，将这些不同的组件整合成一个连贯的系统是认知机器人学面临的重大挑战。使用形式化框架来建模组件之间的交互可以是应对这一挑战的重要步骤。在本文中，我们扩展了一个已有的形式化框架[Clark et al., 2016]，以模拟机器人系统的复杂集成推理行为；从符号规划到在线学习策略和转换系统。此外，新的框架允许更灵活地建模不同推理组件之间的交互。",
    "tldr": "本研究扩展了一个形式化框架，用于模拟机器人系统的复杂集成推理行为，并实现了在线学习与规划。新的框架还允许更灵活地建模不同推理组件之间的交互。",
    "en_tdlr": "This paper extends a formal framework to model complex integrated reasoning behaviors of robotic systems and achieves online learning and planning. The new framework also allows for more flexible modeling of the interactions between different reasoning components."
}