{
    "title": "Anomalous diffusion and price impact in the fluid-limit of an order book. (arXiv:2310.06079v1 [q-fin.CP])",
    "abstract": "We extend a Discrete Time Random Walk (DTRW) numerical scheme to simulate the anomalous diffusion of financial market orders in a simulated order book. Here using random walks with Sibuya waiting times to include a time-dependent stochastic forcing function with non-uniformly sampled times between order book events in the setting of fractional diffusion. This models the fluid limit of an order book by modelling the continuous arrival, cancellation and diffusion of orders in the presence of information shocks. We study the impulse response and stylised facts of orders undergoing anomalous diffusion for different forcing functions and model parameters. Concretely, we demonstrate the price impact for flash limit-orders and market orders and show how the numerical method generate kinks in the price impact. We use cubic spline interpolation to generate smoothed price impact curves. The work promotes the use of non-uniform sampling in the presence of diffusive dynamics as the preferred simul",
    "link": "http://arxiv.org/abs/2310.06079",
    "context": "Title: Anomalous diffusion and price impact in the fluid-limit of an order book. (arXiv:2310.06079v1 [q-fin.CP])\nAbstract: We extend a Discrete Time Random Walk (DTRW) numerical scheme to simulate the anomalous diffusion of financial market orders in a simulated order book. Here using random walks with Sibuya waiting times to include a time-dependent stochastic forcing function with non-uniformly sampled times between order book events in the setting of fractional diffusion. This models the fluid limit of an order book by modelling the continuous arrival, cancellation and diffusion of orders in the presence of information shocks. We study the impulse response and stylised facts of orders undergoing anomalous diffusion for different forcing functions and model parameters. Concretely, we demonstrate the price impact for flash limit-orders and market orders and show how the numerical method generate kinks in the price impact. We use cubic spline interpolation to generate smoothed price impact curves. The work promotes the use of non-uniform sampling in the presence of diffusive dynamics as the preferred simul",
    "path": "papers/23/10/2310.06079.json",
    "total_tokens": 1041,
    "translated_title": "订单簿流限根据非均匀采样和非线性扩散条件下的异常扩散和价格影响",
    "translated_abstract": "我们扩展了一个离散时间随机游走（DTRW）的数值模拟方法，用于模拟模拟订单簿中金融市场订单的异常扩散。在这里，我们使用Sibuya等待时间的随机游走来包括一个时间相关的随机强迫函数，该函数具有非均匀采样的订单簿事件之间的时间。这个模型模拟了订单簿的流限，模拟了订单的连续到达、取消和扩散，以及信息冲击的影响。我们研究了不同强迫函数和模型参数下经历异常扩散的订单的冲击响应和风格特点。具体地说，我们展示了闪电限价单和市价单的价格影响，并展示了数值方法如何生成价格影响中的波纹。我们使用三次样条插值生成平滑的价格影响曲线。这项工作推广了在扩散动力学存在的情况下使用非均匀采样作为首选的模拟方法。",
    "tldr": "本文扩展了一个数值模拟方法，用于研究订单簿中金融市场订单的异常扩散和价格影响。我们通过模拟连续到达、取消和扩散的订单以及信息冲击，研究了不同情况下的冲击响应和风格特点。结果表明，数值方法能生成波纹效应，并提出了在扩散动力学存在的情况下使用非均匀采样作为首选的模拟方法。",
    "en_tdlr": "This paper extends a numerical simulation method to study the anomalous diffusion and price impact of financial market orders in an order book. By simulating the continuous arrival, cancellation, and diffusion of orders as well as information shocks, the study investigates the impulse response and stylized facts of orders under different conditions. The results demonstrate the generation of kinks in the price impact and propose the use of non-uniform sampling as the preferred method in the presence of diffusive dynamics."
}