{
    "title": "NoMaD: Goal Masked Diffusion Policies for Navigation and Exploration. (arXiv:2310.07896v1 [cs.RO])",
    "abstract": "Robotic learning for navigation in unfamiliar environments needs to provide policies for both task-oriented navigation (i.e., reaching a goal that the robot has located), and task-agnostic exploration (i.e., searching for a goal in a novel setting). Typically, these roles are handled by separate models, for example by using subgoal proposals, planning, or separate navigation strategies. In this paper, we describe how we can train a single unified diffusion policy to handle both goal-directed navigation and goal-agnostic exploration, with the latter providing the ability to search novel environments, and the former providing the ability to reach a user-specified goal once it has been located. We show that this unified policy results in better overall performance when navigating to visually indicated goals in novel environments, as compared to approaches that use subgoal proposals from generative models, or prior methods based on latent variable models. We instantiate our method by using",
    "link": "http://arxiv.org/abs/2310.07896",
    "context": "Title: NoMaD: Goal Masked Diffusion Policies for Navigation and Exploration. (arXiv:2310.07896v1 [cs.RO])\nAbstract: Robotic learning for navigation in unfamiliar environments needs to provide policies for both task-oriented navigation (i.e., reaching a goal that the robot has located), and task-agnostic exploration (i.e., searching for a goal in a novel setting). Typically, these roles are handled by separate models, for example by using subgoal proposals, planning, or separate navigation strategies. In this paper, we describe how we can train a single unified diffusion policy to handle both goal-directed navigation and goal-agnostic exploration, with the latter providing the ability to search novel environments, and the former providing the ability to reach a user-specified goal once it has been located. We show that this unified policy results in better overall performance when navigating to visually indicated goals in novel environments, as compared to approaches that use subgoal proposals from generative models, or prior methods based on latent variable models. We instantiate our method by using",
    "path": "papers/23/10/2310.07896.json",
    "total_tokens": 893,
    "translated_title": "NoMaD: 目标遮蔽扩散策略用于导航与探索",
    "translated_abstract": "在不熟悉的环境中，机器人学习导航需要提供任务导向的导航策略（即到达机器人定位的目标）和任务不可知的探索策略（即在新的环境中搜索目标）。通常情况下，这些角色由不同的模型处理，例如使用子目标提议、规划或分离的导航策略。本文描述了如何训练一个统一的扩散策略来同时处理目标导向导航和目标不可知探索，后者提供了在新环境中搜索目标的能力，前者提供了一旦目标被定位后到达用户指定目标的能力。我们展示了相对于使用生成模型的子目标提议或基于潜变量模型的先前方法，这种统一策略在导航到视觉指示目标的新环境中具有更好的整体性能。我们通过使用...",
    "tldr": "本文提出了NoMaD，一种目标遮蔽扩散策略，用于同时处理目标导向导航和目标不可知探索。实验证明，相对于使用子目标提议或潜变量模型的方法，使用此统一策略具有更好的导航性能。",
    "en_tdlr": "This paper proposes NoMaD, a goal-masked diffusion policy, for handling goal-directed navigation and goal-agnostic exploration simultaneously. Experimental results demonstrate that using this unified policy leads to better navigation performance compared to approaches using subgoal proposals or latent variable models."
}