{
    "title": "Improved Automatic Diabetic Retinopathy Severity Classification Using Deep Multimodal Fusion of UWF-CFP and OCTA Images. (arXiv:2310.01912v1 [eess.IV])",
    "abstract": "Diabetic Retinopathy (DR), a prevalent and severe complication of diabetes, affects millions of individuals globally, underscoring the need for accurate and timely diagnosis. Recent advancements in imaging technologies, such as Ultra-WideField Color Fundus Photography (UWF-CFP) imaging and Optical Coherence Tomography Angiography (OCTA), provide opportunities for the early detection of DR but also pose significant challenges given the disparate nature of the data they produce. This study introduces a novel multimodal approach that leverages these imaging modalities to notably enhance DR classification. Our approach integrates 2D UWF-CFP images and 3D high-resolution 6x6 mm$^3$ OCTA (both structure and flow) images using a fusion of ResNet50 and 3D-ResNet50 models, with Squeeze-and-Excitation (SE) blocks to amplify relevant features. Additionally, to increase the model's generalization capabilities, a multimodal extension of Manifold Mixup, applied to concatenated multimodal features, i",
    "link": "http://arxiv.org/abs/2310.01912",
    "context": "Title: Improved Automatic Diabetic Retinopathy Severity Classification Using Deep Multimodal Fusion of UWF-CFP and OCTA Images. (arXiv:2310.01912v1 [eess.IV])\nAbstract: Diabetic Retinopathy (DR), a prevalent and severe complication of diabetes, affects millions of individuals globally, underscoring the need for accurate and timely diagnosis. Recent advancements in imaging technologies, such as Ultra-WideField Color Fundus Photography (UWF-CFP) imaging and Optical Coherence Tomography Angiography (OCTA), provide opportunities for the early detection of DR but also pose significant challenges given the disparate nature of the data they produce. This study introduces a novel multimodal approach that leverages these imaging modalities to notably enhance DR classification. Our approach integrates 2D UWF-CFP images and 3D high-resolution 6x6 mm$^3$ OCTA (both structure and flow) images using a fusion of ResNet50 and 3D-ResNet50 models, with Squeeze-and-Excitation (SE) blocks to amplify relevant features. Additionally, to increase the model's generalization capabilities, a multimodal extension of Manifold Mixup, applied to concatenated multimodal features, i",
    "path": "papers/23/10/2310.01912.json",
    "total_tokens": 1119,
    "translated_title": "使用深度多模态融合的UWF-CFP和OCTA图像改进了自动糖尿病视网膜病变严重程度分类",
    "translated_abstract": "糖尿病视网膜病变（DR）是糖尿病的一种常见且严重的并发症，影响全球数百万人，因此需要准确及时的诊断。最近的成像技术进展，如超广角彩色眼底照相（UWF-CFP）和光学相干断层扫描血管造影（OCTA），为早期检测DR提供了机会，但也面临着数据不一致的巨大挑战。本研究引入了一种新颖的多模态方法，利用这些成像模式显著提高DR分类的准确性。我们的方法通过ResNet50和3D-ResNet50模型的融合，使用Squeeze-and-Excitation（SE）块来增强相关特征，将2D UWF-CFP图像和3D高分辨率6x6 mm^3 OCTA（结构和流）图像进行整合。另外，为了增加模型的泛化能力，我们还将多模态Manifold Mixup应用于连接的多模态特征上。",
    "tldr": "本研究提出了一种利用UWF-CFP和OCTA图像的深度多模态融合方法来改进自动糖尿病视网膜病变严重程度分类，将2D UWF-CFP图像和3D高分辨率6x6 mm^3 OCTA图像进行整合，并采用ResNet50和3D-ResNet50模型的融合以及Squeeze-and-Excitation（SE）块来增强相关特征，同时采用多模态Manifold Mixup来增加模型的泛化能力。"
}