{
    "title": "MEMPSEP III. A machine learning-oriented multivariate data set for forecasting the Occurrence and Properties of Solar Energetic Particle Events using a Multivariate Ensemble Approach. (arXiv:2310.15390v1 [astro-ph.SR])",
    "abstract": "We introduce a new multivariate data set that utilizes multiple spacecraft collecting in-situ and remote sensing heliospheric measurements shown to be linked to physical processes responsible for generating solar energetic particles (SEPs). Using the Geostationary Operational Environmental Satellites (GOES) flare event list from Solar Cycle (SC) 23 and part of SC 24 (1998-2013), we identify 252 solar events (flares) that produce SEPs and 17,542 events that do not. For each identified event, we acquire the local plasma properties at 1 au, such as energetic proton and electron data, upstream solar wind conditions, and the interplanetary magnetic field vector quantities using various instruments onboard GOES and the Advanced Composition Explorer (ACE) spacecraft. We also collect remote sensing data from instruments onboard the Solar Dynamic Observatory (SDO), Solar and Heliospheric Observatory (SoHO), and the Wind solar radio instrument WAVES. The data set is designed to allow for variati",
    "link": "http://arxiv.org/abs/2310.15390",
    "context": "Title: MEMPSEP III. A machine learning-oriented multivariate data set for forecasting the Occurrence and Properties of Solar Energetic Particle Events using a Multivariate Ensemble Approach. (arXiv:2310.15390v1 [astro-ph.SR])\nAbstract: We introduce a new multivariate data set that utilizes multiple spacecraft collecting in-situ and remote sensing heliospheric measurements shown to be linked to physical processes responsible for generating solar energetic particles (SEPs). Using the Geostationary Operational Environmental Satellites (GOES) flare event list from Solar Cycle (SC) 23 and part of SC 24 (1998-2013), we identify 252 solar events (flares) that produce SEPs and 17,542 events that do not. For each identified event, we acquire the local plasma properties at 1 au, such as energetic proton and electron data, upstream solar wind conditions, and the interplanetary magnetic field vector quantities using various instruments onboard GOES and the Advanced Composition Explorer (ACE) spacecraft. We also collect remote sensing data from instruments onboard the Solar Dynamic Observatory (SDO), Solar and Heliospheric Observatory (SoHO), and the Wind solar radio instrument WAVES. The data set is designed to allow for variati",
    "path": "papers/23/10/2310.15390.json",
    "total_tokens": 1022,
    "translated_title": "MEMPSEP III. 一种面向机器学习的多元数据集，用于使用多元集成方法预测太阳能粒子事件的发生和属性（arXiv:2310.15390v1 [astro-ph.SR]）",
    "translated_abstract": "我们介绍了一个新的多元数据集，利用多个航天器收集原位和遥感观测的太阳圈层测量数据，这些数据与产生太阳能粒子事件的物理过程相关。利用地球同步环境卫星（GOES）太阳系活动事件列表从太阳活动周期（SC）23和SC 24的一部分（1998-2013），我们确定了252个产生太阳能粒子（SEP）的太阳事件（耀斑）和17,542个不产生SEP的事件。对于每个确定的事件，我们记录了1 au处的局部等离子体属性，如高能质子和电子数据，上游太阳风条件以及国家地理学会卫星（GOES）和高级组成探测器（ACE）航天器上的不同仪器测得的星际磁场矢量量。我们还收集了来自太阳动力学观测卫星（SDO）、太阳和日球卫星（SoHO）以及Wind太阳射电仪的遥感数据。该数据集旨在允许进行各种变化",
    "tldr": "这个论文介绍了一个面向机器学习的多元数据集，用于预测太阳能粒子事件的发生和属性。数据集包含了多个航天器收集的原位和遥感观测数据，能够与产生太阳能粒子事件的物理过程相关联。",
    "en_tdlr": "This paper presents a machine learning-oriented multivariate data set for forecasting the occurrence and properties of solar energetic particle events. The data set includes in-situ and remote sensing heliospheric measurements from multiple spacecraft, which are linked to the physical processes responsible for generating these events."
}