{
    "title": "Towards Multi-Subsession Conversational Recommendation. (arXiv:2310.13365v1 [cs.IR])",
    "abstract": "Conversational recommendation systems (CRS) could acquire dynamic user preferences towards desired items through multi-round interactive dialogue. Previous CRS mainly focuses on the single conversation (subsession) that user quits after a successful recommendation, neglecting the common scenario where user has multiple conversations (multi-subsession) over a short period. Therefore, we propose a novel conversational recommendation scenario named Multi-Subsession Multi-round Conversational Recommendation (MSMCR), where user would still resort to CRS after several subsessions and might preserve vague interests, and system would proactively ask attributes to activate user interests in the current subsession. To fill the gap in this new CRS scenario, we devise a novel framework called Multi-Subsession Conversational Recommender with Activation Attributes (MSCAA). Specifically, we first develop a context-aware recommendation module, comprehensively modeling user interests from historical in",
    "link": "http://arxiv.org/abs/2310.13365",
    "context": "Title: Towards Multi-Subsession Conversational Recommendation. (arXiv:2310.13365v1 [cs.IR])\nAbstract: Conversational recommendation systems (CRS) could acquire dynamic user preferences towards desired items through multi-round interactive dialogue. Previous CRS mainly focuses on the single conversation (subsession) that user quits after a successful recommendation, neglecting the common scenario where user has multiple conversations (multi-subsession) over a short period. Therefore, we propose a novel conversational recommendation scenario named Multi-Subsession Multi-round Conversational Recommendation (MSMCR), where user would still resort to CRS after several subsessions and might preserve vague interests, and system would proactively ask attributes to activate user interests in the current subsession. To fill the gap in this new CRS scenario, we devise a novel framework called Multi-Subsession Conversational Recommender with Activation Attributes (MSCAA). Specifically, we first develop a context-aware recommendation module, comprehensively modeling user interests from historical in",
    "path": "papers/23/10/2310.13365.json",
    "total_tokens": 882,
    "translated_title": "迈向多子会话会话推荐",
    "translated_abstract": "会话推荐系统(CRS)可以通过多轮交互对话获取用户对所需物品的动态偏好。以往的CRS主要关注用户在成功推荐后退出的单次对话(子会话)，忽视了用户在短时间内进行多次对话(多子会话)的常见场景。因此，我们提出了一种新颖的会话推荐场景，名为多子会话多轮会话推荐(MSMCR)，用户在多个子会话之后仍然会使用CRS，并可能保持模糊的兴趣，系统会主动询问属性以激活当前子会话中的用户兴趣。为了填补这一新的CRS场景中的空白，我们设计了一种称为带有激活属性的多子会话会话推荐器的新框架(MSCAA)。具体而言，我们首先开发了一个上下文感知的推荐模块，全面地对用户兴趣进行建模，",
    "tldr": "这篇论文提出了一种名为多子会话多轮会话推荐的新颖场景，通过多轮交互对话获取用户对所需物品的动态偏好。为了解决这一场景的问题，提出了一种新的框架，使用上下文感知的推荐模块综合建模用户兴趣。",
    "en_tdlr": "This paper proposes a novel scenario called Multi-Subsession Multi-round Conversational Recommendation (MSMCR), where dynamic user preferences towards desired items are acquired through multi-round interactive dialogue. To address this scenario, a new framework is introduced, which utilizes a context-aware recommendation module to comprehensively model user interests."
}