{
    "title": "A SEM-NCA approach towards the impact of participative budgeting on budgetary slack and managerial performance: The mediating role of leadership style and leader-member exchange. (arXiv:2310.09993v1 [econ.GN])",
    "abstract": "This study re-examines the impact of participative budgeting on managerial performance and budgetary slack, addressing gaps in current research. A revised conceptual model is developed, considering the conditioning roles of leadership style and leader-member exchange. The sample includes 408 employees with managerial experience in manufacturing companies. Hypotheses are tested using a combination of PLS-SEM and Necessary Condition Analysis (NCA). The results demonstrate that participative budgeting negatively affects budgetary slack and directly influences managerial performance, leadership style, and leader-member exchange. Moreover, leadership style and leader-member exchange moderate these relationships. The integration of NCA in management accounting research provides valuable insights for decision-makers, allowing for more effective measures. This study contributes by encouraging a complementary PLS-SEM and NCA approach to examine conditional effects. It also enhances understandin",
    "link": "http://arxiv.org/abs/2310.09993",
    "context": "Title: A SEM-NCA approach towards the impact of participative budgeting on budgetary slack and managerial performance: The mediating role of leadership style and leader-member exchange. (arXiv:2310.09993v1 [econ.GN])\nAbstract: This study re-examines the impact of participative budgeting on managerial performance and budgetary slack, addressing gaps in current research. A revised conceptual model is developed, considering the conditioning roles of leadership style and leader-member exchange. The sample includes 408 employees with managerial experience in manufacturing companies. Hypotheses are tested using a combination of PLS-SEM and Necessary Condition Analysis (NCA). The results demonstrate that participative budgeting negatively affects budgetary slack and directly influences managerial performance, leadership style, and leader-member exchange. Moreover, leadership style and leader-member exchange moderate these relationships. The integration of NCA in management accounting research provides valuable insights for decision-makers, allowing for more effective measures. This study contributes by encouraging a complementary PLS-SEM and NCA approach to examine conditional effects. It also enhances understandin",
    "path": "papers/23/10/2310.09993.json",
    "total_tokens": 1061,
    "translated_title": "SEM-NCA方法探究参与式预算对预算垂线与管理绩效的影响：领导风格和领导成员交流的中介作用研究",
    "translated_abstract": "本研究重新审视了参与式预算对管理绩效和预算垂线的影响，并填补了当前研究的空白。我们开发了一个修正后的概念模型，考虑了领导风格和领导成员交流的调节作用。样本包括408名在制造公司拥有管理经验的员工。我们使用PLS-SEM和Necessary Condition Analysis (NCA)相结合的方法来验证假设。结果表明，参与式预算对预算垂线有负面影响，并直接影响管理绩效、领导风格和领导成员交流。此外，领导风格和领导成员交流对这些关系具有调节作用。管理会计研究中引入NCA的整合为决策者提供了有价值的见解，可以采取更有效的措施。本研究通过鼓励结合PLS-SEM和NCA方法来研究条件效应，进一步增强了对该领域的理解。",
    "tldr": "本研究重新审视了参与式预算对管理绩效和预算垂线的影响，发现它对预算垂线有负面影响，并且直接影响管理绩效、领导风格和领导成员交流。此外，领导风格和领导成员交流对这些关系具有调节作用。研究结果对决策者提供了有价值的见解和更有效的措施，同时也鼓励结合PLS-SEM和NCA方法来研究条件效应。",
    "en_tdlr": "This study re-examines the impact of participative budgeting on managerial performance and budgetary slack, finding that it has a negative effect on budgetary slack and directly influences managerial performance, leadership style, and leader-member exchange. Moreover, leadership style and leader-member exchange moderate these relationships. The results provide valuable insights and more effective measures for decision-makers, while also encouraging a complementary PLS-SEM and NCA approach to examine conditional effects."
}