{
    "title": "Efficiently Visualizing Large Graphs. (arXiv:2310.11186v1 [cs.LG])",
    "abstract": "Most existing graph visualization methods based on dimension reduction are limited to relatively small graphs due to performance issues. In this work, we propose a novel dimension reduction method for graph visualization, called t-Distributed Stochastic Graph Neighbor Embedding (t-SGNE). t-SGNE is specifically designed to visualize cluster structures in the graph. As a variant of the standard t-SNE method, t-SGNE avoids the time-consuming computations of pairwise similarity. Instead, it uses the neighbor structures of the graph to reduce the time complexity from quadratic to linear, thus supporting larger graphs. In addition, to suit t-SGNE, we combined Laplacian Eigenmaps with the shortest path algorithm in graphs to form the graph embedding algorithm ShortestPath Laplacian Eigenmaps Embedding (SPLEE). Performing SPLEE to obtain a high-dimensional embedding of the large-scale graph and then using t-SGNE to reduce its dimension for visualization, we are able to visualize graphs with up",
    "link": "http://arxiv.org/abs/2310.11186",
    "context": "Title: Efficiently Visualizing Large Graphs. (arXiv:2310.11186v1 [cs.LG])\nAbstract: Most existing graph visualization methods based on dimension reduction are limited to relatively small graphs due to performance issues. In this work, we propose a novel dimension reduction method for graph visualization, called t-Distributed Stochastic Graph Neighbor Embedding (t-SGNE). t-SGNE is specifically designed to visualize cluster structures in the graph. As a variant of the standard t-SNE method, t-SGNE avoids the time-consuming computations of pairwise similarity. Instead, it uses the neighbor structures of the graph to reduce the time complexity from quadratic to linear, thus supporting larger graphs. In addition, to suit t-SGNE, we combined Laplacian Eigenmaps with the shortest path algorithm in graphs to form the graph embedding algorithm ShortestPath Laplacian Eigenmaps Embedding (SPLEE). Performing SPLEE to obtain a high-dimensional embedding of the large-scale graph and then using t-SGNE to reduce its dimension for visualization, we are able to visualize graphs with up",
    "path": "papers/23/10/2310.11186.json",
    "total_tokens": 931,
    "translated_title": "高效可视化大规模图表",
    "translated_abstract": "大多数现有的基于降维的图表可视化方法由于性能问题仅适用于相对较小的图表。在本文中，我们提出了一种新颖的用于图表可视化的降维方法，称为t分布随机图表邻域嵌入（t-SGNE）。t-SGNE专门设计用于图表中的聚类结构可视化。作为标准t-SNE方法的一种变体，t-SGNE避免了耗时的成对相似度计算。相反，它利用图表的邻域结构将时间复杂度从二次降低为线性，从而支持更大的图表。此外，为了适应t-SGNE，我们将拉普拉斯特征映射与图表中的最短路径算法相结合，形成图表嵌入算法最短路径拉普拉斯特征映射嵌入（SPLEE）。通过SPLEE获得大规模图表的高维嵌入，然后使用t-SGNE将其降维以进行可视化，我们能够可视化具有高效的大规模图表。",
    "tldr": "本文介绍了一种名为t-SGNE的新颖降维方法，用于高效可视化大规模图表。该方法利用图表的邻域结构避免了耗时的成对相似度计算，并使时间复杂度从二次降低为线性。同时，还提出了一种适应t-SGNE的图表嵌入算法SPLEE。通过SPLEE获得高维嵌入，并使用t-SGNE降维进行可视化。"
}