{
    "title": "Classification-Aided Robust Multiple Target Tracking Using Neural Enhanced Message Passing. (arXiv:2310.12407v1 [cs.LG])",
    "abstract": "We address the challenge of tracking an unknown number of targets in strong clutter environments using measurements from a radar sensor. Leveraging the range-Doppler spectra information, we identify the measurement classes, which serve as additional information to enhance clutter rejection and data association, thus bolstering the robustness of target tracking. We first introduce a novel neural enhanced message passing approach, where the beliefs obtained by the unified message passing are fed into the neural network as additional information. The output beliefs are then utilized to refine the original beliefs. Then, we propose a classification-aided robust multiple target tracking algorithm, employing the neural enhanced message passing technique. This algorithm is comprised of three modules: a message-passing module, a neural network module, and a Dempster-Shafer module. The message-passing module is used to represent the statistical model by the factor graph and infers target kinema",
    "link": "http://arxiv.org/abs/2310.12407",
    "context": "Title: Classification-Aided Robust Multiple Target Tracking Using Neural Enhanced Message Passing. (arXiv:2310.12407v1 [cs.LG])\nAbstract: We address the challenge of tracking an unknown number of targets in strong clutter environments using measurements from a radar sensor. Leveraging the range-Doppler spectra information, we identify the measurement classes, which serve as additional information to enhance clutter rejection and data association, thus bolstering the robustness of target tracking. We first introduce a novel neural enhanced message passing approach, where the beliefs obtained by the unified message passing are fed into the neural network as additional information. The output beliefs are then utilized to refine the original beliefs. Then, we propose a classification-aided robust multiple target tracking algorithm, employing the neural enhanced message passing technique. This algorithm is comprised of three modules: a message-passing module, a neural network module, and a Dempster-Shafer module. The message-passing module is used to represent the statistical model by the factor graph and infers target kinema",
    "path": "papers/23/10/2310.12407.json",
    "total_tokens": 923,
    "translated_title": "利用神经增强的消息传递实现分类辅助的鲁棒多目标跟踪",
    "translated_abstract": "本文解决了在强杂波环境中利用雷达传感器测量对未知数量目标的跟踪挑战。通过利用距离-多普勒谱信息，我们识别出测量类别，这可以作为额外信息增强杂波剔除和数据关联，从而增强目标跟踪的鲁棒性。我们首先引入了一种新颖的神经增强的消息传递方法，其中通过统一的消息传递获得的信念被输入到神经网络中作为额外信息。然后利用输出的信念来优化原始信念。接着，我们提出了一种分类辅助的鲁棒多目标跟踪算法，利用神经增强的消息传递技术。该算法由三个模块组成：消息传递模块，神经网络模块和Dempster-Shafer模块。消息传递模块用于通过因子图表示统计模型，并推断目标运动状态。",
    "tldr": "本文提出了一种利用神经增强的方法进行分类辅助的鲁棒多目标跟踪，在强杂波环境中利用雷达传感器的测量信息来增强杂波剔除和数据关联，从而提高目标跟踪的鲁棒性。",
    "en_tdlr": "This paper presents a classification-aided robust multiple target tracking algorithm using neural enhanced message passing. It leverages the range-Doppler spectra information to enhance clutter rejection and data association, thus improving the robustness of target tracking in strong clutter environments."
}