{
    "title": "Autonomous 3D Exploration in Large-Scale Environments with Dynamic Obstacles. (arXiv:2310.17977v1 [cs.RO])",
    "abstract": "Exploration in dynamic and uncertain real-world environments is an open problem in robotics and constitutes a foundational capability of autonomous systems operating in most of the real world. While 3D exploration planning has been extensively studied, the environments are assumed static or only reactive collision avoidance is carried out. We propose a novel approach to not only avoid dynamic obstacles but also include them in the plan itself, to exploit the dynamic environment in the agent's favor. The proposed planner, Dynamic Autonomous Exploration Planner (DAEP), extends AEP to explicitly plan with respect to dynamic obstacles. To thoroughly evaluate exploration planners in such settings we propose a new enhanced benchmark suite with several dynamic environments, including large-scale outdoor environments. DAEP outperform state-of-the-art planners in dynamic and large-scale environments. DAEP is shown to be more effective at both exploration and collision avoidance.",
    "link": "http://arxiv.org/abs/2310.17977",
    "context": "Title: Autonomous 3D Exploration in Large-Scale Environments with Dynamic Obstacles. (arXiv:2310.17977v1 [cs.RO])\nAbstract: Exploration in dynamic and uncertain real-world environments is an open problem in robotics and constitutes a foundational capability of autonomous systems operating in most of the real world. While 3D exploration planning has been extensively studied, the environments are assumed static or only reactive collision avoidance is carried out. We propose a novel approach to not only avoid dynamic obstacles but also include them in the plan itself, to exploit the dynamic environment in the agent's favor. The proposed planner, Dynamic Autonomous Exploration Planner (DAEP), extends AEP to explicitly plan with respect to dynamic obstacles. To thoroughly evaluate exploration planners in such settings we propose a new enhanced benchmark suite with several dynamic environments, including large-scale outdoor environments. DAEP outperform state-of-the-art planners in dynamic and large-scale environments. DAEP is shown to be more effective at both exploration and collision avoidance.",
    "path": "papers/23/10/2310.17977.json",
    "total_tokens": 941,
    "translated_title": "在具有动态障碍物的大规模环境中的自主3D探索",
    "translated_abstract": "在动态和不确定的现实环境中进行探索是机器人领域中的一个开放问题，也是自主系统在大多数现实世界中操作的基本能力。虽然3D探索规划已经得到广泛研究，但环境被假设为静态或仅执行反应性避碰。我们提出了一种新颖的方法，不仅可以避免动态障碍物，还可以将它们包含在计划中，以利用代理在动态环境中的优势。所提出的规划器，Dynamic Autonomous Exploration Planner (DAEP)，扩展了AEP，以明确地针对动态障碍物进行规划。为了全面评估这类环境中的探索规划器，我们提出了一个新的增强型基准套件，其中包括多个动态环境，包括大规模室外环境。DAEP在动态和大规模环境中胜过了最先进的规划器。 DAEP在探索和避碰方面都表现更加有效。",
    "tldr": "提出了一种在具有动态障碍物的大规模环境中自主3D探索的方法，该方法不仅可以避免动态障碍物，还可以将其包含在规划中以利用动态环境优势，并且在动态和大规模环境中表现出更好的探索和避碰效果。"
}