{
    "title": "Moments for Perceptive Narration Analysis Through the Emotional Attachment of Audience to Discourse and Story. (arXiv:2310.18273v1 [cs.AI])",
    "abstract": "In this work, our goal is to develop a theoretical framework that can eventually be used for analyzing the effectiveness of visual stories such as feature films to comic books. To develop this theoretical framework, we introduce a new story element called moments. Our conjecture is that any linear story such as the story of a feature film can be decomposed into a set of moments that follow each other. Moments are defined as the perception of the actions, interactions, and expressions of all characters or a single character during a given time period. We categorize the moments into two major types: story moments and discourse moments. Each type of moment can further be classified into three types, which we call universal storytelling moments. We believe these universal moments foster or deteriorate the emotional attachment of the audience to a particular character or the story. We present a methodology to catalog the occurrences of these universal moments as they are found in the story.",
    "link": "http://arxiv.org/abs/2310.18273",
    "context": "Title: Moments for Perceptive Narration Analysis Through the Emotional Attachment of Audience to Discourse and Story. (arXiv:2310.18273v1 [cs.AI])\nAbstract: In this work, our goal is to develop a theoretical framework that can eventually be used for analyzing the effectiveness of visual stories such as feature films to comic books. To develop this theoretical framework, we introduce a new story element called moments. Our conjecture is that any linear story such as the story of a feature film can be decomposed into a set of moments that follow each other. Moments are defined as the perception of the actions, interactions, and expressions of all characters or a single character during a given time period. We categorize the moments into two major types: story moments and discourse moments. Each type of moment can further be classified into three types, which we call universal storytelling moments. We believe these universal moments foster or deteriorate the emotional attachment of the audience to a particular character or the story. We present a methodology to catalog the occurrences of these universal moments as they are found in the story.",
    "path": "papers/23/10/2310.18273.json",
    "total_tokens": 981,
    "translated_title": "感知叙述分析中的时刻：通过观众对话语和故事的情感联系",
    "translated_abstract": "这项研究的目标是开发一个理论框架，以分析视觉故事（如电影和漫画书）的效果。为了开发这个理论框架，我们引入了一个新的故事元素，称为时刻。我们的假设是，任何线性故事，比如电影故事，都可以被分解为一系列相互连接的时刻。时刻被定义为在给定时间段内，所有角色或单个角色的行动、互动和表情的感知。我们将时刻分为两种主要类型：故事时刻和对话时刻。每种类型的时刻还可以进一步分类为三种类型，我们称之为通用叙述时刻。我们认为这些通用时刻会促进或破坏观众对特定角色或故事的情感联系。我们提出了一种方法来分类这些通用时刻在故事中的出现。",
    "tldr": "这篇论文的创新之处在于提出了一种理论框架，通过分析故事中的时刻来评估视觉故事的效果。时刻被定义为在给定时间段内角色的行动、互动和表情的感知。这些时刻可以进一步分为故事时刻和对话时刻，并且它们的存在会影响观众对角色和故事的情感联系。论文提出了一种方法来分类和分析这些时刻的出现。",
    "en_tdlr": "The paper presents a theoretical framework for analyzing the effectiveness of visual stories by examining the moments, which are perceived actions, interactions, and expressions of characters. The moments are classified into story moments and discourse moments, and their existence affects the emotional attachment of the audience to the characters and the story. The paper introduces a methodology to catalog and analyze the occurrences of these moments."
}