{
    "title": "On the Computational Complexities of Complex-valued Neural Networks. (arXiv:2310.13075v1 [cs.NE])",
    "abstract": "Complex-valued neural networks (CVNNs) are nonlinear filters used in the digital signal processing of complex-domain data. Compared with real-valued neural networks~(RVNNs), CVNNs can directly handle complex-valued input and output signals due to their complex domain parameters and activation functions. With the trend toward low-power systems, computational complexity analysis has become essential for measuring an algorithm's power consumption. Therefore, this paper presents both the quantitative and asymptotic computational complexities of CVNNs. This is a crucial tool in deciding which algorithm to implement. The mathematical operations are described in terms of the number of real-valued multiplications, as these are the most demanding operations. To determine which CVNN can be implemented in a low-power system, quantitative computational complexities can be used to accurately estimate the number of floating-point operations. We have also investigated the computational complexities o",
    "link": "http://arxiv.org/abs/2310.13075",
    "context": "Title: On the Computational Complexities of Complex-valued Neural Networks. (arXiv:2310.13075v1 [cs.NE])\nAbstract: Complex-valued neural networks (CVNNs) are nonlinear filters used in the digital signal processing of complex-domain data. Compared with real-valued neural networks~(RVNNs), CVNNs can directly handle complex-valued input and output signals due to their complex domain parameters and activation functions. With the trend toward low-power systems, computational complexity analysis has become essential for measuring an algorithm's power consumption. Therefore, this paper presents both the quantitative and asymptotic computational complexities of CVNNs. This is a crucial tool in deciding which algorithm to implement. The mathematical operations are described in terms of the number of real-valued multiplications, as these are the most demanding operations. To determine which CVNN can be implemented in a low-power system, quantitative computational complexities can be used to accurately estimate the number of floating-point operations. We have also investigated the computational complexities o",
    "path": "papers/23/10/2310.13075.json",
    "total_tokens": 854,
    "translated_title": "关于复值神经网络的计算复杂性研究",
    "translated_abstract": "复值神经网络（CVNNs）是用于复域数据数字信号处理的非线性滤波器。与实值神经网络（RVNNs）相比，CVNNs可以直接处理复值输入和输出信号，这是由于它们的复域参数和激活函数。随着低功耗系统的趋势，计算复杂性分析已成为衡量算法功耗的重要工具。因此，本文介绍了CVNNs的定量和渐进计算复杂性，并且这对于决定实施哪种算法是至关重要的。数学运算以实值乘法的数量来描述，因为这些是最具挑战性的操作。通过定量计算复杂性可以准确估计浮点操作的数量，从而确定哪种CVNN可以在低功耗系统中实施。我们还研究了计算复杂性。",
    "tldr": "本论文研究了复值神经网络的计算复杂性，可以直接处理复值输入和输出信号，并使用定量计算复杂性来估计浮点操作的数量，有助于在低功耗系统中决定实施哪种算法。",
    "en_tdlr": "This paper investigates the computational complexities of complex-valued neural networks (CVNNs), which can directly handle complex-valued input and output signals. By using quantitative computational complexities, it accurately estimates the number of floating-point operations, helping to determine which algorithm to implement in low-power systems."
}