{
    "title": "Market Crowds' Trading Behaviors, Agreement Prices, and the Implications of Trading Volume. (arXiv:2310.05322v1 [q-fin.GN])",
    "abstract": "It has been long that literature in financial academics focuses mainly on price and return but much less on trading volume. In the past twenty years, it has already linked both price and trading volume to economic fundamentals, and explored the behavioral implications of trading volume such as investor's attitude toward risks, overconfidence, disagreement, and attention etc. However, what is surprising is how little we really know about trading volume. Here we show that trading volume probability represents the frequency of market crowd's trading action in terms of behavior analysis, and test two adaptive hypotheses relevant to the volume uncertainty associated with price in China stock market. The empirical work reveals that market crowd trade a stock in efficient adaptation except for simple heuristics, gradually tend to achieve agreement on an outcome or an asset price widely on a trading day, and generate such a stationary equilibrium price very often in interaction and competition",
    "link": "http://arxiv.org/abs/2310.05322",
    "context": "Title: Market Crowds' Trading Behaviors, Agreement Prices, and the Implications of Trading Volume. (arXiv:2310.05322v1 [q-fin.GN])\nAbstract: It has been long that literature in financial academics focuses mainly on price and return but much less on trading volume. In the past twenty years, it has already linked both price and trading volume to economic fundamentals, and explored the behavioral implications of trading volume such as investor's attitude toward risks, overconfidence, disagreement, and attention etc. However, what is surprising is how little we really know about trading volume. Here we show that trading volume probability represents the frequency of market crowd's trading action in terms of behavior analysis, and test two adaptive hypotheses relevant to the volume uncertainty associated with price in China stock market. The empirical work reveals that market crowd trade a stock in efficient adaptation except for simple heuristics, gradually tend to achieve agreement on an outcome or an asset price widely on a trading day, and generate such a stationary equilibrium price very often in interaction and competition",
    "path": "papers/23/10/2310.05322.json",
    "total_tokens": 862,
    "translated_title": "市场众筹的交易行为、一致价格及交易量的影响",
    "translated_abstract": "长期以来，金融学界的文献主要关注价格和回报，但对交易量的研究较少。在过去的二十年中，已经将价格和交易量与经济基本面联系起来，并探索了交易量的行为影响，如投资者对风险的态度、过度自信、分歧和关注等。然而，令人惊讶的是我们对交易量实际上知之甚少。在这里，我们展示了交易量概率表示市场众筹的交易行为频率，并测试了与中国股市价格相关的两个自适应假设。经验研究揭示了市场众筹在有效适应中交易股票，除了简单的启发式算法外，渐渐倾向于在交易日内对一个结果或资产价格达成一致，并且经常在交互和竞争中产生这样一个稳定的均衡价格。",
    "tldr": "本文研究了市场众筹的交易行为以及交易量对于价格的影响，发现市场众筹在有效适应中交易股票，并在交互和竞争中产生稳定的均衡价格。",
    "en_tdlr": "This paper examines the trading behaviors and the impact of trading volume on prices in market crowdfunding. The study finds that market crowds adaptively trade stocks and generate stable equilibrium prices through interaction and competition."
}