{
    "title": "GameGPT: Multi-agent Collaborative Framework for Game Development. (arXiv:2310.08067v1 [cs.AI])",
    "abstract": "The large language model (LLM) based agents have demonstrated their capacity to automate and expedite software development processes. In this paper, we focus on game development and propose a multi-agent collaborative framework, dubbed GameGPT, to automate game development. While many studies have pinpointed hallucination as a primary roadblock for deploying LLMs in production, we identify another concern: redundancy. Our framework presents a series of methods to mitigate both concerns. These methods include dual collaboration and layered approaches with several in-house lexicons, to mitigate the hallucination and redundancy in the planning, task identification, and implementation phases. Furthermore, a decoupling approach is also introduced to achieve code generation with better precision.",
    "link": "http://arxiv.org/abs/2310.08067",
    "context": "Title: GameGPT: Multi-agent Collaborative Framework for Game Development. (arXiv:2310.08067v1 [cs.AI])\nAbstract: The large language model (LLM) based agents have demonstrated their capacity to automate and expedite software development processes. In this paper, we focus on game development and propose a multi-agent collaborative framework, dubbed GameGPT, to automate game development. While many studies have pinpointed hallucination as a primary roadblock for deploying LLMs in production, we identify another concern: redundancy. Our framework presents a series of methods to mitigate both concerns. These methods include dual collaboration and layered approaches with several in-house lexicons, to mitigate the hallucination and redundancy in the planning, task identification, and implementation phases. Furthermore, a decoupling approach is also introduced to achieve code generation with better precision.",
    "path": "papers/23/10/2310.08067.json",
    "total_tokens": 814,
    "translated_title": "GameGPT: 游戏开发的多智能体协作框架",
    "translated_abstract": "基于大型语言模型(LLM)的智能体展示了它们自动化和加速软件开发过程的能力。本文针对游戏开发，提出了一个名为GameGPT的多智能体协作框架，用于自动化游戏开发。尽管许多研究已经指出幻觉是部署LLM在生产中的主要障碍，但我们认为还存在另一个问题：冗余。我们的框架提出了一系列方法来缓解这两个问题。这些方法包括双重协作和分层方法，结合多个内部词库，以降低规划、任务识别和实施阶段的幻觉和冗余。此外，我们还引入了一种解耦方法，以更好地实现代码生成的精度。",
    "tldr": "GameGPT是一个多智能体协作框架，用于自动化游戏开发。它通过使用双重协作和分层方法，结合多个内部词库和解耦方法，解决了大型语言模型在游戏开发中的幻觉和冗余问题。"
}