{
    "title": "SpecTr: Fast Speculative Decoding via Optimal Transport. (arXiv:2310.15141v2 [cs.LG] UPDATED)",
    "abstract": "Autoregressive sampling from large language models has led to state-of-the-art results in several natural language tasks. However, autoregressive sampling generates tokens one at a time making it slow, and even prohibitive in certain tasks. One way to speed up sampling is $\\textit{speculative decoding}$: use a small model to sample a $\\textit{draft}$ (block or sequence of tokens), and then score all tokens in the draft by the large language model in parallel. A subset of the tokens in the draft are accepted (and the rest rejected) based on a statistical method to guarantee that the final output follows the distribution of the large model. In this work, we provide a principled understanding of speculative decoding through the lens of optimal transport (OT) with $\\textit{membership cost}$. This framework can be viewed as an extension of the well-known $\\textit{maximal-coupling}$ problem. This new formulation enables us to generalize the speculative decoding method to allow for a set of $",
    "link": "http://arxiv.org/abs/2310.15141",
    "context": "Title: SpecTr: Fast Speculative Decoding via Optimal Transport. (arXiv:2310.15141v2 [cs.LG] UPDATED)\nAbstract: Autoregressive sampling from large language models has led to state-of-the-art results in several natural language tasks. However, autoregressive sampling generates tokens one at a time making it slow, and even prohibitive in certain tasks. One way to speed up sampling is $\\textit{speculative decoding}$: use a small model to sample a $\\textit{draft}$ (block or sequence of tokens), and then score all tokens in the draft by the large language model in parallel. A subset of the tokens in the draft are accepted (and the rest rejected) based on a statistical method to guarantee that the final output follows the distribution of the large model. In this work, we provide a principled understanding of speculative decoding through the lens of optimal transport (OT) with $\\textit{membership cost}$. This framework can be viewed as an extension of the well-known $\\textit{maximal-coupling}$ problem. This new formulation enables us to generalize the speculative decoding method to allow for a set of $",
    "path": "papers/23/10/2310.15141.json",
    "total_tokens": 839,
    "translated_title": "SpecTr: 通过最优传输实现快速具有推测性的解码",
    "translated_abstract": "从大语言模型中进行自回归采样在多个自然语言任务中取得了最先进的结果。然而，自回归采样一次只生成一个标记，这使得速度慢，在某些任务中甚至是禁止的。加速采样的一种方式是“推测性解码”：使用一个小模型来采样一个“草稿”（块或标记序列），然后由大语言模型并行评分草稿中的所有标记。根据统计方法，接受一部分草稿中的标记（拒绝剩余标记），以确保最终输出遵循大模型的分布。在这项工作中，我们通过最优传输（OT）与“成员费用”的视角提供了推测性解码的原则性理解。这个框架可以被看作是“最大耦合”问题的扩展。这种新的形式使我们能够将推测性解码方法推广到允许一个集合的标记的情况。",
    "tldr": "本研究通过最优传输的方法提供了推测性解码的原则性理解，使得从大语言模型中进行自回归采样的过程能够更快速地进行。"
}