{
    "title": "Covert Planning against Imperfect Observers. (arXiv:2310.16791v2 [cs.MA] UPDATED)",
    "abstract": "Covert planning refers to a class of constrained planning problems where an agent aims to accomplish a task with minimal information leaked to a passive observer to avoid detection. However, existing methods of covert planning often consider deterministic environments or do not exploit the observer's imperfect information. This paper studies how covert planning can leverage the coupling of stochastic dynamics and the observer's imperfect observation to achieve optimal task performance without being detected. Specifically, we employ a Markov decision process to model the interaction between the agent and its stochastic environment, and a partial observation function to capture the leaked information to a passive observer. Assuming the observer employs hypothesis testing to detect if the observation deviates from a nominal policy, the covert planning agent aims to maximize the total discounted reward while keeping the probability of being detected as an adversary below a given threshold.",
    "link": "http://arxiv.org/abs/2310.16791",
    "context": "Title: Covert Planning against Imperfect Observers. (arXiv:2310.16791v2 [cs.MA] UPDATED)\nAbstract: Covert planning refers to a class of constrained planning problems where an agent aims to accomplish a task with minimal information leaked to a passive observer to avoid detection. However, existing methods of covert planning often consider deterministic environments or do not exploit the observer's imperfect information. This paper studies how covert planning can leverage the coupling of stochastic dynamics and the observer's imperfect observation to achieve optimal task performance without being detected. Specifically, we employ a Markov decision process to model the interaction between the agent and its stochastic environment, and a partial observation function to capture the leaked information to a passive observer. Assuming the observer employs hypothesis testing to detect if the observation deviates from a nominal policy, the covert planning agent aims to maximize the total discounted reward while keeping the probability of being detected as an adversary below a given threshold.",
    "path": "papers/23/10/2310.16791.json",
    "total_tokens": 869,
    "translated_title": "对抗不完美观察者的隐秘规划",
    "translated_abstract": "隐秘规划指的是一类有限制的规划问题，其中代理程序旨在在最小信息泄漏给被动观察者的情况下完成任务，以避免被发现。然而，现有的隐秘规划方法通常考虑确定性环境，或者不利用观察者的不完美信息。本文研究了如何利用随机动力学和观察者的不完美观测耦合来实现最优的任务性能，同时避免被发现。具体而言，我们使用马尔可夫决策过程来建模代理程序与其随机环境之间的相互作用，并使用部分观测函数来捕捉泄漏给被动观察者的信息。假设观察者使用假设检验来检测观测是否偏离了名义策略，隐秘规划代理程序的目标是在保持被敌方发现的概率低于给定阈值的同时，最大化总折扣奖励。",
    "tldr": "本文研究了对抗不完美观察者的隐秘规划问题，提出了一种利用随机动力学和观察者的不完美观测耦合的方法，实现最优任务性能而不被发现。",
    "en_tdlr": "This paper studies covert planning against imperfect observers, proposing a method that leverages the coupling of stochastic dynamics and the observer's imperfect observation to achieve optimal task performance without being detected."
}