{
    "title": "LLM-Based Agent Society Investigation: Collaboration and Confrontation in Avalon Gameplay",
    "abstract": "arXiv:2310.14985v2 Announce Type: replace  Abstract: This paper aims to investigate the open research problem of uncovering the social behaviors of LLM-based agents. To achieve this goal, we adopt Avalon, a representative communication game, as the environment and use system prompts to guide LLM agents to play the game. While previous studies have conducted preliminary investigations into gameplay with LLM agents, there lacks research on their social behaviors. In this paper, we present a novel framework designed to seamlessly adapt to Avalon gameplay. The core of our proposed framework is a multi-agent system that enables efficient communication and interaction among agents. We evaluate the performance of our framework based on metrics from two perspectives: winning the game and analyzing the social behaviors of LLM agents. Our results demonstrate the effectiveness of our framework in generating adaptive and intelligent agents and highlight the potential of LLM-based agents in address",
    "link": "https://arxiv.org/abs/2310.14985",
    "context": "Title: LLM-Based Agent Society Investigation: Collaboration and Confrontation in Avalon Gameplay\nAbstract: arXiv:2310.14985v2 Announce Type: replace  Abstract: This paper aims to investigate the open research problem of uncovering the social behaviors of LLM-based agents. To achieve this goal, we adopt Avalon, a representative communication game, as the environment and use system prompts to guide LLM agents to play the game. While previous studies have conducted preliminary investigations into gameplay with LLM agents, there lacks research on their social behaviors. In this paper, we present a novel framework designed to seamlessly adapt to Avalon gameplay. The core of our proposed framework is a multi-agent system that enables efficient communication and interaction among agents. We evaluate the performance of our framework based on metrics from two perspectives: winning the game and analyzing the social behaviors of LLM agents. Our results demonstrate the effectiveness of our framework in generating adaptive and intelligent agents and highlight the potential of LLM-based agents in address",
    "path": "papers/23/10/2310.14985.json",
    "total_tokens": 924,
    "translated_title": "基于LLM的智能体社会行为研究：Avalon游戏中的协作与对抗",
    "translated_abstract": "本文旨在研究揭示基于LLM的智能体社会行为的开放性研究问题。为达到这一目标，我们采用了Avalon作为代表性的沟通游戏环境，并使用系统提示引导LLM智能体进行游戏。虽然先前的研究已经进行了关于LLM智能体的游戏玩法的初步研究，但是他们的社会行为仍缺乏研究。本文提出了一个新颖的框架，旨在无缝适应Avalon游戏。我们提出的框架的核心是一个多智能体系统，可以实现智能体之间的有效沟通和互动。我们根据两个角度的度量标准评估了我们框架的性能：赢得游戏和更分析LLM智能体的社会行为。我们的结果展示了我们的框架在生成自适应和智能智能体方面的有效性，并突显了LLM智能体在应对中的潜力。",
    "tldr": "本文提出了一个新颖的框架，旨在无缝适应Avalon游戏，通过多智能体系统实现了有效的沟通和互动，评估了智能体的性能和社会行为，展示了LLM智能体在游戏中具有潜力。",
    "en_tdlr": "This paper presents a novel framework designed to seamlessly adapt to Avalon gameplay by utilizing a multi-agent system for effective communication and interaction, evaluates the performance and social behaviors of intelligent agents, demonstrating the potential of LLM-based agents in gameplay."
}