{
    "title": "Detection and prediction of clopidogrel treatment failures using longitudinal structured electronic health records. (arXiv:2310.08757v1 [cs.LG])",
    "abstract": "We propose machine learning algorithms to automatically detect and predict clopidogrel treatment failure using longitudinal structured electronic health records (EHR). By drawing analogies between natural language and structured EHR, we introduce various machine learning algorithms used in natural language processing (NLP) applications to build models for treatment failure detection and prediction. In this regard, we generated a cohort of patients with clopidogrel prescriptions from UK Biobank and annotated if the patients had treatment failure events within one year of the first clopidogrel prescription; out of 502,527 patients, 1,824 patients were identified as treatment failure cases, and 6,859 patients were considered as control cases. From the dataset, we gathered diagnoses, prescriptions, and procedure records together per patient and organized them into visits with the same date to build models. The models were built for two different tasks, i.e., detection and prediction, and t",
    "link": "http://arxiv.org/abs/2310.08757",
    "context": "Title: Detection and prediction of clopidogrel treatment failures using longitudinal structured electronic health records. (arXiv:2310.08757v1 [cs.LG])\nAbstract: We propose machine learning algorithms to automatically detect and predict clopidogrel treatment failure using longitudinal structured electronic health records (EHR). By drawing analogies between natural language and structured EHR, we introduce various machine learning algorithms used in natural language processing (NLP) applications to build models for treatment failure detection and prediction. In this regard, we generated a cohort of patients with clopidogrel prescriptions from UK Biobank and annotated if the patients had treatment failure events within one year of the first clopidogrel prescription; out of 502,527 patients, 1,824 patients were identified as treatment failure cases, and 6,859 patients were considered as control cases. From the dataset, we gathered diagnoses, prescriptions, and procedure records together per patient and organized them into visits with the same date to build models. The models were built for two different tasks, i.e., detection and prediction, and t",
    "path": "papers/23/10/2310.08757.json",
    "total_tokens": 923,
    "translated_title": "使用长期结构化电子健康记录检测和预测氯吡格雷治疗失败",
    "translated_abstract": "我们提出了机器学习算法，利用长期结构化电子健康记录（EHR）自动检测和预测氯吡格雷治疗失败。通过将自然语言与结构化EHR进行类比，我们引入了用于自然语言处理（NLP）应用的各种机器学习算法，构建治疗失败检测和预测模型。我们从英国生物库（UK Biobank）中生成了一个服用氯吡格雷处方的患者队列，并标注了这些患者在第一次氯吡格雷处方后一年内是否发生了治疗失败事件；在502,527名患者中，发现了1,824例治疗失败病例和6,859例对照病例。我们按患者整理了诊断、处方和过程记录，并按照相同日期组织成访问记录，以构建模型。这些模型分别用于检测和预测两个不同的任务。",
    "tldr": "本研究提出了使用机器学习算法基于长期结构化电子健康记录，自动检测和预测氯吡格雷治疗失败的方法。研究利用英国生物库的数据构建了模型，通过整理诊断、处方和过程记录来进行预测和检测。",
    "en_tdlr": "This study proposes a machine learning approach using longitudinal structured electronic health records to automatically detect and predict clopidogrel treatment failures. The models are built based on data from the UK Biobank and involve organizing diagnoses, prescriptions, and procedure records to perform detection and prediction tasks."
}