{
    "title": "From Simple to Complex: A Progressive Framework for Document-level Informative Argument Extraction. (arXiv:2310.16358v1 [cs.CL])",
    "abstract": "Document-level Event Argument Extraction (EAE) requires the model to extract arguments of multiple events from a single document. Considering the underlying dependencies between these events, recent efforts leverage the idea of \"memory\", where the results of already predicted events are cached and can be retrieved to help the prediction of upcoming events. These methods extract events according to their appearance order in the document, however, the event that appears in the first sentence does not mean that it is the easiest to extract. Existing methods might introduce noise to the extraction of upcoming events if they rely on an incorrect prediction of previous events. In order to provide more reliable memory, we propose a simple-to-complex progressive framework for document-level EAE. Specifically, we first calculate the difficulty of each event and then, we conduct the extraction following a simple-to-complex order. In this way, the memory will store the most certain results, and t",
    "link": "http://arxiv.org/abs/2310.16358",
    "context": "Title: From Simple to Complex: A Progressive Framework for Document-level Informative Argument Extraction. (arXiv:2310.16358v1 [cs.CL])\nAbstract: Document-level Event Argument Extraction (EAE) requires the model to extract arguments of multiple events from a single document. Considering the underlying dependencies between these events, recent efforts leverage the idea of \"memory\", where the results of already predicted events are cached and can be retrieved to help the prediction of upcoming events. These methods extract events according to their appearance order in the document, however, the event that appears in the first sentence does not mean that it is the easiest to extract. Existing methods might introduce noise to the extraction of upcoming events if they rely on an incorrect prediction of previous events. In order to provide more reliable memory, we propose a simple-to-complex progressive framework for document-level EAE. Specifically, we first calculate the difficulty of each event and then, we conduct the extraction following a simple-to-complex order. In this way, the memory will store the most certain results, and t",
    "path": "papers/23/10/2310.16358.json",
    "total_tokens": 936,
    "translated_title": "从简单到复杂：一种逐步框架用于文档级信息性论证提取",
    "translated_abstract": "文档级事件论证提取（EAE）要求模型从单个文档中提取多个事件的论证。考虑到这些事件之间的相关性，最近的努力利用了\"记忆\"的想法，已经预测的事件的结果被缓存，可以用来帮助预测即将发生的事件。这些方法根据事件在文档中的出现顺序进行提取，然而，出现在第一句中的事件并不意味着它是最容易提取的。现有的方法可能会在依赖于先前事件的不正确预测的情况下引入噪声到即将发生的事件的提取中。为了提供更可靠的记忆，我们提出了一个简单到复杂的逐步框架用于文档级EAE。具体而言，我们首先计算每个事件的难度，然后按照简单到复杂的顺序进行提取。这样，记忆将存储最确定的结果，并且使得即将发生的事件的提取更加可靠。",
    "tldr": "本论文提出了一种简单到复杂的逐步框架用于文档级信息性论证提取，通过计算每个事件的难度并按照简单到复杂的顺序进行提取，可以提供更可靠的记忆，避免在依赖先前事件的不正确预测的情况下引入噪声。",
    "en_tdlr": "This paper proposes a progressive framework for document-level informative argument extraction, where the difficulty of each event is calculated and extraction is conducted in a simple-to-complex order. This approach provides more reliable memory and avoids introducing noise due to incorrect predictions of previous events."
}