{
    "title": "ZEST: Attention-based Zero-Shot Learning for Unseen IoT Device Classification. (arXiv:2310.08036v1 [cs.NI])",
    "abstract": "Recent research works have proposed machine learning models for classifying IoT devices connected to a network. However, there is still a practical challenge of not having all devices (and hence their traffic) available during the training of a model. This essentially means, during the operational phase, we need to classify new devices not seen during the training phase. To address this challenge, we propose ZEST -- a ZSL (zero-shot learning) framework based on self-attention for classifying both seen and unseen devices. ZEST consists of i) a self-attention based network feature extractor, termed SANE, for extracting latent space representations of IoT traffic, ii) a generative model that trains a decoder using latent features to generate pseudo data, and iii) a supervised model that is trained on the generated pseudo data for classifying devices. We carry out extensive experiments on real IoT traffic data; our experiments demonstrate i) ZEST achieves significant improvement (in terms ",
    "link": "http://arxiv.org/abs/2310.08036",
    "context": "Title: ZEST: Attention-based Zero-Shot Learning for Unseen IoT Device Classification. (arXiv:2310.08036v1 [cs.NI])\nAbstract: Recent research works have proposed machine learning models for classifying IoT devices connected to a network. However, there is still a practical challenge of not having all devices (and hence their traffic) available during the training of a model. This essentially means, during the operational phase, we need to classify new devices not seen during the training phase. To address this challenge, we propose ZEST -- a ZSL (zero-shot learning) framework based on self-attention for classifying both seen and unseen devices. ZEST consists of i) a self-attention based network feature extractor, termed SANE, for extracting latent space representations of IoT traffic, ii) a generative model that trains a decoder using latent features to generate pseudo data, and iii) a supervised model that is trained on the generated pseudo data for classifying devices. We carry out extensive experiments on real IoT traffic data; our experiments demonstrate i) ZEST achieves significant improvement (in terms ",
    "path": "papers/23/10/2310.08036.json",
    "total_tokens": 913,
    "translated_title": "ZEST:基于注意力机制的零样本学习用于未见过的物联网设备分类",
    "translated_abstract": "最近的研究工作提出了用于分类与网络连接的物联网设备的机器学习模型。然而，在模型训练期间，由于没有所有设备（因此没有它们的流量），仍然存在无法使用所有设备进行训练的实际挑战。这意味着在操作阶段需要对在训练阶段未见过的新设备进行分类。为了解决这个挑战，我们提出了一种基于自注意力机制的零样本学习框架ZEST，用于分类已知和未知的设备。ZEST包括：i）基于自注意力机制的网络特征提取器SANE，用于提取物联网流量的潜在空间表示；ii）一个生成模型，利用潜在特征训练解码器生成伪数据；iii）一个监督模型，用于基于生成的伪数据进行设备分类。我们对真实的物联网流量数据进行了大量实验；实验结果表明ZEST在性能上取得了显著的改进。",
    "tldr": "ZEST是一种基于注意力机制的零样本学习框架，用于分类未见过的物联网设备。通过使用自注意力机制提取特征并利用生成模型生成伪数据，ZEST能够在性能上取得显著的改进。",
    "en_tdlr": "ZEST is an attention-based zero-shot learning framework for classifying unseen IoT devices. By utilizing self-attention to extract features and generating pseudo-data with a generative model, ZEST achieves significant improvement in performance."
}