{
    "title": "Spatio-Temporal Meta Contrastive Learning. (arXiv:2310.17678v1 [cs.LG])",
    "abstract": "Spatio-temporal prediction is crucial in numerous real-world applications, including traffic forecasting and crime prediction, which aim to improve public transportation and safety management. Many state-of-the-art models demonstrate the strong capability of spatio-temporal graph neural networks (STGNN) to capture complex spatio-temporal correlations. However, despite their effectiveness, existing approaches do not adequately address several key challenges. Data quality issues, such as data scarcity and sparsity, lead to data noise and a lack of supervised signals, which significantly limit the performance of STGNN. Although recent STGNN models with contrastive learning aim to address these challenges, most of them use pre-defined augmentation strategies that heavily depend on manual design and cannot be customized for different Spatio-Temporal Graph (STG) scenarios. To tackle these challenges, we propose a new spatio-temporal contrastive learning (CL4ST) framework to encode robust and",
    "link": "http://arxiv.org/abs/2310.17678",
    "context": "Title: Spatio-Temporal Meta Contrastive Learning. (arXiv:2310.17678v1 [cs.LG])\nAbstract: Spatio-temporal prediction is crucial in numerous real-world applications, including traffic forecasting and crime prediction, which aim to improve public transportation and safety management. Many state-of-the-art models demonstrate the strong capability of spatio-temporal graph neural networks (STGNN) to capture complex spatio-temporal correlations. However, despite their effectiveness, existing approaches do not adequately address several key challenges. Data quality issues, such as data scarcity and sparsity, lead to data noise and a lack of supervised signals, which significantly limit the performance of STGNN. Although recent STGNN models with contrastive learning aim to address these challenges, most of them use pre-defined augmentation strategies that heavily depend on manual design and cannot be customized for different Spatio-Temporal Graph (STG) scenarios. To tackle these challenges, we propose a new spatio-temporal contrastive learning (CL4ST) framework to encode robust and",
    "path": "papers/23/10/2310.17678.json",
    "total_tokens": 876,
    "translated_title": "时空元对比学习",
    "translated_abstract": "时空预测在包括交通预测和犯罪预测在内的多个现实应用中至关重要，旨在提高公共交通和安全管理。许多最先进的模型展示了时空图神经网络（STGNN）捕捉复杂时空相关性的强大能力。然而，尽管它们的有效性，现有方法没有充分解决一些关键问题。数据质量问题，如数据稀缺和稀疏性，导致数据噪音和缺乏监督信号，极大限制了STGNN的性能。虽然近期引入了对比学习的STGNN模型旨在解决这些挑战，但大多数模型使用预定义的数据增强策略，过于依赖于手动设计，不能针对不同的时空图（STG）场景进行定制。为了解决这些挑战，我们提出了一种新的时空对比学习（CL4ST）框架来编码健壮且",
    "tldr": "该论文介绍了一个新的时空对比学习（CL4ST）框架，通过解决数据质量问题和个性化数据增强策略的挑战，提高了时空图神经网络的性能。"
}