{
    "title": "ChatRadio-Valuer: A Chat Large Language Model for Generalizable Radiology Report Generation Based on Multi-institution and Multi-system Data. (arXiv:2310.05242v2 [cs.CL] UPDATED)",
    "abstract": "Radiology report generation, as a key step in medical image analysis, is critical to the quantitative analysis of clinically informed decision-making levels. However, complex and diverse radiology reports with cross-source heterogeneity pose a huge generalizability challenge to the current methods under massive data volume, mainly because the style and normativity of radiology reports are obviously distinctive among institutions, body regions inspected and radiologists. Recently, the advent of large language models (LLM) offers great potential for recognizing signs of health conditions. To resolve the above problem, we collaborate with the Second Xiangya Hospital in China and propose ChatRadio-Valuer based on the LLM, a tailored model for automatic radiology report generation that learns generalizable representations and provides a basis pattern for model adaptation in sophisticated analysts' cases. Specifically, ChatRadio-Valuer is trained based on the radiology reports from a single ",
    "link": "http://arxiv.org/abs/2310.05242",
    "context": "Title: ChatRadio-Valuer: A Chat Large Language Model for Generalizable Radiology Report Generation Based on Multi-institution and Multi-system Data. (arXiv:2310.05242v2 [cs.CL] UPDATED)\nAbstract: Radiology report generation, as a key step in medical image analysis, is critical to the quantitative analysis of clinically informed decision-making levels. However, complex and diverse radiology reports with cross-source heterogeneity pose a huge generalizability challenge to the current methods under massive data volume, mainly because the style and normativity of radiology reports are obviously distinctive among institutions, body regions inspected and radiologists. Recently, the advent of large language models (LLM) offers great potential for recognizing signs of health conditions. To resolve the above problem, we collaborate with the Second Xiangya Hospital in China and propose ChatRadio-Valuer based on the LLM, a tailored model for automatic radiology report generation that learns generalizable representations and provides a basis pattern for model adaptation in sophisticated analysts' cases. Specifically, ChatRadio-Valuer is trained based on the radiology reports from a single ",
    "path": "papers/23/10/2310.05242.json",
    "total_tokens": 926,
    "translated_title": "ChatRadio-Valuer: 一种基于多机构和多系统数据的通用放射学报告自动生成的聊天大型语言模型",
    "translated_abstract": "放射学报告生成是医学图像分析的关键步骤，对临床决策水平的定量分析至关重要。然而，具有交叉来源异质性的复杂多样的放射学报告对当前方法在大规模数据量下的泛化能力提出了巨大挑战，主要是因为放射学报告的风格和规范性在机构、检查部位和放射科医生之间明显有所不同。最近，大型语言模型（LLM）的出现为识别健康状况的迹象提供了巨大的潜力。为了解决上述问题，我们与中国的湘雅二医院合作，提出了基于LLM的ChatRadio-Valuer，这是一种专门用于自动化放射学报告生成的定制模型，它可以学习可泛化的表示并为复杂分析师案例中的模型自适应提供基本模式。",
    "tldr": "ChatRadio-Valuer是一种基于大型语言模型的定制模型，用于通用放射学报告自动生成。它能够学习可泛化的表示并为模型自适应提供基础模式，解决了放射学报告中的泛化能力和异质性问题。"
}