{
    "title": "Analyzing the contribution of different passively collected data to predict Stress and Depression. (arXiv:2310.13607v1 [cs.LG])",
    "abstract": "The possibility of recognizing diverse aspects of human behavior and environmental context from passively captured data motivates its use for mental health assessment. In this paper, we analyze the contribution of different passively collected sensor data types (WiFi, GPS, Social interaction, Phone Log, Physical Activity, Audio, and Academic features) to predict daily selfreport stress and PHQ-9 depression score. First, we compute 125 mid-level features from the original raw data. These 125 features include groups of features from the different sensor data types. Then, we evaluate the contribution of each feature type by comparing the performance of Neural Network models trained with all features against Neural Network models trained with specific feature groups. Our results show that WiFi features (which encode mobility patterns) and Phone Log features (which encode information correlated with sleep patterns), provide significative information for stress and depression prediction.",
    "link": "http://arxiv.org/abs/2310.13607",
    "context": "Title: Analyzing the contribution of different passively collected data to predict Stress and Depression. (arXiv:2310.13607v1 [cs.LG])\nAbstract: The possibility of recognizing diverse aspects of human behavior and environmental context from passively captured data motivates its use for mental health assessment. In this paper, we analyze the contribution of different passively collected sensor data types (WiFi, GPS, Social interaction, Phone Log, Physical Activity, Audio, and Academic features) to predict daily selfreport stress and PHQ-9 depression score. First, we compute 125 mid-level features from the original raw data. These 125 features include groups of features from the different sensor data types. Then, we evaluate the contribution of each feature type by comparing the performance of Neural Network models trained with all features against Neural Network models trained with specific feature groups. Our results show that WiFi features (which encode mobility patterns) and Phone Log features (which encode information correlated with sleep patterns), provide significative information for stress and depression prediction.",
    "path": "papers/23/10/2310.13607.json",
    "total_tokens": 880,
    "translated_title": "分析不同被动收集的数据对于预测压力和抑郁的贡献",
    "translated_abstract": "从被动捕获的数据中识别人类行为和环境背景的可能性推动了其在心理健康评估中的使用。本文分析了不同被动收集传感器数据类型（WiFi、GPS、社交互动、电话日志、体力活动、音频和学术特征）对于预测每日的自我报告压力和PHQ-9抑郁得分的贡献。首先，我们从原始原始数据中计算出125个中级特征。这些125个特征包括来自不同传感器数据类型的特征组。然后，我们通过比较使用所有特征训练的神经网络模型与使用特定特征组训练的神经网络模型的性能，来评估每个特征类型的贡献。我们的结果表明，WiFi特征（编码移动模式）和电话日志特征（编码与睡眠模式相关的信息）为压力和抑郁预测提供了显著的信息。",
    "tldr": "本研究分析了不同的被动收集数据类型对于预测压力和抑郁的贡献。结果显示，WiFi特征和电话日志特征对于压力和抑郁预测非常重要。",
    "en_tdlr": "This paper analyzes the contribution of different types of passively collected data to predict stress and depression. The results show that WiFi features and phone log features play a significant role in stress and depression prediction."
}