{
    "title": "Efficient Bayesian Learning Curve Extrapolation using Prior-Data Fitted Networks. (arXiv:2310.20447v1 [cs.LG])",
    "abstract": "Learning curve extrapolation aims to predict model performance in later epochs of training, based on the performance in earlier epochs. In this work, we argue that, while the inherent uncertainty in the extrapolation of learning curves warrants a Bayesian approach, existing methods are (i) overly restrictive, and/or (ii) computationally expensive. We describe the first application of prior-data fitted neural networks (PFNs) in this context. A PFN is a transformer, pre-trained on data generated from a prior, to perform approximate Bayesian inference in a single forward pass. We propose LC-PFN, a PFN trained to extrapolate 10 million artificial right-censored learning curves generated from a parametric prior proposed in prior art using MCMC. We demonstrate that LC-PFN can approximate the posterior predictive distribution more accurately than MCMC, while being over 10 000 times faster. We also show that the same LC-PFN achieves competitive performance extrapolating a total of 20 000 real ",
    "link": "http://arxiv.org/abs/2310.20447",
    "context": "Title: Efficient Bayesian Learning Curve Extrapolation using Prior-Data Fitted Networks. (arXiv:2310.20447v1 [cs.LG])\nAbstract: Learning curve extrapolation aims to predict model performance in later epochs of training, based on the performance in earlier epochs. In this work, we argue that, while the inherent uncertainty in the extrapolation of learning curves warrants a Bayesian approach, existing methods are (i) overly restrictive, and/or (ii) computationally expensive. We describe the first application of prior-data fitted neural networks (PFNs) in this context. A PFN is a transformer, pre-trained on data generated from a prior, to perform approximate Bayesian inference in a single forward pass. We propose LC-PFN, a PFN trained to extrapolate 10 million artificial right-censored learning curves generated from a parametric prior proposed in prior art using MCMC. We demonstrate that LC-PFN can approximate the posterior predictive distribution more accurately than MCMC, while being over 10 000 times faster. We also show that the same LC-PFN achieves competitive performance extrapolating a total of 20 000 real ",
    "path": "papers/23/10/2310.20447.json",
    "total_tokens": 845,
    "translated_title": "使用先验数据拟合神经网络进行高效贝叶斯学习曲线外推",
    "translated_abstract": "学习曲线外推旨在基于早期训练阶段的表现来预测模型在后期训练中的性能。本文认为，虽然学习曲线外推中的固有不确定性需要采用贝叶斯方法，但现有方法要么过于限制，要么计算成本过高。我们首次在这个领域应用了先验数据拟合神经网络（PFN）。PFN是一个在先验数据上进行预训练的转换器，通过一次前向传递进行近似贝叶斯推断。我们提出了LC-PFN，一个通过MCMC在先前文献中提出的参数化先验生成的1000万条人造右截尾学习曲线进行训练的PFN。我们证明LC-PFN比MCMC更准确地近似后验预测分布，并且速度快了超过10,000倍。我们还展示了相同的LC-PFN在外推总共20,000条真实学习曲线时具有竞争性能。",
    "tldr": "本文提出了一种使用先验数据拟合神经网络进行高效贝叶斯学习曲线外推的方法，该方法相比现有方法更准确且速度更快。"
}