{
    "title": "Spectral operator learning for parametric PDEs without data reliance. (arXiv:2310.02013v1 [cs.LG])",
    "abstract": "In this paper, we introduce the Spectral Coefficient Learning via Operator Network (SCLON), a novel operator learning-based approach for solving parametric partial differential equations (PDEs) without the need for data harnessing. The cornerstone of our method is the spectral methodology that employs expansions using orthogonal functions, such as Fourier series and Legendre polynomials, enabling accurate PDE solutions with fewer grid points. By merging the merits of spectral methods - encompassing high accuracy, efficiency, generalization, and the exact fulfillment of boundary conditions with the prowess of deep neural networks, SCLON offers a transformative strategy. Our approach not only eliminates the need for paired input-output training data, which typically requires extensive numerical computations, but also effectively learns and predicts solutions of complex parametric PDEs, ranging from singularly perturbed convection-diffusion equations to the Navier-Stokes equations. The ",
    "link": "http://arxiv.org/abs/2310.02013",
    "context": "Title: Spectral operator learning for parametric PDEs without data reliance. (arXiv:2310.02013v1 [cs.LG])\nAbstract: In this paper, we introduce the Spectral Coefficient Learning via Operator Network (SCLON), a novel operator learning-based approach for solving parametric partial differential equations (PDEs) without the need for data harnessing. The cornerstone of our method is the spectral methodology that employs expansions using orthogonal functions, such as Fourier series and Legendre polynomials, enabling accurate PDE solutions with fewer grid points. By merging the merits of spectral methods - encompassing high accuracy, efficiency, generalization, and the exact fulfillment of boundary conditions with the prowess of deep neural networks, SCLON offers a transformative strategy. Our approach not only eliminates the need for paired input-output training data, which typically requires extensive numerical computations, but also effectively learns and predicts solutions of complex parametric PDEs, ranging from singularly perturbed convection-diffusion equations to the Navier-Stokes equations. The ",
    "path": "papers/23/10/2310.02013.json",
    "total_tokens": 789,
    "translated_title": "无需数据依赖的参数PDE的光谱算子学习",
    "translated_abstract": "本文介绍了一种名为SCLON的基于算子学习的新方法，用于解决参数化偏微分方程（PDE），而无需利用数据。我们方法的核心是采用光谱方法，利用正交函数（如傅里叶级数和Legendre多项式）进行展开，从而能够在更少的网格点上实现准确的PDE解。通过将光谱方法的优点与深度神经网络的能力相结合，SCLON提供了一种革命性的策略。我们的方法不仅消除了通常需要大量数值计算的成对输入-输出训练数据的需求，还有效地学习和预测复杂参数化PDE的解，从奇异摄动对流扩散方程到Navier-Stokes方程。",
    "tldr": "这种方法通过光谱方法和深度神经网络相结合，实现了无需数据依赖的参数化PDE求解，可以准确学习和预测复杂的PDE解。",
    "en_tdlr": "This method combines spectral methods with deep neural networks to solve parametric PDEs without data reliance, enabling accurate learning and prediction of complex PDE solutions."
}