{
    "title": "SoK: Access Control Policy Generation from High-level Natural Language Requirements. (arXiv:2310.03292v1 [cs.CR])",
    "abstract": "Administrator-centered access control failures can cause data breaches, putting organizations at risk of financial loss and reputation damage. Existing graphical policy configuration tools and automated policy generation frameworks attempt to help administrators configure and generate access control policies by avoiding such failures. However, graphical policy configuration tools are prone to human errors, making them unusable. On the other hand, automated policy generation frameworks are prone to erroneous predictions, making them unreliable. Therefore, to find ways to improve their usability and reliability, we conducted a Systematic Literature Review analyzing 49 publications, to identify those tools, frameworks, and their limitations. Identifying those limitations will help develop effective access control policy generation solutions while avoiding access control failures.",
    "link": "http://arxiv.org/abs/2310.03292",
    "context": "Title: SoK: Access Control Policy Generation from High-level Natural Language Requirements. (arXiv:2310.03292v1 [cs.CR])\nAbstract: Administrator-centered access control failures can cause data breaches, putting organizations at risk of financial loss and reputation damage. Existing graphical policy configuration tools and automated policy generation frameworks attempt to help administrators configure and generate access control policies by avoiding such failures. However, graphical policy configuration tools are prone to human errors, making them unusable. On the other hand, automated policy generation frameworks are prone to erroneous predictions, making them unreliable. Therefore, to find ways to improve their usability and reliability, we conducted a Systematic Literature Review analyzing 49 publications, to identify those tools, frameworks, and their limitations. Identifying those limitations will help develop effective access control policy generation solutions while avoiding access control failures.",
    "path": "papers/23/10/2310.03292.json",
    "total_tokens": 829,
    "translated_title": "Sok：从高级自然语言要求生成访问控制策略",
    "translated_abstract": "管理员中心的访问控制失败可能会导致数据泄露，使组织面临财务损失和声誉损害的风险。现有的图形化策略配置工具和自动策略生成框架试图通过避免此类故障来帮助管理员配置和生成访问控制策略。然而，图形化策略配置工具容易出现人为错误，使其无法使用。另一方面，自动策略生成框架容易发生错误预测，使其不可靠。因此，为了寻找改进其可用性和可靠性的方法，我们进行了一项系统文献综述，分析了49篇文章，以识别这些工具、框架及其限制。识别这些限制将有助于开发有效的访问控制策略生成解决方案，同时避免访问控制失败。",
    "tldr": "该论文分析了49篇文章，并总结了现有图形化策略配置工具和自动策略生成框架的局限性。研究的目的是开发更有效的访问控制策略生成解决方案，避免访问控制失败。"
}