{
    "title": "GNNEvaluator: Evaluating GNN Performance On Unseen Graphs Without Labels. (arXiv:2310.14586v2 [cs.LG] UPDATED)",
    "abstract": "Evaluating the performance of graph neural networks (GNNs) is an essential task for practical GNN model deployment and serving, as deployed GNNs face significant performance uncertainty when inferring on unseen and unlabeled test graphs, due to mismatched training-test graph distributions. In this paper, we study a new problem, GNN model evaluation, that aims to assess the performance of a specific GNN model trained on labeled and observed graphs, by precisely estimating its performance (e.g., node classification accuracy) on unseen graphs without labels. Concretely, we propose a two-stage GNN model evaluation framework, including (1) DiscGraph set construction and (2) GNNEvaluator training and inference. The DiscGraph set captures wide-range and diverse graph data distribution discrepancies through a discrepancy measurement function, which exploits the outputs of GNNs related to latent node embeddings and node class predictions. Under the effective training supervision from the DiscGr",
    "link": "http://arxiv.org/abs/2310.14586",
    "context": "Title: GNNEvaluator: Evaluating GNN Performance On Unseen Graphs Without Labels. (arXiv:2310.14586v2 [cs.LG] UPDATED)\nAbstract: Evaluating the performance of graph neural networks (GNNs) is an essential task for practical GNN model deployment and serving, as deployed GNNs face significant performance uncertainty when inferring on unseen and unlabeled test graphs, due to mismatched training-test graph distributions. In this paper, we study a new problem, GNN model evaluation, that aims to assess the performance of a specific GNN model trained on labeled and observed graphs, by precisely estimating its performance (e.g., node classification accuracy) on unseen graphs without labels. Concretely, we propose a two-stage GNN model evaluation framework, including (1) DiscGraph set construction and (2) GNNEvaluator training and inference. The DiscGraph set captures wide-range and diverse graph data distribution discrepancies through a discrepancy measurement function, which exploits the outputs of GNNs related to latent node embeddings and node class predictions. Under the effective training supervision from the DiscGr",
    "path": "papers/23/10/2310.14586.json",
    "total_tokens": 977,
    "translated_title": "GNNEvaluator: 在没有标签的未知图上评估GNN性能",
    "translated_abstract": "评估图神经网络（GNN）的性能是实际应用GNN模型和服务的重要任务，因为部署的GNN在推断未知和无标签测试图时面临着显著的性能不确定性，这是由于训练-测试图分布不匹配所造成的。本文研究了一个新的问题，即GNN模型评估，旨在通过精确估计其在没有标签的未知图上的性能（如节点分类准确性），来评估在带标签和观察到的图上训练的特定GNN模型的性能。具体而言，我们提出了一个包括DiscGraph集合构建和GNNEvaluator训练和推断两个阶段的GNN模型评估框架。DiscGraph集合通过利用与潜在节点嵌入和节点类别预测相关的GNN输出的差异度量函数，捕捉了广泛和多样的图数据分布差异。在DiscGr的有效训练监督下。我们的方法在多个数据集上进行了实验，并与现有的GNN评估方法进行了比较。实验结果表明，我们的方法能够准确地评估GNN模型在没有标签的未知图上的性能。",
    "tldr": "本论文研究了GNN模型评估的新问题，提出了一个包括DiscGraph集合构建和GNNEvaluator训练和推断两个阶段的GNN模型评估框架，能够在没有标签的未知图上准确评估GNN模型的性能。",
    "en_tdlr": "This paper investigates a new problem of GNN model evaluation and proposes a two-stage evaluation framework, including DiscGraph set construction and GNNEvaluator training and inference, which accurately assesses the performance of GNN models on unseen graphs without labels."
}