{
    "title": "Mixed-Variable Global Sensitivity Analysis For Knowledge Discovery And Efficient Combinatorial Materials Design. (arXiv:2310.15124v1 [stat.ML])",
    "abstract": "Global Sensitivity Analysis (GSA) is the study of the influence of any given inputs on the outputs of a model. In the context of engineering design, GSA has been widely used to understand both individual and collective contributions of design variables on the design objectives. So far, global sensitivity studies have often been limited to design spaces with only quantitative (numerical) design variables. However, many engineering systems also contain, if not only, qualitative (categorical) design variables in addition to quantitative design variables. In this paper, we integrate Latent Variable Gaussian Process (LVGP) with Sobol' analysis to develop the first metamodel-based mixed-variable GSA method. Through numerical case studies, we validate and demonstrate the effectiveness of our proposed method for mixed-variable problems. Furthermore, while the proposed GSA method is general enough to benefit various engineering design applications, we integrate it with multi-objective Bayesian ",
    "link": "http://arxiv.org/abs/2310.15124",
    "context": "Title: Mixed-Variable Global Sensitivity Analysis For Knowledge Discovery And Efficient Combinatorial Materials Design. (arXiv:2310.15124v1 [stat.ML])\nAbstract: Global Sensitivity Analysis (GSA) is the study of the influence of any given inputs on the outputs of a model. In the context of engineering design, GSA has been widely used to understand both individual and collective contributions of design variables on the design objectives. So far, global sensitivity studies have often been limited to design spaces with only quantitative (numerical) design variables. However, many engineering systems also contain, if not only, qualitative (categorical) design variables in addition to quantitative design variables. In this paper, we integrate Latent Variable Gaussian Process (LVGP) with Sobol' analysis to develop the first metamodel-based mixed-variable GSA method. Through numerical case studies, we validate and demonstrate the effectiveness of our proposed method for mixed-variable problems. Furthermore, while the proposed GSA method is general enough to benefit various engineering design applications, we integrate it with multi-objective Bayesian ",
    "path": "papers/23/10/2310.15124.json",
    "total_tokens": 854,
    "translated_title": "混合变量全局敏感性分析用于知识发现和高效的组合材料设计",
    "translated_abstract": "全局敏感性分析（GSA）是研究任何给定输入对模型输出的影响的研究。在工程设计的背景下，GSA已被广泛用于理解设计变量对设计目标的单个和集体贡献。到目前为止，全局敏感性研究通常局限于只有定量（数字）设计变量的设计空间。然而，许多工程系统除了定量设计变量外，还包含有质量（分类）设计变量。在本文中，我们将潜变量高斯过程（LVGP）与Sobol分析相结合，开发了第一个基于元模型的混合变量GSA方法。通过数值案例研究，我们验证和证明了我们提出的混合变量问题的方法的有效性。此外，虽然所提出的GSA方法足够通用，可以用于各种工程设计应用，但我们将其与多目标贝叶斯方法相结合。",
    "tldr": "本论文针对工程设计中存在的混合变量问题，开发了一种基于元模型的混合变量全局敏感性分析方法，通过数值案例研究验证了该方法的有效性。",
    "en_tdlr": "This paper presents a metamodel-based mixed-variable global sensitivity analysis method for engineering design, which has been validated through numerical case studies."
}