{
    "title": "Pre-trained Recommender Systems: A Causal Debiasing Perspective. (arXiv:2310.19251v3 [cs.IR] UPDATED)",
    "abstract": "Recent studies on pre-trained vision/language models have demonstrated the practical benefit of a new, promising solution-building paradigm in AI where models can be pre-trained on broad data describing a generic task space and then adapted successfully to solve a wide range of downstream tasks, even when training data is severely limited (e.g., in zero- or few-shot learning scenarios). Inspired by such progress, we investigate in this paper the possibilities and challenges of adapting such a paradigm to the context of recommender systems, which is less investigated from the perspective of pre-trained model. In particular, we propose to develop a generic recommender that captures universal interaction patterns by training on generic user-item interaction data extracted from different domains, which can then be fast adapted to improve few-shot learning performance in unseen new domains (with limited data).  However, unlike vision/language data which share strong conformity in the semant",
    "link": "http://arxiv.org/abs/2310.19251",
    "context": "Title: Pre-trained Recommender Systems: A Causal Debiasing Perspective. (arXiv:2310.19251v3 [cs.IR] UPDATED)\nAbstract: Recent studies on pre-trained vision/language models have demonstrated the practical benefit of a new, promising solution-building paradigm in AI where models can be pre-trained on broad data describing a generic task space and then adapted successfully to solve a wide range of downstream tasks, even when training data is severely limited (e.g., in zero- or few-shot learning scenarios). Inspired by such progress, we investigate in this paper the possibilities and challenges of adapting such a paradigm to the context of recommender systems, which is less investigated from the perspective of pre-trained model. In particular, we propose to develop a generic recommender that captures universal interaction patterns by training on generic user-item interaction data extracted from different domains, which can then be fast adapted to improve few-shot learning performance in unseen new domains (with limited data).  However, unlike vision/language data which share strong conformity in the semant",
    "path": "papers/23/10/2310.19251.json",
    "total_tokens": 893,
    "translated_title": "预训练推荐系统：一种因果去偏见的视角",
    "translated_abstract": "最近对于预训练的视觉/语言模型的研究表明了一种新的、有前景的解决方案建立范式在人工智能领域，其中模型可以在广泛描述通用任务空间的数据上进行预训练，然后成功地适应解决各种下游任务，即使训练数据非常有限（如在零样本学习或少样本学习场景中）。受到这样的进展的启发，我们在本文中研究了将这种范式调整到推荐系统领域的可能性和挑战，这一领域在预训练模型的视角下较少被调查。特别是，我们提出开发一种通用推荐系统，通过对从不同领域中提取的通用用户-物品交互数据进行训练，捕捉到通用的交互模式，然后可以快速适应提升少样本学习性能，在未知新领域（数据有限）中发挥作用。",
    "tldr": "本文探讨了将预训练模型的范式应用于推荐系统的可能性和挑战，提出开发一种通用推荐系统，可以用于少样本学习，并在未知新领域中快速适应，以提高性能。",
    "en_tdlr": "This paper investigates the possibilities and challenges of applying the pre-trained model paradigm to recommender systems, proposing the development of a generic recommender that can be fast adapted for few-shot learning and improve performance in unknown new domains."
}