{
    "title": "HierCas: Hierarchical Temporal Graph Attention Networks for Popularity Prediction in Information Cascades. (arXiv:2310.13219v1 [cs.SI])",
    "abstract": "Information cascade popularity prediction is critical for many applications, including but not limited to identifying fake news and accurate recommendations. Traditional feature-based methods heavily rely on handcrafted features, which are domain-specific and lack generalizability to new domains. To address this problem, researchers have turned to neural network-based approaches. However, existing methods follow a sampling-based modeling approach, potentially losing continuous dynamic information and structural-temporal dependencies that emerge during the information diffusion process. In this paper, we propose a novel framework called Hierarchical Temporal Graph Attention Networks for cascade popularity prediction (HierCas). Unlike existing methods, HierCas operates on the entire cascade graph by a dynamic graph modeling approach, enabling it to capture the full range of continuous dynamic information and explicitly model the interplay between structural and temporal factors. By lever",
    "link": "http://arxiv.org/abs/2310.13219",
    "context": "Title: HierCas: Hierarchical Temporal Graph Attention Networks for Popularity Prediction in Information Cascades. (arXiv:2310.13219v1 [cs.SI])\nAbstract: Information cascade popularity prediction is critical for many applications, including but not limited to identifying fake news and accurate recommendations. Traditional feature-based methods heavily rely on handcrafted features, which are domain-specific and lack generalizability to new domains. To address this problem, researchers have turned to neural network-based approaches. However, existing methods follow a sampling-based modeling approach, potentially losing continuous dynamic information and structural-temporal dependencies that emerge during the information diffusion process. In this paper, we propose a novel framework called Hierarchical Temporal Graph Attention Networks for cascade popularity prediction (HierCas). Unlike existing methods, HierCas operates on the entire cascade graph by a dynamic graph modeling approach, enabling it to capture the full range of continuous dynamic information and explicitly model the interplay between structural and temporal factors. By lever",
    "path": "papers/23/10/2310.13219.json",
    "total_tokens": 869,
    "translated_title": "HierCas: 信息级联中的分层时序图注意力网络用于流行度预测",
    "translated_abstract": "信息级联流行度预测对于识别假新闻和精准推荐等许多应用非常重要。传统基于特征的方法严重依赖手工特征，这些特征是特定领域的，缺乏对新领域的泛化能力。为了解决这个问题，研究人员转向了基于神经网络的方法。然而，现有的方法采用采样建模方法，可能丢失信息扩散过程中出现的连续动态信息和结构-时间依赖关系。在本文中，我们提出了一种名为HierCas的新框架，用于级联流行度预测，它采用动态图建模方法，在整个级联图上进行操作，能够捕捉到连续动态信息的完整范围，并明确建模结构和时间因素之间的相互作用。",
    "tldr": "本论文提出了一种名为HierCas的新的框架，用于信息级联流行度预测。与传统方法不同，HierCas采用动态图建模方法，在整个级联图上进行操作，能够捕捉到连续动态信息的完整范围，并明确建模结构和时间因素之间的相互作用。",
    "en_tdlr": "This paper proposes a new framework called HierCas for predicting popularity in information cascades. Unlike traditional methods, HierCas operates on the entire cascade graph and captures the full range of continuous dynamic information, explicitly modeling the interplay between structural and temporal factors."
}