{
    "title": "Networkwide Traffic State Forecasting Using Exogenous Information: A Multi-Dimensional Graph Attention-Based Approach. (arXiv:2310.12353v1 [cs.LG])",
    "abstract": "Traffic state forecasting is crucial for traffic management and control strategies, as well as user- and system-level decision making in the transportation network. While traffic forecasting has been approached with a variety of techniques over the last couple of decades, most approaches simply rely on endogenous traffic variables for state prediction, despite the evidence that exogenous factors can significantly impact traffic conditions. This paper proposes a multi-dimensional spatio-temporal graph attention-based traffic prediction approach (M-STGAT), which predicts traffic based on past observations of speed, along with lane closure events, temperature, and visibility across the transportation network. The approach is based on a graph attention network architecture, which also learns based on the structure of the transportation network on which these variables are observed. Numerical experiments are performed using traffic speed and lane closure data from the California Department ",
    "link": "http://arxiv.org/abs/2310.12353",
    "context": "Title: Networkwide Traffic State Forecasting Using Exogenous Information: A Multi-Dimensional Graph Attention-Based Approach. (arXiv:2310.12353v1 [cs.LG])\nAbstract: Traffic state forecasting is crucial for traffic management and control strategies, as well as user- and system-level decision making in the transportation network. While traffic forecasting has been approached with a variety of techniques over the last couple of decades, most approaches simply rely on endogenous traffic variables for state prediction, despite the evidence that exogenous factors can significantly impact traffic conditions. This paper proposes a multi-dimensional spatio-temporal graph attention-based traffic prediction approach (M-STGAT), which predicts traffic based on past observations of speed, along with lane closure events, temperature, and visibility across the transportation network. The approach is based on a graph attention network architecture, which also learns based on the structure of the transportation network on which these variables are observed. Numerical experiments are performed using traffic speed and lane closure data from the California Department ",
    "path": "papers/23/10/2310.12353.json",
    "total_tokens": 871,
    "translated_title": "使用外部信息的网络流量状态预测：一种基于多维图神经网络注意力的方法",
    "translated_abstract": "交通状态预测对交通管理和控制策略，以及交通网络的用户和系统级决策至关重要。尽管在过去的几十年里，交通预测已经用多种技术进行了研究，但大多数方法仅依赖内生交通变量进行状态预测，尽管有证据表明外生因素可以显著影响交通状况。本文提出了一种基于多维时空图神经网络注意力的交通预测方法（M-STGAT），它根据过去观测到的速度、车道封闭事件、温度和可视性来预测交通情况。该方法基于一个注意力图神经网络结构，还根据观察到这些变量的交通网络的结构进行学习。通过使用来自加利福尼亚州交通部的交通速度和车道封闭数据进行数值实验。",
    "tldr": "本文提出了一种基于多维图神经网络注意力的交通预测方法，利用过去观测到的速度、车道封闭事件、温度和可视性来预测交通情况。该方法基于交通网络结构进行学习，展示了较好的实验结果。",
    "en_tdlr": "This paper proposes a multi-dimensional graph attention-based approach for traffic prediction, which utilizes past observations of speed, lane closure events, temperature, and visibility. The approach learns based on the structure of the transportation network and shows promising experimental results."
}