{
    "title": "Long-form Simultaneous Speech Translation: Thesis Proposal. (arXiv:2310.11141v1 [cs.CL])",
    "abstract": "Simultaneous speech translation (SST) aims to provide real-time translation of spoken language, even before the speaker finishes their sentence. Traditionally, SST has been addressed primarily by cascaded systems that decompose the task into subtasks, including speech recognition, segmentation, and machine translation. However, the advent of deep learning has sparked significant interest in end-to-end (E2E) systems. Nevertheless, a major limitation of most approaches to E2E SST reported in the current literature is that they assume that the source speech is pre-segmented into sentences, which is a significant obstacle for practical, real-world applications. This thesis proposal addresses end-to-end simultaneous speech translation, particularly in the long-form setting, i.e., without pre-segmentation. We present a survey of the latest advancements in E2E SST, assess the primary obstacles in SST and its relevance to long-form scenarios, and suggest approaches to tackle these challenges.",
    "link": "http://arxiv.org/abs/2310.11141",
    "context": "Title: Long-form Simultaneous Speech Translation: Thesis Proposal. (arXiv:2310.11141v1 [cs.CL])\nAbstract: Simultaneous speech translation (SST) aims to provide real-time translation of spoken language, even before the speaker finishes their sentence. Traditionally, SST has been addressed primarily by cascaded systems that decompose the task into subtasks, including speech recognition, segmentation, and machine translation. However, the advent of deep learning has sparked significant interest in end-to-end (E2E) systems. Nevertheless, a major limitation of most approaches to E2E SST reported in the current literature is that they assume that the source speech is pre-segmented into sentences, which is a significant obstacle for practical, real-world applications. This thesis proposal addresses end-to-end simultaneous speech translation, particularly in the long-form setting, i.e., without pre-segmentation. We present a survey of the latest advancements in E2E SST, assess the primary obstacles in SST and its relevance to long-form scenarios, and suggest approaches to tackle these challenges.",
    "path": "papers/23/10/2310.11141.json",
    "total_tokens": 913,
    "translated_title": "Simultaneous Speech Translation in Long-Form Setting: Thesis Proposal",
    "translated_abstract": "同传技术旨在实时将口语翻译成其他语言，甚至在说话人未完成句子之前即可实现翻译。传统上，同传主要通过级联系统来处理，将任务分解为语音识别、分割和机器翻译等子任务。然而，深度学习的出现引发了对端到端系统的广泛兴趣。然而，当前文献中大多数端到端同传方法的一个主要限制是它们假设源语音已经被预先分割成句子，这对于实际应用和真实世界中的场景是一个重要障碍。这个论文提案着重于处理端到端长篇同传问题，即在没有预先分割的情况下进行翻译。我们介绍了最新的端到端同传进展的调查，评估了同传中的主要障碍以及与长篇场景的相关性，并提出了解决这些挑战的方法。",
    "tldr": "这个论文提案研究了端到端长篇同传，即在没有预先分割的情况下进行实时口语翻译。它调查了最新的端到端同传进展，评估了同传中的主要障碍和与长篇场景的相关性，并提出了解决这些挑战的方法。",
    "en_tdlr": "This thesis proposal focuses on end-to-end simultaneous speech translation in the long-form setting, without pre-segmentation. It surveys the latest advancements in this area, evaluates the primary challenges in simultaneous speech translation and its relevance to long-form scenarios, and suggests approaches to address these challenges."
}