{
    "title": "Quantifying the relative importance of the spatial and temporal resolution in energy systems optimisation model. (arXiv:2310.10518v1 [q-fin.CP])",
    "abstract": "An increasing number of studies using energy system optimisation models are conducted with higher spatial and temporal resolution. This comes with a computational cost which places a limit on the size, complexity, and detail of the model. In this paper, we explore the relative importance of structural aspects of energy system models, spatial and temporal resolution, compared to uncertainties in input parameters such as final energy demand, discount rate and capital costs. We use global sensitivity analysis to uncover these interactions for two developing countries, Kenya, and Benin, which still lack universal access to electricity. We find that temporal resolution has a high influence on all assessed results parameters, and spatial resolution has a significant influence on the expansion of distribution lines to the unelectrified population. The larger overall influence of temporal resolution indicates that this should be prioritised compared to spatial resolution.",
    "link": "http://arxiv.org/abs/2310.10518",
    "context": "Title: Quantifying the relative importance of the spatial and temporal resolution in energy systems optimisation model. (arXiv:2310.10518v1 [q-fin.CP])\nAbstract: An increasing number of studies using energy system optimisation models are conducted with higher spatial and temporal resolution. This comes with a computational cost which places a limit on the size, complexity, and detail of the model. In this paper, we explore the relative importance of structural aspects of energy system models, spatial and temporal resolution, compared to uncertainties in input parameters such as final energy demand, discount rate and capital costs. We use global sensitivity analysis to uncover these interactions for two developing countries, Kenya, and Benin, which still lack universal access to electricity. We find that temporal resolution has a high influence on all assessed results parameters, and spatial resolution has a significant influence on the expansion of distribution lines to the unelectrified population. The larger overall influence of temporal resolution indicates that this should be prioritised compared to spatial resolution.",
    "path": "papers/23/10/2310.10518.json",
    "total_tokens": 894,
    "translated_title": "评估能源系统优化模型中空间和时间分辨率的相对重要性",
    "translated_abstract": "越来越多的能源系统优化模型研究采用更高的空间和时间分辨率进行。但这会增加计算成本，对模型的规模、复杂性和细节设定有一定限制。在本文中，我们探讨了能源系统模型的结构方面，如空间和时间分辨率与输入参数的不确定性（如最终能源需求、折现率和资本成本）之间的相对重要性。我们使用全局敏感性分析揭示了这些交互作用，并以肯尼亚和贝宁这两个仍然缺乏普及供电的发展中国家为例。我们发现，时间分辨率对所有考察结果参数都具有较大影响，而空间分辨率则对覆盖未电气化人口的配电线路扩建具有显著影响。总体来看，时间分辨率的整体影响更大，因此应优先考虑时间分辨率。",
    "tldr": "该研究评估了能源系统优化模型中空间和时间分辨率的相对重要性，并发现时间分辨率对所有结果参数具有较大影响，而空间分辨率则主要影响配电线路扩建。因此，应优先考虑提高时间分辨率。"
}