{
    "title": "Towards a Better Understanding of Variations in Zero-Shot Neural Machine Translation Performance. (arXiv:2310.10385v2 [cs.CL] UPDATED)",
    "abstract": "Multilingual Neural Machine Translation (MNMT) facilitates knowledge sharing but often suffers from poor zero-shot (ZS) translation qualities. While prior work has explored the causes of overall low ZS performance, our work introduces a fresh perspective: the presence of high variations in ZS performance. This suggests that MNMT does not uniformly exhibit poor ZS capability; instead, certain translation directions yield reasonable results. Through systematic experimentation involving 1,560 language directions spanning 40 languages, we identify three key factors contributing to high variations in ZS NMT performance: 1) target side translation capability 2) vocabulary overlap 3) linguistic properties. Our findings highlight that the target side translation quality is the most influential factor, with vocabulary overlap consistently impacting ZS performance. Additionally, linguistic properties, such as language family and writing system, play a role, particularly with smaller models. Furt",
    "link": "http://arxiv.org/abs/2310.10385",
    "context": "Title: Towards a Better Understanding of Variations in Zero-Shot Neural Machine Translation Performance. (arXiv:2310.10385v2 [cs.CL] UPDATED)\nAbstract: Multilingual Neural Machine Translation (MNMT) facilitates knowledge sharing but often suffers from poor zero-shot (ZS) translation qualities. While prior work has explored the causes of overall low ZS performance, our work introduces a fresh perspective: the presence of high variations in ZS performance. This suggests that MNMT does not uniformly exhibit poor ZS capability; instead, certain translation directions yield reasonable results. Through systematic experimentation involving 1,560 language directions spanning 40 languages, we identify three key factors contributing to high variations in ZS NMT performance: 1) target side translation capability 2) vocabulary overlap 3) linguistic properties. Our findings highlight that the target side translation quality is the most influential factor, with vocabulary overlap consistently impacting ZS performance. Additionally, linguistic properties, such as language family and writing system, play a role, particularly with smaller models. Furt",
    "path": "papers/23/10/2310.10385.json",
    "total_tokens": 901,
    "translated_title": "对于零样本神经机器翻译性能变化的更好理解",
    "translated_abstract": "多语言神经机器翻译（MNMT）促进了知识分享，但往往在零样本（ZS）翻译质量上表现不佳。虽然之前的研究已经探讨了整体ZS性能低下的原因，但我们的工作引入了一个新的视角：ZS性能存在较大的变化。这表明MNMT的ZS能力并不是均匀地差，而是在特定的翻译方向上产生了合理的结果。通过系统性的实验，涵盖40种语言的1,560个语言方向，我们确定了三个影响ZS NMT性能变化的关键因素：1）目标语言的翻译能力，2）词汇重叠，3）语言特性。我们的研究结果表明，目标语言的翻译质量是最有影响力的因素，词汇重叠始终影响ZS性能。此外，语言特性，如语言家族和书写系统，尤其在较小的模型中起到了一定作用。",
    "tldr": "该论文研究了零样本神经机器翻译性能变化的原因，发现目标语言的翻译质量、词汇重叠和语言特性是影响性能变化的关键因素。",
    "en_tdlr": "This paper investigates the variations in zero-shot neural machine translation performance and identifies target language translation quality, vocabulary overlap, and linguistic properties as the key factors contributing to these variations."
}