{
    "title": "Training and Predicting Visual Error for Real-Time Applications. (arXiv:2310.09125v1 [cs.GR])",
    "abstract": "Visual error metrics play a fundamental role in the quantification of perceived image similarity. Most recently, use cases for them in real-time applications have emerged, such as content-adaptive shading and shading reuse to increase performance and improve efficiency. A wide range of different metrics has been established, with the most sophisticated being capable of capturing the perceptual characteristics of the human visual system. However, their complexity, computational expense, and reliance on reference images to compare against prevent their generalized use in real-time, restricting such applications to using only the simplest available metrics. In this work, we explore the abilities of convolutional neural networks to predict a variety of visual metrics without requiring either reference or rendered images. Specifically, we train and deploy a neural network to estimate the visual error resulting from reusing shading or using reduced shading rates. The resulting models account",
    "link": "http://arxiv.org/abs/2310.09125",
    "context": "Title: Training and Predicting Visual Error for Real-Time Applications. (arXiv:2310.09125v1 [cs.GR])\nAbstract: Visual error metrics play a fundamental role in the quantification of perceived image similarity. Most recently, use cases for them in real-time applications have emerged, such as content-adaptive shading and shading reuse to increase performance and improve efficiency. A wide range of different metrics has been established, with the most sophisticated being capable of capturing the perceptual characteristics of the human visual system. However, their complexity, computational expense, and reliance on reference images to compare against prevent their generalized use in real-time, restricting such applications to using only the simplest available metrics. In this work, we explore the abilities of convolutional neural networks to predict a variety of visual metrics without requiring either reference or rendered images. Specifically, we train and deploy a neural network to estimate the visual error resulting from reusing shading or using reduced shading rates. The resulting models account",
    "path": "papers/23/10/2310.09125.json",
    "total_tokens": 896,
    "translated_title": "实时应用中的训练和预测视觉误差",
    "translated_abstract": "视觉误差度量在量化感知图像相似性中起着基本作用。最近，在实时应用中出现了它们的使用案例，如内容自适应着色和着色重用以提高性能和改善效率。已经建立了各种不同的度量标准，其中最复杂的能够捕捉到人类视觉系统的感知特征。然而，它们的复杂性、计算成本和对参考图像或渲染图像的依赖限制了它们在实时场景中的广泛使用，使得这些应用只能使用最简单的度量标准。在这项工作中，我们探索了卷积神经网络在不需要参考或渲染图像的情况下预测各种视觉度量的能力。具体而言，我们训练和部署了一个神经网络来估计重用着色或使用降低着色率导致的视觉误差。最终模型可以准确地考虑到这些因素。",
    "tldr": "本论文研究了卷积神经网络在实时应用中训练和预测视觉误差的能力，通过预测重用着色或使用降低着色率导致的视觉误差，避免了对参考或渲染图像的依赖。",
    "en_tdlr": "This paper explores the ability of convolutional neural networks to train and predict visual errors in real-time applications. By predicting visual errors resulting from reusing shading or using reduced shading rates, the reliance on reference or rendered images is avoided."
}