{
    "title": "Topological data analysis of human vowels: Persistent homologies across representation spaces. (arXiv:2310.06508v1 [cs.SD])",
    "abstract": "Topological Data Analysis (TDA) has been successfully used for various tasks in signal/image processing, from visualization to supervised/unsupervised classification. Often, topological characteristics are obtained from persistent homology theory. The standard TDA pipeline starts from the raw signal data or a representation of it. Then, it consists in building a multiscale topological structure on the top of the data using a pre-specified filtration, and finally to compute the topological signature to be further exploited. The commonly used topological signature is a persistent diagram (or transformations of it). Current research discusses the consequences of the many ways to exploit topological signatures, much less often the choice of the filtration, but to the best of our knowledge, the choice of the representation of a signal has not been the subject of any study yet. This paper attempts to provide some answers on the latter problem. To this end, we collected real audio data and bu",
    "link": "http://arxiv.org/abs/2310.06508",
    "context": "Title: Topological data analysis of human vowels: Persistent homologies across representation spaces. (arXiv:2310.06508v1 [cs.SD])\nAbstract: Topological Data Analysis (TDA) has been successfully used for various tasks in signal/image processing, from visualization to supervised/unsupervised classification. Often, topological characteristics are obtained from persistent homology theory. The standard TDA pipeline starts from the raw signal data or a representation of it. Then, it consists in building a multiscale topological structure on the top of the data using a pre-specified filtration, and finally to compute the topological signature to be further exploited. The commonly used topological signature is a persistent diagram (or transformations of it). Current research discusses the consequences of the many ways to exploit topological signatures, much less often the choice of the filtration, but to the best of our knowledge, the choice of the representation of a signal has not been the subject of any study yet. This paper attempts to provide some answers on the latter problem. To this end, we collected real audio data and bu",
    "path": "papers/23/10/2310.06508.json",
    "total_tokens": 791,
    "translated_title": "人类元音的拓扑数据分析：跨表示空间的持续同调",
    "translated_abstract": "拓扑数据分析（TDA）在信号/图像处理中已被成功应用于各种任务，包括可视化和监督/无监督分类。通常，拓扑特征是从持续同调理论中获得的。标准的TDA流程从原始信号数据或其表示开始，然后基于预定义的过滤构建多尺度拓扑结构，最后计算用于进一步利用的拓扑标记。常用的拓扑标记是持续图（或其变换）。当前的研究讨论了利用拓扑标记的多种方式的后果，但很少讨论过过滤的选择，我们所知道的，对信号表示的选择尚未成为研究的对象。本文尝试解决这个问题。为此，我们收集了真实的音频数据并建",
    "tldr": "本文研究了人类元音的拓扑数据分析，重点探讨了信号表示的选择对结果的影响。",
    "en_tdlr": "This paper investigates the topological data analysis of human vowels, with a focus on the impact of signal representation on the results."
}