{
    "title": "Towards LogiGLUE: A Brief Survey and A Benchmark for Analyzing Logical Reasoning Capabilities of Language Models",
    "abstract": "arXiv:2310.00836v3 Announce Type: replace-cross  Abstract: Logical reasoning is fundamental for humans yet presents a substantial challenge in the domain of Artificial Intelligence. Initially, researchers used Knowledge Representation and Reasoning (KR) systems that did not scale and required non-trivial manual effort. Recently, the emergence of large language models (LLMs) has demonstrated the ability to overcome various limitations of formal Knowledge Representation (KR) systems. Consequently, there's a growing interest in using LLMs for logical reasoning via natural language. This work strives to understand the proficiency of LLMs in logical reasoning by offering a brief review of the latest progress in this area; with a focus on the logical reasoning datasets, tasks, and the methods adopted to utilize LLMs for reasoning. To offer a thorough analysis, we have compiled a benchmark titled LogiGLUE. This includes 24 varied datasets encompassing deductive, abductive, and inductive reaso",
    "link": "https://arxiv.org/abs/2310.00836",
    "context": "Title: Towards LogiGLUE: A Brief Survey and A Benchmark for Analyzing Logical Reasoning Capabilities of Language Models\nAbstract: arXiv:2310.00836v3 Announce Type: replace-cross  Abstract: Logical reasoning is fundamental for humans yet presents a substantial challenge in the domain of Artificial Intelligence. Initially, researchers used Knowledge Representation and Reasoning (KR) systems that did not scale and required non-trivial manual effort. Recently, the emergence of large language models (LLMs) has demonstrated the ability to overcome various limitations of formal Knowledge Representation (KR) systems. Consequently, there's a growing interest in using LLMs for logical reasoning via natural language. This work strives to understand the proficiency of LLMs in logical reasoning by offering a brief review of the latest progress in this area; with a focus on the logical reasoning datasets, tasks, and the methods adopted to utilize LLMs for reasoning. To offer a thorough analysis, we have compiled a benchmark titled LogiGLUE. This includes 24 varied datasets encompassing deductive, abductive, and inductive reaso",
    "path": "papers/23/10/2310.00836.json",
    "total_tokens": 877,
    "translated_title": "迈向LogiGLUE：对语言模型逻辑推理能力的简要调查和基准的研究",
    "translated_abstract": "逻辑推理对人类至关重要，但在人工智能领域中却是一个重大挑战。研究人员最初使用的知识表示与推理系统并不能很好地扩展，并且需要大量手动工作。最近，大型语言模型(LLMs)的出现表明了其能够克服形式化知识表示系统的各种局限性。因此，利用自然语言进行逻辑推理的LLMs备受关注。该工作旨在通过对此领域最新进展的简要回顾来了解LLMs在逻辑推理方面的熟练程度；重点关注逻辑推理数据集、任务以及采用的利用LLMs进行推理的方法。为了提供全面的分析，我们编制了一个名为LogiGLUE的基准。其中包括24个不同的数据集，涵盖演绎、进阶和归纳推理等方面。",
    "tldr": "该研究旨在评估大型语言模型在逻辑推理中的表现，并提供了名为LogiGLUE的基准，以研究逻辑推理数据集、任务和利用语言模型进行推理的方法。"
}