{
    "title": "Program Synthesis with Best-First Bottom-Up Search. (arXiv:2310.04327v1 [cs.LG])",
    "abstract": "Cost-guided bottom-up search (BUS) algorithms use a cost function to guide the search to solve program synthesis tasks. In this paper, we show that current state-of-the-art cost-guided BUS algorithms suffer from a common problem: they can lose useful information given by the model and fail to perform the search in a best-first order according to a cost function. We introduce a novel best-first bottom-up search algorithm, which we call Bee Search, that does not suffer information loss and is able to perform cost-guided bottom-up synthesis in a best-first manner. Importantly, Bee Search performs best-first search with respect to the generation of programs, i.e., it does not even create in memory programs that are more expensive than the solution program. It attains best-first ordering with respect to generation by performing a search in an abstract space of program costs. We also introduce a new cost function that better uses the information provided by an existing cost model. Empirical ",
    "link": "http://arxiv.org/abs/2310.04327",
    "context": "Title: Program Synthesis with Best-First Bottom-Up Search. (arXiv:2310.04327v1 [cs.LG])\nAbstract: Cost-guided bottom-up search (BUS) algorithms use a cost function to guide the search to solve program synthesis tasks. In this paper, we show that current state-of-the-art cost-guided BUS algorithms suffer from a common problem: they can lose useful information given by the model and fail to perform the search in a best-first order according to a cost function. We introduce a novel best-first bottom-up search algorithm, which we call Bee Search, that does not suffer information loss and is able to perform cost-guided bottom-up synthesis in a best-first manner. Importantly, Bee Search performs best-first search with respect to the generation of programs, i.e., it does not even create in memory programs that are more expensive than the solution program. It attains best-first ordering with respect to generation by performing a search in an abstract space of program costs. We also introduce a new cost function that better uses the information provided by an existing cost model. Empirical ",
    "path": "papers/23/10/2310.04327.json",
    "total_tokens": 907,
    "translated_title": "基于最佳优先自底向上搜索的程序合成",
    "translated_abstract": "领先的成本导向自底向上搜索算法使用成本函数来指导搜索程序合成任务。本文表明，目前最先进的成本导向自底向上搜索算法存在一个共同的问题：它们可能会丢失模型提供的有用信息，并且无法按照成本函数的最佳优先顺序进行搜索。我们引入了一种新颖的最佳优先自底向上搜索算法，称为Bee Search，它不会丢失信息，并能够以最佳优先的方式执行成本导向自底向上合成。重要的是，Bee Search以相对于生成程序的最佳优先顺序执行最佳优先搜索，即它不会在内存中创建比解决方案程序更昂贵的程序。它通过在程序成本的抽象空间中进行搜索来实现生成的最佳优先顺序。我们还引入了一个更好使用现有成本模型提供的信息的新成本函数。",
    "tldr": "本文介绍了一种新颖的最佳优先自底向上搜索算法，称为Bee Search，该算法能够以最佳优先的方式执行成本导向自底向上合成，而且不会丢失模型提供的有用信息。同时，作者还引入了一个更好使用现有成本模型提供的信息的新成本函数。",
    "en_tdlr": "This paper introduces a novel best-first bottom-up search algorithm called Bee Search, which performs cost-guided bottom-up synthesis in a best-first manner without losing useful information given by the model. The paper also presents a new cost function that better uses the information provided by an existing cost model."
}