{
    "title": "Identifying Copeland Winners in Dueling Bandits with Indifferences. (arXiv:2310.00750v1 [cs.LG])",
    "abstract": "We consider the task of identifying the Copeland winner(s) in a dueling bandits problem with ternary feedback. This is an underexplored but practically relevant variant of the conventional dueling bandits problem, in which, in addition to strict preference between two arms, one may observe feedback in the form of an indifference. We provide a lower bound on the sample complexity for any learning algorithm finding the Copeland winner(s) with a fixed error probability. Moreover, we propose POCOWISTA, an algorithm with a sample complexity that almost matches this lower bound, and which shows excellent empirical performance, even for the conventional dueling bandits problem. For the case where the preference probabilities satisfy a specific type of stochastic transitivity, we provide a refined version with an improved worst case sample complexity.",
    "link": "http://arxiv.org/abs/2310.00750",
    "context": "Title: Identifying Copeland Winners in Dueling Bandits with Indifferences. (arXiv:2310.00750v1 [cs.LG])\nAbstract: We consider the task of identifying the Copeland winner(s) in a dueling bandits problem with ternary feedback. This is an underexplored but practically relevant variant of the conventional dueling bandits problem, in which, in addition to strict preference between two arms, one may observe feedback in the form of an indifference. We provide a lower bound on the sample complexity for any learning algorithm finding the Copeland winner(s) with a fixed error probability. Moreover, we propose POCOWISTA, an algorithm with a sample complexity that almost matches this lower bound, and which shows excellent empirical performance, even for the conventional dueling bandits problem. For the case where the preference probabilities satisfy a specific type of stochastic transitivity, we provide a refined version with an improved worst case sample complexity.",
    "path": "papers/23/10/2310.00750.json",
    "total_tokens": 909,
    "translated_title": "用于决斗对比中的 Copeland 获胜者的识别",
    "translated_abstract": "我们考虑使用三元反馈来识别决斗对比问题中的 Copeland 获胜者。这是传统决斗对比问题的一个未被充分研究但在实际中有意义的变体，在这个问题中，除了在两个选项之间有明确的偏好之外，我们还可以观察到因为漠不关心而形成的反馈。我们给出了任何学习算法在固定错误概率下找到 Copeland 获胜者的样本复杂度的下界。此外，我们提出了一种名为 POCOWISTA 的算法，其样本复杂度几乎与这个下界相匹配，并且在传统决斗对比问题中展现了出色的实证性能。对于偏好概率满足特定类型的随机传递性的情况，我们提供了改进后的精炼版本，具有改进的最坏情况样本复杂度。",
    "tldr": "本文解决了决斗对比中的 Copeland 获胜者识别问题，利用三元反馈解决了传统决斗对比问题中未被充分研究的变体。我们提供了样本复杂度的下界，并提出了一种算法 POCOWISTA，该算法几乎达到了下界，展现出很好的实证性能。",
    "en_tdlr": "This paper addresses the problem of identifying Copeland winners in dueling bandits by using ternary feedback, which is an underexplored but practically relevant variant. Lower bound on sample complexity is provided, and an algorithm called POCOWISTA is proposed with nearly matching lower bound and excellent empirical performance for the conventional dueling bandits problem."
}