{
    "title": "Language Agents for Detecting Implicit Stereotypes in Text-to-image Models at Scale. (arXiv:2310.11778v1 [cs.CY])",
    "abstract": "The recent surge in the research of diffusion models has accelerated the adoption of text-to-image models in various Artificial Intelligence Generated Content (AIGC) commercial products. While these exceptional AIGC products are gaining increasing recognition and sparking enthusiasm among consumers, the questions regarding whether, when, and how these models might unintentionally reinforce existing societal stereotypes remain largely unaddressed. Motivated by recent advancements in language agents, here we introduce a novel agent architecture tailored for stereotype detection in text-to-image models. This versatile agent architecture is capable of accommodating free-form detection tasks and can autonomously invoke various tools to facilitate the entire process, from generating corresponding instructions and images, to detecting stereotypes. We build the stereotype-relevant benchmark based on multiple open-text datasets, and apply this architecture to commercial products and popular ope",
    "link": "http://arxiv.org/abs/2310.11778",
    "context": "Title: Language Agents for Detecting Implicit Stereotypes in Text-to-image Models at Scale. (arXiv:2310.11778v1 [cs.CY])\nAbstract: The recent surge in the research of diffusion models has accelerated the adoption of text-to-image models in various Artificial Intelligence Generated Content (AIGC) commercial products. While these exceptional AIGC products are gaining increasing recognition and sparking enthusiasm among consumers, the questions regarding whether, when, and how these models might unintentionally reinforce existing societal stereotypes remain largely unaddressed. Motivated by recent advancements in language agents, here we introduce a novel agent architecture tailored for stereotype detection in text-to-image models. This versatile agent architecture is capable of accommodating free-form detection tasks and can autonomously invoke various tools to facilitate the entire process, from generating corresponding instructions and images, to detecting stereotypes. We build the stereotype-relevant benchmark based on multiple open-text datasets, and apply this architecture to commercial products and popular ope",
    "path": "papers/23/10/2310.11778.json",
    "total_tokens": 871,
    "translated_title": "大规模文本到图像模型中检测隐性刻板印象的语言代理",
    "translated_abstract": "最近对扩散模型研究的激增加速了各种人工智能生成内容（AIGC）商业产品中文本到图像模型的采用。虽然这些出色的AIGC产品在消费者中获得了越来越多的认可和激发了热情，但关于这些模型可能无意中强化现有社会刻板印象的问题尚未得到解决。受到语言代理最近的进展的启发，我们在这里介绍了一种专为文本到图像模型中的刻板印象检测而设计的新型代理架构。这种多功能的代理架构能够适应自由形式的检测任务，可以自主调用各种工具来促进整个过程，从生成相应的指令和图像到检测刻板印象。我们基于多个开放文本数据集构建了与刻板印象相关的基准，并将这种架构应用于商业产品和流行的开放文本数据集。",
    "tldr": "本文介绍了一种针对文本到图像模型中检测刻板印象的语言代理架构，可自主调用各种工具来促进整个检测过程，并应用于商业产品和开放文本数据集。",
    "en_tdlr": "This paper introduces a language agent architecture for detecting stereotypes in text-to-image models, which can autonomously invoke various tools to facilitate the detection process and is applied to commercial products and open-text datasets."
}