{
    "title": "Is Robustness Transferable across Languages in Multilingual Neural Machine Translation?. (arXiv:2310.20162v1 [cs.AI])",
    "abstract": "Robustness, the ability of models to maintain performance in the face of perturbations, is critical for developing reliable NLP systems. Recent studies have shown promising results in improving the robustness of models through adversarial training and data augmentation. However, in machine translation, most of these studies have focused on bilingual machine translation with a single translation direction. In this paper, we investigate the transferability of robustness across different languages in multilingual neural machine translation. We propose a robustness transfer analysis protocol and conduct a series of experiments. In particular, we use character-, word-, and multi-level noises to attack the specific translation direction of the multilingual neural machine translation model and evaluate the robustness of other translation directions. Our findings demonstrate that the robustness gained in one translation direction can indeed transfer to other translation directions. Additionall",
    "link": "http://arxiv.org/abs/2310.20162",
    "context": "Title: Is Robustness Transferable across Languages in Multilingual Neural Machine Translation?. (arXiv:2310.20162v1 [cs.AI])\nAbstract: Robustness, the ability of models to maintain performance in the face of perturbations, is critical for developing reliable NLP systems. Recent studies have shown promising results in improving the robustness of models through adversarial training and data augmentation. However, in machine translation, most of these studies have focused on bilingual machine translation with a single translation direction. In this paper, we investigate the transferability of robustness across different languages in multilingual neural machine translation. We propose a robustness transfer analysis protocol and conduct a series of experiments. In particular, we use character-, word-, and multi-level noises to attack the specific translation direction of the multilingual neural machine translation model and evaluate the robustness of other translation directions. Our findings demonstrate that the robustness gained in one translation direction can indeed transfer to other translation directions. Additionall",
    "path": "papers/23/10/2310.20162.json",
    "total_tokens": 911,
    "translated_title": "跨语言的多语言神经机器翻译中的鲁棒性是否可转移？",
    "translated_abstract": "鲁棒性是模型在面对干扰时保持性能的能力，对于开发可靠的自然语言处理系统至关重要。最近的研究通过对抗训练和数据增强在提高模型的鲁棒性方面取得了令人鼓舞的结果。然而，在机器翻译领域，大多数这些研究都集中在具有单一翻译方向的双语机器翻译上。在本文中，我们研究了跨不同语言的鲁棒性是否可转移于多语言神经机器翻译中。我们提出了一个鲁棒性转移分析协议，并进行了一系列实验。具体而言，我们使用字符、词和多级噪声来攻击多语言神经机器翻译模型的特定翻译方向，评估其他翻译方向的鲁棒性。我们的发现表明，从一个翻译方向获得的鲁棒性确实可以转移到其他翻译方向。",
    "tldr": "本文研究了跨语言的多语言神经机器翻译中的鲁棒性是否可转移。通过一系列实验，我们发现从一个翻译方向获得的鲁棒性可以转移到其他翻译方向。",
    "en_tdlr": "This paper investigates whether the robustness in multilingual neural machine translation can be transferred across different languages. Through a series of experiments, we found that the robustness gained from one translation direction can indeed transfer to other translation directions."
}