{
    "title": "Fact-based Agent modeling for Multi-Agent Reinforcement Learning. (arXiv:2310.12290v1 [cs.AI])",
    "abstract": "In multi-agent systems, agents need to interact and collaborate with other agents in environments. Agent modeling is crucial to facilitate agent interactions and make adaptive cooperation strategies. However, it is challenging for agents to model the beliefs, behaviors, and intentions of other agents in non-stationary environment where all agent policies are learned simultaneously. In addition, the existing methods realize agent modeling through behavior cloning which assume that the local information of other agents can be accessed during execution or training. However, this assumption is infeasible in unknown scenarios characterized by unknown agents, such as competition teams, unreliable communication and federated learning due to privacy concerns. To eliminate this assumption and achieve agent modeling in unknown scenarios, Fact-based Agent modeling (FAM) method is proposed in which fact-based belief inference (FBI) network models other agents in partially observable environment on",
    "link": "http://arxiv.org/abs/2310.12290",
    "context": "Title: Fact-based Agent modeling for Multi-Agent Reinforcement Learning. (arXiv:2310.12290v1 [cs.AI])\nAbstract: In multi-agent systems, agents need to interact and collaborate with other agents in environments. Agent modeling is crucial to facilitate agent interactions and make adaptive cooperation strategies. However, it is challenging for agents to model the beliefs, behaviors, and intentions of other agents in non-stationary environment where all agent policies are learned simultaneously. In addition, the existing methods realize agent modeling through behavior cloning which assume that the local information of other agents can be accessed during execution or training. However, this assumption is infeasible in unknown scenarios characterized by unknown agents, such as competition teams, unreliable communication and federated learning due to privacy concerns. To eliminate this assumption and achieve agent modeling in unknown scenarios, Fact-based Agent modeling (FAM) method is proposed in which fact-based belief inference (FBI) network models other agents in partially observable environment on",
    "path": "papers/23/10/2310.12290.json",
    "total_tokens": 898,
    "translated_title": "基于事实的多智能体强化学习中的智能体建模",
    "translated_abstract": "在多智能体系统中，智能体需要在环境中与其他智能体进行互动和合作。智能体建模对于促进智能体间的互动和实现自适应合作策略至关重要。然而，在非稳态环境中，智能体同时学习所有智能体策略的情况下，智能体对其他智能体的信念、行为和意图进行建模是具有挑战性的。此外，现有的方法通过行为克隆实现智能体建模，假设在执行或训练期间可以访问其他智能体的本地信息。然而，在未知的场景中，如竞争团队、不可靠的通信和出于隐私考虑的联邦学习等未知代理特征的情况下，这种假设是不可行的。为了消除这种假设并在未知场景中实现智能体建模，提出了基于事实的智能体建模（FAM）方法，其中基于事实的信念推理（FBI）网络在部分可观察的环境中对其他智能体进行建模。",
    "tldr": "提出了一种基于事实的智能体建模方法，用于解决在非稳态环境中对其他智能体的信念、行为和意图进行建模的问题，并在未知场景中实现智能体建模。",
    "en_tdlr": "A fact-based agent modeling method is proposed to address the challenge of modeling beliefs, behaviors, and intentions of other agents in non-stationary environments, and achieve agent modeling in unknown scenarios."
}