{
    "title": "IntentDial: An Intent Graph based Multi-Turn Dialogue System with Reasoning Path Visualization. (arXiv:2310.11818v1 [cs.AI])",
    "abstract": "Intent detection and identification from multi-turn dialogue has become a widely explored technique in conversational agents, for example, voice assistants and intelligent customer services. The conventional approaches typically cast the intent mining process as a classification task. Although neural classifiers have proven adept at such classification tasks, the issue of neural network models often impedes their practical deployment in real-world settings. We present a novel graph-based multi-turn dialogue system called , which identifies a user's intent by identifying intent elements and a standard query from a dynamically constructed and extensible intent graph using reinforcement learning. In addition, we provide visualization components to monitor the immediate reasoning path for each turn of a dialogue, which greatly facilitates further improvement of the system.",
    "link": "http://arxiv.org/abs/2310.11818",
    "context": "Title: IntentDial: An Intent Graph based Multi-Turn Dialogue System with Reasoning Path Visualization. (arXiv:2310.11818v1 [cs.AI])\nAbstract: Intent detection and identification from multi-turn dialogue has become a widely explored technique in conversational agents, for example, voice assistants and intelligent customer services. The conventional approaches typically cast the intent mining process as a classification task. Although neural classifiers have proven adept at such classification tasks, the issue of neural network models often impedes their practical deployment in real-world settings. We present a novel graph-based multi-turn dialogue system called , which identifies a user's intent by identifying intent elements and a standard query from a dynamically constructed and extensible intent graph using reinforcement learning. In addition, we provide visualization components to monitor the immediate reasoning path for each turn of a dialogue, which greatly facilitates further improvement of the system.",
    "path": "papers/23/10/2310.11818.json",
    "total_tokens": 761,
    "translated_title": "IntentDial:一种基于意图图的多轮对话系统，并提供推理路径可视化",
    "translated_abstract": "意图检测和识别已成为对话代理（例如声音助手和智能客服）中广泛研究的技术。传统方法通常将意图挖掘过程视为分类任务。虽然神经网络分类器在这类任务中表现出色，但神经网络模型的问题常常阻碍其在实际场景中的应用。我们提出了一种新颖的基于图的多轮对话系统，称为IntentDial，通过使用强化学习从动态构建和可扩展的意图图中识别用户的意图，即意图元素和标准查询。此外，我们还提供了可视化组件，用于监视对话的每个轮次的直接推理路径，这极大地促进了系统的进一步改进。",
    "tldr": "IntentDial是一种基于图的多轮对话系统，在实现意图检测和识别时使用强化学习和推理路径可视化组件，有助于提高对话系统的性能和改进。",
    "en_tdlr": "IntentDial is a graph-based multi-turn dialogue system that uses reinforcement learning and reasoning path visualization components to improve the performance and enhancement of intent detection and identification in conversational agents."
}