{
    "title": "DPM-Solver-v3: Improved Diffusion ODE Solver with Empirical Model Statistics. (arXiv:2310.13268v1 [cs.CV])",
    "abstract": "Diffusion probabilistic models (DPMs) have exhibited excellent performance for high-fidelity image generation while suffering from inefficient sampling. Recent works accelerate the sampling procedure by proposing fast ODE solvers that leverage the specific ODE form of DPMs. However, they highly rely on specific parameterization during inference (such as noise/data prediction), which might not be the optimal choice. In this work, we propose a novel formulation towards the optimal parameterization during sampling that minimizes the first-order discretization error of the ODE solution. Based on such formulation, we propose \\textit{DPM-Solver-v3}, a new fast ODE solver for DPMs by introducing several coefficients efficiently computed on the pretrained model, which we call \\textit{empirical model statistics}. We further incorporate multistep methods and a predictor-corrector framework, and propose some techniques for improving sample quality at small numbers of function evaluations (NFE) or",
    "link": "http://arxiv.org/abs/2310.13268",
    "context": "Title: DPM-Solver-v3: Improved Diffusion ODE Solver with Empirical Model Statistics. (arXiv:2310.13268v1 [cs.CV])\nAbstract: Diffusion probabilistic models (DPMs) have exhibited excellent performance for high-fidelity image generation while suffering from inefficient sampling. Recent works accelerate the sampling procedure by proposing fast ODE solvers that leverage the specific ODE form of DPMs. However, they highly rely on specific parameterization during inference (such as noise/data prediction), which might not be the optimal choice. In this work, we propose a novel formulation towards the optimal parameterization during sampling that minimizes the first-order discretization error of the ODE solution. Based on such formulation, we propose \\textit{DPM-Solver-v3}, a new fast ODE solver for DPMs by introducing several coefficients efficiently computed on the pretrained model, which we call \\textit{empirical model statistics}. We further incorporate multistep methods and a predictor-corrector framework, and propose some techniques for improving sample quality at small numbers of function evaluations (NFE) or",
    "path": "papers/23/10/2310.13268.json",
    "total_tokens": 977,
    "translated_title": "DPM-Solver-v3: 使用经验模型统计改进的扩散ODE求解器",
    "translated_abstract": "扩散概率模型（DPMs）在生成高保真度图像方面表现出色，但采样效率低下。最近的研究通过提出利用DPMs的特定ODE形式的快速ODE求解器来加速采样过程。然而，它们在推理过程中高度依赖特定参数化（如噪声/数据预测），这可能并不是最佳选择。在本研究中，我们提出了一种新的公式，以获得在采样过程中最佳参数化，以最小化ODE解的一阶离散化错误。基于这种公式，我们引入了几个在预训练模型上高效计算的系数，并提出了一个名为DPM-Solver-v3的新快速ODE求解器，我们称之为“经验模型统计”。我们进一步结合了多步方法和预测-校正框架，并提出了一些技术来改善在少量函数评估（NFE）或大规模数据集上的样本质量。",
    "tldr": "本论文提出了DPM-Solver-v3，一个基于经验模型统计的新型快速ODE求解器，用于优化扩散概率模型的采样效率，并提出了一种新的参数化方法以减小ODE解的离散化误差。同时，引入了多步方法和预测-校正框架来进一步改善采样质量。",
    "en_tdlr": "This paper introduces DPM-Solver-v3, a new fast ODE solver based on empirical model statistics for optimizing the sampling efficiency of diffusion probabilistic models (DPMs). It proposes a novel parameterization approach to minimize the discretization error of the ODE solution. Additionally, it incorporates multistep methods and a predictor-corrector framework to further improve the sampling quality."
}