{
    "title": "Ling-CL: Understanding NLP Models through Linguistic Curricula. (arXiv:2310.20121v1 [cs.CL])",
    "abstract": "We employ a characterization of linguistic complexity from psycholinguistic and language acquisition research to develop data-driven curricula to understand the underlying linguistic knowledge that models learn to address NLP tasks. The novelty of our approach is in the development of linguistic curricula derived from data, existing knowledge about linguistic complexity, and model behavior during training. By analyzing several benchmark NLP datasets, our curriculum learning approaches identify sets of linguistic metrics (indices) that inform the challenges and reasoning required to address each task. Our work will inform future research in all NLP areas, allowing linguistic complexity to be considered early in the research and development process. In addition, our work prompts an examination of gold standards and fair evaluation in NLP.",
    "link": "http://arxiv.org/abs/2310.20121",
    "context": "Title: Ling-CL: Understanding NLP Models through Linguistic Curricula. (arXiv:2310.20121v1 [cs.CL])\nAbstract: We employ a characterization of linguistic complexity from psycholinguistic and language acquisition research to develop data-driven curricula to understand the underlying linguistic knowledge that models learn to address NLP tasks. The novelty of our approach is in the development of linguistic curricula derived from data, existing knowledge about linguistic complexity, and model behavior during training. By analyzing several benchmark NLP datasets, our curriculum learning approaches identify sets of linguistic metrics (indices) that inform the challenges and reasoning required to address each task. Our work will inform future research in all NLP areas, allowing linguistic complexity to be considered early in the research and development process. In addition, our work prompts an examination of gold standards and fair evaluation in NLP.",
    "path": "papers/23/10/2310.20121.json",
    "total_tokens": 830,
    "translated_title": "Ling-CL:通过语言课程理解NLP模型",
    "translated_abstract": "我们利用心理语言学和语言习得研究中的语言复杂性表征来开发数据驱动的课程，以理解模型在处理NLP任务时所学习的潜在语言知识。我们方法的创新之处在于通过分析数据、现有关于语言复杂性的知识以及模型训练过程中的行为来制定语言课程。通过分析多个基准NLP数据集，我们的课程学习方法找到了一组语言度量指标，这些指标可用来了解解决每个任务所需的挑战和推理。我们的工作将为未来所有NLP领域的研究提供指导，使语言复杂性能够在研究和开发过程中被早期考虑。此外，我们的工作还促使人们对NLP中的黄金标准和公平评估进行审视。",
    "tldr": "Ling-CL通过开发基于数据和现有语言复杂性知识的语言课程，帮助理解NLP模型学习的潜在语言知识。此工作在多个NLP数据集上展示了课程学习方法的指标选择和任务挑战推理的能力。",
    "en_tdlr": "Ling-CL helps understand the underlying linguistic knowledge learned by NLP models through the development of data-driven linguistic curricula. This work demonstrates the ability of curriculum learning approaches to select linguistic metrics and reason about task challenges on multiple NLP datasets."
}