{
    "title": "Improving Traffic Density Forecasting in Intelligent Transportation Systems Using Gated Graph Neural Networks. (arXiv:2310.17729v1 [cs.LG])",
    "abstract": "This study delves into the application of graph neural networks in the realm of traffic forecasting, a crucial facet of intelligent transportation systems. Accurate traffic predictions are vital for functions like trip planning, traffic control, and vehicle routing in such systems. Three prominent GNN architectures Graph Convolutional Networks (Graph Sample and Aggregation) and Gated Graph Neural Networks are explored within the context of traffic prediction. Each architecture's methodology is thoroughly examined, including layer configurations, activation functions,and hyperparameters. The primary goal is to minimize prediction errors, with GGNNs emerging as the most effective choice among the three models. The research outlines outcomes for each architecture, elucidating their predictive performance through root mean squared error and mean absolute error (MAE). Hypothetical results reveal intriguing insights: GCNs display an RMSE of 9.10 and an MAE of 8.00, while GraphSAGE shows impr",
    "link": "http://arxiv.org/abs/2310.17729",
    "context": "Title: Improving Traffic Density Forecasting in Intelligent Transportation Systems Using Gated Graph Neural Networks. (arXiv:2310.17729v1 [cs.LG])\nAbstract: This study delves into the application of graph neural networks in the realm of traffic forecasting, a crucial facet of intelligent transportation systems. Accurate traffic predictions are vital for functions like trip planning, traffic control, and vehicle routing in such systems. Three prominent GNN architectures Graph Convolutional Networks (Graph Sample and Aggregation) and Gated Graph Neural Networks are explored within the context of traffic prediction. Each architecture's methodology is thoroughly examined, including layer configurations, activation functions,and hyperparameters. The primary goal is to minimize prediction errors, with GGNNs emerging as the most effective choice among the three models. The research outlines outcomes for each architecture, elucidating their predictive performance through root mean squared error and mean absolute error (MAE). Hypothetical results reveal intriguing insights: GCNs display an RMSE of 9.10 and an MAE of 8.00, while GraphSAGE shows impr",
    "path": "papers/23/10/2310.17729.json",
    "total_tokens": 934,
    "translated_title": "使用门控图神经网络改进智能交通系统中的交通密度预测",
    "translated_abstract": "本研究探讨了图神经网络在交通预测领域中的应用，这是智能交通系统中的一个关键方面。准确的交通预测对于行程规划、交通控制和车辆路径规划等功能至关重要。在交通预测的背景下，深入研究了三种主要的GNN架构：图卷积网络（图采样和聚合）和门控图神经网络。详细考察了每种架构的方法论，包括层配置、激活函数和超参数。主要目标是降低预测误差，在三种模型中，GGNNs被证明是最有效的选择。研究概述了每种架构的结果，通过均方根误差和平均绝对误差（MAE）阐明了它们的预测性能。假设的结果揭示了有趣的见解：GCNs显示了9.10的RMSE和8.00的MAE，而GraphSAGE展示了令人印象深刻的预测能力。",
    "tldr": "本研究通过应用门控图神经网络（GGNNs），在智能交通系统中的交通预测领域取得了显著的成果，通过最小化预测误差，GGNNs被证明是最有效的选择，展示了较高的预测性能。",
    "en_tdlr": "This study achieved significant results in the field of traffic prediction in intelligent transportation systems by utilizing Gated Graph Neural Networks (GGNNs), with GGNNs emerging as the most effective choice through minimizing prediction errors, demonstrating high predictive performance."
}