{
    "title": "DANI: Fast Diffusion Aware Network Inference with Preserving Topological Structure Property. (arXiv:2310.01696v1 [cs.SI])",
    "abstract": "The fast growth of social networks and their data access limitations in recent years has led to increasing difficulty in obtaining the complete topology of these networks. However, diffusion information over these networks is available, and many algorithms have been proposed to infer the underlying networks using this information. The previously proposed algorithms only focus on inferring more links and ignore preserving the critical topological characteristics of the underlying social networks. In this paper, we propose a novel method called DANI to infer the underlying network while preserving its structural properties. It is based on the Markov transition matrix derived from time series cascades, as well as the node-node similarity that can be observed in the cascade behavior from a structural point of view. In addition, the presented method has linear time complexity (increases linearly with the number of nodes, number of cascades, and square of the average length of cascades), and",
    "link": "http://arxiv.org/abs/2310.01696",
    "context": "Title: DANI: Fast Diffusion Aware Network Inference with Preserving Topological Structure Property. (arXiv:2310.01696v1 [cs.SI])\nAbstract: The fast growth of social networks and their data access limitations in recent years has led to increasing difficulty in obtaining the complete topology of these networks. However, diffusion information over these networks is available, and many algorithms have been proposed to infer the underlying networks using this information. The previously proposed algorithms only focus on inferring more links and ignore preserving the critical topological characteristics of the underlying social networks. In this paper, we propose a novel method called DANI to infer the underlying network while preserving its structural properties. It is based on the Markov transition matrix derived from time series cascades, as well as the node-node similarity that can be observed in the cascade behavior from a structural point of view. In addition, the presented method has linear time complexity (increases linearly with the number of nodes, number of cascades, and square of the average length of cascades), and",
    "path": "papers/23/10/2310.01696.json",
    "total_tokens": 782,
    "translated_title": "DANI:快速的、具有保持拓扑结构属性的扩散感知网络推断",
    "translated_abstract": "近年来，社交网络的快速增长和数据访问限制导致了获取完整拓扑结构的困难。然而，这些网络上的扩散信息是可用的，并且已经提出了许多算法来利用这些信息推断潜在的网络。先前提出的算法只关注推断更多的链接，忽视了保持潜在社交网络关键拓扑特征的重要性。在本文中，我们提出了一种名为DANI的新方法，通过保持结构特性来推断潜在网络。它基于从时间序列级联中派生的马尔可夫转移矩阵，以及可以从结构角度观察级联行为的节点之间的相似性。此外，所提出的方法具有线性时间复杂度（与节点数量、级联数量和级联平均长度的平方线性增长），",
    "tldr": "DANI是一种快速的、具有保持拓扑结构属性的扩散感知网络推断方法。"
}