{
    "title": "Enhancing Traffic Prediction with Learnable Filter Module. (arXiv:2310.16063v1 [cs.LG])",
    "abstract": "Modeling future traffic conditions often relies heavily on complex spatial-temporal neural networks to capture spatial and temporal correlations, which can overlook the inherent noise in the data. This noise, often manifesting as unexpected short-term peaks or drops in traffic observation, is typically caused by traffic accidents or inherent sensor vibration. In practice, such noise can be challenging to model due to its stochastic nature and can lead to overfitting risks if a neural network is designed to learn this behavior. To address this issue, we propose a learnable filter module to filter out noise in traffic data adaptively. This module leverages the Fourier transform to convert the data to the frequency domain, where noise is filtered based on its pattern. The denoised data is then recovered to the time domain using the inverse Fourier transform. Our approach focuses on enhancing the quality of the input data for traffic prediction models, which is a critical yet often overloo",
    "link": "http://arxiv.org/abs/2310.16063",
    "context": "Title: Enhancing Traffic Prediction with Learnable Filter Module. (arXiv:2310.16063v1 [cs.LG])\nAbstract: Modeling future traffic conditions often relies heavily on complex spatial-temporal neural networks to capture spatial and temporal correlations, which can overlook the inherent noise in the data. This noise, often manifesting as unexpected short-term peaks or drops in traffic observation, is typically caused by traffic accidents or inherent sensor vibration. In practice, such noise can be challenging to model due to its stochastic nature and can lead to overfitting risks if a neural network is designed to learn this behavior. To address this issue, we propose a learnable filter module to filter out noise in traffic data adaptively. This module leverages the Fourier transform to convert the data to the frequency domain, where noise is filtered based on its pattern. The denoised data is then recovered to the time domain using the inverse Fourier transform. Our approach focuses on enhancing the quality of the input data for traffic prediction models, which is a critical yet often overloo",
    "path": "papers/23/10/2310.16063.json",
    "total_tokens": 990,
    "translated_title": "利用可学习的滤波模块提升交通预测",
    "translated_abstract": "对未来交通条件的建模通常依赖于复杂的时空神经网络来捕捉时空相关性，但这可能忽视了数据中固有的噪声。这种噪声通常表现为交通观测中的意外短期波峰或波谷，通常是由交通事故或传感器固有振动导致的。在实践中，由于其随机性，这种噪声很难建模，并且如果神经网络被设计成学习这种行为，会导致过拟合的风险。为了解决这个问题，我们提出了一个可学习的滤波模块，来自适应性地过滤交通数据中的噪声。该模块利用傅里叶变换将数据转换为频域，在此基础上根据噪声的模式进行滤波。经过去噪处理后的数据再通过逆傅里叶变换恢复到时域。我们的方法着重提升交通预测模型的输入数据质量，这是一个关键但常被忽视的因素。",
    "tldr": "本论文提出了一种利用可学习滤波模块来适应性地过滤交通数据中的噪声的方法，通过傅里叶变换将数据转换为频域，然后根据噪声的模式进行滤波，最后再通过逆傅里叶变换将数据恢复到时域。这种方法可以提升交通预测模型的输入数据质量。",
    "en_tdlr": "This paper proposes a method to adaptively filter noise in traffic data using a learnable filter module, which converts the data to the frequency domain using Fourier transform, filters the noise based on its pattern, and then recovers the data to the time domain using inverse Fourier transform. This approach enhances the quality of input data for traffic prediction models."
}