{
    "title": "Cordyceps@LT-EDI: Depression Detection with Reddit and Self-training. (arXiv:2310.01418v1 [cs.CL])",
    "abstract": "Depression is debilitating, and not uncommon. Indeed, studies of excessive social media users show correlations with depression, ADHD, and other mental health concerns. Given that there is a large number of people with excessive social media usage, then there is a significant population of potentially undiagnosed users and posts that they create. In this paper, we propose a depression severity detection system using a semi-supervised learning technique to predict if a post is from a user who is experiencing severe, moderate, or low (non-diagnostic) levels of depression. Namely, we use a trained model to classify a large number of unlabelled social media posts from Reddit, then use these generated labels to train a more powerful classifier. We demonstrate our framework on Detecting Signs of Depression from Social Media Text LT-EDI@RANLP 2023 shared task, where our framework ranks 3rd overall.",
    "link": "http://arxiv.org/abs/2310.01418",
    "context": "Title: Cordyceps@LT-EDI: Depression Detection with Reddit and Self-training. (arXiv:2310.01418v1 [cs.CL])\nAbstract: Depression is debilitating, and not uncommon. Indeed, studies of excessive social media users show correlations with depression, ADHD, and other mental health concerns. Given that there is a large number of people with excessive social media usage, then there is a significant population of potentially undiagnosed users and posts that they create. In this paper, we propose a depression severity detection system using a semi-supervised learning technique to predict if a post is from a user who is experiencing severe, moderate, or low (non-diagnostic) levels of depression. Namely, we use a trained model to classify a large number of unlabelled social media posts from Reddit, then use these generated labels to train a more powerful classifier. We demonstrate our framework on Detecting Signs of Depression from Social Media Text LT-EDI@RANLP 2023 shared task, where our framework ranks 3rd overall.",
    "path": "papers/23/10/2310.01418.json",
    "total_tokens": 923,
    "translated_title": "Cordyceps@LT-EDI：使用Reddit和自我训练进行抑郁症检测",
    "translated_abstract": "抑郁症是一种令人丧失能力且并不罕见的疾病。实际上，对过度使用社交媒体的研究表明与抑郁症、注意力缺陷多动障碍（ADHD）以及其他心理健康问题存在相关性。鉴于有大量使用社交媒体的人群，存在着可能未被诊断的用户和他们所发布的帖子的庞大人口。在本论文中，我们提出了一种使用半监督学习技术的抑郁症严重程度检测系统，用于预测帖子是否来自正在经历严重、中等或轻微（非诊断性）抑郁症状的用户。具体来说，我们使用训练模型对Reddit上大量未标记的社交媒体帖子进行分类，然后利用这些生成的标签来训练一个更强大的分类器。我们在Detecting Signs of Depression from Social Media Text LT-EDI@RANLP 2023的任务中展示了这个框架，我们的框架在整体排名中名列第三。",
    "tldr": "本论文提出了一种利用自我训练和Reddit进行抑郁症检测的方法，通过分类未标记的社交媒体帖子来预测用户是否有抑郁症，并在相关任务中取得了较好的排名。",
    "en_tdlr": "This paper proposes a method for detecting depression using self-training and Reddit, predicting if a user has depression by classifying unlabeled social media posts, and achieves good rankings in related tasks."
}