{
    "title": "WGoM: A novel model for categorical data with weighted responses. (arXiv:2310.10989v1 [cs.SI])",
    "abstract": "The Graded of Membership (GoM) model is a powerful tool for inferring latent classes in categorical data, which enables subjects to belong to multiple latent classes. However, its application is limited to categorical data with nonnegative integer responses, making it inappropriate for datasets with continuous or negative responses. To address this limitation, this paper proposes a novel model named the Weighted Grade of Membership (WGoM) model. Compared with GoM, our WGoM relaxes GoM's distribution constraint on the generation of a response matrix and it is more general than GoM. We then propose an algorithm to estimate the latent mixed memberships and the other WGoM parameters. We derive the error bounds of the estimated parameters and show that the algorithm is statistically consistent. The algorithmic performance is validated in both synthetic and real-world datasets. The results demonstrate that our algorithm is accurate and efficient, indicating its high potential for practical a",
    "link": "http://arxiv.org/abs/2310.10989",
    "context": "Title: WGoM: A novel model for categorical data with weighted responses. (arXiv:2310.10989v1 [cs.SI])\nAbstract: The Graded of Membership (GoM) model is a powerful tool for inferring latent classes in categorical data, which enables subjects to belong to multiple latent classes. However, its application is limited to categorical data with nonnegative integer responses, making it inappropriate for datasets with continuous or negative responses. To address this limitation, this paper proposes a novel model named the Weighted Grade of Membership (WGoM) model. Compared with GoM, our WGoM relaxes GoM's distribution constraint on the generation of a response matrix and it is more general than GoM. We then propose an algorithm to estimate the latent mixed memberships and the other WGoM parameters. We derive the error bounds of the estimated parameters and show that the algorithm is statistically consistent. The algorithmic performance is validated in both synthetic and real-world datasets. The results demonstrate that our algorithm is accurate and efficient, indicating its high potential for practical a",
    "path": "papers/23/10/2310.10989.json",
    "total_tokens": 979,
    "translated_title": "WGoM：一种适用于带加权响应的分类数据的新模型",
    "translated_abstract": "Graded of Membership（GoM）模型是一种用于推断分类数据中潜在类别的强大工具，使得个体可以属于多个潜在类别。然而，该模型仅适用于具有非负整数响应的分类数据，使得它无法应用于具有连续或负响应的数据集。为了解决这个限制，本文提出了一种名为加权成员级别（WGoM）模型的新模型。与GoM相比，我们的WGoM在响应矩阵的生成上放宽了GoM的分布约束，并且比GoM更通用。我们还提出了一种估计潜在混合成员和其他WGoM参数的算法。我们推导了估计参数的误差界限，并且证明了算法的统计一致性。该算法的性能在合成和真实世界的数据集中得到了验证。结果表明我们的算法准确高效，具有很高的实用潜力。",
    "tldr": "本文提出了一种名为加权成员级别（WGoM）模型，用于解决基于分类数据的潜在类别推断问题。与现有模型相比，WGoM更通用且适用于具有连续或负响应的数据集。通过提出的算法，我们能够准确高效地估计潜在混合成员和其他WGoM参数，并且通过实验证明了该算法的性能和实用潜力。",
    "en_tdlr": "This paper proposes a novel model named Weighted Grade of Membership (WGoM) for inferring latent classes in categorical data. Compared with existing models, WGoM is more general and suitable for datasets with continuous or negative responses. The algorithm proposed in this paper allows for accurate and efficient estimation of latent mixed memberships and other WGoM parameters, and its performance and practical potential are demonstrated through experiments."
}