{
    "title": "HydraViT: Adaptive Multi-Branch Transformer for Multi-Label Disease Classification from Chest X-ray Images. (arXiv:2310.06143v1 [eess.IV])",
    "abstract": "Chest X-ray is an essential diagnostic tool in the identification of chest diseases given its high sensitivity to pathological abnormalities in the lungs. However, image-driven diagnosis is still challenging due to heterogeneity in size and location of pathology, as well as visual similarities and co-occurrence of separate pathology. Since disease-related regions often occupy a relatively small portion of diagnostic images, classification models based on traditional convolutional neural networks (CNNs) are adversely affected given their locality bias. While CNNs were previously augmented with attention maps or spatial masks to guide focus on potentially critical regions, learning localization guidance under heterogeneity in the spatial distribution of pathology is challenging. To improve multi-label classification performance, here we propose a novel method, HydraViT, that synergistically combines a transformer backbone with a multi-branch output module with learned weighting. The tran",
    "link": "http://arxiv.org/abs/2310.06143",
    "context": "Title: HydraViT: Adaptive Multi-Branch Transformer for Multi-Label Disease Classification from Chest X-ray Images. (arXiv:2310.06143v1 [eess.IV])\nAbstract: Chest X-ray is an essential diagnostic tool in the identification of chest diseases given its high sensitivity to pathological abnormalities in the lungs. However, image-driven diagnosis is still challenging due to heterogeneity in size and location of pathology, as well as visual similarities and co-occurrence of separate pathology. Since disease-related regions often occupy a relatively small portion of diagnostic images, classification models based on traditional convolutional neural networks (CNNs) are adversely affected given their locality bias. While CNNs were previously augmented with attention maps or spatial masks to guide focus on potentially critical regions, learning localization guidance under heterogeneity in the spatial distribution of pathology is challenging. To improve multi-label classification performance, here we propose a novel method, HydraViT, that synergistically combines a transformer backbone with a multi-branch output module with learned weighting. The tran",
    "path": "papers/23/10/2310.06143.json",
    "total_tokens": 889,
    "translated_title": "HydraViT:自适应多分支变压器用于胸部X射线图像的多标签疾病分类",
    "translated_abstract": "胸部X射线是识别胸部疾病的一种重要诊断工具，由于病理异常在肺部的高敏感性，但由于病理的大小和位置的异质性，以及不同病理的视觉相似性和共同出现，以图像为驱动的诊断仍然具有挑战性。因为与疾病相关的区域往往占据诊断图像的相对小部分，所以传统卷积神经网络（CNNs）基于的分类模型受到了它们的局部性偏见的不利影响。虽然之前曾将CNNs与注意图或空间掩码相结合，以指导对潜在关键区域的关注，但在病理空间分布的异质性下学习定位指导是具有挑战性的。为了提高多标签分类性能，我们提出了一种新的方法HydraViT，它将变压器骨干网络与具有学习权重的多分支输出模块结合起来协同工作。",
    "tldr": "HydraViT是一种将变压器与多分支输出模块相结合的新方法，用于胸部X射线图像的多标签疾病分类，以提高分类性能。",
    "en_tdlr": "HydraViT is a novel method that combines transformer backbone with a multi-branch output module for multi-label disease classification from chest X-ray images, aiming to improve classification performance."
}