{
    "title": "Causality-informed Rapid Post-hurricane Building Damage Detection in Large Scale from InSAR Imagery. (arXiv:2310.01565v1 [cs.LG])",
    "abstract": "Timely and accurate assessment of hurricane-induced building damage is crucial for effective post-hurricane response and recovery efforts. Recently, remote sensing technologies provide large-scale optical or Interferometric Synthetic Aperture Radar (InSAR) imagery data immediately after a disastrous event, which can be readily used to conduct rapid building damage assessment. Compared to optical satellite imageries, the Synthetic Aperture Radar can penetrate cloud cover and provide more complete spatial coverage of damaged zones in various weather conditions. However, these InSAR imageries often contain highly noisy and mixed signals induced by co-occurring or co-located building damage, flood, flood/wind-induced vegetation changes, as well as anthropogenic activities, making it challenging to extract accurate building damage information. In this paper, we introduced an approach for rapid post-hurricane building damage detection from InSAR imagery. This approach encoded complex causal ",
    "link": "http://arxiv.org/abs/2310.01565",
    "context": "Title: Causality-informed Rapid Post-hurricane Building Damage Detection in Large Scale from InSAR Imagery. (arXiv:2310.01565v1 [cs.LG])\nAbstract: Timely and accurate assessment of hurricane-induced building damage is crucial for effective post-hurricane response and recovery efforts. Recently, remote sensing technologies provide large-scale optical or Interferometric Synthetic Aperture Radar (InSAR) imagery data immediately after a disastrous event, which can be readily used to conduct rapid building damage assessment. Compared to optical satellite imageries, the Synthetic Aperture Radar can penetrate cloud cover and provide more complete spatial coverage of damaged zones in various weather conditions. However, these InSAR imageries often contain highly noisy and mixed signals induced by co-occurring or co-located building damage, flood, flood/wind-induced vegetation changes, as well as anthropogenic activities, making it challenging to extract accurate building damage information. In this paper, we introduced an approach for rapid post-hurricane building damage detection from InSAR imagery. This approach encoded complex causal ",
    "path": "papers/23/10/2310.01565.json",
    "total_tokens": 917,
    "translated_title": "从InSAR图像中基于因果关系的大规模飓风后建筑损害快速检测",
    "translated_abstract": "及时准确评估飓风引起的建筑物损害对于有效的飓风后应对和恢复工作至关重要。最近，遥感技术提供了大规模光学或干涉合成孔径雷达（InSAR）图像数据，可立即用于进行快速建筑损害评估。与光学卫星图像相比，合成孔径雷达可以穿透云层，并在各种天气条件下提供更完整的受损区域空间覆盖。然而，这些InSAR图像通常包含由共同发生或共同位置的建筑损坏、洪水、洪水/风引发的植被变化以及人为活动引起的高度噪声和混合信号，使得准确提取建筑损害信息具有挑战性。在本文中，我们介绍了一种从InSAR图像中快速检测飓风后建筑损伤的方法。该方法编码复杂的因果关系图来提高建筑损害信息的准确性。",
    "tldr": "本文介绍了一种从InSAR图像中快速检测飓风后建筑损伤的方法，通过编码复杂的因果关系图来提高建筑损害信息的准确性。",
    "en_tdlr": "This paper introduces an approach for rapid post-hurricane building damage detection from InSAR imagery, improving the accuracy of building damage information by encoding complex causal graphs."
}