{
    "title": "AE-smnsMLC: Multi-Label Classification with Semantic Matching and Negative Label Sampling for Product Attribute Value Extraction. (arXiv:2310.07137v1 [cs.IR])",
    "abstract": "Product attribute value extraction plays an important role for many real-world applications in e-Commerce such as product search and recommendation. Previous methods treat it as a sequence labeling task that needs more annotation for position of values in the product text. This limits their application to real-world scenario in which only attribute values are weakly-annotated for each product without their position. Moreover, these methods only use product text (i.e., product title and description) and do not consider the semantic connection between the multiple attribute values of a given product and its text, which can help attribute value extraction. In this paper, we reformulate this task as a multi-label classification task that can be applied for real-world scenario in which only annotation of attribute values is available to train models (i.e., annotation of positional information of attribute values is not available). We propose a classification model with semantic matching and",
    "link": "http://arxiv.org/abs/2310.07137",
    "context": "Title: AE-smnsMLC: Multi-Label Classification with Semantic Matching and Negative Label Sampling for Product Attribute Value Extraction. (arXiv:2310.07137v1 [cs.IR])\nAbstract: Product attribute value extraction plays an important role for many real-world applications in e-Commerce such as product search and recommendation. Previous methods treat it as a sequence labeling task that needs more annotation for position of values in the product text. This limits their application to real-world scenario in which only attribute values are weakly-annotated for each product without their position. Moreover, these methods only use product text (i.e., product title and description) and do not consider the semantic connection between the multiple attribute values of a given product and its text, which can help attribute value extraction. In this paper, we reformulate this task as a multi-label classification task that can be applied for real-world scenario in which only annotation of attribute values is available to train models (i.e., annotation of positional information of attribute values is not available). We propose a classification model with semantic matching and",
    "path": "papers/23/10/2310.07137.json",
    "total_tokens": 878,
    "translated_title": "AE-smnsMLC：基于语义匹配和负标签采样的产品属性值提取的多标签分类",
    "translated_abstract": "产品属性值提取在电子商务等许多实际应用中起着重要作用，如产品搜索和推荐。之前的方法将其视为需要更多注释来标注产品文本中值的序列标记任务。这限制了它们在实际场景中的应用，其中每个产品只有属性值的弱标注，而没有它们的位置信息。此外，这些方法只使用产品文本（即产品标题和描述），而不考虑给定产品的多个属性值与其文本之间的语义连接，这可以帮助属性值提取。在本文中，我们将这个任务重新定义为一个多标签分类任务，可以在实际场景中应用，其中只有属性值的注释可用于训练模型（即没有属性值位置信息的注释）。我们提出了一个具有语义匹配和负标签采样的分类模型",
    "tldr": "本论文提出了一种基于语义匹配和负标签采样的多标签分类模型 AE-smnsMLC，用于解决产品属性值提取的问题。该模型将属性值提取任务转化为多标签分类任务，可以应用于只有属性值注释的实际场景，而无需属性值的位置信息注释。",
    "en_tdlr": "This paper proposes a multi-label classification model, AE-smnsMLC, with semantic matching and negative label sampling for product attribute value extraction. The model reformulates the task as a multi-label classification problem and can be applied to real-world scenarios where only attribute value annotations are available without positional information annotations."
}