{
    "title": "Enhancing Prostate Cancer Diagnosis with Deep Learning: A Study using mpMRI Segmentation and Classification. (arXiv:2310.05371v2 [eess.IV] UPDATED)",
    "abstract": "Prostate cancer (PCa) is a severe disease among men globally. It is important to identify PCa early and make a precise diagnosis for effective treatment. For PCa diagnosis, Multi-parametric magnetic resonance imaging (mpMRI) emerged as an invaluable imaging modality that offers a precise anatomical view of the prostate gland and its tissue structure. Deep learning (DL) models can enhance existing clinical systems and improve patient care by locating regions of interest for physicians. Recently, DL techniques have been employed to develop a pipeline for segmenting and classifying different cancer types. These studies show that DL can be used to increase diagnostic precision and give objective results without variability. This work uses well-known DL models for the classification and segmentation of mpMRI images to detect PCa. Our implementation involves four pipelines; Semantic DeepSegNet with ResNet50, DeepSegNet with recurrent neural network (RNN), U-Net with RNN, and U-Net with a lon",
    "link": "http://arxiv.org/abs/2310.05371",
    "context": "Title: Enhancing Prostate Cancer Diagnosis with Deep Learning: A Study using mpMRI Segmentation and Classification. (arXiv:2310.05371v2 [eess.IV] UPDATED)\nAbstract: Prostate cancer (PCa) is a severe disease among men globally. It is important to identify PCa early and make a precise diagnosis for effective treatment. For PCa diagnosis, Multi-parametric magnetic resonance imaging (mpMRI) emerged as an invaluable imaging modality that offers a precise anatomical view of the prostate gland and its tissue structure. Deep learning (DL) models can enhance existing clinical systems and improve patient care by locating regions of interest for physicians. Recently, DL techniques have been employed to develop a pipeline for segmenting and classifying different cancer types. These studies show that DL can be used to increase diagnostic precision and give objective results without variability. This work uses well-known DL models for the classification and segmentation of mpMRI images to detect PCa. Our implementation involves four pipelines; Semantic DeepSegNet with ResNet50, DeepSegNet with recurrent neural network (RNN), U-Net with RNN, and U-Net with a lon",
    "path": "papers/23/10/2310.05371.json",
    "total_tokens": 951,
    "translated_title": "用深度学习增强前列腺癌的诊断：一项使用mpMRI分割和分类的研究",
    "translated_abstract": "前列腺癌（PCa）是全球男性中的一种严重疾病。及早发现PCa并进行精确诊断是有效治疗的重要一步。对于PCa的诊断，多参数磁共振成像（mpMRI）已经成为一种宝贵的成像技术，提供了前列腺及其组织结构的精确解剖图像。深度学习（DL）模型可以通过为医生提供感兴趣区域来增强现有的临床系统并提高患者护理质量。最近，DL技术已被应用于开发用于分割和分类不同癌症类型的流程。这些研究表明，DL可以用于提高诊断精度并提供无变异的客观结果。本研究使用众所周知的DL模型对mpMRI图像进行分类和分割以检测PCa。我们的实现涉及四个流程：基于ResNet50的语义DeepSegNet，带有循环神经网络（RNN）的DeepSegNet，带有RNN的U-Net和带有lo...",
    "tldr": "本研究使用深度学习模型提高前列腺癌的诊断精度，通过对mpMRI图像进行分类和分割来帮助医生确定感兴趣的区域，并提供了无变异的客观结果。"
}