{
    "title": "Text-to-3D with Classifier Score Distillation. (arXiv:2310.19415v2 [cs.CV] UPDATED)",
    "abstract": "Text-to-3D generation has made remarkable progress recently, particularly with methods based on Score Distillation Sampling (SDS) that leverages pre-trained 2D diffusion models. While the usage of classifier-free guidance is well acknowledged to be crucial for successful optimization, it is considered an auxiliary trick rather than the most essential component. In this paper, we re-evaluate the role of classifier-free guidance in score distillation and discover a surprising finding: the guidance alone is enough for effective text-to-3D generation tasks. We name this method Classifier Score Distillation (CSD), which can be interpreted as using an implicit classification model for generation. This new perspective reveals new insights for understanding existing techniques. We validate the effectiveness of CSD across a variety of text-to-3D tasks including shape generation, texture synthesis, and shape editing, achieving results superior to those of state-of-the-art methods. Our project pa",
    "link": "http://arxiv.org/abs/2310.19415",
    "context": "Title: Text-to-3D with Classifier Score Distillation. (arXiv:2310.19415v2 [cs.CV] UPDATED)\nAbstract: Text-to-3D generation has made remarkable progress recently, particularly with methods based on Score Distillation Sampling (SDS) that leverages pre-trained 2D diffusion models. While the usage of classifier-free guidance is well acknowledged to be crucial for successful optimization, it is considered an auxiliary trick rather than the most essential component. In this paper, we re-evaluate the role of classifier-free guidance in score distillation and discover a surprising finding: the guidance alone is enough for effective text-to-3D generation tasks. We name this method Classifier Score Distillation (CSD), which can be interpreted as using an implicit classification model for generation. This new perspective reveals new insights for understanding existing techniques. We validate the effectiveness of CSD across a variety of text-to-3D tasks including shape generation, texture synthesis, and shape editing, achieving results superior to those of state-of-the-art methods. Our project pa",
    "path": "papers/23/10/2310.19415.json",
    "total_tokens": 892,
    "translated_title": "基于分类器分数蒸馏的文本到3D生成",
    "translated_abstract": "最近，文本到3D生成取得了显著的进展，尤其是基于分数蒸馏采样的方法，利用了预训练的2D扩散模型。虽然使用无分类器的指导被广泛认为是成功优化的关键，但它被视为辅助技巧而不是最重要的组成部分。在本文中，我们重新评估了分类器无关指导在分数蒸馏中的作用，并发现了一个令人惊讶的发现：仅凭指导就足以有效实现文本到3D生成任务。我们将这种方法命名为分类器分数蒸馏（CSD），可以将其解释为使用隐式分类模型进行生成。这种新的视角揭示了对现有技术的新见解。我们验证了CSD在各种文本到3D任务中的有效性，包括形状生成、纹理合成和形状编辑，在结果上超过了最先进方法。",
    "tldr": "本文提出了一种名为分类器分数蒸馏（CSD）的方法，它利用隐式分类模型进行文本到3D生成，证明了仅凭分类器无关指导就可以有效实现文本到3D生成任务，并在各种任务中取得了优于最先进方法的结果。",
    "en_tdlr": "This paper proposes a method called Classifier Score Distillation (CSD), which uses an implicit classification model for text-to-3D generation. The surprising finding is that the guidance alone is enough for effective generation tasks, achieving superior results in various tasks compared to state-of-the-art methods."
}