{
    "title": "Regularization-Based Methods for Ordinal Quantification. (arXiv:2310.09210v1 [cs.LG])",
    "abstract": "Quantification, i.e., the task of training predictors of the class prevalence values in sets of unlabeled data items, has received increased attention in recent years. However, most quantification research has concentrated on developing algorithms for binary and multiclass problems in which the classes are not ordered. Here, we study the ordinal case, i.e., the case in which a total order is defined on the set of n>2 classes. We give three main contributions to this field. First, we create and make available two datasets for ordinal quantification (OQ) research that overcome the inadequacies of the previously available ones. Second, we experimentally compare the most important OQ algorithms proposed in the literature so far. To this end, we bring together algorithms proposed by authors from very different research fields, such as data mining and astrophysics, who were unaware of each others' developments. Third, we propose a novel class of regularized OQ algorithms, which outperforms e",
    "link": "http://arxiv.org/abs/2310.09210",
    "context": "Title: Regularization-Based Methods for Ordinal Quantification. (arXiv:2310.09210v1 [cs.LG])\nAbstract: Quantification, i.e., the task of training predictors of the class prevalence values in sets of unlabeled data items, has received increased attention in recent years. However, most quantification research has concentrated on developing algorithms for binary and multiclass problems in which the classes are not ordered. Here, we study the ordinal case, i.e., the case in which a total order is defined on the set of n>2 classes. We give three main contributions to this field. First, we create and make available two datasets for ordinal quantification (OQ) research that overcome the inadequacies of the previously available ones. Second, we experimentally compare the most important OQ algorithms proposed in the literature so far. To this end, we bring together algorithms proposed by authors from very different research fields, such as data mining and astrophysics, who were unaware of each others' developments. Third, we propose a novel class of regularized OQ algorithms, which outperforms e",
    "path": "papers/23/10/2310.09210.json",
    "total_tokens": 899,
    "translated_title": "对序数量化问题的基于正则化的方法",
    "translated_abstract": "最近几年来，量化问题——即在未标记的数据项集中训练预测器的类别普遍性值——受到了越来越多的关注。然而，大多数量化研究集中在二分类和多分类问题的算法开发上，其中类别没有被排序。在本文中，我们研究了序数情况，即在n>2个类别的集合上定义了一个完全的排序。我们对这个领域做出了三个主要贡献。首先，我们创建并提供了两个序数计量（OQ）研究的数据集，克服了以前可用数据集的不足之处。其次，我们实验比较了迄今为止文献中提出的最重要的OQ算法。为此，我们将来自不同研究领域的作者提出的算法进行比较，如数据挖掘和天体物理学，这些作者对彼此的研究进展并不知晓。第三，我们提出了一种新颖的正则化OQ算法类别，它胜过了其它算法。",
    "tldr": "本文研究了序数量化问题，提出了两个新的数据集用于研究，实验比较了已有算法，并提出了一种性能更好的正则化OQ算法类别。",
    "en_tdlr": "This paper investigates the problem of ordinal quantification, presents two new datasets, conducts experimental comparisons of existing algorithms, and proposes a novel class of regularized OQ algorithms that outperforms others."
}