{
    "title": "A Spatial-Temporal Dual-Mode Mixed Flow Network for Panoramic Video Salient Object Detection. (arXiv:2310.09016v1 [cs.CV])",
    "abstract": "Salient object detection (SOD) in panoramic video is still in the initial exploration stage. The indirect application of 2D video SOD method to the detection of salient objects in panoramic video has many unmet challenges, such as low detection accuracy, high model complexity, and poor generalization performance. To overcome these hurdles, we design an Inter-Layer Attention (ILA) module, an Inter-Layer weight (ILW) module, and a Bi-Modal Attention (BMA) module. Based on these modules, we propose a Spatial-Temporal Dual-Mode Mixed Flow Network (STDMMF-Net) that exploits the spatial flow of panoramic video and the corresponding optical flow for SOD. First, the ILA module calculates the attention between adjacent level features of consecutive frames of panoramic video to improve the accuracy of extracting salient object features from the spatial flow. Then, the ILW module quantifies the salient object information contained in the features of each level to improve the fusion efficiency of ",
    "link": "http://arxiv.org/abs/2310.09016",
    "context": "Title: A Spatial-Temporal Dual-Mode Mixed Flow Network for Panoramic Video Salient Object Detection. (arXiv:2310.09016v1 [cs.CV])\nAbstract: Salient object detection (SOD) in panoramic video is still in the initial exploration stage. The indirect application of 2D video SOD method to the detection of salient objects in panoramic video has many unmet challenges, such as low detection accuracy, high model complexity, and poor generalization performance. To overcome these hurdles, we design an Inter-Layer Attention (ILA) module, an Inter-Layer weight (ILW) module, and a Bi-Modal Attention (BMA) module. Based on these modules, we propose a Spatial-Temporal Dual-Mode Mixed Flow Network (STDMMF-Net) that exploits the spatial flow of panoramic video and the corresponding optical flow for SOD. First, the ILA module calculates the attention between adjacent level features of consecutive frames of panoramic video to improve the accuracy of extracting salient object features from the spatial flow. Then, the ILW module quantifies the salient object information contained in the features of each level to improve the fusion efficiency of ",
    "path": "papers/23/10/2310.09016.json",
    "total_tokens": 1021,
    "translated_title": "一种用于全景视频显著目标检测的时空双模混合流网络",
    "translated_abstract": "全景视频中的显著目标检测仍处于初步探索阶段。将2D视频显著目标检测方法间接应用于全景视频中的显著目标检测面临许多挑战，如检测精度低、模型复杂度高和泛化性能差等。为了克服这些障碍，我们设计了一个交叉层注意力模块（ILA）、交叉层权重模块（ILW）和双模态注意力模块（BMA）。基于这些模块，我们提出了一种利用全景视频的空间流和相应光流进行显著目标检测的时空双模混合流网络（STDMMF-Net）。首先，ILA模块计算了相邻层级特征之间的注意力，以提高从空间流中提取显著目标特征的准确性。然后，ILW模块量化了每个层级特征中包含的显著目标信息，以提高融合效率。",
    "tldr": "本文提出了一种名为STDMMF-Net的时空双模混合流网络，用于全景视频显著目标检测。通过设计与应用交叉层注意力模块、交叉层权重模块和双模态注意力模块，该网络能够克服传统2D视频显著目标检测在全景视频中的困难，提高检测准确性和融合效率。"
}