{
    "title": "Neural Stress Fields for Reduced-order Elastoplasticity and Fracture. (arXiv:2310.17790v1 [cs.GR])",
    "abstract": "We propose a hybrid neural network and physics framework for reduced-order modeling of elastoplasticity and fracture. State-of-the-art scientific computing models like the Material Point Method (MPM) faithfully simulate large-deformation elastoplasticity and fracture mechanics. However, their long runtime and large memory consumption render them unsuitable for applications constrained by computation time and memory usage, e.g., virtual reality. To overcome these barriers, we propose a reduced-order framework. Our key innovation is training a low-dimensional manifold for the Kirchhoff stress field via an implicit neural representation. This low-dimensional neural stress field (NSF) enables efficient evaluations of stress values and, correspondingly, internal forces at arbitrary spatial locations. In addition, we also train neural deformation and affine fields to build low-dimensional manifolds for the deformation and affine momentum fields. These neural stress, deformation, and affine f",
    "link": "http://arxiv.org/abs/2310.17790",
    "context": "Title: Neural Stress Fields for Reduced-order Elastoplasticity and Fracture. (arXiv:2310.17790v1 [cs.GR])\nAbstract: We propose a hybrid neural network and physics framework for reduced-order modeling of elastoplasticity and fracture. State-of-the-art scientific computing models like the Material Point Method (MPM) faithfully simulate large-deformation elastoplasticity and fracture mechanics. However, their long runtime and large memory consumption render them unsuitable for applications constrained by computation time and memory usage, e.g., virtual reality. To overcome these barriers, we propose a reduced-order framework. Our key innovation is training a low-dimensional manifold for the Kirchhoff stress field via an implicit neural representation. This low-dimensional neural stress field (NSF) enables efficient evaluations of stress values and, correspondingly, internal forces at arbitrary spatial locations. In addition, we also train neural deformation and affine fields to build low-dimensional manifolds for the deformation and affine momentum fields. These neural stress, deformation, and affine f",
    "path": "papers/23/10/2310.17790.json",
    "total_tokens": 932,
    "translated_title": "神经应力场在降阶弹塑性和断裂中的应用",
    "translated_abstract": "我们提出了一种混合神经网络和物理框架用于降阶建模弹塑性和断裂。最先进的科学计算模型如材料点法 (MPM) 可以准确模拟大变形弹塑性和断裂力学。然而，它们的长运行时间和大内存消耗使其不适用于计算时间和内存使用受限的应用，例如虚拟现实。为克服这些障碍，我们提出了一种降阶框架。我们的关键创新是通过隐式神经表示训练一种基于Kirchhoff应力场的低维流形。这种低维神经应力场 (NSF) 可以高效地计算任意空间位置的应力值和对应的内部力。此外，我们还训练了神经变形和仿射场，为变形和仿射动量场建立低维流形。",
    "tldr": "本论文提出了一种神经网络和物理框架，用于降低弹塑性和断裂建模的计算需求。关键创新是通过训练低维神经应力场来实现在任意空间位置上高效计算应力值和内部力。此外，还训练了神经变形和仿射场来建立低维流形。",
    "en_tdlr": "This paper proposes a hybrid neural network and physics framework for reduced-order modeling of elastoplasticity and fracture. The key innovation is training a low-dimensional neural stress field that enables efficient computation of stress values and internal forces at arbitrary spatial locations. Additionally, neural deformation and affine fields are trained to build low-dimensional manifolds for deformation and affine momentum fields."
}