{
    "title": "No-Arbitrage Deep Calibration for Volatility Smile and Skewness. (arXiv:2310.16703v1 [q-fin.CP])",
    "abstract": "Volatility smile and skewness are two key properties of option prices that are represented by the implied volatility (IV) surface. However, IV surface calibration through nonlinear interpolation is a complex problem due to several factors, including limited input data, low liquidity, and noise. Additionally, the calibrated surface must obey the fundamental financial principle of the absence of arbitrage, which can be modeled by various differential inequalities over the partial derivatives of the option price with respect to the expiration time and the strike price. To address these challenges, we have introduced a Derivative-Constrained Neural Network (DCNN), which is an enhancement of a multilayer perceptron (MLP) that incorporates derivatives in the output function. DCNN allows us to generate a smooth surface and incorporate the no-arbitrage condition thanks to the derivative terms in the loss function. In numerical experiments, we apply the stochastic volatility model with smile an",
    "link": "http://arxiv.org/abs/2310.16703",
    "context": "Title: No-Arbitrage Deep Calibration for Volatility Smile and Skewness. (arXiv:2310.16703v1 [q-fin.CP])\nAbstract: Volatility smile and skewness are two key properties of option prices that are represented by the implied volatility (IV) surface. However, IV surface calibration through nonlinear interpolation is a complex problem due to several factors, including limited input data, low liquidity, and noise. Additionally, the calibrated surface must obey the fundamental financial principle of the absence of arbitrage, which can be modeled by various differential inequalities over the partial derivatives of the option price with respect to the expiration time and the strike price. To address these challenges, we have introduced a Derivative-Constrained Neural Network (DCNN), which is an enhancement of a multilayer perceptron (MLP) that incorporates derivatives in the output function. DCNN allows us to generate a smooth surface and incorporate the no-arbitrage condition thanks to the derivative terms in the loss function. In numerical experiments, we apply the stochastic volatility model with smile an",
    "path": "papers/23/10/2310.16703.json",
    "total_tokens": 848,
    "translated_title": "无套利深度标定波动率微笑和偏斜的方法",
    "translated_abstract": "波动率微笑和偏斜是期权价格的两个关键属性，通过隐含波动率曲面表示。然而，由于有限的输入数据、低流动性和噪声等多种因素，通过非线性插值进行波动率曲面标定是一个复杂的问题。此外，标定曲面必须遵守无套利的基本金融原则，这可以通过对期权价格相对于到期时间和行权价格的偏导数的各种微分不等式进行建模。为了应对这些挑战，我们引入了一种称为导数约束神经网络(DCNN)的方法，它是多层感知器(MLP)的改进版本，可以将导数纳入输出函数中。DCNN可以生成平滑的曲面，并通过损失函数中的导数项来增加无套利条件。在数值实验中，我们应用了具有微笑属性的随机波动率模型。",
    "tldr": "本研究提出了一种无套利深度标定波动率微笑和偏斜的方法，通过导数约束神经网络(DCNN)生成平滑曲面，并满足无套利条件。",
    "en_tdlr": "This paper proposes a no-arbitrage deep calibration method for volatility smile and skewness, using a Derivative-Constrained Neural Network (DCNN) to generate smooth surfaces while respecting the absence of arbitrage condition."
}