{
    "title": "Non-autoregressive Text Editing with Copy-aware Latent Alignments. (arXiv:2310.07821v1 [cs.CL])",
    "abstract": "Recent work has witnessed a paradigm shift from Seq2Seq to Seq2Edit in the field of text editing, with the aim of addressing the slow autoregressive inference problem posed by the former. Despite promising results, Seq2Edit approaches still face several challenges such as inflexibility in generation and difficulty in generalizing to other languages. In this work, we propose a novel non-autoregressive text editing method to circumvent the above issues, by modeling the edit process with latent CTC alignments. We make a crucial extension to CTC by introducing the copy operation into the edit space, thus enabling more efficient management of textual overlap in editing. We conduct extensive experiments on GEC and sentence fusion tasks, showing that our proposed method significantly outperforms existing Seq2Edit models and achieves similar or even better results than Seq2Seq with over $4\\times$ speedup. Moreover, it demonstrates good generalizability on German and Russian. In-depth analyses ",
    "link": "http://arxiv.org/abs/2310.07821",
    "context": "Title: Non-autoregressive Text Editing with Copy-aware Latent Alignments. (arXiv:2310.07821v1 [cs.CL])\nAbstract: Recent work has witnessed a paradigm shift from Seq2Seq to Seq2Edit in the field of text editing, with the aim of addressing the slow autoregressive inference problem posed by the former. Despite promising results, Seq2Edit approaches still face several challenges such as inflexibility in generation and difficulty in generalizing to other languages. In this work, we propose a novel non-autoregressive text editing method to circumvent the above issues, by modeling the edit process with latent CTC alignments. We make a crucial extension to CTC by introducing the copy operation into the edit space, thus enabling more efficient management of textual overlap in editing. We conduct extensive experiments on GEC and sentence fusion tasks, showing that our proposed method significantly outperforms existing Seq2Edit models and achieves similar or even better results than Seq2Seq with over $4\\times$ speedup. Moreover, it demonstrates good generalizability on German and Russian. In-depth analyses ",
    "path": "papers/23/10/2310.07821.json",
    "total_tokens": 947,
    "translated_title": "非自回归文本编辑方法与具有复制感知潜在对齐.",
    "translated_abstract": "近期的研究在文本编辑领域中将Seq2Seq转变为Seq2Edit，旨在解决前者中的慢自回归推理问题。尽管有着有希望的结果，Seq2Edit方法仍然面临着一些挑战，如生成的灵活性和推广到其他语言的困难。在本研究中，我们提出了一种新颖的非自回归文本编辑方法，通过建模具有复制操作的编辑过程的潜在CTC对齐来规避以上问题，从而可以更高效地处理文本重叠的编辑。我们在 GEC 和句子融合任务上进行了大量实验，表明我们的方法明显优于现有的Seq2Edit模型，并实现了与Seq2Seq相当或甚至更好的结果，同时有超过4倍的加速度。此外，我们还展示了它在德语和俄语上具有很好的泛化性能。",
    "tldr": "这篇论文提出了一种新的非自回归文本编辑方法，通过引入复制操作来管理文本重叠，解决了Seq2Edit方法在生成灵活性和跨语言推广方面的挑战。实验证明，该方法在GEC和句子融合任务上表现优异，并且在德语和俄语上具有良好的泛化性能。"
}