{
    "title": "Augmenting Vision-Based Human Pose Estimation with Rotation Matrix. (arXiv:2310.06068v1 [cs.CV])",
    "abstract": "Fitness applications are commonly used to monitor activities within the gym, but they often fail to automatically track indoor activities inside the gym. This study proposes a model that utilizes pose estimation combined with a novel data augmentation method, i.e., rotation matrix. We aim to enhance the classification accuracy of activity recognition based on pose estimation data. Through our experiments, we experiment with different classification algorithms along with image augmentation approaches. Our findings demonstrate that the SVM with SGD optimization, using data augmentation with the Rotation Matrix, yields the most accurate results, achieving a 96% accuracy rate in classifying five physical activities. Conversely, without implementing the data augmentation techniques, the baseline accuracy remains at a modest 64%.",
    "link": "http://arxiv.org/abs/2310.06068",
    "context": "Title: Augmenting Vision-Based Human Pose Estimation with Rotation Matrix. (arXiv:2310.06068v1 [cs.CV])\nAbstract: Fitness applications are commonly used to monitor activities within the gym, but they often fail to automatically track indoor activities inside the gym. This study proposes a model that utilizes pose estimation combined with a novel data augmentation method, i.e., rotation matrix. We aim to enhance the classification accuracy of activity recognition based on pose estimation data. Through our experiments, we experiment with different classification algorithms along with image augmentation approaches. Our findings demonstrate that the SVM with SGD optimization, using data augmentation with the Rotation Matrix, yields the most accurate results, achieving a 96% accuracy rate in classifying five physical activities. Conversely, without implementing the data augmentation techniques, the baseline accuracy remains at a modest 64%.",
    "path": "papers/23/10/2310.06068.json",
    "total_tokens": 872,
    "translated_title": "使用旋转矩阵增强基于视觉的人体姿势估计",
    "translated_abstract": "健身应用通常用于监控健身房内的活动，但它们常常无法自动跟踪健身房内部的活动。本研究提出了一种模型，该模型利用姿势估计与一种新颖的数据增强方法，即旋转矩阵。我们的目标是通过姿势估计数据来提高活动识别的分类准确性。通过实验，我们尝试了不同的分类算法以及图像增强方法。我们的研究结果表明，利用带有旋转矩阵数据增强的SVM与SGD优化的方法在分类五种体育活动方面取得了最准确的结果，准确率达到了96%。相反，如果不实施数据增强技术，基准准确率仅为64%。",
    "tldr": "本研究提出使用旋转矩阵的模型，以增强基于姿势估计的活动识别的分类准确性。通过实验证明，利用带有旋转矩阵数据增强的SVM与SGD优化方法，在分类五种体育活动时达到了96%的准确率，相比之下，不实施数据增强技术的基准准确率仅为64%。"
}