{
    "title": "Privacy-Preserving Encrypted Low-Dose CT Denoising. (arXiv:2310.09101v1 [cs.CR])",
    "abstract": "Deep learning (DL) has made significant advancements in tomographic imaging, particularly in low-dose computed tomography (LDCT) denoising. A recent trend involves servers training powerful models with large amounts of self-collected private data and providing application programming interfaces (APIs) for users, such as Chat-GPT. To avoid model leakage, users are required to upload their data to the server model, but this way raises public concerns about the potential risk of privacy disclosure, especially for medical data. Hence, to alleviate related concerns, in this paper, we propose to directly denoise LDCT in the encrypted domain to achieve privacy-preserving cloud services without exposing private data to the server. To this end, we employ homomorphic encryption to encrypt private LDCT data, which is then transferred to the server model trained with plaintext LDCT for further denoising. However, since traditional operations, such as convolution and linear transformation, in DL me",
    "link": "http://arxiv.org/abs/2310.09101",
    "context": "Title: Privacy-Preserving Encrypted Low-Dose CT Denoising. (arXiv:2310.09101v1 [cs.CR])\nAbstract: Deep learning (DL) has made significant advancements in tomographic imaging, particularly in low-dose computed tomography (LDCT) denoising. A recent trend involves servers training powerful models with large amounts of self-collected private data and providing application programming interfaces (APIs) for users, such as Chat-GPT. To avoid model leakage, users are required to upload their data to the server model, but this way raises public concerns about the potential risk of privacy disclosure, especially for medical data. Hence, to alleviate related concerns, in this paper, we propose to directly denoise LDCT in the encrypted domain to achieve privacy-preserving cloud services without exposing private data to the server. To this end, we employ homomorphic encryption to encrypt private LDCT data, which is then transferred to the server model trained with plaintext LDCT for further denoising. However, since traditional operations, such as convolution and linear transformation, in DL me",
    "path": "papers/23/10/2310.09101.json",
    "total_tokens": 895,
    "translated_title": "隐私保护的加密低剂量CT去噪",
    "translated_abstract": "深度学习在断层成像中取得了显著的进展，特别是在低剂量计算机断层扫描（LDCT）去噪方面。最近的一个趋势是使用服务器训练具有大量自我收集的私有数据的强大模型，并为用户提供应用编程接口（API），如Chat-GPT。为了避免模型泄漏，用户需要将其数据上传到服务器模型，但这种方式引起了公众对于隐私泄露风险的关注，尤其是对于医疗数据。因此，为了减轻相关担忧，本文提出在加密领域直接对LDCT进行去噪，以实现对云服务的隐私保护，而不将私有数据暴露给服务器。为此，我们采用同态加密来加密私有的LDCT数据，然后将其传输给使用明文LDCT训练的服务器模型进行进一步的去噪处理。然而，由于深度学习中传统的操作（如卷积和线性变换）需要明文数据，因此在加密领域进行低剂量CT去噪仍然存在挑战。",
    "tldr": "本论文提出了一种隐私保护的加密低剂量CT去噪方法，通过使用同态加密对私有数据进行加密，避免了将数据暴露给服务器的风险，实现了隐私保护的云服务。"
}