{
    "title": "Pre-electoral coalition agreement from the Black-Scholes point of view. (arXiv:2310.16424v1 [math.AP])",
    "abstract": "A political party can be considered as a company whose value depends on the voters support i.e. on the percentage of population supporting the party. Dynamics of the support is thus as a stochastic process with a deterministic growth rate perturbed by a white noise modeled through the Wiener process. This is in an analogy with the option modeling where the stock price behaves similarly as the voters' support. While in the option theory we have the question of fair price of an option, the question that we ask here is what is a reasonable level of support that the coalition of a major party (safely above the election threshold) and a minor party (under or around the election threshold) should achieve in order the minor party to get one more representative. We shall elaborate some of the conclusions in the case of recent elections in Montenegro (June, 2023) which are particularly interesting due to lots of political subjects entering the race.",
    "link": "http://arxiv.org/abs/2310.16424",
    "context": "Title: Pre-electoral coalition agreement from the Black-Scholes point of view. (arXiv:2310.16424v1 [math.AP])\nAbstract: A political party can be considered as a company whose value depends on the voters support i.e. on the percentage of population supporting the party. Dynamics of the support is thus as a stochastic process with a deterministic growth rate perturbed by a white noise modeled through the Wiener process. This is in an analogy with the option modeling where the stock price behaves similarly as the voters' support. While in the option theory we have the question of fair price of an option, the question that we ask here is what is a reasonable level of support that the coalition of a major party (safely above the election threshold) and a minor party (under or around the election threshold) should achieve in order the minor party to get one more representative. We shall elaborate some of the conclusions in the case of recent elections in Montenegro (June, 2023) which are particularly interesting due to lots of political subjects entering the race.",
    "path": "papers/23/10/2310.16424.json",
    "total_tokens": 890,
    "translated_title": "黑-斯科尔斯视角下的选举前联盟协议",
    "translated_abstract": "一个政党可以被视为一个其价值依赖于选民支持的公司，即取决于支持该党的人口百分比。支持率的动态可以看作是一个受白噪声扰动的确定性增长率的随机过程，其中白噪声通过维纳过程进行建模。这类似于期权模型中的股票价格与选民支持的行为类似。在期权理论中，我们有一个关于期权公平价格的问题，而我们在这里问的问题是一个主要党派（安全地超过选举门槛）与一个次要党派（接近或低于选举门槛）的联盟应该实现什么合理的支持水平，以便次要党派获得一个额外的代表。我们将详细阐述一些关于黑山最近选举（2023年6月）的结论，由于许多政治议题进入了竞选，这使得这个问题特别有趣。",
    "tldr": "从黑-斯科尔斯视角来看，研究选举前联盟协议中主要党派与次要党派的支持水平关系，并在黑山2023年6月的选举中进行了具体分析。",
    "en_tdlr": "This paper investigates the relationship between the support levels of the major and minor parties in pre-electoral coalition agreements from the Black-Scholes perspective and provides specific analysis in the context of the 2023 June elections in Montenegro, where multiple political subjects entered the race."
}