{
    "title": "Performance Tuning for GPU-Embedded Systems: Machine-Learning-based and Analytical Model-driven Tuning Methodologies. (arXiv:2310.16214v1 [cs.DC])",
    "abstract": "GPU-embedded systems have gained popularity across various domains due to their efficient power consumption. However, in order to meet the demands of real-time or time-consuming applications running on these systems, it is crucial for them to be tuned to exhibit high performance. This paper addresses the issue by developing and comparing two tuning methodologies on GPU-embedded systems, and also provides performance insights for developers and researchers seeking to optimize applications running on these architectures. We focus on parallel prefix operations, such as FFT, scan primitives, and tridiagonal system solvers, which are performance-critical components in many applications. The study introduces an analytical model-driven tuning methodology and a Machine Learning (ML)-based tuning methodology. We evaluate the performance of the two tuning methodologies for different parallel prefix implementations of the BPLG library in an NVIDIA Jetson system, and compare their performance to t",
    "link": "http://arxiv.org/abs/2310.16214",
    "context": "Title: Performance Tuning for GPU-Embedded Systems: Machine-Learning-based and Analytical Model-driven Tuning Methodologies. (arXiv:2310.16214v1 [cs.DC])\nAbstract: GPU-embedded systems have gained popularity across various domains due to their efficient power consumption. However, in order to meet the demands of real-time or time-consuming applications running on these systems, it is crucial for them to be tuned to exhibit high performance. This paper addresses the issue by developing and comparing two tuning methodologies on GPU-embedded systems, and also provides performance insights for developers and researchers seeking to optimize applications running on these architectures. We focus on parallel prefix operations, such as FFT, scan primitives, and tridiagonal system solvers, which are performance-critical components in many applications. The study introduces an analytical model-driven tuning methodology and a Machine Learning (ML)-based tuning methodology. We evaluate the performance of the two tuning methodologies for different parallel prefix implementations of the BPLG library in an NVIDIA Jetson system, and compare their performance to t",
    "path": "papers/23/10/2310.16214.json",
    "total_tokens": 813,
    "translated_title": "GPU嵌入式系统的性能优化：基于机器学习和分析模型的优化方法",
    "translated_abstract": "GPU嵌入式系统因其高效的能耗而在各个领域中变得流行。然而，为了满足这些系统运行实时或耗时应用程序的需求，将其调整以展现出高性能是至关重要的。本文通过开发和比较两种在GPU嵌入式系统上的优化方法来解决这个问题，并为寻求优化运行在这些架构上的应用程序的开发人员和研究人员提供性能洞察。我们重点关注并行前缀操作，如FFT、扫描原语和三对角系统求解器，这些是许多应用程序中性能关键的组件。本研究引入了一种基于分析模型的优化方法和一种基于机器学习（ML）的优化方法。我们评估了这两种优化方法在NVIDIA Jetson系统中BPLG库的不同并行前缀实现的性能，并将其与现有方法的性能进行比较。",
    "tldr": "本文开发了一种基于分析模型和基于机器学习的GPU嵌入式系统优化方法，针对并行前缀操作进行了性能评估，并提供了性能洞察。"
}