{
    "title": "Whole-brain radiomics for clustered federated personalization in brain tumor segmentation. (arXiv:2310.11480v1 [eess.IV])",
    "abstract": "Federated learning and its application to medical image segmentation have recently become a popular research topic. This training paradigm suffers from statistical heterogeneity between participating institutions' local datasets, incurring convergence slowdown as well as potential accuracy loss compared to classical training. To mitigate this effect, federated personalization emerged as the federated optimization of one model per institution. We propose a novel personalization algorithm tailored to the feature shift induced by the usage of different scanners and acquisition parameters by different institutions. This method is the first to account for both inter and intra-institution feature shift (multiple scanners used in a single institution). It is based on the computation, within each centre, of a series of radiomic features capturing the global texture of each 3D image volume, followed by a clustering analysis pooling all feature vectors transferred from the local institutions to ",
    "link": "http://arxiv.org/abs/2310.11480",
    "context": "Title: Whole-brain radiomics for clustered federated personalization in brain tumor segmentation. (arXiv:2310.11480v1 [eess.IV])\nAbstract: Federated learning and its application to medical image segmentation have recently become a popular research topic. This training paradigm suffers from statistical heterogeneity between participating institutions' local datasets, incurring convergence slowdown as well as potential accuracy loss compared to classical training. To mitigate this effect, federated personalization emerged as the federated optimization of one model per institution. We propose a novel personalization algorithm tailored to the feature shift induced by the usage of different scanners and acquisition parameters by different institutions. This method is the first to account for both inter and intra-institution feature shift (multiple scanners used in a single institution). It is based on the computation, within each centre, of a series of radiomic features capturing the global texture of each 3D image volume, followed by a clustering analysis pooling all feature vectors transferred from the local institutions to ",
    "path": "papers/23/10/2310.11480.json",
    "total_tokens": 911,
    "translated_title": "基于集群联邦个性化的全脑影像组学用于脑肿瘤分割",
    "translated_abstract": "联邦学习及其在医学图像分割中的应用最近成为热门的研究课题。这种训练范式在参与机构的本地数据集之间存在统计异质性，导致收敛速度减慢，以及与经典训练相比潜在的准确性损失。为了缓解这种影响，联邦个性化作为每个机构的联邦优化逐渐崭露头角。我们提出了一种新颖的个性化算法，针对不同机构使用不同扫描仪和采集参数引起的特征转移问题进行优化。该方法是第一个同时考虑了机构间和机构内特征转移问题（同一个机构使用多个扫描仪）的方法。它基于在每个中心计算一系列放射组学特征，捕捉每个3D图像体素的全局纹理，然后通过聚类分析汇总从本地机构转移的所有特征向量。",
    "tldr": "该论文提出了基于集群联邦个性化的全脑影像组学方法，通过考虑不同机构间和机构内特征转移问题，解决了联邦学习中的统计异质性带来的收敛问题和准确性损失。",
    "en_tdlr": "This paper proposes a whole-brain radiomics approach for clustered federated personalization in brain tumor segmentation. It addresses the issue of statistical heterogeneity in federated learning by considering both inter and intra-institution feature shift, leading to improved convergence and accuracy."
}