{
    "title": "Pyramidal Hidden Markov Model For Multivariate Time Series Forecasting",
    "abstract": "arXiv:2310.14341v2 Announce Type: replace  Abstract: The Hidden Markov Model (HMM) can predict the future value of a time series based on its current and previous values, making it a powerful algorithm for handling various types of time series. Numerous studies have explored the improvement of HMM using advanced techniques, leading to the development of several variations of HMM. Despite these studies indicating the increased competitiveness of HMM compared to other advanced algorithms, few have recognized the significance and impact of incorporating multistep stochastic states into its performance. In this work, we propose a Pyramidal Hidden Markov Model (PHMM) that can capture multiple multistep stochastic states. Initially, a multistep HMM is designed for extracting short multistep stochastic states. Next, a novel time series forecasting structure is proposed based on PHMM, which utilizes pyramid-like stacking to adaptively identify long multistep stochastic states. By employing the",
    "link": "https://arxiv.org/abs/2310.14341",
    "context": "Title: Pyramidal Hidden Markov Model For Multivariate Time Series Forecasting\nAbstract: arXiv:2310.14341v2 Announce Type: replace  Abstract: The Hidden Markov Model (HMM) can predict the future value of a time series based on its current and previous values, making it a powerful algorithm for handling various types of time series. Numerous studies have explored the improvement of HMM using advanced techniques, leading to the development of several variations of HMM. Despite these studies indicating the increased competitiveness of HMM compared to other advanced algorithms, few have recognized the significance and impact of incorporating multistep stochastic states into its performance. In this work, we propose a Pyramidal Hidden Markov Model (PHMM) that can capture multiple multistep stochastic states. Initially, a multistep HMM is designed for extracting short multistep stochastic states. Next, a novel time series forecasting structure is proposed based on PHMM, which utilizes pyramid-like stacking to adaptively identify long multistep stochastic states. By employing the",
    "path": "papers/23/10/2310.14341.json",
    "total_tokens": 872,
    "translated_title": "金字塔形隐藏马尔可夫模型用于多元时间序列预测",
    "translated_abstract": "隐藏马尔可夫模型（HMM）可以根据当前和先前值预测时间序列的未来值，使其成为处理各种类型时间序列的强大算法。许多研究探索了利用先进技术改进HMM的方法，导致了几种HMM的变体的发展。尽管这些研究表明HMM与其他先进算法相比具有增强的竞争力，但很少有人意识到将多步随机状态纳入其性能的重要性和影响。在这项工作中，我们提出了一个能够捕捉多个多步随机状态的金字塔形隐藏马尔可夫模型（PHMM）。最初，设计了一个多步HMM用于提取短多步随机状态。接下来，基于PHMM提出了一种新颖的时间序列预测结构，利用类似金字塔堆叠的方式自适应地识别长多步随机状态。通过采用",
    "tldr": "本论文提出了一种金字塔形隐藏马尔可夫模型（PHMM），能够捕捉多个多步随机状态，并提出一种新颖的时间序列预测结构，在性能上具有重要影响。",
    "en_tdlr": "This paper proposes a Pyramidal Hidden Markov Model (PHMM) that can capture multiple multistep stochastic states and introduces a novel time series forecasting structure with significant impact on performance."
}