{
    "title": "Unsupervised Lead Sheet Generation via Semantic Compression. (arXiv:2310.10772v1 [cs.SD])",
    "abstract": "Lead sheets have become commonplace in generative music research, being used as an initial compressed representation for downstream tasks like multitrack music generation and automatic arrangement. Despite this, researchers have often fallen back on deterministic reduction methods (such as the skyline algorithm) to generate lead sheets when seeking paired lead sheets and full scores, with little attention being paid toward the quality of the lead sheets themselves and how they accurately reflect their orchestrated counterparts. To address these issues, we propose the problem of conditional lead sheet generation (i.e. generating a lead sheet given its full score version), and show that this task can be formulated as an unsupervised music compression task, where the lead sheet represents a compressed latent version of the score. We introduce a novel model, called Lead-AE, that models the lead sheets as a discrete subselection of the original sequence, using a differentiable top-k operato",
    "link": "http://arxiv.org/abs/2310.10772",
    "context": "Title: Unsupervised Lead Sheet Generation via Semantic Compression. (arXiv:2310.10772v1 [cs.SD])\nAbstract: Lead sheets have become commonplace in generative music research, being used as an initial compressed representation for downstream tasks like multitrack music generation and automatic arrangement. Despite this, researchers have often fallen back on deterministic reduction methods (such as the skyline algorithm) to generate lead sheets when seeking paired lead sheets and full scores, with little attention being paid toward the quality of the lead sheets themselves and how they accurately reflect their orchestrated counterparts. To address these issues, we propose the problem of conditional lead sheet generation (i.e. generating a lead sheet given its full score version), and show that this task can be formulated as an unsupervised music compression task, where the lead sheet represents a compressed latent version of the score. We introduce a novel model, called Lead-AE, that models the lead sheets as a discrete subselection of the original sequence, using a differentiable top-k operato",
    "path": "papers/23/10/2310.10772.json",
    "total_tokens": 884,
    "translated_title": "通过语义压缩实现无监督的主旋律生成",
    "translated_abstract": "主旋律谱单已经在生成音乐研究中变得常见，被用作下游任务（如多轨音乐生成和自动编曲）的初步压缩表示。尽管如此，研究人员在寻找配对的主旋律谱单和完整分谱时通常会回到确定性的降维方法（如天际线算法）来生成主旋律谱单，很少关注主旋律谱单本身的质量以及它们如何准确反映编曲后的对应版本。为了解决这些问题，我们提出了条件主旋律谱单生成的问题（即在给定其完整分谱版本的情况下生成主旋律谱单），并展示这一任务可以被构建为无监督的音乐压缩任务，其中主旋律谱单代表了分谱的压缩潜在版本。我们引入了一种新的模型，称为Lead-AE，它将主旋律谱单建模为原始序列的离散子选择，使用可微分的top-k操作。",
    "tldr": "该论文提出了无监督的主旋律生成方法，通过语义压缩将完整分谱转换为主旋律谱单。引入了一种新的模型Lead-AE来实现这一目标。",
    "en_tdlr": "This paper proposes an unsupervised approach for lead sheet generation by utilizing semantic compression to convert full scores into compressed lead sheets. A novel model called Lead-AE is introduced to accomplish this task."
}