{
    "title": "An adaptive ensemble filter for heavy-tailed distributions: tuning-free inflation and localization. (arXiv:2310.08741v1 [stat.CO])",
    "abstract": "Heavy tails is a common feature of filtering distributions that results from the nonlinear dynamical and observation processes as well as the uncertainty from physical sensors. In these settings, the Kalman filter and its ensemble version - the ensemble Kalman filter (EnKF) - that have been designed under Gaussian assumptions result in degraded performance. t-distributions are a parametric family of distributions whose tail-heaviness is modulated by a degree of freedom $\\nu$. Interestingly, Cauchy and Gaussian distributions correspond to the extreme cases of a t-distribution for $\\nu = 1$ and $\\nu = \\infty$, respectively. Leveraging tools from measure transport (Spantini et al., SIAM Review, 2022), we present a generalization of the EnKF whose prior-to-posterior update leads to exact inference for t-distributions. We demonstrate that this filter is less sensitive to outlying synthetic observations generated by the observation model for small $\\nu$. Moreover, it recovers the Kalman filt",
    "link": "http://arxiv.org/abs/2310.08741",
    "context": "Title: An adaptive ensemble filter for heavy-tailed distributions: tuning-free inflation and localization. (arXiv:2310.08741v1 [stat.CO])\nAbstract: Heavy tails is a common feature of filtering distributions that results from the nonlinear dynamical and observation processes as well as the uncertainty from physical sensors. In these settings, the Kalman filter and its ensemble version - the ensemble Kalman filter (EnKF) - that have been designed under Gaussian assumptions result in degraded performance. t-distributions are a parametric family of distributions whose tail-heaviness is modulated by a degree of freedom $\\nu$. Interestingly, Cauchy and Gaussian distributions correspond to the extreme cases of a t-distribution for $\\nu = 1$ and $\\nu = \\infty$, respectively. Leveraging tools from measure transport (Spantini et al., SIAM Review, 2022), we present a generalization of the EnKF whose prior-to-posterior update leads to exact inference for t-distributions. We demonstrate that this filter is less sensitive to outlying synthetic observations generated by the observation model for small $\\nu$. Moreover, it recovers the Kalman filt",
    "path": "papers/23/10/2310.08741.json",
    "total_tokens": 980,
    "translated_title": "自适应集合滤波器对重尾分布的应用：免调节膨胀和定位",
    "translated_abstract": "重尾分布是由非线性动力学和观测过程以及物理传感器的不确定性造成的滤波分布的常见特征。在这些情况下，基于高斯假设的卡尔曼滤波器及其集合版本 - 集合卡尔曼滤波器 (EnKF) - 的性能会下降。t-分布是一个参数化的分布族，其尾部重度由自由度 $\\nu$ 调制。有趣的是，Cauchy分布和高斯分布分别对应于 $\\nu = 1$ 和 $\\nu = \\infty$ 的t-分布的极端情况。借助于测量传输的工具 (Spantini et al., SIAM Review, 2022)，我们提出了EnKF的一般化版本，其先验到后验更新能够对t-分布进行精确推断。我们证明，这个滤波器对由观测模型生成的离群合成观测值的敏感性较小，尤其在较小的 $\\nu$ 值下。此外，它恢复了卡尔曼滤波器的性能。",
    "tldr": "我们提出了一种自适应的集合滤波器，能够处理重尾分布，并且不需要调节膨胀和定位参数。这个滤波器通过将先验和后验更新与t-分布的精确推断相结合，提供了更好的性能和对离群观测值的鲁棒性。"
}