{
    "title": "ManyQuadrupeds: Learning a Single Locomotion Policy for Diverse Quadruped Robots",
    "abstract": "arXiv:2310.10486v2 Announce Type: replace-cross  Abstract: Learning a locomotion policy for quadruped robots has traditionally been constrained to a specific robot morphology, mass, and size. The learning process must usually be repeated for every new robot, where hyperparameters and reward function weights must be re-tuned to maximize performance for each new system. Alternatively, attempting to train a single policy to accommodate different robot sizes, while maintaining the same degrees of freedom (DoF) and morphology, requires either complex learning frameworks, or mass, inertia, and dimension randomization, which leads to prolonged training periods. In our study, we show that drawing inspiration from animal motor control allows us to effectively train a single locomotion policy capable of controlling a diverse range of quadruped robots. The robot differences encompass: a variable number of DoFs, (i.e. 12 or 16 joints), three distinct morphologies, a broad mass range spanning from ",
    "link": "https://arxiv.org/abs/2310.10486",
    "context": "Title: ManyQuadrupeds: Learning a Single Locomotion Policy for Diverse Quadruped Robots\nAbstract: arXiv:2310.10486v2 Announce Type: replace-cross  Abstract: Learning a locomotion policy for quadruped robots has traditionally been constrained to a specific robot morphology, mass, and size. The learning process must usually be repeated for every new robot, where hyperparameters and reward function weights must be re-tuned to maximize performance for each new system. Alternatively, attempting to train a single policy to accommodate different robot sizes, while maintaining the same degrees of freedom (DoF) and morphology, requires either complex learning frameworks, or mass, inertia, and dimension randomization, which leads to prolonged training periods. In our study, we show that drawing inspiration from animal motor control allows us to effectively train a single locomotion policy capable of controlling a diverse range of quadruped robots. The robot differences encompass: a variable number of DoFs, (i.e. 12 or 16 joints), three distinct morphologies, a broad mass range spanning from ",
    "path": "papers/23/10/2310.10486.json",
    "total_tokens": 872,
    "translated_title": "ManyQuadrupeds: 学习适用于多样化四足机器人的单一运动策略",
    "translated_abstract": "传统上，为四足机器人学习运动策略通常受限于特定的机器人形态、质量和尺寸。学习过程通常必须针对每台新机器人重复进行，需要重新调整超参数和奖励函数权重以最大化每个新系统的性能。另外，尝试训练一个单一策略以适应不同大小的机器人，同时保持相同的自由度（DoF）和形态，需要复杂的学习框架，或者质量、惯性和尺寸随机化，这导致训练时间延长。在我们的研究中，我们展示受动物运动控制的启发，可以有效地训练一个能够控制多样化四足机器人的单一运动策略。这些机器人的差异包括：可变数量的DoF（即12或16个关节）、三种不同的形态和从较低到较高质量范围的广泛质量跨度。",
    "tldr": "通过受动物运动控制的启发，我们展示出能够有效训练一个单一运动策略，可以控制多样化四足机器人。",
    "en_tdlr": "Drawing inspiration from animal motor control, we demonstrate the effective training of a single locomotion policy capable of controlling a diverse range of quadruped robots."
}