{
    "title": "Burgers' pinns with implicit euler transfer learning. (arXiv:2310.15343v1 [cs.LG])",
    "abstract": "The Burgers equation is a well-established test case in the computational modeling of several phenomena such as fluid dynamics, gas dynamics, shock theory, cosmology, and others. In this work, we present the application of Physics-Informed Neural Networks (PINNs) with an implicit Euler transfer learning approach to solve the Burgers equation. The proposed approach consists in seeking a time-discrete solution by a sequence of Artificial Neural Networks (ANNs). At each time step, the previous ANN transfers its knowledge to the next network model, which learns the current time solution by minimizing a loss function based on the implicit Euler approximation of the Burgers equation. The approach is tested for two benchmark problems: the first with an exact solution and the other with an alternative analytical solution. In comparison to the usual PINN models, the proposed approach has the advantage of requiring smaller neural network architectures with similar accurate results and potentiall",
    "link": "http://arxiv.org/abs/2310.15343",
    "context": "Title: Burgers' pinns with implicit euler transfer learning. (arXiv:2310.15343v1 [cs.LG])\nAbstract: The Burgers equation is a well-established test case in the computational modeling of several phenomena such as fluid dynamics, gas dynamics, shock theory, cosmology, and others. In this work, we present the application of Physics-Informed Neural Networks (PINNs) with an implicit Euler transfer learning approach to solve the Burgers equation. The proposed approach consists in seeking a time-discrete solution by a sequence of Artificial Neural Networks (ANNs). At each time step, the previous ANN transfers its knowledge to the next network model, which learns the current time solution by minimizing a loss function based on the implicit Euler approximation of the Burgers equation. The approach is tested for two benchmark problems: the first with an exact solution and the other with an alternative analytical solution. In comparison to the usual PINN models, the proposed approach has the advantage of requiring smaller neural network architectures with similar accurate results and potentiall",
    "path": "papers/23/10/2310.15343.json",
    "total_tokens": 944,
    "translated_title": "用隐式欧拉迁移学习的PINNs求解Burgers方程",
    "translated_abstract": "Burgers方程是计算建模中多种现象（如流体动力学、气体动力学、冲击理论、宇宙学等）的一个成熟的测试案例。本文将物理构建的神经网络（PINNs）与隐式欧拉迁移学习方法相结合，应用于求解Burgers方程。所提出的方法通过一系列人工神经网络（ANNs）寻求时间离散解。在每个时间步骤中，前一个ANN将其知识传递给下一个网络模型，通过最小化基于Burgers方程隐式欧拉近似的损失函数，学习当前时间解。该方法在两个基准问题上进行了测试：一个具有精确解，另一个具有替代解析解。与通常的PINN模型相比，所提出的方法具有更小的神经网络结构，同时具有类似准确结果和潜在的优势。",
    "tldr": "本研究将物理构建的神经网络（PINNs）与隐式欧拉迁移学习方法相结合，应用于求解Burgers方程。通过一系列人工神经网络，从前一个网络向下一个网络传递知识，并通过最小化基于隐式欧拉近似的损失函数，学习当前时间解。与通常的PINN模型相比，该方法具有更小的神经网络结构，同时具有类似准确结果和潜在优势。",
    "en_tdlr": "This paper combines Physics-Informed Neural Networks (PINNs) with implicit Euler transfer learning to solve the Burgers equation. By transferring knowledge from one network to another and minimizing a loss function based on the implicit Euler approximation, the proposed approach achieves accurate results with smaller neural network architectures compared to traditional PINN models."
}