{
    "title": "VR PreM+: An Immersive Pre-learning Branching Visualization System for Museum Tours. (arXiv:2310.13294v1 [cs.HC])",
    "abstract": "We present VR PreM+, an innovative VR system designed to enhance web exploration beyond traditional computer screens. Unlike static 2D displays, VR PreM+ leverages 3D environments to create an immersive pre-learning experience. Using keyword-based information retrieval allows users to manage and connect various content sources in a dynamic 3D space, improving communication and data comparison. We conducted preliminary and user studies that demonstrated efficient information retrieval, increased user engagement, and a greater sense of presence. These findings yielded three design guidelines for future VR information systems: display, interaction, and user-centric design. VR PreM+ bridges the gap between traditional web browsing and immersive VR, offering an interactive and comprehensive approach to information acquisition. It holds promise for research, education, and beyond.",
    "link": "http://arxiv.org/abs/2310.13294",
    "context": "Title: VR PreM+: An Immersive Pre-learning Branching Visualization System for Museum Tours. (arXiv:2310.13294v1 [cs.HC])\nAbstract: We present VR PreM+, an innovative VR system designed to enhance web exploration beyond traditional computer screens. Unlike static 2D displays, VR PreM+ leverages 3D environments to create an immersive pre-learning experience. Using keyword-based information retrieval allows users to manage and connect various content sources in a dynamic 3D space, improving communication and data comparison. We conducted preliminary and user studies that demonstrated efficient information retrieval, increased user engagement, and a greater sense of presence. These findings yielded three design guidelines for future VR information systems: display, interaction, and user-centric design. VR PreM+ bridges the gap between traditional web browsing and immersive VR, offering an interactive and comprehensive approach to information acquisition. It holds promise for research, education, and beyond.",
    "path": "papers/23/10/2310.13294.json",
    "total_tokens": 863,
    "translated_title": "VR PreM+：一个沉浸式的博物馆导览预学习分支可视化系统",
    "translated_abstract": "我们提出了VR PreM+，一个创新的VR系统，旨在增强传统电脑屏幕以外的网络探索。与静态的2D显示不同，VR PreM+利用3D环境创建了沉浸式的预学习体验。通过关键字信息检索，用户可以在动态的3D空间中管理和连接各种内容来源，提高沟通和数据比较的能力。我们进行了初步和用户研究，证明了高效的信息检索、增加了用户参与度和更强的存在感。这些发现为未来的VR信息系统提供了三个设计指导原则：显示、交互和以用户为中心的设计。VR PreM+弥补了传统的网络浏览和沉浸式VR之间的差距，提供了一种交互式和全面的信息获取方法。它在研究、教育等领域具有潜力。",
    "tldr": "VR PreM+是一个沉浸式的博物馆导览预学习分支可视化系统，通过关键字信息检索在动态的3D空间中管理和连接各种内容来源，提高了沟通和数据比较的能力，有望应用于研究和教育等领域。",
    "en_tdlr": "VR PreM+ is an immersive VR system for museum tours that leverages 3D environments and keyword-based information retrieval to enhance communication and data comparison. It bridges the gap between traditional web browsing and immersive VR, offering a comprehensive approach to information acquisition."
}