{
    "title": "Bayesian Multistate Bennett Acceptance Ratio Methods. (arXiv:2310.20699v2 [physics.chem-ph] UPDATED)",
    "abstract": "The multistate Bennett acceptance ratio (MBAR) method is a prevalent approach for computing free energies of thermodynamic states. In this work, we introduce BayesMBAR, a Bayesian generalization of the MBAR method. By integrating configurations sampled from thermodynamic states with a prior distribution, BayesMBAR computes a posterior distribution of free energies. Using the posterior distribution, we derive free energy estimations and compute their associated uncertainties. Notably, when a uniform prior distribution is used, BayesMBAR recovers the MBAR's result but provides more accurate uncertainty estimates. Additionally, when prior knowledge about free energies is available, BayesMBAR can incorporate this information into the estimation procedure by using non-uniform prior distributions. As an example, we show that, by incorporating the prior knowledge about the smoothness of free energy surfaces, BayesMBAR provides more accurate estimates than the MBAR method. Given MBAR's widespr",
    "link": "http://arxiv.org/abs/2310.20699",
    "context": "Title: Bayesian Multistate Bennett Acceptance Ratio Methods. (arXiv:2310.20699v2 [physics.chem-ph] UPDATED)\nAbstract: The multistate Bennett acceptance ratio (MBAR) method is a prevalent approach for computing free energies of thermodynamic states. In this work, we introduce BayesMBAR, a Bayesian generalization of the MBAR method. By integrating configurations sampled from thermodynamic states with a prior distribution, BayesMBAR computes a posterior distribution of free energies. Using the posterior distribution, we derive free energy estimations and compute their associated uncertainties. Notably, when a uniform prior distribution is used, BayesMBAR recovers the MBAR's result but provides more accurate uncertainty estimates. Additionally, when prior knowledge about free energies is available, BayesMBAR can incorporate this information into the estimation procedure by using non-uniform prior distributions. As an example, we show that, by incorporating the prior knowledge about the smoothness of free energy surfaces, BayesMBAR provides more accurate estimates than the MBAR method. Given MBAR's widespr",
    "path": "papers/23/10/2310.20699.json",
    "total_tokens": 841,
    "translated_title": "贝叶斯多状态Bennett接受比率方法",
    "translated_abstract": "多状态Bennett接受比率（MBAR）方法是计算热力学状态下自由能的一种常用方法。在这项工作中，我们引入了BayesMBAR，即MBAR方法的贝叶斯推广。通过将来自热力学状态的采样配置与先验分布进行整合，BayesMBAR计算了自由能的后验分布。利用后验分布，我们推导出自由能的估计值并计算它们的相关不确定性。值得注意的是，当使用均匀先验分布时，BayesMBAR可以恢复MBAR的结果，但提供更准确的不确定性估计。此外，当有关自由能的先验知识可用时，BayesMBAR可以通过使用非均匀先验分布将这些信息纳入估计过程中。作为示例，我们展示了通过引入关于自由能曲面平滑性的先验知识，BayesMBAR比MBAR方法提供更准确的估计结果。",
    "tldr": "贝叶斯多状态Bennett接受比率方法（BayesMBAR）是多状态Bennett接受比率（MBAR）方法的贝叶斯推广。通过整合采样配置和先验分布，BayesMBAR计算了自由能的后验分布，并提供更准确的不确定性估计。"
}