{
    "title": "TILFA: A Unified Framework for Text, Image, and Layout Fusion in Argument Mining. (arXiv:2310.05210v1 [cs.AI] CROSS LISTED)",
    "abstract": "A main goal of Argument Mining (AM) is to analyze an author's stance. Unlike previous AM datasets focusing only on text, the shared task at the 10th Workshop on Argument Mining introduces a dataset including both text and images. Importantly, these images contain both visual elements and optical characters. Our new framework, TILFA (A Unified Framework for Text, Image, and Layout Fusion in Argument Mining), is designed to handle this mixed data. It excels at not only understanding text but also detecting optical characters and recognizing layout details in images. Our model significantly outperforms existing baselines, earning our team, KnowComp, the 1st place in the leaderboard of Argumentative Stance Classification subtask in this shared task.",
    "link": "http://arxiv.org/abs/2310.05210",
    "context": "Title: TILFA: A Unified Framework for Text, Image, and Layout Fusion in Argument Mining. (arXiv:2310.05210v1 [cs.AI] CROSS LISTED)\nAbstract: A main goal of Argument Mining (AM) is to analyze an author's stance. Unlike previous AM datasets focusing only on text, the shared task at the 10th Workshop on Argument Mining introduces a dataset including both text and images. Importantly, these images contain both visual elements and optical characters. Our new framework, TILFA (A Unified Framework for Text, Image, and Layout Fusion in Argument Mining), is designed to handle this mixed data. It excels at not only understanding text but also detecting optical characters and recognizing layout details in images. Our model significantly outperforms existing baselines, earning our team, KnowComp, the 1st place in the leaderboard of Argumentative Stance Classification subtask in this shared task.",
    "path": "papers/23/10/2310.05210.json",
    "total_tokens": 849,
    "translated_title": "TILFA: 一种用于论证挖掘中文本、图像和布局融合的统一框架",
    "translated_abstract": "论证挖掘的主要目标是分析作者的立场。与以往只关注文本的论证挖掘数据集不同，第10届论证挖掘研讨会的共享任务引入了一个包含文本和图像的数据集。重要的是，这些图像包含了视觉元素和光学字符。我们的新框架TILFA（一种用于论证挖掘中文本、图像和布局融合的统一框架）被设计用于处理这种混合数据。它不仅能够理解文本，还能够检测光学字符和识别图像中的布局细节。我们的模型明显优于现有的基准线，在这个共享任务的辩论立场分类子任务中，我们的团队KnowComp在排行榜上获得了第一名。",
    "tldr": "TILFA是一个用于论证挖掘中处理文本、图像和布局混合数据的统一框架，不仅能够理解文本，还能够检测光学字符和识别图像中的布局细节，并在辩论立场分类中取得了显著的性能提升。"
}