{
    "title": "AGIR: Automating Cyber Threat Intelligence Reporting with Natural Language Generation. (arXiv:2310.02655v1 [cs.CR])",
    "abstract": "Cyber Threat Intelligence (CTI) reporting is pivotal in contemporary risk management strategies. As the volume of CTI reports continues to surge, the demand for automated tools to streamline report generation becomes increasingly apparent. While Natural Language Processing techniques have shown potential in handling text data, they often struggle to address the complexity of diverse data sources and their intricate interrelationships. Moreover, established paradigms like STIX have emerged as de facto standards within the CTI community, emphasizing the formal categorization of entities and relations to facilitate consistent data sharing. In this paper, we introduce AGIR (Automatic Generation of Intelligence Reports), a transformative Natural Language Generation tool specifically designed to address the pressing challenges in the realm of CTI reporting. AGIR's primary objective is to empower security analysts by automating the labor-intensive task of generating comprehensive intelligence",
    "link": "http://arxiv.org/abs/2310.02655",
    "context": "Title: AGIR: Automating Cyber Threat Intelligence Reporting with Natural Language Generation. (arXiv:2310.02655v1 [cs.CR])\nAbstract: Cyber Threat Intelligence (CTI) reporting is pivotal in contemporary risk management strategies. As the volume of CTI reports continues to surge, the demand for automated tools to streamline report generation becomes increasingly apparent. While Natural Language Processing techniques have shown potential in handling text data, they often struggle to address the complexity of diverse data sources and their intricate interrelationships. Moreover, established paradigms like STIX have emerged as de facto standards within the CTI community, emphasizing the formal categorization of entities and relations to facilitate consistent data sharing. In this paper, we introduce AGIR (Automatic Generation of Intelligence Reports), a transformative Natural Language Generation tool specifically designed to address the pressing challenges in the realm of CTI reporting. AGIR's primary objective is to empower security analysts by automating the labor-intensive task of generating comprehensive intelligence",
    "path": "papers/23/10/2310.02655.json",
    "total_tokens": 845,
    "translated_title": "AGIR: 自然语言生成技术在自动化网络威胁情报报告中的应用",
    "translated_abstract": "网络威胁情报（CTI）报告在当今风险管理策略中至关重要。随着CTI报告数量的不断增加，需要自动化工具来简化报告生成的需求日益明显。尽管自然语言处理技术在处理文本数据方面显示出潜力，但它们往往难以应对多样化数据源及其错综复杂的相互关系。此外，像STIX这样的已经成为CTI社区的事实标准的模式，强调对实体和关系进行形式化分类以促进一致的数据共享。在本文中，我们引入了AGIR（Automatic Generation of Intelligence Reports），这是一种专门解决CTI报告领域紧迫挑战的转变性自然语言生成工具。AGIR的主要目标是通过自动化生成全面的情报报告，为安全分析师提供帮助，减少繁重的任务。",
    "tldr": "AGIR是一种专门解决网络威胁情报报告领域挑战的自然语言生成工具，通过自动化生成全面的情报报告，帮助安全分析师减少繁重任务。"
}