{
    "title": "Randomized Benchmarking of Local Zeroth-Order Optimizers for Variational Quantum Systems. (arXiv:2310.09468v1 [quant-ph])",
    "abstract": "In the field of quantum information, classical optimizers play an important role. From experimentalists optimizing their physical devices to theorists exploring variational quantum algorithms, many aspects of quantum information require the use of a classical optimizer. For this reason, there are many papers that benchmark the effectiveness of different optimizers for specific quantum optimization tasks and choices of parameterized algorithms. However, for researchers exploring new algorithms or physical devices, the insights from these studies don't necessarily translate. To address this concern, we compare the performance of classical optimizers across a series of partially-randomized tasks to more broadly sample the space of quantum optimization problems. We focus on local zeroth-order optimizers due to their generally favorable performance and query-efficiency on quantum systems. We discuss insights from these experiments that can help motivate future works to improve these optimiz",
    "link": "http://arxiv.org/abs/2310.09468",
    "context": "Title: Randomized Benchmarking of Local Zeroth-Order Optimizers for Variational Quantum Systems. (arXiv:2310.09468v1 [quant-ph])\nAbstract: In the field of quantum information, classical optimizers play an important role. From experimentalists optimizing their physical devices to theorists exploring variational quantum algorithms, many aspects of quantum information require the use of a classical optimizer. For this reason, there are many papers that benchmark the effectiveness of different optimizers for specific quantum optimization tasks and choices of parameterized algorithms. However, for researchers exploring new algorithms or physical devices, the insights from these studies don't necessarily translate. To address this concern, we compare the performance of classical optimizers across a series of partially-randomized tasks to more broadly sample the space of quantum optimization problems. We focus on local zeroth-order optimizers due to their generally favorable performance and query-efficiency on quantum systems. We discuss insights from these experiments that can help motivate future works to improve these optimiz",
    "path": "papers/23/10/2310.09468.json",
    "total_tokens": 825,
    "translated_title": "用于变分量子系统的局部零阶优化器的随机基准测试",
    "translated_abstract": "在量子信息领域中，经典优化器起着重要的作用。从优化物理设备的实验者到探索变分量子算法的理论家，量子信息的许多方面都需要使用经典优化器。因此，有许多论文对不同优化器在特定量子优化任务和参数化算法选择的有效性进行基准测试。然而，对于探索新算法或物理设备的研究人员来说，这些研究的见解不一定适用。为了解决这个问题，我们通过一系列部分随机化的任务来比较经典优化器的性能，以更广泛地抽样量子优化问题的空间。我们重点关注局部零阶优化器，因为它们在量子系统上通常具有良好的性能和查询效率。我们讨论了这些实验的见解，可以帮助激发未来的工作来改进这些优化器。",
    "tldr": "本研究通过随机基准测试比较了局部零阶优化器在量子优化问题上的性能，为未来改进这些优化器提供了一些见解。"
}