{
    "title": "Precise localization within the GI tract by combining classification of CNNs and time-series analysis of HMMs. (arXiv:2310.07895v1 [cs.LG])",
    "abstract": "This paper presents a method to efficiently classify the gastroenterologic section of images derived from Video Capsule Endoscopy (VCE) studies by exploring the combination of a Convolutional Neural Network (CNN) for classification with the time-series analysis properties of a Hidden Markov Model (HMM). It is demonstrated that successive time-series analysis identifies and corrects errors in the CNN output. Our approach achieves an accuracy of $98.04\\%$ on the Rhode Island (RI) Gastroenterology dataset. This allows for precise localization within the gastrointestinal (GI) tract while requiring only approximately 1M parameters and thus, provides a method suitable for low power devices",
    "link": "http://arxiv.org/abs/2310.07895",
    "context": "Title: Precise localization within the GI tract by combining classification of CNNs and time-series analysis of HMMs. (arXiv:2310.07895v1 [cs.LG])\nAbstract: This paper presents a method to efficiently classify the gastroenterologic section of images derived from Video Capsule Endoscopy (VCE) studies by exploring the combination of a Convolutional Neural Network (CNN) for classification with the time-series analysis properties of a Hidden Markov Model (HMM). It is demonstrated that successive time-series analysis identifies and corrects errors in the CNN output. Our approach achieves an accuracy of $98.04\\%$ on the Rhode Island (RI) Gastroenterology dataset. This allows for precise localization within the gastrointestinal (GI) tract while requiring only approximately 1M parameters and thus, provides a method suitable for low power devices",
    "path": "papers/23/10/2310.07895.json",
    "total_tokens": 806,
    "translated_title": "通过结合CNN的分类和HMM的时间序列分析在GI道中进行精确定位的方法",
    "translated_abstract": "本文介绍了一种通过探索卷积神经网络（CNN）进行分类和隐马尔可夫模型（HMM）的时间序列分析属性的组合来高效地对视频胶囊内镜（VCE）研究中基于图像的胃肠学部分进行分类的方法。实验证明连续的时间序列分析可以识别和纠正CNN输出中的错误。我们的方法在Rhode Island（RI）胃肠病学数据集上实现了98.04％的准确率。这使得在胃肠道内实现精确定位成为可能，同时只需要约1M个参数，因此适用于低功耗设备。",
    "tldr": "本文提出了一种通过使用CNN进行分类和HMM的时间序列分析，高效地将胃肠造影的图像进行分类，并通过连续的时间序列分析纠正CNN输出来实现精确定位。研究结果表明，该方法在Rhode Island胃肠病学数据集上达到了98.04％的准确率，可以在低功耗设备上使用。",
    "en_tdlr": "This paper proposes an efficient method to classify images from Video Capsule Endoscopy (VCE) studies by combining CNN classification and HMM time-series analysis, achieving precise localization within the gastrointestinal tract. The approach also demonstrates high accuracy on the Rhode Island Gastroenterology dataset, making it suitable for low-power devices."
}