{
    "title": "Diff-Transfer: Model-based Robotic Manipulation Skill Transfer via Differentiable Physics Simulation. (arXiv:2310.04930v2 [cs.RO] UPDATED)",
    "abstract": "The capability to transfer mastered skills to accomplish a range of similar yet novel tasks is crucial for intelligent robots. In this work, we introduce $\\textit{Diff-Transfer}$, a novel framework leveraging differentiable physics simulation to efficiently transfer robotic skills. Specifically, $\\textit{Diff-Transfer}$ discovers a feasible path within the task space that brings the source task to the target task. At each pair of adjacent points along this task path, which is two sub-tasks, $\\textit{Diff-Transfer}$ adapts known actions from one sub-task to tackle the other sub-task successfully. The adaptation is guided by the gradient information from differentiable physics simulations. We propose a novel path-planning method to generate sub-tasks, leveraging $Q$-learning with a task-level state and reward. We implement our framework in simulation experiments and execute four challenging transfer tasks on robotic manipulation, demonstrating the efficacy of $\\textit{Diff-Transfer}$ thr",
    "link": "http://arxiv.org/abs/2310.04930",
    "context": "Title: Diff-Transfer: Model-based Robotic Manipulation Skill Transfer via Differentiable Physics Simulation. (arXiv:2310.04930v2 [cs.RO] UPDATED)\nAbstract: The capability to transfer mastered skills to accomplish a range of similar yet novel tasks is crucial for intelligent robots. In this work, we introduce $\\textit{Diff-Transfer}$, a novel framework leveraging differentiable physics simulation to efficiently transfer robotic skills. Specifically, $\\textit{Diff-Transfer}$ discovers a feasible path within the task space that brings the source task to the target task. At each pair of adjacent points along this task path, which is two sub-tasks, $\\textit{Diff-Transfer}$ adapts known actions from one sub-task to tackle the other sub-task successfully. The adaptation is guided by the gradient information from differentiable physics simulations. We propose a novel path-planning method to generate sub-tasks, leveraging $Q$-learning with a task-level state and reward. We implement our framework in simulation experiments and execute four challenging transfer tasks on robotic manipulation, demonstrating the efficacy of $\\textit{Diff-Transfer}$ thr",
    "path": "papers/23/10/2310.04930.json",
    "total_tokens": 947,
    "translated_title": "Diff-Transfer: 通过可微分物理仿真进行基于模型的机器人操作技能迁移",
    "translated_abstract": "将掌握的技能转移到完成一系列相似但新颖任务的能力对于智能机器人至关重要。本研究引入了Diff-Transfer，一种利用可微分物理仿真来高效传输机器人技能的新框架。具体而言，Diff-Transfer在任务空间内发现了一条可行的路径，将源任务带到目标任务。在这个任务路径的每对相邻点上，即两个子任务中，Diff-Transfer通过从一个子任务中适应已知的动作来成功解决另一个子任务。适应过程是由可微分物理仿真产生的梯度信息引导的。我们提出了一种新颖的路径规划方法，利用具有任务级状态和奖励的Q学习来生成子任务。我们在仿真实验中实现了我们的框架，并在机器人操作上执行了四个具有挑战性的迁移任务，展示了Diff-Transfer的有效性。",
    "tldr": "这篇论文提出了Diff-Transfer，一种通过可微分物理仿真来高效传输机器人技能的新框架。Diff-Transfer通过在任务空间内发现可行路径，将源任务转化为目标任务，并通过梯度信息引导适应已知的动作，成功解决另一个子任务。实验结果表明了Diff-Transfer的有效性。",
    "en_tdlr": "This paper introduces Diff-Transfer, a novel framework leveraging differentiable physics simulation to efficiently transfer robotic skills. Diff-Transfer discovers a feasible path in the task space to bring the source task to the target task and adapts known actions using gradient information from differentiable physics simulations to successfully solve the other sub-task. Experimental results demonstrate the effectiveness of Diff-Transfer."
}