{
    "title": "EPiC-ly Fast Particle Cloud Generation with Flow-Matching and Diffusion. (arXiv:2310.00049v1 [hep-ph])",
    "abstract": "Jets at the LHC, typically consisting of a large number of highly correlated particles, are a fascinating laboratory for deep generative modeling. In this paper, we present two novel methods that generate LHC jets as point clouds efficiently and accurately. We introduce \\epcjedi, which combines score-matching diffusion models with the Equivariant Point Cloud (EPiC) architecture based on the deep sets framework. This model offers a much faster alternative to previous transformer-based diffusion models without reducing the quality of the generated jets. In addition, we introduce \\epcfm, the first permutation equivariant continuous normalizing flow (CNF) for particle cloud generation. This model is trained with {\\it flow-matching}, a scalable and easy-to-train objective based on optimal transport that directly regresses the vector fields connecting the Gaussian noise prior to the data distribution. Our experiments demonstrate that \\epcjedi and \\epcfm both achieve state-of-the-art performa",
    "link": "http://arxiv.org/abs/2310.00049",
    "context": "Title: EPiC-ly Fast Particle Cloud Generation with Flow-Matching and Diffusion. (arXiv:2310.00049v1 [hep-ph])\nAbstract: Jets at the LHC, typically consisting of a large number of highly correlated particles, are a fascinating laboratory for deep generative modeling. In this paper, we present two novel methods that generate LHC jets as point clouds efficiently and accurately. We introduce \\epcjedi, which combines score-matching diffusion models with the Equivariant Point Cloud (EPiC) architecture based on the deep sets framework. This model offers a much faster alternative to previous transformer-based diffusion models without reducing the quality of the generated jets. In addition, we introduce \\epcfm, the first permutation equivariant continuous normalizing flow (CNF) for particle cloud generation. This model is trained with {\\it flow-matching}, a scalable and easy-to-train objective based on optimal transport that directly regresses the vector fields connecting the Gaussian noise prior to the data distribution. Our experiments demonstrate that \\epcjedi and \\epcfm both achieve state-of-the-art performa",
    "path": "papers/23/10/2310.00049.json",
    "total_tokens": 932,
    "translated_title": "EPiC-ly快速生成带有流匹配和扩散的粒子云",
    "translated_abstract": "LHC中的喷注通常由大量高度相关的粒子组成，是深度生成建模的一个有趣实验室。在本文中，我们提出了两种新方法，以高效准确地生成LHC喷注为点云。我们引入了基于深度集合框架的等变点云（EPiC）架构的\\epcjedi，该架构将评分匹配扩散模型与之结合。该模型提供了一个比之前基于转换器的扩散模型更快的选择，而不会降低生成喷注的质量。此外，我们引入了用于粒子云生成的首个等效连续标准化流（CNF）\\epcfm。该模型使用基于最优传输的可扩展易训练的流匹配目标，直接回归连接高斯噪声先验和数据分布的矢量场。我们的实验证明，\\epcjedi和\\epcfm均达到了最先进的性能。",
    "tldr": "本文提出了两种新方法用于高效准确地生成LHC喷注为点云，一种基于评分匹配扩散模型的等变点云架构，另一种是使用最优传输的等效连续标准化流模型。实验证明这些方法均达到了最先进的性能。",
    "en_tdlr": "This paper presents two novel methods for efficiently and accurately generating LHC jets as point clouds, one based on score-matching diffusion models and the equivariant point cloud architecture, and the other using permutation equivariant continuous normalizing flow with optimal transport. Experiments demonstrate state-of-the-art performance for both methods."
}