{
    "title": "Hallucination Detection for Grounded Instruction Generation. (arXiv:2310.15319v1 [cs.CL])",
    "abstract": "We investigate the problem of generating instructions to guide humans to navigate in simulated residential environments. A major issue with current models is hallucination: they generate references to actions or objects that are inconsistent with what a human follower would perform or encounter along the described path. We develop a model that detects these hallucinated references by adopting a model pre-trained on a large corpus of image-text pairs, and fine-tuning it with a contrastive loss that separates correct instructions from instructions containing synthesized hallucinations. Our final model outperforms several baselines, including using word probability estimated by the instruction-generation model, and supervised models based on LSTM and Transformer.",
    "link": "http://arxiv.org/abs/2310.15319",
    "context": "Title: Hallucination Detection for Grounded Instruction Generation. (arXiv:2310.15319v1 [cs.CL])\nAbstract: We investigate the problem of generating instructions to guide humans to navigate in simulated residential environments. A major issue with current models is hallucination: they generate references to actions or objects that are inconsistent with what a human follower would perform or encounter along the described path. We develop a model that detects these hallucinated references by adopting a model pre-trained on a large corpus of image-text pairs, and fine-tuning it with a contrastive loss that separates correct instructions from instructions containing synthesized hallucinations. Our final model outperforms several baselines, including using word probability estimated by the instruction-generation model, and supervised models based on LSTM and Transformer.",
    "path": "papers/23/10/2310.15319.json",
    "total_tokens": 736,
    "translated_title": "为基于指导性说明生成的幻觉检测问题",
    "translated_abstract": "我们研究了在模拟的住宅环境中生成指导人类导航的说明的问题。目前模型存在的一个重要问题是幻觉：它们生成与人类跟随者在描述的路径上执行或遇到的行为或物体不一致的参考。我们开发了一个模型，通过采用在大型图像-文本对语料库上预训练的模型，并使用对比损失进行微调，检测这些幻觉参考。我们的最终模型胜过了几个基线模型，包括使用由说明生成模型估计的词概率以及基于LSTM和Transformer的监督模型。",
    "tldr": "该论文研究了生成指导人类在模拟环境中导航的说明的问题，通过预训练模型并使用对比损失进行微调，提出了一种检测幻觉参考的模型，该模型在性能上超过了几个基线模型。",
    "en_tdlr": "This paper investigates the problem of generating instructions for guiding humans in simulated environments. It proposes a model that detects hallucinated references by using a pre-trained model and fine-tuning it with a contrastive loss. The model outperforms several baselines in performance."
}