{
    "title": "Concealed Electronic Countermeasures of Radar Signal with Adversarial Examples. (arXiv:2310.08292v1 [eess.SP])",
    "abstract": "Electronic countermeasures involving radar signals are an important aspect of modern warfare. Traditional electronic countermeasures techniques typically add large-scale interference signals to ensure interference effects, which can lead to attacks being too obvious. In recent years, AI-based attack methods have emerged that can effectively solve this problem, but the attack scenarios are currently limited to time domain radar signal classification. In this paper, we focus on the time-frequency images classification scenario of radar signals. We first propose an attack pipeline under the time-frequency images scenario and DITIMI-FGSM attack algorithm with high transferability. Then, we propose STFT-based time domain signal attack(STDS) algorithm to solve the problem of non-invertibility in time-frequency analysis, thus obtaining the time-domain representation of the interference signal. A large number of experiments show that our attack pipeline is feasible and the proposed attack meth",
    "link": "http://arxiv.org/abs/2310.08292",
    "context": "Title: Concealed Electronic Countermeasures of Radar Signal with Adversarial Examples. (arXiv:2310.08292v1 [eess.SP])\nAbstract: Electronic countermeasures involving radar signals are an important aspect of modern warfare. Traditional electronic countermeasures techniques typically add large-scale interference signals to ensure interference effects, which can lead to attacks being too obvious. In recent years, AI-based attack methods have emerged that can effectively solve this problem, but the attack scenarios are currently limited to time domain radar signal classification. In this paper, we focus on the time-frequency images classification scenario of radar signals. We first propose an attack pipeline under the time-frequency images scenario and DITIMI-FGSM attack algorithm with high transferability. Then, we propose STFT-based time domain signal attack(STDS) algorithm to solve the problem of non-invertibility in time-frequency analysis, thus obtaining the time-domain representation of the interference signal. A large number of experiments show that our attack pipeline is feasible and the proposed attack meth",
    "path": "papers/23/10/2310.08292.json",
    "total_tokens": 900,
    "translated_title": "使用对抗样本进行雷达信号的隐蔽电子对抗措施",
    "translated_abstract": "电子对抗技术是现代战争中的重要方面，传统的电子对抗技术往往通过加入大规模的干扰信号来达到干扰效果，但这样往往太过显眼。近年来，出现了基于人工智能的攻击方法，可以有效解决这个问题，但目前攻击场景仅限于时间域雷达信号分类。本文针对雷达信号的时频图像分类场景，首先提出了一个基于时频图像的攻击流程和具有高可转移性的DITIMI-FGSM攻击算法。然后，我们提出了基于STFT的时域信号攻击(STDS)算法来解决时频分析中的不可逆性问题，从而得到干扰信号的时域表示。大量实验表明，我们的攻击流程是可行的，所提出的攻击方法可以成功实施。",
    "tldr": "本文提出了使用对抗样本进行雷达信号的隐蔽电子对抗措施，通过基于时频图像的攻击流程和具有高可转移性的攻击算法，以及基于STFT的时域信号攻击算法，成功实施了干扰信号的攻击。",
    "en_tdlr": "This paper proposes concealed electronic countermeasures for radar signals using adversarial examples. By utilizing an attack pipeline based on time-frequency images and a high transferability attack algorithm (DITIMI-FGSM), as well as a STFT-based time domain signal attack (STDS) algorithm, successful interference signal attacks have been achieved."
}