{
    "title": "A minimax optimal control approach for robust neural ODEs. (arXiv:2310.17584v2 [math.OC] UPDATED)",
    "abstract": "In this paper, we address the adversarial training of neural ODEs from a robust control perspective. This is an alternative to the classical training via empirical risk minimization, and it is widely used to enforce reliable outcomes for input perturbations. Neural ODEs allow the interpretation of deep neural networks as discretizations of control systems, unlocking powerful tools from control theory for the development and the understanding of machine learning. In this specific case, we formulate the adversarial training with perturbed data as a minimax optimal control problem, for which we derive first order optimality conditions in the form of Pontryagin's Maximum Principle. We provide a novel interpretation of robust training leading to an alternative weighted technique, which we test on a low-dimensional classification task.",
    "link": "http://arxiv.org/abs/2310.17584",
    "context": "Title: A minimax optimal control approach for robust neural ODEs. (arXiv:2310.17584v2 [math.OC] UPDATED)\nAbstract: In this paper, we address the adversarial training of neural ODEs from a robust control perspective. This is an alternative to the classical training via empirical risk minimization, and it is widely used to enforce reliable outcomes for input perturbations. Neural ODEs allow the interpretation of deep neural networks as discretizations of control systems, unlocking powerful tools from control theory for the development and the understanding of machine learning. In this specific case, we formulate the adversarial training with perturbed data as a minimax optimal control problem, for which we derive first order optimality conditions in the form of Pontryagin's Maximum Principle. We provide a novel interpretation of robust training leading to an alternative weighted technique, which we test on a low-dimensional classification task.",
    "path": "papers/23/10/2310.17584.json",
    "total_tokens": 803,
    "translated_title": "一种鲁棒神经ODE的极小极大优化控制方法",
    "translated_abstract": "本文从鲁棒控制的角度解决了神经ODE的对抗训练问题。这是一种替代经验风险最小化的训练方法，被广泛用于确保对输入扰动的可靠结果。神经ODE允许将深度神经网络解释为控制系统的离散化，从控制理论中提供了强大的工具，用于机器学习的开发和理解。在这种特定情况下，我们将扰动数据的对抗训练公式化为极小极大优化控制问题，并推导出了Pontryagin最大值原理的一阶最优性条件。我们提供了鲁棒训练的新解释，导致了一种替代的加权技术，并在低维分类任务上进行了测试。",
    "tldr": "本文提出了一种鲁棒神经ODE的极小极大优化控制方法，将对抗训练问题转化为一个最优控制问题，并提供了一种新的加权技术来实现鲁棒训练。",
    "en_tdlr": "This paper proposes a minimax optimal control approach for robust neural ODEs, formulating the adversarial training problem as an optimal control problem and introducing a novel weighted technique for robust training."
}