{
    "title": "Diversified Outlier Exposure for Out-of-Distribution Detection via Informative Extrapolation. (arXiv:2310.13923v2 [cs.LG] UPDATED)",
    "abstract": "Out-of-distribution (OOD) detection is important for deploying reliable machine learning models on real-world applications. Recent advances in outlier exposure have shown promising results on OOD detection via fine-tuning model with informatively sampled auxiliary outliers. However, previous methods assume that the collected outliers can be sufficiently large and representative to cover the boundary between ID and OOD data, which might be impractical and challenging. In this work, we propose a novel framework, namely, Diversified Outlier Exposure (DivOE), for effective OOD detection via informative extrapolation based on the given auxiliary outliers. Specifically, DivOE introduces a new learning objective, which diversifies the auxiliary distribution by explicitly synthesizing more informative outliers for extrapolation during training. It leverages a multi-step optimization method to generate novel outliers beyond the original ones, which is compatible with many variants of outlier ex",
    "link": "http://arxiv.org/abs/2310.13923",
    "context": "Title: Diversified Outlier Exposure for Out-of-Distribution Detection via Informative Extrapolation. (arXiv:2310.13923v2 [cs.LG] UPDATED)\nAbstract: Out-of-distribution (OOD) detection is important for deploying reliable machine learning models on real-world applications. Recent advances in outlier exposure have shown promising results on OOD detection via fine-tuning model with informatively sampled auxiliary outliers. However, previous methods assume that the collected outliers can be sufficiently large and representative to cover the boundary between ID and OOD data, which might be impractical and challenging. In this work, we propose a novel framework, namely, Diversified Outlier Exposure (DivOE), for effective OOD detection via informative extrapolation based on the given auxiliary outliers. Specifically, DivOE introduces a new learning objective, which diversifies the auxiliary distribution by explicitly synthesizing more informative outliers for extrapolation during training. It leverages a multi-step optimization method to generate novel outliers beyond the original ones, which is compatible with many variants of outlier ex",
    "path": "papers/23/10/2310.13923.json",
    "total_tokens": 919,
    "translated_title": "通过信息外推实现多样化的异常值曝光进行外分布检测",
    "translated_abstract": "外分布（OOD）检测对于在现实世界应用中部署可靠的机器学习模型至关重要。在异常值曝光方面的最新进展已经显示出通过以信息化采样的辅助异常值对模型进行微调在OOD检测方面具有良好的结果。然而，先前的方法假设收集到的异常值可以足够大且代表性地覆盖ID和OOD数据之间的边界，这可能是不可行且具有挑战性的。在这项工作中，我们提出了一种新的框架，即“多样化的异常值曝光”（DivOE），通过利用给定的辅助异常值进行基于信息外推的有效OOD检测。具体而言，DivOE引入了一种新的学习目标，通过在训练过程中显式地合成更多信息化的异常值来使辅助分布多样化。它利用了多步优化方法来生成超出原始异常值的新异常值，这与许多异常值曝光的变体兼容。",
    "tldr": "本文提出了一种名为“多样化的异常值曝光（DivOE）”的框架，通过生成多样化的、信息化的辅助异常值来进行有效的OOD检测。这种方法通过信息外推的方式合成了更多的异常值，从而改进了传统的异常值检测方法。",
    "en_tdlr": "This paper proposes a framework called \"Diversified Outlier Exposure (DivOE)\" for effective out-of-distribution (OOD) detection by generating diversified and informative auxiliary outliers. By extrapolating more outliers through informative synthesis, DivOE improves traditional outlier detection methods."
}