{
    "title": "Nonlinear embeddings for conserving Hamiltonians and other quantities with Neural Galerkin schemes. (arXiv:2310.07485v1 [math.NA])",
    "abstract": "This work focuses on the conservation of quantities such as Hamiltonians, mass, and momentum when solution fields of partial differential equations are approximated with nonlinear parametrizations such as deep networks. The proposed approach builds on Neural Galerkin schemes that are based on the Dirac--Frenkel variational principle to train nonlinear parametrizations sequentially in time. We first show that only adding constraints that aim to conserve quantities in continuous time can be insufficient because the nonlinear dependence on the parameters implies that even quantities that are linear in the solution fields become nonlinear in the parameters and thus are challenging to discretize in time. Instead, we propose Neural Galerkin schemes that compute at each time step an explicit embedding onto the manifold of nonlinearly parametrized solution fields to guarantee conservation of quantities. The embeddings can be combined with standard explicit and implicit time integration schemes",
    "link": "http://arxiv.org/abs/2310.07485",
    "context": "Title: Nonlinear embeddings for conserving Hamiltonians and other quantities with Neural Galerkin schemes. (arXiv:2310.07485v1 [math.NA])\nAbstract: This work focuses on the conservation of quantities such as Hamiltonians, mass, and momentum when solution fields of partial differential equations are approximated with nonlinear parametrizations such as deep networks. The proposed approach builds on Neural Galerkin schemes that are based on the Dirac--Frenkel variational principle to train nonlinear parametrizations sequentially in time. We first show that only adding constraints that aim to conserve quantities in continuous time can be insufficient because the nonlinear dependence on the parameters implies that even quantities that are linear in the solution fields become nonlinear in the parameters and thus are challenging to discretize in time. Instead, we propose Neural Galerkin schemes that compute at each time step an explicit embedding onto the manifold of nonlinearly parametrized solution fields to guarantee conservation of quantities. The embeddings can be combined with standard explicit and implicit time integration schemes",
    "path": "papers/23/10/2310.07485.json",
    "total_tokens": 823,
    "translated_title": "非线性嵌入用于保持哈密顿量和其他量的方法——神经Galerkin方案",
    "translated_abstract": "本文关注的是在使用非线性参数化（如深度网络）对偏微分方程的解进行近似时，保持哈密顿量、质量和动量等数量的方法。所提出的方法基于基于Dirac-Frenkel变分原理的神经Galerkin方案，通过时间序列训练非线性参数化。我们首先证明，仅仅添加在连续时间上旨在保持数量的约束是不充分的，因为参数的非线性依赖意味着即使对解场是线性的数量也变成了参数的非线性，因此在时间上离散化是具有挑战性的。相反，我们提出神经Galerkin方案，在每个时间步骤计算一个显式嵌入到非线性参数化解场的流形上，以保证数量的守恒。这些嵌入可以与标准的显式和隐式时间积分方案结合使用。",
    "tldr": "本文提出了一种基于神经Galerkin方案的非线性嵌入方法，用于保持哈密顿量和其他数量的守恒性。该方法通过在每个时间步骤计算显式嵌入到非线性参数化解场的流形上来保证数量的守恒。"
}