{
    "title": "A Novel Voronoi-based Convolutional Neural Network Framework for Pushing Person Detection in Crowd Videos. (arXiv:2310.07416v1 [cs.CV])",
    "abstract": "Analyzing the microscopic dynamics of pushing behavior within crowds can offer valuable insights into crowd patterns and interactions. By identifying instances of pushing in crowd videos, a deeper understanding of when, where, and why such behavior occurs can be achieved. This knowledge is crucial to creating more effective crowd management strategies, optimizing crowd flow, and enhancing overall crowd experiences. However, manually identifying pushing behavior at the microscopic level is challenging, and the existing automatic approaches cannot detect such microscopic behavior. Thus, this article introduces a novel automatic framework for identifying pushing in videos of crowds on a microscopic level. The framework comprises two main components: i) Feature extraction and ii) Video labeling. In the feature extraction component, a new Voronoi-based method is developed for determining the local regions associated with each person in the input video. Subsequently, these regions are fed in",
    "link": "http://arxiv.org/abs/2310.07416",
    "context": "Title: A Novel Voronoi-based Convolutional Neural Network Framework for Pushing Person Detection in Crowd Videos. (arXiv:2310.07416v1 [cs.CV])\nAbstract: Analyzing the microscopic dynamics of pushing behavior within crowds can offer valuable insights into crowd patterns and interactions. By identifying instances of pushing in crowd videos, a deeper understanding of when, where, and why such behavior occurs can be achieved. This knowledge is crucial to creating more effective crowd management strategies, optimizing crowd flow, and enhancing overall crowd experiences. However, manually identifying pushing behavior at the microscopic level is challenging, and the existing automatic approaches cannot detect such microscopic behavior. Thus, this article introduces a novel automatic framework for identifying pushing in videos of crowds on a microscopic level. The framework comprises two main components: i) Feature extraction and ii) Video labeling. In the feature extraction component, a new Voronoi-based method is developed for determining the local regions associated with each person in the input video. Subsequently, these regions are fed in",
    "path": "papers/23/10/2310.07416.json",
    "total_tokens": 959,
    "translated_title": "基于Voronoi的卷积神经网络框架在拥挤视频中推动人员检测中的应用",
    "translated_abstract": "分析拥挤场景中推动行为的微观动态可以为拥挤的模式和互动提供有价值的见解。通过识别拥挤视频中的推动实例，可以更深入地了解这种行为发生的时间、地点和原因。这对于创建更有效的拥挤管理策略、优化人流量和提升整体拥挤体验至关重要。然而，手动在微观层面上识别推动行为是具有挑战性的，现有的自动方法无法检测到这种微观行为。因此，本文介绍了一种新颖的自动化框架，用于在拥挤视频中微观级别地识别推动行为。该框架包括两个主要组成部分：i）特征提取和ii）视频标记。在特征提取组件中，开发了一种基于Voronoi的新方法，用于确定与输入视频中的每个人相关的局部区域。随后，将这些区域输入到模型中进行标记和推动行为的检测。",
    "tldr": "本论文提出了一种基于Voronoi的卷积神经网络框架，用于在拥挤视频中微观级别地识别推动行为。通过该框架，能够更深入地了解拥挤场景中推动行为的模式和互动，并为拥挤管理策略和人流量优化提供有价值的见解。",
    "en_tdlr": "This paper presents a novel Voronoi-based convolutional neural network framework for identifying pushing behavior in crowd videos at a microscopic level. The framework provides valuable insights into the patterns and interactions of pushing behavior in crowded scenes, and offers valuable insights for crowd management strategies and optimizing crowd flow."
}