{
    "title": "Learning adjacency matrix for dynamic graph neural network. (arXiv:2310.02606v1 [cs.LG])",
    "abstract": "In recent work, [1] introduced the concept of using a Block Adjacency Matrix (BA) for the representation of spatio-temporal data. While their method successfully concatenated adjacency matrices to encapsulate spatio-temporal relationships in a single graph, it formed a disconnected graph. This limitation hampered the ability of Graph Convolutional Networks (GCNs) to perform message passing across nodes belonging to different time steps, as no temporal links were present. To overcome this challenge, we introduce an encoder block specifically designed to learn these missing temporal links. The encoder block processes the BA and predicts connections between previously unconnected subgraphs, resulting in a Spatio-Temporal Block Adjacency Matrix (STBAM). This enriched matrix is then fed into a Graph Neural Network (GNN) to capture the complex spatio-temporal topology of the network. Our evaluations on benchmark datasets, surgVisDom and C2D2, demonstrate that our method, with slightly higher",
    "link": "http://arxiv.org/abs/2310.02606",
    "context": "Title: Learning adjacency matrix for dynamic graph neural network. (arXiv:2310.02606v1 [cs.LG])\nAbstract: In recent work, [1] introduced the concept of using a Block Adjacency Matrix (BA) for the representation of spatio-temporal data. While their method successfully concatenated adjacency matrices to encapsulate spatio-temporal relationships in a single graph, it formed a disconnected graph. This limitation hampered the ability of Graph Convolutional Networks (GCNs) to perform message passing across nodes belonging to different time steps, as no temporal links were present. To overcome this challenge, we introduce an encoder block specifically designed to learn these missing temporal links. The encoder block processes the BA and predicts connections between previously unconnected subgraphs, resulting in a Spatio-Temporal Block Adjacency Matrix (STBAM). This enriched matrix is then fed into a Graph Neural Network (GNN) to capture the complex spatio-temporal topology of the network. Our evaluations on benchmark datasets, surgVisDom and C2D2, demonstrate that our method, with slightly higher",
    "path": "papers/23/10/2310.02606.json",
    "total_tokens": 933,
    "translated_title": "动态图神经网络中学习邻接矩阵",
    "translated_abstract": "在最近的研究中，[1] 引入了使用块邻接矩阵（BA）来表示时空数据的概念。虽然他们的方法成功地串联了邻接矩阵，以封装单个图中的时空关系，但它形成了一个不连通的图。这个限制妨碍了图卷积网络（GCN）在属于不同时间步的节点之间进行消息传递的能力，因为没有时间链接存在。为了克服这个挑战，我们引入了一个专门设计用于学习这些缺失的时间链接的编码器块。编码器块处理BA并预测之前未连接的子图之间的连接，从而产生一个富化的时空块邻接矩阵（STBAM）。然后，将这个富化的矩阵输入到图神经网络（GNN）中，以捕捉网络的复杂时空拓扑。我们对基准数据集surgVisDom和C2D2进行评估，结果证明我们的方法稍高一些。",
    "tldr": "该论文介绍了一种用于动态图神经网络的学习邻接矩阵的方法。通过引入一个特殊设计的编码器块来学习缺失的时空连接，将其丰富后的块邻接矩阵输入到图神经网络中，以捕捉网络的复杂时空拓扑。"
}