{
    "title": "MatChat: A Large Language Model and Application Service Platform for Materials Science. (arXiv:2310.07197v1 [cond-mat.mtrl-sci])",
    "abstract": "The prediction of chemical synthesis pathways plays a pivotal role in materials science research. Challenges, such as the complexity of synthesis pathways and the lack of comprehensive datasets, currently hinder our ability to predict these chemical processes accurately. However, recent advancements in generative artificial intelligence (GAI), including automated text generation and question-answering systems, coupled with fine-tuning techniques, have facilitated the deployment of large-scale AI models tailored to specific domains. In this study, we harness the power of the LLaMA2-7B model and enhance it through a learning process that incorporates 13,878 pieces of structured material knowledge data. This specialized AI model, named MatChat, focuses on predicting inorganic material synthesis pathways. MatChat exhibits remarkable proficiency in generating and reasoning with knowledge in materials science. Although MatChat requires further refinement to meet the diverse material design n",
    "link": "http://arxiv.org/abs/2310.07197",
    "context": "Title: MatChat: A Large Language Model and Application Service Platform for Materials Science. (arXiv:2310.07197v1 [cond-mat.mtrl-sci])\nAbstract: The prediction of chemical synthesis pathways plays a pivotal role in materials science research. Challenges, such as the complexity of synthesis pathways and the lack of comprehensive datasets, currently hinder our ability to predict these chemical processes accurately. However, recent advancements in generative artificial intelligence (GAI), including automated text generation and question-answering systems, coupled with fine-tuning techniques, have facilitated the deployment of large-scale AI models tailored to specific domains. In this study, we harness the power of the LLaMA2-7B model and enhance it through a learning process that incorporates 13,878 pieces of structured material knowledge data. This specialized AI model, named MatChat, focuses on predicting inorganic material synthesis pathways. MatChat exhibits remarkable proficiency in generating and reasoning with knowledge in materials science. Although MatChat requires further refinement to meet the diverse material design n",
    "path": "papers/23/10/2310.07197.json",
    "total_tokens": 794,
    "translated_title": "MatChat: 用于材料科学的大型语言模型和应用服务平台",
    "translated_abstract": "化学合成路径的预测在材料科学研究中起着关键作用。然而，目前合成路径的复杂性和缺乏全面的数据集等挑战阻碍了我们准确预测这些化学过程的能力。本研究利用LLaMA2-7B模型的力量，并通过结合13,878条结构化材料知识数据的学习过程加强了它。这个名为MatChat的专门的AI模型专注于预测无机材料的合成路径。MatChat在材料科学的知识生成和推理方面展现出了卓越的能力。虽然MatChat需要进一步改进以满足多样化材料设计的需求。",
    "tldr": "MatChat是一个用于材料科学的大型语言模型和应用服务平台，利用LLaMA2-7B模型和13,878条结构化材料知识数据，能够预测无机材料的合成路径。"
}