{
    "title": "Learning Expected Appearances for Intraoperative Registration during Neurosurgery. (arXiv:2310.01735v1 [cs.CV])",
    "abstract": "We present a novel method for intraoperative patient-to-image registration by learning Expected Appearances. Our method uses preoperative imaging to synthesize patient-specific expected views through a surgical microscope for a predicted range of transformations. Our method estimates the camera pose by minimizing the dissimilarity between the intraoperative 2D view through the optical microscope and the synthesized expected texture. In contrast to conventional methods, our approach transfers the processing tasks to the preoperative stage, reducing thereby the impact of low-resolution, distorted, and noisy intraoperative images, that often degrade the registration accuracy. We applied our method in the context of neuronavigation during brain surgery. We evaluated our approach on synthetic data and on retrospective data from 6 clinical cases. Our method outperformed state-of-the-art methods and achieved accuracies that met current clinical standards.",
    "link": "http://arxiv.org/abs/2310.01735",
    "context": "Title: Learning Expected Appearances for Intraoperative Registration during Neurosurgery. (arXiv:2310.01735v1 [cs.CV])\nAbstract: We present a novel method for intraoperative patient-to-image registration by learning Expected Appearances. Our method uses preoperative imaging to synthesize patient-specific expected views through a surgical microscope for a predicted range of transformations. Our method estimates the camera pose by minimizing the dissimilarity between the intraoperative 2D view through the optical microscope and the synthesized expected texture. In contrast to conventional methods, our approach transfers the processing tasks to the preoperative stage, reducing thereby the impact of low-resolution, distorted, and noisy intraoperative images, that often degrade the registration accuracy. We applied our method in the context of neuronavigation during brain surgery. We evaluated our approach on synthetic data and on retrospective data from 6 clinical cases. Our method outperformed state-of-the-art methods and achieved accuracies that met current clinical standards.",
    "path": "papers/23/10/2310.01735.json",
    "total_tokens": 854,
    "translated_title": "在神经外科手术中学习预期外观以进行术中配准",
    "translated_abstract": "我们提出了一种通过学习预期外观进行术中患者到图像配准的新方法。我们的方法利用术前成像通过外科显微镜合成特定患者的预期视图，以进行预测范围内的变换。我们的方法通过最小化术中光学显微镜观察到的二维图像与合成预期纹理之间的差异来估计相机姿态。与传统方法不同，我们的方法将处理任务转移到术前阶段，从而降低了术中图像的低分辨率、畸变和噪音对配准精度的影响。我们在脑部手术的神经导航背景下应用了我们的方法。我们在合成数据和6个临床案例的回顾性数据上评估了我们的方法。我们的方法优于最先进的方法，并达到了当前临床标准。",
    "tldr": "本论文提出了一种通过学习预期外观进行术中患者到图像配准的新方法。通过预先合成特定患者的预期视图，并利用光学显微镜观察到的二维图像来估计相机姿态，该方法降低了术中图像质量对配准精度的影响，并在临床案例中表现出优异的准确度。"
}