{
    "title": "TANGO: Time-Reversal Latent GraphODE for Multi-Agent Dynamical Systems. (arXiv:2310.06427v1 [cs.LG])",
    "abstract": "Learning complex multi-agent system dynamics from data is crucial across many domains, such as in physical simulations and material modeling. Extended from purely data-driven approaches, existing physics-informed approaches such as Hamiltonian Neural Network strictly follow energy conservation law to introduce inductive bias, making their learning more sample efficiently. However, many real-world systems do not strictly conserve energy, such as spring systems with frictions. Recognizing this, we turn our attention to a broader physical principle: Time-Reversal Symmetry, which depicts that the dynamics of a system shall remain invariant when traversed back over time. It still helps to preserve energies for conservative systems and in the meanwhile, serves as a strong inductive bias for non-conservative, reversible systems. To inject such inductive bias, in this paper, we propose a simple-yet-effective self-supervised regularization term as a soft constraint that aligns the forward and b",
    "link": "http://arxiv.org/abs/2310.06427",
    "context": "Title: TANGO: Time-Reversal Latent GraphODE for Multi-Agent Dynamical Systems. (arXiv:2310.06427v1 [cs.LG])\nAbstract: Learning complex multi-agent system dynamics from data is crucial across many domains, such as in physical simulations and material modeling. Extended from purely data-driven approaches, existing physics-informed approaches such as Hamiltonian Neural Network strictly follow energy conservation law to introduce inductive bias, making their learning more sample efficiently. However, many real-world systems do not strictly conserve energy, such as spring systems with frictions. Recognizing this, we turn our attention to a broader physical principle: Time-Reversal Symmetry, which depicts that the dynamics of a system shall remain invariant when traversed back over time. It still helps to preserve energies for conservative systems and in the meanwhile, serves as a strong inductive bias for non-conservative, reversible systems. To inject such inductive bias, in this paper, we propose a simple-yet-effective self-supervised regularization term as a soft constraint that aligns the forward and b",
    "path": "papers/23/10/2310.06427.json",
    "total_tokens": 919,
    "translated_title": "TANGO: 时间反演潜在图ODE用于多智能体动力系统",
    "translated_abstract": "在许多领域中，从数据中学习复杂的多智能体系统动力学是至关重要的，例如在物理模拟和材料建模中。在纯数据驱动方法的基础上，现有的基于物理的方法如Hamiltonian神经网络严格遵循能量守恒定律引入归纳偏差，使得学习更加高效。然而，许多现实世界中的系统并不严格遵守能量守恒定律，如带有摩擦的弹簧系统。鉴于此，我们将注意力转向一个更广泛的物理原理：时间反演对称性，它描述了当系统的动力在时间上倒转时，动力学应保持不变。这仍然有助于保持保守系统的能量，并同时为非保守的可逆系统提供强大的归纳偏差。为了注入这种归纳偏差，本文提出了一个简单而有效的自监督正则化项作为软约束，将正向和逆向动力对齐。",
    "tldr": "本文提出了TANGO方法，通过时间反演对称性作为归纳偏差，对多智能体动力系统进行学习，即使在非保守的可逆系统中也能保持能量，并且能更高效地学习系统动力学。"
}