{
    "title": "Benchmarking a foundation LLM on its ability to re-label structure names in accordance with the AAPM TG-263 report. (arXiv:2310.03874v1 [physics.med-ph])",
    "abstract": "Purpose: To introduce the concept of using large language models (LLMs) to re-label structure names in accordance with the American Association of Physicists in Medicine (AAPM) Task Group (TG)-263 standard, and to establish a benchmark for future studies to reference.  Methods and Materials: The Generative Pre-trained Transformer (GPT)-4 application programming interface (API) was implemented as a Digital Imaging and Communications in Medicine (DICOM) storage server, which upon receiving a structure set DICOM file, prompts GPT-4 to re-label the structure names of both target volumes and normal tissues according to the AAPM TG-263. Three disease sites, prostate, head and neck, and thorax were selected for evaluation. For each disease site category, 150 patients were randomly selected for manually tuning the instructions prompt (in batches of 50) and 50 patients were randomly selected for evaluation. Structure names that were considered were those that were most likely to be relevant for",
    "link": "http://arxiv.org/abs/2310.03874",
    "context": "Title: Benchmarking a foundation LLM on its ability to re-label structure names in accordance with the AAPM TG-263 report. (arXiv:2310.03874v1 [physics.med-ph])\nAbstract: Purpose: To introduce the concept of using large language models (LLMs) to re-label structure names in accordance with the American Association of Physicists in Medicine (AAPM) Task Group (TG)-263 standard, and to establish a benchmark for future studies to reference.  Methods and Materials: The Generative Pre-trained Transformer (GPT)-4 application programming interface (API) was implemented as a Digital Imaging and Communications in Medicine (DICOM) storage server, which upon receiving a structure set DICOM file, prompts GPT-4 to re-label the structure names of both target volumes and normal tissues according to the AAPM TG-263. Three disease sites, prostate, head and neck, and thorax were selected for evaluation. For each disease site category, 150 patients were randomly selected for manually tuning the instructions prompt (in batches of 50) and 50 patients were randomly selected for evaluation. Structure names that were considered were those that were most likely to be relevant for",
    "path": "papers/23/10/2310.03874.json",
    "total_tokens": 882,
    "translated_title": "基准测试基于AAPM TG-263报告的基础LLM在重新标注结构名称方面的能力",
    "translated_abstract": "目的：介绍使用大型语言模型（LLM）按照美国医学物理学会（AAPM）任务组（TG）-263标准重新标注结构名称的概念，并为未来的研究建立基准参考。方法和材料：实现了生成式预训练转换器（GPT）-4应用程序接口（API）作为数字影像与通信医学（DICOM）存储服务器，该服务器在接收到结构集DICOM文件时，提示GPT-4根据AAPM TG-263重新标注目标体积和正常组织的结构名称。选择了前列腺、头颈部和胸部三个疾病部位进行评估。对于每个疾病部位类别，随机选择了150名患者进行手动调整指令提示（每批50名）和随机选择了50名患者进行评估。考虑的结构名称是最有可能相关的名称。",
    "tldr": "本文介绍了使用大型语言模型（LLMs）按照AAPM TG-263标准重新标注结构名称的概念，并建立了一个基准，供未来的研究参考。"
}