{
    "title": "Meaning and understanding in large language models. (arXiv:2310.17407v1 [cs.CL])",
    "abstract": "Can a machine understand the meanings of natural language? Recent developments in the generative large language models (LLMs) of artificial intelligence have led to the belief that traditional philosophical assumptions about machine understanding of language need to be revised. This article critically evaluates the prevailing tendency to regard machine language performance as mere syntactic manipulation and the simulation of understanding, which is only partial and very shallow, without sufficient referential grounding in the world. The aim is to highlight the conditions crucial to attributing natural language understanding to state-of-the-art LLMs, where it can be legitimately argued that LLMs not only use syntax but also semantics, their understanding not being simulated but duplicated; and determine how they ground the meanings of linguistic expressions.",
    "link": "http://arxiv.org/abs/2310.17407",
    "context": "Title: Meaning and understanding in large language models. (arXiv:2310.17407v1 [cs.CL])\nAbstract: Can a machine understand the meanings of natural language? Recent developments in the generative large language models (LLMs) of artificial intelligence have led to the belief that traditional philosophical assumptions about machine understanding of language need to be revised. This article critically evaluates the prevailing tendency to regard machine language performance as mere syntactic manipulation and the simulation of understanding, which is only partial and very shallow, without sufficient referential grounding in the world. The aim is to highlight the conditions crucial to attributing natural language understanding to state-of-the-art LLMs, where it can be legitimately argued that LLMs not only use syntax but also semantics, their understanding not being simulated but duplicated; and determine how they ground the meanings of linguistic expressions.",
    "path": "papers/23/10/2310.17407.json",
    "total_tokens": 816,
    "translated_title": "大型语言模型中的意义和理解",
    "translated_abstract": "机器能理解自然语言的意义吗？人工智能生成的大型语言模型(LLMs)的最新发展使人们相信传统的关于机器语言理解的哲学假设需要修订。本文对普遍趋势进行了批判性评估，认为机器语言性能仅仅是语法操作和模拟理解，这种理解只是部分的且非常浅显，没有足够的世界参考基础。目的是强调将自然语言理解归因于最先进的LLMs的关键条件，可以合法地认为LLMs不仅使用语法，而且使用语义，它们的理解不是模拟而是复制，并确定它们如何建立语言表达的意义。",
    "tldr": "本文评估了大型语言模型在理解自然语言中的意义时的条件。最新的人工智能模型认为传统的机器理解语言的假设需要修订。这篇文章着重强调了最先进的LLM模型不仅使用语法，而且也使用语义，并确定它们如何建立语言表达的意义。",
    "en_tdlr": "This article critically evaluates the conditions for understanding the meanings of natural language in large language models. Recent developments in artificial intelligence models suggest that traditional assumptions about machine understanding of language need to be revised. The aim is to highlight the use of syntax and semantics in state-of-the-art LLMs and how they ground the meanings of linguistic expressions."
}