{
    "title": "Combining Deep Learning and GARCH Models for Financial Volatility and Risk Forecasting. (arXiv:2310.01063v1 [q-fin.RM])",
    "abstract": "In this paper, we develop a hybrid approach to forecasting the volatility and risk of financial instruments by combining common econometric GARCH time series models with deep learning neural networks. For the latter, we employ Gated Recurrent Unit (GRU) networks, whereas four different specifications are used as the GARCH component: standard GARCH, EGARCH, GJR-GARCH and APARCH. Models are tested using daily logarithmic returns on the S&P 500 index as well as gold price Bitcoin prices, with the three assets representing quite distinct volatility dynamics. As the main volatility estimator, also underlying the target function of our hybrid models, we use the price-range-based Garman-Klass estimator, modified to incorporate the opening and closing prices. Volatility forecasts resulting from the hybrid models are employed to evaluate the assets' risk using the Value-at-Risk (VaR) and Expected Shortfall (ES) at two different tolerance levels of 5% and 1%. Gains from combining the GARCH and G",
    "link": "http://arxiv.org/abs/2310.01063",
    "context": "Title: Combining Deep Learning and GARCH Models for Financial Volatility and Risk Forecasting. (arXiv:2310.01063v1 [q-fin.RM])\nAbstract: In this paper, we develop a hybrid approach to forecasting the volatility and risk of financial instruments by combining common econometric GARCH time series models with deep learning neural networks. For the latter, we employ Gated Recurrent Unit (GRU) networks, whereas four different specifications are used as the GARCH component: standard GARCH, EGARCH, GJR-GARCH and APARCH. Models are tested using daily logarithmic returns on the S&P 500 index as well as gold price Bitcoin prices, with the three assets representing quite distinct volatility dynamics. As the main volatility estimator, also underlying the target function of our hybrid models, we use the price-range-based Garman-Klass estimator, modified to incorporate the opening and closing prices. Volatility forecasts resulting from the hybrid models are employed to evaluate the assets' risk using the Value-at-Risk (VaR) and Expected Shortfall (ES) at two different tolerance levels of 5% and 1%. Gains from combining the GARCH and G",
    "path": "papers/23/10/2310.01063.json",
    "total_tokens": 925,
    "translated_title": "结合深度学习和GARCH模型进行金融波动率和风险预测",
    "translated_abstract": "本文通过将常见的计量GARCH时间序列模型与深度学习神经网络相结合，提出了一种混合方法来预测金融工具的波动率和风险。对于后者，我们采用门控循环单元（GRU）网络，而GARCH部分采用了四种不同的规范：标准GARCH、EGARCH、GJR-GARCH和APARCH。我们使用标普500指数的每日对数收益率以及黄金价格比特币价格进行模型测试，这三个资产代表了相当不同的波动率动态。作为主要的波动率估计器，同时也是我们混合模型目标函数的基础，我们使用基于价格范围的Garman-Klass估计器，修改它来包含开盘和收盘价。利用混合模型得到的波动率预测来评估资产的风险，使用两个不同容忍水平（5%和1%）的风险价值（VaR）和预期损失（ES）。从结合GARCH和G",
    "tldr": "本文提出了一种结合深度学习神经网络和GARCH模型的混合方法，用于预测金融工具的波动率和风险。实验证明这种方法在不同资产上均取得了良好的效果。"
}