{
    "title": "Modeling and Contribution of Flexible Heating Systems for Transmission Grid Congestion Management. (arXiv:2310.15933v1 [eess.SY])",
    "abstract": "The large-scale integration of flexible heating systems in the European electricity market leads to a substantial increase of transportation requirements and consecutively grid congestions in the continental transmission grid. Novel model formulations for the grid-aware operation of both individual small-scale heat pumps and large-scale power-to-heat (PtH) units located in district heating networks are presented. The functionality of the models and the contribution of flexible heating systems for transmission grid congestion management is evaluated by running simulations for the target year 2035 for the German transmission grid. The findings show a decrease in annual conventional redispatch volumes and renewable energy sources (RES) curtailment resulting in cost savings of approximately 6 % through the integration of flexible heating systems in the grid congestion management scheme. The analysis suggests that especially large-scale PtH units in combination with thermal energy storages ",
    "link": "http://arxiv.org/abs/2310.15933",
    "context": "Title: Modeling and Contribution of Flexible Heating Systems for Transmission Grid Congestion Management. (arXiv:2310.15933v1 [eess.SY])\nAbstract: The large-scale integration of flexible heating systems in the European electricity market leads to a substantial increase of transportation requirements and consecutively grid congestions in the continental transmission grid. Novel model formulations for the grid-aware operation of both individual small-scale heat pumps and large-scale power-to-heat (PtH) units located in district heating networks are presented. The functionality of the models and the contribution of flexible heating systems for transmission grid congestion management is evaluated by running simulations for the target year 2035 for the German transmission grid. The findings show a decrease in annual conventional redispatch volumes and renewable energy sources (RES) curtailment resulting in cost savings of approximately 6 % through the integration of flexible heating systems in the grid congestion management scheme. The analysis suggests that especially large-scale PtH units in combination with thermal energy storages ",
    "path": "papers/23/10/2310.15933.json",
    "total_tokens": 982,
    "translated_title": "弹性供暖系统对输电网拥塞管理的建模与贡献",
    "translated_abstract": "在欧洲电力市场中大规模整合弹性供暖系统导致了对欧洲输电网的运输需求大幅增加，由此引起了大陆输电网的拥塞问题。本文提出了对个体小规模热泵和位于区域供热网络中的大规模电能转热系统（PtH）单元进行网格感知运行的新模型。通过对德国输电网2035年的目标进行模拟评估，探讨了弹性供暖系统对输电网拥塞管理的功能和贡献。研究结果显示，在网格拥塞管理方案中整合弹性供暖系统能够降低年度常规重调度量和可再生能源（RES）削减量，从而节省约6%的成本。分析表明，尤其是大规模PtH单元结合热能储存的应用对于拥塞管理具有重要意义。",
    "tldr": "本研究提出了新的模型来评估个体小规模热泵和大规模电能转热系统的网格感知运行，并探讨了弹性供暖系统对输电网拥塞管理的贡献。研究结果显示，通过整合弹性供暖系统，可实现减少常规重调度量和可再生能源削减量，节省成本约6%。大规模PtH单元结合热能储存应用对于拥塞管理具有重要意义。",
    "en_tdlr": "This research presents novel models for grid-aware operation of both individual small-scale heat pumps and large-scale power-to-heat units, and examines the contribution of flexible heating systems in managing transmission grid congestion. The findings indicate that integrating flexible heating systems can reduce conventional redispatch volumes and renewable energy curtailment, resulting in cost savings of approximately 6%. Large-scale power-to-heat units combined with thermal energy storage are particularly significant for congestion management."
}