{
    "title": "Document-Level Supervision for Multi-Aspect Sentiment Analysis Without Fine-grained Labels. (arXiv:2310.06940v1 [cs.CL])",
    "abstract": "Aspect-based sentiment analysis (ABSA) is a widely studied topic, most often trained through supervision from human annotations of opinionated texts. These fine-grained annotations include identifying aspects towards which a user expresses their sentiment, and their associated polarities (aspect-based sentiments). Such fine-grained annotations can be expensive and often infeasible to obtain in real-world settings. There is, however, an abundance of scenarios where user-generated text contains an overall sentiment, such as a rating of 1-5 in user reviews or user-generated feedback, which may be leveraged for this task. In this paper, we propose a VAE-based topic modeling approach that performs ABSA using document-level supervision and without requiring fine-grained labels for either aspects or sentiments. Our approach allows for the detection of multiple aspects in a document, thereby allowing for the possibility of reasoning about how sentiment expressed through multiple aspects comes ",
    "link": "http://arxiv.org/abs/2310.06940",
    "context": "Title: Document-Level Supervision for Multi-Aspect Sentiment Analysis Without Fine-grained Labels. (arXiv:2310.06940v1 [cs.CL])\nAbstract: Aspect-based sentiment analysis (ABSA) is a widely studied topic, most often trained through supervision from human annotations of opinionated texts. These fine-grained annotations include identifying aspects towards which a user expresses their sentiment, and their associated polarities (aspect-based sentiments). Such fine-grained annotations can be expensive and often infeasible to obtain in real-world settings. There is, however, an abundance of scenarios where user-generated text contains an overall sentiment, such as a rating of 1-5 in user reviews or user-generated feedback, which may be leveraged for this task. In this paper, we propose a VAE-based topic modeling approach that performs ABSA using document-level supervision and without requiring fine-grained labels for either aspects or sentiments. Our approach allows for the detection of multiple aspects in a document, thereby allowing for the possibility of reasoning about how sentiment expressed through multiple aspects comes ",
    "path": "papers/23/10/2310.06940.json",
    "total_tokens": 837,
    "translated_title": "无需细粒度标签的多方面情感分析的文档级监督",
    "translated_abstract": "方面情感分析（ABSA）是一个广泛研究的主题，通常通过人工标注的意见文本进行监督训练。这些细粒度的标注包括识别用户表达情感的方面以及它们的极性（基于方面的情感）。然而，这些细粒度的标注在真实世界的环境中往往昂贵且难以实现。在某些情况下，用户生成的文本包含了整体情感，例如用户评论或用户反馈中的1-5评分，可以利用这些信息来进行任务。本文提出了一种基于VAE主题建模的方法，利用文档级监督进行ABSA，无需对方面或情感进行细粒度标签。我们的方法允许在一个文档中检测多个方面，从而可以理解通过多个方面表达的情感。",
    "tldr": "本文提出了一种利用文档级监督进行多方面情感分析的方法，无需细粒度标签，可以检测文档中的多个方面，并能理解通过多个方面表达的情感。",
    "en_tdlr": "This paper proposes an approach for multi-aspect sentiment analysis using document-level supervision without fine-grained labels. It allows for the detection of multiple aspects in a document and understanding sentiment expressed through multiple aspects."
}