{
    "title": "C-Disentanglement: Discovering Causally-Independent Generative Factors under an Inductive Bias of Confounder. (arXiv:2310.17325v1 [cs.LG])",
    "abstract": "Representation learning assumes that real-world data is generated by a few semantically meaningful generative factors (i.e., sources of variation) and aims to discover them in the latent space. These factors are expected to be causally disentangled, meaning that distinct factors are encoded into separate latent variables, and changes in one factor will not affect the values of the others. Compared to statistical independence, causal disentanglement allows more controllable data generation, improved robustness, and better generalization. However, most existing work assumes unconfoundedness in the discovery process, that there are no common causes to the generative factors and thus obtain only statistical independence. In this paper, we recognize the importance of modeling confounders in discovering causal generative factors. Unfortunately, such factors are not identifiable without proper inductive bias. We fill the gap by introducing a framework entitled Confounded-Disentanglement (C-Di",
    "link": "http://arxiv.org/abs/2310.17325",
    "context": "Title: C-Disentanglement: Discovering Causally-Independent Generative Factors under an Inductive Bias of Confounder. (arXiv:2310.17325v1 [cs.LG])\nAbstract: Representation learning assumes that real-world data is generated by a few semantically meaningful generative factors (i.e., sources of variation) and aims to discover them in the latent space. These factors are expected to be causally disentangled, meaning that distinct factors are encoded into separate latent variables, and changes in one factor will not affect the values of the others. Compared to statistical independence, causal disentanglement allows more controllable data generation, improved robustness, and better generalization. However, most existing work assumes unconfoundedness in the discovery process, that there are no common causes to the generative factors and thus obtain only statistical independence. In this paper, we recognize the importance of modeling confounders in discovering causal generative factors. Unfortunately, such factors are not identifiable without proper inductive bias. We fill the gap by introducing a framework entitled Confounded-Disentanglement (C-Di",
    "path": "papers/23/10/2310.17325.json",
    "total_tokens": 931,
    "translated_title": "C-Disentanglement: 带有混淆因子归纳偏差的因果独立生成因子的发现",
    "translated_abstract": "表征学习假设实际世界的数据是由几个语义上有意义的生成因子（即变异源）产生的，并旨在在潜在空间中发现它们。这些因子被期望是因果上解缠的，意味着不同的因子被编码为单独的潜在变量，并且一个因子的变化不会影响其他因子的值。与统计独立性相比，因果解缠允许更可控的数据生成，提高了鲁棒性和更好的泛化性能。然而，大多数现有工作在发现过程中假设没有混淆因素，即生成因子没有共同的原因，因此只获得统计独立性。在本文中，我们认识到在发现因果生成因子中建立混淆因素的模型的重要性。然而，如果没有适当的归纳偏差，这些因素是无法识别的。我们通过引入一个名为混淆-解缠（C-Di）的框架来填补这一空白。",
    "tldr": "本文提出了一个名为C-Disentanglement的框架，旨在发现具有因果关系且受混淆因素影响的生成因子，以提高数据生成的可控性和鲁棒性。"
}