{
    "title": "Generative Modeling of Regular and Irregular Time Series Data via Koopman VAEs. (arXiv:2310.02619v1 [cs.LG])",
    "abstract": "Generating realistic time series data is important for many engineering and scientific applications. Existing work tackles this problem using generative adversarial networks (GANs). However, GANs are often unstable during training, and they can suffer from mode collapse. While variational autoencoders (VAEs) are known to be more robust to these issues, they are (surprisingly) less often considered for time series generation. In this work, we introduce Koopman VAE (KVAE), a new generative framework that is based on a novel design for the model prior, and that can be optimized for either regular and irregular training data. Inspired by Koopman theory, we represent the latent conditional prior dynamics using a linear map. Our approach enhances generative modeling with two desired features: (i) incorporating domain knowledge can be achieved by leverageing spectral tools that prescribe constraints on the eigenvalues of the linear map; and (ii) studying the qualitative behavior and stablity ",
    "link": "http://arxiv.org/abs/2310.02619",
    "context": "Title: Generative Modeling of Regular and Irregular Time Series Data via Koopman VAEs. (arXiv:2310.02619v1 [cs.LG])\nAbstract: Generating realistic time series data is important for many engineering and scientific applications. Existing work tackles this problem using generative adversarial networks (GANs). However, GANs are often unstable during training, and they can suffer from mode collapse. While variational autoencoders (VAEs) are known to be more robust to these issues, they are (surprisingly) less often considered for time series generation. In this work, we introduce Koopman VAE (KVAE), a new generative framework that is based on a novel design for the model prior, and that can be optimized for either regular and irregular training data. Inspired by Koopman theory, we represent the latent conditional prior dynamics using a linear map. Our approach enhances generative modeling with two desired features: (i) incorporating domain knowledge can be achieved by leverageing spectral tools that prescribe constraints on the eigenvalues of the linear map; and (ii) studying the qualitative behavior and stablity ",
    "path": "papers/23/10/2310.02619.json",
    "total_tokens": 970,
    "translated_title": "通过Koopman VAEs生成规则和非规则时间序列数据的生成建模",
    "translated_abstract": "生成真实的时间序列数据对于许多工程和科学应用非常重要。现有的工作使用生成对抗网络（GANs）来解决这个问题。然而，GANs在训练过程中常常不稳定，并且可能出现模式崩溃的问题。而变分自动编码器（VAEs）被认为对这些问题更具鲁棒性，但却很少被考虑用于时间序列生成。在这项工作中，我们引入了基于新型模型先验的生成框架Koopman VAE（KVAE），可以为规则和非规则训练数据进行优化。受Koopman理论的启发，我们使用线性映射来表示潜在条件先验动态。我们的方法增强了生成建模的两个期望特性：（i）通过利用谱工具对线性映射的特征值施加约束，可以实现领域知识的整合；（ii）研究定性行为和稳定性。",
    "tldr": "本文介绍了一种基于Koopman VAEs的新型生成框架，可以用于生成规则和非规则时间序列数据，解决了GANs训练不稳定和模式崩溃的问题，并通过利用谱工具对线性映射的特征值施加约束，实现了领域知识的整合和对定性行为和稳定性的研究。"
}