{
    "title": "Reading Order Matters: Information Extraction from Visually-rich Documents by Token Path Prediction. (arXiv:2310.11016v1 [cs.CL])",
    "abstract": "Recent advances in multimodal pre-trained models have significantly improved information extraction from visually-rich documents (VrDs), in which named entity recognition (NER) is treated as a sequence-labeling task of predicting the BIO entity tags for tokens, following the typical setting of NLP. However, BIO-tagging scheme relies on the correct order of model inputs, which is not guaranteed in real-world NER on scanned VrDs where text are recognized and arranged by OCR systems. Such reading order issue hinders the accurate marking of entities by BIO-tagging scheme, making it impossible for sequence-labeling methods to predict correct named entities. To address the reading order issue, we introduce Token Path Prediction (TPP), a simple prediction head to predict entity mentions as token sequences within documents. Alternative to token classification, TPP models the document layout as a complete directed graph of tokens, and predicts token paths within the graph as entities. For bette",
    "link": "http://arxiv.org/abs/2310.11016",
    "context": "Title: Reading Order Matters: Information Extraction from Visually-rich Documents by Token Path Prediction. (arXiv:2310.11016v1 [cs.CL])\nAbstract: Recent advances in multimodal pre-trained models have significantly improved information extraction from visually-rich documents (VrDs), in which named entity recognition (NER) is treated as a sequence-labeling task of predicting the BIO entity tags for tokens, following the typical setting of NLP. However, BIO-tagging scheme relies on the correct order of model inputs, which is not guaranteed in real-world NER on scanned VrDs where text are recognized and arranged by OCR systems. Such reading order issue hinders the accurate marking of entities by BIO-tagging scheme, making it impossible for sequence-labeling methods to predict correct named entities. To address the reading order issue, we introduce Token Path Prediction (TPP), a simple prediction head to predict entity mentions as token sequences within documents. Alternative to token classification, TPP models the document layout as a complete directed graph of tokens, and predicts token paths within the graph as entities. For bette",
    "path": "papers/23/10/2310.11016.json",
    "total_tokens": 930,
    "translated_title": "从视觉丰富的文档中提取信息的阅读顺序的重要性：通过令牌路径预测来实现",
    "translated_abstract": "最近多模态预训练模型的进展显著提高了对视觉丰富文档（VrDs）中的信息提取，其中命名实体识别（NER）被视为预测令牌的BIO实体标签的序列标注任务，遵循NLP的典型设置。然而，BIO标记方案依赖于模型输入的正确顺序，在OCR系统识别和安排文本的扫描VrDs中无法保证。这种阅读顺序问题阻碍了通过BIO标记方案准确标记实体，使得序列标注方法无法预测正确的命名实体。为了解决阅读顺序问题，我们引入了令牌路径预测（TPP），这是一个简单的预测头，用于在文档中预测作为令牌序列的实体提及。与令牌分类不同，TPP将文档布局建模为令牌的完整有向图，并预测实体在图中的令牌路径。",
    "tldr": "本研究探讨了在视觉丰富文档中提取信息的问题，并通过引入令牌路径预测的方法来解决实体标记的阅读顺序问题。该方法将文档布局建模为令牌的有向图，并预测实体的令牌路径。",
    "en_tdlr": "This study addresses the issue of information extraction from visually-rich documents and introduces the Token Path Prediction method to solve the reading order problem for entity labeling. The method models the document layout as a directed graph of tokens and predicts the token paths for entities."
}