{
    "title": "Causal effects of the Fed's large-scale asset purchases on firms' capital structure. (arXiv:2310.18638v1 [econ.GN])",
    "abstract": "We investigate the short- and long-term impacts of the Federal Reserve's large-scale asset purchases (LSAPs) on non-financial firms' capital structure using a threshold panel ARDL model. To isolate the effects of LSAPs from other macroeconomic conditions, we interact firm- and industry-specific indicators of debt capacity with measures of LSAPs. We find that LSAPs facilitated firms' access to external financing, with both Treasury and MBS purchases having positive effects. Our model also allows us to estimate the time profile of the effects of LSAPs on firm leverage providing robust evidence that they are long-lasting. These effects have a half-life of 4-5 quarters and a mean lag length of about six quarters. Nevertheless, the magnitudes are small, suggesting that LSAPs have contributed only marginally to the rise in U.S. corporate debt ratios of the past decade.",
    "link": "http://arxiv.org/abs/2310.18638",
    "context": "Title: Causal effects of the Fed's large-scale asset purchases on firms' capital structure. (arXiv:2310.18638v1 [econ.GN])\nAbstract: We investigate the short- and long-term impacts of the Federal Reserve's large-scale asset purchases (LSAPs) on non-financial firms' capital structure using a threshold panel ARDL model. To isolate the effects of LSAPs from other macroeconomic conditions, we interact firm- and industry-specific indicators of debt capacity with measures of LSAPs. We find that LSAPs facilitated firms' access to external financing, with both Treasury and MBS purchases having positive effects. Our model also allows us to estimate the time profile of the effects of LSAPs on firm leverage providing robust evidence that they are long-lasting. These effects have a half-life of 4-5 quarters and a mean lag length of about six quarters. Nevertheless, the magnitudes are small, suggesting that LSAPs have contributed only marginally to the rise in U.S. corporate debt ratios of the past decade.",
    "path": "papers/23/10/2310.18638.json",
    "total_tokens": 962,
    "translated_title": "联邦储备系统大规模资产购买对企业资本结构的因果影响",
    "translated_abstract": "我们使用阈值面板ARDL模型研究了联邦储备系统大规模资产购买（LSAPs）对非金融企业资本结构的短期和长期影响。为了从宏观经济情况中分离出LSAPs的影响，我们将公司和行业特定的债务能力指标与LSAPs的度量相互作用。我们发现LSAPs促进了企业对外部融资的获取，无论是国债购买还是抵押贷款支持证券（MBS）购买都有正面效应。我们的模型还能够估计LSAPs对企业杠杆率影响的时间轮廓，提供了稳健的证据表明这些影响是长期的。这些影响的半衰期为4-5个季度，平均滞后长度约为六个季度。然而，幅度较小，表明过去十年美国公司债务比率的上升是LSAPs只有少量贡献。",
    "tldr": "本研究使用阈值面板ARDL模型，探究了联邦储备系统大规模资产购买对非金融企业资本结构的短期和长期影响。研究发现，LSAPs促进了企业对外部融资的获取，但其对美国公司债务比率的上升的贡献较小。",
    "en_tdlr": "This study investigates the short- and long-term impacts of the Federal Reserve's large-scale asset purchases (LSAPs) on non-financial firms' capital structure. The results indicate that LSAPs facilitate firms' access to external financing, but their contribution to the rise in US corporate debt ratios is marginal."
}