{
    "title": "Moran's I Lasso for models with spatially correlated data. (arXiv:2310.02773v1 [econ.EM])",
    "abstract": "This paper proposes a Lasso-based estimator which uses information embedded in the Moran statistic to develop a selection procedure called Moran's I Lasso (Mi-Lasso) to solve the Eigenvector Spatial Filtering (ESF) eigenvector selection problem. ESF uses a subset of eigenvectors from a spatial weights matrix to efficiently account for any omitted cross-sectional correlation terms in a classical linear regression framework, thus does not require the researcher to explicitly specify the spatial part of the underlying structural model. We derive performance bounds and show the necessary conditions for consistent eigenvector selection. The key advantages of the proposed estimator are that it is intuitive, theoretically grounded, and substantially faster than Lasso based on cross-validation or any proposed forward stepwise procedure. Our main simulation results show the proposed selection procedure performs well in finite samples. Compared to existing selection procedures, we find Mi-Lasso ",
    "link": "http://arxiv.org/abs/2310.02773",
    "context": "Title: Moran's I Lasso for models with spatially correlated data. (arXiv:2310.02773v1 [econ.EM])\nAbstract: This paper proposes a Lasso-based estimator which uses information embedded in the Moran statistic to develop a selection procedure called Moran's I Lasso (Mi-Lasso) to solve the Eigenvector Spatial Filtering (ESF) eigenvector selection problem. ESF uses a subset of eigenvectors from a spatial weights matrix to efficiently account for any omitted cross-sectional correlation terms in a classical linear regression framework, thus does not require the researcher to explicitly specify the spatial part of the underlying structural model. We derive performance bounds and show the necessary conditions for consistent eigenvector selection. The key advantages of the proposed estimator are that it is intuitive, theoretically grounded, and substantially faster than Lasso based on cross-validation or any proposed forward stepwise procedure. Our main simulation results show the proposed selection procedure performs well in finite samples. Compared to existing selection procedures, we find Mi-Lasso ",
    "path": "papers/23/10/2310.02773.json",
    "total_tokens": 868,
    "translated_title": "Moran的I Lasso用于具有空间相关数据的模型",
    "translated_abstract": "本文提出了一种基于Lasso的估计器，利用Moran统计量中嵌入的信息来开发一种选择过程，称为Moran的I Lasso (Mi-Lasso)，以解决特征向量空间滤波（ESF）特征向量选择问题。ESF使用空间加权矩阵的子集来有效地考虑经典线性回归框架中遗漏的横截面相关项，因此不需要研究者明确指定底层结构模型的空间部分。我们推导了性能界限，并展示了一致性特征向量选择的必要条件。该估计器的主要优点是直观、理论基础扎实，而且比基于交叉验证或任何提出的前向逐步过程的Lasso方法快得多。我们的主要模拟结果表明，所提出的选择过程在有限样本中表现良好。与现有的选择过程相比，我们发现Mi-Lasso在选择准确性和计算速度方面表现优异。",
    "tldr": "本文提出了一种新的基于Lasso的估计器，利用Moran统计量来解决特征向量选择问题，该方法在性能和计算速度上有明显优势。",
    "en_tdlr": "This paper proposes a new Lasso-based estimator, called Moran's I Lasso (Mi-Lasso), which utilizes the Moran statistic to solve the eigenvector selection problem. The method outperforms existing selection procedures in terms of performance and computational speed."
}