{
    "title": "LCOT: Linear circular optimal transport. (arXiv:2310.06002v1 [cs.LG])",
    "abstract": "The optimal transport problem for measures supported on non-Euclidean spaces has recently gained ample interest in diverse applications involving representation learning. In this paper, we focus on circular probability measures, i.e., probability measures supported on the unit circle, and introduce a new computationally efficient metric for these measures, denoted as Linear Circular Optimal Transport (LCOT). The proposed metric comes with an explicit linear embedding that allows one to apply Machine Learning (ML) algorithms to the embedded measures and seamlessly modify the underlying metric for the ML algorithm to LCOT. We show that the proposed metric is rooted in the Circular Optimal Transport (COT) and can be considered the linearization of the COT metric with respect to a fixed reference measure. We provide a theoretical analysis of the proposed metric and derive the computational complexities for pairwise comparison of circular probability measures. Lastly, through a set of numer",
    "link": "http://arxiv.org/abs/2310.06002",
    "context": "Title: LCOT: Linear circular optimal transport. (arXiv:2310.06002v1 [cs.LG])\nAbstract: The optimal transport problem for measures supported on non-Euclidean spaces has recently gained ample interest in diverse applications involving representation learning. In this paper, we focus on circular probability measures, i.e., probability measures supported on the unit circle, and introduce a new computationally efficient metric for these measures, denoted as Linear Circular Optimal Transport (LCOT). The proposed metric comes with an explicit linear embedding that allows one to apply Machine Learning (ML) algorithms to the embedded measures and seamlessly modify the underlying metric for the ML algorithm to LCOT. We show that the proposed metric is rooted in the Circular Optimal Transport (COT) and can be considered the linearization of the COT metric with respect to a fixed reference measure. We provide a theoretical analysis of the proposed metric and derive the computational complexities for pairwise comparison of circular probability measures. Lastly, through a set of numer",
    "path": "papers/23/10/2310.06002.json",
    "total_tokens": 925,
    "translated_title": "LCOT: 线性循环最优传输",
    "translated_abstract": "最近，非欧几里德空间上支持的测度的最优传输问题在涉及表示学习的各种应用中引起了广泛的关注。在本文中，我们专注于循环概率测度，即支持在单位圆上的概率测度，并引入了一种新的计算效率较高的度量方法，称为线性循环最优传输（LCOT）。所提出的度量方法具有明确的线性嵌入，使得可以将机器学习（ML）算法应用于嵌入的测度，并无缝地修改ML算法的基本度量为LCOT。我们展示了所提出的度量方法扎根于循环最优传输（COT），可以被认为是相对于固定参考测度的COT度量的线性化。我们提供了对所提出的度量方法的理论分析，并导出了循环概率测度的成对比较的计算复杂性。最后，通过一系列的数值实验，我们验证了所提出的度量方法的有效性。",
    "tldr": "本文提出了一种线性循环最优传输（LCOT）方法，用于解决循环概率测度的最优传输问题。LCOT方法具有明确的线性嵌入，可以应用机器学习算法，并在循环最优传输的基础上进行修改。通过理论分析和数值实验，证明了LCOT方法的有效性。",
    "en_tdlr": "This paper proposes a linear circular optimal transport (LCOT) method for solving the optimal transport problem for circular probability measures. The LCOT method has an explicit linear embedding, allowing the application of machine learning algorithms and modification of the underlying metric. The effectiveness of the LCOT method is demonstrated through theoretical analysis and numerical experiments."
}