{
    "title": "Towards Unifying Diffusion Models for Probabilistic Spatio-Temporal Graph Learning. (arXiv:2310.17360v1 [cs.LG])",
    "abstract": "Spatio-temporal graph learning is a fundamental problem in the Web of Things era, which enables a plethora of Web applications such as smart cities, human mobility and climate analysis. Existing approaches tackle different learning tasks independently, tailoring their models to unique task characteristics. These methods, however, fall short of modeling intrinsic uncertainties in the spatio-temporal data. Meanwhile, their specialized designs limit their universality as general spatio-temporal learning solutions. In this paper, we propose to model the learning tasks in a unified perspective, viewing them as predictions based on conditional information with shared spatio-temporal patterns. Based on this proposal, we introduce Unified Spatio-Temporal Diffusion Models (USTD) to address the tasks uniformly within the uncertainty-aware diffusion framework. USTD is holistically designed, comprising a shared spatio-temporal encoder and attention-based denoising networks that are task-specific. ",
    "link": "http://arxiv.org/abs/2310.17360",
    "context": "Title: Towards Unifying Diffusion Models for Probabilistic Spatio-Temporal Graph Learning. (arXiv:2310.17360v1 [cs.LG])\nAbstract: Spatio-temporal graph learning is a fundamental problem in the Web of Things era, which enables a plethora of Web applications such as smart cities, human mobility and climate analysis. Existing approaches tackle different learning tasks independently, tailoring their models to unique task characteristics. These methods, however, fall short of modeling intrinsic uncertainties in the spatio-temporal data. Meanwhile, their specialized designs limit their universality as general spatio-temporal learning solutions. In this paper, we propose to model the learning tasks in a unified perspective, viewing them as predictions based on conditional information with shared spatio-temporal patterns. Based on this proposal, we introduce Unified Spatio-Temporal Diffusion Models (USTD) to address the tasks uniformly within the uncertainty-aware diffusion framework. USTD is holistically designed, comprising a shared spatio-temporal encoder and attention-based denoising networks that are task-specific. ",
    "path": "papers/23/10/2310.17360.json",
    "total_tokens": 893,
    "translated_title": "《面向概率时空图学习的扩散模型统一化》",
    "translated_abstract": "在物联网时代，时空图学习是一个基本问题，可以应用于智能城市、人类移动性和气候分析等众多网络应用。现有方法独立地解决不同的学习任务，并根据任务特点调整模型。然而，这些方法未能模拟时空数据中的固有不确定性。同时，它们专门设计的模型限制了其作为普适时空学习解决方案的通用性。在本文中，我们提出以统一视角建模学习任务，将其视为基于共享时空模式的条件信息预测。基于这一建议，我们引入了统一时空扩散模型（USTD），在考虑不确定性的扩散框架下统一处理任务。USTD的设计是全面的，包括一个共享时空编码器和基于注意力的去噪网络，针对不同任务进行。",
    "tldr": "本文提出了一种统一的时空图学习方法，即统一时空扩散模型（USTD），用于处理物联网时代的各种学习任务。USTD综合考虑了时空数据中的不确定性，并利用共享的时空模式进行预测。此方法具有通用性和灵活性。",
    "en_tdlr": "This paper introduces a unified approach called Unified Spatio-Temporal Diffusion Models (USTD) for addressing various learning tasks in the era of the Internet of Things. USTD incorporates uncertainty in spatio-temporal data and utilizes shared patterns for predictions. It offers universality and flexibility in its design."
}