{
    "title": "DIAR: Deep Image Alignment and Reconstruction using Swin Transformers. (arXiv:2310.11605v1 [cs.CV])",
    "abstract": "When taking images of some occluded content, one is often faced with the problem that every individual image frame contains unwanted artifacts, but a collection of images contains all relevant information if properly aligned and aggregated. In this paper, we attempt to build a deep learning pipeline that simultaneously aligns a sequence of distorted images and reconstructs them. We create a dataset that contains images with image distortions, such as lighting, specularities, shadows, and occlusion. We create perspective distortions with corresponding ground-truth homographies as labels. We use our dataset to train Swin transformer models to analyze sequential image data. The attention maps enable the model to detect relevant image content and differentiate it from outliers and artifacts. We further explore using neural feature maps as alternatives to classical key point detectors. The feature maps of trained convolutional layers provide dense image descriptors that can be used to find ",
    "link": "http://arxiv.org/abs/2310.11605",
    "context": "Title: DIAR: Deep Image Alignment and Reconstruction using Swin Transformers. (arXiv:2310.11605v1 [cs.CV])\nAbstract: When taking images of some occluded content, one is often faced with the problem that every individual image frame contains unwanted artifacts, but a collection of images contains all relevant information if properly aligned and aggregated. In this paper, we attempt to build a deep learning pipeline that simultaneously aligns a sequence of distorted images and reconstructs them. We create a dataset that contains images with image distortions, such as lighting, specularities, shadows, and occlusion. We create perspective distortions with corresponding ground-truth homographies as labels. We use our dataset to train Swin transformer models to analyze sequential image data. The attention maps enable the model to detect relevant image content and differentiate it from outliers and artifacts. We further explore using neural feature maps as alternatives to classical key point detectors. The feature maps of trained convolutional layers provide dense image descriptors that can be used to find ",
    "path": "papers/23/10/2310.11605.json",
    "total_tokens": 931,
    "translated_title": "DIAR: 使用Swin Transformers进行深度图像对齐和重建",
    "translated_abstract": "在拍摄一些被遮挡内容的图像时，通常会面临的问题是每个单独的图像帧都包含不需要的伪像，但是如果正确对齐和聚合一系列图像，就可以获得所有相关信息。在本文中，我们尝试构建一个深度学习流水线，同时对一系列失真图像进行对齐和重建。我们创建了一个包含图像失真（如光照、镜面反射、阴影和遮挡）的数据集，并且为每个图像创建了相应的地面真值单应性作为标签。我们使用这个数据集训练Swin Transformer模型来分析序列图像数据。注意力图使得模型能够检测到相关的图像内容并将其区分出来以与异常值和伪像区分开。我们进一步探索使用神经特征图作为传统关键点检测器的替代方法。经过训练的卷积层的特征图提供了可以用来寻找图像的密集描述符的方法。",
    "tldr": "本文介绍了DIAR方法，利用Swin Transformers对一系列失真图像进行对齐和重建。通过训练模型分析序列图像数据，并利用注意力图检测相关内容并区分异常值和伪像。同时，还探索了使用神经特征图作为传统关键点检测器的替代方法。"
}