{
    "title": "Classification of Dysarthria based on the Levels of Severity. A Systematic Review. (arXiv:2310.07264v1 [cs.LG])",
    "abstract": "Dysarthria is a neurological speech disorder that can significantly impact affected individuals' communication abilities and overall quality of life. The accurate and objective classification of dysarthria and the determination of its severity are crucial for effective therapeutic intervention. While traditional assessments by speech-language pathologists (SLPs) are common, they are often subjective, time-consuming, and can vary between practitioners. Emerging machine learning-based models have shown the potential to provide a more objective dysarthria assessment, enhancing diagnostic accuracy and reliability. This systematic review aims to comprehensively analyze current methodologies for classifying dysarthria based on severity levels. Specifically, this review will focus on determining the most effective set and type of features that can be used for automatic patient classification and evaluating the best AI techniques for this purpose. We will systematically review the literature o",
    "link": "http://arxiv.org/abs/2310.07264",
    "context": "Title: Classification of Dysarthria based on the Levels of Severity. A Systematic Review. (arXiv:2310.07264v1 [cs.LG])\nAbstract: Dysarthria is a neurological speech disorder that can significantly impact affected individuals' communication abilities and overall quality of life. The accurate and objective classification of dysarthria and the determination of its severity are crucial for effective therapeutic intervention. While traditional assessments by speech-language pathologists (SLPs) are common, they are often subjective, time-consuming, and can vary between practitioners. Emerging machine learning-based models have shown the potential to provide a more objective dysarthria assessment, enhancing diagnostic accuracy and reliability. This systematic review aims to comprehensively analyze current methodologies for classifying dysarthria based on severity levels. Specifically, this review will focus on determining the most effective set and type of features that can be used for automatic patient classification and evaluating the best AI techniques for this purpose. We will systematically review the literature o",
    "path": "papers/23/10/2310.07264.json",
    "total_tokens": 832,
    "translated_title": "基于严重程度的发音障碍分类。一项系统性综述。",
    "translated_abstract": "发音障碍是一种神经性语言障碍，严重影响患者的沟通能力和生活质量。准确和客观地对发音障碍进行分类和确定其严重程度对于有效治疗干预至关重要。虽然传统的言语病理学家评估普遍存在，并且往往是主观的、耗时的，并且可能因从业人员而异。新兴的基于机器学习的模型显示出提供更客观的发音障碍评估的潜力，增强了诊断准确性和可靠性。本系统性综述旨在全面分析目前用于基于严重程度分类发音障碍的方法。具体而言，本综述将重点确定可以用于自动患者分类的最有效的特征集合和类型，并评估最佳的人工智能技术。我们将系统地审查现有的文献。",
    "tldr": "本系统性综述分析了基于严重程度对发音障碍进行分类的方法，并评估了最有效的特征集合和类型以及最佳的人工智能技术。",
    "en_tdlr": "This systematic review analyzes methods for classifying dysarthria based on severity levels, evaluating the most effective set and type of features, as well as the best AI techniques."
}