{
    "title": "A Comparative Study of Portfolio Optimization Methods for the Indian Stock Market. (arXiv:2310.14748v1 [q-fin.PM])",
    "abstract": "This chapter presents a comparative study of the three portfolio optimization methods, MVP, HRP, and HERC, on the Indian stock market, particularly focusing on the stocks chosen from 15 sectors listed on the National Stock Exchange of India. The top stocks of each cluster are identified based on their free-float market capitalization from the report of the NSE published on July 1, 2022 (NSE Website). For each sector, three portfolios are designed on stock prices from July 1, 2019, to June 30, 2022, following three portfolio optimization approaches. The portfolios are tested over the period from July 1, 2022, to June 30, 2023. For the evaluation of the performances of the portfolios, three metrics are used. These three metrics are cumulative returns, annual volatilities, and Sharpe ratios. For each sector, the portfolios that yield the highest cumulative return, the lowest volatility, and the maximum Sharpe Ratio over the training and the test periods are identified.",
    "link": "http://arxiv.org/abs/2310.14748",
    "context": "Title: A Comparative Study of Portfolio Optimization Methods for the Indian Stock Market. (arXiv:2310.14748v1 [q-fin.PM])\nAbstract: This chapter presents a comparative study of the three portfolio optimization methods, MVP, HRP, and HERC, on the Indian stock market, particularly focusing on the stocks chosen from 15 sectors listed on the National Stock Exchange of India. The top stocks of each cluster are identified based on their free-float market capitalization from the report of the NSE published on July 1, 2022 (NSE Website). For each sector, three portfolios are designed on stock prices from July 1, 2019, to June 30, 2022, following three portfolio optimization approaches. The portfolios are tested over the period from July 1, 2022, to June 30, 2023. For the evaluation of the performances of the portfolios, three metrics are used. These three metrics are cumulative returns, annual volatilities, and Sharpe ratios. For each sector, the portfolios that yield the highest cumulative return, the lowest volatility, and the maximum Sharpe Ratio over the training and the test periods are identified.",
    "path": "papers/23/10/2310.14748.json",
    "total_tokens": 890,
    "translated_title": "印度股市组合优化方法的比较研究",
    "translated_abstract": "本章节在印度股市上对MVP、HRP和HERC三种组合优化方法进行了比较研究，特别关注来自印度国家股票交易所上15个行业的股票。根据2022年7月1日印度国家股票交易所发布的报告，确定了每个聚类的热门股票，基于其自由流通市值。对于每个行业，根据2019年7月1日至2022年6月30日期间的股票价格，采用三种组合优化方法设计了三个投资组合，并在2022年7月1日至2023年6月30日期间进行了测试。评估投资组合的表现使用了三个指标，包括累计收益、年波动率和夏普比率。对于每个行业，识别出在训练和测试期间累计收益最高、波动率最低和夏普比率最大的投资组合。",
    "tldr": "该论文对印度股市上的三种组合优化方法进行了比较研究，并根据累计收益、波动率和夏普比率等指标，确定出了在不同行业下表现最佳的投资组合。",
    "en_tdlr": "This paper presents a comparative study of three portfolio optimization methods for the Indian stock market and identifies the best-performing portfolios in different sectors based on metrics such as cumulative returns, volatility, and Sharpe ratio."
}