{
    "title": "MUNCH: Modelling Unique 'N Controllable Heads. (arXiv:2310.02753v1 [cs.CV])",
    "abstract": "The automated generation of 3D human heads has been an intriguing and challenging task for computer vision researchers. Prevailing methods synthesize realistic avatars but with limited control over the diversity and quality of rendered outputs and suffer from limited correlation between shape and texture of the character. We propose a method that offers quality, diversity, control, and realism along with explainable network design, all desirable features to game-design artists in the domain. First, our proposed Geometry Generator identifies disentangled latent directions and generate novel and diverse samples. A Render Map Generator then learns to synthesize multiply high-fidelty physically-based render maps including Albedo, Glossiness, Specular, and Normals. For artists preferring fine-grained control over the output, we introduce a novel Color Transformer Model that allows semantic color control over generated maps. We also introduce quantifiable metrics called Uniqueness and Novelt",
    "link": "http://arxiv.org/abs/2310.02753",
    "context": "Title: MUNCH: Modelling Unique 'N Controllable Heads. (arXiv:2310.02753v1 [cs.CV])\nAbstract: The automated generation of 3D human heads has been an intriguing and challenging task for computer vision researchers. Prevailing methods synthesize realistic avatars but with limited control over the diversity and quality of rendered outputs and suffer from limited correlation between shape and texture of the character. We propose a method that offers quality, diversity, control, and realism along with explainable network design, all desirable features to game-design artists in the domain. First, our proposed Geometry Generator identifies disentangled latent directions and generate novel and diverse samples. A Render Map Generator then learns to synthesize multiply high-fidelty physically-based render maps including Albedo, Glossiness, Specular, and Normals. For artists preferring fine-grained control over the output, we introduce a novel Color Transformer Model that allows semantic color control over generated maps. We also introduce quantifiable metrics called Uniqueness and Novelt",
    "path": "papers/23/10/2310.02753.json",
    "total_tokens": 965,
    "translated_title": "MUNCH: 建模独特且可控制的头部",
    "translated_abstract": "对于计算机视觉研究人员来说，自动生成三维人头一直是一个引人入胜且具有挑战性的任务。现有的方法可以合成逼真的角色，但对于生成结果的多样性和质量的控制有限，并且形状和纹理之间的相关性也受到限制。我们提出的方法在质量、多样性、控制和逼真性方面都具备了可行性，并且还提供了可解释的网络设计，对于游戏设计艺术家来说这些都是理想的特点。首先，我们提出的几何生成器可以识别脱耦的潜在方向并生成新颖且多样的样本。然后，渲染图生成器学习合成多个高保真度的基于物理的渲染图，包括反照率、光泽度、镜面反射和法线方向。对于更细粒度的控制输出的艺术家，我们引入了一种新颖的颜色变换模型，允许对生成的图像进行语义颜色控制。我们还引入了一种可量化的指标，称为独特性和新颖性。",
    "tldr": "本论文提出了一种方法，可以自动生成质量高、多样性强、可控制的逼真三维人头，具有可解释的网络设计。方法包括几何生成器、渲染图生成器和颜色变换模型。同时还引入了独特性和新颖性的量化指标。",
    "en_tdlr": "This paper proposes a method for automated generation of high-quality, diverse, and controllable 3D human heads, with an explainable network design. The method includes a geometry generator, a render map generator, and a color transformer model. Quantifiable metrics of uniqueness and novelty are also introduced."
}