{
    "title": "Automated Claim Matching with Large Language Models: Empowering Fact-Checkers in the Fight Against Misinformation. (arXiv:2310.09223v1 [cs.CL])",
    "abstract": "In today's digital era, the rapid spread of misinformation poses threats to public well-being and societal trust. As online misinformation proliferates, manual verification by fact checkers becomes increasingly challenging. We introduce FACT-GPT (Fact-checking Augmentation with Claim matching Task-oriented Generative Pre-trained Transformer), a framework designed to automate the claim matching phase of fact-checking using Large Language Models (LLMs). This framework identifies new social media content that either supports or contradicts claims previously debunked by fact-checkers. Our approach employs GPT-4 to generate a labeled dataset consisting of simulated social media posts. This data set serves as a training ground for fine-tuning more specialized LLMs. We evaluated FACT-GPT on an extensive dataset of social media content related to public health. The results indicate that our fine-tuned LLMs rival the performance of larger pre-trained LLMs in claim matching tasks, aligning close",
    "link": "http://arxiv.org/abs/2310.09223",
    "context": "Title: Automated Claim Matching with Large Language Models: Empowering Fact-Checkers in the Fight Against Misinformation. (arXiv:2310.09223v1 [cs.CL])\nAbstract: In today's digital era, the rapid spread of misinformation poses threats to public well-being and societal trust. As online misinformation proliferates, manual verification by fact checkers becomes increasingly challenging. We introduce FACT-GPT (Fact-checking Augmentation with Claim matching Task-oriented Generative Pre-trained Transformer), a framework designed to automate the claim matching phase of fact-checking using Large Language Models (LLMs). This framework identifies new social media content that either supports or contradicts claims previously debunked by fact-checkers. Our approach employs GPT-4 to generate a labeled dataset consisting of simulated social media posts. This data set serves as a training ground for fine-tuning more specialized LLMs. We evaluated FACT-GPT on an extensive dataset of social media content related to public health. The results indicate that our fine-tuned LLMs rival the performance of larger pre-trained LLMs in claim matching tasks, aligning close",
    "path": "papers/23/10/2310.09223.json",
    "total_tokens": 1011,
    "translated_title": "基于大型语言模型的自动索引匹配：增强事实核查员在对抗虚假信息的战斗中的能力",
    "translated_abstract": "在当今数字化时代，虚假信息的迅速传播对公众福祉和社会信任构成威胁。随着在线虚假信息的蔓延，事实核查员的手动验证变得越来越具有挑战性。我们介绍了FACT-GPT（基于声称匹配任务的事实核查增强与大型语言模型），这是一个旨在使用大型语言模型自动化事实核查的框架。该框架识别先前被事实核查员证实为虚假的声称的新的社交媒体内容，其要么支持要么相矛盾。我们的方法使用GPT-4生成一个模拟社交媒体帖子的标记数据集，该数据集用于微调更专门的LLM。我们在与公共卫生相关的大量社交媒体内容的数据集上评估了FACT-GPT。结果表明，我们的微调LLM在声称匹配任务中与更大的预训练LLM的性能相媲美，达到了接近的效果。",
    "tldr": "FACT-GPT是一个基于大型语言模型的框架，旨在自动化事实核查的声称匹配阶段。它通过使用GPT-4生成标记数据集，并使用微调的LLM，在识别与事实核查员先前证实为虚假的声称相匹配的新的社交媒体内容。实验结果表明，我们的方法与更大的预训练LLMs的性能相媲美。"
}