{
    "title": "Detecting and Learning Out-of-Distribution Data in the Open world: Algorithm and Theory. (arXiv:2310.06221v1 [cs.LG])",
    "abstract": "This thesis makes considerable contributions to the realm of machine learning, specifically in the context of open-world scenarios where systems face previously unseen data and contexts. Traditional machine learning models are usually trained and tested within a fixed and known set of classes, a condition known as the closed-world setting. While this assumption works in controlled environments, it falls short in real-world applications where new classes or categories of data can emerge dynamically and unexpectedly. To address this, our research investigates two intertwined steps essential for open-world machine learning: Out-of-distribution (OOD) Detection and Open-world Representation Learning (ORL). OOD detection focuses on identifying instances from unknown classes that fall outside the model's training distribution. This process reduces the risk of making overly confident, erroneous predictions about unfamiliar inputs. Moving beyond OOD detection, ORL extends the capabilities of th",
    "link": "http://arxiv.org/abs/2310.06221",
    "context": "Title: Detecting and Learning Out-of-Distribution Data in the Open world: Algorithm and Theory. (arXiv:2310.06221v1 [cs.LG])\nAbstract: This thesis makes considerable contributions to the realm of machine learning, specifically in the context of open-world scenarios where systems face previously unseen data and contexts. Traditional machine learning models are usually trained and tested within a fixed and known set of classes, a condition known as the closed-world setting. While this assumption works in controlled environments, it falls short in real-world applications where new classes or categories of data can emerge dynamically and unexpectedly. To address this, our research investigates two intertwined steps essential for open-world machine learning: Out-of-distribution (OOD) Detection and Open-world Representation Learning (ORL). OOD detection focuses on identifying instances from unknown classes that fall outside the model's training distribution. This process reduces the risk of making overly confident, erroneous predictions about unfamiliar inputs. Moving beyond OOD detection, ORL extends the capabilities of th",
    "path": "papers/23/10/2310.06221.json",
    "total_tokens": 930,
    "translated_title": "在开放环境中检测和学习未知分布数据：算法和理论",
    "translated_abstract": "这篇论文在机器学习领域，特别是在面对以前未见过的数据和情境的开放世界场景中，做出了相当大的贡献。传统的机器学习模型通常在固定和已知的类别集合中进行训练和测试，这种条件被称为封闭世界设置。尽管这种假设在受控环境中有效，但在现实应用中却存在局限性，因为新的类别或数据类型可能动态而意外地出现。为了解决这个问题，我们的研究调查了开放世界机器学习的两个相互关联的关键步骤：未知分布（OOD）的检测和开放世界表示学习（ORL）。OOD检测专注于识别模型训练分布之外的未知类别的实例。这个过程降低了对陌生输入进行过度自信和错误预测的风险。在超越OOD检测的同时，ORL扩展了机器学习模型的能力。",
    "tldr": "该论文在开放世界机器学习中做出了重要贡献，主要包括对未知分布数据的检测和开放世界表示学习。OOD检测专注于识别模型训练分布之外的未知类别的实例，而ORL则扩展了机器学习模型的能力。"
}