{
    "title": "Transfer learning for day-ahead load forecasting: a case study on European national electricity demand time series. (arXiv:2310.15555v1 [cs.LG])",
    "abstract": "Short-term load forecasting (STLF) is crucial for the daily operation of power grids. However, the non-linearity, non-stationarity, and randomness characterizing electricity demand time series renders STLF a challenging task. Various forecasting approaches have been proposed for improving STLF, including neural network (NN) models which are trained using data from multiple electricity demand series that may not necessary include the target series. In the present study, we investigate the performance of this special case of STLF, called transfer learning (TL), by considering a set of 27 time series that represent the national day-ahead electricity demand of indicative European countries. We employ a popular and easy-to-implement NN model and perform a clustering analysis to identify similar patterns among the series and assist TL. In this context, two different TL approaches, with and without the clustering step, are compiled and compared against each other as well as a typical NN train",
    "link": "http://arxiv.org/abs/2310.15555",
    "context": "Title: Transfer learning for day-ahead load forecasting: a case study on European national electricity demand time series. (arXiv:2310.15555v1 [cs.LG])\nAbstract: Short-term load forecasting (STLF) is crucial for the daily operation of power grids. However, the non-linearity, non-stationarity, and randomness characterizing electricity demand time series renders STLF a challenging task. Various forecasting approaches have been proposed for improving STLF, including neural network (NN) models which are trained using data from multiple electricity demand series that may not necessary include the target series. In the present study, we investigate the performance of this special case of STLF, called transfer learning (TL), by considering a set of 27 time series that represent the national day-ahead electricity demand of indicative European countries. We employ a popular and easy-to-implement NN model and perform a clustering analysis to identify similar patterns among the series and assist TL. In this context, two different TL approaches, with and without the clustering step, are compiled and compared against each other as well as a typical NN train",
    "path": "papers/23/10/2310.15555.json",
    "total_tokens": 933,
    "translated_title": "基于转移学习的前一天负荷预测：以欧洲国家电力需求时间序列为例的案例研究",
    "translated_abstract": "短期负荷预测(STLF)对电力网络的日常运营至关重要。然而，电力需求时间序列的非线性、非平稳性和随机性使得STLF成为一项具有挑战性的任务。为了改进STLF，提出了各种预测方法，包括使用可能不包括目标序列的多个电力需求序列训练的神经网络(NN)模型。在本研究中，我们通过考虑一组表示典型欧洲国家未来一天电力需求的27个时间序列，来研究这种特殊情况下的STLF，即转移学习(TL)。我们采用一个流行且易于实施的NN模型，并进行聚类分析，以识别系列之间的相似模式并辅助TL。在这种背景下，编制了两种不同的TL方法，一种是带有聚类步骤的，一种是没有的，并将它们与典型的NN训练进行比较。",
    "tldr": "本研究以欧洲国家的电力需求时间序列为例，通过转移学习的方法来进行短期负荷预测。研究采用神经网络模型，并使用聚类分析来识别相似的模式，以提高预测性能。",
    "en_tdlr": "This study investigates the use of transfer learning for short-term load forecasting using European national electricity demand time series. The study utilizes a neural network model and employs clustering analysis to identify similar patterns among the series, improving the forecasting performance."
}