{
    "title": "Label-Aware Automatic Verbalizer for Few-Shot Text Classification. (arXiv:2310.12778v1 [cs.CL])",
    "abstract": "Prompt-based learning has shown its effectiveness in few-shot text classification. One important factor in its success is a verbalizer, which translates output from a language model into a predicted class. Notably, the simplest and widely acknowledged verbalizer employs manual labels to represent the classes. However, manual selection does not guarantee the optimality of the selected words when conditioned on the chosen language model. Therefore, we propose Label-Aware Automatic Verbalizer (LAAV), effectively augmenting the manual labels to achieve better few-shot classification results. Specifically, we use the manual labels along with the conjunction \"and\" to induce the model to generate more effective words for the verbalizer. The experimental results on five datasets across five languages demonstrate that LAAV significantly outperforms existing verbalizers. Furthermore, our analysis reveals that LAAV suggests more relevant words compared to similar approaches, especially in mid-to-",
    "link": "http://arxiv.org/abs/2310.12778",
    "context": "Title: Label-Aware Automatic Verbalizer for Few-Shot Text Classification. (arXiv:2310.12778v1 [cs.CL])\nAbstract: Prompt-based learning has shown its effectiveness in few-shot text classification. One important factor in its success is a verbalizer, which translates output from a language model into a predicted class. Notably, the simplest and widely acknowledged verbalizer employs manual labels to represent the classes. However, manual selection does not guarantee the optimality of the selected words when conditioned on the chosen language model. Therefore, we propose Label-Aware Automatic Verbalizer (LAAV), effectively augmenting the manual labels to achieve better few-shot classification results. Specifically, we use the manual labels along with the conjunction \"and\" to induce the model to generate more effective words for the verbalizer. The experimental results on five datasets across five languages demonstrate that LAAV significantly outperforms existing verbalizers. Furthermore, our analysis reveals that LAAV suggests more relevant words compared to similar approaches, especially in mid-to-",
    "path": "papers/23/10/2310.12778.json",
    "total_tokens": 850,
    "translated_title": "使用标签感知的自动语言表达方式提供少样本文本分类",
    "translated_abstract": "基于提示的学习在少样本文本分类中显示出有效性。其成功的一个重要因素是一种语言表达方式，将语言模型的输出转化为预测类别。值得注意的是，最简单和广泛认可的语言表达方式使用手动标签来表示类别。然而，手动选择并不能保证在选择的语言模型的条件下所选择的单词的最优性。因此，我们提出了一种标签感知的自动语言表达方式（LAAV），通过有效增加手动标签来实现更好的少样本分类结果。具体而言，我们使用手动标签以及连接词“和”来诱导模型生成更有效的语言表达方式中的单词。在五个数据集跨五种语言上的实验结果表明，LAAV明显优于现有的语言表达方式。此外，我们的分析还发现，与类似方法相比，LAAV提供更相关的单词，特别是在中到",
    "tldr": "这篇论文提出了一种标签感知的自动语言表达方式（LAAV），通过增加手动标签和连接词“和”来提升语言模型的生成，从而在少样本分类任务中取得更好的结果。"
}