{
    "title": "Unveiling Early Warning Signals of Systemic Risks in Banks: A Recurrence Network-Based Approach. (arXiv:2310.10283v1 [q-fin.RM])",
    "abstract": "Bank crisis is challenging to define but can be manifested through bank contagion. This study presents a comprehensive framework grounded in nonlinear time series analysis to identify potential early warning signals (EWS) for impending phase transitions in bank systems, with the goal of anticipating severe bank crisis. In contrast to traditional analyses of exposure networks using low-frequency data, we argue that studying the dynamic relationships among bank stocks using high-frequency data offers a more insightful perspective on changes in the banking system. We construct multiple recurrence networks (MRNs) based on multidimensional returns of listed banks' stocks in China, aiming to monitor the nonlinear dynamics of the system through the corresponding indicators and topological structures. Empirical findings indicate that key indicators of MRNs, specifically the average mutual information, provide valuable insights into periods of extreme volatility of bank system. This paper contr",
    "link": "http://arxiv.org/abs/2310.10283",
    "context": "Title: Unveiling Early Warning Signals of Systemic Risks in Banks: A Recurrence Network-Based Approach. (arXiv:2310.10283v1 [q-fin.RM])\nAbstract: Bank crisis is challenging to define but can be manifested through bank contagion. This study presents a comprehensive framework grounded in nonlinear time series analysis to identify potential early warning signals (EWS) for impending phase transitions in bank systems, with the goal of anticipating severe bank crisis. In contrast to traditional analyses of exposure networks using low-frequency data, we argue that studying the dynamic relationships among bank stocks using high-frequency data offers a more insightful perspective on changes in the banking system. We construct multiple recurrence networks (MRNs) based on multidimensional returns of listed banks' stocks in China, aiming to monitor the nonlinear dynamics of the system through the corresponding indicators and topological structures. Empirical findings indicate that key indicators of MRNs, specifically the average mutual information, provide valuable insights into periods of extreme volatility of bank system. This paper contr",
    "path": "papers/23/10/2310.10283.json",
    "total_tokens": 834,
    "translated_title": "揭示银行系统风险的预警信号：一种基于复发网络的方法",
    "translated_abstract": "银行危机极难定义，但可以通过银行传染来体现。本研究提出了一个基于非线性时间序列分析的综合框架，以识别银行系统中潜在的预警信号，预测严重的银行危机。与使用低频数据对暴露网络进行传统分析不同，我们认为使用高频数据研究银行股票之间的动态关系会提供更具洞察力的对银行系统变化的视角。我们构建了多重复发网络 (MRNs)，基于中国上市银行股票的多维度收益，旨在通过相应的指标和拓扑结构监测系统的非线性动态。实证研究发现，MRNs的关键指标，特别是平均互信息，提供了对银行系统极端波动期的有价值的洞见。",
    "tldr": "本文提出了一种基于复发网络的方法，通过分析高频数据构建多重复发网络，识别银行系统中的潜在预警信号，为预测严重的银行危机提供有价值的洞见。"
}