{
    "title": "Regret Analysis of Distributed Online Control for LTI Systems with Adversarial Disturbances. (arXiv:2310.03206v1 [math.OC])",
    "abstract": "This paper addresses the distributed online control problem over a network of linear time-invariant (LTI) systems (with possibly unknown dynamics) in the presence of adversarial perturbations. There exists a global network cost that is characterized by a time-varying convex function, which evolves in an adversarial manner and is sequentially and partially observed by local agents. The goal of each agent is to generate a control sequence that can compete with the best centralized control policy in hindsight, which has access to the global cost. This problem is formulated as a regret minimization. For the case of known dynamics, we propose a fully distributed disturbance feedback controller that guarantees a regret bound of $O(\\sqrt{T}\\log T)$, where $T$ is the time horizon. For the unknown dynamics case, we design a distributed explore-then-commit approach, where in the exploration phase all agents jointly learn the system dynamics, and in the learning phase our proposed control algorit",
    "link": "http://arxiv.org/abs/2310.03206",
    "context": "Title: Regret Analysis of Distributed Online Control for LTI Systems with Adversarial Disturbances. (arXiv:2310.03206v1 [math.OC])\nAbstract: This paper addresses the distributed online control problem over a network of linear time-invariant (LTI) systems (with possibly unknown dynamics) in the presence of adversarial perturbations. There exists a global network cost that is characterized by a time-varying convex function, which evolves in an adversarial manner and is sequentially and partially observed by local agents. The goal of each agent is to generate a control sequence that can compete with the best centralized control policy in hindsight, which has access to the global cost. This problem is formulated as a regret minimization. For the case of known dynamics, we propose a fully distributed disturbance feedback controller that guarantees a regret bound of $O(\\sqrt{T}\\log T)$, where $T$ is the time horizon. For the unknown dynamics case, we design a distributed explore-then-commit approach, where in the exploration phase all agents jointly learn the system dynamics, and in the learning phase our proposed control algorit",
    "path": "papers/23/10/2310.03206.json",
    "total_tokens": 1043,
    "translated_title": "LTI系统中对抗性扰动的分布式在线控制的遗憾分析",
    "translated_abstract": "本文研究了在线分布式控制问题，其中涉及到一个具有对抗性扰动的线性时不变（LTI）系统网络（其动态可能是未知的）。存在一个全局网络成本，由一个时变的凸函数来描述，其以对抗的方式演化，并且局部代理只能顺序和部分观测到它。每个代理的目标是生成一组控制序列，以便能够与事后具有全局成本访问权限的最佳集中式控制策略竞争。该问题被建模为遗憾最小化。对于已知动态的情况，我们提出了一个完全分布式的扰动反馈控制器，保证遗憾界为$O(\\sqrt{T}\\log T)$，其中$T$为时间窗口。对于未知动态的情况，我们设计了一个分布式的探索-承诺方法，在探索阶段所有代理共同学习系统动态，在学习阶段我们提出的控制算法进行控制。",
    "tldr": "本文研究了在线分布式控制问题，其中涉及到一个具有对抗性扰动的线性时不变（LTI）系统网络。对于已知动态的情况，提出了一个完全分布式的扰动反馈控制器，保证遗憾界为$O(\\sqrt{T}\\log T)$。对于未知动态的情况，设计了一个分布式的探索-承诺方法，使所有代理在探索阶段共同学习系统动态，并在学习阶段使用提出的控制算法进行控制。"
}