{
    "title": "Sampling Multimodal Distributions with the Vanilla Score: Benefits of Data-Based Initialization. (arXiv:2310.01762v1 [cs.LG])",
    "abstract": "There is a long history, as well as a recent explosion of interest, in statistical and generative modeling approaches based on score functions -derivatives of the log-likelihood of a distribution. In seminal works, Hyv\\\"arinen proposed vanilla score matching as a way to learn distributions from data by computing an estimate of the score function of the underlying ground truth, and established connections between this method and established techniques like Contrastive Divergence and Pseudolikelihood estimation. It is by now well-known that vanilla score matching has significant difficulties learning multimodal distributions. Although there are various ways to overcome this difficulty, the following question has remained unanswered -- is there a natural way to sample multimodal distributions using just the vanilla score? Inspired by a long line of related experimental works, we prove that the Langevin diffusion with early stopping, initialized at the empirical distribution, and run on ",
    "link": "http://arxiv.org/abs/2310.01762",
    "context": "Title: Sampling Multimodal Distributions with the Vanilla Score: Benefits of Data-Based Initialization. (arXiv:2310.01762v1 [cs.LG])\nAbstract: There is a long history, as well as a recent explosion of interest, in statistical and generative modeling approaches based on score functions -derivatives of the log-likelihood of a distribution. In seminal works, Hyv\\\"arinen proposed vanilla score matching as a way to learn distributions from data by computing an estimate of the score function of the underlying ground truth, and established connections between this method and established techniques like Contrastive Divergence and Pseudolikelihood estimation. It is by now well-known that vanilla score matching has significant difficulties learning multimodal distributions. Although there are various ways to overcome this difficulty, the following question has remained unanswered -- is there a natural way to sample multimodal distributions using just the vanilla score? Inspired by a long line of related experimental works, we prove that the Langevin diffusion with early stopping, initialized at the empirical distribution, and run on ",
    "path": "papers/23/10/2310.01762.json",
    "total_tokens": 819,
    "translated_title": "使用Vanilla Score对多模态分布进行采样：基于数据初始化的好处",
    "translated_abstract": "在统计和生成模型方法中，基于得分函数（分布的对数似然的导数）的方法有着悠久的历史和最近的兴趣爆发。在开创性的工作中，Hyvärinen提出了Vanilla Score Matching作为一种通过计算底层真实数据的得分函数估计来学习分布的方法，并建立了该方法与对比分歧和伪似然估计等已有技术之间的联系。现在已经众所周知，Vanilla Score Matching在学习多模态分布时存在显著困难。虽然有各种方式可以克服这个困难，但以下问题仍然没有得到答案 - 是否有一种自然的方法可以仅使用Vanilla Score对多模态分布进行采样？受一系列相关实验性工作的启发，我们证明了使用早期停止的Langevin扩散，以经验分布为初始化，并在...",
    "tldr": "这项研究证明了通过在经验分布上初始化并运行使用早期停止的Langevin扩散的Vanilla Score方法，可以对多模态分布进行采样。",
    "en_tdlr": "This study demonstrates that using early stopping Langevin diffusion initialized on empirical distribution with Vanilla Score method allows for sampling of multimodal distributions."
}