{
    "title": "Structural Adversarial Objectives for Self-Supervised Representation Learning. (arXiv:2310.00357v2 [cs.CV] UPDATED)",
    "abstract": "Within the framework of generative adversarial networks (GANs), we propose objectives that task the discriminator for self-supervised representation learning via additional structural modeling responsibilities. In combination with an efficient smoothness regularizer imposed on the network, these objectives guide the discriminator to learn to extract informative representations, while maintaining a generator capable of sampling from the domain. Specifically, our objectives encourage the discriminator to structure features at two levels of granularity: aligning distribution characteristics, such as mean and variance, at coarse scales, and grouping features into local clusters at finer scales. Operating as a feature learner within the GAN framework frees our self-supervised system from the reliance on hand-crafted data augmentation schemes that are prevalent across contrastive representation learning methods. Across CIFAR-10/100 and an ImageNet subset, experiments demonstrate that equippi",
    "link": "http://arxiv.org/abs/2310.00357",
    "context": "Title: Structural Adversarial Objectives for Self-Supervised Representation Learning. (arXiv:2310.00357v2 [cs.CV] UPDATED)\nAbstract: Within the framework of generative adversarial networks (GANs), we propose objectives that task the discriminator for self-supervised representation learning via additional structural modeling responsibilities. In combination with an efficient smoothness regularizer imposed on the network, these objectives guide the discriminator to learn to extract informative representations, while maintaining a generator capable of sampling from the domain. Specifically, our objectives encourage the discriminator to structure features at two levels of granularity: aligning distribution characteristics, such as mean and variance, at coarse scales, and grouping features into local clusters at finer scales. Operating as a feature learner within the GAN framework frees our self-supervised system from the reliance on hand-crafted data augmentation schemes that are prevalent across contrastive representation learning methods. Across CIFAR-10/100 and an ImageNet subset, experiments demonstrate that equippi",
    "path": "papers/23/10/2310.00357.json",
    "total_tokens": 881,
    "translated_title": "结构对抗目标用于自监督表示学习",
    "translated_abstract": "在生成对抗网络（GAN）的框架下，我们提出了一种通过额外的结构建模责任来使判别器在自监督表示学习中学习的目标。结合对网络施加的有效平滑正则化器，这些目标引导判别器学习提取信息丰富的表示，同时保持生成器能够从领域中进行采样。具体而言，我们的目标鼓励判别器在两个粒度级别上对特征进行结构化处理：在粗粒度上对齐分布特性（如均值和方差），在细粒度上对特征进行局部聚类。作为GAN框架中的特征学习器，我们的自监督系统不依赖于手工数据增强方案，这是对比表示学习方法中常见的。在CIFAR-10/100和ImageNet子集上的实验证明，我们的方法取得了良好的效果。",
    "tldr": "通过结构对抗目标和平滑正则化器，该论文提出了一种自监督表示学习方法，可以在生成对抗网络中学习提取信息丰富的特征表示，而无需依赖手工数据增强方案。实验证明该方法在图像分类任务上取得了良好的效果。",
    "en_tdlr": "This paper proposes a self-supervised representation learning method using structural adversarial objectives and smoothness regularizer within the framework of generative adversarial networks (GANs), which can learn to extract informative features without relying on hand-crafted data augmentation schemes. Experimental results demonstrate its effectiveness in image classification tasks."
}