{
    "title": "Reducing the False Positive Rate Using Bayesian Inference in Autonomous Driving Perception. (arXiv:2310.05951v1 [cs.CV])",
    "abstract": "Object recognition is a crucial step in perception systems for autonomous and intelligent vehicles, as evidenced by the numerous research works in the topic. In this paper, object recognition is explored by using multisensory and multimodality approaches, with the intention of reducing the false positive rate (FPR). The reduction of the FPR becomes increasingly important in perception systems since the misclassification of an object can potentially cause accidents. In particular, this work presents a strategy through Bayesian inference to reduce the FPR considering the likelihood function as a cumulative distribution function from Gaussian kernel density estimations, and the prior probabilities as cumulative functions of normalized histograms. The validation of the proposed methodology is performed on the KITTI dataset using deep networks (DenseNet, NasNet, and EfficientNet), and recent 3D point cloud networks (PointNet, and PintNet++), by considering three object-categories (cars, cyc",
    "link": "http://arxiv.org/abs/2310.05951",
    "context": "Title: Reducing the False Positive Rate Using Bayesian Inference in Autonomous Driving Perception. (arXiv:2310.05951v1 [cs.CV])\nAbstract: Object recognition is a crucial step in perception systems for autonomous and intelligent vehicles, as evidenced by the numerous research works in the topic. In this paper, object recognition is explored by using multisensory and multimodality approaches, with the intention of reducing the false positive rate (FPR). The reduction of the FPR becomes increasingly important in perception systems since the misclassification of an object can potentially cause accidents. In particular, this work presents a strategy through Bayesian inference to reduce the FPR considering the likelihood function as a cumulative distribution function from Gaussian kernel density estimations, and the prior probabilities as cumulative functions of normalized histograms. The validation of the proposed methodology is performed on the KITTI dataset using deep networks (DenseNet, NasNet, and EfficientNet), and recent 3D point cloud networks (PointNet, and PintNet++), by considering three object-categories (cars, cyc",
    "path": "papers/23/10/2310.05951.json",
    "total_tokens": 926,
    "translated_title": "使用贝叶斯推断在自动驾驶感知中降低误报率",
    "translated_abstract": "目标识别是自动和智能车辆感知系统中关键的一步，这已经得到了大量的研究工作的证明。本文通过使用多感知和多模态方法来探索目标识别，旨在降低误报率（FPR）。由于误报对象的错误分类可能导致事故，降低误报率在感知系统中变得越来越重要。具体来说，本文提出了一种使用贝叶斯推断的策略来降低误报率，其中将似然函数视为高斯核密度估计的累积分布函数，将先验概率视为归一化直方图的累积函数。所提出的方法在KITTI数据集上使用深度网络（DenseNet、NasNet和EfficientNet）和最近的3D点云网络（PointNet和PointNet++）进行验证，考虑了三个目标类别（汽车、自行车、行人）。",
    "tldr": "本研究提出了一种使用贝叶斯推断的方法来降低自动驾驶感知中的误报率。通过使用多感知和多模态方法，以及考虑目标的似然函数和先验概率，该方法在减少误报率方面取得了显著的进展。在KITTI数据集上进行的实验证明了该方法的有效性。"
}