{
    "title": "A predict-and-optimize approach to profit-driven churn prevention. (arXiv:2310.07047v1 [cs.LG])",
    "abstract": "In this paper, we introduce a novel predict-and-optimize method for profit-driven churn prevention. We frame the task of targeting customers for a retention campaign as a regret minimization problem. The main objective is to leverage individual customer lifetime values (CLVs) to ensure that only the most valuable customers are targeted. In contrast, many profit-driven strategies focus on churn probabilities while considering average CLVs. This often results in significant information loss due to data aggregation. Our proposed model aligns with the guidelines of Predict-and-Optimize (PnO) frameworks and can be efficiently solved using stochastic gradient descent methods. Results from 12 churn prediction datasets underscore the effectiveness of our approach, which achieves the best average performance compared to other well-established strategies in terms of average profit.",
    "link": "http://arxiv.org/abs/2310.07047",
    "context": "Title: A predict-and-optimize approach to profit-driven churn prevention. (arXiv:2310.07047v1 [cs.LG])\nAbstract: In this paper, we introduce a novel predict-and-optimize method for profit-driven churn prevention. We frame the task of targeting customers for a retention campaign as a regret minimization problem. The main objective is to leverage individual customer lifetime values (CLVs) to ensure that only the most valuable customers are targeted. In contrast, many profit-driven strategies focus on churn probabilities while considering average CLVs. This often results in significant information loss due to data aggregation. Our proposed model aligns with the guidelines of Predict-and-Optimize (PnO) frameworks and can be efficiently solved using stochastic gradient descent methods. Results from 12 churn prediction datasets underscore the effectiveness of our approach, which achieves the best average performance compared to other well-established strategies in terms of average profit.",
    "path": "papers/23/10/2310.07047.json",
    "total_tokens": 864,
    "translated_title": "利润驱动流失防止的预测和优化方法",
    "translated_abstract": "本文介绍一种新颖的利润驱动流失防止的预测和优化方法。我们将定位顾客用于留存活动的任务构建为一个后悔最小化问题。主要目标是利用个体顾客生命周期价值（CLV）确保只有最有价值的顾客被定位。与之相反，许多利润驱动策略关注流失概率同时考虑平均CLV，这往往导致数据聚合带来的信息损失。我们提出的模型符合预测和优化（PnO）框架的指导方针，并可以使用随机梯度下降方法高效解决。来自12个流失预测数据集的结果突出了我们方法的有效性，在平均利润方面实现了最佳的绩效。",
    "tldr": "本文提出了一种利润驱动流失防止的预测和优化方法。该方法利用个体顾客生命周期价值（CLV）来定位最有价值的顾客，并采用预测和优化框架进行解决。研究结果表明，该方法在12个流失预测数据集上取得了最佳的平均利润绩效。"
}