{
    "title": "Latent class analysis with weighted responses. (arXiv:2310.10984v1 [cs.SI])",
    "abstract": "The latent class model has been proposed as a powerful tool for cluster analysis of categorical data in various fields such as social, psychological, behavioral, and biological sciences. However, one important limitation of the latent class model is that it is only suitable for data with binary responses, making it fail to model real-world data with continuous or negative responses. In many applications, ignoring the weights throws out a lot of potentially valuable information contained in the weights. To address this limitation, we propose a novel generative model, the weighted latent class model (WLCM). Our model allows data's response matrix to be generated from an arbitrary distribution with a latent class structure. In comparison to the latent class model, our WLCM is more realistic and more general. To our knowledge, our WLCM is the first model for latent class analysis with weighted responses. We investigate the identifiability of the model and propose an efficient algorithm for",
    "link": "http://arxiv.org/abs/2310.10984",
    "context": "Title: Latent class analysis with weighted responses. (arXiv:2310.10984v1 [cs.SI])\nAbstract: The latent class model has been proposed as a powerful tool for cluster analysis of categorical data in various fields such as social, psychological, behavioral, and biological sciences. However, one important limitation of the latent class model is that it is only suitable for data with binary responses, making it fail to model real-world data with continuous or negative responses. In many applications, ignoring the weights throws out a lot of potentially valuable information contained in the weights. To address this limitation, we propose a novel generative model, the weighted latent class model (WLCM). Our model allows data's response matrix to be generated from an arbitrary distribution with a latent class structure. In comparison to the latent class model, our WLCM is more realistic and more general. To our knowledge, our WLCM is the first model for latent class analysis with weighted responses. We investigate the identifiability of the model and propose an efficient algorithm for",
    "path": "papers/23/10/2310.10984.json",
    "total_tokens": 865,
    "translated_title": "具有加权响应的潜在类别分析",
    "translated_abstract": "潜在类别模型被提议作为对社会、心理、行为和生物科学等各个领域中的分类数据进行聚类分析的强大工具。然而，潜在类别模型的一个重要限制是它只适用于具有二进制响应的数据，使其无法对具有连续或负响应的真实世界数据进行建模。在许多应用中，忽视权重会丢失掉在权重中包含的许多潜在有价值信息。为了解决这个限制，我们提出了一种新的生成模型，即加权潜在类别模型（WLCM）。我们的模型允许通过潜在类别结构从任意分布生成数据的响应矩阵。与潜在类别模型相比，我们的WLCM更加真实和通用。据我们所知，我们的WLCM是第一个用于具有加权响应的潜在类别分析的模型。我们研究了该模型的可辨识性，并提出了一种高效的算法。",
    "tldr": "提出了一种新的生成模型，即加权潜在类别模型（WLCM），可以用于对具有连续或负响应的真实世界数据进行潜在类别分析。",
    "en_tdlr": "A novel generative model, the weighted latent class model (WLCM), is proposed for latent class analysis of real-world data with continuous or negative responses."
}