{
    "title": "MProto: Multi-Prototype Network with Denoised Optimal Transport for Distantly Supervised Named Entity Recognition. (arXiv:2310.08298v1 [cs.CL])",
    "abstract": "Distantly supervised named entity recognition (DS-NER) aims to locate entity mentions and classify their types with only knowledge bases or gazetteers and unlabeled corpus. However, distant annotations are noisy and degrade the performance of NER models. In this paper, we propose a noise-robust prototype network named MProto for the DS-NER task. Different from previous prototype-based NER methods, MProto represents each entity type with multiple prototypes to characterize the intra-class variance among entity representations. To optimize the classifier, each token should be assigned an appropriate ground-truth prototype and we consider such token-prototype assignment as an optimal transport (OT) problem. Furthermore, to mitigate the noise from incomplete labeling, we propose a novel denoised optimal transport (DOT) algorithm. Specifically, we utilize the assignment result between Other class tokens and all prototypes to distinguish unlabeled entity tokens from true negatives. Experimen",
    "link": "http://arxiv.org/abs/2310.08298",
    "context": "Title: MProto: Multi-Prototype Network with Denoised Optimal Transport for Distantly Supervised Named Entity Recognition. (arXiv:2310.08298v1 [cs.CL])\nAbstract: Distantly supervised named entity recognition (DS-NER) aims to locate entity mentions and classify their types with only knowledge bases or gazetteers and unlabeled corpus. However, distant annotations are noisy and degrade the performance of NER models. In this paper, we propose a noise-robust prototype network named MProto for the DS-NER task. Different from previous prototype-based NER methods, MProto represents each entity type with multiple prototypes to characterize the intra-class variance among entity representations. To optimize the classifier, each token should be assigned an appropriate ground-truth prototype and we consider such token-prototype assignment as an optimal transport (OT) problem. Furthermore, to mitigate the noise from incomplete labeling, we propose a novel denoised optimal transport (DOT) algorithm. Specifically, we utilize the assignment result between Other class tokens and all prototypes to distinguish unlabeled entity tokens from true negatives. Experimen",
    "path": "papers/23/10/2310.08298.json",
    "total_tokens": 1036,
    "translated_title": "MProto：带去噪最优传输的多原型网络在远程监督命名实体识别中的应用",
    "translated_abstract": "远程监督命名实体识别（DS-NER）旨在通过知识库或词表以及无标签的语料库来定位实体提及并对其类型进行分类。然而，远程标注存在噪声，降低了NER模型的性能。在本文中，我们提出了一种针对DS-NER任务的鲁棒性原型网络MProto。与以往基于原型的NER方法不同，MProto用多个原型来表示每个实体类型，以表征实体表示中的类内变化。为了优化分类器，每个标记应分配一个合适的真实原型，我们将这样的标记-原型分配视为最优传输（OT）问题。此外，为了减轻不完全标记的噪声，我们提出了一种新颖的去噪最优传输（DOT）算法。具体而言，我们利用Other类标记的分配结果与所有原型之间的对应关系来区分未标记实体标记与真负例。实验证明，MProto在DS-NER任务上取得了优秀的性能，相对于现有方法具有更好的鲁棒性和准确性。",
    "tldr": "本文提出了一种针对远程监督命名实体识别任务的多原型网络MProto。与以往方法不同的是，MProto使用多个原型来表示每个实体类型，以捕捉实体表示中的类内变化。为了减轻噪声，文中还提出了一种新的去噪最优传输算法。实验证明，MProto在远程监督命名实体识别中取得了优秀的性能。",
    "en_tdlr": "This paper proposes a multi-prototype network named MProto for the task of distantly supervised named entity recognition (DS-NER). Different from previous methods, MProto uses multiple prototypes to characterize the intra-class variance among entity representations. A novel denoised optimal transport algorithm is also proposed to mitigate the noise. Experimental results show that MProto achieves excellent performance in DS-NER."
}