{
    "title": "Transformers for Green Semantic Communication: Less Energy, More Semantics",
    "abstract": "arXiv:2310.07592v2 Announce Type: replace  Abstract: Semantic communication aims to transmit meaningful and effective information, rather than focusing on individual symbols or bits. This results in benefits like reduced latency, bandwidth usage, and higher throughput compared with traditional communication. However, semantic communication poses significant challenges due to the need for universal metrics to benchmark the joint effects of semantic information loss and practical energy consumption. This research presents a novel multi-objective loss function named \"Energy-Optimized Semantic Loss\" (EOSL), addressing the challenge of balancing semantic information loss and energy consumption. Through comprehensive experiments on transformer models, including CPU and GPU energy usage, it is demonstrated that EOSL-based encoder model selection can save up to 90% of energy while achieving a 44% improvement in semantic similarity performance during inference in this experiment. This work pave",
    "link": "https://arxiv.org/abs/2310.07592",
    "context": "Title: Transformers for Green Semantic Communication: Less Energy, More Semantics\nAbstract: arXiv:2310.07592v2 Announce Type: replace  Abstract: Semantic communication aims to transmit meaningful and effective information, rather than focusing on individual symbols or bits. This results in benefits like reduced latency, bandwidth usage, and higher throughput compared with traditional communication. However, semantic communication poses significant challenges due to the need for universal metrics to benchmark the joint effects of semantic information loss and practical energy consumption. This research presents a novel multi-objective loss function named \"Energy-Optimized Semantic Loss\" (EOSL), addressing the challenge of balancing semantic information loss and energy consumption. Through comprehensive experiments on transformer models, including CPU and GPU energy usage, it is demonstrated that EOSL-based encoder model selection can save up to 90% of energy while achieving a 44% improvement in semantic similarity performance during inference in this experiment. This work pave",
    "path": "papers/23/10/2310.07592.json",
    "total_tokens": 850,
    "translated_title": "变压器用于绿色语义通信：更少能量，更多语义",
    "translated_abstract": "语义通信旨在传输有意义且有效的信息，而不是专注于单个符号或位。与传统通信相比，这样做带来了诸如降低延迟、带宽使用和更高吞吐量等好处。然而，语义通信面临着重大挑战，因为需要通用度量来衡量语义信息丢失和实际能量消耗的联合效果。本研究提出了一种称为“Energy-Optimized Semantic Loss”（EOSL）的新型多目标损失函数，解决了平衡语义信息丢失和能量消耗的挑战。通过对变压器模型进行全面实验，包括CPU和GPU能量使用，证明基于EOSL的编码器模型选择在该实验中推断过程中能节省高达90%的能量，同时在语义相似性性能方面实现了44%的改进。这项工作为",
    "tldr": "本研究提出了一种名为“Energy-Optimized Semantic Loss”（EOSL）的新型多目标损失函数，通过对变压器模型进行全面实验，实现了在推断过程中节省高达90%能量并提高44%语义相似性表现的目标。"
}