{
    "title": "Optimization of Raman amplifiers: a comparison between black-, grey- and white-box modeling. (arXiv:2310.05954v1 [physics.app-ph])",
    "abstract": "Designing and optimizing optical amplifiers to maximize system performance is becoming increasingly important as optical communication systems strive to increase throughput. Offline optimization of optical amplifiers relies on models ranging from white-box models deeply rooted in physics to black-box data-driven physics-agnostic models. Here, we compare the capabilities of white-, grey- and black-box models to achieve a target frequency-distance amplification in a bidirectional Raman amplifier. We show that any of the studied methods can achieve down to 1 dB of frequency-distance flatness over the C-band in a 100-km span. Then, we discuss the models' applicability, advantages, and drawbacks based on the target application scenario, in particular in terms of optimization speed and access to training data.",
    "link": "http://arxiv.org/abs/2310.05954",
    "context": "Title: Optimization of Raman amplifiers: a comparison between black-, grey- and white-box modeling. (arXiv:2310.05954v1 [physics.app-ph])\nAbstract: Designing and optimizing optical amplifiers to maximize system performance is becoming increasingly important as optical communication systems strive to increase throughput. Offline optimization of optical amplifiers relies on models ranging from white-box models deeply rooted in physics to black-box data-driven physics-agnostic models. Here, we compare the capabilities of white-, grey- and black-box models to achieve a target frequency-distance amplification in a bidirectional Raman amplifier. We show that any of the studied methods can achieve down to 1 dB of frequency-distance flatness over the C-band in a 100-km span. Then, we discuss the models' applicability, advantages, and drawbacks based on the target application scenario, in particular in terms of optimization speed and access to training data.",
    "path": "papers/23/10/2310.05954.json",
    "total_tokens": 762,
    "translated_title": "Raman放大器的优化：黑盒、灰盒和白盒模型的比较",
    "translated_abstract": "在光通信系统不断努力提高吞吐量的过程中，设计和优化光放大器以最大化系统性能变得越来越重要。离线优化光放大器依赖于从深入物理学的白盒模型到数据驱动的与物理无关的黑盒模型的各种模型。在这里，我们比较了白盒、灰盒和黑盒模型在双向Raman放大器中实现目标频距放大的能力。我们展示了研究的任何一种方法都可以在100公里范围内实现C波段下达到1dB的频距平坦度。然后，我们根据目标应用场景讨论了模型的适用性、优势和缺点，特别是在优化速度和训练数据访问方面。",
    "tldr": "该论文比较了白盒、灰盒和黑盒模型在双向Raman放大器中实现目标频距放大的能力，并展示了它们都可以实现C波段下达到1dB的频距平坦度。"
}