{
    "title": "Computational analyses of linguistic features with schizophrenic and autistic traits along with formal thought disorders. (arXiv:2310.09494v1 [cs.CL])",
    "abstract": "[See full abstract in the pdf] Formal Thought Disorder (FTD), which is a group of symptoms in cognition that affects language and thought, can be observed through language. FTD is seen across such developmental or psychiatric disorders as Autism Spectrum Disorder (ASD) or Schizophrenia, and its related Schizotypal Personality Disorder (SPD). This paper collected a Japanese audio-report dataset with score labels related to ASD and SPD through a crowd-sourcing service from the general population. We measured language characteristics with the 2nd edition of the Social Responsiveness Scale (SRS2) and the Schizotypal Personality Questionnaire (SPQ), including an odd speech subscale from SPQ to quantify the FTD symptoms. We investigated the following four research questions through machine-learning-based score predictions: (RQ1) How are schizotypal and autistic measures correlated? (RQ2) What is the most suitable task to elicit FTD symptoms? (RQ3) Does the length of speech affect the elicita",
    "link": "http://arxiv.org/abs/2310.09494",
    "context": "Title: Computational analyses of linguistic features with schizophrenic and autistic traits along with formal thought disorders. (arXiv:2310.09494v1 [cs.CL])\nAbstract: [See full abstract in the pdf] Formal Thought Disorder (FTD), which is a group of symptoms in cognition that affects language and thought, can be observed through language. FTD is seen across such developmental or psychiatric disorders as Autism Spectrum Disorder (ASD) or Schizophrenia, and its related Schizotypal Personality Disorder (SPD). This paper collected a Japanese audio-report dataset with score labels related to ASD and SPD through a crowd-sourcing service from the general population. We measured language characteristics with the 2nd edition of the Social Responsiveness Scale (SRS2) and the Schizotypal Personality Questionnaire (SPQ), including an odd speech subscale from SPQ to quantify the FTD symptoms. We investigated the following four research questions through machine-learning-based score predictions: (RQ1) How are schizotypal and autistic measures correlated? (RQ2) What is the most suitable task to elicit FTD symptoms? (RQ3) Does the length of speech affect the elicita",
    "path": "papers/23/10/2310.09494.json",
    "total_tokens": 1022,
    "translated_title": "带有精神分裂症和孤独症特征以及形式思维障碍的语言特征的计算分析",
    "translated_abstract": "形式思维障碍(FTD)是一组影响语言和思维的认知症状，可以通过语言观察到。FTD在自闭症谱系障碍(ASD)和精神分裂症等发育或精神障碍中都有发现，以及相关的精神分裂型人格障碍(SPD)。本文通过从一般人群中的众包服务收集了一个带有与ASD和SPD相关的评分标签的日文音频报告数据集。我们使用社会反应性量表第二版(SRS2)和精神分裂型人格问卷(SPQ)来测量语言特征，包括SPQ中奇异言语子量表来量化FTD症状。我们通过基于机器学习的评分预测来研究以下四个研究问题：(RQ1)精神分裂型和孤独症测量有何相关性？(RQ2)哪种任务最适合引出FTD症状？(RQ3)言语长度是否会影响诱发FTD症状？",
    "tldr": "本论文通过分析带有精神分裂症和孤独症特征以及形式思维障碍的语言特征，通过机器学习预测评分来研究其相关性，并探讨了引出FTD症状的最适合任务和言语长度是否对FTD症状产生影响。"
}