{
    "title": "Enhancing expressivity transfer in textless speech-to-speech translation. (arXiv:2310.07279v1 [cs.SD])",
    "abstract": "Textless speech-to-speech translation systems are rapidly advancing, thanks to the integration of self-supervised learning techniques. However, existing state-of-the-art systems fall short when it comes to capturing and transferring expressivity accurately across different languages. Expressivity plays a vital role in conveying emotions, nuances, and cultural subtleties, thereby enhancing communication across diverse languages. To address this issue this study presents a novel method that operates at the discrete speech unit level and leverages multilingual emotion embeddings to capture language-agnostic information. Specifically, we demonstrate how these embeddings can be used to effectively predict the pitch and duration of speech units in the target language. Through objective and subjective experiments conducted on a French-to-English translation task, our findings highlight the superior expressivity transfer achieved by our approach compared to current state-of-the-art systems.",
    "link": "http://arxiv.org/abs/2310.07279",
    "context": "Title: Enhancing expressivity transfer in textless speech-to-speech translation. (arXiv:2310.07279v1 [cs.SD])\nAbstract: Textless speech-to-speech translation systems are rapidly advancing, thanks to the integration of self-supervised learning techniques. However, existing state-of-the-art systems fall short when it comes to capturing and transferring expressivity accurately across different languages. Expressivity plays a vital role in conveying emotions, nuances, and cultural subtleties, thereby enhancing communication across diverse languages. To address this issue this study presents a novel method that operates at the discrete speech unit level and leverages multilingual emotion embeddings to capture language-agnostic information. Specifically, we demonstrate how these embeddings can be used to effectively predict the pitch and duration of speech units in the target language. Through objective and subjective experiments conducted on a French-to-English translation task, our findings highlight the superior expressivity transfer achieved by our approach compared to current state-of-the-art systems.",
    "path": "papers/23/10/2310.07279.json",
    "total_tokens": 903,
    "translated_title": "提升无文本语音翻译系统中的表达能力转换",
    "translated_abstract": "在自我监督学习技术的整合下，无文本语音翻译系统正在快速发展。然而，现有的最先进系统在准确捕捉和转换不同语言的表达能力方面存在不足。表达能力在传达情感、细微差别和文化细微之处方面起着重要作用，从而增强不同语言之间的交流。为解决这个问题，本研究提出了一种新的方法，该方法在离散语音单元级别上运作，并利用多语言情感嵌入来捕捉语言无关的信息。具体而言，我们演示了如何利用这些嵌入来有效预测目标语言的音调和时长。通过对法语到英语翻译任务进行的客观和主观实验，我们的研究结果突出了我们的方法相对于现有最先进系统在表达能力转换方面的优势。",
    "tldr": "该研究提出了一种新方法来提高无文本语音翻译系统中的表达能力转换，通过运用多语言情感嵌入来捕捉语言无关的信息，并有效预测目标语言的音调和时长。实验结果表明，该方法相对于现有最先进系统在表达能力转换方面具有优势。",
    "en_tdlr": "This study presents a novel method to enhance expressivity transfer in textless speech-to-speech translation systems. By leveraging multilingual emotion embeddings, the proposed method accurately predicts the pitch and duration of speech units in the target language. Experimental results demonstrate its superiority over current state-of-the-art systems in expressivity transfer."
}