{
    "title": "PerturbScore: Connecting Discrete and Continuous Perturbations in NLP. (arXiv:2310.08889v1 [cs.CL])",
    "abstract": "With the rapid development of neural network applications in NLP, model robustness problem is gaining more attention. Different from computer vision, the discrete nature of texts makes it more challenging to explore robustness in NLP. Therefore, in this paper, we aim to connect discrete perturbations with continuous perturbations, therefore we can use such connections as a bridge to help understand discrete perturbations in NLP models. Specifically, we first explore how to connect and measure the correlation between discrete perturbations and continuous perturbations. Then we design a regression task as a PerturbScore to learn the correlation automatically. Through experimental results, we find that we can build a connection between discrete and continuous perturbations and use the proposed PerturbScore to learn such correlation, surpassing previous methods used in discrete perturbation measuring. Further, the proposed PerturbScore can be well generalized to different datasets, perturb",
    "link": "http://arxiv.org/abs/2310.08889",
    "context": "Title: PerturbScore: Connecting Discrete and Continuous Perturbations in NLP. (arXiv:2310.08889v1 [cs.CL])\nAbstract: With the rapid development of neural network applications in NLP, model robustness problem is gaining more attention. Different from computer vision, the discrete nature of texts makes it more challenging to explore robustness in NLP. Therefore, in this paper, we aim to connect discrete perturbations with continuous perturbations, therefore we can use such connections as a bridge to help understand discrete perturbations in NLP models. Specifically, we first explore how to connect and measure the correlation between discrete perturbations and continuous perturbations. Then we design a regression task as a PerturbScore to learn the correlation automatically. Through experimental results, we find that we can build a connection between discrete and continuous perturbations and use the proposed PerturbScore to learn such correlation, surpassing previous methods used in discrete perturbation measuring. Further, the proposed PerturbScore can be well generalized to different datasets, perturb",
    "path": "papers/23/10/2310.08889.json",
    "total_tokens": 920,
    "translated_title": "PerturbScore: 连接自然语言处理中的离散和连续扰动",
    "translated_abstract": "随着神经网络在自然语言处理中的快速发展，模型的鲁棒性问题越来越受到关注。与计算机视觉不同，文本的离散性质使得在自然语言处理中探索鲁棒性更具挑战性。因此，在本文中，我们旨在通过连接离散扰动和连续扰动，从而将其作为一个桥梁，帮助理解自然语言处理模型中的离散扰动。具体而言，我们首先探索如何连接和衡量离散扰动与连续扰动之间的相关性。然后，我们设计了一个回归任务作为PerturbScore，以自动学习此相关性。通过实验结果，我们发现可以建立离散和连续扰动之间的连接，并使用提出的PerturbScore来学习这种相关性，超过了先前用于离散扰动测量的方法。此外，提出的PerturbScore在不同的数据集，扰动上都能很好地推广。",
    "tldr": "本文提出了PerturbScore，通过连接离散和连续扰动来帮助理解自然语言处理中的离散扰动，通过实验结果表明PerturbScore超过了以前的离散扰动测量方法，并在不同的数据集上得到有效推广。"
}