{
    "title": "Accurate Data-Driven Surrogates of Dynamical Systems for Forward Propagation of Uncertainty. (arXiv:2310.10831v1 [math.NA])",
    "abstract": "Stochastic collocation (SC) is a well-known non-intrusive method of constructing surrogate models for uncertainty quantification. In dynamical systems, SC is especially suited for full-field uncertainty propagation that characterizes the distributions of the high-dimensional primary solution fields of a model with stochastic input parameters. However, due to the highly nonlinear nature of the parameter-to-solution map in even the simplest dynamical systems, the constructed SC surrogates are often inaccurate. This work presents an alternative approach, where we apply the SC approximation over the dynamics of the model, rather than the solution. By combining the data-driven sparse identification of nonlinear dynamics (SINDy) framework with SC, we construct dynamics surrogates and integrate them through time to construct the surrogate solutions. We demonstrate that the SC-over-dynamics framework leads to smaller errors, both in terms of the approximated system trajectories as well as the ",
    "link": "http://arxiv.org/abs/2310.10831",
    "context": "Title: Accurate Data-Driven Surrogates of Dynamical Systems for Forward Propagation of Uncertainty. (arXiv:2310.10831v1 [math.NA])\nAbstract: Stochastic collocation (SC) is a well-known non-intrusive method of constructing surrogate models for uncertainty quantification. In dynamical systems, SC is especially suited for full-field uncertainty propagation that characterizes the distributions of the high-dimensional primary solution fields of a model with stochastic input parameters. However, due to the highly nonlinear nature of the parameter-to-solution map in even the simplest dynamical systems, the constructed SC surrogates are often inaccurate. This work presents an alternative approach, where we apply the SC approximation over the dynamics of the model, rather than the solution. By combining the data-driven sparse identification of nonlinear dynamics (SINDy) framework with SC, we construct dynamics surrogates and integrate them through time to construct the surrogate solutions. We demonstrate that the SC-over-dynamics framework leads to smaller errors, both in terms of the approximated system trajectories as well as the ",
    "path": "papers/23/10/2310.10831.json",
    "total_tokens": 862,
    "translated_title": "准确的基于数据驱动的动力系统代理模型用于不确定性正向传播",
    "translated_abstract": "随机选取（SC）是一种构建代理模型用于不确定性量化的非侵入式方法。在动力系统中，SC特别适用于完全场不确定性传播，其描绘了具有随机输入参数的模型主要解场的分布。然而，由于即使在最简单的动力系统中，参数到解的映射具有高度非线性的特性，构建的SC代理模型通常不准确。本文提出了一种替代方法，即将SC近似应用于模型的动力学而非解。通过将数据驱动的稀疏非线性动力学（SINDy）框架与SC结合，我们构建动力学代理模型，并通过时间进行积分以构建代理解。我们证明了SC-over-dynamics框架在近似系统轨迹以及状态变量误差方面都具有更小的误差。",
    "tldr": "本文介绍了一种准确的基于数据驱动的动力系统代理模型方法，通过将随机选取近似应用于模型的动力学来构建代理模型。这种方法能够减小近似系统轨迹和状态变量误差。",
    "en_tdlr": "This paper presents an accurate data-driven surrogate model for dynamical systems, where stochastic collocation is applied over the dynamics of the model to construct the surrogate model. This approach reduces the errors in approximated system trajectories and state variable."
}