{
    "title": "The Many Voices of Duying: Revisiting the Disputed Essays Between Lu Xun and Zhou Zuoren. (arXiv:2310.01440v1 [cs.CL])",
    "abstract": "Lu Xun and Zhou Zuoren stand as two of the most influential writers in modern Chinese literature. Beyond their familial ties as brothers, they were also intimate collaborators during the nascent stages of their writing careers. This research employs quantitative methods to revisit three disputed essays pseudonymously published by the brothers in 1912. Our stylometric analysis uses an interpretable authorship attribution model to investigate the essays' authorship and examine the brothers' respective writing styles. Our findings suggest that 'Looking at the Country of China' was authored by Lu Xun. Moreover, 'People of Yue, Forget Not Your Ancestors' Instructions' seems to be either predominantly authored or extensively revised by Lu Xun given its notable stylistic similarities to 'Looking at the Land of Yue,' a piece Zhou Zuoren recognized as his own, but edited by Lu Xun. The third essay, 'Where Has the Character of the Republic Gone?,' exhibits a 'diluted', mixed writing style, sugge",
    "link": "http://arxiv.org/abs/2310.01440",
    "context": "Title: The Many Voices of Duying: Revisiting the Disputed Essays Between Lu Xun and Zhou Zuoren. (arXiv:2310.01440v1 [cs.CL])\nAbstract: Lu Xun and Zhou Zuoren stand as two of the most influential writers in modern Chinese literature. Beyond their familial ties as brothers, they were also intimate collaborators during the nascent stages of their writing careers. This research employs quantitative methods to revisit three disputed essays pseudonymously published by the brothers in 1912. Our stylometric analysis uses an interpretable authorship attribution model to investigate the essays' authorship and examine the brothers' respective writing styles. Our findings suggest that 'Looking at the Country of China' was authored by Lu Xun. Moreover, 'People of Yue, Forget Not Your Ancestors' Instructions' seems to be either predominantly authored or extensively revised by Lu Xun given its notable stylistic similarities to 'Looking at the Land of Yue,' a piece Zhou Zuoren recognized as his own, but edited by Lu Xun. The third essay, 'Where Has the Character of the Republic Gone?,' exhibits a 'diluted', mixed writing style, sugge",
    "path": "papers/23/10/2310.01440.json",
    "total_tokens": 1014,
    "translated_title": "对鲁迅与周作人争议性文章的重新审视：端木烟的多重声音",
    "translated_abstract": "鲁迅与周作人是中国现代文学中最有影响力的作家之一。除了作为兄弟关系外，他们在写作生涯初期还是密切合作的伙伴。本研究采用定量方法重新审视两兄弟在1912年以笔名发表的三篇争议性文章。我们使用可解释的作者归属模型进行文体分析，以调查这些文章的作者以及兄弟俩的写作风格。研究结果表明《看中国》一文的作者是鲁迅。此外，《忘不了祖先告语》一文似乎要么是鲁迅主要创作，要么是在鲁迅的大量修改下完成的，因为它与周作人认可为自己的《看越山水》在文体上有显著的相似之处。第三篇《民主已缩水，它去了何方》则展现出一种混合的写作风格，表明了两者的影响。",
    "tldr": "这项研究通过定量方法重新审视鲁迅和周作人1912年以笔名发表的三篇争议性文章，发现鲁迅是其中《看中国》的作者，并且《忘不了祖先告语》可能由鲁迅主要创作或在他的大量修改下完成。第三篇文章展示了两人的影响并具有混合的写作风格。"
}