{
    "title": "A Finite-Horizon Approach to Active Level Set Estimation. (arXiv:2310.11985v1 [cs.LG])",
    "abstract": "We consider the problem of active learning in the context of spatial sampling for level set estimation (LSE), where the goal is to localize all regions where a function of interest lies above/below a given threshold as quickly as possible. We present a finite-horizon search procedure to perform LSE in one dimension while optimally balancing both the final estimation error and the distance traveled for a fixed number of samples. A tuning parameter is used to trade off between the estimation accuracy and distance traveled. We show that the resulting optimization problem can be solved in closed form and that the resulting policy generalizes existing approaches to this problem. We then show how this approach can be used to perform level set estimation in higher dimensions under the popular Gaussian process model. Empirical results on synthetic data indicate that as the cost of travel increases, our method's ability to treat distance nonmyopically allows it to significantly improve on the s",
    "link": "http://arxiv.org/abs/2310.11985",
    "context": "Title: A Finite-Horizon Approach to Active Level Set Estimation. (arXiv:2310.11985v1 [cs.LG])\nAbstract: We consider the problem of active learning in the context of spatial sampling for level set estimation (LSE), where the goal is to localize all regions where a function of interest lies above/below a given threshold as quickly as possible. We present a finite-horizon search procedure to perform LSE in one dimension while optimally balancing both the final estimation error and the distance traveled for a fixed number of samples. A tuning parameter is used to trade off between the estimation accuracy and distance traveled. We show that the resulting optimization problem can be solved in closed form and that the resulting policy generalizes existing approaches to this problem. We then show how this approach can be used to perform level set estimation in higher dimensions under the popular Gaussian process model. Empirical results on synthetic data indicate that as the cost of travel increases, our method's ability to treat distance nonmyopically allows it to significantly improve on the s",
    "path": "papers/23/10/2310.11985.json",
    "total_tokens": 876,
    "translated_title": "一种有限时间视角下的主动水平集估计方法",
    "translated_abstract": "我们考虑了在空间采样中进行主动学习的问题，用于水平集估计（LSE）。该问题的目标是尽快定位所有符合给定阈值上/下的感兴趣函数的区域。我们提出了一种有限时间的搜索过程，以在一维中执行LSE，同时在固定数量样本的情况下，最优地平衡最终估计误差和已移动的距离。通过调整参数来权衡估计准确性和已移动的距离。我们证明了得出的优化问题可以闭式求解，并且所得策略推广了现有的解决方法。然后，我们展示了如何在流行的高斯过程模型下使用这种方法来进行更高维度的水平集估计。对合成数据的实证结果表明，随着旅行成本的增加，我们的方法以非迭代距离处理的能力使其能够显著改善已有方法的能力。",
    "tldr": "这项研究提出了一种有限时间视角下的主动水平集估计方法，在一维和高维情况下均表现出较高的效果，能够平衡估计误差和已移动距离，具有推广性。",
    "en_tdlr": "This research proposes a finite-horizon approach to active level set estimation, which achieves high performance in one-dimension and higher dimensions by balancing estimation error and distance traveled, and has generalizability."
}