{
    "title": "Context-aware explainable recommendations over knowledge graphs. (arXiv:2310.16141v1 [cs.IR])",
    "abstract": "Knowledge graphs contain rich semantic relationships related to items and incorporating such semantic relationships into recommender systems helps to explore the latent connections of items, thus improving the accuracy of prediction and enhancing the explainability of recommendations. However, such explainability is not adapted to users' contexts, which can significantly influence their preferences. In this work, we propose CA-KGCN (Context-Aware Knowledge Graph Convolutional Network), an end-to-end framework that can model users' preferences adapted to their contexts and can incorporate rich semantic relationships in the knowledge graph related to items. This framework captures users' attention to different factors: contexts and features of items. More specifically, the framework can model users' preferences adapted to their contexts and provide explanations adapted to the given context. Experiments on three real-world datasets show the effectiveness of our framework: modeling users' ",
    "link": "http://arxiv.org/abs/2310.16141",
    "context": "Title: Context-aware explainable recommendations over knowledge graphs. (arXiv:2310.16141v1 [cs.IR])\nAbstract: Knowledge graphs contain rich semantic relationships related to items and incorporating such semantic relationships into recommender systems helps to explore the latent connections of items, thus improving the accuracy of prediction and enhancing the explainability of recommendations. However, such explainability is not adapted to users' contexts, which can significantly influence their preferences. In this work, we propose CA-KGCN (Context-Aware Knowledge Graph Convolutional Network), an end-to-end framework that can model users' preferences adapted to their contexts and can incorporate rich semantic relationships in the knowledge graph related to items. This framework captures users' attention to different factors: contexts and features of items. More specifically, the framework can model users' preferences adapted to their contexts and provide explanations adapted to the given context. Experiments on three real-world datasets show the effectiveness of our framework: modeling users' ",
    "path": "papers/23/10/2310.16141.json",
    "total_tokens": 827,
    "translated_title": "基于上下文的可解释知识图谱推荐",
    "translated_abstract": "知识图谱包含与项目相关的丰富语义关系，将这些语义关系纳入推荐系统有助于探索项目的潜在连接，从而提高预测准确性并增强推荐的可解释性。然而，这种可解释性不适应用户的情境，而情境可以显著影响其偏好。本文提出了CA-KGCN（上下文感知知识图谱卷积网络），这是一个端到端的框架，可以根据用户的情境来建模其偏好，并将与项目相关的丰富语义关系纳入知识图谱中。该框架捕捉用户对不同因素的注意力：上下文和项目特征。具体而言，该框架可以根据特定情境建模用户的偏好并提供适应给定情境的解释。在三个真实世界数据集上的实验证明了我们框架的有效性。",
    "tldr": "本文提出了CA-KGCN，一个基于上下文的推荐系统框架，能够将知识图谱中的语义关系纳入建模，提高推荐准确性和可解释性。",
    "en_tdlr": "This paper proposes CA-KGCN, a context-aware recommender system framework that incorporates semantic relationships from knowledge graphs to improve accuracy and explainability of recommendations."
}