{
    "title": "GRID: A Platform for General Robot Intelligence Development. (arXiv:2310.00887v2 [cs.RO] UPDATED)",
    "abstract": "Developing machine intelligence abilities in robots and autonomous systems is an expensive and time consuming process. Existing solutions are tailored to specific applications and are harder to generalize. Furthermore, scarcity of training data adds a layer of complexity in deploying deep machine learning models. We present a new platform for General Robot Intelligence Development (GRID) to address both of these issues. The platform enables robots to learn, compose and adapt skills to their physical capabilities, environmental constraints and goals. The platform addresses AI problems in robotics via foundation models that know the physical world. GRID is designed from the ground up to be extensible to accommodate new types of robots, vehicles, hardware platforms and software protocols. In addition, the modular design enables various deep ML components and existing foundation models to be easily usable in a wider variety of robot-centric problems. We demonstrate the platform in various ",
    "link": "http://arxiv.org/abs/2310.00887",
    "context": "Title: GRID: A Platform for General Robot Intelligence Development. (arXiv:2310.00887v2 [cs.RO] UPDATED)\nAbstract: Developing machine intelligence abilities in robots and autonomous systems is an expensive and time consuming process. Existing solutions are tailored to specific applications and are harder to generalize. Furthermore, scarcity of training data adds a layer of complexity in deploying deep machine learning models. We present a new platform for General Robot Intelligence Development (GRID) to address both of these issues. The platform enables robots to learn, compose and adapt skills to their physical capabilities, environmental constraints and goals. The platform addresses AI problems in robotics via foundation models that know the physical world. GRID is designed from the ground up to be extensible to accommodate new types of robots, vehicles, hardware platforms and software protocols. In addition, the modular design enables various deep ML components and existing foundation models to be easily usable in a wider variety of robot-centric problems. We demonstrate the platform in various ",
    "path": "papers/23/10/2310.00887.json",
    "total_tokens": 825,
    "translated_title": "GRID: 通用机器人智能开发平台",
    "translated_abstract": "在机器人和自主系统中开发机器智能能力是一项昂贵且耗时的过程。现有解决方案针对特定应用，难以推广。此外，训练数据的稀缺性增加了部署深度机器学习模型的复杂性。我们提出了一个新的通用机器人智能开发平台（GRID）来解决这两个问题。该平台使机器人能够学习、组合和适应其物理能力、环境限制和目标。该平台通过了解物理世界的基础模型来解决机器人中的人工智能问题。GRID从根本上设计成可扩展的，以适应新类型的机器人、车辆、硬件平台和软件协议。此外，模块化设计使各种深度机器学习组件和现有基础模型在更广泛的以机器人为中心的问题中容易使用。我们在各种情况下展示了这个平台。",
    "tldr": "GRID是一个构建通用机器人智能的开发平台，通过基础模型和扩展性设计来解决特定应用和训练数据稀缺性的问题。"
}