{
    "title": "Extracting Physical Causality from Measurements to Detect and Localize False Data Injection Attacks. (arXiv:2310.10666v1 [cs.CR])",
    "abstract": "False Data Injection Attack (FDIA) has become a growing concern in modern cyber-physical power systems. Most existing FDIA detection techniques project the raw measurement data into a high-dimensional latent space to separate normal and attacked samples. These approaches focus more on the statistical correlations of data values and are therefore susceptible to data distribution drifts induced by changes in system operating points or changes in FDIA types and strengths, especially for FDIA localization tasks. Causal inference, on the other hand, extracts the causality behind the coordinated fluctuations of different measurements. The causality patterns are determined by fundamental physical laws such as Ohm's Law and Kirchhoff's Law. They are sensitive to the violation of physical laws caused by FDIA, but tend to remain stable with the drift of system operating points. Leveraging this advantage, this paper proposes a joint FDIA detection and localization framework based on causal infere",
    "link": "http://arxiv.org/abs/2310.10666",
    "context": "Title: Extracting Physical Causality from Measurements to Detect and Localize False Data Injection Attacks. (arXiv:2310.10666v1 [cs.CR])\nAbstract: False Data Injection Attack (FDIA) has become a growing concern in modern cyber-physical power systems. Most existing FDIA detection techniques project the raw measurement data into a high-dimensional latent space to separate normal and attacked samples. These approaches focus more on the statistical correlations of data values and are therefore susceptible to data distribution drifts induced by changes in system operating points or changes in FDIA types and strengths, especially for FDIA localization tasks. Causal inference, on the other hand, extracts the causality behind the coordinated fluctuations of different measurements. The causality patterns are determined by fundamental physical laws such as Ohm's Law and Kirchhoff's Law. They are sensitive to the violation of physical laws caused by FDIA, but tend to remain stable with the drift of system operating points. Leveraging this advantage, this paper proposes a joint FDIA detection and localization framework based on causal infere",
    "path": "papers/23/10/2310.10666.json",
    "total_tokens": 864,
    "translated_title": "从测量中提取物理因果关系以检测和定位虚假数据插入攻击",
    "translated_abstract": "虚假数据插入攻击（FDIA）已成为现代网络物理电力系统中日益关注的问题。大多数现有的FDIA检测技术将原始测量数据投影到高维潜在空间中，以区分正常样本和攻击样本。这些方法更多地关注数据值的统计相关性，因此容易受到系统操作点变化或FDIA类型和强度变化引起的数据分布漂移的影响，尤其是对于FDIA定位任务来说。而因果推断则提取了不同测量之间协同波动背后的因果关系。因果性模式由基本物理定律（如欧姆定律和基尔霍夫定律）确定。它们对FDIA引起的物理定律违反敏感，但在系统操作点漂移时趋于稳定。借助这个优势，本文提出了基于因果推断的联合FDIA检测和定位框架。",
    "tldr": "本文提出了一种基于因果推断的联合FDIA检测和定位框架，以提取物理因果关系来检测和定位虚假数据插入攻击。",
    "en_tdlr": "This paper proposes a joint detection and localization framework for false data injection attacks (FDIA) based on causal inference, to extract physical causality and detect and locate false data insertion attacks."
}