{
    "title": "LFG: A Generative Network for Real-Time Recommendation. (arXiv:2310.20189v1 [cs.IR])",
    "abstract": "Recommender systems are essential information technologies today, and recommendation algorithms combined with deep learning have become a research hotspot in this field. The recommendation model known as LFM (Latent Factor Model), which captures latent features through matrix factorization and gradient descent to fit user preferences, has given rise to various recommendation algorithms that bring new improvements in recommendation accuracy. However, collaborative filtering recommendation models based on LFM lack flexibility and has shortcomings for real-time recommendations, as they need to redo the matrix factorization and retrain using gradient descent when new users arrive. In response to this, this paper innovatively proposes a Latent Factor Generator (LFG) network, and set the movie recommendation as research theme. The LFG dynamically generates user latent factors through deep neural networks without the need for re-factorization or retrain. Experimental results indicate that the",
    "link": "http://arxiv.org/abs/2310.20189",
    "context": "Title: LFG: A Generative Network for Real-Time Recommendation. (arXiv:2310.20189v1 [cs.IR])\nAbstract: Recommender systems are essential information technologies today, and recommendation algorithms combined with deep learning have become a research hotspot in this field. The recommendation model known as LFM (Latent Factor Model), which captures latent features through matrix factorization and gradient descent to fit user preferences, has given rise to various recommendation algorithms that bring new improvements in recommendation accuracy. However, collaborative filtering recommendation models based on LFM lack flexibility and has shortcomings for real-time recommendations, as they need to redo the matrix factorization and retrain using gradient descent when new users arrive. In response to this, this paper innovatively proposes a Latent Factor Generator (LFG) network, and set the movie recommendation as research theme. The LFG dynamically generates user latent factors through deep neural networks without the need for re-factorization or retrain. Experimental results indicate that the",
    "path": "papers/23/10/2310.20189.json",
    "total_tokens": 894,
    "translated_title": "LFG：一种用于实时推荐的生成网络",
    "translated_abstract": "推荐系统是当今重要的信息技术，结合深度学习的推荐算法已成为该领域的研究热点。通过矩阵分解和梯度下降捕捉潜在特征以适应用户偏好的潜在因子模型（LFM）推动了各种改进推荐准确性的推荐算法的出现。然而，基于LFM的协同过滤推荐模型缺乏灵活性，并且在实时推荐方面存在一些缺点，因为当有新用户到达时需要重新进行矩阵分解和重新训练。针对这一问题，本文创新性地提出了一种Latent Factor Generator (LFG)网络，并将电影推荐作为研究主题。LFG通过深度神经网络动态生成用户的潜在因子，无需重新分解或重新训练。实验结果表明，该模型在提高推荐准确性的同时实现了实时推荐的目标。",
    "tldr": "本文提出了一种名为LFG的生成网络，用于实现实时的推荐系统。该网络通过深度神经网络动态生成用户的潜在因子，无需重新分解或重新训练。实验结果表明，该网络在提高推荐准确性的同时实现了实时推荐的目标。"
}