{
    "title": "Non-isotropic Persistent Homology: Leveraging the Metric Dependency of PH. (arXiv:2310.16437v1 [math.AT])",
    "abstract": "Persistent Homology is a widely used topological data analysis tool that creates a concise description of the topological properties of a point cloud based on a specified filtration. Most filtrations used for persistent homology depend (implicitly) on a chosen metric, which is typically agnostically chosen as the standard Euclidean metric on $\\mathbb{R}^n$. Recent work has tried to uncover the 'true' metric on the point cloud using distance-to-measure functions, in order to obtain more meaningful persistent homology results. Here we propose an alternative look at this problem: we posit that information on the point cloud is lost when restricting persistent homology to a single (correct) distance function. Instead, we show how by varying the distance function on the underlying space and analysing the corresponding shifts in the persistence diagrams, we can extract additional topological and geometrical information. Finally, we numerically show that non-isotropic persistent homology can ",
    "link": "http://arxiv.org/abs/2310.16437",
    "context": "Title: Non-isotropic Persistent Homology: Leveraging the Metric Dependency of PH. (arXiv:2310.16437v1 [math.AT])\nAbstract: Persistent Homology is a widely used topological data analysis tool that creates a concise description of the topological properties of a point cloud based on a specified filtration. Most filtrations used for persistent homology depend (implicitly) on a chosen metric, which is typically agnostically chosen as the standard Euclidean metric on $\\mathbb{R}^n$. Recent work has tried to uncover the 'true' metric on the point cloud using distance-to-measure functions, in order to obtain more meaningful persistent homology results. Here we propose an alternative look at this problem: we posit that information on the point cloud is lost when restricting persistent homology to a single (correct) distance function. Instead, we show how by varying the distance function on the underlying space and analysing the corresponding shifts in the persistence diagrams, we can extract additional topological and geometrical information. Finally, we numerically show that non-isotropic persistent homology can ",
    "path": "papers/23/10/2310.16437.json",
    "total_tokens": 901,
    "translated_title": "非各向异性的持久同调：利用持久同调的度量依赖性",
    "translated_abstract": "持久同调是一种广泛使用的拓扑数据分析工具，它基于指定的滤波器创建一个对点云的拓扑性质的简洁描述。大多数用于持久同调的滤波器（隐含地）依赖于选择的度量，通常会以$\\mathbb{R}^n$上的标准欧氏度量为选择。最近的研究试图使用距离到度量函数来揭示点云上的“真实”度量，以获得更有意义的持久同调结果。在这里，我们提出了对这个问题的替代性看法：我们认为当将持久同调限制在一个单一（正确的）距离函数上时，点云上的信息会丢失。相反，我们展示了如何通过在底层空间上变化距离函数并分析相应的持久图中的偏移，可以提取额外的拓扑和几何信息。最后，我们通过数值实验证明了非各向异性持久同调能够实现...",
    "tldr": "本论文提出了一种非各向异性的持久同调方法，通过变化底层空间上的距离函数并分析持久图的偏移，可以提取额外的拓扑和几何信息。",
    "en_tdlr": "This paper presents a non-isotropic persistent homology method that extracts additional topological and geometrical information by varying the distance function on the underlying space and analyzing the corresponding shifts in the persistence diagrams."
}