{
    "title": "Reducing Intraspecies and Interspecies Covariate Shift in Traumatic Brain Injury EEG of Humans and Mice Using Transfer Euclidean Alignment. (arXiv:2310.02398v1 [cs.LG])",
    "abstract": "While analytics of sleep electroencephalography (EEG) holds certain advantages over other methods in clinical applications, high variability across subjects poses a significant challenge when it comes to deploying machine learning models for classification tasks in the real world. In such instances, machine learning models that exhibit exceptional performance on a specific dataset may not necessarily demonstrate similar proficiency when applied to a distinct dataset for the same task. The scarcity of high-quality biomedical data further compounds this challenge, making it difficult to evaluate the model's generality comprehensively. In this paper, we introduce Transfer Euclidean Alignment - a transfer learning technique to tackle the problem of the dearth of human biomedical data for training deep learning models. We tested the robustness of this transfer learning technique on various rule-based classical machine learning models as well as the EEGNet-based deep learning model by evalua",
    "link": "http://arxiv.org/abs/2310.02398",
    "context": "Title: Reducing Intraspecies and Interspecies Covariate Shift in Traumatic Brain Injury EEG of Humans and Mice Using Transfer Euclidean Alignment. (arXiv:2310.02398v1 [cs.LG])\nAbstract: While analytics of sleep electroencephalography (EEG) holds certain advantages over other methods in clinical applications, high variability across subjects poses a significant challenge when it comes to deploying machine learning models for classification tasks in the real world. In such instances, machine learning models that exhibit exceptional performance on a specific dataset may not necessarily demonstrate similar proficiency when applied to a distinct dataset for the same task. The scarcity of high-quality biomedical data further compounds this challenge, making it difficult to evaluate the model's generality comprehensively. In this paper, we introduce Transfer Euclidean Alignment - a transfer learning technique to tackle the problem of the dearth of human biomedical data for training deep learning models. We tested the robustness of this transfer learning technique on various rule-based classical machine learning models as well as the EEGNet-based deep learning model by evalua",
    "path": "papers/23/10/2310.02398.json",
    "total_tokens": 1027,
    "translated_title": "减少人和小鼠脑外伤 EEG 数据中种内和种间协变量偏移的转移欧几里德对齐方法",
    "translated_abstract": "虽然睡眠脑电图（EEG）分析在临床应用中具有某些优势，但不同受试者之间的高变异性在部署机器学习模型用于分类任务时提出了重要挑战。在这种情况下，对于相同任务，在特定数据集上表现出卓越性能的机器学习模型未必在应用于不同数据集时表现出类似的熟练程度。高质量生物医学数据的稀缺性进一步加剧了这个挑战，使得全面评估模型的普适性变得困难。本文介绍了一种转移学习技术“转移欧几里德对齐”，用于解决缺乏人类生物医学数据以训练深度学习模型的问题。我们通过评估多种基于规则的经典机器学习模型以及基于 EEGNet 的深度学习模型，测试了这种转移学习技术的鲁棒性。",
    "tldr": "本文介绍了一种转移学习技术，以应对在睡眠脑电图（EEG）分析中由于个体间的高变异性而导致机器学习模型在不同数据集上的表现差异。该技术可以通过转移欧几里德对齐来解决缺乏高质量人类生物医学数据的问题，并在多种经典机器学习模型和深度学习模型上展现出鲁棒性。",
    "en_tdlr": "This paper introduces a transfer learning technique to address the performance disparities of machine learning models on different datasets in sleep electroencephalography (EEG) analysis due to high variability among individuals. The technique tackles the lack of high-quality human biomedical data by using transfer Euclidean alignment, and demonstrates robustness across various rule-based classical machine learning models and EEGNet-based deep learning models."
}