{
    "title": "Sparse high-dimensional linear mixed modeling with a partitioned empirical Bayes ECM algorithm. (arXiv:2310.12285v1 [stat.ME])",
    "abstract": "High-dimensional longitudinal data is increasingly used in a wide range of scientific studies. However, there are few statistical methods for high-dimensional linear mixed models (LMMs), as most Bayesian variable selection or penalization methods are designed for independent observations. Additionally, the few available software packages for high-dimensional LMMs suffer from scalability issues. This work presents an efficient and accurate Bayesian framework for high-dimensional LMMs. We use empirical Bayes estimators of hyperparameters for increased flexibility and an Expectation-Conditional-Minimization (ECM) algorithm for computationally efficient maximum a posteriori probability (MAP) estimation of parameters. The novelty of the approach lies in its partitioning and parameter expansion as well as its fast and scalable computation. We illustrate Linear Mixed Modeling with PaRtitiOned empirical Bayes ECM (LMM-PROBE) in simulation studies evaluating fixed and random effects estimation ",
    "link": "http://arxiv.org/abs/2310.12285",
    "context": "Title: Sparse high-dimensional linear mixed modeling with a partitioned empirical Bayes ECM algorithm. (arXiv:2310.12285v1 [stat.ME])\nAbstract: High-dimensional longitudinal data is increasingly used in a wide range of scientific studies. However, there are few statistical methods for high-dimensional linear mixed models (LMMs), as most Bayesian variable selection or penalization methods are designed for independent observations. Additionally, the few available software packages for high-dimensional LMMs suffer from scalability issues. This work presents an efficient and accurate Bayesian framework for high-dimensional LMMs. We use empirical Bayes estimators of hyperparameters for increased flexibility and an Expectation-Conditional-Minimization (ECM) algorithm for computationally efficient maximum a posteriori probability (MAP) estimation of parameters. The novelty of the approach lies in its partitioning and parameter expansion as well as its fast and scalable computation. We illustrate Linear Mixed Modeling with PaRtitiOned empirical Bayes ECM (LMM-PROBE) in simulation studies evaluating fixed and random effects estimation ",
    "path": "papers/23/10/2310.12285.json",
    "total_tokens": 877,
    "translated_title": "稀疏高维线性混合模型的分区经验Bayes ECM算法",
    "translated_abstract": "高维纵向数据在各种科学研究中的应用日益增多。然而，对于高维线性混合模型(LMMs)，目前只有少数统计方法可用，因为大多数贝叶斯变量选择或罚函数方法是针对独立观测设计的。此外，目前少数可用的高维LMMs软件包存在可扩展性问题。本文提出了一种高效准确的高维LMMs贝叶斯框架。我们使用经验Bayes估计器的超参数来增加灵活性，并使用Expectation-Conditional-Minimization (ECM)算法来计算参数的最大后验概率(MAP)估计，从而实现高效的计算。这种方法的创新之处在于其分区和参数扩展，以及其快速和可扩展的计算。我们通过模拟研究中的固定效应和随机效应估计展示了线性混合模型结合分区经验Bayes ECM (LMM-PROBE)的效果。",
    "tldr": "提出了一种高维线性混合模型的分区经验Bayes ECM算法，具有快速可扩展的计算能力和更高的灵活性。"
}