{
    "title": "Empirical Review of Youth-Employment Policies in Nigeria. (arXiv:2310.07789v1 [econ.GN])",
    "abstract": "Youth unemployment is a major socioeconomic problem in Nigeria, and several youth-employment programs have been initiated and implemented to address the challenge. While detailed analyses of the impacts of some of these programs have been conducted, empirical analysis of implementation challenges and of the influence of limited political inclusivity on distribution of program benefits is rare. Using mixed research methods and primary data collected through focus-group discussion and key-informant interviews, this paper turns to that analysis. We found that, although there are several youth-employment programs in Nigeria, they have not yielded a marked reduction in youth-unemployment rates. The programs are challenged by factors such as lack of framework for proper governance and coordination, inadequate funding, lack of institutional implementation capacity, inadequate oversight of implementation, limited political inclusivity, lack of prioritization of vulnerable and marginalized grou",
    "link": "http://arxiv.org/abs/2310.07789",
    "context": "Title: Empirical Review of Youth-Employment Policies in Nigeria. (arXiv:2310.07789v1 [econ.GN])\nAbstract: Youth unemployment is a major socioeconomic problem in Nigeria, and several youth-employment programs have been initiated and implemented to address the challenge. While detailed analyses of the impacts of some of these programs have been conducted, empirical analysis of implementation challenges and of the influence of limited political inclusivity on distribution of program benefits is rare. Using mixed research methods and primary data collected through focus-group discussion and key-informant interviews, this paper turns to that analysis. We found that, although there are several youth-employment programs in Nigeria, they have not yielded a marked reduction in youth-unemployment rates. The programs are challenged by factors such as lack of framework for proper governance and coordination, inadequate funding, lack of institutional implementation capacity, inadequate oversight of implementation, limited political inclusivity, lack of prioritization of vulnerable and marginalized grou",
    "path": "papers/23/10/2310.07789.json",
    "total_tokens": 893,
    "translated_title": "尼日利亚青年就业政策的实证评估",
    "translated_abstract": "青年失业是尼日利亚的一个重大社会经济问题，为应对这一挑战，已经推出并实施了几项青年就业计划。虽然已经对其中一些计划的影响进行了详细分析，但对实施挑战和有限政治包容对计划效益分配的影响的经验分析很少。本文利用混合研究方法和通过焦点小组讨论和关键信息人访谈收集的初级数据进行分析。我们发现，尽管尼日利亚有几项青年就业计划，但青年失业率并没有显著下降。这些计划面临着一些挑战，如缺乏适当治理和协调的框架，资金不足，缺乏机构实施能力，实施监督不足，政治包容有限，缺乏对脆弱和边缘化群体的优先考虑。",
    "tldr": "本文通过混合研究方法和主要数据分析了尼日利亚青年就业计划的实施挑战和政治包容的影响。研究发现，尽管已经推出了多个青年就业计划，但尼日利亚的青年失业率并没有显著下降。",
    "en_tdlr": "This paper empirically analyzes the implementation challenges and the influence of political inclusivity on youth-employment programs in Nigeria. The study finds that despite the existence of multiple programs, youth unemployment rates in Nigeria have not significantly decreased."
}