{
    "title": "Transformer-Based Neural Surrogate for Link-Level Path Loss Prediction from Variable-Sized Maps. (arXiv:2310.04570v2 [cs.LG] UPDATED)",
    "abstract": "Estimating path loss for a transmitter-receiver location is key to many use-cases including network planning and handover. Machine learning has become a popular tool to predict wireless channel properties based on map data. In this work, we present a transformer-based neural network architecture that enables predicting link-level properties from maps of various dimensions and from sparse measurements. The map contains information about buildings and foliage. The transformer model attends to the regions that are relevant for path loss prediction and, therefore, scales efficiently to maps of different size. Further, our approach works with continuous transmitter and receiver coordinates without relying on discretization. In experiments, we show that the proposed model is able to efficiently learn dominant path losses from sparse training data and generalizes well when tested on novel maps.",
    "link": "http://arxiv.org/abs/2310.04570",
    "context": "Title: Transformer-Based Neural Surrogate for Link-Level Path Loss Prediction from Variable-Sized Maps. (arXiv:2310.04570v2 [cs.LG] UPDATED)\nAbstract: Estimating path loss for a transmitter-receiver location is key to many use-cases including network planning and handover. Machine learning has become a popular tool to predict wireless channel properties based on map data. In this work, we present a transformer-based neural network architecture that enables predicting link-level properties from maps of various dimensions and from sparse measurements. The map contains information about buildings and foliage. The transformer model attends to the regions that are relevant for path loss prediction and, therefore, scales efficiently to maps of different size. Further, our approach works with continuous transmitter and receiver coordinates without relying on discretization. In experiments, we show that the proposed model is able to efficiently learn dominant path losses from sparse training data and generalizes well when tested on novel maps.",
    "path": "papers/23/10/2310.04570.json",
    "total_tokens": 822,
    "translated_title": "基于Transformer的神经网络替代方法用于变尺寸地图中的链接级路径损耗预测",
    "translated_abstract": "估计发射机-接收机位置的路径损耗对于网络规划和切换等许多用例至关重要。机器学习已成为基于地图数据预测无线信道属性的常用工具。在本工作中，我们提出了一种基于Transformer的神经网络架构，可以从不同尺寸的地图和稀疏测量中预测链接级属性。地图包含建筑物和植被的信息。Transformer模型关注与路径损耗预测相关的区域，因此可以有效地适应不同尺寸的地图。此外，我们的方法适用于连续的发射机和接收机坐标，无需离散化处理。在实验中，我们展示了所提出的模型能够从稀疏的训练数据中高效地学习到主导的路径损耗，并在新颖地图上进行了良好的泛化。",
    "tldr": "本研究提出了一种基于Transformer的神经网络架构，可以从变尺寸地图和稀疏测量中预测链接级属性，并且在泛化性能方面表现良好。"
}