{
    "title": "Imitation Learning from Purified Demonstration. (arXiv:2310.07143v1 [cs.LG])",
    "abstract": "Imitation learning has emerged as a promising approach for addressing sequential decision-making problems, with the assumption that expert demonstrations are optimal. However, in real-world scenarios, expert demonstrations are often imperfect, leading to challenges in effectively applying imitation learning. While existing research has focused on optimizing with imperfect demonstrations, the training typically requires a certain proportion of optimal demonstrations to guarantee performance. To tackle these problems, we propose to purify the potential perturbations in imperfect demonstrations and subsequently conduct imitation learning from purified demonstrations. Motivated by the success of diffusion models, we introduce a two-step purification via the diffusion process. In the first step, we apply a forward diffusion process to effectively smooth out the potential perturbations in imperfect demonstrations by introducing additional noise. Subsequently, a reverse generative process is ",
    "link": "http://arxiv.org/abs/2310.07143",
    "context": "Title: Imitation Learning from Purified Demonstration. (arXiv:2310.07143v1 [cs.LG])\nAbstract: Imitation learning has emerged as a promising approach for addressing sequential decision-making problems, with the assumption that expert demonstrations are optimal. However, in real-world scenarios, expert demonstrations are often imperfect, leading to challenges in effectively applying imitation learning. While existing research has focused on optimizing with imperfect demonstrations, the training typically requires a certain proportion of optimal demonstrations to guarantee performance. To tackle these problems, we propose to purify the potential perturbations in imperfect demonstrations and subsequently conduct imitation learning from purified demonstrations. Motivated by the success of diffusion models, we introduce a two-step purification via the diffusion process. In the first step, we apply a forward diffusion process to effectively smooth out the potential perturbations in imperfect demonstrations by introducing additional noise. Subsequently, a reverse generative process is ",
    "path": "papers/23/10/2310.07143.json",
    "total_tokens": 853,
    "translated_title": "从纯净演示中进行模仿学习",
    "translated_abstract": "模仿学习已经成为解决顺序决策问题的一种有希望的方法，假设专家演示是最优的。然而，在现实世界中，专家演示通常是不完美的，导致在有效应用模仿学习时面临挑战。尽管现有研究已经着眼于优化不完美演示，但通常需要一定比例的最优演示来保证性能。为了解决这些问题，我们提出了在不完美演示中净化潜在扰动并随后从纯净演示中进行模仿学习的方法。受扩散模型的成功启发，我们引入了一个通过扩散过程进行的两步净化。在第一步中，我们应用正向扩散过程通过引入额外的噪声来有效地平滑不完美演示中的潜在扰动。随后，进行逆向生成过程。",
    "tldr": "本文提出了一种从纯净演示中进行模仿学习的方法，通过引入扩散过程对不完美演示中的潜在扰动进行净化。通过这种方法，可以改善模仿学习在真实场景中的应用挑战。",
    "en_tdlr": "This paper proposes a method of imitation learning from purified demonstrations, in which the potential perturbations in imperfect demonstrations are purified through a diffusion process. By using this method, the challenges of applying imitation learning in real-world scenarios can be addressed."
}