{
    "title": "Voice Conversion for Stuttered Speech, Instruments, Unseen Languages and Textually Described Voices. (arXiv:2310.08104v1 [eess.AS])",
    "abstract": "Voice conversion aims to convert source speech into a target voice using recordings of the target speaker as a reference. Newer models are producing increasingly realistic output. But what happens when models are fed with non-standard data, such as speech from a user with a speech impairment? We investigate how a recent voice conversion model performs on non-standard downstream voice conversion tasks. We use a simple but robust approach called k-nearest neighbors voice conversion (kNN-VC). We look at four non-standard applications: stuttered voice conversion, cross-lingual voice conversion, musical instrument conversion, and text-to-voice conversion. The latter involves converting to a target voice specified through a text description, e.g. \"a young man with a high-pitched voice\". Compared to an established baseline, we find that kNN-VC retains high performance in stuttered and cross-lingual voice conversion. Results are more mixed for the musical instrument and text-to-voice conversio",
    "link": "http://arxiv.org/abs/2310.08104",
    "context": "Title: Voice Conversion for Stuttered Speech, Instruments, Unseen Languages and Textually Described Voices. (arXiv:2310.08104v1 [eess.AS])\nAbstract: Voice conversion aims to convert source speech into a target voice using recordings of the target speaker as a reference. Newer models are producing increasingly realistic output. But what happens when models are fed with non-standard data, such as speech from a user with a speech impairment? We investigate how a recent voice conversion model performs on non-standard downstream voice conversion tasks. We use a simple but robust approach called k-nearest neighbors voice conversion (kNN-VC). We look at four non-standard applications: stuttered voice conversion, cross-lingual voice conversion, musical instrument conversion, and text-to-voice conversion. The latter involves converting to a target voice specified through a text description, e.g. \"a young man with a high-pitched voice\". Compared to an established baseline, we find that kNN-VC retains high performance in stuttered and cross-lingual voice conversion. Results are more mixed for the musical instrument and text-to-voice conversio",
    "path": "papers/23/10/2310.08104.json",
    "total_tokens": 997,
    "translated_title": "针对口吃的语音、乐器、未知语言和以文本描述的声音的声音转换",
    "translated_abstract": "声音转换旨在使用目标讲话者的录音将源语音转换为目标声音。较新的模型产生了越来越逼真的输出。但是，当模型接收非标准数据时，例如来自具有语言障碍的用户的语音，会发生什么情况呢？我们研究了最新的声音转换模型在非标准下游声音转换任务上的表现。我们使用了一种简单而健壮的方法，称为k最近邻声音转换（kNN-VC）。我们研究了四个非标准的应用：口吃的声音转换，跨语言的声音转换，乐器的声音转换和文本到声音的转换。后者涉及将声音转换为通过文本描述指定的目标声音，例如“一个年轻男子的尖声”。与已建立的基准相比，我们发现kNN-VC在口吃和跨语言声音转换方面保持了较高的性能。对于乐器和文本到声音的转换而言，结果更加复杂。",
    "tldr": "这项研究调查了最新的声音转换模型在口吃、跨语言、乐器和文本描述声音等非标准任务上的表现。研究发现，在口吃和跨语言声音转换方面，kNN-VC方法保持了较高的性能，而乐器和文本到声音的转换则有更复杂的结果。",
    "en_tdlr": "This study investigates the performance of the latest voice conversion models on non-standard tasks such as stuttered speech, cross-lingual conversion, musical instrument conversion, and text-to-voice conversion. The findings show that the kNN-VC method performs well in stuttered and cross-lingual voice conversion, while the results for musical instrument and text-to-voice conversion are more complex."
}