{
    "title": "Removing Dust from CMB Observations with Diffusion Models. (arXiv:2310.16285v1 [astro-ph.CO])",
    "abstract": "In cosmology, the quest for primordial $B$-modes in cosmic microwave background (CMB) observations has highlighted the critical need for a refined model of the Galactic dust foreground. We investigate diffusion-based modeling of the dust foreground and its interest for component separation. Under the assumption of a Gaussian CMB with known cosmology (or covariance matrix), we show that diffusion models can be trained on examples of dust emission maps such that their sampling process directly coincides with posterior sampling in the context of component separation. We illustrate this on simulated mixtures of dust emission and CMB. We show that common summary statistics (power spectrum, Minkowski functionals) of the components are well recovered by this process. We also introduce a model conditioned by the CMB cosmology that outperforms models trained using a single cosmology on component separation. Such a model will be used in future work for diffusion-based cosmological inference.",
    "link": "http://arxiv.org/abs/2310.16285",
    "context": "Title: Removing Dust from CMB Observations with Diffusion Models. (arXiv:2310.16285v1 [astro-ph.CO])\nAbstract: In cosmology, the quest for primordial $B$-modes in cosmic microwave background (CMB) observations has highlighted the critical need for a refined model of the Galactic dust foreground. We investigate diffusion-based modeling of the dust foreground and its interest for component separation. Under the assumption of a Gaussian CMB with known cosmology (or covariance matrix), we show that diffusion models can be trained on examples of dust emission maps such that their sampling process directly coincides with posterior sampling in the context of component separation. We illustrate this on simulated mixtures of dust emission and CMB. We show that common summary statistics (power spectrum, Minkowski functionals) of the components are well recovered by this process. We also introduce a model conditioned by the CMB cosmology that outperforms models trained using a single cosmology on component separation. Such a model will be used in future work for diffusion-based cosmological inference.",
    "path": "papers/23/10/2310.16285.json",
    "total_tokens": 980,
    "translated_title": "用扩散模型去除CMB观测中的尘埃",
    "translated_abstract": "在宇宙学中，追寻宇宙微波背景(CMB)观测中的原始$B$-mode，突出了对银河尘埃前景的精确建模的关键需求。我们研究了基于扩散的尘埃前景建模及其在成分分离中的意义。在假设具有已知宇宙学(或协方差矩阵)的高斯CMB的前提下，我们证明了扩散模型可以在尘埃辐射地图的实例上进行训练，使其采样过程直接与成分分离上下文中的后验采样相一致。我们用模拟的尘埃辐射和CMB的混合物来说明这一点。我们展示了通过这个过程可以很好地恢复组分的常见摘要统计量(功率谱、闵可夫斯基函数)。我们还引入了与CMB宇宙学条件相结合的模型，比单一宇宙学训练的模型在成分分离中表现更好。这样的模型将在未来的工作中用于基于扩散的宇宙学推断。",
    "tldr": "本文研究了使用扩散模型去除CMB观测中的尘埃的方法，并发现扩散模型可以很好地模拟尘埃前景并进行成分分离。我们还引入了一种与CMB宇宙学条件相结合的模型，在成分分离中表现出更好的性能。"
}