{
    "title": "Reinforcement Learning in a Safety-Embedded MDP with Trajectory Optimization. (arXiv:2310.06903v1 [cs.RO])",
    "abstract": "Safe Reinforcement Learning (RL) plays an important role in applying RL algorithms to safety-critical real-world applications, addressing the trade-off between maximizing rewards and adhering to safety constraints. This work introduces a novel approach that combines RL with trajectory optimization to manage this trade-off effectively. Our approach embeds safety constraints within the action space of a modified Markov Decision Process (MDP). The RL agent produces a sequence of actions that are transformed into safe trajectories by a trajectory optimizer, thereby effectively ensuring safety and increasing training stability. This novel approach excels in its performance on challenging Safety Gym tasks, achieving significantly higher rewards and near-zero safety violations during inference. The method's real-world applicability is demonstrated through a safe and effective deployment in a real robot task of box-pushing around obstacles.",
    "link": "http://arxiv.org/abs/2310.06903",
    "context": "Title: Reinforcement Learning in a Safety-Embedded MDP with Trajectory Optimization. (arXiv:2310.06903v1 [cs.RO])\nAbstract: Safe Reinforcement Learning (RL) plays an important role in applying RL algorithms to safety-critical real-world applications, addressing the trade-off between maximizing rewards and adhering to safety constraints. This work introduces a novel approach that combines RL with trajectory optimization to manage this trade-off effectively. Our approach embeds safety constraints within the action space of a modified Markov Decision Process (MDP). The RL agent produces a sequence of actions that are transformed into safe trajectories by a trajectory optimizer, thereby effectively ensuring safety and increasing training stability. This novel approach excels in its performance on challenging Safety Gym tasks, achieving significantly higher rewards and near-zero safety violations during inference. The method's real-world applicability is demonstrated through a safe and effective deployment in a real robot task of box-pushing around obstacles.",
    "path": "papers/23/10/2310.06903.json",
    "total_tokens": 904,
    "translated_title": "在具有轨迹优化的安全嵌入式MDP中的强化学习",
    "translated_abstract": "安全强化学习在将强化学习算法应用于安全关键的实际应用中起着重要的作用，解决了最大化奖励和遵守安全约束之间的权衡。本文介绍了一种新颖的方法，将强化学习与轨迹优化相结合，有效地管理这种权衡。我们的方法将安全约束嵌入到修改后的马尔可夫决策过程（MDP）的动作空间中。强化学习代理通过轨迹优化器产生一系列行动，这些行动转化为安全轨迹，从而有效确保安全并提高训练稳定性。这种新颖的方法在挑战性的Safety Gym任务的性能方面表现出色，在推理过程中实现了显著更高的奖励和几乎零的安全违规。该方法在一个真实机器人任务中的应用性得到了证明，该任务涉及推动箱子穿过障碍物。",
    "tldr": "本文介绍了一种在安全嵌入式MDP中结合轨迹优化的强化学习方法，通过将安全约束嵌入动作空间，能够有效地在最大化奖励和遵守安全约束之间取得平衡，并在挑战性任务中取得了优异性能。",
    "en_tdlr": "This paper presents a novel approach that combines reinforcement learning with trajectory optimization in a safety-embedded MDP. By embedding safety constraints in the action space, this method effectively balances between maximizing rewards and adhering to safety constraints, achieving excellent performance in challenging tasks."
}