{
    "title": "Are Generation Z Less Car-centric Than Millennials? A Nationwide Analysis Through the Lens of Youth Licensing. (arXiv:2310.04906v1 [econ.GN])",
    "abstract": "The debate on whether young Americans are becoming less reliant on automobiles is still ongoing. This research compares driver's license acquisition patterns between Millennials and their succeeding Generation Z during late adolescence. It also examines factors influencing teenagers' decisions to obtain driver's licenses. The findings suggest that the decline in licensing rates may be attributed in part to generational shifts in attitudes and cultural changes, such as Generation Z's inclination toward educational trips and their digital upbringing. This research underscores the implications for planners, practitioners, and policymakers in adapting to potential shifts in American car culture.",
    "link": "http://arxiv.org/abs/2310.04906",
    "context": "Title: Are Generation Z Less Car-centric Than Millennials? A Nationwide Analysis Through the Lens of Youth Licensing. (arXiv:2310.04906v1 [econ.GN])\nAbstract: The debate on whether young Americans are becoming less reliant on automobiles is still ongoing. This research compares driver's license acquisition patterns between Millennials and their succeeding Generation Z during late adolescence. It also examines factors influencing teenagers' decisions to obtain driver's licenses. The findings suggest that the decline in licensing rates may be attributed in part to generational shifts in attitudes and cultural changes, such as Generation Z's inclination toward educational trips and their digital upbringing. This research underscores the implications for planners, practitioners, and policymakers in adapting to potential shifts in American car culture.",
    "path": "papers/23/10/2310.04906.json",
    "total_tokens": 788,
    "translated_title": "Generation Z比千禧一代更不依赖于汽车吗？通过对青少年驾照情况的全国分析来看待这个问题",
    "translated_abstract": "关于年轻美国人是否越来越不依赖于汽车的争论仍在进行中。这项研究比较了千禧一代和下一代Z世代在晚期青少年时期获得驾照的模式，并研究了影响青少年决定获得驾照的因素。研究结果表明，驾照领取率下降可能部分归因于世代间态度和文化变化的转变，比如Z世代倾向于教育性旅行和数字化成长。这项研究突出了规划者、从业人员和决策者在适应美国汽车文化潜在转变方面的重要性。",
    "tldr": "这项研究通过比较千禧一代和Z世代的驾照获得模式，发现驾照领取率下降一部分原因是世代间态度和文化转变，提示规划者和决策者需要适应美国汽车文化的潜在变化。",
    "en_tdlr": "This research compares driver's license acquisition patterns between Millennials and Generation Z, finding that the decline in licensing rates may be attributed to generational shifts in attitudes and cultural changes, indicating the need for planners and policymakers to adapt to potential shifts in American car culture."
}