{
    "title": "On sparse regression, Lp-regularization, and automated model discovery. (arXiv:2310.06872v1 [cs.LG])",
    "abstract": "Sparse regression and feature extraction are the cornerstones of knowledge discovery from massive data. Their goal is to discover interpretable and predictive models that provide simple relationships among scientific variables. While the statistical tools for model discovery are well established in the context of linear regression, their generalization to nonlinear regression in material modeling is highly problem-specific and insufficiently understood. Here we explore the potential of neural networks for automatic model discovery and induce sparsity by a hybrid approach that combines two strategies: regularization and physical constraints. We integrate the concept of Lp regularization for subset selection with constitutive neural networks that leverage our domain knowledge in kinematics and thermodynamics. We train our networks with both, synthetic and real data, and perform several thousand discovery runs to infer common guidelines and trends: L2 regularization or ridge regression is",
    "link": "http://arxiv.org/abs/2310.06872",
    "context": "Title: On sparse regression, Lp-regularization, and automated model discovery. (arXiv:2310.06872v1 [cs.LG])\nAbstract: Sparse regression and feature extraction are the cornerstones of knowledge discovery from massive data. Their goal is to discover interpretable and predictive models that provide simple relationships among scientific variables. While the statistical tools for model discovery are well established in the context of linear regression, their generalization to nonlinear regression in material modeling is highly problem-specific and insufficiently understood. Here we explore the potential of neural networks for automatic model discovery and induce sparsity by a hybrid approach that combines two strategies: regularization and physical constraints. We integrate the concept of Lp regularization for subset selection with constitutive neural networks that leverage our domain knowledge in kinematics and thermodynamics. We train our networks with both, synthetic and real data, and perform several thousand discovery runs to infer common guidelines and trends: L2 regularization or ridge regression is",
    "path": "papers/23/10/2310.06872.json",
    "total_tokens": 892,
    "translated_title": "关于稀疏回归、Lp正则化和自动模型发现的论文",
    "translated_abstract": "稀疏回归和特征提取是从大规模数据中进行知识发现的基础。它们的目标是发现能够提供科学变量之间简单关系的可解释和预测模型。虽然在线性回归的模型发现方面的统计工具已经得到很好地建立，但在材料建模中将其推广到非线性回归是高度问题特定且理解不够充分的。在这里，我们探索了神经网络在自动模型发现中的潜力，并通过结合两种策略的混合方法来引入稀疏性：正则化和物理约束。我们将Lp正则化的概念与基于本领域在运动学和热力学方面的知识的构成神经网络相结合。我们使用合成数据和真实数据对网络进行训练，并进行了几千次发现运行来推断出共同的指导方针和趋势：L2正则化或岭回归是最佳的选择。",
    "tldr": "该论文通过结合正则化和物理约束的方法，利用神经网络进行自动模型发现，探索了非线性回归中稀疏回归和特征提取的潜力，并针对材料建模提出了常见的指导方针和趋势。",
    "en_tdlr": "This paper explores the potential of neural networks for automated model discovery in nonlinear regression, using a hybrid approach that combines regularization and physical constraints. It introduces the concept of Lp regularization for subset selection and provides common guidelines and trends for material modeling."
}