{
    "title": "A Framework for Treating Model Uncertainty in the Asset Liability Management Problem. (arXiv:2310.11987v1 [q-fin.PM])",
    "abstract": "The problem of asset liability management (ALM) is a classic problem of the financial mathematics and of great interest for the banking institutions and insurance companies. Several formulations of this problem under various model settings have been studied under the Mean-Variance (MV) principle perspective. In this paper, the ALM problem is revisited under the context of model uncertainty in the one-stage framework. In practice, uncertainty issues appear to several aspects of the problem, e.g. liability process characteristics, market conditions, inflation rates, inside information effects, etc. A framework relying on the notion of the Wasserstein barycenter is presented which is able to treat robustly this type of ambiguities by appropriate handling the various information sources (models) and appropriately reformulating the relevant decision making problem. The proposed framework can be applied to a number of different model settings leading to the selection of investment portfolios",
    "link": "http://arxiv.org/abs/2310.11987",
    "context": "Title: A Framework for Treating Model Uncertainty in the Asset Liability Management Problem. (arXiv:2310.11987v1 [q-fin.PM])\nAbstract: The problem of asset liability management (ALM) is a classic problem of the financial mathematics and of great interest for the banking institutions and insurance companies. Several formulations of this problem under various model settings have been studied under the Mean-Variance (MV) principle perspective. In this paper, the ALM problem is revisited under the context of model uncertainty in the one-stage framework. In practice, uncertainty issues appear to several aspects of the problem, e.g. liability process characteristics, market conditions, inflation rates, inside information effects, etc. A framework relying on the notion of the Wasserstein barycenter is presented which is able to treat robustly this type of ambiguities by appropriate handling the various information sources (models) and appropriately reformulating the relevant decision making problem. The proposed framework can be applied to a number of different model settings leading to the selection of investment portfolios",
    "path": "papers/23/10/2310.11987.json",
    "total_tokens": 880,
    "translated_title": "在资产负债管理问题中处理模型不确定性的框架",
    "translated_abstract": "资产负债管理(ALM)问题是金融数学的经典问题，对银行和保险公司非常重要。在均值-方差(MV)原则的视角下，已经对此问题在多种模型设置下进行了研究。本文在一阶框架下重新审视了模型不确定性的ALM问题。在实践中，不确定性问题涉及问题的多个方面，如负债过程特性，市场条件，通货膨胀率，内部信息效应等。本文提出了一个依赖于Wasserstein巴黎中心概念的框架，能够通过适当处理各种信息来源(模型)并适当重新制定相关的决策问题，从而稳健地处理这种类型的模糊性。所提出的框架可以应用于许多不同的模型设置，导致投资组合的选择。",
    "tldr": "本文提出了一个框架，用于在资产负债管理问题中处理模型不确定性。利用Wasserstein巴黎中心思想，通过适当处理不同信息来源并重新制定决策问题，稳健地处理模糊性。所提出的框架适用于不同模型设置下的投资组合选择。",
    "en_tdlr": "This paper presents a framework for treating model uncertainty in the asset liability management problem. By relying on the Wasserstein barycenter concept and appropriately handling different information sources, the framework robustly handles ambiguity and can be applied to investment portfolio selection in various model settings."
}