{
    "title": "Resolving a Clearing Member's Default, A Radner Equilibrium Approach. (arXiv:2310.02608v1 [q-fin.RM])",
    "abstract": "For vanilla derivatives that constitute the bulk of investment banks' hedging portfolios, central clearing through central counterparties (CCPs) has become hegemonic. A key mandate of a CCP is to provide an efficient and proper clearing member default resolution procedure. When a clearing member defaults, the CCP can hedge and auction or liquidate its positions. The counterparty credit risk cost of auctioning has been analyzed in terms of XVA metrics in Bastide, Cr{\\'e}pey, Drapeau, and Tadese (2023). In this work we assess the costs of hedging or liquidating. This is done by comparing pre- and post-default market equilibria, using a Radner equilibrium approach for portfolio allocation and price discovery in each case. We show that the Radner equilibria uniquely exist and we provide both analytical and numerical solutions for the latter in elliptically distributed markets. Using such tools, a CCP could decide rationally on which market to hedge and auction or liquidate defaulted portfo",
    "link": "http://arxiv.org/abs/2310.02608",
    "context": "Title: Resolving a Clearing Member's Default, A Radner Equilibrium Approach. (arXiv:2310.02608v1 [q-fin.RM])\nAbstract: For vanilla derivatives that constitute the bulk of investment banks' hedging portfolios, central clearing through central counterparties (CCPs) has become hegemonic. A key mandate of a CCP is to provide an efficient and proper clearing member default resolution procedure. When a clearing member defaults, the CCP can hedge and auction or liquidate its positions. The counterparty credit risk cost of auctioning has been analyzed in terms of XVA metrics in Bastide, Cr{\\'e}pey, Drapeau, and Tadese (2023). In this work we assess the costs of hedging or liquidating. This is done by comparing pre- and post-default market equilibria, using a Radner equilibrium approach for portfolio allocation and price discovery in each case. We show that the Radner equilibria uniquely exist and we provide both analytical and numerical solutions for the latter in elliptically distributed markets. Using such tools, a CCP could decide rationally on which market to hedge and auction or liquidate defaulted portfo",
    "path": "papers/23/10/2310.02608.json",
    "total_tokens": 964,
    "translated_title": "解决结算成员违约问题的Radner均衡方法",
    "translated_abstract": "对于构成投资银行对冲投资组合主要部分的标准衍生品，通过中央对手方（CCP）进行中央清算已成为主导。CCP的关键任务之一是提供高效和适当的清算成员违约解决程序。当清算成员违约时，CCP可以对其头寸进行对冲和拍卖或清算。拍卖的对手方信用风险成本已经在Bastide、Crépey、Drapeau和Tadese（2023）中用XVA指标进行了分析。在这项工作中，我们评估对冲或清算的成本。通过比较违约前后的市场均衡，使用Radner均衡方法对投资组合配置和价格发现进行了研究。我们展示了Radner均衡的独特存在，并为椭圆分布市场中的后者提供了解析和数值解。使用这些工具，CCP可以理性地决定在哪个市场对冲和拍卖或清算违约的投资组合。",
    "tldr": "本研究通过使用Radner均衡方法，评估了清算成员违约的对冲和清算成本，并提供了相应的解析和数值解。这为中央对手方（CCP）在决定在哪个市场对冲和拍卖或清算违约的投资组合时提供了理性的决策依据。",
    "en_tdlr": "This paper evaluates the costs of hedging and liquidating a clearing member's default using a Radner equilibrium approach and provides analytical and numerical solutions. It offers a rational decision-making basis for central counterparties (CCPs) in determining which market to hedge and auction or liquidate defaulted portfolios."
}