{
    "title": "Towards Hybrid-grained Feature Interaction Selection for Deep Sparse Network. (arXiv:2310.15342v1 [cs.LG])",
    "abstract": "Deep sparse networks are widely investigated as a neural network architecture for prediction tasks with high-dimensional sparse features, with which feature interaction selection is a critical component. While previous methods primarily focus on how to search feature interaction in a coarse-grained space, less attention has been given to a finer granularity. In this work, we introduce a hybrid-grained feature interaction selection approach that targets both feature field and feature value for deep sparse networks. To explore such expansive space, we propose a decomposed space which is calculated on the fly. We then develop a selection algorithm called OptFeature, which efficiently selects the feature interaction from both the feature field and the feature value simultaneously. Results from experiments on three large real-world benchmark datasets demonstrate that OptFeature performs well in terms of accuracy and efficiency. Additional studies support the feasibility of our method.",
    "link": "http://arxiv.org/abs/2310.15342",
    "context": "Title: Towards Hybrid-grained Feature Interaction Selection for Deep Sparse Network. (arXiv:2310.15342v1 [cs.LG])\nAbstract: Deep sparse networks are widely investigated as a neural network architecture for prediction tasks with high-dimensional sparse features, with which feature interaction selection is a critical component. While previous methods primarily focus on how to search feature interaction in a coarse-grained space, less attention has been given to a finer granularity. In this work, we introduce a hybrid-grained feature interaction selection approach that targets both feature field and feature value for deep sparse networks. To explore such expansive space, we propose a decomposed space which is calculated on the fly. We then develop a selection algorithm called OptFeature, which efficiently selects the feature interaction from both the feature field and the feature value simultaneously. Results from experiments on three large real-world benchmark datasets demonstrate that OptFeature performs well in terms of accuracy and efficiency. Additional studies support the feasibility of our method.",
    "path": "papers/23/10/2310.15342.json",
    "total_tokens": 873,
    "translated_title": "面向深度稀疏网络的混合粒度特征交互选择方法",
    "translated_abstract": "深度稀疏网络被广泛研究作为具有高维稀疏特征的预测任务的神经网络架构，其中特征交互选择是一个关键组成部分。然而，先前的方法主要集中在如何在粗粒度空间中搜索特征交互，对于更细粒度的细节则关注较少。在这项工作中，我们引入了一种针对深度稀疏网络的混合粒度特征交互选择方法，旨在同时考虑特征域和特征值。为了探索这样广阔的空间，我们提出了一种即时计算的分解空间。然后，我们开发了一个名为OptFeature的选择算法，它可以有效地从特征域和特征值同时选择特征交互。在三个大型真实世界基准数据集的实验结果表明，OptFeature在准确性和效率方面表现良好。额外的研究支持了我们方法的可行性。",
    "tldr": "本论文提出了一种针对深度稀疏网络的混合粒度特征交互选择方法，能够同时考虑特征域和特征值，实验证明该方法在准确性和效率方面表现良好。",
    "en_tdlr": "This paper proposes a hybrid-grained feature interaction selection approach for deep sparse networks, which considers both feature field and feature value. Experimental results demonstrate that the method performs well in terms of accuracy and efficiency."
}