{
    "title": "Harmonic Control Lyapunov Barrier Functions for Constrained Optimal Control with Reach-Avoid Specifications. (arXiv:2310.02869v1 [math.OC])",
    "abstract": "This paper introduces harmonic control Lyapunov barrier functions (harmonic CLBF) that aid in constrained control problems such as reach-avoid problems. Harmonic CLBFs exploit the maximum principle that harmonic functions satisfy to encode the properties of control Lyapunov barrier functions (CLBFs). As a result, they can be initiated at the start of an experiment rather than trained based on sample trajectories. The control inputs are selected to maximize the inner product of the system dynamics with the steepest descent direction of the harmonic CLBF. Numerical results are presented with four different systems under different reach-avoid environments. Harmonic CLBFs show a significantly low risk of entering unsafe regions and a high probability of entering the goal region.",
    "link": "http://arxiv.org/abs/2310.02869",
    "context": "Title: Harmonic Control Lyapunov Barrier Functions for Constrained Optimal Control with Reach-Avoid Specifications. (arXiv:2310.02869v1 [math.OC])\nAbstract: This paper introduces harmonic control Lyapunov barrier functions (harmonic CLBF) that aid in constrained control problems such as reach-avoid problems. Harmonic CLBFs exploit the maximum principle that harmonic functions satisfy to encode the properties of control Lyapunov barrier functions (CLBFs). As a result, they can be initiated at the start of an experiment rather than trained based on sample trajectories. The control inputs are selected to maximize the inner product of the system dynamics with the steepest descent direction of the harmonic CLBF. Numerical results are presented with four different systems under different reach-avoid environments. Harmonic CLBFs show a significantly low risk of entering unsafe regions and a high probability of entering the goal region.",
    "path": "papers/23/10/2310.02869.json",
    "total_tokens": 908,
    "translated_title": "使用谐波控制李亚普诺夫障碍函数解决有约束的最优控制问题与避障要求",
    "translated_abstract": "本文介绍了谐波控制李亚普诺夫障碍函数（harmonic CLBF），它有助于解决诸如避障问题等的约束控制问题。谐波CLBF利用谐波函数满足的最大值原理来编码控制李亚普诺夫障碍函数的属性。因此，它们可以在实验开始时初始化，而不是基于样本轨迹进行训练。控制输入被选择为最大化系统动力学与谐波CLBF最陡下降方向的内积。数值结果在不同的避障环境下展示了四个不同系统的情况。谐波CLBF显示出进入不安全区域的风险显著降低，进入目标区域的概率高。",
    "tldr": "该论文介绍了谐波控制李亚普诺夫障碍函数（harmonic CLBF），它可以在约束控制问题中解决避障要求，通过最大化系统动力学与谐波CLBF最陡下降方向的内积来选择控制输入，从而显著降低进入不安全区域的风险并提高进入目标区域的概率。",
    "en_tdlr": "This paper introduces harmonic control Lyapunov barrier functions (harmonic CLBFs) that address reach-avoid requirements in constrained control problems, by maximizing the inner product of the system dynamics with the steepest descent direction of the harmonic CLBFs, significantly reducing the risk of entering unsafe regions and increasing the probability of reaching the goal region."
}