{
    "title": "Unsupervised Complex Semi-Binary Matrix Factorization for Activation Sequence Recovery of Quasi-Stationary Sources. (arXiv:2310.02295v1 [cs.LG])",
    "abstract": "Advocating for a sustainable, resilient and human-centric industry, the three pillars of Industry 5.0 call for an increased understanding of industrial processes and manufacturing systems, as well as their energy sustainability. One of the most fundamental elements of comprehension is knowing when the systems are operated, as this is key to locating energy intensive subsystems and operations. Such knowledge is often lacking in practice. Activation statuses can be recovered from sensor data though. Some non-intrusive sensors (accelerometers, current sensors, etc.) acquire mixed signals containing information about multiple actuators at once. Despite their low cost as regards the fleet of systems they monitor, additional signal processing is required to extract the individual activation sequences. To that end, sparse regression techniques can extract leading dynamics in sequential data. Notorious dictionary learning algorithms have proven effective in this regard. This paper considers di",
    "link": "http://arxiv.org/abs/2310.02295",
    "context": "Title: Unsupervised Complex Semi-Binary Matrix Factorization for Activation Sequence Recovery of Quasi-Stationary Sources. (arXiv:2310.02295v1 [cs.LG])\nAbstract: Advocating for a sustainable, resilient and human-centric industry, the three pillars of Industry 5.0 call for an increased understanding of industrial processes and manufacturing systems, as well as their energy sustainability. One of the most fundamental elements of comprehension is knowing when the systems are operated, as this is key to locating energy intensive subsystems and operations. Such knowledge is often lacking in practice. Activation statuses can be recovered from sensor data though. Some non-intrusive sensors (accelerometers, current sensors, etc.) acquire mixed signals containing information about multiple actuators at once. Despite their low cost as regards the fleet of systems they monitor, additional signal processing is required to extract the individual activation sequences. To that end, sparse regression techniques can extract leading dynamics in sequential data. Notorious dictionary learning algorithms have proven effective in this regard. This paper considers di",
    "path": "papers/23/10/2310.02295.json",
    "total_tokens": 909,
    "translated_title": "无监督复杂半二进制矩阵分解用于拟静止源激活序列恢复",
    "translated_abstract": "在推动可持续、具有韧性和以人为中心的工业的同时，工业5.0的三个支柱需要增加对工业过程和制造系统以及其能源可持续性的理解。理解的一个基本要素是知道系统何时运行，这对定位高能耗子系统和操作至关重要。然而，实践中常常缺乏这样的知识。可以通过传感器数据恢复激活状态。一些非侵入式传感器（加速度计、电流传感器等）获取包含多个执行器信息的混合信号。尽管它们监测的系统成本低廉，但需要额外的信号处理来提取个体激活序列。为此，稀疏回归技术可以提取序列数据中的主要动态。著名的字典学习算法在这方面已经被证明是有效的。本文考虑了一种算法来处理这个问题。",
    "tldr": "本文提出了一种无监督复杂半二进制矩阵分解算法，用于恢复拟静止源的激活序列。这种算法能够通过传感器数据提取个体激活序列，并对工业过程和制造系统的能源可持续性研究提供帮助。",
    "en_tdlr": "This paper proposes an unsupervised complex semi-binary matrix factorization algorithm for recovering the activation sequence of quasi-stationary sources. This algorithm can extract individual activation sequences from sensor data and contribute to the research on energy sustainability of industrial processes and manufacturing systems."
}