{
    "title": "TSONN: Time-stepping-oriented neural network for solving partial differential equations. (arXiv:2310.16491v1 [cs.LG])",
    "abstract": "Deep neural networks (DNNs), especially physics-informed neural networks (PINNs), have recently become a new popular method for solving forward and inverse problems governed by partial differential equations (PDEs). However, these methods still face challenges in achieving stable training and obtaining correct results in many problems, since minimizing PDE residuals with PDE-based soft constraint make the problem ill-conditioned. Different from all existing methods that directly minimize PDE residuals, this work integrates time-stepping method with deep learning, and transforms the original ill-conditioned optimization problem into a series of well-conditioned sub-problems over given pseudo time intervals. The convergence of model training is significantly improved by following the trajectory of the pseudo time-stepping process, yielding a robust optimization-based PDE solver. Our results show that the proposed method achieves stable training and correct results in many problems that s",
    "link": "http://arxiv.org/abs/2310.16491",
    "context": "Title: TSONN: Time-stepping-oriented neural network for solving partial differential equations. (arXiv:2310.16491v1 [cs.LG])\nAbstract: Deep neural networks (DNNs), especially physics-informed neural networks (PINNs), have recently become a new popular method for solving forward and inverse problems governed by partial differential equations (PDEs). However, these methods still face challenges in achieving stable training and obtaining correct results in many problems, since minimizing PDE residuals with PDE-based soft constraint make the problem ill-conditioned. Different from all existing methods that directly minimize PDE residuals, this work integrates time-stepping method with deep learning, and transforms the original ill-conditioned optimization problem into a series of well-conditioned sub-problems over given pseudo time intervals. The convergence of model training is significantly improved by following the trajectory of the pseudo time-stepping process, yielding a robust optimization-based PDE solver. Our results show that the proposed method achieves stable training and correct results in many problems that s",
    "path": "papers/23/10/2310.16491.json",
    "total_tokens": 890,
    "translated_title": "TSONN: 时间步导向的神经网络用于求解偏微分方程",
    "translated_abstract": "深度神经网络（DNNs），尤其是受物理启发的神经网络（PINNs），最近成为求解由偏微分方程（PDEs）决定的正向和反向问题的新热门方法。然而，由于使用基于PDE的软约束来最小化PDE残差，这些方法仍然面临着在许多问题中实现稳定训练和获得正确结果的挑战，因为这使得问题条件不良。与所有现有的直接最小化PDE残差的方法不同，本文将时间步方法与深度学习相结合，将原本的条件不良优化问题转化为一系列在给定伪时间间隔内具有良好条件的子问题。通过跟踪伪时间步进过程的轨迹，模型训练的收敛性得到显著改善，从而得到了稳健的基于优化的PDE求解器。我们的结果表明，所提出的方法在许多问题中实现了稳定的训练和正确的结果。",
    "tldr": "TSONN是一种将时间步方法与深度学习相结合的神经网络，通过将原始问题转化为一系列良好条件的子问题来解决PDE求解中的稳定训练和正确结果的挑战。"
}