{
    "title": "Contextual Biasing with the Knuth-Morris-Pratt Matching Algorithm. (arXiv:2310.00178v1 [cs.CL])",
    "abstract": "Contextual biasing refers to the problem of biasing the automatic speech recognition (ASR) systems towards rare entities that are relevant to the specific user or application scenarios. We propose algorithms for contextual biasing based on the Knuth-Morris-Pratt algorithm for pattern matching. During beam search, we boost the score of a token extension if it extends matching into a set of biasing phrases. Our method simulates the classical approaches often implemented in the weighted finite state transducer (WFST) framework, but avoids the FST language altogether, with careful considerations on memory footprint and efficiency on tensor processing units (TPUs) by vectorization. Without introducing additional model parameters, our method achieves significant word error rate (WER) reductions on biasing test sets by itself, and yields further performance gain when combined with a model-based biasing method.",
    "link": "http://arxiv.org/abs/2310.00178",
    "context": "Title: Contextual Biasing with the Knuth-Morris-Pratt Matching Algorithm. (arXiv:2310.00178v1 [cs.CL])\nAbstract: Contextual biasing refers to the problem of biasing the automatic speech recognition (ASR) systems towards rare entities that are relevant to the specific user or application scenarios. We propose algorithms for contextual biasing based on the Knuth-Morris-Pratt algorithm for pattern matching. During beam search, we boost the score of a token extension if it extends matching into a set of biasing phrases. Our method simulates the classical approaches often implemented in the weighted finite state transducer (WFST) framework, but avoids the FST language altogether, with careful considerations on memory footprint and efficiency on tensor processing units (TPUs) by vectorization. Without introducing additional model parameters, our method achieves significant word error rate (WER) reductions on biasing test sets by itself, and yields further performance gain when combined with a model-based biasing method.",
    "path": "papers/23/10/2310.00178.json",
    "total_tokens": 831,
    "translated_title": "用Knuth-Morris-Pratt匹配算法进行上下文偏置",
    "translated_abstract": "上下文偏置指的是将自动语音识别（ASR）系统偏向于特定用户或应用场景相关的稀有实体的问题。我们提出了基于Knuth-Morris-Pratt算法的上下文偏置算法。在搜索过程中，如果一个令牌扩展将匹配扩展到一组偏置短语中，我们会提高其分数。我们的方法模拟了常常在加权有限状态转换器（WFST）框架中实现的经典方法，但完全避免了FST语言，并在张量处理单元（TPU）的内存占用和效率方面进行了仔细的考虑。我们的方法在不引入额外的模型参数的情况下，单独实现在偏置测试集上显著降低了词错误率（WER），并在与基于模型的偏置方法相结合时产生进一步的性能提升。",
    "tldr": "本文提出了一种基于Knuth-Morris-Pratt算法的上下文偏置方法，通过在搜索过程中提高匹配到一组偏置短语的扩展令牌的得分，实现了在偏置测试集上显著降低词错误率的效果，并与基于模型的偏置方法相结合能够进一步提升性能。"
}