{
    "title": "A Machine Learning-Based Framework for Clustering Residential Electricity Load Profiles to Enhance Demand Response Programs. (arXiv:2310.20367v1 [cs.LG])",
    "abstract": "Load shapes derived from smart meter data are frequently employed to analyze daily energy consumption patterns, particularly in the context of applications like Demand Response (DR). Nevertheless, one of the most important challenges to this endeavor lies in identifying the most suitable consumer clusters with similar consumption behaviors. In this paper, we present a novel machine learning based framework in order to achieve optimal load profiling through a real case study, utilizing data from almost 5000 households in London. Four widely used clustering algorithms are applied specifically K-means, K-medoids, Hierarchical Agglomerative Clustering and Density-based Spatial Clustering. An empirical analysis as well as multiple evaluation metrics are leveraged to assess those algorithms. Following that, we redefine the problem as a probabilistic classification one, with the classifier emulating the behavior of a clustering algorithm,leveraging Explainable AI (xAI) to enhance the interpre",
    "link": "http://arxiv.org/abs/2310.20367",
    "context": "Title: A Machine Learning-Based Framework for Clustering Residential Electricity Load Profiles to Enhance Demand Response Programs. (arXiv:2310.20367v1 [cs.LG])\nAbstract: Load shapes derived from smart meter data are frequently employed to analyze daily energy consumption patterns, particularly in the context of applications like Demand Response (DR). Nevertheless, one of the most important challenges to this endeavor lies in identifying the most suitable consumer clusters with similar consumption behaviors. In this paper, we present a novel machine learning based framework in order to achieve optimal load profiling through a real case study, utilizing data from almost 5000 households in London. Four widely used clustering algorithms are applied specifically K-means, K-medoids, Hierarchical Agglomerative Clustering and Density-based Spatial Clustering. An empirical analysis as well as multiple evaluation metrics are leveraged to assess those algorithms. Following that, we redefine the problem as a probabilistic classification one, with the classifier emulating the behavior of a clustering algorithm,leveraging Explainable AI (xAI) to enhance the interpre",
    "path": "papers/23/10/2310.20367.json",
    "total_tokens": 959,
    "translated_title": "基于机器学习的框架用于对住宅电力负荷轮廓进行聚类以增强需求响应计划",
    "translated_abstract": "智能电表数据衍生出的负荷曲线经常被用于分析日常能源消耗模式，特别是在需求响应（DR）等应用领域。然而，这个工作最重要的挑战之一在于识别具有类似消耗行为的最合适的消费者群体。本文提出了一种新颖的基于机器学习的框架，通过一个实际案例研究，利用伦敦近5000户家庭的数据实现最佳负荷轮廓。具体应用了四种广泛使用的聚类算法，包括K-means、K-medoids、层次凝聚聚类和基于密度的空间聚类。还利用经验分析和多个评估指标来评估这些算法。之后，我们将问题重新定义为概率分类问题，分类器模拟聚类算法的行为，利用可解释的人工智能（xAI）来增强解释性。",
    "tldr": "本文提出一种基于机器学习的框架，通过对住宅电力负荷轮廓进行聚类，增强需求响应计划。通过使用伦敦家庭的数据进行实证分析和多个评估指标，我们应用了四种聚类算法，并将问题重新定义为概率分类问题，利用可解释的人工智能（xAI）来增强解释性。"
}