{
    "title": "Unit Commitment Predictor With a Performance Guarantee: A Support Vector Machine Classifier. (arXiv:2310.08601v1 [math.OC])",
    "abstract": "The system operators usually need to solve large-scale unit commitment problems within limited time frame for computation. This paper provides a pragmatic solution, showing how by learning and predicting the on/off commitment decisions of conventional units, there is a potential for system operators to warm start their solver and speed up their computation significantly. For the prediction, we train linear and kernelized support vector machine classifiers, providing an out-of-sample performance guarantee if properly regularized, converting to distributionally robust classifiers. For the unit commitment problem, we solve a mixed-integer second-order cone problem. Our results based on the IEEE 6-bus and 118-bus test systems show that the kernelized SVM with proper regularization outperforms other classifiers, reducing the computational time by a factor of 1.7. In addition, if there is a tight computational limit, while the unit commitment problem without warm start is far away from the o",
    "link": "http://arxiv.org/abs/2310.08601",
    "context": "Title: Unit Commitment Predictor With a Performance Guarantee: A Support Vector Machine Classifier. (arXiv:2310.08601v1 [math.OC])\nAbstract: The system operators usually need to solve large-scale unit commitment problems within limited time frame for computation. This paper provides a pragmatic solution, showing how by learning and predicting the on/off commitment decisions of conventional units, there is a potential for system operators to warm start their solver and speed up their computation significantly. For the prediction, we train linear and kernelized support vector machine classifiers, providing an out-of-sample performance guarantee if properly regularized, converting to distributionally robust classifiers. For the unit commitment problem, we solve a mixed-integer second-order cone problem. Our results based on the IEEE 6-bus and 118-bus test systems show that the kernelized SVM with proper regularization outperforms other classifiers, reducing the computational time by a factor of 1.7. In addition, if there is a tight computational limit, while the unit commitment problem without warm start is far away from the o",
    "path": "papers/23/10/2310.08601.json",
    "total_tokens": 851,
    "translated_title": "带有性能保证的机组启停预测器：支持向量机分类器",
    "translated_abstract": "系统运营商通常需要在有限的时间内解决大规模的机组启停问题进行计算。本文提供了一种实用的解决方案，展示了通过学习和预测常规机组的启停决策，系统运营商有可能在求解器中使用预热启动并显著加速计算。对于预测，我们训练了线性和核化支持向量机分类器，提供了一种样本外性能保证（如果适当正则化），转化为分布鲁棒分类器。对于机组启停问题，我们求解了一个混合整数二阶锥问题。基于IEEE 6节点和118节点测试系统的结果表明，适当正则化的核化支持向量机优于其他分类器，将计算时间减少了1.7倍。此外，如果存在严格的计算限制，没有预热启动的机组启停问题与最优解的距离较远。",
    "tldr": "本文提出了一个带有性能保证的机组启停预测器，通过学习和预测常规机组的启停决策，系统运营商可以在求解器中使用预热启动并显著加速计算。对于预测，使用了适当正则化的核化支持向量机分类器，能将计算时间减少1.7倍。"
}