{
    "title": "Towards Automatic Design of Factorio Blueprints. (arXiv:2310.01505v1 [cs.AI])",
    "abstract": "Factorio is a 2D construction and management simulation video game about building automated factories to produce items of increasing complexity. A core feature of the game is its blueprint system, which allows players to easily save and replicate parts of their designs. Blueprints can reproduce any layout of objects in the game, but are typically used to encapsulate a complex behaviour, such as the production of a non-basic object. Once created, these blueprints are then used as basic building blocks, allowing the player to create a layer of abstraction. The usage of blueprints not only eases the expansion of the factory but also allows the sharing of designs with the game's community. The layout in a blueprint can be optimised using various criteria, such as the total space used or the final production throughput. The design of an optimal blueprint is a hard combinatorial problem, interleaving elements of many well-studied problems such as bin-packing, routing or network design. This ",
    "link": "http://arxiv.org/abs/2310.01505",
    "context": "Title: Towards Automatic Design of Factorio Blueprints. (arXiv:2310.01505v1 [cs.AI])\nAbstract: Factorio is a 2D construction and management simulation video game about building automated factories to produce items of increasing complexity. A core feature of the game is its blueprint system, which allows players to easily save and replicate parts of their designs. Blueprints can reproduce any layout of objects in the game, but are typically used to encapsulate a complex behaviour, such as the production of a non-basic object. Once created, these blueprints are then used as basic building blocks, allowing the player to create a layer of abstraction. The usage of blueprints not only eases the expansion of the factory but also allows the sharing of designs with the game's community. The layout in a blueprint can be optimised using various criteria, such as the total space used or the final production throughput. The design of an optimal blueprint is a hard combinatorial problem, interleaving elements of many well-studied problems such as bin-packing, routing or network design. This ",
    "path": "papers/23/10/2310.01505.json",
    "total_tokens": 814,
    "translated_title": "自动设计Factorio蓝图的研究",
    "translated_abstract": "Factorio是一款关于建造自动化工厂以生产越来越复杂物品的2D建设和管理模拟视频游戏。游戏的一个核心特性是其蓝图系统，允许玩家轻松保存和复制他们设计的部分。蓝图可以复制游戏中任何对象的布局，但通常用于封装复杂的行为，如非基本物品的生产。一旦创建，这些蓝图就可以用作基本构建块，使玩家可以创建一层抽象。使用蓝图不仅便于扩展工厂，还允许与游戏社区分享设计。蓝图中的布局可以根据各种标准进行优化，如总空间使用量或最终产量。设计最佳蓝图是一个困难的组合问题，交织了许多经过深入研究的问题，如装箱、路由或网络设计。",
    "tldr": "这项研究探索了自动设计Factorio蓝图的方法，为玩家提供了一种简化工厂扩展和设计分享的方式。",
    "en_tdlr": "This research explores methods for automatically designing Factorio blueprints, providing players with a way to simplify factory expansion and design sharing."
}