{
    "title": "Large Language Models: The Need for Nuance in Current Debates and a Pragmatic Perspective on Understanding. (arXiv:2310.19671v2 [cs.CL] UPDATED)",
    "abstract": "Current Large Language Models (LLMs) are unparalleled in their ability to generate grammatically correct, fluent text. LLMs are appearing rapidly, and debates on LLM capacities have taken off, but reflection is lagging behind. Thus, in this position paper, we first zoom in on the debate and critically assess three points recurring in critiques of LLM capacities: i) that LLMs only parrot statistical patterns in the training data; ii) that LLMs master formal but not functional language competence; and iii) that language learning in LLMs cannot inform human language learning. Drawing on empirical and theoretical arguments, we show that these points need more nuance. Second, we outline a pragmatic perspective on the issue of `real' understanding and intentionality in LLMs. Understanding and intentionality pertain to unobservable mental states we attribute to other humans because they have pragmatic value: they allow us to abstract away from complex underlying mechanics and predict behaviou",
    "link": "http://arxiv.org/abs/2310.19671",
    "context": "Title: Large Language Models: The Need for Nuance in Current Debates and a Pragmatic Perspective on Understanding. (arXiv:2310.19671v2 [cs.CL] UPDATED)\nAbstract: Current Large Language Models (LLMs) are unparalleled in their ability to generate grammatically correct, fluent text. LLMs are appearing rapidly, and debates on LLM capacities have taken off, but reflection is lagging behind. Thus, in this position paper, we first zoom in on the debate and critically assess three points recurring in critiques of LLM capacities: i) that LLMs only parrot statistical patterns in the training data; ii) that LLMs master formal but not functional language competence; and iii) that language learning in LLMs cannot inform human language learning. Drawing on empirical and theoretical arguments, we show that these points need more nuance. Second, we outline a pragmatic perspective on the issue of `real' understanding and intentionality in LLMs. Understanding and intentionality pertain to unobservable mental states we attribute to other humans because they have pragmatic value: they allow us to abstract away from complex underlying mechanics and predict behaviou",
    "path": "papers/23/10/2310.19671.json",
    "total_tokens": 964,
    "translated_title": "大型语言模型：对当前辩论的细微差别的需求和对理解的务实观点(arXiv:2310.19671v2 [cs.CL] 更新)",
    "translated_abstract": "目前的大型语言模型（LLMs）在生成语法正确、流畅的文本方面无与伦比。LLMs正在快速出现，并且关于LLM能力的辩论已经开始，但反思滞后。因此，在这篇立场论文中，我们首先聚焦于辩论，并对LLM能力的三个重复出现的批评进行批判性评估：i) LLMs只是模仿训练数据中的统计模式；ii) LLMs掌握了形式但并非功能性语言能力；iii) LLMs中的语言学习不能为人类语言学习提供信息。通过实证和理论论证，我们展示了这些观点需要更多细微之处。其次，我们概述了一个对LLMs中“真正”的理解和意图问题的务实观点。理解和意图涉及到我们假设他人具有的不可观察的心理状态，因为它们具有实用价值：它们使我们能够抽象出复杂的底层机制并预测行为。",
    "tldr": "当前的大型语言模型在生成文本方面表现出了出色的能力，但对其能力的辩论缺乏细致的考虑。这篇论文评估了三个常见批评观点，并提出了对LLMs理解和意图问题的务实观点。",
    "en_tdlr": "Current large language models have remarkable ability in generating text, however, there is a lack of nuanced consideration in debates about their capabilities. This paper critically assesses three recurring critiques and presents a pragmatic perspective on understanding and intentionality in LLMs."
}