{
    "title": "Robust Trading in a Generalized Lattice Market. (arXiv:2310.11023v1 [q-fin.PM])",
    "abstract": "This paper introduces a novel robust trading paradigm, called \\textit{multi-double linear policies}, situated within a \\textit{generalized} lattice market. Distinctively, our framework departs from most existing robust trading strategies, which are predominantly limited to single or paired assets and typically embed asset correlation within the trading strategy itself, rather than as an inherent characteristic of the market. Our generalized lattice market model incorporates both serially correlated returns and asset correlation through a conditional probabilistic model. In the nominal case, where the parameters of the model are known, we demonstrate that the proposed policies ensure survivability and probabilistic positivity. We then derive an analytic expression for the worst-case expected gain-loss and prove sufficient conditions that the proposed policies can maintain a \\textit{positive expected profits}, even within a seemingly nonprofitable symmetric lattice market. When the param",
    "link": "http://arxiv.org/abs/2310.11023",
    "context": "Title: Robust Trading in a Generalized Lattice Market. (arXiv:2310.11023v1 [q-fin.PM])\nAbstract: This paper introduces a novel robust trading paradigm, called \\textit{multi-double linear policies}, situated within a \\textit{generalized} lattice market. Distinctively, our framework departs from most existing robust trading strategies, which are predominantly limited to single or paired assets and typically embed asset correlation within the trading strategy itself, rather than as an inherent characteristic of the market. Our generalized lattice market model incorporates both serially correlated returns and asset correlation through a conditional probabilistic model. In the nominal case, where the parameters of the model are known, we demonstrate that the proposed policies ensure survivability and probabilistic positivity. We then derive an analytic expression for the worst-case expected gain-loss and prove sufficient conditions that the proposed policies can maintain a \\textit{positive expected profits}, even within a seemingly nonprofitable symmetric lattice market. When the param",
    "path": "papers/23/10/2310.11023.json",
    "total_tokens": 890,
    "translated_title": "一个广义格点市场中的稳健交易方法",
    "translated_abstract": "本文介绍了一种新的稳健交易范式，称为\"多重线性策略\"，并应用于一个广义格点市场中。与大多数现有的稳健交易策略不同的是，我们的框架不再局限于单个或成对资产，并且通常将资产相关性嵌入到交易策略本身中，而不是作为市场的固有特征。我们的广义格点市场模型通过条件概率模型同时考虑连续相关的收益和资产相关性。在参数已知的正常情况下，我们证明了所提出的策略能够确保生存和概率上的正性。然后，我们推导出最坏情况下的预期收益损失的解析表达，并证明了所提出的策略能够在看似无利可图的对称格点市场中维持正期望利润的充分条件。",
    "tldr": "本文介绍了一种在广义格点市场中的稳健交易方法，通过考虑连续相关的收益和资产相关性，提出了多重线性策略。在参数已知的情况下，该方法能够确保生存和概率上的正性，并能在无利可图的对称格点市场中维持正期望利润。",
    "en_tdlr": "This paper presents a robust trading method in a generalized lattice market, involving multi-double linear policies. By incorporating both serially correlated returns and asset correlation, this method ensures survivability and probabilistic positivity, and maintains positive expected profits even in seemingly unprofitable symmetric lattice markets."
}