{
    "title": "Physician Detection of Clinical Harm in Machine Translation: Quality Estimation Aids in Reliance and Backtranslation Identifies Critical Errors. (arXiv:2310.16924v1 [cs.CL])",
    "abstract": "A major challenge in the practical use of Machine Translation (MT) is that users lack guidance to make informed decisions about when to rely on outputs. Progress in quality estimation research provides techniques to automatically assess MT quality, but these techniques have primarily been evaluated in vitro by comparison against human judgments outside of a specific context of use. This paper evaluates quality estimation feedback in vivo with a human study simulating decision-making in high-stakes medical settings. Using Emergency Department discharge instructions, we study how interventions based on quality estimation versus backtranslation assist physicians in deciding whether to show MT outputs to a patient. We find that quality estimation improves appropriate reliance on MT, but backtranslation helps physicians detect more clinically harmful errors that QE alone often misses.",
    "link": "http://arxiv.org/abs/2310.16924",
    "context": "Title: Physician Detection of Clinical Harm in Machine Translation: Quality Estimation Aids in Reliance and Backtranslation Identifies Critical Errors. (arXiv:2310.16924v1 [cs.CL])\nAbstract: A major challenge in the practical use of Machine Translation (MT) is that users lack guidance to make informed decisions about when to rely on outputs. Progress in quality estimation research provides techniques to automatically assess MT quality, but these techniques have primarily been evaluated in vitro by comparison against human judgments outside of a specific context of use. This paper evaluates quality estimation feedback in vivo with a human study simulating decision-making in high-stakes medical settings. Using Emergency Department discharge instructions, we study how interventions based on quality estimation versus backtranslation assist physicians in deciding whether to show MT outputs to a patient. We find that quality estimation improves appropriate reliance on MT, but backtranslation helps physicians detect more clinically harmful errors that QE alone often misses.",
    "path": "papers/23/10/2310.16924.json",
    "total_tokens": 979,
    "translated_title": "机器翻译中的临床损害被医生发现：质量评估帮助减少依赖，追溯翻译识别关键错误",
    "translated_abstract": "机器翻译在实际应用中的一个主要挑战是用户缺乏指导来做出是否依赖其输出的明智决策。质量评估研究的进展提供了自动评估机器翻译质量的技术，但这些技术主要在特定的使用环境之外通过与人工判断的比较进行体外评估。本文通过在高风险医学环境中模拟决策过程的人类研究，评估了质量评估反馈的实地应用。我们使用急诊科出院指示，研究了基于质量评估和追溯翻译的干预措施如何帮助医生决定是否向患者展示机器翻译的输出。我们发现，质量评估改善了对机器翻译的适当依赖，但追溯翻译有助于医生发现质量评估常常忽略的更严重的临床错误。",
    "tldr": "本文通过人类研究评估了在高风险医疗环境中使用质量评估反馈来帮助医生辨别何时依赖机器翻译输出。结果表明，质量评估能改善对机器翻译的适当依赖，但追溯翻译能帮助医生发现更严重的临床错误。"
}