{
    "title": "REMEDI: REinforcement learning-driven adaptive MEtabolism modeling of primary sclerosing cholangitis DIsease progression. (arXiv:2310.01426v1 [q-bio.QM])",
    "abstract": "Primary sclerosing cholangitis (PSC) is a rare disease wherein altered bile acid metabolism contributes to sustained liver injury. This paper introduces REMEDI, a framework that captures bile acid dynamics and the body's adaptive response during PSC progression that can assist in exploring treatments. REMEDI merges a differential equation (DE)-based mechanistic model that describes bile acid metabolism with reinforcement learning (RL) to emulate the body's adaptations to PSC continuously. An objective of adaptation is to maintain homeostasis by regulating enzymes involved in bile acid metabolism. These enzymes correspond to the parameters of the DEs. REMEDI leverages RL to approximate adaptations in PSC, treating homeostasis as a reward signal and the adjustment of the DE parameters as the corresponding actions. On real-world data, REMEDI generated bile acid dynamics and parameter adjustments consistent with published findings. Also, our results support discussions in the literature th",
    "link": "http://arxiv.org/abs/2310.01426",
    "context": "Title: REMEDI: REinforcement learning-driven adaptive MEtabolism modeling of primary sclerosing cholangitis DIsease progression. (arXiv:2310.01426v1 [q-bio.QM])\nAbstract: Primary sclerosing cholangitis (PSC) is a rare disease wherein altered bile acid metabolism contributes to sustained liver injury. This paper introduces REMEDI, a framework that captures bile acid dynamics and the body's adaptive response during PSC progression that can assist in exploring treatments. REMEDI merges a differential equation (DE)-based mechanistic model that describes bile acid metabolism with reinforcement learning (RL) to emulate the body's adaptations to PSC continuously. An objective of adaptation is to maintain homeostasis by regulating enzymes involved in bile acid metabolism. These enzymes correspond to the parameters of the DEs. REMEDI leverages RL to approximate adaptations in PSC, treating homeostasis as a reward signal and the adjustment of the DE parameters as the corresponding actions. On real-world data, REMEDI generated bile acid dynamics and parameter adjustments consistent with published findings. Also, our results support discussions in the literature th",
    "path": "papers/23/10/2310.01426.json",
    "total_tokens": 934,
    "translated_title": "REMEDI: 基于强化学习的自适应PSC疾病进展代谢建模",
    "translated_abstract": "原发性硬化性胆管炎(PSC)是一种罕见的疾病，胆汁酸代谢的改变导致持续性肝脏损伤。本文引入了REMEDI，一个能够捕捉PSC进展过程中胆汁酸动力学和机体自适应响应的框架，可以帮助探索治疗方法。REMEDI将描述胆汁酸代谢的微分方程(Differential Equation, DE)机械模型与强化学习(RL)相结合，连续地模拟PSC中机体的自适应。自适应的目标是通过调节胆汁酸代谢相关的酶来维持稳态。这些酶对应于DE参数。REMEDI利用RL来近似PSC中的自适应，将稳态视为奖励信号，将DE参数的调整视为相应的动作。在真实世界数据上，REMEDI生成的胆汁酸动态和参数调整与已发表研究结果一致。此外，我们的结果支持文献中的讨论。",
    "tldr": "REMEDI是一个基于强化学习的框架，能够捕捉PSC疾病进展过程中胆汁酸动力学和机体自适应响应，有助于探索治疗方法。"
}