{
    "title": "GNN-GMVO: Graph Neural Networks for Optimizing Gross Merchandise Value in Similar Item Recommendation. (arXiv:2310.17732v1 [cs.IR])",
    "abstract": "Similar item recommendation is a critical task in the e-Commerce industry, which helps customers explore similar and relevant alternatives based on their interested products. Despite the traditional machine learning models, Graph Neural Networks (GNNs), by design, can understand complex relations like similarity between products. However, in contrast to their wide usage in retrieval tasks and their focus on optimizing the relevance, the current GNN architectures are not tailored toward maximizing revenue-related objectives such as Gross Merchandise Value (GMV), which is one of the major business metrics for e-Commerce companies. In addition, defining accurate edge relations in GNNs is non-trivial in large-scale e-Commerce systems, due to the heterogeneity nature of the item-item relationships. This work aims to address these issues by designing a new GNN architecture called GNN-GMVO (Graph Neural Network - Gross Merchandise Value Optimizer). This model directly optimizes GMV while cons",
    "link": "http://arxiv.org/abs/2310.17732",
    "context": "Title: GNN-GMVO: Graph Neural Networks for Optimizing Gross Merchandise Value in Similar Item Recommendation. (arXiv:2310.17732v1 [cs.IR])\nAbstract: Similar item recommendation is a critical task in the e-Commerce industry, which helps customers explore similar and relevant alternatives based on their interested products. Despite the traditional machine learning models, Graph Neural Networks (GNNs), by design, can understand complex relations like similarity between products. However, in contrast to their wide usage in retrieval tasks and their focus on optimizing the relevance, the current GNN architectures are not tailored toward maximizing revenue-related objectives such as Gross Merchandise Value (GMV), which is one of the major business metrics for e-Commerce companies. In addition, defining accurate edge relations in GNNs is non-trivial in large-scale e-Commerce systems, due to the heterogeneity nature of the item-item relationships. This work aims to address these issues by designing a new GNN architecture called GNN-GMVO (Graph Neural Network - Gross Merchandise Value Optimizer). This model directly optimizes GMV while cons",
    "path": "papers/23/10/2310.17732.json",
    "total_tokens": 937,
    "translated_title": "GNN-GMVO: 用于优化相似商品推荐中的商品总交易价值的图神经网络",
    "translated_abstract": "相似商品推荐是电子商务行业中的关键任务，它帮助客户基于他们感兴趣的产品探索相似和相关的替代品。尽管传统的机器学习模型，图神经网络（GNN）可以理解产品之间的复杂关系，如相似性。然而，与它们在检索任务中的广泛应用和优化相关性的重点相反，当前的GNN架构并未针对最大化与收入相关的目标（如商品总交易价值（GMV））进行设计，而GMV是电子商务公司的主要业务指标之一。此外，在大规模电子商务系统中定义准确的边关系对于GNN来说是非常复杂的，因为商品之间的关系具有异质性。本研究旨在通过设计一种称为GNN-GMVO的新型GNN架构来解决这些问题。该模型直接优化GMV，同时保证推荐质量。",
    "tldr": "这项研究设计了一种名为GNN-GMVO的新型图神经网络架构，用于优化电子商务中相似商品推荐的商品总交易价值（GMV）。它解决了传统GNN架构在优化收入相关目标方面的不足，并通过直接优化GMV来保证推荐质量。",
    "en_tdlr": "This study designs a new graph neural network architecture called GNN-GMVO for optimizing the gross merchandise value (GMV) in similar item recommendation in e-commerce. It addresses the limitations of traditional GNN architectures in optimizing revenue-related objectives and ensures recommendation quality by directly optimizing GMV."
}