{
    "title": "Real-Time Event Detection with Random Forests and Temporal Convolutional Networks for More Sustainable Petroleum Industry. (arXiv:2310.08737v1 [cs.AI])",
    "abstract": "The petroleum industry is crucial for modern society, but the production process is complex and risky. During the production, accidents or failures, resulting from undesired production events, can cause severe environmental and economic damage. Previous studies have investigated machine learning (ML) methods for undesired event detection. However, the prediction of event probability in real-time was insufficiently addressed, which is essential since it is important to undertake early intervention when an event is expected to happen. This paper proposes two ML approaches, random forests and temporal convolutional networks, to detect undesired events in real-time. Results show that our approaches can effectively classify event types and predict the probability of their appearance, addressing the challenges uncovered in previous studies and providing a more effective solution for failure event management during the production.",
    "link": "http://arxiv.org/abs/2310.08737",
    "context": "Title: Real-Time Event Detection with Random Forests and Temporal Convolutional Networks for More Sustainable Petroleum Industry. (arXiv:2310.08737v1 [cs.AI])\nAbstract: The petroleum industry is crucial for modern society, but the production process is complex and risky. During the production, accidents or failures, resulting from undesired production events, can cause severe environmental and economic damage. Previous studies have investigated machine learning (ML) methods for undesired event detection. However, the prediction of event probability in real-time was insufficiently addressed, which is essential since it is important to undertake early intervention when an event is expected to happen. This paper proposes two ML approaches, random forests and temporal convolutional networks, to detect undesired events in real-time. Results show that our approaches can effectively classify event types and predict the probability of their appearance, addressing the challenges uncovered in previous studies and providing a more effective solution for failure event management during the production.",
    "path": "papers/23/10/2310.08737.json",
    "total_tokens": 875,
    "translated_title": "利用随机森林和时态卷积网络实现石油产业更可持续的实时事件检测",
    "translated_abstract": "石油产业对现代社会至关重要，但生产过程复杂且风险高。在生产过程中，由于不希望的生产事件导致的事故或故障可能会造成严重的环境和经济损失。以往的研究已经调研了机器学习方法用于不希望事件的检测，但对于实时事件概率的预测并没有得到充分解决，而这一点非常重要，因为及早干预是预计事件发生时的重要措施。本文提出了两种机器学习方法，随机森林和时态卷积网络，用于实时检测不希望的事件。结果表明我们的方法可以有效地对事件类型进行分类并预测其出现的概率，解决了以往研究中发现的挑战，为生产过程中的故障事件管理提供更有效的解决方案。",
    "tldr": "通过随机森林和时态卷积网络，本论文提出了一种实时检测不希望事件的方法，可以有效地分类事件类型并预测其出现的概率，为生产过程中的故障事件管理提供更有效的解决方案。"
}