{
    "title": "Re-Temp: Relation-Aware Temporal Representation Learning for Temporal Knowledge Graph Completion. (arXiv:2310.15722v1 [cs.CL])",
    "abstract": "Temporal Knowledge Graph Completion (TKGC) under the extrapolation setting aims to predict the missing entity from a fact in the future, posing a challenge that aligns more closely with real-world prediction problems. Existing research mostly encodes entities and relations using sequential graph neural networks applied to recent snapshots. However, these approaches tend to overlook the ability to skip irrelevant snapshots according to entity-related relations in the query and disregard the importance of explicit temporal information. To address this, we propose our model, Re-Temp (Relation-Aware Temporal Representation Learning), which leverages explicit temporal embedding as input and incorporates skip information flow after each timestamp to skip unnecessary information for prediction. Additionally, we introduce a two-phase forward propagation method to prevent information leakage. Through the evaluation on six TKGC (extrapolation) datasets, we demonstrate that our model outperforms ",
    "link": "http://arxiv.org/abs/2310.15722",
    "context": "Title: Re-Temp: Relation-Aware Temporal Representation Learning for Temporal Knowledge Graph Completion. (arXiv:2310.15722v1 [cs.CL])\nAbstract: Temporal Knowledge Graph Completion (TKGC) under the extrapolation setting aims to predict the missing entity from a fact in the future, posing a challenge that aligns more closely with real-world prediction problems. Existing research mostly encodes entities and relations using sequential graph neural networks applied to recent snapshots. However, these approaches tend to overlook the ability to skip irrelevant snapshots according to entity-related relations in the query and disregard the importance of explicit temporal information. To address this, we propose our model, Re-Temp (Relation-Aware Temporal Representation Learning), which leverages explicit temporal embedding as input and incorporates skip information flow after each timestamp to skip unnecessary information for prediction. Additionally, we introduce a two-phase forward propagation method to prevent information leakage. Through the evaluation on six TKGC (extrapolation) datasets, we demonstrate that our model outperforms ",
    "path": "papers/23/10/2310.15722.json",
    "total_tokens": 851,
    "translated_title": "Re-Temp：面向时间知识图谱完成的关系感知时态表示学习",
    "translated_abstract": "在外推设置下的时间知识图谱完成（TKGC）旨在预测未来事实中的缺失实体，更接近于实际预测问题的挑战。现有研究主要利用应用于最近快照的顺序图神经网络来编码实体和关系。然而，这些方法往往忽视了根据查询中与实体相关的关系跳过不相关的快照的能力，并且忽视了显式的时间信息的重要性。为了解决这个问题，我们提出了我们的模型Re-Temp（关系感知时态表示学习），它利用显式的时间嵌入作为输入，并在每一个时间戳之后引入跳过信息流来跳过预测中不必要的信息。此外，我们引入了一个两阶段的前向传播方法来防止信息泄漏。通过在六个TKGC（外推）数据集上的评估，我们证明了我们的模型的性能优于现有方法。",
    "tldr": "Re-Temp是一个能够根据实体关系跳过不相关快照并利用显式时间信息进行预测的模型，通过在多个TKGC数据集上的评估，我们证明了它的有效性。"
}