{
    "title": "Ophiuchus: Scalable Modeling of Protein Structures through Hierarchical Coarse-graining SO(3)-Equivariant Autoencoders. (arXiv:2310.02508v1 [cs.LG])",
    "abstract": "Three-dimensional native states of natural proteins display recurring and hierarchical patterns. Yet, traditional graph-based modeling of protein structures is often limited to operate within a single fine-grained resolution, and lacks hourglass neural architectures to learn those high-level building blocks. We narrow this gap by introducing Ophiuchus, an SO(3)-equivariant coarse-graining model that efficiently operates on all heavy atoms of standard protein residues, while respecting their relevant symmetries. Our model departs from current approaches that employ graph modeling, instead focusing on local convolutional coarsening to model sequence-motif interactions in log-linear length complexity. We train Ophiuchus on contiguous fragments of PDB monomers, investigating its reconstruction capabilities across different compression rates. We examine the learned latent space and demonstrate its prompt usage in conformational interpolation, comparing interpolated trajectories to structure",
    "link": "http://arxiv.org/abs/2310.02508",
    "context": "Title: Ophiuchus: Scalable Modeling of Protein Structures through Hierarchical Coarse-graining SO(3)-Equivariant Autoencoders. (arXiv:2310.02508v1 [cs.LG])\nAbstract: Three-dimensional native states of natural proteins display recurring and hierarchical patterns. Yet, traditional graph-based modeling of protein structures is often limited to operate within a single fine-grained resolution, and lacks hourglass neural architectures to learn those high-level building blocks. We narrow this gap by introducing Ophiuchus, an SO(3)-equivariant coarse-graining model that efficiently operates on all heavy atoms of standard protein residues, while respecting their relevant symmetries. Our model departs from current approaches that employ graph modeling, instead focusing on local convolutional coarsening to model sequence-motif interactions in log-linear length complexity. We train Ophiuchus on contiguous fragments of PDB monomers, investigating its reconstruction capabilities across different compression rates. We examine the learned latent space and demonstrate its prompt usage in conformational interpolation, comparing interpolated trajectories to structure",
    "path": "papers/23/10/2310.02508.json",
    "total_tokens": 938,
    "translated_title": "Ophiuchus: 通过分层粗粒化SO(3)-等变自编码器对蛋白质结构进行可扩展建模",
    "translated_abstract": "天然蛋白质的三维原生态状态显示出重复和分层模式。然而，传统的基于图的蛋白质结构建模通常局限于在单一精细化分辨率内操作，并且缺乏捕捉高级构建模块的中间神经网络架构。我们通过引入Ophiuchus来填补这个差距，它是一个SO(3)-等变粗粒化模型，可以高效地操作标准蛋白质残基的所有重原子，并同时尊重它们的相关对称性。我们的模型与当前采用图模型的方法不同，而是专注于局部卷积粗化，以在对数线性长度复杂度下模拟序列模体之间的相互作用。我们使用PDB单体的连续片段对Ophiuchus进行训练，研究其在不同压缩率下的重构能力。我们检查学习到的潜空间，并展示其在构象插值中的快速使用，将插值轨迹与结构进行比较。",
    "tldr": "Ophiuchus是一个通过分层粗粒化SO(3)-等变自编码器对蛋白质结构进行可扩展建模的模型，它能在高分辨率下操作所有重原子，同时捕捉到结构的重复和分层模式。",
    "en_tdlr": "Ophiuchus is a scalable model for protein structure modeling through hierarchical coarse-graining SO(3)-equivariant autoencoders, which efficiently operates on all heavy atoms and captures the recurring and hierarchical patterns in protein structures."
}