{
    "title": "Noisy-ArcMix: Additive Noisy Angular Margin Loss Combined With Mixup Anomalous Sound Detection. (arXiv:2310.06364v1 [cs.SD])",
    "abstract": "Unsupervised anomalous sound detection (ASD) aims to identify anomalous sounds by learning the features of normal operational sounds and sensing their deviations. Recent approaches have focused on the self-supervised task utilizing the classification of normal data, and advanced models have shown that securing representation space for anomalous data is important through representation learning yielding compact intra-class and well-separated intra-class distributions. However, we show that conventional approaches often fail to ensure sufficient intra-class compactness and exhibit angular disparity between samples and their corresponding centers. In this paper, we propose a training technique aimed at ensuring intra-class compactness and increasing the angle gap between normal and abnormal samples. Furthermore, we present an architecture that extracts features for important temporal regions, enabling the model to learn which time frames should be emphasized or suppressed. Experimental re",
    "link": "http://arxiv.org/abs/2310.06364",
    "context": "Title: Noisy-ArcMix: Additive Noisy Angular Margin Loss Combined With Mixup Anomalous Sound Detection. (arXiv:2310.06364v1 [cs.SD])\nAbstract: Unsupervised anomalous sound detection (ASD) aims to identify anomalous sounds by learning the features of normal operational sounds and sensing their deviations. Recent approaches have focused on the self-supervised task utilizing the classification of normal data, and advanced models have shown that securing representation space for anomalous data is important through representation learning yielding compact intra-class and well-separated intra-class distributions. However, we show that conventional approaches often fail to ensure sufficient intra-class compactness and exhibit angular disparity between samples and their corresponding centers. In this paper, we propose a training technique aimed at ensuring intra-class compactness and increasing the angle gap between normal and abnormal samples. Furthermore, we present an architecture that extracts features for important temporal regions, enabling the model to learn which time frames should be emphasized or suppressed. Experimental re",
    "path": "papers/23/10/2310.06364.json",
    "total_tokens": 901,
    "translated_title": "Noisy-ArcMix: 加噪角度边际损失与Mixup结合的异常声音检测",
    "translated_abstract": "无监督的异常声音检测旨在通过学习正常操作声音的特征并感知其偏差来识别异常声音。最近的方法集中在利用正常数据的分类进行自监督任务，并且先进的模型已经表明通过表示学习确保异常数据的表示空间对于获得紧凑的类内分布和明显的类间分布是重要的。然而，我们发现传统方法往往无法确保足够的类内紧凑性，并且样本及其对应中心之间存在角度差异。在本文中，我们提出了一种训练技术，旨在确保类内紧凑性，并增加正常和异常样本之间的角度差距。此外，我们提出了一种能够提取重要时间区域特征的架构，使模型能够学习哪些时间帧应该被强调或抑制。",
    "tldr": "本文提出了一种名为Noisy-ArcMix的训练技术，旨在确保异常声音检测模型具有足够的类内紧凑性和正常与异常样本之间的角度差距。同时，引入了一种能够提取重要时间区域特征的架构，增强模型对于时间帧的学习能力。",
    "en_tdlr": "This paper proposes a training technique called Noisy-ArcMix to ensure sufficient intra-class compactness and angle gap between normal and abnormal samples in anomalous sound detection. It also introduces an architecture that extracts features of important temporal regions to enhance the model's ability to learn time frames."
}