{
    "title": "Leveraging Large Language Model for Automatic Evolving of Industrial Data-Centric R&D Cycle. (arXiv:2310.11249v1 [cs.AI])",
    "abstract": "In the wake of relentless digital transformation, data-driven solutions are emerging as powerful tools to address multifarious industrial tasks such as forecasting, anomaly detection, planning, and even complex decision-making. Although data-centric R&D has been pivotal in harnessing these solutions, it often comes with significant costs in terms of human, computational, and time resources. This paper delves into the potential of large language models (LLMs) to expedite the evolution cycle of data-centric R&D. Assessing the foundational elements of data-centric R&D, including heterogeneous task-related data, multi-facet domain knowledge, and diverse computing-functional tools, we explore how well LLMs can understand domain-specific requirements, generate professional ideas, utilize domain-specific tools to conduct experiments, interpret results, and incorporate knowledge from past endeavors to tackle new challenges. We take quantitative investment research as a typical example of indus",
    "link": "http://arxiv.org/abs/2310.11249",
    "context": "Title: Leveraging Large Language Model for Automatic Evolving of Industrial Data-Centric R&D Cycle. (arXiv:2310.11249v1 [cs.AI])\nAbstract: In the wake of relentless digital transformation, data-driven solutions are emerging as powerful tools to address multifarious industrial tasks such as forecasting, anomaly detection, planning, and even complex decision-making. Although data-centric R&D has been pivotal in harnessing these solutions, it often comes with significant costs in terms of human, computational, and time resources. This paper delves into the potential of large language models (LLMs) to expedite the evolution cycle of data-centric R&D. Assessing the foundational elements of data-centric R&D, including heterogeneous task-related data, multi-facet domain knowledge, and diverse computing-functional tools, we explore how well LLMs can understand domain-specific requirements, generate professional ideas, utilize domain-specific tools to conduct experiments, interpret results, and incorporate knowledge from past endeavors to tackle new challenges. We take quantitative investment research as a typical example of indus",
    "path": "papers/23/10/2310.11249.json",
    "total_tokens": 980,
    "translated_title": "利用大规模语言模型自动演进工业数据中心研发周期",
    "translated_abstract": "在不断进行的数字转型中，数据驱动的解决方案正在成为解决各种工业任务的强大工具，如预测、异常检测、规划，甚至复杂的决策。虽然数据中心的研发在利用这些解决方案方面起着关键作用，但在人力、计算和时间资源方面往往需要付出巨大的代价。本文深入探讨了大规模语言模型（LLMs）在加速数据中心研发的演进周期方面的潜力。通过评估数据中心研发的基本要素，包括异构任务相关数据、多面向领域知识和多样化的计算功能工具，我们探讨了LLMs能够多好地理解特定领域的要求，生成专业的想法，利用领域特定工具进行实验，解释结果，并融入从过去的努力中获得的知识来应对新的挑战。以量化投资研究为典型例子，我们进行了实证研究，证明了LLMs在加速数据中心研发的演进中的潜力和价值。",
    "tldr": "本文研究了利用大规模语言模型（LLMs）加速数据中心研发周期的潜力。通过评估数据中心研发的基本要素，我们探讨了LLMs在理解领域要求、生成想法、利用工具进行实验并应对新挑战等方面的能力。",
    "en_tdlr": "This paper explores the potential of leveraging large language models (LLMs) to expedite the evolution cycle of data-centric R&D. By assessing the foundational elements of data-centric R&D, it investigates how well LLMs can understand domain-specific requirements, generate ideas, utilize tools for experiments, and tackle new challenges."
}