{
    "title": "EIP-4844 Economics and Rollup Strategies. (arXiv:2310.01155v1 [cs.GT])",
    "abstract": "We study the economics of the Ethereum improvement proposal 4844 and its effect on rollups' data posting strategies. Rollups' cost consists of two parts: data posting and delay. In the new proposal, the data posting cost corresponds to a blob posting cost and is fixed in each block, no matter how much of the blob is utilized by the rollup. The tradeoff is clear: the rollup prefers to post a full blob, but if its transaction arrival rate is low, filling up a blob space causes too large delay cost. The first result of the paper shows that if a rollup transaction arrival rate is too low, it prefers to use the regular blockspace market for data posting, as it offers a more flexible cost structure. Second, we show that shared blob posting is not always beneficial for participating rollups and change in the aggregate blob posting cost in the equilibrium depends on the types of participating rollups. In the end, we discuss blob cost-sharing rules from an axiomatic angle.",
    "link": "http://arxiv.org/abs/2310.01155",
    "context": "Title: EIP-4844 Economics and Rollup Strategies. (arXiv:2310.01155v1 [cs.GT])\nAbstract: We study the economics of the Ethereum improvement proposal 4844 and its effect on rollups' data posting strategies. Rollups' cost consists of two parts: data posting and delay. In the new proposal, the data posting cost corresponds to a blob posting cost and is fixed in each block, no matter how much of the blob is utilized by the rollup. The tradeoff is clear: the rollup prefers to post a full blob, but if its transaction arrival rate is low, filling up a blob space causes too large delay cost. The first result of the paper shows that if a rollup transaction arrival rate is too low, it prefers to use the regular blockspace market for data posting, as it offers a more flexible cost structure. Second, we show that shared blob posting is not always beneficial for participating rollups and change in the aggregate blob posting cost in the equilibrium depends on the types of participating rollups. In the end, we discuss blob cost-sharing rules from an axiomatic angle.",
    "path": "papers/23/10/2310.01155.json",
    "total_tokens": 906,
    "translated_title": "EIP-4844经济学与Rollup策略",
    "translated_abstract": "我们研究了Ethereum改进提案4844的经济学以及对Rollup数据发布策略的影响。Rollup的成本包括两部分：数据发布成本和延迟成本。在新的提案中，数据发布成本与blob发布成本相对应，并在每个区块中固定，无论Rollup利用了多少blob。这个权衡是清晰的：Rollup更倾向于发布一个完整的blob，但是如果其交易到达率较低，填充blob空间会导致较大的延迟成本。论文的第一个结果显示，如果一个Rollup的交易到达率太低，它更倾向于使用常规的区块空间市场进行数据发布，因为它提供了更灵活的成本结构。其次，我们表明共享的blob发布并不总是对参与的Rollup有益的，均衡中的聚合blob发布成本的变化取决于参与的Rollup的类型。最后，我们从公理角度讨论blob成本分摊规则。",
    "tldr": "EIP-4844提案研究了对Rollup策略的经济学影响，发现低交易到达率的Rollup倾向于使用常规区块空间市场，同时共享的blob发布并不总是对参与的Rollup有益。"
}