{
    "title": "Adversarial Training for Physics-Informed Neural Networks. (arXiv:2310.11789v1 [cs.LG])",
    "abstract": "Physics-informed neural networks have shown great promise in solving partial differential equations. However, due to insufficient robustness, vanilla PINNs often face challenges when solving complex PDEs, especially those involving multi-scale behaviors or solutions with sharp or oscillatory characteristics. To address these issues, based on the projected gradient descent adversarial attack, we proposed an adversarial training strategy for PINNs termed by AT-PINNs. AT-PINNs enhance the robustness of PINNs by fine-tuning the model with adversarial samples, which can accurately identify model failure locations and drive the model to focus on those regions during training. AT-PINNs can also perform inference with temporal causality by selecting the initial collocation points around temporal initial values. We implement AT-PINNs to the elliptic equation with multi-scale coefficients, Poisson equation with multi-peak solutions, Burgers equation with sharp solutions and the Allen-Cahn equati",
    "link": "http://arxiv.org/abs/2310.11789",
    "context": "Title: Adversarial Training for Physics-Informed Neural Networks. (arXiv:2310.11789v1 [cs.LG])\nAbstract: Physics-informed neural networks have shown great promise in solving partial differential equations. However, due to insufficient robustness, vanilla PINNs often face challenges when solving complex PDEs, especially those involving multi-scale behaviors or solutions with sharp or oscillatory characteristics. To address these issues, based on the projected gradient descent adversarial attack, we proposed an adversarial training strategy for PINNs termed by AT-PINNs. AT-PINNs enhance the robustness of PINNs by fine-tuning the model with adversarial samples, which can accurately identify model failure locations and drive the model to focus on those regions during training. AT-PINNs can also perform inference with temporal causality by selecting the initial collocation points around temporal initial values. We implement AT-PINNs to the elliptic equation with multi-scale coefficients, Poisson equation with multi-peak solutions, Burgers equation with sharp solutions and the Allen-Cahn equati",
    "path": "papers/23/10/2310.11789.json",
    "total_tokens": 890,
    "translated_title": "物理信息神经网络的对抗训练",
    "translated_abstract": "物理信息神经网络在解决偏微分方程问题上显示出巨大的潜力。然而，由于不足的鲁棒性，普通的PINNs在解决涉及多尺度行为或具有尖锐或振荡特征的复杂PDE时经常面临挑战。为了解决这些问题，我们基于投影梯度下降对抗攻击提出了一种对抗训练策略，被称为AT-PINNs。AT-PINNs通过对抗样本的微调来增强PINNs的鲁棒性，可以准确识别模型失效位置并在训练过程中引导模型专注于这些区域。AT-PINNs还可以通过选择围绕时间初始值的初始拟合点来进行因果推断。我们将AT-PINNs应用于具有多尺度系数的椭圆方程、具有多峰解的泊松方程、具有尖锐解的Burgers方程以及Allen-Cahn方程。",
    "tldr": "这篇论文提出了一种名为AT-PINNs的对抗训练策略，通过对抗样本的微调来增强物理信息神经网络（PINNs）的鲁棒性，并且可以进行具有时间因果关系的推断。",
    "en_tdlr": "This paper proposes an adversarial training strategy called AT-PINNs to enhance the robustness of physics-informed neural networks (PINNs) by fine-tuning the model with adversarial samples, and enables inference with temporal causality."
}