{
    "title": "A multi-artifact EEG denoising by frequency-based deep learning. (arXiv:2310.17335v1 [cs.LG])",
    "abstract": "Electroencephalographic (EEG) signals are fundamental to neuroscience research and clinical applications such as brain-computer interfaces and neurological disorder diagnosis. These signals are typically a combination of neurological activity and noise, originating from various sources, including physiological artifacts like ocular and muscular movements. Under this setting, we tackle the challenge of distinguishing neurological activity from noise-related sources. We develop a novel EEG denoising model that operates in the frequency domain, leveraging prior knowledge about noise spectral features to adaptively compute optimal convolutional filters for noise separation. The model is trained to learn an empirical relationship connecting the spectral characteristics of noise and noisy signal to a non-linear transformation which allows signal denoising. Performance evaluation on the EEGdenoiseNet dataset shows that the proposed model achieves optimal results according to both temporal and",
    "link": "http://arxiv.org/abs/2310.17335",
    "context": "Title: A multi-artifact EEG denoising by frequency-based deep learning. (arXiv:2310.17335v1 [cs.LG])\nAbstract: Electroencephalographic (EEG) signals are fundamental to neuroscience research and clinical applications such as brain-computer interfaces and neurological disorder diagnosis. These signals are typically a combination of neurological activity and noise, originating from various sources, including physiological artifacts like ocular and muscular movements. Under this setting, we tackle the challenge of distinguishing neurological activity from noise-related sources. We develop a novel EEG denoising model that operates in the frequency domain, leveraging prior knowledge about noise spectral features to adaptively compute optimal convolutional filters for noise separation. The model is trained to learn an empirical relationship connecting the spectral characteristics of noise and noisy signal to a non-linear transformation which allows signal denoising. Performance evaluation on the EEGdenoiseNet dataset shows that the proposed model achieves optimal results according to both temporal and",
    "path": "papers/23/10/2310.17335.json",
    "total_tokens": 922,
    "translated_title": "基于频率的深度学习进行多种信号伪迹的脑电图去噪",
    "translated_abstract": "脑电图（EEG）信号在神经科学研究和脑机接口、神经疾病诊断等临床应用中起着基础作用。这些信号通常是神经活动和噪声的组合，噪声来自多种来源，包括眼动和肌肉运动等生理伪迹。在这种情况下，我们面临的挑战是区分神经活动和与噪声相关的来源。我们开发了一种新颖的脑电图去噪模型，该模型在频域内工作，利用关于噪声频谱特征的先验知识，自适应地计算噪声分离的最优卷积滤波器。该模型经过训练，学习了将噪声和噪声信号的谱特征与非线性转换相连的经验关系，从而实现信号去噪。在EEGdenoiseNet数据集上的性能评估表明，所提出的模型在时间和空间上均取得了最优结果。",
    "tldr": "本论文提出了一种基于频域的新型脑电图去噪模型，通过利用噪声频谱特征的先验知识，自适应地计算噪声分离的最优滤波器。经过实验证明，该模型在脑电图去噪方面取得了最优结果。",
    "en_tdlr": "This paper proposes a novel EEG denoising model that operates in the frequency domain, adapting optimal filters for noise separation based on prior knowledge of noise spectral features. Experimental results demonstrate its superior performance in EEG denoising."
}