{
    "title": "From Posterior Sampling to Meaningful Diversity in Image Restoration",
    "abstract": "arXiv:2310.16047v2 Announce Type: replace-cross  Abstract: Image restoration problems are typically ill-posed in the sense that each degraded image can be restored in infinitely many valid ways. To accommodate this, many works generate a diverse set of outputs by attempting to randomly sample from the posterior distribution of natural images given the degraded input. Here we argue that this strategy is commonly of limited practical value because of the heavy tail of the posterior distribution. Consider for example inpainting a missing region of the sky in an image. Since there is a high probability that the missing region contains no object but clouds, any set of samples from the posterior would be entirely dominated by (practically identical) completions of sky. However, arguably, presenting users with only one clear sky completion, along with several alternative solutions such as airships, birds, and balloons, would better outline the set of possibilities. In this paper, we initiate ",
    "link": "https://arxiv.org/abs/2310.16047",
    "context": "Title: From Posterior Sampling to Meaningful Diversity in Image Restoration\nAbstract: arXiv:2310.16047v2 Announce Type: replace-cross  Abstract: Image restoration problems are typically ill-posed in the sense that each degraded image can be restored in infinitely many valid ways. To accommodate this, many works generate a diverse set of outputs by attempting to randomly sample from the posterior distribution of natural images given the degraded input. Here we argue that this strategy is commonly of limited practical value because of the heavy tail of the posterior distribution. Consider for example inpainting a missing region of the sky in an image. Since there is a high probability that the missing region contains no object but clouds, any set of samples from the posterior would be entirely dominated by (practically identical) completions of sky. However, arguably, presenting users with only one clear sky completion, along with several alternative solutions such as airships, birds, and balloons, would better outline the set of possibilities. In this paper, we initiate ",
    "path": "papers/23/10/2310.16047.json",
    "total_tokens": 820,
    "translated_title": "从后验采样到图像恢复中有意义的多样性",
    "translated_abstract": "图像恢复问题通常是不适定的，因为每个退化图像都可以以无限有效的方式恢复。为了满足这一点，许多作品试图从给定退化输入的自然图像后验分布中随机采样，生成多样化的输出。然而，我们认为这种策略普遍具有有限的实用价值，因为后验分布的尾部较重。例如，考虑修复图像中缺失的天空区域。由于缺失区域很可能不包含物体，只有云，任何来自后验的样本集都将完全被天空的（实际上相同的）修复所主导。然而，可以认为向用户呈现一个清晰的天空修复以及几种替代解决方案（例如飞艇、鸟类和气球）将更好地概述可能的选择集。本文中，我们开始",
    "tldr": "图像恢复问题通常具有无限种合理的解决方案，传统的后验采样生成的多样输出受到尾部效应限制，本文提出了一种更具意义的多样性策略。",
    "en_tdlr": "Image restoration problems typically have infinitely many valid solutions, traditional posterior sampling for diversity is limited by heavy tail effect, this paper proposes a more meaningful diversity strategy."
}