{
    "title": "Graph data modelling for outcome prediction in oropharyngeal cancer patients. (arXiv:2310.02931v1 [cs.CV])",
    "abstract": "Graph neural networks (GNNs) are becoming increasingly popular in the medical domain for the tasks of disease classification and outcome prediction. Since patient data is not readily available as a graph, most existing methods either manually define a patient graph, or learn a latent graph based on pairwise similarities between the patients. There are also hypergraph neural network (HGNN)-based methods that were introduced recently to exploit potential higher order associations between the patients by representing them as a hypergraph. In this work, we propose a patient hypergraph network (PHGN), which has been investigated in an inductive learning setup for binary outcome prediction in oropharyngeal cancer (OPC) patients using computed tomography (CT)-based radiomic features for the first time. Additionally, the proposed model was extended to perform time-to-event analyses, and compared with GNN and baseline linear models.",
    "link": "http://arxiv.org/abs/2310.02931",
    "context": "Title: Graph data modelling for outcome prediction in oropharyngeal cancer patients. (arXiv:2310.02931v1 [cs.CV])\nAbstract: Graph neural networks (GNNs) are becoming increasingly popular in the medical domain for the tasks of disease classification and outcome prediction. Since patient data is not readily available as a graph, most existing methods either manually define a patient graph, or learn a latent graph based on pairwise similarities between the patients. There are also hypergraph neural network (HGNN)-based methods that were introduced recently to exploit potential higher order associations between the patients by representing them as a hypergraph. In this work, we propose a patient hypergraph network (PHGN), which has been investigated in an inductive learning setup for binary outcome prediction in oropharyngeal cancer (OPC) patients using computed tomography (CT)-based radiomic features for the first time. Additionally, the proposed model was extended to perform time-to-event analyses, and compared with GNN and baseline linear models.",
    "path": "papers/23/10/2310.02931.json",
    "total_tokens": 904,
    "translated_title": "咽喉癌患者预测结果的图数据建模",
    "translated_abstract": "图神经网络（GNNs）在医学领域中越来越受欢迎，用于疾病分类和结果预测的任务。由于患者数据不容易作为图的形式获得，大部分现有的方法要么手动定义患者图，要么基于患者间的配对相似性学习一个潜在的图。最近引入的超图神经网络（HGNN）方法还利用超图来表示患者之间的潜在高阶关联。在本研究中，我们首次研究了一种患者超图网络（PHGN），并在归纳学习设置下，使用基于计算机断层扫描（CT）的放射学特征对咽喉癌（OPC）患者进行二元结果预测。此外，我们还将所提出的模型扩展到进行事件发生时间分析，并与GNN和基准线性模型进行比较。",
    "tldr": "本研究首次使用基于计算机断层扫描的放射学特征，提出了一种用于咽喉癌患者预测结果的患者超图网络（PHGN）。研究还将模型扩展到进行事件发生时间分析，并与GNN和基准线性模型进行比较。",
    "en_tdlr": "This study proposes a patient hypergraph network (PHGN) for outcome prediction in oropharyngeal cancer (OPC) patients using CT-based radiomic features for the first time. The proposed model is also extended to perform time-to-event analyses and compared with GNN and baseline linear models."
}