{
    "title": "High Dimensional Causal Inference with Variational Backdoor Adjustment. (arXiv:2310.06100v1 [cs.AI])",
    "abstract": "Backdoor adjustment is a technique in causal inference for estimating interventional quantities from purely observational data. For example, in medical settings, backdoor adjustment can be used to control for confounding and estimate the effectiveness of a treatment. However, high dimensional treatments and confounders pose a series of potential pitfalls: tractability, identifiability, optimization. In this work, we take a generative modeling approach to backdoor adjustment for high dimensional treatments and confounders. We cast backdoor adjustment as an optimization problem in variational inference without reliance on proxy variables and hidden confounders. Empirically, our method is able to estimate interventional likelihood in a variety of high dimensional settings, including semi-synthetic X-ray medical data. To the best of our knowledge, this is the first application of backdoor adjustment in which all the relevant variables are high dimensional.",
    "link": "http://arxiv.org/abs/2310.06100",
    "context": "Title: High Dimensional Causal Inference with Variational Backdoor Adjustment. (arXiv:2310.06100v1 [cs.AI])\nAbstract: Backdoor adjustment is a technique in causal inference for estimating interventional quantities from purely observational data. For example, in medical settings, backdoor adjustment can be used to control for confounding and estimate the effectiveness of a treatment. However, high dimensional treatments and confounders pose a series of potential pitfalls: tractability, identifiability, optimization. In this work, we take a generative modeling approach to backdoor adjustment for high dimensional treatments and confounders. We cast backdoor adjustment as an optimization problem in variational inference without reliance on proxy variables and hidden confounders. Empirically, our method is able to estimate interventional likelihood in a variety of high dimensional settings, including semi-synthetic X-ray medical data. To the best of our knowledge, this is the first application of backdoor adjustment in which all the relevant variables are high dimensional.",
    "path": "papers/23/10/2310.06100.json",
    "total_tokens": 829,
    "translated_title": "使用变分背门调整进行高维因果推断",
    "translated_abstract": "背门调整是一种因果推断技术，用于从纯观察数据中估计干预数量。在医疗环境中，背门调整可用于控制混杂因素并估计治疗效果。然而，高维治疗和混杂因素可能引发一系列潜在问题：可计算性、可辨识性、优化等。在这项工作中，我们采用生成建模方法来解决高维治疗和混杂因素的背门调整问题。我们将背门调整视为一种变分推断优化问题，无需依赖代理变量和隐藏混杂因素。实验上，我们的方法能够在各种高维环境中估计干预概率，包括半合成X光医疗数据。据我们所知，这是背门调整的首次应用，其中所有相关变量都是高维的。",
    "tldr": "本论文介绍了一种用于高维因果推断的变分背门调整技术，能够处理高维治疗和混杂因素，并成功应用于医疗数据中。",
    "en_tdlr": "This paper presents a variational backdoor adjustment technique for high-dimensional causal inference, which successfully addresses the challenges posed by high-dimensional treatments and confounders and is applied to medical data."
}