{
    "title": "Generative Modeling on Manifolds Through Mixture of Riemannian Diffusion Processes. (arXiv:2310.07216v1 [cs.LG])",
    "abstract": "Learning the distribution of data on Riemannian manifolds is crucial for modeling data from non-Euclidean space, which is required by many applications from diverse scientific fields. Yet, existing generative models on manifolds suffer from expensive divergence computation or rely on approximations of heat kernel. These limitations restrict their applicability to simple geometries and hinder scalability to high dimensions. In this work, we introduce the Riemannian Diffusion Mixture, a principled framework for building a generative process on manifolds as a mixture of endpoint-conditioned diffusion processes instead of relying on the denoising approach of previous diffusion models, for which the generative process is characterized by its drift guiding toward the most probable endpoint with respect to the geometry of the manifold. We further propose a simple yet efficient training objective for learning the mixture process, that is readily applicable to general manifolds. Our method outp",
    "link": "http://arxiv.org/abs/2310.07216",
    "context": "Title: Generative Modeling on Manifolds Through Mixture of Riemannian Diffusion Processes. (arXiv:2310.07216v1 [cs.LG])\nAbstract: Learning the distribution of data on Riemannian manifolds is crucial for modeling data from non-Euclidean space, which is required by many applications from diverse scientific fields. Yet, existing generative models on manifolds suffer from expensive divergence computation or rely on approximations of heat kernel. These limitations restrict their applicability to simple geometries and hinder scalability to high dimensions. In this work, we introduce the Riemannian Diffusion Mixture, a principled framework for building a generative process on manifolds as a mixture of endpoint-conditioned diffusion processes instead of relying on the denoising approach of previous diffusion models, for which the generative process is characterized by its drift guiding toward the most probable endpoint with respect to the geometry of the manifold. We further propose a simple yet efficient training objective for learning the mixture process, that is readily applicable to general manifolds. Our method outp",
    "path": "papers/23/10/2310.07216.json",
    "total_tokens": 914,
    "translated_title": "在流形上通过黎曼扩散过程的混合生成模型",
    "translated_abstract": "在非欧几里得空间中建模数据的分布对于来自不同科学领域的许多应用都至关重要。然而，现有的流形上的生成模型存在着计算复杂的散度或依赖于热核的近似的问题。这些限制限制了它们在简单几何形状上的适用性，并阻碍了在高维空间中的可扩展性。在这项工作中，我们引入了黎曼扩散混合模型，这是一个在流形上构建生成过程的原则性框架，它是一组以端点条件扩散过程作为混合的生成过程，而不依赖于先前扩散模型的去噪方法，对于这些模型，生成过程的特性是它的漂移导向与流形的几何形状相对应的最可能的终点。我们进一步提出了一个简单而高效的训练目标，用于学习混合过程，它可以直接应用于一般流形。我们的方法表现得很好。",
    "tldr": "通过混合黎曼扩散过程的原则性框架，我们提出了一种在流形上构建生成过程的方法，与现有的生成模型相比，该方法具有更高的效率和更广泛的适用性。"
}