{
    "title": "Conservative Predictions on Noisy Financial Data. (arXiv:2310.11815v1 [cs.LG])",
    "abstract": "Price movements in financial markets are well known to be very noisy. As a result, even if there are, on occasion, exploitable patterns that could be picked up by machine-learning algorithms, these are obscured by feature and label noise rendering the predictions less useful, and risky in practice. Traditional rule-learning techniques developed for noisy data, such as CN2, would seek only high precision rules and refrain from making predictions where their antecedents did not apply. We apply a similar approach, where a model abstains from making a prediction on data points that it is uncertain on. During training, a cascade of such models are learned in sequence, similar to rule lists, with each model being trained only on data on which the previous model(s) were uncertain. Similar pruning of data takes place at test-time, with (higher accuracy) predictions being made albeit only on a fraction (support) of test-time data. In a financial prediction setting, such an approach allows decis",
    "link": "http://arxiv.org/abs/2310.11815",
    "context": "Title: Conservative Predictions on Noisy Financial Data. (arXiv:2310.11815v1 [cs.LG])\nAbstract: Price movements in financial markets are well known to be very noisy. As a result, even if there are, on occasion, exploitable patterns that could be picked up by machine-learning algorithms, these are obscured by feature and label noise rendering the predictions less useful, and risky in practice. Traditional rule-learning techniques developed for noisy data, such as CN2, would seek only high precision rules and refrain from making predictions where their antecedents did not apply. We apply a similar approach, where a model abstains from making a prediction on data points that it is uncertain on. During training, a cascade of such models are learned in sequence, similar to rule lists, with each model being trained only on data on which the previous model(s) were uncertain. Similar pruning of data takes place at test-time, with (higher accuracy) predictions being made albeit only on a fraction (support) of test-time data. In a financial prediction setting, such an approach allows decis",
    "path": "papers/23/10/2310.11815.json",
    "total_tokens": 773,
    "translated_title": "在嘈杂的金融数据上进行保守预测",
    "translated_abstract": "金融市场的价格波动被认为是非常嘈杂的。因此，即使机器学习算法偶尔能够捕捉到可利用的模式，由于特征和标签的噪声，这些模式往往被掩盖，使得预测变得不太有用且存在风险。我们应用了一种类似的方法，即模型在对不确定的数据点上不进行预测。在训练过程中，一系列这样的模型按序进行学习，类似于规则列表，每个模型仅在前面的模型对其不确定的数据上进行训练。测试时也会进行类似的数据剪枝，只对测试数据的一部分（支持集）进行预测，从而获得更高的准确性。",
    "tldr": "在嘈杂的金融数据上进行保守预测，通过对不确定的数据点进行剪枝，以提高预测的准确性。"
}