{
    "title": "Managing Persuasion Robustly: The Optimality of Quota Rules. (arXiv:2310.10024v1 [econ.TH])",
    "abstract": "We study a sender-receiver model where the receiver can commit to a decision rule before the sender determines the information policy. The decision rule can depend on the signal structure and the signal realization that the sender adopts. This framework captures applications where a decision-maker (the receiver) solicit advice from an interested party (sender). In these applications, the receiver faces uncertainty regarding the sender's preferences and the set of feasible signal structures. Consequently, we adopt a unified robust analysis framework that includes max-min utility, min-max regret, and min-max approximation ratio as special cases. We show that it is optimal for the receiver to sacrifice ex-post optimality to perfectly align the sender's incentive. The optimal decision rule is a quota rule, i.e., the decision rule maximizes the receiver's ex-ante payoff subject to the constraint that the marginal distribution over actions adheres to a consistent quota, regardless of the sen",
    "link": "http://arxiv.org/abs/2310.10024",
    "context": "Title: Managing Persuasion Robustly: The Optimality of Quota Rules. (arXiv:2310.10024v1 [econ.TH])\nAbstract: We study a sender-receiver model where the receiver can commit to a decision rule before the sender determines the information policy. The decision rule can depend on the signal structure and the signal realization that the sender adopts. This framework captures applications where a decision-maker (the receiver) solicit advice from an interested party (sender). In these applications, the receiver faces uncertainty regarding the sender's preferences and the set of feasible signal structures. Consequently, we adopt a unified robust analysis framework that includes max-min utility, min-max regret, and min-max approximation ratio as special cases. We show that it is optimal for the receiver to sacrifice ex-post optimality to perfectly align the sender's incentive. The optimal decision rule is a quota rule, i.e., the decision rule maximizes the receiver's ex-ante payoff subject to the constraint that the marginal distribution over actions adheres to a consistent quota, regardless of the sen",
    "path": "papers/23/10/2310.10024.json",
    "total_tokens": 863,
    "translated_title": "高效管理说服力：定额规则的最优性",
    "translated_abstract": "我们研究了一个发送者-接收者模型，其中接收者可以在发送者确定信息策略之前承诺一个决策规则。决策规则可以依赖于信号结构和发送者采用的信号实现。这个框架涵盖了从一个利益相关方（发送者）那里征求意见的决策者（接收者）面临的不确定性。在这些应用中，接收者面临着对发送者偏好和可行信号结构集合的不确定性。因此，我们采用了一个统一的鲁棒分析框架，将最大最小效用、最小最大遗憾和最小最大近似比纳入了特殊情况。我们表明，为了完全保持发送者的激励一致，接收者在实现后期最优性的同时，牺牲了一致性定额规则下行动的边际分布。最优决策规则是一个配额规则，即决策规则在保证约束条件下，最大化接收者的期望收益。",
    "tldr": "接收者在承诺决策规则时，最优策略是采用配额规则，以完全保持发送者的激励一致。"
}