{
    "title": "Cultural Adaptation of Recipes. (arXiv:2310.17353v1 [cs.CL])",
    "abstract": "Building upon the considerable advances in Large Language Models (LLMs), we are now equipped to address more sophisticated tasks demanding a nuanced understanding of cross-cultural contexts. A key example is recipe adaptation, which goes beyond simple translation to include a grasp of ingredients, culinary techniques, and dietary preferences specific to a given culture. We introduce a new task involving the translation and cultural adaptation of recipes between Chinese and English-speaking cuisines. To support this investigation, we present CulturalRecipes, a unique dataset comprised of automatically paired recipes written in Mandarin Chinese and English. This dataset is further enriched with a human-written and curated test set. In this intricate task of cross-cultural recipe adaptation, we evaluate the performance of various methods, including GPT-4 and other LLMs, traditional machine translation, and information retrieval techniques. Our comprehensive analysis includes both automati",
    "link": "http://arxiv.org/abs/2310.17353",
    "context": "Title: Cultural Adaptation of Recipes. (arXiv:2310.17353v1 [cs.CL])\nAbstract: Building upon the considerable advances in Large Language Models (LLMs), we are now equipped to address more sophisticated tasks demanding a nuanced understanding of cross-cultural contexts. A key example is recipe adaptation, which goes beyond simple translation to include a grasp of ingredients, culinary techniques, and dietary preferences specific to a given culture. We introduce a new task involving the translation and cultural adaptation of recipes between Chinese and English-speaking cuisines. To support this investigation, we present CulturalRecipes, a unique dataset comprised of automatically paired recipes written in Mandarin Chinese and English. This dataset is further enriched with a human-written and curated test set. In this intricate task of cross-cultural recipe adaptation, we evaluate the performance of various methods, including GPT-4 and other LLMs, traditional machine translation, and information retrieval techniques. Our comprehensive analysis includes both automati",
    "path": "papers/23/10/2310.17353.json",
    "total_tokens": 872,
    "translated_title": "食谱的文化适应",
    "translated_abstract": "在大型语言模型（LLM）取得显著进展的基础上，我们现在有能力解决更复杂的任务，需要对跨文化环境有一个细致的理解。一个关键的例子是食谱的适应，这超出了简单的翻译，还包括对某个特定文化的食材、烹饪技巧和膳食偏好的掌握。我们介绍了一个涉及中餐和英语国家菜系之间食谱的翻译和文化适应的新任务。为了支持这项调查，我们提供了CulturalRecipes，这是一个由自动配对的中文和英文食谱构成的独特数据集。该数据集还通过人工编写和精心策划的测试集进行了丰富。在这个复杂的跨文化食谱适应任务中，我们评估了各种方法的性能，包括GPT-4和其他LLM、传统机器翻译和信息检索技术。我们的综合分析包括自动化和人工评估方面的内容。",
    "tldr": "本研究介绍了一项涉及中餐和英语国家菜系之间食谱的翻译和文化适应的新任务，提供了一个独特的数据集并评估了多种方法的性能。",
    "en_tdlr": "This study introduces a new task of translating and culturally adapting recipes between Chinese and English-speaking cuisines, presents a unique dataset, and evaluates the performance of various methods."
}