{
    "title": "Outlier Detection Using Generative Models with Theoretical Performance Guarantees. (arXiv:2310.09999v1 [stat.ML])",
    "abstract": "This paper considers the problem of recovering signals modeled by generative models from linear measurements contaminated with sparse outliers. We propose an outlier detection approach for reconstructing the ground-truth signals modeled by generative models under sparse outliers. We establish theoretical recovery guarantees for reconstruction of signals using generative models in the presence of outliers, giving lower bounds on the number of correctable outliers. Our results are applicable to both linear generator neural networks and the nonlinear generator neural networks with an arbitrary number of layers. We propose an iterative alternating direction method of multipliers (ADMM) algorithm for solving the outlier detection problem via $\\ell_1$ norm minimization, and a gradient descent algorithm for solving the outlier detection problem via squared $\\ell_1$ norm minimization. We conduct extensive experiments using variational auto-encoder and deep convolutional generative adversarial ",
    "link": "http://arxiv.org/abs/2310.09999",
    "context": "Title: Outlier Detection Using Generative Models with Theoretical Performance Guarantees. (arXiv:2310.09999v1 [stat.ML])\nAbstract: This paper considers the problem of recovering signals modeled by generative models from linear measurements contaminated with sparse outliers. We propose an outlier detection approach for reconstructing the ground-truth signals modeled by generative models under sparse outliers. We establish theoretical recovery guarantees for reconstruction of signals using generative models in the presence of outliers, giving lower bounds on the number of correctable outliers. Our results are applicable to both linear generator neural networks and the nonlinear generator neural networks with an arbitrary number of layers. We propose an iterative alternating direction method of multipliers (ADMM) algorithm for solving the outlier detection problem via $\\ell_1$ norm minimization, and a gradient descent algorithm for solving the outlier detection problem via squared $\\ell_1$ norm minimization. We conduct extensive experiments using variational auto-encoder and deep convolutional generative adversarial ",
    "path": "papers/23/10/2310.09999.json",
    "total_tokens": 839,
    "translated_title": "使用具有理论性能保证的生成模型进行异常值检测",
    "translated_abstract": "本文考虑了利用生成模型从受稀疏异常值污染的线性测量中恢复信号的问题。我们提出了一种用于在受稀疏异常值下重建由生成模型建模的真实信号的异常值检测方法。我们在存在异常值的情况下建立了使用生成模型重建信号的理论恢复保证，并给出了可纠正异常值数量的下界。我们的结果适用于具有任意层数的线性生成器神经网络和非线性生成器神经网络。我们提出了一种用于通过$\\ell_1$范数最小化解决异常值检测问题的迭代交替方向乘子法（ADMM）算法，以及一种用于通过平方$\\ell_1$范数最小化解决异常值检测问题的梯度下降算法。我们使用变分自编码器和深度卷积生成对抗网络进行了广泛实验。",
    "tldr": "本文提出了一种利用生成模型进行异常值检测的方法，建立了在受稀疏异常值下使用生成模型重建信号的理论保证，给出了下界，并提出了两个算法解决异常值检测问题。",
    "en_tdlr": "This paper proposes a method for outlier detection using generative models, establishes theoretical guarantees for signal reconstruction under sparse outliers, gives lower bounds, and introduces two algorithms to solve the outlier detection problem."
}