{
    "title": "Efficient option pricing in the rough Heston model using weak simulation schemes. (arXiv:2310.04146v1 [q-fin.CP])",
    "abstract": "We provide an efficient and accurate simulation scheme for the rough Heston model in the standard ($H>0$) as well as the hyper-rough regime ($H > -1/2$). The scheme is based on low-dimensional Markovian approximations of the rough Heston process derived in [Bayer and Breneis, arXiv:2309.07023], and provides weak approximation to the rough Heston process. Numerical experiments show that the new scheme exhibits second order weak convergence, while the computational cost increases linear with respect to the number of time steps. In comparison, existing schemes based on discretization of the underlying stochastic Volterra integrals such as Gatheral's HQE scheme show a quadratic dependence of the computational cost. Extensive numerical tests for standard and path-dependent European options and Bermudan options show the method's accuracy and efficiency.",
    "link": "http://arxiv.org/abs/2310.04146",
    "context": "Title: Efficient option pricing in the rough Heston model using weak simulation schemes. (arXiv:2310.04146v1 [q-fin.CP])\nAbstract: We provide an efficient and accurate simulation scheme for the rough Heston model in the standard ($H>0$) as well as the hyper-rough regime ($H > -1/2$). The scheme is based on low-dimensional Markovian approximations of the rough Heston process derived in [Bayer and Breneis, arXiv:2309.07023], and provides weak approximation to the rough Heston process. Numerical experiments show that the new scheme exhibits second order weak convergence, while the computational cost increases linear with respect to the number of time steps. In comparison, existing schemes based on discretization of the underlying stochastic Volterra integrals such as Gatheral's HQE scheme show a quadratic dependence of the computational cost. Extensive numerical tests for standard and path-dependent European options and Bermudan options show the method's accuracy and efficiency.",
    "path": "papers/23/10/2310.04146.json",
    "total_tokens": 906,
    "translated_title": "使用弱模拟方案在粗糙Heston模型中进行高效的期权定价",
    "translated_abstract": "我们提供了一种在标准（$H>0$）和超粗糙（$H>-1/2$）范围内对粗糙Heston模型进行高效而准确的模拟方案。该方案基于对粗糙Heston过程的低维马尔可夫逼近，并提供对粗糙Heston过程的弱逼近。数值实验表明，新方案表现出二阶弱收敛性，而计算成本与时间步长的数量线性增加。相比之下，基于对潜在随机Volterra积分的离散化的现有方案（如Gatheral的HQE方案）计算成本呈二次依赖关系。对标准和路径依赖欧式期权以及百慕大期权进行的大量数值测试显示了该方法的准确性和效率。",
    "tldr": "本文提出了一种在粗糙Heston模型中高效且准确的模拟方案，通过低维马尔可夫逼近实现对该模型的弱逼近。该方案在计算成本方面具有线性增加，并表现出二阶弱收敛性。在对多种类型期权进行的数值测试中展示了方案的准确性和效率。",
    "en_tdlr": "This paper proposes an efficient and accurate simulation scheme for the rough Heston model, which utilizes low-dimensional Markovian approximations to achieve weak approximation. The scheme exhibits second order weak convergence and linear computational cost. Extensive numerical tests demonstrate its accuracy and efficiency in pricing various types of options."
}