{
    "title": "Does Invariant Graph Learning via Environment Augmentation Learn Invariance?. (arXiv:2310.19035v1 [cs.LG])",
    "abstract": "Invariant graph representation learning aims to learn the invariance among data from different environments for out-of-distribution generalization on graphs. As the graph environment partitions are usually expensive to obtain, augmenting the environment information has become the de facto approach. However, the usefulness of the augmented environment information has never been verified. In this work, we find that it is fundamentally impossible to learn invariant graph representations via environment augmentation without additional assumptions. Therefore, we develop a set of minimal assumptions, including variation sufficiency and variation consistency, for feasible invariant graph learning. We then propose a new framework Graph invAriant Learning Assistant (GALA). GALA incorporates an assistant model that needs to be sensitive to graph environment changes or distribution shifts. The correctness of the proxy predictions by the assistant model hence can differentiate the variations in sp",
    "link": "http://arxiv.org/abs/2310.19035",
    "context": "Title: Does Invariant Graph Learning via Environment Augmentation Learn Invariance?. (arXiv:2310.19035v1 [cs.LG])\nAbstract: Invariant graph representation learning aims to learn the invariance among data from different environments for out-of-distribution generalization on graphs. As the graph environment partitions are usually expensive to obtain, augmenting the environment information has become the de facto approach. However, the usefulness of the augmented environment information has never been verified. In this work, we find that it is fundamentally impossible to learn invariant graph representations via environment augmentation without additional assumptions. Therefore, we develop a set of minimal assumptions, including variation sufficiency and variation consistency, for feasible invariant graph learning. We then propose a new framework Graph invAriant Learning Assistant (GALA). GALA incorporates an assistant model that needs to be sensitive to graph environment changes or distribution shifts. The correctness of the proxy predictions by the assistant model hence can differentiate the variations in sp",
    "path": "papers/23/10/2310.19035.json",
    "total_tokens": 887,
    "translated_title": "使用环境增强的不变图学习能够学习到不变性吗？",
    "translated_abstract": "不变图表示学习旨在学习不同环境下数据的不变性，以实现对图的超出分布的泛化。由于图环境划分通常很昂贵，增强环境信息已成为事实上的方法。然而，增强的环境信息的有效性还没有被验证过。在这项工作中，我们发现在没有额外假设的情况下，通过环境增强无法根本性地学习到不变的图表示。因此，我们提出了一组最小的假设，包括变化充分性和变化一致性，用于可行的不变图学习。然后，我们提出了一个新的框架 Graph invAriant LearningAssistant (GALA)。GALA包含一个助理模型，需要对图环境的变化或分布的变化敏感。因此，助理模型的代理预测的准确性可以区分变异。",
    "tldr": "环境增强无法根本性地学习到不变的图表示，因此我们提出了一组最小的假设，用于可行的不变图学习。我们还提出了一个新的框架GALA，该框架包含一个敏感于图环境变化的助理模型，通过代理预测准确性来区分变异。"
}