{
    "title": "Acquiring Weak Annotations for Tumor Localization in Temporal and Volumetric Data",
    "abstract": "arXiv:2310.15098v2 Announce Type: replace-cross  Abstract: Creating large-scale and well-annotated datasets to train AI algorithms is crucial for automated tumor detection and localization. However, with limited resources, it is challenging to determine the best type of annotations when annotating massive amounts of unlabeled data. To address this issue, we focus on polyps in colonoscopy videos and pancreatic tumors in abdominal CT scans; both applications require significant effort and time for pixel-wise annotation due to the high dimensional nature of the data, involving either temporary or spatial dimensions. In this paper, we develop a new annotation strategy, termed Drag&Drop, which simplifies the annotation process to drag and drop. This annotation strategy is more efficient, particularly for temporal and volumetric imaging, than other types of weak annotations, such as per-pixel, bounding boxes, scribbles, ellipses, and points. Furthermore, to exploit our Drag&Drop annotations,",
    "link": "https://arxiv.org/abs/2310.15098",
    "context": "Title: Acquiring Weak Annotations for Tumor Localization in Temporal and Volumetric Data\nAbstract: arXiv:2310.15098v2 Announce Type: replace-cross  Abstract: Creating large-scale and well-annotated datasets to train AI algorithms is crucial for automated tumor detection and localization. However, with limited resources, it is challenging to determine the best type of annotations when annotating massive amounts of unlabeled data. To address this issue, we focus on polyps in colonoscopy videos and pancreatic tumors in abdominal CT scans; both applications require significant effort and time for pixel-wise annotation due to the high dimensional nature of the data, involving either temporary or spatial dimensions. In this paper, we develop a new annotation strategy, termed Drag&Drop, which simplifies the annotation process to drag and drop. This annotation strategy is more efficient, particularly for temporal and volumetric imaging, than other types of weak annotations, such as per-pixel, bounding boxes, scribbles, ellipses, and points. Furthermore, to exploit our Drag&Drop annotations,",
    "path": "papers/23/10/2310.15098.json",
    "total_tokens": 861,
    "translated_title": "在时间和容积数据中获取肿瘤定位的弱标注",
    "translated_abstract": "创建大规模和良好标注的数据集以训练人工智能算法对于自动化肿瘤检测和定位至关重要。然而，当资源有限时，在标记大量未标记数据时确定最佳类型标注是具有挑战性的。为了解决这个问题，我们专注于结肠镜检查视频中的息肉和腹部CT扫描中的胰腺肿瘤；这两种应用由于数据的高维特性，涉及临时或空间维度，因此对每像素的标注需要大量的努力和时间。在本文中，我们开发了一种新的标注策略，称为Drag&Drop，它简化了标注过程，使之变得更加高效，特别适用于时间和容积成像，比其他类型的弱标注（例如每像素、边界框、涂鸦、椭圆和点）更有效。此外，为了利用我们的Drag&Drop标注，",
    "tldr": "本研究提出一种名为 Drag&Drop 的新标注策略，相较于其他类型的弱标注，特别适合时间和容积成像，可简化肿瘤定位的标注过程。",
    "en_tdlr": "This study introduces a new annotation strategy called Drag&Drop, which is particularly suitable for temporal and volumetric imaging and can simplify the annotation process for tumor localization compared to other types of weak annotations."
}