{
    "title": "AUC-mixup: Deep AUC Maximization with Mixup. (arXiv:2310.11693v1 [cs.LG])",
    "abstract": "While deep AUC maximization (DAM) has shown remarkable success on imbalanced medical tasks, e.g., chest X-rays classification and skin lesions classification, it could suffer from severe overfitting when applied to small datasets due to its aggressive nature of pushing prediction scores of positive data away from that of negative data. This paper studies how to improve generalization of DAM by mixup data augmentation -- an approach that is widely used for improving generalization of the cross-entropy loss based deep learning methods. %For overfitting issues arising from limited data, the common approach is to employ mixup data augmentation to boost the models' generalization performance by enriching the training data. However, AUC is defined over positive and negative pairs, which makes it challenging to incorporate mixup data augmentation into DAM algorithms. To tackle this challenge, we employ the AUC margin loss and incorporate soft labels into the formulation to effectively learn f",
    "link": "http://arxiv.org/abs/2310.11693",
    "context": "Title: AUC-mixup: Deep AUC Maximization with Mixup. (arXiv:2310.11693v1 [cs.LG])\nAbstract: While deep AUC maximization (DAM) has shown remarkable success on imbalanced medical tasks, e.g., chest X-rays classification and skin lesions classification, it could suffer from severe overfitting when applied to small datasets due to its aggressive nature of pushing prediction scores of positive data away from that of negative data. This paper studies how to improve generalization of DAM by mixup data augmentation -- an approach that is widely used for improving generalization of the cross-entropy loss based deep learning methods. %For overfitting issues arising from limited data, the common approach is to employ mixup data augmentation to boost the models' generalization performance by enriching the training data. However, AUC is defined over positive and negative pairs, which makes it challenging to incorporate mixup data augmentation into DAM algorithms. To tackle this challenge, we employ the AUC margin loss and incorporate soft labels into the formulation to effectively learn f",
    "path": "papers/23/10/2310.11693.json",
    "total_tokens": 764,
    "translated_title": "AUC-mixup: 结合mixup的深度AUC最大化方法",
    "translated_abstract": "深度AUC最大化（DAM）在不平衡医学任务中取得了显著的成功，例如胸部X光分类和皮肤损伤分类。然而，当应用于小数据集时，由于其将正样本的预测分数与负样本的分数远离的激进性，可能会导致严重的过拟合问题。本文研究了如何通过mixup数据增强方法来改善DAM的泛化能力，mixup是一种广泛用于提高交叉熵损失基础的深度学习方法的泛化能力的方法。",
    "tldr": "本文研究了如何通过mixup数据增强方法来改善深度AUC最大化方法（DAM）的泛化能力，以解决在应用于小数据集时可能导致过拟合问题的挑战。",
    "en_tdlr": "This paper investigates how to improve the generalization of deep AUC maximization (DAM) with mixup data augmentation, aiming to address the challenge of potential overfitting when applied to small datasets."
}