{
    "title": "LSA64: An Argentinian Sign Language Dataset. (arXiv:2310.17429v1 [cs.CV])",
    "abstract": "Automatic sign language recognition is a research area that encompasses human-computer interaction, computer vision and machine learning. Robust automatic recognition of sign language could assist in the translation process and the integration of hearing-impaired people, as well as the teaching of sign language to the hearing population. Sign languages differ significantly in different countries and even regions, and their syntax and semantics are different as well from those of written languages. While the techniques for automatic sign language recognition are mostly the same for different languages, training a recognition system for a new language requires having an entire dataset for that language. This paper presents a dataset of 64 signs from the Argentinian Sign Language (LSA). The dataset, called LSA64, contains 3200 videos of 64 different LSA signs recorded by 10 subjects, and is a first step towards building a comprehensive research-level dataset of Argentinian signs, specific",
    "link": "http://arxiv.org/abs/2310.17429",
    "context": "Title: LSA64: An Argentinian Sign Language Dataset. (arXiv:2310.17429v1 [cs.CV])\nAbstract: Automatic sign language recognition is a research area that encompasses human-computer interaction, computer vision and machine learning. Robust automatic recognition of sign language could assist in the translation process and the integration of hearing-impaired people, as well as the teaching of sign language to the hearing population. Sign languages differ significantly in different countries and even regions, and their syntax and semantics are different as well from those of written languages. While the techniques for automatic sign language recognition are mostly the same for different languages, training a recognition system for a new language requires having an entire dataset for that language. This paper presents a dataset of 64 signs from the Argentinian Sign Language (LSA). The dataset, called LSA64, contains 3200 videos of 64 different LSA signs recorded by 10 subjects, and is a first step towards building a comprehensive research-level dataset of Argentinian signs, specific",
    "path": "papers/23/10/2310.17429.json",
    "total_tokens": 870,
    "translated_title": "LSA64：阿根廷手语数据集",
    "translated_abstract": "自动手语识别是涵盖人机交互、计算机视觉和机器学习的研究领域。稳健的自动手语识别可以帮助翻译过程和融合听障人士，同时也可以教授听觉人群手语。不同国家甚至地区的手语差异显著,它们的语法和语义与书面语言也不同。尽管对于不同语言的自动手语识别技术大致相同，但要训练一个新语言的识别系统，就需要有这个语言的整个数据集。本文提出了一个来自阿根廷手语（LSA）的64个手势的数据集LSA64。这个数据集包含由10个受试者录制的64个不同LSA手势的3200个视频，是构建阿根廷手势全面研究级数据集的第一步。",
    "tldr": "这篇论文介绍了一个来自阿根廷手语的数据集LSA64。该数据集包含3200个视频，包括64个不同的阿根廷手语手势，为构建一个全面的阿根廷手势研究级数据集迈出了第一步。",
    "en_tdlr": "This paper presents a dataset called LSA64, which consists of 3200 videos of 64 different signs from the Argentinian Sign Language. It is a first step towards building a comprehensive research-level dataset of Argentinian signs."
}