{
    "title": "Understanding and Visualizing Droplet Distributions in Simulations of Shallow Clouds. (arXiv:2310.20168v1 [cs.LG])",
    "abstract": "Thorough analysis of local droplet-level interactions is crucial to better understand the microphysical processes in clouds and their effect on the global climate. High-accuracy simulations of relevant droplet size distributions from Large Eddy Simulations (LES) of bin microphysics challenge current analysis techniques due to their high dimensionality involving three spatial dimensions, time, and a continuous range of droplet sizes. Utilizing the compact latent representations from Variational Autoencoders (VAEs), we produce novel and intuitive visualizations for the organization of droplet sizes and their evolution over time beyond what is possible with clustering techniques. This greatly improves interpretation and allows us to examine aerosol-cloud interactions by contrasting simulations with different aerosol concentrations. We find that the evolution of the droplet spectrum is similar across aerosol levels but occurs at different paces. This similarity suggests that precipitation ",
    "link": "http://arxiv.org/abs/2310.20168",
    "context": "Title: Understanding and Visualizing Droplet Distributions in Simulations of Shallow Clouds. (arXiv:2310.20168v1 [cs.LG])\nAbstract: Thorough analysis of local droplet-level interactions is crucial to better understand the microphysical processes in clouds and their effect on the global climate. High-accuracy simulations of relevant droplet size distributions from Large Eddy Simulations (LES) of bin microphysics challenge current analysis techniques due to their high dimensionality involving three spatial dimensions, time, and a continuous range of droplet sizes. Utilizing the compact latent representations from Variational Autoencoders (VAEs), we produce novel and intuitive visualizations for the organization of droplet sizes and their evolution over time beyond what is possible with clustering techniques. This greatly improves interpretation and allows us to examine aerosol-cloud interactions by contrasting simulations with different aerosol concentrations. We find that the evolution of the droplet spectrum is similar across aerosol levels but occurs at different paces. This similarity suggests that precipitation ",
    "path": "papers/23/10/2310.20168.json",
    "total_tokens": 1067,
    "translated_title": "理解和可视化浅云模拟中的液滴分布",
    "translated_abstract": "对局部液滴级别交互的深入分析对于更好地理解云中微物理过程及其对全球气候的影响至关重要。基于大涡模拟（Large Eddy Simulations，LES）中液滴尺寸分布的高精度模拟挑战当前的分析技术，由于它们涉及三个空间维度、时间和连续范围的液滴尺寸，导致维度非常高。利用变分自编码器（Variational Autoencoders，VAEs）的紧凑潜在表示，我们能够产生新颖且直观的可视化效果，展示液滴尺寸的组织和其随时间的演化特征。这极大地提高了解释能力，并且让我们能够通过对比不同气溶胶浓度的模拟来研究气溶胶与云的相互作用。我们发现，液滴谱的演化在不同的气溶胶水平下很相似，但速度不同。这种相似性表明降水可能受到气溶胶浓度的影响，同时还提供了对云微物理过程的新认识。",
    "tldr": "通过利用变分自编码器（VAEs）的紧凑潜在表示，我们能够产生新颖且直观的可视化效果，展示了浅云模拟中液滴尺寸的组织和演化特征。对比不同气溶胶浓度的模拟，我们发现液滴谱的演化在不同的气溶胶水平下很相似，但速度不同，这为气溶胶与云的相互作用提供了新的认识。",
    "en_tdlr": "By utilizing the compact latent representations from Variational Autoencoders (VAEs), we produce novel and intuitive visualizations for the organization and evolution of droplet sizes in simulations of shallow clouds. Comparing simulations with different aerosol concentrations, we find that the evolution of the droplet spectrum is similar across aerosol levels but occurs at different paces, providing new insights into aerosol-cloud interactions."
}