{
    "title": "Incentives for Private Industrial Investment in historical perspective: the case of industrial promotion and investment promotion in Uruguay (1974-2010). (arXiv:2310.07738v1 [econ.GN])",
    "abstract": "Using as a central instrument a new database, resulting from a compilation of historical administrative records, which covers the period 1974-2010, we can have new evidence on how industrial companies used tax benefits, and claim that these are decisive for the investment decision of the Uruguayan industrial companies during that period. The aforementioned findings served as a raw material to also affirm that the incentives to increase investment are factors that positively influence the level of economic activity and exports, and negatively on the unemployment rate.",
    "link": "http://arxiv.org/abs/2310.07738",
    "context": "Title: Incentives for Private Industrial Investment in historical perspective: the case of industrial promotion and investment promotion in Uruguay (1974-2010). (arXiv:2310.07738v1 [econ.GN])\nAbstract: Using as a central instrument a new database, resulting from a compilation of historical administrative records, which covers the period 1974-2010, we can have new evidence on how industrial companies used tax benefits, and claim that these are decisive for the investment decision of the Uruguayan industrial companies during that period. The aforementioned findings served as a raw material to also affirm that the incentives to increase investment are factors that positively influence the level of economic activity and exports, and negatively on the unemployment rate.",
    "path": "papers/23/10/2310.07738.json",
    "total_tokens": 759,
    "translated_title": "历史视角下对私人工业投资的激励措施：乌拉圭工业推动和投资促进的案例研究（1974-2010）",
    "translated_abstract": "利用一份新的数据库，该数据库是基于历史行政记录的编制而来，涵盖了1974-2010年的时期，我们可以得到关于乌拉圭工业公司如何利用税收优惠的新证据，并声称这些优惠对乌拉圭工业公司的投资决策有决定性的影响。上述发现还证实了增加投资的激励措施对经济活动水平和出口水平具有积极影响，对失业率具有负面影响。",
    "tldr": "在乌拉圭1974-2010年的历史时期，研究发现工业公司对税收优惠敏感，这对于他们的投资决策起到了决定性的影响。此外，增加投资的激励措施对经济活动和出口有积极影响，但对失业率有负面影响。",
    "en_tdlr": "A study on private industrial investment in Uruguay from 1974-2010 reveals that tax benefits played a decisive role in the investment decisions of industrial companies. Furthermore, incentives to increase investment have a positive impact on economic activity and exports, but a negative effect on unemployment rate."
}