{
    "title": "Preserving Phonemic Distinctions for Ordinal Regression: A Novel Loss Function for Automatic Pronunciation Assessment. (arXiv:2310.01839v1 [eess.AS])",
    "abstract": "Automatic pronunciation assessment (APA) manages to quantify the pronunciation proficiency of a second language (L2) learner in a language. Prevailing approaches to APA normally leverage neural models trained with a regression loss function, such as the mean-squared error (MSE) loss, for proficiency level prediction. Despite most regression models can effectively capture the ordinality of proficiency levels in the feature space, they are confronted with a primary obstacle that different phoneme categories with the same proficiency level are inevitably forced to be close to each other, retaining less phoneme-discriminative information. On account of this, we devise a phonemic contrast ordinal (PCO) loss for training regression-based APA models, which aims to preserve better phonemic distinctions between phoneme categories meanwhile considering ordinal relationships of the regression target output. Specifically, we introduce a phoneme-distinct regularizer into the MSE loss, which encoura",
    "link": "http://arxiv.org/abs/2310.01839",
    "context": "Title: Preserving Phonemic Distinctions for Ordinal Regression: A Novel Loss Function for Automatic Pronunciation Assessment. (arXiv:2310.01839v1 [eess.AS])\nAbstract: Automatic pronunciation assessment (APA) manages to quantify the pronunciation proficiency of a second language (L2) learner in a language. Prevailing approaches to APA normally leverage neural models trained with a regression loss function, such as the mean-squared error (MSE) loss, for proficiency level prediction. Despite most regression models can effectively capture the ordinality of proficiency levels in the feature space, they are confronted with a primary obstacle that different phoneme categories with the same proficiency level are inevitably forced to be close to each other, retaining less phoneme-discriminative information. On account of this, we devise a phonemic contrast ordinal (PCO) loss for training regression-based APA models, which aims to preserve better phonemic distinctions between phoneme categories meanwhile considering ordinal relationships of the regression target output. Specifically, we introduce a phoneme-distinct regularizer into the MSE loss, which encoura",
    "path": "papers/23/10/2310.01839.json",
    "total_tokens": 953,
    "translated_title": "保留音位差异的序数回归：一种用于自动发音评估的新型损失函数",
    "translated_abstract": "自动发音评估（APA）可以量化第二语言（L2）学习者在语言中的发音熟练程度。常见的APA方法通常利用神经模型和回归损失函数（如均方误差损失）进行熟练水平预测。尽管大多数回归模型可以在特征空间有效地捕捉到熟练水平的有序性，但它们面临一个主要障碍，即不同音素类别的相同熟练水平必然被迫靠得很近，保留了更少的音位—区分信息。因此，我们设计了一种用于训练基于回归的APA模型的音位对比序数（PCO）损失，旨在在保持音位类别之间更好的音位差异的同时，考虑回归目标输出的有序关系。具体而言，我们将一个音位—区分正则化器引入到均方误差损失中，鼓励...（待续）",
    "tldr": "这项研究提出了一种新的损失函数，用于训练自动发音评估模型。该损失函数旨在在保持音位类别之间更好的音位差异的同时，考虑到回归目标输出的有序关系。通过引入音位-区分正则化器，该方法可以有效提高发音评估的准确度。"
}