{
    "title": "Extensions of Heterogeneity in Integration and Prediction (HIP) with R Shiny Application. (arXiv:2310.08426v1 [stat.ME])",
    "abstract": "Multiple data views measured on the same set of participants is becoming more common and has the potential to deepen our understanding of many complex diseases by analyzing these different views simultaneously. Equally important, many of these complex diseases show evidence of subgroup heterogeneity (e.g., by sex or race). HIP (Heterogeneity in Integration and Prediction) is among the first methods proposed to integrate multiple data views while also accounting for subgroup heterogeneity to identify common and subgroup-specific markers of a particular disease. However, HIP is applicable to continuous outcomes and requires programming expertise by the user. Here we propose extensions to HIP that accommodate multi-class, Poisson, and Zero-Inflated Poisson outcomes while retaining the benefits of HIP. Additionally, we introduce an R Shiny application, accessible on shinyapps.io at https://multi-viewlearn.shinyapps.io/HIP_ShinyApp/, that provides an interface with the Python implementation",
    "link": "http://arxiv.org/abs/2310.08426",
    "context": "Title: Extensions of Heterogeneity in Integration and Prediction (HIP) with R Shiny Application. (arXiv:2310.08426v1 [stat.ME])\nAbstract: Multiple data views measured on the same set of participants is becoming more common and has the potential to deepen our understanding of many complex diseases by analyzing these different views simultaneously. Equally important, many of these complex diseases show evidence of subgroup heterogeneity (e.g., by sex or race). HIP (Heterogeneity in Integration and Prediction) is among the first methods proposed to integrate multiple data views while also accounting for subgroup heterogeneity to identify common and subgroup-specific markers of a particular disease. However, HIP is applicable to continuous outcomes and requires programming expertise by the user. Here we propose extensions to HIP that accommodate multi-class, Poisson, and Zero-Inflated Poisson outcomes while retaining the benefits of HIP. Additionally, we introduce an R Shiny application, accessible on shinyapps.io at https://multi-viewlearn.shinyapps.io/HIP_ShinyApp/, that provides an interface with the Python implementation",
    "path": "papers/23/10/2310.08426.json",
    "total_tokens": 854,
    "translated_title": "Heterogeneity in Integration and Prediction (HIP)的扩展与R Shiny应用",
    "translated_abstract": "多个数据视图在同一组参与者上的测量越来越常见，并且通过同时分析这些不同视图，有可能加深我们对许多复杂疾病的理解。同样重要的是，许多复杂疾病显示出亚组异质性（例如性别或种族）。HIP（Heterogeneity in Integration and Prediction）是最早提出的一种方法，用于集成多个数据视图，同时考虑亚组异质性，以确定特定疾病的共有和亚组特异性标记物。然而，HIP适用于连续结果，并且需要用户具备编程专长。在本文中，我们提出了HIP的扩展，以适应多类别、泊松分布和零膨胀泊松分布的结果，同时保留HIP的优势。此外，我们还介绍了一个R Shiny应用，可以通过https://multi-viewlearn.shinyapps.io/HIP_ShinyApp/访问，它提供了与Python实现的接口。",
    "tldr": "本文描述了Heterogeneity in Integration and Prediction (HIP)的扩展，并提供了一个R Shiny应用界面，能够适应多种结果类型，同时保留了HIP的优势。",
    "en_tdlr": "This paper presents extensions to Heterogeneity in Integration and Prediction (HIP) and introduces an R Shiny application interface that accommodates multiple types of outcomes while retaining the advantages of HIP."
}