{
    "title": "Early Warning via tipping-preserving latent stochastic dynamical system and meta label correcting. (arXiv:2310.06059v1 [cs.LG])",
    "abstract": "Early warning for epilepsy patients is crucial for their safety and well-being, in terms of preventing or minimizing the severity of seizures. Through the patients' EEG data, we propose a meta learning framework for improving prediction on early ictal signals. To better utilize the meta label corrector method, we fuse the information from both the real data and the augmented data from the latent Stochastic differential equation(SDE). Besides, we also optimally select the latent dynamical system via distribution of transition time between real data and that from the latent SDE. In this way, the extracted tipping dynamical feature is also integrated into the meta network to better label the noisy data. To validate our method, LSTM is implemented as the baseline model. We conduct a series of experiments to predict seizure in various long-term window from 1-2 seconds input data and find surprisingly increment of prediction accuracy.",
    "link": "http://arxiv.org/abs/2310.06059",
    "context": "Title: Early Warning via tipping-preserving latent stochastic dynamical system and meta label correcting. (arXiv:2310.06059v1 [cs.LG])\nAbstract: Early warning for epilepsy patients is crucial for their safety and well-being, in terms of preventing or minimizing the severity of seizures. Through the patients' EEG data, we propose a meta learning framework for improving prediction on early ictal signals. To better utilize the meta label corrector method, we fuse the information from both the real data and the augmented data from the latent Stochastic differential equation(SDE). Besides, we also optimally select the latent dynamical system via distribution of transition time between real data and that from the latent SDE. In this way, the extracted tipping dynamical feature is also integrated into the meta network to better label the noisy data. To validate our method, LSTM is implemented as the baseline model. We conduct a series of experiments to predict seizure in various long-term window from 1-2 seconds input data and find surprisingly increment of prediction accuracy.",
    "path": "papers/23/10/2310.06059.json",
    "total_tokens": 924,
    "translated_title": "预警和隐变化随机动力学系统及元标签纠正的早期预警",
    "translated_abstract": "对癫痫患者进行早期预警对于他们的安全和福祉至关重要，可以预防或减少癫痫发作的严重程度。通过患者的脑电图数据，我们提出了一个元学习框架，以改进对早期癫痫发作信号的预测。为了更好地利用元标签纠正方法，我们融合了真实数据和隐性随机微分方程（SDE）产生的增广数据的信息。此外，我们还通过真实数据和隐性随机微分方程的过渡时间分布来优选选择潜在的动力系统。通过这种方式，提取的临界动力学特征也被集成到元网络中，以更好地标记噪声数据。为了验证我们的方法，我们将LSTM实施为基准模型。我们进行了一系列实验来预测各种长期窗口（1-2秒的输入数据）内的癫痫发作，并发现预测准确率出现了令人惊讶的增加。",
    "tldr": "提出了一种通过融合真实数据和隐性随机微分方程产生的增广数据的元学习框架，用于提高对早期癫痫发作信号的预测准确率，并通过提取的临界动力学特征来标记噪声数据。",
    "en_tdlr": "A meta learning framework is proposed to improve the prediction accuracy of early ictal signals in epilepsy patients by fusing real data and augmented data generated from a latent stochastic differential equation (SDE), and utilizing tipping dynamical features to label noisy data."
}