{
    "title": "We are what we repeatedly do: Inducing and deploying habitual schemas in persona-based responses. (arXiv:2310.06245v1 [cs.AI])",
    "abstract": "Many practical applications of dialogue technology require the generation of responses according to a particular developer-specified persona. While a variety of personas can be elicited from recent large language models, the opaqueness and unpredictability of these models make it desirable to be able to specify personas in an explicit form. In previous work, personas have typically been represented as sets of one-off pieces of self-knowledge that are retrieved by the dialogue system for use in generation. However, in realistic human conversations, personas are often revealed through story-like narratives that involve rich habitual knowledge -- knowledge about kinds of events that an agent often participates in (e.g., work activities, hobbies, sporting activities, favorite entertainments, etc.), including typical goals, sub-events, preconditions, and postconditions of those events. We capture such habitual knowledge using an explicit schema representation, and propose an approach to dia",
    "link": "http://arxiv.org/abs/2310.06245",
    "context": "Title: We are what we repeatedly do: Inducing and deploying habitual schemas in persona-based responses. (arXiv:2310.06245v1 [cs.AI])\nAbstract: Many practical applications of dialogue technology require the generation of responses according to a particular developer-specified persona. While a variety of personas can be elicited from recent large language models, the opaqueness and unpredictability of these models make it desirable to be able to specify personas in an explicit form. In previous work, personas have typically been represented as sets of one-off pieces of self-knowledge that are retrieved by the dialogue system for use in generation. However, in realistic human conversations, personas are often revealed through story-like narratives that involve rich habitual knowledge -- knowledge about kinds of events that an agent often participates in (e.g., work activities, hobbies, sporting activities, favorite entertainments, etc.), including typical goals, sub-events, preconditions, and postconditions of those events. We capture such habitual knowledge using an explicit schema representation, and propose an approach to dia",
    "path": "papers/23/10/2310.06245.json",
    "total_tokens": 918,
    "translated_title": "我们是我们反复做的事情：在基于角色的回应中引导和应用习惯性模式",
    "translated_abstract": "对话技术的许多实际应用需要根据特定的开发者规定的角色生成回应。虽然可以从最近的大型语言模型中引出许多角色，但这些模型的不透明性和不可预测性使得以明确形式指定角色成为可取的。在以前的工作中，角色通常被表示为一次性的自我知识片段的集合，对话系统会检索这些知识片段来生成回应。然而，在现实的人类对话中，角色通常通过类似故事的叙述来揭示出来，这些叙述涉及丰富的习惯性知识——关于代理人经常参与的事件类型的知识（例如，工作活动、爱好、体育活动、喜欢的娱乐等），包括这些事件的典型目标、子事件、前提条件和后置条件。我们使用明确的模式表示来捕捉这种习惯性知识，并提出了一种引导对话系统使用这些模式生成回应的方法。",
    "tldr": "该论文研究了在对话系统中引导和应用习惯性模式来生成基于角色的回应。与以往的方法不同，该论文通过明确的模式表示来捕捉与角色相关的习惯性知识，从而提高了回应的准确性和自然性。"
}