{
    "title": "Semi-Supervised Learning of Dynamical Systems with Neural Ordinary Differential Equations: A Teacher-Student Model Approach. (arXiv:2310.13110v1 [cs.LG])",
    "abstract": "Modeling dynamical systems is crucial for a wide range of tasks, but it remains challenging due to complex nonlinear dynamics, limited observations, or lack of prior knowledge. Recently, data-driven approaches such as Neural Ordinary Differential Equations (NODE) have shown promising results by leveraging the expressive power of neural networks to model unknown dynamics. However, these approaches often suffer from limited labeled training data, leading to poor generalization and suboptimal predictions. On the other hand, semi-supervised algorithms can utilize abundant unlabeled data and have demonstrated good performance in classification and regression tasks. We propose TS-NODE, the first semi-supervised approach to modeling dynamical systems with NODE. TS-NODE explores cheaply generated synthetic pseudo rollouts to broaden exploration in the state space and to tackle the challenges brought by lack of ground-truth system data under a teacher-student model. TS-NODE employs an unified o",
    "link": "http://arxiv.org/abs/2310.13110",
    "context": "Title: Semi-Supervised Learning of Dynamical Systems with Neural Ordinary Differential Equations: A Teacher-Student Model Approach. (arXiv:2310.13110v1 [cs.LG])\nAbstract: Modeling dynamical systems is crucial for a wide range of tasks, but it remains challenging due to complex nonlinear dynamics, limited observations, or lack of prior knowledge. Recently, data-driven approaches such as Neural Ordinary Differential Equations (NODE) have shown promising results by leveraging the expressive power of neural networks to model unknown dynamics. However, these approaches often suffer from limited labeled training data, leading to poor generalization and suboptimal predictions. On the other hand, semi-supervised algorithms can utilize abundant unlabeled data and have demonstrated good performance in classification and regression tasks. We propose TS-NODE, the first semi-supervised approach to modeling dynamical systems with NODE. TS-NODE explores cheaply generated synthetic pseudo rollouts to broaden exploration in the state space and to tackle the challenges brought by lack of ground-truth system data under a teacher-student model. TS-NODE employs an unified o",
    "path": "papers/23/10/2310.13110.json",
    "total_tokens": 927,
    "translated_title": "使用神经常微分方程的半监督学习动力系统：一种教师-学生模型的方法",
    "translated_abstract": "建模动力系统对于各种任务至关重要，但由于复杂的非线性动力学、有限的观察或缺乏先验知识，建模仍然具有挑战性。最近，利用神经网络的表达能力来建模未知动力学的数据驱动方法，例如神经常微分方程(NODE)，已经显示出有希望的结果。然而，这些方法常常受到有限标记训练数据的限制，导致泛化能力差和次优预测。另一方面，半监督算法可以利用丰富的无标签数据，在分类和回归任务上表现良好。我们提出了TS-NODE，这是一种使用NODE进行动力系统建模的首个半监督方法。TS-NODE利用廉价生成的伪样本探索状态空间，以解决由于缺乏真实系统数据而带来的挑战，并采用教师-学生模型的方法。",
    "tldr": "本文提出了TS-NODE，该方法是使用神经常微分方程进行动力系统建模的首个半监督方法。TS-NODE通过生成伪样本来拓宽状态空间的探索，并利用教师-学生模型解决由于缺乏真实系统数据而带来的挑战。"
}