{
    "title": "Dynamically Updating Event Representations for Temporal Relation Classification with Multi-category Learning. (arXiv:2310.20236v1 [cs.CL])",
    "abstract": "Temporal relation classification is a pair-wise task for identifying the relation of a temporal link (TLINK) between two mentions, i.e. event, time, and document creation time (DCT). It leads to two crucial limits: 1) Two TLINKs involving a common mention do not share information. 2) Existing models with independent classifiers for each TLINK category (E2E, E2T, and E2D) hinder from using the whole data. This paper presents an event centric model that allows to manage dynamic event representations across multiple TLINKs. Our model deals with three TLINK categories with multi-task learning to leverage the full size of data. The experimental results show that our proposal outperforms state-of-the-art models and two transfer learning baselines on both the English and Japanese data.",
    "link": "http://arxiv.org/abs/2310.20236",
    "context": "Title: Dynamically Updating Event Representations for Temporal Relation Classification with Multi-category Learning. (arXiv:2310.20236v1 [cs.CL])\nAbstract: Temporal relation classification is a pair-wise task for identifying the relation of a temporal link (TLINK) between two mentions, i.e. event, time, and document creation time (DCT). It leads to two crucial limits: 1) Two TLINKs involving a common mention do not share information. 2) Existing models with independent classifiers for each TLINK category (E2E, E2T, and E2D) hinder from using the whole data. This paper presents an event centric model that allows to manage dynamic event representations across multiple TLINKs. Our model deals with three TLINK categories with multi-task learning to leverage the full size of data. The experimental results show that our proposal outperforms state-of-the-art models and two transfer learning baselines on both the English and Japanese data.",
    "path": "papers/23/10/2310.20236.json",
    "total_tokens": 813,
    "translated_title": "动态更新事件表示的多类别学习用于时间关系分类",
    "translated_abstract": "时间关系分类是一种用于识别两个提及之间的时间链接（TLINK）关系的成对任务，包括事件、时间和文档创建时间（DCT）。它存在两个关键限制：1）涉及共同提及的两个TLINK不共享信息；2）现有模型使用独立分类器对每个TLINK类别（E2E，E2T和E2D）进行分类，从而无法使用全部数据。本文提出了一种以事件为中心的模型，允许在多个TLINK中管理动态事件表示。我们的模型使用多任务学习处理三个TLINK类别，以利用全部数据。实验结果表明，我们的方法在英文和日文数据上均优于现有最先进模型和两个传递学习基线模型。",
    "tldr": "本文提出了一个以事件为中心的模型，动态更新事件表示，通过多类别学习解决了时间关系分类任务中的信息共享和数据利用问题。实验证明该方法在英文和日文数据上均优于现有模型和传递学习基线模型。",
    "en_tdlr": "This paper proposes an event centric model that dynamically updates event representations for temporal relation classification. By using multi-category learning, the model addresses the limitations of information sharing and data utilization in the task. Experimental results demonstrate its superiority over state-of-the-art models and transfer learning baselines in both English and Japanese datasets."
}