{
    "title": "A Specialized Semismooth Newton Method for Kernel-Based Optimal Transport",
    "abstract": "Kernel-based optimal transport (OT) estimators offer an alternative, functional estimation procedure to address OT problems from samples. Recent works suggest that these estimators are more statistically efficient than plug-in (linear programming-based) OT estimators when comparing probability measures in high-dimensions~\\citep{Vacher-2021-Dimension}. Unfortunately, that statistical benefit comes at a very steep computational price: because their computation relies on the short-step interior-point method (SSIPM), which comes with a large iteration count in practice, these estimators quickly become intractable w.r.t. sample size $n$. To scale these estimators to larger $n$, we propose a nonsmooth fixed-point model for the kernel-based OT problem, and show that it can be efficiently solved via a specialized semismooth Newton (SSN) method: We show, exploring the problem's structure, that the per-iteration cost of performing one SSN step can be significantly reduced in practice. We prove t",
    "link": "https://arxiv.org/abs/2310.14087",
    "context": "Title: A Specialized Semismooth Newton Method for Kernel-Based Optimal Transport\nAbstract: Kernel-based optimal transport (OT) estimators offer an alternative, functional estimation procedure to address OT problems from samples. Recent works suggest that these estimators are more statistically efficient than plug-in (linear programming-based) OT estimators when comparing probability measures in high-dimensions~\\citep{Vacher-2021-Dimension}. Unfortunately, that statistical benefit comes at a very steep computational price: because their computation relies on the short-step interior-point method (SSIPM), which comes with a large iteration count in practice, these estimators quickly become intractable w.r.t. sample size $n$. To scale these estimators to larger $n$, we propose a nonsmooth fixed-point model for the kernel-based OT problem, and show that it can be efficiently solved via a specialized semismooth Newton (SSN) method: We show, exploring the problem's structure, that the per-iteration cost of performing one SSN step can be significantly reduced in practice. We prove t",
    "path": "papers/23/10/2310.14087.json",
    "total_tokens": 875,
    "translated_title": "一种专用的半光滑牛顿方法用于基于核的最优输运问题",
    "translated_abstract": "基于核的最优输运（OT）估计器提供了一种替代的功能估计方法来解决来自样本的OT问题。最近的研究表明，与插值（基于线性规划）OT估计器相比，这些估计器在高维度下比较概率测度时具有更高的统计效率。不幸的是，这种统计优势导致计算成本非常高昂：因为其计算依赖于短步长内点方法（SSIPM），在实践中迭代次数很大，这些估计器很快在样本量$n$方面变得难以处理。为了将这些估计器扩展到更大的$n$，我们提出了一种非光滑固定点模型来解决基于核的OT问题，并显示它可以通过一种专门的半光滑牛顿（SSN）方法有效地解决：我们通过探索问题的结构表明，在实践中，执行一个SSN步骤的每次迭代成本可以显著降低。",
    "tldr": "提出了一种专门的半光滑牛顿方法，用于解决基于核的最优输运问题，以提高计算效率并可扩展到大样本量。",
    "en_tdlr": "Proposed a specialized semismooth Newton method for efficient and scalable solution of kernel-based optimal transport problems, addressing the computational challenges associated with high-dimensional probability measures."
}