{
    "title": "Fair collaborative vehicle routing: A deep multi-agent reinforcement learning approach. (arXiv:2310.17485v1 [cs.LG])",
    "abstract": "Collaborative vehicle routing occurs when carriers collaborate through sharing their transportation requests and performing transportation requests on behalf of each other. This achieves economies of scale, thus reducing cost, greenhouse gas emissions and road congestion. But which carrier should partner with whom, and how much should each carrier be compensated? Traditional game theoretic solution concepts are expensive to calculate as the characteristic function scales exponentially with the number of agents. This would require solving the vehicle routing problem (NP-hard) an exponential number of times. We therefore propose to model this problem as a coalitional bargaining game solved using deep multi-agent reinforcement learning, where - crucially agents are not given access to the characteristic function. Instead, we implicitly reason about the characteristic function; thus, when deployed in production, we only need to evaluate the expensive post-collaboration vehicle routing pr",
    "link": "http://arxiv.org/abs/2310.17485",
    "context": "Title: Fair collaborative vehicle routing: A deep multi-agent reinforcement learning approach. (arXiv:2310.17485v1 [cs.LG])\nAbstract: Collaborative vehicle routing occurs when carriers collaborate through sharing their transportation requests and performing transportation requests on behalf of each other. This achieves economies of scale, thus reducing cost, greenhouse gas emissions and road congestion. But which carrier should partner with whom, and how much should each carrier be compensated? Traditional game theoretic solution concepts are expensive to calculate as the characteristic function scales exponentially with the number of agents. This would require solving the vehicle routing problem (NP-hard) an exponential number of times. We therefore propose to model this problem as a coalitional bargaining game solved using deep multi-agent reinforcement learning, where - crucially agents are not given access to the characteristic function. Instead, we implicitly reason about the characteristic function; thus, when deployed in production, we only need to evaluate the expensive post-collaboration vehicle routing pr",
    "path": "papers/23/10/2310.17485.json",
    "total_tokens": 875,
    "translated_title": "公平协作车辆路径规划：一种深度多智能体强化学习方法",
    "translated_abstract": "协作车辆路径规划是指承运商通过共享运输请求并代表对方进行运输请求，以实现规模经济，从而降低成本、减少温室气体排放和道路拥堵。然而，应该由哪个承运商与谁合作，每个承运商应该得到多少补偿呢？传统的博弈论解方案计算成本高，特征函数随着代理人数量呈指数倍增。这就需要指数次解决车辆路径规划问题（NP-hard）。因此，我们提出将该问题建模为使用深度多智能体强化学习解决的合作谈判博弈，关键是代理人无法访问特征函数。相反，我们隐含地推理特征函数；因此，在生产中部署时，仅需评估昂贵的合作后车辆路径规划问题。",
    "tldr": "这篇论文提出了一种采用深度多智能体强化学习方法解决公平协作车辆路径规划问题的方法。通过合作谈判博弈模型，并在生产中显式推理而不是访问特征函数的方式，有效降低了成本和计算复杂度。",
    "en_tdlr": "This paper presents a method for fair collaborative vehicle routing using deep multi-agent reinforcement learning. By modeling the problem as a cooperative bargaining game and implicitly reasoning about the characteristic function instead of accessing it, it effectively reduces costs and computational complexity."
}