{
    "title": "On the Correlation between Random Variables and their Principal Components. (arXiv:2310.06139v1 [cs.LG])",
    "abstract": "The article attempts to find an algebraic formula describing the correlation coefficients between random variables and the principal components representing them. As a result of the analysis, starting from selected statistics relating to individual random variables, the equivalents of these statistics relating to a set of random variables were presented in the language of linear algebra, using the concepts of vector and matrix. This made it possible, in subsequent steps, to derive the expected formula. The formula found is identical to the formula used in Factor Analysis to calculate factor loadings. The discussion showed that it is possible to apply this formula to optimize the number of principal components in Principal Component Analysis, as well as to optimize the number of factors in Factor Analysis.",
    "link": "http://arxiv.org/abs/2310.06139",
    "context": "Title: On the Correlation between Random Variables and their Principal Components. (arXiv:2310.06139v1 [cs.LG])\nAbstract: The article attempts to find an algebraic formula describing the correlation coefficients between random variables and the principal components representing them. As a result of the analysis, starting from selected statistics relating to individual random variables, the equivalents of these statistics relating to a set of random variables were presented in the language of linear algebra, using the concepts of vector and matrix. This made it possible, in subsequent steps, to derive the expected formula. The formula found is identical to the formula used in Factor Analysis to calculate factor loadings. The discussion showed that it is possible to apply this formula to optimize the number of principal components in Principal Component Analysis, as well as to optimize the number of factors in Factor Analysis.",
    "path": "papers/23/10/2310.06139.json",
    "total_tokens": 724,
    "translated_title": "关于随机变量及其主成分之间的相关性的研究",
    "translated_abstract": "本文试图找到描述随机变量与代表它们的主成分之间相关系数的代数公式。通过分析，我们从与单个随机变量相关的选定统计数据出发，将这些统计数据在线性代数语言中表示为一组随机变量的等效形式，使用向量和矩阵的概念。这使得我们能够推导出预期的公式。找到的公式与因子分析中用于计算因子载荷的公式相同。讨论表明，可以将该公式应用于优化主成分分析中的主成分数目，以及因子分析中的因子数目的优化。",
    "tldr": "本文研究了随机变量与它们的主成分之间的相关性，并找到了描述这种相关性的代数公式。这个公式可以应用于优化主成分分析和因子分析中的成分数目选择。",
    "en_tdlr": "This paper investigates the correlation between random variables and their principal components, and presents an algebraic formula to describe this correlation. The formula can be applied to optimize the selection of components in Principal Component Analysis and Factor Analysis."
}