{
    "title": "AdaptiX -- A Transitional XR Framework for Development and Evaluation of Shared Control Applications in Assistive Robotics. (arXiv:2310.15887v1 [cs.HC])",
    "abstract": "With the ongoing efforts to empower people with mobility impairments and the increase in technological acceptance by the general public, assistive technologies, such as collaborative robotic arms, are gaining popularity. Yet, their widespread success is limited by usability issues, specifically the disparity between user input and software control along the autonomy continuum. To address this, shared control concepts provide opportunities to combine the targeted increase of user autonomy with a certain level of computer assistance. This paper presents the free and open-source AdaptiX XR framework for developing and evaluating shared control applications in a high-resolution simulation environment. The initial framework consists of a simulated robotic arm with an example scenario in Virtual Reality (VR), multiple standard control interfaces, and a specialized recording/replay system. AdaptiX can easily be extended for specific research needs, allowing Human-Robot Interaction (HRI) resea",
    "link": "http://arxiv.org/abs/2310.15887",
    "context": "Title: AdaptiX -- A Transitional XR Framework for Development and Evaluation of Shared Control Applications in Assistive Robotics. (arXiv:2310.15887v1 [cs.HC])\nAbstract: With the ongoing efforts to empower people with mobility impairments and the increase in technological acceptance by the general public, assistive technologies, such as collaborative robotic arms, are gaining popularity. Yet, their widespread success is limited by usability issues, specifically the disparity between user input and software control along the autonomy continuum. To address this, shared control concepts provide opportunities to combine the targeted increase of user autonomy with a certain level of computer assistance. This paper presents the free and open-source AdaptiX XR framework for developing and evaluating shared control applications in a high-resolution simulation environment. The initial framework consists of a simulated robotic arm with an example scenario in Virtual Reality (VR), multiple standard control interfaces, and a specialized recording/replay system. AdaptiX can easily be extended for specific research needs, allowing Human-Robot Interaction (HRI) resea",
    "path": "papers/23/10/2310.15887.json",
    "total_tokens": 894,
    "translated_title": "AdaptiX - 一个用于助动力机器人中开发和评估共同控制应用的过渡性XR框架",
    "translated_abstract": "随着人们授权行动受限和技术接受度的提高，如合作机器臂等助动技术正在变得流行。然而，它们的普及成功受到可用性问题的限制，尤其是用户输入与软件控制在自主性连续性方面的差异。为了解决这个问题，共同控制概念提供了将有针对性地增加用户自主性与一定程度的计算机辅助相结合的机会。本文介绍了一个名为AdaptiX的免费开源XR框架，用于在高分辨率仿真环境中开发和评估共同控制应用。初始框架包括一个虚拟现实（VR）中的示例情景下的模拟机器臂、多种标准控制接口和一个专门的记录/回放系统。AdaptiX可以轻松扩展以满足特定的研究需求，允许进行人机交互（HRI）研究。",
    "tldr": "AdaptiX是一个过渡性的XR框架，用于开发和评估助动力机器人中的共同控制应用。它提供了一个高分辨率仿真环境，并结合了用户自主性和计算机辅助。",
    "en_tdlr": "AdaptiX is a transitional XR framework for developing and evaluating shared control applications in assistive robotics. It provides a high-resolution simulation environment and combines user autonomy with computer assistance."
}