{
    "title": "The Optimal use of Segmentation for Sampling Calorimeters. (arXiv:2310.04442v1 [physics.ins-det])",
    "abstract": "One of the key design choices of any sampling calorimeter is how fine to make the longitudinal and transverse segmentation. To inform this choice, we study the impact of calorimeter segmentation on energy reconstruction. To ensure that the trends are due entirely to hardware and not to a sub-optimal use of segmentation, we deploy deep neural networks to perform the reconstruction. These networks make use of all available information by representing the calorimeter as a point cloud. To demonstrate our approach, we simulate a detector similar to the forward calorimeter system intended for use in the ePIC detector, which will operate at the upcoming Electron Ion Collider. We find that for the energy estimation of isolated charged pion showers, relatively fine longitudinal segmentation is key to achieving an energy resolution that is better than 10% across the full phase space. These results provide a valuable benchmark for ongoing EIC detector optimizations and may also inform future stud",
    "link": "http://arxiv.org/abs/2310.04442",
    "context": "Title: The Optimal use of Segmentation for Sampling Calorimeters. (arXiv:2310.04442v1 [physics.ins-det])\nAbstract: One of the key design choices of any sampling calorimeter is how fine to make the longitudinal and transverse segmentation. To inform this choice, we study the impact of calorimeter segmentation on energy reconstruction. To ensure that the trends are due entirely to hardware and not to a sub-optimal use of segmentation, we deploy deep neural networks to perform the reconstruction. These networks make use of all available information by representing the calorimeter as a point cloud. To demonstrate our approach, we simulate a detector similar to the forward calorimeter system intended for use in the ePIC detector, which will operate at the upcoming Electron Ion Collider. We find that for the energy estimation of isolated charged pion showers, relatively fine longitudinal segmentation is key to achieving an energy resolution that is better than 10% across the full phase space. These results provide a valuable benchmark for ongoing EIC detector optimizations and may also inform future stud",
    "path": "papers/23/10/2310.04442.json",
    "total_tokens": 884,
    "translated_title": "分割性能用于采样量能器的最佳应用",
    "translated_abstract": "任何采样量能器的关键设计选择之一是纵向和横向分割的密度。为了确定这个选择，我们研究了量能器分割对能量重建的影响。为了确保趋势完全由硬件决定，而不是由于分割的次优应用，我们使用深度神经网络进行重建。这些网络将量能器表示为一个点云，并利用所有可用的信息。为了证明我们的方法，我们模拟了一个类似于前向量能器系统的探测器，该系统旨在用于即将到来的电子离子对撞机上的ePIC探测器。我们发现，对于孤立带电π介子簇的能量估计，相对细致的纵向分割对于在整个相空间内实现能量分辨率优于10%至关重要。这些结果为正在进行的EIC探测器优化提供了一个有价值的基准，并且还可能为未来的研究提供参考。",
    "tldr": "研究了量能器分割对能量重建的影响，利用深度神经网络进行重建，并发现相对细致的纵向分割对于能量估计至关重要，提供了EIC探测器优化的基准。",
    "en_tdlr": "The impact of calorimeter segmentation on energy reconstruction is studied, using deep neural networks for reconstruction. It is found that relatively fine longitudinal segmentation is crucial for accurate energy estimation, providing a benchmark for EIC detector optimization."
}