{
    "title": "Home Electricity Data Generator (HEDGE): An open-access tool for the generation of electric vehicle, residential demand, and PV generation profiles. (arXiv:2310.01661v1 [eess.SY])",
    "abstract": "In this paper, we present the Home Electricity Data Generator (HEDGE), an open-access tool for the random generation of realistic residential energy data. HEDGE generates realistic daily profiles of residential PV generation, household electric loads, and electric vehicle consumption and at-home availability, based on real-life UK datasets. The lack of usable data is a major hurdle for research on residential distributed energy resources characterisation and coordination, especially when using data-driven methods such as machine learning-based forecasting and reinforcement learning-based control. A key issue is that while large data banks are available, they are not in a usable format, and numerous subsequent days of data for a given single home are unavailable. We fill these gaps with the open-access HEDGE tool which generates data sequences of energy data for several days in a way that is consistent for single homes, both in terms of profile magnitude and behavioural clusters. From r",
    "link": "http://arxiv.org/abs/2310.01661",
    "context": "Title: Home Electricity Data Generator (HEDGE): An open-access tool for the generation of electric vehicle, residential demand, and PV generation profiles. (arXiv:2310.01661v1 [eess.SY])\nAbstract: In this paper, we present the Home Electricity Data Generator (HEDGE), an open-access tool for the random generation of realistic residential energy data. HEDGE generates realistic daily profiles of residential PV generation, household electric loads, and electric vehicle consumption and at-home availability, based on real-life UK datasets. The lack of usable data is a major hurdle for research on residential distributed energy resources characterisation and coordination, especially when using data-driven methods such as machine learning-based forecasting and reinforcement learning-based control. A key issue is that while large data banks are available, they are not in a usable format, and numerous subsequent days of data for a given single home are unavailable. We fill these gaps with the open-access HEDGE tool which generates data sequences of energy data for several days in a way that is consistent for single homes, both in terms of profile magnitude and behavioural clusters. From r",
    "path": "papers/23/10/2310.01661.json",
    "total_tokens": 960,
    "translated_title": "家庭电力数据生成器 (HEDGE): 一款用于生成电动车、住宅用电需求和光伏发电曲线的开放接入工具",
    "translated_abstract": "本文介绍了家庭电力数据生成器(HEDGE)，一款用于随机生成真实住宅能源数据的开放接入工具。HEDGE基于英国实际数据生成了真实的住宅光伏发电曲线、家庭电力负荷以及电动车消耗和在家可用性的每日曲线。缺乏可用数据是研究住宅分布式能源资源特征和协调的主要障碍，特别是在使用数据驱动方法如基于机器学习的预测和基于强化学习的控制时。一个关键问题是虽然大量数据可用，但格式不可用，并且同一住宅的连续几天数据也不可用。我们通过开放接入的HEDGE工具来填补这些空白，该工具生成了一致于单个住宅的能源数据序列，包括曲线幅度和行为聚类。",
    "tldr": "本文介绍了家庭电力数据生成器(HEDGE)，它是一款用于生成真实住宅能源数据的开放接入工具。通过使用真实的英国数据，HEDGE能够生成每日的光伏发电曲线、家庭电力负荷以及电动车消耗和在家可用性等曲线。这一工具填补了当前研究中缺乏可用数据的问题。",
    "en_tdlr": "This paper presents HEDGE, an open-access tool for generating realistic residential energy data. HEDGE generates daily profiles of PV generation, household electric loads, and electric vehicle consumption and availability based on real-life UK datasets. It addresses the lack of usable data in research on residential distributed energy resources."
}