{
    "title": "Stabilizing reinforcement learning control: A modular framework for optimizing over all stable behavior",
    "abstract": "arXiv:2310.14098v2 Announce Type: replace-cross  Abstract: We propose a framework for the design of feedback controllers that combines the optimization-driven and model-free advantages of deep reinforcement learning with the stability guarantees provided by using the Youla-Kucera parameterization to define the search domain. Recent advances in behavioral systems allow us to construct a data-driven internal model; this enables an alternative realization of the Youla-Kucera parameterization based entirely on input-output exploration data. Perhaps of independent interest, we formulate and analyze the stability of such data-driven models in the presence of noise. The Youla-Kucera approach requires a stable \"parameter\" for controller design. For the training of reinforcement learning agents, the set of all stable linear operators is given explicitly through a matrix factorization approach. Moreover, a nonlinear extension is given using a neural network to express a parameterized set of stab",
    "link": "https://arxiv.org/abs/2310.14098",
    "context": "Title: Stabilizing reinforcement learning control: A modular framework for optimizing over all stable behavior\nAbstract: arXiv:2310.14098v2 Announce Type: replace-cross  Abstract: We propose a framework for the design of feedback controllers that combines the optimization-driven and model-free advantages of deep reinforcement learning with the stability guarantees provided by using the Youla-Kucera parameterization to define the search domain. Recent advances in behavioral systems allow us to construct a data-driven internal model; this enables an alternative realization of the Youla-Kucera parameterization based entirely on input-output exploration data. Perhaps of independent interest, we formulate and analyze the stability of such data-driven models in the presence of noise. The Youla-Kucera approach requires a stable \"parameter\" for controller design. For the training of reinforcement learning agents, the set of all stable linear operators is given explicitly through a matrix factorization approach. Moreover, a nonlinear extension is given using a neural network to express a parameterized set of stab",
    "path": "papers/23/10/2310.14098.json",
    "total_tokens": 864,
    "translated_title": "稳定强化学习控制：用于优化所有稳定行为的模块化框架",
    "translated_abstract": "我们提出了一个用于设计反馈控制器的框架，结合了深度强化学习的优化驱动和无模型的优势，以及使用Youla-Kucera参数化提供的稳定性保证来定义搜索域。最近在行为系统方面的进展使我们能够构建一个数据驱动的内部模型；这使得在完全基于输入-输出探索数据的基础上构建Youla-Kucera参数化的替代性实现成为可能。或许更值得关注的是，我们在存在噪声的情况下制定和分析了这类数据驱动模型的稳定性。Youla-Kucera方法对于控制器设计需要一个稳定的“参数”。为了训练强化学习代理，所有稳定线性运算符的集合通过矩阵因子化方法被明确给出。此外，我们还通过神经网络进行了非线性扩展，以表达参数化的一组稳定运算符。",
    "tldr": "提出了一个框架，结合了深度强化学习的优化驱动和无模型的优势，以及使用Youla-Kucera参数化提供的稳定性保证，为设计反馈控制器提供了一种优化过程。"
}