{
    "title": "Bayesian imaging inverse problem with SA-Roundtrip prior via HMC-pCN sampler. (arXiv:2310.17817v1 [stat.ML])",
    "abstract": "Bayesian inference with deep generative prior has received considerable interest for solving imaging inverse problems in many scientific and engineering fields. The selection of the prior distribution is learned from, and therefore an important representation learning of, available prior measurements. The SA-Roundtrip, a novel deep generative prior, is introduced to enable controlled sampling generation and identify the data's intrinsic dimension. This prior incorporates a self-attention structure within a bidirectional generative adversarial network. Subsequently, Bayesian inference is applied to the posterior distribution in the low-dimensional latent space using the Hamiltonian Monte Carlo with preconditioned Crank-Nicolson (HMC-pCN) algorithm, which is proven to be ergodic under specific conditions. Experiments conducted on computed tomography (CT) reconstruction with the MNIST and TomoPhantom datasets reveal that the proposed method outperforms state-of-the-art comparisons, consis",
    "link": "http://arxiv.org/abs/2310.17817",
    "context": "Title: Bayesian imaging inverse problem with SA-Roundtrip prior via HMC-pCN sampler. (arXiv:2310.17817v1 [stat.ML])\nAbstract: Bayesian inference with deep generative prior has received considerable interest for solving imaging inverse problems in many scientific and engineering fields. The selection of the prior distribution is learned from, and therefore an important representation learning of, available prior measurements. The SA-Roundtrip, a novel deep generative prior, is introduced to enable controlled sampling generation and identify the data's intrinsic dimension. This prior incorporates a self-attention structure within a bidirectional generative adversarial network. Subsequently, Bayesian inference is applied to the posterior distribution in the low-dimensional latent space using the Hamiltonian Monte Carlo with preconditioned Crank-Nicolson (HMC-pCN) algorithm, which is proven to be ergodic under specific conditions. Experiments conducted on computed tomography (CT) reconstruction with the MNIST and TomoPhantom datasets reveal that the proposed method outperforms state-of-the-art comparisons, consis",
    "path": "papers/23/10/2310.17817.json",
    "total_tokens": 910,
    "translated_title": "Bayesian成像逆问题中的SA-Roundtrip先验及HMC-pCN采样器",
    "translated_abstract": "贝叶斯推断与深度生成先验在许多科学和工程领域的成像逆问题求解中受到了广泛关注。先验分布的选择是从可用先验测量中学习的，因此是关于可用先验测量的重要表示学习。引入了一种新颖的深度生成先验SA-Roundtrip，以实现可控的采样生成，并识别出数据的内在维度。该先验在双向生成对抗网络中嵌入了自注意力结构。随后，将贝叶斯推断应用于低维潜在空间中的后验分布，使用具有预条件Crank-Nicolson算法的Hamiltonian Monte Carlo (HMC-pCN)。该算法在特定条件下被证明具有遍历性。对MNIST和TomoPhantom数据集进行的计算机断层扫描重建实验表明，该方法优于最先进的对比算法。",
    "tldr": "本文提出了一种新型的深度生成先验，SA-Roundtrip，可以进行可控的采样生成，并识别数据的内在维度。基于该先验，结合Hamiltonian Monte Carlo算法，解决了贝叶斯成像逆问题，在计算机断层扫描重建任务上超过了最先进的对比算法。",
    "en_tdlr": "This paper introduces a novel deep generative prior, SA-Roundtrip, which enables controlled sampling generation and identifies the intrinsic dimension of the data. Based on this prior, combined with the Hamiltonian Monte Carlo algorithm, it solves the Bayesian imaging inverse problem, outperforming state-of-the-art comparisons in computed tomography reconstruction tasks."
}