{
    "title": "Model-based Clustering of Individuals' Ecological Momentary Assessment Time-series Data for Improving Forecasting Performance. (arXiv:2310.07491v1 [cs.LG])",
    "abstract": "Through Ecological Momentary Assessment (EMA) studies, a number of time-series data is collected across multiple individuals, continuously monitoring various items of emotional behavior. Such complex data is commonly analyzed in an individual level, using personalized models. However, it is believed that additional information of similar individuals is likely to enhance these models leading to better individuals' description. Thus, clustering is investigated with an aim to group together the most similar individuals, and subsequently use this information in group-based models in order to improve individuals' predictive performance. More specifically, two model-based clustering approaches are examined, where the first is using model-extracted parameters of personalized models, whereas the second is optimized on the model-based forecasting performance. Both methods are then analyzed using intrinsic clustering evaluation measures (e.g. Silhouette coefficients) as well as the performance o",
    "link": "http://arxiv.org/abs/2310.07491",
    "context": "Title: Model-based Clustering of Individuals' Ecological Momentary Assessment Time-series Data for Improving Forecasting Performance. (arXiv:2310.07491v1 [cs.LG])\nAbstract: Through Ecological Momentary Assessment (EMA) studies, a number of time-series data is collected across multiple individuals, continuously monitoring various items of emotional behavior. Such complex data is commonly analyzed in an individual level, using personalized models. However, it is believed that additional information of similar individuals is likely to enhance these models leading to better individuals' description. Thus, clustering is investigated with an aim to group together the most similar individuals, and subsequently use this information in group-based models in order to improve individuals' predictive performance. More specifically, two model-based clustering approaches are examined, where the first is using model-extracted parameters of personalized models, whereas the second is optimized on the model-based forecasting performance. Both methods are then analyzed using intrinsic clustering evaluation measures (e.g. Silhouette coefficients) as well as the performance o",
    "path": "papers/23/10/2310.07491.json",
    "total_tokens": 857,
    "translated_title": "基于模型的个体生态瞬时评估时间序列数据聚类以提高预测性能",
    "translated_abstract": "通过生态瞬时评估（EMA）研究，收集了跨多个个体的时间序列数据，不断监测情绪行为的各个方面。这种复杂的数据通常在个体层面上进行分析，使用个性化模型。然而，人们认为通过聚类将类似个体的附加信息整合起来，可能会增强这些模型，从而改善个体的描述。因此，本研究通过将最相似的个体分组，并进一步将这些信息用于基于群体的模型中，以提高个体的预测性能。具体而言，本文研究了两种基于模型的聚类方法，第一种方法使用个性化模型的模型提取参数，而第二种方法则通过模型的预测性能进行优化。然后，使用内在聚类评估指标（例如轮廓系数）以及性能测量方法对这两种方法进行了分析。",
    "tldr": "本文通过模型聚类分析个体生态瞬时评估数据，以提高预测性能。作者比较了两种基于模型的聚类方法，并使用内在聚类评估与性能测量方法进行了分析。"
}