{
    "title": "Dolfin: Diffusion Layout Transformers without Autoencoder. (arXiv:2310.16305v1 [cs.CV])",
    "abstract": "In this paper, we introduce a novel generative model, Diffusion Layout Transformers without Autoencoder (Dolfin), which significantly improves the modeling capability with reduced complexity compared to existing methods. Dolfin employs a Transformer-based diffusion process to model layout generation. In addition to an efficient bi-directional (non-causal joint) sequence representation, we further propose an autoregressive diffusion model (Dolfin-AR) that is especially adept at capturing rich semantic correlations for the neighboring objects, such as alignment, size, and overlap. When evaluated against standard generative layout benchmarks, Dolfin notably improves performance across various metrics (fid, alignment, overlap, MaxIoU and DocSim scores), enhancing transparency and interoperability in the process. Moreover, Dolfin's applications extend beyond layout generation, making it suitable for modeling geometric structures, such as line segments. Our experiments present both qualitati",
    "link": "http://arxiv.org/abs/2310.16305",
    "context": "Title: Dolfin: Diffusion Layout Transformers without Autoencoder. (arXiv:2310.16305v1 [cs.CV])\nAbstract: In this paper, we introduce a novel generative model, Diffusion Layout Transformers without Autoencoder (Dolfin), which significantly improves the modeling capability with reduced complexity compared to existing methods. Dolfin employs a Transformer-based diffusion process to model layout generation. In addition to an efficient bi-directional (non-causal joint) sequence representation, we further propose an autoregressive diffusion model (Dolfin-AR) that is especially adept at capturing rich semantic correlations for the neighboring objects, such as alignment, size, and overlap. When evaluated against standard generative layout benchmarks, Dolfin notably improves performance across various metrics (fid, alignment, overlap, MaxIoU and DocSim scores), enhancing transparency and interoperability in the process. Moreover, Dolfin's applications extend beyond layout generation, making it suitable for modeling geometric structures, such as line segments. Our experiments present both qualitati",
    "path": "papers/23/10/2310.16305.json",
    "total_tokens": 839,
    "translated_title": "Dolfin: 无自编码器的扩散布局变换器",
    "translated_abstract": "本文介绍了一种新的生成模型，称为无自编码器的扩散布局变换器（Dolfin），相比现有方法，它在减小复杂性的同时显著提高了建模能力。 Dolfin采用基于Transformer的扩散过程来进行布局生成。除了高效的双向（非因果连接）序列表示外，我们还提出了一种自回归扩散模型（Dolfin-AR），特别擅长捕捉邻近对象的丰富语义相关性，如对齐、大小和重叠。在标准生成布局基准测试中，Dolfin在各种指标（fid、对齐、重叠、MaxIoU和DocSim分数）上显著提高性能，增强了透明度和互操作性。此外，Dolfin的应用不仅局限于布局生成，还适用于建模几何结构，如线段。",
    "tldr": "Dolfin是一种改进的布局生成模型，通过Transformer-based扩散过程和自回归扩散模型(Dolfin-AR)实现，相比现有方法具有更高的建模能力和较低的复杂性。",
    "en_tdlr": "Dolfin is an improved layout generation model that utilizes a Transformer-based diffusion process and a self-regressive diffusion model (Dolfin-AR) to achieve higher modeling capability with reduced complexity compared to existing methods."
}