{
    "title": "Graph Agent: Explicit Reasoning Agent for Graphs. (arXiv:2310.16421v1 [cs.AI])",
    "abstract": "Graph embedding methods such as Graph Neural Networks (GNNs) and Graph Transformers have contributed to the development of graph reasoning algorithms for various tasks on knowledge graphs. However, the lack of interpretability and explainability of graph embedding methods has limited their applicability in scenarios requiring explicit reasoning. In this paper, we introduce the Graph Agent (GA), an intelligent agent methodology of leveraging large language models (LLMs), inductive-deductive reasoning modules, and long-term memory for knowledge graph reasoning tasks. GA integrates aspects of symbolic reasoning and existing graph embedding methods to provide an innovative approach for complex graph reasoning tasks. By converting graph structures into textual data, GA enables LLMs to process, reason, and provide predictions alongside human-interpretable explanations. The effectiveness of the GA was evaluated on node classification and link prediction tasks. Results showed that GA reached s",
    "link": "http://arxiv.org/abs/2310.16421",
    "context": "Title: Graph Agent: Explicit Reasoning Agent for Graphs. (arXiv:2310.16421v1 [cs.AI])\nAbstract: Graph embedding methods such as Graph Neural Networks (GNNs) and Graph Transformers have contributed to the development of graph reasoning algorithms for various tasks on knowledge graphs. However, the lack of interpretability and explainability of graph embedding methods has limited their applicability in scenarios requiring explicit reasoning. In this paper, we introduce the Graph Agent (GA), an intelligent agent methodology of leveraging large language models (LLMs), inductive-deductive reasoning modules, and long-term memory for knowledge graph reasoning tasks. GA integrates aspects of symbolic reasoning and existing graph embedding methods to provide an innovative approach for complex graph reasoning tasks. By converting graph structures into textual data, GA enables LLMs to process, reason, and provide predictions alongside human-interpretable explanations. The effectiveness of the GA was evaluated on node classification and link prediction tasks. Results showed that GA reached s",
    "path": "papers/23/10/2310.16421.json",
    "total_tokens": 870,
    "translated_title": "图像感知智能体: 针对图像的显性推理智能体",
    "translated_abstract": "图形嵌入方法，如图形神经网络（GNNs）和图形变换器（Graph Transformers），对于知识图谱上的各种任务的图形推理算法的发展做出了贡献。然而，图形嵌入方法的可解释性和可解释性不足，限制了它们在需要显性推理的场景中的适用性。在本文中，我们引入了图像智能体（GA），这是一种利用大型语言模型（LLMs）、归纳-演绎推理模块和长期记忆进行知识图推理任务的智能体方法。GA整合了符号推理和现有的图形嵌入方法，为复杂的图形推理任务提供了创新的方法。通过将图形结构转化为文本数据，GA使LLMs能够处理、推理并提供人类可解释的解释。通过节点分类和链接预测任务评估了GA的效果。结果表明，GA达到了",
    "tldr": "图像智能体（GA）是一种创新方法，通过整合图形嵌入方法和符号推理，利用大型语言模型（LLMs）实现了对复杂图形推理任务的解释性推理，并在节点分类和链接预测任务中取得了有效的结果。"
}