{
    "title": "Stochastic force inference via density estimation. (arXiv:2310.02366v1 [cs.LG])",
    "abstract": "Inferring dynamical models from low-resolution temporal data continues to be a significant challenge in biophysics, especially within transcriptomics, where separating molecular programs from noise remains an important open problem. We explore a common scenario in which we have access to an adequate amount of cross-sectional samples at a few time-points, and assume that our samples are generated from a latent diffusion process. We propose an approach that relies on the probability flow associated with an underlying diffusion process to infer an autonomous, nonlinear force field interpolating between the distributions. Given a prior on the noise model, we employ score-matching to differentiate the force field from the intrinsic noise. Using relevant biophysical examples, we demonstrate that our approach can extract non-conservative forces from non-stationary data, that it learns equilibrium dynamics when applied to steady-state data, and that it can do so with both additive and multipli",
    "link": "http://arxiv.org/abs/2310.02366",
    "context": "Title: Stochastic force inference via density estimation. (arXiv:2310.02366v1 [cs.LG])\nAbstract: Inferring dynamical models from low-resolution temporal data continues to be a significant challenge in biophysics, especially within transcriptomics, where separating molecular programs from noise remains an important open problem. We explore a common scenario in which we have access to an adequate amount of cross-sectional samples at a few time-points, and assume that our samples are generated from a latent diffusion process. We propose an approach that relies on the probability flow associated with an underlying diffusion process to infer an autonomous, nonlinear force field interpolating between the distributions. Given a prior on the noise model, we employ score-matching to differentiate the force field from the intrinsic noise. Using relevant biophysical examples, we demonstrate that our approach can extract non-conservative forces from non-stationary data, that it learns equilibrium dynamics when applied to steady-state data, and that it can do so with both additive and multipli",
    "path": "papers/23/10/2310.02366.json",
    "total_tokens": 889,
    "translated_title": "基于密度估计的随机力推断",
    "translated_abstract": "在生物物理学中，从低分辨率的时间数据中推断动力学模型仍然是一个重要的挑战，特别是在转录组学中，将分子程序与噪声分离仍然是一个重要的待解决问题。我们探索了一种常见情况，即我们可以在少数时间点采样到足够数量的横截面样本，并假设我们的样本是从潜在的扩散过程中生成的。我们提出了一种方法，依赖于与潜在扩散过程相关的概率流，以推断在分布之间插值的自主非线性力场。在给定噪声模型的先验条件下，我们使用得分匹配法来区分力场与内在噪声。通过相关的生物物理实例，我们证明了我们的方法可以从非平稳数据中提取非保守力，并且当应用于稳态数据时学习平衡动力学，而且可以处理加法和乘法噪声。",
    "tldr": "该论文提出了一种基于密度估计的方法，通过概率流推断在分布之间插值的自主非线性力场，并应用于生物物理学中的转录组学，解决了从低分辨率的时间数据中推断动力学模型的挑战。",
    "en_tdlr": "This paper proposes a density estimation method that infers an autonomous nonlinear force field interpolating between distributions using probability flow, and applies it to infer dynamical models from low-resolution temporal data in the field of transcriptomics in biophysics, addressing the challenge of separating molecular programs from noise."
}