{
    "title": "Surgical Gym: A high-performance GPU-based platform for reinforcement learning with surgical robots. (arXiv:2310.04676v2 [cs.RO] UPDATED)",
    "abstract": "Recent advances in robot-assisted surgery have resulted in progressively more precise, efficient, and minimally invasive procedures, sparking a new era of robotic surgical intervention. This enables doctors, in collaborative interaction with robots, to perform traditional or minimally invasive surgeries with improved outcomes through smaller incisions. Recent efforts are working toward making robotic surgery more autonomous which has the potential to reduce variability of surgical outcomes and reduce complication rates. Deep reinforcement learning methodologies offer scalable solutions for surgical automation, but their effectiveness relies on extensive data acquisition due to the absence of prior knowledge in successfully accomplishing tasks. Due to the intensive nature of simulated data collection, previous works have focused on making existing algorithms more efficient. In this work, we focus on making the simulator more efficient, making training data much more accessible than prev",
    "link": "http://arxiv.org/abs/2310.04676",
    "context": "Title: Surgical Gym: A high-performance GPU-based platform for reinforcement learning with surgical robots. (arXiv:2310.04676v2 [cs.RO] UPDATED)\nAbstract: Recent advances in robot-assisted surgery have resulted in progressively more precise, efficient, and minimally invasive procedures, sparking a new era of robotic surgical intervention. This enables doctors, in collaborative interaction with robots, to perform traditional or minimally invasive surgeries with improved outcomes through smaller incisions. Recent efforts are working toward making robotic surgery more autonomous which has the potential to reduce variability of surgical outcomes and reduce complication rates. Deep reinforcement learning methodologies offer scalable solutions for surgical automation, but their effectiveness relies on extensive data acquisition due to the absence of prior knowledge in successfully accomplishing tasks. Due to the intensive nature of simulated data collection, previous works have focused on making existing algorithms more efficient. In this work, we focus on making the simulator more efficient, making training data much more accessible than prev",
    "path": "papers/23/10/2310.04676.json",
    "total_tokens": 879,
    "translated_title": "《外科健身房：基于高性能GPU的手术机器人增强学习平台》",
    "translated_abstract": "最近在机器人辅助手术方面取得的进展使得手术越来越精确、高效和微创，开启了机器人辅助手术干预的新时代。这使得医生在与机器人协作的情况下能够通过更小的切口进行传统或微创手术，从而改善手术结果。近期的研究致力于使机器人手术更加自主，这有潜力减少手术结果的不确定性和并发症率。深度强化学习方法为手术自动化提供了可扩展的解决方案，但其有效性取决于大量的数据获取，因为在成功完成任务方面缺乏先验知识。由于模拟数据收集的密集性质，以前的工作主要致力于使现有算法更加高效。在这项工作中，我们致力于提高模拟器的效率，使训练数据比以前更易获取。",
    "tldr": "这项工作提出了一个高性能GPU平台，用于增强学习与手术机器人的协作。通过提高模拟器效率和训练数据的易获取性，为手术自动化的深度强化学习提供了可扩展的解决方案。",
    "en_tdlr": "This work proposes a high-performance GPU platform for reinforcement learning with surgical robots. By improving the efficiency of the simulator and the accessibility of training data, it offers a scalable solution for surgical automation using deep reinforcement learning."
}