{
    "title": "DocXChain: A Powerful Open-Source Toolchain for Document Parsing and Beyond. (arXiv:2310.12430v1 [cs.CV])",
    "abstract": "In this report, we introduce DocXChain, a powerful open-source toolchain for document parsing, which is designed and developed to automatically convert the rich information embodied in unstructured documents, such as text, tables and charts, into structured representations that are readable and manipulable by machines. Specifically, basic capabilities, including text detection, text recognition, table structure recognition and layout analysis, are provided. Upon these basic capabilities, we also build a set of fully functional pipelines for document parsing, i.e., general text reading, table parsing, and document structurization, to drive various applications related to documents in real-world scenarios. Moreover, DocXChain is concise, modularized and flexible, such that it can be readily integrated with existing tools, libraries or models (such as LangChain and ChatGPT), to construct more powerful systems that can accomplish more complicated and challenging tasks. The code of DocXChai",
    "link": "http://arxiv.org/abs/2310.12430",
    "context": "Title: DocXChain: A Powerful Open-Source Toolchain for Document Parsing and Beyond. (arXiv:2310.12430v1 [cs.CV])\nAbstract: In this report, we introduce DocXChain, a powerful open-source toolchain for document parsing, which is designed and developed to automatically convert the rich information embodied in unstructured documents, such as text, tables and charts, into structured representations that are readable and manipulable by machines. Specifically, basic capabilities, including text detection, text recognition, table structure recognition and layout analysis, are provided. Upon these basic capabilities, we also build a set of fully functional pipelines for document parsing, i.e., general text reading, table parsing, and document structurization, to drive various applications related to documents in real-world scenarios. Moreover, DocXChain is concise, modularized and flexible, such that it can be readily integrated with existing tools, libraries or models (such as LangChain and ChatGPT), to construct more powerful systems that can accomplish more complicated and challenging tasks. The code of DocXChai",
    "path": "papers/23/10/2310.12430.json",
    "total_tokens": 881,
    "translated_title": "DocXChain: 一个强大的开源工具链用于文档解析及更多操作",
    "translated_abstract": "在这篇报告中，我们介绍了DocXChain，一个强大的开源工具链，用于文档解析，旨在自动将非结构化文档中包含的丰富信息（如文本，表格和图表）转换为可读取和可操作的结构化表示。具体而言，提供了基本能力，包括文本检测、文本识别、表格结构识别和布局分析。在这些基本能力的基础上，我们还构建了一组完全功能的文档解析流水线，即通用文本阅读、表格解析和文档结构化，以推动与现实场景中的文档相关的各种应用。此外，DocXChain简洁、模块化和灵活，可以轻松集成现有的工具、库或模型（如LangChain和ChatGPT），构建更强大的系统，完成更复杂和具有挑战性的任务。DocXChain的代码可以在开源平台获得。",
    "tldr": "DocXChain是一个开源工具链，通过文档解析将非结构化文档转换为可读可操作的结构化表示，并提供了基本能力和完全功能的文档解析流水线，可以与其他工具和模型集成，用于完成复杂任务。",
    "en_tdlr": "DocXChain is an open-source toolchain that converts unstructured documents into structured representations, with basic capabilities and fully functional pipelines for document parsing. It can be integrated with other tools and models to accomplish complex tasks."
}