{
    "title": "Accelerating Non-IID Federated Learning via Heterogeneity-Guided Client Sampling. (arXiv:2310.00198v1 [cs.LG])",
    "abstract": "Statistical heterogeneity of data present at client devices in a federated learning (FL) system renders the training of a global model in such systems difficult. Particularly challenging are the settings where due to resource constraints only a small fraction of clients can participate in any given round of FL. Recent approaches to training a global model in FL systems with non-IID data have focused on developing client selection methods that aim to sample clients with more informative updates of the model. However, existing client selection techniques either introduce significant computation overhead or perform well only in the scenarios where clients have data with similar heterogeneity profiles. In this paper, we propose HiCS-FL (Federated Learning via Hierarchical Clustered Sampling), a novel client selection method in which the server estimates statistical heterogeneity of a client's data using the client's update of the network's output layer and relies on this information to clu",
    "link": "http://arxiv.org/abs/2310.00198",
    "context": "Title: Accelerating Non-IID Federated Learning via Heterogeneity-Guided Client Sampling. (arXiv:2310.00198v1 [cs.LG])\nAbstract: Statistical heterogeneity of data present at client devices in a federated learning (FL) system renders the training of a global model in such systems difficult. Particularly challenging are the settings where due to resource constraints only a small fraction of clients can participate in any given round of FL. Recent approaches to training a global model in FL systems with non-IID data have focused on developing client selection methods that aim to sample clients with more informative updates of the model. However, existing client selection techniques either introduce significant computation overhead or perform well only in the scenarios where clients have data with similar heterogeneity profiles. In this paper, we propose HiCS-FL (Federated Learning via Hierarchical Clustered Sampling), a novel client selection method in which the server estimates statistical heterogeneity of a client's data using the client's update of the network's output layer and relies on this information to clu",
    "path": "papers/23/10/2310.00198.json",
    "total_tokens": 871,
    "translated_title": "利用异构引导的客户端采样加速非独立同分布联邦学习",
    "translated_abstract": "客户端设备中存在的数据的统计异质性使得在联邦学习（FL）系统中训练全局模型变得困难。尤其具有挑战性的是，在由于资源限制只有一小部分客户端能参与任何一轮FL的设置中。最近的一些方法致力于训练非独立同分布数据的FL系统中的全局模型，它们着重于开发采样更具信息更新的客户端选择方法。然而，现有的客户端选择技术要么引入了显著的计算开销，要么只在客户端具有类似异质性配置文件的情况下表现良好。本文提出了HiCS-FL（通过分层聚类采样进行联邦学习），一种新的客户端选择方法，其中服务器使用客户端网络输出层的更新来估计客户端数据的统计异质性，并依赖此信息来进行聚类。",
    "tldr": "本文提出了一种名为HiCS-FL的方法，通过利用客户端的网络输出层更新来估计数据的统计异质性，并利用此信息进行客户端的聚类选择，以加速非独立同分布联邦学习。",
    "en_tdlr": "This paper proposes a method called HiCS-FL, which estimates the statistical heterogeneity of data by using the client's network output layer updates and utilizes this information for client clustering selection to accelerate non-IID federated learning."
}