{
    "title": "Waymax: An Accelerated, Data-Driven Simulator for Large-Scale Autonomous Driving Research. (arXiv:2310.08710v1 [cs.RO])",
    "abstract": "Simulation is an essential tool to develop and benchmark autonomous vehicle planning software in a safe and cost-effective manner. However, realistic simulation requires accurate modeling of nuanced and complex multi-agent interactive behaviors. To address these challenges, we introduce Waymax, a new data-driven simulator for autonomous driving in multi-agent scenes, designed for large-scale simulation and testing. Waymax uses publicly-released, real-world driving data (e.g., the Waymo Open Motion Dataset) to initialize or play back a diverse set of multi-agent simulated scenarios. It runs entirely on hardware accelerators such as TPUs/GPUs and supports in-graph simulation for training, making it suitable for modern large-scale, distributed machine learning workflows. To support online training and evaluation, Waymax includes several learned and hard-coded behavior models that allow for realistic interaction within simulation. To supplement Waymax, we benchmark a suite of popular imita",
    "link": "http://arxiv.org/abs/2310.08710",
    "context": "Title: Waymax: An Accelerated, Data-Driven Simulator for Large-Scale Autonomous Driving Research. (arXiv:2310.08710v1 [cs.RO])\nAbstract: Simulation is an essential tool to develop and benchmark autonomous vehicle planning software in a safe and cost-effective manner. However, realistic simulation requires accurate modeling of nuanced and complex multi-agent interactive behaviors. To address these challenges, we introduce Waymax, a new data-driven simulator for autonomous driving in multi-agent scenes, designed for large-scale simulation and testing. Waymax uses publicly-released, real-world driving data (e.g., the Waymo Open Motion Dataset) to initialize or play back a diverse set of multi-agent simulated scenarios. It runs entirely on hardware accelerators such as TPUs/GPUs and supports in-graph simulation for training, making it suitable for modern large-scale, distributed machine learning workflows. To support online training and evaluation, Waymax includes several learned and hard-coded behavior models that allow for realistic interaction within simulation. To supplement Waymax, we benchmark a suite of popular imita",
    "path": "papers/23/10/2310.08710.json",
    "total_tokens": 961,
    "translated_title": "Waymax: 一种用于大规模自主驾驶研究的加速、数据驱动模拟器",
    "translated_abstract": "模拟是以安全和成本效益的方式开发和评估自主车规划软件的重要工具。然而，真实的模拟需要精确建模复杂的多智能体交互行为。为了应对这些挑战，我们介绍了Waymax，一种新的多智能体场景下用于自主驾驶的数据驱动模拟器，专为大规模模拟和测试设计。Waymax使用公开发布的真实世界驾驶数据（例如Waymo开放运动数据集）来初始化或回放多样化的多智能体模拟场景。它完全运行在硬件加速器（如TPUs/GPUs）上，并支持图内模拟以进行训练，适用于现代大规模、分布式机器学习工作流程。为了支持在线训练和评估，Waymax包含了几个学习的和硬编码的行为模型，可以在模拟中进行真实的交互。为了补充Waymax，我们还对一套流行的仿真算法进行了基准测试。",
    "tldr": "Waymax是一种加速、数据驱动的模拟器，用于大规模自主驾驶研究。它使用真实世界驾驶数据来创建真实的多智能体交互场景，并支持大规模、分布式机器学习工作流程。通过学习和硬编码的行为模型，Waymax可以提供逼真的交互体验。"
}