{
    "title": "Rare Event Probability Learning by Normalizing Flows. (arXiv:2310.19167v1 [cs.LG])",
    "abstract": "A rare event is defined by a low probability of occurrence. Accurate estimation of such small probabilities is of utmost importance across diverse domains. Conventional Monte Carlo methods are inefficient, demanding an exorbitant number of samples to achieve reliable estimates. Inspired by the exact sampling capabilities of normalizing flows, we revisit this challenge and propose normalizing flow assisted importance sampling, termed NOFIS. NOFIS first learns a sequence of proposal distributions associated with predefined nested subset events by minimizing KL divergence losses. Next, it estimates the rare event probability by utilizing importance sampling in conjunction with the last proposal. The efficacy of our NOFIS method is substantiated through comprehensive qualitative visualizations, affirming the optimality of the learned proposal distribution, as well as a series of quantitative experiments encompassing $10$ distinct test cases, which highlight NOFIS's superiority over baselin",
    "link": "http://arxiv.org/abs/2310.19167",
    "context": "Title: Rare Event Probability Learning by Normalizing Flows. (arXiv:2310.19167v1 [cs.LG])\nAbstract: A rare event is defined by a low probability of occurrence. Accurate estimation of such small probabilities is of utmost importance across diverse domains. Conventional Monte Carlo methods are inefficient, demanding an exorbitant number of samples to achieve reliable estimates. Inspired by the exact sampling capabilities of normalizing flows, we revisit this challenge and propose normalizing flow assisted importance sampling, termed NOFIS. NOFIS first learns a sequence of proposal distributions associated with predefined nested subset events by minimizing KL divergence losses. Next, it estimates the rare event probability by utilizing importance sampling in conjunction with the last proposal. The efficacy of our NOFIS method is substantiated through comprehensive qualitative visualizations, affirming the optimality of the learned proposal distribution, as well as a series of quantitative experiments encompassing $10$ distinct test cases, which highlight NOFIS's superiority over baselin",
    "path": "papers/23/10/2310.19167.json",
    "total_tokens": 861,
    "translated_title": "通过标准化流进行罕见事件概率学习",
    "translated_abstract": "罕见事件被定义为发生概率较低。准确估计这种小概率在各个领域中至关重要。传统的蒙特卡洛方法效率低下，需要大量样本才能得到可靠的估计。受标准化流的精确采样能力的启发，我们重新思考了这个挑战，并提出了标准化流辅助重要抽样（NOFIS）方法。NOFIS首先通过最小化KL散度损失来学习与预定义的嵌套子集事件相关的一系列提议分布。然后，它利用重要抽样和最后一个提议分布来估计罕见事件的概率。通过全面的定性可视化验证了我们NOFIS方法的有效性，证实了学习提议分布的最优性，以及一系列包括10个不同测试案例的定量实验证明了NOFIS在基准方法上的优越性。",
    "tldr": "通过标准化流辅助重要抽样（NOFIS）的方法，准确估计罕见事件的概率，通过学习一系列提议分布和重要抽样来实现，在多个定性和定量实验中得到了验证。"
}