{
    "title": "Genetic prediction of quantitative traits: a machine learner's guide focused on height. (arXiv:2310.04028v1 [cs.LG])",
    "abstract": "Machine learning and deep learning have been celebrating many successes in the application to biological problems, especially in the domain of protein folding. Another equally complex and important question has received relatively little attention by the machine learning community, namely the one of prediction of complex traits from genetics. Tackling this problem requires in-depth knowledge of the related genetics literature and awareness of various subtleties associated with genetic data. In this guide, we provide an overview for the machine learning community on current state of the art models and associated subtleties which need to be taken into consideration when developing new models for phenotype prediction. We use height as an example of a continuous-valued phenotype and provide an introduction to benchmark datasets, confounders, feature selection, and common metrics.",
    "link": "http://arxiv.org/abs/2310.04028",
    "context": "Title: Genetic prediction of quantitative traits: a machine learner's guide focused on height. (arXiv:2310.04028v1 [cs.LG])\nAbstract: Machine learning and deep learning have been celebrating many successes in the application to biological problems, especially in the domain of protein folding. Another equally complex and important question has received relatively little attention by the machine learning community, namely the one of prediction of complex traits from genetics. Tackling this problem requires in-depth knowledge of the related genetics literature and awareness of various subtleties associated with genetic data. In this guide, we provide an overview for the machine learning community on current state of the art models and associated subtleties which need to be taken into consideration when developing new models for phenotype prediction. We use height as an example of a continuous-valued phenotype and provide an introduction to benchmark datasets, confounders, feature selection, and common metrics.",
    "path": "papers/23/10/2310.04028.json",
    "total_tokens": 804,
    "translated_title": "遗传预测定量性状：着眼于身高的机器学习指南",
    "translated_abstract": "机器学习和深度学习在生物问题上取得了许多成功，尤其是在蛋白质折叠领域。然而，机器学习领域对于从遗传学预测复杂性状的问题关注相对较少。解决这个问题需要深入了解相关的遗传学文献，并注意与遗传数据相关的各种微妙之处。在这个指南中，我们向机器学习社区提供了关于当前最先进模型以及开发新的表型预测模型时需要考虑的相关微妙之处的概述。我们以身高作为连续性状的示例，并提供了基准数据集、混淆因素、特征选择和常见评价指标的介绍。",
    "tldr": "这篇论文提供了一个机器学习社区关于遗传预测复杂性状的指南，着重介绍了身高作为连续性状的案例，涵盖了当前最先进模型、相关微妙之处以及开发新模型时需要考虑的内容。",
    "en_tdlr": "This paper presents a machine learning guide for predicting complex traits from genetics, using height as an example. It covers state-of-the-art models, associated subtleties, and considerations for developing new models."
}