{
    "title": "Operator-free Equilibrium on the Sphere. (arXiv:2310.00012v1 [math.NA])",
    "abstract": "We propose a generalized minimum discrepancy, which derives from Legendre's ODE and spherical harmonic theoretics to provide a new criterion of equidistributed pointsets on the sphere. A continuous and derivative kernel in terms of elementary functions is established to simplify the computation of the generalized minimum discrepancy. We consider the deterministic point generated from Pycke's statistics to integrate a Franke function for the sphere and investigate the discrepancies of points systems embedding with different kernels. Quantitive experiments are conducted and the results are analyzed. Our deduced model can explore latent point systems, that have the minimum discrepancy without the involvement of pseudodifferential operators and Beltrami operators, by the use of derivatives. Compared to the random point generated from the Monte Carlo method, only a few points generated by our method are required to approximate the target in arbitrary dimensions.",
    "link": "http://arxiv.org/abs/2310.00012",
    "context": "Title: Operator-free Equilibrium on the Sphere. (arXiv:2310.00012v1 [math.NA])\nAbstract: We propose a generalized minimum discrepancy, which derives from Legendre's ODE and spherical harmonic theoretics to provide a new criterion of equidistributed pointsets on the sphere. A continuous and derivative kernel in terms of elementary functions is established to simplify the computation of the generalized minimum discrepancy. We consider the deterministic point generated from Pycke's statistics to integrate a Franke function for the sphere and investigate the discrepancies of points systems embedding with different kernels. Quantitive experiments are conducted and the results are analyzed. Our deduced model can explore latent point systems, that have the minimum discrepancy without the involvement of pseudodifferential operators and Beltrami operators, by the use of derivatives. Compared to the random point generated from the Monte Carlo method, only a few points generated by our method are required to approximate the target in arbitrary dimensions.",
    "path": "papers/23/10/2310.00012.json",
    "total_tokens": 823,
    "translated_title": "在球面上无运算符均衡",
    "translated_abstract": "我们提出了一种广义最小差异度，它源于Legendre的ODE和球谐函数理论，提供了一个新的球面上等分点集的准则。建立了一个连续的、可导的核函数，以简化广义最小差异度的计算。我们考虑了通过Pycke统计生成的确定性点来对球面上的Frank函数进行积分，并研究了不同核函数嵌入的点系统的差异。进行了定量实验并对结果进行了分析。我们推导的模型可以通过导数探索具有最小差异度的潜在点系统，而无需涉及伪微分算子和Beltrami算子。与蒙特卡洛方法生成的随机点相比，我们的方法只需要少量点即可在任意维度中近似目标。",
    "tldr": "本论文通过引入一个新的准则，建立连续的、可导的核函数，简化了在球面上等分点集的计算，实现了在无需涉及运算符的情况下对潜在点系统进行探索，并得到了与蒙特卡洛方法相比更高效的近似目标的方法。",
    "en_tdlr": "This paper introduces a new criterion for equidistributed pointsets on the sphere, establishes a continuous and derivative kernel to simplify the computation, explores latent point systems without the involvement of operators, and achieves a more efficient method for approximating the target compared to the Monte Carlo method."
}