{
    "title": "CR-COPEC: Causal Rationale of Corporate Performance Changes to Learn from Financial Reports. (arXiv:2310.16095v1 [cs.CL])",
    "abstract": "In this paper, we introduce CR-COPEC called Causal Rationale of Corporate Performance Changes from financial reports. This is a comprehensive large-scale domain-adaptation causal sentence dataset to detect financial performance changes of corporate. CR-COPEC contributes to two major achievements. First, it detects causal rationale from 10-K annual reports of the U.S. companies, which contain experts' causal analysis following accounting standards in a formal manner. This dataset can be widely used by both individual investors and analysts as material information resources for investing and decision making without tremendous effort to read through all the documents. Second, it carefully considers different characteristics which affect the financial performance of companies in twelve industries. As a result, CR-COPEC can distinguish causal sentences in various industries by taking unique narratives in each industry into consideration. We also provide an extensive analysis of how well CR-",
    "link": "http://arxiv.org/abs/2310.16095",
    "context": "Title: CR-COPEC: Causal Rationale of Corporate Performance Changes to Learn from Financial Reports. (arXiv:2310.16095v1 [cs.CL])\nAbstract: In this paper, we introduce CR-COPEC called Causal Rationale of Corporate Performance Changes from financial reports. This is a comprehensive large-scale domain-adaptation causal sentence dataset to detect financial performance changes of corporate. CR-COPEC contributes to two major achievements. First, it detects causal rationale from 10-K annual reports of the U.S. companies, which contain experts' causal analysis following accounting standards in a formal manner. This dataset can be widely used by both individual investors and analysts as material information resources for investing and decision making without tremendous effort to read through all the documents. Second, it carefully considers different characteristics which affect the financial performance of companies in twelve industries. As a result, CR-COPEC can distinguish causal sentences in various industries by taking unique narratives in each industry into consideration. We also provide an extensive analysis of how well CR-",
    "path": "papers/23/10/2310.16095.json",
    "total_tokens": 859,
    "translated_title": "CR-COPEC: 从财务报告学习企业绩效变化的因果解释",
    "translated_abstract": "本文介绍了CR-COPEC，即从财务报告中学习企业绩效变化的因果解释。这是一个综合的大规模领域自适应因果句子数据集，用于检测企业的财务绩效变化。CR-COPEC的两个主要贡献是：首先，它从美国公司的10-K年度报告中检测因果解释，这些报告按照正式的会计准则由专家进行因果分析。这个数据集可以广泛应用于个人投资者和分析师，作为投资和决策制定的重要信息资源，无需大量阅读所有文件。其次，它仔细考虑了影响十二个行业公司财务绩效的不同特征。因此，CR-COPEC可以通过考虑每个行业的独特叙述，区分各个行业中的因果句子。我们还对CR-COPEC进行了广泛的分析，以了解其性能。",
    "tldr": "CR-COPEC是一个从财务报告中学习企业绩效变化的因果解释的数据集，可以为个人投资者和分析师提供重要的信息资源，同时考虑了不同行业的特征。",
    "en_tdlr": "CR-COPEC is a dataset that learns causal explanations of corporate performance changes from financial reports, providing important information resources for individual investors and analysts, while considering characteristics of different industries."
}