{
    "title": "Analyze Mass Spectrometry data with Artificial Intelligence to assist the understanding of past habitability of Mars and provide insights for future missions. (arXiv:2310.11888v1 [astro-ph.EP])",
    "abstract": "This paper presents an application of artificial intelligence on mass spectrometry data for detecting habitability potential of ancient Mars. Although data was collected for planet Mars the same approach can be replicated for any terrestrial object of our solar system. Furthermore, proposed methodology can be adapted to any domain that uses mass spectrometry. This research is focused in data analysis of two mass spectrometry techniques, evolved gas analysis (EGA-MS) and gas chromatography (GC-MS), which are used to identify specific chemical compounds in geological material samples. The study demonstrates the applicability of EGA-MS and GC-MS data to extra-terrestrial material analysis. Most important features of proposed methodology includes square root transformation of mass spectrometry values, conversion of raw data to 2D sprectrograms and utilization of specific machine learning models and techniques to avoid overfitting on relative small datasets. Both EGA-MS and GC-MS datasets c",
    "link": "http://arxiv.org/abs/2310.11888",
    "context": "Title: Analyze Mass Spectrometry data with Artificial Intelligence to assist the understanding of past habitability of Mars and provide insights for future missions. (arXiv:2310.11888v1 [astro-ph.EP])\nAbstract: This paper presents an application of artificial intelligence on mass spectrometry data for detecting habitability potential of ancient Mars. Although data was collected for planet Mars the same approach can be replicated for any terrestrial object of our solar system. Furthermore, proposed methodology can be adapted to any domain that uses mass spectrometry. This research is focused in data analysis of two mass spectrometry techniques, evolved gas analysis (EGA-MS) and gas chromatography (GC-MS), which are used to identify specific chemical compounds in geological material samples. The study demonstrates the applicability of EGA-MS and GC-MS data to extra-terrestrial material analysis. Most important features of proposed methodology includes square root transformation of mass spectrometry values, conversion of raw data to 2D sprectrograms and utilization of specific machine learning models and techniques to avoid overfitting on relative small datasets. Both EGA-MS and GC-MS datasets c",
    "path": "papers/23/10/2310.11888.json",
    "total_tokens": 975,
    "translated_title": "用人工智能分析质谱数据以辅助理解火星的过去适居性并提供未来任务的见解",
    "translated_abstract": "本文介绍了将人工智能应用于质谱数据以检测火星古代适居性潜力的方法。尽管数据是针对火星收集的，但同样的方法可以用于太阳系中的任何地球对象。此外，所提出的方法可以适应任何使用质谱的领域。研究集中于两种质谱技术（进化气体分析-质谱和气相色谱-质谱）的数据分析，这些技术用于识别地质样品中的特定化学化合物。研究证明了进化气体分析-质谱和气相色谱-质谱数据在外星物质分析中的适用性。所提出方法的最重要特征包括质谱值的平方根转换，将原始数据转换为二维光谱图，并利用特定的机器学习模型和技术以避免在相对较小的数据集上过度拟合。EGA-MS和GC-MS数据集",
    "tldr": "本文介绍了一种利用人工智能分析质谱数据以检测古代火星适居性潜力的方法，并展示了该方法在外星物质分析中的适用性。关键技术包括质谱值的转换、数据可视化和机器学习模型的应用。",
    "en_tdlr": "This paper presents a method that uses artificial intelligence to analyze mass spectrometry data for detecting habitability potential of ancient Mars, and demonstrates its applicability in analyzing extraterrestrial materials. Key techniques include transformation of mass spectrometry values, data visualization, and the use of machine learning models."
}