{
    "title": "Sky Imager-Based Forecast of Solar Irradiance Using Machine Learning. (arXiv:2310.17356v1 [cs.CV])",
    "abstract": "Ahead-of-time forecasting of the output power of power plants is essential for the stability of the electricity grid and ensuring uninterrupted service. However, forecasting renewable energy sources is difficult due to the chaotic behavior of natural energy sources. This paper presents a new approach to estimate short-term solar irradiance from sky images. The~proposed algorithm extracts features from sky images and use learning-based techniques to estimate the solar irradiance. The~performance of proposed machine learning (ML) algorithm is evaluated using two publicly available datasets of sky images. The~datasets contain over 350,000 images for an interval of 16 years, from 2004 to 2020, with the corresponding global horizontal irradiance (GHI) of each image as the ground truth. Compared to the state-of-the-art computationally heavy algorithms proposed in the literature, our approach achieves competitive results with much less computational complexity for both nowcasting and forecast",
    "link": "http://arxiv.org/abs/2310.17356",
    "context": "Title: Sky Imager-Based Forecast of Solar Irradiance Using Machine Learning. (arXiv:2310.17356v1 [cs.CV])\nAbstract: Ahead-of-time forecasting of the output power of power plants is essential for the stability of the electricity grid and ensuring uninterrupted service. However, forecasting renewable energy sources is difficult due to the chaotic behavior of natural energy sources. This paper presents a new approach to estimate short-term solar irradiance from sky images. The~proposed algorithm extracts features from sky images and use learning-based techniques to estimate the solar irradiance. The~performance of proposed machine learning (ML) algorithm is evaluated using two publicly available datasets of sky images. The~datasets contain over 350,000 images for an interval of 16 years, from 2004 to 2020, with the corresponding global horizontal irradiance (GHI) of each image as the ground truth. Compared to the state-of-the-art computationally heavy algorithms proposed in the literature, our approach achieves competitive results with much less computational complexity for both nowcasting and forecast",
    "path": "papers/23/10/2310.17356.json",
    "total_tokens": 931,
    "translated_title": "基于天空图像的机器学习太阳辐照度预测",
    "translated_abstract": "提前预测发电厂的输出功率对于电网的稳定和确保不间断服务至关重要。然而，由于自然能源的混沌行为，预测可再生能源的难度较大。本文提出了一种从天空图像估计短期太阳辐照度的新方法。所提出的算法从天空图像中提取特征，并采用基于学习的技术来估计太阳辐照度。通过使用两个公开可用的天空图像数据集来评估所提出的机器学习(ML)算法的性能。这些数据集包含16年的超过350,000个图像，从2004年到2020年，每个图像的对应全球水平辐照度(GHI)作为基准。与文献中提出的计算复杂度较高的最先进算法相比，我们的方法在现时预测和预测方面实现了具有竞争力的结果，但计算复杂度更低。",
    "tldr": "本论文提出了一种基于天空图像的机器学习预测太阳辐照度的新方法，通过提取天空图像特征并利用机器学习技术来估计太阳辐照度。经过与现有算法的比较，我们的方法在性能上表现出竞争力，并且具有更低的计算复杂度。(机器翻译)"
}