{
    "title": "Towards reducing hallucination in extracting information from financial reports using Large Language Models. (arXiv:2310.10760v1 [cs.CL])",
    "abstract": "For a financial analyst, the question and answer (Q\\&A) segment of the company financial report is a crucial piece of information for various analysis and investment decisions. However, extracting valuable insights from the Q\\&A section has posed considerable challenges as the conventional methods such as detailed reading and note-taking lack scalability and are susceptible to human errors, and Optical Character Recognition (OCR) and similar techniques encounter difficulties in accurately processing unstructured transcript text, often missing subtle linguistic nuances that drive investor decisions. Here, we demonstrate the utilization of Large Language Models (LLMs) to efficiently and rapidly extract information from earnings report transcripts while ensuring high accuracy transforming the extraction process as well as reducing hallucination by combining retrieval-augmented generation technique as well as metadata. We evaluate the outcomes of various LLMs with and without using our pro",
    "link": "http://arxiv.org/abs/2310.10760",
    "context": "Title: Towards reducing hallucination in extracting information from financial reports using Large Language Models. (arXiv:2310.10760v1 [cs.CL])\nAbstract: For a financial analyst, the question and answer (Q\\&A) segment of the company financial report is a crucial piece of information for various analysis and investment decisions. However, extracting valuable insights from the Q\\&A section has posed considerable challenges as the conventional methods such as detailed reading and note-taking lack scalability and are susceptible to human errors, and Optical Character Recognition (OCR) and similar techniques encounter difficulties in accurately processing unstructured transcript text, often missing subtle linguistic nuances that drive investor decisions. Here, we demonstrate the utilization of Large Language Models (LLMs) to efficiently and rapidly extract information from earnings report transcripts while ensuring high accuracy transforming the extraction process as well as reducing hallucination by combining retrieval-augmented generation technique as well as metadata. We evaluate the outcomes of various LLMs with and without using our pro",
    "path": "papers/23/10/2310.10760.json",
    "total_tokens": 827,
    "translated_title": "使用大型语言模型减少从财务报告中提取信息中的错误",
    "translated_abstract": "对于财务分析师来说，公司财务报告的问答（Q&A）部分是进行各种分析和投资决策的关键信息。然而，从问答部分中提取有价值的见解面临着很大的挑战，因为传统的方法如详细阅读和记笔记缺乏可扩展性，并容易受到人为错误的影响，而光学字符识别（OCR）和类似技术在准确处理无结构化的文字转录时遇到困难，常常错过驱动投资者决策的微妙的语言细微差别。在这里，我们演示了利用大型语言模型（LLMs）高效快速地从收益报告转录中提取信息，同时通过结合检索增强生成技术以及元数据来确保高精度的转化过程，并减少了错误的发生。",
    "tldr": "本文介绍了使用大型语言模型减少从财务报告中提取信息时的错误的方法，并且通过检索增强生成技术和元数据的结合，实现了高精度的信息提取过程。",
    "en_tdlr": "This paper presents a method for reducing errors in extracting information from financial reports using large language models. By combining retrieval-augmented generation technique with metadata, the extraction process achieves high accuracy and reduces inaccuracies."
}