{
    "title": "Variance Reduced Halpern Iteration for Finite-Sum Monotone Inclusions. (arXiv:2310.02987v1 [cs.LG])",
    "abstract": "Machine learning approaches relying on such criteria as adversarial robustness or multi-agent settings have raised the need for solving game-theoretic equilibrium problems. Of particular relevance to these applications are methods targeting finite-sum structure, which generically arises in empirical variants of learning problems in these contexts. Further, methods with computable approximation errors are highly desirable, as they provide verifiable exit criteria. Motivated by these applications, we study finite-sum monotone inclusion problems, which model broad classes of equilibrium problems. Our main contributions are variants of the classical Halpern iteration that employ variance reduction to obtain improved complexity guarantees in which $n$ component operators in the finite sum are ``on average'' either cocoercive or Lipschitz continuous and monotone, with parameter $L$. The resulting oracle complexity of our methods, which provide guarantees for the last iterate and for a (compu",
    "link": "http://arxiv.org/abs/2310.02987",
    "context": "Title: Variance Reduced Halpern Iteration for Finite-Sum Monotone Inclusions. (arXiv:2310.02987v1 [cs.LG])\nAbstract: Machine learning approaches relying on such criteria as adversarial robustness or multi-agent settings have raised the need for solving game-theoretic equilibrium problems. Of particular relevance to these applications are methods targeting finite-sum structure, which generically arises in empirical variants of learning problems in these contexts. Further, methods with computable approximation errors are highly desirable, as they provide verifiable exit criteria. Motivated by these applications, we study finite-sum monotone inclusion problems, which model broad classes of equilibrium problems. Our main contributions are variants of the classical Halpern iteration that employ variance reduction to obtain improved complexity guarantees in which $n$ component operators in the finite sum are ``on average'' either cocoercive or Lipschitz continuous and monotone, with parameter $L$. The resulting oracle complexity of our methods, which provide guarantees for the last iterate and for a (compu",
    "path": "papers/23/10/2310.02987.json",
    "total_tokens": 790,
    "translated_title": "方差减少的 Halpern 迭代在有限和单调包含中的应用",
    "translated_abstract": "依赖对抗稳健性或多智能体环境的机器学习方法引发了解决博弈均衡问题的需求。在这些应用中，具有可计算逼近误差的方法非常理想，因为它们提供了可验证的终止准则。在这些应用的基础上，我们研究了模拟广泛类别均衡问题的有限和单调包含问题。我们的主要贡献是改进了经典的 Halpern 迭代方法，利用方差减少获得改进的算法复杂度保证，在有限和的 $n$ 个组成操作符中，“平均”地是互补协同或Lipschitz连续和单调，参数为 $L$。我们的方法的结果预测了最后的迭代和一个（compu）",
    "tldr": "提出了使用方差减少的 Halpern 迭代来优化有限和单调包含问题的求解过程，具有更好的复杂度保证。"
}