{
    "title": "A novel Network Science Algorithm for Improving Triage of Patients. (arXiv:2310.05996v1 [cs.LG])",
    "abstract": "Patient triage plays a crucial role in healthcare, ensuring timely and appropriate care based on the urgency of patient conditions. Traditional triage methods heavily rely on human judgment, which can be subjective and prone to errors. Recently, a growing interest has been in leveraging artificial intelligence (AI) to develop algorithms for triaging patients. This paper presents the development of a novel algorithm for triaging patients. It is based on the analysis of patient data to produce decisions regarding their prioritization. The algorithm was trained on a comprehensive data set containing relevant patient information, such as vital signs, symptoms, and medical history. The algorithm was designed to accurately classify patients into triage categories through rigorous preprocessing and feature engineering. Experimental results demonstrate that our algorithm achieved high accuracy and performance, outperforming traditional triage methods. By incorporating computer science into the",
    "link": "http://arxiv.org/abs/2310.05996",
    "context": "Title: A novel Network Science Algorithm for Improving Triage of Patients. (arXiv:2310.05996v1 [cs.LG])\nAbstract: Patient triage plays a crucial role in healthcare, ensuring timely and appropriate care based on the urgency of patient conditions. Traditional triage methods heavily rely on human judgment, which can be subjective and prone to errors. Recently, a growing interest has been in leveraging artificial intelligence (AI) to develop algorithms for triaging patients. This paper presents the development of a novel algorithm for triaging patients. It is based on the analysis of patient data to produce decisions regarding their prioritization. The algorithm was trained on a comprehensive data set containing relevant patient information, such as vital signs, symptoms, and medical history. The algorithm was designed to accurately classify patients into triage categories through rigorous preprocessing and feature engineering. Experimental results demonstrate that our algorithm achieved high accuracy and performance, outperforming traditional triage methods. By incorporating computer science into the",
    "path": "papers/23/10/2310.05996.json",
    "total_tokens": 931,
    "translated_title": "通过一种新颖的网络科学算法改进患者分类的方法",
    "translated_abstract": "患者分类在医疗保健中起着至关重要的作用，可以根据患者病情的紧急程度确保及时和恰当的护理。传统的分类方法很大程度上依赖于人的判断，这可能存在主观性和错误的问题。最近，越来越多的关注点是利用人工智能（AI）开发用于患者分类的算法。本文介绍了一种新颖的患者分类算法的开发过程。它基于对患者数据的分析，以产生有关其优先级的决策。该算法是在包含相关患者信息的综合数据集上进行训练的，例如生命体征、症状和病史等。通过严格的预处理和特征工程，该算法被设计为能够准确地将患者分类到分类类别中。实验结果表明，我们的算法实现了高准确率和性能，优于传统的分类方法。通过将计算机科学纳入患者分类过程中，可以改善分类的准确性和效率。",
    "tldr": "本研究开发了一种使用网络科学算法进行患者分类的新方法。该算法通过对患者数据进行分析，并通过严格的数据预处理和特征工程，实现了高准确率和性能。通过将人工智能引入患者分类，可以提高分类的准确性和效率。"
}