{
    "title": "TempGNN: Temporal Graph Neural Networks for Dynamic Session-Based Recommendations. (arXiv:2310.13249v1 [cs.IR])",
    "abstract": "Session-based recommendations which predict the next action by understanding a user's interaction behavior with items within a relatively short ongoing session have recently gained increasing popularity. Previous research has focused on capturing the dynamics of sequential dependencies from complicated item transitions in a session by means of recurrent neural networks, self-attention models, and recently, mostly graph neural networks. Despite the plethora of different models relying on the order of items in a session, few approaches have been proposed for dealing better with the temporal implications between interactions. We present Temporal Graph Neural Networks (TempGNN), a generic framework for capturing the structural and temporal dynamics in complex item transitions utilizing temporal embedding operators on nodes and edges on dynamic session graphs, represented as sequences of timed events. Extensive experimental results show the effectiveness and adaptability of the proposed met",
    "link": "http://arxiv.org/abs/2310.13249",
    "context": "Title: TempGNN: Temporal Graph Neural Networks for Dynamic Session-Based Recommendations. (arXiv:2310.13249v1 [cs.IR])\nAbstract: Session-based recommendations which predict the next action by understanding a user's interaction behavior with items within a relatively short ongoing session have recently gained increasing popularity. Previous research has focused on capturing the dynamics of sequential dependencies from complicated item transitions in a session by means of recurrent neural networks, self-attention models, and recently, mostly graph neural networks. Despite the plethora of different models relying on the order of items in a session, few approaches have been proposed for dealing better with the temporal implications between interactions. We present Temporal Graph Neural Networks (TempGNN), a generic framework for capturing the structural and temporal dynamics in complex item transitions utilizing temporal embedding operators on nodes and edges on dynamic session graphs, represented as sequences of timed events. Extensive experimental results show the effectiveness and adaptability of the proposed met",
    "path": "papers/23/10/2310.13249.json",
    "total_tokens": 820,
    "translated_title": "TempGNN: 用于动态会话推荐的时间图神经网络",
    "translated_abstract": "最近，基于会话的推荐系统通过理解用户在短期会话中与物品的交互行为来预测下一步动作的方法受到了广泛关注。以前的研究主要集中在通过循环神经网络、自注意模型和最近的大多数图神经网络来捕捉会话中复杂物品转换的顺序依赖性。尽管有很多根据会话中物品顺序的不同模型，但很少有方法来更好地处理交互之间的时间意义。我们提出了一种名为Temporal Graph Neural Networks (TempGNN)的通用框架，利用节点和边上的时间嵌入操作来捕捉复杂物品转换的结构和时间动态，将其表示为定时事件序列的动态会话图。广泛的实验结果显示了所提方法的有效性和适应性。",
    "tldr": "TempGNN是一种用于动态会话推荐的时间图神经网络，可以捕捉复杂物品转换的结构和时间动态，通过对动态会话图中的节点和边进行时间嵌入操作，有效地预测下一步动作。"
}