{
    "title": "Modified LAB Algorithm with Clustering-based Search Space Reduction Method for solving Engineering Design Problems. (arXiv:2310.03055v1 [cs.LG])",
    "abstract": "A modified LAB algorithm is introduced in this paper. It builds upon the original LAB algorithm (Reddy et al. 2023), which is a socio-inspired algorithm that models competitive and learning behaviours within a group, establishing hierarchical roles. The proposed algorithm incorporates the roulette wheel approach and a reduction factor introducing inter-group competition and iteratively narrowing down the sample space. The algorithm is validated by solving the benchmark test problems from CEC 2005 and CEC 2017. The solutions are validated using standard statistical tests such as two-sided and pairwise signed rank Wilcoxon test and Friedman rank test. The algorithm exhibited improved and superior robustness as well as search space exploration capabilities. Furthermore, a Clustering-Based Search Space Reduction (C-SSR) method is proposed, making the algorithm capable to solve constrained problems. The C-SSR method enables the algorithm to identify clusters of feasible regions, satisfying ",
    "link": "http://arxiv.org/abs/2310.03055",
    "context": "Title: Modified LAB Algorithm with Clustering-based Search Space Reduction Method for solving Engineering Design Problems. (arXiv:2310.03055v1 [cs.LG])\nAbstract: A modified LAB algorithm is introduced in this paper. It builds upon the original LAB algorithm (Reddy et al. 2023), which is a socio-inspired algorithm that models competitive and learning behaviours within a group, establishing hierarchical roles. The proposed algorithm incorporates the roulette wheel approach and a reduction factor introducing inter-group competition and iteratively narrowing down the sample space. The algorithm is validated by solving the benchmark test problems from CEC 2005 and CEC 2017. The solutions are validated using standard statistical tests such as two-sided and pairwise signed rank Wilcoxon test and Friedman rank test. The algorithm exhibited improved and superior robustness as well as search space exploration capabilities. Furthermore, a Clustering-Based Search Space Reduction (C-SSR) method is proposed, making the algorithm capable to solve constrained problems. The C-SSR method enables the algorithm to identify clusters of feasible regions, satisfying ",
    "path": "papers/23/10/2310.03055.json",
    "total_tokens": 885,
    "translated_title": "修改后的LAB算法及基于聚类的搜索空间缩减方法在工程设计问题求解中的应用",
    "translated_abstract": "本文介绍了一种修改后的LAB算法。该算法建立在原始的LAB算法（Reddy等人，2023年）基础上，该算法模拟了群体内部的竞争和学习行为，建立了层次角色。所提出的算法利用了轮盘赌方法和缩减因子，引入了群组间竞争，并逐步缩小样本空间。该算法通过解决CEC 2005和CEC 2017的基准测试问题进行验证。使用双边和成对符号秩Wilcoxon测试以及Friedman秩测试对解决方案进行验证。该算法具有改进和卓越的稳健性以及搜索空间探索能力。此外，本文还提出了一种基于聚类的搜索空间缩减（C-SSR）方法，使算法能够解决约束问题。C-SSR方法使算法能够识别满足约束条件的可行区域之间的聚类。",
    "tldr": "本文介绍了一种修改后的LAB算法，并提出了基于聚类的搜索空间缩减方法，该算法在工程设计问题求解中表现出改进的稳健性和搜索空间探索能力，同时能够解决约束问题。"
}