{
    "title": "Explicit Alignment and Many-to-many Entailment Based Reasoning for Conversational Machine Reading. (arXiv:2310.13409v1 [cs.CL])",
    "abstract": "Conversational Machine Reading (CMR) requires answering a user's initial question through multi-turn dialogue interactions based on a given document. Although there exist many effective methods, they largely neglected the alignment between the document and the user-provided information, which significantly affects the intermediate decision-making and subsequent follow-up question generation. To address this issue, we propose a pipeline framework that (1) aligns the aforementioned two sides in an explicit way, (2)makes decisions using a lightweight many-to-many entailment reasoning module, and (3) directly generates follow-up questions based on the document and previously asked questions. Our proposed method achieves state-of-the-art in micro-accuracy and ranks the first place on the public leaderboard of the CMR benchmark dataset ShARC.",
    "link": "http://arxiv.org/abs/2310.13409",
    "context": "Title: Explicit Alignment and Many-to-many Entailment Based Reasoning for Conversational Machine Reading. (arXiv:2310.13409v1 [cs.CL])\nAbstract: Conversational Machine Reading (CMR) requires answering a user's initial question through multi-turn dialogue interactions based on a given document. Although there exist many effective methods, they largely neglected the alignment between the document and the user-provided information, which significantly affects the intermediate decision-making and subsequent follow-up question generation. To address this issue, we propose a pipeline framework that (1) aligns the aforementioned two sides in an explicit way, (2)makes decisions using a lightweight many-to-many entailment reasoning module, and (3) directly generates follow-up questions based on the document and previously asked questions. Our proposed method achieves state-of-the-art in micro-accuracy and ranks the first place on the public leaderboard of the CMR benchmark dataset ShARC.",
    "path": "papers/23/10/2310.13409.json",
    "total_tokens": 907,
    "translated_title": "显式对齐和多对多蕴涵推理：用于会话式机器阅读的方法",
    "translated_abstract": "会话式机器阅读（CMR）要求基于给定的文档，通过多轮对话交互回答用户的初始问题。虽然存在许多有效的方法，但它们在文档和用户提供的信息之间的对齐方面往往被忽视，这严重影响了中间决策和后续问题生成的过程。为了解决这个问题，我们提出了一个流水线框架，该框架（1）以显式方式对齐上述两个方面，（2）使用轻量级的多对多蕴涵推理模块进行决策，（3）基于文档和先前问过的问题直接生成后续问题。我们提出的方法在微准确度方面达到了最先进的水平，并在CMR基准数据集ShARC的公开排行榜上名列第一。",
    "tldr": "这项研究提出了一种显式对齐和多对多蕴涵推理的方法，用于会话式机器阅读，通过对齐文档和用户提供的信息，以及根据前期问过的问题，实现了中间决策和后续问题生成的优化。这一方法在CMR基准数据集上取得了最先进的结果，并在排行榜上表现出色。",
    "en_tdlr": "This research presents an approach that utilizes explicit alignment and many-to-many entailment reasoning for conversational machine reading. By aligning the document and user-provided information, as well as generating follow-up questions based on previously asked questions, the method improves the intermediate decision-making and question generation process. The proposed method achieves state-of-the-art results on the CMR benchmark dataset and performs exceptionally well on the leaderboard."
}