{
    "title": "Dual-stage Flows-based Generative Modeling for Traceable Urban Planning. (arXiv:2310.02453v1 [cs.LG])",
    "abstract": "Urban planning, which aims to design feasible land-use configurations for target areas, has become increasingly essential due to the high-speed urbanization process in the modern era. However, the traditional urban planning conducted by human designers can be a complex and onerous task. Thanks to the advancement of deep learning algorithms, researchers have started to develop automated planning techniques. While these models have exhibited promising results, they still grapple with a couple of unresolved limitations: 1) Ignoring the relationship between urban functional zones and configurations and failing to capture the relationship among different functional zones. 2) Less interpretable and stable generation process. To overcome these limitations, we propose a novel generative framework based on normalizing flows, namely Dual-stage Urban Flows (DSUF) framework. Specifically, the first stage is to utilize zone-level urban planning flows to generate urban functional zones based on give",
    "link": "http://arxiv.org/abs/2310.02453",
    "context": "Title: Dual-stage Flows-based Generative Modeling for Traceable Urban Planning. (arXiv:2310.02453v1 [cs.LG])\nAbstract: Urban planning, which aims to design feasible land-use configurations for target areas, has become increasingly essential due to the high-speed urbanization process in the modern era. However, the traditional urban planning conducted by human designers can be a complex and onerous task. Thanks to the advancement of deep learning algorithms, researchers have started to develop automated planning techniques. While these models have exhibited promising results, they still grapple with a couple of unresolved limitations: 1) Ignoring the relationship between urban functional zones and configurations and failing to capture the relationship among different functional zones. 2) Less interpretable and stable generation process. To overcome these limitations, we propose a novel generative framework based on normalizing flows, namely Dual-stage Urban Flows (DSUF) framework. Specifically, the first stage is to utilize zone-level urban planning flows to generate urban functional zones based on give",
    "path": "papers/23/10/2310.02453.json",
    "total_tokens": 823,
    "translated_title": "可追溯城市规划的双阶段流式生成建模",
    "translated_abstract": "城市规划在当代社会的高速城市化进程中变得越来越重要，但传统的人工规划方法复杂且繁重。由于深度学习算法的进步，研究人员开始开发自动化规划技术。虽然这些模型取得了有希望的结果，但仍存在一些未解决的限制：1）忽略城市功能区之间的关系以及无法捕捉不同功能区之间的关系。2）生成过程缺乏解释性和稳定性。为了克服这些限制，我们提出了一种基于归一化流的新型生成框架，即双阶段城市流(DSUF)框架。具体而言，第一阶段利用区域级城市规划流来生成基于给定配置的城市功能区。",
    "tldr": "这项研究提出了一种基于流式生成模型的双阶段城市规划框架，用于解决传统城市规划方法中忽略功能区关系、生成过程不稳定等问题。",
    "en_tdlr": "This research proposes a dual-stage urban planning framework based on flow-based generative modeling to address the limitations of traditional urban planning methods, such as ignoring the relationship between functional zones and instability in the generation process."
}