{
    "title": "Topological Learning for Motion Data via Mixed Coordinates. (arXiv:2310.19960v1 [cs.LG])",
    "abstract": "Topology can extract the structural information in a dataset efficiently. In this paper, we attempt to incorporate topological information into a multiple output Gaussian process model for transfer learning purposes. To achieve this goal, we extend the framework of circular coordinates into a novel framework of mixed valued coordinates to take linear trends in the time series into consideration.  One of the major challenges to learn from multiple time series effectively via a multiple output Gaussian process model is constructing a functional kernel. We propose to use topologically induced clustering to construct a cluster based kernel in a multiple output Gaussian process model. This kernel not only incorporates the topological structural information, but also allows us to put forward a unified framework using topological information in time and motion series.",
    "link": "http://arxiv.org/abs/2310.19960",
    "context": "Title: Topological Learning for Motion Data via Mixed Coordinates. (arXiv:2310.19960v1 [cs.LG])\nAbstract: Topology can extract the structural information in a dataset efficiently. In this paper, we attempt to incorporate topological information into a multiple output Gaussian process model for transfer learning purposes. To achieve this goal, we extend the framework of circular coordinates into a novel framework of mixed valued coordinates to take linear trends in the time series into consideration.  One of the major challenges to learn from multiple time series effectively via a multiple output Gaussian process model is constructing a functional kernel. We propose to use topologically induced clustering to construct a cluster based kernel in a multiple output Gaussian process model. This kernel not only incorporates the topological structural information, but also allows us to put forward a unified framework using topological information in time and motion series.",
    "path": "papers/23/10/2310.19960.json",
    "total_tokens": 746,
    "translated_title": "通过混合坐标为运动数据进行拓扑学习",
    "translated_abstract": "拓扑学可以高效地提取数据集中的结构信息。本文试图将拓扑信息引入多输出高斯过程模型中，以实现迁移学习。为了达到这个目标，我们将环形坐标的框架扩展为一种新颖的混合值坐标框架，以考虑时间序列中的线性趋势。通过拓扑诱导的聚类构建一个基于聚类的核心在多输出高斯过程模型中，是从多个时间序列中有效学习的主要挑战之一。这个核心不仅融入了拓扑结构信息，还允许我们提出一个统一的框架，利用拓扑信息来处理时间和运动序列。",
    "tldr": "本文通过混合坐标和拓扑诱导的聚类在一种多输出高斯过程模型中引入了拓扑信息，以提取结构信息，并能在时间和运动序列分析中应用。"
}