{
    "title": "GRI: Graph-based Relative Isomorphism of Word Embedding Spaces. (arXiv:2310.12360v1 [cs.CL])",
    "abstract": "Automated construction of bilingual dictionaries using monolingual embedding spaces is a core challenge in machine translation. The end performance of these dictionaries relies upon the geometric similarity of individual spaces, i.e., their degree of isomorphism. Existing attempts aimed at controlling the relative isomorphism of different spaces fail to incorporate the impact of semantically related words in the training objective. To address this, we propose GRI that combines the distributional training objectives with attentive graph convolutions to unanimously consider the impact of semantically similar words required to define/compute the relative isomorphism of multiple spaces. Experimental evaluation shows that GRI outperforms the existing research by improving the average P@1 by a relative score of up to 63.6%. We release the codes for GRI at https://github.com/asif6827/GRI.",
    "link": "http://arxiv.org/abs/2310.12360",
    "context": "Title: GRI: Graph-based Relative Isomorphism of Word Embedding Spaces. (arXiv:2310.12360v1 [cs.CL])\nAbstract: Automated construction of bilingual dictionaries using monolingual embedding spaces is a core challenge in machine translation. The end performance of these dictionaries relies upon the geometric similarity of individual spaces, i.e., their degree of isomorphism. Existing attempts aimed at controlling the relative isomorphism of different spaces fail to incorporate the impact of semantically related words in the training objective. To address this, we propose GRI that combines the distributional training objectives with attentive graph convolutions to unanimously consider the impact of semantically similar words required to define/compute the relative isomorphism of multiple spaces. Experimental evaluation shows that GRI outperforms the existing research by improving the average P@1 by a relative score of up to 63.6%. We release the codes for GRI at https://github.com/asif6827/GRI.",
    "path": "papers/23/10/2310.12360.json",
    "total_tokens": 896,
    "translated_title": "GRI：基于图的词嵌入空间的相对同构",
    "translated_abstract": "在机器翻译中，使用单语言嵌入空间自动构建双语词典是一个核心挑战。这些词典的最终性能取决于个别空间的几何相似性，即它们的同构程度。现有的尝试控制不同空间的相对同构性无法将语义相关词汇的影响纳入到训练目标中。为了解决这个问题，我们提出了GRI方法，该方法将分布式训练目标与注意力图卷积相结合，以一致地考虑定义/计算多个空间之间的相对同构性所需的语义相似词汇的影响。实验评估表明，GRI通过将平均P@1的相对得分提升了高达63.6％，优于现有研究。我们在https://github.com/asif6827/GRI上发布GRI的代码。",
    "tldr": "提出了一种名为GRI的方法，通过结合分布训练目标和注意力图卷积，一致地考虑多个空间之间定义/计算相对同构性所需的语义相似词汇的影响。在实验评估中，GRI在平均P@1上相对得分提升了高达63.6％。"
}