{
    "title": "Posterior Estimation for Dynamic PET imaging using Conditional Variational Inference. (arXiv:2310.15850v1 [physics.med-ph])",
    "abstract": "This work aims efficiently estimating the posterior distribution of kinetic parameters for dynamic positron emission tomography (PET) imaging given a measurement of time of activity curve. Considering the inherent information loss from parametric imaging to measurement space with the forward kinetic model, the inverse mapping is ambiguous. The conventional (but expensive) solution can be the Markov Chain Monte Carlo (MCMC) sampling, which is known to produce unbiased asymptotical estimation. We propose a deep-learning-based framework for efficient posterior estimation. Specifically, we counteract the information loss in the forward process by introducing latent variables. Then, we use a conditional variational autoencoder (CVAE) and optimize its evidence lower bound. The well-trained decoder is able to infer the posterior with a given measurement and the sampled latent variables following a simple multivariate Gaussian distribution. We validate our CVAE-based method using unbiased MCMC",
    "link": "http://arxiv.org/abs/2310.15850",
    "context": "Title: Posterior Estimation for Dynamic PET imaging using Conditional Variational Inference. (arXiv:2310.15850v1 [physics.med-ph])\nAbstract: This work aims efficiently estimating the posterior distribution of kinetic parameters for dynamic positron emission tomography (PET) imaging given a measurement of time of activity curve. Considering the inherent information loss from parametric imaging to measurement space with the forward kinetic model, the inverse mapping is ambiguous. The conventional (but expensive) solution can be the Markov Chain Monte Carlo (MCMC) sampling, which is known to produce unbiased asymptotical estimation. We propose a deep-learning-based framework for efficient posterior estimation. Specifically, we counteract the information loss in the forward process by introducing latent variables. Then, we use a conditional variational autoencoder (CVAE) and optimize its evidence lower bound. The well-trained decoder is able to infer the posterior with a given measurement and the sampled latent variables following a simple multivariate Gaussian distribution. We validate our CVAE-based method using unbiased MCMC",
    "path": "papers/23/10/2310.15850.json",
    "total_tokens": 940,
    "translated_title": "使用条件变分推断进行动态PET成像的后验估计",
    "translated_abstract": "本文旨在有效地估计动态正电子发射断层成像（PET）中动力学参数的后验分布，给定时间-活性曲线的测量。考虑到使用前向动态模型从参数成像到测量空间中的固有信息损失，反向映射是模糊的。传统（但昂贵）的解决方法可以是马尔可夫链蒙特卡罗（MCMC）采样，已知可产生无偏的渐近估计。我们提出了一个基于深度学习的框架，用于高效的后验估计。具体而言，我们通过引入潜在变量来对抗前向过程中的信息损失。然后，我们使用一个条件变分自编码器（CVAE）并优化其证据下界。经过良好训练的解码器能够根据给定的测量和采样的潜在变量推断出后验概率，后验概率遵循一个简单的多元高斯分布。我们使用无偏的MCMC验证了我们CVAE的方法。",
    "tldr": "本文提出了一个基于深度学习的框架，用于有效估计动态PET成像中的后验分布。通过引入潜在变量来对抗前向过程中的信息损失，并使用条件变分自编码器进行优化，我们能够用简单的多元高斯分布推断出后验概率。"
}