{
    "title": "Euclid: Identification of asteroid streaks in simulated images using deep learning. (arXiv:2310.03845v1 [astro-ph.EP])",
    "abstract": "Up to 150000 asteroids will be visible in the images of the ESA Euclid space telescope, and the instruments of Euclid offer multiband visual to near-infrared photometry and slitless spectra of these objects. Most asteroids will appear as streaks in the images. Due to the large number of images and asteroids, automated detection methods are needed. A non-machine-learning approach based on the StreakDet software was previously tested, but the results were not optimal for short and/or faint streaks. We set out to improve the capability to detect asteroid streaks in Euclid images by using deep learning.  We built, trained, and tested a three-step machine-learning pipeline with simulated Euclid images. First, a convolutional neural network (CNN) detected streaks and their coordinates in full images, aiming to maximize the completeness (recall) of detections. Then, a recurrent neural network (RNN) merged snippets of long streaks detected in several parts by the CNN. Lastly, gradient-boosted ",
    "link": "http://arxiv.org/abs/2310.03845",
    "context": "Title: Euclid: Identification of asteroid streaks in simulated images using deep learning. (arXiv:2310.03845v1 [astro-ph.EP])\nAbstract: Up to 150000 asteroids will be visible in the images of the ESA Euclid space telescope, and the instruments of Euclid offer multiband visual to near-infrared photometry and slitless spectra of these objects. Most asteroids will appear as streaks in the images. Due to the large number of images and asteroids, automated detection methods are needed. A non-machine-learning approach based on the StreakDet software was previously tested, but the results were not optimal for short and/or faint streaks. We set out to improve the capability to detect asteroid streaks in Euclid images by using deep learning.  We built, trained, and tested a three-step machine-learning pipeline with simulated Euclid images. First, a convolutional neural network (CNN) detected streaks and their coordinates in full images, aiming to maximize the completeness (recall) of detections. Then, a recurrent neural network (RNN) merged snippets of long streaks detected in several parts by the CNN. Lastly, gradient-boosted ",
    "path": "papers/23/10/2310.03845.json",
    "total_tokens": 925,
    "translated_title": "Euclid:使用深度学习识别模拟图像中的小行星光迹",
    "translated_abstract": "在ESA Euclid空间望远镜的图像中，最多有15万颗小行星可见，并且Euclid的仪器提供这些物体的多频段可见光到近红外光度测量和无狭缝光谱。大多数小行星将出现在图像中的光迹中。由于图像和小行星的数量庞大，需要自动化的检测方法。以前曾尝试了一种基于StreakDet软件的非机器学习方法，但对于短暂和/或微弱的光迹，结果不理想。我们决定通过使用深度学习来改善Euclid图像中的小行星光迹检测能力。我们使用模拟的Euclid图像构建、训练和测试了一个三步机器学习流程。首先，使用卷积神经网络（CNN）在完整的图像中检测光迹及其坐标，以最大化检测的完整性（召回率）。然后，使用循环神经网络（RNN）合并CNN在多个部分检测到的长光迹的片段。最后，使用梯度提升方法对光迹进行筛选和分类。",
    "tldr": "该论文提出了一种使用深度学习识别Euclid空间望远镜图像中小行星光迹的方法。通过构建、训练和测试一个三步机器学习流程，最终实现了对光迹的自动化检测和分类。"
}