{
    "title": "Anomaly Detection of Command Shell Sessions based on DistilBERT: Unsupervised and Supervised Approaches. (arXiv:2310.13247v1 [cs.CL])",
    "abstract": "Anomaly detection in command shell sessions is a critical aspect of computer security. Recent advances in deep learning and natural language processing, particularly transformer-based models, have shown great promise for addressing complex security challenges. In this paper, we implement a comprehensive approach to detect anomalies in Unix shell sessions using a pretrained DistilBERT model, leveraging both unsupervised and supervised learning techniques to identify anomalous activity while minimizing data labeling. The unsupervised method captures the underlying structure and syntax of Unix shell commands, enabling the detection of session deviations from normal behavior. Experiments on a large-scale enterprise dataset collected from production systems demonstrate the effectiveness of our approach in detecting anomalous behavior in Unix shell sessions. This work highlights the potential of leveraging recent advances in transformers to address important computer security challenges.",
    "link": "http://arxiv.org/abs/2310.13247",
    "context": "Title: Anomaly Detection of Command Shell Sessions based on DistilBERT: Unsupervised and Supervised Approaches. (arXiv:2310.13247v1 [cs.CL])\nAbstract: Anomaly detection in command shell sessions is a critical aspect of computer security. Recent advances in deep learning and natural language processing, particularly transformer-based models, have shown great promise for addressing complex security challenges. In this paper, we implement a comprehensive approach to detect anomalies in Unix shell sessions using a pretrained DistilBERT model, leveraging both unsupervised and supervised learning techniques to identify anomalous activity while minimizing data labeling. The unsupervised method captures the underlying structure and syntax of Unix shell commands, enabling the detection of session deviations from normal behavior. Experiments on a large-scale enterprise dataset collected from production systems demonstrate the effectiveness of our approach in detecting anomalous behavior in Unix shell sessions. This work highlights the potential of leveraging recent advances in transformers to address important computer security challenges.",
    "path": "papers/23/10/2310.13247.json",
    "total_tokens": 946,
    "translated_title": "基于DistilBERT的命令行会话异常检测：无监督和有监督方法",
    "translated_abstract": "命令行会话中的异常检测是计算机安全的一个关键方面。近年来深度学习和自然语言处理的进展，特别是基于Transformer的模型，显示出在解决复杂安全挑战方面的巨大潜力。本文使用预训练的DistilBERT模型实现了一个综合方法，通过无监督和有监督学习技术来检测Unix命令行会话中的异常情况，同时最大限度地减少数据标记。无监督方法捕捉Unix命令行命令的底层结构和语法，实现对会话与正常行为的偏差的检测。在从生产系统收集的大规模企业数据集上进行的实验证明了我们方法在检测Unix命令行会话中异常行为方面的有效性。这项工作凸显了利用Transformer的最新进展来解决重要的计算机安全挑战的潜力。",
    "tldr": "本研究基于DistilBERT模型, 综合应用无监督和有监督学习方法，实现了 Unix 命令行会话的异常检测。通过捕捉命令的结构和语法，实现对会话中与正常行为偏离的异常检测。实验证明了该方法在大规模企业数据集上的有效性，并凸显了利用 Transformer 解决计算机安全挑战的潜力。",
    "en_tdlr": "This study proposes an anomaly detection method for Unix command shell sessions using DistilBERT model, combining unsupervised and supervised learning techniques to capture the underlying structure and syntax of command shell commands, and effectively detect deviations from normal behavior. The experiments demonstrate the effectiveness of the proposed approach on a large-scale enterprise dataset and highlight the potential of leveraging transformers for addressing computer security challenges."
}