{
    "title": "Bargain your share: The role of workers bargaining power for labor share, with reference to transition economies. (arXiv:2310.04904v1 [econ.GN])",
    "abstract": "The objective of the paper is to understand the role of workers bargaining for the labor share in transition economies. We rely on a share-capital schedule, whereby workers bargaining power is represented as a move off the schedule. Quantitative indicators of bargaining power are amended with own-constructed qualitative indices from textual information describing the legal enabling environment for bargaining in each country. Multiple data constraints impose reliance on a cross-sectional empirical model estimated with IV methods, whereby former unionization rates and the time since the adoption of the ILO Collective Bargaining Convention are used as exogenous instruments. The sample is composed of 23 industrial branches in 69 countries, of which 28 transition ones. In general, we find the stronger bargaining power to influence higher labor share, when the former is measured either quantitatively or qualitatively. On the contrary, higher bargaining power results in lower labor share in t",
    "link": "http://arxiv.org/abs/2310.04904",
    "context": "Title: Bargain your share: The role of workers bargaining power for labor share, with reference to transition economies. (arXiv:2310.04904v1 [econ.GN])\nAbstract: The objective of the paper is to understand the role of workers bargaining for the labor share in transition economies. We rely on a share-capital schedule, whereby workers bargaining power is represented as a move off the schedule. Quantitative indicators of bargaining power are amended with own-constructed qualitative indices from textual information describing the legal enabling environment for bargaining in each country. Multiple data constraints impose reliance on a cross-sectional empirical model estimated with IV methods, whereby former unionization rates and the time since the adoption of the ILO Collective Bargaining Convention are used as exogenous instruments. The sample is composed of 23 industrial branches in 69 countries, of which 28 transition ones. In general, we find the stronger bargaining power to influence higher labor share, when the former is measured either quantitatively or qualitatively. On the contrary, higher bargaining power results in lower labor share in t",
    "path": "papers/23/10/2310.04904.json",
    "total_tokens": 844,
    "translated_title": "议价你的份额：论工人议价权对劳动份额的作用，以转型经济体为例",
    "translated_abstract": "本文旨在理解工人议价对转型经济体劳动份额的作用。我们使用股份-资本调度表来表示工人议价权力的变动。定量的议价权指标与描述每个国家谈判法律环境的文本信息构建的定性指标相结合。由于多个数据限制，我们采用这些定性指标估计了跨部门的经验模型，并使用前工会化率和通过国际劳工组织集体谈判公约的颁布时间作为外生工具。样本包括69个国家中的23个工业部门，其中包括28个转型国家。总体而言，我们发现较强的议价权力对劳动份额有积极的影响，不论是定量还是定性的指标。而相反，较高的议价权力会导致较低的劳动份额。",
    "tldr": "本文研究了工人议价对转型经济体劳动份额的影响，发现较强的议价权力会提高劳动份额，而较高的议价权力则会降低劳动份额。"
}