{
    "title": "Conformal Contextual Robust Optimization. (arXiv:2310.10003v1 [stat.ME])",
    "abstract": "Data-driven approaches to predict-then-optimize decision-making problems seek to mitigate the risk of uncertainty region misspecification in safety-critical settings. Current approaches, however, suffer from considering overly conservative uncertainty regions, often resulting in suboptimal decisionmaking. To this end, we propose Conformal-Predict-Then-Optimize (CPO), a framework for leveraging highly informative, nonconvex conformal prediction regions over high-dimensional spaces based on conditional generative models, which have the desired distribution-free coverage guarantees. Despite guaranteeing robustness, such black-box optimization procedures alone inspire little confidence owing to the lack of explanation of why a particular decision was found to be optimal. We, therefore, augment CPO to additionally provide semantically meaningful visual summaries of the uncertainty regions to give qualitative intuition for the optimal decision. We highlight the CPO framework by demonstrating",
    "link": "http://arxiv.org/abs/2310.10003",
    "context": "Title: Conformal Contextual Robust Optimization. (arXiv:2310.10003v1 [stat.ME])\nAbstract: Data-driven approaches to predict-then-optimize decision-making problems seek to mitigate the risk of uncertainty region misspecification in safety-critical settings. Current approaches, however, suffer from considering overly conservative uncertainty regions, often resulting in suboptimal decisionmaking. To this end, we propose Conformal-Predict-Then-Optimize (CPO), a framework for leveraging highly informative, nonconvex conformal prediction regions over high-dimensional spaces based on conditional generative models, which have the desired distribution-free coverage guarantees. Despite guaranteeing robustness, such black-box optimization procedures alone inspire little confidence owing to the lack of explanation of why a particular decision was found to be optimal. We, therefore, augment CPO to additionally provide semantically meaningful visual summaries of the uncertainty regions to give qualitative intuition for the optimal decision. We highlight the CPO framework by demonstrating",
    "path": "papers/23/10/2310.10003.json",
    "total_tokens": 928,
    "translated_title": "《一种符合环境的鲁棒性优化方法》",
    "translated_abstract": "数据驱动的预测-优化决策问题的方法旨在减轻安全关键环境中不确定性区域建模错误的风险。然而，目前的方法往往考虑过于保守的不确定性区域，导致次优的决策结果。为此，我们提出了一种名为Conformal-Predict-Then-Optimize (CPO)的框架，该框架利用基于条件生成模型的高维非凸拟合预测区域，具有期望的无分布性保证。尽管能够保证鲁棒性，但仅仅使用这种黑盒优化过程会带来很少的置信度，因为无法解释为何某个决策被认为是最优的。因此，我们还增加了CPO的功能，可以提供对不确定性区域的语义可理解的可视化总结，以便直观地理解最优决策。我们通过展示来突出CPO框架的重要性。",
    "tldr": "提出了一种Conformal-Predict-Then-Optimize（CPO）框架，利用高维非凸拟合预测区域，在数据驱动的预测-优化决策问题中减轻了安全关键环境中不确定性区域建模错误的风险，并通过提供语义可理解的可视化总结来解释最优决策。"
}