{
    "title": "Studying the Effects of Sex-related Differences on Brain Age Prediction using brain MR Imaging. (arXiv:2310.11577v1 [eess.IV])",
    "abstract": "While utilizing machine learning models, one of the most crucial aspects is how bias and fairness affect model outcomes for diverse demographics. This becomes especially relevant in the context of machine learning for medical imaging applications as these models are increasingly being used for diagnosis and treatment planning. In this paper, we study biases related to sex when developing a machine learning model based on brain magnetic resonance images (MRI). We investigate the effects of sex by performing brain age prediction considering different experimental designs: model trained using only female subjects, only male subjects and a balanced dataset. We also perform evaluation on multiple MRI datasets (Calgary-Campinas(CC359) and CamCAN) to assess the generalization capability of the proposed models. We found disparities in the performance of brain age prediction models when trained on distinct sex subgroups and datasets, in both final predictions and decision making (assessed using",
    "link": "http://arxiv.org/abs/2310.11577",
    "context": "Title: Studying the Effects of Sex-related Differences on Brain Age Prediction using brain MR Imaging. (arXiv:2310.11577v1 [eess.IV])\nAbstract: While utilizing machine learning models, one of the most crucial aspects is how bias and fairness affect model outcomes for diverse demographics. This becomes especially relevant in the context of machine learning for medical imaging applications as these models are increasingly being used for diagnosis and treatment planning. In this paper, we study biases related to sex when developing a machine learning model based on brain magnetic resonance images (MRI). We investigate the effects of sex by performing brain age prediction considering different experimental designs: model trained using only female subjects, only male subjects and a balanced dataset. We also perform evaluation on multiple MRI datasets (Calgary-Campinas(CC359) and CamCAN) to assess the generalization capability of the proposed models. We found disparities in the performance of brain age prediction models when trained on distinct sex subgroups and datasets, in both final predictions and decision making (assessed using",
    "path": "papers/23/10/2310.11577.json",
    "total_tokens": 942,
    "translated_title": "研究使用脑磁共振成像的性别差异对脑龄预测的影响",
    "translated_abstract": "在利用机器学习模型时，偏见和公平性如何影响不同人群的模型结果是至关重要的。在医学成像应用中，这变得尤为重要，因为这些模型越来越多地被用于诊断和治疗规划。本文中，我们研究了与性别相关的偏见，在基于脑磁共振成像（MRI）的机器学习模型开发过程中。我们通过考虑不同的实验设计来研究性别的影响：仅使用女性受试者、仅使用男性受试者和平衡数据集进行模型训练进行脑龄预测。我们还对多个MRI数据集（Calgary-Campinas和CamCAN）进行评估，以评估所提出模型的泛化能力。我们发现在使用不同性别亚组和数据集进行训练时，脑龄预测模型的性能差异，在最终预测和决策（使用评估）",
    "tldr": "本研究研究了基于脑磁共振成像的机器学习模型开发中，性别相关的偏见对脑龄预测的影响。通过考虑不同的实验设计和多个MRI数据集进行评估，发现在不同性别亚组和数据集上进行训练时，脑龄预测模型的性能存在差异。",
    "en_tdlr": "This study investigates the impact of sex-related biases on brain age prediction in machine learning models based on brain magnetic resonance imaging. By considering different experimental designs and evaluating multiple MRI datasets, disparities in performance were found when training on distinct sex subgroups and datasets."
}