{
    "title": "Dimensions of Disagreement: Unpacking Divergence and Misalignment in Cognitive Science and Artificial Intelligence. (arXiv:2310.12994v1 [q-bio.NC])",
    "abstract": "The increasing prevalence of artificial agents creates a correspondingly increasing need to manage disagreements between humans and artificial agents, as well as between artificial agents themselves. Considering this larger space of possible agents exposes an opportunity for furthering our understanding of the nature of disagreement: past studies in psychology have often cast disagreement as two agents forming diverging evaluations of the same object, but disagreement can also arise from differences in how agents represent that object. AI research on human-machine alignment and recent work in computational cognitive science have focused on this latter kind of disagreement, and have developed tools that can be used to quantify the extent of representational overlap between agents. Understanding how divergence and misalignment interact to produce disagreement, and how resolution strategies depend on this interaction, is key to promoting effective collaboration between diverse types of ag",
    "link": "http://arxiv.org/abs/2310.12994",
    "context": "Title: Dimensions of Disagreement: Unpacking Divergence and Misalignment in Cognitive Science and Artificial Intelligence. (arXiv:2310.12994v1 [q-bio.NC])\nAbstract: The increasing prevalence of artificial agents creates a correspondingly increasing need to manage disagreements between humans and artificial agents, as well as between artificial agents themselves. Considering this larger space of possible agents exposes an opportunity for furthering our understanding of the nature of disagreement: past studies in psychology have often cast disagreement as two agents forming diverging evaluations of the same object, but disagreement can also arise from differences in how agents represent that object. AI research on human-machine alignment and recent work in computational cognitive science have focused on this latter kind of disagreement, and have developed tools that can be used to quantify the extent of representational overlap between agents. Understanding how divergence and misalignment interact to produce disagreement, and how resolution strategies depend on this interaction, is key to promoting effective collaboration between diverse types of ag",
    "path": "papers/23/10/2310.12994.json",
    "total_tokens": 916,
    "translated_title": "不同维度的分歧：揭示认知科学与人工智能中的差异和不一致性",
    "translated_abstract": "人工智能代理的普及增加了管理人类和人工智能代理之间以及人工智能代理之间的分歧的需求。研究揭示了分歧的本质：过去的心理学研究常常将分歧解释为两个代理对同一对象形成不同的评估，但分歧也可以源于代理对对象的表示方式的差异。人工智能领域研究人员关注人机对齐和计算认知科学的最新研究已着重考虑后一种分歧，并开发出可以用来量化代理之间表示重叠程度的工具。了解分歧和不一致性如何相互作用产生分歧以及解决策略如何依赖于这种相互作用是促进不同类型代理之间有效协作的关键。",
    "tldr": "本文探讨了认知科学和人工智能中分歧的不同维度，指出分歧既可以来源于对象评估的差异，也可以源于对对象表示方式的不一致。研究者发展了用于量化表示重叠程度的工具，深入理解分歧和不一致性如何相互作用对于促进不同类型代理之间的有效协作至关重要。",
    "en_tdlr": "This paper explores the different dimensions of disagreement in cognitive science and artificial intelligence, highlighting that disagreement can stem from diverging evaluations of objects or differences in representation. Researchers have developed tools to quantify the level of representational overlap, emphasizing the importance of understanding how divergence and misalignment interact to promote effective collaboration between different types of agents."
}