{
    "title": "Towards Feasible Counterfactual Explanations: A Taxonomy Guided Template-based NLG Method. (arXiv:2310.02019v1 [cs.AI])",
    "abstract": "Counterfactual Explanations (cf-XAI) describe the smallest changes in feature values necessary to change an outcome from one class to another. However, many cf-XAI methods neglect the feasibility of those changes. In this paper, we introduce a novel approach for presenting cf-XAI in natural language (Natural-XAI), giving careful consideration to actionable and comprehensible aspects while remaining cognizant of immutability and ethical concerns. We present three contributions to this endeavor. Firstly, through a user study, we identify two types of themes present in cf-XAI composed by humans: content-related, focusing on how features and their values are included from both the counterfactual and the query perspectives; and structure-related, focusing on the structure and terminology used for describing necessary value changes. Secondly, we introduce a feature actionability taxonomy with four clearly defined categories, to streamline the explanation presentation process. Using insights ",
    "link": "http://arxiv.org/abs/2310.02019",
    "context": "Title: Towards Feasible Counterfactual Explanations: A Taxonomy Guided Template-based NLG Method. (arXiv:2310.02019v1 [cs.AI])\nAbstract: Counterfactual Explanations (cf-XAI) describe the smallest changes in feature values necessary to change an outcome from one class to another. However, many cf-XAI methods neglect the feasibility of those changes. In this paper, we introduce a novel approach for presenting cf-XAI in natural language (Natural-XAI), giving careful consideration to actionable and comprehensible aspects while remaining cognizant of immutability and ethical concerns. We present three contributions to this endeavor. Firstly, through a user study, we identify two types of themes present in cf-XAI composed by humans: content-related, focusing on how features and their values are included from both the counterfactual and the query perspectives; and structure-related, focusing on the structure and terminology used for describing necessary value changes. Secondly, we introduce a feature actionability taxonomy with four clearly defined categories, to streamline the explanation presentation process. Using insights ",
    "path": "papers/23/10/2310.02019.json",
    "total_tokens": 992,
    "translated_title": "朝着可行的反事实解释方法：一种基于分类学引导的模板化自然语言生成方法",
    "translated_abstract": "反事实解释 (cf-XAI) 描述了将结果从一个类别变为另一个类别所需的最小特征值变化。然而，许多 cf-XAI 方法忽视了这些变化的可行性。本文介绍了一种新颖的自然语言反事实解释方法 (Natural-XAI)，在解释过程中注重可操作性、可理解性，并兼顾不变性和伦理关切。我们在这个工作中提出了三个贡献。首先，通过用户研究，我们确定了人类所组成的 cf-XAI 中存在两种类型的主题：与内容相关的主题，关注如何从反事实和查询的角度包括特征及其值；与结构相关的主题，关注用于描述所需值变化的结构和术语。其次，我们引入了一个具有四个清晰定义的特征可行性分类学，以简化解释表达过程。通过对人类生成的 cf-XAI 进行分析，我们将特征的可行性划分为四个不同的类别：可直接操作、可间接操作、不可操作和未定义。这个分类学可以帮助解决 cf-XAI 方法中可行性的问题。",
    "tldr": "本文介绍了一种新颖的自然语言反事实解释方法 Natural-XAI，该方法注重可操作性、可理解性，并兼顾不变性和伦理关切。我们通过用户研究确定了人类生成的反事实解释中的主题，并引入了特征可行性分类学，以简化解释表达过程。"
}