{
    "title": "Identification and Estimation in a Class of Potential Outcomes Models. (arXiv:2310.05311v1 [econ.EM])",
    "abstract": "This paper develops a class of potential outcomes models characterized by three main features: (i) Unobserved heterogeneity can be represented by a vector of potential outcomes and a type describing the manner in which an instrument determines the choice of treatment; (ii) The availability of an instrumental variable that is conditionally independent of unobserved heterogeneity; and (iii) The imposition of convex restrictions on the distribution of unobserved heterogeneity. The proposed class of models encompasses multiple classical and novel research designs, yet possesses a common structure that permits a unifying analysis of identification and estimation. In particular, we establish that these models share a common necessary and sufficient condition for identifying certain causal parameters. Our identification results are constructive in that they yield estimating moment conditions for the parameters of interest. Focusing on a leading special case of our framework, we further show h",
    "link": "http://arxiv.org/abs/2310.05311",
    "context": "Title: Identification and Estimation in a Class of Potential Outcomes Models. (arXiv:2310.05311v1 [econ.EM])\nAbstract: This paper develops a class of potential outcomes models characterized by three main features: (i) Unobserved heterogeneity can be represented by a vector of potential outcomes and a type describing the manner in which an instrument determines the choice of treatment; (ii) The availability of an instrumental variable that is conditionally independent of unobserved heterogeneity; and (iii) The imposition of convex restrictions on the distribution of unobserved heterogeneity. The proposed class of models encompasses multiple classical and novel research designs, yet possesses a common structure that permits a unifying analysis of identification and estimation. In particular, we establish that these models share a common necessary and sufficient condition for identifying certain causal parameters. Our identification results are constructive in that they yield estimating moment conditions for the parameters of interest. Focusing on a leading special case of our framework, we further show h",
    "path": "papers/23/10/2310.05311.json",
    "total_tokens": 837,
    "translated_title": "一类潜在结果模型的识别与估计",
    "translated_abstract": "本文开发了一类潜在结果模型，其特点是：（i）未观测到的异质性可以由一组潜在结果向量和描述工具选择治疗方式的类型表示；（ii）条件独立于未观测到的异质性的工具变量的可用性；（iii）对未观测到的异质性的分布施加凸约束。所提出的模型类包括多个经典和新颖的研究设计，但具有共同的结构，可以进行统一的识别与估计分析。特别是，我们证明这些模型共享一种对于识别某些因果参数的必要和充分条件。我们的识别结果是具有建设性的，因为它们提供了有关感兴趣参数的估计矩条件。在我们框架的一个重要特例中，我们进一步展示了...",
    "tldr": "本文开发了一类潜在结果模型，提出了一种共同的结构，可以进行统一的识别与估计分析，构建了对于识别某些因果参数的必要和充分条件，并提供了这些参数的估计矩条件。"
}