{
    "title": "A Unified View on Neural Message Passing with Opinion Dynamics for Social Networks. (arXiv:2310.01272v2 [cs.SI] UPDATED)",
    "abstract": "Social networks represent a common form of interconnected data frequently depicted as graphs within the domain of deep learning-based inference. These communities inherently form dynamic systems, achieving stability through continuous internal communications and opinion exchanges among social actors along their social ties. In contrast, neural message passing in deep learning provides a clear and intuitive mathematical framework for understanding information propagation and aggregation among connected nodes in graphs. Node representations are dynamically updated by considering both the connectivity and status of neighboring nodes. This research harmonizes concepts from sociometry and neural message passing to analyze and infer the behavior of dynamic systems. Drawing inspiration from opinion dynamics in sociology, we propose ODNet, a novel message passing scheme incorporating bounded confidence, to refine the influence weight of local nodes for message propagation. We adjust the simila",
    "link": "http://arxiv.org/abs/2310.01272",
    "context": "Title: A Unified View on Neural Message Passing with Opinion Dynamics for Social Networks. (arXiv:2310.01272v2 [cs.SI] UPDATED)\nAbstract: Social networks represent a common form of interconnected data frequently depicted as graphs within the domain of deep learning-based inference. These communities inherently form dynamic systems, achieving stability through continuous internal communications and opinion exchanges among social actors along their social ties. In contrast, neural message passing in deep learning provides a clear and intuitive mathematical framework for understanding information propagation and aggregation among connected nodes in graphs. Node representations are dynamically updated by considering both the connectivity and status of neighboring nodes. This research harmonizes concepts from sociometry and neural message passing to analyze and infer the behavior of dynamic systems. Drawing inspiration from opinion dynamics in sociology, we propose ODNet, a novel message passing scheme incorporating bounded confidence, to refine the influence weight of local nodes for message propagation. We adjust the simila",
    "path": "papers/23/10/2310.01272.json",
    "total_tokens": 785,
    "translated_title": "通过意见动态中的神经消息传递对社交网络进行统一视图",
    "translated_abstract": "社交网络是深度学习推理领域中常见的相互连接数据形式，通常被描述为图形。这些社群在社交联系中通过不断的内部沟通和意见交流实现稳定性。而深度学习中的神经消息传递提供了一个清晰直观的数学框架，用于理解图中连接节点之间的信息传播与聚合。节点表示会根据邻居节点的连通性和状态进行动态更新。本研究将社会测量学和神经消息传递的概念结合起来，分析和推断动态系统的行为。受到社会学中意见动态的启发，我们提出了ODNet，一种新颖的消息传递方案，将有界信心融入到局部节点的影响权重以改进消息传播。",
    "tldr": "该论文通过将社会测量学和神经消息传递技术相结合，提出了一种新的消息传递方案ODNet，用于在社交网络中分析和推断动态系统的行为。"
}