{
    "title": "On the Relevance of Phoneme Duration Variability of Synthesized Training Data for Automatic Speech Recognition. (arXiv:2310.08132v1 [cs.CL])",
    "abstract": "Synthetic data generated by text-to-speech (TTS) systems can be used to improve automatic speech recognition (ASR) systems in low-resource or domain mismatch tasks. It has been shown that TTS-generated outputs still do not have the same qualities as real data. In this work we focus on the temporal structure of synthetic data and its relation to ASR training. By using a novel oracle setup we show how much the degradation of synthetic data quality is influenced by duration modeling in non-autoregressive (NAR) TTS. To get reference phoneme durations we use two common alignment methods, a hidden Markov Gaussian-mixture model (HMM-GMM) aligner and a neural connectionist temporal classification (CTC) aligner. Using a simple algorithm based on random walks we shift phoneme duration distributions of the TTS system closer to real durations, resulting in an improvement of an ASR system using synthetic data in a semi-supervised setting.",
    "link": "http://arxiv.org/abs/2310.08132",
    "context": "Title: On the Relevance of Phoneme Duration Variability of Synthesized Training Data for Automatic Speech Recognition. (arXiv:2310.08132v1 [cs.CL])\nAbstract: Synthetic data generated by text-to-speech (TTS) systems can be used to improve automatic speech recognition (ASR) systems in low-resource or domain mismatch tasks. It has been shown that TTS-generated outputs still do not have the same qualities as real data. In this work we focus on the temporal structure of synthetic data and its relation to ASR training. By using a novel oracle setup we show how much the degradation of synthetic data quality is influenced by duration modeling in non-autoregressive (NAR) TTS. To get reference phoneme durations we use two common alignment methods, a hidden Markov Gaussian-mixture model (HMM-GMM) aligner and a neural connectionist temporal classification (CTC) aligner. Using a simple algorithm based on random walks we shift phoneme duration distributions of the TTS system closer to real durations, resulting in an improvement of an ASR system using synthetic data in a semi-supervised setting.",
    "path": "papers/23/10/2310.08132.json",
    "total_tokens": 920,
    "translated_title": "对于自动生成的训练数据中音素持续时间变异性与自动语音识别相关性的研究",
    "translated_abstract": "通过使用文本转语音(TTS)系统生成的合成数据可以改善低资源或领域不匹配任务中的自动语音识别(ASR)系统。已经证明，TTS生成的输出仍然不具备与真实数据相同的质量。在本研究中，我们关注合成数据的时间结构及其与ASR训练的关系。通过使用一种新的oracle设置，我们展示了非自回归(NAR) TTS中持续时间建模对合成数据质量的退化程度的影响。我们使用两种常见的对齐方法，即隐马尔可夫高斯混合模型(HMM-GMM)对齐器和神经连结时序分类(CTC)对齐器，来获取参考音素持续时间。通过一个基于随机游走的简单算法，我们将TTS系统的音素持续时间分布移动到真实持续时间附近，从而改进了半监督设置下使用合成数据的ASR系统。",
    "tldr": "本研究探讨了自动生成的训练数据中音素持续时间变异性与自动语音识别的相关性，并提出了一种基于随机游走的算法来改善合成数据的质量，从而改进了半监督设置下的ASR系统。"
}