{
    "title": "Cousins Of The Vendi Score: A Family Of Similarity-Based Diversity Metrics For Science And Machine Learning. (arXiv:2310.12952v2 [cs.LG] UPDATED)",
    "abstract": "Measuring diversity accurately is important for many scientific fields, including machine learning (ML), ecology, and chemistry. The Vendi Score was introduced as a generic similarity-based diversity metric that extends the Hill number of order q=1 by leveraging ideas from quantum statistical mechanics. Contrary to many diversity metrics in ecology, the Vendi Score accounts for similarity and does not require knowledge of the prevalence of the categories in the collection to be evaluated for diversity. However, the Vendi Score treats each item in a given collection with a level of sensitivity proportional to the item's prevalence. This is undesirable in settings where there is a significant imbalance in item prevalence. In this paper, we extend the other Hill numbers using similarity to provide flexibility in allocating sensitivity to rare or common items. This leads to a family of diversity metrics -- Vendi scores with different levels of sensitivity -- that can be used in a variety o",
    "link": "http://arxiv.org/abs/2310.12952",
    "context": "Title: Cousins Of The Vendi Score: A Family Of Similarity-Based Diversity Metrics For Science And Machine Learning. (arXiv:2310.12952v2 [cs.LG] UPDATED)\nAbstract: Measuring diversity accurately is important for many scientific fields, including machine learning (ML), ecology, and chemistry. The Vendi Score was introduced as a generic similarity-based diversity metric that extends the Hill number of order q=1 by leveraging ideas from quantum statistical mechanics. Contrary to many diversity metrics in ecology, the Vendi Score accounts for similarity and does not require knowledge of the prevalence of the categories in the collection to be evaluated for diversity. However, the Vendi Score treats each item in a given collection with a level of sensitivity proportional to the item's prevalence. This is undesirable in settings where there is a significant imbalance in item prevalence. In this paper, we extend the other Hill numbers using similarity to provide flexibility in allocating sensitivity to rare or common items. This leads to a family of diversity metrics -- Vendi scores with different levels of sensitivity -- that can be used in a variety o",
    "path": "papers/23/10/2310.12952.json",
    "total_tokens": 885,
    "translated_title": "《科学和机器学习的Vendi分数的近亲：基于相似性的多样性度量族群》",
    "translated_abstract": "准确测量多样性对于许多科学领域至关重要，包括机器学习、生态学和化学。 Vendi分数是一种扩展了q=1阶Hill数的通用基于相似性的多样性度量方法，借鉴量子统计力学的思想。与生态学中的许多多样性度量方法不同，Vendi分数考虑了相似性，并且不需要了解集合中各个类别的普遍性来评估多样性。然而，Vendi分数对于给定集合中的每个项目都以与该项目的普遍性成比例的敏感度进行处理。这在项目普遍性存在显著不平衡的情况下是不可取的。在本文中，我们利用相似性扩展了其他Hill数，以提供对稀有或常见项目分配敏感度的灵活性。这导致了一族多样性度量方法——具有不同敏感度水平的Vendi分数，可应用于各种场景中。",
    "tldr": "该论文提出了一种基于相似性的多样性度量方法——Vendi分数族群，为科学和机器学习等领域准确测量多样性提供了灵活性。",
    "en_tdlr": "This paper proposes a family of similarity-based diversity metrics called Vendi scores, which provide flexibility in accurately measuring diversity in scientific fields such as machine learning."
}