{
    "title": "Facilitating Battery Swapping Services for Freight Trucks with Spatial-Temporal Demand Prediction. (arXiv:2310.04440v1 [eess.SY])",
    "abstract": "Electrifying heavy-duty trucks offers a substantial opportunity to curtail carbon emissions, advancing toward a carbon-neutral future. However, the inherent challenges of limited battery energy and the sheer weight of heavy-duty trucks lead to reduced mileage and prolonged charging durations. Consequently, battery-swapping services emerge as an attractive solution for these trucks. This paper employs a two-fold approach to investigate the potential and enhance the efficacy of such services. Firstly, spatial-temporal demand prediction models are adopted to predict the traffic patterns for the upcoming hours. Subsequently, the prediction guides an optimization module for efficient battery allocation and deployment. Analyzing the heavy-duty truck data on a highway network spanning over 2,500 miles, our model and analysis underscore the value of prediction/machine learning in facilitating future decision-makings. In particular, we find that the initial phase of implementing battery-swappin",
    "link": "http://arxiv.org/abs/2310.04440",
    "context": "Title: Facilitating Battery Swapping Services for Freight Trucks with Spatial-Temporal Demand Prediction. (arXiv:2310.04440v1 [eess.SY])\nAbstract: Electrifying heavy-duty trucks offers a substantial opportunity to curtail carbon emissions, advancing toward a carbon-neutral future. However, the inherent challenges of limited battery energy and the sheer weight of heavy-duty trucks lead to reduced mileage and prolonged charging durations. Consequently, battery-swapping services emerge as an attractive solution for these trucks. This paper employs a two-fold approach to investigate the potential and enhance the efficacy of such services. Firstly, spatial-temporal demand prediction models are adopted to predict the traffic patterns for the upcoming hours. Subsequently, the prediction guides an optimization module for efficient battery allocation and deployment. Analyzing the heavy-duty truck data on a highway network spanning over 2,500 miles, our model and analysis underscore the value of prediction/machine learning in facilitating future decision-makings. In particular, we find that the initial phase of implementing battery-swappin",
    "path": "papers/23/10/2310.04440.json",
    "total_tokens": 877,
    "translated_title": "为货运卡车提供电池更换服务的空间-时间需求预测",
    "translated_abstract": "电气化重型卡车为实现碳中和的未来提供了重要机遇，然而有限电池能量和重型卡车的重量使得续航里程减少和充电时间延长成为固有挑战。因此，电池更换服务成为这些卡车的一个吸引人的解决方案。本文采用双重方法，研究和提高此类服务的效果。首先，采用空间-时间需求预测模型预测接下来几个小时的交通模式。然后，该预测指导优化模块进行高效的电池分配和部署。通过分析2,500英里的公路网络上的重型卡车数据，我们的模型和分析凸显预测/机器学习在促进未来决策中的价值。特别是，我们发现实施电池更换的初期阶段是关键。",
    "tldr": "本研究采用空间-时间需求预测模型和优化模块，旨在研究和改进为货运卡车提供电池更换服务的效果。通过分析重型卡车数据，结果表明预测和机器学习在未来决策中具有重要价值。",
    "en_tdlr": "This study employs spatial-temporal demand prediction models and optimization modules to investigate and enhance the efficacy of battery swapping services for freight trucks. By analyzing truck data, the results highlight the value of prediction and machine learning in future decision-making."
}