{
    "title": "Instability of computer vision models is a necessary result of the task itself. (arXiv:2310.17559v1 [cs.CV])",
    "abstract": "Adversarial examples resulting from instability of current computer vision models are an extremely important topic due to their potential to compromise any application. In this paper we demonstrate that instability is inevitable due to a) symmetries (translational invariance) of the data, b) the categorical nature of the classification task, and c) the fundamental discrepancy of classifying images as objects themselves. The issue is further exacerbated by non-exhaustive labelling of the training data. Therefore we conclude that instability is a necessary result of how the problem of computer vision is currently formulated. While the problem cannot be eliminated, through the analysis of the causes, we have arrived at ways how it can be partially alleviated. These include i) increasing the resolution of images, ii) providing contextual information for the image, iii) exhaustive labelling of training data, and iv) preventing attackers from frequent access to the computer vision system.",
    "link": "http://arxiv.org/abs/2310.17559",
    "context": "Title: Instability of computer vision models is a necessary result of the task itself. (arXiv:2310.17559v1 [cs.CV])\nAbstract: Adversarial examples resulting from instability of current computer vision models are an extremely important topic due to their potential to compromise any application. In this paper we demonstrate that instability is inevitable due to a) symmetries (translational invariance) of the data, b) the categorical nature of the classification task, and c) the fundamental discrepancy of classifying images as objects themselves. The issue is further exacerbated by non-exhaustive labelling of the training data. Therefore we conclude that instability is a necessary result of how the problem of computer vision is currently formulated. While the problem cannot be eliminated, through the analysis of the causes, we have arrived at ways how it can be partially alleviated. These include i) increasing the resolution of images, ii) providing contextual information for the image, iii) exhaustive labelling of training data, and iv) preventing attackers from frequent access to the computer vision system.",
    "path": "papers/23/10/2310.17559.json",
    "total_tokens": 922,
    "translated_title": "计算机视觉模型的不稳定性是任务本身的必然结果",
    "translated_abstract": "由于当前计算机视觉模型的不稳定性而产生的对抗性样本是一个非常重要的话题，因为它们有可能危及任何应用。在本文中，我们证明了不稳定性是不可避免的，原因包括：a) 数据的对称性（平移不变性），b) 分类任务的范畴性质，以及c) 将图像分类为对象本身的基本差异。不完全标注的训练数据进一步加剧了这个问题。因此我们得出结论，不稳定性是当前计算机视觉问题表述方式所必然的结果。虽然问题无法完全消除，但通过分析原因，我们找到了一些方式来部分缓解该问题，包括：i) 提高图像的分辨率，ii) 为图像提供上下文信息，iii) 对训练数据进行全面标注，和iv) 防止攻击者频繁访问计算机视觉系统。",
    "tldr": "该论文研究了计算机视觉模型的不稳定性，并指出这是当前问题表述方式的必然结果。该问题无法完全消除，但可以通过提高图像分辨率、提供上下文信息、全面标注训练数据和防止攻击者访问计算机视觉系统来部分缓解该问题。"
}