{
    "title": "Separately Convex and Separately Continuous Preferences: On Results of Schmeidler, Shafer, and Bergstrom-Parks-Rader. (arXiv:2310.00531v1 [econ.TH])",
    "abstract": "We provide necessary and sufficient conditions for a correspondence taking values in a finite-dimensional Euclidean space to be open so as to revisit the pioneering work of Schmeidler (1969), Shafer (1974), Shafer-Sonnenschein (1975) and Bergstrom-Rader-Parks (1976) to answer several questions they and their followers left open. We introduce the notion of separate convexity for a correspondence and use it to relate to classical notions of continuity while giving salience to the notion of separateness as in the interplay of separate continuity and separate convexity of binary relations. As such, we provide a consolidation of the convexity-continuity postulates from a broad inter-disciplinary perspective and comment on how the qualified notions proposed here have implications of substantive interest for choice theory.",
    "link": "http://arxiv.org/abs/2310.00531",
    "context": "Title: Separately Convex and Separately Continuous Preferences: On Results of Schmeidler, Shafer, and Bergstrom-Parks-Rader. (arXiv:2310.00531v1 [econ.TH])\nAbstract: We provide necessary and sufficient conditions for a correspondence taking values in a finite-dimensional Euclidean space to be open so as to revisit the pioneering work of Schmeidler (1969), Shafer (1974), Shafer-Sonnenschein (1975) and Bergstrom-Rader-Parks (1976) to answer several questions they and their followers left open. We introduce the notion of separate convexity for a correspondence and use it to relate to classical notions of continuity while giving salience to the notion of separateness as in the interplay of separate continuity and separate convexity of binary relations. As such, we provide a consolidation of the convexity-continuity postulates from a broad inter-disciplinary perspective and comment on how the qualified notions proposed here have implications of substantive interest for choice theory.",
    "path": "papers/23/10/2310.00531.json",
    "total_tokens": 903,
    "translated_title": "分别凸性和分别连续性偏好：关于Schmeidler、Shafer和Bergstrom-Parks-Rader结果的研究",
    "translated_abstract": "我们提供了一个对于在有限维欧氏空间中取值的对应关系成为开关系的充分必要条件，以重新审视Schmeidler（1969）、Shafer（1974）、Shafer-Sonnenschein（1975）和Bergstrom-Rader-Parks（1976）的开创性工作，以回答他们和他们的追随者留下的一些未解之谜。我们引入了分别凸性的概念，并将其与经典的连续性概念联系起来，同时强调二元关系的分离连续性和分离凸性的相互作用。因此，我们从广泛的跨学科视角提供了一种凸性-连续性假设的合并，并讨论了在选择理论中有实质性兴趣的合格概念的影响。",
    "tldr": "本研究提出了一种对于在有限维欧氏空间中取值的对应关系成为开关系的充分必要条件，并通过引入分别凸性的概念，将其与经典的连续性概念联系起来，从而提供了一种凸性-连续性假设的合并，并对选择理论中的相关概念进行了讨论。",
    "en_tdlr": "This study provides necessary and sufficient conditions for a correspondence to be open in a finite-dimensional Euclidean space, and introduces the concept of separate convexity to relate to classical notions of continuity. It offers a consolidation of the convexity-continuity postulates and discusses the implications for choice theory."
}