{
    "title": "EX-FEVER: A Dataset for Multi-hop Explainable Fact Verification",
    "abstract": "arXiv:2310.09754v2 Announce Type: replace  Abstract: Fact verification aims to automatically probe the veracity of a claim based on several pieces of evidence. Existing works are always engaging in accuracy improvement, let alone explainability, a critical capability of fact verification systems. Constructing an explainable fact verification system in a complex multi-hop scenario is consistently impeded by the absence of a relevant, high-quality dataset. Previous datasets either suffer from excessive simplification or fail to incorporate essential considerations for explainability. To address this, we present EXFEVER, a pioneering dataset for multi-hop explainable fact verification. With over 60,000 claims involving 2-hop and 3-hop reasoning, each is created by summarizing and modifying information from hyperlinked Wikipedia documents. Each instance is accompanied by a veracity label and an explanation that outlines the reasoning path supporting the veracity classification. Additionall",
    "link": "https://arxiv.org/abs/2310.09754",
    "context": "Title: EX-FEVER: A Dataset for Multi-hop Explainable Fact Verification\nAbstract: arXiv:2310.09754v2 Announce Type: replace  Abstract: Fact verification aims to automatically probe the veracity of a claim based on several pieces of evidence. Existing works are always engaging in accuracy improvement, let alone explainability, a critical capability of fact verification systems. Constructing an explainable fact verification system in a complex multi-hop scenario is consistently impeded by the absence of a relevant, high-quality dataset. Previous datasets either suffer from excessive simplification or fail to incorporate essential considerations for explainability. To address this, we present EXFEVER, a pioneering dataset for multi-hop explainable fact verification. With over 60,000 claims involving 2-hop and 3-hop reasoning, each is created by summarizing and modifying information from hyperlinked Wikipedia documents. Each instance is accompanied by a veracity label and an explanation that outlines the reasoning path supporting the veracity classification. Additionall",
    "path": "papers/23/10/2310.09754.json",
    "total_tokens": 784,
    "translated_title": "EX-FEVER：用于多跳可解释事实验证的数据集",
    "translated_abstract": "事实验证旨在根据多个证据自动探究声明的真实性。现有工作始终致力于提高准确性，更不用说解释性了，这是事实验证系统的一个关键能力。构建一个能够在复杂的多跳场景中解释的事实验证系统一直受制于缺乏相关的高质量数据集。为了解决这个问题，我们提出了EX-FEVER，这是一个用于多跳可解释事实验证的开创性数据集。超过6万个声明涉及2跳和3跳推理，每个声明都是通过总结和修改来自维基百科超链接文档的信息而创建的。每个实例都附带一个真实性标签和一个说明，概述支持真实性分类的推理路径。",
    "tldr": "提出了用于多跳可解释事实验证的开创性数据集EX-FEVER，包含超过6万个声明，每个声明都经过2跳和3跳推理，具有详细的解释路径。",
    "en_tdlr": "Introduced the groundbreaking dataset EX-FEVER for multi-hop explainable fact verification, consisting of over 60,000 claims with 2-hop and 3-hop reasoning, each accompanied by a detailed explanation path supporting the veracity classification."
}