{
    "title": "Integration-free Training for Spatio-temporal Multimodal Covariate Deep Kernel Point Processes. (arXiv:2310.05485v1 [cs.LG])",
    "abstract": "In this study, we propose a novel deep spatio-temporal point process model, Deep Kernel Mixture Point Processes (DKMPP), that incorporates multimodal covariate information. DKMPP is an enhanced version of Deep Mixture Point Processes (DMPP), which uses a more flexible deep kernel to model complex relationships between events and covariate data, improving the model's expressiveness. To address the intractable training procedure of DKMPP due to the non-integrable deep kernel, we utilize an integration-free method based on score matching, and further improve efficiency by adopting a scalable denoising score matching method. Our experiments demonstrate that DKMPP and its corresponding score-based estimators outperform baseline models, showcasing the advantages of incorporating covariate information, utilizing a deep kernel, and employing score-based estimators.",
    "link": "http://arxiv.org/abs/2310.05485",
    "context": "Title: Integration-free Training for Spatio-temporal Multimodal Covariate Deep Kernel Point Processes. (arXiv:2310.05485v1 [cs.LG])\nAbstract: In this study, we propose a novel deep spatio-temporal point process model, Deep Kernel Mixture Point Processes (DKMPP), that incorporates multimodal covariate information. DKMPP is an enhanced version of Deep Mixture Point Processes (DMPP), which uses a more flexible deep kernel to model complex relationships between events and covariate data, improving the model's expressiveness. To address the intractable training procedure of DKMPP due to the non-integrable deep kernel, we utilize an integration-free method based on score matching, and further improve efficiency by adopting a scalable denoising score matching method. Our experiments demonstrate that DKMPP and its corresponding score-based estimators outperform baseline models, showcasing the advantages of incorporating covariate information, utilizing a deep kernel, and employing score-based estimators.",
    "path": "papers/23/10/2310.05485.json",
    "total_tokens": 854,
    "translated_title": "无积分训练的时空多模态协变深度内核点过程",
    "translated_abstract": "在本研究中，我们提出了一种新颖的深度时空点过程模型，Deep Kernel Mixture Point Processes (DKMPP)，它融合了多模态协变信息。DKMPP是Deep Mixture Point Processes (DMPP)的改进版本，使用更灵活的深度内核建模事件和协变数据之间的复杂关系，提高了模型的表达能力。为了解决DKMPP的非可积深度内核造成的训练困难，我们采用了基于分数匹配的无积分方法，并进一步通过采用可扩展的去噪分数匹配方法提高了效率。我们的实验结果表明，DKMPP及其相应的基于分数的估计器优于基线模型，展示了融合协变信息、利用深度内核和采用基于分数的估计器的优势。",
    "tldr": "本研究提出了一种无积分训练的时空多模态协变深度内核点过程模型，利用分数匹配方法和去噪分数匹配方法解决了训练困难，实验结果表明该模型优于基线模型。",
    "en_tdlr": "This study proposes an integration-free training method for spatio-temporal multimodal covariate deep kernel point processes, which improves the model's expressiveness by using a flexible deep kernel. Experimental results show that the proposed model outperforms baseline models."
}