{
    "title": "Discrete Choice Multi-Armed Bandits. (arXiv:2310.00562v1 [stat.ML])",
    "abstract": "This paper establishes a connection between a category of discrete choice models and the realms of online learning and multiarmed bandit algorithms. Our contributions can be summarized in two key aspects. Firstly, we furnish sublinear regret bounds for a comprehensive family of algorithms, encompassing the Exp3 algorithm as a particular case. Secondly, we introduce a novel family of adversarial multiarmed bandit algorithms, drawing inspiration from the generalized nested logit models initially introduced by \\citet{wen:2001}. These algorithms offer users the flexibility to fine-tune the model extensively, as they can be implemented efficiently due to their closed-form sampling distribution probabilities. To demonstrate the practical implementation of our algorithms, we present numerical experiments, focusing on the stochastic bandit case.",
    "link": "http://arxiv.org/abs/2310.00562",
    "context": "Title: Discrete Choice Multi-Armed Bandits. (arXiv:2310.00562v1 [stat.ML])\nAbstract: This paper establishes a connection between a category of discrete choice models and the realms of online learning and multiarmed bandit algorithms. Our contributions can be summarized in two key aspects. Firstly, we furnish sublinear regret bounds for a comprehensive family of algorithms, encompassing the Exp3 algorithm as a particular case. Secondly, we introduce a novel family of adversarial multiarmed bandit algorithms, drawing inspiration from the generalized nested logit models initially introduced by \\citet{wen:2001}. These algorithms offer users the flexibility to fine-tune the model extensively, as they can be implemented efficiently due to their closed-form sampling distribution probabilities. To demonstrate the practical implementation of our algorithms, we present numerical experiments, focusing on the stochastic bandit case.",
    "path": "papers/23/10/2310.00562.json",
    "total_tokens": 785,
    "translated_title": "离散选择的多臂赌博机",
    "translated_abstract": "本文建立了离散选择模型与在线学习和多臂赌博算法领域的联系。我们的贡献可以总结为两个关键方面。首先，我们给出了一系列算法的次线性遗憾界限，其中包括了Exp3算法作为一个特例。其次，我们引入了一种新颖的对抗性多臂赌博算法家族，受到wen等人引入的广义嵌套对数模型的启发。这些算法通过闭式采样分布概率，为用户提供了广泛调整模型的灵活性，并能够高效地实现。为了展示我们算法的实际应用，我们进行了数值实验，重点关注随机赌博机情况。",
    "tldr": "本文在离散选择模型和在线学习和多臂赌博算法之间建立了联系，提出了具有次线性遗憾界限的算法，并引入了一种灵活调整模型的新颖对抗性多臂赌博算法家族。"
}