{
    "title": "Rethinking Semi-Supervised Imbalanced Node Classification from Bias-Variance Decomposition",
    "abstract": "This paper introduces a new approach to address the issue of class imbalance in graph neural networks (GNNs) for learning on graph-structured data. Our approach integrates imbalanced node classification and Bias-Variance Decomposition, establishing a theoretical framework that closely relates data imbalance to model variance. We also leverage graph augmentation technique to estimate the variance, and design a regularization term to alleviate the impact of imbalance. Exhaustive tests are conducted on multiple benchmarks, including naturally imbalanced datasets and public-split class-imbalanced datasets, demonstrating that our approach outperforms state-of-the-art methods in various imbalanced scenarios. This work provides a novel theoretical perspective for addressing the problem of imbalanced node classification in GNNs.",
    "link": "https://arxiv.org/abs/2310.18765",
    "context": "Title: Rethinking Semi-Supervised Imbalanced Node Classification from Bias-Variance Decomposition\nAbstract: This paper introduces a new approach to address the issue of class imbalance in graph neural networks (GNNs) for learning on graph-structured data. Our approach integrates imbalanced node classification and Bias-Variance Decomposition, establishing a theoretical framework that closely relates data imbalance to model variance. We also leverage graph augmentation technique to estimate the variance, and design a regularization term to alleviate the impact of imbalance. Exhaustive tests are conducted on multiple benchmarks, including naturally imbalanced datasets and public-split class-imbalanced datasets, demonstrating that our approach outperforms state-of-the-art methods in various imbalanced scenarios. This work provides a novel theoretical perspective for addressing the problem of imbalanced node classification in GNNs.",
    "path": "papers/23/10/2310.18765.json",
    "total_tokens": 900,
    "translated_title": "重新思考基于偏差-方差分解的半监督不平衡节点分类问题",
    "translated_abstract": "本文介绍了一种新的方法来解决图神经网络（GNN）中的类别不平衡问题。我们的方法将不平衡节点分类和偏差-方差分解相结合，建立了一个将数据不平衡与模型方差密切相关的理论框架。我们还利用图扩充技术来估计方差，并设计了一个正则项来减轻不平衡的影响。我们在多个基准数据集上进行了详尽的测试，包括自然不平衡的数据集和公开划分的类别不平衡数据集，结果表明我们的方法在各种不平衡场景中优于现有最先进的方法。该工作为解决GNN中的不平衡节点分类问题提供了一种新颖的理论视角。",
    "tldr": "本文提出了一种新的方法来解决图神经网络中的类别不平衡问题。该方法将不平衡节点分类和偏差-方差分解相结合，利用图扩充技术估计方差，并通过正则项减轻不平衡的影响。在多个基准数据集上进行的测试结果表明，该方法在各种不平衡场景中优于现有最先进的方法，并为解决GNN中的不平衡节点分类问题提供了一种新颖的理论视角。"
}