{
    "title": "Robust Transfer Learning with Unreliable Source Data. (arXiv:2310.04606v1 [stat.ML])",
    "abstract": "This paper addresses challenges in robust transfer learning stemming from ambiguity in Bayes classifiers and weak transferable signals between the target and source distribution. We introduce a novel quantity called the ''ambiguity level'' that measures the discrepancy between the target and source regression functions, propose a simple transfer learning procedure, and establish a general theorem that shows how this new quantity is related to the transferability of learning in terms of risk improvements. Our proposed ''Transfer Around Boundary'' (TAB) model, with a threshold balancing the performance of target and source data, is shown to be both efficient and robust, improving classification while avoiding negative transfer. Moreover, we demonstrate the effectiveness of the TAB model on non-parametric classification and logistic regression tasks, achieving upper bounds which are optimal up to logarithmic factors. Simulation studies lend further support to the effectiveness of TAB. We ",
    "link": "http://arxiv.org/abs/2310.04606",
    "context": "Title: Robust Transfer Learning with Unreliable Source Data. (arXiv:2310.04606v1 [stat.ML])\nAbstract: This paper addresses challenges in robust transfer learning stemming from ambiguity in Bayes classifiers and weak transferable signals between the target and source distribution. We introduce a novel quantity called the ''ambiguity level'' that measures the discrepancy between the target and source regression functions, propose a simple transfer learning procedure, and establish a general theorem that shows how this new quantity is related to the transferability of learning in terms of risk improvements. Our proposed ''Transfer Around Boundary'' (TAB) model, with a threshold balancing the performance of target and source data, is shown to be both efficient and robust, improving classification while avoiding negative transfer. Moreover, we demonstrate the effectiveness of the TAB model on non-parametric classification and logistic regression tasks, achieving upper bounds which are optimal up to logarithmic factors. Simulation studies lend further support to the effectiveness of TAB. We ",
    "path": "papers/23/10/2310.04606.json",
    "total_tokens": 907,
    "translated_title": "具有不可靠源数据的鲁棒性迁移学习",
    "translated_abstract": "本文针对鲁棒性迁移学习中的贝叶斯分类器的模糊性和目标与源分布之间的弱可转移信号所带来的挑战进行了研究。我们引入了一种新的量，称为“模糊度水平”，用于衡量目标与源回归函数之间的差异，并提出了一种简单的迁移学习方法，并建立了一个一般定理，说明了这个新量与学习的迁移性在风险改善方面的关系。我们提出的“边界周围转移”(Transfer Around Boundary, TAB)模型通过在目标数据和源数据性能之间进行平衡的阈值，既高效又鲁棒，能够改善分类并避免负迁移。此外，我们还展示了TAB模型在非参数分类和逻辑回归任务上的有效性，达到了最优的上界，只有对数因子的差距。通过仿真研究进一步支持了TAB的有效性。",
    "tldr": "本文提出了一个新的鲁棒性迁移学习方法TAB模型，通过衡量目标与源回归函数之间的模糊度水平来改善分类任务，并避免负迁移。通过实验验证，TAB模型在非参数分类和逻辑回归任务上表现出了优越的性能。",
    "en_tdlr": "This paper proposes a novel robust transfer learning method called TAB model, which improves classification tasks by measuring the ambiguity level between target and source regression functions and avoiding negative transfer. Experimental results show that TAB model achieves superior performance in non-parametric classification and logistic regression tasks."
}