{
    "title": "Adaptive Uncertainty Estimation via High-Dimensional Testing on Latent Representations. (arXiv:2310.16587v1 [cs.LG])",
    "abstract": "Uncertainty estimation aims to evaluate the confidence of a trained deep neural network. However, existing uncertainty estimation approaches rely on low-dimensional distributional assumptions and thus suffer from the high dimensionality of latent features. Existing approaches tend to focus on uncertainty on discrete classification probabilities, which leads to poor generalizability to uncertainty estimation for other tasks. Moreover, most of the literature requires seeing the out-of-distribution (OOD) data in the training for better estimation of uncertainty, which limits the uncertainty estimation performance in practice because the OOD data are typically unseen. To overcome these limitations, we propose a new framework using data-adaptive high-dimensional hypothesis testing for uncertainty estimation, which leverages the statistical properties of the feature representations. Our method directly operates on latent representations and thus does not require retraining the feature encode",
    "link": "http://arxiv.org/abs/2310.16587",
    "context": "Title: Adaptive Uncertainty Estimation via High-Dimensional Testing on Latent Representations. (arXiv:2310.16587v1 [cs.LG])\nAbstract: Uncertainty estimation aims to evaluate the confidence of a trained deep neural network. However, existing uncertainty estimation approaches rely on low-dimensional distributional assumptions and thus suffer from the high dimensionality of latent features. Existing approaches tend to focus on uncertainty on discrete classification probabilities, which leads to poor generalizability to uncertainty estimation for other tasks. Moreover, most of the literature requires seeing the out-of-distribution (OOD) data in the training for better estimation of uncertainty, which limits the uncertainty estimation performance in practice because the OOD data are typically unseen. To overcome these limitations, we propose a new framework using data-adaptive high-dimensional hypothesis testing for uncertainty estimation, which leverages the statistical properties of the feature representations. Our method directly operates on latent representations and thus does not require retraining the feature encode",
    "path": "papers/23/10/2310.16587.json",
    "total_tokens": 916,
    "translated_title": "自适应高维检验在潜在表示中的不确定性估计",
    "translated_abstract": "不确定性估计旨在评估训练深度神经网络的置信度。然而，现有的不确定性估计方法依赖于低维分布假设，因此受到潜在特征的高维问题的限制。现有方法往往关注于离散分类概率的不确定性，这导致对于其他任务的不确定性估计的泛化能力较差。此外，大部分文献要求在训练时要看到外域（OOD）数据以更好地估计不确定性，这限制了实际中不确定性估计的性能，因为外域数据通常是未见过的。为了克服这些限制，我们提出了一个新的框架，利用数据自适应的高维假设测试来进行不确定性估计，这利用了特征表示的统计特性。我们的方法直接在潜在表示上操作，因此不需要重新训练特征编码器。",
    "tldr": "本论文提出了一种新的框架，通过利用特征表示的统计特性，在潜在表示中使用数据自适应的高维假设检验来进行不确定性估计。这种方法克服了现有不确定性估计方法对低维分布假设的依赖和数据域限制的问题，为不确定性估计提供了更好的泛化能力和性能。",
    "en_tdlr": "This paper proposes a new framework for uncertainty estimation by utilizing data-adaptive high-dimensional hypothesis testing on latent representations. The method overcomes the limitations of existing approaches that rely on low-dimensional assumptions and are limited by the availability of out-of-distribution data, providing improved generalizability and performance in uncertainty estimation."
}