{
    "title": "Exploiting Unfair Advantages: Investigating Opportunistic Trading in the NFT Market. (arXiv:2310.06844v1 [q-fin.TR])",
    "abstract": "As cryptocurrency evolved, new financial instruments, such as lending and borrowing protocols, currency exchanges, fungible and non-fungible tokens (NFT), staking and mining protocols have emerged. A financial ecosystem built on top of a blockchain is supposed to be fair and transparent for each participating actor. Yet, there are sophisticated actors who turn their domain knowledge and market inefficiencies to their strategic advantage; thus extracting value from trades not accessible to others. This situation is further exacerbated by the fact that blockchain-based markets and decentralized finance (DeFi) instruments are mostly unregulated. Though a large body of work has already studied the unfairness of different aspects of DeFi and cryptocurrency trading, the economic intricacies of non-fungible token (NFT) trades necessitate further analysis and academic scrutiny.  The trading volume of NFTs has skyrocketed in recent years. A single NFT trade worth over a million US dollars, or m",
    "link": "http://arxiv.org/abs/2310.06844",
    "context": "Title: Exploiting Unfair Advantages: Investigating Opportunistic Trading in the NFT Market. (arXiv:2310.06844v1 [q-fin.TR])\nAbstract: As cryptocurrency evolved, new financial instruments, such as lending and borrowing protocols, currency exchanges, fungible and non-fungible tokens (NFT), staking and mining protocols have emerged. A financial ecosystem built on top of a blockchain is supposed to be fair and transparent for each participating actor. Yet, there are sophisticated actors who turn their domain knowledge and market inefficiencies to their strategic advantage; thus extracting value from trades not accessible to others. This situation is further exacerbated by the fact that blockchain-based markets and decentralized finance (DeFi) instruments are mostly unregulated. Though a large body of work has already studied the unfairness of different aspects of DeFi and cryptocurrency trading, the economic intricacies of non-fungible token (NFT) trades necessitate further analysis and academic scrutiny.  The trading volume of NFTs has skyrocketed in recent years. A single NFT trade worth over a million US dollars, or m",
    "path": "papers/23/10/2310.06844.json",
    "total_tokens": 893,
    "translated_title": "利用不公平优势: 对NFT市场中的机会主义交易进行调查",
    "translated_abstract": "随着加密货币的发展，出现了新的金融工具，如借贷协议、货币交易所、可互换和不可互换的代币（NFT）、质押和挖矿协议。建立在区块链上的金融生态系统应该对每个参与者公平和透明。然而，有些复杂的参与者利用自己的领域知识和市场的低效性，从中抽取其他人无法获取的交易价值。这种情况进一步加剧了基于区块链的市场和去中心化金融（DeFi）工具的无监管性。尽管已经有大量研究关于DeFi和加密货币交易不公平性的论文，但对于非互换代币（NFT）交易的经济复杂性需要进一步分析和学术审视。近年来，NFT的交易量飞速增长。一次单个NFT的交易价值超过百万美元。",
    "tldr": "本论文调查了NFT市场中的机会主义交易，并揭示了利用不公平优势从中获利的问题。该研究对于进一步理解NFT交易的经济特性具有重要意义。",
    "en_tdlr": "This paper investigates opportunistic trading in the NFT market and reveals the issue of extracting value by exploiting unfair advantages. The study is significant for further understanding the economic characteristics of NFT trading."
}