{
    "title": "3D Reconstruction in Noisy Agricultural Environments: A Bayesian Optimization Perspective for View Planning. (arXiv:2310.00145v1 [cs.RO])",
    "abstract": "3D reconstruction is a fundamental task in robotics that gained attention due to its major impact in a wide variety of practical settings, including agriculture, underwater, and urban environments. An important approach for this task, known as view planning, is to judiciously place a number of cameras in positions that maximize the visual information improving the resulting 3D reconstruction. Circumventing the need for a large number of arbitrary images, geometric criteria can be applied to select fewer yet more informative images to markedly improve the 3D reconstruction performance. Nonetheless, incorporating the noise of the environment that exists in various real-world scenarios into these criteria may be challenging, particularly when prior information about the noise is not provided. To that end, this work advocates a novel geometric function that accounts for the existing noise, relying solely on a relatively small number of noise realizations without requiring its closed-form e",
    "link": "http://arxiv.org/abs/2310.00145",
    "context": "Title: 3D Reconstruction in Noisy Agricultural Environments: A Bayesian Optimization Perspective for View Planning. (arXiv:2310.00145v1 [cs.RO])\nAbstract: 3D reconstruction is a fundamental task in robotics that gained attention due to its major impact in a wide variety of practical settings, including agriculture, underwater, and urban environments. An important approach for this task, known as view planning, is to judiciously place a number of cameras in positions that maximize the visual information improving the resulting 3D reconstruction. Circumventing the need for a large number of arbitrary images, geometric criteria can be applied to select fewer yet more informative images to markedly improve the 3D reconstruction performance. Nonetheless, incorporating the noise of the environment that exists in various real-world scenarios into these criteria may be challenging, particularly when prior information about the noise is not provided. To that end, this work advocates a novel geometric function that accounts for the existing noise, relying solely on a relatively small number of noise realizations without requiring its closed-form e",
    "path": "papers/23/10/2310.00145.json",
    "total_tokens": 868,
    "translated_title": "在嘈杂的农业环境中的3D重建：基于贝叶斯优化视角的观测规划",
    "translated_abstract": "3D重建是机器人技术中一项基础任务，因其在农业、水下和城市环境等实际场景中产生了重大影响而受到关注。其中一种重要的方法是通过合理安放相机来最大化视觉信息，提高3D重建结果，称为观测规划。通过将几何标准应用于选择较少但更有信息量的图像，可以避免需要大量的任意图像，从而显著提高3D重建性能。然而，在各种真实场景中考虑到存在的噪声可能是具有挑战性的，特别是当没有提供有关噪声的先验信息时。为此，本研究提出了一种新的几何函数，考虑到现有的噪声，仅依靠相对较少的噪声实现来计算，而不需要其封闭形式。",
    "tldr": "本论文提出了一种在噪声环境中进行3D重建的新方法，通过观测规划，合理选择相机位置并考虑噪声对重建性能的影响，提高了3D重建结果的质量和效率。",
    "en_tdlr": "This paper proposes a new method for 3D reconstruction in noisy environments, which improves the quality and efficiency of the reconstruction results by considering the impact of noise through view planning and judicious camera placement."
}