{
    "title": "GENER: A Parallel Layer Deep Learning Network To Detect Gene-Gene Interactions From Gene Expression Data. (arXiv:2310.03611v1 [cs.LG])",
    "abstract": "Detecting and discovering new gene interactions based on known gene expressions and gene interaction data presents a significant challenge. Various statistical and deep learning methods have attempted to tackle this challenge by leveraging the topological structure of gene interactions and gene expression patterns to predict novel gene interactions. In contrast, some approaches have focused exclusively on utilizing gene expression profiles. In this context, we introduce GENER, a parallel-layer deep learning network designed exclusively for the identification of gene-gene relationships using gene expression data. We conducted two training experiments and compared the performance of our network with that of existing statistical and deep learning approaches. Notably, our model achieved an average AUROC score of 0.834 on the combined BioGRID&DREAM5 dataset, outperforming competing methods in predicting gene-gene interactions.",
    "link": "http://arxiv.org/abs/2310.03611",
    "context": "Title: GENER: A Parallel Layer Deep Learning Network To Detect Gene-Gene Interactions From Gene Expression Data. (arXiv:2310.03611v1 [cs.LG])\nAbstract: Detecting and discovering new gene interactions based on known gene expressions and gene interaction data presents a significant challenge. Various statistical and deep learning methods have attempted to tackle this challenge by leveraging the topological structure of gene interactions and gene expression patterns to predict novel gene interactions. In contrast, some approaches have focused exclusively on utilizing gene expression profiles. In this context, we introduce GENER, a parallel-layer deep learning network designed exclusively for the identification of gene-gene relationships using gene expression data. We conducted two training experiments and compared the performance of our network with that of existing statistical and deep learning approaches. Notably, our model achieved an average AUROC score of 0.834 on the combined BioGRID&DREAM5 dataset, outperforming competing methods in predicting gene-gene interactions.",
    "path": "papers/23/10/2310.03611.json",
    "total_tokens": 848,
    "translated_title": "GENER:一种并行层深度学习网络用于从基因表达数据中检测基因-基因相互作用",
    "translated_abstract": "基于已知基因表达和基因相互作用数据来检测和发现新的基因相互作用是一个重大挑战。各种统计和深度学习方法已经尝试通过利用基因相互作用的拓扑结构和基因表达模式来预测新的基因相互作用。相反，一些方法专注于利用基因表达数据。在这个背景下，我们介绍了GENER，这是一个并行层深度学习网络，专门用于使用基因表达数据来识别基因-基因关系。我们进行了两个训练实验，并将我们的网络的性能与现有的统计和深度学习方法进行了比较。值得注意的是，我们的模型在结合了BioGRID&DREAM5数据集上实现了0.834的平均AUROC分数，优于其他方法在预测基因-基因相互作用方面的表现。",
    "tldr": "GENER是一个并行层深度学习网络，专门用于从基因表达数据中检测基因-基因相互作用。实验证实GENER在预测基因-基因相互作用方面的性能优于其他统计和深度学习方法。"
}