{
    "title": "Deep Geometric Learning with Monotonicity Constraints for Alzheimer's Disease Progression. (arXiv:2310.03353v1 [cs.AI])",
    "abstract": "Alzheimer's disease (AD) is a devastating neurodegenerative condition that precedes progressive and irreversible dementia; thus, predicting its progression over time is vital for clinical diagnosis and treatment. Numerous studies have implemented structural magnetic resonance imaging (MRI) to model AD progression, focusing on three integral aspects: (i) temporal variability, (ii) incomplete observations, and (iii) temporal geometric characteristics. However, deep learning-based approaches regarding data variability and sparsity have yet to consider inherent geometrical properties sufficiently. The ordinary differential equation-based geometric modeling method (ODE-RGRU) has recently emerged as a promising strategy for modeling time-series data by intertwining a recurrent neural network and an ODE in Riemannian space. Despite its achievements, ODE-RGRU encounters limitations when extrapolating positive definite symmetric metrics from incomplete samples, leading to feature reverse occurr",
    "link": "http://arxiv.org/abs/2310.03353",
    "context": "Title: Deep Geometric Learning with Monotonicity Constraints for Alzheimer's Disease Progression. (arXiv:2310.03353v1 [cs.AI])\nAbstract: Alzheimer's disease (AD) is a devastating neurodegenerative condition that precedes progressive and irreversible dementia; thus, predicting its progression over time is vital for clinical diagnosis and treatment. Numerous studies have implemented structural magnetic resonance imaging (MRI) to model AD progression, focusing on three integral aspects: (i) temporal variability, (ii) incomplete observations, and (iii) temporal geometric characteristics. However, deep learning-based approaches regarding data variability and sparsity have yet to consider inherent geometrical properties sufficiently. The ordinary differential equation-based geometric modeling method (ODE-RGRU) has recently emerged as a promising strategy for modeling time-series data by intertwining a recurrent neural network and an ODE in Riemannian space. Despite its achievements, ODE-RGRU encounters limitations when extrapolating positive definite symmetric metrics from incomplete samples, leading to feature reverse occurr",
    "path": "papers/23/10/2310.03353.json",
    "total_tokens": 1051,
    "translated_title": "采用单调性约束的深度几何学习在阿尔茨海默病进展中的应用",
    "translated_abstract": "阿尔茨海默病（AD）是一种毁灭性的神经退行性疾病，其在渐进和不可逆的痴呆前出现；因此，对其随时间的进展进行预测对于临床诊断和治疗至关重要。许多研究已经采用结构性磁共振成像（MRI）来模拟AD的进展，重点关注三个关键方面：（i）时间变异性，（ii）不完整观测，和（iii）时间几何特征。然而，关于数据变异性和稀疏性的深度学习方法尚未充分考虑其固有的几何特性。基于普通微分方程的几何建模方法（ODE-RGRU）最近作为一种有前途的策略在黎曼空间中通过将递归神经网络和ODE交织在一起来建模时间序列数据。尽管取得了一定成就，但ODE-RGRU在从不完整样本中外推正定对称度量时面临着一些限制，导致特征反转的发生。",
    "tldr": "本文提出了一种采用单调性约束的深度几何学习方法来预测阿尔茨海默病（AD）的进展。这种方法通过结合递归神经网络和普通微分方程在黎曼空间中建模时间序列数据，弥补了现有方法对数据几何属性考虑不足的问题，并解决了从不完整样本中外推正定对称度量的限制。这项工作在临床诊断和治疗中具有重要的应用价值。",
    "en_tdlr": "This paper proposes a deep geometric learning method with monotonicity constraints to predict Alzheimer's disease (AD) progression. By integrating a recurrent neural network and an ordinary differential equation in Riemannian space, this method addresses the limitation of existing methods in considering the geometric properties of data and extrapolating positive definite symmetric metrics from incomplete samples. It has important applications in clinical diagnosis and treatment."
}