{
    "title": "Probing the Creativity of Large Language Models: Can models produce divergent semantic association?. (arXiv:2310.11158v1 [cs.CL])",
    "abstract": "Large language models possess remarkable capacity for processing language, but it remains unclear whether these models can further generate creative content. The present study aims to investigate the creative thinking of large language models through a cognitive perspective. We utilize the divergent association task (DAT), an objective measurement of creativity that asks models to generate unrelated words and calculates the semantic distance between them. We compare the results across different models and decoding strategies. Our findings indicate that: (1) When using the greedy search strategy, GPT-4 outperforms 96% of humans, while GPT-3.5-turbo exceeds the average human level. (2) Stochastic sampling and temperature scaling are effective to obtain higher DAT scores for models except GPT-4, but face a trade-off between creativity and stability. These results imply that advanced large language models have divergent semantic associations, which is a fundamental process underlying creat",
    "link": "http://arxiv.org/abs/2310.11158",
    "context": "Title: Probing the Creativity of Large Language Models: Can models produce divergent semantic association?. (arXiv:2310.11158v1 [cs.CL])\nAbstract: Large language models possess remarkable capacity for processing language, but it remains unclear whether these models can further generate creative content. The present study aims to investigate the creative thinking of large language models through a cognitive perspective. We utilize the divergent association task (DAT), an objective measurement of creativity that asks models to generate unrelated words and calculates the semantic distance between them. We compare the results across different models and decoding strategies. Our findings indicate that: (1) When using the greedy search strategy, GPT-4 outperforms 96% of humans, while GPT-3.5-turbo exceeds the average human level. (2) Stochastic sampling and temperature scaling are effective to obtain higher DAT scores for models except GPT-4, but face a trade-off between creativity and stability. These results imply that advanced large language models have divergent semantic associations, which is a fundamental process underlying creat",
    "path": "papers/23/10/2310.11158.json",
    "total_tokens": 892,
    "translated_title": "探索大型语言模型的创造力：模型能否产生不同的语义关联？",
    "translated_abstract": "大型语言模型在处理语言方面具有出色的能力，但这些模型是否能进一步生成创造性的内容仍不清楚。本研究旨在从认知角度研究大型语言模型的创造思维能力。我们利用分散联想任务（DAT），这是一种客观衡量创造力的方法，要求模型生成不相关的单词，并计算它们之间的语义距离。我们比较了不同模型和解码策略的结果。我们的研究发现：（1）在使用贪婪搜索策略时，GPT-4超过了96％的人类，而GPT-3.5-turbo超过了平均水平；（2）对于模型而言，随机抽样和温度调节是获得更高DAT分数的有效方法，但在创造力和稳定性之间存在权衡。这些结果表明，先进的大型语言模型具有不同的语义关联，这是创造力的基本过程。",
    "tldr": "本研究使用分散联想任务探索大型语言模型的创造性思维能力。研究发现，先进的模型可以生成不同的语义关联，超过了大多数人类的水平。",
    "en_tdlr": "This study investigates the creative thinking of large language models using the divergent association task. The findings show that advanced models have the ability to generate divergent semantic associations, surpassing the performance of most humans."
}