{
    "title": "Retrieve-Cluster-Summarize: An Alternative to End-to-End Training for Query-specific Article Generation. (arXiv:2310.12361v1 [cs.IR])",
    "abstract": "Query-specific article generation is the task of, given a search query, generate a single article that gives an overview of the topic. We envision such articles as an alternative to presenting a ranking of search results. While generative Large Language Models (LLMs) like chatGPT also address this task, they are known to hallucinate new information, their models are secret, hard to analyze and control. Some generative LLMs provide supporting references, yet these are often unrelated to the generated content. As an alternative, we propose to study article generation systems that integrate document retrieval, query-specific clustering, and summarization. By design, such models can provide actual citations as provenance for their generated text. In particular, we contribute an evaluation framework that allows to separately trains and evaluate each of these three components before combining them into one system. We experimentally demonstrate that a system comprised of the best-performing i",
    "link": "http://arxiv.org/abs/2310.12361",
    "context": "Title: Retrieve-Cluster-Summarize: An Alternative to End-to-End Training for Query-specific Article Generation. (arXiv:2310.12361v1 [cs.IR])\nAbstract: Query-specific article generation is the task of, given a search query, generate a single article that gives an overview of the topic. We envision such articles as an alternative to presenting a ranking of search results. While generative Large Language Models (LLMs) like chatGPT also address this task, they are known to hallucinate new information, their models are secret, hard to analyze and control. Some generative LLMs provide supporting references, yet these are often unrelated to the generated content. As an alternative, we propose to study article generation systems that integrate document retrieval, query-specific clustering, and summarization. By design, such models can provide actual citations as provenance for their generated text. In particular, we contribute an evaluation framework that allows to separately trains and evaluate each of these three components before combining them into one system. We experimentally demonstrate that a system comprised of the best-performing i",
    "path": "papers/23/10/2310.12361.json",
    "total_tokens": 933,
    "translated_title": "Retrieve-Cluster-Summarize: 一种针对查询特定文章生成的端到端训练的替代方法",
    "translated_abstract": "查询特定文章生成是给定一个搜索查询，生成一个概述主题的单篇文章的任务。我们将这样的文章视为呈现搜索结果排名的替代方式。尽管像chatGPT这样的生成式大型语言模型也可以解决这一任务，但它们被认为产生新的信息（hallucinate），其模型是保密的、难以分析和控制。一些生成式大型语言模型提供支持性参考文献，但这些文献往往与生成的内容无关。作为替代，我们提出研究将文档检索、查询特定聚类和摘要集成的文章生成系统。通过设计，这样的模型可以为其生成的文本提供实际引用作为来源。特别地，我们提供了一个评估框架，可以在将这三个组件合并为一个系统之前分别训练和评估每个组件。我们通过实验证明，最佳表现的系统由最佳的查询特定聚类和摘要组件组成，可以得到更好的生成结果。",
    "tldr": "这项研究提出了一种针对查询特定文章生成的替代方法：通过整合文档检索、查询特定聚类和摘要生成系统，可以提供实际引用作为生成文本的来源，相较于生成式大型语言模型，能够得到更准确的生成结果。",
    "en_tdlr": "This study proposes an alternative approach for query-specific article generation by integrating document retrieval, query-specific clustering, and summarization systems, which can provide actual citations as sources for the generated text. Compared to generative large language models, this approach yields more accurate generation results."
}