{
    "title": "Creative Robot Tool Use with Large Language Models. (arXiv:2310.13065v1 [cs.RO])",
    "abstract": "Tool use is a hallmark of advanced intelligence, exemplified in both animal behavior and robotic capabilities. This paper investigates the feasibility of imbuing robots with the ability to creatively use tools in tasks that involve implicit physical constraints and long-term planning. Leveraging Large Language Models (LLMs), we develop RoboTool, a system that accepts natural language instructions and outputs executable code for controlling robots in both simulated and real-world environments. RoboTool incorporates four pivotal components: (i) an \"Analyzer\" that interprets natural language to discern key task-related concepts, (ii) a \"Planner\" that generates comprehensive strategies based on the language input and key concepts, (iii) a \"Calculator\" that computes parameters for each skill, and (iv) a \"Coder\" that translates these plans into executable Python code. Our results show that RoboTool can not only comprehend explicit or implicit physical constraints and environmental factors bu",
    "link": "http://arxiv.org/abs/2310.13065",
    "context": "Title: Creative Robot Tool Use with Large Language Models. (arXiv:2310.13065v1 [cs.RO])\nAbstract: Tool use is a hallmark of advanced intelligence, exemplified in both animal behavior and robotic capabilities. This paper investigates the feasibility of imbuing robots with the ability to creatively use tools in tasks that involve implicit physical constraints and long-term planning. Leveraging Large Language Models (LLMs), we develop RoboTool, a system that accepts natural language instructions and outputs executable code for controlling robots in both simulated and real-world environments. RoboTool incorporates four pivotal components: (i) an \"Analyzer\" that interprets natural language to discern key task-related concepts, (ii) a \"Planner\" that generates comprehensive strategies based on the language input and key concepts, (iii) a \"Calculator\" that computes parameters for each skill, and (iv) a \"Coder\" that translates these plans into executable Python code. Our results show that RoboTool can not only comprehend explicit or implicit physical constraints and environmental factors bu",
    "path": "papers/23/10/2310.13065.json",
    "total_tokens": 976,
    "translated_title": "利用大型语言模型进行创造性机器人工具使用研究",
    "translated_abstract": "工具使用是高级智能的标志，不仅存在于动物行为中，也体现在机器人的能力中。本文研究了将机器人赋予创造性使用工具的能力，用于涉及隐含物理约束和长期规划的任务中。通过利用大型语言模型（LLM），我们开发了RoboTool，一个系统，它接受自然语言指令并输出控制机器人在模拟和真实环境中的可执行代码。RoboTool包含四个关键组件：（i）\"解析器\"，用于解释自然语言以识别与任务相关的关键概念，（ii）\"规划器\"，根据语言输入和关键概念生成全面的策略，（iii）\"计算器\"，用于计算每个技能的参数，（iv）\"编码器\"，将这些计划转换成可执行的Python代码。我们的结果表明，RoboTool不仅可以理解明确或隐含的物理约束和环境因素，而且还可以产生有效的执行计划。",
    "tldr": "本文利用大型语言模型开发了一个系统，名为RoboTool，可以使机器人在涉及隐含物理约束和长期规划的任务中创造性地使用工具。该系统通过解析自然语言指令、生成全面的策略、计算技能参数并生成可执行的Python代码来实现。实验结果表明，RoboTool能够有效地处理任务中的物理约束和环境因素。",
    "en_tdlr": "This paper presents RoboTool, a system that utilizes large language models to enable robots to creatively use tools in tasks involving implicit physical constraints and long-term planning. The system interprets natural language instructions, generates comprehensive strategies, computes skill parameters, and translates plans into executable Python code. Experimental results demonstrate that RoboTool effectively handles physical constraints and environmental factors in tasks."
}