{
    "title": "Optimal Batched Best Arm Identification. (arXiv:2310.14129v1 [cs.LG])",
    "abstract": "We study the batched best arm identification (BBAI) problem, where the learner's goal is to identify the best arm while switching the policy as less as possible. In particular, we aim to find the best arm with probability $1-\\delta$ for some small constant $\\delta>0$ while minimizing both the sample complexity (total number of arm pulls) and the batch complexity (total number of batches). We propose the three-batch best arm identification (Tri-BBAI) algorithm, which is the first batched algorithm that achieves the optimal sample complexity in the asymptotic setting (i.e., $\\delta\\rightarrow 0$) and runs only in at most $3$ batches. Based on Tri-BBAI, we further propose the almost optimal batched best arm identification (Opt-BBAI) algorithm, which is the first algorithm that achieves the near-optimal sample and batch complexity in the non-asymptotic setting (i.e., $\\delta>0$ is arbitrarily fixed), while enjoying the same batch and sample complexity as Tri-BBAI when $\\delta$ tends to zer",
    "link": "http://arxiv.org/abs/2310.14129",
    "context": "Title: Optimal Batched Best Arm Identification. (arXiv:2310.14129v1 [cs.LG])\nAbstract: We study the batched best arm identification (BBAI) problem, where the learner's goal is to identify the best arm while switching the policy as less as possible. In particular, we aim to find the best arm with probability $1-\\delta$ for some small constant $\\delta>0$ while minimizing both the sample complexity (total number of arm pulls) and the batch complexity (total number of batches). We propose the three-batch best arm identification (Tri-BBAI) algorithm, which is the first batched algorithm that achieves the optimal sample complexity in the asymptotic setting (i.e., $\\delta\\rightarrow 0$) and runs only in at most $3$ batches. Based on Tri-BBAI, we further propose the almost optimal batched best arm identification (Opt-BBAI) algorithm, which is the first algorithm that achieves the near-optimal sample and batch complexity in the non-asymptotic setting (i.e., $\\delta>0$ is arbitrarily fixed), while enjoying the same batch and sample complexity as Tri-BBAI when $\\delta$ tends to zer",
    "path": "papers/23/10/2310.14129.json",
    "total_tokens": 958,
    "translated_title": "最佳武器识别的最佳批处理算法",
    "translated_abstract": "我们研究了最佳批处理武器识别（BBAI）问题，其中学习者的目标是在尽量少地更换策略的同时识别出最佳武器。具体而言，我们的目标是以概率$1-\\delta$找到最佳武器，其中$\\delta>0$是一个小常数，同时最小化样本复杂度（武器拉取的总数）和批处理复杂度（批处理的总数）。我们提出了三批次最佳武器识别（Tri-BBAI）算法，这是第一个在渐近设置（即$\\delta\\rightarrow0$）中实现最优样本复杂度且仅在最多三个批次中运行的批处理算法。基于Tri-BBAI，我们进一步提出了几乎最优的批处理最佳武器识别（Opt-BBAI）算法，在非渐近设置（即$\\delta>0$是任意固定的）中实现近似最优的样本和批处理复杂度，同时在$\\delta$趋于零时享受与Tri-BBAI相同的批处理和样本复杂度。",
    "tldr": "本论文研究了最佳批处理武器识别问题，在渐近和非渐近设置中提出了Tri-BBAI和Opt-BBAI算法，分别实现了最优和几乎最优的样本和批处理复杂度。",
    "en_tdlr": "This paper studies the problem of batched best arm identification (BBAI), and proposes Tri-BBAI and Opt-BBAI algorithms, which achieve optimal and almost optimal sample and batch complexity, respectively, in both asymptotic and non-asymptotic settings."
}