{
    "title": "Give and Take: Federated Transfer Learning for Industrial IoT Network Intrusion Detection. (arXiv:2310.07354v1 [cs.AI])",
    "abstract": "The rapid growth in Internet of Things (IoT) technology has become an integral part of today's industries forming the Industrial IoT (IIoT) initiative, where industries are leveraging IoT to improve communication and connectivity via emerging solutions like data analytics and cloud computing. Unfortunately, the rapid use of IoT has made it an attractive target for cybercriminals. Therefore, protecting these systems is of utmost importance. In this paper, we propose a federated transfer learning (FTL) approach to perform IIoT network intrusion detection. As part of the research, we also propose a combinational neural network as the centerpiece for performing FTL. The proposed technique splits IoT data between the client and server devices to generate corresponding models, and the weights of the client models are combined to update the server model. Results showcase high performance for the FTL setup between iterations on both the IIoT clients and the server. Additionally, the proposed F",
    "link": "http://arxiv.org/abs/2310.07354",
    "context": "Title: Give and Take: Federated Transfer Learning for Industrial IoT Network Intrusion Detection. (arXiv:2310.07354v1 [cs.AI])\nAbstract: The rapid growth in Internet of Things (IoT) technology has become an integral part of today's industries forming the Industrial IoT (IIoT) initiative, where industries are leveraging IoT to improve communication and connectivity via emerging solutions like data analytics and cloud computing. Unfortunately, the rapid use of IoT has made it an attractive target for cybercriminals. Therefore, protecting these systems is of utmost importance. In this paper, we propose a federated transfer learning (FTL) approach to perform IIoT network intrusion detection. As part of the research, we also propose a combinational neural network as the centerpiece for performing FTL. The proposed technique splits IoT data between the client and server devices to generate corresponding models, and the weights of the client models are combined to update the server model. Results showcase high performance for the FTL setup between iterations on both the IIoT clients and the server. Additionally, the proposed F",
    "path": "papers/23/10/2310.07354.json",
    "total_tokens": 871,
    "translated_title": "给与取：用于工业物联网网络入侵检测的联邦迁移学习",
    "translated_abstract": "互联网物联网（IoT）技术的快速增长已成为当今工业的一部分，形成了工业物联网（IIoT）倡议，工业利用IoT通过数据分析和云计算等新兴解决方案改进通信和连接。不幸的是，IoT的快速使用使其成为网络犯罪分子的有吸引力目标。因此，保护这些系统至关重要。在本文中，我们提出了一种联邦迁移学习（FTL）方法来进行IIoT网络入侵检测。作为研究的一部分，我们还提出了一种组合神经网络作为进行FTL的核心。所提出的技术将IoT数据分割在客户端和服务器设备之间生成相应的模型，客户模型的权重被组合以更新服务器模型。结果显示，FTL的设置在IIoT客户端和服务器之间的迭代中表现出高性能。",
    "tldr": "本文提出了一种用于工业物联网网络入侵检测的联邦迁移学习（FTL）方法，通过组合神经网络对IIoT数据进行分割并更新服务器模型，实现了高性能的入侵检测。",
    "en_tdlr": "This paper proposes a federated transfer learning (FTL) approach for industrial IoT network intrusion detection, which achieves high-performance intrusion detection by splitting and updating IoT data using a combinational neural network."
}