{
    "title": "Effective and Efficient Federated Tree Learning on Hybrid Data. (arXiv:2310.11865v1 [cs.LG])",
    "abstract": "Federated learning has emerged as a promising distributed learning paradigm that facilitates collaborative learning among multiple parties without transferring raw data. However, most existing federated learning studies focus on either horizontal or vertical data settings, where the data of different parties are assumed to be from the same feature or sample space. In practice, a common scenario is the hybrid data setting, where data from different parties may differ both in the features and samples. To address this, we propose HybridTree, a novel federated learning approach that enables federated tree learning on hybrid data. We observe the existence of consistent split rules in trees. With the help of these split rules, we theoretically show that the knowledge of parties can be incorporated into the lower layers of a tree. Based on our theoretical analysis, we propose a layer-level solution that does not need frequent communication traffic to train a tree. Our experiments demonstrate ",
    "link": "http://arxiv.org/abs/2310.11865",
    "context": "Title: Effective and Efficient Federated Tree Learning on Hybrid Data. (arXiv:2310.11865v1 [cs.LG])\nAbstract: Federated learning has emerged as a promising distributed learning paradigm that facilitates collaborative learning among multiple parties without transferring raw data. However, most existing federated learning studies focus on either horizontal or vertical data settings, where the data of different parties are assumed to be from the same feature or sample space. In practice, a common scenario is the hybrid data setting, where data from different parties may differ both in the features and samples. To address this, we propose HybridTree, a novel federated learning approach that enables federated tree learning on hybrid data. We observe the existence of consistent split rules in trees. With the help of these split rules, we theoretically show that the knowledge of parties can be incorporated into the lower layers of a tree. Based on our theoretical analysis, we propose a layer-level solution that does not need frequent communication traffic to train a tree. Our experiments demonstrate ",
    "path": "papers/23/10/2310.11865.json",
    "total_tokens": 931,
    "translated_title": "混合数据上有效高效的联邦树学习",
    "translated_abstract": "联邦学习作为一种有前景的分布式学习范式，可以促进多个参与方在不传输原始数据的情况下进行协作学习。然而，大多数现有的联邦学习研究集中在水平数据或垂直数据设置上，其中不同参与方的数据被认为来自相同的特征或样本空间。在实践中，常见的情况是混合数据设置，其中来自不同参与方的数据在特征和样本方面可能存在差异。为了解决这个问题，我们提出了HybridTree，一种在混合数据上进行联邦树学习的新方法。我们观察到树中存在一致的分割规则。借助这些分割规则，我们在理论上证明了参与方的知识可以被纳入树的较低层。基于我们的理论分析，我们提出了一种层级解决方案，不需要频繁的通信流量来训练一棵树。我们的实验证明了我们的方法在处理混合数据时的有效性和高效性。",
    "tldr": "这项研究提出了一种名为HybridTree的新方法，可以在混合数据上进行联邦树学习。通过利用树中的一致分割规则，参与方的知识可以被纳入树的较低层，从而实现高效的联邦学习。",
    "en_tdlr": "This study proposes a new method called HybridTree, which enables federated tree learning on hybrid data. By exploiting consistent split rules in trees, the knowledge of parties can be incorporated into the lower layers of a tree, resulting in effective and efficient federated learning on hybrid data."
}