{
    "title": "Causal discovery using dynamically requested knowledge. (arXiv:2310.11154v1 [cs.AI])",
    "abstract": "Causal Bayesian Networks (CBNs) are an important tool for reasoning under uncertainty in complex real-world systems. Determining the graphical structure of a CBN remains a key challenge and is undertaken either by eliciting it from humans, using machine learning to learn it from data, or using a combination of these two approaches. In the latter case, human knowledge is generally provided to the algorithm before it starts, but here we investigate a novel approach where the structure learning algorithm itself dynamically identifies and requests knowledge for relationships that the algorithm identifies as uncertain during structure learning. We integrate this approach into the Tabu structure learning algorithm and show that it offers considerable gains in structural accuracy, which are generally larger than those offered by existing approaches for integrating knowledge. We suggest that a variant which requests only arc orientation information may be particularly useful where the practiti",
    "link": "http://arxiv.org/abs/2310.11154",
    "context": "Title: Causal discovery using dynamically requested knowledge. (arXiv:2310.11154v1 [cs.AI])\nAbstract: Causal Bayesian Networks (CBNs) are an important tool for reasoning under uncertainty in complex real-world systems. Determining the graphical structure of a CBN remains a key challenge and is undertaken either by eliciting it from humans, using machine learning to learn it from data, or using a combination of these two approaches. In the latter case, human knowledge is generally provided to the algorithm before it starts, but here we investigate a novel approach where the structure learning algorithm itself dynamically identifies and requests knowledge for relationships that the algorithm identifies as uncertain during structure learning. We integrate this approach into the Tabu structure learning algorithm and show that it offers considerable gains in structural accuracy, which are generally larger than those offered by existing approaches for integrating knowledge. We suggest that a variant which requests only arc orientation information may be particularly useful where the practiti",
    "path": "papers/23/10/2310.11154.json",
    "total_tokens": 828,
    "translated_title": "使用动态请求的知识进行因果发现",
    "translated_abstract": "因果贝叶斯网络（CBNs）是在复杂现实世界系统中进行不确定性推理的重要工具。确定CBN的图形结构仍然是一个关键挑战，可以通过从人类获取信息、使用机器学习从数据中学习或结合这两种方法来完成。在后一种情况下，通常在算法开始之前会向算法提供人类知识，但在这里，我们研究了一种新颖的方法，即结构学习算法本身在结构学习过程中动态识别和请求关系的知识。我们将这种方法集成到Tabu结构学习算法中，并证明它在结构准确性方面具有相当大的优势，这一优势通常超过了现有方法整合知识所能提供的优势。我们认为，在仅请求弧方向信息的变体中，这种方法可能特别有用。",
    "tldr": "本论文提出了一种使用动态请求的知识进行因果发现的方法，该方法在CBN的结构学习过程中动态识别和请求不确定关系的知识，与现有方法相比，在结构准确性方面取得了显著的提升。",
    "en_tdlr": "This paper proposes a method for causal discovery using dynamically requested knowledge, which dynamically identifies and requests knowledge for uncertain relationships during the structure learning process of CBNs. Compared to existing approaches, it achieves significant improvements in structural accuracy."
}