{
    "title": "1D-CapsNet-LSTM: A Deep Learning-Based Model for Multi-Step Stock Index Forecasting. (arXiv:2310.02090v2 [cs.LG] UPDATED)",
    "abstract": "Multi-step stock index forecasting is vital in finance for informed decision-making. Current forecasting methods on this task frequently produce unsatisfactory results due to the inherent data randomness and instability, thereby underscoring the demand for advanced forecasting models. Given the superiority of capsule network (CapsNet) over CNN in various forecasting and classification tasks, this study investigates the potential of integrating a 1D CapsNet with an LSTM network for multi-step stock index forecasting. To this end, a hybrid 1D-CapsNet-LSTM model is introduced, which utilizes a 1D CapsNet to generate high-level capsules from sequential data and a LSTM network to capture temporal dependencies. To maintain stochastic dependencies over different forecasting horizons, a multi-input multi-output (MIMO) strategy is employed. The model's performance is evaluated on real-world stock market indices, including S&P 500, DJIA, IXIC, and NYSE, and compared to baseline models, including",
    "link": "http://arxiv.org/abs/2310.02090",
    "context": "Title: 1D-CapsNet-LSTM: A Deep Learning-Based Model for Multi-Step Stock Index Forecasting. (arXiv:2310.02090v2 [cs.LG] UPDATED)\nAbstract: Multi-step stock index forecasting is vital in finance for informed decision-making. Current forecasting methods on this task frequently produce unsatisfactory results due to the inherent data randomness and instability, thereby underscoring the demand for advanced forecasting models. Given the superiority of capsule network (CapsNet) over CNN in various forecasting and classification tasks, this study investigates the potential of integrating a 1D CapsNet with an LSTM network for multi-step stock index forecasting. To this end, a hybrid 1D-CapsNet-LSTM model is introduced, which utilizes a 1D CapsNet to generate high-level capsules from sequential data and a LSTM network to capture temporal dependencies. To maintain stochastic dependencies over different forecasting horizons, a multi-input multi-output (MIMO) strategy is employed. The model's performance is evaluated on real-world stock market indices, including S&P 500, DJIA, IXIC, and NYSE, and compared to baseline models, including",
    "path": "papers/23/10/2310.02090.json",
    "total_tokens": 984,
    "translated_title": "1D-CapsNet-LSTM: 基于深度学习的多步股指预测模型",
    "translated_abstract": "多步股指预测在金融领域对于明智决策至关重要。目前关于此任务的预测方法常常由于数据的随机性和不稳定性产生不令人满意的结果，突显了对高级预测模型的需求。鉴于胶囊网络（CapsNet）在各种预测和分类任务中优于CNN，本研究探讨了将一维CapsNet与LSTM网络结合起来进行多步股指预测的潜力。为此，引入了一个混合的一维CapsNet-LSTM模型，该模型利用一维CapsNet从序列数据中生成高级胶囊，并利用LSTM网络捕获时间依赖关系。为了保持不同预测时间范围上的随机依赖关系，采用了多输入多输出（MIMO）策略。模型在包括标普500、道琼斯工业平均指数、纳斯达克综合指数和纽交所在内的真实股票市场指数上进行了评估，并与基线模型进行了比较。",
    "tldr": "本研究提出了一个基于一维CapsNet和LSTM网络的混合模型，用于多步股指预测。该模型利用CapsNet从序列数据中生成高级胶囊，同时利用LSTM网络捕获时间依赖关系。模型在真实股票市场指数上表现优于基线模型。",
    "en_tdlr": "This study proposes a hybrid model based on 1D CapsNet and LSTM network for multi-step stock index forecasting. The model utilizes CapsNet to generate high-level capsules from sequential data and LSTM network to capture temporal dependencies. The model outperforms baseline models on real-world stock market indices."
}