{
    "title": "Correcting model misspecification in physics-informed neural networks (PINNs). (arXiv:2310.10776v1 [cs.LG])",
    "abstract": "Data-driven discovery of governing equations in computational science has emerged as a new paradigm for obtaining accurate physical models and as a possible alternative to theoretical derivations. The recently developed physics-informed neural networks (PINNs) have also been employed to learn governing equations given data across diverse scientific disciplines. Despite the effectiveness of PINNs for discovering governing equations, the physical models encoded in PINNs may be misspecified in complex systems as some of the physical processes may not be fully understood, leading to the poor accuracy of PINN predictions. In this work, we present a general approach to correct the misspecified physical models in PINNs for discovering governing equations, given some sparse and/or noisy data. Specifically, we first encode the assumed physical models, which may be misspecified, then employ other deep neural networks (DNNs) to model the discrepancy between the imperfect models and the observatio",
    "link": "http://arxiv.org/abs/2310.10776",
    "context": "Title: Correcting model misspecification in physics-informed neural networks (PINNs). (arXiv:2310.10776v1 [cs.LG])\nAbstract: Data-driven discovery of governing equations in computational science has emerged as a new paradigm for obtaining accurate physical models and as a possible alternative to theoretical derivations. The recently developed physics-informed neural networks (PINNs) have also been employed to learn governing equations given data across diverse scientific disciplines. Despite the effectiveness of PINNs for discovering governing equations, the physical models encoded in PINNs may be misspecified in complex systems as some of the physical processes may not be fully understood, leading to the poor accuracy of PINN predictions. In this work, we present a general approach to correct the misspecified physical models in PINNs for discovering governing equations, given some sparse and/or noisy data. Specifically, we first encode the assumed physical models, which may be misspecified, then employ other deep neural networks (DNNs) to model the discrepancy between the imperfect models and the observatio",
    "path": "papers/23/10/2310.10776.json",
    "total_tokens": 865,
    "translated_title": "纠正物理信息神经网络（PINNs）中模型错误规范的方法",
    "translated_abstract": "在计算科学中，通过数据驱动发现控制方程已经成为获得准确物理模型的新范式，并可能成为理论推导的可能替代方法。最近开发的物理信息神经网络（PINNs）已经被用于学习各种科学领域中的控制方程。尽管PINNs在发现控制方程方面非常有效，但是PINNs中编码的物理模型在复杂系统中可能存在严重的错误规范，因为某些物理过程可能并没有完全被理解，导致PINN预测的准确性较差。在这项工作中，我们提出了一种纠正PINNs中错误规范的物理模型的通用方法，为了通过一些稀疏和/或噪声数据来发现控制方程。具体来说，我们首先对假设的物理模型进行编码，然后使用其他深度神经网络（DNNs）来建模不完美模型与观测之间的差异。",
    "tldr": "本论文提出了一种纠正物理信息神经网络（PINNs）中模型错误规范的通用方法，用于发现控制方程，并通过稀疏和/或噪声数据实现了校正。",
    "en_tdlr": "This paper presents a general approach to correct model misspecification in physics-informed neural networks (PINNs) for discovering governing equations, and demonstrates the correction using sparse and/or noisy data."
}