{
    "title": "A Computational Approach to Style in American Poetry. (arXiv:2310.09357v1 [cs.CL])",
    "abstract": "We develop a quantitative method to assess the style of American poems and to visualize a collection of poems in relation to one another. Qualitative poetry criticism helped guide our development of metrics that analyze various orthographic, syntactic, and phonemic features. These features are used to discover comprehensive stylistic information from a poem's multi-layered latent structure, and to compute distances between poems in this space. Visualizations provide ready access to the analytical components. We demonstrate our method on several collections of poetry, showing that it better delineates poetry style than the traditional word-occurrence features that are used in typical text analysis algorithms. Our method has potential applications to academic research of texts, to research of the intuitive personal response to poetry, and to making recommendations to readers based on their favorite poems.",
    "link": "http://arxiv.org/abs/2310.09357",
    "context": "Title: A Computational Approach to Style in American Poetry. (arXiv:2310.09357v1 [cs.CL])\nAbstract: We develop a quantitative method to assess the style of American poems and to visualize a collection of poems in relation to one another. Qualitative poetry criticism helped guide our development of metrics that analyze various orthographic, syntactic, and phonemic features. These features are used to discover comprehensive stylistic information from a poem's multi-layered latent structure, and to compute distances between poems in this space. Visualizations provide ready access to the analytical components. We demonstrate our method on several collections of poetry, showing that it better delineates poetry style than the traditional word-occurrence features that are used in typical text analysis algorithms. Our method has potential applications to academic research of texts, to research of the intuitive personal response to poetry, and to making recommendations to readers based on their favorite poems.",
    "path": "papers/23/10/2310.09357.json",
    "total_tokens": 931,
    "translated_title": "一种评估美国诗歌风格的计算方法",
    "translated_abstract": "我们开发了一种定量方法来评估美国诗歌的风格，并可视化诗集之间的关系。定性诗歌批评帮助我们开发了分析各种正字法、句法和音位特征的度量标准。这些特征用于从诗歌的多层潜在结构中发现全面的风格信息，并计算诗歌之间的距离。可视化提供了对分析组件的便捷访问。我们在几个诗歌集合上演示了我们的方法，显示出它比传统的词频特征在典型文本分析算法中更好地刻画了诗歌风格。我们的方法在学术研究、对诗歌的直观个人回应的研究以及根据读者喜好进行推荐方面具有潜在应用。",
    "tldr": "通过定量方法评估美国诗歌的风格，并通过可视化展示诗集之间的关系。该方法通过分析正字法、句法和音位特征，从诗歌的多层潜在结构中发现全面的风格信息。与传统的词频特征相比，该方法更好地刻画了诗歌风格，并可应用于学术研究、诗歌的个人回应研究以及根据读者喜好进行推荐等领域。"
}