{
    "title": "Early Detection of Tuberculosis with Machine Learning Cough Audio Analysis: Towards More Accessible Global Triaging Usage. (arXiv:2310.17675v1 [eess.AS])",
    "abstract": "Tuberculosis (TB), a bacterial disease mainly affecting the lungs, is one of the leading infectious causes of mortality worldwide. To prevent TB from spreading within the body, which causes life-threatening complications, timely and effective anti-TB treatment is crucial. Cough, an objective biomarker for TB, is a triage tool that monitors treatment response and regresses with successful therapy. Current gold standards for TB diagnosis are slow or inaccessible, especially in rural areas where TB is most prevalent. In addition, current machine learning (ML) diagnosis research, like utilizing chest radiographs, is ineffective and does not monitor treatment progression. To enable effective diagnosis, an ensemble model was developed that analyzes, using a novel ML architecture, coughs' acoustic epidemiologies from smartphones' microphones to detect TB. The architecture includes a 2D-CNN and XGBoost that was trained on 724,964 cough audio samples and demographics from 7 countries. After fea",
    "link": "http://arxiv.org/abs/2310.17675",
    "context": "Title: Early Detection of Tuberculosis with Machine Learning Cough Audio Analysis: Towards More Accessible Global Triaging Usage. (arXiv:2310.17675v1 [eess.AS])\nAbstract: Tuberculosis (TB), a bacterial disease mainly affecting the lungs, is one of the leading infectious causes of mortality worldwide. To prevent TB from spreading within the body, which causes life-threatening complications, timely and effective anti-TB treatment is crucial. Cough, an objective biomarker for TB, is a triage tool that monitors treatment response and regresses with successful therapy. Current gold standards for TB diagnosis are slow or inaccessible, especially in rural areas where TB is most prevalent. In addition, current machine learning (ML) diagnosis research, like utilizing chest radiographs, is ineffective and does not monitor treatment progression. To enable effective diagnosis, an ensemble model was developed that analyzes, using a novel ML architecture, coughs' acoustic epidemiologies from smartphones' microphones to detect TB. The architecture includes a 2D-CNN and XGBoost that was trained on 724,964 cough audio samples and demographics from 7 countries. After fea",
    "path": "papers/23/10/2310.17675.json",
    "total_tokens": 1029,
    "translated_title": "机器学习咳嗽声音分析早期检测结核病：朝着更易于全球分类使用的方向",
    "translated_abstract": "结核病（TB）是一种主要影响肺部的细菌性疾病，是全球死亡率最高的传染病之一。及时有效的抗结核治疗对于防止结核病在体内传播，避免致命并发症至关重要。咳嗽作为结核病的客观生物标志物，是一种监测治疗反应并随着成功治疗而减少的分类工具。目前用于结核病诊断的黄金标准方法缓慢且不易获取，尤其在乡村地区结核病的流行程度最高。此外，目前的机器学习诊断研究，如利用胸部X光片，无法有效监测治疗进展。为了实现有效的诊断，我们开发了一个集成模型，使用了一种新的机器学习架构，从智能手机的麦克风中分析咳嗽声音的流行病学特征来检测结核病。该架构包括一个2D-CNN和XGBoost，使用了来自7个国家的724,964个咳嗽声音样本和人口统计学数据进行训练。",
    "tldr": "这项研究开发了一种利用机器学习分析智能手机麦克风中的咳嗽声音来检测结核病的集成模型，可以实现早期诊断和监测治疗进展，从而为全球结核病的分类使用提供更易于获取的方法。"
}