{
    "title": "PeaTMOSS: Mining Pre-Trained Models in Open-Source Software. (arXiv:2310.03620v1 [cs.SE])",
    "abstract": "Developing and training deep learning models is expensive, so software engineers have begun to reuse pre-trained deep learning models (PTMs) and fine-tune them for downstream tasks. Despite the wide-spread use of PTMs, we know little about the corresponding software engineering behaviors and challenges.  To enable the study of software engineering with PTMs, we present the PeaTMOSS dataset: Pre-Trained Models in Open-Source Software. PeaTMOSS has three parts: a snapshot of (1) 281,638 PTMs, (2) 27,270 open-source software repositories that use PTMs, and (3) a mapping between PTMs and the projects that use them. We challenge PeaTMOSS miners to discover software engineering practices around PTMs. A demo and link to the full dataset are available at: https://github.com/PurdueDualityLab/PeaTMOSS-Demos.",
    "link": "http://arxiv.org/abs/2310.03620",
    "context": "Title: PeaTMOSS: Mining Pre-Trained Models in Open-Source Software. (arXiv:2310.03620v1 [cs.SE])\nAbstract: Developing and training deep learning models is expensive, so software engineers have begun to reuse pre-trained deep learning models (PTMs) and fine-tune them for downstream tasks. Despite the wide-spread use of PTMs, we know little about the corresponding software engineering behaviors and challenges.  To enable the study of software engineering with PTMs, we present the PeaTMOSS dataset: Pre-Trained Models in Open-Source Software. PeaTMOSS has three parts: a snapshot of (1) 281,638 PTMs, (2) 27,270 open-source software repositories that use PTMs, and (3) a mapping between PTMs and the projects that use them. We challenge PeaTMOSS miners to discover software engineering practices around PTMs. A demo and link to the full dataset are available at: https://github.com/PurdueDualityLab/PeaTMOSS-Demos.",
    "path": "papers/23/10/2310.03620.json",
    "total_tokens": 882,
    "translated_title": "PeaTMOSS: 在开源软件中挖掘预训练模型",
    "translated_abstract": "开发和训练深度学习模型成本高昂，因此软件工程师已经开始重用预训练的深度学习模型(PTMs)并对其进行微调以适用于下游任务。尽管PTMs的使用已经广泛，但我们对相应的软件工程行为和挑战还知之甚少。为了实现对PTMs进行软件工程研究，我们提出了PeaTMOSS数据集：开源软件中的预训练模型。PeaTMOSS数据集包括三个部分：(1) 281,638个PTMs的快照，(2) 使用PTMs的27,270个开源软件存储库，以及(3) PTMs和使用它们的项目之间的映射。我们呼吁PeaTMOSS矿工们发现围绕PTMs的软件工程实践。演示和完整数据集的链接可在以下网址找到：https://github.com/PurdueDualityLab/PeaTMOSS-Demos。",
    "tldr": "PeaTMOSS数据集提供了一个研究开源软件中预训练模型软件工程行为和挑战的平台，包括大量的PTMs快照和使用PTMs的开源软件存储库。",
    "en_tdlr": "The PeaTMOSS dataset provides a platform for studying software engineering behaviors and challenges related to pre-trained models in open-source software, including a large number of PTMs snapshots and open-source software repositories that use PTMs."
}