{
    "title": "Diffusion Prior Regularized Iterative Reconstruction for Low-dose CT. (arXiv:2310.06949v1 [eess.IV])",
    "abstract": "Computed tomography (CT) involves a patient's exposure to ionizing radiation. To reduce the radiation dose, we can either lower the X-ray photon count or down-sample projection views. However, either of the ways often compromises image quality. To address this challenge, here we introduce an iterative reconstruction algorithm regularized by a diffusion prior. Drawing on the exceptional imaging prowess of the denoising diffusion probabilistic model (DDPM), we merge it with a reconstruction procedure that prioritizes data fidelity. This fusion capitalizes on the merits of both techniques, delivering exceptional reconstruction results in an unsupervised framework. To further enhance the efficiency of the reconstruction process, we incorporate the Nesterov momentum acceleration technique. This enhancement facilitates superior diffusion sampling in fewer steps. As demonstrated in our experiments, our method offers a potential pathway to high-definition CT image reconstruction with minimized",
    "link": "http://arxiv.org/abs/2310.06949",
    "context": "Title: Diffusion Prior Regularized Iterative Reconstruction for Low-dose CT. (arXiv:2310.06949v1 [eess.IV])\nAbstract: Computed tomography (CT) involves a patient's exposure to ionizing radiation. To reduce the radiation dose, we can either lower the X-ray photon count or down-sample projection views. However, either of the ways often compromises image quality. To address this challenge, here we introduce an iterative reconstruction algorithm regularized by a diffusion prior. Drawing on the exceptional imaging prowess of the denoising diffusion probabilistic model (DDPM), we merge it with a reconstruction procedure that prioritizes data fidelity. This fusion capitalizes on the merits of both techniques, delivering exceptional reconstruction results in an unsupervised framework. To further enhance the efficiency of the reconstruction process, we incorporate the Nesterov momentum acceleration technique. This enhancement facilitates superior diffusion sampling in fewer steps. As demonstrated in our experiments, our method offers a potential pathway to high-definition CT image reconstruction with minimized",
    "path": "papers/23/10/2310.06949.json",
    "total_tokens": 933,
    "translated_title": "低剂量CT的扩散先验正则化迭代重建",
    "translated_abstract": "计算机断层扫描（CT）涉及患者接受电离辐射。为了减少辐射剂量，我们可以降低X射线光子计数或者下采样投影视图。然而，这两种方式经常会损害图像质量。为了解决这个挑战，我们在这里介绍了一种使用扩散先验正则化的迭代重建算法。借鉴去噪扩散概率模型（DDPM）的出色成像能力，我们将其与优先考虑数据保真度的重建过程相结合。这种融合利用了两种技术的优点，在无监督框架中实现了出色的重建结果。为了进一步提高重建过程的效率，我们还采用了Nesterov动量加速技术。这种增强有助于在更少的步骤中实现优秀的扩散采样。正如我们的实验所示，我们的方法为高清CT图像重建提供了潜在的途径，同时最大程度地减少了辐射剂量。",
    "tldr": "本文介绍了一种扩散先验正则化的迭代重建算法，通过融合去噪扩散概率模型和数据保真度重建过程，以及采用Nesterov动量加速技术，实现了在低剂量CT下出色的图像重建效果。"
}