{
    "title": "Salespeople vs SalesBot: Exploring the Role of Educational Value in Conversational Recommender Systems. (arXiv:2310.17749v1 [cs.CL])",
    "abstract": "Making big purchases requires consumers to research or consult a salesperson to gain domain expertise. However, existing conversational recommender systems (CRS) often overlook users' lack of background knowledge, focusing solely on gathering preferences. In this work, we define a new problem space for conversational agents that aim to provide both product recommendations and educational value through mixed-type mixed-initiative dialog. We introduce SalesOps, a framework that facilitates the simulation and evaluation of such systems by leveraging recent advancements in large language models (LLMs). We build SalesBot and ShopperBot, a pair of LLM-powered agents that can simulate either side of the framework. A comprehensive human study compares SalesBot against professional salespeople, revealing that although SalesBot approaches professional performance in terms of fluency and informativeness, it lags behind in recommendation quality. We emphasize the distinct limitations both face in ",
    "link": "http://arxiv.org/abs/2310.17749",
    "context": "Title: Salespeople vs SalesBot: Exploring the Role of Educational Value in Conversational Recommender Systems. (arXiv:2310.17749v1 [cs.CL])\nAbstract: Making big purchases requires consumers to research or consult a salesperson to gain domain expertise. However, existing conversational recommender systems (CRS) often overlook users' lack of background knowledge, focusing solely on gathering preferences. In this work, we define a new problem space for conversational agents that aim to provide both product recommendations and educational value through mixed-type mixed-initiative dialog. We introduce SalesOps, a framework that facilitates the simulation and evaluation of such systems by leveraging recent advancements in large language models (LLMs). We build SalesBot and ShopperBot, a pair of LLM-powered agents that can simulate either side of the framework. A comprehensive human study compares SalesBot against professional salespeople, revealing that although SalesBot approaches professional performance in terms of fluency and informativeness, it lags behind in recommendation quality. We emphasize the distinct limitations both face in ",
    "path": "papers/23/10/2310.17749.json",
    "total_tokens": 931,
    "translated_title": "销售人员 vs SalesBot：探索教育价值在对话式推荐系统中的作用",
    "translated_abstract": "进行大额购买需要消费者进行研究或咨询销售人员以获取领域专业知识。然而，现有的对话式推荐系统（CRS）往往忽视用户缺乏背景知识，仅关注于收集偏好。在这项工作中，我们为旨在通过混合型混合模式对话提供产品推荐和教育价值的会话代理定义了一个新的问题空间。我们介绍了SalesOps，这是一个借鉴最新的大型语言模型（LLM）的框架，用于模拟和评估这种系统。我们构建了SalesBot和ShopperBot，这是一对LLM驱动的代理，可以模拟框架的任意一侧。通过一项全面的人类研究，我们将SalesBot与专业销售人员进行比较，发现虽然SalesBot在流畅性和信息量方面接近专业表现，但在推荐质量方面却落后。我们强调了两者面临的不同局限性。",
    "tldr": "这项研究探索了在对话式推荐系统中教育价值的作用，通过比较销售人员和SalesBot的性能，发现虽然SalesBot在流畅性和信息量方面接近专业销售人员，但在推荐质量方面仍存在差距。",
    "en_tdlr": "This study explores the role of educational value in conversational recommender systems, comparing the performance of salespeople and SalesBot. It finds that while SalesBot approaches professional salespeople in terms of fluency and informativeness, it lags behind in recommendation quality."
}