{
    "title": "On sample complexity of conditional independence testing with Von Mises estimator with application to causal discovery. (arXiv:2310.13553v1 [cs.LG])",
    "abstract": "Motivated by conditional independence testing, an essential step in constraint-based causal discovery algorithms, we study the nonparametric Von Mises estimator for the entropy of multivariate distributions built on a kernel density estimator. We establish an exponential concentration inequality for this estimator. We design a test for conditional independence (CI) based on our estimator, called VM-CI, which achieves optimal parametric rates under smoothness assumptions. Leveraging the exponential concentration, we prove a tight upper bound for the overall error of VM-CI. This, in turn, allows us to characterize the sample complexity of any constraint-based causal discovery algorithm that uses VM-CI for CI tests. To the best of our knowledge, this is the first sample complexity guarantee for causal discovery for continuous variables. Furthermore, we empirically show that VM-CI outperforms other popular CI tests in terms of either time or sample complexity (or both), which translates to",
    "link": "http://arxiv.org/abs/2310.13553",
    "context": "Title: On sample complexity of conditional independence testing with Von Mises estimator with application to causal discovery. (arXiv:2310.13553v1 [cs.LG])\nAbstract: Motivated by conditional independence testing, an essential step in constraint-based causal discovery algorithms, we study the nonparametric Von Mises estimator for the entropy of multivariate distributions built on a kernel density estimator. We establish an exponential concentration inequality for this estimator. We design a test for conditional independence (CI) based on our estimator, called VM-CI, which achieves optimal parametric rates under smoothness assumptions. Leveraging the exponential concentration, we prove a tight upper bound for the overall error of VM-CI. This, in turn, allows us to characterize the sample complexity of any constraint-based causal discovery algorithm that uses VM-CI for CI tests. To the best of our knowledge, this is the first sample complexity guarantee for causal discovery for continuous variables. Furthermore, we empirically show that VM-CI outperforms other popular CI tests in terms of either time or sample complexity (or both), which translates to",
    "path": "papers/23/10/2310.13553.json",
    "total_tokens": 869,
    "translated_title": "关于以Von Mises估计器进行条件独立性测试的样本复杂性及其在因果发现中的应用",
    "translated_abstract": "本文通过研究基于核密度估计的多元分布的非参数Von Mises估计器，针对条件独立性测试的动机，建立了一个指数集中不等式。我们设计了一种基于该估计器的条件独立性测试方法，称为VM-CI，该方法在平滑性假设下达到了最优参数速率。利用指数集中不等式，我们证明了VM-CI的整体误差的紧密上界。由此，我们能够对使用VM-CI进行条件独立性测试的任何基于约束的因果发现算法的样本复杂度进行刻画。据我们所知，这是对于连续变量因果发现的首个样本复杂度保证。此外，我们通过实验证明，VM-CI在时间或样本复杂度（或两者）方面优于其他常用的条件独立性测试方法，这可以转化为",
    "tldr": "本文研究了以Von Mises估计器进行条件独立性测试的样本复杂性，并基于该估计器设计了一种新的测试方法。实验证明，该方法在时间或样本复杂度方面优于其他方法。",
    "en_tdlr": "This paper studies the sample complexity of conditional independence testing with the Von Mises estimator and proposes a new testing method based on it. Empirical results show that this method outperforms other methods in terms of time or sample complexity."
}