{
    "title": "NormDial: A Comparable Bilingual Synthetic Dialog Dataset for Modeling Social Norm Adherence and Violation. (arXiv:2310.14563v2 [cs.CL] UPDATED)",
    "abstract": "Social norms fundamentally shape interpersonal communication. We present NormDial, a high-quality dyadic dialogue dataset with turn-by-turn annotations of social norm adherences and violations for Chinese and American cultures. Introducing the task of social norm observance detection, our dataset is synthetically generated in both Chinese and English using a human-in-the-loop pipeline by prompting large language models with a small collection of expert-annotated social norms. We show that our generated dialogues are of high quality through human evaluation and further evaluate the performance of existing large language models on this task. Our findings point towards new directions for understanding the nuances of social norms as they manifest in conversational contexts that span across languages and cultures.",
    "link": "http://arxiv.org/abs/2310.14563",
    "context": "Title: NormDial: A Comparable Bilingual Synthetic Dialog Dataset for Modeling Social Norm Adherence and Violation. (arXiv:2310.14563v2 [cs.CL] UPDATED)\nAbstract: Social norms fundamentally shape interpersonal communication. We present NormDial, a high-quality dyadic dialogue dataset with turn-by-turn annotations of social norm adherences and violations for Chinese and American cultures. Introducing the task of social norm observance detection, our dataset is synthetically generated in both Chinese and English using a human-in-the-loop pipeline by prompting large language models with a small collection of expert-annotated social norms. We show that our generated dialogues are of high quality through human evaluation and further evaluate the performance of existing large language models on this task. Our findings point towards new directions for understanding the nuances of social norms as they manifest in conversational contexts that span across languages and cultures.",
    "path": "papers/23/10/2310.14563.json",
    "total_tokens": 772,
    "translated_title": "NormDial: 用于模拟社会规范遵守和违反的可比较双语合成对话数据集",
    "translated_abstract": "社会规范从根本上塑造了人际交流。我们提供了NormDial，一个高质量的双人对话数据集，其中包含了中美两种文化的社会规范遵守和违反的逐轮注释。通过引入社会规范遵守检测任务，我们使用人机协作的方式，通过使用少量专家注释的社会规范提示大型语言模型在中英文中生成数据。我们通过人工评估证明了我们生成的对话质量很高，进一步评估了现有大型语言模型在这一任务上的性能。我们的研究结果指向了新的方向，以了解跨语言和文化背景下的对话环境中社会规范的微妙之处。",
    "tldr": "NormDial是一个高质量的双语合成对话数据集，用于模拟社会规范的遵守和违反。通过引入社会规范遵守检测任务，该数据集能够帮助我们深入了解跨语言和文化背景下对话环境中社会规范的细微差别。"
}