{
    "title": "Structural Vector Autoregressions and Higher Moments: Challenges and Solutions in Small Samples. (arXiv:2310.08173v1 [econ.EM])",
    "abstract": "Generalized method of moments estimators based on higher-order moment conditions derived from independent shocks can be used to identify and estimate the simultaneous interaction in structural vector autoregressions. This study highlights two problems that arise when using these estimators in small samples. First, imprecise estimates of the asymptotically efficient weighting matrix and the asymptotic variance lead to volatile estimates and inaccurate inference. Second, many moment conditions lead to a small sample scaling bias towards innovations with a variance smaller than the normalizing unit variance assumption. To address the first problem, I propose utilizing the assumption of independent structural shocks to estimate the efficient weighting matrix and the variance of the estimator. For the second issue, I propose incorporating a continuously updated scaling term into the weighting matrix, eliminating the scaling bias. To demonstrate the effectiveness of these measures, I conduct",
    "link": "http://arxiv.org/abs/2310.08173",
    "context": "Title: Structural Vector Autoregressions and Higher Moments: Challenges and Solutions in Small Samples. (arXiv:2310.08173v1 [econ.EM])\nAbstract: Generalized method of moments estimators based on higher-order moment conditions derived from independent shocks can be used to identify and estimate the simultaneous interaction in structural vector autoregressions. This study highlights two problems that arise when using these estimators in small samples. First, imprecise estimates of the asymptotically efficient weighting matrix and the asymptotic variance lead to volatile estimates and inaccurate inference. Second, many moment conditions lead to a small sample scaling bias towards innovations with a variance smaller than the normalizing unit variance assumption. To address the first problem, I propose utilizing the assumption of independent structural shocks to estimate the efficient weighting matrix and the variance of the estimator. For the second issue, I propose incorporating a continuously updated scaling term into the weighting matrix, eliminating the scaling bias. To demonstrate the effectiveness of these measures, I conduct",
    "path": "papers/23/10/2310.08173.json",
    "total_tokens": 990,
    "translated_title": "结构向量自回归与更高阶矩：小样本中的挑战与解决方案",
    "translated_abstract": "基于来自独立冲击的更高阶矩条件的广义矩方法估计器可以用于识别和估计结构向量自回归中的同时互动。本研究重点讨论在小样本中使用这些估计器时出现的两个问题。首先，不精确的渐近有效加权矩阵和渐近方差会导致估计不稳定和推断不准确。其次，许多矩条件会导致对方差小于归一化单位方差假设的创新的小样本缩放偏差。为解决第一个问题，我提出利用独立结构冲击的假设来估计有效加权矩阵和估计器的方差。对于第二个问题，我建议将一个持续更新的缩放项纳入加权矩阵中，消除缩放偏差。为了证明这些措施的有效性，我进行了实证研究",
    "tldr": "结构向量自回归中使用基于更高阶矩的广义矩方法存在两个问题：不稳定的估计和不准确的推断、小样本中对方差小的创新的缩放偏差。 作者提出了解决方案，包括利用独立结构冲击的假设来估计加权矩阵和估计器的方差，并将持续更新的缩放项纳入加权矩阵中，以消除缩放偏差。",
    "en_tdlr": "In structural vector autoregressions, using generalized method of moments estimators based on higher moments poses two challenges: unstable estimates and inaccurate inference, as well as scaling bias towards innovations with smaller variance in small samples. The proposed solutions include utilizing independent structural shocks to estimate the weighting matrix and variance, and incorporating a continuously updated scaling term into the weighting matrix to eliminate the scaling bias."
}