{
    "title": "Deep learning soliton dynamics and complex potentials recognition for 1D and 2D PT-symmetric saturable nonlinear Schr\\\"odinger equations. (arXiv:2310.02276v1 [nlin.PS])",
    "abstract": "In this paper, we firstly extend the physics-informed neural networks (PINNs) to learn data-driven stationary and non-stationary solitons of 1D and 2D saturable nonlinear Schr\\\"odinger equations (SNLSEs) with two fundamental PT-symmetric Scarf-II and periodic potentials in optical fibers. Secondly, the data-driven inverse problems are studied for PT-symmetric potential functions discovery rather than just potential parameters in the 1D and 2D SNLSEs. Particularly, we propose a modified PINNs (mPINNs) scheme to identify directly the PT potential functions of the 1D and 2D SNLSEs by the solution data. And the inverse problems about 1D and 2D PT -symmetric potentials depending on propagation distance z are also investigated using mPINNs method. We also identify the potential functions by the PINNs applied to the stationary equation of the SNLSE. Furthermore, two network structures are compared under different parameter conditions such that the predicted PT potentials can achieve the simil",
    "link": "http://arxiv.org/abs/2310.02276",
    "context": "Title: Deep learning soliton dynamics and complex potentials recognition for 1D and 2D PT-symmetric saturable nonlinear Schr\\\"odinger equations. (arXiv:2310.02276v1 [nlin.PS])\nAbstract: In this paper, we firstly extend the physics-informed neural networks (PINNs) to learn data-driven stationary and non-stationary solitons of 1D and 2D saturable nonlinear Schr\\\"odinger equations (SNLSEs) with two fundamental PT-symmetric Scarf-II and periodic potentials in optical fibers. Secondly, the data-driven inverse problems are studied for PT-symmetric potential functions discovery rather than just potential parameters in the 1D and 2D SNLSEs. Particularly, we propose a modified PINNs (mPINNs) scheme to identify directly the PT potential functions of the 1D and 2D SNLSEs by the solution data. And the inverse problems about 1D and 2D PT -symmetric potentials depending on propagation distance z are also investigated using mPINNs method. We also identify the potential functions by the PINNs applied to the stationary equation of the SNLSE. Furthermore, two network structures are compared under different parameter conditions such that the predicted PT potentials can achieve the simil",
    "path": "papers/23/10/2310.02276.json",
    "total_tokens": 939,
    "translated_title": "深度学习饱和非线性薛定谔方程中的孤子动力学和复杂势识别",
    "translated_abstract": "本文首先将物理信息神经网络(PINNs)扩展到学习光纤中具有两种基本的PT对称Scarf-II势和周期势的一维和二维饱和非线性薛定谔方程(SNLSEs)的数据驱动平稳和非平稳孤子。其次，研究了PT对称势函数的数据驱动逆问题，而不仅仅是一维和二维SNLSEs中的势参数。特别地，我们提出了一种改进的PINNs(mPINNs)方案，通过解决数据直接识别一维和二维SNLSEs的PT势函数。而且还利用mPINNs方法研究了关于传播距离z的一维和二维PT对称势的逆问题。我们还通过将PINNs应用于SNLSE的平稳方程来识别势函数。此外，在不同参数条件下比较了两种网络结构，以使预测的PT势能达到相似程度。",
    "tldr": "本文利用深度学习方法扩展了物理信息神经网络(PINNs)来学习1D和2D饱和非线性薛定谔方程中的孤子动力学和复杂势识别。该方法还能解决PT对称势函数的逆问题，并进行了与传播距离z相关的1D和2D PT对称势的识别。"
}