{
    "title": "Active Learning Framework for Cost-Effective TCR-Epitope Binding Affinity Prediction. (arXiv:2310.10893v1 [q-bio.QM])",
    "abstract": "T cell receptors (TCRs) are critical components of adaptive immune systems, responsible for responding to threats by recognizing epitope sequences presented on host cell surface. Computational prediction of binding affinity between TCRs and epitope sequences using machine/deep learning has attracted intense attention recently. However, its success is hindered by the lack of large collections of annotated TCR-epitope pairs. Annotating their binding affinity requires expensive and time-consuming wet-lab evaluation. To reduce annotation cost, we present ActiveTCR, a framework that incorporates active learning and TCR-epitope binding affinity prediction models. Starting with a small set of labeled training pairs, ActiveTCR iteratively searches for unlabeled TCR-epitope pairs that are ''worth'' for annotation. It aims to maximize performance gains while minimizing the cost of annotation. We compared four query strategies with a random sampling baseline and demonstrated that ActiveTCR reduce",
    "link": "http://arxiv.org/abs/2310.10893",
    "context": "Title: Active Learning Framework for Cost-Effective TCR-Epitope Binding Affinity Prediction. (arXiv:2310.10893v1 [q-bio.QM])\nAbstract: T cell receptors (TCRs) are critical components of adaptive immune systems, responsible for responding to threats by recognizing epitope sequences presented on host cell surface. Computational prediction of binding affinity between TCRs and epitope sequences using machine/deep learning has attracted intense attention recently. However, its success is hindered by the lack of large collections of annotated TCR-epitope pairs. Annotating their binding affinity requires expensive and time-consuming wet-lab evaluation. To reduce annotation cost, we present ActiveTCR, a framework that incorporates active learning and TCR-epitope binding affinity prediction models. Starting with a small set of labeled training pairs, ActiveTCR iteratively searches for unlabeled TCR-epitope pairs that are ''worth'' for annotation. It aims to maximize performance gains while minimizing the cost of annotation. We compared four query strategies with a random sampling baseline and demonstrated that ActiveTCR reduce",
    "path": "papers/23/10/2310.10893.json",
    "total_tokens": 921,
    "translated_title": "高效TCR-表位结合亲和力预测的主动学习框架",
    "translated_abstract": "T细胞受体（TCR）是适应性免疫系统的关键组成部分，负责通过识别寄主细胞表面呈现的表位序列来应对威胁。最近，使用机器学习/深度学习来预测TCR和表位序列之间的结合亲和力引起了广泛关注。然而，其成功受到缺乏大量已注释的TCR-表位对的限制。注释它们的结合亲和力需要昂贵且耗时的湿实验评估。为了降低注释成本，我们提出了ActiveTCR，一个结合主动学习和TCR-表位结合亲和力预测模型的框架。ActiveTCR从一小组标记的训练对开始，迭代地搜索值得注释的未标记TCR-表位对。它旨在最大化性能提升，同时最小化注释成本。我们将四种查询策略与随机抽样基准进行了比较，并证明ActiveTCR能够降低注释成本。",
    "tldr": "本研究提出了一个高效的TCR-表位结合亲和力预测的主动学习框架ActiveTCR，通过最小化注释成本并最大化性能提升，有效降低了预测过程的成本。"
}