{
    "title": "Handover Protocol Learning for LEO Satellite Networks: Access Delay and Collision Minimization. (arXiv:2310.20215v1 [cs.IT])",
    "abstract": "This study presents a novel deep reinforcement learning (DRL)-based handover (HO) protocol, called DHO, specifically designed to address the persistent challenge of long propagation delays in low-Earth orbit (LEO) satellite networks' HO procedures. DHO skips the Measurement Report (MR) in the HO procedure by leveraging its predictive capabilities after being trained with a pre-determined LEO satellite orbital pattern. This simplification eliminates the propagation delay incurred during the MR phase, while still providing effective HO decisions. The proposed DHO outperforms the legacy HO protocol across diverse network conditions in terms of access delay, collision rate, and handover success rate, demonstrating the practical applicability of DHO in real-world networks. Furthermore, the study examines the trade-off between access delay and collision rate and also evaluates the training performance and convergence of DHO using various DRL algorithms.",
    "link": "http://arxiv.org/abs/2310.20215",
    "context": "Title: Handover Protocol Learning for LEO Satellite Networks: Access Delay and Collision Minimization. (arXiv:2310.20215v1 [cs.IT])\nAbstract: This study presents a novel deep reinforcement learning (DRL)-based handover (HO) protocol, called DHO, specifically designed to address the persistent challenge of long propagation delays in low-Earth orbit (LEO) satellite networks' HO procedures. DHO skips the Measurement Report (MR) in the HO procedure by leveraging its predictive capabilities after being trained with a pre-determined LEO satellite orbital pattern. This simplification eliminates the propagation delay incurred during the MR phase, while still providing effective HO decisions. The proposed DHO outperforms the legacy HO protocol across diverse network conditions in terms of access delay, collision rate, and handover success rate, demonstrating the practical applicability of DHO in real-world networks. Furthermore, the study examines the trade-off between access delay and collision rate and also evaluates the training performance and convergence of DHO using various DRL algorithms.",
    "path": "papers/23/10/2310.20215.json",
    "total_tokens": 932,
    "translated_title": "LEO卫星网络的切换协议学习：访问延迟和碰撞最小化",
    "translated_abstract": "本研究介绍了一种新颖的基于深度强化学习 (DRL) 的切换 (HO) 协议，称为DHO，专门针对低轨道卫星网络的长传播延迟所带来的挑战。DHO在预定的LEO卫星轨迹模式下进行训练，在HO过程中利用其预测能力跳过测量报告(MR)阶段，简化了过程并消除了MR阶段产生的传播延迟，同时仍能提供有效的HO决策。所提出的DHO在不同网络条件下表现优于传统HO协议，包括访问延迟、碰撞率和切换成功率，展示了DHO在实际网络中的实际适用性。此外，本研究还探讨了访问延迟和碰撞率之间的平衡，并评估了使用各种DRL算法对DHO进行训练的性能和收敛性。",
    "tldr": "本研究提出了一种面向LEO卫星网络的深度强化学习切换协议(DHO)，通过预测能力跳过测量报告阶段，简化切换过程并消除访问延迟，同时在网络条件下表现优越，展示了实际应用价值。",
    "en_tdlr": "This study proposes a deep reinforcement learning-based handover protocol (DHO) for LEO satellite networks, which simplifies the handover process and eliminates access delay by leveraging predictive capabilities and skipping the measurement report phase. The DHO outperforms the conventional handover protocol and demonstrates practical applicability in real-world networks."
}