{
    "title": "The Power of Simple Menus in Robust Selling Mechanisms. (arXiv:2310.17392v1 [econ.TH])",
    "abstract": "We study a robust selling problem where a seller attempts to sell one item to a buyer but is uncertain about the buyer's valuation distribution. Existing literature indicates that robust mechanism design provides a stronger theoretical guarantee than robust deterministic pricing. Meanwhile, the superior performance of robust mechanism design comes at the expense of implementation complexity given that the seller offers a menu with an infinite number of options, each coupled with a lottery and a payment for the buyer's selection. In view of this, the primary focus of our research is to find simple selling mechanisms that can effectively hedge against market ambiguity. We show that a selling mechanism with a small menu size (or limited randomization across a finite number of prices) is already capable of deriving significant benefits achieved by the optimal robust mechanism with infinite options. In particular, we develop a general framework to study the robust selling mechanism problem ",
    "link": "http://arxiv.org/abs/2310.17392",
    "context": "Title: The Power of Simple Menus in Robust Selling Mechanisms. (arXiv:2310.17392v1 [econ.TH])\nAbstract: We study a robust selling problem where a seller attempts to sell one item to a buyer but is uncertain about the buyer's valuation distribution. Existing literature indicates that robust mechanism design provides a stronger theoretical guarantee than robust deterministic pricing. Meanwhile, the superior performance of robust mechanism design comes at the expense of implementation complexity given that the seller offers a menu with an infinite number of options, each coupled with a lottery and a payment for the buyer's selection. In view of this, the primary focus of our research is to find simple selling mechanisms that can effectively hedge against market ambiguity. We show that a selling mechanism with a small menu size (or limited randomization across a finite number of prices) is already capable of deriving significant benefits achieved by the optimal robust mechanism with infinite options. In particular, we develop a general framework to study the robust selling mechanism problem ",
    "path": "papers/23/10/2310.17392.json",
    "total_tokens": 876,
    "translated_title": "简单菜单在稳健销售机制中的力量",
    "translated_abstract": "我们研究了一个稳健销售问题，其中卖方试图将一个物品卖给一个买方，但对买方的估值分布存在不确定性。现有文献表明，稳健机制设计比稳健确定性定价提供了更强的理论保证。同时，稳健机制设计的卓越性能以卖方提供具有无限选项的菜单，每个选项与抽奖和买方选择的付款方式相配。鉴于此，我们的研究的主要重点是寻找可以有效对冲市场模糊性的简单销售机制。我们表明，一个具有小菜单大小（或有限数量的价格随机化）的销售机制已经能够获得无限选项的最优稳健机制所实现的显著效益。特别是，我们发展了一个通用框架来研究稳健销售机制问题。",
    "tldr": "本研究致力于寻找简单的销售机制，以有效对冲市场模糊性。我们发现，只有有限数量的价格随机化的销售机制已经能够获得无限选项的最优稳健机制所实现的显著效益。",
    "en_tdlr": "This research aims to find simple selling mechanisms that can effectively hedge against market ambiguity. We show that a selling mechanism with a small menu size and limited randomization in prices is already capable of deriving significant benefits achieved by the optimal robust mechanism with infinite options."
}