{
    "title": "Urban Drone Navigation: Autoencoder Learning Fusion for Aerodynamics. (arXiv:2310.08830v1 [cs.RO])",
    "abstract": "Drones are vital for urban emergency search and rescue (SAR) due to the challenges of navigating dynamic environments with obstacles like buildings and wind. This paper presents a method that combines multi-objective reinforcement learning (MORL) with a convolutional autoencoder to improve drone navigation in urban SAR. The approach uses MORL to achieve multiple goals and the autoencoder for cost-effective wind simulations. By utilizing imagery data of urban layouts, the drone can autonomously make navigation decisions, optimize paths, and counteract wind effects without traditional sensors. Tested on a New York City model, this method enhances drone SAR operations in complex urban settings.",
    "link": "http://arxiv.org/abs/2310.08830",
    "context": "Title: Urban Drone Navigation: Autoencoder Learning Fusion for Aerodynamics. (arXiv:2310.08830v1 [cs.RO])\nAbstract: Drones are vital for urban emergency search and rescue (SAR) due to the challenges of navigating dynamic environments with obstacles like buildings and wind. This paper presents a method that combines multi-objective reinforcement learning (MORL) with a convolutional autoencoder to improve drone navigation in urban SAR. The approach uses MORL to achieve multiple goals and the autoencoder for cost-effective wind simulations. By utilizing imagery data of urban layouts, the drone can autonomously make navigation decisions, optimize paths, and counteract wind effects without traditional sensors. Tested on a New York City model, this method enhances drone SAR operations in complex urban settings.",
    "path": "papers/23/10/2310.08830.json",
    "total_tokens": 840,
    "translated_title": "城市无人机导航：自动编码器学习与空气动力学融合",
    "translated_abstract": "由于在动态环境中以及存在建筑物和风等障碍物的挑战，无人机对于城市紧急搜索和救援（SAR）至关重要。本文提出了一种将多目标强化学习（MORL）与卷积自动编码器相结合的方法，以改进城市SAR中的无人机导航。该方法利用MORL实现多个目标，并利用自动编码器进行成本效益的风模拟。通过利用城市布局的图像数据，无人机可以自主做出导航决策，优化路径，并抵消传统传感器无法解决的风效应。在纽约市模型上进行测试，该方法提高了无人机在复杂城市环境中的SAR操作。",
    "tldr": "本文提出了一种将多目标强化学习与卷积自动编码器相结合的方法，用于改进城市无人机在紧急搜索和救援中的导航能力。该方法通过利用城市布局图像数据，使无人机能够自主决策导航、优化路径并抵抗风效应，并在复杂的城市环境中提高了救援操作。",
    "en_tdlr": "This paper proposes a method that combines multi-objective reinforcement learning with a convolutional autoencoder to improve the navigation capability of urban drones in emergency search and rescue. By utilizing urban layout imagery data, the drones can autonomously make navigation decisions, optimize paths, and counteract wind effects, enhancing rescue operations in complex urban environments."
}