{
    "title": "Personalized identification, prediction, and stimulation of neural oscillations via data-driven models of epileptic network dynamics. (arXiv:2310.13480v1 [q-bio.NC])",
    "abstract": "Neural oscillations are considered to be brain-specific signatures of information processing and communication in the brain. They also reflect pathological brain activity in neurological disorders, thus offering a basis for diagnoses and forecasting. Epilepsy is one of the most common neurological disorders, characterized by abnormal synchronization and desynchronization of the oscillations in the brain. About one third of epilepsy cases are pharmacoresistant, and as such emphasize the need for novel therapy approaches, where brain stimulation appears to be a promising therapeutic option. The development of brain stimulation paradigms, however, is often based on generalized assumptions about brain dynamics, although it is known that significant differences occur between patients and brain states. We developed a framework to extract individualized predictive models of epileptic network dynamics directly from EEG data. The models are based on the dominant coherent oscillations and their ",
    "link": "http://arxiv.org/abs/2310.13480",
    "context": "Title: Personalized identification, prediction, and stimulation of neural oscillations via data-driven models of epileptic network dynamics. (arXiv:2310.13480v1 [q-bio.NC])\nAbstract: Neural oscillations are considered to be brain-specific signatures of information processing and communication in the brain. They also reflect pathological brain activity in neurological disorders, thus offering a basis for diagnoses and forecasting. Epilepsy is one of the most common neurological disorders, characterized by abnormal synchronization and desynchronization of the oscillations in the brain. About one third of epilepsy cases are pharmacoresistant, and as such emphasize the need for novel therapy approaches, where brain stimulation appears to be a promising therapeutic option. The development of brain stimulation paradigms, however, is often based on generalized assumptions about brain dynamics, although it is known that significant differences occur between patients and brain states. We developed a framework to extract individualized predictive models of epileptic network dynamics directly from EEG data. The models are based on the dominant coherent oscillations and their ",
    "path": "papers/23/10/2310.13480.json",
    "total_tokens": 919,
    "translated_title": "个性化识别、预测和刺激神经振荡：基于数据驱动的癫痫网络动力学模型",
    "translated_abstract": "神经振荡被认为是大脑信息处理和传递的特定标志，也反映了神经系统疾病中的病理活动，为诊断和预测提供了基础。癫痫是最常见的神经系统疾病之一，其特征是大脑振荡的异常同步和失同步。约三分之一的癫痫病例对药物治疗无效，因此需要创新治疗方法，其中大脑刺激似乎是一种有希望的治疗选择。然而，大脑刺激范式的发展往往基于对大脑动态的概括假设，尽管已知患者和脑状态之间存在显著差异。我们开发了一个框架，可以直接从脑电图数据中提取个体化的癫痫网络动力学预测模型。这些模型基于主要的相干振荡及其",
    "tldr": "该论文研究了从脑电图数据中提取个体化的癫痫网络动力学模型，应用于个性化识别、预测和刺激神经振荡，为癫痫治疗提供了有前景的疗法选择。",
    "en_tdlr": "This paper investigates the extraction of individualized predictive models of epileptic network dynamics from EEG data, which is applied for personalized identification, prediction, and stimulation of neural oscillations, offering a promising therapeutic option for epilepsy treatment."
}