{
    "title": "CAD: Clustering And Deep Reinforcement Learning Based Multi-Period Portfolio Management Strategy. (arXiv:2310.01319v1 [q-fin.PM])",
    "abstract": "In this paper, we present a novel trading strategy that integrates reinforcement learning methods with clustering techniques for portfolio management in multi-period trading. Specifically, we leverage the clustering method to categorize stocks into various clusters based on their financial indices. Subsequently, we utilize the algorithm Asynchronous Advantage Actor-Critic to determine the trading actions for stocks within each cluster. Finally, we employ the algorithm DDPG to generate the portfolio weight vector, which decides the amount of stocks to buy, sell, or hold according to the trading actions of different clusters. To the best of our knowledge, our approach is the first to combine clustering methods and reinforcement learning methods for portfolio management in the context of multi-period trading.  Our proposed strategy is evaluated using a series of back-tests on four datasets, comprising a of 800 stocks, obtained from the Shanghai Stock Exchange and National Association of S",
    "link": "http://arxiv.org/abs/2310.01319",
    "context": "Title: CAD: Clustering And Deep Reinforcement Learning Based Multi-Period Portfolio Management Strategy. (arXiv:2310.01319v1 [q-fin.PM])\nAbstract: In this paper, we present a novel trading strategy that integrates reinforcement learning methods with clustering techniques for portfolio management in multi-period trading. Specifically, we leverage the clustering method to categorize stocks into various clusters based on their financial indices. Subsequently, we utilize the algorithm Asynchronous Advantage Actor-Critic to determine the trading actions for stocks within each cluster. Finally, we employ the algorithm DDPG to generate the portfolio weight vector, which decides the amount of stocks to buy, sell, or hold according to the trading actions of different clusters. To the best of our knowledge, our approach is the first to combine clustering methods and reinforcement learning methods for portfolio management in the context of multi-period trading.  Our proposed strategy is evaluated using a series of back-tests on four datasets, comprising a of 800 stocks, obtained from the Shanghai Stock Exchange and National Association of S",
    "path": "papers/23/10/2310.01319.json",
    "total_tokens": 981,
    "translated_title": "CAD: 基于聚类和深度强化学习的多期投资组合管理策略",
    "translated_abstract": "本文提出了一种新颖的交易策略，将强化学习方法与聚类技术相结合，用于多期交易中的投资组合管理。具体而言，我们利用聚类方法将股票根据其财务指标分为不同的簇群。随后，我们利用异步优势演员-评论家算法来确定每个簇群内股票的交易行为。最后，我们采用DDPG算法生成组合权重向量，根据不同簇群的交易行为决定购买、卖出或持有的股票数量。据我们所知，我们的方法是第一个在多期交易背景下将聚类方法和强化学习方法结合起来应用于投资组合管理的方法。我们提出的策略在从上海证券交易所和全国证券经营者协会获得的包含800只股票的四个数据集上进行了一系列回测评估。",
    "tldr": "本文提出了一种新颖的投资组合管理策略，将聚类方法和强化学习方法相结合，应用于多期交易。通过将股票进行聚类并根据其财务指标进行分类，在每个簇群内使用强化学习算法确定交易行为，并通过DDPG算法生成组合权重向量。在四个包含800只股票的数据集上进行的回测评估表明，该策略在多期交易中取得了良好的效果。",
    "en_tdlr": "This paper proposes a novel portfolio management strategy that combines clustering methods and reinforcement learning methods for multi-period trading. The strategy categorizes stocks into clusters based on their financial indices and utilizes reinforcement learning algorithms to determine trading actions within each cluster. The results of back-tests on four datasets comprising 800 stocks show that the proposed strategy achieves good performance in multi-period trading."
}