{
    "title": "Bayesian Quality-Diversity approaches for constrained optimization problems with mixed continuous, discrete and categorical variables. (arXiv:2310.05955v1 [math.OC])",
    "abstract": "Complex engineering design problems, such as those involved in aerospace, civil, or energy engineering, require the use of numerically costly simulation codes in order to predict the behavior and performance of the system to be designed. To perform the design of the systems, these codes are often embedded into an optimization process to provide the best design while satisfying the design constraints. Recently, new approaches, called Quality-Diversity, have been proposed in order to enhance the exploration of the design space and to provide a set of optimal diversified solutions with respect to some feature functions. These functions are interesting to assess trade-offs. Furthermore, complex engineering design problems often involve mixed continuous, discrete, and categorical design variables allowing to take into account technological choices in the optimization problem. In this paper, a new Quality-Diversity methodology based on mixed continuous, discrete and categorical Bayesian opti",
    "link": "http://arxiv.org/abs/2310.05955",
    "context": "Title: Bayesian Quality-Diversity approaches for constrained optimization problems with mixed continuous, discrete and categorical variables. (arXiv:2310.05955v1 [math.OC])\nAbstract: Complex engineering design problems, such as those involved in aerospace, civil, or energy engineering, require the use of numerically costly simulation codes in order to predict the behavior and performance of the system to be designed. To perform the design of the systems, these codes are often embedded into an optimization process to provide the best design while satisfying the design constraints. Recently, new approaches, called Quality-Diversity, have been proposed in order to enhance the exploration of the design space and to provide a set of optimal diversified solutions with respect to some feature functions. These functions are interesting to assess trade-offs. Furthermore, complex engineering design problems often involve mixed continuous, discrete, and categorical design variables allowing to take into account technological choices in the optimization problem. In this paper, a new Quality-Diversity methodology based on mixed continuous, discrete and categorical Bayesian opti",
    "path": "papers/23/10/2310.05955.json",
    "total_tokens": 816,
    "translated_title": "贝叶斯质量多样性方法用于混合连续、离散和分类变量的约束优化问题",
    "translated_abstract": "复杂的工程设计问题通常涉及到使用费时的模拟代码来预测待设计系统的行为和性能。为了进行系统设计，这些代码经常嵌入到优化过程中来提供最佳设计方案，同时满足设计约束条件。最近，提出了一种新的质量多样性方法，旨在增强设计空间的探索能力，并提供一组具有多样性性质的最优解集，以评估权衡。此外，复杂的工程设计问题通常涉及到混合连续、离散和分类的设计变量，以考虑在优化问题中的技术选择。本文提出了一种基于混合连续、离散和分类贝叶斯优化的新型质量多样性方法。",
    "tldr": "本论文提出了一种基于贝叶斯优化的新型质量多样性方法，用于解决混合连续、离散和分类变量的约束优化问题，旨在提供具有多样性性质的最优解集。"
}