{
    "title": "Active Learning on Neural Networks through Interactive Generation of Digit Patterns and Visual Representation. (arXiv:2310.01580v1 [cs.HC])",
    "abstract": "Artificial neural networks (ANNs) have been broadly utilized to analyze various data and solve different domain problems. However, neural networks (NNs) have been considered a black box operation for years because their underlying computation and meaning are hidden. Due to this nature, users often face difficulties in interpreting the underlying mechanism of the NNs and the benefits of using them. In this paper, to improve users' learning and understanding of NNs, an interactive learning system is designed to create digit patterns and recognize them in real time. To help users clearly understand the visual differences of digit patterns (i.e., 0 ~ 9) and their results with an NN, integrating visualization is considered to present all digit patterns in a two-dimensional display space with supporting multiple user interactions. An evaluation with multiple datasets is conducted to determine its usability for active learning. In addition, informal user testing is managed during a summer wor",
    "link": "http://arxiv.org/abs/2310.01580",
    "context": "Title: Active Learning on Neural Networks through Interactive Generation of Digit Patterns and Visual Representation. (arXiv:2310.01580v1 [cs.HC])\nAbstract: Artificial neural networks (ANNs) have been broadly utilized to analyze various data and solve different domain problems. However, neural networks (NNs) have been considered a black box operation for years because their underlying computation and meaning are hidden. Due to this nature, users often face difficulties in interpreting the underlying mechanism of the NNs and the benefits of using them. In this paper, to improve users' learning and understanding of NNs, an interactive learning system is designed to create digit patterns and recognize them in real time. To help users clearly understand the visual differences of digit patterns (i.e., 0 ~ 9) and their results with an NN, integrating visualization is considered to present all digit patterns in a two-dimensional display space with supporting multiple user interactions. An evaluation with multiple datasets is conducted to determine its usability for active learning. In addition, informal user testing is managed during a summer wor",
    "path": "papers/23/10/2310.01580.json",
    "total_tokens": 922,
    "translated_title": "通过交互生成数字模式和视觉表示在神经网络上进行主动学习",
    "translated_abstract": "人工神经网络(ANNs)广泛用于分析各种数据和解决不同领域的问题。然而，神经网络(NNs)长期以来被认为是一个黑匣子操作，因为它们的底层计算和含义是隐藏的。由于这种特性，用户经常面临难以解释NNs底层机制和使用它们的好处的困难。本文设计了一个交互式学习系统，通过实时创建数字模式和识别它们来提高用户对NNs的学习和理解。为了帮助用户清楚地理解数字模式(即0~9)以及它们与NN的结果的视觉差异，考虑将可视化集成到一个二维显示空间中，并支持多种用户交互。通过对多个数据集进行评估，确定其在主动学习中的可用性。此外，在夏季工作期间进行了非正式的用户测试。",
    "tldr": "本文设计了一个交互式学习系统，通过实时创建数字模式和识别它们来提高用户对神经网络的学习和理解。通过集成可视化和多种用户交互，帮助用户清楚地理解数字模式和它们与神经网络结果的视觉差异。评估结果表明该系统在主动学习中具有可用性。",
    "en_tdlr": "This paper presents an interactive learning system that improves users' learning and understanding of neural networks by creating digit patterns in real time. By integrating visualization and multiple user interactions, the system helps users to clearly understand the visual differences of digit patterns and their results with neural networks. Evaluation results indicate the system's usability for active learning."
}