{
    "title": "CLASSify: A Web-Based Tool for Machine Learning. (arXiv:2310.03618v1 [cs.LG])",
    "abstract": "Machine learning classification problems are widespread in bioinformatics, but the technical knowledge required to perform model training, optimization, and inference can prevent researchers from utilizing this technology. This article presents an automated tool for machine learning classification problems to simplify the process of training models and producing results while providing informative visualizations and insights into the data. This tool supports both binary and multiclass classification problems, and it provides access to a variety of models and methods. Synthetic data can be generated within the interface to fill missing values, balance class labels, or generate entirely new datasets. It also provides support for feature evaluation and generates explainability scores to indicate which features influence the output the most. We present CLASSify, an open-source tool for simplifying the user experience of solving classification problems without the need for knowledge of mach",
    "link": "http://arxiv.org/abs/2310.03618",
    "context": "Title: CLASSify: A Web-Based Tool for Machine Learning. (arXiv:2310.03618v1 [cs.LG])\nAbstract: Machine learning classification problems are widespread in bioinformatics, but the technical knowledge required to perform model training, optimization, and inference can prevent researchers from utilizing this technology. This article presents an automated tool for machine learning classification problems to simplify the process of training models and producing results while providing informative visualizations and insights into the data. This tool supports both binary and multiclass classification problems, and it provides access to a variety of models and methods. Synthetic data can be generated within the interface to fill missing values, balance class labels, or generate entirely new datasets. It also provides support for feature evaluation and generates explainability scores to indicate which features influence the output the most. We present CLASSify, an open-source tool for simplifying the user experience of solving classification problems without the need for knowledge of mach",
    "path": "papers/23/10/2310.03618.json",
    "total_tokens": 880,
    "translated_title": "CLASSify: 一个用于机器学习的基于Web的工具",
    "translated_abstract": "在生物信息学中，机器学习分类问题很常见，但执行模型训练、优化和推理所需的技术知识可能会阻止研究人员利用这项技术。本文介绍了一个自动化的机器学习分类问题工具，简化了模型训练和结果生成的过程，同时提供信息丰富的可视化和对数据的深入洞察。该工具支持二元和多类分类问题，并提供多种模型和方法的访问。在界面内可以生成合成数据来填补缺失值、平衡类别标签或生成全新的数据集。它还支持特征评估，并生成解释性得分来指示哪些特征对输出影响最大。本文介绍了CLASSify，一个开源工具，简化了解决分类问题的用户体验，无需了解机器学习知识。",
    "tldr": "CLASSify是一个基于Web的机器学习工具，能够简化生物信息学中的分类问题的解决过程。它提供了自动化模型训练和结果生成，可视化和数据洞察功能，支持二元和多类分类问题，并提供多种模型和方法的访问。它还能生成合成数据，支持特征评估和解释性得分分析。",
    "en_tdlr": "CLASSify is a web-based machine learning tool that simplifies the process of solving classification problems in bioinformatics. It automates model training and result generation, provides visualizations and data insights, supports both binary and multiclass classification, and offers access to multiple models and methods. It also includes synthetic data generation, feature evaluation, and explainability scores analysis."
}