{
    "title": "Detecting Electricity Service Equity Issues with Transfer Counterfactual Learning on Large-Scale Outage Datasets. (arXiv:2310.03258v1 [cs.LG])",
    "abstract": "Energy justice is a growing area of interest in interdisciplinary energy research. However, identifying systematic biases in the energy sector remains challenging due to confounding variables, intricate heterogeneity in treatment effects, and limited data availability. To address these challenges, we introduce a novel approach for counterfactual causal analysis centered on energy justice. We use subgroup analysis to manage diverse factors and leverage the idea of transfer learning to mitigate data scarcity in each subgroup. In our numerical analysis, we apply our method to a large-scale customer-level power outage data set and investigate the counterfactual effect of demographic factors, such as income and age of the population, on power outage durations. Our results indicate that low-income and elderly-populated areas consistently experience longer power outages, regardless of weather conditions. This points to existing biases in the power system and highlights the need for focused im",
    "link": "http://arxiv.org/abs/2310.03258",
    "context": "Title: Detecting Electricity Service Equity Issues with Transfer Counterfactual Learning on Large-Scale Outage Datasets. (arXiv:2310.03258v1 [cs.LG])\nAbstract: Energy justice is a growing area of interest in interdisciplinary energy research. However, identifying systematic biases in the energy sector remains challenging due to confounding variables, intricate heterogeneity in treatment effects, and limited data availability. To address these challenges, we introduce a novel approach for counterfactual causal analysis centered on energy justice. We use subgroup analysis to manage diverse factors and leverage the idea of transfer learning to mitigate data scarcity in each subgroup. In our numerical analysis, we apply our method to a large-scale customer-level power outage data set and investigate the counterfactual effect of demographic factors, such as income and age of the population, on power outage durations. Our results indicate that low-income and elderly-populated areas consistently experience longer power outages, regardless of weather conditions. This points to existing biases in the power system and highlights the need for focused im",
    "path": "papers/23/10/2310.03258.json",
    "total_tokens": 913,
    "translated_title": "利用大规模停电数据集上的转移反事实学习，检测电力服务公平性问题",
    "translated_abstract": "能源公正是跨学科能源研究的一个不断发展的领域。然而，由于混淆变量、治疗效应的复杂异质性和有限的数据可用性，识别能源部门中的系统偏见仍然具有挑战性。为了解决这些挑战，我们引入了一种围绕能源公正的反事实因果分析的新方法。我们使用子组分析来管理各种因素，并利用转移学习的思想来缓解每个子组中的数据稀缺问题。在我们的数值分析中，我们将我们的方法应用于一个大规模的客户级停电数据集，并研究人口因素（如收入和年龄）对停电持续时间的反事实效应。我们的结果表明，低收入和老年人口区域总是经历较长的停电时间，无论天气条件如何。这表明电力系统存在偏见，并强调了专注改善这些问题的需要。",
    "tldr": "通过转移反事实学习的方法，我们在大规模停电数据集上研究了电力服务的公平性问题，发现低收入和老年人口区域经常遭受较长的停电时间，揭示了电力系统中的偏见存在并强调了改善的需求。"
}