{
    "title": "MUSER: A Multi-View Similar Case Retrieval Dataset. (arXiv:2310.15602v1 [cs.CL])",
    "abstract": "Similar case retrieval (SCR) is a representative legal AI application that plays a pivotal role in promoting judicial fairness. However, existing SCR datasets only focus on the fact description section when judging the similarity between cases, ignoring other valuable sections (e.g., the court's opinion) that can provide insightful reasoning process behind. Furthermore, the case similarities are typically measured solely by the textual semantics of the fact descriptions, which may fail to capture the full complexity of legal cases from the perspective of legal knowledge. In this work, we present MUSER, a similar case retrieval dataset based on multi-view similarity measurement and comprehensive legal element with sentence-level legal element annotations. Specifically, we select three perspectives (legal fact, dispute focus, and law statutory) and build a comprehensive and structured label schema of legal elements for each of them, to enable accurate and knowledgeable evaluation of case",
    "link": "http://arxiv.org/abs/2310.15602",
    "context": "Title: MUSER: A Multi-View Similar Case Retrieval Dataset. (arXiv:2310.15602v1 [cs.CL])\nAbstract: Similar case retrieval (SCR) is a representative legal AI application that plays a pivotal role in promoting judicial fairness. However, existing SCR datasets only focus on the fact description section when judging the similarity between cases, ignoring other valuable sections (e.g., the court's opinion) that can provide insightful reasoning process behind. Furthermore, the case similarities are typically measured solely by the textual semantics of the fact descriptions, which may fail to capture the full complexity of legal cases from the perspective of legal knowledge. In this work, we present MUSER, a similar case retrieval dataset based on multi-view similarity measurement and comprehensive legal element with sentence-level legal element annotations. Specifically, we select three perspectives (legal fact, dispute focus, and law statutory) and build a comprehensive and structured label schema of legal elements for each of them, to enable accurate and knowledgeable evaluation of case",
    "path": "papers/23/10/2310.15602.json",
    "total_tokens": 828,
    "translated_title": "MUSER: 一个多视角相似案例检索数据集",
    "translated_abstract": "相似案例检索（SCR）是促进司法公正的典型法律人工智能应用。然而，现有的SCR数据集只关注事实描述部分来判断案例的相似性，忽略了其他有价值的部分（例如法院的意见），这些部分可以提供深入的推理过程。此外，案例的相似度通常只通过事实描述的文本语义来衡量，可能无法从法律知识的角度捕捉到法律案例的全部复杂性。在这项工作中，我们提出了MUSER，这是一个基于Multi-View相似度测量和句子级法律要素注释的相似案例检索数据集。具体而言，我们选择了三个视角（法律事实、争议焦点、法律法规），并为每个视角构建了一个全面和结构化的法律要素标签模式，以实现案例的准确评估和专业知识的考量。",
    "tldr": "MUSER是一个基于多视角相似度测量和句子级法律要素注释的相似案例检索数据集，旨在实现准确评估和专业知识的考量。",
    "en_tdlr": "MUSER is a similar case retrieval dataset based on multi-view similarity measurement and sentence-level legal element annotations, aiming to achieve accurate evaluation and consideration of legal expertise."
}