{
    "title": "Unraveling Fundamental Properties of Power System Resilience Curves using Unsupervised Machine Learning. (arXiv:2310.10030v2 [cs.LG] UPDATED)",
    "abstract": "The standard model of infrastructure resilience, the resilience triangle, has been the primary way of characterizing and quantifying infrastructure resilience. However, the theoretical model merely provides a one-size-fits-all framework for all infrastructure systems. Most of the existing studies examine the characteristics of infrastructure resilience curves based on analytical models constructed upon simulated system performance. Limited empirical studies hindered our ability to fully understand and predict resilience characteristics in infrastructure systems. To address this gap, this study examined over 200 resilience curves related to power outages in three major extreme weather events. Using unsupervised machine learning, we examined different curve archetypes, as well as the fundamental properties of each resilience curve archetype. The results show two primary archetypes for power system resilience curves, triangular, and trapezoidal curves. Triangular curves characterize resil",
    "link": "http://arxiv.org/abs/2310.10030",
    "context": "Title: Unraveling Fundamental Properties of Power System Resilience Curves using Unsupervised Machine Learning. (arXiv:2310.10030v2 [cs.LG] UPDATED)\nAbstract: The standard model of infrastructure resilience, the resilience triangle, has been the primary way of characterizing and quantifying infrastructure resilience. However, the theoretical model merely provides a one-size-fits-all framework for all infrastructure systems. Most of the existing studies examine the characteristics of infrastructure resilience curves based on analytical models constructed upon simulated system performance. Limited empirical studies hindered our ability to fully understand and predict resilience characteristics in infrastructure systems. To address this gap, this study examined over 200 resilience curves related to power outages in three major extreme weather events. Using unsupervised machine learning, we examined different curve archetypes, as well as the fundamental properties of each resilience curve archetype. The results show two primary archetypes for power system resilience curves, triangular, and trapezoidal curves. Triangular curves characterize resil",
    "path": "papers/23/10/2310.10030.json",
    "total_tokens": 943,
    "translated_title": "使用无监督机器学习揭示电力系统恢复曲线的基本特性",
    "translated_abstract": "基础设施恢复的标准模型——恢复三角，一直是表征和量化基础设施恢复能力的主要方式。然而，这个理论模型只提供了一个适用于所有基础设施系统的框架。现有研究大部分是基于模拟系统性能构建的分析模型来研究基础设施恢复曲线的特征。有限的实证研究限制了我们全面理解和预测基础设施系统的恢复特性的能力。为了填补这一空白，本研究考察了与三次重大极端天气事件中断电有关的200多个恢复曲线。通过无监督机器学习，我们研究了不同曲线原型以及每个恢复曲线原型的基本特性。结果显示，电力系统恢复曲线存在两种主要原型：三角形曲线和梯形曲线。三角形曲线表征了恢复过程的快速恢复，而梯形曲线表示了\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t恢复过程的逐步恢复。",
    "tldr": "本研究使用无监督机器学习对电力系统的恢复曲线进行了研究，发现了两种主要的恢复曲线原型：三角形曲线和梯形曲线，分别表征了快速恢复和逐步恢复的恢复过程。",
    "en_tdlr": "This study used unsupervised machine learning to examine power system resilience curves and identified two primary archetypes: triangular curves and trapezoidal curves, which represent rapid recovery and gradual recovery of the resilience process, respectively."
}