{
    "title": "Semantic-Forward Relaying: A Novel Framework Towards 6G Cooperative Communications. (arXiv:2310.07987v1 [cs.NI])",
    "abstract": "This letter proposes a novel relaying framework, semantic-forward (SF), for cooperative communications towards the sixth-generation (6G) wireless networks. The SF relay extracts and transmits the semantic features, which reduces forwarding payload, and also improves the network robustness against intra-link errors. Based on the theoretical basis for cooperative communications with side information and the turbo principle, we design a joint source-channel coding algorithm to iteratively exchange the extrinsic information for enhancing the decoding gains at the destination. Surprisingly, simulation results indicate that even in bad channel conditions, SF relaying can still effectively improve the recovered information quality.",
    "link": "http://arxiv.org/abs/2310.07987",
    "context": "Title: Semantic-Forward Relaying: A Novel Framework Towards 6G Cooperative Communications. (arXiv:2310.07987v1 [cs.NI])\nAbstract: This letter proposes a novel relaying framework, semantic-forward (SF), for cooperative communications towards the sixth-generation (6G) wireless networks. The SF relay extracts and transmits the semantic features, which reduces forwarding payload, and also improves the network robustness against intra-link errors. Based on the theoretical basis for cooperative communications with side information and the turbo principle, we design a joint source-channel coding algorithm to iteratively exchange the extrinsic information for enhancing the decoding gains at the destination. Surprisingly, simulation results indicate that even in bad channel conditions, SF relaying can still effectively improve the recovered information quality.",
    "path": "papers/23/10/2310.07987.json",
    "total_tokens": 808,
    "translated_title": "语义前向中继：面向6G合作通信的新框架",
    "translated_abstract": "本文提出了一种新的中继框架，语义前向（SF），用于面向第六代（6G）无线网络的合作通信。SF中继提取并传输语义特征，减少了转发负载，并提高了网络对内链路错误的鲁棒性。基于具有辅助信息的合作通信的理论基础和TURBO原理，我们设计了一种联合源信道编码算法，通过迭代交换外在信息来增强目的地的解码增益。令人惊讶的是，仿真结果表明，即使在恶劣的信道条件下，SF中继仍然可以有效地改善恢复的信息质量。",
    "tldr": "该论文提出了一种面向6G合作通信的新中继框架，通过提取传输语义特征减少转发负载，并提高网络的鲁棒性。设计了一种联合源信道编码算法，通过迭代交换外在信息来增强解码增益。仿真结果表明，即使在恶劣的信道条件下，该中继框架仍然可以有效地改善恢复的信息质量。",
    "en_tdlr": "This paper presents a novel relaying framework for cooperative communications in 6G wireless networks, which reduces forwarding payload and improves network robustness. The proposed joint source-channel coding algorithm enhances decoding gains by iteratively exchanging extrinsic information. Simulation results demonstrate its effectiveness even in bad channel conditions."
}