{
    "title": "Kernel-based Joint Multiple Graph Learning and Clustering of Graph Signals. (arXiv:2310.19005v1 [eess.SP] CROSS LISTED)",
    "abstract": "Within the context of Graph Signal Processing (GSP), Graph Learning (GL) is concerned with the inference of a graph's topology from nodal observations, i.e., graph signals. However, data is often in mixed form, relating to different underlying structures. This heterogeneity necessitates the joint clustering and learning of multiple graphs. In many real-life applications, there are available node-side covariates (i.e., kernels) that imperatively should be incorporated, which has not been addressed by the rare graph signal clustering approaches. To this end and inspired by the rich K-means framework, we propose a novel kernel-based algorithm to incorporate this node-side information as we jointly partition the signals and learn a graph for each cluster. Numerical experiments demonstrate its effectiveness over the state-of-the-art.",
    "link": "http://arxiv.org/abs/2310.19005",
    "context": "Title: Kernel-based Joint Multiple Graph Learning and Clustering of Graph Signals. (arXiv:2310.19005v1 [eess.SP] CROSS LISTED)\nAbstract: Within the context of Graph Signal Processing (GSP), Graph Learning (GL) is concerned with the inference of a graph's topology from nodal observations, i.e., graph signals. However, data is often in mixed form, relating to different underlying structures. This heterogeneity necessitates the joint clustering and learning of multiple graphs. In many real-life applications, there are available node-side covariates (i.e., kernels) that imperatively should be incorporated, which has not been addressed by the rare graph signal clustering approaches. To this end and inspired by the rich K-means framework, we propose a novel kernel-based algorithm to incorporate this node-side information as we jointly partition the signals and learn a graph for each cluster. Numerical experiments demonstrate its effectiveness over the state-of-the-art.",
    "path": "papers/23/10/2310.19005.json",
    "total_tokens": 769,
    "translated_title": "基于核的多图信号学习和图信号聚类的联合方法",
    "translated_abstract": "在图信号处理（GSP）的背景下，图学习（GL）研究从节点观测（即图信号）中推断出图的拓扑结构。然而，数据通常是混合形式，涉及不同的基础结构。这种异质性需要联合聚类和学习多个图。在许多实际应用中，有可用的节点侧协变量（即核函数），必须加以合并，而这在现有的图信号聚类方法中尚未解决。为此，受丰富的K-means框架启发，我们提出了一种新的基于核的算法，将节点侧信息整合到信号的分区和每个集群的图学习中。数值实验证明了该方法在现有方法之上的有效性。",
    "tldr": "在图信号处理中，我们提出了一种基于核的联合多图学习和图信号聚类算法，可以有效地将节点侧信息整合到信号的分区和图学习中。",
    "en_tdlr": "We propose a kernel-based algorithm for joint multiple graph learning and graph signal clustering, which effectively incorporates node-side information into signal partitioning and graph learning."
}