{
    "title": "Reinforcement Learning of Display Transfer Robots in Glass Flow Control Systems: A Physical Simulation-Based Approach. (arXiv:2310.07981v1 [cs.LG])",
    "abstract": "A flow control system is a critical concept for increasing the production capacity of manufacturing systems. To solve the scheduling optimization problem related to the flow control with the aim of improving productivity, existing methods depend on a heuristic design by domain human experts. Therefore, the methods require correction, monitoring, and verification by using real equipment. As system designs increase in complexity, the monitoring time increases, which decreases the probability of arriving at the optimal design. As an alternative approach to the heuristic design of flow control systems, the use of deep reinforcement learning to solve the scheduling optimization problem has been considered. Although the existing research on reinforcement learning has yielded excellent performance in some areas, the applicability of the results to actual FAB such as display and semiconductor manufacturing processes is not evident so far. To this end, we propose a method to implement a physica",
    "link": "http://arxiv.org/abs/2310.07981",
    "context": "Title: Reinforcement Learning of Display Transfer Robots in Glass Flow Control Systems: A Physical Simulation-Based Approach. (arXiv:2310.07981v1 [cs.LG])\nAbstract: A flow control system is a critical concept for increasing the production capacity of manufacturing systems. To solve the scheduling optimization problem related to the flow control with the aim of improving productivity, existing methods depend on a heuristic design by domain human experts. Therefore, the methods require correction, monitoring, and verification by using real equipment. As system designs increase in complexity, the monitoring time increases, which decreases the probability of arriving at the optimal design. As an alternative approach to the heuristic design of flow control systems, the use of deep reinforcement learning to solve the scheduling optimization problem has been considered. Although the existing research on reinforcement learning has yielded excellent performance in some areas, the applicability of the results to actual FAB such as display and semiconductor manufacturing processes is not evident so far. To this end, we propose a method to implement a physica",
    "path": "papers/23/10/2310.07981.json",
    "total_tokens": 822,
    "translated_title": "用于玻璃流控制系统中显示转移机器人的强化学习：基于物理仿真的方法",
    "translated_abstract": "流控制系统是增加制造系统产能的关键概念。为了解决与流控制相关的调度优化问题，目前的方法依赖领域人工专家的启发式设计。因此，这些方法需要使用真实设备进行校正、监视和验证。随着系统设计的复杂性增加，监视时间增加，导致达到最佳设计的概率降低。作为启发式流控制系统设计的替代方法，考虑使用深度强化学习来解决调度优化问题。尽管现有的强化学习研究在某些领域的性能表现出色，但其结果在实际的显示和半导体制造过程等实际工厂自动化( FAB)中的适用性尚不明确。为此，我们提出了一种实现物理仿真的方法",
    "tldr": "该论文讨论了使用深度强化学习的方法解决流控制系统调度优化问题的可能性，并提出了一种基于物理仿真的方法来验证该方法的有效性。"
}