{
    "title": "Statistical arbitrage portfolio construction based on preference relations. (arXiv:2310.08284v1 [q-fin.PM])",
    "abstract": "Statistical arbitrage methods identify mispricings in securities with the goal of building portfolios which are weakly correlated with the market. In pairs trading, an arbitrage opportunity is identified by observing relative price movements between a pair of two securities. By simultaneously observing multiple pairs, one can exploit different arbitrage opportunities and increase the performance of such methods. However, the use of a large number of pairs is difficult due to the increased probability of contradictory trade signals among different pairs. In this paper, we propose a novel portfolio construction method based on preference relation graphs, which can reconcile contradictory pairs trading signals across multiple security pairs. The proposed approach enables joint exploitation of arbitrage opportunities among a large number of securities. Experimental results using three decades of historical returns of roughly 500 stocks from the S\\&P 500 index show that the portfolios based",
    "link": "http://arxiv.org/abs/2310.08284",
    "context": "Title: Statistical arbitrage portfolio construction based on preference relations. (arXiv:2310.08284v1 [q-fin.PM])\nAbstract: Statistical arbitrage methods identify mispricings in securities with the goal of building portfolios which are weakly correlated with the market. In pairs trading, an arbitrage opportunity is identified by observing relative price movements between a pair of two securities. By simultaneously observing multiple pairs, one can exploit different arbitrage opportunities and increase the performance of such methods. However, the use of a large number of pairs is difficult due to the increased probability of contradictory trade signals among different pairs. In this paper, we propose a novel portfolio construction method based on preference relation graphs, which can reconcile contradictory pairs trading signals across multiple security pairs. The proposed approach enables joint exploitation of arbitrage opportunities among a large number of securities. Experimental results using three decades of historical returns of roughly 500 stocks from the S\\&P 500 index show that the portfolios based",
    "path": "papers/23/10/2310.08284.json",
    "total_tokens": 817,
    "translated_title": "基于偏好关系的统计套利投资组合构建",
    "translated_abstract": "统计套利方法通过识别证券的错价来构建与市场弱相关的投资组合。在配对交易中，通过观察两个证券之间的相对价格变动来识别套利机会。通过同时观察多个配对，可以利用不同的套利机会并提高这种方法的性能。然而，使用大量配对是困难的，因为不同配对之间存在矛盾的交易信号的概率增加。本文提出了一种基于偏好关系图的新型投资组合构建方法，可以协调多个证券配对之间的矛盾交易信号。所提出的方法可以在大量证券之间共同利用套利机会。使用来自S&P 500指数的约500只股票近30年的历史回报的实验结果表明，基于该方法构建的投资组合可以达到很好的表现。",
    "tldr": "本文提出了一种基于偏好关系图的投资组合构建方法，可以协调多个证券配对之间的矛盾交易信号，并在大量证券之间共同利用套利机会。",
    "en_tdlr": "This paper proposes a portfolio construction method based on preference relation graphs, which reconciles conflicting trading signals among multiple security pairs and exploits arbitrage opportunities among a large number of securities."
}