{
    "title": "Why Do Students Drop Out? University Dropout Prediction and Associated Factor Analysis Using Machine Learning Techniques. (arXiv:2310.10987v1 [cs.LG])",
    "abstract": "Graduation and dropout rates have always been a serious consideration for educational institutions and students. High dropout rates negatively impact both the lives of individual students and institutions. To address this problem, this study examined university dropout prediction using academic, demographic, socioeconomic, and macroeconomic data types. Additionally, we performed associated factor analysis to analyze which type of data would be most influential on the performance of machine learning models in predicting graduation and dropout status. These features were used to train four binary classifiers to determine if students would graduate or drop out. The overall performance of the classifiers in predicting dropout status had an average ROC-AUC score of 0.935. The data type most influential to the model performance was found to be academic data, with the average ROC-AUC score dropping from 0.935 to 0.811 when excluding all academic-related features from the data set. Preliminary",
    "link": "http://arxiv.org/abs/2310.10987",
    "context": "Title: Why Do Students Drop Out? University Dropout Prediction and Associated Factor Analysis Using Machine Learning Techniques. (arXiv:2310.10987v1 [cs.LG])\nAbstract: Graduation and dropout rates have always been a serious consideration for educational institutions and students. High dropout rates negatively impact both the lives of individual students and institutions. To address this problem, this study examined university dropout prediction using academic, demographic, socioeconomic, and macroeconomic data types. Additionally, we performed associated factor analysis to analyze which type of data would be most influential on the performance of machine learning models in predicting graduation and dropout status. These features were used to train four binary classifiers to determine if students would graduate or drop out. The overall performance of the classifiers in predicting dropout status had an average ROC-AUC score of 0.935. The data type most influential to the model performance was found to be academic data, with the average ROC-AUC score dropping from 0.935 to 0.811 when excluding all academic-related features from the data set. Preliminary",
    "path": "papers/23/10/2310.10987.json",
    "total_tokens": 870,
    "translated_title": "为什么学生会辍学？使用机器学习技术进行大学退学预测和相关因素分析",
    "translated_abstract": "毕业率和辍学率一直是教育机构和学生严肃考虑的问题。高辍学率对个人学生和教育机构都有负面影响。为了解决这个问题，本研究使用学术、人口统计、社会经济和宏观经济等多种数据类型进行了大学辍学预测。此外，我们进行了相关因素分析，以分析哪种类型的数据对机器学习模型在预测毕业和辍学状态方面的性能最具影响力。这些特征被用于训练四个二元分类器，以确定学生是否会毕业或辍学。分类器在预测辍学状态方面的整体性能显示出平均ROC-AUC得分为0.935。在排除了所有与学术相关的特征后，平均ROC-AUC得分从0.935降至0.811，表明学术数据是对模型性能最具影响力的数据类型。",
    "tldr": "本研究使用学术、人口统计、社会经济和宏观经济等不同类型的数据进行大学辍学预测，并发现学术数据是对模型性能最具影响力的数据类型。",
    "en_tdlr": "This study used different types of data such as academic, demographic, socioeconomic, and macroeconomic to predict university dropout, and found that academic data was the most influential in predicting dropout status."
}