{
    "title": "The Physics of Preference: Unravelling Imprecision of Human Preferences through Magnetisation Dynamics",
    "abstract": "arXiv:2310.00267v2 Announce Type: replace-cross  Abstract: Paradoxical decision-making behaviours such as preference reversal often arise from imprecise or noisy human preferences. Harnessing the physical principle of magnetisation reversal in ferromagnetic nanostructures, we developed a model that closely reflects human decision-making dynamics. Tested against a spectrum of psychological data, our model adeptly captures the complexities inherent in individual choices. This blend of physics and psychology paves the way for fresh perspectives on understanding the imprecision of human decision-making processes, extending the reach of the current classical and quantum physical models of human behaviour and decision-making.",
    "link": "https://arxiv.org/abs/2310.00267",
    "context": "Title: The Physics of Preference: Unravelling Imprecision of Human Preferences through Magnetisation Dynamics\nAbstract: arXiv:2310.00267v2 Announce Type: replace-cross  Abstract: Paradoxical decision-making behaviours such as preference reversal often arise from imprecise or noisy human preferences. Harnessing the physical principle of magnetisation reversal in ferromagnetic nanostructures, we developed a model that closely reflects human decision-making dynamics. Tested against a spectrum of psychological data, our model adeptly captures the complexities inherent in individual choices. This blend of physics and psychology paves the way for fresh perspectives on understanding the imprecision of human decision-making processes, extending the reach of the current classical and quantum physical models of human behaviour and decision-making.",
    "path": "papers/23/10/2310.00267.json",
    "total_tokens": 706,
    "translated_title": "偏好的物理学：通过磁化动力学揭示人类偏好的不精确性",
    "translated_abstract": "诸如偏好逆转等悖论性决策行为通常源自人类偏好的不精确或杂乱情况。通过利用铁磁纳米结构中的磁化逆转物理原理，我们开发了一个模型，它紧密反映了人类决策动力学。经过一系列心理学数据的测试，我们的模型熟练地捕捉了个体选择中固有的复杂性。这种物理学和心理学的融合为理解人类决策过程中的不精确性开辟了新的视角，扩展了当前经典和量子物理模型对人类行为和决策的探索范围。",
    "tldr": "通过磁化动力学原理，开发了一个模型用以紧密反映人类决策动力学，成功捕捉了个体选择中的复杂性。",
    "en_tdlr": "A model utilizing the physical principle of magnetisation dynamics closely reflects human decision-making dynamics, adeptly capturing the complexities inherent in individual choices."
}