{
    "title": "VKIE: The Application of Key Information Extraction on Video Text. (arXiv:2310.11650v1 [cs.IR])",
    "abstract": "Extracting structured information from videos is critical for numerous downstream applications in the industry. In this paper, we define a significant task of extracting hierarchical key information from visual texts on videos. To fulfill this task, we decouples it into four subtasks and introduce two implementation solutions called PipVKIE and UniVKIE. PipVKIE sequentially completes the four subtasks in continuous stages, while UniVKIE is improved by unifying all the subtasks into one backbone. Both PipVKIE and UniVKIE leverage multimodal information from vision, text, and coordinates for feature representation. Extensive experiments on one well-defined dataset demonstrate that our solutions can achieve remarkable performance and efficient inference speed. The code and dataset will be publicly available.",
    "link": "http://arxiv.org/abs/2310.11650",
    "context": "Title: VKIE: The Application of Key Information Extraction on Video Text. (arXiv:2310.11650v1 [cs.IR])\nAbstract: Extracting structured information from videos is critical for numerous downstream applications in the industry. In this paper, we define a significant task of extracting hierarchical key information from visual texts on videos. To fulfill this task, we decouples it into four subtasks and introduce two implementation solutions called PipVKIE and UniVKIE. PipVKIE sequentially completes the four subtasks in continuous stages, while UniVKIE is improved by unifying all the subtasks into one backbone. Both PipVKIE and UniVKIE leverage multimodal information from vision, text, and coordinates for feature representation. Extensive experiments on one well-defined dataset demonstrate that our solutions can achieve remarkable performance and efficient inference speed. The code and dataset will be publicly available.",
    "path": "papers/23/10/2310.11650.json",
    "total_tokens": 866,
    "translated_title": "VKIE:应用关键信息提取于视频文本的研究",
    "translated_abstract": "从视频中提取结构化信息对于行业中许多下游应用至关重要。本文定义了从视频文本中提取层次化关键信息的重要任务。为了完成这个任务，我们将其拆分为四个子任务，并介绍了两种实现方案，分别称为PipVKIE和UniVKIE。PipVKIE按照连续阶段顺序完成四个子任务，而UniVKIE通过将所有子任务统一到一个主干中进行改进。PipVKIE和UniVKIE都利用了来自视觉、文本和坐标的多模态信息进行特征表示。在一个明确定义的数据集上进行了大量实验证明，我们的解决方案可以取得显著的性能和高效的推理速度。代码和数据集将公开提供。",
    "tldr": "本文提出了一项重要任务，即从视频文本中提取层次化关键信息。研究者们通过拆分任务为四个子任务，并介绍了两种实现方案，即PipVKIE和UniVKIE。两种方案都利用了视觉、文本和坐标的多模态信息进行特征表示。实验证明，这些方案在性能和推理速度方面表现出色。",
    "en_tdlr": "要从视频文本中提取层次化关键信息，研究者将任务拆分为四个子任务，并提出了两种实现方案，PipVKIE和UniVKIE，两种方案都利用了多模态信息进行特征表示，实验证明这些方案在性能和推理速度方面表现出色。"
}