{
    "title": "Blind quantum machine learning with quantum bipartite correlator. (arXiv:2310.12893v1 [quant-ph])",
    "abstract": "Distributed quantum computing is a promising computational paradigm for performing computations that are beyond the reach of individual quantum devices. Privacy in distributed quantum computing is critical for maintaining confidentiality and protecting the data in the presence of untrusted computing nodes. In this work, we introduce novel blind quantum machine learning protocols based on the quantum bipartite correlator algorithm. Our protocols have reduced communication overhead while preserving the privacy of data from untrusted parties. We introduce robust algorithm-specific privacy-preserving mechanisms with low computational overhead that do not require complex cryptographic techniques. We then validate the effectiveness of the proposed protocols through complexity and privacy analysis. Our findings pave the way for advancements in distributed quantum computing, opening up new possibilities for privacy-aware machine learning applications in the era of quantum technologies.",
    "link": "http://arxiv.org/abs/2310.12893",
    "context": "Title: Blind quantum machine learning with quantum bipartite correlator. (arXiv:2310.12893v1 [quant-ph])\nAbstract: Distributed quantum computing is a promising computational paradigm for performing computations that are beyond the reach of individual quantum devices. Privacy in distributed quantum computing is critical for maintaining confidentiality and protecting the data in the presence of untrusted computing nodes. In this work, we introduce novel blind quantum machine learning protocols based on the quantum bipartite correlator algorithm. Our protocols have reduced communication overhead while preserving the privacy of data from untrusted parties. We introduce robust algorithm-specific privacy-preserving mechanisms with low computational overhead that do not require complex cryptographic techniques. We then validate the effectiveness of the proposed protocols through complexity and privacy analysis. Our findings pave the way for advancements in distributed quantum computing, opening up new possibilities for privacy-aware machine learning applications in the era of quantum technologies.",
    "path": "papers/23/10/2310.12893.json",
    "total_tokens": 895,
    "translated_title": "盲量子机器学习与量子二分关联器",
    "translated_abstract": "分布式量子计算是一种有前途的计算范式，可以执行单个量子设备无法达到的计算。在分布式量子计算中，隐私对于在不可信计算节点存在的情况下维护机密性和保护数据至关重要。在这项工作中，我们引入了基于量子二分关联器算法的新型盲量子机器学习协议。我们的协议在保护数据隐私的同时降低了通信开销。我们引入了具有低计算开销且不需要复杂加密技术的强韧算法特定的隐私保护机制。然后，我们通过复杂性和隐私分析验证了所提议协议的有效性。我们的发现为发展分布式量子计算铺平了道路，为量子技术时代下的隐私感知机器学习应用开辟了新的可能性。",
    "tldr": "该论文介绍了基于量子二分关联器算法的盲量子机器学习协议，提出了具有降低通信开销和保护数据隐私的特点，并引入了低计算开销、不需要复杂加密技术的隐私保护机制。论文通过复杂性和隐私分析验证了协议的有效性，为发展分布式量子计算和隐私感知机器学习应用提供了新的可能性。",
    "en_tdlr": "This paper introduces blind quantum machine learning protocols based on the quantum bipartite correlator algorithm, which have reduced communication overhead and privacy protection features. The paper validates the effectiveness of the proposed protocols through complexity and privacy analysis, paving the way for advancements in distributed quantum computing and privacy-aware machine learning applications."
}