{
    "title": "Fast Screening Rules for Optimal Design via Quadratic Lasso Reformulation. (arXiv:2310.08939v1 [stat.ME])",
    "abstract": "The problems of Lasso regression and optimal design of experiments share a critical property: their optimal solutions are typically \\emph{sparse}, i.e., only a small fraction of the optimal variables are non-zero. Therefore, the identification of the support of an optimal solution reduces the dimensionality of the problem and can yield a substantial simplification of the calculations. It has recently been shown that linear regression with a \\emph{squared} $\\ell_1$-norm sparsity-inducing penalty is equivalent to an optimal experimental design problem. In this work, we use this equivalence to derive safe screening rules that can be used to discard inessential samples. Compared to previously existing rules, the new tests are much faster to compute, especially for problems involving a parameter space of high dimension, and can be used dynamically within any iterative solver, with negligible computational overhead. Moreover, we show how an existing homotopy algorithm to compute the regulari",
    "link": "http://arxiv.org/abs/2310.08939",
    "context": "Title: Fast Screening Rules for Optimal Design via Quadratic Lasso Reformulation. (arXiv:2310.08939v1 [stat.ME])\nAbstract: The problems of Lasso regression and optimal design of experiments share a critical property: their optimal solutions are typically \\emph{sparse}, i.e., only a small fraction of the optimal variables are non-zero. Therefore, the identification of the support of an optimal solution reduces the dimensionality of the problem and can yield a substantial simplification of the calculations. It has recently been shown that linear regression with a \\emph{squared} $\\ell_1$-norm sparsity-inducing penalty is equivalent to an optimal experimental design problem. In this work, we use this equivalence to derive safe screening rules that can be used to discard inessential samples. Compared to previously existing rules, the new tests are much faster to compute, especially for problems involving a parameter space of high dimension, and can be used dynamically within any iterative solver, with negligible computational overhead. Moreover, we show how an existing homotopy algorithm to compute the regulari",
    "path": "papers/23/10/2310.08939.json",
    "total_tokens": 870,
    "translated_title": "通过二次Lasso重构，用于最优设计的快速筛选规则",
    "translated_abstract": "Lasso回归和最优实验设计问题都具有一个重要特性：它们的最优解通常是\"稀疏的\"，即只有很少一部分变量是非零的。因此，确定最优解的支持集会降低问题的维度并且能够大大简化计算。最近的研究表明，使用\"平方\"的$\\ell_1$-范数罚项的线性回归问题等价于最优实验设计问题。本文利用这种等价关系，推导出可以用于排除无关样本的安全筛选规则。与先前存在的规则相比，新的测试方法计算速度更快，特别适用于涉及高维参数空间的问题，并可以在任何迭代求解器中动态使用，且计算开销很小。此外，我们展示了如何使用现有的路径追踪算法来计算正则化参数值的路径，并进行了数值实验证明了我们的方法的有效性。",
    "tldr": "通过二次Lasso重构，我们提出了用于最优设计的快速筛选规则，可以动态地在任何迭代求解器中使用。这些规则能够快速计算，并且在问题涉及高维参数空间时尤为有效。",
    "en_tdlr": "We propose fast screening rules for optimal design using quadratic Lasso reformulation. These rules can be dynamically used within any iterative solver, and are especially effective for problems involving high-dimensional parameter space."
}