{
    "title": "Risk Aversion and Insurance Propensity. (arXiv:2310.09173v1 [econ.TH])",
    "abstract": "We provide a new foundation of risk aversion by showing that the propension to exploit insurance opportunities fully describes this attitude. Our foundation, which applies to any probabilistically sophisticated preference, well accords with the commonly held prudential interpretation of risk aversion that dates back to the seminal works of Arrow (1963) and Pratt (1964).  In our main results, we first characterize the Arrow-Pratt risk aversion in terms of propension to full insurance and the stronger notion of risk aversion of Rothschild and Stiglitz (1970) in terms of propension to partial insurance. We then extend the analysis to comparative risk aversion by showing that the notion of Yaari (1969) corresponds to comparative propension to full insurance, while the stronger notion of Ross (1981) corresponds to comparative propension to partial insurance.",
    "link": "http://arxiv.org/abs/2310.09173",
    "context": "Title: Risk Aversion and Insurance Propensity. (arXiv:2310.09173v1 [econ.TH])\nAbstract: We provide a new foundation of risk aversion by showing that the propension to exploit insurance opportunities fully describes this attitude. Our foundation, which applies to any probabilistically sophisticated preference, well accords with the commonly held prudential interpretation of risk aversion that dates back to the seminal works of Arrow (1963) and Pratt (1964).  In our main results, we first characterize the Arrow-Pratt risk aversion in terms of propension to full insurance and the stronger notion of risk aversion of Rothschild and Stiglitz (1970) in terms of propension to partial insurance. We then extend the analysis to comparative risk aversion by showing that the notion of Yaari (1969) corresponds to comparative propension to full insurance, while the stronger notion of Ross (1981) corresponds to comparative propension to partial insurance.",
    "path": "papers/23/10/2310.09173.json",
    "total_tokens": 859,
    "translated_title": "风险厌恶和保险倾向",
    "translated_abstract": "我们通过展示充分利用保险机会的倾向来提供一个新的风险厌恶基础，这个基础适用于任何概率的复杂偏好，与Arrow (1963)和Pratt (1964)的经典作品所提供的风险厌恶的谨慎解释相一致。在我们的主要结果中，我们首先以充分保险的倾向表征了Arrow-Pratt的风险厌恶，以部分保险的倾向表现出了Rothschild和Stiglitz(1970)的更强风险厌恶。然后我们将该分析扩展到比较风险厌恶，通过展示Yaari(1969)的概念对应于对充分保险的比较倾向，而Ross(1981)的更强概念对应于对部分保险的比较倾向。",
    "tldr": "这篇论文提供了一个新的风险厌恶基础，通过展示充分利用保险机会的倾向来描述这种态度，并且成功地将风险厌恶与不同保险倾向联系起来，为比较风险厌恶提供了一种新的解释。"
}