{
    "title": "Language Agents with Reinforcement Learning for Strategic Play in the Werewolf Game",
    "abstract": "arXiv:2310.18940v3 Announce Type: replace  Abstract: Agents built with large language models (LLMs) have shown great potential across a wide range of domains. However, in complex decision-making tasks, pure LLM-based agents tend to exhibit intrinsic bias in their choice of actions, which is inherited from the model's training data and results in suboptimal performance. To develop strategic language agents, i.e., agents that generate flexible language actions and possess strong decision-making abilities, we propose a novel framework that powers LLM-based agents with reinforcement learning (RL). We consider Werewolf, a popular social deduction game, as a challenging testbed that emphasizes versatile communication and strategic gameplay. To mitigate the intrinsic bias in language actions, our agents use an LLM to perform deductive reasoning and generate a diverse set of action candidates. Then an RL policy trained to optimize the decision-making ability chooses an action from the candidat",
    "link": "https://arxiv.org/abs/2310.18940",
    "context": "Title: Language Agents with Reinforcement Learning for Strategic Play in the Werewolf Game\nAbstract: arXiv:2310.18940v3 Announce Type: replace  Abstract: Agents built with large language models (LLMs) have shown great potential across a wide range of domains. However, in complex decision-making tasks, pure LLM-based agents tend to exhibit intrinsic bias in their choice of actions, which is inherited from the model's training data and results in suboptimal performance. To develop strategic language agents, i.e., agents that generate flexible language actions and possess strong decision-making abilities, we propose a novel framework that powers LLM-based agents with reinforcement learning (RL). We consider Werewolf, a popular social deduction game, as a challenging testbed that emphasizes versatile communication and strategic gameplay. To mitigate the intrinsic bias in language actions, our agents use an LLM to perform deductive reasoning and generate a diverse set of action candidates. Then an RL policy trained to optimize the decision-making ability chooses an action from the candidat",
    "path": "papers/23/10/2310.18940.json",
    "total_tokens": 843,
    "translated_title": "使用强化学习的语言代理在狼人杀游戏中进行战略对战",
    "translated_abstract": "基于大型语言模型（LLMs）构建的代理在各领域展现出巨大潜力。然而，在复杂决策任务中，纯LLM代理往往表现出固有偏见，这些偏见来源于模型的训练数据，导致性能不佳。为了开发具有灵活语言行为和强大决策能力的战略语言代理，我们提出了一种新颖的框架，通过强化学习（RL）提升LLM代理的能力。我们选择狼人杀作为具有多样沟通和战略游戏玩法的挑战测试平台。为了减轻语言行为中的固有偏见，我们的代理使用LLM进行演绎推理并生成多样行为候选集。然后，经过训练以优化决策能力的RL策略从候选集中选择行为。",
    "tldr": "使用强化学习为基础，提出了一种框架，用于在狼人杀游戏中开发具有灵活语言行为和强大决策能力的战略语言代理",
    "en_tdlr": "a novel framework is proposed based on reinforcement learning to develop strategic language agents with flexible language actions and strong decision-making abilities in the Werewolf game."
}