{
    "title": "Adaptive Neural Ranking Framework: Toward Maximized Business Goal for Cascade Ranking Systems",
    "abstract": "arXiv:2310.10462v2 Announce Type: replace  Abstract: Cascade ranking is widely used for large-scale top-k selection problems in online advertising and recommendation systems, and learning-to-rank is an important way to optimize the models in cascade ranking. Previous works on learning-to-rank usually focus on letting the model learn the complete order or top-k order, and adopt the corresponding rank metrics (e.g. OPA and NDCG@k) as optimization targets. However, these targets can not adapt to various cascade ranking scenarios with varying data complexities and model capabilities; and the existing metric-driven methods such as the Lambda framework can only optimize a rough upper bound of limited metrics, potentially resulting in sub-optimal and performance misalignment. To address these issues, we propose a novel perspective on optimizing cascade ranking systems by highlighting the adaptability of optimization targets to data complexities and model capabilities. Concretely, we employ mu",
    "link": "https://arxiv.org/abs/2310.10462",
    "context": "Title: Adaptive Neural Ranking Framework: Toward Maximized Business Goal for Cascade Ranking Systems\nAbstract: arXiv:2310.10462v2 Announce Type: replace  Abstract: Cascade ranking is widely used for large-scale top-k selection problems in online advertising and recommendation systems, and learning-to-rank is an important way to optimize the models in cascade ranking. Previous works on learning-to-rank usually focus on letting the model learn the complete order or top-k order, and adopt the corresponding rank metrics (e.g. OPA and NDCG@k) as optimization targets. However, these targets can not adapt to various cascade ranking scenarios with varying data complexities and model capabilities; and the existing metric-driven methods such as the Lambda framework can only optimize a rough upper bound of limited metrics, potentially resulting in sub-optimal and performance misalignment. To address these issues, we propose a novel perspective on optimizing cascade ranking systems by highlighting the adaptability of optimization targets to data complexities and model capabilities. Concretely, we employ mu",
    "path": "papers/23/10/2310.10462.json",
    "total_tokens": 836,
    "translated_title": "自适应神经排名框架：面向级联排名系统的最大化业务目标",
    "translated_abstract": "级联排名在在线广告和推荐系统中广泛应用于大规模top-k选择问题，而学习排序是优化级联排名模型的重要方式。以前关于学习排序的工作通常侧重于让模型学习完整顺序或top-k顺序，并采用相应的排名指标（如OPA和NDCG@k）作为优化目标。然而，这些目标无法适应具有不同数据复杂性和模型能力的各种级联排名场景；而现有的基于度量的方法如Lambda框架只能优化有限指标的粗略上界，可能导致次优和性能不对齐。为了解决这些问题，我们提出了一种新颖的优化级联排名系统的透视角度，强调优化目标对数据复杂性和模型能力的适应性。",
    "tldr": "提出了一种新颖的透视角度，强调优化级联排名系统的适应性，解决了现有方法无法适应不同级联排名场景的问题，可以提升性能并避免次优情况的发生。",
    "en_tdlr": "A novel perspective is proposed to highlight the adaptability of optimizing cascade ranking systems, which solves the problem of existing methods unable to adapt to different cascade ranking scenarios, improving performance and avoiding sub-optimality."
}