{
    "title": "An Optimistic-Robust Approach for Dynamic Positioning of Omnichannel Inventories. (arXiv:2310.12183v1 [math.OC])",
    "abstract": "We introduce a new class of data-driven and distribution-free optimistic-robust bimodal inventory optimization (BIO) strategy to effectively allocate inventory across a retail chain to meet time-varying, uncertain omnichannel demand. While prior Robust optimization (RO) methods emphasize the downside, i.e., worst-case adversarial demand, BIO also considers the upside to remain resilient like RO while also reaping the rewards of improved average-case performance by overcoming the presence of endogenous outliers. This bimodal strategy is particularly valuable for balancing the tradeoff between lost sales at the store and the costs of cross-channel e-commerce fulfillment, which is at the core of our inventory optimization model. These factors are asymmetric due to the heterogenous behavior of the channels, with a bias towards the former in terms of lost-sales cost and a dependence on network effects for the latter. We provide structural insights about the BIO solution and how it can be tu",
    "link": "http://arxiv.org/abs/2310.12183",
    "context": "Title: An Optimistic-Robust Approach for Dynamic Positioning of Omnichannel Inventories. (arXiv:2310.12183v1 [math.OC])\nAbstract: We introduce a new class of data-driven and distribution-free optimistic-robust bimodal inventory optimization (BIO) strategy to effectively allocate inventory across a retail chain to meet time-varying, uncertain omnichannel demand. While prior Robust optimization (RO) methods emphasize the downside, i.e., worst-case adversarial demand, BIO also considers the upside to remain resilient like RO while also reaping the rewards of improved average-case performance by overcoming the presence of endogenous outliers. This bimodal strategy is particularly valuable for balancing the tradeoff between lost sales at the store and the costs of cross-channel e-commerce fulfillment, which is at the core of our inventory optimization model. These factors are asymmetric due to the heterogenous behavior of the channels, with a bias towards the former in terms of lost-sales cost and a dependence on network effects for the latter. We provide structural insights about the BIO solution and how it can be tu",
    "path": "papers/23/10/2310.12183.json",
    "total_tokens": 898,
    "translated_title": "一种乐观-鲁棒的全渠道库存动态定位方法",
    "translated_abstract": "我们介绍了一种新的数据驱动和免分布乐观-鲁棒双模式库存优化策略，以有效分配销售链上的库存，以满足时变的、不确定的全渠道需求。传统的鲁棒优化方法更加注重最坏情况下的对抗性需求，而双模式策略不仅考虑了保持像鲁棒优化一样的弹性，还通过克服内生奇异值的存在而获得了改善平均情况下性能的回报。这种双模式策略在平衡店铺失去销售和跨渠道电子商务履约成本的权衡方面特别有价值，这也是我们库存优化模型的核心所在。由于渠道的异质行为，这些因素是非对称的，前者在失销售成本方面存在偏差，而后者则依赖于网络效应。",
    "tldr": "这篇论文介绍了一种乐观-鲁棒的全渠道库存动态定位方法，通过兼顾库存弹性和改善平均性能，来平衡店铺失去销售和跨渠道电子商务履约成本的权衡。",
    "en_tdlr": "This paper presents an optimistic-robust approach for dynamic positioning of omnichannel inventories, balancing the tradeoff between lost sales and cross-channel e-commerce fulfillment cost by considering inventory elasticity and improving average performance."
}