{
    "title": "Beyond-Accuracy: A Review on Diversity, Serendipity and Fairness in Recommender Systems Based on Graph Neural Networks. (arXiv:2310.02294v1 [cs.IR])",
    "abstract": "By providing personalized suggestions to users, recommender systems have become essential to numerous online platforms. Collaborative filtering, particularly graph-based approaches using Graph Neural Networks (GNNs), have demonstrated great results in terms of recommendation accuracy. However, accuracy may not always be the most important criterion for evaluating recommender systems' performance, since beyond-accuracy aspects such as recommendation diversity, serendipity, and fairness can strongly influence user engagement and satisfaction. This review paper focuses on addressing these dimensions in GNN-based recommender systems, going beyond the conventional accuracy-centric perspective. We begin by reviewing recent developments in approaches that improve not only the accuracy-diversity trade-off but also promote serendipity and fairness in GNN-based recommender systems. We discuss different stages of model development including data preprocessing, graph construction, embedding initia",
    "link": "http://arxiv.org/abs/2310.02294",
    "context": "Title: Beyond-Accuracy: A Review on Diversity, Serendipity and Fairness in Recommender Systems Based on Graph Neural Networks. (arXiv:2310.02294v1 [cs.IR])\nAbstract: By providing personalized suggestions to users, recommender systems have become essential to numerous online platforms. Collaborative filtering, particularly graph-based approaches using Graph Neural Networks (GNNs), have demonstrated great results in terms of recommendation accuracy. However, accuracy may not always be the most important criterion for evaluating recommender systems' performance, since beyond-accuracy aspects such as recommendation diversity, serendipity, and fairness can strongly influence user engagement and satisfaction. This review paper focuses on addressing these dimensions in GNN-based recommender systems, going beyond the conventional accuracy-centric perspective. We begin by reviewing recent developments in approaches that improve not only the accuracy-diversity trade-off but also promote serendipity and fairness in GNN-based recommender systems. We discuss different stages of model development including data preprocessing, graph construction, embedding initia",
    "path": "papers/23/10/2310.02294.json",
    "total_tokens": 885,
    "translated_title": "超越准确性: 基于图神经网络的推荐系统中的多样性、意外性和公平性综述",
    "translated_abstract": "通过向用户提供个性化建议，推荐系统已经成为许多在线平台的重要组成部分。协同过滤，特别是使用图神经网络（GNN）的基于图的方法，在推荐准确性方面取得了很好的结果。然而，准确性并不总是评估推荐系统性能最重要的标准，因为除了准确性之外，推荐多样性、意外性和公平性等方面也会对用户参与和满意度产生强烈影响。本综述论文关注于解决基于GNN的推荐系统中的这些维度，超越传统以准确性为中心的视角。我们首先回顾了最近在改善准确性-多样性权衡、促进意外性和公平性方面的方法方面的发展。我们讨论了模型开发的不同阶段，包括数据预处理、图构建、嵌入初始化。",
    "tldr": "本综述论文关注于基于图神经网络的推荐系统中的多样性、意外性和公平性问题，超越传统的准确性评估，并讨论了模型开发的不同阶段。"
}