{
    "title": "Estimating Trustworthy and Safe Optimal Treatment Regimes. (arXiv:2310.15333v1 [cs.LG])",
    "abstract": "Recent statistical and reinforcement learning methods have significantly advanced patient care strategies. However, these approaches face substantial challenges in high-stakes contexts, including missing data, inherent stochasticity, and the critical requirements for interpretability and patient safety. Our work operationalizes a safe and interpretable framework to identify optimal treatment regimes. This approach involves matching patients with similar medical and pharmacological characteristics, allowing us to construct an optimal policy via interpolation. We perform a comprehensive simulation study to demonstrate the framework's ability to identify optimal policies even in complex settings. Ultimately, we operationalize our approach to study regimes for treating seizures in critically ill patients. Our findings strongly support personalized treatment strategies based on a patient's medical history and pharmacological features. Notably, we identify that reducing medication doses for ",
    "link": "http://arxiv.org/abs/2310.15333",
    "context": "Title: Estimating Trustworthy and Safe Optimal Treatment Regimes. (arXiv:2310.15333v1 [cs.LG])\nAbstract: Recent statistical and reinforcement learning methods have significantly advanced patient care strategies. However, these approaches face substantial challenges in high-stakes contexts, including missing data, inherent stochasticity, and the critical requirements for interpretability and patient safety. Our work operationalizes a safe and interpretable framework to identify optimal treatment regimes. This approach involves matching patients with similar medical and pharmacological characteristics, allowing us to construct an optimal policy via interpolation. We perform a comprehensive simulation study to demonstrate the framework's ability to identify optimal policies even in complex settings. Ultimately, we operationalize our approach to study regimes for treating seizures in critically ill patients. Our findings strongly support personalized treatment strategies based on a patient's medical history and pharmacological features. Notably, we identify that reducing medication doses for ",
    "path": "papers/23/10/2310.15333.json",
    "total_tokens": 1004,
    "translated_title": "估计可信赖和安全的最佳治疗方案",
    "translated_abstract": "最近的统计学和强化学习方法显著推动了患者护理策略的发展。然而，在高风险环境中，这些方法面临着很大的挑战，包括缺失数据、固有的随机性以及对解释性和患者安全性的重要要求。我们的工作运用了一种安全且可解释的框架来识别最佳治疗方案。这种方法涉及将具有相似医学和药物特征的患者进行匹配，从而通过插值构建最佳政策。我们进行了全面的模拟研究，以展示该框架即使在复杂环境中也能够识别最佳政策的能力。最终，我们将我们的方法应用于研究对重症患者进行癫痫治疗的方案。我们的发现强烈支持基于患者的医疗历史和药物特征的个性化治疗策略。值得注意的是，我们发现减少药物剂量可以减轻病情而不会对治疗的效果产生负面影响。",
    "tldr": "这篇论文提出了一种安全和可解释的框架，通过匹配患者的医学和药物特性来识别最佳治疗方案。研究结果表明，个性化的治疗策略可以根据患者的病史和药物特征来制定，并发现减少药物剂量可以减轻病情而不会对治疗效果产生负面影响。",
    "en_tdlr": "This paper presents a safe and interpretable framework to identify optimal treatment regimes by matching patients with similar medical and pharmacological characteristics. The study demonstrates the effectiveness of personalized treatment strategies based on patients' medical history and pharmacological features, and finds that reducing medication doses can alleviate symptoms without negative impacts on treatment outcomes."
}