{
    "title": "Privacy Amplification for Matrix Mechanisms. (arXiv:2310.15526v1 [cs.LG])",
    "abstract": "Privacy amplification exploits randomness in data selection to provide tighter differential privacy (DP) guarantees. This analysis is key to DP-SGD's success in machine learning, but, is not readily applicable to the newer state-of-the-art algorithms. This is because these algorithms, known as DP-FTRL, use the matrix mechanism to add correlated noise instead of independent noise as in DP-SGD.  In this paper, we propose \"MMCC\", the first algorithm to analyze privacy amplification via sampling for any generic matrix mechanism. MMCC is nearly tight in that it approaches a lower bound as $\\epsilon\\to0$. To analyze correlated outputs in MMCC, we prove that they can be analyzed as if they were independent, by conditioning them on prior outputs. Our \"conditional composition theorem\" has broad utility: we use it to show that the noise added to binary-tree-DP-FTRL can asymptotically match the noise added to DP-SGD with amplification. Our amplification algorithm also has practical empirical util",
    "link": "http://arxiv.org/abs/2310.15526",
    "context": "Title: Privacy Amplification for Matrix Mechanisms. (arXiv:2310.15526v1 [cs.LG])\nAbstract: Privacy amplification exploits randomness in data selection to provide tighter differential privacy (DP) guarantees. This analysis is key to DP-SGD's success in machine learning, but, is not readily applicable to the newer state-of-the-art algorithms. This is because these algorithms, known as DP-FTRL, use the matrix mechanism to add correlated noise instead of independent noise as in DP-SGD.  In this paper, we propose \"MMCC\", the first algorithm to analyze privacy amplification via sampling for any generic matrix mechanism. MMCC is nearly tight in that it approaches a lower bound as $\\epsilon\\to0$. To analyze correlated outputs in MMCC, we prove that they can be analyzed as if they were independent, by conditioning them on prior outputs. Our \"conditional composition theorem\" has broad utility: we use it to show that the noise added to binary-tree-DP-FTRL can asymptotically match the noise added to DP-SGD with amplification. Our amplification algorithm also has practical empirical util",
    "path": "papers/23/10/2310.15526.json",
    "total_tokens": 933,
    "translated_title": "矩阵机制的隐私放大",
    "translated_abstract": "隐私放大利用数据选择中的随机性来提供更严格的差分隐私保证。这种分析对于DP-SGD在机器学习中的成功至关重要，但对于最新的最先进算法并不适用。这是因为这些算法，即DP-FTRL，使用矩阵机制来添加相关噪声，而不是像DP-SGD那样添加独立噪声。在本文中，我们提出了“MMCC”算法，该算法是通过抽样来分析任何通用矩阵机制的隐私放大的首个算法。MMCC接近一个下界，当ε→0时，它趋近于该下界。为了分析MMCC中的相关输出，我们证明可以将其视为独立输出，通过对先前输出进行调节。我们的“条件性组合定理”具有广泛的实用性：我们使用它来显示添加到二叉树DP-FTRL的噪声可以渐近地与通过放大添加到DP-SGD中的噪声相匹配。我们的放大算法也具有实际的经验性实用性。",
    "tldr": "提出了通过抽样分析矩阵机制的隐私放大算法MMCC，证明了通过条件性组合定理可以将相关输出视为独立输出，并展示了将噪声添加到DP-FTRL算法时可以渐近地与DP-SGD算法中放大后添加的噪声相匹配。",
    "en_tdlr": "Proposed MMCC algorithm for privacy amplification through sampling in matrix mechanisms, proved that correlated outputs can be treated as independent using the conditional composition theorem, and demonstrated asymptotic matching of noise added to DP-SGD with amplification when added to the DP-FTRL algorithm."
}