{
    "title": "Spiral-Elliptical automated galaxy morphology classification from telescope images. (arXiv:2310.07740v1 [astro-ph.IM])",
    "abstract": "The classification of galaxy morphologies is an important step in the investigation of theories of hierarchical structure formation. While human expert visual classification remains quite effective and accurate, it cannot keep up with the massive influx of data from emerging sky surveys. A variety of approaches have been proposed to classify large numbers of galaxies; these approaches include crowdsourced visual classification, and automated and computational methods, such as machine learning methods based on designed morphology statistics and deep learning. In this work, we develop two novel galaxy morphology statistics, descent average and descent variance, which can be efficiently extracted from telescope galaxy images. We further propose simplified versions of the existing image statistics concentration, asymmetry, and clumpiness, which have been widely used in the literature of galaxy morphologies. We utilize the galaxy image data from the Sloan Digital Sky Survey to demonstrate t",
    "link": "http://arxiv.org/abs/2310.07740",
    "context": "Title: Spiral-Elliptical automated galaxy morphology classification from telescope images. (arXiv:2310.07740v1 [astro-ph.IM])\nAbstract: The classification of galaxy morphologies is an important step in the investigation of theories of hierarchical structure formation. While human expert visual classification remains quite effective and accurate, it cannot keep up with the massive influx of data from emerging sky surveys. A variety of approaches have been proposed to classify large numbers of galaxies; these approaches include crowdsourced visual classification, and automated and computational methods, such as machine learning methods based on designed morphology statistics and deep learning. In this work, we develop two novel galaxy morphology statistics, descent average and descent variance, which can be efficiently extracted from telescope galaxy images. We further propose simplified versions of the existing image statistics concentration, asymmetry, and clumpiness, which have been widely used in the literature of galaxy morphologies. We utilize the galaxy image data from the Sloan Digital Sky Survey to demonstrate t",
    "path": "papers/23/10/2310.07740.json",
    "total_tokens": 807,
    "translated_title": "从望远镜图像中自动分类螺旋-椭圆星系形态",
    "translated_abstract": "星系形态分类是研究分级结构形成理论的重要步骤。虽然人工专家的视觉分类仍然有效准确，但无法应对新兴天空调查的海量数据。提出了各种分类大量星系的方法，包括众包视觉分类、基于设计的形态统计和深度学习的机器学习方法。本研究开发了两个新颖的星系形态统计，降落平均值和降落方差，可以有效地从望远镜星系图像中提取。进一步提出了现有图像统计集中度、不对称性和杂乱性的简化版本，这些方法在星系形态的文献中被广泛使用。通过利用SDSS的星系图像数据进行演示。",
    "tldr": "本研究发展了两个新颖的星系形态统计方法，并提出了简化版本的现有图像统计方法，通过提取望远镜图像中的特征，实现了自动分类螺旋-椭圆星系形态。",
    "en_tdlr": "This study develops two novel galaxy morphology statistics and proposes simplified versions of existing image statistics, achieving automated classification of spiral-elliptical galaxy morphologies by extracting features from telescope images."
}