{
    "title": "aSAGA: Automatic Sleep Analysis with Gray Areas. (arXiv:2310.02032v1 [cs.LG])",
    "abstract": "State-of-the-art automatic sleep staging methods have already demonstrated comparable reliability and superior time efficiency to manual sleep staging. However, fully automatic black-box solutions are difficult to adapt into clinical workflow and the interaction between explainable automatic methods and the work of sleep technologists remains underexplored and inadequately conceptualized. Thus, we propose a human-in-the-loop concept for sleep analysis, presenting an automatic sleep staging model (aSAGA), that performs effectively with both clinical polysomnographic recordings and home sleep studies. To validate the model, extensive testing was conducted, employing a preclinical validation approach with three retrospective datasets; open-access, clinical, and research-driven. Furthermore, we validate the utilization of uncertainty mapping to identify ambiguous regions, conceptualized as gray areas, in automatic sleep analysis that warrants manual re-evaluation. The results demonstrate t",
    "link": "http://arxiv.org/abs/2310.02032",
    "context": "Title: aSAGA: Automatic Sleep Analysis with Gray Areas. (arXiv:2310.02032v1 [cs.LG])\nAbstract: State-of-the-art automatic sleep staging methods have already demonstrated comparable reliability and superior time efficiency to manual sleep staging. However, fully automatic black-box solutions are difficult to adapt into clinical workflow and the interaction between explainable automatic methods and the work of sleep technologists remains underexplored and inadequately conceptualized. Thus, we propose a human-in-the-loop concept for sleep analysis, presenting an automatic sleep staging model (aSAGA), that performs effectively with both clinical polysomnographic recordings and home sleep studies. To validate the model, extensive testing was conducted, employing a preclinical validation approach with three retrospective datasets; open-access, clinical, and research-driven. Furthermore, we validate the utilization of uncertainty mapping to identify ambiguous regions, conceptualized as gray areas, in automatic sleep analysis that warrants manual re-evaluation. The results demonstrate t",
    "path": "papers/23/10/2310.02032.json",
    "total_tokens": 902,
    "translated_title": "aSAGA: 带灰区域的自动睡眠分析",
    "translated_abstract": "最先进的自动睡眠分期方法已经展示出与手动睡眠分期相当的可靠性和更高的时间效率。然而，完全自动的黑盒解决方案很难适应临床工作流程，可解释的自动方法和睡眠技术师的工作之间的交互仍不被充分研究和概念化。因此，我们提出了一个针对睡眠分析的人机交互概念，提出了一个名为aSAGA的自动睡眠分期模型，可以在临床多项式监测记录和家庭睡眠研究中有效执行。为了验证该模型，进行了广泛的测试，采用三个回顾性数据集的临床前验证方法进行，包括开放获取、临床和研究驱动的数据集。此外，我们验证了利用不确定性映射识别自动睡眠分析中的模糊区域，概念化为灰色区域，需要进行手动重新评估。结果表明，该模型在不同数据集上得到了验证。",
    "tldr": "提出了一个名为aSAGA的自动睡眠分析模型，可以在临床和家庭睡眠研究中有效执行。模型通过使用不确定性映射来识别灰色区域，需要进行手动重新评估。",
    "en_tdlr": "Proposed an automatic sleep analysis model called aSAGA that effectively performs in both clinical and home sleep studies. The model utilizes uncertainty mapping to identify gray areas that require manual re-evaluation."
}