{
    "title": "Comprehensive Multimodal Segmentation in Medical Imaging: Combining YOLOv8 with SAM and HQ-SAM Models. (arXiv:2310.12995v1 [cs.CV])",
    "abstract": "This paper introduces a comprehensive approach for segmenting regions of interest (ROI) in diverse medical imaging datasets, encompassing ultrasound, CT scans, and X-ray images. The proposed method harnesses the capabilities of the YOLOv8 model for approximate boundary box detection across modalities, alongside the Segment Anything Model (SAM) and High Quality (HQ) SAM for fully automatic and precise segmentation. To generate boundary boxes, the YOLOv8 model was trained using a limited set of 100 images and masks from each modality. The results obtained from our approach are extensively computed and analyzed, demonstrating its effectiveness and potential in medical image analysis. Various evaluation metrics, including precision, recall, F1 score, and Dice Score, were employed to quantify the accuracy of the segmentation results. A comparative analysis was conducted to assess the individual and combined performance of the YOLOv8, YOLOv8+SAM, and YOLOv8+HQ-SAM models. The results indicat",
    "link": "http://arxiv.org/abs/2310.12995",
    "context": "Title: Comprehensive Multimodal Segmentation in Medical Imaging: Combining YOLOv8 with SAM and HQ-SAM Models. (arXiv:2310.12995v1 [cs.CV])\nAbstract: This paper introduces a comprehensive approach for segmenting regions of interest (ROI) in diverse medical imaging datasets, encompassing ultrasound, CT scans, and X-ray images. The proposed method harnesses the capabilities of the YOLOv8 model for approximate boundary box detection across modalities, alongside the Segment Anything Model (SAM) and High Quality (HQ) SAM for fully automatic and precise segmentation. To generate boundary boxes, the YOLOv8 model was trained using a limited set of 100 images and masks from each modality. The results obtained from our approach are extensively computed and analyzed, demonstrating its effectiveness and potential in medical image analysis. Various evaluation metrics, including precision, recall, F1 score, and Dice Score, were employed to quantify the accuracy of the segmentation results. A comparative analysis was conducted to assess the individual and combined performance of the YOLOv8, YOLOv8+SAM, and YOLOv8+HQ-SAM models. The results indicat",
    "path": "papers/23/10/2310.12995.json",
    "total_tokens": 958,
    "translated_title": "医学影像的综合多模态分割：将YOLOv8与SAM和HQ-SAM模型相结合",
    "translated_abstract": "本文介绍了一种综合方法，用于在多种医学影像数据集中分割感兴趣区域（ROI），包括超声、CT扫描和X射线图像。所提出的方法利用YOLOv8模型的能力，在不同模态下进行近似边界框检测，同时结合Segment Anything Model (SAM) 和 High Quality (HQ) SAM进行完全自动和精确的分割。为了生成边界框，使用了每种模态的100个图像和掩模的有限集合对YOLOv8模型进行训练。通过广泛的计算和分析，得出了我们方法的有效性和在医学图像分析中的潜力。使用了多种评估指标，包括精确度、召回率、F1分数和Dice分数，来量化分割结果的准确性。进行了比较分析，评估了YOLOv8、YOLOv8+SAM和YOLOv8+HQ-SAM模型的各自和组合表现。实验结果表明，该方法具有良好的分割效果和潜力。",
    "tldr": "本文介绍了一种综合方法，将YOLOv8模型与SAM和HQ-SAM模型相结合，在多种医学影像数据集中实现了精确的感兴趣区域分割，展示了其在医学图像分析中的有效性和潜力。"
}