{
    "title": "Telecom AI Native Systems in the Age of Generative AI -- An Engineering Perspective. (arXiv:2310.11770v1 [cs.SE])",
    "abstract": "The rapid advancements in Artificial Intelligence (AI), particularly in generative AI and foundational models (FMs), have ushered in transformative changes across various industries. Large language models (LLMs), a type of FM, have demonstrated their prowess in natural language processing tasks and content generation, revolutionizing how we interact with software products and services. This article explores the integration of FMs in the telecommunications industry, shedding light on the concept of AI native telco, where AI is seamlessly woven into the fabric of telecom products. It delves into the engineering considerations and unique challenges associated with implementing FMs into the software life cycle, emphasizing the need for AI native-first approaches. Despite the enormous potential of FMs, ethical, regulatory, and operational challenges require careful consideration, especially in mission-critical telecom contexts. As the telecom industry seeks to harness the power of AI, a com",
    "link": "http://arxiv.org/abs/2310.11770",
    "context": "Title: Telecom AI Native Systems in the Age of Generative AI -- An Engineering Perspective. (arXiv:2310.11770v1 [cs.SE])\nAbstract: The rapid advancements in Artificial Intelligence (AI), particularly in generative AI and foundational models (FMs), have ushered in transformative changes across various industries. Large language models (LLMs), a type of FM, have demonstrated their prowess in natural language processing tasks and content generation, revolutionizing how we interact with software products and services. This article explores the integration of FMs in the telecommunications industry, shedding light on the concept of AI native telco, where AI is seamlessly woven into the fabric of telecom products. It delves into the engineering considerations and unique challenges associated with implementing FMs into the software life cycle, emphasizing the need for AI native-first approaches. Despite the enormous potential of FMs, ethical, regulatory, and operational challenges require careful consideration, especially in mission-critical telecom contexts. As the telecom industry seeks to harness the power of AI, a com",
    "path": "papers/23/10/2310.11770.json",
    "total_tokens": 870,
    "translated_title": "电信AI原生系统在生成式AI时代的工程视角",
    "translated_abstract": "人工智能，特别是生成式AI和基础模型（FMs）的快速发展，正在不同行业引起转型性变革。大型语言模型（LLMs）作为一种FM，展示了在自然语言处理任务和内容生成方面的强大能力，彻底改变了我们与软件产品和服务的互动方式。本文探讨了将FMs整合到电信行业中的可能性，揭示了AI原生电信的概念，即将AI无缝融入电信产品的构架中。本文深入探讨了将FMs实施到软件生命周期中的工程考虑和独特挑战，强调了AI原生优先的重要性。尽管FMs具有巨大潜力，但在关乎任务关键的电信环境中，伦理、监管和运营方面的挑战需要慎重考虑。随着电信行业试图利用AI的力量，一个组建AI原生团队的综合和实际方法是必要的",
    "tldr": "电信行业试图将生成式AI和基础模型（FMs）整合进产品开发中，形成AI原生的电信系统。然而，伦理、监管和运营方面的挑战需要慎重考虑。",
    "en_tdlr": "This paper explores the integration of generative AI and foundational models (FMs) into telecommunications products to create AI native systems. However, ethical, regulatory, and operational challenges must be carefully considered."
}