{
    "title": "Large Trajectory Models are Scalable Motion Predictors and Planners",
    "abstract": "Motion prediction and planning are vital tasks in autonomous driving, and recent efforts have shifted to machine learning-based approaches. The challenges include understanding diverse road topologies, reasoning traffic dynamics over a long time horizon, interpreting heterogeneous behaviors, and generating policies in a large continuous state space. Inspired by the success of large language models in addressing similar complexities through model scaling, we introduce a scalable trajectory model called State Transformer (STR). STR reformulates the motion prediction and motion planning problems by arranging observations, states, and actions into one unified sequence modeling task. Our approach unites trajectory generation problems with other sequence modeling problems, powering rapid iterations with breakthroughs in neighbor domains such as language modeling. Remarkably, experimental results reveal that large trajectory models (LTMs), such as STR, adhere to the scaling laws by presenting",
    "link": "https://arxiv.org/abs/2310.19620",
    "context": "Title: Large Trajectory Models are Scalable Motion Predictors and Planners\nAbstract: Motion prediction and planning are vital tasks in autonomous driving, and recent efforts have shifted to machine learning-based approaches. The challenges include understanding diverse road topologies, reasoning traffic dynamics over a long time horizon, interpreting heterogeneous behaviors, and generating policies in a large continuous state space. Inspired by the success of large language models in addressing similar complexities through model scaling, we introduce a scalable trajectory model called State Transformer (STR). STR reformulates the motion prediction and motion planning problems by arranging observations, states, and actions into one unified sequence modeling task. Our approach unites trajectory generation problems with other sequence modeling problems, powering rapid iterations with breakthroughs in neighbor domains such as language modeling. Remarkably, experimental results reveal that large trajectory models (LTMs), such as STR, adhere to the scaling laws by presenting",
    "path": "papers/23/10/2310.19620.json",
    "total_tokens": 823,
    "translated_title": "大规模轨迹模型是可扩展的运动预测和规划器",
    "translated_abstract": "运动预测和规划是自动驾驶中的重要任务，最近的研究工作已经转向基于机器学习的方法。面临的挑战包括理解多样化的道路拓扑，推理长时间范围内的交通动态，解释异质行为，并在大规模连续状态空间生成策略。受到大型语言模型在通过模型扩展解决类似复杂性方面的成功启发，我们引入一种可扩展的轨迹模型 State Transformer (STR)。STR通过将观察、状态和动作排列成一个统一的序列建模任务来重新定义运动预测和运动规划问题。我们的方法将轨迹生成问题与其他序列建模问题结合起来，借助领域间的突破性进展（如语言建模），实现快速迭代。引人注目的是，实验结果表明，大规模轨迹模型（如STR）遵循扩展定律，展示了",
    "tldr": "大规模轨迹模型（LTMs）采用State Transformer (STR)模型，将运动预测和规划问题统一建模，有效应对自动驾驶中的挑战。"
}