{
    "title": "Sentiment analysis with adaptive multi-head attention in Transformer",
    "abstract": "arXiv:2310.14505v4 Announce Type: replace  Abstract: We propose a novel framework based on the attention mechanism to identify the sentiment of a movie review document. Previous efforts on deep neural networks with attention mechanisms focus on encoder and decoder with fixed numbers of multi-head attention. Therefore, we need a mechanism to stop the attention process automatically if no more useful information can be read from the memory.In this paper, we propose an adaptive multi-head attention architecture (AdaptAttn) which varies the number of attention heads based on length of sentences. AdaptAttn has a data preprocessing step where each document is classified into any one of the three bins small, medium or large based on length of the sentence. The document classified as small goes through two heads in each layer, the medium group passes four heads and the large group is processed by eight heads. We examine the merit of our model on the Stanford large movie review dataset. The exp",
    "link": "https://arxiv.org/abs/2310.14505",
    "context": "Title: Sentiment analysis with adaptive multi-head attention in Transformer\nAbstract: arXiv:2310.14505v4 Announce Type: replace  Abstract: We propose a novel framework based on the attention mechanism to identify the sentiment of a movie review document. Previous efforts on deep neural networks with attention mechanisms focus on encoder and decoder with fixed numbers of multi-head attention. Therefore, we need a mechanism to stop the attention process automatically if no more useful information can be read from the memory.In this paper, we propose an adaptive multi-head attention architecture (AdaptAttn) which varies the number of attention heads based on length of sentences. AdaptAttn has a data preprocessing step where each document is classified into any one of the three bins small, medium or large based on length of the sentence. The document classified as small goes through two heads in each layer, the medium group passes four heads and the large group is processed by eight heads. We examine the merit of our model on the Stanford large movie review dataset. The exp",
    "path": "papers/23/10/2310.14505.json",
    "total_tokens": 675,
    "translated_title": "基于Transformer中自适应多头注意力机制的情感分析",
    "translated_abstract": "我们提出了一个基于注意力机制的新框架，用于识别电影评论文档的情感。我们的论文中提出了一种自适应多头注意力架构（AdaptAttn），根据句子长度变化头数。AdaptAttn有一个数据预处理步骤，根据句子长度将每个文档分类为三个桶中的任一个：小、中或大。我们在斯坦福大型电影评论数据集上检验了我们模型的优点。",
    "tldr": "提出了一种基于Transformer的自适应多头注意力架构，根据句子长度变化头数，用于电影评论文档的情感分析。",
    "en_tdlr": "Proposed an adaptive multi-head attention architecture in Transformer that varies the number of heads based on sentence length for sentiment analysis of movie review documents."
}