{
    "title": "Distributed Uncertainty Quantification of Kernel Interpolation on Spheres. (arXiv:2310.16384v1 [math.NA])",
    "abstract": "For radial basis function (RBF) kernel interpolation of scattered data, Schaback in 1995 proved that the attainable approximation error and the condition number of the underlying interpolation matrix cannot be made small simultaneously. He referred to this finding as an \"uncertainty relation\", an undesirable consequence of which is that RBF kernel interpolation is susceptible to noisy data. In this paper, we propose and study a distributed interpolation method to manage and quantify the uncertainty brought on by interpolating noisy spherical data of non-negligible magnitude. We also present numerical simulation results showing that our method is practical and robust in terms of handling noisy data from challenging computing environments.",
    "link": "http://arxiv.org/abs/2310.16384",
    "context": "Title: Distributed Uncertainty Quantification of Kernel Interpolation on Spheres. (arXiv:2310.16384v1 [math.NA])\nAbstract: For radial basis function (RBF) kernel interpolation of scattered data, Schaback in 1995 proved that the attainable approximation error and the condition number of the underlying interpolation matrix cannot be made small simultaneously. He referred to this finding as an \"uncertainty relation\", an undesirable consequence of which is that RBF kernel interpolation is susceptible to noisy data. In this paper, we propose and study a distributed interpolation method to manage and quantify the uncertainty brought on by interpolating noisy spherical data of non-negligible magnitude. We also present numerical simulation results showing that our method is practical and robust in terms of handling noisy data from challenging computing environments.",
    "path": "papers/23/10/2310.16384.json",
    "total_tokens": 761,
    "translated_title": "分布式的不确定度量化：球面上的核插值",
    "translated_abstract": "对于散乱数据的径向基函数（RBF）核插值，Schaback在1995年证明了可达到的逼近误差和基础插值矩阵的条件数不能同时变小。他将这一发现称为“不确定关系”，其中的一个不可取的结果是RBF核插值容易受到噪声数据的干扰。在本文中，我们提出并研究了一种分布式插值方法，用于管理和量化通过插值非零程度的球面嘈杂数据而带来的不确定性。我们还提供了数值模拟结果，表明我们的方法在处理来自具有挑战性计算环境的噪声数据方面是实用和强大的。",
    "tldr": "本文提出和研究了一种分布式插值方法，用于管理和量化通过插值球面嘈杂数据而带来的不确定性。数值模拟结果表明该方法在处理具有挑战性计算环境中的噪声数据方面是实用和强大的。",
    "en_tdlr": "This paper proposes and studies a distributed interpolation method to manage and quantify the uncertainty brought on by interpolating noisy spherical data. Numerical simulation results show that the method is practical and robust in handling noisy data from challenging computing environments."
}