{
    "title": "Sparse Index Tracking via Topological Learning. (arXiv:2310.09578v1 [cs.CE])",
    "abstract": "In this research, we introduce a novel methodology for the index tracking problem with sparse portfolios by leveraging topological data analysis (TDA). Utilizing persistence homology to measure the riskiness of assets, we introduce a topological method for data-driven learning of the parameters for regularization terms. Specifically, the Vietoris-Rips filtration method is utilized to capture the intricate topological features of asset movements, providing a robust framework for portfolio tracking. Our approach has the advantage of accommodating both $\\ell_1$ and $\\ell_2$ penalty terms without the requirement for expensive estimation procedures. We empirically validate the performance of our methodology against state-of-the-art sparse index tracking techniques, such as Elastic-Net and SLOPE, using a dataset that covers 23 years of S&P500 index and its constituent data. Our out-of-sample results show that this computationally efficient technique surpasses conventional methods across risk",
    "link": "http://arxiv.org/abs/2310.09578",
    "context": "Title: Sparse Index Tracking via Topological Learning. (arXiv:2310.09578v1 [cs.CE])\nAbstract: In this research, we introduce a novel methodology for the index tracking problem with sparse portfolios by leveraging topological data analysis (TDA). Utilizing persistence homology to measure the riskiness of assets, we introduce a topological method for data-driven learning of the parameters for regularization terms. Specifically, the Vietoris-Rips filtration method is utilized to capture the intricate topological features of asset movements, providing a robust framework for portfolio tracking. Our approach has the advantage of accommodating both $\\ell_1$ and $\\ell_2$ penalty terms without the requirement for expensive estimation procedures. We empirically validate the performance of our methodology against state-of-the-art sparse index tracking techniques, such as Elastic-Net and SLOPE, using a dataset that covers 23 years of S&P500 index and its constituent data. Our out-of-sample results show that this computationally efficient technique surpasses conventional methods across risk",
    "path": "papers/23/10/2310.09578.json",
    "total_tokens": 953,
    "translated_title": "稀疏指数跟踪的拓扑学习方法研究",
    "translated_abstract": "在这项研究中，我们通过利用拓扑数据分析（TDA）引入了一种新颖的方法来解决稀疏投资组合的指数跟踪问题。我们利用持久性同调来衡量资产的风险性，引入了一种基于数据驱动的学习参数正则化项的拓扑方法。具体而言，我们利用Vietoris-Rips滤波方法来捕捉资产运动的复杂拓扑特征，提供了一个强大的投资组合跟踪框架。我们的方法具有同时适应$\\ell_1$和$\\ell_2$惩罚项的优势，而无需昂贵的估计过程。我们通过使用包含23年的S&P500指数及其成分数据的数据集，对我们的方法进行了实证验证，并与Elastic-Net和SLOPE等最先进的稀疏指数跟踪技术进行了对比。我们的样本外结果表明，这种计算效率高的技术在风险控制方面超过了传统方法。",
    "tldr": "本研究通过利用拓扑数据分析，提出了一种用于解决稀疏投资组合的指数跟踪问题的新方法。该方法利用持久性同调衡量资产风险，并通过拓扑学习参数的数据驱动方法进行正则化。实证结果表明，这种技术在风险控制方面优于传统方法。"
}