{
    "title": "Green ammonia supply chain and associated market structure: an analysis based on transaction cost economics. (arXiv:2310.19498v1 [econ.GN])",
    "abstract": "Green ammonia is poised to be a key part in the hydrogen economy. This paper discusses green ammonia supply chains from a higher-level industry perspective with a focus on market structures. The architecture of upstream and downstream supply chains are explored. Potential ways to accelerate market emergence are discussed. Market structure is explored based on transaction cost economics and lessons from the oil and gas industry. Three market structure prototypes are developed for different phases. In the infancy, a highly vertically integrated structure is proposed to reduce risks and ensure capital recovery. A restructuring towards a disintegrated structure is necessary in the next stage to improve the efficiency. In the late stage, a competitive structure characterized by a separation between asset ownership and production activities and further development of short-term and spot markets is proposed towards a market-driven industry. Finally, a multi-linear regression model is develope",
    "link": "http://arxiv.org/abs/2310.19498",
    "context": "Title: Green ammonia supply chain and associated market structure: an analysis based on transaction cost economics. (arXiv:2310.19498v1 [econ.GN])\nAbstract: Green ammonia is poised to be a key part in the hydrogen economy. This paper discusses green ammonia supply chains from a higher-level industry perspective with a focus on market structures. The architecture of upstream and downstream supply chains are explored. Potential ways to accelerate market emergence are discussed. Market structure is explored based on transaction cost economics and lessons from the oil and gas industry. Three market structure prototypes are developed for different phases. In the infancy, a highly vertically integrated structure is proposed to reduce risks and ensure capital recovery. A restructuring towards a disintegrated structure is necessary in the next stage to improve the efficiency. In the late stage, a competitive structure characterized by a separation between asset ownership and production activities and further development of short-term and spot markets is proposed towards a market-driven industry. Finally, a multi-linear regression model is develope",
    "path": "papers/23/10/2310.19498.json",
    "total_tokens": 948,
    "translated_title": "绿色氨供应链及相关市场结构的研究：基于交易成本经济学的分析",
    "translated_abstract": "绿色氨预计将成为氢能经济的关键组成部分。本文从更高层面的行业角度讨论了绿色氨供应链，并关注市场结构。探索了上游和下游供应链的架构。讨论了加速市场出现的潜在途径。基于交易成本经济学和石油天然气行业的经验，探讨了市场结构。针对不同时期，开发了三种不同的市场结构样本。在初期阶段，提出了高度垂直整合的结构，以减少风险并确保资本回收。在下一个阶段，需要进行重组，转向非整合结构，以提高效率。在晚期阶段，提出了以资产所有权和生产活动分离为特征的竞争结构，并进一步发展短期和现货市场，以实现市场驱动的行业发展。最后，还开发了一个多重线性回归模型。",
    "tldr": "本文从交易成本经济学的角度探讨了绿色氨供应链和市场结构。根据不同时期的特点，提出了不同阶段的市场结构样本，包括高度垂直整合的结构、非整合结构和竞争结构。同时，还提出了加速市场出现的潜在途径，并开发了一个多重线性回归模型。",
    "en_tdlr": "This paper analyzes the green ammonia supply chain and market structure from the perspective of transaction cost economics. Three market structure prototypes are proposed for different phases, including highly vertically integrated structure, disintegrated structure, and competitive structure. Potential ways to accelerate market emergence are discussed, and a multi-linear regression model is developed."
}