{
    "title": "Finding Pragmatic Differences Between Disciplines. (arXiv:2310.00204v1 [cs.CL])",
    "abstract": "Scholarly documents have a great degree of variation, both in terms of content (semantics) and structure (pragmatics). Prior work in scholarly document understanding emphasizes semantics through document summarization and corpus topic modeling but tends to omit pragmatics such as document organization and flow. Using a corpus of scholarly documents across 19 disciplines and state-of-the-art language modeling techniques, we learn a fixed set of domain-agnostic descriptors for document sections and \"retrofit\" the corpus to these descriptors (also referred to as \"normalization\"). Then, we analyze the position and ordering of these descriptors across documents to understand the relationship between discipline and structure. We report within-discipline structural archetypes, variability, and between-discipline comparisons, supporting the hypothesis that scholarly communities, despite their size, diversity, and breadth, share similar avenues for expressing their work. Our findings lay the fo",
    "link": "http://arxiv.org/abs/2310.00204",
    "context": "Title: Finding Pragmatic Differences Between Disciplines. (arXiv:2310.00204v1 [cs.CL])\nAbstract: Scholarly documents have a great degree of variation, both in terms of content (semantics) and structure (pragmatics). Prior work in scholarly document understanding emphasizes semantics through document summarization and corpus topic modeling but tends to omit pragmatics such as document organization and flow. Using a corpus of scholarly documents across 19 disciplines and state-of-the-art language modeling techniques, we learn a fixed set of domain-agnostic descriptors for document sections and \"retrofit\" the corpus to these descriptors (also referred to as \"normalization\"). Then, we analyze the position and ordering of these descriptors across documents to understand the relationship between discipline and structure. We report within-discipline structural archetypes, variability, and between-discipline comparisons, supporting the hypothesis that scholarly communities, despite their size, diversity, and breadth, share similar avenues for expressing their work. Our findings lay the fo",
    "path": "papers/23/10/2310.00204.json",
    "total_tokens": 902,
    "translated_title": "发现学科间的实用差异",
    "translated_abstract": "学术文档在内容（语义）和结构（语用）方面具有很大的变化。以往的学术文档理解研究侧重于语义，通过文档摘要和语料库主题建模，但往往忽略了语用，如文档组织和流程。本研究使用19个学科的学术文档语料库和先进的语言建模技术，学习了一组固定的与学科无关的文档部分描述符，并将语料库调整到这些描述符中（也称为“归一化”）。然后，我们分析了文档中这些描述符的位置和顺序，以了解学科和结构之间的关系。我们报告了学科内的结构原型、可变性和学科间的比较，支持学术社区尽管规模、多样性和广度各异，但在表达工作方面存在着相似的途径。我们的发现为进一步研究学术文档理解提供了基础。",
    "tldr": "本研究通过使用学科间的学术文档语料库和先进的语言建模技术，发现了学科间的实用差异，重点在于文档组织和流程的语用方面。研究结果显示学术社区在表达工作的方式上存在相似的途径。",
    "en_tdlr": "This study explores pragmatic differences between disciplines in scholarly documents, focusing on the language use in document organization and flow. Using a corpus of scholarly documents and advanced language modeling techniques, the research reveals similarities in how academic communities express their work, despite their diverse backgrounds and areas of study."
}