{
    "title": "Nowcasting day-ahead marginal emissions using multi-headed CNNs and deep generative models. (arXiv:2310.01524v1 [cs.LG])",
    "abstract": "Nowcasting day-ahead marginal emissions factors is increasingly important for power systems with high flexibility and penetration of distributed energy resources. With a significant share of firm generation from natural gas and coal power plants, forecasting day-ahead emissions in the current energy system has been widely studied. In contrast, as we shift to an energy system characterized by flexible power markets, dispatchable sources, and competing low-cost generation such as large-scale battery or hydrogen storage, system operators will be able to choose from a mix of different generation as well as emission pathways. To fully develop the emissions implications of a given dispatch schedule, we need a near real-time workflow with two layers. The first layer is a market model that continuously solves a security-constrained economic dispatch model. The second layer determines the marginal emissions based on the output of the market model, which is the subject of this paper. We propose ",
    "link": "http://arxiv.org/abs/2310.01524",
    "context": "Title: Nowcasting day-ahead marginal emissions using multi-headed CNNs and deep generative models. (arXiv:2310.01524v1 [cs.LG])\nAbstract: Nowcasting day-ahead marginal emissions factors is increasingly important for power systems with high flexibility and penetration of distributed energy resources. With a significant share of firm generation from natural gas and coal power plants, forecasting day-ahead emissions in the current energy system has been widely studied. In contrast, as we shift to an energy system characterized by flexible power markets, dispatchable sources, and competing low-cost generation such as large-scale battery or hydrogen storage, system operators will be able to choose from a mix of different generation as well as emission pathways. To fully develop the emissions implications of a given dispatch schedule, we need a near real-time workflow with two layers. The first layer is a market model that continuously solves a security-constrained economic dispatch model. The second layer determines the marginal emissions based on the output of the market model, which is the subject of this paper. We propose ",
    "path": "papers/23/10/2310.01524.json",
    "total_tokens": 897,
    "translated_title": "现场预测利用多头卷积神经网络和深度生成模型预测次日边际排放",
    "translated_abstract": "利用多头卷积神经网络和深度生成模型现场预测次日边际排放因素对于具有高灵活性和分布式能源资源渗透的电力系统变得越来越重要。在当前能源系统中，由天然气和燃煤发电厂提供的大部分的固定发电量，已经广泛研究了对次日排放的预测。相反，随着我们转向以灵活的电力市场、可分配资源和竞争性低成本发电（如大规模电池或氢储存）为特征的能源系统，系统操作员将能够从不同发电以及排放路径的组合中进行选择。为了充分开发给定调度计划的排放影响，我们需要一个具有两个层级的近实时工作流程。第一层是一个市场模型，不断解决一个安全约束经济调度模型。第二层根据市场模型的输出确定边际排放，这是本文的主题。",
    "tldr": "本论文提出了一种利用多头卷积神经网络和深度生成模型的方法，进行现场预测次日边际排放因素，以适应高灵活性和分布式能源资源渗透的电力系统。",
    "en_tdlr": "This paper proposes a method for nowcasting day-ahead marginal emissions factors using multi-headed CNNs and deep generative models, to adapt to power systems with high flexibility and penetration of distributed energy resources."
}