{
    "title": "AMIR: Automated MisInformation Rebuttal -- A COVID-19 Vaccination Datasets based Recommendation System. (arXiv:2310.19834v1 [cs.AI])",
    "abstract": "Misinformation has emerged as a major societal threat in recent years in general; specifically in the context of the COVID-19 pandemic, it has wrecked havoc, for instance, by fuelling vaccine hesitancy. Cost-effective, scalable solutions for combating misinformation are the need of the hour. This work explored how existing information obtained from social media and augmented with more curated fact checked data repositories can be harnessed to facilitate automated rebuttal of misinformation at scale. While the ideas herein can be generalized and reapplied in the broader context of misinformation mitigation using a multitude of information sources and catering to the spectrum of social media platforms, this work serves as a proof of concept, and as such, it is confined in its scope to only rebuttal of tweets, and in the specific context of misinformation regarding COVID-19. It leverages two publicly available datasets, viz. FaCov (fact-checked articles) and misleading (social media Twitt",
    "link": "http://arxiv.org/abs/2310.19834",
    "context": "Title: AMIR: Automated MisInformation Rebuttal -- A COVID-19 Vaccination Datasets based Recommendation System. (arXiv:2310.19834v1 [cs.AI])\nAbstract: Misinformation has emerged as a major societal threat in recent years in general; specifically in the context of the COVID-19 pandemic, it has wrecked havoc, for instance, by fuelling vaccine hesitancy. Cost-effective, scalable solutions for combating misinformation are the need of the hour. This work explored how existing information obtained from social media and augmented with more curated fact checked data repositories can be harnessed to facilitate automated rebuttal of misinformation at scale. While the ideas herein can be generalized and reapplied in the broader context of misinformation mitigation using a multitude of information sources and catering to the spectrum of social media platforms, this work serves as a proof of concept, and as such, it is confined in its scope to only rebuttal of tweets, and in the specific context of misinformation regarding COVID-19. It leverages two publicly available datasets, viz. FaCov (fact-checked articles) and misleading (social media Twitt",
    "path": "papers/23/10/2310.19834.json",
    "total_tokens": 962,
    "translated_title": "AMIR：基于COVID-19疫苗数据集的自动化虚假信息驳斥推荐系统",
    "translated_abstract": "虚假信息近年来已成为一个重要的社会威胁，特别是在COVID-19大流行的背景下，它加剧了疫苗犹豫不决。对抗虚假信息的成本效益高、可扩展的解决方案是当务之急。本研究探讨如何利用社交媒体获取的现有信息，并与更多经过策划的事实核查数据库相结合，以促进大规模自动驳斥虚假信息。虽然这里的想法可以推广并重新应用于使用多种信息来源和满足社交媒体平台光谱的较大范围的虚假信息缓解，但本工作作为一个概念验证受限于其范围，仅限于对推文的反驳，且仅限于COVID-19相关的虚假信息。它利用了两个公开可用的数据集，即FaCov（经事实核查的文章）和misleading（社交媒体推文）。",
    "tldr": "本研究提出了基于COVID-19疫苗数据集的自动化虚假信息驳斥推荐系统，利用社交媒体信息和经过策划的事实核查数据，实现了大规模自动驳斥虚假信息。这为对抗虚假信息提供了一种成本效益高、可扩展的解决方案。",
    "en_tdlr": "This study proposes an automated misinformation rebuttal recommendation system based on COVID-19 vaccination datasets, which utilizes social media information and curated fact-checked data to achieve large-scale automated rebuttal of misinformation. It provides a cost-effective and scalable solution for combating misinformation."
}