{
    "title": "Data-centric Graph Learning: A Survey. (arXiv:2310.04987v2 [cs.LG] UPDATED)",
    "abstract": "The history of artificial intelligence (AI) has witnessed the significant impact of high-quality data on various deep learning models, such as ImageNet for AlexNet and ResNet. Recently, instead of designing more complex neural architectures as model-centric approaches, the attention of AI community has shifted to data-centric ones, which focuses on better processing data to strengthen the ability of neural models. Graph learning, which operates on ubiquitous topological data, also plays an important role in the era of deep learning. In this survey, we comprehensively review graph learning approaches from the data-centric perspective, and aim to answer three crucial questions: (1) when to modify graph data, (2) what part of the graph data needs modification to unlock the potential of various graph models, and (3) how to safeguard graph models from problematic data influence. Accordingly, we propose a novel taxonomy based on the stages in the graph learning pipeline, and highlight the pr",
    "link": "http://arxiv.org/abs/2310.04987",
    "context": "Title: Data-centric Graph Learning: A Survey. (arXiv:2310.04987v2 [cs.LG] UPDATED)\nAbstract: The history of artificial intelligence (AI) has witnessed the significant impact of high-quality data on various deep learning models, such as ImageNet for AlexNet and ResNet. Recently, instead of designing more complex neural architectures as model-centric approaches, the attention of AI community has shifted to data-centric ones, which focuses on better processing data to strengthen the ability of neural models. Graph learning, which operates on ubiquitous topological data, also plays an important role in the era of deep learning. In this survey, we comprehensively review graph learning approaches from the data-centric perspective, and aim to answer three crucial questions: (1) when to modify graph data, (2) what part of the graph data needs modification to unlock the potential of various graph models, and (3) how to safeguard graph models from problematic data influence. Accordingly, we propose a novel taxonomy based on the stages in the graph learning pipeline, and highlight the pr",
    "path": "papers/23/10/2310.04987.json",
    "total_tokens": 863,
    "translated_title": "数据中心化图学习：一份综述",
    "translated_abstract": "人工智能的历史见证了高质量数据对各种深度学习模型的重大影响，例如AlexNet和ResNet的ImageNet。最近，与以模型为中心的方法设计更复杂的神经结构不同，人工智能社区的关注重点转向了以数据为中心的方法，该方法侧重于更好地处理数据以增强神经模型的能力。而在深度学习时代，操作普遍存在的拓扑数据的图学习也发挥着重要作用。在本综述中，我们从数据中心化的角度全面评估了图学习方法，并旨在回答三个关键问题：（1）何时修改图数据，（2）图数据的哪一部分需要修改以释放各种图模型的潜力，以及（3）如何保护图模型免受有问题的数据的影响。因此，我们提出了一个基于图学习流程阶段的创新分类法，并突出了关键创新和贡献。",
    "tldr": "本综述从数据中心化的角度全面评估了图学习方法，回答了何时修改图数据、图数据的哪一部分需要修改以及如何保护图模型的关键问题。",
    "en_tdlr": "This survey comprehensively evaluates graph learning approaches from a data-centric perspective, answering crucial questions about when to modify graph data, what part of the graph data needs modification, and how to safeguard graph models."
}