{
    "title": "Lyricist-Singer Entropy Affects Lyric-Lyricist Classification Performance. (arXiv:2310.11035v1 [cs.SD])",
    "abstract": "Although lyrics represent an essential component of music, few music information processing studies have been conducted on the characteristics of lyricists. Because these characteristics may be valuable for musical applications, such as recommendations, they warrant further study. We considered a potential method that extracts features representing the characteristics of lyricists from lyrics. Because these features must be identified prior to extraction, we focused on lyricists with easily identifiable features. We believe that it is desirable for singers to perform unique songs that share certain characteristics specific to the singer. Accordingly, we hypothesized that lyricists account for the unique characteristics of the singers they write lyrics for. In other words, lyric-lyricist classification performance or the ease of capturing the features of a lyricist from the lyrics may depend on the variety of singers. In this study, we observed a relationship between lyricist-singer ent",
    "link": "http://arxiv.org/abs/2310.11035",
    "context": "Title: Lyricist-Singer Entropy Affects Lyric-Lyricist Classification Performance. (arXiv:2310.11035v1 [cs.SD])\nAbstract: Although lyrics represent an essential component of music, few music information processing studies have been conducted on the characteristics of lyricists. Because these characteristics may be valuable for musical applications, such as recommendations, they warrant further study. We considered a potential method that extracts features representing the characteristics of lyricists from lyrics. Because these features must be identified prior to extraction, we focused on lyricists with easily identifiable features. We believe that it is desirable for singers to perform unique songs that share certain characteristics specific to the singer. Accordingly, we hypothesized that lyricists account for the unique characteristics of the singers they write lyrics for. In other words, lyric-lyricist classification performance or the ease of capturing the features of a lyricist from the lyrics may depend on the variety of singers. In this study, we observed a relationship between lyricist-singer ent",
    "path": "papers/23/10/2310.11035.json",
    "total_tokens": 885,
    "translated_title": "歌词创作者歌手熵影响歌词-创作者分类的性能",
    "translated_abstract": "虽然歌词是音乐的重要组成部分，但对歌词创作者的特征进行音乐信息处理研究的数量很少。由于这些特征在音乐应用中可能非常有价值，如推荐系统，因此需要进一步研究。我们考虑了一种从歌词中提取代表歌词创作者特征的潜在方法。由于这些特征必须在提取之前进行识别，我们将重点放在具有易于识别特征的歌词创作者上。我们认为歌手应该演唱具有特定于歌手的某些特征的独特歌曲。因此，我们假设歌词创作者对他们为其写歌歌手的独特特征负有责任。换句话说，歌词-创作者分类的性能或从歌词中捕捉到歌词创作者特征的难易程度可能取决于歌手的多样性。在这项研究中，我们观察到歌词创作者和歌手之间的关系。",
    "tldr": "本文研究了歌词创作者和演唱者之间的关系，发现歌词-创作者分类的性能取决于演唱者的多样性。",
    "en_tdlr": "This study explores the relationship between lyricists and singers and finds that the performance of lyric-lyricist classification depends on the diversity of singers."
}