{
    "title": "Robust Learning for Smoothed Online Convex Optimization with Feedback Delay. (arXiv:2310.20098v1 [cs.LG])",
    "abstract": "We study a challenging form of Smoothed Online Convex Optimization, a.k.a. SOCO, including multi-step nonlinear switching costs and feedback delay. We propose a novel machine learning (ML) augmented online algorithm, Robustness-Constrained Learning (RCL), which combines untrusted ML predictions with a trusted expert online algorithm via constrained projection to robustify the ML prediction. Specifically,we prove that RCL is able to guarantee$(1+\\lambda)$-competitiveness against any given expert for any$\\lambda>0$, while also explicitly training the ML model in a robustification-aware manner to improve the average-case performance. Importantly,RCL is the first ML-augmented algorithm with a provable robustness guarantee in the case of multi-step switching cost and feedback delay.We demonstrate the improvement of RCL in both robustness and average performance using battery management for electrifying transportationas a case study.",
    "link": "http://arxiv.org/abs/2310.20098",
    "context": "Title: Robust Learning for Smoothed Online Convex Optimization with Feedback Delay. (arXiv:2310.20098v1 [cs.LG])\nAbstract: We study a challenging form of Smoothed Online Convex Optimization, a.k.a. SOCO, including multi-step nonlinear switching costs and feedback delay. We propose a novel machine learning (ML) augmented online algorithm, Robustness-Constrained Learning (RCL), which combines untrusted ML predictions with a trusted expert online algorithm via constrained projection to robustify the ML prediction. Specifically,we prove that RCL is able to guarantee$(1+\\lambda)$-competitiveness against any given expert for any$\\lambda>0$, while also explicitly training the ML model in a robustification-aware manner to improve the average-case performance. Importantly,RCL is the first ML-augmented algorithm with a provable robustness guarantee in the case of multi-step switching cost and feedback delay.We demonstrate the improvement of RCL in both robustness and average performance using battery management for electrifying transportationas a case study.",
    "path": "papers/23/10/2310.20098.json",
    "total_tokens": 1116,
    "translated_title": "平滑在线凸优化问题中具有反馈延迟的鲁棒学习",
    "translated_abstract": "我们研究了一种具有多步非线性切换成本和反馈延迟的平滑在线凸优化问题，即SOCO。我们提出了一种新颖的机器学习（ML）增强在线算法，称为鲁棒约束学习（RCL），该算法通过约束投影将不可信的ML预测与可信的专家在线算法相结合，以提高ML预测的鲁棒性。具体来说，我们证明了RCL能够保证对于任何给定的专家，满足$(1+\\lambda)$-竞争性，其中$\\lambda>0$，同时以鲁棒化感知的方式明确训练ML模型以改善平均情况性能。重要的是，RCL是第一个能够在多步切换成本和反馈延迟的情况下提供可证明鲁棒性保证的ML增强算法。我们以电动交通的电池管理为案例研究，展示了RCL在鲁棒性和平均性能上的提升。",
    "tldr": "这项研究提出了一种鲁棒学习算法RCL，用于解决具有多步切换成本和反馈延迟的平滑在线凸优化问题。该算法将不可信的机器学习预测与可信的专家算法相结合，通过约束投影来提高机器学习预测的鲁棒性。研究结果证明了RCL能够在任何给定的专家算法下实现$(1+\\lambda)$-竞争性，并通过鲁棒化感知的方式训练机器学习模型以提高平均性能。实验证明了RCL在电动交通的电池管理中的应用表现出了鲁棒性和平均性能的提升。",
    "en_tdlr": "This research proposes a robust learning algorithm, RCL, for solving smoothed online convex optimization problems with multi-step switching costs and feedback delay. The algorithm combines untrusted machine learning predictions with trusted expert algorithms to enhance the robustness of the predictions. The study demonstrates that RCL achieves $(1+\\lambda)$-competitiveness against any given expert algorithm and trains the machine learning model in a robustification-aware manner to improve average performance. The application of RCL in battery management for electrifying transportation shows improved robustness and average performance."
}