{
    "title": "Investigating Multilingual Coreference Resolution by Universal Annotations. (arXiv:2310.17734v1 [cs.CL])",
    "abstract": "Multilingual coreference resolution (MCR) has been a long-standing and challenging task. With the newly proposed multilingual coreference dataset, CorefUD (Nedoluzhko et al., 2022), we conduct an investigation into the task by using its harmonized universal morphosyntactic and coreference annotations. First, we study coreference by examining the ground truth data at different linguistic levels, namely mention, entity and document levels, and across different genres, to gain insights into the characteristics of coreference across multiple languages. Second, we perform an error analysis of the most challenging cases that the SotA system fails to resolve in the CRAC 2022 shared task using the universal annotations. Last, based on this analysis, we extract features from universal morphosyntactic annotations and integrate these features into a baseline system to assess their potential benefits for the MCR task. Our results show that our best configuration of features improves the baseline b",
    "link": "http://arxiv.org/abs/2310.17734",
    "context": "Title: Investigating Multilingual Coreference Resolution by Universal Annotations. (arXiv:2310.17734v1 [cs.CL])\nAbstract: Multilingual coreference resolution (MCR) has been a long-standing and challenging task. With the newly proposed multilingual coreference dataset, CorefUD (Nedoluzhko et al., 2022), we conduct an investigation into the task by using its harmonized universal morphosyntactic and coreference annotations. First, we study coreference by examining the ground truth data at different linguistic levels, namely mention, entity and document levels, and across different genres, to gain insights into the characteristics of coreference across multiple languages. Second, we perform an error analysis of the most challenging cases that the SotA system fails to resolve in the CRAC 2022 shared task using the universal annotations. Last, based on this analysis, we extract features from universal morphosyntactic annotations and integrate these features into a baseline system to assess their potential benefits for the MCR task. Our results show that our best configuration of features improves the baseline b",
    "path": "papers/23/10/2310.17734.json",
    "total_tokens": 895,
    "translated_title": "调查多语言共指消解的通用注释方法",
    "translated_abstract": "多语言共指消解(MCR)一直是一个长期而具有挑战性的任务。我们利用最新提出的多语言共指数据集CorefUD(Nedoluzhko et al., 2022)的通用形态句法和共指注释，对该任务进行了研究。首先，我们通过在不同语言层次（提及、实体和文档层次）和不同流派上检查真实数据，来了解多语言共指的特点。其次，我们对在CRAC 2022共享任务中State-of-the-Art系统无法解决的最具挑战性的案例进行了错误分析，使用了通用注释。最后，基于这个分析，我们从通用形态句法注释中提取特征，并将这些特征整合到一个基线系统中，评估它们对MCR任务的潜在好处。我们的结果表明，我们的最佳特征配置改进了基线系统。",
    "tldr": "本论文通过使用通用注释方法研究多语言共指消解任务。首先，通过研究不同语言层次和流派上的真实数据来了解多语言共指的特点。其次，进行错误分析，并提取特征用于改进共指消解任务。结果表明，我们的方法对基线系统有潜在好处。",
    "en_tdlr": "This paper investigates multilingual coreference resolution task by using universal annotations. It studies the characteristics of coreference across multiple languages, conducts error analysis, and proposes a feature-based improvement approach. Results show potential benefits of the proposed method for the baseline system."
}