{
    "title": "MRI brain tumor segmentation using informative feature vectors and kernel dictionary learning. (arXiv:2310.10963v1 [cs.CV])",
    "abstract": "This paper presents a method based on a kernel dictionary learning algorithm for segmenting brain tumor regions in magnetic resonance images (MRI). A set of first-order and second-order statistical feature vectors are extracted from patches of size 3 * 3 around pixels in the brain MRI scans. These feature vectors are utilized to train two kernel dictionaries separately for healthy and tumorous tissues. To enhance the efficiency of the dictionaries and reduce training time, a correlation-based sample selection technique is developed to identify the most informative and discriminative subset of feature vectors. This technique aims to improve the performance of the dictionaries by selecting a subset of feature vectors that provide valuable information for the segmentation task. Subsequently, a linear classifier is utilized to distinguish between healthy and unhealthy pixels based on the learned dictionaries. The results demonstrate that the proposed method outperforms other existing metho",
    "link": "http://arxiv.org/abs/2310.10963",
    "context": "Title: MRI brain tumor segmentation using informative feature vectors and kernel dictionary learning. (arXiv:2310.10963v1 [cs.CV])\nAbstract: This paper presents a method based on a kernel dictionary learning algorithm for segmenting brain tumor regions in magnetic resonance images (MRI). A set of first-order and second-order statistical feature vectors are extracted from patches of size 3 * 3 around pixels in the brain MRI scans. These feature vectors are utilized to train two kernel dictionaries separately for healthy and tumorous tissues. To enhance the efficiency of the dictionaries and reduce training time, a correlation-based sample selection technique is developed to identify the most informative and discriminative subset of feature vectors. This technique aims to improve the performance of the dictionaries by selecting a subset of feature vectors that provide valuable information for the segmentation task. Subsequently, a linear classifier is utilized to distinguish between healthy and unhealthy pixels based on the learned dictionaries. The results demonstrate that the proposed method outperforms other existing metho",
    "path": "papers/23/10/2310.10963.json",
    "total_tokens": 837,
    "translated_title": "使用信息特征向量和核字典学习的MRI脑肿瘤分割",
    "translated_abstract": "本文提出了一种基于核字典学习算法的方法，用于在磁共振成像（MRI）中分割脑肿瘤区域。从脑MRI扫描中的像素周围大小为3×3的补丁中提取一组一阶和二阶统计特征向量。利用这些特征向量分别训练两个核字典，用于健康和肿瘤组织的分割。为了提高字典的效率和减少训练时间，开发了一种基于相关性的样本选择技术，用于识别最具信息量和区分度的特征向量子集。该技术旨在通过选择一组特征向量来提供有价值的分割任务信息，从而改善字典的性能。随后，利用线性分类器基于学习到的字典来区分健康像素和异常像素。结果表明，所提出的方法优于其他现有方法。",
    "tldr": "本文提出一种基于核字典学习算法的方法，利用统计特征向量和相关性样本选择技术，在MRI中实现了脑肿瘤的有效分割。",
    "en_tdlr": "This paper proposes a method based on kernel dictionary learning algorithm to achieve efficient segmentation of brain tumors in MRI by utilizing statistical feature vectors and correlation-based sample selection technique."
}