{
    "title": "Unifying (Quantum) Statistical and Parametrized (Quantum) Algorithms. (arXiv:2310.17716v1 [quant-ph])",
    "abstract": "Kearns' statistical query (SQ) oracle (STOC'93) lends a unifying perspective for most classical machine learning algorithms. This ceases to be true in quantum learning, where many settings do not admit, neither an SQ analog nor a quantum statistical query (QSQ) analog. In this work, we take inspiration from Kearns' SQ oracle and Valiant's weak evaluation oracle (TOCT'14) and establish a unified perspective bridging the statistical and parametrized learning paradigms in a novel way. We explore the problem of learning from an evaluation oracle, which provides an estimate of function values, and introduce an extensive yet intuitive framework that yields unconditional lower bounds for learning from evaluation queries and characterizes the query complexity for learning linear function classes. The framework is directly applicable to the QSQ setting and virtually all algorithms based on loss function optimization.  Our first application is to extend prior results on the learnability of outpu",
    "link": "http://arxiv.org/abs/2310.17716",
    "context": "Title: Unifying (Quantum) Statistical and Parametrized (Quantum) Algorithms. (arXiv:2310.17716v1 [quant-ph])\nAbstract: Kearns' statistical query (SQ) oracle (STOC'93) lends a unifying perspective for most classical machine learning algorithms. This ceases to be true in quantum learning, where many settings do not admit, neither an SQ analog nor a quantum statistical query (QSQ) analog. In this work, we take inspiration from Kearns' SQ oracle and Valiant's weak evaluation oracle (TOCT'14) and establish a unified perspective bridging the statistical and parametrized learning paradigms in a novel way. We explore the problem of learning from an evaluation oracle, which provides an estimate of function values, and introduce an extensive yet intuitive framework that yields unconditional lower bounds for learning from evaluation queries and characterizes the query complexity for learning linear function classes. The framework is directly applicable to the QSQ setting and virtually all algorithms based on loss function optimization.  Our first application is to extend prior results on the learnability of outpu",
    "path": "papers/23/10/2310.17716.json",
    "total_tokens": 901,
    "translated_title": "统一（量子）统计和参数化（量子）算法",
    "translated_abstract": "Kearns的统计查询（SQ）oracle（STOC'93）为大多数经典机器学习算法提供了统一的视角。然而在量子学习中这一点不再成立，因为许多设置既没有SQ的类比，也没有量子统计查询（QSQ）的类比。在本文中，我们借鉴了Kearns的SQ oracle和Valiant的弱评估oracle（TOCT'14），通过一种新颖的方式建立了统计和参数化学习范例之间的统一视角。我们探索了从评估oracle中学习的问题，该oracle提供了函数值的估计，并引入了一个广泛而直观的框架，为从评估查询中学习提供了无条件的下界，并且对于学习线性函数类的查询复杂度进行了刻画。该框架直接适用于QSQ设置以及所有基于损失函数优化的算法。我们的第一个应用是扩展先前关于输出可学性的结果。",
    "tldr": "本文提出了一种统一的视角，将统计和参数化学习范例相结合，探索了从评估oracle中学习的问题，并提供了无条件的下界和查询复杂度刻画。该框架适用于QSQ设置和基于损失函数优化的算法。"
}