{
    "title": "The Troubling Emergence of Hallucination in Large Language Models -- An Extensive Definition, Quantification, and Prescriptive Remediations. (arXiv:2310.04988v2 [cs.AI] UPDATED)",
    "abstract": "The recent advancements in Large Language Models (LLMs) have garnered widespread acclaim for their remarkable emerging capabilities. However, the issue of hallucination has parallelly emerged as a by-product, posing significant concerns. While some recent endeavors have been made to identify and mitigate different types of hallucination, there has been a limited emphasis on the nuanced categorization of hallucination and associated mitigation methods. To address this gap, we offer a fine-grained discourse on profiling hallucination based on its degree, orientation, and category, along with offering strategies for alleviation. As such, we define two overarching orientations of hallucination: (i) factual mirage (FM) and (ii) silver lining (SL). To provide a more comprehensive understanding, both orientations are further sub-categorized into intrinsic and extrinsic, with three degrees of severity - (i) mild, (ii) moderate, and (iii) alarming. We also meticulously categorize hallucination ",
    "link": "http://arxiv.org/abs/2310.04988",
    "context": "Title: The Troubling Emergence of Hallucination in Large Language Models -- An Extensive Definition, Quantification, and Prescriptive Remediations. (arXiv:2310.04988v2 [cs.AI] UPDATED)\nAbstract: The recent advancements in Large Language Models (LLMs) have garnered widespread acclaim for their remarkable emerging capabilities. However, the issue of hallucination has parallelly emerged as a by-product, posing significant concerns. While some recent endeavors have been made to identify and mitigate different types of hallucination, there has been a limited emphasis on the nuanced categorization of hallucination and associated mitigation methods. To address this gap, we offer a fine-grained discourse on profiling hallucination based on its degree, orientation, and category, along with offering strategies for alleviation. As such, we define two overarching orientations of hallucination: (i) factual mirage (FM) and (ii) silver lining (SL). To provide a more comprehensive understanding, both orientations are further sub-categorized into intrinsic and extrinsic, with three degrees of severity - (i) mild, (ii) moderate, and (iii) alarming. We also meticulously categorize hallucination ",
    "path": "papers/23/10/2310.04988.json",
    "total_tokens": 965,
    "translated_title": "大型语言模型中幻觉的令人担忧的出现——广泛定义、量化和规定矫正措施",
    "translated_abstract": "最近大型语言模型（LLMs）的发展引起了广泛赞誉，因为它们具有卓越的新兴能力。然而，幻觉问题也同时出现，并引发了重大关切。虽然最近有一些努力来识别和减轻不同类型的幻觉，但对幻觉的细致分类和相关缓解方法的重视有限。为了弥补这一空白，我们提供了一份关于幻觉根据其程度、倾向和类别的精细化讨论，并提供了缓解策略。因此，我们定义了两个总体倾向的幻觉：（i）事实上的海市蜃楼（FM）和（ii）银光（SL）。为了提供更全面的理解，这两个倾向进一步细分为内在和外在两种，并且有三个严重程度：（i）轻微，（ii）中度和（iii）令人担忧。我们还对幻觉进行了细致的分类。",
    "tldr": "这篇论文对大型语言模型中幻觉的问题进行了细致的定义和量化，并提出了解决方法。论文将幻觉分为两种总体倾向，并进一步细分为内在和外在两种。论文还对幻觉进行了三个程度的严重性分类。",
    "en_tdlr": "This paper provides a detailed definition and quantification of hallucination in large language models and offers remediation strategies. It classifies hallucination into two overarching orientations and further categorizes them into intrinsic and extrinsic types. The paper also introduces a severity classification with three levels."
}