{
    "title": "Targeted Adversarial Attacks on Generalizable Neural Radiance Fields. (arXiv:2310.03578v1 [cs.LG])",
    "abstract": "Neural Radiance Fields (NeRFs) have recently emerged as a powerful tool for 3D scene representation and rendering. These data-driven models can learn to synthesize high-quality images from sparse 2D observations, enabling realistic and interactive scene reconstructions. However, the growing usage of NeRFs in critical applications such as augmented reality, robotics, and virtual environments could be threatened by adversarial attacks.  In this paper we present how generalizable NeRFs can be attacked by both low-intensity adversarial attacks and adversarial patches, where the later could be robust enough to be used in real world applications. We also demonstrate targeted attacks, where a specific, predefined output scene is generated by these attack with success.",
    "link": "http://arxiv.org/abs/2310.03578",
    "context": "Title: Targeted Adversarial Attacks on Generalizable Neural Radiance Fields. (arXiv:2310.03578v1 [cs.LG])\nAbstract: Neural Radiance Fields (NeRFs) have recently emerged as a powerful tool for 3D scene representation and rendering. These data-driven models can learn to synthesize high-quality images from sparse 2D observations, enabling realistic and interactive scene reconstructions. However, the growing usage of NeRFs in critical applications such as augmented reality, robotics, and virtual environments could be threatened by adversarial attacks.  In this paper we present how generalizable NeRFs can be attacked by both low-intensity adversarial attacks and adversarial patches, where the later could be robust enough to be used in real world applications. We also demonstrate targeted attacks, where a specific, predefined output scene is generated by these attack with success.",
    "path": "papers/23/10/2310.03578.json",
    "total_tokens": 724,
    "translated_title": "针对具有推广能力的神经辐射场的目标对抗攻击",
    "translated_abstract": "3D场景表示和渲染的强大工具-神经辐射场（NeRFs）近期出现。这些数据驱动模型可以通过稀疏的2D观测学习合成高质量图像，实现逼真且交互式的场景重建。然而，NeRFs在增强现实、机器人技术和虚拟环境等关键应用中的广泛使用可能会受到对抗攻击的威胁。",
    "tldr": "本文介绍了如何通过低强度对抗攻击和对抗补丁对具有推广能力的NeRFs进行攻击，后者足够强大，可以应用于现实世界中。我们还展示了针对性攻击，这些攻击成功地生成了预定义输出场景。",
    "en_tdlr": "This paper presents targeted adversarial attacks on generalizable Neural Radiance Fields (NeRFs), demonstrating the vulnerability of these models in critical applications and showcasing low-intensity attacks as well as robust adversarial patches that can be used in real-world scenarios."
}