{
    "title": "Identifiable Latent Polynomial Causal Models Through the Lens of Change. (arXiv:2310.15580v1 [cs.LG])",
    "abstract": "Causal representation learning aims to unveil latent high-level causal representations from observed low-level data. One of its primary tasks is to provide reliable assurance of identifying these latent causal models, known as identifiability. A recent breakthrough explores identifiability by leveraging the change of causal influences among latent causal variables across multiple environments \\citep{liu2022identifying}. However, this progress rests on the assumption that the causal relationships among latent causal variables adhere strictly to linear Gaussian models. In this paper, we extend the scope of latent causal models to involve nonlinear causal relationships, represented by polynomial models, and general noise distributions conforming to the exponential family. Additionally, we investigate the necessity of imposing changes on all causal parameters and present partial identifiability results when part of them remains unchanged. Further, we propose a novel empirical estimation me",
    "link": "http://arxiv.org/abs/2310.15580",
    "context": "Title: Identifiable Latent Polynomial Causal Models Through the Lens of Change. (arXiv:2310.15580v1 [cs.LG])\nAbstract: Causal representation learning aims to unveil latent high-level causal representations from observed low-level data. One of its primary tasks is to provide reliable assurance of identifying these latent causal models, known as identifiability. A recent breakthrough explores identifiability by leveraging the change of causal influences among latent causal variables across multiple environments \\citep{liu2022identifying}. However, this progress rests on the assumption that the causal relationships among latent causal variables adhere strictly to linear Gaussian models. In this paper, we extend the scope of latent causal models to involve nonlinear causal relationships, represented by polynomial models, and general noise distributions conforming to the exponential family. Additionally, we investigate the necessity of imposing changes on all causal parameters and present partial identifiability results when part of them remains unchanged. Further, we propose a novel empirical estimation me",
    "path": "papers/23/10/2310.15580.json",
    "total_tokens": 861,
    "translated_title": "透过变化的视角，可识别的潜在多项式因果模型",
    "translated_abstract": "因果表示学习旨在从观察到的低级数据中揭示潜在的高级因果表示。其中一个主要任务是提供可靠的保证，以确保识别出这些潜在的因果模型，即可识别性。最近的一项突破性研究通过利用潜在因果变量之间在多个环境下的因果影响的变化来探索可识别性。然而，这一进展建立在潜在因果变量之间的因果关系严格遵循线性高斯模型的假设基础上。本文将潜在因果模型的范围扩展到涉及非线性因果关系的情况，这些关系由多项式模型表示，并且噪声分布符合指数分布族。此外，我们研究了对所有因果参数施加变化的必要性，并在部分参数保持不变的情况下提出了部分可识别性的结果。此外，我们提出了一种新颖的经验估计方法。",
    "tldr": "本文通过扩展潜在因果模型的范围，从线性高斯模型转化为多项式模型，并研究了部分参数保持不变时的部分识别性结果。",
    "en_tdlr": "This paper extends the scope of latent causal models to involve nonlinear causal relationships represented by polynomial models and investigates partial identifiability results when some parameters remain unchanged."
}