{
    "title": "Positional Encoding-based Resident Identification in Multi-resident Smart Homes. (arXiv:2310.17836v1 [cs.LG])",
    "abstract": "We propose a novel resident identification framework to identify residents in a multi-occupant smart environment. The proposed framework employs a feature extraction model based on the concepts of positional encoding. The feature extraction model considers the locations of homes as a graph. We design a novel algorithm to build such graphs from layout maps of smart environments. The Node2Vec algorithm is used to transform the graph into high-dimensional node embeddings. A Long Short-Term Memory (LSTM) model is introduced to predict the identities of residents using temporal sequences of sensor events with the node embeddings. Extensive experiments show that our proposed scheme effectively identifies residents in a multi-occupant environment. Evaluation results on two real-world datasets demonstrate that our proposed approach achieves 94.5% and 87.9% accuracy, respectively.",
    "link": "http://arxiv.org/abs/2310.17836",
    "context": "Title: Positional Encoding-based Resident Identification in Multi-resident Smart Homes. (arXiv:2310.17836v1 [cs.LG])\nAbstract: We propose a novel resident identification framework to identify residents in a multi-occupant smart environment. The proposed framework employs a feature extraction model based on the concepts of positional encoding. The feature extraction model considers the locations of homes as a graph. We design a novel algorithm to build such graphs from layout maps of smart environments. The Node2Vec algorithm is used to transform the graph into high-dimensional node embeddings. A Long Short-Term Memory (LSTM) model is introduced to predict the identities of residents using temporal sequences of sensor events with the node embeddings. Extensive experiments show that our proposed scheme effectively identifies residents in a multi-occupant environment. Evaluation results on two real-world datasets demonstrate that our proposed approach achieves 94.5% and 87.9% accuracy, respectively.",
    "path": "papers/23/10/2310.17836.json",
    "total_tokens": 840,
    "translated_title": "基于位置编码的多住户智能家居居民识别",
    "translated_abstract": "我们提出了一种新的居民识别框架，用于在多住户智能环境中识别居民。该框架采用了基于位置编码概念的特征提取模型。特征提取模型将住宅位置视为图形，并设计了一种新算法来从智能环境的布局图中构建这些图形。Node2Vec算法被用于将图形转化为高维节点嵌入。引入了一种长短期记忆（LSTM）模型，使用节点嵌入和传感器事件的时间序列来预测居民的身份。大量实验证明我们提出的方案可以有效地识别多住户环境中的居民。在两个真实数据集上的评估结果表明，我们提出的方法分别达到了94.5％和87.9％的准确率。",
    "tldr": "该论文提出了一种基于位置编码的多住户智能家居居民识别框架，通过构建图形和利用时间序列数据，可以有效地识别居民的身份。实验结果表明，该方法在多住户环境中可以达到较高的准确率。",
    "en_tdlr": "This paper proposes a positional encoding-based resident identification framework in multi-resident smart homes. By constructing graphs and utilizing temporal sequence data, residents can be effectively identified. Experimental results demonstrate that the proposed approach achieves high accuracy in multi-resident environments."
}