{
    "title": "Foundation Model Based Native AI Framework in 6G with Cloud-Edge-End Collaboration. (arXiv:2310.17471v1 [cs.IT])",
    "abstract": "Future wireless communication networks are in a position to move beyond data-centric, device-oriented connectivity and offer intelligent, immersive experiences based on task-oriented connections, especially in the context of the thriving development of pre-trained foundation models (PFM) and the evolving vision of 6G native artificial intelligence (AI). Therefore, redefining modes of collaboration between devices and servers and constructing native intelligence libraries become critically important in 6G. In this paper, we analyze the challenges of achieving 6G native AI from the perspectives of data, intelligence, and networks. Then, we propose a 6G native AI framework based on foundation models, provide a customization approach for intent-aware PFM, present a construction of a task-oriented AI toolkit, and outline a novel cloud-edge-end collaboration paradigm. As a practical use case, we apply this framework for orchestration, achieving the maximum sum rate within a wireless communic",
    "link": "http://arxiv.org/abs/2310.17471",
    "context": "Title: Foundation Model Based Native AI Framework in 6G with Cloud-Edge-End Collaboration. (arXiv:2310.17471v1 [cs.IT])\nAbstract: Future wireless communication networks are in a position to move beyond data-centric, device-oriented connectivity and offer intelligent, immersive experiences based on task-oriented connections, especially in the context of the thriving development of pre-trained foundation models (PFM) and the evolving vision of 6G native artificial intelligence (AI). Therefore, redefining modes of collaboration between devices and servers and constructing native intelligence libraries become critically important in 6G. In this paper, we analyze the challenges of achieving 6G native AI from the perspectives of data, intelligence, and networks. Then, we propose a 6G native AI framework based on foundation models, provide a customization approach for intent-aware PFM, present a construction of a task-oriented AI toolkit, and outline a novel cloud-edge-end collaboration paradigm. As a practical use case, we apply this framework for orchestration, achieving the maximum sum rate within a wireless communic",
    "path": "papers/23/10/2310.17471.json",
    "total_tokens": 912,
    "translated_title": "基于基础模型的6G原生AI框架与云边缘协同合作",
    "translated_abstract": "未来的无线通信网络有望超越以数据为中心、以设备为导向的连接方式，提供基于任务导向连接的智能沉浸式体验，特别是在预训练基础模型（PFM）的快速发展和6G原生人工智能（AI）的发展愿景下。因此，在6G中，重新定义设备和服务器之间的协作模式，构建原生智能库变得非常重要。在本文中，我们从数据、智能和网络的角度分析了实现6G原生AI的挑战。然后，我们基于基础模型提出了一个6G原生AI框架，提供了一种意图感知PFM的定制方法，展示了一个面向任务的AI工具包的构建，并概述了一种全新的云边缘协同合作范式。作为一个实际的使用案例，我们将该框架应用于编排，实现了无线通信中的最大速率之和。",
    "tldr": "该论文分析了从数据、智能和网络的角度来实现6G原生AI的挑战，并提出了基于基础模型的6G原生AI框架，包括自定义方法和任务导向的AI工具包，以及新的云边缘协同合作范式。",
    "en_tdlr": "This paper analyzes the challenges of achieving 6G native AI from the perspectives of data, intelligence, and networks, and proposes a 6G native AI framework based on foundation models, including customization approach for intent-aware PFM, task-oriented AI toolkit, and a novel cloud-edge-end collaboration paradigm."
}