{
    "title": "Replicating Relevance-Ranked Synonym Discovery in a New Language and Domain. (arXiv:2310.01507v1 [cs.IR])",
    "abstract": "Domain-specific synonyms occur in many specialized search tasks, such as when searching medical documents, legal documents, and software engineering artifacts. We replicate prior work on ranking domain-specific synonyms in the consumer health domain by applying the approach to a new language and domain: identifying Swedish language synonyms in the building construction domain. We chose this setting because identifying synonyms in this domain is helpful for downstream systems, where different users may query for documents (e.g., engineering requirements) using different terminology. We consider two new features inspired by the change in language and methodological advances since the prior work's publication. An evaluation using data from the building construction domain supports the finding from the prior work that synonym discovery is best approached as a learning to rank task in which a human editor views ranked synonym candidates in order to construct a domain-specific thesaurus. We ",
    "link": "http://arxiv.org/abs/2310.01507",
    "context": "Title: Replicating Relevance-Ranked Synonym Discovery in a New Language and Domain. (arXiv:2310.01507v1 [cs.IR])\nAbstract: Domain-specific synonyms occur in many specialized search tasks, such as when searching medical documents, legal documents, and software engineering artifacts. We replicate prior work on ranking domain-specific synonyms in the consumer health domain by applying the approach to a new language and domain: identifying Swedish language synonyms in the building construction domain. We chose this setting because identifying synonyms in this domain is helpful for downstream systems, where different users may query for documents (e.g., engineering requirements) using different terminology. We consider two new features inspired by the change in language and methodological advances since the prior work's publication. An evaluation using data from the building construction domain supports the finding from the prior work that synonym discovery is best approached as a learning to rank task in which a human editor views ranked synonym candidates in order to construct a domain-specific thesaurus. We ",
    "path": "papers/23/10/2310.01507.json",
    "total_tokens": 937,
    "translated_title": "在新的语言和领域中复制相关排名的同义词发现",
    "translated_abstract": "领域特定的同义词在许多专门的搜索任务中出现，例如搜索医疗文件、法律文件和软件工程制品时。我们复制了以前在消费者健康领域对领域特定同义词进行排名的工作，将该方法应用于新的语言和领域：在建筑施工领域中识别瑞典语同义词。我们选择了这个设置，因为在这个领域中识别同义词对于下游系统很有帮助，不同的用户可能使用不同的术语查询文档（例如工程要求）。考虑到自从之前的工作发表以来语言和方法上的进展，我们提出了两个新特征。使用建筑施工领域的数据进行评估，支持之前的工作发现同义词发现最好作为一个学习排序任务来处理，在此任务中，人类编辑员会查看排序的同义词候选项，以构建一个领域特定的同义词库。",
    "tldr": "这项研究复制了以前在消费者健康领域中进行领域特定同义词排名的工作，将其应用于建筑施工领域中瑞典语同义词的识别。研究结果表明，同义词发现最好作为一个学习排序任务来处理，并用人工编辑来构建领域特定的同义词库。"
}