{
    "title": "Hybrid Optical Turbulence Models Using Machine Learning and Local Measurements. (arXiv:2310.17829v1 [physics.ao-ph])",
    "abstract": "Accurate prediction of atmospheric optical turbulence in localized environments is essential for estimating the performance of free-space optical systems. Macro-meteorological models developed to predict turbulent effects in one environment may fail when applied in new environments. However, existing macro-meteorological models are expected to offer some predictive power. Building a new model from locally-measured macro-meteorology and scintillometer readings can require significant time and resources, as well as a large number of observations. These challenges motivate the development of a machine-learning informed hybrid model framework. By combining some baseline macro-meteorological model with local observations, hybrid models were trained to improve upon the predictive power of each baseline model. Comparisons between the performance of the hybrid models, the selected baseline macro-meteorological models, and machine-learning models trained only on local observations highlight pot",
    "link": "http://arxiv.org/abs/2310.17829",
    "context": "Title: Hybrid Optical Turbulence Models Using Machine Learning and Local Measurements. (arXiv:2310.17829v1 [physics.ao-ph])\nAbstract: Accurate prediction of atmospheric optical turbulence in localized environments is essential for estimating the performance of free-space optical systems. Macro-meteorological models developed to predict turbulent effects in one environment may fail when applied in new environments. However, existing macro-meteorological models are expected to offer some predictive power. Building a new model from locally-measured macro-meteorology and scintillometer readings can require significant time and resources, as well as a large number of observations. These challenges motivate the development of a machine-learning informed hybrid model framework. By combining some baseline macro-meteorological model with local observations, hybrid models were trained to improve upon the predictive power of each baseline model. Comparisons between the performance of the hybrid models, the selected baseline macro-meteorological models, and machine-learning models trained only on local observations highlight pot",
    "path": "papers/23/10/2310.17829.json",
    "total_tokens": 836,
    "translated_title": "使用机器学习和局部测量的混合光学湍流模型",
    "translated_abstract": "准确预测局部环境中的大气光学湍流对于估算自由空间光学系统性能至关重要。将在一个环境中开发的宏观气象模型应用于新环境可能会失败。然而，现有的宏观气象模型预计仍然具有一定的预测能力。通过将基线宏观气象模型与局部观测结合起来，训练混合模型可以改进每个基线模型的预测能力。将混合模型、选择的基线宏观气象模型和仅利用局部观测训练的机器学习模型的性能进行比较，突出了混合模型的潜力。",
    "tldr": "该论文介绍了使用机器学习和局部测量的混合光学湍流模型。通过结合基线宏观气象模型和局部观测，可以提高预测能力。与基线模型和仅利用局部观测训练的机器学习模型相比，混合模型具有更大的潜力。",
    "en_tdlr": "This paper presents hybrid optical turbulence models using machine learning and local measurements. By combining baseline macro-meteorological models with local observations, the predictive power can be improved. Comparisons with baseline models and machine learning models trained only on local observations highlight the potential of the hybrid models."
}