{
    "title": "Enhancing Ayurvedic Diagnosis using Multinomial Naive Bayes and K-modes Clustering: An Investigation into Prakriti Types and Dosha Overlapping. (arXiv:2310.02920v1 [cs.LG])",
    "abstract": "The identification of Prakriti types for the human body is a long-lost medical practice in finding the harmony between the nature of human beings and their behaviour. There are 3 fundamental Prakriti types of individuals. A person can belong to any Dosha. In the existing models, researchers have made use of SVM, KNN, PCA, Decision Tree, and various other algorithms. The output of these algorithms was quite decent, but it can be enhanced with the help of Multinomial Naive Bayes and K-modes clustering. Most of the researchers have confined themselves to 3 basic classes. This might not be accurate in the real-world scenario, where overlapping might occur. Considering these, we have classified the Doshas into 7 categories, which includes overlapping of Doshas. These are namely, VATT-Dosha, PITT-Dosha, KAPH-Dosha, VATT-PITT-Dosha, PITT-KAPH-Dosha, KAPH-VATT-Dosha, and VATT-PITT-KAPH-Dosha. The data used contains a balanced set of all individual entries on which preprocessing steps of machin",
    "link": "http://arxiv.org/abs/2310.02920",
    "context": "Title: Enhancing Ayurvedic Diagnosis using Multinomial Naive Bayes and K-modes Clustering: An Investigation into Prakriti Types and Dosha Overlapping. (arXiv:2310.02920v1 [cs.LG])\nAbstract: The identification of Prakriti types for the human body is a long-lost medical practice in finding the harmony between the nature of human beings and their behaviour. There are 3 fundamental Prakriti types of individuals. A person can belong to any Dosha. In the existing models, researchers have made use of SVM, KNN, PCA, Decision Tree, and various other algorithms. The output of these algorithms was quite decent, but it can be enhanced with the help of Multinomial Naive Bayes and K-modes clustering. Most of the researchers have confined themselves to 3 basic classes. This might not be accurate in the real-world scenario, where overlapping might occur. Considering these, we have classified the Doshas into 7 categories, which includes overlapping of Doshas. These are namely, VATT-Dosha, PITT-Dosha, KAPH-Dosha, VATT-PITT-Dosha, PITT-KAPH-Dosha, KAPH-VATT-Dosha, and VATT-PITT-KAPH-Dosha. The data used contains a balanced set of all individual entries on which preprocessing steps of machin",
    "path": "papers/23/10/2310.02920.json",
    "total_tokens": 1016,
    "translated_title": "用多项式朴素贝叶斯和K-modes聚类增强阿育吠陀诊断：对普拉克里蒂类型和Dosha重叠的研究",
    "translated_abstract": "识别人体的普拉克里蒂类型是一种长时间失传的医学实践，旨在寻找人类本质与行为之间的和谐。个体有3种基本的普拉克里蒂类型，可以属于任何Dosha。在现有模型中，研究人员使用了支持向量机（SVM）、K最近邻（KNN）、主成分分析（PCA）、决策树和其他各种算法。这些算法的输出相当不错，但可以借助多项式朴素贝叶斯和K-modes聚类进行增强。大多数研究人员仅限于3个基本类别。然而，在现实世界的情况下，可能出现重叠。考虑到这一点，我们将Dosha分类为7个类别，其中包括Dosha的重叠。这些类别分别是VATT-Dosha、PITT-Dosha、KAPH-Dosha、VATT-PITT-Dosha、PITT-KAPH-Dosha、KAPH-VATT-Dosha和VATT-PITT-KAPH-Dosha。所使用的数据包含了所有个体条目的平衡集，对其进行了预处理。",
    "tldr": "本研究提出使用多项式朴素贝叶斯和K-modes聚类来增强阿育吠陀诊断中的普拉克里蒂类型和Dosha重叠的识别。通过将Dosha分类为7个类别，包括重叠的Dosha类别，可以提高诊断模型的准确性和真实性。"
}