{
    "title": "Unified Browsing Models for Linear and Grid Layouts. (arXiv:2310.12524v1 [cs.IR])",
    "abstract": "Many information access systems operationalize their results in terms of rankings, which are then displayed to users in various ranking layouts such as linear lists or grids. User interaction with a retrieved item is highly dependent on the item's position in the layout, and users do not provide similar attention to every position in ranking (under any layout model). User attention is an important component in the evaluation process of ranking, due to its use in effectiveness metrics that estimate utility as well as fairness metrics that evaluate ranking based on social and ethical concerns. These metrics take user browsing behavior into account in their measurement strategies to estimate the attention the user is likely to provide to each item in ranking. Research on understanding user browsing behavior has proposed several user browsing models, and further observed that user browsing behavior differs with different ranking layouts. However, the underlying concepts of these browsing m",
    "link": "http://arxiv.org/abs/2310.12524",
    "context": "Title: Unified Browsing Models for Linear and Grid Layouts. (arXiv:2310.12524v1 [cs.IR])\nAbstract: Many information access systems operationalize their results in terms of rankings, which are then displayed to users in various ranking layouts such as linear lists or grids. User interaction with a retrieved item is highly dependent on the item's position in the layout, and users do not provide similar attention to every position in ranking (under any layout model). User attention is an important component in the evaluation process of ranking, due to its use in effectiveness metrics that estimate utility as well as fairness metrics that evaluate ranking based on social and ethical concerns. These metrics take user browsing behavior into account in their measurement strategies to estimate the attention the user is likely to provide to each item in ranking. Research on understanding user browsing behavior has proposed several user browsing models, and further observed that user browsing behavior differs with different ranking layouts. However, the underlying concepts of these browsing m",
    "path": "papers/23/10/2310.12524.json",
    "total_tokens": 816,
    "translated_title": "统一的线性和网格布局浏览模型",
    "translated_abstract": "许多信息访问系统将结果按照排名来操作，并以线性列表或网格的形式展示给用户。用户对检索到的项目的交互高度依赖于项目在布局中的位置，并且用户不会对排名中的每个位置提供相似的关注。用户关注度是排名评估过程中的重要组成部分，因为它在评估实用性的效度指标和基于社会和道德考虑评估排名的公平性指标中使用。这些指标在其测量策略中考虑了用户浏览行为，以估计用户可能对排名中的每个项目提供的关注度。关于理解用户浏览行为的研究提出了几种用户浏览模型，并进一步观察到不同排名布局下用户浏览行为的差异。然而，这些浏览模型的概念仍不够统一。",
    "tldr": "该论文提出了一种统一的线性和网格布局浏览模型，该模型考虑了用户对排名结果的关注度，并指出不同排名布局下的用户浏览行为存在差异。",
    "en_tdlr": "This paper proposes a unified browsing model for linear and grid layouts, which takes into account user attention to ranking results and identifies differences in user browsing behavior under different ranking layouts."
}