{
    "title": "Investigation of factors regarding the effects of COVID-19 pandemic on college students' depression by quantum annealer. (arXiv:2310.00018v1 [quant-ph])",
    "abstract": "Diverse cases regarding the impact, with its related factors, of the COVID-19 pandemic on mental health have been reported in previous studies. College student groups have been frequently selected as the target population in previous studies because they are easily affected by pandemics. In this study, multivariable datasets were collected from 751 college students based on the complex relationships between various mental health factors. We utilized quantum annealing (QA)-based feature selection algorithms that were executed by commercial D-Wave quantum computers to determine the changes in the relative importance of the associated factors before and after the pandemic. Multivariable linear regression (MLR) and XGBoost models were also applied to validate the QA-based algorithms. Based on the experimental results, we confirm that QA-based algorithms have comparable capabilities in factor analysis research to the MLR models that have been widely used in previous studies. Furthermore, th",
    "link": "http://arxiv.org/abs/2310.00018",
    "context": "Title: Investigation of factors regarding the effects of COVID-19 pandemic on college students' depression by quantum annealer. (arXiv:2310.00018v1 [quant-ph])\nAbstract: Diverse cases regarding the impact, with its related factors, of the COVID-19 pandemic on mental health have been reported in previous studies. College student groups have been frequently selected as the target population in previous studies because they are easily affected by pandemics. In this study, multivariable datasets were collected from 751 college students based on the complex relationships between various mental health factors. We utilized quantum annealing (QA)-based feature selection algorithms that were executed by commercial D-Wave quantum computers to determine the changes in the relative importance of the associated factors before and after the pandemic. Multivariable linear regression (MLR) and XGBoost models were also applied to validate the QA-based algorithms. Based on the experimental results, we confirm that QA-based algorithms have comparable capabilities in factor analysis research to the MLR models that have been widely used in previous studies. Furthermore, th",
    "path": "papers/23/10/2310.00018.json",
    "total_tokens": 820,
    "translated_title": "通过量子退火机器人研究COVID-19疫情对大学生抑郁症影响的因素",
    "translated_abstract": "先前的研究报告了COVID-19疫情对心理健康的影响以及相关因素。由于大学生易受到疫情的影响，他们经常被选为目标人群。本研究收集了751名大学生的多变量数据集，基于各种心理健康因素之间的复杂关系。我们使用商业D-Wave量子计算机执行的基于量子退火的特征选择算法，以确定疫情前后相关因素的相对重要性变化。还应用了多变量线性回归（MLR）和XGBoost模型来验证基于量子退火的算法。基于实验结果，我们确认基于量子退火的算法具有与先前广泛使用的MLR模型在因素分析研究中相当的能力。",
    "tldr": "通过量子退火技术，研究发现COVID-19疫情对大学生抑郁症的影响，并比较了基于量子退火和传统线性回归模型的结果。",
    "en_tdlr": "Utilizing quantum annealing, this study investigates the impact of the COVID-19 pandemic on college students' depression and compares the results with traditional linear regression models."
}