{
    "title": "Robust Estimation of Realized Correlation: New Insight about Intraday Fluctuations in Market Betas. (arXiv:2310.19992v1 [econ.EM])",
    "abstract": "Time-varying volatility is an inherent feature of most economic time-series, which causes standard correlation estimators to be inconsistent. The quadrant correlation estimator is consistent but very inefficient. We propose a novel subsampled quadrant estimator that improves efficiency while preserving consistency and robustness. This estimator is particularly well-suited for high-frequency financial data and we apply it to a large panel of US stocks. Our empirical analysis sheds new light on intra-day fluctuations in market betas by decomposing them into time-varying correlations and relative volatility changes. Our results show that intraday variation in betas is primarily driven by intraday variation in correlations.",
    "link": "http://arxiv.org/abs/2310.19992",
    "context": "Title: Robust Estimation of Realized Correlation: New Insight about Intraday Fluctuations in Market Betas. (arXiv:2310.19992v1 [econ.EM])\nAbstract: Time-varying volatility is an inherent feature of most economic time-series, which causes standard correlation estimators to be inconsistent. The quadrant correlation estimator is consistent but very inefficient. We propose a novel subsampled quadrant estimator that improves efficiency while preserving consistency and robustness. This estimator is particularly well-suited for high-frequency financial data and we apply it to a large panel of US stocks. Our empirical analysis sheds new light on intra-day fluctuations in market betas by decomposing them into time-varying correlations and relative volatility changes. Our results show that intraday variation in betas is primarily driven by intraday variation in correlations.",
    "path": "papers/23/10/2310.19992.json",
    "total_tokens": 769,
    "translated_title": "鲁棒实现相关性估计：关于市场β值的日内波动的新见解",
    "translated_abstract": "时间变化的波动性是大多数经济时间序列的固有特征，这导致标准相关性估计不一致。象限相关性估计是一致但效率非常低的方法。我们提出了一种新颖的子抽样象限估计方法，可以在保持一致性和鲁棒性的同时提高效率。这种估计方法特别适用于高频金融数据，我们将其应用于大量的美国股票。我们的实证分析通过将市场β值分解为时间变化的相关性和相对波动性变化，为日内波动中的市场β值提供了新的见解。我们的结果表明，日内β值的波动主要受日内相关性的波动驱动。",
    "tldr": "本研究提出了一种新颖的子抽样象限估计方法，用于分析高频金融数据中的日内波动。通过该方法，我们发现日内β值的波动主要受日内相关性的波动驱动。",
    "en_tdlr": "This paper proposes a novel subsampled quadrant estimator for analyzing intraday fluctuations in high-frequency financial data. The results demonstrate that intraday variation in betas is primarily driven by intraday variation in correlations."
}