{
    "title": "Muscle volume quantification: guiding transformers with anatomical priors. (arXiv:2310.20355v1 [cs.CV])",
    "abstract": "Muscle volume is a useful quantitative biomarker in sports, but also for the follow-up of degenerative musculo-skelletal diseases. In addition to volume, other shape biomarkers can be extracted by segmenting the muscles of interest from medical images. Manual segmentation is still today the gold standard for such measurements despite being very time-consuming. We propose a method for automatic segmentation of 18 muscles of the lower limb on 3D Magnetic Resonance Images to assist such morphometric analysis. By their nature, the tissue of different muscles is undistinguishable when observed in MR Images. Thus, muscle segmentation algorithms cannot rely on appearance but only on contour cues. However, such contours are hard to detect and their thickness varies across subjects. To cope with the above challenges, we propose a segmentation approach based on a hybrid architecture, combining convolutional and visual transformer blocks. We investigate for the first time the behaviour of such hy",
    "link": "http://arxiv.org/abs/2310.20355",
    "context": "Title: Muscle volume quantification: guiding transformers with anatomical priors. (arXiv:2310.20355v1 [cs.CV])\nAbstract: Muscle volume is a useful quantitative biomarker in sports, but also for the follow-up of degenerative musculo-skelletal diseases. In addition to volume, other shape biomarkers can be extracted by segmenting the muscles of interest from medical images. Manual segmentation is still today the gold standard for such measurements despite being very time-consuming. We propose a method for automatic segmentation of 18 muscles of the lower limb on 3D Magnetic Resonance Images to assist such morphometric analysis. By their nature, the tissue of different muscles is undistinguishable when observed in MR Images. Thus, muscle segmentation algorithms cannot rely on appearance but only on contour cues. However, such contours are hard to detect and their thickness varies across subjects. To cope with the above challenges, we propose a segmentation approach based on a hybrid architecture, combining convolutional and visual transformer blocks. We investigate for the first time the behaviour of such hy",
    "path": "papers/23/10/2310.20355.json",
    "total_tokens": 989,
    "translated_title": "肌肉体积定量化：基于解剖先验指导的变压器",
    "translated_abstract": "肌肉体积是一种有用的定量生物标志物，不仅用于运动领域，还用于退行性肌肉骨骼疾病的随访。除了体积外，通过从医学图像中分割感兴趣的肌肉，还可以提取其他形状标志物。尽管非常耗时，但在这类测量中，手工分割仍然是金标准。我们提出了一种方法来自动分割三维磁共振图像中下肢的18个肌肉，以辅助形态测量分析。由于在MR图像中观察时，不同肌肉的组织无法分辨。因此，肌肉分割算法不能依赖外观，只能依赖轮廓线索。然而，这样的轮廓很难检测，并且其厚度在受试者之间变化。为了应对以上挑战，我们基于混合架构提出了一种分割方法，结合了卷积和视觉变压器模块。我们首次研究了这种混合架构的行为特点。",
    "tldr": "本研究提出了一种在三维磁共振图像中自动分割下肢18个肌肉的方法，以辅助形态测量分析。该方法基于混合架构，结合了卷积和视觉变压器模块，解决了肌肉组织无法分辨和轮廓难以检测的问题。",
    "en_tdlr": "This study proposes an automatic muscle segmentation method for the lower limb in 3D Magnetic Resonance Images to assist morphometric analysis. The method combines convolutional and visual transformer blocks, addressing the challenges of undistinguishable muscle tissue and difficult contour detection."
}