{
    "title": "Covariate Balancing and the Equivalence of Weighting and Doubly Robust Estimators of Average Treatment Effects. (arXiv:2310.18563v1 [econ.EM])",
    "abstract": "We show that when the propensity score is estimated using a suitable covariate balancing procedure, the commonly used inverse probability weighting (IPW) estimator, augmented inverse probability weighting (AIPW) with linear conditional mean, and inverse probability weighted regression adjustment (IPWRA) with linear conditional mean are all numerically the same for estimating the average treatment effect (ATE) or the average treatment effect on the treated (ATT). Further, suitably chosen covariate balancing weights are automatically normalized, which means that normalized and unnormalized versions of IPW and AIPW are identical. For estimating the ATE, the weights that achieve the algebraic equivalence of IPW, AIPW, and IPWRA are based on propensity scores estimated using the inverse probability tilting (IPT) method of Graham, Pinto and Egel (2012). For the ATT, the weights are obtained using the covariate balancing propensity score (CBPS) method developed in Imai and Ratkovic (2014). Th",
    "link": "http://arxiv.org/abs/2310.18563",
    "context": "Title: Covariate Balancing and the Equivalence of Weighting and Doubly Robust Estimators of Average Treatment Effects. (arXiv:2310.18563v1 [econ.EM])\nAbstract: We show that when the propensity score is estimated using a suitable covariate balancing procedure, the commonly used inverse probability weighting (IPW) estimator, augmented inverse probability weighting (AIPW) with linear conditional mean, and inverse probability weighted regression adjustment (IPWRA) with linear conditional mean are all numerically the same for estimating the average treatment effect (ATE) or the average treatment effect on the treated (ATT). Further, suitably chosen covariate balancing weights are automatically normalized, which means that normalized and unnormalized versions of IPW and AIPW are identical. For estimating the ATE, the weights that achieve the algebraic equivalence of IPW, AIPW, and IPWRA are based on propensity scores estimated using the inverse probability tilting (IPT) method of Graham, Pinto and Egel (2012). For the ATT, the weights are obtained using the covariate balancing propensity score (CBPS) method developed in Imai and Ratkovic (2014). Th",
    "path": "papers/23/10/2310.18563.json",
    "total_tokens": 1064,
    "translated_title": "协变量平衡和加权与双重稳健估计器在评估平均处理效应上的等效性",
    "translated_abstract": "我们展示了当倾向得分使用合适的协变量平衡程序进行估计时，常用的逆概率加权（IPW）估计器，带有线性条件均值的增强逆概率加权（AIPW）估计器以及带有线性条件均值的逆概率加权回归调整（IPWRA）估计器在评估平均处理效应（ATE）或被处理对象的平均处理效应（ATT）时数值上是相同的。此外，经过适当选择的协变量平衡权重自动进行了归一化处理，这意味着归一化和非归一化版本的IPW和AIPW是相同的。对于估计ATE，实现IPW，AIPW和IPWRA代数等价的权重是基于使用Graham，Pinto和Egel（2012）提出的逆概率倾斜（IPT）方法估计得到的倾向得分计算的。对于ATT，权重是使用Imai和Ratkovic（2014）发展的协变量平衡倾向得分（CBPS）方法获得的。",
    "tldr": "本研究展示了在合适的协变量平衡程序下，逆概率加权估计器（IPW）、增强逆概率加权估计器（AIPW）和逆概率加权回归调整估计器（IPWRA）在评估平均处理效应（ATE）或被处理对象的平均处理效应（ATT）上在数值上是相同的，且适当选择的协变量平衡权重自动归一化。"
}