{
    "title": "Drug Discovery with Dynamic Goal-aware Fragments",
    "abstract": "Fragment-based drug discovery is an effective strategy for discovering drug candidates in the vast chemical space, and has been widely employed in molecular generative models. However, many existing fragment extraction methods in such models do not take the target chemical properties into account or rely on heuristic rules. Additionally, the existing fragment-based generative models cannot update the fragment vocabulary with goal-aware fragments newly discovered during the generation. To this end, we propose a molecular generative framework for drug discovery, named Goal-aware fragment Extraction, Assembly, and Modification (GEAM). GEAM consists of three modules, each responsible for goal-aware fragment extraction, fragment assembly, and fragment modification. The fragment extraction module identifies important fragments contributing to the desired target properties with the information bottleneck principle, thereby constructing an effective goal-aware fragment vocabulary. Moreover, GE",
    "link": "https://arxiv.org/abs/2310.00841",
    "context": "Title: Drug Discovery with Dynamic Goal-aware Fragments\nAbstract: Fragment-based drug discovery is an effective strategy for discovering drug candidates in the vast chemical space, and has been widely employed in molecular generative models. However, many existing fragment extraction methods in such models do not take the target chemical properties into account or rely on heuristic rules. Additionally, the existing fragment-based generative models cannot update the fragment vocabulary with goal-aware fragments newly discovered during the generation. To this end, we propose a molecular generative framework for drug discovery, named Goal-aware fragment Extraction, Assembly, and Modification (GEAM). GEAM consists of three modules, each responsible for goal-aware fragment extraction, fragment assembly, and fragment modification. The fragment extraction module identifies important fragments contributing to the desired target properties with the information bottleneck principle, thereby constructing an effective goal-aware fragment vocabulary. Moreover, GE",
    "path": "papers/23/10/2310.00841.json",
    "total_tokens": 800,
    "translated_title": "使用动态目标感知片段进行药物发现",
    "translated_abstract": "基于片段的药物发现是在庞大的化学空间中发现药物候选物的有效策略，并已广泛应用于分子生成模型中。然而，在这些模型中，许多现有的片段提取方法没有考虑目标化学性质，或者依赖于启发式规则。此外，现有的基于片段的生成模型不能使用生成过程中新发现的目标感知片段来更新片段词汇。为此，我们提出了一种用于药物发现的分子生成框架，称为目标感知片段提取、组装和修改（GEAM）。GEAM包含三个模块，分别负责目标感知片段提取、片段组装和片段修改。片段提取模块通过信息瓶颈原则识别对所需目标特性有贡献的重要片段，从而构建一个有效的目标感知片段词汇。",
    "tldr": "提出了一种名为GEAM的分子生成框架，用于药物发现。该框架通过构建目标感知片段词汇，识别贡献于所需目标特性的重要片段，并在生成过程中更新片段词汇。",
    "en_tdlr": "A molecular generative framework named GEAM is proposed for drug discovery. GEAM identifies important fragments contributing to the desired target properties and updates the fragment vocabulary during the generation process."
}