{
    "title": "Background Summarization of Event Timelines. (arXiv:2310.16197v1 [cs.CL])",
    "abstract": "Generating concise summaries of news events is a challenging natural language processing task. While journalists often curate timelines to highlight key sub-events, newcomers to a news event face challenges in catching up on its historical context. In this paper, we address this need by introducing the task of background news summarization, which complements each timeline update with a background summary of relevant preceding events. We construct a dataset by merging existing timeline datasets and asking human annotators to write a background summary for each timestep of each news event. We establish strong baseline performance using state-of-the-art summarization systems and propose a query-focused variant to generate background summaries. To evaluate background summary quality, we present a question-answering-based evaluation metric, Background Utility Score (BUS), which measures the percentage of questions about a current event timestep that a background summary answers. Our experim",
    "link": "http://arxiv.org/abs/2310.16197",
    "context": "Title: Background Summarization of Event Timelines. (arXiv:2310.16197v1 [cs.CL])\nAbstract: Generating concise summaries of news events is a challenging natural language processing task. While journalists often curate timelines to highlight key sub-events, newcomers to a news event face challenges in catching up on its historical context. In this paper, we address this need by introducing the task of background news summarization, which complements each timeline update with a background summary of relevant preceding events. We construct a dataset by merging existing timeline datasets and asking human annotators to write a background summary for each timestep of each news event. We establish strong baseline performance using state-of-the-art summarization systems and propose a query-focused variant to generate background summaries. To evaluate background summary quality, we present a question-answering-based evaluation metric, Background Utility Score (BUS), which measures the percentage of questions about a current event timestep that a background summary answers. Our experim",
    "path": "papers/23/10/2310.16197.json",
    "total_tokens": 938,
    "translated_title": "事件时间线的背景摘要",
    "translated_abstract": "生成新闻事件的简洁摘要是一项具有挑战性的自然语言处理任务。虽然记者通常会整理时间线来突出关键子事件，但是对于新闻事件的新人来说，了解其历史背景是一项挑战。本文通过引入背景新闻摘要的任务来解决这个需求，该任务为每个时间线更新配上相关前置事件的背景摘要。我们通过合并现有的时间线数据集并要求人工注释者为每个新闻事件的每一时间步骤编写背景摘要来构建数据集。我们使用最先进的摘要系统建立了强大的基准性能，并提出了一个以查询为重点的变体来生成背景摘要。为了评估背景摘要的质量，我们提出了一个基于问答的评估指标，背景效用分数（BUS），它衡量了背景摘要回答当前事件时间步骤问题的百分比。",
    "tldr": "本文提出了一个任务，即生成新闻事件的背景摘要，用于补充每个时间线更新的相关前置事件，通过合并现有数据集并使用最先进的摘要系统建立基准性能。我们还提出了一种以查询为重点的变体来生成背景摘要，并提出了一个基于问答的评估指标来评估摘要质量。",
    "en_tdlr": "This paper introduces the task of generating background summaries for news events, which complements timeline updates with relevant preceding events. A dataset is constructed by merging existing timeline datasets and human annotators write background summaries for each timestep of each news event. Strong baseline performance is established using state-of-the-art summarization systems and a query-focused variant is proposed to generate background summaries. An evaluation metric, Background Utility Score (BUS), is presented to measure the quality of background summaries."
}