{
    "title": "Fast 2D Bicephalous Convolutional Autoencoder for Compressing 3D Time Projection Chamber Data. (arXiv:2310.15026v1 [stat.ML])",
    "abstract": "High-energy large-scale particle colliders produce data at high speed in the order of 1 terabytes per second in nuclear physics and petabytes per second in high-energy physics. Developing real-time data compression algorithms to reduce such data at high throughput to fit permanent storage has drawn increasing attention. Specifically, at the newly constructed sPHENIX experiment at the Relativistic Heavy Ion Collider (RHIC), a time projection chamber is used as the main tracking detector, which records particle trajectories in a volume of a three-dimensional (3D) cylinder. The resulting data are usually very sparse with occupancy around 10.8%. Such sparsity presents a challenge to conventional learning-free lossy compression algorithms, such as SZ, ZFP, and MGARD. The 3D convolutional neural network (CNN)-based approach, Bicephalous Convolutional Autoencoder (BCAE), outperforms traditional methods both in compression rate and reconstruction accuracy. BCAE can also utilize the computation",
    "link": "http://arxiv.org/abs/2310.15026",
    "context": "Title: Fast 2D Bicephalous Convolutional Autoencoder for Compressing 3D Time Projection Chamber Data. (arXiv:2310.15026v1 [stat.ML])\nAbstract: High-energy large-scale particle colliders produce data at high speed in the order of 1 terabytes per second in nuclear physics and petabytes per second in high-energy physics. Developing real-time data compression algorithms to reduce such data at high throughput to fit permanent storage has drawn increasing attention. Specifically, at the newly constructed sPHENIX experiment at the Relativistic Heavy Ion Collider (RHIC), a time projection chamber is used as the main tracking detector, which records particle trajectories in a volume of a three-dimensional (3D) cylinder. The resulting data are usually very sparse with occupancy around 10.8%. Such sparsity presents a challenge to conventional learning-free lossy compression algorithms, such as SZ, ZFP, and MGARD. The 3D convolutional neural network (CNN)-based approach, Bicephalous Convolutional Autoencoder (BCAE), outperforms traditional methods both in compression rate and reconstruction accuracy. BCAE can also utilize the computation",
    "path": "papers/23/10/2310.15026.json",
    "total_tokens": 851,
    "translated_title": "快速二头卷积自编码器用于压缩3D时间投影室数据",
    "translated_abstract": "高能大型粒子对撞机在核物理领域以每秒1TB的速度产生数据，在高能物理领域以每秒PB的速度产生数据。开发实时数据压缩算法以减小数据量以适应永久存储引起了越来越多的关注。在相对论重离子对撞机（RHIC）的新建sPHENIX实验中，时间投影室被用作主要跟踪探测器，记录了三维（3D）圆柱体内的粒子轨迹。结果数据通常非常稀疏，占据率约为10.8%。这样的稀疏性对于传统的无损学习压缩算法（如SZ、ZFP和MGARD）提出了挑战。基于3D卷积神经网络（CNN）的方法，即二头卷积自编码器（BCAE），在压缩率和重建精度方面优于传统方法。BCAE还可以利用计算能力。",
    "tldr": "本研究提出了一种快速的二头卷积自编码器用于压缩三维时间投影室数据，在压缩率和重建精度方面优于传统方法。"
}