{
    "title": "Dealing with zero-inflated data: achieving SOTA with a two-fold machine learning approach. (arXiv:2310.08088v1 [cs.LG])",
    "abstract": "In many cases, a machine learning model must learn to correctly predict a few data points with particular values of interest in a broader range of data where many target values are zero. Zero-inflated data can be found in diverse scenarios, such as lumpy and intermittent demands, power consumption for home appliances being turned on and off, impurities measurement in distillation processes, and even airport shuttle demand prediction. The presence of zeroes affects the models' learning and may result in poor performance. Furthermore, zeroes also distort the metrics used to compute the model's prediction quality. This paper showcases two real-world use cases (home appliances classification and airport shuttle demand prediction) where a hierarchical model applied in the context of zero-inflated data leads to excellent results. In particular, for home appliances classification, the weighted average of Precision, Recall, F1, and AUC ROC was increased by 27%, 34%, 49%, and 27%, respectively.",
    "link": "http://arxiv.org/abs/2310.08088",
    "context": "Title: Dealing with zero-inflated data: achieving SOTA with a two-fold machine learning approach. (arXiv:2310.08088v1 [cs.LG])\nAbstract: In many cases, a machine learning model must learn to correctly predict a few data points with particular values of interest in a broader range of data where many target values are zero. Zero-inflated data can be found in diverse scenarios, such as lumpy and intermittent demands, power consumption for home appliances being turned on and off, impurities measurement in distillation processes, and even airport shuttle demand prediction. The presence of zeroes affects the models' learning and may result in poor performance. Furthermore, zeroes also distort the metrics used to compute the model's prediction quality. This paper showcases two real-world use cases (home appliances classification and airport shuttle demand prediction) where a hierarchical model applied in the context of zero-inflated data leads to excellent results. In particular, for home appliances classification, the weighted average of Precision, Recall, F1, and AUC ROC was increased by 27%, 34%, 49%, and 27%, respectively.",
    "path": "papers/23/10/2310.08088.json",
    "total_tokens": 882,
    "translated_title": "处理零膨胀数据：用双重机器学习方法实现SOTA水平",
    "translated_abstract": "在许多情况下，机器学习模型必须学会在较广范围的数据中正确预测一些具有特定兴趣值的数据点，而其中许多目标值为零。零膨胀数据可以在各种场景中找到，比如颗粒状和间歇性需求、家用电器的功率消耗（开关开启和关闭）、蒸馏过程中的杂质测量，甚至是机场班车需求预测等。零的存在影响了模型的学习并可能导致性能不佳。此外，零也扭曲了用于计算模型预测质量的指标。本文展示了两个实际应用案例（家用电器分类和机场班车需求预测），其中在零膨胀数据背景下应用层次模型取得了出色的结果。特别是对于家用电器分类，加权平均精确度、召回率、F1值和AUC ROC分别提高了27%、34%、49%和27%。",
    "tldr": "通过应用双重机器学习方法，本文解决了处理零膨胀数据的问题，并在两个实际应用案例中取得了出色的结果。",
    "en_tdlr": "This paper addresses the issue of dealing with zero-inflated data using a two-fold machine learning approach and achieves excellent results in two real-world use cases."
}