{
    "title": "Relational Convolutional Networks: A framework for learning representations of hierarchical relations. (arXiv:2310.03240v1 [cs.LG])",
    "abstract": "A maturing area of research in deep learning is the development of architectures that can learn explicit representations of relational features. In this paper, we focus on the problem of learning representations of hierarchical relations, proposing an architectural framework we call \"relational convolutional networks\". Given a sequence of objects, a \"multi-dimensional inner product relation\" module produces a relation tensor describing all pairwise relations. A \"relational convolution\" layer then transforms the relation tensor into a sequence of new objects, each describing the relations within some group of objects at the previous layer. Graphlet filters, analogous to filters in convolutional neural networks, represent a template of relations against which the relation tensor is compared at each grouping. Repeating this yields representations of higher-order, hierarchical relations. We present the motivation and details of the architecture, together with a set of experiments to demons",
    "link": "http://arxiv.org/abs/2310.03240",
    "context": "Title: Relational Convolutional Networks: A framework for learning representations of hierarchical relations. (arXiv:2310.03240v1 [cs.LG])\nAbstract: A maturing area of research in deep learning is the development of architectures that can learn explicit representations of relational features. In this paper, we focus on the problem of learning representations of hierarchical relations, proposing an architectural framework we call \"relational convolutional networks\". Given a sequence of objects, a \"multi-dimensional inner product relation\" module produces a relation tensor describing all pairwise relations. A \"relational convolution\" layer then transforms the relation tensor into a sequence of new objects, each describing the relations within some group of objects at the previous layer. Graphlet filters, analogous to filters in convolutional neural networks, represent a template of relations against which the relation tensor is compared at each grouping. Repeating this yields representations of higher-order, hierarchical relations. We present the motivation and details of the architecture, together with a set of experiments to demons",
    "path": "papers/23/10/2310.03240.json",
    "total_tokens": 860,
    "translated_title": "关系卷积网络：学习层次关系表示的框架",
    "translated_abstract": "深度学习中一个成熟的研究领域是开发能够学习显式关系特征表示的架构。本文着重于学习层次关系表示的问题，提出了一个名为“关系卷积网络”的架构框架。给定一系列对象，一个“多维内积关系”模块生成一个描述所有成对关系的关系张量。然后，一个“关系卷积”层将关系张量转化为一个新对象序列，每个对象描述前一层某群对象内的关系。类似于卷积神经网络中的滤波器，图元滤波器代表要与关系张量在每个分组中进行比较的关系模板。通过重复这个过程，得到更高阶、层次的关系表示。我们介绍了架构的动机和细节，以及一系列实验来证明…",
    "tldr": "关系卷积网络是一个学习显式层次关系表示的框架，通过使用多维内积关系模块和关系卷积层，以及基于图元滤波器的群组比较，能够表达更高阶、层次的关系。",
    "en_tdlr": "Relational Convolutional Networks is a framework that learns explicit representations of hierarchical relations, by using a multi-dimensional inner product relation module, a relational convolution layer, and group comparisons based on graphlet filters, it can express higher-order, hierarchical relations."
}