{
    "title": "Joint inversion of Time-Lapse Surface Gravity and Seismic Data for Monitoring of 3D CO$_2$ Plumes via Deep Learning. (arXiv:2310.04430v1 [physics.geo-ph])",
    "abstract": "We introduce a fully 3D, deep learning-based approach for the joint inversion of time-lapse surface gravity and seismic data for reconstructing subsurface density and velocity models. The target application of this proposed inversion approach is the prediction of subsurface CO2 plumes as a complementary tool for monitoring CO2 sequestration deployments. Our joint inversion technique outperforms deep learning-based gravity-only and seismic-only inversion models, achieving improved density and velocity reconstruction, accurate segmentation, and higher R-squared coefficients. These results indicate that deep learning-based joint inversion is an effective tool for CO$_2$ storage monitoring. Future work will focus on validating our approach with larger datasets, simulations with other geological storage sites, and ultimately field data.",
    "link": "http://arxiv.org/abs/2310.04430",
    "context": "Title: Joint inversion of Time-Lapse Surface Gravity and Seismic Data for Monitoring of 3D CO$_2$ Plumes via Deep Learning. (arXiv:2310.04430v1 [physics.geo-ph])\nAbstract: We introduce a fully 3D, deep learning-based approach for the joint inversion of time-lapse surface gravity and seismic data for reconstructing subsurface density and velocity models. The target application of this proposed inversion approach is the prediction of subsurface CO2 plumes as a complementary tool for monitoring CO2 sequestration deployments. Our joint inversion technique outperforms deep learning-based gravity-only and seismic-only inversion models, achieving improved density and velocity reconstruction, accurate segmentation, and higher R-squared coefficients. These results indicate that deep learning-based joint inversion is an effective tool for CO$_2$ storage monitoring. Future work will focus on validating our approach with larger datasets, simulations with other geological storage sites, and ultimately field data.",
    "path": "papers/23/10/2310.04430.json",
    "total_tokens": 793,
    "translated_title": "通过深度学习进行地表重力与地震数据联合反演监测3D CO2斑块",
    "translated_abstract": "我们引入了一种基于深度学习的完全三维联合反演方法，用于重建地下密度和速度模型。该方法的目标应用是预测地下CO2斑块，作为监测CO2封存部署的补充工具。我们的联合反演技术优于仅基于深度学习的重力或地震反演模型，实现了改进的密度和速度重建、准确的分割和更高的R方系数。这些结果表明，基于深度学习的联合反演是一种有效的CO2存储监测工具。未来的工作将着重验证我们的方法，包括使用更大数据集、模拟其他地质封存地点的情况，最终验证野外数据。",
    "tldr": "通过深度学习进行地表重力与地震数据联合反演可以有效监测CO2存储，实现了改进的密度和速度重建、准确的分割和更高的R方系数。",
    "en_tdlr": "Joint inversion of time-lapse surface gravity and seismic data using deep learning can effectively monitor CO2 storage, achieving improved density and velocity reconstruction, accurate segmentation, and higher R-squared coefficients."
}