{
    "title": "History Matching for Geological Carbon Storage using Data-Space Inversion with Spatio-Temporal Data Parameterization. (arXiv:2310.03228v1 [cs.LG])",
    "abstract": "History matching based on monitoring data will enable uncertainty reduction, and thus improved aquifer management, in industrial-scale carbon storage operations. In traditional model-based data assimilation, geomodel parameters are modified to force agreement between flow simulation results and observations. In data-space inversion (DSI), history-matched quantities of interest, e.g., posterior pressure and saturation fields conditioned to observations, are inferred directly, without constructing posterior geomodels. This is accomplished efficiently using a set of O(1000) prior simulation results, data parameterization, and posterior sampling within a Bayesian setting. In this study, we develop and implement (in DSI) a deep-learning-based parameterization to represent spatio-temporal pressure and CO2 saturation fields at a set of time steps. The new parameterization uses an adversarial autoencoder (AAE) for dimension reduction and a convolutional long short-term memory (convLSTM) networ",
    "link": "http://arxiv.org/abs/2310.03228",
    "context": "Title: History Matching for Geological Carbon Storage using Data-Space Inversion with Spatio-Temporal Data Parameterization. (arXiv:2310.03228v1 [cs.LG])\nAbstract: History matching based on monitoring data will enable uncertainty reduction, and thus improved aquifer management, in industrial-scale carbon storage operations. In traditional model-based data assimilation, geomodel parameters are modified to force agreement between flow simulation results and observations. In data-space inversion (DSI), history-matched quantities of interest, e.g., posterior pressure and saturation fields conditioned to observations, are inferred directly, without constructing posterior geomodels. This is accomplished efficiently using a set of O(1000) prior simulation results, data parameterization, and posterior sampling within a Bayesian setting. In this study, we develop and implement (in DSI) a deep-learning-based parameterization to represent spatio-temporal pressure and CO2 saturation fields at a set of time steps. The new parameterization uses an adversarial autoencoder (AAE) for dimension reduction and a convolutional long short-term memory (convLSTM) networ",
    "path": "papers/23/10/2310.03228.json",
    "total_tokens": 899,
    "translated_title": "基于数据空间反演和时空数据参数化的地质碳储存历史匹配方法",
    "translated_abstract": "基于监测数据的历史匹配可以减少不确定性，从而改善工业规模碳储存操作中的地下水管理。在传统的基于模型的数据同化中，通过修改地质模型参数来使得流动模拟结果与观测值吻合。而在数据空间反演（DSI）中，通过使用一组约1000个先验模拟结果，数据参数化和贝叶斯框架内的后验抽样，可以直接推断出历史匹配后的感兴趣量，例如以观察为条件的后验压力和饱和度场。本研究中，我们开发并在数据空间反演中实施了一种基于深度学习的参数化方法，以表示一系列时间步骤上的时空压力和CO2饱和度场。新的参数化方法使用对抗自编码器（AAE）进行维度降低，使用卷积长短期记忆（convLSTM）网络进行时间连续建模。",
    "tldr": "本研究开发了一种基于深度学习的参数化方法，在数据空间反演中实现了对地质碳储存历史匹配的准确推断，可以在工业规模碳储存操作中提高地下水管理的效果。",
    "en_tdlr": "This study develops a deep learning-based parameterization for history matching in geological carbon storage using data-space inversion, enabling improved groundwater management in industrial-scale carbon storage operations."
}