{
    "title": "Deep machine learning for meteor monitoring: advances with transfer learning and gradient-weighted class activation mapping. (arXiv:2310.16826v2 [astro-ph.EP] UPDATED)",
    "abstract": "In recent decades, the use of optical detection systems for meteor studies has increased dramatically, resulting in huge amounts of data being analyzed. Automated meteor detection tools are essential for studying the continuous meteoroid incoming flux, recovering fresh meteorites, and achieving a better understanding of our Solar System. Concerning meteor detection, distinguishing false positives between meteor and non-meteor images has traditionally been performed by hand, which is significantly time-consuming. To address this issue, we developed a fully automated pipeline that uses Convolutional Neural Networks (CNNs) to classify candidate meteor detections. Our new method is able to detect meteors even in images that contain static elements such as clouds, the Moon, and buildings. To accurately locate the meteor within each frame, we employ the Gradient-weighted Class Activation Mapping (Grad-CAM) technique. This method facilitates the identification of the region of interest by mul",
    "link": "http://arxiv.org/abs/2310.16826",
    "context": "Title: Deep machine learning for meteor monitoring: advances with transfer learning and gradient-weighted class activation mapping. (arXiv:2310.16826v2 [astro-ph.EP] UPDATED)\nAbstract: In recent decades, the use of optical detection systems for meteor studies has increased dramatically, resulting in huge amounts of data being analyzed. Automated meteor detection tools are essential for studying the continuous meteoroid incoming flux, recovering fresh meteorites, and achieving a better understanding of our Solar System. Concerning meteor detection, distinguishing false positives between meteor and non-meteor images has traditionally been performed by hand, which is significantly time-consuming. To address this issue, we developed a fully automated pipeline that uses Convolutional Neural Networks (CNNs) to classify candidate meteor detections. Our new method is able to detect meteors even in images that contain static elements such as clouds, the Moon, and buildings. To accurately locate the meteor within each frame, we employ the Gradient-weighted Class Activation Mapping (Grad-CAM) technique. This method facilitates the identification of the region of interest by mul",
    "path": "papers/23/10/2310.16826.json",
    "total_tokens": 930,
    "translated_title": "用于流星监测的深度机器学习：具有迁移学习和梯度加权类激活映射的进展",
    "translated_abstract": "近几十年来，光学探测系统在流星研究中的应用大幅增加，导致数据量大幅增加。自动化的流星检测工具对于研究连续的流星入射通量、寻找新鲜陨石和更好地了解我们的太阳系至关重要。关于流星检测，传统上通过手工进行流星和非流星图像的假阳性区分，这在时间上十分耗费。为了解决这个问题，我们开发了一个完全自动化的流水线，利用卷积神经网络（CNN）来分类候选流星检测。我们的新方法能够即使在包含云、月亮和建筑等静态元素的图像中，也能够检测到流星。为了准确地在每个帧中定位流星，我们采用了梯度加权类激活映射（Grad-CAM）技术。这种方法可以通过多通道梯度信号来辅助识别感兴趣的区域。",
    "tldr": "本研究开发了一个使用深度学习技术进行流星检测的自动化流水线，能够有效地在包含静态元素的图像中检测流星，并利用梯度加权类激活映射方法准确地定位流星的位置。"
}