{
    "title": "The Past, Present, and Future of Typological Databases in NLP. (arXiv:2310.13440v1 [cs.CL])",
    "abstract": "Typological information has the potential to be beneficial in the development of NLP models, particularly for low-resource languages. Unfortunately, current large-scale typological databases, notably WALS and Grambank, are inconsistent both with each other and with other sources of typological information, such as linguistic grammars. Some of these inconsistencies stem from coding errors or linguistic variation, but many of the disagreements are due to the discrete categorical nature of these databases. We shed light on this issue by systematically exploring disagreements across typological databases and resources, and their uses in NLP, covering the past and present. We next investigate the future of such work, offering an argument that a continuous view of typological features is clearly beneficial, echoing recommendations from linguistics. We propose that such a view of typology has significant potential in the future, including in language modeling in low-resource scenarios.",
    "link": "http://arxiv.org/abs/2310.13440",
    "context": "Title: The Past, Present, and Future of Typological Databases in NLP. (arXiv:2310.13440v1 [cs.CL])\nAbstract: Typological information has the potential to be beneficial in the development of NLP models, particularly for low-resource languages. Unfortunately, current large-scale typological databases, notably WALS and Grambank, are inconsistent both with each other and with other sources of typological information, such as linguistic grammars. Some of these inconsistencies stem from coding errors or linguistic variation, but many of the disagreements are due to the discrete categorical nature of these databases. We shed light on this issue by systematically exploring disagreements across typological databases and resources, and their uses in NLP, covering the past and present. We next investigate the future of such work, offering an argument that a continuous view of typological features is clearly beneficial, echoing recommendations from linguistics. We propose that such a view of typology has significant potential in the future, including in language modeling in low-resource scenarios.",
    "path": "papers/23/10/2310.13440.json",
    "total_tokens": 894,
    "translated_title": "自然语言处理中语言类型数据库的过去、现在和未来",
    "translated_abstract": "语言类型信息在NLP模型的开发中具有潜力，特别是对于资源稀缺的语言。然而，目前存在的大规模语言类型数据库，尤其是WALS和Grambank，在彼此之间以及与其他语言类型信息来源（如语言语法）之间存在不一致性。一些不一致性源于编码错误或语言变异，但许多分歧是由于这些数据库的离散分类特性。我们通过系统地探讨语言类型数据库和资源间的分歧及其在NLP中的使用，阐明了这个问题。接下来，我们研究了这样的工作的未来，并提出了一个论点，即持续的语言类型特征观点明显有益，呼应了语言学的建议。我们认为这样的语言类型观点在未来具有重大潜力，包括在资源稀缺场景下的语言建模中。",
    "tldr": "本论文研究了自然语言处理中语言类型数据库的过去、现在和未来。发现当前的大规模语言类型数据库存在不一致性，提出了持续的语言类型特征观点的重要性，并认为这样的观点在未来有巨大潜力，特别是在资源稀缺场景下的语言建模中。",
    "en_tdlr": "This paper explores the past, present, and future of typological databases in NLP. It highlights the inconsistencies among current large-scale databases and proposes the importance of a continuous view of typological features. The paper argues that this view has significant potential in the future, particularly in language modeling for low-resource languages."
}