{
    "title": "Probabilistic Sampling-Enhanced Temporal-Spatial GCN: A Scalable Framework for Transaction Anomaly Detection in Ethereum Networks. (arXiv:2310.00144v1 [cs.LG])",
    "abstract": "The rapid evolution of the Ethereum network necessitates sophisticated techniques to ensure its robustness against potential threats and to maintain transparency. While Graph Neural Networks (GNNs) have pioneered anomaly detection in such platforms, capturing the intricacies of both spatial and temporal transactional patterns has remained a challenge. This study presents a fusion of Graph Convolutional Networks (GCNs) with Temporal Random Walks (TRW) enhanced by probabilistic sampling to bridge this gap. Our approach, unlike traditional GCNs, leverages the strengths of TRW to discern complex temporal sequences in Ethereum transactions, thereby providing a more nuanced transaction anomaly detection mechanism. Preliminary evaluations demonstrate that our TRW-GCN framework substantially advances the performance metrics over conventional GCNs in detecting anomalies and transaction bursts. This research not only underscores the potential of temporal cues in Ethereum transactional data but a",
    "link": "http://arxiv.org/abs/2310.00144",
    "context": "Title: Probabilistic Sampling-Enhanced Temporal-Spatial GCN: A Scalable Framework for Transaction Anomaly Detection in Ethereum Networks. (arXiv:2310.00144v1 [cs.LG])\nAbstract: The rapid evolution of the Ethereum network necessitates sophisticated techniques to ensure its robustness against potential threats and to maintain transparency. While Graph Neural Networks (GNNs) have pioneered anomaly detection in such platforms, capturing the intricacies of both spatial and temporal transactional patterns has remained a challenge. This study presents a fusion of Graph Convolutional Networks (GCNs) with Temporal Random Walks (TRW) enhanced by probabilistic sampling to bridge this gap. Our approach, unlike traditional GCNs, leverages the strengths of TRW to discern complex temporal sequences in Ethereum transactions, thereby providing a more nuanced transaction anomaly detection mechanism. Preliminary evaluations demonstrate that our TRW-GCN framework substantially advances the performance metrics over conventional GCNs in detecting anomalies and transaction bursts. This research not only underscores the potential of temporal cues in Ethereum transactional data but a",
    "path": "papers/23/10/2310.00144.json",
    "total_tokens": 1157,
    "translated_title": "基于概率采样增强的时空图卷积网络：一种可扩展的以太坊网络交易异常检测框架",
    "translated_abstract": "以太坊网络的快速演进需要先进的技术来确保其对潜在威胁的鲁棒性并保持透明度。虽然图神经网络（GNN）在此类平台的异常检测方面取得了先导性成果，但捕捉空间和时间事务模式的复杂性仍然是一个挑战。本研究提出了一种将图卷积网络（GCNs）与使用概率采样增强的时态随机游走（TRW）相结合的方法，以弥合这一差距。与传统的GCNs不同，我们的方法利用TRW的优势来识别以太坊交易中复杂的时间序列，从而提供更细致入微的交易异常检测机制。初步评估表明，我们的TRW-GCN框架在检测异常和交易突发的性能指标上显著提高了传统GCNs的表现。这项研究不仅强调了以太坊交易数据中时间线索的潜力，同时揭示了使用概率采样增强的时空GCNs进行交易异常检测的可行性。",
    "tldr": "该研究提出了一种基于概率采样增强的时空图卷积网络框架，用于以太坊网络中的交易异常检测。通过将图卷积网络与时态随机游走相结合，利用时间序列的复杂性提供更精细的交易异常检测机制。实验结果表明，与传统的图卷积网络相比，该框架在检测异常和交易突发方面有显著的性能提升。这项研究强调了以太坊交易数据中时间线索的潜力，并展示了使用该框架进行交易异常检测的可行性。",
    "en_tdlr": "This study presents a probabilistic sampling-enhanced temporal-spatial Graph Convolutional Network (GCN) framework for transaction anomaly detection in Ethereum networks. By combining GCNs with Temporal Random Walks, the framework is able to capture the complexities of temporal sequences in Ethereum transactions, providing a more nuanced and advanced mechanism for anomaly detection. Preliminary evaluations demonstrate significant performance improvements over conventional GCNs in detecting anomalies and transaction bursts. The research underscores the potential of temporal cues in Ethereum transactional data and showcases the feasibility of using the proposed framework for transaction anomaly detection."
}