{
    "title": "Simulating Users in Interactive Web Table Retrieval. (arXiv:2310.11931v1 [cs.IR])",
    "abstract": "Considering the multimodal signals of search items is beneficial for retrieval effectiveness. Especially in web table retrieval (WTR) experiments, accounting for multimodal properties of tables boosts effectiveness. However, it still remains an open question how the single modalities affect user experience in particular. Previous work analyzed WTR performance in ad-hoc retrieval benchmarks, which neglects interactive search behavior and limits the conclusion about the implications for real-world user environments.  To this end, this work presents an in-depth evaluation of simulated interactive WTR search sessions as a more cost-efficient and reproducible alternative to real user studies. As a first of its kind, we introduce interactive query reformulation strategies based on Doc2Query, incorporating cognitive states of simulated user knowledge. Our evaluations include two perspectives on user effectiveness by considering different cost paradigms, namely query-wise and time-oriented mea",
    "link": "http://arxiv.org/abs/2310.11931",
    "context": "Title: Simulating Users in Interactive Web Table Retrieval. (arXiv:2310.11931v1 [cs.IR])\nAbstract: Considering the multimodal signals of search items is beneficial for retrieval effectiveness. Especially in web table retrieval (WTR) experiments, accounting for multimodal properties of tables boosts effectiveness. However, it still remains an open question how the single modalities affect user experience in particular. Previous work analyzed WTR performance in ad-hoc retrieval benchmarks, which neglects interactive search behavior and limits the conclusion about the implications for real-world user environments.  To this end, this work presents an in-depth evaluation of simulated interactive WTR search sessions as a more cost-efficient and reproducible alternative to real user studies. As a first of its kind, we introduce interactive query reformulation strategies based on Doc2Query, incorporating cognitive states of simulated user knowledge. Our evaluations include two perspectives on user effectiveness by considering different cost paradigms, namely query-wise and time-oriented mea",
    "path": "papers/23/10/2310.11931.json",
    "total_tokens": 1002,
    "translated_title": "在交互式网页表格检索中模拟用户行为",
    "translated_abstract": "考虑搜索项目的多模态信号对于提高检索效果是有益的。特别是在网页表格检索（WTR）实验中，考虑到表格的多模态属性可以提升效果。然而，单一模态如何影响用户体验仍然是一个未解决的问题。之前的工作分析了在临时检索基准下的WTR性能，它忽略了交互式搜索行为，并且限制了对于真实用户环境含义的结论。为此，本文提出了模拟交互式WTR搜索会话的全面评估，作为比真实用户研究更具成本效益和可重复性的替代方案。作为首次尝试，我们基于Doc2Query引入了基于模拟用户知识的交互式查询重构策略。我们的评估从两个不同的成本范式考虑用户效果，即按查询和按时间。",
    "tldr": "本文提出了一种模拟用户行为的方法，用于交互式网页表格检索。通过考虑搜索项目的多模态信号，特别是表格的多模态属性，可以提高检索效果。作者还基于Doc2Query引入了一种基于模拟用户知识的交互式查询重构策略。评估结果表明，模拟用户行为的方法可以作为替代真实用户研究的一种更具成本效益和可重复性的方法。在不同的成本范式下考虑用户效果对于评估交互式网页表格检索非常重要。",
    "en_tdlr": "This paper proposes a method for simulating user behavior in interactive web table retrieval. Considering the multimodal signals of search items, especially the multimodal properties of tables, can improve retrieval effectiveness. The authors also introduce an interactive query reformulation strategy based on Doc2Query that incorporates simulated user knowledge. The evaluation results show that simulating user behavior can be a more cost-effective and reproducible alternative to real user studies. Considering user effectiveness from different cost paradigms is crucial for evaluating interactive web table retrieval."
}