{
    "title": "Advantages of Machine Learning in Bus Transport Analysis. (arXiv:2310.19810v1 [cs.LG])",
    "abstract": "Supervised Machine Learning is an innovative method that aims to mimic human learning by using past experiences. In this study, we utilize supervised machine learning algorithms to analyze the factors that contribute to the punctuality of Tehran BRT bus system. We gather publicly available datasets of 2020 to 2022 from Municipality of Tehran to train and test our models. By employing various algorithms and leveraging Python's Sci Kit Learn and Stats Models libraries, we construct accurate models capable of predicting whether a bus route will meet the prescribed standards for on-time performance on any given day. Furthermore, we delve deeper into the decision-making process of each algorithm to determine the most influential factor it considers. This investigation allows us to uncover the key feature that significantly impacts the effectiveness of bus routes, providing valuable insights for improving their performance.",
    "link": "http://arxiv.org/abs/2310.19810",
    "context": "Title: Advantages of Machine Learning in Bus Transport Analysis. (arXiv:2310.19810v1 [cs.LG])\nAbstract: Supervised Machine Learning is an innovative method that aims to mimic human learning by using past experiences. In this study, we utilize supervised machine learning algorithms to analyze the factors that contribute to the punctuality of Tehran BRT bus system. We gather publicly available datasets of 2020 to 2022 from Municipality of Tehran to train and test our models. By employing various algorithms and leveraging Python's Sci Kit Learn and Stats Models libraries, we construct accurate models capable of predicting whether a bus route will meet the prescribed standards for on-time performance on any given day. Furthermore, we delve deeper into the decision-making process of each algorithm to determine the most influential factor it considers. This investigation allows us to uncover the key feature that significantly impacts the effectiveness of bus routes, providing valuable insights for improving their performance.",
    "path": "papers/23/10/2310.19810.json",
    "total_tokens": 891,
    "translated_title": "机器学习在公共汽车运输分析中的优势",
    "translated_abstract": "监督机器学习是一种创新的方法，旨在通过利用过去的经验来模拟人类的学习过程。在本研究中，我们利用监督机器学习算法分析了影响德黑兰快速巴士系统准点性的因素。我们收集了2020年到2022年的德黑兰市政府公开可用的数据集，用于训练和测试我们的模型。通过利用各种算法和Python的Sci Kit Learn和Stats Models库，我们构建了准确的模型，能够预测任何给定日期公交线路是否符合准时性标准。此外，我们深入研究了每个算法的决策过程，以确定它所考虑的最具影响力的因素。这项调查使我们能够发现显著影响公交线路有效性的关键特征，为改进其性能提供了宝贵的见解。",
    "tldr": "本研究利用监督机器学习算法分析了影响德黑兰快速巴士系统准点性的因素，并构建了准确的模型来预测公交线路是否符合准时性标准。通过深入研究算法的决策过程，发现了影响公交线路有效性的关键特征。",
    "en_tdlr": "This study utilizes supervised machine learning algorithms to analyze the factors affecting the punctuality of the Tehran BRT bus system. Accurate models are constructed to predict whether a bus route meets on-time performance standards. Investigation of the decision-making process uncovers the key features influencing the effectiveness of bus routes."
}