{
    "title": "HeightFormer: A Multilevel Interaction and Image-adaptive Classification-regression Network for Monocular Height Estimation with Aerial Images. (arXiv:2310.07995v1 [cs.CV])",
    "abstract": "Height estimation has long been a pivotal topic within measurement and remote sensing disciplines, proving critical for endeavours such as 3D urban modelling, MR and autonomous driving. Traditional methods utilise stereo matching or multisensor fusion, both well-established techniques that typically necessitate multiple images from varying perspectives and adjunct sensors like SAR, leading to substantial deployment costs. Single image height estimation has emerged as an attractive alternative, boasting a larger data source variety and simpler deployment. However, current methods suffer from limitations such as fixed receptive fields, a lack of global information interaction, leading to noticeable instance-level height deviations. The inherent complexity of height prediction can result in a blurry estimation of object edge depth when using mainstream regression methods based on fixed height division. This paper presents a comprehensive solution for monocular height estimation in remote ",
    "link": "http://arxiv.org/abs/2310.07995",
    "context": "Title: HeightFormer: A Multilevel Interaction and Image-adaptive Classification-regression Network for Monocular Height Estimation with Aerial Images. (arXiv:2310.07995v1 [cs.CV])\nAbstract: Height estimation has long been a pivotal topic within measurement and remote sensing disciplines, proving critical for endeavours such as 3D urban modelling, MR and autonomous driving. Traditional methods utilise stereo matching or multisensor fusion, both well-established techniques that typically necessitate multiple images from varying perspectives and adjunct sensors like SAR, leading to substantial deployment costs. Single image height estimation has emerged as an attractive alternative, boasting a larger data source variety and simpler deployment. However, current methods suffer from limitations such as fixed receptive fields, a lack of global information interaction, leading to noticeable instance-level height deviations. The inherent complexity of height prediction can result in a blurry estimation of object edge depth when using mainstream regression methods based on fixed height division. This paper presents a comprehensive solution for monocular height estimation in remote ",
    "path": "papers/23/10/2310.07995.json",
    "total_tokens": 894,
    "translated_title": "HeightFormer:一种多层交互和图像自适应分类回归网络，用于航空影像的单目高度估计",
    "translated_abstract": "高度估计一直是测量和遥感学科中的一个重要主题，对于3D城市建模、MR和自动驾驶等努力至关重要。传统方法使用立体匹配或多传感器融合，这些都是成熟的技术，通常需要多个来自不同角度和附加传感器（如SAR）的图像，导致部署成本高。单图像高度估计已成为一种有吸引力的替代方法，具有更大的数据来源多样性和更简单的部署。然而，当前方法存在一些限制，例如固定的接受域、缺乏全局信息交互，导致 noticeable instance-level 高度偏差。高度预测的固有复杂性可能导致使用基于固定高度分割的主流回归方法时模糊估计物体边缘深度。本文提出了一种全面的解决方案，用于航空影像的单目高度估计。",
    "tldr": "本文提出了一种用于航空影像的全面解决方案，通过多层交互和图像自适应分类回归网络实现单目高度估计，解决了固定接受域和缺乏全局信息交互的问题。",
    "en_tdlr": "This paper proposes a comprehensive solution for monocular height estimation with aerial images, utilizing a multilevel interaction and image-adaptive classification-regression network to address the limitations such as fixed receptive fields and a lack of global information interaction."
}