{
    "title": "Popularity, face and voice: Predicting and interpreting livestreamers' retail performance using machine learning techniques. (arXiv:2310.19200v1 [econ.EM])",
    "abstract": "Livestreaming commerce, a hybrid of e-commerce and self-media, has expanded the broad spectrum of traditional sales performance determinants. To investigate the factors that contribute to the success of livestreaming commerce, we construct a longitudinal firm-level database with 19,175 observations, covering an entire livestreaming subsector. By comparing the forecasting accuracy of eight machine learning models, we identify a random forest model that provides the best prediction of gross merchandise volume (GMV). Furthermore, we utilize explainable artificial intelligence to open the black-box of machine learning model, discovering four new facts: 1) variables representing the popularity of livestreaming events are crucial features in predicting GMV. And voice attributes are more important than appearance; 2) popularity is a major determinant of sales for female hosts, while vocal aesthetics is more decisive for their male counterparts; 3) merits and drawbacks of the voice are not equ",
    "link": "http://arxiv.org/abs/2310.19200",
    "context": "Title: Popularity, face and voice: Predicting and interpreting livestreamers' retail performance using machine learning techniques. (arXiv:2310.19200v1 [econ.EM])\nAbstract: Livestreaming commerce, a hybrid of e-commerce and self-media, has expanded the broad spectrum of traditional sales performance determinants. To investigate the factors that contribute to the success of livestreaming commerce, we construct a longitudinal firm-level database with 19,175 observations, covering an entire livestreaming subsector. By comparing the forecasting accuracy of eight machine learning models, we identify a random forest model that provides the best prediction of gross merchandise volume (GMV). Furthermore, we utilize explainable artificial intelligence to open the black-box of machine learning model, discovering four new facts: 1) variables representing the popularity of livestreaming events are crucial features in predicting GMV. And voice attributes are more important than appearance; 2) popularity is a major determinant of sales for female hosts, while vocal aesthetics is more decisive for their male counterparts; 3) merits and drawbacks of the voice are not equ",
    "path": "papers/23/10/2310.19200.json",
    "total_tokens": 918,
    "translated_title": "流行度、面容和声音：利用机器学习技术预测和解释直播电商的销售表现",
    "translated_abstract": "直播电商作为电子商务和自媒体的结合体，拓宽了传统销售表现决定因素的广泛范围。为了调查直播电商成功的因素，我们构建了一个涵盖整个直播电商子行业的长期公司级数据库，包含19175个观察点。通过比较八种机器学习模型的预测准确性，我们发现随机森林模型在预测总销售额时提供了最佳预测结果。此外，我们利用可解释的人工智能来揭示机器学习模型的黑盒子，发现了四个新的事实：1）代表直播活动流行度的变量是预测销售额的关键特征，而声音属性比外表更重要；2）流行度是女性主播销售额的主要决定因素，而声音美学对于男性主播的重要性更大；3）声音的优缺点不是等同的。",
    "tldr": "通过使用机器学习模型，我们发现直播活动的流行度和声音属性是预测直播电商销售额的关键特征，女性主持人的流行度对销售额影响更大，而男性主持人的声音美学更为重要。"
}