{
    "title": "Kernel Cox partially linear regression: building predictive models for cancer patients' survival. (arXiv:2310.07187v1 [stat.ML])",
    "abstract": "Wide heterogeneity exists in cancer patients' survival, ranging from a few months to several decades. To accurately predict clinical outcomes, it is vital to build an accurate predictive model that relates patients' molecular profiles with patients' survival. With complex relationships between survival and high-dimensional molecular predictors, it is challenging to conduct non-parametric modeling and irrelevant predictors removing simultaneously. In this paper, we build a kernel Cox proportional hazards semi-parametric model and propose a novel regularized garrotized kernel machine (RegGKM) method to fit the model. We use the kernel machine method to describe the complex relationship between survival and predictors, while automatically removing irrelevant parametric and non-parametric predictors through a LASSO penalty. An efficient high-dimensional algorithm is developed for the proposed method. Comparison with other competing methods in simulation shows that the proposed method alway",
    "link": "http://arxiv.org/abs/2310.07187",
    "context": "Title: Kernel Cox partially linear regression: building predictive models for cancer patients' survival. (arXiv:2310.07187v1 [stat.ML])\nAbstract: Wide heterogeneity exists in cancer patients' survival, ranging from a few months to several decades. To accurately predict clinical outcomes, it is vital to build an accurate predictive model that relates patients' molecular profiles with patients' survival. With complex relationships between survival and high-dimensional molecular predictors, it is challenging to conduct non-parametric modeling and irrelevant predictors removing simultaneously. In this paper, we build a kernel Cox proportional hazards semi-parametric model and propose a novel regularized garrotized kernel machine (RegGKM) method to fit the model. We use the kernel machine method to describe the complex relationship between survival and predictors, while automatically removing irrelevant parametric and non-parametric predictors through a LASSO penalty. An efficient high-dimensional algorithm is developed for the proposed method. Comparison with other competing methods in simulation shows that the proposed method alway",
    "path": "papers/23/10/2310.07187.json",
    "total_tokens": 920,
    "translated_title": "基于核Cox部分线性回归：构建癌症患者生存预测模型",
    "translated_abstract": "癌症患者的生存存在广泛的异质性，从几个月到几十年不等。为了准确预测临床结果，建立一个能够将患者的分子特征与生存情况关联起来的精确预测模型至关重要。由于生存与高维分子预测因子之间存在复杂的关系，同时进行非参数建模和去除不相关的预测因子是具有挑战性的。本文建立了一个核Cox比例风险半参数模型，并提出了一种新颖的正则化加权核机器（RegGKM）方法来拟合模型。我们使用核机器方法描述生存和预测因子之间的复杂关系，同时通过LASSO惩罚自动去除不相关的参数和非参数预测因子。为所提出的方法开发了一个高维算法。与模拟中的其他竞争方法相比，所提出的方法总是表现最好。",
    "tldr": "本文提出了一种基于核Cox部分线性回归的方法来构建癌症患者生存预测模型，通过核机器方法描述复杂的生存和预测因子关系，并利用正则化加权核机器方法自动去除不相关的因子。与其他竞争方法相比，该方法在模拟中表现最好。"
}