{
    "title": "Lost in Translation, Found in Spans: Identifying Claims in Multilingual Social Media. (arXiv:2310.18205v1 [cs.CL])",
    "abstract": "Claim span identification (CSI) is an important step in fact-checking pipelines, aiming to identify text segments that contain a checkworthy claim or assertion in a social media post. Despite its importance to journalists and human fact-checkers, it remains a severely understudied problem, and the scarce research on this topic so far has only focused on English. Here we aim to bridge this gap by creating a novel dataset, X-CLAIM, consisting of 7K real-world claims collected from numerous social media platforms in five Indian languages and English. We report strong baselines with state-of-the-art encoder-only language models (e.g., XLM-R) and we demonstrate the benefits of training on multiple languages over alternative cross-lingual transfer methods such as zero-shot transfer, or training on translated data, from a high-resource language such as English. We evaluate generative large language models from the GPT series using prompting methods on the X-CLAIM dataset and we find that they",
    "link": "http://arxiv.org/abs/2310.18205",
    "context": "Title: Lost in Translation, Found in Spans: Identifying Claims in Multilingual Social Media. (arXiv:2310.18205v1 [cs.CL])\nAbstract: Claim span identification (CSI) is an important step in fact-checking pipelines, aiming to identify text segments that contain a checkworthy claim or assertion in a social media post. Despite its importance to journalists and human fact-checkers, it remains a severely understudied problem, and the scarce research on this topic so far has only focused on English. Here we aim to bridge this gap by creating a novel dataset, X-CLAIM, consisting of 7K real-world claims collected from numerous social media platforms in five Indian languages and English. We report strong baselines with state-of-the-art encoder-only language models (e.g., XLM-R) and we demonstrate the benefits of training on multiple languages over alternative cross-lingual transfer methods such as zero-shot transfer, or training on translated data, from a high-resource language such as English. We evaluate generative large language models from the GPT series using prompting methods on the X-CLAIM dataset and we find that they",
    "path": "papers/23/10/2310.18205.json",
    "total_tokens": 962,
    "translated_title": "在跨语言社交媒体中，迷失而重现：识别言论的跨语言处理",
    "translated_abstract": "言论跨度识别（CSI）是事实核查流程中的重要步骤，旨在识别社交媒体帖子中包含有待检查的言论或断言的文本片段。尽管对新闻记者和人工事实核查者来说非常重要，但它仍然是一个严重被研究不足的问题，迄今为止，关于这个主题的研究非常有限，只专注于英语。因此，我们利用来自印度五种语言和英语的多个社交媒体平台的真实信息，创造了一个新颖的数据集X-CLAIM，其中包含7K个现实世界中的言论。我们使用最先进的编码器-只语言模型（如XLM-R）报告强大的基准，并展示了在多种语言上进行训练的好处，相比于零翻译或从高资源语言（如英语）训练的替代跨语言转换方法。我们还在X-CLAIM数据集上使用GPT系列的生成性大语言模型，并使用提示方法进行评估，发现它们的效果。",
    "tldr": "本论文介绍了一种在多语言社交媒体中识别言论的方法，通过创造一个新颖的多语言数据集X-CLAIM，采用编码器-只语言模型和生成性大语言模型进行实验，并展示了在多种语言上训练的好处。",
    "en_tdlr": "This paper presents a method for identifying claims in multilingual social media by creating a novel dataset called X-CLAIM. The experiments are conducted using encoder-only language models and generative large language models, and the benefits of training on multiple languages are demonstrated."
}