{
    "title": "Nearest Neighbor Search over Vectorized Lexico-Syntactic Patterns for Relation Extraction from Financial Documents. (arXiv:2310.17714v1 [cs.CL])",
    "abstract": "Relation extraction (RE) has achieved remarkable progress with the help of pre-trained language models. However, existing RE models are usually incapable of handling two situations: implicit expressions and long-tail relation classes, caused by language complexity and data sparsity. Further, these approaches and models are largely inaccessible to users who don't have direct access to large language models (LLMs) and/or infrastructure for supervised training or fine-tuning. Rule-based systems also struggle with implicit expressions. Apart from this, Real world financial documents such as various 10-X reports (including 10-K, 10-Q, etc.) of publicly traded companies pose another challenge to rule-based systems in terms of longer and complex sentences. In this paper, we introduce a simple approach that consults training relations at test time through a nearest-neighbor search over dense vectors of lexico-syntactic patterns and provides a simple yet effective means to tackle the above issu",
    "link": "http://arxiv.org/abs/2310.17714",
    "context": "Title: Nearest Neighbor Search over Vectorized Lexico-Syntactic Patterns for Relation Extraction from Financial Documents. (arXiv:2310.17714v1 [cs.CL])\nAbstract: Relation extraction (RE) has achieved remarkable progress with the help of pre-trained language models. However, existing RE models are usually incapable of handling two situations: implicit expressions and long-tail relation classes, caused by language complexity and data sparsity. Further, these approaches and models are largely inaccessible to users who don't have direct access to large language models (LLMs) and/or infrastructure for supervised training or fine-tuning. Rule-based systems also struggle with implicit expressions. Apart from this, Real world financial documents such as various 10-X reports (including 10-K, 10-Q, etc.) of publicly traded companies pose another challenge to rule-based systems in terms of longer and complex sentences. In this paper, we introduce a simple approach that consults training relations at test time through a nearest-neighbor search over dense vectors of lexico-syntactic patterns and provides a simple yet effective means to tackle the above issu",
    "path": "papers/23/10/2310.17714.json",
    "total_tokens": 865,
    "translated_title": "从金融文件中提取关系：基于向量化词汇句法模式的最近邻搜索",
    "translated_abstract": "鉴于语言复杂性和数据稀疏性造成的隐含表达和长尾关系类问题，现有的关系抽取模型通常无法很好地处理这两种情况。此外，对于没有直接访问大型语言模型和/或基于监督训练或微调的基础设施的用户来说，这些方法和模型通常是不可接触的。本文提出了一个简单的方法，在测试时通过对词汇句法模式的稠密向量进行最近邻搜索，以解决上述问题提供了一种简单而有效的手段。",
    "tldr": "本文提出了一个简单而有效的方法，通过在测试时使用密集向量的词汇句法模式进行最近邻搜索，来解决关系抽取中的隐含表达和长尾关系类问题，并提供了一种简单可行的解决方法，特别适用于没有直接访问大型语言模型和/或基于监督训练或微调的基础设施的用户。"
}