{
    "title": "Intelligent Client Selection for Federated Learning using Cellular Automata. (arXiv:2310.00627v2 [cs.LG] UPDATED)",
    "abstract": "Federated Learning (FL) has emerged as a promising solution for privacy-enhancement and latency minimization in various real-world applications, such as transportation, communications, and healthcare. FL endeavors to bring Machine Learning (ML) down to the edge by harnessing data from million of devices and IoT sensors, thus enabling rapid responses to dynamic environments and yielding highly personalized results. However, the increased amount of sensors across diverse applications poses challenges in terms of communication and resource allocation, hindering the participation of all devices in the federated process and prompting the need for effective FL client selection. To address this issue, we propose Cellular Automaton-based Client Selection (CA-CS), a novel client selection algorithm, which leverages Cellular Automata (CA) as models to effectively capture spatio-temporal changes in a fast-evolving environment. CA-CS considers the computational resources and communication capacity",
    "link": "http://arxiv.org/abs/2310.00627",
    "context": "Title: Intelligent Client Selection for Federated Learning using Cellular Automata. (arXiv:2310.00627v2 [cs.LG] UPDATED)\nAbstract: Federated Learning (FL) has emerged as a promising solution for privacy-enhancement and latency minimization in various real-world applications, such as transportation, communications, and healthcare. FL endeavors to bring Machine Learning (ML) down to the edge by harnessing data from million of devices and IoT sensors, thus enabling rapid responses to dynamic environments and yielding highly personalized results. However, the increased amount of sensors across diverse applications poses challenges in terms of communication and resource allocation, hindering the participation of all devices in the federated process and prompting the need for effective FL client selection. To address this issue, we propose Cellular Automaton-based Client Selection (CA-CS), a novel client selection algorithm, which leverages Cellular Automata (CA) as models to effectively capture spatio-temporal changes in a fast-evolving environment. CA-CS considers the computational resources and communication capacity",
    "path": "papers/23/10/2310.00627.json",
    "total_tokens": 851,
    "translated_title": "使用元胞自动机的智能客户端选择进行联邦学习",
    "translated_abstract": "联邦学习（FL）已成为解决隐私增强和延迟最小化等各种实际应用（如交通、通信和医疗）中的问题的有希望的解决方案。FL通过利用来自数百万设备和物联网传感器的数据将机器学习（ML）引入边缘，从而实现对动态环境的快速响应，并产生高度个性化的结果。然而，不同应用中传感器数量的增加在通信和资源分配方面带来了挑战，阻碍了所有设备参与联邦过程的能力，进而需要有效的FL客户端选择。为了解决这个问题，我们提出了基于元胞自动机的客户端选择（CA-CS），这是一种新颖的客户端选择算法，它利用元胞自动机（CA）作为模型，以有效地捕捉快速演变环境中的时空变化。CA-CS考虑了计算资源和通信能力。",
    "tldr": "本研究提出了一种使用元胞自动机的智能客户端选择算法，用于解决联邦学习中由于传感器数量增加带来的通信和资源分配问题。"
}