{
    "title": "Coalitional Manipulations and Immunity of the Shapley Value. (arXiv:2310.20415v1 [econ.TH])",
    "abstract": "We consider manipulations in the context of coalitional games, where a coalition aims to increase the total payoff of its members. An allocation rule is immune to coalitional manipulation if no coalition can benefit from internal reallocation of worth on the level of its subcoalitions (reallocation-proofness), and if no coalition benefits from a lower worth while all else remains the same (weak coalitional monotonicity). Replacing additivity in Shapley's original characterization by these requirements yields a new foundation of the Shapley value, i.e., it is the unique efficient and symmetric allocation rule that awards nothing to a null player and is immune to coalitional manipulations. We further find that for efficient allocation rules, reallocation-proofness is equivalent to constrained marginality, a weaker variant of Young's marginality axiom. Our second characterization improves upon Young's characterization by weakening the independence requirement intrinsic to marginality.",
    "link": "http://arxiv.org/abs/2310.20415",
    "context": "Title: Coalitional Manipulations and Immunity of the Shapley Value. (arXiv:2310.20415v1 [econ.TH])\nAbstract: We consider manipulations in the context of coalitional games, where a coalition aims to increase the total payoff of its members. An allocation rule is immune to coalitional manipulation if no coalition can benefit from internal reallocation of worth on the level of its subcoalitions (reallocation-proofness), and if no coalition benefits from a lower worth while all else remains the same (weak coalitional monotonicity). Replacing additivity in Shapley's original characterization by these requirements yields a new foundation of the Shapley value, i.e., it is the unique efficient and symmetric allocation rule that awards nothing to a null player and is immune to coalitional manipulations. We further find that for efficient allocation rules, reallocation-proofness is equivalent to constrained marginality, a weaker variant of Young's marginality axiom. Our second characterization improves upon Young's characterization by weakening the independence requirement intrinsic to marginality.",
    "path": "papers/23/10/2310.20415.json",
    "total_tokens": 903,
    "translated_title": "群体操纵与Shapley值的免疫性",
    "translated_abstract": "我们考虑在群体博弈的背景下的操纵，其中一个联盟旨在增加其成员的总支付。如果一种分配规则对集体操纵免疫，那么没有任何联盟可以通过在其子联盟的层级上重新分配价值来获益（具有重新分配证明性），而且如果在其他条件不变的情况下，没有任何联盟可以从较低的价值中受益（具有弱集体单调性）。将Shapley在原始特征的可加性替换为这些要求可以得到Shapley值的新基础，即它是唯一的有效和对称的分配规则，对空玩家不予任何奖励，并且对集体操纵免疫。我们进一步发现，对于有效的分配规则，重新分配证明性等效于有约束的边际性，这是Young的边际性公理的一个较弱变体。我们的第二个特征改进了Young的特征，弱化了边际性内在的独立性要求。",
    "tldr": "本文研究了在群体博弈中的操纵现象，并提出了一种新的Shapley值基础，它是唯一的有效和对称的分配规则，对集体操纵具有免疫性。"
}