{
    "title": "Surrogate modeling for stochastic crack growth processes in structural health monitoring applications. (arXiv:2310.07241v1 [stat.ML])",
    "abstract": "Fatigue crack growth is one of the most common types of deterioration in metal structures with significant implications on their reliability. Recent advances in Structural Health Monitoring (SHM) have motivated the use of structural response data to predict future crack growth under uncertainty, in order to enable a transition towards predictive maintenance. Accurately representing different sources of uncertainty in stochastic crack growth (SCG) processes is a non-trivial task. The present work builds on previous research on physics-based SCG modeling under both material and load-related uncertainty. The aim here is to construct computationally efficient, probabilistic surrogate models for SCG processes that successfully encode these different sources of uncertainty. An approach inspired by latent variable modeling is employed that utilizes Gaussian Process (GP) regression models to enable the surrogates to be used to generate prior distributions for different Bayesian SHM tasks as th",
    "link": "http://arxiv.org/abs/2310.07241",
    "context": "Title: Surrogate modeling for stochastic crack growth processes in structural health monitoring applications. (arXiv:2310.07241v1 [stat.ML])\nAbstract: Fatigue crack growth is one of the most common types of deterioration in metal structures with significant implications on their reliability. Recent advances in Structural Health Monitoring (SHM) have motivated the use of structural response data to predict future crack growth under uncertainty, in order to enable a transition towards predictive maintenance. Accurately representing different sources of uncertainty in stochastic crack growth (SCG) processes is a non-trivial task. The present work builds on previous research on physics-based SCG modeling under both material and load-related uncertainty. The aim here is to construct computationally efficient, probabilistic surrogate models for SCG processes that successfully encode these different sources of uncertainty. An approach inspired by latent variable modeling is employed that utilizes Gaussian Process (GP) regression models to enable the surrogates to be used to generate prior distributions for different Bayesian SHM tasks as th",
    "path": "papers/23/10/2310.07241.json",
    "total_tokens": 895,
    "translated_title": "结构健康监测应用中的随机裂纹扩展过程的代理模型",
    "translated_abstract": "疲劳裂纹扩展是金属结构中最常见的一种破坏类型，对其可靠性有重要影响。最近在结构健康监测领域的进展促使使用结构响应数据来预测不确定条件下未来的裂纹扩展，以实现向预测性维修的过渡。准确地表示随机裂纹扩展过程中不同的不确定性来源是一项非常困难的任务。本研究在基于物理模型的随机裂纹扩展建模的基础上进行了探索，考虑了材料和载荷相关的不确定性。本文旨在构建计算效率高、概率代理模型，能够成功地编码这些不同的不确定性来源。采用了受潜变量建模启发的方法，利用高斯过程回归模型使代理模型可以用于为不同的贝叶斯结构健康监测任务生成先验分布。",
    "tldr": "本文提出了一种代理模型用于预测结构中裂纹的扩展，并成功地编码了不同的随机不确定性来源。该模型基于高斯过程回归模型，能够生成先验分布用于贝叶斯结构健康监测任务。",
    "en_tdlr": "This paper proposes a surrogate model for predicting crack growth in structures and successfully encodes different sources of stochastic uncertainty. The model, based on Gaussian Process regression, can generate prior distributions for Bayesian Structural Health Monitoring tasks."
}