{
    "title": "CausalGPS: An R Package for Causal Inference With Continuous Exposures. (arXiv:2310.00561v1 [stat.CO])",
    "abstract": "Quantifying the causal effects of continuous exposures on outcomes of interest is critical for social, economic, health, and medical research. However, most existing software packages focus on binary exposures. We develop the CausalGPS R package that implements a collection of algorithms to provide algorithmic solutions for causal inference with continuous exposures. CausalGPS implements a causal inference workflow, with algorithms based on generalized propensity scores (GPS) as the core, extending propensity scores (the probability of a unit being exposed given pre-exposure covariates) from binary to continuous exposures. As the first step, the package implements efficient and flexible estimations of the GPS, allowing multiple user-specified modeling options. As the second step, the package provides two ways to adjust for confounding: weighting and matching, generating weighted and matched data sets, respectively. Lastly, the package provides built-in functions to fit flexible paramet",
    "link": "http://arxiv.org/abs/2310.00561",
    "context": "Title: CausalGPS: An R Package for Causal Inference With Continuous Exposures. (arXiv:2310.00561v1 [stat.CO])\nAbstract: Quantifying the causal effects of continuous exposures on outcomes of interest is critical for social, economic, health, and medical research. However, most existing software packages focus on binary exposures. We develop the CausalGPS R package that implements a collection of algorithms to provide algorithmic solutions for causal inference with continuous exposures. CausalGPS implements a causal inference workflow, with algorithms based on generalized propensity scores (GPS) as the core, extending propensity scores (the probability of a unit being exposed given pre-exposure covariates) from binary to continuous exposures. As the first step, the package implements efficient and flexible estimations of the GPS, allowing multiple user-specified modeling options. As the second step, the package provides two ways to adjust for confounding: weighting and matching, generating weighted and matched data sets, respectively. Lastly, the package provides built-in functions to fit flexible paramet",
    "path": "papers/23/10/2310.00561.json",
    "total_tokens": 840,
    "translated_title": "CausalGPS: 一个用于连续曝光的因果推断的 R 包",
    "translated_abstract": "对于社会、经济、健康和医学研究来说，量化连续曝光对感兴趣结果的因果效应至关重要。然而，目前大多数现有的软件包都集中在二进制曝光上。我们开发了 CausalGPS R 包，该包实现了一系列算法，为连续曝光的因果推断提供算法解决方案。CausalGPS 实现了一个因果推断工作流程，其核心是基于广义倾向得分（GPS）的算法，将倾向得分（在 pre-exposure 协变量给定情况下单位被曝光的概率）从二进制曝光扩展到连续曝光。作为第一步，该包实现了高效灵活的 GPS 估计，允许多个用户指定的建模选项。作为第二步，该包提供了两种消除混淆的方法：加权和匹配，分别生成加权和匹配的数据集。最后，该包提供了内置函",
    "tldr": "CausalGPS是一个R包，用于实现连续曝光的因果推断，并提供了灵活的估计和调整混淆的方法。",
    "en_tdlr": "CausalGPS is an R package for causal inference with continuous exposures, providing flexible estimation and confounding adjustment methods."
}