{
    "title": "Evolution of Natural Language Processing Technology: Not Just Language Processing Towards General Purpose AI. (arXiv:2310.06228v1 [cs.CL])",
    "abstract": "Since the invention of computers, communication through natural language (actual human language) has been a dream technology. However, natural language is extremely difficult to mathematically formulate, making it difficult to realize as an algorithm without considering programming. While there have been numerous technological developments, one cannot say that any results allowing free utilization have been achieved thus far. In the case of language learning in humans, for instance when learning one's mother tongue or foreign language, one must admit that this process is similar to the adage \"practice makes perfect\" in principle, even though the learning method is significant up to a point. Deep learning has played a central role in contemporary AI technology in recent years. When applied to natural language processing (NLP), this produced unprecedented results. Achievements exceeding the initial predictions have been reported from the results of learning vast amounts of textual data u",
    "link": "http://arxiv.org/abs/2310.06228",
    "context": "Title: Evolution of Natural Language Processing Technology: Not Just Language Processing Towards General Purpose AI. (arXiv:2310.06228v1 [cs.CL])\nAbstract: Since the invention of computers, communication through natural language (actual human language) has been a dream technology. However, natural language is extremely difficult to mathematically formulate, making it difficult to realize as an algorithm without considering programming. While there have been numerous technological developments, one cannot say that any results allowing free utilization have been achieved thus far. In the case of language learning in humans, for instance when learning one's mother tongue or foreign language, one must admit that this process is similar to the adage \"practice makes perfect\" in principle, even though the learning method is significant up to a point. Deep learning has played a central role in contemporary AI technology in recent years. When applied to natural language processing (NLP), this produced unprecedented results. Achievements exceeding the initial predictions have been reported from the results of learning vast amounts of textual data u",
    "path": "papers/23/10/2310.06228.json",
    "total_tokens": 904,
    "translated_title": "自然语言处理技术的演进：不仅仅是语言处理，而是朝向通用人工智能",
    "translated_abstract": "自发明计算机以来，通过自然语言（实际的人类语言）进行通信一直是一项梦幻的技术。然而，自然语言非常难以进行数学上的表达，这使得在不考虑编程的情况下实现算法变得困难。尽管已经有了许多技术发展，但到目前为止，还不能说已经实现了任何允许自由利用的结果。举例来说，在人类的语言学习中，例如学习母语或外语时，我们必须承认这个过程与格言“熟能生巧”在原则上是相似的，尽管学习方法在某种程度上是重要的。深度学习近年来在当代人工智能技术中扮演了核心角色。当应用于自然语言处理（NLP）时，这产生了前所未有的结果。从学习大量文本数据的结果中，已经有报道称超出了最初的预测。",
    "tldr": "这篇论文翻译成中文并总结指出，自然语言处理技术逐渐演进为通用人工智能，尽管自然语言非常难以进行数学上的表达，但通过深度学习在NLP领域取得了超乎预期的结果。",
    "en_tdlr": "This translated and summarized paper points out that natural language processing technology is evolving towards general purpose AI, despite the difficulty in mathematically formulating natural language. Unprecedented results have been achieved in the field of NLP through deep learning."
}