{
    "title": "Stable and Interpretable Deep Learning for Tabular Data: Introducing InterpreTabNet with the Novel InterpreStability Metric. (arXiv:2310.02870v1 [cs.LG])",
    "abstract": "As Artificial Intelligence (AI) integrates deeper into diverse sectors, the quest for powerful models has intensified. While significant strides have been made in boosting model capabilities and their applicability across domains, a glaring challenge persists: many of these state-of-the-art models remain as black boxes. This opacity not only complicates the explanation of model decisions to end-users but also obstructs insights into intermediate processes for model designers. To address these challenges, we introduce InterpreTabNet, a model designed to enhance both classification accuracy and interpretability by leveraging the TabNet architecture with an improved attentive module. This design ensures robust gradient propagation and computational stability. Additionally, we present a novel evaluation metric, InterpreStability, which quantifies the stability of a model's interpretability. The proposed model and metric mark a significant stride forward in explainable models' research, set",
    "link": "http://arxiv.org/abs/2310.02870",
    "context": "Title: Stable and Interpretable Deep Learning for Tabular Data: Introducing InterpreTabNet with the Novel InterpreStability Metric. (arXiv:2310.02870v1 [cs.LG])\nAbstract: As Artificial Intelligence (AI) integrates deeper into diverse sectors, the quest for powerful models has intensified. While significant strides have been made in boosting model capabilities and their applicability across domains, a glaring challenge persists: many of these state-of-the-art models remain as black boxes. This opacity not only complicates the explanation of model decisions to end-users but also obstructs insights into intermediate processes for model designers. To address these challenges, we introduce InterpreTabNet, a model designed to enhance both classification accuracy and interpretability by leveraging the TabNet architecture with an improved attentive module. This design ensures robust gradient propagation and computational stability. Additionally, we present a novel evaluation metric, InterpreStability, which quantifies the stability of a model's interpretability. The proposed model and metric mark a significant stride forward in explainable models' research, set",
    "path": "papers/23/10/2310.02870.json",
    "total_tokens": 925,
    "translated_title": "针对表格数据的稳定且可解释的深度学习: 引入具有新型InterpreStability指标的InterpreTabNet",
    "translated_abstract": "随着人工智能（AI）在各个领域的深度整合，对强大模型的追求已经加剧。虽然在提升模型能力和适用性方面已经取得了重大进展，但一个明显的挑战仍然存在：许多最先进的模型仍然是黑箱。这种不透明性不仅使解释模型决策给最终用户带来了复杂性，而且还阻碍了模型设计者对中间过程的洞察。为了解决这些挑战，我们引入了InterpreTabNet，这是一个通过利用改进的注意模块，改进TabNet架构，从而提高分类准确度和解释性的模型。这种设计确保了强大的梯度传播和计算稳定性。此外，我们还提出了一种新型评价指标InterpreStability，该指标量化了模型的解释稳定性。所提出的模型和指标标志着可解释模型研究的重要进展。",
    "tldr": "我们引入了InterpreTabNet，通过改进的注意模块和TabNet架构，提高了表格数据的分类准确度和解释性。我们还提出了一种新的评价指标InterpreStability，用于量化模型的解释稳定性。",
    "en_tdlr": "We introduce InterpreTabNet, which enhances classification accuracy and interpretability for tabular data using an improved attentive module and TabNet architecture. We also propose a novel evaluation metric, InterpreStability, to quantify the stability of a model's interpretability."
}