{
    "title": "Extraction of Medication and Temporal Relation from Clinical Text using Neural Language Models. (arXiv:2310.02229v2 [cs.CL] UPDATED)",
    "abstract": "Clinical texts, represented in electronic medical records (EMRs), contain rich medical information and are essential for disease prediction, personalised information recommendation, clinical decision support, and medication pattern mining and measurement. Relation extractions between medication mentions and temporal information can further help clinicians better understand the patients' treatment history. To evaluate the performances of deep learning (DL) and large language models (LLMs) in medication extraction and temporal relations classification, we carry out an empirical investigation of \\textbf{MedTem} project using several advanced learning structures including BiLSTM-CRF and CNN-BiLSTM for a clinical domain named entity recognition (NER), and BERT-CNN for temporal relation extraction (RE), in addition to the exploration of different word embedding techniques. Furthermore, we also designed a set of post-processing roles to generate structured output on medications and the tempor",
    "link": "http://arxiv.org/abs/2310.02229",
    "context": "Title: Extraction of Medication and Temporal Relation from Clinical Text using Neural Language Models. (arXiv:2310.02229v2 [cs.CL] UPDATED)\nAbstract: Clinical texts, represented in electronic medical records (EMRs), contain rich medical information and are essential for disease prediction, personalised information recommendation, clinical decision support, and medication pattern mining and measurement. Relation extractions between medication mentions and temporal information can further help clinicians better understand the patients' treatment history. To evaluate the performances of deep learning (DL) and large language models (LLMs) in medication extraction and temporal relations classification, we carry out an empirical investigation of \\textbf{MedTem} project using several advanced learning structures including BiLSTM-CRF and CNN-BiLSTM for a clinical domain named entity recognition (NER), and BERT-CNN for temporal relation extraction (RE), in addition to the exploration of different word embedding techniques. Furthermore, we also designed a set of post-processing roles to generate structured output on medications and the tempor",
    "path": "papers/23/10/2310.02229.json",
    "total_tokens": 890,
    "translated_title": "使用神经语言模型从临床文本中提取药物和时间关系",
    "translated_abstract": "临床文本在电子医疗记录（EMRs）中表示，包含丰富的医学信息，对疾病预测、个性化信息推荐、临床决策支持以及药物模式挖掘和测量至关重要。药物提取和时间关系分类之间的关系进一步帮助临床医生更好地了解患者的治疗历史。为了评估深度学习（DL）和大型语言模型（LLMs）在药物提取和时间关系分类中的性能，我们对名为MedTem的临床领域实体识别（NER）进行了实证研究，并使用了几种先进的学习结构，包括BiLSTM-CRF和CNN-BiLSTM，以及用于时间关系提取（RE）的BERT-CNN，此外，还探索了不同的词嵌入技术。此外，我们还设计了一套后处理规则，以生成关于药物和时间的结构化输出。",
    "tldr": "本研究使用深度学习和大型语言模型，通过名为MedTem的临床领域实体识别和时间关系提取，来提取临床文本中的药物和时间关系，以帮助临床医生更好地了解患者的治疗历史。",
    "en_tdlr": "This study uses deep learning and large language models to extract medication and temporal relations from clinical text, aiming to help clinicians better understand patients' treatment history."
}