{
    "title": "Automatic Generators for a Family of Matrix Multiplication Routines with Apache TVM. (arXiv:2310.20347v1 [cs.CL])",
    "abstract": "We explore the utilization of the Apache TVM open source framework to automatically generate a family of algorithms that follow the approach taken by popular linear algebra libraries, such as GotoBLAS2, BLIS and OpenBLAS, in order to obtain high-performance blocked formulations of the general matrix multiplication (GEMM). % In addition, we fully automatize the generation process, by also leveraging the Apache TVM framework to derive a complete variety of the processor-specific micro-kernels for GEMM. This is in contrast with the convention in high performance libraries, which hand-encode a single micro-kernel per architecture using Assembly code. % In global, the combination of our TVM-generated blocked algorithms and micro-kernels for GEMM 1)~improves portability, maintainability and, globally, streamlines the software life cycle; 2)~provides high flexibility to easily tailor and optimize the solution to different data types, processor architectures, and matrix operand shapes, yieldin",
    "link": "http://arxiv.org/abs/2310.20347",
    "context": "Title: Automatic Generators for a Family of Matrix Multiplication Routines with Apache TVM. (arXiv:2310.20347v1 [cs.CL])\nAbstract: We explore the utilization of the Apache TVM open source framework to automatically generate a family of algorithms that follow the approach taken by popular linear algebra libraries, such as GotoBLAS2, BLIS and OpenBLAS, in order to obtain high-performance blocked formulations of the general matrix multiplication (GEMM). % In addition, we fully automatize the generation process, by also leveraging the Apache TVM framework to derive a complete variety of the processor-specific micro-kernels for GEMM. This is in contrast with the convention in high performance libraries, which hand-encode a single micro-kernel per architecture using Assembly code. % In global, the combination of our TVM-generated blocked algorithms and micro-kernels for GEMM 1)~improves portability, maintainability and, globally, streamlines the software life cycle; 2)~provides high flexibility to easily tailor and optimize the solution to different data types, processor architectures, and matrix operand shapes, yieldin",
    "path": "papers/23/10/2310.20347.json",
    "total_tokens": 741,
    "translated_title": "使用Apache TVM自动生成一系列矩阵乘法例程",
    "translated_abstract": "我们探索了利用Apache TVM开源框架自动生成一系列算法，这些算法遵循了流行的线性代数库（如GotoBLAS2、BLIS和OpenBLAS）的方法，以获得高性能的阻塞通用矩阵乘法（GEMM）形式。此外，我们完全自动化了生成过程，还利用Apache TVM框架推导出了GEMM的完整的特定处理器微内核的各种变体。这与高性能库中使用汇编代码手动编码的单个微内核的做法有所不同。",
    "tldr": "使用Apache TVM自动生成一系列高性能的阻塞矩阵乘法算法，并且通过生成特定处理器的微内核提供了灵活性和可优化性。",
    "en_tdlr": "Automatically generate a series of high-performance blocked matrix multiplication algorithms using Apache TVM, and provide flexibility and optimization through the generation of processor-specific micro-kernels."
}