{
    "title": "PubDef: Defending Against Transfer Attacks From Public Models",
    "abstract": "arXiv:2310.17645v2 Announce Type: replace-cross  Abstract: Adversarial attacks have been a looming and unaddressed threat in the industry. However, through a decade-long history of the robustness evaluation literature, we have learned that mounting a strong or optimal attack is challenging. It requires both machine learning and domain expertise. In other words, the white-box threat model, religiously assumed by a large majority of the past literature, is unrealistic. In this paper, we propose a new practical threat model where the adversary relies on transfer attacks through publicly available surrogate models. We argue that this setting will become the most prevalent for security-sensitive applications in the future. We evaluate the transfer attacks in this setting and propose a specialized defense method based on a game-theoretic perspective. The defenses are evaluated under 24 public models and 11 attack algorithms across three datasets (CIFAR-10, CIFAR-100, and ImageNet). Under thi",
    "link": "https://arxiv.org/abs/2310.17645",
    "context": "Title: PubDef: Defending Against Transfer Attacks From Public Models\nAbstract: arXiv:2310.17645v2 Announce Type: replace-cross  Abstract: Adversarial attacks have been a looming and unaddressed threat in the industry. However, through a decade-long history of the robustness evaluation literature, we have learned that mounting a strong or optimal attack is challenging. It requires both machine learning and domain expertise. In other words, the white-box threat model, religiously assumed by a large majority of the past literature, is unrealistic. In this paper, we propose a new practical threat model where the adversary relies on transfer attacks through publicly available surrogate models. We argue that this setting will become the most prevalent for security-sensitive applications in the future. We evaluate the transfer attacks in this setting and propose a specialized defense method based on a game-theoretic perspective. The defenses are evaluated under 24 public models and 11 attack algorithms across three datasets (CIFAR-10, CIFAR-100, and ImageNet). Under thi",
    "path": "papers/23/10/2310.17645.json",
    "total_tokens": 913,
    "translated_title": "PubDef：防御来自公共模型的迁移攻击",
    "translated_abstract": "对抗性攻击一直是行业中一个令人担忧且未解决的威胁。然而，通过十年的鲁棒性评估文献历史，我们了解到发起强大或最优攻击是具有挑战性的，它需要机器学习和领域专业知识。换句话说，过去大多数文献坚定假设的白盒威胁模型是不现实的。在本文中，我们提出了一个新的实用威胁模型，在这个模型中，对手依赖于通过公开可用的替代模型的迁移攻击。我们认为这种设置将成为未来安全敏感应用中最普遍的情况。我们评估了在这种设置下的迁移攻击，并提出了基于博弈论视角的专门防御方法。这些防御方法在24个公共模型和11种攻击算法下进行了评估，涵盖三个数据集（CIFAR-10、CIFAR-100 和 ImageNet）。",
    "tldr": "本文提出了一个新的实用威胁模型，其中对手依赖于通过公开可用的替代模型的迁移攻击，提出了一种基于博弈论视角的专门防御方法，并在多个公共模型和攻击算法下进行了评估。",
    "en_tdlr": "This paper introduces a new practical threat model where adversaries rely on transfer attacks through publicly available surrogate models, proposes a specialized defense method based on a game-theoretic perspective, and evaluates it under various public models and attack algorithms."
}