{
    "title": "Exploring Geometry of Blind Spots in Vision Models. (arXiv:2310.19889v1 [cs.CV])",
    "abstract": "Despite the remarkable success of deep neural networks in a myriad of settings, several works have demonstrated their overwhelming sensitivity to near-imperceptible perturbations, known as adversarial attacks. On the other hand, prior works have also observed that deep networks can be under-sensitive, wherein large-magnitude perturbations in input space do not induce appreciable changes to network activations. In this work, we study in detail the phenomenon of under-sensitivity in vision models such as CNNs and Transformers, and present techniques to study the geometry and extent of \"equi-confidence\" level sets of such networks. We propose a Level Set Traversal algorithm that iteratively explores regions of high confidence with respect to the input space using orthogonal components of the local gradients. Given a source image, we use this algorithm to identify inputs that lie in the same equi-confidence level set as the source image despite being perceptually similar to arbitrary image",
    "link": "http://arxiv.org/abs/2310.19889",
    "context": "Title: Exploring Geometry of Blind Spots in Vision Models. (arXiv:2310.19889v1 [cs.CV])\nAbstract: Despite the remarkable success of deep neural networks in a myriad of settings, several works have demonstrated their overwhelming sensitivity to near-imperceptible perturbations, known as adversarial attacks. On the other hand, prior works have also observed that deep networks can be under-sensitive, wherein large-magnitude perturbations in input space do not induce appreciable changes to network activations. In this work, we study in detail the phenomenon of under-sensitivity in vision models such as CNNs and Transformers, and present techniques to study the geometry and extent of \"equi-confidence\" level sets of such networks. We propose a Level Set Traversal algorithm that iteratively explores regions of high confidence with respect to the input space using orthogonal components of the local gradients. Given a source image, we use this algorithm to identify inputs that lie in the same equi-confidence level set as the source image despite being perceptually similar to arbitrary image",
    "path": "papers/23/10/2310.19889.json",
    "total_tokens": 954,
    "translated_title": "探索视觉模型中的盲点几何",
    "translated_abstract": "尽管深度神经网络在各种应用中取得了显著的成功，但一些研究表明它们对接近无法察觉的扰动非常敏感，即所谓的对抗攻击。另一方面，先前的研究还观察到，深度网络也可能出现对输入空间中的大幅扰动不敏感的情况，而这并不会导致网络激活发生明显改变。在本研究中，我们详细研究了在CNNs和Transformers等视觉模型中的不敏感现象，并提出了研究这些网络“等置信度”级别集合的几何形状和范围的技术。我们提出了一种级别集遍历算法，通过使用局部梯度的正交分量来迭代地探索与输入空间中高置信度区域。给定一个源图像，我们使用该算法来识别与源图像属于相同等置信度级别集的输入，尽管它们在感知上与任意图像相似。",
    "tldr": "本研究探索了在视觉模型中存在的不敏感现象，并提出了一种通过研究网络的等置信度级别集合的几何形状和范围的技术。通过提出的级别集遍历算法，可以找到与给定源图像相似但属于相同等置信度级别集的输入图像。",
    "en_tdlr": "This paper explores the phenomenon of under-sensitivity in vision models and proposes techniques to study the geometry and extent of the networks' equi-confidence level sets. The Level Set Traversal algorithm is introduced to identify inputs that are perceptually similar to a given source image but belong to the same equi-confidence level set."
}