{
    "title": "Serenade: A Model for Human-in-the-loop Automatic Chord Estimation. (arXiv:2310.11165v1 [cs.SD])",
    "abstract": "Computational harmony analysis is important for MIR tasks such as automatic segmentation, corpus analysis and automatic chord label estimation. However, recent research into the ambiguous nature of musical harmony, causing limited inter-rater agreement, has made apparent that there is a glass ceiling for common metrics such as accuracy. Commonly, these issues are addressed either in the training data itself by creating majority-rule annotations or during the training phase by learning soft targets. We propose a novel alternative approach in which a human and an autoregressive model together co-create a harmonic annotation for an audio track. After automatically generating harmony predictions, a human sparsely annotates parts with low model confidence and the model then adjusts its predictions following human guidance. We evaluate our model on a dataset of popular music and we show that, with this human-in-the-loop approach, harmonic analysis performance improves over a model-only appro",
    "link": "http://arxiv.org/abs/2310.11165",
    "context": "Title: Serenade: A Model for Human-in-the-loop Automatic Chord Estimation. (arXiv:2310.11165v1 [cs.SD])\nAbstract: Computational harmony analysis is important for MIR tasks such as automatic segmentation, corpus analysis and automatic chord label estimation. However, recent research into the ambiguous nature of musical harmony, causing limited inter-rater agreement, has made apparent that there is a glass ceiling for common metrics such as accuracy. Commonly, these issues are addressed either in the training data itself by creating majority-rule annotations or during the training phase by learning soft targets. We propose a novel alternative approach in which a human and an autoregressive model together co-create a harmonic annotation for an audio track. After automatically generating harmony predictions, a human sparsely annotates parts with low model confidence and the model then adjusts its predictions following human guidance. We evaluate our model on a dataset of popular music and we show that, with this human-in-the-loop approach, harmonic analysis performance improves over a model-only appro",
    "path": "papers/23/10/2310.11165.json",
    "total_tokens": 847,
    "translated_title": "Serenade: 人为参与的自动和弦估计模型",
    "translated_abstract": "计算机和声分析对于自动的分割、语料库分析和自动和弦标签估计等音乐信息检索任务非常重要。然而，最近关于音乐和声的模糊性导致了有限的一致性，这显露出了目前通用指标如准确性存在的瓶颈。通常情况下，这些问题要么在训练数据中通过创建多数规则注释进行解决，要么在训练阶段通过学习软目标进行解决。我们提出了一个新的替代方法，其中人类和自回归模型共同为音频轨迹创建和声注释。在自动生成和声预测后，人类稀疏地标注模型置信度较低的部分，然后模型根据人类的指导调整其预测结果。我们在一组流行音乐的数据集上评估了我们的模型，并展示了这种人为参与的方法能够提高和声分析的性能。",
    "tldr": "该论文提出了一种人为参与的自动和弦估计模型，通过人与自回归模型共同创建和声注释，实现在音乐信息检索任务中的性能提升。",
    "en_tdlr": "This paper introduces a human-in-the-loop automatic chord estimation model, which improves the performance of music information retrieval tasks by involving both humans and an autoregressive model in creating harmonic annotations."
}