{
    "title": "Over-the-Air Federated Learning with Compressed Sensing: Is Sparsification Necessary?. (arXiv:2310.03410v1 [cs.IT])",
    "abstract": "Over-the-Air (OtA) Federated Learning (FL) refers to an FL system where multiple agents apply OtA computation for transmitting model updates to a common edge server. Two important features of OtA computation, namely linear processing and signal-level superposition, motivate the use of linear compression with compressed sensing (CS) methods to reduce the number of data samples transmitted over the channel. The previous works on applying CS methods in OtA FL have primarily assumed that the original model update vectors are sparse, or they have been sparsified before compression. However, it is unclear whether linear compression with CS-based reconstruction is more effective than directly sending the non-zero elements in the sparsified update vectors, under the same total power constraint. In this study, we examine and compare several communication designs with or without sparsification. Our findings demonstrate that sparsification before compression is not necessary. Alternatively, spars",
    "link": "http://arxiv.org/abs/2310.03410",
    "context": "Title: Over-the-Air Federated Learning with Compressed Sensing: Is Sparsification Necessary?. (arXiv:2310.03410v1 [cs.IT])\nAbstract: Over-the-Air (OtA) Federated Learning (FL) refers to an FL system where multiple agents apply OtA computation for transmitting model updates to a common edge server. Two important features of OtA computation, namely linear processing and signal-level superposition, motivate the use of linear compression with compressed sensing (CS) methods to reduce the number of data samples transmitted over the channel. The previous works on applying CS methods in OtA FL have primarily assumed that the original model update vectors are sparse, or they have been sparsified before compression. However, it is unclear whether linear compression with CS-based reconstruction is more effective than directly sending the non-zero elements in the sparsified update vectors, under the same total power constraint. In this study, we examine and compare several communication designs with or without sparsification. Our findings demonstrate that sparsification before compression is not necessary. Alternatively, spars",
    "path": "papers/23/10/2310.03410.json",
    "total_tokens": 852,
    "translated_title": "使用压缩感知的空中联合学习：稀疏化是否必要？",
    "translated_abstract": "空中联合学习（OtA FL）是指多个代理通过 OtA 计算将模型更新发送到公共边缘服务器的一种 FL 系统。OtA 计算的两个重要特性，即线性处理和信号级叠加，促使使用压缩感知（CS）方法进行线性压缩，以减少通过信道传输的数据样本数量。以前关于在 OtA FL 中应用 CS 方法的研究主要假设原始模型更新向量是稀疏的，或者在压缩之前进行了稀疏化。但是，尚不清楚在线性压缩和基于 CS 的重构与直接发送稀疏化更新向量中的非零元素，在相同的总功率约束下，哪种方法更有效。在这项研究中，我们检查并比较了几种带有或不带有稀疏化的通信设计。我们的研究结果表明，压缩之前的稀疏化并不必要。替代的做法可以达到相同的效果。",
    "tldr": "本研究通过比较多种通信设计，发现在空中联合学习中压缩之前的稀疏化并不必要。",
    "en_tdlr": "This study demonstrates that sparsification before compression is not necessary in over-the-air federated learning."
}