{
    "title": "CarDS-Plus ECG Platform: Development and Feasibility Evaluation of a Multiplatform Artificial Intelligence Toolkit for Portable and Wearable Device Electrocardiograms. (arXiv:2310.07000v1 [cs.LG])",
    "abstract": "In the rapidly evolving landscape of modern healthcare, the integration of wearable & portable technology provides a unique opportunity for personalized health monitoring in the community. Devices like the Apple Watch, FitBit, and AliveCor KardiaMobile have revolutionized the acquisition and processing of intricate health data streams. Amidst the variety of data collected by these gadgets, single-lead electrocardiogram (ECG) recordings have emerged as a crucial source of information for monitoring cardiovascular health. There has been significant advances in artificial intelligence capable of interpreting these 1-lead ECGs, facilitating clinical diagnosis as well as the detection of rare cardiac disorders. This design study describes the development of an innovative multiplatform system aimed at the rapid deployment of AI-based ECG solutions for clinical investigation & care delivery. The study examines design considerations, aligning them with specific applications, develops data flow",
    "link": "http://arxiv.org/abs/2310.07000",
    "context": "Title: CarDS-Plus ECG Platform: Development and Feasibility Evaluation of a Multiplatform Artificial Intelligence Toolkit for Portable and Wearable Device Electrocardiograms. (arXiv:2310.07000v1 [cs.LG])\nAbstract: In the rapidly evolving landscape of modern healthcare, the integration of wearable & portable technology provides a unique opportunity for personalized health monitoring in the community. Devices like the Apple Watch, FitBit, and AliveCor KardiaMobile have revolutionized the acquisition and processing of intricate health data streams. Amidst the variety of data collected by these gadgets, single-lead electrocardiogram (ECG) recordings have emerged as a crucial source of information for monitoring cardiovascular health. There has been significant advances in artificial intelligence capable of interpreting these 1-lead ECGs, facilitating clinical diagnosis as well as the detection of rare cardiac disorders. This design study describes the development of an innovative multiplatform system aimed at the rapid deployment of AI-based ECG solutions for clinical investigation & care delivery. The study examines design considerations, aligning them with specific applications, develops data flow",
    "path": "papers/23/10/2310.07000.json",
    "total_tokens": 935,
    "translated_title": "CarDS-Plus ECG平台：开发和可行性评估一个适用于便携式和可穿戴设备心电图的多平台人工智能工具包",
    "translated_abstract": "在现代医疗保健领域快速发展的环境下，将可穿戴和便携技术整合进来为个性化的健康监测提供了一个独特的机会。像Apple Watch、FitBit和AliveCor KardiaMobile这样的设备已经彻底改变了复杂健康数据流的获取和处理。在这些设备收集的各种数据中，单导联心电图（ECG）记录已经成为监测心血管健康的重要信息来源。人工智能在解读这些单导联心电图方面取得了显著进展，有助于临床诊断和罕见心脏疾病的检测。这项设计研究描述了一个创新的多平台系统的开发，旨在快速部署基于人工智能的心电图解决方案用于临床调查和医疗服务交付。该研究探讨了设计考虑因素，并将其与特定应用相一致，开发了数据流",
    "tldr": "该论文描述了CarDS-Plus ECG平台的开发，该平台是一个创新的多平台系统，旨在快速部署基于人工智能的心电图解决方案用于临床调查和医疗服务交付。",
    "en_tdlr": "This paper describes the development of the CarDS-Plus ECG platform, an innovative multiplatform system aimed at the rapid deployment of AI-based ECG solutions for clinical investigation and care delivery."
}