{
    "title": "Optimal Scoring for Dynamic Information Acquisition. (arXiv:2310.19147v1 [econ.TH])",
    "abstract": "A principal seeks to learn about a binary state and can do so by enlisting an agent to acquire information over time using a Poisson information arrival technology. The agent learns about this state privately, and his effort choices are unobserved by the principal. The principal can reward the agent with a prize of fixed value as a function of the agent's sequence of reports and the realized state. We identify conditions that each individually ensure that the principal cannot do better than by eliciting a single report from the agent after all information has been acquired. We also show that such a static contract is suboptimal under sufficiently strong violations of these conditions. We contrast our solution to the case where the agent acquires information \"all at once;\" notably, the optimal contract in the dynamic environment may provide strictly positive base rewards to the agent even if his prediction about the state is incorrect.",
    "link": "http://arxiv.org/abs/2310.19147",
    "context": "Title: Optimal Scoring for Dynamic Information Acquisition. (arXiv:2310.19147v1 [econ.TH])\nAbstract: A principal seeks to learn about a binary state and can do so by enlisting an agent to acquire information over time using a Poisson information arrival technology. The agent learns about this state privately, and his effort choices are unobserved by the principal. The principal can reward the agent with a prize of fixed value as a function of the agent's sequence of reports and the realized state. We identify conditions that each individually ensure that the principal cannot do better than by eliciting a single report from the agent after all information has been acquired. We also show that such a static contract is suboptimal under sufficiently strong violations of these conditions. We contrast our solution to the case where the agent acquires information \"all at once;\" notably, the optimal contract in the dynamic environment may provide strictly positive base rewards to the agent even if his prediction about the state is incorrect.",
    "path": "papers/23/10/2310.19147.json",
    "total_tokens": 978,
    "translated_title": "动态信息获取的最佳评分",
    "translated_abstract": "一个委托人试图通过雇佣一个代理人来使用泊松信息到达技术随着时间来获取关于二进制状态的信息。代理人会私下了解这个状态，而委托人无法观察到代理人的努力选择。委托人可以根据代理人的报告序列和实现的状态，以一个固定价值的奖品来奖励代理人。我们确定了一些条件，每个条件都确保委托人无法比在获取了所有信息后从代理人那里提取单个报告更好。我们还证明了在这些条件足够强烈的违反下，这样的静态合同是次优的。我们将我们的解决方案与代理人一次性获取所有信息的情况进行对比；值得注意的是，在动态环境中，即使代理人对状态的预测是错误的，最优合同可能会向代理人提供严格正的基本奖励。",
    "tldr": "这篇论文研究了一个委托人通过雇佣代理人以动态方式获取信息的问题，在条件允许的情况下，委托人无法通过一次性收集所有信息之后再从代理人那里获取单个报告来获得更好的结果，并且在较强的条件违反下，静态合同是次优的。与此同时，该论文还展示了在动态环境中，即使代理人对状态预测错误，最优合同也可能会给予代理人严格正的基本奖励。",
    "en_tdlr": "This paper investigates the problem of a principal acquiring information dynamically by hiring an agent, and shows that the principal cannot do better by eliciting a single report from the agent after all information has been acquired, and under strong violations of certain conditions, a static contract is suboptimal. The paper also demonstrates that in a dynamic environment, the optimal contract may provide strictly positive base rewards to the agent even if his prediction about the state is incorrect."
}