{
    "title": "End-to-end Story Plot Generator. (arXiv:2310.08796v1 [cs.CL])",
    "abstract": "Story plots, while short, carry most of the essential information of a full story that may contain tens of thousands of words. We study the problem of automatic generation of story plots, which includes story premise, character descriptions, plot outlines, etc. To generate a single engaging plot, existing plot generators (e.g., DOC (Yang et al., 2022a)) require hundreds to thousands of calls to LLMs (e.g., OpenAI API) in the planning stage of the story plot, which is costly and takes at least several minutes. Moreover, the hard-wired nature of the method makes the pipeline non-differentiable, blocking fast specialization and personalization of the plot generator. In this paper, we propose three models, $\\texttt{OpenPlot}$, $\\texttt{E2EPlot}$ and $\\texttt{RLPlot}$, to address these challenges. $\\texttt{OpenPlot}$ replaces expensive OpenAI API calls with LLaMA2 (Touvron et al., 2023) calls via careful prompt designs, which leads to inexpensive generation of high-quality training datasets",
    "link": "http://arxiv.org/abs/2310.08796",
    "context": "Title: End-to-end Story Plot Generator. (arXiv:2310.08796v1 [cs.CL])\nAbstract: Story plots, while short, carry most of the essential information of a full story that may contain tens of thousands of words. We study the problem of automatic generation of story plots, which includes story premise, character descriptions, plot outlines, etc. To generate a single engaging plot, existing plot generators (e.g., DOC (Yang et al., 2022a)) require hundreds to thousands of calls to LLMs (e.g., OpenAI API) in the planning stage of the story plot, which is costly and takes at least several minutes. Moreover, the hard-wired nature of the method makes the pipeline non-differentiable, blocking fast specialization and personalization of the plot generator. In this paper, we propose three models, $\\texttt{OpenPlot}$, $\\texttt{E2EPlot}$ and $\\texttt{RLPlot}$, to address these challenges. $\\texttt{OpenPlot}$ replaces expensive OpenAI API calls with LLaMA2 (Touvron et al., 2023) calls via careful prompt designs, which leads to inexpensive generation of high-quality training datasets",
    "path": "papers/23/10/2310.08796.json",
    "total_tokens": 866,
    "translated_title": "全流程故事情节生成器",
    "translated_abstract": "故事情节虽短，但包含了一个完整故事中大部分关键信息，它可能包含数万字的内容。本文研究自动生成故事情节的问题，包括故事前提、角色描述、情节大纲等。现有的情节生成器（如 DOC (Yang et al., 2022a)）在故事情节的规划阶段需要数百到数千次LLM（如OpenAI API）的调用，这既耗时又昂贵，至少需要几分钟。此外，这种方法的硬编码特性使得流程不可微分，阻碍了快速定制和个性化的情节生成器的发展。本文提出了三个模型：OpenPlot、E2EPlot和RLPlot，以应对这些挑战。OpenPlot通过精心设计的提示将昂贵的OpenAI API调用替换为使用LLaMA2 (Touvron et al., 2023)调用，从而以低成本生成高质量的训练数据集。",
    "tldr": "这款全流程故事情节生成器通过优化模型和设计提示信息，以替代昂贵的API调用，实现了低成本生成高质量训练数据集。",
    "en_tdlr": "This end-to-end story plot generator replaces expensive API calls with optimized models and designed prompts, achieving low-cost generation of high-quality training datasets."
}