{
    "title": "Fully Spiking Neural Network for Legged Robots",
    "abstract": "arXiv:2310.05022v2 Announce Type: replace-cross  Abstract: In recent years, legged robots based on deep reinforcement learning have made remarkable progress. Quadruped robots have demonstrated the ability to complete challenging tasks in complex environments and have been deployed in real-world scenarios to assist humans. Simultaneously, bipedal and humanoid robots have achieved breakthroughs in various demanding tasks. Current reinforcement learning methods can utilize diverse robot bodies and historical information to perform actions. However, prior research has not emphasized the speed and energy consumption of network inference, as well as the biological significance of the neural networks themselves. Most of the networks employed are traditional artificial neural networks that utilize multilayer perceptrons (MLP). In this paper, we successfully apply a novel Spiking Neural Network (SNN) to process legged robots, achieving outstanding results across a range of simulated terrains. S",
    "link": "https://arxiv.org/abs/2310.05022",
    "context": "Title: Fully Spiking Neural Network for Legged Robots\nAbstract: arXiv:2310.05022v2 Announce Type: replace-cross  Abstract: In recent years, legged robots based on deep reinforcement learning have made remarkable progress. Quadruped robots have demonstrated the ability to complete challenging tasks in complex environments and have been deployed in real-world scenarios to assist humans. Simultaneously, bipedal and humanoid robots have achieved breakthroughs in various demanding tasks. Current reinforcement learning methods can utilize diverse robot bodies and historical information to perform actions. However, prior research has not emphasized the speed and energy consumption of network inference, as well as the biological significance of the neural networks themselves. Most of the networks employed are traditional artificial neural networks that utilize multilayer perceptrons (MLP). In this paper, we successfully apply a novel Spiking Neural Network (SNN) to process legged robots, achieving outstanding results across a range of simulated terrains. S",
    "path": "papers/23/10/2310.05022.json",
    "total_tokens": 697,
    "translated_title": "用于腿式机器人的全脉冲神经网络",
    "translated_abstract": "近年来，基于深度强化学习的腿式机器人取得了显著进展。四足机器人展示了在复杂环境中完成具有挑战性任务的能力，并已部署在现实场景中以协助人类。同时，两足和类人机器人在各种高难度任务中取得了突破。本研究成功将一种新型脉冲神经网络（SNN）应用于处理腿式机器人，在一系列模拟地形中取得了出色的结果。",
    "tldr": "本文将新型全脉冲神经网络（SNN）成功应用于处理腿式机器人，在各种模拟地形中取得了杰出结果。",
    "en_tdlr": "This paper successfully applies a novel Spiking Neural Network (SNN) to process legged robots, achieving outstanding results across a range of simulated terrains."
}