{
    "title": "Impedance Leakage Vulnerability and its Utilization in Reverse-engineering Embedded Software. (arXiv:2310.03175v1 [cs.CR])",
    "abstract": "Discovering new vulnerabilities and implementing security and privacy measures are important to protect systems and data against physical attacks. One such vulnerability is impedance, an inherent property of a device that can be exploited to leak information through an unintended side channel, thereby posing significant security and privacy risks. Unlike traditional vulnerabilities, impedance is often overlooked or narrowly explored, as it is typically treated as a fixed value at a specific frequency in research and design endeavors. Moreover, impedance has never been explored as a source of information leakage. This paper demonstrates that the impedance of an embedded device is not constant and directly relates to the programs executed on the device. We define this phenomenon as impedance leakage and use this as a side channel to extract software instructions from protected memory. Our experiment on the ATmega328P microcontroller and the Artix 7 FPGA indicates that the impedance side ",
    "link": "http://arxiv.org/abs/2310.03175",
    "context": "Title: Impedance Leakage Vulnerability and its Utilization in Reverse-engineering Embedded Software. (arXiv:2310.03175v1 [cs.CR])\nAbstract: Discovering new vulnerabilities and implementing security and privacy measures are important to protect systems and data against physical attacks. One such vulnerability is impedance, an inherent property of a device that can be exploited to leak information through an unintended side channel, thereby posing significant security and privacy risks. Unlike traditional vulnerabilities, impedance is often overlooked or narrowly explored, as it is typically treated as a fixed value at a specific frequency in research and design endeavors. Moreover, impedance has never been explored as a source of information leakage. This paper demonstrates that the impedance of an embedded device is not constant and directly relates to the programs executed on the device. We define this phenomenon as impedance leakage and use this as a side channel to extract software instructions from protected memory. Our experiment on the ATmega328P microcontroller and the Artix 7 FPGA indicates that the impedance side ",
    "path": "papers/23/10/2310.03175.json",
    "total_tokens": 844,
    "translated_title": "阻抗泄漏脆弱性及其在逆向工程嵌入式软件中的利用",
    "translated_abstract": "发现新的漏洞和实施安全和隐私措施对于保护系统和数据免受物理攻击至关重要。其中一种漏洞是阻抗，一种设备的固有属性，可以通过意外的侧信道泄露信息，从而带来严重的安全和隐私风险。与传统的漏洞不同，阻抗通常被忽视或仅在研究和设计中以特定频率的固定值来处理。此外，阻抗从未被探索过作为信息泄漏的源头。本文证明了嵌入式设备的阻抗并非恒定，并直接与设备上执行的程序相关。我们将此现象定义为阻抗泄漏，并将其作为一种侧信道从受保护的内存中提取软件指令。我们在ATmega328P微控制器和Artix 7 FPGA上的实验表明，阻抗侧信道",
    "tldr": "这项研究发现了一种新的安全漏洞——阻抗泄漏，通过利用该漏洞可以从嵌入式设备中提取受保护内存中的软件指令。",
    "en_tdlr": "This paper uncovers a novel security vulnerability, impedance leakage, which allows for extracting software instructions from protected memory in embedded devices."
}