{
    "title": "OptiMUS: Optimization Modeling Using mip Solvers and large language models. (arXiv:2310.06116v1 [cs.AI])",
    "abstract": "Optimization problems are pervasive across various sectors, from manufacturing and distribution to healthcare. However, most such problems are still solved heuristically by hand rather than optimally by state-of-the-art solvers, as the expertise required to formulate and solve these problems limits the widespread adoption of optimization tools and techniques. We introduce OptiMUS, a Large Language Model (LLM)-based agent designed to formulate and solve MILP problems from their natural language descriptions. OptiMUS is capable of developing mathematical models, writing and debugging solver code, developing tests, and checking the validity of generated solutions. To benchmark our agent, we present NLP4LP, a novel dataset of linear programming (LP) and mixed integer linear programming (MILP) problems. Our experiments demonstrate that OptiMUS is able to solve 67\\% more problems compared to a basic LLM prompting strategy. OptiMUS code and NLP4LP dataset are available at \\href{https://github",
    "link": "http://arxiv.org/abs/2310.06116",
    "context": "Title: OptiMUS: Optimization Modeling Using mip Solvers and large language models. (arXiv:2310.06116v1 [cs.AI])\nAbstract: Optimization problems are pervasive across various sectors, from manufacturing and distribution to healthcare. However, most such problems are still solved heuristically by hand rather than optimally by state-of-the-art solvers, as the expertise required to formulate and solve these problems limits the widespread adoption of optimization tools and techniques. We introduce OptiMUS, a Large Language Model (LLM)-based agent designed to formulate and solve MILP problems from their natural language descriptions. OptiMUS is capable of developing mathematical models, writing and debugging solver code, developing tests, and checking the validity of generated solutions. To benchmark our agent, we present NLP4LP, a novel dataset of linear programming (LP) and mixed integer linear programming (MILP) problems. Our experiments demonstrate that OptiMUS is able to solve 67\\% more problems compared to a basic LLM prompting strategy. OptiMUS code and NLP4LP dataset are available at \\href{https://github",
    "path": "papers/23/10/2310.06116.json",
    "total_tokens": 923,
    "translated_title": "OptiMUS: 使用mip求解器和大规模语言模型的优化建模",
    "translated_abstract": "优化问题在各个领域中普遍存在，从制造和分销到医疗保健。然而，大多数这类问题仍然是通过手工启发式解决而不是通过最先进的求解器进行最优解，因为制定和解决这些问题所需的专业知识限制了优化工具和技术的广泛应用。我们介绍了OptiMUS，一种基于大规模语言模型(LLM)的代理，旨在从自然语言描述中制定和解决MILP问题。OptiMUS能够开发数学模型，编写和调试求解器代码，开发测试，并检查生成解的有效性。为了对我们的代理进行基准测试，我们提供了NLP4LP，这是一个线性规划(LP)和混合整数线性规划(MILP)问题的新数据集。我们的实验表明，与基本的LLM提示策略相比，OptiMUS能够解决更多问题，解决率提高了67％。OptiMUS的代码和NLP4LP数据集可在\\href{https://github中获得.",
    "tldr": "介绍了OptiMUS，一种基于大规模语言模型的优化建模代理，用于解决MILP问题。该代理能够自动生成数学模型、编写和调试求解器代码，并具有较高的解决率。"
}