{
    "title": "Fire Detection From Image and Video Using YOLOv5. (arXiv:2310.06351v1 [cs.CV])",
    "abstract": "For the detection of fire-like targets in indoor, outdoor and forest fire images, as well as fire detection under different natural lights, an improved YOLOv5 fire detection deep learning algorithm is proposed. The YOLOv5 detection model expands the feature extraction network from three dimensions, which enhances feature propagation of fire small targets identification, improves network performance, and reduces model parameters. Furthermore, through the promotion of the feature pyramid, the top-performing prediction box is obtained. Fire-YOLOv5 attains excellent results compared to state-of-the-art object detection networks, notably in the detection of small targets of fire and smoke with mAP 90.5% and f1 score 88%. Overall, the Fire-YOLOv5 detection model can effectively deal with the inspection of small fire targets, as well as fire-like and smoke-like objects with F1 score 0.88. When the input image size is 416 x 416 resolution, the average detection time is 0.12 s per frame, which ",
    "link": "http://arxiv.org/abs/2310.06351",
    "context": "Title: Fire Detection From Image and Video Using YOLOv5. (arXiv:2310.06351v1 [cs.CV])\nAbstract: For the detection of fire-like targets in indoor, outdoor and forest fire images, as well as fire detection under different natural lights, an improved YOLOv5 fire detection deep learning algorithm is proposed. The YOLOv5 detection model expands the feature extraction network from three dimensions, which enhances feature propagation of fire small targets identification, improves network performance, and reduces model parameters. Furthermore, through the promotion of the feature pyramid, the top-performing prediction box is obtained. Fire-YOLOv5 attains excellent results compared to state-of-the-art object detection networks, notably in the detection of small targets of fire and smoke with mAP 90.5% and f1 score 88%. Overall, the Fire-YOLOv5 detection model can effectively deal with the inspection of small fire targets, as well as fire-like and smoke-like objects with F1 score 0.88. When the input image size is 416 x 416 resolution, the average detection time is 0.12 s per frame, which ",
    "path": "papers/23/10/2310.06351.json",
    "total_tokens": 914,
    "translated_title": "使用YOLOv5从图像和视频中检测火灾",
    "translated_abstract": "为了在室内、室外和森林火灾图像中检测火灾目标以及在不同自然光下进行火灾检测，提出了一种改进的YOLOv5火灾检测深度学习算法。YOLOv5检测模型将特征提取网络从三维扩展到了四维，增强了火灾小目标识别的特征传播，改善了网络性能并减少了模型参数。此外，通过提升特征金字塔，得到了表现最佳的预测框。Fire-YOLOv5相比其他优秀的目标检测网络在火灾和烟雾小目标的检测中取得了出色的结果，mAP为90.5%，f1得分为88%。总的来说，Fire-YOLOv5检测模型可以有效处理小火灾目标的检测，以及类似火灾和烟雾的物体，f1得分为0.88。当输入图像大小为416 x 416分辨率时，平均检测时间为每帧0.12秒，这是非常快速的。",
    "tldr": "使用改进的YOLOv5算法实现火灾图像和视频的检测，准确率高，能有效处理小火灾目标的检测和类似火灾和烟雾的物体。",
    "en_tdlr": "Fire detection from images and videos is achieved using an improved YOLOv5 algorithm, with high accuracy and the ability to effectively detect small fire targets and fire-like and smoke-like objects."
}