{
    "title": "Is ChatGPT a Financial Expert? Evaluating Language Models on Financial Natural Language Processing. (arXiv:2310.12664v1 [cs.CL])",
    "abstract": "The emergence of Large Language Models (LLMs), such as ChatGPT, has revolutionized general natural language preprocessing (NLP) tasks. However, their expertise in the financial domain lacks a comprehensive evaluation. To assess the ability of LLMs to solve financial NLP tasks, we present FinLMEval, a framework for Financial Language Model Evaluation, comprising nine datasets designed to evaluate the performance of language models. This study compares the performance of encoder-only language models and the decoder-only language models. Our findings reveal that while some decoder-only LLMs demonstrate notable performance across most financial tasks via zero-shot prompting, they generally lag behind the fine-tuned expert models, especially when dealing with proprietary datasets. We hope this study provides foundation evaluations for continuing efforts to build more advanced LLMs in the financial domain.",
    "link": "http://arxiv.org/abs/2310.12664",
    "context": "Title: Is ChatGPT a Financial Expert? Evaluating Language Models on Financial Natural Language Processing. (arXiv:2310.12664v1 [cs.CL])\nAbstract: The emergence of Large Language Models (LLMs), such as ChatGPT, has revolutionized general natural language preprocessing (NLP) tasks. However, their expertise in the financial domain lacks a comprehensive evaluation. To assess the ability of LLMs to solve financial NLP tasks, we present FinLMEval, a framework for Financial Language Model Evaluation, comprising nine datasets designed to evaluate the performance of language models. This study compares the performance of encoder-only language models and the decoder-only language models. Our findings reveal that while some decoder-only LLMs demonstrate notable performance across most financial tasks via zero-shot prompting, they generally lag behind the fine-tuned expert models, especially when dealing with proprietary datasets. We hope this study provides foundation evaluations for continuing efforts to build more advanced LLMs in the financial domain.",
    "path": "papers/23/10/2310.12664.json",
    "total_tokens": 920,
    "translated_title": "ChatGPT是金融专家吗？对金融自然语言处理中的语言模型进行评估",
    "translated_abstract": "大规模语言模型（LLM）的出现，如ChatGPT，已经彻底改变了一般自然语言处理（NLP）任务。然而，它们在金融领域的专长缺乏全面评估。为了评估LLMs解决金融NLP任务的能力，我们提出了FinLMEval，一个金融语言模型评估框架，包括九个设计用于评估语言模型性能的数据集。本研究比较了仅编码器和仅解码器语言模型的性能。我们的研究结果表明，尽管一些仅解码器的LLMs通过零样本提示在大多数金融任务中表现出了显着的性能，但它们总体上落后于经过精细调整的专业模型，特别是在处理专有数据集时。我们希望这项研究为继续努力构建更先进的金融领域LLMs提供基础评估。",
    "tldr": "本研究通过对金融自然语言处理中的语言模型进行评估，发现虽然一些解码器语言模型通过零样本提示在大多数金融任务中表现出了显着性能，但它们总体上落后于经过精细调整的专业模型，特别是在处理专有数据集时。",
    "en_tdlr": "This study evaluates language models in financial natural language processing and finds that while some decoder-only language models demonstrate notable performance across most financial tasks via zero-shot prompting, they generally lag behind fine-tuned expert models, especially when dealing with proprietary datasets."
}