{
    "title": "Cost-Effective Retraining of Machine Learning Models. (arXiv:2310.04216v1 [cs.LG])",
    "abstract": "It is important to retrain a machine learning (ML) model in order to maintain its performance as the data changes over time. However, this can be costly as it usually requires processing the entire dataset again. This creates a trade-off between retraining too frequently, which leads to unnecessary computing costs, and not retraining often enough, which results in stale and inaccurate ML models. To address this challenge, we propose ML systems that make automated and cost-effective decisions about when to retrain an ML model. We aim to optimize the trade-off by considering the costs associated with each decision. Our research focuses on determining whether to retrain or keep an existing ML model based on various factors, including the data, the model, and the predictive queries answered by the model. Our main contribution is a Cost-Aware Retraining Algorithm called Cara, which optimizes the trade-off over streams of data and queries. To evaluate the performance of Cara, we analyzed syn",
    "link": "http://arxiv.org/abs/2310.04216",
    "context": "Title: Cost-Effective Retraining of Machine Learning Models. (arXiv:2310.04216v1 [cs.LG])\nAbstract: It is important to retrain a machine learning (ML) model in order to maintain its performance as the data changes over time. However, this can be costly as it usually requires processing the entire dataset again. This creates a trade-off between retraining too frequently, which leads to unnecessary computing costs, and not retraining often enough, which results in stale and inaccurate ML models. To address this challenge, we propose ML systems that make automated and cost-effective decisions about when to retrain an ML model. We aim to optimize the trade-off by considering the costs associated with each decision. Our research focuses on determining whether to retrain or keep an existing ML model based on various factors, including the data, the model, and the predictive queries answered by the model. Our main contribution is a Cost-Aware Retraining Algorithm called Cara, which optimizes the trade-off over streams of data and queries. To evaluate the performance of Cara, we analyzed syn",
    "path": "papers/23/10/2310.04216.json",
    "total_tokens": 978,
    "translated_title": "成本效益的机器学习模型重新训练",
    "translated_abstract": "为了保持机器学习（ML）模型在数据随时间变化时的性能，有必要重新训练模型。然而，这可能是昂贵的，因为通常需要重新处理整个数据集。这导致了重新训练频率和计算成本之间的权衡，过于频繁的重新训练会导致不必要的计算成本，而不经常重新训练会导致过时和不准确的ML模型。为了解决这个挑战，我们提出了能够自动化且具有成本效益的决策何时重新训练ML模型的ML系统。我们旨在通过考虑每个决策相关的成本来优化这个权衡。我们的研究重点是基于数据、模型和模型回答的预测查询等不同因素来确定是否重新训练或保留现有的ML模型。我们的主要贡献是一种名为Cara的成本感知重新训练算法，它通过对数据流和查询进行优化来优化这种权衡。为了评估Cara的性能，我们分析了合成的数据集和实际应用数据集上的实验。",
    "tldr": "提出了一种成本效益的机器学习模型重新训练方法，通过考虑成本和数据、模型及预测查询等因素来自动化决策何时重新训练。主要贡献是成本感知重新训练算法Cara，通过对数据流和查询进行优化来实现最佳权衡。"
}