{
    "title": "EAG-RS: A Novel Explainability-guided ROI-Selection Framework for ASD Diagnosis via Inter-regional Relation Learning. (arXiv:2310.03404v1 [cs.LG])",
    "abstract": "Deep learning models based on resting-state functional magnetic resonance imaging (rs-fMRI) have been widely used to diagnose brain diseases, particularly autism spectrum disorder (ASD). Existing studies have leveraged the functional connectivity (FC) of rs-fMRI, achieving notable classification performance. However, they have significant limitations, including the lack of adequate information while using linear low-order FC as inputs to the model, not considering individual characteristics (i.e., different symptoms or varying stages of severity) among patients with ASD, and the non-explainability of the decision process. To cover these limitations, we propose a novel explainability-guided region of interest (ROI) selection (EAG-RS) framework that identifies non-linear high-order functional associations among brain regions by leveraging an explainable artificial intelligence technique and selects class-discriminative regions for brain disease identification. The proposed framework incl",
    "link": "http://arxiv.org/abs/2310.03404",
    "context": "Title: EAG-RS: A Novel Explainability-guided ROI-Selection Framework for ASD Diagnosis via Inter-regional Relation Learning. (arXiv:2310.03404v1 [cs.LG])\nAbstract: Deep learning models based on resting-state functional magnetic resonance imaging (rs-fMRI) have been widely used to diagnose brain diseases, particularly autism spectrum disorder (ASD). Existing studies have leveraged the functional connectivity (FC) of rs-fMRI, achieving notable classification performance. However, they have significant limitations, including the lack of adequate information while using linear low-order FC as inputs to the model, not considering individual characteristics (i.e., different symptoms or varying stages of severity) among patients with ASD, and the non-explainability of the decision process. To cover these limitations, we propose a novel explainability-guided region of interest (ROI) selection (EAG-RS) framework that identifies non-linear high-order functional associations among brain regions by leveraging an explainable artificial intelligence technique and selects class-discriminative regions for brain disease identification. The proposed framework incl",
    "path": "papers/23/10/2310.03404.json",
    "total_tokens": 947,
    "translated_title": "EAG-RS:一种基于解释性引导的ASD诊断的ROI选择框架的创新",
    "translated_abstract": "基于静息态功能磁共振成像（rs-fMRI）的深度学习模型已广泛应用于诊断脑部疾病，特别是自闭症谱系障碍（ASD）。现有研究利用rs-fMRI的功能连接性（FC），取得了显著的分类性能。然而，它们存在着一些重大局限，包括使用线性低阶FC作为模型输入时缺乏充分的信息，不考虑ASD患者的个体特征（即不同症状或不同严重程度的阶段），以及决策过程的非可解释性。为了弥补这些局限性，我们提出了一种新颖的解释性引导的感兴趣区（ROI）选择（EAG-RS）框架，通过利用一种可解释的人工智能技术，识别脑区之间的非线性高阶功能关联，并选择能够鉴别疾病的区域进行脑部疾病识别。",
    "tldr": "EAG-RS是一种创新的解释性引导的感兴趣区（ROI）选择框架，通过非线性高阶功能关联以及可解释的人工智能技术，实现了自闭症谱系障碍（ASD）的诊断，并解决了现有研究中的一些局限性。",
    "en_tdlr": "EAG-RS is an innovative explainability-guided region of interest (ROI) selection framework that utilizes non-linear high-order functional associations and explainable artificial intelligence techniques to diagnose autism spectrum disorder (ASD), addressing the limitations of existing studies."
}