{
    "title": "Identification, Impacts, and Opportunities of Three Common Measurement Considerations when using Digital Trace Data. (arXiv:2310.00197v1 [cs.HC])",
    "abstract": "Cataloguing specific URLs, posts, and applications with digital traces is the new best practice for measuring media use and content consumption. Despite the apparent accuracy that comes with greater granularity, however, digital traces may introduce additional ambiguity and new errors into the measurement of media use. In this note, we identify three new measurement challenges when using Digital Trace Data that were recently uncovered using a new measurement framework - Screenomics - that records media use at the granularity of individual screenshots obtained every few seconds as people interact with mobile devices. We label the considerations as follows: (1) entangling - the common measurement error introduced by proxying exposure to content by exposure to format; (2) flattening - aggregating unique segments of media interaction without incorporating temporal information, most commonly intraindividually and (3) bundling - summation of the durations of segments of media interaction, in",
    "link": "http://arxiv.org/abs/2310.00197",
    "context": "Title: Identification, Impacts, and Opportunities of Three Common Measurement Considerations when using Digital Trace Data. (arXiv:2310.00197v1 [cs.HC])\nAbstract: Cataloguing specific URLs, posts, and applications with digital traces is the new best practice for measuring media use and content consumption. Despite the apparent accuracy that comes with greater granularity, however, digital traces may introduce additional ambiguity and new errors into the measurement of media use. In this note, we identify three new measurement challenges when using Digital Trace Data that were recently uncovered using a new measurement framework - Screenomics - that records media use at the granularity of individual screenshots obtained every few seconds as people interact with mobile devices. We label the considerations as follows: (1) entangling - the common measurement error introduced by proxying exposure to content by exposure to format; (2) flattening - aggregating unique segments of media interaction without incorporating temporal information, most commonly intraindividually and (3) bundling - summation of the durations of segments of media interaction, in",
    "path": "papers/23/10/2310.00197.json",
    "total_tokens": 867,
    "translated_title": "三个常见的数字痕迹数据测量考虑的识别、影响和机会",
    "translated_abstract": "编目数字痕迹中的特定URL、帖子和应用程序是测量媒体使用和内容消费的最佳实践。然而，尽管更精确，数字痕迹可能会引入额外的不确定性和新的测量错误。在本研究中，我们使用一种新的测量框架—Screenomics，记录个体与移动设备交互时每隔几秒钟的屏幕截图来挖掘使用数字痕迹数据时的三个新的测量挑战。我们将这些考虑标记为：（1）纠缠-通过替代内容曝光来测量格式曝光的常见错误；（2）平坦化-聚合媒体互动的独特片段而不包含时间信息，最常见的是在个体内部；（3）捆绑-对媒体互动片段的持续时间进行求和。",
    "tldr": "通过使用数字痕迹数据，我们发现了三个测量挑战：纠缠、平坦化和捆绑。这些挑战会引入额外的不确定性和错误，但也提供了深入了解媒体使用和内容消费的机会。"
}