{
    "title": "Physically Explainable Deep Learning for Convective Initiation Nowcasting Using GOES-16 Satellite Observations. (arXiv:2310.16015v1 [physics.ao-ph] CROSS LISTED)",
    "abstract": "Convection initiation (CI) nowcasting remains a challenging problem for both numerical weather prediction models and existing nowcasting algorithms. In this study, object-based probabilistic deep learning models are developed to predict CI based on multichannel infrared GOES-R satellite observations. The data come from patches surrounding potential CI events identified in Multi-Radar Multi-Sensor Doppler weather radar products over the Great Plains region from June and July 2020 and June 2021. An objective radar-based approach is used to identify these events. The deep learning models significantly outperform the classical logistic model at lead times up to 1 hour, especially on the false alarm ratio. Through case studies, the deep learning model exhibits the dependence on the characteristics of clouds and moisture at multiple levels. Model explanation further reveals the model's decision-making process with different baselines. The explanation results highlight the importance of moist",
    "link": "http://arxiv.org/abs/2310.16015",
    "context": "Title: Physically Explainable Deep Learning for Convective Initiation Nowcasting Using GOES-16 Satellite Observations. (arXiv:2310.16015v1 [physics.ao-ph] CROSS LISTED)\nAbstract: Convection initiation (CI) nowcasting remains a challenging problem for both numerical weather prediction models and existing nowcasting algorithms. In this study, object-based probabilistic deep learning models are developed to predict CI based on multichannel infrared GOES-R satellite observations. The data come from patches surrounding potential CI events identified in Multi-Radar Multi-Sensor Doppler weather radar products over the Great Plains region from June and July 2020 and June 2021. An objective radar-based approach is used to identify these events. The deep learning models significantly outperform the classical logistic model at lead times up to 1 hour, especially on the false alarm ratio. Through case studies, the deep learning model exhibits the dependence on the characteristics of clouds and moisture at multiple levels. Model explanation further reveals the model's decision-making process with different baselines. The explanation results highlight the importance of moist",
    "path": "papers/23/10/2310.16015.json",
    "total_tokens": 967,
    "translated_title": "使用GOES-16卫星观测数据的可解释性深度学习对大气对流起始进行预测",
    "translated_abstract": "大气对流起始（CI）的预测在数值天气预报模型和现有的预测算法中仍然是个具有挑战性的问题。本研究开发了基于多通道红外GOES-R卫星观测数据的基于对象的概率深度学习模型，用于预测CI。数据来自于2020年6月和7月以及2021年6月在美国大平原地区多雷达多传感器多普勒天气雷达产品中识别出的潜在CI事件周围的补丁。使用客观的基于雷达的方法来识别这些事件。深度学习模型在提前时间为1小时的情况下显著优于经典的逻辑模型，特别是在误报率上。通过案例研究，深度学习模型展示了对云层和多层次湿度特性的依赖性。模型解释进一步揭示了模型在不同基线下的决策过程。解释结果突出了湿度的重要性。",
    "tldr": "本研究开发了基于多通道红外卫星观测数据的可解释性深度学习模型，用于预测大气对流起始。通过案例研究，该模型表现出对云层和湿度特性的依赖性，并在误报率上显著优于经典的逻辑模型。",
    "en_tdlr": "This study developed an interpretable deep learning model based on multichannel infrared satellite observations to predict convective initiation (CI). Through case studies, the model exhibited a dependence on cloud and humidity characteristics and significantly outperformed classical logistic models in terms of false alarm rate."
}