{
    "title": "Optimizing Odia Braille Literacy: The Influence of Speed on Error Reduction and Enhanced Comprehension. (arXiv:2310.08280v1 [cs.CL])",
    "abstract": "This study aims to conduct an extensive detailed analysis of the Odia Braille reading comprehension among students with visual disability. Specifically, the study explores their reading speed and hand or finger movements. The study also aims to investigate any comprehension difficulties and reading errors they may encounter. Six students from the 9th and 10th grades, aged between 14 and 16, participated in the study. We observed participants hand movements to understand how reading errors were connected to hand movement and identify the students reading difficulties. We also evaluated the participants Odia Braille reading skills, including their reading speed (in words per minute), errors, and comprehension. The average speed of Odia Braille reader is 17.64wpm. According to the study, there was a noticeable correlation between reading speed and reading errors. As reading speed decreased, the number of reading errors tended to increase. Moreover, the study established a link between red",
    "link": "http://arxiv.org/abs/2310.08280",
    "context": "Title: Optimizing Odia Braille Literacy: The Influence of Speed on Error Reduction and Enhanced Comprehension. (arXiv:2310.08280v1 [cs.CL])\nAbstract: This study aims to conduct an extensive detailed analysis of the Odia Braille reading comprehension among students with visual disability. Specifically, the study explores their reading speed and hand or finger movements. The study also aims to investigate any comprehension difficulties and reading errors they may encounter. Six students from the 9th and 10th grades, aged between 14 and 16, participated in the study. We observed participants hand movements to understand how reading errors were connected to hand movement and identify the students reading difficulties. We also evaluated the participants Odia Braille reading skills, including their reading speed (in words per minute), errors, and comprehension. The average speed of Odia Braille reader is 17.64wpm. According to the study, there was a noticeable correlation between reading speed and reading errors. As reading speed decreased, the number of reading errors tended to increase. Moreover, the study established a link between red",
    "path": "papers/23/10/2310.08280.json",
    "total_tokens": 898,
    "translated_title": "优化Odia盲文识字：速度对错误减少和提高理解力的影响",
    "translated_abstract": "本研究旨在对视障学生的Odia盲文阅读理解进行深入详细的分析。具体而言，研究探讨了他们的阅读速度和手指运动。研究还旨在调查他们可能遇到的理解困难和阅读错误。研究对象为来自9年级和10年级的六名年龄在14至16岁之间的学生。我们观察了参与者的手指运动，以了解阅读错误与手指运动的联系，并确定学生的阅读困难。我们还评估了参与者的Odia盲文阅读能力，包括他们的阅读速度（每分钟词数）、错误和理解力。Odia盲文读者的平均速度为17.64词/分钟。根据本研究，阅读速度与阅读错误之间存在明显的相关性。随着阅读速度的降低，阅读错误的数量往往会增加。此外，本研究还建立了阅读速度和理解力之间的联系。",
    "tldr": "本研究深入研究了视障学生的Odia盲文阅读理解情况，发现阅读速度与阅读错误之间存在明显的相关性。",
    "en_tdlr": "This study conducted a detailed analysis of Odia Braille reading comprehension among students with visual disability, revealing a noticeable correlation between reading speed and reading errors."
}