{
    "title": "UniTime: A Language-Empowered Unified Model for Cross-Domain Time Series Forecasting",
    "abstract": "arXiv:2310.09751v3 Announce Type: replace  Abstract: Multivariate time series forecasting plays a pivotal role in contemporary web technologies. In contrast to conventional methods that involve creating dedicated models for specific time series application domains, this research advocates for a unified model paradigm that transcends domain boundaries. However, learning an effective cross-domain model presents the following challenges. First, various domains exhibit disparities in data characteristics, e.g., the number of variables, posing hurdles for existing models that impose inflexible constraints on these factors. Second, the model may encounter difficulties in distinguishing data from various domains, leading to suboptimal performance in our assessments. Third, the diverse convergence rates of time series domains can also result in compromised empirical performance. To address these issues, we propose UniTime for effective cross-domain time series learning. Concretely, UniTime can",
    "link": "https://arxiv.org/abs/2310.09751",
    "context": "Title: UniTime: A Language-Empowered Unified Model for Cross-Domain Time Series Forecasting\nAbstract: arXiv:2310.09751v3 Announce Type: replace  Abstract: Multivariate time series forecasting plays a pivotal role in contemporary web technologies. In contrast to conventional methods that involve creating dedicated models for specific time series application domains, this research advocates for a unified model paradigm that transcends domain boundaries. However, learning an effective cross-domain model presents the following challenges. First, various domains exhibit disparities in data characteristics, e.g., the number of variables, posing hurdles for existing models that impose inflexible constraints on these factors. Second, the model may encounter difficulties in distinguishing data from various domains, leading to suboptimal performance in our assessments. Third, the diverse convergence rates of time series domains can also result in compromised empirical performance. To address these issues, we propose UniTime for effective cross-domain time series learning. Concretely, UniTime can",
    "path": "papers/23/10/2310.09751.json",
    "total_tokens": 836,
    "translated_title": "UniTime：一种语言增强的跨领域时间序列预测统一模型",
    "translated_abstract": "多元时间序列预测在当代网络技术中起着至关重要的作用。与为特定时间序列应用领域创建专用模型的传统方法不同，本研究倡导跨越领域边界的统一模型范式。然而，学习一个有效的跨领域模型面临以下挑战。首先，不同领域在数据特征上存在差异，例如变量数量，这给现有模型带来了困难，因为这些因素上强加了不灵活的约束。其次，模型可能在区分来自不同领域的数据时遇到困难，导致在我们的评估中表现不佳。第三，时间序列领域的不同收敛速度也可能导致实证性能受损。为解决这些问题，我们提出了UniTime，用于有效的跨领域时间序列学习。具体而言，UniTime可以",
    "tldr": "UniTime提出了一种语言增强的跨领域时间序列预测统一模型，旨在应对数据特征差异、数据区分困难和收敛速度不同等挑战",
    "en_tdlr": "UniTime proposes a language-empowered unified model for cross-domain time series forecasting to tackle challenges including disparities in data characteristics, difficulties in data differentiation, and diverse convergence rates."
}