{
    "title": "Fake News in Sheep's Clothing: Robust Fake News Detection Against LLM-Empowered Style Attacks. (arXiv:2310.10830v1 [cs.CL])",
    "abstract": "It is commonly perceived that online fake news and reliable news exhibit stark differences in writing styles, such as the use of sensationalist versus objective language. However, we emphasize that style-related features can also be exploited for style-based attacks. Notably, the rise of powerful Large Language Models (LLMs) has enabled malicious users to mimic the style of trustworthy news outlets at minimal cost. Our analysis reveals that LLM-camouflaged fake news content leads to substantial performance degradation of state-of-the-art text-based detectors (up to 38% decrease in F1 Score), posing a significant challenge for automated detection in online ecosystems. To address this, we introduce SheepDog, a style-agnostic fake news detector robust to news writing styles. SheepDog achieves this adaptability through LLM-empowered news reframing, which customizes each article to match different writing styles using style-oriented reframing prompts. By employing style-agnostic training, S",
    "link": "http://arxiv.org/abs/2310.10830",
    "context": "Title: Fake News in Sheep's Clothing: Robust Fake News Detection Against LLM-Empowered Style Attacks. (arXiv:2310.10830v1 [cs.CL])\nAbstract: It is commonly perceived that online fake news and reliable news exhibit stark differences in writing styles, such as the use of sensationalist versus objective language. However, we emphasize that style-related features can also be exploited for style-based attacks. Notably, the rise of powerful Large Language Models (LLMs) has enabled malicious users to mimic the style of trustworthy news outlets at minimal cost. Our analysis reveals that LLM-camouflaged fake news content leads to substantial performance degradation of state-of-the-art text-based detectors (up to 38% decrease in F1 Score), posing a significant challenge for automated detection in online ecosystems. To address this, we introduce SheepDog, a style-agnostic fake news detector robust to news writing styles. SheepDog achieves this adaptability through LLM-empowered news reframing, which customizes each article to match different writing styles using style-oriented reframing prompts. By employing style-agnostic training, S",
    "path": "papers/23/10/2310.10830.json",
    "total_tokens": 1027,
    "translated_title": "假新闻在绵羊的外衣中：对抗LLM增强风格攻击的鲁棒假新闻检测",
    "translated_abstract": "人们常常认为在线假新闻和可靠新闻在写作风格上有明显的差异，如使用耸人听闻的语言与客观的语言。然而，我们强调风格相关特征也可以用于风格攻击。值得注意的是，强大的大型语言模型（LLM）的崛起使恶意用户能够以最低成本模仿值得信赖的新闻媒体的风格。我们的分析显示，以LLM伪装的假新闻内容导致先进的基于文本的检测器的性能显著下降（F1分数减少高达38%），给在线生态系统中的自动检测带来了重大挑战。为了解决这个问题，我们引入了SheepDog，一种对新闻写作风格鲁棒的无风格假新闻检测器。SheepDog通过LLM增强的新闻重构实现了这种适应性，通过风格导向的重构提示来定制每篇文章以适应不同的写作风格。通过采用无风格训练，SheepDog可以在不同风格的新闻中检测假新闻。",
    "tldr": "这篇论文介绍了一种鲁棒的无风格假新闻检测器，能够对抗利用大型语言模型进行风格攻击的假新闻。通过LLM增强的新闻重构，该检测器能够适应不同的写作风格，提高了对伪装假新闻的检测能力。",
    "en_tdlr": "This paper introduces a robust style-agnostic fake news detector that can counter style attacks using large language models. Through LLM-empowered news reframing, the detector is able to adapt to different writing styles, improving its ability to detect camouflage in fake news."
}