{
    "title": "In Search of Lost Online Test-time Adaptation: A Survey. (arXiv:2310.20199v1 [cs.AI])",
    "abstract": "In this paper, we present a comprehensive survey on online test-time adaptation (OTTA), a paradigm focused on adapting machine learning models to novel data distributions upon batch arrival. Despite the proliferation of OTTA methods recently, the field is mired in issues like ambiguous settings, antiquated backbones, and inconsistent hyperparameter tuning, obfuscating the real challenges and making reproducibility elusive. For clarity and a rigorous comparison, we classify OTTA techniques into three primary categories and subject them to benchmarks using the potent Vision Transformer (ViT) backbone to discover genuinely effective strategies. Our benchmarks span not only conventional corrupted datasets such as CIFAR-10/100-C and ImageNet-C but also real-world shifts embodied in CIFAR-10.1 and CIFAR-10-Warehouse, encapsulating variations across search engines and synthesized data by diffusion models. To gauge efficiency in online scenarios, we introduce novel evaluation metrics, inclusiv",
    "link": "http://arxiv.org/abs/2310.20199",
    "context": "Title: In Search of Lost Online Test-time Adaptation: A Survey. (arXiv:2310.20199v1 [cs.AI])\nAbstract: In this paper, we present a comprehensive survey on online test-time adaptation (OTTA), a paradigm focused on adapting machine learning models to novel data distributions upon batch arrival. Despite the proliferation of OTTA methods recently, the field is mired in issues like ambiguous settings, antiquated backbones, and inconsistent hyperparameter tuning, obfuscating the real challenges and making reproducibility elusive. For clarity and a rigorous comparison, we classify OTTA techniques into three primary categories and subject them to benchmarks using the potent Vision Transformer (ViT) backbone to discover genuinely effective strategies. Our benchmarks span not only conventional corrupted datasets such as CIFAR-10/100-C and ImageNet-C but also real-world shifts embodied in CIFAR-10.1 and CIFAR-10-Warehouse, encapsulating variations across search engines and synthesized data by diffusion models. To gauge efficiency in online scenarios, we introduce novel evaluation metrics, inclusiv",
    "path": "papers/23/10/2310.20199.json",
    "total_tokens": 926,
    "translated_title": "追寻失落的在线测试时间适应性：一项调研",
    "translated_abstract": "本文详细调研了在线测试时间适应性（OTTA）的综合概况，该范式专注于在批量到达时将机器学习模型调整到新数据分布上。尽管最近OTTA方法的增加，但该领域存在模糊的设置、过时的骨干结构和不一致的超参数调整等问题，这使得真正的挑战变得难以复现。为了清晰和严格的比较，我们将OTTA技术分为三个主要类别，并使用功能强大的Vision Transformer（ViT）骨干架构对它们进行基准测试，以发现真正有效的策略。我们的基准测试不仅涵盖传统的受损数据集，如CIFAR-10/100-C和ImageNet-C，还包括体现在CIFAR-10.1和CIFAR-10-Warehouse中的现实世界转变，涵盖了搜索引擎的变化和扩散模型合成数据的变化。为了衡量在线场景中的效率，我们引入了新的评估指标。",
    "tldr": "本文展示了在线测试时间适应性（OTTA）的调研结果，重点研究了解决模糊设置、过时骨干结构和不一致超参数调整的挑战，并提出了有效的策略和新的评估指标。",
    "en_tdlr": "This paper presents a comprehensive survey on Online Test-time Adaptation (OTTA), focusing on addressing challenges such as ambiguous settings, antiquated backbones, and inconsistent hyperparameter tuning. It proposes effective strategies and introduces new evaluation metrics to tackle these challenges in the field."
}