{
    "title": "Knowledge Extraction and Distillation from Large-Scale Image-Text Colonoscopy Records Leveraging Large Language and Vision Models. (arXiv:2310.11173v1 [cs.CV])",
    "abstract": "The development of artificial intelligence systems for colonoscopy analysis often necessitates expert-annotated image datasets. However, limitations in dataset size and diversity impede model performance and generalisation. Image-text colonoscopy records from routine clinical practice, comprising millions of images and text reports, serve as a valuable data source, though annotating them is labour-intensive. Here we leverage recent advancements in large language and vision models and propose EndoKED, a data mining paradigm for deep knowledge extraction and distillation. EndoKED automates the transformation of raw colonoscopy records into image datasets with pixel-level annotation. We validate EndoKED using multi-centre datasets of raw colonoscopy records (~1 million images), demonstrating its superior performance in training polyp detection and segmentation models. Furthermore, the EndoKED pre-trained vision backbone enables data-efficient and generalisable learning for optical biopsy,",
    "link": "http://arxiv.org/abs/2310.11173",
    "context": "Title: Knowledge Extraction and Distillation from Large-Scale Image-Text Colonoscopy Records Leveraging Large Language and Vision Models. (arXiv:2310.11173v1 [cs.CV])\nAbstract: The development of artificial intelligence systems for colonoscopy analysis often necessitates expert-annotated image datasets. However, limitations in dataset size and diversity impede model performance and generalisation. Image-text colonoscopy records from routine clinical practice, comprising millions of images and text reports, serve as a valuable data source, though annotating them is labour-intensive. Here we leverage recent advancements in large language and vision models and propose EndoKED, a data mining paradigm for deep knowledge extraction and distillation. EndoKED automates the transformation of raw colonoscopy records into image datasets with pixel-level annotation. We validate EndoKED using multi-centre datasets of raw colonoscopy records (~1 million images), demonstrating its superior performance in training polyp detection and segmentation models. Furthermore, the EndoKED pre-trained vision backbone enables data-efficient and generalisable learning for optical biopsy,",
    "path": "papers/23/10/2310.11173.json",
    "total_tokens": 1007,
    "translated_title": "从大规模图像文本结直肠镜检查记录中提取和精简知识，利用大型语言和视觉模型",
    "translated_abstract": "为了结直肠镜分析的人工智能系统开发，通常需要专家标注的图像数据集。然而，数据集规模和多样性的限制阻碍了模型性能和泛化能力。来自例行临床实践的图像文本结直肠镜检查记录包含数百万张图像和文本报告，是宝贵的数据源，但标注它们需要耗费大量的劳动力。在这里，我们充分利用了大型语言和视觉模型的最新进展，提出了一种用于深度知识提取和精简的数据挖掘范式-EndoKED。EndoKED自动将原始结直肠镜检查记录转化为具有像素级注释的图像数据集。我们使用多中心的原始结直肠镜检查记录数据集 (~1百万张图像) 验证了EndoKED，并展示了它在训练息肉检测和分割模型方面的优越性能。此外，EndoKED预训练的视觉骨干网络实现了对光学活检的数据高效学习和泛化学习。",
    "tldr": "本论文提出了一种利用大型语言和视觉模型的数据挖掘方法——EndoKED，可以自动从大规模图像文本结直肠镜检查记录中提取和精简知识。经验证实，EndoKED在训练结直肠镜检测和分割模型方面表现出卓越的性能。"
}