{
    "title": "Time CNN and Graph Convolution Network for Epileptic Spike Detection in MEG Data. (arXiv:2310.09236v1 [cs.CV])",
    "abstract": "Magnetoencephalography (MEG) recordings of patients with epilepsy exhibit spikes, a typical biomarker of the pathology. Detecting those spikes allows accurate localization of brain regions triggering seizures. Spike detection is often performed manually. However, it is a burdensome and error prone task due to the complexity of MEG data. To address this problem, we propose a 1D temporal convolutional neural network (Time CNN) coupled with a graph convolutional network (GCN) to classify short time frames of MEG recording as containing a spike or not. Compared to other recent approaches, our models have fewer parameters to train and we propose to use a GCN to account for MEG sensors spatial relationships. Our models produce clinically relevant results and outperform deep learning-based state-of-the-art methods reaching a classification f1-score of 76.7% on a balanced dataset and of 25.5% on a realistic, highly imbalanced dataset, for the spike class.",
    "link": "http://arxiv.org/abs/2310.09236",
    "context": "Title: Time CNN and Graph Convolution Network for Epileptic Spike Detection in MEG Data. (arXiv:2310.09236v1 [cs.CV])\nAbstract: Magnetoencephalography (MEG) recordings of patients with epilepsy exhibit spikes, a typical biomarker of the pathology. Detecting those spikes allows accurate localization of brain regions triggering seizures. Spike detection is often performed manually. However, it is a burdensome and error prone task due to the complexity of MEG data. To address this problem, we propose a 1D temporal convolutional neural network (Time CNN) coupled with a graph convolutional network (GCN) to classify short time frames of MEG recording as containing a spike or not. Compared to other recent approaches, our models have fewer parameters to train and we propose to use a GCN to account for MEG sensors spatial relationships. Our models produce clinically relevant results and outperform deep learning-based state-of-the-art methods reaching a classification f1-score of 76.7% on a balanced dataset and of 25.5% on a realistic, highly imbalanced dataset, for the spike class.",
    "path": "papers/23/10/2310.09236.json",
    "total_tokens": 1026,
    "translated_title": "时间卷积神经网络和图卷积网络在MEG数据中的癫痫尖峰检测中的应用",
    "translated_abstract": "癫痫患者的脑磁图(MEG)记录显示出尖峰，这是病理学的典型生物标志。检测这些尖峰可以准确地定位引发癫痫的脑区。目前尖峰检测通常是手动完成的，但由于MEG数据的复杂性，这是一项繁重且容易出错的任务。为了解决这个问题，我们提出了一种1D时间卷积神经网络(Time CNN)结合图卷积网络(GCN)的方法，将MEG记录的短时间框架分类为包含尖峰或不包含尖峰。与其他最近的方法相比，我们的模型需要训练的参数更少，并且我们提出使用GCN来考虑MEG传感器之间的空间关系。我们的模型产生了临床相关的结果，并且在平衡数据集上达到了76.7%的分类F1分数，在现实中高度不平衡的数据集上达到了25.5%的分类F1分数，针对尖峰类别。",
    "tldr": "提出了一种使用1D时间卷积神经网络(Time CNN)和图卷积网络(GCN)的方法来检测MEG数据中的癫痫尖峰。相较于其他方法，我们的模型具有更少的参数，并且使用GCN来考虑MEG传感器的空间关系。在临床数据集和高度不平衡的数据集上，我们的模型都取得了优于深度学习方法的分类性能。"
}