{
    "title": "Is Certifying $\\ell_p$ Robustness Still Worthwhile?. (arXiv:2310.09361v1 [cs.LG])",
    "abstract": "Over the years, researchers have developed myriad attacks that exploit the ubiquity of adversarial examples, as well as defenses that aim to guard against the security vulnerabilities posed by such attacks. Of particular interest to this paper are defenses that provide provable guarantees against the class of $\\ell_p$-bounded attacks. Certified defenses have made significant progress, taking robustness certification from toy models and datasets to large-scale problems like ImageNet classification. While this is undoubtedly an interesting academic problem, as the field has matured, its impact in practice remains unclear, thus we find it useful to revisit the motivation for continuing this line of research. There are three layers to this inquiry, which we address in this paper: (1) why do we care about robustness research? (2) why do we care about the $\\ell_p$-bounded threat model? And (3) why do we care about certification as opposed to empirical defenses? In brief, we take the position",
    "link": "http://arxiv.org/abs/2310.09361",
    "context": "Title: Is Certifying $\\ell_p$ Robustness Still Worthwhile?. (arXiv:2310.09361v1 [cs.LG])\nAbstract: Over the years, researchers have developed myriad attacks that exploit the ubiquity of adversarial examples, as well as defenses that aim to guard against the security vulnerabilities posed by such attacks. Of particular interest to this paper are defenses that provide provable guarantees against the class of $\\ell_p$-bounded attacks. Certified defenses have made significant progress, taking robustness certification from toy models and datasets to large-scale problems like ImageNet classification. While this is undoubtedly an interesting academic problem, as the field has matured, its impact in practice remains unclear, thus we find it useful to revisit the motivation for continuing this line of research. There are three layers to this inquiry, which we address in this paper: (1) why do we care about robustness research? (2) why do we care about the $\\ell_p$-bounded threat model? And (3) why do we care about certification as opposed to empirical defenses? In brief, we take the position",
    "path": "papers/23/10/2310.09361.json",
    "total_tokens": 880,
    "translated_title": "是否仍然值得对$\\ell_p$的鲁棒性进行认证?",
    "translated_abstract": "多年来，研究人员开发了各种攻击方法，利用了对抗性示例的普及性，以及旨在防范此类攻击所带来的安全漏洞的防御方法。本文主要关注提供对$\\ell_p$有界攻击提供可证明保证的防御。认证防御取得了显著进展，将鲁棒性认证从玩具模型和数据集扩展到像ImageNet分类这样的大规模问题。虽然这无疑是一个有趣的学术问题，但随着领域的成熟，其在实践中的影响尚不清楚，因此我们发现重新审视继续进行这一研究线路的动机是有意义的。我们在本文中解决了三个层次的问题：(1)我们为什么关心鲁棒性研究？(2)我们为什么关心$\\ell_p$有界的威胁模型？(3)我们为什么关心认证而不是经验性防御？简而言之，我们持以下立场：",
    "tldr": "本文重新审视并回答了三个问题：我们为什么关心鲁棒性研究？我们为什么关心$\\ell_p$有界的威胁模型？我们为什么关心认证而不是经验性防御？"
}