{
    "title": "Vignat: Vulnerability identification by learning code semantics via graph attention networks. (arXiv:2310.20067v1 [cs.CR])",
    "abstract": "Vulnerability identification is crucial to protect software systems from attacks for cyber-security. However, huge projects have more than millions of lines of code, and the complex dependencies make it hard to carry out traditional static and dynamic methods. Furthermore, the semantic structure of various types of vulnerabilities differs greatly and may occur simultaneously, making general rule-based methods difficult to extend. In this paper, we propose \\textit{Vignat}, a novel attention-based framework for identifying vulnerabilities by learning graph-level semantic representations of code. We represent codes with code property graphs (CPGs) in fine grain and use graph attention networks (GATs) for vulnerability detection. The results show that Vignat is able to achieve $57.38\\%$ accuracy on reliable datasets derived from popular C libraries. Furthermore, the interpretability of our GATs provides valuable insights into vulnerability patterns.",
    "link": "http://arxiv.org/abs/2310.20067",
    "context": "Title: Vignat: Vulnerability identification by learning code semantics via graph attention networks. (arXiv:2310.20067v1 [cs.CR])\nAbstract: Vulnerability identification is crucial to protect software systems from attacks for cyber-security. However, huge projects have more than millions of lines of code, and the complex dependencies make it hard to carry out traditional static and dynamic methods. Furthermore, the semantic structure of various types of vulnerabilities differs greatly and may occur simultaneously, making general rule-based methods difficult to extend. In this paper, we propose \\textit{Vignat}, a novel attention-based framework for identifying vulnerabilities by learning graph-level semantic representations of code. We represent codes with code property graphs (CPGs) in fine grain and use graph attention networks (GATs) for vulnerability detection. The results show that Vignat is able to achieve $57.38\\%$ accuracy on reliable datasets derived from popular C libraries. Furthermore, the interpretability of our GATs provides valuable insights into vulnerability patterns.",
    "path": "papers/23/10/2310.20067.json",
    "total_tokens": 916,
    "translated_title": "Vignat: 通过图注意力网络学习代码语义的漏洞识别方法",
    "translated_abstract": "漏洞识别对于保护软件系统免受网络攻击至关重要。然而，庞大的项目拥有超过数百万行代码，复杂的依赖关系使得传统的静态和动态方法难以实施。此外，不同类型的漏洞的语义结构差异很大，并且可能同时发生，使得通用的基于规则的方法难以扩展。在本文中，我们提出了一种名为Vignat的新型基于注意力机制的漏洞识别框架，通过学习代码的图级语义表示来识别漏洞。我们将代码表示为细粒度的代码属性图，并使用图注意力网络进行漏洞检测。实验结果表明，Vignat在来自流行的C库的可靠数据集上能够达到57.38%的准确率。此外，我们的图注意力网络的可解释性为漏洞模式提供了宝贵的洞见。",
    "tldr": "本文提出了一种名为Vignat的漏洞识别框架，通过学习代码的图级语义表示，使用图注意力网络进行漏洞检测。实验结果表明，在C库的可靠数据集上，Vignat能够达到57.38%的准确率，同时提供了对漏洞模式的宝贵洞见。",
    "en_tdlr": "This paper proposes a vulnerability identification framework called Vignat, which utilizes graph attention networks to detect vulnerabilities by learning graph-level semantic representations of code. Experimental results show that Vignat achieves an accuracy of 57.38% on reliable datasets derived from popular C libraries, while providing valuable insights into vulnerability patterns."
}