{
    "title": "The Shifted and The Overlooked: A Task-oriented Investigation of User-GPT Interactions. (arXiv:2310.12418v1 [cs.CL])",
    "abstract": "Recent progress in Large Language Models (LLMs) has produced models that exhibit remarkable performance across a variety of NLP tasks. However, it remains unclear whether the existing focus of NLP research accurately captures the genuine requirements of human users. This paper provides a comprehensive analysis of the divergence between current NLP research and the needs of real-world NLP applications via a large-scale collection of user-GPT conversations. We analyze a large-scale collection of real user queries to GPT. We compare these queries against existing NLP benchmark tasks and identify a significant gap between the tasks that users frequently request from LLMs and the tasks that are commonly studied in academic research. For example, we find that tasks such as ``design'' and ``planning'' are prevalent in user interactions but are largely neglected or different from traditional NLP benchmarks. We investigate these overlooked tasks, dissect the practical challenges they pose, and ",
    "link": "http://arxiv.org/abs/2310.12418",
    "context": "Title: The Shifted and The Overlooked: A Task-oriented Investigation of User-GPT Interactions. (arXiv:2310.12418v1 [cs.CL])\nAbstract: Recent progress in Large Language Models (LLMs) has produced models that exhibit remarkable performance across a variety of NLP tasks. However, it remains unclear whether the existing focus of NLP research accurately captures the genuine requirements of human users. This paper provides a comprehensive analysis of the divergence between current NLP research and the needs of real-world NLP applications via a large-scale collection of user-GPT conversations. We analyze a large-scale collection of real user queries to GPT. We compare these queries against existing NLP benchmark tasks and identify a significant gap between the tasks that users frequently request from LLMs and the tasks that are commonly studied in academic research. For example, we find that tasks such as ``design'' and ``planning'' are prevalent in user interactions but are largely neglected or different from traditional NLP benchmarks. We investigate these overlooked tasks, dissect the practical challenges they pose, and ",
    "path": "papers/23/10/2310.12418.json",
    "total_tokens": 987,
    "translated_title": "移位和忽略：对用户-GPT交互的任务导向调查",
    "translated_abstract": "最近大规模语言模型（LLMs）的进展已经产生了在各种自然语言处理任务中表现出色的模型。然而，目前尚不清楚NLP研究的重点是否准确捕捉到了人类用户的真正需求。本文通过大规模收集用户-GPT对话的方式，对当前NLP研究与实际NLP应用需求之间的差异进行全面分析。我们对真实用户向GPT提出的大量查询进行了分析。我们将这些查询与现有NLP基准任务进行比较，并发现用户经常从LLMs请求的任务与学术研究中常常研究的任务之间存在显著差距。例如，我们发现在用户交互中普遍存在“设计”和“规划”等任务，但这些任务在传统的NLP基准中被忽视或存在差异。我们对这些被忽略的任务进行了深入研究，剖析了它们所带来的实际挑战和问题。",
    "tldr": "本文通过分析用户-GPT对话，发现了当前NLP研究与实际应用需求之间的差异。用户经常请求的任务与学术研究中常研究的任务存在显著差距，如“设计”和“规划”等任务在学术研究中被忽视。对这些被忽略任务的研究有助于更好地满足实际需求。",
    "en_tdlr": "This paper provides a comprehensive analysis of the divergence between current NLP research and the needs of real-world NLP applications by analyzing user-GPT conversations. It reveals a significant gap between the tasks users frequently request from LLMs and the tasks commonly studied in academic research, such as \"design\" and \"planning\". Investigating these overlooked tasks contributes to better meeting practical requirements."
}