{
    "title": "Counter Turing Test CT^2: AI-Generated Text Detection is Not as Easy as You May Think -- Introducing AI Detectability Index. (arXiv:2310.05030v2 [cs.CL] UPDATED)",
    "abstract": "With the rise of prolific ChatGPT, the risk and consequences of AI-generated text has increased alarmingly. To address the inevitable question of ownership attribution for AI-generated artifacts, the US Copyright Office released a statement stating that 'If a work's traditional elements of authorship were produced by a machine, the work lacks human authorship and the Office will not register it'. Furthermore, both the US and the EU governments have recently drafted their initial proposals regarding the regulatory framework for AI. Given this cynosural spotlight on generative AI, AI-generated text detection (AGTD) has emerged as a topic that has already received immediate attention in research, with some initial methods having been proposed, soon followed by emergence of techniques to bypass detection. This paper introduces the Counter Turing Test (CT^2), a benchmark consisting of techniques aiming to offer a comprehensive evaluation of the robustness of existing AGTD techniques. Our em",
    "link": "http://arxiv.org/abs/2310.05030",
    "context": "Title: Counter Turing Test CT^2: AI-Generated Text Detection is Not as Easy as You May Think -- Introducing AI Detectability Index. (arXiv:2310.05030v2 [cs.CL] UPDATED)\nAbstract: With the rise of prolific ChatGPT, the risk and consequences of AI-generated text has increased alarmingly. To address the inevitable question of ownership attribution for AI-generated artifacts, the US Copyright Office released a statement stating that 'If a work's traditional elements of authorship were produced by a machine, the work lacks human authorship and the Office will not register it'. Furthermore, both the US and the EU governments have recently drafted their initial proposals regarding the regulatory framework for AI. Given this cynosural spotlight on generative AI, AI-generated text detection (AGTD) has emerged as a topic that has already received immediate attention in research, with some initial methods having been proposed, soon followed by emergence of techniques to bypass detection. This paper introduces the Counter Turing Test (CT^2), a benchmark consisting of techniques aiming to offer a comprehensive evaluation of the robustness of existing AGTD techniques. Our em",
    "path": "papers/23/10/2310.05030.json",
    "total_tokens": 862,
    "translated_title": "反图灵测试CT^2：AI生成文本检测没有你想象的那么容易——引入AI可检测性指数。",
    "translated_abstract": "随着ChatGPT等生成AI的兴起，AI生成文本的风险和后果越来越引起关注。为了解决对AI生成作品的归属问题，美国版权局发布了一份声明，指出“如果一件作品的传统创作元素由机器生成，那么这件作品就缺乏人类创作，版权局将不会登记它”。此外，美国和欧盟政府最近也草拟了关于AI监管框架的初步提案。在这种对生成AI的关注中，AI生成文本检测已经成为一个受到研究立即关注的话题，一些初步方法已经被提出，随后出现了绕过检测的技术。本文介绍了反图灵测试（CT^2），这是一个基准，旨在全面评估现有AI生成文本检测技术的稳健性。",
    "tldr": "这篇论文介绍了一个名为反图灵测试（CT^2）的基准，旨在全面评估现有AI生成文本检测技术的稳健性。在面对生成AI的风险和后果引起关注的情况下，解决AI生成作品归属问题变得尤为重要。"
}