{
    "title": "Provable Tensor Completion with Graph Information. (arXiv:2310.02543v1 [cs.LG])",
    "abstract": "Graphs, depicting the interrelations between variables, has been widely used as effective side information for accurate data recovery in various matrix/tensor recovery related applications. In this paper, we study the tensor completion problem with graph information. Current research on graph-regularized tensor completion tends to be task-specific, lacking generality and systematic approaches. Furthermore, a recovery theory to ensure performance remains absent. Moreover, these approaches overlook the dynamic aspects of graphs, treating them as static akin to matrices, even though graphs could exhibit dynamism in tensor-related scenarios. To confront these challenges, we introduce a pioneering framework in this paper that systematically formulates a novel model, theory, and algorithm for solving the dynamic graph regularized tensor completion problem. For the model, we establish a rigorous mathematical representation of the dynamic graph, based on which we derive a new tensor-oriented g",
    "link": "http://arxiv.org/abs/2310.02543",
    "context": "Title: Provable Tensor Completion with Graph Information. (arXiv:2310.02543v1 [cs.LG])\nAbstract: Graphs, depicting the interrelations between variables, has been widely used as effective side information for accurate data recovery in various matrix/tensor recovery related applications. In this paper, we study the tensor completion problem with graph information. Current research on graph-regularized tensor completion tends to be task-specific, lacking generality and systematic approaches. Furthermore, a recovery theory to ensure performance remains absent. Moreover, these approaches overlook the dynamic aspects of graphs, treating them as static akin to matrices, even though graphs could exhibit dynamism in tensor-related scenarios. To confront these challenges, we introduce a pioneering framework in this paper that systematically formulates a novel model, theory, and algorithm for solving the dynamic graph regularized tensor completion problem. For the model, we establish a rigorous mathematical representation of the dynamic graph, based on which we derive a new tensor-oriented g",
    "path": "papers/23/10/2310.02543.json",
    "total_tokens": 841,
    "translated_title": "具有图信息的可证明张量补全",
    "translated_abstract": "图被广泛应用作为变量之间相互关系的有效侧面信息，用于各种矩阵/张量恢复相关应用中的准确数据恢复。本文研究了具有图信息的张量补全问题。目前关于图正则化的张量补全的研究更倾向于特定任务，缺乏普适性和系统化的方法。此外，缺乏保证性能的恢复理论。此外，这些方法忽视了图的动态特性，在张量相关场景中将其视为类似矩阵的静态对象，即使图可能在时间上具有动态性。为了应对这些挑战，在本文中我们介绍了一个创新框架，系统地建立了解决动态图正则化张量补全问题的新模型、理论和算法。对于模型，我们建立了动态图的严格数学表示，基于该表示我们推导出了一个新的针对张量的图导向的补全模型。",
    "tldr": "本文提出了一个创新框架，系统地解决了具有图信息的动态图正则化张量补全问题，建立了严格的数学表示，并推导出了新的图导向补全模型。",
    "en_tdlr": "This paper proposes an innovative framework that systematically addresses the problem of dynamic graph regularized tensor completion with graph information, establishes a rigorous mathematical representation, and derives a new graph-oriented completion model."
}