{
    "title": "Analysis of Weather and Time Features in Machine Learning-aided ERCOT Load Forecasting. (arXiv:2310.08793v1 [cs.LG])",
    "abstract": "Accurate load forecasting is critical for efficient and reliable operations of the electric power system. A large part of electricity consumption is affected by weather conditions, making weather information an important determinant of electricity usage. Personal appliances and industry equipment also contribute significantly to electricity demand with temporal patterns, making time a useful factor to consider in load forecasting. This work develops several machine learning (ML) models that take various time and weather information as part of the input features to predict the short-term system-wide total load. Ablation studies were also performed to investigate and compare the impacts of different weather factors on the prediction accuracy. Actual load and historical weather data for the same region were processed and then used to train the ML models. It is interesting to observe that using all available features, each of which may be correlated to the load, is unlikely to achieve the ",
    "link": "http://arxiv.org/abs/2310.08793",
    "context": "Title: Analysis of Weather and Time Features in Machine Learning-aided ERCOT Load Forecasting. (arXiv:2310.08793v1 [cs.LG])\nAbstract: Accurate load forecasting is critical for efficient and reliable operations of the electric power system. A large part of electricity consumption is affected by weather conditions, making weather information an important determinant of electricity usage. Personal appliances and industry equipment also contribute significantly to electricity demand with temporal patterns, making time a useful factor to consider in load forecasting. This work develops several machine learning (ML) models that take various time and weather information as part of the input features to predict the short-term system-wide total load. Ablation studies were also performed to investigate and compare the impacts of different weather factors on the prediction accuracy. Actual load and historical weather data for the same region were processed and then used to train the ML models. It is interesting to observe that using all available features, each of which may be correlated to the load, is unlikely to achieve the ",
    "path": "papers/23/10/2310.08793.json",
    "total_tokens": 873,
    "translated_title": "机器学习辅助ERCOT负荷预测中的天气和时间特征分析",
    "translated_abstract": "准确的负荷预测对于电力系统的高效可靠运行至关重要。电力消耗的很大一部分受天气条件的影响，因此天气信息是影响电力使用的重要因素。个人电器和工业设备也以其时间模式显著贡献于电力需求，因此时间也是负荷预测中需要考虑的一个有用因素。本研究开发了几种机器学习模型，其中将各种时间和天气信息作为输入特征，用于预测短期系统总负荷。还进行了消融研究，以研究和比较不同天气因素对预测准确性的影响。使用实际负荷和历史天气数据，训练了机器学习模型。有趣的是观察到，最大程度地利用所有可能与负荷相关的特征，不太可能达到最佳预测效果。",
    "tldr": "本研究开发了机器学习模型，利用时间和天气信息预测短期系统总负荷，发现最大程度利用各种相关特征不一定能达到最佳预测效果。",
    "en_tdlr": "This work develops machine learning models that utilize time and weather information to predict short-term system-wide total load, finding that maximizing the use of various relevant features does not necessarily achieve optimal prediction accuracy."
}