{
    "title": "Mind the Gap: Automated Corpus Creation for Enthymeme Detection and Reconstruction in Learner Arguments. (arXiv:2310.18098v1 [cs.CL])",
    "abstract": "Writing strong arguments can be challenging for learners. It requires to select and arrange multiple argumentative discourse units (ADUs) in a logical and coherent way as well as to decide which ADUs to leave implicit, so called enthymemes. However, when important ADUs are missing, readers might not be able to follow the reasoning or understand the argument's main point. This paper introduces two new tasks for learner arguments: to identify gaps in arguments (enthymeme detection) and to fill such gaps (enthymeme reconstruction). Approaches to both tasks may help learners improve their argument quality. We study how corpora for these tasks can be created automatically by deleting ADUs from an argumentative text that are central to the argument and its quality, while maintaining the text's naturalness. Based on the ICLEv3 corpus of argumentative learner essays, we create 40,089 argument instances for enthymeme detection and reconstruction. Through manual studies, we provide evidence that",
    "link": "http://arxiv.org/abs/2310.18098",
    "context": "Title: Mind the Gap: Automated Corpus Creation for Enthymeme Detection and Reconstruction in Learner Arguments. (arXiv:2310.18098v1 [cs.CL])\nAbstract: Writing strong arguments can be challenging for learners. It requires to select and arrange multiple argumentative discourse units (ADUs) in a logical and coherent way as well as to decide which ADUs to leave implicit, so called enthymemes. However, when important ADUs are missing, readers might not be able to follow the reasoning or understand the argument's main point. This paper introduces two new tasks for learner arguments: to identify gaps in arguments (enthymeme detection) and to fill such gaps (enthymeme reconstruction). Approaches to both tasks may help learners improve their argument quality. We study how corpora for these tasks can be created automatically by deleting ADUs from an argumentative text that are central to the argument and its quality, while maintaining the text's naturalness. Based on the ICLEv3 corpus of argumentative learner essays, we create 40,089 argument instances for enthymeme detection and reconstruction. Through manual studies, we provide evidence that",
    "path": "papers/23/10/2310.18098.json",
    "total_tokens": 943,
    "translated_title": "心思境界：用于学习者论证中省略部分检测和重建的自动语料库构建",
    "translated_abstract": "对于学习者来说，写强有力的论证是具有挑战性的。它要求选择和安排多个论证性篇章单元（ADUs），使其逻辑和连贯，并决定暗含的ADUs。然而，当关键的ADUs缺失时，读者可能无法跟随推理或理解论证的主要观点。本文引入了两个新的学习者论证任务：检测论证中的缺失（省略部分检测）和填补这些缺失（省略部分重建）。这两个任务的方法可以帮助学习者提高论证的质量。我们研究了如何通过从一个论证文本中删除对论证及其质量至关重要的ADUs来自动创建这些任务的语料库，同时保持文本的自然性。基于ICLEv3论证性学生文章语料库，我们为省略部分检测和重建创建了40,089个论证实例。通过手动研究，我们提供了证据证明……",
    "tldr": "本研究提出了两个新的任务，即检测学习者论证中的缺失部分和填补这些缺失部分。通过自动创建语料库，可以帮助学习者提高论证质量。基于ICLEv3语料库，本研究创建了40,089个论证实例。"
}