{
    "title": "Online Parameter Identification of Generalized Non-cooperative Game. (arXiv:2310.09511v1 [cs.GT])",
    "abstract": "This work studies the parameter identification problem of a generalized non-cooperative game, where each player's cost function is influenced by an observable signal and some unknown parameters. We consider the scenario where equilibrium of the game at some observable signals can be observed with noises, whereas our goal is to identify the unknown parameters with the observed data. Assuming that the observable signals and the corresponding noise-corrupted equilibriums are acquired sequentially, we construct this parameter identification problem as online optimization and introduce a novel online parameter identification algorithm. To be specific, we construct a regularized loss function that balances conservativeness and correctiveness, where the conservativeness term ensures that the new estimates do not deviate significantly from the current estimates, while the correctiveness term is captured by the Karush-Kuhn-Tucker conditions. We then prove that when the players' cost functions a",
    "link": "http://arxiv.org/abs/2310.09511",
    "context": "Title: Online Parameter Identification of Generalized Non-cooperative Game. (arXiv:2310.09511v1 [cs.GT])\nAbstract: This work studies the parameter identification problem of a generalized non-cooperative game, where each player's cost function is influenced by an observable signal and some unknown parameters. We consider the scenario where equilibrium of the game at some observable signals can be observed with noises, whereas our goal is to identify the unknown parameters with the observed data. Assuming that the observable signals and the corresponding noise-corrupted equilibriums are acquired sequentially, we construct this parameter identification problem as online optimization and introduce a novel online parameter identification algorithm. To be specific, we construct a regularized loss function that balances conservativeness and correctiveness, where the conservativeness term ensures that the new estimates do not deviate significantly from the current estimates, while the correctiveness term is captured by the Karush-Kuhn-Tucker conditions. We then prove that when the players' cost functions a",
    "path": "papers/23/10/2310.09511.json",
    "total_tokens": 811,
    "translated_title": "广义非合作博弈的在线参数估计",
    "translated_abstract": "本文研究了广义非合作博弈的参数估计问题，其中每个玩家的成本函数受可观测信号和一些未知参数的影响。我们考虑了在某些可观测信号上的平衡可以被带有噪声的观测到的情况下，我们的目标是通过观测数据识别未知参数。假设可观测信号和相应的带有噪声的平衡是按顺序获得的，我们将这个参数识别问题构造为在线优化，并引入了一种新颖的在线参数识别算法。具体来说，我们构造了一个平衡了保守性和正确性的正则化损失函数，其中保守性项确保新估计值与当前估计值的偏差不大，而正确性项由Karush-Kuhn-Tucker条件捕捉。然后我们证明了当玩家的成本函数...",
    "tldr": "本文研究了广义非合作博弈的在线参数估计问题，使用观测到的数据识别未知参数，并提出了一种新颖的在线参数识别算法。"
}