{
    "title": "FA Team at the NTCIR-17 UFO Task. (arXiv:2310.20322v1 [cs.CL])",
    "abstract": "The FA team participated in the Table Data Extraction (TDE) and Text-to-Table Relationship Extraction (TTRE) tasks of the NTCIR-17 Understanding of Non-Financial Objects in Financial Reports (UFO). This paper reports our approach to solving the problems and discusses the official results. We successfully utilized various enhancement techniques based on the ELECTRA language model to extract valuable data from tables. Our efforts resulted in an impressive TDE accuracy rate of 93.43 %, positioning us in second place on the Leaderboard rankings. This outstanding achievement is a testament to our proposed approach's effectiveness. In the TTRE task, we proposed the rule-based method to extract meaningful relationships between the text and tables task and confirmed the performance.",
    "link": "http://arxiv.org/abs/2310.20322",
    "context": "Title: FA Team at the NTCIR-17 UFO Task. (arXiv:2310.20322v1 [cs.CL])\nAbstract: The FA team participated in the Table Data Extraction (TDE) and Text-to-Table Relationship Extraction (TTRE) tasks of the NTCIR-17 Understanding of Non-Financial Objects in Financial Reports (UFO). This paper reports our approach to solving the problems and discusses the official results. We successfully utilized various enhancement techniques based on the ELECTRA language model to extract valuable data from tables. Our efforts resulted in an impressive TDE accuracy rate of 93.43 %, positioning us in second place on the Leaderboard rankings. This outstanding achievement is a testament to our proposed approach's effectiveness. In the TTRE task, we proposed the rule-based method to extract meaningful relationships between the text and tables task and confirmed the performance.",
    "path": "papers/23/10/2310.20322.json",
    "total_tokens": 812,
    "translated_title": "NTCIR-17 UFO任务中的FA团队（arXiv:2310.20322v1 [cs.CL]）",
    "translated_abstract": "FA团队参加了NTCIR-17 UFO的表格数据提取（TDE）和文本到表格关系提取（TTRE）任务。本文报告了我们解决这些问题的方法，并讨论了官方结果。我们成功地利用基于ELECTRA语言模型的各种增强技术从表格中提取有价值的数据。我们的努力导致了93.43%的令人印象深刻的TDE准确率，并使我们在排行榜上排名第二。这一卓越成就证明了我们提出的方法的有效性。在TTRE任务中，我们提出了基于规则的方法来提取文本和表格之间的有意义的关系，并验证了性能。",
    "tldr": "FA团队参加了NTCIR-17 UFO任务，通过利用ELECTRA语言模型的增强技术，成功实现了对表格中有价值数据的提取，达到了93.43%的准确率，并在排行榜上获得第二名。在TTRE任务中，他们还提出了基于规则的方法来提取文本和表格之间的关系。",
    "en_tdlr": "The FA team participated in the NTCIR-17 UFO task and achieved an impressive 93.43% accuracy rate in extracting valuable data from tables using enhancement techniques based on the ELECTRA language model. They also proposed a rule-based method for extracting meaningful relationships between text and tables in the TTRE task."
}