{
    "title": "Multi-Scale Spatial-Temporal Recurrent Networks for Traffic Flow Prediction. (arXiv:2310.08138v1 [cs.LG])",
    "abstract": "Traffic flow prediction is one of the most fundamental tasks of intelligent transportation systems. The complex and dynamic spatial-temporal dependencies make the traffic flow prediction quite challenging. Although existing spatial-temporal graph neural networks hold prominent, they often encounter challenges such as (1) ignoring the fixed graph that limits the predictive performance of the model, (2) insufficiently capturing complex spatial-temporal dependencies simultaneously, and (3) lacking attention to spatial-temporal information at different time lengths. In this paper, we propose a Multi-Scale Spatial-Temporal Recurrent Network for traffic flow prediction, namely MSSTRN, which consists of two different recurrent neural networks: the single-step gate recurrent unit and the multi-step gate recurrent unit to fully capture the complex spatial-temporal information in the traffic data under different time windows. Moreover, we propose a spatial-temporal synchronous attention mechanis",
    "link": "http://arxiv.org/abs/2310.08138",
    "context": "Title: Multi-Scale Spatial-Temporal Recurrent Networks for Traffic Flow Prediction. (arXiv:2310.08138v1 [cs.LG])\nAbstract: Traffic flow prediction is one of the most fundamental tasks of intelligent transportation systems. The complex and dynamic spatial-temporal dependencies make the traffic flow prediction quite challenging. Although existing spatial-temporal graph neural networks hold prominent, they often encounter challenges such as (1) ignoring the fixed graph that limits the predictive performance of the model, (2) insufficiently capturing complex spatial-temporal dependencies simultaneously, and (3) lacking attention to spatial-temporal information at different time lengths. In this paper, we propose a Multi-Scale Spatial-Temporal Recurrent Network for traffic flow prediction, namely MSSTRN, which consists of two different recurrent neural networks: the single-step gate recurrent unit and the multi-step gate recurrent unit to fully capture the complex spatial-temporal information in the traffic data under different time windows. Moreover, we propose a spatial-temporal synchronous attention mechanis",
    "path": "papers/23/10/2310.08138.json",
    "total_tokens": 946,
    "translated_title": "多尺度时空循环网络用于交通流预测",
    "translated_abstract": "交通流预测是智能交通系统中最基本的任务之一。复杂而动态的时空依赖关系使得交通流预测变得非常具有挑战性。尽管现有的时空图神经网络在交通流预测中有显著优势，但它们常常面临以下挑战：（1）忽视了固定的图结构，限制了模型的预测性能；（2）不能同时充分捕捉复杂的时空依赖关系；（3）缺乏对不同时间尺度上的时空信息的关注。本文提出了一种多尺度时空循环网络（MSSTRN）用于交通流预测，它由两种不同的循环神经网络组成：单步门循环单元和多步门循环单元，以完全捕获交通数据中不同时间窗口下的复杂时空信息。此外，我们还提出了一种时空同步注意机制。",
    "tldr": "本论文提出了一种名为MSSTRN的多尺度时空循环网络，用于交通流预测。该网络通过两种不同的循环神经网络完全捕获了交通数据中不同时间窗口下的复杂时空信息，解决了现有方法中忽视图结构、捕捉不充分以及缺乏关注不同时间尺度上时空信息的问题。"
}