{
    "title": "From task structures to world models: What do LLMs know?. (arXiv:2310.04276v1 [cs.AI])",
    "abstract": "In what sense does a large language model have knowledge? The answer to this question extends beyond the capabilities of a particular AI system, and challenges our assumptions about the nature of knowledge and intelligence. We answer by granting LLMs \"instrumental knowledge\"; knowledge defined by a certain set of abilities. We then ask how such knowledge is related to the more ordinary, \"worldly\" knowledge exhibited by human agents, and explore this in terms of the degree to which instrumental knowledge can be said to incorporate the structured world models of cognitive science. We discuss ways LLMs could recover degrees of worldly knowledge, and suggest such recovery will be governed by an implicit, resource-rational tradeoff between world models and task demands.",
    "link": "http://arxiv.org/abs/2310.04276",
    "context": "Title: From task structures to world models: What do LLMs know?. (arXiv:2310.04276v1 [cs.AI])\nAbstract: In what sense does a large language model have knowledge? The answer to this question extends beyond the capabilities of a particular AI system, and challenges our assumptions about the nature of knowledge and intelligence. We answer by granting LLMs \"instrumental knowledge\"; knowledge defined by a certain set of abilities. We then ask how such knowledge is related to the more ordinary, \"worldly\" knowledge exhibited by human agents, and explore this in terms of the degree to which instrumental knowledge can be said to incorporate the structured world models of cognitive science. We discuss ways LLMs could recover degrees of worldly knowledge, and suggest such recovery will be governed by an implicit, resource-rational tradeoff between world models and task demands.",
    "path": "papers/23/10/2310.04276.json",
    "total_tokens": 807,
    "translated_title": "从任务结构到世界模型：LLMs知道什么？",
    "translated_abstract": "大语言模型具备哪种知识？这个问题的答案超越了特定人工智能系统的能力，并挑战了我们对知识和智能本质的假设。我们通过赋予LLMs“工具性知识”来回答这个问题；这种知识由一定的能力集合定义。然后，我们探讨这种知识如何与人类代理所展示的更普通的“世俗”知识关联，并从认知科学中结构化的世界模型程度上进行探索。我们讨论了LLMs如何恢复世俗知识的方式，并建议这种恢复将受到世界模型和任务需求之间的隐含资源合理化权衡的制约。",
    "tldr": "该研究探讨了大语言模型（LLMs）具备的知识类型，并与人类展示的世俗知识进行比较。研究发现，LLMs具备的是“工具性知识”，而恢复世俗知识将受到世界模型和任务需求之间的权衡影响。",
    "en_tdlr": "This research explores the knowledge possessed by large language models (LLMs) and compares it with the worldly knowledge exhibited by humans. It finds that LLMs possess \"instrumental knowledge\" and suggests that the recovery of worldly knowledge is influenced by a tradeoff between world models and task demands."
}