{
    "title": "Generalized Schr\\\"odinger Bridge Matching. (arXiv:2310.02233v1 [stat.ML])",
    "abstract": "Modern distribution matching algorithms for training diffusion or flow models directly prescribe the time evolution of the marginal distributions between two boundary distributions. In this work, we consider a generalized distribution matching setup, where these marginals are only implicitly described as a solution to some task-specific objective function. The problem setup, known as the Generalized Schr\\\"odinger Bridge (GSB), appears prevalently in many scientific areas both within and without machine learning. We propose Generalized Schr\\\"odinger Bridge Matching (GSBM), a new matching algorithm inspired by recent advances, generalizing them beyond kinetic energy minimization and to account for task-specific state costs. We show that such a generalization can be cast as solving conditional stochastic optimal control, for which efficient variational approximations can be used, and further debiased with the aid of path integral theory. Compared to prior methods for solving GSB problems,",
    "link": "http://arxiv.org/abs/2310.02233",
    "context": "Title: Generalized Schr\\\"odinger Bridge Matching. (arXiv:2310.02233v1 [stat.ML])\nAbstract: Modern distribution matching algorithms for training diffusion or flow models directly prescribe the time evolution of the marginal distributions between two boundary distributions. In this work, we consider a generalized distribution matching setup, where these marginals are only implicitly described as a solution to some task-specific objective function. The problem setup, known as the Generalized Schr\\\"odinger Bridge (GSB), appears prevalently in many scientific areas both within and without machine learning. We propose Generalized Schr\\\"odinger Bridge Matching (GSBM), a new matching algorithm inspired by recent advances, generalizing them beyond kinetic energy minimization and to account for task-specific state costs. We show that such a generalization can be cast as solving conditional stochastic optimal control, for which efficient variational approximations can be used, and further debiased with the aid of path integral theory. Compared to prior methods for solving GSB problems,",
    "path": "papers/23/10/2310.02233.json",
    "total_tokens": 858,
    "translated_title": "广义薛定谔桥匹配",
    "translated_abstract": "现代分布匹配算法用于训练扩散或流模型，直接规定了两个边界分布之间的边缘分布的时间演变。在这项工作中，我们考虑了一个广义的分布匹配设置，其中这些边缘分布仅以某些任务特定目标函数的解形式隐含描述。这个问题设置被称为广义薛定谔桥(GSB)，在许多科学领域内和机器学习之外广泛出现。我们提出了广义薛定谔桥匹配(GSBM)，这是一种受最近进展启发的新的匹配算法，将它们推广到动能最小化之外，并考虑到任务特定的状态成本。我们证明这样的泛化可以被建模为求解条件随机最优控制问题，其中可以使用高效的变分近似，并借助路径积分理论进一步去偏差。与解决GSB问题的先前方法相比，",
    "tldr": "广义薛定谔桥匹配是一种新的分布匹配算法，通过将任务特定的状态成本考虑在内，推广了现代分布匹配算法，并可用于解决条件随机最优控制问题。",
    "en_tdlr": "Generalized Schr\\\"odinger Bridge Matching is a novel distribution matching algorithm that extends modern distribution matching algorithms by incorporating task-specific state costs, and can be used to solve conditional stochastic optimal control problems."
}