{
    "title": "FLAIR: a Country-Scale Land Cover Semantic Segmentation Dataset From Multi-Source Optical Imagery. (arXiv:2310.13336v1 [cs.CV])",
    "abstract": "We introduce the French Land cover from Aerospace ImageRy (FLAIR), an extensive dataset from the French National Institute of Geographical and Forest Information (IGN) that provides a unique and rich resource for large-scale geospatial analysis. FLAIR contains high-resolution aerial imagery with a ground sample distance of 20 cm and over 20 billion individually labeled pixels for precise land-cover classification. The dataset also integrates temporal and spectral data from optical satellite time series. FLAIR thus combines data with varying spatial, spectral, and temporal resolutions across over 817 km2 of acquisitions representing the full landscape diversity of France. This diversity makes FLAIR a valuable resource for the development and evaluation of novel methods for large-scale land-cover semantic segmentation and raises significant challenges in terms of computer vision, data fusion, and geospatial analysis. We also provide powerful uni- and multi-sensor baseline models that can",
    "link": "http://arxiv.org/abs/2310.13336",
    "context": "Title: FLAIR: a Country-Scale Land Cover Semantic Segmentation Dataset From Multi-Source Optical Imagery. (arXiv:2310.13336v1 [cs.CV])\nAbstract: We introduce the French Land cover from Aerospace ImageRy (FLAIR), an extensive dataset from the French National Institute of Geographical and Forest Information (IGN) that provides a unique and rich resource for large-scale geospatial analysis. FLAIR contains high-resolution aerial imagery with a ground sample distance of 20 cm and over 20 billion individually labeled pixels for precise land-cover classification. The dataset also integrates temporal and spectral data from optical satellite time series. FLAIR thus combines data with varying spatial, spectral, and temporal resolutions across over 817 km2 of acquisitions representing the full landscape diversity of France. This diversity makes FLAIR a valuable resource for the development and evaluation of novel methods for large-scale land-cover semantic segmentation and raises significant challenges in terms of computer vision, data fusion, and geospatial analysis. We also provide powerful uni- and multi-sensor baseline models that can",
    "path": "papers/23/10/2310.13336.json",
    "total_tokens": 957,
    "translated_title": "FLAIR:一种基于多源光学影像的全国范围土地覆盖语义分割数据集",
    "translated_abstract": "我们介绍了法国国家地理和森林信息研究所（IGN）的法国航空航天影像（FLAIR）数据集，这是一个广泛的数据集，为大规模地理空间分析提供了独特而丰富的资源。FLAIR包含高分辨率航拍图像，地面样本间距为20厘米，超过200亿个个体标记像素用于精确的土地覆盖分类。该数据集还整合了光学卫星时间序列的时间和光谱数据。因此，FLAIR将具有不同空间、光谱和时间分辨率的数据整合在法国全境817平方公里的采集中，代表了法国丰富的景观多样性。这种多样性使FLAIR成为大规模土地覆盖语义分割方法的开发和评估的宝贵资源，并在计算机视觉、数据融合和地理空间分析方面带来了重大挑战。我们还提供了强大的单传感器和多传感器基线模型，可以用来",
    "tldr": "FLAIR是一个全国范围的土地覆盖语义分割数据集，包含大量高分辨率航拍图像和数十亿个个体标记像素。FLAIR整合了不同空间、光谱和时间分辨率的数据，对于大规模土地覆盖分析的方法开发和评估具有重要价值。",
    "en_tdlr": "FLAIR is a country-scale land cover semantic segmentation dataset that includes high-resolution aerial imagery and billions of individually labeled pixels. It integrates data with varying spatial, spectral, and temporal resolutions, making it valuable for the development and evaluation of methods for large-scale land cover analysis."
}