{
    "title": "Solving Travelling Thief Problems using Coordination Based Methods. (arXiv:2310.07156v1 [cs.AI])",
    "abstract": "A travelling thief problem (TTP) is a proxy to real-life problems such as postal collection. TTP comprises an entanglement of a travelling salesman problem (TSP) and a knapsack problem (KP) since items of KP are scattered over cities of TSP, and a thief has to visit cities to collect items. In TTP, city selection and item selection decisions need close coordination since the thief's travelling speed depends on the knapsack's weight and the order of visiting cities affects the order of item collection. Existing TTP solvers deal with city selection and item selection separately, keeping decisions for one type unchanged while dealing with the other type. This separation essentially means very poor coordination between two types of decision. In this paper, we first show that a simple local search based coordination approach does not work in TTP. Then, to address the aforementioned problems, we propose a human designed coordination heuristic that makes changes to collection plans during exp",
    "link": "http://arxiv.org/abs/2310.07156",
    "context": "Title: Solving Travelling Thief Problems using Coordination Based Methods. (arXiv:2310.07156v1 [cs.AI])\nAbstract: A travelling thief problem (TTP) is a proxy to real-life problems such as postal collection. TTP comprises an entanglement of a travelling salesman problem (TSP) and a knapsack problem (KP) since items of KP are scattered over cities of TSP, and a thief has to visit cities to collect items. In TTP, city selection and item selection decisions need close coordination since the thief's travelling speed depends on the knapsack's weight and the order of visiting cities affects the order of item collection. Existing TTP solvers deal with city selection and item selection separately, keeping decisions for one type unchanged while dealing with the other type. This separation essentially means very poor coordination between two types of decision. In this paper, we first show that a simple local search based coordination approach does not work in TTP. Then, to address the aforementioned problems, we propose a human designed coordination heuristic that makes changes to collection plans during exp",
    "path": "papers/23/10/2310.07156.json",
    "total_tokens": 853,
    "translated_title": "使用基于协调方法解决旅行窃贼问题",
    "translated_abstract": "旅行窃贼问题（TTP）是实际问题（如邮件收集）的一个代理。TTP由旅行推销员问题（TSP）和背包问题（KP）的组合构成，因为KP的物品分散在TSP的城市中，小偷必须访问城市来收集物品。在TTP中，城市选择和物品选择决策需要紧密协调，因为小偷的旅行速度取决于背包的重量，访问城市的顺序会影响物品收集的顺序。现有的TTP求解器将城市选择和物品选择分开处理，保持一种类型的决策不变，而处理另一种类型。这种分离实际上意味着两种决策之间的协调很差。在本文中，我们首先证明了在TTP中一个简单的基于局部搜索的协调方法不起作用。然后，为了解决上述问题，我们提出了一种人工设计的协调启发式算法，在开发期间更改收集计划。",
    "tldr": "这篇论文提出了一种解决旅行窃贼问题的协调方法，去改善城市选择和物品选择之间的协调问题。",
    "en_tdlr": "This paper proposes a coordination-based method to solve the travelling thief problem, aiming to improve the coordination between city selection and item selection."
}