{
    "title": "Investigating the Adversarial Robustness of Density Estimation Using the Probability Flow ODE. (arXiv:2310.07084v1 [cs.LG])",
    "abstract": "Beyond their impressive sampling capabilities, score-based diffusion models offer a powerful analysis tool in the form of unbiased density estimation of a query sample under the training data distribution. In this work, we investigate the robustness of density estimation using the probability flow (PF) neural ordinary differential equation (ODE) model against gradient-based likelihood maximization attacks and the relation to sample complexity, where the compressed size of a sample is used as a measure of its complexity. We introduce and evaluate six gradient-based log-likelihood maximization attacks, including a novel reverse integration attack. Our experimental evaluations on CIFAR-10 show that density estimation using the PF ODE is robust against high-complexity, high-likelihood attacks, and that in some cases adversarial samples are semantically meaningful, as expected from a robust estimator.",
    "link": "http://arxiv.org/abs/2310.07084",
    "context": "Title: Investigating the Adversarial Robustness of Density Estimation Using the Probability Flow ODE. (arXiv:2310.07084v1 [cs.LG])\nAbstract: Beyond their impressive sampling capabilities, score-based diffusion models offer a powerful analysis tool in the form of unbiased density estimation of a query sample under the training data distribution. In this work, we investigate the robustness of density estimation using the probability flow (PF) neural ordinary differential equation (ODE) model against gradient-based likelihood maximization attacks and the relation to sample complexity, where the compressed size of a sample is used as a measure of its complexity. We introduce and evaluate six gradient-based log-likelihood maximization attacks, including a novel reverse integration attack. Our experimental evaluations on CIFAR-10 show that density estimation using the PF ODE is robust against high-complexity, high-likelihood attacks, and that in some cases adversarial samples are semantically meaningful, as expected from a robust estimator.",
    "path": "papers/23/10/2310.07084.json",
    "total_tokens": 902,
    "translated_title": "使用概率流动ODE探究密度估计的对抗鲁棒性",
    "translated_abstract": "除了其令人印象深刻的采样能力之外，基于得分的扩散模型还提供了一种强大的分析工具，即对训练数据分布下的查询样本进行无偏密度估计。在本研究中，我们通过使用概率流动(PF)神经常微分方程(ODE)模型对密度估计的鲁棒性进行了研究，并探讨了与样本复杂性的关系。我们将样本的压缩大小用作其复杂性的衡量指标。我们引入并评估了六种基于梯度的对数似然最大化攻击，包括一种新的反向积分攻击。我们在CIFAR-10数据集上进行的实验评估表明，使用PF ODE进行密度估计对高复杂度、高似然度攻击是鲁棒的，并且在某些情况下，对抗样本是语义上有意义的，这与鲁棒估计器的预期一致。",
    "tldr": "本研究使用概率流动ODE模型探究了密度估计的鲁棒性，并发现在一些情况下，密度估计对高复杂度、高似然度的攻击是鲁棒的，同时对抗样本也具有语义上的意义。",
    "en_tdlr": "This study investigates the adversarial robustness of density estimation using the Probability Flow ODE model and finds that density estimation is robust against high-complexity, high-likelihood attacks, and that adversarial samples are semantically meaningful in some cases."
}