{
    "title": "Ethical Considerations for Machine Translation of Indigenous Languages: Giving a Voice to the Speakers. (arXiv:2305.19474v1 [cs.CL])",
    "abstract": "In recent years machine translation has become very successful for high-resource language pairs. This has also sparked new interest in research on the automatic translation of low-resource languages, including Indigenous languages. However, the latter are deeply related to the ethnic and cultural groups that speak (or used to speak) them. The data collection, modeling and deploying machine translation systems thus result in new ethical questions that must be addressed. Motivated by this, we first survey the existing literature on ethical considerations for the documentation, translation, and general natural language processing for Indigenous languages. Afterward, we conduct and analyze an interview study to shed light on the positions of community leaders, teachers, and language activists regarding ethical concerns for the automatic translation of their languages. Our results show that the inclusion, at different degrees, of native speakers and community members is vital to performing ",
    "link": "http://arxiv.org/abs/2305.19474",
    "context": "Title: Ethical Considerations for Machine Translation of Indigenous Languages: Giving a Voice to the Speakers. (arXiv:2305.19474v1 [cs.CL])\nAbstract: In recent years machine translation has become very successful for high-resource language pairs. This has also sparked new interest in research on the automatic translation of low-resource languages, including Indigenous languages. However, the latter are deeply related to the ethnic and cultural groups that speak (or used to speak) them. The data collection, modeling and deploying machine translation systems thus result in new ethical questions that must be addressed. Motivated by this, we first survey the existing literature on ethical considerations for the documentation, translation, and general natural language processing for Indigenous languages. Afterward, we conduct and analyze an interview study to shed light on the positions of community leaders, teachers, and language activists regarding ethical concerns for the automatic translation of their languages. Our results show that the inclusion, at different degrees, of native speakers and community members is vital to performing ",
    "path": "papers/23/05/2305.19474.json",
    "total_tokens": 911,
    "translated_title": "机器翻译原住民语言的伦理考虑：为说话者发声",
    "translated_abstract": "近年来，机器翻译在高资源语言对之间得到了很大成功。这也引起了对低资源语言的自动翻译的新兴研究，包括原住民语言。然而，后者与说（或曾经说）它们的族群和文化密切相关。数据收集、建模和部署机器翻译系统因此产生了需要解决的新的伦理问题。受此启发，我们首先调查了有关原住民语言文档、翻译和自然语言处理的伦理考虑的现有文献。然后，我们进行并分析了一项访谈研究，以阐明社区领袖、教师和语言活动家对其语言自动翻译的伦理问题的立场。我们的研究结果表明，以不同程度的方式包含本土说话者和社区成员对执行此操作至关重要。",
    "tldr": "机器翻译原住民语言涉及到伦理问题，包括数据采集、建模和部署机器翻译系统。本研究通过对现有文献进行调查和访谈调查社区领袖、教师和语言活动家，提出了需要纳入本土说话者和社区成员的伦理考虑。",
    "en_tdlr": "Machine translation of indigenous languages raises ethical questions related to data collection, modeling, and deployment of these systems. This study surveys existing literature and conducts interviews with community leaders, teachers, and language activists to highlight the need for ethical considerations that include native speakers and community members."
}