{
    "title": "Deep Transductive Transfer Learning for Automatic Target Recognition. (arXiv:2305.13886v1 [cs.CV])",
    "abstract": "One of the major obstacles in designing an automatic target recognition (ATR) algorithm, is that there are often labeled images in one domain (i.e., infrared source domain) but no annotated images in the other target domains (i.e., visible, SAR, LIDAR). Therefore, automatically annotating these images is essential to build a robust classifier in the target domain based on the labeled images of the source domain. Transductive transfer learning is an effective way to adapt a network to a new target domain by utilizing a pretrained ATR network in the source domain. We propose an unpaired transductive transfer learning framework where a CycleGAN model and a well-trained ATR classifier in the source domain are used to construct an ATR classifier in the target domain without having any labeled data in the target domain. We employ a CycleGAN model to transfer the mid-wave infrared (MWIR) images to visible (VIS) domain images (or visible to MWIR domain). To train the transductive CycleGAN, we ",
    "link": "http://arxiv.org/abs/2305.13886",
    "context": "Title: Deep Transductive Transfer Learning for Automatic Target Recognition. (arXiv:2305.13886v1 [cs.CV])\nAbstract: One of the major obstacles in designing an automatic target recognition (ATR) algorithm, is that there are often labeled images in one domain (i.e., infrared source domain) but no annotated images in the other target domains (i.e., visible, SAR, LIDAR). Therefore, automatically annotating these images is essential to build a robust classifier in the target domain based on the labeled images of the source domain. Transductive transfer learning is an effective way to adapt a network to a new target domain by utilizing a pretrained ATR network in the source domain. We propose an unpaired transductive transfer learning framework where a CycleGAN model and a well-trained ATR classifier in the source domain are used to construct an ATR classifier in the target domain without having any labeled data in the target domain. We employ a CycleGAN model to transfer the mid-wave infrared (MWIR) images to visible (VIS) domain images (or visible to MWIR domain). To train the transductive CycleGAN, we ",
    "path": "papers/23/05/2305.13886.json",
    "total_tokens": 1023,
    "translated_title": "深度传递迁移学习用于自动目标识别",
    "translated_abstract": "自动目标识别算法的一个主要障碍是通常存在一个领域（红外源领域）中有标记的图像，但在其他目标领域（如可见、SAR、LIDAR）中没有注释的图像。因此，自动注释这些图像对于基于源领域标记图像构建目标领域的强大分类器至关重要。传递迁移学习是一种有效的方法，通过利用在源域中预训练的自动目标识别网络来使网络适应一个新的目标领域。我们提出了一种无配对传递迁移学习框架，其中使用CycleGAN模型和源域中训练良好的ATR分类器来构建目标域的ATR分类器，而不需要目标域中的任何标记数据。我们使用CycleGAN模型将中波红外（MWIR）图像转换为可见（VIS）域图像（或可见图像到MWIR域）。为了训练传递迁移学习，我们使用相位一致性损失和感知损失。实验结果表明，我们的方法在各种目标识别场景中都取得了最佳性能。",
    "tldr": "提出了一种无配对传递迁移学习框架，使用CycleGAN模型将中波红外（MWIR）图像转换为可见（VIS）域图像（或可见图像到MWIR域），实验结果表明该方法在各种目标识别场景中都取得了最佳性能。"
}