{
    "title": "A Confidence-based Partial Label Learning Model for Crowd-Annotated Named Entity Recognition. (arXiv:2305.12485v2 [cs.CL] UPDATED)",
    "abstract": "Existing models for named entity recognition (NER) are mainly based on large-scale labeled datasets, which always obtain using crowdsourcing. However, it is hard to obtain a unified and correct label via majority voting from multiple annotators for NER due to the large labeling space and complexity of this task. To address this problem, we aim to utilize the original multi-annotator labels directly. Particularly, we propose a Confidence-based Partial Label Learning (CPLL) method to integrate the prior confidence (given by annotators) and posterior confidences (learned by models) for crowd-annotated NER. This model learns a token- and content-dependent confidence via an Expectation-Maximization (EM) algorithm by minimizing empirical risk. The true posterior estimator and confidence estimator perform iteratively to update the true posterior and confidence respectively. We conduct extensive experimental results on both real-world and synthetic datasets, which show that our model can impro",
    "link": "http://arxiv.org/abs/2305.12485",
    "context": "Title: A Confidence-based Partial Label Learning Model for Crowd-Annotated Named Entity Recognition. (arXiv:2305.12485v2 [cs.CL] UPDATED)\nAbstract: Existing models for named entity recognition (NER) are mainly based on large-scale labeled datasets, which always obtain using crowdsourcing. However, it is hard to obtain a unified and correct label via majority voting from multiple annotators for NER due to the large labeling space and complexity of this task. To address this problem, we aim to utilize the original multi-annotator labels directly. Particularly, we propose a Confidence-based Partial Label Learning (CPLL) method to integrate the prior confidence (given by annotators) and posterior confidences (learned by models) for crowd-annotated NER. This model learns a token- and content-dependent confidence via an Expectation-Maximization (EM) algorithm by minimizing empirical risk. The true posterior estimator and confidence estimator perform iteratively to update the true posterior and confidence respectively. We conduct extensive experimental results on both real-world and synthetic datasets, which show that our model can impro",
    "path": "papers/23/05/2305.12485.json",
    "total_tokens": 955,
    "translated_title": "基于置信度的部分标签学习模型用于群体注释的命名实体识别",
    "translated_abstract": "现有的命名实体识别（NER）模型主要基于大规模标记数据集，这些数据集通常是通过众包获得的。然而，由于标注空间的广泛性和任务的复杂性，很难通过多个标注者的多数表决获得统一且正确的标签。为了解决这个问题，我们旨在直接利用原始的多标注者标签。具体而言，我们提出了一种基于置信度的部分标签学习（CPLL）方法，用于集成注释者提供的先验置信度和模型学习的后验置信度，用于群体注释的NER。该模型通过最小化经验风险，通过期望最大化（EM）算法学习一个基于标记和内容的置信度。真实后验估计器和置信度估计器通过迭代更新真实后验和置信度。我们在真实和合成数据集上进行了大量实验，结果表明我们的模型可以提高命名实体识别的性能。",
    "tldr": "本论文提出了一种基于置信度的部分标签学习方法（CPLL）用于群体注释的命名实体识别。该模型通过迭代更新真实后验和置信度，通过最小化经验风险学习一个基于标记和内容的置信度，实验结果表明该方法能够提高NER的性能。",
    "en_tdlr": "This paper proposes a Confidence-based Partial Label Learning method (CPLL) for crowd-annotated Named Entity Recognition (NER). The model iteratively updates the true posterior and confidence by minimizing empirical risk, and learns a token- and content-dependent confidence through an Expectation-Maximization algorithm. Experimental results demonstrate that this method improves the performance of NER."
}