{
    "title": "Training Is Everything: Artificial Intelligence, Copyright, and Fair Training. (arXiv:2305.03720v1 [cs.CY])",
    "abstract": "To learn how to behave, the current revolutionary generation of AIs must be trained on vast quantities of published images, written works, and sounds, many of which fall within the core subject matter of copyright law. To some, the use of copyrighted works as training sets for AI is merely a transitory and non-consumptive use that does not materially interfere with owners' content or copyrights protecting it. Companies that use such content to train their AI engine often believe such usage should be considered \"fair use\" under United States law (sometimes known as \"fair dealing\" in other countries). By contrast, many copyright owners, as well as their supporters, consider the incorporation of copyrighted works into training sets for AI to constitute misappropriation of owners' intellectual property, and, thus, decidedly not fair use under the law. This debate is vital to the future trajectory of AI and its applications.  In this article, we analyze the arguments in favor of, and agains",
    "link": "http://arxiv.org/abs/2305.03720",
    "context": "Title: Training Is Everything: Artificial Intelligence, Copyright, and Fair Training. (arXiv:2305.03720v1 [cs.CY])\nAbstract: To learn how to behave, the current revolutionary generation of AIs must be trained on vast quantities of published images, written works, and sounds, many of which fall within the core subject matter of copyright law. To some, the use of copyrighted works as training sets for AI is merely a transitory and non-consumptive use that does not materially interfere with owners' content or copyrights protecting it. Companies that use such content to train their AI engine often believe such usage should be considered \"fair use\" under United States law (sometimes known as \"fair dealing\" in other countries). By contrast, many copyright owners, as well as their supporters, consider the incorporation of copyrighted works into training sets for AI to constitute misappropriation of owners' intellectual property, and, thus, decidedly not fair use under the law. This debate is vital to the future trajectory of AI and its applications.  In this article, we analyze the arguments in favor of, and agains",
    "path": "papers/23/05/2305.03720.json",
    "total_tokens": 1165,
    "translated_title": "训练才是一切：人工智能、版权和公平训练",
    "translated_abstract": "为了学习行为，当前这一代革命性的人工智能必须在海量的出版图像、文字和声音中进行训练，其中很多属于版权法的核心内容。一些人认为，将版权作品用作AI的训练集只是一种过渡性的、非消耗性的使用，不会对所有者的内容或保护其版权的著作权产生实质性的干扰。使用这种内容来训练他们的AI引擎的公司通常认为，这种使用应该被视为美国法律下的“公平使用”（在其他国家有时被称为“公平使用”）。相比之下，许多版权所有者及其支持者认为，将版权作品纳入AI的训练集中构成了对所有者知识产权的盗用，因此显然不是法律下的公平使用。这场辩论对于AI及其应用的未来轨迹至关重要。在本文中，我们分析了在版权法中公平使用的情况下，使用版权作品训练AI引擎的论点，探讨了各种方法的法律和政策影响，包括许可和补偿，以及对文化和创意表达的潜在危害。最终，我们主张，平衡AI开发者、版权所有者和整个社会的利益和权利需要一种细致而灵活的方法，认识到训练在开发有效的AI系统方面的重要性。",
    "tldr": "本文讨论了在版权法中公正使用版权作品进行人工智能训练的问题，探讨了许可和补偿等方法，强调平衡AI开发者、版权所有者和整个社会的利益和权利需要一种细致而灵活的方法。",
    "en_tdlr": "This article discusses the issue of fair use of copyrighted works for training artificial intelligence in copyright law, exploring methods such as licensing and compensation, and emphasizing the need for a nuanced and flexible approach to balancing the interests and rights of AI developers, copyright owners, and society as a whole."
}