{
    "title": "Robust Tensor CUR Decompositions: Rapid Low-Tucker-Rank Tensor Recovery with Sparse Corruption. (arXiv:2305.04080v1 [math.NA])",
    "abstract": "We study the tensor robust principal component analysis (TRPCA) problem, a tensorial extension of matrix robust principal component analysis (RPCA), that aims to split the given tensor into an underlying low-rank component and a sparse outlier component. This work proposes a fast algorithm, called Robust Tensor CUR Decompositions (RTCUR), for large-scale non-convex TRPCA problems under the Tucker rank setting. RTCUR is developed within a framework of alternating projections that projects between the set of low-rank tensors and the set of sparse tensors. We utilize the recently developed tensor CUR decomposition to substantially reduce the computational complexity in each projection. In addition, we develop four variants of RTCUR for different application settings. We demonstrate the effectiveness and computational advantages of RTCUR against state-of-the-art methods on both synthetic and real-world datasets.",
    "link": "http://arxiv.org/abs/2305.04080",
    "context": "Title: Robust Tensor CUR Decompositions: Rapid Low-Tucker-Rank Tensor Recovery with Sparse Corruption. (arXiv:2305.04080v1 [math.NA])\nAbstract: We study the tensor robust principal component analysis (TRPCA) problem, a tensorial extension of matrix robust principal component analysis (RPCA), that aims to split the given tensor into an underlying low-rank component and a sparse outlier component. This work proposes a fast algorithm, called Robust Tensor CUR Decompositions (RTCUR), for large-scale non-convex TRPCA problems under the Tucker rank setting. RTCUR is developed within a framework of alternating projections that projects between the set of low-rank tensors and the set of sparse tensors. We utilize the recently developed tensor CUR decomposition to substantially reduce the computational complexity in each projection. In addition, we develop four variants of RTCUR for different application settings. We demonstrate the effectiveness and computational advantages of RTCUR against state-of-the-art methods on both synthetic and real-world datasets.",
    "path": "papers/23/05/2305.04080.json",
    "total_tokens": 936,
    "translated_title": "鲁棒性张量CUR分解：对稀疏损坏进行快速低Tucker秩张量恢复。",
    "translated_abstract": "我们研究了张量鲁棒主成分分析（TRPCA）问题，它是矩阵鲁棒主成分分析（RPCA）的张量扩展，旨在将给定的张量分解为基础低秩分量和稀疏异常分量。本文提出了一种快速算法，称为鲁棒性张量CUR分解（RTCUR），用于Tucker秩设置下的大规模非凸TRPCA问题。RTCUR是在交替投影的框架下开发出来的，它在低秩张量集和稀疏张量集之间进行投影。我们利用最近开发的张量CUR分解，在每个投影中大大降低了计算复杂度。此外，我们为不同的应用场景开发了四个RTCUR变体。我们在合成和实际数据集上展示了RTCUR的有效性和计算优势，以对抗最先进的方法。",
    "tldr": "本文提出了一种快速算法，称为鲁棒性张量CUR分解（RTCUR），用于Tucker秩设置下的大规模非凸TRPCA问题，通过交替投影的框架和张量CUR分解，快速实现对稀疏损坏的低秩张量恢复，并在实际数据集上展示了该方法的有效性和计算优势。",
    "en_tdlr": "This paper proposes a fast algorithm, called Robust Tensor CUR Decompositions (RTCUR), for large-scale non-convex TRPCA problems under the Tucker rank setting, which utilizes the framework of alternating projections and tensor CUR decomposition to achieve rapid low-Tucker-rank tensor recovery with sparse corruption, and shows its effectiveness and computational advantages on both synthetic and real-world datasets."
}