{
    "title": "Robust Natural Language Watermarking through Invariant Features. (arXiv:2305.01904v1 [cs.CL])",
    "abstract": "Recent years have witnessed a proliferation of valuable original natural language contents found in subscription-based media outlets, web novel platforms, and outputs of large language models. Without proper security measures, however, these contents are susceptible to illegal piracy and potential misuse. This calls for a secure watermarking system to guarantee copyright protection through leakage tracing or ownership identification. To effectively combat piracy and protect copyrights, a watermarking framework should be able not only to embed adequate bits of information but also extract the watermarks in a robust manner despite possible corruption. In this work, we explore ways to advance both payload and robustness by following a well-known proposition from image watermarking and identify features in natural language that are invariant to minor corruption. Through a systematic analysis of the possible sources of errors, we further propose a corruption-resistant infill model. Our full",
    "link": "http://arxiv.org/abs/2305.01904",
    "context": "Title: Robust Natural Language Watermarking through Invariant Features. (arXiv:2305.01904v1 [cs.CL])\nAbstract: Recent years have witnessed a proliferation of valuable original natural language contents found in subscription-based media outlets, web novel platforms, and outputs of large language models. Without proper security measures, however, these contents are susceptible to illegal piracy and potential misuse. This calls for a secure watermarking system to guarantee copyright protection through leakage tracing or ownership identification. To effectively combat piracy and protect copyrights, a watermarking framework should be able not only to embed adequate bits of information but also extract the watermarks in a robust manner despite possible corruption. In this work, we explore ways to advance both payload and robustness by following a well-known proposition from image watermarking and identify features in natural language that are invariant to minor corruption. Through a systematic analysis of the possible sources of errors, we further propose a corruption-resistant infill model. Our full",
    "path": "papers/23/05/2305.01904.json",
    "total_tokens": 811,
    "translated_abstract": "近年来，基于订阅媒体、网络小说平台及大语言模型生成的原创自然语言内容大量涌现。然而，如果没有适当的安全措施，这些内容易被盗版或滥用，因此需要一种安全的水印技术保证版权保护、追踪泄漏或确认所有权。为了有效对抗盗版和保护版权，水印框架应该能够嵌入充足的信息，同时尽可能鲁棒地提取水印，抵御各种可能的损坏。在此工作中，我们探索了一种从图像水印技术中已知的命题出发，通过识别自然语言中的不变特征来提高嵌入容量和鲁棒性。我们还通过对可能的错误来源进行系统分析，提出了一种抗损坏的补全模型。",
    "tldr": "本文提出了一种基于自然语言不变特征的水印技术，通过抗损坏的策略来提高水印嵌入量和提取鲁棒性。"
}