{
    "title": "\"What do others think?\": Task-Oriented Conversational Modeling with Subjective Knowledge. (arXiv:2305.12091v1 [cs.CL])",
    "abstract": "Task-oriented Dialogue (TOD) Systems aim to build dialogue systems that assist users in accomplishing specific goals, such as booking a hotel or a restaurant. Traditional TODs rely on domain-specific APIs/DBs or external factual knowledge to generate responses, which cannot accommodate subjective user requests (e.g., \"Is the WIFI reliable?\" or \"Does the restaurant have a good atmosphere?\"). To address this issue, we propose a novel task of subjective-knowledge-based TOD (SK-TOD). We also propose the first corresponding dataset, which contains subjective knowledge-seeking dialogue contexts and manually annotated responses grounded in subjective knowledge sources. When evaluated with existing TOD approaches, we find that this task poses new challenges such as aggregating diverse opinions from multiple knowledge snippets. We hope this task and dataset can promote further research on TOD and subjective content understanding. The code and the dataset are available at https://github.com/alex",
    "link": "http://arxiv.org/abs/2305.12091",
    "context": "Title: \"What do others think?\": Task-Oriented Conversational Modeling with Subjective Knowledge. (arXiv:2305.12091v1 [cs.CL])\nAbstract: Task-oriented Dialogue (TOD) Systems aim to build dialogue systems that assist users in accomplishing specific goals, such as booking a hotel or a restaurant. Traditional TODs rely on domain-specific APIs/DBs or external factual knowledge to generate responses, which cannot accommodate subjective user requests (e.g., \"Is the WIFI reliable?\" or \"Does the restaurant have a good atmosphere?\"). To address this issue, we propose a novel task of subjective-knowledge-based TOD (SK-TOD). We also propose the first corresponding dataset, which contains subjective knowledge-seeking dialogue contexts and manually annotated responses grounded in subjective knowledge sources. When evaluated with existing TOD approaches, we find that this task poses new challenges such as aggregating diverse opinions from multiple knowledge snippets. We hope this task and dataset can promote further research on TOD and subjective content understanding. The code and the dataset are available at https://github.com/alex",
    "path": "papers/23/05/2305.12091.json",
    "total_tokens": 907,
    "translated_title": "主观知识驱动的任务导向式对话建模",
    "translated_abstract": "任务导向式对话系统的目标是建立能够帮助用户完成特定目标的对话系统，例如预定酒店或餐厅。传统的任务导向式对话系统依赖于特定领域的API/数据库或外部事实知识来生成响应，无法满足主观用户请求（例如“Wi-Fi可靠吗？”或“餐厅环境好吗？”）。为了解决这个问题，我们提出了一个新颖的主观知识驱动的任务导向式对话建模（SK-TOD）任务。我们还提出了第一个相应的数据集，其中包含主观知识寻求对话上下文和手动注释的基于主观知识来源的响应。在与现有的任务导向式对话方法进行评估时，我们发现这个任务带来了新的挑战，如如何汇总多个知识片段中的不同意见。我们希望这个任务和数据集能促进进一步的任务导向式对话和主观内容理解的研究。代码和数据集可以在 https://github.com/alex 上找到。",
    "tldr": "该研究提出了一种主观知识驱动的任务导向式对话建模方法，并制作了相应数据集。该方法面临着新的挑战，例如如何汇总多个知识片段中的不同意见。"
}