{
    "title": "ChatGPT to Replace Crowdsourcing of Paraphrases for Intent Classification: Higher Diversity and Comparable Model Robustness. (arXiv:2305.12947v2 [cs.CL] UPDATED)",
    "abstract": "The emergence of generative large language models (LLMs) raises the question: what will be its impact on crowdsourcing? Traditionally, crowdsourcing has been used for acquiring solutions to a wide variety of human-intelligence tasks, including ones involving text generation, modification or evaluation. For some of these tasks, models like ChatGPT can potentially substitute human workers. In this study, we investigate whether this is the case for the task of paraphrase generation for intent classification. We apply data collection methodology of an existing crowdsourcing study (similar scale, prompts and seed data) using ChatGPT and Falcon-40B. We show that ChatGPT-created paraphrases are more diverse and lead to at least as robust models.",
    "link": "http://arxiv.org/abs/2305.12947",
    "context": "Title: ChatGPT to Replace Crowdsourcing of Paraphrases for Intent Classification: Higher Diversity and Comparable Model Robustness. (arXiv:2305.12947v2 [cs.CL] UPDATED)\nAbstract: The emergence of generative large language models (LLMs) raises the question: what will be its impact on crowdsourcing? Traditionally, crowdsourcing has been used for acquiring solutions to a wide variety of human-intelligence tasks, including ones involving text generation, modification or evaluation. For some of these tasks, models like ChatGPT can potentially substitute human workers. In this study, we investigate whether this is the case for the task of paraphrase generation for intent classification. We apply data collection methodology of an existing crowdsourcing study (similar scale, prompts and seed data) using ChatGPT and Falcon-40B. We show that ChatGPT-created paraphrases are more diverse and lead to at least as robust models.",
    "path": "papers/23/05/2305.12947.json",
    "total_tokens": 816,
    "translated_title": "ChatGPT取代众包生成意图分类的改写指令：更高的多样性和可比较的模型鲁棒性",
    "translated_abstract": "生成式大语言模型（LLMs）的出现引发了一个问题：它对众包的影响会是什么？传统上，众包被用于获取各种人工智能任务的解决方案，包括涉及文本生成、修改或评估的任务。对于其中一些任务，像ChatGPT这样的模型有可能替代人工工作者。在本研究中，我们探讨了ChatGPT是否适用于生成意图分类的改写指令的任务。我们采用了一个现有众包研究的数据收集方法（相似的规模、提示信息和种子数据），使用ChatGPT和Falcon-40B进行实验。我们证明了ChatGPT生成的改写指令更多样化，并且产生的模型至少具有同样的鲁棒性。",
    "tldr": "本研究探讨了使用ChatGPT替代众包生成意图分类的改写指令的可行性，结果显示ChatGPT生成的改写指令更加多样化，并且所得模型具有至少相同的鲁棒性。"
}