{
    "title": "LLM-empowered Chatbots for Psychiatrist and Patient Simulation: Application and Evaluation. (arXiv:2305.13614v1 [cs.CL])",
    "abstract": "Empowering chatbots in the field of mental health is receiving increasing amount of attention, while there still lacks exploration in developing and evaluating chatbots in psychiatric outpatient scenarios. In this work, we focus on exploring the potential of ChatGPT in powering chatbots for psychiatrist and patient simulation. We collaborate with psychiatrists to identify objectives and iteratively develop the dialogue system to closely align with real-world scenarios. In the evaluation experiments, we recruit real psychiatrists and patients to engage in diagnostic conversations with the chatbots, collecting their ratings for assessment. Our findings demonstrate the feasibility of using ChatGPT-powered chatbots in psychiatric scenarios and explore the impact of prompt designs on chatbot behavior and user experience.",
    "link": "http://arxiv.org/abs/2305.13614",
    "context": "Title: LLM-empowered Chatbots for Psychiatrist and Patient Simulation: Application and Evaluation. (arXiv:2305.13614v1 [cs.CL])\nAbstract: Empowering chatbots in the field of mental health is receiving increasing amount of attention, while there still lacks exploration in developing and evaluating chatbots in psychiatric outpatient scenarios. In this work, we focus on exploring the potential of ChatGPT in powering chatbots for psychiatrist and patient simulation. We collaborate with psychiatrists to identify objectives and iteratively develop the dialogue system to closely align with real-world scenarios. In the evaluation experiments, we recruit real psychiatrists and patients to engage in diagnostic conversations with the chatbots, collecting their ratings for assessment. Our findings demonstrate the feasibility of using ChatGPT-powered chatbots in psychiatric scenarios and explore the impact of prompt designs on chatbot behavior and user experience.",
    "path": "papers/23/05/2305.13614.json",
    "total_tokens": 863,
    "translated_title": "基于LLM技术的精神病医生和患者模拟聊天机器人的应用与评估",
    "translated_abstract": "在精神健康领域，赋能聊天机器人正越来越受到关注，然而在精神科门诊场景下，开发和评估聊天机器人仍然缺乏探索。本作品聚焦于探索利用ChatGPT技术赋能聊天机器人在精神病医生和患者模拟方面的潜力。我们与精神病医生合作，确定目标并逐步开发对话系统，紧密结合现实场景。在评估实验中，我们邀请真正的精神病医生和患者与聊天机器人进行诊断性对话，收集他们的评分以进行评估。我们的发现证明了在精神科场景中使用ChatGPT技术赋能聊天机器人的可行性，并探索了提示设计对聊天机器人行为和用户体验的影响。",
    "tldr": "本研究聚焦于探索利用ChatGPT技术赋能聊天机器人在精神病医生和患者模拟方面的潜力，并证明了在精神科场景中使用ChatGPT技术赋能聊天机器人的可行性。",
    "en_tdlr": "This study focuses on exploring the potential of ChatGPT technology in empowering chatbots for psychiatrist and patient simulation, and demonstrates the feasibility of using ChatGPT-powered chatbots in psychiatric scenarios."
}