{
    "title": "Explainable Reinforcement Learning via a Causal World Model. (arXiv:2305.02749v1 [cs.LG])",
    "abstract": "Generating explanations for reinforcement learning (RL) is challenging as actions may produce long-term effects on the future. In this paper, we develop a novel framework for explainable RL by learning a causal world model without prior knowledge of the causal structure of the environment. The model captures the influence of actions, allowing us to interpret the long-term effects of actions through causal chains, which present how actions influence environmental variables and finally lead to rewards. Different from most explanatory models which suffer from low accuracy, our model remains accurate while improving explainability, making it applicable in model-based learning. As a result, we demonstrate that our causal model can serve as the bridge between explainability and learning.",
    "link": "http://arxiv.org/abs/2305.02749",
    "context": "Title: Explainable Reinforcement Learning via a Causal World Model. (arXiv:2305.02749v1 [cs.LG])\nAbstract: Generating explanations for reinforcement learning (RL) is challenging as actions may produce long-term effects on the future. In this paper, we develop a novel framework for explainable RL by learning a causal world model without prior knowledge of the causal structure of the environment. The model captures the influence of actions, allowing us to interpret the long-term effects of actions through causal chains, which present how actions influence environmental variables and finally lead to rewards. Different from most explanatory models which suffer from low accuracy, our model remains accurate while improving explainability, making it applicable in model-based learning. As a result, we demonstrate that our causal model can serve as the bridge between explainability and learning.",
    "path": "papers/23/05/2305.02749.json",
    "total_tokens": 778,
    "translated_title": "通过因果世界模型实现可解释强化学习",
    "translated_abstract": "给强化学习提供解释是一项挑战，因为行动可能对未来产生长期影响。本文提出了一种新的可解释强化学习框架：通过学习一个因果世界模型而不预先知道环境的因果结构。该模型捕捉到动作的影响，使我们能够通过因果链来解释行动的长期影响，从而揭示出行动是如何影响环境变量并最终导致奖励的。与大多数解释性模型的低准确性不同，我们的模型保持高准确性的同时提高了解释性，使其适用于基于模型的学习。因此，我们证明了我们的因果模型可以成为解释性和学习之间的桥梁。",
    "tldr": "本文提出了一种新的可解释强化学习框架，通过学习因果世界模型来解释行动的长期影响以及教学习者如何影响环境变量并最终导致奖励。",
    "en_tdlr": "This paper proposes a novel framework for explainable reinforcement learning by learning a causal world model which captures the influence of actions and interprets their long-term effects through causal chains, making it a bridge between explainability and learning."
}