{
    "title": "OL-Transformer: A Fast and Universal Surrogate Simulator for Optical Multilayer Thin Film Structures. (arXiv:2305.11984v1 [cs.LG])",
    "abstract": "Deep learning-based methods have recently been established as fast and accurate surrogate simulators for optical multilayer thin film structures. However, existing methods only work for limited types of structures with different material arrangements, preventing their applications towards diverse and universal structures. Here, we propose the Opto-Layer (OL) Transformer to act as a universal surrogate simulator for enormous types of structures. Combined with the technique of structure serialization, our model can predict accurate reflection and transmission spectra for up to $10^{25}$ different multilayer structures, while still achieving a six-fold time speedup compared to physical solvers. Further investigation reveals that the general learning ability comes from the fact that our model first learns the physical embeddings and then uses the self-attention mechanism to capture the hidden relationship of light-matter interaction between each layer.",
    "link": "http://arxiv.org/abs/2305.11984",
    "context": "Title: OL-Transformer: A Fast and Universal Surrogate Simulator for Optical Multilayer Thin Film Structures. (arXiv:2305.11984v1 [cs.LG])\nAbstract: Deep learning-based methods have recently been established as fast and accurate surrogate simulators for optical multilayer thin film structures. However, existing methods only work for limited types of structures with different material arrangements, preventing their applications towards diverse and universal structures. Here, we propose the Opto-Layer (OL) Transformer to act as a universal surrogate simulator for enormous types of structures. Combined with the technique of structure serialization, our model can predict accurate reflection and transmission spectra for up to $10^{25}$ different multilayer structures, while still achieving a six-fold time speedup compared to physical solvers. Further investigation reveals that the general learning ability comes from the fact that our model first learns the physical embeddings and then uses the self-attention mechanism to capture the hidden relationship of light-matter interaction between each layer.",
    "path": "papers/23/05/2305.11984.json",
    "total_tokens": 877,
    "translated_title": "OL-Transformer：用于光学多层薄膜结构的快速通用代理模拟器",
    "translated_abstract": "基于深度学习的方法最近被证明是用于光学多层薄膜结构的快速准确的代理模拟器。然而，现有的方法仅适用于具有不同材料排列方式的有限类型的结构，限制了它们向多样化和通用化结构的应用。在这里，我们提出了Opto-Layer（OL）Transformer作为巨量结构的通用替代模拟器。结合结构序列化技术，我们的模型可以预测多达$10^{25}$种不同多层结构的精确反射和透射光谱，同时相较于物理求解器仍然实现了6倍时间加速。进一步的研究表明，普遍的学习能力来自于我们的模型首先学习物理嵌入，然后使用自我注意机制来捕捉每层之间的光物质相互作用的隐藏关系。",
    "tldr": "该论文提出了OL-Transformer用于光学多层薄膜结构，可以预测多达$10^{25}$种不同多层结构的精确反射和透射光谱，同时具有快速的计算速度。",
    "en_tdlr": "The OL-Transformer is proposed as a universal surrogate simulator for enormous types of optical multilayer thin film structures, which can predict accurate reflection and transmission spectra for up to $10^{25}$ different multilayer structures, while still achieving a fast computational speed."
}