{
    "title": "Duality in Multi-View Restricted Kernel Machines. (arXiv:2305.17251v1 [cs.LG])",
    "abstract": "We propose a unifying setting that combines existing restricted kernel machine methods into a single primal-dual multi-view framework for kernel principal component analysis in both supervised and unsupervised settings. We derive the primal and dual representations of the framework and relate different training and inference algorithms from a theoretical perspective. We show how to achieve full equivalence in primal and dual formulations by rescaling primal variables. Finally, we experimentally validate the equivalence and provide insight into the relationships between different methods on a number of time series data sets by recursively forecasting unseen test data and visualizing the learned features.",
    "link": "http://arxiv.org/abs/2305.17251",
    "context": "Title: Duality in Multi-View Restricted Kernel Machines. (arXiv:2305.17251v1 [cs.LG])\nAbstract: We propose a unifying setting that combines existing restricted kernel machine methods into a single primal-dual multi-view framework for kernel principal component analysis in both supervised and unsupervised settings. We derive the primal and dual representations of the framework and relate different training and inference algorithms from a theoretical perspective. We show how to achieve full equivalence in primal and dual formulations by rescaling primal variables. Finally, we experimentally validate the equivalence and provide insight into the relationships between different methods on a number of time series data sets by recursively forecasting unseen test data and visualizing the learned features.",
    "path": "papers/23/05/2305.17251.json",
    "total_tokens": 762,
    "translated_title": "多角度受限制内核机器的对偶性",
    "translated_abstract": "我们提出了一个统一的框架，将现有的受限制内核机器方法结合成一个单一的原始-对偶多角度框架，用于核主成分分析，可以用于有监督和无监督学习。我们导出了该框架的原始和对偶表示，并从理论角度关联了不同的训练和推理算法。我们展示了如何通过重新调整原始变量来实现原始和对偶公式的完全等价性。最后，我们通过递归预测未看到测试数据并可视化所学特征的方式，在许多时间序列数据集上实验验证了等价性并提供了对不同方法之间关系的洞察。",
    "tldr": "该论文提出了一个统一的框架，将现有的受限制内核机器方法结合成一个单一的原始-对偶多角度框架，可用于核主成分分析，实现了原始和对偶公式的完全等价性，并最终在时间序列数据集上验证了其等价性和提供的洞察。",
    "en_tdlr": "This paper proposes a unified framework that combines existing restricted kernel machine methods into a single primal-dual multi-view framework for kernel principal component analysis. The paper achieves full equivalence in primal and dual formulations, and validates the equivalence experimentally on time series data sets while offering insights into relationships between different methods."
}