{
    "title": "iLab at SemEval-2023 Task 11 Le-Wi-Di: Modelling Disagreement or Modelling Perspectives?. (arXiv:2305.06074v1 [cs.CL])",
    "abstract": "There are two competing approaches for modelling annotator disagreement: distributional soft-labelling approaches (which aim to capture the level of disagreement) or modelling perspectives of individual annotators or groups thereof. We adapt a multi-task architecture -- which has previously shown success in modelling perspectives -- to evaluate its performance on the SEMEVAL Task 11. We do so by combining both approaches, i.e. predicting individual annotator perspectives as an interim step towards predicting annotator disagreement. Despite its previous success, we found that a multi-task approach performed poorly on datasets which contained distinct annotator opinions, suggesting that this approach may not always be suitable when modelling perspectives. Furthermore, our results explain that while strongly perspectivist approaches might not achieve state-of-the-art performance according to evaluation metrics used by distributional approaches, our approach allows for a more nuanced under",
    "link": "http://arxiv.org/abs/2305.06074",
    "context": "Title: iLab at SemEval-2023 Task 11 Le-Wi-Di: Modelling Disagreement or Modelling Perspectives?. (arXiv:2305.06074v1 [cs.CL])\nAbstract: There are two competing approaches for modelling annotator disagreement: distributional soft-labelling approaches (which aim to capture the level of disagreement) or modelling perspectives of individual annotators or groups thereof. We adapt a multi-task architecture -- which has previously shown success in modelling perspectives -- to evaluate its performance on the SEMEVAL Task 11. We do so by combining both approaches, i.e. predicting individual annotator perspectives as an interim step towards predicting annotator disagreement. Despite its previous success, we found that a multi-task approach performed poorly on datasets which contained distinct annotator opinions, suggesting that this approach may not always be suitable when modelling perspectives. Furthermore, our results explain that while strongly perspectivist approaches might not achieve state-of-the-art performance according to evaluation metrics used by distributional approaches, our approach allows for a more nuanced under",
    "path": "papers/23/05/2305.06074.json",
    "total_tokens": 1030,
    "translated_title": "SemEval-2023任务11中的iLab Le-Wi-Di：模拟不一致性还是模拟观点？",
    "translated_abstract": "对于建模注释者不一致性，有两种竞争的方法：分布式软标记方法（旨在捕捉不一致程度）或建模个体注释者或其组的观点。我们采用了一个先前在建模观点方面表现成功的多任务架构，对SEMEVAL任务11的性能进行评估。我们将两种方法结合起来，即预测个别注释者的观点作为预测注释者不一致性的过渡步骤。尽管此方法之前表现良好，但我们发现在包含不同注释者观点的数据集上，多任务方法的表现不佳，这表明这种方法在建模观点时可能并不总是适用的。此外，我们的结果表明，虽然强烈的观点主义方法可能不会根据分布式方法使用的评估指标取得最先进的性能，但我们的方法允许更细致的理解注释者不一致性，并可以导致更准确的观点建模。",
    "tldr": "本文讨论了建模注释者不一致性的两种方法：分布式软标记方法和建模个体注释者或其组的观点。本文通过将两种方法结合起来的方式来模拟注释者不一致性。尽管多任务方法之前表现良好，但我们发现其在包含不同注释者观点的数据集上表现不佳。研究结果表明，该方法可以更细致地理解注释者不一致性，为更准确的观点建模提供可能。"
}