{
    "title": "Exploring the Protein Sequence Space with Global Generative Models. (arXiv:2305.01941v1 [q-bio.BM])",
    "abstract": "Recent advancements in specialized large-scale architectures for training image and language have profoundly impacted the field of computer vision and natural language processing (NLP). Language models, such as the recent ChatGPT and GPT4 have demonstrated exceptional capabilities in processing, translating, and generating human languages. These breakthroughs have also been reflected in protein research, leading to the rapid development of numerous new methods in a short time, with unprecedented performance. Language models, in particular, have seen widespread use in protein research, as they have been utilized to embed proteins, generate novel ones, and predict tertiary structures. In this book chapter, we provide an overview of the use of protein generative models, reviewing 1) language models for the design of novel artificial proteins, 2) works that use non-Transformer architectures, and 3) applications in directed evolution approaches.",
    "link": "http://arxiv.org/abs/2305.01941",
    "context": "Title: Exploring the Protein Sequence Space with Global Generative Models. (arXiv:2305.01941v1 [q-bio.BM])\nAbstract: Recent advancements in specialized large-scale architectures for training image and language have profoundly impacted the field of computer vision and natural language processing (NLP). Language models, such as the recent ChatGPT and GPT4 have demonstrated exceptional capabilities in processing, translating, and generating human languages. These breakthroughs have also been reflected in protein research, leading to the rapid development of numerous new methods in a short time, with unprecedented performance. Language models, in particular, have seen widespread use in protein research, as they have been utilized to embed proteins, generate novel ones, and predict tertiary structures. In this book chapter, we provide an overview of the use of protein generative models, reviewing 1) language models for the design of novel artificial proteins, 2) works that use non-Transformer architectures, and 3) applications in directed evolution approaches.",
    "path": "papers/23/05/2305.01941.json",
    "total_tokens": 861,
    "translated_title": "用全局生成模型探索蛋白质序列空间",
    "translated_abstract": "最近，训练图像和语言的专用大规模架构的进步深刻地影响了计算机视觉和自然语言处理领域。语言模型，例如最近的ChatGPT和GPT4，在处理、翻译和生成人类语言方面表现出了卓越的能力。这些突破也反映在蛋白质研究中，导致了短时间内许多新方法的迅速发展，表现出了前所未有的性能。特别是，语言模型在蛋白质研究中得到了广泛的应用，因为它们被用于嵌入蛋白质、生成新的蛋白质和预测三级结构。在本书章节中，我们概述了蛋白质生成模型的使用，回顾了1）用于设计新的人工蛋白质的语言模型，2）使用非Transformer架构的工作，以及3）应用于定向进化方法的应用。",
    "tldr": "本章概述了使用蛋白质生成模型的三种方法：利用语言模型设计新的人工蛋白质，使用非Transformer架构的工作和应用于定向进化方法的应用。",
    "en_tdlr": "This chapter provides an overview of three approaches using protein generative models: using language models to design new artificial proteins, works using non-Transformer architectures, and applications in directed evolution approaches."
}