{
    "title": "Designing Optimal Behavioral Experiments Using Machine Learning. (arXiv:2305.07721v1 [cs.LG])",
    "abstract": "Computational models are powerful tools for understanding human cognition and behavior. They let us express our theories clearly and precisely, and offer predictions that can be subtle and often counter-intuitive. However, this same richness and ability to surprise means our scientific intuitions and traditional tools are ill-suited to designing experiments to test and compare these models. To avoid these pitfalls and realize the full potential of computational modeling, we require tools to design experiments that provide clear answers about what models explain human behavior and the auxiliary assumptions those models must make. Bayesian optimal experimental design (BOED) formalizes the search for optimal experimental designs by identifying experiments that are expected to yield informative data. In this work, we provide a tutorial on leveraging recent advances in BOED and machine learning to find optimal experiments for any kind of model that we can simulate data from, and show how by",
    "link": "http://arxiv.org/abs/2305.07721",
    "context": "Title: Designing Optimal Behavioral Experiments Using Machine Learning. (arXiv:2305.07721v1 [cs.LG])\nAbstract: Computational models are powerful tools for understanding human cognition and behavior. They let us express our theories clearly and precisely, and offer predictions that can be subtle and often counter-intuitive. However, this same richness and ability to surprise means our scientific intuitions and traditional tools are ill-suited to designing experiments to test and compare these models. To avoid these pitfalls and realize the full potential of computational modeling, we require tools to design experiments that provide clear answers about what models explain human behavior and the auxiliary assumptions those models must make. Bayesian optimal experimental design (BOED) formalizes the search for optimal experimental designs by identifying experiments that are expected to yield informative data. In this work, we provide a tutorial on leveraging recent advances in BOED and machine learning to find optimal experiments for any kind of model that we can simulate data from, and show how by",
    "path": "papers/23/05/2305.07721.json",
    "total_tokens": 892,
    "translated_title": "利用机器学习设计最优行为实验",
    "translated_abstract": "计算模型是理解人类认知和行为的强大工具。它们能够清晰、精确地表达我们的理论，并提供细微而常常出人意料的预测。然而，这种丰富性和惊喜的能力意味着我们的科学直觉和传统工具不适合设计实验来测试和比较这些模型。为了避免这些陷阱并实现计算建模的全部潜力，我们需要设计实验的工具，以清晰地回答模型解释人类行为的方式以及这些模型必须做出的辅助假设。贝叶斯最优实验设计（BOED）通过确定预期产生信息性数据的实验来正式化搜索最优实验设计。在这项工作中，我们提供了一个教程，介绍了如何利用BOED和机器学习的最新进展，为我们能够从中模拟数据的任何类型的模型找到最优实验，并展示如何通过这样做，我们可以更深入地了解人类行为和认知。",
    "tldr": "本文介绍了利用BOED和机器学习的最新进展，为我们能够从中模拟数据的任何类型的模型找到最优实验，以获得更深入的了解人类行为和认知。",
    "en_tdlr": "This paper provides a tutorial on leveraging recent advances in BOED and machine learning to find optimal experiments for any kind of model that we can simulate data from, and shows how by doing so, we can gain deeper insights into human behavior and cognition."
}