{
    "title": "Short-Term Electricity Load Forecasting Using the Temporal Fusion Transformer: Effect of Grid Hierarchies and Data Sources. (arXiv:2305.10559v1 [cs.LG])",
    "abstract": "Recent developments related to the energy transition pose particular challenges for distribution grids. Hence, precise load forecasts become more and more important for effective grid management. Novel modeling approaches such as the Transformer architecture, in particular the Temporal Fusion Transformer (TFT), have emerged as promising methods for time series forecasting. To date, just a handful of studies apply TFTs to electricity load forecasting problems, mostly considering only single datasets and a few covariates. Therefore, we examine the potential of the TFT architecture for hourly short-term load forecasting across different time horizons (day-ahead and week-ahead) and network levels (grid and substation level). We find that the TFT architecture does not offer higher predictive performance than a state-of-the-art LSTM model for day-ahead forecasting on the entire grid. However, the results display significant improvements for the TFT when applied at the substation level with a",
    "link": "http://arxiv.org/abs/2305.10559",
    "context": "Title: Short-Term Electricity Load Forecasting Using the Temporal Fusion Transformer: Effect of Grid Hierarchies and Data Sources. (arXiv:2305.10559v1 [cs.LG])\nAbstract: Recent developments related to the energy transition pose particular challenges for distribution grids. Hence, precise load forecasts become more and more important for effective grid management. Novel modeling approaches such as the Transformer architecture, in particular the Temporal Fusion Transformer (TFT), have emerged as promising methods for time series forecasting. To date, just a handful of studies apply TFTs to electricity load forecasting problems, mostly considering only single datasets and a few covariates. Therefore, we examine the potential of the TFT architecture for hourly short-term load forecasting across different time horizons (day-ahead and week-ahead) and network levels (grid and substation level). We find that the TFT architecture does not offer higher predictive performance than a state-of-the-art LSTM model for day-ahead forecasting on the entire grid. However, the results display significant improvements for the TFT when applied at the substation level with a",
    "path": "papers/23/05/2305.10559.json",
    "total_tokens": 984,
    "translated_title": "利用Temporal Fusion Transformer的短期电力负荷预测：网格层次和数据来源的影响",
    "translated_abstract": "能源转型的最新发展为配电网提出了特殊挑战。因此，精确的负荷预测变得越来越重要，以实现有效的网格管理。新颖的建模方法，例如Transformer架构，尤其是Temporal Fusion Transformer（TFT），已成为时间序列预测的有希望的方法。迄今为止，只有少数研究将TFT应用于电力负荷预测问题，主要考虑单个数据集和少量协变量。因此，我们研究了TFT架构在不同时间范围（提前一天和提前一周）和网络级别（网格和变电站级别）的小时短期负荷预测的潜力。我们发现，TFT架构在整个网格的提前一天预测中并不比最先进的LSTM模型提供更高的预测性能。然而，当采用分层方法以及包括额外的数据来源（例如天气变量）时，TFT的结果显示出显着的提高。我们的研究结果突出了在具体预测问题上精选数据源和建模技术的重要性。",
    "tldr": "本文研究了使用Temporal Fusion Transformer对不同时间范围和网络级别的短期电力负荷进行预测的潜力，结果显示TFT在变电站级别和使用额外数据源时具有显著的提高。",
    "en_tdlr": "This paper investigates the potential of using the Temporal Fusion Transformer to forecast short-term electricity load across different time horizons and network levels. Results suggest significant improvements for the TFT when applied at the substation level with the inclusion of additional data sources."
}