{
    "title": "A Comprehensive Survey on Affective Computing; Challenges, Trends, Applications, and Future Directions. (arXiv:2305.07665v1 [cs.AI])",
    "abstract": "As the name suggests, affective computing aims to recognize human emotions, sentiments, and feelings. There is a wide range of fields that study affective computing, including languages, sociology, psychology, computer science, and physiology. However, no research has ever been done to determine how machine learning (ML) and mixed reality (XR) interact together. This paper discusses the significance of affective computing, as well as its ideas, conceptions, methods, and outcomes. By using approaches of ML and XR, we survey and discuss recent methodologies in affective computing. We survey the state-of-the-art approaches along with current affective data resources. Further, we discuss various applications where affective computing has a significant impact, which will aid future scholars in gaining a better understanding of its significance and practical relevance.",
    "link": "http://arxiv.org/abs/2305.07665",
    "context": "Title: A Comprehensive Survey on Affective Computing; Challenges, Trends, Applications, and Future Directions. (arXiv:2305.07665v1 [cs.AI])\nAbstract: As the name suggests, affective computing aims to recognize human emotions, sentiments, and feelings. There is a wide range of fields that study affective computing, including languages, sociology, psychology, computer science, and physiology. However, no research has ever been done to determine how machine learning (ML) and mixed reality (XR) interact together. This paper discusses the significance of affective computing, as well as its ideas, conceptions, methods, and outcomes. By using approaches of ML and XR, we survey and discuss recent methodologies in affective computing. We survey the state-of-the-art approaches along with current affective data resources. Further, we discuss various applications where affective computing has a significant impact, which will aid future scholars in gaining a better understanding of its significance and practical relevance.",
    "path": "papers/23/05/2305.07665.json",
    "total_tokens": 785,
    "translated_title": "情感计算综述：挑战、趋势、应用和未来方向调查",
    "translated_abstract": "如其名，情感计算旨在识别人类的情绪、情感和感受。包括语言学、社会学、心理学、计算机科学和生理学等广泛领域研究情感计算。然而，没有研究确定机器学习（ML）和混合现实（XR）如何相互作用。本文讨论了情感计算的重要性、其思想、概念、方法和结果。通过使用ML和XR的方法，我们调查和讨论了情感计算的最新方法。我们调查了最先进的方法以及当前情感数据资源。此外，我们讨论了各种应用程序，其中情感计算具有重大影响，这将帮助未来学者更好地了解其重要性和实际相关性。",
    "tldr": "本综述介绍了情感计算的重要性、思想、方法和结果，调查了最新的机器学习和混合现实相结合的情感计算方法，并讨论了各种应用程序。"
}