{
    "title": "Blackout Diffusion: Generative Diffusion Models in Discrete-State Spaces. (arXiv:2305.11089v1 [cs.LG])",
    "abstract": "Typical generative diffusion models rely on a Gaussian diffusion process for training the backward transformations, which can then be used to generate samples from Gaussian noise. However, real world data often takes place in discrete-state spaces, including many scientific applications. Here, we develop a theoretical formulation for arbitrary discrete-state Markov processes in the forward diffusion process using exact (as opposed to variational) analysis. We relate the theory to the existing continuous-state Gaussian diffusion as well as other approaches to discrete diffusion, and identify the corresponding reverse-time stochastic process and score function in the continuous-time setting, and the reverse-time mapping in the discrete-time setting. As an example of this framework, we introduce ``Blackout Diffusion'', which learns to produce samples from an empty image instead of from noise. Numerical experiments on the CIFAR-10, Binarized MNIST, and CelebA datasets confirm the feasibili",
    "link": "http://arxiv.org/abs/2305.11089",
    "context": "Title: Blackout Diffusion: Generative Diffusion Models in Discrete-State Spaces. (arXiv:2305.11089v1 [cs.LG])\nAbstract: Typical generative diffusion models rely on a Gaussian diffusion process for training the backward transformations, which can then be used to generate samples from Gaussian noise. However, real world data often takes place in discrete-state spaces, including many scientific applications. Here, we develop a theoretical formulation for arbitrary discrete-state Markov processes in the forward diffusion process using exact (as opposed to variational) analysis. We relate the theory to the existing continuous-state Gaussian diffusion as well as other approaches to discrete diffusion, and identify the corresponding reverse-time stochastic process and score function in the continuous-time setting, and the reverse-time mapping in the discrete-time setting. As an example of this framework, we introduce ``Blackout Diffusion'', which learns to produce samples from an empty image instead of from noise. Numerical experiments on the CIFAR-10, Binarized MNIST, and CelebA datasets confirm the feasibili",
    "path": "papers/23/05/2305.11089.json",
    "total_tokens": 874,
    "translated_title": "生成扩散模型在离散状态空间中的应用：Blackout Diffusion",
    "translated_abstract": "典型的生成扩散模型依赖于高斯扩散过程来训练反向转换，然后可以用于从高斯噪声中生成样本。然而，真实世界中的数据常常处于离散状态空间中，包括许多科学应用。在这里，我们使用精确（而不是变分）分析，针对任意离散状态Markov过程开发了前向扩散过程的理论公式。我们将这个理论与现有的连续状态高斯扩散以及其他离散扩散方法联系起来，并确定了连续时间情况下的反向随机过程和得分函数，以及离散时间情况下的反向映射。作为此框架的例子，我们介绍了“Blackout Diffusion”，它学会了从空图像中生成样本而不是从噪声中生成。在CIFAR-10、Binarized MNIST和CelebA数据集上的数值实验证实了它的可行性。",
    "tldr": "本文提出了一种新的理论公式来实现任意离散状态Markov过程的生成扩散模型，并介绍了一种名为“Blackout Diffusion”的应用，它可以从空图像中生成样本。",
    "en_tdlr": "This paper proposes a new theoretical formula to implement generative diffusion models for arbitrary discrete-state Markov processes, and introduces an application called \"Blackout Diffusion\" which can generate samples from empty images."
}