{
    "title": "An Empirical Study of Capital Asset Pricing Model based on Chinese A-share Trading Data. (arXiv:2305.04838v1 [q-fin.ST])",
    "abstract": "This paper presents an empirical analysis of the capital asset pricing model using trading data for the Chinese A-share market from 2000 to 2019. Firstly, the standard CAPM is tested using a Fama-MacBetch regression and although the results successfully test the three core hypotheses, the resulting beta risk does not have a significant impact on returns. Secondly, the Fama-French three-factor model, which uses a combination of market, size and value factors to price capital assets, is analysed, showing that it is able to capture most of the variation in A-share market returns, with an adjusted R-squared greater than 0.88 for the 25 portfolios constructed. Finally, the paper takes into account the \"shell value contamination\" problem caused by IPO regulation in the Chinese stock market, and minimises its impact by excluding stocks in the lowest 30% of the market capitalisation, which allows some of the anomalous results in the three-factor model to be effectively corrected. Although this",
    "link": "http://arxiv.org/abs/2305.04838",
    "context": "Title: An Empirical Study of Capital Asset Pricing Model based on Chinese A-share Trading Data. (arXiv:2305.04838v1 [q-fin.ST])\nAbstract: This paper presents an empirical analysis of the capital asset pricing model using trading data for the Chinese A-share market from 2000 to 2019. Firstly, the standard CAPM is tested using a Fama-MacBetch regression and although the results successfully test the three core hypotheses, the resulting beta risk does not have a significant impact on returns. Secondly, the Fama-French three-factor model, which uses a combination of market, size and value factors to price capital assets, is analysed, showing that it is able to capture most of the variation in A-share market returns, with an adjusted R-squared greater than 0.88 for the 25 portfolios constructed. Finally, the paper takes into account the \"shell value contamination\" problem caused by IPO regulation in the Chinese stock market, and minimises its impact by excluding stocks in the lowest 30% of the market capitalisation, which allows some of the anomalous results in the three-factor model to be effectively corrected. Although this",
    "path": "papers/23/05/2305.04838.json",
    "total_tokens": 930,
    "translated_title": "基于中国A股交易数据的资本资产定价模型的实证研究",
    "translated_abstract": "本文使用2000年至2019年中国A股市场的交易数据，对资本资产定价模型进行了实证分析。首先，使用Fama-MacBeth回归测试标准CAPM，虽然结果成功测试了三个核心假设，但得出的β风险对收益没有显著影响。其次，分析了Fama-French三因子模型，该模型使用市场、规模和价值因子的组合来定价资本资产，结果显示该模型能够捕捉到A股市场回报的大部分变化，对于构造的25个投资组合来说，调整后R平方大于0.88。最后，本文考虑到在中国股市IPO监管下产生的“壳体价值污染”问题，并通过排除市值最低30%的股票来减少其影响，从而有效修正了三因子模型中的一些异常结果。然而，该研究仍有一些局限性，因为它没有考虑非线性效应和高阶风险。",
    "tldr": "本文基于中国A股市场2000到2019年的交易数据，对资本资产定价模型进行了实证分析。结果显示，Fama-French三因子模型能够捕捉到A股市场回报的大部分变化。",
    "en_tdlr": "This paper provides an empirical analysis of the capital asset pricing model using trading data for the Chinese A-share market from 2000 to 2019. The results demonstrate that the Fama-French three-factor model is able to capture most of the variation in A-share market returns."
}