{
    "title": "Learning Optimal Policy for Simultaneous Machine Translation via Binary Search. (arXiv:2305.12774v2 [cs.CL] UPDATED)",
    "abstract": "Simultaneous machine translation (SiMT) starts to output translation while reading the source sentence and needs a precise policy to decide when to output the generated translation. Therefore, the policy determines the number of source tokens read during the translation of each target token. However, it is difficult to learn a precise translation policy to achieve good latency-quality trade-offs, because there is no golden policy corresponding to parallel sentences as explicit supervision. In this paper, we present a new method for constructing the optimal policy online via binary search. By employing explicit supervision, our approach enables the SiMT model to learn the optimal policy, which can guide the model in completing the translation during inference. Experiments on four translation tasks show that our method can exceed strong baselines across all latency scenarios.",
    "link": "http://arxiv.org/abs/2305.12774",
    "context": "Title: Learning Optimal Policy for Simultaneous Machine Translation via Binary Search. (arXiv:2305.12774v2 [cs.CL] UPDATED)\nAbstract: Simultaneous machine translation (SiMT) starts to output translation while reading the source sentence and needs a precise policy to decide when to output the generated translation. Therefore, the policy determines the number of source tokens read during the translation of each target token. However, it is difficult to learn a precise translation policy to achieve good latency-quality trade-offs, because there is no golden policy corresponding to parallel sentences as explicit supervision. In this paper, we present a new method for constructing the optimal policy online via binary search. By employing explicit supervision, our approach enables the SiMT model to learn the optimal policy, which can guide the model in completing the translation during inference. Experiments on four translation tasks show that our method can exceed strong baselines across all latency scenarios.",
    "path": "papers/23/05/2305.12774.json",
    "total_tokens": 817,
    "translated_title": "通过二分搜索学习同时机器翻译的最优策略",
    "translated_abstract": "同时机器翻译（SiMT）在阅读源句子时开始输出翻译，并需要精确的策略来决定何时输出生成的翻译。因此，该策略决定了在翻译每个目标令牌期间读取的源标记数量。然而，学习精确的翻译策略以实现良好的延迟质量权衡是困难的，因为没有与并行句子对应的黄金策略作为显式监督。本文提出了一种通过二分搜索在线构建最优策略的新方法。通过采用显式监督，我们的方法使SiMT模型能够学习最优策略，这可以指导模型在推理过程中完成翻译。在四个翻译任务上的实验结果表明，我们的方法可以在所有延迟方案下超越强基线。",
    "tldr": "本文提出通过二分搜索学习同时机器翻译最优策略的方法，并在多个翻译任务上验证了在所有延迟情景下超越强基线的效果。",
    "en_tdlr": "This paper proposes a method of learning optimal policy for simultaneous machine translation via binary search, and validates it on multiple translation tasks, demonstrating that it outperforms strong baselines across all latency scenarios."
}