{
    "title": "KAFA: Rethinking Image Ad Understanding with Knowledge-Augmented Feature Adaptation of Vision-Language Models. (arXiv:2305.18373v1 [cs.CV])",
    "abstract": "Image ad understanding is a crucial task with wide real-world applications. Although highly challenging with the involvement of diverse atypical scenes, real-world entities, and reasoning over scene-texts, how to interpret image ads is relatively under-explored, especially in the era of foundational vision-language models (VLMs) featuring impressive generalizability and adaptability. In this paper, we perform the first empirical study of image ad understanding through the lens of pre-trained VLMs. We benchmark and reveal practical challenges in adapting these VLMs to image ad understanding. We propose a simple feature adaptation strategy to effectively fuse multimodal information for image ads and further empower it with knowledge of real-world entities. We hope our study draws more attention to image ad understanding which is broadly relevant to the advertising industry.",
    "link": "http://arxiv.org/abs/2305.18373",
    "context": "Title: KAFA: Rethinking Image Ad Understanding with Knowledge-Augmented Feature Adaptation of Vision-Language Models. (arXiv:2305.18373v1 [cs.CV])\nAbstract: Image ad understanding is a crucial task with wide real-world applications. Although highly challenging with the involvement of diverse atypical scenes, real-world entities, and reasoning over scene-texts, how to interpret image ads is relatively under-explored, especially in the era of foundational vision-language models (VLMs) featuring impressive generalizability and adaptability. In this paper, we perform the first empirical study of image ad understanding through the lens of pre-trained VLMs. We benchmark and reveal practical challenges in adapting these VLMs to image ad understanding. We propose a simple feature adaptation strategy to effectively fuse multimodal information for image ads and further empower it with knowledge of real-world entities. We hope our study draws more attention to image ad understanding which is broadly relevant to the advertising industry.",
    "path": "papers/23/05/2305.18373.json",
    "total_tokens": 942,
    "translated_title": "KAFA：基于知识增强特征自适应的视觉语言模型重新思考图像广告理解",
    "translated_abstract": "图像广告理解是一个非常关键的任务，具有广泛的实际应用。尽管有各种挑战，包括涉及非典型场景，真实世界实体，并对场景文本进行推理等，但如何解释图像广告相对少有研究，特别是在基于卓越的泛化性和适应性的基础视觉语言模型（VLMs）时代。在本文中，我们通过预训练的VLMs的视角，进行了第一次实证研究图像广告理解。我们评估并揭示了将这些VLMs适应于图像广告理解的实际挑战。我们提出了一种简单的特征自适应策略，以有效地融合图像广告的多模态信息，并通过真实世界实体的知识进一步增强它。我们希望我们的研究引起更多人对广告行业广泛相关的图像广告理解的关注。",
    "tldr": "本文是第一篇通过预训练的VLMs实证研究图像广告理解的文章。我们提出了一种基于知识增强特征自适应的策略，有效地融合了图像广告的多模态信息，并通过真实世界实体的知识进一步增强了模型。研究对广告行业具有广泛的相关性。",
    "en_tdlr": "This paper is the first empirical study of image ad understanding through the perspective of pre-trained vision-language models (VLMs). A simple feature adaptation strategy is proposed to fuse multimodal information for image ads and further empower it with knowledge of real-world entities. This study is broadly relevant to the advertising industry."
}