{
    "title": "Markov $\\alpha$-Potential Games: Equilibrium Approximation and Regret Analysis. (arXiv:2305.12553v2 [cs.GT] UPDATED)",
    "abstract": "This paper proposes a new framework to study multi-agent interaction in Markov games: Markov $\\alpha$-potential games. Markov potential games are special cases of Markov $\\alpha$-potential games, so are two important and practically significant classes of games: Markov congestion games and perturbed Markov team games. In this paper, {$\\alpha$-potential} functions for both games are provided and the gap $\\alpha$ is characterized with respect to game parameters. Two algorithms -- the projected gradient-ascent algorithm and the sequential maximum improvement smoothed best response dynamics -- are introduced for approximating the stationary Nash equilibrium in Markov $\\alpha$-potential games. The Nash-regret for each algorithm is shown to scale sub-linearly in time horizon. Our analysis and numerical experiments demonstrates that simple algorithms are capable of finding approximate equilibrium in Markov $\\alpha$-potential games.",
    "link": "http://arxiv.org/abs/2305.12553",
    "context": "Title: Markov $\\alpha$-Potential Games: Equilibrium Approximation and Regret Analysis. (arXiv:2305.12553v2 [cs.GT] UPDATED)\nAbstract: This paper proposes a new framework to study multi-agent interaction in Markov games: Markov $\\alpha$-potential games. Markov potential games are special cases of Markov $\\alpha$-potential games, so are two important and practically significant classes of games: Markov congestion games and perturbed Markov team games. In this paper, {$\\alpha$-potential} functions for both games are provided and the gap $\\alpha$ is characterized with respect to game parameters. Two algorithms -- the projected gradient-ascent algorithm and the sequential maximum improvement smoothed best response dynamics -- are introduced for approximating the stationary Nash equilibrium in Markov $\\alpha$-potential games. The Nash-regret for each algorithm is shown to scale sub-linearly in time horizon. Our analysis and numerical experiments demonstrates that simple algorithms are capable of finding approximate equilibrium in Markov $\\alpha$-potential games.",
    "path": "papers/23/05/2305.12553.json",
    "total_tokens": 959,
    "translated_title": "马尔可夫$\\alpha$-势博弈:均衡近似与遗憾分析",
    "translated_abstract": "本文提出了一种研究马尔可夫博弈中多代理交互的新框架:马尔可夫$\\alpha$-势博弈。马尔可夫势博弈是马尔可夫 $\\alpha$-势博弈的特殊情况，马尔可夫拥堵博弈和扰动马尔可夫团队博弈是两个重要且实际意义重大的博弈类。本文提供了两个博弈的$\\alpha$-势函数，并针对博弈参数表征了差距 $\\alpha$。引入了两种算法——投影梯度上升算法和顺序最大改进平滑最佳反应动态——来近似计算马尔可夫$\\alpha$-势博弈中的稳态纳什均衡。每个算法的纳什遗憾都显示为时间跨度的亚线性缩放。我们的分析和数值实验表明，简单的算法能够找到马尔可夫$\\alpha$-势博弈的近似均衡。",
    "tldr": "本文提出了一种新的框架来研究马尔可夫博弈，即马尔可夫 $\\alpha$-势博弈。介绍了两种算法来计算其中的纳什均衡，且表明这些算法能够找到近似均衡。",
    "en_tdlr": "This paper introduces a new framework, the Markov $\\alpha$-potential games, to study multi-agent interaction in Markov games, and proposes two algorithms for approximating Nash equilibrium in these games, with sub-linear scaling of Nash-regret in time horizon."
}