{
    "title": "Latent Dynamics Networks (LDNets): learning the intrinsic dynamics of spatio-temporal processes. (arXiv:2305.00094v1 [cs.LG])",
    "abstract": "Predicting the evolution of systems that exhibit spatio-temporal dynamics in response to external stimuli is a key enabling technology fostering scientific innovation. Traditional equations-based approaches leverage first principles to yield predictions through the numerical approximation of high-dimensional systems of differential equations, thus calling for large-scale parallel computing platforms and requiring large computational costs. Data-driven approaches, instead, enable the description of systems evolution in low-dimensional latent spaces, by leveraging dimensionality reduction and deep learning algorithms. We propose a novel architecture, named Latent Dynamics Network (LDNet), which is able to discover low-dimensional intrinsic dynamics of possibly non-Markovian dynamical systems, thus predicting the time evolution of space-dependent fields in response to external inputs. Unlike popular approaches, in which the latent representation of the solution manifold is learned by mean",
    "link": "http://arxiv.org/abs/2305.00094",
    "context": "Title: Latent Dynamics Networks (LDNets): learning the intrinsic dynamics of spatio-temporal processes. (arXiv:2305.00094v1 [cs.LG])\nAbstract: Predicting the evolution of systems that exhibit spatio-temporal dynamics in response to external stimuli is a key enabling technology fostering scientific innovation. Traditional equations-based approaches leverage first principles to yield predictions through the numerical approximation of high-dimensional systems of differential equations, thus calling for large-scale parallel computing platforms and requiring large computational costs. Data-driven approaches, instead, enable the description of systems evolution in low-dimensional latent spaces, by leveraging dimensionality reduction and deep learning algorithms. We propose a novel architecture, named Latent Dynamics Network (LDNet), which is able to discover low-dimensional intrinsic dynamics of possibly non-Markovian dynamical systems, thus predicting the time evolution of space-dependent fields in response to external inputs. Unlike popular approaches, in which the latent representation of the solution manifold is learned by mean",
    "path": "papers/23/05/2305.00094.json",
    "total_tokens": 833,
    "tldr": "LDNet是一种新型网络结构，可在低维潜在空间中学习系统的内在动力学，并预测对外部输入的响应。它的优势在于可以大大减少计算成本并处理非马尔可夫动力系统。"
}