{
    "title": "A Survey on Asking Clarification Questions Datasets in Conversational Systems. (arXiv:2305.15933v1 [cs.IR])",
    "abstract": "The ability to understand a user's underlying needs is critical for conversational systems, especially with limited input from users in a conversation. Thus, in such a domain, Asking Clarification Questions (ACQs) to reveal users' true intent from their queries or utterances arise as an essential task. However, it is noticeable that a key limitation of the existing ACQs studies is their incomparability, from inconsistent use of data, distinct experimental setups and evaluation strategies. Therefore, in this paper, to assist the development of ACQs techniques, we comprehensively analyse the current ACQs research status, which offers a detailed comparison of publicly available datasets, and discusses the applied evaluation metrics, joined with benchmarks for multiple ACQs-related tasks. In particular, given a thorough analysis of the ACQs task, we discuss a number of corresponding research directions for the investigation of ACQs as well as the development of conversational systems.",
    "link": "http://arxiv.org/abs/2305.15933",
    "context": "Title: A Survey on Asking Clarification Questions Datasets in Conversational Systems. (arXiv:2305.15933v1 [cs.IR])\nAbstract: The ability to understand a user's underlying needs is critical for conversational systems, especially with limited input from users in a conversation. Thus, in such a domain, Asking Clarification Questions (ACQs) to reveal users' true intent from their queries or utterances arise as an essential task. However, it is noticeable that a key limitation of the existing ACQs studies is their incomparability, from inconsistent use of data, distinct experimental setups and evaluation strategies. Therefore, in this paper, to assist the development of ACQs techniques, we comprehensively analyse the current ACQs research status, which offers a detailed comparison of publicly available datasets, and discusses the applied evaluation metrics, joined with benchmarks for multiple ACQs-related tasks. In particular, given a thorough analysis of the ACQs task, we discuss a number of corresponding research directions for the investigation of ACQs as well as the development of conversational systems.",
    "path": "papers/23/05/2305.15933.json",
    "total_tokens": 844,
    "translated_title": "对话系统中询问澄清问题数据集的综述",
    "translated_abstract": "理解用户真实需求对于对话系统尤为重要，特别是在对话中用户提供的信息有限的情况下。因此，在这样的领域中，询问澄清问题（ACQ）以揭示用户意图为关键任务。然而，现有ACQ研究的关键限制是它们的不可比性，来自数据的不一致使用，不同的实验设置和评估策略。因此，本文为协助ACQ技术的发展，全面分析了当前ACQ研究状态，提供了公开可用数据集的详细比较，并讨论了应用评估指标以及多个与ACQ相关任务的基准。特别是，在对ACQ任务进行彻底分析后，我们讨论了一些相应的研究方向，以调查ACQ以及对话系统的发展。",
    "tldr": "本文对询问澄清问题（ACQ）的相关研究进行了全面分析，并提供了公开可用数据集的详细比较和多个ACQ相关任务的基准，旨在协助ACQ技术的发展。"
}