{
    "title": "Know Your Self-supervised Learning: A Survey on Image-based Generative and Discriminative Training. (arXiv:2305.13689v1 [cs.CV])",
    "abstract": "Although supervised learning has been highly successful in improving the state-of-the-art in the domain of image-based computer vision in the past, the margin of improvement has diminished significantly in recent years, indicating that a plateau is in sight. Meanwhile, the use of self-supervised learning (SSL) for the purpose of natural language processing (NLP) has seen tremendous successes during the past couple of years, with this new learning paradigm yielding powerful language models. Inspired by the excellent results obtained in the field of NLP, self-supervised methods that rely on clustering, contrastive learning, distillation, and information-maximization, which all fall under the banner of discriminative SSL, have experienced a swift uptake in the area of computer vision. Shortly afterwards, generative SSL frameworks that are mostly based on masked image modeling, complemented and surpassed the results obtained with discriminative SSL. Consequently, within a span of three yea",
    "link": "http://arxiv.org/abs/2305.13689",
    "context": "Title: Know Your Self-supervised Learning: A Survey on Image-based Generative and Discriminative Training. (arXiv:2305.13689v1 [cs.CV])\nAbstract: Although supervised learning has been highly successful in improving the state-of-the-art in the domain of image-based computer vision in the past, the margin of improvement has diminished significantly in recent years, indicating that a plateau is in sight. Meanwhile, the use of self-supervised learning (SSL) for the purpose of natural language processing (NLP) has seen tremendous successes during the past couple of years, with this new learning paradigm yielding powerful language models. Inspired by the excellent results obtained in the field of NLP, self-supervised methods that rely on clustering, contrastive learning, distillation, and information-maximization, which all fall under the banner of discriminative SSL, have experienced a swift uptake in the area of computer vision. Shortly afterwards, generative SSL frameworks that are mostly based on masked image modeling, complemented and surpassed the results obtained with discriminative SSL. Consequently, within a span of three yea",
    "path": "papers/23/05/2305.13689.json",
    "total_tokens": 1012,
    "translated_title": "认识你的自监督学习：图像生成和判别式训练综述",
    "translated_abstract": "虽然在过去，监督式学习在图像计算机视觉领域中取得了很高的成功，但近年来，其改进的幅度已经显著减小，这表明一个瓶颈已经出现。与此同时，在自然语言处理（NLP）领域中使用自监督学习（SSL）取得了巨大的成功，这种新的学习范式产生了强大的语言模型。启发自NLP领域取得的优异结果，基于聚类、对比学习、蒸馏和信息最大化的分类式SSL等自监督方法迅速在计算机视觉领域得到了广泛应用。不久之后，基于遮蔽图像建模的生成式SSL框架在弥补和超越了判别式SSL所取得的结果。因此，自监督学习已经成为训练图像计算机视觉深度神经网络的主流方法。本文全面综述了文献中提出的用于图像生成和判别式训练的各种自监督学习方法。",
    "tldr": "自监督学习在图像计算机视觉领域中正在快速成为主要训练深度神经网络的方法。本文综述了文献中提出的用于图像生成和判别式训练的各种自监督学习方法。",
    "en_tdlr": "Self-supervised learning is becoming the go-to method for training deep neural networks in image-based computer vision, with various methods based on clustering, contrastive learning, distillation and information-maximization. This survey explores the self-supervised learning methods proposed in literature for image-based generative and discriminative training."
}