{
    "title": "Score-based Transport Modeling for Mean-Field Fokker-Planck Equations. (arXiv:2305.03729v1 [math.NA])",
    "abstract": "We use the score-based transport modeling method to solve the mean-field Fokker-Planck equations, which we call MSBTM. We establish an upper bound on the time derivative of the Kullback-Leibler (KL) divergence to MSBTM numerical estimation from the exact solution, thus validates the MSBTM approach. Besides, we provide an error analysis for the algorithm. In numerical experiments, we study two types of mean-field Fokker-Planck equation and their corresponding dynamics of particles in interacting systems. The MSBTM algorithm is numerically validated through qualitative and quantitative comparison between the MSBTM solutions, the results of integrating the associated stochastic differential equation and the analytical solutions if available.",
    "link": "http://arxiv.org/abs/2305.03729",
    "context": "Title: Score-based Transport Modeling for Mean-Field Fokker-Planck Equations. (arXiv:2305.03729v1 [math.NA])\nAbstract: We use the score-based transport modeling method to solve the mean-field Fokker-Planck equations, which we call MSBTM. We establish an upper bound on the time derivative of the Kullback-Leibler (KL) divergence to MSBTM numerical estimation from the exact solution, thus validates the MSBTM approach. Besides, we provide an error analysis for the algorithm. In numerical experiments, we study two types of mean-field Fokker-Planck equation and their corresponding dynamics of particles in interacting systems. The MSBTM algorithm is numerically validated through qualitative and quantitative comparison between the MSBTM solutions, the results of integrating the associated stochastic differential equation and the analytical solutions if available.",
    "path": "papers/23/05/2305.03729.json",
    "total_tokens": 887,
    "translated_title": "基于评分的输运建模在平均场福克-普朗克方程求解中的应用",
    "translated_abstract": "我们采用基于评分的输运建模方法（MSBTM）解决平均场福克-普朗克方程。我们从精确解到MSBTM数值估算建立了Kullback-Leibler（KL）散度时间导数的上界，从而验证了MSBTM方法的有效性。此外，我们还为该算法提供了误差分析。在数值实验中，我们研究了两种类型的平均场福克-普朗克方程以及它们对应的相互作用系统中粒子的动力学。通过MSBTM解、相应随机微分方程的积分结果和解析解（如果有）的定性和定量比较，验证了MSBTM算法的可行性。",
    "tldr": "本文介绍了基于评分的输运建模方法（MSBTM）在求解平均场福克-普朗克方程中的应用。通过建立Kullback-Leibler散度时间导数的上界，验证了MSBTM方法的有效性。通过对MSBTM解、相应随机微分方程的积分结果和解析解（如果有）的定性和定量比较，验证了MSBTM算法的可行性。",
    "en_tdlr": "This paper introduces the application of the score-based transport modeling method (MSBTM) for solving mean-field Fokker-Planck equations. The effectiveness of the MSBTM approach is validated by establishing an upper bound on the time derivative of the Kullback-Leibler divergence. The feasibility of the MSBTM algorithm is validated through qualitative and quantitative comparison between the MSBTM solutions, the results of integrating the associated stochastic differential equation, and analytical solutions if available."
}