{
    "title": "Conditional variational autoencoder with Gaussian process regression recognition for parametric models. (arXiv:2305.09625v1 [cs.CE])",
    "abstract": "In this article, we present a data-driven method for parametric models with noisy observation data. Gaussian process regression based reduced order modeling (GPR-based ROM) can realize fast online predictions without using equations in the offline stage. However, GPR-based ROM does not perform well for complex systems since POD projection are naturally linear. Conditional variational autoencoder (CVAE) can address this issue via nonlinear neural networks but it has more model complexity, which poses challenges for training and tuning hyperparameters. To this end, we propose a framework of CVAE with Gaussian process regression recognition (CVAE-GPRR). The proposed method consists of a recognition model and a likelihood model. In the recognition model, we first extract low-dimensional features from data by POD to filter the redundant information with high frequency. And then a non-parametric model GPR is used to learn the map from parameters to POD latent variables, which can also allevi",
    "link": "http://arxiv.org/abs/2305.09625",
    "context": "Title: Conditional variational autoencoder with Gaussian process regression recognition for parametric models. (arXiv:2305.09625v1 [cs.CE])\nAbstract: In this article, we present a data-driven method for parametric models with noisy observation data. Gaussian process regression based reduced order modeling (GPR-based ROM) can realize fast online predictions without using equations in the offline stage. However, GPR-based ROM does not perform well for complex systems since POD projection are naturally linear. Conditional variational autoencoder (CVAE) can address this issue via nonlinear neural networks but it has more model complexity, which poses challenges for training and tuning hyperparameters. To this end, we propose a framework of CVAE with Gaussian process regression recognition (CVAE-GPRR). The proposed method consists of a recognition model and a likelihood model. In the recognition model, we first extract low-dimensional features from data by POD to filter the redundant information with high frequency. And then a non-parametric model GPR is used to learn the map from parameters to POD latent variables, which can also allevi",
    "path": "papers/23/05/2305.09625.json",
    "total_tokens": 929,
    "translated_title": "带高斯过程回归识别的条件变分自编码器用于参数模型",
    "translated_abstract": "本文提出了一种基于数据驱动的方法来处理有噪声观察数据的参数模型。高斯过程回归的基于降阶建模（GPR-based ROM）可以实现快速的在线预测，而不需要在离线阶段使用方程。然而，GPR-based ROM对于复杂系统的表现不佳，因为POD投影天然是线性的。条件变分自编码器（CVAE）可以通过非线性神经网络解决这个问题，但它具有更高的模型复杂度，这给训练和调整超参数带来了挑战。因此，我们提出了一种带有高斯过程回归识别的CVAE框架（CVAE-GPRR）。该方法包括识别模型和可能性模型。在识别模型中，我们首先通过POD从数据中提取低维特征来过滤高频冗余信息。然后使用非参数模型GPR来学习从参数到POD潜变量的映射，这也可以缓解模型复杂度的问题。",
    "tldr": "本文提出了一种带高斯过程回归识别的条件变分自编码器框架，可以用于数据驱动的参数模型，通过提取低维特征和学习参数到潜变量的映射来缓解模型复杂度的问题。",
    "en_tdlr": "The paper proposes a framework of CVAE with Gaussian process regression recognition, which can be used for data-driven parametric models. It alleviates the model complexity issue by extracting low-dimensional features and learning the mapping from parameters to latent variables."
}