{
    "title": "Fine-Grained Product Classification on Leaflet Advertisements. (arXiv:2305.03706v1 [cs.CV])",
    "abstract": "In this paper, we describe a first publicly available fine-grained product recognition dataset based on leaflet images. Using advertisement leaflets, collected over several years from different European retailers, we provide a total of 41.6k manually annotated product images in 832 classes. Further, we investigate three different approaches for this fine-grained product classification task, Classification by Image, by Text, as well as by Image and Text. The approach \"Classification by Text\" uses the text extracted directly from the leaflet product images. We show, that the combination of image and text as input improves the classification of visual difficult to distinguish products. The final model leads to an accuracy of 96.4% with a Top-3 score of 99.2%. We release our code at https://github.com/ladwigd/Leaflet-Product-Classification.",
    "link": "http://arxiv.org/abs/2305.03706",
    "context": "Title: Fine-Grained Product Classification on Leaflet Advertisements. (arXiv:2305.03706v1 [cs.CV])\nAbstract: In this paper, we describe a first publicly available fine-grained product recognition dataset based on leaflet images. Using advertisement leaflets, collected over several years from different European retailers, we provide a total of 41.6k manually annotated product images in 832 classes. Further, we investigate three different approaches for this fine-grained product classification task, Classification by Image, by Text, as well as by Image and Text. The approach \"Classification by Text\" uses the text extracted directly from the leaflet product images. We show, that the combination of image and text as input improves the classification of visual difficult to distinguish products. The final model leads to an accuracy of 96.4% with a Top-3 score of 99.2%. We release our code at https://github.com/ladwigd/Leaflet-Product-Classification.",
    "path": "papers/23/05/2305.03706.json",
    "total_tokens": 803,
    "translated_title": "传单广告上的细粒度产品分类研究",
    "translated_abstract": "本文描述了一个基于传单图片的首个公开细粒度产品识别数据集。通过从不同欧洲零售商收集广告传单，我们提供了832个类别中的41600个手动注释的产品图像。进一步，我们尝试了三种不同的方法来进行细粒度产品分类任务，分别是基于图像、基于文本以及基于图像和文本的分类。\"基于文本的分类\"方法直接使用从传单中提取的商品文本信息。我们展示了将图像和文本作为输入的结合方法可以提高对于外观相似但难以区分的产品的分类性能。最终模型的准确率为96.4%，Top-3得分为99.2%。我们将代码公开在 https://github.com/ladwigd/Leaflet-Product-Classification 上。",
    "tldr": "本文介绍了首个公开细粒度产品识别数据集，通过图像和文本结合的模型可以提高对于细节相似的产品分类精确度，最终模型准确率为96.4%。"
}