{
    "title": "Beyond Prediction: On-street Parking Recommendation using Heterogeneous Graph-based List-wise Ranking. (arXiv:2305.00162v1 [cs.LG])",
    "abstract": "To provide real-time parking information, existing studies focus on predicting parking availability, which seems an indirect approach to saving drivers' cruising time. In this paper, we first time propose an on-street parking recommendation (OPR) task to directly recommend a parking space for a driver. To this end, a learn-to-rank (LTR) based OPR model called OPR-LTR is built. Specifically, parking recommendation is closely related to the \"turnover events\" (state switching between occupied and vacant) of each parking space, and hence we design a highly efficient heterogeneous graph called ESGraph to represent historical and real-time meters' turnover events as well as geographical relations; afterward, a convolution-based event-then-graph network is used to aggregate and update representations of the heterogeneous graph. A ranking model is further utilized to learn a score function that helps recommend a list of ranked parking spots for a specific on-street parking query. The method is",
    "link": "http://arxiv.org/abs/2305.00162",
    "context": "Title: Beyond Prediction: On-street Parking Recommendation using Heterogeneous Graph-based List-wise Ranking. (arXiv:2305.00162v1 [cs.LG])\nAbstract: To provide real-time parking information, existing studies focus on predicting parking availability, which seems an indirect approach to saving drivers' cruising time. In this paper, we first time propose an on-street parking recommendation (OPR) task to directly recommend a parking space for a driver. To this end, a learn-to-rank (LTR) based OPR model called OPR-LTR is built. Specifically, parking recommendation is closely related to the \"turnover events\" (state switching between occupied and vacant) of each parking space, and hence we design a highly efficient heterogeneous graph called ESGraph to represent historical and real-time meters' turnover events as well as geographical relations; afterward, a convolution-based event-then-graph network is used to aggregate and update representations of the heterogeneous graph. A ranking model is further utilized to learn a score function that helps recommend a list of ranked parking spots for a specific on-street parking query. The method is",
    "path": "papers/23/05/2305.00162.json",
    "total_tokens": 896,
    "tldr": "本论文利用异构图与卷积式事件-图网络设计了一个基于学习排序的街边停车推荐模型OPR-LTR，可为具体的街边停车查询推荐排序列表，而非仅仅预测停车可用性。"
}