{
    "title": "Absolute integrability of Mercer kernels is only sufficient for RKHS stability. (arXiv:2305.01411v1 [eess.SY])",
    "abstract": "Reproducing kernel Hilbert spaces (RKHSs) are special Hilbert spaces in one-to-one correspondence with positive definite maps called kernels. They are widely employed in machine learning to reconstruct unknown functions from sparse and noisy data. In the last two decades, a subclass known as stable RKHSs has been also introduced in the setting of linear system identification. Stable RKHSs contain only absolutely integrable impulse responses over the positive real line. Hence, they can be adopted as hypothesis spaces to estimate linear, time-invariant and BIBO stable dynamic systems from input-output data. Necessary and sufficient conditions for RKHS stability are available in the literature and it is known that kernel absolute integrability implies stability. Working in discrete-time, in a recent work we have proved that this latter condition is only sufficient. Working in continuous-time, it is the purpose of this note to prove that the same result holds also for Mercer kernels.",
    "link": "http://arxiv.org/abs/2305.01411",
    "context": "Title: Absolute integrability of Mercer kernels is only sufficient for RKHS stability. (arXiv:2305.01411v1 [eess.SY])\nAbstract: Reproducing kernel Hilbert spaces (RKHSs) are special Hilbert spaces in one-to-one correspondence with positive definite maps called kernels. They are widely employed in machine learning to reconstruct unknown functions from sparse and noisy data. In the last two decades, a subclass known as stable RKHSs has been also introduced in the setting of linear system identification. Stable RKHSs contain only absolutely integrable impulse responses over the positive real line. Hence, they can be adopted as hypothesis spaces to estimate linear, time-invariant and BIBO stable dynamic systems from input-output data. Necessary and sufficient conditions for RKHS stability are available in the literature and it is known that kernel absolute integrability implies stability. Working in discrete-time, in a recent work we have proved that this latter condition is only sufficient. Working in continuous-time, it is the purpose of this note to prove that the same result holds also for Mercer kernels.",
    "path": "papers/23/05/2305.01411.json",
    "total_tokens": 836,
    "translated_title": "Mercer核的绝对可积性仅仅是RKHS稳定性的充分条件",
    "translated_abstract": "再生核希尔伯特空间（RKHS）是一种与称为核的正定映射一一对应的特殊希尔伯特空间。它们被广泛应用于机器学习中，用于从稀疏嘈杂的数据中重建未知的函数。在过去的二十年中，在线性系统识别的背景下也引入了稳定RKHS的子类。稳定RKHS仅包含正实数线上的绝对可积脉冲响应。因此，它们可以作为假设空间用于从输入输出数据中估计线性、时不变和BIBO稳定的动态系统。RKHS稳定性的必要和充分条件已经在文献中得到了证明，并且已知核的绝对可积性意味着稳定性。最近的一项工作中，我们通过在离散时间中工作，证明了这个条件只是充分条件。在连续时间中工作，本文旨在证明同样的结果也适用于Mercer核。",
    "tldr": "本文证明了Mercer核的绝对可积性仅仅是RKHS稳定性的充分条件。"
}