{
    "title": "DiffuSIA: A Spiral Interaction Architecture for Encoder-Decoder Text Diffusion. (arXiv:2305.11517v1 [cs.CL])",
    "abstract": "Diffusion models have emerged as the new state-of-the-art family of deep generative models, and their promising potentials for text generation have recently attracted increasing attention. Existing studies mostly adopt a single encoder architecture with partially noising processes for conditional text generation, but its degree of flexibility for conditional modeling is limited. In fact, the encoder-decoder architecture is naturally more flexible for its detachable encoder and decoder modules, which is extensible to multilingual and multimodal generation tasks for conditions and target texts. However, the encoding process of conditional texts lacks the understanding of target texts. To this end, a spiral interaction architecture for encoder-decoder text diffusion (DiffuSIA) is proposed. Concretely, the conditional information from encoder is designed to be captured by the diffusion decoder, while the target information from decoder is designed to be captured by the conditional encoder.",
    "link": "http://arxiv.org/abs/2305.11517",
    "context": "Title: DiffuSIA: A Spiral Interaction Architecture for Encoder-Decoder Text Diffusion. (arXiv:2305.11517v1 [cs.CL])\nAbstract: Diffusion models have emerged as the new state-of-the-art family of deep generative models, and their promising potentials for text generation have recently attracted increasing attention. Existing studies mostly adopt a single encoder architecture with partially noising processes for conditional text generation, but its degree of flexibility for conditional modeling is limited. In fact, the encoder-decoder architecture is naturally more flexible for its detachable encoder and decoder modules, which is extensible to multilingual and multimodal generation tasks for conditions and target texts. However, the encoding process of conditional texts lacks the understanding of target texts. To this end, a spiral interaction architecture for encoder-decoder text diffusion (DiffuSIA) is proposed. Concretely, the conditional information from encoder is designed to be captured by the diffusion decoder, while the target information from decoder is designed to be captured by the conditional encoder.",
    "path": "papers/23/05/2305.11517.json",
    "total_tokens": 879,
    "translated_title": "DiffuSIA：一种编码器-解码器文本扩散的螺旋交互架构",
    "translated_abstract": "扩散模型已成为新一代深度生成模型的最新代表，并且近年来它们在文本生成方面的潜力引起了越来越多的关注。现有的研究大多采用单个编码器结构和部分噪声过程用于条件文本生成，但是其对于条件建模的灵活性有限。实际上，编码器-解码器架构对于它的可分离编码器和解码器模块天然更加灵活，可扩展到多语言和多模态的生成任务。然而，有条件的文本编码过程缺乏对目标文本的理解。为此，我们提出了一种用于编码器-解码器文本扩散的螺旋交互架构（DiffuSIA）。具体来说，设计了从编码器捕获条件信息并被扩散解码器捕获，以及从解码器捕获目标信息并被条件编码器捕获的机制。",
    "tldr": "本文提出一种名为DiffuSIA的螺旋交互架构，用于编码器-解码器文本扩散。在这个架构中，条件信息和目标信息会交互捕获，以提高条件文本生成的效果。",
    "en_tdlr": "This paper proposes a spiral interaction architecture named DiffuSIA for encoder-decoder text diffusion, where the conditional information from encoder and target information from decoder interact to improve the conditional text generation."
}