{
    "title": "The centralizing effects of private order flow on proposer-builder separation. (arXiv:2305.19150v1 [econ.TH])",
    "abstract": "The current Proposer Builder Separation (PBS) equilibrium has several builders with different backgrounds winning blocks consistently. This paper considers how this equilibrium will shift when transactions are sold privately via order flow auctions (OFAs) rather than forwarded directly to the public mempool. We discuss a novel model that highlights the augmented value of private order flow for integrated builder searchers. We show that private order flow is complementary to top-of-block opportunities, and therefore integrated builder-searchers are more likely to participate in OFAs and outbid non integrated builders. They will then parlay access to these private transactions into an advantage in the PBS auction, winning blocks more often and extracting higher profits than non-integrated builders. To validate our main assumptions, we construct a novel dataset pairing post-merge PBS outcomes with realized 12-second volatility on a leading CEX (Binance). Our results show that integrated b",
    "link": "http://arxiv.org/abs/2305.19150",
    "context": "Title: The centralizing effects of private order flow on proposer-builder separation. (arXiv:2305.19150v1 [econ.TH])\nAbstract: The current Proposer Builder Separation (PBS) equilibrium has several builders with different backgrounds winning blocks consistently. This paper considers how this equilibrium will shift when transactions are sold privately via order flow auctions (OFAs) rather than forwarded directly to the public mempool. We discuss a novel model that highlights the augmented value of private order flow for integrated builder searchers. We show that private order flow is complementary to top-of-block opportunities, and therefore integrated builder-searchers are more likely to participate in OFAs and outbid non integrated builders. They will then parlay access to these private transactions into an advantage in the PBS auction, winning blocks more often and extracting higher profits than non-integrated builders. To validate our main assumptions, we construct a novel dataset pairing post-merge PBS outcomes with realized 12-second volatility on a leading CEX (Binance). Our results show that integrated b",
    "path": "papers/23/05/2305.19150.json",
    "total_tokens": 954,
    "translated_title": "私人订单流对建议者-建造者间分离的集中效应",
    "translated_abstract": "当交易通过订单流拍卖（OFA）私下销售而非直接转发到公共“mempool”时，当前的建议者-建造者间分离（PBS）均衡将发生何种变化？本文提出了一个新颖的模型，突出了对集成建造者搜索的私人订单流的增值作用。我们表明，私人订单流对于上方区块机会是互补，因此集成的建造者搜索者更可能参与OFA，并击败非集成的建造者。他们将利用对这些私人交易的访问，在PBS拍卖中获得优势，比非集成的建造者更加频繁地赢得区块并提取更高的利润。为了验证我们的主要假设，我们构建了一个新的数据集，将PBS结果与一家领先的CEX（Binance）实现的12秒波动性匹配。我们的结果表明，通过战略性地利用私人订单流，集成的建造者搜索者在PBS拍卖中获得了显著的优势。",
    "tldr": "本文研究了当交易通过订单流拍卖私下销售而非直接转发到公共“mempool”时，建议者-建造者分离均衡将发生何种变化。研究表明，对于集成的建造者搜索者而言，私人订单流在PBS拍卖中具有重要的战略价值。",
    "en_tdlr": "This paper investigates how the Proposer Builder Separation (PBS) equilibrium will shift when transactions are sold privately via order flow auctions (OFAs), and shows that private order flow provides strategic value for integrated builder searchers, leading to a significant advantage for them in the PBS auction."
}