{
    "title": "Energy-dependent barren plateau in bosonic variational quantum circuits. (arXiv:2305.01799v1 [quant-ph])",
    "abstract": "Bosonic continuous-variable Variational quantum circuits (VQCs) are crucial for information processing in cavity quantum electrodynamics and optical systems, widely applicable in quantum communication, sensing and error correction. The trainability of such VQCs is less understood, hindered by the lack of theoretical tools such as $t$-design due to the infinite dimension of the physical systems involved. We overcome this difficulty to reveal an energy-dependent barren plateau in such VQCs. The variance of the gradient decays as $1/E^{M\\nu}$, exponential in the number of modes $M$ but polynomial in the (per-mode) circuit energy $E$. The exponent $\\nu=1$ for shallow circuits and $\\nu=2$ for deep circuits. We prove these results for state preparation of general Gaussian states and number states. We also provide numerical evidence that the results extend to general state preparation tasks. As circuit energy is a controllable parameter, we provide a strategy to mitigate the barren plateau in",
    "link": "http://arxiv.org/abs/2305.01799",
    "context": "Title: Energy-dependent barren plateau in bosonic variational quantum circuits. (arXiv:2305.01799v1 [quant-ph])\nAbstract: Bosonic continuous-variable Variational quantum circuits (VQCs) are crucial for information processing in cavity quantum electrodynamics and optical systems, widely applicable in quantum communication, sensing and error correction. The trainability of such VQCs is less understood, hindered by the lack of theoretical tools such as $t$-design due to the infinite dimension of the physical systems involved. We overcome this difficulty to reveal an energy-dependent barren plateau in such VQCs. The variance of the gradient decays as $1/E^{M\\nu}$, exponential in the number of modes $M$ but polynomial in the (per-mode) circuit energy $E$. The exponent $\\nu=1$ for shallow circuits and $\\nu=2$ for deep circuits. We prove these results for state preparation of general Gaussian states and number states. We also provide numerical evidence that the results extend to general state preparation tasks. As circuit energy is a controllable parameter, we provide a strategy to mitigate the barren plateau in",
    "path": "papers/23/05/2305.01799.json",
    "total_tokens": 882,
    "tldr": "本文研究了玻色型变分量子电路中的贫瘠高原问题，提出了缓解该问题的策略。",
    "en_tdlr": "This paper studies the barren plateau problem in bosonic variational quantum circuits and proposes a strategy to mitigate it."
}