{
    "title": "Hierarchical Prompting Assists Large Language Model on Web Navigation. (arXiv:2305.14257v2 [cs.CL] UPDATED)",
    "abstract": "Large language models (LLMs) struggle on processing complicated observations in interactive decision making tasks. To alleviate this issue, we propose a simple hierarchical prompting approach. Diverging from previous prompting approaches that always put the \\emph{full} observation~(\\eg a web page) to the prompt, we propose to first construct an action-aware observation which is more \\emph{condensed} and \\emph{relevant} with a dedicated \\summ prompt. The \\actor prompt then predicts the next action based on the summarized observation. While our method has broad applicability, we particularly demonstrate its efficacy in the complex domain of web navigation where a full observation often contains redundant and irrelevant information. Our approach outperforms the previous state-of-the-art prompting mechanis by 6.2\\% on task success rate, demonstrating its potential on interactive decision making tasks with long observation traces.",
    "link": "http://arxiv.org/abs/2305.14257",
    "context": "Title: Hierarchical Prompting Assists Large Language Model on Web Navigation. (arXiv:2305.14257v2 [cs.CL] UPDATED)\nAbstract: Large language models (LLMs) struggle on processing complicated observations in interactive decision making tasks. To alleviate this issue, we propose a simple hierarchical prompting approach. Diverging from previous prompting approaches that always put the \\emph{full} observation~(\\eg a web page) to the prompt, we propose to first construct an action-aware observation which is more \\emph{condensed} and \\emph{relevant} with a dedicated \\summ prompt. The \\actor prompt then predicts the next action based on the summarized observation. While our method has broad applicability, we particularly demonstrate its efficacy in the complex domain of web navigation where a full observation often contains redundant and irrelevant information. Our approach outperforms the previous state-of-the-art prompting mechanis by 6.2\\% on task success rate, demonstrating its potential on interactive decision making tasks with long observation traces.",
    "path": "papers/23/05/2305.14257.json",
    "total_tokens": 840,
    "translated_title": "分层提示提升大规模语言模型在网络导航中的应用",
    "translated_abstract": "大规模语言模型（LLMs）在处理交互决策任务中的复杂观察时遇到困难。为了解决这个问题，我们提出了一种简单的分层提示方法。不同于以往总是把\\emph{完整}观察（例如网页）放到提示中的提示方法，我们提出首先构建一个与动作相关的\\emph{压缩}和\\emph{相关}的观察，并使用专门的\\summ提示。然后，\\actor提示根据总结的观察预测下一个动作。尽管我们的方法具有广泛的适用性，但我们尤其展示了它在复杂的网络导航领域的有效性，其中完整的观察通常包含冗余和无关信息。我们的方法在任务成功率上优于先前最先进的提示机制6.2\\%，展示了其在具有长时间观察轨迹的交互决策任务中的潜力。",
    "tldr": "这项研究提出了一种分层提示方法来解决大规模语言模型在处理复杂观察的交互决策任务中的困难。研究表明该方法在网络导航中的效果优于先前最先进的提示机制，具有广泛的适用性。"
}