{
    "title": "The Case Records of ChatGPT: Language Models and Complex Clinical Questions. (arXiv:2305.05609v1 [cs.CL])",
    "abstract": "Background: Artificial intelligence language models have shown promise in various applications, including assisting with clinical decision-making as demonstrated by strong performance of large language models on medical licensure exams. However, their ability to solve complex, open-ended cases, which may be representative of clinical practice, remains unexplored. Methods: In this study, the accuracy of large language AI models GPT4 and GPT3.5 in diagnosing complex clinical cases was investigated using published Case Records of the Massachusetts General Hospital. A total of 50 cases requiring a diagnosis and diagnostic test published from January 1, 2022 to April 16, 2022 were identified. For each case, models were given a prompt requesting the top three specific diagnoses and associated diagnostic tests, followed by case text, labs, and figure legends. Model outputs were assessed in comparison to the final clinical diagnosis and whether the model-predicted test would result in a correc",
    "link": "http://arxiv.org/abs/2305.05609",
    "context": "Title: The Case Records of ChatGPT: Language Models and Complex Clinical Questions. (arXiv:2305.05609v1 [cs.CL])\nAbstract: Background: Artificial intelligence language models have shown promise in various applications, including assisting with clinical decision-making as demonstrated by strong performance of large language models on medical licensure exams. However, their ability to solve complex, open-ended cases, which may be representative of clinical practice, remains unexplored. Methods: In this study, the accuracy of large language AI models GPT4 and GPT3.5 in diagnosing complex clinical cases was investigated using published Case Records of the Massachusetts General Hospital. A total of 50 cases requiring a diagnosis and diagnostic test published from January 1, 2022 to April 16, 2022 were identified. For each case, models were given a prompt requesting the top three specific diagnoses and associated diagnostic tests, followed by case text, labs, and figure legends. Model outputs were assessed in comparison to the final clinical diagnosis and whether the model-predicted test would result in a correc",
    "path": "papers/23/05/2305.05609.json",
    "total_tokens": 1109,
    "translated_title": "ChatGPT案例记录：语言模型与复杂临床问题",
    "translated_abstract": "背景：人工智能语言模型已在各种应用中显示出潜力，包括在辅助临床决策方面，如大型语言模型在医疗许可考试中的表现。然而，它们解决复杂、开放性的病例的能力（可能代表临床实践）仍未被探索。方法：本研究使用麻省总医院的案例记录，调查了大型语言人工智能模型GPT4和GPT3.5在诊断复杂临床病例方面的准确性。共识别了50个需要诊断和诊断测试的病例，发表于2022年1月1日至2022年4月16日。对于每个病例，模型会收到一个提示，请求前三个具体的诊断和相关的诊断测试，然后是案例文本、实验室和图例。将模型的输出与最终临床诊断进行比较，检查模型预测的测试是否会导致正确的诊断。结果：GPT3.5和GPT4都表现出在生成正确的诊断和推荐测试方面的高准确性，其中GPT4的表现优于GPT3.5。结论：这些发现表明，人工智能语言模型具有协助处理复杂临床决策的潜力，特别是在医学专家资源受限的情况下。",
    "tldr": "本研究探究了GPT4和GPT3.5在复杂临床病例诊断中的表现，并表明人工智能语言模型在协助临床决策方面具有潜在的作用，尤其是在医学资源受限的情况下。",
    "en_tdlr": "This study investigated the performance of GPT4 and GPT3.5 in diagnosing complex clinical cases, demonstrating potential for AI language models to assist with clinical decision-making, especially in settings with limited access to medical specialists."
}