{
    "title": "Defining Replicability of Prediction Rules. (arXiv:2305.01518v1 [stat.ME])",
    "abstract": "In this article I propose an approach for defining replicability for prediction rules. Motivated by a recent NAS report, I start from the perspective that replicability is obtaining consistent results across studies suitable to address the same prediction question, each of which has obtained its own data. I then discuss concept and issues in defining key elements of this statement. I focus specifically on the meaning of \"consistent results\" in typical utilization contexts, and propose a multi-agent framework for defining replicability, in which agents are neither partners nor adversaries. I recover some of the prevalent practical approaches as special cases. I hope to provide guidance for a more systematic assessment of replicability in machine learning.",
    "link": "http://arxiv.org/abs/2305.01518",
    "context": "Title: Defining Replicability of Prediction Rules. (arXiv:2305.01518v1 [stat.ME])\nAbstract: In this article I propose an approach for defining replicability for prediction rules. Motivated by a recent NAS report, I start from the perspective that replicability is obtaining consistent results across studies suitable to address the same prediction question, each of which has obtained its own data. I then discuss concept and issues in defining key elements of this statement. I focus specifically on the meaning of \"consistent results\" in typical utilization contexts, and propose a multi-agent framework for defining replicability, in which agents are neither partners nor adversaries. I recover some of the prevalent practical approaches as special cases. I hope to provide guidance for a more systematic assessment of replicability in machine learning.",
    "path": "papers/23/05/2305.01518.json",
    "total_tokens": 745,
    "translated_title": "定义预测规则的可复制性",
    "translated_abstract": "本文提出了一种定义预测规则可复制性的方法。受最近一份美国国家科学院报告的启发，文章从一个角度出发，认为可复制性是在适合回答同一预测问题的多个研究中获得一致结果，每个研究都有自己的数据。然后讨论了定义该语句关键部分的概念和问题，并专注于典型利用环境中“一致结果”的含义，提出了一个多代理人框架来定义可复制性，代理人既不是合作伙伴也不是对手。其中一些普遍实用的方法成为特例。希望为机器学习中更系统的可复制性评估提供指导。",
    "tldr": "本文提出了一种定义预测规则可复制性的方法，通过多代理人框架定义可复制性，旨在为机器学习中更系统的可复制性评估提供指导。",
    "en_tdlr": "This article proposes an approach for defining replicability for prediction rules, with a focus on obtaining consistent results across studies suitable to address the same prediction question, using a multi-agent framework to define replicability and providing guidance for a more systematic assessment of replicability in machine learning."
}