{
    "title": "Effortless Integration of Memory Management into Open-Domain Conversation Systems. (arXiv:2305.13973v1 [cs.CL])",
    "abstract": "Open-domain conversation systems integrate multiple conversation skills into a single system through a modular approach. One of the limitations of the system, however, is the absence of management capability for external memory. In this paper, we propose a simple method to improve BlenderBot3 by integrating memory management ability into it. Since no training data exists for this purpose, we propose an automating dataset creation for memory management. Our method 1) requires little cost for data construction, 2) does not affect performance in other tasks, and 3) reduces external memory. We show that our proposed model BlenderBot3-M^3, which is multi-task trained with memory management, outperforms BlenderBot3 with a relative 4% performance gain in terms of F1 score.",
    "link": "http://arxiv.org/abs/2305.13973",
    "context": "Title: Effortless Integration of Memory Management into Open-Domain Conversation Systems. (arXiv:2305.13973v1 [cs.CL])\nAbstract: Open-domain conversation systems integrate multiple conversation skills into a single system through a modular approach. One of the limitations of the system, however, is the absence of management capability for external memory. In this paper, we propose a simple method to improve BlenderBot3 by integrating memory management ability into it. Since no training data exists for this purpose, we propose an automating dataset creation for memory management. Our method 1) requires little cost for data construction, 2) does not affect performance in other tasks, and 3) reduces external memory. We show that our proposed model BlenderBot3-M^3, which is multi-task trained with memory management, outperforms BlenderBot3 with a relative 4% performance gain in terms of F1 score.",
    "path": "papers/23/05/2305.13973.json",
    "total_tokens": 777,
    "translated_title": "无缝集成内存管理到开放域对话系统中的方法",
    "translated_abstract": "开放域对话系统通过模块化方法将多种对话技能整合到单一系统中。然而，该系统的一个限制是缺乏外部内存的管理能力。在本文中，我们提出了一种简单的方法，将内存管理能力集成到 BlenderBot3 中以改进其性能。由于没有用于此目的的训练数据，我们提出一种自动化数据集创建方法来管理内存。我们的方法 1) 需要很少的数据构建成本，2) 不会影响其他任务的性能，3) 减少了外部内存的使用。我们展示了我们提出的模型 BlenderBot3-M^3，它是多任务训练的内存管理版本，在 F1 分数方面相对于 BlenderBot3 提高了 4%。",
    "tldr": "本文提出了一种简单的方法，将内存管理能力集成到 BlenderBot3 中以改进其性能，并通过自动化数据集创建来管理内存。对于 F1 分数，我们提出的模型 BlenderBot3-M^3 比 BlenderBot3 提高了 4%。"
}