{
    "title": "Hoarding without hoarders: unpacking the emergence of opportunity hoarding within schools. (arXiv:2305.14653v1 [physics.soc-ph])",
    "abstract": "Sociologists of education increasingly highlight the role of opportunity hoarding in the formation of Black-White educational inequalities. Informed by this literature, this article unpacks the necessary and sufficient conditions under which the hoarding of educational resources emerges within schools. It develops a qualitatively informed agent-based model which captures Black and White students' competition for a valuable school resource: advanced coursework. In contrast to traditional accounts -- which explain the emergence of hoarding through the actions of Whites that keep valuable resources within White communities -- simulations, perhaps surprisingly, show hoarding to arise even when Whites do not play the role of hoarders of resources. Behind this result is the fact that a structural inequality (i.e., racial differences in social class) -- and not action-driven hoarding -- is the necessary condition for hoarding to emerge. Findings, therefore, illustrate that common action-drive",
    "link": "http://arxiv.org/abs/2305.14653",
    "context": "Title: Hoarding without hoarders: unpacking the emergence of opportunity hoarding within schools. (arXiv:2305.14653v1 [physics.soc-ph])\nAbstract: Sociologists of education increasingly highlight the role of opportunity hoarding in the formation of Black-White educational inequalities. Informed by this literature, this article unpacks the necessary and sufficient conditions under which the hoarding of educational resources emerges within schools. It develops a qualitatively informed agent-based model which captures Black and White students' competition for a valuable school resource: advanced coursework. In contrast to traditional accounts -- which explain the emergence of hoarding through the actions of Whites that keep valuable resources within White communities -- simulations, perhaps surprisingly, show hoarding to arise even when Whites do not play the role of hoarders of resources. Behind this result is the fact that a structural inequality (i.e., racial differences in social class) -- and not action-driven hoarding -- is the necessary condition for hoarding to emerge. Findings, therefore, illustrate that common action-drive",
    "path": "papers/23/05/2305.14653.json",
    "total_tokens": 1032,
    "translated_title": "无囤积者的囤积：揭开学校内机会囤积的出现过程",
    "translated_abstract": "教育社会学家越来越强调机会垄断在黑白教育不平等形成中的作用。受此文献的启发，本文拆分了必要和充分的条件，以便在学校内产生教育资源囤积。它开发了一个信息量丰富的基于代理的模型，捕捉黑人和白人学生竞争有价值的学校资源：高级课程。与传统解释囤积是白人将有价值的资源保留在白人社群内的观点相反，模拟显示出即使白人不扮演囤积者资源的角色，囤积也会出现。这个结果背后的原因是结构性的不平等（即社会阶级的种族差异） - 而不是行动驱动的囤积 - 是囤积产生的必要条件。因此，研究结果说明了关于囤积的普遍行动驱动定义和解释可能是不充分的。此外，该模型强调了在分析教育机会垄断时考虑结构性不平等的重要性。",
    "tldr": "本文提供了关于学校内机会囤积出现必要和充分条件的研究，模拟表明囤积即使在白人不扮演囤积者资源角色的情况下也会出现，其背后是结构性的不平等条件。这强调了在分析教育机会垄断时考虑结构性不平等的重要性。"
}