{
    "title": "SLABERT Talk Pretty One Day: Modeling Second Language Acquisition with BERT. (arXiv:2305.19589v1 [cs.CL])",
    "abstract": "Second language acquisition (SLA) research has extensively studied cross-linguistic transfer, the influence of linguistic structure of a speaker's native language [L1] on the successful acquisition of a foreign language [L2]. Effects of such transfer can be positive (facilitating acquisition) or negative (impeding acquisition). We find that NLP literature has not given enough attention to the phenomenon of negative transfer. To understand patterns of both positive and negative transfer between L1 and L2, we model sequential second language acquisition in LMs. Further, we build a Mutlilingual Age Ordered CHILDES (MAO-CHILDES) -- a dataset consisting of 5 typologically diverse languages, i.e., German, French, Polish, Indonesian, and Japanese -- to understand the degree to which native Child-Directed Speech (CDS) [L1] can help or conflict with English language acquisition [L2]. To examine the impact of native CDS, we use the TILT-based cross lingual transfer learning approach established ",
    "link": "http://arxiv.org/abs/2305.19589",
    "context": "Title: SLABERT Talk Pretty One Day: Modeling Second Language Acquisition with BERT. (arXiv:2305.19589v1 [cs.CL])\nAbstract: Second language acquisition (SLA) research has extensively studied cross-linguistic transfer, the influence of linguistic structure of a speaker's native language [L1] on the successful acquisition of a foreign language [L2]. Effects of such transfer can be positive (facilitating acquisition) or negative (impeding acquisition). We find that NLP literature has not given enough attention to the phenomenon of negative transfer. To understand patterns of both positive and negative transfer between L1 and L2, we model sequential second language acquisition in LMs. Further, we build a Mutlilingual Age Ordered CHILDES (MAO-CHILDES) -- a dataset consisting of 5 typologically diverse languages, i.e., German, French, Polish, Indonesian, and Japanese -- to understand the degree to which native Child-Directed Speech (CDS) [L1] can help or conflict with English language acquisition [L2]. To examine the impact of native CDS, we use the TILT-based cross lingual transfer learning approach established ",
    "path": "papers/23/05/2305.19589.json",
    "total_tokens": 925,
    "translated_title": "SLABERT：使用BERT模型建模第二语言习得",
    "translated_abstract": "第二语言习得（SLA）研究广泛研究了跨语言转移，即母语[L1]的语言结构对外语[L2]习得的影响。这种转移的影响可以是积极的(促进习得)或消极的(阻碍习得)。我们发现NLP文献没有足够关注消极转移现象。为了理解L1和L2之间积极和消极转移的模式，我们使用语言模型对顺序第二语言习得进行建模。此外，我们构建了一个多语言年龄排序CHILDES（MAO-CHILDES）数据集，其中包括5种类型不同的语言，即德语、法语、波兰语、印度尼西亚语和日语，以理解母语儿童指导语言（CDS）[L1]对英语语言习得[L2]有多大帮助或冲突。为了检查母语CDS的影响，我们使用TILT-based跨语言转移学习方法。",
    "tldr": "该论文利用BERT模型建模了第二语言习得，并构建了一个多语言数据集以研究母语儿童指导语言（CDS）对英文语言习得的积极和消极转移现象。",
    "en_tdlr": "This paper uses BERT model to model second language acquisition and constructs a multilingual dataset to study the positive and negative transfer phenomena during English language acquisition influenced by native Child-Directed Speech (CDS) in 5 typologically diverse languages."
}