{
    "title": "Unsupervised Scientific Abstract Segmentation with Normalized Mutual Information. (arXiv:2305.11553v1 [cs.CL])",
    "abstract": "The abstracts of scientific papers consist of premises and conclusions. Structured abstracts explicitly highlight the conclusion sentences, whereas non-structured abstracts may have conclusion sentences at uncertain positions. This implicit nature of conclusion positions makes the automatic segmentation of scientific abstracts into premises and conclusions a challenging task. In this work, we empirically explore using Normalized Mutual Information (NMI) for abstract segmentation. We consider each abstract as a recurrent cycle of sentences and place segmentation boundaries by greedily optimizing the NMI score between premises and conclusions. On non-structured abstracts, our proposed unsupervised approach GreedyCAS achieves the best performance across all evaluation metrics; on structured abstracts, GreedyCAS outperforms all baseline methods measured by $P_k$. The strong correlation of NMI to our evaluation metrics reveals the effectiveness of NMI for abstract segmentation.",
    "link": "http://arxiv.org/abs/2305.11553",
    "context": "Title: Unsupervised Scientific Abstract Segmentation with Normalized Mutual Information. (arXiv:2305.11553v1 [cs.CL])\nAbstract: The abstracts of scientific papers consist of premises and conclusions. Structured abstracts explicitly highlight the conclusion sentences, whereas non-structured abstracts may have conclusion sentences at uncertain positions. This implicit nature of conclusion positions makes the automatic segmentation of scientific abstracts into premises and conclusions a challenging task. In this work, we empirically explore using Normalized Mutual Information (NMI) for abstract segmentation. We consider each abstract as a recurrent cycle of sentences and place segmentation boundaries by greedily optimizing the NMI score between premises and conclusions. On non-structured abstracts, our proposed unsupervised approach GreedyCAS achieves the best performance across all evaluation metrics; on structured abstracts, GreedyCAS outperforms all baseline methods measured by $P_k$. The strong correlation of NMI to our evaluation metrics reveals the effectiveness of NMI for abstract segmentation.",
    "path": "papers/23/05/2305.11553.json",
    "total_tokens": 854,
    "translated_title": "基于标准化互信息的无监督科技论文摘要分割",
    "translated_abstract": "科技论文摘要由前提和结论组成。结构化摘要明确突出结论句子，而非结构化摘要则可能在不确定位置有结论句子，这种隐含的结论位置使得科技论文摘要的自动分割成为一项具有挑战性的任务。本研究通过实证探索使用标准化互信息（NMI）进行摘要分割。我们将每个摘要视为一个循环的句子，并通过贪婪地优化前提和结论之间的NMI分数来放置分割边界。在非结构化摘要中，我们提出的无监督方法GreedyCAS在所有评估指标中表现最佳。在结构化摘要中，GreedyCAS通过$P_k$的各项基准测试中表现更好。NMI与我们的评估指标的强相关性揭示了NMI在摘要分割中的有效性。",
    "tldr": "本论文提出了一种基于标准化互信息的无监督科技论文摘要分割方法，其中GreedyCAS在非结构化摘要和结构化摘要中均表现出色。",
    "en_tdlr": "This paper proposes an unsupervised approach using Normalized Mutual Information (NMI) for scientific abstract segmentation, with the proposed method GreedyCAS performing well on both structured and non-structured abstracts. The strong correlation of NMI to the evaluation metrics reveals its effectiveness for abstract segmentation."
}