{
    "title": "Evaluation of Speaker Anonymization on Emotional Speech. (arXiv:2305.01759v1 [eess.AS])",
    "abstract": "Speech data carries a range of personal information, such as the speaker's identity and emotional state. These attributes can be used for malicious purposes. With the development of virtual assistants, a new generation of privacy threats has emerged. Current studies have addressed the topic of preserving speech privacy. One of them, the VoicePrivacy initiative aims to promote the development of privacy preservation tools for speech technology. The task selected for the VoicePrivacy 2020 Challenge (VPC) is about speaker anonymization. The goal is to hide the source speaker's identity while preserving the linguistic information. The baseline of the VPC makes use of a voice conversion. This paper studies the impact of the speaker anonymization baseline system of the VPC on emotional information present in speech utterances. Evaluation is performed following the VPC rules regarding the attackers' knowledge about the anonymization system. Our results show that the VPC baseline system does n",
    "link": "http://arxiv.org/abs/2305.01759",
    "context": "Title: Evaluation of Speaker Anonymization on Emotional Speech. (arXiv:2305.01759v1 [eess.AS])\nAbstract: Speech data carries a range of personal information, such as the speaker's identity and emotional state. These attributes can be used for malicious purposes. With the development of virtual assistants, a new generation of privacy threats has emerged. Current studies have addressed the topic of preserving speech privacy. One of them, the VoicePrivacy initiative aims to promote the development of privacy preservation tools for speech technology. The task selected for the VoicePrivacy 2020 Challenge (VPC) is about speaker anonymization. The goal is to hide the source speaker's identity while preserving the linguistic information. The baseline of the VPC makes use of a voice conversion. This paper studies the impact of the speaker anonymization baseline system of the VPC on emotional information present in speech utterances. Evaluation is performed following the VPC rules regarding the attackers' knowledge about the anonymization system. Our results show that the VPC baseline system does n",
    "path": "papers/23/05/2305.01759.json",
    "total_tokens": 878,
    "translated_title": "演讲者匿名化对情感语音的影响评估",
    "translated_abstract": "语音数据携带着个人的信息，如演讲者的身份和情感状态。这些属性可能被用于恶意目的。随着虚拟助手的发展，出现了新一代的隐私威胁。当前的研究已经解决了保护语音隐私的话题，其中之一是VoicePrivacy倡议，旨在促进为语音技术开发隐私保护工具。VoicePrivacy 2020挑战赛（VPC）选定的任务是演讲者匿名化。目标是隐藏源演讲者的身份，同时保留语言信息。VPC的基准线使用了语音转换。本文研究了VPC基准线系统对语音话语中情感信息的影响。按照攻击者对匿名化系统的了解，执行了评估。我们的研究结果表明，VPC基准线系统未能有效地匿名化语音中的情感信息，这可能会对演讲者的隐私造成潜在威胁。",
    "tldr": "本文研究了VoicePrivacy 2020 Challenge中演讲者匿名化对情感语音的影响，并发现其未能有效地保护演讲者的隐私。",
    "en_tdlr": "This paper evaluates the impact of speaker anonymization on emotional speech and finds that the baseline system of the VoicePrivacy Challenge does not effectively protect speaker privacy."
}