{
    "title": "From chocolate bunny to chocolate crocodile: Do Language Models Understand Noun Compounds?. (arXiv:2305.10568v1 [cs.CL])",
    "abstract": "Noun compound interpretation is the task of expressing a noun compound (e.g. chocolate bunny) in a free-text paraphrase that makes the relationship between the constituent nouns explicit (e.g. bunny-shaped chocolate). We propose modifications to the data and evaluation setup of the standard task (Hendrickx et al., 2013), and show that GPT-3 solves it almost perfectly. We then investigate the task of noun compound conceptualization, i.e. paraphrasing a novel or rare noun compound. E.g., chocolate crocodile is a crocodile-shaped chocolate. This task requires creativity, commonsense, and the ability to generalize knowledge about similar concepts. While GPT-3's performance is not perfect, it is better than that of humans -- likely thanks to its access to vast amounts of knowledge, and because conceptual processing is effortful for people (Connell and Lynott, 2012). Finally, we estimate the extent to which GPT-3 is reasoning about the world vs. parroting its training data. We find that the ",
    "link": "http://arxiv.org/abs/2305.10568",
    "context": "Title: From chocolate bunny to chocolate crocodile: Do Language Models Understand Noun Compounds?. (arXiv:2305.10568v1 [cs.CL])\nAbstract: Noun compound interpretation is the task of expressing a noun compound (e.g. chocolate bunny) in a free-text paraphrase that makes the relationship between the constituent nouns explicit (e.g. bunny-shaped chocolate). We propose modifications to the data and evaluation setup of the standard task (Hendrickx et al., 2013), and show that GPT-3 solves it almost perfectly. We then investigate the task of noun compound conceptualization, i.e. paraphrasing a novel or rare noun compound. E.g., chocolate crocodile is a crocodile-shaped chocolate. This task requires creativity, commonsense, and the ability to generalize knowledge about similar concepts. While GPT-3's performance is not perfect, it is better than that of humans -- likely thanks to its access to vast amounts of knowledge, and because conceptual processing is effortful for people (Connell and Lynott, 2012). Finally, we estimate the extent to which GPT-3 is reasoning about the world vs. parroting its training data. We find that the ",
    "path": "papers/23/05/2305.10568.json",
    "total_tokens": 823,
    "translated_title": "从巧克力兔到巧克力鳄鱼：语言模型是否理解名词复合词？",
    "translated_abstract": "名词复合词是指将多个名词组合成一个新词，如“巧克力兔”。本文提出了一种名词复合词解释的任务并修改了该任务的数据和评估设置。结果表明，GPT-3（一种语言模型）几乎可以完美地解决该任务。同时，本文还探讨了名词复合词概念化的任务，即解释新颖或罕见的名词组合词。最后，我们评估了GPT-3推理世界的程度，并发现它的表现优于人类。",
    "tldr": "本文研究了语言模型对于名词复合词的理解能力，提出了名词复合词解释的任务和名词复合词概念化的任务，并发现GPT-3在这些任务中的表现优于人类。",
    "en_tdlr": "This paper investigates the language model's understanding of noun compounds and proposes tasks for noun compound interpretation and conceptualization. The results show that GPT-3 outperforms humans in these tasks, highlighting its access to vast amounts of knowledge and its ability to process conceptual information with greater ease than humans."
}