{
    "title": "SS-BSN: Attentive Blind-Spot Network for Self-Supervised Denoising with Nonlocal Self-Similarity. (arXiv:2305.09890v1 [cs.CV])",
    "abstract": "Recently, numerous studies have been conducted on supervised learning-based image denoising methods. However, these methods rely on large-scale noisy-clean image pairs, which are difficult to obtain in practice. Denoising methods with self-supervised training that can be trained with only noisy images have been proposed to address the limitation. These methods are based on the convolutional neural network (CNN) and have shown promising performance. However, CNN-based methods do not consider using nonlocal self-similarities essential in the traditional method, which can cause performance limitations. This paper presents self-similarity attention (SS-Attention), a novel self-attention module that can capture nonlocal self-similarities to solve the problem. We focus on designing a lightweight self-attention module in a pixel-wise manner, which is nearly impossible to implement using the classic self-attention module due to the quadratically increasing complexity with spatial resolution. F",
    "link": "http://arxiv.org/abs/2305.09890",
    "context": "Title: SS-BSN: Attentive Blind-Spot Network for Self-Supervised Denoising with Nonlocal Self-Similarity. (arXiv:2305.09890v1 [cs.CV])\nAbstract: Recently, numerous studies have been conducted on supervised learning-based image denoising methods. However, these methods rely on large-scale noisy-clean image pairs, which are difficult to obtain in practice. Denoising methods with self-supervised training that can be trained with only noisy images have been proposed to address the limitation. These methods are based on the convolutional neural network (CNN) and have shown promising performance. However, CNN-based methods do not consider using nonlocal self-similarities essential in the traditional method, which can cause performance limitations. This paper presents self-similarity attention (SS-Attention), a novel self-attention module that can capture nonlocal self-similarities to solve the problem. We focus on designing a lightweight self-attention module in a pixel-wise manner, which is nearly impossible to implement using the classic self-attention module due to the quadratically increasing complexity with spatial resolution. F",
    "path": "papers/23/05/2305.09890.json",
    "total_tokens": 928,
    "translated_title": "SS-BSN:注意力盲点网络，用于自监督去噪与非局部自相似性",
    "translated_abstract": "最近，有许多关于基于监督学习的图像去噪方法的研究，但这些方法依赖于大规模的噪声-干净图像对，这在实践中很难获得。为了解决这个限制问题，提出了一种可以只使用有噪声的图像进行训练的自监督训练的去噪方法。这些方法基于卷积神经网络（CNN），并展现了很好的性能。然而，基于CNN的方法没有考虑到传统方法中使用的非局部自相似性，这可能会导致性能上的限制。本文提出了自相似性注意力（SS-Attention），一种能够捕捉非局部自相似性并解决该问题的新型自注意力模块。我们的重点是以像素为基础设计一个轻量级的自注意力模块，而经典的自注意力模块则无法实现，因为其随着空间分辨率而呈二次递增的复杂度会导致实现困难。",
    "tldr": "本文提出了一种自监督训练去噪的方法，其使用了一种新颖的自注意力模块——自相似性注意力（SS-Attention），可以捕捉非局部自相似性并解决性能上的限制。"
}