{
    "title": "Domain independent post-processing with graph U-nets: Applications to Electrical Impedance Tomographic Imaging. (arXiv:2305.05020v1 [eess.IV])",
    "abstract": "Reconstruction of tomographic images from boundary measurements requires flexibility with respect to target domains. For instance, when the system equations are modeled by partial differential equations the reconstruction is usually done on finite element (FE) meshes, allowing for flexible geometries. Thus, any processing of the obtained reconstructions should be ideally done on the FE mesh as well. For this purpose, we extend the hugely successful U-Net architecture that is limited to rectangular pixel or voxel domains to an equivalent that works flexibly on FE meshes. To achieve this, the FE mesh is converted into a graph and we formulate a graph U-Net with a new cluster pooling and unpooling on the graph that mimics the classic neighborhood based max-pooling. We demonstrate effectiveness and flexibility of the graph U-Net for improving reconstructions from electrical impedance tomographic (EIT) measurements, a nonlinear and highly ill-posed inverse problem. The performance is evalua",
    "link": "http://arxiv.org/abs/2305.05020",
    "context": "Title: Domain independent post-processing with graph U-nets: Applications to Electrical Impedance Tomographic Imaging. (arXiv:2305.05020v1 [eess.IV])\nAbstract: Reconstruction of tomographic images from boundary measurements requires flexibility with respect to target domains. For instance, when the system equations are modeled by partial differential equations the reconstruction is usually done on finite element (FE) meshes, allowing for flexible geometries. Thus, any processing of the obtained reconstructions should be ideally done on the FE mesh as well. For this purpose, we extend the hugely successful U-Net architecture that is limited to rectangular pixel or voxel domains to an equivalent that works flexibly on FE meshes. To achieve this, the FE mesh is converted into a graph and we formulate a graph U-Net with a new cluster pooling and unpooling on the graph that mimics the classic neighborhood based max-pooling. We demonstrate effectiveness and flexibility of the graph U-Net for improving reconstructions from electrical impedance tomographic (EIT) measurements, a nonlinear and highly ill-posed inverse problem. The performance is evalua",
    "path": "papers/23/05/2305.05020.json",
    "total_tokens": 870,
    "translated_title": "基于图形U-Net的领域独立后处理：应用于电阻抗层析成像",
    "translated_abstract": "从边界测量中重建层析图像需要灵活处理目标领域。例如，当系统方程由偏微分方程建模时，重建通常在有限元（FE）网格上完成，从而允许灵活的几何形状。因此，所得重建的任何处理最好也在FE网格上进行。为此，我们将非常成功的U-Net架构扩展到适用于灵活的FE网格。为了实现这一目的，将FE网格转换为图形，并在图形上制定具有新集群池和反池的图形U-Net，模拟基于最大池的经典邻域。我们展示了图形U-Net的有效性和灵活性，以改善从电阻抗层析（EIT）测量中得到的重建，这是一个非线性和高度病态的逆问题。性能进行了评估。",
    "tldr": "本文提出了一种基于图形U-Net的领域独立后处理方法，可应用于电阻抗层析成像（EIT）中来提高重建效果，实现了对灵活几何形状的处理。",
    "en_tdlr": "This paper proposes a domain independent post-processing method based on graph U-Nets, which can be applied to improve the reconstruction effect in electrical impedance tomographic imaging (EIT), and achieve flexible processing of geometrical shapes."
}