{
    "title": "Smooth-Trajectron++: Augmenting the Trajectron++ behaviour prediction model with smooth attention. (arXiv:2305.19678v1 [cs.LG])",
    "abstract": "Understanding traffic participants' behaviour is crucial for predicting their future trajectories, aiding in developing safe and reliable planning systems for autonomous vehicles. Integrating cognitive processes and machine learning models has shown promise in other domains but is lacking in the trajectory forecasting of multiple traffic agents in large-scale autonomous driving datasets. This work investigates the state-of-the-art trajectory forecasting model Trajectron++ which we enhance by incorporating a smoothing term in its attention module. This attention mechanism mimics human attention inspired by cognitive science research indicating limits to attention switching. We evaluate the performance of the resulting Smooth-Trajectron++ model and compare it to the original model on various benchmarks, revealing the potential of incorporating insights from human cognition into trajectory prediction models.",
    "link": "http://arxiv.org/abs/2305.19678",
    "context": "Title: Smooth-Trajectron++: Augmenting the Trajectron++ behaviour prediction model with smooth attention. (arXiv:2305.19678v1 [cs.LG])\nAbstract: Understanding traffic participants' behaviour is crucial for predicting their future trajectories, aiding in developing safe and reliable planning systems for autonomous vehicles. Integrating cognitive processes and machine learning models has shown promise in other domains but is lacking in the trajectory forecasting of multiple traffic agents in large-scale autonomous driving datasets. This work investigates the state-of-the-art trajectory forecasting model Trajectron++ which we enhance by incorporating a smoothing term in its attention module. This attention mechanism mimics human attention inspired by cognitive science research indicating limits to attention switching. We evaluate the performance of the resulting Smooth-Trajectron++ model and compare it to the original model on various benchmarks, revealing the potential of incorporating insights from human cognition into trajectory prediction models.",
    "path": "papers/23/05/2305.19678.json",
    "total_tokens": 799,
    "translated_title": "Smooth-Trajectron++: 将平滑关注机制引入Trajectron++行为预测模型",
    "translated_abstract": "理解交通参与者的行为对于预测其未来轨迹至关重要，为自动驾驶车辆的开发提供安全可靠的规划系统。本文研究了最先进的Trajectron++轨迹预测模型，并通过在其注意力模块中加入平滑项以进一步提高其性能。该关注机制模仿了认知科学研究所启发的人类注意力，表明人的注意力在切换时存在局限性。我们对结果进行了评估，并将其与原始模型在各种基准测试中进行了比较，揭示了将人类认知洞察力纳入轨迹预测模型中的潜力。",
    "tldr": "本文中，研究者将平滑关注机制引入最先进的Trajectron++轨迹预测模型，提高其性能并比较其性能表现。该研究表明将人类的认知因素纳入轨迹预测模型中具有潜在的优势。",
    "en_tdlr": "This study enhances the Trajectron++ trajectory prediction model by incorporating a smoothing term in its attention module inspired by human cognition, leading to better performance compared to the original model and indicating the potential of integrating cognitive factors into trajectory prediction models."
}