{
    "title": "Understanding of Normal and Abnormal Hearts by Phase Space Analysis and Convolutional Neural Networks. (arXiv:2305.10450v1 [eess.IV])",
    "abstract": "Cardiac diseases are one of the leading mortality factors in modern, industrialized societies, which cause high expenses in public health systems. Due to high costs, developing analytical methods to improve cardiac diagnostics is essential. The heart's electric activity was first modeled using a set of nonlinear differential equations. Following this, variations of cardiac spectra originating from deterministic dynamics are investigated. Analyzing a normal human heart's power spectra offers His-Purkinje network, which possesses a fractal-like structure. Phase space trajectories are extracted from the time series electrocardiogram (ECG) graph with third-order derivate Taylor Series. Here in this study, phase space analysis and Convolutional Neural Networks (CNNs) method are applied to 44 records via the MIT-BIH database recorded with MLII. In order to increase accuracy, a straight line is drawn between the highest Q-R distance in the phase space images of the records. Binary CNN classif",
    "link": "http://arxiv.org/abs/2305.10450",
    "context": "Title: Understanding of Normal and Abnormal Hearts by Phase Space Analysis and Convolutional Neural Networks. (arXiv:2305.10450v1 [eess.IV])\nAbstract: Cardiac diseases are one of the leading mortality factors in modern, industrialized societies, which cause high expenses in public health systems. Due to high costs, developing analytical methods to improve cardiac diagnostics is essential. The heart's electric activity was first modeled using a set of nonlinear differential equations. Following this, variations of cardiac spectra originating from deterministic dynamics are investigated. Analyzing a normal human heart's power spectra offers His-Purkinje network, which possesses a fractal-like structure. Phase space trajectories are extracted from the time series electrocardiogram (ECG) graph with third-order derivate Taylor Series. Here in this study, phase space analysis and Convolutional Neural Networks (CNNs) method are applied to 44 records via the MIT-BIH database recorded with MLII. In order to increase accuracy, a straight line is drawn between the highest Q-R distance in the phase space images of the records. Binary CNN classif",
    "path": "papers/23/05/2305.10450.json",
    "total_tokens": 911,
    "translated_title": "通过相空间分析和卷积神经网络理解正常和异常心脏",
    "translated_abstract": "心脏疾病是现代工业化社会中致死因素之一，导致公共卫生系统的高昂开支。因高昂成本，开发分析方法以改善心脏诊断至关重要。本文通过非线性微分方程将心脏电活动建模，并研究起源于确定性动态的心脏频谱的变化。将时间序列心电图(ECG)图像提取相空间轨迹，并基于 MIT-BIH 数据库中记录的 44 个 MLII 图像应用相空间分析和卷积神经网络(CNN)方法进行处理。为了提高准确性，将相空间记录的最高 Q-R 距离之间画一条直线。对相空间图像训练二进制 CNN 分类模型以分类正常和异常心脏，该方法达到平均准确率 93.3%，证明了相空间分析和 CNN 均在心脏疾病诊断中的有效性。",
    "tldr": "通过相空间分析和卷积神经网络结合诊断心脏疾病，在MIT-BIH数据库上取得了93.3%的平均准确率。",
    "en_tdlr": "By combining phase space analysis and convolutional neural networks, this paper achieved an average accuracy of 93.3% in diagnosing cardiac diseases using the MIT-BIH database."
}