{
    "title": "Improving Gradient Computation for Differentiable Physics Simulation with Contacts. (arXiv:2305.00092v1 [cs.LG])",
    "abstract": "Differentiable simulation enables gradients to be back-propagated through physics simulations. In this way, one can learn the dynamics and properties of a physics system by gradient-based optimization or embed the whole differentiable simulation as a layer in a deep learning model for downstream tasks, such as planning and control. However, differentiable simulation at its current stage is not perfect and might provide wrong gradients that deteriorate its performance in learning tasks. In this paper, we study differentiable rigid-body simulation with contacts. We find that existing differentiable simulation methods provide inaccurate gradients when the contact normal direction is not fixed - a general situation when the contacts are between two moving objects. We propose to improve gradient computation by continuous collision detection and leverage the time-of-impact (TOI) to calculate the post-collision velocities. We demonstrate our proposed method, referred to as TOI-Velocity, on tw",
    "link": "http://arxiv.org/abs/2305.00092",
    "context": "Title: Improving Gradient Computation for Differentiable Physics Simulation with Contacts. (arXiv:2305.00092v1 [cs.LG])\nAbstract: Differentiable simulation enables gradients to be back-propagated through physics simulations. In this way, one can learn the dynamics and properties of a physics system by gradient-based optimization or embed the whole differentiable simulation as a layer in a deep learning model for downstream tasks, such as planning and control. However, differentiable simulation at its current stage is not perfect and might provide wrong gradients that deteriorate its performance in learning tasks. In this paper, we study differentiable rigid-body simulation with contacts. We find that existing differentiable simulation methods provide inaccurate gradients when the contact normal direction is not fixed - a general situation when the contacts are between two moving objects. We propose to improve gradient computation by continuous collision detection and leverage the time-of-impact (TOI) to calculate the post-collision velocities. We demonstrate our proposed method, referred to as TOI-Velocity, on tw",
    "path": "papers/23/05/2305.00092.json",
    "total_tokens": 947,
    "translated_title": "通过接触改进可微物理模拟的梯度计算",
    "translated_abstract": "可微分模拟使梯度能够反向传播到物理模拟中。通过基于梯度的优化，可以学习物理系统的动态和属性，或者将整个可微分模拟嵌入到深度学习模型中作为下游任务（如规划和控制）的一层。然而，目前的可微分模拟并不完善，可能会提供错误的梯度，从而在学习任务中降低其性能。在本文中，我们研究接触情况下的可微分刚体模拟。我们发现，当接触法线方向不固定时，现有的可微分模拟方法会提供不准确的梯度——这是当接触是两个移动物体之间发生时的一般情况。我们提出通过连续的碰撞检测和利用碰撞时间（TOI）来计算碰撞后的速度，从而改进梯度计算。我们在两个具有联系的刚体系统上演示了我们提出的方法TOI-Velocity。",
    "tldr": "本文研究了接触情况下的可微分刚体模拟，发现现有的方法在接触法线方向不固定时会提供不准确的梯度，提出了一种通过连续的碰撞检测和利用碰撞时间来计算碰撞后的速度来改进梯度计算的方法TOI-Velocity。",
    "en_tdlr": "This paper studies differentiable rigid-body simulation with contacts and proposes a method called TOI-Velocity to improve gradient computation by continuous collision detection and leveraging the time-of-impact (TOI) to calculate post-collision velocities, which addresses inaccuracies in existing methods when the contact normal direction is not fixed."
}