{
    "title": "Searching Mobile App Screens via Text + Doodle. (arXiv:2305.06165v1 [cs.IR])",
    "abstract": "Locating a specific mobile application screen from existing repositories is restricted to basic keyword searches, such as Google Image Search, or necessitates a complete query screen image, as in the case of Swire. However, interactive partial sketch-based solutions like PSDoodle have limitations, including inaccuracy and an inability to consider text appearing on the screen. A potentially effective solution involves implementing a system that provides interactive partial sketching functionality for efficiently structuring user interface elements. Additionally, the system should incorporate text queries to enhance its capabilities further. Our approach, TpD, represents the pioneering effort to enable an iterative search of screens by combining interactive sketching and keyword search techniques. TpD is built on a combination of the Rico repository of approximately 58k Android app screens and the PSDoodle. Our evaluation with third-party software developers showed that PSDoodle provided",
    "link": "http://arxiv.org/abs/2305.06165",
    "context": "Title: Searching Mobile App Screens via Text + Doodle. (arXiv:2305.06165v1 [cs.IR])\nAbstract: Locating a specific mobile application screen from existing repositories is restricted to basic keyword searches, such as Google Image Search, or necessitates a complete query screen image, as in the case of Swire. However, interactive partial sketch-based solutions like PSDoodle have limitations, including inaccuracy and an inability to consider text appearing on the screen. A potentially effective solution involves implementing a system that provides interactive partial sketching functionality for efficiently structuring user interface elements. Additionally, the system should incorporate text queries to enhance its capabilities further. Our approach, TpD, represents the pioneering effort to enable an iterative search of screens by combining interactive sketching and keyword search techniques. TpD is built on a combination of the Rico repository of approximately 58k Android app screens and the PSDoodle. Our evaluation with third-party software developers showed that PSDoodle provided",
    "path": "papers/23/05/2305.06165.json",
    "total_tokens": 858,
    "translated_title": "通过文本和涂鸦搜索移动应用屏幕",
    "translated_abstract": "现有资源中要找到特定的移动应用程序屏幕局限于基本的关键词搜索，如Google图像搜索，或需要完整的查询屏幕图像，如Swire的情况。然而，类似PSDoodle的交互式部分基于草图的解决方案存在精度不准确和无法考虑屏幕上出现文本等局限性。一种潜在有效的解决方案涉及实施一个系统，为有效构建用户界面元素提供交互式部分草图功能。此外，该系统应结合文本查询以进一步增强其能力。我们的方法TpD代表了通过结合交互式草图和关键字搜索技术进行屏幕迭代搜索的开创性工作。TpD建立在大约58k个Android应用程序屏幕的Rico存储库和PSDoodle的组合基础上。我们与第三方软件开发人员的评估表明，PSDoodle提供了高精度、高召回的结果，并且TpD使用户能够更快地查找所需屏幕。",
    "tldr": "TpD为迭代搜索移动应用屏幕提供了交互式草图和关键字搜索技术的结合方法，使用户能够更快地查找所需屏幕。",
    "en_tdlr": "TpD provides an innovative method for iterative search of mobile app screens by combining interactive sketching and keyword search techniques, allowing users to quickly locate the desired screen."
}