{
    "title": "Investigating the generative dynamics of energy-based neural networks. (arXiv:2305.06745v1 [cs.NE])",
    "abstract": "Generative neural networks can produce data samples according to the statistical properties of their training distribution. This feature can be used to test modern computational neuroscience hypotheses suggesting that spontaneous brain activity is partially supported by top-down generative processing. A widely studied class of generative models is that of Restricted Boltzmann Machines (RBMs), which can be used as building blocks for unsupervised deep learning architectures. In this work, we systematically explore the generative dynamics of RBMs, characterizing the number of states visited during top-down sampling and investigating whether the heterogeneity of visited attractors could be increased by starting the generation process from biased hidden states. By considering an RBM trained on a classic dataset of handwritten digits, we show that the capacity to produce diverse data prototypes can be increased by initiating top-down sampling from chimera states, which encode high-level vis",
    "link": "http://arxiv.org/abs/2305.06745",
    "context": "Title: Investigating the generative dynamics of energy-based neural networks. (arXiv:2305.06745v1 [cs.NE])\nAbstract: Generative neural networks can produce data samples according to the statistical properties of their training distribution. This feature can be used to test modern computational neuroscience hypotheses suggesting that spontaneous brain activity is partially supported by top-down generative processing. A widely studied class of generative models is that of Restricted Boltzmann Machines (RBMs), which can be used as building blocks for unsupervised deep learning architectures. In this work, we systematically explore the generative dynamics of RBMs, characterizing the number of states visited during top-down sampling and investigating whether the heterogeneity of visited attractors could be increased by starting the generation process from biased hidden states. By considering an RBM trained on a classic dataset of handwritten digits, we show that the capacity to produce diverse data prototypes can be increased by initiating top-down sampling from chimera states, which encode high-level vis",
    "path": "papers/23/05/2305.06745.json",
    "total_tokens": 792,
    "translated_title": "研究基于能量的神经网络的生成动力学",
    "translated_abstract": "生成神经网络可以根据其所训练的分布的统计属性生成数据样本。这个特性可以用来测试现代计算神经科学假说，即自发的脑活动在一定程度上得到了自上而下的生成处理的支持。对于一类广泛研究的生成模型——受限玻尔兹曼机(RBMs)，我们系统地探索了它的生成动力学，表征了自上而下的抽样过程中访问的状态数量，并探究了从有偏向隐层状态开始产生生成过程是否能增加访问吸引子的异质性。通过考虑在经典手写数字数据集上训练的RBMs，我们展示了通过从嵌合态开始自上而下采样可以增加生成多样的数据原型的能力。",
    "tldr": "本文系统地研究了受限玻尔兹曼机(RBM)的生成动力学，发现从嵌合态开始自上而下采样可以增加生成多样的数据原型的能力。",
    "en_tdlr": "This paper systematically explores the generative dynamics of Restricted Boltzmann Machines (RBMs) and finds that initiating top-down sampling from chimera states can increase the capacity to produce diverse data prototypes."
}