{
    "title": "Nonparanormal Graph Quilting with Applications to Calcium Imaging. (arXiv:2305.13491v1 [stat.ME])",
    "abstract": "Probabilistic graphical models have become an important unsupervised learning tool for detecting network structures for a variety of problems, including the estimation of functional neuronal connectivity from two-photon calcium imaging data. However, in the context of calcium imaging, technological limitations only allow for partially overlapping layers of neurons in a brain region of interest to be jointly recorded. In this case, graph estimation for the full data requires inference for edge selection when many pairs of neurons have no simultaneous observations. This leads to the Graph Quilting problem, which seeks to estimate a graph in the presence of block-missingness in the empirical covariance matrix. Solutions for the Graph Quilting problem have previously been studied for Gaussian graphical models; however, neural activity data from calcium imaging are often non-Gaussian, thereby requiring a more flexible modeling approach. Thus, in our work, we study two approaches for nonpara",
    "link": "http://arxiv.org/abs/2305.13491",
    "context": "Title: Nonparanormal Graph Quilting with Applications to Calcium Imaging. (arXiv:2305.13491v1 [stat.ME])\nAbstract: Probabilistic graphical models have become an important unsupervised learning tool for detecting network structures for a variety of problems, including the estimation of functional neuronal connectivity from two-photon calcium imaging data. However, in the context of calcium imaging, technological limitations only allow for partially overlapping layers of neurons in a brain region of interest to be jointly recorded. In this case, graph estimation for the full data requires inference for edge selection when many pairs of neurons have no simultaneous observations. This leads to the Graph Quilting problem, which seeks to estimate a graph in the presence of block-missingness in the empirical covariance matrix. Solutions for the Graph Quilting problem have previously been studied for Gaussian graphical models; however, neural activity data from calcium imaging are often non-Gaussian, thereby requiring a more flexible modeling approach. Thus, in our work, we study two approaches for nonpara",
    "path": "papers/23/05/2305.13491.json",
    "total_tokens": 980,
    "translated_title": "非参数高斯图拼接及其在钙成像中的应用",
    "translated_abstract": "概率图模型已成为一种重要的无监督学习工具，用于检测各种问题的网络结构，包括从双光子钙成像数据中估计功能神经元连接性。然而，在钙成像的情况下，技术限制只允许记录感兴趣区域中部分重叠的神经元层共同记录。在这种情况下，对于完整数据的图形估计需要针对边缘选择进行推断，当许多神经元对没有同时观察到时，这就导致了图拼接问题，在经验协方差矩阵存在块状缺失的情况下估计图形。以前已经研究了高斯图形模型的图拼接问题的解决方案；然而，来自钙成像的神经活动数据通常是非高斯的，因此需要一种更灵活的建模方法。因此，在我们的工作中，我们研究了两种非参数非高斯图钉合方法，允许在缺少块的情况下估计底层的图形结构。我们展示了我们的方法在模拟和真实的钙成像数据上的功效。",
    "tldr": "本文研究了钙成像中的图拼接问题，提出了两种非高斯图形模型的解决方案，并在模拟和真实数据上验证了其有效性。",
    "en_tdlr": "This paper proposes two solutions for the Graph Quilting problem in the context of calcium imaging, using nonparametric Gaussian graphical models to estimate the underlying graph structure in the presence of block-missingness for non-Gaussian data, and demonstrating their efficacy on simulated and real data."
}