{
    "title": "ChatCoT: Tool-Augmented Chain-of-Thought Reasoning on Chat-based Large Language Models. (arXiv:2305.14323v2 [cs.CL] UPDATED)",
    "abstract": "Although large language models (LLMs) have achieved excellent performance in a variety of evaluation benchmarks, they still struggle in complex reasoning tasks which require specific knowledge and multi-hop reasoning. To improve the reasoning abilities, we propose \\textbf{ChatCoT}, a tool-augmented chain-of-thought reasoning framework for chat-based LLMs. In ChatCoT, we model the chain-of-thought~(CoT) reasoning as multi-turn conversations, to utilize tools in a more natural way through chatting. At each turn, LLMs can either interact with tools or perform the reasoning. Our approach can effectively leverage the multi-turn conversation ability of chat-based LLMs, and integrate the thought chain following and tools manipulation in a unified way. Specially, we initialize the early turns of the conversation by the tools, tasks and reasoning format, and propose an iterative \\emph{tool-augmented reasoning} step to perform step-by-step tool-augmented reasoning. The experiment results on two ",
    "link": "http://arxiv.org/abs/2305.14323",
    "context": "Title: ChatCoT: Tool-Augmented Chain-of-Thought Reasoning on Chat-based Large Language Models. (arXiv:2305.14323v2 [cs.CL] UPDATED)\nAbstract: Although large language models (LLMs) have achieved excellent performance in a variety of evaluation benchmarks, they still struggle in complex reasoning tasks which require specific knowledge and multi-hop reasoning. To improve the reasoning abilities, we propose \\textbf{ChatCoT}, a tool-augmented chain-of-thought reasoning framework for chat-based LLMs. In ChatCoT, we model the chain-of-thought~(CoT) reasoning as multi-turn conversations, to utilize tools in a more natural way through chatting. At each turn, LLMs can either interact with tools or perform the reasoning. Our approach can effectively leverage the multi-turn conversation ability of chat-based LLMs, and integrate the thought chain following and tools manipulation in a unified way. Specially, we initialize the early turns of the conversation by the tools, tasks and reasoning format, and propose an iterative \\emph{tool-augmented reasoning} step to perform step-by-step tool-augmented reasoning. The experiment results on two ",
    "path": "papers/23/05/2305.14323.json",
    "total_tokens": 965,
    "translated_title": "ChatCoT: 基于工具增强的链式思维推理在基于聊天大语言模型上的应用",
    "translated_abstract": "虽然大型语言模型在各种评估基准中取得了出色的表现，但它们在需要特定知识和多次推理的复杂推理任务中仍然存在困难。为了提高推理能力，我们提出了一种基于工具增强的链式思维推理框架 ChatCoT，用于基于聊天的大型语言模型。在 ChatCoT 中，我们将链式思维推理建模为多轮对话，通过聊天的方式更自然地利用工具。在每个轮次中，LLM 能够交互工具或进行推理。我们的方法可以有效利用基于聊天的 LLM 的多轮对话能力，并以统一的方式集成思维链跟踪和工具操作。特别地，我们通过工具、任务和推理格式初始化对话的早期轮次，并提出了一个迭代的工具增强推理步骤来逐步进行工具增强推理。实验结果在两个任务上展示了 ChatCoT 的有效性。",
    "tldr": "这项研究提出了一个基于工具增强的链式思维推理框架 ChatCoT，用于基于聊天的大型语言模型，通过聊天的方式实现多轮推理，巧妙地结合了思维链跟踪和工具操作的方法，提高了大型语言模型的推理能力。"
}