{
    "title": "Prediction with Incomplete Data under Agnostic Mask Distribution Shift. (arXiv:2305.11197v1 [cs.LG])",
    "abstract": "Data with missing values is ubiquitous in many applications. Recent years have witnessed increasing attention on prediction with only incomplete data consisting of observed features and a mask that indicates the missing pattern. Existing methods assume that the training and testing distributions are the same, which may be violated in real-world scenarios. In this paper, we consider prediction with incomplete data in the presence of distribution shift. We focus on the case where the underlying joint distribution of complete features and label is invariant, but the missing pattern, i.e., mask distribution may shift agnostically between training and testing. To achieve generalization, we leverage the observation that for each mask, there is an invariant optimal predictor. To avoid the exponential explosion when learning them separately, we approximate the optimal predictors jointly using a double parameterization technique. This has the undesirable side effect of allowing the learned pred",
    "link": "http://arxiv.org/abs/2305.11197",
    "context": "Title: Prediction with Incomplete Data under Agnostic Mask Distribution Shift. (arXiv:2305.11197v1 [cs.LG])\nAbstract: Data with missing values is ubiquitous in many applications. Recent years have witnessed increasing attention on prediction with only incomplete data consisting of observed features and a mask that indicates the missing pattern. Existing methods assume that the training and testing distributions are the same, which may be violated in real-world scenarios. In this paper, we consider prediction with incomplete data in the presence of distribution shift. We focus on the case where the underlying joint distribution of complete features and label is invariant, but the missing pattern, i.e., mask distribution may shift agnostically between training and testing. To achieve generalization, we leverage the observation that for each mask, there is an invariant optimal predictor. To avoid the exponential explosion when learning them separately, we approximate the optimal predictors jointly using a double parameterization technique. This has the undesirable side effect of allowing the learned pred",
    "path": "papers/23/05/2305.11197.json",
    "total_tokens": 1088,
    "translated_title": "在不知道遮盖分布移位的情况下预测不完整数据",
    "translated_abstract": "在许多应用程序中，存在缺失值的数据是普遍存在的。最近几年，人们对仅使用观察到的特征和指示缺失模式的掩码的不完整数据进行预测的关注不断增加。现有方法假设训练和测试分布相同，在实际环境中可能会被违反。本文考虑在存在分布偏移的情况下预测不完整数据。我们专注于基础完整特征和标签的联合分布不变，但缺失模式即掩码分布可能会在训练和测试之间不知道地发生变化。为了实现泛化，我们利用这个观察结果，即对于每个掩码，都有一个不变的最优预测器。为了避免在单独学习它们时出现指数爆炸，在使用双参数化技术联合近似最优预测器。这具有不良的副作用，即允许学习到的预测器对参数化的选择敏感。为了解决这个问题，我们引入了一个正则化项，促进对参数化的选择具有鲁棒性的预测器。对合成和真实数据集的实验表明了我们提出的方法的有效性。",
    "tldr": "本研究考虑预测不完整数据的情况，在缺失模式分布可能发生偏移的情况下，我们利用掩码的不变最优预测器实现泛化，通过双参数化技术联合近似最优预测器避免指数爆炸，同时引入正则化项保证预测器具有鲁棒性。",
    "en_tdlr": "This paper proposes a method for prediction with incomplete data in the presence of distribution shift, where the missing pattern distribution may shift agnostically between training and testing. The method leverages the invariant optimal predictor for each mask and approximates them jointly using a double parameterization technique to avoid exponential explosion. A regularization term is introduced to encourage robustness to the choice of parametrization. Experiment results on both synthetic and real-world datasets demonstrate the effectiveness of the proposed approach."
}