{
    "title": "Parallel Coordinates for Discovery of Interpretable Machine Learning Models. (arXiv:2305.18434v1 [cs.LG])",
    "abstract": "This work uses visual knowledge discovery in parallel coordinates to advance methods of interpretable machine learning. The graphic data representation in parallel coordinates made the concepts of hypercubes and hyperblocks (HBs) simple to understand for end users. It is suggested to use mixed and pure hyperblocks in the proposed data classifier algorithm Hyper. It is shown that Hyper models generalize decision trees. The algorithm is presented in several settings and options to discover interactively or automatically overlapping or non-overlapping hyperblocks. Additionally, the use of hyperblocks in conjunction with language descriptions of visual patterns is demonstrated. The benchmark data from the UCI ML repository were used to evaluate the Hyper algorithm. It enabled the discovery of mixed and pure HBs evaluated using 10-fold cross validation. Connections among hyperblocks, dimension reduction and visualization have been established. The capability of end users to find and observe",
    "link": "http://arxiv.org/abs/2305.18434",
    "context": "Title: Parallel Coordinates for Discovery of Interpretable Machine Learning Models. (arXiv:2305.18434v1 [cs.LG])\nAbstract: This work uses visual knowledge discovery in parallel coordinates to advance methods of interpretable machine learning. The graphic data representation in parallel coordinates made the concepts of hypercubes and hyperblocks (HBs) simple to understand for end users. It is suggested to use mixed and pure hyperblocks in the proposed data classifier algorithm Hyper. It is shown that Hyper models generalize decision trees. The algorithm is presented in several settings and options to discover interactively or automatically overlapping or non-overlapping hyperblocks. Additionally, the use of hyperblocks in conjunction with language descriptions of visual patterns is demonstrated. The benchmark data from the UCI ML repository were used to evaluate the Hyper algorithm. It enabled the discovery of mixed and pure HBs evaluated using 10-fold cross validation. Connections among hyperblocks, dimension reduction and visualization have been established. The capability of end users to find and observe",
    "path": "papers/23/05/2305.18434.json",
    "total_tokens": 865,
    "translated_title": "基于平行坐标的解释性机器学习模型发现",
    "translated_abstract": "本文使用平行坐标进行可视化知识发现，提升了可解释性机器学习方法。平行坐标中的图形数据表示使得终端用户能够轻松理解超立方体和超块的概念。文章建议在所提出的数据分类器算法Hyper中同时使用混合和纯粹的超块。实验证明，Hyper模型具有决策树的泛化能力。算法被用在了多种设置和选项中，以交互方式或自动方式发现重叠或非重叠的超块。此外，文章还演示了使用超块和视觉模式的语言描述相结合的方法。UCI ML数据集被用于评估Hyper算法。通过10折交叉验证，Hyper算法能够发现混合和纯粹的超块。超块、降维和可视化之间的联系已经建立起来。最终用户能够找到和观察这些超块的能力也得到了提升。",
    "tldr": "本研究使用平行坐标进行可视化知识发现，提出了一种新的数据分类器算法Hyper，并能够发现终端用户易于理解的、用于提高可解释性的混合和纯粹的超块。"
}