{
    "title": "Gloss-Free End-to-End Sign Language Translation. (arXiv:2305.12876v2 [cs.CV] UPDATED)",
    "abstract": "In this paper, we tackle the problem of sign language translation (SLT) without gloss annotations. Although intermediate representation like gloss has been proven effective, gloss annotations are hard to acquire, especially in large quantities. This limits the domain coverage of translation datasets, thus handicapping real-world applications. To mitigate this problem, we design the Gloss-Free End-to-end sign language translation framework (GloFE). Our method improves the performance of SLT in the gloss-free setting by exploiting the shared underlying semantics of signs and the corresponding spoken translation. Common concepts are extracted from the text and used as a weak form of intermediate representation. The global embedding of these concepts is used as a query for cross-attention to find the corresponding information within the learned visual features. In a contrastive manner, we encourage the similarity of query results between samples containing such concepts and decrease those ",
    "link": "http://arxiv.org/abs/2305.12876",
    "context": "Title: Gloss-Free End-to-End Sign Language Translation. (arXiv:2305.12876v2 [cs.CV] UPDATED)\nAbstract: In this paper, we tackle the problem of sign language translation (SLT) without gloss annotations. Although intermediate representation like gloss has been proven effective, gloss annotations are hard to acquire, especially in large quantities. This limits the domain coverage of translation datasets, thus handicapping real-world applications. To mitigate this problem, we design the Gloss-Free End-to-end sign language translation framework (GloFE). Our method improves the performance of SLT in the gloss-free setting by exploiting the shared underlying semantics of signs and the corresponding spoken translation. Common concepts are extracted from the text and used as a weak form of intermediate representation. The global embedding of these concepts is used as a query for cross-attention to find the corresponding information within the learned visual features. In a contrastive manner, we encourage the similarity of query results between samples containing such concepts and decrease those ",
    "path": "papers/23/05/2305.12876.json",
    "total_tokens": 1014,
    "translated_title": "无须手语标注的全端到端手语翻译",
    "translated_abstract": "本论文解决了无需手语标注的手语翻译问题。尽管像手语标语这样的中间表示法已被证明是有效的，但手语标注很难获取，特别是在大量获取时。这限制了翻译数据集的领域覆盖范围，从而影响了实际应用的效果。为了解决这个问题，我们设计了无需手语标注的全端到端手语翻译框架 (GloFE)。我们的方法通过利用手语和相应口语翻译的共同基础语义来提高无需手语标注设置下手语翻译的性能。通用概念从文本中提取出来并用作一种弱形式的中间表示。这些概念的全局嵌入用作跨注意力的查询，以查找学习到的视觉特征内的相应信息。我们以对比的方式鼓励包含这些概念的样本之间查询结果的相似性，并减少没有这些概念的样本之间的查询结果相似性。我们在一个大规模无需手语标注的手语翻译数据集上进行了实验，结果显示，GloFE相比于之前仅依靠手语标注信息的方法实现了最先进的性能。",
    "tldr": "本论文介绍了一种无需手语标注的全端到端手语翻译框架(GloFE)，它通过利用手语和相应口语翻译的共同基础语义来提高手语翻译的性能，可以应用于实际场景中。"
}