{
    "title": "Functional Equivalence and Path Connectivity of Reducible Hyperbolic Tangent Networks. (arXiv:2305.05089v1 [cs.NE])",
    "abstract": "Understanding the learning process of artificial neural networks requires clarifying the structure of the parameter space within which learning takes place. A neural network parameter's functional equivalence class is the set of parameters implementing the same input--output function. For many architectures, almost all parameters have a simple and well-documented functional equivalence class. However, there is also a vanishing minority of reducible parameters, with richer functional equivalence classes caused by redundancies among the network's units.  In this paper, we give an algorithmic characterisation of unit redundancies and reducible functional equivalence classes for a single-hidden-layer hyperbolic tangent architecture. We show that such functional equivalence classes are piecewise-linear path-connected sets, and that for parameters with a majority of redundant units, the sets have a diameter of at most 7 linear segments.",
    "link": "http://arxiv.org/abs/2305.05089",
    "context": "Title: Functional Equivalence and Path Connectivity of Reducible Hyperbolic Tangent Networks. (arXiv:2305.05089v1 [cs.NE])\nAbstract: Understanding the learning process of artificial neural networks requires clarifying the structure of the parameter space within which learning takes place. A neural network parameter's functional equivalence class is the set of parameters implementing the same input--output function. For many architectures, almost all parameters have a simple and well-documented functional equivalence class. However, there is also a vanishing minority of reducible parameters, with richer functional equivalence classes caused by redundancies among the network's units.  In this paper, we give an algorithmic characterisation of unit redundancies and reducible functional equivalence classes for a single-hidden-layer hyperbolic tangent architecture. We show that such functional equivalence classes are piecewise-linear path-connected sets, and that for parameters with a majority of redundant units, the sets have a diameter of at most 7 linear segments.",
    "path": "papers/23/05/2305.05089.json",
    "total_tokens": 755,
    "translated_title": "可约的双曲正切网络的功能等价和路径连通性",
    "translated_abstract": "理解人工神经网络的学习过程需要澄清学习发生的参数空间的结构。神经网络参数的功能等价类是实现相同输入输出函数的参数集合。然而，存在一小部分可约参数，其功能等价类由网络单元之间的冗余造成，因而具有更丰富的功能等价类。本文对于单隐藏层双曲正切结构给出了单元冗余和可约的功能等价类的算法刻画。我们证明了这样的功能等价类是分段线性路径连通的集合，并且对于具有多数冗余单元的参数，这些集合的直径最多为7线段。",
    "tldr": "本文对于单隐藏层双曲正切结构给出了单元冗余和可约的功能等价类的算法刻画，并证明了这样的功能等价类是分段线性路径连通的集合。",
    "en_tdlr": "This paper gives an algorithmic characterization of unit redundancies and reducible functional equivalence classes for a single-hidden-layer hyperbolic tangent architecture and proves that such functional equivalence classes are piecewise-linear path-connected sets."
}