{
    "title": "Calibration Assessment and Boldness-Recalibration for Binary Events. (arXiv:2305.03780v1 [stat.ME])",
    "abstract": "Probability predictions are essential to inform decision making in medicine, economics, image classification, sports analytics, entertainment, and many other fields. Ideally, probability predictions are (i) well calibrated, (ii) accurate, and (iii) bold, i.e., far from the base rate of the event. Predictions that satisfy these three criteria are informative for decision making. However, there is a fundamental tension between calibration and boldness, since calibration metrics can be high when predictions are overly cautious, i.e., non-bold. The purpose of this work is to develop a hypothesis test and Bayesian model selection approach to assess calibration, and a strategy for boldness-recalibration that enables practitioners to responsibly embolden predictions subject to their required level of calibration. Specifically, we allow the user to pre-specify their desired posterior probability of calibration, then maximally embolden predictions subject to this constraint. We verify the perfo",
    "link": "http://arxiv.org/abs/2305.03780",
    "context": "Title: Calibration Assessment and Boldness-Recalibration for Binary Events. (arXiv:2305.03780v1 [stat.ME])\nAbstract: Probability predictions are essential to inform decision making in medicine, economics, image classification, sports analytics, entertainment, and many other fields. Ideally, probability predictions are (i) well calibrated, (ii) accurate, and (iii) bold, i.e., far from the base rate of the event. Predictions that satisfy these three criteria are informative for decision making. However, there is a fundamental tension between calibration and boldness, since calibration metrics can be high when predictions are overly cautious, i.e., non-bold. The purpose of this work is to develop a hypothesis test and Bayesian model selection approach to assess calibration, and a strategy for boldness-recalibration that enables practitioners to responsibly embolden predictions subject to their required level of calibration. Specifically, we allow the user to pre-specify their desired posterior probability of calibration, then maximally embolden predictions subject to this constraint. We verify the perfo",
    "path": "papers/23/05/2305.03780.json",
    "total_tokens": 961,
    "translated_title": "二元事件的校准评估和大胆再校准",
    "translated_abstract": "概率预测对于医学、经济、图像分类、体育分析、娱乐等许多领域中的决策制定至关重要。理想情况下，概率预测应该 (i) 校准良好 (ii) 准确 (iii) 大胆，即远离事件的基础频率。满足这三个条件的预测对于决策制定是有信息量的。然而，校准和大胆之间存在基本的紧张关系，因为当预测过于谨慎时(即非大胆)校准度量可以很高。本文的目的是开发一种假设检验和贝叶斯模型选择方法来评估校准，并提供一种大胆再校准策略，使实践者能够在满足所需的校准水平的情况下负责任地增强预测。具体而言，我们允许用户预先指定他们所需的后验校准概率，然后在此约束下最大化增强预测。我们通过模拟研究和实际数据应用验证了我们方法的性能。",
    "tldr": "本研究提出了一种假设检验和贝叶斯模型选择方法来评估校准，并提供一种大胆再校准策略，使实践者能够在满足所需的校准水平的情况下负责任地增强预测。",
    "en_tdlr": "This study proposes a hypothesis test and Bayesian model selection approach for assessing calibration and a boldness-recalibration strategy to responsibly embolden predictions subject to the required level of calibration."
}