{
    "title": "Statistical post-processing of visibility ensemble forecasts. (arXiv:2305.15325v1 [stat.AP])",
    "abstract": "To be able to produce accurate and reliable predictions of visibility has crucial importance in aviation meteorology, as well as in water- and road transportation. Nowadays, several meteorological services provide ensemble forecasts of visibility; however, the skill, and reliability of visibility predictions are far reduced compared to other variables, such as temperature or wind speed. Hence, some form of calibration is strongly advised, which usually means estimation of the predictive distribution of the weather quantity at hand either by parametric or non-parametric approaches, including also machine learning-based techniques. As visibility observations - according to the suggestion of the World Meteorological Organization - are usually reported in discrete values, the predictive distribution for this particular variable is a discrete probability law, hence calibration can be reduced to a classification problem. Based on visibility ensemble forecasts of the European Centre for Mediu",
    "link": "http://arxiv.org/abs/2305.15325",
    "context": "Title: Statistical post-processing of visibility ensemble forecasts. (arXiv:2305.15325v1 [stat.AP])\nAbstract: To be able to produce accurate and reliable predictions of visibility has crucial importance in aviation meteorology, as well as in water- and road transportation. Nowadays, several meteorological services provide ensemble forecasts of visibility; however, the skill, and reliability of visibility predictions are far reduced compared to other variables, such as temperature or wind speed. Hence, some form of calibration is strongly advised, which usually means estimation of the predictive distribution of the weather quantity at hand either by parametric or non-parametric approaches, including also machine learning-based techniques. As visibility observations - according to the suggestion of the World Meteorological Organization - are usually reported in discrete values, the predictive distribution for this particular variable is a discrete probability law, hence calibration can be reduced to a classification problem. Based on visibility ensemble forecasts of the European Centre for Mediu",
    "path": "papers/23/05/2305.15325.json",
    "total_tokens": 960,
    "translated_title": "能见度集合预测的统计后处理",
    "translated_abstract": "能够准确可靠地预测能见度对于飞行气象，水路和道路运输具有至关重要的意义。现今，一些气象服务提供能见度的集合预测; 然而，相比于其他变量（如温度或风速），能见度预测的技能和可靠性降低很多。因此，强烈建议采用某种形式的校准，通常意味着通过参数或非参数方法（包括基于机器学习的技术）估计所涉及的天气数量的预测分布。由于根据世界气象组织的建议，通常以离散值报告能见度观测值，因此该特定变量的预测分布是离散概率分布，因此校准可以简化为分类问题。基于欧洲中期天气预报中心的能见度集合预测（ECMWF），我们研究了不同的方法用于后处理能见度概率预测。我们的发现表明，非参数密度估计和高斯混合模型方法表现良好，并且可以显着提高集合预测的技能和可靠性。",
    "tldr": "本论文研究了后处理能见度集合预测的不同方法，发现非参数密度估计和高斯混合模型方法表现良好，并且可以显着提高集合预测的技能和可靠性。",
    "en_tdlr": "This paper investigates different methods for post-processing visibility probability forecasts, and finds that non-parametric density estimation and Gaussian mixture model approaches perform well and can significantly improve the skill and reliability of the ensemble forecasts."
}