{
    "title": "PaCE: Unified Multi-modal Dialogue Pre-training with Progressive and Compositional Experts. (arXiv:2305.14839v2 [cs.CL] UPDATED)",
    "abstract": "Perceiving multi-modal information and fulfilling dialogues with humans is a long-term goal of artificial intelligence. Pre-training is commonly regarded as an effective approach for multi-modal dialogue. However, due to the limited availability of multi-modal dialogue data, there is still scarce research on multi-modal dialogue pre-training. Yet another intriguing challenge emerges from the encompassing nature of multi-modal dialogue, which involves various modalities and tasks. Moreover, new forms of tasks may arise at unpredictable points in the future. Hence, it is essential for designed multi-modal dialogue models to possess sufficient flexibility to adapt to such scenarios. This paper proposes \\textbf{PaCE}, a unified, structured, compositional multi-modal dialogue pre-training framework. It utilizes a combination of several fundamental experts to accommodate multiple dialogue-related tasks and can be pre-trained using limited dialogue and extensive non-dialogue multi-modal data.",
    "link": "http://arxiv.org/abs/2305.14839",
    "context": "Title: PaCE: Unified Multi-modal Dialogue Pre-training with Progressive and Compositional Experts. (arXiv:2305.14839v2 [cs.CL] UPDATED)\nAbstract: Perceiving multi-modal information and fulfilling dialogues with humans is a long-term goal of artificial intelligence. Pre-training is commonly regarded as an effective approach for multi-modal dialogue. However, due to the limited availability of multi-modal dialogue data, there is still scarce research on multi-modal dialogue pre-training. Yet another intriguing challenge emerges from the encompassing nature of multi-modal dialogue, which involves various modalities and tasks. Moreover, new forms of tasks may arise at unpredictable points in the future. Hence, it is essential for designed multi-modal dialogue models to possess sufficient flexibility to adapt to such scenarios. This paper proposes \\textbf{PaCE}, a unified, structured, compositional multi-modal dialogue pre-training framework. It utilizes a combination of several fundamental experts to accommodate multiple dialogue-related tasks and can be pre-trained using limited dialogue and extensive non-dialogue multi-modal data.",
    "path": "papers/23/05/2305.14839.json",
    "total_tokens": 795,
    "translated_title": "PaCE：渐进式和组合式专家统一多模态对话预训练",
    "translated_abstract": "感知多模态信息并与人类进行对话是人工智能的长期目标。预训练被普遍认为是多模态对话的一种有效方法。然而，由于多模态对话数据的有限可用性，目前关于多模态对话预训练的研究仍相对稀缺。本文提出了一种名为PaCE的统一、结构化、组合式的多模态对话预训练框架，它利用了几个基本专家的组合，以适应多个与对话相关的任务，并可以使用有限的对话和广泛的非对话多模态数据进行预训练。",
    "tldr": "本文提出的PaCE是一个统一、结构化、组合式的多模态对话预训练框架，它利用了几个基本专家的组合，可以适应多个与对话相关的任务，并可以使用有限的对话和广泛的非对话多模态数据进行预训练。",
    "en_tdlr": "PaCE is a unified, structured, and compositional multi-modal dialogue pre-training framework that combines several fundamental experts to accommodate multiple dialogue-related tasks and can be pre-trained using limited dialogue and extensive non-dialogue multi-modal data."
}