{
    "title": "DMF-TONN: Direct Mesh-free Topology Optimization using Neural Networks. (arXiv:2305.04107v1 [cs.CE])",
    "abstract": "We propose a direct mesh-free method for performing topology optimization by integrating a density field approximation neural network with a displacement field approximation neural network. We show that this direct integration approach can give comparable results to conventional topology optimization techniques, with an added advantage of enabling seamless integration with post-processing software, and a potential of topology optimization with objectives where meshing and Finite Element Analysis (FEA) may be expensive or not suitable. Our approach (DMF-TONN) takes in as inputs the boundary conditions and domain coordinates and finds the optimum density field for minimizing the loss function of compliance and volume fraction constraint violation. The mesh-free nature is enabled by a physics-informed displacement field approximation neural network to solve the linear elasticity partial differential equation and replace the FEA conventionally used for calculating the compliance. We show t",
    "link": "http://arxiv.org/abs/2305.04107",
    "context": "Title: DMF-TONN: Direct Mesh-free Topology Optimization using Neural Networks. (arXiv:2305.04107v1 [cs.CE])\nAbstract: We propose a direct mesh-free method for performing topology optimization by integrating a density field approximation neural network with a displacement field approximation neural network. We show that this direct integration approach can give comparable results to conventional topology optimization techniques, with an added advantage of enabling seamless integration with post-processing software, and a potential of topology optimization with objectives where meshing and Finite Element Analysis (FEA) may be expensive or not suitable. Our approach (DMF-TONN) takes in as inputs the boundary conditions and domain coordinates and finds the optimum density field for minimizing the loss function of compliance and volume fraction constraint violation. The mesh-free nature is enabled by a physics-informed displacement field approximation neural network to solve the linear elasticity partial differential equation and replace the FEA conventionally used for calculating the compliance. We show t",
    "path": "papers/23/05/2305.04107.json",
    "total_tokens": 857,
    "translated_title": "DMF-TONN: 使用神经网络进行直接无网格拓扑优化",
    "translated_abstract": "我们提出了一种直接无网格法进行拓扑优化的方法，该方法将密度场逼近神经网络与位移场逼近神经网络相结合。我们展示了这种直接集成方法可以给出与传统拓扑优化技术可比拟的结果，并且具有与后处理软件无缝集成的优点，还有可能用于网格和有限元分析成本高昂或不合适的拓扑优化目标。DMF-TONN接收边界条件和域坐标作为输入，找到最优密度场以最小化遵从度和体积分数约束违规的损失函数。无网格的性质是由一个物理学启发的位移场逼近神经网络实现的，用于解决线性弹性偏微分方程并替代传统用于计算遵从度的有限元分析（FEA）。我们展示了该方法的有效性并与传统方法进行了比较。",
    "tldr": "本文提出了一种直接无网格法进行拓扑优化，集成了神经网络并用于求解遵从度和体积分数约束违规的优化问题，无需传统的有限元分析和网格化，能够无缝地集成到后处理软件中。",
    "en_tdlr": "This paper proposes a direct mesh-free method for performing topology optimization, integrating neural networks to solve compliance and volume fraction constraint violation without requiring traditional meshing and Finite Element Analysis, offering seamless integration with post-processing software."
}