{
    "title": "DreamWaltz: Make a Scene with Complex 3D Animatable Avatars. (arXiv:2305.12529v2 [cs.CV] UPDATED)",
    "abstract": "We present DreamWaltz, a novel framework for generating and animating complex 3D avatars given text guidance and parametric human body prior. While recent methods have shown encouraging results for text-to-3D generation of common objects, creating high-quality and animatable 3D avatars remains challenging. To create high-quality 3D avatars, DreamWaltz proposes 3D-consistent occlusion-aware Score Distillation Sampling (SDS) to optimize implicit neural representations with canonical poses. It provides view-aligned supervision via 3D-aware skeleton conditioning which enables complex avatar generation without artifacts and multiple faces. For animation, our method learns an animatable and generalizable avatar representation which could map arbitrary poses to the canonical pose representation. Extensive evaluations demonstrate that DreamWaltz is an effective and robust approach for creating 3D avatars that can take on complex shapes and appearances as well as novel poses for animation. The ",
    "link": "http://arxiv.org/abs/2305.12529",
    "context": "Title: DreamWaltz: Make a Scene with Complex 3D Animatable Avatars. (arXiv:2305.12529v2 [cs.CV] UPDATED)\nAbstract: We present DreamWaltz, a novel framework for generating and animating complex 3D avatars given text guidance and parametric human body prior. While recent methods have shown encouraging results for text-to-3D generation of common objects, creating high-quality and animatable 3D avatars remains challenging. To create high-quality 3D avatars, DreamWaltz proposes 3D-consistent occlusion-aware Score Distillation Sampling (SDS) to optimize implicit neural representations with canonical poses. It provides view-aligned supervision via 3D-aware skeleton conditioning which enables complex avatar generation without artifacts and multiple faces. For animation, our method learns an animatable and generalizable avatar representation which could map arbitrary poses to the canonical pose representation. Extensive evaluations demonstrate that DreamWaltz is an effective and robust approach for creating 3D avatars that can take on complex shapes and appearances as well as novel poses for animation. The ",
    "path": "papers/23/05/2305.12529.json",
    "total_tokens": 1043,
    "translated_title": "DreamWaltz：使用复杂3D动画角色制作场景",
    "translated_abstract": "我们提出了DreamWaltz，这是一个新颖的框架，可以根据文本指导和参数化的人体先验生成和动画化复杂的3D角色。尽管最近的方法在将文本转化为普通物体的3D生成方面取得了令人鼓舞的结果，但创建高质量且可动画的3D角色仍然具有挑战性。为了创建高质量的3D角色，DreamWaltz提出了三维一致的遮挡感知得分蒸馏采样（SDS）来优化隐式神经表示和规范姿势。它通过三维感知的骨架调节提供视角对齐的监督，使得复杂的角色生成不会产生伪影和多个面。对于动画，我们的方法学习了一种可动画且具有泛化能力的角色表示，可以将任意姿势映射到规范姿势表示中。广泛的评估表明，DreamWaltz是一种有效且稳健的方法，可以创建具有复杂形状和外观以及动画的3D角色。",
    "tldr": "DreamWaltz是一个新颖的框架，可以根据文本指导和参数化的人体先验生成和动画化复杂的3D角色。它提出了三维一致的遮挡感知得分蒸馏采样（SDS）来优化隐式神经表示和规范姿势，并学习了一种可动画且具有泛化能力的角色表示。这种方法在创建3D角色方面表现出了高效性和稳健性。",
    "en_tdlr": "DreamWaltz is a novel framework for generating and animating complex 3D avatars given text guidance and parametric human body prior. It proposes 3D-consistent occlusion-aware Score Distillation Sampling (SDS) to optimize implicit neural representations with canonical poses and learns an animatable and generalizable avatar representation. This method demonstrates efficiency and robustness in creating 3D avatars."
}