{
    "title": "Deep Pipeline Embeddings for AutoML. (arXiv:2305.14009v2 [cs.LG] UPDATED)",
    "abstract": "Automated Machine Learning (AutoML) is a promising direction for democratizing AI by automatically deploying Machine Learning systems with minimal human expertise. The core technical challenge behind AutoML is optimizing the pipelines of Machine Learning systems (e.g. the choice of preprocessing, augmentations, models, optimizers, etc.). Existing Pipeline Optimization techniques fail to explore deep interactions between pipeline stages/components. As a remedy, this paper proposes a novel neural architecture that captures the deep interaction between the components of a Machine Learning pipeline. We propose embedding pipelines into a latent representation through a novel per-component encoder mechanism. To search for optimal pipelines, such pipeline embeddings are used within deep-kernel Gaussian Process surrogates inside a Bayesian Optimization setup. Furthermore, we meta-learn the parameters of the pipeline embedding network using existing evaluations of pipelines on diverse collectio",
    "link": "http://arxiv.org/abs/2305.14009",
    "context": "Title: Deep Pipeline Embeddings for AutoML. (arXiv:2305.14009v2 [cs.LG] UPDATED)\nAbstract: Automated Machine Learning (AutoML) is a promising direction for democratizing AI by automatically deploying Machine Learning systems with minimal human expertise. The core technical challenge behind AutoML is optimizing the pipelines of Machine Learning systems (e.g. the choice of preprocessing, augmentations, models, optimizers, etc.). Existing Pipeline Optimization techniques fail to explore deep interactions between pipeline stages/components. As a remedy, this paper proposes a novel neural architecture that captures the deep interaction between the components of a Machine Learning pipeline. We propose embedding pipelines into a latent representation through a novel per-component encoder mechanism. To search for optimal pipelines, such pipeline embeddings are used within deep-kernel Gaussian Process surrogates inside a Bayesian Optimization setup. Furthermore, we meta-learn the parameters of the pipeline embedding network using existing evaluations of pipelines on diverse collectio",
    "path": "papers/23/05/2305.14009.json",
    "total_tokens": 884,
    "translated_title": "自动机器学习的深层次流水线嵌入",
    "translated_abstract": "自动化机器学习（AutoML）是通过自动化部署需要极少人类专业知识的机器学习系统来推进人工智能的有希望的方向。AutoML背后的核心技术挑战是优化机器学习系统的流水线（例如，预处理、增强、模型、优化器等的选择）。现有的流水线优化技术未能探索流水线阶段/组件之间的深层互动。因此，本文提出了一种新颖的神经架构，捕捉了机器学习流水线组件之间的深度交互。我们将流水线嵌入到一个潜在表示中，通过新的组件编码器机制进行。为了搜索最佳流水线，我们在贝叶斯优化设置内使用这些流水线嵌入于深层核高斯过程代理之内。此外，我们使用对多样化收集数据中的管道的现有评估进行元学习流水线嵌入网络的参数。",
    "tldr": "该论文提出了一种用于自动机器学习的深层次流水线嵌入方法，该方法通过神经架构捕获不同流水线组件之间的深度交互，并在贝叶斯优化设置中使用这些嵌入用于搜索最佳流水线。",
    "en_tdlr": "This paper proposes a novel method for automated machine learning, called deep pipeline embeddings, which captures deep interactions between the components of a machine learning pipeline through a neural architecture and utilizes them within a Bayesian optimization setup to search for the best pipeline."
}