{
    "title": "Privacy Protectability: An Information-theoretical Approach. (arXiv:2305.15697v1 [cs.CR])",
    "abstract": "Recently, inference privacy has attracted increasing attention. The inference privacy concern arises most notably in the widely deployed edge-cloud video analytics systems, where the cloud needs the videos captured from the edge. The video data can contain sensitive information and subject to attack when they are transmitted to the cloud for inference. Many privacy protection schemes have been proposed. Yet, the performance of a scheme needs to be determined by experiments or inferred by analyzing the specific case. In this paper, we propose a new metric, \\textit{privacy protectability}, to characterize to what degree a video stream can be protected given a certain video analytics task. Such a metric has strong operational meaning. For example, low protectability means that it may be necessary to set up an overall secure environment. We can also evaluate a privacy protection scheme, e.g., assume it obfuscates the video data, what level of protection this scheme has achieved after obfus",
    "link": "http://arxiv.org/abs/2305.15697",
    "context": "Title: Privacy Protectability: An Information-theoretical Approach. (arXiv:2305.15697v1 [cs.CR])\nAbstract: Recently, inference privacy has attracted increasing attention. The inference privacy concern arises most notably in the widely deployed edge-cloud video analytics systems, where the cloud needs the videos captured from the edge. The video data can contain sensitive information and subject to attack when they are transmitted to the cloud for inference. Many privacy protection schemes have been proposed. Yet, the performance of a scheme needs to be determined by experiments or inferred by analyzing the specific case. In this paper, we propose a new metric, \\textit{privacy protectability}, to characterize to what degree a video stream can be protected given a certain video analytics task. Such a metric has strong operational meaning. For example, low protectability means that it may be necessary to set up an overall secure environment. We can also evaluate a privacy protection scheme, e.g., assume it obfuscates the video data, what level of protection this scheme has achieved after obfus",
    "path": "papers/23/05/2305.15697.json",
    "total_tokens": 972,
    "translated_title": "隐私保护：一种信息理论方法",
    "translated_abstract": "最近，推理隐私引起越来越多的关注。推理隐私问题最明显地出现在广泛部署的边缘-云视频分析系统中，其中云需要从边缘捕获视频。视频数据可能包含敏感信息，并且在传输到云进行推理时会遭受攻击。已经提出了许多隐私保护方案。然而，方案的性能需要通过实验确定或通过分析特定案例进行推断。在本文中，我们提出了一种新的度量标准，称为“隐私可保护度”，用于表征在给定某种视频分析任务的情况下，视频流可以得到多大程度的保护。这种度量标准具有强的操作意义。例如，低可保护性意味着可能需要建立一个整体安全的环境。我们还可以评估隐私保护方案，例如，假设它混淆了视频数据，则在混淆数据后该方案实现了多大程度的保护。我们使用信息理论工具引入了定义并量化了隐私保护性。我们通过检查一些典型的视频分析任务来说明所提出的度量标准的实际效用。",
    "tldr": "本文提出了一种新的度量标准——隐私可保护度，用于衡量在给定某种视频分析任务的情况下，视频流可以得到多大程度的保护，并使用信息理论工具对其进行量化。",
    "en_tdlr": "This paper proposes a new metric, privacy protectability, to quantify the extent to which a video stream can be protected given a certain video analytics task, introducing the definition and using information-theoretical tools to quantify it."
}