{
    "title": "A Nested Matrix-Tensor Model for Noisy Multi-view Clustering. (arXiv:2305.19992v1 [stat.ML])",
    "abstract": "In this paper, we propose a nested matrix-tensor model which extends the spiked rank-one tensor model of order three. This model is particularly motivated by a multi-view clustering problem in which multiple noisy observations of each data point are acquired, with potentially non-uniform variances along the views. In this case, data can be naturally represented by an order-three tensor where the views are stacked. Given such a tensor, we consider the estimation of the hidden clusters via performing a best rank-one tensor approximation. In order to study the theoretical performance of this approach, we characterize the behavior of this best rank-one approximation in terms of the alignments of the obtained component vectors with the hidden model parameter vectors, in the large-dimensional regime. In particular, we show that our theoretical results allow us to anticipate the exact accuracy of the proposed clustering approach. Furthermore, numerical experiments indicate that leveraging our",
    "link": "http://arxiv.org/abs/2305.19992",
    "context": "Title: A Nested Matrix-Tensor Model for Noisy Multi-view Clustering. (arXiv:2305.19992v1 [stat.ML])\nAbstract: In this paper, we propose a nested matrix-tensor model which extends the spiked rank-one tensor model of order three. This model is particularly motivated by a multi-view clustering problem in which multiple noisy observations of each data point are acquired, with potentially non-uniform variances along the views. In this case, data can be naturally represented by an order-three tensor where the views are stacked. Given such a tensor, we consider the estimation of the hidden clusters via performing a best rank-one tensor approximation. In order to study the theoretical performance of this approach, we characterize the behavior of this best rank-one approximation in terms of the alignments of the obtained component vectors with the hidden model parameter vectors, in the large-dimensional regime. In particular, we show that our theoretical results allow us to anticipate the exact accuracy of the proposed clustering approach. Furthermore, numerical experiments indicate that leveraging our",
    "path": "papers/23/05/2305.19992.json",
    "total_tokens": 873,
    "translated_title": "噪声多视角聚类的嵌套矩阵-张量模型",
    "translated_abstract": "本文提出了一种扩展了三阶钉子秩一张量模型的嵌套矩阵-张量模型。该模型特别针对多视角聚类问题，其中获得了每个数据点的多个嘈杂观察值，并且可能存在非均匀的视角方差。在这种情况下，数据可以通过将视角堆叠来自然表示为三阶张量。给定这样一个张量，我们通过执行最佳秩一张量逼近来考虑估计隐藏的聚类。为了研究该方法的理论性能，我们以大维度情况下获得的分量向量与隐藏模型参数向量的对齐作为评估标准来表征最佳秩一逼近的行为。特别地，我们展示了理论结果允许我们预期所提出的聚类方法的精确准确度。此外，数值实验表明，利用我们所提出的模型可以更好地解决多视角聚类问题。",
    "tldr": "本文提出了一种嵌套矩阵-张量模型，用于解决多视角聚类问题，通过执行最佳秩一张量逼近来估计隐藏的聚类，理论结果可以预期精确准确度。",
    "en_tdlr": "This paper proposes a nested matrix-tensor model for solving multi-view clustering problems, estimating hidden clusters through best rank-one tensor approximation, and theoretical results allow anticipating precise accuracy."
}