{
    "title": "Block the Label and Noise: An N-Gram Masked Speller for Chinese Spell Checking. (arXiv:2305.03314v1 [cs.CL])",
    "abstract": "Recently, Chinese Spell Checking(CSC), a task to detect erroneous characters in a sentence and correct them, has attracted extensive interest because of its wide applications in various NLP tasks. Most of the existing methods have utilized BERT to extract semantic information for CSC task. However, these methods directly take sentences with only a few errors as inputs, where the correct characters may leak answers to the model and dampen its ability to capture distant context; while the erroneous characters may disturb the semantic encoding process and result in poor representations. Based on such observations, this paper proposes an n-gram masking layer that masks current and/or surrounding tokens to avoid label leakage and error disturbance. Moreover, considering that the mask strategy may ignore multi-modal information indicated by errors, a novel dot-product gating mechanism is proposed to integrate the phonological and morphological information with semantic representation. Extens",
    "link": "http://arxiv.org/abs/2305.03314",
    "context": "Title: Block the Label and Noise: An N-Gram Masked Speller for Chinese Spell Checking. (arXiv:2305.03314v1 [cs.CL])\nAbstract: Recently, Chinese Spell Checking(CSC), a task to detect erroneous characters in a sentence and correct them, has attracted extensive interest because of its wide applications in various NLP tasks. Most of the existing methods have utilized BERT to extract semantic information for CSC task. However, these methods directly take sentences with only a few errors as inputs, where the correct characters may leak answers to the model and dampen its ability to capture distant context; while the erroneous characters may disturb the semantic encoding process and result in poor representations. Based on such observations, this paper proposes an n-gram masking layer that masks current and/or surrounding tokens to avoid label leakage and error disturbance. Moreover, considering that the mask strategy may ignore multi-modal information indicated by errors, a novel dot-product gating mechanism is proposed to integrate the phonological and morphological information with semantic representation. Extens",
    "path": "papers/23/05/2305.03314.json",
    "total_tokens": 856,
    "translated_abstract": "最近，中文拼写检查（CSC）已经吸引了广泛关注，因为它在各种自然语言处理任务中具有广泛的应用。大多数现有的方法利用BERT提取CSC任务的语义信息。然而，这些方法直接将只有少量错误的句子作为输入，其中正确的字符可能泄漏给模型并抑制其捕捉远距离上下文的能力；而错误的字符可能会干扰语义编码过程并导致表示不佳。基于这些观察，本文提出了一个n-gram掩蔽层，用于掩蔽当前和/或周围的标记，以避免标签泄漏和误差干扰。此外，考虑到掩蔽策略可能忽略由错误指示的多模态信息，提出了一种新的点积门机制，以将音韵和形态信息与语义表示集成。",
    "tldr": "本文提出了一种n-gram掩蔽层和点积门机制的中文拼写检查器，以避免标签泄漏和误差干扰，并集成多模态信息，提高准确性。"
}