{
    "title": "CodeCompose: A Large-Scale Industrial Deployment of AI-assisted Code Authoring. (arXiv:2305.12050v1 [cs.SE])",
    "abstract": "The rise of large language models (LLMs) has unlocked various applications of this technology in software development. In particular, generative LLMs have been shown to effectively power AI-based code authoring tools that can suggest entire statements or blocks of code during code authoring. In this paper we present CodeCompose, an AI-assisted code authoring tool developed and deployed at Meta internally. CodeCompose is based on the InCoder LLM that merges generative capabilities with bi-directionality. We have scaled up CodeCompose to serve tens of thousands of developers at Meta, across 10+ programming languages and several coding surfaces.  We discuss unique challenges in terms of user experience and metrics that arise when deploying such tools in large-scale industrial settings. We present our experience in making design decisions about the model and system architecture for CodeCompose that addresses these challenges. Finally, we present metrics from our large-scale deployment of C",
    "link": "http://arxiv.org/abs/2305.12050",
    "context": "Title: CodeCompose: A Large-Scale Industrial Deployment of AI-assisted Code Authoring. (arXiv:2305.12050v1 [cs.SE])\nAbstract: The rise of large language models (LLMs) has unlocked various applications of this technology in software development. In particular, generative LLMs have been shown to effectively power AI-based code authoring tools that can suggest entire statements or blocks of code during code authoring. In this paper we present CodeCompose, an AI-assisted code authoring tool developed and deployed at Meta internally. CodeCompose is based on the InCoder LLM that merges generative capabilities with bi-directionality. We have scaled up CodeCompose to serve tens of thousands of developers at Meta, across 10+ programming languages and several coding surfaces.  We discuss unique challenges in terms of user experience and metrics that arise when deploying such tools in large-scale industrial settings. We present our experience in making design decisions about the model and system architecture for CodeCompose that addresses these challenges. Finally, we present metrics from our large-scale deployment of C",
    "path": "papers/23/05/2305.12050.json",
    "total_tokens": 919,
    "translated_title": "CodeCompose：基于AI辅助的代码编写工具的大规模工业部署",
    "translated_abstract": "大型语言模型（LLMs）的崛起解锁了该技术在软件开发中的各种应用。特别是，已经证明生成式LLMs可以有效地驱动AI基础的代码编写工具，在编写代码期间可以建议整个语句或代码块。在本文中，我们介绍了基于InCoder LLM的CodeCompose，这是一个Meta内部开发和部署的AI辅助代码编写工具。CodeCompose基于合并生成能力和双向性的LLM。我们已经将CodeCompose扩展到Meta的数以万计的开发人员，在10多种编程语言和几个编码表面上使用。我们讨论了在大规模工业环境中部署此类工具时出现的用户体验和指标方面的独特挑战。我们介绍了CodeCompose的模型和系统架构的设计决策，以解决这些挑战。最后，我们提供了我们对CodeCompose的大规模部署的指标，并展示它如何帮助提高Meta的开发人员生产力。",
    "tldr": "CodeCompose是一个基于InCoder LLM的AI辅助的代码编写工具，已经在Meta内部部署，可在10多种编程语言和几个编码表面上使用。 CodeCompose已成功帮助提高Meta的开发人员生产力。",
    "en_tdlr": "CodeCompose is an AI-assisted code authoring tool based on InCoder LLM that has been deployed internally at Meta and can be used across 10+ programming languages and several coding surfaces. CodeCompose has successfully helped increase developer productivity at Meta."
}