{
    "title": "The Ways of Words: The Impact of Word Choice on Information Engagement and Decision Making. (arXiv:2305.09798v1 [cs.CL])",
    "abstract": "Little research has explored how information engagement (IE), the degree to which individuals interact with and use information in a manner that manifests cognitively, behaviorally, and affectively. This study explored the impact of phrasing, specifically word choice, on IE and decision making. Synthesizing two theoretical models, User Engagement Theory UET and Information Behavior Theory IBT, a theoretical framework illustrating the impact of and relationships among the three IE dimensions of perception, participation, and perseverance was developed and hypotheses generated. The framework was empirically validated in a large-scale user study measuring how word choice impacts the dimensions of IE. The findings provide evidence that IE differs from other forms of engagement in that it is driven and fostered by the expression of the information itself, regardless of the information system used to view, interact with, and use the information. The findings suggest that phrasing can have a ",
    "link": "http://arxiv.org/abs/2305.09798",
    "context": "Title: The Ways of Words: The Impact of Word Choice on Information Engagement and Decision Making. (arXiv:2305.09798v1 [cs.CL])\nAbstract: Little research has explored how information engagement (IE), the degree to which individuals interact with and use information in a manner that manifests cognitively, behaviorally, and affectively. This study explored the impact of phrasing, specifically word choice, on IE and decision making. Synthesizing two theoretical models, User Engagement Theory UET and Information Behavior Theory IBT, a theoretical framework illustrating the impact of and relationships among the three IE dimensions of perception, participation, and perseverance was developed and hypotheses generated. The framework was empirically validated in a large-scale user study measuring how word choice impacts the dimensions of IE. The findings provide evidence that IE differs from other forms of engagement in that it is driven and fostered by the expression of the information itself, regardless of the information system used to view, interact with, and use the information. The findings suggest that phrasing can have a ",
    "path": "papers/23/05/2305.09798.json",
    "total_tokens": 786,
    "translated_title": "词语的方式：词语选择对信息参与和决策制定的影响",
    "translated_abstract": "本研究探讨了措辞，特别是词语选择，对信息参与和决策制定的影响。综合了用户参与理论和信息行为理论两个理论模型，制定了一个理论框架，并生成了假设。该框架在一个大规模的用户研究中得到了实证验证，在衡量词语选择如何影响信息参与的感知、参与度和坚持度等三个方面提供了证据。结果表明，信息参与不同于其他形式的参与，它是由信息本身的表达所驱动和培育的，无论使用何种信息系统来查看、交互和使用信息。这些研究结果表明，措辞可以对信息参与和决策制定产生重要影响。",
    "tldr": "措辞对信息参与和决策制定有重要影响，信息参与是由信息本身的表达所驱动和培育的。",
    "en_tdlr": "Word choice has a significant impact on information engagement and decision making. Information engagement is driven and fostered by the expression of the information itself."
}