{
    "title": "Semi-Supervised Causal Inference: Generalizable and Double Robust Inference for Average Treatment Effects under Selection Bias with Decaying Overlap. (arXiv:2305.12789v1 [stat.ME])",
    "abstract": "Average treatment effect (ATE) estimation is an essential problem in the causal inference literature, which has received significant recent attention, especially with the presence of high-dimensional confounders. We consider the ATE estimation problem in high dimensions when the observed outcome (or label) itself is possibly missing. The labeling indicator's conditional propensity score is allowed to depend on the covariates, and also decay uniformly with sample size - thus allowing for the unlabeled data size to grow faster than the labeled data size. Such a setting fills in an important gap in both the semi-supervised (SS) and missing data literatures. We consider a missing at random (MAR) mechanism that allows selection bias - this is typically forbidden in the standard SS literature, and without a positivity condition - this is typically required in the missing data literature. We first propose a general doubly robust 'decaying' MAR (DR-DMAR) SS estimator for the ATE, which is cons",
    "link": "http://arxiv.org/abs/2305.12789",
    "context": "Title: Semi-Supervised Causal Inference: Generalizable and Double Robust Inference for Average Treatment Effects under Selection Bias with Decaying Overlap. (arXiv:2305.12789v1 [stat.ME])\nAbstract: Average treatment effect (ATE) estimation is an essential problem in the causal inference literature, which has received significant recent attention, especially with the presence of high-dimensional confounders. We consider the ATE estimation problem in high dimensions when the observed outcome (or label) itself is possibly missing. The labeling indicator's conditional propensity score is allowed to depend on the covariates, and also decay uniformly with sample size - thus allowing for the unlabeled data size to grow faster than the labeled data size. Such a setting fills in an important gap in both the semi-supervised (SS) and missing data literatures. We consider a missing at random (MAR) mechanism that allows selection bias - this is typically forbidden in the standard SS literature, and without a positivity condition - this is typically required in the missing data literature. We first propose a general doubly robust 'decaying' MAR (DR-DMAR) SS estimator for the ATE, which is cons",
    "path": "papers/23/05/2305.12789.json",
    "total_tokens": 965,
    "translated_title": "半监督因果推断：面向衰减重叠的选择偏差下可泛化的双稳估计平均处理效应",
    "translated_abstract": "平均处理效应（ATE）估计是因果推断文献中的一个重要问题，尤其是在高维混淆变量的情况下受到了极大的关注。本文中，我们考虑了在高维情况下存在可能缺失的标签情况下的ATE估计问题。标记指示符的条件倾向得分允许依赖于协变量，并且随着样本大小的衰减而衰减——从而允许未标记数据大小比标记数据大小增长得更快。这种情况填补了半监督（SS）和缺失数据文献中的重要空白。我们考虑了允许选择偏差的随机缺失（MAR）机制——这通常在标准的SS文献中是禁止的，并且在缺失数据文献中通常需要一个正性条件。我们首先提出了一种针对ATE的一般双稳DR-DMAR（decaying）SS估计器，这种估计器具有良好的一致性和渐近正态性。",
    "tldr": "本论文提出了一种新的针对高维情况下缺失标签且存在选择偏差的平均处理效应估计方法，它具有良好的一致性和渐近正态性。",
    "en_tdlr": "This paper proposed a new method for estimating the average treatment effect (ATE) in high dimensions with missing labels and selection bias, filling a gap in both semi-supervised and missing data literature. The proposed DR-DMAR (decaying) SS estimator showed good consistency and asymptotic normality."
}