{
    "title": "Deep Ensembles to Improve Uncertainty Quantification of Statistical Downscaling Models under Climate Change Conditions. (arXiv:2305.00975v1 [cs.LG])",
    "abstract": "Recently, deep learning has emerged as a promising tool for statistical downscaling, the set of methods for generating high-resolution climate fields from coarse low-resolution variables. Nevertheless, their ability to generalize to climate change conditions remains questionable, mainly due to the stationarity assumption. We propose deep ensembles as a simple method to improve the uncertainty quantification of statistical downscaling models. By better capturing uncertainty, statistical downscaling models allow for superior planning against extreme weather events, a source of various negative social and economic impacts. Since no observational future data exists, we rely on a pseudo reality experiment to assess the suitability of deep ensembles for quantifying the uncertainty of climate change projections. Deep ensembles allow for a better risk assessment, highly demanded by sectoral applications to tackle climate change.",
    "link": "http://arxiv.org/abs/2305.00975",
    "context": "Title: Deep Ensembles to Improve Uncertainty Quantification of Statistical Downscaling Models under Climate Change Conditions. (arXiv:2305.00975v1 [cs.LG])\nAbstract: Recently, deep learning has emerged as a promising tool for statistical downscaling, the set of methods for generating high-resolution climate fields from coarse low-resolution variables. Nevertheless, their ability to generalize to climate change conditions remains questionable, mainly due to the stationarity assumption. We propose deep ensembles as a simple method to improve the uncertainty quantification of statistical downscaling models. By better capturing uncertainty, statistical downscaling models allow for superior planning against extreme weather events, a source of various negative social and economic impacts. Since no observational future data exists, we rely on a pseudo reality experiment to assess the suitability of deep ensembles for quantifying the uncertainty of climate change projections. Deep ensembles allow for a better risk assessment, highly demanded by sectoral applications to tackle climate change.",
    "path": "papers/23/05/2305.00975.json",
    "total_tokens": 914,
    "translated_title": "深度集成用于改进气候变化条件下统计降尺度模型的不确定性量化",
    "translated_abstract": "最近，深度学习已成为一种有望解决统计降尺度问题的工具，统计降尺度指的是从粗糙的低分辨率变量生成高分辨率气候场的方法集。然而，由于其基于稳定性假设，其在气候变化条件下推广的能力仍然存在疑问。我们提出使用深度集成作为一种简单的方法来改善统计降尺度模型的不确定性量化。通过更好地捕捉不确定性，统计降尺度模型可以提供更优越的极端天气事件规划，这是各种负面社会和经济影响的来源。由于不存在观测到的未来数据，我们依靠伪实验来评估深度集成对气候变化预测的不确定性量化是否适用。深度集成可提供更好的风险评估，这是应对气候变化的部门应用所迫切需要的。",
    "tldr": "本文提出了使用深度集成作为一种简单的方法来改善统计降尺度模型的不确定性量化，以提供更优越的极端天气事件规划。深度集成可提供更好的风险评估，是应对气候变化的部门应用所迫切需要的。",
    "en_tdlr": "This paper proposes using deep ensembles as a simple method to improve the uncertainty quantification of statistical downscaling models, providing better planning for extreme weather events. Deep ensembles allow for a better risk assessment, which is urgently needed for sectoral applications to tackle climate change."
}