{
    "title": "Benchmarks and leaderboards for sound demixing tasks. (arXiv:2305.07489v1 [cs.SD])",
    "abstract": "Music demixing is the task of separating different tracks from the given single audio signal into components, such as drums, bass, and vocals from the rest of the accompaniment. Separation of sources is useful for a range of areas, including entertainment and hearing aids. In this paper, we introduce two new benchmarks for the sound source separation tasks and compare popular models for sound demixing, as well as their ensembles, on these benchmarks. For the models' assessments, we provide the leaderboard at https://mvsep.com/quality_checker/, giving a comparison for a range of models. The new benchmark datasets are available for download. We also develop a novel approach for audio separation, based on the ensembling of different models that are suited best for the particular stem. The proposed solution was evaluated in the context of the Music Demixing Challenge 2023 and achieved top results in different tracks of the challenge. The code and the approach are open-sourced on GitHub.",
    "link": "http://arxiv.org/abs/2305.07489",
    "context": "Title: Benchmarks and leaderboards for sound demixing tasks. (arXiv:2305.07489v1 [cs.SD])\nAbstract: Music demixing is the task of separating different tracks from the given single audio signal into components, such as drums, bass, and vocals from the rest of the accompaniment. Separation of sources is useful for a range of areas, including entertainment and hearing aids. In this paper, we introduce two new benchmarks for the sound source separation tasks and compare popular models for sound demixing, as well as their ensembles, on these benchmarks. For the models' assessments, we provide the leaderboard at https://mvsep.com/quality_checker/, giving a comparison for a range of models. The new benchmark datasets are available for download. We also develop a novel approach for audio separation, based on the ensembling of different models that are suited best for the particular stem. The proposed solution was evaluated in the context of the Music Demixing Challenge 2023 and achieved top results in different tracks of the challenge. The code and the approach are open-sourced on GitHub.",
    "path": "papers/23/05/2305.07489.json",
    "total_tokens": 933,
    "translated_title": "声音拆分任务的基准和排行榜",
    "translated_abstract": "音乐拆分是将给定的单音频信号分离成组成部分（例如鼓、低音和人声等）与其他伴奏音乐分离的任务。源分离在许多领域中都十分有用，包括娱乐和助听器。本文提出了两个新的声源分离任务基准，并比较了流行的声音拆分模型及其集成在这些基准上的表现。我们提供了模型排行榜 https://mvsep.com/quality_checker/，以对各种模型进行比较。新的基准数据集可供下载。我们还开发了一种新的音频分离方法，基于适合特定音轨的不同模型的集成。所提出的解决方案在2023音乐分离挑战赛中取得了高水平成绩。我们的代码和方法在GitHub上公开发布。",
    "tldr": "本文介绍了两个新的声源分离任务基准，并将流行的模型及其集成在这些基准上的表现进行了比较。他们还开发了一种新的音频分离方法，基于适合特定音轨的不同模型的集成，该方法在2023年音乐分离挑战赛中取得了高水平成绩，并开源了代码和方法。",
    "en_tdlr": "This paper introduces two new benchmarks for sound source separation tasks and compares popular models and their ensembles on these benchmarks. They also develop a novel approach for audio separation, based on the ensembling of different models that are suited best for the particular stem, achieving top results in the Music Demixing Challenge 2023, and open-sourcing their code and approach on GitHub."
}