{
    "title": "Cloud-RAIN: Point Cloud Analysis with Reflectional Invariance. (arXiv:2305.07814v1 [cs.CV])",
    "abstract": "The networks for point cloud tasks are expected to be invariant when the point clouds are affinely transformed such as rotation and reflection. So far, relative to the rotational invariance that has been attracting major research attention in the past years, the reflection invariance is little addressed. Notwithstanding, reflection symmetry can find itself in very common and important scenarios, e.g., static reflection symmetry of structured streets, dynamic reflection symmetry from bidirectional motion of moving objects (such as pedestrians), and left- and right-hand traffic practices in different countries. To the best of our knowledge, unfortunately, no reflection-invariant network has been reported in point cloud analysis till now. To fill this gap, we propose a framework by using quadratic neurons and PCA canonical representation, referred to as Cloud-RAIN, to endow point \\underline{Cloud} models with \\underline{R}eflection\\underline{A}l \\underline{IN}variance. We prove a theorem ",
    "link": "http://arxiv.org/abs/2305.07814",
    "context": "Title: Cloud-RAIN: Point Cloud Analysis with Reflectional Invariance. (arXiv:2305.07814v1 [cs.CV])\nAbstract: The networks for point cloud tasks are expected to be invariant when the point clouds are affinely transformed such as rotation and reflection. So far, relative to the rotational invariance that has been attracting major research attention in the past years, the reflection invariance is little addressed. Notwithstanding, reflection symmetry can find itself in very common and important scenarios, e.g., static reflection symmetry of structured streets, dynamic reflection symmetry from bidirectional motion of moving objects (such as pedestrians), and left- and right-hand traffic practices in different countries. To the best of our knowledge, unfortunately, no reflection-invariant network has been reported in point cloud analysis till now. To fill this gap, we propose a framework by using quadratic neurons and PCA canonical representation, referred to as Cloud-RAIN, to endow point \\underline{Cloud} models with \\underline{R}eflection\\underline{A}l \\underline{IN}variance. We prove a theorem ",
    "path": "papers/23/05/2305.07814.json",
    "total_tokens": 834,
    "translated_title": "Cloud-RAIN: 具有反射不变性的点云分析",
    "translated_abstract": "点云任务的网络被期望在点云被仿射变换（如旋转和反射）时保持不变。迄今为止，与过去几年中受到主要研究关注的旋转不变性相比，反射不变性很少被讨论。然而，反射对称性可以出现在非常常见和重要的情况下，例如：结构化街道的静态反射对称性，来自移动物体（如行人）的双向运动的动态反射对称性，以及不同国家的左右交通惯例。可以惜的是，到目前为止，没有关于点云分析中具有反射不变性的网络的报道。为了填补这个空白，我们提出了一种使用二次神经元和PCA规范表示的框架，称为Cloud-RAIN，来赋予点云模型反射不变性。我们证明了一个定理。",
    "tldr": "论文提出了一种具有反射不变性的点云分析框架Cloud-RAIN，使用二次神经元和PCA规范表示实现。",
    "en_tdlr": "The paper proposes a point cloud analysis framework called Cloud-RAIN, which has reflectional invariance and uses quadratic neurons and PCA canonical representation to achieve it."
}