{
    "title": "Speech Intelligibility Assessment of Dysarthric Speech by using Goodness of Pronunciation with Uncertainty Quantification. (arXiv:2305.18392v1 [cs.SD])",
    "abstract": "This paper proposes an improved Goodness of Pronunciation (GoP) that utilizes Uncertainty Quantification (UQ) for automatic speech intelligibility assessment for dysarthric speech. Current GoP methods rely heavily on neural network-driven overconfident predictions, which is unsuitable for assessing dysarthric speech due to its significant acoustic differences from healthy speech. To alleviate the problem, UQ techniques were used on GoP by 1) normalizing the phoneme prediction (entropy, margin, maxlogit, logit-margin) and 2) modifying the scoring function (scaling, prior normalization). As a result, prior-normalized maxlogit GoP achieves the best performance, with a relative increase of 5.66%, 3.91%, and 23.65% compared to the baseline GoP for English, Korean, and Tamil, respectively. Furthermore, phoneme analysis is conducted to identify which phoneme scores significantly correlate with intelligibility scores in each language.",
    "link": "http://arxiv.org/abs/2305.18392",
    "context": "Title: Speech Intelligibility Assessment of Dysarthric Speech by using Goodness of Pronunciation with Uncertainty Quantification. (arXiv:2305.18392v1 [cs.SD])\nAbstract: This paper proposes an improved Goodness of Pronunciation (GoP) that utilizes Uncertainty Quantification (UQ) for automatic speech intelligibility assessment for dysarthric speech. Current GoP methods rely heavily on neural network-driven overconfident predictions, which is unsuitable for assessing dysarthric speech due to its significant acoustic differences from healthy speech. To alleviate the problem, UQ techniques were used on GoP by 1) normalizing the phoneme prediction (entropy, margin, maxlogit, logit-margin) and 2) modifying the scoring function (scaling, prior normalization). As a result, prior-normalized maxlogit GoP achieves the best performance, with a relative increase of 5.66%, 3.91%, and 23.65% compared to the baseline GoP for English, Korean, and Tamil, respectively. Furthermore, phoneme analysis is conducted to identify which phoneme scores significantly correlate with intelligibility scores in each language.",
    "path": "papers/23/05/2305.18392.json",
    "total_tokens": 810,
    "translated_title": "利用不确定性量化的发音准确度评估方法对运动障碍患者的语音清晰度进行评估",
    "translated_abstract": "本文提出了一种改进的发音准确度评估方法——利用不确定性量化（UQ）来自动评估运动障碍患者的语音清晰度。当前的发音准确度评估方法依赖于神经网络驱动的自负预测，这对于评估运动障碍患者的语音来说不太适用，因为其与健康人的语音存在显著的声学差异。",
    "tldr": "本文提出了一种利用不确定性量化的发音准确度评估方法，能够有效评估运动障碍患者的语音清晰度，其中，利用先验规范化的最大对数几率发音准确度（maxlogit GoP）取得了最佳表现。",
    "en_tdlr": "This paper proposes an improved Goodness of Pronunciation (GoP) using Uncertainty Quantification (UQ) for automatic speech intelligibility assessment of dysarthric speech, achieving better performance with prior-normalized maxlogit GoP, and identifying phonemes that significantly correlate with intelligibility scores in different languages."
}