{
    "title": "Towards Explainable In-the-Wild Video Quality Assessment: A Database and a Language-Prompted Approach. (arXiv:2305.12726v2 [cs.CV] UPDATED)",
    "abstract": "The proliferation of in-the-wild videos has greatly expanded the Video Quality Assessment (VQA) problem. Unlike early definitions that usually focus on limited distortion types, VQA on in-the-wild videos is especially challenging as it could be affected by complicated factors, including various distortions and diverse contents. Though subjective studies have collected overall quality scores for these videos, how the abstract quality scores relate with specific factors is still obscure, hindering VQA methods from more concrete quality evaluations (e.g. sharpness of a video). To solve this problem, we collect over two million opinions on 4,543 in-the-wild videos on 13 dimensions of quality-related factors, including in-capture authentic distortions (e.g. motion blur, noise, flicker), errors introduced by compression and transmission, and higher-level experiences on semantic contents and aesthetic issues (e.g. composition, camera trajectory), to establish the multi-dimensional Maxwell dat",
    "link": "http://arxiv.org/abs/2305.12726",
    "context": "Title: Towards Explainable In-the-Wild Video Quality Assessment: A Database and a Language-Prompted Approach. (arXiv:2305.12726v2 [cs.CV] UPDATED)\nAbstract: The proliferation of in-the-wild videos has greatly expanded the Video Quality Assessment (VQA) problem. Unlike early definitions that usually focus on limited distortion types, VQA on in-the-wild videos is especially challenging as it could be affected by complicated factors, including various distortions and diverse contents. Though subjective studies have collected overall quality scores for these videos, how the abstract quality scores relate with specific factors is still obscure, hindering VQA methods from more concrete quality evaluations (e.g. sharpness of a video). To solve this problem, we collect over two million opinions on 4,543 in-the-wild videos on 13 dimensions of quality-related factors, including in-capture authentic distortions (e.g. motion blur, noise, flicker), errors introduced by compression and transmission, and higher-level experiences on semantic contents and aesthetic issues (e.g. composition, camera trajectory), to establish the multi-dimensional Maxwell dat",
    "path": "papers/23/05/2305.12726.json",
    "total_tokens": 958,
    "translated_title": "朝着可解释的野外视频质量评估：数据库和以语言提示为基础的方法",
    "translated_abstract": "野外视频的蓬勃发展大大拓展了视频质量评估（VQA）问题。与通常只关注有限的失真类型的早期定义不同，野外视频上的VQA尤其具有挑战性，因为它可能受到各种失真和多样化内容的影响。虽然主观研究已经收集了这些视频的整体质量得分，但抽象质量得分与具体因素的关系仍然不清楚，这阻碍了VQA方法对质量评估的更具体评估（例如视频的清晰度）。为解决这个问题，我们收集了对13个与质量相关因素（包括捕捉中的真实失真，如运动模糊、噪声、闪烁；由压缩和传输引起的错误；以及对语义内容和审美问题的更高层次体验，如构成、镜头轨迹）下的4,543个野外视频的两百多万个意见，以建立多维度的麦克斯韦数据库。",
    "tldr": "该论文提出了一个以语言提示为基础的方法和一个包含13个与质量相关因素的数据库，用于解决野外视频质量评估中的可解释性问题，该方法通过收集意见和数据来建立多维麦克斯韦数据库，以帮助评估视频质量。"
}