{
    "title": "Joint MR sequence optimization beats pure neural network approaches for spin-echo MRI super-resolution. (arXiv:2305.07524v1 [physics.med-ph])",
    "abstract": "Current MRI super-resolution (SR) methods only use existing contrasts acquired from typical clinical sequences as input for the neural network (NN). In turbo spin echo sequences (TSE) the sequence parameters can have a strong influence on the actual resolution of the acquired image and have consequently a considera-ble impact on the performance of the NN. We propose a known-operator learning approach to perform an end-to-end optimization of MR sequence and neural net-work parameters for SR-TSE. This MR-physics-informed training procedure jointly optimizes the radiofrequency pulse train of a proton density- (PD-) and T2-weighted TSE and a subsequently applied convolutional neural network to predict the corresponding PDw and T2w super-resolution TSE images. The found radiofrequency pulse train designs generate an optimal signal for the NN to perform the SR task. Our method generalizes from the simulation-based optimi-zation to in vivo measurements and the acquired physics-informed SR ima",
    "link": "http://arxiv.org/abs/2305.07524",
    "context": "Title: Joint MR sequence optimization beats pure neural network approaches for spin-echo MRI super-resolution. (arXiv:2305.07524v1 [physics.med-ph])\nAbstract: Current MRI super-resolution (SR) methods only use existing contrasts acquired from typical clinical sequences as input for the neural network (NN). In turbo spin echo sequences (TSE) the sequence parameters can have a strong influence on the actual resolution of the acquired image and have consequently a considera-ble impact on the performance of the NN. We propose a known-operator learning approach to perform an end-to-end optimization of MR sequence and neural net-work parameters for SR-TSE. This MR-physics-informed training procedure jointly optimizes the radiofrequency pulse train of a proton density- (PD-) and T2-weighted TSE and a subsequently applied convolutional neural network to predict the corresponding PDw and T2w super-resolution TSE images. The found radiofrequency pulse train designs generate an optimal signal for the NN to perform the SR task. Our method generalizes from the simulation-based optimi-zation to in vivo measurements and the acquired physics-informed SR ima",
    "path": "papers/23/05/2305.07524.json",
    "total_tokens": 944,
    "translated_title": "联合磁共振序列优化超越了纯神经网络方法的自旋回波磁共振成像超分辨率",
    "translated_abstract": "目前的MRI超分辨率方法仅使用从典型临床序列中获取的已有对比度作为神经网络(NN)的输入。在涡轮自旋回波序列(TSE)中，序列参数对实际获得图像的分辨率有很大影响，从而对NN的性能有重要影响。我们提出了一种已知运算符学习方法，通过端到端优化MR序列和神经网络参数来进行SR-TSE。这种基于MR物理学的训练过程联合优化了质子密度(PD)加权TSE和T2加权TSE的射频脉冲列，以及随后应用的卷积神经网络来预测相应的超分辨率PDw和T2w TSE图像。所发现的射频脉冲列设计为NN生成了最优信号来执行SR任务。我们的方法从基于模拟的优化推广到体内实测和获得的物理学知识的SR图像。",
    "tldr": "该论文提出了一种联合磁共振序列优化和神经网络方法来实现MR图像的超分辨率，通过消除序列参数对实际图像分辨率的影响，以及优化射频脉冲列设计来提高神经网络执行超分辨率任务的性能。"
}