{
    "title": "Point2SSM: Learning Morphological Variations of Anatomies from Point Cloud. (arXiv:2305.14486v1 [cs.CV])",
    "abstract": "We introduce Point2SSM, a novel unsupervised learning approach that can accurately construct correspondence-based statistical shape models (SSMs) of anatomy directly from point clouds. SSMs are crucial in clinical research for analyzing the population-level morphological variation in bones and organs. However, traditional methods for creating SSMs have limitations that hinder their widespread adoption, such as the need for noise-free surface meshes or binary volumes, reliance on assumptions or predefined templates, and simultaneous optimization of the entire cohort leading to lengthy inference times given new data. Point2SSM overcomes these barriers by providing a data-driven solution that infers SSMs directly from raw point clouds, reducing inference burdens and increasing applicability as point clouds are more easily acquired. Deep learning on 3D point clouds has seen recent success in unsupervised representation learning, point-to-point matching, and shape correspondence; however, t",
    "link": "http://arxiv.org/abs/2305.14486",
    "context": "Title: Point2SSM: Learning Morphological Variations of Anatomies from Point Cloud. (arXiv:2305.14486v1 [cs.CV])\nAbstract: We introduce Point2SSM, a novel unsupervised learning approach that can accurately construct correspondence-based statistical shape models (SSMs) of anatomy directly from point clouds. SSMs are crucial in clinical research for analyzing the population-level morphological variation in bones and organs. However, traditional methods for creating SSMs have limitations that hinder their widespread adoption, such as the need for noise-free surface meshes or binary volumes, reliance on assumptions or predefined templates, and simultaneous optimization of the entire cohort leading to lengthy inference times given new data. Point2SSM overcomes these barriers by providing a data-driven solution that infers SSMs directly from raw point clouds, reducing inference burdens and increasing applicability as point clouds are more easily acquired. Deep learning on 3D point clouds has seen recent success in unsupervised representation learning, point-to-point matching, and shape correspondence; however, t",
    "path": "papers/23/05/2305.14486.json",
    "total_tokens": 912,
    "translated_title": "Point2SSM：从点云学习解剖结构的形态变异",
    "translated_abstract": "我们介绍了Point2SSM，一种新的无监督学习方法，可以直接从点云精确地构建基于对应关系的解剖统计形态模型（SSM）。 SSM在临床研究中非常关键，用于分析骨骼和器官中的群体水平形态变异。然而，传统的SSM创建方法具有一定局限性，如需要无噪声表面网格或二进制体积，依赖于假设或预定义模板，以及针对整个队列的同时优化导致长时间推断新数据。Point2SSM通过提供数据驱动的解决方案来克服这些障碍，从原始点云中直接推断SSM，减少了推断负担，并提高了适用性，因为点云更容易获取。",
    "tldr": "Point2SSM可以直接从点云中构建出解剖统计形态模型，克服了传统方法需要无噪声表面网格或二进制体积，依赖于假设或预定义模板，以及同时优化导致长时间推断新数据的局限性。",
    "en_tdlr": "Point2SSM can construct statistical shape models directly from point clouds and overcomes limitations of traditional methods such as the need for noise-free surface meshes or binary volumes, reliance on assumptions or predefined templates, and simultaneous optimization leading to lengthy inference times given new data."
}