{
    "title": "A Comprehensive AI Policy Education Framework for University Teaching and Learning. (arXiv:2305.00280v1 [cs.CY])",
    "abstract": "This study aims to develop an AI education policy for higher education by examining the perceptions and implications of text generative AI technologies. Data was collected from 457 students and 180 teachers and staff across various disciplines in Hong Kong universities, using both quantitative and qualitative research methods. Based on the findings, the study proposes an AI Ecological Education Policy Framework to address the multifaceted implications of AI integration in university teaching and learning. This framework is organized into three dimensions: Pedagogical, Governance, and Operational. The Pedagogical dimension concentrates on using AI to improve teaching and learning outcomes, while the Governance dimension tackles issues related to privacy, security, and accountability. The Operational dimension addresses matters concerning infrastructure and training. The framework fosters a nuanced understanding of the implications of AI integration in academic settings, ensuring that st",
    "link": "http://arxiv.org/abs/2305.00280",
    "context": "Title: A Comprehensive AI Policy Education Framework for University Teaching and Learning. (arXiv:2305.00280v1 [cs.CY])\nAbstract: This study aims to develop an AI education policy for higher education by examining the perceptions and implications of text generative AI technologies. Data was collected from 457 students and 180 teachers and staff across various disciplines in Hong Kong universities, using both quantitative and qualitative research methods. Based on the findings, the study proposes an AI Ecological Education Policy Framework to address the multifaceted implications of AI integration in university teaching and learning. This framework is organized into three dimensions: Pedagogical, Governance, and Operational. The Pedagogical dimension concentrates on using AI to improve teaching and learning outcomes, while the Governance dimension tackles issues related to privacy, security, and accountability. The Operational dimension addresses matters concerning infrastructure and training. The framework fosters a nuanced understanding of the implications of AI integration in academic settings, ensuring that st",
    "path": "papers/23/05/2305.00280.json",
    "total_tokens": 933,
    "translated_title": "高校教学和学习的全面AI政策教育框架",
    "translated_abstract": "本研究旨在通过研究文本生成AI技术的认知和影响，为高等教育开发一项AI教育政策。使用定量和定性研究方法，从香港各大学的457名学生和180名教师及工作人员中收集数据。基于这些发现，本研究提出了一个AI生态教育政策框架，以应对AI整合在高校教学和学习中的多方面影响。该框架由三个方面组成： 教学、治理和运营。教学方面的重点是利用AI来提高教学和学习成果，治理方面则解决有关隐私、安全和问责制的问题，而运营方面则处理基础设施和培训等问题。该框架促进了对AI整合在学术环境中的影响的细致理解，确保学校在AI整合之际的正确认识。",
    "tldr": "本研究基于针对香港大学学生和教职员工的数据研究，提出了一个AI教育政策框架来处理AI整合在高校教学和学习中的多方面影响。该框架由教学、治理和运营三个方面组成，以确保学校在AI整合中的正确认识。"
}