{
    "title": "Pay More Attention to Relation Exploration for Knowledge Base Question Answering. (arXiv:2305.02118v1 [cs.CL])",
    "abstract": "Knowledge base question answering (KBQA) is a challenging task that aims to retrieve correct answers from large-scale knowledge bases. Existing attempts primarily focus on entity representation and final answer reasoning, which results in limited supervision for this task. Moreover, the relations, which empirically determine the reasoning path selection, are not fully considered in recent advancements. In this study, we propose a novel framework, RE-KBQA, that utilizes relations in the knowledge base to enhance entity representation and introduce additional supervision. We explore guidance from relations in three aspects, including (1) distinguishing similar entities by employing a variational graph auto-encoder to learn relation importance; (2) exploring extra supervision by predicting relation distributions as soft labels with a multi-task scheme; (3) designing a relation-guided re-ranking algorithm for post-processing. Experimental results on two benchmark datasets demonstrate the e",
    "link": "http://arxiv.org/abs/2305.02118",
    "context": "Title: Pay More Attention to Relation Exploration for Knowledge Base Question Answering. (arXiv:2305.02118v1 [cs.CL])\nAbstract: Knowledge base question answering (KBQA) is a challenging task that aims to retrieve correct answers from large-scale knowledge bases. Existing attempts primarily focus on entity representation and final answer reasoning, which results in limited supervision for this task. Moreover, the relations, which empirically determine the reasoning path selection, are not fully considered in recent advancements. In this study, we propose a novel framework, RE-KBQA, that utilizes relations in the knowledge base to enhance entity representation and introduce additional supervision. We explore guidance from relations in three aspects, including (1) distinguishing similar entities by employing a variational graph auto-encoder to learn relation importance; (2) exploring extra supervision by predicting relation distributions as soft labels with a multi-task scheme; (3) designing a relation-guided re-ranking algorithm for post-processing. Experimental results on two benchmark datasets demonstrate the e",
    "path": "papers/23/05/2305.02118.json",
    "total_tokens": 926,
    "translated_title": "关注关系探索，提升知识库问答技术",
    "translated_abstract": "知识库问答（KBQA）是一项挑战性的任务，旨在从大规模知识库中检索正确答案。现有研究主要关注实体表示和最终答案推理，导致对此任务的限制性监督。此外，关系在最近的技术中并未被充分考虑，而关系实际上决定了推理路径的选择。在本研究中，我们提出了一个新框架RE-KBQA，利用知识库中的关系增强实体表示，并引入额外的监督。我们从三个方面探索关系指导，包括（1）通过使用变分图自编码器学习关系重要性来区分相似实体；（2）通过预测关系分布作为软标签，采用多任务方案探索额外监督；（3）设计基于关系指导的重排算法进行后处理。在两个基准数据集上的实验结果表明了该方法的有效性。",
    "tldr": "该研究提出了一个新框架RE-KBQA，利用知识库中的关系增强实体表示，并引入额外监督。在三个方面探索关系指导，包括区分相似实体、探索额外监督以及进行后处理的基于关系指导的重排算法。该方法在两个基准数据集上验证有效性。",
    "en_tdlr": "This study proposes a novel framework, RE-KBQA, that enhances entity representation and introduces additional supervision by utilizing relations in the knowledge base. It explores guidance from relations in three aspects, including distinguishing similar entities, exploring extra supervision, and designing relation-guided re-ranking. The experimental results on two benchmark datasets demonstrate the effectiveness of the proposed method."
}