{
    "title": "Monitoring and Adapting ML Models on Mobile Devices. (arXiv:2305.07772v1 [cs.LG])",
    "abstract": "ML models are increasingly being pushed to mobile devices, for low-latency inference and offline operation. However, once the models are deployed, it is hard for ML operators to track their accuracy, which can degrade unpredictably (e.g., due to data drift). We design Nazar, the first end-to-end system for continuously monitoring and adapting models on mobile devices without requiring feedback from users. Our key observation is that often model degradation is due to a specific root cause, which may affect a large group of devices. Therefore, once Nazar detects a consistent degradation across a large number of devices, it employs a root cause analysis to determine the origin of the problem and applies a cause-specific adaptation. We evaluate Nazar on two computer vision datasets, and show it consistently boosts accuracy compared to existing approaches. On a dataset containing photos collected from driving cars, Nazar improves the accuracy on average by 15%.",
    "link": "http://arxiv.org/abs/2305.07772",
    "context": "Title: Monitoring and Adapting ML Models on Mobile Devices. (arXiv:2305.07772v1 [cs.LG])\nAbstract: ML models are increasingly being pushed to mobile devices, for low-latency inference and offline operation. However, once the models are deployed, it is hard for ML operators to track their accuracy, which can degrade unpredictably (e.g., due to data drift). We design Nazar, the first end-to-end system for continuously monitoring and adapting models on mobile devices without requiring feedback from users. Our key observation is that often model degradation is due to a specific root cause, which may affect a large group of devices. Therefore, once Nazar detects a consistent degradation across a large number of devices, it employs a root cause analysis to determine the origin of the problem and applies a cause-specific adaptation. We evaluate Nazar on two computer vision datasets, and show it consistently boosts accuracy compared to existing approaches. On a dataset containing photos collected from driving cars, Nazar improves the accuracy on average by 15%.",
    "path": "papers/23/05/2305.07772.json",
    "total_tokens": 899,
    "translated_title": "在移动设备上监测和调整机器学习模型",
    "translated_abstract": "为了实现低延迟推理和离线操作，机器学习模型越来越多地被部署到移动设备上。然而，一旦部署了模型，运营者难以追踪其精确度，可能会因为数据漂移等问题而不可预测地降低。我们设计了Nazr，这是第一个端到端的系统，可以在移动设备上连续监测和调整模型，无需用户反馈。我们的关键观察是，模型退化通常是由特定的根本原因造成的，这可能会影响大量设备。因此，一旦Nazr检测到大量设备上的一致性退化，它就会采用根本原因分析来确定问题的起源，并应用特定于原因的适应。我们在两个计算机视觉数据集上评估了Nazr，并展示了与现有方法相比，它在提高准确性方面始终表现出色。在一个包含从驾驶汽车中收集的照片的数据集上，Nazr的平均准确性提高了15％。",
    "tldr": "这篇论文介绍了Nazr，这是一个能够在移动设备上连续监测和调整机器学习模型，以提高模型准确性的端到端系统。",
    "en_tdlr": "This paper introduces Nazr, the first end-to-end system for continuously monitoring and adapting machine learning models on mobile devices without requiring feedback from users, which can improve model accuracy by applying cause-specific adaptation once the system detects consistent degradation across a large number of devices."
}