{
    "title": "Sex Detection in the Early Stage of Fertilized Chicken Eggs via Image Recognition. (arXiv:2305.02325v1 [q-bio.QM])",
    "abstract": "Culling newly hatched male chicks in industrial hatcheries poses a serious ethical problem. Both laying and broiler breeders need males, but it is a problem because they are produced more than needed. Being able to determine the sex of chicks in the egg at the beginning or early stage of incubation can eliminate ethical problems as well as many additional costs. When we look at the literature, the methods used are very costly, low in applicability, invasive, inadequate in accuracy, or too late to eliminate ethical problems. Considering the embryo's development, the earliest observed candidate feature for sex determination is blood vessels. Detection from blood vessels can eliminate ethical issues, and these vessels can be seen when light is shined into the egg until the first seven days. In this study, sex determination was made by morphological analysis from embryonic vascular images obtained in the first week when the light was shined into the egg using a standard camera without any ",
    "link": "http://arxiv.org/abs/2305.02325",
    "context": "Title: Sex Detection in the Early Stage of Fertilized Chicken Eggs via Image Recognition. (arXiv:2305.02325v1 [q-bio.QM])\nAbstract: Culling newly hatched male chicks in industrial hatcheries poses a serious ethical problem. Both laying and broiler breeders need males, but it is a problem because they are produced more than needed. Being able to determine the sex of chicks in the egg at the beginning or early stage of incubation can eliminate ethical problems as well as many additional costs. When we look at the literature, the methods used are very costly, low in applicability, invasive, inadequate in accuracy, or too late to eliminate ethical problems. Considering the embryo's development, the earliest observed candidate feature for sex determination is blood vessels. Detection from blood vessels can eliminate ethical issues, and these vessels can be seen when light is shined into the egg until the first seven days. In this study, sex determination was made by morphological analysis from embryonic vascular images obtained in the first week when the light was shined into the egg using a standard camera without any ",
    "path": "papers/23/05/2305.02325.json",
    "total_tokens": 774,
    "translated_abstract": "伦理问题和额外成本是为工业孵化场舍弃新孵化出的雄性幼鸡带来的严重问题，而在孵化早期能够确定幼鸡性别可以消除这些问题。本研究通过在受精鸡蛋初期利用标准相机拍摄血管图像，进行形态分析以确定幼鸡的性别，从而实现了无侵入、低成本的性别检测方法。",
    "tldr": "通过拍摄受精鸡蛋内部血管图像进行形态分析，本研究开发了一种无侵入、低成本的早期性别检测方法，解决了孵化场舍弃新孵出的雄性幼鸡的伦理问题。"
}