{
    "title": "Streaming Object Detection on Fisheye Cameras for Automatic Parking. (arXiv:2305.14713v1 [cs.CV])",
    "abstract": "Fisheye cameras are widely employed in automatic parking, and the video stream object detection (VSOD) of the fisheye camera is a fundamental perception function to ensure the safe operation of vehicles. In past research work, the difference between the output of the deep learning model and the actual situation at the current moment due to the existence of delay of the perception system is generally ignored. But the environment will inevitably change within the delay time which may cause a potential safety hazard. In this paper, we propose a real-time detection framework equipped with a dual-flow perception module (dynamic and static flows) that can predict the future and alleviate the time-lag problem. Meanwhile, we use a new scheme to evaluate latency and accuracy. The standard bounding box is unsuitable for the object in fisheye camera images due to the strong radial distortion of the fisheye camera and the primary detection objects of parking perception are vehicles and pedestrians",
    "link": "http://arxiv.org/abs/2305.14713",
    "context": "Title: Streaming Object Detection on Fisheye Cameras for Automatic Parking. (arXiv:2305.14713v1 [cs.CV])\nAbstract: Fisheye cameras are widely employed in automatic parking, and the video stream object detection (VSOD) of the fisheye camera is a fundamental perception function to ensure the safe operation of vehicles. In past research work, the difference between the output of the deep learning model and the actual situation at the current moment due to the existence of delay of the perception system is generally ignored. But the environment will inevitably change within the delay time which may cause a potential safety hazard. In this paper, we propose a real-time detection framework equipped with a dual-flow perception module (dynamic and static flows) that can predict the future and alleviate the time-lag problem. Meanwhile, we use a new scheme to evaluate latency and accuracy. The standard bounding box is unsuitable for the object in fisheye camera images due to the strong radial distortion of the fisheye camera and the primary detection objects of parking perception are vehicles and pedestrians",
    "path": "papers/23/05/2305.14713.json",
    "total_tokens": 897,
    "translated_title": "自动泊车的鱼眼摄像头流式目标检测系统",
    "translated_abstract": "鱼眼摄像头广泛应用于自动泊车，而其视频流目标检测是确保车辆安全运行的基本感知功能。以往的研究忽略了深度学习模型输出与当前实际情况存在的时延差异，然而环境在时延时间内不可避免的会发生变化，可能造成潜在的安全隐患。本文提出了一个配备动态和静态流双流感知模块，可以预测未来并减轻时延问题的实时检测框架。同时，我们使用一种新的方案评估延迟和准确性。标准边界框对于鱼眼摄像头图像中的对象不适用，因为鱼眼摄像头的强烈径向畸变，而停车感知的主要检测对象是车辆和行人。",
    "tldr": "这篇论文提出了一个实时检测框架，使用动态和静态流双流感知模块，能够预测未来并减轻时延问题，解决了以往鱼眼摄像头目标检测中时延差异带来的安全隐患问题。",
    "en_tdlr": "This paper proposed a real-time detection framework equipped with a dual-flow perception module that can predict the future and alleviate the time-lag problem in fisheye camera object detection for automatic parking, which solved the safety hazard caused by the delay difference in previous fisheye camera object detection."
}