{
    "title": "Stackelberg Decision Transformer for Asynchronous Action Coordination in Multi-Agent Systems. (arXiv:2305.07856v1 [cs.MA])",
    "abstract": "Asynchronous action coordination presents a pervasive challenge in Multi-Agent Systems (MAS), which can be represented as a Stackelberg game (SG). However, the scalability of existing Multi-Agent Reinforcement Learning (MARL) methods based on SG is severely constrained by network structures or environmental limitations. To address this issue, we propose the Stackelberg Decision Transformer (STEER), a heuristic approach that resolves the difficulties of hierarchical coordination among agents. STEER efficiently manages decision-making processes in both spatial and temporal contexts by incorporating the hierarchical decision structure of SG, the modeling capability of autoregressive sequence models, and the exploratory learning methodology of MARL. Our research contributes to the development of an effective and adaptable asynchronous action coordination method that can be widely applied to various task types and environmental configurations in MAS. Experimental results demonstrate that ou",
    "link": "http://arxiv.org/abs/2305.07856",
    "context": "Title: Stackelberg Decision Transformer for Asynchronous Action Coordination in Multi-Agent Systems. (arXiv:2305.07856v1 [cs.MA])\nAbstract: Asynchronous action coordination presents a pervasive challenge in Multi-Agent Systems (MAS), which can be represented as a Stackelberg game (SG). However, the scalability of existing Multi-Agent Reinforcement Learning (MARL) methods based on SG is severely constrained by network structures or environmental limitations. To address this issue, we propose the Stackelberg Decision Transformer (STEER), a heuristic approach that resolves the difficulties of hierarchical coordination among agents. STEER efficiently manages decision-making processes in both spatial and temporal contexts by incorporating the hierarchical decision structure of SG, the modeling capability of autoregressive sequence models, and the exploratory learning methodology of MARL. Our research contributes to the development of an effective and adaptable asynchronous action coordination method that can be widely applied to various task types and environmental configurations in MAS. Experimental results demonstrate that ou",
    "path": "papers/23/05/2305.07856.json",
    "total_tokens": 906,
    "translated_title": "Stackelberg决策变换器用于多智能体系统中的异步动作协调",
    "translated_abstract": "异步动作协调在多智能体系统（MAS）中面临着普遍的挑战，可以被表示为一个Stackelberg游戏（SG）。然而，基于SG的现有多智能体强化学习（MARL）方法的可扩展性受到网络结构或环境限制的严重制约。为了解决这个问题，我们提出了Stackelberg决策变换器（STEER），这是一种启发式方法，它解决了代理之间层次协调的困难。STEER通过将SG的层次决策结构、自回归序列模型的建模能力和MARL的探索性学习方法结合起来，高效地管理空间和时间上的决策过程。我们的研究有助于开发一种有效和适应性强的异步动作协调方法，可广泛应用于MAS中的各种任务类型和环境配置。实验结果表明，我们的方法在不同环境下具有很好的性能表现。",
    "tldr": "STEER是一种可以解决多智能体系统中异步动作协调问题的启发式方法，通过结合层次决策结构、自回归序列模型的建模能力和探索性学习方法高效地管理空间和时间上的决策过程。",
    "en_tdlr": "STEER is a heuristic approach to solve the problem of asynchronous action coordination in multi-agent systems, which efficiently manages decision-making processes in both spatial and temporal contexts by incorporating the hierarchical decision structure of Stackelberg game, the modeling capability of autoregressive sequence models, and the exploratory learning methodology of multi-agent reinforcement learning."
}