{
    "title": "Large Language Models Can Be Used To Effectively Scale Spear Phishing Campaigns. (arXiv:2305.06972v1 [cs.CY])",
    "abstract": "Recent progress in artificial intelligence (AI), particularly in the domain of large language models (LLMs), has resulted in powerful and versatile dual-use systems. Indeed, cognition can be put towards a wide variety of tasks, some of which can result in harm. This study investigates how LLMs can be used for spear phishing, a prevalent form of cybercrime that involves manipulating targets into divulging sensitive information. I first explore LLMs' ability to assist with the reconnaissance and message generation stages of a successful spear phishing attack, where I find that advanced LLMs are capable of meaningfully improving cybercriminals' efficiency during these stages. Next, I conduct an empirical test by creating unique spear phishing messages for over 600 British Members of Parliament using OpenAI's GPT-3.5 and GPT-4 models. My findings reveal that these messages are not only realistic but also remarkably cost-effective, as each email cost only a fraction of a cent to generate. N",
    "link": "http://arxiv.org/abs/2305.06972",
    "context": "Title: Large Language Models Can Be Used To Effectively Scale Spear Phishing Campaigns. (arXiv:2305.06972v1 [cs.CY])\nAbstract: Recent progress in artificial intelligence (AI), particularly in the domain of large language models (LLMs), has resulted in powerful and versatile dual-use systems. Indeed, cognition can be put towards a wide variety of tasks, some of which can result in harm. This study investigates how LLMs can be used for spear phishing, a prevalent form of cybercrime that involves manipulating targets into divulging sensitive information. I first explore LLMs' ability to assist with the reconnaissance and message generation stages of a successful spear phishing attack, where I find that advanced LLMs are capable of meaningfully improving cybercriminals' efficiency during these stages. Next, I conduct an empirical test by creating unique spear phishing messages for over 600 British Members of Parliament using OpenAI's GPT-3.5 and GPT-4 models. My findings reveal that these messages are not only realistic but also remarkably cost-effective, as each email cost only a fraction of a cent to generate. N",
    "path": "papers/23/05/2305.06972.json",
    "total_tokens": 871,
    "translated_title": "大型语言模型可用于有效扩展钓鱼邮件攻击",
    "translated_abstract": "人工智能领域的最新进展尤其是大型语言模型的发展，已经产生了功能强大而通用的双重用途系统。本研究调查了如何使用大型语言模型进行钓鱼邮件攻击，这种流行的网络犯罪形式涉及将目标人物诱骗披露敏感信息。作者首先研究了LLMs在成功的钓鱼攻击的侦察和信息生成阶段的能力，发现先进的LLMs能够在这些阶段显着提高网络罪犯的效率。其次，作者使用OpenAI的GPT-3.5和GPT-4模型为超过600名英国议员创建了独特的钓鱼邮件的实证测试。研究结果表明，这些邮件不仅逼真而且成本效益显著，每封电子邮件仅花费几分之一的美分即可产生。",
    "tldr": "大型语言模型可用于扩展钓鱼邮件攻击，作者通过实证测试表明高级的语言模型可以显著提高攻击的效率和成本效益。",
    "en_tdlr": "Large language models can be used to effectively scale spear phishing campaigns, author's empirical test shows that advanced language models can significantly improve the efficiency and cost-effectiveness of attacks."
}