{
    "title": "The star-shaped space of solutions of the spherical negative perceptron. (arXiv:2305.10623v1 [cond-mat.dis-nn])",
    "abstract": "Empirical studies on the landscape of neural networks have shown that low-energy configurations are often found in complex connected structures, where zero-energy paths between pairs of distant solutions can be constructed. Here we consider the spherical negative perceptron, a prototypical non-convex neural network model framed as a continuous constraint satisfaction problem. We introduce a general analytical method for computing energy barriers in the simplex with vertex configurations sampled from the equilibrium. We find that in the over-parameterized regime the solution manifold displays simple connectivity properties. There exists a large geodesically convex component that is attractive for a wide range of optimization dynamics. Inside this region we identify a subset of atypically robust solutions that are geodesically connected with most other solutions, giving rise to a star-shaped geometry. We analytically characterize the organization of the connected space of solutions and s",
    "link": "http://arxiv.org/abs/2305.10623",
    "context": "Title: The star-shaped space of solutions of the spherical negative perceptron. (arXiv:2305.10623v1 [cond-mat.dis-nn])\nAbstract: Empirical studies on the landscape of neural networks have shown that low-energy configurations are often found in complex connected structures, where zero-energy paths between pairs of distant solutions can be constructed. Here we consider the spherical negative perceptron, a prototypical non-convex neural network model framed as a continuous constraint satisfaction problem. We introduce a general analytical method for computing energy barriers in the simplex with vertex configurations sampled from the equilibrium. We find that in the over-parameterized regime the solution manifold displays simple connectivity properties. There exists a large geodesically convex component that is attractive for a wide range of optimization dynamics. Inside this region we identify a subset of atypically robust solutions that are geodesically connected with most other solutions, giving rise to a star-shaped geometry. We analytically characterize the organization of the connected space of solutions and s",
    "path": "papers/23/05/2305.10623.json",
    "total_tokens": 945,
    "translated_title": "球形负感知器的解空间的星形特征",
    "translated_abstract": "对神经网络景观的经验研究表明，低能配置通常出现在复杂的连通结构中，在那里可以构建远距离解之间的零能路径。本文研究球形负感知器，一个作为连续约束满足问题的典型非凸神经网络模型。我们引入了一种计算从平衡点采样的顶点配置的单纯形中能量障碍的通用分析方法。在过度参数化的区域内，解决方案流形显示出简单的连通性质。存在一个大的测地凸成分，对各种优化动力学具有吸引力。在这个区域内，我们确定了一个与大多数其他解决方案测地连接的非典型鲁棒解决方案的子集，从而产生了星形的几何形状。我们分析性地表征了解空间的连接结构组织。",
    "tldr": "本文针对球形负感知器模型的解空间展开研究，发现在过度参数化的区域内解决方案流形显示出简单的连通性质。存在一个大的测地凸成分，对各种优化动力学具有吸引力，其中又有一个与大多数其他解决方案测地连接的非典型鲁棒解决方案的子集，从而产生了星形的几何形状。",
    "en_tdlr": "This paper studies the solution space of the spherical negative perceptron model and reveals that in the over-parameterized regime, the solution manifold displays simple connectivity properties and has a large geodesically convex component that is attractive for various optimization dynamics. Inside this region, a subset of atypically robust solutions that are geodesically connected with most other solutions forms a star-shaped geometry."
}