{
    "title": "An Improved Model Ensembled of Different Hyper-parameter Tuned Machine Learning Algorithms for Fetal Health Prediction. (arXiv:2305.17156v1 [cs.LG])",
    "abstract": "Fetal health is a critical concern during pregnancy as it can impact the well-being of both the mother and the baby. Regular monitoring and timely interventions are necessary to ensure the best possible outcomes. While there are various methods to monitor fetal health in the mother's womb, the use of artificial intelligence (AI) can improve the accuracy, efficiency, and speed of diagnosis. In this study, we propose a robust ensemble model called ensemble of tuned Support Vector Machine and ExtraTrees (ETSE) for predicting fetal health. Initially, we employed various data preprocessing techniques such as outlier rejection, missing value imputation, data standardization, and data sampling. Then, seven machine learning (ML) classifiers including Support Vector Machine (SVM), XGBoost (XGB), Light Gradient Boosting Machine (LGBM), Decision Tree (DT), Random Forest (RF), ExtraTrees (ET), and K-Neighbors were implemented. These models were evaluated and then optimized by hyperparameter tuning",
    "link": "http://arxiv.org/abs/2305.17156",
    "context": "Title: An Improved Model Ensembled of Different Hyper-parameter Tuned Machine Learning Algorithms for Fetal Health Prediction. (arXiv:2305.17156v1 [cs.LG])\nAbstract: Fetal health is a critical concern during pregnancy as it can impact the well-being of both the mother and the baby. Regular monitoring and timely interventions are necessary to ensure the best possible outcomes. While there are various methods to monitor fetal health in the mother's womb, the use of artificial intelligence (AI) can improve the accuracy, efficiency, and speed of diagnosis. In this study, we propose a robust ensemble model called ensemble of tuned Support Vector Machine and ExtraTrees (ETSE) for predicting fetal health. Initially, we employed various data preprocessing techniques such as outlier rejection, missing value imputation, data standardization, and data sampling. Then, seven machine learning (ML) classifiers including Support Vector Machine (SVM), XGBoost (XGB), Light Gradient Boosting Machine (LGBM), Decision Tree (DT), Random Forest (RF), ExtraTrees (ET), and K-Neighbors were implemented. These models were evaluated and then optimized by hyperparameter tuning",
    "path": "papers/23/05/2305.17156.json",
    "total_tokens": 892,
    "translated_title": "一种改进的机器学习算法超参数调整集成模型，用于胎儿健康预测",
    "translated_abstract": "胎儿健康对于孕期非常重要，因为它会影响到母亲和胎儿的健康。监测胎儿健康通常需要使用人工智能技术，可以提高诊断的准确性、效率和速度。本研究提出了一种名为ETSE的机器学习定制支持向量机和ExtraTrees集成模型，用于预测胎儿健康。该模型采用了离群值剔除、缺失值补全、数据标准化和数据抽样等预处理技术，并实现了7种机器学习分类器，包括支持向量机、XGBoost、LGBM、决策树、随机森林、ExtraTrees和K近邻。这些模型经过评估和优化，采用超参数调整进行模型性能的最优化。",
    "tldr": "本研究提出了一种名为ETSE的机器学习集成模型，用于预测胎儿健康。该模型通过采用多种数据预处理技术和7种不同的机器学习分类器，能够提高预测准确性和性能。",
    "en_tdlr": "This study presents a machine learning ensemble model called ETSE for predicting fetal health. By employing various data preprocessing techniques and 7 different machine learning classifiers, this model can improve the prediction accuracy and performance."
}