{
    "title": "Monetary Policy & Stock Market. (arXiv:2305.13930v1 [econ.GN])",
    "abstract": "This paper assesses the link between central bank's policy rate, inflation rate and output gap through Taylor rule equation in both United States and United Kingdom from 1990 to 2020. Also, it analyses the relationship between monetary policy and asset price volatility using an augmented Taylor rule. According to the literature, there has been a discussion about the utility of using asset prices to evaluate central bank monetary policy decisions. First, I derive the equation coefficients and examine the stability of the relationship over the shocking period. Test the model with actual data to see its robustness. I add asset price to the equation in the next step, and then test the relationship by Normality, Newey-West, and GMM estimator tests. Lastly, I conduct comparison between USA and UK results to find out which country's policy decisions can be explained better through Taylor rule.",
    "link": "http://arxiv.org/abs/2305.13930",
    "context": "Title: Monetary Policy & Stock Market. (arXiv:2305.13930v1 [econ.GN])\nAbstract: This paper assesses the link between central bank's policy rate, inflation rate and output gap through Taylor rule equation in both United States and United Kingdom from 1990 to 2020. Also, it analyses the relationship between monetary policy and asset price volatility using an augmented Taylor rule. According to the literature, there has been a discussion about the utility of using asset prices to evaluate central bank monetary policy decisions. First, I derive the equation coefficients and examine the stability of the relationship over the shocking period. Test the model with actual data to see its robustness. I add asset price to the equation in the next step, and then test the relationship by Normality, Newey-West, and GMM estimator tests. Lastly, I conduct comparison between USA and UK results to find out which country's policy decisions can be explained better through Taylor rule.",
    "path": "papers/23/05/2305.13930.json",
    "total_tokens": 794,
    "translated_title": "货币政策与股票市场",
    "translated_abstract": "本文通过泰勒规则公式，评估了1990年至2020年美国和英国央行政策利率、通胀率和产出缺口之间的联系。同时，使用增强的泰勒规则分析了货币政策与资产价格波动之间的关系。本文检验了方程系数的稳定性以及在不同情形下的鲁棒性。结果发现美国和英国的政策决策都可用泰勒规则解释，同时文章也探讨了资产价格用于评估央行货币政策决策的效用。",
    "tldr": "本文通过泰勒规则，研究了1990-2020年美国和英国的货币政策与股票市场之间的关系，以及货币政策与资产价格波动之间的联系，并比较了美国和英国的政策决策可用泰勒规则解释的程度。",
    "en_tdlr": "This paper examines the relationship between monetary policy and stock market in the US and UK from 1990 to 2020 using Taylor rule equation, and analyzes the relationship between monetary policy and asset price volatility. The study finds that both countries' policy decisions can be explained through the Taylor rule, and discusses the utility of using asset prices to evaluate central bank monetary policy decisions."
}