{
    "title": "Semantic-aware Digital Twin for Metaverse: A Comprehensive Review. (arXiv:2305.18304v1 [cs.CY])",
    "abstract": "To facilitate the deployment of digital twins in Metaverse, the paradigm with semantic awareness has been proposed as a means for enabling accurate and task-oriented information extraction with inherent intelligence. However, this framework requires all devices in the Metaverse environment to be directly linked with the semantic model to enable faithful interpretation of messages. In contrast, this article introduces the digital twin framework, considering a smart industrial application, which enables semantic communication in conjugation with the Metaverse enabling technologies. The fundamentals of this framework are demonstrated on an industrial shopfloor management use case with a digital twin so as to improve its performance through semantic communication. An overview of semantic communication, Metaverse, and digital twins is presented. Integration of these technologies with the basic architecture as well as the impact on future industrial applications is presented. In a nutshell, ",
    "link": "http://arxiv.org/abs/2305.18304",
    "context": "Title: Semantic-aware Digital Twin for Metaverse: A Comprehensive Review. (arXiv:2305.18304v1 [cs.CY])\nAbstract: To facilitate the deployment of digital twins in Metaverse, the paradigm with semantic awareness has been proposed as a means for enabling accurate and task-oriented information extraction with inherent intelligence. However, this framework requires all devices in the Metaverse environment to be directly linked with the semantic model to enable faithful interpretation of messages. In contrast, this article introduces the digital twin framework, considering a smart industrial application, which enables semantic communication in conjugation with the Metaverse enabling technologies. The fundamentals of this framework are demonstrated on an industrial shopfloor management use case with a digital twin so as to improve its performance through semantic communication. An overview of semantic communication, Metaverse, and digital twins is presented. Integration of these technologies with the basic architecture as well as the impact on future industrial applications is presented. In a nutshell, ",
    "path": "papers/23/05/2305.18304.json",
    "total_tokens": 842,
    "translated_title": "语义感知数字孪生体在元宇宙中的综述",
    "translated_abstract": "为了在元宇宙中实现数字孪生体的部署，提出了具有语义感知能力的范式，以实现准确的、面向任务的信息提取和内在的智能化。然而，这种框架需要将元宇宙环境中的所有设备直接连接到语义模型中，以实现信息的忠实解释。相反，本文介绍了数字孪生体框架，考虑了智能工业应用，通过与元宇宙使能技术结合使用，实现了语义通信。本文介绍了语义通信、元宇宙和数字孪生体的基础知识，并在工业车间管理应用用例中展示了该框架的基本原理，以通过语义通信改善其性能。介绍了这些技术与基本架构的集成以及对未来工业应用的影响。",
    "tldr": "本文综述了数字孪生体在元宇宙中的部署，并介绍了通过语义通信实现数字孪生体与元宇宙结合的框架，以及其在智能工业应用中的基本原理和性能优化的实现。",
    "en_tdlr": "This article provides a comprehensive review of deploying digital twins in Metaverse using a paradigm with semantic awareness, allowing for accurate and task-oriented information extraction. A framework is introduced that combines digital twins with Metaverse enabling technologies through semantic communication, improving performance in an industrial use case."
}