{
    "title": "Robustness of Participatory Budgeting Outcomes: Complexity and Experiments. (arXiv:2305.08125v1 [cs.GT])",
    "abstract": "We study the robustness of approval-based participatory budgeting (PB) rules to random noise in the votes. Our contributions are twofold. First, we study the computational complexity of the #Flip-Bribery problem, where given a PB instance we ask for the number of ways in which we can flip a given number of approvals in the votes, so that a specific project is selected. The idea is that #Flip-Bribery captures the problem of computing the funding probabilities of projects in case random noise is added. Unfortunately, the problem is intractable even for the simplest PB rules. Second, we analyze the robustness of several prominent PB rules (including the basic greedy rule and the Method of Equal Shares) on real-life instances from Pabulib. Since #Flip-Bribery is intractable, we resort to sampling to obtain our results. We quantify the extent to which simple, greedy PB rules are more robust than proportional ones, and we identify three types of (very) non-robust projects in real-life PB ins",
    "link": "http://arxiv.org/abs/2305.08125",
    "context": "Title: Robustness of Participatory Budgeting Outcomes: Complexity and Experiments. (arXiv:2305.08125v1 [cs.GT])\nAbstract: We study the robustness of approval-based participatory budgeting (PB) rules to random noise in the votes. Our contributions are twofold. First, we study the computational complexity of the #Flip-Bribery problem, where given a PB instance we ask for the number of ways in which we can flip a given number of approvals in the votes, so that a specific project is selected. The idea is that #Flip-Bribery captures the problem of computing the funding probabilities of projects in case random noise is added. Unfortunately, the problem is intractable even for the simplest PB rules. Second, we analyze the robustness of several prominent PB rules (including the basic greedy rule and the Method of Equal Shares) on real-life instances from Pabulib. Since #Flip-Bribery is intractable, we resort to sampling to obtain our results. We quantify the extent to which simple, greedy PB rules are more robust than proportional ones, and we identify three types of (very) non-robust projects in real-life PB ins",
    "path": "papers/23/05/2305.08125.json",
    "total_tokens": 963,
    "translated_title": "参与式预算成果的健壮性：复杂性与实验",
    "translated_abstract": "我们研究了基于批准的参与式预算规则对选票中随机噪声的健壮性。我们的贡献有两个方面。首先，我们研究了 #Flip-Bribery 问题的计算复杂性，其中给定一个PB实例，我们问在给定的批准数量中以多少种方式翻转批准票，以便选择特定的项目。这个问题是在即使是最简单的PB规则下都是难以处理的。其次，我们分析了来自Pabulib的现实实例中几个知名PB规则（包括基本的贪婪规则和等份法则）的健壮性。由于 #Flip-Bribery 是难以处理的，我们采用抽样来获得我们的结果。我们量化了简单而贪婪的PB规则比比例式规则更具健壮性的程度，并确定了三种（非常）不稳定的实现PB实例中的项目类型。",
    "tldr": "该论文研究了基于批准的参与式预算规则对选票中随机噪声的健壮性，提出了 #Flip-Bribery 问题的计算复杂性，对比了简单而贪婪的PB规则与比例式规则在真实实例中的表现，并确定了三种（非常）不稳定的项目类型。",
    "en_tdlr": "This paper studies the robustness of approval-based participatory budgeting rules to random noise in the votes, proposes the computational complexity of the #Flip-Bribery problem, compares the performance of simple and greedy PB rules with proportional rules in real-life instances, and identifies three types of (very) non-robust projects."
}