{
    "title": "Reference-based OCT Angiogram Super-resolution with Learnable Texture Generation. (arXiv:2305.05835v1 [eess.IV])",
    "abstract": "Optical coherence tomography angiography (OCTA) is a new imaging modality to visualize retinal microvasculature and has been readily adopted in clinics. High-resolution OCT angiograms are important to qualitatively and quantitatively identify potential biomarkers for different retinal diseases accurately. However, one significant problem of OCTA is the inevitable decrease in resolution when increasing the field-of-view given a fixed acquisition time. To address this issue, we propose a novel reference-based super-resolution (RefSR) framework to preserve the resolution of the OCT angiograms while increasing the scanning area. Specifically, textures from the normal RefSR pipeline are used to train a learnable texture generator (LTG), which is designed to generate textures according to the input. The key difference between the proposed method and traditional RefSR models is that the textures used during inference are generated by the LTG instead of being searched from a single reference i",
    "link": "http://arxiv.org/abs/2305.05835",
    "context": "Title: Reference-based OCT Angiogram Super-resolution with Learnable Texture Generation. (arXiv:2305.05835v1 [eess.IV])\nAbstract: Optical coherence tomography angiography (OCTA) is a new imaging modality to visualize retinal microvasculature and has been readily adopted in clinics. High-resolution OCT angiograms are important to qualitatively and quantitatively identify potential biomarkers for different retinal diseases accurately. However, one significant problem of OCTA is the inevitable decrease in resolution when increasing the field-of-view given a fixed acquisition time. To address this issue, we propose a novel reference-based super-resolution (RefSR) framework to preserve the resolution of the OCT angiograms while increasing the scanning area. Specifically, textures from the normal RefSR pipeline are used to train a learnable texture generator (LTG), which is designed to generate textures according to the input. The key difference between the proposed method and traditional RefSR models is that the textures used during inference are generated by the LTG instead of being searched from a single reference i",
    "path": "papers/23/05/2305.05835.json",
    "total_tokens": 907,
    "translated_title": "基于参考的光学相干断层扫描血管造影超分辨率图像，带有可学习的纹理生成",
    "translated_abstract": "光学相干断层扫描血管造影（OCTA）是一种可视化视网膜微血管的新型成像技术，并已广泛应用于临床。高分辨率OCTA对于定量和定性地准确识别不同视网膜疾病的潜在生物标志物非常重要。然而，OCTA的一个显著问题是在固定采集时间的情况下增加视野时，分辨率不可避免地降低。为解决这个问题，我们提出了一种新颖的基于参考的超分辨率（RefSR）框架，以保持OCTA图像的分辨率同时增加扫描区域。具体而言，使用正常的RefSR流程中的纹理来训练一个可学习的纹理生成器（LTG），该生成器被设计用于根据输入生成纹理。",
    "tldr": "本研究提出了一种基于参考的超分辨率图像生成框架，使用可训练的纹理生成器产生纹理从而保持OCTA图像的分辨率，解决了扫描区域增大导致分辨率下降的问题。",
    "en_tdlr": "This study proposes a reference-based super-resolution framework that uses a learnable texture generator to preserve the resolution of OCT angiograms while increasing the scanning area, solving the problem of decreased resolution when increasing field-of-view during a fixed acquisition time."
}