{
    "title": "Domain-Expanded ASTE: Rethinking Generalization in Aspect Sentiment Triplet Extraction. (arXiv:2305.14434v1 [cs.CL])",
    "abstract": "Aspect Sentiment Triplet Extraction (ASTE) is a subtask of Aspect-Based Sentiment Analysis (ABSA) that considers each opinion term, their expressed sentiment, and the corresponding aspect targets. However, existing methods are limited to the in-domain setting with two domains. Hence, we propose a domain-expanded benchmark to address the in-domain, out-of-domain and cross-domain settings. We support the new benchmark by annotating more than 4000 data samples for two new domains based on hotel and cosmetics reviews. Our analysis of five existing methods shows that while there is a significant gap between in-domain and out-of-domain performance, generative methods have a strong potential for domain generalization. Our datasets, code implementation and models are available at https://github.com/DAMO-NLP-SG/domain-expanded-aste .",
    "link": "http://arxiv.org/abs/2305.14434",
    "context": "Title: Domain-Expanded ASTE: Rethinking Generalization in Aspect Sentiment Triplet Extraction. (arXiv:2305.14434v1 [cs.CL])\nAbstract: Aspect Sentiment Triplet Extraction (ASTE) is a subtask of Aspect-Based Sentiment Analysis (ABSA) that considers each opinion term, their expressed sentiment, and the corresponding aspect targets. However, existing methods are limited to the in-domain setting with two domains. Hence, we propose a domain-expanded benchmark to address the in-domain, out-of-domain and cross-domain settings. We support the new benchmark by annotating more than 4000 data samples for two new domains based on hotel and cosmetics reviews. Our analysis of five existing methods shows that while there is a significant gap between in-domain and out-of-domain performance, generative methods have a strong potential for domain generalization. Our datasets, code implementation and models are available at https://github.com/DAMO-NLP-SG/domain-expanded-aste .",
    "path": "papers/23/05/2305.14434.json",
    "total_tokens": 824,
    "translated_title": "面向领域扩展的ASTE：重新审视情感三元组提取中的泛化问题",
    "translated_abstract": "面向领域扩展的Aspect Sentiment Triplet Extraction (ASTE) 是Aspect-Based Sentiment Analysis (ABSA) 中的一个子任务，考虑每个观点术语、它们表达的情感及相应的方面目标。然而，现有方法仅限于两个领域内的场景。因此，我们提出了一个领域扩展的基准数据集，以应对领域内、领域间和跨领域的情况。我们基于酒店和化妆品评论，标注了超过4000个数据样本来支持新的基准数据集。我们对五种现有的方法进行了分析，结果表明，尽管领域内和领域外的性能存在显著差距，但生成方法在领域泛化方面具有很强的潜力。我们的数据集、代码实现和模型均可在https://github.com/DAMO-NLP-SG/domain-expanded-aste 上获得。",
    "tldr": "该论文提出了一个领域扩展的ASTE基准数据集，通过生成方法来解决领域泛化的问题。",
    "en_tdlr": "The paper proposes a domain-expanded benchmark for ASTE that addresses domain generalization using generative methods. The benchmark is supported by annotating more than 4000 data samples for two new domains based on hotel and cosmetics reviews."
}