{
    "title": "Modeling the Impact of Mentoring on Women's Work-LifeBalance: A Grounded Theory Approach. (arXiv:2305.16095v1 [econ.GN])",
    "abstract": "The purpose of this study was to model the impact of mentoring on women's work-life balance. Indeed, this study considered mentoring as a solution to create a work-life balance of women. For this purpose, semi-structured interviews with both mentors and mentees of Tehran Municipality were conducted and the collected data were analyzed using constructivist grounded theory. Findings provided a model of how mentoring affects women's work-life balance. According to this model, role management is the key criterion for work-life balancing among women. In this model, antecedents of role management and the contextual factors affecting role management, the constraints of mentoring in the organization, as well as the consequences of effective mentoring in the organization are described. The findings of this research contribute to the mentoring literature as well as to the role management literature and provide recommendations for organizations and for future research.",
    "link": "http://arxiv.org/abs/2305.16095",
    "context": "Title: Modeling the Impact of Mentoring on Women's Work-LifeBalance: A Grounded Theory Approach. (arXiv:2305.16095v1 [econ.GN])\nAbstract: The purpose of this study was to model the impact of mentoring on women's work-life balance. Indeed, this study considered mentoring as a solution to create a work-life balance of women. For this purpose, semi-structured interviews with both mentors and mentees of Tehran Municipality were conducted and the collected data were analyzed using constructivist grounded theory. Findings provided a model of how mentoring affects women's work-life balance. According to this model, role management is the key criterion for work-life balancing among women. In this model, antecedents of role management and the contextual factors affecting role management, the constraints of mentoring in the organization, as well as the consequences of effective mentoring in the organization are described. The findings of this research contribute to the mentoring literature as well as to the role management literature and provide recommendations for organizations and for future research.",
    "path": "papers/23/05/2305.16095.json",
    "total_tokens": 833,
    "translated_title": "基于现实理论的方法研究导师对女性职业生活平衡的影响",
    "translated_abstract": "该研究旨在探究导师对女性职业生活平衡的影响，并将导师视为创造女性职业生活平衡的解决方案。本研究采用建构主义现实理论分析德黑兰市政府的导师和被导师访谈所得数据，从而提供了导师如何影响女性职业生活平衡的模型。该模型中，角色管理被视为女性职业生活平衡的关键标准，描述了角色管理的先决条件、影响角色管理的情境因素以及导师在组织中有效导师和受到约束的情况对女性职业生活平衡的影响。",
    "tldr": "本文利用建构主义现实理论分析了德黑兰市政府的导师和被导师的访谈数据，提供了导师如何影响女性职业生活平衡的模型，其中角色管理是女性职业生活平衡的关键标准。",
    "en_tdlr": "This study uses constructivist grounded theory to analyze data from semi-structured interviews with mentors and mentees in Tehran Municipality, providing a model for how mentoring affects women's work-life balance, where role management is the key criterion."
}