{
    "title": "Forecast reconciliation for vaccine supply chain optimization. (arXiv:2305.01455v1 [cs.LG])",
    "abstract": "Vaccine supply chain optimization can benefit from hierarchical time series forecasting, when grouping the vaccines by type or location. However, forecasts of different hierarchy levels become incoherent when higher levels do not match the sum of the lower levels forecasts, which can be addressed by reconciliation methods.  In this paper, we tackle the vaccine sale forecasting problem by modeling sales data from GSK between 2010 and 2021 as a hierarchical time series. After forecasting future values with several ARIMA models, we systematically compare the performance of various reconciliation methods, using statistical tests. We also compare the performance of the forecast before and after COVID. The results highlight Minimum Trace and Weighted Least Squares with Structural scaling as the best performing methods, which provided a coherent forecast while reducing the forecast error of the baseline ARIMA.",
    "link": "http://arxiv.org/abs/2305.01455",
    "context": "Title: Forecast reconciliation for vaccine supply chain optimization. (arXiv:2305.01455v1 [cs.LG])\nAbstract: Vaccine supply chain optimization can benefit from hierarchical time series forecasting, when grouping the vaccines by type or location. However, forecasts of different hierarchy levels become incoherent when higher levels do not match the sum of the lower levels forecasts, which can be addressed by reconciliation methods.  In this paper, we tackle the vaccine sale forecasting problem by modeling sales data from GSK between 2010 and 2021 as a hierarchical time series. After forecasting future values with several ARIMA models, we systematically compare the performance of various reconciliation methods, using statistical tests. We also compare the performance of the forecast before and after COVID. The results highlight Minimum Trace and Weighted Least Squares with Structural scaling as the best performing methods, which provided a coherent forecast while reducing the forecast error of the baseline ARIMA.",
    "path": "papers/23/05/2305.01455.json",
    "total_tokens": 860,
    "translated_title": "疫苗供应链优化的预测协调",
    "translated_abstract": "疫苗供应链优化通过按类型或地点分组的层次时间序列预测来获益。然而，当高层次的预测结果与低层次预测结果之和不匹配时，不同层次的预测变得不一致，这可以通过协调方法进行解决。本文通过将2010年至2021年GSK公司的销售数据建模为层次时间序列，解决了疫苗销售预测问题。在使用多个ARIMA模型预测未来值后，我们系统地比较了各种协调方法的性能，并使用统计检验进行了比较。我们还比较了COVID之前和之后的预测性能。结果突出了最小迹和加权最小二乘与结构缩放的协调方法，这些方法提供了一致的预测并减少了基线ARIMA的预测误差。",
    "tldr": "本文尝试通过层次时间序列来预测疫苗销售数据，并使用协调方法解决了不同层次预测不一致的问题，结果表明最小迹和加权最小二乘与结构缩放的协调方法效果最佳，提高了预测的一致性并减少预测误差。",
    "en_tdlr": "This paper attempts to forecast vaccine sales data using hierarchical time series and solves the problem of inconsistent forecasting at different levels through reconciliation methods. The results show that Minimum Trace and Weighted Least Squares with Structural scaling are the best performing methods, improving the consistency of forecasts and reducing prediction errors."
}