{
    "title": "LineFormer: Rethinking Line Chart Data Extraction as Instance Segmentation. (arXiv:2305.01837v1 [cs.CV])",
    "abstract": "Data extraction from line-chart images is an essential component of the automated document understanding process, as line charts are a ubiquitous data visualization format. However, the amount of visual and structural variations in multi-line graphs makes them particularly challenging for automated parsing. Existing works, however, are not robust to all these variations, either taking an all-chart unified approach or relying on auxiliary information such as legends for line data extraction. In this work, we propose LineFormer, a robust approach to line data extraction using instance segmentation. We achieve state-of-the-art performance on several benchmark synthetic and real chart datasets. Our implementation is available at https://github.com/TheJaeLal/LineFormer .",
    "link": "http://arxiv.org/abs/2305.01837",
    "context": "Title: LineFormer: Rethinking Line Chart Data Extraction as Instance Segmentation. (arXiv:2305.01837v1 [cs.CV])\nAbstract: Data extraction from line-chart images is an essential component of the automated document understanding process, as line charts are a ubiquitous data visualization format. However, the amount of visual and structural variations in multi-line graphs makes them particularly challenging for automated parsing. Existing works, however, are not robust to all these variations, either taking an all-chart unified approach or relying on auxiliary information such as legends for line data extraction. In this work, we propose LineFormer, a robust approach to line data extraction using instance segmentation. We achieve state-of-the-art performance on several benchmark synthetic and real chart datasets. Our implementation is available at https://github.com/TheJaeLal/LineFormer .",
    "path": "papers/23/05/2305.01837.json",
    "total_tokens": 764,
    "translated_title": "LineFormer：将线图数据提取重新思考为实例分割",
    "translated_abstract": "从线图图像中提取数据是自动文档理解过程的重要组成部分，因为线图是一种普遍存在的数据可视化格式。然而，多线图中的视觉和结构变化量使它们特别具有挑战性。现有的工作对于所有这些变化都不是非常健壮，或者采取了一个全部图表统一的方法，或者依赖于诸如图例之类的辅助信息来提取线数据。在这项工作中，我们提出了一种使用实例分割的稳健线数据提取方法LineFormer。我们在几个基准合成和真实图表数据集上实现了最先进的性能。我们的实现可在https://github.com/TheJaeLal/LineFormer获得。",
    "tldr": "本文提出了一种使用实例分割的稳健线数据提取方法LineFormer，旨在解决多线图中视觉和结构变化所带来的挑战，其在多个基准数据集上实现了最先进的性能。",
    "en_tdlr": "The paper proposes LineFormer, a robust approach to line data extraction using instance segmentation, which aims to address the challenges posed by the visual and structural variations in multi-line graphs. The approach achieves state-of-the-art performance on several benchmark datasets."
}