{
    "title": "Dynamic Borrowing Method for Historical Information Using a Frequentist Approach for Hybrid Control Design. (arXiv:2305.14679v1 [stat.ME])",
    "abstract": "Information borrowing from historical data is gaining attention in clinical trials of rare and pediatric diseases, where statistical power may be insufficient for confirmation of efficacy if the sample size is small. Although Bayesian information borrowing methods are well established, test-then-pool and equivalence-based test-then-pool methods have recently been proposed as frequentist methods to determine whether historical data should be used for statistical hypothesis testing. Depending on the results of the hypothesis testing, historical data may not be usable. This paper proposes a dynamic borrowing method for historical information based on the similarity between current and historical data. In our proposed method of dynamic information borrowing, as in Bayesian dynamic borrowing, the amount of borrowing ranges from 0% to 100%. We propose two methods using the density function of the t-distribution and a logistic function as a similarity measure. We evaluate the performance of t",
    "link": "http://arxiv.org/abs/2305.14679",
    "context": "Title: Dynamic Borrowing Method for Historical Information Using a Frequentist Approach for Hybrid Control Design. (arXiv:2305.14679v1 [stat.ME])\nAbstract: Information borrowing from historical data is gaining attention in clinical trials of rare and pediatric diseases, where statistical power may be insufficient for confirmation of efficacy if the sample size is small. Although Bayesian information borrowing methods are well established, test-then-pool and equivalence-based test-then-pool methods have recently been proposed as frequentist methods to determine whether historical data should be used for statistical hypothesis testing. Depending on the results of the hypothesis testing, historical data may not be usable. This paper proposes a dynamic borrowing method for historical information based on the similarity between current and historical data. In our proposed method of dynamic information borrowing, as in Bayesian dynamic borrowing, the amount of borrowing ranges from 0% to 100%. We propose two methods using the density function of the t-distribution and a logistic function as a similarity measure. We evaluate the performance of t",
    "path": "papers/23/05/2305.14679.json",
    "total_tokens": 878,
    "translated_title": "基于频率学派方法的历史信息动态借用策略研究",
    "translated_abstract": "借用历史数据来进行临床试验越来越受到关注，尤其在罕见疾病和儿科疾病的试验中。虽然贝叶斯式的借用方法已经得到了广泛应用，但最近提出了基于检验和等效检验池化的频率学派方法来确定是否应该使用历史数据进行统计假设检验。根据假设检验的结果，历史数据可能无法使用。本文提出了一种基于当前数据与历史数据相似性的动态信息借用方法。在我们提出的动态信息借用方法中，借用的数量范围从0％到100％，与贝叶斯动态借用相似。我们提出了两种方法，使用t分布的密度函数和逻辑函数作为相似度的度量方式。我们评估了使用不同方法的T-test的性能，结果表明，两种方法都提高了检验性能。",
    "tldr": "本文提出了一种基于当前数据与历史数据相似性的动态信息借用方法，可用于临床试验中确定是否应该借用历史数据。结果表明，该方法可以提高试验的检验性能。",
    "en_tdlr": "This paper proposes a dynamic borrowing method for historical information based on the similarity between current and historical data, which can be used to determine whether historical data should be borrowed in clinical trials. The method can improve the test performance according to the evaluation of T-test with different methods."
}