{
    "title": "Constrained Causal Bayesian Optimization. (arXiv:2305.20011v1 [stat.ML])",
    "abstract": "We propose constrained causal Bayesian optimization (cCBO), an approach for finding interventions in a known causal graph that optimize a target variable under some constraints. cCBO first reduces the search space by exploiting the graph structure and, if available, an observational dataset; and then solves the restricted optimization problem by modelling target and constraint quantities using Gaussian processes and by sequentially selecting interventions via a constrained expected improvement acquisition function. We propose different surrogate models that enable to integrate observational and interventional data while capturing correlation among effects with increasing levels of sophistication. We evaluate cCBO on artificial and real-world causal graphs showing successful trade off between fast convergence and percentage of feasible interventions.",
    "link": "http://arxiv.org/abs/2305.20011",
    "context": "Title: Constrained Causal Bayesian Optimization. (arXiv:2305.20011v1 [stat.ML])\nAbstract: We propose constrained causal Bayesian optimization (cCBO), an approach for finding interventions in a known causal graph that optimize a target variable under some constraints. cCBO first reduces the search space by exploiting the graph structure and, if available, an observational dataset; and then solves the restricted optimization problem by modelling target and constraint quantities using Gaussian processes and by sequentially selecting interventions via a constrained expected improvement acquisition function. We propose different surrogate models that enable to integrate observational and interventional data while capturing correlation among effects with increasing levels of sophistication. We evaluate cCBO on artificial and real-world causal graphs showing successful trade off between fast convergence and percentage of feasible interventions.",
    "path": "papers/23/05/2305.20011.json",
    "total_tokens": 766,
    "translated_title": "限制因果贝叶斯优化",
    "translated_abstract": "我们提出了限制因果贝叶斯优化（cCBO）方法，用于在已知因果图中找到优化目标变量的干预方法，并满足一些约束条件。cCBO首先通过利用图形结构和存在的观测数据减少搜索空间；然后通过使用高斯过程对目标和约束量进行建模，并通过使用受限期望改进获取函数依次选择干预方法来解决受限制的优化问题。我们提出了不同的代理模型，能够集成观测和干预数据，同时以不断提高的复杂度捕捉效应之间的相关性。我们对人工和真实因果图进行了cCBO评估，成功在快速收敛和可行干预百分比之间达成平衡。",
    "tldr": "本论文提出了一种名为限制因果贝叶斯优化的方法，用于在已知因果图中寻找优化目标变量的干预方式并满足约束条件，成功地平衡了快速收敛和可行干预百分比之间的权衡。",
    "en_tdlr": "This paper proposes a Constrained Causal Bayesian Optimization (cCBO) approach for finding interventions in known causal graphs that optimize a target variable under constraints. It successfully balances between fast convergence and the percentage of feasible interventions."
}