{
    "title": "Why Not Borrow, Invest, and Escape Poverty?. (arXiv:2305.02546v1 [econ.GN])",
    "abstract": "Take up of microcredit by the poor for investment in businesses or human capital turned out to be very low. We show that this could be explained by risk aversion, without relying on fixed costs or other forms of non-convexity in the technology, if the investment is aimed at increasing the probability of success. Under this framework, rational risk-averse agents choose corner solutions, unlike in the case of a risky investment with an exogenous probability of success. Our online experiment confirms our theoretical predictions about how agents' choices differ when facing the two types of investments.",
    "link": "http://arxiv.org/abs/2305.02546",
    "context": "Title: Why Not Borrow, Invest, and Escape Poverty?. (arXiv:2305.02546v1 [econ.GN])\nAbstract: Take up of microcredit by the poor for investment in businesses or human capital turned out to be very low. We show that this could be explained by risk aversion, without relying on fixed costs or other forms of non-convexity in the technology, if the investment is aimed at increasing the probability of success. Under this framework, rational risk-averse agents choose corner solutions, unlike in the case of a risky investment with an exogenous probability of success. Our online experiment confirms our theoretical predictions about how agents' choices differ when facing the two types of investments.",
    "path": "papers/23/05/2305.02546.json",
    "total_tokens": 728,
    "translated_title": "为什么不借款、投资和摆脱贫困？",
    "translated_abstract": "穷人利用小额信贷投资于企业或人力资本的情况非常少。我们表明，如果这种投资旨在提高成功的可能性，则可以解释风险规避的情况，而无需依赖于固定成本或技术上的其他非凸性。在这种框架下，理性的风险规避者选择边角解，不同于具有外生成功概率的风险投资的情况。我们的在线实验验证了我们的理论预测，即当面临这两种类型类型的投资时，代理商选择不同的方案。",
    "tldr": "该论文针对穷人利用小额信贷投资于企业或人力资本的现状进行研究，认为风险规避是原因之一，因为投资旨在提高成功可能性，所以需要采取不同的策略。",
    "en_tdlr": "This paper explores why poor people's take-up of microcredit for investment in businesses or human capital is low, with the authors suggesting that risk aversion is a key factor. They argue that investment aimed at increasing the probability of success leads to rational risk-averse agents choosing corner solutions, unlike in the case of a risky investment with an exogenous probability of success."
}