{
    "title": "ICQ: A Quantization Scheme for Best-Arm Identification Over Bit-Constrained Channels. (arXiv:2305.00528v1 [cs.LG])",
    "abstract": "We study the problem of best-arm identification in a distributed variant of the multi-armed bandit setting, with a central learner and multiple agents. Each agent is associated with an arm of the bandit, generating stochastic rewards following an unknown distribution. Further, each agent can communicate the observed rewards with the learner over a bit-constrained channel. We propose a novel quantization scheme called Inflating Confidence for Quantization (ICQ) that can be applied to existing confidence-bound based learning algorithms such as Successive Elimination. We analyze the performance of ICQ applied to Successive Elimination and show that the overall algorithm, named ICQ-SE, has the order-optimal sample complexity as that of the (unquantized) SE algorithm. Moreover, it requires only an exponentially sparse frequency of communication between the learner and the agents, thus requiring considerably fewer bits than existing quantization schemes to successfully identify the best arm.",
    "link": "http://arxiv.org/abs/2305.00528",
    "context": "Title: ICQ: A Quantization Scheme for Best-Arm Identification Over Bit-Constrained Channels. (arXiv:2305.00528v1 [cs.LG])\nAbstract: We study the problem of best-arm identification in a distributed variant of the multi-armed bandit setting, with a central learner and multiple agents. Each agent is associated with an arm of the bandit, generating stochastic rewards following an unknown distribution. Further, each agent can communicate the observed rewards with the learner over a bit-constrained channel. We propose a novel quantization scheme called Inflating Confidence for Quantization (ICQ) that can be applied to existing confidence-bound based learning algorithms such as Successive Elimination. We analyze the performance of ICQ applied to Successive Elimination and show that the overall algorithm, named ICQ-SE, has the order-optimal sample complexity as that of the (unquantized) SE algorithm. Moreover, it requires only an exponentially sparse frequency of communication between the learner and the agents, thus requiring considerably fewer bits than existing quantization schemes to successfully identify the best arm.",
    "path": "papers/23/05/2305.00528.json",
    "total_tokens": 918,
    "translated_title": "ICQ:一种适用于位限制信道的最佳臂识别量化方案",
    "translated_abstract": "本文研究了多个代理的分布式变种多臂老虎机设置下的最佳臂识别问题，其中每个代理与老虎机的一臂相关联，生成遵循未知分布的随机回报。此外，每个代理可以通过位限制信道将观察到的回报与学习器通信。我们提出了一种新颖的量化方案，称为Inflating Confidence for Quantization（ICQ），可以应用于现有的基于置信区间的学习算法，例如连续淘汰算法。我们分析了应用于连续淘汰算法的ICQ的性能，并表明ICQ-SE的总体算法具有与（未量化的）SE算法相同的阶优化样本复杂度。此外，它只需要学习者和代理之间指数稀疏的通信频率，因此需要比现有量化方案更少的位数才能成功识别最佳臂。",
    "tldr": "本文提出了一种名为ICQ的新颖量化方案，可用于现有的置信区间学习算法，如连续淘汰算法，并在位限制信道上实现最佳臂识别，具有与未量化算法相同的阶优化样本复杂度，且仅需要极少量的通信频率。",
    "en_tdlr": "This paper proposes a novel quantization scheme, called ICQ, which can be applied to existing confidence-bound learning algorithms, and achieves best-arm identification over bit-constrained channels with the same order-optimal sample complexity as unquantized algorithms, requiring only exponentially sparse communication frequency."
}