{
    "title": "Over-the-Air Federated Averaging with Limited Power and Privacy Budgets. (arXiv:2305.03547v1 [cs.LG])",
    "abstract": "To jointly overcome the communication bottleneck and privacy leakage of wireless federated learning (FL), this paper studies a differentially private over-the-air federated averaging (DP-OTA-FedAvg) system with a limited sum power budget. With DP-OTA-FedAvg, the gradients are aligned by an alignment coefficient and aggregated over the air, and channel noise is employed to protect privacy. We aim to improve the learning performance by jointly designing the device scheduling, alignment coefficient, and the number of aggregation rounds of federated averaging (FedAvg) subject to sum power and privacy constraints. We first present the privacy analysis based on differential privacy (DP) to quantify the impact of the alignment coefficient on privacy preservation in each communication round. Furthermore, to study how the device scheduling, alignment coefficient, and the number of the global aggregation affect the learning process, we conduct the convergence analysis of DP-OTA-FedAvg in the cas",
    "link": "http://arxiv.org/abs/2305.03547",
    "context": "Title: Over-the-Air Federated Averaging with Limited Power and Privacy Budgets. (arXiv:2305.03547v1 [cs.LG])\nAbstract: To jointly overcome the communication bottleneck and privacy leakage of wireless federated learning (FL), this paper studies a differentially private over-the-air federated averaging (DP-OTA-FedAvg) system with a limited sum power budget. With DP-OTA-FedAvg, the gradients are aligned by an alignment coefficient and aggregated over the air, and channel noise is employed to protect privacy. We aim to improve the learning performance by jointly designing the device scheduling, alignment coefficient, and the number of aggregation rounds of federated averaging (FedAvg) subject to sum power and privacy constraints. We first present the privacy analysis based on differential privacy (DP) to quantify the impact of the alignment coefficient on privacy preservation in each communication round. Furthermore, to study how the device scheduling, alignment coefficient, and the number of the global aggregation affect the learning process, we conduct the convergence analysis of DP-OTA-FedAvg in the cas",
    "path": "papers/23/05/2305.03547.json",
    "total_tokens": 929,
    "translated_title": "有限功耗和隐私预算的OTA联邦平均",
    "translated_abstract": "为了共同克服无线联邦学习(FL)的通信瓶颈和隐私泄漏问题，本文研究了一种具有有限总功率预算的差分隐私OTA联邦平均(DP-OTA-FedAvg)系统。使用DP-OTA-FedAvg，梯度通过一个对齐系数进行对齐并在空中聚合，同时利用信道噪声来保护隐私。我们的目标是在满足总功率和隐私约束条件下，联合设计设备调度、对齐系数和联邦平均(FedAvg)的聚合轮数，以改善学习性能。我们首先基于差分隐私(DP)提供了隐私分析，以量化对隐私保护的影响。此外，为了研究设备调度、对齐系数和全局聚合数量对学习过程的影响，我们对DP-OTA-FedAvg的收敛性进行了分析。",
    "tldr": "本文研究了一种有限功耗和隐私预算的差分隐私OTA联邦平均系统，通过对齐系数对梯度进行聚合并使用信道噪声来保护隐私，以提高学习性能。",
    "en_tdlr": "This paper proposes a differentially private over-the-air federated averaging (DP-OTA-FedAvg) system with limited power and privacy budgets, where gradients are aligned by an alignment coefficient and aggregated over the air with channel noise employed to protect privacy. The goal is to improve learning performance by jointly designing device scheduling, alignment coefficient, and the number of aggregation rounds of federated averaging (FedAvg) subject to sum power and privacy constraints."
}