{
    "title": "GiPH: Generalizable Placement Learning for Adaptive Heterogeneous Computing. (arXiv:2305.14562v1 [cs.LG])",
    "abstract": "Careful placement of a computational application within a target device cluster is critical for achieving low application completion time. The problem is challenging due to its NP-hardness and combinatorial nature. In recent years, learning-based approaches have been proposed to learn a placement policy that can be applied to unseen applications, motivated by the problem of placing a neural network across cloud servers. These approaches, however, generally assume the device cluster is fixed, which is not the case in mobile or edge computing settings, where heterogeneous devices move in and out of range for a particular application. We propose a new learning approach called GiPH, which learns policies that generalize to dynamic device clusters via 1) a novel graph representation gpNet that efficiently encodes the information needed for choosing a good placement, and 2) a scalable graph neural network (GNN) that learns a summary of the gpNet information. GiPH turns the placement problem ",
    "link": "http://arxiv.org/abs/2305.14562",
    "context": "Title: GiPH: Generalizable Placement Learning for Adaptive Heterogeneous Computing. (arXiv:2305.14562v1 [cs.LG])\nAbstract: Careful placement of a computational application within a target device cluster is critical for achieving low application completion time. The problem is challenging due to its NP-hardness and combinatorial nature. In recent years, learning-based approaches have been proposed to learn a placement policy that can be applied to unseen applications, motivated by the problem of placing a neural network across cloud servers. These approaches, however, generally assume the device cluster is fixed, which is not the case in mobile or edge computing settings, where heterogeneous devices move in and out of range for a particular application. We propose a new learning approach called GiPH, which learns policies that generalize to dynamic device clusters via 1) a novel graph representation gpNet that efficiently encodes the information needed for choosing a good placement, and 2) a scalable graph neural network (GNN) that learns a summary of the gpNet information. GiPH turns the placement problem ",
    "path": "papers/23/05/2305.14562.json",
    "total_tokens": 973,
    "translated_title": "GiPH: 通用的自适应异构计算放置学习",
    "translated_abstract": "在目标设备群集中仔细放置计算应用程序对于实现低应用完成时间至关重要。这个问题很具有挑战性，因为它是NP难的和组合性的。近年来，提出了基于学习的方法来学习可以应用于新应用程序的放置策略，这受到将神经网络放置在云服务器上的问题的启发。然而，这些方法通常假设设备群集是固定的，在移动或边缘计算环境中，异构设备进入和离开特定应用程序的范围是不确定的。我们提出了一种名为GiPH的新学习方法，它通过1）一种称为gpNet的新型图表征，有效地编码选择良好放置所需的信息，以及2）可扩展的图神经网络（GNN）来学习gpNet信息的汇总，从而学习可以推广到动态设备群集的策略。GiPH将放置问题转化为图搜索问题，其中GNN预测可能放置的概率分布。我们的实验结果表明，GiPH在具有动态设备群集的三个数据集上优于现有基线，并且可以适应未见过的设备配置。",
    "tldr": "GiPH提出了一种新的学习方法，通过gpNet和GNN学习一个放置策略，可以推广到动态设备群集，并在动态设备集群下的三个数据集上表现出色。",
    "en_tdlr": "GiPH proposes a novel approach for learning a placement policy, utilizing gpNet and GNN, which can generalize to dynamic device clusters and outperforms existing baselines on three datasets."
}