{
    "title": "GPT Agents in Game Theory Experiments. (arXiv:2305.05516v1 [econ.GN])",
    "abstract": "This paper explores the potential of using Generative Pre-trained Transformer (GPT)-based agents as participants in strategic game experiments. Specifically, I focus on the finitely repeated ultimatum and prisoner's dilemma games, two well-studied games in economics. I develop prompts to enable GPT agents to understand the game rules and play the games. The results indicate that, given well-crafted prompts, GPT can generate realistic outcomes and exhibit behavior consistent with human behavior in certain important aspects, such as positive relationship between acceptance rates and offered amounts in the ultimatum game and positive cooperation rates in the prisoner's dilemma game. Some differences between the behavior of GPT and humans are observed in aspects like the evolution of choices over rounds. I also study two treatments in which the GPT agents are prompted to either have social preferences or not. The treatment effects are evident in both games. This preliminary exploration ind",
    "link": "http://arxiv.org/abs/2305.05516",
    "context": "Title: GPT Agents in Game Theory Experiments. (arXiv:2305.05516v1 [econ.GN])\nAbstract: This paper explores the potential of using Generative Pre-trained Transformer (GPT)-based agents as participants in strategic game experiments. Specifically, I focus on the finitely repeated ultimatum and prisoner's dilemma games, two well-studied games in economics. I develop prompts to enable GPT agents to understand the game rules and play the games. The results indicate that, given well-crafted prompts, GPT can generate realistic outcomes and exhibit behavior consistent with human behavior in certain important aspects, such as positive relationship between acceptance rates and offered amounts in the ultimatum game and positive cooperation rates in the prisoner's dilemma game. Some differences between the behavior of GPT and humans are observed in aspects like the evolution of choices over rounds. I also study two treatments in which the GPT agents are prompted to either have social preferences or not. The treatment effects are evident in both games. This preliminary exploration ind",
    "path": "papers/23/05/2305.05516.json",
    "total_tokens": 1027,
    "translated_title": "GPT Agent在博弈论实验中的应用",
    "translated_abstract": "本文探讨了使用基于生成预训练转换器（GPT）的代理作为战略游戏实验参与者的潜力。具体而言，作者关注了在经济学中广受研究的有限重复严肃和囚徒困境两个游戏。作者设计了提示，使GPT代理能够理解游戏规则并参与其中。结果表明，在经过精心设计的提示后，GPT可以生成逼真的结果，并在某些方面表现出与人类行为一致的行为，例如在严肃游戏中，接受率与提供金额之间的正相关关系以及在囚徒困境游戏中的合作率。在一些方面，例如在多轮选择的演化方面，GPT行为与人类会有所不同。作者还研究了两种处理方式，在这两种处理方式中通过提示，GPT代理可以具有或没有社会偏好。处理效果在两个游戏中都很明显。这项初步探索表明，基于GPT的代理在博弈论实验中具有潜在的应用，为研究者研究战略行为提供了一个新的工具。",
    "tldr": "本文探讨了使用GPT代理作为战略游戏实验参与者的潜力。GPT代理可以生成逼真的结果，并在某些方面表现出与人类行为一致的行为。处理效果在两个游戏中都很明显。这项初步探索表明，基于GPT的代理在博弈论实验中具有潜在的应用。",
    "en_tdlr": "This paper explores the potential of using GPT-based agents as participants in strategic game experiments. GPT agents can generate realistic results and exhibit behavior consistent with human behavior, with treatment effects evident in both games. This preliminary exploration indicates that GPT-based agents have the potential to be useful in game theory experiments."
}