{
    "title": "Data valuation: The partial ordinal Shapley value for machine learning. (arXiv:2305.01660v1 [cs.LG])",
    "abstract": "Data valuation using Shapley value has emerged as a prevalent research domain in machine learning applications. However, it is a challenge to address the role of order in data cooperation as most research lacks such discussion. To tackle this problem, this paper studies the definition of the partial ordinal Shapley value by group theory in abstract algebra. Besides, since the calculation of the partial ordinal Shapley value requires exponential time, this paper also gives three algorithms for approximating the results. The Truncated Monte Carlo algorithm is derived from the classic Shapley value approximation algorithm. The Classification Monte Carlo algorithm and the Classification Truncated Monte Carlo algorithm are based on the fact that the data points in the same class provide similar information, then we can accelerate the calculation by leaving out some data points in each class.",
    "link": "http://arxiv.org/abs/2305.01660",
    "context": "Title: Data valuation: The partial ordinal Shapley value for machine learning. (arXiv:2305.01660v1 [cs.LG])\nAbstract: Data valuation using Shapley value has emerged as a prevalent research domain in machine learning applications. However, it is a challenge to address the role of order in data cooperation as most research lacks such discussion. To tackle this problem, this paper studies the definition of the partial ordinal Shapley value by group theory in abstract algebra. Besides, since the calculation of the partial ordinal Shapley value requires exponential time, this paper also gives three algorithms for approximating the results. The Truncated Monte Carlo algorithm is derived from the classic Shapley value approximation algorithm. The Classification Monte Carlo algorithm and the Classification Truncated Monte Carlo algorithm are based on the fact that the data points in the same class provide similar information, then we can accelerate the calculation by leaving out some data points in each class.",
    "path": "papers/23/05/2305.01660.json",
    "total_tokens": 776,
    "translated_title": "数据估值：机器学习中的偏序 Shapley 值",
    "translated_abstract": "在机器学习应用中，使用 Shapley 值进行数据估值已经成为一个流行的研究领域。然而，由于大多数研究缺乏关于数据合作中顺序作用的讨论，因此解决数据顺序的作用是一个挑战。为了解决这个问题，本文通过群论中的抽象代数研究了偏序 Shapley 值的定义。此外，由于偏序 Shapley 值的计算需要指数级别的时间，本文还提出了三个算法来近似计算结果，分别为截断蒙特卡洛算法、分类蒙特卡洛算法和分类截断蒙特卡洛算法。这三个算法的实现不同，但都可以通过一定程度的近似来加快计算速度。",
    "tldr": "本文提出了偏序 Shapley 值的定义，并提出三种算法来近似计算结果，以解决数据合作中顺序作用的问题。",
    "en_tdlr": "This paper proposes the definition of the partial ordinal Shapley value and gives three algorithms for approximating the results, addressing the problem of order in data cooperation."
}