{
    "title": "Description and Discussion on DCASE 2023 Challenge Task 2: First-Shot Unsupervised Anomalous Sound Detection for Machine Condition Monitoring. (arXiv:2305.07828v1 [cs.SD])",
    "abstract": "We present the task description of the Detection and Classification of Acoustic Scenes and Events (DCASE) 2023 Challenge Task 2: \"First-shot unsupervised anomalous sound detection (ASD) for machine condition monitoring\". The main goal is to enable rapid deployment of ASD systems for new kinds of machines using only a few normal samples, without the need for hyperparameter tuning. In the past ASD tasks, developed methods tuned hyperparameters for each machine type, as the development and evaluation datasets had the same machine types. However, collecting normal and anomalous data as the development dataset can be infeasible in practice. In 2023 Task 2, we focus on solving first-shot problem, which is the challenge of training a model on a few machines of a completely novel machine type. Specifically, (i) each machine type has only one section, and (ii) machine types in the development and evaluation datasets are completely different. We will add challenge results and analysis of the sub",
    "link": "http://arxiv.org/abs/2305.07828",
    "context": "Title: Description and Discussion on DCASE 2023 Challenge Task 2: First-Shot Unsupervised Anomalous Sound Detection for Machine Condition Monitoring. (arXiv:2305.07828v1 [cs.SD])\nAbstract: We present the task description of the Detection and Classification of Acoustic Scenes and Events (DCASE) 2023 Challenge Task 2: \"First-shot unsupervised anomalous sound detection (ASD) for machine condition monitoring\". The main goal is to enable rapid deployment of ASD systems for new kinds of machines using only a few normal samples, without the need for hyperparameter tuning. In the past ASD tasks, developed methods tuned hyperparameters for each machine type, as the development and evaluation datasets had the same machine types. However, collecting normal and anomalous data as the development dataset can be infeasible in practice. In 2023 Task 2, we focus on solving first-shot problem, which is the challenge of training a model on a few machines of a completely novel machine type. Specifically, (i) each machine type has only one section, and (ii) machine types in the development and evaluation datasets are completely different. We will add challenge results and analysis of the sub",
    "path": "papers/23/05/2305.07828.json",
    "total_tokens": 924,
    "translated_title": "DCASE 2023 挑战任务2：面向机器状态监测的首次无监督异常声音检测的描述与讨论(arXiv:2305.07828v1 [cs.SD])",
    "translated_abstract": "本文介绍了Detection and Classification of Acoustic Scenes and Events (DCASE) 2023 挑战任务 2:“面向机器状态监测的首次无监督异常声音检测”。该任务的主要目标是仅使用少数正常样本就能快速部署针对新型机器的 ASD 系统，无需超参数调整。在过去的 ASD 任务中，发展的方法为每种机器类型调整超参数，因为发展和评估数据集具有相同的机器类型。然而，在实践中收集正常和异常数据集可能是不可行的。在 2023 Task 2 中，我们专注于解决首次问题，即在完全新型的机器类型的少数机器上训练模型的挑战。具体来说，（i）每种机器类型仅有一个部分，（ii）发展和评估数据集中的机器类型完全不同。我们将添加子任务的挑战结果和分析。",
    "tldr": "DCASE 2023 挑战任务2旨在解决机器状态监测中，部署新型机器的无监督异常声音检测，仅使用极少量的正常数据进行训练，且无需超参数调整。",
    "en_tdlr": "DCASE 2023 Challenge Task 2 aims to address the first-shot unsupervised anomalous sound detection for machine condition monitoring, allowing for rapid deployment of ASD systems for new machine types with minimal normal samples and no hyperparameter tuning."
}