{
    "title": "Ethical ChatGPT: Concerns, Challenges, and Commandments. (arXiv:2305.10646v1 [cs.AI])",
    "abstract": "Large language models, e.g. ChatGPT are currently contributing enormously to make artificial intelligence even more popular, especially among the general population. However, such chatbot models were developed as tools to support natural language communication between humans. Problematically, it is very much a ``statistical correlation machine\" (correlation instead of causality) and there are indeed ethical concerns associated with the use of AI language models such as ChatGPT, such as Bias, Privacy, and Abuse. This paper highlights specific ethical concerns on ChatGPT and articulates key challenges when ChatGPT is used in various applications. Practical commandments for different stakeholders of ChatGPT are also proposed that can serve as checklist guidelines for those applying ChatGPT in their applications. These commandment examples are expected to motivate the ethical use of ChatGPT.",
    "link": "http://arxiv.org/abs/2305.10646",
    "context": "Title: Ethical ChatGPT: Concerns, Challenges, and Commandments. (arXiv:2305.10646v1 [cs.AI])\nAbstract: Large language models, e.g. ChatGPT are currently contributing enormously to make artificial intelligence even more popular, especially among the general population. However, such chatbot models were developed as tools to support natural language communication between humans. Problematically, it is very much a ``statistical correlation machine\" (correlation instead of causality) and there are indeed ethical concerns associated with the use of AI language models such as ChatGPT, such as Bias, Privacy, and Abuse. This paper highlights specific ethical concerns on ChatGPT and articulates key challenges when ChatGPT is used in various applications. Practical commandments for different stakeholders of ChatGPT are also proposed that can serve as checklist guidelines for those applying ChatGPT in their applications. These commandment examples are expected to motivate the ethical use of ChatGPT.",
    "path": "papers/23/05/2305.10646.json",
    "total_tokens": 788,
    "translated_title": "ChatGPT的伦理关注、挑战和诫命",
    "translated_abstract": "当前，例如ChatGPT这样的大型语言模型正在极大地促进人工智能的普及，特别是在普通民众中。然而，这种聊天机器人模型的开发是为了支持人类之间的自然语言沟通。问题是，它很大程度上是一个“统计相关性机器”（相关性而非因果关系），对于使用AI语言模型（如ChatGPT）存在伦理关注事项，如偏见、隐私和滥用。本文重点概括了ChatGPT的具体伦理关注点，并针对ChatGPT在不同应用中的使用提出了关键挑战。此外，还提出了不同ChatGPT相关方的实用诫命，可以作为检查清单指南，促使ChatGPT的伦理使用。",
    "tldr": "本文针对ChatGPT提出了具体伦理关注点，对其在不同应用中的使用提出了关键挑战，并提出了不同ChatGPT相关方的实用诫命，以促进其伦理使用。",
    "en_tdlr": "This paper highlights ethical concerns and key challenges associated with the use of ChatGPT in various applications, and proposes practical commandments for different stakeholders to promote its ethical use."
}