{
    "title": "Transferring Visual Attributes from Natural Language to Verified Image Generation. (arXiv:2305.15026v2 [cs.CV] UPDATED)",
    "abstract": "Text to image generation methods (T2I) are widely popular in generating art and other creative artifacts. While visual hallucinations can be a positive factor in scenarios where creativity is appreciated, such artifacts are poorly suited for cases where the generated image needs to be grounded in complex natural language without explicit visual elements. In this paper, we propose to strengthen the consistency property of T2I methods in the presence of natural complex language, which often breaks the limits of T2I methods by including non-visual information, and textual elements that require knowledge for accurate generation. To address these phenomena, we propose a Natural Language to Verified Image generation approach (NL2VI) that converts a natural prompt into a visual prompt, which is more suitable for image generation. A T2I model then generates an image for the visual prompt, which is then verified with VQA algorithms. Experimentally, aligning natural prompts with image generation",
    "link": "http://arxiv.org/abs/2305.15026",
    "context": "Title: Transferring Visual Attributes from Natural Language to Verified Image Generation. (arXiv:2305.15026v2 [cs.CV] UPDATED)\nAbstract: Text to image generation methods (T2I) are widely popular in generating art and other creative artifacts. While visual hallucinations can be a positive factor in scenarios where creativity is appreciated, such artifacts are poorly suited for cases where the generated image needs to be grounded in complex natural language without explicit visual elements. In this paper, we propose to strengthen the consistency property of T2I methods in the presence of natural complex language, which often breaks the limits of T2I methods by including non-visual information, and textual elements that require knowledge for accurate generation. To address these phenomena, we propose a Natural Language to Verified Image generation approach (NL2VI) that converts a natural prompt into a visual prompt, which is more suitable for image generation. A T2I model then generates an image for the visual prompt, which is then verified with VQA algorithms. Experimentally, aligning natural prompts with image generation",
    "path": "papers/23/05/2305.15026.json",
    "total_tokens": 925,
    "translated_title": "从自然语言到可验证的图像生成：传递视觉属性",
    "translated_abstract": "文本到图像生成方法(T2I)在生成艺术和其他创造性产品方面得到广泛应用。视觉幻觉可能是创造力受到认可的情况下的积极因素，但这些产品不适用于需要将生成的图像与复杂自然语言相关联的情况，这些语言中包括非视觉信息以及需要准确生成的文本元素。本文针对这些现象，提出了一种自然语言到验证图像生成(NL2VI)方法，将自然提示转换为更适合图像生成的视觉提示。然后，T2I模型基于视觉提示生成图像，再使用VQA算法进行验证。实验结果表明，将自然提示与NL2VI中的图像生成方法对齐，可以显著改善生成图像在自然语言中的基础，并在图像质量和字幕评估指标上优于现有方法。",
    "tldr": "本文提出了一种自然语言到验证图像生成(NL2VI)方法，将自然提示转化为更适合的视觉提示，通过VQA算法进行验证，使生成的图像更加准确和与自然语言相关联，并在实验中证明了该方法的优越性。",
    "en_tdlr": "This paper proposes a Natural Language to Verified Image generation approach (NL2VI) that improves the grounding of generated images in natural language by converting a natural prompt into a visual prompt, generating an image with a T2I model, and verifying it with VQA algorithms. The experiments show the superiority of this method in generating images that are more accurate and relevant to natural language."
}