{
    "title": "Refining the Responses of LLMs by Themselves. (arXiv:2305.04039v1 [cs.CL])",
    "abstract": "In this paper, we propose a simple yet efficient approach based on prompt engineering that leverages the large language model itself to optimize its answers without relying on auxiliary models. We introduce an iterative self-evaluating optimization mechanism, with the potential for improved output quality as iterations progress, removing the need for manual intervention. The experiment's findings indicate that utilizing our response refinement framework on the GPT-3.5 model yields results that are on par with, or even surpass, those generated by the cutting-edge GPT-4 model. Detailed implementation strategies and illustrative examples are provided to demonstrate the superiority of our proposed solution.",
    "link": "http://arxiv.org/abs/2305.04039",
    "context": "Title: Refining the Responses of LLMs by Themselves. (arXiv:2305.04039v1 [cs.CL])\nAbstract: In this paper, we propose a simple yet efficient approach based on prompt engineering that leverages the large language model itself to optimize its answers without relying on auxiliary models. We introduce an iterative self-evaluating optimization mechanism, with the potential for improved output quality as iterations progress, removing the need for manual intervention. The experiment's findings indicate that utilizing our response refinement framework on the GPT-3.5 model yields results that are on par with, or even surpass, those generated by the cutting-edge GPT-4 model. Detailed implementation strategies and illustrative examples are provided to demonstrate the superiority of our proposed solution.",
    "path": "papers/23/05/2305.04039.json",
    "total_tokens": 736,
    "translated_title": "通过自我优化来提升LLMs的响应质量",
    "translated_abstract": "本文提出了一种基于提示工程的简单而高效的方法，利用大型语言模型本身来优化其答案，而不依赖于辅助模型。我们引入了一种迭代的自我评估优化机制，随着迭代的推进，具有改善输出质量的潜力，无需手动干预。实验结果表明，在GPT-3.5模型上使用我们的响应优化框架产生的结果与甚至超过先进的GPT-4模型生成的结果。提供了详细的实施策略和说明性示例，以证明我们提出的解决方案的优越性。",
    "tldr": "本文提出了一种利用自我优化机制来改善大型语言模型响应质量的方法，实验证明在GPT-3.5模型上使用此方法，生成的结果质量可以与甚至超过GPT-4模型。",
    "en_tdlr": "This paper proposes an approach that utilizes a self-evaluating optimization mechanism to improve the response quality of large language models, and experiments show that using this approach on the GPT-3.5 model can yield results that are on par with or even surpass those of the cutting-edge GPT-4 model."
}