{
    "title": "Differentially Private Online Item Pricing. (arXiv:2305.11362v1 [cs.GT])",
    "abstract": "This work addresses the problem of revenue maximization in a repeated, unlimited supply item-pricing auction while preserving buyer privacy. We present a novel algorithm that provides differential privacy with respect to the buyer's input pair: item selection and bid. Notably, our algorithm is the first to offer a sublinear $O(\\sqrt{T}\\log{T})$ regret with a privacy guarantee. Our method is based on an exponential weights meta-algorithm, and we mitigate the issue of discontinuities in revenue functions via small random perturbations. As a result of its structural similarity to the exponential mechanism, our method inherently secures differential privacy. We also extend our algorithm to accommodate scenarios where buyers strategically bid over successive rounds. The inherent differential privacy allows us to adapt our algorithm with minimal modification to ensure a sublinear regret in this setting.",
    "link": "http://arxiv.org/abs/2305.11362",
    "context": "Title: Differentially Private Online Item Pricing. (arXiv:2305.11362v1 [cs.GT])\nAbstract: This work addresses the problem of revenue maximization in a repeated, unlimited supply item-pricing auction while preserving buyer privacy. We present a novel algorithm that provides differential privacy with respect to the buyer's input pair: item selection and bid. Notably, our algorithm is the first to offer a sublinear $O(\\sqrt{T}\\log{T})$ regret with a privacy guarantee. Our method is based on an exponential weights meta-algorithm, and we mitigate the issue of discontinuities in revenue functions via small random perturbations. As a result of its structural similarity to the exponential mechanism, our method inherently secures differential privacy. We also extend our algorithm to accommodate scenarios where buyers strategically bid over successive rounds. The inherent differential privacy allows us to adapt our algorithm with minimal modification to ensure a sublinear regret in this setting.",
    "path": "papers/23/05/2305.11362.json",
    "total_tokens": 866,
    "translated_title": "差分隐私在线物品定价",
    "translated_abstract": "本文探讨了在保护买方隐私的同时，实现重复、不限供应物品拍卖中的收益最大化问题。我们提出了一种新颖的算法，它与买方的输入对（商品选择和出价）具有差分隐私性质。值得注意的是，我们的算法是第一个提供隐私保证的$O(\\sqrt{T}\\log{T})$亏损子线性(regret)的方法。我们的方法基于指数权重元算法，通过小的随机扰动缓解了收益函数不连续的问题。由于与指数机制的结构相似，因此我们的方法固有地保证了差分隐私。我们还将我们的算法扩展到逐轮策略性出价的情况。内在的差分隐私性质使我们能够在最小修改的情况下适应这种情况，并确保其亏损子线性。",
    "tldr": "本文介绍了一种差分隐私算法，可在保护买家隐私的同时实现重复、不限供应物品拍卖中的收益最大化，是第一个提供隐私保证的$O(\\sqrt{T}\\log{T})$亏损子线性的方法。",
    "en_tdlr": "This paper presents a differentially private algorithm for revenue maximization in a repeated, unlimited supply item-pricing auction while preserving buyer privacy. It is the first algorithm to offer a sublinear $O(\\sqrt{T}\\log{T})$ regret with a privacy guarantee and can be extended to accommodate scenarios where buyers strategically bid over successive rounds with minimal modification."
}