{
    "title": "A Pilot Study on Dialogue-Level Dependency Parsing for Chinese. (arXiv:2305.12441v2 [cs.CL] UPDATED)",
    "abstract": "Dialogue-level dependency parsing has received insufficient attention, especially for Chinese. To this end, we draw on ideas from syntactic dependency and rhetorical structure theory (RST), developing a high-quality human-annotated corpus, which contains 850 dialogues and 199,803 dependencies. Considering that such tasks suffer from high annotation costs, we investigate zero-shot and few-shot scenarios. Based on an existing syntactic treebank, we adopt a signal-based method to transform seen syntactic dependencies into unseen ones between elementary discourse units (EDUs), where the signals are detected by masked language modeling. Besides, we apply single-view and multi-view data selection to access reliable pseudo-labeled instances. Experimental results show the effectiveness of these baselines. Moreover, we discuss several crucial points about our dataset and approach.",
    "link": "http://arxiv.org/abs/2305.12441",
    "context": "Title: A Pilot Study on Dialogue-Level Dependency Parsing for Chinese. (arXiv:2305.12441v2 [cs.CL] UPDATED)\nAbstract: Dialogue-level dependency parsing has received insufficient attention, especially for Chinese. To this end, we draw on ideas from syntactic dependency and rhetorical structure theory (RST), developing a high-quality human-annotated corpus, which contains 850 dialogues and 199,803 dependencies. Considering that such tasks suffer from high annotation costs, we investigate zero-shot and few-shot scenarios. Based on an existing syntactic treebank, we adopt a signal-based method to transform seen syntactic dependencies into unseen ones between elementary discourse units (EDUs), where the signals are detected by masked language modeling. Besides, we apply single-view and multi-view data selection to access reliable pseudo-labeled instances. Experimental results show the effectiveness of these baselines. Moreover, we discuss several crucial points about our dataset and approach.",
    "path": "papers/23/05/2305.12441.json",
    "total_tokens": 936,
    "translated_title": "中文对话级依存句法分析的初步研究。",
    "translated_abstract": "对话级依存句法分析尤其是中文方面的研究还不足。因此我们借鉴了句法依存理论和修辞结构理论（RST），构建并开发了一个高质量的人工标注语料库，包含850个对话和199,803个依存关系。鉴于此类任务的高昂标注成本，我们研究了零样本和小样本情况。基于现有的句法树库，我们采用了一种基于信号的方法将见到的句法依存转换成元素话语单位之间的未见依存，其中信号是通过掩码语言模型检测得到的。此外，我们应用了单视角和多视角的数据选择来访问可靠的伪标记实例。实验结果表明这些基线的有效性。此外，我们还讨论了有关数据集和方法的几个关键要点。",
    "tldr": "该论文研究了中文对话级依存句法分析的初步工作，在新构建了的高质量人工标注语料库上，通过零样本和小样本的数据学习，采用了基于信号的将见到的句法依存转换成元素话语单位之间的未见依存的方法，通过单视角和多视角的数据选择来访问可靠的伪标记实例，取得良好的实验结果。",
    "en_tdlr": "This paper presents a preliminary study on dialogue-level dependency parsing for Chinese, introducing a high-quality human-annotated corpus and investigating zero-shot and few-shot scenarios. The paper adopted a signal-based method to transform seen syntactic dependencies into unseen ones between elementary discourse units (EDUs), where the signals are detected by masked language modeling and applied single-view and multi-view data selection to access reliable pseudo-labeled instances that showed effective results."
}