{
    "title": "Deep Neural Network Estimation in Panel Data Models. (arXiv:2305.19921v1 [econ.EM])",
    "abstract": "In this paper we study neural networks and their approximating power in panel data models. We provide asymptotic guarantees on deep feed-forward neural network estimation of the conditional mean, building on the work of Farrell et al. (2021), and explore latent patterns in the cross-section. We use the proposed estimators to forecast the progression of new COVID-19 cases across the G7 countries during the pandemic. We find significant forecasting gains over both linear panel and nonlinear time series models. Containment or lockdown policies, as instigated at the national-level by governments, are found to have out-of-sample predictive power for new COVID-19 cases. We illustrate how the use of partial derivatives can help open the \"black-box\" of neural networks and facilitate semi-structural analysis: school and workplace closures are found to have been effective policies at restricting the progression of the pandemic across the G7 countries. But our methods illustrate significant heter",
    "link": "http://arxiv.org/abs/2305.19921",
    "context": "Title: Deep Neural Network Estimation in Panel Data Models. (arXiv:2305.19921v1 [econ.EM])\nAbstract: In this paper we study neural networks and their approximating power in panel data models. We provide asymptotic guarantees on deep feed-forward neural network estimation of the conditional mean, building on the work of Farrell et al. (2021), and explore latent patterns in the cross-section. We use the proposed estimators to forecast the progression of new COVID-19 cases across the G7 countries during the pandemic. We find significant forecasting gains over both linear panel and nonlinear time series models. Containment or lockdown policies, as instigated at the national-level by governments, are found to have out-of-sample predictive power for new COVID-19 cases. We illustrate how the use of partial derivatives can help open the \"black-box\" of neural networks and facilitate semi-structural analysis: school and workplace closures are found to have been effective policies at restricting the progression of the pandemic across the G7 countries. But our methods illustrate significant heter",
    "path": "papers/23/05/2305.19921.json",
    "total_tokens": 931,
    "translated_title": "面板数据模型中的深度神经网络估计",
    "translated_abstract": "本文研究了神经网络及其在面板数据模型中的近似能力。我们基于Farrell等人(2021)的工作，对条件均值的深层前馈神经网络估计提供了渐近保证，并探讨了截面中的潜在模式。我们使用所提出的估计方法预测了G7国家在疫情期间新冠肺炎病例的进展情况，并发现相对于线性面板和非线性时间序列模型，具有显著的预测效果。我们发现，由政府在国家级别上实施的封锁或限制政策在新冠肺炎病例的外部样本预测中具有预测能力。我们还阐述了如何使用偏导数来帮助打开神经网络的“黑盒子”，并促进半结构分析：我们发现，关闭学校和工作场所是限制疫情在G7国家蔓延的有效政策。",
    "tldr": "本文研究面板数据模型中的深度神经网络估计，并使用该方法预测了G7国家新冠肺炎病例的进展情况。通过打开神经网络的“黑盒子”，发现了关闭学校和工作场所是限制疫情蔓延的有效政策。",
    "en_tdlr": "This paper studies deep neural network estimation in panel data models, and uses the method to forecast the progression of new COVID-19 cases across the G7 countries. By opening the \"black-box\" of neural networks, it is found that closing schools and workplaces is an effective policy to restrict the spread of the pandemic."
}