{
    "title": "NeuSTIP: A Novel Neuro-Symbolic Model for Link and Time Prediction in Temporal Knowledge Graphs. (arXiv:2305.11301v1 [cs.AI])",
    "abstract": "While Knowledge Graph Completion (KGC) on static facts is a matured field, Temporal Knowledge Graph Completion (TKGC), that incorporates validity time into static facts is still in its nascent stage. The KGC methods fall into multiple categories including embedding-based, rule-based, GNN-based, pretrained Language Model based approaches. However, such dimensions have not been explored in TKG. To that end, we propose a novel temporal neuro-symbolic model, NeuSTIP, that performs link prediction and time interval prediction in a TKG. NeuSTIP learns temporal rules in the presence of the Allen predicates that ensure the temporal consistency between neighboring predicates in a given rule. We further design a unique scoring function that evaluates the confidence of the candidate answers while performing link prediction and time interval prediction by utilizing the learned rules. Our empirical evaluation on two time interval based TKGC datasets suggests that our model outperforms state-of-the-",
    "link": "http://arxiv.org/abs/2305.11301",
    "context": "Title: NeuSTIP: A Novel Neuro-Symbolic Model for Link and Time Prediction in Temporal Knowledge Graphs. (arXiv:2305.11301v1 [cs.AI])\nAbstract: While Knowledge Graph Completion (KGC) on static facts is a matured field, Temporal Knowledge Graph Completion (TKGC), that incorporates validity time into static facts is still in its nascent stage. The KGC methods fall into multiple categories including embedding-based, rule-based, GNN-based, pretrained Language Model based approaches. However, such dimensions have not been explored in TKG. To that end, we propose a novel temporal neuro-symbolic model, NeuSTIP, that performs link prediction and time interval prediction in a TKG. NeuSTIP learns temporal rules in the presence of the Allen predicates that ensure the temporal consistency between neighboring predicates in a given rule. We further design a unique scoring function that evaluates the confidence of the candidate answers while performing link prediction and time interval prediction by utilizing the learned rules. Our empirical evaluation on two time interval based TKGC datasets suggests that our model outperforms state-of-the-",
    "path": "papers/23/05/2305.11301.json",
    "total_tokens": 924,
    "translated_title": "NeuSTIP: 一种用于时间知识图谱中链接和时间预测的新型神经符号模型",
    "translated_abstract": "尽管在静态事实上的知识图完成已经是一个成熟的领域，但是在将有效时间纳入静态事实中的时间知识图谱完成（TKGC）仍处于初级阶段。知识图完成方法有多种类别，包括基于嵌入、基于规则、基于图神经网络和基于预训练语言模型等方法。然而，在TKGC中尚未探索这些方面。因此，我们提出了一种新颖的时间神经符号模型NeuSTIP，它可以在TKG中进行链接预测和时间间隔预测。NeuSTIP在Allan谓词的存在下学习时间规则，以确保给定规则中相邻谓词之间的时间一致性。我们进一步设计了一个独特的评分函数，通过利用学习规则来评估候选答案的置信度，从而执行链接预测和时间间隔预测。我们在两个基于时间间隔的TKGC数据集上进行实证评估，结果表明我们的模型在各种评估指标上优于现有的方法。",
    "tldr": "NeuSTIP是一种新型神经符号模型，能够在时间知识图谱中进行链接和时间预测，且在两个TKGC数据集上优于现有方法。",
    "en_tdlr": "NeuSTIP is a novel neuro-symbolic model for conducting link and time prediction in temporal knowledge graphs. By utilizing Allen predicates and a unique scoring function, NeuSTIP outperforms existing methods on two TKGC datasets."
}