{
    "title": "Machine Learning Recommendation System For Health Insurance Decision Making In Nigeria. (arXiv:2305.10708v1 [cs.AI])",
    "abstract": "The uptake of health insurance has been poor in Nigeria, a significant step to improving this includes improved awareness, access to information and tools to support decision making. Artificial intelligence (AI) based recommender systems have gained popularity in helping individuals find movies, books, music, and different types of products on the internet including diverse applications in healthcare. The content-based methodology (item-based approach) was employed in the recommender system. We applied both the K-Nearest Neighbor (KNN) and Cosine similarity algorithm. We chose the Cosine similarity as our chosen algorithm after several evaluations based of their outcomes in comparison with domain knowledge. The recommender system takes into consideration the choices entered by the user, filters the health management organization (HMO) data by location and chosen prices. It then recommends the top 3 HMOs with closest similarity in services offered. A recommendation tool to help people f",
    "link": "http://arxiv.org/abs/2305.10708",
    "context": "Title: Machine Learning Recommendation System For Health Insurance Decision Making In Nigeria. (arXiv:2305.10708v1 [cs.AI])\nAbstract: The uptake of health insurance has been poor in Nigeria, a significant step to improving this includes improved awareness, access to information and tools to support decision making. Artificial intelligence (AI) based recommender systems have gained popularity in helping individuals find movies, books, music, and different types of products on the internet including diverse applications in healthcare. The content-based methodology (item-based approach) was employed in the recommender system. We applied both the K-Nearest Neighbor (KNN) and Cosine similarity algorithm. We chose the Cosine similarity as our chosen algorithm after several evaluations based of their outcomes in comparison with domain knowledge. The recommender system takes into consideration the choices entered by the user, filters the health management organization (HMO) data by location and chosen prices. It then recommends the top 3 HMOs with closest similarity in services offered. A recommendation tool to help people f",
    "path": "papers/23/05/2305.10708.json",
    "total_tokens": 966,
    "translated_title": "基于机器学习的医疗保险决策推荐系统在尼日利亚的应用",
    "translated_abstract": "在尼日利亚，健康保险的普及率很低，提高其普及度的重要步骤包括提高意识、获取信息和支持决策的工具。基于人工智能的推荐系统已在帮助个人在互联网上找到电影、书籍、音乐和不同类型的产品方面获得了广泛的应用，其中包括医疗保健。本文采用基于内容的方法（基于项目的方法）来构建推荐系统。我们应用了K最近邻（KNN）和余弦相似度算法，经过多次评估和与领域知识的比较，我们选择余弦相似度作为我们的推荐算法。该推荐系统考虑了用户输入的选择，通过地点和价格来筛选医疗管理组织（HMO）的数据，然后推荐相似服务的前三个HMO。本文提出的推荐工具可帮助人们方便地找到和选择最适合他们的健康保险计划。",
    "tldr": "本论文提出了一个基于机器学习的“医疗保险推荐系统”，采用基于内容的方法，通过地点和价格筛选医疗管理组织（HMO）的数据，并推荐相似服务的前三个HMO，旨在帮助尼日利亚人方便地找到最适合他们的健康保险计划。"
}