{
    "title": "Segment Anything Model (SAM) Meets Glass: Mirror and Transparent Objects Cannot Be Easily Detected. (arXiv:2305.00278v1 [cs.CV])",
    "abstract": "Meta AI Research has recently released SAM (Segment Anything Model) which is trained on a large segmentation dataset of over 1 billion masks. As a foundation model in the field of computer vision, SAM (Segment Anything Model) has gained attention for its impressive performance in generic object segmentation. Despite its strong capability in a wide range of zero-shot transfer tasks, it remains unknown whether SAM can detect things in challenging setups like transparent objects. In this work, we perform an empirical evaluation of two glass-related challenging scenarios: mirror and transparent objects. We found that SAM often fails to detect the glass in both scenarios, which raises concern for deploying the SAM in safety-critical situations that have various forms of glass.",
    "link": "http://arxiv.org/abs/2305.00278",
    "context": "Title: Segment Anything Model (SAM) Meets Glass: Mirror and Transparent Objects Cannot Be Easily Detected. (arXiv:2305.00278v1 [cs.CV])\nAbstract: Meta AI Research has recently released SAM (Segment Anything Model) which is trained on a large segmentation dataset of over 1 billion masks. As a foundation model in the field of computer vision, SAM (Segment Anything Model) has gained attention for its impressive performance in generic object segmentation. Despite its strong capability in a wide range of zero-shot transfer tasks, it remains unknown whether SAM can detect things in challenging setups like transparent objects. In this work, we perform an empirical evaluation of two glass-related challenging scenarios: mirror and transparent objects. We found that SAM often fails to detect the glass in both scenarios, which raises concern for deploying the SAM in safety-critical situations that have various forms of glass.",
    "path": "papers/23/05/2305.00278.json",
    "total_tokens": 856,
    "translated_title": "段落任意模型（SAM）遇到玻璃：镜面和透明物体不能被轻松检测",
    "translated_abstract": "Meta AI研究最近发布了SAM（Segment Anything Model），它是在超过10亿个掩模的大量分割数据集上训练的。作为计算机视觉领域的基础模型，SAM在通用物体分割方面的出色性能引起了人们的关注。尽管它在各种零-shot迁移任务中具有强大的能力，但它是否能够在具有挑战性的设置中检测到透明物体仍然未知。在这项工作中，我们对两种与玻璃相关的具有挑战性的情况进行了实证评估：镜面和透明物体。我们发现SAM经常无法检测到两种情况下的玻璃，这引起了在具有各种形式的玻璃的安全关键情况下部署SAM的关注。",
    "tldr": "这项工作对段落任意模型（SAM）的能力在玻璃相关的情况下进行了实证评估，发现SAM在镜面和透明物体中往往无法检测玻璃，这引起了在具有各种形式的玻璃的安全关键情况下部署SAM的关注。",
    "en_tdlr": "This work empirically evaluates the ability of the Segment Anything Model (SAM) in glass-related scenarios and finds that SAM often fails to detect glass in mirror and transparent objects, raising concerns for deploying SAM in safety-critical situations with various forms of glass."
}