{
    "title": "AMPERE: AMR-Aware Prefix for Generation-Based Event Argument Extraction Model. (arXiv:2305.16734v1 [cs.CL])",
    "abstract": "Event argument extraction (EAE) identifies event arguments and their specific roles for a given event. Recent advancement in generation-based EAE models has shown great performance and generalizability over classification-based models. However, existing generation-based EAE models mostly focus on problem re-formulation and prompt design, without incorporating additional information that has been shown to be effective for classification-based models, such as the abstract meaning representation (AMR) of the input passages. Incorporating such information into generation-based models is challenging due to the heterogeneous nature of the natural language form prevalently used in generation-based models and the structured form of AMRs. In this work, we study strategies to incorporate AMR into generation-based EAE models. We propose AMPERE, which generates AMR-aware prefixes for every layer of the generation model. Thus, the prefix introduces AMR information to the generation-based EAE model ",
    "link": "http://arxiv.org/abs/2305.16734",
    "context": "Title: AMPERE: AMR-Aware Prefix for Generation-Based Event Argument Extraction Model. (arXiv:2305.16734v1 [cs.CL])\nAbstract: Event argument extraction (EAE) identifies event arguments and their specific roles for a given event. Recent advancement in generation-based EAE models has shown great performance and generalizability over classification-based models. However, existing generation-based EAE models mostly focus on problem re-formulation and prompt design, without incorporating additional information that has been shown to be effective for classification-based models, such as the abstract meaning representation (AMR) of the input passages. Incorporating such information into generation-based models is challenging due to the heterogeneous nature of the natural language form prevalently used in generation-based models and the structured form of AMRs. In this work, we study strategies to incorporate AMR into generation-based EAE models. We propose AMPERE, which generates AMR-aware prefixes for every layer of the generation model. Thus, the prefix introduces AMR information to the generation-based EAE model ",
    "path": "papers/23/05/2305.16734.json",
    "total_tokens": 826,
    "translated_title": "AMPERE: 面向AMR的前缀生成事件论元抽取模型",
    "translated_abstract": "事件论元抽取旨在识别某事件的论元及其特定的角色。生成式的事件论元抽取模型相比于分类式模型表现出更好的性能和泛化能力。但是，目前的生成式模型主要关注问题重新表述和提示设计，没有整合其他在分类式模型中已被证明有效的信息（如输入段落的抽象意义表示AMR）。由于生成式模型中通常使用自然语言形式，而AMR是一种结构化形式，因此将这样的信息整合到生成式模型中具有挑战性。本文研究了将AMR整合到生成式事件论元抽取模型中的策略。我们提出了AMPERE，为生成模型的每层生成AMR感知前缀。因此，该前缀为生成式的事件论元抽取模型引入了AMR信息。",
    "tldr": "本论文提出了一种名为AMPERE的方法，面向AMR的前缀生成事件论元抽取模型，该模型成功引入了AMR的信息，提升了生成式模型的性能和泛化能力。"
}