{
    "title": "Zero-Shot Automatic Pronunciation Assessment. (arXiv:2305.19563v1 [cs.SD])",
    "abstract": "Automatic Pronunciation Assessment (APA) is vital for computer-assisted language learning. Prior methods rely on annotated speech-text data to train Automatic Speech Recognition (ASR) models or speech-score data to train regression models. In this work, we propose a novel zero-shot APA method based on the pre-trained acoustic model, HuBERT. Our method involves encoding speech input and corrupting them via a masking module. We then employ the Transformer encoder and apply k-means clustering to obtain token sequences. Finally, a scoring module is designed to measure the number of wrongly recovered tokens. Experimental results on speechocean762 demonstrate that the proposed method achieves comparable performance to supervised regression baselines and outperforms non-regression baselines in terms of Pearson Correlation Coefficient (PCC). Additionally, we analyze how masking strategies affect the performance of APA.",
    "link": "http://arxiv.org/abs/2305.19563",
    "context": "Title: Zero-Shot Automatic Pronunciation Assessment. (arXiv:2305.19563v1 [cs.SD])\nAbstract: Automatic Pronunciation Assessment (APA) is vital for computer-assisted language learning. Prior methods rely on annotated speech-text data to train Automatic Speech Recognition (ASR) models or speech-score data to train regression models. In this work, we propose a novel zero-shot APA method based on the pre-trained acoustic model, HuBERT. Our method involves encoding speech input and corrupting them via a masking module. We then employ the Transformer encoder and apply k-means clustering to obtain token sequences. Finally, a scoring module is designed to measure the number of wrongly recovered tokens. Experimental results on speechocean762 demonstrate that the proposed method achieves comparable performance to supervised regression baselines and outperforms non-regression baselines in terms of Pearson Correlation Coefficient (PCC). Additionally, we analyze how masking strategies affect the performance of APA.",
    "path": "papers/23/05/2305.19563.json",
    "total_tokens": 953,
    "translated_title": "无需标注数据的零样本自动发音评估",
    "translated_abstract": "自动发音评估对于计算机辅助语言学习至关重要。传统方法依赖于带注释的语音文本数据来训练自动语音识别模型或依赖于带分数的语音数据来训练回归模型。本文提出了一种基于预训练声学模型HuBERT的全新零样本自动发音评估方法。我们的方法涉及对语音输入进行编码并通过掩码模块进行破坏。然后使用Transformer编码器并应用k均值聚类以获得标记序列。最后，设计了评分模块来测量错误恢复标记的数量。在speechocean762上的实验结果表明，所提出的方法在皮尔逊相关系数（PCC）方面与监督回归基线方法具有可比性，并且在非回归基线方法方面表现更优。此外，我们还分析了掩码策略对自动发音评估性能的影响。",
    "tldr": "本文提出了一种基于预训练声学模型的零样本自动发音评估方法，该方法不需要标注数据，使用掩码模块破坏语音输入，应用k均值聚类获得标记序列并使用评分模块测量错误恢复标记的数量，在实验中取得了与监督回归基线相当的性能以及优于非回归基线的结果。",
    "en_tdlr": "This research proposes a zero-shot automatic pronunciation assessment method based on pre-trained acoustic model, requiring no annotated data, by encoding and corrupting speech input, employing k-means clustering to obtain token sequences, and measuring the number of wrongly recovered tokens with a scoring module. Experimental results demonstrate comparable performance to supervised regression baselines and outperformance of non-regression baselines in terms of PCC. The paper also analyzes the impact of masking strategies on APA performance."
}