{
    "title": "VEDLIoT -- Next generation accelerated AIoT systems and applications. (arXiv:2305.05388v1 [cs.AR])",
    "abstract": "The VEDLIoT project aims to develop energy-efficient Deep Learning methodologies for distributed Artificial Intelligence of Things (AIoT) applications. During our project, we propose a holistic approach that focuses on optimizing algorithms while addressing safety and security challenges inherent to AIoT systems. The foundation of this approach lies in a modular and scalable cognitive IoT hardware platform, which leverages microserver technology to enable users to configure the hardware to meet the requirements of a diverse array of applications. Heterogeneous computing is used to boost performance and energy efficiency. In addition, the full spectrum of hardware accelerators is integrated, providing specialized ASICs as well as FPGAs for reconfigurable computing. The project's contributions span across trusted computing, remote attestation, and secure execution environments, with the ultimate goal of facilitating the design and deployment of robust and efficient AIoT systems. The over",
    "link": "http://arxiv.org/abs/2305.05388",
    "context": "Title: VEDLIoT -- Next generation accelerated AIoT systems and applications. (arXiv:2305.05388v1 [cs.AR])\nAbstract: The VEDLIoT project aims to develop energy-efficient Deep Learning methodologies for distributed Artificial Intelligence of Things (AIoT) applications. During our project, we propose a holistic approach that focuses on optimizing algorithms while addressing safety and security challenges inherent to AIoT systems. The foundation of this approach lies in a modular and scalable cognitive IoT hardware platform, which leverages microserver technology to enable users to configure the hardware to meet the requirements of a diverse array of applications. Heterogeneous computing is used to boost performance and energy efficiency. In addition, the full spectrum of hardware accelerators is integrated, providing specialized ASICs as well as FPGAs for reconfigurable computing. The project's contributions span across trusted computing, remote attestation, and secure execution environments, with the ultimate goal of facilitating the design and deployment of robust and efficient AIoT systems. The over",
    "path": "papers/23/05/2305.05388.json",
    "total_tokens": 1174,
    "translated_title": "VEDLIoT--下一代加速AIoT系统和应用",
    "translated_abstract": "VEDLIoT项目旨在为分布式物联网（AIoT）应用程序开发节能深度学习方法。在我们的项目中，我们提出了一种全面的方法，重点是优化算法，同时解决AIoT系统固有的安全性和安全性挑战。这种方法的基础在于一种模块化和可扩展的认知物联网硬件平台，它利用微服务器技术使用户能够配置硬件以满足各种应用程序的要求。异构计算用于提高性能和能量效率。此外，集成了全谱硬件加速器，提供专用ASIC以及用于可重构计算的FPGA。该项目的贡献涵盖了可信计算，远程断言和安全执行环境的范围，旨在促进健壮而有效的AIoT系统的设计和部署。VEDLIoT的整体愿景是通过模块化和可扩展的认知物联网硬件平台，利用微服务器技术和异构计算以及集成了全谱硬件加速器为分布式物联网（AIoT）应用程序开发节能和安全的深度学习方法。该项目的核心贡献包括通过可信计算，远程断言和安全执行环境解决AIoT系统固有的安全挑战。",
    "tldr": "VEDLIoT项目旨在开发一种安全、节能和高效的深度学习方法，以解决分布式物联网（AIoT）应用程序的挑战。其核心方法在于模块化和可扩展的认知物联网硬件平台，利用微服务器技术和异构计算以及全谱硬件加速器的集成。项目的贡献涵盖了可信计算、远程断言和安全执行环境。",
    "en_tdlr": "VEDLIoT aims to develop a secure, energy-efficient and efficient deep learning approach to address challenges in distributed Artificial Intelligence of Things (AIoT) applications using a modular, scalable cognitive IoT hardware platform, utilizing microserver technology and heterogeneous computing with integrated full spectrum hardware accelerators. The project’s key contributions include addressing safety and security challenges inherent to AIoT systems through trusted computing, remote attestation, and secure execution environments."
}