{
    "title": "SECRETS: Subject-Efficient Clinical Randomized Controlled Trials using Synthetic Intervention. (arXiv:2305.05078v1 [eess.SP])",
    "abstract": "The randomized controlled trial (RCT) is the gold standard for estimating the average treatment effect (ATE) of a medical intervention but requires 100s-1000s of subjects, making it expensive and difficult to implement. While a cross-over trial can reduce sample size requirements by measuring the treatment effect per individual, it is only applicable to chronic conditions and interventions whose effects dissipate rapidly. Another approach is to replace or augment data collected from an RCT with external data from prospective studies or prior RCTs, but it is vulnerable to confounders in the external or augmented data. We propose to simulate the cross-over trial to overcome its practical limitations while exploiting its strengths. We propose a novel framework, SECRETS, which, for the first time, estimates the individual treatment effect (ITE) per patient in the RCT study without using any external data by leveraging a state-of-the-art counterfactual estimation algorithm, called synthetic",
    "link": "http://arxiv.org/abs/2305.05078",
    "context": "Title: SECRETS: Subject-Efficient Clinical Randomized Controlled Trials using Synthetic Intervention. (arXiv:2305.05078v1 [eess.SP])\nAbstract: The randomized controlled trial (RCT) is the gold standard for estimating the average treatment effect (ATE) of a medical intervention but requires 100s-1000s of subjects, making it expensive and difficult to implement. While a cross-over trial can reduce sample size requirements by measuring the treatment effect per individual, it is only applicable to chronic conditions and interventions whose effects dissipate rapidly. Another approach is to replace or augment data collected from an RCT with external data from prospective studies or prior RCTs, but it is vulnerable to confounders in the external or augmented data. We propose to simulate the cross-over trial to overcome its practical limitations while exploiting its strengths. We propose a novel framework, SECRETS, which, for the first time, estimates the individual treatment effect (ITE) per patient in the RCT study without using any external data by leveraging a state-of-the-art counterfactual estimation algorithm, called synthetic",
    "path": "papers/23/05/2305.05078.json",
    "total_tokens": 955,
    "tldr": "传统的随机对照试验成本高昂且样本量大，我们提出了一个称为SECRETS的框架，利用最先进的反事实估计算法来在不使用任何外部数据的情况下估计RCT研究中每个患者的个体治疗效应（ITE）。"
}