{
    "title": "IndicTrans2: Towards High-Quality and Accessible Machine Translation Models for all 22 Scheduled Indian Languages. (arXiv:2305.16307v2 [cs.CL] UPDATED)",
    "abstract": "India has a rich linguistic landscape with languages from 4 major language families spoken by over a billion people. 22 of these languages are listed in the Constitution of India (referred to as scheduled languages) are the focus of this work. Given the linguistic diversity, high-quality and accessible Machine Translation (MT) systems are essential in a country like India. Prior to this work, there was (i) no parallel training data spanning all the 22 languages, (ii) no robust benchmarks covering all these languages and containing content relevant to India, and (iii) no existing translation models which support all the 22 scheduled languages of India. In this work, we aim to address this gap by focusing on the missing pieces required for enabling wide, easy, and open access to good machine translation systems for all 22 scheduled Indian languages. We identify four key areas of improvement: curating and creating larger training datasets, creating diverse and high-quality benchmarks, tra",
    "link": "http://arxiv.org/abs/2305.16307",
    "context": "Title: IndicTrans2: Towards High-Quality and Accessible Machine Translation Models for all 22 Scheduled Indian Languages. (arXiv:2305.16307v2 [cs.CL] UPDATED)\nAbstract: India has a rich linguistic landscape with languages from 4 major language families spoken by over a billion people. 22 of these languages are listed in the Constitution of India (referred to as scheduled languages) are the focus of this work. Given the linguistic diversity, high-quality and accessible Machine Translation (MT) systems are essential in a country like India. Prior to this work, there was (i) no parallel training data spanning all the 22 languages, (ii) no robust benchmarks covering all these languages and containing content relevant to India, and (iii) no existing translation models which support all the 22 scheduled languages of India. In this work, we aim to address this gap by focusing on the missing pieces required for enabling wide, easy, and open access to good machine translation systems for all 22 scheduled Indian languages. We identify four key areas of improvement: curating and creating larger training datasets, creating diverse and high-quality benchmarks, tra",
    "path": "papers/23/05/2305.16307.json",
    "total_tokens": 1194,
    "translated_title": "IndicTrans2: 为印度所有22种官方语言构建高质量可访问的机器翻译模型",
    "translated_abstract": "印度有着丰富的语言景观，包括四个主要语系的语言，超过十亿人口使用。本篇论文聚焦于印度宪法列出的22种语言，被称为“官方语言”。鉴于语言多样性，高质量和可访问的机器翻译系统在印度这样的国家至关重要。在此之前，缺少（i）涵盖所有22种语言的平行训练数据，（ii）覆盖这些语言并包含印度相关内容的健壮基准，以及（iii）支持印度所有22种官方语言的现有翻译模型。本文旨在填补这一空白，并专注于启用22种印度官方语言的广泛、易于使用和开放式访问好的机器翻译系统所需的缺失部分。我们确定了四个改进关键领域：策划和创建更大的训练数据集、创建多样化和高质量的基准、跨越所有22种官方语言进行翻译，并构建高质量且可访问的机器翻译模型。我们的提议系统IndicTrans2在多个语言对上实现了最先进的性能，并且优于现有的在22种官方语言下的机器翻译模型。此外，我们提供了这些语言的基准和评估脚本，使得研究人员更容易地评价和提高关于印度语言的机器翻译模型。",
    "tldr": "本研究填补了印度22种官方语言机器翻译的空白，提出了IndicTrans2系统，它在多个语言对上表现最先进并优于现有的模型，同时提供了印度语言的基准和评估脚本。",
    "en_tdlr": "This study aims to fill the gap of machine translation for all 22 scheduled Indian languages and proposes the IndicTrans2 system, which achieves state-of-the-art performance on several language pairs and outperforms existing models. Additionally, benchmarks and evaluation scripts for the Indian languages are provided."
}