{
    "title": "SUVR: A Search-based Approach to Unsupervised Visual Representation Learning. (arXiv:2305.14754v1 [cs.CV])",
    "abstract": "Unsupervised learning has grown in popularity because of the difficulty of collecting annotated data and the development of modern frameworks that allow us to learn from unlabeled data. Existing studies, however, either disregard variations at different levels of similarity or only consider negative samples from one batch. We argue that image pairs should have varying degrees of similarity, and the negative samples should be allowed to be drawn from the entire dataset. In this work, we propose Search-based Unsupervised Visual Representation Learning (SUVR) to learn better image representations in an unsupervised manner. We first construct a graph from the image dataset by the similarity between images, and adopt the concept of graph traversal to explore positive samples. In the meantime, we make sure that negative samples can be drawn from the full dataset. Quantitative experiments on five benchmark image classification datasets demonstrate that SUVR can significantly outperform strong",
    "link": "http://arxiv.org/abs/2305.14754",
    "context": "Title: SUVR: A Search-based Approach to Unsupervised Visual Representation Learning. (arXiv:2305.14754v1 [cs.CV])\nAbstract: Unsupervised learning has grown in popularity because of the difficulty of collecting annotated data and the development of modern frameworks that allow us to learn from unlabeled data. Existing studies, however, either disregard variations at different levels of similarity or only consider negative samples from one batch. We argue that image pairs should have varying degrees of similarity, and the negative samples should be allowed to be drawn from the entire dataset. In this work, we propose Search-based Unsupervised Visual Representation Learning (SUVR) to learn better image representations in an unsupervised manner. We first construct a graph from the image dataset by the similarity between images, and adopt the concept of graph traversal to explore positive samples. In the meantime, we make sure that negative samples can be drawn from the full dataset. Quantitative experiments on five benchmark image classification datasets demonstrate that SUVR can significantly outperform strong",
    "path": "papers/23/05/2305.14754.json",
    "total_tokens": 924,
    "translated_title": "SUVR:一种基于搜索的无监督视觉特征学习方法",
    "translated_abstract": "由于收集注释数据的困难和现代框架允许我们从无标签数据中学习，无监督学习变得越来越受欢迎。但是，现有的研究要么忽略了不同相似性级别上的变化，要么仅从一个批次考虑负样本。我们认为，图像对应该具有不同程度的相似性，并且应该允许从整个数据集中选择负样本。在这项工作中，我们提出了一种名为“基于搜索的无监督视觉特征学习”（SUVR）的方法，以无监督的方式更好地学习图像表示。我们首先通过图像之间的相似性构建图形，采用图遍历的概念来探索正样本。同时，我们确保可以从整个数据集中选择负样本。在五个基准图像分类数据集上进行的定量实验表明，SUVR明显优于强基线模型。",
    "tldr": "本文提出了一种名为“基于搜索的无监督视觉特征学习”（SUVR）的方法，以无监督的方式更好地学习图像表示，并通过在构建图形和选择负样本等方面作了改进，实验结果表明，该方法明显优于强基线模型。",
    "en_tdlr": "This paper proposes a Search-based Unsupervised Visual Representation Learning (SUVR) approach to learn better image representations in an unsupervised manner. The approach improves upon existing studies by considering variations at different levels of similarity and allowing negative samples to be drawn from the entire dataset. Quantitative experiments on five benchmark image classification datasets show that SUVR outperforms strong baseline models."
}