{
    "title": "Large Global Volatility Matrix Analysis Based on Structural Information. (arXiv:2305.01464v1 [econ.EM])",
    "abstract": "In this paper, we develop a novel large volatility matrix estimation procedure for analyzing global financial markets. Practitioners often use lower-frequency data, such as weekly or monthly returns, to address the issue of different trading hours in the international financial market. However, this approach can lead to inefficiency due to information loss. To mitigate this problem, our proposed method, called Structured Principal Orthogonal complEment Thresholding (Structured-POET), incorporates structural information for both global and national factor models. We establish the asymptotic properties of the Structured-POET estimator, and also demonstrate the drawbacks of conventional covariance matrix estimation procedures when using lower-frequency data. Finally, we apply the Structured-POET estimator to an out-of-sample portfolio allocation study using international stock market data.",
    "link": "http://arxiv.org/abs/2305.01464",
    "context": "Title: Large Global Volatility Matrix Analysis Based on Structural Information. (arXiv:2305.01464v1 [econ.EM])\nAbstract: In this paper, we develop a novel large volatility matrix estimation procedure for analyzing global financial markets. Practitioners often use lower-frequency data, such as weekly or monthly returns, to address the issue of different trading hours in the international financial market. However, this approach can lead to inefficiency due to information loss. To mitigate this problem, our proposed method, called Structured Principal Orthogonal complEment Thresholding (Structured-POET), incorporates structural information for both global and national factor models. We establish the asymptotic properties of the Structured-POET estimator, and also demonstrate the drawbacks of conventional covariance matrix estimation procedures when using lower-frequency data. Finally, we apply the Structured-POET estimator to an out-of-sample portfolio allocation study using international stock market data.",
    "path": "papers/23/05/2305.01464.json",
    "total_tokens": 833,
    "translated_title": "基于结构信息的大规模全局波动矩阵分析",
    "translated_abstract": "本文针对全球金融市场开发了一种新的大波动矩阵估计程序。实践证明，从每周或每月的回报等较低频的数据入手是解决国际金融市场交易时间差异问题的一种方法，但这种方法会由于信息损失导致低效。为了缓解这个问题，我们提出了一种名为结构主正交补阈值(Structured-POET)的方法，该方法可以合并全球和国家因子模型的结构信息。我们建立了Structured-POET估计的渐近性质，并证明了在使用低频数据时传统协方差矩阵估计程序的缺点。最后，我们应用Structured-POET估计器到一个使用国际股票市场数据的样本外组合配置研究中。",
    "tldr": "本文提出了一种名为Structured-POET的方法，它可以合并全球和国家因子模型的结构信息。该方法可以用于估计大波动矩阵，并应用于国际股票市场数据的样本外组合分配的研究。",
    "en_tdlr": "The paper proposes a novel method called Structured Principal Orthogonal complEment Thresholding (Structured-POET) for estimating large volatility matrix by incorporating structural information for both global and national factor models. The method is demonstrated to be applicable for an out-of-sample portfolio allocation study using international stock market data."
}