{
    "title": "QFA2SR: Query-Free Adversarial Transfer Attacks to Speaker Recognition Systems. (arXiv:2305.14097v2 [cs.CR] UPDATED)",
    "abstract": "Current adversarial attacks against speaker recognition systems (SRSs) require either white-box access or heavy black-box queries to the target SRS, thus still falling behind practical attacks against proprietary commercial APIs and voice-controlled devices. To fill this gap, we propose QFA2SR, an effective and imperceptible query-free black-box attack, by leveraging the transferability of adversarial voices. To improve transferability, we present three novel methods, tailored loss functions, SRS ensemble, and time-freq corrosion. The first one tailors loss functions to different attack scenarios. The latter two augment surrogate SRSs in two different ways. SRS ensemble combines diverse surrogate SRSs with new strategies, amenable to the unique scoring characteristics of SRSs. Time-freq corrosion augments surrogate SRSs by incorporating well-designed time-/frequency-domain modification functions, which simulate and approximate the decision boundary of the target SRS and distortions int",
    "link": "http://arxiv.org/abs/2305.14097",
    "context": "Title: QFA2SR: Query-Free Adversarial Transfer Attacks to Speaker Recognition Systems. (arXiv:2305.14097v2 [cs.CR] UPDATED)\nAbstract: Current adversarial attacks against speaker recognition systems (SRSs) require either white-box access or heavy black-box queries to the target SRS, thus still falling behind practical attacks against proprietary commercial APIs and voice-controlled devices. To fill this gap, we propose QFA2SR, an effective and imperceptible query-free black-box attack, by leveraging the transferability of adversarial voices. To improve transferability, we present three novel methods, tailored loss functions, SRS ensemble, and time-freq corrosion. The first one tailors loss functions to different attack scenarios. The latter two augment surrogate SRSs in two different ways. SRS ensemble combines diverse surrogate SRSs with new strategies, amenable to the unique scoring characteristics of SRSs. Time-freq corrosion augments surrogate SRSs by incorporating well-designed time-/frequency-domain modification functions, which simulate and approximate the decision boundary of the target SRS and distortions int",
    "path": "papers/23/05/2305.14097.json",
    "total_tokens": 959,
    "translated_title": "QFA2SR: 无查询的对抗迁移攻击以对抗说话人识别系统",
    "translated_abstract": "目前针对说话人识别系统（SRSs）的对抗攻击要么需要白盒访问，要么需要对目标SRS进行大量的黑盒查询，因此仍然落后于针对专有商业API和语音控制设备的实际攻击。为了填补这一空白，我们提出了QFA2SR，一种有效且不可察觉的无查询黑盒攻击，利用对抗性声音的可传递性。为了提高可传递性，我们提出了三种新方法，定制损失函数、SRS集成和时频腐蚀。第一个方法将损失函数定制为不同的攻击场景。后两种方法以两种不同的方式增强替代SRS。SRS集成将多样化的替代SRS与新策略相结合，适应SRS的独特评分特性。时频腐蚀通过引入精心设计的时域/频域修改函数增强替代SRS，模拟和近似目标SRS的决策边界和失真。",
    "tldr": "本论文提出了QFA2SR，一种无查询的黑盒攻击方法，用于对抗说话人识别系统。该方法利用对抗声音的可传递性，通过定制损失函数、SRS集成和时频腐蚀等新方法，实现了有效且不可察觉的攻击。"
}