{
    "title": "Lyapunov-Driven Deep Reinforcement Learning for Edge Inference Empowered by Reconfigurable Intelligent Surfaces. (arXiv:2305.10931v1 [cs.IT])",
    "abstract": "In this paper, we propose a novel algorithm for energy-efficient, low-latency, accurate inference at the wireless edge, in the context of 6G networks endowed with reconfigurable intelligent surfaces (RISs). We consider a scenario where new data are continuously generated/collected by a set of devices and are handled through a dynamic queueing system. Building on the marriage between Lyapunov stochastic optimization and deep reinforcement learning (DRL), we devise a dynamic learning algorithm that jointly optimizes the data compression scheme, the allocation of radio resources (i.e., power, transmission precoding), the computation resources (i.e., CPU cycles), and the RIS reflectivity parameters (i.e., phase shifts), with the aim of performing energy-efficient edge classification with end-to-end (E2E) delay and inference accuracy constraints. The proposed strategy enables dynamic control of the system and of the wireless propagation environment, performing a low-complexity optimization ",
    "link": "http://arxiv.org/abs/2305.10931",
    "context": "Title: Lyapunov-Driven Deep Reinforcement Learning for Edge Inference Empowered by Reconfigurable Intelligent Surfaces. (arXiv:2305.10931v1 [cs.IT])\nAbstract: In this paper, we propose a novel algorithm for energy-efficient, low-latency, accurate inference at the wireless edge, in the context of 6G networks endowed with reconfigurable intelligent surfaces (RISs). We consider a scenario where new data are continuously generated/collected by a set of devices and are handled through a dynamic queueing system. Building on the marriage between Lyapunov stochastic optimization and deep reinforcement learning (DRL), we devise a dynamic learning algorithm that jointly optimizes the data compression scheme, the allocation of radio resources (i.e., power, transmission precoding), the computation resources (i.e., CPU cycles), and the RIS reflectivity parameters (i.e., phase shifts), with the aim of performing energy-efficient edge classification with end-to-end (E2E) delay and inference accuracy constraints. The proposed strategy enables dynamic control of the system and of the wireless propagation environment, performing a low-complexity optimization ",
    "path": "papers/23/05/2305.10931.json",
    "total_tokens": 939,
    "translated_title": "基于可重构智能表面赋能的边缘推理的李雅普诺夫深度强化学习",
    "translated_abstract": "本文针对具备可重构智能表面(RIS)的6G网络中无线边缘能耗低、时延低、准确度高的推理，提出了一种新颖的算法。我们考虑一个场景，其中一组设备不断产生收集数据，并通过动态排队系统处理。基于李雅普诺夫随机优化和深度强化学习(DRL)的婚姻，我们设计了一种动态学习算法，联合优化数据压缩方案、无线资源分配（即功率、传输预编码）、计算资源（即CPU周期）和RIS反射参数（即相移），以实现满足端到端(E2E)时延和推理准确性的能效推理分类。所提出的策略启用了动态控制系统和无线传播环境，实现了低复杂度优化。",
    "tldr": "本文提出了一种基于李雅普诺夫深度强化学习的动态学习算法，在可重构智能表面赋能的6G网络中，能够同时优化数据压缩方案、无线资源分配、计算资源和RIS反射参数，实现了能效推理分类。",
    "en_tdlr": "This paper proposes a dynamic learning algorithm based on Lyapunov-driven deep reinforcement learning for energy-efficient, low-latency, and accurate edge inference in 6G networks empowered by reconfigurable intelligent surfaces. It optimizes data compression scheme, allocation of radio resources, computation resources, and RIS reflectivity parameters, achieving energy-efficient edge classification with end-to-end delay and inference accuracy constraints."
}