{
    "title": "Kinship can hinder cooperation in heterogeneous populations. (arXiv:2305.19026v1 [econ.TH])",
    "abstract": "Kin selection and direct reciprocity are two most basic mechanisms for promoting cooperation in human society. Generalizing the standard models of the multi-player Prisoner's Dilemma and the Public Goods games for heterogeneous populations, we study the effects of genetic relatedness on cooperation in the context of repeated interactions. Two sets of interrelated results are established: a set of analytical results focusing on the subgame perfect equilibrium and a set of agent-based simulation results based on an evolutionary game model. We show that in both cases increasing genetic relatedness does not always facilitate cooperation. Specifically, kinship can hinder the effectiveness of reciprocity in two ways. First, the condition for sustaining cooperation through direct reciprocity is harder to satisfy when relatedness increases in an intermediate range. Second, full cooperation is impossible to sustain for a medium-high range of relatedness values. Moreover, individuals with low co",
    "link": "http://arxiv.org/abs/2305.19026",
    "context": "Title: Kinship can hinder cooperation in heterogeneous populations. (arXiv:2305.19026v1 [econ.TH])\nAbstract: Kin selection and direct reciprocity are two most basic mechanisms for promoting cooperation in human society. Generalizing the standard models of the multi-player Prisoner's Dilemma and the Public Goods games for heterogeneous populations, we study the effects of genetic relatedness on cooperation in the context of repeated interactions. Two sets of interrelated results are established: a set of analytical results focusing on the subgame perfect equilibrium and a set of agent-based simulation results based on an evolutionary game model. We show that in both cases increasing genetic relatedness does not always facilitate cooperation. Specifically, kinship can hinder the effectiveness of reciprocity in two ways. First, the condition for sustaining cooperation through direct reciprocity is harder to satisfy when relatedness increases in an intermediate range. Second, full cooperation is impossible to sustain for a medium-high range of relatedness values. Moreover, individuals with low co",
    "path": "papers/23/05/2305.19026.json",
    "total_tokens": 856,
    "translated_title": "亲属关系可能会阻碍人类群体的合作",
    "translated_abstract": "亲缘选择和直接互惠是促进人类社会合作的两种基本机制。在异质群体中推广多人囚徒困境和公共物品博弈的标准模型，我们研究了基因亲缘关系对重复互动中合作的影响。我们建立了一组关于次博弈完美均衡的分析结果和一组基于演化博弈模型的基于代理的模拟结果。我们表明，在两种情况下，增加基因亲缘关系并不总是有利于合作。具体来说，亲缘关系可以通过两种方式阻碍互惠的效力。首先，在中间范围内增加亲缘关系会使通过直接互惠维持合作的条件更难满足。其次，对于中高亲缘关系值的范围，不可能维持完全合作。此外，在亲属关系较低的个体中，合作的收益很少。",
    "tldr": "亲属关系的增加并不总是有利于人类社会的合作，会阻碍直接互惠的效力，并使维持完全合作的条件更加苛刻。",
    "en_tdlr": "Increasing genetic relatedness does not always facilitate cooperation in human society, as it can hinder the effectiveness of reciprocity and make it harder to sustain full cooperation, especially for individuals with low relatedness."
}