{
    "title": "Tackling Interpretability in Audio Classification Networks with Non-negative Matrix Factorization. (arXiv:2305.07132v1 [cs.SD])",
    "abstract": "This paper tackles two major problem settings for interpretability of audio processing networks, post-hoc and by-design interpretation. For post-hoc interpretation, we aim to interpret decisions of a network in terms of high-level audio objects that are also listenable for the end-user. This is extended to present an inherently interpretable model with high performance. To this end, we propose a novel interpreter design that incorporates non-negative matrix factorization (NMF). In particular, an interpreter is trained to generate a regularized intermediate embedding from hidden layers of a target network, learnt as time-activations of a pre-learnt NMF dictionary. Our methodology allows us to generate intuitive audio-based interpretations that explicitly enhance parts of the input signal most relevant for a network's decision. We demonstrate our method's applicability on a variety of classification tasks, including multi-label data for real-world audio and music.",
    "link": "http://arxiv.org/abs/2305.07132",
    "context": "Title: Tackling Interpretability in Audio Classification Networks with Non-negative Matrix Factorization. (arXiv:2305.07132v1 [cs.SD])\nAbstract: This paper tackles two major problem settings for interpretability of audio processing networks, post-hoc and by-design interpretation. For post-hoc interpretation, we aim to interpret decisions of a network in terms of high-level audio objects that are also listenable for the end-user. This is extended to present an inherently interpretable model with high performance. To this end, we propose a novel interpreter design that incorporates non-negative matrix factorization (NMF). In particular, an interpreter is trained to generate a regularized intermediate embedding from hidden layers of a target network, learnt as time-activations of a pre-learnt NMF dictionary. Our methodology allows us to generate intuitive audio-based interpretations that explicitly enhance parts of the input signal most relevant for a network's decision. We demonstrate our method's applicability on a variety of classification tasks, including multi-label data for real-world audio and music.",
    "path": "papers/23/05/2305.07132.json",
    "total_tokens": 828,
    "translated_title": "通过非负矩阵分解解决音频分类网络的可解释性问题",
    "translated_abstract": "本文针对音频处理网络解释性的两个主要问题，即事后和设计时解释性，提出了处理方法。针对事后解释性，我们旨在解释网络决策方面的高级音频对象，最终为终端用户提供可听的对象。本文通过引入非负矩阵分解(NMF)的解释器设计，提出了一种具有高性能的本质上可解释模型。具体而言，解释器通过学习预先学习NMF字典的时间激活作为目标网络隐藏层的规则化中间嵌入来生成。本文的方法允许我们生成直观的基于音频的解释，明确增强与网络决策最相关的输入信号的部分。我们在多个分类任务上演示了我们方法的适用性，包括真实世界的音频和音乐多标签数据。",
    "tldr": "本文通过引入非负矩阵分解(NMF)的解释器设计，提出了一种具有高性能的本质上可解释模型，解决了音频分类网络的可解释性问题。",
    "en_tdlr": "This paper proposes a model that incorporates non-negative matrix factorization (NMF) to create an interpreter, providing an inherently interpretable model with high performance to tackle the interpretability problem in audio classification networks."
}