{
    "title": "DiscoPrompt: Path Prediction Prompt Tuning for Implicit Discourse Relation Recognition. (arXiv:2305.03973v1 [cs.CL])",
    "abstract": "Implicit Discourse Relation Recognition (IDRR) is a sophisticated and challenging task to recognize the discourse relations between the arguments with the absence of discourse connectives. The sense labels for each discourse relation follow a hierarchical classification scheme in the annotation process (Prasad et al., 2008), forming a hierarchy structure. Most existing works do not well incorporate the hierarchy structure but focus on the syntax features and the prior knowledge of connectives in the manner of pure text classification. We argue that it is more effective to predict the paths inside the hierarchical tree (e.g., \"Comparison -> Contrast -> however\") rather than flat labels (e.g., Contrast) or connectives (e.g., however). We propose a prompt-based path prediction method to utilize the interactive information and intrinsic senses among the hierarchy in IDRR. This is the first work that injects such structure information into pre-trained language models via prompt tuning, and ",
    "link": "http://arxiv.org/abs/2305.03973",
    "context": "Title: DiscoPrompt: Path Prediction Prompt Tuning for Implicit Discourse Relation Recognition. (arXiv:2305.03973v1 [cs.CL])\nAbstract: Implicit Discourse Relation Recognition (IDRR) is a sophisticated and challenging task to recognize the discourse relations between the arguments with the absence of discourse connectives. The sense labels for each discourse relation follow a hierarchical classification scheme in the annotation process (Prasad et al., 2008), forming a hierarchy structure. Most existing works do not well incorporate the hierarchy structure but focus on the syntax features and the prior knowledge of connectives in the manner of pure text classification. We argue that it is more effective to predict the paths inside the hierarchical tree (e.g., \"Comparison -> Contrast -> however\") rather than flat labels (e.g., Contrast) or connectives (e.g., however). We propose a prompt-based path prediction method to utilize the interactive information and intrinsic senses among the hierarchy in IDRR. This is the first work that injects such structure information into pre-trained language models via prompt tuning, and ",
    "path": "papers/23/05/2305.03973.json",
    "total_tokens": 834,
    "translated_title": "DiscoPrompt: 隐含语篇关系识别中的路径预测提示优化",
    "translated_abstract": "隐含语篇关系识别(IDRR)是一项复杂而具有挑战性的任务，用于识别参数之间的话语关系，其中不存在话语连接词。在注释过程中，每个话语关系的语义标签遵循一种层次分类体系(Prasad等人，2008)，形成了一个层次结构。大多数现有作品没有很好地整合这种层次结构，而是专注于纯文本分类中的句法特征和连词的先验知识。我们认为，预测层次结构内部的路径(例如，“比较->对比->然而”)比预测平面标签(例如，对比)或连词(例如，然而)更有效。我们提出了一种基于提示的路径预测方法，利用IDRR中层次结构之间的交互信息和内在语义。这是第一个通过提示优化将这种结构信息注入预训练语言模型中的工作。",
    "tldr": "DiscoPrompt是一种新的方法，通过预测层次结构内部的路径来识别隐含语篇关系，相比于以往的纯文本分类方法更加有效。",
    "en_tdlr": "DiscoPrompt is a new method that recognizes implicit discourse relations by predicting the paths inside the hierarchical tree, which is more effective than previous pure text classification methods."
}