{
    "title": "CNS-Net: Conservative Novelty Synthesizing Network for Malware Recognition in an Open-set Scenario. (arXiv:2305.01236v1 [cs.CR])",
    "abstract": "We study the challenging task of malware recognition on both known and novel unknown malware families, called malware open-set recognition (MOSR). Previous works usually assume the malware families are known to the classifier in a close-set scenario, i.e., testing families are the subset or at most identical to training families. However, novel unknown malware families frequently emerge in real-world applications, and as such, require to recognize malware instances in an open-set scenario, i.e., some unknown families are also included in the test-set, which has been rarely and non-thoroughly investigated in the cyber-security domain. One practical solution for MOSR may consider jointly classifying known and detecting unknown malware families by a single classifier (e.g., neural network) from the variance of the predicted probability distribution on known families. However, conventional well-trained classifiers usually tend to obtain overly high recognition probabilities in the outputs,",
    "link": "http://arxiv.org/abs/2305.01236",
    "context": "Title: CNS-Net: Conservative Novelty Synthesizing Network for Malware Recognition in an Open-set Scenario. (arXiv:2305.01236v1 [cs.CR])\nAbstract: We study the challenging task of malware recognition on both known and novel unknown malware families, called malware open-set recognition (MOSR). Previous works usually assume the malware families are known to the classifier in a close-set scenario, i.e., testing families are the subset or at most identical to training families. However, novel unknown malware families frequently emerge in real-world applications, and as such, require to recognize malware instances in an open-set scenario, i.e., some unknown families are also included in the test-set, which has been rarely and non-thoroughly investigated in the cyber-security domain. One practical solution for MOSR may consider jointly classifying known and detecting unknown malware families by a single classifier (e.g., neural network) from the variance of the predicted probability distribution on known families. However, conventional well-trained classifiers usually tend to obtain overly high recognition probabilities in the outputs,",
    "path": "papers/23/05/2305.01236.json",
    "total_tokens": 983,
    "translated_title": "CNS-Net: 用于开放式场景下恶意软件识别的保守性新颖合成网络",
    "translated_abstract": "本文研究了恶意软件开放集识别(MOSR)的挑战性任务，即在已知和未知恶意软件家族中进行识别。以前的工作通常假设分类器已知恶意软件家族处于关闭集场景中，即测试家族是训练家族的子集或最多与之相同。然而，新的未知恶意软件家族经常出现在实际应用中，因此需要在开放集场景中对恶意软件实例进行识别，即测试集中也包含一些未知家族。MOSR的一个实用解决方案可能会考虑通过单一分类器(例如，神经网络)从已知家族预测概率分布的方差来同时对已知和未知恶意软件家族进行分类和检测。然而，传统的良好训练的分类器通常倾向于获得过高的识别概率输出，从而难以区分已知和未知的恶意软件家族。为了解决这个问题，我们提出了CNS-Net，一种新的神经网络架构，它合成了保守性新颖性，旨在准确地分类已知和未知的恶意软件家族。",
    "tldr": "CNS-Net是一种用于开放式场景下恶意软件识别的新颖神经网络，能够合成保守性新颖性来准确区分已知和未知的恶意软件家族。"
}