{
    "title": "Addressing computational challenges in physical system simulations with machine learning. (arXiv:2305.09627v1 [cs.LG])",
    "abstract": "In this paper, we present a machine learning-based data generator framework tailored to aid researchers who utilize simulations to examine various physical systems or processes. High computational costs and the resulting limited data often pose significant challenges to gaining insights into these systems or processes. Our approach involves a two-step process: initially, we train a supervised predictive model using a limited simulated dataset to predict simulation outcomes. Subsequently, a reinforcement learning agent is trained to generate accurate, simulation-like data by leveraging the supervised model. With this framework, researchers can generate more accurate data and know the outcomes without running high computational simulations, which enables them to explore the parameter space more efficiently and gain deeper insights into physical systems or processes. We demonstrate the effectiveness of the proposed framework by applying it to two case studies, one focusing on earthquake r",
    "link": "http://arxiv.org/abs/2305.09627",
    "context": "Title: Addressing computational challenges in physical system simulations with machine learning. (arXiv:2305.09627v1 [cs.LG])\nAbstract: In this paper, we present a machine learning-based data generator framework tailored to aid researchers who utilize simulations to examine various physical systems or processes. High computational costs and the resulting limited data often pose significant challenges to gaining insights into these systems or processes. Our approach involves a two-step process: initially, we train a supervised predictive model using a limited simulated dataset to predict simulation outcomes. Subsequently, a reinforcement learning agent is trained to generate accurate, simulation-like data by leveraging the supervised model. With this framework, researchers can generate more accurate data and know the outcomes without running high computational simulations, which enables them to explore the parameter space more efficiently and gain deeper insights into physical systems or processes. We demonstrate the effectiveness of the proposed framework by applying it to two case studies, one focusing on earthquake r",
    "path": "papers/23/05/2305.09627.json",
    "total_tokens": 910,
    "translated_title": "运用机器学习解决物理系统模拟中的计算挑战",
    "translated_abstract": "本文提出了一个机器学习数据生成框架，旨在帮助利用模拟研究各种物理系统或过程的研究人员。高计算成本和由此导致的有限数据经常会对获得这些系统或过程的深入见解产生重大挑战。我们的方法包括两个步骤：首先，我们使用有限的模拟数据训练有监督的预测模型来预测模拟结果。其次，利用强化学习代理来生成准确的、类似于模拟的数据。借助这个框架，研究人员可以生成更准确的数据并知道结果，而不必运行高计算代价的模拟，从而更有效地探索参数空间并深入洞察物理系统或过程。我们通过两个案例研究来展示所提出框架的有效性，一个是地震预测，一个是奥托循环建模。",
    "tldr": "本文提出了一个机器学习数据生成框架，通过有限的模拟数据训练有监督的预测模型和强化学习代理生成准确的、类似于模拟的数据来解决物理系统模拟中的计算挑战。"
}