{
    "title": "Clustering of Time-Varying Graphs Based on Temporal Label Smoothness. (arXiv:2305.06576v1 [cs.LG])",
    "abstract": "We propose a node clustering method for time-varying graphs based on the assumption that the cluster labels are changed smoothly over time. Clustering is one of the fundamental tasks in many science and engineering fields including signal processing, machine learning, and data mining. Although most existing studies focus on the clustering of nodes in static graphs, we often encounter time-varying graphs for time-series data, e.g., social networks, brain functional connectivity, and point clouds. In this paper, we formulate a node clustering of time-varying graphs as an optimization problem based on spectral clustering, with a smoothness constraint of the node labels. We solve the problem with a primal-dual splitting algorithm. Experiments on synthetic and real-world time-varying graphs are performed to validate the effectiveness of the proposed approach.",
    "link": "http://arxiv.org/abs/2305.06576",
    "context": "Title: Clustering of Time-Varying Graphs Based on Temporal Label Smoothness. (arXiv:2305.06576v1 [cs.LG])\nAbstract: We propose a node clustering method for time-varying graphs based on the assumption that the cluster labels are changed smoothly over time. Clustering is one of the fundamental tasks in many science and engineering fields including signal processing, machine learning, and data mining. Although most existing studies focus on the clustering of nodes in static graphs, we often encounter time-varying graphs for time-series data, e.g., social networks, brain functional connectivity, and point clouds. In this paper, we formulate a node clustering of time-varying graphs as an optimization problem based on spectral clustering, with a smoothness constraint of the node labels. We solve the problem with a primal-dual splitting algorithm. Experiments on synthetic and real-world time-varying graphs are performed to validate the effectiveness of the proposed approach.",
    "path": "papers/23/05/2305.06576.json",
    "total_tokens": 744,
    "translated_title": "基于时间标签平滑性的时变图聚类方法",
    "translated_abstract": "本文提出了一种基于簇标签随时间平滑变化的节点聚类方法。聚类是许多科学和工程领域中基础的任务，包括信号处理、机器学习和数据挖掘。虽然大多数已有的研究侧重于对静态图中节点的聚类，但我们经常遇到时变图，如社交网络、脑功能连接和点云等时序数据。本文将时变图的节点聚类问题建模为一个基于谱聚类的优化问题，并添加了簇标签平滑性的约束条件。我们使用原始-对偶拆分算法来解决该问题。实验结果表明了该方法的有效性。",
    "tldr": "本文提出了一种基于谱聚类的时变图节点聚类方法，并添加了簇标签平滑性的约束条件。实验证明该方法是有效的。",
    "en_tdlr": "This paper proposes a node clustering method for time-varying graphs based on spectral clustering, with a smoothness constraint of the node labels. Experiments show that the proposed approach is effective."
}