{
    "title": "A Measure-Theoretic Axiomatisation of Causality. (arXiv:2305.17139v1 [cs.AI])",
    "abstract": "Causality is a central concept in a wide range of research areas, yet there is still no universally agreed axiomatisation of causality. We view causality both as an extension of probability theory and as a study of \\textit{what happens when one intervenes on a system}, and argue in favour of taking Kolmogorov's measure-theoretic axiomatisation of probability as the starting point towards an axiomatisation of causality. To that end, we propose the notion of a \\textit{causal space}, consisting of a probability space along with a collection of transition probability kernels, called \\textit{causal kernels}, that encode the causal information of the space. Our proposed framework is not only rigorously grounded in measure theory, but it also sheds light on long-standing limitations of existing frameworks including, for example, cycles, latent variables and stochastic processes.",
    "link": "http://arxiv.org/abs/2305.17139",
    "context": "Title: A Measure-Theoretic Axiomatisation of Causality. (arXiv:2305.17139v1 [cs.AI])\nAbstract: Causality is a central concept in a wide range of research areas, yet there is still no universally agreed axiomatisation of causality. We view causality both as an extension of probability theory and as a study of \\textit{what happens when one intervenes on a system}, and argue in favour of taking Kolmogorov's measure-theoretic axiomatisation of probability as the starting point towards an axiomatisation of causality. To that end, we propose the notion of a \\textit{causal space}, consisting of a probability space along with a collection of transition probability kernels, called \\textit{causal kernels}, that encode the causal information of the space. Our proposed framework is not only rigorously grounded in measure theory, but it also sheds light on long-standing limitations of existing frameworks including, for example, cycles, latent variables and stochastic processes.",
    "path": "papers/23/05/2305.17139.json",
    "total_tokens": 851,
    "translated_title": "因果关系的测度论公理化",
    "translated_abstract": "因果关系是许多研究领域中的核心概念，但仍然没有普遍认可的因果关系公理化。我们将因果关系视为概率理论的扩展，并作为研究在系统上干预时会发生什么的研究，并提议以柯尔莫戈罗夫的概率测度公理化作为因果关系公理化的起点。为此，我们提出了一个\"因果空间\"的概念，包括一个概率空间和称为\"因果核\"的转移概率核的集合，用来编码该空间的因果信息。我们提出的框架不仅在测度论上严格地基于，还揭示了现有框架的长期限制，例如，循环、潜在变量和随机过程。",
    "tldr": "本文提出了一个称为\"因果空间\"的概念，旨在以柯尔莫戈罗夫的概率测度公理化为起点，实现对因果关系的公理化，并成功地解决了现有框架的限制。",
    "en_tdlr": "The paper proposes a notion of \"causal space\" serving as the starting point towards an axiomatisation of causality based on Kolmogorov's probability measure, which sheds light on long-standing limitations of existing frameworks, and encodes causal information by consisting of a probability space and a collection of transition probability kernels called causal kernels."
}