{
    "title": "M3ICRO: Machine Learning-Enabled Compact Photonic Tensor Core based on PRogrammable Multi-Operand Multimode Interference. (arXiv:2305.19505v1 [cs.ET])",
    "abstract": "Photonic computing shows promise for transformative advancements in machine learning (ML) acceleration, offering ultra-fast speed, massive parallelism, and high energy efficiency. However, current photonic tensor core (PTC) designs based on standard optical components hinder scalability and compute density due to their large spatial footprint. To address this, we propose an ultra-compact PTC using customized programmable multi-operand multimode interference (MOMMI) devices, named M3ICRO. The programmable MOMMI leverages the intrinsic light propagation principle, providing a single-device programmable matrix unit beyond the conventional computing paradigm of one multiply-accumulate (MAC) operation per device. To overcome the optimization difficulty of customized devices that often requires time-consuming simulation, we apply ML for optics to predict the device behavior and enable a differentiable optimization flow. We thoroughly investigate the reconfigurability and matrix expressivity ",
    "link": "http://arxiv.org/abs/2305.19505",
    "context": "Title: M3ICRO: Machine Learning-Enabled Compact Photonic Tensor Core based on PRogrammable Multi-Operand Multimode Interference. (arXiv:2305.19505v1 [cs.ET])\nAbstract: Photonic computing shows promise for transformative advancements in machine learning (ML) acceleration, offering ultra-fast speed, massive parallelism, and high energy efficiency. However, current photonic tensor core (PTC) designs based on standard optical components hinder scalability and compute density due to their large spatial footprint. To address this, we propose an ultra-compact PTC using customized programmable multi-operand multimode interference (MOMMI) devices, named M3ICRO. The programmable MOMMI leverages the intrinsic light propagation principle, providing a single-device programmable matrix unit beyond the conventional computing paradigm of one multiply-accumulate (MAC) operation per device. To overcome the optimization difficulty of customized devices that often requires time-consuming simulation, we apply ML for optics to predict the device behavior and enable a differentiable optimization flow. We thoroughly investigate the reconfigurability and matrix expressivity ",
    "path": "papers/23/05/2305.19505.json",
    "total_tokens": 1030,
    "translated_title": "基于可编程多操作多模干涉的机器学习光子张量核心——M3ICRO",
    "translated_abstract": "光子计算对于机器学习加速具有重要作用，其具有超快速度、大规模并行和高能效等优势。然而，当前基于标准光学元件的光子张量核心（PTC）设计由于其较大的空间占用面积而限制了其可扩展性和计算密度。为解决这个问题，我们提出了一款利用定制可编程多操作多模干涉（MOMMI）器件的超紧凑型PTC，名为M3ICRO。可编程的MOMMI利用光的固有传播原理，提供单设备可编程矩阵单元，超越了传统计算范式中每个设备一个乘积累加（MAC）操作的限制。为了解决常规优化技术对定制器件的优化困难，通常需要耗费大量时间进行模拟，我们使用ML for optics来预测器件行为并实现可微分的优化流程。我们全面研究了M3ICRO的可重构性和矩阵表现力，展示了它相对于现有设计的能效提升，并展示了其在加速图像识别和自然语言处理等各种机器学习任务中的潜力。",
    "tldr": "M3ICRO是一种基于定制MOMMI器件的机器学习光子张量核心，具有超高能效、紧凑型设计和ML for optics优化方法，可以用于加速图像识别、自然语言处理等多种ML任务。",
    "en_tdlr": "M3ICRO is a machine learning photonic tensor core based on customized programmable multi-operand multimode interference (MOMMI) devices, featuring high energy efficiency, compact design, and ML for optics optimization. It has the potential to accelerate various ML tasks, including image recognition and natural language processing."
}