{
    "title": "Balancing Risk and Reward: An Automated Phased Release Strategy. (arXiv:2305.09626v1 [stat.ML])",
    "abstract": "Phased releases are a common strategy in the technology industry for gradually releasing new products or updates through a sequence of A/B tests in which the number of treated units gradually grows until full deployment or deprecation. Performing phased releases in a principled way requires selecting the proportion of units assigned to the new release in a way that balances the risk of an adverse effect with the need to iterate and learn from the experiment rapidly. In this paper, we formalize this problem and propose an algorithm that automatically determines the release percentage at each stage in the schedule, balancing the need to control risk while maximizing ramp-up speed. Our framework models the challenge as a constrained batched bandit problem that ensures that our pre-specified experimental budget is not depleted with high probability. Our proposed algorithm leverages an adaptive Bayesian approach in which the maximal number of units assigned to the treatment is determined by",
    "link": "http://arxiv.org/abs/2305.09626",
    "context": "Title: Balancing Risk and Reward: An Automated Phased Release Strategy. (arXiv:2305.09626v1 [stat.ML])\nAbstract: Phased releases are a common strategy in the technology industry for gradually releasing new products or updates through a sequence of A/B tests in which the number of treated units gradually grows until full deployment or deprecation. Performing phased releases in a principled way requires selecting the proportion of units assigned to the new release in a way that balances the risk of an adverse effect with the need to iterate and learn from the experiment rapidly. In this paper, we formalize this problem and propose an algorithm that automatically determines the release percentage at each stage in the schedule, balancing the need to control risk while maximizing ramp-up speed. Our framework models the challenge as a constrained batched bandit problem that ensures that our pre-specified experimental budget is not depleted with high probability. Our proposed algorithm leverages an adaptive Bayesian approach in which the maximal number of units assigned to the treatment is determined by",
    "path": "papers/23/05/2305.09626.json",
    "total_tokens": 860,
    "translated_title": "平衡风险与收益：一种自动化的分阶段发布策略",
    "translated_abstract": "分阶段发布是科技行业中逐步发布新产品或更新的常见策略，通过一系列A/B测试，逐步增加处理单元的数量，直到完全部署或废弃。以原则性的方式执行分阶段发布需要以平衡不良影响的风险和迭代和快速学习的需求来选择分配给新发布的单位比例。在本文中，我们正式地阐述了这个问题，并提出了一种算法，在调度的每个阶段自动确定发布百分比，平衡控制风险和最大化启动速度的需求。我们的框架将这一挑战建模为一个受约束的分批赌博机问题，以确保我们预先指定的实验预算不会被高概率耗尽。我们提出的算法利用了自适应贝叶斯方法，其中将分配给处理的最大单元数由",
    "tldr": "本文提出了一种自动化的分阶段发布策略，能够在控制风险的同时最大化启动速度，通过一个受约束的分批赌博机问题模型来实现。",
    "en_tdlr": "This paper proposes an automated phased release strategy that balances risk and maximizes ramp-up speed, formalizing the problem as a constrained batched bandit problem. The proposed algorithm leverages an adaptive Bayesian approach to determine the release percentage at each stage and ensure the experimental budget is not depleted with high probability."
}