{
    "title": "Part Aware Contrastive Learning for Self-Supervised Action Recognition. (arXiv:2305.00666v1 [cs.CV])",
    "abstract": "In recent years, remarkable results have been achieved in self-supervised action recognition using skeleton sequences with contrastive learning. It has been observed that the semantic distinction of human action features is often represented by local body parts, such as legs or hands, which are advantageous for skeleton-based action recognition. This paper proposes an attention-based contrastive learning framework for skeleton representation learning, called SkeAttnCLR, which integrates local similarity and global features for skeleton-based action representations. To achieve this, a multi-head attention mask module is employed to learn the soft attention mask features from the skeletons, suppressing non-salient local features while accentuating local salient features, thereby bringing similar local features closer in the feature space. Additionally, ample contrastive pairs are generated by expanding contrastive pairs based on salient and non-salient features with global features, whic",
    "link": "http://arxiv.org/abs/2305.00666",
    "context": "Title: Part Aware Contrastive Learning for Self-Supervised Action Recognition. (arXiv:2305.00666v1 [cs.CV])\nAbstract: In recent years, remarkable results have been achieved in self-supervised action recognition using skeleton sequences with contrastive learning. It has been observed that the semantic distinction of human action features is often represented by local body parts, such as legs or hands, which are advantageous for skeleton-based action recognition. This paper proposes an attention-based contrastive learning framework for skeleton representation learning, called SkeAttnCLR, which integrates local similarity and global features for skeleton-based action representations. To achieve this, a multi-head attention mask module is employed to learn the soft attention mask features from the skeletons, suppressing non-salient local features while accentuating local salient features, thereby bringing similar local features closer in the feature space. Additionally, ample contrastive pairs are generated by expanding contrastive pairs based on salient and non-salient features with global features, whic",
    "path": "papers/23/05/2305.00666.json",
    "total_tokens": 925,
    "translated_title": "基于部件感知对比学习的自监督动作识别",
    "translated_abstract": "近年来，使用对比学习与骨骼序列在自监督动作识别方面获得了显著结果。本文提出了一种基于注意力的对比学习框架，称为SkeAttnCLR，用于骨骼表示学习。该框架将局部相似性和全局特征集成到基于骨架的动作表示中，通过多头注意力掩蔽模块学习软掩蔽特征，压制非显著部位特征同时突出显著部位特征，从而在特征空间中将相似的局部特征紧密靠近。此外，通过利用全局特征扩展显著和非显著特征的对比配对，获得了充足的对比配对。",
    "tldr": "本文提出了一个名为SkeAttnCLR的自监督学习框架，能将局部相似性与全局特征整合到骨架动作表示中。其中采用多头注意力掩蔽学习软掩蔽特征，将相似的局部特征紧密靠近。通过利用全局特征扩展对比配对，显著提高了对比学习的效果。",
    "en_tdlr": "This paper proposes a self-supervised learning framework called SkeAttnCLR for skeleton-based action recognition, which integrates local similarity and global features into action representations. By using multi-head attention mask module, SkeAttnCLR learns soft attention mask features to bring similar local features closer in the feature space. Ample contrastive pairs are generated based on salient and non-salient features with global features, significantly improving the effectiveness of contrastive learning."
}