{
    "title": "Hail Mary Pass: Contests with Stochastic Progress. (arXiv:2305.07218v1 [econ.TH])",
    "abstract": "This paper studies the equilibrium behavior in contests with stochastic progress. Participants have access to a safe action that makes progress deterministically, but they can also take risky moves that stochastically influence their progress towards the goal and thus their relative position. In the unique well-behaved Markov perfect equilibrium of this dynamic contest, the follower drops out if the leader establishes a substantial lead, but resorts to \"Hail Marys\" beforehand: no matter how low the return of the risky move is, the follower undertakes in an attempt to catch up. Moreover, if the risky move has a medium return (between high and low), the leader will also adopt it when the follower is close to dropping out - an interesting preemptive motive. We also examine the impact of such equilibrium behavior on the optimal prize allocation.",
    "link": "http://arxiv.org/abs/2305.07218",
    "context": "Title: Hail Mary Pass: Contests with Stochastic Progress. (arXiv:2305.07218v1 [econ.TH])\nAbstract: This paper studies the equilibrium behavior in contests with stochastic progress. Participants have access to a safe action that makes progress deterministically, but they can also take risky moves that stochastically influence their progress towards the goal and thus their relative position. In the unique well-behaved Markov perfect equilibrium of this dynamic contest, the follower drops out if the leader establishes a substantial lead, but resorts to \"Hail Marys\" beforehand: no matter how low the return of the risky move is, the follower undertakes in an attempt to catch up. Moreover, if the risky move has a medium return (between high and low), the leader will also adopt it when the follower is close to dropping out - an interesting preemptive motive. We also examine the impact of such equilibrium behavior on the optimal prize allocation.",
    "path": "papers/23/05/2305.07218.json",
    "total_tokens": 932,
    "translated_title": "Hail Mary Pass: 带有随机进展的竞赛",
    "translated_abstract": "本文研究了带有随机进展的竞赛中的均衡行为。参与者可以使用一个安全的行动来确定地取得进展，但他们也可以采取风险动作，来随机地影响他们朝着目标的进展和相对位置。在这个动态竞赛的独特的良好行为的马尔可夫完美均衡中，如果领导者确立了重要的领先地位，跟随者就会退出比赛，但在此之前会采取\"Hail Marys\"策略：无论风险行动的回报率有多低，跟随者都会尝试去赶上。此外，在风险行动具有中等回报率（介于高和低之间）时，当跟随者接近退出时，领导者也会采用它 - 这是一种有趣的预防动机。我们还研究了这种均衡行为对最优奖励分配的影响。",
    "tldr": "本文研究了带有随机进展的竞赛中的均衡行为。在竞赛中，领先者若确立重要的领先地位，跟随者会采取\"Hail Marys\"策略。在风险行动具有中等回报率时，领导者也会采用它来预防跟随者的退出。",
    "en_tdlr": "This paper studies equilibrium behavior in contests with stochastic progress by examining the use of risky versus safe actions. The unique well-behaved Markov perfect equilibrium shows that in a dynamic contest, the follower will use \"Hail Marys\" to catch up to the leader's substantial lead, and the leader may preemptively adopt risky actions when the follower is close to dropping out."
}