{
    "title": "Optimization's Neglected Normative Commitments. (arXiv:2305.17465v2 [cs.AI] UPDATED)",
    "abstract": "Optimization is offered as an objective approach to resolving complex, real-world decisions involving uncertainty and conflicting interests. It drives business strategies as well as public policies and, increasingly, lies at the heart of sophisticated machine learning systems. A paradigm used to approach potentially high-stakes decisions, optimization relies on abstracting the real world to a set of decision(s), objective(s) and constraint(s). Drawing from the modeling process and a range of actual cases, this paper describes the normative choices and assumptions that are necessarily part of using optimization. It then identifies six emergent problems that may be neglected: 1) Misspecified values can yield optimizations that omit certain imperatives altogether or incorporate them incorrectly as a constraint or as part of the objective, 2) Problematic decision boundaries can lead to faulty modularity assumptions and feedback loops, 3) Failing to account for multiple agents' divergent go",
    "link": "http://arxiv.org/abs/2305.17465",
    "context": "Title: Optimization's Neglected Normative Commitments. (arXiv:2305.17465v2 [cs.AI] UPDATED)\nAbstract: Optimization is offered as an objective approach to resolving complex, real-world decisions involving uncertainty and conflicting interests. It drives business strategies as well as public policies and, increasingly, lies at the heart of sophisticated machine learning systems. A paradigm used to approach potentially high-stakes decisions, optimization relies on abstracting the real world to a set of decision(s), objective(s) and constraint(s). Drawing from the modeling process and a range of actual cases, this paper describes the normative choices and assumptions that are necessarily part of using optimization. It then identifies six emergent problems that may be neglected: 1) Misspecified values can yield optimizations that omit certain imperatives altogether or incorporate them incorrectly as a constraint or as part of the objective, 2) Problematic decision boundaries can lead to faulty modularity assumptions and feedback loops, 3) Failing to account for multiple agents' divergent go",
    "path": "papers/23/05/2305.17465.json",
    "total_tokens": 851,
    "translated_title": "优化的忽视规范承诺",
    "translated_abstract": "优化被提供作为解决涉及不确定性和利益冲突的复杂实际决策的客观方法。它驱动着商业策略和公共政策，并且越来越多地成为复杂机器学习系统的核心。优化依赖于将现实世界抽象为一系列决策、目标和约束来处理可能涉及高风险的决策。本文从建模过程和一系列实际案例中提取，描述了使用优化时必然涉及的规范选择和假设。然后，它识别出可能被忽视的六个新问题：1）给定的值设置错误可能导致优化忽略某些任务，或者错误将其纳入约束或目标的一部分；2）问题的决策边界错误可能导致错误的模块化假设和反馈循环；3）未能考虑到多个代理的分歧目标可能导致冲突的结果。",
    "tldr": "本文描述了使用优化的规范选择和假设，并指出了可能被忽视的包括任务遗漏、决策边界问题以及多个代理的目标冲突在内的六个问题。"
}