{
    "title": "Enhancing Petrophysical Studies with Machine Learning: A Field Case Study on Permeability Prediction in Heterogeneous Reservoirs. (arXiv:2305.07145v1 [physics.geo-ph])",
    "abstract": "This field case study aims to address the challenge of accurately predicting petrophysical properties in heterogeneous reservoir formations, which can significantly impact reservoir performance predictions. The study employed three machine learning algorithms, namely Artificial Neural Network (ANN), Random Forest Classifier (RFC), and Support Vector Machine (SVM), to predict permeability log from conventional logs and match it with core data. The primary objective of this study was to compare the effectiveness of the three machine learning algorithms in predicting permeability and determine the optimal prediction method. The study utilized the Flow Zone Indicator (FZI) rock typing technique to understand the factors influencing reservoir quality. The findings will be used to improve reservoir simulation and locate future wells more accurately. The study concluded that the FZI approach and machine learning algorithms are effective in predicting permeability log and improving reservoir p",
    "link": "http://arxiv.org/abs/2305.07145",
    "context": "Title: Enhancing Petrophysical Studies with Machine Learning: A Field Case Study on Permeability Prediction in Heterogeneous Reservoirs. (arXiv:2305.07145v1 [physics.geo-ph])\nAbstract: This field case study aims to address the challenge of accurately predicting petrophysical properties in heterogeneous reservoir formations, which can significantly impact reservoir performance predictions. The study employed three machine learning algorithms, namely Artificial Neural Network (ANN), Random Forest Classifier (RFC), and Support Vector Machine (SVM), to predict permeability log from conventional logs and match it with core data. The primary objective of this study was to compare the effectiveness of the three machine learning algorithms in predicting permeability and determine the optimal prediction method. The study utilized the Flow Zone Indicator (FZI) rock typing technique to understand the factors influencing reservoir quality. The findings will be used to improve reservoir simulation and locate future wells more accurately. The study concluded that the FZI approach and machine learning algorithms are effective in predicting permeability log and improving reservoir p",
    "path": "papers/23/05/2305.07145.json",
    "total_tokens": 950,
    "translated_title": "机器学习在岩石物理研究中的应用：异质储层渗透率预测实例研究",
    "translated_abstract": "本研究旨在解决异质储层地层中准确预测岩石物理性质的挑战，该问题会严重影响储层性能预测。该研究采用了三种机器学习算法，即人工神经网络（ANN）、随机森林分类器（RFC）和支持向量机（SVM），以预测常规测井数据中的渗透率曲线，并将其与岩心数据相匹配。本研究的主要目的是比较三种机器学习算法在预测渗透率方面的有效性，并确定最佳的预测方法。该研究利用流动区带指数（FZI）岩石分类技术来了解影响储集层质量的因素。研究结果将用于改进储层模拟，更精确地定位未来的井位。研究得出结论，FZI方法和机器学习算法在预测渗透率曲线和改善储层预测方面是有效的。",
    "tldr": "本实例研究利用机器学习算法中的ANN、RFC和SVM预测渗透率曲线，并将其与岩心数据相匹配，结果表明FZI方法和机器学习算法在改善储层预测方面是有效的。",
    "en_tdlr": "This case study uses machine learning algorithms, including ANN, RFC, and SVM, to predict permeability log from conventional logs and match it with core data, and concluded that the FZI approach and machine learning algorithms are effective in improving reservoir prediction."
}