{
    "title": "Contextual Reasoning for Scene Generation (Technical Report). (arXiv:2305.02255v1 [cs.AI])",
    "abstract": "We present a continuation to our previous work, in which we developed the MR-CKR framework to reason with knowledge overriding across contexts organized in multi-relational hierarchies. Reasoning is realized via ASP with algebraic measures, allowing for flexible definitions of preferences. In this paper, we show how to apply our theoretical work to real autonomous-vehicle scene data. Goal of this work is to apply MR-CKR to the problem of generating challenging scenes for autonomous vehicle learning. In practice, most of the scene data for AV learning models common situations, thus it might be difficult to capture cases where a particular situation occurs (e.g. partial occlusions of a crossing pedestrian). The MR-CKR model allows for data organization exploiting the multi-dimensionality of such data (e.g., temporal and spatial). Reasoning over multiple contexts enables the verification and configuration of scenes, using the combination of different scene ontologies. We describe a framew",
    "link": "http://arxiv.org/abs/2305.02255",
    "context": "Title: Contextual Reasoning for Scene Generation (Technical Report). (arXiv:2305.02255v1 [cs.AI])\nAbstract: We present a continuation to our previous work, in which we developed the MR-CKR framework to reason with knowledge overriding across contexts organized in multi-relational hierarchies. Reasoning is realized via ASP with algebraic measures, allowing for flexible definitions of preferences. In this paper, we show how to apply our theoretical work to real autonomous-vehicle scene data. Goal of this work is to apply MR-CKR to the problem of generating challenging scenes for autonomous vehicle learning. In practice, most of the scene data for AV learning models common situations, thus it might be difficult to capture cases where a particular situation occurs (e.g. partial occlusions of a crossing pedestrian). The MR-CKR model allows for data organization exploiting the multi-dimensionality of such data (e.g., temporal and spatial). Reasoning over multiple contexts enables the verification and configuration of scenes, using the combination of different scene ontologies. We describe a framew",
    "path": "papers/23/05/2305.02255.json",
    "total_tokens": 1065,
    "translated_title": "场景生成的情境推理（技术报告）",
    "translated_abstract": "本文是我们先前工作的延续，在该工作中，我们开发了MR-CKR框架，用于跨上下文组织的多关系层次中的知识覆盖推理。 推理通过具有代数度量的ASP实现，允许对偏好进行灵活的定义。在本文中，我们展示了如何将我们的理论工作应用于真实的自主车辆场景数据。该工作的目标是将MR-CKR应用于自主车辆学习中生成具有挑战性的场景问题。实际上，用于AV学习模型的大部分场景数据涵盖了常见情况，因此难以捕捉特定情况发生的情况（例如，行人横穿时的部分遮挡）。MR-CKR模型允许利用此类数据的多维性进行数据组织（例如，时间和空间）。在多个背景下进行推理，可以使用不同场景本体的组合验证和配置场景。我们描述了一个将MR-CKR模型集成到AV场景生成的数据处理管道中的框架。实验表明，我们的框架可以有效生成多样化和具有挑战性的场景，为提高自主车辆安全导航的培训提供了有希望的解决方案。",
    "tldr": "本文展示了如何将MR-CKR框架应用于真实的自主车辆场景数据，以生成具有挑战性的场景问题。实验表明，我们的框架可以有效生成多样化和具有挑战性的场景，为提高自主车辆安全导航的培训提供了有希望的解决方案。",
    "en_tdlr": "This paper demonstrates how to apply the MR-CKR framework to real autonomous-vehicle scene data to generate challenging scenes for autonomous vehicle learning. The experiments show that the framework can efficiently generate diverse and challenging scenes, providing a promising solution to enhance the training of autonomous vehicles for safer navigation."
}