{
    "title": "Integrated multi-operand optical neurons for scalable and hardware-efficient deep learning. (arXiv:2305.19592v1 [physics.optics])",
    "abstract": "The optical neural network (ONN) is a promising hardware platform for next-generation neuromorphic computing due to its high parallelism, low latency, and low energy consumption. However, previous integrated photonic tensor cores (PTCs) consume numerous single-operand optical modulators for signal and weight encoding, leading to large area costs and high propagation loss to implement large tensor operations. This work proposes a scalable and efficient optical dot-product engine based on customized multi-operand photonic devices, namely multi-operand optical neurons (MOON). We experimentally demonstrate the utility of a MOON using a multi-operand-Mach-Zehnder-interferometer (MOMZI) in image recognition tasks. Specifically, our MOMZI-based ONN achieves a measured accuracy of 85.89% in the street view house number (SVHN) recognition dataset with 4-bit voltage control precision. Furthermore, our performance analysis reveals that a 128x128 MOMZI-based PTCs outperform their counterparts base",
    "link": "http://arxiv.org/abs/2305.19592",
    "context": "Title: Integrated multi-operand optical neurons for scalable and hardware-efficient deep learning. (arXiv:2305.19592v1 [physics.optics])\nAbstract: The optical neural network (ONN) is a promising hardware platform for next-generation neuromorphic computing due to its high parallelism, low latency, and low energy consumption. However, previous integrated photonic tensor cores (PTCs) consume numerous single-operand optical modulators for signal and weight encoding, leading to large area costs and high propagation loss to implement large tensor operations. This work proposes a scalable and efficient optical dot-product engine based on customized multi-operand photonic devices, namely multi-operand optical neurons (MOON). We experimentally demonstrate the utility of a MOON using a multi-operand-Mach-Zehnder-interferometer (MOMZI) in image recognition tasks. Specifically, our MOMZI-based ONN achieves a measured accuracy of 85.89% in the street view house number (SVHN) recognition dataset with 4-bit voltage control precision. Furthermore, our performance analysis reveals that a 128x128 MOMZI-based PTCs outperform their counterparts base",
    "path": "papers/23/05/2305.19592.json",
    "total_tokens": 1007,
    "translated_title": "可扩展且高效的深度学习光学神经元 多操作数光学神经元",
    "translated_abstract": "光神经网络（ONN）是下一代神经形态计算的有前途硬件平台，基于单值操作的光学非常数核（PTC）会占用大量单操作数光调制器用于信号和权重编码，导致较大的区域成本和高传播损耗以实现大型张量操作。本研究提出了基于定制的多操作数光学器件的可扩展和高效光点积引擎，即多操作数光学神经元（MOON）。我们在图像识别任务中使用多操作数马赫–泽德干干涉仪（MOMZI）实验演示了MOON的效用。具体而言，我们的基于MOMZI的ONN在4位电压控制精度下在街景房屋数字（SVHN）识别数据集中实现了85.89%的测量精度。此外，我们的性能分析显示，128x128的基于MOMZI的PTCs优于基于单值光调制器的对应物。",
    "tldr": "本文提出了一种使用定制的多操作数光学器件的可扩展和高效光点积引擎，即多操作数光学神经元（MOON），并在图像识别任务中证明了其实用性。在SVHN识别数据集上，该MOON实现了85.89％的测量精度，性能逊于128x128的基于MOMZI的PTCs。"
}