{
    "title": "A Semi-Automated Corner Case Detection and Evaluation Pipeline. (arXiv:2305.16369v1 [cs.CV])",
    "abstract": "In order to deploy automated vehicles to the public, it has to be proven that the vehicle can safely and robustly handle traffic in many different scenarios. One important component of automated vehicles is the perception system that captures and processes the environment around the vehicle. Perception systems require large datasets for training their deep neural network. Knowing which parts of the data in these datasets describe a corner case is an advantage during training or testing of the network. These corner cases describe situations that are rare and potentially challenging for the network. We propose a pipeline that converts collective expert knowledge descriptions into the extended KI Absicherung ontology. The ontology is used to describe scenes and scenarios that can be mapped to perception datasets. The corner cases can then be extracted from the datasets. In addition, the pipeline enables the evaluation of the detection networks against the extracted corner cases to measure",
    "link": "http://arxiv.org/abs/2305.16369",
    "context": "Title: A Semi-Automated Corner Case Detection and Evaluation Pipeline. (arXiv:2305.16369v1 [cs.CV])\nAbstract: In order to deploy automated vehicles to the public, it has to be proven that the vehicle can safely and robustly handle traffic in many different scenarios. One important component of automated vehicles is the perception system that captures and processes the environment around the vehicle. Perception systems require large datasets for training their deep neural network. Knowing which parts of the data in these datasets describe a corner case is an advantage during training or testing of the network. These corner cases describe situations that are rare and potentially challenging for the network. We propose a pipeline that converts collective expert knowledge descriptions into the extended KI Absicherung ontology. The ontology is used to describe scenes and scenarios that can be mapped to perception datasets. The corner cases can then be extracted from the datasets. In addition, the pipeline enables the evaluation of the detection networks against the extracted corner cases to measure",
    "path": "papers/23/05/2305.16369.json",
    "total_tokens": 849,
    "translated_title": "一种半自动化角落情况检测和评估流程",
    "translated_abstract": "为了让自动驾驶车辆投入公共使用，必须证明车辆能够在许多不同情况下安全、可靠地处理交通。自动驾驶车辆的重要组成部分之一是捕捉和处理车辆周围环境的感知系统。感知系统需要大量数据集来训练其深度神经网络。在这些数据集中了解哪些数据部分描述了一个角落情况，在网络的训练或测试过程中具有优势。这些角落情况描述了罕见且对网络具有挑战性的情况。我们提出了一种将集体专家知识描述转换为扩展KI Absicherung本体论的流程。该本体论用于描述可映射到感知数据集的场景和情况。然后可以从数据集中提取角落情况。此外，该流程还使得可以对检测网络针对提取的角落情况进行评估以进行测量。",
    "tldr": "该论文提出了一种半自动化的流程，将集体专家知识描述转换为本体论，实现了从数据集中提取角落情况和对网络进行评估的目的。",
    "en_tdlr": "This paper proposes a semi-automated pipeline that converts collective expert knowledge descriptions into the extended KI Absicherung ontology, enabling the extraction of corner cases from datasets and evaluation of detection networks against the extracted cases."
}