{
    "title": "MD3: The Multi-Dialect Dataset of Dialogues. (arXiv:2305.11355v1 [cs.CL])",
    "abstract": "We introduce a new dataset of conversational speech representing English from India, Nigeria, and the United States. The Multi-Dialect Dataset of Dialogues (MD3) strikes a new balance between open-ended conversational speech and task-oriented dialogue by prompting participants to perform a series of short information-sharing tasks. This facilitates quantitative cross-dialectal comparison, while avoiding the imposition of a restrictive task structure that might inhibit the expression of dialect features. Preliminary analysis of the dataset reveals significant differences in syntax and in the use of discourse markers. The dataset, which will be made publicly available with the publication of this paper, includes more than 20 hours of audio and more than 200,000 orthographically-transcribed tokens.",
    "link": "http://arxiv.org/abs/2305.11355",
    "context": "Title: MD3: The Multi-Dialect Dataset of Dialogues. (arXiv:2305.11355v1 [cs.CL])\nAbstract: We introduce a new dataset of conversational speech representing English from India, Nigeria, and the United States. The Multi-Dialect Dataset of Dialogues (MD3) strikes a new balance between open-ended conversational speech and task-oriented dialogue by prompting participants to perform a series of short information-sharing tasks. This facilitates quantitative cross-dialectal comparison, while avoiding the imposition of a restrictive task structure that might inhibit the expression of dialect features. Preliminary analysis of the dataset reveals significant differences in syntax and in the use of discourse markers. The dataset, which will be made publicly available with the publication of this paper, includes more than 20 hours of audio and more than 200,000 orthographically-transcribed tokens.",
    "path": "papers/23/05/2305.11355.json",
    "total_tokens": 799,
    "translated_title": "MD3: 一个多方言对话数据集",
    "translated_abstract": "我们介绍了一个新的对话语音数据集，包含来自印度、尼日利亚和美国的英语方言。多方言对话数据集（MD3）通过提示参与者执行一系列短信息共享任务，实现了开放对话语音和面向任务的对话之间的新平衡。这有助于定量的跨方言比较，同时避免了对抑制方言特征表达的限制性任务结构的强加。对数据集的初步分析显示，不同方言在句法和语篇标记的使用上存在显著差异。数据集将随着本文的发表而公开发布，包括超过20个小时的音频和超过200,000个拼写转录标记。",
    "tldr": "MD3是一个新的多方言对话数据集，包含来自印度、尼日利亚和美国的英语方言，通过提示参与者执行信息共享任务实现了开放对话语音和面向任务的对话之间的平衡。研究发现了不同方言在句法和语篇标记的使用上的显著差异。",
    "en_tdlr": "MD3 is a new multi-dialect dataset of conversational speech comprising English from India, Nigeria, and the United States, striking a balance between open-ended conversational speech and task-oriented dialogue by prompting participants to perform short information-sharing tasks, revealing significant differences in syntax and discourse markers across dialects."
}