{
    "title": "NL2TL: Transforming Natural Languages to Temporal Logics using Large Language Models. (arXiv:2305.07766v1 [cs.CL])",
    "abstract": "Temporal Logic (TL) can be used to rigorously specify complex high-level specification for systems in many engineering applications. The translation between natural language (NL) and TL has been under-explored due to the lack of dataset and generalizable model across different application domains. In this paper, we propose an accurate and generalizable transformation framework of English instructions from NL to TL, exploring the use of Large Language Models (LLMs) at multiple stages. Our contributions are twofold. First, we develop a framework to create a dataset of NL-TL pairs combining LLMs and human annotation. We publish a dataset with 28K NL-TL pairs. Then, we finetune T5 models on the lifted versions (i.e., the specific Atomic Propositions (AP) are hidden) of the NL and TL. The enhanced generalizability originates from two aspects: 1) Usage of lifted NL-TL characterizes common logical structures, without constraints of specific domains. 2) Application of LLMs in dataset creation ",
    "link": "http://arxiv.org/abs/2305.07766",
    "context": "Title: NL2TL: Transforming Natural Languages to Temporal Logics using Large Language Models. (arXiv:2305.07766v1 [cs.CL])\nAbstract: Temporal Logic (TL) can be used to rigorously specify complex high-level specification for systems in many engineering applications. The translation between natural language (NL) and TL has been under-explored due to the lack of dataset and generalizable model across different application domains. In this paper, we propose an accurate and generalizable transformation framework of English instructions from NL to TL, exploring the use of Large Language Models (LLMs) at multiple stages. Our contributions are twofold. First, we develop a framework to create a dataset of NL-TL pairs combining LLMs and human annotation. We publish a dataset with 28K NL-TL pairs. Then, we finetune T5 models on the lifted versions (i.e., the specific Atomic Propositions (AP) are hidden) of the NL and TL. The enhanced generalizability originates from two aspects: 1) Usage of lifted NL-TL characterizes common logical structures, without constraints of specific domains. 2) Application of LLMs in dataset creation ",
    "path": "papers/23/05/2305.07766.json",
    "total_tokens": 952,
    "translated_title": "NL2TL：使用大型语言模型将自然语言转化为时态逻辑",
    "translated_abstract": "时态逻辑（TL）可用于在许多工程应用中严格指定复杂的高级系统规范。由于缺乏跨不同应用领域的数据集和可推广的模型，自然语言（NL）和TL之间的转换一直未被充分探索。在本文中，我们提出了一个准确且具有普适性的英文指令从NL到TL的转换框架，并探索了在多个阶段使用大型语言模型（LLMs）的方法。我们的贡献有两个方面。首先，我们开发了一个框架来创建NL-TL对数据集，结合了LLMs和人工注释。我们发布了一个具有28K个NL-TL对的数据集。然后，我们在NL和TL的提升版本上微调了T5模型（即，特定原子命题（AP）被隐藏）。增强的普适性源自两个方面：1）使用提升的NL-TL表征常见的逻辑结构，没有特定领域的约束。2）在数据集创建中应用LLMs。",
    "tldr": "本研究提出了一种NL到TL的转换框架，使用大型语言模型在数据集和模型训练中，可以准确并且具有普适性地转换复杂的高级系统规范。",
    "en_tdlr": "This paper proposes a transformation framework from natural language to temporal logic, using Large Language Models (LLMs) at different stages, and creates a dataset of 28K NL-TL pairs for training. The framework is accurate and generalizable, with lifted NL-TL for common logical structures and LLMs for dataset creation."
}