{
    "title": "Reproducibility analysis of automated deep learning based localisation of mandibular canals on a temporal CBCT dataset. (arXiv:2305.14385v1 [physics.med-ph])",
    "abstract": "Preoperative radiological identification of mandibular canals is essential for maxillofacial surgery. This study demonstrates the reproducibility of a deep learning system (DLS) by evaluating its localisation performance on 165 heterogeneous cone beam computed tomography (CBCT) scans from 72 patients in comparison to an experienced radiologist's annotations. We evaluated the performance of the DLS using the symmetric mean curve distance (SMCD), the average symmetric surface distance (ASSD), and the Dice similarity coefficient (DSC). The reproducibility of the SMCD was assessed using the within-subject coefficient of repeatability (RC). Three other experts rated the diagnostic validity twice using a 0-4 Likert scale. The reproducibility of the Likert scoring was assessed using the repeatability measure (RM). The RC of SMCD was 0.969 mm, the median (interquartile range) SMCD and ASSD were 0.643 (0.186) mm and 0.351 (0.135) mm, respectively, and the mean (standard deviation) DSC was 0.548",
    "link": "http://arxiv.org/abs/2305.14385",
    "context": "Title: Reproducibility analysis of automated deep learning based localisation of mandibular canals on a temporal CBCT dataset. (arXiv:2305.14385v1 [physics.med-ph])\nAbstract: Preoperative radiological identification of mandibular canals is essential for maxillofacial surgery. This study demonstrates the reproducibility of a deep learning system (DLS) by evaluating its localisation performance on 165 heterogeneous cone beam computed tomography (CBCT) scans from 72 patients in comparison to an experienced radiologist's annotations. We evaluated the performance of the DLS using the symmetric mean curve distance (SMCD), the average symmetric surface distance (ASSD), and the Dice similarity coefficient (DSC). The reproducibility of the SMCD was assessed using the within-subject coefficient of repeatability (RC). Three other experts rated the diagnostic validity twice using a 0-4 Likert scale. The reproducibility of the Likert scoring was assessed using the repeatability measure (RM). The RC of SMCD was 0.969 mm, the median (interquartile range) SMCD and ASSD were 0.643 (0.186) mm and 0.351 (0.135) mm, respectively, and the mean (standard deviation) DSC was 0.548",
    "path": "papers/23/05/2305.14385.json",
    "total_tokens": 939,
    "translated_title": "基于深度学习的下颌管自动定位在CBCT数据集中的可复现性分析",
    "translated_abstract": "术前放射学识别下颌管对于口腔颌面外科手术至关重要。本研究通过评估深度学习系统（DLS）在165个不同样本的锥形束计算机体层摄影（CBCT）扫描中的定位表现，并与经验丰富的放射科医师注释进行比较，证明了DLS的可重复性。我们使用对称平均曲线距离（SMCD）、平均对称表面距离（ASSD）和Dice相似系数（DSC）来评估DLS的表现。另外，三个专家评分两次使用0-4 Likert量表评估诊断有效性。评估了Likert评分的重复性。SMCD的RC为0.969毫米，中位数（四分位距）的SMCD和ASSD分别为0.643（0.186）毫米和0.351（0.135）毫米，平均（标准差）的DSC为0.548。",
    "tldr": "本研究评估了一种深度学习系统自动识别CBCT扫描中下颌管的定位表现，在165个不同样本中的表现表明了其可重复性和准确度。",
    "en_tdlr": "This study evaluates the performance of a deep learning system in automatically identifying the localization of mandibular canals in CBCT scans, demonstrating its reproducibility and accuracy in 165 heterogeneous samples."
}