{
    "title": "Smart Policy Control for Securing Federated Learning Management System. (arXiv:2305.09134v1 [cs.CR])",
    "abstract": "The widespread adoption of Internet of Things (IoT) devices in smart cities, intelligent healthcare systems, and various real-world applications have resulted in the generation of vast amounts of data, often analyzed using different Machine Learning (ML) models. Federated learning (FL) has been acknowledged as a privacy-preserving machine learning technology, where multiple parties cooperatively train ML models without exchanging raw data. However, the current FL architecture does not allow for an audit of the training process due to the various data-protection policies implemented by each FL participant. Furthermore, there is no global model verifiability available in the current architecture. This paper proposes a smart contract-based policy control for securing the Federated Learning (FL) management system. First, we develop and deploy a smart contract-based local training policy control on the FL participants' side. This policy control is used to verify the training process, ensuri",
    "link": "http://arxiv.org/abs/2305.09134",
    "context": "Title: Smart Policy Control for Securing Federated Learning Management System. (arXiv:2305.09134v1 [cs.CR])\nAbstract: The widespread adoption of Internet of Things (IoT) devices in smart cities, intelligent healthcare systems, and various real-world applications have resulted in the generation of vast amounts of data, often analyzed using different Machine Learning (ML) models. Federated learning (FL) has been acknowledged as a privacy-preserving machine learning technology, where multiple parties cooperatively train ML models without exchanging raw data. However, the current FL architecture does not allow for an audit of the training process due to the various data-protection policies implemented by each FL participant. Furthermore, there is no global model verifiability available in the current architecture. This paper proposes a smart contract-based policy control for securing the Federated Learning (FL) management system. First, we develop and deploy a smart contract-based local training policy control on the FL participants' side. This policy control is used to verify the training process, ensuri",
    "path": "papers/23/05/2305.09134.json",
    "total_tokens": 895,
    "translated_title": "保障联合学习管理系统安全的智能策略控制",
    "translated_abstract": "物联网设备在智慧城市、智能医疗系统和其他实际应用中的广泛应用导致了大量数据的生成，常常使用不同的机器学习模型进行分析。联合学习（FL）被认为是一种保护隐私的机器学习技术，在不共享原始数据的情况下多个参与者合作训练机器学习模型。然而，由于每个FL参与者实施了各种数据保护政策，当前的FL架构不允许对训练过程进行审计。另外，当前架构中没有全局模型可验证性。本文提出了基于智能合约的策略控制来保障FL管理系统的安全。首先，我们在FL参与者侧开发和部署基于智能合约的本地训练策略控制。这个策略控制被用来验证训练过程，确保每个FL参与者都遵守数据保护政策，从而实现FL管理系统的安全性。",
    "tldr": "本文提出了一种基于智能合约的策略控制，可以保障联合学习管理系统的安全性，确保每个参与者都遵守数据保护政策，同时可以审计训练过程。",
    "en_tdlr": "This paper proposes a smart contract-based policy control to ensure the security of the Federated Learning management system by verifying the training process, enforcing data protection policies, and enabling auditability, while preserving the privacy of the participants."
}