{
    "title": "A CSI Dataset for Wireless Human Sensing on 80 MHz Wi-Fi Channels. (arXiv:2305.03170v1 [eess.SP])",
    "abstract": "In the last years, several machine learning-based techniques have been proposed to monitor human movements from Wi-Fi channel readings. However, the development of domain-adaptive algorithms that robustly work across different environments is still an open problem, whose solution requires large datasets characterized by strong domain diversity, in terms of environments, persons and Wi-Fi hardware. To date, the few public datasets available are mostly obsolete - as obtained via Wi-Fi devices operating on 20 or 40 MHz bands - and contain little or no domain diversity, thus dramatically limiting the advancements in the design of sensing algorithms. The present contribution aims to fill this gap by providing a dataset of IEEE 802.11ac channel measurements over an 80 MHz bandwidth channel featuring notable domain diversity, through measurement campaigns that involved thirteen subjects across different environments, days, and with different hardware. Novel experimental data is provided by bl",
    "link": "http://arxiv.org/abs/2305.03170",
    "context": "Title: A CSI Dataset for Wireless Human Sensing on 80 MHz Wi-Fi Channels. (arXiv:2305.03170v1 [eess.SP])\nAbstract: In the last years, several machine learning-based techniques have been proposed to monitor human movements from Wi-Fi channel readings. However, the development of domain-adaptive algorithms that robustly work across different environments is still an open problem, whose solution requires large datasets characterized by strong domain diversity, in terms of environments, persons and Wi-Fi hardware. To date, the few public datasets available are mostly obsolete - as obtained via Wi-Fi devices operating on 20 or 40 MHz bands - and contain little or no domain diversity, thus dramatically limiting the advancements in the design of sensing algorithms. The present contribution aims to fill this gap by providing a dataset of IEEE 802.11ac channel measurements over an 80 MHz bandwidth channel featuring notable domain diversity, through measurement campaigns that involved thirteen subjects across different environments, days, and with different hardware. Novel experimental data is provided by bl",
    "path": "papers/23/05/2305.03170.json",
    "total_tokens": 865,
    "translated_title": "80 MHz Wi-Fi信道上的无线人体感应CSI数据集",
    "translated_abstract": "在过去的几年中，已经提出了几种基于机器学习的技术来监测从Wi-Fi信道读数的人类动作。然而，开发稳健地在不同环境下工作的领域自适应算法仍然是一个开放的问题，其解决方案需要大规模的数据集，这些数据集具有强大的领域多样性，包括环境、人员和Wi-Fi硬件。迄今为止，少数公共数据集大多已经过时 - 因为是通过20或40 MHz频段运作的Wi-Fi设备得到的 - 并且几乎没有领域多样性，从而极大地限制了传感算法设计的进展。本文旨在通过提供一个IEEE 802.11ac信道测量的数据集来填补这一差距，在80 MHz带宽信道上具有显着的领域多样性，通过涉及不同环境、日子和不同硬件的十三个主题的测量活动提供新的实验数据。",
    "tldr": "该文提出了一个CSI数据集，提供了80MHz Wi-fi信道上与环境、人员和Wi-Fi硬件相关的数据，这为开发领域自适应算法提供了重要支持。"
}