{
    "title": "Private Meeting Summarization Without Performance Loss. (arXiv:2305.15894v1 [cs.CL])",
    "abstract": "Meeting summarization has an enormous business potential, but in addition to being a hard problem, roll-out is challenged by privacy concerns. We explore the problem of meeting summarization under differential privacy constraints and find, to our surprise, that while differential privacy leads to slightly lower performance on in-sample data, differential privacy improves performance when evaluated on unseen meeting types. Since meeting summarization systems will encounter a great variety of meeting types in practical employment scenarios, this observation makes safe meeting summarization seem much more feasible. We perform extensive error analysis and identify potential risks in meeting summarization under differential privacy, including a faithfulness analysis.",
    "link": "http://arxiv.org/abs/2305.15894",
    "context": "Title: Private Meeting Summarization Without Performance Loss. (arXiv:2305.15894v1 [cs.CL])\nAbstract: Meeting summarization has an enormous business potential, but in addition to being a hard problem, roll-out is challenged by privacy concerns. We explore the problem of meeting summarization under differential privacy constraints and find, to our surprise, that while differential privacy leads to slightly lower performance on in-sample data, differential privacy improves performance when evaluated on unseen meeting types. Since meeting summarization systems will encounter a great variety of meeting types in practical employment scenarios, this observation makes safe meeting summarization seem much more feasible. We perform extensive error analysis and identify potential risks in meeting summarization under differential privacy, including a faithfulness analysis.",
    "path": "papers/23/05/2305.15894.json",
    "total_tokens": 766,
    "translated_title": "不损失性能的私人会议摘要",
    "translated_abstract": "会议摘要具有巨大的商业潜力，但除了是难题外，隐私问题也是一个挑战。我们探讨了在差分隐私约束下的会议摘要问题，并惊讶地发现，虽然差分隐私会导致样本内数据的性能略有降低，但在未见过的会议类型上评估时，差分隐私会提高性能。由于在实际应用场景中，会议摘要系统将遇到各种各样的会议类型，这一发现使得安全的会议摘要似乎更加可行。我们进行了广泛的误差分析，并识别了在差分隐私下进行会议摘要的潜在风险，包括忠实度分析。",
    "tldr": "本文研究了在差分隐私约束下的会议摘要问题，发现差分隐私虽然会稍微降低性能，但在评估未见过的会议类型时却能提高性能，这一发现使得安全的会议摘要更加可行。",
    "en_tdlr": "This paper explores the problem of meeting summarization under differential privacy constraints and finds that although differential privacy leads to slightly lower performance on in-sample data, it improves performance when evaluated on unseen meeting types, making safe meeting summarization seem more feasible."
}