{
    "title": "COWPEA (Candidates Optimally Weighted in Proportional Election using Approval voting). (arXiv:2305.08857v1 [econ.TH])",
    "abstract": "This paper describes a new method of proportional representation that uses approval voting, known as COWPEA (Candidates Optimally Weighted in Proportional Election using Approval voting). COWPEA optimally elects an unlimited number of candidates with potentially different weights to a body, rather than giving a fixed number equal weight. A version that elects a fixed a number of candidates with equal weight does exist, but it is non-deterministic, and is known as COWPEA Lottery. This is the only proportional method known to pass monotonicity, Independence of Irrelevant Ballots, and the Universally Liked Candidate criterion. There are also ways to convert COWPEA and COWPEA Lottery to a score or graded voting method.",
    "link": "http://arxiv.org/abs/2305.08857",
    "context": "Title: COWPEA (Candidates Optimally Weighted in Proportional Election using Approval voting). (arXiv:2305.08857v1 [econ.TH])\nAbstract: This paper describes a new method of proportional representation that uses approval voting, known as COWPEA (Candidates Optimally Weighted in Proportional Election using Approval voting). COWPEA optimally elects an unlimited number of candidates with potentially different weights to a body, rather than giving a fixed number equal weight. A version that elects a fixed a number of candidates with equal weight does exist, but it is non-deterministic, and is known as COWPEA Lottery. This is the only proportional method known to pass monotonicity, Independence of Irrelevant Ballots, and the Universally Liked Candidate criterion. There are also ways to convert COWPEA and COWPEA Lottery to a score or graded voting method.",
    "path": "papers/23/05/2305.08857.json",
    "total_tokens": 784,
    "translated_title": "COWPEA（候选人按比例使用赞成投票进行最优加权）：一种新的比例代表方法",
    "translated_abstract": "本文描述了一种使用赞成投票的比例代表新方法，称为COWPEA（候选人按比例使用赞成投票进行最优加权）。COWPEA在选择一定数量的候选人时，可以根据其不同的权重进行最优选举，而不是只给予固定数量相同的权重。COWPEA Lottery 是一个不确定性的版本，可以选择一定数量的候选人，并使它们拥有相等的权重。COWPEA是唯一已知通过单调性、与无关选票和普遍喜欢的候选人标准的比例方法。同时，也有方法可以将COWPEA和COWPEA Lottery转换为分数或分级投票方法。",
    "tldr": "本文提出了一种新的比例代表方法，COWPEA，可根据候选人不同的权重进行最优选举，并可转换为分数或分级投票方法。",
    "en_tdlr": "This paper introduces a new proportional representation method, called COWPEA, which can optimally elect candidates with different weights and can be converted to a score or graded voting method. COWPEA is the only known proportional method that passes monotonicity, Independence of Irrelevant Ballots, and the Universally Liked Candidate criterion."
}