{
    "title": "Data-Driven Games in Computational Mechanics. (arXiv:2305.19279v1 [cs.CE])",
    "abstract": "We resort to game theory in order to formulate Data-Driven methods for solid mechanics in which stress and strain players pursue different objectives. The objective of the stress player is to minimize the discrepancy to a material data set, whereas the objective of the strain player is to ensure the admissibility of the mechanical state, in the sense of compatibility and equilibrium. We show that, unlike the cooperative Data-Driven games proposed in the past, the new non-cooperative Data-Driven games identify an effective material law from the data and reduce to conventional displacement boundary-value problems, which facilitates their practical implementation. However, unlike supervised machine learning methods, the proposed non-cooperative Data-Driven games are unsupervised, ansatz-free and parameter-free. In particular, the effective material law is learned from the data directly, without recourse to regression to a parameterized class of functions such as neural networks. We presen",
    "link": "http://arxiv.org/abs/2305.19279",
    "context": "Title: Data-Driven Games in Computational Mechanics. (arXiv:2305.19279v1 [cs.CE])\nAbstract: We resort to game theory in order to formulate Data-Driven methods for solid mechanics in which stress and strain players pursue different objectives. The objective of the stress player is to minimize the discrepancy to a material data set, whereas the objective of the strain player is to ensure the admissibility of the mechanical state, in the sense of compatibility and equilibrium. We show that, unlike the cooperative Data-Driven games proposed in the past, the new non-cooperative Data-Driven games identify an effective material law from the data and reduce to conventional displacement boundary-value problems, which facilitates their practical implementation. However, unlike supervised machine learning methods, the proposed non-cooperative Data-Driven games are unsupervised, ansatz-free and parameter-free. In particular, the effective material law is learned from the data directly, without recourse to regression to a parameterized class of functions such as neural networks. We presen",
    "path": "papers/23/05/2305.19279.json",
    "total_tokens": 822,
    "translated_title": "计算力学中的数据驱动游戏",
    "translated_abstract": "我们采用博弈论来构建数据驱动的实体力学方法，其中应力和应变玩家追求不同的目标。应力玩家的目标是将其与材料数据集的差异最小化，而应变玩家的目标是确保机械状态的可允许性，即相容性和平衡性。与过去提出的合作数据驱动游戏不同，我们展示了这些新型的非合作数据驱动游戏可以从数据中确定有效的材料定律，并简化为传统位移边界值问题，这有助于实际实施。提出的非合作数据驱动游戏与监督式机器学习方法不同，它没有假设和参数，特别是有效的材料定律是直接从数据中学习的，而无需回归到神经网络等参数化函数类。",
    "tldr": "本文提出了一种新型的非合作数据驱动游戏，其可以从数据中确定有效的材料定律，简化实际实施，并且与监督式机器学习方法不同，没有假设和参数。",
    "en_tdlr": "This paper proposes a new type of non-cooperative data-driven game in solid mechanics, which can identify an effective material law from data and simplify practical implementation. Unlike supervised machine learning methods, it does not require assumptions or parameters."
}