{
    "title": "Appliance Detection Using Very Low-Frequency Smart Meter Time Series. (arXiv:2305.10352v1 [eess.SP])",
    "abstract": "In recent years, smart meters have been widely adopted by electricity suppliers to improve the management of the smart grid system. These meters usually collect energy consumption data at a very low frequency (every 30min), enabling utilities to bill customers more accurately. To provide more personalized recommendations, the next step is to detect the appliances owned by customers, which is a challenging problem, due to the very-low meter reading frequency. Even though the appliance detection problem can be cast as a time series classification problem, with many such classifiers having been proposed in the literature, no study has applied and compared them on this specific problem. This paper presents an in-depth evaluation and comparison of state-of-the-art time series classifiers applied to detecting the presence/absence of diverse appliances in very low-frequency smart meter data. We report results with five real datasets. We first study the impact of the detection quality of 13 di",
    "link": "http://arxiv.org/abs/2305.10352",
    "context": "Title: Appliance Detection Using Very Low-Frequency Smart Meter Time Series. (arXiv:2305.10352v1 [eess.SP])\nAbstract: In recent years, smart meters have been widely adopted by electricity suppliers to improve the management of the smart grid system. These meters usually collect energy consumption data at a very low frequency (every 30min), enabling utilities to bill customers more accurately. To provide more personalized recommendations, the next step is to detect the appliances owned by customers, which is a challenging problem, due to the very-low meter reading frequency. Even though the appliance detection problem can be cast as a time series classification problem, with many such classifiers having been proposed in the literature, no study has applied and compared them on this specific problem. This paper presents an in-depth evaluation and comparison of state-of-the-art time series classifiers applied to detecting the presence/absence of diverse appliances in very low-frequency smart meter data. We report results with five real datasets. We first study the impact of the detection quality of 13 di",
    "path": "papers/23/05/2305.10352.json",
    "total_tokens": 850,
    "translated_title": "采用极低频智能电表时间序列进行家电检测",
    "translated_abstract": "近年来，智能电表被广泛采用，以改善智能电网系统的管理，这些电表通常以极低的频率（每30分钟）收集能源消耗数据，以更准确地向客户计费。为了提供更个性化的建议，下一步是检测客户拥有的家电，由于极低的计量读数频率，这是一个具有挑战性的问题。尽管家电检测问题可以被视为时间序列分类问题，并且已经在文献中提出了许多这样的分类器，但没有研究将它们应用于这个具体的问题并进行比较。本文提出了对最新时间序列分类器在极低频智能电表数据中检测不同家电的存在/缺失进行深入评估和比较的研究。我们报告了5个真实数据集的结果。我们首先研究了13个时序分类器检测质量的影响。",
    "tldr": "本文对时间序列分类器在极低频智能电表数据中检测不同家电的存在/缺失进行了深入评估和比较，结果表明......",
    "en_tdlr": "This paper presents an in-depth evaluation and comparison of state-of-the-art time series classifiers applied to detecting the presence/absence of diverse appliances in very low-frequency smart meter data. The results show that..."
}