{
    "title": "Solving probability puzzles with logic toolkit. (arXiv:2305.11294v1 [cs.AI])",
    "abstract": "The proposed approach is to formalise the probabilistic puzzle in equational FOL. Two formalisations are needed: one theory for all models of the given puzzle, and a second theory for the favorable models. Then Mace4 - that computes all the interpretation models of a FOL theory - is called twice. First, it is asked to compute all the possible models M p .Second, the additional constraint is added, and Mace4 computes only favourabile models M f. Finally, the definition of probability is applied: the number of favorable models is divided by the number of possible models. The proposed approach equips students from the logic tribe to find the correct solution for puzzles from the probabilitistic tribe, by using their favourite instruments: modelling and formalisation. I have exemplified here five probabilistic puzzles and how they can be solved by translating the min FOL and then find the corresponding interpretation models. Mace4 was the tool of choice here. Ongoing work is investigating ",
    "link": "http://arxiv.org/abs/2305.11294",
    "context": "Title: Solving probability puzzles with logic toolkit. (arXiv:2305.11294v1 [cs.AI])\nAbstract: The proposed approach is to formalise the probabilistic puzzle in equational FOL. Two formalisations are needed: one theory for all models of the given puzzle, and a second theory for the favorable models. Then Mace4 - that computes all the interpretation models of a FOL theory - is called twice. First, it is asked to compute all the possible models M p .Second, the additional constraint is added, and Mace4 computes only favourabile models M f. Finally, the definition of probability is applied: the number of favorable models is divided by the number of possible models. The proposed approach equips students from the logic tribe to find the correct solution for puzzles from the probabilitistic tribe, by using their favourite instruments: modelling and formalisation. I have exemplified here five probabilistic puzzles and how they can be solved by translating the min FOL and then find the corresponding interpretation models. Mace4 was the tool of choice here. Ongoing work is investigating ",
    "path": "papers/23/05/2305.11294.json",
    "total_tokens": 781,
    "translated_title": "用逻辑工具箱解决概率谜题",
    "translated_abstract": "本文提出了一种用等式FOL形式化概率谜题并解决的方法。需要两种形式化方法：一种是针对给定的谜题模型的所有理论，另一种是针对有利模型的理论。然后两次调用Mace4，第一次计算所有可能的模型Mp，第二次加上额外的约束，Mace4只计算有利模型Mf。最后，应用概率定义：有利模型数除以可能模型数。提出的方法可以让逻辑领域的学生通过使用建模和形式化等喜爱的工具，找到解决概率谜题的正确方法。",
    "tldr": "建立等式FOL，使用Mace4计算所有可能的模型和有利模型数量，最后根据定义计算概率。这种方法让逻辑学生使用他们熟悉的工具解决概率谜题。",
    "en_tdlr": "This paper proposes a method of formalizing probability puzzles using equational FOL and solving them with Mace4. The approach allows students from the logic tribe to solve probability puzzles by using their favorite tools, modeling and formalization."
}