{
    "title": "SRTK: A Toolkit for Semantic-relevant Subgraph Retrieval. (arXiv:2305.04101v1 [cs.IR])",
    "abstract": "Semantic analysis based on knowledge graphs requires a relevant subgraph of a reasonable size. Existing approaches have three issues that impede the integration of such subgraphs. First, there is no off-the-shelf framework for semantic-relevant subgraph retrieval. Second, existing approaches are knowledge-graph-dependent, resulting in outdated knowledge graphs even in recent studies. Third, existing approaches are flawed either in entity linking or path expansion, which often results in huge subgraphs. In this paper, we present SRTK, a user-friendly toolkit for semantic-relevant subgraph retrieval from large-scale knowledge graphs. SRTK is the first toolkit that streamlines the entire lifecycle of subgraph retrieval, from development (preprocessing, training, and evaluation) to applications (entity linking, retrieving and visualizing). Moreover, It supports multiple popular knowledge graphs by defining unified interfaces across different knowledge graphs. Additionally, it ships with a ",
    "link": "http://arxiv.org/abs/2305.04101",
    "context": "Title: SRTK: A Toolkit for Semantic-relevant Subgraph Retrieval. (arXiv:2305.04101v1 [cs.IR])\nAbstract: Semantic analysis based on knowledge graphs requires a relevant subgraph of a reasonable size. Existing approaches have three issues that impede the integration of such subgraphs. First, there is no off-the-shelf framework for semantic-relevant subgraph retrieval. Second, existing approaches are knowledge-graph-dependent, resulting in outdated knowledge graphs even in recent studies. Third, existing approaches are flawed either in entity linking or path expansion, which often results in huge subgraphs. In this paper, we present SRTK, a user-friendly toolkit for semantic-relevant subgraph retrieval from large-scale knowledge graphs. SRTK is the first toolkit that streamlines the entire lifecycle of subgraph retrieval, from development (preprocessing, training, and evaluation) to applications (entity linking, retrieving and visualizing). Moreover, It supports multiple popular knowledge graphs by defining unified interfaces across different knowledge graphs. Additionally, it ships with a ",
    "path": "papers/23/05/2305.04101.json",
    "total_tokens": 732,
    "tldr": "本文介绍了SRTK，一个用户友好的工具包，可从大规模知识图谱中检索语义相关的子图，同时克服了现有方法的几个问题。SRTK是第一个能够简化子图检索整个生命周期的工具包，包括开发（预处理，训练和评估）和应用（实体链接，检索和可视化）。此外，它通过定义不同知识图谱之间的统一接口，支持多个流行的知识图谱。最重要的是，使用SRTK可以获得合理大小的语义相关子图，避免了现有方法中由实体链接或路径扩展导致子图过大的缺陷。",
    "en_tdlr": "This paper introduces SRTK, a user-friendly toolkit for semantic-relevant subgraph retrieval from large-scale knowledge graphs, which overcomes several issues of existing approaches. SRTK is the first toolkit that streamlines the entire lifecycle of subgraph retrieval, and supports multiple popular knowledge graphs by defining unified interfaces. Most importantly, it addresses the flaws of existing approaches that often result in overly large subgraphs due to entity linking or path expansion."
}