{
    "title": "Interpretable neural architecture search and transfer learning for understanding sequence dependent enzymatic reactions. (arXiv:2305.11917v1 [q-bio.MN])",
    "abstract": "Finely-tuned enzymatic pathways control cellular processes, and their dysregulation can lead to disease. Creating predictive and interpretable models for these pathways is challenging because of the complexity of the pathways and of the cellular and genomic contexts. Here we introduce Elektrum, a deep learning framework which addresses these challenges with data-driven and biophysically interpretable models for determining the kinetics of biochemical systems. First, it uses in vitro kinetic assays to rapidly hypothesize an ensemble of high-quality Kinetically Interpretable Neural Networks (KINNs) that predict reaction rates. It then employs a novel transfer learning step, where the KINNs are inserted as intermediary layers into deeper convolutional neural networks, fine-tuning the predictions for reaction-dependent in vivo outcomes. Elektrum makes effective use of the limited, but clean in vitro data and the noisy, yet plentiful in vivo data that captures cellular context. We apply Ele",
    "link": "http://arxiv.org/abs/2305.11917",
    "context": "Title: Interpretable neural architecture search and transfer learning for understanding sequence dependent enzymatic reactions. (arXiv:2305.11917v1 [q-bio.MN])\nAbstract: Finely-tuned enzymatic pathways control cellular processes, and their dysregulation can lead to disease. Creating predictive and interpretable models for these pathways is challenging because of the complexity of the pathways and of the cellular and genomic contexts. Here we introduce Elektrum, a deep learning framework which addresses these challenges with data-driven and biophysically interpretable models for determining the kinetics of biochemical systems. First, it uses in vitro kinetic assays to rapidly hypothesize an ensemble of high-quality Kinetically Interpretable Neural Networks (KINNs) that predict reaction rates. It then employs a novel transfer learning step, where the KINNs are inserted as intermediary layers into deeper convolutional neural networks, fine-tuning the predictions for reaction-dependent in vivo outcomes. Elektrum makes effective use of the limited, but clean in vitro data and the noisy, yet plentiful in vivo data that captures cellular context. We apply Ele",
    "path": "papers/23/05/2305.11917.json",
    "total_tokens": 1211,
    "translated_title": "可解释的神经架构搜索与迁移学习用于理解序列依赖的酶反应",
    "translated_abstract": "精细调节的酶途径控制着细胞过程，它们的失调可能导致疾病。为这些途径创建预测性和可解释性模型具有挑战性，因为这些途径的复杂性以及细胞和基因组背景的复杂性。在这里，我们介绍了Elektrum，一个深度学习框架，通过数据驱动和生物物理解释模型，确定生化系统动力学，从而解决这些挑战。首先，它使用体外动力学测定快速假设高质量的可解释动力学神经网络（KINN），用于预测反应速率。然后，利用新颖的迁移学习步骤，将KINN作为中介层插入更深的卷积神经网络中，微调反应相关的体内结果的预测。Elektrum有效利用了有限但洁净的体外数据和捕获细胞背景的噪声但丰富的体内数据。我们将Elektrum应用于理解与非酒精性脂肪肝病相关的碳水化合物和脂质代谢中涉及的酶反应。我们证明Elektrum利用迁移学习（1）优于最先进的模型预测体内反应速率; (2) 揭示酶活性的关键序列相关决定因素; 以及（3）发现治疗干预的潜在靶点。",
    "tldr": "Elektrum是一个深度学习框架，使用可解释的神经网络模型预测酶反应，利用有限但洁净的体外数据和噪声但丰富的体内数据。Elektrum可以通过迁移学习揭示酶活性的关键序列相关决定因素，并发现潜在的治疗干预靶点。",
    "en_tdlr": "Elektrum is a deep learning framework that uses interpretable neural network models to predict enzymatic reactions, which leverages limited but clean in vitro data and noisy but plentiful in vivo data. Elektrum can reveal key sequence-dependent determinants of enzymatic activity through transfer learning and discover potential therapeutic intervention targets."
}