{
    "title": "Calibration of Transformer-based Models for Identifying Stress and Depression in Social Media. (arXiv:2305.16797v1 [cs.CL])",
    "abstract": "In today's fast-paced world, the rates of stress and depression present a surge. Social media provide assistance for the early detection of mental health conditions. Existing methods mainly introduce feature extraction approaches and train shallow machine learning classifiers. Other researches use deep neural networks or transformers. Despite the fact that transformer-based models achieve noticeable improvements, they cannot often capture rich factual knowledge. Although there have been proposed a number of studies aiming to enhance the pretrained transformer-based models with extra information or additional modalities, no prior work has exploited these modifications for detecting stress and depression through social media. In addition, although the reliability of a machine learning model's confidence in its predictions is critical for high-risk applications, there is no prior work taken into consideration the model calibration. To resolve the above issues, we present the first study i",
    "link": "http://arxiv.org/abs/2305.16797",
    "context": "Title: Calibration of Transformer-based Models for Identifying Stress and Depression in Social Media. (arXiv:2305.16797v1 [cs.CL])\nAbstract: In today's fast-paced world, the rates of stress and depression present a surge. Social media provide assistance for the early detection of mental health conditions. Existing methods mainly introduce feature extraction approaches and train shallow machine learning classifiers. Other researches use deep neural networks or transformers. Despite the fact that transformer-based models achieve noticeable improvements, they cannot often capture rich factual knowledge. Although there have been proposed a number of studies aiming to enhance the pretrained transformer-based models with extra information or additional modalities, no prior work has exploited these modifications for detecting stress and depression through social media. In addition, although the reliability of a machine learning model's confidence in its predictions is critical for high-risk applications, there is no prior work taken into consideration the model calibration. To resolve the above issues, we present the first study i",
    "path": "papers/23/05/2305.16797.json",
    "total_tokens": 873,
    "translated_title": "基于Transformer模型的社交媒体压力和抑郁识别模型的校准",
    "translated_abstract": "在当今快节奏的生活中，压力和抑郁症的发病率呈现上升趋势。社交媒体为早期发现心理健康状况提供了帮助。现有的方法主要介绍特征提取方法并训练浅层机器学习分类器。其他研究使用深度神经网络或Transformer模型。尽管Transformer模型取得了明显的改进，但它们通常无法捕捉丰富的实际知识。虽然已经提出了许多旨在增强预训练Transformer模型的研究，但没有先前的工作利用这些修改来通过社交媒体检测压力和抑郁症。此外，尽管机器学习模型在其预测中的置信度可靠性对于高风险应用至关重要，但尚未有先前的工作考虑模型的校准。为解决以上问题，本文提出了第一个通过模型校准来检测社交媒体上的压力和抑郁症状的研究。",
    "tldr": "本文提出了第一个使用校准后的Transformer模型来检测社交媒体上的压力和抑郁症状的研究。",
    "en_tdlr": "This paper presents the first study to use calibrated Transformer models for detecting stress and depression symptoms in social media."
}