{
    "title": "Improved Algorithms for Allen's Interval Algebra by Dynamic Programming with Sublinear Partitioning. (arXiv:2305.15950v1 [cs.CC])",
    "abstract": "Allen's interval algebra is one of the most well-known calculi in qualitative temporal reasoning with numerous applications in artificial intelligence. Recently, there has been a surge of improvements in the fine-grained complexity of NP-hard reasoning tasks, improving the running time from the naive $2^{O(n^2)}$ to $O^*((1.0615n)^{n})$, with even faster algorithms for unit intervals a bounded number of overlapping intervals (the $O^*(\\cdot)$ notation suppresses polynomial factors). Despite these improvements the best known lower bound is still only $2^{o(n)}$ (under the exponential-time hypothesis) and major improvements in either direction seemingly require fundamental advances in computational complexity. In this paper we propose a novel framework for solving NP-hard qualitative reasoning problems which we refer to as dynamic programming with sublinear partitioning. Using this technique we obtain a major improvement of $O^*((\\frac{cn}{\\log{n}})^{n})$ for Allen's interval algebra. To",
    "link": "http://arxiv.org/abs/2305.15950",
    "context": "Title: Improved Algorithms for Allen's Interval Algebra by Dynamic Programming with Sublinear Partitioning. (arXiv:2305.15950v1 [cs.CC])\nAbstract: Allen's interval algebra is one of the most well-known calculi in qualitative temporal reasoning with numerous applications in artificial intelligence. Recently, there has been a surge of improvements in the fine-grained complexity of NP-hard reasoning tasks, improving the running time from the naive $2^{O(n^2)}$ to $O^*((1.0615n)^{n})$, with even faster algorithms for unit intervals a bounded number of overlapping intervals (the $O^*(\\cdot)$ notation suppresses polynomial factors). Despite these improvements the best known lower bound is still only $2^{o(n)}$ (under the exponential-time hypothesis) and major improvements in either direction seemingly require fundamental advances in computational complexity. In this paper we propose a novel framework for solving NP-hard qualitative reasoning problems which we refer to as dynamic programming with sublinear partitioning. Using this technique we obtain a major improvement of $O^*((\\frac{cn}{\\log{n}})^{n})$ for Allen's interval algebra. To",
    "path": "papers/23/05/2305.15950.json",
    "total_tokens": 976,
    "translated_title": "通过次线性划分的动态规划改进了Allen的区间代数算法。",
    "translated_abstract": "Allen的区间代数是定性时间推理中最知名的演算法之一，在人工智能领域有许多应用。最近，在NP困难推理任务的细化复杂度上出现了激增，将运行时间从naive $2^{O(n^2)}$提高到$O^*((1.0615n)^{n})$，对于单位区间和有限数量重叠区间的算法甚至更快（$O^*(\\cdot)$符号抑制了多项式因子）。尽管这些改进，目前已知的最佳下界仍然只有$2^{o(n)}$（在指数时间假设下），而重大跃进无论是向前还是向后似乎都需要基本的计算复杂性进展。本文提出了一种解决NP困难定性推理问题的新框架，我们称之为次线性划分动态规划。使用这种技术，我们获得了Allen的区间代数的主要改进$O^*((\\frac{cn}{\\log{n}})^{n})$。",
    "tldr": "Allen的区间代数的运行时间从naive $2^{O(n^2)}$到$O^*((1.0615n)^{n})$，本文提出了一种新的动态规划方法，通过次线性划分，获得了$O^*((\\frac{cn}{\\log{n}})^{n})$的主要改进。"
}