{
    "title": "Time-Consistent Asset Allocation for Risk Measures in a L\\'evy Market. (arXiv:2305.09471v1 [q-fin.MF])",
    "abstract": "Focusing on gains instead of terminal wealth, we consider an asset allocation problem to maximize time-consistently a mean-risk reward function with a general risk measure which is i) law-invariant, ii) cash- or shift-invariant, and iii) positively homogeneous, and possibly plugged into a general function. We model the market via a generalized version of the multi-dimensional Black-Scholes model using $\\alpha$-stable L\\'evy processes and give supplementary results for the classical Black-Scholes model. The optimal solution to this problem is a Nash subgame equilibrium given by the solution of an extended Hamilton-Jacobi-Bellman equation. Moreover, we show that the optimal solution is deterministic and unique under appropriate assumptions.",
    "link": "http://arxiv.org/abs/2305.09471",
    "context": "Title: Time-Consistent Asset Allocation for Risk Measures in a L\\'evy Market. (arXiv:2305.09471v1 [q-fin.MF])\nAbstract: Focusing on gains instead of terminal wealth, we consider an asset allocation problem to maximize time-consistently a mean-risk reward function with a general risk measure which is i) law-invariant, ii) cash- or shift-invariant, and iii) positively homogeneous, and possibly plugged into a general function. We model the market via a generalized version of the multi-dimensional Black-Scholes model using $\\alpha$-stable L\\'evy processes and give supplementary results for the classical Black-Scholes model. The optimal solution to this problem is a Nash subgame equilibrium given by the solution of an extended Hamilton-Jacobi-Bellman equation. Moreover, we show that the optimal solution is deterministic and unique under appropriate assumptions.",
    "path": "papers/23/05/2305.09471.json",
    "total_tokens": 861,
    "translated_title": "在 L\\'evy 市场中基于风险度量的时一致资产配置",
    "translated_abstract": "本文针对增益而非终止财富，考虑了一种资产配置问题，旨在通过使用一种广义的风险度量（满足 i）具有律变性，ii）具有现金或平移不变性，及 iii）可能嵌入到一种通用函数中）最大限度地一致化时间来扩大风险收益函数。我们使用 $\\alpha$ 稳定的 L\\'evy 过程来模拟市场，并为经典的 Black-Scholes 模型提供了补充结果。该问题的最优解是一个 Nash 子游戏均衡，其由扩展的 Hamilton-Jacobi-Bellman 方程的解决方案给出。此外，在适当的假设下，我们证明最优解是确定性且唯一的。",
    "tldr": "本文研究了使用风险度量进行资产配置的问题，通过使用广义的风险度量，最大化时间一致的平均风险回报函数。作者模拟了市场，并在符合条件的情况下证明了该问题的最优解是确定性且唯一的。",
    "en_tdlr": "This paper investigates the problem of asset allocation using risk measures, maximizing a time-consistent mean-risk reward function through the use of a law-invariant, cash- or shift-invariant, and positively homogeneous risk measure that may be embedded in a general function. The authors model the market using $\\alpha$-stable L\\'evy processes and provide supplementary results for the classical Black-Scholes model. The optimal solution, a Nash subgame equilibrium, is shown to be deterministic and unique under appropriate assumptions."
}