{
    "title": "Efficient Sensitivity Analysis for Parametric Robust Markov Chains. (arXiv:2305.01473v1 [cs.LG])",
    "abstract": "We provide a novel method for sensitivity analysis of parametric robust Markov chains. These models incorporate parameters and sets of probability distributions to alleviate the often unrealistic assumption that precise probabilities are available. We measure sensitivity in terms of partial derivatives with respect to the uncertain transition probabilities regarding measures such as the expected reward. As our main contribution, we present an efficient method to compute these partial derivatives. To scale our approach to models with thousands of parameters, we present an extension of this method that selects the subset of $k$ parameters with the highest partial derivative. Our methods are based on linear programming and differentiating these programs around a given value for the parameters. The experiments show the applicability of our approach on models with over a million states and thousands of parameters. Moreover, we embed the results within an iterative learning scheme that profi",
    "link": "http://arxiv.org/abs/2305.01473",
    "context": "Title: Efficient Sensitivity Analysis for Parametric Robust Markov Chains. (arXiv:2305.01473v1 [cs.LG])\nAbstract: We provide a novel method for sensitivity analysis of parametric robust Markov chains. These models incorporate parameters and sets of probability distributions to alleviate the often unrealistic assumption that precise probabilities are available. We measure sensitivity in terms of partial derivatives with respect to the uncertain transition probabilities regarding measures such as the expected reward. As our main contribution, we present an efficient method to compute these partial derivatives. To scale our approach to models with thousands of parameters, we present an extension of this method that selects the subset of $k$ parameters with the highest partial derivative. Our methods are based on linear programming and differentiating these programs around a given value for the parameters. The experiments show the applicability of our approach on models with over a million states and thousands of parameters. Moreover, we embed the results within an iterative learning scheme that profi",
    "path": "papers/23/05/2305.01473.json",
    "total_tokens": 921,
    "translated_title": "参数鲁棒马尔科夫链的高效敏感性分析",
    "translated_abstract": "我们提供了一种敏感性分析参数鲁棒马尔科夫链的新方法。这些模型包括参数和概率分布集合，以减轻精确概率可用的不现实假设。我们根据与不确定转移概率相关的措施（如期望奖励）的偏导数来衡量敏感性。作为我们的主要贡献，我们提出了一种计算这些偏导数的高效方法。为了扩展我们的方法以适用于具有数千个参数的模型，我们提出了一种该方法的扩展，可以选择具有最高偏导数的$k$个参数子集。我们的方法基于线性规划，并在给定参数值附近对这些程序进行微分。实验表明，我们的方法适用于具有超过一百万状态和数千个参数的模型。此外，我们将结果嵌入到迭代学习方案中，使得我们可以更快地获取对参数的响应并用于改进模型。",
    "tldr": "本文提出了一种针对参数鲁棒马尔科夫链的高效敏感性分析方法，可以选择具有最高偏导数的$k$个参数子集并应用于包含超过一百万状态和数千个参数的大型模型中。"
}