{
    "title": "vFedSec: Efficient Secure Aggregation for Vertical Federated Learning via Secure Layer. (arXiv:2305.16794v1 [cs.CR])",
    "abstract": "Most work in privacy-preserving federated learning (FL) has been focusing on horizontally partitioned datasets where clients share the same sets of features and can train complete models independently. However, in many interesting problems, individual data points are scattered across different clients/organizations in a vertical setting. Solutions for this type of FL require the exchange of intermediate outputs and gradients between participants, posing a potential risk of privacy leakage when privacy and security concerns are not considered. In this work, we present vFedSec - a novel design with an innovative Secure Layer for training vertical FL securely and efficiently using state-of-the-art security modules in secure aggregation. We theoretically demonstrate that our method does not impact the training performance while protecting private data effectively. Empirically results also show its applicability with extensive experiments that our design can achieve the protection with negl",
    "link": "http://arxiv.org/abs/2305.16794",
    "context": "Title: vFedSec: Efficient Secure Aggregation for Vertical Federated Learning via Secure Layer. (arXiv:2305.16794v1 [cs.CR])\nAbstract: Most work in privacy-preserving federated learning (FL) has been focusing on horizontally partitioned datasets where clients share the same sets of features and can train complete models independently. However, in many interesting problems, individual data points are scattered across different clients/organizations in a vertical setting. Solutions for this type of FL require the exchange of intermediate outputs and gradients between participants, posing a potential risk of privacy leakage when privacy and security concerns are not considered. In this work, we present vFedSec - a novel design with an innovative Secure Layer for training vertical FL securely and efficiently using state-of-the-art security modules in secure aggregation. We theoretically demonstrate that our method does not impact the training performance while protecting private data effectively. Empirically results also show its applicability with extensive experiments that our design can achieve the protection with negl",
    "path": "papers/23/05/2305.16794.json",
    "total_tokens": 833,
    "translated_title": "通过安全层实现垂直联邦学习的高效安全聚合",
    "translated_abstract": "隐私保护联邦学习主要关注横向划分的数据集，而在许多有趣的问题中，个体数据点分散在垂直的客户端/组织中。这种情况下的联邦学习需要参与者之间交换中间输出和梯度，若不考虑隐私和安全问题，可能会导致隐私泄露的风险。本文提出了vFedSec，通过创新性的安全层设计和最先进的安全模块，在保护数据隐私的同时，实现了垂直联邦学习的安全和高效。理论上证明了我们的方法不影响训练绩效，同时有效保护私人数据。实验结果也表明了我们的设计的应用性和保护能力。",
    "tldr": "vFedSec提出了一个用于垂直联邦学习的新型Secure Layer，旨在使用最先进的安全模块，实现安全高效的联合训练。实验结果表明，该方法在保护数据隐私效果显著，不会影响训练性能。"
}