{
    "title": "A Novel Memetic Strategy for Optimized Learning of Classification Trees. (arXiv:2305.07959v1 [cs.LG])",
    "abstract": "Given the increasing interest in interpretable machine learning, classification trees have again attracted the attention of the scientific community because of their glass-box structure. These models are usually built using greedy procedures, solving subproblems to find cuts in the feature space that minimize some impurity measures. In contrast to this standard greedy approach and to the recent advances in the definition of the learning problem through MILP-based exact formulations, in this paper we propose a novel evolutionary algorithm for the induction of classification trees that exploits a memetic approach that is able to handle datasets with thousands of points. Our procedure combines the exploration of the feasible space of solutions with local searches to obtain structures with generalization capabilities that are competitive with the state-of-the-art methods.",
    "link": "http://arxiv.org/abs/2305.07959",
    "context": "Title: A Novel Memetic Strategy for Optimized Learning of Classification Trees. (arXiv:2305.07959v1 [cs.LG])\nAbstract: Given the increasing interest in interpretable machine learning, classification trees have again attracted the attention of the scientific community because of their glass-box structure. These models are usually built using greedy procedures, solving subproblems to find cuts in the feature space that minimize some impurity measures. In contrast to this standard greedy approach and to the recent advances in the definition of the learning problem through MILP-based exact formulations, in this paper we propose a novel evolutionary algorithm for the induction of classification trees that exploits a memetic approach that is able to handle datasets with thousands of points. Our procedure combines the exploration of the feasible space of solutions with local searches to obtain structures with generalization capabilities that are competitive with the state-of-the-art methods.",
    "path": "papers/23/05/2305.07959.json",
    "total_tokens": 768,
    "translated_title": "一种用于分类树优化学习的新型记忆策略",
    "translated_abstract": "鉴于可解释机器学习的越来越多的关注，分类树因其玻璃盒结构再次引起了科学界的关注。这些模型通常使用贪心算法构建，通过解决问题来找到最小化某些不纯度度量的特征空间中的切割点。与这种标准的贪心方法和最近通过基于MILP的精确公式来定义学习问题的进展相反，在本文中，我们提出了一种新的演化算法，用于诱导分类树，利用一种记忆方法处理数以千计的数据集。我们的过程将可行解空间的探索与局部搜索相结合，以获得具有泛化能力且与最先进的方法竞争力相当的结构。",
    "tldr": "本论文提出了一种新的演化算法，用于诱导分类树，利用记忆学习方法处理大型数据集，结构具有泛化能力且与最先进的方法相当竞争力。"
}