{
    "title": "Train Global, Tailor Local: Minimalist Multilingual Translation into Endangered Languages. (arXiv:2305.03873v1 [cs.CL])",
    "abstract": "In many humanitarian scenarios, translation into severely low resource languages often does not require a universal translation engine, but a dedicated text-specific translation engine. For example, healthcare records, hygienic procedures, government communication, emergency procedures and religious texts are all limited texts. While generic translation engines for all languages do not exist, translation of multilingually known limited texts into new, endangered languages may be possible and reduce human translation effort. We attempt to leverage translation resources from many rich resource languages to efficiently produce best possible translation quality for a well known text, which is available in multiple languages, in a new, severely low resource language. We examine two approaches: 1. best selection of seed sentences to jump start translations in a new language in view of best generalization to the remainder of a larger targeted text(s), and 2. we adapt large general multilingua",
    "link": "http://arxiv.org/abs/2305.03873",
    "context": "Title: Train Global, Tailor Local: Minimalist Multilingual Translation into Endangered Languages. (arXiv:2305.03873v1 [cs.CL])\nAbstract: In many humanitarian scenarios, translation into severely low resource languages often does not require a universal translation engine, but a dedicated text-specific translation engine. For example, healthcare records, hygienic procedures, government communication, emergency procedures and religious texts are all limited texts. While generic translation engines for all languages do not exist, translation of multilingually known limited texts into new, endangered languages may be possible and reduce human translation effort. We attempt to leverage translation resources from many rich resource languages to efficiently produce best possible translation quality for a well known text, which is available in multiple languages, in a new, severely low resource language. We examine two approaches: 1. best selection of seed sentences to jump start translations in a new language in view of best generalization to the remainder of a larger targeted text(s), and 2. we adapt large general multilingua",
    "path": "papers/23/05/2305.03873.json",
    "total_tokens": 697,
    "translated_title": "全球训练，本地定制：极少资源语言的极简多语言翻译",
    "translated_abstract": "在许多人道主义场景中，向极度低资源的语言进行翻译通常不需要通用的翻译引擎，而是需要专门的文本特定翻译引擎。我们尝试利用多种丰富资源语言的翻译资源，高效地在新的极少资源语言中为一个已知的文本产生最好的可能翻译质量。",
    "tldr": "该论文研究了利用多种丰富资源语言的翻译资源来最大限度地提高极少资源语言的翻译质量，以减少人工翻译的工作量。",
    "en_tdlr": "This paper investigates the use of translation resources from many rich resource languages to efficiently improve the translation quality of severely low resource languages, in order to reduce the workload of human translation."
}