{
    "title": "Generative Meta-Learning for Zero-Shot Relation Triplet Extraction. (arXiv:2305.01920v1 [cs.CL])",
    "abstract": "The zero-shot relation triplet extraction (ZeroRTE) task aims to extract relation triplets from a piece of text with unseen relation types. The seminal work adopts the pre-trained generative model to generate synthetic samples for new relations. However, current generative models lack the optimization process of model generalization on different tasks during training, and thus have limited generalization capability. For this reason, we propose a novel generative meta-learning framework which exploits the `learning-to-learn' ability of meta-learning to boost the generalization capability of generative models. Specifically, we first design a task-aware generative model which can learn the general knowledge by forcing the optimization process to be conducted across multiple tasks. Based on it, we then present three generative meta-learning approaches designated for three typical meta-learning categories. Extensive experimental results demonstrate that our framework achieves a new state-of",
    "link": "http://arxiv.org/abs/2305.01920",
    "context": "Title: Generative Meta-Learning for Zero-Shot Relation Triplet Extraction. (arXiv:2305.01920v1 [cs.CL])\nAbstract: The zero-shot relation triplet extraction (ZeroRTE) task aims to extract relation triplets from a piece of text with unseen relation types. The seminal work adopts the pre-trained generative model to generate synthetic samples for new relations. However, current generative models lack the optimization process of model generalization on different tasks during training, and thus have limited generalization capability. For this reason, we propose a novel generative meta-learning framework which exploits the `learning-to-learn' ability of meta-learning to boost the generalization capability of generative models. Specifically, we first design a task-aware generative model which can learn the general knowledge by forcing the optimization process to be conducted across multiple tasks. Based on it, we then present three generative meta-learning approaches designated for three typical meta-learning categories. Extensive experimental results demonstrate that our framework achieves a new state-of",
    "path": "papers/23/05/2305.01920.json",
    "total_tokens": 901,
    "translated_title": "零样本关系三元组抽取的生成式元学习",
    "translated_abstract": "零样本关系三元组抽取任务旨在从一个包含未见过关系类型的文本中提取关系三元组。比较有代表性的工作采用预训练的生成式模型为新关系生成合成样本。然而，当前的生成式模型在训练中缺乏对于模型泛化到不同任务的优化过程，因此具有有限的泛化能力。因此，我们提出了一种新颖的生成式元学习框架，利用元学习的“学习如何学习”的能力提高生成式模型的泛化能力。具体而言，我们首先设计了一个任务感知的生成式模型，它可以通过在多个任务上强制进行优化过程来学习一般性知识。基于此，我们提出了三种针对三类典型元学习范畴的生成式元学习方法。广泛的实验结果表明，我们的框架在零样本关系三元组抽取任务上实现了新的最佳表现。",
    "tldr": "该论文提出了一种生成式元学习框架，通过任务感知的生成式模型和三种针对典型元学习范畴的方法，提高了零样本关系三元组抽取任务的泛化能力并达到了最佳表现。",
    "en_tdlr": "This paper proposes a generative meta-learning framework, which improves the generalization capability of generative models for zero-shot relation triplet extraction task through a task-aware generative model and three generative meta-learning approaches designated for three typical meta-learning categories."
}