{
    "title": "Class-Balancing Diffusion Models. (arXiv:2305.00562v1 [cs.CV])",
    "abstract": "Diffusion-based models have shown the merits of generating high-quality visual data while preserving better diversity in recent studies. However, such observation is only justified with curated data distribution, where the data samples are nicely pre-processed to be uniformly distributed in terms of their labels. In practice, a long-tailed data distribution appears more common and how diffusion models perform on such class-imbalanced data remains unknown. In this work, we first investigate this problem and observe significant degradation in both diversity and fidelity when the diffusion model is trained on datasets with class-imbalanced distributions. Especially in tail classes, the generations largely lose diversity and we observe severe mode-collapse issues. To tackle this problem, we set from the hypothesis that the data distribution is not class-balanced, and propose Class-Balancing Diffusion Models (CBDM) that are trained with a distribution adjustment regularizer as a solution. E",
    "link": "http://arxiv.org/abs/2305.00562",
    "context": "Title: Class-Balancing Diffusion Models. (arXiv:2305.00562v1 [cs.CV])\nAbstract: Diffusion-based models have shown the merits of generating high-quality visual data while preserving better diversity in recent studies. However, such observation is only justified with curated data distribution, where the data samples are nicely pre-processed to be uniformly distributed in terms of their labels. In practice, a long-tailed data distribution appears more common and how diffusion models perform on such class-imbalanced data remains unknown. In this work, we first investigate this problem and observe significant degradation in both diversity and fidelity when the diffusion model is trained on datasets with class-imbalanced distributions. Especially in tail classes, the generations largely lose diversity and we observe severe mode-collapse issues. To tackle this problem, we set from the hypothesis that the data distribution is not class-balanced, and propose Class-Balancing Diffusion Models (CBDM) that are trained with a distribution adjustment regularizer as a solution. E",
    "path": "papers/23/05/2305.00562.json",
    "total_tokens": 897,
    "translated_title": "类平衡扩散模型",
    "translated_abstract": "最近的研究表明，基于扩散的模型在生成高质量视觉数据同时保持更好的多样性方面有优势。但这种观察结果只适用于策划好的数据分布，即数据样本经过精心处理以在标签方面均匀分布。在实践中，长尾数据分布似乎更为普遍，而扩散模型在这种类别不平衡的数据上的表现还未知。在这项工作中，我们首先研究了这个问题，观察到当扩散模型在类别不平衡的数据集上训练时，多样性和保真度显著降低。尤其是在尾部类别，生成的样本严重缺乏多样性，我们观察到严重的模式崩溃问题。为了解决这个问题，我们假设数据分布不是类平衡的，提出了一种名为“类平衡扩散模型”的解决方案，使用分布调整正则化器进行训练。",
    "tldr": "这项工作探究了扩散模型在类别不平衡的数据上的表现，并提出了一种解决方案“类平衡扩散模型”通过使用分布调整正则化器进行训练。",
    "en_tdlr": "This work investigates the performance of diffusion models on class-imbalanced data and proposes a solution, Class-Balancing Diffusion Models, trained with a distribution adjustment regularizer. The proposed method addresses the issue of degraded diversity and fidelity, especially in tail classes, and severe mode-collapse issues observed when training diffusion models on datasets with class-imbalanced distributions."
}