{
    "title": "Towards Asking Clarification Questions for Information Seeking on Task-Oriented Dialogues. (arXiv:2305.13690v1 [cs.CL])",
    "abstract": "Task-oriented dialogue systems aim at providing users with task-specific services. Users of such systems often do not know all the information about the task they are trying to accomplish, requiring them to seek information about the task. To provide accurate and personalized task-oriented information seeking results, task-oriented dialogue systems need to address two potential issues: 1) users' inability to describe their complex information needs in their requests; and 2) ambiguous/missing information the system has about the users. In this paper, we propose a new Multi-Attention Seq2Seq Network, named MAS2S, which can ask questions to clarify the user's information needs and the user's profile in task-oriented information seeking. We also extend an existing dataset for task-oriented information seeking, leading to the \\ourdataset which contains about 100k task-oriented information seeking dialogues that are made publicly available\\footnote{Dataset and code is available at \\href{http",
    "link": "http://arxiv.org/abs/2305.13690",
    "context": "Title: Towards Asking Clarification Questions for Information Seeking on Task-Oriented Dialogues. (arXiv:2305.13690v1 [cs.CL])\nAbstract: Task-oriented dialogue systems aim at providing users with task-specific services. Users of such systems often do not know all the information about the task they are trying to accomplish, requiring them to seek information about the task. To provide accurate and personalized task-oriented information seeking results, task-oriented dialogue systems need to address two potential issues: 1) users' inability to describe their complex information needs in their requests; and 2) ambiguous/missing information the system has about the users. In this paper, we propose a new Multi-Attention Seq2Seq Network, named MAS2S, which can ask questions to clarify the user's information needs and the user's profile in task-oriented information seeking. We also extend an existing dataset for task-oriented information seeking, leading to the \\ourdataset which contains about 100k task-oriented information seeking dialogues that are made publicly available\\footnote{Dataset and code is available at \\href{http",
    "path": "papers/23/05/2305.13690.json",
    "total_tokens": 971,
    "translated_title": "面向任务导向对话的信息请求中的澄清问题提问方法",
    "translated_abstract": "任务导向的对话系统旨在为用户提供特定任务的服务。这种系统的用户通常不知道他们正在完成的任务的所有信息，需要寻求关于任务的信息。为了提供准确和个性化的任务导向信息查询结果，任务导向对话系统需要解决两个潜在问题：1) 用户无法在请求中描述他们复杂的信息需求；2) 系统对用户的信息存在模糊/缺失。在本文中，我们提出了一个新的多注意力Seq2Seq网络，命名为MAS2S，它可以提问以澄清用户在任务导向信息查询中的信息需求和用户个人资料。我们还扩展了现有的任务导向信息查询数据集，导致我们的数据集包含约100k个任务导向信息查询对话，这些对话是公开的\\footnote{ 数据集和代码可在\\href{http://link/to/dataset}{http://link/to/dataset}找到}。在扩展的数据集上进行的实验表明，所提出的模型在任务导向信息查询的准确性和覆盖范围方面优于现有模型。",
    "tldr": "本文提出了一个名为MAS2S的多注意力Seq2Seq网络，它能够提问以澄清任务导向信息获取中用户的信息需求和个人资料。实验证明该模型在任务导向信息查询方面的准确性和覆盖范围优于现有模型。",
    "en_tdlr": "This paper proposes a Multi-Attention Seq2Seq Network, named MAS2S, which can clarify the user's information needs and profile in task-oriented information seeking by asking questions. The experiments show that MAS2S outperforms existing models in accuracy and coverage for task-oriented information seeking."
}