{
    "title": "Signal Is Harder To Learn Than Bias: Debiasing with Focal Loss. (arXiv:2305.19671v1 [cs.LG])",
    "abstract": "Spurious correlations are everywhere. While humans often do not perceive them, neural networks are notorious for learning unwanted associations, also known as biases, instead of the underlying decision rule. As a result, practitioners are often unaware of the biased decision-making of their classifiers. Such a biased model based on spurious correlations might not generalize to unobserved data, leading to unintended, adverse consequences. We propose Signal is Harder (SiH), a variational-autoencoder-based method that simultaneously trains a biased and unbiased classifier using a novel, disentangling reweighting scheme inspired by the focal loss. Using the unbiased classifier, SiH matches or improves upon the performance of state-of-the-art debiasing methods. To improve the interpretability of our technique, we propose a perturbation scheme in the latent space for visualizing the bias that helps practitioners become aware of the sources of spurious correlations.",
    "link": "http://arxiv.org/abs/2305.19671",
    "context": "Title: Signal Is Harder To Learn Than Bias: Debiasing with Focal Loss. (arXiv:2305.19671v1 [cs.LG])\nAbstract: Spurious correlations are everywhere. While humans often do not perceive them, neural networks are notorious for learning unwanted associations, also known as biases, instead of the underlying decision rule. As a result, practitioners are often unaware of the biased decision-making of their classifiers. Such a biased model based on spurious correlations might not generalize to unobserved data, leading to unintended, adverse consequences. We propose Signal is Harder (SiH), a variational-autoencoder-based method that simultaneously trains a biased and unbiased classifier using a novel, disentangling reweighting scheme inspired by the focal loss. Using the unbiased classifier, SiH matches or improves upon the performance of state-of-the-art debiasing methods. To improve the interpretability of our technique, we propose a perturbation scheme in the latent space for visualizing the bias that helps practitioners become aware of the sources of spurious correlations.",
    "path": "papers/23/05/2305.19671.json",
    "total_tokens": 938,
    "translated_title": "信号比偏差更难学习：使用Focal Loss进行去偏差",
    "translated_abstract": "伪相关性无处不在。 尽管人类常常不会察觉它们，但神经网络以学习不需要的关联而出了名，也就是所谓的偏差，而不是基础决策规则。 因此，实践者经常不知道分类器的有偏决策。 基于虚假关联的这种有偏模型可能无法推广到未观察到的数据，导致意外的负面影响。 我们提出了一个名为Signal is Harder（SiH）的变分自动编码器方法，使用受Focal Loss启发的新型分解重新加权方案同时训练有偏和无偏分类器。 使用无偏分类器，SiH匹配或优于最先进的去偏差方法的性能。 为了提高我们技术的可解释性，我们提出了一种在潜空间中的扰动方案来可视化偏差，这有助于实践者认识到虚假相关的来源。",
    "tldr": "这篇论文提出了一种同时训练有偏和无偏分类器的方法，使用分解重新加权方案和Focal Loss启发的方法去偏差，相比于其他方法性能更好，同时提出了一种基于潜空间的可视化偏差方案，可以帮助实践者认识虚假相关的来源。",
    "en_tdlr": "This paper proposes a method for training biased and unbiased classifiers simultaneously, using a disentangling reweighting scheme and a method inspired by Focal Loss to debias. It performs better than other methods and a perturbation scheme in the latent space is proposed for visualizing bias, helping practitioners become aware of the sources of spurious correlations."
}