{
    "title": "Dataset of a parameterized U-bend flow for Deep Learning Applications. (arXiv:2305.05216v1 [physics.flu-dyn])",
    "abstract": "This dataset contains 10,000 fluid flow and heat transfer simulations in U-bend shapes. Each of them is described by 28 design parameters, which are processed with the help of Computational Fluid Dynamics methods. The dataset provides a comprehensive benchmark for investigating various problems and methods from the field of design optimization. For these investigations supervised, semi-supervised and unsupervised deep learning approaches can be employed. One unique feature of this dataset is that each shape can be represented by three distinct data types including design parameter and objective combinations, five different resolutions of 2D images from the geometry and the solution variables of the numerical simulation, as well as a representation using the cell values of the numerical mesh. This third representation enables considering the specific data structure of numerical simulations for deep learning approaches. The source code and the container used to generate the data are publ",
    "link": "http://arxiv.org/abs/2305.05216",
    "context": "Title: Dataset of a parameterized U-bend flow for Deep Learning Applications. (arXiv:2305.05216v1 [physics.flu-dyn])\nAbstract: This dataset contains 10,000 fluid flow and heat transfer simulations in U-bend shapes. Each of them is described by 28 design parameters, which are processed with the help of Computational Fluid Dynamics methods. The dataset provides a comprehensive benchmark for investigating various problems and methods from the field of design optimization. For these investigations supervised, semi-supervised and unsupervised deep learning approaches can be employed. One unique feature of this dataset is that each shape can be represented by three distinct data types including design parameter and objective combinations, five different resolutions of 2D images from the geometry and the solution variables of the numerical simulation, as well as a representation using the cell values of the numerical mesh. This third representation enables considering the specific data structure of numerical simulations for deep learning approaches. The source code and the container used to generate the data are publ",
    "path": "papers/23/05/2305.05216.json",
    "total_tokens": 871,
    "translated_title": "用于深度学习应用的参数化U弯流数据集",
    "translated_abstract": "该数据集包含10,000个U形弯管内的流体流动和热传递模拟。每个模拟都由28个设计参数描述，并使用计算流体力学方法进行处理。该数据集为研究各种设计优化问题和方法提供了全面的基准。为这些研究，可以采用监督、半监督和无监督的深度学习方法。该数据集的一个独特特征是，每个形状可以通过三个不同的数据类型进行表示，包括设计参数和目标组合、几何结构的五个不同分辨率的二维图像以及数值模拟的解变量的表示。第三个表示方法可以考虑用于深度学习方法的数值模拟的特定数据结构。生成数据的源代码和容器已发布在GitHub上。",
    "tldr": "该数据集包含10,000个U形弯管内的流体流动和热传递模拟，提供全面的基准，可用于各种设计优化问题和方法的研究。该数据集的独特特征是三种不同的数据类型，包括设计参数和目标组合、几何结构的二维图像以及数值模拟的解变量的表示方法。",
    "en_tdlr": "This dataset contains 10,000 fluid flow and heat transfer simulations in U-bend shapes, provides a comprehensive benchmark for investigating various problems and methods from the field of design optimization, and has the unique feature of three distinct data types for representing each shape."
}