{
    "title": "Unpaired Downscaling of Fluid Flows with Diffusion Bridges. (arXiv:2305.01822v1 [cs.LG])",
    "abstract": "We present a method to downscale idealized geophysical fluid simulations using generative models based on diffusion maps. By analyzing the Fourier spectra of images drawn from different data distributions, we show how one can chain together two independent conditional diffusion models for use in domain translation. The resulting transformation is a diffusion bridge between a low resolution and a high resolution dataset and allows for new sample generation of high-resolution images given specific low resolution features. The ability to generate new samples allows for the computation of any statistic of interest, without any additional calibration or training. Our unsupervised setup is also designed to downscale images without access to paired training data; this flexibility allows for the combination of multiple source and target domains without additional training. We demonstrate that the method enhances resolution and corrects context-dependent biases in geophysical fluid simulations,",
    "link": "http://arxiv.org/abs/2305.01822",
    "context": "Title: Unpaired Downscaling of Fluid Flows with Diffusion Bridges. (arXiv:2305.01822v1 [cs.LG])\nAbstract: We present a method to downscale idealized geophysical fluid simulations using generative models based on diffusion maps. By analyzing the Fourier spectra of images drawn from different data distributions, we show how one can chain together two independent conditional diffusion models for use in domain translation. The resulting transformation is a diffusion bridge between a low resolution and a high resolution dataset and allows for new sample generation of high-resolution images given specific low resolution features. The ability to generate new samples allows for the computation of any statistic of interest, without any additional calibration or training. Our unsupervised setup is also designed to downscale images without access to paired training data; this flexibility allows for the combination of multiple source and target domains without additional training. We demonstrate that the method enhances resolution and corrects context-dependent biases in geophysical fluid simulations,",
    "path": "papers/23/05/2305.01822.json",
    "total_tokens": 904,
    "translated_title": "没有配对数据的流体流动降尺度方法——扩散桥",
    "translated_abstract": "我们提出了一种使用基于扩散映射的生成模型对理想化地球物理流体模拟进行降尺度的方法。通过分析从不同数据分布中绘制的图像的傅里叶光谱，我们展示了如何将两个独立的有条件扩散模型链接在一起以用于域转换。所得到的转换是低分辨率和高分辨率数据集之间的扩散桥，可以在给定特定低分辨率特征的情况下生成新的高分辨率图像样本。生成新样本的能力使得可以计算任何感兴趣的统计量，而无需进行任何额外的校准或训练。我们的无监督设置还旨在在没有访问配对训练数据的情况下对图像进行降尺度处理。这种灵活性允许将多个源域和目标域组合在一起，而无需进行额外的训练。我们演示了这种方法如何提高地球物理流体模拟的分辨率并纠正上下文相关偏差。",
    "tldr": "本文提出了一种基于扩散映射和生成模型的方法，能够在没有配对训练数据的情况下进行流体模拟的降尺度处理，该方法可有效地增强分辨率并校正上下文相关偏差。",
    "en_tdlr": "This paper presents a method based on diffusion maps and generative models that can downscale fluid simulations without paired training data. The method enhances resolution and corrects context-dependent biases in geophysical fluid simulations."
}