{
    "title": "Ship-D: Ship Hull Dataset for Design Optimization using Machine Learning. (arXiv:2305.08279v2 [cs.LG] UPDATED)",
    "abstract": "Machine learning has recently made significant strides in reducing design cycle time for complex products. Ship design, which currently involves years long cycles and small batch production, could greatly benefit from these advancements. By developing a machine learning tool for ship design that learns from the design of many different types of ships, tradeoffs in ship design could be identified and optimized. However, the lack of publicly available ship design datasets currently limits the potential for leveraging machine learning in generalized ship design. To address this gap, this paper presents a large dataset of thirty thousand ship hulls, each with design and functional performance information, including parameterization, mesh, point cloud, and image representations, as well as thirty two hydrodynamic drag measures under different operating conditions. The dataset is structured to allow human input and is also designed for computational methods. Additionally, the paper introduce",
    "link": "http://arxiv.org/abs/2305.08279",
    "context": "Title: Ship-D: Ship Hull Dataset for Design Optimization using Machine Learning. (arXiv:2305.08279v2 [cs.LG] UPDATED)\nAbstract: Machine learning has recently made significant strides in reducing design cycle time for complex products. Ship design, which currently involves years long cycles and small batch production, could greatly benefit from these advancements. By developing a machine learning tool for ship design that learns from the design of many different types of ships, tradeoffs in ship design could be identified and optimized. However, the lack of publicly available ship design datasets currently limits the potential for leveraging machine learning in generalized ship design. To address this gap, this paper presents a large dataset of thirty thousand ship hulls, each with design and functional performance information, including parameterization, mesh, point cloud, and image representations, as well as thirty two hydrodynamic drag measures under different operating conditions. The dataset is structured to allow human input and is also designed for computational methods. Additionally, the paper introduce",
    "path": "papers/23/05/2305.08279.json",
    "total_tokens": 1054,
    "translated_title": "用于船舶设计优化的机器学习数据集：Ship-D",
    "translated_abstract": "近来，机器学习在减少复杂产品设计周期方面已取得重大进展。目前船舶设计需要数年时间，且生产规模很小，因此可以从这些进展中受益。本文通过开发一种基于机器学习的船舶设计工具，学习不同类型的船舶设计，从而识别和优化船舶设计中的协同效应。然而，目前缺乏公开的船舶设计数据集限制了机器学习在通用船舶设计中的潜力。为了解决这个问题，本文介绍了一个包含三万艘船舶外形信息、设计参数、网格表示、点云数据、图像表示以及在不同运行条件下的三十二种水动力阻力的大型数据集--Ship-D，该数据集旨在为人类和计算方法提供支持。",
    "tldr": "本文介绍了一个适用于船舶设计优化的机器学习数据集Ship-D，该数据集包含三万艘船舶外形信息、设计参数、网格表示、点云数据、图像表示以及三十二种水动力阻力数据，并可支持人类和计算方法进行设计。",
    "en_tdlr": "This paper presents a machine learning dataset, Ship-D, for optimizing ship design, which includes 30,000 ship hulls with design and functional performance information, 32 hydrodynamic drag measures, as well as parameterization, mesh, point cloud, and image representations. The dataset is designed to support both human and computational methods in ship design."
}