{
    "title": "Reconfigurable Distributed FPGA Cluster Design for Deep Learning Accelerators. (arXiv:2305.18332v1 [cs.DC])",
    "abstract": "We propose a distributed system based on lowpower embedded FPGAs designed for edge computing applications focused on exploring distributing scheduling optimizations for Deep Learning (DL) workloads to obtain the best performance regarding latency and power efficiency. Our cluster was modular throughout the experiment, and we have implementations that consist of up to 12 Zynq-7020 chip-based boards as well as 5 UltraScale+ MPSoC FPGA boards connected through an ethernet switch, and the cluster will evaluate configurable Deep Learning Accelerator (DLA) Versatile Tensor Accelerator (VTA). This adaptable distributed architecture is distinguished by its capacity to evaluate and manage neural network workloads in numerous configurations which enables users to conduct multiple experiments tailored to their specific application needs. The proposed system can simultaneously execute diverse Neural Network (NN) models, arrange the computation graph in a pipeline structure, and manually allocate g",
    "link": "http://arxiv.org/abs/2305.18332",
    "context": "Title: Reconfigurable Distributed FPGA Cluster Design for Deep Learning Accelerators. (arXiv:2305.18332v1 [cs.DC])\nAbstract: We propose a distributed system based on lowpower embedded FPGAs designed for edge computing applications focused on exploring distributing scheduling optimizations for Deep Learning (DL) workloads to obtain the best performance regarding latency and power efficiency. Our cluster was modular throughout the experiment, and we have implementations that consist of up to 12 Zynq-7020 chip-based boards as well as 5 UltraScale+ MPSoC FPGA boards connected through an ethernet switch, and the cluster will evaluate configurable Deep Learning Accelerator (DLA) Versatile Tensor Accelerator (VTA). This adaptable distributed architecture is distinguished by its capacity to evaluate and manage neural network workloads in numerous configurations which enables users to conduct multiple experiments tailored to their specific application needs. The proposed system can simultaneously execute diverse Neural Network (NN) models, arrange the computation graph in a pipeline structure, and manually allocate g",
    "path": "papers/23/05/2305.18332.json",
    "total_tokens": 848,
    "translated_title": "可重构分布式FPGA集群设计用于深度学习加速器",
    "translated_abstract": "我们提出了一种基于低功耗嵌入式FPGA的分布式系统，旨在为边缘计算应用探索分布式调度优化的深度学习工作负载，以获得最佳的延迟和功耗效率。我们的集群在实验过程中是模块化的，我们已经实现了高达12个基于Zynq-7020芯片的板和5个UltraScale+ MPSoC FPGA板通过以太网交换机连接，并且集群将评估可配置的深度学习加速器（DLA）Versatile Tensor Accelerator（VTA）。这种可适应的分布式架构的优点在于其能够在许多配置中评估和管理神经网络工作负载，使用户能够根据其特定的应用程序需求进行多个实验。所提出的系统可以同时执行不同的神经网络模型，将计算图排列成管道结构，并手动分配计算资源。",
    "tldr": "该论文提出了一种基于分布式FPGA集群的深度学习加速器，能够在多个配置中评估和管理神经网络工作负载，实现最佳的延迟和功耗效率。",
    "en_tdlr": "This paper proposes a distributed deep learning accelerator based on FPGA cluster, capable of evaluating and managing neural network workloads in multiple configurations, achieving the best latency and power efficiency."
}