{
    "title": "Reconstruction-based LSTM-Autoencoder for Anomaly-based DDoS Attack Detection over Multivariate Time-Series Data. (arXiv:2305.09475v1 [cs.CR])",
    "abstract": "A Distributed Denial-of-service (DDoS) attack is a malicious attempt to disrupt the regular traffic of a targeted server, service, or network by sending a flood of traffic to overwhelm the target or its surrounding infrastructure. As technology improves, new attacks have been developed by hackers. Traditional statistical and shallow machine learning techniques can detect superficial anomalies based on shallow data and feature selection, however, these approaches cannot detect unseen DDoS attacks. In this context, we propose a reconstruction-based anomaly detection model named LSTM-Autoencoder (LSTM-AE) which combines two deep learning-based models for detecting DDoS attack anomalies. The proposed structure of long short-term memory (LSTM) networks provides units that work with each other to learn the long short-term correlation of data within a time series sequence. Autoencoders are used to identify the optimal threshold based on the reconstruction error rates evaluated on each sample ",
    "link": "http://arxiv.org/abs/2305.09475",
    "context": "Title: Reconstruction-based LSTM-Autoencoder for Anomaly-based DDoS Attack Detection over Multivariate Time-Series Data. (arXiv:2305.09475v1 [cs.CR])\nAbstract: A Distributed Denial-of-service (DDoS) attack is a malicious attempt to disrupt the regular traffic of a targeted server, service, or network by sending a flood of traffic to overwhelm the target or its surrounding infrastructure. As technology improves, new attacks have been developed by hackers. Traditional statistical and shallow machine learning techniques can detect superficial anomalies based on shallow data and feature selection, however, these approaches cannot detect unseen DDoS attacks. In this context, we propose a reconstruction-based anomaly detection model named LSTM-Autoencoder (LSTM-AE) which combines two deep learning-based models for detecting DDoS attack anomalies. The proposed structure of long short-term memory (LSTM) networks provides units that work with each other to learn the long short-term correlation of data within a time series sequence. Autoencoders are used to identify the optimal threshold based on the reconstruction error rates evaluated on each sample ",
    "path": "papers/23/05/2305.09475.json",
    "total_tokens": 884,
    "translated_title": "基于重构的LSTM自编码器用于多元时间序列数据的异常DDoS攻击检测",
    "translated_abstract": "分布式拒绝服务（DDoS）攻击是一种恶意企图通过发送海量流量来淹没目标或其周围基础架构的服务器、服务或网络的常规流量的攻击。传统的统计和浅层机器学习技术可以基于浅层数据和特征选择检测表面异常，但这些方法无法检测到未见过的DDoS攻击。在这个背景下，我们提出了一个名为LSTM-Autoencoder（LSTM-AE）的基于重构的异常检测模型，该模型结合了两个基于深度学习的模型来检测DDoS攻击异常。长短期记忆（LSTM）网络的提出结构提供了单元，这些单元彼此协作来学习时间序列序列内数据的长期短期相关性。自编码器用于基于在每个样本上评估的重构误差率来识别最佳阈值。",
    "tldr": "该论文提出基于重构的LSTM-Autoencoder（LSTM-AE）模型结合了深度学习模型来检测未见过的DDoS攻击异常，该模型通过自编码器来识别最佳阈值。",
    "en_tdlr": "The paper proposes a reconstruction-based LSTM-Autoencoder model named LSTM-AE, which combines two deep learning-based models to detect unseen DDoS attack anomalies. The model identifies the optimal threshold using autoencoders based on reconstruction error rates evaluated on each sample."
}