{
    "title": "Prompting and Evaluating Large Language Models for Proactive Dialogues: Clarification, Target-guided, and Non-collaboration. (arXiv:2305.13626v1 [cs.CL])",
    "abstract": "Conversational systems based on Large Language Models (LLMs), such as ChatGPT, show exceptional proficiency in context understanding and response generation. However, despite their impressive capabilities, they still possess limitations, such as providing randomly-guessed answers to ambiguous queries or failing to refuse users' requests, both of which are considered aspects of a conversational agent's proactivity. This raises the question of whether LLM-based conversational systems are equipped to handle proactive dialogue problems. In this work, we conduct a comprehensive analysis of LLM-based conversational systems, specifically focusing on three aspects of proactive dialogue systems: clarification, target-guided, and non-collaborative dialogues. To trigger the proactivity of LLMs, we propose the Proactive Chain-of-Thought prompting scheme, which augments LLMs with the goal planning capability over descriptive reasoning chains. Empirical findings are discussed to promote future studi",
    "link": "http://arxiv.org/abs/2305.13626",
    "context": "Title: Prompting and Evaluating Large Language Models for Proactive Dialogues: Clarification, Target-guided, and Non-collaboration. (arXiv:2305.13626v1 [cs.CL])\nAbstract: Conversational systems based on Large Language Models (LLMs), such as ChatGPT, show exceptional proficiency in context understanding and response generation. However, despite their impressive capabilities, they still possess limitations, such as providing randomly-guessed answers to ambiguous queries or failing to refuse users' requests, both of which are considered aspects of a conversational agent's proactivity. This raises the question of whether LLM-based conversational systems are equipped to handle proactive dialogue problems. In this work, we conduct a comprehensive analysis of LLM-based conversational systems, specifically focusing on three aspects of proactive dialogue systems: clarification, target-guided, and non-collaborative dialogues. To trigger the proactivity of LLMs, we propose the Proactive Chain-of-Thought prompting scheme, which augments LLMs with the goal planning capability over descriptive reasoning chains. Empirical findings are discussed to promote future studi",
    "path": "papers/23/05/2305.13626.json",
    "total_tokens": 917,
    "translated_title": "激励和评估用于主动对话的大型语言模型：澄清、目标导向和非协作性",
    "translated_abstract": "基于大型语言模型（LLM）的对话系统，如ChatGPT，在上下文理解和响应生成方面表现出异常的熟练程度，但是，尽管它们具有卓越的能力，仍然存在限制，例如对模糊查询提供随机猜测答案或无法拒绝用户的请求，这些都被认为是对话代理的主动性方面。这引发了LLM基于对话系统是否能够处理主动对话问题的问题。在这项工作中，我们对基于LLM的对话系统进行了全面的分析，具体关注主动对话系统的三个方面：澄清、目标导向和非协作对话。为了触发LLM的主动性，我们提出了Proactive Chain-of-Thought提示方案，它通过对描述性推理链的目标规划能力增强了LLM。我们讨论了实证结果以促进未来研究。",
    "tldr": "本研究针对大型语言模型的对话系统，针对澄清、目标导向和非协作对话，提出了Proactive Chain-of-Thought提示方案，以增强系统的主动性能力，为未来研究提供了经验结果。",
    "en_tdlr": "This study focuses on large language model-based conversational systems, proposing a Proactive Chain-of-Thought prompting scheme to enhance the systems' proactivity in handling proactive dialogue problems such as clarification, target-guided, and non-collaborative dialogues, and presenting empirical findings to promote future research."
}