{
    "title": "infoVerse: A Universal Framework for Dataset Characterization with Multidimensional Meta-information. (arXiv:2305.19344v1 [cs.CL])",
    "abstract": "The success of NLP systems often relies on the availability of large, high-quality datasets. However, not all samples in these datasets are equally valuable for learning, as some may be redundant or noisy. Several methods for characterizing datasets based on model-driven meta-information (e.g., model's confidence) have been developed, but the relationship and complementary effects of these methods have received less attention. In this paper, we introduce infoVerse, a universal framework for dataset characterization, which provides a new feature space that effectively captures multidimensional characteristics of datasets by incorporating various model-driven meta-information. infoVerse reveals distinctive regions of the dataset that are not apparent in the original semantic space, hence guiding users (or models) in identifying which samples to focus on for exploration, assessment, or annotation. Additionally, we propose a novel sampling method on infoVerse to select a set of data points",
    "link": "http://arxiv.org/abs/2305.19344",
    "context": "Title: infoVerse: A Universal Framework for Dataset Characterization with Multidimensional Meta-information. (arXiv:2305.19344v1 [cs.CL])\nAbstract: The success of NLP systems often relies on the availability of large, high-quality datasets. However, not all samples in these datasets are equally valuable for learning, as some may be redundant or noisy. Several methods for characterizing datasets based on model-driven meta-information (e.g., model's confidence) have been developed, but the relationship and complementary effects of these methods have received less attention. In this paper, we introduce infoVerse, a universal framework for dataset characterization, which provides a new feature space that effectively captures multidimensional characteristics of datasets by incorporating various model-driven meta-information. infoVerse reveals distinctive regions of the dataset that are not apparent in the original semantic space, hence guiding users (or models) in identifying which samples to focus on for exploration, assessment, or annotation. Additionally, we propose a novel sampling method on infoVerse to select a set of data points",
    "path": "papers/23/05/2305.19344.json",
    "total_tokens": 904,
    "translated_title": "infoVerse：一种用多维度元信息对数据集进行特征化的通用框架",
    "translated_abstract": "NLP系统的成功往往依赖于大量高质量的数据集。然而，这些数据集中并非所有样本都同样有利于学习，因为有些可能是冗余或带有噪声。已经开发了几种基于模型驱动元信息（例如模型的置信度）的数据集特征化方法，但这些方法之间的关系和互补效应受到的关注较少。在本文中，我们介绍了infoVerse，这是一种通用的数据集特征化框架，它通过结合各种模型驱动的元信息提供了一个新的特征空间，有效地捕捉了数据集的多维特征。infoVerse揭示了数据集中在原始语义空间中不明显的独特区域，从而引导用户（或模型）确定哪些样本需要关注以进行探索、评估或注释。此外，我们还在infoVerse上提出了一种新的采样方法来选择一组数据点。",
    "tldr": "本文介绍了一种通用的数据集特征化框架infoVerse，通过结合各种模型驱动的元信息提供了一个新的特征空间，能够有效地捕捉数据集的多维特征，有助于用户或模型确定哪些样本需要关注。",
    "en_tdlr": "This paper introduces a universal framework for dataset characterization, infoVerse, that effectively captures multidimensional characteristics of datasets by incorporating various model-driven meta-information. The framework reveals distinctive regions of the dataset that guide users or models in identifying which samples to focus on for exploration, assessment, or annotation."
}