{
    "title": "FMM-X3D: FPGA-based modeling and mapping of X3D for Human Action Recognition. (arXiv:2305.18479v1 [cs.CV])",
    "abstract": "3D Convolutional Neural Networks are gaining increasing attention from researchers and practitioners and have found applications in many domains, such as surveillance systems, autonomous vehicles, human monitoring systems, and video retrieval. However, their widespread adoption is hindered by their high computational and memory requirements, especially when resource-constrained systems are targeted. This paper addresses the problem of mapping X3D, a state-of-the-art model in Human Action Recognition that achieves accuracy of 95.5\\% in the UCF101 benchmark, onto any FPGA device. The proposed toolflow generates an optimised stream-based hardware system, taking into account the available resources and off-chip memory characteristics of the FPGA device. The generated designs push further the current performance-accuracy pareto front, and enable for the first time the targeting of such complex model architectures for the Human Action Recognition task.",
    "link": "http://arxiv.org/abs/2305.18479",
    "context": "Title: FMM-X3D: FPGA-based modeling and mapping of X3D for Human Action Recognition. (arXiv:2305.18479v1 [cs.CV])\nAbstract: 3D Convolutional Neural Networks are gaining increasing attention from researchers and practitioners and have found applications in many domains, such as surveillance systems, autonomous vehicles, human monitoring systems, and video retrieval. However, their widespread adoption is hindered by their high computational and memory requirements, especially when resource-constrained systems are targeted. This paper addresses the problem of mapping X3D, a state-of-the-art model in Human Action Recognition that achieves accuracy of 95.5\\% in the UCF101 benchmark, onto any FPGA device. The proposed toolflow generates an optimised stream-based hardware system, taking into account the available resources and off-chip memory characteristics of the FPGA device. The generated designs push further the current performance-accuracy pareto front, and enable for the first time the targeting of such complex model architectures for the Human Action Recognition task.",
    "path": "papers/23/05/2305.18479.json",
    "total_tokens": 832,
    "translated_title": "FMM-X3D：基于FPGA的X3D建模和映射用于人体动作识别",
    "translated_abstract": "三维卷积神经网络越来越受到研究人员和实践者的关注，在监控系统、自动驾驶车辆、人体监测系统和视频检索等许多领域都有应用。然而，它们的广泛应用受到了高计算和内存要求的限制，特别是针对资源受限的系统。本文解决了将Human Action Recognition中最先进的模型之一——X3D映射到任何FPGA设备上的问题。提出的工具流生成了一个经过优化的基于流的硬件系统，考虑了FPGA设备的可用资源和外部存储器特性。所生成的设计推进了当前性能和准确性帕累托前沿，并首次实现了针对这种复杂模型架构进行Human Action Recognition任务的目标。",
    "tldr": "本论文解决了将Human Action Recognition中最先进的模型之一——X3D映射到任何FPGA设备上的问题，并首次实现了针对这种复杂模型架构进行Human Action Recognition任务的目标。",
    "en_tdlr": "This paper addresses the problem of mapping X3D, a state-of-the-art model in Human Action Recognition, onto any FPGA device and achieves the first targeting of such complex model architectures for the Human Action Recognition task."
}