{
    "title": "NL-CS Net: Deep Learning with Non-Local Prior for Image Compressive Sensing. (arXiv:2305.03899v1 [cs.CV])",
    "abstract": "Deep learning has been applied to compressive sensing (CS) of images successfully in recent years. However, existing network-based methods are often trained as the black box, in which the lack of prior knowledge is often the bottleneck for further performance improvement. To overcome this drawback, this paper proposes a novel CS method using non-local prior which combines the interpretability of the traditional optimization methods with the speed of network-based methods, called NL-CS Net. We unroll each phase from iteration of the augmented Lagrangian method solving non-local and sparse regularized optimization problem by a network. NL-CS Net is composed of the up-sampling module and the recovery module. In the up-sampling module, we use learnable up-sampling matrix instead of a predefined one. In the recovery module, patch-wise non-local network is employed to capture long-range feature correspondences. Important parameters involved (e.g. sampling matrix, nonlinear transforms, shrink",
    "link": "http://arxiv.org/abs/2305.03899",
    "context": "Title: NL-CS Net: Deep Learning with Non-Local Prior for Image Compressive Sensing. (arXiv:2305.03899v1 [cs.CV])\nAbstract: Deep learning has been applied to compressive sensing (CS) of images successfully in recent years. However, existing network-based methods are often trained as the black box, in which the lack of prior knowledge is often the bottleneck for further performance improvement. To overcome this drawback, this paper proposes a novel CS method using non-local prior which combines the interpretability of the traditional optimization methods with the speed of network-based methods, called NL-CS Net. We unroll each phase from iteration of the augmented Lagrangian method solving non-local and sparse regularized optimization problem by a network. NL-CS Net is composed of the up-sampling module and the recovery module. In the up-sampling module, we use learnable up-sampling matrix instead of a predefined one. In the recovery module, patch-wise non-local network is employed to capture long-range feature correspondences. Important parameters involved (e.g. sampling matrix, nonlinear transforms, shrink",
    "path": "papers/23/05/2305.03899.json",
    "total_tokens": 984,
    "translated_title": "NL-CS Net:基于非局部先验的深度学习图片压缩感知",
    "translated_abstract": "近年来，深度学习已成功应用于图像压缩感知（CS）领域。然而，现有的基于网络的方法往往作为黑匣子进行训练，缺乏先验知识是进一步提高性能的 bottleneck。因此，本文提出了一种结合传统优化方法的可解释性和基于网络方法的速度的新型CS方法，即使用非局部先验的NL-CS Net。我们通过网络展开增广拉格朗日方法的每个阶段，以解决非局部和稀疏正则化优化问题。NL-CS Net由上采样模块和恢复模块组成，在上采样模块中，我们使用可学习上采样矩阵代替预定义的上采样矩阵；在恢复模块中，我们采用基于图块的非局部网络来捕获长距离的特征对应关系。NL-CS Net中涉及的重要参数（例如采样矩阵，非线性变换，收缩量，正则化）以端到端的方式进行优化。实验结果表明，我们提出的NL-CS Net在重构质量和复杂度方面优于现有的最先进方法。",
    "tldr": "NL-CS Net是一种结合传统优化方法的可解释性和基于网络方法的速度的新型CS方法，使用非局部先验，在重构质量和复杂度方面优于现有的最先进方法。",
    "en_tdlr": "NL-CS Net is a novel CS method that combines interpretable traditional optimization methods with the speed of network-based methods, using non-local prior. It outperforms existing state-of-the-art methods in terms of reconstruction quality and complexity."
}