{
    "title": "Machine Learning and VIIRS Satellite Retrievals for Skillful Fuel Moisture Content Monitoring in Wildfire Management. (arXiv:2305.11910v1 [cs.LG])",
    "abstract": "Monitoring the fuel moisture content (FMC) of vegetation is crucial for managing and mitigating the impact of wildland fires. The combination of in situ FMC observations with numerical weather prediction (NWP) models and satellite retrievals has enabled the development of machine learning (ML) models to estimate dead FMC retrievals over the contiguous US (CONUS). In this study, ML models were trained using variables from the National Water Model and the High-Resolution Rapid Refresh (HRRR) NWP models, and static variables characterizing the surface properties, as well as surface reflectances and land surface temperature (LST) retrievals from the VIIRS instrument on board the Suomi-NPP satellite system. Extensive hyper-parameter optimization yielded skillful FMC models compared to a daily climatography RMSE (+44\\%) and to an hourly climatography RMSE (+24\\%). Furthermore, VIIRS retrievals were important predictors for estimating FMC, contributing significantly as a group due to their hi",
    "link": "http://arxiv.org/abs/2305.11910",
    "context": "Title: Machine Learning and VIIRS Satellite Retrievals for Skillful Fuel Moisture Content Monitoring in Wildfire Management. (arXiv:2305.11910v1 [cs.LG])\nAbstract: Monitoring the fuel moisture content (FMC) of vegetation is crucial for managing and mitigating the impact of wildland fires. The combination of in situ FMC observations with numerical weather prediction (NWP) models and satellite retrievals has enabled the development of machine learning (ML) models to estimate dead FMC retrievals over the contiguous US (CONUS). In this study, ML models were trained using variables from the National Water Model and the High-Resolution Rapid Refresh (HRRR) NWP models, and static variables characterizing the surface properties, as well as surface reflectances and land surface temperature (LST) retrievals from the VIIRS instrument on board the Suomi-NPP satellite system. Extensive hyper-parameter optimization yielded skillful FMC models compared to a daily climatography RMSE (+44\\%) and to an hourly climatography RMSE (+24\\%). Furthermore, VIIRS retrievals were important predictors for estimating FMC, contributing significantly as a group due to their hi",
    "path": "papers/23/05/2305.11910.json",
    "total_tokens": 1007,
    "translated_title": "机器学习与VIIRS卫星检索在野火管理的燃料湿度监测中的技术应用",
    "translated_abstract": "监测植被燃料湿度对于野火的管理和减轻影响至关重要。利用野外燃料湿度观测、数值天气预报模型和卫星检索相结合的方法，开发了机器学习模型来估计美国连续本土上的死亡燃料湿度检索。本研究利用National Water Model和High-Resolution Rapid Refresh（HRRR）数值天气预报模型的变量以及表面属性，以及Suomi-NPP卫星系统上的VIIRS仪器的表面反射率和陆地表面温度检索，训练了机器学习模型。通过广泛的超参调优，与每日气候统计误差（+44％）和每小时气候统计误差（+24％）相比，得到了技术娴熟的FMC模型。此外，VIIRS检索作为一个群体对估计FMC是重要的预测因子，有显著的贡献。",
    "tldr": "本研究利用机器学习模型结合国家水资源模型和数值天气预测模型，以及卫星检索来预测美国连续本土上的死亡燃料湿度检索，超过了既有的每日和每小时气候统计方法。VIIRS检索对预测FMC有重要贡献。",
    "en_tdlr": "This study developed machine learning models to estimate dead fuel moisture content retrievals over the contiguous US using in situ observations, numerical weather prediction models, and satellite retrievals. By incorporating surface reflectances and land surface temperature retrievals from the VIIRS instrument, the models outperformed traditional daily and hourly climatology methods. VIIRS retrievals were found to be important predictors for estimating FMC."
}