{
    "title": "Voxel-wise classification for porosity investigation of additive manufactured parts with 3D unsupervised and (deeply) supervised neural networks. (arXiv:2305.07894v1 [cs.CE])",
    "abstract": "Additive Manufacturing (AM) has emerged as a manufacturing process that allows the direct production of samples from digital models. To ensure that quality standards are met in all manufactured samples of a batch, X-ray computed tomography (X-CT) is often used combined with automated anomaly detection. For the latter, deep learning (DL) anomaly detection techniques are increasingly, as they can be trained to be robust to the material being analysed and resilient towards poor image quality. Unfortunately, most recent and popular DL models have been developed for 2D image processing, thereby disregarding valuable volumetric information.  This study revisits recent supervised (UNet, UNet++, UNet 3+, MSS-UNet) and unsupervised (VAE, ceVAE, gmVAE, vqVAE) DL models for porosity analysis of AM samples from X-CT images and extends them to accept 3D input data with a 3D-patch pipeline for lower computational requirements, improved efficiency and generalisability. The supervised models were trai",
    "link": "http://arxiv.org/abs/2305.07894",
    "context": "Title: Voxel-wise classification for porosity investigation of additive manufactured parts with 3D unsupervised and (deeply) supervised neural networks. (arXiv:2305.07894v1 [cs.CE])\nAbstract: Additive Manufacturing (AM) has emerged as a manufacturing process that allows the direct production of samples from digital models. To ensure that quality standards are met in all manufactured samples of a batch, X-ray computed tomography (X-CT) is often used combined with automated anomaly detection. For the latter, deep learning (DL) anomaly detection techniques are increasingly, as they can be trained to be robust to the material being analysed and resilient towards poor image quality. Unfortunately, most recent and popular DL models have been developed for 2D image processing, thereby disregarding valuable volumetric information.  This study revisits recent supervised (UNet, UNet++, UNet 3+, MSS-UNet) and unsupervised (VAE, ceVAE, gmVAE, vqVAE) DL models for porosity analysis of AM samples from X-CT images and extends them to accept 3D input data with a 3D-patch pipeline for lower computational requirements, improved efficiency and generalisability. The supervised models were trai",
    "path": "papers/23/05/2305.07894.json",
    "total_tokens": 983,
    "translated_title": "利用三维无监督和(深度)监督神经网络进行增材制造件孔隙率检测的体素级分类",
    "translated_abstract": "增材制造已成为一种生产进程，可以直接从数字模型中生产样本。为了确保在整个制造批次中的所有产品样本都符合质量标准，通常使用X射线计算机断层扫描（X-CT）与自动化异常检测相结合。本研究重新审视了最近的监督和无监督深度学习（DL）模型，对来自X-CT图像的AM样品中的孔隙分析进行了扩展，以接受3D输入数据进行体素级分类，从而降低计算要求，提高效率和通用性。结果表明，使用体素级分类的三维DL模型在AM零件的孔隙率检测方面具有巨大的潜力。",
    "tldr": "本研究使用三维无监督和(深度)监督神经网络进行增材制造件孔隙率检测的体素级分类，得出使用体素级分类的三维DL模型在AM零件的孔隙率检测方面具有巨大潜力的结论。",
    "en_tdlr": "This study uses voxel-wise classification with 3D unsupervised and (deeply) supervised neural network models for porosity investigation of additive manufactured parts and concludes that 3D DL models using voxel-wise classification have great potential for porosity detection in AM parts."
}