{
    "title": "Graph-Based Reductions for Parametric and Weighted MDPs. (arXiv:2305.05739v1 [cs.LO])",
    "abstract": "We study the complexity of reductions for weighted reachability in parametric Markov decision processes. That is, we say a state p is never worse than q if for all valuations of the polynomial indeterminates it is the case that the maximal expected weight that can be reached from p is greater than the same value from q. In terms of computational complexity, we establish that determining whether p is never worse than q is coETR-complete. On the positive side, we give a polynomial-time algorithm to compute the equivalence classes of the order we study for Markov chains. Additionally, we describe and implement two inference rules to under-approximate the never-worse relation and empirically show that it can be used as an efficient preprocessing step for the analysis of large Markov decision processes.",
    "link": "http://arxiv.org/abs/2305.05739",
    "context": "Title: Graph-Based Reductions for Parametric and Weighted MDPs. (arXiv:2305.05739v1 [cs.LO])\nAbstract: We study the complexity of reductions for weighted reachability in parametric Markov decision processes. That is, we say a state p is never worse than q if for all valuations of the polynomial indeterminates it is the case that the maximal expected weight that can be reached from p is greater than the same value from q. In terms of computational complexity, we establish that determining whether p is never worse than q is coETR-complete. On the positive side, we give a polynomial-time algorithm to compute the equivalence classes of the order we study for Markov chains. Additionally, we describe and implement two inference rules to under-approximate the never-worse relation and empirically show that it can be used as an efficient preprocessing step for the analysis of large Markov decision processes.",
    "path": "papers/23/05/2305.05739.json",
    "total_tokens": 848,
    "translated_title": "基于图的方式降低参数化和加权MDP的复杂度",
    "translated_abstract": "我们研究了参数化马尔科夫决策过程中加权可达性的降低复杂度问题。即，我们说一个状态p永远不会比q更糟，如果对于多项式未知数的所有估值，从p到达的最大预期权重都比从q到达的最大预期权重大。在计算复杂度方面，我们确定了判断p是否永远不会比q更糟的coETR完全性。在积极方面，我们提供了一个多项式时间算法来计算我们所研究的马尔可夫链排序的等价类。此外，我们描述并实现了两个推理规则来欠估计“永不更糟”的关系，并且在实验中展示它可以用作大型马尔科夫决策过程分析的高效预处理步骤。",
    "tldr": "研究了参数化马尔科夫决策过程中加权可达性的降低复杂度问题，提出了一个多项式时间算法来计算我们所研究的马尔可夫链排序的等价类，并实现了两个规则来欠估计“永不更糟”的关系。",
    "en_tdlr": "This paper studies the complexity of reductions for weighted reachability in parametric Markov decision processes, and proposes a polynomial-time algorithm to compute the equivalence classes of the order. Additionally, two inference rules are implemented to under-approximate the never-worse relation."
}