{
    "title": "Towards Few-shot Entity Recognition in Document Images: A Graph Neural Network Approach Robust to Image Manipulation",
    "abstract": "arXiv:2305.14828v2 Announce Type: replace  Abstract: Recent advances of incorporating layout information, typically bounding box coordinates, into pre-trained language models have achieved significant performance in entity recognition from document images. Using coordinates can easily model the absolute position of each token, but they might be sensitive to manipulations in document images (e.g., shifting, rotation or scaling), especially when the training data is limited in few-shot settings. In this paper, we propose to further introduce the topological adjacency relationship among the tokens, emphasizing their relative position information. Specifically, we consider the tokens in the documents as nodes and formulate the edges based on the topological heuristics from the k-nearest bounding boxes. Such adjacency graphs are invariant to affine transformations including shifting, rotations and scaling. We incorporate these graphs into the pre-trained language model by adding graph neura",
    "link": "https://arxiv.org/abs/2305.14828",
    "context": "Title: Towards Few-shot Entity Recognition in Document Images: A Graph Neural Network Approach Robust to Image Manipulation\nAbstract: arXiv:2305.14828v2 Announce Type: replace  Abstract: Recent advances of incorporating layout information, typically bounding box coordinates, into pre-trained language models have achieved significant performance in entity recognition from document images. Using coordinates can easily model the absolute position of each token, but they might be sensitive to manipulations in document images (e.g., shifting, rotation or scaling), especially when the training data is limited in few-shot settings. In this paper, we propose to further introduce the topological adjacency relationship among the tokens, emphasizing their relative position information. Specifically, we consider the tokens in the documents as nodes and formulate the edges based on the topological heuristics from the k-nearest bounding boxes. Such adjacency graphs are invariant to affine transformations including shifting, rotations and scaling. We incorporate these graphs into the pre-trained language model by adding graph neura",
    "path": "papers/23/05/2305.14828.json",
    "total_tokens": 870,
    "translated_title": "针对文档图像中的少样本实体识别：一种对图像操作鲁棒的图神经网络方法",
    "translated_abstract": "最近，将布局信息（通常为边界框坐标）融入预训练语言模型，在文档图像中实现了实体识别取得了显著的性能。然而，使用坐标可以轻松地建模每个标记的绝对位置，但在文档图像（如平移、旋转或缩放等）的操纵下可能很敏感，尤其是在少样本设置下训练数据有限的情况下。为了解决这一问题，我们进一步引入了标记之间的拓扑相邻关系，强调它们的相对位置信息。具体而言，我们将文档中的标记视为节点，并根据最近邻边界框的拓扑启发式形成边。这些相邻图对仿射变换（包括平移、旋转和缩放）不变。我们通过将这些图结构结合到预训练语言模型中来实现这一目标。",
    "tldr": "本文提出了一种针对文档图像中的少样本实体识别问题的图神经网络方法，通过引入标记之间的拓扑相邻关系，强调相对位置信息，实现对图像操作具有鲁棒性。",
    "en_tdlr": "This paper presents a graph neural network approach for few-shot entity recognition in document images, which introduces topological adjacency relationship among tokens to emphasize relative position information, achieving robustness to image manipulation."
}