{
    "title": "Data-efficient Active Learning for Structured Prediction with Partial Annotation and Self-Training. (arXiv:2305.12634v2 [cs.CL] UPDATED)",
    "abstract": "In this work we propose a pragmatic method that reduces the annotation cost for structured label spaces using active learning. Our approach leverages partial annotation, which reduces labeling costs for structured outputs by selecting only the most informative sub-structures for annotation. We also utilize self-training to incorporate the current model's automatic predictions as pseudo-labels for un-annotated sub-structures. A key challenge in effectively combining partial annotation with self-training to reduce annotation cost is determining which sub-structures to select to label. To address this challenge, we adopt an error estimator to adaptively decide the partial selection ratio according to the current model's capability. In evaluations spanning four structured prediction tasks, we show that our combination of partial annotation and self-training using an adaptive selection ratio reduces annotation cost over strong full annotation baselines under a fair comparison scheme that ta",
    "link": "http://arxiv.org/abs/2305.12634",
    "context": "Title: Data-efficient Active Learning for Structured Prediction with Partial Annotation and Self-Training. (arXiv:2305.12634v2 [cs.CL] UPDATED)\nAbstract: In this work we propose a pragmatic method that reduces the annotation cost for structured label spaces using active learning. Our approach leverages partial annotation, which reduces labeling costs for structured outputs by selecting only the most informative sub-structures for annotation. We also utilize self-training to incorporate the current model's automatic predictions as pseudo-labels for un-annotated sub-structures. A key challenge in effectively combining partial annotation with self-training to reduce annotation cost is determining which sub-structures to select to label. To address this challenge, we adopt an error estimator to adaptively decide the partial selection ratio according to the current model's capability. In evaluations spanning four structured prediction tasks, we show that our combination of partial annotation and self-training using an adaptive selection ratio reduces annotation cost over strong full annotation baselines under a fair comparison scheme that ta",
    "path": "papers/23/05/2305.12634.json",
    "total_tokens": 990,
    "translated_title": "数据高效的结构化预测主动学习，针对部分注释和自训练",
    "translated_abstract": "在这项工作中，我们提出了一种实用的方法，利用主动学习来减少结构化标签空间的注释成本。我们的方法利用部分注释，通过只选择最具信息量的子结构进行注释，从而减少结构化输出的标注成本。我们还利用自训练，将当前模型的自动预测作为未注释子结构的伪标签。有效地结合部分注释和自训练以减少注释成本的一个关键挑战是确定选择哪些子结构进行标注。为了解决这个挑战，我们采用了一个错误估计器，根据当前模型的能力自适应地决定部分选择比例。通过对四个结构化预测任务进行评估，我们展示了我们的部分注释和自训练组合在一个公平比较方案下，使用自适应选择比例，可以降低注释成本。",
    "tldr": "我们提出了一种数据高效的结构化预测主动学习方法，利用部分注释和自训练来减少注释成本。我们利用部分注释选择最具信息量的子结构进行标注，并将自动预测结果作为未注释子结构的伪标签。我们通过使用错误估计器自适应地决定部分选择比例，有效地结合了这两种方法。在四个结构化预测任务的评估中，我们展示了使用自适应选择比例的部分注释和自训练组合可以降低注释成本。",
    "en_tdlr": "We propose a data-efficient active learning method for structured prediction, which reduces annotation cost by using partial annotation and self-training. We select informative sub-structures for annotation and incorporate automatic predictions as pseudo-labels for un-annotated sub-structures. By adaptively determining the partial selection ratio, our approach effectively combines partial annotation with self-training to reduce annotation cost. Evaluation results on four structured prediction tasks demonstrate the effectiveness of our approach in reducing annotation cost."
}