{
    "title": "Deep Reinforcement Learning for Interference Management in UAV-based 3D Networks: Potentials and Challenges. (arXiv:2305.07069v1 [cs.IT])",
    "abstract": "Modern cellular networks are multi-cell and use universal frequency reuse to maximize spectral efficiency. This results in high inter-cell interference. This problem is growing as cellular networks become three-dimensional with the adoption of unmanned aerial vehicles (UAVs). This is because the strength and number of interference links rapidly increase due to the line-of-sight channels in UAV communications. Existing interference management solutions need each transmitter to know the channel information of interfering signals, rendering them impractical due to excessive signaling overhead. In this paper, we propose leveraging deep reinforcement learning for interference management to tackle this shortcoming. In particular, we show that interference can still be effectively mitigated even without knowing its channel information. We then discuss novel approaches to scale the algorithms with linear/sublinear complexity and decentralize them using multi-agent reinforcement learning. By ha",
    "link": "http://arxiv.org/abs/2305.07069",
    "context": "Title: Deep Reinforcement Learning for Interference Management in UAV-based 3D Networks: Potentials and Challenges. (arXiv:2305.07069v1 [cs.IT])\nAbstract: Modern cellular networks are multi-cell and use universal frequency reuse to maximize spectral efficiency. This results in high inter-cell interference. This problem is growing as cellular networks become three-dimensional with the adoption of unmanned aerial vehicles (UAVs). This is because the strength and number of interference links rapidly increase due to the line-of-sight channels in UAV communications. Existing interference management solutions need each transmitter to know the channel information of interfering signals, rendering them impractical due to excessive signaling overhead. In this paper, we propose leveraging deep reinforcement learning for interference management to tackle this shortcoming. In particular, we show that interference can still be effectively mitigated even without knowing its channel information. We then discuss novel approaches to scale the algorithms with linear/sublinear complexity and decentralize them using multi-agent reinforcement learning. By ha",
    "path": "papers/23/05/2305.07069.json",
    "total_tokens": 854,
    "translated_title": "无人机三维网络中的干扰管理的深度强化学习：潜力与挑战",
    "translated_abstract": "现代蜂窝网络是多小区的，采用通用频率重用来最大化频谱效率。这导致高干扰。随着无人机(UAV)的采用，这个问题正在变得越来越严重，因为UAV通信中的直射频道会迅速增加干扰链路的强度和数量。现有的干扰管理解决方案需要每个发射器知道干扰信号的信道信息，从而导致过多的信令开销。在本文中，我们提出利用深度强化学习进行干扰管理来解决这个缺陷。特别地，我们表明即使不知道干扰信号的信道信息，也仍然可以有效地减轻干扰。然后，我们讨论了使用线性/亚线性复杂度扩展算法和使用多智能体强化学习对其进行分散的新方法。",
    "tldr": "本文提出了利用深度强化学习进行干扰管理的方法来解决UAV通信中的干扰问题，而无需先知干扰信号的信道信息。",
    "en_tdlr": "This paper proposes using deep reinforcement learning for interference management to solve the interference problem in UAV communications without prior knowledge of the channel information of interfering signals. Novel approaches to scaling the algorithms with linear/sublinear complexity and decentralizing them using multi-agent reinforcement learning are also discussed."
}