{
    "title": "SEEDS: Exponential SDE Solvers for Fast High-Quality Sampling from Diffusion Models. (arXiv:2305.14267v2 [cs.LG] UPDATED)",
    "abstract": "A potent class of generative models known as Diffusion Probabilistic Models (DPMs) has become prominent. A forward diffusion process adds gradually noise to data, while a model learns to gradually denoise. Sampling from pre-trained DPMs is obtained by solving differential equations (DE) defined by the learnt model, a process which has shown to be prohibitively slow. Numerous efforts on speeding-up this process have consisted on crafting powerful ODE solvers. Despite being quick, such solvers do not usually reach the optimal quality achieved by available slow SDE solvers. Our goal is to propose SDE solvers that reach optimal quality without requiring several hundreds or thousands of NFEs to achieve that goal. We propose Stochastic Explicit Exponential Derivative-free Solvers (SEEDS), improving and generalizing Exponential Integrator approaches to the stochastic case on several frameworks. After carefully analyzing the formulation of exact solutions of diffusion SDEs, we craft SEEDS to a",
    "link": "http://arxiv.org/abs/2305.14267",
    "context": "Title: SEEDS: Exponential SDE Solvers for Fast High-Quality Sampling from Diffusion Models. (arXiv:2305.14267v2 [cs.LG] UPDATED)\nAbstract: A potent class of generative models known as Diffusion Probabilistic Models (DPMs) has become prominent. A forward diffusion process adds gradually noise to data, while a model learns to gradually denoise. Sampling from pre-trained DPMs is obtained by solving differential equations (DE) defined by the learnt model, a process which has shown to be prohibitively slow. Numerous efforts on speeding-up this process have consisted on crafting powerful ODE solvers. Despite being quick, such solvers do not usually reach the optimal quality achieved by available slow SDE solvers. Our goal is to propose SDE solvers that reach optimal quality without requiring several hundreds or thousands of NFEs to achieve that goal. We propose Stochastic Explicit Exponential Derivative-free Solvers (SEEDS), improving and generalizing Exponential Integrator approaches to the stochastic case on several frameworks. After carefully analyzing the formulation of exact solutions of diffusion SDEs, we craft SEEDS to a",
    "path": "papers/23/05/2305.14267.json",
    "total_tokens": 992,
    "translated_title": "SEEDS: 指数随机微分方程求解器，用于快速高质量地从扩散模型中进行抽样",
    "translated_abstract": "一类强大的生成模型被称为扩散概率模型(DPMs)已经引起了人们的关注。前向扩散过程逐渐向数据添加噪声，而模型逐渐学习去除噪声。从预训练的DPMs中进行抽样是通过解决由学习模型定义的微分方程(DE)来实现的，这一过程被证明是过于缓慢的。许多加速这一过程的努力包括设计强大的ODE求解器。尽管速度很快，但这些求解器通常无法达到现有慢速SDE求解器所达到的最佳质量。我们的目标是提出一种SDE求解器，能够在不需要几百或上千次NFE(数值函数评估)的情况下达到最佳质量。我们提出了随机显式指数无导数求解器(SEEDS)，在多个框架上改进和推广了指数积分器方法以适应随机情况。在仔细分析扩散SDE确切解的公式后，我们设计了SEEDS。",
    "tldr": "本论文提出了SEEDS，这是一种指数随机微分方程求解器，用于从扩散模型中进行快速高质量的抽样。与现有的慢速求解器相比，SEEDS能够以更高的质量进行求解，且不需要大量的数值函数评估。",
    "en_tdlr": "This paper proposes SEEDS, an exponential stochastic differential equation solver for fast high-quality sampling from diffusion models. Compared to existing slow solvers, SEEDS achieves higher quality without requiring a large number of numerical function evaluations."
}