{
    "title": "Nichelle and Nancy: The Influence of Demographic Attributes and Tokenization Length on First Name Biases. (arXiv:2305.16577v1 [cs.CL])",
    "abstract": "Through the use of first name substitution experiments, prior research has demonstrated the tendency of social commonsense reasoning models to systematically exhibit social biases along the dimensions of race, ethnicity, and gender (An et al., 2023). Demographic attributes of first names, however, are strongly correlated with corpus frequency and tokenization length, which may influence model behavior independent of or in addition to demographic factors. In this paper, we conduct a new series of first name substitution experiments that measures the influence of these factors while controlling for the others. We find that demographic attributes of a name (race, ethnicity, and gender) and name tokenization length are both factors that systematically affect the behavior of social commonsense reasoning models.",
    "link": "http://arxiv.org/abs/2305.16577",
    "context": "Title: Nichelle and Nancy: The Influence of Demographic Attributes and Tokenization Length on First Name Biases. (arXiv:2305.16577v1 [cs.CL])\nAbstract: Through the use of first name substitution experiments, prior research has demonstrated the tendency of social commonsense reasoning models to systematically exhibit social biases along the dimensions of race, ethnicity, and gender (An et al., 2023). Demographic attributes of first names, however, are strongly correlated with corpus frequency and tokenization length, which may influence model behavior independent of or in addition to demographic factors. In this paper, we conduct a new series of first name substitution experiments that measures the influence of these factors while controlling for the others. We find that demographic attributes of a name (race, ethnicity, and gender) and name tokenization length are both factors that systematically affect the behavior of social commonsense reasoning models.",
    "path": "papers/23/05/2305.16577.json",
    "total_tokens": 782,
    "translated_title": "昵歇尔和南希：人口属性和标记长度对姓氏偏见的影响",
    "translated_abstract": "先前的研究通过使用姓名替换实验表明，社交常识推理模型的倾向性会沿着种族、民族和性别的维度，系统性地表现出社会偏见（An等人，2023年）。然而，名字的人口属性与语料库频率和标记化长度强相关，这可能会独立于人口统计因素或除人口统计因素之外影响模型行为。在本文中，我们进行了一系列新的名字替换实验，以衡量这些因素对模型行为的影响，同时对其他因素进行控制。我们发现，一个名字的人口属性（种族、民族和性别）和名字标记化长度都是影响社交常识推理模型行为的系统性因素。",
    "tldr": "本文研究了人口属性和标记长度对社交常识推理模型的影响，发现名字的人口属性和名字标记化长度都是影响社交常识推理模型行为的系统性因素。",
    "en_tdlr": "This paper studies the influence of demographic attributes and tokenization length on social commonsense reasoning models. Findings show that the demographic attributes and tokenization length of a name are both systematic factors that affect the behavior of these models."
}