{
    "title": "Breast Cancer Diagnosis Using Machine Learning Techniques. (arXiv:2305.02482v1 [cs.LG])",
    "abstract": "Breast cancer is one of the most threatening diseases in women's life; thus, the early and accurate diagnosis plays a key role in reducing the risk of death in a patient's life. Mammography stands as the reference technique for breast cancer screening; nevertheless, many countries still lack access to mammograms due to economic, social, and cultural issues. Latest advances in computational tools, infrared cameras and devices for bio-impedance quantification, have given a chance to emerge other reference techniques like thermography, infrared thermography, electrical impedance tomography and biomarkers found in blood tests, therefore being faster, reliable and cheaper than other methods. In the last two decades, the techniques mentioned above have been considered as parallel and extended approaches for breast cancer diagnosis, as well many authors concluded that false positives and false negatives rates are significantly reduced. Moreover, when a screening method works together with a c",
    "link": "http://arxiv.org/abs/2305.02482",
    "context": "Title: Breast Cancer Diagnosis Using Machine Learning Techniques. (arXiv:2305.02482v1 [cs.LG])\nAbstract: Breast cancer is one of the most threatening diseases in women's life; thus, the early and accurate diagnosis plays a key role in reducing the risk of death in a patient's life. Mammography stands as the reference technique for breast cancer screening; nevertheless, many countries still lack access to mammograms due to economic, social, and cultural issues. Latest advances in computational tools, infrared cameras and devices for bio-impedance quantification, have given a chance to emerge other reference techniques like thermography, infrared thermography, electrical impedance tomography and biomarkers found in blood tests, therefore being faster, reliable and cheaper than other methods. In the last two decades, the techniques mentioned above have been considered as parallel and extended approaches for breast cancer diagnosis, as well many authors concluded that false positives and false negatives rates are significantly reduced. Moreover, when a screening method works together with a c",
    "path": "papers/23/05/2305.02482.json",
    "total_tokens": 1047,
    "translated_title": "使用机器学习技术的乳腺癌诊断",
    "translated_abstract": "乳腺癌是女性生命中最具威胁的疾病之一，因此早期和准确的诊断在减少患者死亡风险方面起着关键作用。最近计算工具、红外相机以及生物阻抗定量设备的最新进展，为其他参考技术的出现提供了机会，如热成像、红外热成像、电阻抗层析成像以及血液检测中发现的生物标志物，因此比其他方法更快、更可靠和更便宜。在过去的20年中，上述技术一直被认为是乳腺癌诊断的并行和扩展方法，许多作者得出结论，假阳性和假阴性率显著降低。此外，当筛查方法与临床诊断一起使用时，可以提高诊断的准确性。本文回顾和讨论了来自不同源的最新机器学习技术在乳腺癌诊断中的应用，考虑它们的性能、可用性和重要性。",
    "tldr": "本文回顾和讨论了来自不同源的最新机器学习技术在乳腺癌诊断中的应用，其中包括热成像、红外热成像、电阻抗层析成像以及血液检测中发现的生物标志物，这些技术比传统方法更快、更可靠和更便宜，并且机器学习技术能够提高诊断的准确性。",
    "en_tdlr": "This paper reviews and discusses the latest machine learning techniques used in breast cancer diagnosis from different sources, including thermography, infrared thermography, electrical impedance tomography and biomarkers found in blood tests, which are faster, more reliable and cheaper than traditional methods, and machine learning techniques can improve the accuracy of diagnosis."
}