{
    "title": "Control of a simulated MRI scanner with deep reinforcement learning. (arXiv:2305.13979v1 [cs.LG])",
    "abstract": "Magnetic resonance imaging (MRI) is a highly versatile and widely used clinical imaging tool. The content of MRI images is controlled by an acquisition sequence, which coordinates the timing and magnitude of the scanner hardware activations, which shape and coordinate the magnetisation within the body, allowing a coherent signal to be produced. The use of deep reinforcement learning (DRL) to control this process, and determine new and efficient acquisition strategies in MRI, has not been explored. Here, we take a first step into this area, by using DRL to control a virtual MRI scanner, and framing the problem as a game that aims to efficiently reconstruct the shape of an imaging phantom using partially reconstructed magnitude images. Our findings demonstrate that DRL successfully completed two key tasks: inducing the virtual MRI scanner to generate useful signals and interpreting those signals to determine the phantom's shape. This proof-of-concept study highlights the potential of DRL",
    "link": "http://arxiv.org/abs/2305.13979",
    "context": "Title: Control of a simulated MRI scanner with deep reinforcement learning. (arXiv:2305.13979v1 [cs.LG])\nAbstract: Magnetic resonance imaging (MRI) is a highly versatile and widely used clinical imaging tool. The content of MRI images is controlled by an acquisition sequence, which coordinates the timing and magnitude of the scanner hardware activations, which shape and coordinate the magnetisation within the body, allowing a coherent signal to be produced. The use of deep reinforcement learning (DRL) to control this process, and determine new and efficient acquisition strategies in MRI, has not been explored. Here, we take a first step into this area, by using DRL to control a virtual MRI scanner, and framing the problem as a game that aims to efficiently reconstruct the shape of an imaging phantom using partially reconstructed magnitude images. Our findings demonstrate that DRL successfully completed two key tasks: inducing the virtual MRI scanner to generate useful signals and interpreting those signals to determine the phantom's shape. This proof-of-concept study highlights the potential of DRL",
    "path": "papers/23/05/2305.13979.json",
    "total_tokens": 1022,
    "tldr": "本文探究了使用深度强化学习控制MRI扫描器的潜力，并利用虚拟MRI扫描仪进行了概念验证，证明DRL成功地诱导扫描仪产生有用信号并解释成像模型的形状。",
    "en_tdlr": "This paper explores the potential of using deep reinforcement learning to control MRI scanners and performs a proof-of-concept study using a virtual MRI scanner, demonstrating that DRL successfully induces the scanner to generate useful signals and interpret the shape of an imaging phantom."
}