{
    "title": "Noise robust neural network architecture. (arXiv:2305.09276v1 [cs.CV])",
    "abstract": "In which we propose neural network architecture (dune neural network) for recognizing general noisy image without adding any artificial noise in the training data. By representing each free parameter of the network as an uncertainty interval, and applying a linear transformation to each input element, we show that the resulting architecture achieves decent noise robustness when faced with input data with white noise. We apply simple dune neural networks for MNIST dataset and demonstrate that even for very noisy input images which are hard for human to recognize, our approach achieved better test set accuracy than human without dataset augmentation. We also find that our method is robust for many other examples with various background patterns added.",
    "link": "http://arxiv.org/abs/2305.09276",
    "context": "Title: Noise robust neural network architecture. (arXiv:2305.09276v1 [cs.CV])\nAbstract: In which we propose neural network architecture (dune neural network) for recognizing general noisy image without adding any artificial noise in the training data. By representing each free parameter of the network as an uncertainty interval, and applying a linear transformation to each input element, we show that the resulting architecture achieves decent noise robustness when faced with input data with white noise. We apply simple dune neural networks for MNIST dataset and demonstrate that even for very noisy input images which are hard for human to recognize, our approach achieved better test set accuracy than human without dataset augmentation. We also find that our method is robust for many other examples with various background patterns added.",
    "path": "papers/23/05/2305.09276.json",
    "total_tokens": 849,
    "translated_title": "噪声鲁棒的神经网络架构",
    "translated_abstract": "在本文中，我们提出了一种名为“Dune Neural Network”的神经网络架构，用于识别一般噪声图像，而不需要在训练数据中添加任何人工噪声。通过将网络的每个自由参数表示为不确定性区间，并对每个输入元素应用线性变换，我们展示了所得到的架构在面对有白噪声的输入数据时具有相当好的噪声鲁棒性。我们将简单的Dune神经网络应用于MNIST数据集，并证明了即使在对于人类难以识别的非常嘈杂的输入图像上，我们的方法也比使用数据增强的人类在测试集上实现了更好的准确度。我们还发现，我们的方法对于许多其他添加了各种背景模式的示例都很鲁棒。",
    "tldr": "本文提出了一种名为“Dune Neural Network”的神经网络架构，通过将网络的每个自由参数表示为不确定性区间，并对每个输入元素应用线性变换，实现了对于白噪声数据的噪声鲁棒性能，即使为非常嘈杂的输入图像，此方法也比使用数据增强的人类在测试集上实现了更好的准确度。",
    "en_tdlr": "The paper proposes a neural network architecture titled \"Dune Neural Network\" for recognizing noisy images without adding artificial noise during training. The network achieves noise robustness by representing each free parameter as an uncertainty interval and applying a linear transformation to each input element. The method also achieves better accuracy than humans on testing even very noisy images without data augmentation and is robust for other examples with various background patterns."
}