{
    "title": "Testing System Intelligence. (arXiv:2305.11472v1 [cs.AI])",
    "abstract": "We discuss the adequacy of tests for intelligent systems and practical problems raised by their implementation. We propose the replacement test as the ability of a system to replace successfully another system performing a task in a given context. We show how it can characterize salient aspects of human intelligence that cannot be taken into account by the Turing test. We argue that building intelligent systems passing the replacement test involves a series of technical problems that are outside the scope of current AI. We present a framework for implementing the proposed test and validating the properties of the intelligent systems. We discuss the inherent limitations of intelligent system validation and advocate new theoretical foundations for extending existing rigorous test methods. We suggest that the replacement test, based on the complementarity of skills between human and machine, can lead to a multitude of intelligence concepts reflecting the ability to combine data-based and ",
    "link": "http://arxiv.org/abs/2305.11472",
    "context": "Title: Testing System Intelligence. (arXiv:2305.11472v1 [cs.AI])\nAbstract: We discuss the adequacy of tests for intelligent systems and practical problems raised by their implementation. We propose the replacement test as the ability of a system to replace successfully another system performing a task in a given context. We show how it can characterize salient aspects of human intelligence that cannot be taken into account by the Turing test. We argue that building intelligent systems passing the replacement test involves a series of technical problems that are outside the scope of current AI. We present a framework for implementing the proposed test and validating the properties of the intelligent systems. We discuss the inherent limitations of intelligent system validation and advocate new theoretical foundations for extending existing rigorous test methods. We suggest that the replacement test, based on the complementarity of skills between human and machine, can lead to a multitude of intelligence concepts reflecting the ability to combine data-based and ",
    "path": "papers/23/05/2305.11472.json",
    "total_tokens": 833,
    "translated_title": "智能系统测试探讨",
    "translated_abstract": "我们讨论了针对智能系统的测试的充分性以及其实施带来的实际问题。我们提出了替换测试作为系统在给定环境下成功替换另一个执行任务的系统的能力。我们展示了它如何表征人类智能的显著方面，这些方面不能被图灵测试考虑到。我们认为，构建通过替换测试的智能系统涉及到一系列当前人工智能所无法解决的技术问题。我们提出了一个框架来实施所提出的测试并验证智能系统的属性。我们讨论了智能系统验证的固有局限性，并倡导新的理论基础以扩展现有的严格测试方法。我们建议基于人类和机器之间技能互补性的替换测试可以导致多种反映结合基于数据和知识的能力的智能概念。",
    "tldr": "该论文讨论了以往智能系统测试的不足和所提出的替换测试作为一种完善测试的能力，该测试反映了人类和机器之间的技能互补性，能够构建更多反映智能可能的概念和属性。",
    "en_tdlr": "This paper discusses the inadequacy of previous tests for intelligent systems and proposes the replacement test as a more comprehensive measure, which reflects the complementarity of human and machine skills, to build a broader conceptual framework for testing system intelligence."
}