{
    "title": "Self-Supervised Learning for Physiologically-Based Pharmacokinetic Modeling in Dynamic PET. (arXiv:2305.10569v1 [eess.IV])",
    "abstract": "Dynamic positron emission tomography imaging (dPET) provides temporally resolved images of a tracer enabling a quantitative measure of physiological processes. Voxel-wise physiologically-based pharmacokinetic (PBPK) modeling of the time activity curves (TAC) can provide relevant diagnostic information for clinical workflow. Conventional fitting strategies for TACs are slow and ignore the spatial relation between neighboring voxels. We train a spatio-temporal UNet to estimate the kinetic parameters given TAC from F-18-fluorodeoxyglucose (FDG) dPET. This work introduces a self-supervised loss formulation to enforce the similarity between the measured TAC and those generated with the learned kinetic parameters. Our method provides quantitatively comparable results at organ-level to the significantly slower conventional approaches, while generating pixel-wise parametric images which are consistent with expected physiology. To the best of our knowledge, this is the first self-supervised net",
    "link": "http://arxiv.org/abs/2305.10569",
    "context": "Title: Self-Supervised Learning for Physiologically-Based Pharmacokinetic Modeling in Dynamic PET. (arXiv:2305.10569v1 [eess.IV])\nAbstract: Dynamic positron emission tomography imaging (dPET) provides temporally resolved images of a tracer enabling a quantitative measure of physiological processes. Voxel-wise physiologically-based pharmacokinetic (PBPK) modeling of the time activity curves (TAC) can provide relevant diagnostic information for clinical workflow. Conventional fitting strategies for TACs are slow and ignore the spatial relation between neighboring voxels. We train a spatio-temporal UNet to estimate the kinetic parameters given TAC from F-18-fluorodeoxyglucose (FDG) dPET. This work introduces a self-supervised loss formulation to enforce the similarity between the measured TAC and those generated with the learned kinetic parameters. Our method provides quantitatively comparable results at organ-level to the significantly slower conventional approaches, while generating pixel-wise parametric images which are consistent with expected physiology. To the best of our knowledge, this is the first self-supervised net",
    "path": "papers/23/05/2305.10569.json",
    "total_tokens": 897,
    "translated_title": "动态PET中的自监督学习用于生理药代动力学建模",
    "translated_abstract": "动态正电子发射断层成像（dPET）可以提供药物示踪剂的时间分辨图像，从而定量测量生理过程。基于体素的生理药代动力学（PBPK）模型可以对时间-活性曲线（TAC）进行体素级别的建模，为临床工作流程提供相关诊断信息。传统的TAC拟合策略速度慢，并忽略相邻体素之间的空间关系。我们训练了一个时空UNet来估计给定F-18脱氧葡萄糖（FDG）dPET的TAC的动力学参数。本研究引入了自监督损失公式来强制测量TAC与使用学习到的动力学参数生成的TAC之间的相似性。我们的方法提供了器官级别上可比较的结果，与传统方法相比速度显著更快，同时生成的像素级参数图与预期的生理学一致。据我们所知，这是第一个自监督网络应用于PBPk模型的工作。",
    "tldr": "本研究引入自监督学习，提供了一种快速而准确的药代动力学建模方法，可以生成与预期生理学一致的像素级参数图。",
    "en_tdlr": "This study introduces self-supervised learning and provides a rapid and accurate method for pharmacokinetic modeling, which can generate pixel-wise parametric images consistent with expected physiology."
}