{
    "title": "Frequency-aware Dimension Selection for Static Word Embedding by Mixed Product Distance. (arXiv:2305.07826v1 [cs.CL])",
    "abstract": "Static word embedding is still useful, particularly for context-unavailable tasks, because in the case of no context available, pre-trained language models often perform worse than static word embeddings. Although dimension is a key factor determining the quality of static word embeddings, automatic dimension selection is rarely discussed. In this paper, we investigate the impact of word frequency on the dimension selection, and empirically find that word frequency is so vital that it needs to be taken into account during dimension selection. Based on such an empirical finding, this paper proposes a dimension selection method that uses a metric (Mixed Product Distance, MPD) to select a proper dimension for word embedding algorithms without training any word embedding. Through applying a post-processing function to oracle matrices, the MPD-based method can de-emphasize the impact of word frequency. Experiments on both context-unavailable and context-available tasks demonstrate the bette",
    "link": "http://arxiv.org/abs/2305.07826",
    "context": "Title: Frequency-aware Dimension Selection for Static Word Embedding by Mixed Product Distance. (arXiv:2305.07826v1 [cs.CL])\nAbstract: Static word embedding is still useful, particularly for context-unavailable tasks, because in the case of no context available, pre-trained language models often perform worse than static word embeddings. Although dimension is a key factor determining the quality of static word embeddings, automatic dimension selection is rarely discussed. In this paper, we investigate the impact of word frequency on the dimension selection, and empirically find that word frequency is so vital that it needs to be taken into account during dimension selection. Based on such an empirical finding, this paper proposes a dimension selection method that uses a metric (Mixed Product Distance, MPD) to select a proper dimension for word embedding algorithms without training any word embedding. Through applying a post-processing function to oracle matrices, the MPD-based method can de-emphasize the impact of word frequency. Experiments on both context-unavailable and context-available tasks demonstrate the bette",
    "path": "papers/23/05/2305.07826.json",
    "total_tokens": 915,
    "translated_title": "基于混合积距离的静态词向量频率感知的维度选择",
    "translated_abstract": "对于无法使用上下文的任务，静态词向量仍然有用，因为在没有上下文可用的情况下，预训练的语言模型往往比静态词向量表现得更差。尽管维度是确定静态词向量质量的关键因素，但自动维度选择很少被讨论。本文研究了词频对维度选择的影响，并经验证明了词频是非常关键的，需要在维度选择时进行考量。基于这样的实证发现，该论文提出了一种维度选择方法，使用一种度量（混合积距离，MPD）来为字嵌入算法选择适当的维度，而无需训练任何词向量。通过对预测矩阵应用后处理函数，基于MPD的方法可以降低词频的影响。针对无上下文和有上下文任务的实验表明，与现有的词向量方法相比，我们的方法表现更佳。",
    "tldr": "本论文研究了词频对维度选择的影响，在此基础上提出了一种使用混合积距离的静态词向量维度选择方法，通过降低词频的影响，实现了比现有方法更好的性能。",
    "en_tdlr": "This paper investigates the impact of word frequency on dimension selection for static word embedding and proposes a frequency-aware dimension selection method using Mixed Product Distance. The method achieves better performance by de-emphasizing the impact of word frequency."
}