{
    "title": "Financial misstatement detection: a realistic evaluation. (arXiv:2305.17457v1 [cs.CL])",
    "abstract": "In this work, we examine the evaluation process for the task of detecting financial reports with a high risk of containing a misstatement. This task is often referred to, in the literature, as ``misstatement detection in financial reports''. We provide an extensive review of the related literature. We propose a new, realistic evaluation framework for the task which, unlike a large part of the previous work: (a) focuses on the misstatement class and its rarity, (b) considers the dimension of time when splitting data into training and test and (c) considers the fact that misstatements can take a long time to detect. Most importantly, we show that the evaluation process significantly affects system performance, and we analyze the performance of different models and feature types in the new realistic framework.",
    "link": "http://arxiv.org/abs/2305.17457",
    "context": "Title: Financial misstatement detection: a realistic evaluation. (arXiv:2305.17457v1 [cs.CL])\nAbstract: In this work, we examine the evaluation process for the task of detecting financial reports with a high risk of containing a misstatement. This task is often referred to, in the literature, as ``misstatement detection in financial reports''. We provide an extensive review of the related literature. We propose a new, realistic evaluation framework for the task which, unlike a large part of the previous work: (a) focuses on the misstatement class and its rarity, (b) considers the dimension of time when splitting data into training and test and (c) considers the fact that misstatements can take a long time to detect. Most importantly, we show that the evaluation process significantly affects system performance, and we analyze the performance of different models and feature types in the new realistic framework.",
    "path": "papers/23/05/2305.17457.json",
    "total_tokens": 805,
    "translated_title": "财务误报检测：现实评估",
    "translated_abstract": "本文旨在探讨检测金融报告中高风险误报的评估方法，该任务在文献中常被称为“财务报告中的误报检测”。我们对相关文献进行了广泛的综述。我们为该任务提出了一个新的、现实的评估框架，与以往的工作相比：(a)专注于误报分类及其罕见性，(b)将数据按照时间分为训练和测试集，和(c)考虑误报可能需要很长时间才能被检测到。最重要的是，我们发现评估过程显著影响系统性能，并分析了不同模型和特征类型在新的现实框架下的表现。",
    "tldr": "本文提出了一个新的、现实的财务误报检测评估框架，并发现评估过程显著影响系统性能，分析了不同模型和特征类型在新的现实框架下的表现。",
    "en_tdlr": "The paper proposes a new realistic evaluation framework for financial misstatement detection task which focuses on the misstatement class and its rarity, considers the dimension of time when splitting data into training and test, and the fact that misstatements can take a long time to detect; importantly, it is shown that the evaluation process significantly affects system performance, and analyses the performance of different models and feature types in the new realistic framework."
}