{
    "title": "The Deep Promotion Time Cure Model. (arXiv:2305.11575v1 [stat.ML])",
    "abstract": "We propose a novel method for predicting time-to-event in the presence of cure fractions based on flexible survivals models integrated into a deep neural network framework. Our approach allows for non-linear relationships and high-dimensional interactions between covariates and survival and is suitable for large-scale applications. Furthermore, we allow the method to incorporate an identified predictor formed of an additive decomposition of interpretable linear and non-linear effects and add an orthogonalization layer to capture potential higher dimensional interactions. We demonstrate the usefulness and computational efficiency of our method via simulations and apply it to a large portfolio of US mortgage loans. Here, we find not only a better predictive performance of our framework but also a more realistic picture of covariate effects.",
    "link": "http://arxiv.org/abs/2305.11575",
    "context": "Title: The Deep Promotion Time Cure Model. (arXiv:2305.11575v1 [stat.ML])\nAbstract: We propose a novel method for predicting time-to-event in the presence of cure fractions based on flexible survivals models integrated into a deep neural network framework. Our approach allows for non-linear relationships and high-dimensional interactions between covariates and survival and is suitable for large-scale applications. Furthermore, we allow the method to incorporate an identified predictor formed of an additive decomposition of interpretable linear and non-linear effects and add an orthogonalization layer to capture potential higher dimensional interactions. We demonstrate the usefulness and computational efficiency of our method via simulations and apply it to a large portfolio of US mortgage loans. Here, we find not only a better predictive performance of our framework but also a more realistic picture of covariate effects.",
    "path": "papers/23/05/2305.11575.json",
    "total_tokens": 842,
    "translated_title": "深度推进时间治愈模型",
    "translated_abstract": "我们提出了一种基于灵活的生存模型集成到深度神经网络框架中用于预测存在治愈分数时的时间至事件的新方法。我们的方法允许协变量和生存之间的非线性关系和高维交互，并适用于大规模应用。此外，我们允许该方法合并一个由可解释的线性和非线性效应的附加分解形成的已识别的预测器，并添加正交化层以捕获潜在的更高维交互。我们通过模拟证明了我们的方法的有用性和计算效率，并将其应用于大量的美国抵押贷款组合。在此，我们不仅发现了我们框架更好的预测性能，而且发现了更真实的协变量效应。",
    "tldr": "该研究提出了一种新方法，将灵活的生存模型集成进深度神经网络框架中，实现预测存在治愈分数时的时间至事件。该方法可适用于大规模应用，允许协变量和生存之间的非线性关系和高维交互，从而获得更好的预测性能和更真实的协变量效应。",
    "en_tdlr": "This study proposes a new method that integrates flexible survival models into a deep neural network framework to predict time-to-event in the presence of cure fractions. The method allows for non-linear relationships and high-dimensional interactions between covariates and survival, suitable for large-scale applications, and results in better predictive performance and more realistic covariate effects."
}