{
    "title": "Advancements in Arabic Grammatical Error Detection and Correction: An Empirical Investigation. (arXiv:2305.14734v1 [cs.CL])",
    "abstract": "Grammatical error correction (GEC) is a well-explored problem in English with many existing models and datasets. However, research on GEC in morphologically rich languages has been limited due to challenges such as data scarcity and language complexity. In this paper, we present the first results on Arabic GEC by using two newly developed Transformer-based pretrained sequence-to-sequence models. We address the task of multi-class Arabic grammatical error detection (GED) and present the first results on multi-class Arabic GED. We show that using GED information as auxiliary input in GEC models improves GEC performance across three datasets spanning different genres. Moreover, we also investigate the use of contextual morphological preprocessing in aiding GEC systems. Our models achieve state-of-the-art results on two Arabic GEC shared tasks datasets and establish a strong benchmark on a newly created dataset.",
    "link": "http://arxiv.org/abs/2305.14734",
    "context": "Title: Advancements in Arabic Grammatical Error Detection and Correction: An Empirical Investigation. (arXiv:2305.14734v1 [cs.CL])\nAbstract: Grammatical error correction (GEC) is a well-explored problem in English with many existing models and datasets. However, research on GEC in morphologically rich languages has been limited due to challenges such as data scarcity and language complexity. In this paper, we present the first results on Arabic GEC by using two newly developed Transformer-based pretrained sequence-to-sequence models. We address the task of multi-class Arabic grammatical error detection (GED) and present the first results on multi-class Arabic GED. We show that using GED information as auxiliary input in GEC models improves GEC performance across three datasets spanning different genres. Moreover, we also investigate the use of contextual morphological preprocessing in aiding GEC systems. Our models achieve state-of-the-art results on two Arabic GEC shared tasks datasets and establish a strong benchmark on a newly created dataset.",
    "path": "papers/23/05/2305.14734.json",
    "total_tokens": 981,
    "translated_title": "阿拉伯语语法错误检测和修正的进展：一项实证调查",
    "translated_abstract": "语法错误纠正(GEC)是一个经过深入研究的英语问题，在许多已有的模型和数据集的基础上进行了研究。然而，由于数据稀缺和语言复杂性等挑战，对形态丰富的语言进行GEC研究的限制较多。本文通过使用两个新开发的基于Transformer预训练序列到序列模型，首次在阿拉伯语GEC中获得了结果。我们解决了多类阿拉伯语语法错误检测(GED)任务，并首次在多类阿拉伯语GED上获得了结果。我们表明，在跨越不同类型的三个数据集上使用GED信息作为辅助输入的GEC模型可以提高GEC性能。此外，我们还研究了上下文形态预处理在帮助GEC系统方面的应用。我们的模型在两个阿拉伯语GEC共享任务数据集上取得了最新结果，并在新创建的数据集上建立了一个强有力的基准。",
    "tldr": "本文使用了两个预训练的序列到序列模型在阿拉伯语GEC方面取得了最新的结果，并提出下文第一阿拉伯语多类语法错误检测结果。文章表明，使用GED作为GEC模型的辅助输入有助于提高性能，而上下文形态预处理有助于接着GEC系统，文章在两个共享任务数据集上取得了最新的GEC结果以及一个强有力的基准。",
    "en_tdlr": "This paper presents the first results on Arabic GEC using two Transformer-based pretrained sequence-to-sequence models. GED information as auxiliary input in GEC models improves performance and contextual morphological preprocessing aids GEC systems. The models achieve state-of-the-art results on two Arabic GEC shared tasks datasets and establish a strong benchmark on a newly created dataset."
}