{
    "title": "Interactive Acquisition of Fine-grained Visual Concepts by Exploiting Semantics of Generic Characterizations in Discourse. (arXiv:2305.03461v1 [cs.CL])",
    "abstract": "Interactive Task Learning (ITL) concerns learning about unforeseen domain concepts via natural interactions with human users. The learner faces a number of significant constraints: learning should be online, incremental and few-shot, as it is expected to perform tangible belief updates right after novel words denoting unforeseen concepts are introduced. In this work, we explore a challenging symbol grounding task--discriminating among object classes that look very similar--within the constraints imposed by ITL. We demonstrate empirically that more data-efficient grounding results from exploiting the truth-conditions of the teacher's generic statements (e.g., \"Xs have attribute Z.\") and their implicatures in context (e.g., as an answer to \"How are Xs and Ys different?\", one infers Y lacks attribute Z).",
    "link": "http://arxiv.org/abs/2305.03461",
    "context": "Title: Interactive Acquisition of Fine-grained Visual Concepts by Exploiting Semantics of Generic Characterizations in Discourse. (arXiv:2305.03461v1 [cs.CL])\nAbstract: Interactive Task Learning (ITL) concerns learning about unforeseen domain concepts via natural interactions with human users. The learner faces a number of significant constraints: learning should be online, incremental and few-shot, as it is expected to perform tangible belief updates right after novel words denoting unforeseen concepts are introduced. In this work, we explore a challenging symbol grounding task--discriminating among object classes that look very similar--within the constraints imposed by ITL. We demonstrate empirically that more data-efficient grounding results from exploiting the truth-conditions of the teacher's generic statements (e.g., \"Xs have attribute Z.\") and their implicatures in context (e.g., as an answer to \"How are Xs and Ys different?\", one infers Y lacks attribute Z).",
    "path": "papers/23/05/2305.03461.json",
    "total_tokens": 729,
    "translated_title": "通过利用语境中的泛指表达探究交互式获取精细视觉概念",
    "translated_abstract": "交互式任务学习涉及通过与人类用户自然交互来学习未知领域概念。本文中，我们在ITL的限制下，探索了一项具有挑战性的符号接地任务——区分外观非常相似的物体类别。我们通过实证证明，利用教师的泛指语句（例如，“X具有属性Z。”）以及它们在上下文中的暗示（例如，“X和Y有什么不同？”的回答是，“推断Y不具备属性Z”）可以获得更高效的数据接地结果。",
    "tldr": "本文研究了交互式任务学习中的符号接地任务，在教师的泛指语句和上下文中的暗示下实现了更高效的数据接地结果。",
    "en_tdlr": "This paper explores the symbol grounding task in Interactive Task Learning, and shows that exploiting the teacher's generic statements and their implicatures in context can lead to more efficient data grounding results."
}