{
    "title": "Employing Explainable Artificial Intelligence (XAI) Methodologies to Analyze the Correlation between Input Variables and Tensile Strength in Additively Manufactured Samples. (arXiv:2305.18426v1 [cs.LG])",
    "abstract": "This research paper explores the impact of various input parameters, including Infill percentage, Layer Height, Extrusion Temperature, and Print Speed, on the resulting Tensile Strength in objects produced through additive manufacturing. The main objective of this study is to enhance our understanding of the correlation between the input parameters and Tensile Strength, as well as to identify the key factors influencing the performance of the additive manufacturing process. To achieve this objective, we introduced the utilization of Explainable Artificial Intelligence (XAI) techniques for the first time, which allowed us to analyze the data and gain valuable insights into the system's behavior. Specifically, we employed SHAP (SHapley Additive exPlanations), a widely adopted framework for interpreting machine learning model predictions, to provide explanations for the behavior of a machine learning model trained on the data. Our findings reveal that the Infill percentage and Extrusion T",
    "link": "http://arxiv.org/abs/2305.18426",
    "context": "Title: Employing Explainable Artificial Intelligence (XAI) Methodologies to Analyze the Correlation between Input Variables and Tensile Strength in Additively Manufactured Samples. (arXiv:2305.18426v1 [cs.LG])\nAbstract: This research paper explores the impact of various input parameters, including Infill percentage, Layer Height, Extrusion Temperature, and Print Speed, on the resulting Tensile Strength in objects produced through additive manufacturing. The main objective of this study is to enhance our understanding of the correlation between the input parameters and Tensile Strength, as well as to identify the key factors influencing the performance of the additive manufacturing process. To achieve this objective, we introduced the utilization of Explainable Artificial Intelligence (XAI) techniques for the first time, which allowed us to analyze the data and gain valuable insights into the system's behavior. Specifically, we employed SHAP (SHapley Additive exPlanations), a widely adopted framework for interpreting machine learning model predictions, to provide explanations for the behavior of a machine learning model trained on the data. Our findings reveal that the Infill percentage and Extrusion T",
    "path": "papers/23/05/2305.18426.json",
    "total_tokens": 988,
    "translated_title": "应用可解释的人工智能方法探究增材制造样品中输入变量和拉伸强度的相关性",
    "translated_abstract": "本研究探讨了包括Infill百分比、层高、挤出温度和打印速度在内的各种输入参数对于产生的增材制造物体的拉伸强度的影响。本研究的主要目标是提高我们对输入参数和拉伸强度之间相关性的理解，以及确定影响增材制造过程性能的关键因素。为了实现这一目标，我们首次引入了可解释的人工智能（XAI）技术，通过SHAP（Shapley Additive Explanations）方法解释机器学习模型的预测行为，以分析数据并获得有价值的洞察。我们的发现表明，Infill百分比和挤出温度与拉伸强度具有最高的相关性，分别为正相关和负相关。使用XAI技术可以更好地理解输入参数和增材制造中拉伸强度之间的相关性。",
    "tldr": "本研究使用可解释的人工智能方法，探究了增材制造中输入变量和拉伸强度的相关性，发现Infill百分比和挤出温度对于拉伸强度具有最高的正相关和负相关影响。"
}