{
    "title": "Support Vector Machine Guided Reproducing Kernel Particle Method for Image-Based Modeling of Microstructures. (arXiv:2305.16402v1 [cs.LG])",
    "abstract": "This work presents an approach for automating the discretization and approximation procedures in constructing digital representations of composites from Micro-CT images featuring intricate microstructures. The proposed method is guided by the Support Vector Machine (SVM) classification, offering an effective approach for discretizing microstructural images. An SVM soft margin training process is introduced as a classification of heterogeneous material points, and image segmentation is accomplished by identifying support vectors through a local regularized optimization problem. In addition, an Interface-Modified Reproducing Kernel Particle Method (IM-RKPM) is proposed for appropriate approximations of weak discontinuities across material interfaces. The proposed method modifies the smooth kernel functions with a regularized heavy-side function concerning the material interfaces to alleviate Gibb's oscillations. This IM-RKPM is formulated without introducing duplicated degrees of freedom",
    "link": "http://arxiv.org/abs/2305.16402",
    "context": "Title: Support Vector Machine Guided Reproducing Kernel Particle Method for Image-Based Modeling of Microstructures. (arXiv:2305.16402v1 [cs.LG])\nAbstract: This work presents an approach for automating the discretization and approximation procedures in constructing digital representations of composites from Micro-CT images featuring intricate microstructures. The proposed method is guided by the Support Vector Machine (SVM) classification, offering an effective approach for discretizing microstructural images. An SVM soft margin training process is introduced as a classification of heterogeneous material points, and image segmentation is accomplished by identifying support vectors through a local regularized optimization problem. In addition, an Interface-Modified Reproducing Kernel Particle Method (IM-RKPM) is proposed for appropriate approximations of weak discontinuities across material interfaces. The proposed method modifies the smooth kernel functions with a regularized heavy-side function concerning the material interfaces to alleviate Gibb's oscillations. This IM-RKPM is formulated without introducing duplicated degrees of freedom",
    "path": "papers/23/05/2305.16402.json",
    "total_tokens": 836,
    "translated_title": "基于支持向量机引导再生核颗粒方法的微观结构图像建模",
    "translated_abstract": "本文提出了一种方法，通过支持向量机（SVM）分类引导来自动进行数字复合材料的构建，该复合材料由具有复杂微结构的微CT图像构成。引入SVM软间隔训练过程，对异质材料点进行分类，通过识别支持向量通过本地常规化优化问题实现图像分割。此外，还提出了一个界面修改的再生核颗粒法（IM-RKPM），用于适当近似跨材料界面的弱间歇性。提出的方法通过在材料界面处使用常规化重馈函数来修改平滑内核函数以减轻吉布斯振荡。该IM-RKPM是在不引入重复自由度的情况下制定的。",
    "tldr": "本文基于支持向量机引导再生核颗粒方法，提出了一种自动化数字表示复合材料的构建方案，并且引入了一个新的界面修改的再生核颗粒法以适当近似弱不连续性。",
    "en_tdlr": "This paper proposes an approach for automating the construction of digital representations of composites from Micro-CT images featuring intricate microstructures, guided by the Support Vector Machine (SVM) classification. Additionally, an Interface-Modified Reproducing Kernel Particle Method (IM-RKPM) is introduced for appropriate approximations of weak discontinuities across material interfaces."
}