{
    "title": "Practical algorithms and experimentally validated incentives for equilibrium-based fair division (A-CEEI). (arXiv:2305.11406v1 [cs.GT])",
    "abstract": "Approximate Competitive Equilibrium from Equal Incomes (A-CEEI) is an equilibrium-based solution concept for fair division of discrete items to agents with combinatorial demands. In theory, it is known that in asymptotically large markets:  1. For incentives, the A-CEEI mechanism is Envy-Free-but-for-Tie-Breaking (EF-TB), which implies that it is Strategyproof-in-the-Large (SP-L).  2. From a computational perspective, computing the equilibrium solution is unfortunately a computationally intractable problem (in the worst-case, assuming $\\textsf{PPAD}\\ne \\textsf{FP}$).  We develop a new heuristic algorithm that outperforms the previous state-of-the-art by multiple orders of magnitude. This new, faster algorithm lets us perform experiments on real-world inputs for the first time. We discover that with real-world preferences, even in a realistic implementation that satisfies the EF-TB and SP-L properties, agents may have surprisingly simple and plausible deviations from truthful reporting ",
    "link": "http://arxiv.org/abs/2305.11406",
    "context": "Title: Practical algorithms and experimentally validated incentives for equilibrium-based fair division (A-CEEI). (arXiv:2305.11406v1 [cs.GT])\nAbstract: Approximate Competitive Equilibrium from Equal Incomes (A-CEEI) is an equilibrium-based solution concept for fair division of discrete items to agents with combinatorial demands. In theory, it is known that in asymptotically large markets:  1. For incentives, the A-CEEI mechanism is Envy-Free-but-for-Tie-Breaking (EF-TB), which implies that it is Strategyproof-in-the-Large (SP-L).  2. From a computational perspective, computing the equilibrium solution is unfortunately a computationally intractable problem (in the worst-case, assuming $\\textsf{PPAD}\\ne \\textsf{FP}$).  We develop a new heuristic algorithm that outperforms the previous state-of-the-art by multiple orders of magnitude. This new, faster algorithm lets us perform experiments on real-world inputs for the first time. We discover that with real-world preferences, even in a realistic implementation that satisfies the EF-TB and SP-L properties, agents may have surprisingly simple and plausible deviations from truthful reporting ",
    "path": "papers/23/05/2305.11406.json",
    "total_tokens": 1024,
    "translated_title": "基于均衡概念的公平分配的实用算法和实验证明（A-CEEI）",
    "translated_abstract": "“等收入近似竞争均衡”（A-CEEI）是一种基于均衡概念用于将离散物品公平分配给带有组合需求的代理的解决方案概念。在理论上已经知道，在渐近大市场上，对于激励措施，A-CEEI机制是“无嫉妒可但须破坏平手”的（EF-TB），这意味着它是“大范围上的策略证明”（SP-L）。从计算的角度来看，计算均衡解是一种计算上不可行的问题（在最坏的情况下，假设 $\\textsf{PPAD} \\neq \\textsf {FP}$）。我们开发了一种新的启发式算法，其性能比之前的最先进算法高出多个数量级。这种更快的新算法使我们第一次能够对真实世界的输入进行实验。我们发现，即使在符合EF-TB和SP-L属性的现实实施中，代理也可能有惊人而合理的不真实报告偏离。",
    "tldr": "本文介绍了基于均衡概念的公平分配算法A-CEEI，开发了一种新的启发式算法，使我们第一次能够对真实世界的输入进行实验。研究发现，即使在符合EF-TB和SP-L属性的现实实施中，代理也可能有惊人而合理的不真实报告偏离。"
}