{
    "title": "Competing for Shareable Arms in Multi-Player Multi-Armed Bandits. (arXiv:2305.19158v2 [cs.LG] UPDATED)",
    "abstract": "Competitions for shareable and limited resources have long been studied with strategic agents. In reality, agents often have to learn and maximize the rewards of the resources at the same time. To design an individualized competing policy, we model the competition between agents in a novel multi-player multi-armed bandit (MPMAB) setting where players are selfish and aim to maximize their own rewards. In addition, when several players pull the same arm, we assume that these players averagely share the arms' rewards by expectation. Under this setting, we first analyze the Nash equilibrium when arms' rewards are known. Subsequently, we propose a novel Selfish MPMAB with Averaging Allocation (SMAA) approach based on the equilibrium. We theoretically demonstrate that SMAA could achieve a good regret guarantee for each player when all players follow the algorithm. Additionally, we establish that no single selfish player can significantly increase their rewards through deviation, nor can they",
    "link": "http://arxiv.org/abs/2305.19158",
    "context": "Title: Competing for Shareable Arms in Multi-Player Multi-Armed Bandits. (arXiv:2305.19158v2 [cs.LG] UPDATED)\nAbstract: Competitions for shareable and limited resources have long been studied with strategic agents. In reality, agents often have to learn and maximize the rewards of the resources at the same time. To design an individualized competing policy, we model the competition between agents in a novel multi-player multi-armed bandit (MPMAB) setting where players are selfish and aim to maximize their own rewards. In addition, when several players pull the same arm, we assume that these players averagely share the arms' rewards by expectation. Under this setting, we first analyze the Nash equilibrium when arms' rewards are known. Subsequently, we propose a novel Selfish MPMAB with Averaging Allocation (SMAA) approach based on the equilibrium. We theoretically demonstrate that SMAA could achieve a good regret guarantee for each player when all players follow the algorithm. Additionally, we establish that no single selfish player can significantly increase their rewards through deviation, nor can they",
    "path": "papers/23/05/2305.19158.json",
    "total_tokens": 1027,
    "translated_title": "在多人多臂赌博机中竞争可分享的手臂",
    "translated_abstract": "长期以来，竞争可分享和有限资源的研究一直是战略性代理人的主题。在现实中，代理人经常需要同时学习和最大化资源的回报。为了设计个性化的竞争策略，我们在一种新颖的多人多臂赌博机（MPMAB）设置中建模了代理人之间的竞争，其中玩家自私并旨在最大化自己的回报。此外，当几个玩家拉动相同的手臂时，我们假设这些玩家通过期望平均分享手臂的回报。在这种设置下，我们首先分析了当手臂的回报已知时的纳什均衡。随后，我们提出了一种基于该均衡的新颖的自私MPMAB与分配平均算法（SMAA）方法。我们从理论上证明，当所有玩家都遵循该算法时，SMAA可以为每个玩家实现良好的后悔保证。此外，我们还证明了没有单个自私的玩家能通过偏离显著增加他们的回报，也不能...",
    "tldr": "本文研究了在多人多臂赌博机中竞争可分享的手臂的问题。我们提出了一种新的自私MPMAB与分配平均算法（SMAA）方法，理论上证明了在玩家遵循该算法的情况下可以实现良好的后悔保证。此外，我们还证明了没有单个自私的玩家能通过偏离显著增加他们的回报。"
}