{
    "title": "Can Learning Deteriorate Control? Analyzing Computational Delays in Gaussian Process-Based Event-Triggered Online Learning. (arXiv:2305.08169v1 [eess.SY])",
    "abstract": "When the dynamics of systems are unknown, supervised machine learning techniques are commonly employed to infer models from data. Gaussian process (GP) regression is a particularly popular learning method for this purpose due to the existence of prediction error bounds. Moreover, GP models can be efficiently updated online, such that event-triggered online learning strategies can be pursued to ensure specified tracking accuracies. However, existing trigger conditions must be able to be evaluated at arbitrary times, which cannot be achieved in practice due to non-negligible computation times. Therefore, we first derive a delay-aware tracking error bound, which reveals an accuracy-delay trade-off. Based on this result, we propose a novel event trigger for GP-based online learning with computational delays, which we show to offer advantages over offline trained GP models for sufficiently small computation times. Finally, we demonstrate the effectiveness of the proposed event trigger for o",
    "link": "http://arxiv.org/abs/2305.08169",
    "context": "Title: Can Learning Deteriorate Control? Analyzing Computational Delays in Gaussian Process-Based Event-Triggered Online Learning. (arXiv:2305.08169v1 [eess.SY])\nAbstract: When the dynamics of systems are unknown, supervised machine learning techniques are commonly employed to infer models from data. Gaussian process (GP) regression is a particularly popular learning method for this purpose due to the existence of prediction error bounds. Moreover, GP models can be efficiently updated online, such that event-triggered online learning strategies can be pursued to ensure specified tracking accuracies. However, existing trigger conditions must be able to be evaluated at arbitrary times, which cannot be achieved in practice due to non-negligible computation times. Therefore, we first derive a delay-aware tracking error bound, which reveals an accuracy-delay trade-off. Based on this result, we propose a novel event trigger for GP-based online learning with computational delays, which we show to offer advantages over offline trained GP models for sufficiently small computation times. Finally, we demonstrate the effectiveness of the proposed event trigger for o",
    "path": "papers/23/05/2305.08169.json",
    "total_tokens": 866,
    "translated_title": "学习能否降低控制？分析高斯过程事件触发在线学习中的计算延迟",
    "translated_abstract": "当系统的动态未知时，通常采用监督学习技术从数据推断模型。高斯过程回归是一种特别流行的学习方法，因为存在预测误差界限。此外，GP模型可以进行高效的在线更新，从而可以采用事件触发在线学习策略以确保特定的跟踪精度。然而，由于非常规计算时间的存在，必须能够在任意时间评估现有的触发条件，而这在实践中是无法实现的。因此，我们首先推导了一个延迟感知的跟踪误差界限，揭示了精度-时延的折衷。基于此结果，我们提出了一种适用于具有计算延迟的基于高斯过程的在线学习的新型事件触发器，我们证明了该触发器对于足够小的计算时间而言具有优势。最后，我们展示了所提出的事件触发器的有效性。",
    "tldr": "该论文提出了一种适用于具有计算延迟的基于高斯过程的在线学习的新型事件触发器, 可以有效降低计算延迟。",
    "en_tdlr": "This paper proposes a novel event trigger for Gaussian process-based online learning with computational delays, which reduces the computational delays effectively."
}