{
    "title": "Convex Quaternion Optimization for Signal Processing: Theory and Applications. (arXiv:2305.06879v1 [math.OC])",
    "abstract": "Convex optimization methods have been extensively used in the fields of communications and signal processing. However, the theory of quaternion optimization is currently not as fully developed and systematic as that of complex and real optimization. To this end, we establish an essential theory of convex quaternion optimization for signal processing based on the generalized Hamilton-real (GHR) calculus. This is achieved in a way which conforms with traditional complex and real optimization theory. For rigorous, We present five discriminant theorems for convex quaternion functions, and four discriminant criteria for strongly convex quaternion functions. Furthermore, we provide a fundamental theorem for the optimality of convex quaternion optimization problems, and demonstrate its utility through three applications in quaternion signal processing. These results provide a solid theoretical foundation for convex quaternion optimization and open avenues for further developments in signal pr",
    "link": "http://arxiv.org/abs/2305.06879",
    "context": "Title: Convex Quaternion Optimization for Signal Processing: Theory and Applications. (arXiv:2305.06879v1 [math.OC])\nAbstract: Convex optimization methods have been extensively used in the fields of communications and signal processing. However, the theory of quaternion optimization is currently not as fully developed and systematic as that of complex and real optimization. To this end, we establish an essential theory of convex quaternion optimization for signal processing based on the generalized Hamilton-real (GHR) calculus. This is achieved in a way which conforms with traditional complex and real optimization theory. For rigorous, We present five discriminant theorems for convex quaternion functions, and four discriminant criteria for strongly convex quaternion functions. Furthermore, we provide a fundamental theorem for the optimality of convex quaternion optimization problems, and demonstrate its utility through three applications in quaternion signal processing. These results provide a solid theoretical foundation for convex quaternion optimization and open avenues for further developments in signal pr",
    "path": "papers/23/05/2305.06879.json",
    "total_tokens": 799,
    "translated_title": "用于信号处理的凸四元数优化：理论和应用",
    "translated_abstract": "凸优化方法已被广泛应用于通信和信号处理领域。然而，四元数优化理论目前没有像复数和实数优化理论那样完全发展和系统化。为此，我们基于广义哈密尔顿实数(GHR)计算，建立了凸四元数优化的基本理论，这是与传统的复数和实数优化理论符合的方式。我们提出了五个判别凸四元数函数的定理，和四个强凸四元数函数的判别标准。此外，我们提供了一个基本定理，用于说明凸四元数优化问题的最优性，并通过三个四元数信号处理应用来演示其实用性。这些结果为凸四元数优化提供了坚实的理论基础，并为信号处理领域的进一步发展开启了途径。",
    "tldr": "建立了基于广义哈密尔顿实数计算的凸四元数优化基本理论，并提出了一些判别定理和判别标准，同时通过三个应用验证了理论的实用性。",
    "en_tdlr": "A fundamental theory of convex quaternion optimization for signal processing was established based on the generalized Hamilton-real calculus, with the presentation of discriminant theorems and criteria, and the demonstration of utility through three quaternion signal processing applications."
}