{
    "title": "The Tag-Team Approach: Leveraging CLS and Language Tagging for Enhancing Multilingual ASR. (arXiv:2305.19584v1 [cs.CL])",
    "abstract": "Building a multilingual Automated Speech Recognition (ASR) system in a linguistically diverse country like India can be a challenging task due to the differences in scripts and the limited availability of speech data. This problem can be solved by exploiting the fact that many of these languages are phonetically similar. These languages can be converted into a Common Label Set (CLS) by mapping similar sounds to common labels. In this paper, new approaches are explored and compared to improve the performance of CLS based multilingual ASR model. Specific language information is infused in the ASR model by giving Language ID or using CLS to Native script converter on top of the CLS Multilingual model. These methods give a significant improvement in Word Error Rate (WER) compared to the CLS baseline. These methods are further tried on out-of-distribution data to check their robustness.",
    "link": "http://arxiv.org/abs/2305.19584",
    "context": "Title: The Tag-Team Approach: Leveraging CLS and Language Tagging for Enhancing Multilingual ASR. (arXiv:2305.19584v1 [cs.CL])\nAbstract: Building a multilingual Automated Speech Recognition (ASR) system in a linguistically diverse country like India can be a challenging task due to the differences in scripts and the limited availability of speech data. This problem can be solved by exploiting the fact that many of these languages are phonetically similar. These languages can be converted into a Common Label Set (CLS) by mapping similar sounds to common labels. In this paper, new approaches are explored and compared to improve the performance of CLS based multilingual ASR model. Specific language information is infused in the ASR model by giving Language ID or using CLS to Native script converter on top of the CLS Multilingual model. These methods give a significant improvement in Word Error Rate (WER) compared to the CLS baseline. These methods are further tried on out-of-distribution data to check their robustness.",
    "path": "papers/23/05/2305.19584.json",
    "total_tokens": 875,
    "translated_title": "基于CLS和语言标注的标签组合方法：提高多语言ASR的性能",
    "translated_abstract": "在一个语言多样的国家，如印度，建立一个多语言的自动语音识别(ASR)系统可能是一项具有挑战性的任务，由于语音数据的有限可用性和脚本的差异。这个问题可以通过利用许多这些语言在音素上的相似性来解决。将这些语言转换为一个通用标签集(CLSet)，通过将相似的声音映射到常见的标签。在本文中，探讨并比较新的方法，以改善基于CLS的多语言ASR模型的性能。在CLS多语言模型的基础上，通过给予语言ID或者使用CLS到本地脚本转换器来注入特定的语言信息。这些方法与CLS基线相比，在词错误率(WER)方面有显著的改进。此外，这些方法在分布之外的数据上进行了尝试以检查其鲁棒性。",
    "tldr": "通过将相似的声音映射到常见的标签，利用CLS和语言标注相结合来提高多语言ASR模型的性能。",
    "en_tdlr": "By mapping similar sounds to common labels using CLS and language tagging, a new approach is proposed to improve the performance of multilingual ASR models. The approach includes infusing specific language information in the ASR model by giving Language ID or using CLS to native script converter on top of the CLS Multilingual model, and has proven to give a significant improvement in Word Error Rate (WER) compared to the CLS baseline."
}