{
    "title": "Improved Instruction Ordering in Recipe-Grounded Conversation. (arXiv:2305.17280v1 [cs.CL])",
    "abstract": "In this paper, we study the task of instructional dialogue and focus on the cooking domain. Analyzing the generated output of the GPT-J model, we reveal that the primary challenge for a recipe-grounded dialog system is how to provide the instructions in the correct order. We hypothesize that this is due to the model's lack of understanding of user intent and inability to track the instruction state (i.e., which step was last instructed). Therefore, we propose to explore two auxiliary subtasks, namely User Intent Detection and Instruction State Tracking, to support Response Generation with improved instruction grounding. Experimenting with our newly collected dataset, ChattyChef, shows that incorporating user intent and instruction state information helps the response generation model mitigate the incorrect order issue. Furthermore, to investigate whether ChatGPT has completely solved this task, we analyze its outputs and find that it also makes mistakes (10.7% of the responses), about ",
    "link": "http://arxiv.org/abs/2305.17280",
    "context": "Title: Improved Instruction Ordering in Recipe-Grounded Conversation. (arXiv:2305.17280v1 [cs.CL])\nAbstract: In this paper, we study the task of instructional dialogue and focus on the cooking domain. Analyzing the generated output of the GPT-J model, we reveal that the primary challenge for a recipe-grounded dialog system is how to provide the instructions in the correct order. We hypothesize that this is due to the model's lack of understanding of user intent and inability to track the instruction state (i.e., which step was last instructed). Therefore, we propose to explore two auxiliary subtasks, namely User Intent Detection and Instruction State Tracking, to support Response Generation with improved instruction grounding. Experimenting with our newly collected dataset, ChattyChef, shows that incorporating user intent and instruction state information helps the response generation model mitigate the incorrect order issue. Furthermore, to investigate whether ChatGPT has completely solved this task, we analyze its outputs and find that it also makes mistakes (10.7% of the responses), about ",
    "path": "papers/23/05/2305.17280.json",
    "total_tokens": 872,
    "translated_title": "基于菜谱的对话中的改进指令排序",
    "translated_abstract": "本文研究指令对话任务，并聚焦于烹饪领域。分析GPT-J模型生成的输出，我们揭示了菜谱对话系统的主要挑战在于如何以正确的顺序提供指令。我们假设这是由于模型缺乏理解用户意图和无法跟踪指令状态（即最后一步是哪个指令）的能力导致的。因此，我们提出了探索两个辅助子任务——用户意图检测和指令状态跟踪，以支持改进指令基础的响应生成。在我们新收集的数据集ChattyChef上进行实验表明，融入用户意图和指令状态信息有助于响应生成模型减轻顺序错误问题。此外，为了研究ChatGPT是否完全解决了这个任务，我们分析其输出并发现它也犯了错误（约占响应的10.7%），",
    "tldr": "本文针对基于菜谱的对话任务，提出了两个辅助子任务，即用户意图检测和指令状态跟踪，并证明这些任务可以帮助响应生成模型解决指令顺序错误问题。",
    "en_tdlr": "This paper proposes two auxiliary subtasks, User Intent Detection and Instruction State Tracking, to support Response Generation with improved instruction grounding in recipe-grounded dialogue systems, which is proven to be effective in solving the issue of incorrect instruction ordering."
}