{
    "title": "ELSA -- Enhanced latent spaces for improved collider simulations. (arXiv:2305.07696v1 [hep-ph] CROSS LISTED)",
    "abstract": "Simulations play a key role for inference in collider physics. We explore various approaches for enhancing the precision of simulations using machine learning, including interventions at the end of the simulation chain (reweighting), at the beginning of the simulation chain (pre-processing), and connections between the end and beginning (latent space refinement). To clearly illustrate our approaches, we use W+jets matrix element surrogate simulations based on normalizing flows as a prototypical example. First, weights in the data space are derived using machine learning classifiers. Then, we pull back the data-space weights to the latent space to produce unweighted examples and employ the Latent Space Refinement (LASER) protocol using Hamiltonian Monte Carlo. An alternative approach is an augmented normalizing flow, which allows for different dimensions in the latent and target spaces. These methods are studied for various pre-processing strategies, including a new and general method f",
    "link": "http://arxiv.org/abs/2305.07696",
    "context": "Title: ELSA -- Enhanced latent spaces for improved collider simulations. (arXiv:2305.07696v1 [hep-ph] CROSS LISTED)\nAbstract: Simulations play a key role for inference in collider physics. We explore various approaches for enhancing the precision of simulations using machine learning, including interventions at the end of the simulation chain (reweighting), at the beginning of the simulation chain (pre-processing), and connections between the end and beginning (latent space refinement). To clearly illustrate our approaches, we use W+jets matrix element surrogate simulations based on normalizing flows as a prototypical example. First, weights in the data space are derived using machine learning classifiers. Then, we pull back the data-space weights to the latent space to produce unweighted examples and employ the Latent Space Refinement (LASER) protocol using Hamiltonian Monte Carlo. An alternative approach is an augmented normalizing flow, which allows for different dimensions in the latent and target spaces. These methods are studied for various pre-processing strategies, including a new and general method f",
    "path": "papers/23/05/2305.07696.json",
    "total_tokens": 1013,
    "translated_title": "ELSA -- 提高碰撞模拟精确度的增强潜空间",
    "translated_abstract": "模拟在碰撞物理中具有关键作用。我们探索机器学习增强模拟精确度的各种方法，包括在模拟链的末尾进行干预（重新加权）、在模拟链的开头进行干预（预处理）以及在末尾和开头之间建立联系（潜空间细化）。为了清晰地说明我们的方法，我们使用基于正则流的W+jets矩阵元代理模拟作为原型示例。首先，使用机器学习分类器在数据空间中确定权重。然后，我们将数据空间权重回推到潜空间以产生无权重的样本，并使用哈密顿蒙特卡罗使用潜空间细化（LASER）协议。另一种方法是增强正则流，该方法允许在潜空间和目标空间中具有不同的维度。我们研究了各种预处理策略，包括使用生成模型生成增强样本的新的通用方法。结果表明，这些方法显着提高了W+jets矩阵元模拟的精确度。",
    "tldr": "本文提出了多种增强模拟精确度的方法，包括在模拟链的末尾进行干预、在模拟链的开头进行干预和潜空间细化，通过 W+jets矩阵元代理模拟以及使用正则流和生成模型等策略进行研究，实验证明这些方法能显著提高精确度。",
    "en_tdlr": "This paper proposes various methods such as end-of-chain intervention, pre-processing, and latent space refinement to enhance the precision of collider simulations, which are demonstrated by W+jets matrix element surrogate simulations based on normalizing flows and studied with strategies including generative models. Results show significant improvement in precision."
}