{
    "title": "CCGen: Explainable Complementary Concept Generation in E-Commerce. (arXiv:2305.11480v1 [cs.CL])",
    "abstract": "We propose and study Complementary Concept Generation (CCGen): given a concept of interest, e.g., \"Digital Cameras\", generating a list of complementary concepts, e.g., 1) Camera Lenses 2) Batteries 3) Camera Cases 4) Memory Cards 5) Battery Chargers. CCGen is beneficial for various applications like query suggestion and item recommendation, especially in the e-commerce domain. To solve CCGen, we propose to train language models to generate ranked lists of concepts with a two-step training strategy. We also teach the models to generate explanations by incorporating explanations distilled from large teacher models. Extensive experiments and analysis demonstrate that our model can generate high-quality concepts complementary to the input concept while producing explanations to justify the predictions.",
    "link": "http://arxiv.org/abs/2305.11480",
    "context": "Title: CCGen: Explainable Complementary Concept Generation in E-Commerce. (arXiv:2305.11480v1 [cs.CL])\nAbstract: We propose and study Complementary Concept Generation (CCGen): given a concept of interest, e.g., \"Digital Cameras\", generating a list of complementary concepts, e.g., 1) Camera Lenses 2) Batteries 3) Camera Cases 4) Memory Cards 5) Battery Chargers. CCGen is beneficial for various applications like query suggestion and item recommendation, especially in the e-commerce domain. To solve CCGen, we propose to train language models to generate ranked lists of concepts with a two-step training strategy. We also teach the models to generate explanations by incorporating explanations distilled from large teacher models. Extensive experiments and analysis demonstrate that our model can generate high-quality concepts complementary to the input concept while producing explanations to justify the predictions.",
    "path": "papers/23/05/2305.11480.json",
    "total_tokens": 795,
    "translated_title": "CCGen：电子商务中可解释的互补概念生成",
    "translated_abstract": "我们提出并研究了互补概念生成（CCGen）：给定一个感兴趣的概念，例如“数码相机”，生成一系列互补的概念，例如1）相机镜头2）电池3）相机盒子4）存储卡5）电池充电器。CCGen对于诸如查询建议和物品推荐等各种应用，尤其是在电子商务领域中非常有益。为了解决CCGen，我们提出了一个两步训练策略，利用语言模型生成排名列表。我们还教授模型生成解释，通过加入从大型教师模型中提取的解释。广泛的实验和分析表明，我们的模型可以生成高质量的互补概念，同时生成解释以证明预测的正确性。",
    "tldr": "CCGen是一个电子商务中可解释的互补概念生成算法，通过训练语言模型生成高质量的互补概念排名列表，并生成解释以证明预测的正确性。",
    "en_tdlr": "CCGen is an explainable complementary concept generation algorithm in e-commerce, which generates high-quality ranked lists of complementary concepts by training language models and produces explanations to justify the predictions."
}