{
    "title": "Conformal Inference for Invariant Risk Minimization. (arXiv:2305.12686v1 [stat.ML])",
    "abstract": "The application of machine learning models can be significantly impeded by the occurrence of distributional shifts, as the assumption of homogeneity between the population of training and testing samples in machine learning and statistics may not be feasible in practical situations. One way to tackle this problem is to use invariant learning, such as invariant risk minimization (IRM), to acquire an invariant representation that aids in generalization with distributional shifts. This paper develops methods for obtaining distribution-free prediction regions to describe uncertainty estimates for invariant representations, accounting for the distribution shifts of data from different environments. Our approach involves a weighted conformity score that adapts to the specific environment in which the test sample is situated. We construct an adaptive conformal interval using the weighted conformity score and prove its conditional average under certain conditions. To demonstrate the effectiven",
    "link": "http://arxiv.org/abs/2305.12686",
    "context": "Title: Conformal Inference for Invariant Risk Minimization. (arXiv:2305.12686v1 [stat.ML])\nAbstract: The application of machine learning models can be significantly impeded by the occurrence of distributional shifts, as the assumption of homogeneity between the population of training and testing samples in machine learning and statistics may not be feasible in practical situations. One way to tackle this problem is to use invariant learning, such as invariant risk minimization (IRM), to acquire an invariant representation that aids in generalization with distributional shifts. This paper develops methods for obtaining distribution-free prediction regions to describe uncertainty estimates for invariant representations, accounting for the distribution shifts of data from different environments. Our approach involves a weighted conformity score that adapts to the specific environment in which the test sample is situated. We construct an adaptive conformal interval using the weighted conformity score and prove its conditional average under certain conditions. To demonstrate the effectiven",
    "path": "papers/23/05/2305.12686.json",
    "total_tokens": 845,
    "translated_title": "不变风险最小化的一致推断",
    "translated_abstract": "机器学习模型的应用可能会受到分布偏移的严重影响，因为机器学习和统计中对训练和测试样本群体同质性的假设可能在实际情况中并不可行。解决这个问题的一种方式是使用不变学习，例如不变风险最小化（IRM），以获得一种不变表示，有助于在分布偏移情况下的泛化。本文开发了一种方法，用于获得无分布预测区域，以描述数据来自不同环境的分布偏移的不变表示的不确定性估计。我们的方法涉及一种适应特定环境的加权一致性分数，利用加权一致性分数构建自适应一致区间，并在一定条件下证明其条件平均值。为了展示本方法的有效性",
    "tldr": "本文研究了非分布预测区域的构造，以描述不同环境下数据的分布偏移的不确定性估计。该方法利用一种适应特定环境的加权一致性分数构建自适应的一致区间，并证明其条件平均值。",
    "en_tdlr": "This paper develops methods for constructing distribution-free prediction regions to describe uncertainty estimates for invariant representations, accounting for the distributional shifts of data from different environments. The approach involves a weighted conformity score that adapts to the specific environment in which the test sample is situated, and demonstrates the effectiveness of this method."
}