{
    "title": "DiffuSum: Generation Enhanced Extractive Summarization with Diffusion. (arXiv:2305.01735v1 [cs.CL])",
    "abstract": "Extractive summarization aims to form a summary by directly extracting sentences from the source document. Existing works mostly formulate it as a sequence labeling problem by making individual sentence label predictions. This paper proposes DiffuSum, a novel paradigm for extractive summarization, by directly generating the desired summary sentence representations with diffusion models and extracting sentences based on sentence representation matching. In addition, DiffuSum jointly optimizes a contrastive sentence encoder with a matching loss for sentence representation alignment and a multi-class contrastive loss for representation diversity. Experimental results show that DiffuSum achieves the new state-of-the-art extractive results on CNN/DailyMail with ROUGE scores of $44.83/22.56/40.56$. Experiments on the other two datasets with different summary lengths also demonstrate the effectiveness of DiffuSum. The strong performance of our framework shows the great potential of adapting g",
    "link": "http://arxiv.org/abs/2305.01735",
    "context": "Title: DiffuSum: Generation Enhanced Extractive Summarization with Diffusion. (arXiv:2305.01735v1 [cs.CL])\nAbstract: Extractive summarization aims to form a summary by directly extracting sentences from the source document. Existing works mostly formulate it as a sequence labeling problem by making individual sentence label predictions. This paper proposes DiffuSum, a novel paradigm for extractive summarization, by directly generating the desired summary sentence representations with diffusion models and extracting sentences based on sentence representation matching. In addition, DiffuSum jointly optimizes a contrastive sentence encoder with a matching loss for sentence representation alignment and a multi-class contrastive loss for representation diversity. Experimental results show that DiffuSum achieves the new state-of-the-art extractive results on CNN/DailyMail with ROUGE scores of $44.83/22.56/40.56$. Experiments on the other two datasets with different summary lengths also demonstrate the effectiveness of DiffuSum. The strong performance of our framework shows the great potential of adapting g",
    "path": "papers/23/05/2305.01735.json",
    "total_tokens": 819,
    "translated_title": "DiffuSum：基于扩散增强的摘要提取方法",
    "translated_abstract": "抽取式摘要旨在通过直接从源文件中提取句子来形成摘要。本文提出了DiffuSum，一种基于扩散模型的新范式，通过直接生成所需的摘要句子表示，并基于句子表示匹配提取句子。此外，DiffuSum共同优化了对比句子编码器和匹配损失，用于句子表示对齐，以及用于表示多样性的多类对比损失。实验结果表明，DiffuSum在CNN/DailyMail数据集上实现了新的最先进的抽取结果，在ROUGE分数方面达到了 $44.83/22.56/40.56$。对两个具有不同摘要长度的数据集进行的实验也证明了DiffuSum的有效性。我们的框架的强大性能表明了适应当前情况的巨大潜力。",
    "tldr": "本文提出了一种新的基于扩散模型的摘要提取方法DiffuSum，并且在多个数据集上实现了最先进的抽取结果。",
    "en_tdlr": "This paper proposes a novel paradigm for extractive summarization called DiffuSum, which generates summary sentence representations with diffusion models and extracts sentences based on sentence representation matching. DiffuSum achieves state-of-the-art results on multiple datasets and demonstrates great potential for adaptation to different situations."
}