{
    "title": "Enhancing Short-Term Wind Speed Forecasting using Graph Attention and Frequency-Enhanced Mechanisms. (arXiv:2305.11526v1 [cs.LG])",
    "abstract": "The safe and stable operation of power systems is greatly challenged by the high variability and randomness of wind power in large-scale wind-power-integrated grids. Wind power forecasting is an effective solution to tackle this issue, with wind speed forecasting being an essential aspect. In this paper, a Graph-attentive Frequency-enhanced Spatial-Temporal Wind Speed Forecasting model based on graph attention and frequency-enhanced mechanisms, i.e., GFST-WSF, is proposed to improve the accuracy of short-term wind speed forecasting. The GFST-WSF comprises a Transformer architecture for temporal feature extraction and a Graph Attention Network (GAT) for spatial feature extraction. The GAT is specifically designed to capture the complex spatial dependencies among wind speed stations to effectively aggregate information from neighboring nodes in the graph, thus enhancing the spatial representation of the data. To model the time lag in wind speed correlation between adjacent wind farms cau",
    "link": "http://arxiv.org/abs/2305.11526",
    "context": "Title: Enhancing Short-Term Wind Speed Forecasting using Graph Attention and Frequency-Enhanced Mechanisms. (arXiv:2305.11526v1 [cs.LG])\nAbstract: The safe and stable operation of power systems is greatly challenged by the high variability and randomness of wind power in large-scale wind-power-integrated grids. Wind power forecasting is an effective solution to tackle this issue, with wind speed forecasting being an essential aspect. In this paper, a Graph-attentive Frequency-enhanced Spatial-Temporal Wind Speed Forecasting model based on graph attention and frequency-enhanced mechanisms, i.e., GFST-WSF, is proposed to improve the accuracy of short-term wind speed forecasting. The GFST-WSF comprises a Transformer architecture for temporal feature extraction and a Graph Attention Network (GAT) for spatial feature extraction. The GAT is specifically designed to capture the complex spatial dependencies among wind speed stations to effectively aggregate information from neighboring nodes in the graph, thus enhancing the spatial representation of the data. To model the time lag in wind speed correlation between adjacent wind farms cau",
    "path": "papers/23/05/2305.11526.json",
    "total_tokens": 846,
    "translated_title": "基于图注意力和频率增强机制的短期风速预测方法",
    "translated_abstract": "在风电大规模集成电网中，风力的高可变性和随机性对电力系统的安全和稳定运行带来了巨大挑战。风力预测是解决这个问题的有效方法，其中风速预测是至关重要的方面。本文提出了一种基于图注意力和频率增强机制的图注意力频率增强时空风速预测模型（GFST-WSF），以提高短期风速预测的准确性。GFST-WSF包括用于提取时间特征的Transformer架构和用于提取空间特征的图注意力网络（GAT）。GAT被专门设计用于捕捉风速站之间的复杂空间依赖关系，从而有效地聚合图中相邻节点的信息，从而增强数据的空间表示。为了模拟邻近风场之间的风速相关的时间滞后",
    "tldr": "本文提出了一种基于图注意力和频率增强机制的风速预测模型GFST-WSF，能够有效提高短期风速预测的准确性。",
    "en_tdlr": "This paper proposes a GFST-WSF model for short-term wind speed forecasting utilizing graph attention and frequency-enhanced mechanisms, which effectively improves the accuracy of wind power forecasting."
}