{
    "title": "Finding Meaningful Distributions of ML Black-boxes under Forensic Investigation. (arXiv:2305.05869v1 [cs.LG])",
    "abstract": "Given a poorly documented neural network model, we take the perspective of a forensic investigator who wants to find out the model's data domain (e.g. whether on face images or traffic signs). Although existing methods such as membership inference and model inversion can be used to uncover some information about an unknown model, they still require knowledge of the data domain to start with. In this paper, we propose solving this problem by leveraging on comprehensive corpus such as ImageNet to select a meaningful distribution that is close to the original training distribution and leads to high performance in follow-up investigations. The corpus comprises two components, a large dataset of samples and meta information such as hierarchical structure and textual information on the samples. Our goal is to select a set of samples from the corpus for the given model. The core of our method is an objective function that considers two criteria on the selected samples: the model functional pr",
    "link": "http://arxiv.org/abs/2305.05869",
    "context": "Title: Finding Meaningful Distributions of ML Black-boxes under Forensic Investigation. (arXiv:2305.05869v1 [cs.LG])\nAbstract: Given a poorly documented neural network model, we take the perspective of a forensic investigator who wants to find out the model's data domain (e.g. whether on face images or traffic signs). Although existing methods such as membership inference and model inversion can be used to uncover some information about an unknown model, they still require knowledge of the data domain to start with. In this paper, we propose solving this problem by leveraging on comprehensive corpus such as ImageNet to select a meaningful distribution that is close to the original training distribution and leads to high performance in follow-up investigations. The corpus comprises two components, a large dataset of samples and meta information such as hierarchical structure and textual information on the samples. Our goal is to select a set of samples from the corpus for the given model. The core of our method is an objective function that considers two criteria on the selected samples: the model functional pr",
    "path": "papers/23/05/2305.05869.json",
    "total_tokens": 856,
    "tldr": "本论文提出了一种利用全面语料库在取证调查下寻找机器学习黑匣子的有意义分布的方法，以选择一个接近原始训练分布的分布，并导致后续调查中的高性能。"
}