{
    "title": "Jointprop: Joint Semi-supervised Learning for Entity and Relation Extraction with Heterogeneous Graph-based Propagation. (arXiv:2305.15872v1 [cs.CL])",
    "abstract": "Semi-supervised learning has been an important approach to address challenges in extracting entities and relations from limited data. However, current semi-supervised works handle the two tasks (i.e., Named Entity Recognition and Relation Extraction) separately and ignore the cross-correlation of entity and relation instances as well as the existence of similar instances across unlabeled data. To alleviate the issues, we propose Jointprop, a Heterogeneous Graph-based Propagation framework for joint semi-supervised entity and relation extraction, which captures the global structure information between individual tasks and exploits interactions within unlabeled data. Specifically, we construct a unified span-based heterogeneous graph from entity and relation candidates and propagate class labels based on confidence scores. We then employ a propagation learning scheme to leverage the affinities between labelled and unlabeled samples. Experiments on benchmark datasets show that our framewo",
    "link": "http://arxiv.org/abs/2305.15872",
    "context": "Title: Jointprop: Joint Semi-supervised Learning for Entity and Relation Extraction with Heterogeneous Graph-based Propagation. (arXiv:2305.15872v1 [cs.CL])\nAbstract: Semi-supervised learning has been an important approach to address challenges in extracting entities and relations from limited data. However, current semi-supervised works handle the two tasks (i.e., Named Entity Recognition and Relation Extraction) separately and ignore the cross-correlation of entity and relation instances as well as the existence of similar instances across unlabeled data. To alleviate the issues, we propose Jointprop, a Heterogeneous Graph-based Propagation framework for joint semi-supervised entity and relation extraction, which captures the global structure information between individual tasks and exploits interactions within unlabeled data. Specifically, we construct a unified span-based heterogeneous graph from entity and relation candidates and propagate class labels based on confidence scores. We then employ a propagation learning scheme to leverage the affinities between labelled and unlabeled samples. Experiments on benchmark datasets show that our framewo",
    "path": "papers/23/05/2305.15872.json",
    "total_tokens": 862,
    "translated_title": "Jointprop：基于异构图传播的实体和关系联合半监督学习",
    "translated_abstract": "半监督学习是从有限数据中提取实体和关系的重要方法。然而，当前的半监督方法分别处理命名实体识别和关系抽取两个任务，并忽略实体和关系实例之间的交叉相关性以及未标记数据中相似实例的存在。为了解决这些问题，我们提出了Jointprop，一种基于异构图传播的联合半监督实体和关系提取框架，其捕获各个任务之间的全局结构信息，并利用未标记数据中的交互。具体地，我们从实体和关系候选构建了一个统一的基于标记的异构图，并根据置信度得分传播类标签。然后，我们采用传播学习方案来利用标记和未标记样本之间的关联。在基准数据集上的实验表明，我们的框架表现出令人满意的实体和关系提取性能。",
    "tldr": "提出了Jointprop框架，用于基于异构图传播的联合半监督实体和关系提取，采用一个统一的异构图来使用未标记数据中的全局结构信息，提高实体和关系提取性能。",
    "en_tdlr": "Jointprop framework is proposed for joint semi-supervised entity and relation extraction based on heterogeneous graph propagation, which exploits interactions within unlabeled data and captures the global structure information between individual tasks to improve entity and relation extraction performance."
}