{
    "title": "A Framework Based on Symbolic Regression Coupled with eXtended Physics-Informed Neural Networks for Gray-Box Learning of Equations of Motion from Data. (arXiv:2305.10706v1 [cond-mat.dis-nn])",
    "abstract": "We propose a framework and an algorithm to uncover the unknown parts of nonlinear equations directly from data. The framework is based on eXtended Physics-Informed Neural Networks (X-PINNs), domain decomposition in space-time, but we augment the original X-PINN method by imposing flux continuity across the domain interfaces. The well-known Allen-Cahn equation is used to demonstrate the approach. The Frobenius matrix norm is used to evaluate the accuracy of the X-PINN predictions and the results show excellent performance. In addition, symbolic regression is employed to determine the closed form of the unknown part of the equation from the data, and the results confirm the accuracy of the X-PINNs based approach. To test the framework in a situation resembling real-world data, random noise is added to the datasets to mimic scenarios such as the presence of thermal noise or instrument errors. The results show that the framework is stable against significant amount of noise. As the final p",
    "link": "http://arxiv.org/abs/2305.10706",
    "context": "Title: A Framework Based on Symbolic Regression Coupled with eXtended Physics-Informed Neural Networks for Gray-Box Learning of Equations of Motion from Data. (arXiv:2305.10706v1 [cond-mat.dis-nn])\nAbstract: We propose a framework and an algorithm to uncover the unknown parts of nonlinear equations directly from data. The framework is based on eXtended Physics-Informed Neural Networks (X-PINNs), domain decomposition in space-time, but we augment the original X-PINN method by imposing flux continuity across the domain interfaces. The well-known Allen-Cahn equation is used to demonstrate the approach. The Frobenius matrix norm is used to evaluate the accuracy of the X-PINN predictions and the results show excellent performance. In addition, symbolic regression is employed to determine the closed form of the unknown part of the equation from the data, and the results confirm the accuracy of the X-PINNs based approach. To test the framework in a situation resembling real-world data, random noise is added to the datasets to mimic scenarios such as the presence of thermal noise or instrument errors. The results show that the framework is stable against significant amount of noise. As the final p",
    "path": "papers/23/05/2305.10706.json",
    "total_tokens": 934,
    "translated_title": "基于符号回归和eXtended物理启发神经网络的灰盒学习动力学方程的框架",
    "translated_abstract": "我们提出了一个框架和算法，用于直接从数据中发现非线性方程的未知部分。该框架基于eXtended物理启发神经网络（X-PINNs）、时空领域分解，但我们通过在领域界面上施加通量连续性来增强原始X-PINN方法。我们使用著名的Allen-Cahn方程来演示这种方法，采用Frobenius矩阵范数来评估X-PINN预测的精度，结果表现出极佳的性能。此外，采用符号回归从数据中确定方程的未知部分的封闭形式，并且结果证实了基于X-PINNs方法的准确性。为了测试该框架在类似实际数据的情况下的稳定性，将随机噪声添加到数据集中以模拟存在热噪声或仪器误差的情况。结果表明，该框架对大量噪声具有良好的稳定性。",
    "tldr": "该论文提出了一种基于符号回归和X-PINNs的方法，直接从数据中发现非线性方程的未知部分，并且在实验中表现出良好的精度和稳定性。",
    "en_tdlr": "This paper presents a framework that uses symbolic regression and X-PINNs to discover the unknown parts of nonlinear equations directly from data, and demonstrates good accuracy and stability through experiments with the Allen-Cahn equation and the addition of noise to datasets."
}