{
    "title": "Meta-Regression Analysis of Errors in Short-Term Electricity Load Forecasting. (arXiv:2305.18550v1 [cs.LG])",
    "abstract": "Forecasting electricity demand plays a critical role in ensuring reliable and cost-efficient operation of the electricity supply. With the global transition to distributed renewable energy sources and the electrification of heating and transportation, accurate load forecasts become even more important. While numerous empirical studies and a handful of review articles exist, there is surprisingly little quantitative analysis of the literature, most notably none that identifies the impact of factors on forecasting performance across the entirety of empirical studies. In this article, we therefore present a Meta-Regression Analysis (MRA) that examines factors that influence the accuracy of short-term electricity load forecasts. We use data from 421 forecast models published in 59 studies. While the grid level (esp. individual vs. aggregated vs. system), the forecast granularity, and the algorithms used seem to have a significant impact on the MAPE, bibliometric data, dataset sizes, and pr",
    "link": "http://arxiv.org/abs/2305.18550",
    "context": "Title: Meta-Regression Analysis of Errors in Short-Term Electricity Load Forecasting. (arXiv:2305.18550v1 [cs.LG])\nAbstract: Forecasting electricity demand plays a critical role in ensuring reliable and cost-efficient operation of the electricity supply. With the global transition to distributed renewable energy sources and the electrification of heating and transportation, accurate load forecasts become even more important. While numerous empirical studies and a handful of review articles exist, there is surprisingly little quantitative analysis of the literature, most notably none that identifies the impact of factors on forecasting performance across the entirety of empirical studies. In this article, we therefore present a Meta-Regression Analysis (MRA) that examines factors that influence the accuracy of short-term electricity load forecasts. We use data from 421 forecast models published in 59 studies. While the grid level (esp. individual vs. aggregated vs. system), the forecast granularity, and the algorithms used seem to have a significant impact on the MAPE, bibliometric data, dataset sizes, and pr",
    "path": "papers/23/05/2305.18550.json",
    "total_tokens": 780,
    "translated_title": "短期电力负荷预测误差的元回归分析",
    "translated_abstract": "预测电力需求对于确保电力供应的可靠和成本效益至关重要。随着分布式可再生能源的全球转型以及供暖和交通的电气化，准确的负荷预测变得更加重要。本文利用来自59篇研究中421个预测模型的数据，进行了影响短期电力负荷预测精度的因素的元回归分析（MRA）。结果表明，网络级别（特别是个体、聚合和系统）、预测粒度和所使用的算法似乎对MAPE、文献计量数据、数据集大小和预测误差有重要影响。",
    "tldr": "本文通过元回归分析研究了短期电力负荷预测的影响因素，发现网络级别、预测粒度和所使用的算法是影响预测精度的重要因素。",
    "en_tdlr": "This article presents a meta-regression analysis on factors influencing the accuracy of short-term electricity load forecasts, and finds that grid level, forecast granularity, and the algorithms used are important factors affecting the forecasting accuracy."
}