{
    "title": "Interviewing Matching in Random Markets. (arXiv:2305.11350v1 [econ.TH])",
    "abstract": "In many centralized labor markets candidates interview with potential employers before matches are formed through a clearinghouse One prominent example is the market for medical residencies and fellowships, which in recent years has had a large increase in the number of interviews. There have been numerous efforts to reduce the cost of interviewing in these markets using a variety of signalling mechanisms, however, the theoretical properties of these mechanisms have not been systematically studied in models with rich preferences. In this paper we give theoretical guarantees for a variety of mechanisms, finding that these mechanisms must properly balance competition.  We consider a random market in which agents' latent preferences are based on observed qualities, personal taste and (ex post) interview shocks and assume that following an interview mechanism a final stable match is generated with respect to preferences over interview partners. We study a novel many-to-many interview match",
    "link": "http://arxiv.org/abs/2305.11350",
    "context": "Title: Interviewing Matching in Random Markets. (arXiv:2305.11350v1 [econ.TH])\nAbstract: In many centralized labor markets candidates interview with potential employers before matches are formed through a clearinghouse One prominent example is the market for medical residencies and fellowships, which in recent years has had a large increase in the number of interviews. There have been numerous efforts to reduce the cost of interviewing in these markets using a variety of signalling mechanisms, however, the theoretical properties of these mechanisms have not been systematically studied in models with rich preferences. In this paper we give theoretical guarantees for a variety of mechanisms, finding that these mechanisms must properly balance competition.  We consider a random market in which agents' latent preferences are based on observed qualities, personal taste and (ex post) interview shocks and assume that following an interview mechanism a final stable match is generated with respect to preferences over interview partners. We study a novel many-to-many interview match",
    "path": "papers/23/05/2305.11350.json",
    "total_tokens": 835,
    "translated_title": "随机市场中的面试匹配",
    "translated_abstract": "在许多中央劳动力市场上，求职者在参与匹配前会与潜在雇主进行面试。一个显著的例子是医学住院医和研究员市场，在近年来已经有了大量面试。已经有许多努力采用各种信号机制来降低这些市场中面试成本，然而，这些机制在具有丰富偏好的模型中的理论性质尚未得到系统研究。在本文中，我们为各种机制提供理论保证，发现这些机制必须恰当地平衡竞争。我们考虑一个随机市场，在这个市场上，代理商的潜在偏好基于观察到的质量、个人品味和（事后）面试冲击，并假设在面试机制后，会根据对面试伴侣的偏好生成最终稳定匹配。我们研究了一种新颖的多对多面试匹配机制。",
    "tldr": "本论文针对中央劳动市场中面试匹配的降本提效问题，提出了一种多对多面试匹配机制，并为各种机制提供理论保证。"
}