{
    "title": "ADVISE: AI-accelerated Design of Evidence Synthesis for Global Development. (arXiv:2305.01145v1 [cs.CL])",
    "abstract": "When designing evidence-based policies and programs, decision-makers must distill key information from a vast and rapidly growing literature base. Identifying relevant literature from raw search results is time and resource intensive, and is often done by manual screening. In this study, we develop an AI agent based on a bidirectional encoder representations from transformers (BERT) model and incorporate it into a human team designing an evidence synthesis product for global development. We explore the effectiveness of the human-AI hybrid team in accelerating the evidence synthesis process. To further improve team efficiency, we enhance the human-AI hybrid team through active learning (AL). Specifically, we explore different sampling strategies, including random sampling, least confidence (LC) sampling, and highest priority (HP) sampling, to study their influence on the collaborative screening process. Results show that incorporating the BERT-based AI agent into the human team can redu",
    "link": "http://arxiv.org/abs/2305.01145",
    "context": "Title: ADVISE: AI-accelerated Design of Evidence Synthesis for Global Development. (arXiv:2305.01145v1 [cs.CL])\nAbstract: When designing evidence-based policies and programs, decision-makers must distill key information from a vast and rapidly growing literature base. Identifying relevant literature from raw search results is time and resource intensive, and is often done by manual screening. In this study, we develop an AI agent based on a bidirectional encoder representations from transformers (BERT) model and incorporate it into a human team designing an evidence synthesis product for global development. We explore the effectiveness of the human-AI hybrid team in accelerating the evidence synthesis process. To further improve team efficiency, we enhance the human-AI hybrid team through active learning (AL). Specifically, we explore different sampling strategies, including random sampling, least confidence (LC) sampling, and highest priority (HP) sampling, to study their influence on the collaborative screening process. Results show that incorporating the BERT-based AI agent into the human team can redu",
    "path": "papers/23/05/2305.01145.json",
    "total_tokens": 1092,
    "translated_title": "ADVISE：AI加速全球发展证据综述设计",
    "translated_abstract": "在设计基于证据的政策和计划时，决策者必须从大量且迅速增长的文献中提取关键信息。从原始搜索结果中确定相关文献需要耗费大量时间和资源，并且通常是通过人工筛选来完成的。在本研究中，我们开发了一个基于BERT模型的AI代理，将其整合到一个人类团队中，设计一个全球发展证据综述产品。我们探索了人-AI混合团队在加速证据综述过程中的有效性。为了进一步提高团队效率，我们通过主动学习(AL)增强了人-AI混合团队。具体而言，我们研究了不同的抽样策略，包括随机抽样，最小置信度(LC)抽样和最高优先级(HP)抽样，以研究它们对协作筛选过程的影响。结果表明，将基于BERT的AI代理整合到人类团队中可以将筛选文档的时间缩短60％，同时保持高准确度。使用主动学习还可以将效率进一步提高20％。我们的研究展示了AI在加速全球发展证据综述设计方面的潜力。",
    "tldr": "该论文研究了如何通过将基于BERT的AI代理融入人类团队中，来加速全球发展证据综述产品的设计；同时还研究了不同的主动学习抽样策略对于协作筛选过程的影响。结果表明，将AI代理整合到人类团队中可以将筛选文档的时间缩短60％，使用主动学习还可以将效率进一步提高20％。",
    "en_tdlr": "This paper studies how to accelerate the design of evidence synthesis for global development by incorporating a BERT-based AI agent into a human team and exploring different active learning sampling strategies. Results show that the AI agent can reduce document screening time by 60% while maintaining high accuracy, and active learning can further improve efficiency by up to 20%."
}