{
    "title": "ElectrodeNet -- A Deep Learning Based Sound Coding Strategy for Cochlear Implants. (arXiv:2305.16753v1 [eess.AS])",
    "abstract": "ElectrodeNet, a deep learning based sound coding strategy for the cochlear implant (CI), is proposed to emulate the advanced combination encoder (ACE) strategy by replacing the conventional envelope detection using various artificial neural networks. The extended ElectrodeNet-CS strategy further incorporates the channel selection (CS). Network models of deep neural network (DNN), convolutional neural network (CNN), and long short-term memory (LSTM) were trained using the Fast Fourier Transformed bins and channel envelopes obtained from the processing of clean speech by the ACE strategy. Objective speech understanding using short-time objective intelligibility (STOI) and normalized covariance metric (NCM) was estimated for ElectrodeNet using CI simulations. Sentence recognition tests for vocoded Mandarin speech were conducted with normal-hearing listeners. DNN, CNN, and LSTM based ElectrodeNets exhibited strong correlations to ACE in objective and subjective scores using mean squared er",
    "link": "http://arxiv.org/abs/2305.16753",
    "context": "Title: ElectrodeNet -- A Deep Learning Based Sound Coding Strategy for Cochlear Implants. (arXiv:2305.16753v1 [eess.AS])\nAbstract: ElectrodeNet, a deep learning based sound coding strategy for the cochlear implant (CI), is proposed to emulate the advanced combination encoder (ACE) strategy by replacing the conventional envelope detection using various artificial neural networks. The extended ElectrodeNet-CS strategy further incorporates the channel selection (CS). Network models of deep neural network (DNN), convolutional neural network (CNN), and long short-term memory (LSTM) were trained using the Fast Fourier Transformed bins and channel envelopes obtained from the processing of clean speech by the ACE strategy. Objective speech understanding using short-time objective intelligibility (STOI) and normalized covariance metric (NCM) was estimated for ElectrodeNet using CI simulations. Sentence recognition tests for vocoded Mandarin speech were conducted with normal-hearing listeners. DNN, CNN, and LSTM based ElectrodeNets exhibited strong correlations to ACE in objective and subjective scores using mean squared er",
    "path": "papers/23/05/2305.16753.json",
    "total_tokens": 1086,
    "translated_title": "基于深度学习的电极编码策略用于人工耳蜗声音编码",
    "translated_abstract": "本文提出了ElectrodeNet，一种基于深度学习的人工耳蜗声音编码策略，旨在取代传统的信封检测使用各种人工神经网络以模拟先进的ACE策略。扩展的ElectrodeNet-CS策略还包含通道选择（CS）。使用ACE策略处理干净语音得到的快速傅里叶变换和通道信封训练了深度神经网络（DNN）、卷积神经网络（CNN）和长短期记忆（LSTM）的网络模型。使用短时客观清晰度（STOI）和归一化协方差度量（NCM）估计了ElectrodeNet在人工耳蜗模拟中的客观语音理解能力。针对声码化的普通话说话测试进行了正常听力受试者的句子识别测试。DNN、CNN和LSTM基于ElectrodeNet在客观和主观评分上都表现出与ACE的强相关性，使用均方误差（MSE）和皮尔逊相关系数（PCC）。与传统的包络提取和通道解复用方法相比，ElectrodeNet表现出了一致的提高语音理解能力的效果。ElectrodeNet为具有有限听觉输入的人工耳蜗用户提高语音感知的解决方案提供了有希望的视野。",
    "tldr": "本文提出了一种基于深度学习的电极编码策略，ElectrodeNet，以提高人工耳蜗用户的语音感知能力，具备有望替代传统的信封检测方法和CS通道选择方法的潜力。",
    "en_tdlr": "This paper proposes a deep learning based electrode coding strategy, ElectrodeNet, to enhance speech perception for cochlear implant (CI) users, which has the potential to replace the traditional envelope detection method and channel selection (CS) method."
}