{
    "title": "Iteratively Improving Biomedical Entity Linking and Event Extraction via Hard Expectation-Maximization. (arXiv:2305.14645v1 [cs.CL])",
    "abstract": "Biomedical entity linking and event extraction are two crucial tasks to support text understanding and retrieval in the biomedical domain. These two tasks intrinsically benefit each other: entity linking disambiguates the biomedical concepts by referring to external knowledge bases and the domain knowledge further provides additional clues to understand and extract the biological processes, while event extraction identifies a key trigger and entities involved to describe each biological process which also captures the structural context to better disambiguate the biomedical entities. However, previous research typically solves these two tasks separately or in a pipeline, leading to error propagation. What's more, it's even more challenging to solve these two tasks together as there is no existing dataset that contains annotations for both tasks. To solve these challenges, we propose joint biomedical entity linking and event extraction by regarding the event structures and entity refere",
    "link": "http://arxiv.org/abs/2305.14645",
    "context": "Title: Iteratively Improving Biomedical Entity Linking and Event Extraction via Hard Expectation-Maximization. (arXiv:2305.14645v1 [cs.CL])\nAbstract: Biomedical entity linking and event extraction are two crucial tasks to support text understanding and retrieval in the biomedical domain. These two tasks intrinsically benefit each other: entity linking disambiguates the biomedical concepts by referring to external knowledge bases and the domain knowledge further provides additional clues to understand and extract the biological processes, while event extraction identifies a key trigger and entities involved to describe each biological process which also captures the structural context to better disambiguate the biomedical entities. However, previous research typically solves these two tasks separately or in a pipeline, leading to error propagation. What's more, it's even more challenging to solve these two tasks together as there is no existing dataset that contains annotations for both tasks. To solve these challenges, we propose joint biomedical entity linking and event extraction by regarding the event structures and entity refere",
    "path": "papers/23/05/2305.14645.json",
    "total_tokens": 913,
    "translated_title": "通过困难期望最大化迭代改善生物医学实体链接和事件提取",
    "translated_abstract": "生物医学实体链接和事件提取是支持生物医学领域文本理解和检索的两个关键任务。先前的研究通常将这两个任务分别解决或以流水线方式解决，从而导致错误传播。为了解决这些挑战，我们提出了通过将事件结构和实体引用作为两组潜在变量来联合生物医学实体链接和事件提取，并通过困难的期望最大化交错两个歧义消除步骤的方法。具体来说，我们在全局结构约束和局部相关性约束的指导下，迭代优化实体和事件分配。在基准数据集上的实验结果表明，我们提出的方法在联合改进生物医学实体链接和事件提取方面非常有效。",
    "tldr": "本研究提出了一种通过困难期望最大化来交替进行生物医学实体链接和事件提取的方法，具有全局结构和局部相关性约束。实验结果表明，在基准数据集上该方法有效地提高了生物医学实体链接和事件提取的准确性。",
    "en_tdlr": "This paper proposes a method of iteratively conducting biomedical entity linking and event extraction through hard expectation-maximization with global structure and local coherence constraints. Experimental results on benchmark datasets show that this method effectively improves the accuracy of biomedical entity linking and event extraction."
}