{
    "title": "Exploring the Rate-Distortion-Complexity Optimization in Neural Image Compression. (arXiv:2305.07678v1 [eess.IV])",
    "abstract": "Despite a short history, neural image codecs have been shown to surpass classical image codecs in terms of rate-distortion performance. However, most of them suffer from significantly longer decoding times, which hinders the practical applications of neural image codecs. This issue is especially pronounced when employing an effective yet time-consuming autoregressive context model since it would increase entropy decoding time by orders of magnitude. In this paper, unlike most previous works that pursue optimal RD performance while temporally overlooking the coding complexity, we make a systematical investigation on the rate-distortion-complexity (RDC) optimization in neural image compression. By quantifying the decoding complexity as a factor in the optimization goal, we are now able to precisely control the RDC trade-off and then demonstrate how the rate-distortion performance of neural image codecs could adapt to various complexity demands. Going beyond the investigation of RDC optim",
    "link": "http://arxiv.org/abs/2305.07678",
    "context": "Title: Exploring the Rate-Distortion-Complexity Optimization in Neural Image Compression. (arXiv:2305.07678v1 [eess.IV])\nAbstract: Despite a short history, neural image codecs have been shown to surpass classical image codecs in terms of rate-distortion performance. However, most of them suffer from significantly longer decoding times, which hinders the practical applications of neural image codecs. This issue is especially pronounced when employing an effective yet time-consuming autoregressive context model since it would increase entropy decoding time by orders of magnitude. In this paper, unlike most previous works that pursue optimal RD performance while temporally overlooking the coding complexity, we make a systematical investigation on the rate-distortion-complexity (RDC) optimization in neural image compression. By quantifying the decoding complexity as a factor in the optimization goal, we are now able to precisely control the RDC trade-off and then demonstrate how the rate-distortion performance of neural image codecs could adapt to various complexity demands. Going beyond the investigation of RDC optim",
    "path": "papers/23/05/2305.07678.json",
    "total_tokens": 1153,
    "translated_title": "探索神经图像压缩中的速率-失真-复杂度优化",
    "translated_abstract": "尽管有着短暂的历史，神经图像编解码器在速率失真性能方面已被证明优于传统图像编解码器。然而，它们中的大多数都遭受着显著较长的解码时间的困扰，这阻碍了神经图像编解码器的实际应用。特别是在使用有效但耗时的自回归上下文模型时，这个问题就更加突出了，因为它会将熵解码时间增加几个数量级。本文系统地研究了神经图像压缩中的速率失真复杂度(RDC)优化，通过将解码复杂度量化为优化目标的因素，我们现在能够精确地控制RDC权衡，然后证明神经图像编解码器的速率失真性能如何适应不同的复杂度要求。除了研究RDC优化，我们还提出了一种新的RDC感知神经图像编解码器RDCAuto，它动态调整其压缩配置来实现目标速率、失真和编码复杂度。我们评估了RDCAuto并证明它优于现有的神经图像编解码器，在Diverse Image Dataset (DID)基准测试和Kodak Lossless True Color Image Suite (Kodak)上实现了最先进的性能，同时能够快速生成压缩图像。",
    "tldr": "本文系统地研究了神经图像压缩中的速率失真复杂度(RDC)优化，提出了一种新的RDC感知神经图像编解码器RDCAuto，其能够动态调整压缩配置以实现目标速率、失真和编码复杂度，且在性能方面优于现有的神经图像编解码器。",
    "en_tdlr": "The paper explores the rate-distortion-complexity optimization in neural image compression and proposes a novel RDC-aware neural image codec, RDCAuto, which dynamically adjusts compression configuration to achieve target rate, distortion, and coding complexity, outperforming existing neural image codecs in performance."
}