{
    "title": "Breeding Machine Translations: Evolutionary approach to survive and thrive in the world of automated evaluation. (arXiv:2305.19330v1 [cs.CL])",
    "abstract": "We propose a genetic algorithm (GA) based method for modifying n-best lists produced by a machine translation (MT) system. Our method offers an innovative approach to improving MT quality and identifying weaknesses in evaluation metrics. Using common GA operations (mutation and crossover) on a list of hypotheses in combination with a fitness function (an arbitrary MT metric), we obtain novel and diverse outputs with high metric scores. With a combination of multiple MT metrics as the fitness function, the proposed method leads to an increase in translation quality as measured by other held-out automatic metrics. With a single metric (including popular ones such as COMET) as the fitness function, we find blind spots and flaws in the metric. This allows for an automated search for adversarial examples in an arbitrary metric, without prior assumptions on the form of such example. As a demonstration of the method, we create datasets of adversarial examples and use them to show that referen",
    "link": "http://arxiv.org/abs/2305.19330",
    "context": "Title: Breeding Machine Translations: Evolutionary approach to survive and thrive in the world of automated evaluation. (arXiv:2305.19330v1 [cs.CL])\nAbstract: We propose a genetic algorithm (GA) based method for modifying n-best lists produced by a machine translation (MT) system. Our method offers an innovative approach to improving MT quality and identifying weaknesses in evaluation metrics. Using common GA operations (mutation and crossover) on a list of hypotheses in combination with a fitness function (an arbitrary MT metric), we obtain novel and diverse outputs with high metric scores. With a combination of multiple MT metrics as the fitness function, the proposed method leads to an increase in translation quality as measured by other held-out automatic metrics. With a single metric (including popular ones such as COMET) as the fitness function, we find blind spots and flaws in the metric. This allows for an automated search for adversarial examples in an arbitrary metric, without prior assumptions on the form of such example. As a demonstration of the method, we create datasets of adversarial examples and use them to show that referen",
    "path": "papers/23/05/2305.19330.json",
    "total_tokens": 901,
    "translated_title": "繁殖机器翻译：进化方法来在自动化评估世界中生存和发展（arXiv:2305.19330v1 [cs.CL]）",
    "translated_abstract": "我们提出了一种基于遗传算法（GA）的方法，用于修改机器翻译（MT）系统生成的n-best列表。我们的方法将常见的GA操作（突变和交叉）与适应度函数（任意MT指标）结合使用，从而获得具有高评估指标分数的新颖和多样化的输出。使用多个MT指标作为适应度函数，所提出的方法导致翻译质量的提高。使用单个指标（包括流行的指标如COMET）作为适应度函数，我们发现了指标的盲点和缺陷。这允许在任意指标中自动搜索对抗性示例，而不需要对这种示例的形式做出先前的假设。作为该方法的演示，我们创建了对抗性示例数据集，并使用它们来展示参考信",
    "tldr": "该论文提出了一种使用遗传算法改进机器翻译的方法，其使用多个MT指标作为适应度函数可以导致翻译质量的提高，并且可以在任意指标中自动搜索对抗性示例，从而揭示指标的盲点和缺陷。"
}