{
    "title": "THUIR@COLIEE 2023: More Parameters and Legal Knowledge for Legal Case Entailment. (arXiv:2305.06817v1 [cs.CL])",
    "abstract": "This paper describes the approach of the THUIR team at the COLIEE 2023 Legal Case Entailment task. This task requires the participant to identify a specific paragraph from a given supporting case that entails the decision for the query case. We try traditional lexical matching methods and pre-trained language models with different sizes. Furthermore, learning-to-rank methods are employed to further improve performance. However, learning-to-rank is not very robust on this task. which suggests that answer passages cannot simply be determined with information retrieval techniques. Experimental results show that more parameters and legal knowledge contribute to the legal case entailment task. Finally, we get the third place in COLIEE 2023. The implementation of our method can be found at https://github.com/CSHaitao/THUIR-COLIEE2023.",
    "link": "http://arxiv.org/abs/2305.06817",
    "context": "Title: THUIR@COLIEE 2023: More Parameters and Legal Knowledge for Legal Case Entailment. (arXiv:2305.06817v1 [cs.CL])\nAbstract: This paper describes the approach of the THUIR team at the COLIEE 2023 Legal Case Entailment task. This task requires the participant to identify a specific paragraph from a given supporting case that entails the decision for the query case. We try traditional lexical matching methods and pre-trained language models with different sizes. Furthermore, learning-to-rank methods are employed to further improve performance. However, learning-to-rank is not very robust on this task. which suggests that answer passages cannot simply be determined with information retrieval techniques. Experimental results show that more parameters and legal knowledge contribute to the legal case entailment task. Finally, we get the third place in COLIEE 2023. The implementation of our method can be found at https://github.com/CSHaitao/THUIR-COLIEE2023.",
    "path": "papers/23/05/2305.06817.json",
    "total_tokens": 914,
    "translated_title": "THUIR@COLIEE 2023：更多参数和法律知识用于法律案例蕴含问题",
    "translated_abstract": "本文描述了THUIR团队在COLIEE 2023法律案例蕴涵任务中的方法。该任务要求参与者从给定的支持案例中识别一个特定段落，该段落蕴含了查询案例的决定。我们尝试了传统的词汇匹配方法和具有不同大小的预训练语言模型，进一步采用学习排序方法提高性能。然而，学习排序方法在这个任务中并不是很健壮，这表明答案段落不能简单地通过信息检索技术确定。实验结果表明，更多的参数和法律知识对法律案例的蕴涵任务有所贡献。最后，我们在COLIEE 2023比赛中获得第三名。我们的方法的实现可以在https://github.com/CSHaitao/THUIR-COLIEE2023找到。",
    "tldr": "本文描述了THUIR团队在COLIEE 2023法律案例蕴涵任务中的方法，尝试了传统的词汇匹配方法和预训练语言模型，并采用学习排序方法进一步提高性能，结果表明更多的参数和法律知识对法律案例蕴涵任务有所贡献。",
    "en_tdlr": "This paper describes the approach of the THUIR team at the COLIEE 2023 Legal Case Entailment task, attempting traditional lexical matching methods and pre-trained language models with different sizes, with the further use of learning-to-rank methods to improve performance, showing that more parameters and legal knowledge contribute to the legal case entailment task."
}