{
    "title": "$2 * n$ is better than $n^2$: Decomposing Event Coreference Resolution into Two Tractable Problems. (arXiv:2305.05672v1 [cs.CL])",
    "abstract": "Event Coreference Resolution (ECR) is the task of linking mentions of the same event either within or across documents. Most mention pairs are not coreferent, yet many that are coreferent can be identified through simple techniques such as lemma matching of the event triggers or the sentences in which they appear. Existing methods for training coreference systems sample from a largely skewed distribution, making it difficult for the algorithm to learn coreference beyond surface matching. Additionally, these methods are intractable because of the quadratic operations needed. To address these challenges, we break the problem of ECR into two parts: a) a heuristic to efficiently filter out a large number of non-coreferent pairs, and b) a training approach on a balanced set of coreferent and non-coreferent mention pairs. By following this approach, we show that we get comparable results to the state of the art on two popular ECR datasets while significantly reducing compute requirements. We",
    "link": "http://arxiv.org/abs/2305.05672",
    "context": "Title: $2 * n$ is better than $n^2$: Decomposing Event Coreference Resolution into Two Tractable Problems. (arXiv:2305.05672v1 [cs.CL])\nAbstract: Event Coreference Resolution (ECR) is the task of linking mentions of the same event either within or across documents. Most mention pairs are not coreferent, yet many that are coreferent can be identified through simple techniques such as lemma matching of the event triggers or the sentences in which they appear. Existing methods for training coreference systems sample from a largely skewed distribution, making it difficult for the algorithm to learn coreference beyond surface matching. Additionally, these methods are intractable because of the quadratic operations needed. To address these challenges, we break the problem of ECR into two parts: a) a heuristic to efficiently filter out a large number of non-coreferent pairs, and b) a training approach on a balanced set of coreferent and non-coreferent mention pairs. By following this approach, we show that we get comparable results to the state of the art on two popular ECR datasets while significantly reducing compute requirements. We",
    "path": "papers/23/05/2305.05672.json",
    "total_tokens": 922,
    "translated_title": "$2n$比$n^2$更好：将事件指称共指消解拆分成两个易于处理的问题",
    "translated_abstract": "事件指称共指消解(ECR)是将同一事件在文档中或跨文档中的指称进行链接的任务。大多数指称对不共指，但许多共指指称可以通过简单的技术进行识别，例如事件触发器或它们出现的句子的词形匹配。现有的共指消解系统训练方法从一个高度倾斜的分布中进行采样，这使得算法难以学习超出表面匹配的共指。此外，由于需要平方操作，这些方法是不可行的。为了解决这些挑战，我们将ECR问题分成两个部分：a) 一种启发式方法，有效地过滤出大量不共指的指称对，b) 在一组均衡的共指和非共指指称对上进行训练。通过采用这种方法，我们证明在两个流行的ECR数据集上获得了与最先进技术相当的结果，同时显着减少了计算需求。",
    "tldr": "为了解决事件指称共指消解中的计算问题，我们将其分成两个部分：一种启发式过滤方法和基于均衡数据集的训练方法。该方法在两个数据集上获得了良好的结果。"
}