{
    "title": "A Scoping Review of Internal Migration and Left-behind Children's Wellbeing in China. (arXiv:2305.04348v1 [econ.GN])",
    "abstract": "Children's well-being of immigrants is facing several challenges related to physical, mental, and educational risks, which may obstacle human capital accumulation and further development. In rural China, due to the restriction of Hukou registration system, nearly 9 million left-behind children (LBC) are in lack of parental care and supervision in 2020 when their parents internally migrate out for work. Through the systematic scoping review, this study provides a comprehensive literature summary and concludes the overall negative effects of parental migration on LBC's physical, mental (especially for left-behind girls), and educational outcomes (especially for left-behind boys). Noticeably, both parents' and mother's migration may exacerbate LBC's disadvantages. Furthermore, remittance from migrants and more family-level and social support may help mitigate the negative influence. Finally, we put forward theoretical and realistic implications which may shed light on potential research d",
    "link": "http://arxiv.org/abs/2305.04348",
    "context": "Title: A Scoping Review of Internal Migration and Left-behind Children's Wellbeing in China. (arXiv:2305.04348v1 [econ.GN])\nAbstract: Children's well-being of immigrants is facing several challenges related to physical, mental, and educational risks, which may obstacle human capital accumulation and further development. In rural China, due to the restriction of Hukou registration system, nearly 9 million left-behind children (LBC) are in lack of parental care and supervision in 2020 when their parents internally migrate out for work. Through the systematic scoping review, this study provides a comprehensive literature summary and concludes the overall negative effects of parental migration on LBC's physical, mental (especially for left-behind girls), and educational outcomes (especially for left-behind boys). Noticeably, both parents' and mother's migration may exacerbate LBC's disadvantages. Furthermore, remittance from migrants and more family-level and social support may help mitigate the negative influence. Finally, we put forward theoretical and realistic implications which may shed light on potential research d",
    "path": "papers/23/05/2305.04348.json",
    "total_tokens": 1023,
    "translated_title": "中国内部移民与留守儿童福祉的综述研究",
    "translated_abstract": "移民子女的福祉面临着与身体、心理和教育风险有关的多重挑战，这可能会妨碍人力资本的积累和进一步发展。在中国农村，由于户口登记制度的限制，2020年约有900万留守儿童在父母内部移民出去工作时缺乏父母的照顾和监督。通过系统的范围性综述，本研究提供了全面的文献综述，并得出了父母移民对留守儿童身体、心理（尤其是留守女童）和教育结果（尤其是留守男童）的总体负面影响。值得注意的是，父母和母亲的移民都可能加剧留守儿童的劣势。此外，移民的汇款和更多的家庭层面和社会支持可能有助于缓解负面影响。最后，我们提出了理论和实际意义，这可能为潜在的研究提供启示。",
    "tldr": "在中国，由于户口登记制度的限制，约有900万留守儿童在父母内部移民出去工作时缺乏照顾和监督。父母移民对留守儿童身体、心理和教育结果产生负面影响，而移民的汇款和更多的家庭层面和社会支持可以缓解这种影响。",
    "en_tdlr": "In China, nearly 9 million left-behind children lack parental care and supervision due to the restrictions of the hukou registration system, which negatively affects their physical, mental (especially for girls), and educational outcomes. Both parents' and mother's migration exacerbates the disadvantages of left-behind children. However, remittance from migrants and more family and social support can mitigate the negative effects."
}