{
    "title": "Sequential Experimental Design for Spectral Measurement: Active Learning Using a Parametric Model. (arXiv:2305.07040v1 [cs.LG])",
    "abstract": "In this study, we demonstrate a sequential experimental design for spectral measurements by active learning using parametric models as predictors. In spectral measurements, it is necessary to reduce the measurement time because of sample fragility and high energy costs. To improve the efficiency of experiments, sequential experimental designs are proposed, in which the subsequent measurement is designed by active learning using the data obtained before the measurement. Conventionally, parametric models are employed in data analysis; when employed for active learning, they are expected to afford a sequential experimental design that improves the accuracy of data analysis. However, due to the complexity of the formulas, a sequential experimental design using general parametric models has not been realized. Therefore, we applied Bayesian inference-based data analysis using the exchange Monte Carlo method to realize a sequential experimental design with general parametric models. In this s",
    "link": "http://arxiv.org/abs/2305.07040",
    "context": "Title: Sequential Experimental Design for Spectral Measurement: Active Learning Using a Parametric Model. (arXiv:2305.07040v1 [cs.LG])\nAbstract: In this study, we demonstrate a sequential experimental design for spectral measurements by active learning using parametric models as predictors. In spectral measurements, it is necessary to reduce the measurement time because of sample fragility and high energy costs. To improve the efficiency of experiments, sequential experimental designs are proposed, in which the subsequent measurement is designed by active learning using the data obtained before the measurement. Conventionally, parametric models are employed in data analysis; when employed for active learning, they are expected to afford a sequential experimental design that improves the accuracy of data analysis. However, due to the complexity of the formulas, a sequential experimental design using general parametric models has not been realized. Therefore, we applied Bayesian inference-based data analysis using the exchange Monte Carlo method to realize a sequential experimental design with general parametric models. In this s",
    "path": "papers/23/05/2305.07040.json",
    "total_tokens": 853,
    "translated_title": "应用参数模型的主动学习：基于顺序实验设计的光谱测量",
    "translated_abstract": "本研究提出了一种利用参数模型作为预测因素的顺序实验设计方法，通过主动学习来进行光谱测量。在光谱测量中，由于样本易损坏和高能量成本的原因，需要缩短测量时间。为了提高实验效率，本研究提出了顺序实验设计，利用之前获得的数据进行主动学习，设计后续测量方式。然而，由于公式的复杂性，一般的参数模型在实现顺序实验设计方面面临困难。因此，我们采用基于Bayesian推断的数据分析方法，利用交换Monte Carlo方法实现了使用一般参数模型的顺序实验设计。",
    "tldr": "本文提出了一种利用参数模型的主动学习方法，可用于光谱测量的顺序实验设计，提高了实验效率，缩短了测量时间。",
    "en_tdlr": "This study proposes an active learning method using parametric models as predictors for sequential experimental design in spectral measurements, which improves experiment efficiency and reduces measurement time. Bayesian inference-based data analysis using the exchange Monte Carlo method is employed for a sequential experimental design with general parametric models."
}