{
    "title": "Gaussian Prior Reinforcement Learning for Nested Named Entity Recognition. (arXiv:2305.07266v1 [cs.CL])",
    "abstract": "Named Entity Recognition (NER) is a well and widely studied task in natural language processing. Recently, the nested NER has attracted more attention since its practicality and difficulty. Existing works for nested NER ignore the recognition order and boundary position relation of nested entities. To address these issues, we propose a novel seq2seq model named GPRL, which formulates the nested NER task as an entity triplet sequence generation process. GPRL adopts the reinforcement learning method to generate entity triplets decoupling the entity order in gold labels and expects to learn a reasonable recognition order of entities via trial and error. Based on statistics of boundary distance for nested entities, GPRL designs a Gaussian prior to represent the boundary distance distribution between nested entities and adjust the output probability distribution of nested boundary tokens. Experiments on three nested NER datasets demonstrate that GPRL outperforms previous nested NER models.",
    "link": "http://arxiv.org/abs/2305.07266",
    "context": "Title: Gaussian Prior Reinforcement Learning for Nested Named Entity Recognition. (arXiv:2305.07266v1 [cs.CL])\nAbstract: Named Entity Recognition (NER) is a well and widely studied task in natural language processing. Recently, the nested NER has attracted more attention since its practicality and difficulty. Existing works for nested NER ignore the recognition order and boundary position relation of nested entities. To address these issues, we propose a novel seq2seq model named GPRL, which formulates the nested NER task as an entity triplet sequence generation process. GPRL adopts the reinforcement learning method to generate entity triplets decoupling the entity order in gold labels and expects to learn a reasonable recognition order of entities via trial and error. Based on statistics of boundary distance for nested entities, GPRL designs a Gaussian prior to represent the boundary distance distribution between nested entities and adjust the output probability distribution of nested boundary tokens. Experiments on three nested NER datasets demonstrate that GPRL outperforms previous nested NER models.",
    "path": "papers/23/05/2305.07266.json",
    "total_tokens": 950,
    "translated_title": "高斯先验强化学习用于嵌套命名实体识别",
    "translated_abstract": "命名实体识别(NER)是自然语言处理中经过广泛研究的任务，最近，嵌套命名实体识别引起了更多的关注，因为它的实用性和难度。现有的嵌套NER作品忽略了嵌套实体的识别顺序和边界位置关系。为了解决这些问题，我们提出了一种新颖的seq2seq模型GPRL，将嵌套NER任务形成一个实体三元组序列生成过程。GPRL采用强化学习方法生成实体三元组，将金标签中的实体顺序解耦，并期望通过试错学习合理的实体识别顺序。基于嵌套实体边界距离的统计，GPRL设计了一个高斯先验，代表嵌套实体之间的边界距离分布，并调整嵌套边界标记的输出概率分布。在三个嵌套NER数据集上的实验证明，GPRL优于以前的嵌套NER模型。",
    "tldr": "该论文提出了一种嵌套命名实体识别模型GPRL，使用高斯先验调整嵌套边界标记的输出概率分布，采用强化学习方法生成实体三元组，无需考虑金标签中的实体顺序，实验结果显示其优于以前的嵌套NER模型。",
    "en_tdlr": "This paper proposes a novel nested named entity recognition model called GPRL, which uses Gaussian prior to adjust the output probability distribution of nested boundary tokens and adopts reinforcement learning to generate entity triplets decoupling the entity order in gold labels, and outperforms previous nested NER models according to experiments on three datasets."
}