{
    "title": "Enhanced Meta Label Correction for Coping with Label Corruption. (arXiv:2305.12961v2 [cs.CV] UPDATED)",
    "abstract": "Traditional methods for learning with the presence of noisy labels have successfully handled datasets with artificially injected noise but still fall short of adequately handling real-world noise. With the increasing use of meta-learning in the diverse fields of machine learning, researchers leveraged auxiliary small clean datasets to meta-correct the training labels. Nonetheless, existing meta-label correction approaches are not fully exploiting their potential. In this study, we propose an Enhanced Meta Label Correction approach abbreviated as EMLC for the learning with noisy labels (LNL) problem. We re-examine the meta-learning process and introduce faster and more accurate meta-gradient derivations. We propose a novel teacher architecture tailored explicitly to the LNL problem, equipped with novel training objectives. EMLC outperforms prior approaches and achieves state-of-the-art results in all standard benchmarks. Notably, EMLC enhances the previous art on the noisy real-world da",
    "link": "http://arxiv.org/abs/2305.12961",
    "context": "Title: Enhanced Meta Label Correction for Coping with Label Corruption. (arXiv:2305.12961v2 [cs.CV] UPDATED)\nAbstract: Traditional methods for learning with the presence of noisy labels have successfully handled datasets with artificially injected noise but still fall short of adequately handling real-world noise. With the increasing use of meta-learning in the diverse fields of machine learning, researchers leveraged auxiliary small clean datasets to meta-correct the training labels. Nonetheless, existing meta-label correction approaches are not fully exploiting their potential. In this study, we propose an Enhanced Meta Label Correction approach abbreviated as EMLC for the learning with noisy labels (LNL) problem. We re-examine the meta-learning process and introduce faster and more accurate meta-gradient derivations. We propose a novel teacher architecture tailored explicitly to the LNL problem, equipped with novel training objectives. EMLC outperforms prior approaches and achieves state-of-the-art results in all standard benchmarks. Notably, EMLC enhances the previous art on the noisy real-world da",
    "path": "papers/23/05/2305.12961.json",
    "total_tokens": 974,
    "translated_title": "用于应对标签错误的增强元标签校正方法",
    "translated_abstract": "传统的处理带有噪声标签的学习方法已经成功处理了人为注入噪声的数据集，但仍然不能充分处理现实世界的噪声。随着元学习在机器学习的各个领域中的广泛应用，研究人员利用辅助的干净小数据集来元校正训练标签。然而，现有的元标签校正方法并没有充分发挥其潜力。在本研究中，我们提出了一种用于带有噪声标签的学习问题的增强元标签校正方法（简称EMLC），重新审视了元学习过程，并引入了更快速和更准确的元梯度推导。我们提出了一种新颖的针对带有噪声标签学习问题的教师架构，配备了新颖的训练目标。EMLC优于先前的方法，在所有标准基准测试中取得了最先进的结果。值得注意的是，EMLC提升了对噪声现实世界数据的先前研究成果。",
    "tldr": "提出了一种用于带有噪声标签的学习问题的增强元标签校正方法（EMLC），通过重新审视元学习过程和引入更准确的元梯度推导，以及使用新颖的教师架构和训练目标，实现了在标准基准测试中取得的最先进结果。"
}