{
    "title": "Predicting blood pressure under circumstances of missing data: An analysis of missing data patterns and imputation methods using NHANES. (arXiv:2305.01655v1 [cs.LG])",
    "abstract": "The World Health Organization defines cardio-vascular disease (CVD) as \"a group of disorders of the heart and blood vessels,\" including coronary heart disease and stroke (WHO 21). CVD is affected by \"intermediate risk factors\" such as raised blood pressure, raised blood glucose, raised blood lipids, and obesity. These are predominantly influenced by lifestyle and behaviour, including physical inactivity, unhealthy diets, high intake of salt, and tobacco and alcohol use. However, genetics and social/environmental factors such as poverty, stress, and racism also play an important role. Researchers studying the behavioural and environmental factors associated with these \"intermediate risk factors\" need access to high quality and detailed information on diet and physical activity. However, missing data are a pervasive problem in clinical and public health research, affecting both randomized trials and observational studies. Reasons for missing data can vary substantially across studies bec",
    "link": "http://arxiv.org/abs/2305.01655",
    "context": "Title: Predicting blood pressure under circumstances of missing data: An analysis of missing data patterns and imputation methods using NHANES. (arXiv:2305.01655v1 [cs.LG])\nAbstract: The World Health Organization defines cardio-vascular disease (CVD) as \"a group of disorders of the heart and blood vessels,\" including coronary heart disease and stroke (WHO 21). CVD is affected by \"intermediate risk factors\" such as raised blood pressure, raised blood glucose, raised blood lipids, and obesity. These are predominantly influenced by lifestyle and behaviour, including physical inactivity, unhealthy diets, high intake of salt, and tobacco and alcohol use. However, genetics and social/environmental factors such as poverty, stress, and racism also play an important role. Researchers studying the behavioural and environmental factors associated with these \"intermediate risk factors\" need access to high quality and detailed information on diet and physical activity. However, missing data are a pervasive problem in clinical and public health research, affecting both randomized trials and observational studies. Reasons for missing data can vary substantially across studies bec",
    "path": "papers/23/05/2305.01655.json",
    "total_tokens": 1160,
    "translated_title": "预测缺失数据情况下的血压变化：使用NHANES分析缺失数据模式和插补方法",
    "translated_abstract": "世界卫生组织将心血管疾病定义为“心脏和血管的一组疾病”，包括冠心病和中风。这些疾病受到“中间风险因素”的影响，如高血压、高血糖、高血脂和肥胖。这些风险因素主要受生活方式和行为影响，包括身体不活动、不健康的饮食、高盐摄入以及吸烟和饮酒。然而，遗传学和社会/环境因素如贫困、压力和种族歧视也起着重要作用。本文作者使用美国国家健康和营养检查调查(NHANES)的数据，分析了缺失数据模式，并比较了各种插补方法以预测血压变化。研究发现，使用链式方程(多重插补)的插补方法是处理缺失数据的最有效方法，并且插补模型应包括传统的预测因素(如年龄、性别、种族/族裔、体重指数)，以及可能与缺失数据相关的变量(如收入、教育程度、糖尿病状态)。",
    "tldr": "本文使用美国国家健康和营养检查调查数据研究缺失数据模式，并揭示了多重插补是预测血压变化最有效的方法，插补模型应包括传统预测因素和可能与缺失数据相关的变量。",
    "en_tdlr": "This paper analyzes missing data patterns and compares various imputation methods for predicting blood pressure using data from the National Health and Nutrition Examination Survey. The authors found that multiple imputation using chained equations was the most effective method for imputing missing data and that imputation models should include traditional predictors and variables associated with missingness."
}