{
    "title": "Multinomial Logistic Regression: Asymptotic Normality on Null Covariates in High-Dimensions. (arXiv:2305.17825v1 [math.ST])",
    "abstract": "This paper investigates the asymptotic distribution of the maximum-likelihood estimate (MLE) in multinomial logistic models in the high-dimensional regime where dimension and sample size are of the same order. While classical large-sample theory provides asymptotic normality of the MLE under certain conditions, such classical results are expected to fail in high-dimensions as documented for the binary logistic case in the seminal work of Sur and Cand\\`es [2019]. We address this issue in classification problems with 3 or more classes, by developing asymptotic normality and asymptotic chi-square results for the multinomial logistic MLE (also known as cross-entropy minimizer) on null covariates. Our theory leads to a new methodology to test the significance of a given feature. Extensive simulation studies on synthetic data corroborate these asymptotic results and confirm the validity of proposed p-values for testing the significance of a given feature.",
    "link": "http://arxiv.org/abs/2305.17825",
    "context": "Title: Multinomial Logistic Regression: Asymptotic Normality on Null Covariates in High-Dimensions. (arXiv:2305.17825v1 [math.ST])\nAbstract: This paper investigates the asymptotic distribution of the maximum-likelihood estimate (MLE) in multinomial logistic models in the high-dimensional regime where dimension and sample size are of the same order. While classical large-sample theory provides asymptotic normality of the MLE under certain conditions, such classical results are expected to fail in high-dimensions as documented for the binary logistic case in the seminal work of Sur and Cand\\`es [2019]. We address this issue in classification problems with 3 or more classes, by developing asymptotic normality and asymptotic chi-square results for the multinomial logistic MLE (also known as cross-entropy minimizer) on null covariates. Our theory leads to a new methodology to test the significance of a given feature. Extensive simulation studies on synthetic data corroborate these asymptotic results and confirm the validity of proposed p-values for testing the significance of a given feature.",
    "path": "papers/23/05/2305.17825.json",
    "total_tokens": 893,
    "translated_title": "多项式 Logistic 回归：高维空间中零协变量的渐近正态性研究",
    "translated_abstract": "本文研究了在维数和样本量相同的高维情况下多项式 logistic 模型中最大似然估计的渐近分布。尽管经典的大样本理论在一定条件下提供了 MLE 的渐近正态性，但是这些经典结果在高维情况下有望失败，就像 Sur 和 Cand\\`es [2019] 在二分类 logistic 情况下的开创性工作所记录的那样。本文通过开发零协变量上的多项式 logistic MLE (也称为交叉熵最小化器)的渐近正态性和渐近卡方结果，解决了三类及以上分类问题中的这个问题。我们的理论为测试给定特征的显着性提供了一种新的方法论。对合成数据的广泛模拟研究证实了这些渐近结果，并确认了用于测试给定特征的提议的 p 值的有效性。",
    "tldr": "本文研究了高维多项式 logistic 模型中零协变量上最大似然估计的渐近正态性，为测试给定特征显着性提供了一种新方法。",
    "en_tdlr": "This paper investigates the asymptotic distribution of the maximum-likelihood estimate in multinomial logistic models in the high-dimensional regime and developed a new methodology to test the significance of a given feature, by developing asymptotic normality and asymptotic chi-square results for the multinomial logistic MLE on null covariates."
}