{
    "title": "Generalized equivalences between subsampling and ridge regularization. (arXiv:2305.18496v1 [math.ST])",
    "abstract": "We establish precise structural and risk equivalences between subsampling and ridge regularization for ensemble ridge estimators. Specifically, we prove that linear and quadratic functionals of subsample ridge estimators, when fitted with different ridge regularization levels $\\lambda$ and subsample aspect ratios $\\psi$, are asymptotically equivalent along specific paths in the $(\\lambda, \\psi )$-plane (where $\\psi$ is the ratio of the feature dimension to the subsample size). Our results only require bounded moment assumptions on feature and response distributions and allow for arbitrary joint distributions. Furthermore, we provide a datadependent method to determine the equivalent paths of $(\\lambda, \\psi )$. An indirect implication of our equivalences is that optimally-tuned ridge regression exhibits a monotonic prediction risk in the data aspect ratio. This resolves a recent open problem raised by Nakkiran et al. under general data distributions and a mild regularity condition that",
    "link": "http://arxiv.org/abs/2305.18496",
    "context": "Title: Generalized equivalences between subsampling and ridge regularization. (arXiv:2305.18496v1 [math.ST])\nAbstract: We establish precise structural and risk equivalences between subsampling and ridge regularization for ensemble ridge estimators. Specifically, we prove that linear and quadratic functionals of subsample ridge estimators, when fitted with different ridge regularization levels $\\lambda$ and subsample aspect ratios $\\psi$, are asymptotically equivalent along specific paths in the $(\\lambda, \\psi )$-plane (where $\\psi$ is the ratio of the feature dimension to the subsample size). Our results only require bounded moment assumptions on feature and response distributions and allow for arbitrary joint distributions. Furthermore, we provide a datadependent method to determine the equivalent paths of $(\\lambda, \\psi )$. An indirect implication of our equivalences is that optimally-tuned ridge regression exhibits a monotonic prediction risk in the data aspect ratio. This resolves a recent open problem raised by Nakkiran et al. under general data distributions and a mild regularity condition that",
    "path": "papers/23/05/2305.18496.json",
    "total_tokens": 940,
    "translated_title": "子采样与岭回归的广义等价性研究",
    "translated_abstract": "我们针对举集岭估计器，建立了子采样和岭回归之间的精确结构和风险等价性。具体而言，我们证明了，当用不同的岭正则化水平$\\lambda$和子采样比例$\\psi$拟合子样岭估计器的线性和二次泛函，在$(\\lambda,\\psi)$-平面上沿着特定路径渐近等价（其中$\\psi$是特征维度与子采样大小的比率）。我们的结果仅要求特征和响应分布具有有界矩，并允许任意联合分布。此外，我们提供了一种数据相关的方法来确定$(\\lambda,\\psi)$的等价路径。我们结果的间接含义是，在数据方面比例中，调优的岭回归呈现出单调预测风险。这解决了Nakkiran等人提出的一个近期未解决的开放性问题，在一般数据分布和温和的正则条件下。",
    "tldr": "此篇论文研究了举集岭估计器中子采样和岭回归之间的等价性，发现二者在一定路径中是渐近等价的，并提出了数据相关的方法确定等价路径，间接解决了岭回归调优中预测风险单调性的影响因素问题。"
}