{
    "title": "Venn Diagram Multi-label Class Interpretation of Diabetic Foot Ulcer with Color and Sharpness Enhancement. (arXiv:2305.01044v1 [cs.CV])",
    "abstract": "DFU is a severe complication of diabetes that can lead to amputation of the lower limb if not treated properly. Inspired by the 2021 Diabetic Foot Ulcer Grand Challenge, researchers designed automated multi-class classification of DFU, including infection, ischaemia, both of these conditions, and none of these conditions. However, it remains a challenge as classification accuracy is still not satisfactory. This paper proposes a Venn Diagram interpretation of multi-label CNN-based method, utilizing different image enhancement strategies, to improve the multi-class DFU classification. We propose to reduce the four classes into two since both class wounds can be interpreted as the simultaneous occurrence of infection and ischaemia and none class wounds as the absence of infection and ischaemia. We introduce a novel Venn Diagram representation block in the classifier to interpret all four classes from these two classes. To make our model more resilient, we propose enhancing the perceptual ",
    "link": "http://arxiv.org/abs/2305.01044",
    "context": "Title: Venn Diagram Multi-label Class Interpretation of Diabetic Foot Ulcer with Color and Sharpness Enhancement. (arXiv:2305.01044v1 [cs.CV])\nAbstract: DFU is a severe complication of diabetes that can lead to amputation of the lower limb if not treated properly. Inspired by the 2021 Diabetic Foot Ulcer Grand Challenge, researchers designed automated multi-class classification of DFU, including infection, ischaemia, both of these conditions, and none of these conditions. However, it remains a challenge as classification accuracy is still not satisfactory. This paper proposes a Venn Diagram interpretation of multi-label CNN-based method, utilizing different image enhancement strategies, to improve the multi-class DFU classification. We propose to reduce the four classes into two since both class wounds can be interpreted as the simultaneous occurrence of infection and ischaemia and none class wounds as the absence of infection and ischaemia. We introduce a novel Venn Diagram representation block in the classifier to interpret all four classes from these two classes. To make our model more resilient, we propose enhancing the perceptual ",
    "path": "papers/23/05/2305.01044.json",
    "total_tokens": 957,
    "translated_title": "Venn图多标签分类解释与颜色和清晰度增强的糖尿病足潰疡",
    "translated_abstract": "糖尿病足潰疡是糖尿病的严重并发症，如果不正确治疗，可能导致下肢截肢。受2021年糖尿病足潰疡大挑战的启发，研究人员设计了DFU的自动化多类别分类，包括感染、缺血、这两种情况以及以上两种情况均不属于的情况。然而，分类准确度仍然不尽人意。本文提出了一种 Venn 图解释的多标签基于 CNN 的方法，利用不同的图像增强策略，以改进多类别 DFU 分类。我们建议将这四个类别减少为两个类别，因为这两个类别的伤口可以解释为感染和缺血的同时发生，而无类别伤口则表示缺乏感染和缺血。我们在分类器中引入了一种新颖的 Venn 图表示块，用于解释这两个类别的所有四个类。为使我们的模型更具弹性，我们建议增强感知。",
    "tldr": "本文提出了一种基于Venn图解释的多标签分类算法，通过不同的图像增强策略，将四个类别缩减为两个，有效提高了糖尿病足潰疡的多类别分类准确度。"
}