{
    "title": "Dissertation on Applied Microeconomics of Freemium Pricing Strategies in Mobile App Market. (arXiv:2305.09479v1 [econ.GN])",
    "abstract": "In my dissertation, I will analyze how the product market position of a mobile app affects its pricing strategies, which in turn impacts an app's monetization process. Using natural language processing and k-mean clustering on apps' text descriptions, I created a new variable that measures the distinctiveness of an app as compared to its peers. I created four pricing variables, price, cumulative installs, and indicators of whether an app contains in-app ads and purchases. I found that the effect differs for successful apps and less successful apps. I measure the success here using cumulative installs and the firms that developed the apps. Based on third-party rankings and the shape of the distribution of installs, I set two thresholds and divided apps into market-leading and market-follower apps. The market-leading sub-sample consists of apps with high cumulative installs or developed by prestigious firms, and the market-follower sub-sample consists of the rest of the apps. I found tha",
    "link": "http://arxiv.org/abs/2305.09479",
    "context": "Title: Dissertation on Applied Microeconomics of Freemium Pricing Strategies in Mobile App Market. (arXiv:2305.09479v1 [econ.GN])\nAbstract: In my dissertation, I will analyze how the product market position of a mobile app affects its pricing strategies, which in turn impacts an app's monetization process. Using natural language processing and k-mean clustering on apps' text descriptions, I created a new variable that measures the distinctiveness of an app as compared to its peers. I created four pricing variables, price, cumulative installs, and indicators of whether an app contains in-app ads and purchases. I found that the effect differs for successful apps and less successful apps. I measure the success here using cumulative installs and the firms that developed the apps. Based on third-party rankings and the shape of the distribution of installs, I set two thresholds and divided apps into market-leading and market-follower apps. The market-leading sub-sample consists of apps with high cumulative installs or developed by prestigious firms, and the market-follower sub-sample consists of the rest of the apps. I found tha",
    "path": "papers/23/05/2305.09479.json",
    "total_tokens": 971,
    "translated_title": "移动应用市场中免费增值策略的应用微观经济学论文研究",
    "translated_abstract": "在我的论文中，我将分析一个移动应用的产品市场位置如何影响其定价策略，从而影响应用的货币化过程。我利用自然语言处理和应用文本描述的k-mean聚类方法，创建了一个新的变量来衡量这些应用与同行之间的差异性。我创建了四个标准，即价格、累计安装量以及应用是否包含应用内广告和购买指示符。我发现，该效应对成功的应用和不成功的应用的影响略有不同。我用累计安装量和开发应用的公司来衡量成功。基于第三方排名和安装分布的形状，我设置了两个阈值，并将应用分为市场领先和市场后继应用。市场领先的样本由具有高累计安装量或由知名公司开发的应用组成，而市场后继的样本则由其它应用组成。",
    "tldr": "我的论文分析了移动应用的产品市场位置如何影响其定价策略，从而影响应用的货币化过程。我创建了一个新变量来衡量应用与同行之间的差异性，研究发现对成功的应用和不成功的应用的影响不同，并根据应用的累计安装量和公司知名度将应用分为市场领先和市场后继两组。",
    "en_tdlr": "My dissertation analyzes how the product market position of a mobile app affects its pricing strategies, which in turn impacts its monetization process. I created a new variable to measure the distinctiveness of an app and found that the effect of pricing differs for successful apps and less successful ones, dividing them into market-leading and market-follower apps based on cumulative installs and the firms that developed them."
}