{
    "title": "Revisiting Random Forests in a Comparative Evaluation of Graph Convolutional Neural Network Variants for Traffic Prediction. (arXiv:2305.19292v1 [cs.LG])",
    "abstract": "Traffic prediction is a spatiotemporal predictive task that plays an essential role in intelligent transportation systems. Today, graph convolutional neural networks (GCNNs) have become the prevailing models in the traffic prediction literature since they excel at extracting spatial correlations. In this work, we classify the components of successful GCNN prediction models and analyze the effects of matrix factorization, attention mechanism, and weight sharing on their performance. Furthermore, we compare these variations against random forests, a traditional regression method that predates GCNNs by over 15 years. We evaluated these methods using simulated data of two regions in Toronto as well as real-world sensor data from selected California highways. We found that incorporating matrix factorization, attention, and location-specific model weights either individually or collectively into GCNNs can result in a better overall performance. Moreover, although random forest regression is ",
    "link": "http://arxiv.org/abs/2305.19292",
    "context": "Title: Revisiting Random Forests in a Comparative Evaluation of Graph Convolutional Neural Network Variants for Traffic Prediction. (arXiv:2305.19292v1 [cs.LG])\nAbstract: Traffic prediction is a spatiotemporal predictive task that plays an essential role in intelligent transportation systems. Today, graph convolutional neural networks (GCNNs) have become the prevailing models in the traffic prediction literature since they excel at extracting spatial correlations. In this work, we classify the components of successful GCNN prediction models and analyze the effects of matrix factorization, attention mechanism, and weight sharing on their performance. Furthermore, we compare these variations against random forests, a traditional regression method that predates GCNNs by over 15 years. We evaluated these methods using simulated data of two regions in Toronto as well as real-world sensor data from selected California highways. We found that incorporating matrix factorization, attention, and location-specific model weights either individually or collectively into GCNNs can result in a better overall performance. Moreover, although random forest regression is ",
    "path": "papers/23/05/2305.19292.json",
    "total_tokens": 960,
    "translated_title": "重新审视随机森林：比较图卷积神经网络变体在交通预测中的性能",
    "translated_abstract": "交通预测是智能交通系统中至关重要的时空预测任务。目前，图卷积神经网络（GCNN）已成为交通预测领域主流模型，因其擅长提取空间相关性。本文对成功的GCNN预测模型进行组成部分的分类并分析矩阵分解、注意力机制和权重共享对其性能的影响。此外，我们将这些变体与传统回归方法——随机森林进行比较。我们使用多伦多两个地区的模拟数据以及选定的加州高速公路的真实世界传感器数据来评估这些方法。我们发现将矩阵分解、注意力和位置特定的模型权重单独或集体加入GCNN中可以实现更好的整体性能。此外，尽管随机森林回归仍具有一定的竞争力，但在准确性和鲁棒性方面，GCNN表现更出色。",
    "tldr": "本论文比较了图卷积神经网络和传统方法随机森林在交通预测中的性能，证明将矩阵分解、注意力和位置特定的模型权重单独或集体加入GCNN可以提高其整体性能，且在准确性和鲁棒性方面GCNN表现更出色。",
    "en_tdlr": "This paper compares the performance of graph convolutional neural networks and the traditional method of random forests in traffic prediction, demonstrating that incorporating matrix factorization, attention, and location-specific model weights into GCNN can improve its overall performance. Moreover, GCNN outperforms random forests in terms of accuracy and robustness."
}