{
    "title": "Improving Heterogeneous Model Reuse by Density Estimation. (arXiv:2305.13871v1 [cs.LG])",
    "abstract": "This paper studies multiparty learning, aiming to learn a model using the private data of different participants. Model reuse is a promising solution for multiparty learning, assuming that a local model has been trained for each party. Considering the potential sample selection bias among different parties, some heterogeneous model reuse approaches have been developed. However, although pre-trained local classifiers are utilized in these approaches, the characteristics of the local data are not well exploited. This motivates us to estimate the density of local data and design an auxiliary model together with the local classifiers for reuse. To address the scenarios where some local models are not well pre-trained, we further design a multiparty cross-entropy loss for calibration. Upon existing works, we address a challenging problem of heterogeneous model reuse from a decision theory perspective and take advantage of recent advances in density estimation. Experimental results on both s",
    "link": "http://arxiv.org/abs/2305.13871",
    "context": "Title: Improving Heterogeneous Model Reuse by Density Estimation. (arXiv:2305.13871v1 [cs.LG])\nAbstract: This paper studies multiparty learning, aiming to learn a model using the private data of different participants. Model reuse is a promising solution for multiparty learning, assuming that a local model has been trained for each party. Considering the potential sample selection bias among different parties, some heterogeneous model reuse approaches have been developed. However, although pre-trained local classifiers are utilized in these approaches, the characteristics of the local data are not well exploited. This motivates us to estimate the density of local data and design an auxiliary model together with the local classifiers for reuse. To address the scenarios where some local models are not well pre-trained, we further design a multiparty cross-entropy loss for calibration. Upon existing works, we address a challenging problem of heterogeneous model reuse from a decision theory perspective and take advantage of recent advances in density estimation. Experimental results on both s",
    "path": "papers/23/05/2305.13871.json",
    "total_tokens": 902,
    "translated_title": "基于密度估计的异构模型重用方案优化",
    "translated_abstract": "本文研究多方学习，旨在使用不同参与方的私有数据来学习模型。模型重用是多方学习的一种有前途的解决方案，假设每个参与方都训练了本地模型。考虑到不同参与方之间可能存在的样本选择偏差，一些异构模型重用方法已经被开发出来。虽然这些方法利用了预训练的本地分类器，但本地数据的特征并没有被很好地利用。这促使我们估计本地数据的密度，并设计一个辅助模型与本地分类器一起重用。为了解决一些本地模型训练不充分的情况，我们进一步设计了多方交叉熵损失进行校准。在现有工作基础上，我们从决策理论的角度解决了异构模型重用的一个具有挑战性的问题，并利用了密度估计的最新进展。实验结果表明，我们的方法在多个数据集上均优于现有方法。",
    "tldr": "本文提出了一种基于密度估计的异构模型重用方案，使用本地分类器和辅助模型进行重用，并设计了多方交叉熵损失用于校准。实验结果表明，该方法在多个数据集上表现优于现有方法。",
    "en_tdlr": "This paper proposes a heterogeneous model reuse approach based on density estimation, which utilizes local classifiers and an auxiliary model for reuse, and designs a multiparty cross-entropy loss for calibration. Experimental results demonstrate that this method outperforms existing approaches on multiple datasets."
}