{
    "title": "Gaussian Process Port-Hamiltonian Systems: Bayesian Learning with Physics Prior. (arXiv:2305.09017v1 [eess.SY])",
    "abstract": "Data-driven approaches achieve remarkable results for the modeling of complex dynamics based on collected data. However, these models often neglect basic physical principles which determine the behavior of any real-world system. This omission is unfavorable in two ways: The models are not as data-efficient as they could be by incorporating physical prior knowledge, and the model itself might not be physically correct. We propose Gaussian Process Port-Hamiltonian systems (GP-PHS) as a physics-informed Bayesian learning approach with uncertainty quantification. The Bayesian nature of GP-PHS uses collected data to form a distribution over all possible Hamiltonians instead of a single point estimate. Due to the underlying physics model, a GP-PHS generates passive systems with respect to designated inputs and outputs. Further, the proposed approach preserves the compositional nature of Port-Hamiltonian systems.",
    "link": "http://arxiv.org/abs/2305.09017",
    "context": "Title: Gaussian Process Port-Hamiltonian Systems: Bayesian Learning with Physics Prior. (arXiv:2305.09017v1 [eess.SY])\nAbstract: Data-driven approaches achieve remarkable results for the modeling of complex dynamics based on collected data. However, these models often neglect basic physical principles which determine the behavior of any real-world system. This omission is unfavorable in two ways: The models are not as data-efficient as they could be by incorporating physical prior knowledge, and the model itself might not be physically correct. We propose Gaussian Process Port-Hamiltonian systems (GP-PHS) as a physics-informed Bayesian learning approach with uncertainty quantification. The Bayesian nature of GP-PHS uses collected data to form a distribution over all possible Hamiltonians instead of a single point estimate. Due to the underlying physics model, a GP-PHS generates passive systems with respect to designated inputs and outputs. Further, the proposed approach preserves the compositional nature of Port-Hamiltonian systems.",
    "path": "papers/23/05/2305.09017.json",
    "total_tokens": 858,
    "translated_title": "高斯过程Port-Hamiltonian系统：基于物理先验的贝叶斯学习。",
    "translated_abstract": "基于数据的方法在收集到的数据基础上对复杂动态进行建模取得了显著成果。然而，这些模型通常忽略了决定任何现实系统行为的基本物理原理，这种省略不利于两方面：其一，模型在融合物理先验知识方面缺乏数据效率；其二，模型本身可能不符合物理规律。我们提出了高斯过程Port-Hamiltonian系统（GP-PHS）作为基于物理先验的贝叶斯学习方法，并且进行了不确定性量化。由于GP-PHS具有概率论本质，它使用所收集到的数据来形成所有可能的哈密顿量分布，而非单个点估计。由于底层的物理模型，GP-PHS生成关于指定输入和输出被动系统。此外，所提出的方法保留了Port-Hamiltonian系统的组合性质。",
    "tldr": "高斯过程Port-Hamiltonian系统是一种基于物理先验的贝叶斯学习方法，能够通过对数据建模生成关于指定输入和输出的被动系统，同时保留了Port-Hamiltonian系统的组合性质。",
    "en_tdlr": "Gaussian Process Port-Hamiltonian systems are a physics-informed Bayesian learning approach that can generate passive systems with respect to designated inputs and outputs by modeling data. The proposed approach also preserves the compositional nature of Port-Hamiltonian systems."
}