{
    "title": "A Hybrid Framework of Reinforcement Learning and Convex Optimization for UAV-Based Autonomous Metaverse Data Collection. (arXiv:2305.18481v1 [cs.LG])",
    "abstract": "Unmanned aerial vehicles (UAVs) are promising for providing communication services due to their advantages in cost and mobility, especially in the context of the emerging Metaverse and Internet of Things (IoT). This paper considers a UAV-assisted Metaverse network, in which UAVs extend the coverage of the base station (BS) to collect the Metaverse data generated at roadside units (RSUs). Specifically, to improve the data collection efficiency, resource allocation and trajectory control are integrated into the system model. The time-dependent nature of the optimization problem makes it non-trivial to be solved by traditional convex optimization methods. Based on the proposed UAV-assisted Metaverse network system model, we design a hybrid framework with reinforcement learning and convex optimization to {cooperatively} solve the time-sequential optimization problem. Simulation results show that the proposed framework is able to reduce the mission completion time with a given transmission ",
    "link": "http://arxiv.org/abs/2305.18481",
    "context": "Title: A Hybrid Framework of Reinforcement Learning and Convex Optimization for UAV-Based Autonomous Metaverse Data Collection. (arXiv:2305.18481v1 [cs.LG])\nAbstract: Unmanned aerial vehicles (UAVs) are promising for providing communication services due to their advantages in cost and mobility, especially in the context of the emerging Metaverse and Internet of Things (IoT). This paper considers a UAV-assisted Metaverse network, in which UAVs extend the coverage of the base station (BS) to collect the Metaverse data generated at roadside units (RSUs). Specifically, to improve the data collection efficiency, resource allocation and trajectory control are integrated into the system model. The time-dependent nature of the optimization problem makes it non-trivial to be solved by traditional convex optimization methods. Based on the proposed UAV-assisted Metaverse network system model, we design a hybrid framework with reinforcement learning and convex optimization to {cooperatively} solve the time-sequential optimization problem. Simulation results show that the proposed framework is able to reduce the mission completion time with a given transmission ",
    "path": "papers/23/05/2305.18481.json",
    "total_tokens": 943,
    "translated_title": "一种基于强化学习和凸优化的混合框架，用于基于UAV的自主元宇宙数据收集",
    "translated_abstract": "无人机（UAV）由于成本和灵活性的优势，在提供通信服务方面具有很大的潜力，尤其是在新兴元宇宙和物联网（IoT）的背景下。本文考虑了一种UAV辅助的元宇宙网络，其中UAV扩展了基站（BS）的覆盖范围，收集路边单元（RSU）产生的元宇宙数据。为了提高数据收集效率，系统模型中集成了资源分配和轨迹控制。优化问题的时间依赖性使传统凸优化方法难以解决。基于所提出的UAV辅助的元宇宙网络系统模型，我们设计了一种强化学习和凸优化的混合框架，以“合作”方式解决时间顺序优化问题。仿真结果表明，所提出的框架能够在保证收集数据质量的同时，减少任务完成时间。",
    "tldr": "本论文提出了一种使用无人机辅助的元宇宙网络模型，将资源分配和轨迹控制集成到系统模型中，设计了一种强化学习和凸优化的混合框架，以“合作”方式解决时间顺序优化问题，使得数据收集效率得到提高。",
    "en_tdlr": "This paper proposes a UAV-assisted Metaverse network system model, integrates resource allocation and trajectory control into the system model, designs a hybrid framework with reinforcement learning and convex optimization to cooperatively solve the time-sequential optimization problem, and improves the data collection efficiency."
}