{
    "title": "Diffusion Dataset Generation: Towards Closing the Sim2Real Gap for Pedestrian Detection. (arXiv:2305.09401v1 [cs.CV])",
    "abstract": "We propose a method that augments a simulated dataset using diffusion models to improve the performance of pedestrian detection in real-world data. The high cost of collecting and annotating data in the real-world has motivated the use of simulation platforms to create training datasets. While simulated data is inexpensive to collect and annotate, it unfortunately does not always closely match the distribution of real-world data, which is known as the sim2real gap. In this paper we propose a novel method of synthetic data creation meant to close the sim2real gap for the challenging pedestrian detection task. Our method uses a diffusion-based architecture to learn a real-world distribution which, once trained, is used to generate datasets. We mix this generated data with simulated data as a form of augmentation and show that training on a combination of generated and simulated data increases average precision by as much as 27.3% for pedestrian detection models in real-world data, compar",
    "link": "http://arxiv.org/abs/2305.09401",
    "context": "Title: Diffusion Dataset Generation: Towards Closing the Sim2Real Gap for Pedestrian Detection. (arXiv:2305.09401v1 [cs.CV])\nAbstract: We propose a method that augments a simulated dataset using diffusion models to improve the performance of pedestrian detection in real-world data. The high cost of collecting and annotating data in the real-world has motivated the use of simulation platforms to create training datasets. While simulated data is inexpensive to collect and annotate, it unfortunately does not always closely match the distribution of real-world data, which is known as the sim2real gap. In this paper we propose a novel method of synthetic data creation meant to close the sim2real gap for the challenging pedestrian detection task. Our method uses a diffusion-based architecture to learn a real-world distribution which, once trained, is used to generate datasets. We mix this generated data with simulated data as a form of augmentation and show that training on a combination of generated and simulated data increases average precision by as much as 27.3% for pedestrian detection models in real-world data, compar",
    "path": "papers/23/05/2305.09401.json",
    "total_tokens": 940,
    "translated_title": "扩散数据集生成：为行人检测缩小Sim2Real的差距",
    "translated_abstract": "我们提出了一种方法，使用扩散模型增强模拟数据集，以提高现实世界数据中行人检测的性能。在现实世界中收集和注释数据的高昂成本促使使用模拟平台创建训练数据集。虽然模拟数据易于收集和注释，但往往与现实世界的数据分布不符，这被称为Sim2Real差距。在本文中，我们提出了一种新颖的合成数据创建方法，旨在缩小行人检测任务中的Sim2Real差距。我们的方法使用基于扩散的架构来学习现实世界的分布，一旦训练完成，就将其用于生成数据集。我们将此生成数据与模拟数据混合以形成增强形式，并证明在真实世界的数据中训练生成数据和模拟数据的组合可以将行人检测模型的平均精度提高高达27.3％。",
    "tldr": "本文提出了一种使用扩散模型增强模拟数据集的方法，以缩小行人检测中的Sim2Real差距，该方法将生成的数据与模拟数据混合进行训练，在真实世界的数据中表现出更好的性能，平均精度提高高达27.3％。",
    "en_tdlr": "This paper proposes a method that uses diffusion models to enhance simulated data for improving the performance of pedestrian detection in real-world data, and successfully narrows the Sim2Real gap in pedestrian detection by mixing generated data with simulated data for training. The average precision of the model trained on this combined dataset improves by up to 27.3% in real-world data compared to training only on simulated data."
}