{
    "title": "Uniform-PAC Guarantees for Model-Based RL with Bounded Eluder Dimension. (arXiv:2305.08350v1 [cs.LG])",
    "abstract": "Recently, there has been remarkable progress in reinforcement learning (RL) with general function approximation. However, all these works only provide regret or sample complexity guarantees. It is still an open question if one can achieve stronger performance guarantees, i.e., the uniform probably approximate correctness (Uniform-PAC) guarantee that can imply both a sub-linear regret bound and a polynomial sample complexity for any target learning accuracy. We study this problem by proposing algorithms for both nonlinear bandits and model-based episodic RL using the general function class with a bounded eluder dimension. The key idea of the proposed algorithms is to assign each action to different levels according to its width with respect to the confidence set. The achieved uniform-PAC sample complexity is tight in the sense that it matches the state-of-the-art regret bounds or sample complexity guarantees when reduced to the linear case. To the best of our knowledge, this is the firs",
    "link": "http://arxiv.org/abs/2305.08350",
    "context": "Title: Uniform-PAC Guarantees for Model-Based RL with Bounded Eluder Dimension. (arXiv:2305.08350v1 [cs.LG])\nAbstract: Recently, there has been remarkable progress in reinforcement learning (RL) with general function approximation. However, all these works only provide regret or sample complexity guarantees. It is still an open question if one can achieve stronger performance guarantees, i.e., the uniform probably approximate correctness (Uniform-PAC) guarantee that can imply both a sub-linear regret bound and a polynomial sample complexity for any target learning accuracy. We study this problem by proposing algorithms for both nonlinear bandits and model-based episodic RL using the general function class with a bounded eluder dimension. The key idea of the proposed algorithms is to assign each action to different levels according to its width with respect to the confidence set. The achieved uniform-PAC sample complexity is tight in the sense that it matches the state-of-the-art regret bounds or sample complexity guarantees when reduced to the linear case. To the best of our knowledge, this is the firs",
    "path": "papers/23/05/2305.08350.json",
    "total_tokens": 945,
    "translated_title": "有界Eluder维度下基于模型的强化学习的统一PAC保证",
    "translated_abstract": "近年来，强化学习中的通用函数逼近取得了显着进展。然而，所有这些工作都仅提供遗憾或样本复杂度保证。一个更强的性能保证——统一概率近似正确性（Uniform-PAC）保证仍然是一个开放的问题，它可以同时暗示任何目标学习准确度的次线性遗憾界和多项式样本复杂度。本文通过提出使用具有有界Eluder维度的一般函数类的非线性bandits和基于模型的节目式RL的算法来研究这个问题。所提出算法的关键思想是将每个操作根据其相对于置信集的宽度分配到不同的级别中。实现的统一PAC样本复杂度是紧密匹配最先进的减小到线性情况下的遗憾界或样本复杂度保证。据我们所知，这是第一个使用具有有界Eluder维度的一般函数逼近提供非线性bandits和基于模型的节目式RL的统一PAC保证的工作。",
    "tldr": "本研究提出了基于模型的强化学习算法，旨在针对具有有界Eluder维度的一般函数类，提供非线性bandits和基于模型的节目式RL的统一PAC保证。",
    "en_tdlr": "This paper proposes model-based reinforcement learning algorithms aimed at providing the Uniform-PAC guarantee for both nonlinear bandits and model-based episodic RL with a general function class with a bounded eluder dimension."
}