{
    "title": "RMSSinger: Realistic-Music-Score based Singing Voice Synthesis. (arXiv:2305.10686v1 [cs.SD])",
    "abstract": "We are interested in a challenging task, Realistic-Music-Score based Singing Voice Synthesis (RMS-SVS). RMS-SVS aims to generate high-quality singing voices given realistic music scores with different note types (grace, slur, rest, etc.). Though significant progress has been achieved, recent singing voice synthesis (SVS) methods are limited to fine-grained music scores, which require a complicated data collection pipeline with time-consuming manual annotation to align music notes with phonemes. Furthermore, these manual annotation destroys the regularity of note durations in music scores, making fine-grained music scores inconvenient for composing. To tackle these challenges, we propose RMSSinger, the first RMS-SVS method, which takes realistic music scores as input, eliminating most of the tedious manual annotation and avoiding the aforementioned inconvenience. Note that music scores are based on words rather than phonemes, in RMSSinger, we introduce word-level modeling to avoid the t",
    "link": "http://arxiv.org/abs/2305.10686",
    "context": "Title: RMSSinger: Realistic-Music-Score based Singing Voice Synthesis. (arXiv:2305.10686v1 [cs.SD])\nAbstract: We are interested in a challenging task, Realistic-Music-Score based Singing Voice Synthesis (RMS-SVS). RMS-SVS aims to generate high-quality singing voices given realistic music scores with different note types (grace, slur, rest, etc.). Though significant progress has been achieved, recent singing voice synthesis (SVS) methods are limited to fine-grained music scores, which require a complicated data collection pipeline with time-consuming manual annotation to align music notes with phonemes. Furthermore, these manual annotation destroys the regularity of note durations in music scores, making fine-grained music scores inconvenient for composing. To tackle these challenges, we propose RMSSinger, the first RMS-SVS method, which takes realistic music scores as input, eliminating most of the tedious manual annotation and avoiding the aforementioned inconvenience. Note that music scores are based on words rather than phonemes, in RMSSinger, we introduce word-level modeling to avoid the t",
    "path": "papers/23/05/2305.10686.json",
    "total_tokens": 1013,
    "translated_title": "RMSSinger：基于真实乐谱的歌声合成",
    "translated_abstract": "我们关注一个有挑战性的任务：基于真实乐谱的歌声合成（RMS-SVS）。RMS-SVS旨在生成高质量的歌唱声音，给定具有不同音符类型（优美音符、连接音、休止符等）的真实乐谱。尽管取得了重大进展，但最近的歌声合成（SVS）方法仅适用于细粒度音乐乐谱，这需要一个复杂的数据收集管道，并需要耗费时间的手动标注来使音乐音符与音素对齐。此外，手动注释破坏了音乐乐谱中音符持续时间的规律性，使得细粒度音乐乐谱不便于作曲。为了解决这些难题，我们提出了RMSSinger，它是第一个RMS-SVS方法，它以真实乐谱作为输入，消除了大部分繁琐的手动标注并避免了上述不便。需要注意的是，乐谱是基于单词而非音素的，我们在RMSSinger中引入了单词级建模，以避免音素级建模所引起的转录误差。实验证明了我们的RMSSinger可以生成与人类歌唱者非常相似的歌唱声音，并且使用真实乐谱作为输入具有方便性和灵活性。",
    "tldr": "RMSSinger是基于真实乐谱的歌声合成，采用单词级建模避免了转录误差，方便且灵活。",
    "en_tdlr": "RMSSinger is a singing voice synthesis method that takes realistic music scores as input, using word-level modeling to avoid transcription errors, and bringing convenience and flexibility."
}