{
    "title": "Subject-based Non-contrastive Self-Supervised Learning for ECG Signal Processing. (arXiv:2305.10347v1 [eess.SP])",
    "abstract": "Extracting information from the electrocardiography (ECG) signal is an essential step in the design of digital health technologies in cardiology. In recent years, several machine learning (ML) algorithms for automatic extraction of information in ECG have been proposed. Supervised learning methods have successfully been used to identify specific aspects in the signal, like detection of rhythm disorders (arrhythmias). Self-supervised learning (SSL) methods, on the other hand, can be used to extract all the features contained in the data. The model is optimized without any specific goal and learns from the data itself. By adapting state-of-the-art computer vision methodologies to the signal processing domain, a few SSL approaches have been reported recently for ECG processing. However, such SSL methods require either data augmentation or negative pairs, which limits the method to only look for similarities between two ECG inputs, either two versions of the same signal or two signals from",
    "link": "http://arxiv.org/abs/2305.10347",
    "context": "Title: Subject-based Non-contrastive Self-Supervised Learning for ECG Signal Processing. (arXiv:2305.10347v1 [eess.SP])\nAbstract: Extracting information from the electrocardiography (ECG) signal is an essential step in the design of digital health technologies in cardiology. In recent years, several machine learning (ML) algorithms for automatic extraction of information in ECG have been proposed. Supervised learning methods have successfully been used to identify specific aspects in the signal, like detection of rhythm disorders (arrhythmias). Self-supervised learning (SSL) methods, on the other hand, can be used to extract all the features contained in the data. The model is optimized without any specific goal and learns from the data itself. By adapting state-of-the-art computer vision methodologies to the signal processing domain, a few SSL approaches have been reported recently for ECG processing. However, such SSL methods require either data augmentation or negative pairs, which limits the method to only look for similarities between two ECG inputs, either two versions of the same signal or two signals from",
    "path": "papers/23/05/2305.10347.json",
    "total_tokens": 1101,
    "translated_title": "基于受试者的无对照自监督学习用于心电信号处理",
    "translated_abstract": "从心电图（ECG）信号中提取信息是心脏病数字健康技术设计的关键步骤。近年来，已经提出了几种用于自动提取ECG信息的机器学习（ML）算法。监督学习方法已成功用于识别信号中的特定方面，如节律障碍（心律失常）的检测。另一方面，自监督学习（SSL）方法可用于提取数据中包含的所有特征。模型在没有特定目标的情况下进行优化，并从数据本身进行学习。通过将最先进的计算机视觉方法适应信号处理领域，最近报道了几种ECG处理的SSL方法。但是，这些SSL方法需要数据增强或负对，这限制了该方法仅查找两个ECG输入之间的相似之处，即同一信号的两个版本或来自不同患者的两个信号。在本文中，我们提出了一种基于受试者的非对照自监督学习方法，用于ECG信号处理，它不需要任何数据增强或负对。我们的方法旨在通过将ECG记录视为来自特定受试者的测量序列，而不是比较两个不同的信号来学习ECG信号的潜在结构。我们的实验结果表明，我们提出的方法在ECG处理中优于最先进的SSL方法。",
    "tldr": "本文提出了一种基于受试者的无对照自监督学习方法，用于心电信号处理，不需要数据增强或负对，并在ECG处理中实现了优于最先进SSL方法的表现。",
    "en_tdlr": "This paper proposes a subject-based non-contrastive self-supervised learning method for ECG signal processing, which does not require data augmentation or negative pairs and achieves better performance than state-of-the-art SSL methods in ECG processing."
}