{
    "title": "NatCS: Eliciting Natural Customer Support Dialogues. (arXiv:2305.03007v1 [cs.CL])",
    "abstract": "Despite growing interest in applications based on natural customer support conversations, there exist remarkably few publicly available datasets that reflect the expected characteristics of conversations in these settings. Existing task-oriented dialogue datasets, which were collected to benchmark dialogue systems mainly in written human-to-bot settings, are not representative of real customer support conversations and do not provide realistic benchmarks for systems that are applied to natural data. To address this gap, we introduce NatCS, a multi-domain collection of spoken customer service conversations. We describe our process for collecting synthetic conversations between customers and agents based on natural language phenomena observed in real conversations. Compared to previous dialogue datasets, the conversations collected with our approach are more representative of real human-to-human conversations along multiple metrics. Finally, we demonstrate potential uses of NatCS, includ",
    "link": "http://arxiv.org/abs/2305.03007",
    "context": "Title: NatCS: Eliciting Natural Customer Support Dialogues. (arXiv:2305.03007v1 [cs.CL])\nAbstract: Despite growing interest in applications based on natural customer support conversations, there exist remarkably few publicly available datasets that reflect the expected characteristics of conversations in these settings. Existing task-oriented dialogue datasets, which were collected to benchmark dialogue systems mainly in written human-to-bot settings, are not representative of real customer support conversations and do not provide realistic benchmarks for systems that are applied to natural data. To address this gap, we introduce NatCS, a multi-domain collection of spoken customer service conversations. We describe our process for collecting synthetic conversations between customers and agents based on natural language phenomena observed in real conversations. Compared to previous dialogue datasets, the conversations collected with our approach are more representative of real human-to-human conversations along multiple metrics. Finally, we demonstrate potential uses of NatCS, includ",
    "path": "papers/23/05/2305.03007.json",
    "total_tokens": 850,
    "translated_title": "NatCS: 引发自然客服对话",
    "translated_abstract": "尽管越来越多的应用程序基于自然的客户支持对话，但公开可用的数据集极少反映出这些环境中对话的预期特征。现有的面向任务的对话数据集，主要收集为基准对话系统，主要是在人与机器人之间的书面对话环境中，这些数据集并不代表真实的客户支持对话，也不能提供应用于自然数据的系统的现实基准。为了弥补这一差距，我们引入了NatCS，这是一个多领域的口语客户服务对话集。我们描述了我们采集人工合成对话的过程，这些对话是基于观察到的真实对话中的自然语言现象。与先前的对话数据集相比，我们采用这种方法收集的对话在多个指标上更能代表真实的人际对话。最后，我们展示了NatCS的潜在用途，包括...",
    "tldr": "该论文介绍了NatCS，这是一个多领域口头客户服务对话集。相对于先前的数据集，利用自然语言现象，NatCS更能代表真实人际对话，并提供比现有数据集更为现实的基准供面向自然客户支持对话系统的应用。",
    "en_tdlr": "This paper introduces NatCS, a multi-domain collection of spoken customer service conversations. Utilizing natural language phenomena, NatCS provides a more realistic benchmark for systems applied to natural data compared to previous datasets, and is more representative of real human-to-human conversations."
}