{
    "title": "Deep Neural Networks in Video Human Action Recognition: A Review. (arXiv:2305.15692v1 [cs.CV])",
    "abstract": "Currently, video behavior recognition is one of the most foundational tasks of computer vision. The 2D neural networks of deep learning are built for recognizing pixel-level information such as images with RGB, RGB-D, or optical flow formats, with the current increasingly wide usage of surveillance video and more tasks related to human action recognition. There are increasing tasks requiring temporal information for frames dependency analysis. The researchers have widely studied video-based recognition rather than image-based(pixel-based) only to extract more informative elements from geometry tasks. Our current related research addresses multiple novel proposed research works and compares their advantages and disadvantages between the derived deep learning frameworks rather than machine learning frameworks. The comparison happened between existing frameworks and datasets, which are video format data only. Due to the specific properties of human actions and the increasingly wide usage ",
    "link": "http://arxiv.org/abs/2305.15692",
    "context": "Title: Deep Neural Networks in Video Human Action Recognition: A Review. (arXiv:2305.15692v1 [cs.CV])\nAbstract: Currently, video behavior recognition is one of the most foundational tasks of computer vision. The 2D neural networks of deep learning are built for recognizing pixel-level information such as images with RGB, RGB-D, or optical flow formats, with the current increasingly wide usage of surveillance video and more tasks related to human action recognition. There are increasing tasks requiring temporal information for frames dependency analysis. The researchers have widely studied video-based recognition rather than image-based(pixel-based) only to extract more informative elements from geometry tasks. Our current related research addresses multiple novel proposed research works and compares their advantages and disadvantages between the derived deep learning frameworks rather than machine learning frameworks. The comparison happened between existing frameworks and datasets, which are video format data only. Due to the specific properties of human actions and the increasingly wide usage ",
    "path": "papers/23/05/2305.15692.json",
    "total_tokens": 815,
    "translated_title": "视频人体动作识别中的深度神经网络：一项综述",
    "translated_abstract": "目前，视频行为识别是计算机视觉中最基础的任务之一。深度学习的二维神经网络用于识别像RGB、RGB-D或光流格式这样的像素级信息的图像，随着监控视频的日益普及和更多与人体动作识别相关的任务的出现，需要考虑帧间信息分析。比起像素级信息，研究人员更多地研究基于视频的识别，从几何任务中提取更多信息。我们提出了多个新颖的研究工作，对这些派生的深度学习框架进行了比较，而不是与机器学习框架进行比较。比较发生在现有框架和仅为视频格式的数据集之间，特别是由于人体动作具有特殊性质，其使用越来越广泛。",
    "tldr": "本文综述了视频行为识别中深度神经网络的应用。与传统机器学习框架相比，该方法优势显著，具有更高的准确性和更广泛的应用性。",
    "en_tdlr": "This paper reviews the application of deep neural networks in video human action recognition. Compared to traditional machine learning frameworks, this method offers significant advantages in accuracy and wider applicability."
}