{
    "title": "Goodness of fit by Neyman-Pearson testing. (arXiv:2305.14137v1 [hep-ph])",
    "abstract": "The Neyman-Pearson strategy for hypothesis testing can be employed for goodness of fit if the alternative hypothesis $\\rm H_1$ is generic enough not to introduce a significant bias while at the same time avoiding overfitting. A practical implementation of this idea (dubbed NPLM) has been developed in the context of high energy physics, targeting the detection in collider data of new physical effects not foreseen by the Standard Model. In this paper we initiate a comparison of this methodology with other approaches to goodness of fit, and in particular with classifier-based strategies that share strong similarities with NPLM. NPLM emerges from our comparison as more sensitive to small departures of the data from the expected distribution and not biased towards detecting specific types of anomalies while being blind to others. These features make it more suited for agnostic searches for new physics at collider experiments. Its deployment in other contexts should be investigated.",
    "link": "http://arxiv.org/abs/2305.14137",
    "context": "Title: Goodness of fit by Neyman-Pearson testing. (arXiv:2305.14137v1 [hep-ph])\nAbstract: The Neyman-Pearson strategy for hypothesis testing can be employed for goodness of fit if the alternative hypothesis $\\rm H_1$ is generic enough not to introduce a significant bias while at the same time avoiding overfitting. A practical implementation of this idea (dubbed NPLM) has been developed in the context of high energy physics, targeting the detection in collider data of new physical effects not foreseen by the Standard Model. In this paper we initiate a comparison of this methodology with other approaches to goodness of fit, and in particular with classifier-based strategies that share strong similarities with NPLM. NPLM emerges from our comparison as more sensitive to small departures of the data from the expected distribution and not biased towards detecting specific types of anomalies while being blind to others. These features make it more suited for agnostic searches for new physics at collider experiments. Its deployment in other contexts should be investigated.",
    "path": "papers/23/05/2305.14137.json",
    "total_tokens": 834,
    "translated_title": "Neyman-Pearson检验的拟合优度研究",
    "translated_abstract": "当备选假设$H_1$足够通用，既不引入重大偏差又避免过度拟合时，Neyman-Pearson策略可以用于拟合优度检验。在高能物理的背景下，一种名为NPLM的实用实现已被开发，旨在探测标准模型未预料到的新物理效应，我们在本文中将该方法与其他拟合优度方法进行了比较。",
    "tldr": "本研究介绍了Neyman-Pearson检验在拟合优度研究中的应用，实现了一种名为NPLM的实用实现。和基于分类器方法相比，在探测到数据与期望分布的小偏差时，NPLM更灵敏且不会偏向任何类型的异常，比较适用于对撞机实验中对于新物理的不可知搜索。 future work 需要研究它在其他环境中的使用。",
    "en_tdlr": "This paper introduces the application of Neyman-Pearson testing in goodness of fit studies, with a practical implementation called NPLM that targets the detection of new physical effects beyond the Standard Model. Comparison with classifier-based methods shows that NPLM is more sensitive to small departures from expected distribution and unbiased towards specific types of anomalies, making it well-suited for agnostic searches for new physics in collider experiments."
}