{
    "title": "PGB: A PubMed Graph Benchmark for Heterogeneous Network Representation Learning. (arXiv:2305.02691v1 [cs.LG])",
    "abstract": "There has been a rapid growth in biomedical literature, yet capturing the heterogeneity of the bibliographic information of these articles remains relatively understudied. Although graph mining research via heterogeneous graph neural networks has taken center stage, it remains unclear whether these approaches capture the heterogeneity of the PubMed database, a vast digital repository containing over 33 million articles. We introduce PubMed Graph Benchmark (PGB), a new benchmark dataset for evaluating heterogeneous graph embeddings for biomedical literature. PGB is one of the largest heterogeneous networks to date and consists of 30 million English articles. The benchmark contains rich metadata including abstract, authors, citations, MeSH terms, MeSH hierarchy, and some other information. The benchmark contains an evaluation task of 21 systematic reviews topics from 3 different datasets. In PGB, we aggregate the metadata associated with the biomedical articles from PubMed into a unified",
    "link": "http://arxiv.org/abs/2305.02691",
    "context": "Title: PGB: A PubMed Graph Benchmark for Heterogeneous Network Representation Learning. (arXiv:2305.02691v1 [cs.LG])\nAbstract: There has been a rapid growth in biomedical literature, yet capturing the heterogeneity of the bibliographic information of these articles remains relatively understudied. Although graph mining research via heterogeneous graph neural networks has taken center stage, it remains unclear whether these approaches capture the heterogeneity of the PubMed database, a vast digital repository containing over 33 million articles. We introduce PubMed Graph Benchmark (PGB), a new benchmark dataset for evaluating heterogeneous graph embeddings for biomedical literature. PGB is one of the largest heterogeneous networks to date and consists of 30 million English articles. The benchmark contains rich metadata including abstract, authors, citations, MeSH terms, MeSH hierarchy, and some other information. The benchmark contains an evaluation task of 21 systematic reviews topics from 3 different datasets. In PGB, we aggregate the metadata associated with the biomedical articles from PubMed into a unified",
    "path": "papers/23/05/2305.02691.json",
    "total_tokens": 889,
    "translated_title": "PGB：用于异构网络表示学习的PubMed图数据集基准",
    "translated_abstract": "生物医学文献的数量快速增长，但是捕捉这些文章的文献信息的异质性仍然相对较少研究。尽管通过异构图神经网络的图挖掘研究已经成为研究热点，但它们是否捕捉到了PubMed数据库的异质性仍不清楚，而这是一个包含超过3300万篇文章的庞大数字资料库。我们介绍了PubMed Graph Benchmark（PGB），这是一个用于评估生物医学文献异构图嵌入的新的基准数据集。PGB是迄今为止最大的异构网络之一，包含3000万篇英文文章。该基准数据集包含丰富的元数据，包括摘要、作者、引用、MeSH术语、MeSH层次结构和其他一些信息。基准数据集包含来自3个不同数据集的21个系统性评价主题的评估任务。在PGB中，我们将与PubMed生物医学文章相关的元数据聚合成一致的。",
    "tldr": "介绍了一个基于PubMed数据库的PGB基准数据集，用于评估生物医学文献的异构图嵌入。该数据集包含丰富的元数据和来自不同数据集的21个系统性评价主题的评估任务。",
    "en_tdlr": "Introducing PGB, a new benchmark dataset based on the PubMed database for evaluating heterogeneous graph embeddings of biomedical literature, with rich metadata and an evaluation task of 21 systematic reviews topics from 3 different datasets."
}