{
    "title": "ReasonNet: End-to-End Driving with Temporal and Global Reasoning. (arXiv:2305.10507v1 [cs.CV])",
    "abstract": "The large-scale deployment of autonomous vehicles is yet to come, and one of the major remaining challenges lies in urban dense traffic scenarios. In such cases, it remains challenging to predict the future evolution of the scene and future behaviors of objects, and to deal with rare adverse events such as the sudden appearance of occluded objects. In this paper, we present ReasonNet, a novel end-to-end driving framework that extensively exploits both temporal and global information of the driving scene. By reasoning on the temporal behavior of objects, our method can effectively process the interactions and relationships among features in different frames. Reasoning about the global information of the scene can also improve overall perception performance and benefit the detection of adverse events, especially the anticipation of potential danger from occluded objects. For comprehensive evaluation on occlusion events, we also release publicly a driving simulation benchmark DriveOcclusi",
    "link": "http://arxiv.org/abs/2305.10507",
    "context": "Title: ReasonNet: End-to-End Driving with Temporal and Global Reasoning. (arXiv:2305.10507v1 [cs.CV])\nAbstract: The large-scale deployment of autonomous vehicles is yet to come, and one of the major remaining challenges lies in urban dense traffic scenarios. In such cases, it remains challenging to predict the future evolution of the scene and future behaviors of objects, and to deal with rare adverse events such as the sudden appearance of occluded objects. In this paper, we present ReasonNet, a novel end-to-end driving framework that extensively exploits both temporal and global information of the driving scene. By reasoning on the temporal behavior of objects, our method can effectively process the interactions and relationships among features in different frames. Reasoning about the global information of the scene can also improve overall perception performance and benefit the detection of adverse events, especially the anticipation of potential danger from occluded objects. For comprehensive evaluation on occlusion events, we also release publicly a driving simulation benchmark DriveOcclusi",
    "path": "papers/23/05/2305.10507.json",
    "total_tokens": 798,
    "translated_title": "ReasonNet: 具有时间和全局推理的端到端自动驾驶",
    "translated_abstract": "自动驾驶车辆的大规模部署尚未实现，其中一个主要的挑战在于城市密集交通场景下的预测和应对稀有不利事件。本文中，我们提出了 ReasonNet，一种新型的端到端驾驶框架，广泛利用驾驶场景的时间和全局信息。通过对物体的时间行为进行推理，我们的方法可以有效地处理不同帧中特征之间的相互作用和关系。推理场景的全局信息也可提高整体感知性能，并有益于检测不利事件，特别是对遮挡物的潜在危险的预测。为了全面评估遮挡事件，我们还公开发布了一个驾驶仿真基准测试 DriveOcclusion。",
    "tldr": "ReasonNet是一种全新的端到端自动驾驶框架，通过同时利用时间和全局信息，可以有效地处理城市密集交通场景下的稀有不利事件，如突然出现的遮挡物体。"
}