{
    "title": "Higher Order Gauge Equivariant CNNs on Riemannian Manifolds and Applications. (arXiv:2305.16657v1 [cs.CV])",
    "abstract": "With the advent of group equivariant convolutions in deep networks literature, spherical CNNs with $\\mathsf{SO}(3)$-equivariant layers have been developed to cope with data that are samples of signals on the sphere $S^2$. One can implicitly obtain $\\mathsf{SO}(3)$-equivariant convolutions on $S^2$ with significant efficiency gains by explicitly requiring gauge equivariance w.r.t. $\\mathsf{SO}(2)$. In this paper, we build on this fact by introducing a higher order generalization of the gauge equivariant convolution, whose implementation is dubbed a gauge equivariant Volterra network (GEVNet). This allows us to model spatially extended nonlinear interactions within a given receptive field while still maintaining equivariance to global isometries. We prove theoretical results regarding the equivariance and construction of higher order gauge equivariant convolutions. Then, we empirically demonstrate the parameter efficiency of our model, first on computer vision benchmark data (e.g. spheri",
    "link": "http://arxiv.org/abs/2305.16657",
    "context": "Title: Higher Order Gauge Equivariant CNNs on Riemannian Manifolds and Applications. (arXiv:2305.16657v1 [cs.CV])\nAbstract: With the advent of group equivariant convolutions in deep networks literature, spherical CNNs with $\\mathsf{SO}(3)$-equivariant layers have been developed to cope with data that are samples of signals on the sphere $S^2$. One can implicitly obtain $\\mathsf{SO}(3)$-equivariant convolutions on $S^2$ with significant efficiency gains by explicitly requiring gauge equivariance w.r.t. $\\mathsf{SO}(2)$. In this paper, we build on this fact by introducing a higher order generalization of the gauge equivariant convolution, whose implementation is dubbed a gauge equivariant Volterra network (GEVNet). This allows us to model spatially extended nonlinear interactions within a given receptive field while still maintaining equivariance to global isometries. We prove theoretical results regarding the equivariance and construction of higher order gauge equivariant convolutions. Then, we empirically demonstrate the parameter efficiency of our model, first on computer vision benchmark data (e.g. spheri",
    "path": "papers/23/05/2305.16657.json",
    "total_tokens": 956,
    "translated_title": "在黎曼流形上的高阶规范等变卷积神经网络及其应用",
    "translated_abstract": "随着深度网络文献中等变卷积的出现，已经开发了具有 $\\mathsf{SO}(3)$-等变层的球形 CNN 以处理在球形 $S^2$ 上的信号样本的数据。 通过显式要求相对于 $\\mathsf{SO}(2)$ 的规范等变性，可以在 $S^2$ 上隐式获得 $\\mathsf{SO}(3)$-等变卷积，并实现重大的效率提升。 本文在此基础上引入了规范等变卷积的高阶概括，其实现被称为规范等变的 Volterra 网络（GEVNet）。 这使得我们能够在保持对全局等度量的等变性的同时，在给定的感受域内建模空间扩展的非线性交互。 我们证明了关于等变性和高阶规范等变卷积构造的理论结果。然后，我们通过计算机视觉基准数据（例如球形 MNIST）以及在广告点击率预测的唯一真实数据集上的大规模工程实现，展示了我们的模型的参数效率。",
    "tldr": "本文介绍了一种在黎曼流形上的高阶规范等变卷积神经网络，能够在给定感受域内建模空间扩展的非线性交互，并保持对全局等度量的等变性。",
    "en_tdlr": "This paper introduces a higher order gauge equivariant convolution neural network on Riemannian manifolds, which can model spatially extended nonlinear interactions within a given receptive field, while still maintaining equivariance to global isometries."
}