{
    "title": "Imitation versus Innovation: What children can do that large language and language-and-vision models cannot (yet)?. (arXiv:2305.07666v1 [cs.AI])",
    "abstract": "Much discussion about large language models and language-and-vision models has focused on whether these models are intelligent agents. We present an alternative perspective. We argue that these artificial intelligence models are cultural technologies that enhance cultural transmission in the modern world, and are efficient imitation engines. We explore what AI models can tell us about imitation and innovation by evaluating their capacity to design new tools and discover novel causal structures, and contrast their responses with those of human children. Our work serves as a first step in determining which particular representations and competences, as well as which kinds of knowledge or skill, can be derived from particular learning techniques and data. Critically, our findings suggest that machines may need more than large scale language and images to achieve what a child can do.",
    "link": "http://arxiv.org/abs/2305.07666",
    "context": "Title: Imitation versus Innovation: What children can do that large language and language-and-vision models cannot (yet)?. (arXiv:2305.07666v1 [cs.AI])\nAbstract: Much discussion about large language models and language-and-vision models has focused on whether these models are intelligent agents. We present an alternative perspective. We argue that these artificial intelligence models are cultural technologies that enhance cultural transmission in the modern world, and are efficient imitation engines. We explore what AI models can tell us about imitation and innovation by evaluating their capacity to design new tools and discover novel causal structures, and contrast their responses with those of human children. Our work serves as a first step in determining which particular representations and competences, as well as which kinds of knowledge or skill, can be derived from particular learning techniques and data. Critically, our findings suggest that machines may need more than large scale language and images to achieve what a child can do.",
    "path": "papers/23/05/2305.07666.json",
    "total_tokens": 850,
    "translated_title": "模仿与创新：孩子们能做到的，大型语言模型和语言视觉模型尚不能做到的是什么？",
    "translated_abstract": "大型语言模型和语言视觉模型是否是智能体一直备受关注。本研究提供了一种替代视角，认为这些人工智能模型是在现代世界中增强文化传播的文化技术，是高效的模仿引擎。通过评估AI模型设计新工具和发现新的因果结构的能力，我们探讨了AI模型对模仿和创新的影响，并将其与人类儿童的反应进行对比。我们的工作是确定从特定的学习技术和数据中可推导出哪些特定表示和能力，以及哪些知识或技能的第一步。关键在于，我们的研究结果表明，机器可能需要更多的大规模语言和图像，才能达到一个孩子所能做到的水平。",
    "tldr": "本研究探讨了大型语言和语言视觉模型的局限性，以及机器与人类儿童在模仿和创新方面的不同表现。结果表明，机器需要更多的信息才能达到孩子所能做到的水平。",
    "en_tdlr": "This study explores the limitations of large language and language-and-vision models, and the differences between machine and human children in imitation and innovation. The results indicate that machines may need more information to achieve what a child can do."
}