{
    "title": "Alg{\\i}lanan Stres Testinin Makine \\\"O\\u{g}renmesi ile Analiz Edilmesi. (arXiv:2305.18473v1 [cs.LG])",
    "abstract": "The aim of this study is to reanalyze the perceived stress test using machine learning to determine the perceived stress levels of 150 individuals and measure the impact of the test questions. The test consists of 14 questions, each scored on a scale of 0 to 4, resulting in a total score range of 0-56. Out of these questions, 7 are formulated in a negative context and scored accordingly, while the remaining 7 are formulated in a positive context and scored in reverse. The test is also designed to identify two sub-factors: perceived self-efficacy and stress/discomfort perception. The main objectives of this research are to demonstrate that test questions may not have equal importance using artificial intelligence techniques, reveal which questions exhibit variations in the society using machine learning, and ultimately demonstrate the existence of distinct patterns observed psychologically. This study provides a different perspective from the existing psychology literature by repeating ",
    "link": "http://arxiv.org/abs/2305.18473",
    "context": "Title: Alg{\\i}lanan Stres Testinin Makine \\\"O\\u{g}renmesi ile Analiz Edilmesi. (arXiv:2305.18473v1 [cs.LG])\nAbstract: The aim of this study is to reanalyze the perceived stress test using machine learning to determine the perceived stress levels of 150 individuals and measure the impact of the test questions. The test consists of 14 questions, each scored on a scale of 0 to 4, resulting in a total score range of 0-56. Out of these questions, 7 are formulated in a negative context and scored accordingly, while the remaining 7 are formulated in a positive context and scored in reverse. The test is also designed to identify two sub-factors: perceived self-efficacy and stress/discomfort perception. The main objectives of this research are to demonstrate that test questions may not have equal importance using artificial intelligence techniques, reveal which questions exhibit variations in the society using machine learning, and ultimately demonstrate the existence of distinct patterns observed psychologically. This study provides a different perspective from the existing psychology literature by repeating ",
    "path": "papers/23/05/2305.18473.json",
    "total_tokens": 841,
    "translated_title": "用机器学习分析感知压力测试",
    "translated_abstract": "本研究旨在使用机器学习重新分析感知压力测试，以确定150个个体的感知压力水平并测量测试问题的影响。该测试包括14个问题，每个问题的得分范围为0到4，总得分范围为0-56。其中，7个问题以负面方式表述并相应评分，而其余7个问题以正面方式表述并按相反方式评分。该测试还设计为识别两个子因素：感知自我效能和压力/不适感知。本研究的主要目标是展示利用人工智能技术测试问题可能并不具有相等的重要性，揭示使用机器学习在社会中出现变化的问题，并最终证明在心理上观察到不同的模式存在。这项研究通过重复现有的心理学文献，提供了不同的视角。",
    "tldr": "本研究利用机器学习重新分析了感知压力测试，揭示了测试问题的重要性不相等，展示了在心理上观察到的不同模式。",
    "en_tdlr": "This study reanalyzed the perceived stress test using machine learning and demonstrated that the importance of test questions may not be equal. It also revealed variations of questions in society and proved the existence of distinct psychological patterns."
}