{
    "title": "Seeing double with a multifunctional reservoir computer. (arXiv:2305.05799v1 [math.DS])",
    "abstract": "Multifunctional biological neural networks exploit multistability in order to perform multiple tasks without changing any network properties. Enabling artificial neural networks (ANNs) to obtain certain multistabilities in order to perform several tasks, where each task is related to a particular attractor in the network's state space, naturally has many benefits from a machine learning perspective. Given the association to multistability, in this paper we explore how the relationship between different attractors influences the ability of a reservoir computer (RC), which is a dynamical system in the form of an ANN, to achieve multifunctionality. We construct the `seeing double' problem to systematically study how a RC reconstructs a coexistence of attractors when there is an overlap between them. As the amount of overlap increases, we discover that for multifunctionality to occur, there is a critical dependence on a suitable choice of the spectral radius for the RC's internal network c",
    "link": "http://arxiv.org/abs/2305.05799",
    "context": "Title: Seeing double with a multifunctional reservoir computer. (arXiv:2305.05799v1 [math.DS])\nAbstract: Multifunctional biological neural networks exploit multistability in order to perform multiple tasks without changing any network properties. Enabling artificial neural networks (ANNs) to obtain certain multistabilities in order to perform several tasks, where each task is related to a particular attractor in the network's state space, naturally has many benefits from a machine learning perspective. Given the association to multistability, in this paper we explore how the relationship between different attractors influences the ability of a reservoir computer (RC), which is a dynamical system in the form of an ANN, to achieve multifunctionality. We construct the `seeing double' problem to systematically study how a RC reconstructs a coexistence of attractors when there is an overlap between them. As the amount of overlap increases, we discover that for multifunctionality to occur, there is a critical dependence on a suitable choice of the spectral radius for the RC's internal network c",
    "path": "papers/23/05/2305.05799.json",
    "total_tokens": 874,
    "translated_title": "多功能储备计算机的双重视觉效应",
    "translated_abstract": "多功能生物神经网络利用多重稳定性以执行多种任务而不改变任何网络属性。使人工神经网络（ANN）获得某些多稳定性以执行多个任务，其中每个任务与网络状态空间中的特定吸引子相关联，从机器学习的角度自然具有许多优点。因为与多稳定性有关，本文探讨了不同吸引子之间的关系如何影响储备计算机（RC）的多功能性能力，储备计算机是一种以ANN形式呈现的动态系统。我们构建了“双重视觉效应”问题来系统地研究当两个吸引子之间存在重叠时RC如何重构吸引子的共存。随着重叠量的增加，我们发现要实现多功能性，需要RC内部网络c的谱半径合适选择的临界依赖性。",
    "tldr": "本文研究了储备计算机的多功能性能力，探讨了不同吸引子之间的关系如何影响其实现多任务。结果表明，要实现多功能性，需要RC内部网络c的谱半径合适选择的临界依赖性。",
    "en_tdlr": "This paper investigates the multifunctionality of reservoir computers and how the relationship between different attractors affects their ability to perform multiple tasks. The study finds that achieving multifunctionality relies on a critical dependence on a suitable choice of the spectral radius for the RC's internal network c."
}