{
    "title": "Evolving Tsukamoto Neuro Fuzzy Model for Multiclass Covid 19 Classification with Chest X Ray Images. (arXiv:2305.10421v1 [eess.IV])",
    "abstract": "Du e to rapid population growth and the need to use artificial intelligence to make quick decisions, developing a machine learning-based disease detection model and abnormality identification system has greatly improved the level of medical diagnosis Since COVID-19 has become one of the most severe diseases in the world, developing an automatic COVID-19 detection framework helps medical doctors in the diagnostic process of disease and provides correct and fast results. In this paper, we propose a machine lear ning based framework for the detection of Covid 19. The proposed model employs a Tsukamoto Neuro Fuzzy Inference network to identify and distinguish Covid 19 disease from normal and pneumonia cases. While the traditional training methods tune the parameters of the neuro-fuzzy model by gradient-based algorithms and recursive least square method, we use an evolutionary-based optimization, the Cat swarm algorithm to update the parameters. In addition, six texture features extracted f",
    "link": "http://arxiv.org/abs/2305.10421",
    "context": "Title: Evolving Tsukamoto Neuro Fuzzy Model for Multiclass Covid 19 Classification with Chest X Ray Images. (arXiv:2305.10421v1 [eess.IV])\nAbstract: Du e to rapid population growth and the need to use artificial intelligence to make quick decisions, developing a machine learning-based disease detection model and abnormality identification system has greatly improved the level of medical diagnosis Since COVID-19 has become one of the most severe diseases in the world, developing an automatic COVID-19 detection framework helps medical doctors in the diagnostic process of disease and provides correct and fast results. In this paper, we propose a machine lear ning based framework for the detection of Covid 19. The proposed model employs a Tsukamoto Neuro Fuzzy Inference network to identify and distinguish Covid 19 disease from normal and pneumonia cases. While the traditional training methods tune the parameters of the neuro-fuzzy model by gradient-based algorithms and recursive least square method, we use an evolutionary-based optimization, the Cat swarm algorithm to update the parameters. In addition, six texture features extracted f",
    "path": "papers/23/05/2305.10421.json",
    "total_tokens": 1051,
    "translated_title": "基于演化的Tsukamoto神经模糊模型在多类别Covid 19胸透图像分类中的应用",
    "translated_abstract": "随着人口的快速增长和运用人工智能作出快速决策的需求，开发基于机器学习的病症检测模型和异常识别系统已经极大地提高了医疗诊断水平。由于Covid-19已成为世界上最严重的疾病之一，开发自动的Covid-19检测框架有助于医生诊断疾病并快速提供正确的结果。在本文中，我们提出了一种基于机器学习的Covid 19检测框架。该模型使用Tsukamoto神经模糊推理网络来识别和区分Covid 19疾病和正常及肺炎病例。与传统的训练方法通过梯度下降算法和最小二乘法调整神经模糊模型的参数不同，我们使用基于演化的优化算法，即猫群算法来更新参数。此外，本研究结合了六个从胸透图像中提取的纹理特征以更好地检测疾病。我们的实验表明，相较于现有的模型，我们提出的模型在检测精度上有更高的准确性。",
    "tldr": "本研究提出了一种基于演化的Tsukamoto神经模糊模型，在六个从胸透图像中提取的纹理特征的帮助下，将Covid-19疾病从正常和肺炎病例中区分出来，并实验表明其检测精度高于现有模型。",
    "en_tdlr": "This paper proposes an evolutionary-based Tsukamoto neuro fuzzy model combined with six texture features extracted from chest X-ray images for multi-class detection of Covid-19, achieving higher accuracy compared to existing models."
}