{
    "title": "Semi-Supervised Federated Learning for Keyword Spotting. (arXiv:2305.05110v1 [cs.LG])",
    "abstract": "Keyword Spotting (KWS) is a critical aspect of audio-based applications on mobile devices and virtual assistants. Recent developments in Federated Learning (FL) have significantly expanded the ability to train machine learning models by utilizing the computational and private data resources of numerous distributed devices. However, existing FL methods typically require that devices possess accurate ground-truth labels, which can be both expensive and impractical when dealing with local audio data. In this study, we first demonstrate the effectiveness of Semi-Supervised Federated Learning (SSL) and FL for KWS. We then extend our investigation to Semi-Supervised Federated Learning (SSFL) for KWS, where devices possess completely unlabeled data, while the server has access to a small amount of labeled data. We perform numerical analyses using state-of-the-art SSL, FL, and SSFL techniques to demonstrate that the performance of KWS models can be significantly improved by leveraging the abun",
    "link": "http://arxiv.org/abs/2305.05110",
    "context": "Title: Semi-Supervised Federated Learning for Keyword Spotting. (arXiv:2305.05110v1 [cs.LG])\nAbstract: Keyword Spotting (KWS) is a critical aspect of audio-based applications on mobile devices and virtual assistants. Recent developments in Federated Learning (FL) have significantly expanded the ability to train machine learning models by utilizing the computational and private data resources of numerous distributed devices. However, existing FL methods typically require that devices possess accurate ground-truth labels, which can be both expensive and impractical when dealing with local audio data. In this study, we first demonstrate the effectiveness of Semi-Supervised Federated Learning (SSL) and FL for KWS. We then extend our investigation to Semi-Supervised Federated Learning (SSFL) for KWS, where devices possess completely unlabeled data, while the server has access to a small amount of labeled data. We perform numerical analyses using state-of-the-art SSL, FL, and SSFL techniques to demonstrate that the performance of KWS models can be significantly improved by leveraging the abun",
    "path": "papers/23/05/2305.05110.json",
    "total_tokens": 884,
    "translated_title": "基于半监督的联邦学习用于关键词检测",
    "translated_abstract": "关键词检测是移动设备和虚拟助手中音频应用的重要组成部分。联邦学习的最新发展显着扩展了利用多个分布式设备的计算和私有数据资源进行机器学习模型训练的能力。然而，现有的联邦学习方法通常要求设备具有准确的标签，而当涉及到本地音频数据时，这可能既昂贵又不实用。在本研究中，我们首先证明了半监督联邦学习和联邦学习在关键词检测中的有效性。然后，我们将调查扩展到半监督的联邦学习（SSFL）用于关键词检测，其中设备具有完全未标记的数据，而服务器可以访问少量标记数据。我们使用最先进的SSL、FL和SSFL技术进行数字分析，证明了利用丰富资源可以显著提高KWS模型的性能。",
    "tldr": "本研究证明了半监督联邦学习和联邦学习在关键词检测中的有效性。在使用少量标记数据的情况下，使用SSFL可以显著提高模型性能。",
    "en_tdlr": "This study demonstrates the effectiveness of semi-supervised and federated learning for keyword spotting. By utilizing the abundant resources, the performance of KWS models can be significantly improved through SSFL with a small amount of labeled data."
}