{
    "title": "Natural Language Decomposition and Interpretation of Complex Utterances. (arXiv:2305.08677v2 [cs.CL] UPDATED)",
    "abstract": "Designing natural language interfaces has historically required collecting supervised data to translate user requests into carefully designed intent representations. This requires enumerating and labeling a long tail of user requests, which is challenging. At the same time, large language models (LLMs) encode knowledge about goals and plans that can help conversational assistants interpret user requests requiring numerous steps to complete. We introduce an approach to handle complex-intent-bearing utterances from a user via a process of hierarchical natural language decomposition and interpretation. Our approach uses a pre-trained language model to decompose a complex utterance into a sequence of simpler natural language steps and interprets each step using the language-to-program model designed for the interface. To test our approach, we collect and release DeCU -- a new NL-to-program benchmark to evaluate Decomposition of Complex Utterances. Experiments show that the proposed approac",
    "link": "http://arxiv.org/abs/2305.08677",
    "context": "Title: Natural Language Decomposition and Interpretation of Complex Utterances. (arXiv:2305.08677v2 [cs.CL] UPDATED)\nAbstract: Designing natural language interfaces has historically required collecting supervised data to translate user requests into carefully designed intent representations. This requires enumerating and labeling a long tail of user requests, which is challenging. At the same time, large language models (LLMs) encode knowledge about goals and plans that can help conversational assistants interpret user requests requiring numerous steps to complete. We introduce an approach to handle complex-intent-bearing utterances from a user via a process of hierarchical natural language decomposition and interpretation. Our approach uses a pre-trained language model to decompose a complex utterance into a sequence of simpler natural language steps and interprets each step using the language-to-program model designed for the interface. To test our approach, we collect and release DeCU -- a new NL-to-program benchmark to evaluate Decomposition of Complex Utterances. Experiments show that the proposed approac",
    "path": "papers/23/05/2305.08677.json",
    "total_tokens": 857,
    "translated_title": "复杂话语的自然语言分解和解释",
    "translated_abstract": "设计自然语言界面在历史上一直需要收集监督数据，将用户请求转化为精心设计的意图表示。这需要列举和标记一系列用户请求，这是具有挑战性的。同时，大型语言模型(LLMs)编码有关目标和计划的知识，可以帮助对用户请求进行解释，需要完成许多步骤。我们引入了一种处理用户通过分层自然语言分解和解释过程产生的复杂意图话语的方法。我们的方法使用预训练的语言模型将复杂话语分解为一系列更简单的自然语言步骤，并使用为界面设计的语言到程序模型解释每个步骤。为了测试我们的方法，我们收集和发布了DeCU -- 一个新的用于评估复杂话语分解的自然语言到程序基准。实验证明了所提出的方法的有效性。",
    "tldr": "本论文提出了一种处理复杂意图话语的方法，通过分层自然语言分解和解释的过程将复杂话语分解为简单的自然语言步骤，并使用预训练的语言模型和语言到程序模型解释每个步骤。实验证明了该方法的有效性。",
    "en_tdlr": "This paper introduces an approach to handle complex-intent-bearing utterances by decomposing them into simpler natural language steps and interpreting each step using a pre-trained language model and a language-to-program model. Experimental results demonstrate the effectiveness of the proposed method."
}