{
    "title": "Statistical Estimation for Covariance Structures with Tail Estimates using Nodewise Quantile Predictive Regression Models. (arXiv:2305.11282v1 [econ.EM])",
    "abstract": "This paper considers the specification of covariance structures with tail estimates. We focus on two aspects: (i) the estimation of the VaR-CoVaR risk matrix in the case of larger number of time series observations than assets in a portfolio using quantile predictive regression models without assuming the presence of nonstationary regressors and; (ii) the construction of a novel variable selection algorithm, so-called, Feature Ordering by Centrality Exclusion (FOCE), which is based on an assumption-lean regression framework, has no tuning parameters and is proved to be consistent under general sparsity assumptions. We illustrate the usefulness of our proposed methodology with numerical studies of real and simulated datasets when modelling systemic risk in a network.",
    "link": "http://arxiv.org/abs/2305.11282",
    "context": "Title: Statistical Estimation for Covariance Structures with Tail Estimates using Nodewise Quantile Predictive Regression Models. (arXiv:2305.11282v1 [econ.EM])\nAbstract: This paper considers the specification of covariance structures with tail estimates. We focus on two aspects: (i) the estimation of the VaR-CoVaR risk matrix in the case of larger number of time series observations than assets in a portfolio using quantile predictive regression models without assuming the presence of nonstationary regressors and; (ii) the construction of a novel variable selection algorithm, so-called, Feature Ordering by Centrality Exclusion (FOCE), which is based on an assumption-lean regression framework, has no tuning parameters and is proved to be consistent under general sparsity assumptions. We illustrate the usefulness of our proposed methodology with numerical studies of real and simulated datasets when modelling systemic risk in a network.",
    "path": "papers/23/05/2305.11282.json",
    "total_tokens": 835,
    "translated_title": "基于节点分位数预测回归模型的尾部估计协方差结构统计估计方法",
    "translated_abstract": "本文探讨了具有尾部估计协方差结构的规范化。我们关注两个方面：（i）在不假设存在非平稳回归器的情况下，使用分位数预测回归模型估计具有大于投资组合资产数的时间序列观测值的VaR-CoVar风险矩阵；（ii）构建一种新的变量选择算法，称为Centrality Exclusion（FOCE）的特征排序，它基于一个无参数回归框架，没有调节参数，并被证明在一般稀疏性假设下是一致的。我们通过实际和模拟数据集的数字研究展示了我们提出的方法的有用性，用于建模网络中的系统风险。",
    "tldr": "本文探讨了具有尾部估计协方差结构的规范化，提出了一种基于节点分位数预测回归模型的协方差结构统计估计方法和一种无调参变量选择算法。这些方法在建模网络中的系统风险方面具有实际应用价值。",
    "en_tdlr": "This paper discusses the specification of covariance structures with tail estimates, proposes a statistical estimation method for covariance structures based on nodewise quantile predictive regression models, and introduces a variable selection algorithm without tuning parameters. These methods have practical applications in modeling systemic risk in a network."
}