{
    "title": "Measuring Surprise in the Wild. (arXiv:2305.07733v1 [cs.LG])",
    "abstract": "The quantitative measurement of how and when we experience surprise has mostly remained limited to laboratory studies, and its extension to naturalistic settings has been challenging. Here we demonstrate, for the first time, how computational models of surprise rooted in cognitive science and neuroscience combined with state-of-the-art machine learned generative models can be used to detect surprising human behavior in complex, dynamic environments like road traffic. In traffic safety, such models can support the identification of traffic conflicts, modeling of road user response time, and driving behavior evaluation for both human and autonomous drivers. We also present novel approaches to quantify surprise and use naturalistic driving scenarios to demonstrate a number of advantages over existing surprise measures from the literature. Modeling surprising behavior using learned generative models is a novel concept that can be generalized beyond traffic safety to any dynamic real-world ",
    "link": "http://arxiv.org/abs/2305.07733",
    "context": "Title: Measuring Surprise in the Wild. (arXiv:2305.07733v1 [cs.LG])\nAbstract: The quantitative measurement of how and when we experience surprise has mostly remained limited to laboratory studies, and its extension to naturalistic settings has been challenging. Here we demonstrate, for the first time, how computational models of surprise rooted in cognitive science and neuroscience combined with state-of-the-art machine learned generative models can be used to detect surprising human behavior in complex, dynamic environments like road traffic. In traffic safety, such models can support the identification of traffic conflicts, modeling of road user response time, and driving behavior evaluation for both human and autonomous drivers. We also present novel approaches to quantify surprise and use naturalistic driving scenarios to demonstrate a number of advantages over existing surprise measures from the literature. Modeling surprising behavior using learned generative models is a novel concept that can be generalized beyond traffic safety to any dynamic real-world ",
    "path": "papers/23/05/2305.07733.json",
    "total_tokens": 898,
    "translated_title": "野外惊奇度的测量",
    "translated_abstract": "关于惊奇是如何被体验的以及何时被体验的定量测量在大多数情况下仅限于实验室研究，并且扩展到自然环境下是极具挑战性的。本文首次展示了根植于认知科学和神经科学的惊奇计算模型与最先进的机器学习生成模型相结合，可以用来检测复杂动态环境中的惊奇人类行为，如道路交通。在交通安全方面，这样的模型可以支持交通冲突的识别，道路用户响应时间的建模以及人类和自动驾驶员行为评估。我们还提供了量化惊奇的新方法，并使用自然驾驶场景展示了相对于现有文献中的惊奇度的优势。使用学习生成模型来建模惊奇行为是一种新颖的概念，可推广到任何动态现实世界。",
    "tldr": "本文首次展示了如何将根植于认知科学和神经科学的惊奇计算模型与机器学习生成模型相结合，用于复杂动态环境中的惊奇行为检测，并可用于交通安全中的冲突识别和驾驶行为评估。",
    "en_tdlr": "This paper demonstrates for the first time how computational models of surprise rooted in cognitive science and neuroscience combined with machine learned generative models can be used to detect surprising human behavior in complex, dynamic environments like road traffic, and can support the identification of traffic conflicts, modeling of road user response time, and driving behavior evaluation for both human and autonomous drivers."
}