{
    "title": "A Unifying Framework of Attention-based Neural Load Forecasting. (arXiv:2305.05082v1 [cs.LG])",
    "abstract": "Accurate load forecasting is critical for reliable and efficient planning and operation of electric power grids. In this paper, we propose a unifying deep learning framework for load forecasting, which includes time-varying feature weighting, hierarchical temporal attention, and feature-reinforced error correction. Our framework adopts a modular design with good generalization capability. First, the feature-weighting mechanism assigns input features with temporal weights. Second, a recurrent encoder-decoder structure with hierarchical attention is developed as a load predictor. The hierarchical attention enables a similar day selection, which re-evaluates the importance of historical information at each time step. Third, we develop an error correction module that explores the errors and learned feature hidden information to further improve the model's forecasting performance. Experimental results demonstrate that our proposed framework outperforms existing methods on two public dataset",
    "link": "http://arxiv.org/abs/2305.05082",
    "context": "Title: A Unifying Framework of Attention-based Neural Load Forecasting. (arXiv:2305.05082v1 [cs.LG])\nAbstract: Accurate load forecasting is critical for reliable and efficient planning and operation of electric power grids. In this paper, we propose a unifying deep learning framework for load forecasting, which includes time-varying feature weighting, hierarchical temporal attention, and feature-reinforced error correction. Our framework adopts a modular design with good generalization capability. First, the feature-weighting mechanism assigns input features with temporal weights. Second, a recurrent encoder-decoder structure with hierarchical attention is developed as a load predictor. The hierarchical attention enables a similar day selection, which re-evaluates the importance of historical information at each time step. Third, we develop an error correction module that explores the errors and learned feature hidden information to further improve the model's forecasting performance. Experimental results demonstrate that our proposed framework outperforms existing methods on two public dataset",
    "path": "papers/23/05/2305.05082.json",
    "total_tokens": 867,
    "translated_title": "一种基于注意力机制的神经负载预测统一框架",
    "translated_abstract": "准确的负载预测对于电力网络的可靠和高效的规划和运营至关重要。本文提出了一种负载预测的统一深度学习框架，其中包括时变特征加权、分层时间注意力和特征增强误差修正。我们的框架采用模块化设计，具有良好的泛化能力。首先，特征加权机制将输入特征分配到不同的时间权重；其次，采用递归编码-解码结构和分层注意力进行负载预测，分层注意力能够进行相似日选择，以重新评估历史信息在每个时间步的重要性；第三，开发了一个误差修正模块，探索误差和学习特征隐藏信息以进一步提高模型的预测性能。实验结果表明，我们提出的框架在两个公共数据集上优于现有方法。",
    "tldr": "本文提出了一种基于注意力机制的神经负载预测统一框架，包括时变特征加权、分层时间注意力和特征增强误差修正等模块，取得了优秀的预测性能。",
    "en_tdlr": "This paper proposes a unifying deep learning framework for load forecasting, which includes time-varying feature weighting, hierarchical temporal attention, and feature-reinforced error correction. The framework has good generalization capability and outperforms existing methods on two public datasets."
}