{
    "title": "Spectal Harmonics: Bridging Spectral Embedding and Matrix Completion in Self-Supervised Learning. (arXiv:2305.19818v2 [cs.LG] UPDATED)",
    "abstract": "Self-supervised methods received tremendous attention thanks to their seemingly heuristic approach to learning representations that respect the semantics of the data without any apparent supervision in the form of labels. A growing body of literature is already being published in an attempt to build a coherent and theoretically grounded understanding of the workings of a zoo of losses used in modern self-supervised representation learning methods. In this paper, we attempt to provide an understanding from the perspective of a Laplace operator and connect the inductive bias stemming from the augmentation process to a low-rank matrix completion problem. To this end, we leverage the results from low-rank matrix completion to provide theoretical analysis on the convergence of modern SSL methods and a key property that affects their downstream performance.",
    "link": "http://arxiv.org/abs/2305.19818",
    "context": "Title: Spectal Harmonics: Bridging Spectral Embedding and Matrix Completion in Self-Supervised Learning. (arXiv:2305.19818v2 [cs.LG] UPDATED)\nAbstract: Self-supervised methods received tremendous attention thanks to their seemingly heuristic approach to learning representations that respect the semantics of the data without any apparent supervision in the form of labels. A growing body of literature is already being published in an attempt to build a coherent and theoretically grounded understanding of the workings of a zoo of losses used in modern self-supervised representation learning methods. In this paper, we attempt to provide an understanding from the perspective of a Laplace operator and connect the inductive bias stemming from the augmentation process to a low-rank matrix completion problem. To this end, we leverage the results from low-rank matrix completion to provide theoretical analysis on the convergence of modern SSL methods and a key property that affects their downstream performance.",
    "path": "papers/23/05/2305.19818.json",
    "total_tokens": 831,
    "translated_title": "光谱谐波：在自监督学习中连接谱嵌入和矩阵补全",
    "translated_abstract": "自监督方法由于其在学习表示时似乎启发式的方法，即在没有明显的标签监督的情况下尊重数据语义的学习表示方法，已经受到了广泛的关注。现在已经有了大量的文献发表，试图建立起对现代自监督学习方法中使用的一系列损失的连贯且理论上有根据的理解。在本文中，我们试图从拉普拉斯算子的角度提供一个理解，并将增广过程所产生的归纳偏置与低秩矩阵补全问题相连接。为此，我们利用低秩矩阵补全的结果，对现代自监督学习方法的收敛性以及影响其下游性能的一个关键属性进行了理论分析。",
    "tldr": "该论文通过从拉普拉斯算子的角度出发，将自监督学习方法中增广过程所产生的归纳偏置与低秩矩阵补全问题相联系，提供了对现代自监督学习方法收敛性和下游性能的理论分析。",
    "en_tdlr": "This paper provides a theoretical analysis of the convergence and downstream performance of modern self-supervised learning methods by connecting the inductive bias stemming from the augmentation process to a low-rank matrix completion problem from the perspective of a Laplace operator."
}