{
    "title": "Efficient Learning for Selecting Top-m Context-Dependent Designs. (arXiv:2305.04086v1 [stat.ML])",
    "abstract": "We consider a simulation optimization problem for a context-dependent decision-making, which aims to determine the top-m designs for all contexts. Under a Bayesian framework, we formulate the optimal dynamic sampling decision as a stochastic dynamic programming problem, and develop a sequential sampling policy to efficiently learn the performance of each design under each context. The asymptotically optimal sampling ratios are derived to attain the optimal large deviations rate of the worst-case of probability of false selection. The proposed sampling policy is proved to be consistent and its asymptotic sampling ratios are asymptotically optimal. Numerical experiments demonstrate that the proposed method improves the efficiency for selection of top-m context-dependent designs.",
    "link": "http://arxiv.org/abs/2305.04086",
    "context": "Title: Efficient Learning for Selecting Top-m Context-Dependent Designs. (arXiv:2305.04086v1 [stat.ML])\nAbstract: We consider a simulation optimization problem for a context-dependent decision-making, which aims to determine the top-m designs for all contexts. Under a Bayesian framework, we formulate the optimal dynamic sampling decision as a stochastic dynamic programming problem, and develop a sequential sampling policy to efficiently learn the performance of each design under each context. The asymptotically optimal sampling ratios are derived to attain the optimal large deviations rate of the worst-case of probability of false selection. The proposed sampling policy is proved to be consistent and its asymptotic sampling ratios are asymptotically optimal. Numerical experiments demonstrate that the proposed method improves the efficiency for selection of top-m context-dependent designs.",
    "path": "papers/23/05/2305.04086.json",
    "total_tokens": 742,
    "translated_title": "选择前m个上下文相关设计的高效学习",
    "translated_abstract": "我们考虑一个针对上下文相关决策的模拟优化问题，旨在确定所有上下文情境下的前m个设计。在贝叶斯框架下，我们将最优动态抽样决策制定为随机动态规划问题，并开发一种顺序抽样策略，以高效地学习每个上下文情境下每个设计的性能。导出了渐进最优抽样比例以实现选择误报概率的最坏情况的最优大偏差率。证明了所提出的抽样策略是一致的，并且其渐近抽样比率是渐近最优的。数字实验表明，所提出的方法改善了选择上下文相关设计的前m个的效率。",
    "tldr": "该论文采用贝叶斯框架下的随机动态规划方法，开发一种顺序抽样策略，提高了选择上下文相关设计的前m个的效率。",
    "en_tdlr": "This paper proposes a sequential sampling strategy based on a stochastic dynamic programming problem formulated under a Bayesian framework, to efficiently learn the performance of each design under each context, improving the efficiency for selecting the top-m context-dependent designs."
}