{
    "title": "DataChat: Prototyping a Conversational Agent for Dataset Search and Visualization. (arXiv:2305.18358v1 [cs.IR])",
    "abstract": "Data users need relevant context and research expertise to effectively search for and identify relevant datasets. Leading data providers, such as the Inter-university Consortium for Political and Social Research (ICPSR), offer standardized metadata and search tools to support data search. Metadata standards emphasize the machine-readability of data and its documentation. There are opportunities to enhance dataset search by improving users' ability to learn about, and make sense of, information about data. Prior research has shown that context and expertise are two main barriers users face in effectively searching for, evaluating, and deciding whether to reuse data. In this paper, we propose a novel chatbot-based search system, DataChat, that leverages a graph database and a large language model to provide novel ways for users to interact with and search for research data. DataChat complements data archives' and institutional repositories' ongoing efforts to curate, preserve, and share ",
    "link": "http://arxiv.org/abs/2305.18358",
    "context": "Title: DataChat: Prototyping a Conversational Agent for Dataset Search and Visualization. (arXiv:2305.18358v1 [cs.IR])\nAbstract: Data users need relevant context and research expertise to effectively search for and identify relevant datasets. Leading data providers, such as the Inter-university Consortium for Political and Social Research (ICPSR), offer standardized metadata and search tools to support data search. Metadata standards emphasize the machine-readability of data and its documentation. There are opportunities to enhance dataset search by improving users' ability to learn about, and make sense of, information about data. Prior research has shown that context and expertise are two main barriers users face in effectively searching for, evaluating, and deciding whether to reuse data. In this paper, we propose a novel chatbot-based search system, DataChat, that leverages a graph database and a large language model to provide novel ways for users to interact with and search for research data. DataChat complements data archives' and institutional repositories' ongoing efforts to curate, preserve, and share ",
    "path": "papers/23/05/2305.18358.json",
    "total_tokens": 667,
    "translated_title": "DataChat：一个用于数据集搜索和可视化的会话代理的原型设计。",
    "translated_abstract": "数据用户需要相关的上下文和研究专业知识以有效地搜索和识别相关数据集。众所周知，元数据和搜索工具是支持数据搜索的两个关键因素。在本文中，我们提出了一种新颖的基于聊天机器人的搜索系统 DataChat，它利用图数据库和大型语言模型为用户提供与研究数据交互和搜索的新颖方式。",
    "tldr": "DataChat是一个用于数据集搜索和可视化的聊天机器人，通过图数据库和语言模型为用户提供更加智能化的数据搜索体验。"
}