{
    "title": "Surveying Generative AI's Economic Expectations. (arXiv:2305.02823v1 [econ.GN])",
    "abstract": "I introduce a survey of economic expectations formed by querying a large language model (LLM)'s expectations of various financial and macroeconomic variables based on a sample of news articles from the Wall Street Journal between 1984 and 2021. I find the resulting expectations closely match existing surveys including the Survey of Professional Forecasters (SPF), the American Association of Individual Investors, and the Duke CFO Survey. Importantly, I document that LLM based expectations match many of the deviations from full-information rational expectations exhibited in these existing survey series. The LLM's macroeconomic expectations exhibit under-reaction commonly found in consensus SPF forecasts. Additionally, its return expectations are extrapolative, disconnected from objective measures of expected returns, and negatively correlated with future realized returns. Finally, using a sample of articles outside of the LLM's training period I find that the correlation with existing su",
    "link": "http://arxiv.org/abs/2305.02823",
    "context": "Title: Surveying Generative AI's Economic Expectations. (arXiv:2305.02823v1 [econ.GN])\nAbstract: I introduce a survey of economic expectations formed by querying a large language model (LLM)'s expectations of various financial and macroeconomic variables based on a sample of news articles from the Wall Street Journal between 1984 and 2021. I find the resulting expectations closely match existing surveys including the Survey of Professional Forecasters (SPF), the American Association of Individual Investors, and the Duke CFO Survey. Importantly, I document that LLM based expectations match many of the deviations from full-information rational expectations exhibited in these existing survey series. The LLM's macroeconomic expectations exhibit under-reaction commonly found in consensus SPF forecasts. Additionally, its return expectations are extrapolative, disconnected from objective measures of expected returns, and negatively correlated with future realized returns. Finally, using a sample of articles outside of the LLM's training period I find that the correlation with existing su",
    "path": "papers/23/05/2305.02823.json",
    "total_tokens": 970,
    "translated_title": "调查生成AI对经济预期的期望",
    "translated_abstract": "我通过查询1984年至2021年华尔街日报的新闻文章样本，介绍了一个经济预期调查，该调查查询了一个大型语言模型（LLM）对各种金融和宏观经济变量的预期。 我发现，由此产生的预期与现有调查（包括专业预测者调查（SPF）、美国个人投资者协会和杜克首席财务官调查）非常相似。重要的是，我记录了LLM基于模型的预期与现有调查系列中表现出的许多全信息理性预期偏差匹配。LLM的宏观经济预期表现出共识SPF预测中常见的低反应性。此外，其回报预期是外推的，脱离了预期回报的客观测量，与未来实现的回报呈负相关。最后，利用LLM培训期以外的文章样本，我发现与现有调查预期的相关性仍然强，这表明LLM模型的基础框架提供了一种有用的新方法来测量经济预期。",
    "tldr": "该论文介绍了一项经济预期调查，使用大型语言模型对各种金融和宏观经济变量的预期进行查询，发现LLM预期与现有调查相似，但也显示出许多偏离理性预期的特点，该调查方法为衡量经济预期提供了一种新方法。",
    "en_tdlr": "This paper introduces a survey of economic expectations using a large language model to query various financial and macroeconomic variables, finding that LLM expectations closely match existing surveys but also display several deviations from rational expectations. This novel approach provides a useful method for measuring economic expectations."
}