{
    "title": "GenSpectrum Chat: Data Exploration in Public Health Using Large Language Models. (arXiv:2305.13821v1 [q-bio.GN])",
    "abstract": "Introduction: The COVID-19 pandemic highlighted the importance of making epidemiological data and scientific insights easily accessible and explorable for public health agencies, the general public, and researchers. State-of-the-art approaches for sharing data and insights included regularly updated reports and web dashboards. However, they face a trade-off between the simplicity and flexibility of data exploration. With the capabilities of recent large language models (LLMs) such as GPT-4, this trade-off can be overcome.  Results: We developed the chatbot \"GenSpectrum Chat\" (https://cov-spectrum.org/chat) which uses GPT-4 as the underlying large language model (LLM) to explore SARS-CoV-2 genomic sequencing data. Out of 500 inputs from real-world users, the chatbot provided a correct answer for 453 prompts; an incorrect answer for 13 prompts, and no answer although the question was within scope for 34 prompts. We also tested the chatbot with inputs from 10 different languages, and desp",
    "link": "http://arxiv.org/abs/2305.13821",
    "context": "Title: GenSpectrum Chat: Data Exploration in Public Health Using Large Language Models. (arXiv:2305.13821v1 [q-bio.GN])\nAbstract: Introduction: The COVID-19 pandemic highlighted the importance of making epidemiological data and scientific insights easily accessible and explorable for public health agencies, the general public, and researchers. State-of-the-art approaches for sharing data and insights included regularly updated reports and web dashboards. However, they face a trade-off between the simplicity and flexibility of data exploration. With the capabilities of recent large language models (LLMs) such as GPT-4, this trade-off can be overcome.  Results: We developed the chatbot \"GenSpectrum Chat\" (https://cov-spectrum.org/chat) which uses GPT-4 as the underlying large language model (LLM) to explore SARS-CoV-2 genomic sequencing data. Out of 500 inputs from real-world users, the chatbot provided a correct answer for 453 prompts; an incorrect answer for 13 prompts, and no answer although the question was within scope for 34 prompts. We also tested the chatbot with inputs from 10 different languages, and desp",
    "path": "papers/23/05/2305.13821.json",
    "total_tokens": 1150,
    "translated_title": "GenSpectrum聊天机器人：利用大型语言模型进行公共卫生数据探索",
    "translated_abstract": "引言：COVID-19大流行凸显了使流行病学数据和科学见解易于公共卫生机构，一般大众和研究人员访问和探索的重要性。分享数据和见解的先进方法包括定期更新报告和Web仪表板。但它们面临数据探索简单性和灵活性之间的权衡。利用最近的大型语言模型（LLM）如GPT-4，可以克服这种权衡。结果：我们开发了聊天机器人“GenSpectrum Chat”（https://cov-spectrum.org/chat），它使用GPT-4作为基础LLM来探索SARS-CoV-2基因组测序数据。在来自真实用户的500个输入中，聊天机器人为453个提示提供了正确答案； 13个提示提供了错误答案，尽管34个提示的问题在范围内，但它没有提供答案。我们还测试了来自10种不同语言的输入，尽管GPT-4没有进行多语言处理，但它仍为某些查询提供了正确答案。聊天机器人允许用户通过简单的自然语言输入探索和可视化复杂的基因组数据，为公共卫生机构，研究人员和一般大众提供了一种更直观和可访问的方式来理解和分析与COVID-19相关的基因组数据。",
    "tldr": "GenSpectrum聊天机器人使用GPT-4作为LLM，允许用户通过简单的自然语言输入探索和可视化复杂的基因组数据，为公共卫生机构，研究人员和一般大众提供了一种更直观和可访问的方式来理解和分析与COVID-19相关的基因组数据。",
    "en_tdlr": "GenSpectrum Chatbot uses GPT-4 as LLM to allow users to explore and visualize complex genomic data via simple natural language inputs, providing a more intuitive and accessible way for public health agencies, researchers, and the general public to understand and analyze genomic data related to COVID-19."
}