{
    "title": "Investigating the Sensitivity of Automatic Speech Recognition Systems to Phonetic Variation in L2 Englishes. (arXiv:2305.07389v1 [cs.CL])",
    "abstract": "Automatic Speech Recognition (ASR) systems exhibit the best performance on speech that is similar to that on which it was trained. As such, underrepresented varieties including regional dialects, minority-speakers, and low-resource languages, see much higher word error rates (WERs) than those varieties seen as 'prestigious', 'mainstream', or 'standard'. This can act as a barrier to incorporating ASR technology into the annotation process for large-scale linguistic research since the manual correction of the erroneous automated transcripts can be just as time and resource consuming as manual transcriptions. A deeper understanding of the behaviour of an ASR system is thus beneficial from a speech technology standpoint, in terms of improving ASR accuracy, and from an annotation standpoint, where knowing the likely errors made by an ASR system can aid in this manual correction. This work demonstrates a method of probing an ASR system to discover how it handles phonetic variation across a n",
    "link": "http://arxiv.org/abs/2305.07389",
    "context": "Title: Investigating the Sensitivity of Automatic Speech Recognition Systems to Phonetic Variation in L2 Englishes. (arXiv:2305.07389v1 [cs.CL])\nAbstract: Automatic Speech Recognition (ASR) systems exhibit the best performance on speech that is similar to that on which it was trained. As such, underrepresented varieties including regional dialects, minority-speakers, and low-resource languages, see much higher word error rates (WERs) than those varieties seen as 'prestigious', 'mainstream', or 'standard'. This can act as a barrier to incorporating ASR technology into the annotation process for large-scale linguistic research since the manual correction of the erroneous automated transcripts can be just as time and resource consuming as manual transcriptions. A deeper understanding of the behaviour of an ASR system is thus beneficial from a speech technology standpoint, in terms of improving ASR accuracy, and from an annotation standpoint, where knowing the likely errors made by an ASR system can aid in this manual correction. This work demonstrates a method of probing an ASR system to discover how it handles phonetic variation across a n",
    "path": "papers/23/05/2305.07389.json",
    "total_tokens": 881,
    "translated_title": "探究自然语言处理语音识别系统对L2英语语音变体的敏感性",
    "translated_abstract": "自然语言处理的语音识别系统在能识别与其训练数据相似的语音时表现最佳。因此，地方方言、少数族裔使用英语和低资源语种等较为冷门的语言，与比较正统、主流或标准的语言相比出现更高的识别错误率。这成为将自然语言处理技术纳入大规模语言学研究的标注过程的障碍，因为手动纠正错误的自动化文本与手动转录同样需要时间和资源。因此，对自然语言处理系统的行为有更深层次的理解，无论是从语音技术角度出发，还是从标注角度出发，都有益于提高识别准确度或者为手动纠正提供线索。本文展示了一种探究自然语言处理系统的方法，以发现其如何处理一个较小语种中的语音变化。",
    "tldr": "本文旨在探索自然语言处理的语音识别系统对L2英语语音变体的敏感度，提高识别准确率和手动纠正的效率，为冷门语言的自然语言处理提供了新思路。",
    "en_tdlr": "This paper aims to explore the sensitivity of automatic speech recognition systems to phonetic variation in L2 Englishes, to improve recognition accuracy and manual correction efficiency, providing new insights for natural language processing of low-resource languages."
}