{
    "title": "A robust multi-domain network for short-scanning amyloid PET reconstruction. (arXiv:2305.09986v1 [eess.IV])",
    "abstract": "This paper presents a robust multi-domain network designed to restore low-quality amyloid PET images acquired in a short period of time. The proposed method is trained on pairs of PET images from short (2 minutes) and standard (20 minutes) scanning times, sourced from multiple domains. Learning relevant image features between these domains with a single network is challenging. Our key contribution is the introduction of a mapping label, which enables effective learning of specific representations between different domains. The network, trained with various mapping labels, can efficiently correct amyloid PET datasets in multiple training domains and unseen domains, such as those obtained with new radiotracers, acquisition protocols, or PET scanners. Internal, temporal, and external validations demonstrate the effectiveness of the proposed method. Notably, for external validation datasets from unseen domains, the proposed method achieved comparable or superior results relative to methods",
    "link": "http://arxiv.org/abs/2305.09986",
    "context": "Title: A robust multi-domain network for short-scanning amyloid PET reconstruction. (arXiv:2305.09986v1 [eess.IV])\nAbstract: This paper presents a robust multi-domain network designed to restore low-quality amyloid PET images acquired in a short period of time. The proposed method is trained on pairs of PET images from short (2 minutes) and standard (20 minutes) scanning times, sourced from multiple domains. Learning relevant image features between these domains with a single network is challenging. Our key contribution is the introduction of a mapping label, which enables effective learning of specific representations between different domains. The network, trained with various mapping labels, can efficiently correct amyloid PET datasets in multiple training domains and unseen domains, such as those obtained with new radiotracers, acquisition protocols, or PET scanners. Internal, temporal, and external validations demonstrate the effectiveness of the proposed method. Notably, for external validation datasets from unseen domains, the proposed method achieved comparable or superior results relative to methods",
    "path": "papers/23/05/2305.09986.json",
    "total_tokens": 1091,
    "translated_title": "鲁棒的多域网络用于短时间扫描淀粉样PET重建",
    "translated_abstract": "本论文介绍了一种鲁棒的多域网络，旨在恢复短时间内获取的低质量淀粉样PET图像。使用多个域中来自短（2分钟）和标准（20分钟）扫描时间的PET图像对来进行训练，并引入了映射标签进行有效学习。该网络可在多个训练域和未知域中高效校正淀粉样PET数据集。",
    "tldr": "本论文介绍了一种鲁棒的多域网络，旨在恢复短时间内获取的低质量淀粉样PET图像。网络的核心贡献在于引入了映射标签进行有效学习，使得该网络可在多个训练域和未知域中高效校正淀粉样PET数据集。",
    "en_tdlr": "This paper presents a robust multi-domain network designed to restore low-quality amyloid PET images acquired in a short period of time. The proposed method introduces mapping labels to enable effective learning and can efficiently correct PET datasets in multiple training domains and unseen domains."
}