{
    "title": "On the existence of solutions to adversarial training in multiclass classification. (arXiv:2305.00075v1 [cs.LG])",
    "abstract": "We study three models of the problem of adversarial training in multiclass classification designed to construct robust classifiers against adversarial perturbations of data in the agnostic-classifier setting. We prove the existence of Borel measurable robust classifiers in each model and provide a unified perspective of the adversarial training problem, expanding the connections with optimal transport initiated by the authors in previous work and developing new connections between adversarial training in the multiclass setting and total variation regularization. As a corollary of our results, we prove the existence of Borel measurable solutions to the agnostic adversarial training problem in the binary classification setting, a result that improves results in the literature of adversarial training, where robust classifiers were only known to exist within the enlarged universal $\\sigma$-algebra of the feature space.",
    "link": "http://arxiv.org/abs/2305.00075",
    "context": "Title: On the existence of solutions to adversarial training in multiclass classification. (arXiv:2305.00075v1 [cs.LG])\nAbstract: We study three models of the problem of adversarial training in multiclass classification designed to construct robust classifiers against adversarial perturbations of data in the agnostic-classifier setting. We prove the existence of Borel measurable robust classifiers in each model and provide a unified perspective of the adversarial training problem, expanding the connections with optimal transport initiated by the authors in previous work and developing new connections between adversarial training in the multiclass setting and total variation regularization. As a corollary of our results, we prove the existence of Borel measurable solutions to the agnostic adversarial training problem in the binary classification setting, a result that improves results in the literature of adversarial training, where robust classifiers were only known to exist within the enlarged universal $\\sigma$-algebra of the feature space.",
    "path": "papers/23/05/2305.00075.json",
    "total_tokens": 875,
    "translated_title": "多类分类中敌对训练解的存在性研究",
    "translated_abstract": "本文研究了敌对训练在多类分类问题中的三种模型，旨在构建对抗扰动下鲁棒的分类器。我们证明了每个模型中存在 Borel 可测的鲁棒分类器，并提供了敌对训练问题的统一视角，拓展了作者之前的最优传输联系，并在多类情况下敌对训练和总变差正则化之间建立了新的联系。作为我们结果的推论，我们证明了在二元分类设置中，对不可知分类器的敌对训练问题存在 Borel 可测的解，这一结果改进了关于敌对训练的文献，文献中仅已知只有在特征空间的扩大通用 $σ$-代数内存在鲁棒的分类器。",
    "tldr": "本文研究了多类分类中敌对训练的鲁棒解存在性问题，证明了每个模型中存在 Borel 可测的鲁棒分类器，并与最优传输和总变差正则化建立了联系。在二元分类问题中，对不可知分类器的敌对训练问题存在 Borel 可测的解。",
    "en_tdlr": "This paper studies the existence of robust solutions to adversarial training in multiclass classification and proves the existence of Borel measurable robust classifiers in each model. The paper also establishes new connections between adversarial training and optimal transport and total variation regularization, and improves existing results by proving the existence of Borel measurable solutions to the agnostic adversarial training problem in the binary classification setting."
}