{
    "title": "Leveraging Human Feedback to Evolve and Discover Novel Emergent Behaviors in Robot Swarms. (arXiv:2305.16148v2 [cs.MA] UPDATED)",
    "abstract": "Robot swarms often exhibit emergent behaviors that are fascinating to observe; however, it is often difficult to predict what swarm behaviors can emerge under a given set of agent capabilities. We seek to efficiently leverage human input to automatically discover a taxonomy of collective behaviors that can emerge from a particular multi-agent system, without requiring the human to know beforehand what behaviors are interesting or even possible. Our proposed approach adapts to user preferences by learning a similarity space over swarm collective behaviors using self-supervised learning and human-in-the-loop queries. We combine our learned similarity metric with novelty search and clustering to explore and categorize the space of possible swarm behaviors. We also propose several general-purpose heuristics that improve the efficiency of our novelty search by prioritizing robot controllers that are likely to lead to interesting emergent behaviors. We test our approach in simulation on two ",
    "link": "http://arxiv.org/abs/2305.16148",
    "context": "Title: Leveraging Human Feedback to Evolve and Discover Novel Emergent Behaviors in Robot Swarms. (arXiv:2305.16148v2 [cs.MA] UPDATED)\nAbstract: Robot swarms often exhibit emergent behaviors that are fascinating to observe; however, it is often difficult to predict what swarm behaviors can emerge under a given set of agent capabilities. We seek to efficiently leverage human input to automatically discover a taxonomy of collective behaviors that can emerge from a particular multi-agent system, without requiring the human to know beforehand what behaviors are interesting or even possible. Our proposed approach adapts to user preferences by learning a similarity space over swarm collective behaviors using self-supervised learning and human-in-the-loop queries. We combine our learned similarity metric with novelty search and clustering to explore and categorize the space of possible swarm behaviors. We also propose several general-purpose heuristics that improve the efficiency of our novelty search by prioritizing robot controllers that are likely to lead to interesting emergent behaviors. We test our approach in simulation on two ",
    "path": "papers/23/05/2305.16148.json",
    "total_tokens": 889,
    "translated_title": "利用人类反馈在机器人群体中发现新的 emergent behaviors",
    "translated_abstract": "机器人群体经常表现出令人着迷的 emergent behaviors，然而很难预测在特定的多智能体系统下会出现哪些群体行为。我们致力于通过有效地利用人类输入来自动发现可能产生的 collective behaviors 的分类法，而不需要人类事先知道哪些行为是有趣或可能的。我们提出的方法通过自监督学习和人机交互查询学习了一个群体行为的相似度空间，来适应用户的偏好。我们将学习到的相似度度量与新奇搜索和聚类相结合，探索并分类可能的群体行为空间。我们还提出了一些通用启发式的方法，通过优先考虑可能会产生有趣 emergent behaviors 的机器人控制器，提高了新奇搜索的效率。我们在两个仿真场景中测试了我们的方法。",
    "tldr": "该论文提出了一种利用人类反馈的方法来发现机器人群体中的新的 emergent behaviors。通过学习群体行为的相似性，结合新奇搜索和聚类技术，自动发现可能出现的群体行为，同时引入启发式方法提高搜索效率。该方法在仿真场景中进行了测试。",
    "en_tdlr": "This paper proposes a method that leverages human feedback to discover novel emergent behaviors in robot swarms. By learning the similarity of collective behaviors, combining novelty search and clustering, and introducing heuristics to improve search efficiency, the method automatically discovers possible swarm behaviors. The approach is tested in simulation scenarios."
}