{
    "title": "K-SpecPart: A Supervised Spectral Framework for Multi-Way Hypergraph Partitioning Solution Improvement. (arXiv:2305.06167v1 [cs.LG])",
    "abstract": "State-of-the-art hypergraph partitioners follow the multilevel paradigm, constructing multiple levels of coarser hypergraphs to drive cutsize refinement. These partitioners face limitations: (i) coarsening processes depend on local neighborhood structure, ignoring global hypergraph structure; (ii) refinement heuristics risk entrapment in local minima. We introduce K-SpecPart, a supervised spectral framework addressing these limitations by solving a generalized eigenvalue problem, capturing balanced partitioning objectives and global hypergraph structure in a low-dimensional vertex embedding while leveraging high-quality multilevel partitioning solutions as hints. In multi-way partitioning, K-SpecPart derives multiple bipartitioning solutions from a multi-way hint partitioning solution. It integrates these solutions into the generalized eigenvalue problem to compute eigenvectors, creating a large-dimensional embedding. Linear Discriminant Analysis (LDA) is used to transform this into a ",
    "link": "http://arxiv.org/abs/2305.06167",
    "context": "Title: K-SpecPart: A Supervised Spectral Framework for Multi-Way Hypergraph Partitioning Solution Improvement. (arXiv:2305.06167v1 [cs.LG])\nAbstract: State-of-the-art hypergraph partitioners follow the multilevel paradigm, constructing multiple levels of coarser hypergraphs to drive cutsize refinement. These partitioners face limitations: (i) coarsening processes depend on local neighborhood structure, ignoring global hypergraph structure; (ii) refinement heuristics risk entrapment in local minima. We introduce K-SpecPart, a supervised spectral framework addressing these limitations by solving a generalized eigenvalue problem, capturing balanced partitioning objectives and global hypergraph structure in a low-dimensional vertex embedding while leveraging high-quality multilevel partitioning solutions as hints. In multi-way partitioning, K-SpecPart derives multiple bipartitioning solutions from a multi-way hint partitioning solution. It integrates these solutions into the generalized eigenvalue problem to compute eigenvectors, creating a large-dimensional embedding. Linear Discriminant Analysis (LDA) is used to transform this into a ",
    "path": "papers/23/05/2305.06167.json",
    "total_tokens": 911,
    "translated_title": "K-SpecPart: 一种用于多元超图划分解决方案改进的监督谱框架",
    "translated_abstract": "现有的超图划分器采用多层次策略，构建多个更粗糙的超图来进行切割尺寸的优化，但存在一些局限性：（一）粗化过程依赖于局部邻域结构，忽略了全局超图结构；（二）优化启发式算法存在陷入局部最小值的风险。本文提出了一种新的监督谱框架——K-SpecPart，通过解决广义特征值问题解决了这些限制，捕捉了平衡分区目标和全局超图结构，并利用高质量的多层次划分方案作为提示。在多元划分的情况下，K-SpecPart从多元提示划分方案中获得多个双向划分方案。将这些方案整合到广义特征值问题中以计算特征向量，从而创建大维度嵌入。线性判别分析（LDA）用于将其转换为低维嵌入。",
    "tldr": "本论文提出了一个名为K-SpecPart的超图划分算法，通过解决广义特征值问题，捕捉平衡分区目标和全局超图结构，在多元划分中提高算法质量。",
    "en_tdlr": "This paper proposes a hypergraph partitioning algorithm called K-SpecPart, which solves a generalized eigenvalue problem to capture balanced partitioning objectives and global hypergraph structure, and improves the quality of algorithm in multi-way partitioning."
}