{
    "title": "Detecting Dataset Drift and Non-IID Sampling via k-Nearest Neighbors. (arXiv:2305.15696v1 [cs.LG])",
    "abstract": "We present a straightforward statistical test to detect certain violations of the assumption that the data are Independent and Identically Distributed (IID). The specific form of violation considered is common across real-world applications: whether the examples are ordered in the dataset such that almost adjacent examples tend to have more similar feature values (e.g. due to distributional drift, or attractive interactions between datapoints). Based on a k-Nearest Neighbors estimate, our approach can be used to audit any multivariate numeric data as well as other data types (image, text, audio, etc.) that can be numerically represented, perhaps with model embeddings. Compared with existing methods to detect drift or auto-correlation, our approach is both applicable to more types of data and also able to detect a wider variety of IID violations in practice. Code: https://github.com/cleanlab/cleanlab",
    "link": "http://arxiv.org/abs/2305.15696",
    "context": "Title: Detecting Dataset Drift and Non-IID Sampling via k-Nearest Neighbors. (arXiv:2305.15696v1 [cs.LG])\nAbstract: We present a straightforward statistical test to detect certain violations of the assumption that the data are Independent and Identically Distributed (IID). The specific form of violation considered is common across real-world applications: whether the examples are ordered in the dataset such that almost adjacent examples tend to have more similar feature values (e.g. due to distributional drift, or attractive interactions between datapoints). Based on a k-Nearest Neighbors estimate, our approach can be used to audit any multivariate numeric data as well as other data types (image, text, audio, etc.) that can be numerically represented, perhaps with model embeddings. Compared with existing methods to detect drift or auto-correlation, our approach is both applicable to more types of data and also able to detect a wider variety of IID violations in practice. Code: https://github.com/cleanlab/cleanlab",
    "path": "papers/23/05/2305.15696.json",
    "total_tokens": 832,
    "translated_title": "通过k最近邻来检测数据集漂移和非独立同分布采样",
    "translated_abstract": "我们提出了一种简单的统计测试方法来检测违反数据独立同分布（IID）假设的某些情况。我们考虑的具体违规形式在现实世界的应用中很常见：例如，示例在数据集中的排序方式导致几乎相邻的示例的特征值趋向相似（例如由于分布漂移或数据点之间的相互作用）。基于k最近邻估计，我们的方法可以用于审计任何多变量数值数据以及其他可以用数值表示的数据类型（图像、文本、音频等），也许可以使用模型嵌入表示。与现有的检测漂移或自相关性的方法相比，我们的方法既适用于更多类型的数据，又能够在实践中检测更广泛的IID违规行为。",
    "tldr": "该论文提出了一种简单的统计测试方法，可以检测现实应用中数据集漂移等违反数据独立同分布（IID）假设的情况。",
    "en_tdlr": "This paper presents a straightforward statistical test to detect violations of the assumption that the data are Independent and Identically Distributed (IID), which is common in real-world applications such as dataset drift. The approach is applicable to various types of data and can detect a wide variety of IID violations in practice."
}