{
    "title": "MParrotTTS: Multilingual Multi-speaker Text to Speech Synthesis in Low Resource Setting. (arXiv:2305.11926v1 [cs.SD])",
    "abstract": "We present MParrotTTS, a unified multilingual, multi-speaker text-to-speech (TTS) synthesis model that can produce high-quality speech. Benefiting from a modularized training paradigm exploiting self-supervised speech representations, MParrotTTS adapts to a new language with minimal supervised data and generalizes to languages not seen while training the self-supervised backbone. Moreover, without training on any bilingual or parallel examples, MParrotTTS can transfer voices across languages while preserving the speaker-specific characteristics, e.g., synthesizing fluent Hindi speech using a French speaker's voice and accent. We present extensive results on six languages in terms of speech naturalness and speaker similarity in parallel and cross-lingual synthesis. The proposed model outperforms the state-of-the-art multilingual TTS models and baselines, using only a small fraction of supervised training data. Speech samples from our model can be found at https://paper2438.github.io/tts",
    "link": "http://arxiv.org/abs/2305.11926",
    "context": "Title: MParrotTTS: Multilingual Multi-speaker Text to Speech Synthesis in Low Resource Setting. (arXiv:2305.11926v1 [cs.SD])\nAbstract: We present MParrotTTS, a unified multilingual, multi-speaker text-to-speech (TTS) synthesis model that can produce high-quality speech. Benefiting from a modularized training paradigm exploiting self-supervised speech representations, MParrotTTS adapts to a new language with minimal supervised data and generalizes to languages not seen while training the self-supervised backbone. Moreover, without training on any bilingual or parallel examples, MParrotTTS can transfer voices across languages while preserving the speaker-specific characteristics, e.g., synthesizing fluent Hindi speech using a French speaker's voice and accent. We present extensive results on six languages in terms of speech naturalness and speaker similarity in parallel and cross-lingual synthesis. The proposed model outperforms the state-of-the-art multilingual TTS models and baselines, using only a small fraction of supervised training data. Speech samples from our model can be found at https://paper2438.github.io/tts",
    "path": "papers/23/05/2305.11926.json",
    "total_tokens": 967,
    "translated_title": "MParrotTTS：低资源环境下的多语言多说话人文本转语音合成",
    "translated_abstract": "我们介绍了MParrotTTS，这是一个统一的多语言、多说话人文本转语音(TTS)合成模型，可以产生高质量的语音。MParrotTTS受益于模块化培训范式，利用自监督语音表示，以最小的监督数据适应于新语言，并在训练自监督后骨干中对未见过的语言进行泛化。此外，MParrotTTS不需要任何双语或平行示例的训练，可以在语音中传递语音，同时保留说话人的特定特征，例如使用法语演讲者的声音和口音合成流利的印地语语音。我们在六种语言上提出了广泛的结果，包括并行和跨语言综合的语音自然度和说话人相似度。所提出的模型在只使用少量监督训练数据的情况下，优于最先进的多语言TTS模型和基线。我们的模型可在https://paper2438.github.io/tts上找到。",
    "tldr": "MParrotTTS是一个统一的多语言、多说话人文本转语音合成模型，以自监督语音表示为基础；它可以在低资源环境中仅使用少量有监督数据就适应于新语言，并在不需要平行或双语语料的情况下传递说话人特定的语音特征。",
    "en_tdlr": "MParrotTTS is a unified multilingual, multi-speaker text-to-speech synthesis model based on self-supervised speech representations. It can adapt to new languages in low resource settings with minimal supervised data and transfer speaker-specific characteristics across languages without the need for parallel or bilingual data."
}