{
    "title": "MacLaSa: Multi-Aspect Controllable Text Generation via Efficient Sampling from Compact Latent Space. (arXiv:2305.12785v2 [cs.CL] UPDATED)",
    "abstract": "Multi-aspect controllable text generation aims to generate fluent sentences that possess multiple desired attributes simultaneously. Traditional methods either combine many operators in the decoding stage, often with costly iteration or search in the discrete text space, or train separate controllers for each aspect, resulting in a degeneration of text quality due to the discrepancy between different aspects. To address these limitations, we introduce a novel approach for multi-aspect control, namely MacLaSa, that estimates compact latent space for multiple aspects and performs efficient sampling with a robust sampler based on ordinary differential equations (ODEs). To eliminate the domain gaps between different aspects, we utilize a Variational Autoencoder (VAE) network to map text sequences from varying data sources into close latent representations. The estimated latent space enables the formulation of joint energy-based models (EBMs) and the plugging in of arbitrary attribute discr",
    "link": "http://arxiv.org/abs/2305.12785",
    "context": "Title: MacLaSa: Multi-Aspect Controllable Text Generation via Efficient Sampling from Compact Latent Space. (arXiv:2305.12785v2 [cs.CL] UPDATED)\nAbstract: Multi-aspect controllable text generation aims to generate fluent sentences that possess multiple desired attributes simultaneously. Traditional methods either combine many operators in the decoding stage, often with costly iteration or search in the discrete text space, or train separate controllers for each aspect, resulting in a degeneration of text quality due to the discrepancy between different aspects. To address these limitations, we introduce a novel approach for multi-aspect control, namely MacLaSa, that estimates compact latent space for multiple aspects and performs efficient sampling with a robust sampler based on ordinary differential equations (ODEs). To eliminate the domain gaps between different aspects, we utilize a Variational Autoencoder (VAE) network to map text sequences from varying data sources into close latent representations. The estimated latent space enables the formulation of joint energy-based models (EBMs) and the plugging in of arbitrary attribute discr",
    "path": "papers/23/05/2305.12785.json",
    "total_tokens": 1005,
    "translated_title": "MacLaSa: 通过从紧致潜在空间中的高效采样实现多方面可控的文本生成",
    "translated_abstract": "多方面可控的文本生成旨在生成同时具有多个期望属性的流畅句子。传统方法要么在解码阶段结合多个操作符，通常在离散文本空间中进行昂贵的迭代或搜索，要么为每个方面单独训练控制器，由于不同方面之间的差异而导致文本质量的退化。为了解决这些限制，我们引入了一种新的多方面控制方法，称为MacLaSa，它通过估计多个方面的紧致潜在空间，并利用基于常微分方程（ODEs）的鲁棒采样器进行高效采样。为了消除不同方面之间的域差距，我们利用变分自动编码器（VAE）网络将来自不同数据源的文本序列映射到接近的潜在表示。估计的潜在空间使得能够制定联合能量模型（EBMs）并插入任意属性鉴别器。",
    "tldr": "MacLaSa是一种通过从紧致潜在空间中高效采样的方法，实现多方面可控的文本生成。它通过估计紧致潜在空间和使用基于ODE的鲁棒采样器来有效生成具有多个期望属性的句子。利用变分自动编码器网络来消除不同方面之间的域差距，并能够制定联合能量模型和插入任意属性鉴别器。",
    "en_tdlr": "MacLaSa is an approach for multi-aspect controllable text generation that achieves efficient sampling from a compact latent space. It estimates the latent space for multiple aspects and uses a robust sampler based on ordinary differential equations (ODEs) to generate sentences with multiple desired attributes. It utilizes a Variational Autoencoder network to eliminate domain gaps between different aspects and enables the formulation of joint energy-based models and the integration of arbitrary attribute discriminators."
}