{
    "title": "Cross Encoding as Augmentation: Towards Effective Educational Text Classification. (arXiv:2305.18977v2 [cs.CL] UPDATED)",
    "abstract": "Text classification in education, usually called auto-tagging, is the automated process of assigning relevant tags to educational content, such as questions and textbooks. However, auto-tagging suffers from a data scarcity problem, which stems from two major challenges: 1) it possesses a large tag space and 2) it is multi-label. Though a retrieval approach is reportedly good at low-resource scenarios, there have been fewer efforts to directly address the data scarcity problem. To mitigate these issues, here we propose a novel retrieval approach CEAA that provides effective learning in educational text classification. Our main contributions are as follows: 1) we leverage transfer learning from question-answering datasets, and 2) we propose a simple but effective data augmentation method introducing cross-encoder style texts to a bi-encoder architecture for more efficient inference. An extensive set of experiments shows that our proposed method is effective in multi-label scenarios and l",
    "link": "http://arxiv.org/abs/2305.18977",
    "context": "Title: Cross Encoding as Augmentation: Towards Effective Educational Text Classification. (arXiv:2305.18977v2 [cs.CL] UPDATED)\nAbstract: Text classification in education, usually called auto-tagging, is the automated process of assigning relevant tags to educational content, such as questions and textbooks. However, auto-tagging suffers from a data scarcity problem, which stems from two major challenges: 1) it possesses a large tag space and 2) it is multi-label. Though a retrieval approach is reportedly good at low-resource scenarios, there have been fewer efforts to directly address the data scarcity problem. To mitigate these issues, here we propose a novel retrieval approach CEAA that provides effective learning in educational text classification. Our main contributions are as follows: 1) we leverage transfer learning from question-answering datasets, and 2) we propose a simple but effective data augmentation method introducing cross-encoder style texts to a bi-encoder architecture for more efficient inference. An extensive set of experiments shows that our proposed method is effective in multi-label scenarios and l",
    "path": "papers/23/05/2305.18977.json",
    "total_tokens": 892,
    "translated_title": "交叉编码作为数据增强方法：实现有效的教育文本分类",
    "translated_abstract": "教育文本分类，通常称为自动标记，是将相关标记自动分配给教育内容（如问题和教科书）的自动化过程。然而，自动标记面临着数据稀缺问题，这源于两个主要挑战：1）它具有大的标记空间；2）它是多标签的。尽管检索方法在低资源情况下表现良好，但在直接解决数据稀缺问题方面的努力较少。为了缓解这些问题，我们提出了一种新颖的检索方法CEAA，为教育文本分类提供有效的学习。我们的主要贡献如下：1）我们利用来自问答数据集的迁移学习；2）我们提出了一种简单但有效的数据增强方法，将交叉编码风格的文本引入到双编码器架构中，以实现更高效的推理。大量实验证明我们的方法在多标签场景和低资源情况下都十分有效。",
    "tldr": "本文提出了一种新颖的检索方法CEAA，将交叉编码作为数据增强方法应用在教育文本分类中，能够解决教育文本分类中的数据稀缺问题，有效提高分类精度。",
    "en_tdlr": "This paper proposes a novel retrieval approach CEAA that introduces cross-encoder style texts via data augmentation to a bi-encoder architecture, which effectively mitigates the data scarcity problem in educational text classification and improves the accuracy of multi-label classification."
}