{
    "title": "The optimal reinsurance strategy with price-competition between two reinsurers. (arXiv:2305.00509v1 [q-fin.MF])",
    "abstract": "We study optimal reinsurance in the framework of stochastic game theory, in which there is an insurer and two reinsurers. A Stackelberg model is established to analyze the non-cooperative relationship between the insurer and reinsurers, where the insurer is considered as the follower and the reinsurers are considered as the leaders. The insurer is a price taker who determines reinsurance demand in the reinsurance market, while the reinsurers can price the reinsurance treaties. Our contribution is to use a Nash game to describe the price-competition between two reinsurers. We assume that one of the reinsurers adopts the variance premium principle and the other adopts the expected value premium principle. The insurer and the reinsurers aim to maximize their respective mean-variance cost functions which lead to a time-inconsistency control problem. To overcome the time-inconsistency issue in the game, we formulate the optimization problem of each player as an embedded game and solve it vi",
    "link": "http://arxiv.org/abs/2305.00509",
    "context": "Title: The optimal reinsurance strategy with price-competition between two reinsurers. (arXiv:2305.00509v1 [q-fin.MF])\nAbstract: We study optimal reinsurance in the framework of stochastic game theory, in which there is an insurer and two reinsurers. A Stackelberg model is established to analyze the non-cooperative relationship between the insurer and reinsurers, where the insurer is considered as the follower and the reinsurers are considered as the leaders. The insurer is a price taker who determines reinsurance demand in the reinsurance market, while the reinsurers can price the reinsurance treaties. Our contribution is to use a Nash game to describe the price-competition between two reinsurers. We assume that one of the reinsurers adopts the variance premium principle and the other adopts the expected value premium principle. The insurer and the reinsurers aim to maximize their respective mean-variance cost functions which lead to a time-inconsistency control problem. To overcome the time-inconsistency issue in the game, we formulate the optimization problem of each player as an embedded game and solve it vi",
    "path": "papers/23/05/2305.00509.json",
    "total_tokens": 934,
    "translated_title": "带有两家再保险商价格竞争的最优再保险策略研究",
    "translated_abstract": "本文利用随机博弈模型研究了一个包括一个保险商和两家再保险商的最优再保险问题。建立了Stackelberg模型分析保险商和两家再保险商之间的非合作关系，其中保险商被视为追随者，两家再保险商被视为领导者。保险商决定再保险需求，再保险商可以制定再保险协议价格。本研究的贡献在于使用纳什博弈描述两家再保险商的价格竞争。一家再保险商采用方差保费原则，另一家采用期望值保费原则。保险商和再保险商的目标是分别最大化各自的均值-方差成本函数，从而导致时间不一致的控制问题。为了克服游戏中的时间不一致性问题，将每个玩家的优化问题作为一个嵌入式游戏进行了建模解决。",
    "tldr": "论文研究了一个保险商和两家再保险商之间利润最大化的非合作关系，提出将价格竞争建模为纳什博弈，模型的解决有助于解决保险市场中时间不一致性的控制问题。",
    "en_tdlr": "This paper explores the optimal reinsurance problem of an insurer and two reinsurers, and introduces the modeling of price competition between two reinsurers as a Nash game. The solution of the model helps to address the issue of time inconsistency control in the insurance market."
}