{
    "title": "Expressive Mortality Models through Gaussian Process Kernels. (arXiv:2305.01728v1 [stat.ML])",
    "abstract": "We develop a flexible Gaussian Process (GP) framework for learning the covariance structure of Age- and Year-specific mortality surfaces. Utilizing the additive and multiplicative structure of GP kernels, we design a genetic programming algorithm to search for the most expressive kernel for a given population. Our compositional search builds off the Age-Period-Cohort (APC) paradigm to construct a covariance prior best matching the spatio-temporal dynamics of a mortality dataset. We apply the resulting genetic algorithm (GA) on synthetic case studies to validate the ability of the GA to recover APC structure, and on real-life national-level datasets from the Human Mortality Database. Our machine-learning based analysis provides novel insight into the presence/absence of Cohort effects in different populations, and into the relative smoothness of mortality surfaces along the Age and Year dimensions. Our modelling work is done with the PyTorch libraries in Python and provides an in-depth ",
    "link": "http://arxiv.org/abs/2305.01728",
    "context": "Title: Expressive Mortality Models through Gaussian Process Kernels. (arXiv:2305.01728v1 [stat.ML])\nAbstract: We develop a flexible Gaussian Process (GP) framework for learning the covariance structure of Age- and Year-specific mortality surfaces. Utilizing the additive and multiplicative structure of GP kernels, we design a genetic programming algorithm to search for the most expressive kernel for a given population. Our compositional search builds off the Age-Period-Cohort (APC) paradigm to construct a covariance prior best matching the spatio-temporal dynamics of a mortality dataset. We apply the resulting genetic algorithm (GA) on synthetic case studies to validate the ability of the GA to recover APC structure, and on real-life national-level datasets from the Human Mortality Database. Our machine-learning based analysis provides novel insight into the presence/absence of Cohort effects in different populations, and into the relative smoothness of mortality surfaces along the Age and Year dimensions. Our modelling work is done with the PyTorch libraries in Python and provides an in-depth ",
    "path": "papers/23/05/2305.01728.json",
    "total_tokens": 960,
    "translated_title": "通过高斯过程核表达寿命模型的灵活性",
    "translated_abstract": "我们开发了一个灵活的高斯过程（GP）框架，用于学习年龄和年份特定的死亡率曲面的协方差结构。利用GP核的加法和乘法结构，我们设计一个遗传编程算法来搜索针对给定人群的最具表现力的核。我们的组合搜索基于年龄-期间-队列（APC）范例，以构建最能匹配死亡率数据集的时空动态的协方差先验。我们在合成案例研究中应用得到的遗传算法（GA）来验证GA恢复APC结构的能力，并在人类死亡数据库的实际国家级数据集上进行分析。我们的机器学习分析提供了有关不同人群中队列效应存在或不存在的新见解，以及沿年龄和年份维度的死亡率曲面的相对平滑程度。我们的建模工作是在Python的PyTorch库中完成的，提供了深入的分析。",
    "tldr": "本研究基于高斯过程框架，利用核函数的加法和乘法结构设计了一个遗传编程算法，能够学习特定人群的年龄和年份特定的死亡率曲面，为不同人群中队列效应的存在性带来了新的见解，并提供了相对平滑程度的分析工作。",
    "en_tdlr": "This research utilizes the Gaussian Process framework and develops a genetic programming algorithm based on the additive and multiplicative structure of kernel functions, which can effectively learn the Age- and Year-specific mortality surfaces of a given population. The study provides novel insights into the existence or absence of Cohort effects in different populations and offers analysis on the relative smoothness of mortality surfaces along the Age and Year dimensions."
}