{
    "title": "A semi-automatic method for document classification in the shipping industry. (arXiv:2305.06148v1 [cs.CL])",
    "abstract": "In the shipping industry, document classification plays a crucial role in ensuring that the necessary documents are properly identified and processed for customs clearance. OCR technology is being used to automate the process of document classification, which involves identifying important documents such as Commercial Invoices, Packing Lists, Export/Import Customs Declarations, Bills of Lading, Sea Waybills, Certificates, Air or Rail Waybills, Arrival Notices, Certificate of Origin, Importer Security Filings, and Letters of Credit. By using OCR technology, the shipping industry can improve accuracy and efficiency in document classification and streamline the customs clearance process. The aim of this study is to build a robust document classification system based on keyword frequencies. The research is carried out by analyzing Contract-Breach law documents available with IN-D. The documents were collected by scraping the Singapore Government Judiciary website. The database developed ha",
    "link": "http://arxiv.org/abs/2305.06148",
    "context": "Title: A semi-automatic method for document classification in the shipping industry. (arXiv:2305.06148v1 [cs.CL])\nAbstract: In the shipping industry, document classification plays a crucial role in ensuring that the necessary documents are properly identified and processed for customs clearance. OCR technology is being used to automate the process of document classification, which involves identifying important documents such as Commercial Invoices, Packing Lists, Export/Import Customs Declarations, Bills of Lading, Sea Waybills, Certificates, Air or Rail Waybills, Arrival Notices, Certificate of Origin, Importer Security Filings, and Letters of Credit. By using OCR technology, the shipping industry can improve accuracy and efficiency in document classification and streamline the customs clearance process. The aim of this study is to build a robust document classification system based on keyword frequencies. The research is carried out by analyzing Contract-Breach law documents available with IN-D. The documents were collected by scraping the Singapore Government Judiciary website. The database developed ha",
    "path": "papers/23/05/2305.06148.json",
    "total_tokens": 941,
    "translated_title": "一种运输行业文档分类的半自动化方法",
    "translated_abstract": "在运输行业中，文档分类对于确保必要的文件被正确识别并处理以通过海关清关流程起着至关重要的作用。OCR技术被用于自动化文档分类过程，其中包括识别商业发票、装箱清单、进出口报关单、提单、海运提单、证书、航空或铁路货运提单、到达通知书、原产地证明、进口商安全申报和信用证等重要文件。通过使用OCR技术，运输行业可以提高文档分类和海关清关流程的准确性和效率。本研究旨在基于关键词频率构建一个稳健的文档分类系统。研究通过分析IN-D公司提供的违约诉讼文档得出，该文档收集自新加坡政府司法网站。数据库中包含85个违约案例和555个非违约案例，提出的方法实现了93.31%的高分类准确度。",
    "tldr": "运输行业使用OCR技术对文件进行分类以提高准确性和效率。该研究提出半自动化的方法，基于关键词频率构建一个稳健的文档分类系统，其在收集的85个违约案例和555个非违约案例上实现了93.31%的高分类准确度。",
    "en_tdlr": "OCR technology is used in the shipping industry to improve accuracy and efficiency in document classification for customs clearance. This study proposes a semi-automatic method based on keyword frequencies to build a robust document classification system, achieving a high classification accuracy of 93.31% on 85 contract-breach cases and 555 non-contract-breach cases."
}