{
    "title": "DeepAqua: Self-Supervised Semantic Segmentation of Wetlands from SAR Images using Knowledge Distillation. (arXiv:2305.01698v1 [cs.CV])",
    "abstract": "Remote sensing has significantly advanced water detection by applying semantic segmentation techniques to satellite imagery. However, semantic segmentation remains challenging due to the substantial amount of annotated data required. This is particularly problematic in wetland detection, where water extent varies over time and space, necessitating multiple annotations for the same area. In this paper, we present DeepAqua, a self-supervised deep learning model that leverages knowledge distillation to eliminate the need for manual annotations during the training phase. DeepAqua utilizes the Normalized Difference Water Index (NDWI) as a teacher model to train a Convolutional Neural Network (CNN) for segmenting water from Synthetic Aperture Radar (SAR) images. To train the student model, we exploit cases where optical- and radar-based water masks coincide, enabling the detection of both open and vegetated water surfaces. Our model represents a significant advancement in computer vision tec",
    "link": "http://arxiv.org/abs/2305.01698",
    "context": "Title: DeepAqua: Self-Supervised Semantic Segmentation of Wetlands from SAR Images using Knowledge Distillation. (arXiv:2305.01698v1 [cs.CV])\nAbstract: Remote sensing has significantly advanced water detection by applying semantic segmentation techniques to satellite imagery. However, semantic segmentation remains challenging due to the substantial amount of annotated data required. This is particularly problematic in wetland detection, where water extent varies over time and space, necessitating multiple annotations for the same area. In this paper, we present DeepAqua, a self-supervised deep learning model that leverages knowledge distillation to eliminate the need for manual annotations during the training phase. DeepAqua utilizes the Normalized Difference Water Index (NDWI) as a teacher model to train a Convolutional Neural Network (CNN) for segmenting water from Synthetic Aperture Radar (SAR) images. To train the student model, we exploit cases where optical- and radar-based water masks coincide, enabling the detection of both open and vegetated water surfaces. Our model represents a significant advancement in computer vision tec",
    "path": "papers/23/05/2305.01698.json",
    "total_tokens": 1006,
    "translated_title": "DeepAqua:使用知识蒸馏方法从SAR图像自我监督分割湿地的语义信息",
    "translated_abstract": "遥感技术通过将语义分割技术应用于卫星图像已经显著提高了水的检测能力。然而，由于需要大量的注释数据，语义分割仍然是具有挑战性的。这在湿地检测方面尤其困难，因为水的范围随时间和空间的变化而变化，需要对同一区域进行多次注释。本文提出了DeepAqua，这是一种自我监督的深度学习模型，利用知识蒸馏方法在训练阶段消除了手动注释的需求。DeepAqua利用归一化差异水指数（NDWI）作为教师模型，训练卷积神经网络（CNN）以分割合成孔径雷达（SAR）图像中的水。为训练学生模型，我们利用光学和雷达水质掩蔽相重叠的情况，实现了开放及有植被水面的检测。我们的模型在湿地检测领域具有显著的计算机视觉技术进步，可用于大规模监测湿地变化。",
    "tldr": "本文提出了DeepAqua，一种利用自我监督深度学习模型，使用知识蒸馏技术来从合成孔径雷达图像中分割水域的方法。该方法不需要手动注释，可用于大规模监测湿地变化。",
    "en_tdlr": "The paper presents DeepAqua, a self-supervised deep learning model that leverages knowledge distillation to segment water from Synthetic Aperture Radar (SAR) images without manual annotations. The model is a significant advancement in computer vision techniques for wetland detection and can be applied to monitor wetland changes on large scales."
}