{
    "title": "Smart Home Energy Management: VAE-GAN synthetic dataset generator and Q-learning. (arXiv:2305.08885v1 [cs.LG])",
    "abstract": "Recent years have noticed an increasing interest among academia and industry towards analyzing the electrical consumption of residential buildings and employing smart home energy management systems (HEMS) to reduce household energy consumption and costs. HEMS has been developed to simulate the statistical and functional properties of actual smart grids. Access to publicly available datasets is a major challenge in this type of research. The potential of artificial HEMS applications will be further enhanced with the development of time series that represent different operating conditions of the synthetic systems. In this paper, we propose a novel variational auto-encoder-generative adversarial network (VAE-GAN) technique for generating time-series data on energy consumption in smart homes. We also explore how the generative model performs when combined with a Q-learning-based HEMS. We tested the online performance of Q-learning-based HEMS with real-world smart home data. To test the gen",
    "link": "http://arxiv.org/abs/2305.08885",
    "context": "Title: Smart Home Energy Management: VAE-GAN synthetic dataset generator and Q-learning. (arXiv:2305.08885v1 [cs.LG])\nAbstract: Recent years have noticed an increasing interest among academia and industry towards analyzing the electrical consumption of residential buildings and employing smart home energy management systems (HEMS) to reduce household energy consumption and costs. HEMS has been developed to simulate the statistical and functional properties of actual smart grids. Access to publicly available datasets is a major challenge in this type of research. The potential of artificial HEMS applications will be further enhanced with the development of time series that represent different operating conditions of the synthetic systems. In this paper, we propose a novel variational auto-encoder-generative adversarial network (VAE-GAN) technique for generating time-series data on energy consumption in smart homes. We also explore how the generative model performs when combined with a Q-learning-based HEMS. We tested the online performance of Q-learning-based HEMS with real-world smart home data. To test the gen",
    "path": "papers/23/05/2305.08885.json",
    "total_tokens": 1037,
    "translated_title": "智能家居能源管理：VAE-GAN合成数据集生成器和Q学习",
    "translated_abstract": "近年来，学术界和工业界对分析住宅建筑物的电力消耗并采用智能家居能源管理系统（HEMS）以减少家庭能源消耗和成本的兴趣日益增加。 HEMS已被开发用于模拟实际智能电网的统计和功能属性。公共可用数据集的获取是这类研究面临的主要挑战。合成系统的不同操作条件所代表的时间序列的开发将进一步增强人工HEMS应用的潜力。在本文中，我们提出了一种新颖的VAE-GAN技术，用于生成智能家居能耗的时间序列数据。 我们还探索了在基于Q学习的HEMS中将生成模型与之相结合的表现。我们使用实际的智能家居数据测试了基于Q学习的HEMS的在线表现。为了测试生成的数据，我们在受控环境中将生成的时间序列数据作为Q学习基础的HEMS的输入。实验结果表明，VAE-GAN技术可以生成逼真的时间序列，并可用于有效地训练HEMS。",
    "tldr": "该论文介绍了一种能够生成智能家居能耗数据的VAE-GAN技术，同时探索将生成模型与Q学习结合应用于基于Q学习的HEMS中的表现，并且证明了VAE-GAN技术能够有效地训练HEMS，为智能家居节能带来了新的应用前景。",
    "en_tdlr": "This paper introduces a VAE-GAN technique that can generate time-series data on energy consumption in smart homes, explores the combination of generative model and Q-learning-based HEMS, and demonstrates the effectiveness of VAE-GAN technique in training HEMS for smart home energy management, presenting new application prospects for energy-saving in smart homes."
}