{
    "title": "Denoised Self-Augmented Learning for Social Recommendation. (arXiv:2305.12685v2 [cs.IR] UPDATED)",
    "abstract": "Social recommendation is gaining increasing attention in various online applications, including e-commerce and online streaming, where social information is leveraged to improve user-item interaction modeling. Recently, Self-Supervised Learning (SSL) has proven to be remarkably effective in addressing data sparsity through augmented learning tasks. Inspired by this, researchers have attempted to incorporate SSL into social recommendation by supplementing the primary supervised task with social-aware self-supervised signals. However, social information can be unavoidably noisy in characterizing user preferences due to the ubiquitous presence of interest-irrelevant social connections, such as colleagues or classmates who do not share many common interests. To address this challenge, we propose a novel social recommender called the Denoised Self-Augmented Learning paradigm (DSL). Our model not only preserves helpful social relations to enhance user-item interaction modeling but also enabl",
    "link": "http://arxiv.org/abs/2305.12685",
    "context": "Title: Denoised Self-Augmented Learning for Social Recommendation. (arXiv:2305.12685v2 [cs.IR] UPDATED)\nAbstract: Social recommendation is gaining increasing attention in various online applications, including e-commerce and online streaming, where social information is leveraged to improve user-item interaction modeling. Recently, Self-Supervised Learning (SSL) has proven to be remarkably effective in addressing data sparsity through augmented learning tasks. Inspired by this, researchers have attempted to incorporate SSL into social recommendation by supplementing the primary supervised task with social-aware self-supervised signals. However, social information can be unavoidably noisy in characterizing user preferences due to the ubiquitous presence of interest-irrelevant social connections, such as colleagues or classmates who do not share many common interests. To address this challenge, we propose a novel social recommender called the Denoised Self-Augmented Learning paradigm (DSL). Our model not only preserves helpful social relations to enhance user-item interaction modeling but also enabl",
    "path": "papers/23/05/2305.12685.json",
    "total_tokens": 866,
    "translated_title": "去噪自助学习用于社交推荐",
    "translated_abstract": "社交推荐在电子商务和在线流媒体等各种在线应用中越来越受关注，在这些应用中，利用社交信息可以改善用户-项目交互建模。最近，自我监督学习（SSL）通过增强学习任务在解决数据稀疏性方面被证明非常有效。受此启发，研究人员尝试将SSL引入社交推荐中，通过补充主要的监督任务以社交感知的自我监督信号。然而，由于广泛存在的与兴趣无关的社交连接（如同事或同学）导致社交信息在描述用户偏好时不可避免地受到噪声的影响。为了解决这个挑战，我们提出了一种新颖的社交推荐模型，称为去噪自助学习范式（DSL）。我们的模型不仅保留有用的社交关系以增强用户-项目交互建模，还实现了去噪处理，以减少无关兴趣的社交连接对用户偏好建模的负面影响。",
    "tldr": "Denoised Self-Augmented Learning paradigm (DSL) is proposed for social recommendation, which addresses the challenge of noisy social information by preserving relevant social relations and reducing the negative impact of interest-irrelevant connections."
}