{
    "title": "PTGB: Pre-Train Graph Neural Networks for Brain Network Analysis. (arXiv:2305.14376v1 [q-bio.NC])",
    "abstract": "The human brain is the central hub of the neurobiological system, controlling behavior and cognition in complex ways. Recent advances in neuroscience and neuroimaging analysis have shown a growing interest in the interactions between brain regions of interest (ROIs) and their impact on neural development and disorder diagnosis. As a powerful deep model for analyzing graph-structured data, Graph Neural Networks (GNNs) have been applied for brain network analysis. However, training deep models requires large amounts of labeled data, which is often scarce in brain network datasets due to the complexities of data acquisition and sharing restrictions. To make the most out of available training data, we propose PTGB, a GNN pre-training framework that captures intrinsic brain network structures, regardless of clinical outcomes, and is easily adaptable to various downstream tasks. PTGB comprises two key components: (1) an unsupervised pre-training technique designed specifically for brain netw",
    "link": "http://arxiv.org/abs/2305.14376",
    "context": "Title: PTGB: Pre-Train Graph Neural Networks for Brain Network Analysis. (arXiv:2305.14376v1 [q-bio.NC])\nAbstract: The human brain is the central hub of the neurobiological system, controlling behavior and cognition in complex ways. Recent advances in neuroscience and neuroimaging analysis have shown a growing interest in the interactions between brain regions of interest (ROIs) and their impact on neural development and disorder diagnosis. As a powerful deep model for analyzing graph-structured data, Graph Neural Networks (GNNs) have been applied for brain network analysis. However, training deep models requires large amounts of labeled data, which is often scarce in brain network datasets due to the complexities of data acquisition and sharing restrictions. To make the most out of available training data, we propose PTGB, a GNN pre-training framework that captures intrinsic brain network structures, regardless of clinical outcomes, and is easily adaptable to various downstream tasks. PTGB comprises two key components: (1) an unsupervised pre-training technique designed specifically for brain netw",
    "path": "papers/23/05/2305.14376.json",
    "total_tokens": 908,
    "translated_title": "PTGB：预训练图神经网络用于脑网络分析",
    "translated_abstract": "人类大脑是神经生物系统的中枢枢纽，在复杂的方式下控制行为和认知。最近神经科学和神经影像分析方面的进展表明，对感兴趣的脑区域之间的相互作用以及它们对神经发育和疾病诊断的影响越来越感兴趣。作为一种强大的分析图结构数据的深度模型，图神经网络（GNN）已被应用于脑网络分析。然而，训练深度模型需要大量标记数据，由于数据采集的复杂性和共享限制等原因，脑网络数据集中标记数据通常很少。为了充分利用现有的训练数据，我们提出了 PTGB，一种 GNN 预训练框架，它可以捕获内在的脑网络结构，无论临床结果如何，并且可以轻松适应各种下游任务。PTGB 包括两个关键组成部分：（1）一种无监督的针对脑网络的预训练技术。",
    "tldr": "PTGB 是一个预训练 GNN 框架，用于无监督学习内心脑网络结构，从而充分利用有限的标记数据，适用于各种下游任务。",
    "en_tdlr": "PTGB is a pre-training GNN framework for unsupervised learning of intrinsic brain network structures, which makes the most of limited labeled data and is suitable for various downstream tasks."
}