{
    "title": "A Generalized Framework for Predictive Clustering and Optimization. (arXiv:2305.04364v1 [cs.LG])",
    "abstract": "Clustering is a powerful and extensively used data science tool. While clustering is generally thought of as an unsupervised learning technique, there are also supervised variations such as Spath's clusterwise regression that attempt to find clusters of data that yield low regression error on a supervised target. We believe that clusterwise regression is just a single vertex of a largely unexplored design space of supervised clustering models. In this article, we define a generalized optimization framework for predictive clustering that admits different cluster definitions (arbitrary point assignment, closest center, and bounding box) and both regression and classification objectives. We then present a joint optimization strategy that exploits mixed-integer linear programming (MILP) for global optimization in this generalized framework. To alleviate scalability concerns for large datasets, we also provide highly scalable greedy algorithms inspired by the Majorization-Minimization (MM) ",
    "link": "http://arxiv.org/abs/2305.04364",
    "context": "Title: A Generalized Framework for Predictive Clustering and Optimization. (arXiv:2305.04364v1 [cs.LG])\nAbstract: Clustering is a powerful and extensively used data science tool. While clustering is generally thought of as an unsupervised learning technique, there are also supervised variations such as Spath's clusterwise regression that attempt to find clusters of data that yield low regression error on a supervised target. We believe that clusterwise regression is just a single vertex of a largely unexplored design space of supervised clustering models. In this article, we define a generalized optimization framework for predictive clustering that admits different cluster definitions (arbitrary point assignment, closest center, and bounding box) and both regression and classification objectives. We then present a joint optimization strategy that exploits mixed-integer linear programming (MILP) for global optimization in this generalized framework. To alleviate scalability concerns for large datasets, we also provide highly scalable greedy algorithms inspired by the Majorization-Minimization (MM) ",
    "path": "papers/23/05/2305.04364.json",
    "total_tokens": 832,
    "translated_title": "预测性聚类与优化的通用框架",
    "translated_abstract": "聚类是一种强大而广泛使用的数据科学工具。虽然聚类通常被认为是无监督学习技术，但也存在着像Spath的聚类回归这样试图找到产生监督目标低回归误差的数据聚类的监督变体。在本文中，我们为预测性聚类定义了一个通用的优化框架，该框架可以接受不同的聚类定义（任意点分配、最接近的中心和边界框）和回归、分类目标。然后，我们提出了一种联合优化策略，在这个通用框架中利用混合整数线性规划（MILP）进行全局优化。为了减轻大型数据集的可扩展性问题，我们还提供了受主导最小化（MM）启发的高度可扩展的贪婪算法。",
    "tldr": "本文提出了一种通用的预测性聚类优化框架，该框架允许不同的聚类定义和回归、分类目标，并提供了高度可扩展的算法以解决大型数据集的优化问题。",
    "en_tdlr": "This article proposes a generalized framework for predictive clustering and optimization, allowing for different cluster definitions and regression/classification objectives, and provides highly scalable algorithms to tackle optimization problems for large datasets."
}