{
    "title": "A Mediation Analysis of the Relationship Between Land Use Regulation Stringency and Employment Dynamics. (arXiv:2305.02159v1 [econ.GN])",
    "abstract": "The paper examines the effects of stringent land use regulations, measured using the Wharton Residential Land Use Regulatory Index (WRLURI), on employment growth during the period 2010-2020 in the Retail, Professional, and Information sectors across 878 local jurisdictions in the United States. All the local jurisdictions exist in both (2006 and 2018) waves of the WRLURI surveys and hence constitute a unique panel data. We apply a mediation analytical framework to decompose the direct and indirect effects of land use regulation stringency on sectoral employment growth and specialization. Our analysis suggests a fully mediated pattern in the relationship between excessive land use regulations and employment growth, with housing cost burden as the mediator. Specifically, a one standard deviation increase in the WRLURI index is associated with an approximate increase of 0.8 percentage point in the proportion of cost burdened renters. Relatedly, higher prevalence of cost-burdened renters h",
    "link": "http://arxiv.org/abs/2305.02159",
    "context": "Title: A Mediation Analysis of the Relationship Between Land Use Regulation Stringency and Employment Dynamics. (arXiv:2305.02159v1 [econ.GN])\nAbstract: The paper examines the effects of stringent land use regulations, measured using the Wharton Residential Land Use Regulatory Index (WRLURI), on employment growth during the period 2010-2020 in the Retail, Professional, and Information sectors across 878 local jurisdictions in the United States. All the local jurisdictions exist in both (2006 and 2018) waves of the WRLURI surveys and hence constitute a unique panel data. We apply a mediation analytical framework to decompose the direct and indirect effects of land use regulation stringency on sectoral employment growth and specialization. Our analysis suggests a fully mediated pattern in the relationship between excessive land use regulations and employment growth, with housing cost burden as the mediator. Specifically, a one standard deviation increase in the WRLURI index is associated with an approximate increase of 0.8 percentage point in the proportion of cost burdened renters. Relatedly, higher prevalence of cost-burdened renters h",
    "path": "papers/23/05/2305.02159.json",
    "total_tokens": 902,
    "translated_title": "土地利用管制严格程度与就业动态关系的中介分析",
    "translated_abstract": "本文旨在研究美国878个地方辖区（2010-2020年）关于居住用途管制指数（WRLURI）严格程度对零售、专业和信息三个行业就业增长的影响。本文采用中介分析框架，研究土地利用管制严格程度对行业就业增长和专业化的直接影响和间接影响。分析结果表明，过度的土地利用管制严格程度与住房成本负担之间存在完全中介的关系，并且住房成本负担是中介变量，这阻碍了就业增长，信息行业的效应最为明显。",
    "tldr": "本文研究了美国878个地方辖区在2010-2020年间土地利用管制严格程度对零售、专业和信息三个行业就业增长的影响，结果表明过度的土地利用管制严格程度使得住房成本负担增加，住房成本负担成为了阻碍就业增长的中介变量，信息行业的效应最为明显。",
    "en_tdlr": "This paper analyzes the relationship between the stringency of land use regulations and employment growth in the United States across 878 local jurisdictions. The findings indicate that the excessive stringency of land use regulations leads to an increase in housing cost burden, which hinders employment growth, with the strongest effect observed in the Information sector."
}