{
    "title": "Baselines for Identifying Watermarked Large Language Models. (arXiv:2305.18456v1 [cs.LG])",
    "abstract": "We consider the emerging problem of identifying the presence and use of watermarking schemes in widely used, publicly hosted, closed source large language models (LLMs). We introduce a suite of baseline algorithms for identifying watermarks in LLMs that rely on analyzing distributions of output tokens and logits generated by watermarked and unmarked LLMs. Notably, watermarked LLMs tend to produce distributions that diverge qualitatively and identifiably from standard models. Furthermore, we investigate the identifiability of watermarks at varying strengths and consider the tradeoffs of each of our identification mechanisms with respect to watermarking scenario. Along the way, we formalize the specific problem of identifying watermarks in LLMs, as well as LLM watermarks and watermark detection in general, providing a framework and foundations for studying them.",
    "link": "http://arxiv.org/abs/2305.18456",
    "context": "Title: Baselines for Identifying Watermarked Large Language Models. (arXiv:2305.18456v1 [cs.LG])\nAbstract: We consider the emerging problem of identifying the presence and use of watermarking schemes in widely used, publicly hosted, closed source large language models (LLMs). We introduce a suite of baseline algorithms for identifying watermarks in LLMs that rely on analyzing distributions of output tokens and logits generated by watermarked and unmarked LLMs. Notably, watermarked LLMs tend to produce distributions that diverge qualitatively and identifiably from standard models. Furthermore, we investigate the identifiability of watermarks at varying strengths and consider the tradeoffs of each of our identification mechanisms with respect to watermarking scenario. Along the way, we formalize the specific problem of identifying watermarks in LLMs, as well as LLM watermarks and watermark detection in general, providing a framework and foundations for studying them.",
    "path": "papers/23/05/2305.18456.json",
    "total_tokens": 851,
    "translated_title": "识别水印大语言模型的基线",
    "translated_abstract": "我们考虑了一种新兴问题：如何识别广泛使用的，公开托管的，闭源的大型语言模型（LLM）中的水印方案。我们引入了一套基线算法，用于识别LLM水印，这些算法依赖于分析由带有和不带有水印的LLM生成的输出令牌和逻辑分布。值得注意的是，带有水印的LLMs tend to产生分布与标准模型 qualitatively and identifiably不同。此外，我们研究了在不同强度下识别水印的可行性，并考虑了每个识别机制在水印场景中的权衡。在此过程中，我们正式化了识别LLMs中的水印的具体问题，以及LLM水印和水印检测的一般性问题，为研究它们提供了框架和基础。",
    "tldr": "该论文介绍了一套基线算法，用于识别带有水印的大型语言模型，这些算法分析了带有和不带有水印的LLM所产生的输出分布和逻辑分布之间的差异。",
    "en_tdlr": "This paper introduces a suite of baseline algorithms for identifying watermarks in large language models (LLMs), which rely on analyzing the differences in output token and logits distributions between watermarked and unmarked LLMs. It provides a framework and foundations for studying LLM watermarks and watermark detection in general."
}