{
    "title": "Attention Paper: How Generative AI Reshapes Digital Shadow Industry?. (arXiv:2305.18346v1 [cs.CY])",
    "abstract": "The rapid development of digital economy has led to the emergence of various black and shadow internet industries, which pose potential risks that can be identified and managed through digital risk management (DRM) that uses different techniques such as machine learning and deep learning. The evolution of DRM architecture has been driven by changes in data forms. However, the development of AI-generated content (AIGC) technology, such as ChatGPT and Stable Diffusion, has given black and shadow industries powerful tools to personalize data and generate realistic images and conversations for fraudulent activities. This poses a challenge for DRM systems to control risks from the source of data generation and to respond quickly to the fast-changing risk environment. This paper aims to provide a technical analysis of the challenges and opportunities of AIGC from upstream, midstream, and downstream paths of black/shadow industries and suggest future directions for improving existing risk con",
    "link": "http://arxiv.org/abs/2305.18346",
    "context": "Title: Attention Paper: How Generative AI Reshapes Digital Shadow Industry?. (arXiv:2305.18346v1 [cs.CY])\nAbstract: The rapid development of digital economy has led to the emergence of various black and shadow internet industries, which pose potential risks that can be identified and managed through digital risk management (DRM) that uses different techniques such as machine learning and deep learning. The evolution of DRM architecture has been driven by changes in data forms. However, the development of AI-generated content (AIGC) technology, such as ChatGPT and Stable Diffusion, has given black and shadow industries powerful tools to personalize data and generate realistic images and conversations for fraudulent activities. This poses a challenge for DRM systems to control risks from the source of data generation and to respond quickly to the fast-changing risk environment. This paper aims to provide a technical analysis of the challenges and opportunities of AIGC from upstream, midstream, and downstream paths of black/shadow industries and suggest future directions for improving existing risk con",
    "path": "papers/23/05/2305.18346.json",
    "total_tokens": 872,
    "translated_title": "注意力论文：生成 AI 如何重塑数字阴影产业？",
    "translated_abstract": "数字经济的迅速发展导致了各种黑色和阴影互联网产业的出现，这些产业可能存在潜在风险，可以通过数字风险管理（DRM）来识别和管理，其中包括应用机器学习和深度学习等不同技术。DRM 架构的发展已经受到数据形式变化的驱动。然而，AI 生成内容（AIGC）技术的发展，如 ChatGPT 和 Stable Diffusion，为黑色和阴影产业提供了强大的工具，可以个性化数据并生成逼真的图片和对话以进行欺诈活动。这对于 DRM 系统来控制来自数据生成源的风险并迅速应对快速变化的风险环境构成了挑战。本文旨在从黑色/阴影产业的上游、中游和下游路径提供 AIGC 的挑战和机会的技术分析，并提出改进现有风险的未来方向。",
    "tldr": "本文分析了生成 AI 对数字阴影产业带来的挑战和机遇，从黑色/阴影产业的上游、中游和下游路径进行了技术分析，并提出了改进现有风险的未来方向。"
}