{
    "title": "A Hybrid Semantic-Geometric Approach for Clutter-Resistant Floorplan Generation from Building Point Clouds. (arXiv:2305.15420v1 [cs.CV])",
    "abstract": "Building Information Modeling (BIM) technology is a key component of modern construction engineering and project management workflows. As-is BIM models that represent the spatial reality of a project site can offer crucial information to stakeholders for construction progress monitoring, error checking, and building maintenance purposes. Geometric methods for automatically converting raw scan data into BIM models (Scan-to-BIM) often fail to make use of higher-level semantic information in the data. Whereas, semantic segmentation methods only output labels at the point level without creating object level models that is necessary for BIM. To address these issues, this research proposes a hybrid semantic-geometric approach for clutter-resistant floorplan generation from laser-scanned building point clouds. The input point clouds are first pre-processed by normalizing the coordinate system and removing outliers. Then, a semantic segmentation network based on PointNet++ is used to label eac",
    "link": "http://arxiv.org/abs/2305.15420",
    "context": "Title: A Hybrid Semantic-Geometric Approach for Clutter-Resistant Floorplan Generation from Building Point Clouds. (arXiv:2305.15420v1 [cs.CV])\nAbstract: Building Information Modeling (BIM) technology is a key component of modern construction engineering and project management workflows. As-is BIM models that represent the spatial reality of a project site can offer crucial information to stakeholders for construction progress monitoring, error checking, and building maintenance purposes. Geometric methods for automatically converting raw scan data into BIM models (Scan-to-BIM) often fail to make use of higher-level semantic information in the data. Whereas, semantic segmentation methods only output labels at the point level without creating object level models that is necessary for BIM. To address these issues, this research proposes a hybrid semantic-geometric approach for clutter-resistant floorplan generation from laser-scanned building point clouds. The input point clouds are first pre-processed by normalizing the coordinate system and removing outliers. Then, a semantic segmentation network based on PointNet++ is used to label eac",
    "path": "papers/23/05/2305.15420.json",
    "total_tokens": 894,
    "translated_title": "基于混合语义几何方法的建筑点云无杂乱物平面生成",
    "translated_abstract": "建筑信息模拟（BIM）技术是现代建筑工程和项目管理工作流程的关键组成部分。展示项目现场空间实际情况的现状BIM模型可以为利益相关者提供关键信息，用于建设进度监控、错误检查和建筑维护。自动将扫描原始数据转换为BIM模型（扫描到BIM）的几何方法通常无法利用数据中更高级的语义信息，而语义分割方法仅在点级别上输出标签，而不创建对象级模型，这是BIM所必需的。为解决这些问题，本研究提出了一种基于混合语义几何方法的建筑点云无杂乱物平面生成方法。首先通过归一化坐标系和去除异常值来预处理输入点云。然后，基于PointNet++的语义分割网络用于对点进行标记，最后通过几何方法生成无杂乱物的平面。",
    "tldr": "本研究提出了一种基于混合语义几何方法的建筑点云无杂乱物平面生成方法，通过预处理输入点云、使用PointNet++网络标记点、最后通过几何方法生成无杂乱物的平面。",
    "en_tdlr": "This research proposes a hybrid semantic-geometric approach for clutter-resistant floorplan generation from laser-scanned building point clouds, by preprocessing the input point clouds, using a PointNet++ network for labeling points, and generating clutter-resistant floorplans through geometric methods."
}