{
    "title": "Optimal tests following sequential experiments. (arXiv:2305.00403v1 [econ.EM])",
    "abstract": "Recent years have seen tremendous advances in the theory and application of sequential experiments. While these experiments are not always designed with hypothesis testing in mind, researchers may still be interested in performing tests after the experiment is completed. The purpose of this paper is to aid in the development of optimal tests for sequential experiments by analyzing their asymptotic properties. Our key finding is that the asymptotic power function of any test can be matched by a test in a limit experiment where a Gaussian process is observed for each treatment, and inference is made for the drifts of these processes. This result has important implications, including a powerful sufficiency result: any candidate test only needs to rely on a fixed set of statistics, regardless of the type of sequential experiment. These statistics are the number of times each treatment has been sampled by the end of the experiment, along with final value of the score (for parametric models)",
    "link": "http://arxiv.org/abs/2305.00403",
    "context": "Title: Optimal tests following sequential experiments. (arXiv:2305.00403v1 [econ.EM])\nAbstract: Recent years have seen tremendous advances in the theory and application of sequential experiments. While these experiments are not always designed with hypothesis testing in mind, researchers may still be interested in performing tests after the experiment is completed. The purpose of this paper is to aid in the development of optimal tests for sequential experiments by analyzing their asymptotic properties. Our key finding is that the asymptotic power function of any test can be matched by a test in a limit experiment where a Gaussian process is observed for each treatment, and inference is made for the drifts of these processes. This result has important implications, including a powerful sufficiency result: any candidate test only needs to rely on a fixed set of statistics, regardless of the type of sequential experiment. These statistics are the number of times each treatment has been sampled by the end of the experiment, along with final value of the score (for parametric models)",
    "path": "papers/23/05/2305.00403.json",
    "total_tokens": 871,
    "translated_title": "基于顺序实验的最优检验方法",
    "translated_abstract": "近年来，顺序实验的理论和应用取得了巨大进展。虽然这些实验不一定是为了进行假设检验而设计的，但研究人员仍然可能对实验完成后的检验感兴趣。本文的目的是通过分析它们的渐近性质来帮助发展顺序实验的最优检验方法。我们的关键发现是，任何检验的渐近功率函数都可以与极限实验中匹配的检验相匹配，在这个极限实验中，对于每种处理，观察产生一个高斯过程，并对这些过程的漂移进行推断。这个结果有重要的意义，包括一个强大的充分性结果：任何候选检验方法只需要依赖于一组固定的统计量，而不是顺序实验的类型。这些统计量是每种处理在实验结束时被采样的次数，以及得分的最终值（对于参数模型）",
    "tldr": "本文分析了基于顺序实验的最优检验方法，重要发现是任何检验的渐近功率函数都可以与一种极限实验中匹配的检验相匹配，这个结果有重要的意义，包括一个强大的充分性结果。",
    "en_tdlr": "This paper analyzes optimal tests for sequential experiments, and the key finding is that the asymptotic power function of any test can be matched by a test in a limit experiment, which has important implications, including a powerful sufficiency result."
}