{
    "title": "Comfort Foods and Community Connectedness: Investigating Diet Change during COVID-19 Using YouTube Videos on Twitter. (arXiv:2305.11398v1 [cs.SI])",
    "abstract": "Unprecedented lockdowns at the start of the COVID-19 pandemic have drastically changed the routines of millions of people, potentially impacting important health-related behaviors. In this study, we use YouTube videos embedded in tweets about diet, exercise and fitness posted before and during COVID-19 to investigate the influence of the pandemic lockdowns on diet and nutrition. In particular, we examine the nutritional profile of the foods mentioned in the transcript, description and title of each video in terms of six macronutrients (protein, energy, fat, sodium, sugar, and saturated fat). These macronutrient values were further linked to demographics to assess if there are specific effects on those potentially having insufficient access to healthy sources of food. Interrupted time series analysis revealed a considerable shift in the aggregated macronutrient scores before and during COVID-19. In particular, whereas areas with lower incomes showed decrease in energy, fat, and saturate",
    "link": "http://arxiv.org/abs/2305.11398",
    "context": "Title: Comfort Foods and Community Connectedness: Investigating Diet Change during COVID-19 Using YouTube Videos on Twitter. (arXiv:2305.11398v1 [cs.SI])\nAbstract: Unprecedented lockdowns at the start of the COVID-19 pandemic have drastically changed the routines of millions of people, potentially impacting important health-related behaviors. In this study, we use YouTube videos embedded in tweets about diet, exercise and fitness posted before and during COVID-19 to investigate the influence of the pandemic lockdowns on diet and nutrition. In particular, we examine the nutritional profile of the foods mentioned in the transcript, description and title of each video in terms of six macronutrients (protein, energy, fat, sodium, sugar, and saturated fat). These macronutrient values were further linked to demographics to assess if there are specific effects on those potentially having insufficient access to healthy sources of food. Interrupted time series analysis revealed a considerable shift in the aggregated macronutrient scores before and during COVID-19. In particular, whereas areas with lower incomes showed decrease in energy, fat, and saturate",
    "path": "papers/23/05/2305.11398.json",
    "total_tokens": 1083,
    "translated_title": "舒适食品与社区连结：利用Twitter上的YouTube视频调查COVID-19期间的饮食变化",
    "translated_abstract": "新冠疫情开始时空前的封锁措施已经彻底改变数百万人的日常生活方式，可能影响到重要的与健康相关的行为。本研究利用在COVID-19疫情前后发布的关于饮食、锻炼和健身的Twitter上的YouTube视频来调查疫情封锁对饮食和营养影响的因素。我们分别从视频的文字稿、描述和标题中考察所提到食物的六种营养物质（蛋白质、能量、脂肪、钠、糖和饱和脂肪）的热量值。这些营养物质值进一步与各种人口统计学数据关联起来，以评估是否会对那些可能无法获得健康食品提供特定影响。中断时间序列分析显示，在COVID-19期间，总体营养素得分出现了相当大的变化。特别是，在收入较低的地区，能量、脂肪和饱和脂肪的摄入量下降，而高糖、高蛋白和高钠的食品成为社交媒体讨论中更加突出，这可能反映了对食品偏好的变化。",
    "tldr": "本研究利用在Twitter上的YouTube视频调查了COVID-19期间的饮食变化，发现收入较低地区的能量、脂肪和饱和脂肪摄入量下降，高糖、高蛋白和高钠的食品成为突出的话题。",
    "en_tdlr": "This study investigated diet change during COVID-19 using YouTube videos on Twitter and found that in lower income areas, energy, fat, and saturated fat intake decreased while \"comfort foods\" high in sugar, protein, and sodium became more prominent in social media conversations, potentially reflecting changes in food preferences."
}