{
    "title": "Analysis and tuning of a three-term DMC. (arXiv:2305.15735v1 [eess.SY])",
    "abstract": "Most MPC (Model Predictive Control) algorithms used in industries and studied in the control academia use a two-term QP (quadratic programming), where the first term is the weighted norm of the output errors, and the second term is that of the input increments. In this work, a DMC (Dynamic Matrix Control) algorithm that uses three-term QP is studied, where the third term is the weighted norm of the output increments. In the analysis, a relationship between the three-term DMC and the two-term DMC is established; based on that, the closed-loop response curves are derived. Based on the analysis, two controller tuning procedures are developed for the three-term DMC, one for closed-loop step response and one for disturbance reduction. Finally, it will be proven that the three-term DMC can achieve a higher performance and robustness than the two-term DMC can. Simulation studies are used to demonstrate the findings and the tuning methods.",
    "link": "http://arxiv.org/abs/2305.15735",
    "context": "Title: Analysis and tuning of a three-term DMC. (arXiv:2305.15735v1 [eess.SY])\nAbstract: Most MPC (Model Predictive Control) algorithms used in industries and studied in the control academia use a two-term QP (quadratic programming), where the first term is the weighted norm of the output errors, and the second term is that of the input increments. In this work, a DMC (Dynamic Matrix Control) algorithm that uses three-term QP is studied, where the third term is the weighted norm of the output increments. In the analysis, a relationship between the three-term DMC and the two-term DMC is established; based on that, the closed-loop response curves are derived. Based on the analysis, two controller tuning procedures are developed for the three-term DMC, one for closed-loop step response and one for disturbance reduction. Finally, it will be proven that the three-term DMC can achieve a higher performance and robustness than the two-term DMC can. Simulation studies are used to demonstrate the findings and the tuning methods.",
    "path": "papers/23/05/2305.15735.json",
    "total_tokens": 829,
    "translated_title": "三项DMC的分析与调优",
    "translated_abstract": "许多在工业中使用和在控制学术中研究的MPC（模型预测控制）算法使用两项QP（二次规划），其中第一项是输出误差加权范数，第二项是输入增量加权范数。本文研究了一种使用三项QP的DMC（动态矩阵控制）算法，其中第三项是输出增量的加权范数。在分析中，建立了三项DMC和两项DMC之间的关系，并基于此导出了闭环响应曲线。根据分析，为三项DMC开发了两种控制器调节程序，一种用于闭环阶跃响应，一种用于扰动降低。最后，证明三项DMC可以比两项DMC实现更高的性能和鲁棒性。模拟研究用于展示研究结果和调优方法。",
    "tldr": "本文研究了一种使用三项QP的DMC算法，可以比传统的两项DMC实现更高的性能和鲁棒性。",
    "en_tdlr": "This paper studies a three-term QP-based DMC algorithm, which achieves higher performance and robustness than the traditional two-term DMC algorithm. Two controller tuning procedures for the three-term DMC are developed, and simulation studies are used to demonstrate the findings and tuning methods."
}