{
    "title": "Davinci the Dualist: the mind-body divide in large language models and in human learners. (arXiv:2305.07667v1 [cs.AI])",
    "abstract": "A large literature suggests that people are intuitive Dualists--they consider the mind ethereal, distinct from the body. Past research also shows that Dualism emerges, in part, via learning (e.g., Barlev & Shtulman, 2021). But whether learning is sufficient to give rise to Dualism is unknown.The evidence from human learners does address this question because humans are endowed not only with general learning capacities but also with core knowledge capacities. And recent results suggest that core knowledge begets Dualism (Berent, Theodore & Valencia, 2021; Berent, 2023). To evaluate the role of learning, here, we probe for a mind-body divide in Davinci--a large language model (LLM) that is devoid of any innate core knowledge. We show that Davinci still leans towards Dualism, and that this bias increases systematically with the learner's inductive potential. Thus, davinci (a GPT-3 model) exhibits mild Dualist tendencies, whereas its descendent, text-davinci-003 (a GPT-3.5 model), shows a ",
    "link": "http://arxiv.org/abs/2305.07667",
    "context": "Title: Davinci the Dualist: the mind-body divide in large language models and in human learners. (arXiv:2305.07667v1 [cs.AI])\nAbstract: A large literature suggests that people are intuitive Dualists--they consider the mind ethereal, distinct from the body. Past research also shows that Dualism emerges, in part, via learning (e.g., Barlev & Shtulman, 2021). But whether learning is sufficient to give rise to Dualism is unknown.The evidence from human learners does address this question because humans are endowed not only with general learning capacities but also with core knowledge capacities. And recent results suggest that core knowledge begets Dualism (Berent, Theodore & Valencia, 2021; Berent, 2023). To evaluate the role of learning, here, we probe for a mind-body divide in Davinci--a large language model (LLM) that is devoid of any innate core knowledge. We show that Davinci still leans towards Dualism, and that this bias increases systematically with the learner's inductive potential. Thus, davinci (a GPT-3 model) exhibits mild Dualist tendencies, whereas its descendent, text-davinci-003 (a GPT-3.5 model), shows a ",
    "path": "papers/23/05/2305.07667.json",
    "total_tokens": 798,
    "translated_title": "达芬奇二重论者：大语言模型中的心身分离和人类学习者中的心身二元论",
    "translated_abstract": "大量文献表明，人类具有直观的二元论思想，认为精神和身体是不同的存在。过去的研究也表明，二元论是通过学习而出现的（例如Barlev＆Shtulman，2021）。但学习是否足以导致二元论尚不清楚。通过探究Davinci（一种不具有任何内在核心知识的大语言模型）中的心身分离，我们评估了学习的作用。我们发现，Davinci仍然倾向于二元论，并且这种偏见随着学习者的归纳潜力逐渐增加。",
    "tldr": "本研究探究了大语言模型Davinci中的心身分离，发现其具有弱化的二元论倾向。",
    "en_tdlr": "This study investigates the mind-body divide in the large language model Davinci, and finds that it exhibits mild Dualist tendencies."
}