{
    "title": "Vecchia Gaussian Process Ensembles on Internal Representations of Deep Neural Networks. (arXiv:2305.17063v1 [stat.ML])",
    "abstract": "For regression tasks, standard Gaussian processes (GPs) provide natural uncertainty quantification, while deep neural networks (DNNs) excel at representation learning. We propose to synergistically combine these two approaches in a hybrid method consisting of an ensemble of GPs built on the output of hidden layers of a DNN. GP scalability is achieved via Vecchia approximations that exploit nearest-neighbor conditional independence. The resulting deep Vecchia ensemble not only imbues the DNN with uncertainty quantification but can also provide more accurate and robust predictions. We demonstrate the utility of our model on several datasets and carry out experiments to understand the inner workings of the proposed method.",
    "link": "http://arxiv.org/abs/2305.17063",
    "context": "Title: Vecchia Gaussian Process Ensembles on Internal Representations of Deep Neural Networks. (arXiv:2305.17063v1 [stat.ML])\nAbstract: For regression tasks, standard Gaussian processes (GPs) provide natural uncertainty quantification, while deep neural networks (DNNs) excel at representation learning. We propose to synergistically combine these two approaches in a hybrid method consisting of an ensemble of GPs built on the output of hidden layers of a DNN. GP scalability is achieved via Vecchia approximations that exploit nearest-neighbor conditional independence. The resulting deep Vecchia ensemble not only imbues the DNN with uncertainty quantification but can also provide more accurate and robust predictions. We demonstrate the utility of our model on several datasets and carry out experiments to understand the inner workings of the proposed method.",
    "path": "papers/23/05/2305.17063.json",
    "total_tokens": 765,
    "translated_title": "深度神经网络内部表征上的Vecchia高斯过程集成",
    "translated_abstract": "对于回归任务，标准高斯过程(GPs)提供了自然的不确定性量化，而深度神经网络(DNNs)擅长表征学习。我们提出了一种混合方法，将这两种方法协同组合起来，形成一个基于DNN的隐藏层输出构建的GP集合。通过利用最近邻条件独立的Vecchia近似实现了GP的可扩展性。生成的深度Vecchia集合不仅赋予DNN不确定性量化，还可以提供更准确和更稳健的预测。我们在几个数据集上展示了模型的效用，并进行了实验以了解所提出方法的内部机制。",
    "tldr": "提出了一种基于深度神经网络内部表征的Vecchia高斯过程集成方法，该方法通过将标准高斯过程与DNN相结合，生成一种不仅能够量化不确定性，而且能够提供更准确和更稳健的预测的深度Vecchia集合。",
    "en_tdlr": "A deep Vecchia ensemble approach based on the internal representations of deep neural networks is proposed, which combines standard Gaussian processes (GPs) and DNNs to generate a more accurate and robust prediction model that provides uncertainty quantification."
}