{
    "title": "Fears about AI-mediated communication are grounded in different expectations for one's own versus others' use. (arXiv:2305.01670v1 [cs.HC])",
    "abstract": "The rapid development of AI-mediated communication technologies (AICTs), which are digital tools that use AI to augment interpersonal messages, has raised concerns about the future of interpersonal trust and prompted discussions about disclosure and uptake. This paper contributes to this discussion by assessing perceptions about the acceptability and use of open and secret AICTs for oneself and others. In two studies with representative samples (UK: N=477, US: N=765), we found that secret AICT use is deemed less acceptable than open AICT use, people tend to overestimate others' AICT use, and people expect others to use AICTs irresponsibly. Thus, we raise concerns about the potential for misperceptions and different expectations for others to drive self-fulfilling pessimistic outlooks about AI-mediated communication.",
    "link": "http://arxiv.org/abs/2305.01670",
    "context": "Title: Fears about AI-mediated communication are grounded in different expectations for one's own versus others' use. (arXiv:2305.01670v1 [cs.HC])\nAbstract: The rapid development of AI-mediated communication technologies (AICTs), which are digital tools that use AI to augment interpersonal messages, has raised concerns about the future of interpersonal trust and prompted discussions about disclosure and uptake. This paper contributes to this discussion by assessing perceptions about the acceptability and use of open and secret AICTs for oneself and others. In two studies with representative samples (UK: N=477, US: N=765), we found that secret AICT use is deemed less acceptable than open AICT use, people tend to overestimate others' AICT use, and people expect others to use AICTs irresponsibly. Thus, we raise concerns about the potential for misperceptions and different expectations for others to drive self-fulfilling pessimistic outlooks about AI-mediated communication.",
    "path": "papers/23/05/2305.01670.json",
    "total_tokens": 887,
    "translated_title": "基于期望角度看待AI调解沟通的担忧和不同态度",
    "translated_abstract": "AI媒介交流技术(AICTs)的迅速发展，即使用人工智能来增强人与人之间的消息沟通已经引发了人们对人际关系的未来以及披露和采用行为的担忧。本文通过评估人们对公开和隐秘的AICTs的可接受性和使用情况的看法，进一步探讨了这个问题。在两项代表性样本研究（英国：N=477，美国：N=765）中，我们发现，与公开AICTs相比，秘密AICTs使用被认为不太可接受，人们往往高估别人的AICTs使用率，而且人们也期望他人不负责任地使用AICTs。因此，我们担心这种畸形期望和不同的期望角度会引起一种自我实现的悲观看法，从而影响到AI调解沟通的发展。",
    "tldr": "人们对AI调解沟通技术的秘密使用持消极态度，期望别人的使用率比实际情况高，很多人认为别人对AICTs使用不负责任，这些因素可能导致关于AI调解沟通技术的错误看法。",
    "en_tdlr": "This paper explores perceptions about the acceptability and use of open and secret AI-mediated communication technologies (AICTs) for oneself and others. It raises concerns about the potential for misperceptions and different expectations for others to drive self-fulfilling pessimistic outlooks about AI-mediated communication."
}