{
    "title": "Context-Aware Attention Layers coupled with Optimal Transport Domain Adaptation methods for recognizing dementia from spontaneous speech. (arXiv:2305.16406v1 [cs.CL])",
    "abstract": "Alzheimer's disease (AD) constitutes a complex neurocognitive disease and is the main cause of dementia. Although many studies have been proposed targeting at diagnosing dementia through spontaneous speech, there are still limitations. Existing state-of-the-art approaches, which propose multimodal methods, train separately language and acoustic models, employ majority-vote approaches, and concatenate the representations of the different modalities either at the input level, i.e., early fusion, or during training. Also, some of them employ self-attention layers, which calculate the dependencies between representations without considering the contextual information. In addition, no prior work has taken into consideration the model calibration. To address these limitations, we propose some new methods for detecting AD patients, which capture the intraand cross-modal interactions. First, we convert the audio files into log-Mel spectrograms, their delta, and delta-delta and create in this",
    "link": "http://arxiv.org/abs/2305.16406",
    "context": "Title: Context-Aware Attention Layers coupled with Optimal Transport Domain Adaptation methods for recognizing dementia from spontaneous speech. (arXiv:2305.16406v1 [cs.CL])\nAbstract: Alzheimer's disease (AD) constitutes a complex neurocognitive disease and is the main cause of dementia. Although many studies have been proposed targeting at diagnosing dementia through spontaneous speech, there are still limitations. Existing state-of-the-art approaches, which propose multimodal methods, train separately language and acoustic models, employ majority-vote approaches, and concatenate the representations of the different modalities either at the input level, i.e., early fusion, or during training. Also, some of them employ self-attention layers, which calculate the dependencies between representations without considering the contextual information. In addition, no prior work has taken into consideration the model calibration. To address these limitations, we propose some new methods for detecting AD patients, which capture the intraand cross-modal interactions. First, we convert the audio files into log-Mel spectrograms, their delta, and delta-delta and create in this",
    "path": "papers/23/05/2305.16406.json",
    "total_tokens": 924,
    "translated_title": "基于情境感知注意力层及最优传输域自适应方法识别自发语音中的痴呆症",
    "translated_abstract": "阿尔茨海默病是一种复杂的神经认知病变，也是导致痴呆症最常见的原因。虽然已经有很多针对通过自发语音诊断痴呆症的研究，但仍然存在限制。现有的先进方法提出了多模态方法，分别训练语言和声学模型，并采用多数投票方法，以及将不同模态的表示在输入层进行级联或在训练过程中进行级联。与此同时，一些方法采用了自我注意力层，计算表示之间的依赖关系，但没有考虑到上下文信息。此外，以前的工作都没有考虑到模型的校准。为了解决这些限制，我们提出了一些新方法来检测AD患者，捕捉了模态内部和模态间的交互。首先，我们将音频文件转换为log-Mel光谱图，它们的delta和delta-delta，并在此基础上创建了一个多通道神经网络。",
    "tldr": "本论文提出一种基于情境感知注意力层及最优传输域自适应方法的语音识别痴呆症的新方法。该方法捕捉了模态内部和模态间的交互，并实现了模型校准。"
}