{
    "title": "Applications of Machine Learning in Detecting Afghan Fake Banknotes. (arXiv:2305.14745v1 [cs.LG])",
    "abstract": "Fake currency, unauthorized imitation money lacking government approval, constitutes a form of fraud. Particularly in Afghanistan, the prevalence of fake currency poses significant challenges and detrimentally impacts the economy. While banks and commercial establishments employ authentication machines, the public lacks access to such systems, necessitating a program that can detect counterfeit banknotes accessible to all. This paper introduces a method using image processing to identify counterfeit Afghan banknotes by analyzing specific security features. Extracting first and second order statistical features from input images, the WEKA machine learning tool was employed to construct models and perform classification with Random Forest, PART, and Na\\\"ive Bayes algorithms. The Random Forest algorithm achieved exceptional accuracy of 99% in detecting fake Afghan banknotes, indicating the efficacy of the proposed method as a solution for identifying counterfeit currency.",
    "link": "http://arxiv.org/abs/2305.14745",
    "context": "Title: Applications of Machine Learning in Detecting Afghan Fake Banknotes. (arXiv:2305.14745v1 [cs.LG])\nAbstract: Fake currency, unauthorized imitation money lacking government approval, constitutes a form of fraud. Particularly in Afghanistan, the prevalence of fake currency poses significant challenges and detrimentally impacts the economy. While banks and commercial establishments employ authentication machines, the public lacks access to such systems, necessitating a program that can detect counterfeit banknotes accessible to all. This paper introduces a method using image processing to identify counterfeit Afghan banknotes by analyzing specific security features. Extracting first and second order statistical features from input images, the WEKA machine learning tool was employed to construct models and perform classification with Random Forest, PART, and Na\\\"ive Bayes algorithms. The Random Forest algorithm achieved exceptional accuracy of 99% in detecting fake Afghan banknotes, indicating the efficacy of the proposed method as a solution for identifying counterfeit currency.",
    "path": "papers/23/05/2305.14745.json",
    "total_tokens": 836,
    "translated_title": "机器学习在检测阿富汗假钞中的应用",
    "translated_abstract": "假钞是指未经政府批准的非法仿制货币，是一种欺诈行为。特别是在阿富汗，假钞的普及带来了重大挑战，对经济造成了负面影响。虽然银行和商业机构使用身份验证机，但公众无法接触这些系统，需要一个能够检测所有人伪造货币的程序。本文介绍了一种使用图像处理来识别特定安全特征的伪造阿富汗钞票的方法。从输入图像中提取第一和第二阶统计特征，使用WEKA机器学习工具构建模型并使用随机森林、PART和朴素贝叶斯算法进行分类。随机森林算法在检测假阿富汗钞票方面达到了99％的异常准确率，表明所提出的方法作为鉴别伪币的解决方案非常有效。",
    "tldr": "本文介绍了一种使用机器学习和图像处理技术的方法来检测假阿富汗钞票，随机森林算法的识别准确率达到了99％。",
    "en_tdlr": "This paper presents a method using machine learning and image processing techniques to detect counterfeit Afghan banknotes, with the Random Forest algorithm achieving an exceptional accuracy of 99%."
}