{
    "title": "DATED: Guidelines for Creating Synthetic Datasets for Engineering Design Applications. (arXiv:2305.09018v1 [cs.LG])",
    "abstract": "Exploiting the recent advancements in artificial intelligence, showcased by ChatGPT and DALL-E, in real-world applications necessitates vast, domain-specific, and publicly accessible datasets. Unfortunately, the scarcity of such datasets poses a significant challenge for researchers aiming to apply these breakthroughs in engineering design. Synthetic datasets emerge as a viable alternative. However, practitioners are often uncertain about generating high-quality datasets that accurately represent real-world data and are suitable for the intended downstream applications. This study aims to fill this knowledge gap by proposing comprehensive guidelines for generating, annotating, and validating synthetic datasets. The trade-offs and methods associated with each of these aspects are elaborated upon. Further, the practical implications of these guidelines are illustrated through the creation of a turbo-compressors dataset. The study underscores the importance of thoughtful sampling methods ",
    "link": "http://arxiv.org/abs/2305.09018",
    "context": "Title: DATED: Guidelines for Creating Synthetic Datasets for Engineering Design Applications. (arXiv:2305.09018v1 [cs.LG])\nAbstract: Exploiting the recent advancements in artificial intelligence, showcased by ChatGPT and DALL-E, in real-world applications necessitates vast, domain-specific, and publicly accessible datasets. Unfortunately, the scarcity of such datasets poses a significant challenge for researchers aiming to apply these breakthroughs in engineering design. Synthetic datasets emerge as a viable alternative. However, practitioners are often uncertain about generating high-quality datasets that accurately represent real-world data and are suitable for the intended downstream applications. This study aims to fill this knowledge gap by proposing comprehensive guidelines for generating, annotating, and validating synthetic datasets. The trade-offs and methods associated with each of these aspects are elaborated upon. Further, the practical implications of these guidelines are illustrated through the creation of a turbo-compressors dataset. The study underscores the importance of thoughtful sampling methods ",
    "path": "papers/23/05/2305.09018.json",
    "total_tokens": 816,
    "translated_title": "DATED：用于工程设计应用的生成合成数据集的指南",
    "translated_abstract": "利用人工智能的最新进展，如ChatGPT和DALL-E，在实际应用中需要大量的、领域特定且公开可访问的数据集。不幸的是，这种数据集的稀缺性对于希望将这些突破应用于工程设计的研究人员构成了重大挑战。合成数据集则成为了一种可行的替代方案。然而，从业者通常不确定如何生成高质量的数据集，以准确地代表真实世界的数据，并适用于预期的下游应用。本研究旨在通过提出生成、注释和验证合成数据集的全面指南来填补这一知识空白。阐述了每个方面所涉及的权衡和方法。此外，通过创建一个涡轮增压器数据集，说明了这些指南的实际意义。该研究强调了周到的抽样方法的重要性。",
    "tldr": "本研究提出了一套关于生成、注释和验证合成数据集的全面指南，阐述了权衡和方法，强调了周到的抽样方法的重要性。",
    "en_tdlr": "This study proposes comprehensive guidelines for generating, annotating, and validating synthetic datasets for engineering design applications, highlighting the importance of thoughtful sampling methods."
}