{
    "title": "Tune-Mode ConvBN Blocks For Efficient Transfer Learning. (arXiv:2305.11624v1 [cs.AI])",
    "abstract": "Convolution-BatchNorm (ConvBN) blocks are integral components in various computer vision tasks and other domains. A ConvBN block can operate in three modes: Train, Eval, and Deploy. While the Train mode is indispensable for training models from scratch, the Eval mode is suitable for transfer learning and model validation, and the Deploy mode is designed for the deployment of models. This paper focuses on the trade-off between stability and efficiency in ConvBN blocks: Deploy mode is efficient but suffers from training instability; Eval mode is widely used in transfer learning but lacks efficiency. To solve the dilemma, we theoretically reveal the reason behind the diminished training stability observed in the Deploy mode. Subsequently, we propose a novel Tune mode to bridge the gap between Eval mode and Deploy mode. The proposed Tune mode is as stable as Eval mode for transfer learning, and its computational efficiency closely matches that of the Deploy mode. Through extensive experime",
    "link": "http://arxiv.org/abs/2305.11624",
    "context": "Title: Tune-Mode ConvBN Blocks For Efficient Transfer Learning. (arXiv:2305.11624v1 [cs.AI])\nAbstract: Convolution-BatchNorm (ConvBN) blocks are integral components in various computer vision tasks and other domains. A ConvBN block can operate in three modes: Train, Eval, and Deploy. While the Train mode is indispensable for training models from scratch, the Eval mode is suitable for transfer learning and model validation, and the Deploy mode is designed for the deployment of models. This paper focuses on the trade-off between stability and efficiency in ConvBN blocks: Deploy mode is efficient but suffers from training instability; Eval mode is widely used in transfer learning but lacks efficiency. To solve the dilemma, we theoretically reveal the reason behind the diminished training stability observed in the Deploy mode. Subsequently, we propose a novel Tune mode to bridge the gap between Eval mode and Deploy mode. The proposed Tune mode is as stable as Eval mode for transfer learning, and its computational efficiency closely matches that of the Deploy mode. Through extensive experime",
    "path": "papers/23/05/2305.11624.json",
    "total_tokens": 893,
    "translated_title": "为了有效的迁移学习而调整模式的ConvBN块",
    "translated_abstract": "卷积-批归一化（ConvBN）块是各种计算机视觉任务和其他领域的重要组成部分。ConvBN块可以在三种模式下运行：Train、Eval和Deploy。虽然Train模式对于从头开始训练模型是必不可少的，但Eval模式适用于迁移学习和模型验证，而Deploy模式则适用于模型部署。本文重点研究了ConvBN块中稳定性和效率之间的权衡：Deploy模式效率高但训练不稳定；Eval模式在迁移学习中应用广泛，但缺乏效率。为了解决这个难题，我们在理论上揭示了Deploy模式下稳定性下降的原因。随后，我们提出了一种新的Tune模式，以弥合Eval模式和Deploy模式之间的差距。所提出的Tune模式与Eval模式一样稳定，适用于迁移学习，而其计算效率与Deploy模式非常接近。通过大量实验，我们证明了Tune模式的有效性和优越性。",
    "tldr": "本文研究了ConvBN块中稳定性和效率之间的权衡问题，提出了一种新的Tune模式，以便在迁移学习中既能保持稳定性又能提高效率。",
    "en_tdlr": "This paper focused on the trade-off between stability and efficiency in ConvBN Blocks and proposed a new Tune mode for transfer learning that maintains stability and efficiency."
}