{
    "title": "An Intelligent SDWN Routing Algorithm Based on Network Situational Awareness and Deep Reinforcement Learning. (arXiv:2305.10441v1 [cs.NI])",
    "abstract": "Due to the highly dynamic changes in wireless network topologies, efficiently obtaining network status information and flexibly forwarding data to improve communication quality of service are important challenges. This article introduces an intelligent routing algorithm (DRL-PPONSA) based on proximal policy optimization deep reinforcement learning with network situational awareness under a software-defined wireless networking architecture. First, a specific data plane is designed for network topology construction and data forwarding. The control plane collects network traffic information, sends flow tables, and uses a GCN-GRU prediction mechanism to perceive future traffic change trends to achieve network situational awareness. Second, a DRL-based data forwarding mechanism is designed in the knowledge plane. The predicted network traffic matrix and topology information matrix are treated as the environment for DRL agents, while next-hop adjacent nodes are treated as executable actions.",
    "link": "http://arxiv.org/abs/2305.10441",
    "context": "Title: An Intelligent SDWN Routing Algorithm Based on Network Situational Awareness and Deep Reinforcement Learning. (arXiv:2305.10441v1 [cs.NI])\nAbstract: Due to the highly dynamic changes in wireless network topologies, efficiently obtaining network status information and flexibly forwarding data to improve communication quality of service are important challenges. This article introduces an intelligent routing algorithm (DRL-PPONSA) based on proximal policy optimization deep reinforcement learning with network situational awareness under a software-defined wireless networking architecture. First, a specific data plane is designed for network topology construction and data forwarding. The control plane collects network traffic information, sends flow tables, and uses a GCN-GRU prediction mechanism to perceive future traffic change trends to achieve network situational awareness. Second, a DRL-based data forwarding mechanism is designed in the knowledge plane. The predicted network traffic matrix and topology information matrix are treated as the environment for DRL agents, while next-hop adjacent nodes are treated as executable actions.",
    "path": "papers/23/05/2305.10441.json",
    "total_tokens": 917,
    "translated_title": "基于网络态势感知和深度强化学习的智能SDWN路由算法",
    "translated_abstract": "针对无线网络拓扑高度动态变化的问题，高效获取网络状态信息、灵活转发数据以提高通信服务质量成为了重要挑战。本文介绍了一种基于软件定义无线网络架构下、具有网络态势感知的近似策略优化深度强化学习的智能路由算法（DRL-PPONSA）。首先，为网络拓扑构建和数据转发设计了一个特定的数据平面。控制平面收集网络流量信息，发送流量表，并使用GCN-GRU预测机制感知未来流量变化趋势，以实现网络态势感知。其次，在知识平面中设计了一种基于DRL的数据转发机制，预测的网络流量矩阵和拓扑信息矩阵被视为DRL代理的环境，而下一跳相邻节点则被视为可执行动作。",
    "tldr": "本文介绍了一种智能路由算法（DRL-PPONSA），基于软件定义无线网络架构下、具有网络态势感知的近似策略优化深度强化学习，通过一个特定的数据平面和一个基于DRL的数据转发机制，实现了高效获取网络状态信息、灵活转发数据，以提高通信服务质量。",
    "en_tdlr": "This paper introduces an intelligent routing algorithm (DRL-PPONSA) based on software-defined wireless networking architecture with network situational awareness and proximal policy optimization deep reinforcement learning, which efficiently obtains network status information and flexibly forwards data to improve communication quality of service through a specific data plane and a DRL-based data forwarding mechanism."
}