{
    "title": "Emotion Recognition for Challenged People Facial Appearance in Social using Neural Network. (arXiv:2305.06842v1 [cs.CV])",
    "abstract": "Human communication is the vocal and non verbal signal to communicate with others. Human expression is a significant biometric object in picture and record databases of surveillance systems. Face appreciation has a serious role in biometric methods and is good-looking for plentiful applications, including visual scrutiny and security. Facial expressions are a form of nonverbal communication; recognizing them helps improve the human machine interaction. This paper proposes an idea for face and enlightenment invariant credit of facial expressions by the images. In order on, the person's face can be computed. Face expression is used in CNN classifier to categorize the acquired picture into different emotion categories. It is a deep, feed-forward artificial neural network. Outcome surpasses human presentation and shows poses alternate performance. Varying lighting conditions can influence the fitting process and reduce recognition precision. Results illustrate that dependable facial appear",
    "link": "http://arxiv.org/abs/2305.06842",
    "context": "Title: Emotion Recognition for Challenged People Facial Appearance in Social using Neural Network. (arXiv:2305.06842v1 [cs.CV])\nAbstract: Human communication is the vocal and non verbal signal to communicate with others. Human expression is a significant biometric object in picture and record databases of surveillance systems. Face appreciation has a serious role in biometric methods and is good-looking for plentiful applications, including visual scrutiny and security. Facial expressions are a form of nonverbal communication; recognizing them helps improve the human machine interaction. This paper proposes an idea for face and enlightenment invariant credit of facial expressions by the images. In order on, the person's face can be computed. Face expression is used in CNN classifier to categorize the acquired picture into different emotion categories. It is a deep, feed-forward artificial neural network. Outcome surpasses human presentation and shows poses alternate performance. Varying lighting conditions can influence the fitting process and reduce recognition precision. Results illustrate that dependable facial appear",
    "path": "papers/23/05/2305.06842.json",
    "total_tokens": 853,
    "translated_title": "面向社交场合的神经网络情感识别对于受挑战群体的面部外观",
    "translated_abstract": "人类交流是通过语音和非语言信号与他人交流。人的表情是图像和监控系统记录数据库中重要的生物识别对象。面部表情在生物识别方法中具有重要作用，并且对于包括视觉审查和安全在内的许多应用非常有吸引力。表情是一种非语言交流形式；识别它们有助于提高人机交互性能。本文提出了一种通过图像实现面部表情和照明不变的识别方法。首先，可以计算出人的面部。然后使用CNN分类器将获取的图片分类到不同的情感类别中。这是一个深度的前馈人工神经网络。结果表明，该方法的表现超越了人类表现，并且表现出稳健的性能。不同的照明条件可能会影响拟合过程并降低识别精度。结果表明面部出现是可靠的。",
    "tldr": "本文提出了一种通过神经网络识别受挑战群体面部表情及照明不变的方法。实验结果表明，该方法的表现超越了人类表现，并且具有稳健的性能。",
    "en_tdlr": "This paper proposes a neural network method for recognizing facial expressions and invariant illumination for challenged people. The experimental results show that the performance of the method exceeds human performance and has robustness."
}