{
    "title": "SummIt: Iterative Text Summarization via ChatGPT. (arXiv:2305.14835v2 [cs.CL] UPDATED)",
    "abstract": "Text summarization systems have made significant progress in recent years, but typically generate summaries in one single step. However, the one-shot summarization setting is sometimes inadequate, as the generated summary may contain hallucinations or overlook essential details related to the reader's interests. This paper addresses this limitation by proposing SummIt, an iterative text summarization framework based on large language models like ChatGPT. Our framework enables the model to refine the generated summary iteratively through self-evaluation and feedback, resembling humans' iterative process when drafting and revising summaries. Furthermore, we explore the potential benefits of integrating knowledge and topic extractors into the framework to enhance summary faithfulness and controllability. We automatically evaluate the performance of our framework on three benchmark summarization datasets. We also conduct a human evaluation to validate the effectiveness of the iterative ref",
    "link": "http://arxiv.org/abs/2305.14835",
    "context": "Title: SummIt: Iterative Text Summarization via ChatGPT. (arXiv:2305.14835v2 [cs.CL] UPDATED)\nAbstract: Text summarization systems have made significant progress in recent years, but typically generate summaries in one single step. However, the one-shot summarization setting is sometimes inadequate, as the generated summary may contain hallucinations or overlook essential details related to the reader's interests. This paper addresses this limitation by proposing SummIt, an iterative text summarization framework based on large language models like ChatGPT. Our framework enables the model to refine the generated summary iteratively through self-evaluation and feedback, resembling humans' iterative process when drafting and revising summaries. Furthermore, we explore the potential benefits of integrating knowledge and topic extractors into the framework to enhance summary faithfulness and controllability. We automatically evaluate the performance of our framework on three benchmark summarization datasets. We also conduct a human evaluation to validate the effectiveness of the iterative ref",
    "path": "papers/23/05/2305.14835.json",
    "total_tokens": 895,
    "translated_title": "SummIt：通过ChatGPT进行迭代文本摘要",
    "translated_abstract": "最近几年，文本摘要系统取得了显著进展，但通常是在一个步骤中生成摘要。然而，一次性生成摘要的设置有时是不够的，因为生成的摘要可能包含虚构的内容，或者忽略了与读者兴趣相关的重要细节。本文通过提出SummIt，基于ChatGPT等大型语言模型的迭代文本摘要框架来解决这个限制。我们的框架通过自我评估和反馈使模型能够迭代地完善生成的摘要，类似于人类在起草和修订摘要时的迭代过程。此外，我们还探索了将知识和主题提取器整合到框架中以增强摘要的准确性和可控性的潜在好处。我们在三个基准摘要数据集上自动评估了框架的性能。我们还进行了人类评估，验证了迭代改进的有效性。",
    "tldr": "本文提出了SummIt，一个基于ChatGPT的迭代文本摘要框架，通过自我评估和反馈，模型能够迭代地完善生成的摘要，解决了一次性生成摘要可能存在的虚构和遗漏关键细节的问题。",
    "en_tdlr": "SummIt is an iterative text summarization framework based on ChatGPT, which addresses the limitations of one-shot summarization by refining the generated summary iteratively through self-evaluation and feedback. It aims to overcome issues of hallucinations and overlooking essential details related to the reader's interests."
}