{
    "title": "OTIEA:Ontology-enhanced Triple Intrinsic-Correlation for Cross-lingual Entity Alignment. (arXiv:2305.01561v1 [cs.CL])",
    "abstract": "Cross-lingual and cross-domain knowledge alignment without sufficient external resources is a fundamental and crucial task for fusing irregular data. As the element-wise fusion process aiming to discover equivalent objects from different knowledge graphs (KGs), entity alignment (EA) has been attracting great interest from industry and academic research recent years. Most of existing EA methods usually explore the correlation between entities and relations through neighbor nodes, structural information and external resources. However, the complex intrinsic interactions among triple elements and role information are rarely modeled in these methods, which may lead to the inadequate illustration for triple. In addition, external resources are usually unavailable in some scenarios especially cross-lingual and cross-domain applications, which reflects the little scalability of these methods. To tackle the above insufficiency, a novel universal EA framework (OTIEA) based on ontology pair and ",
    "link": "http://arxiv.org/abs/2305.01561",
    "context": "Title: OTIEA:Ontology-enhanced Triple Intrinsic-Correlation for Cross-lingual Entity Alignment. (arXiv:2305.01561v1 [cs.CL])\nAbstract: Cross-lingual and cross-domain knowledge alignment without sufficient external resources is a fundamental and crucial task for fusing irregular data. As the element-wise fusion process aiming to discover equivalent objects from different knowledge graphs (KGs), entity alignment (EA) has been attracting great interest from industry and academic research recent years. Most of existing EA methods usually explore the correlation between entities and relations through neighbor nodes, structural information and external resources. However, the complex intrinsic interactions among triple elements and role information are rarely modeled in these methods, which may lead to the inadequate illustration for triple. In addition, external resources are usually unavailable in some scenarios especially cross-lingual and cross-domain applications, which reflects the little scalability of these methods. To tackle the above insufficiency, a novel universal EA framework (OTIEA) based on ontology pair and ",
    "path": "papers/23/05/2305.01561.json",
    "total_tokens": 901,
    "translated_title": "OTIEA: 基于本体增强的三元内部相关性用于跨语言实体对齐",
    "translated_abstract": "在没有足够外部资源的情况下进行跨语言和跨领域知识对齐是融合不规则数据的基本和关键任务。实体对齐（EA）作为逐元素融合过程旨在从不同的知识图谱（KGs）中发现等价的对象，近年来在行业和学术界引起了极大的兴趣。现有的大多数EA方法通常通过邻节点、结构信息和外部资源来探索实体和关系之间的相关性。然而，这些方法中很少模拟三元素之间的复杂内在交互和角色信息，这可能导致三元素的不充分说明。此外，在某些场景中，外部资源通常不可用，特别是跨语言和跨领域应用，这反映了这些方法的可扩展性不足。为了解决上述不足，提出了一种基于本体对和三元素内部交互关系的新型通用EA框架（OTIEA）。",
    "tldr": "本研究提出了一种基于本体对和三元素内部交互关系的新型通用EA框架（OTIEA），能够解决目前EA方法中模拟三元素内部交互和考虑可扩展性不足的问题。",
    "en_tdlr": "This paper proposes a novel universal EA framework (OTIEA) based on ontology pair and internal interaction among triple elements, which addresses the issues of inadequate modelling of intrinsic interactions among triple elements and scalability in existing EA methods."
}