{
    "title": "Quantum Convolutional Neural Networks for Multi-Channel Supervised Learning. (arXiv:2305.18961v1 [quant-ph])",
    "abstract": "As the rapidly evolving field of machine learning continues to produce incredibly useful tools and models, the potential for quantum computing to provide speed up for machine learning algorithms is becoming increasingly desirable. In particular, quantum circuits in place of classical convolutional filters for image detection-based tasks are being investigated for the ability to exploit quantum advantage. However, these attempts, referred to as quantum convolutional neural networks (QCNNs), lack the ability to efficiently process data with multiple channels and therefore are limited to relatively simple inputs. In this work, we present a variety of hardware-adaptable quantum circuit ansatzes for use as convolutional kernels, and demonstrate that the quantum neural networks we report outperform existing QCNNs on classification tasks involving multi-channel data. We envision that the ability of these implementations to effectively learn inter-channel information will allow quantum machine",
    "link": "http://arxiv.org/abs/2305.18961",
    "context": "Title: Quantum Convolutional Neural Networks for Multi-Channel Supervised Learning. (arXiv:2305.18961v1 [quant-ph])\nAbstract: As the rapidly evolving field of machine learning continues to produce incredibly useful tools and models, the potential for quantum computing to provide speed up for machine learning algorithms is becoming increasingly desirable. In particular, quantum circuits in place of classical convolutional filters for image detection-based tasks are being investigated for the ability to exploit quantum advantage. However, these attempts, referred to as quantum convolutional neural networks (QCNNs), lack the ability to efficiently process data with multiple channels and therefore are limited to relatively simple inputs. In this work, we present a variety of hardware-adaptable quantum circuit ansatzes for use as convolutional kernels, and demonstrate that the quantum neural networks we report outperform existing QCNNs on classification tasks involving multi-channel data. We envision that the ability of these implementations to effectively learn inter-channel information will allow quantum machine",
    "path": "papers/23/05/2305.18961.json",
    "total_tokens": 863,
    "translated_title": "多通道监督学习的量子卷积神经网络",
    "translated_abstract": "随着机器学习领域的快速发展，制造出非常有用的工具和模型，量子计算为机器学习算法提供加速的潜力正在日益受到重视。特别是，研究用于基于图像检测任务的量子电路取代经典卷积滤波器以利用量子优势的尝试，称为量子卷积神经网络（QCNNs）。然而，这些尝试缺乏处理具有多个通道的数据的能力，因此只适用于相对简单的输入。在这项工作中，我们提出了多种硬件适应性的量子电路ansatzes用作卷积核，并证明我们报告的量子神经网络在涉及多通道数据的分类任务中优于现有的QCNNs。我们预计，这些实现有效学习通道间信息的能力将允许量子机器学习在处理现实任务时获得重大突破。",
    "tldr": "本文介绍了多通道监督学习的量子卷积神经网络，通过硬件适应性的量子电路ansatzes用作卷积核，能够有效学习通道间信息，优于现有的QCNNs。",
    "en_tdlr": "The paper proposes a quantum convolutional neural network(QCNN) for multi-channel supervised learning, which surpasses the existing QCNNs on tasks involving multi-channel data by using various hardware-adaptable quantum circuit ansatzes as convolutional kernels."
}