{
    "title": "A Lightweight Domain Adversarial Neural Network Based on Knowledge Distillation for EEG-based Cross-subject Emotion Recognition. (arXiv:2305.07446v1 [eess.SP])",
    "abstract": "Individual differences of Electroencephalogram (EEG) could cause the domain shift which would significantly degrade the performance of cross-subject strategy. The domain adversarial neural networks (DANN), where the classification loss and domain loss jointly update the parameters of feature extractor, are adopted to deal with the domain shift. However, limited EEG data quantity and strong individual difference are challenges for the DANN with cumbersome feature extractor. In this work, we propose knowledge distillation (KD) based lightweight DANN to enhance cross-subject EEG-based emotion recognition. Specifically, the teacher model with strong context learning ability is utilized to learn complex temporal dynamics and spatial correlations of EEG, and robust lightweight student model is guided by the teacher model to learn more difficult domain-invariant features. In the feature-based KD framework, a transformer-based hierarchical temporalspatial learning model is served as the teache",
    "link": "http://arxiv.org/abs/2305.07446",
    "context": "Title: A Lightweight Domain Adversarial Neural Network Based on Knowledge Distillation for EEG-based Cross-subject Emotion Recognition. (arXiv:2305.07446v1 [eess.SP])\nAbstract: Individual differences of Electroencephalogram (EEG) could cause the domain shift which would significantly degrade the performance of cross-subject strategy. The domain adversarial neural networks (DANN), where the classification loss and domain loss jointly update the parameters of feature extractor, are adopted to deal with the domain shift. However, limited EEG data quantity and strong individual difference are challenges for the DANN with cumbersome feature extractor. In this work, we propose knowledge distillation (KD) based lightweight DANN to enhance cross-subject EEG-based emotion recognition. Specifically, the teacher model with strong context learning ability is utilized to learn complex temporal dynamics and spatial correlations of EEG, and robust lightweight student model is guided by the teacher model to learn more difficult domain-invariant features. In the feature-based KD framework, a transformer-based hierarchical temporalspatial learning model is served as the teache",
    "path": "papers/23/05/2305.07446.json",
    "total_tokens": 798,
    "translated_title": "基于知识蒸馏的轻量级领域对抗神经网络用于基于EEG的跨主体情绪识别",
    "translated_abstract": "个体差异会导致跨主体情绪识别中的领域偏移，影响性能，本研究基于知识蒸馏提出轻量级领域对抗神经网络，利用教师模型学习复杂的EEG时空动态和空间关联，指导学生模型学习更具挑战性的领域不变特征，在特征学习中采用基于转换器的分层时空学习模型作为教师。",
    "tldr": "本研究提出了一种基于知识蒸馏的轻量级领域对抗神经网络来提升基于EEG的跨主体情绪识别。教师模型学习复杂的EEG特征，指导学生模型学习更挑战的领域不变特征。",
    "en_tdlr": "This study proposes a knowledge distillation-based lightweight domain adversarial neural network to enhance cross-subject EEG-based emotion recognition. A teacher model learns complex EEG features and guides a student model to learn more challenging domain-invariant features."
}