{
    "title": "Multi-source adversarial transfer learning based on similar source domains with local features. (arXiv:2305.19067v2 [cs.CV] UPDATED)",
    "abstract": "Transfer learning leverages knowledge from other domains and has been successful in many applications. Transfer learning methods rely on the overall similarity of the source and target domains. However, in some cases, it is impossible to provide an overall similar source domain, and only some source domains with similar local features can be provided. Can transfer learning be achieved? In this regard, we propose a multi-source adversarial transfer learning method based on local feature similarity to the source domain to handle transfer scenarios where the source and target domains have only local similarities. This method extracts transferable local features between a single source domain and the target domain through a sub-network. Specifically, the feature extractor of the sub-network is induced by the domain discriminator to learn transferable knowledge between the source domain and the target domain. The extracted features are then weighted by an attention module to suppress non-tr",
    "link": "http://arxiv.org/abs/2305.19067",
    "context": "Title: Multi-source adversarial transfer learning based on similar source domains with local features. (arXiv:2305.19067v2 [cs.CV] UPDATED)\nAbstract: Transfer learning leverages knowledge from other domains and has been successful in many applications. Transfer learning methods rely on the overall similarity of the source and target domains. However, in some cases, it is impossible to provide an overall similar source domain, and only some source domains with similar local features can be provided. Can transfer learning be achieved? In this regard, we propose a multi-source adversarial transfer learning method based on local feature similarity to the source domain to handle transfer scenarios where the source and target domains have only local similarities. This method extracts transferable local features between a single source domain and the target domain through a sub-network. Specifically, the feature extractor of the sub-network is induced by the domain discriminator to learn transferable knowledge between the source domain and the target domain. The extracted features are then weighted by an attention module to suppress non-tr",
    "path": "papers/23/05/2305.19067.json",
    "total_tokens": 915,
    "translated_title": "基于相似局部特征的多源对抗迁移学习",
    "translated_abstract": "迁移学习利用其他领域的知识，在许多应用中取得了成功。迁移学习方法依赖于源域和目标域的整体相似性。然而，在某些情况下，很难提供一个整体相似的源域，只能提供一些具有相似局部特征的源域。那么，能否实现迁移学习？在这方面，我们提出了一种基于局部特征相似性的多源对抗迁移学习方法，用于处理源域和目标域仅具有局部相似性的迁移场景。该方法通过子网络提取单个源域和目标域之间的可迁移局部特征。具体而言，子网络的特征提取器由域判别器引导，学习源域和目标域之间的可迁移知识。然后，使用注意力模块对提取的特征进行加权，以抑制非相关特征。",
    "tldr": "本论文提出一种基于局部特征相似性的多源对抗迁移学习方法，用于处理源域和目标域仅具有局部相似性的迁移场景。通过子网络提取可迁移局部特征，并使用注意力模块对特征进行加权处理以抑制非相关特征。",
    "en_tdlr": "This paper proposes a multi-source adversarial transfer learning method based on local feature similarity to handle transfer scenarios where the source and target domains have only local similarities. It extracts transferable local features between a single source domain and the target domain through a sub-network, and weights the extracted features by an attention module to suppress non-related features."
}