{
    "title": "Deep Learning and Geometric Deep Learning: an introduction for mathematicians and physicists. (arXiv:2305.05601v1 [cs.LG])",
    "abstract": "In this expository paper we want to give a brief introduction, with few key references for further reading, to the inner functioning of the new and successfull algorithms of Deep Learning and Geometric Deep Learning with a focus on Graph Neural Networks. We go over the key ingredients for these algorithms: the score and loss function and we explain the main steps for the training of a model. We do not aim to give a complete and exhaustive treatment, but we isolate few concepts to give a fast introduction to the subject. We provide some appendices to complement our treatment discussing Kullback-Leibler divergence, regression, Multi-layer Perceptrons and the Universal Approximation Theorem.",
    "link": "http://arxiv.org/abs/2305.05601",
    "context": "Title: Deep Learning and Geometric Deep Learning: an introduction for mathematicians and physicists. (arXiv:2305.05601v1 [cs.LG])\nAbstract: In this expository paper we want to give a brief introduction, with few key references for further reading, to the inner functioning of the new and successfull algorithms of Deep Learning and Geometric Deep Learning with a focus on Graph Neural Networks. We go over the key ingredients for these algorithms: the score and loss function and we explain the main steps for the training of a model. We do not aim to give a complete and exhaustive treatment, but we isolate few concepts to give a fast introduction to the subject. We provide some appendices to complement our treatment discussing Kullback-Leibler divergence, regression, Multi-layer Perceptrons and the Universal Approximation Theorem.",
    "path": "papers/23/05/2305.05601.json",
    "total_tokens": 753,
    "translated_title": "深度学习与几何深度学习：数学家和物理学家的介绍。",
    "translated_abstract": "在本文中，我们为了让读者进一步了解深度学习和几何深度学习，重点介绍了图神经网络。我们介绍了这些算法的关键要素：得分和损失函数，并解释了模型训练的主要步骤。我们不打算提供完整和详尽的论述，但我们会引入几个概念，以便快速介绍该主题。我们提供一些附录，讨论了KL散度，回归，多层感知机和通用逼近定理来补充我们的讨论。",
    "tldr": "本文重点介绍了图神经网络在深度学习和几何深度学习中的关键要素：得分和损失函数，并解释了模型训练的主要步骤。",
    "en_tdlr": "This paper provides a brief introduction to the inner workings of Deep Learning and Geometric Deep Learning algorithms, with a focus on Graph Neural Networks. The key ingredients, such as score and loss functions, and the main steps for model training are explained. The paper aims to give a fast introduction to the subject and includes appendices discussing related topics such as KL divergence, regression, and the Universal Approximation Theorem."
}