{
    "title": "JetSeg: Efficient Real-Time Semantic Segmentation Model for Low-Power GPU-Embedded Systems. (arXiv:2305.11419v1 [cs.CV])",
    "abstract": "Real-time semantic segmentation is a challenging task that requires high-accuracy models with low-inference times. Implementing these models on embedded systems is limited by hardware capability and memory usage, which produces bottlenecks. We propose an efficient model for real-time semantic segmentation called JetSeg, consisting of an encoder called JetNet, and an improved RegSeg decoder. The JetNet is designed for GPU-Embedded Systems and includes two main components: a new light-weight efficient block called JetBlock, that reduces the number of parameters minimizing memory usage and inference time without sacrificing accuracy; a new strategy that involves the combination of asymmetric and non-asymmetric convolutions with depthwise-dilated convolutions called JetConv, a channel shuffle operation, light-weight activation functions, and a convenient number of group convolutions for embedded systems, and an innovative loss function named JetLoss, which integrates the Precision, Recall,",
    "link": "http://arxiv.org/abs/2305.11419",
    "context": "Title: JetSeg: Efficient Real-Time Semantic Segmentation Model for Low-Power GPU-Embedded Systems. (arXiv:2305.11419v1 [cs.CV])\nAbstract: Real-time semantic segmentation is a challenging task that requires high-accuracy models with low-inference times. Implementing these models on embedded systems is limited by hardware capability and memory usage, which produces bottlenecks. We propose an efficient model for real-time semantic segmentation called JetSeg, consisting of an encoder called JetNet, and an improved RegSeg decoder. The JetNet is designed for GPU-Embedded Systems and includes two main components: a new light-weight efficient block called JetBlock, that reduces the number of parameters minimizing memory usage and inference time without sacrificing accuracy; a new strategy that involves the combination of asymmetric and non-asymmetric convolutions with depthwise-dilated convolutions called JetConv, a channel shuffle operation, light-weight activation functions, and a convenient number of group convolutions for embedded systems, and an innovative loss function named JetLoss, which integrates the Precision, Recall,",
    "path": "papers/23/05/2305.11419.json",
    "total_tokens": 1138,
    "translated_title": "JetSeg: 低功耗GPU嵌入式系统的高效实时语义分割模型",
    "translated_abstract": "实时语义分割是一项具有挑战性的任务，需要精准和具有低推理时间的模型。在嵌入式系统上实现这些模型受到硬件能力和内存使用的限制，导致了瓶颈。我们提出了一种名为JetSeg的实时语义分割高效模型，由一个称为JetNet的编码器和一个改进的RegSeg解码器组成。JetNet专为GPU嵌入式系统设计，并包括两个主要组件：一个称为JetBlock的新型轻量级高效块，通过减少参数数量来最小化内存使用和推理时间，而不会牺牲准确性；一种称为JetConv 的新策略，它结合了不对称和非对称卷积、深度空洞卷积、通道混洗操作、轻量级激活函数和适用于嵌入式系统的方便数量的组卷积，并引入一种创新的损失函数JetLoss，它集成了精确度、召回率和F1分值。实验结果表明，JetSeg在保持高精度的同时，明显减少了内存使用量和推理时间，并优于最先进的模型。",
    "tldr": "JetSeg是一个专为GPU-嵌入式系统设计的高效实时语义分割模型，通过新型的轻量级高效块JetBlock和结合了不对称和非对称卷积、深度空洞卷积、通道混洗操作、轻量级激活函数和适用于嵌入式系统的方便数量的组卷积的策略JetConv以及创新的损失函数JetLoss，在保持高精度的同时，明显减少了内存使用量和推理时间，优于最先进的模型。"
}