{
    "title": "Effects of Real-Life Traffic Sign Alteration on YOLOv7- an Object Recognition Model. (arXiv:2305.05499v1 [cs.CV])",
    "abstract": "The advancement of Image Processing has led to the widespread use of Object Recognition (OR) models in various applications, such as airport security and mail sorting. These models have become essential in signifying the capabilities of AI and supporting vital services like national postal operations. However, the performance of OR models can be impeded by real-life scenarios, such as traffic sign alteration. Therefore, this research investigates the effects of altered traffic signs on the accuracy and performance of object recognition models. To this end, a publicly available dataset was used to create different types of traffic sign alterations, including changes to size, shape, color, visibility, and angles. The impact of these alterations on the YOLOv7 (You Only Look Once) model's detection and classification abilities were analyzed. It reveals that the accuracy of object detection models decreases significantly when exposed to modified traffic signs under unlikely conditions. This",
    "link": "http://arxiv.org/abs/2305.05499",
    "context": "Title: Effects of Real-Life Traffic Sign Alteration on YOLOv7- an Object Recognition Model. (arXiv:2305.05499v1 [cs.CV])\nAbstract: The advancement of Image Processing has led to the widespread use of Object Recognition (OR) models in various applications, such as airport security and mail sorting. These models have become essential in signifying the capabilities of AI and supporting vital services like national postal operations. However, the performance of OR models can be impeded by real-life scenarios, such as traffic sign alteration. Therefore, this research investigates the effects of altered traffic signs on the accuracy and performance of object recognition models. To this end, a publicly available dataset was used to create different types of traffic sign alterations, including changes to size, shape, color, visibility, and angles. The impact of these alterations on the YOLOv7 (You Only Look Once) model's detection and classification abilities were analyzed. It reveals that the accuracy of object detection models decreases significantly when exposed to modified traffic signs under unlikely conditions. This",
    "path": "papers/23/05/2305.05499.json",
    "total_tokens": 867,
    "translated_title": "实际交通标志改变对YOLOv7-目标识别模型的影响",
    "translated_abstract": "图像处理技术的进步导致了物体识别(OR)模型在各种应用中的广泛使用，如机场安全和邮件分拣。这些模型已成为AI能力的标志，并支持着国家邮政运营等重要服务。然而，OR模型的性能可能会受到现实场景的影响，例如交通标志改变。因此，本研究调查了改变后的交通标志对目标识别模型准确性和性能的影响。为此，使用公开数据集创建了不同类型的交通标志修改，包括大小、形状、颜色、可见性和角度的改变，并分析这些修改对YOLOv7 (You Only Look Once)模型的检测和分类能力的影响。结果表明，当暴露于不太可能的条件下修改后的交通标志时，物体检测模型的准确率显著降低。",
    "tldr": "本研究调查了改变后的交通标志对目标识别模型准确性和性能的影响，结果表明当暴露于不太可能的条件下修改后的交通标志时，物体检测模型的准确率显著降低。",
    "en_tdlr": "This study investigates the effects of altered traffic signs on the accuracy and performance of object recognition models, revealing that the accuracy of object detection models decreases significantly when exposed to modified traffic signs under unlikely conditions."
}