{
    "title": "Differentiating Viral and Bacterial Infections: A Machine Learning Model Based on Routine Blood Test Values. (arXiv:2305.07877v1 [cs.LG])",
    "abstract": "The growing threat of antibiotic resistance necessitates accurate differentiation between bacterial and viral infections for proper antibiotic administration. In this study, a Virus vs. Bacteria machine learning model was developed to discern between these infection types using 16 routine blood test results, C-reactive protein levels, biological sex, and age. With a dataset of 44,120 cases from a single medical center, the Virus vs. Bacteria model demonstrated remarkable accuracy of 82.2%, a Brier score of 0.129, and an area under the ROC curve of 0.91, surpassing the performance of traditional CRP decision rule models. The model demonstrates substantially improved accuracy within the CRP range of 10 40 mg/L, an interval in which CRP alone offers limited diagnostic value for distinguishing between bacterial and viral infections. These findings underscore the importance of considering multiple blood parameters for diagnostic decision-making and suggest that the Virus vs. Bacteria model ",
    "link": "http://arxiv.org/abs/2305.07877",
    "context": "Title: Differentiating Viral and Bacterial Infections: A Machine Learning Model Based on Routine Blood Test Values. (arXiv:2305.07877v1 [cs.LG])\nAbstract: The growing threat of antibiotic resistance necessitates accurate differentiation between bacterial and viral infections for proper antibiotic administration. In this study, a Virus vs. Bacteria machine learning model was developed to discern between these infection types using 16 routine blood test results, C-reactive protein levels, biological sex, and age. With a dataset of 44,120 cases from a single medical center, the Virus vs. Bacteria model demonstrated remarkable accuracy of 82.2%, a Brier score of 0.129, and an area under the ROC curve of 0.91, surpassing the performance of traditional CRP decision rule models. The model demonstrates substantially improved accuracy within the CRP range of 10 40 mg/L, an interval in which CRP alone offers limited diagnostic value for distinguishing between bacterial and viral infections. These findings underscore the importance of considering multiple blood parameters for diagnostic decision-making and suggest that the Virus vs. Bacteria model ",
    "path": "papers/23/05/2305.07877.json",
    "total_tokens": 1051,
    "translated_title": "基于例行血液检查数值的机器学习模型鉴别病毒和细菌感染。",
    "translated_abstract": "随着抗生素耐药性日益威胁，正确区分细菌和病毒感染以进行正确的抗生素使用变得越来越重要。本研究开发了一种基于16个例行血液检查结果、C-反应蛋白水平、生物性别和年龄的病毒与细菌机器学习模型，用于区分这些感染类型。使用单个医疗中心的44,120个案例数据集，\"病毒 vs. 细菌\"模型表现出令人瞩目的82.2%的准确率，0.129的Brier得分和0.91的ROC曲线下面积，超越了传统CRP决策规则模型的性能。该模型在CRP范围为10-40 mg/L时表现出显著的改进准确性，这个范围内仅靠CRP无法为细菌和病毒感染进行区分的诊断价值有限。这些发现强调了在诊断决策中考虑多种血液参数的重要性，并建议病毒 vs. 细菌模型使得应用于临床决策成为可能。",
    "tldr": "本研究开发了一种基于血液检查数值的病毒与细菌机器学习模型，用于准确识别感染类型。该模型在CRP水平10-40 mg/L范围内表现出更好的区分细菌和病毒感染的准确性，证明了多种血液参数对于诊断决策的重要性。"
}