{
    "title": "ChatGPT Perpetuates Gender Bias in Machine Translation and Ignores Non-Gendered Pronouns: Findings across Bengali and Five other Low-Resource Languages. (arXiv:2305.10510v1 [cs.CY])",
    "abstract": "In this multicultural age, language translation is one of the most performed tasks, and it is becoming increasingly AI-moderated and automated. As a novel AI system, ChatGPT claims to be proficient in such translation tasks and in this paper, we put that claim to the test. Specifically, we examine ChatGPT's accuracy in translating between English and languages that exclusively use gender-neutral pronouns. We center this study around Bengali, the 7$^{th}$ most spoken language globally, but also generalize our findings across five other languages: Farsi, Malay, Tagalog, Thai, and Turkish. We find that ChatGPT perpetuates gender defaults and stereotypes assigned to certain occupations (e.g. man = doctor, woman = nurse) or actions (e.g. woman = cook, man = go to work), as it converts gender-neutral pronouns in languages to `he' or `she'. We also observe ChatGPT completely failing to translate the English gender-neutral pronoun `they' into equivalent gender-neutral pronouns in other languag",
    "link": "http://arxiv.org/abs/2305.10510",
    "context": "Title: ChatGPT Perpetuates Gender Bias in Machine Translation and Ignores Non-Gendered Pronouns: Findings across Bengali and Five other Low-Resource Languages. (arXiv:2305.10510v1 [cs.CY])\nAbstract: In this multicultural age, language translation is one of the most performed tasks, and it is becoming increasingly AI-moderated and automated. As a novel AI system, ChatGPT claims to be proficient in such translation tasks and in this paper, we put that claim to the test. Specifically, we examine ChatGPT's accuracy in translating between English and languages that exclusively use gender-neutral pronouns. We center this study around Bengali, the 7$^{th}$ most spoken language globally, but also generalize our findings across five other languages: Farsi, Malay, Tagalog, Thai, and Turkish. We find that ChatGPT perpetuates gender defaults and stereotypes assigned to certain occupations (e.g. man = doctor, woman = nurse) or actions (e.g. woman = cook, man = go to work), as it converts gender-neutral pronouns in languages to `he' or `she'. We also observe ChatGPT completely failing to translate the English gender-neutral pronoun `they' into equivalent gender-neutral pronouns in other languag",
    "path": "papers/23/05/2305.10510.json",
    "total_tokens": 1042,
    "translated_title": "ChatGPT在六种低资源语言中延续性别偏见，忽略非性别代词",
    "translated_abstract": "在这个多元文化时代，语言翻译是最常见的任务之一，越来越多地由人工智能进行调节和自动化。作为一种新型的人工智能系统，ChatGPT声称在这样的翻译任务中表现出色，在本文中，我们对这一声明进行了测试。具体而言，我们考察了ChatGPT在英语和仅使用性别中立代词的语言之间进行翻译的准确性。我们以孟加拉语为中心进行了这项研究，孟加拉语是全球第七大使用语言，但我们还概括了我们在波斯语、马来语、塔加洛语、泰语和土耳其语等五种其他语言中的发现。我们发现，ChatGPT延续了对某些职业（例如男人=医生，女人=护士）或行动（女人=烹饪，男人=去工作）赋予性别默认值和刻板印象的偏见，因为它将语言中的性别中立代词转换为“他”或“她”。我们还观察到，ChatGPT完全无法将英语的性别中立代词“they”翻译为其他语言中相应的性别中立代词。",
    "tldr": "ChatGPT在翻译中延续性别偏见，忽略非性别代词，会将性别中立代词转换为男性或女性，甚至无法将英语中的性别中立代词翻译为其他语言的性别中立代词。",
    "en_tdlr": "ChatGPT perpetuates gender bias in translation and ignores non-gendered pronouns by converting them to male or female pronouns. The system also fails to translate the gender-neutral pronoun “they” into equivalent pronouns in other languages."
}