{
    "title": "Faithful Question Answering with Monte-Carlo Planning. (arXiv:2305.02556v1 [cs.CL])",
    "abstract": "Although large language models demonstrate remarkable question-answering performances, revealing the intermediate reasoning steps that the models faithfully follow remains challenging. In this paper, we propose FAME (FAithful question answering with MontE-carlo planning) to answer questions based on faithful reasoning steps. The reasoning steps are organized as a structured entailment tree, which shows how premises are used to produce intermediate conclusions that can prove the correctness of the answer. We formulate the task as a discrete decision-making problem and solve it through the interaction of a reasoning environment and a controller. The environment is modular and contains several basic task-oriented modules, while the controller proposes actions to assemble the modules. Since the search space could be large, we introduce a Monte-Carlo planning algorithm to do a look-ahead search and select actions that will eventually lead to high-quality steps. FAME achieves state-of-the-ar",
    "link": "http://arxiv.org/abs/2305.02556",
    "context": "Title: Faithful Question Answering with Monte-Carlo Planning. (arXiv:2305.02556v1 [cs.CL])\nAbstract: Although large language models demonstrate remarkable question-answering performances, revealing the intermediate reasoning steps that the models faithfully follow remains challenging. In this paper, we propose FAME (FAithful question answering with MontE-carlo planning) to answer questions based on faithful reasoning steps. The reasoning steps are organized as a structured entailment tree, which shows how premises are used to produce intermediate conclusions that can prove the correctness of the answer. We formulate the task as a discrete decision-making problem and solve it through the interaction of a reasoning environment and a controller. The environment is modular and contains several basic task-oriented modules, while the controller proposes actions to assemble the modules. Since the search space could be large, we introduce a Monte-Carlo planning algorithm to do a look-ahead search and select actions that will eventually lead to high-quality steps. FAME achieves state-of-the-ar",
    "path": "papers/23/05/2305.02556.json",
    "total_tokens": 994,
    "translated_title": "基于蒙特卡洛规划的忠实问答系统",
    "translated_abstract": "虽然大型语言模型在问答方面的表现令人瞩目，但如何展现模型忠实遵循的中间推理步骤仍具挑战性。本文提出了FAME（基于蒙特卡洛规划的忠实问答系统），以对忠实的推理步骤进行问答。推理步骤被组织为结构化蕴含树，它展示了前提如何被用于产生证明回答正确性的中间结论。我们将任务定义为离散决策问题，并通过推理环境和控制器的交互来解决它。环境是模块化的，并包含几个基本的任务导向模块，而控制器则提出操作来组装这些模块。由于搜索空间可能很大，我们引入了蒙特卡洛规划算法来进行向前搜索，并选择最终将导致高质量步骤的操作。FAME在DROP数据集上实现了最先进的性能，这是一个领域通用的问答基准，同时保持了忠实的推理步骤。",
    "tldr": "本文提出了基于蒙特卡洛规划的FAME问答系统，通过组织中间推理步骤作为结构化蕴含树来忠实回答问题。通过引入蒙特卡洛规划算法，FAME在保持忠实推理的同时，在领域通用的问答基准数据集上实现了最先进的性能。",
    "en_tdlr": "This paper proposes a faithful question answering system FAME based on Monte-Carlo planning, which organizes intermediate reasoning steps as a structured entailment tree. By introducing a Monte-Carlo planning algorithm, FAME achieves state-of-the-art performance on the domain-robust DROP dataset while maintaining faithful reasoning steps."
}