{
    "title": "What is mature and what is still emerging in the cryptocurrency market?. (arXiv:2305.05751v1 [q-fin.ST])",
    "abstract": "In relation to the traditional financial markets, the cryptocurrency market is a recent invention and the trading dynamics of all its components are readily recorded and stored. This fact opens up a unique opportunity to follow the multidimensional trajectory of its development since inception up to the present time. Several main characteristics commonly recognized as financial stylized facts of mature markets were quantitatively studied here. In particular, it is shown that the return distributions, volatility clustering effects, and even temporal multifractal correlations for a few highest-capitalization cryptocurrencies largely follow those of the well-established financial markets. The smaller cryptocurrencies are somewhat deficient in this regard, however. They are also not as highly cross-correlated among themselves and with other financial markets as the large cryptocurrencies. Quite generally, the volume V impact on price changes R appears to be much stronger on the cryptocurre",
    "link": "http://arxiv.org/abs/2305.05751",
    "context": "Title: What is mature and what is still emerging in the cryptocurrency market?. (arXiv:2305.05751v1 [q-fin.ST])\nAbstract: In relation to the traditional financial markets, the cryptocurrency market is a recent invention and the trading dynamics of all its components are readily recorded and stored. This fact opens up a unique opportunity to follow the multidimensional trajectory of its development since inception up to the present time. Several main characteristics commonly recognized as financial stylized facts of mature markets were quantitatively studied here. In particular, it is shown that the return distributions, volatility clustering effects, and even temporal multifractal correlations for a few highest-capitalization cryptocurrencies largely follow those of the well-established financial markets. The smaller cryptocurrencies are somewhat deficient in this regard, however. They are also not as highly cross-correlated among themselves and with other financial markets as the large cryptocurrencies. Quite generally, the volume V impact on price changes R appears to be much stronger on the cryptocurre",
    "path": "papers/23/05/2305.05751.json",
    "total_tokens": 1121,
    "translated_title": "加密货币市场的成熟和未来发展",
    "translated_abstract": "相对于传统金融市场，加密货币市场是一个新兴的发明，所有组成部分的交易动态均可以被记录和存储。这一事实为研究自其诞生以来至今的多维发展轨迹提供了独特的机会。本文定量研究了被普遍认为是成熟市场的金融特征的几个主要方面。特别是，本文表明，少数几种最高市值的加密货币的回报分布、波动率聚类效应，甚至是时间多分形相关性，基本上都遵循了成熟金融市场的相关规律。然而，小型加密货币在这方面略有不足。它们的相互纵向交叉相关性和与其他金融市场的相关性都不如大型加密货币。总的来说，交易量对于价格变化的影响在加密货币市场上似乎比传统金融市场更强烈。加密货币市场仍处于发展初期，仍然存在多个问题和挑战需要解决，如安全性、监管、可伸缩性和能源消耗等。因此，其未来仍然高度不确定，值得仔细监测和分析。",
    "tldr": "本文定量研究了被普遍认为是成熟市场的金融特征，发现少数几种最高市值的加密货币在回报分布、波动率聚类效应甚至是时间多分形相关性方面，基本上都遵循了成熟金融市场的相关规律。加密货币市场仍处于发展初期，存在多个问题和挑战需要解决，其未来仍然高度不确定。",
    "en_tdlr": "This paper quantitatively studied the financial characteristics commonly recognized as financial stylized facts of mature markets, and found that a few highest-capitalization cryptocurrencies largely follow those of the well-established financial markets. The cryptocurrency market is still emerging, with several open issues and challenges to be addressed, such as security, regulation, scalability, and energy consumption. Its future is still highly uncertain and deserves careful monitoring and analysis."
}