{
    "title": "Leveraging Semantic Relationships to Prioritise Indicators of Compromise in Additive Manufacturing Systems. (arXiv:2305.04102v1 [cs.CR])",
    "abstract": "Additive manufacturing (AM) offers numerous benefits, such as manufacturing complex and customised designs quickly and cost-effectively, reducing material waste, and enabling on-demand production. However, several security challenges are associated with AM, making it increasingly attractive to attackers ranging from individual hackers to organised criminal gangs and nation-state actors. This paper addresses the cyber risk in AM to attackers by proposing a novel semantic-based threat prioritisation system for identifying, extracting and ranking indicators of compromise (IOC). The system leverages the heterogeneous information networks (HINs) that automatically extract high-level IOCs from multi-source threat text and identifies semantic relations among the IOCs. It models IOCs with a HIN comprising different meta-paths and meta-graphs to depict semantic relations among diverse IOCs. We introduce a domain-specific recogniser that identifies IOCs in three domains: organisation-specific, r",
    "link": "http://arxiv.org/abs/2305.04102",
    "context": "Title: Leveraging Semantic Relationships to Prioritise Indicators of Compromise in Additive Manufacturing Systems. (arXiv:2305.04102v1 [cs.CR])\nAbstract: Additive manufacturing (AM) offers numerous benefits, such as manufacturing complex and customised designs quickly and cost-effectively, reducing material waste, and enabling on-demand production. However, several security challenges are associated with AM, making it increasingly attractive to attackers ranging from individual hackers to organised criminal gangs and nation-state actors. This paper addresses the cyber risk in AM to attackers by proposing a novel semantic-based threat prioritisation system for identifying, extracting and ranking indicators of compromise (IOC). The system leverages the heterogeneous information networks (HINs) that automatically extract high-level IOCs from multi-source threat text and identifies semantic relations among the IOCs. It models IOCs with a HIN comprising different meta-paths and meta-graphs to depict semantic relations among diverse IOCs. We introduce a domain-specific recogniser that identifies IOCs in three domains: organisation-specific, r",
    "path": "papers/23/05/2305.04102.json",
    "total_tokens": 919,
    "translated_title": "利用语义关系优先处理增材制造系统中的威胁指标",
    "translated_abstract": "增材制造（AM）具有许多优点，例如快速、成本有效地制造复杂和定制设计、减少材料浪费以及实现按需生产。然而，AM也带来了若干安全挑战，吸引了从个人黑客到有组织犯罪团伙和国家级行为者的攻击者。本文提出了一种新的基于语义的威胁优先级系统，以识别、提取和排名威胁指标（IOC）来解决AM中的网络安全风险。该系统利用异构信息网络（HIN），从多源威胁文本自动提取高级IOC，并识别IOC之间的语义关系。它用包含不同元路径和元图的HIN来建模IOC，以描述不同IOC之间的语义关系。我们引入了一个领域特定的识别器，用于在三个领域中识别IOC：组织特定的、AM工艺和材料特定的、以及特定于数据输入的。",
    "tldr": "本文提出了一种基于语义关系的威胁优先级系统，可用于识别、提取和排名增材制造系统中的威胁指标。",
    "en_tdlr": "This paper proposes a novel semantic-based threat prioritisation system for identifying, extracting and ranking indicators of compromise (IOC) in additive manufacturing (AM) systems, addressing the cyber risk posed by attackers. The system leverages heterogeneous information networks to automatically extract high-level IOCs from multi-source threat text and identify semantic relations among the IOCs. It models IOCs with a HIN comprising different meta-paths and meta-graphs to depict semantic relations among diverse IOCs."
}