{
    "title": "Provably Correct Physics-Informed Neural Networks. (arXiv:2305.10157v1 [cs.LG])",
    "abstract": "Recent work provides promising evidence that Physics-informed neural networks (PINN) can efficiently solve partial differential equations (PDE). However, previous works have failed to provide guarantees on the worst-case residual error of a PINN across the spatio-temporal domain - a measure akin to the tolerance of numerical solvers - focusing instead on point-wise comparisons between their solution and the ones obtained by a solver on a set of inputs. In real-world applications, one cannot consider tests on a finite set of points to be sufficient grounds for deployment, as the performance could be substantially worse on a different set. To alleviate this issue, we establish tolerance-based correctness conditions for PINNs over the entire input domain. To verify the extent to which they hold, we introduce $\\partial$-CROWN: a general, efficient and scalable post-training framework to bound PINN residual errors. We demonstrate its effectiveness in obtaining tight certificates by applying",
    "link": "http://arxiv.org/abs/2305.10157",
    "context": "Title: Provably Correct Physics-Informed Neural Networks. (arXiv:2305.10157v1 [cs.LG])\nAbstract: Recent work provides promising evidence that Physics-informed neural networks (PINN) can efficiently solve partial differential equations (PDE). However, previous works have failed to provide guarantees on the worst-case residual error of a PINN across the spatio-temporal domain - a measure akin to the tolerance of numerical solvers - focusing instead on point-wise comparisons between their solution and the ones obtained by a solver on a set of inputs. In real-world applications, one cannot consider tests on a finite set of points to be sufficient grounds for deployment, as the performance could be substantially worse on a different set. To alleviate this issue, we establish tolerance-based correctness conditions for PINNs over the entire input domain. To verify the extent to which they hold, we introduce $\\partial$-CROWN: a general, efficient and scalable post-training framework to bound PINN residual errors. We demonstrate its effectiveness in obtaining tight certificates by applying",
    "path": "papers/23/05/2305.10157.json",
    "total_tokens": 892,
    "translated_title": "证明正确性的物理知识神经网络",
    "translated_abstract": "最近的研究提供了有希望的证据表明，物理知识神经网络（PINN）可以高效地解决偏微分方程（PDE）。然而，以往的研究未能保证PINN在整个时空域内的最坏剩余误差，这是类似于数字求解器的公差的一种度量，而是集中于在一组输入上通过点对点比较来得到解决方案和求解器得到解决方案的结果。在实际应用中，不能认为在一组有限点上的测试就足以使得部署成立，因为在另一组点上性能可能大不相同。为了解决这个问题，我们建立了对整个输入域的PINN基于公差的正确性条件。为了验证它们的有效程度，我们介绍了$\\partial$-CROWN：一个通用的、高效的、可扩展的、后训练框架，用于限制PINN的剩余误差。我们演示了它在获得紧密证书方面的有效性。",
    "tldr": "该论文提出了一种名为$\\partial$-CROWN的框架，以保证物理知识神经网络（PINN）具有全局正确性的最坏剩余误差，并证明了该框架在获得有效证书方面的有效性。",
    "en_tdlr": "This paper proposes a framework called $\\partial$-CROWN to guarantee the worst-case residual error of Physics-informed neural networks (PINN) across the entire input domain, and demonstrates its effectiveness in obtaining tight certificates."
}