{
    "title": "A General Framework for Visualizing Embedding Spaces of Neural Survival Analysis Models Based on Angular Information. (arXiv:2305.06862v1 [stat.ML])",
    "abstract": "We propose a general framework for visualizing any intermediate embedding representation used by any neural survival analysis model. Our framework is based on so-called anchor directions in an embedding space. We show how to estimate these anchor directions using clustering or, alternatively, using user-supplied \"concepts\" defined by collections of raw inputs (e.g., feature vectors all from female patients could encode the concept \"female\"). For tabular data, we present visualization strategies that reveal how anchor directions relate to raw clinical features and to survival time distributions. We then show how these visualization ideas extend to handling raw inputs that are images. Our framework is built on looking at angles between vectors in an embedding space, where there could be \"information loss\" by ignoring magnitude information. We show how this loss results in a \"clumping\" artifact that appears in our visualizations, and how to reduce this information loss in practice.",
    "link": "http://arxiv.org/abs/2305.06862",
    "context": "Title: A General Framework for Visualizing Embedding Spaces of Neural Survival Analysis Models Based on Angular Information. (arXiv:2305.06862v1 [stat.ML])\nAbstract: We propose a general framework for visualizing any intermediate embedding representation used by any neural survival analysis model. Our framework is based on so-called anchor directions in an embedding space. We show how to estimate these anchor directions using clustering or, alternatively, using user-supplied \"concepts\" defined by collections of raw inputs (e.g., feature vectors all from female patients could encode the concept \"female\"). For tabular data, we present visualization strategies that reveal how anchor directions relate to raw clinical features and to survival time distributions. We then show how these visualization ideas extend to handling raw inputs that are images. Our framework is built on looking at angles between vectors in an embedding space, where there could be \"information loss\" by ignoring magnitude information. We show how this loss results in a \"clumping\" artifact that appears in our visualizations, and how to reduce this information loss in practice.",
    "path": "papers/23/05/2305.06862.json",
    "total_tokens": 963,
    "translated_title": "基于角度信息的神经生存分析模型嵌入空间可视化的通用框架",
    "translated_abstract": "我们提出了一个通用框架，用于可视化神经生存分析模型所使用的任何中间嵌入表示。我们的框架基于嵌入空间中的所谓锚定方向。我们展示了如何使用聚类或用户提供的“概念”来定义原始输入（例如，来自女性患者的特征向量可以编码“女性”概念）来估计这些锚定方向。对于表格数据，我们提供了可视化策略，以显示锚定方向与原始临床特征和生存时间分布之间的关系。然后，我们展示了这些可视化思想如何扩展到处理图像等原始输入。我们的框架是基于查看嵌入空间中向量之间的角度建立的，由于忽略了幅度信息而可能存在“信息丢失”，我们展示了在实践中如何减少这种信息丢失导致的“聚集”伪影。",
    "tldr": "本文提出了一种通用框架，可以可视化任何神经生存分析模型所使用的中间嵌入表示。该框架基于嵌入空间中的锚定方向，可用于表格数据和原始输入（例如图像）。本文说明了在一个基于角度信息的嵌入空间中存在的信息丢失问题，并提供了减少信息丢失的实用方法。",
    "en_tdlr": "This paper proposes a general framework for visualizing any intermediate embedding representation used by any neural survival analysis model. The framework is based on anchor directions in an embedding space, and can be applied to tabular data and raw inputs such as images. The paper discusses the issue of information loss in an embedding space based on angles and provides practical methods to reduce this loss."
}