{
    "title": "Background Knowledge Grounding for Readable, Relevant, and Factual Biomedical Lay Summaries. (arXiv:2305.02104v1 [cs.CL])",
    "abstract": "Communication of scientific findings to the public is important for keeping non-experts informed of developments such as life-saving medical treatments. However, generating readable lay summaries from scientific documents is challenging, and currently, these summaries suffer from critical factual errors. One popular intervention for improving factuality is using additional external knowledge to provide factual grounding. However, it is unclear how these grounding sources should be retrieved, selected, or integrated, and how supplementary grounding documents might affect the readability or relevance of the generated summaries. We develop a simple method for selecting grounding sources and integrating them with source documents. We then use the BioLaySum summarization dataset to evaluate the effects of different grounding sources on summary quality. We found that grounding source documents improves the relevance and readability of lay summaries but does not improve factuality of lay summ",
    "link": "http://arxiv.org/abs/2305.02104",
    "context": "Title: Background Knowledge Grounding for Readable, Relevant, and Factual Biomedical Lay Summaries. (arXiv:2305.02104v1 [cs.CL])\nAbstract: Communication of scientific findings to the public is important for keeping non-experts informed of developments such as life-saving medical treatments. However, generating readable lay summaries from scientific documents is challenging, and currently, these summaries suffer from critical factual errors. One popular intervention for improving factuality is using additional external knowledge to provide factual grounding. However, it is unclear how these grounding sources should be retrieved, selected, or integrated, and how supplementary grounding documents might affect the readability or relevance of the generated summaries. We develop a simple method for selecting grounding sources and integrating them with source documents. We then use the BioLaySum summarization dataset to evaluate the effects of different grounding sources on summary quality. We found that grounding source documents improves the relevance and readability of lay summaries but does not improve factuality of lay summ",
    "path": "papers/23/05/2305.02104.json",
    "total_tokens": 831,
    "translated_title": "可读性、相关性和事实准确性的生物医学普及摘要的背景知识展开",
    "translated_abstract": "向公众传播科学发现对于保持非专家了解紧急医疗治疗等发展是非常重要的。然而，从科学文档中生成可读的普及摘要是具有挑战性的，并且目前，这些摘要存在严重的事实错误。提高事实性的一种流行干预措施是使用其他外部知识来提供事实准确性。然而，目前尚不清楚如何检索、选择或整合这些背景知识，以及补充背景知识文档如何影响生成的摘要的可读性或相关性。我们开发了一种简单的方法来选择背景知识源，并将其与源文档集成。然后，我们使用BioLaySum汇总数据集来评估不同背景知识源对摘要质量的影响。我们发现，背景知识源文件可以提高普及摘要的相关性和可读性，但不能提高普及摘要的事实准确性。",
    "tldr": "使用背景知识源文件可以提高普及摘要的相关性和可读性，但不能提高其事实准确性。",
    "en_tdlr": "Using grounding source documents can improve the relevance and readability of lay summaries, but does not improve their factual accuracy."
}