{
    "title": "Uncovering and Categorizing Social Biases in Text-to-SQL. (arXiv:2305.16253v2 [cs.CL] UPDATED)",
    "abstract": "Content Warning: This work contains examples that potentially implicate stereotypes, associations, and other harms that could be offensive to individuals in certain social groups.} Large pre-trained language models are acknowledged to carry social biases towards different demographics, which can further amplify existing stereotypes in our society and cause even more harm. Text-to-SQL is an important task, models of which are mainly adopted by administrative industries, where unfair decisions may lead to catastrophic consequences. However, existing Text-to-SQL models are trained on clean, neutral datasets, such as Spider and WikiSQL. This, to some extent, cover up social bias in models under ideal conditions, which nevertheless may emerge in real application scenarios. In this work, we aim to uncover and categorize social biases in Text-to-SQL models. We summarize the categories of social biases that may occur in structured data for Text-to-SQL models. We build test benchmarks and revea",
    "link": "http://arxiv.org/abs/2305.16253",
    "context": "Title: Uncovering and Categorizing Social Biases in Text-to-SQL. (arXiv:2305.16253v2 [cs.CL] UPDATED)\nAbstract: Content Warning: This work contains examples that potentially implicate stereotypes, associations, and other harms that could be offensive to individuals in certain social groups.} Large pre-trained language models are acknowledged to carry social biases towards different demographics, which can further amplify existing stereotypes in our society and cause even more harm. Text-to-SQL is an important task, models of which are mainly adopted by administrative industries, where unfair decisions may lead to catastrophic consequences. However, existing Text-to-SQL models are trained on clean, neutral datasets, such as Spider and WikiSQL. This, to some extent, cover up social bias in models under ideal conditions, which nevertheless may emerge in real application scenarios. In this work, we aim to uncover and categorize social biases in Text-to-SQL models. We summarize the categories of social biases that may occur in structured data for Text-to-SQL models. We build test benchmarks and revea",
    "path": "papers/23/05/2305.16253.json",
    "total_tokens": 742,
    "translated_title": "揭示和分类Text-to-SQL中的社会偏见",
    "translated_abstract": "本文对Text-to-SQL模型中的社会偏见进行了探讨和分类，揭示了传统的数据集可能在现实应用中掩盖了模型的社会偏见。同时，本文提出了一种简单而有效的数据增强方法，以弥补偏见数据，并提高了模型在偏见数据上的性能。",
    "tldr": "本文揭示和分类了Text-to-SQL模型中的社会偏见，并提出了一种数据增强方法来弥补偏见数据的影响，提高模型的性能。",
    "en_tdlr": "This paper uncovers and categorizes social biases in Text-to-SQL models and proposes a data augmentation method to counteract biased data and improve model performance, which is a step towards developing fairer Text-to-SQL models that account for the complexity of social biases in society."
}