{
    "title": "Aligning Optimization Trajectories with Diffusion Models for Constrained Design Generation. (arXiv:2305.18470v1 [cs.LG])",
    "abstract": "Generative models have had a profound impact on vision and language, paving the way for a new era of multimodal generative applications. While these successes have inspired researchers to explore using generative models in science and engineering to accelerate the design process and reduce the reliance on iterative optimization, challenges remain. Specifically, engineering optimization methods based on physics still outperform generative models when dealing with constrained environments where data is scarce and precision is paramount. To address these challenges, we introduce Diffusion Optimization Models (DOM) and Trajectory Alignment (TA), a learning framework that demonstrates the efficacy of aligning the sampling trajectory of diffusion models with the optimization trajectory derived from traditional physics-based methods. This alignment ensures that the sampling process remains grounded in the underlying physical principles. Our method allows for generating feasible and high-perfo",
    "link": "http://arxiv.org/abs/2305.18470",
    "context": "Title: Aligning Optimization Trajectories with Diffusion Models for Constrained Design Generation. (arXiv:2305.18470v1 [cs.LG])\nAbstract: Generative models have had a profound impact on vision and language, paving the way for a new era of multimodal generative applications. While these successes have inspired researchers to explore using generative models in science and engineering to accelerate the design process and reduce the reliance on iterative optimization, challenges remain. Specifically, engineering optimization methods based on physics still outperform generative models when dealing with constrained environments where data is scarce and precision is paramount. To address these challenges, we introduce Diffusion Optimization Models (DOM) and Trajectory Alignment (TA), a learning framework that demonstrates the efficacy of aligning the sampling trajectory of diffusion models with the optimization trajectory derived from traditional physics-based methods. This alignment ensures that the sampling process remains grounded in the underlying physical principles. Our method allows for generating feasible and high-perfo",
    "path": "papers/23/05/2305.18470.json",
    "total_tokens": 872,
    "tldr": "本文提出了Diffusion Optimization Models (DOM)和Trajectory Alignment (TA)学习框架，将扩散模型的采样轨迹与基于物理学的传统优化方法的优化轨迹对齐，以在受限设计生成中实现优化。"
}