{
    "title": "Physics-informed Convolutional Recurrent Surrogate Model for Reservoir Simulation with Well Controls. (arXiv:2305.09056v1 [cs.LG])",
    "abstract": "This paper presents a novel surrogate model for modeling subsurface fluid flow with well controls using a physics-informed convolutional recurrent neural network (PICRNN). The model uses a convolutional long-short term memory (ConvLSTM) to capture the spatiotemporal dependencies of the state evolution dynamics in the porous flow. The ConvLSTM is linked to the state space equations, enabling the incorporation of a discrete-time sequence of well control. The model requires initial state condition and a sequence of well controls as inputs, and predicts the state variables of the system, such as pressure, as output. By minimizing the residuals of reservoir flow state-space equations, the network is trained without the need for labeled data. The model is designed to serve as a surrogate model for predicting future reservoir states based on the initial reservoir state and input engineering controls. Boundary conditions are enforced into the state-space equations so no additional loss term is",
    "link": "http://arxiv.org/abs/2305.09056",
    "context": "Title: Physics-informed Convolutional Recurrent Surrogate Model for Reservoir Simulation with Well Controls. (arXiv:2305.09056v1 [cs.LG])\nAbstract: This paper presents a novel surrogate model for modeling subsurface fluid flow with well controls using a physics-informed convolutional recurrent neural network (PICRNN). The model uses a convolutional long-short term memory (ConvLSTM) to capture the spatiotemporal dependencies of the state evolution dynamics in the porous flow. The ConvLSTM is linked to the state space equations, enabling the incorporation of a discrete-time sequence of well control. The model requires initial state condition and a sequence of well controls as inputs, and predicts the state variables of the system, such as pressure, as output. By minimizing the residuals of reservoir flow state-space equations, the network is trained without the need for labeled data. The model is designed to serve as a surrogate model for predicting future reservoir states based on the initial reservoir state and input engineering controls. Boundary conditions are enforced into the state-space equations so no additional loss term is",
    "path": "papers/23/05/2305.09056.json",
    "total_tokens": 965,
    "translated_title": "物理信息卷积循环替代模型在带井控制下的油藏模拟中的应用",
    "translated_abstract": "本文提出了一种新颖的替代模型，使用基于物理信息的卷积循环神经网络(PICRNN)模拟井控制下的地下流体流动。该模型利用卷积长短期记忆(ConvLSTM)来捕捉多孔流体状态演变动态的时空依赖性。ConvLSTM与状态空间方程相连，使得离散时间序列井控信号能够被纳入模型。该模型需要输入初始状态条件和井控序列，并以输出状态变量（如压力）作为输出。通过最小化油藏流体状态-空间方程的残差，网络能够在无需标记数据的情况下进行训练。该模型的设计旨在用作预测未来油藏状态的替代模型，基于初始油藏状态和输入的控制工程。在状态空间方程中强制边界条件，因此不需要额外的损耗项来确保模型的物理一致性。",
    "tldr": "本文提出了一种利用物理信息卷积循环神经网络来模拟井控制下地下多孔介质流体流动的替代模型。该模型不需要标记数据进行训练，并且能够预测出未来的油藏状态，具有广泛的应用前景。",
    "en_tdlr": "This paper proposes a physics-informed convolutional recurrent neural network surrogate model for simulating subsurface fluid flow with well controls. By incorporating a ConvLSTM with state space equations, the model predicts future reservoir states based on initial conditions and input engineering controls without requiring labeled data. It has potential applications in predicting future reservoir states in the oil and gas industry."
}