{
    "title": "A network community detection method with integration of data from multiple layers and node attributes. (arXiv:2305.13012v1 [physics.soc-ph])",
    "abstract": "Multilayer networks are in the focus of the current complex network study. In such networks multiple types of links may exist as well as many attributes for nodes. To fully use multilayer -- and other types of complex networks in applications, the merging of various data with topological information renders a powerful analysis. First, we suggest a simple way of representing network data in a data matrix where rows correspond to the nodes, and columns correspond to the data items. The number of columns is allowed to be arbitrary, so that the data matrix can be easily expanded by adding columns. The data matrix can be chosen according to targets of the analysis, and may vary a lot from case to case. Next, we partition the rows of the data matrix into communities using a method which allows maximal compression of the data matrix. For compressing a data matrix, we suggest to extend so called regular decomposition method for non-square matrices. We illustrate our method for several types of",
    "link": "http://arxiv.org/abs/2305.13012",
    "context": "Title: A network community detection method with integration of data from multiple layers and node attributes. (arXiv:2305.13012v1 [physics.soc-ph])\nAbstract: Multilayer networks are in the focus of the current complex network study. In such networks multiple types of links may exist as well as many attributes for nodes. To fully use multilayer -- and other types of complex networks in applications, the merging of various data with topological information renders a powerful analysis. First, we suggest a simple way of representing network data in a data matrix where rows correspond to the nodes, and columns correspond to the data items. The number of columns is allowed to be arbitrary, so that the data matrix can be easily expanded by adding columns. The data matrix can be chosen according to targets of the analysis, and may vary a lot from case to case. Next, we partition the rows of the data matrix into communities using a method which allows maximal compression of the data matrix. For compressing a data matrix, we suggest to extend so called regular decomposition method for non-square matrices. We illustrate our method for several types of",
    "path": "papers/23/05/2305.13012.json",
    "total_tokens": 1189,
    "translated_title": "一种具有多层数据和节点属性整合的网络社区检测方法",
    "translated_abstract": "多层网络是当前复杂网络研究的热点。在这样的网络中，可能存在多种类型的链接以及许多节点属性。为了充分利用多层和其他类型的复杂网络应用，将各种数据与拓扑信息相结合，可以进行强大的分析。我们首先提出一种简单的方式，将网络数据表示为数据矩阵，其中行对应节点，列对应数据项。列数可以任意选择，因此可以通过添加列轻松扩展数据矩阵。数据矩阵可以根据分析目标选择，并且在不同情况下可能会有很大不同。接下来，我们使用一种允许数据矩阵最大压缩的方法将数据矩阵的行分成社区。为了压缩数据矩阵，我们建议扩展所谓的非方阵的常规分解方法。我们为几种具体情况说明了我们的方法。",
    "tldr": "该论文介绍了一种利用多层数据和节点属性整合的网络社区检测方法，并提出将网络数据表示为数据矩阵的简单方式。该方法可根据分析目标选择数据矩阵，并使用一种压缩数据矩阵的方法将其行分成社区，从而进行强大的分析。",
    "en_tdlr": "The paper presents a network community detection method with integration of data from multiple layers and node attributes. A simple way of representing network data in a data matrix is proposed, with the matrix partitioned into communities using a method which allows maximal compression. This method allows for powerful analysis of complex networks."
}