{
    "title": "Cognitive Reframing of Negative Thoughts through Human-Language Model Interaction. (arXiv:2305.02466v1 [cs.CL])",
    "abstract": "A proven therapeutic technique to overcome negative thoughts is to replace them with a more hopeful \"reframed thought.\" Although therapy can help people practice and learn this Cognitive Reframing of Negative Thoughts, clinician shortages and mental health stigma commonly limit people's access to therapy. In this paper, we conduct a human-centered study of how language models may assist people in reframing negative thoughts. Based on psychology literature, we define a framework of seven linguistic attributes that can be used to reframe a thought. We develop automated metrics to measure these attributes and validate them with expert judgements from mental health practitioners. We collect a dataset of 600 situations, thoughts and reframes from practitioners and use it to train a retrieval-enhanced in-context learning model that effectively generates reframed thoughts and controls their linguistic attributes. To investigate what constitutes a \"high-quality\" reframe, we conduct an IRB-appr",
    "link": "http://arxiv.org/abs/2305.02466",
    "context": "Title: Cognitive Reframing of Negative Thoughts through Human-Language Model Interaction. (arXiv:2305.02466v1 [cs.CL])\nAbstract: A proven therapeutic technique to overcome negative thoughts is to replace them with a more hopeful \"reframed thought.\" Although therapy can help people practice and learn this Cognitive Reframing of Negative Thoughts, clinician shortages and mental health stigma commonly limit people's access to therapy. In this paper, we conduct a human-centered study of how language models may assist people in reframing negative thoughts. Based on psychology literature, we define a framework of seven linguistic attributes that can be used to reframe a thought. We develop automated metrics to measure these attributes and validate them with expert judgements from mental health practitioners. We collect a dataset of 600 situations, thoughts and reframes from practitioners and use it to train a retrieval-enhanced in-context learning model that effectively generates reframed thoughts and controls their linguistic attributes. To investigate what constitutes a \"high-quality\" reframe, we conduct an IRB-appr",
    "path": "papers/23/05/2305.02466.json",
    "total_tokens": 1126,
    "translated_title": "通过人类语言模型交互的负面思维认知重构",
    "translated_abstract": "克服负面思想的一种有效疗法是用更有希望的“重构思想”取而代之。虽然治疗可以帮助人们练习和学习认知重构负面思想，但临床医生短缺和心理健康的污名化通常会限制人们接受治疗。本文通过人类中心的方法研究如何语言模型可以帮助人们重构负面思想。我们基于心理学文献，定义了七个可以用来重构思想的语言属性框架。我们开发了自动化指标来衡量这些属性，并通过心理健康从业者的专家判断进行验证。我们收集了从从业者收集的 600 种情境、思想和重构数据集，并用它来训练一个检索增强的上下文学习模型，有效地生成重新构思和控制它们的语言属性。为了调查“高质量”重构的构成，我们进行了一个由IRB批准的用户研究，将参与者分配到“模型辅助重构”或控制条件。我们发现使用模型辅助的参与者更有可能产生符合七个语言属性的重构思想，表明我们的模型成功地帮助人们重构负面思想。",
    "tldr": "本文研究如何使用语言模型帮助人们重构负面思想，定义了七个用于重构思想的语言属性框架，并开发了自动化指标。实验发现使用模型辅助的参与者更有可能产生符合七个语言属性的重构思想，表明该模型在帮助人们重构负面思想上是成功的。",
    "en_tdlr": "This paper investigates how language models can assist people in reframing negative thoughts, defines a framework of seven linguistic attributes for reframing, and develops automated metrics. Experimental results show that participants assisted by the model are more likely to generate reframed thoughts that conform to the seven linguistic attributes, indicating a successful approach for helping people reframe negative thoughts."
}