{
    "title": "Well-being policy evaluation methodology based on WE pluralism. (arXiv:2305.04500v1 [econ.GN])",
    "abstract": "Methodologies for evaluating and selecting policies that contribute to the well-being of diverse populations need clarification. To bridge the gap between objective indicators and policies related to well-being, this study shifts from constitutive pluralism based on objective indicators to conceptual pluralism that emphasizes subjective context, develops from subject-object pluralism through individual-group pluralism to WE pluralism, and presents a new policy evaluation method that combines joint fact-finding based on policy plurality. First, to evaluate policies involving diverse stakeholders, I develop from individual subjectivity-objectivity to individual subjectivity and group intersubjectivity, and then move to a narrow-wide WE pluralism in the gradation of I-family-community-municipality-nation-world. Additionally, by referring to some functional forms of well-being, I formulate the dependence of well-being on narrow-wide WE. Finally, given that policies themselves have a plural",
    "link": "http://arxiv.org/abs/2305.04500",
    "context": "Title: Well-being policy evaluation methodology based on WE pluralism. (arXiv:2305.04500v1 [econ.GN])\nAbstract: Methodologies for evaluating and selecting policies that contribute to the well-being of diverse populations need clarification. To bridge the gap between objective indicators and policies related to well-being, this study shifts from constitutive pluralism based on objective indicators to conceptual pluralism that emphasizes subjective context, develops from subject-object pluralism through individual-group pluralism to WE pluralism, and presents a new policy evaluation method that combines joint fact-finding based on policy plurality. First, to evaluate policies involving diverse stakeholders, I develop from individual subjectivity-objectivity to individual subjectivity and group intersubjectivity, and then move to a narrow-wide WE pluralism in the gradation of I-family-community-municipality-nation-world. Additionally, by referring to some functional forms of well-being, I formulate the dependence of well-being on narrow-wide WE. Finally, given that policies themselves have a plural",
    "path": "papers/23/05/2305.04500.json",
    "total_tokens": 974,
    "translated_title": "基于WE多元论的幸福政策评估方法学",
    "translated_abstract": "评估和选择有助于不同人群福祉的政策的方法需要澄清。为了缩小客观指标和与福祉相关的政策之间的差距，本研究从基于客观指标的组成多元论转向强调主观背景的概念多元论，并由主客体多元论发展到个体-群体多元论，最终达到了WE多元论，并提出了一种结合基于政策多元性的联合事实查明的新的政策评估方法。其次，为了评估涉及多方利益相关者的政策，我从个体主客性到个体主观性和群体互为客体性进行了深入发掘，然后在个体-家庭-社区-市政府-国家-世界的层次上进行了窄范围和广范围的WE多元论分析。此外，参考了一些关于福祉的功能形式，我还提出了福祉依赖于窄范围和广范围的WE。最后，考虑到政策本身具有多元性，本研究使用联合事实查明来评估政策的多元性并评估其对福祉的影响。",
    "tldr": "本研究提出了一种基于WE多元论的幸福政策评估方法，通过联合事实查明评估政策的多元性，评估其对福祉的影响。",
    "en_tdlr": "This study proposes a well-being policy evaluation method based on WE pluralism, which evaluates the pluralism of policies through joint fact-finding and their effects on well-being, shifting from constitutive pluralism based on objective indicators to conceptual pluralism that emphasizes subjective context."
}