{
    "title": "Knowledge Base Question Answering for Space Debris Queries. (arXiv:2305.19734v1 [cs.AI])",
    "abstract": "Space agencies execute complex satellite operations that need to be supported by the technical knowledge contained in their extensive information systems. Knowledge bases (KB) are an effective way of storing and accessing such information at scale. In this work we present a system, developed for the European Space Agency (ESA), that can answer complex natural language queries, to support engineers in accessing the information contained in a KB that models the orbital space debris environment. Our system is based on a pipeline which first generates a sequence of basic database operations, called a %program sketch, from a natural language question, then specializes the sketch into a concrete query program with mentions of entities, attributes and relations, and finally executes the program against the database. This pipeline decomposition approach enables us to train the system by leveraging out-of-domain data and semi-synthetic data generated by GPT-3, thus reducing overfitting and shor",
    "link": "http://arxiv.org/abs/2305.19734",
    "context": "Title: Knowledge Base Question Answering for Space Debris Queries. (arXiv:2305.19734v1 [cs.AI])\nAbstract: Space agencies execute complex satellite operations that need to be supported by the technical knowledge contained in their extensive information systems. Knowledge bases (KB) are an effective way of storing and accessing such information at scale. In this work we present a system, developed for the European Space Agency (ESA), that can answer complex natural language queries, to support engineers in accessing the information contained in a KB that models the orbital space debris environment. Our system is based on a pipeline which first generates a sequence of basic database operations, called a %program sketch, from a natural language question, then specializes the sketch into a concrete query program with mentions of entities, attributes and relations, and finally executes the program against the database. This pipeline decomposition approach enables us to train the system by leveraging out-of-domain data and semi-synthetic data generated by GPT-3, thus reducing overfitting and shor",
    "path": "papers/23/05/2305.19734.json",
    "total_tokens": 815,
    "translated_title": "基于知识库的太空碎片问答系统",
    "translated_abstract": "太空机构执行复杂的卫星操作，需要在其广泛的信息系统中存储和访问技术知识。知识库是以规模存储和访问此类信息的有效方式。本文中，我们介绍了一个为欧洲空间局（ESA）开发的系统，该系统可以回答复杂的自然语言查询，以支持工程师访问模拟轨道太空碎片环境的知识库中的信息。我们的系统基于一种管道流程，首先从自然语言问题生成一系列基本数据库操作，称为“程序草图”，然后将草图转换为具体的查询程序，包括实体、属性和关系的提及，最后针对数据库执行程序。这种流程分解方法使我们能够通过利用域外数据和由GPT-3生成的半合成数据来训练系统，从而减少过度拟合和漏洞。",
    "tldr": "本文介绍了一个基于知识库的系统，可以回答复杂自然语言的查询，支持工程师访问太空碎片环境的知识库中的信息。",
    "en_tdlr": "This paper presents a knowledge-based system that can answer complex natural language queries, supporting engineers in accessing the information contained in a knowledge base modeling the orbital space debris environment."
}