{
    "title": "Taxonomy of AISecOps Threat Modeling for Cloud Based Medical Chatbots. (arXiv:2305.11189v1 [cs.DC])",
    "abstract": "Artificial Intelligence (AI) is playing a vital role in all aspects of technology including cyber security. Application of Conversational AI like the chatbots are also becoming very popular in the medical field to provide timely and immediate medical assistance to patients in need. As medical chatbots deal with a lot of sensitive information, the security of these chatbots is crucial. To secure the confidentiality, integrity, and availability of cloud-hosted assets like these, medical chatbots can be monitored using AISecOps (Artificial Intelligence for Secure IT Operations). AISecOPs is an emerging field that integrates three different but interrelated domains like the IT operation, AI, and security as one domain, where the expertise from all these three domains are used cohesively to secure the cyber assets. It considers cloud operations and security in a holistic framework to collect the metrics required to assess the security threats and train the AI models to take immediate action",
    "link": "http://arxiv.org/abs/2305.11189",
    "context": "Title: Taxonomy of AISecOps Threat Modeling for Cloud Based Medical Chatbots. (arXiv:2305.11189v1 [cs.DC])\nAbstract: Artificial Intelligence (AI) is playing a vital role in all aspects of technology including cyber security. Application of Conversational AI like the chatbots are also becoming very popular in the medical field to provide timely and immediate medical assistance to patients in need. As medical chatbots deal with a lot of sensitive information, the security of these chatbots is crucial. To secure the confidentiality, integrity, and availability of cloud-hosted assets like these, medical chatbots can be monitored using AISecOps (Artificial Intelligence for Secure IT Operations). AISecOPs is an emerging field that integrates three different but interrelated domains like the IT operation, AI, and security as one domain, where the expertise from all these three domains are used cohesively to secure the cyber assets. It considers cloud operations and security in a holistic framework to collect the metrics required to assess the security threats and train the AI models to take immediate action",
    "path": "papers/23/05/2305.11189.json",
    "total_tokens": 969,
    "translated_title": "云医疗聊天机器人的 AISecOps 威胁建模分类",
    "translated_abstract": "人工智能在技术的各个方面都扮演着至关重要的角色，包括网络安全。医疗领域中越来越流行的聊天机器人等交互式人工智能应用程序，为需要及时获得医疗援助的患者提供方便。由于医疗聊天机器人涉及大量的敏感信息，因此这些机器人的安全性至关重要。为了确保云主机资产的机密性，完整性和可用性，可以使用 AISecOps（为安全 IT 运营而设计的人工智能）对医疗聊天机器人进行监控。 AISecOps 是一个新兴的领域，将 IT 运营，人工智能和安全三个不同但密切相关的领域整合为一个域，在此域中，来自这三个领域的专业知识被协同使用以保护网络安全资产。它考虑到云操作和安全性因素，采用综合框架收集评估安全威胁所需的度量标准，并训练 AI 模型以立即采取行动。",
    "tldr": "这篇论文介绍了使用 AISecOps 对云医疗聊天机器人进行监控的方法，解释了 AISecOps 是如何将 IT 运营、人工智能和安全三个领域整合起来协同运作以确保聊天机器人的机密性、完整性和可用性的。",
    "en_tdlr": "This paper introduces a method for monitoring cloud-based medical chatbots using AISecOps, which integrates IT operations, artificial intelligence, and security to ensure the confidentiality, integrity, and availability of chatbots."
}