{
    "title": "AWFSD: Accelerated Wirtinger Flow with Score-based Diffusion Image Prior for Poisson-Gaussian Holographic Phase Retrieval. (arXiv:2305.07712v1 [eess.SP])",
    "abstract": "Phase retrieval (PR) is an essential problem in a number of coherent imaging systems. This work aims at resolving the holographic phase retrieval problem in real world scenarios where the measurements are corrupted by a mixture of Poisson and Gaussian (PG) noise that stems from optical imaging systems. To solve this problem, we develop a novel algorithm based on Accelerated Wirtinger Flow that uses Score-based Diffusion models as the generative prior (AWFSD). In particular, we frame the PR problem as an optimization task that involves both a data fidelity term and a regularization term. We derive the gradient of the PG log-likelihood function along with its corresponding Lipschitz constant, ensuring a more accurate data consistency term for practical measurements. We introduce a generative prior as part of our regularization approach by using a score-based diffusion model to capture (the gradient of) the image prior distribution. We provide theoretical analysis that establishes a criti",
    "link": "http://arxiv.org/abs/2305.07712",
    "context": "Title: AWFSD: Accelerated Wirtinger Flow with Score-based Diffusion Image Prior for Poisson-Gaussian Holographic Phase Retrieval. (arXiv:2305.07712v1 [eess.SP])\nAbstract: Phase retrieval (PR) is an essential problem in a number of coherent imaging systems. This work aims at resolving the holographic phase retrieval problem in real world scenarios where the measurements are corrupted by a mixture of Poisson and Gaussian (PG) noise that stems from optical imaging systems. To solve this problem, we develop a novel algorithm based on Accelerated Wirtinger Flow that uses Score-based Diffusion models as the generative prior (AWFSD). In particular, we frame the PR problem as an optimization task that involves both a data fidelity term and a regularization term. We derive the gradient of the PG log-likelihood function along with its corresponding Lipschitz constant, ensuring a more accurate data consistency term for practical measurements. We introduce a generative prior as part of our regularization approach by using a score-based diffusion model to capture (the gradient of) the image prior distribution. We provide theoretical analysis that establishes a criti",
    "path": "papers/23/05/2305.07712.json",
    "total_tokens": 1028,
    "translated_title": "AWFSD:基于评分扩散图像先验的加速Wirtinger流用于泊松高斯全息相位恢复问题",
    "translated_abstract": "相位恢复是许多相干成像系统中的一个重要问题。本文旨在解决在实际场景中，由光学成像系统引起的测量数据被混合的泊松和高斯噪声（PG噪声）所破坏的全息相位恢复问题。为了解决这个问题，我们开发了一种基于加速Wirtinger流的新算法，使用评分扩散模型作为生成先验（AWFSD）。特别地，我们将相位恢复问题构建为一个包含数据适配项和正则化项的优化任务。我们导出了PG对数似然函数的梯度及其相应的Lipschitz常数，从而保证实际测量的更准确的数据一致性项。我们通过使用评分扩散模型来捕获（梯度）图像先验分布，将生成先验作为我们正则化方法的一部分引入。我们提供了理论分析，建立了所提出的生成先验与图像相位信息之间的关键联系，并展示了它相对于现有方法的卓越性能。",
    "tldr": "本文提出了一种名为AWFSD的算法，它基于评分扩散模型作为生成先验，用于解决在实际场景中，由光学成像系统引起的测量数据被混合的泊松和高斯噪声（PG噪声）所破坏的全息相位恢复问题，并且比现有方法具有更优的性能。",
    "en_tdlr": "This paper proposes an algorithm called AWFSD based on score-based diffusion models as the generative prior for solving the holographic phase retrieval problem in real-world scenarios with mixed Poisson and Gaussian (PG) noise, and shows superior performance over existing methods."
}