{
    "title": "A statistical approach to detect sensitive features in a group fairness setting. (arXiv:2305.06994v1 [cs.LG])",
    "abstract": "The use of machine learning models in decision support systems with high societal impact raised concerns about unfair (disparate) results for different groups of people. When evaluating such unfair decisions, one generally relies on predefined groups that are determined by a set of features that are considered sensitive. However, such an approach is subjective and does not guarantee that these features are the only ones to be considered as sensitive nor that they entail unfair (disparate) outcomes.  In this paper, we propose a preprocessing step to address the task of automatically recognizing sensitive features that does not require a trained model to verify unfair results. Our proposal is based on the Hilber-Schmidt independence criterion, which measures the statistical dependence of variable distributions. We hypothesize that if the dependence between the label vector and a candidate is high for a sensitive feature, then the information provided by this feature will entail disparate",
    "link": "http://arxiv.org/abs/2305.06994",
    "context": "Title: A statistical approach to detect sensitive features in a group fairness setting. (arXiv:2305.06994v1 [cs.LG])\nAbstract: The use of machine learning models in decision support systems with high societal impact raised concerns about unfair (disparate) results for different groups of people. When evaluating such unfair decisions, one generally relies on predefined groups that are determined by a set of features that are considered sensitive. However, such an approach is subjective and does not guarantee that these features are the only ones to be considered as sensitive nor that they entail unfair (disparate) outcomes.  In this paper, we propose a preprocessing step to address the task of automatically recognizing sensitive features that does not require a trained model to verify unfair results. Our proposal is based on the Hilber-Schmidt independence criterion, which measures the statistical dependence of variable distributions. We hypothesize that if the dependence between the label vector and a candidate is high for a sensitive feature, then the information provided by this feature will entail disparate",
    "path": "papers/23/05/2305.06994.json",
    "total_tokens": 875,
    "translated_title": "在群体公平设置中检测敏感特征的统计方法",
    "translated_abstract": "机器学习模型在决策支持系统中的高社会影响应用引起了对于不同人群之间不公平（不一致）结果的担忧。当评估这样的不公平决策时，通常会依赖于由一组特征确定的预定义群体，这些特征被视为敏感。然而，这种方法是主观的，不能保证这些特征是唯一需要考虑的敏感特征，也不能保证它们会导致不公平（不一致）的结果。在本文中，我们提出了一种预处理步骤来自动识别敏感特征，而不需要训练模型来验证不公平的结果。我们的提议基于希尔伯特-施密特独立性准则，该准则衡量变量分布的统计依赖性。我们假设，如果敏感特征与标签向量之间的依赖性很高，那么这个特征提供的信息将导致不一致的结果。",
    "tldr": "本文提出了一种使用希尔伯特-施密特独立性准则的预处理步骤来自动识别敏感特征的方法，以应对高社会影响决策支持系统中的不公平结果问题。",
    "en_tdlr": "The paper presents a preprocessing step using the Hilber-Schmidt independence criterion to automatically recognize sensitive features, thus addressing unfair outcomes in decision support systems with high societal impact."
}