{
    "title": "Ensemble Learning for CME Arrival Time Prediction. (arXiv:2305.00258v1 [astro-ph.SR])",
    "abstract": "The Sun constantly releases radiation and plasma into the heliosphere. Sporadically, the Sun launches solar eruptions such as flares and coronal mass ejections (CMEs). CMEs carry away a huge amount of mass and magnetic flux with them. An Earth-directed CME can cause serious consequences to the human system. It can destroy power grids/pipelines, satellites, and communications. Therefore, accurately monitoring and predicting CMEs is important to minimize damages to the human system. In this study we propose an ensemble learning approach, named CMETNet, for predicting the arrival time of CMEs from the Sun to the Earth. We collect and integrate eruptive events from two solar cycles, #23 and #24, from 1996 to 2021 with a total of 363 geoeffective CMEs. The data used for making predictions include CME features, solar wind parameters and CME images obtained from the SOHO/LASCO C2 coronagraph. Our ensemble learning framework comprises regression algorithms for numerical data analysis and a con",
    "link": "http://arxiv.org/abs/2305.00258",
    "context": "Title: Ensemble Learning for CME Arrival Time Prediction. (arXiv:2305.00258v1 [astro-ph.SR])\nAbstract: The Sun constantly releases radiation and plasma into the heliosphere. Sporadically, the Sun launches solar eruptions such as flares and coronal mass ejections (CMEs). CMEs carry away a huge amount of mass and magnetic flux with them. An Earth-directed CME can cause serious consequences to the human system. It can destroy power grids/pipelines, satellites, and communications. Therefore, accurately monitoring and predicting CMEs is important to minimize damages to the human system. In this study we propose an ensemble learning approach, named CMETNet, for predicting the arrival time of CMEs from the Sun to the Earth. We collect and integrate eruptive events from two solar cycles, #23 and #24, from 1996 to 2021 with a total of 363 geoeffective CMEs. The data used for making predictions include CME features, solar wind parameters and CME images obtained from the SOHO/LASCO C2 coronagraph. Our ensemble learning framework comprises regression algorithms for numerical data analysis and a con",
    "path": "papers/23/05/2305.00258.json",
    "total_tokens": 819,
    "translated_title": "集成学习用于CME到达时间预测",
    "translated_abstract": "太阳不断向日冕层释放辐射和等离子体。偶尔，太阳会发射太阳喷发，如耀斑和日冕物质抛射(CME)。CME会带走大量物质和磁通量。直接朝向地球的CME可能会对人类系统造成严重后果。它可以摧毁电网/管道，卫星和通讯。因此，准确地监测和预测CME对于最小化对人类系统的损害是重要的。在这项研究中，我们提出了一种名为CMETNet的集成学习方法，用于预测CME从太阳到地球的到达时间。",
    "tldr": "该论文提出了一种名为CMETNet的集成学习方法，用于预测太阳喷发日冕物质抛射(CME)从太阳到地球的到达时间，以减少对人类系统的损害。"
}