{
    "title": "FedZero: Leveraging Renewable Excess Energy in Federated Learning. (arXiv:2305.15092v3 [cs.LG] UPDATED)",
    "abstract": "Federated Learning (FL) is an emerging machine learning technique that enables distributed model training across data silos or edge devices without data sharing. Yet, FL inevitably introduces inefficiencies compared to centralized model training, which will further increase the already high energy usage and associated carbon emissions of machine learning in the future. One idea to reduce FL's carbon footprint is to schedule training jobs based on the availability of renewable excess energy that can occur at certain times and places in the grid. However, in the presence of such volatile and unreliable resources, existing FL schedulers cannot always ensure fast, efficient, and fair training.  We propose FedZero, an FL system that operates exclusively on renewable excess energy and spare capacity of compute infrastructure to effectively reduce a training's operational carbon emissions to zero. Using energy and load forecasts, FedZero leverages the spatio-temporal availability of excess re",
    "link": "http://arxiv.org/abs/2305.15092",
    "context": "Title: FedZero: Leveraging Renewable Excess Energy in Federated Learning. (arXiv:2305.15092v3 [cs.LG] UPDATED)\nAbstract: Federated Learning (FL) is an emerging machine learning technique that enables distributed model training across data silos or edge devices without data sharing. Yet, FL inevitably introduces inefficiencies compared to centralized model training, which will further increase the already high energy usage and associated carbon emissions of machine learning in the future. One idea to reduce FL's carbon footprint is to schedule training jobs based on the availability of renewable excess energy that can occur at certain times and places in the grid. However, in the presence of such volatile and unreliable resources, existing FL schedulers cannot always ensure fast, efficient, and fair training.  We propose FedZero, an FL system that operates exclusively on renewable excess energy and spare capacity of compute infrastructure to effectively reduce a training's operational carbon emissions to zero. Using energy and load forecasts, FedZero leverages the spatio-temporal availability of excess re",
    "path": "papers/23/05/2305.15092.json",
    "total_tokens": 874,
    "translated_title": "FedZero：利用可再生多余能源在联邦学习中",
    "translated_abstract": "联邦学习（FL）是一种新兴的机器学习技术，可以在数据孤岛或边缘设备之间进行分布式模型训练，而无需共享数据。然而，与集中式模型训练相比，FL不可避免地引入了效率低下的问题，这将进一步增加未来机器学习的高能耗和相关的碳排放。减少FL的碳足迹的一个思路是根据电网中某些时段和地点可能出现的可再生多余能源的可用性进行调度训练任务。然而，在存在这种波动和不可靠的资源的情况下，现有的FL调度器不能始终保证快速、高效和公平的训练。我们提出了一种名为FedZero的FL系统，它仅在可再生多余能源和计算基础设施的闲置容量上运行，将训练的操作碳排放有效降低到零。通过能源和负载预测，FedZero利用多余的可再生能源的时空可用性来进行调度。",
    "tldr": "FedZero是一个在联邦学习中利用可再生多余能源的系统，通过能源和负载预测来调度训练任务，将碳排放降低到零。",
    "en_tdlr": "FedZero is a system that leverages renewable excess energy in federated learning, reducing carbon emissions to zero by scheduling training tasks based on energy and load forecasts."
}