{
    "title": "Meta-Learners for Few-Shot Weakly-Supervised Medical Image Segmentation. (arXiv:2305.06912v1 [cs.CV])",
    "abstract": "Most uses of Meta-Learning in visual recognition are very often applied to image classification, with a relative lack of works in other tasks {such} as segmentation and detection. We propose a generic Meta-Learning framework for few-shot weakly-supervised segmentation in medical imaging domains. We conduct a comparative analysis of meta-learners from distinct paradigms adapted to few-shot image segmentation in different sparsely annotated radiological tasks. The imaging modalities include 2D chest, mammographic and dental X-rays, as well as 2D slices of volumetric tomography and resonance images. Our experiments consider a total of 9 meta-learners, 4 backbones and multiple target organ segmentation tasks. We explore small-data scenarios in radiology with varying weak annotation styles and densities. Our analysis shows that metric-based meta-learning approaches achieve better segmentation results in tasks with smaller domain shifts in comparison to the meta-training datasets, while some",
    "link": "http://arxiv.org/abs/2305.06912",
    "context": "Title: Meta-Learners for Few-Shot Weakly-Supervised Medical Image Segmentation. (arXiv:2305.06912v1 [cs.CV])\nAbstract: Most uses of Meta-Learning in visual recognition are very often applied to image classification, with a relative lack of works in other tasks {such} as segmentation and detection. We propose a generic Meta-Learning framework for few-shot weakly-supervised segmentation in medical imaging domains. We conduct a comparative analysis of meta-learners from distinct paradigms adapted to few-shot image segmentation in different sparsely annotated radiological tasks. The imaging modalities include 2D chest, mammographic and dental X-rays, as well as 2D slices of volumetric tomography and resonance images. Our experiments consider a total of 9 meta-learners, 4 backbones and multiple target organ segmentation tasks. We explore small-data scenarios in radiology with varying weak annotation styles and densities. Our analysis shows that metric-based meta-learning approaches achieve better segmentation results in tasks with smaller domain shifts in comparison to the meta-training datasets, while some",
    "path": "papers/23/05/2305.06912.json",
    "total_tokens": 919,
    "translated_title": "元学习用于少样本弱监督医学图像分割",
    "translated_abstract": "大多数元学习在视觉识别中的应用往往局限于图像分类，其他任务，如分割和检测的工作相对较少。我们针对医学成像领域提出了一个通用的用于少样本弱监督分割的元学习框架，并比较分析了不同范式的元学习器在不同稀疏标注放射性任务中适用于少样本图像分割的效果。成像模态包括2D胸部、乳腺和牙科X光以及彩超和磁共振成像的2D滑动切片。我们的实验考虑了9种元学习器、4种主干网络和多个目标器官分割任务，探索了具有不同弱标注样式和密度的医学小数据场景。我们的分析表明，在较小的领域变化下，基于度量的元学习方法在分割结果方面优于在元训练数据集中进行培训，而有些方法则可能在面对较大的领域变化时存在困难。",
    "tldr": "该论文提出了一个用于医学成像少样本弱监督分割的通用元学习框架，并通过比较实验发现基于度量的元学习在小数据场景下表现更佳。",
    "en_tdlr": "This paper proposes a generic meta-learning framework for few-shot weakly-supervised segmentation in medical imaging domains, and finds that metric-based meta-learning performs better in small-data scenarios."
}