{
    "title": "Automatic learning algorithm selection for classification via convolutional neural networks. (arXiv:2305.09101v1 [cs.LG])",
    "abstract": "As in any other task, the process of building machine learning models can benefit from prior experience. Meta-learning for classifier selection gains knowledge from characteristics of different datasets and/or previous performance of machine learning techniques to make better decisions for the current modeling process. Meta-learning approaches first collect meta-data that describe this prior experience and then use it as input for an algorithm selection model. In this paper, however, we propose an automatic learning scheme in which we train convolutional networks directly with the information of tabular datasets for binary classification. The goal of this study is to learn the inherent structure of the data without identifying meta-features. Experiments with simulated datasets show that the proposed approach achieves nearly perfect performance in identifying linear and nonlinear patterns, outperforming the traditional two-step method based on meta-features. The proposed method is then ",
    "link": "http://arxiv.org/abs/2305.09101",
    "context": "Title: Automatic learning algorithm selection for classification via convolutional neural networks. (arXiv:2305.09101v1 [cs.LG])\nAbstract: As in any other task, the process of building machine learning models can benefit from prior experience. Meta-learning for classifier selection gains knowledge from characteristics of different datasets and/or previous performance of machine learning techniques to make better decisions for the current modeling process. Meta-learning approaches first collect meta-data that describe this prior experience and then use it as input for an algorithm selection model. In this paper, however, we propose an automatic learning scheme in which we train convolutional networks directly with the information of tabular datasets for binary classification. The goal of this study is to learn the inherent structure of the data without identifying meta-features. Experiments with simulated datasets show that the proposed approach achieves nearly perfect performance in identifying linear and nonlinear patterns, outperforming the traditional two-step method based on meta-features. The proposed method is then ",
    "path": "papers/23/05/2305.09101.json",
    "total_tokens": 831,
    "translated_title": "卷积神经网络的分类自动学习算法选择",
    "translated_abstract": "与其他任务一样，构建机器学习模型的过程可以受益于先前的经验。基于元学习的分类器选择通过比较不同数据集的特征和机器学习技术的性能，以提高当前建模过程中的决策。然而，本文提出了一种自动学习方案，直接使用表格数据为二进制分类训练卷积神经网络，以学习数据固有的结构而不识别元特征。在模拟数据集上进行的实验显示，所提出的方法在识别线性和非线性模式方面达到了几乎完美的性能，优于基于元特征的传统两步方法。文中所提出的方法随后在真实数据集上进行评估，证明了与现有最先进方法相比的竞争性能。",
    "tldr": "本文提出了一种直接使用表格数据自动训练卷积神经网络的方法，以学习数据固有的结构，无需识别元特征。在模拟和真实数据集上，该方法均取得了竞争性能。",
    "en_tdlr": "This paper proposes a method of automatically training convolutional neural networks with tabular data to learn the inherent structure of the data without identifying meta-features. The proposed approach achieves competitive performance on both simulated and real-world datasets."
}