{
    "title": "Multilingual Previously Fact-Checked Claim Retrieval. (arXiv:2305.07991v1 [cs.CL])",
    "abstract": "Fact-checkers are often hampered by the sheer amount of online content that needs to be fact-checked. NLP can help them by retrieving already existing fact-checks relevant to the content being investigated. This paper introduces a new multilingual dataset -- MultiClaim -- for previously fact-checked claim retrieval. We collected 28k posts in 27 languages from social media, 206k fact-checks in 39 languages written by professional fact-checkers, as well as 31k connections between these two groups. This is the most extensive and the most linguistically diverse dataset of this kind to date. We evaluated how different unsupervised methods fare on this dataset and its various dimensions. We show that evaluating such a diverse dataset has its complexities and proper care needs to be taken before interpreting the results. We also evaluated a supervised fine-tuning approach, improving upon the unsupervised method significantly.",
    "link": "http://arxiv.org/abs/2305.07991",
    "context": "Title: Multilingual Previously Fact-Checked Claim Retrieval. (arXiv:2305.07991v1 [cs.CL])\nAbstract: Fact-checkers are often hampered by the sheer amount of online content that needs to be fact-checked. NLP can help them by retrieving already existing fact-checks relevant to the content being investigated. This paper introduces a new multilingual dataset -- MultiClaim -- for previously fact-checked claim retrieval. We collected 28k posts in 27 languages from social media, 206k fact-checks in 39 languages written by professional fact-checkers, as well as 31k connections between these two groups. This is the most extensive and the most linguistically diverse dataset of this kind to date. We evaluated how different unsupervised methods fare on this dataset and its various dimensions. We show that evaluating such a diverse dataset has its complexities and proper care needs to be taken before interpreting the results. We also evaluated a supervised fine-tuning approach, improving upon the unsupervised method significantly.",
    "path": "papers/23/05/2305.07991.json",
    "total_tokens": 818,
    "translated_title": "多语种先前事实核查索引",
    "translated_abstract": "事实核查员常常受到需要进行核查的在线内容数量的限制。NLP可以通过检索与正在调查的内容相关的已存在的事实核查来帮助他们。本文介绍了一个新的多语种数据集MultiClaim——用于先前事实核查检索。我们收集了来自社交媒体的27种语言的28k篇文章、39种语言的206k篇由专业事实核查员撰写的事实核查以及这两个组之间的31k个连接。这是迄今为止最广泛、语言多元化的数据集。我们评估了不同的无监督方法在这个数据集及其各自的维度上的表现。我们展示了评估这样一个多样化的数据集的复杂性，并且在解释结果之前需要采取适当的措施。我们还评估了一种经过监督微调的方法，在这个方法上得到了显著的改进。",
    "tldr": "本文介绍了一个新的多语种数据集MultiClaim，用于先前事实核查的检索，通过不同的无监督方法及一个经过监督微调的方法对其进行了评估。",
    "en_tdlr": "This paper presents a new multilingual dataset, MultiClaim, for previously fact-checked claim retrieval, and evaluates it through various unsupervised methods and a supervised fine-tuning approach."
}