{
    "title": "Scene restoration from scaffold occlusion using deep learning-based methods. (arXiv:2305.18810v1 [cs.CV] CROSS LISTED)",
    "abstract": "The occlusion issues of computer vision (CV) applications in construction have attracted significant attention, especially those caused by the wide-coverage, crisscrossed, and immovable scaffold. Intuitively, removing the scaffold and restoring the occluded visual information can provide CV agents with clearer site views and thus help them better understand the construction scenes. Therefore, this study proposes a novel two-step method combining pixel-level segmentation and image inpainting for restoring construction scenes from scaffold occlusion. A low-cost data synthesis method based only on unlabeled data is developed to address the shortage dilemma of labeled data. Experiments on the synthesized test data show that the proposed method achieves performances of 92% mean intersection over union (MIoU) for scaffold segmentation and over 82% structural similarity (SSIM) for scene restoration from scaffold occlusion.",
    "link": "http://arxiv.org/abs/2305.18810",
    "context": "Title: Scene restoration from scaffold occlusion using deep learning-based methods. (arXiv:2305.18810v1 [cs.CV] CROSS LISTED)\nAbstract: The occlusion issues of computer vision (CV) applications in construction have attracted significant attention, especially those caused by the wide-coverage, crisscrossed, and immovable scaffold. Intuitively, removing the scaffold and restoring the occluded visual information can provide CV agents with clearer site views and thus help them better understand the construction scenes. Therefore, this study proposes a novel two-step method combining pixel-level segmentation and image inpainting for restoring construction scenes from scaffold occlusion. A low-cost data synthesis method based only on unlabeled data is developed to address the shortage dilemma of labeled data. Experiments on the synthesized test data show that the proposed method achieves performances of 92% mean intersection over union (MIoU) for scaffold segmentation and over 82% structural similarity (SSIM) for scene restoration from scaffold occlusion.",
    "path": "papers/23/05/2305.18810.json",
    "total_tokens": 907,
    "translated_title": "使用基于深度学习的方法从脚手架遮挡中进行场景恢复",
    "translated_abstract": "建筑中计算机视觉（CV）应用的遮挡问题引起了很大的关注，特别是由广覆盖、交叉和不可移动的脚手架引起的遮挡问题。直观地，去除脚手架并恢复被遮挡的视觉信息可以为CV系统提供更清晰的场景视图，从而帮助它们更好地理解建筑场景。因此，本研究提出了一种新颖的两步方法，结合像素级分割和图像修复，用于从脚手架遮挡中恢复建筑场景。还开发了一种基于无标签数据的低成本数据合成方法，以解决标记数据短缺的困境。对合成测试数据的实验结果显示，所提出的方法在脚手架分割方面的平均交叉联合率（MIoU）达到92％，在从脚手架遮挡中恢复场景方面的结构相似性（SSIM）达到82％以上。",
    "tldr": "本研究提出了一种基于深度学习的方法，通过像素级分割和图像修复技术，从脚手架遮挡中恢复建筑场景。实验结果表明，该方法在脚手架分割和场景恢复方面表现出色。",
    "en_tdlr": "This study proposes a deep learning-based method that combines pixel-level segmentation and image inpainting to restore construction scenes from scaffold occlusion. Experimental results show excellent performance in scaffold segmentation and scene restoration."
}