{
    "title": "When Federated Recommendation Meets Cold-Start Problem: Separating Item Attributes and User Interactions",
    "abstract": "arXiv:2305.12650v2 Announce Type: replace  Abstract: Federated recommendation system usually trains a global model on the server without direct access to users' private data on their own devices. However, this separation of the recommendation model and users' private data poses a challenge in providing quality service, particularly when it comes to new items, namely cold-start recommendations in federated settings. This paper introduces a novel method called Item-aligned Federated Aggregation (IFedRec) to address this challenge. It is the first research work in federated recommendation to specifically study the cold-start scenario. The proposed method learns two sets of item representations by leveraging item attributes and interaction records simultaneously. Additionally, an item representation alignment mechanism is designed to align two item representations and learn the meta attribute network at the server within a federated learning framework. Experiments on four benchmark dataset",
    "link": "https://arxiv.org/abs/2305.12650",
    "context": "Title: When Federated Recommendation Meets Cold-Start Problem: Separating Item Attributes and User Interactions\nAbstract: arXiv:2305.12650v2 Announce Type: replace  Abstract: Federated recommendation system usually trains a global model on the server without direct access to users' private data on their own devices. However, this separation of the recommendation model and users' private data poses a challenge in providing quality service, particularly when it comes to new items, namely cold-start recommendations in federated settings. This paper introduces a novel method called Item-aligned Federated Aggregation (IFedRec) to address this challenge. It is the first research work in federated recommendation to specifically study the cold-start scenario. The proposed method learns two sets of item representations by leveraging item attributes and interaction records simultaneously. Additionally, an item representation alignment mechanism is designed to align two item representations and learn the meta attribute network at the server within a federated learning framework. Experiments on four benchmark dataset",
    "path": "papers/23/05/2305.12650.json",
    "total_tokens": 893,
    "translated_title": "当联邦推荐遇到冷启动问题：分离物品属性和用户交互",
    "translated_abstract": "arXiv:2305.12650v2 公告类型：替换 摘要：联邦推荐系统通常在服务器上训练全局模型，而无法直接访问用户在自己设备上的私人数据。然而，推荐模型与用户私人数据的分离在提供优质服务方面提出了挑战，特别是在联邦设置中针对新项目，即冷启动推荐。本文介绍了一种名为物品对齐联邦聚合（IFedRec）的新颖方法来解决这一挑战。这是联邦推荐中专门研究冷启动场景的第一项研究工作。所提出的方法通过同时利用物品属性和交互记录学习两组物品表示。此外，设计了一种物品表示对齐机制来对齐两组物品表示，并在联邦学习框架中在服务器端学习元属性网络。在四个基准数据集上进行实验",
    "tldr": "本文提出了一种名为Item-aligned Federated Aggregation (IFedRec)的新方法，通过利用物品属性和交互记录同时学习两组物品表示，并设计了物品表示对齐机制，从而在联邦学习框架中解决了冷启动推荐的挑战。",
    "en_tdlr": "This paper introduces a novel method called Item-aligned Federated Aggregation (IFedRec) to address the challenge of cold-start recommendations in federated settings by learning two sets of item representations using item attributes and interaction records simultaneously, and designing an item representation alignment mechanism within a federated learning framework."
}