{
    "title": "Learning low-dimensional dynamics from whole-brain data improves task capture. (arXiv:2305.14369v1 [q-bio.NC])",
    "abstract": "The neural dynamics underlying brain activity are critical to understanding cognitive processes and mental disorders. However, current voxel-based whole-brain dimensionality reduction techniques fall short of capturing these dynamics, producing latent timeseries that inadequately relate to behavioral tasks. To address this issue, we introduce a novel approach to learning low-dimensional approximations of neural dynamics by using a sequential variational autoencoder (SVAE) that represents the latent dynamical system via a neural ordinary differential equation (NODE). Importantly, our method finds smooth dynamics that can predict cognitive processes with accuracy higher than classical methods. Our method also shows improved spatial localization to task-relevant brain regions and identifies well-known structures such as the motor homunculus from fMRI motor task recordings. We also find that non-linear projections to the latent space enhance performance for specific tasks, offering a promi",
    "link": "http://arxiv.org/abs/2305.14369",
    "context": "Title: Learning low-dimensional dynamics from whole-brain data improves task capture. (arXiv:2305.14369v1 [q-bio.NC])\nAbstract: The neural dynamics underlying brain activity are critical to understanding cognitive processes and mental disorders. However, current voxel-based whole-brain dimensionality reduction techniques fall short of capturing these dynamics, producing latent timeseries that inadequately relate to behavioral tasks. To address this issue, we introduce a novel approach to learning low-dimensional approximations of neural dynamics by using a sequential variational autoencoder (SVAE) that represents the latent dynamical system via a neural ordinary differential equation (NODE). Importantly, our method finds smooth dynamics that can predict cognitive processes with accuracy higher than classical methods. Our method also shows improved spatial localization to task-relevant brain regions and identifies well-known structures such as the motor homunculus from fMRI motor task recordings. We also find that non-linear projections to the latent space enhance performance for specific tasks, offering a promi",
    "path": "papers/23/05/2305.14369.json",
    "total_tokens": 1017,
    "translated_title": "从整个大脑数据中学习低维动态可以提高任务捕捉能力",
    "translated_abstract": "理解认知过程和精神障碍的神经动力学对于我们理解大脑活动至关重要。然而，目前的基于体素的整个大脑维度约简技术不能充分捕捉这些动态，产生的潜在时间序列与行为任务关联不足。为了解决这个问题，我们引入了一种新方法，使用顺序变分自编码器（SVAE）学习神经动力学的低维逼近，并通过神经常微分方程（NODE）表示潜在动力学系统。重要的是，我们的方法能够发现可以比经典方法更准确地预测认知过程的平滑动力学。我们的方法还展现了对任务相关脑区的空间定位能力得到了明显改善，并且从fMRI运动任务记录中发现了众所周知的结构，如运动体像图。我们还发现，非线性投影到潜在空间可以增强特定任务的性能，这为未来的研究提供了有希望的方向。",
    "tldr": "本文提出了一种新方法，使用顺序变分自编码器（SVAE）学习神经动力学的低维逼近，并通过神经常微分方程（NODE）表示潜在动力学系统。我们的方法产生的平滑动力学可以比经典方法更准确地预测认知过程，并展示了对任务相关脑区的空间定位能力得到了明显改善。非线性投影到潜在空间可以增强特定任务的性能。",
    "en_tdlr": "This paper proposes a novel method for learning low-dimensional approximations of neural dynamics using a sequential variational autoencoder (SVAE) that represents the latent dynamical system via a neural ordinary differential equation (NODE). Our method produces smooth dynamics that can predict cognitive processes with higher accuracy than classical methods and shows improved spatial localization to task-relevant brain regions. Non-linear projections to the latent space can also enhance performance for specific tasks."
}