{
    "title": "Translating SUMO-K to Higher-Order Set Theory. (arXiv:2305.07903v1 [cs.AI])",
    "abstract": "We describe a translation from a fragment of SUMO (SUMO-K) into higher-order set theory. The translation provides a formal semantics for portions of SUMO which are beyond first-order and which have previously only had an informal interpretation. It also for the first time embeds a large common-sense ontology into a very secure interactive theorem proving system. We further extend our previous work in finding contradictions in SUMO from first order constructs to include a portion of SUMO's higher order constructs. Finally, using the translation, we can create problems that can be proven using higher-order interactive and automated theorem provers. This is tested in several systems and can be used to form a corpus of higher-order common-sense reasoning problems.",
    "link": "http://arxiv.org/abs/2305.07903",
    "context": "Title: Translating SUMO-K to Higher-Order Set Theory. (arXiv:2305.07903v1 [cs.AI])\nAbstract: We describe a translation from a fragment of SUMO (SUMO-K) into higher-order set theory. The translation provides a formal semantics for portions of SUMO which are beyond first-order and which have previously only had an informal interpretation. It also for the first time embeds a large common-sense ontology into a very secure interactive theorem proving system. We further extend our previous work in finding contradictions in SUMO from first order constructs to include a portion of SUMO's higher order constructs. Finally, using the translation, we can create problems that can be proven using higher-order interactive and automated theorem provers. This is tested in several systems and can be used to form a corpus of higher-order common-sense reasoning problems.",
    "path": "papers/23/05/2305.07903.json",
    "total_tokens": 849,
    "translated_title": "将SUMO-K翻译至高阶集合论",
    "translated_abstract": "我们将SUMO的一个子集（SUMO-K）翻译成高阶集合论。该翻译为超越一阶逻辑的SUMO部分提供了形式语义，这些部分以前只有非正式的解释。同时，它还首次将一个大型的常识本体论嵌入一个非常安全的互动定理证明系统中。我们还扩展了之前的工作，从一阶结构中找到SUMO中的矛盾，将其包括高阶结构的一部分。最后，利用这个翻译，我们可以创建一些可使用高阶互动式和自动定理证明器证明的问题。这在几个系统中得到测试，并可用于形成一个高阶常识推理问题语料库。",
    "tldr": "本文介绍了将SUMO-K翻译成高阶集合论的方法，并为超越一阶逻辑的SUMO部分提供了形式化语义。同时也嵌入了一个大型的常识本体论到一个安全的互动定理证明系统中，这可用于创建一些高阶常识推理问题。",
    "en_tdlr": "This paper describes a translation method of SUMO-K into higher-order set theory, which provides a formal semantics for the portions of SUMO beyond first-order logic and embeds a large common-sense ontology into a secure interactive theorem proving system for the first time. It also extends the previous work of finding contradictions in SUMO to higher-order constructs and creates problems that can be proven using higher-order interactive and automated theorem provers, which can form a corpus of higher-order common-sense reasoning problems."
}