{
    "title": "The Future of Artificial Intelligence (AI) and Machine Learning (ML) in Landscape Design: A Case Study in Coastal Virginia, USA. (arXiv:2305.02327v1 [cs.AI])",
    "abstract": "There have been theory-based endeavours that directly engage with AI and ML in the landscape discipline. By presenting a case that uses machine learning techniques to predict variables in a coastal environment, this paper provides empirical evidence of the forthcoming cybernetic environment, in which designers are conceptualized not as authors but as choreographers, catalyst agents, and conductors among many other intelligent agents. Drawing ideas from posthumanism, this paper argues that, to truly understand the cybernetic environment, we have to take on posthumanist ethics and overcome human exceptionalism.",
    "link": "http://arxiv.org/abs/2305.02327",
    "context": "Title: The Future of Artificial Intelligence (AI) and Machine Learning (ML) in Landscape Design: A Case Study in Coastal Virginia, USA. (arXiv:2305.02327v1 [cs.AI])\nAbstract: There have been theory-based endeavours that directly engage with AI and ML in the landscape discipline. By presenting a case that uses machine learning techniques to predict variables in a coastal environment, this paper provides empirical evidence of the forthcoming cybernetic environment, in which designers are conceptualized not as authors but as choreographers, catalyst agents, and conductors among many other intelligent agents. Drawing ideas from posthumanism, this paper argues that, to truly understand the cybernetic environment, we have to take on posthumanist ethics and overcome human exceptionalism.",
    "path": "papers/23/05/2305.02327.json",
    "total_tokens": 867,
    "translated_title": "人工智能（AI）和机器学习（ML）在景观设计中的未来：以美国弗吉尼亚州海岸为例研究",
    "translated_abstract": "在景观设计领域中，已经有一些理论性的尝试直接涉及到AI和ML。本文通过展示一个使用机器学习技术来预测海岸环境变量的案例，提供了即将到来的网络环境的实证证据。在这个环境中，设计师不再是作家，而是许多智能代理中的编舞者、催化剂和指挥者。本文从后人类主义的思想中获取灵感，认为要真正理解网络环境，我们必须采取后人类主义的伦理并克服人类的优越主义。",
    "tldr": "本论文以介绍使用机器学习技术在海岸环境中预测变量的案例为例，提供了未来景观设计中即将到来的网络环境的实证证据。设计师将不再是作家，而是智能代理中的编舞者、催化剂和指挥者。本文从后人类主义中获得灵感，认为要真正理解网络环境，我们必须采取后人类主义的伦理并克服人类的优越主义。",
    "en_tdlr": "This paper provides empirical evidence of the forthcoming cybernetic environment in landscape design by presenting a case that uses machine learning techniques to predict variables in a coastal environment. The designers will no longer be authors but choreographers, catalyst agents, and conductors among many other intelligent agents. The paper draws ideas from posthumanism and argues that we have to take on posthumanist ethics and overcome human exceptionalism to truly understand the cybernetic environment."
}