{
    "title": "\"Alexa doesn't have that many feelings\": Children's understanding of AI through interactions with smart speakers in their homes. (arXiv:2305.05597v1 [cs.HC])",
    "abstract": "As voice-based Conversational Assistants (CAs), including Alexa, Siri, Google Home, have become commonly embedded in households, many children now routinely interact with Artificial Intelligence (AI) systems. It is important to research children's experiences with consumer devices which use AI techniques because these shape their understanding of AI and its capabilities. We conducted a mixed-methods study (questionnaires and interviews) with primary-school children aged 6-11 in Scotland to establish children's understanding of how voice-based CAs work, how they perceive their cognitive abilities, agency and other human-like qualities, their awareness and trust of privacy aspects when using CAs and what they perceive as appropriate verbal interactions with CAs. Most children overestimated the CAs' intelligence and were uncertain about the systems' feelings or agency. They also lacked accurate understanding of data privacy and security aspects, and believed it was wrong to be rude to con",
    "link": "http://arxiv.org/abs/2305.05597",
    "context": "Title: \"Alexa doesn't have that many feelings\": Children's understanding of AI through interactions with smart speakers in their homes. (arXiv:2305.05597v1 [cs.HC])\nAbstract: As voice-based Conversational Assistants (CAs), including Alexa, Siri, Google Home, have become commonly embedded in households, many children now routinely interact with Artificial Intelligence (AI) systems. It is important to research children's experiences with consumer devices which use AI techniques because these shape their understanding of AI and its capabilities. We conducted a mixed-methods study (questionnaires and interviews) with primary-school children aged 6-11 in Scotland to establish children's understanding of how voice-based CAs work, how they perceive their cognitive abilities, agency and other human-like qualities, their awareness and trust of privacy aspects when using CAs and what they perceive as appropriate verbal interactions with CAs. Most children overestimated the CAs' intelligence and were uncertain about the systems' feelings or agency. They also lacked accurate understanding of data privacy and security aspects, and believed it was wrong to be rude to con",
    "path": "papers/23/05/2305.05597.json",
    "total_tokens": 921,
    "translated_title": "“Alexa并不那么有感情”: 儿童通过与智能音箱的交互来理解人工智能",
    "translated_abstract": "随着语音对话助手（CAs），包括Alexa、Siri和Google Home等的普及，在家庭中，许多儿童现在经常与人工智能系统互动。研究儿童与使用AI技术的消费设备的经验很重要，因为这些经验会塑造他们对AI及其能力的理解。我们在苏格兰对6-11岁的小学生进行了混合方法研究（问卷和访谈），以确定儿童对语音对话助手的工作方式、认知能力、代理和其他类似人类的特质、在使用语音对话助手时隐私方面的意识和信任以及他们认为与语音对话助手的适当口头交互。大多数儿童高估了语音对话助手的智能水平，对系统的情感或代理感到不确定。此外，他们对数据隐私和安全方面缺乏准确的理解，并认为向对话助手表现出不礼貌是不对的。",
    "tldr": "研究显示，大多数6-11岁的儿童高估了语音对话助手的智能，对它们的情感或代理感到不确定，并缺乏对数据隐私和安全方面的准确理解。",
    "en_tdlr": "Most 6-11 year old children overestimate the intelligence of voice-based conversational assistants like Alexa and lack understanding of their emotional capability, agency, and data privacy and security aspects."
}