{
    "title": "Known by the Company it Keeps: Proximity-Based Indexing for Physical Content in Archival Repositories. (arXiv:2305.18683v2 [cs.IR] UPDATED)",
    "abstract": "Despite the plethora of born-digital content, vast troves of important content remain accessible only on physical media such as paper or microfilm. The traditional approach to indexing undigitized content is using manually created metadata that describes content at some level of aggregation (e.g., folder, box, or collection). Searchers led in this way to some subset of the content often must then manually examine substantial quantities of physical media to find what they are looking for. This paper proposes a complementary approach, in which selective digitization of a small portion of the content is used as a basis for proximity-based indexing as a way of bringing the user closer to the specific content for which they are looking. Experiments with 35 boxes of partially digitized US State Department records indicate that box-level indexes built in this way can provide a useful basis for search.",
    "link": "http://arxiv.org/abs/2305.18683",
    "context": "Title: Known by the Company it Keeps: Proximity-Based Indexing for Physical Content in Archival Repositories. (arXiv:2305.18683v2 [cs.IR] UPDATED)\nAbstract: Despite the plethora of born-digital content, vast troves of important content remain accessible only on physical media such as paper or microfilm. The traditional approach to indexing undigitized content is using manually created metadata that describes content at some level of aggregation (e.g., folder, box, or collection). Searchers led in this way to some subset of the content often must then manually examine substantial quantities of physical media to find what they are looking for. This paper proposes a complementary approach, in which selective digitization of a small portion of the content is used as a basis for proximity-based indexing as a way of bringing the user closer to the specific content for which they are looking. Experiments with 35 boxes of partially digitized US State Department records indicate that box-level indexes built in this way can provide a useful basis for search.",
    "path": "papers/23/05/2305.18683.json",
    "total_tokens": 680,
    "translated_title": "其所在的公司：基于邻近度的档案库实体内容索引方法",
    "translated_abstract": "尽管存在大量的数字化内容，但重要的实体内容存储在纸质或微缩膜等物理介质中。传统的非数字化内容索引方法是使用手动创建的元数据来描述内容。本文提出了一种基于选择性数字化的小部分内容作为邻近度索引基础的方法，以将用户更接近他们正在寻找的具体内容。实验表明，使用此方法构建的盒级索引可以成为有效的搜索基础。",
    "tldr": "本文提出了一种基于选择性数字化的邻近度索引方法，该方法可以有效提高搜索非数字化实体内容的效率。",
    "en_tdlr": "This paper proposes a proximity-based indexing method based on selective digitization of a small portion of the content, which can effectively improve the efficiency of searching for non-digitized physical content."
}