{
    "title": "To Revise or Not to Revise: Learning to Detect Improvable Claims for Argumentative Writing Support. (arXiv:2305.16799v1 [cs.CL])",
    "abstract": "Optimizing the phrasing of argumentative text is crucial in higher education and professional development. However, assessing whether and how the different claims in a text should be revised is a hard task, especially for novice writers. In this work, we explore the main challenges to identifying argumentative claims in need of specific revisions. By learning from collaborative editing behaviors in online debates, we seek to capture implicit revision patterns in order to develop approaches aimed at guiding writers in how to further improve their arguments. We systematically compare the ability of common word embedding models to capture the differences between different versions of the same text, and we analyze their impact on various types of writing issues. To deal with the noisy nature of revision-based corpora, we propose a new sampling strategy based on revision distance. Opposed to approaches from prior work, such sampling can be done without employing additional annotations and j",
    "link": "http://arxiv.org/abs/2305.16799",
    "context": "Title: To Revise or Not to Revise: Learning to Detect Improvable Claims for Argumentative Writing Support. (arXiv:2305.16799v1 [cs.CL])\nAbstract: Optimizing the phrasing of argumentative text is crucial in higher education and professional development. However, assessing whether and how the different claims in a text should be revised is a hard task, especially for novice writers. In this work, we explore the main challenges to identifying argumentative claims in need of specific revisions. By learning from collaborative editing behaviors in online debates, we seek to capture implicit revision patterns in order to develop approaches aimed at guiding writers in how to further improve their arguments. We systematically compare the ability of common word embedding models to capture the differences between different versions of the same text, and we analyze their impact on various types of writing issues. To deal with the noisy nature of revision-based corpora, we propose a new sampling strategy based on revision distance. Opposed to approaches from prior work, such sampling can be done without employing additional annotations and j",
    "path": "papers/23/05/2305.16799.json",
    "total_tokens": 867,
    "translated_title": "是否修改：学习检测可改进论点以支持辩论写作",
    "translated_abstract": "优化辩论文本的措辞在高等教育和职业发展中至关重要。然而，评估文本中不同论点是否需要修改及如何修改是一项困难的任务，特别是对于初学者。在这项工作中，我们探讨了识别需要特定修改的辩论论点的主要挑战。通过从在线辩论中学习协作编辑行为，我们试图捕捉隐含的修订模式，以开发旨在指导作者如何进一步改进其论点的方法。我们系统地比较了常见词嵌入模型捕捉相同文本不同版本之间差异的能力，并分析了它们对各种类型的写作问题的影响。为了应对基于修订的语料库的嘈杂性，我们提出了一种基于修订距离的新的采样策略。与先前工作的方法相反，这种采样可以在不使用额外注释和评估的情况下完成。",
    "tldr": "这篇论文探讨了检测辩论文本中需要改进的论点的挑战，通过学习协作编辑行为捕捉隐含的修订模式来开发指导作者改进论点的方法。",
    "en_tdlr": "This paper explores the challenges of detecting improvable claims in argumentative text and develops approaches to guide writers in improving their arguments by learning from collaborative editing behaviors in online debates."
}