{
    "title": "Cybernetic Environment: A Historical Reflection on System, Design, and Machine Intelligence. (arXiv:2305.02326v1 [cs.AI])",
    "abstract": "Taking on a historical lens, this paper traces the development of cybernetics and systems thinking back to the 1950s, when a group of interdisciplinary scholars converged to create a new theoretical model based on machines and systems for understanding matters of meaning, information, consciousness, and life. By presenting a genealogy of research in the landscape architecture discipline, the paper argues that landscape architects have been an important part of the development of cybernetics by materializing systems based on cybernetic principles in the environment through ecologically based landscape design. The landscape discipline has developed a design framework that provides transformative insights into understanding machine intelligence. The paper calls for a new paradigm of environmental engagement to understand matters of design and machine intelligence.",
    "link": "http://arxiv.org/abs/2305.02326",
    "context": "Title: Cybernetic Environment: A Historical Reflection on System, Design, and Machine Intelligence. (arXiv:2305.02326v1 [cs.AI])\nAbstract: Taking on a historical lens, this paper traces the development of cybernetics and systems thinking back to the 1950s, when a group of interdisciplinary scholars converged to create a new theoretical model based on machines and systems for understanding matters of meaning, information, consciousness, and life. By presenting a genealogy of research in the landscape architecture discipline, the paper argues that landscape architects have been an important part of the development of cybernetics by materializing systems based on cybernetic principles in the environment through ecologically based landscape design. The landscape discipline has developed a design framework that provides transformative insights into understanding machine intelligence. The paper calls for a new paradigm of environmental engagement to understand matters of design and machine intelligence.",
    "path": "papers/23/05/2305.02326.json",
    "total_tokens": 886,
    "translated_title": "控制论环境：关于系统、设计和机器智能的历史反思",
    "translated_abstract": "本文以历史的视角回顾了控制论和系统思维的发展历程，追溯到20世纪50年代，一群跨学科学者基于机器和系统创建了一个新的理论模型来理解意义、信息、意识和生命等问题。通过介绍景观设计学科研究的谱系，本文认为景观设计师通过基于生态学的景观设计在环境中实现基于控制论原则的系统，是控制论发展中的重要组成部分。景观学科已经发展出了一个设计框架，提供了深入理解机器智能的转化性洞见。本文呼吁建立一种新的环境参与范式，以理解设计和机器智能等问题。",
    "tldr": "本文以历史的视角回顾了控制论和系统思维的发展历程，并在介绍景观设计学科研究的谱系基础上指出景观设计师通过基于生态学的景观设计实现基于控制论原则的系统是控制论发展中的重要组成部分。本文呼吁建立一种新的环境参与范式，以理解设计和机器智能等问题。",
    "en_tdlr": "This paper traces the historical development of cybernetics and systems thinking, and suggests that landscape architects have played an important role in the development of cybernetics. By materializing systems based on cybernetic principles in the environment through ecologically-based landscape design, landscape architects have developed a design framework that provides insights into understanding machine intelligence. The paper calls for a new paradigm of environmental engagement to understand matters of design and machine intelligence."
}