{
    "title": "AI's Regimes of Representation: A Community-centered Study of Text-to-Image Models in South Asia. (arXiv:2305.11844v1 [cs.CY])",
    "abstract": "This paper presents a community-centered study of cultural limitations of text-to-image (T2I) models in the South Asian context. We theorize these failures using scholarship on dominant media regimes of representations and locate them within participants' reporting of their existing social marginalizations. We thus show how generative AI can reproduce an outsiders gaze for viewing South Asian cultures, shaped by global and regional power inequities. By centering communities as experts and soliciting their perspectives on T2I limitations, our study adds rich nuance into existing evaluative frameworks and deepens our understanding of the culturally-specific ways AI technologies can fail in non-Western and Global South settings. We distill lessons for responsible development of T2I models, recommending concrete pathways forward that can allow for recognition of structural inequalities.",
    "link": "http://arxiv.org/abs/2305.11844",
    "context": "Title: AI's Regimes of Representation: A Community-centered Study of Text-to-Image Models in South Asia. (arXiv:2305.11844v1 [cs.CY])\nAbstract: This paper presents a community-centered study of cultural limitations of text-to-image (T2I) models in the South Asian context. We theorize these failures using scholarship on dominant media regimes of representations and locate them within participants' reporting of their existing social marginalizations. We thus show how generative AI can reproduce an outsiders gaze for viewing South Asian cultures, shaped by global and regional power inequities. By centering communities as experts and soliciting their perspectives on T2I limitations, our study adds rich nuance into existing evaluative frameworks and deepens our understanding of the culturally-specific ways AI technologies can fail in non-Western and Global South settings. We distill lessons for responsible development of T2I models, recommending concrete pathways forward that can allow for recognition of structural inequalities.",
    "path": "papers/23/05/2305.11844.json",
    "total_tokens": 981,
    "translated_title": "AI 的表现形式：南亚文字到图像模型的社区中心研究",
    "translated_abstract": "本文提出了一种社区中心的研究方法，来探讨南亚文化背景下文字到图像（T2I）模型的文化限制。我们使用支配性的媒体表现形式的学术理论来阐述这些失败，并将它们定位于参与者对他们现有社会边缘化的报告上。因此，我们展示了生成AI会再现一种外部人眼中看待南亚文化的视角，这种视角是由全球和地区权力不平等所塑造的。通过将社区视为专家并征求他们对T2I限制的看法，我们的研究为现有的评估框架增添了丰富的细节，并加深了我们对文化特定的AI技术在非西方和南球地区上失败的理解。我们总结出了负责任地开发T2I模型的教训，推荐具体的前进路径，以允许对结构性不平等性的认识。",
    "tldr": "本文探讨南亚文化背景下文字到图像模型的文化限制，并将其归因于全球和地区权力不平等所塑造的外来视角。通过将社区视为专家，对T2I的限制进行研究，深入了解文化特定的AI技术在非西方和南球地区上失败的原因。建议负责任地开发T2I模型，以允许对结构性不平等性的认识。",
    "en_tdlr": "This paper studies the cultural limitations of text-to-image (T2I) models in the South Asian context, attributing their failures to an outsider's perspective shaped by global and regional power inequities. By centering communities as experts and researching T2I limitations, it deepens our understanding of how culturally-specific AI technologies can fail in non-Western and Global South settings. The study recommends responsible development of T2I models to recognize structural inequalities."
}