{
    "title": "AlignScore: Evaluating Factual Consistency with a Unified Alignment Function. (arXiv:2305.16739v1 [cs.CL])",
    "abstract": "Many text generation applications require the generated text to be factually consistent with input information. Automatic evaluation of factual consistency is challenging. Previous work has developed various metrics that often depend on specific functions, such as natural language inference (NLI) or question answering (QA), trained on limited data. Those metrics thus can hardly assess diverse factual inconsistencies (e.g., contradictions, hallucinations) that occur in varying inputs/outputs (e.g., sentences, documents) from different tasks. In this paper, we propose AlignScore, a new holistic metric that applies to a variety of factual inconsistency scenarios as above. AlignScore is based on a general function of information alignment between two arbitrary text pieces. Crucially, we develop a unified training framework of the alignment function by integrating a large diversity of data sources, resulting in 4.7M training examples from 7 well-established tasks (NLI, QA, paraphrasing, fac",
    "link": "http://arxiv.org/abs/2305.16739",
    "context": "Title: AlignScore: Evaluating Factual Consistency with a Unified Alignment Function. (arXiv:2305.16739v1 [cs.CL])\nAbstract: Many text generation applications require the generated text to be factually consistent with input information. Automatic evaluation of factual consistency is challenging. Previous work has developed various metrics that often depend on specific functions, such as natural language inference (NLI) or question answering (QA), trained on limited data. Those metrics thus can hardly assess diverse factual inconsistencies (e.g., contradictions, hallucinations) that occur in varying inputs/outputs (e.g., sentences, documents) from different tasks. In this paper, we propose AlignScore, a new holistic metric that applies to a variety of factual inconsistency scenarios as above. AlignScore is based on a general function of information alignment between two arbitrary text pieces. Crucially, we develop a unified training framework of the alignment function by integrating a large diversity of data sources, resulting in 4.7M training examples from 7 well-established tasks (NLI, QA, paraphrasing, fac",
    "path": "papers/23/05/2305.16739.json",
    "total_tokens": 925,
    "translated_title": "AlignScore：使用统一的对齐函数评估事实一致性",
    "translated_abstract": "许多文本生成应用需要生成的文本与输入信息在事实上保持一致。然而，事实一致性的自动评估具有挑战性。先前的工作已经开发出了各种度量标准，通常依赖于特定的函数，例如自然语言推理（NLI）或问答（QA），这些函数在有限的数据上训练。这些度量标准因此难以评估不同的事实不一致性情况（例如矛盾、幻觉），这些情况发生在不同任务的不同输入/输出（例如句子、文档）中。在本文中，我们提出了AlignScore，这是一种适用于各种事实不一致性情况的新型综合度量标准。AlignScore是基于两个任意文本片段之间的信息对齐的一般函数。关键是，我们开发了一个统一的训练框架来集成大量数据源的对齐函数，从而得到了来自7个知名任务（NLI、QA、文章改写、工作场景文本等）的4.7M个训练示例。",
    "tldr": "本文提出了AlignScore，一种新的综合度量标准，旨在评估各种事实不一致性情况。该方法基于两个文本片段之间的信息对齐，可以适用于不同任务的不同输入/输出。",
    "en_tdlr": "This paper proposes AlignScore, a new holistic metric for evaluating a variety of factual inconsistency scenarios. AlignScore is based on a general function of information alignment between two arbitrary text pieces and is applicable to varying inputs/outputs from different tasks."
}