{
    "title": "Human Body Pose Estimation for Gait Identification: A Comprehensive Survey of Datasets and Models. (arXiv:2305.13765v1 [cs.CV])",
    "abstract": "Person identification is a problem that has received substantial attention, particularly in security domains. Gait recognition is one of the most convenient approaches enabling person identification at a distance without the need of high-quality images. There are several review studies addressing person identification such as the utilization of facial images, silhouette images, and wearable sensor. Despite skeleton-based person identification gaining popularity while overcoming the challenges of traditional approaches, existing survey studies lack the comprehensive review of skeleton-based approaches to gait identification. We present a detailed review of the human pose estimation and gait analysis that make the skeleton-based approaches possible. The study covers various types of related datasets, tools, methodologies, and evaluation metrics with associated challenges, limitations, and application domains. Detailed comparisons are presented for each of these aspects with recommendatio",
    "link": "http://arxiv.org/abs/2305.13765",
    "context": "Title: Human Body Pose Estimation for Gait Identification: A Comprehensive Survey of Datasets and Models. (arXiv:2305.13765v1 [cs.CV])\nAbstract: Person identification is a problem that has received substantial attention, particularly in security domains. Gait recognition is one of the most convenient approaches enabling person identification at a distance without the need of high-quality images. There are several review studies addressing person identification such as the utilization of facial images, silhouette images, and wearable sensor. Despite skeleton-based person identification gaining popularity while overcoming the challenges of traditional approaches, existing survey studies lack the comprehensive review of skeleton-based approaches to gait identification. We present a detailed review of the human pose estimation and gait analysis that make the skeleton-based approaches possible. The study covers various types of related datasets, tools, methodologies, and evaluation metrics with associated challenges, limitations, and application domains. Detailed comparisons are presented for each of these aspects with recommendatio",
    "path": "papers/23/05/2305.13765.json",
    "total_tokens": 873,
    "translated_title": "人体姿态估计用于步态辨识：数据集与模型综述",
    "translated_abstract": "个人辨识是一个受到广泛关注的问题，尤其是在安全领域。步态识别是最方便的方法之一，可以在远距离识别个人而无需高质量的图像。虽然骨架为基础的人物识别正越来越受欢迎，而且能够克服传统方法所面临的挑战，但现有的综述研究缺乏对骨架为基础的步态辨识方法的综合评估。我们对人体姿态估计和步态分析进行了详细的综述，阐述了骨架为基础的步态辨识的方法。该研究涵盖相关数据集、工具、方法论和评估指标的各种类型，以及相关挑战、限制和应用领域。针对每个方面都进行了详细的比较，并提出了未来研究的建议。",
    "tldr": "本文对人体姿态估计和步态分析进行了综述，探讨了骨架为基础的步态辨识方法。详细介绍了相关数据集、工具、方法和评估指标，并提出了未来研究的建议。",
    "en_tdlr": "This paper provides a comprehensive review of skeleton-based approaches to gait identification, covering related datasets, tools, methodologies, and evaluation metrics. The study presents detailed comparisons and provides recommendations for future research."
}