{
    "title": "End-To-End Latent Variational Diffusion Models for Inverse Problems in High Energy Physics. (arXiv:2305.10399v1 [hep-ex])",
    "abstract": "High-energy collisions at the Large Hadron Collider (LHC) provide valuable insights into open questions in particle physics. However, detector effects must be corrected before measurements can be compared to certain theoretical predictions or measurements from other detectors. Methods to solve this \\textit{inverse problem} of mapping detector observations to theoretical quantities of the underlying collision are essential parts of many physics analyses at the LHC. We investigate and compare various generative deep learning methods to approximate this inverse mapping. We introduce a novel unified architecture, termed latent variation diffusion models, which combines the latent learning of cutting-edge generative art approaches with an end-to-end variational framework. We demonstrate the effectiveness of this approach for reconstructing global distributions of theoretical kinematic quantities, as well as for ensuring the adherence of the learned posterior distributions to known physics c",
    "link": "http://arxiv.org/abs/2305.10399",
    "context": "Title: End-To-End Latent Variational Diffusion Models for Inverse Problems in High Energy Physics. (arXiv:2305.10399v1 [hep-ex])\nAbstract: High-energy collisions at the Large Hadron Collider (LHC) provide valuable insights into open questions in particle physics. However, detector effects must be corrected before measurements can be compared to certain theoretical predictions or measurements from other detectors. Methods to solve this \\textit{inverse problem} of mapping detector observations to theoretical quantities of the underlying collision are essential parts of many physics analyses at the LHC. We investigate and compare various generative deep learning methods to approximate this inverse mapping. We introduce a novel unified architecture, termed latent variation diffusion models, which combines the latent learning of cutting-edge generative art approaches with an end-to-end variational framework. We demonstrate the effectiveness of this approach for reconstructing global distributions of theoretical kinematic quantities, as well as for ensuring the adherence of the learned posterior distributions to known physics c",
    "path": "papers/23/05/2305.10399.json",
    "total_tokens": 886,
    "translated_title": "高能物理反问题的端到端潜变分扩散模型",
    "translated_abstract": "大型强子对撞机（LHC）上的高能碰撞提供了粒子物理学中待解决问题的有价值见解。然而，在测量结果能够与特定理论预测或来自其他探测器的测量结果进行比较之前，必须纠正探测器的影响。解决将探测器观测映射到基础碰撞的理论量的反问题的方法是LHC许多物理分析中必不可少的部分。我们研究并比较了各种生成式深度学习方法来近似反映映射。我们引入了一种新的统一架构，称为潜变分扩散模型，将最新的生成艺术方法的潜在学习与端到端变分框架相结合。我们展示了该方法用于重建理论动力学量的全局分布的有效性，以及确保所学后验分布遵守已知物理。",
    "tldr": "本研究提出了一种新的生成式深度学习方法，潜变分扩散模型，用于解决大型强子对撞机中的反问题。实现了重建理论动力学量的全局分布的有效性，同时确保所学后验分布遵守已知物理。",
    "en_tdlr": "A novel generative deep learning method, the latent variational diffusion model, is proposed to solve inverse problems in the Large Hadron Collider. It effectively reconstructs global distributions of theoretical kinematic quantities and ensures adherence to known physics."
}