{
    "title": "Egocentric Hierarchical Visual Semantics. (arXiv:2305.05422v1 [cs.AI])",
    "abstract": "We are interested in aligning how people think about objects and what machines perceive, meaning by this the fact that object recognition, as performed by a machine, should follow a process which resembles that followed by humans when thinking of an object associated with a certain concept. The ultimate goal is to build systems which can meaningfully interact with their users, describing what they perceive in the users' own terms. As from the field of Lexical Semantics, humans organize the meaning of words in hierarchies where the meaning of, e.g., a noun, is defined in terms of the meaning of a more general noun, its genus, and of one or more differentiating properties, its differentia. The main tenet of this paper is that object recognition should implement a hierarchical process which follows the hierarchical semantic structure used to define the meaning of words. We achieve this goal by implementing an algorithm which, for any object, recursively recognizes its visual genus and its",
    "link": "http://arxiv.org/abs/2305.05422",
    "context": "Title: Egocentric Hierarchical Visual Semantics. (arXiv:2305.05422v1 [cs.AI])\nAbstract: We are interested in aligning how people think about objects and what machines perceive, meaning by this the fact that object recognition, as performed by a machine, should follow a process which resembles that followed by humans when thinking of an object associated with a certain concept. The ultimate goal is to build systems which can meaningfully interact with their users, describing what they perceive in the users' own terms. As from the field of Lexical Semantics, humans organize the meaning of words in hierarchies where the meaning of, e.g., a noun, is defined in terms of the meaning of a more general noun, its genus, and of one or more differentiating properties, its differentia. The main tenet of this paper is that object recognition should implement a hierarchical process which follows the hierarchical semantic structure used to define the meaning of words. We achieve this goal by implementing an algorithm which, for any object, recursively recognizes its visual genus and its",
    "path": "papers/23/05/2305.05422.json",
    "total_tokens": 723,
    "translated_title": "自我中心的分层视觉语义学",
    "translated_abstract": "本文旨在将人们对物体的思考与机器感知进行对齐，即机器的物体识别过程应该与人类思考物体与概念相关的过程类似。最终目标是构建能够有意义地与用户交互，并可以用用户自己的术语描述感知内容的系统。本文提出了一个基于分层语义结构的物体识别方法，通过实现递归识别物体的视觉属和差异属性，从而实现了物体识别过程的分层实现。",
    "tldr": "本文提出了一个基于分层语义结构的物体识别方法，即递归识别物体的视觉属和差异属性，实现了物体识别过程的分层实现。"
}