{
    "title": "CVSNet: A Computer Implementation for Central Visual System of The Brain. (arXiv:2305.19492v1 [cs.CV])",
    "abstract": "In computer vision, different basic blocks are created around different matrix operations, and models based on different basic blocks have achieved good results. Good results achieved in vision tasks grants them rationality. However, these experimental-based models also make deep learning long criticized for principle and interpretability. Deep learning originated from the concept of neurons in neuroscience, but recent designs detached natural neural networks except for some simple concepts. In this paper, we build an artificial neural network, CVSNet, which can be seen as a computer implementation for central visual system of the brain. Each block in CVSNet represents the same vision information as that in brains. In CVSNet, blocks differs from each other and visual information flows through three independent pathways and five different blocks. Thus CVSNet is completely different from the design of all previous models, in which basic blocks are repeated to build model and information ",
    "link": "http://arxiv.org/abs/2305.19492",
    "context": "Title: CVSNet: A Computer Implementation for Central Visual System of The Brain. (arXiv:2305.19492v1 [cs.CV])\nAbstract: In computer vision, different basic blocks are created around different matrix operations, and models based on different basic blocks have achieved good results. Good results achieved in vision tasks grants them rationality. However, these experimental-based models also make deep learning long criticized for principle and interpretability. Deep learning originated from the concept of neurons in neuroscience, but recent designs detached natural neural networks except for some simple concepts. In this paper, we build an artificial neural network, CVSNet, which can be seen as a computer implementation for central visual system of the brain. Each block in CVSNet represents the same vision information as that in brains. In CVSNet, blocks differs from each other and visual information flows through three independent pathways and five different blocks. Thus CVSNet is completely different from the design of all previous models, in which basic blocks are repeated to build model and information ",
    "path": "papers/23/05/2305.19492.json",
    "total_tokens": 844,
    "translated_title": "CVSNet：大脑中央视觉系统的计算机实现",
    "translated_abstract": "在计算机视觉中，不同的基础模块围绕着不同的矩阵运算创建，并且基于这些基础模块的模型已经取得了良好的结果。然而，这些基于实验的模型也使得深度学习长期以来受到原理和可解释性方面的批评。本文中，我们构建了一个人工神经网络——CVSNet，可以看作是大脑中央视觉系统的计算机实现。CVSNet中的每个块都表示与大脑中相同的视觉信息。CVSNet中的块彼此不同，视觉信息通过三个独立的通道和五个不同的块流动。因此，CVSNet与所有先前模型的设计完全不同，其中基础块被重复以构建模型，信息也得以传递。",
    "tldr": "本文提出了一个人工神经网络CVSNet，可以看作是大脑中央视觉系统的计算机实现，其中每个块都表示与大脑中相同的视觉信息，通过三个独立的通道和五个不同的块流动。",
    "en_tdlr": "The paper proposes an artificial neural network, CVSNet, which can be seen as a computer implementation for central visual system of the brain. The network consists of blocks representing the same visual information as those in the brain and visual information flows through three independent pathways and five different blocks."
}