{
    "title": "BERM: Training the Balanced and Extractable Representation for Matching to Improve Generalization Ability of Dense Retrieval. (arXiv:2305.11052v1 [cs.IR])",
    "abstract": "Dense retrieval has shown promise in the first-stage retrieval process when trained on in-domain labeled datasets. However, previous studies have found that dense retrieval is hard to generalize to unseen domains due to its weak modeling of domain-invariant and interpretable feature (i.e., matching signal between two texts, which is the essence of information retrieval). In this paper, we propose a novel method to improve the generalization of dense retrieval via capturing matching signal called BERM. Fully fine-grained expression and query-oriented saliency are two properties of the matching signal. Thus, in BERM, a single passage is segmented into multiple units and two unit-level requirements are proposed for representation as the constraint in training to obtain the effective matching signal. One is semantic unit balance and the other is essential matching unit extractability. Unit-level view and balanced semantics make representation express the text in a fine-grained manner. Esse",
    "link": "http://arxiv.org/abs/2305.11052",
    "context": "Title: BERM: Training the Balanced and Extractable Representation for Matching to Improve Generalization Ability of Dense Retrieval. (arXiv:2305.11052v1 [cs.IR])\nAbstract: Dense retrieval has shown promise in the first-stage retrieval process when trained on in-domain labeled datasets. However, previous studies have found that dense retrieval is hard to generalize to unseen domains due to its weak modeling of domain-invariant and interpretable feature (i.e., matching signal between two texts, which is the essence of information retrieval). In this paper, we propose a novel method to improve the generalization of dense retrieval via capturing matching signal called BERM. Fully fine-grained expression and query-oriented saliency are two properties of the matching signal. Thus, in BERM, a single passage is segmented into multiple units and two unit-level requirements are proposed for representation as the constraint in training to obtain the effective matching signal. One is semantic unit balance and the other is essential matching unit extractability. Unit-level view and balanced semantics make representation express the text in a fine-grained manner. Esse",
    "path": "papers/23/05/2305.11052.json",
    "total_tokens": 971,
    "translated_title": "BERM：训练平衡可提取表示以提高密集检索的泛化能力",
    "translated_abstract": "密集检索已经表现出在域内标记数据集上训练的情况下在第一阶段检索过程中有所作为。然而，以前的研究发现，由于密集检索对域不变和可解释的特征的建模较弱（即两个文本之间的匹配信号，这是信息检索的本质），因此难以推广到未见过的领域。在本文中，我们通过捕捉匹配信号提出了一种提高密集检索泛化性能的新方法，称为BERM。全面的细粒度表达和查询导向的显着性是匹配信号的两个属性。因此，在BERM中，一个单一的Passage被划分为多个单元，提出了两个单元级要求作为约束进行表示以获得有效的匹配信号。一个是语义单元平衡，另一个是必需的匹配单元可提取性。单元级视图和平衡语义使表示以细粒度的方式表达文本。必需的匹配单元可提取性确保保留信息检索的本质。在各种数据集上的实验表明，BERM在保持域内数据集上有竞争力的性能的同时，提高了算法的泛化能力。",
    "tldr": "BERM使用平衡的、可提取的特征表示法来捕捉匹配信号，从而提高了密集检索的泛化性能。",
    "en_tdlr": "BERM uses a balanced and extractable feature representation method to capture matching signal and improve the generalization ability of dense retrieval."
}