{
    "title": "Disturbance Effects on Financial Timberland Returns in Austria. (arXiv:2305.00887v1 [econ.GN])",
    "abstract": "Probability theory is applied for the effect of severe disturbances on the return rate on capital within multiannual stands growing crops. Two management regimes are discussed, rotations of even-aged plants on the one hand, and uneven-aged semi-stationary state on the other. The effect of any disturbance appears two-fold, contributing to both earnings and capitalization. Results are illustrated using data from a recently published study, regarding spruce (Picea abies) forests in Austria. The economic results differ from those of the paper where the data is presented, here indicating continuous-cover forestry is financially inferior to rotation forestry. Any severe disturbance may induce a regime shift from continuous-cover to even-aged forestry. If such a regime shift is not accepted, the disturbance losses reduce profits but do not affect capitalization, making continuous-cover forestry financially more sensitive to disturbances. Revenue from carbon rent favors the management regime w",
    "link": "http://arxiv.org/abs/2305.00887",
    "context": "Title: Disturbance Effects on Financial Timberland Returns in Austria. (arXiv:2305.00887v1 [econ.GN])\nAbstract: Probability theory is applied for the effect of severe disturbances on the return rate on capital within multiannual stands growing crops. Two management regimes are discussed, rotations of even-aged plants on the one hand, and uneven-aged semi-stationary state on the other. The effect of any disturbance appears two-fold, contributing to both earnings and capitalization. Results are illustrated using data from a recently published study, regarding spruce (Picea abies) forests in Austria. The economic results differ from those of the paper where the data is presented, here indicating continuous-cover forestry is financially inferior to rotation forestry. Any severe disturbance may induce a regime shift from continuous-cover to even-aged forestry. If such a regime shift is not accepted, the disturbance losses reduce profits but do not affect capitalization, making continuous-cover forestry financially more sensitive to disturbances. Revenue from carbon rent favors the management regime w",
    "path": "papers/23/05/2305.00887.json",
    "total_tokens": 908,
    "translated_title": "奥地利金融林地的干扰效应对回报的影响",
    "translated_abstract": "该论文运用概率论研究了林木长期种植中干扰效应对资本回报率的影响，讨论了两种管理制度，即均龄植物轮作和不均龄半稳态，任何干扰的影响都会对收益和资本化产生影响。研究结果利用奥地利云杉(Picea abies)森林的数据进行说明，在经济效益方面，数据显示与纸面相比，连续覆盖林业在财务上不如轮作林业。任何严重的干扰可能会导致从连续覆盖林业到均龄林业的制度变化。如果不接受这种制度变化，则干扰损失将降低利润但不影响资本化，使连续覆盖林业在财务效益上更容易受到干扰的影响。碳租金的收入有利于管理制度的选择。",
    "tldr": "该论文研究了在奥地利金融林地中不同管理制度下干扰效应对资本回报率的影响，并发现连续覆盖林业在经济效益上不如轮作林业，同时指出碳租金收入有利于管理制度的选择。",
    "en_tdlr": "This paper investigates the effect of disturbance on capital return rate under different management regimes in financial timberland in Austria. It finds that continuous-cover forestry is financially inferior to rotation forestry and carbon rent revenue favors the choice of management regime."
}