{
    "title": "QURG: Question Rewriting Guided Context-Dependent Text-to-SQL Semantic Parsing. (arXiv:2305.06655v1 [cs.CL])",
    "abstract": "Context-dependent Text-to-SQL aims to translate multi-turn natural language questions into SQL queries. Despite various methods have exploited context-dependence information implicitly for contextual SQL parsing, there are few attempts to explicitly address the dependencies between current question and question context. This paper presents QURG, a novel Question Rewriting Guided approach to help the models achieve adequate contextual understanding. Specifically, we first train a question rewriting model to complete the current question based on question context, and convert them into a rewriting edit matrix. We further design a two-stream matrix encoder to jointly model the rewriting relations between question and context, and the schema linking relations between natural language and structured schema. Experimental results show that QURG significantly improves the performances on two large-scale context-dependent datasets SParC and CoSQL, especially for hard and long-turn questions.",
    "link": "http://arxiv.org/abs/2305.06655",
    "context": "Title: QURG: Question Rewriting Guided Context-Dependent Text-to-SQL Semantic Parsing. (arXiv:2305.06655v1 [cs.CL])\nAbstract: Context-dependent Text-to-SQL aims to translate multi-turn natural language questions into SQL queries. Despite various methods have exploited context-dependence information implicitly for contextual SQL parsing, there are few attempts to explicitly address the dependencies between current question and question context. This paper presents QURG, a novel Question Rewriting Guided approach to help the models achieve adequate contextual understanding. Specifically, we first train a question rewriting model to complete the current question based on question context, and convert them into a rewriting edit matrix. We further design a two-stream matrix encoder to jointly model the rewriting relations between question and context, and the schema linking relations between natural language and structured schema. Experimental results show that QURG significantly improves the performances on two large-scale context-dependent datasets SParC and CoSQL, especially for hard and long-turn questions.",
    "path": "papers/23/05/2305.06655.json",
    "total_tokens": 834,
    "translated_title": "QURG: 问题重写引导下的上下文依赖性文本到SQL语义解析",
    "translated_abstract": "上下文依赖性文本到SQL的目标是将多轮自然语言问题翻译成SQL查询语句。本文提出了QURG，一种新颖的问题重写引导方法，以帮助模型实现足够的上下文理解。具体地，我们首先训练一个问题重写模型，在问题上下文的基础上完成当前问题，并将其转换为重写编辑矩阵。我们设计了一个双流矩阵编码器，来共同建模问题和上下文之间的重写关系，以及自然语言和结构化模式之间的模式链接关系。实验结果表明，QURG显著提高了两个大规模上下文依赖性数据集SParC和CoSQL的性能，特别是对于难以处理和长轮次的问题。",
    "tldr": "QURG是一种帮助文本到SQL语义解析模型实现上下文理解的新颖方法，能在SParC和CoSQL等上下文依赖性数据集上提高模型性能，特别是对于难以处理和长轮次的问题。",
    "en_tdlr": "QURG is a novel approach to help the Text-to-SQL semantic parsing models achieve contextual understanding by using a question rewriting guided method, which significantly improves the model's performance on context-dependent datasets such as SParC and CoSQL, especially for hard and long-turn questions."
}