{
    "title": "On the stability test for reproducing kernel Hilbert spaces. (arXiv:2305.02213v1 [eess.SY])",
    "abstract": "Reproducing kernel Hilbert spaces (RKHSs) are special Hilbert spaces where all the evaluation functionals are linear and bounded. They are in one-to-one correspondence with positive definite maps called kernels. Stable RKHSs enjoy the additional property of containing only functions and absolutely integrable. Necessary and sufficient conditions for RKHS stability are known in the literature: the integral operator induced by the kernel must be bounded as map between $\\mathcal{L}_{\\infty}$, the space of essentially bounded (test) functions, and $\\mathcal{L}_1$, the space of absolutely integrable functions. Considering Mercer (continuous) kernels in continuous-time and the entire discrete-time class, we show that the stability test can be reduced to the study of the kernel operator over test functions which assume (almost everywhere) only the values $\\pm 1$. They represent the same functions needed to investigate stability of any single element in the RKHS. In this way, the RKHS stability",
    "link": "http://arxiv.org/abs/2305.02213",
    "context": "Title: On the stability test for reproducing kernel Hilbert spaces. (arXiv:2305.02213v1 [eess.SY])\nAbstract: Reproducing kernel Hilbert spaces (RKHSs) are special Hilbert spaces where all the evaluation functionals are linear and bounded. They are in one-to-one correspondence with positive definite maps called kernels. Stable RKHSs enjoy the additional property of containing only functions and absolutely integrable. Necessary and sufficient conditions for RKHS stability are known in the literature: the integral operator induced by the kernel must be bounded as map between $\\mathcal{L}_{\\infty}$, the space of essentially bounded (test) functions, and $\\mathcal{L}_1$, the space of absolutely integrable functions. Considering Mercer (continuous) kernels in continuous-time and the entire discrete-time class, we show that the stability test can be reduced to the study of the kernel operator over test functions which assume (almost everywhere) only the values $\\pm 1$. They represent the same functions needed to investigate stability of any single element in the RKHS. In this way, the RKHS stability",
    "path": "papers/23/05/2305.02213.json",
    "total_tokens": 921,
    "translated_title": "关于再生核希尔伯特空间的稳定性检测",
    "translated_abstract": "再生核希尔伯特空间(RKHSs)是一种特殊的希尔伯特空间，其所有评估泛函都是线性且有界的。它们与称为核的正定映射一一对应。稳定的RKHSs具有仅包含函数和绝对可积的附加属性。已知文献中RKHS稳定性的必要和充分条件：由核引起的积分算子必须作为从本质有界（测试）函数的空间$\\mathcal{L}_{\\infty}$到绝对可积函数的空间$\\mathcal{L}_1$的映射被限制。考虑连续时间的Mercer(连续)核和整个离散时间类，我们证明了稳定性测试可以简化为对核算子在仅取$\\pm 1$值(几乎处处)的测试函数上的研究。它们代表了研究RKHS中任何单个元素的稳定性所需的相同函数。通过这种方式，RKHS的稳定性测试被简化为涉及有限数量的测试函数的两级测试问题。",
    "tldr": "论文研究了再生核希尔伯特空间的稳定性，提出了对核算子在仅取$\\pm 1$值的测试函数上进行的简化稳定性测试方法。",
    "en_tdlr": "The paper investigates the stability of reproducing kernel Hilbert spaces and proposes a simplified stability test method based on testing the kernel operator over test functions which assume only the values $\\pm 1$."
}