{
    "title": "A Novel Deep Learning based Model for Erythrocytes Classification and Quantification in Sickle Cell Disease. (arXiv:2305.01663v1 [q-bio.QM])",
    "abstract": "The shape of erythrocytes or red blood cells is altered in several pathological conditions. Therefore, identifying and quantifying different erythrocyte shapes can help diagnose various diseases and assist in designing a treatment strategy. Machine Learning (ML) can be efficiently used to identify and quantify distorted erythrocyte morphologies. In this paper, we proposed a customized deep convolutional neural network (CNN) model to classify and quantify the distorted and normal morphology of erythrocytes from the images taken from the blood samples of patients suffering from Sickle cell disease ( SCD). We chose SCD as a model disease condition due to the presence of diverse erythrocyte morphologies in the blood samples of SCD patients. For the analysis, we used 428 raw microscopic images of SCD blood samples and generated the dataset consisting of 10, 377 single-cell images. We focused on three well-defined erythrocyte shapes, including discocytes, oval, and sickle. We used 18 layered",
    "link": "http://arxiv.org/abs/2305.01663",
    "context": "Title: A Novel Deep Learning based Model for Erythrocytes Classification and Quantification in Sickle Cell Disease. (arXiv:2305.01663v1 [q-bio.QM])\nAbstract: The shape of erythrocytes or red blood cells is altered in several pathological conditions. Therefore, identifying and quantifying different erythrocyte shapes can help diagnose various diseases and assist in designing a treatment strategy. Machine Learning (ML) can be efficiently used to identify and quantify distorted erythrocyte morphologies. In this paper, we proposed a customized deep convolutional neural network (CNN) model to classify and quantify the distorted and normal morphology of erythrocytes from the images taken from the blood samples of patients suffering from Sickle cell disease ( SCD). We chose SCD as a model disease condition due to the presence of diverse erythrocyte morphologies in the blood samples of SCD patients. For the analysis, we used 428 raw microscopic images of SCD blood samples and generated the dataset consisting of 10, 377 single-cell images. We focused on three well-defined erythrocyte shapes, including discocytes, oval, and sickle. We used 18 layered",
    "path": "papers/23/05/2305.01663.json",
    "total_tokens": 993,
    "translated_title": "一种新型的基于深度学习的镰状细胞疾病红细胞分类和定量模型",
    "translated_abstract": "红细胞或血细胞在多种病理条件下形态发生改变，因此鉴定和量化不同的红细胞形态可以帮助诊断各种疾病并协助制定治疗策略。机器学习(ML)可以有效地用于识别和量化变形的红细胞形态。本文中，我们提出了一个定制的深度卷积神经网络(CNN)模型，用于分类和量化来自患有镰状细胞病(SCD)的患者血液样本图像中扭曲和正常形态的红细胞。我们选择SCD作为模型疾病状态，因为SCD患者血样中存在各种红细胞形态。为了分析，我们使用了428张SCD血样的原始显微镜图像，并生成了由10,377张单个细胞图像组成的数据集。我们专注于三种明确定义的红细胞形态，包括盘形细胞、椭圆形和镰刀形。我们使用包含18个层的CNN进行分类。",
    "tldr": "本研究提出了一种深度学习模型，能够识别和量化血液样本图像中扭曲和正常形态的红细胞，并且在镰状细胞疾病这一模型疾病状态下表现良好。",
    "en_tdlr": "This study proposes a deep learning model that can identify and quantify distorted and normal erythrocyte morphology from blood sample images, and performs well in the model disease condition of sickle cell disease."
}