{
    "title": "Application of Artificial Intelligence in the Classification of Microscopical Starch Images for Drug Formulation. (arXiv:2305.05321v1 [cs.CV])",
    "abstract": "Starches are important energy sources found in plants with many uses in the pharmaceutical industry such as binders, disintegrants, bulking agents in drugs and thus require very careful physicochemical analysis for proper identification and verification which includes microscopy. In this work, we applied artificial intelligence techniques (using transfer learning and deep convolution neural network CNNs to microscopical images obtained from 9 starch samples of different botanical sources. Our approach obtained an accuracy of 61% when the machine learning model was pretrained on microscopic images from MicroNet dataset. However the accuracy jumped to 81% for model pretrained on random day to day images obtained from Imagenet dataset. The model pretrained on the imagenet dataset also showed a better precision, recall and f1 score than that pretrained on the imagenet dataset.",
    "link": "http://arxiv.org/abs/2305.05321",
    "context": "Title: Application of Artificial Intelligence in the Classification of Microscopical Starch Images for Drug Formulation. (arXiv:2305.05321v1 [cs.CV])\nAbstract: Starches are important energy sources found in plants with many uses in the pharmaceutical industry such as binders, disintegrants, bulking agents in drugs and thus require very careful physicochemical analysis for proper identification and verification which includes microscopy. In this work, we applied artificial intelligence techniques (using transfer learning and deep convolution neural network CNNs to microscopical images obtained from 9 starch samples of different botanical sources. Our approach obtained an accuracy of 61% when the machine learning model was pretrained on microscopic images from MicroNet dataset. However the accuracy jumped to 81% for model pretrained on random day to day images obtained from Imagenet dataset. The model pretrained on the imagenet dataset also showed a better precision, recall and f1 score than that pretrained on the imagenet dataset.",
    "path": "papers/23/05/2305.05321.json",
    "total_tokens": 899,
    "translated_title": "人工智能在药物制剂中显微淀粉图像分类中的应用",
    "translated_abstract": "淀粉是植物中重要的能量来源，具有许多医药工业中的用途，如药品中的粘合剂、崩解剂和增塑剂，因此需要非常仔细的物理化学分析进行正确的识别和验证，包括显微镜检查。本研究利用人工智能技术（使用转移学习和深度卷积神经网络CNN对来自9种植物来源的淀粉样本的显微图像进行分类。当机器学习模型在来自MicroNet数据集的显微图像上进行预训练时，我们的方法获得了61%的准确率。然而，在使用从Imagenet数据集获得的随机日常图像进行预训练时，准确率跃升至81%。与在MicroNet数据集上预训练的模型相比，Imagenet预训练模型还显示出更好的精度、召回率和f1得分。",
    "tldr": "本研究利用人工智能技术，通过转移学习和深度卷积神经网络对不同植物来源的淀粉显微图像进行分类，实现了81%的分类准确率和更优的精度、召回率和f1得分。",
    "en_tdlr": "This study applied artificial intelligence techniques, using transfer learning and deep convolution neural network, for classification of microscopical images of starch samples from different botanical sources, achieving an accuracy of 81% with better precision, recall, and f1 score in model pretrained on random daily images obtained from Imagenet dataset."
}