{
    "title": "Exploring the cloud of feature interaction scores in a Rashomon set. (arXiv:2305.10181v1 [cs.LG])",
    "abstract": "Interactions among features are central to understanding the behavior of machine learning models. Recent research has made significant strides in detecting and quantifying feature interactions in single predictive models. However, we argue that the feature interactions extracted from a single pre-specified model may not be trustworthy since: a well-trained predictive model may not preserve the true feature interactions and there exist multiple well-performing predictive models that differ in feature interaction strengths. Thus, we recommend exploring feature interaction strengths in a model class of approximately equally accurate predictive models. In this work, we introduce the feature interaction score (FIS) in the context of a Rashomon set, representing a collection of models that achieve similar accuracy on a given task. We propose a general and practical algorithm to calculate the FIS in the model class. We demonstrate the properties of the FIS via synthetic data and draw connecti",
    "link": "http://arxiv.org/abs/2305.10181",
    "context": "Title: Exploring the cloud of feature interaction scores in a Rashomon set. (arXiv:2305.10181v1 [cs.LG])\nAbstract: Interactions among features are central to understanding the behavior of machine learning models. Recent research has made significant strides in detecting and quantifying feature interactions in single predictive models. However, we argue that the feature interactions extracted from a single pre-specified model may not be trustworthy since: a well-trained predictive model may not preserve the true feature interactions and there exist multiple well-performing predictive models that differ in feature interaction strengths. Thus, we recommend exploring feature interaction strengths in a model class of approximately equally accurate predictive models. In this work, we introduce the feature interaction score (FIS) in the context of a Rashomon set, representing a collection of models that achieve similar accuracy on a given task. We propose a general and practical algorithm to calculate the FIS in the model class. We demonstrate the properties of the FIS via synthetic data and draw connecti",
    "path": "papers/23/05/2305.10181.json",
    "total_tokens": 914,
    "translated_title": "探索拉绍蒙集合中特征交互得分的云",
    "translated_abstract": "特征间的相互作用是理解机器学习模型行为的核心。最近的研究在单个预测模型中检测和量化特征交互方面取得了重大进展。然而，我们认为从单个预先指定的模型中提取的特征交互可能不可信，因为：一个训练良好的预测模型可能不会保留真实的特征交互，存在多个在特征交互强度方面存在差异但准确性相近的预测模型。因此，我们建议在准确性近似相等的预测模型类中探索特征交互强度。在这项工作中，我们在拉绍蒙集合的上下文中引入了特征交互分数（FIS），表示在给定任务上实现类似准确性的模型集合。我们提出了一种通用且实用的算法来计算模型类中的FIS。我们通过合成数据展示了FIS的属性，并建立了与单个模型中提取的交互特征的联系。",
    "tldr": "本文通过探索拉绍蒙集合中准确性类似的模型，引入了特征交互分数（FIS）来检测特征的相互作用。相较于从单个预先指定的模型中提取特征交互，本文提供了更为可靠的方式。",
    "en_tdlr": "This paper introduces the feature interaction score (FIS) to detect feature interactions by exploring models in a Rashomon set with similar accuracy, providing a more reliable way than extracting feature interactions from a single pre-specified model."
}