{
    "title": "Revenge of MLP in Sequential Recommendation. (arXiv:2305.14675v1 [cs.LG])",
    "abstract": "Sequential recommendation models sequences of historical user-item interactive behaviors (or referred as token) to better infer dynamic preferences. Fueled by the improved neural network architectures such as RNN, CNN and Transformer, this field has enjoyed rapid performance boost in the past years. Recent progress on all-MLP models lights on an efficient method with less intensive computation, token-mixing MLP, to learn the transformation patterns among historical behaviors. However, due to the inherent fully-connection design that allows the unrestricted cross-token communication and ignores the chronological order, we find that directly applying token-mixing MLP into sequential recommendation leads to subpar performance. In this paper, we present a purely MLP-based sequential recommendation architecture TriMLP with a novel \\underline{Tri}angular Mixer where the modified \\underline{MLP} endows tokens with ordered interactions. As the cross-token interaction in MLP is actually matrix ",
    "link": "http://arxiv.org/abs/2305.14675",
    "context": "Title: Revenge of MLP in Sequential Recommendation. (arXiv:2305.14675v1 [cs.LG])\nAbstract: Sequential recommendation models sequences of historical user-item interactive behaviors (or referred as token) to better infer dynamic preferences. Fueled by the improved neural network architectures such as RNN, CNN and Transformer, this field has enjoyed rapid performance boost in the past years. Recent progress on all-MLP models lights on an efficient method with less intensive computation, token-mixing MLP, to learn the transformation patterns among historical behaviors. However, due to the inherent fully-connection design that allows the unrestricted cross-token communication and ignores the chronological order, we find that directly applying token-mixing MLP into sequential recommendation leads to subpar performance. In this paper, we present a purely MLP-based sequential recommendation architecture TriMLP with a novel \\underline{Tri}angular Mixer where the modified \\underline{MLP} endows tokens with ordered interactions. As the cross-token interaction in MLP is actually matrix ",
    "path": "papers/23/05/2305.14675.json",
    "total_tokens": 847,
    "translated_title": "MLP在顺序推荐中的复仇",
    "translated_abstract": "顺序推荐模型对历史用户-物品交互行为序列进行建模，以更好地推断动态偏好。近年来，得益于改进的神经网络架构，如RNN、CNN和Transformer，这个领域已经迎来了快速的性能提升。最近，全MLP模型的研究成果引发了人们对一种高效的方法的注意，即通过混合历史行为的MLP学习转换模式。然而，由于这种全连接结构允许不受限制的跨行为间通信并忽略了时间顺序，我们发现直接将混合MLP应用于顺序推荐会导致较差的性能。本文提出了一种纯MLP顺序推荐架构TriMLP，其中包括一种新颖的三角形混合器，改进后的MLP赋予了标记有序的交互。由于MLP中的跨标记交互实际上是矩阵...",
    "tldr": "本文提出了一种纯MLP顺序推荐架构TriMLP，其中加入了新颖的三角形混合器以实现标记有序的交互，以提高顺序推荐的性能表现。",
    "en_tdlr": "The paper proposes a purely MLP-based sequential recommendation architecture TriMLP, incorporating a novel triangular mixer for ordered interactions among tokens to improve performance in sequential recommendation."
}