{
    "title": "DeepTextMark: Deep Learning based Text Watermarking for Detection of Large Language Model Generated Text. (arXiv:2305.05773v1 [cs.MM])",
    "abstract": "The capabilities of text generators have grown with the rapid development of Large Language Models (LLM). To prevent potential misuse, the ability to detect whether texts are produced by LLM has become increasingly important. Several related works have attempted to solve this problem using binary classifiers that categorize input text as human-written or LLM-generated. However, these classifiers have been shown to be unreliable. As impactful decisions could be made based on the result of the classification, the text source detection needs to be high-quality. To this end, this paper presents DeepTextMark, a deep learning-based text watermarking method for text source detection. Applying Word2Vec and Sentence Encoding for watermark insertion and a transformer-based classifier for watermark detection, DeepTextMark achieves blindness, robustness, imperceptibility, and reliability simultaneously. As discussed further in the paper, these traits are indispensable for generic text source detec",
    "link": "http://arxiv.org/abs/2305.05773",
    "context": "Title: DeepTextMark: Deep Learning based Text Watermarking for Detection of Large Language Model Generated Text. (arXiv:2305.05773v1 [cs.MM])\nAbstract: The capabilities of text generators have grown with the rapid development of Large Language Models (LLM). To prevent potential misuse, the ability to detect whether texts are produced by LLM has become increasingly important. Several related works have attempted to solve this problem using binary classifiers that categorize input text as human-written or LLM-generated. However, these classifiers have been shown to be unreliable. As impactful decisions could be made based on the result of the classification, the text source detection needs to be high-quality. To this end, this paper presents DeepTextMark, a deep learning-based text watermarking method for text source detection. Applying Word2Vec and Sentence Encoding for watermark insertion and a transformer-based classifier for watermark detection, DeepTextMark achieves blindness, robustness, imperceptibility, and reliability simultaneously. As discussed further in the paper, these traits are indispensable for generic text source detec",
    "path": "papers/23/05/2305.05773.json",
    "total_tokens": 1000,
    "translated_title": "DeepTextMark：基于深度学习的文本水印技术用于检测大语言模型生成的文本",
    "translated_abstract": "随着大型语言模型（LLM）的迅速发展，文本生成器的能力得到了提升。为了防止潜在的滥用，检测文本是否由LLM生成变得越来越重要。一些相关的工作试图使用将输入文本分类为人类编写的或LLM生成的二元分类器来解决这个问题。然而，这些分类器已被证明是不可靠的。由于分类结果可能对具有影响力的决策产生影响，文本源的检测需要具有高质量。为此，本文提出了DeepTextMark，一种基于深度学习的文本水印方法，用于文本源检测。DeepTextMark通过应用Word2Vec和句子编码进行水印插入，并使用基于Transformer的分类器进行水印检测，同时实现了盲目性、鲁棒性、隐蔽性和可靠性。正如本文所进一步讨论的那样，这些特性对于通用文本源检测是不可或缺的，并且DeepTextMark在水印检测精度和抵抗攻击方面优于现有方法。",
    "tldr": "本文提出了一种基于深度学习的文本水印技术DeepTextMark，可用于检测大语言模型生成的文本。该技术实现了盲目性、鲁棒性、隐蔽性和可靠性，并在水印检测精度和抵抗攻击方面优于现有方法。",
    "en_tdlr": "This paper presents a deep learning-based text watermarking method, DeepTextMark, for detecting text generated by large language models. It achieves blindness, robustness, imperceptibility, and reliability simultaneously and outperforms existing methods in watermark detection accuracy and resistance to attacks."
}