{
    "title": "Are VAEs Bad at Reconstructing Molecular Graphs?. (arXiv:2305.03041v1 [cs.LG])",
    "abstract": "Many contemporary generative models of molecules are variational auto-encoders of molecular graphs. One term in their training loss pertains to reconstructing the input, yet reconstruction capabilities of state-of-the-art models have not yet been thoroughly compared on a large and chemically diverse dataset. In this work, we show that when several state-of-the-art generative models are evaluated under the same conditions, their reconstruction accuracy is surprisingly low, worse than what was previously reported on seemingly harder datasets. However, we show that improving reconstruction does not directly lead to better sampling or optimization performance. Failed reconstructions from the MoLeR model are usually similar to the inputs, assembling the same motifs in a different way, and possess similar chemical properties such as solubility. Finally, we show that the input molecule and its failed reconstruction are usually mapped by the different encoders to statistically distinguishable ",
    "link": "http://arxiv.org/abs/2305.03041",
    "context": "Title: Are VAEs Bad at Reconstructing Molecular Graphs?. (arXiv:2305.03041v1 [cs.LG])\nAbstract: Many contemporary generative models of molecules are variational auto-encoders of molecular graphs. One term in their training loss pertains to reconstructing the input, yet reconstruction capabilities of state-of-the-art models have not yet been thoroughly compared on a large and chemically diverse dataset. In this work, we show that when several state-of-the-art generative models are evaluated under the same conditions, their reconstruction accuracy is surprisingly low, worse than what was previously reported on seemingly harder datasets. However, we show that improving reconstruction does not directly lead to better sampling or optimization performance. Failed reconstructions from the MoLeR model are usually similar to the inputs, assembling the same motifs in a different way, and possess similar chemical properties such as solubility. Finally, we show that the input molecule and its failed reconstruction are usually mapped by the different encoders to statistically distinguishable ",
    "path": "papers/23/05/2305.03041.json",
    "total_tokens": 745,
    "translated_title": "VAE在重构分子结构方面效果如何？",
    "translated_abstract": "当前许多分子的生成模型为分子图的变分自编码器。然而，最先进的模型在大规模且化学多样化的数据集上的重构能力尚未得到充分比较。在本文中，我们展示了当几个最先进的生成模型在相同条件下进行评估时，它们的重构准确性惊人的低，甚至不如之前看似更难的数据集。然而，我们还表明，提高重构并不直接导致更好的采样或优化性能。",
    "tldr": "本文研究了最先进的分子生成模型在大规模、化学多样化数据集上的重构性能，发现重构准确性惊人地低。然而，改善重构并不一定会带来更好的采样或优化性能。",
    "en_tdlr": "This article examines the reconstruction capabilities of state-of-the-art generative models of molecules on a large and chemically diverse dataset, and finds that the reconstruction accuracy is surprisingly low. However, improving reconstruction does not necessarily lead to better sampling or optimization performance."
}