{
    "title": "Private Experimentation, Data Truncation, and Verifiable Disclosure. (arXiv:2305.04231v1 [econ.TH])",
    "abstract": "A sender seeks to persuade a receiver by presenting evidence obtained through a sequence of private experiments. The sender has complete flexibility in his choice of experiments, contingent on the private experimentation history. The sender can disclose each experiment outcome credibly, but cannot prove whether he has disclosed everything. By requiring `continuous disclosure', I first show that the private sequential experimentation problem can be reformulated into a static one, in which the sender chooses a single signal to learn about the state. Using this observation, I derive necessary conditions for a signal to be chosen in equilibrium, and then identify the set of beliefs induced by such signals. Finally, I characterize sender-optimal signals from the concavification of his value function constrained to this set.",
    "link": "http://arxiv.org/abs/2305.04231",
    "context": "Title: Private Experimentation, Data Truncation, and Verifiable Disclosure. (arXiv:2305.04231v1 [econ.TH])\nAbstract: A sender seeks to persuade a receiver by presenting evidence obtained through a sequence of private experiments. The sender has complete flexibility in his choice of experiments, contingent on the private experimentation history. The sender can disclose each experiment outcome credibly, but cannot prove whether he has disclosed everything. By requiring `continuous disclosure', I first show that the private sequential experimentation problem can be reformulated into a static one, in which the sender chooses a single signal to learn about the state. Using this observation, I derive necessary conditions for a signal to be chosen in equilibrium, and then identify the set of beliefs induced by such signals. Finally, I characterize sender-optimal signals from the concavification of his value function constrained to this set.",
    "path": "papers/23/05/2305.04231.json",
    "total_tokens": 774,
    "translated_title": "私人实验、数据截断和可验证披露",
    "translated_abstract": "发送方通过展示通过一系列私人实验获得的证据来说服接收方。发送方在选择实验时具有完全的灵活性，取决于私人实验历史。发送方可以可靠地披露每个实验结果，但无法证明是否已经披露了所有内容。通过要求“连续披露”，我首先展示了私人顺序实验问题可以重构为静态实验问题，其中发送方选择单个信号来了解状态。利用这一观察，我推导出在均衡中选择信号的必要条件，然后确定这些信号所诱导的信念集。最后，我通过在这个集合上约束他的价值函数的下凸化来表征发送方最优信号。",
    "tldr": "发送方通过一系列私人实验获得证据，该问题可转化为一个静态实验问题，其选择一个信号来了解状态并进行连续披露。最优信号通过规定的下凸函数进行约束。",
    "en_tdlr": "The sender persuades the receiver with evidence obtained through a sequence of private experiments, presenting each outcome credibly but unable to prove that everything has been disclosed. The problem can be reformulated into a static one with a single signal learned through continuous disclosure. The sender's optimal signal is characterized by a constrained concave value function."
}