{
    "title": "Koopa: Learning Non-stationary Time Series Dynamics with Koopman Predictors. (arXiv:2305.18803v2 [cs.LG] UPDATED)",
    "abstract": "Real-world time series are characterized by intrinsic non-stationarity that poses a principal challenge for deep forecasting models. While previous models suffer from complicated series variations induced by changing temporal distribution, we tackle non-stationary time series with modern Koopman theory that fundamentally considers the underlying time-variant dynamics. Inspired by Koopman theory of portraying complex dynamical systems, we disentangle time-variant and time-invariant components from intricate non-stationary series by Fourier Filter and design Koopman Predictor to advance respective dynamics forward. Technically, we propose Koopa as a novel Koopman forecaster composed of stackable blocks that learn hierarchical dynamics. Koopa seeks measurement functions for Koopman embedding and utilizes Koopman operators as linear portraits of implicit transition. To cope with time-variant dynamics that exhibits strong locality, Koopa calculates context-aware operators in the temporal ne",
    "link": "http://arxiv.org/abs/2305.18803",
    "context": "Title: Koopa: Learning Non-stationary Time Series Dynamics with Koopman Predictors. (arXiv:2305.18803v2 [cs.LG] UPDATED)\nAbstract: Real-world time series are characterized by intrinsic non-stationarity that poses a principal challenge for deep forecasting models. While previous models suffer from complicated series variations induced by changing temporal distribution, we tackle non-stationary time series with modern Koopman theory that fundamentally considers the underlying time-variant dynamics. Inspired by Koopman theory of portraying complex dynamical systems, we disentangle time-variant and time-invariant components from intricate non-stationary series by Fourier Filter and design Koopman Predictor to advance respective dynamics forward. Technically, we propose Koopa as a novel Koopman forecaster composed of stackable blocks that learn hierarchical dynamics. Koopa seeks measurement functions for Koopman embedding and utilizes Koopman operators as linear portraits of implicit transition. To cope with time-variant dynamics that exhibits strong locality, Koopa calculates context-aware operators in the temporal ne",
    "path": "papers/23/05/2305.18803.json",
    "total_tokens": 924,
    "translated_title": "Koopa: 使用Koopman预测器学习非平稳时间序列动态",
    "translated_abstract": "实际时间序列具有内在的非平稳性，对于深度预测模型而言是一个主要挑战。我们使用现代Koopman理论来处理非平稳时间序列，该理论从根本上考虑了底层的时间变化动态。受到描述复杂动力系统的Koopman理论的启发，我们通过傅里叶滤波器将非平稳序列中的时间变体和时间不变成分分离出来，并设计了Koopman预测器来推进各自的动态。技术上，我们提出了一种名为Koopa的新型Koopman预测器，它由可堆叠的块组成，学习分层动态。Koopa寻找Koopman嵌入的测量函数，并利用Koopman算子作为隐含转换的线性表述。为了处理具有强局部性的时间变体动态，Koopa在时间邻域中计算上下文感知算子。",
    "tldr": "本论文提出了一种名为Koopa的Koopman预测器，通过使用傅里叶滤波器将非平稳时间序列中的时间变体和时间不变成分分离出来，并使用Koopman算子作为线性表述，成功解决了深度预测模型在处理非平稳时间序列时面临的挑战。",
    "en_tdlr": "This paper proposes a Koopman Predictor called Koopa, which tackles the challenge of dealing with non-stationary time series in deep forecasting models. By disentangling time-variant and time-invariant components using Fourier Filter and utilizing Koopman operators as linear representations, Koopa successfully addresses the complications induced by changing temporal distribution."
}