{
    "title": "Impact of Deep Learning Libraries on Online Adaptive Lightweight Time Series Anomaly Detection. (arXiv:2305.00595v1 [cs.LG])",
    "abstract": "Providing online adaptive lightweight time series anomaly detection without human intervention and domain knowledge is highly valuable. Several such anomaly detection approaches have been introduced in the past years, but all of them were only implemented in one deep learning library. With the development of deep learning libraries, it is unclear how different deep learning libraries impact these anomaly detection approaches since there is no such evaluation available. Randomly choosing a deep learning library to implement an anomaly detection approach might not be able to show the true performance of the approach. It might also mislead users in believing one approach is better than another. Therefore, in this paper, we investigate the impact of deep learning libraries on online adaptive lightweight time series anomaly detection by implementing two state-of-the-art anomaly detection approaches in three well-known deep learning libraries and evaluating how these two approaches are indiv",
    "link": "http://arxiv.org/abs/2305.00595",
    "context": "Title: Impact of Deep Learning Libraries on Online Adaptive Lightweight Time Series Anomaly Detection. (arXiv:2305.00595v1 [cs.LG])\nAbstract: Providing online adaptive lightweight time series anomaly detection without human intervention and domain knowledge is highly valuable. Several such anomaly detection approaches have been introduced in the past years, but all of them were only implemented in one deep learning library. With the development of deep learning libraries, it is unclear how different deep learning libraries impact these anomaly detection approaches since there is no such evaluation available. Randomly choosing a deep learning library to implement an anomaly detection approach might not be able to show the true performance of the approach. It might also mislead users in believing one approach is better than another. Therefore, in this paper, we investigate the impact of deep learning libraries on online adaptive lightweight time series anomaly detection by implementing two state-of-the-art anomaly detection approaches in three well-known deep learning libraries and evaluating how these two approaches are indiv",
    "path": "papers/23/05/2305.00595.json",
    "total_tokens": 832,
    "translated_title": "深度学习库对在线自适应轻量级时间序列异常检测的影响",
    "translated_abstract": "在没有人为干预和领域知识的情况下提供在线自适应轻量级时间序列异常检测非常有价值。过去几年中引入了几种这样的异常检测方法，但它们都仅在一个深度学习库中实现。随着深度学习库的发展，不同的深度学习库如何影响这些异常检测方法尚不清楚，因为没有这样的评估。随机选择一个深度学习库来实现异常检测方法可能不能展现出该方法的真实性能，这可能会误导用户相信某种方法比另一种更好。因此，在本文中，我们通过在三个知名深度学习库中实现两种最先进的异常检测方法，并评估这些方法的结果，来研究深度学习库对在线自适应轻量级时间序列异常检测的影响。",
    "tldr": "本文通过在三个深度学习库中实现两种最先进的方法，并进行评估，研究了深度学习库对在线自适应轻量级时间序列异常检测的影响。",
    "en_tdlr": "This paper investigates the impact of deep learning libraries on online adaptive lightweight time series anomaly detection by implementing two state-of-the-art anomaly detection approaches in three well-known deep learning libraries and evaluating their performances."
}