{
    "title": "Using a Large Language Model to Control Speaking Style for Expressive TTS. (arXiv:2305.10321v1 [cs.CL])",
    "abstract": "Appropriate prosody is critical for successful spoken communication. Contextual word embeddings are proven to be helpful in predicting prosody but do not allow for choosing between plausible prosodic renditions. Reference-based TTS models attempt to address this by conditioning speech generation on a reference speech sample. These models can generate expressive speech but this requires finding an appropriate reference.  Sufficiently large generative language models have been used to solve various language-related tasks. We explore whether such models can be used to suggest appropriate prosody for expressive TTS. We train a TTS model on a non-expressive corpus and then prompt the language model to suggest changes to pitch, energy and duration. The prompt can be designed for any task and we prompt the model to make suggestions based on target speaking style and dialogue context. The proposed method is rated most appropriate in 49.9\\% of cases compared to 31.0\\% for a baseline model.",
    "link": "http://arxiv.org/abs/2305.10321",
    "context": "Title: Using a Large Language Model to Control Speaking Style for Expressive TTS. (arXiv:2305.10321v1 [cs.CL])\nAbstract: Appropriate prosody is critical for successful spoken communication. Contextual word embeddings are proven to be helpful in predicting prosody but do not allow for choosing between plausible prosodic renditions. Reference-based TTS models attempt to address this by conditioning speech generation on a reference speech sample. These models can generate expressive speech but this requires finding an appropriate reference.  Sufficiently large generative language models have been used to solve various language-related tasks. We explore whether such models can be used to suggest appropriate prosody for expressive TTS. We train a TTS model on a non-expressive corpus and then prompt the language model to suggest changes to pitch, energy and duration. The prompt can be designed for any task and we prompt the model to make suggestions based on target speaking style and dialogue context. The proposed method is rated most appropriate in 49.9\\% of cases compared to 31.0\\% for a baseline model.",
    "path": "papers/23/05/2305.10321.json",
    "total_tokens": 918,
    "translated_title": "使用大型语言模型控制说话风格以实现表现性文本到语音合成",
    "translated_abstract": "恰当的韵律对于成功的口头交流至关重要。上下文词嵌入已被证明在预测韵律方面有所帮助，但不允许在可能的韵律演绎之间进行选择。基于参考语音的TTS模型试图通过在参考语音样本基础上生成语音来解决这个问题。这些模型可以生成富有表现力的语音，但需要找到适当的参考样本。已经使用足够大的生成语言模型来解决各种与语言相关的任务。我们探讨了这样的模型是否可以用于建议适当的韵律以实现表现性TTS。我们在非表现性语料库上训练TTS模型，然后提示语言模型建议更改音调、能量和持续时间。提示可以为任何任务设计，并根据目标说话风格和对话上下文提示模型进行建议。与基线模型的31.0％相比，所提出的方法在49.9％的情况下被评为最合适的方法。",
    "tldr": "该论文提出了一种使用大型语言模型控制TTS语音表现风格的方法。该方法可为非表现性语料库上的TTS模型提供适当的韵律建议，使其生成表现力更强的语音。",
    "en_tdlr": "This paper proposes a method for using a large language model to control the speaking style of TTS, which provides appropriate prosody suggestions for TTS models on non-expressive corpora and generates more expressive speech."
}