{
    "title": "SFCNeXt: a simple fully convolutional network for effective brain age estimation with small sample size. (arXiv:2305.18771v1 [cs.CV])",
    "abstract": "Deep neural networks (DNN) have been designed to predict the chronological age of a healthy brain from T1-weighted magnetic resonance images (T1 MRIs), and the predicted brain age could serve as a valuable biomarker for the early detection of development-related or aging-related disorders. Recent DNN models for brain age estimations usually rely too much on large sample sizes and complex network structures for multi-stage feature refinement. However, in clinical application scenarios, researchers usually cannot obtain thousands or tens of thousands of MRIs in each data center for thorough training of these complex models. This paper proposes a simple fully convolutional network (SFCNeXt) for brain age estimation in small-sized cohorts with biased age distributions. The SFCNeXt consists of Single Pathway Encoded ConvNeXt (SPEC) and Hybrid Ranking Loss (HRL), aiming to estimate brain ages in a lightweight way with a sufficient exploration of MRI, age, and ranking features of each batch o",
    "link": "http://arxiv.org/abs/2305.18771",
    "context": "Title: SFCNeXt: a simple fully convolutional network for effective brain age estimation with small sample size. (arXiv:2305.18771v1 [cs.CV])\nAbstract: Deep neural networks (DNN) have been designed to predict the chronological age of a healthy brain from T1-weighted magnetic resonance images (T1 MRIs), and the predicted brain age could serve as a valuable biomarker for the early detection of development-related or aging-related disorders. Recent DNN models for brain age estimations usually rely too much on large sample sizes and complex network structures for multi-stage feature refinement. However, in clinical application scenarios, researchers usually cannot obtain thousands or tens of thousands of MRIs in each data center for thorough training of these complex models. This paper proposes a simple fully convolutional network (SFCNeXt) for brain age estimation in small-sized cohorts with biased age distributions. The SFCNeXt consists of Single Pathway Encoded ConvNeXt (SPEC) and Hybrid Ranking Loss (HRL), aiming to estimate brain ages in a lightweight way with a sufficient exploration of MRI, age, and ranking features of each batch o",
    "path": "papers/23/05/2305.18771.json",
    "total_tokens": 979,
    "translated_title": "SFCNeXt：一种用于小样本下有效的脑龄估计的简单全卷积网络",
    "translated_abstract": "深度神经网络被设计出来从T1加权磁共振图像中预测健康大脑的年龄，预测的脑龄可以作为早期检测发展相关或衰老相关疾病的有价值的生物标志物。然而，近期用于脑龄预测的深度神经网络通常过于依赖于大样本量和多阶段特征优化的复杂网络结构。在临床应用场景中，研究人员通常不能在每个数据中心获得成千上万的MRI以充分训练这些复杂的模型。本文提出了一种用于具有偏倚年龄分布的小型队列中进行脑龄估计的简单全卷积网络（SFCNeXt）。 SFCNeXt由Single Pathway Encoded ConvNeXt（SPEC）和Hybrid Ranking Loss（HRL）组成，旨在以轻量化的方式估计脑龄，并充分探索每批扫描的MRI、年龄和排名特征。",
    "tldr": "SFCNeXt是一个简单的全卷积网络，用于小型队列中进行脑龄估计，通过SPEC和HRL算法，以轻量化的方式充分探索每个批次的MRI、年龄和排名特征，避免对大量MRI的依赖和复杂模型结构。",
    "en_tdlr": "SFCNeXt is a simple fully convolutional network designed for brain age estimation with small sample sizes. It avoids over-reliance on large sample sizes and complex models by using the SPEC and HRL algorithms to explore MRI, age, and ranking features efficiently in each batch of scans."
}