{
    "title": "TransESC: Smoothing Emotional Support Conversation via Turn-Level State Transition. (arXiv:2305.03296v1 [cs.CL])",
    "abstract": "Emotion Support Conversation (ESC) is an emerging and challenging task with the goal of reducing the emotional distress of people. Previous attempts fail to maintain smooth transitions between utterances in ESC because they ignore to grasp the fine-grained transition information at each dialogue turn. To solve this problem, we propose to take into account turn-level state \\textbf{Trans}itions of \\textbf{ESC} (\\textbf{TransESC}) from three perspectives, including semantics transition, strategy transition and emotion transition, to drive the conversation in a smooth and natural way. Specifically, we construct the state transition graph with a two-step way, named transit-then-interact, to grasp such three types of turn-level transition information. Finally, they are injected into the transition-aware decoder to generate more engaging responses. Both automatic and human evaluations on the benchmark dataset demonstrate the superiority of TransESC to generate more smooth and effective suppor",
    "link": "http://arxiv.org/abs/2305.03296",
    "context": "Title: TransESC: Smoothing Emotional Support Conversation via Turn-Level State Transition. (arXiv:2305.03296v1 [cs.CL])\nAbstract: Emotion Support Conversation (ESC) is an emerging and challenging task with the goal of reducing the emotional distress of people. Previous attempts fail to maintain smooth transitions between utterances in ESC because they ignore to grasp the fine-grained transition information at each dialogue turn. To solve this problem, we propose to take into account turn-level state \\textbf{Trans}itions of \\textbf{ESC} (\\textbf{TransESC}) from three perspectives, including semantics transition, strategy transition and emotion transition, to drive the conversation in a smooth and natural way. Specifically, we construct the state transition graph with a two-step way, named transit-then-interact, to grasp such three types of turn-level transition information. Finally, they are injected into the transition-aware decoder to generate more engaging responses. Both automatic and human evaluations on the benchmark dataset demonstrate the superiority of TransESC to generate more smooth and effective suppor",
    "path": "papers/23/05/2305.03296.json",
    "total_tokens": 842,
    "tldr": "TransESC通过考虑每个对话转向的细粒度转换信息，从三个角度，即语义转换，策略转换和情感转换来实现情感支持对话的平滑过渡。"
}