{
    "title": "MLHOps: Machine Learning for Healthcare Operations. (arXiv:2305.02474v1 [cs.LG])",
    "abstract": "Machine Learning Health Operations (MLHOps) is the combination of processes for reliable, efficient, usable, and ethical deployment and maintenance of machine learning models in healthcare settings. This paper provides both a survey of work in this area and guidelines for developers and clinicians to deploy and maintain their own models in clinical practice. We cover the foundational concepts of general machine learning operations, describe the initial setup of MLHOps pipelines (including data sources, preparation, engineering, and tools). We then describe long-term monitoring and updating (including data distribution shifts and model updating) and ethical considerations (including bias, fairness, interpretability, and privacy). This work therefore provides guidance across the full pipeline of MLHOps from conception to initial and ongoing deployment.",
    "link": "http://arxiv.org/abs/2305.02474",
    "context": "Title: MLHOps: Machine Learning for Healthcare Operations. (arXiv:2305.02474v1 [cs.LG])\nAbstract: Machine Learning Health Operations (MLHOps) is the combination of processes for reliable, efficient, usable, and ethical deployment and maintenance of machine learning models in healthcare settings. This paper provides both a survey of work in this area and guidelines for developers and clinicians to deploy and maintain their own models in clinical practice. We cover the foundational concepts of general machine learning operations, describe the initial setup of MLHOps pipelines (including data sources, preparation, engineering, and tools). We then describe long-term monitoring and updating (including data distribution shifts and model updating) and ethical considerations (including bias, fairness, interpretability, and privacy). This work therefore provides guidance across the full pipeline of MLHOps from conception to initial and ongoing deployment.",
    "path": "papers/23/05/2305.02474.json",
    "total_tokens": 889,
    "translated_title": "MLHOps: 机器学习在医疗运营中的应用",
    "translated_abstract": "机器学习健康运营（MLHOps）是在医疗保健环境中可靠、高效、可用和道德的部署和维护机器学习模型的组合过程。本文提供了该领域工作的综述和开发人员、临床医生在临床实践中部署和维护自己模型的指南。我们涵盖了操作通用机器学习的基本概念，描述了MLHOps流水线的初始设置（包括数据源、准备、工程和工具）。我们随后描述了长期监测和更新（包括数据分布变化和模型更新）和道德考虑（包括偏见、公平性、可解释性和隐私）。因此，本文提供了MLHOps全流程从概念到初始和持续部署的指导。",
    "tldr": "本文综述了机器学习在医疗保健环境中应用的一般性流程，并为开发人员和临床医生提供了指南，以便他们能够部署和维护自己的模型；重点关注包括数据源、准备、工程、工具、长期监控和更新、以及道德考虑等方面，这为MLHOps全流程提供了指导。",
    "en_tdlr": "This paper provides a survey and guidelines for the reliable, efficient, usable, and ethical deployment and maintenance of machine learning models in healthcare settings, covering foundational concepts of general machine learning operations and emphasizing important considerations such as data preparation, monitoring, and ethical concerns. It offers guidance across the entire MLHOps pipeline from conception to deployment."
}