{
    "title": "Incremental Learning for Heterogeneous Structure Segmentation in Brain Tumor MRI. (arXiv:2305.19404v1 [cs.CV])",
    "abstract": "Deep learning (DL) models for segmenting various anatomical structures have achieved great success via a static DL model that is trained in a single source domain. Yet, the static DL model is likely to perform poorly in a continually evolving environment, requiring appropriate model updates. In an incremental learning setting, we would expect that well-trained static models are updated, following continually evolving target domain data -- e.g., additional lesions or structures of interest -- collected from different sites, without catastrophic forgetting. This, however, poses challenges, due to distribution shifts, additional structures not seen during the initial model training, and the absence of training data in a source domain. To address these challenges, in this work, we seek to progressively evolve an ``off-the-shelf\" trained segmentation model to diverse datasets with additional anatomical categories in a unified manner. Specifically, we first propose a divergence-aware dual-fl",
    "link": "http://arxiv.org/abs/2305.19404",
    "context": "Title: Incremental Learning for Heterogeneous Structure Segmentation in Brain Tumor MRI. (arXiv:2305.19404v1 [cs.CV])\nAbstract: Deep learning (DL) models for segmenting various anatomical structures have achieved great success via a static DL model that is trained in a single source domain. Yet, the static DL model is likely to perform poorly in a continually evolving environment, requiring appropriate model updates. In an incremental learning setting, we would expect that well-trained static models are updated, following continually evolving target domain data -- e.g., additional lesions or structures of interest -- collected from different sites, without catastrophic forgetting. This, however, poses challenges, due to distribution shifts, additional structures not seen during the initial model training, and the absence of training data in a source domain. To address these challenges, in this work, we seek to progressively evolve an ``off-the-shelf\" trained segmentation model to diverse datasets with additional anatomical categories in a unified manner. Specifically, we first propose a divergence-aware dual-fl",
    "path": "papers/23/05/2305.19404.json",
    "total_tokens": 899,
    "translated_title": "脑部肿瘤MRI异质结构分割的增量学习",
    "translated_abstract": "通过单源域训练的静态深度学习模型，在不同的解剖结构分割任务中取得了巨大的成功。但是，在不断演化的环境中，静态模型的表现可能会变差，需要适当地更新模型。在增量学习环境下，我们希望能够更新好的静态模型，跟随不断演化的目标域数据（例如，来自不同站点的额外损伤或感兴趣结构），而不会发生灾难性遗忘。然而，这也带来了一些挑战：分布的变化、在初始模型训练期间未见过的其他结构以及源域中缺乏训练数据。为了解决这些挑战，本文致力于以统一的方式逐步演化“即插即用”训练的分割模型，以应对不断增加的解剖分类数据集。具体地，我们首先提出了一种“分歧感知”的双流增量学习框架",
    "tldr": "本文提出了一种“分歧感知”的双流增量学习框架，适用于针对不断演化的目标域数据进行分割任务，解决了分布变化、未见过结构和训练数据缺失等挑战。"
}