{
    "title": "Late-Binding Scholarship in the Age of AI: Navigating Legal and Normative Challenges of a New Form of Knowledge Production. (arXiv:2305.11058v1 [cs.CY])",
    "abstract": "Artificial Intelligence (AI) is poised to enable a new leap in the creation of scholarly content. New forms of engagement with AI systems, such as collaborations with large language models like GPT-3, offer affordances that will change the nature of both the scholarly process and the artifacts it produces. This article articulates ways in which those artifacts can be written, distributed, read, organized, and stored that are more dynamic, and potentially more effective, than current academic practices. Specifically, rather than the current \"early-binding\" process (that is, one in which ideas are fully reduced to a final written form before they leave an author's desk), we propose that there are substantial benefits to a \"late-binding\" process, in which ideas are written dynamically at the moment of reading. In fact, the paradigm of \"binding\" knowledge may transition to a new model in which scholarship remains ever \"unbound\" and evolving. An alternative form for a scholarly work could b",
    "link": "http://arxiv.org/abs/2305.11058",
    "context": "Title: Late-Binding Scholarship in the Age of AI: Navigating Legal and Normative Challenges of a New Form of Knowledge Production. (arXiv:2305.11058v1 [cs.CY])\nAbstract: Artificial Intelligence (AI) is poised to enable a new leap in the creation of scholarly content. New forms of engagement with AI systems, such as collaborations with large language models like GPT-3, offer affordances that will change the nature of both the scholarly process and the artifacts it produces. This article articulates ways in which those artifacts can be written, distributed, read, organized, and stored that are more dynamic, and potentially more effective, than current academic practices. Specifically, rather than the current \"early-binding\" process (that is, one in which ideas are fully reduced to a final written form before they leave an author's desk), we propose that there are substantial benefits to a \"late-binding\" process, in which ideas are written dynamically at the moment of reading. In fact, the paradigm of \"binding\" knowledge may transition to a new model in which scholarship remains ever \"unbound\" and evolving. An alternative form for a scholarly work could b",
    "path": "papers/23/05/2305.11058.json",
    "total_tokens": 1059,
    "translated_title": "AI时代的后期绑定学术研究：应对知识生产中的法律与规范挑战",
    "translated_abstract": "人工智能（AI）有望促进学术内容的创新性发展。与大型语言模型（如GPT-3）的合作等新的与AI系统互动形式，提供了改变学术研究及其产出物质性质的条件。本文提出了一些动态编写、分发、阅读、组织和存储思想的方法，这些方法可能比当前的学术实践更加有效。我们建议采用一种“后期绑定”的过程（即在思想离开作者桌子前不完全归纳出一种最终的书面形式的过程），而非当前的“早期绑定”过程。反过来，在阅读时将思想即时书写可以在学术工作中产生“动态”的变化，这将可能形成“未绑定”的知识传递方式。这一全新的知识模式可能催生形态各异的学术作品在读者面前实时生成的局面。然而，这种新形式的知识生产也带来了一些重大的法律和规范问题，如所有权、作者身份和质量控制等。本文探讨这些挑战，并提出了在学术研究中负责任地使用AI的策略。",
    "tldr": "本文提出了一种更为动态的思想书写方式，即后期绑定过程，并探讨了AI在学术研究中的应用，但这种新形式也会带来相关法律和规范问题。",
    "en_tdlr": "This article proposes a more dynamic way of writing ideas called the \"late-binding\" process and discusses the use of AI in scholarship, while also addressing the legal and normative challenges that come with this new form of knowledge production."
}