{
    "title": "CQSumDP: A ChatGPT-Annotated Resource for Query-Focused Abstractive Summarization Based on Debatepedia. (arXiv:2305.06147v1 [cs.CL])",
    "abstract": "Debatepedia is a publicly available dataset consisting of arguments and counter-arguments on controversial topics that has been widely used for the single-document query-focused abstractive summarization task in recent years. However, it has been recently found that this dataset is limited by noise and even most queries in this dataset do not have any relevance to the respective document. In this paper, we present a methodology for cleaning the Debatepedia dataset by leveraging the generative power of large language models to make it suitable for query-focused abstractive summarization. More specifically, we harness the language generation capabilities of ChatGPT to regenerate its queries. We evaluate the effectiveness of the proposed ChatGPT annotated version of the Debatepedia dataset using several benchmark summarization models and demonstrate that the newly annotated version of Debatepedia outperforms the original dataset in terms of both query relevance as well as summary generati",
    "link": "http://arxiv.org/abs/2305.06147",
    "context": "Title: CQSumDP: A ChatGPT-Annotated Resource for Query-Focused Abstractive Summarization Based on Debatepedia. (arXiv:2305.06147v1 [cs.CL])\nAbstract: Debatepedia is a publicly available dataset consisting of arguments and counter-arguments on controversial topics that has been widely used for the single-document query-focused abstractive summarization task in recent years. However, it has been recently found that this dataset is limited by noise and even most queries in this dataset do not have any relevance to the respective document. In this paper, we present a methodology for cleaning the Debatepedia dataset by leveraging the generative power of large language models to make it suitable for query-focused abstractive summarization. More specifically, we harness the language generation capabilities of ChatGPT to regenerate its queries. We evaluate the effectiveness of the proposed ChatGPT annotated version of the Debatepedia dataset using several benchmark summarization models and demonstrate that the newly annotated version of Debatepedia outperforms the original dataset in terms of both query relevance as well as summary generati",
    "path": "papers/23/05/2305.06147.json",
    "total_tokens": 787,
    "translated_title": "基于ChatGPT和Debatepedia的查询导向摘要资源CQSumDP",
    "translated_abstract": "Debatepedia是一个公开可用的数据集，包含有关有争议的话题的论点和反驳论点，近年来已广泛用于单文档查询导向的浓缩摘要任务。然而，最近发现该数据集存在噪声，即使在该数据集中的大多数查询都与相应的文档无关。本文提出了一种方法来清理Debatepedia数据集，利用大型语言模型的生成能力使其适用于查询导向的浓缩摘要，具体而言，利用ChatGPT的语言生成能力重新生成其查询。我们使用几个基准摘要模型评估了ChatGPT注释版本的Debatepedia数据集的有效性，并证明了新注释的Debatepedia在查询相关性和摘要生成方面优于原始数据集。",
    "tldr": "本文介绍了一种利用ChatGPT重新生成其查询以清理Debatepedia数据集噪声的方法，成功提高了查询相关性和摘要生成效果。",
    "en_tdlr": "This paper presents a methodology for cleaning the noisy Debatepedia dataset by leveraging ChatGPT's language generation capabilities to regenerate its queries, and effectively improves the query relevance and summary generation performance."
}