{
    "title": "Automatic Discrimination of Human and Neural Machine Translation in Multilingual Scenarios. (arXiv:2305.19757v1 [cs.CL])",
    "abstract": "We tackle the task of automatically discriminating between human and machine translations. As opposed to most previous work, we perform experiments in a multilingual setting, considering multiple languages and multilingual pretrained language models. We show that a classifier trained on parallel data with a single source language (in our case German-English) can still perform well on English translations that come from different source languages, even when the machine translations were produced by other systems than the one it was trained on. Additionally, we demonstrate that incorporating the source text in the input of a multilingual classifier improves (i) its accuracy and (ii) its robustness on cross-system evaluation, compared to a monolingual classifier. Furthermore, we find that using training data from multiple source languages (German, Russian, and Chinese) tends to improve the accuracy of both monolingual and multilingual classifiers. Finally, we show that bilingual classifie",
    "link": "http://arxiv.org/abs/2305.19757",
    "context": "Title: Automatic Discrimination of Human and Neural Machine Translation in Multilingual Scenarios. (arXiv:2305.19757v1 [cs.CL])\nAbstract: We tackle the task of automatically discriminating between human and machine translations. As opposed to most previous work, we perform experiments in a multilingual setting, considering multiple languages and multilingual pretrained language models. We show that a classifier trained on parallel data with a single source language (in our case German-English) can still perform well on English translations that come from different source languages, even when the machine translations were produced by other systems than the one it was trained on. Additionally, we demonstrate that incorporating the source text in the input of a multilingual classifier improves (i) its accuracy and (ii) its robustness on cross-system evaluation, compared to a monolingual classifier. Furthermore, we find that using training data from multiple source languages (German, Russian, and Chinese) tends to improve the accuracy of both monolingual and multilingual classifiers. Finally, we show that bilingual classifie",
    "path": "papers/23/05/2305.19757.json",
    "total_tokens": 1021,
    "translated_title": "多语言场景中自动区分人类翻译和神经机器翻译",
    "translated_abstract": "本文致力于解决自动区分人类翻译和机器翻译的问题。与大多数先前的研究相反，我们在多语言环境下进行实验，考虑了多种语言和多语言预训练语言模型。我们发现，在我们的情境中，使用单一源语言（在本例中为德语-英语）的平行数据训练分类器，仍然能够很好地执行来自不同源语言的英语翻译的判别，甚至在机器翻译是由不同于其训练系统的其他系统生成时也是如此。此外，我们证明，在一个多语言分类器的输入中加入源文本可以提高分类器的准确性和鲁棒性，相比于单语分类器。此外，我们发现使用不同源语言的训练数据（德语、俄语和中文）往往可以提高单语和多语言分类器的准确性。最后，我们展示了双语分类器是不现实的，并证明了这一点。",
    "tldr": "本文研究在多语言环境下，如何自动区分人类翻译和机器翻译。在单一源语言的平行数据训练分类器时，我们可以很好地执行来自不同源语言的英语翻译的判别。将源文本加入多语言分类器的输入可以提高分类器的准确性和鲁棒性，使用不同源语言的训练数据往往提高单语和多语言分类器的准确性。双语分类器不可行。",
    "en_tdlr": "This paper investigates how to automatically distinguish human and machine translations in multilingual scenarios. The experiments show that a classifier trained on parallel data with a single source language can still perform well on English translations from different source languages.The accuracy and robustness of a multilingual classifier can be improved by incorporating source text in its input and using training data from multiple source languages. It is also shown that bilingual classifier is not practical."
}