{
    "title": "Semantic Role Labeling Guided Out-of-distribution Detection",
    "abstract": "arXiv:2305.18026v2 Announce Type: replace  Abstract: Identifying unexpected domain-shifted instances in natural language processing is crucial in real-world applications. Previous works identify the out-of-distribution (OOD) instance by leveraging a single global feature embedding to represent the sentence, which cannot characterize subtle OOD patterns well. Another major challenge current OOD methods face is learning effective low-dimensional sentence representations to identify the hard OOD instances that are semantically similar to the in-distribution (ID) data. In this paper, we propose a new unsupervised OOD detection method, namely Semantic Role Labeling Guided Out-of-distribution Detection (SRLOOD), that separates, extracts, and learns the semantic role labeling (SRL) guided fine-grained local feature representations from different arguments of a sentence and the global feature representations of the full sentence using a margin-based contrastive loss. A novel self-supervised ap",
    "link": "https://arxiv.org/abs/2305.18026",
    "context": "Title: Semantic Role Labeling Guided Out-of-distribution Detection\nAbstract: arXiv:2305.18026v2 Announce Type: replace  Abstract: Identifying unexpected domain-shifted instances in natural language processing is crucial in real-world applications. Previous works identify the out-of-distribution (OOD) instance by leveraging a single global feature embedding to represent the sentence, which cannot characterize subtle OOD patterns well. Another major challenge current OOD methods face is learning effective low-dimensional sentence representations to identify the hard OOD instances that are semantically similar to the in-distribution (ID) data. In this paper, we propose a new unsupervised OOD detection method, namely Semantic Role Labeling Guided Out-of-distribution Detection (SRLOOD), that separates, extracts, and learns the semantic role labeling (SRL) guided fine-grained local feature representations from different arguments of a sentence and the global feature representations of the full sentence using a margin-based contrastive loss. A novel self-supervised ap",
    "path": "papers/23/05/2305.18026.json",
    "total_tokens": 797,
    "translated_title": "句义角色标注引导的领域外检测",
    "translated_abstract": "在自然语言处理中，识别意外的领域转移实例对于实际应用至关重要。以前的工作通过利用单一的全局特征嵌入来表示句子来识别领域外（OOD）实例，但不能很好地刻画微妙的OOD模式。本文提出一种新的无监督OOD检测方法，即句义角色标注引导的领域外检测（SRLOOD），通过基于边缘的对比损失将句子不同论点的语义角色标注（SRL）引导的细粒度局部特征表示与句子的全局特征表示分离、提取并学习。",
    "tldr": "本文提出了一种新的无监督领域外检测方法SRLOOD，通过语义角色标注引导的方式从句子的不同论点中分离、提取和学习局部特征表示，并结合全局特征表示，以边缘为基础进行对比损失。",
    "en_tdlr": "This paper proposes a new unsupervised out-of-distribution detection method, SRLOOD, which separates, extracts, and learns fine-grained local feature representations guided by semantic role labeling from different arguments of a sentence and global feature representations, using a margin-based contrastive loss."
}