{
    "title": "Diagnostic Spatio-temporal Transformer with Faithful Encoding. (arXiv:2305.17149v1 [cs.LG])",
    "abstract": "This paper addresses the task of anomaly diagnosis when the underlying data generation process has a complex spatio-temporal (ST) dependency. The key technical challenge is to extract actionable insights from the dependency tensor characterizing high-order interactions among temporal and spatial indices. We formalize the problem as supervised dependency discovery, where the ST dependency is learned as a side product of multivariate time-series classification. We show that temporal positional encoding used in existing ST transformer works has a serious limitation in capturing higher frequencies (short time scales). We propose a new positional encoding with a theoretical guarantee, based on discrete Fourier transform. We also propose a new ST dependency discovery framework, which can provide readily consumable diagnostic information in both spatial and temporal directions. Finally, we demonstrate the utility of the proposed model, DFStrans (Diagnostic Fourier-based Spatio-temporal Transf",
    "link": "http://arxiv.org/abs/2305.17149",
    "context": "Title: Diagnostic Spatio-temporal Transformer with Faithful Encoding. (arXiv:2305.17149v1 [cs.LG])\nAbstract: This paper addresses the task of anomaly diagnosis when the underlying data generation process has a complex spatio-temporal (ST) dependency. The key technical challenge is to extract actionable insights from the dependency tensor characterizing high-order interactions among temporal and spatial indices. We formalize the problem as supervised dependency discovery, where the ST dependency is learned as a side product of multivariate time-series classification. We show that temporal positional encoding used in existing ST transformer works has a serious limitation in capturing higher frequencies (short time scales). We propose a new positional encoding with a theoretical guarantee, based on discrete Fourier transform. We also propose a new ST dependency discovery framework, which can provide readily consumable diagnostic information in both spatial and temporal directions. Finally, we demonstrate the utility of the proposed model, DFStrans (Diagnostic Fourier-based Spatio-temporal Transf",
    "path": "papers/23/05/2305.17149.json",
    "total_tokens": 871,
    "translated_title": "具有精确编码的诊断时空变换器",
    "translated_abstract": "本文讨论了当基本数据生成过程具有复杂的时空依赖性时的异常诊断任务。其中关键技术挑战是从描述时间和空间指数之间高阶交互的依赖张量中提取可操作见解。我们将问题形式化为监督依赖发现，其中时空依赖性被作为多元时间序列分类的副产品进行学习。我们发现现有ST变换器中使用的时间位置编码在捕捉更高频率（短时间尺度）方面存在严重限制。我们提出了一种具有离散傅里叶变换理论保证的新的位置编码。我们还提出了一种新的时空依赖性发现框架，可以在空间和时间方向上提供易于消化的诊断信息。最后，我们在合成和真实世界数据集上证明了所提出的模型DFStrans（基于傅里叶变换的诊断时空变换器）的实用性。",
    "tldr": "本文提出了一种诊断时空变换器（DFStrans），其利用新的位置编码和时空依赖性发现框架，能够在具有复杂时空依赖性的多元时间序列分类任务中提取可操作见解。",
    "en_tdlr": "This paper proposes a diagnostic spatio-temporal transformer (DFStrans) with a new positional encoding and a ST dependency discovery framework, which can extract actionable insights from multi-variate time series classification problems with complex spatio-temporal dependencies."
}