{
    "title": "Decomposed Prompting for Machine Translation Between Related Languages using Large Language Models. (arXiv:2305.13085v2 [cs.CL] UPDATED)",
    "abstract": "This study investigates machine translation between related languages i.e., languages within the same family that share linguistic characteristics such as word order and lexical similarity. Machine translation through few-shot prompting leverages a small set of translation pair examples to generate translations for test sentences. This procedure requires the model to learn how to generate translations while simultaneously ensuring that token ordering is maintained to produce a fluent and accurate translation. We propose that for related languages, the task of machine translation can be simplified by leveraging the monotonic alignment characteristic of such languages. We introduce DecoMT, a novel approach of few-shot prompting that decomposes the translation process into a sequence of word chunk translations. Through automatic and human evaluation conducted on multiple related language pairs across various language families, we demonstrate that our proposed approach of decomposed prompt",
    "link": "http://arxiv.org/abs/2305.13085",
    "context": "Title: Decomposed Prompting for Machine Translation Between Related Languages using Large Language Models. (arXiv:2305.13085v2 [cs.CL] UPDATED)\nAbstract: This study investigates machine translation between related languages i.e., languages within the same family that share linguistic characteristics such as word order and lexical similarity. Machine translation through few-shot prompting leverages a small set of translation pair examples to generate translations for test sentences. This procedure requires the model to learn how to generate translations while simultaneously ensuring that token ordering is maintained to produce a fluent and accurate translation. We propose that for related languages, the task of machine translation can be simplified by leveraging the monotonic alignment characteristic of such languages. We introduce DecoMT, a novel approach of few-shot prompting that decomposes the translation process into a sequence of word chunk translations. Through automatic and human evaluation conducted on multiple related language pairs across various language families, we demonstrate that our proposed approach of decomposed prompt",
    "path": "papers/23/05/2305.13085.json",
    "total_tokens": 864,
    "translated_title": "使用大型语言模型在相关语言之间进行机器翻译的分解提示法",
    "translated_abstract": "本研究探讨了相关语言之间的机器翻译，即在同一语系中具有词序和词汇相似性等语言特征的语言之间进行翻译。通过少量提示的机器翻译利用一小组翻译对示例来生成测试句子的翻译。这个过程要求模型学习如何生成翻译，同时确保令牌顺序保持一致，以产生流畅准确的翻译。我们提出，在相关语言中，机器翻译任务可以通过利用这种语言的单调对齐特性来简化。我们介绍了DecoMT，一种将翻译过程分解为一系列词块翻译的新颖提示方法。通过在多个相关语言对的不同语系上进行自动和人工评估，我们证明了我们提出的分解提示方法的有效性。",
    "tldr": "本研究提出了DecoMT，一种基于分解提示法的机器翻译方法，用于处理相关语言之间的翻译任务。通过利用相关语言的单调对齐特性，我们的方法在多个语系上进行了验证，并取得了良好的翻译效果。",
    "en_tdlr": "This study introduces DecoMT, a machine translation approach based on decomposed prompting, for handling translation tasks between related languages. Our method leverages the monotonic alignment characteristic of related languages and has been validated on multiple language families, achieving good translation performance."
}