{
    "title": "Understanding compositional data augmentation in automatic morphological inflection. (arXiv:2305.13658v1 [cs.CL])",
    "abstract": "Data augmentation techniques are widely used in low-resource automatic morphological inflection to address the issue of data sparsity. However, the full implications of these techniques remain poorly understood. In this study, we aim to shed light on the theoretical aspects of the data augmentation strategy StemCorrupt, a method that generates synthetic examples by randomly substituting stem characters in existing gold standard training examples. Our analysis uncovers that StemCorrupt brings about fundamental changes in the underlying data distribution, revealing inherent compositional concatenative structure. To complement our theoretical analysis, we investigate the data-efficiency of StemCorrupt. Through evaluation across a diverse set of seven typologically distinct languages, we demonstrate that selecting a subset of datapoints with both high diversity and high predictive uncertainty significantly enhances the data-efficiency of StemCorrupt compared to competitive baselines. Furth",
    "link": "http://arxiv.org/abs/2305.13658",
    "context": "Title: Understanding compositional data augmentation in automatic morphological inflection. (arXiv:2305.13658v1 [cs.CL])\nAbstract: Data augmentation techniques are widely used in low-resource automatic morphological inflection to address the issue of data sparsity. However, the full implications of these techniques remain poorly understood. In this study, we aim to shed light on the theoretical aspects of the data augmentation strategy StemCorrupt, a method that generates synthetic examples by randomly substituting stem characters in existing gold standard training examples. Our analysis uncovers that StemCorrupt brings about fundamental changes in the underlying data distribution, revealing inherent compositional concatenative structure. To complement our theoretical analysis, we investigate the data-efficiency of StemCorrupt. Through evaluation across a diverse set of seven typologically distinct languages, we demonstrate that selecting a subset of datapoints with both high diversity and high predictive uncertainty significantly enhances the data-efficiency of StemCorrupt compared to competitive baselines. Furth",
    "path": "papers/23/05/2305.13658.json",
    "total_tokens": 963,
    "translated_title": "自动词形变化中的组合数据增强理解",
    "translated_abstract": "为了解决数据稀疏的问题，数据增强技术被广泛应用于低资源的自动词形变化中。然而，这些技术的全部影响仍然不为人所知。本研究旨在揭示数据增强策略StemCorrupt的理论方面，该方法通过随机替换现有的黄金标准训练样本中的词干字符来生成合成样本。我们的分析揭示了StemCorrupt带来了根本性的变化，在底层数据分布中展现了固有的组合连接结构。为了补充我们的理论分析，我们调查了StemCorrupt的数据效率。通过对七种类型学不同的语言的广泛评估，我们证明选择高多样性和高预测不确定性的数据点子集显著提高了StemCorrupt的数据效率，相比竞争基线。此外，我们展示了StemCorrupt能够学习可推广的词形规则，这是通过其在域外保留数据上表现出的优异性能所证明的。",
    "tldr": "本研究揭示了自动词形变化中的数据增强策略StemCorrupt带来的根本性变化，并证明选择高多样性和高预测不确定性的数据点子集是提高其数据效率的有效方法。同时，StemCorrupt能够学习可推广的词形规则。",
    "en_tdlr": "This study reveals the fundamental changes brought about by the data augmentation strategy StemCorrupt in automatic morphological inflection. The efficiency of StemCorrupt can be significantly enhanced by selecting a subset of datapoints with both high diversity and high predictive uncertainty. Furthermore, StemCorrupt is able to learn generalizable morphological rules."
}