{
    "title": "Enhancing Contrastive Learning with Noise-Guided Attack: Towards Continual Relation Extraction in the Wild. (arXiv:2305.07085v1 [cs.CL])",
    "abstract": "The principle of continual relation extraction~(CRE) involves adapting to emerging novel relations while preserving od knowledge. While current endeavors in CRE succeed in preserving old knowledge, they tend to fail when exposed to contaminated data streams. We assume this is attributed to their reliance on an artificial hypothesis that the data stream has no annotation errors, which hinders real-world applications for CRE. Considering the ubiquity of noisy labels in real-world datasets, in this paper, we formalize a more practical learning scenario, termed as \\textit{noisy-CRE}. Building upon this challenging setting, we develop a noise-resistant contrastive framework named as \\textbf{N}oise-guided \\textbf{a}ttack in \\textbf{C}ontrative \\textbf{L}earning~(NaCL) to learn incremental corrupted relations. Compared to direct noise discarding or inaccessible noise relabeling, we present modifying the feature space to match the given noisy labels via attacking can better enrich contrastive ",
    "link": "http://arxiv.org/abs/2305.07085",
    "context": "Title: Enhancing Contrastive Learning with Noise-Guided Attack: Towards Continual Relation Extraction in the Wild. (arXiv:2305.07085v1 [cs.CL])\nAbstract: The principle of continual relation extraction~(CRE) involves adapting to emerging novel relations while preserving od knowledge. While current endeavors in CRE succeed in preserving old knowledge, they tend to fail when exposed to contaminated data streams. We assume this is attributed to their reliance on an artificial hypothesis that the data stream has no annotation errors, which hinders real-world applications for CRE. Considering the ubiquity of noisy labels in real-world datasets, in this paper, we formalize a more practical learning scenario, termed as \\textit{noisy-CRE}. Building upon this challenging setting, we develop a noise-resistant contrastive framework named as \\textbf{N}oise-guided \\textbf{a}ttack in \\textbf{C}ontrative \\textbf{L}earning~(NaCL) to learn incremental corrupted relations. Compared to direct noise discarding or inaccessible noise relabeling, we present modifying the feature space to match the given noisy labels via attacking can better enrich contrastive ",
    "path": "papers/23/05/2305.07085.json",
    "total_tokens": 966,
    "translated_title": "引导噪声攻击增强对比学习：朝向野外持续关系提取",
    "translated_abstract": "“不断关系提取”的原则是适应新兴的关系而保留旧有的知识。当前的持续关系提取工作成功地保留了旧有的知识，但在面对出现污染数据流时往往会失败。本文认为这是由于它们依赖一种人工假设，即数据流没有注释错误，这限制了持续关系提取在实际应用中的发展。考虑到实际数据集中嘈杂的标签的普遍存在，我们提出了一个更实用的学习场景，称为“噪声持续关系提取”。在这个具有挑战性的背景下，我们开发了一个耐噪声的对比框架，名为 “NACl”，用于学习逐步受损的关系。与直接丢弃噪声或无法访问的噪声重新标记相比，我们提出通过攻击来修改特征空间以匹配给定的嘈杂标签是更好的丰富对比学习。",
    "tldr": "本研究提出了一种耐噪声的对比框架 NaCl 来在嘈杂标签下学习逐步受损的关系，相比于直接丢弃或重新标记噪声，通过攻击特征空间使其适应嘈杂标签是更好的方式。",
    "en_tdlr": "This study proposes a noise-resistant contrastive framework named NaCl to learn incremental corrupted relations under noisy labels, which enriches contrastive learning better via attacking feature space to match noisy labels instead of discarding or relabeling them."
}