{
    "title": "Predicting Side Effect of Drug Molecules using Recurrent Neural Networks. (arXiv:2305.10473v1 [q-bio.QM])",
    "abstract": "Identification and verification of molecular properties such as side effects is one of the most important and time-consuming steps in the process of molecule synthesis. For example, failure to identify side effects before submission to regulatory groups can cost millions of dollars and months of additional research to the companies. Failure to identify side effects during the regulatory review can also cost lives. The complexity and expense of this task have made it a candidate for a machine learning-based solution. Prior approaches rely on complex model designs and excessive parameter counts for side effect predictions. We believe reliance on complex models only shifts the difficulty away from chemists rather than alleviating the issue. Implementing large models is also expensive without prior access to high-performance computers. We propose a heuristic approach that allows for the utilization of simple neural networks, specifically the recurrent neural network, with a 98+% reduction ",
    "link": "http://arxiv.org/abs/2305.10473",
    "context": "Title: Predicting Side Effect of Drug Molecules using Recurrent Neural Networks. (arXiv:2305.10473v1 [q-bio.QM])\nAbstract: Identification and verification of molecular properties such as side effects is one of the most important and time-consuming steps in the process of molecule synthesis. For example, failure to identify side effects before submission to regulatory groups can cost millions of dollars and months of additional research to the companies. Failure to identify side effects during the regulatory review can also cost lives. The complexity and expense of this task have made it a candidate for a machine learning-based solution. Prior approaches rely on complex model designs and excessive parameter counts for side effect predictions. We believe reliance on complex models only shifts the difficulty away from chemists rather than alleviating the issue. Implementing large models is also expensive without prior access to high-performance computers. We propose a heuristic approach that allows for the utilization of simple neural networks, specifically the recurrent neural network, with a 98+% reduction ",
    "path": "papers/23/05/2305.10473.json",
    "total_tokens": 654,
    "translated_title": "利用循环神经网络预测药物分子的副作用",
    "translated_abstract": "鉴定和验证分子属性，如副作用，是分子合成过程中最重要和耗时的步骤之一。我们提出了一种启发式方法，利用简单的神经网络，特别是循环神经网络，进行副作用预测，避免了依赖于复杂模型的问题并大大降低了参数数量。",
    "tldr": "该论文介绍了一种利用循环神经网络预测药物分子副作用的启发式方法，有效降低了模型复杂度和参数数量。",
    "en_tdlr": "This paper proposes a heuristic approach to predict the side effects of drug molecules using simple neural networks, specifically recurrent neural networks, which reduces the complexity and parameter count for side effect prediction."
}