{
    "title": "Path Planning for Air-Ground Robot Considering Modal Switching Point Optimization. (arXiv:2305.08178v1 [cs.RO])",
    "abstract": "An innovative sort of mobility platform that can both drive and fly is the air-ground robot. The need for an agile flight cannot be satisfied by traditional path planning techniques for air-ground robots. Prior studies had mostly focused on improving the energy efficiency of paths, seldom taking the seeking speed and optimizing take-off and landing places into account. A robot for the field application environment was proposed, and a lightweight global spatial planning technique for the robot based on the graph-search algorithm taking mode switching point optimization into account, with an emphasis on energy efficiency, searching speed, and the viability of real deployment. The fundamental concept is to lower the computational burden by employing an interchangeable search approach that combines planar and spatial search. Furthermore, to safeguard the health of the power battery and the integrity of the mission execution, a trap escape approach was also provided. Simulations are run to ",
    "link": "http://arxiv.org/abs/2305.08178",
    "context": "Title: Path Planning for Air-Ground Robot Considering Modal Switching Point Optimization. (arXiv:2305.08178v1 [cs.RO])\nAbstract: An innovative sort of mobility platform that can both drive and fly is the air-ground robot. The need for an agile flight cannot be satisfied by traditional path planning techniques for air-ground robots. Prior studies had mostly focused on improving the energy efficiency of paths, seldom taking the seeking speed and optimizing take-off and landing places into account. A robot for the field application environment was proposed, and a lightweight global spatial planning technique for the robot based on the graph-search algorithm taking mode switching point optimization into account, with an emphasis on energy efficiency, searching speed, and the viability of real deployment. The fundamental concept is to lower the computational burden by employing an interchangeable search approach that combines planar and spatial search. Furthermore, to safeguard the health of the power battery and the integrity of the mission execution, a trap escape approach was also provided. Simulations are run to ",
    "path": "papers/23/05/2305.08178.json",
    "total_tokens": 903,
    "translated_title": "考虑模式切换点优化的空地机器人路径规划",
    "translated_abstract": "空地机器人是一种创新性的移动平台，可以行驶和飞行。传统的空地机器人路径规划技术无法满足灵活的飞行需求。以往研究主要集中在提高路径的能源效率上，很少考虑搜索速度和起降点优化。本文提出了一个面向现场应用环境的机器人，并提出了一种轻量级全局空间规划技术，基于图搜索算法考虑模式切换点优化，强调能源效率、搜索速度和实际部署的可行性。基本思想是通过采用可互换的搜索方法结合平面和空间搜索来降低计算负担。此外，还提供了一种陷阱避免方法来保护电池的健康和任务执行的完整性。通过仿真实验，证明了该方法在减少能量消耗、提高搜索速度和保证安全可靠执行方面的有效性。",
    "tldr": "本文提出一种考虑模式切换点优化的空地机器人路径规划方法，通过轻量级全局空间规划技术和可互换的搜索方法来提高能源效率、搜索速度和任务执行的可靠性。",
    "en_tdlr": "This paper proposes a path planning method for air-ground robots considering modal switching point optimization, which uses lightweight global spatial planning technique and interchangeable search approach to improve energy efficiency, searching speed, and the reliability of mission execution."
}