{
    "title": "Sentence Representations via Gaussian Embedding",
    "abstract": "arXiv:2305.12990v2 Announce Type: replace  Abstract: Recent progress in sentence embedding, which represents the meaning of a sentence as a point in a vector space, has achieved high performance on tasks such as a semantic textual similarity (STS) task. However, sentence representations as a point in a vector space can express only a part of the diverse information that sentences have, such as asymmetrical relationships between sentences. This paper proposes GaussCSE, a Gaussian distribution-based contrastive learning framework for sentence embedding that can handle asymmetric relationships between sentences, along with a similarity measure for identifying inclusion relations. Our experiments show that GaussCSE achieves the same performance as previous methods in natural language inference tasks, and is able to estimate the direction of entailment relations, which is difficult with point representations.",
    "link": "https://arxiv.org/abs/2305.12990",
    "context": "Title: Sentence Representations via Gaussian Embedding\nAbstract: arXiv:2305.12990v2 Announce Type: replace  Abstract: Recent progress in sentence embedding, which represents the meaning of a sentence as a point in a vector space, has achieved high performance on tasks such as a semantic textual similarity (STS) task. However, sentence representations as a point in a vector space can express only a part of the diverse information that sentences have, such as asymmetrical relationships between sentences. This paper proposes GaussCSE, a Gaussian distribution-based contrastive learning framework for sentence embedding that can handle asymmetric relationships between sentences, along with a similarity measure for identifying inclusion relations. Our experiments show that GaussCSE achieves the same performance as previous methods in natural language inference tasks, and is able to estimate the direction of entailment relations, which is difficult with point representations.",
    "path": "papers/23/05/2305.12990.json",
    "total_tokens": 795,
    "translated_title": "通过高斯嵌入表示句子",
    "translated_abstract": "最近在句子嵌入方面取得的进展，将句子的含义表示为向量空间中的一个点，已在诸如语义文本相似性（STS）任务等任务上取得了高性能。然而，作为向量空间中的一个点的句子表示只能表达句子具有的多样信息的一部分，比如句子之间的不对称关系。本文提出了GaussCSE，一种基于高斯分布的对比学习框架，用于句子嵌入，可以处理句子之间的不对称关系，同时提出了一种相似度度量用于识别包含关系。我们的实验表明，GaussCSE在自然语言推理任务中实现了与以前方法相同的性能，并且能够估计蕴涵关系的方向，这在点表示中是困难的。",
    "tldr": "本文提出了一种基于高斯分布的对比学习框架 GaussCSE，用于处理句子之间的不对称关系，实现了与以往方法相同的性能，在自然语言推理中能够估计蕴涵关系的方向。",
    "en_tdlr": "This paper introduces GaussCSE, a Gaussian distribution-based contrastive learning framework for sentence embedding that handles asymmetric relationships between sentences, achieving similar performance as previous methods and estimating the entailment direction in natural language inference tasks."
}