{
    "title": "Designing for Meaningful Human Control in Military Human-Machine Teams. (arXiv:2305.11892v1 [cs.HC])",
    "abstract": "We propose methods for analysis, design, and evaluation of Meaningful Human Control (MHC) for defense technologies from the perspective of military human-machine teaming (HMT). Our approach is based on three principles. Firstly, MHC should be regarded as a core objective that guides all phases of analysis, design and evaluation. Secondly, MHC affects all parts of the socio-technical system, including humans, machines, AI, interactions, and context. Lastly, MHC should be viewed as a property that spans longer periods of time, encompassing both prior and realtime control by multiple actors. To describe macrolevel design options for achieving MHC, we propose various Team Design Patterns. Furthermore, we present a case study, where we applied some of these methods to envision HMT, involving robots and soldiers in a search and rescue task in a military context.",
    "link": "http://arxiv.org/abs/2305.11892",
    "context": "Title: Designing for Meaningful Human Control in Military Human-Machine Teams. (arXiv:2305.11892v1 [cs.HC])\nAbstract: We propose methods for analysis, design, and evaluation of Meaningful Human Control (MHC) for defense technologies from the perspective of military human-machine teaming (HMT). Our approach is based on three principles. Firstly, MHC should be regarded as a core objective that guides all phases of analysis, design and evaluation. Secondly, MHC affects all parts of the socio-technical system, including humans, machines, AI, interactions, and context. Lastly, MHC should be viewed as a property that spans longer periods of time, encompassing both prior and realtime control by multiple actors. To describe macrolevel design options for achieving MHC, we propose various Team Design Patterns. Furthermore, we present a case study, where we applied some of these methods to envision HMT, involving robots and soldiers in a search and rescue task in a military context.",
    "path": "papers/23/05/2305.11892.json",
    "total_tokens": 867,
    "translated_title": "军事人机团队中有意义的人类控制的设计",
    "translated_abstract": "我们提出了分析、设计和评估有意义的人类控制（MHC）的方法，从军事人机团队（HMT）的角度来审视防御技术。我们的方法基于三个原则。首先，MHC应被视为指导所有分析、设计和评估阶段的核心目标。其次，MHC影响到社会技术系统的所有部分，包括人类、机器、人工智能、互动和背景。最后，MHC应被视为一个跨越较长时间的属性，包括多个参与者的事先和实时控制。为了描述实现MHC的宏观设计选项，我们提出了各种团队设计模式。此外，我们提出了一个案例研究，在其中应用了这些方法来构想一种涉及机器人和士兵在军事背景下进行搜救任务的HMT。",
    "tldr": "本论文从军事人机团队的角度提出了有意义的人类控制（MHC）对于防御技术的重要性，并提出了宏观设计选项团队设计模式。同时，提供了一个搜索与搜救任务的案例研究。",
    "en_tdlr": "This paper proposes the importance of meaningful human control (MHC) for defense technologies from the perspective of military human-machine teaming (HMT) and presents macro-level design options as Team Design Patterns. A case study is also presented involving a search and rescue task in a military context."
}