{
    "title": "Additive manifesto decomposition: A policy domain aware method for understanding party positioning. (arXiv:2305.10136v1 [cs.CL])",
    "abstract": "Automatic extraction of party (dis)similarities from texts such as party election manifestos or parliamentary speeches plays an increasing role in computational political science. However, existing approaches are fundamentally limited to targeting only global party (dis)-similarity: they condense the relationship between a pair of parties into a single figure, their similarity. In aggregating over all policy domains (e.g., health or foreign policy), they do not provide any qualitative insights into which domains parties agree or disagree on. This paper proposes a workflow for estimating policy domain aware party similarity that overcomes this limitation. The workflow covers (a) definition of suitable policy domains; (b) automatic labeling of domains, if no manual labels are available; (c) computation of domain-level similarities and aggregation at a global level; (d) extraction of interpretable party positions on major policy axes via multidimensional scaling. We evaluate our workflow ",
    "link": "http://arxiv.org/abs/2305.10136",
    "context": "Title: Additive manifesto decomposition: A policy domain aware method for understanding party positioning. (arXiv:2305.10136v1 [cs.CL])\nAbstract: Automatic extraction of party (dis)similarities from texts such as party election manifestos or parliamentary speeches plays an increasing role in computational political science. However, existing approaches are fundamentally limited to targeting only global party (dis)-similarity: they condense the relationship between a pair of parties into a single figure, their similarity. In aggregating over all policy domains (e.g., health or foreign policy), they do not provide any qualitative insights into which domains parties agree or disagree on. This paper proposes a workflow for estimating policy domain aware party similarity that overcomes this limitation. The workflow covers (a) definition of suitable policy domains; (b) automatic labeling of domains, if no manual labels are available; (c) computation of domain-level similarities and aggregation at a global level; (d) extraction of interpretable party positions on major policy axes via multidimensional scaling. We evaluate our workflow ",
    "path": "papers/23/05/2305.10136.json",
    "total_tokens": 862,
    "translated_title": "《附加宣言分解：一种理解政党立场的政策域感知方法》",
    "translated_abstract": "自动从政治文本中提取政党（不）相似性在计算政治学中扮演着越来越重要的角色，但现有方法基本上仅限于针对全局政党（不）相似性：它们将两个政党之间的关系压缩为单个数字，即相似性，无法提供有关政党在哪些领域上达成共识或不一致的任何定性洞见。本文提出了一种工作流程，用于估计政策域感知的政党相似性，克服了这一限制。该工作流程包括（a）定义合适的政策领域；（b）如果没有手动标签，则自动标记领域；（c）计算领域级相似性并在全局级别进行汇总；（d）通过多维缩放提取可解释的主要政策轴上的政党立场。我们评估了我们的工作流程。",
    "tldr": "本文提出了一种理解政党立场的方法，可以估计政策域感知的政党相似性，通过多维缩放提取可解释的主要政策轴上的政党立场。",
    "en_tdlr": "This article proposes a method for understanding party positioning by estimating policy domain aware party similarity and extracting interpretable party positions on major policy axes via multidimensional scaling."
}