{
    "title": "Analysing high resolution digital Mars images using machine learning. (arXiv:2305.19958v2 [astro-ph.EP] UPDATED)",
    "abstract": "The search for ephemeral liquid water on Mars is an ongoing activity. After the recession of the seasonal polar ice cap on Mars, small water ice patches may be left behind in shady places due to the low thermal conductivity of the Martian surface and atmosphere. During late spring and early summer, these patches may be exposed to direct sunlight and warm up rapidly enough for the liquid phase to emerge. To see the spatial and temporal occurrence of such ice patches, optical images should be searched for and checked. Previously a manual image analysis was conducted on 110 images from the southern hemisphere, captured by the High Resolution Imaging Science Experiment (HiRISE) camera onboard the Mars Reconnaissance Orbiter space mission. Out of these, 37 images were identified with smaller ice patches, which were distinguishable by their brightness, colour and strong connection to local topographic shading. In this study, a convolutional neural network (CNN) is applied to find further ima",
    "link": "http://arxiv.org/abs/2305.19958",
    "context": "Title: Analysing high resolution digital Mars images using machine learning. (arXiv:2305.19958v2 [astro-ph.EP] UPDATED)\nAbstract: The search for ephemeral liquid water on Mars is an ongoing activity. After the recession of the seasonal polar ice cap on Mars, small water ice patches may be left behind in shady places due to the low thermal conductivity of the Martian surface and atmosphere. During late spring and early summer, these patches may be exposed to direct sunlight and warm up rapidly enough for the liquid phase to emerge. To see the spatial and temporal occurrence of such ice patches, optical images should be searched for and checked. Previously a manual image analysis was conducted on 110 images from the southern hemisphere, captured by the High Resolution Imaging Science Experiment (HiRISE) camera onboard the Mars Reconnaissance Orbiter space mission. Out of these, 37 images were identified with smaller ice patches, which were distinguishable by their brightness, colour and strong connection to local topographic shading. In this study, a convolutional neural network (CNN) is applied to find further ima",
    "path": "papers/23/05/2305.19958.json",
    "total_tokens": 959,
    "translated_title": "使用机器学习分析高分辨率数码火星图像",
    "translated_abstract": "在火星上寻找短暂液态水的活动是一项持续进行的任务。在火星季节性极地冰帽消退后，由于火星表面和大气层的低热导率，小水冰斑块可能会残留在阴暗的地方。在春末夏初，这些斑块可能会暴露在阳光下，并迅速升温，使液态相出现。为了了解此类冰斑的空间和时间分布，应该对光学图像进行搜索和检查。先前对由火星勘测轨道飞行器上的高分辨率成像科学实验（HiRISE）相机捕获的南半球110张图像进行了手动图像分析。其中，37张图像被鉴定为含有较小冰斑，这些冰斑可通过它们的亮度、颜色和与局部地形遮蔽的强关联性来区分。本研究应用了卷积神经网络（CNN）来寻找更多图像。",
    "tldr": "本研究利用卷积神经网络应用于高分辨率数码火星图像，以分析寻找火星上的短暂液态水斑块。先前的手动图像分析已经发现37张图像含有较小冰斑，并通过亮度、颜色和与地形遮蔽的强关联性进行了区分。",
    "en_tdlr": "In this study, a convolutional neural network (CNN) is applied to analyze high resolution digital Mars images and search for ephemeral liquid water patches. Previous manual image analysis identified 37 images with smaller ice patches, distinguishable by their brightness, color, and strong connection to local topographic shading."
}