{
    "title": "Mastering Percolation-like Games with Deep Learning. (arXiv:2305.07687v1 [cs.LG])",
    "abstract": "Though robustness of networks to random attacks has been widely studied, intentional destruction by an intelligent agent is not tractable with previous methods. Here we devise a single-player game on a lattice that mimics the logic of an attacker attempting to destroy a network. The objective of the game is to disable all nodes in the fewest number of steps. We develop a reinforcement learning approach using deep Q-learning that is capable of learning to play this game successfully, and in so doing, to optimally attack a network. Because the learning algorithm is universal, we train agents on different definitions of robustness and compare the learned strategies. We find that superficially similar definitions of robustness induce different strategies in the trained agent, implying that optimally attacking or defending a network is sensitive the particular objective. Our method provides a new approach to understand network robustness, with potential applications to other discrete proces",
    "link": "http://arxiv.org/abs/2305.07687",
    "context": "Title: Mastering Percolation-like Games with Deep Learning. (arXiv:2305.07687v1 [cs.LG])\nAbstract: Though robustness of networks to random attacks has been widely studied, intentional destruction by an intelligent agent is not tractable with previous methods. Here we devise a single-player game on a lattice that mimics the logic of an attacker attempting to destroy a network. The objective of the game is to disable all nodes in the fewest number of steps. We develop a reinforcement learning approach using deep Q-learning that is capable of learning to play this game successfully, and in so doing, to optimally attack a network. Because the learning algorithm is universal, we train agents on different definitions of robustness and compare the learned strategies. We find that superficially similar definitions of robustness induce different strategies in the trained agent, implying that optimally attacking or defending a network is sensitive the particular objective. Our method provides a new approach to understand network robustness, with potential applications to other discrete proces",
    "path": "papers/23/05/2305.07687.json",
    "total_tokens": 885,
    "translated_title": "用深度学习掌握类渗透游戏",
    "translated_abstract": "尽管网络对随机攻击的鲁棒性得到了广泛研究，但是智能代理的故意破坏并不适用于先前的方法。在这里，我们设计了一个在晶格上的单人游戏，模拟攻击者试图摧毁网络的逻辑。游戏的目标是在最少的步骤中禁用所有节点。我们使用深度Q学习开发了一种强化学习方法，能够成功地学习玩这个游戏，并通过这种方式最优地攻击网络。由于学习算法是通用的，我们训练代理人在不同的鲁棒性定义上并比较学习策略。我们发现，表面上相似的鲁棒性定义引导训练代理使用不同的策略，暗示着优化攻击或防御网络对特定目标非常敏感。我们的方法为理解网络稳健性提供了一种新的方法，可应用于其他离散过程。",
    "tldr": "研究使用单人游戏和深度学习在网络攻击中的应用，利用训练的代理人和不同的鲁棒性定义，发现优化攻击或防御网络对特定目标非常敏感。",
    "en_tdlr": "This paper describes a reinforcement learning approach using deep Q-learning to optimize network attacks in a single-player game on a lattice, and finds that different definitions of robustness yield different strategies, highlighting the importance of targeting specific objectives."
}