{
    "title": "Hierarchical Deep Counterfactual Regret Minimization. (arXiv:2305.17327v1 [cs.LG])",
    "abstract": "Imperfect Information Games (IIGs) offer robust models for scenarios where decision-makers face uncertainty or lack complete information. Counterfactual Regret Minimization (CFR) has been one of the most successful family of algorithms for tackling IIGs. The integration of skill-based strategy learning with CFR could potentially enhance learning performance for complex IIGs. For this, a hierarchical strategy needs to be learnt, wherein low-level components represent specific skills and the high-level component manages the transition between skills. This hierarchical approach also enhances interpretability, helping humans pinpoint scenarios where the agent is struggling and intervene with targeted expertise. This paper introduces the first hierarchical version of Deep CFR (HDCFR), an innovative method that boosts learning efficiency in tasks involving extensively large state spaces and deep game trees. A notable advantage of HDCFR over previous research in this field is its ability to f",
    "link": "http://arxiv.org/abs/2305.17327",
    "context": "Title: Hierarchical Deep Counterfactual Regret Minimization. (arXiv:2305.17327v1 [cs.LG])\nAbstract: Imperfect Information Games (IIGs) offer robust models for scenarios where decision-makers face uncertainty or lack complete information. Counterfactual Regret Minimization (CFR) has been one of the most successful family of algorithms for tackling IIGs. The integration of skill-based strategy learning with CFR could potentially enhance learning performance for complex IIGs. For this, a hierarchical strategy needs to be learnt, wherein low-level components represent specific skills and the high-level component manages the transition between skills. This hierarchical approach also enhances interpretability, helping humans pinpoint scenarios where the agent is struggling and intervene with targeted expertise. This paper introduces the first hierarchical version of Deep CFR (HDCFR), an innovative method that boosts learning efficiency in tasks involving extensively large state spaces and deep game trees. A notable advantage of HDCFR over previous research in this field is its ability to f",
    "path": "papers/23/05/2305.17327.json",
    "total_tokens": 869,
    "translated_abstract": "不完美信息博弈(IIGs)为决策者面临不确定性或缺乏完全信息的场景提供了强大的模型。反事实遗憾最小化(CFR)是针对IIGs的最成功算法之一。将基于技能的策略学习与CFR集成可能会提高复杂IIGs的学习性能。为此，需要学习层次化策略，其中低层组件代表具体技能，高层组件管理技能之间的转换。这种层次化方法还增强了可解释性，帮助人类指出代理程序遇到困难的情况并介入提供有针对性的专业知识。本文介绍了第一个深度CFR的分层版本(HDCFR)。该方法可提高在涉及巨大状态空间和深度博弈树的任务中的学习效率。HDCFR相比先前这个领域的研究具有一个显著优势，即它具有实现环境自适应的功能。",
    "tldr": "本文介绍了一种新的算法：层次化深度反事实遗憾最小化(HDCFR)，它能够提高复杂IIGs的学习效率，并增强了可解释性。",
    "en_tdlr": "This paper introduces a new algorithm, Hierarchical Deep Counterfactual Regret Minimization (HDCFR), which enhances learning efficiency in complex IIGs and improves interpretability."
}