{
    "title": "A RelEntLess Benchmark for Modelling Graded Relations between Named Entities",
    "abstract": "Relations such as \"is influenced by\", \"is known for\" or \"is a competitor of\" are inherently graded: we can rank entity pairs based on how well they satisfy these relations, but it is hard to draw a line between those pairs that satisfy them and those that do not. Such graded relations play a central role in many applications, yet they are typically not covered by existing Knowledge Graphs. In this paper, we consider the possibility of using Large Language Models (LLMs) to fill this gap. To this end, we introduce a new benchmark, in which entity pairs have to be ranked according to how much they satisfy a given graded relation. The task is formulated as a few-shot ranking problem, where models only have access to a description of the relation and five prototypical instances. We use the proposed benchmark to evaluate state-of-the-art relation embedding strategies as well as several recent LLMs, covering both publicly available LLMs and closed models such as GPT-4. Overall, we find a stro",
    "link": "https://arxiv.org/abs/2305.15002",
    "context": "Title: A RelEntLess Benchmark for Modelling Graded Relations between Named Entities\nAbstract: Relations such as \"is influenced by\", \"is known for\" or \"is a competitor of\" are inherently graded: we can rank entity pairs based on how well they satisfy these relations, but it is hard to draw a line between those pairs that satisfy them and those that do not. Such graded relations play a central role in many applications, yet they are typically not covered by existing Knowledge Graphs. In this paper, we consider the possibility of using Large Language Models (LLMs) to fill this gap. To this end, we introduce a new benchmark, in which entity pairs have to be ranked according to how much they satisfy a given graded relation. The task is formulated as a few-shot ranking problem, where models only have access to a description of the relation and five prototypical instances. We use the proposed benchmark to evaluate state-of-the-art relation embedding strategies as well as several recent LLMs, covering both publicly available LLMs and closed models such as GPT-4. Overall, we find a stro",
    "path": "papers/23/05/2305.15002.json",
    "total_tokens": 944,
    "translated_title": "用于建模命名实体之间分级关系的无情基准",
    "translated_abstract": "诸如“受影响于”、“以...闻名”或“与...竞争”之类的关系本质上是分级的：我们可以根据实体对满足这些关系的程度对它们进行排名，但很难将满足和不满足这些关系的实体对划分开。这样的分级关系在许多应用中起着重要作用，然而现有的知识图谱通常不包含此类关系。本文考虑使用大型语言模型（LLM）来填补这个空白的可能性。为此，我们引入了一个新的基准，其中实体对必须根据其满足给定分级关系的程度进行排序。该任务被定义为少样本排序问题，模型只能访问关系的描述和五个原型实例。我们使用提出的基准来评估最先进的关系嵌入策略以及几个最近的LLM，包括公开可用的LLM和封闭模型，例如GPT-4。总体而言，我们发现了一个重要的创新和贡献。",
    "tldr": "本文提出了一个用于模拟命名实体之间分级关系的无情基准，使用大型语言模型进行填补，以对实体对根据其满足程度进行排序。通过评估最先进的关系嵌入策略和多个LLM，我们发现了重要的创新和贡献。",
    "en_tdlr": "This paper proposes a relentless benchmark for modeling graded relations between named entities and fills the gap using large language models. The benchmark evaluates state-of-the-art relation embedding strategies and various LLMs, uncovering important innovations and contributions."
}