{
    "title": "Study of the problem of reducing greenhouse gas emissions in agricultural production Czech Republic. (arXiv:2305.13253v1 [econ.GN])",
    "abstract": "Agricultural production is the main source of greenhouse gas emissions, and therefore it has a great influence on the dynamics of changes in global warming. The article investigated the problems faced by Czech agricultural producers on the way to reduce greenhouse gas emissions. The author analyzed the dynamics of greenhouse gas emissions by various branches of agriculture for the period 2000-2015. The author proposed the coefficient t -covariances to determine the interdependence of the given tabular macroeconomic values. This indicator allows you to analyze the interdependence of macroeconomic variables that do not have a normal distribution. In the context of the globalization of the economy and the need to combat global warming in each country, it makes sense to produce primarily agricultural products that provide maximum added value with maximum greenhouse gas emissions.",
    "link": "http://arxiv.org/abs/2305.13253",
    "context": "Title: Study of the problem of reducing greenhouse gas emissions in agricultural production Czech Republic. (arXiv:2305.13253v1 [econ.GN])\nAbstract: Agricultural production is the main source of greenhouse gas emissions, and therefore it has a great influence on the dynamics of changes in global warming. The article investigated the problems faced by Czech agricultural producers on the way to reduce greenhouse gas emissions. The author analyzed the dynamics of greenhouse gas emissions by various branches of agriculture for the period 2000-2015. The author proposed the coefficient t -covariances to determine the interdependence of the given tabular macroeconomic values. This indicator allows you to analyze the interdependence of macroeconomic variables that do not have a normal distribution. In the context of the globalization of the economy and the need to combat global warming in each country, it makes sense to produce primarily agricultural products that provide maximum added value with maximum greenhouse gas emissions.",
    "path": "papers/23/05/2305.13253.json",
    "total_tokens": 842,
    "translated_title": "研究捷克农业生产中减少温室气体排放问题",
    "translated_abstract": "农业生产是温室气体排放的主要来源，因此对全球变暖的动态变化有很大影响。本文研究了捷克农业生产者在减少温室气体排放方面面临的问题。作者分析了2000-2015年各农业分支机构温室气体排放的动态变化。作者提出了t-协方差系数，用于确定给定表格宏观经济指标的相互依赖关系。该指标可分析不具有正态分布的宏观经济变量间的相互依赖关系。在经济全球化和各国需要应对全球变暖的背景下，首要生产最大附加值和最小温室气体排放的农产品是有意义的。",
    "tldr": "本文研究了捷克农业生产中减少温室气体排放的问题，分析了2000-2015年各农业分支机构温室气体排放的动态变化并提出了解决方案。",
    "en_tdlr": "This paper investigates the problem of reducing greenhouse gas emissions in Czech agricultural production by analyzing the dynamic changes of emissions in various branches of agriculture during 2000-2015, proposing a solution with the t-covariances coefficient to analyze interdependencies among non-normally distributed macroeconomic variables in producing agricultural products with maximum added value and minimum emissions."
}