{
    "title": "Emergent Communication with Attention. (arXiv:2305.10920v1 [cs.CL])",
    "abstract": "To develop computational agents that better communicate using their own emergent language, we endow the agents with an ability to focus their attention on particular concepts in the environment. Humans often understand an object or scene as a composite of concepts and those concepts are further mapped onto words. We implement this intuition as cross-modal attention mechanisms in Speaker and Listener agents in a referential game and show attention leads to more compositional and interpretable emergent language. We also demonstrate how attention aids in understanding the learned communication protocol by investigating the attention weights associated with each message symbol and the alignment of attention weights between Speaker and Listener agents. Overall, our results suggest that attention is a promising mechanism for developing more human-like emergent language.",
    "link": "http://arxiv.org/abs/2305.10920",
    "context": "Title: Emergent Communication with Attention. (arXiv:2305.10920v1 [cs.CL])\nAbstract: To develop computational agents that better communicate using their own emergent language, we endow the agents with an ability to focus their attention on particular concepts in the environment. Humans often understand an object or scene as a composite of concepts and those concepts are further mapped onto words. We implement this intuition as cross-modal attention mechanisms in Speaker and Listener agents in a referential game and show attention leads to more compositional and interpretable emergent language. We also demonstrate how attention aids in understanding the learned communication protocol by investigating the attention weights associated with each message symbol and the alignment of attention weights between Speaker and Listener agents. Overall, our results suggest that attention is a promising mechanism for developing more human-like emergent language.",
    "path": "papers/23/05/2305.10920.json",
    "total_tokens": 756,
    "translated_title": "使用注意力机制的紧急通信",
    "translated_abstract": "为了开发出更好地使用自己的紧急语言进行通信的计算代理，我们赋予代理在环境中关注特定概念的能力。人类经常将一个对象或场景理解为概念的组合，并将这些概念进一步映射到单词上。我们将这种直觉实现为\"Speaker\"和\"Listener\"代理中的跨模态注意力机制，在引用游戏中显示注意力导致更具组成性和可解释性的紧急语言。我们还通过调查每个消息符号相关的注意权重以及\"Speaker\"和\"Listener\"代理之间注意权重的对齐，展示了注意力如何帮助理解学习到的通信协议。总的来说，我们的结果表明，注意力是开发更具人类化的紧急语言的一种有前途的机制。",
    "tldr": "该论文研究了在计算代理间如何实现更好地紧急通信的方法，并发现引入注意力机制可以得到更具组成性和可解释性的紧急语言。",
    "en_tdlr": "The paper investigates how to achieve better emergent communication among computational agents and finds that introducing attention mechanisms leads to more compositional and interpretable emergent language."
}