{
    "title": "Stance Detection With Supervised, Zero-Shot, and Few-Shot Applications. (arXiv:2305.01723v1 [cs.CL])",
    "abstract": "Stance detection is the identification of an author's beliefs about a subject from a document. Researchers widely rely on sentiment analysis to accomplish this. However, recent research has show that sentiment analysis is only loosely correlated with stance, if at all. This paper advances methods in text analysis by precisely defining the task of stance detection, providing a generalized framework for the task, and then presenting three distinct approaches for performing stance detection: supervised classification, zero-shot classification with NLI classifiers, and in-context learning. In doing so, I demonstrate how zero-shot and few-shot language classifiers can replace human labelers for a variety of tasks and discuss how their application and limitations differ from supervised classifiers. Finally, I demonstrate an application of zero-shot stance detection by replicating Block Jr et al. (2022).",
    "link": "http://arxiv.org/abs/2305.01723",
    "context": "Title: Stance Detection With Supervised, Zero-Shot, and Few-Shot Applications. (arXiv:2305.01723v1 [cs.CL])\nAbstract: Stance detection is the identification of an author's beliefs about a subject from a document. Researchers widely rely on sentiment analysis to accomplish this. However, recent research has show that sentiment analysis is only loosely correlated with stance, if at all. This paper advances methods in text analysis by precisely defining the task of stance detection, providing a generalized framework for the task, and then presenting three distinct approaches for performing stance detection: supervised classification, zero-shot classification with NLI classifiers, and in-context learning. In doing so, I demonstrate how zero-shot and few-shot language classifiers can replace human labelers for a variety of tasks and discuss how their application and limitations differ from supervised classifiers. Finally, I demonstrate an application of zero-shot stance detection by replicating Block Jr et al. (2022).",
    "path": "papers/23/05/2305.01723.json",
    "total_tokens": 856,
    "translated_title": "利用有监督、零样本和少样本应用进行立场检测",
    "translated_abstract": "立场检测是识别作者对一个主题的信仰的过程。研究人员通常依赖情感分析来完成这一任务。然而，最近的研究表明情感分析只与立场存在松散的相关性，如果有的话。本文通过精确定义立场检测任务、提供任务的普适框架，并针对执行立场检测的三种不同方法（有监督分类、零样本分类与NLI分类器、上下文学习）提出新的研究方法以推进文本分析方式。在此过程中，本文说明了如何使用零样本和少样本语言分类器替代人工标签者完成各种任务，并讨论了它们的应用和局限性与有监督分类器不同。最后，本文通过复制Block Jr等人 (2022)的方法，演示了零样本立场检测的应用。",
    "tldr": "本文提出了三种不同的方法进行立场检测：有监督分类、零样本分类与NLI分类器和上下文学习。零样本和少样本语言分类器可以替代人工标签者，并演示了如何运用它们来执行立场检测。",
    "en_tdlr": "This paper introduces three different approaches for stance detection: supervised classification, zero-shot classification with NLI classifiers, and in-context learning. It demonstrates how zero-shot and few-shot language classifiers can replace human labelers for a variety of tasks and shows an application of zero-shot stance detection."
}