{
    "title": "Probabilistic Forecast-based Portfolio Optimization of Electricity Demand at Low Aggregation Levels. (arXiv:2305.09474v1 [q-fin.RM])",
    "abstract": "In the effort to achieve carbon neutrality through a decentralized electricity market, accurate short-term load forecasting at low aggregation levels has become increasingly crucial for various market participants' strategies. Accurate probabilistic forecasts at low aggregation levels can improve peer-to-peer energy sharing, demand response, and the operation of reliable distribution networks. However, these applications require not only probabilistic demand forecasts, which involve quantification of the forecast uncertainty, but also determining which consumers to include in the aggregation to meet electricity supply at the forecast lead time. While research papers have been proposed on the supply side, no similar research has been conducted on the demand side. This paper presents a method for creating a portfolio that optimally aggregates demand for a given energy demand, minimizing forecast inaccuracy of overall low-level aggregation. Using probabilistic load forecasts produced by e",
    "link": "http://arxiv.org/abs/2305.09474",
    "context": "Title: Probabilistic Forecast-based Portfolio Optimization of Electricity Demand at Low Aggregation Levels. (arXiv:2305.09474v1 [q-fin.RM])\nAbstract: In the effort to achieve carbon neutrality through a decentralized electricity market, accurate short-term load forecasting at low aggregation levels has become increasingly crucial for various market participants' strategies. Accurate probabilistic forecasts at low aggregation levels can improve peer-to-peer energy sharing, demand response, and the operation of reliable distribution networks. However, these applications require not only probabilistic demand forecasts, which involve quantification of the forecast uncertainty, but also determining which consumers to include in the aggregation to meet electricity supply at the forecast lead time. While research papers have been proposed on the supply side, no similar research has been conducted on the demand side. This paper presents a method for creating a portfolio that optimally aggregates demand for a given energy demand, minimizing forecast inaccuracy of overall low-level aggregation. Using probabilistic load forecasts produced by e",
    "path": "papers/23/05/2305.09474.json",
    "total_tokens": 865,
    "tldr": "本文提出了一种以概率预测为基础的电力需求组合优化方法，通过最小化低层聚合的预测不准确度，实现成本与预测准确度的平衡。",
    "en_tdlr": "This paper proposes a probabilistic forecast-based portfolio optimization method for electricity demand, which optimizes the combination of demand to balance cost and forecast accuracy by minimizing inaccuracy in low-level aggregation."
}