{
    "title": "Deep Learning-Based Multiband Signal Fusion for 3-D SAR Super-Resolution. (arXiv:2305.02017v1 [cs.CV])",
    "abstract": "Three-dimensional (3-D) synthetic aperture radar (SAR) is widely used in many security and industrial applications requiring high-resolution imaging of concealed or occluded objects. The ability to resolve intricate 3-D targets is essential to the performance of such applications and depends directly on system bandwidth. However, because high-bandwidth systems face several prohibitive hurdles, an alternative solution is to operate multiple radars at distinct frequency bands and fuse the multiband signals. Current multiband signal fusion methods assume a simple target model and a small number of point reflectors, which is invalid for realistic security screening and industrial imaging scenarios wherein the target model effectively consists of a large number of reflectors. To the best of our knowledge, this study presents the first use of deep learning for multiband signal fusion. The proposed network, called kR-Net, employs a hybrid, dual-domain complex-valued convolutional neural netwo",
    "link": "http://arxiv.org/abs/2305.02017",
    "context": "Title: Deep Learning-Based Multiband Signal Fusion for 3-D SAR Super-Resolution. (arXiv:2305.02017v1 [cs.CV])\nAbstract: Three-dimensional (3-D) synthetic aperture radar (SAR) is widely used in many security and industrial applications requiring high-resolution imaging of concealed or occluded objects. The ability to resolve intricate 3-D targets is essential to the performance of such applications and depends directly on system bandwidth. However, because high-bandwidth systems face several prohibitive hurdles, an alternative solution is to operate multiple radars at distinct frequency bands and fuse the multiband signals. Current multiband signal fusion methods assume a simple target model and a small number of point reflectors, which is invalid for realistic security screening and industrial imaging scenarios wherein the target model effectively consists of a large number of reflectors. To the best of our knowledge, this study presents the first use of deep learning for multiband signal fusion. The proposed network, called kR-Net, employs a hybrid, dual-domain complex-valued convolutional neural netwo",
    "path": "papers/23/05/2305.02017.json",
    "total_tokens": 860,
    "translated_title": "基于深度学习的多波段信号融合用于 3-D SAR 超分辨率",
    "translated_abstract": "三维合成孔径雷达（3-D SAR）被广泛应用于许多安全和工业应用，需要对隐蔽或遮挡对象进行高分辨率成像。能够分辨错综复杂的 3-D 目标对于这些应用的性能至关重要，并且直接取决于系统带宽。然而，由于高带宽系统面临几个禁止因素，因此另一种解决方案是在不同频段上操作多个雷达并融合多波段信号。当前的多波段信号融合方法假设一个简单的目标模型和少数点反射器，但这种方法对于实际的安全筛查和工业成像场景中的大量反射器构成的目标模型无效。据我们所知，本研究首次使用深度学习进行多波段信号融合。所提出的名为 kR-Net 的网络采用混合的双重域复值卷积神经网络。",
    "tldr": "本研究首次提出使用深度学习进行多波段信号融合，以应对实际场景中目标模型复杂的问题。",
    "en_tdlr": "This study proposes the first use of deep learning for multiband signal fusion, aiming to address the challenge of complex target models in practical scenarios."
}