{
    "title": "Self-information Domain-based Neural CSI Compression with Feature Coupling. (arXiv:2305.07662v1 [cs.IT])",
    "abstract": "Deep learning (DL)-based channel state information (CSI) feedback methods compressed the CSI matrix by exploiting its delay and angle features straightforwardly, while the measure in terms of information contained in the CSI matrix has rarely been considered. Based on this observation, we introduce self-information as an informative CSI representation from the perspective of information theory, which reflects the amount of information of the original CSI matrix in an explicit way. Then, a novel DL-based network is proposed for temporal CSI compression in the self-information domain, namely SD-CsiNet. The proposed SD-CsiNet projects the raw CSI onto a self-information matrix in the newly-defined self-information domain, extracts both temporal and spatial features of the self-information matrix, and then couples these two features for effective compression. Experimental results verify the effectiveness of the proposed SD-CsiNet by exploiting the self-information of CSI. Particularly for ",
    "link": "http://arxiv.org/abs/2305.07662",
    "context": "Title: Self-information Domain-based Neural CSI Compression with Feature Coupling. (arXiv:2305.07662v1 [cs.IT])\nAbstract: Deep learning (DL)-based channel state information (CSI) feedback methods compressed the CSI matrix by exploiting its delay and angle features straightforwardly, while the measure in terms of information contained in the CSI matrix has rarely been considered. Based on this observation, we introduce self-information as an informative CSI representation from the perspective of information theory, which reflects the amount of information of the original CSI matrix in an explicit way. Then, a novel DL-based network is proposed for temporal CSI compression in the self-information domain, namely SD-CsiNet. The proposed SD-CsiNet projects the raw CSI onto a self-information matrix in the newly-defined self-information domain, extracts both temporal and spatial features of the self-information matrix, and then couples these two features for effective compression. Experimental results verify the effectiveness of the proposed SD-CsiNet by exploiting the self-information of CSI. Particularly for ",
    "path": "papers/23/05/2305.07662.json",
    "total_tokens": 919,
    "translated_title": "基于自信息域的神经CSI压缩与特征耦合",
    "translated_abstract": "基于深度学习的信道状态信息(CSI)反馈方法通常通过延迟和角度特征直接压缩CSI矩阵，但很少考虑CSI矩阵中信息的量度。我们从信息论角度引入自信息作为CSI的表征，它以明确的方式反映了原始CSI矩阵中的信息量。然后，在自信息域中提出了一种新的DL-based网络SD-CsiNet，用于临时CSI压缩。SD-CsiNet将原始CSI投影到自信息矩阵上，在新定义的自信息域中提取自信息矩阵的时间和空间特征，然后耦合这两种特征进行有效压缩。实验结果通过利用CSI的自信息验证了所提出方法的有效性。特别是对于压缩CSI反馈，该方法与现有技术相比可以达到高达3.22dB的性能提升。",
    "tldr": "本文提出了一种基于自信息域的神经CSI压缩与特征耦合方法，通过引入自信息作为CSI的表征，在新定义的自信息域中提取时间和空间特征进行有效压缩，并在压缩CSI反馈上实现了高达3.22dB的性能提升。",
    "en_tdlr": "This paper proposes a SD-CsiNet which is based on self-information domain and feature coupling for temporal CSI compression. The proposed method uses self-information as an informative CSI representation and couples temporal and spatial features of the self-information matrix for effective compression, achieving up to 3.22 dB performance gain compared with state-of-the-art methods in compressed CSI feedback."
}