{
    "title": "DexPBT: Scaling up Dexterous Manipulation for Hand-Arm Systems with Population Based Training. (arXiv:2305.12127v1 [cs.RO])",
    "abstract": "In this work, we propose algorithms and methods that enable learning dexterous object manipulation using simulated one- or two-armed robots equipped with multi-fingered hand end-effectors. Using a parallel GPU-accelerated physics simulator (Isaac Gym), we implement challenging tasks for these robots, including regrasping, grasp-and-throw, and object reorientation. To solve these problems we introduce a decentralized Population-Based Training (PBT) algorithm that allows us to massively amplify the exploration capabilities of deep reinforcement learning. We find that this method significantly outperforms regular end-to-end learning and is able to discover robust control policies in challenging tasks. Video demonstrations of learned behaviors and the code can be found at https://sites.google.com/view/dexpbt",
    "link": "http://arxiv.org/abs/2305.12127",
    "context": "Title: DexPBT: Scaling up Dexterous Manipulation for Hand-Arm Systems with Population Based Training. (arXiv:2305.12127v1 [cs.RO])\nAbstract: In this work, we propose algorithms and methods that enable learning dexterous object manipulation using simulated one- or two-armed robots equipped with multi-fingered hand end-effectors. Using a parallel GPU-accelerated physics simulator (Isaac Gym), we implement challenging tasks for these robots, including regrasping, grasp-and-throw, and object reorientation. To solve these problems we introduce a decentralized Population-Based Training (PBT) algorithm that allows us to massively amplify the exploration capabilities of deep reinforcement learning. We find that this method significantly outperforms regular end-to-end learning and is able to discover robust control policies in challenging tasks. Video demonstrations of learned behaviors and the code can be found at https://sites.google.com/view/dexpbt",
    "path": "papers/23/05/2305.12127.json",
    "total_tokens": 933,
    "translated_title": "DexPBT：基于人口的训练为手臂系统的灵巧操作扩展规模",
    "translated_abstract": "本文提出了算法和方法，利用带有多指手末端执行器的单臂或双臂机器人进行模拟的灵巧物体操作学习。使用并行的GPU加速物理模拟器(Isaac Gym)，我们为这些机器人实现了具有挑战性的任务，包括重新抓取、抓取-投掷和物体重新定位。为了解决这些问题，我们引入了一种分散的基于人口的训练(PBT)算法，使我们能够大规模地扩展深度强化学习的探索能力。我们发现，这种方法明显优于常规的端到端学习，并能够在具有挑战性的任务中发现稳健的控制策略。可以在 https://sites.google.com/view/dexpbt 找到所学行为的视频演示和代码。",
    "tldr": "本文提出了一种分散的基于人口的训练(PBT)算法，使单臂或双臂机器人在模拟环境中可以学习灵巧的物体操作技能，包括重新抓取、抓取-投掷和物体重新定位，相较于常规的端到端学习，该算法可大大提高深度强化学习的探索能力和发现稳健控制策略的能力。",
    "en_tdlr": "This paper proposes a decentralized Population-Based Training (PBT) algorithm that enables single- or two-armed robots equipped with multi-fingered hand end-effectors to learn dexterous object manipulation in simulated environments, including regrasping, grasp-and-throw, and object reorientation. Compared to regular end-to-end learning, this algorithm significantly amplifies the exploration capabilities of deep reinforcement learning and enables the discovery of robust control policies for challenging tasks."
}