{
    "title": "USTC-NELSLIP at SemEval-2023 Task 2: Statistical Construction and Dual Adaptation of Gazetteer for Multilingual Complex NER. (arXiv:2305.02517v1 [cs.CL])",
    "abstract": "This paper describes the system developed by the USTC-NELSLIP team for SemEval-2023 Task 2 Multilingual Complex Named Entity Recognition (MultiCoNER II). A method named Statistical Construction and Dual Adaptation of Gazetteer (SCDAG) is proposed for Multilingual Complex NER. The method first utilizes a statistics-based approach to construct a gazetteer. Secondly, the representations of gazetteer networks and language models are adapted by minimizing the KL divergence between them at both the sentence-level and entity-level. Finally, these two networks are then integrated for supervised named entity recognition (NER) training. The proposed method is applied to XLM-R with a gazetteer built from Wikidata, and shows great generalization ability across different tracks. Experimental results and detailed analysis verify the effectiveness of the proposed method. The official results show that our system ranked 1st on one track (Hindi) in this task.",
    "link": "http://arxiv.org/abs/2305.02517",
    "context": "Title: USTC-NELSLIP at SemEval-2023 Task 2: Statistical Construction and Dual Adaptation of Gazetteer for Multilingual Complex NER. (arXiv:2305.02517v1 [cs.CL])\nAbstract: This paper describes the system developed by the USTC-NELSLIP team for SemEval-2023 Task 2 Multilingual Complex Named Entity Recognition (MultiCoNER II). A method named Statistical Construction and Dual Adaptation of Gazetteer (SCDAG) is proposed for Multilingual Complex NER. The method first utilizes a statistics-based approach to construct a gazetteer. Secondly, the representations of gazetteer networks and language models are adapted by minimizing the KL divergence between them at both the sentence-level and entity-level. Finally, these two networks are then integrated for supervised named entity recognition (NER) training. The proposed method is applied to XLM-R with a gazetteer built from Wikidata, and shows great generalization ability across different tracks. Experimental results and detailed analysis verify the effectiveness of the proposed method. The official results show that our system ranked 1st on one track (Hindi) in this task.",
    "path": "papers/23/05/2305.02517.json",
    "total_tokens": 967,
    "translated_title": "USTC-NELSLIP在SemEval-2023任务2中的应用：针对多语言复杂命名实体识别进行统计构建和双重适应性辞书的设计",
    "translated_abstract": "本文描述了USTC-NELSLIP团队为SemEval-2023 任务2多语言复杂命名实体识别（MultiCoNER II）开发的系统。提出了一种名为“统计构建和双重适应性辞书（SCDAG）”的方法，用于多语言复杂命名实体识别。该方法首先利用基于统计的方法构建辞书。其次，通过最小化句子级和实体级之间的KL散度，适应辞书网络和语言模型的表示。最后，这两个网络被集成用于监督式命名实体识别训练。该方法应用于使用Wikidata构建的辞书上的XLM-R，表现出跨不同语言的很好的泛化能力。 实验结果和详细分析验证了该方法的有效性。在该任务中，官方结果显示我们的系统在印地语赛道上排名第一。",
    "tldr": "本文介绍了USTC-NELSLIP团队为SemEval-2023任务2开发的系统，该系统提出了一种名为“SCDAG”的方法，用于多语言复杂命名实体识别，该方法通过构建辞书和适应语言模型的表示来提高识别精度，在印地语赛道上排名第一。",
    "en_tdlr": "This paper introduces the system developed by USTC-NELSLIP team for SemEval-2023 Task 2, which proposes a method named \"SCDAG\" for multilingual complex named entity recognition, using gazetteer construction and adaptation of language model representations to improve the recognition accuracy. The system ranked first on the Hindi track according to the official results."
}