{
    "title": "Optimal multi-action treatment allocation: A two-phase field experiment to boost immigrant naturalization. (arXiv:2305.00545v1 [econ.GN])",
    "abstract": "The challenge of assigning optimal treatment policies is ubiquitous in public economics. While a vast empirical literature is concerned with the estimation of causal effects under treatment effect heterogeneity, the potentials of individualized treatment assignments are under-explored, despite recent advances in the field of policy learning. We evaluate the benefits of multi-action policy learning using policy trees in the context of immigration naturalization. We use a tailored two-phase randomized field experiment to estimate and field a policy rule for an information campaign encouraging eligible immigrants in the City of Z\\\"urich to apply for Swiss citizenship. The policy rule takes the form of a decision tree assigning treatments based on individual-level characteristics drawn from linked administrative data. In the exploration phase, we randomly allocate 60% of our sample of 5,145 citizenship-eligible immigrants to receive one of three different letters addressing specific natura",
    "link": "http://arxiv.org/abs/2305.00545",
    "context": "Title: Optimal multi-action treatment allocation: A two-phase field experiment to boost immigrant naturalization. (arXiv:2305.00545v1 [econ.GN])\nAbstract: The challenge of assigning optimal treatment policies is ubiquitous in public economics. While a vast empirical literature is concerned with the estimation of causal effects under treatment effect heterogeneity, the potentials of individualized treatment assignments are under-explored, despite recent advances in the field of policy learning. We evaluate the benefits of multi-action policy learning using policy trees in the context of immigration naturalization. We use a tailored two-phase randomized field experiment to estimate and field a policy rule for an information campaign encouraging eligible immigrants in the City of Z\\\"urich to apply for Swiss citizenship. The policy rule takes the form of a decision tree assigning treatments based on individual-level characteristics drawn from linked administrative data. In the exploration phase, we randomly allocate 60% of our sample of 5,145 citizenship-eligible immigrants to receive one of three different letters addressing specific natura",
    "path": "papers/23/05/2305.00545.json",
    "total_tokens": 907,
    "translated_title": "最优多行动治疗分配：提高移民入籍的双阶段现场实验（arXiv：2305.00545v1 [econ.GN]）",
    "translated_abstract": "在公共经济学中，分配最优治疗政策的挑战是无处不在的。尽管在处理效应异质性的因果效应估计方面有广泛的实证文献，但个性化治疗分配的潜力尚未得到充分利用，尽管政策学习领域最近取得了进展。我们在移民入籍背景下使用政策树评估多行动策略学习的益处。我们使用定制的双阶段随机实验来估计并实施一个信息宣传政策规则，鼓励苏黎世市符合条件的移民申请瑞士公民身份。政策规则采用决策树的形式，根据链接的行政数据中的个人特征分配治疗。在探索阶段，我们将5,145名具有资格的入籍移民样本的60％随机分配给三封不同信件之一。",
    "tldr": "该论文采用政策树评估多行动策略学习的益处，利用个性化治疗分配的潜力，在移民入籍背景下实现最优治疗政策的分配，提高移民入籍率。",
    "en_tdlr": "This paper evaluates the benefits of multi-action policy learning using policy trees to allocate optimal treatment policies in the context of immigration naturalization, with the potential of individualized treatment assignments, thereby improving the rate of naturalization."
}