{
    "title": "On High-dimensional and Low-rank Tensor Bandits. (arXiv:2305.03884v1 [stat.ML])",
    "abstract": "Most existing studies on linear bandits focus on the one-dimensional characterization of the overall system. While being representative, this formulation may fail to model applications with high-dimensional but favorable structures, such as the low-rank tensor representation for recommender systems. To address this limitation, this work studies a general tensor bandits model, where actions and system parameters are represented by tensors as opposed to vectors, and we particularly focus on the case that the unknown system tensor is low-rank. A novel bandit algorithm, coined TOFU (Tensor Optimism in the Face of Uncertainty), is developed. TOFU first leverages flexible tensor regression techniques to estimate low-dimensional subspaces associated with the system tensor. These estimates are then utilized to convert the original problem to a new one with norm constraints on its system parameters. Lastly, a norm-constrained bandit subroutine is adopted by TOFU, which utilizes these constraint",
    "link": "http://arxiv.org/abs/2305.03884",
    "context": "Title: On High-dimensional and Low-rank Tensor Bandits. (arXiv:2305.03884v1 [stat.ML])\nAbstract: Most existing studies on linear bandits focus on the one-dimensional characterization of the overall system. While being representative, this formulation may fail to model applications with high-dimensional but favorable structures, such as the low-rank tensor representation for recommender systems. To address this limitation, this work studies a general tensor bandits model, where actions and system parameters are represented by tensors as opposed to vectors, and we particularly focus on the case that the unknown system tensor is low-rank. A novel bandit algorithm, coined TOFU (Tensor Optimism in the Face of Uncertainty), is developed. TOFU first leverages flexible tensor regression techniques to estimate low-dimensional subspaces associated with the system tensor. These estimates are then utilized to convert the original problem to a new one with norm constraints on its system parameters. Lastly, a norm-constrained bandit subroutine is adopted by TOFU, which utilizes these constraint",
    "path": "papers/23/05/2305.03884.json",
    "total_tokens": 969,
    "translated_title": "高维低秩张量赌博机研究",
    "translated_abstract": "大多数线性赌博机的研究都侧重于整个系统的一维特征。虽然代表性很强，但这种方法可能不能模拟高维但有优势结构的应用，例如用于推荐系统的低秩张量表示。为了解决这个限制，本研究研究了一个通用的张量赌博机模型，其中行动和系统参数由张量表示，而我们特别关注未知系统张量为低秩的情况。发展了一种新的赌博机算法TOFU（不确定性中的张量乐观），该算法首先利用灵活的张量回归技术估计与系统张量相关联的低维子空间。然后利用这些估计将原始问题转换为一个具有其系统参数范数约束的新问题。最后，TOFU采用范数约束赌博子例程，利用这些约束来实现问题的解决。",
    "tldr": "本研究提出了一个通用的张量赌博机模型，其中行动和系统参数由张量表示，着重于未知系统张量为低秩的情况。所开发的 TOFU 算法首先利用灵活的张量回归技术估计与系统张量相关联的低维子空间，然后将原始问题转换成一个具有系统参数范数约束的新问题，并采用范数约束赌博子例程解决。",
    "en_tdlr": "This paper proposes a general tensor bandits model and introduces a novel bandit algorithm, TOFU, which focuses on the case wherein the unknown system tensor is low-rank. TOFU leverages flexible tensor regression techniques to estimate low-dimensional subspaces associated with the system tensor and converts the original problem to a new one with norm constraints on its system parameters, which is solved using a norm-constrained bandit subroutine."
}