{
    "title": "Multi-Value Alignment in Normative Multi-Agent System: Evolutionary Optimisation Approach. (arXiv:2305.07366v1 [cs.MA])",
    "abstract": "Value-alignment in normative multi-agent systems is used to promote a certain value and to ensure the consistent behavior of agents in autonomous intelligent systems with human values. However, the current literature is limited to incorporation of effective norms for single value alignment with no consideration of agents' heterogeneity and the requirement of simultaneous promotion and alignment of multiple values. This research proposes a multi-value promotion model that uses multi-objective evolutionary algorithms to produce the optimum parametric set of norms that is aligned with multiple simultaneous values of heterogeneous agents and the system. To understand various aspects of this complex problem, several evolutionary algorithms were used to find a set of optimised norm parameters considering two toy tax scenarios with two and five values are considered. The results are analysed from different perspectives to show the impact of a selected evolutionary algorithm on the solution, a",
    "link": "http://arxiv.org/abs/2305.07366",
    "context": "Title: Multi-Value Alignment in Normative Multi-Agent System: Evolutionary Optimisation Approach. (arXiv:2305.07366v1 [cs.MA])\nAbstract: Value-alignment in normative multi-agent systems is used to promote a certain value and to ensure the consistent behavior of agents in autonomous intelligent systems with human values. However, the current literature is limited to incorporation of effective norms for single value alignment with no consideration of agents' heterogeneity and the requirement of simultaneous promotion and alignment of multiple values. This research proposes a multi-value promotion model that uses multi-objective evolutionary algorithms to produce the optimum parametric set of norms that is aligned with multiple simultaneous values of heterogeneous agents and the system. To understand various aspects of this complex problem, several evolutionary algorithms were used to find a set of optimised norm parameters considering two toy tax scenarios with two and five values are considered. The results are analysed from different perspectives to show the impact of a selected evolutionary algorithm on the solution, a",
    "path": "papers/23/05/2305.07366.json",
    "total_tokens": 820,
    "translated_title": "规范多智能体系统中的多值对齐：进化优化方法",
    "translated_abstract": "规范多智能体系统中的价值对齐是用于推广某种价值并确保智能系统与人类价值的一致性行为的方法。然而，目前的文献限于将有效的规范纳入单一价值对齐中，而没有考虑到智能体的异质性和同时推进和对齐多个价值的要求。本研究提出了一个多值推广模型，使用多目标进化算法生成与异质智能体和系统的多个同时值对齐的最优参数规范集。为了了解这个复杂问题的各个方面，使用了几种进化算法来找到一组优化的规范参数，考虑了两个玩具税收场景的两个和五个值。从不同的角度分析了结果，以展示所选进化算法对解决方案的影响。",
    "tldr": "本研究提出一种通过多目标进化算法来实现多值推广的规范多智能体系统方法，并考虑系统中智能体的异质性和同时对齐多个价值的要求。"
}