{
    "title": "MISNN: Multiple Imputation via Semi-parametric Neural Networks. (arXiv:2305.01794v1 [stat.ME])",
    "abstract": "Multiple imputation (MI) has been widely applied to missing value problems in biomedical, social and econometric research, in order to avoid improper inference in the downstream data analysis. In the presence of high-dimensional data, imputation models that include feature selection, especially $\\ell_1$ regularized regression (such as Lasso, adaptive Lasso, and Elastic Net), are common choices to prevent the model from underdetermination. However, conducting MI with feature selection is difficult: existing methods are often computationally inefficient and poor in performance. We propose MISNN, a novel and efficient algorithm that incorporates feature selection for MI. Leveraging the approximation power of neural networks, MISNN is a general and flexible framework, compatible with any feature selection method, any neural network architecture, high/low-dimensional data and general missing patterns. Through empirical experiments, MISNN has demonstrated great advantages over state-of-the-a",
    "link": "http://arxiv.org/abs/2305.01794",
    "context": "Title: MISNN: Multiple Imputation via Semi-parametric Neural Networks. (arXiv:2305.01794v1 [stat.ME])\nAbstract: Multiple imputation (MI) has been widely applied to missing value problems in biomedical, social and econometric research, in order to avoid improper inference in the downstream data analysis. In the presence of high-dimensional data, imputation models that include feature selection, especially $\\ell_1$ regularized regression (such as Lasso, adaptive Lasso, and Elastic Net), are common choices to prevent the model from underdetermination. However, conducting MI with feature selection is difficult: existing methods are often computationally inefficient and poor in performance. We propose MISNN, a novel and efficient algorithm that incorporates feature selection for MI. Leveraging the approximation power of neural networks, MISNN is a general and flexible framework, compatible with any feature selection method, any neural network architecture, high/low-dimensional data and general missing patterns. Through empirical experiments, MISNN has demonstrated great advantages over state-of-the-a",
    "path": "papers/23/05/2305.01794.json",
    "total_tokens": 860,
    "translated_title": "MISNN: 基于半参数神经网络的多重插补方法",
    "translated_abstract": "多重插补方法（MI）被广泛应用于生物医学、社会和计量研究中的缺失值问题，以避免下游数据分析中的不当推断。在存在高维数据时，包括特征选择的插补模型，尤其是$\\ell_1$规则化回归（如Lasso、自适应Lasso和弹性网络）是防止模型欠决定的常见选择。然而，使用特征选择进行MI是困难的：现有方法通常计算效率低下且性能差。我们提出了一种新颖而有效的算法MISNN，它结合了神经网络的近似能力，是一个通用和灵活的框架，兼容任何特征选择方法、任何神经网络结构、高/低维数据和一般缺失模式。通过实证实验，MISNN在计算效率和插补精度方面展现了比现有方法更大的优势。",
    "tldr": "MISNN是一种基于半参数神经网络的多重插补方法，具有高效性和良好的插补精度，尤其适用于高维数据和特征选择问题。",
    "en_tdlr": "MISNN is a multiple imputation method based on semi-parametric neural networks, providing high efficiency and accuracy, especially suitable for high-dimensional data and feature selection problems."
}