{
    "title": "Human labeling errors and their impact on ConvNets for satellite image scene classification. (arXiv:2305.12106v1 [cs.CV])",
    "abstract": "Convolutional neural networks (ConvNets) have been successfully applied to satellite image scene classification. Human-labeled training datasets are essential for ConvNets to perform accurate classification. Errors in human-labeled training datasets are unavoidable due to the complexity of satellite images. However, the distribution of human labeling errors on satellite images and their impact on ConvNets have not been investigated. To fill this research gap, this study, for the first time, collected real-world labels from 32 participants and explored how their errors affect three ConvNets (VGG16, GoogleNet and ResNet-50) for high-resolution satellite image scene classification. We found that: (1) human labeling errors have significant class and instance dependence, which is fundamentally different from the simulation noise in previous studies; (2) regarding the overall accuracy of all classes, when human labeling errors in training data increase by one unit, the overall accuracy of Co",
    "link": "http://arxiv.org/abs/2305.12106",
    "context": "Title: Human labeling errors and their impact on ConvNets for satellite image scene classification. (arXiv:2305.12106v1 [cs.CV])\nAbstract: Convolutional neural networks (ConvNets) have been successfully applied to satellite image scene classification. Human-labeled training datasets are essential for ConvNets to perform accurate classification. Errors in human-labeled training datasets are unavoidable due to the complexity of satellite images. However, the distribution of human labeling errors on satellite images and their impact on ConvNets have not been investigated. To fill this research gap, this study, for the first time, collected real-world labels from 32 participants and explored how their errors affect three ConvNets (VGG16, GoogleNet and ResNet-50) for high-resolution satellite image scene classification. We found that: (1) human labeling errors have significant class and instance dependence, which is fundamentally different from the simulation noise in previous studies; (2) regarding the overall accuracy of all classes, when human labeling errors in training data increase by one unit, the overall accuracy of Co",
    "path": "papers/23/05/2305.12106.json",
    "total_tokens": 1182,
    "translated_title": "人类标注误差及其对卫星图像场景分类的ConvNets的影响",
    "translated_abstract": "卷积神经网络(ConvNets)已成功应用于卫星图像场景分类。对于ConvNets执行准确分类，人工标注的训练数据集至关重要。然而，由于卫星图像的复杂性，人工标注数据集中的误差是不可避免的。然而，人类标注误差在卫星图像上的分布及其对ConvNets的影响尚未进行研究。为了填补这一研究空白，本研究首次收集了来自32位参与者的真实标签，并探讨了它们的误差如何影响高分辨率卫星图像场景分类中的三个ConvNets（VGG16，GoogleNet和ResNet-50）。我们发现：（1）人类标注误差具有显着的类和实例依赖性，这与以前研究中的模拟噪声本质上不同，（2）关于所有类的总体精度，当训练数据的人工标注误差增加1个单位时，ConvNets的总体精度会降低0.67%~1.02%；（3）人类标注误差对不同CNN结构的影响各不相同。本研究强调了仔细检查卫星图像场景分类中的人类标注误差的重要性，并呼吁开发强大的ConvNets来解决这一挑战。",
    "tldr": "本文针对卫星图像场景分类中人工标注数据集的不可避免的误差问题，收集了真实标签数据，并探讨这些误差如何影响三个ConvNets的分类结果。研究发现，人类标注误差具有显着的类和实例依赖性，并且对不同CNN结构的影响不同，因此需要仔细考虑这些误差并开发更强大的ConvNets来解决这一挑战。",
    "en_tdlr": "This paper investigates the impact of human labeling errors on ConvNets for high-resolution satellite image scene classification. The study collected real-world labels from 32 participants and explored how their errors affect three different ConvNets. The research highlights the significant class and instance dependence of human labeling errors and calls for the development of more robust ConvNets to tackle this challenge."
}