{
    "title": "Using Textual Interface to Align External Knowledge for End-to-End Task-Oriented Dialogue Systems. (arXiv:2305.13710v1 [cs.CL])",
    "abstract": "Traditional end-to-end task-oriented dialogue systems have been built with a modularized design. However, such design often causes misalignment between the agent response and external knowledge, due to inadequate representation of information. Furthermore, its evaluation metrics emphasize assessing the agent's pre-lexicalization response, neglecting the quality of the completed response. In this work, we propose a novel paradigm that uses a textual interface to align external knowledge and eliminate redundant processes. We demonstrate our paradigm in practice through MultiWOZ-Remake, including an interactive textual interface built for the MultiWOZ database and a correspondingly re-processed dataset. We train an end-to-end dialogue system to evaluate this new dataset. The experimental results show that our approach generates more natural final responses and achieves a greater task success rate compared to the previous models.",
    "link": "http://arxiv.org/abs/2305.13710",
    "context": "Title: Using Textual Interface to Align External Knowledge for End-to-End Task-Oriented Dialogue Systems. (arXiv:2305.13710v1 [cs.CL])\nAbstract: Traditional end-to-end task-oriented dialogue systems have been built with a modularized design. However, such design often causes misalignment between the agent response and external knowledge, due to inadequate representation of information. Furthermore, its evaluation metrics emphasize assessing the agent's pre-lexicalization response, neglecting the quality of the completed response. In this work, we propose a novel paradigm that uses a textual interface to align external knowledge and eliminate redundant processes. We demonstrate our paradigm in practice through MultiWOZ-Remake, including an interactive textual interface built for the MultiWOZ database and a correspondingly re-processed dataset. We train an end-to-end dialogue system to evaluate this new dataset. The experimental results show that our approach generates more natural final responses and achieves a greater task success rate compared to the previous models.",
    "path": "papers/23/05/2305.13710.json",
    "total_tokens": 856,
    "translated_title": "使用文本界面对齐外部知识以实现端到端任务导向对话系统",
    "translated_abstract": "传统的端到端任务导向对话系统采用模块化设计。然而，这种设计常常导致代理响应与外部知识之间的不对齐，由于信息表示不足而产生。此外，其评估指标强调评估代理的预词汇化响应，忽略了完成响应的质量。在本文中，我们提出了一个新的范例，使用文本界面对齐外部知识，消除冗余的过程。我们在MultiWOZ-Remake中演示了我们的范例，包括为MultiWOZ数据库构建的交互式文本界面和相应的重新处理的数据集。我们训练了一个端到端对话系统来评估这个新数据集。实验结果表明，我们的方法生成了更自然的最终响应，并且相对于先前的模型实现了更大的任务成功率。",
    "tldr": "本文提出了一种使用文本界面对齐外部知识以消除繁琐过程的端到端任务导向对话系统的新范例，实验结果表明该方法生成了更自然的最终响应，并且相对于先前的模型实现了更大的任务成功率。",
    "en_tdlr": "A new paradigm for end-to-end task-oriented dialogue systems is proposed, which uses a textual interface to align external knowledge and eliminate redundant processes. Experimental results show that this approach generates more natural final responses and achieves a greater task success rate compared to previous models."
}