{
    "title": "Denoising Multi-modal Sequential Recommenders with Contrastive Learning. (arXiv:2305.01915v1 [cs.IR])",
    "abstract": "There is a rapidly-growing research interest in engaging users with multi-modal data for accurate user modeling on recommender systems. Existing multimedia recommenders have achieved substantial improvements by incorporating various modalities and devising delicate modules. However, when users decide to interact with items, most of them do not fully read the content of all modalities. We refer to modalities that directly cause users' behaviors as point-of-interests, which are important aspects to capture users' interests. In contrast, modalities that do not cause users' behaviors are potential noises and might mislead the learning of a recommendation model. Not surprisingly, little research in the literature has been devoted to denoising such potential noises due to the inaccessibility of users' explicit feedback on their point-of-interests. To bridge the gap, we propose a weakly-supervised framework based on contrastive learning for denoising multi-modal recommenders (dubbed Demure). ",
    "link": "http://arxiv.org/abs/2305.01915",
    "context": "Title: Denoising Multi-modal Sequential Recommenders with Contrastive Learning. (arXiv:2305.01915v1 [cs.IR])\nAbstract: There is a rapidly-growing research interest in engaging users with multi-modal data for accurate user modeling on recommender systems. Existing multimedia recommenders have achieved substantial improvements by incorporating various modalities and devising delicate modules. However, when users decide to interact with items, most of them do not fully read the content of all modalities. We refer to modalities that directly cause users' behaviors as point-of-interests, which are important aspects to capture users' interests. In contrast, modalities that do not cause users' behaviors are potential noises and might mislead the learning of a recommendation model. Not surprisingly, little research in the literature has been devoted to denoising such potential noises due to the inaccessibility of users' explicit feedback on their point-of-interests. To bridge the gap, we propose a weakly-supervised framework based on contrastive learning for denoising multi-modal recommenders (dubbed Demure). ",
    "path": "papers/23/05/2305.01915.json",
    "total_tokens": 864,
    "translated_title": "基于对比学习的去噪多模态推荐系统",
    "translated_abstract": "目前，将多模态数据用于推荐系统中的用户建模已成为一个快速增长的研究领域。现有的多媒体推荐器通过整合各种模态并设计精细的模块，取得了显著的改进。但是，当用户决定与物品进行交互时，他们大多数并没有完全阅读所有模态的内容。我们称直接导致用户行为的模态为兴趣点，这些点是捕捉用户兴趣的重要方面。与之相反，不直接导致用户行为的模态则可能是潜在的噪音，并可能误导推荐模型的学习。由于无法访问用户显式反馈其兴趣点，因此文献中很少有研究致力于去除这些潜在的噪音。为了填补这一空白，我们提出一种基于对比学习的弱监督框架，用于去噪多模态推荐系统（称为Demure）。",
    "tldr": "本文提出一种名为Demure的系统，采用对比学习来去除多模态推荐系统中的潜在噪音，以此提高模型效果。",
    "en_tdlr": "This paper proposes a system called Demure, which uses contrastive learning to remove potential noise in multi-modal recommender systems and improve model performance."
}