{
    "title": "Identification of stormwater control strategies and their associated uncertainties using Bayesian Optimization. (arXiv:2305.18630v1 [cs.LG])",
    "abstract": "Dynamic control is emerging as an effective methodology for operating stormwater systems under stress from rapidly evolving weather patterns. Informed by rainfall predictions and real-time sensor measurements, control assets in the stormwater network can be dynamically configured to tune the behavior of the stormwater network to reduce the risk of urban flooding, equalize flows to the water reclamation facilities, and protect the receiving water bodies. However, developing such control strategies requires significant human and computational resources, and a methodology does not yet exist for quantifying the risks associated with implementing these control strategies. To address these challenges, in this paper, we introduce a Bayesian Optimization-based approach for identifying stormwater control strategies and estimating the associated uncertainties. We evaluate the efficacy of this approach in identifying viable control strategies in a simulated environment on real-world inspired comb",
    "link": "http://arxiv.org/abs/2305.18630",
    "context": "Title: Identification of stormwater control strategies and their associated uncertainties using Bayesian Optimization. (arXiv:2305.18630v1 [cs.LG])\nAbstract: Dynamic control is emerging as an effective methodology for operating stormwater systems under stress from rapidly evolving weather patterns. Informed by rainfall predictions and real-time sensor measurements, control assets in the stormwater network can be dynamically configured to tune the behavior of the stormwater network to reduce the risk of urban flooding, equalize flows to the water reclamation facilities, and protect the receiving water bodies. However, developing such control strategies requires significant human and computational resources, and a methodology does not yet exist for quantifying the risks associated with implementing these control strategies. To address these challenges, in this paper, we introduce a Bayesian Optimization-based approach for identifying stormwater control strategies and estimating the associated uncertainties. We evaluate the efficacy of this approach in identifying viable control strategies in a simulated environment on real-world inspired comb",
    "path": "papers/23/05/2305.18630.json",
    "total_tokens": 877,
    "translated_title": "基于贝叶斯优化的暴雨控制策略及其不确定性识别",
    "translated_abstract": "动态控制越来越成为应对快速演变的天气模式对暴雨系统操作的有效方法。通过降雨预测和实时传感器测量，可以动态配置暴雨网络中的控制资产，调整暴雨网络的行为，减少城市洪涝的风险，将流量均衡到用水再生设施，并保护接收水体。然而，开发这样的控制策略需要大量的人力和计算资源，并且还不存在一种方法来量化实施这些控制策略所带来的风险。为了解决这些挑战，在本文中，我们介绍了一种基于贝叶斯优化的方法来识别暴雨控制策略并估计相关的不确定性。我们在仿真环境中评估了这种方法在识别实际中可行的控制策略方面的功效。",
    "tldr": "本文提出了一种基于贝叶斯优化的方法来识别暴雨控制策略并估计相关的不确定性，实现了通过动态配置暴雨网络中的控制资产，调整暴雨网络行为，减少城市洪涝风险的目标。",
    "en_tdlr": "This paper proposes a Bayesian Optimization-based approach for identifying stormwater control strategies and estimating the associated uncertainties, which achieves the goal of reducing the risk of urban flooding by dynamically configuring control assets in the stormwater network and tuning the behavior of the network."
}