{
    "title": "Improving CFD simulations by local machine-learned correction. (arXiv:2305.00114v1 [physics.flu-dyn])",
    "abstract": "High-fidelity computational fluid dynamics (CFD) simulations for design space explorations can be exceedingly expensive due to the cost associated with resolving the finer scales. This computational cost/accuracy trade-off is a major challenge for modern CFD simulations. In the present study, we propose a method that uses a trained machine learning model that has learned to predict the discretization error as a function of largescale flow features to inversely estimate the degree of lost information due to mesh coarsening. This information is then added back to the low-resolution solution during runtime, thereby enhancing the quality of the under-resolved coarse mesh simulation. The use of a coarser mesh produces a non-linear benefit in speed while the cost of inferring and correcting for the lost information has a linear cost. We demonstrate the numerical stability of a problem of engineering interest, a 3D turbulent channel flow. In addition to this demonstration, we further show the",
    "link": "http://arxiv.org/abs/2305.00114",
    "context": "Title: Improving CFD simulations by local machine-learned correction. (arXiv:2305.00114v1 [physics.flu-dyn])\nAbstract: High-fidelity computational fluid dynamics (CFD) simulations for design space explorations can be exceedingly expensive due to the cost associated with resolving the finer scales. This computational cost/accuracy trade-off is a major challenge for modern CFD simulations. In the present study, we propose a method that uses a trained machine learning model that has learned to predict the discretization error as a function of largescale flow features to inversely estimate the degree of lost information due to mesh coarsening. This information is then added back to the low-resolution solution during runtime, thereby enhancing the quality of the under-resolved coarse mesh simulation. The use of a coarser mesh produces a non-linear benefit in speed while the cost of inferring and correcting for the lost information has a linear cost. We demonstrate the numerical stability of a problem of engineering interest, a 3D turbulent channel flow. In addition to this demonstration, we further show the",
    "path": "papers/23/05/2305.00114.json",
    "total_tokens": 906,
    "translated_title": "通过局部机器学习校正改善CFD模拟",
    "translated_abstract": "由于解决更精细的尺度带来的高成本，高保真计算流体动力学(CFD)模拟在设计空间探索中可能会非常昂贵。这种计算成本/精度平衡是现代CFD模拟的主要挑战。本研究提出了一种方法，使用一个经过训练的机器学习模型，学习预测作为大尺度流特征函数的离散化误差，以逆向估算因网格粗化而失去信息的程度。然后在运行时将这些信息添加回低分辨率解中，从而增强了不足分辨率的粗网格模拟的质量。使用更粗糙的网格产生了速度上的非线性优势，而推断和纠正丢失信息的成本具有线性成本。我们展示了一个具有工程意义的问题的数值稳定性，即三维湍流通道流动。除了这个演示外，我们还展示了更多的结果。",
    "tldr": "该研究引入一种使用机器学习模型逆向估算网格粗化导致信息丢失的方法，从而在CFD模拟中加入这些信息，提高低分辨率网格模拟的质量。",
    "en_tdlr": "This study introduces a method that uses a machine learning model to inversely estimate the information lost due to mesh coarsening in CFD simulations and adds it back to enhance the quality of the under-resolved coarse mesh simulations, resulting in nonlinear speed benefits and improved quality."
}