{
    "title": "Block Coordinate Plug-and-Play Methods for Blind Inverse Problems. (arXiv:2305.12672v2 [eess.IV] UPDATED)",
    "abstract": "Plug-and-play (PnP) prior is a well-known class of methods for solving imaging inverse problems by computing fixed-points of operators combining physical measurement models and learned image denoisers. While PnP methods have been extensively used for image recovery with known measurement operators, there is little work on PnP for solving blind inverse problems. We address this gap by presenting a new block-coordinate PnP (BC-PnP) method that efficiently solves this joint estimation problem by introducing learned denoisers as priors on both the unknown image and the unknown measurement operator. We present a new convergence theory for BC-PnP compatible with blind inverse problems by considering nonconvex data-fidelity terms and expansive denoisers. Our theory analyzes the convergence of BC-PnP to a stationary point of an implicit function associated with an approximate minimum mean-squared error (MMSE) denoiser. We numerically validate our method on two blind inverse problems: automatic",
    "link": "http://arxiv.org/abs/2305.12672",
    "context": "Title: Block Coordinate Plug-and-Play Methods for Blind Inverse Problems. (arXiv:2305.12672v2 [eess.IV] UPDATED)\nAbstract: Plug-and-play (PnP) prior is a well-known class of methods for solving imaging inverse problems by computing fixed-points of operators combining physical measurement models and learned image denoisers. While PnP methods have been extensively used for image recovery with known measurement operators, there is little work on PnP for solving blind inverse problems. We address this gap by presenting a new block-coordinate PnP (BC-PnP) method that efficiently solves this joint estimation problem by introducing learned denoisers as priors on both the unknown image and the unknown measurement operator. We present a new convergence theory for BC-PnP compatible with blind inverse problems by considering nonconvex data-fidelity terms and expansive denoisers. Our theory analyzes the convergence of BC-PnP to a stationary point of an implicit function associated with an approximate minimum mean-squared error (MMSE) denoiser. We numerically validate our method on two blind inverse problems: automatic",
    "path": "papers/23/05/2305.12672.json",
    "total_tokens": 926,
    "translated_title": "盲反问题的块坐标插入和播放方法",
    "translated_abstract": "插入和播放（PnP）先验是一类解决成像反问题的方法，通过计算物理测量模型和学习图像去噪器的组合运算符的不动点来实现。虽然PnP方法已广泛用于已知测量算子的图像恢复，但在解决盲反问题方面的研究很少。我们通过提出一种新的块坐标PnP（BC-PnP）方法来填补这一空白，该方法通过引入学习的去噪器作为未知图像和未知测量算子的先验来高效地解决这个联合估计问题。我们提出了一种与盲反问题兼容的BC-PnP收敛理论，该理论考虑了非凸数据适应度项和扩张去噪器。我们的理论分析了BC-PnP收敛到与近似的最小均方误差（MMSE）去噪器相关联的隐式函数的稳定点。我们在两个盲反问题上进行了数值验证。",
    "tldr": "该论文提出了一种新的块坐标插入和播放（BC-PnP）方法，通过引入学习的去噪器作为先验，高效地解决盲反问题。该方法在非凸数据适应度项和扩张去噪器的条件下收敛到一个隐式函数的稳定点。",
    "en_tdlr": "This paper presents a new block-coordinate plug-and-play (BC-PnP) method that efficiently solves blind inverse problems by introducing learned denoisers as priors. The method converges to a stationary point of an implicit function under the conditions of nonconvex data-fidelity terms and expansive denoisers."
}