{
    "title": "A Novel Stochastic LSTM Model Inspired by Quantum Machine Learning. (arXiv:2305.10212v1 [cs.LG])",
    "abstract": "Works in quantum machine learning (QML) over the past few years indicate that QML algorithms can function just as well as their classical counterparts, and even outperform them in some cases. Among the corpus of recent work, many current QML models take advantage of variational quantum algorithm (VQA) circuits, given that their scale is typically small enough to be compatible with NISQ devices and the method of automatic differentiation for optimizing circuit parameters is familiar to machine learning (ML). While the results bear interesting promise for an era when quantum machines are more readily accessible, if one can achieve similar results through non-quantum methods then there may be a more near-term advantage available to practitioners. To this end, the nature of this work is to investigate the utilization of stochastic methods inspired by a variational quantum version of the long short-term memory (LSTM) model in an attempt to approach the reported successes in performance and ",
    "link": "http://arxiv.org/abs/2305.10212",
    "context": "Title: A Novel Stochastic LSTM Model Inspired by Quantum Machine Learning. (arXiv:2305.10212v1 [cs.LG])\nAbstract: Works in quantum machine learning (QML) over the past few years indicate that QML algorithms can function just as well as their classical counterparts, and even outperform them in some cases. Among the corpus of recent work, many current QML models take advantage of variational quantum algorithm (VQA) circuits, given that their scale is typically small enough to be compatible with NISQ devices and the method of automatic differentiation for optimizing circuit parameters is familiar to machine learning (ML). While the results bear interesting promise for an era when quantum machines are more readily accessible, if one can achieve similar results through non-quantum methods then there may be a more near-term advantage available to practitioners. To this end, the nature of this work is to investigate the utilization of stochastic methods inspired by a variational quantum version of the long short-term memory (LSTM) model in an attempt to approach the reported successes in performance and ",
    "path": "papers/23/05/2305.10212.json",
    "total_tokens": 861,
    "translated_title": "一种受量子机器学习启发的新型随机LSTM模型",
    "translated_abstract": "近年来，量子机器学习(QML)的研究表明，QML算法不仅可以像传统算法一样发挥其功能，而且在某些情况下甚至可以超越其表现。在众多研究中，许多QML模型利用变分量子算法(VQA)电路，因为其规模通常足够小，可以与NISQ设备兼容，并且用于优化电路参数的自动微分方法熟悉于机器学习(ML)。尽管这些结果在量子机器更易于使用的时代，带来了有趣的前景，但如果通过非量子方法可以达到类似的结果，那么从业者可能会获得更近期的优势。因此，本文探讨了利用受变分量子LSTM模型启发的随机方法的使用，以试图在非量子框架中接近QML的报告成功和潜在好处。",
    "tldr": "本文提出了一种新型随机LSTM模型，受到变分量子算法的启发，探讨在非量子框架下接近QML的报告成功和潜在好处。",
    "en_tdlr": "This paper proposes a novel stochastic LSTM model inspired by variational quantum algorithms, aiming to approach the reported successes and potential benefits of quantum machine learning in a non-quantum framework."
}