{
    "title": "Agile gesture recognition for capacitive sensing devices: adapting on-the-job. (arXiv:2305.07624v1 [cs.LG])",
    "abstract": "Automated hand gesture recognition has been a focus of the AI community for decades. Traditionally, work in this domain revolved largely around scenarios assuming the availability of the flow of images of the user hands. This has partly been due to the prevalence of camera-based devices and the wide availability of image data. However, there is growing demand for gesture recognition technology that can be implemented on low-power devices using limited sensor data instead of high-dimensional inputs like hand images. In this work, we demonstrate a hand gesture recognition system and method that uses signals from capacitive sensors embedded into the etee hand controller. The controller generates real-time signals from each of the wearer five fingers. We use a machine learning technique to analyse the time series signals and identify three features that can represent 5 fingers within 500 ms. The analysis is composed of a two stage training strategy, including dimension reduction through pr",
    "link": "http://arxiv.org/abs/2305.07624",
    "context": "Title: Agile gesture recognition for capacitive sensing devices: adapting on-the-job. (arXiv:2305.07624v1 [cs.LG])\nAbstract: Automated hand gesture recognition has been a focus of the AI community for decades. Traditionally, work in this domain revolved largely around scenarios assuming the availability of the flow of images of the user hands. This has partly been due to the prevalence of camera-based devices and the wide availability of image data. However, there is growing demand for gesture recognition technology that can be implemented on low-power devices using limited sensor data instead of high-dimensional inputs like hand images. In this work, we demonstrate a hand gesture recognition system and method that uses signals from capacitive sensors embedded into the etee hand controller. The controller generates real-time signals from each of the wearer five fingers. We use a machine learning technique to analyse the time series signals and identify three features that can represent 5 fingers within 500 ms. The analysis is composed of a two stage training strategy, including dimension reduction through pr",
    "path": "papers/23/05/2305.07624.json",
    "total_tokens": 916,
    "translated_title": "电容传感设备的敏捷手势识别：在工作中的适应",
    "translated_abstract": "自动手势识别是人工智能社区几十年来的关注焦点。传统上，该领域的研究主要围绕假设用户手部图像流的可用性展开。这部分原因在于基于相机的设备的普及和图像数据的广泛可用性。然而，越来越多的需求需要手势识别技术，该技术可以使用有限的传感器数据而不是高维度的输入(如手部图像)来实现在低功耗设备上。在这项工作中，我们展示了一种手势识别系统和方法，它利用了嵌入到etee手柄控制器中的电容传感器的信号。该控制器从佩戴者的五个手指中产生实时信号。我们使用机器学习技术来分析时序信号，并确定可以在500毫秒内表示5个手指的三个特征。分析由两个阶段的培训策略组成，包括通过主成分分析进行的降维",
    "tldr": "该论文介绍了一种使用电容传感器信号识别手势的技术，通过机器学习技术能够在低功耗设备上实现，并在500毫秒内能够确定5个手指的三个特征，将手势的识别效率提高了。",
    "en_tdlr": "The paper introduces a technology that uses signals from capacitive sensors to recognize gestures, which can be implemented on low-power devices through machine learning techniques. It can determine three features of five fingers within 500ms, improving the efficiency of gesture recognition."
}