{
    "title": "Skill-Based Few-Shot Selection for In-Context Learning. (arXiv:2305.14210v2 [cs.CL] UPDATED)",
    "abstract": "In-context learning is the paradigm that adapts large language models to downstream tasks by providing a few examples. Few-shot selection -- selecting appropriate examples for each test instance separately -- is important for in-context learning. In this paper, we propose Skill-KNN, a skill-based few-shot selection method for in-context learning. The key advantages of Skill-KNN include: (1) it addresses the problem that existing methods based on pre-trained embeddings can be easily biased by surface natural language features that are not important for the target task; (2) it does not require training or fine-tuning of any models, making it suitable for frequently expanding or changing example banks. The key insight is to optimize the inputs fed into the embedding model, rather than tuning the model itself. Technically, Skill-KNN generates the skill-based descriptions for each test case and candidate example by utilizing a pre-processing few-shot prompting, thus eliminating unimportant ",
    "link": "http://arxiv.org/abs/2305.14210",
    "context": "Title: Skill-Based Few-Shot Selection for In-Context Learning. (arXiv:2305.14210v2 [cs.CL] UPDATED)\nAbstract: In-context learning is the paradigm that adapts large language models to downstream tasks by providing a few examples. Few-shot selection -- selecting appropriate examples for each test instance separately -- is important for in-context learning. In this paper, we propose Skill-KNN, a skill-based few-shot selection method for in-context learning. The key advantages of Skill-KNN include: (1) it addresses the problem that existing methods based on pre-trained embeddings can be easily biased by surface natural language features that are not important for the target task; (2) it does not require training or fine-tuning of any models, making it suitable for frequently expanding or changing example banks. The key insight is to optimize the inputs fed into the embedding model, rather than tuning the model itself. Technically, Skill-KNN generates the skill-based descriptions for each test case and candidate example by utilizing a pre-processing few-shot prompting, thus eliminating unimportant ",
    "path": "papers/23/05/2305.14210.json",
    "total_tokens": 864,
    "translated_title": "基于技能的少样本选择以适应上下文学习",
    "translated_abstract": "在上下文学习中，通过提供一些示例来适应下游任务是一种范例。针对每个测试实例选择适当的示例是上下文学习中很重要的。在本文中，我们提出了一种基于技能的少样本选择方法，用于上下文学习。Skill-KNN的关键优势包括：（1）它解决了现有基于预训练嵌入的方法容易因为不重要的自然语言表面特征对目标任务产生偏见的问题；（2）它不需要训练或微调任何模型，适用于频繁扩展或更改示例库的情况。其关键见解是优化输入到嵌入模型中，而不是调整模型本身。在技术上，Skill-KNN通过利用预处理少样本提示为每个测试案例和候选示例生成基于技能的描述，从而消除了不重要的信息。",
    "tldr": "本文提出了Skill-KNN，一种基于技能的少样本选择方法，用于上下文学习。它解决了现有方法的偏见问题并且不需要训练模型，适用于不断扩展或更改示例库的情况。",
    "en_tdlr": "This paper proposes Skill-KNN, a skill-based few-shot selection method for in-context learning. It addresses the bias problem of existing methods and does not require training models, making it suitable for expanding or changing example banks."
}