{
    "title": "Towards a Computational Analysis of Suspense: Detecting Dangerous Situations. (arXiv:2305.06818v1 [cs.CL])",
    "abstract": "Suspense is an important tool in storytelling to keep readers engaged and wanting to read more. However, it has so far not been studied extensively in Computational Literary Studies. In this paper, we focus on one of the elements authors can use to build up suspense: dangerous situations. We introduce a corpus of texts annotated with dangerous situations, distinguishing between 7 types of danger. Additionally, we annotate parts of the text that describe fear experienced by a character, regardless of the actual presence of danger. We present experiments towards the automatic detection of these situations, finding that unsupervised baseline methods can provide valuable signals for the detection, but more complex methods are necessary for further analysis. Not unexpectedly, the description of danger and fear often relies heavily on the context, both local (e.g., situations where danger is only mentioned, but not actually present) and global (e.g., \"storm\" being used in a literal sense in ",
    "link": "http://arxiv.org/abs/2305.06818",
    "context": "Title: Towards a Computational Analysis of Suspense: Detecting Dangerous Situations. (arXiv:2305.06818v1 [cs.CL])\nAbstract: Suspense is an important tool in storytelling to keep readers engaged and wanting to read more. However, it has so far not been studied extensively in Computational Literary Studies. In this paper, we focus on one of the elements authors can use to build up suspense: dangerous situations. We introduce a corpus of texts annotated with dangerous situations, distinguishing between 7 types of danger. Additionally, we annotate parts of the text that describe fear experienced by a character, regardless of the actual presence of danger. We present experiments towards the automatic detection of these situations, finding that unsupervised baseline methods can provide valuable signals for the detection, but more complex methods are necessary for further analysis. Not unexpectedly, the description of danger and fear often relies heavily on the context, both local (e.g., situations where danger is only mentioned, but not actually present) and global (e.g., \"storm\" being used in a literal sense in ",
    "path": "papers/23/05/2305.06818.json",
    "total_tokens": 946,
    "translated_title": "探索悬疑的计算机分析：检测危险情境",
    "translated_abstract": "悬疑是保持读者参与并想继续阅读的重要工具。然而，计算机文学研究领域对此尚未深入研究。本文着重探讨作者可以利用来增加悬疑的元素之一：危险情境。我们引入了一个文本语料库，其中标注了危险情境，分辨了7种类型的危险。此外，我们还标注了文本中描述角色所经历的恐惧的部分，不管实际上存在危险与否。我们进行了自动检测这些情境的实验，并发现无监督的基础方法可以提供有价值的信号，但进一步分析需要更复杂的方法。不出所料，危险和恐惧的描述在很大程度上依赖于上下文，无论是局部的(例如，只提到但实际上并不存在危险的情境)还是全局的(例如，“风暴”在字面上使用的情境)。",
    "tldr": "本文引入一个文本语料库，其中标注了危险情境及角色的恐惧，通过实验发现无监督的基础方法可以提供有价值的信号来检测这些情境，但要进一步深入分析需要更复杂的方法，因为危险和恐惧的描述在很大程度上依赖于上下文。",
    "en_tdlr": "This paper introduces a corpus of texts annotated with dangerous situations and fear, and presents experiments towards automatic detection of these situations. Unsupervised baseline methods provide valuable signals, but further analysis requires more complex methods due to the heavy reliance on contextual cues for describing danger and fear."
}