{
    "title": "Type-enhanced Ensemble Triple Representation via Triple-aware Attention for Cross-lingual Entity Alignment. (arXiv:2305.01556v1 [cs.CL])",
    "abstract": "Entity alignment(EA) is a crucial task for integrating cross-lingual and cross-domain knowledge graphs(KGs), which aims to discover entities referring to the same real-world object from different KGs. Most existing methods generate aligning entity representation by mining the relevance of triple elements via embedding-based methods, paying little attention to triple indivisibility and entity role diversity. In this paper, a novel framework named TTEA -- Type-enhanced Ensemble Triple Representation via Triple-aware Attention for Cross-lingual Entity Alignment is proposed to overcome the above issues considering ensemble triple specificity and entity role features. Specifically, the ensemble triple representation is derived by regarding relation as information carrier between semantic space and type space, and hence the noise influence during spatial transformation and information propagation can be smoothly controlled via specificity-aware triple attention. Moreover, our framework uses ",
    "link": "http://arxiv.org/abs/2305.01556",
    "context": "Title: Type-enhanced Ensemble Triple Representation via Triple-aware Attention for Cross-lingual Entity Alignment. (arXiv:2305.01556v1 [cs.CL])\nAbstract: Entity alignment(EA) is a crucial task for integrating cross-lingual and cross-domain knowledge graphs(KGs), which aims to discover entities referring to the same real-world object from different KGs. Most existing methods generate aligning entity representation by mining the relevance of triple elements via embedding-based methods, paying little attention to triple indivisibility and entity role diversity. In this paper, a novel framework named TTEA -- Type-enhanced Ensemble Triple Representation via Triple-aware Attention for Cross-lingual Entity Alignment is proposed to overcome the above issues considering ensemble triple specificity and entity role features. Specifically, the ensemble triple representation is derived by regarding relation as information carrier between semantic space and type space, and hence the noise influence during spatial transformation and information propagation can be smoothly controlled via specificity-aware triple attention. Moreover, our framework uses ",
    "path": "papers/23/05/2305.01556.json",
    "total_tokens": 873,
    "translated_title": "借助三元组感知注意力的增强型三元组集成表示方法，用于跨语言实体对齐",
    "translated_abstract": "实体对齐是将跨语言和跨领域的知识图谱中指向同一实际对象的实体进行发现的关键任务。目前大多数现有的方法是通过基于嵌入的方法挖掘三元组元素的相关性来生成对齐实体表示，很少关注三元组的不可分性和实体角色的多样性。本文提出了一种新颖的框架TTEA（类型增强的三元组集成表示），通过考虑集成三元组的具体性和实体角色特征来克服上述问题。具体而言，通过将关系作为信息载体在语义空间和类型空间之间进行转换，从而可以通过具体性感知的三元组注意力平稳地控制空间转换和信息传播过程中的噪声影响。此外，我们的框架使用了...",
    "tldr": "提出了一种新的跨语言实体对齐框架TTEA，该框架考虑了三元组特征和实体角色多样性，利用三元组感知注意力构建增强型三元组集成表示，通过具体性感知控制了信息传播过程中的噪声影响。",
    "en_tdlr": "A novel framework named TTEA is proposed for cross-lingual entity alignment, which takes into consideration triple characteristics and entity role diversity, uses triple-aware attention to construct enhanced triple representation, and controls noise influence during information propagation through specificity-aware triple attention."
}