{
    "title": "Deformation of Marchenko-Pastur distribution for the correlated time series. (arXiv:2305.12632v1 [cond-mat.stat-mech])",
    "abstract": "We study the eigenvalue of the Wishart matrix which is created form the time series with the temporal correlation. When there is no correlation, the eigenvalue distribution of the Wishart matrix is known as the Marchenko-Pastur distribution (MPD) in the double scaling limit. When there is the temporal correlation, the eigenvalue distribution converges to the deformed MPD which has longer tail and higher peak than the MPD. We discuss the moments of the distribution and the convergence to the deformed MPD. We show the second moment increases as the temporal correlation increases. When the temporal correlation is the power decay, we can confirm the phase transition. When $\\gamma>1/2$ which is the power index, the second moment of the distribution is finite and the largest eigenvalue is finite. On the other hand, when $\\gamma\\leq 1/2$, the second moment is infinite and the maximum eigenvalue is infinite.",
    "link": "http://arxiv.org/abs/2305.12632",
    "context": "Title: Deformation of Marchenko-Pastur distribution for the correlated time series. (arXiv:2305.12632v1 [cond-mat.stat-mech])\nAbstract: We study the eigenvalue of the Wishart matrix which is created form the time series with the temporal correlation. When there is no correlation, the eigenvalue distribution of the Wishart matrix is known as the Marchenko-Pastur distribution (MPD) in the double scaling limit. When there is the temporal correlation, the eigenvalue distribution converges to the deformed MPD which has longer tail and higher peak than the MPD. We discuss the moments of the distribution and the convergence to the deformed MPD. We show the second moment increases as the temporal correlation increases. When the temporal correlation is the power decay, we can confirm the phase transition. When $\\gamma>1/2$ which is the power index, the second moment of the distribution is finite and the largest eigenvalue is finite. On the other hand, when $\\gamma\\leq 1/2$, the second moment is infinite and the maximum eigenvalue is infinite.",
    "path": "papers/23/05/2305.12632.json",
    "total_tokens": 1029,
    "translated_title": "相关时间序列的Marchenko-Pastur分布的变形",
    "translated_abstract": "我们研究了由具有时间相关性的时间序列创建的Wishart矩阵的特征值。当没有相关性时，Wishart矩阵的特征值分布在双重标度极限下被称为Marchenko-Pastur分布（MPD）。当存在时间相关性时，特征值分布收敛到具有比MPD更长尾和更高峰的变形MPD。我们讨论了分布的矩和收敛到变形MPD的情况。我们展示了第二矩随时间相关性增加而增加。当时间相关性是幂衰减时，我们可以确认相变。当幂指数为$\\gamma>1/2$时，分布的第二矩是有限的，并且最大特征值是有限的。另一方面，当$\\gamma\\leq 1/2$时，第二矩是无限的，最大特征值是无限的。",
    "tldr": "研究了具有时间相关性的时间序列的Wishart矩阵特征值分布。发现其在双重标度极限下收敛于变形的MPD分布，具有比MPD更长的尾部和更高的峰值，并证明随时间相关性增加，其二阶矩亦随之增加。当时间相关性为幂衰减时，分布存在相变，当幂指数为$\\gamma>1/2$时，分布的第二矩和最大特征值均为有限值；而当$\\gamma\\leq 1/2$时，分布的第二矩和最大特征值均为无限。",
    "en_tdlr": "Explored the eigenvalue distribution of Wishart matrix generated from correlated time series and found that it converges to a deformed Marchenko-Pastur distribution with longer tail and higher peak. It was observed that the second moment of the distribution increases with temporal correlation and a phase transition exists for power decaying correlation. The second moment and maximum eigenvalue are finite for $\\gamma>1/2$ and infinite for $\\gamma\\leq 1/2$."
}