{
    "title": "New Adversarial Image Detection Based on Sentiment Analysis. (arXiv:2305.03173v1 [cs.CR])",
    "abstract": "Deep Neural Networks (DNNs) are vulnerable to adversarial examples, while adversarial attack models, e.g., DeepFool, are on the rise and outrunning adversarial example detection techniques. This paper presents a new adversarial example detector that outperforms state-of-the-art detectors in identifying the latest adversarial attacks on image datasets. Specifically, we propose to use sentiment analysis for adversarial example detection, qualified by the progressively manifesting impact of an adversarial perturbation on the hidden-layer feature maps of a DNN under attack. Accordingly, we design a modularized embedding layer with the minimum learnable parameters to embed the hidden-layer feature maps into word vectors and assemble sentences ready for sentiment analysis. Extensive experiments demonstrate that the new detector consistently surpasses the state-of-the-art detection algorithms in detecting the latest attacks launched against ResNet and Inception neutral networks on the CIFAR-1",
    "link": "http://arxiv.org/abs/2305.03173",
    "context": "Title: New Adversarial Image Detection Based on Sentiment Analysis. (arXiv:2305.03173v1 [cs.CR])\nAbstract: Deep Neural Networks (DNNs) are vulnerable to adversarial examples, while adversarial attack models, e.g., DeepFool, are on the rise and outrunning adversarial example detection techniques. This paper presents a new adversarial example detector that outperforms state-of-the-art detectors in identifying the latest adversarial attacks on image datasets. Specifically, we propose to use sentiment analysis for adversarial example detection, qualified by the progressively manifesting impact of an adversarial perturbation on the hidden-layer feature maps of a DNN under attack. Accordingly, we design a modularized embedding layer with the minimum learnable parameters to embed the hidden-layer feature maps into word vectors and assemble sentences ready for sentiment analysis. Extensive experiments demonstrate that the new detector consistently surpasses the state-of-the-art detection algorithms in detecting the latest attacks launched against ResNet and Inception neutral networks on the CIFAR-1",
    "path": "papers/23/05/2305.03173.json",
    "total_tokens": 962,
    "translated_title": "基于情感分析的新型对抗性图像检测方法",
    "translated_abstract": "深度神经网络（DNN）易受到对抗样本的攻击，而对抗攻击模型（例如DeepFool）正在崛起并超越对抗性样本检测技术。本文提出了一种新的对抗性样本检测器，可在识别图像数据集上的最新对抗性攻击方面超越现有技术。具体而言，我们提出使用情感分析来检测对抗性样本，这是通过检测对神经网络的隐藏层特征图造成的影响逐渐显现来实现的。因此，我们设计一个具有最少可学习参数的模块化嵌入层，将隐藏层特征映射到词向量中，组成可以进行情感分析的句子。大量实验表明，这种新型检测器在检测针对CIFAR-10、SVHN和ImageNet数据集上的ResNet和Inception中性网络发起的最新攻击方面均能一致超越最先进的检测算法。",
    "tldr": "本文提出了一种新的对抗性样本检测器，通过使用情感分析并检测对神经网络的隐藏层特征图造成的影响逐渐显现来检测对抗性样本，克服了现有技术的局限，且实验结果表明其在识别最新的对抗性攻击方面优于现有技术。",
    "en_tdlr": "This paper proposes a new adversarial example detector that overcomes the limitations of existing techniques by using sentiment analysis and detecting the gradually manifesting impact of an adversarial perturbation on the hidden-layer feature maps of a DNN under attack, and extensive experiments show that it outperforms state-of-the-art detectors in identifying the latest adversarial attacks."
}