{
    "title": "Learning Terrain-Aware Kinodynamic Model for Autonomous Off-Road Rally Driving With Model Predictive Path Integral Control. (arXiv:2305.00676v1 [cs.RO])",
    "abstract": "High-speed autonomous driving in off-road environments has immense potential for various applications, but it also presents challenges due to the complexity of vehicle-terrain interactions. In such environments, it is crucial for the vehicle to predict its motion and adjust its controls proactively in response to environmental changes, such as variations in terrain elevation. To this end, we propose a method for learning terrain-aware kinodynamic model which is conditioned on both proprioceptive and exteroceptive information. The proposed model generates reliable predictions of 6-degree-of-freedom motion and can even estimate contact interactions without requiring ground truth force data during training. This enables the design of a safe and robust model predictive controller through appropriate cost function design which penalizes sampled trajectories with unstable motion, unsafe interactions, and high levels of uncertainty derived from the model. We demonstrate the effectiveness of o",
    "link": "http://arxiv.org/abs/2305.00676",
    "context": "Title: Learning Terrain-Aware Kinodynamic Model for Autonomous Off-Road Rally Driving With Model Predictive Path Integral Control. (arXiv:2305.00676v1 [cs.RO])\nAbstract: High-speed autonomous driving in off-road environments has immense potential for various applications, but it also presents challenges due to the complexity of vehicle-terrain interactions. In such environments, it is crucial for the vehicle to predict its motion and adjust its controls proactively in response to environmental changes, such as variations in terrain elevation. To this end, we propose a method for learning terrain-aware kinodynamic model which is conditioned on both proprioceptive and exteroceptive information. The proposed model generates reliable predictions of 6-degree-of-freedom motion and can even estimate contact interactions without requiring ground truth force data during training. This enables the design of a safe and robust model predictive controller through appropriate cost function design which penalizes sampled trajectories with unstable motion, unsafe interactions, and high levels of uncertainty derived from the model. We demonstrate the effectiveness of o",
    "path": "papers/23/05/2305.00676.json",
    "total_tokens": 914,
    "translated_title": "面向自主越野拉力赛的地形感知运动学模型学习与预测控制法研究",
    "translated_abstract": "在越野环境下进行高速自主驾驶具有广泛的应用前景，但由于车辆与地形交互的复杂性，也存在一定的挑战。因此，在这种环境下，车辆预测自身运动并根据环境变化，例如地形高差的变化，主动调整其控制至关重要。针对这一问题，我们提出了一种方法来学习地形感知的运动学模型，该模型以本体感知和外部感知信息为条件。该模型可生成可靠的 6 自由度运动预测，并可在无需训练时基于机器学习进行接触力估计。该模型通过适当的代价函数设计可以生成安全且鲁棒的模型预测控制器，惩罚具有不稳定运动、不安全交互和高不确定性衍生的样本轨迹。我们证明了该方法的有效性。",
    "tldr": "本研究提出了一种地形感知的运动学模型学习与预测控制法，可以生成可靠的 6 自由度运动预测，并可在无需训练时基于机器学习进行接触力估计，实现了对复杂越野场地的安全与鲁棒自主驾驶控制。"
}