{
    "title": "Physics-driven machine learning for the prediction of coronal mass ejections' travel times. (arXiv:2305.10057v1 [astro-ph.SR])",
    "abstract": "Coronal Mass Ejections (CMEs) correspond to dramatic expulsions of plasma and magnetic field from the solar corona into the heliosphere. CMEs are scientifically relevant because they are involved in the physical mechanisms characterizing the active Sun. However, more recently CMEs have attracted attention for their impact on space weather, as they are correlated to geomagnetic storms and may induce the generation of Solar Energetic Particles streams. In this space weather framework, the present paper introduces a physics-driven artificial intelligence (AI) approach to the prediction of CMEs travel time, in which the deterministic drag-based model is exploited to improve the training phase of a cascade of two neural networks fed with both remote sensing and in-situ data. This study shows that the use of physical information in the AI architecture significantly improves both the accuracy and the robustness of the travel time prediction.",
    "link": "http://arxiv.org/abs/2305.10057",
    "context": "Title: Physics-driven machine learning for the prediction of coronal mass ejections' travel times. (arXiv:2305.10057v1 [astro-ph.SR])\nAbstract: Coronal Mass Ejections (CMEs) correspond to dramatic expulsions of plasma and magnetic field from the solar corona into the heliosphere. CMEs are scientifically relevant because they are involved in the physical mechanisms characterizing the active Sun. However, more recently CMEs have attracted attention for their impact on space weather, as they are correlated to geomagnetic storms and may induce the generation of Solar Energetic Particles streams. In this space weather framework, the present paper introduces a physics-driven artificial intelligence (AI) approach to the prediction of CMEs travel time, in which the deterministic drag-based model is exploited to improve the training phase of a cascade of two neural networks fed with both remote sensing and in-situ data. This study shows that the use of physical information in the AI architecture significantly improves both the accuracy and the robustness of the travel time prediction.",
    "path": "papers/23/05/2305.10057.json",
    "total_tokens": 928,
    "translated_title": "物理驱动的机器学习在日冕物质抛射旅行时间预测中的应用",
    "translated_abstract": "日冕物质抛射（CMEs）是指从太阳冕层中将等离子体和磁场剧烈地抛射到太阳系中的过程。CMEs在科学上具有重要性，因为它们参与了表征活跃太阳的物理机制。然而，近年来，CMEs因其对空间天气的影响而受到关注，因为它们与地磁风暴相关并且可能引发太阳高能粒子流的产生。在这个空间天气框架下，本文介绍了一种基于物理驱动的人工智能（AI）方法来预测CMEs旅行时间，其中利用确定性拖拽模型来改善级联两个神经网络的训练阶段，以供远程监测和现场数据。这项研究表明，在AI架构中利用物理信息显着提高了旅行时间预测的准确性和稳健性。",
    "tldr": "该论文介绍了物理驱动的人工智能方法用于日冕物质抛射旅行时间预测，使用了确定性拖拽模型和两个神经网络，利用远程监测和现场数据，显着提高了预测的准确性和稳健性。"
}