{
    "title": "Hierarchical DCC-HEAVY Model for High-Dimensional Covariance Matrices. (arXiv:2305.08488v1 [econ.EM])",
    "abstract": "We introduce a new HD DCC-HEAVY class of hierarchical-type factor models for conditional covariance matrices of high-dimensional returns, employing the corresponding realized measures built from higher-frequency data. The modelling approach features sophisticated asymmetric dynamics in covariances coupled with straightforward estimation and forecasting schemes, independent of the cross-sectional dimension of the assets under consideration. Empirical analyses suggest the HD DCC-HEAVY models have a better in-sample fit, and deliver statistically and economically significant out-of-sample gains relative to the standard benchmarks and existing hierarchical factor models. The results are robust under different market conditions.",
    "link": "http://arxiv.org/abs/2305.08488",
    "context": "Title: Hierarchical DCC-HEAVY Model for High-Dimensional Covariance Matrices. (arXiv:2305.08488v1 [econ.EM])\nAbstract: We introduce a new HD DCC-HEAVY class of hierarchical-type factor models for conditional covariance matrices of high-dimensional returns, employing the corresponding realized measures built from higher-frequency data. The modelling approach features sophisticated asymmetric dynamics in covariances coupled with straightforward estimation and forecasting schemes, independent of the cross-sectional dimension of the assets under consideration. Empirical analyses suggest the HD DCC-HEAVY models have a better in-sample fit, and deliver statistically and economically significant out-of-sample gains relative to the standard benchmarks and existing hierarchical factor models. The results are robust under different market conditions.",
    "path": "papers/23/05/2305.08488.json",
    "total_tokens": 855,
    "translated_title": "高维协方差矩阵的分层DCC-HEAVY模型",
    "translated_abstract": "我们引入了一种新的HD DCC-HEAVY类层次因子模型，用于高维收益的条件协方差矩阵，采用相应的来自更高频数据的实现度量。该建模方法具有复杂的协方差非对称动力学以及简单的估计和预测方案，独立于所考虑的资产的横截面维度。实证分析表明，HD DCC-HEAVY模型具有更好的内样拟合，并相对于标准基准和现有的层次因子模型提供了统计和经济意义上显著的外样增益。在不同市场条件下，结果是稳健的。",
    "tldr": "本文提出了一种新的HD DCC-HEAVY类层次因子模型，用于高维收益的条件协方差矩阵，具有复杂的协方差非对称动力学并独立于资产的横截面维度。实证结果显示该模型相较于标准基准和已有的层次因子模型具有更好的内样拟合和统计经济意义上显著的外样增益。",
    "en_tdlr": "This paper introduces a new HD DCC-HEAVY class of hierarchical-type factor models for conditional covariance matrices of high-dimensional returns, featuring sophisticated asymmetric dynamics in covariances and straightforward estimation and forecasting schemes, independent of the cross-sectional dimension of the assets under consideration. Empirical analyses demonstrate the model's superiority in both in-sample fit and out-of-sample gains compared to standard benchmarks and existing hierarchical factor models, regardless of different market conditions."
}