{
    "title": "Actively Discovering New Slots for Task-oriented Conversation. (arXiv:2305.04049v1 [cs.CL])",
    "abstract": "Existing task-oriented conversational search systems heavily rely on domain ontologies with pre-defined slots and candidate value sets. In practical applications, these prerequisites are hard to meet, due to the emerging new user requirements and ever-changing scenarios. To mitigate these issues for better interaction performance, there are efforts working towards detecting out-of-vocabulary values or discovering new slots under unsupervised or semi-supervised learning paradigm. However, overemphasizing on the conversation data patterns alone induces these methods to yield noisy and arbitrary slot results. To facilitate the pragmatic utility, real-world systems tend to provide a stringent amount of human labelling quota, which offers an authoritative way to obtain accurate and meaningful slot assignments. Nonetheless, it also brings forward the high requirement of utilizing such quota efficiently. Hence, we formulate a general new slot discovery task in an information extraction fashio",
    "link": "http://arxiv.org/abs/2305.04049",
    "context": "Title: Actively Discovering New Slots for Task-oriented Conversation. (arXiv:2305.04049v1 [cs.CL])\nAbstract: Existing task-oriented conversational search systems heavily rely on domain ontologies with pre-defined slots and candidate value sets. In practical applications, these prerequisites are hard to meet, due to the emerging new user requirements and ever-changing scenarios. To mitigate these issues for better interaction performance, there are efforts working towards detecting out-of-vocabulary values or discovering new slots under unsupervised or semi-supervised learning paradigm. However, overemphasizing on the conversation data patterns alone induces these methods to yield noisy and arbitrary slot results. To facilitate the pragmatic utility, real-world systems tend to provide a stringent amount of human labelling quota, which offers an authoritative way to obtain accurate and meaningful slot assignments. Nonetheless, it also brings forward the high requirement of utilizing such quota efficiently. Hence, we formulate a general new slot discovery task in an information extraction fashio",
    "path": "papers/23/05/2305.04049.json",
    "total_tokens": 918,
    "translated_title": "主动发现面向任务对话的新槽位",
    "translated_abstract": "现有的面向任务的对话搜索系统严重依赖于具有预定义插槽和候选值集的领域本体论。在实际应用中，由于新的用户需求和不断变化的场景，这些先决条件很难满足。为了缓解这些问题，以获得更好的交互性能，一些工作致力于在无监督或半监督学习范式下检测词汇表外的值或发现新的插槽位置。然而，仅仅过分强调对话数据模式会导致这些方法产生嘈杂和任意的插槽结果。为了促进实际应用，现实世界的系统 tend to 提供严格的人工标注配额，这提供了一种权威的方式来获得准确和有意义的插槽分配。然而，这也提出了高要求，即高效利用这种配额。因此，我们以信息提取的方式形成一个通用的新插槽发现任务。",
    "tldr": "该论文探讨了如何主动发现面向任务对话的新槽位，以提高交互性能。由于实际应用中新的用户需求和不断变化的场景，使现有的对话搜索系统变得无法满足。其提出了一种通用的新插槽发现任务，通过信息提取的方式进行。"
}