{
    "title": "Limited Resource Allocation in a Non-Markovian World: The Case of Maternal and Child Healthcare. (arXiv:2305.12640v1 [cs.AI])",
    "abstract": "The success of many healthcare programs depends on participants' adherence. We consider the problem of scheduling interventions in low resource settings (e.g., placing timely support calls from health workers) to increase adherence and/or engagement. Past works have successfully developed several classes of Restless Multi-armed Bandit (RMAB) based solutions for this problem. Nevertheless, all past RMAB approaches assume that the participants' behaviour follows the Markov property. We demonstrate significant deviations from the Markov assumption on real-world data on a maternal health awareness program from our partner NGO, ARMMAN. Moreover, we extend RMABs to continuous state spaces, a previously understudied area. To tackle the generalised non-Markovian RMAB setting we (i) model each participant's trajectory as a time-series, (ii) leverage the power of time-series forecasting models to learn complex patterns and dynamics to predict future states, and (iii) propose the Time-series Arm ",
    "link": "http://arxiv.org/abs/2305.12640",
    "context": "Title: Limited Resource Allocation in a Non-Markovian World: The Case of Maternal and Child Healthcare. (arXiv:2305.12640v1 [cs.AI])\nAbstract: The success of many healthcare programs depends on participants' adherence. We consider the problem of scheduling interventions in low resource settings (e.g., placing timely support calls from health workers) to increase adherence and/or engagement. Past works have successfully developed several classes of Restless Multi-armed Bandit (RMAB) based solutions for this problem. Nevertheless, all past RMAB approaches assume that the participants' behaviour follows the Markov property. We demonstrate significant deviations from the Markov assumption on real-world data on a maternal health awareness program from our partner NGO, ARMMAN. Moreover, we extend RMABs to continuous state spaces, a previously understudied area. To tackle the generalised non-Markovian RMAB setting we (i) model each participant's trajectory as a time-series, (ii) leverage the power of time-series forecasting models to learn complex patterns and dynamics to predict future states, and (iii) propose the Time-series Arm ",
    "path": "papers/23/05/2305.12640.json",
    "total_tokens": 1099,
    "translated_title": "非Markovian世界中的有限资源分配：母婴保健的情况",
    "translated_abstract": "许多医疗保健计划的成功取决于参与者的依从性。我们考虑在资源有限的情况下（例如，从卫生工作者处及时获得支持电话），安排干预措施以增加依从性和/或参与度的问题。过去的研究已经成功地为这个问题开发了几类基于不安定多臂老虎机（RMAB）的解决方案。然而，所有过去的RMAB方法都假设参与者的行为遵循Markov属性。我们展示了来自我们合作NGO ARMMAN的孕妇健康意识计划的真实数据对Markov假设存在显着偏差。此外，我们将RMAB扩展到连续状态空间，这是以前不受重视的领域。为了解决广义的非Markovian RMAB设置，我们（i）将每个参与者轨迹建模为时间序列，（ii）利用时间序列预测模型学习复杂的模式和动态来预测未来状态，（iii）提出Time-series Arm Bandit（TSAB）算法，这是一种新颖的方法，通过捕获过去和未来状态之间的依赖关系来适应非Markovian设置。我们的实验表明，TSAB优于以前的方法，并实现更好的资源分配。",
    "tldr": "研究中提出了一种新颖的算法TSAB，通过建模参与者的轨迹为时间序列，并结合时间序列预测模型来预测未来状态，以适应非Markovian设置。该算法在提高数据依从性和/或参与度的资源分配方面优于过去的方法。",
    "en_tdlr": "The study proposes a novel algorithm TSAB that adapts to the non-Markovian setting by modeling the trajectory of each participant as a time-series, leveraging time-series forecasting models to predict future states, and capturing dependencies between past and future states, outperforming past RMAB approaches in resource allocation for improving adherence and/or engagement in healthcare programs."
}