{
    "title": "Real-Time Variational Method for Learning Neural Trajectory and its Dynamics. (arXiv:2305.11278v1 [stat.ML])",
    "abstract": "Latent variable models have become instrumental in computational neuroscience for reasoning about neural computation. This has fostered the development of powerful offline algorithms for extracting latent neural trajectories from neural recordings. However, despite the potential of real time alternatives to give immediate feedback to experimentalists, and enhance experimental design, they have received markedly less attention. In this work, we introduce the exponential family variational Kalman filter (eVKF), an online recursive Bayesian method aimed at inferring latent trajectories while simultaneously learning the dynamical system generating them. eVKF works for arbitrary likelihoods and utilizes the constant base measure exponential family to model the latent state stochasticity. We derive a closed-form variational analogue to the predict step of the Kalman filter which leads to a provably tighter bound on the ELBO compared to another online variational method. We validate our metho",
    "link": "http://arxiv.org/abs/2305.11278",
    "context": "Title: Real-Time Variational Method for Learning Neural Trajectory and its Dynamics. (arXiv:2305.11278v1 [stat.ML])\nAbstract: Latent variable models have become instrumental in computational neuroscience for reasoning about neural computation. This has fostered the development of powerful offline algorithms for extracting latent neural trajectories from neural recordings. However, despite the potential of real time alternatives to give immediate feedback to experimentalists, and enhance experimental design, they have received markedly less attention. In this work, we introduce the exponential family variational Kalman filter (eVKF), an online recursive Bayesian method aimed at inferring latent trajectories while simultaneously learning the dynamical system generating them. eVKF works for arbitrary likelihoods and utilizes the constant base measure exponential family to model the latent state stochasticity. We derive a closed-form variational analogue to the predict step of the Kalman filter which leads to a provably tighter bound on the ELBO compared to another online variational method. We validate our metho",
    "path": "papers/23/05/2305.11278.json",
    "total_tokens": 926,
    "translated_title": "实时变分方法学习神经轨迹及其动力学",
    "translated_abstract": "潜变量模型在计算神经科学中已成为推理神经计算的重要工具。这促进了从神经记录中提取潜在神经轨迹的强大离线算法的发展。然而，尽管实时替代方案能够为实验者立即提供反馈并增强实验设计能力，但它们得到的关注要少得多。在本研究中，我们介绍了指数族变分卡尔曼滤波器（eVKF），这是一种在线递归贝叶斯方法，旨在推断潜在轨迹同时学习产生它们的动力系统。eVKF适用于任意似然，并利用常数基本测度指数族来模拟潜在状态的随机性。我们得出了卡尔曼滤波器预测步骤的闭式变分类比，它比另一种在线变分方法产生了可证明更紧的ELBO界限。我们在合成数据上验证了我们的方法，并展示了它在跟踪神经元中钙成像数据的动态方面的有效性。",
    "tldr": "本论文介绍了一种实时的递归贝叶斯方法用于推断神经轨迹及其动力学，能够广泛适用于任意似然，同时有效跟踪神经元中钙成像数据的动态。",
    "en_tdlr": "This paper introduces a real-time recursive Bayesian method for inferring neural trajectories and their dynamics, which can be widely applicable to arbitrary likelihoods and effectively track the dynamics of calcium imaging data in neurons."
}