{
    "title": "Proof-of-work consensus by quantum sampling. (arXiv:2305.19865v1 [quant-ph])",
    "abstract": "Since its advent in 2011, boson-sampling has been a preferred candidate for demonstrating quantum advantage because of its simplicity and near-term requirements compared to other quantum algorithms. We propose to use a variant, called coarse-grained boson-sampling (CGBS), as a quantum Proof-of-Work (PoW) scheme for blockchain consensus. The users perform boson-sampling using input states that depend on the current block information, and commit their samples to the network. Afterward, CGBS strategies are determined which can be used to both validate samples and to reward successful miners. By combining rewards to miners committing honest samples together with penalties to miners committing dishonest samples, a Nash equilibrium is found that incentivizes honest nodes. The scheme works for both Fock state boson sampling and Gaussian boson sampling and provides dramatic speedup and energy savings relative to computation by classical hardware.",
    "link": "http://arxiv.org/abs/2305.19865",
    "context": "Title: Proof-of-work consensus by quantum sampling. (arXiv:2305.19865v1 [quant-ph])\nAbstract: Since its advent in 2011, boson-sampling has been a preferred candidate for demonstrating quantum advantage because of its simplicity and near-term requirements compared to other quantum algorithms. We propose to use a variant, called coarse-grained boson-sampling (CGBS), as a quantum Proof-of-Work (PoW) scheme for blockchain consensus. The users perform boson-sampling using input states that depend on the current block information, and commit their samples to the network. Afterward, CGBS strategies are determined which can be used to both validate samples and to reward successful miners. By combining rewards to miners committing honest samples together with penalties to miners committing dishonest samples, a Nash equilibrium is found that incentivizes honest nodes. The scheme works for both Fock state boson sampling and Gaussian boson sampling and provides dramatic speedup and energy savings relative to computation by classical hardware.",
    "path": "papers/23/05/2305.19865.json",
    "total_tokens": 854,
    "translated_title": "量子取样的工作量证明共识机制",
    "translated_abstract": "自其2011年出现以来，波色子取样因其相对于其他量子算法的简单性和近期要求而成为展示量子优势的优选候选。本文提出将一种变种——粗粒度波色子取样(CGBS)——作为区块链共识的量子工作量证明(PoW)机制。用户使用依赖于当前块信息的输入状态进行波色子取样，并将其提交到网络中。然后确定可用于验证样本和奖励成功矿工的CGBS策略。通过将向提交诚实样本的矿工提供奖励并对提交不诚实样本的矿工进行惩罚的组合，找到了一个激励诚实节点的纳什均衡。该方案适用于Fock态波色子取样和高斯波色子取样，并相对于使用经典硬件进行计算提供了巨大的加速和节能效益。",
    "tldr": "本文提出了一种基于量子取样的工作量证明共识机制(CGBS-PoW)，采用Fock态和高斯波色子取样，具有巨大的加速和节能效益。",
    "en_tdlr": "This paper proposes a quantum Proof-of-Work (PoW) scheme for blockchain consensus based on coarse-grained boson-sampling (CGBS), using both Fock state and Gaussian boson sampling. The scheme offers dramatic speedup and energy savings compared to classical hardware."
}