{
    "title": "Don't Trust, Verify: Towards a Framework for the Greening of Bitcoin. (arXiv:2305.01815v1 [econ.GN])",
    "abstract": "For more than a decade, Bitcoin has gained as much adoption as it has received criticism. Fundamentally, Bitcoin is under fire for the high carbon footprint that results from the energy-intensive proof-of-work (PoW) consensus algorithm. There is a trend however for Bitcoin mining to adopt a trajectory toward achieving carbon-negative status, notably due to the adoption of methane-based mining and mining-based flexible load response (FLR) to complement variable renewable energy (VRE) generation. Miners and electricity sellers may increase their profitability not only by taking advantage of excess energy, but also by selling green tokens to buyers interested in greening their portfolios. Nevertheless, a proper ''green Bitcoin'' accounting system requires a standard framework for the accreditation of sustainable bitcoin holdings. The proper way to build such a framework remains contested. In this paper, we survey the different sustainable Bitcoin accounting systems. Analyzing the various ",
    "link": "http://arxiv.org/abs/2305.01815",
    "context": "Title: Don't Trust, Verify: Towards a Framework for the Greening of Bitcoin. (arXiv:2305.01815v1 [econ.GN])\nAbstract: For more than a decade, Bitcoin has gained as much adoption as it has received criticism. Fundamentally, Bitcoin is under fire for the high carbon footprint that results from the energy-intensive proof-of-work (PoW) consensus algorithm. There is a trend however for Bitcoin mining to adopt a trajectory toward achieving carbon-negative status, notably due to the adoption of methane-based mining and mining-based flexible load response (FLR) to complement variable renewable energy (VRE) generation. Miners and electricity sellers may increase their profitability not only by taking advantage of excess energy, but also by selling green tokens to buyers interested in greening their portfolios. Nevertheless, a proper ''green Bitcoin'' accounting system requires a standard framework for the accreditation of sustainable bitcoin holdings. The proper way to build such a framework remains contested. In this paper, we survey the different sustainable Bitcoin accounting systems. Analyzing the various ",
    "path": "papers/23/05/2305.01815.json",
    "total_tokens": 981,
    "translated_title": "不要信任，要验证：迈向比特币绿色化框架",
    "translated_abstract": "在过去的十多年中，比特币既得到了越来越多的认可，也受到了很多批评。基本上，比特币因其高能耗的工作量证明（PoW）共识算法所导致的高碳排放量而备受争议。然而，有一个趋势是，比特币挖掘正朝着实现碳负担的方向发展，这主要是由于采用了基于甲烷的挖掘和支持可变可再生能源（VRE）发电的挖掘灵活负荷响应（FLR）。矿工和电力销售商不仅可以利用过剩能源来增加他们的盈利能力，还可以向那些有兴趣绿化自己投资组合的买家出售绿色代币。然而，一个合适的“绿色比特币”会计系统需要一个可持续比特币持有的认证标准框架。建立这样的框架的正确方法仍有争议。本文调查了不同的可持续比特币会计系统，分析了它们的优缺点及其挑战。",
    "tldr": "随着比特币的发展，它面临着高碳排放的问题，而目前有很多可持续比特币会计系统，但缺乏一个统一标准认证标准。本文提出了一个可行的解决方案，并详细分析了不同系统的优缺点和挑战。",
    "en_tdlr": "Bitcoin is under criticism for its high carbon footprint due to the energy-intensive proof-of-work consensus algorithm, but there is a trend towards achieving carbon-negative status. The paper surveys different sustainable Bitcoin accounting systems, analyzes their advantages, disadvantages, and challenges, and proposes a feasible solution for a unified accreditation standard."
}