{
    "title": "Time-Varying Vector Error-Correction Models: Estimation and Inference. (arXiv:2305.17829v1 [econ.EM])",
    "abstract": "This paper considers a time-varying vector error-correction model that allows for different time series behaviours (e.g., unit-root and locally stationary processes) to interact with each other to co-exist. From practical perspectives, this framework can be used to estimate shifts in the predictability of non-stationary variables, test whether economic theories hold periodically, etc. We first develop a time-varying Granger Representation Theorem, which facilitates the establishment of asymptotic properties for the model, and then propose estimation and inferential methods and theory for both short-run and long-run coefficients. We also propose an information criterion to estimate the lag length, a singular-value ratio test to determine the cointegration rank, and a hypothesis test to examine the parameter stability. To validate the theoretical findings, we conduct extensive simulations. Finally, we demonstrate the empirical relevance by applying the framework to investigate the ration",
    "link": "http://arxiv.org/abs/2305.17829",
    "context": "Title: Time-Varying Vector Error-Correction Models: Estimation and Inference. (arXiv:2305.17829v1 [econ.EM])\nAbstract: This paper considers a time-varying vector error-correction model that allows for different time series behaviours (e.g., unit-root and locally stationary processes) to interact with each other to co-exist. From practical perspectives, this framework can be used to estimate shifts in the predictability of non-stationary variables, test whether economic theories hold periodically, etc. We first develop a time-varying Granger Representation Theorem, which facilitates the establishment of asymptotic properties for the model, and then propose estimation and inferential methods and theory for both short-run and long-run coefficients. We also propose an information criterion to estimate the lag length, a singular-value ratio test to determine the cointegration rank, and a hypothesis test to examine the parameter stability. To validate the theoretical findings, we conduct extensive simulations. Finally, we demonstrate the empirical relevance by applying the framework to investigate the ration",
    "path": "papers/23/05/2305.17829.json",
    "total_tokens": 928,
    "translated_title": "时间变异的向量误差修正模型：估计与推断",
    "translated_abstract": "本文考虑了一种时间变异的向量误差修正模型，它允许不同的时间序列行为（例如、单位根和局部平稳过程）相互作用来共存。从实际的角度来看，这个框架可以用来估计非平稳变量可预测性的变化，检验经济理论是否定期成立等。我们首先提出了一个时间变异的 Granger 表示定理，为模型的渐近性质的建立提供了便利，然后针对短期和长期系数提出了估计和推断方法和理论，同时提出了一种信息准则来估计滞后长度，一种奇异值比率检验来确定协整阶数，以及一种假设检验来检验参数稳定性。为了验证理论结果，我们进行了大量的模拟研究。最后，我们通过应用该框架来调查粮食配给的问题来证明其经验相关性。",
    "tldr": "本文提出了一种时间变异的向量误差修正模型，能够同时处理不同时间序列行为，可以用于估算非平稳变量的可预测性变化、检验经济理论的定期成立等，同时提出了一些实用方法和理论。"
}