{
    "title": "A Corpus for Sentence-level Subjectivity Detection on English News Articles",
    "abstract": "arXiv:2305.18034v2 Announce Type: replace  Abstract: We develop novel annotation guidelines for sentence-level subjectivity detection, which are not limited to language-specific cues. We use our guidelines to collect NewsSD-ENG, a corpus of 638 objective and 411 subjective sentences extracted from English news articles on controversial topics. Our corpus paves the way for subjectivity detection in English and across other languages without relying on language-specific tools, such as lexicons or machine translation. We evaluate state-of-the-art multilingual transformer-based models on the task in mono-, multi-, and cross-language settings. For this purpose, we re-annotate an existing Italian corpus. We observe that models trained in the multilingual setting achieve the best performance on the task.",
    "link": "https://arxiv.org/abs/2305.18034",
    "context": "Title: A Corpus for Sentence-level Subjectivity Detection on English News Articles\nAbstract: arXiv:2305.18034v2 Announce Type: replace  Abstract: We develop novel annotation guidelines for sentence-level subjectivity detection, which are not limited to language-specific cues. We use our guidelines to collect NewsSD-ENG, a corpus of 638 objective and 411 subjective sentences extracted from English news articles on controversial topics. Our corpus paves the way for subjectivity detection in English and across other languages without relying on language-specific tools, such as lexicons or machine translation. We evaluate state-of-the-art multilingual transformer-based models on the task in mono-, multi-, and cross-language settings. For this purpose, we re-annotate an existing Italian corpus. We observe that models trained in the multilingual setting achieve the best performance on the task.",
    "path": "papers/23/05/2305.18034.json",
    "total_tokens": 775,
    "translated_title": "用于英语新闻文章句子级主观性检测的语料库",
    "translated_abstract": "我们制定了用于句子级主观性检测的新颖标注指南，不局限于特定语言的线索。我们利用这些指南收集了NewsSD-ENG，这是从有争议话题的英语新闻文章中提取的638个客观句子和411个主观句子的语料库。我们的语料库为英语及其他语言的主观性检测铺平了道路，而无需依赖于词典或机器翻译等特定语言工具。我们在单语、多语和跨语言设置下评估了最先进的多语言变压器模型在该任务上的表现。为此，我们重新注释了现有的意大利语语料库。我们发现，在多语境中训练的模型在该任务上取得了最佳性能。",
    "tldr": "该研究开发了新的标注指南，建立了用于英语新闻文章句子级主观性检测的语料库，并表明多语境训练的模型在该任务上取得了最佳性能。",
    "en_tdlr": "This study develops novel annotation guidelines, establishes a corpus for sentence-level subjectivity detection on English news articles, and demonstrates that models trained in multiple language settings achieve the best performance on the task."
}