{
    "title": "Analysis of different temporal graph neural network configurations on dynamic graphs. (arXiv:2305.01128v1 [cs.LG])",
    "abstract": "In recent years, there has been an increasing interest in the use of graph neural networks (GNNs) for analyzing dynamic graphs, which are graphs that evolve over time. However, there is still a lack of understanding of how different temporal graph neural network (TGNs) configurations can impact the accuracy of predictions on dynamic graphs. Moreover, the hunt for benchmark datasets for these TGNs models is still ongoing. Up until recently, Pytorch Geometric Temporal came up with a few benchmark datasets but most of these datasets have not been analyzed with different TGN models to establish the state-of-the-art. Therefore, this project aims to address this gap in the literature by performing a qualitative analysis of spatial-temporal dependence structure learning on dynamic graphs, as well as a comparative study of the effectiveness of selected TGNs on node and edge prediction tasks. Additionally, an extensive ablation study will be conducted on different variants of the best-performin",
    "link": "http://arxiv.org/abs/2305.01128",
    "context": "Title: Analysis of different temporal graph neural network configurations on dynamic graphs. (arXiv:2305.01128v1 [cs.LG])\nAbstract: In recent years, there has been an increasing interest in the use of graph neural networks (GNNs) for analyzing dynamic graphs, which are graphs that evolve over time. However, there is still a lack of understanding of how different temporal graph neural network (TGNs) configurations can impact the accuracy of predictions on dynamic graphs. Moreover, the hunt for benchmark datasets for these TGNs models is still ongoing. Up until recently, Pytorch Geometric Temporal came up with a few benchmark datasets but most of these datasets have not been analyzed with different TGN models to establish the state-of-the-art. Therefore, this project aims to address this gap in the literature by performing a qualitative analysis of spatial-temporal dependence structure learning on dynamic graphs, as well as a comparative study of the effectiveness of selected TGNs on node and edge prediction tasks. Additionally, an extensive ablation study will be conducted on different variants of the best-performin",
    "path": "papers/23/05/2305.01128.json",
    "total_tokens": 878,
    "translated_title": "不同时间图神经网络配置在动态图上的分析。",
    "translated_abstract": "近年来，人们对使用图神经网络（GNN）分析动态图（随时间演变的图）的兴趣越来越大。然而，不同的时间图神经网络（TGN）配置如何影响动态图上的预测准确性仍存在不足之处。此外，对于这些TGN模型的基准数据集的搜索仍在进行中。近期，Pytorch Geometric Temporal提供了一些基准数据集，但这些数据集大多数还没有用不同的TGN模型进行分析以建立最先进的状况。因此，本项目旨在通过对动态图上的时空依赖结构学习进行定性分析，并比较选定TGN模型在节点和边预测任务上的有效性，以及对最佳表现TGN模型的不同变体进行广泛的消融实验，以探索不同设计选择对预测准确性的影响。",
    "tldr": "本文针对动态图上的时空依赖结构进行了分析，并比较了不同TGN模型在预测任务上的有效性。通过广泛的消融实验，探讨了不同设计选择对预测准确性的影响。",
    "en_tdlr": "This paper analyzes the spatial-temporal dependence structure on dynamic graphs and compares the effectiveness of different TGN models in prediction tasks. The impact of different design choices on prediction accuracy is explored through extensive ablation experiments."
}