{
    "title": "Towards Unsupervised Recognition of Semantic Differences in Related Documents. (arXiv:2305.13303v2 [cs.CL] UPDATED)",
    "abstract": "Automatically highlighting words that cause semantic differences between two documents could be useful for a wide range of applications. We formulate recognizing semantic differences (RSD) as a token-level regression task and study three unsupervised approaches that rely on a masked language model. To assess the approaches, we begin with basic English sentences and gradually move to more complex, cross-lingual document pairs. Our results show that an approach based on word alignment and sentence-level contrastive learning has a robust correlation to gold labels. However, all unsupervised approaches still leave a large margin of improvement. Code to reproduce our experiments is available at https://github.com/ZurichNLP/recognizing-semantic-differences",
    "link": "http://arxiv.org/abs/2305.13303",
    "context": "Title: Towards Unsupervised Recognition of Semantic Differences in Related Documents. (arXiv:2305.13303v2 [cs.CL] UPDATED)\nAbstract: Automatically highlighting words that cause semantic differences between two documents could be useful for a wide range of applications. We formulate recognizing semantic differences (RSD) as a token-level regression task and study three unsupervised approaches that rely on a masked language model. To assess the approaches, we begin with basic English sentences and gradually move to more complex, cross-lingual document pairs. Our results show that an approach based on word alignment and sentence-level contrastive learning has a robust correlation to gold labels. However, all unsupervised approaches still leave a large margin of improvement. Code to reproduce our experiments is available at https://github.com/ZurichNLP/recognizing-semantic-differences",
    "path": "papers/23/05/2305.13303.json",
    "total_tokens": 808,
    "translated_title": "《关于相关文档中语义差异的无监督识别》",
    "translated_abstract": "自动突出导致两个文档之间语义差异的单词可能对各种应用程序有用。我们将语义差异识别（RSD）定义为一个标记级回归任务，并研究了三个依赖于屏蔽语言模型的无监督方法。为了评估这些方法，我们从基本的英语句子开始，并逐渐转向更复杂的跨语言文档对。我们的结果表明，基于单词对齐和句级对比学习的方法与真实标签之间存在稳健的相关性。然而，所有的无监督方法仍有很大的改进空间。可以在https://github.com/ZurichNLP/recognizing-semantic-differences找到重现我们实验的代码。",
    "tldr": "本论文提出了一种无监督识别语义差异的方法，并对三种无监督方法进行了研究。实验结果显示，基于单词对齐和句级对比学习的方法与真实标签之间存在稳健的相关性。然而，所有的无监督方法仍有很大的改进空间。"
}