{
    "title": "Repairing Deep Neural Networks Based on Behavior Imitation. (arXiv:2305.03365v1 [cs.SE])",
    "abstract": "The increasing use of deep neural networks (DNNs) in safety-critical systems has raised concerns about their potential for exhibiting ill-behaviors. While DNN verification and testing provide post hoc conclusions regarding unexpected behaviors, they do not prevent the erroneous behaviors from occurring. To address this issue, DNN repair/patch aims to eliminate unexpected predictions generated by defective DNNs. Two typical DNN repair paradigms are retraining and fine-tuning. However, existing methods focus on the high-level abstract interpretation or inference of state spaces, ignoring the underlying neurons' outputs. This renders patch processes computationally prohibitive and limited to piecewise linear (PWL) activation functions to great extent. To address these shortcomings, we propose a behavior-imitation based repair framework, BIRDNN, which integrates the two repair paradigms for the first time. BIRDNN corrects incorrect predictions of negative samples by imitating the closest e",
    "link": "http://arxiv.org/abs/2305.03365",
    "context": "Title: Repairing Deep Neural Networks Based on Behavior Imitation. (arXiv:2305.03365v1 [cs.SE])\nAbstract: The increasing use of deep neural networks (DNNs) in safety-critical systems has raised concerns about their potential for exhibiting ill-behaviors. While DNN verification and testing provide post hoc conclusions regarding unexpected behaviors, they do not prevent the erroneous behaviors from occurring. To address this issue, DNN repair/patch aims to eliminate unexpected predictions generated by defective DNNs. Two typical DNN repair paradigms are retraining and fine-tuning. However, existing methods focus on the high-level abstract interpretation or inference of state spaces, ignoring the underlying neurons' outputs. This renders patch processes computationally prohibitive and limited to piecewise linear (PWL) activation functions to great extent. To address these shortcomings, we propose a behavior-imitation based repair framework, BIRDNN, which integrates the two repair paradigms for the first time. BIRDNN corrects incorrect predictions of negative samples by imitating the closest e",
    "path": "papers/23/05/2305.03365.json",
    "total_tokens": 903,
    "translated_title": "基于行为模仿的深度神经网络修复方法",
    "translated_abstract": "深度神经网络(DNN)在安全关键系统中的使用不断增加，但其展示出意外行为的潜力也引起了人们的担忧。虽然DNN验证和测试可以提供针对异常行为的事后结论，但并不能避免错误行为的出现。为解决这个问题，DNN的修复/补丁旨在消除由有缺陷DNN生成的意外预测。然而，现有的方法侧重于状态空间的高级抽象解释或推理，忽略了底层神经元的输出。这使得修补过程在计算上是禁止的，并且在很大程度上仅限于分段线性（PWL）激活函数。为解决这些缺点，我们提出了一种基于行为模仿的修复框架BIRDNN，它首次集成了两种修复范式。BIRDNN通过模仿最接近的正常样本来纠正负样本的不正确预测。",
    "tldr": "提出了一种基于行为模仿的深度神经网络修复框架（BIRDNN），集成了重新训练和微调两种方法，通过模仿最接近的正常样本来纠正负样本的不正确预测。",
    "en_tdlr": "A behavior-imitation based repair framework BIRDNN is proposed to eliminate unexpected predictions generated by defective deep neural networks (DNNs). BIRDNN integrates the two repair paradigms of retraining and fine-tuning for the first time, and corrects incorrect predictions of negative samples by imitating the closest normal sample."
}