{
    "title": "Fast parameter estimation of Generalized Extreme Value distribution using Neural Networks. (arXiv:2305.04341v1 [stat.ML])",
    "abstract": "The heavy-tailed behavior of the generalized extreme-value distribution makes it a popular choice for modeling extreme events such as floods, droughts, heatwaves, wildfires, etc. However, estimating the distribution's parameters using conventional maximum likelihood methods can be computationally intensive, even for moderate-sized datasets. To overcome this limitation, we propose a computationally efficient, likelihood-free estimation method utilizing a neural network. Through an extensive simulation study, we demonstrate that the proposed neural network-based method provides Generalized Extreme Value (GEV) distribution parameter estimates with comparable accuracy to the conventional maximum likelihood method but with a significant computational speedup. To account for estimation uncertainty, we utilize parametric bootstrapping, which is inherent in the trained network. Finally, we apply this method to 1000-year annual maximum temperature data from the Community Climate System Model ve",
    "link": "http://arxiv.org/abs/2305.04341",
    "context": "Title: Fast parameter estimation of Generalized Extreme Value distribution using Neural Networks. (arXiv:2305.04341v1 [stat.ML])\nAbstract: The heavy-tailed behavior of the generalized extreme-value distribution makes it a popular choice for modeling extreme events such as floods, droughts, heatwaves, wildfires, etc. However, estimating the distribution's parameters using conventional maximum likelihood methods can be computationally intensive, even for moderate-sized datasets. To overcome this limitation, we propose a computationally efficient, likelihood-free estimation method utilizing a neural network. Through an extensive simulation study, we demonstrate that the proposed neural network-based method provides Generalized Extreme Value (GEV) distribution parameter estimates with comparable accuracy to the conventional maximum likelihood method but with a significant computational speedup. To account for estimation uncertainty, we utilize parametric bootstrapping, which is inherent in the trained network. Finally, we apply this method to 1000-year annual maximum temperature data from the Community Climate System Model ve",
    "path": "papers/23/05/2305.04341.json",
    "total_tokens": 846,
    "translated_title": "利用神经网络快速估计广义极值分布的参数",
    "translated_abstract": "广义极值分布的重尾性使其成为建模洪水、干旱、热浪、野火等极端事件的流行选择。然而，使用传统的极大似然方法估计分布的参数，即使对于中等大小的数据集也可能具有计算密集度。为了克服这个限制，我们提出了一种使用神经网络的计算有效的不需要似然的估计方法。通过广泛的仿真研究，我们证明了所提出的基于神经网络的方法提供具有可比较准确性的广义极值分布参数估计，但具有显着的计算加速度。为了考虑估计不确定度，我们利用训练好的网络中固有的参数自助法。最后，我们将这种方法应用于来自社区气候系统模型的1000年年最大温度数据。",
    "tldr": "本论文提出了一种利用神经网络进行计算有效的广义极值分布参数估计的方法，与传统的极大似然方法相比，具有相似的准确性和显著的计算加速度。",
    "en_tdlr": "This paper proposes a computationally efficient method for estimating Generalized Extreme Value (GEV) distribution parameters using a neural network. The method provides comparable accuracy to conventional maximum likelihood methods, but with significant computational speedup. Applied to 1000-year annual maximum temperature data, the results are promising."
}