{
    "title": "Rankings-Dependent Preferences: A Real Goods Matching Experiment. (arXiv:2305.03644v1 [econ.GN])",
    "abstract": "We investigate whether preferences for objects received via a matching mechanism are influenced by how highly agents rank them in their reported rank order list. We hypothesize that all else equal, agents receive greater utility for the same object when they rank it higher. The addition of rankings-dependent utility implies that it may not be a dominant strategy to submit truthful preferences to a strategyproof mechanism, and that non-strategyproof mechanisms that give more agents objects they report as higher ranked may increase market welfare. We test these hypotheses with a matching experiment in a strategyproof mechanism, the random serial dictatorship, and a non-strategyproof mechanism, the Boston mechanism. A novel feature of our experimental design is that the objects allocated in the matching markets are real goods, which allows us to directly measure rankings-dependence by eliciting values for goods both inside and outside of the mechanism. Our experimental results confirm tha",
    "link": "http://arxiv.org/abs/2305.03644",
    "context": "Title: Rankings-Dependent Preferences: A Real Goods Matching Experiment. (arXiv:2305.03644v1 [econ.GN])\nAbstract: We investigate whether preferences for objects received via a matching mechanism are influenced by how highly agents rank them in their reported rank order list. We hypothesize that all else equal, agents receive greater utility for the same object when they rank it higher. The addition of rankings-dependent utility implies that it may not be a dominant strategy to submit truthful preferences to a strategyproof mechanism, and that non-strategyproof mechanisms that give more agents objects they report as higher ranked may increase market welfare. We test these hypotheses with a matching experiment in a strategyproof mechanism, the random serial dictatorship, and a non-strategyproof mechanism, the Boston mechanism. A novel feature of our experimental design is that the objects allocated in the matching markets are real goods, which allows us to directly measure rankings-dependence by eliciting values for goods both inside and outside of the mechanism. Our experimental results confirm tha",
    "path": "papers/23/05/2305.03644.json",
    "total_tokens": 972,
    "translated_title": "排序依赖偏好：一项真实货物匹配实验",
    "translated_abstract": "本研究探讨通过匹配机制获得对象的偏好是否受到代理人在其报告的排名列表中对其排名的影响。我们假设其他条件相同，代理人对同一对象在其排名更高时会获得更大的效用。排序依赖的效用的引入意味着向真实偏好交换机制提交真实偏好可能不是一种占优策略，并且能够提供给更多的代理人报告为更高排名的对象的非占优机制可能会增加市场福利。我们通过在一个占优策略机制——随机串行独裁——和一个非占优机制——波士顿机制中进行匹配实验来测试这些假设。我们实验设计的一个新特点是在匹配市场分配的对象是真实物品，这使我们能够通过征集内外机制中物品的价值来直接测量排序依赖性。我们的实验结果证实了我们的假设。",
    "tldr": "研究探讨了代理人通过匹配机制获得对象的偏好是否受到其在排名列表中排名的影响，结果发现更高的排名可以带来更大的效用。研究发现真实偏好交换机制可能不是一种占优策略，且能够提供给更多的代理人报告为更高排名的对象的非占优机制可能会增加市场福利。"
}