{
    "title": "Robust and lightweight audio fingerprint for Automatic Content Recognition. (arXiv:2305.09559v1 [cs.SD])",
    "abstract": "This research paper presents a novel audio fingerprinting system for Automatic Content Recognition (ACR). By using signal processing techniques and statistical transformations, our proposed method generates compact fingerprints of audio segments that are robust to noise degradations present in real-world audio. The system is designed to be highly scalable, with the ability to identify thousands of hours of content using fingerprints generated from millions of TVs. The fingerprint's high temporal correlation and utilization of existing GPU-compatible Approximate Nearest Neighbour (ANN) search algorithms make this possible. Furthermore, the fingerprint generation can run on low-power devices with limited compute, making it accessible to a wide range of applications. Experimental results show improvements in our proposed system compared to a min-hash based audio fingerprint on all evaluated metrics, including accuracy on proprietary ACR datasets, retrieval speed, memory usage, and robustn",
    "link": "http://arxiv.org/abs/2305.09559",
    "context": "Title: Robust and lightweight audio fingerprint for Automatic Content Recognition. (arXiv:2305.09559v1 [cs.SD])\nAbstract: This research paper presents a novel audio fingerprinting system for Automatic Content Recognition (ACR). By using signal processing techniques and statistical transformations, our proposed method generates compact fingerprints of audio segments that are robust to noise degradations present in real-world audio. The system is designed to be highly scalable, with the ability to identify thousands of hours of content using fingerprints generated from millions of TVs. The fingerprint's high temporal correlation and utilization of existing GPU-compatible Approximate Nearest Neighbour (ANN) search algorithms make this possible. Furthermore, the fingerprint generation can run on low-power devices with limited compute, making it accessible to a wide range of applications. Experimental results show improvements in our proposed system compared to a min-hash based audio fingerprint on all evaluated metrics, including accuracy on proprietary ACR datasets, retrieval speed, memory usage, and robustn",
    "path": "papers/23/05/2305.09559.json",
    "total_tokens": 856,
    "translated_title": "自动内容识别中的鲁棒且轻量级音频指纹识别系统",
    "translated_abstract": "本研究提出了一种新的音频指纹识别系统，用于自动内容识别（ACR）。通过使用信号处理技术和统计变换，我们的方法生成音频片段的紧凑指纹，这些指纹对现实世界中存在的噪声降级具有鲁棒性。该系统具有高度可扩展性，能够使用来自数百万台电视的指纹识别数千小时的内容。指纹的高时间相关性和利用现有的GPU兼容的近似最近邻（ANN）搜索算法使这一点成为可能。此外，指纹生成可以在计算受限的低功耗设备上运行，使其可以被广泛应用。",
    "tldr": "本文提出了一种鲁棒且轻量级的音频指纹识别系统，可用于自动内容识别，具有高度可扩展性和低功耗，并在专有ACR数据集精度、检索速度、内存使用和鲁棒性等所有评估指标上均显著优于基于最小哈希的音频指纹。",
    "en_tdlr": "This paper proposes a robust and lightweight audio fingerprinting system for Automatic Content Recognition (ACR), which generates compact fingerprints of audio segments and is scalable, GPU-compatible and low-power. The proposed system outperforms a min-hash based audio fingerprint on all evaluated metrics, including accuracy on proprietary ACR datasets, retrieval speed, memory usage, and robustness."
}