{
    "title": "Mining Negative Temporal Contexts For False Positive Suppression In Real-Time Ultrasound Lesion Detection. (arXiv:2305.18060v2 [cs.CV] UPDATED)",
    "abstract": "During ultrasonic scanning processes, real-time lesion detection can assist radiologists in accurate cancer diagnosis. However, this essential task remains challenging and underexplored. General-purpose real-time object detection models can mistakenly report obvious false positives (FPs) when applied to ultrasound videos, potentially misleading junior radiologists. One key issue is their failure to utilize negative symptoms in previous frames, denoted as negative temporal contexts (NTC). To address this issue, we propose to extract contexts from previous frames, including NTC, with the guidance of inverse optical flow. By aggregating extracted contexts, we endow the model with the ability to suppress FPs by leveraging NTC. We call the resulting model UltraDet. The proposed UltraDet demonstrates significant improvement over previous state-of-the-arts and achieves real-time inference speed. We release the code, checkpoints, and high-quality labels of the CVA-BUS dataset in https://github",
    "link": "http://arxiv.org/abs/2305.18060",
    "context": "Title: Mining Negative Temporal Contexts For False Positive Suppression In Real-Time Ultrasound Lesion Detection. (arXiv:2305.18060v2 [cs.CV] UPDATED)\nAbstract: During ultrasonic scanning processes, real-time lesion detection can assist radiologists in accurate cancer diagnosis. However, this essential task remains challenging and underexplored. General-purpose real-time object detection models can mistakenly report obvious false positives (FPs) when applied to ultrasound videos, potentially misleading junior radiologists. One key issue is their failure to utilize negative symptoms in previous frames, denoted as negative temporal contexts (NTC). To address this issue, we propose to extract contexts from previous frames, including NTC, with the guidance of inverse optical flow. By aggregating extracted contexts, we endow the model with the ability to suppress FPs by leveraging NTC. We call the resulting model UltraDet. The proposed UltraDet demonstrates significant improvement over previous state-of-the-arts and achieves real-time inference speed. We release the code, checkpoints, and high-quality labels of the CVA-BUS dataset in https://github",
    "path": "papers/23/05/2305.18060.json",
    "total_tokens": 898,
    "translated_title": "在实时超声病变检测中挖掘负面时间背景以抑制假阳性",
    "translated_abstract": "在超声扫描过程中，实时病变检测可以帮助放射科医生准确诊断癌症。然而，这一关键任务仍然具有挑战性且未被充分探索。当应用于超声视频时，通用实时目标检测模型可能错误地报告明显的假阳性(FPs)，可能误导初级放射科医生。其中一个关键问题是它们未能利用之前帧中的负面症状，即负面时间背景(NTC)。为了解决这个问题，我们提出利用逆光流指导，从之前的帧中提取上下文，包括NTC。通过聚合提取的上下文，我们赋予模型利用NTC抑制FP的能力。我们将结果模型称为UltraDet。所提出的UltraDet在超过之前最先进的模型上取得了显著改进，并实现了实时推理速度。我们在https://github上发布了CVA-BUS数据集的代码、检查点和高质量标签。",
    "tldr": "该论文提出了一种在超声视频中实时进行病变检测的方法，通过挖掘之前帧中的负面时间背景来抑制假阳性，取得了显著的性能改进。",
    "en_tdlr": "This paper proposes a method for real-time lesion detection in ultrasound videos, which achieves significant performance improvement by mining negative temporal contexts in previous frames to suppress false positives."
}