{
    "title": "Large Language Models in Ambulatory Devices for Home Health Diagnostics: A case study of Sickle Cell Anemia Management. (arXiv:2305.03715v1 [cs.CL])",
    "abstract": "This study investigates the potential of an ambulatory device that incorporates Large Language Models (LLMs) in cadence with other specialized ML models to assess anemia severity in sickle cell patients in real time. The device would rely on sensor data that measures angiogenic material levels to assess anemia severity, providing real-time information to patients and clinicians to reduce the frequency of vaso-occlusive crises because of the early detection of anemia severity, allowing for timely interventions and potentially reducing the likelihood of serious complications. The main challenges in developing such a device are the creation of a reliable non-invasive tool for angiogenic level assessment, a biophysics model and the practical consideration of an LLM communicating with emergency personnel on behalf of an incapacitated patient. A possible system is proposed, and the limitations of this approach are discussed.",
    "link": "http://arxiv.org/abs/2305.03715",
    "context": "Title: Large Language Models in Ambulatory Devices for Home Health Diagnostics: A case study of Sickle Cell Anemia Management. (arXiv:2305.03715v1 [cs.CL])\nAbstract: This study investigates the potential of an ambulatory device that incorporates Large Language Models (LLMs) in cadence with other specialized ML models to assess anemia severity in sickle cell patients in real time. The device would rely on sensor data that measures angiogenic material levels to assess anemia severity, providing real-time information to patients and clinicians to reduce the frequency of vaso-occlusive crises because of the early detection of anemia severity, allowing for timely interventions and potentially reducing the likelihood of serious complications. The main challenges in developing such a device are the creation of a reliable non-invasive tool for angiogenic level assessment, a biophysics model and the practical consideration of an LLM communicating with emergency personnel on behalf of an incapacitated patient. A possible system is proposed, and the limitations of this approach are discussed.",
    "path": "papers/23/05/2305.03715.json",
    "total_tokens": 944,
    "translated_title": "应用大型语言模型于居家健康诊断设备中：以镰刀细胞贫血管理为例",
    "translated_abstract": "本研究探讨了一种居家设备的潜力，它将大型语言模型(Large Language Models, LLMs)与其他专门的机器学习模型结合使用，实时评估镰刀细胞病患者的贫血程度。该设备依赖测量血管生成物水平的传感器数据来评估贫血程度，为患者和临床医生提供实时信息，以减少血管阻塞性危机发作的频率，因为早期发现贫血程度，允许及时干预，可能降低严重并发症的发生率。开发这种设备的主要挑战是创建一个可靠的非侵入性工具来评估血管生成物水平，建立一个生物物理模型，以及考虑LLM如何代表一个无法行动的患者与急救人员进行通信等实际考虑。本研究提出了一种可能的系统，并讨论了这种方法的局限性。",
    "tldr": "本研究提出在居家健康诊断设备中应用大型语言模型，以实时评估镰刀细胞病患者的贫血程度，并提供实时信息，以便减少血管阻塞性危机发作的频率。",
    "en_tdlr": "This study proposes the use of Large Language Models (LLMs) in ambulatory devices to assess anemia severity in sickle cell patients in real time, based on sensor data that measures angiogenic material levels, and provide real-time information to reduce the frequency of vaso-occlusive crises."
}