{
    "title": "A Heat-Jarrow-Morton framework for energy markets: a pragmatic approach. (arXiv:2305.01485v1 [q-fin.MF])",
    "abstract": "In this article we discuss the application of the Heat-Jarrow-Morton framework Heath et al. [26] to energy markets. The goal of the article is to give a detailed overview of the topic, focusing on practical aspects rather than on theory, which has been widely studied in literature. This work aims to be a guide for practitioners and for all those who deal with the practical issues of this approach to energy market. In particular, we focus on the markets' structure, model calibration by dimension reduction with Principal Component Analysis (PCA), Monte Carlo simulations and derivatives pricing. As application, we focus on European power and gas markets: we calibrate the model on historical futures quotations, we perform futures and spot simulations and we analyze the results.",
    "link": "http://arxiv.org/abs/2305.01485",
    "context": "Title: A Heat-Jarrow-Morton framework for energy markets: a pragmatic approach. (arXiv:2305.01485v1 [q-fin.MF])\nAbstract: In this article we discuss the application of the Heat-Jarrow-Morton framework Heath et al. [26] to energy markets. The goal of the article is to give a detailed overview of the topic, focusing on practical aspects rather than on theory, which has been widely studied in literature. This work aims to be a guide for practitioners and for all those who deal with the practical issues of this approach to energy market. In particular, we focus on the markets' structure, model calibration by dimension reduction with Principal Component Analysis (PCA), Monte Carlo simulations and derivatives pricing. As application, we focus on European power and gas markets: we calibrate the model on historical futures quotations, we perform futures and spot simulations and we analyze the results.",
    "path": "papers/23/05/2305.01485.json",
    "total_tokens": 748,
    "translated_title": "一种应用于能源市场的Heat-Jarrow-Morton框架：实用方法",
    "translated_abstract": "本文讨论了将Heat-Jarrow-Morton框架应用于能源市场的方法。本文的目的是详细介绍该主题，重点放在实践方面而非已有大量文献探讨的理论方面。本文旨在成为从业人员以及所有从事这种方法的能源市场实际问题处理的人的指南。具体而言，我们关注市场结构、利用主成分分析（PCA）进行模型校准、蒙特卡罗模拟和衍生品定价。作为应用，我们重点关注欧洲电力和天然气市场：我们将模型校准为历史期货报价，进行期货和现货模拟并分析结果。",
    "tldr": "本文介绍了一种应用于能源市场的Heat-Jarrow-Morton框架，重点放在实践方面。作为应用，我们重点关注欧洲电力和天然气市场。",
    "en_tdlr": "This article introduces a pragmatic approach of applying Heat-Jarrow-Morton framework to energy markets, with a focus on practical aspects. An application on European power and gas markets is presented."
}