{
    "title": "To transfer or not transfer: Unified transferability metric and analysis. (arXiv:2305.07741v1 [cs.LG])",
    "abstract": "In transfer learning, transferability is one of the most fundamental problems, which aims to evaluate the effectiveness of arbitrary transfer tasks. Existing research focuses on classification tasks and neglects domain or task differences. More importantly, there is a lack of research to determine whether to transfer or not. To address these, we propose a new analytical approach and metric, Wasserstein Distance based Joint Estimation (WDJE), for transferability estimation and determination in a unified setting: classification and regression problems with domain and task differences. The WDJE facilitates decision-making on whether to transfer or not by comparing the target risk with and without transfer. To enable the comparison, we approximate the target transfer risk by proposing a non-symmetric, easy-to-understand and easy-to-calculate target risk bound that is workable even with limited target labels. The proposed bound relates the target risk to source model performance, domain and",
    "link": "http://arxiv.org/abs/2305.07741",
    "context": "Title: To transfer or not transfer: Unified transferability metric and analysis. (arXiv:2305.07741v1 [cs.LG])\nAbstract: In transfer learning, transferability is one of the most fundamental problems, which aims to evaluate the effectiveness of arbitrary transfer tasks. Existing research focuses on classification tasks and neglects domain or task differences. More importantly, there is a lack of research to determine whether to transfer or not. To address these, we propose a new analytical approach and metric, Wasserstein Distance based Joint Estimation (WDJE), for transferability estimation and determination in a unified setting: classification and regression problems with domain and task differences. The WDJE facilitates decision-making on whether to transfer or not by comparing the target risk with and without transfer. To enable the comparison, we approximate the target transfer risk by proposing a non-symmetric, easy-to-understand and easy-to-calculate target risk bound that is workable even with limited target labels. The proposed bound relates the target risk to source model performance, domain and",
    "path": "papers/23/05/2305.07741.json",
    "total_tokens": 968,
    "translated_title": "转移还是不转移：统一的可转移度量与分析",
    "translated_abstract": "在转移学习中，可转移性是最基本的问题之一，旨在评估任意转移任务的有效性。现有研究关注分类任务，忽视了领域或任务差异。更重要的是，缺乏确定是否转移的研究。为了解决这些问题，我们提出了一种新的分析方法和度量标准-基于Wasserstein距离的联合估计（WDJE），用于转移能力评估和决策，并在统一的分类和回归问题中考虑了领域和任务差异。WDJE通过比较有无转移的目标风险来促进决策制定。为了使比较成立，我们提出了一个非对称，易于理解和易于计算的目标风险边界，以近似目标转移风险，即使有限的目标标签也可以胜任。所提出的边界将目标风险与源模型性能，领域和共享性联系起来。",
    "tldr": "该论文提出了基于Wasserstein距离的联合估计（WDJE）的分析方法和度量标准，用于转移能力评估和决策，覆盖了领域和任务差异，以及分类和回归问题。从比较目标风险的角度促进决策，提出了一个易于计算的目标风险边界。",
    "en_tdlr": "This paper proposes a new analytical approach and metric- WDJE, based on Wasserstein Distance, for transferability estimation and determination in a unified setting for classification and regression problems with domain and task differences. The decision-making on whether to transfer or not is facilitated by comparing the target risk with and without transfer, while the proposed non-symmetric, easy-to-understand and easy-to-calculate target risk bound approximates the target transfer risk, even with limited target labels."
}