{
    "title": "ChatGPT-steered Editing Instructor for Customization of Abstractive Summarization. (arXiv:2305.02483v1 [cs.CL])",
    "abstract": "Tailoring outputs of large language models, such as ChatGPT, to specific user needs remains a challenge despite their impressive generation quality. In this paper, we propose a tri-agent generation pipeline consisting of a generator, an instructor, and an editor to enhance the customization of generated outputs. The generator produces an initial output, the user-specific instructor generates editing instructions, and the editor generates a revised output aligned with user preferences. The inference-only large language model (ChatGPT) serves as both the generator and the editor, while a smaller model acts as the user-specific instructor to guide the generation process toward user needs. The instructor is trained using editor-steered reinforcement learning, leveraging feedback from the large-scale editor model to optimize instruction generation. Experimental results on two abstractive summarization datasets demonstrate the effectiveness of our approach in generating outputs that better f",
    "link": "http://arxiv.org/abs/2305.02483",
    "context": "Title: ChatGPT-steered Editing Instructor for Customization of Abstractive Summarization. (arXiv:2305.02483v1 [cs.CL])\nAbstract: Tailoring outputs of large language models, such as ChatGPT, to specific user needs remains a challenge despite their impressive generation quality. In this paper, we propose a tri-agent generation pipeline consisting of a generator, an instructor, and an editor to enhance the customization of generated outputs. The generator produces an initial output, the user-specific instructor generates editing instructions, and the editor generates a revised output aligned with user preferences. The inference-only large language model (ChatGPT) serves as both the generator and the editor, while a smaller model acts as the user-specific instructor to guide the generation process toward user needs. The instructor is trained using editor-steered reinforcement learning, leveraging feedback from the large-scale editor model to optimize instruction generation. Experimental results on two abstractive summarization datasets demonstrate the effectiveness of our approach in generating outputs that better f",
    "path": "papers/23/05/2305.02483.json",
    "total_tokens": 851,
    "translated_title": "ChatGPT引导的编辑辅助工具用于摘要汇总自定义",
    "translated_abstract": "尽管大型语言模型（如ChatGPT）的生成质量令人印象深刻，但根据特定用户需求调整其输出仍然是一项挑战。本文提出了一个三个代理的生成方案——生成器、辅导员和编辑器，以增强生成输出的自定义。生成器产生初始输出，针对用户需求的辅导员产生编辑指导，而编辑器产生符合用户偏好的修订输出。无法训练的大型语言模型（ChatGPT）既充当生成器又充当编辑器，而较小的模型则充当用户特定的辅导员，引导生成过程朝向用户需求的方向发展。辅导员使用编辑者引导的强化学习进行培训，利用大规模编辑模型的反馈来优化指导生成。在两个摘要总结数据集上进行的实验结果表明，我们的方法可以生成更好的输出。",
    "tldr": "本文提出了一个三个代理的生成方案，包括生成器、辅导员和编辑器，以增强生成输出的自定义。在两个摘要总结数据集上进行的实验结果表明，我们的方法可以生成更好的输出。",
    "en_tdlr": "This paper proposes a tri-agent generation pipeline consisting of a generator, an instructor, and an editor to enhance the customization of generated outputs. Results from experiments on two abstractive summarization datasets show the effectiveness of the approach in generating better outputs."
}