{
    "title": "Automated Refugee Case Analysis: An NLP Pipeline for Supporting Legal Practitioners. (arXiv:2305.15533v1 [cs.CL])",
    "abstract": "In this paper, we introduce an end-to-end pipeline for retrieving, processing, and extracting targeted information from legal cases. We investigate an under-studied legal domain with a case study on refugee law in Canada. Searching case law for past similar cases is a key part of legal work for both lawyers and judges, the potential end-users of our prototype. While traditional named-entity recognition labels such as dates provide meaningful information in legal work, we propose to extend existing models and retrieve a total of 19 useful categories of items from refugee cases. After creating a novel data set of cases, we perform information extraction based on state-of-the-art neural named-entity recognition (NER). We test different architectures including two transformer models, using contextual and non-contextual embeddings, and compare general purpose versus domain-specific pre-training. The results demonstrate that models pre-trained on legal data perform best despite their smaller",
    "link": "http://arxiv.org/abs/2305.15533",
    "context": "Title: Automated Refugee Case Analysis: An NLP Pipeline for Supporting Legal Practitioners. (arXiv:2305.15533v1 [cs.CL])\nAbstract: In this paper, we introduce an end-to-end pipeline for retrieving, processing, and extracting targeted information from legal cases. We investigate an under-studied legal domain with a case study on refugee law in Canada. Searching case law for past similar cases is a key part of legal work for both lawyers and judges, the potential end-users of our prototype. While traditional named-entity recognition labels such as dates provide meaningful information in legal work, we propose to extend existing models and retrieve a total of 19 useful categories of items from refugee cases. After creating a novel data set of cases, we perform information extraction based on state-of-the-art neural named-entity recognition (NER). We test different architectures including two transformer models, using contextual and non-contextual embeddings, and compare general purpose versus domain-specific pre-training. The results demonstrate that models pre-trained on legal data perform best despite their smaller",
    "path": "papers/23/05/2305.15533.json",
    "total_tokens": 977,
    "translated_title": "自动化难民案例分析：支持法律从业者的NLP流水线",
    "translated_abstract": "本文介绍了一个端到端的流水线，用于检索、处理和提取法律案件中的有针对性信息。通过在加拿大的难民法律案例研究中调查一个少有研究的法律领域。搜索过去类似案例的案例法是律师和法官的法律工作的重要组成部分。虽然传统的基于命名实体识别的标签（如日期）在法律工作中提供有意义的信息，但我们提出了扩展现有模型，从难民案件中检索19个有用类别的条款。在创建了一个新颖的案例数据集后，我们使用最先进的神经命名实体识别（NER）进行信息提取。我们测试了包括两种变压器模型在内的不同架构，使用上下文和非上下文嵌入，比较了通用目的和领域特定的预训练。结果表明，在法律数据上预训练的模型表现最佳，尽管他们的规模较小。",
    "tldr": "本文介绍了一个支持法律从业者的自动化流水线，用于检索、处理和提取法律案件中的有针对性信息，并在加拿大的难民法律案例研究中扩展现有模型，提取19个有用类别的条款。使用最先进的神经命名实体识别进行信息提取，结果表明，在法律数据上预训练的模型表现最佳。",
    "en_tdlr": "This paper introduces an automated pipeline to support legal practitioners in retrieving, processing, and extracting targeted information from legal cases. It expands existing models to retrieve 19 useful categories of items from refugee cases and performs information extraction using state-of-the-art neural named-entity recognition. The results demonstrate that models pre-trained on legal data perform best."
}