{
    "title": "BIG-C: a Multimodal Multi-Purpose Dataset for Bemba. (arXiv:2305.17202v1 [cs.CL])",
    "abstract": "We present BIG-C (Bemba Image Grounded Conversations), a large multimodal dataset for Bemba. While Bemba is the most populous language of Zambia, it exhibits a dearth of resources which render the development of language technologies or language processing research almost impossible. The dataset is comprised of multi-turn dialogues between Bemba speakers based on images, transcribed and translated into English. There are more than 92,000 utterances/sentences, amounting to more than 180 hours of audio data with corresponding transcriptions and English translations. We also provide baselines on speech recognition (ASR), machine translation (MT) and speech translation (ST) tasks, and sketch out other potential future multimodal uses of our dataset. We hope that by making the dataset available to the research community, this work will foster research and encourage collaboration across the language, speech, and vision communities especially for languages outside the \"traditionally\" used hig",
    "link": "http://arxiv.org/abs/2305.17202",
    "context": "Title: BIG-C: a Multimodal Multi-Purpose Dataset for Bemba. (arXiv:2305.17202v1 [cs.CL])\nAbstract: We present BIG-C (Bemba Image Grounded Conversations), a large multimodal dataset for Bemba. While Bemba is the most populous language of Zambia, it exhibits a dearth of resources which render the development of language technologies or language processing research almost impossible. The dataset is comprised of multi-turn dialogues between Bemba speakers based on images, transcribed and translated into English. There are more than 92,000 utterances/sentences, amounting to more than 180 hours of audio data with corresponding transcriptions and English translations. We also provide baselines on speech recognition (ASR), machine translation (MT) and speech translation (ST) tasks, and sketch out other potential future multimodal uses of our dataset. We hope that by making the dataset available to the research community, this work will foster research and encourage collaboration across the language, speech, and vision communities especially for languages outside the \"traditionally\" used hig",
    "path": "papers/23/05/2305.17202.json",
    "total_tokens": 992,
    "translated_title": "BIG-C：一种Bemba语的多模态多用途数据集。",
    "translated_abstract": "我们提出了BIG-C（Bemba图像引导对话），这是一个用于Bemba语的大型多模态数据集。虽然Bemba语是赞比亚人口最多的语言，但其缺乏资源使得语言技术或语言处理研究的发展几乎是不可能的。该数据集由基于图像的Bemba语言者之间的多轮对话组成，经过转录并翻译成英文。数据集中有超过92,000个话语/句子，相当于超过180小时的音频数据，具有相应的转录和英文翻译。我们还提供了语音识别（ASR）、机器翻译（MT）和语音翻译（ST）任务的基线，并勾画了该数据集其他潜在的未来多模态用途。我们希望通过将该数据集提供给研究社区，本工作将促进研究并鼓励跨越语言、语音和视觉社区的合作，特别是针对“传统”使用的语言之外的语言。",
    "tldr": "BIG-C是一个用于Bemba语的大型多模态数据集，提供了语音识别、机器翻译、语音翻译任务的基线，并勾画了该数据集的潜在未来多模态用途，旨在促进研究并鼓励跨越语言、语音和视觉社区的合作，特别是针对“传统”使用的语言之外的语言。",
    "en_tdlr": "BIG-C is a large multimodal dataset for Bemba, providing baselines on ASR, MT and ST tasks, and sketching out potential future multimodal uses of the dataset. The aim is to foster research and encourage collaboration across the language, speech, and vision communities, especially for languages outside the \"traditionally\" used ones."
}