{
    "title": "Unbounded Differentially Private Quantile and Maximum Estimation. (arXiv:2305.01177v1 [cs.DS])",
    "abstract": "In this work we consider the problem of differentially private computation of quantiles for the data, especially the highest quantiles such as maximum, but with an unbounded range for the dataset. We show that this can be done efficiently through a simple invocation of $\\texttt{AboveThreshold}$, a subroutine that is iteratively called in the fundamental Sparse Vector Technique, even when there is no upper bound on the data. In particular, we show that this procedure can give more accurate and robust estimates on the highest quantiles with applications towards clipping that is essential for differentially private sum and mean estimation. In addition, we show how two invocations can handle the fully unbounded data setting. Within our study, we show that an improved analysis of $\\texttt{AboveThreshold}$ can improve the privacy guarantees for the widely used Sparse Vector Technique that is of independent interest. We give a more general characterization of privacy loss for $\\texttt{AboveTh",
    "link": "http://arxiv.org/abs/2305.01177",
    "context": "Title: Unbounded Differentially Private Quantile and Maximum Estimation. (arXiv:2305.01177v1 [cs.DS])\nAbstract: In this work we consider the problem of differentially private computation of quantiles for the data, especially the highest quantiles such as maximum, but with an unbounded range for the dataset. We show that this can be done efficiently through a simple invocation of $\\texttt{AboveThreshold}$, a subroutine that is iteratively called in the fundamental Sparse Vector Technique, even when there is no upper bound on the data. In particular, we show that this procedure can give more accurate and robust estimates on the highest quantiles with applications towards clipping that is essential for differentially private sum and mean estimation. In addition, we show how two invocations can handle the fully unbounded data setting. Within our study, we show that an improved analysis of $\\texttt{AboveThreshold}$ can improve the privacy guarantees for the widely used Sparse Vector Technique that is of independent interest. We give a more general characterization of privacy loss for $\\texttt{AboveTh",
    "path": "papers/23/05/2305.01177.json",
    "total_tokens": 1063,
    "translated_title": "无界差分隐私分位数和最大值估算",
    "translated_abstract": "本文考虑在数据的分位数计算中，尤其是最高分位数（如最大值），如何实现对无界数据的差分隐私计算。我们通过简单调用迭代调用基本的稀疏向量技术中的$\\texttt{AboveThreshold}$子程序，即可高效地实现此目标，即使数据没有上限。特别地，我们展示出此过程可提供更准确和稳健的最高分位数估计，从而应用于对于差分隐私求和和均值估计至关重要的数据剪切。此外，我们展示了两个调用如何处理完全无界的数据设置。在我们的研究中，我们展示了改进$\\texttt{AboveThreshold}$的分析方法可以提高广泛使用的稀疏向量技术的隐私保障（这是独立于本文的内容）。我们给出了更普遍的$\\texttt{AboveThreshold}$隐私损失特征，并展示了差分隐私的标准组合规则可能会高估总体隐私损失。",
    "tldr": "本文研究了如何对无上限数据进行差分隐私分位数和最大值的计算。调用基本的稀疏向量技术中的$\\texttt{AboveThreshold}$子程序可以实现这个目标，可以提供更准确和稳健的最高分位数估计，从而应用于对于差分隐私求和和均值估计至关重要的数据剪切，该技术的隐私保障可以通过方法改进。",
    "en_tdlr": "This paper studies how to compute differentially private quantiles and maximum for datasets without an upper bound. The $\\texttt{AboveThreshold}$ subroutine in the Sparse Vector Technique is efficiently invoked to achieve this goal. This approach provides more accurate and robust estimation of the highest quantiles, which is essential for differentially private sum and mean estimation. The privacy guarantees of the widely used Sparse Vector Technique can be improved by analyzing $\\texttt{AboveThreshold}$ and providing a more general characterization of privacy loss. The standard composition rules for differential privacy may overestimate the overall privacy loss."
}