{
    "title": "Augmented Electronic Ising Machine as an Effective SAT Solver. (arXiv:2305.01623v1 [cs.AI])",
    "abstract": "With the slowdown of improvement in conventional von Neumann systems, increasing attention is paid to novel paradigms such as Ising machines. They have very different approach to NP-complete optimization problems. Ising machines have shown great potential in solving binary optimization problems like MaxCut. In this paper, we present an analysis of these systems in satisfiability (SAT) problems. We demonstrate that, in the case of 3-SAT, a basic architecture fails to produce meaningful acceleration, thanks in no small part to the relentless progress made in conventional SAT solvers. Nevertheless, careful analysis attributes part of the failure to the lack of two important components: cubic interactions and efficient randomization heuristics. To overcome these limitations, we add proper architectural support for cubic interaction on a state-of-the-art Ising machine. More importantly, we propose a novel semantic-aware annealing schedule that makes the search-space navigation much more eff",
    "link": "http://arxiv.org/abs/2305.01623",
    "context": "Title: Augmented Electronic Ising Machine as an Effective SAT Solver. (arXiv:2305.01623v1 [cs.AI])\nAbstract: With the slowdown of improvement in conventional von Neumann systems, increasing attention is paid to novel paradigms such as Ising machines. They have very different approach to NP-complete optimization problems. Ising machines have shown great potential in solving binary optimization problems like MaxCut. In this paper, we present an analysis of these systems in satisfiability (SAT) problems. We demonstrate that, in the case of 3-SAT, a basic architecture fails to produce meaningful acceleration, thanks in no small part to the relentless progress made in conventional SAT solvers. Nevertheless, careful analysis attributes part of the failure to the lack of two important components: cubic interactions and efficient randomization heuristics. To overcome these limitations, we add proper architectural support for cubic interaction on a state-of-the-art Ising machine. More importantly, we propose a novel semantic-aware annealing schedule that makes the search-space navigation much more eff",
    "path": "papers/23/05/2305.01623.json",
    "total_tokens": 909,
    "translated_title": "增强型电子伊辛机作为高效的SAT求解器",
    "translated_abstract": "随着传统冯诺依曼系统改进的减速，越来越多的关注被付诸于新兴范例，如伊辛机。它们对于NP完全优化问题有着非常不同的方法。伊辛机已经展现出在解决像MaxCut这样的二元优化问题方面的巨大潜力。在本文中，我们针对满足性(SAT)问题对这些系统进行了分析。我们证明，在3-SAT的情况下，一个基本的架构无法产生有意义的加速，这在很大程度上要归功于传统SAT求解器不断取得的进步。尽管如此，细致的分析将部分失败归因于缺乏两个重要组件：立方相互作用和高效的随机启发式算法。为了克服这些限制，我们在最先进的伊辛机上添加了适当的立方体相互作用结构支持。更重要的是，我们提出了一种新的语义感知淬火进度表，使得搜索空间导航变得更加高效。",
    "tldr": "本文提出增强型电子伊辛机作为高效的SAT求解器，通过添加适当的立方相互作用和新的启发式算法，使其在解决满足性问题方面具有出色表现。",
    "en_tdlr": "The paper presents an augmented electronic Ising machine that serves as a powerful SAT solver. The added cubic interactions and novel semantic-aware annealing schedule enable the machine to efficiently navigate the search space and achieve outstanding performance in solving satisfiability problems."
}