{
    "title": "A Variational Perspective on Solving Inverse Problems with Diffusion Models. (arXiv:2305.04391v1 [cs.LG])",
    "abstract": "Diffusion models have emerged as a key pillar of foundation models in visual domains. One of their critical applications is to universally solve different downstream inverse tasks via a single diffusion prior without re-training for each task. Most inverse tasks can be formulated as inferring a posterior distribution over data (e.g., a full image) given a measurement (e.g., a masked image). This is however challenging in diffusion models since the nonlinear and iterative nature of the diffusion process renders the posterior intractable. To cope with this challenge, we propose a variational approach that by design seeks to approximate the true posterior distribution. We show that our approach naturally leads to regularization by denoising diffusion process (RED-Diff) where denoisers at different timesteps concurrently impose different structural constraints over the image. To gauge the contribution of denoisers from different timesteps, we propose a weighting mechanism based on signal-t",
    "link": "http://arxiv.org/abs/2305.04391",
    "context": "Title: A Variational Perspective on Solving Inverse Problems with Diffusion Models. (arXiv:2305.04391v1 [cs.LG])\nAbstract: Diffusion models have emerged as a key pillar of foundation models in visual domains. One of their critical applications is to universally solve different downstream inverse tasks via a single diffusion prior without re-training for each task. Most inverse tasks can be formulated as inferring a posterior distribution over data (e.g., a full image) given a measurement (e.g., a masked image). This is however challenging in diffusion models since the nonlinear and iterative nature of the diffusion process renders the posterior intractable. To cope with this challenge, we propose a variational approach that by design seeks to approximate the true posterior distribution. We show that our approach naturally leads to regularization by denoising diffusion process (RED-Diff) where denoisers at different timesteps concurrently impose different structural constraints over the image. To gauge the contribution of denoisers from different timesteps, we propose a weighting mechanism based on signal-t",
    "path": "papers/23/05/2305.04391.json",
    "total_tokens": 816,
    "translated_title": "用扩散模型解决反问题的变分视角",
    "translated_abstract": "扩散模型已成为视觉领域基础模型的关键支柱之一。其中一个关键应用是通过单个扩散先验普遍解决不同的反问题，而无需为每个任务重新训练。然而，由于扩散过程的非线性和迭代性质使得后验难以处理，因此我们提出了一种变分方法，旨在近似真实后验分布。我们展示了我们的方法通过去噪扩散过程（RED-Diff）自然地导致正则化，其中来自不同时间步长的去噪器同时对图像施加不同的结构约束。为了衡量不同时间步长的去噪器的贡献，我们提出了一种基于信号-t的加权机制。",
    "tldr": "该论文提出了一种通过去噪扩散过程自然地导致正则化的变分方法（RED-Diff），可用于解决不同反问题。加权机制可以衡量不同时间步长的去噪器的贡献。",
    "en_tdlr": "The paper proposes a variational approach (RED-Diff) that uses denoising diffusion process to naturally regularize and solve different inverse problems. A weighting mechanism is introduced to evaluate the contribution of denoisers from different time steps."
}