{
    "title": "Towards Hierarchical Policy Learning for Conversational Recommendation with Hypergraph-based Reinforcement Learning. (arXiv:2305.02575v1 [cs.IR])",
    "abstract": "Conversational recommendation systems (CRS) aim to timely and proactively acquire user dynamic preferred attributes through conversations for item recommendation. In each turn of CRS, there naturally have two decision-making processes with different roles that influence each other: 1) director, which is to select the follow-up option (i.e., ask or recommend) that is more effective for reducing the action space and acquiring user preferences; and 2) actor, which is to accordingly choose primitive actions (i.e., asked attribute or recommended item) that satisfy user preferences and give feedback to estimate the effectiveness of the director's option. However, existing methods heavily rely on a unified decision-making module or heuristic rules, while neglecting to distinguish the roles of different decision procedures, as well as the mutual influences between them. To address this, we propose a novel Director-Actor Hierarchical Conversational Recommender (DAHCR), where the director select",
    "link": "http://arxiv.org/abs/2305.02575",
    "context": "Title: Towards Hierarchical Policy Learning for Conversational Recommendation with Hypergraph-based Reinforcement Learning. (arXiv:2305.02575v1 [cs.IR])\nAbstract: Conversational recommendation systems (CRS) aim to timely and proactively acquire user dynamic preferred attributes through conversations for item recommendation. In each turn of CRS, there naturally have two decision-making processes with different roles that influence each other: 1) director, which is to select the follow-up option (i.e., ask or recommend) that is more effective for reducing the action space and acquiring user preferences; and 2) actor, which is to accordingly choose primitive actions (i.e., asked attribute or recommended item) that satisfy user preferences and give feedback to estimate the effectiveness of the director's option. However, existing methods heavily rely on a unified decision-making module or heuristic rules, while neglecting to distinguish the roles of different decision procedures, as well as the mutual influences between them. To address this, we propose a novel Director-Actor Hierarchical Conversational Recommender (DAHCR), where the director select",
    "path": "papers/23/05/2305.02575.json",
    "total_tokens": 944,
    "translated_title": "基于超图强化学习的分层对话推荐中的策略学习",
    "translated_abstract": "对话推荐系统旨在通过对话及时主动地获取用户的偏好，并推荐相应的物品。然而，现有的方法往往使用统一的决策模块或启发式规则，而忽略了不同决策过程的角色差异和相互作用。为此，本文提出了一种新颖的基于超图强化学习的分层对话推荐模型，其中导演通过超图算法进行选择，帮助演员减少行动空间，指导对话朝着最具信息性的属性方向进行，并根据用户在对话中的偏好选择物品。实验结果表明，与现有方法相比，本文方法在真实数据集上表现出更高的效果和优越性。",
    "tldr": "本文提出了一种新颖的基于超图强化学习的分层对话推荐模型，其中导演通过超图算法进行选择，帮助演员减少行动空间和指导对话朝着最具信息性的属性方向进行，并根据用户在对话中的偏好选择物品。",
    "en_tdlr": "This paper proposes a novel hierarchical conversational recommender based on hypergraph-based reinforcement learning, where the director selected by a hypergraph-based algorithm helps the actor to reduce the action space and guide the conversation towards the most informative attributes, and the actor selects items based on user preferences expressed in the conversation. Experimental results demonstrate the effectiveness and superiority of the proposed algorithm over state-of-the-art methods."
}