{
    "title": "Assessment of few-hits machine learning classification algorithms for low energy physics in liquid argon detectors. (arXiv:2305.09744v1 [physics.ins-det])",
    "abstract": "The physics potential of massive liquid argon TPCs in the low-energy regime is still to be fully reaped because few-hits events encode information that can hardly be exploited by conventional classification algorithms. Machine learning (ML) techniques give their best in these types of classification problems. In this paper, we evaluate their performance against conventional (deterministic) algorithms. We demonstrate that both Convolutional Neural Networks (CNN) and Transformer-Encoder methods outperform deterministic algorithms in one of the most challenging classification problems of low-energy physics (single- versus double-beta events). We discuss the advantages and pitfalls of Transformer-Encoder methods versus CNN and employ these methods to optimize the detector parameters, with an emphasis on the DUNE Phase II detectors (\"Module of Opportunity\").",
    "link": "http://arxiv.org/abs/2305.09744",
    "context": "Title: Assessment of few-hits machine learning classification algorithms for low energy physics in liquid argon detectors. (arXiv:2305.09744v1 [physics.ins-det])\nAbstract: The physics potential of massive liquid argon TPCs in the low-energy regime is still to be fully reaped because few-hits events encode information that can hardly be exploited by conventional classification algorithms. Machine learning (ML) techniques give their best in these types of classification problems. In this paper, we evaluate their performance against conventional (deterministic) algorithms. We demonstrate that both Convolutional Neural Networks (CNN) and Transformer-Encoder methods outperform deterministic algorithms in one of the most challenging classification problems of low-energy physics (single- versus double-beta events). We discuss the advantages and pitfalls of Transformer-Encoder methods versus CNN and employ these methods to optimize the detector parameters, with an emphasis on the DUNE Phase II detectors (\"Module of Opportunity\").",
    "path": "papers/23/05/2305.09744.json",
    "total_tokens": 861,
    "translated_title": "评估用于液体氩探测器低能物理的Few-Hits机器学习分类算法",
    "translated_abstract": "在低能区域，大型液体氩TPCs的物理潜力仍未充分利用，因为Few-Hits事件所编码的信息很难被传统分类算法利用。机器学习技术在这些类型的分类问题中表现最佳。本文评估了它们在传统（确定性）算法中的表现。我们证明，卷积神经网络（CNN）和Transformer-Encoder方法在低能物理中最具挑战性的分类问题（单比特与双比特事件）中优于确定性算法。我们讨论了Transformer-Encoder方法相对于CNN的优缺点，并利用这些方法优化了探测器参数，重点关注DUNE Phase II探测器（\"机会模块\"）。",
    "tldr": "本文评估了在液体氩探测器低能物理中使用Few-Hits机器学习分类算法的效果，证明在单比特与双比特事件的分类问题上，卷积神经网络和Transformer-Encoder方法优于传统算法，并针对DUNE Phase II探测器优化了探测器参数。"
}