{
    "title": "An experimental framework for designing document structure for users' decision making - An empirical study of recipes. (arXiv:2305.01359v1 [cs.DL])",
    "abstract": "Textual documents need to be of good quality to ensure effective asynchronous communication in remote areas, especially during the COVID-19 pandemic. However, defining a preferred document structure (content and arrangement) for improving lay readers' decision-making is challenging. First, the types of useful content for various readers cannot be determined simply by gathering expert knowledge. Second, methodologies to evaluate the document's usefulness from the user's perspective have not been established. This study proposed the experimental framework to identify useful contents of documents by aggregating lay readers' insights. This study used 200 online recipes as research subjects and recruited 1,340 amateur cooks as lay readers. The proposed framework identified six useful contents of recipes. Multi-level modeling then showed that among the six identified contents, suitable ingredients or notes arranged with a subheading at the end of each cooking step significantly increased rec",
    "link": "http://arxiv.org/abs/2305.01359",
    "context": "Title: An experimental framework for designing document structure for users' decision making - An empirical study of recipes. (arXiv:2305.01359v1 [cs.DL])\nAbstract: Textual documents need to be of good quality to ensure effective asynchronous communication in remote areas, especially during the COVID-19 pandemic. However, defining a preferred document structure (content and arrangement) for improving lay readers' decision-making is challenging. First, the types of useful content for various readers cannot be determined simply by gathering expert knowledge. Second, methodologies to evaluate the document's usefulness from the user's perspective have not been established. This study proposed the experimental framework to identify useful contents of documents by aggregating lay readers' insights. This study used 200 online recipes as research subjects and recruited 1,340 amateur cooks as lay readers. The proposed framework identified six useful contents of recipes. Multi-level modeling then showed that among the six identified contents, suitable ingredients or notes arranged with a subheading at the end of each cooking step significantly increased rec",
    "path": "papers/23/05/2305.01359.json",
    "total_tokens": 968,
    "translated_title": "设计用户决策文档结构的实验框架 - 以食谱为例的实证研究",
    "translated_abstract": "在远程区域进行有效的异步通信需要优质的文本文档，特别是在COVID-19大流行期间。然而，为了改善非专业读者的决策能力而定义首选的文档结构（内容和布局）具有挑战性。因为一方面，无法仅通过收集专业知识来确定各种读者有用的内容类型。而另一方面，还没有建立起从用户角度评估文档有用性的方法。本研究提出了实验性框架，通过汇集非专业读者的见解来确定文档的有用内容。本研究以200个在线食谱为研究对象，招募了1,340名业余厨师作为非专业读者。提出的框架确定了六个食谱的有用内容。多层次建模结果显示，在确认的六个内容中，每个烹饪步骤的末尾安排副标题的适当成分或注释可以显著增加食谱的可读性。",
    "tldr": "本研究提出了实验框架，通过汇集非专业读者的见解来确定文档的有用内容，以提高非专业读者的决策能力。研究结果表明，在食谱中为每个烹饪步骤的末尾安排副标题的适当成分或注释可以显著增加食谱的可读性。",
    "en_tdlr": "This study proposed an experimental framework to identify useful contents of documents by aggregating lay readers' insights in order to improve lay readers' decision-making. The study found that among the identified contents in recipes, adding suitable ingredients or notes arranged with a subheading at the end of each cooking step significantly increased the recipes' readability."
}