{
    "title": "A Preliminary Analysis on the Code Generation Capabilities of GPT-3.5 and Bard AI Models for Java Functions. (arXiv:2305.09402v1 [cs.SE])",
    "abstract": "This paper evaluates the capability of two state-of-the-art artificial intelligence (AI) models, GPT-3.5 and Bard, in generating Java code given a function description. We sourced the descriptions from CodingBat.com, a popular online platform that provides practice problems to learn programming. We compared the Java code generated by both models based on correctness, verified through the platform's own test cases. The results indicate clear differences in the capabilities of the two models. GPT-3.5 demonstrated superior performance, generating correct code for approximately 90.6% of the function descriptions, whereas Bard produced correct code for 53.1% of the functions. While both models exhibited strengths and weaknesses, these findings suggest potential avenues for the development and refinement of more advanced AI-assisted code generation tools. The study underlines the potential of AI in automating and supporting aspects of software development, although further research is requir",
    "link": "http://arxiv.org/abs/2305.09402",
    "context": "Title: A Preliminary Analysis on the Code Generation Capabilities of GPT-3.5 and Bard AI Models for Java Functions. (arXiv:2305.09402v1 [cs.SE])\nAbstract: This paper evaluates the capability of two state-of-the-art artificial intelligence (AI) models, GPT-3.5 and Bard, in generating Java code given a function description. We sourced the descriptions from CodingBat.com, a popular online platform that provides practice problems to learn programming. We compared the Java code generated by both models based on correctness, verified through the platform's own test cases. The results indicate clear differences in the capabilities of the two models. GPT-3.5 demonstrated superior performance, generating correct code for approximately 90.6% of the function descriptions, whereas Bard produced correct code for 53.1% of the functions. While both models exhibited strengths and weaknesses, these findings suggest potential avenues for the development and refinement of more advanced AI-assisted code generation tools. The study underlines the potential of AI in automating and supporting aspects of software development, although further research is requir",
    "path": "papers/23/05/2305.09402.json",
    "total_tokens": 846,
    "translated_title": "GPT-3.5和Bard AI模型在Java函数代码生成能力方面的初步分析",
    "translated_abstract": "本文评估了两个最先进的人工智能（AI）模型GPT-3.5和Bard在给定函数描述时生成Java代码的能力。我们从CodingBat.com获取了这些描述，并基于平台自己的测试用例比较了两个模型生成的Java代码的正确性。结果表明，两个模型的能力存在明显差异。GPT-3.5表现出更高的性能，对大约90.6％的函数描述生成正确的代码，而Bard仅为53.1％的函数生成了正确的代码。尽管两个模型都有优势和劣势，但这些发现为更先进的AI辅助代码生成工具的开发和改进提供了潜在途径。本研究强调了AI在自动化和支持软件开发方面的潜力，但需要进一步研究。",
    "tldr": "本文评估了GPT-3.5和Bard AI模型在生成Java代码方面的能力，结果表明GPT-3.5表现更好，为AI辅助代码生成工具的开发提供了潜在途径。"
}