{
    "title": "Coreference-aware Double-channel Attention Network for Multi-party Dialogue Reading Comprehension. (arXiv:2305.08348v2 [cs.CL] UPDATED)",
    "abstract": "We tackle Multi-party Dialogue Reading Comprehension (abbr., MDRC). MDRC stands for an extractive reading comprehension task grounded on a batch of dialogues among multiple interlocutors. It is challenging due to the requirement of understanding cross-utterance contexts and relationships in a multi-turn multi-party conversation. Previous studies have made great efforts on the utterance profiling of a single interlocutor and graph-based interaction modeling. The corresponding solutions contribute to the answer-oriented reasoning on a series of well-organized and thread-aware conversational contexts. However, the current MDRC models still suffer from two bottlenecks. On the one hand, a pronoun like \"it\" most probably produces multi-skip reasoning throughout the utterances of different interlocutors. On the other hand, an MDRC encoder is potentially puzzled by fuzzy features, i.e., the mixture of inner linguistic features in utterances and external interactive features among utterances. T",
    "link": "http://arxiv.org/abs/2305.08348",
    "context": "Title: Coreference-aware Double-channel Attention Network for Multi-party Dialogue Reading Comprehension. (arXiv:2305.08348v2 [cs.CL] UPDATED)\nAbstract: We tackle Multi-party Dialogue Reading Comprehension (abbr., MDRC). MDRC stands for an extractive reading comprehension task grounded on a batch of dialogues among multiple interlocutors. It is challenging due to the requirement of understanding cross-utterance contexts and relationships in a multi-turn multi-party conversation. Previous studies have made great efforts on the utterance profiling of a single interlocutor and graph-based interaction modeling. The corresponding solutions contribute to the answer-oriented reasoning on a series of well-organized and thread-aware conversational contexts. However, the current MDRC models still suffer from two bottlenecks. On the one hand, a pronoun like \"it\" most probably produces multi-skip reasoning throughout the utterances of different interlocutors. On the other hand, an MDRC encoder is potentially puzzled by fuzzy features, i.e., the mixture of inner linguistic features in utterances and external interactive features among utterances. T",
    "path": "papers/23/05/2305.08348.json",
    "total_tokens": 858,
    "translated_abstract": "本文研究了多方会话阅读理解(MDRC)，它是一项可基于多方对话分析的提取式阅读理解任务。由于需要理解多方对话中跨发言话语的上下文和关系，因此这是一项具有挑战性的任务。以往的研究针对单方发言者的话语特征和基于图的交互建模做了很多工作，这些解决方案有助于对一系列良好组织和线索感知的对话上下文进行针对答案的推理。然而，当前的MDRC模型仍存在两个瓶颈：一是代词“它”可能会出现跨不同发言者话语的多次推理，二是MDRC编码器可能会因话语内部语言特征和话语间外部交互特征混杂而迷惑。",
    "tldr": "本文提出了一种用于多方会话阅读理解的双通道注意力网络，能够有效解决代词和模糊特征带来的问题，提高阅读理解效果。",
    "en_tdlr": "This paper proposes a double-channel attention network for Multi-Party Dialogue Reading Comprehension, which effectively addresses the problems of pronouns and fuzzy features, and improves the performance of reading comprehension."
}