{
    "title": "CALM: Conditional Adversarial Latent Models for Directable Virtual Characters. (arXiv:2305.02195v1 [cs.CV])",
    "abstract": "In this work, we present Conditional Adversarial Latent Models (CALM), an approach for generating diverse and directable behaviors for user-controlled interactive virtual characters. Using imitation learning, CALM learns a representation of movement that captures the complexity and diversity of human motion, and enables direct control over character movements. The approach jointly learns a control policy and a motion encoder that reconstructs key characteristics of a given motion without merely replicating it. The results show that CALM learns a semantic motion representation, enabling control over the generated motions and style-conditioning for higher-level task training. Once trained, the character can be controlled using intuitive interfaces, akin to those found in video games.",
    "link": "http://arxiv.org/abs/2305.02195",
    "context": "Title: CALM: Conditional Adversarial Latent Models for Directable Virtual Characters. (arXiv:2305.02195v1 [cs.CV])\nAbstract: In this work, we present Conditional Adversarial Latent Models (CALM), an approach for generating diverse and directable behaviors for user-controlled interactive virtual characters. Using imitation learning, CALM learns a representation of movement that captures the complexity and diversity of human motion, and enables direct control over character movements. The approach jointly learns a control policy and a motion encoder that reconstructs key characteristics of a given motion without merely replicating it. The results show that CALM learns a semantic motion representation, enabling control over the generated motions and style-conditioning for higher-level task training. Once trained, the character can be controlled using intuitive interfaces, akin to those found in video games.",
    "path": "papers/23/05/2305.02195.json",
    "total_tokens": 770,
    "translated_title": "条件对抗潜在模型用于可直接操控虚拟角色生成",
    "translated_abstract": "本文提出了条件对抗潜在模型（CALM），一种用于生成多样化可直接操控虚拟角色行为的方法。使用模仿学习，CALM学习了一种能够捕捉人类运动复杂性和多样性的运动表示方法，并且实现了对角色动作的直接控制。该方法联合学习控制策略和运动编码器，重建给定运动的关键特征，而不仅仅是复制它。结果表明，CALM学习了一种语义运动表示方法，可以通过直观的界面控制生成的运动，适合更高层次的任务训练。一旦训练完成，角色可以使用类似于视频游戏的直观界面进行控制。",
    "tldr": "本文提出了CALM方法，通过模仿学习实现了对虚拟角色动作的直接控制，并可以进行样式条件训练，该方法学习了一种丰富复杂的语义运动表示。",
    "en_tdlr": "This paper presents CALM, an approach that uses imitation learning to achieve direct control over virtual character movements, enabling style-conditioning for higher-level task training, and learning a complex semantic motion representation."
}