{
    "title": "Explainable Parallel RCNN with Novel Feature Representation for Time Series Forecasting. (arXiv:2305.04876v2 [cs.LG] UPDATED)",
    "abstract": "Accurate time series forecasting is a fundamental challenge in data science. It is often affected by external covariates such as weather or human intervention, which in many applications, may be predicted with reasonable accuracy. We refer to them as predicted future covariates. However, existing methods that attempt to predict time series in an iterative manner with autoregressive models end up with exponential error accumulations. Other strategies hat consider the past and future in the encoder and decoder respectively limit themselves by dealing with the historical and future data separately. To address these limitations, a novel feature representation strategy -- shifting -- is proposed to fuse the past data and future covariates such that their interactions can be considered. To extract complex dynamics in time series, we develop a parallel deep learning framework composed of RNN and CNN, both of which are used hierarchically. We also utilize the skip connection technique to impro",
    "link": "http://arxiv.org/abs/2305.04876",
    "context": "Title: Explainable Parallel RCNN with Novel Feature Representation for Time Series Forecasting. (arXiv:2305.04876v2 [cs.LG] UPDATED)\nAbstract: Accurate time series forecasting is a fundamental challenge in data science. It is often affected by external covariates such as weather or human intervention, which in many applications, may be predicted with reasonable accuracy. We refer to them as predicted future covariates. However, existing methods that attempt to predict time series in an iterative manner with autoregressive models end up with exponential error accumulations. Other strategies hat consider the past and future in the encoder and decoder respectively limit themselves by dealing with the historical and future data separately. To address these limitations, a novel feature representation strategy -- shifting -- is proposed to fuse the past data and future covariates such that their interactions can be considered. To extract complex dynamics in time series, we develop a parallel deep learning framework composed of RNN and CNN, both of which are used hierarchically. We also utilize the skip connection technique to impro",
    "path": "papers/23/05/2305.04876.json",
    "total_tokens": 1023,
    "translated_title": "可解释的平行RCNN与新颖特征表示法用于时间序列预测",
    "translated_abstract": "准确的时间序列预测是数据科学中的基本挑战。往往会受到外部协变量，例如天气或人类干预的影响，这些影响可以在许多应用中被合理地预测。我们将它们称为预测的未来协变量。然而，现有的尝试使用自回归模型迭代预测时间序列的方法最终会导致指数级的误差累积。其他考虑用编码器和解码器分别处理历史和未来数据的策略会对自己产生限制。为了解决这些限制，我们提出了一种新的特征表示策略——移位法，将过去的数据和未来协变量融合起来以考虑它们的相互作用。为了提取时间序列中的复杂动力学，我们开发了一个并行的深度学习框架，由RNN和CNN组成，二者都被层级地使用。同时，我们还运用了跳跃连接技术来提高模型的训练效率和精度。最后，我们提出了一种可解释的方法来解释模型的特征重要性，为时间序列的底层过程提供了洞见。",
    "tldr": "本论文提出了一种新的特征表示策略——移位法，将过去数据和未来协变量融合起来进行时间序列预测，并开发了一个并行的深度学习框架，同时提出了一种可解释的方法来解释模型的特征重要性。",
    "en_tdlr": "This paper proposes a novel feature representation strategy called shifting to fuse past data and future covariates and develop a parallel deep learning framework composed of RNN and CNN for accurate time series forecasting. An explainable approach is also proposed to interpret the model's feature importance."
}