{
    "title": "Preference or Intent? Double Disentangled Collaborative Filtering. (arXiv:2305.11084v1 [cs.IR])",
    "abstract": "People usually have different intents for choosing items, while their preferences under the same intent may also different. In traditional collaborative filtering approaches, both intent and preference factors are usually entangled in the modeling process, which significantly limits the robustness and interpretability of recommendation performances. For example, the low-rating items are always treated as negative feedback while they actually could provide positive information about user intent. To this end, in this paper, we propose a two-fold representation learning approach, namely Double Disentangled Collaborative Filtering (DDCF), for personalized recommendations. The first-level disentanglement is for separating the influence factors of intent and preference, while the second-level disentanglement is performed to build independent sparse preference representations under individual intent with limited computational complexity. Specifically, we employ two variational autoencoder net",
    "link": "http://arxiv.org/abs/2305.11084",
    "context": "Title: Preference or Intent? Double Disentangled Collaborative Filtering. (arXiv:2305.11084v1 [cs.IR])\nAbstract: People usually have different intents for choosing items, while their preferences under the same intent may also different. In traditional collaborative filtering approaches, both intent and preference factors are usually entangled in the modeling process, which significantly limits the robustness and interpretability of recommendation performances. For example, the low-rating items are always treated as negative feedback while they actually could provide positive information about user intent. To this end, in this paper, we propose a two-fold representation learning approach, namely Double Disentangled Collaborative Filtering (DDCF), for personalized recommendations. The first-level disentanglement is for separating the influence factors of intent and preference, while the second-level disentanglement is performed to build independent sparse preference representations under individual intent with limited computational complexity. Specifically, we employ two variational autoencoder net",
    "path": "papers/23/05/2305.11084.json",
    "total_tokens": 856,
    "translated_title": "偏好还是意图？双重解缠协同过滤",
    "translated_abstract": "人们选择物品时通常有不同的意图，而在相同意图下他们的偏好也可能不同。传统的协同过滤方法通常将意图和偏好因素纠缠在建模过程中，这显著限制了推荐性能的稳健性和可解释性。为了解决这一问题，本文提出了一种名为双重解缠协同过滤（DDCF）的个性化推荐方法。一级解缠是为了将意图和偏好的影响因素分开，而第二级解缠是为了构建独立的稀疏偏好表示。实验结果表明，DDCF方法在推荐精度和可解释性方面均优于现有方法。",
    "tldr": "本文提出了一种双重解缠协同过滤（DDCF）方法，该方法能够对意图和偏好因素进行分离，并通过解缠表示建立独立的稀疏偏好表示，从而提供更准确和可解释性的个性化推荐。",
    "en_tdlr": "This paper proposes a Double Disentangled Collaborative Filtering (DDCF) method that can separate intent and preference factors and establish independent sparse representations of preferences through disentanglement, providing more accurate and interpretable personalized recommendations."
}