{
    "title": "Materials Informatics: An Algorithmic Design Rule. (arXiv:2305.03797v1 [cond-mat.mtrl-sci])",
    "abstract": "Materials informatics, data-enabled investigation, is a \"fourth paradigm\" in materials science research after the conventional empirical approach, theoretical science, and computational research. Materials informatics has two essential ingredients: fingerprinting materials proprieties and the theory of statistical inference and learning. We have researched the organic semiconductor's enigmas through the materials informatics approach. By applying diverse neural network topologies, logical axiom, and inferencing information science, we have developed data-driven procedures for novel organic semiconductor discovery for the semiconductor industry and knowledge extraction for the materials science community. We have reviewed and corresponded with various algorithms for the neural network design topology for the materials informatics dataset.",
    "link": "http://arxiv.org/abs/2305.03797",
    "context": "Title: Materials Informatics: An Algorithmic Design Rule. (arXiv:2305.03797v1 [cond-mat.mtrl-sci])\nAbstract: Materials informatics, data-enabled investigation, is a \"fourth paradigm\" in materials science research after the conventional empirical approach, theoretical science, and computational research. Materials informatics has two essential ingredients: fingerprinting materials proprieties and the theory of statistical inference and learning. We have researched the organic semiconductor's enigmas through the materials informatics approach. By applying diverse neural network topologies, logical axiom, and inferencing information science, we have developed data-driven procedures for novel organic semiconductor discovery for the semiconductor industry and knowledge extraction for the materials science community. We have reviewed and corresponded with various algorithms for the neural network design topology for the materials informatics dataset.",
    "path": "papers/23/05/2305.03797.json",
    "total_tokens": 798,
    "translated_title": "材料信息学：算法设计规则。",
    "translated_abstract": "材料信息学是材料科学研究中的第四个范式，是传统经验方法、理论科学和计算研究之后的数据驱动的研究方法。材料信息学的基本要素有两个：材料特性指纹和统计推断学习理论。我们运用了多种神经网络拓扑、逻辑公理和推理信息科学等方法，通过材料信息学方法研究了有机半导体的谜团，并开发了数据驱动的程序，以实现半导体工业的新型有机半导体发现和材料科学界的知识提取。我们还对材料信息学数据集的神经网络设计拓扑方式进行了综述和相关研究。",
    "tldr": "材料信息学是材料科学研究中的第四个范式，通过材料特性指纹和统计推断学习理论，结合神经网络拓扑、逻辑公理和推理信息科学等方法，可以实现有机半导体的新型发现和知识提取。",
    "en_tdlr": "Materials informatics is a fourth paradigm in materials science research, which enables data-driven approach through fingerprinting materials proprieties and the theory of statistical inference and learning. By utilizing diverse neural network topologies, logical axiom, and inferencing information science, it can enable discovery of novel organic semiconductors for the semiconductor industry and knowledge extraction for the materials science community."
}