{
    "title": "PANNA 2.0: Efficient neural network interatomic potentials and new architectures. (arXiv:2305.11805v1 [physics.comp-ph])",
    "abstract": "We present the latest release of PANNA 2.0 (Properties from Artificial Neural Network Architectures), a code for the generation of neural network interatomic potentials based on local atomic descriptors and multilayer perceptrons. Built on a new back end, this new release of PANNA features improved tools for customizing and monitoring network training, better GPU support including a fast descriptor calculator, new plugins for external codes and a new architecture for the inclusion of long-range electrostatic interactions through a variational charge equilibration scheme. We present an overview of the main features of the new code, and several benchmarks comparing the accuracy of PANNA models to the state of the art, on commonly used benchmarks as well as richer datasets.",
    "link": "http://arxiv.org/abs/2305.11805",
    "context": "Title: PANNA 2.0: Efficient neural network interatomic potentials and new architectures. (arXiv:2305.11805v1 [physics.comp-ph])\nAbstract: We present the latest release of PANNA 2.0 (Properties from Artificial Neural Network Architectures), a code for the generation of neural network interatomic potentials based on local atomic descriptors and multilayer perceptrons. Built on a new back end, this new release of PANNA features improved tools for customizing and monitoring network training, better GPU support including a fast descriptor calculator, new plugins for external codes and a new architecture for the inclusion of long-range electrostatic interactions through a variational charge equilibration scheme. We present an overview of the main features of the new code, and several benchmarks comparing the accuracy of PANNA models to the state of the art, on commonly used benchmarks as well as richer datasets.",
    "path": "papers/23/05/2305.11805.json",
    "total_tokens": 776,
    "translated_title": "PANNA 2.0: 高效的神经网络原子间势及其新架构（arXiv:2305.11805v1 [physics.comp-ph]）",
    "translated_abstract": "我们介绍了PANNA 2.0（基于局部原子描述符和多层感知机的神经网络原子间势生成代码）的最新版本。该版本基于新的后端构建，具有改进的工具，可自定义和监测网络训练，支持更好的GPU，包括快速描述符计算器，针对外部代码的新插件以及通过变分电荷均衡方案包括长程静电相互作用的新架构。我们总结了新代码的主要特点，并对 PANNA 模型的精度进行了若干基准测试，比较其与现有技术的表现，包括常用基准数据集和丰富数据集。",
    "tldr": "PANNA 2.0是一个基于神经网络的原子间势生成代码，具有更好的GPU支持和自定义工具，并通过变分电荷均衡方案解决了长程静电相互作用问题。",
    "en_tdlr": "PANNA 2.0 is a code for generating interatomic potentials based on neural networks, which features better GPU support and customized tools and solves the long-range electrostatic interaction problem through a variational charge equilibration scheme."
}