{
    "title": "CHIC: Corporate Document for Visual question Answering. (arXiv:2305.01054v1 [cs.DB])",
    "abstract": "The massive use of digital documents due to the substantial trend of paperless initiatives confronted some companies to find ways to process thousands of documents per day automatically. To achieve this, they use automatic information retrieval (IR) allowing them to extract useful information from large datasets quickly. In order to have effective IR methods, it is first necessary to have an adequate dataset. Although companies have enough data to take into account their needs, there is also a need for a public database to compare contributions between state-of-the-art methods. Public data on the document exists as DocVQA[2] and XFUND [10], but these do not fully satisfy the needs of companies. XFUND contains only form documents while the company uses several types of documents (i.e. structured documents like forms but also semi-structured as invoices, and unstructured as emails). Compared to XFUND, DocVQA has several types of documents but only 4.5% of them are corporate documents (i.",
    "link": "http://arxiv.org/abs/2305.01054",
    "context": "Title: CHIC: Corporate Document for Visual question Answering. (arXiv:2305.01054v1 [cs.DB])\nAbstract: The massive use of digital documents due to the substantial trend of paperless initiatives confronted some companies to find ways to process thousands of documents per day automatically. To achieve this, they use automatic information retrieval (IR) allowing them to extract useful information from large datasets quickly. In order to have effective IR methods, it is first necessary to have an adequate dataset. Although companies have enough data to take into account their needs, there is also a need for a public database to compare contributions between state-of-the-art methods. Public data on the document exists as DocVQA[2] and XFUND [10], but these do not fully satisfy the needs of companies. XFUND contains only form documents while the company uses several types of documents (i.e. structured documents like forms but also semi-structured as invoices, and unstructured as emails). Compared to XFUND, DocVQA has several types of documents but only 4.5% of them are corporate documents (i.",
    "path": "papers/23/05/2305.01054.json",
    "total_tokens": 793,
    "translated_title": "CHIC: 企业文档可视化问答",
    "translated_abstract": "数字化文件的广泛使用，由于无纸化倡议的显著趋势，迫使一些公司寻找自动处理每天数以千计文档的方法。为了实现这一点，它们使用自动信息检索（IR），使它们能够快速从庞大的数据集中提取有用信息。然而，在实现有效的IR方法之前，首先需要有一个足够的数据集。尽管公司有足够的数据以满足其需求，但还需要一个公共数据库来比较最先进的方法。文档的公共数据存在于DocVQA[2]和XFUND [10]中，但这些都不能完全满足公司的需求。与XFUND相比，DocVQA有几种类型的文件，但只有4.5％的文件是企业文件（即结构化文件，如表格、半结构化文件，如发票，以及非结构化文件，如电子邮件）。",
    "tldr": "CHIC提供了一个公共企业文档问答数据库，以满足不同类型企业文件的需求。",
    "en_tdlr": "CHIC provides a public corporate document QA database to meet the needs of different types of corporate documents."
}