{
    "title": "Multilingual Event Extraction from Historical Newspaper Adverts. (arXiv:2305.10928v1 [cs.CL])",
    "abstract": "NLP methods can aid historians in analyzing textual materials in greater volumes than manually feasible. Developing such methods poses substantial challenges though. First, acquiring large, annotated historical datasets is difficult, as only domain experts can reliably label them. Second, most available off-the-shelf NLP models are trained on modern language texts, rendering them significantly less effective when applied to historical corpora. This is particularly problematic for less well studied tasks, and for languages other than English. This paper addresses these challenges while focusing on the under-explored task of event extraction from a novel domain of historical texts. We introduce a new multilingual dataset in English, French, and Dutch composed of newspaper ads from the early modern colonial period reporting on enslaved people who liberated themselves from enslavement. We find that: 1) even with scarce annotated data, it is possible to achieve surprisingly good results by ",
    "link": "http://arxiv.org/abs/2305.10928",
    "context": "Title: Multilingual Event Extraction from Historical Newspaper Adverts. (arXiv:2305.10928v1 [cs.CL])\nAbstract: NLP methods can aid historians in analyzing textual materials in greater volumes than manually feasible. Developing such methods poses substantial challenges though. First, acquiring large, annotated historical datasets is difficult, as only domain experts can reliably label them. Second, most available off-the-shelf NLP models are trained on modern language texts, rendering them significantly less effective when applied to historical corpora. This is particularly problematic for less well studied tasks, and for languages other than English. This paper addresses these challenges while focusing on the under-explored task of event extraction from a novel domain of historical texts. We introduce a new multilingual dataset in English, French, and Dutch composed of newspaper ads from the early modern colonial period reporting on enslaved people who liberated themselves from enslavement. We find that: 1) even with scarce annotated data, it is possible to achieve surprisingly good results by ",
    "path": "papers/23/05/2305.10928.json",
    "total_tokens": 1157,
    "translated_title": "历史报纸广告中的多语言事件提取",
    "translated_abstract": "自然语言处理可以帮助历史学家分析比手工可行得多的文本材料。然而，开发这种方法有着实际的挑战。首先，获取大型注释历史文本数据集非常困难，因为只有专业领域的专家才能可靠地注释。其次，大部分现有的自然语言处理模型是在现代语言文本上训练的，因此在应用于历史语料库时效果显著降低。这对较少研究的任务以及非英语语言来说尤其棘手。本文针对这些挑战，聚焦于历史文本领域中未被充分开发的事件提取任务。我们介绍了一个新的多语言数据集，其中包括英语、法语和荷兰语，由早期殖民时期的报纸广告构成，报道了从奴役中自由的被奴役人。我们发现：即使数据注释很少，通过从现代数据集进行迁移学习和领域自适应技术，也可以获得出人意料的好结果；所提出的模型提供了新的洞察力，展示了该时期奴役话语的语言使用和模式；同时，语言迁移可以有效用于历史文本中的多语言事件提取。",
    "tldr": "本文针对历史文本中未被充分开发的事件提取任务，介绍了一个新的多语言数据集，通过迁移学习和领域自适应技术，即使数据注释很少也可以获得出人意料的好结果。同时，所提出的模型提供了新的洞察力，展示了该时期奴役话语的语言使用和模式。研究表明，语言迁移可以有效用于历史文本中的多语言事件提取。",
    "en_tdlr": "This paper introduces a new multilingual dataset composed of historical newspaper ads reporting on enslaved people who liberated themselves from enslavement and proposes a method for event extraction from historical texts using transfer learning and domain adaptation techniques. The results show that even with limited annotated data, the proposed models can achieve good performance and provide new insights into the language use and patterns of enslavement discourse during the period. The study also shows that language transfer can be effectively used for multilingual event extraction in historical texts."
}