{
    "title": "A Conditional Denoising Diffusion Probabilistic Model for Radio Interferometric Image Reconstruction. (arXiv:2305.09121v1 [astro-ph.IM])",
    "abstract": "In radio astronomy, signals from radio telescopes are transformed into images of observed celestial objects, or sources. However, these images, called dirty images, contain real sources as well as artifacts due to signal sparsity and other factors. Therefore, radio interferometric image reconstruction is performed on dirty images, aiming to produce clean images in which artifacts are reduced and real sources are recovered. So far, existing methods have limited success on recovering faint sources, preserving detailed structures, and eliminating artifacts. In this paper, we present VIC-DDPM, a Visibility and Image Conditioned Denoising Diffusion Probabilistic Model. Our main idea is to use both the original visibility data in the spectral domain and dirty images in the spatial domain to guide the image generation process with DDPM. This way, we can leverage DDPM to generate fine details and eliminate noise, while utilizing visibility data to separate signals from noise and retaining spat",
    "link": "http://arxiv.org/abs/2305.09121",
    "context": "Title: A Conditional Denoising Diffusion Probabilistic Model for Radio Interferometric Image Reconstruction. (arXiv:2305.09121v1 [astro-ph.IM])\nAbstract: In radio astronomy, signals from radio telescopes are transformed into images of observed celestial objects, or sources. However, these images, called dirty images, contain real sources as well as artifacts due to signal sparsity and other factors. Therefore, radio interferometric image reconstruction is performed on dirty images, aiming to produce clean images in which artifacts are reduced and real sources are recovered. So far, existing methods have limited success on recovering faint sources, preserving detailed structures, and eliminating artifacts. In this paper, we present VIC-DDPM, a Visibility and Image Conditioned Denoising Diffusion Probabilistic Model. Our main idea is to use both the original visibility data in the spectral domain and dirty images in the spatial domain to guide the image generation process with DDPM. This way, we can leverage DDPM to generate fine details and eliminate noise, while utilizing visibility data to separate signals from noise and retaining spat",
    "path": "papers/23/05/2305.09121.json",
    "total_tokens": 995,
    "translated_title": "一种用于射电干涉成像重建的条件去噪扩散概率模型",
    "translated_abstract": "在射电天文学中，射电望远镜接收到的信号会转换为天体对象的图像。但这些图像通常会包含伪源和其他因素导致的伪影，称为“脏图像”。因此，需要对脏图像进行重建以获取更干净的图像并消除伪影。然而，现有的方法在恢复微弱信号，保留细节结构和消除伪影方面存在一定的局限性。本文提出了一种名为VIC-DDPM的可见度和图像条件下的去噪扩散概率模型。该模型同时利用时域和空域的信息来生成图像，以达到消除噪声和生成更细节的图像的目的。实验证实，我们的算法在峰值信噪比、视觉质量和恢复微弱信号的能力方面优于当前的最先进算法。",
    "tldr": "本文提出了一种名为VIC-DDPM的条件去噪扩散概率模型，在可见度数据和脏图像的帮助下，能够生成更细节的图像，同时消除噪声和伪影。相关实验证实，该算法在恢复微弱信号、保留细节结构和消除伪影等方面有很好的性能。"
}