{
    "title": "Inferring the past: a combined CNN-LSTM deep learning framework to fuse satellites for historical inundation mapping. (arXiv:2305.00640v1 [cs.CV])",
    "abstract": "Mapping floods using satellite data is crucial for managing and mitigating flood risks. Satellite imagery enables rapid and accurate analysis of large areas, providing critical information for emergency response and disaster management. Historical flood data derived from satellite imagery can inform long-term planning, risk management strategies, and insurance-related decisions. The Sentinel-1 satellite is effective for flood detection, but for longer time series, other satellites such as MODIS can be used in combination with deep learning models to accurately identify and map past flood events. We here develop a combined CNN--LSTM deep learning framework to fuse Sentinel-1 derived fractional flooded area with MODIS data in order to infer historical floods over Bangladesh. The results show how our framework outperforms a CNN-only approach and takes advantage of not only space, but also time in order to predict the fractional inundated area. The model is applied to historical MODIS data",
    "link": "http://arxiv.org/abs/2305.00640",
    "context": "Title: Inferring the past: a combined CNN-LSTM deep learning framework to fuse satellites for historical inundation mapping. (arXiv:2305.00640v1 [cs.CV])\nAbstract: Mapping floods using satellite data is crucial for managing and mitigating flood risks. Satellite imagery enables rapid and accurate analysis of large areas, providing critical information for emergency response and disaster management. Historical flood data derived from satellite imagery can inform long-term planning, risk management strategies, and insurance-related decisions. The Sentinel-1 satellite is effective for flood detection, but for longer time series, other satellites such as MODIS can be used in combination with deep learning models to accurately identify and map past flood events. We here develop a combined CNN--LSTM deep learning framework to fuse Sentinel-1 derived fractional flooded area with MODIS data in order to infer historical floods over Bangladesh. The results show how our framework outperforms a CNN-only approach and takes advantage of not only space, but also time in order to predict the fractional inundated area. The model is applied to historical MODIS data",
    "path": "papers/23/05/2305.00640.json",
    "total_tokens": 925,
    "translated_title": "推算历史洪水: 整合CNN-LSTM深度学习框架，融合卫星数据进行历史淹没地图制作",
    "translated_abstract": "利用卫星数据绘制洪水地图对于管理和减轻洪水风险至关重要。卫星图像能够快速准确地分析大面积区域，为应急响应和灾害管理提供重要信息。从卫星图像中获取的历史洪水数据可以为长期规划、风险管理策略和与保险相关的决策提供信息。Sentinel-1卫星对于洪水监测非常有效，但对于较长的时间序列，可以将其他卫星如MODIS与深度学习模型相结合，准确识别和绘制过去的洪水事件。我们将开发一个整合了CNN-LSTM深度学习框架的模型来将Sentinel-1产生的部分被淹没区域与MODIS数据进行融合，以便在孟加拉国推算历史洪水。结果显示，我们的模型优于仅使用CNN的方法，并利用时空信息来预测部分淹没区域。该模型应用于历史MODIS数据。",
    "tldr": "本文提出了一种整合CNN-LSTM深度学习框架的方法，将Sentinel-1卫星数据和MODIS数据融合，以推算孟加拉国历史洪水的部分淹没区域。",
    "en_tdlr": "This paper proposes a combined CNN-LSTM deep learning framework to fuse Sentinel-1 and MODIS data for historical flood mapping, outperforming CNN-only approaches by utilizing both space and time information to predict the fractional inundated area over Bangladesh."
}