{
    "title": "Echo from noise: synthetic ultrasound image generation using diffusion models for real image segmentation. (arXiv:2305.05424v1 [eess.IV])",
    "abstract": "We propose a novel pipeline for the generation of synthetic images via Denoising Diffusion Probabilistic Models (DDPMs) guided by cardiac ultrasound semantic label maps. We show that these synthetic images can serve as a viable substitute for real data in the training of deep-learning models for medical image analysis tasks such as image segmentation. To demonstrate the effectiveness of this approach, we generated synthetic 2D echocardiography images and trained a neural network for segmentation of the left ventricle and left atrium. The performance of the network trained on exclusively synthetic images was evaluated on an unseen dataset of real images and yielded mean Dice scores of 88.5 $\\pm 6.0$ , 92.3 $\\pm 3.9$, 86.3 $\\pm 10.7$ \\% for left ventricular endocardial, epicardial and left atrial segmentation respectively. This represents an increase of $9.09$, $3.7$ and $15.0$ \\% in Dice scores compared to the previous state-of-the-art. The proposed pipeline has the potential for applic",
    "link": "http://arxiv.org/abs/2305.05424",
    "context": "Title: Echo from noise: synthetic ultrasound image generation using diffusion models for real image segmentation. (arXiv:2305.05424v1 [eess.IV])\nAbstract: We propose a novel pipeline for the generation of synthetic images via Denoising Diffusion Probabilistic Models (DDPMs) guided by cardiac ultrasound semantic label maps. We show that these synthetic images can serve as a viable substitute for real data in the training of deep-learning models for medical image analysis tasks such as image segmentation. To demonstrate the effectiveness of this approach, we generated synthetic 2D echocardiography images and trained a neural network for segmentation of the left ventricle and left atrium. The performance of the network trained on exclusively synthetic images was evaluated on an unseen dataset of real images and yielded mean Dice scores of 88.5 $\\pm 6.0$ , 92.3 $\\pm 3.9$, 86.3 $\\pm 10.7$ \\% for left ventricular endocardial, epicardial and left atrial segmentation respectively. This represents an increase of $9.09$, $3.7$ and $15.0$ \\% in Dice scores compared to the previous state-of-the-art. The proposed pipeline has the potential for applic",
    "path": "papers/23/05/2305.05424.json",
    "total_tokens": 1016,
    "translated_title": "来自噪声的回音：基于扩散模型的合成超声图像生成用于实际图像分割",
    "translated_abstract": "我们提出了一种新的方法，通过使用基于去噪扩散概率模型（DDPM）和心脏超声语义标签地图生成合成图像。我们展示出这些合成图像可以作为深度学习模型在医学图像分析任务中的有效替代品，如图像分割。为了证明这种方法的有效性，我们生成了合成的2D心脏超声图像并训练了一个神经网络对左心室和左房进行分割。在仅使用合成图像进行训练的情况下，所训练的神经网络在未见过的真实图像数据集上对左心室内膜、心外膜和左心房的分割分别产生了88.5±6.0％、92.3±3.9％和86.3±10.7％的平均Dice分数。这比先前最先进的方法相比提高了9.09％、3.7％和15.0％。该提议的方法在应用领域具有潜力。",
    "tldr": "该论文提出了一种基于DDPM的方法来生成合成超声图像，用于医学图像分析任务中的有效替代品。在左心室和左房分割任务中，使用仅合成图像训练的神经网络相对于之前最先进方法提高了9.09％、3.7％和15.0％的Dice分数。",
    "en_tdlr": "This paper proposes a DDPM-based method for generating synthetic ultrasound images as an effective substitute for real data in medical image analysis. The neural network trained with only synthetic images achieved improved Dice scores of 9.09%, 3.7%, and 15.0% in segmentation of left ventricle and left atrium compared to the previous state-of-the-art."
}