{
    "title": "Cross2StrA: Unpaired Cross-lingual Image Captioning with Cross-lingual Cross-modal Structure-pivoted Alignment. (arXiv:2305.12260v2 [cs.CV] UPDATED)",
    "abstract": "Unpaired cross-lingual image captioning has long suffered from irrelevancy and disfluency issues, due to the inconsistencies of the semantic scene and syntax attributes during transfer. In this work, we propose to address the above problems by incorporating the scene graph (SG) structures and the syntactic constituency (SC) trees. Our captioner contains the semantic structure-guided image-to-pivot captioning and the syntactic structure-guided pivot-to-target translation, two of which are joined via pivot language. We then take the SG and SC structures as pivoting, performing cross-modal semantic structure alignment and cross-lingual syntactic structure alignment learning. We further introduce cross-lingual&cross-modal back-translation training to fully align the captioning and translation stages. Experiments on English-Chinese transfers show that our model shows great superiority in improving captioning relevancy and fluency.",
    "link": "http://arxiv.org/abs/2305.12260",
    "context": "Title: Cross2StrA: Unpaired Cross-lingual Image Captioning with Cross-lingual Cross-modal Structure-pivoted Alignment. (arXiv:2305.12260v2 [cs.CV] UPDATED)\nAbstract: Unpaired cross-lingual image captioning has long suffered from irrelevancy and disfluency issues, due to the inconsistencies of the semantic scene and syntax attributes during transfer. In this work, we propose to address the above problems by incorporating the scene graph (SG) structures and the syntactic constituency (SC) trees. Our captioner contains the semantic structure-guided image-to-pivot captioning and the syntactic structure-guided pivot-to-target translation, two of which are joined via pivot language. We then take the SG and SC structures as pivoting, performing cross-modal semantic structure alignment and cross-lingual syntactic structure alignment learning. We further introduce cross-lingual&cross-modal back-translation training to fully align the captioning and translation stages. Experiments on English-Chinese transfers show that our model shows great superiority in improving captioning relevancy and fluency.",
    "path": "papers/23/05/2305.12260.json",
    "total_tokens": 1024,
    "translated_title": "Cross2StrA: 基于跨语言交叉模态结构枢纽对进行非配对跨语言图像字幕生成",
    "translated_abstract": "由于转移过程中语义场景和语法属性的不一致性，非配对跨语言图像字幕生成长期以来一直面临着不相关和语法不流畅等问题。在本研究中，我们提出通过结合场景图和句法句子树结构来解决以上问题。我们的字幕生成器包含语义结构引导的图像到枢纽（英文）字幕生成和语法结构引导下的枢纽（中文）到目标语言（中文）翻译，两者之间通过枢纽语言连接。我们使用场景图和句法句子树结构作为枢纽对跨模式语义结构对齐和跨语言语法结构对齐进行学习。我们还引入了跨语言和跨模式的返译训练，以完全对齐字幕生成和翻译阶段。在英汉转移实验中，我们的模型在提高字幕生成相关性和流畅性方面表现出极高的优越性。",
    "tldr": "本论文提出了一种基于跨语言交叉模态结构枢纽对跨语言图像字幕生成的方法，通过结合场景图和句法句子树结构来提高字幕生成相关性和流畅性，并使用跨语言和跨模式的返译训练以完全对齐字幕生成和翻译阶段。",
    "en_tdlr": "This paper proposes a method for unpaired cross-lingual image captioning using cross-lingual cross-modal structure-pivoted alignment. By incorporating scene graph and syntactic constituency tree structures, the model improves the relevancy and fluency of captioning and performs cross-modal semantic structure alignment and cross-lingual syntactic structure alignment learning. Cross-lingual&cross-modal back-translation training is introduced to fully align the captioning and translation stages. The model shows great superiority in English-Chinese transfers."
}