{
    "title": "The Effects of Political Martyrdom on Election Results: The Assassination of Abe. (arXiv:2305.18004v2 [cs.CL] UPDATED)",
    "abstract": "In developed nations assassinations are rare and thus the impact of such acts on the electoral and political landscape is understudied. In this paper, we focus on Twitter data to examine the effects of Japan's former Primer Minister Abe's assassination on the Japanese House of Councillors elections in 2022. We utilize sentiment analysis and emotion detection together with topic modeling on over 2 million tweets and compare them against tweets during previous election cycles. Our findings indicate that Twitter sentiments were negatively impacted by the event in the short term and that social media attention span has shortened. We also discuss how \"necropolitics\" affected the outcome of the elections in favor of the deceased's party meaning that there seems to have been an effect of Abe's death on the election outcome though the findings warrant further investigation for conclusive results.",
    "link": "http://arxiv.org/abs/2305.18004",
    "context": "Title: The Effects of Political Martyrdom on Election Results: The Assassination of Abe. (arXiv:2305.18004v2 [cs.CL] UPDATED)\nAbstract: In developed nations assassinations are rare and thus the impact of such acts on the electoral and political landscape is understudied. In this paper, we focus on Twitter data to examine the effects of Japan's former Primer Minister Abe's assassination on the Japanese House of Councillors elections in 2022. We utilize sentiment analysis and emotion detection together with topic modeling on over 2 million tweets and compare them against tweets during previous election cycles. Our findings indicate that Twitter sentiments were negatively impacted by the event in the short term and that social media attention span has shortened. We also discuss how \"necropolitics\" affected the outcome of the elections in favor of the deceased's party meaning that there seems to have been an effect of Abe's death on the election outcome though the findings warrant further investigation for conclusive results.",
    "path": "papers/23/05/2305.18004.json",
    "total_tokens": 949,
    "translated_title": "政治殉道对选举结果的影响：阿贝遇刺事件的研究",
    "translated_abstract": "在发达国家，暗杀行为很少，因此对此类行为对选举和政治格局的影响知之甚少。本研究利用推特数据，研究日本前首相阿贝的暗杀事件对2022年日本参议院选举的影响。我们对200万条推文进行情感分析、情绪检测和主题建模，并与前几次选举周期的推文进行比较。研究结果表明，暗杀事件短期内对推特情绪产生了负面影响，同时社交媒体的关注时间也变得更短。我们还讨论了“死亡政治”如何影响选举结果，表明阿贝之死似乎对选举结果产生了影响，但研究结果还需要进一步调查以得出确切结论。",
    "tldr": "这项研究通过分析推特数据研究了日本前首相阿贝的暗杀事件对2022年日本参议院选举的影响。研究发现，暗杀事件短期内对推特情绪产生了负面影响，并且社交媒体的关注时间也变得更短。此外，研究还发现阿贝之死对选举结果产生了影响，但需要进一步调查以得出确切结论。"
}