{
    "title": "Trompt: Towards a Better Deep Neural Network for Tabular Data. (arXiv:2305.18446v1 [cs.LG])",
    "abstract": "Tabular data is arguably one of the most commonly used data structures in various practical domains, including finance, healthcare and e-commerce. The inherent heterogeneity allows tabular data to store rich information. However, based on a recently published tabular benchmark, we can see deep neural networks still fall behind tree-based models on tabular datasets. In this paper, we propose Trompt--which stands for Tabular Prompt--a novel architecture inspired by prompt learning of language models. The essence of prompt learning is to adjust a large pre-trained model through a set of prompts outside the model without directly modifying the model. Based on this idea, Trompt separates the learning strategy of tabular data into two parts. The first part, analogous to pre-trained models, focus on learning the intrinsic information of a table. The second part, analogous to prompts, focus on learning the variations among samples. Trompt is evaluated with the benchmark mentioned above. The ex",
    "link": "http://arxiv.org/abs/2305.18446",
    "context": "Title: Trompt: Towards a Better Deep Neural Network for Tabular Data. (arXiv:2305.18446v1 [cs.LG])\nAbstract: Tabular data is arguably one of the most commonly used data structures in various practical domains, including finance, healthcare and e-commerce. The inherent heterogeneity allows tabular data to store rich information. However, based on a recently published tabular benchmark, we can see deep neural networks still fall behind tree-based models on tabular datasets. In this paper, we propose Trompt--which stands for Tabular Prompt--a novel architecture inspired by prompt learning of language models. The essence of prompt learning is to adjust a large pre-trained model through a set of prompts outside the model without directly modifying the model. Based on this idea, Trompt separates the learning strategy of tabular data into two parts. The first part, analogous to pre-trained models, focus on learning the intrinsic information of a table. The second part, analogous to prompts, focus on learning the variations among samples. Trompt is evaluated with the benchmark mentioned above. The ex",
    "path": "papers/23/05/2305.18446.json",
    "total_tokens": 884,
    "translated_title": "Trompt：面向表格数据的更好的深度神经网络",
    "translated_abstract": "表格数据可谓是各种实际领域中最常用的数据结构之一，包括金融、医疗和电子商务。内在的异质性允许表格数据存储丰富的信息。然而，根据最近发布的表格基准，我们可以看到深度神经网络在表格数据集上仍然落后于树状模型。本文提出了Trompt，它是一个新颖的架构，灵感来自于语言模型的提示学习。提示学习的本质是通过一组模型外的提示来调整一个大型预训练模型，而不是直接修改模型。基于这个思想，Trompt将表格数据的学习策略分为两部分。第一部分类似于预训练模型，注重学习表格的内在信息。第二部分类似于提示，注重学习样本之间的差异。 Trompt在上述基准中进行了评估。",
    "tldr": "Trompt是一种新颖的深度神经网络结构，其中分离了表格数据学习策略，它通过提示学习的方式来调整大型预先训练的模型，以便更好地能够处理表格数据，并取得了很好的效果。"
}