{
    "title": "Black-Box Targeted Reward Poisoning Attack Against Online Deep Reinforcement Learning. (arXiv:2305.10681v1 [cs.LG])",
    "abstract": "We propose the first black-box targeted attack against online deep reinforcement learning through reward poisoning during training time. Our attack is applicable to general environments with unknown dynamics learned by unknown algorithms and requires limited attack budgets and computational resources. We leverage a general framework and find conditions to ensure efficient attack under a general assumption of the learning algorithms. We show that our attack is optimal in our framework under the conditions. We experimentally verify that with limited budgets, our attack efficiently leads the learning agent to various target policies under a diverse set of popular DRL environments and state-of-the-art learners.",
    "link": "http://arxiv.org/abs/2305.10681",
    "context": "Title: Black-Box Targeted Reward Poisoning Attack Against Online Deep Reinforcement Learning. (arXiv:2305.10681v1 [cs.LG])\nAbstract: We propose the first black-box targeted attack against online deep reinforcement learning through reward poisoning during training time. Our attack is applicable to general environments with unknown dynamics learned by unknown algorithms and requires limited attack budgets and computational resources. We leverage a general framework and find conditions to ensure efficient attack under a general assumption of the learning algorithms. We show that our attack is optimal in our framework under the conditions. We experimentally verify that with limited budgets, our attack efficiently leads the learning agent to various target policies under a diverse set of popular DRL environments and state-of-the-art learners.",
    "path": "papers/23/05/2305.10681.json",
    "total_tokens": 804,
    "translated_title": "在线深度强化学习的黑盒目标奖励毒化攻击",
    "translated_abstract": "我们提出了第一个在线深度强化学习的黑盒目标攻击，通过奖励毒化攻击来干扰训练过程。我们的攻击适用于未知算法学习的通用环境，并且需要有限的攻击预算和计算资源。我们利用通用框架并找到保证在学习算法的一般假设下攻击高效的条件。我们证明在这个框架下我们的攻击是最优的。实验结果表明，我们的攻击可以在有限的预算下高效地将学习代理引导到各种目标策略下，适用于多种流行的DRL环境和最先进的学习器。",
    "tldr": "本文提出了一种针对在线深度强化学习的黑盒目标攻击方式，即通过奖励毒化攻击来干扰训练过程，攻击具有通用性，且攻击预算和计算资源需求较少，实验结果表明攻击高效，适用于多种DRL环境和学习器。",
    "en_tdlr": "This paper proposes a black-box targeted attack against online deep reinforcement learning through reward poisoning during training time, which is applicable to general environments with unknown dynamics learned by unknown algorithms and requires limited attack budgets and computational resources. The attack is efficient and effective in leading the learning agent to various target policies under a diverse set of popular DRL environments and state-of-the-art learners."
}