{
    "title": "Large Language Models Need Holistically Thought in Medical Conversational QA. (arXiv:2305.05410v1 [cs.CL])",
    "abstract": "The medical conversational question answering (CQA) system aims at providing a series of professional medical services to improve the efficiency of medical care. Despite the success of large language models (LLMs) in complex reasoning tasks in various fields, such as mathematics, logic, and commonsense QA, they still need to improve with the increased complexity and specialization of the medical field. This is because medical CQA tasks require not only strong medical reasoning, but also the ability to think broadly and deeply. In this paper, to address these challenges in medical CQA tasks that need to be considered and understood in many aspects, we propose the Holistically Thought (HoT) method, which is designed to guide the LLMs to perform the diffused and focused thinking for generating high-quality medical responses. The proposed HoT method has been evaluated through automated and manual assessments in three different medical CQA datasets containing the English and Chinese languag",
    "link": "http://arxiv.org/abs/2305.05410",
    "context": "Title: Large Language Models Need Holistically Thought in Medical Conversational QA. (arXiv:2305.05410v1 [cs.CL])\nAbstract: The medical conversational question answering (CQA) system aims at providing a series of professional medical services to improve the efficiency of medical care. Despite the success of large language models (LLMs) in complex reasoning tasks in various fields, such as mathematics, logic, and commonsense QA, they still need to improve with the increased complexity and specialization of the medical field. This is because medical CQA tasks require not only strong medical reasoning, but also the ability to think broadly and deeply. In this paper, to address these challenges in medical CQA tasks that need to be considered and understood in many aspects, we propose the Holistically Thought (HoT) method, which is designed to guide the LLMs to perform the diffused and focused thinking for generating high-quality medical responses. The proposed HoT method has been evaluated through automated and manual assessments in three different medical CQA datasets containing the English and Chinese languag",
    "path": "papers/23/05/2305.05410.json",
    "total_tokens": 897,
    "translated_title": "大型语言模型在医疗对话问答中需要进行整体性思考",
    "translated_abstract": "医疗对话问答系统旨在提供一系列专业的医疗服务，以提高医疗护理效率。尽管大型语言模型在数学、逻辑和常识问答等各个领域的复杂推理任务中取得了成功，但随着医学领域的日益复杂和专业化，它们仍需要提高。这是因为医疗对话问答任务不仅需要强大的医学推理能力，还需要广泛深入的思维能力。本文针对这些需要从许多方面考虑和理解的医疗对话问答任务的挑战，提出了全面思考（HoT）方法，旨在引导大型语言模型进行扩散和聚焦思考，生成高质量的医学响应。所提出的HoT方法已通过自动化和手动评估，在包含英文和中文的三个不同的医疗对话问答数据集中进行了评估。",
    "tldr": "本研究提出了一种Holistically Thought（HoT）方法，用于引导大型语言模型进行综合性思考，以在医疗对话问答中生成高质量的医学响应。"
}