{
    "title": "Ambiguity Meets Uncertainty: Investigating Uncertainty Estimation for Word Sense Disambiguation. (arXiv:2305.13119v2 [cs.CL] UPDATED)",
    "abstract": "Word sense disambiguation (WSD), which aims to determine an appropriate sense for a target word given its context, is crucial for natural language understanding. Existing supervised methods treat WSD as a classification task and have achieved remarkable performance. However, they ignore uncertainty estimation (UE) in the real-world setting, where the data is always noisy and out of distribution. This paper extensively studies UE on the benchmark designed for WSD. Specifically, we first compare four uncertainty scores for a state-of-the-art WSD model and verify that the conventional predictive probabilities obtained at the end of the model are inadequate to quantify uncertainty. Then, we examine the capability of capturing data and model uncertainties by the model with the selected UE score on well-designed test scenarios and discover that the model reflects data uncertainty satisfactorily but underestimates model uncertainty. Furthermore, we explore numerous lexical properties that int",
    "link": "http://arxiv.org/abs/2305.13119",
    "context": "Title: Ambiguity Meets Uncertainty: Investigating Uncertainty Estimation for Word Sense Disambiguation. (arXiv:2305.13119v2 [cs.CL] UPDATED)\nAbstract: Word sense disambiguation (WSD), which aims to determine an appropriate sense for a target word given its context, is crucial for natural language understanding. Existing supervised methods treat WSD as a classification task and have achieved remarkable performance. However, they ignore uncertainty estimation (UE) in the real-world setting, where the data is always noisy and out of distribution. This paper extensively studies UE on the benchmark designed for WSD. Specifically, we first compare four uncertainty scores for a state-of-the-art WSD model and verify that the conventional predictive probabilities obtained at the end of the model are inadequate to quantify uncertainty. Then, we examine the capability of capturing data and model uncertainties by the model with the selected UE score on well-designed test scenarios and discover that the model reflects data uncertainty satisfactorily but underestimates model uncertainty. Furthermore, we explore numerous lexical properties that int",
    "path": "papers/23/05/2305.13119.json",
    "total_tokens": 964,
    "translated_title": "语义歧义遇上不确定性：探究用于词义消歧的不确定性估计方法",
    "translated_abstract": "词义消歧(WSD)是自然语言理解中非常重要的一环，它通过给定一个句子中一个目标词的上下文，确定其恰当的词义。现有的监督方法将WSD视为分类任务，并取得了出色的性能。然而，它们在真实世界的环境中忽略了不确定性估计（UE），在这种环境下，数据总是嘈杂的，超出了分布范围。本文在专门为WSD设计的基准测试上广泛研究了UE。具体而言，我们首先比较了四种用于最先进WSD模型的不确定性得分，验证了模型末端获得的传统预测概率不足以量化不确定性。然后，我们通过拥有所选UE得分的模型在设计良好的测试场景中检测捕获数据和模型不确定性的能力，发现模型令人满意地反映了数据不确定性，但低估了模型不确定性。此外，我们还探讨了大量词汇属性，以检查这些属性是否有望作为UE的指导方向。",
    "tldr": "本研究探究了用于词义消歧的不确定性估计方法，发现传统预测概率不足以量化不确定性，同时发现模型令人满意地反映了数据不确定性但是低估了模型不确定性。",
    "en_tdlr": "This paper investigates uncertainty estimation for word sense disambiguation (WSD), finding that traditional predictive probabilities are inadequate for quantifying uncertainty. The study also discovers that a model using uncertainty estimation adequately reflects data uncertainty but underestimates model uncertainty. The paper explores numerous lexical properties as potential guidance for uncertainty estimation."
}