{
    "title": "Correcting for Interference in Experiments: A Case Study at Douyin. (arXiv:2305.02542v1 [stat.ME])",
    "abstract": "Interference is a ubiquitous problem in experiments conducted on two-sided content marketplaces, such as Douyin (China's analog of TikTok). In many cases, creators are the natural unit of experimentation, but creators interfere with each other through competition for viewers' limited time and attention. \"Naive\" estimators currently used in practice simply ignore the interference, but in doing so incur bias on the order of the treatment effect. We formalize the problem of inference in such experiments as one of policy evaluation. Off-policy estimators, while unbiased, are impractically high variance. We introduce a novel Monte-Carlo estimator, based on \"Differences-in-Qs\" (DQ) techniques, which achieves bias that is second-order in the treatment effect, while remaining sample-efficient to estimate. On the theoretical side, our contribution is to develop a generalized theory of Taylor expansions for policy evaluation, which extends DQ theory to all major MDP formulations. On the practica",
    "link": "http://arxiv.org/abs/2305.02542",
    "context": "Title: Correcting for Interference in Experiments: A Case Study at Douyin. (arXiv:2305.02542v1 [stat.ME])\nAbstract: Interference is a ubiquitous problem in experiments conducted on two-sided content marketplaces, such as Douyin (China's analog of TikTok). In many cases, creators are the natural unit of experimentation, but creators interfere with each other through competition for viewers' limited time and attention. \"Naive\" estimators currently used in practice simply ignore the interference, but in doing so incur bias on the order of the treatment effect. We formalize the problem of inference in such experiments as one of policy evaluation. Off-policy estimators, while unbiased, are impractically high variance. We introduce a novel Monte-Carlo estimator, based on \"Differences-in-Qs\" (DQ) techniques, which achieves bias that is second-order in the treatment effect, while remaining sample-efficient to estimate. On the theoretical side, our contribution is to develop a generalized theory of Taylor expansions for policy evaluation, which extends DQ theory to all major MDP formulations. On the practica",
    "path": "papers/23/05/2305.02542.json",
    "total_tokens": 973,
    "translated_title": "修正干扰问题：以抖音为例的案例研究",
    "translated_abstract": "干扰是在双向内容市场平台上进行实验时的普遍问题，例如中国版的TikTok——抖音。在许多情况下，创作者是实验的自然单位，但是创作者通过争夺观众有限的时间和注意力互相干扰。目前实践中使用的“朴素”估计器简单地忽略了干扰，但这样做会产生治疗效果的误差。我们将这样的实验推断问题形式化为政策评估中的问题。虽然偏差很小，但形式上行为策略不够实用。我们引入了一种基于“Q值差异”的(DQ)技术的新型Monte-Carlo估计器，它达到了治疗效果在二阶的偏差，同时保持了样本效率。在理论方面，我们的贡献是发展了一个通用的政策评估泰勒展开理论，将DQ理论扩展到所有主要的MDP公式。在实践方面，我们的估计器被部署在抖音上，并在现场实验中将实验吞吐量提高了一倍。",
    "tldr": "该研究提出了一种新型的Monte-Carlo估计器，它能够修正在抖音双向内容市场平台上实验时的干扰问题，并在现场实验中将实验吞吐量提高了一倍。",
    "en_tdlr": "This study proposes a novel Monte-Carlo estimator to correct the interference problem in experiments on Douyin, a two-sided content marketplace similar to TikTok, and doubles the experiment throughput in live experiments."
}