{
    "title": "\"Sch\\\"one neue Lieferkettenwelt\": Workers' Voice und Arbeitsstandards in Zeiten algorithmischer Vorhersage. (arXiv:2305.11981v1 [cs.CY])",
    "abstract": "The complexity and increasingly tight coupling of supply chains poses a major logistical challenge for leading companies. Another challenge is that leading companies -- under pressure from consumers, a critical public and legislative measures such as supply chain laws -- have to take more responsibility than before for their suppliers' labour standards. In this paper, we discuss a new approach that leading companies are using to try to address these challenges: algorithmic prediction of business risks, but also environmental and social risks. We describe the technical and cultural conditions for algorithmic prediction and explain how -- from the perspective of leading companies -- it helps to address both challenges. We then develop scenarios on how and with what kind of social consequences algorithmic prediction can be used by leading companies. From the scenarios, we derive policy options for different stakeholder groups to help develop algorithmic prediction towards improving labour",
    "link": "http://arxiv.org/abs/2305.11981",
    "context": "Title: \"Sch\\\"one neue Lieferkettenwelt\": Workers' Voice und Arbeitsstandards in Zeiten algorithmischer Vorhersage. (arXiv:2305.11981v1 [cs.CY])\nAbstract: The complexity and increasingly tight coupling of supply chains poses a major logistical challenge for leading companies. Another challenge is that leading companies -- under pressure from consumers, a critical public and legislative measures such as supply chain laws -- have to take more responsibility than before for their suppliers' labour standards. In this paper, we discuss a new approach that leading companies are using to try to address these challenges: algorithmic prediction of business risks, but also environmental and social risks. We describe the technical and cultural conditions for algorithmic prediction and explain how -- from the perspective of leading companies -- it helps to address both challenges. We then develop scenarios on how and with what kind of social consequences algorithmic prediction can be used by leading companies. From the scenarios, we derive policy options for different stakeholder groups to help develop algorithmic prediction towards improving labour",
    "path": "papers/23/05/2305.11981.json",
    "total_tokens": 914,
    "translated_title": "“美好的新供应链世界”：算法预测时代下的工人发声和劳工标准",
    "translated_abstract": "供应链的复杂性和越来越紧密的耦合对于领先的公司构成了重大的后勤挑战。另一个挑战是，领先的公司在消费者、批评的公众以及供应链法规等压力下需要比以前更多地对他们的供应商劳工标准负责。本文讨论了领先企业用于应对这些挑战的一种新方法：算法预测商业风险，以及环境和社会风险。我们描述了算法预测的技术和文化条件，并解释了从领先公司的角度来看，它如何帮助解决这两个挑战。然后，我们开发了一些场景，说明和哪种社会后果下，领先的公司可以使用算法预测。通过这些场景，我们为不同利益相关者群体提供了政策选择，以帮助发展算法预测并改善劳工条件。",
    "tldr": "面对日益复杂的供应链，压力来自于消费者、批评的公众以及供应链法规等，领先的公司正在尝试通过算法预测商业、环境和社会风险来改善劳工条件，并为不同利益相关者群体提供政策选择。",
    "en_tdlr": "Leading companies are using algorithmic prediction of business, environmental and social risks to improve labor conditions and meet increasing demands for responsibility from consumers, the public and supply chain laws. Policy options for stakeholders are derived from scenarios exploring the social consequences of this approach."
}