{
    "title": "A Dataset Fusion Algorithm for Generalised Anomaly Detection in Homogeneous Periodic Time Series Datasets. (arXiv:2305.08197v1 [cs.LG])",
    "abstract": "The generalisation of Neural Networks (NN) to multiple datasets is often overlooked in literature due to NNs typically being optimised for specific data sources. This becomes especially challenging in time-series-based multi-dataset models due to difficulties in fusing sequential data from different sensors and collection specifications. In a commercial environment, however, generalisation can effectively utilise available data and computational power, which is essential in the context of Green AI, the sustainable development of AI models. This paper introduces \"Dataset Fusion,\" a novel dataset composition algorithm for fusing periodic signals from multiple homogeneous datasets into a single dataset while retaining unique features for generalised anomaly detection. The proposed approach, tested on a case study of 3-phase current data from 2 different homogeneous Induction Motor (IM) fault datasets using an unsupervised LSTMCaps NN, significantly outperforms conventional training approa",
    "link": "http://arxiv.org/abs/2305.08197",
    "context": "Title: A Dataset Fusion Algorithm for Generalised Anomaly Detection in Homogeneous Periodic Time Series Datasets. (arXiv:2305.08197v1 [cs.LG])\nAbstract: The generalisation of Neural Networks (NN) to multiple datasets is often overlooked in literature due to NNs typically being optimised for specific data sources. This becomes especially challenging in time-series-based multi-dataset models due to difficulties in fusing sequential data from different sensors and collection specifications. In a commercial environment, however, generalisation can effectively utilise available data and computational power, which is essential in the context of Green AI, the sustainable development of AI models. This paper introduces \"Dataset Fusion,\" a novel dataset composition algorithm for fusing periodic signals from multiple homogeneous datasets into a single dataset while retaining unique features for generalised anomaly detection. The proposed approach, tested on a case study of 3-phase current data from 2 different homogeneous Induction Motor (IM) fault datasets using an unsupervised LSTMCaps NN, significantly outperforms conventional training approa",
    "path": "papers/23/05/2305.08197.json",
    "total_tokens": 1026,
    "translated_title": "一种用于同质周期时间序列数据的异常检测的数据集融合算法",
    "translated_abstract": "神经网络在多个数据集上的推广往往被文献忽略，因为NN通常针对特定的数据源进行优化。在基于时间序列的多数据集模型中，由于来自不同传感器和采集规范的连续数据的融合困难，这变得尤其具有挑战性。然而，在商业环境中，通用性可以有效利用可用数据和计算能力，在AI模型的可持续发展之中非常重要。本文介绍了“数据集融合”算法，这是一种将来自多个同质数据集的周期信号融合为单个数据集的新型数据集合成算法，同时保留了通用异常检测的独特特征。经过实验，在使用无监督LSTMCaps NN对来自2个不同同质感应电动机（IM）故障数据集的3相电流数据进行案例研究时，所提出的方法显著优于常规训练方法，显示出在跨多个来源利用可用数据上的潜力。",
    "tldr": "该论文介绍了一种名为“数据集融合”的新型数据集合成算法，可将来自多个同质数据集的周期信号融合为单个数据集，同时保留了通用异常检测的独特特征。在两个同质感应电动机（IM）故障数据集的3相电流数据的案例研究中表现出显著优势，有潜力在跨多个来源利用可用数据方面发挥作用。",
    "en_tdlr": "This paper proposes a novel algorithm called \"Dataset Fusion\" for composing periodic signals from multiple homogeneous datasets into a single dataset while preserving unique characteristics for general anomaly detection. Tested on a case study of 3-phase current data from 2 different homogeneous Induction Motor fault datasets, the proposed approach outperforms conventional training methods, showing potential for economical utilization of available data across multiple sources."
}