{
    "title": "Graph Neural Networks for Airfoil Design. (arXiv:2305.05469v1 [cs.LG])",
    "abstract": "The study of partial differential equations (PDE) through the framework of deep learning emerged a few years ago leading to the impressive approximations of simple dynamics. Graph neural networks (GNN) turned out to be very useful in those tasks by allowing the treatment of unstructured data often encountered in the field of numerical resolutions of PDE. However, the resolutions of harder PDE such as Navier-Stokes equations are still a challenging task and most of the work done on the latter concentrate either on simulating the flow around simple geometries or on qualitative results that looks physical for design purpose. In this study, we try to leverage the work done on deep learning for PDE and GNN by proposing an adaptation of a known architecture in order to tackle the task of approximating the solution of the two-dimensional steady-state incompressible Navier-Stokes equations over different airfoil geometries. In addition to that, we test our model not only on its performance ove",
    "link": "http://arxiv.org/abs/2305.05469",
    "context": "Title: Graph Neural Networks for Airfoil Design. (arXiv:2305.05469v1 [cs.LG])\nAbstract: The study of partial differential equations (PDE) through the framework of deep learning emerged a few years ago leading to the impressive approximations of simple dynamics. Graph neural networks (GNN) turned out to be very useful in those tasks by allowing the treatment of unstructured data often encountered in the field of numerical resolutions of PDE. However, the resolutions of harder PDE such as Navier-Stokes equations are still a challenging task and most of the work done on the latter concentrate either on simulating the flow around simple geometries or on qualitative results that looks physical for design purpose. In this study, we try to leverage the work done on deep learning for PDE and GNN by proposing an adaptation of a known architecture in order to tackle the task of approximating the solution of the two-dimensional steady-state incompressible Navier-Stokes equations over different airfoil geometries. In addition to that, we test our model not only on its performance ove",
    "path": "papers/23/05/2305.05469.json",
    "total_tokens": 914,
    "translated_title": "基于图神经网络的飞翼设计研究",
    "translated_abstract": "近年来，借助深度学习框架解决偏微分方程（PDE）的研究得到了广泛应用，Graph神经网络（GNN）在解决PDE数值计算方面使用广泛，尤其是对于非结构化数据。但是，复杂的PDE，如Navier-Stokes方程的数值解仍然是一项具有挑战性的任务，而目前大部分相关工作都是集中于简单几何结构的风流模拟或适用于设计目的的外观定性结果。本研究旨在利用针对PDE深度学习方法和GNN的工作，提出一种已知架构的改进，以解决在不同飞翼几何形状下求解二维定常不可压缩Navier-Stokes方程的近似解问题，并对模型的性能进行测试不仅要关注预测精度，还要能够自 主生成新的合理形状。",
    "tldr": "本文研究基于图神经网络的飞翼设计，利用已知架构的改进解决了求解二维不可压缩Navier-Stokes方程的近似解问题。同时，本文还关注了模型性能表现和新形状的自动生成。",
    "en_tdlr": "This study proposes an adaptation of a known architecture using graph neural networks to solve the task of approximating the solution of the two-dimensional steady-state incompressible Navier-Stokes equations over different airfoil geometries. The model's performance is tested not only on its prediction accuracy but also its ability to generate new reasonable shapes."
}