{
    "title": "Spatial-Temporal Networks for Antibiogram Pattern Prediction. (arXiv:2305.01761v1 [cs.LG])",
    "abstract": "An antibiogram is a periodic summary of antibiotic resistance results of organisms from infected patients to selected antimicrobial drugs. Antibiograms help clinicians to understand regional resistance rates and select appropriate antibiotics in prescriptions. In practice, significant combinations of antibiotic resistance may appear in different antibiograms, forming antibiogram patterns. Such patterns may imply the prevalence of some infectious diseases in certain regions. Thus it is of crucial importance to monitor antibiotic resistance trends and track the spread of multi-drug resistant organisms. In this paper, we propose a novel problem of antibiogram pattern prediction that aims to predict which patterns will appear in the future. Despite its importance, tackling this problem encounters a series of challenges and has not yet been explored in the literature. First of all, antibiogram patterns are not i.i.d as they may have strong relations with each other due to genomic similariti",
    "link": "http://arxiv.org/abs/2305.01761",
    "context": "Title: Spatial-Temporal Networks for Antibiogram Pattern Prediction. (arXiv:2305.01761v1 [cs.LG])\nAbstract: An antibiogram is a periodic summary of antibiotic resistance results of organisms from infected patients to selected antimicrobial drugs. Antibiograms help clinicians to understand regional resistance rates and select appropriate antibiotics in prescriptions. In practice, significant combinations of antibiotic resistance may appear in different antibiograms, forming antibiogram patterns. Such patterns may imply the prevalence of some infectious diseases in certain regions. Thus it is of crucial importance to monitor antibiotic resistance trends and track the spread of multi-drug resistant organisms. In this paper, we propose a novel problem of antibiogram pattern prediction that aims to predict which patterns will appear in the future. Despite its importance, tackling this problem encounters a series of challenges and has not yet been explored in the literature. First of all, antibiogram patterns are not i.i.d as they may have strong relations with each other due to genomic similariti",
    "path": "papers/23/05/2305.01761.json",
    "total_tokens": 775,
    "translated_title": "空间-时间网络用于抗生素敏感性图案预测",
    "translated_abstract": "抗生素敏感性图案是对感染患者的抗生素耐药性检测结果进行周期性总结。抗生素敏感性图案有助于医生了解地区耐药性率并选择适当的处方抗生素。本文提出了一个新颖的问题，即抗生素敏感性图案预测，旨在预测未来哪些图案将出现。尽管该问题的重要性，但处理该问题会遇到一系列挑战，并且在文献中尚未得到探索。首先，抗生素敏感性图案不是独立同分布的，因为它们可能由于基因相似性而彼此紧密相关。",
    "tldr": "本文提出了一个新颖的问题，即抗生素敏感性图案预测，旨在预测未来哪些图案将出现，并解决了这一问题遇到的挑战。",
    "en_tdlr": "This paper proposes a novel problem of predicting antibiogram patterns to monitor antibiotic resistance trends and track multi-drug resistant organisms, tackling the challenges of strong correlations between the patterns and lack of exploration in the literature."
}