{
    "title": "Generative Adversarial Networks for Brain Images Synthesis: A Review. (arXiv:2305.15421v1 [eess.IV])",
    "abstract": "In medical imaging, image synthesis is the estimation process of one image (sequence, modality) from another image (sequence, modality). Since images with different modalities provide diverse biomarkers and capture various features, multi-modality imaging is crucial in medicine. While multi-screening is expensive, costly, and time-consuming to report by radiologists, image synthesis methods are capable of artificially generating missing modalities. Deep learning models can automatically capture and extract the high dimensional features. Especially, generative adversarial network (GAN) as one of the most popular generative-based deep learning methods, uses convolutional networks as generators, and estimated images are discriminated as true or false based on a discriminator network. This review provides brain image synthesis via GANs. We summarized the recent developments of GANs for cross-modality brain image synthesis including CT to PET, CT to MRI, MRI to PET, and vice versa.",
    "link": "http://arxiv.org/abs/2305.15421",
    "context": "Title: Generative Adversarial Networks for Brain Images Synthesis: A Review. (arXiv:2305.15421v1 [eess.IV])\nAbstract: In medical imaging, image synthesis is the estimation process of one image (sequence, modality) from another image (sequence, modality). Since images with different modalities provide diverse biomarkers and capture various features, multi-modality imaging is crucial in medicine. While multi-screening is expensive, costly, and time-consuming to report by radiologists, image synthesis methods are capable of artificially generating missing modalities. Deep learning models can automatically capture and extract the high dimensional features. Especially, generative adversarial network (GAN) as one of the most popular generative-based deep learning methods, uses convolutional networks as generators, and estimated images are discriminated as true or false based on a discriminator network. This review provides brain image synthesis via GANs. We summarized the recent developments of GANs for cross-modality brain image synthesis including CT to PET, CT to MRI, MRI to PET, and vice versa.",
    "path": "papers/23/05/2305.15421.json",
    "total_tokens": 885,
    "translated_title": "生成对抗网络在脑部图像合成方面的应用综述",
    "translated_abstract": "在医学成像中，图像合成是从另一幅图像(序列、模态)估算出一幅图像(序列、模态)的过程。多模态成像对于医学至关重要，因为不同模态的图像提供了多样的生物标志物和捕捉各种特征，而多次筛查则需要花费大量时间和财力，同时由放射科医师进行报告。图像合成方法能够人为地生成缺失的模态。深度学习模型能够自动捕获和提取高维特征。尤其是生成对抗网络(GAN)作为最流行的基于生成的深度学习方法之一，使用卷积网络作为生成器，并通过鉴别器网络识别估算的图像是否为真实图像。本文综述了GAN在脑部跨模态图像合成方面的最新进展，包括CT到PET、CT到MRI、MRI到PET等。",
    "tldr": "本文综述了医学成像中图像合成的重要性以及GAN在脑部跨模态图像合成方面的最新进展。GAN可以通过卷积网络生成缺失模态的图像，并通过鉴别器识别真实图像。",
    "en_tdlr": "This review discusses the importance of image synthesis in medical imaging and summarizes recent developments in using GANs for cross-modality brain image synthesis. GANs can generate missing modalities using convolutional networks and discriminate real images using a discriminator."
}