{
    "title": "Benchmarking LLM-based Machine Translation on Cultural Awareness",
    "abstract": "arXiv:2305.14328v2 Announce Type: replace  Abstract: Translating cultural-specific content is crucial for effective cross-cultural communication. However, many MT systems still struggle to translate sentences containing cultural-specific entities accurately and understandably. Recent advancements in in-context learning utilize lightweight prompts to guide large language models (LLMs) in machine translation tasks. Nevertheless, the effectiveness of this approach in enhancing machine translation with cultural awareness remains uncertain. To address this gap, we introduce a new data curation pipeline to construct a culturally relevant parallel corpus, enriched with annotations of cultural-specific items. Furthermore, we devise a novel evaluation metric to assess the understandability of translations in a reference-free manner by GPT-4. We evaluate a variety of neural machine translation (NMT) and LLM-based MT systems using our dataset. Additionally, we propose several prompting strategies",
    "link": "https://arxiv.org/abs/2305.14328",
    "context": "Title: Benchmarking LLM-based Machine Translation on Cultural Awareness\nAbstract: arXiv:2305.14328v2 Announce Type: replace  Abstract: Translating cultural-specific content is crucial for effective cross-cultural communication. However, many MT systems still struggle to translate sentences containing cultural-specific entities accurately and understandably. Recent advancements in in-context learning utilize lightweight prompts to guide large language models (LLMs) in machine translation tasks. Nevertheless, the effectiveness of this approach in enhancing machine translation with cultural awareness remains uncertain. To address this gap, we introduce a new data curation pipeline to construct a culturally relevant parallel corpus, enriched with annotations of cultural-specific items. Furthermore, we devise a novel evaluation metric to assess the understandability of translations in a reference-free manner by GPT-4. We evaluate a variety of neural machine translation (NMT) and LLM-based MT systems using our dataset. Additionally, we propose several prompting strategies",
    "path": "papers/23/05/2305.14328.json",
    "total_tokens": 831,
    "translated_title": "在文化意识上基于LLM的机器翻译基准测试",
    "translated_abstract": "翻译文化特定内容对于有效的跨文化沟通至关重要。然而，许多机器翻译系统仍然难以准确理解和翻译包含文化特定实体的句子。最近关于上下文学习的进展利用轻量级提示指导大型语言模型(LLMs)在机器翻译任务中。然而，这种方法在提高具有文化意识的机器翻译的有效性方面仍然存在不确定性。为了填补这一空白，我们引入了一个新的数据整理流程，构建了一个包含文化相关并丰富了文化特定项目注释的平行语料库。此外，我们设计了一种新颖的评估指标，通过GPT-4以无参考方式评估翻译的可理解性。我们使用我们的数据集评估了各种神经机器翻译(NMT)和LLM-based MT系统。此外，我们提出了几种提示策略。",
    "tldr": "介绍了一个新的数据整理流程来构建文化相关的平行语料库，并设计了一种新的评估指标，通过GPT-4无参考评估翻译的可理解性。",
    "en_tdlr": "Introducing a new data curation pipeline to construct a culturally relevant parallel corpus and devising a novel evaluation metric to assess the understandability of translations by GPT-4 without references."
}