{
    "title": "Learning Sentinel-2 reflectance dynamics for data-driven assimilation and forecasting. (arXiv:2305.03743v1 [eess.IV])",
    "abstract": "Over the last few years, massive amounts of satellite multispectral and hyperspectral images covering the Earth's surface have been made publicly available for scientific purpose, for example through the European Copernicus project. Simultaneously, the development of self-supervised learning (SSL) methods has sparked great interest in the remote sensing community, enabling to learn latent representations from unlabeled data to help treating downstream tasks for which there is few annotated examples, such as interpolation, forecasting or unmixing. Following this line, we train a deep learning model inspired from the Koopman operator theory to model long-term reflectance dynamics in an unsupervised way. We show that this trained model, being differentiable, can be used as a prior for data assimilation in a straightforward way. Our datasets, which are composed of Sentinel-2 multispectral image time series, are publicly released with several levels of treatment.",
    "link": "http://arxiv.org/abs/2305.03743",
    "context": "Title: Learning Sentinel-2 reflectance dynamics for data-driven assimilation and forecasting. (arXiv:2305.03743v1 [eess.IV])\nAbstract: Over the last few years, massive amounts of satellite multispectral and hyperspectral images covering the Earth's surface have been made publicly available for scientific purpose, for example through the European Copernicus project. Simultaneously, the development of self-supervised learning (SSL) methods has sparked great interest in the remote sensing community, enabling to learn latent representations from unlabeled data to help treating downstream tasks for which there is few annotated examples, such as interpolation, forecasting or unmixing. Following this line, we train a deep learning model inspired from the Koopman operator theory to model long-term reflectance dynamics in an unsupervised way. We show that this trained model, being differentiable, can be used as a prior for data assimilation in a straightforward way. Our datasets, which are composed of Sentinel-2 multispectral image time series, are publicly released with several levels of treatment.",
    "path": "papers/23/05/2305.03743.json",
    "total_tokens": 870,
    "translated_title": "基于数据驱动同化和预测的Sentinel-2反射动力学学习",
    "translated_abstract": "在过去几年中，覆盖地球表面的大规模卫星多光谱和高光谱图像已被公开用于科学研究，例如通过欧洲Copernicus项目。同时，自监督学习（SSL）方法的发展引起了遥感界的极大关注，使得能够从未标记数据中学习潜在表示，以帮助处理下游任务，如插值、预测或解混。沿着这条线路，我们以Koopman算子理论为灵感，以无监督的方式训练深度学习模型来模拟长期反射动力学。我们展示了这个训练好的模型，作为一个可微分的模型，可以直接用作数据同化的先验。我们的数据集由Sentinel-2多光谱图像时间序列组成，并公开发布了多个级别的处理。",
    "tldr": "本篇论文提出了基于Koopman算子的无监督深度学习模型，用于学习长期反射动力学，该模型可以作为数据同化的先验，数据集公开发布，适用于Sentinel-2多光谱图像时间序列。",
    "en_tdlr": "This paper proposes an unsupervised deep learning model based on the Koopman operator theory to learn long-term reflectance dynamics, which can be used as a prior for data assimilation. The publicly available dataset consists of Sentinel-2 multispectral image time series."
}