{
    "title": "HiPerformer: Hierarchically Permutation-Equivariant Transformer for Time Series Forecasting. (arXiv:2305.08073v1 [cs.LG])",
    "abstract": "It is imperative to discern the relationships between multiple time series for accurate forecasting. In particular, for stock prices, components are often divided into groups with the same characteristics, and a model that extracts relationships consistent with this group structure should be effective. Thus, we propose the concept of hierarchical permutation-equivariance, focusing on index swapping of components within and among groups, to design a model that considers this group structure. When the prediction model has hierarchical permutation-equivariance, the prediction is consistent with the group relationships of the components. Therefore, we propose a hierarchically permutation-equivariant model that considers both the relationship among components in the same group and the relationship among groups. The experiments conducted on real-world data demonstrate that the proposed method outperforms existing state-of-the-art methods.",
    "link": "http://arxiv.org/abs/2305.08073",
    "context": "Title: HiPerformer: Hierarchically Permutation-Equivariant Transformer for Time Series Forecasting. (arXiv:2305.08073v1 [cs.LG])\nAbstract: It is imperative to discern the relationships between multiple time series for accurate forecasting. In particular, for stock prices, components are often divided into groups with the same characteristics, and a model that extracts relationships consistent with this group structure should be effective. Thus, we propose the concept of hierarchical permutation-equivariance, focusing on index swapping of components within and among groups, to design a model that considers this group structure. When the prediction model has hierarchical permutation-equivariance, the prediction is consistent with the group relationships of the components. Therefore, we propose a hierarchically permutation-equivariant model that considers both the relationship among components in the same group and the relationship among groups. The experiments conducted on real-world data demonstrate that the proposed method outperforms existing state-of-the-art methods.",
    "path": "papers/23/05/2305.08073.json",
    "total_tokens": 778,
    "translated_title": "HiPerformer：层级排列等变换器用于时间序列预测",
    "translated_abstract": "为了准确预测多个时间序列之间的关系，需要进行区分。特别是对于股票价格，往往将股票分为具有相同特征的组，具有与该组结构一致的关系的模型应该是有效的。因此，我们提出了分层排列等变性的概念，专注于组内和组间成分的指数交换，以设计考虑这种组结构的模型。当预测模型具有分层排列等变性时，预测结果符合成分的组之间的关系。因此，我们提出了一种层级排列等变性模型，考虑了同一组中成分之间和组之间的关系。基于真实数据开展的实验表明，该方法优于现有的最先进方法。",
    "tldr": "本文提出了一种考虑股票组内和组间结构的预测模型，通过分层排列等变性的概念进行设计。实验结果表明该方法在预测上表现出色。",
    "en_tdlr": "This paper proposes a hierarchical permutation-equivariant model for accurate time series forecasting, focusing on the group structure of stock components. The proposed method outperforms existing state-of-the-art methods according to experiments on real-world data."
}