{
    "title": "Application of Text Analytics in Public Service Co-Creation: Literature Review and Research Framework. (arXiv:2305.18316v1 [cs.CY])",
    "abstract": "The public sector faces several challenges, such as a number of external and internal demands for change, citizens' dissatisfaction and frustration with public sector organizations, that need to be addressed. An alternative to the traditional top-down development of public services is co-creation of public services. Co-creation promotes collaboration between stakeholders with the aim to create better public services and achieve public values. At the same time, data analytics has been fuelled by the availability of immense amounts of textual data. Whilst both co-creation and TA have been used in the private sector, we study existing works on the application of Text Analytics (TA) techniques on text data to support public service co-creation. We systematically review 75 of the 979 papers that focus directly or indirectly on the application of TA in the context of public service development. In our review, we analyze the TA techniques, the public service they support, public value outcome",
    "link": "http://arxiv.org/abs/2305.18316",
    "context": "Title: Application of Text Analytics in Public Service Co-Creation: Literature Review and Research Framework. (arXiv:2305.18316v1 [cs.CY])\nAbstract: The public sector faces several challenges, such as a number of external and internal demands for change, citizens' dissatisfaction and frustration with public sector organizations, that need to be addressed. An alternative to the traditional top-down development of public services is co-creation of public services. Co-creation promotes collaboration between stakeholders with the aim to create better public services and achieve public values. At the same time, data analytics has been fuelled by the availability of immense amounts of textual data. Whilst both co-creation and TA have been used in the private sector, we study existing works on the application of Text Analytics (TA) techniques on text data to support public service co-creation. We systematically review 75 of the 979 papers that focus directly or indirectly on the application of TA in the context of public service development. In our review, we analyze the TA techniques, the public service they support, public value outcome",
    "path": "papers/23/05/2305.18316.json",
    "total_tokens": 856,
    "translated_title": "文本分析在公共服务协同创作中的应用：文献综述和研究框架",
    "translated_abstract": "公共部门面临着多个挑战，例如来自内部外部的需求变化，公民对公共部门组织的不满和挫败感，这些问题需要得到解决。公共服务协同创作是传统自上而下的公共服务开发的一种替代方案，它促进了利益相关者之间的合作，旨在创建更好的公共服务并实现公共价值。同时，文本数据的可用性推动了数据分析的发展。尽管协同创作和TA在私营部门中都得到了应用，但本文研究了现有的关于应用文本分析技术支持公共服务协同创作的研究，并对975篇文章进行了系统综述，分析了TA技术和公共服务对公共价值的影响。",
    "tldr": "本文系统综述了在公共服务领域中应用文本分析技能以支持公共服务协同创作的研究，发掘了TA技术和公共服务的对公共价值的影响，以及在公共服务领域中TA技术的应用前景。",
    "en_tdlr": "This paper provides a systematic review of the application of text analytics (TA) techniques to support public service co-creation, analyzing their impact on public value and potential applications in the public sector."
}