{
    "title": "Ambiguity in solving imaging inverse problems with deep learning based operators. (arXiv:2305.19774v1 [cs.CV])",
    "abstract": "In recent years, large convolutional neural networks have been widely used as tools for image deblurring, because of their ability in restoring images very precisely. It is well known that image deblurring is mathematically modeled as an ill-posed inverse problem and its solution is difficult to approximate when noise affects the data. Really, one limitation of neural networks for deblurring is their sensitivity to noise and other perturbations, which can lead to instability and produce poor reconstructions. In addition, networks do not necessarily take into account the numerical formulation of the underlying imaging problem, when trained end-to-end. In this paper, we propose some strategies to improve stability without losing to much accuracy to deblur images with deep-learning based methods. First, we suggest a very small neural architecture, which reduces the execution time for training, satisfying a green AI need, and does not extremely amplify noise in the computed image. Second, ",
    "link": "http://arxiv.org/abs/2305.19774",
    "context": "Title: Ambiguity in solving imaging inverse problems with deep learning based operators. (arXiv:2305.19774v1 [cs.CV])\nAbstract: In recent years, large convolutional neural networks have been widely used as tools for image deblurring, because of their ability in restoring images very precisely. It is well known that image deblurring is mathematically modeled as an ill-posed inverse problem and its solution is difficult to approximate when noise affects the data. Really, one limitation of neural networks for deblurring is their sensitivity to noise and other perturbations, which can lead to instability and produce poor reconstructions. In addition, networks do not necessarily take into account the numerical formulation of the underlying imaging problem, when trained end-to-end. In this paper, we propose some strategies to improve stability without losing to much accuracy to deblur images with deep-learning based methods. First, we suggest a very small neural architecture, which reduces the execution time for training, satisfying a green AI need, and does not extremely amplify noise in the computed image. Second, ",
    "path": "papers/23/05/2305.19774.json",
    "total_tokens": 1241,
    "translated_title": "利用深度学习算子解决成像反问题时存在的歧义",
    "translated_abstract": "近年来，大型卷积神经网络被广泛用作图像去模糊工具，因为它们能够非常精确地恢复图像。众所周知，图像去模糊在数学上被建模为反问题，当噪声影响数据时，其解决方案难以近似。然而，神经网络在去模糊时的局限性在于其对噪声和其他扰动的敏感性，这可能会导致不稳定性并产生较差的重建结果。此外，当进行端到端的训练时，网络不一定考虑底层成像问题的数字化形式。在本文中，我们提出了一些策略，通过基于深度学习的方法来将图像去模糊的稳定性提高而不至于失去太多准确性。首先，我们建议使用非常小的神经结构，这将减少训练的执行时间，同时满足绿色人工智能的需求，并且不会极大地放大计算图像中的噪声。其次，我们提出了一种修改网络损失函数的方法，基于正则化项以稳定训练并降低对扰动的敏感度。最后，我们提出采用基于低秩表示的预处理步骤，为迭代优化过程提供更稳定和准确的起点。我们在合成和现实数据上验证了我们策略的有效性，证明它们可以提高基于深度学习的去模糊方法的稳定性和鲁棒性。",
    "tldr": "本文提出了通过使用非常小的神经结构、提出一种基于正则化项的网络损失函数修改策略和对图像进行低秩表示的预处理步骤来提高基于深度学习的去模糊方法的稳定性和鲁棒性。研究结果表明，这些策略有效地提高了图像去模糊方法的稳定性和准确性。",
    "en_tdlr": "This paper proposes strategies to improve the stability and robustness of deep learning-based deblurring methods by using a very small neural architecture, modifying the network's loss function with regularization term, and using a pre-processing step based on a low-rank representation of the image. The effectiveness of these strategies is demonstrated on both synthetic and real-world data."
}