{
    "title": "RLAD: Reinforcement Learning from Pixels for Autonomous Driving in Urban Environments. (arXiv:2305.18510v1 [cs.CV])",
    "abstract": "Current approaches of Reinforcement Learning (RL) applied in urban Autonomous Driving (AD) focus on decoupling the perception training from the driving policy training. The main reason is to avoid training a convolution encoder alongside a policy network, which is known to have issues related to sample efficiency, degenerated feature representations, and catastrophic self-overfitting. However, this paradigm can lead to representations of the environment that are not aligned with the downstream task, which may result in suboptimal performances. To address this limitation, this paper proposes RLAD, the first Reinforcement Learning from Pixels (RLfP) method applied in the urban AD domain. We propose several techniques to enhance the performance of an RLfP algorithm in this domain, including: i) an image encoder that leverages both image augmentations and Adaptive Local Signal Mixing (A-LIX) layers; ii) WayConv1D, which is a waypoint encoder that harnesses the 2D geometrical information of",
    "link": "http://arxiv.org/abs/2305.18510",
    "context": "Title: RLAD: Reinforcement Learning from Pixels for Autonomous Driving in Urban Environments. (arXiv:2305.18510v1 [cs.CV])\nAbstract: Current approaches of Reinforcement Learning (RL) applied in urban Autonomous Driving (AD) focus on decoupling the perception training from the driving policy training. The main reason is to avoid training a convolution encoder alongside a policy network, which is known to have issues related to sample efficiency, degenerated feature representations, and catastrophic self-overfitting. However, this paradigm can lead to representations of the environment that are not aligned with the downstream task, which may result in suboptimal performances. To address this limitation, this paper proposes RLAD, the first Reinforcement Learning from Pixels (RLfP) method applied in the urban AD domain. We propose several techniques to enhance the performance of an RLfP algorithm in this domain, including: i) an image encoder that leverages both image augmentations and Adaptive Local Signal Mixing (A-LIX) layers; ii) WayConv1D, which is a waypoint encoder that harnesses the 2D geometrical information of",
    "path": "papers/23/05/2305.18510.json",
    "total_tokens": 897,
    "translated_title": "RLAD：基于像素的强化学习在城市环境下自动驾驶中的应用",
    "translated_abstract": "当前应用于城市自动驾驶的强化学习（RL）方法主要集中在将感知训练与驾驶策略训练分离。主要原因是为了避免在策略网络旁边训练卷积编码器，因为这种方法在样本效率、特征表示退化和自我过度拟合等方面存在问题。然而，这种方法可能会导致环境表示与下游任务不一致，从而导致次优性能。本文提出了RLAD，这是首个在城市自动驾驶领域应用基于像素的强化学习（RLfP）方法。我们提出了几种技术来提高在此领域中RLfP算法的性能，包括：i）一种图像编码器，利用图像增强和自适应局部信号混合（A-LIX）层的优势；ii）WayConv1D，一种利用2D几何信息的路径点编码器。",
    "tldr": "RLAD是首个在城市自动驾驶领域应用基于像素的强化学习方法，通过优化图像编码器和路径点编码器等技术，可以提高自动驾驶的性能和效率。",
    "en_tdlr": "RLAD is the first Reinforcement Learning from Pixels method applied in the domain of urban Autonomous Driving. By optimizing techniques such as image encoder and waypoint encoder, it can improve the performance and efficiency of autonomous driving."
}