{
    "title": "DMDD: A Large-Scale Dataset for Dataset Mentions Detection. (arXiv:2305.11779v1 [cs.CL])",
    "abstract": "The recognition of dataset names is a critical task for automatic information extraction in scientific literature, enabling researchers to understand and identify research opportunities. However, existing corpora for dataset mention detection are limited in size and naming diversity. In this paper, we introduce the Dataset Mentions Detection Dataset (DMDD), the largest publicly available corpus for this task. DMDD consists of the DMDD main corpus, comprising 31,219 scientific articles with over 449,000 dataset mentions weakly annotated in the format of in-text spans, and an evaluation set, which comprises of 450 scientific articles manually annotated for evaluation purposes. We use DMDD to establish baseline performance for dataset mention detection and linking. By analyzing the performance of various models on DMDD, we are able to identify open problems in dataset mention detection. We invite the community to use our dataset as a challenge to develop novel dataset mention detection mo",
    "link": "http://arxiv.org/abs/2305.11779",
    "context": "Title: DMDD: A Large-Scale Dataset for Dataset Mentions Detection. (arXiv:2305.11779v1 [cs.CL])\nAbstract: The recognition of dataset names is a critical task for automatic information extraction in scientific literature, enabling researchers to understand and identify research opportunities. However, existing corpora for dataset mention detection are limited in size and naming diversity. In this paper, we introduce the Dataset Mentions Detection Dataset (DMDD), the largest publicly available corpus for this task. DMDD consists of the DMDD main corpus, comprising 31,219 scientific articles with over 449,000 dataset mentions weakly annotated in the format of in-text spans, and an evaluation set, which comprises of 450 scientific articles manually annotated for evaluation purposes. We use DMDD to establish baseline performance for dataset mention detection and linking. By analyzing the performance of various models on DMDD, we are able to identify open problems in dataset mention detection. We invite the community to use our dataset as a challenge to develop novel dataset mention detection mo",
    "path": "papers/23/05/2305.11779.json",
    "total_tokens": 889,
    "translated_title": "DMDD：面向数据集提及检测的大规模数据集",
    "translated_abstract": "数据集名称识别是科学文献自动信息提取的关键任务，可以帮助研究人员理解和识别研究机会。然而，现有的用于数据集提及检测的语料库在大小和命名多样性方面存在局限性。本文介绍了数据集提及检测数据集（DMDD），这是当前最大的公开语料库，用于处理这项任务。DMDD由DMDD主要语料库和评估集组成，其中DMDD主要语料库包括31,219篇科学文章，其中包含超过449,000个数据集提及弱注释格式的文本段，评估集包括450篇手动注释的科学文章，用于评估目的。我们使用DMDD建立了数据集提及检测和链接的基准性能。通过分析各种模型在DMDD上的表现，我们能够确定数据集提及检测中存在的问题。我们邀请社区使用我们的数据集作为挑战，开发新的数据集提及检测模型。",
    "tldr": "DMDD是一个公开的数据集，用于数据集提及检测任务，包含31,219篇科学文章和超过449,000个弱注释的数据集提及。该数据集为该任务建立了基准性能，并且通过分析模型的表现，确定了开放问题。"
}