{
    "title": "Cultivated Wildness: Technodiversity and Wildness in Machines. (arXiv:2305.02328v1 [cs.AI])",
    "abstract": "This paper investigates the idea of cultivated wildness at the intersection of landscape design and artificial intelligence. The paper posits that contemporary landscape practices should overcome the potentially single understanding on wilderness, and instead explore landscape strategies to cultivate new forms of wild places via ideas and concerns in contemporary Environmental Humanities, Science and Technology Studies, Ecological Sciences, and Landscape Architecture. Drawing cases in environmental engineering, computer science, and landscape architecture research, this paper explores a framework to construct wild places with intelligent machines. In this framework, machines are not understood as a layer of \"digital infrastructure\" that is used to extend localized human intelligence and agency. Rather machines are conceptualized as active agents who can participate in the intelligence of co-production. Recent developments in cybernetic technologies such as sensing networks, artificial ",
    "link": "http://arxiv.org/abs/2305.02328",
    "context": "Title: Cultivated Wildness: Technodiversity and Wildness in Machines. (arXiv:2305.02328v1 [cs.AI])\nAbstract: This paper investigates the idea of cultivated wildness at the intersection of landscape design and artificial intelligence. The paper posits that contemporary landscape practices should overcome the potentially single understanding on wilderness, and instead explore landscape strategies to cultivate new forms of wild places via ideas and concerns in contemporary Environmental Humanities, Science and Technology Studies, Ecological Sciences, and Landscape Architecture. Drawing cases in environmental engineering, computer science, and landscape architecture research, this paper explores a framework to construct wild places with intelligent machines. In this framework, machines are not understood as a layer of \"digital infrastructure\" that is used to extend localized human intelligence and agency. Rather machines are conceptualized as active agents who can participate in the intelligence of co-production. Recent developments in cybernetic technologies such as sensing networks, artificial ",
    "path": "papers/23/05/2305.02328.json",
    "total_tokens": 837,
    "translated_title": "培育野性：机器中的技术多样性与野性",
    "translated_abstract": "本文探讨了景观设计和人工智能交叉点上的培育野性的概念。本文认为，当代景观实践应该克服对野生状态单一理解的可能性，而是应该通过当代环境人文学、科学技术研究、生态学和景观建筑的思想和关注点，探索培育新形式的野生地点的景观策略。本文通过环境工程、计算机科学和景观建筑研究案例，探讨了构建具有智能机器的野生地点的框架。在这个框架中，机器不是被理解为一层“数字基础设施”，用于扩展本地化的人类智能和代理。相反，机器被概念化为能够参与共同生产智能的活动代理。近期的控制论技术发展，例如传感网络，人工智能等，开创了这种机器参与生产智能的可能性。",
    "tldr": "本研究探讨了通过机器构建野生地点的框架，将机器理解为能够参与生产智能的活动代理。",
    "en_tdlr": "This study explores a framework for constructing wild places with machines and conceptualizing machines as active agents who can participate in the intelligence of co-production."
}