{
    "title": "Predicting Unplanned Readmissions in the Intensive Care Unit: A Multimodality Evaluation. (arXiv:2305.08139v1 [cs.LG])",
    "abstract": "A hospital readmission is when a patient who was discharged from the hospital is admitted again for the same or related care within a certain period. Hospital readmissions are a significant problem in the healthcare domain, as they lead to increased hospitalization costs, decreased patient satisfaction, and increased risk of adverse outcomes such as infections, medication errors, and even death. The problem of hospital readmissions is particularly acute in intensive care units (ICUs), due to the severity of the patients' conditions, and the substantial risk of complications. Predicting Unplanned Readmissions in ICUs is a challenging task, as it involves analyzing different data modalities, such as static data, unstructured free text, sequences of diagnoses and procedures, and multivariate time-series. Here, we investigate the effectiveness of each data modality separately, then alongside with others, using state-of-the-art machine learning approaches in time-series analysis and natural",
    "link": "http://arxiv.org/abs/2305.08139",
    "context": "Title: Predicting Unplanned Readmissions in the Intensive Care Unit: A Multimodality Evaluation. (arXiv:2305.08139v1 [cs.LG])\nAbstract: A hospital readmission is when a patient who was discharged from the hospital is admitted again for the same or related care within a certain period. Hospital readmissions are a significant problem in the healthcare domain, as they lead to increased hospitalization costs, decreased patient satisfaction, and increased risk of adverse outcomes such as infections, medication errors, and even death. The problem of hospital readmissions is particularly acute in intensive care units (ICUs), due to the severity of the patients' conditions, and the substantial risk of complications. Predicting Unplanned Readmissions in ICUs is a challenging task, as it involves analyzing different data modalities, such as static data, unstructured free text, sequences of diagnoses and procedures, and multivariate time-series. Here, we investigate the effectiveness of each data modality separately, then alongside with others, using state-of-the-art machine learning approaches in time-series analysis and natural",
    "path": "papers/23/05/2305.08139.json",
    "total_tokens": 887,
    "tldr": "本研究探讨了使用不同的数据模式进行预测重症监护室非计划性再入院的有效性，采用最先进的机器学习方法。"
}