{
    "title": "Empirical Analysis of Oral and Nasal Vowels of Konkani. (arXiv:2305.10122v1 [cs.CL])",
    "abstract": "Konkani is a highly nasalised language which makes it unique among Indo-Aryan languages. This work investigates the acoustic-phonetic properties of Konkani oral and nasal vowels. For this study, speech samples from six speakers (3 male and 3 female) were collected. A total of 74 unique sentences were used as a part of the recording script, 37 each for oral and nasal vowels, respectively. The final data set consisted of 1135 vowel phonemes. A comparative F1-F2 plot of Konkani oral and nasal vowels is presented with an experimental result and formant analysis. The average F1, F2 and F3 values are also reported for the first time through experimentation for all nasal and oral vowels. This study can be helpful for the linguistic research on vowels and speech synthesis systems specific to the Konkani language.",
    "link": "http://arxiv.org/abs/2305.10122",
    "context": "Title: Empirical Analysis of Oral and Nasal Vowels of Konkani. (arXiv:2305.10122v1 [cs.CL])\nAbstract: Konkani is a highly nasalised language which makes it unique among Indo-Aryan languages. This work investigates the acoustic-phonetic properties of Konkani oral and nasal vowels. For this study, speech samples from six speakers (3 male and 3 female) were collected. A total of 74 unique sentences were used as a part of the recording script, 37 each for oral and nasal vowels, respectively. The final data set consisted of 1135 vowel phonemes. A comparative F1-F2 plot of Konkani oral and nasal vowels is presented with an experimental result and formant analysis. The average F1, F2 and F3 values are also reported for the first time through experimentation for all nasal and oral vowels. This study can be helpful for the linguistic research on vowels and speech synthesis systems specific to the Konkani language.",
    "path": "papers/23/05/2305.10122.json",
    "total_tokens": 896,
    "translated_title": "康卡尼语口腔和鼻腔元音的实证分析",
    "translated_abstract": "康卡尼语是一种高度鼻音化的语言，这使其在印度-雅利安语言中具有独特性。本研究探讨了康卡尼语口腔和鼻腔元音的声学-语音学特性。为此，收集了6名发言人（3男性和3女性）的语音样本。共使用了74个唯一句子作为录制脚本，分别为口腔和鼻腔元音37个。最终数据集由1135个元音音素组成。提供了康卡尼语口腔和鼻腔元音的比较F1-F2图以及实验结果和共振峰分析。所有鼻腔和口腔元音的平均F1，F2和F3值也首次通过实验报告。该研究可以帮助针对康卡尼语言的元音和语音合成系统的语言学研究。",
    "tldr": "本研究通过实验分析了康卡尼语口腔和鼻腔元音的声学-语音学特性，为康卡尼语言的语音合成系统和元音的语言学研究提供了帮助。",
    "en_tdlr": "This study provides an empirical analysis of the acoustic-phonetic properties of oral and nasal vowels in Konkani language and reports for the first time the average F1, F2 and F3 values for all nasal and oral vowels, which can be helpful for linguistic research and speech synthesis specific to Konkani language."
}