{
    "title": "AnoRand: A Semi Supervised Deep Learning Anomaly Detection Method by Random Labeling. (arXiv:2305.18389v1 [cs.LG])",
    "abstract": "Anomaly detection or more generally outliers detection is one of the most popular and challenging subject in theoretical and applied machine learning. The main challenge is that in general we have access to very few labeled data or no labels at all. In this paper, we present a new semi-supervised anomaly detection method called \\textbf{AnoRand} by combining a deep learning architecture with random synthetic label generation. The proposed architecture has two building blocks: (1) a noise detection (ND) block composed of feed forward ferceptron and (2) an autoencoder (AE) block. The main idea of this new architecture is to learn one class (e.g. the majority class in case of anomaly detection) as well as possible by taking advantage of the ability of auto encoders to represent data in a latent space and the ability of Feed Forward Perceptron (FFP) to learn one class when the data is highly imbalanced. First, we create synthetic anomalies by randomly disturbing (add noise) few samples (e.g",
    "link": "http://arxiv.org/abs/2305.18389",
    "context": "Title: AnoRand: A Semi Supervised Deep Learning Anomaly Detection Method by Random Labeling. (arXiv:2305.18389v1 [cs.LG])\nAbstract: Anomaly detection or more generally outliers detection is one of the most popular and challenging subject in theoretical and applied machine learning. The main challenge is that in general we have access to very few labeled data or no labels at all. In this paper, we present a new semi-supervised anomaly detection method called \\textbf{AnoRand} by combining a deep learning architecture with random synthetic label generation. The proposed architecture has two building blocks: (1) a noise detection (ND) block composed of feed forward ferceptron and (2) an autoencoder (AE) block. The main idea of this new architecture is to learn one class (e.g. the majority class in case of anomaly detection) as well as possible by taking advantage of the ability of auto encoders to represent data in a latent space and the ability of Feed Forward Perceptron (FFP) to learn one class when the data is highly imbalanced. First, we create synthetic anomalies by randomly disturbing (add noise) few samples (e.g",
    "path": "papers/23/05/2305.18389.json",
    "total_tokens": 934,
    "translated_title": "AnoRand: 一种半监督的深度学习异常检测方法，利用随机标注",
    "translated_abstract": "异常检测或者更一般的离群值检测是理论和应用机器学习中最受欢迎和具有挑战性的主题之一。其主要挑战在于通常访问非常少的有标签数据或根本没有标签。在本文中，我们通过将深度学习架构与随机合成标签生成相结合的方式，提出了一种新的半监督异常检测方法 \\textbf{AnoRand}。所提出的架构具有两个构建块：(1) 由前馈神经网络(feed forward ferceptron)组成的噪声检测(ND)块和(2) 自编码器(AE)块。这种新架构的主要思想是利用自编码器在潜空间中表示数据的能力和前馈神经网络在数据高度不平衡时学习一个类别的能力来尽可能地学习一个类别 (例如，在异常检测的情况下是大多数类别)。首先，我们通过随机扰动 (添加噪声) 少量样本 (例如。",
    "tldr": "本文提出了一种名为AnoRand的半监督深度学习异常检测方法，通过深度架构和随机合成标签生成相结合，能够尽可能地学习一个类别。",
    "en_tdlr": "AnoRand is a semi-supervised deep learning anomaly detection method, combining deep architecture with random synthetic label generation, which can learn one class as well as possible and achieve good results with few labeled data."
}