{
    "title": "Bayesian Reinforcement Learning with Limited Cognitive Load. (arXiv:2305.03263v1 [cs.LG])",
    "abstract": "All biological and artificial agents must learn and make decisions given limits on their ability to process information. As such, a general theory of adaptive behavior should be able to account for the complex interactions between an agent's learning history, decisions, and capacity constraints. Recent work in computer science has begun to clarify the principles that shape these dynamics by bridging ideas from reinforcement learning, Bayesian decision-making, and rate-distortion theory. This body of work provides an account of capacity-limited Bayesian reinforcement learning, a unifying normative framework for modeling the effect of processing constraints on learning and action selection. Here, we provide an accessible review of recent algorithms and theoretical results in this setting, paying special attention to how these ideas can be applied to studying questions in the cognitive and behavioral sciences.",
    "link": "http://arxiv.org/abs/2305.03263",
    "context": "Title: Bayesian Reinforcement Learning with Limited Cognitive Load. (arXiv:2305.03263v1 [cs.LG])\nAbstract: All biological and artificial agents must learn and make decisions given limits on their ability to process information. As such, a general theory of adaptive behavior should be able to account for the complex interactions between an agent's learning history, decisions, and capacity constraints. Recent work in computer science has begun to clarify the principles that shape these dynamics by bridging ideas from reinforcement learning, Bayesian decision-making, and rate-distortion theory. This body of work provides an account of capacity-limited Bayesian reinforcement learning, a unifying normative framework for modeling the effect of processing constraints on learning and action selection. Here, we provide an accessible review of recent algorithms and theoretical results in this setting, paying special attention to how these ideas can be applied to studying questions in the cognitive and behavioral sciences.",
    "path": "papers/23/05/2305.03263.json",
    "total_tokens": 835,
    "translated_title": "限制认知负荷的贝叶斯强化学习",
    "translated_abstract": "所有的生物和人工智能代理都必须在信息处理能力上有限制下进行学习和决策。因此，一般的自适应行为理论应该能够说明代理的学习历史、决策和能力限制之间的复杂互动。最近，计算机科学领域的研究开始通过将强化学习、贝叶斯决策和速率-失真理论的思想融合，澄清塑造这些动态的原则。这一领域的工作提供了一种会考虑处理限制对学习和动作选择的影响的统一规范框架，即容量有限的贝叶斯强化学习。在这里，我们提供了一篇易于理解的综述，介绍了这一领域的最新算法和理论成果，特别关注这些思想如何应用于研究认知和行为科学中的问题。",
    "tldr": "本文综述了限制认知负荷的贝叶斯强化学习的最新算法和理论成果，并讨论了这些思想如何应用于研究认知和行为科学中的问题。",
    "en_tdlr": "This paper provides an overview of the latest algorithms and theoretical results in capacity-limited Bayesian reinforcement learning, and discusses how these ideas can be applied to studying questions in the cognitive and behavioral sciences."
}