{
    "title": "Knowledge-enhanced Mixed-initiative Dialogue System for Emotional Support Conversations. (arXiv:2305.10172v1 [cs.CL])",
    "abstract": "Unlike empathetic dialogues, the system in emotional support conversations (ESC) is expected to not only convey empathy for comforting the help-seeker, but also proactively assist in exploring and addressing their problems during the conversation. In this work, we study the problem of mixed-initiative ESC where the user and system can both take the initiative in leading the conversation. Specifically, we conduct a novel analysis on mixed-initiative ESC systems with a tailor-designed schema that divides utterances into different types with speaker roles and initiative types. Four emotional support metrics are proposed to evaluate the mixed-initiative interactions. The analysis reveals the necessity and challenges of building mixed-initiative ESC systems. In the light of this, we propose a knowledge-enhanced mixed-initiative framework (KEMI) for ESC, which retrieves actual case knowledge from a large-scale mental health knowledge graph for generating mixed-initiative responses. Experimen",
    "link": "http://arxiv.org/abs/2305.10172",
    "context": "Title: Knowledge-enhanced Mixed-initiative Dialogue System for Emotional Support Conversations. (arXiv:2305.10172v1 [cs.CL])\nAbstract: Unlike empathetic dialogues, the system in emotional support conversations (ESC) is expected to not only convey empathy for comforting the help-seeker, but also proactively assist in exploring and addressing their problems during the conversation. In this work, we study the problem of mixed-initiative ESC where the user and system can both take the initiative in leading the conversation. Specifically, we conduct a novel analysis on mixed-initiative ESC systems with a tailor-designed schema that divides utterances into different types with speaker roles and initiative types. Four emotional support metrics are proposed to evaluate the mixed-initiative interactions. The analysis reveals the necessity and challenges of building mixed-initiative ESC systems. In the light of this, we propose a knowledge-enhanced mixed-initiative framework (KEMI) for ESC, which retrieves actual case knowledge from a large-scale mental health knowledge graph for generating mixed-initiative responses. Experimen",
    "path": "papers/23/05/2305.10172.json",
    "total_tokens": 934,
    "translated_title": "基于知识增强的混合主动对话情感支持系统",
    "translated_abstract": "与共情对话不同，情感支持对话系统需要在安慰求助者的同时主动帮助探索和解决问题。本文研究了混合主动情感支持对话的问题，其中用户和系统都可以在对话中采取主动。我们提出了一个用于评估混合主动情感支持对话的新型模式，并提出了四个情感支持指标来评价混合主动交互。分析揭示了构建混合主动情感支持对话系统的必要性和挑战。在此基础上，我们提出了基于知识增强的混合主动对话框架（KEMI），该框架从大型心理健康知识图谱中检索实际案例知识来生成混合主动响应。实验证明，KEMI在共情和问题解决能力方面显著优于几个基线模型。",
    "tldr": "本文针对情感支持对话系统的混合主动特点，提出了基于知识增强的混合主动对话框架，该框架从大型心理健康知识图谱中检索实际案例知识来生成混合主动响应，并在共情和问题解决能力方面显著优于几个基线模型。",
    "en_tdlr": "This paper proposes a knowledge-enhanced mixed-initiative dialogue system for emotional support conversations, which retrieves actual case knowledge from a large-scale mental health knowledge graph for generating mixed-initiative responses. The framework outperforms several baseline models in terms of both empathy and problem-solving capability."
}