{
    "title": "Active Reinforcement Learning for Personalized Stress Monitoring in Everyday Settings. (arXiv:2305.00111v1 [cs.LG])",
    "abstract": "Most existing sensor-based monitoring frameworks presume that a large available labeled dataset is processed to train accurate detection models. However, in settings where personalization is necessary at deployment time to fine-tune the model, a person-specific dataset needs to be collected online by interacting with the users. Optimizing the collection of labels in such phase is instrumental to impose a tolerable burden on the users while maximizing personal improvement. In this paper, we consider a fine-grain stress detection problem based on wearable sensors targeting everyday settings, and propose a novel context-aware active learning strategy capable of jointly maximizing the meaningfulness of the signal samples we request the user to label and the response rate. We develop a multilayered sensor-edge-cloud platform to periodically capture physiological signals and process them in real-time, as well as to collect labels and retrain the detection model. We collect a large dataset an",
    "link": "http://arxiv.org/abs/2305.00111",
    "context": "Title: Active Reinforcement Learning for Personalized Stress Monitoring in Everyday Settings. (arXiv:2305.00111v1 [cs.LG])\nAbstract: Most existing sensor-based monitoring frameworks presume that a large available labeled dataset is processed to train accurate detection models. However, in settings where personalization is necessary at deployment time to fine-tune the model, a person-specific dataset needs to be collected online by interacting with the users. Optimizing the collection of labels in such phase is instrumental to impose a tolerable burden on the users while maximizing personal improvement. In this paper, we consider a fine-grain stress detection problem based on wearable sensors targeting everyday settings, and propose a novel context-aware active learning strategy capable of jointly maximizing the meaningfulness of the signal samples we request the user to label and the response rate. We develop a multilayered sensor-edge-cloud platform to periodically capture physiological signals and process them in real-time, as well as to collect labels and retrain the detection model. We collect a large dataset an",
    "path": "papers/23/05/2305.00111.json",
    "total_tokens": 832,
    "translated_title": "日常环境中个性化压力监测的主动强化学习",
    "translated_abstract": "大多数基于传感器的监测框架都假定需要处理大量标记数据集来训练准确的检测模型。但是，在部署时间需要个性化微调模型的情况下，需要通过与用户交互在线收集特定于个人的数据集。在这个阶段优化标签的收集是施加可容忍的用户负担的关键，同时最大化个人的改善。本文考虑基于可穿戴传感器的细粒度压力检测问题，提出了一种新颖的上下文感知的主动学习策略，可以共同最大化有意义的信号样本的请求和回应率。我们开发了一个多层传感器边缘云平台，以定期捕获生理信号并实时处理它们，以及收集标签并重新训练检测模型。我们收集了一个大的数据集。",
    "tldr": "本文提出了一种上下文感知的主动学习策略，以在部署时间为个性化微调模型的情况下，在日常环境中进行细粒度的压力检测。",
    "en_tdlr": "This paper proposes a context-aware active learning strategy to perform fine-grain stress detection in everyday settings with personalized refinement of the model during deployment time by collecting person-specific dataset online through user interactions."
}