{
    "title": "Link Prediction without Graph Neural Networks. (arXiv:2305.13656v1 [cs.LG])",
    "abstract": "Link prediction, which consists of predicting edges based on graph features, is a fundamental task in many graph applications. As for several related problems, Graph Neural Networks (GNNs), which are based on an attribute-centric message-passing paradigm, have become the predominant framework for link prediction. GNNs have consistently outperformed traditional topology-based heuristics, but what contributes to their performance? Are there simpler approaches that achieve comparable or better results? To answer these questions, we first identify important limitations in how GNN-based link prediction methods handle the intrinsic class imbalance of the problem -- due to the graph sparsity -- in their training and evaluation. Moreover, we propose Gelato, a novel topology-centric framework that applies a topological heuristic to a graph enhanced by attribute information via graph learning. Our model is trained end-to-end with an N-pair loss on an unbiased training set to address class imbala",
    "link": "http://arxiv.org/abs/2305.13656",
    "context": "Title: Link Prediction without Graph Neural Networks. (arXiv:2305.13656v1 [cs.LG])\nAbstract: Link prediction, which consists of predicting edges based on graph features, is a fundamental task in many graph applications. As for several related problems, Graph Neural Networks (GNNs), which are based on an attribute-centric message-passing paradigm, have become the predominant framework for link prediction. GNNs have consistently outperformed traditional topology-based heuristics, but what contributes to their performance? Are there simpler approaches that achieve comparable or better results? To answer these questions, we first identify important limitations in how GNN-based link prediction methods handle the intrinsic class imbalance of the problem -- due to the graph sparsity -- in their training and evaluation. Moreover, we propose Gelato, a novel topology-centric framework that applies a topological heuristic to a graph enhanced by attribute information via graph learning. Our model is trained end-to-end with an N-pair loss on an unbiased training set to address class imbala",
    "path": "papers/23/05/2305.13656.json",
    "total_tokens": 947,
    "translated_title": "不需图神经网络的链路预测",
    "translated_abstract": "链路预测是许多图应用中的基本任务，它基于图特征来预测边。对于几个相关问题，基于属性中心的消息传递范式的图神经网络（GNN）已成为链路预测的主导框架。GNN始终优于传统的基于拓扑的启发式方法，但是是什么让它们表现优秀呢？是否有更简单的方法实现相似或更好的结果？为了回答这些问题，我们首先确定了GNN-based链路预测方法如何处理问题本质上存在的类不平衡性（由于图的稀疏性导致）在其训练和评估中的重要限制。此外，我们提出了Gelato，这是一种新的面向拓扑特征的框架，它通过图学习将属性信息应用于增强的图中的拓扑启发式。我们的模型通过N-pair损失在不偏的训练集上进行端到端的训练，以解决类不平衡问题。",
    "tldr": "本文提出了一种无需使用图神经网络的链路预测算法，Gelato，该算法采用了一种新的拓扑启发式方法，通过图学习将属性特征集成到拓扑特征中。实验结果表明它可以在类不平衡的情况下有效地进行链路预测。",
    "en_tdlr": "This paper proposes a link prediction algorithm, Gelato, that does not rely on Graph Neural Networks (GNNs) and instead uses a novel topology-centric approach. The model integrates attribute information with topological features using graph learning and is trained with an N-pair loss on an unbiased training set to address class imbalance. The experiments show that Gelato can effectively predict links in class-imbalanced scenarios."
}