{
    "title": "Is end-to-end learning enough for fitness activity recognition?. (arXiv:2305.08191v1 [cs.CV])",
    "abstract": "End-to-end learning has taken hold of many computer vision tasks, in particular, related to still images, with task-specific optimization yielding very strong performance. Nevertheless, human-centric action recognition is still largely dominated by hand-crafted pipelines, and only individual components are replaced by neural networks that typically operate on individual frames. As a testbed to study the relevance of such pipelines, we present a new fully annotated video dataset of fitness activities. Any recognition capabilities in this domain are almost exclusively a function of human poses and their temporal dynamics, so pose-based solutions should perform well. We show that, with this labelled data, end-to-end learning on raw pixels can compete with state-of-the-art action recognition pipelines based on pose estimation. We also show that end-to-end learning can support temporally fine-grained tasks such as real-time repetition counting.",
    "link": "http://arxiv.org/abs/2305.08191",
    "context": "Title: Is end-to-end learning enough for fitness activity recognition?. (arXiv:2305.08191v1 [cs.CV])\nAbstract: End-to-end learning has taken hold of many computer vision tasks, in particular, related to still images, with task-specific optimization yielding very strong performance. Nevertheless, human-centric action recognition is still largely dominated by hand-crafted pipelines, and only individual components are replaced by neural networks that typically operate on individual frames. As a testbed to study the relevance of such pipelines, we present a new fully annotated video dataset of fitness activities. Any recognition capabilities in this domain are almost exclusively a function of human poses and their temporal dynamics, so pose-based solutions should perform well. We show that, with this labelled data, end-to-end learning on raw pixels can compete with state-of-the-art action recognition pipelines based on pose estimation. We also show that end-to-end learning can support temporally fine-grained tasks such as real-time repetition counting.",
    "path": "papers/23/05/2305.08191.json",
    "total_tokens": 901,
    "translated_title": "端到端的学习是否足以支持健身活动识别？",
    "translated_abstract": "端到端学习已经被广泛应用于许多计算机视觉任务中，尤其是与静止图像相关的任务，由于任务特定的优化产生了非常强大的性能。然而，以人为中心的行为识别仍然主要由手工设计的流程控制着，只有个别组件被神经网络替换，这些网络通常只在单个帧上运行。作为对这些流程的相关性进行研究的实验，我们提供了一个新的全面注释的健身活动视频数据集。任何在这个领域中的识别能力几乎都是由人体姿势及其时间动态的函数，因此基于姿势的解决方案应该会表现得很好。我们展示了，在这些标记数据的基础上，基于原始像素的端到端学习可以与基于姿势估计的最先进的动作识别流程相竞争。我们还展示了，端到端学习可以支持实时的重复计数等时间上的细粒度任务。",
    "tldr": "该研究使用全面注释的健身活动视频数据集，表明基于像素的端到端学习可以与基于姿势估计的最先进的动作识别流程相竞争，同时还可以支持时间上的细粒度任务。",
    "en_tdlr": "With a fully annotated video dataset of fitness activities, the study shows that end-to-end learning on raw pixels can compete with state-of-the-art action recognition pipelines based on pose estimation, while also supporting fine-grained temporal tasks such as real-time repetition counting."
}