{
    "title": "Geometric Latent Diffusion Models for 3D Molecule Generation. (arXiv:2305.01140v1 [cs.LG])",
    "abstract": "Generative models, especially diffusion models (DMs), have achieved promising results for generating feature-rich geometries and advancing foundational science problems such as molecule design. Inspired by the recent huge success of Stable (latent) Diffusion models, we propose a novel and principled method for 3D molecule generation named Geometric Latent Diffusion Models (GeoLDM). GeoLDM is the first latent DM model for the molecular geometry domain, composed of autoencoders encoding structures into continuous latent codes and DMs operating in the latent space. Our key innovation is that for modeling the 3D molecular geometries, we capture its critical roto-translational equivariance constraints by building a point-structured latent space with both invariant scalars and equivariant tensors. Extensive experiments demonstrate that GeoLDM can consistently achieve better performance on multiple molecule generation benchmarks, with up to 7\\% improvement for the valid percentage of large bi",
    "link": "http://arxiv.org/abs/2305.01140",
    "context": "Title: Geometric Latent Diffusion Models for 3D Molecule Generation. (arXiv:2305.01140v1 [cs.LG])\nAbstract: Generative models, especially diffusion models (DMs), have achieved promising results for generating feature-rich geometries and advancing foundational science problems such as molecule design. Inspired by the recent huge success of Stable (latent) Diffusion models, we propose a novel and principled method for 3D molecule generation named Geometric Latent Diffusion Models (GeoLDM). GeoLDM is the first latent DM model for the molecular geometry domain, composed of autoencoders encoding structures into continuous latent codes and DMs operating in the latent space. Our key innovation is that for modeling the 3D molecular geometries, we capture its critical roto-translational equivariance constraints by building a point-structured latent space with both invariant scalars and equivariant tensors. Extensive experiments demonstrate that GeoLDM can consistently achieve better performance on multiple molecule generation benchmarks, with up to 7\\% improvement for the valid percentage of large bi",
    "path": "papers/23/05/2305.01140.json",
    "total_tokens": 1014,
    "translated_title": "三维分子生成的几何潜在扩散模型",
    "translated_abstract": "生成模型，特别是扩散模型（DMs），已经在生成富有特征的几何图形和推进分子设计等基础科学问题方面取得了有希望的结果。受到潜在扩散模型稳定性的最新巨大成功的启发，我们提出了一种新的、有原则的三维分子生成方法，称为几何潜在扩散模型（GeoLDM）。GeoLDM是分子几何领域的第一个潜在DM模型，由将结构编码为连续潜在码的自编码器和在潜在空间中操作的DM组成。我们的关键创新在于对于三维分子几何建模，我们通过建立具有不变标量和等变张量的点结构潜在空间来捕捉其关键的旋转平移等变性约束。广泛的实验表明，GeoLDM在多个分子生成基准测试中都能够稳定地实现更好的性能，其中在大型双较差分子的有效百分比方面提高了7％。",
    "tldr": "提出了三维分子生成的几何潜在扩散模型（GeoLDM），是分子几何领域的第一个潜在扩散模型，通过建立具有不变标量和等变张量的点结构潜在空间来捕捉其关键的旋转平移等变性约束，能够在多个分子生成基准测试中达到更好的性能。"
}