{
    "title": "DualHSIC: HSIC-Bottleneck and Alignment for Continual Learning. (arXiv:2305.00380v1 [cs.LG])",
    "abstract": "Rehearsal-based approaches are a mainstay of continual learning (CL). They mitigate the catastrophic forgetting problem by maintaining a small fixed-size buffer with a subset of data from past tasks. While most rehearsal-based approaches study how to effectively exploit the knowledge from the buffered past data, little attention is paid to the inter-task relationships with the critical task-specific and task-invariant knowledge. By appropriately leveraging inter-task relationships, we propose a novel CL method named DualHSIC to boost the performance of existing rehearsal-based methods in a simple yet effective way. DualHSIC consists of two complementary components that stem from the so-called Hilbert Schmidt independence criterion (HSIC): HSIC-Bottleneck for Rehearsal (HBR) lessens the inter-task interference and HSIC Alignment (HA) promotes task-invariant knowledge sharing. Extensive experiments show that DualHSIC can be seamlessly plugged into existing rehearsal-based methods for con",
    "link": "http://arxiv.org/abs/2305.00380",
    "context": "Title: DualHSIC: HSIC-Bottleneck and Alignment for Continual Learning. (arXiv:2305.00380v1 [cs.LG])\nAbstract: Rehearsal-based approaches are a mainstay of continual learning (CL). They mitigate the catastrophic forgetting problem by maintaining a small fixed-size buffer with a subset of data from past tasks. While most rehearsal-based approaches study how to effectively exploit the knowledge from the buffered past data, little attention is paid to the inter-task relationships with the critical task-specific and task-invariant knowledge. By appropriately leveraging inter-task relationships, we propose a novel CL method named DualHSIC to boost the performance of existing rehearsal-based methods in a simple yet effective way. DualHSIC consists of two complementary components that stem from the so-called Hilbert Schmidt independence criterion (HSIC): HSIC-Bottleneck for Rehearsal (HBR) lessens the inter-task interference and HSIC Alignment (HA) promotes task-invariant knowledge sharing. Extensive experiments show that DualHSIC can be seamlessly plugged into existing rehearsal-based methods for con",
    "path": "papers/23/05/2305.00380.json",
    "total_tokens": 858,
    "translated_title": "基于HSIC瓶颈和对齐的双重HSIC实现连续学习",
    "translated_abstract": "基于重新学习的方法是连续学习的主要方法，通过保持小型固定大小的缓冲区来控制灾难性遗忘问题。尽管大多数基于重新学习的方法研究如何有效地利用缓冲区中过去数据中的知识，但很少注意到关键的任务特定和任务不变知识的跨任务关系。通过适当地利用跨任务关系，我们提出了一种名为DualHSIC的新的连续学习方法，以简单而有效的方式提高现有基于重新学习的方法的性能。DualHSIC由两个互补的组件组成，源自所谓的希尔伯特-施密特独立准则（HSIC）：HSIC-Bottleneck for Rehearsal (HBR)减少跨任务干扰，HSIC Alignment (HA)促进任务不变知识共享。广泛的实验表明，DualHSIC可以无缝地插入现有的基于重新学习的方法进行连续学习，并显著提高它们的性能。",
    "tldr": "DualHSIC通过利用跨任务关系，提高了基于重新学习方法的连续学习性能。",
    "en_tdlr": "DualHSIC improves the performance of rehearsal-based continual learning methods by utilizing inter-task relationships."
}