{
    "title": "Constructing a personalized AI assistant for shear wall layout using Stable Diffusion. (arXiv:2305.10830v1 [cs.AI])",
    "abstract": "Shear wall structures are widely used in high-rise residential buildings, and the layout of shear walls requires many years of design experience and iterative trial and error. Currently, there are methods based on heuristic algorithms, but they generate results too slowly. Those based on Generative Adversarial Networks (GANs) or Graph Neural Networks (GNNs) can only generate single arrangements and require large amounts of training data. At present, Stable Diffusion is being widely used, and by using the Low-Rank Adaptation (LoRA) method to fine-tune large models with small amounts of data, good generative results can be achieved. Therefore, this paper proposes a personalized AI assistant for shear wall layout based on Stable Diffusion, which has been proven to produce good generative results through testing.",
    "link": "http://arxiv.org/abs/2305.10830",
    "context": "Title: Constructing a personalized AI assistant for shear wall layout using Stable Diffusion. (arXiv:2305.10830v1 [cs.AI])\nAbstract: Shear wall structures are widely used in high-rise residential buildings, and the layout of shear walls requires many years of design experience and iterative trial and error. Currently, there are methods based on heuristic algorithms, but they generate results too slowly. Those based on Generative Adversarial Networks (GANs) or Graph Neural Networks (GNNs) can only generate single arrangements and require large amounts of training data. At present, Stable Diffusion is being widely used, and by using the Low-Rank Adaptation (LoRA) method to fine-tune large models with small amounts of data, good generative results can be achieved. Therefore, this paper proposes a personalized AI assistant for shear wall layout based on Stable Diffusion, which has been proven to produce good generative results through testing.",
    "path": "papers/23/05/2305.10830.json",
    "total_tokens": 782,
    "translated_title": "基于稳定扩散的个性化剪力墙布置智能助手",
    "translated_abstract": "剪力墙结构广泛用于高层住宅建筑，剪力墙的布置需要多年的设计经验和迭代试错。目前，基于启发式算法的方法存在结果生成过慢的问题。基于生成对抗网络（GANs）或图神经网络（GNNs）的方法仅能生成单一的布置方案，并且需要大量的训练数据。由于稳定扩散方法目前得到了广泛应用，通过使用低秩适应（LoRA）方法来微调大模型，利用少量的数据就能取得良好的生成效果。因此，本文提出了一个基于稳定扩散的个性化剪力墙布置智能助手，通过测试已经证明可以产生良好的生成结果。",
    "tldr": "本文提出了一个基于稳定扩散的个性化剪力墙布置智能助手，它可以帮助设计人员快速生成具有良好生成效果的剪力墙布置方案。",
    "en_tdlr": "This paper proposes a personalized AI assistant for shear wall layout based on Stable Diffusion, which can assist designers in quickly generating shear wall layout schemes with good generative results."
}