{
    "title": "BARA: Efficient Incentive Mechanism with Online Reward Budget Allocation in Cross-Silo Federated Learning. (arXiv:2305.05221v1 [cs.LG])",
    "abstract": "Federated learning (FL) is a prospective distributed machine learning framework that can preserve data privacy. In particular, cross-silo FL can complete model training by making isolated data islands of different organizations collaborate with a parameter server (PS) via exchanging model parameters for multiple communication rounds. In cross-silo FL, an incentive mechanism is indispensable for motivating data owners to contribute their models to FL training. However, how to allocate the reward budget among different rounds is an essential but complicated problem largely overlooked by existing works. The challenge of this problem lies in the opaque feedback between reward budget allocation and model utility improvement of FL, making the optimal reward budget allocation complicated. To address this problem, we design an online reward budget allocation algorithm using Bayesian optimization named BARA (\\underline{B}udget \\underline{A}llocation for \\underline{R}everse \\underline{A}uction).",
    "link": "http://arxiv.org/abs/2305.05221",
    "context": "Title: BARA: Efficient Incentive Mechanism with Online Reward Budget Allocation in Cross-Silo Federated Learning. (arXiv:2305.05221v1 [cs.LG])\nAbstract: Federated learning (FL) is a prospective distributed machine learning framework that can preserve data privacy. In particular, cross-silo FL can complete model training by making isolated data islands of different organizations collaborate with a parameter server (PS) via exchanging model parameters for multiple communication rounds. In cross-silo FL, an incentive mechanism is indispensable for motivating data owners to contribute their models to FL training. However, how to allocate the reward budget among different rounds is an essential but complicated problem largely overlooked by existing works. The challenge of this problem lies in the opaque feedback between reward budget allocation and model utility improvement of FL, making the optimal reward budget allocation complicated. To address this problem, we design an online reward budget allocation algorithm using Bayesian optimization named BARA (\\underline{B}udget \\underline{A}llocation for \\underline{R}everse \\underline{A}uction).",
    "path": "papers/23/05/2305.05221.json",
    "total_tokens": 937,
    "translated_title": "BARA: 高效的在线奖励预算分配跨边缘联邦学习激励机制",
    "translated_abstract": "联邦学习（FL）是一种有前途的分布式机器学习框架，可以保护数据隐私。跨边缘联邦学习通过交换多个通信循环的模型参数，使不同组织的孤立数据岛协作一个参数服务器（PS）来完成模型训练。在跨边缘FL中，激励机制对于激励数据所有者为FL训练做出贡献是必不可少的。然而，如何在不同的循环之间分配奖励预算是一个重要但被现有研究大量忽略的复杂问题。解决这个问题的挑战在于奖励预算分配和FL模型效用改进之间的不透明反馈，使得最优奖励预算分配变得复杂。为了解决这个问题，我们设计了一种使用贝叶斯优化的在线奖励预算分配算法，名为BARA（\\underline{B}udget \\underline{A}llocation for \\underline{R}everse \\underline{A}uction）。",
    "tldr": "BARA是一种在线奖励预算分配算法，用于激励跨边缘联邦学习中的数据所有者为模型训练做出贡献，并解决了现有研究中被忽略的奖励预算分配问题。",
    "en_tdlr": "BARA is an online reward budget allocation algorithm designed for motivating data owners to contribute to model training in cross-silo federated learning, and addresses the overlooked problem of how to allocate the reward budget in existing works."
}