{
    "title": "Widespread Increases in Future Wildfire Risk to Global Forest Carbon Offset Projects Revealed by Explainable AI. (arXiv:2305.02397v1 [cs.LG])",
    "abstract": "Carbon offset programs are critical in the fight against climate change. One emerging threat to the long-term stability and viability of forest carbon offset projects is wildfires, which can release large amounts of carbon and limit the efficacy of associated offsetting credits. However, analysis of wildfire risk to forest carbon projects is challenging because existing models for forecasting long-term fire risk are limited in predictive accuracy. Therefore, we propose an explainable artificial intelligence (XAI) model trained on 7 million global satellite wildfire observations. Validation results suggest substantial potential for high resolution, enhanced accuracy projections of global wildfire risk, and the model outperforms the U.S. National Center for Atmospheric Research's leading fire model. Applied to a collection of 190 global forest carbon projects, we find that fire exposure is projected to increase 55% [37-76%] by 2080 under a mid-range scenario (SSP2-4.5). Our results indic",
    "link": "http://arxiv.org/abs/2305.02397",
    "context": "Title: Widespread Increases in Future Wildfire Risk to Global Forest Carbon Offset Projects Revealed by Explainable AI. (arXiv:2305.02397v1 [cs.LG])\nAbstract: Carbon offset programs are critical in the fight against climate change. One emerging threat to the long-term stability and viability of forest carbon offset projects is wildfires, which can release large amounts of carbon and limit the efficacy of associated offsetting credits. However, analysis of wildfire risk to forest carbon projects is challenging because existing models for forecasting long-term fire risk are limited in predictive accuracy. Therefore, we propose an explainable artificial intelligence (XAI) model trained on 7 million global satellite wildfire observations. Validation results suggest substantial potential for high resolution, enhanced accuracy projections of global wildfire risk, and the model outperforms the U.S. National Center for Atmospheric Research's leading fire model. Applied to a collection of 190 global forest carbon projects, we find that fire exposure is projected to increase 55% [37-76%] by 2080 under a mid-range scenario (SSP2-4.5). Our results indic",
    "path": "papers/23/05/2305.02397.json",
    "total_tokens": 1014,
    "translated_title": "可解释人工智能揭示全球森林碳抵消项目未来火灾风险普遍上升",
    "translated_abstract": "碳抵消计划在应对气候变化方面至关重要。森林碳抵消项目长期稳定和可行性面临的一个新威胁是山火，可以释放大量碳并限制相关抵消积分的功效。然而，分析森林碳项目的火灾风险是具有挑战性的，因为现有的长期火灾风险预测模型在预测准确性方面受到限制。因此，我们提出了一个可解释的人工智能（XAI）模型，基于700万全球卫星野火观测数据进行训练。验证结果表明，具有高分辨率、增强准确性的全球野火风险预测具有巨大的潜力，且该模型优于美国国家大气研究中心的领先火灾模型。应用于190个全球森林碳项目的集合中，我们发现在中等情景下（SSP2-4.5），火灾暴露预计会在2080年上升55% [37-76%]。我们的结果表明，全球森林碳抵消项目面临更大的火灾风险。",
    "tldr": "研究利用可解释人工智能模型对全球森林野火风险进行了预测，发现2050年到2080年期间，全球森林碳抵消项目将面临更大的火灾风险，其中火灾的暴露程度预计将增加55%[37-76%]。"
}