{
    "title": "CUTS+: High-dimensional Causal Discovery from Irregular Time-series. (arXiv:2305.05890v1 [cs.LG])",
    "abstract": "Causal discovery in time-series is a fundamental problem in the machine learning community, enabling causal reasoning and decision-making in complex scenarios. Recently, researchers successfully discover causality by combining neural networks with Granger causality, but their performances degrade largely when encountering high-dimensional data because of the highly redundant network design and huge causal graphs. Moreover, the missing entries in the observations further hamper the causal structural learning. To overcome these limitations, We propose CUTS+, which is built on the Granger-causality-based causal discovery method CUTS and raises the scalability by introducing a technique called Coarse-to-fine-discovery (C2FD) and leveraging a message-passing-based graph neural network (MPGNN). Compared to previous methods on simulated, quasi-real, and real datasets, we show that CUTS+ largely improves the causal discovery performance on high-dimensional data with different types of irregula",
    "link": "http://arxiv.org/abs/2305.05890",
    "context": "Title: CUTS+: High-dimensional Causal Discovery from Irregular Time-series. (arXiv:2305.05890v1 [cs.LG])\nAbstract: Causal discovery in time-series is a fundamental problem in the machine learning community, enabling causal reasoning and decision-making in complex scenarios. Recently, researchers successfully discover causality by combining neural networks with Granger causality, but their performances degrade largely when encountering high-dimensional data because of the highly redundant network design and huge causal graphs. Moreover, the missing entries in the observations further hamper the causal structural learning. To overcome these limitations, We propose CUTS+, which is built on the Granger-causality-based causal discovery method CUTS and raises the scalability by introducing a technique called Coarse-to-fine-discovery (C2FD) and leveraging a message-passing-based graph neural network (MPGNN). Compared to previous methods on simulated, quasi-real, and real datasets, we show that CUTS+ largely improves the causal discovery performance on high-dimensional data with different types of irregula",
    "path": "papers/23/05/2305.05890.json",
    "total_tokens": 926,
    "translated_title": "CUTS+：基于非规则时间序列的高维因果发现",
    "translated_abstract": "时间序列中的因果关系发现是机器学习领域中一个根本性的问题，可以在复杂情境下进行因果推理和决策制定。最近，研究人员成功地通过将神经网络与 Granger 因果相结合来发现因果关系，但是当遇到高维数据时，由于高度冗余的网络设计和庞大的因果图，它们的性能会严重下降。此外，观察值中的缺失条目进一步阻碍了因果结构学习。为了克服这些限制，我们提出 CUTS+，它建立在基于 Granger 因果的因果发现方法 CUTS 上，并通过引入一种称为粗到细发现（C2FD）的技术和利用基于消息传递的图神经网络（MPGNN）提高了可扩展性。与之前的方法在模拟、准实际和真实数据集上相比，我们展示了 CUTS+ 在不同类型的非规则高维数据上大大提高了因果发现的性能。",
    "tldr": "CUTS+是一种基于Granger因果和图神经网络(MPGNN)的因果发现算法，通过引入粗到细发现（C2FD）技术提高可扩展性。实验结果表明，CUTS+在非规则高维数据上的因果发现性能大幅度提高。",
    "en_tdlr": "CUTS+ is a causal discovery algorithm based on Granger causality and graph neural network (MPGNN), which improves scalability by introducing a Coarse-to-fine-discovery (C2FD) technique. Experimental results show that CUTS+ significantly improves causal discovery performance on irregular high-dimensional data."
}