{
    "title": "Evaluation Strategy of Time-series Anomaly Detection with Decay Function. (arXiv:2305.09691v1 [cs.LG])",
    "abstract": "Recent algorithms of time-series anomaly detection have been evaluated by applying a Point Adjustment (PA) protocol. However, the PA protocol has a problem of overestimating the performance of the detection algorithms because it only depends on the number of detected abnormal segments and their size. We propose a novel evaluation protocol called the Point-Adjusted protocol with decay function (PAdf) to evaluate the time-series anomaly detection algorithm by reflecting the following ideal requirements: detect anomalies quickly and accurately without false alarms. This paper theoretically and experimentally shows that the PAdf protocol solves the over- and under-estimation problems of existing protocols such as PA and PA\\%K. By conducting re-evaluations of SOTA models in benchmark datasets, we show that the PA protocol only focuses on finding many anomalous segments, whereas the score of the PAdf protocol considers not only finding many segments but also detecting anomalies quickly witho",
    "link": "http://arxiv.org/abs/2305.09691",
    "context": "Title: Evaluation Strategy of Time-series Anomaly Detection with Decay Function. (arXiv:2305.09691v1 [cs.LG])\nAbstract: Recent algorithms of time-series anomaly detection have been evaluated by applying a Point Adjustment (PA) protocol. However, the PA protocol has a problem of overestimating the performance of the detection algorithms because it only depends on the number of detected abnormal segments and their size. We propose a novel evaluation protocol called the Point-Adjusted protocol with decay function (PAdf) to evaluate the time-series anomaly detection algorithm by reflecting the following ideal requirements: detect anomalies quickly and accurately without false alarms. This paper theoretically and experimentally shows that the PAdf protocol solves the over- and under-estimation problems of existing protocols such as PA and PA\\%K. By conducting re-evaluations of SOTA models in benchmark datasets, we show that the PA protocol only focuses on finding many anomalous segments, whereas the score of the PAdf protocol considers not only finding many segments but also detecting anomalies quickly witho",
    "path": "papers/23/05/2305.09691.json",
    "total_tokens": 946,
    "translated_title": "带衰减函数的时间序列异常检测评估策略",
    "translated_abstract": "近期，时间序列异常检测算法一般采用点调整协议来评估其性能。然而，这种协议容易高估检测算法的性能，因为它只考虑检测到的异常段数和大小。本文提出了一种新的评估协议——带衰减函数的点调整协议（PAdf），以评估时间序列异常检测算法的性能。该协议考虑了快速准确地检测异常和避免误报的理想要求。本文从理论和实验两个方面证明了PAdf协议解决了现有协议如PA和PA\\%K等的高估和低估问题。通过在基准数据集上重新评估SOTA模型，我们发现PA协议只考虑查找尽可能多的异常段，而PAdf协议则不仅考虑查找尽可能多的段数，同时还考虑快速检测异常。",
    "tldr": "本文提出了带衰减函数的点调整协议（PAdf）以解决现有时间序列异常检测算法评估方式高估或低估性能的问题。通过在基准数据集上的重新评估，我们发现PAdf协议不仅考虑要查找尽可能多的段数，还考虑快速准确地检测异常。",
    "en_tdlr": "This paper proposes the Point-Adjusted protocol with decay function (PAdf) to address the over- or under-estimation issue in evaluating the performance of time-series anomaly detection algorithms. The PAdf protocol considers not only finding as many segments as possible but also detecting anomalies quickly and accurately. The protocol is experimentally shown to outperform existing evaluation protocols such as PA and PA\\%K."
}