{
    "title": "Molecular design method based on novel molecular representation and variational auto-encoder. (arXiv:2305.01580v1 [q-bio.BM])",
    "abstract": "Based on the traditional VAE, a novel neural network model is presented, with the latest molecular representation, SELFIES, to improve the effect of generating new molecules. In this model, multi-layer convolutional network and Fisher information are added to the original encoding layer to learn the data characteristics and guide the encoding process, which makes the features of the data hiding layer more aggregated, and integrates the Long Short Term Memory neural network (LSTM) into the decoding layer for better data generation, which effectively solves the degradation phenomenon generated by the encoding layer and decoding layer of the original VAE model. Through experiments on zinc molecular data sets, it is found that the similarity in the new VAE is 8.47% higher than that of the original ones. SELFIES are better at generating a variety of molecules than the traditional molecular representation, SELFIES. Experiments have shown that using SELFIES and the new VAE model presented in ",
    "link": "http://arxiv.org/abs/2305.01580",
    "context": "Title: Molecular design method based on novel molecular representation and variational auto-encoder. (arXiv:2305.01580v1 [q-bio.BM])\nAbstract: Based on the traditional VAE, a novel neural network model is presented, with the latest molecular representation, SELFIES, to improve the effect of generating new molecules. In this model, multi-layer convolutional network and Fisher information are added to the original encoding layer to learn the data characteristics and guide the encoding process, which makes the features of the data hiding layer more aggregated, and integrates the Long Short Term Memory neural network (LSTM) into the decoding layer for better data generation, which effectively solves the degradation phenomenon generated by the encoding layer and decoding layer of the original VAE model. Through experiments on zinc molecular data sets, it is found that the similarity in the new VAE is 8.47% higher than that of the original ones. SELFIES are better at generating a variety of molecules than the traditional molecular representation, SELFIES. Experiments have shown that using SELFIES and the new VAE model presented in ",
    "path": "papers/23/05/2305.01580.json",
    "total_tokens": 985,
    "translated_title": "基于新型分子表示与变分自编码器的分子设计方法",
    "translated_abstract": "本论文在传统的变分自编码器的基础上采用最新的分子表示方法SELFIES，提出一种改进后的神经网络模型用于生成新的分子，该模型结合了多层卷积网络、费舍尔信息和长短期记忆神经网络，通过聚合数据特征和指导编码过程等手段，有效解决了原始变分自编码器模型的问题。实验结果表明，使用SELFIES和新的变分自编码器模型可以生成更多种类的分子，且生成的分子相似度较高。",
    "tldr": "本论文提出了一种基于SELFIES分子表示和改进后的变分自编码器模型的分子设计方法，用于生成更多种类的分子。",
    "en_tdlr": "This paper proposes a molecular design method based on SELFIES molecular representation and an improved variational autoencoder model to generate a greater variety of molecules."
}