{
    "title": "Sequential Condition Evolved Interaction Knowledge Graph for Traditional Chinese Medicine Recommendation. (arXiv:2305.17866v2 [cs.AI] UPDATED)",
    "abstract": "Traditional Chinese Medicine (TCM) has a rich history of utilizing natural herbs to treat a diversity of illnesses. In practice, TCM diagnosis and treatment are highly personalized and organically holistic, requiring comprehensive consideration of the patient's state and symptoms over time. However, existing TCM recommendation approaches overlook the changes in patient status and only explore potential patterns between symptoms and prescriptions. In this paper, we propose a novel Sequential Condition Evolved Interaction Knowledge Graph (SCEIKG), a framework that treats the model as a sequential prescription-making problem by considering the dynamics of the patient's condition across multiple visits. In addition, we incorporate an interaction knowledge graph to enhance the accuracy of recommendations by considering the interactions between different herbs and the patient's condition. Experimental results on a real-world dataset demonstrate that our approach outperforms existing TCM reco",
    "link": "http://arxiv.org/abs/2305.17866",
    "context": "Title: Sequential Condition Evolved Interaction Knowledge Graph for Traditional Chinese Medicine Recommendation. (arXiv:2305.17866v2 [cs.AI] UPDATED)\nAbstract: Traditional Chinese Medicine (TCM) has a rich history of utilizing natural herbs to treat a diversity of illnesses. In practice, TCM diagnosis and treatment are highly personalized and organically holistic, requiring comprehensive consideration of the patient's state and symptoms over time. However, existing TCM recommendation approaches overlook the changes in patient status and only explore potential patterns between symptoms and prescriptions. In this paper, we propose a novel Sequential Condition Evolved Interaction Knowledge Graph (SCEIKG), a framework that treats the model as a sequential prescription-making problem by considering the dynamics of the patient's condition across multiple visits. In addition, we incorporate an interaction knowledge graph to enhance the accuracy of recommendations by considering the interactions between different herbs and the patient's condition. Experimental results on a real-world dataset demonstrate that our approach outperforms existing TCM reco",
    "path": "papers/23/05/2305.17866.json",
    "total_tokens": 874,
    "translated_title": "《顺序演化条件互动知识图谱在中医药推荐中的应用》",
    "translated_abstract": "传统中医药 (TCM) 在治疗各种疾病时有着丰富的历史，利用天然草药。在实践中，TCM的诊断和治疗高度个性化，有机综合，需要全面考虑患者的状况和症状变化。然而，现有的TCM推荐方法忽略了患者状态的变化，只探索症状和处方之间的潜在模式。本文提出了一种新颖的顺序演化条件互动知识图谱 (SCEIKG) 框架，将模型视为一个顺序处方制定问题，考虑了患者在多次就诊中的病情动态。此外，我们还将互动知识图谱纳入到推荐中，通过考虑不同草药之间的相互作用和患者的状况来提高推荐的准确性。实验结果在真实数据集上表明，我们的方法优于现有的TCM推荐方法。",
    "tldr": "本文提出了一种新颖的顺序演化条件互动知识图谱 (SCEIKG) 框架，用于中医药推荐。这个框架通过考虑患者在多次就诊中的病情动态和草药的相互作用，提供准确的推荐。"
}