{
    "title": "A Direct Sampling-Based Deep Learning Approach for Inverse Medium Scattering Problems. (arXiv:2305.00250v1 [eess.SP])",
    "abstract": "In this work, we focus on the inverse medium scattering problem (IMSP), which aims to recover unknown scatterers based on measured scattered data. Motivated by the efficient direct sampling method (DSM) introduced in [23], we propose a novel direct sampling-based deep learning approach (DSM-DL)for reconstructing inhomogeneous scatterers. In particular, we use the U-Net neural network to learn the relation between the index functions and the true contrasts. Our proposed DSM-DL is computationally efficient, robust to noise, easy to implement, and able to naturally incorporate multiple measured data to achieve high-quality reconstructions. Some representative tests are carried out with varying numbers of incident waves and different noise levels to evaluate the performance of the proposed method. The results demonstrate the promising benefits of combining deep learning techniques with the DSM for IMSP.",
    "link": "http://arxiv.org/abs/2305.00250",
    "context": "Title: A Direct Sampling-Based Deep Learning Approach for Inverse Medium Scattering Problems. (arXiv:2305.00250v1 [eess.SP])\nAbstract: In this work, we focus on the inverse medium scattering problem (IMSP), which aims to recover unknown scatterers based on measured scattered data. Motivated by the efficient direct sampling method (DSM) introduced in [23], we propose a novel direct sampling-based deep learning approach (DSM-DL)for reconstructing inhomogeneous scatterers. In particular, we use the U-Net neural network to learn the relation between the index functions and the true contrasts. Our proposed DSM-DL is computationally efficient, robust to noise, easy to implement, and able to naturally incorporate multiple measured data to achieve high-quality reconstructions. Some representative tests are carried out with varying numbers of incident waves and different noise levels to evaluate the performance of the proposed method. The results demonstrate the promising benefits of combining deep learning techniques with the DSM for IMSP.",
    "path": "papers/23/05/2305.00250.json",
    "total_tokens": 879,
    "translated_title": "一种基于直接抽样的深度学习逆中介质散射问题方法",
    "translated_abstract": "本文侧重于解决逆中介质散射问题，其目标是基于散射数据恢复未知散射体。在受[23]中引入的高效直接抽样方法的启发下，我们提出了一种新颖的基于直接抽样的深度学习方法（DSM-DL），用于重建非均匀散射体。具体地，我们使用U-Net神经网络来学习指数函数和真实对比度之间的关系。我们提出的DSM-DL计算效率高，对噪声具有鲁棒性，易于实现，并能够自然地结合多个测量数据以实现高质量的重建。进行了一些代表性的测试，包括不同数量的入射波和不同的噪声水平，以评估所提出方法的性能。结果展示了将深度学习技术与DSM相结合在IMSP中具有良好的应用前景。",
    "tldr": "提出了一种基于直接抽样的深度学习方法，利用U-Net神经网络学习指数函数和真实对比度之间的关系，实现了对逆中介质散射问题的高质量重建。",
    "en_tdlr": "A direct sampling-based deep learning approach (DSM-DL) is proposed to solve inverse medium scattering problems (IMSP), using U-Net neural network to learn the relation between index functions and true contrasts, which shows promising benefits of combining deep learning techniques with direct sampling method for IMSP."
}