{
    "title": "LSAS: Lightweight Sub-attention Strategy for Alleviating Attention Bias Problem. (arXiv:2305.05200v1 [cs.CV])",
    "abstract": "In computer vision, the performance of deep neural networks (DNNs) is highly related to the feature extraction ability, i.e., the ability to recognize and focus on key pixel regions in an image. However, in this paper, we quantitatively and statistically illustrate that DNNs have a serious attention bias problem on many samples from some popular datasets: (1) Position bias: DNNs fully focus on label-independent regions; (2) Range bias: The focused regions from DNN are not completely contained in the ideal region. Moreover, we find that the existing self-attention modules can alleviate these biases to a certain extent, but the biases are still non-negligible. To further mitigate them, we propose a lightweight sub-attention strategy (LSAS), which utilizes high-order sub-attention modules to improve the original self-attention modules. The effectiveness of LSAS is demonstrated by extensive experiments on widely-used benchmark datasets and popular attention networks. We release our code to",
    "link": "http://arxiv.org/abs/2305.05200",
    "context": "Title: LSAS: Lightweight Sub-attention Strategy for Alleviating Attention Bias Problem. (arXiv:2305.05200v1 [cs.CV])\nAbstract: In computer vision, the performance of deep neural networks (DNNs) is highly related to the feature extraction ability, i.e., the ability to recognize and focus on key pixel regions in an image. However, in this paper, we quantitatively and statistically illustrate that DNNs have a serious attention bias problem on many samples from some popular datasets: (1) Position bias: DNNs fully focus on label-independent regions; (2) Range bias: The focused regions from DNN are not completely contained in the ideal region. Moreover, we find that the existing self-attention modules can alleviate these biases to a certain extent, but the biases are still non-negligible. To further mitigate them, we propose a lightweight sub-attention strategy (LSAS), which utilizes high-order sub-attention modules to improve the original self-attention modules. The effectiveness of LSAS is demonstrated by extensive experiments on widely-used benchmark datasets and popular attention networks. We release our code to",
    "path": "papers/23/05/2305.05200.json",
    "total_tokens": 816,
    "translated_title": "LSAS：用轻量级子注意力策略缓解关注偏差问题",
    "translated_abstract": "在计算机视觉中，深度神经网络（DNN）的性能与其特征提取能力密切相关，即识别并聚焦于图像中的关键像素区域的能力。然而，本文 quantitatively and statistically illustrate，在许多流行数据集的许多样本中，DNN存在严重的关注偏差问题。",
    "tldr": "本文提出了一种轻量级子注意力策略（LSAS），能够显著缓解计算机视觉中深度神经网络的关注偏差问题，即DNN过于聚焦于标签无关的区域，并且无法完全包含理想区域。LSAS能够改进现有的自我关注模块并在广泛使用的基准数据集和流行的关注网络中证明其有效性。",
    "en_tdlr": "This paper proposes a lightweight sub-attention strategy (LSAS) to alleviate the attention bias problem of deep neural networks (DNNs) in computer vision. LSAS improves the original self-attention modules with high-order sub-attention modules and mitigates the biases, including DNNs focusing on label-independent regions and not completely contained ideal regions. The effectiveness of LSAS is demonstrated by extensive experiments on benchmark datasets and popular attention networks."
}