{
    "title": "The Fundamental Limits of Structure-Agnostic Functional Estimation. (arXiv:2305.04116v1 [math.ST])",
    "abstract": "Many recent developments in causal inference, and functional estimation problems more generally, have been motivated by the fact that classical one-step (first-order) debiasing methods, or their more recent sample-split double machine-learning avatars, can outperform plugin estimators under surprisingly weak conditions. These first-order corrections improve on plugin estimators in a black-box fashion, and consequently are often used in conjunction with powerful off-the-shelf estimation methods. These first-order methods are however provably suboptimal in a minimax sense for functional estimation when the nuisance functions live in Holder-type function spaces. This suboptimality of first-order debiasing has motivated the development of \"higher-order\" debiasing methods. The resulting estimators are, in some cases, provably optimal over Holder-type spaces, but both the estimators which are minimax-optimal and their analyses are crucially tied to properties of the underlying function space",
    "link": "http://arxiv.org/abs/2305.04116",
    "context": "Title: The Fundamental Limits of Structure-Agnostic Functional Estimation. (arXiv:2305.04116v1 [math.ST])\nAbstract: Many recent developments in causal inference, and functional estimation problems more generally, have been motivated by the fact that classical one-step (first-order) debiasing methods, or their more recent sample-split double machine-learning avatars, can outperform plugin estimators under surprisingly weak conditions. These first-order corrections improve on plugin estimators in a black-box fashion, and consequently are often used in conjunction with powerful off-the-shelf estimation methods. These first-order methods are however provably suboptimal in a minimax sense for functional estimation when the nuisance functions live in Holder-type function spaces. This suboptimality of first-order debiasing has motivated the development of \"higher-order\" debiasing methods. The resulting estimators are, in some cases, provably optimal over Holder-type spaces, but both the estimators which are minimax-optimal and their analyses are crucially tied to properties of the underlying function space",
    "path": "papers/23/05/2305.04116.json",
    "total_tokens": 825,
    "translated_title": "结构无关函数估计的基本限制",
    "translated_abstract": "近年来，许多因果推断和函数估计问题的发展都源于这样一个事实：在非常弱的条件下，经典的一步（一阶）去偏方法或它们较新的样本分割双机器学习方法可以比插补估计更好地工作。这些一阶校正以黑盒子方式改善插补估计值，因此经常与强大的现成估计方法一起使用。然而，当干扰函数生存在Holder型函数空间中时，这些一阶方法在最小二乘意义下被证明是次优的。这种一阶去偏的次优性促进了“高阶”去偏方法的发展。由此产生的估计量在某些情况下被证明是在Holder类型空间上最小化的，并且它们的分析与基础函数空间的性质密切相关。",
    "tldr": "一阶去偏方法在最小二乘意义下在干扰函数生存在特定函数空间时被证明是次优的，这促进了“高阶”去偏方法的发展。",
    "en_tdlr": "First-order debiasing methods are proven suboptimal in a minimax sense for functional estimation when the nuisance functions live in Holder-type function spaces, motivating the development of \"higher-order\" debiasing methods."
}