{
    "title": "Anomaly Detection Dataset for Industrial Control Systems. (arXiv:2305.09678v1 [cs.CR])",
    "abstract": "Over the past few decades, Industrial Control Systems (ICSs) have been targeted by cyberattacks and are becoming increasingly vulnerable as more ICSs are connected to the internet. Using Machine Learning (ML) for Intrusion Detection Systems (IDS) is a promising approach for ICS cyber protection, but the lack of suitable datasets for evaluating ML algorithms is a challenge. Although there are a few commonly used datasets, they may not reflect realistic ICS network data, lack necessary features for effective anomaly detection, or be outdated. This paper presents the 'ICS-Flow' dataset, which offers network data and process state variables logs for supervised and unsupervised ML-based IDS assessment. The network data includes normal and anomalous network packets and flows captured from simulated ICS components and emulated networks. The anomalies were injected into the system through various attack techniques commonly used by hackers to modify network traffic and compromise ICSs. We also ",
    "link": "http://arxiv.org/abs/2305.09678",
    "context": "Title: Anomaly Detection Dataset for Industrial Control Systems. (arXiv:2305.09678v1 [cs.CR])\nAbstract: Over the past few decades, Industrial Control Systems (ICSs) have been targeted by cyberattacks and are becoming increasingly vulnerable as more ICSs are connected to the internet. Using Machine Learning (ML) for Intrusion Detection Systems (IDS) is a promising approach for ICS cyber protection, but the lack of suitable datasets for evaluating ML algorithms is a challenge. Although there are a few commonly used datasets, they may not reflect realistic ICS network data, lack necessary features for effective anomaly detection, or be outdated. This paper presents the 'ICS-Flow' dataset, which offers network data and process state variables logs for supervised and unsupervised ML-based IDS assessment. The network data includes normal and anomalous network packets and flows captured from simulated ICS components and emulated networks. The anomalies were injected into the system through various attack techniques commonly used by hackers to modify network traffic and compromise ICSs. We also ",
    "path": "papers/23/05/2305.09678.json",
    "total_tokens": 1022,
    "translated_title": "工控系统异常检测数据集",
    "translated_abstract": "过去几十年中，工控系统(ICSS)已经成为网络攻击的目标，随着越来越多的ICS与互联网相连，安全性变得越来越脆弱。使用机器学习(ML)进行入侵检测系统(IDS)是保护ICS网络的有前途的方法，但缺乏适合评估ML算法的数据集是一个挑战。本文介绍了'ICS-Flow'数据集，为监督和无监督的基于ML的IDS评估提供了网络数据和过程状态变量日志。网络数据包括从模拟的ICS组件和仿真网络中捕获的正常和异常网络数据包和流。异常是通过黑客常用的各种攻击技术注入到系统中的，用于修改网络流量和攻击ICS。我们还提供了几种流行的ML算法在ICS-Flow数据集上的基础性能评估，并与传统基于规则的IDS进行比较。数据集和评估结果将有助于开发先进的ICS入侵检测系统和提高关键基础设施的网络安全性。",
    "tldr": "本文介绍了'ICS-Flow'数据集，其中包括了监督和无监督机器学习算法评估所需的网络数据和过程状态变量日志，并提供了几种流行的算法在该数据集上的基础性能评估，旨在促进工控系统的入侵检测系统发展和加强关键基础设施的网络安全性。",
    "en_tdlr": "This paper introduces the 'ICS-Flow' dataset, which provides network data and process state variables logs for supervised and unsupervised ML-based IDS assessment, and also presents a baseline performance evaluation of several popular ML algorithms with the dataset, aiming to promote the development of advanced IDSs for ICSs and enhance the cybersecurity of critical infrastructures."
}