{
    "title": "Semantic Segmentation by Semantic Proportions. (arXiv:2305.15608v1 [cs.CV])",
    "abstract": "Semantic segmentation is a critical task in computer vision that aims to identify and classify individual pixels in an image, with numerous applications for example autonomous driving and medical image analysis. However, semantic segmentation can be super challenging particularly due to the need for large amounts of annotated data. Annotating images is a time-consuming and costly process, often requiring expert knowledge and significant effort. In this paper, we propose a novel approach for semantic segmentation by eliminating the need of ground-truth segmentation maps. Instead, our approach requires only the rough information of individual semantic class proportions, shortened as semantic proportions. It greatly simplifies the data annotation process and thus will significantly reduce the annotation time and cost, making it more feasible for large-scale applications. Moreover, it opens up new possibilities for semantic segmentation tasks where obtaining the full ground-truth segmentat",
    "link": "http://arxiv.org/abs/2305.15608",
    "context": "Title: Semantic Segmentation by Semantic Proportions. (arXiv:2305.15608v1 [cs.CV])\nAbstract: Semantic segmentation is a critical task in computer vision that aims to identify and classify individual pixels in an image, with numerous applications for example autonomous driving and medical image analysis. However, semantic segmentation can be super challenging particularly due to the need for large amounts of annotated data. Annotating images is a time-consuming and costly process, often requiring expert knowledge and significant effort. In this paper, we propose a novel approach for semantic segmentation by eliminating the need of ground-truth segmentation maps. Instead, our approach requires only the rough information of individual semantic class proportions, shortened as semantic proportions. It greatly simplifies the data annotation process and thus will significantly reduce the annotation time and cost, making it more feasible for large-scale applications. Moreover, it opens up new possibilities for semantic segmentation tasks where obtaining the full ground-truth segmentat",
    "path": "papers/23/05/2305.15608.json",
    "total_tokens": 798,
    "translated_abstract": "语义分割是计算机视觉中的一个关键任务，旨在识别和分类图像中的单个像素，具有例如自动驾驶和医学图像分析等众多应用。然而，语义分割可能非常具有挑战性，特别是由于需要大量注释数据。注释图像是一个耗时且昂贵的过程，通常需要专业知识和大量的努力。在本文中，我们提出了一种新的语义分割方法，通过消除地面真实分割图的需求，而仅需要单个语义类比例的粗略信息，即语义比例。它极大地简化了数据注释过程，因此将显著减少注释时间和成本，使其更适用于大规模应用。此外，它为语义分割任务开辟了新的可能性，其中获取完整地面真实分割图可能很困难。",
    "tldr": "本文提出了一种通过语义比例而非地面真实分割图进行语义分割的新方法，简化了数据注释过程并降低了注释成本和时间。",
    "en_tdlr": "This paper proposes a novel approach for semantic segmentation by using semantic proportions instead of requiring ground-truth segmentation maps, which simplifies the annotation process and reduces cost and time."
}