{
    "title": "Study on Intelligent Forecasting of Credit Bond Default Risk. (arXiv:2305.12142v1 [q-fin.RM])",
    "abstract": "Credit risk in the China's bond market has become increasingly evident, creating a progressively escalating risk of default for credit bond investors. Given the current incomplete and inaccurate bond information disclosure, timely tracking and forecasting the individual credit bond default risks have become essential to maintain market stability and ensure healthy development. This paper proposes an Intelligent Forecasting Framework for Default Risk that provides precise day-by-day default risk prediction. In this framework, we first summarize the factors that impact credit bond defaults and construct a risk index system. Then, we employ a combined default probability annotation method based on the evolutionary characteristics of bond default risk. The method considers the weighted average of Variational Bayesian Gaussian Mixture estimation, Market Index estimation, and Default Trend Backward estimation for daily default risk annotation of matured or defaulted bonds according to the ri",
    "link": "http://arxiv.org/abs/2305.12142",
    "context": "Title: Study on Intelligent Forecasting of Credit Bond Default Risk. (arXiv:2305.12142v1 [q-fin.RM])\nAbstract: Credit risk in the China's bond market has become increasingly evident, creating a progressively escalating risk of default for credit bond investors. Given the current incomplete and inaccurate bond information disclosure, timely tracking and forecasting the individual credit bond default risks have become essential to maintain market stability and ensure healthy development. This paper proposes an Intelligent Forecasting Framework for Default Risk that provides precise day-by-day default risk prediction. In this framework, we first summarize the factors that impact credit bond defaults and construct a risk index system. Then, we employ a combined default probability annotation method based on the evolutionary characteristics of bond default risk. The method considers the weighted average of Variational Bayesian Gaussian Mixture estimation, Market Index estimation, and Default Trend Backward estimation for daily default risk annotation of matured or defaulted bonds according to the ri",
    "path": "papers/23/05/2305.12142.json",
    "total_tokens": 909,
    "translated_title": "关于信用债违约风险的智能预测研究",
    "translated_abstract": "中国债券市场中的信用风险越来越明显，这为信用债投资者带来了日益升级的违约风险。鉴于当前债券信息披露不完整和不准确的情况，及时跟踪和预测个别信用债违约风险已成为维护市场稳定和保障健康发展的必要手段。本文提出了一种智能预测违约风险的框架，可提供精确的按天预测的违约风险预测。在这个框架中，我们首先总结影响信用债违约的因素并构建了一个风险指数体系。然后，我们采用了一种基于债券违约风险演化特征的组合违约概率注释方法。该方法考虑了成熟或违约债券的每日违约风险注释的变分贝叶斯高斯混合估算、市场指数估算和违约趋势反向估算的加权平均值。",
    "tldr": "该论文提出了一种智能预测信用债违约风险的框架，可以提供精确的按天预测的违约风险预测，以维护中国债券市场的稳定和健康发展。",
    "en_tdlr": "The paper proposes an intelligent forecasting framework for credit bond default risk, providing precise day-by-day prediction to maintain market stability and ensure healthy development in China's bond market, which has increasingly evident credit risk."
}