{
    "title": "AIwriting: Relations Between Image Generation and Digital Writing. (arXiv:2305.10834v1 [cs.AI])",
    "abstract": "During 2022, both transformer-based AI text generation sys-tems such as GPT-3 and AI text-to-image generation systems such as DALL-E 2 and Stable Diffusion made exponential leaps forward and are unquestionably altering the fields of digital art and electronic literature. In this panel a group of electronic literature authors and theorists consider new oppor-tunities for human creativity presented by these systems and present new works have produced during the past year that specifically address these systems as environments for literary expressions that are translated through iterative interlocutive processes into visual representations. The premise that binds these presentations is that these systems and the works gener-ated must be considered from a literary perspective, as they originate in human writing. In works ranging from a visual memoir of the personal experience of a health crisis, to interac-tive web comics, to architectures based on abstract poetic language, to political sa",
    "link": "http://arxiv.org/abs/2305.10834",
    "context": "Title: AIwriting: Relations Between Image Generation and Digital Writing. (arXiv:2305.10834v1 [cs.AI])\nAbstract: During 2022, both transformer-based AI text generation sys-tems such as GPT-3 and AI text-to-image generation systems such as DALL-E 2 and Stable Diffusion made exponential leaps forward and are unquestionably altering the fields of digital art and electronic literature. In this panel a group of electronic literature authors and theorists consider new oppor-tunities for human creativity presented by these systems and present new works have produced during the past year that specifically address these systems as environments for literary expressions that are translated through iterative interlocutive processes into visual representations. The premise that binds these presentations is that these systems and the works gener-ated must be considered from a literary perspective, as they originate in human writing. In works ranging from a visual memoir of the personal experience of a health crisis, to interac-tive web comics, to architectures based on abstract poetic language, to political sa",
    "path": "papers/23/05/2305.10834.json",
    "total_tokens": 849,
    "translated_title": "《AI写作：图像生成和数字写作的关系》",
    "translated_abstract": "2022年，基于变形金刚的AI文本生成系统（如GPT-3）和基于AI的文本到图像生成系统（如DALL-E 2和稳定扩散）都取得了指数级的飞跃，无疑正在改变数字艺术和电子文学领域。在本论坛中，一组电子文学作者和理论家考虑这些系统带来的人类创造力新机遇，并展示了他们在过去一年中专门针对这些系统创作的作品，这些作品通过迭代的对话过程转化为视觉表现。这些演示的前提是，这些系统和所生成的作品必须从文学角度考虑，因为它们起源于人类写作。从个人健康危机的视觉回忆录，到互动网页漫画，到基于抽象诗意语言的建筑，再到政治萨。。。",
    "tldr": "本论坛讨论了基于AI的文本生成系统和文本到图像生成系统对数字艺术和电子文学领域带来的影响，各种作品都从文学角度考虑，突出了创作过程的交互性。",
    "en_tdlr": "This panel discusses the impact of AI text generation systems and text-to-image generation systems on digital art and electronic literature. Works presented approach these systems from a literary perspective, highlighting the interactive nature of the creative process."
}