{
    "title": "SAM for Poultry Science. (arXiv:2305.10254v1 [cs.CV])",
    "abstract": "In recent years, the agricultural industry has witnessed significant advancements in artificial intelligence (AI), particularly with the development of large-scale foundational models. Among these foundation models, the Segment Anything Model (SAM), introduced by Meta AI Research, stands out as a groundbreaking solution for object segmentation tasks. While SAM has shown success in various agricultural applications, its potential in the poultry industry, specifically in the context of cage-free hens, remains relatively unexplored. This study aims to assess the zero-shot segmentation performance of SAM on representative chicken segmentation tasks, including part-based segmentation and the use of infrared thermal images, and to explore chicken-tracking tasks by using SAM as a segmentation tool. The results demonstrate SAM's superior performance compared to SegFormer and SETR in both whole and part-based chicken segmentation. SAM-based object tracking also provides valuable data on the beh",
    "link": "http://arxiv.org/abs/2305.10254",
    "context": "Title: SAM for Poultry Science. (arXiv:2305.10254v1 [cs.CV])\nAbstract: In recent years, the agricultural industry has witnessed significant advancements in artificial intelligence (AI), particularly with the development of large-scale foundational models. Among these foundation models, the Segment Anything Model (SAM), introduced by Meta AI Research, stands out as a groundbreaking solution for object segmentation tasks. While SAM has shown success in various agricultural applications, its potential in the poultry industry, specifically in the context of cage-free hens, remains relatively unexplored. This study aims to assess the zero-shot segmentation performance of SAM on representative chicken segmentation tasks, including part-based segmentation and the use of infrared thermal images, and to explore chicken-tracking tasks by using SAM as a segmentation tool. The results demonstrate SAM's superior performance compared to SegFormer and SETR in both whole and part-based chicken segmentation. SAM-based object tracking also provides valuable data on the beh",
    "path": "papers/23/05/2305.10254.json",
    "total_tokens": 874,
    "translated_title": "面向家禽科学的 SAM 模型应用研究",
    "translated_abstract": "近年来，人工智能领域在建立大规模基础模型方面取得了显著进展。其中，Meta AI Research 推出的“Segment Anything Model”(SAM)作为物体分割任务的突破性解决方案而脱颖而出。虽然 SAM 在各种农业应用中表现出了成功的应用，但其在禽业，尤其是在无笼鸡的情况下的潜力仍未充分发掘。本研究旨在评估 SAM 在代表性的鸡类分割任务上的零样本分割性能，包括基于部分的分割和红外热像的使用，并试图探索使用 SAM 作为分割工具进行鸡类跟踪任务。研究结果表明，相比于 SegFormer 和 SETR，在整体和基于部分的鸡类分割中，SAM 的性能优于其他模型。基于 SAM 的对象跟踪也提供了有价值的行为数据。",
    "tldr": "本研究探究了 SAM 模型在禽业领域中的应用潜力，结果表明 SAM 模型性能优于其他模型，可以应用于基于部分的鸡类分割任务和红外热像的使用，并用于鸡类跟踪任务中。",
    "en_tdlr": "This study explores the potential application of the SAM model in the poultry industry, demonstrating its superiority over other models for whole and part-based chicken segmentation tasks and object tracking, including the use of infrared thermal images."
}