{
    "title": "FedSOV: Federated Model Secure Ownership Verification with Unforgeable Signature. (arXiv:2305.06085v1 [cs.CR])",
    "abstract": "Federated learning allows multiple parties to collaborate in learning a global model without revealing private data. The high cost of training and the significant value of the global model necessitates the need for ownership verification of federated learning. However, the existing ownership verification schemes in federated learning suffer from several limitations, such as inadequate support for a large number of clients and vulnerability to ambiguity attacks. To address these limitations, we propose a cryptographic signature-based federated learning model ownership verification scheme named FedSOV. FedSOV allows numerous clients to embed their ownership credentials and verify ownership using unforgeable digital signatures. The scheme provides theoretical resistance to ambiguity attacks with the unforgeability of the signature. Experimental results on computer vision and natural language processing tasks demonstrate that FedSOV is an effective federated model ownership verification sc",
    "link": "http://arxiv.org/abs/2305.06085",
    "context": "Title: FedSOV: Federated Model Secure Ownership Verification with Unforgeable Signature. (arXiv:2305.06085v1 [cs.CR])\nAbstract: Federated learning allows multiple parties to collaborate in learning a global model without revealing private data. The high cost of training and the significant value of the global model necessitates the need for ownership verification of federated learning. However, the existing ownership verification schemes in federated learning suffer from several limitations, such as inadequate support for a large number of clients and vulnerability to ambiguity attacks. To address these limitations, we propose a cryptographic signature-based federated learning model ownership verification scheme named FedSOV. FedSOV allows numerous clients to embed their ownership credentials and verify ownership using unforgeable digital signatures. The scheme provides theoretical resistance to ambiguity attacks with the unforgeability of the signature. Experimental results on computer vision and natural language processing tasks demonstrate that FedSOV is an effective federated model ownership verification sc",
    "path": "papers/23/05/2305.06085.json",
    "total_tokens": 852,
    "tldr": "FedSOV是一种基于密码签名的联邦学习模型所有权验证方案，能够在不泄露私有数据的情况下，支持大量客户端，并提供理论上的歧义攻击抵抗力。"
}