{
    "title": "Adversarial Generative NMF for Single Channel Source Separation. (arXiv:2305.01758v1 [eess.AS])",
    "abstract": "The idea of adversarial learning of regularization functionals has recently been introduced in the wider context of inverse problems. The intuition behind this method is the realization that it is not only necessary to learn the basic features that make up a class of signals one wants to represent, but also, or even more so, which features to avoid in the representation. In this paper, we will apply this approach to the problem of source separation by means of non-negative matrix factorization (NMF) and present a new method for the adversarial training of NMF bases. We show in numerical experiments, both for image and audio separation, that this leads to a clear improvement of the reconstructed signals, in particular in the case where little or no strong supervision data is available.",
    "link": "http://arxiv.org/abs/2305.01758",
    "context": "Title: Adversarial Generative NMF for Single Channel Source Separation. (arXiv:2305.01758v1 [eess.AS])\nAbstract: The idea of adversarial learning of regularization functionals has recently been introduced in the wider context of inverse problems. The intuition behind this method is the realization that it is not only necessary to learn the basic features that make up a class of signals one wants to represent, but also, or even more so, which features to avoid in the representation. In this paper, we will apply this approach to the problem of source separation by means of non-negative matrix factorization (NMF) and present a new method for the adversarial training of NMF bases. We show in numerical experiments, both for image and audio separation, that this leads to a clear improvement of the reconstructed signals, in particular in the case where little or no strong supervision data is available.",
    "path": "papers/23/05/2305.01758.json",
    "total_tokens": 767,
    "translated_title": "基于对抗生成的非负矩阵分解单声道源分离方法",
    "translated_abstract": "对抗学习正则化函数的思想最近被引入了更广泛的反问题背景下。该方法的灵感在于意识到不仅需要学习组成所需信号的基本特征，而且或者更重要的是，需要学习避免表示中的哪些特征。在本文中，我们将应用这种方法来解决通过非负矩阵分解进行源分离的问题，并提出一种新的对抗训练NMF基的方法。我们通过数值实验表明，无论是图像还是音频分离，在没有强监督数据可用的情况下，都会明显提高重构信号的质量。",
    "tldr": "本文提出了一种基于对抗生成的非负矩阵分解单声道源分离方法，通过对抗训练NMF基，实现了在没有强监督数据可用的情况下提高重构信号质量的效果。",
    "en_tdlr": "This paper proposes an adversarial generative Non-negative matrix factorization (NMF) method for single channel source separation, which improves the reconstructed signals in the absence of strong supervised data through adversarial training of NMF bases."
}