{
    "title": "Asking Before Action: Gather Information in Embodied Decision Making with Language Models. (arXiv:2305.15695v1 [cs.AI])",
    "abstract": "With strong capabilities of reasoning and a generic understanding of the world, Large Language Models (LLMs) have shown great potential in building versatile embodied decision making agents capable of performing diverse tasks. However, when deployed to unfamiliar environments, we show that LLM agents face challenges in efficiently gathering necessary information, leading to suboptimal performance. On the other hand, in unfamiliar scenarios, human individuals often seek additional information from their peers before taking action, leveraging external knowledge to avoid unnecessary trial and error. Building upon this intuition, we propose \\textit{Asking Before Action} (ABA), a method that empowers the agent to proactively query external sources for pertinent information using natural language during their interactions in the environment. In this way, the agent is able to enhance its efficiency and performance by mitigating wasteful steps and circumventing the difficulties associated with",
    "link": "http://arxiv.org/abs/2305.15695",
    "context": "Title: Asking Before Action: Gather Information in Embodied Decision Making with Language Models. (arXiv:2305.15695v1 [cs.AI])\nAbstract: With strong capabilities of reasoning and a generic understanding of the world, Large Language Models (LLMs) have shown great potential in building versatile embodied decision making agents capable of performing diverse tasks. However, when deployed to unfamiliar environments, we show that LLM agents face challenges in efficiently gathering necessary information, leading to suboptimal performance. On the other hand, in unfamiliar scenarios, human individuals often seek additional information from their peers before taking action, leveraging external knowledge to avoid unnecessary trial and error. Building upon this intuition, we propose \\textit{Asking Before Action} (ABA), a method that empowers the agent to proactively query external sources for pertinent information using natural language during their interactions in the environment. In this way, the agent is able to enhance its efficiency and performance by mitigating wasteful steps and circumventing the difficulties associated with",
    "path": "papers/23/05/2305.15695.json",
    "total_tokens": 856,
    "tldr": "该论文提出了一种方法，利用自然语言激活代理主动查询有关信息的外部来源，提高大型语言模型在具体决策制定时的效率和表现。",
    "en_tdlr": "This paper proposes a method that uses natural language to activate agents to proactively query external sources for pertinent information, in order to enhance the efficiency and performance of Large Language Models in embodied decision making."
}