{
    "title": "Improving Classification of Retinal Fundus Image Using Flow Dynamics Optimized Deep Learning Methods. (arXiv:2305.00294v1 [cs.CV])",
    "abstract": "Diabetic Retinopathy (DR) refers to a barrier that takes place in diabetes mellitus damaging the blood vessel network present in the retina. This may endanger the subjects' vision if they have diabetes. It can take some time to perform a DR diagnosis using color fundus pictures because experienced clinicians are required to identify the tumors in the imagery used to identify the illness. Automated detection of the DR can be an extremely challenging task. Convolutional Neural Networks (CNN) are also highly effective at classifying images when applied in the present situation, particularly compared to the handmade and functionality methods employed. In order to guarantee high results, the researchers also suggested a cutting-edge CNN model that might determine the characteristics of the fundus images. The features of the CNN output were employed in various classifiers of machine learning for the proposed system. This model was later evaluated using different forms of deep learning method",
    "link": "http://arxiv.org/abs/2305.00294",
    "context": "Title: Improving Classification of Retinal Fundus Image Using Flow Dynamics Optimized Deep Learning Methods. (arXiv:2305.00294v1 [cs.CV])\nAbstract: Diabetic Retinopathy (DR) refers to a barrier that takes place in diabetes mellitus damaging the blood vessel network present in the retina. This may endanger the subjects' vision if they have diabetes. It can take some time to perform a DR diagnosis using color fundus pictures because experienced clinicians are required to identify the tumors in the imagery used to identify the illness. Automated detection of the DR can be an extremely challenging task. Convolutional Neural Networks (CNN) are also highly effective at classifying images when applied in the present situation, particularly compared to the handmade and functionality methods employed. In order to guarantee high results, the researchers also suggested a cutting-edge CNN model that might determine the characteristics of the fundus images. The features of the CNN output were employed in various classifiers of machine learning for the proposed system. This model was later evaluated using different forms of deep learning method",
    "path": "papers/23/05/2305.00294.json",
    "total_tokens": 909,
    "translated_title": "基于流体动力学优化深度学习方法的视网膜底图像分类改进",
    "translated_abstract": "糖尿病视网膜病变 (DR) 是一种损坏视网膜血管网络的障碍，如果糖尿病患者患有这种病，可能会危及他们的视力。使用彩色底片来进行 DR 诊断需要经验丰富的临床医生对影像中的肿瘤进行识别，这可能需要一些时间。自动检测 DR 可能是一项极具挑战性的任务。卷积神经网络 (CNN) 在当前情况下在分类图像方面也是非常有效的，特别是与手工制作和功能方法相比。为了确保高水平的结果，研究人员还提出了一种先进的 CNN 模型，可以确定底片图像的特征。CNN 输出的特征被用于所提出系统的各种机器学习分类器中。这个模型后来使用了不同形式的深度学习方法进行评估。",
    "tldr": "本论文提出了一种基于流体动力学优化的深度学习方法，用于改进糖尿病视网膜病变的分类。研究人员提出了一种新的 CNN 模型，用于确定底片图像的特征，并使用各种机器学习分类器对其进行评估。",
    "en_tdlr": "This paper proposes a flow dynamics optimized deep learning method to improve the classification of diabetic retinopathy. Researchers introduce a new CNN model to determine the features of fundus images and evaluate it using various machine learning classifiers."
}