{
    "title": "Fast Traversability Estimation for Wild Visual Navigation. (arXiv:2305.08510v2 [cs.RO] UPDATED)",
    "abstract": "Natural environments such as forests and grasslands are challenging for robotic navigation because of the false perception of rigid obstacles from high grass, twigs, or bushes. In this work, we propose Wild Visual Navigation (WVN), an online self-supervised learning system for traversability estimation which uses only vision. The system is able to continuously adapt from a short human demonstration in the field. It leverages high-dimensional features from self-supervised visual transformer models, with an online scheme for supervision generation that runs in real-time on the robot. We demonstrate the advantages of our approach with experiments and ablation studies in challenging environments in forests, parks, and grasslands. Our system is able to bootstrap the traversable terrain segmentation in less than 5 min of in-field training time, enabling the robot to navigate in complex outdoor terrains - negotiating obstacles in high grass as well as a 1.4 km footpath following. While our ex",
    "link": "http://arxiv.org/abs/2305.08510",
    "context": "Title: Fast Traversability Estimation for Wild Visual Navigation. (arXiv:2305.08510v2 [cs.RO] UPDATED)\nAbstract: Natural environments such as forests and grasslands are challenging for robotic navigation because of the false perception of rigid obstacles from high grass, twigs, or bushes. In this work, we propose Wild Visual Navigation (WVN), an online self-supervised learning system for traversability estimation which uses only vision. The system is able to continuously adapt from a short human demonstration in the field. It leverages high-dimensional features from self-supervised visual transformer models, with an online scheme for supervision generation that runs in real-time on the robot. We demonstrate the advantages of our approach with experiments and ablation studies in challenging environments in forests, parks, and grasslands. Our system is able to bootstrap the traversable terrain segmentation in less than 5 min of in-field training time, enabling the robot to navigate in complex outdoor terrains - negotiating obstacles in high grass as well as a 1.4 km footpath following. While our ex",
    "path": "papers/23/05/2305.08510.json",
    "total_tokens": 956,
    "translated_title": "野外视觉导航中的快速可通行性估计",
    "translated_abstract": "自然环境如森林和草地对于机器人导航来说是具有挑战性的，因为高草、树枝或灌木会产生虚假的障碍物感知。本文提出了一种名为 WVN 的在线自监督学习系统，用于仅使用视觉进行的可通行性估计。该系统能够从实地短时间的人类演示中不断自适应。它利用自监督视觉转换器模型的高维特征，采用在线监督生成方案来实现机器人上的实时运行。我们在森林、公园和草地的具有挑战性的环境中进行了实验和消融研究，证明了我们方法的优势。我们的系统在不到5分钟的实地培训时间内能够启动可通过地形分割，使机器人能够在复杂的户外地形中导航-克服高野草的障碍，以及跟随1.4公里的人行道。虽然我们的实验数据均来自欧洲，但是我们认为结果仍然具有一定的普适性。",
    "tldr": "本文提出了一种基于自监督学习的在线视觉导航系统 WVN，能够在不到 5 分钟的实地培训时间内启动可通过地形分割，并使机器人能够高效地在挑战性环境下完成导航。",
    "en_tdlr": "This paper proposes an online self-supervised learning system, called WVN, for traversability estimation in wild visual navigation, which can bootstrap the traversable terrain segmentation in less than 5 min of in-field training time, enabling the robot to navigate efficiently in challenging environments."
}