{
    "title": "Multi-modal Visual Understanding with Prompts for Semantic Information Disentanglement of Image. (arXiv:2305.09333v1 [cs.CV])",
    "abstract": "Multi-modal visual understanding of images with prompts involves using various visual and textual cues to enhance the semantic understanding of images. This approach combines both vision and language processing to generate more accurate predictions and recognition of images. By utilizing prompt-based techniques, models can learn to focus on certain features of an image to extract useful information for downstream tasks. Additionally, multi-modal understanding can improve upon single modality models by providing more robust representations of images. Overall, the combination of visual and textual information is a promising area of research for advancing image recognition and understanding. In this paper we will try an amount of prompt design methods and propose a new method for better extraction of semantic information",
    "link": "http://arxiv.org/abs/2305.09333",
    "context": "Title: Multi-modal Visual Understanding with Prompts for Semantic Information Disentanglement of Image. (arXiv:2305.09333v1 [cs.CV])\nAbstract: Multi-modal visual understanding of images with prompts involves using various visual and textual cues to enhance the semantic understanding of images. This approach combines both vision and language processing to generate more accurate predictions and recognition of images. By utilizing prompt-based techniques, models can learn to focus on certain features of an image to extract useful information for downstream tasks. Additionally, multi-modal understanding can improve upon single modality models by providing more robust representations of images. Overall, the combination of visual and textual information is a promising area of research for advancing image recognition and understanding. In this paper we will try an amount of prompt design methods and propose a new method for better extraction of semantic information",
    "path": "papers/23/05/2305.09333.json",
    "total_tokens": 753,
    "translated_title": "基于提示的多模态视觉理解技术对图像语义信息进行分离的研究",
    "translated_abstract": "通过提示来进行多模态视觉理解技术可利用各种视觉及文本线索，提高对图像的语义理解。这种方法结合了视觉和语言处理，能够产生更准确的预测和识别图像。通过采用基于提示的技术，模型可以学习关注图像的某些特征，以提取下游任务所需的有用信息。此外，多模态理解可以通过提供更强大的图像表示来改善单模态模型的性能。总的来说，视觉和文本信息的结合是推进图像识别和理解领域的有望研究方向。本文将尝试一些提示设计方法，并提出一种更好地提取语义信息的新方法。",
    "tldr": "本论文研究了基于提示的多模态视觉理解技术，通过分离语义信息提高对图像的理解，旨在推进图像识别和理解领域的研究。",
    "en_tdlr": "This paper investigates prompt-based multi-modal visual understanding techniques to disentangle semantic information and enhance image understanding, aiming to advance research in the field of image recognition and understanding."
}