{
    "title": "XTREME-UP: A User-Centric Scarce-Data Benchmark for Under-Represented Languages. (arXiv:2305.11938v1 [cs.CL])",
    "abstract": "Data scarcity is a crucial issue for the development of highly multilingual NLP systems. Yet for many under-represented languages (ULs) -- languages for which NLP re-search is particularly far behind in meeting user needs -- it is feasible to annotate small amounts of data. Motivated by this, we propose XTREME-UP, a benchmark defined by: its focus on the scarce-data scenario rather than zero-shot; its focus on user-centric tasks -- tasks with broad adoption by speakers of high-resource languages; and its focus on under-represented languages where this scarce-data scenario tends to be most realistic. XTREME-UP evaluates the capabilities of language models across 88 under-represented languages over 9 key user-centric technologies including ASR, OCR, MT, and information access tasks that are of general utility. We create new datasets for OCR, autocomplete, semantic parsing, and transliteration, and build on and refine existing datasets for other tasks. XTREME-UP provides methodology for e",
    "link": "http://arxiv.org/abs/2305.11938",
    "context": "Title: XTREME-UP: A User-Centric Scarce-Data Benchmark for Under-Represented Languages. (arXiv:2305.11938v1 [cs.CL])\nAbstract: Data scarcity is a crucial issue for the development of highly multilingual NLP systems. Yet for many under-represented languages (ULs) -- languages for which NLP re-search is particularly far behind in meeting user needs -- it is feasible to annotate small amounts of data. Motivated by this, we propose XTREME-UP, a benchmark defined by: its focus on the scarce-data scenario rather than zero-shot; its focus on user-centric tasks -- tasks with broad adoption by speakers of high-resource languages; and its focus on under-represented languages where this scarce-data scenario tends to be most realistic. XTREME-UP evaluates the capabilities of language models across 88 under-represented languages over 9 key user-centric technologies including ASR, OCR, MT, and information access tasks that are of general utility. We create new datasets for OCR, autocomplete, semantic parsing, and transliteration, and build on and refine existing datasets for other tasks. XTREME-UP provides methodology for e",
    "path": "papers/23/05/2305.11938.json",
    "total_tokens": 1244,
    "translated_title": "XTREME-UP：针对少样本数据的用户中心稀缺数据基准测试，在代表性不足的语言上进行评估",
    "translated_abstract": "数据稀缺是高度多语言 NLP 系统发展的关键问题。然而对于许多代表性不足的语言（UL）—— NLP 研究在满足用户需求方面特别滞后的语言——注释少量数据是可行的。基于此，我们提出了 XTREME-UP，这是一个基准测试，其重点是稀缺数据方案而不是零样本；其聚焦于用户中心任务（即许多高资源语言使用者广泛采用的任务）；以及其聚焦于代表性不足的语言，在这些语言中，稀缺数据的情况往往最为现实。XTREME-UP 评估语言模型在 88 种代表性不足的语言上，跨越了 9 项主要的用户中心技术，包括 ASR、OCR、MT 和信息访问任务。我们为 OCR、自动完成、语义分析和音译创建了新的数据集，并在其他任务上构建并完善了现有的数据集。XTREME-UP 提供了一种评估 NLP 系统在代表性不足的语言上稀缺数据方案的性能的方法。它专注于实际价值对于高资源语言使用者的用户中心任务，并涵盖了 88 种语言。其目标是帮助推进多语言 NLP 系统对于稀缺数据资源的代表性不足的语言的发展。",
    "tldr": "该论文提出了 XTREME-UP，一个以少量数据评估代表性不足语言的 NLP 系统性能的用户中心稀缺数据基准测试。它专注于用户中心任务，聚焦于代表性不足的语言，覆盖 88 种语言，并介绍了新的 OCR、自动完成、语义分析和音译数据集，旨在帮助推进代表性不足语言的高度多语言 NLP 系统的发展。",
    "en_tdlr": "This paper proposes XTREME-UP, a user-centric scarce-data benchmark for under-represented languages which evaluates the performance of NLP systems with a focus on user-centric tasks and covers 88 languages. The benchmark includes new datasets for OCR, autocomplete, semantic parsing, and transliteration, and aims to advance the development of highly multilingual NLP systems for languages with scarce data resources."
}