{
    "title": "Fuzzy Temporal Protoforms for the Quantitative Description of Processes in Natural Language. (arXiv:2305.09506v1 [cs.CL])",
    "abstract": "In this paper, we propose a series of fuzzy temporal protoforms in the framework of the automatic generation of quantitative and qualitative natural language descriptions of processes. The model includes temporal and causal information from processes and attributes, quantifies attributes in time during the process life-span and recalls causal relations and temporal distances between events, among other features. Through integrating process mining techniques and fuzzy sets within the usual Data-to-Text architecture, our framework is able to extract relevant quantitative temporal as well as structural information from a process and describe it in natural language involving uncertain terms. A real use-case in the cardiology domain is presented, showing the potential of our model for providing natural language explanations addressed to domain experts.",
    "link": "http://arxiv.org/abs/2305.09506",
    "context": "Title: Fuzzy Temporal Protoforms for the Quantitative Description of Processes in Natural Language. (arXiv:2305.09506v1 [cs.CL])\nAbstract: In this paper, we propose a series of fuzzy temporal protoforms in the framework of the automatic generation of quantitative and qualitative natural language descriptions of processes. The model includes temporal and causal information from processes and attributes, quantifies attributes in time during the process life-span and recalls causal relations and temporal distances between events, among other features. Through integrating process mining techniques and fuzzy sets within the usual Data-to-Text architecture, our framework is able to extract relevant quantitative temporal as well as structural information from a process and describe it in natural language involving uncertain terms. A real use-case in the cardiology domain is presented, showing the potential of our model for providing natural language explanations addressed to domain experts.",
    "path": "papers/23/05/2305.09506.json",
    "total_tokens": 772,
    "translated_title": "模糊时间原型体用于自然语言进程的定量描述",
    "translated_abstract": "本文在自然语言过程的定量和定性描述的框架中提出了一系列模糊时间原型体。该模型包括过程和属性的时间和因果信息，定量描述了过程寿命内的属性，并回忆了事件之间的因果关系和时间距离，等等其他特征。通过在常规数据到文本架构中集成过程挖掘技术和模糊集，我们的框架能够从过程中提取相关的定量和结构信息，并用涉及不确定术语的自然语言描述来描述它。本文还介绍了心脏病领域的实际用例，展示了我们的模型为向领域专家提供自然语言解释的潜力。",
    "tldr": "本文提出了一种自然语言进程描述方法，使用模糊时间原型体实现定量描述。模型能提取过程的相关信息，并用自然语言描述，可应用于心脏病领域等其他复杂领域。",
    "en_tdlr": "This paper proposes a method for describing natural language processes using fuzzy temporal protoforms for quantitative description. The model can extract relevant information from a process and describe it in natural language, which can be applied to other complex domains, such as cardiology."
}