{
    "title": "Playing the system: address manipulation and access to schools. (arXiv:2305.18949v1 [econ.GN])",
    "abstract": "Strategic incentives may lead to inefficient and unequal provision of public services. A prominent example is school admissions. Existing research shows that applicants \"play the system\" by submitting school rankings strategically. We investigate whether applicants also play the system by manipulating their eligibility at schools. We analyze this applicant deception in a theoretical model and provide testable predictions for commonly-used admission procedures. We confirm these model predictions empirically by analyzing the implementation of two reforms. First, we find that the introduction of a residence-based school-admission criterion in Denmark caused address changes to increase by more than 100% before the high-school application deadline. This increase occurred only in areas where the incentive to manipulate is high-powered. Second, to assess whether this behavior reflects actual address changes, we study a second reform that required applicants to provide additional proof of plac",
    "link": "http://arxiv.org/abs/2305.18949",
    "context": "Title: Playing the system: address manipulation and access to schools. (arXiv:2305.18949v1 [econ.GN])\nAbstract: Strategic incentives may lead to inefficient and unequal provision of public services. A prominent example is school admissions. Existing research shows that applicants \"play the system\" by submitting school rankings strategically. We investigate whether applicants also play the system by manipulating their eligibility at schools. We analyze this applicant deception in a theoretical model and provide testable predictions for commonly-used admission procedures. We confirm these model predictions empirically by analyzing the implementation of two reforms. First, we find that the introduction of a residence-based school-admission criterion in Denmark caused address changes to increase by more than 100% before the high-school application deadline. This increase occurred only in areas where the incentive to manipulate is high-powered. Second, to assess whether this behavior reflects actual address changes, we study a second reform that required applicants to provide additional proof of plac",
    "path": "papers/23/05/2305.18949.json",
    "total_tokens": 848,
    "tldr": "该研究研究了学校入学申请者是否通过欺骗其在学校的资格来达到游戏规则和不公平入学的目的，通过实证分析验证了该模型预测。"
}