{
    "title": "Evolving Dictionary Representation for Few-shot Class-incremental Learning. (arXiv:2305.01885v1 [cs.LG])",
    "abstract": "New objects are continuously emerging in the dynamically changing world and a real-world artificial intelligence system should be capable of continual and effectual adaptation to new emerging classes without forgetting old ones. In view of this, in this paper we tackle a challenging and practical continual learning scenario named few-shot class-incremental learning (FSCIL), in which labeled data are given for classes in a base session but very limited labeled instances are available for new incremental classes. To address this problem, we propose a novel and succinct approach by introducing deep dictionary learning which is a hybrid learning architecture that combines dictionary learning and visual representation learning to provide a better space for characterizing different classes. We simultaneously optimize the dictionary and the feature extraction backbone in the base session, while only finetune the dictionary in the incremental session for adaptation to novel classes, which can ",
    "link": "http://arxiv.org/abs/2305.01885",
    "context": "Title: Evolving Dictionary Representation for Few-shot Class-incremental Learning. (arXiv:2305.01885v1 [cs.LG])\nAbstract: New objects are continuously emerging in the dynamically changing world and a real-world artificial intelligence system should be capable of continual and effectual adaptation to new emerging classes without forgetting old ones. In view of this, in this paper we tackle a challenging and practical continual learning scenario named few-shot class-incremental learning (FSCIL), in which labeled data are given for classes in a base session but very limited labeled instances are available for new incremental classes. To address this problem, we propose a novel and succinct approach by introducing deep dictionary learning which is a hybrid learning architecture that combines dictionary learning and visual representation learning to provide a better space for characterizing different classes. We simultaneously optimize the dictionary and the feature extraction backbone in the base session, while only finetune the dictionary in the incremental session for adaptation to novel classes, which can ",
    "path": "papers/23/05/2305.01885.json",
    "total_tokens": 1035,
    "translated_title": "适应新的类别而不遗忘旧的类别：基于演化字典表示的少样本类别递增学习",
    "translated_abstract": "在不断变化的世界中，新的物体不断出现，一个真正的人工智能系统应该能够持续而有效地适应新出现的类别，而不会忘记旧有的类别。因此，在本文中，我们针对一个具有挑战性和实用性的继续学习场景——少样本类别递增学习进行研究，即在基础会话中为类别提供标记数据，但新的增量类别仅有非常有限的标记实例。为了解决这个问题，我们提出了一种新颖而简洁的方法，即引入深度字典学习，这是一种混合学习架构，结合了字典学习和视觉表示学习，以提供更好的空间来表征不同的类别。我们同时优化基础会话中的字典和特征提取骨干，并仅在增量会话中微调字典以适应新的类别，从而避免了灾难性遗忘。我们的方法在几个基准数据集上实现了最先进的性能，展示了演化字典表示在少样本类别递增学习中的有效性。",
    "tldr": "本文提出了一种基于演化字典表示的少样本类别递增学习方法，在基础会话中同时优化字典和特征提取骨干，在增量会话中仅微调字典以适应新类别，避免灾难性遗忘，并在多个基准数据集上实现了最先进的性能。",
    "en_tdlr": "This paper proposes an evolving dictionary representation approach for few-shot class-incremental learning, which simultaneously optimizes dictionary and feature extraction backbone in the base session, and finetunes only the dictionary in the incremental session to avoid catastrophic forgetting. It achieves state-of-the-art performance on several benchmark datasets for FSCIL."
}