{
    "title": "Social Value Orientation and Integral Emotions in Multi-Agent Systems. (arXiv:2305.05549v1 [cs.MA])",
    "abstract": "Human social behavior is influenced by individual differences in social preferences. Social value orientation (SVO) is a measurable personality trait which indicates the relative importance an individual places on their own and on others' welfare when making decisions. SVO and other individual difference variables are strong predictors of human behavior and social outcomes. However, there are transient changes human behavior associated with emotions that are not captured by individual differences alone. Integral emotions, the emotions which arise in direct response to a decision-making scenario, have been linked to temporary shifts in decision-making preferences.  In this work, we investigated the effects of moderating social preferences with integral emotions in multi-agent societies. We developed Svoie, a method for designing agents which make decisions based on established SVO policies, as well as alternative integral emotion policies in response to task outcomes. We conducted simul",
    "link": "http://arxiv.org/abs/2305.05549",
    "context": "Title: Social Value Orientation and Integral Emotions in Multi-Agent Systems. (arXiv:2305.05549v1 [cs.MA])\nAbstract: Human social behavior is influenced by individual differences in social preferences. Social value orientation (SVO) is a measurable personality trait which indicates the relative importance an individual places on their own and on others' welfare when making decisions. SVO and other individual difference variables are strong predictors of human behavior and social outcomes. However, there are transient changes human behavior associated with emotions that are not captured by individual differences alone. Integral emotions, the emotions which arise in direct response to a decision-making scenario, have been linked to temporary shifts in decision-making preferences.  In this work, we investigated the effects of moderating social preferences with integral emotions in multi-agent societies. We developed Svoie, a method for designing agents which make decisions based on established SVO policies, as well as alternative integral emotion policies in response to task outcomes. We conducted simul",
    "path": "papers/23/05/2305.05549.json",
    "total_tokens": 935,
    "translated_title": "社会价值取向与多智能体系统中的积分情感",
    "translated_abstract": "个体的社会行为受社会偏好的个体差异的影响。社会价值取向（SVO）是一种可测量的人格特征，表明个体在做出决策时，对自己和他人的福利相对重视的程度。SVO和其他个体差异变量是人类行为和社会结果的强有力预测因素。然而，与个体差异独立的短暂情绪变化也会影响人类行为。积分情感是对决策情境直接反应而产生的情感，已经与决策取向的临时转变相关联。在这项研究中，我们研究了积分情感对多智能体社会中调节社会偏好的影响。我们开发了Svoie，一种基于已建立的SVO政策和任务结果的可替代积分情感政策做出决策的智能体设计方法。我们进行了仿真实验，研究了不同的社会值取向和情感调节对智能体内部和整体行为的影响。",
    "tldr": "本文研究了社会价值取向(SVO)和积分情感在多智能体系统中的相互作用，开发了一种基于SVO和积分情感政策的智能体设计方法，并在仿真实验中探究了不同的社会偏好和情感对智能体的影响。",
    "en_tdlr": "This paper investigates the interaction between Social Value Orientation (SVO) and Integral Emotions in multi-agent systems, develops a method for designing agents based on SVO and alternative integral emotion policies, and explores the effects of different social preferences and emotions on the behavior of agents through simulated experiments."
}