{
    "title": "Keyword-Based Diverse Image Retrieval by Semantics-aware Contrastive Learning and Transformer. (arXiv:2305.04072v1 [cs.IR])",
    "abstract": "In addition to relevance, diversity is an important yet less studied performance metric of cross-modal image retrieval systems, which is critical to user experience. Existing solutions for diversity-aware image retrieval either explicitly post-process the raw retrieval results from standard retrieval systems or try to learn multi-vector representations of images to represent their diverse semantics. However, neither of them is good enough to balance relevance and diversity. On the one hand, standard retrieval systems are usually biased to common semantics and seldom exploit diversity-aware regularization in training, which makes it difficult to promote diversity by post-processing. On the other hand, multi-vector representation methods are not guaranteed to learn robust multiple projections. As a result, irrelevant images and images of rare or unique semantics may be projected inappropriately, which degrades the relevance and diversity of the results generated by some typical algorithm",
    "link": "http://arxiv.org/abs/2305.04072",
    "context": "Title: Keyword-Based Diverse Image Retrieval by Semantics-aware Contrastive Learning and Transformer. (arXiv:2305.04072v1 [cs.IR])\nAbstract: In addition to relevance, diversity is an important yet less studied performance metric of cross-modal image retrieval systems, which is critical to user experience. Existing solutions for diversity-aware image retrieval either explicitly post-process the raw retrieval results from standard retrieval systems or try to learn multi-vector representations of images to represent their diverse semantics. However, neither of them is good enough to balance relevance and diversity. On the one hand, standard retrieval systems are usually biased to common semantics and seldom exploit diversity-aware regularization in training, which makes it difficult to promote diversity by post-processing. On the other hand, multi-vector representation methods are not guaranteed to learn robust multiple projections. As a result, irrelevant images and images of rare or unique semantics may be projected inappropriately, which degrades the relevance and diversity of the results generated by some typical algorithm",
    "path": "papers/23/05/2305.04072.json",
    "total_tokens": 669,
    "translated_title": "基于关键词的多样图像检索：基于语义感知对比学习和Transformer的方法",
    "translated_abstract": "除了相关性外，多样性是跨模态图像检索系统的另一个重要但较少研究的性能指标，对用户体验至关重要。现有的解决方案要么明确地对来自标准检索系统的原始检索结果进行后处理，要么尝试学习多向量表示图像以表示其多样的语义。然而，它们都不能很好地平衡相关性和多样性。",
    "tldr": "本文提出了一种基于语义感知对比学习和Transformer的方法，实现了关键词多样图像检索，能够平衡相关性和多样性。",
    "en_tdlr": "This paper proposed a method based on semantics-aware contrastive learning and transformer to achieve keyword-based diverse image retrieval, which can balance relevance and diversity."
}