{
    "title": "Generating medically-accurate summaries of patient-provider dialogue: A multi-stage approach using large language models. (arXiv:2305.05982v1 [cs.CL])",
    "abstract": "A medical provider's summary of a patient visit serves several critical purposes, including clinical decision-making, facilitating hand-offs between providers, and as a reference for the patient. An effective summary is required to be coherent and accurately capture all the medically relevant information in the dialogue, despite the complexity of patient-generated language. Even minor inaccuracies in visit summaries (for example, summarizing \"patient does not have a fever\" when a fever is present) can be detrimental to the outcome of care for the patient.  This paper tackles the problem of medical conversation summarization by discretizing the task into several smaller dialogue-understanding tasks that are sequentially built upon. First, we identify medical entities and their affirmations within the conversation to serve as building blocks. We study dynamically constructing few-shot prompts for tasks by conditioning on relevant patient information and use GPT-3 as the backbone for our ",
    "link": "http://arxiv.org/abs/2305.05982",
    "context": "Title: Generating medically-accurate summaries of patient-provider dialogue: A multi-stage approach using large language models. (arXiv:2305.05982v1 [cs.CL])\nAbstract: A medical provider's summary of a patient visit serves several critical purposes, including clinical decision-making, facilitating hand-offs between providers, and as a reference for the patient. An effective summary is required to be coherent and accurately capture all the medically relevant information in the dialogue, despite the complexity of patient-generated language. Even minor inaccuracies in visit summaries (for example, summarizing \"patient does not have a fever\" when a fever is present) can be detrimental to the outcome of care for the patient.  This paper tackles the problem of medical conversation summarization by discretizing the task into several smaller dialogue-understanding tasks that are sequentially built upon. First, we identify medical entities and their affirmations within the conversation to serve as building blocks. We study dynamically constructing few-shot prompts for tasks by conditioning on relevant patient information and use GPT-3 as the backbone for our ",
    "path": "papers/23/05/2305.05982.json",
    "total_tokens": 871,
    "translated_title": "使用大型语言模型的多阶段方法生成医学精确的患者-医生对话摘要",
    "translated_abstract": "医疗提供者对患者访问的摘要具有关键作用，包括临床决策、协调医疗团队和患者的参考资料。有效的摘要需要流畅，并准确捕捉对话中的所有医学相关信息，尽管患者语言的复杂性。即使在访问摘要中出现轻微的不准确 (例如，在发热时总结为“患者没有发烧”) 也会对患者的护理结果产生不利影响。本文将医学会话摘要问题划分为数个小型对话理解任务，其会依次构建。首先，我们确定对话中的医学实体及其确认状态，作为构建模块，通过在关联患者信息的情况下进行动态构建少量提示任务。使用GPT-3作为我们的支撑。",
    "tldr": "本文需要解决医疗对话摘要的问题，通过将任务划分为几个小的对话任务依次构建，使用GPT-3大型语言模型，动态构建提示任务以及确定医学实体及其确认状态。",
    "en_tdlr": "This paper addresses the problem of medical conversation summarization through discrete smaller dialogue-understanding tasks using GPT-3 as a backbone. The approach includes dynamically constructing few-shot prompts for tasks and identifying medical entities and their affirmations within the conversation to serve as building blocks."
}