{
    "title": "Understanding Emotion Valence is a Joint Deep Learning Task. (arXiv:2305.17422v2 [cs.CL] UPDATED)",
    "abstract": "The valence analysis of speakers' utterances or written posts helps to understand the activation and variations of the emotional state throughout the conversation. More recently, the concept of Emotion Carriers (EC) has been introduced to explain the emotion felt by the speaker and its manifestations. In this work, we investigate the natural inter-dependency of valence and ECs via a multi-task learning approach. We experiment with Pre-trained Language Models (PLM) for single-task, two-step, and joint settings for the valence and EC prediction tasks. We compare and evaluate the performance of generative (GPT-2) and discriminative (BERT) architectures in each setting. We observed that providing the ground truth label of one task improves the prediction performance of the models in the other task. We further observed that the discriminative model achieves the best trade-off of valence and EC prediction tasks in the joint prediction setting. As a result, we attain a single model that perfo",
    "link": "http://arxiv.org/abs/2305.17422",
    "context": "Title: Understanding Emotion Valence is a Joint Deep Learning Task. (arXiv:2305.17422v2 [cs.CL] UPDATED)\nAbstract: The valence analysis of speakers' utterances or written posts helps to understand the activation and variations of the emotional state throughout the conversation. More recently, the concept of Emotion Carriers (EC) has been introduced to explain the emotion felt by the speaker and its manifestations. In this work, we investigate the natural inter-dependency of valence and ECs via a multi-task learning approach. We experiment with Pre-trained Language Models (PLM) for single-task, two-step, and joint settings for the valence and EC prediction tasks. We compare and evaluate the performance of generative (GPT-2) and discriminative (BERT) architectures in each setting. We observed that providing the ground truth label of one task improves the prediction performance of the models in the other task. We further observed that the discriminative model achieves the best trade-off of valence and EC prediction tasks in the joint prediction setting. As a result, we attain a single model that perfo",
    "path": "papers/23/05/2305.17422.json",
    "total_tokens": 904,
    "translated_title": "理解情绪价值是一项联合深度学习任务",
    "translated_abstract": "对说话人的话语或写作中情绪价值分析有助于理解对话中情绪状态的激活和变化。最近，引入了情绪载体（EC）的概念来解释说话人所感受到的情绪及其表现。在这项工作中，我们通过多任务学习方法研究了情绪价值和EC之间的自然相互依赖关系。我们尝试了预训练语言模型（PLM）在情绪价值和EC预测任务中的单任务、两步法和联合设置。我们比较和评估了生成性（GPT-2）和判别性（BERT）架构在每种设置中的性能。结果显示，在一个任务中提供了另一个任务的真实标签可以提高模型在另一个任务中的预测性能。我们进一步观察到，判别性模型在联合预测设置中取得了情绪价值和EC预测任务的最佳平衡。因此，我们获得了一个能在这两个任务中表现出色的单一模型。",
    "tldr": "研究通过多任务学习方法，探索情绪价值与情绪载体之间的相互依赖关系，并在联合预测设置中使用判别性模型取得了最佳平衡。",
    "en_tdlr": "This work investigates the natural inter-dependency between emotion valence and emotion carriers (ECs) using a multi-task learning approach, and achieves the best trade-off between valence and EC prediction tasks using a discriminative model in the joint prediction setting."
}