{
    "title": "Reliable identification of selection mechanisms in language change. (arXiv:2305.15914v1 [cs.CL])",
    "abstract": "Language change is a cultural evolutionary process in which variants of linguistic variables change in frequency through processes analogous to mutation, selection and genetic drift. In this work, we apply a recently-introduced method to corpus data to quantify the strength of selection in specific instances of historical language change. We first demonstrate, in the context of English irregular verbs, that this method is more reliable and interpretable than similar methods that have previously been applied. We further extend this study to demonstrate that a bias towards phonological simplicity overrides that favouring grammatical simplicity when these are in conflict. Finally, with reference to Spanish spelling reforms, we show that the method can also detect points in time at which selection strengths change, a feature that is generically expected for socially-motivated language change. Together, these results indicate how hypotheses for mechanisms of language change can be tested qu",
    "link": "http://arxiv.org/abs/2305.15914",
    "context": "Title: Reliable identification of selection mechanisms in language change. (arXiv:2305.15914v1 [cs.CL])\nAbstract: Language change is a cultural evolutionary process in which variants of linguistic variables change in frequency through processes analogous to mutation, selection and genetic drift. In this work, we apply a recently-introduced method to corpus data to quantify the strength of selection in specific instances of historical language change. We first demonstrate, in the context of English irregular verbs, that this method is more reliable and interpretable than similar methods that have previously been applied. We further extend this study to demonstrate that a bias towards phonological simplicity overrides that favouring grammatical simplicity when these are in conflict. Finally, with reference to Spanish spelling reforms, we show that the method can also detect points in time at which selection strengths change, a feature that is generically expected for socially-motivated language change. Together, these results indicate how hypotheses for mechanisms of language change can be tested qu",
    "path": "papers/23/05/2305.15914.json",
    "total_tokens": 910,
    "translated_title": "语言变化中选择机制的可靠识别",
    "translated_abstract": "语言变化是一种文化进化过程，其中语言变量的变异通过类似于突变、选择和遗传漂变的过程而频繁变化。本文应用最近引入的一种方法来对语料库数据进行分析，以量化历史语言变化的特定实例中的选择强度。我们首先在英语不规则动词的语境下证明了这种方法比以前应用过的类似方法更可靠和可解释。我们进一步扩展了这项研究，证明了在语音简单性与语法简单性冲突时，对语音简单性的偏好优先于对语法简单性的偏好。最后，针对西班牙的拼写改革，我们展示了该方法也可以检测选择强度变化的时间点，这是社会动机语言变化通常具有的特征。这些结果共同表明如何测试语言变化机制的假设。",
    "tldr": "本文探究了语言变化中的选择机制，提出了一个可靠且可解释的方法来量化历史语言变化的特定实例中的选择强度。该方法被证明比以前应用过的方法更可靠。作者还展示了语音简单性优先于语法简单性，并说明了该方法也可以检测选择强度变化的时间点。"
}