{
    "title": "Comparison of machine learning models applied on anonymized data with different techniques. (arXiv:2305.07415v1 [cs.LG])",
    "abstract": "Anonymization techniques based on obfuscating the quasi-identifiers by means of value generalization hierarchies are widely used to achieve preset levels of privacy. To prevent different types of attacks against database privacy it is necessary to apply several anonymization techniques beyond the classical k-anonymity or $\\ell$-diversity. However, the application of these methods is directly connected to a reduction of their utility in prediction and decision making tasks. In this work we study four classical machine learning methods currently used for classification purposes in order to analyze the results as a function of the anonymization techniques applied and the parameters selected for each of them. The performance of these models is studied when varying the value of k for k-anonymity and additional tools such as $\\ell$-diversity, t-closeness and $\\delta$-disclosure privacy are also deployed on the well-known adult dataset.",
    "link": "http://arxiv.org/abs/2305.07415",
    "context": "Title: Comparison of machine learning models applied on anonymized data with different techniques. (arXiv:2305.07415v1 [cs.LG])\nAbstract: Anonymization techniques based on obfuscating the quasi-identifiers by means of value generalization hierarchies are widely used to achieve preset levels of privacy. To prevent different types of attacks against database privacy it is necessary to apply several anonymization techniques beyond the classical k-anonymity or $\\ell$-diversity. However, the application of these methods is directly connected to a reduction of their utility in prediction and decision making tasks. In this work we study four classical machine learning methods currently used for classification purposes in order to analyze the results as a function of the anonymization techniques applied and the parameters selected for each of them. The performance of these models is studied when varying the value of k for k-anonymity and additional tools such as $\\ell$-diversity, t-closeness and $\\delta$-disclosure privacy are also deployed on the well-known adult dataset.",
    "path": "papers/23/05/2305.07415.json",
    "total_tokens": 826,
    "translated_title": "应用不同技术对匿名数据的机器学习模型比较",
    "translated_abstract": "基于对值概括层次结构的偏识标识符（quasi-identifiers）进行混淆的匿名化技术被广泛用于实现预设的隐私级别，为了防止对数据库隐私的不同类型攻击，需要应用多种匿名化技术，但这些方法的应用与预测和决策制定任务的效用降低直接相关。本研究使用四种用于分类目的的经典机器学习方法，以分析与应用的匿名化技术和每种方法选定的参数相关的结果。我们研究了这些模型的性能，当改变k值用于k-匿名性，并在众所周知的成人数据集上部署了$\\ell$-多样性、t-密切度和$\\delta$-泄露隐私等附加工具。",
    "tldr": "本研究比较了四种经典机器学习方法在不同匿名化技术下对成人数据集分类任务的表现，分析了匿名化技术和参数对模型性能的影响。",
    "en_tdlr": "This study compares the performance of four classical machine learning methods under different anonymization techniques on the adult dataset for classification purposes and analyzes the impact of anonymization techniques and parameters on model performance."
}