{
    "title": "Three candidate election strategy. (arXiv:2305.00693v1 [math.PR])",
    "abstract": "The probability of a given candidate winning a future election is worked out in closed form as a function of (i) the current support rates for each candidate, (ii) the relative positioning of the candidates within the political spectrum, (iii) the time left to the election, and (iv) the rate at which noisy information is revealed to the electorate from now to the election day, when there are three or more candidates. It is shown, in particular, that the optimal strategy for controlling information can be intricate and nontrivial, in contrast to a two-candidate race. A surprising finding is that for a candidate taking the centre ground in an electoral competition among a polarised electorate, certain strategies are fatal in that the resulting winning probability for that candidate vanishes identically.",
    "link": "http://arxiv.org/abs/2305.00693",
    "context": "Title: Three candidate election strategy. (arXiv:2305.00693v1 [math.PR])\nAbstract: The probability of a given candidate winning a future election is worked out in closed form as a function of (i) the current support rates for each candidate, (ii) the relative positioning of the candidates within the political spectrum, (iii) the time left to the election, and (iv) the rate at which noisy information is revealed to the electorate from now to the election day, when there are three or more candidates. It is shown, in particular, that the optimal strategy for controlling information can be intricate and nontrivial, in contrast to a two-candidate race. A surprising finding is that for a candidate taking the centre ground in an electoral competition among a polarised electorate, certain strategies are fatal in that the resulting winning probability for that candidate vanishes identically.",
    "path": "papers/23/05/2305.00693.json",
    "total_tokens": 814,
    "translated_title": "三个候选人选举策略",
    "translated_abstract": "本研究考虑了三个或更多候选人参加选举的情况下，候选人获胜的概率如何随时间变化。该概率的变化与当前每个候选人的支持率、候选人在政治光谱中的相对位置、距离选举日剩余的时间以及直到选举日公众获得有噪声的信息的速率有关。特别是，本研究发现对于控制信息的最佳策略可能是错综复杂的，并非两个候选人场景下的简单直觉。有趣的是，在存在两个极端的选民的选举竞争中，如果候选人处于中间位置，某些策略将使得该候选人的获胜概率完全消失。",
    "tldr": "本研究考虑了三个或更多候选人参加选举的情况下，获胜的概率如何随时间变化，发现对于控制信息的最佳策略可能是错综复杂的。",
    "en_tdlr": "This paper investigates the probability of a candidate winning a future election in the presence of three or more candidates, taking into account current support rates, relative positioning, time left to the election, and noisy information revealed to the public. It shows that controlling information can be intricate and nontrivial and in certain scenarios, a candidate's winning probability can vanish completely."
}