{
    "title": "Adjusting Logit in Gaussian Form for Long-Tailed Visual Recognition. (arXiv:2305.10648v1 [cs.CV])",
    "abstract": "It is not uncommon that real-world data are distributed with a long tail. For such data, the learning of deep neural networks becomes challenging because it is hard to classify tail classes correctly. In the literature, several existing methods have addressed this problem by reducing classifier bias provided that the features obtained with long-tailed data are representative enough. However, we find that training directly on long-tailed data leads to uneven embedding space. That is, the embedding space of head classes severely compresses that of tail classes, which is not conducive to subsequent classifier learning. %further improving model performance. This paper therefore studies the problem of long-tailed visual recognition from the perspective of feature level. We introduce feature augmentation to balance the embedding distribution. The features of different classes are perturbed with varying amplitudes in Gaussian form. Based on these perturbed features, two novel logit adjustment",
    "link": "http://arxiv.org/abs/2305.10648",
    "context": "Title: Adjusting Logit in Gaussian Form for Long-Tailed Visual Recognition. (arXiv:2305.10648v1 [cs.CV])\nAbstract: It is not uncommon that real-world data are distributed with a long tail. For such data, the learning of deep neural networks becomes challenging because it is hard to classify tail classes correctly. In the literature, several existing methods have addressed this problem by reducing classifier bias provided that the features obtained with long-tailed data are representative enough. However, we find that training directly on long-tailed data leads to uneven embedding space. That is, the embedding space of head classes severely compresses that of tail classes, which is not conducive to subsequent classifier learning. %further improving model performance. This paper therefore studies the problem of long-tailed visual recognition from the perspective of feature level. We introduce feature augmentation to balance the embedding distribution. The features of different classes are perturbed with varying amplitudes in Gaussian form. Based on these perturbed features, two novel logit adjustment",
    "path": "papers/23/05/2305.10648.json",
    "total_tokens": 971,
    "translated_title": "对高长尾视觉识别中的logit进行高斯形式调整",
    "translated_abstract": "现实世界中的数据往往具有长尾分布。对于这种数据，由于难以正确分类尾部类别，深度神经网络的学习变得具有挑战性。在文献中，已有一些方法通过减少分类器偏差来解决这个问题，前提是用长尾数据获得的特征足够代表。然而，我们发现直接在长尾数据上训练会导致不均匀的嵌入空间。也就是说，头类的嵌入空间严重压缩尾类，这对于后续的分类器学习是不利的。因此，本文从特征水平的角度研究了长尾视觉识别问题。我们引入了特征增强来平衡嵌入分布。不同类别的特征以高斯形式具有不同振幅的扰动。基于这些扰动的特征，提出了两种新的logit调整方法来提高尾部类别的准确性。实验结果显示，我们的方法在CIFAR和ImageNet长尾数据集上优于其他最先进的方法。",
    "tldr": "本文提出了一种特征增强方法和两种logit调整方法，用于解决长尾视觉识别中的类别不平衡问题。实验结果表明，该方法在CIFAR和ImageNet长尾数据集上表现优于其他最先进的方法。",
    "en_tdlr": "This paper proposes a feature augmentation method and two novel logit adjustment methods to address the class imbalance problem in long-tailed visual recognition. Experimental results demonstrate the superiority of this approach over other state-of-the-art methods on CIFAR and ImageNet long-tailed datasets."
}