{
    "title": "UNSSOR: Unsupervised Neural Speech Separation by Leveraging Over-determined Training Mixtures. (arXiv:2305.20054v2 [cs.SD] UPDATED)",
    "abstract": "In reverberant conditions with multiple concurrent speakers, each microphone acquires a mixture signal of multiple speakers at a different location. In over-determined conditions where the microphones out-number speakers, we can narrow down the solutions to speaker images and realize unsupervised speech separation by leveraging each mixture signal as a constraint (i.e., the estimated speaker images at a microphone should add up to the mixture). Equipped with this insight, we propose UNSSOR, an algorithm for $\\textbf{u}$nsupervised $\\textbf{n}$eural $\\textbf{s}$peech $\\textbf{s}$eparation by leveraging $\\textbf{o}$ver-determined training mixtu$\\textbf{r}$es. At each training step, we feed an input mixture to a deep neural network (DNN) to produce an intermediate estimate for each speaker, linearly filter the estimates, and optimize a loss so that, at each microphone, the filtered estimates of all the speakers can add up to the mixture to satisfy the above constraint. We show that this l",
    "link": "http://arxiv.org/abs/2305.20054",
    "context": "Title: UNSSOR: Unsupervised Neural Speech Separation by Leveraging Over-determined Training Mixtures. (arXiv:2305.20054v2 [cs.SD] UPDATED)\nAbstract: In reverberant conditions with multiple concurrent speakers, each microphone acquires a mixture signal of multiple speakers at a different location. In over-determined conditions where the microphones out-number speakers, we can narrow down the solutions to speaker images and realize unsupervised speech separation by leveraging each mixture signal as a constraint (i.e., the estimated speaker images at a microphone should add up to the mixture). Equipped with this insight, we propose UNSSOR, an algorithm for $\\textbf{u}$nsupervised $\\textbf{n}$eural $\\textbf{s}$peech $\\textbf{s}$eparation by leveraging $\\textbf{o}$ver-determined training mixtu$\\textbf{r}$es. At each training step, we feed an input mixture to a deep neural network (DNN) to produce an intermediate estimate for each speaker, linearly filter the estimates, and optimize a loss so that, at each microphone, the filtered estimates of all the speakers can add up to the mixture to satisfy the above constraint. We show that this l",
    "path": "papers/23/05/2305.20054.json",
    "total_tokens": 1039,
    "translated_title": "UNSSOR: 通过利用过度训练混合物实现无监督神经语音分离",
    "translated_abstract": "在多个同时说话者的混响条件下，每个麦克风获取到不同位置的多个说话者混合信号。在过渡条件下，即麦克风数量超过说话者数量的情况下，我们可以通过将每个混合信号作为约束来缩小到说话者图像的解，并实现无监督语音分离（即估计的麦克风上的说话者图像应该加起来等于混合信号）。基于这个的理解，我们提出了一种名为UNSSOR的算法，通过利用过度训练混合物实现无监督神经语音分离。在每个训练步骤中，我们将输入混合物送入深度神经网络（DNN）以为每个说话者产生一个中间估计，对估计进行线性滤波，并优化损失，以使每个麦克风上的所有说话者的滤波估计相加等于混合信号，满足上述约束。我们证明这一方法可以显著提高语音分离效果和性能。",
    "tldr": "本文提出了一种名为UNSSOR的算法，通过利用过渡训练混合物来实现无监督神经语音分离。该算法利用每个混合信号作为约束，将估计的说话者图像加起来等于混合信号，从而缩小解的范围。实验结果表明，UNSSOR算法在语音分离效果和性能方面取得了显著的提升。",
    "en_tdlr": "This paper proposes UNSSOR, an algorithm for unsupervised neural speech separation by leveraging over-determined training mixtures. The algorithm utilizes the mixture signal as a constraint and narrows down the solutions to speaker images. Experimental results show that UNSSOR achieves significant improvements in speech separation performance."
}