{
    "title": "Domain-agnostic segmentation of thalamic nuclei from joint structural and diffusion MRI. (arXiv:2305.03413v1 [eess.IV])",
    "abstract": "The human thalamus is a highly connected subcortical grey-matter structure within the brain. It comprises dozens of nuclei with different function and connectivity, which are affected differently by disease. For this reason, there is growing interest in studying the thalamic nuclei in vivo with MRI. Tools are available to segment the thalamus from 1 mm T1 scans, but the contrast of the lateral and internal boundaries is too faint to produce reliable segmentations. Some tools have attempted to incorporate information from diffusion MRI in the segmentation to refine these boundaries, but do not generalise well across diffusion MRI acquisitions. Here we present the first CNN that can segment thalamic nuclei from T1 and diffusion data of any resolution without retraining or fine tuning. Our method builds on a public histological atlas of the thalamic nuclei and silver standard segmentations on high-quality diffusion data obtained with a recent Bayesian adaptive segmentation tool. We combin",
    "link": "http://arxiv.org/abs/2305.03413",
    "context": "Title: Domain-agnostic segmentation of thalamic nuclei from joint structural and diffusion MRI. (arXiv:2305.03413v1 [eess.IV])\nAbstract: The human thalamus is a highly connected subcortical grey-matter structure within the brain. It comprises dozens of nuclei with different function and connectivity, which are affected differently by disease. For this reason, there is growing interest in studying the thalamic nuclei in vivo with MRI. Tools are available to segment the thalamus from 1 mm T1 scans, but the contrast of the lateral and internal boundaries is too faint to produce reliable segmentations. Some tools have attempted to incorporate information from diffusion MRI in the segmentation to refine these boundaries, but do not generalise well across diffusion MRI acquisitions. Here we present the first CNN that can segment thalamic nuclei from T1 and diffusion data of any resolution without retraining or fine tuning. Our method builds on a public histological atlas of the thalamic nuclei and silver standard segmentations on high-quality diffusion data obtained with a recent Bayesian adaptive segmentation tool. We combin",
    "path": "papers/23/05/2305.03413.json",
    "total_tokens": 926,
    "translated_title": "基于结构和扩散MRI的通用领域下丘脑核分割",
    "translated_abstract": "人类丘脑是大脑内高度连接的皮层下灰质结构，包括数十个具有不同功能和连接性的核。这些核因疾病而受到不同程度的影响，因此越来越多的人对其进行MRI研究。虽然有工具可以从1mm T1扫描中分割出丘脑，但是边界的对比度太低而无法生成可靠的分割。一些工具尝试将扩散MRI中的信息整合到分割中以优化这些边界，但是这些方法在不同扩散MRI获取时不具有普适性。在这里，我们提出了第一个可以从任何分辨率的T1和扩散数据中分割丘脑核的CNN，而无需重新训练或微调。我们的方法基于公共组织学的丘脑核图谱和具有高质量扩散数据的银标准分割的最新贝叶斯自适应分割工具。",
    "tldr": "本研究提出了一种基于深度学习的方法，可以从任何分辨率的T1和扩散数据中分割出丘脑核，无需重新训练或微调，提高了丘脑核分割的准确性和普适性。"
}