{
    "title": "Measuring the Effect of Influential Messages on Varying Personas. (arXiv:2305.16470v1 [cs.CL])",
    "abstract": "Predicting how a user responds to news events enables important applications such as allowing intelligent agents or content producers to estimate the effect on different communities and revise unreleased messages to prevent unexpected bad outcomes such as social conflict and moral injury. We present a new task, Response Forecasting on Personas for News Media, to estimate the response a persona (characterizing an individual or a group) might have upon seeing a news message. Compared to the previous efforts which only predict generic comments to news, the proposed task not only introduces personalization in the modeling but also predicts the sentiment polarity and intensity of each response. This enables more accurate and comprehensive inference on the mental state of the persona. Meanwhile, the generated sentiment dimensions make the evaluation and application more reliable. We create the first benchmark dataset, which consists of 13,357 responses to 3,847 news headlines from Twitter. W",
    "link": "http://arxiv.org/abs/2305.16470",
    "context": "Title: Measuring the Effect of Influential Messages on Varying Personas. (arXiv:2305.16470v1 [cs.CL])\nAbstract: Predicting how a user responds to news events enables important applications such as allowing intelligent agents or content producers to estimate the effect on different communities and revise unreleased messages to prevent unexpected bad outcomes such as social conflict and moral injury. We present a new task, Response Forecasting on Personas for News Media, to estimate the response a persona (characterizing an individual or a group) might have upon seeing a news message. Compared to the previous efforts which only predict generic comments to news, the proposed task not only introduces personalization in the modeling but also predicts the sentiment polarity and intensity of each response. This enables more accurate and comprehensive inference on the mental state of the persona. Meanwhile, the generated sentiment dimensions make the evaluation and application more reliable. We create the first benchmark dataset, which consists of 13,357 responses to 3,847 news headlines from Twitter. W",
    "path": "papers/23/05/2305.16470.json",
    "total_tokens": 884,
    "translated_title": "评估不同群体对影响力信息的反应",
    "translated_abstract": "预测用户对新闻事件的反应能够实现智能代理或内容生成者估计不同社区的影响并修订未发布的信息，防止社会冲突和道德伤害。本文提出了一项新任务：用于新闻媒体的人设反应预测，以预测人设（描述个人或群体）对新闻信息的反应。与以往仅预测新闻的通用评论的工作相比，所提出的任务不仅在建模中引入了个性化，还预测了每个反应的情感极性和强度。这使得对人设的心理状态进行更准确和全面的推断成为可能。同时，生成的情感维度使得评估和应用更加可靠。我们创建了第一个基准数据集，其中包括来自Twitter的3,847个新闻标题的13,357个反应。",
    "tldr": "研究了评估不同群体对影响力信息的反应的任务和所创建的数据集，突出了新任务在建模中引入了个性化，预测了每个反应的情感极性和强度，并让评估和应用更加可靠。",
    "en_tdlr": "This paper introduces a new task - Response Forecasting on Personas for News Media, to estimate the response a persona might have upon seeing a news message and creates a benchmark dataset consisting of 13,357 responses to 3,847 news headlines from Twitter. The proposed task not only introduces personalization in the modeling but also predicts the sentiment polarity and intensity of each response, making evaluation and application more reliable."
}