{
    "title": "Reconstruction, forecasting, and stability of chaotic dynamics from partial data. (arXiv:2305.15111v2 [nlin.AO] UPDATED)",
    "abstract": "The forecasting and computation of the stability of chaotic systems from partial observations are tasks for which traditional equation-based methods may not be suitable. In this computational paper, we propose data-driven methods to (i) infer the dynamics of unobserved (hidden) chaotic variables (full-state reconstruction); (ii) time forecast the evolution of the full state; and (iii) infer the stability properties of the full state. The tasks are performed with long short-term memory (LSTM) networks, which are trained with observations (data) limited to only part of the state: (i) the low-to-high resolution LSTM (LH-LSTM), which takes partial observations as training input, and requires access to the full system state when computing the loss; and (ii) the physics-informed LSTM (PI-LSTM), which is designed to combine partial observations with the integral formulation of the dynamical system's evolution equations. First, we derive the Jacobian of the LSTMs. Second, we analyse a chaotic ",
    "link": "http://arxiv.org/abs/2305.15111",
    "context": "Title: Reconstruction, forecasting, and stability of chaotic dynamics from partial data. (arXiv:2305.15111v2 [nlin.AO] UPDATED)\nAbstract: The forecasting and computation of the stability of chaotic systems from partial observations are tasks for which traditional equation-based methods may not be suitable. In this computational paper, we propose data-driven methods to (i) infer the dynamics of unobserved (hidden) chaotic variables (full-state reconstruction); (ii) time forecast the evolution of the full state; and (iii) infer the stability properties of the full state. The tasks are performed with long short-term memory (LSTM) networks, which are trained with observations (data) limited to only part of the state: (i) the low-to-high resolution LSTM (LH-LSTM), which takes partial observations as training input, and requires access to the full system state when computing the loss; and (ii) the physics-informed LSTM (PI-LSTM), which is designed to combine partial observations with the integral formulation of the dynamical system's evolution equations. First, we derive the Jacobian of the LSTMs. Second, we analyse a chaotic ",
    "path": "papers/23/05/2305.15111.json",
    "total_tokens": 897,
    "translated_title": "从部分数据中重构、预测和稳定混沌动力学",
    "translated_abstract": "传统的基于方程的方法可能不适用于从部分观测中预测和计算混沌系统的稳定性。在这篇计算论文中，我们提出了数据驱动的方法来（i）推断未观测到（隐藏的）混沌变量的动力学（全状态重构）；（ii）对全状态的演化进行时间预测；和（iii）推断全状态的稳定性质。这些任务是通过长短期记忆（LSTM）网络来完成的，这些网络在训练时使用的观测数据仅限于状态的部分：（i）低到高分辨率的LSTM（LH-LSTM），它将部分观测作为训练输入，并在计算损失时需要访问整个系统状态；和（ii）物理信息LSTM（PI-LSTM），其设计是将部分观测与动力系统演化方程的积分形式相结合。首先，我们推导了LSTM的雅可比矩阵。其次，我们分析了一个混沌系统的例子。",
    "tldr": "该论文提出了使用具有长短期记忆（LSTM）网络的数据驱动方法，从部分观测中重构出混沌系统的动力学，进行时间预测，并推断其稳定性。",
    "en_tdlr": "This paper proposes data-driven methods using long short-term memory (LSTM) networks to reconstruct the dynamics of chaotic systems from partial observations, perform time forecasting, and infer stability properties."
}