{
    "title": "CODET: A Benchmark for Contrastive Dialectal Evaluation of Machine Translation. (arXiv:2305.17267v1 [cs.CL])",
    "abstract": "Neural machine translation (NMT) systems exhibit limited robustness in handling source-side linguistic variations. Their performance tends to degrade when faced with even slight deviations in language usage, such as different domains or variations introduced by second-language speakers. It is intuitive to extend this observation to encompass dialectal variations as well, but the work allowing the community to evaluate MT systems on this dimension is limited. To alleviate this issue, we compile and release \\dataset, a contrastive dialectal benchmark encompassing 882 different variations from nine different languages. We also quantitatively demonstrate the challenges large MT models face in effectively translating dialectal variants. We are releasing all code and data.",
    "link": "http://arxiv.org/abs/2305.17267",
    "context": "Title: CODET: A Benchmark for Contrastive Dialectal Evaluation of Machine Translation. (arXiv:2305.17267v1 [cs.CL])\nAbstract: Neural machine translation (NMT) systems exhibit limited robustness in handling source-side linguistic variations. Their performance tends to degrade when faced with even slight deviations in language usage, such as different domains or variations introduced by second-language speakers. It is intuitive to extend this observation to encompass dialectal variations as well, but the work allowing the community to evaluate MT systems on this dimension is limited. To alleviate this issue, we compile and release \\dataset, a contrastive dialectal benchmark encompassing 882 different variations from nine different languages. We also quantitatively demonstrate the challenges large MT models face in effectively translating dialectal variants. We are releasing all code and data.",
    "path": "papers/23/05/2305.17267.json",
    "total_tokens": 764,
    "translated_title": "CODET：机器翻译对比方言评估的基准测试",
    "translated_abstract": "神经机器翻译系统在处理源语言的语言变化方面表现出有限的鲁棒性。当面临即使是语言使用中的细微差异（例如不同的领域或由第二语言使用者引入的变体）时，其性能往往会下降。直观上，将这种观察推广到涵盖方言变体，而允许社区在这个维度上评估MT系统的工作是有限的。为了解决这个问题，我们编译和发布了对比方言基准测试 \\dataset，其中包括来自九种不同语言的882个不同变体。我们还在数量上展示了大型MT模型在有效翻译方言变体方面面临的挑战。我们发布所有代码和数据。",
    "tldr": "CODET是一个对比方言的评估基准测试，用于评估机器翻译系统在处理方言变体时的表现，该基准测试包含九种不同语言的882个不同变体。",
    "en_tdlr": "CODET is a benchmark for evaluating machine translation systems on dialectal variations, encompassing 882 different variations from nine different languages. The dataset quantitatively demonstrates the challenges large MT models face in effectively translating dialectal variants."
}