{
    "title": "Diffusion Models in NLP: A Survey. (arXiv:2305.14671v1 [cs.CL])",
    "abstract": "This survey paper provides a comprehensive review of the use of diffusion models in natural language processing (NLP). Diffusion models are a class of mathematical models that aim to capture the diffusion of information or signals across a network or manifold. In NLP, diffusion models have been used in a variety of applications, such as natural language generation, sentiment analysis, topic modeling, and machine translation. This paper discusses the different formulations of diffusion models used in NLP, their strengths and limitations, and their applications. We also perform a thorough comparison between diffusion models and alternative generative models, specifically highlighting the autoregressive (AR) models, while also examining how diverse architectures incorporate the Transformer in conjunction with diffusion models. Compared to AR models, diffusion models have significant advantages for parallel generation, text interpolation, token-level controls such as syntactic structures a",
    "link": "http://arxiv.org/abs/2305.14671",
    "context": "Title: Diffusion Models in NLP: A Survey. (arXiv:2305.14671v1 [cs.CL])\nAbstract: This survey paper provides a comprehensive review of the use of diffusion models in natural language processing (NLP). Diffusion models are a class of mathematical models that aim to capture the diffusion of information or signals across a network or manifold. In NLP, diffusion models have been used in a variety of applications, such as natural language generation, sentiment analysis, topic modeling, and machine translation. This paper discusses the different formulations of diffusion models used in NLP, their strengths and limitations, and their applications. We also perform a thorough comparison between diffusion models and alternative generative models, specifically highlighting the autoregressive (AR) models, while also examining how diverse architectures incorporate the Transformer in conjunction with diffusion models. Compared to AR models, diffusion models have significant advantages for parallel generation, text interpolation, token-level controls such as syntactic structures a",
    "path": "papers/23/05/2305.14671.json",
    "total_tokens": 845,
    "translated_title": "自然语言处理中的扩散模型综述",
    "translated_abstract": "本综述论文全面回顾了扩散模型在自然语言处理(NLP)中的应用。扩散模型是一类数学模型，旨在捕捉信息或信号在网络或流形上的扩散。在NLP中，扩散模型已被用于各种应用，如自然语言生成、情感分析、主题建模和机器翻译。本文讨论了NLP中使用的不同扩散模型的公式、优劣点和应用。同时，我们还对扩散模型与其他生成模型进行了全面比较，特别是自回归(AR)模型，还研究了如何将Transformer与扩散模型结合以实现多样化的架构。相比AR模型，扩散模型在并行生成、文本插值、词级别控制(如句法结构)等方面具有明显的优势。",
    "tldr": "本文全面综述了扩散模型在NLP中的各种应用，比较了其与自回归模型的优劣，指出扩散模型在并行生成、文本插值、词级别控制等方面具有明显优势。",
    "en_tdlr": "This survey paper comprehensively reviews the use of diffusion models in various applications in NLP, compares their advantages and disadvantages with autoregressive models, and highlights the significant advantages of diffusion models including parallel generation, text interpolation, and token-level controls such as syntactic structures."
}