{
    "title": "CREMP: Conformer-Rotamer Ensembles of Macrocyclic Peptides for Machine Learning. (arXiv:2305.08057v1 [q-bio.BM])",
    "abstract": "Computational and machine learning approaches to model the conformational landscape of macrocyclic peptides have the potential to enable rational design and optimization. However, accurate, fast, and scalable methods for modeling macrocycle geometries remain elusive. Recent deep learning approaches have significantly accelerated protein structure prediction and the generation of small-molecule conformational ensembles, yet similar progress has not been made for macrocyclic peptides due to their unique properties. Here, we introduce CREMP, a resource generated for the rapid development and evaluation of machine learning models for macrocyclic peptides. CREMP contains 36,198 unique macrocyclic peptides and their high-quality structural ensembles generated using the Conformer-Rotamer Ensemble Sampling Tool (CREST). Altogether, this new dataset contains nearly 31.3 million unique macrocycle geometries, each annotated with energies derived from semi-empirical extended tight-binding (xTB) DF",
    "link": "http://arxiv.org/abs/2305.08057",
    "context": "Title: CREMP: Conformer-Rotamer Ensembles of Macrocyclic Peptides for Machine Learning. (arXiv:2305.08057v1 [q-bio.BM])\nAbstract: Computational and machine learning approaches to model the conformational landscape of macrocyclic peptides have the potential to enable rational design and optimization. However, accurate, fast, and scalable methods for modeling macrocycle geometries remain elusive. Recent deep learning approaches have significantly accelerated protein structure prediction and the generation of small-molecule conformational ensembles, yet similar progress has not been made for macrocyclic peptides due to their unique properties. Here, we introduce CREMP, a resource generated for the rapid development and evaluation of machine learning models for macrocyclic peptides. CREMP contains 36,198 unique macrocyclic peptides and their high-quality structural ensembles generated using the Conformer-Rotamer Ensemble Sampling Tool (CREST). Altogether, this new dataset contains nearly 31.3 million unique macrocycle geometries, each annotated with energies derived from semi-empirical extended tight-binding (xTB) DF",
    "path": "papers/23/05/2305.08057.json",
    "total_tokens": 901,
    "translated_title": "CREMP: 大环肽的构象旋转组合集，用于机器学习",
    "translated_abstract": "计算和机器学习方法对于模拟大环肽的构象具有潜在的启示性作用，能够实现合理的设计和优化。然而，准确、快速、可伸缩的建模大环肽几何形状的方法仍然很难得到。近期的深度学习方法显著加速了蛋白质结构预测和小分子构象集合的生成，但由于大环肽的独特特性，在大环肽的建模方面仍未取得类似的进展。在这里，我们引入了CREMP，这是一个用来快速开发和评估大环肽机器学习模型的资源。CREMP包含36,198个独特的大环肽及其利用构象-旋转组合采样工具（CREST）生成的高质量构象集合。总之，这个新的数据集包含近3130万个独特的大环肽几何形状，每个形状都用半经验扩展紧束缚（xTB）DF导出的能量进行注释。",
    "tldr": "CREMP是一个资源，包含超过3千万个大环肽构象形状，旨在快速开发和评估机器学习模型，以便更好地模拟大环肽的构象。",
    "en_tdlr": "CREMP is a resource containing over 31 million unique macrocycle geometries for the rapid development and evaluation of machine learning models, aiming to better model the conformations of macrocyclic peptides."
}