{
    "title": "Betray Oneself: A Novel Audio DeepFake Detection Model via Mono-to-Stereo Conversion. (arXiv:2305.16353v1 [cs.SD])",
    "abstract": "Audio Deepfake Detection (ADD) aims to detect the fake audio generated by text-to-speech (TTS), voice conversion (VC) and replay, etc., which is an emerging topic. Traditionally we take the mono signal as input and focus on robust feature extraction and effective classifier design. However, the dual-channel stereo information in the audio signal also includes important cues for deepfake, which has not been studied in the prior work. In this paper, we propose a novel ADD model, termed as M2S-ADD, that attempts to discover audio authenticity cues during the mono-to-stereo conversion process. We first projects the mono to a stereo signal using a pretrained stereo synthesizer, then employs a dual-branch neural architecture to process the left and right channel signals, respectively. In this way, we effectively reveal the artifacts in the fake audio, thus improve the ADD performance. The experiments on the ASVspoof2019 database show that M2S-ADD outperforms all baselines that input mono. We",
    "link": "http://arxiv.org/abs/2305.16353",
    "context": "Title: Betray Oneself: A Novel Audio DeepFake Detection Model via Mono-to-Stereo Conversion. (arXiv:2305.16353v1 [cs.SD])\nAbstract: Audio Deepfake Detection (ADD) aims to detect the fake audio generated by text-to-speech (TTS), voice conversion (VC) and replay, etc., which is an emerging topic. Traditionally we take the mono signal as input and focus on robust feature extraction and effective classifier design. However, the dual-channel stereo information in the audio signal also includes important cues for deepfake, which has not been studied in the prior work. In this paper, we propose a novel ADD model, termed as M2S-ADD, that attempts to discover audio authenticity cues during the mono-to-stereo conversion process. We first projects the mono to a stereo signal using a pretrained stereo synthesizer, then employs a dual-branch neural architecture to process the left and right channel signals, respectively. In this way, we effectively reveal the artifacts in the fake audio, thus improve the ADD performance. The experiments on the ASVspoof2019 database show that M2S-ADD outperforms all baselines that input mono. We",
    "path": "papers/23/05/2305.16353.json",
    "total_tokens": 944,
    "translated_title": "自我背叛：利用单声道转立体声技术进行深度伪造音频的检测",
    "translated_abstract": "音频深度伪造检测(Audio Deepfake Detection, ADD)旨在检测由文本转语音(TTS)、语音转换(VC)、重放等生成的虚假音频，是一个新兴的研究领域。传统的研究方法将单声道信号作为输入，重点在于稳健的特征提取和有效的分类器设计。然而，音频信号中的双通道立体声信息也包含了深度伪造的重要线索，这在先前的工作中尚未得到研究。本文提出了一种新颖的ADD模型，称为M2S-ADD，旨在在单声道转立体声过程中发现音频真实性线索。我们首先使用预训练的立体声合成器将单声道投影到立体声信号上，然后采用双分支神经架构分别处理左右声道信号。这样，我们有效地揭示了伪造音频中的伪影，从而提高了ADD的性能。在ASVspoof2019数据库上的实验结果表明，M2S-ADD在所有输入单声道的基线模型中表现最佳。",
    "tldr": "本文提出了一种名为M2S-ADD的新型ADD模型，通过单声道转立体声技术发现伪造音频中的真实性线索，显著提高了检测性能。",
    "en_tdlr": "This paper proposes a novel ADD model called M2S-ADD, which uses the mono-to-stereo conversion technique to uncover audio authenticity cues in fake audio and significantly improves detection performance."
}