{
    "title": "Simulation of a Variational Quantum Perceptron using Grover's Algorithm. (arXiv:2305.11040v1 [quant-ph])",
    "abstract": "The quantum perceptron, the variational circuit, and the Grover algorithm have been proposed as promising components for quantum machine learning. This paper presents a new quantum perceptron that combines the quantum variational circuit and the Grover algorithm. However, this does not guarantee that this quantum variational perceptron with Grover's algorithm (QVPG) will have any advantage over its quantum variational (QVP) and classical counterparts. Here, we examine the performance of QVP and QVP-G by computing their loss function and analyzing their accuracy on the classification task, then comparing these two quantum models to the classical perceptron (CP). The results show that our two quantum models are more efficient than CP, and our novel suggested model QVP-G outperforms the QVP, demonstrating that the Grover can be applied to the classification task and even makes the model more accurate, besides the unstructured search problems.",
    "link": "http://arxiv.org/abs/2305.11040",
    "context": "Title: Simulation of a Variational Quantum Perceptron using Grover's Algorithm. (arXiv:2305.11040v1 [quant-ph])\nAbstract: The quantum perceptron, the variational circuit, and the Grover algorithm have been proposed as promising components for quantum machine learning. This paper presents a new quantum perceptron that combines the quantum variational circuit and the Grover algorithm. However, this does not guarantee that this quantum variational perceptron with Grover's algorithm (QVPG) will have any advantage over its quantum variational (QVP) and classical counterparts. Here, we examine the performance of QVP and QVP-G by computing their loss function and analyzing their accuracy on the classification task, then comparing these two quantum models to the classical perceptron (CP). The results show that our two quantum models are more efficient than CP, and our novel suggested model QVP-G outperforms the QVP, demonstrating that the Grover can be applied to the classification task and even makes the model more accurate, besides the unstructured search problems.",
    "path": "papers/23/05/2305.11040.json",
    "total_tokens": 834,
    "translated_title": "使用Grover算法模拟变分量子感知器",
    "translated_abstract": "量子感知器、变分电路和Grover算法被认为是量子机器学习的有前途的组件。该论文介绍了一种结合了量子变分电路和Grover算法的新型量子感知器。通过计算它们的损失函数以及分析它们在分类任务上的准确性，并将这两个量子模型与经典感知器进行比较，我们研究了QVP和QVP-G的性能。结果表明，我们的两个量子模型比CP更有效率，我们的新型建议模型QVP-G胜过QVP，证明了Grover算法可以应用在分类任务上，而且还可以提高模型的准确性，除了非结构化搜索问题。",
    "tldr": "本研究结合了量子变分电路和Grover算法，成功构建了新型的量子感知器QVP-G。对比经典感知器，我们证明了QVP-G在分类任务中比QVP更加准确并且更加高效。"
}