{
    "title": "DetGPT: Detect What You Need via Reasoning. (arXiv:2305.14167v2 [cs.CV] UPDATED)",
    "abstract": "In recent years, the field of computer vision has seen significant advancements thanks to the development of large language models (LLMs). These models have enabled more effective and sophisticated interactions between humans and machines, paving the way for novel techniques that blur the lines between human and machine intelligence. In this paper, we introduce a new paradigm for object detection that we call reasoning-based object detection. Unlike conventional object detection methods that rely on specific object names, our approach enables users to interact with the system using natural language instructions, allowing for a higher level of interactivity. Our proposed method, called DetGPT, leverages state-of-the-art multi-modal models and open-vocabulary object detectors to perform reasoning within the context of the user's instructions and the visual scene. This enables DetGPT to automatically locate the object of interest based on the user's expressed desires, even if the object i",
    "link": "http://arxiv.org/abs/2305.14167",
    "context": "Title: DetGPT: Detect What You Need via Reasoning. (arXiv:2305.14167v2 [cs.CV] UPDATED)\nAbstract: In recent years, the field of computer vision has seen significant advancements thanks to the development of large language models (LLMs). These models have enabled more effective and sophisticated interactions between humans and machines, paving the way for novel techniques that blur the lines between human and machine intelligence. In this paper, we introduce a new paradigm for object detection that we call reasoning-based object detection. Unlike conventional object detection methods that rely on specific object names, our approach enables users to interact with the system using natural language instructions, allowing for a higher level of interactivity. Our proposed method, called DetGPT, leverages state-of-the-art multi-modal models and open-vocabulary object detectors to perform reasoning within the context of the user's instructions and the visual scene. This enables DetGPT to automatically locate the object of interest based on the user's expressed desires, even if the object i",
    "path": "papers/23/05/2305.14167.json",
    "total_tokens": 821,
    "translated_title": "DetGPT：通过推理找到你想要的",
    "translated_abstract": "最近几年，计算机视觉领域因为大型语言模型（LLMs）的发展而取得了重大进展。这些模型使得人机交互更加有效和复杂，为模糊人类和机器智能之间的界线打开了创新技术的大门。本文介绍了一种新的物体检测范 paradigm，称为基于推理的物体检测。与传统的物体检测方法依赖于特定的物体名称不同，我们的方法使用户能够使用自然语言指令与系统交互，实现更高层次的互动。我们提出的方法称为 DetGPT，利用先进的多模型和开放词汇的物体检测器，在用户指令和视觉场景的上下文中执行推理。这使 DetGPT 能够自动定位感兴趣的对象，即使对象在指令中没有明确命名。",
    "tldr": "DetGPT 是一种基于推理的物体检测范例，能够根据用户的自然语言指令和视觉场景进行推理，从而寻找到用户想要的目标物体。",
    "en_tdlr": "DetGPT is a reasoning-based object detection paradigm that performs reasoning based on natural language instructions from users and visual scenes to automatically locate the object of interest."
}