{
    "title": "Context-Aware Semantic Similarity Measurement for Unsupervised Word Sense Disambiguation. (arXiv:2305.03520v1 [cs.CL])",
    "abstract": "The issue of word sense ambiguity poses a significant challenge in natural language processing due to the scarcity of annotated data to feed machine learning models to face the challenge. Therefore, unsupervised word sense disambiguation methods have been developed to overcome that challenge without relying on annotated data. This research proposes a new context-aware approach to unsupervised word sense disambiguation, which provides a flexible mechanism for incorporating contextual information into the similarity measurement process. We experiment with a popular benchmark dataset to evaluate the proposed strategy and compare its performance with state-of-the-art unsupervised word sense disambiguation techniques. The experimental results indicate that our approach substantially enhances disambiguation accuracy and surpasses the performance of several existing techniques. Our findings underscore the significance of integrating contextual information in semantic similarity measurements t",
    "link": "http://arxiv.org/abs/2305.03520",
    "context": "Title: Context-Aware Semantic Similarity Measurement for Unsupervised Word Sense Disambiguation. (arXiv:2305.03520v1 [cs.CL])\nAbstract: The issue of word sense ambiguity poses a significant challenge in natural language processing due to the scarcity of annotated data to feed machine learning models to face the challenge. Therefore, unsupervised word sense disambiguation methods have been developed to overcome that challenge without relying on annotated data. This research proposes a new context-aware approach to unsupervised word sense disambiguation, which provides a flexible mechanism for incorporating contextual information into the similarity measurement process. We experiment with a popular benchmark dataset to evaluate the proposed strategy and compare its performance with state-of-the-art unsupervised word sense disambiguation techniques. The experimental results indicate that our approach substantially enhances disambiguation accuracy and surpasses the performance of several existing techniques. Our findings underscore the significance of integrating contextual information in semantic similarity measurements t",
    "path": "papers/23/05/2305.03520.json",
    "total_tokens": 867,
    "translated_abstract": "由于标注数据的稀缺性，词义的歧义性在自然语言处理中提出了一个重要的挑战。因此，无监督词义消歧方法已经被开发出来，以在没有依赖标注数据的情况下克服这一挑战。本研究提出了一种新的上下文感知方法来进行无监督词义消歧，它提供了一种灵活的机制将上下文信息融入相似度测量过程中。我们使用了一个流行的基准数据集来评估所提出的策略，并将其性能与当前最先进的无监督词义消歧技术进行了比较。实验结果表明，我们的方法显著提高了消歧精度，超过了若干现有技术的表现。我们的发现强调了在语义相似度测量中融合上下文信息的重要性。",
    "tldr": "本研究提出了一种新的上下文感知方法来进行无监督词义消歧，这种方法在语义相似度测量中融合上下文信息，显著提高了消歧精度，超过了若干现有技术的表现。"
}