{
    "title": "Transfer Estimates for Causal Effects across Heterogeneous Sites. (arXiv:2305.01435v1 [econ.EM])",
    "abstract": "We consider the problem of extrapolating treatment effects across heterogeneous populations (``sites\"/``contexts\"). We consider an idealized scenario in which the researcher observes cross-sectional data for a large number of units across several ``experimental\" sites in which an intervention has already been implemented to a new ``target\" site for which a baseline survey of unit-specific, pre-treatment outcomes and relevant attributes is available. We propose a transfer estimator that exploits cross-sectional variation between individuals and sites to predict treatment outcomes using baseline outcome data for the target location. We consider the problem of obtaining a predictor of conditional average treatment effects at the target site that is MSE optimal within a certain class and subject to data constraints. Our approach is design-based in the sense that the performance of the predictor is evaluated given the specific, finite selection of experimental and target sites. Our approach",
    "link": "http://arxiv.org/abs/2305.01435",
    "context": "Title: Transfer Estimates for Causal Effects across Heterogeneous Sites. (arXiv:2305.01435v1 [econ.EM])\nAbstract: We consider the problem of extrapolating treatment effects across heterogeneous populations (``sites\"/``contexts\"). We consider an idealized scenario in which the researcher observes cross-sectional data for a large number of units across several ``experimental\" sites in which an intervention has already been implemented to a new ``target\" site for which a baseline survey of unit-specific, pre-treatment outcomes and relevant attributes is available. We propose a transfer estimator that exploits cross-sectional variation between individuals and sites to predict treatment outcomes using baseline outcome data for the target location. We consider the problem of obtaining a predictor of conditional average treatment effects at the target site that is MSE optimal within a certain class and subject to data constraints. Our approach is design-based in the sense that the performance of the predictor is evaluated given the specific, finite selection of experimental and target sites. Our approach",
    "path": "papers/23/05/2305.01435.json",
    "total_tokens": 814,
    "tldr": "本文提出了一种基于设计的转移估计器，利用交叉变异和基线结果数据，预测目标位置的治疗效果，解决了在跨异质种群转移治疗效应的问题。",
    "en_tdlr": "This paper proposes a design-based transfer estimator utilizing cross-sectional variation and baseline outcome data to predict treatment effects at a new target site, addressing the problem of extrapolating treatment effects across heterogeneous populations."
}