{
    "title": "Explainable Multi-Agent Reinforcement Learning for Temporal Queries. (arXiv:2305.10378v1 [cs.AI])",
    "abstract": "As multi-agent reinforcement learning (MARL) systems are increasingly deployed throughout society, it is imperative yet challenging for users to understand the emergent behaviors of MARL agents in complex environments. This work presents an approach for generating policy-level contrastive explanations for MARL to answer a temporal user query, which specifies a sequence of tasks completed by agents with possible cooperation. The proposed approach encodes the temporal query as a PCTL logic formula and checks if the query is feasible under a given MARL policy via probabilistic model checking. Such explanations can help reconcile discrepancies between the actual and anticipated multi-agent behaviors. The proposed approach also generates correct and complete explanations to pinpoint reasons that make a user query infeasible. We have successfully applied the proposed approach to four benchmark MARL domains (up to 9 agents in one domain). Moreover, the results of a user study show that the ge",
    "link": "http://arxiv.org/abs/2305.10378",
    "context": "Title: Explainable Multi-Agent Reinforcement Learning for Temporal Queries. (arXiv:2305.10378v1 [cs.AI])\nAbstract: As multi-agent reinforcement learning (MARL) systems are increasingly deployed throughout society, it is imperative yet challenging for users to understand the emergent behaviors of MARL agents in complex environments. This work presents an approach for generating policy-level contrastive explanations for MARL to answer a temporal user query, which specifies a sequence of tasks completed by agents with possible cooperation. The proposed approach encodes the temporal query as a PCTL logic formula and checks if the query is feasible under a given MARL policy via probabilistic model checking. Such explanations can help reconcile discrepancies between the actual and anticipated multi-agent behaviors. The proposed approach also generates correct and complete explanations to pinpoint reasons that make a user query infeasible. We have successfully applied the proposed approach to four benchmark MARL domains (up to 9 agents in one domain). Moreover, the results of a user study show that the ge",
    "path": "papers/23/05/2305.10378.json",
    "total_tokens": 912,
    "translated_title": "可解释的多智能体强化学习用于时间查询",
    "translated_abstract": "随着多智能体强化学习系统在社会中的广泛应用，用户理解复杂环境中多智能体行为的发展变得至关重要而具有挑战性。本研究提出了一种方法，生成多智能体强化学习策略级对比说明，以回答用户提出的时间查询，该查询指定了智能体完成任务的一系列任务，并可能进行合作。所提出的方法将时间查询编码为PCTL逻辑公式，并通过概率模型检查检查给定的MARL策略下是否可行。这种解释有助于协调实际和预期的多智能体行为之间的差异。所提出的方法还生成正确和完整的解释，以确定使用户查询不可行的原因。已成功将所提出的方法应用于四个基准MARL领域（一个领域最多有9个智能体）。此外，用户研究的结果显示，所提供的解释对于用户理解复杂的MARL行为模型非常有用。",
    "tldr": "本文提出了一种可解释的多智能体强化学习方法，用于回答关于智能体行为发展的时间查询，该方法可以生成策略级对比解释，以解释智能体的实际和预期行为之间的差异。",
    "en_tdlr": "This paper proposes an explainable multi-agent reinforcement learning approach for answering temporal user queries, which generates policy-level contrastive explanations to reconcile discrepancies between actual and anticipated multi-agent behaviors, and is able to pinpoint reasons that make a user query infeasible. The proposed approach has been successfully applied in four benchmark MARL domains."
}