{
    "title": "Run Like a Girl! Sports-Related Gender Bias in Language and Vision. (arXiv:2305.14468v1 [cs.CV])",
    "abstract": "Gender bias in Language and Vision datasets and models has the potential to perpetuate harmful stereotypes and discrimination. We analyze gender bias in two Language and Vision datasets. Consistent with prior work, we find that both datasets underrepresent women, which promotes their invisibilization. Moreover, we hypothesize and find that a bias affects human naming choices for people playing sports: speakers produce names indicating the sport (e.g. 'tennis player' or 'surfer') more often when it is a man or a boy participating in the sport than when it is a woman or a girl, with an average of 46% vs. 35% of sports-related names for each gender. A computational model trained on these naming data reproduces the bias. We argue that both the data and the model result in representational harm against women.",
    "link": "http://arxiv.org/abs/2305.14468",
    "context": "Title: Run Like a Girl! Sports-Related Gender Bias in Language and Vision. (arXiv:2305.14468v1 [cs.CV])\nAbstract: Gender bias in Language and Vision datasets and models has the potential to perpetuate harmful stereotypes and discrimination. We analyze gender bias in two Language and Vision datasets. Consistent with prior work, we find that both datasets underrepresent women, which promotes their invisibilization. Moreover, we hypothesize and find that a bias affects human naming choices for people playing sports: speakers produce names indicating the sport (e.g. 'tennis player' or 'surfer') more often when it is a man or a boy participating in the sport than when it is a woman or a girl, with an average of 46% vs. 35% of sports-related names for each gender. A computational model trained on these naming data reproduces the bias. We argue that both the data and the model result in representational harm against women.",
    "path": "papers/23/05/2305.14468.json",
    "total_tokens": 918,
    "translated_title": "像女孩一样奔跑！体育相关的语言和视觉性别偏见",
    "translated_abstract": "在语言和视觉数据集以及模型中存在的性别偏见有可能使有害的刻板印象和歧视得以持续存在。本文分析了两个语言和视觉数据集中的性别偏见。与之前的研究相符，我们发现这两个数据集都存在女性的欠代表问题，这会导致女性不可见化。此外，我们还假设并发现了人们对参与运动的人的命名选择存在一种偏见：当参与运动的是男性或男孩时，说话者更经常使用指示该运动的名字（例如“ 网球选手”或“ 冲浪者”），而当参与运动的是女性或女孩时，平均每个性别的与运动相关的名称仅有 35％ 左右，而男性则约为 46％。一个针对这些命名数据进行训练的计算模型会重现这种偏见。我们认为，数据和模型都会对女性造成表征损害。",
    "tldr": "本文分析了两个语言和视觉数据集中的性别偏见，不仅发现这两个数据集都存在女性的欠代表问题，而且还发现了一种命名偏见：在运动中男性更有可能被命名与他们运动相关的称呼，这种偏见对女性表征造成了损害。",
    "en_tdlr": "This paper analyzes gender bias in two Language and Vision datasets and finds that both datasets underrepresent women, perpetuating their invisibility. Additionally, the study uncovers a naming bias in sports where males are more likely to be named with sport-related titles than females, leading to representational harm against women."
}