{
    "title": "Flow Matching for Scalable Simulation-Based Inference. (arXiv:2305.17161v1 [cs.LG])",
    "abstract": "Neural posterior estimation methods based on discrete normalizing flows have become established tools for simulation-based inference (SBI), but scaling them to high-dimensional problems can be challenging. Building on recent advances in generative modeling, we here present flow matching posterior estimation (FMPE), a technique for SBI using continuous normalizing flows. Like diffusion models, and in contrast to discrete flows, flow matching allows for unconstrained architectures, providing enhanced flexibility for complex data modalities. Flow matching, therefore, enables exact density evaluation, fast training, and seamless scalability to large architectures--making it ideal for SBI. We show that FMPE achieves competitive performance on an established SBI benchmark, and then demonstrate its improved scalability on a challenging scientific problem: for gravitational-wave inference, FMPE outperforms methods based on comparable discrete flows, reducing training time by 30% with substanti",
    "link": "http://arxiv.org/abs/2305.17161",
    "context": "Title: Flow Matching for Scalable Simulation-Based Inference. (arXiv:2305.17161v1 [cs.LG])\nAbstract: Neural posterior estimation methods based on discrete normalizing flows have become established tools for simulation-based inference (SBI), but scaling them to high-dimensional problems can be challenging. Building on recent advances in generative modeling, we here present flow matching posterior estimation (FMPE), a technique for SBI using continuous normalizing flows. Like diffusion models, and in contrast to discrete flows, flow matching allows for unconstrained architectures, providing enhanced flexibility for complex data modalities. Flow matching, therefore, enables exact density evaluation, fast training, and seamless scalability to large architectures--making it ideal for SBI. We show that FMPE achieves competitive performance on an established SBI benchmark, and then demonstrate its improved scalability on a challenging scientific problem: for gravitational-wave inference, FMPE outperforms methods based on comparable discrete flows, reducing training time by 30% with substanti",
    "path": "papers/23/05/2305.17161.json",
    "total_tokens": 918,
    "translated_title": "可扩展模拟推理的流匹配技术",
    "translated_abstract": "基于离散规范化流的神经后验估计方法已成为模拟推理（SBI）的成熟工具，但将其扩展到高维问题可能具有挑战性。建立在最近生成建模方面的进展基础上，我们提出了基于流匹配的后验估计（FMPE），一种使用连续规范化流进行SBI的技术。与离散流不同，像扩散模型一样，流匹配允许无约束的架构，提供了用于复杂数据模态的增强灵活性。因此，流匹配实现了精确的密度评估、快速的训练和无缝的可扩展性，使其成为SBI的理想选择。我们展示了FMPE在SBI基准测试上实现了有竞争力的性能，然后在一个具有挑战性的科学问题上展示了其改进的可扩展性：对于引力波推断，FMPE胜过基于相似离散流的方法，在减少训练时间30%的同时，提供了有说服力的结果。",
    "tldr": "这篇论文提出了一种基于流匹配技术的后验估计方法，用于模拟推理，通过提供灵活性和可扩展性解决高维问题的挑战，并在引力波推断上取得了可比离散流方法更好的结果。"
}