{
    "title": "Measuring Rule-based LTLf Process Specifications: A Probabilistic Data-driven Approach. (arXiv:2305.05418v1 [cs.AI])",
    "abstract": "Declarative process specifications define the behavior of processes by means of rules based on Linear Temporal Logic on Finite Traces (LTLf). In a mining context, these specifications are inferred from, and checked on, multi-sets of runs recorded by information systems (namely, event logs). To this end, being able to gauge the degree to which process data comply with a specification is key. However, existing mining and verification techniques analyze the rules in isolation, thereby disregarding their interplay. In this paper, we introduce a framework to devise probabilistic measures for declarative process specifications. Thereupon, we propose a technique that measures the degree of satisfaction of specifications over event logs. To assess our approach, we conduct an evaluation with real-world data, evidencing its applicability in discovery, checking, and drift detection contexts.",
    "link": "http://arxiv.org/abs/2305.05418",
    "context": "Title: Measuring Rule-based LTLf Process Specifications: A Probabilistic Data-driven Approach. (arXiv:2305.05418v1 [cs.AI])\nAbstract: Declarative process specifications define the behavior of processes by means of rules based on Linear Temporal Logic on Finite Traces (LTLf). In a mining context, these specifications are inferred from, and checked on, multi-sets of runs recorded by information systems (namely, event logs). To this end, being able to gauge the degree to which process data comply with a specification is key. However, existing mining and verification techniques analyze the rules in isolation, thereby disregarding their interplay. In this paper, we introduce a framework to devise probabilistic measures for declarative process specifications. Thereupon, we propose a technique that measures the degree of satisfaction of specifications over event logs. To assess our approach, we conduct an evaluation with real-world data, evidencing its applicability in discovery, checking, and drift detection contexts.",
    "path": "papers/23/05/2305.05418.json",
    "total_tokens": 823,
    "translated_title": "基于规则的LTLf流程规范测量：一种概率数据驱动方法",
    "translated_abstract": "声明性流程规范通过基于有限轨迹的线性时态逻辑（LTLf）规则来定义流程行为。在挖掘上下文中，这些规范是从信息系统（即事件日志）记录的运行的多重集中推断出并进行检查的。为此，能够衡量流程数据符合规范的程度至关重要。然而，现有的挖掘和验证技术仅分析规则本身，忽略了它们之间的相互作用。本文介绍了一个框架来设计声明性过程规范的概率度量方式。进而，我们提出了一种测量事件日志上规范满足度的技术。为了评估我们的方法，我们使用真实世界的数据进行了评估，证明了它在发现、检查和漂移检测方面的适用性。",
    "tldr": "本文介绍了一种基于概率的数据驱动方法，该方法可以度量声明性过程规范的满足度，并可用于发现、检查和漂移检测等方面。",
    "en_tdlr": "This paper proposes a probabilistic data-driven approach to measure the satisfaction degree of declarative process specifications, and validates its applicability in discovery, checking, and drift detection contexts through an evaluation with real-world data."
}