{
    "title": "Implications of Deep Circuits in Improving Quality of Quantum Question Answering. (arXiv:2305.07374v1 [cs.CL])",
    "abstract": "Question Answering (QA) has proved to be an arduous challenge in the area of natural language processing (NLP) and artificial intelligence (AI). Many attempts have been made to develop complete solutions for QA as well as improving significant sub-modules of the QA systems to improve the overall performance through the course of time. Questions are the most important piece of QA, because knowing the question is equivalent to knowing what counts as an answer (Harrah in Philos Sci, 1961 [1]). In this work, we have attempted to understand questions in a better way by using Quantum Machine Learning (QML). The properties of Quantum Computing (QC) have enabled classically intractable data processing. So, in this paper, we have performed question classification on questions from two classes of SelQA (Selection-based Question Answering) dataset using quantum-based classifier algorithms-quantum support vector machine (QSVM) and variational quantum classifier (VQC) from Qiskit (Quantum Informati",
    "link": "http://arxiv.org/abs/2305.07374",
    "context": "Title: Implications of Deep Circuits in Improving Quality of Quantum Question Answering. (arXiv:2305.07374v1 [cs.CL])\nAbstract: Question Answering (QA) has proved to be an arduous challenge in the area of natural language processing (NLP) and artificial intelligence (AI). Many attempts have been made to develop complete solutions for QA as well as improving significant sub-modules of the QA systems to improve the overall performance through the course of time. Questions are the most important piece of QA, because knowing the question is equivalent to knowing what counts as an answer (Harrah in Philos Sci, 1961 [1]). In this work, we have attempted to understand questions in a better way by using Quantum Machine Learning (QML). The properties of Quantum Computing (QC) have enabled classically intractable data processing. So, in this paper, we have performed question classification on questions from two classes of SelQA (Selection-based Question Answering) dataset using quantum-based classifier algorithms-quantum support vector machine (QSVM) and variational quantum classifier (VQC) from Qiskit (Quantum Informati",
    "path": "papers/23/05/2305.07374.json",
    "total_tokens": 769,
    "translated_title": "借助深度电路提高量子问答系统的质量的实证研究",
    "translated_abstract": "问答系统在自然语言处理和人工智能领域中一直是一个艰巨的挑战。本文尝试通过使用量子机器学习，利用量子计算的特性，采用基于量子的分类器算法（QSVM和VQC）对SelQA数据集的两个类别的问题进行分类，并展示了深度电路和量子机器学习相结合可以提高问题分类性能，从而提高问答系统整体质量。",
    "tldr": "本文采用量子机器学习优化了问答系统中的问题分类，通过结合深度电路和量子机器学习，取得了更好的分类性能和问答系统整体质量的提高。",
    "en_tdlr": "This paper uses quantum machine learning to optimize question classification in QA systems, achieving better classification performance and improved overall quality of QA systems by combining deep circuits with quantum machine learning."
}