{
    "title": "Efficient Cross-Lingual Transfer for Chinese Stable Diffusion with Images as Pivots. (arXiv:2305.11540v1 [cs.CV])",
    "abstract": "Diffusion models have made impressive progress in text-to-image synthesis. However, training such large-scale models (e.g. Stable Diffusion), from scratch requires high computational costs and massive high-quality text-image pairs, which becomes unaffordable in other languages. To handle this challenge, we propose IAP, a simple but effective method to transfer English Stable Diffusion into Chinese. IAP optimizes only a separate Chinese text encoder with all other parameters fixed to align Chinese semantics space to the English one in CLIP. To achieve this, we innovatively treat images as pivots and minimize the distance of attentive features produced from cross-attention between images and each language respectively. In this way, IAP establishes connections of Chinese, English and visual semantics in CLIP's embedding space efficiently, advancing the quality of the generated image with direct Chinese prompts. Experimental results show that our method outperforms several strong Chinese d",
    "link": "http://arxiv.org/abs/2305.11540",
    "context": "Title: Efficient Cross-Lingual Transfer for Chinese Stable Diffusion with Images as Pivots. (arXiv:2305.11540v1 [cs.CV])\nAbstract: Diffusion models have made impressive progress in text-to-image synthesis. However, training such large-scale models (e.g. Stable Diffusion), from scratch requires high computational costs and massive high-quality text-image pairs, which becomes unaffordable in other languages. To handle this challenge, we propose IAP, a simple but effective method to transfer English Stable Diffusion into Chinese. IAP optimizes only a separate Chinese text encoder with all other parameters fixed to align Chinese semantics space to the English one in CLIP. To achieve this, we innovatively treat images as pivots and minimize the distance of attentive features produced from cross-attention between images and each language respectively. In this way, IAP establishes connections of Chinese, English and visual semantics in CLIP's embedding space efficiently, advancing the quality of the generated image with direct Chinese prompts. Experimental results show that our method outperforms several strong Chinese d",
    "path": "papers/23/05/2305.11540.json",
    "total_tokens": 986,
    "translated_title": "以图像为枢纽的中文稳定扩散的高效跨语言转移",
    "translated_abstract": "扩散模型在文本到图像合成方面取得了惊人的进展。然而，从头开始训练这样的大规模模型（例如稳定扩散）需要高昂的计算成本和海量高质量的文本-图像配对，在其他语言中则无法承受。为了解决这个挑战，我们提出了IAP，一种将英文稳定扩散转移到中文的简单而有效的方法。IAP 仅优化一个单独的中文文本编码器，所有其他参数都保持不变，以将中文语义空间与 CLIP 中的英文语义空间对齐。为了实现这一点，我们创新性地将图像视为枢纽，并最小化通过图像和每种语言之间的交叉注意力产生的注意特征的距离。通过这种方式，IAP 在 CLIP 的嵌入空间中高效地建立了中文、英语和视觉语义的连接，从而提高了使用直接中文提示生成的图像的质量。实验结果表明，我们的方法在生成高质量的中文图片方面优于几种强大的中文模型。",
    "tldr": "本研究提出了一种经过优化的跨语言转换方法IAP，该方法使用图像作为枢纽，在中英文之间建立语义连接，将英文稳定扩散模型转化为中文。实验证明，该方法比多种强大的中文模型在生成高质量的图片方面表现更优秀。",
    "en_tdlr": "This paper proposes an optimized cross-lingual conversion method IAP, which uses images as pivots to establish semantic connections between Chinese and English, and converts English Stable Diffusion model into Chinese. The experimental results show that this method performs better than several strong Chinese models in generating high-quality images."
}