{
    "title": "Constructing Dreams using Generative AI. (arXiv:2305.12013v1 [cs.HC])",
    "abstract": "Generative AI tools introduce new and accessible forms of media creation for youth. They also raise ethical concerns about the generation of fake media, data protection, privacy and ownership of AI-generated art. Since generative AI is already being used in products used by youth, it is critical that they understand how these tools work and how they can be used or misused. In this work, we facilitated students' generative AI learning through expression of their imagined future identities. We designed a learning workshop - Dreaming with AI - where students learned about the inner workings of generative AI tools, used text-to-image generation algorithms to create their imaged future dreams, reflected on the potential benefits and harms of generative AI tools and voiced their opinions about policies for the use of these tools in classrooms. In this paper, we present the learning activities and experiences of 34 high school students who engaged in our workshops. Students reached creative l",
    "link": "http://arxiv.org/abs/2305.12013",
    "context": "Title: Constructing Dreams using Generative AI. (arXiv:2305.12013v1 [cs.HC])\nAbstract: Generative AI tools introduce new and accessible forms of media creation for youth. They also raise ethical concerns about the generation of fake media, data protection, privacy and ownership of AI-generated art. Since generative AI is already being used in products used by youth, it is critical that they understand how these tools work and how they can be used or misused. In this work, we facilitated students' generative AI learning through expression of their imagined future identities. We designed a learning workshop - Dreaming with AI - where students learned about the inner workings of generative AI tools, used text-to-image generation algorithms to create their imaged future dreams, reflected on the potential benefits and harms of generative AI tools and voiced their opinions about policies for the use of these tools in classrooms. In this paper, we present the learning activities and experiences of 34 high school students who engaged in our workshops. Students reached creative l",
    "path": "papers/23/05/2305.12013.json",
    "total_tokens": 886,
    "translated_title": "用生成式AI构建梦想",
    "translated_abstract": "生成式AI工具为青少年引入了新的、易于接触的媒体创作形式。它们也引发了有关虚假媒体生成、数据保护、隐私和AI生成艺术所有权等方面的伦理问题。鉴于生成式AI已经被应用于青少年使用的产品中，使他们理解这些工具的工作原理及其使用和误用方法具有重要性。在本研究中，我们通过表达他们想象中的未来身份来促进学生生成式AI学习。我们设计了一个学习车间，“与AI一同做梦”，学生们了解了生成式AI工具的内部工作原理，使用文本转图像生成算法创建了他们的形象未来梦想，并反思了生成式AI工具的潜在利益和伤害，并就课堂中使用这些工具的政策发表了意见。本文介绍了34名高中学生参加我们工作坊的学习活动和体验。学生们达到了创意性的高度，并反思了AI工具的利弊。",
    "tldr": "本文介绍了一个“与AI一同做梦”的学习车间，让高中生了解和使用了生成式AI工具，并反思了潜在利益和伤害，提出了政策意见。",
    "en_tdlr": "This paper presents a learning workshop, \"Dreaming with AI\", in which high school students learned about and used generative AI tools, reflected on potential benefits and harms, and shared their policy opinions."
}