{
    "title": "A Causal Inference Framework for Leveraging External Controls in Hybrid Trials. (arXiv:2305.08969v1 [stat.ME])",
    "abstract": "We consider the challenges associated with causal inference in settings where data from a randomized trial is augmented with control data from an external source to improve efficiency in estimating the average treatment effect (ATE). Through the development of a formal causal inference framework, we outline sufficient causal assumptions about the exchangeability between the internal and external controls to identify the ATE and establish the connection to a novel graphical criteria. We propose estimators, review efficiency bounds, develop an approach for efficient doubly-robust estimation even when unknown nuisance models are estimated with flexible machine learning methods, and demonstrate finite-sample performance through a simulation study. To illustrate the ideas and methods, we apply the framework to a trial investigating the effect of risdisplam on motor function in patients with spinal muscular atrophy for which there exists an external set of control patients from a previous tr",
    "link": "http://arxiv.org/abs/2305.08969",
    "context": "Title: A Causal Inference Framework for Leveraging External Controls in Hybrid Trials. (arXiv:2305.08969v1 [stat.ME])\nAbstract: We consider the challenges associated with causal inference in settings where data from a randomized trial is augmented with control data from an external source to improve efficiency in estimating the average treatment effect (ATE). Through the development of a formal causal inference framework, we outline sufficient causal assumptions about the exchangeability between the internal and external controls to identify the ATE and establish the connection to a novel graphical criteria. We propose estimators, review efficiency bounds, develop an approach for efficient doubly-robust estimation even when unknown nuisance models are estimated with flexible machine learning methods, and demonstrate finite-sample performance through a simulation study. To illustrate the ideas and methods, we apply the framework to a trial investigating the effect of risdisplam on motor function in patients with spinal muscular atrophy for which there exists an external set of control patients from a previous tr",
    "path": "papers/23/05/2305.08969.json",
    "total_tokens": 872,
    "translated_abstract": "我们考虑了在增加外部对照数据的情况下改善平均治疗效果（ATE）估计效率的随机试验中因果推断所涉及的挑战。通过开发一个正式的因果推断框架，我们概述了关于内部和外部控制之间可交换性的充分因果假设，以确定ATE并建立与新颖图形标准的联系。我们提出了估计器，回顾了效率界限，开发了一种方法来进行有效的双重稳健估计，即使是在估计灵活的机器学习方法的未知干扰模型时，也能使用此方法，并通过模拟研究展示有限样本性能。为说明思想和方法，我们将该框架应用于研究risdisplam对脊髓肌萎缩患者运动功能影响的试验，其中有来自先前试验的一组外部对照患者。",
    "tldr": "本文提出了一种利用外部对照组提高混合试验中平均治疗效果估计效率的因果推断框架，并开发了可行的方法以达到有效的估计性能。",
    "en_tdlr": "This paper presents a causal inference framework for improving the efficiency of estimating the average treatment effect (ATE) in hybrid trials by using external control data, and develops feasible methods to achieve efficient estimation performance even when using flexible machine learning methods to estimate unknown nuisance models."
}