{
    "title": "Restoring Images Captured in Arbitrary Hybrid Adverse Weather Conditions in One Go. (arXiv:2305.09996v1 [cs.CV])",
    "abstract": "Adverse conditions typically suffer from stochastic hybrid weather degradations (e.g., rainy and hazy night), while existing image restoration algorithms envisage that weather degradations occur independently, thus may fail to handle real-world complicated scenarios. Besides, supervised training is not feasible due to the lack of comprehensive paired dataset to characterize hybrid conditions. To this end, we have advanced the forementioned limitations with two tactics: framework and data. On the one hand, we present a novel unified framework, dubbed RAHC, to Restore Arbitrary Hybrid adverse weather Conditions in one go, which can comfortably cope with hybrid scenarios with insufficient remaining background constituents and restore arbitrary hybrid conditions with a single trained model flexibly. On the other hand, we establish a new dataset, termed HAC, for learning and benchmarking arbitrary Hybrid Adverse Conditions restoration. HAC contains 31 scenarios composed of an arbitrary comb",
    "link": "http://arxiv.org/abs/2305.09996",
    "context": "Title: Restoring Images Captured in Arbitrary Hybrid Adverse Weather Conditions in One Go. (arXiv:2305.09996v1 [cs.CV])\nAbstract: Adverse conditions typically suffer from stochastic hybrid weather degradations (e.g., rainy and hazy night), while existing image restoration algorithms envisage that weather degradations occur independently, thus may fail to handle real-world complicated scenarios. Besides, supervised training is not feasible due to the lack of comprehensive paired dataset to characterize hybrid conditions. To this end, we have advanced the forementioned limitations with two tactics: framework and data. On the one hand, we present a novel unified framework, dubbed RAHC, to Restore Arbitrary Hybrid adverse weather Conditions in one go, which can comfortably cope with hybrid scenarios with insufficient remaining background constituents and restore arbitrary hybrid conditions with a single trained model flexibly. On the other hand, we establish a new dataset, termed HAC, for learning and benchmarking arbitrary Hybrid Adverse Conditions restoration. HAC contains 31 scenarios composed of an arbitrary comb",
    "path": "papers/23/05/2305.09996.json",
    "total_tokens": 918,
    "translated_title": "一次性还原捕获于任意复杂恶劣天气条件下的图像",
    "translated_abstract": "在恶劣天气条件下，图像往往会受到随机混合的天气影响（例如，雨天和雾霾夜晚），而现有的图像恢复算法预计天气影响是相互独立的，因此可能无法处理复杂的现实情况。此外，由于缺乏全面对应的数据集来描述复杂的混合天气状况，监督训练不可行。为此，我们通过两个策略——框架和数据——来弥补上述限制。一方面，我们提出了一种新的统一框架，称为RAHC，可以舒适地处理混合情况，并通过单个训练模型灵活地恢复任意混合条件。另一方面，我们建立了一个新的数据集，称为HAC，用于学习和基准测试任意混合条件的图像恢复。HAC包含31种情景，包括任意组合的雨天、雪天、雾霾、雾天和薄雾天气条件。",
    "tldr": "提出了一种新的框架RAHC，可以一次性处理任意复杂恶劣天气条件下的图像恢复，并建立了一个新的数据集HAC，用于学习和基准测试混合条件的图像恢复。",
    "en_tdlr": "Proposed a new framework called RAHC, which can restore images captured in arbitrary complex adverse weather conditions in one go, and established a new dataset HAC for learning and benchmarking hybrid conditions image restoration."
}