{
    "title": "A Method to Automate the Discharge Summary Hospital Course for Neurology Patients. (arXiv:2305.06416v1 [cs.CL])",
    "abstract": "Generation of automated clinical notes have been posited as a strategy to mitigate physician burnout. In particular, an automated narrative summary of a patient's hospital stay could supplement the hospital course section of the discharge summary that inpatient physicians document in electronic health record (EHR) systems. In the current study, we developed and evaluated an automated method for summarizing the hospital course section using encoder-decoder sequence-to-sequence transformer models. We fine tuned BERT and BART models and optimized for factuality through constraining beam search, which we trained and tested using EHR data from patients admitted to the neurology unit of an academic medical center. The approach demonstrated good ROUGE scores with an R-2 of 13.76. In a blind evaluation, two board-certified physicians rated 62% of the automated summaries as meeting the standard of care, which suggests the method may be useful clinically. To our knowledge, this study is among th",
    "link": "http://arxiv.org/abs/2305.06416",
    "context": "Title: A Method to Automate the Discharge Summary Hospital Course for Neurology Patients. (arXiv:2305.06416v1 [cs.CL])\nAbstract: Generation of automated clinical notes have been posited as a strategy to mitigate physician burnout. In particular, an automated narrative summary of a patient's hospital stay could supplement the hospital course section of the discharge summary that inpatient physicians document in electronic health record (EHR) systems. In the current study, we developed and evaluated an automated method for summarizing the hospital course section using encoder-decoder sequence-to-sequence transformer models. We fine tuned BERT and BART models and optimized for factuality through constraining beam search, which we trained and tested using EHR data from patients admitted to the neurology unit of an academic medical center. The approach demonstrated good ROUGE scores with an R-2 of 13.76. In a blind evaluation, two board-certified physicians rated 62% of the automated summaries as meeting the standard of care, which suggests the method may be useful clinically. To our knowledge, this study is among th",
    "path": "papers/23/05/2305.06416.json",
    "total_tokens": 953,
    "translated_title": "自动化神经科患者出院小结医院过程的方法",
    "translated_abstract": "自动化临床笔记的生成被提出作为缓解医生过劳的策略。具体来说，病人住院期间自动化叙述性摘要可作为住院医生在电子病历系统中记录的出院小结中的医院过程部分的补充。在本研究中，我们开发并评估了一种使用编码器-解码器序列到序列变换模型进行医院过程小结的自动化方法。我们对BERT和BART模型进行了微调并通过限制波束搜索进行了实际性优化，采用了从学术医疗中心神经科病人的电子病历数据进行训练和测试。该方法表现出良好的ROUGE分数和13.76的R-2。在盲评估中，两位董事会认证的医生评价62%的自动化摘要符合标准，这表明该方法可能在临床上有用。据我们所知，这项研究是其中之一。",
    "tldr": "开发了一种使用编码器-解码器序列到序列变换模型进行医院过程小结的自动化方法以缓解医生过劳。该方法在实际性上进行了优化，盲评估表明62%的自动化摘要符合标准，具有临床应用的潜力。",
    "en_tdlr": "An automated method using encoder-decoder sequence-to-sequence transformer models was developed to alleviate physician burnout by generating automated clinical notes. The approach optimized for factuality through constraining beam search and demonstrated good ROUGE scores with an R-2 of 13.76. Blind evaluation showed that 62% of the automated summaries met the standard, suggesting its clinical utility."
}