{
    "title": "NewsPanda: Media Monitoring for Timely Conservation Action. (arXiv:2305.01503v1 [cs.IR])",
    "abstract": "Non-governmental organizations for environmental conservation have a significant interest in monitoring conservation-related media and getting timely updates about infrastructure construction projects as they may cause massive impact to key conservation areas. Such monitoring, however, is difficult and time-consuming. We introduce NewsPanda, a toolkit which automatically detects and analyzes online articles related to environmental conservation and infrastructure construction. We fine-tune a BERT-based model using active learning methods and noise correction algorithms to identify articles that are relevant to conservation and infrastructure construction. For the identified articles, we perform further analysis, extracting keywords and finding potentially related sources. NewsPanda has been successfully deployed by the World Wide Fund for Nature teams in the UK, India, and Nepal since February 2022. It currently monitors over 80,000 websites and 1,074 conservation sites across India an",
    "link": "http://arxiv.org/abs/2305.01503",
    "context": "Title: NewsPanda: Media Monitoring for Timely Conservation Action. (arXiv:2305.01503v1 [cs.IR])\nAbstract: Non-governmental organizations for environmental conservation have a significant interest in monitoring conservation-related media and getting timely updates about infrastructure construction projects as they may cause massive impact to key conservation areas. Such monitoring, however, is difficult and time-consuming. We introduce NewsPanda, a toolkit which automatically detects and analyzes online articles related to environmental conservation and infrastructure construction. We fine-tune a BERT-based model using active learning methods and noise correction algorithms to identify articles that are relevant to conservation and infrastructure construction. For the identified articles, we perform further analysis, extracting keywords and finding potentially related sources. NewsPanda has been successfully deployed by the World Wide Fund for Nature teams in the UK, India, and Nepal since February 2022. It currently monitors over 80,000 websites and 1,074 conservation sites across India an",
    "path": "papers/23/05/2305.01503.json",
    "total_tokens": 937,
    "translated_title": "NewsPanda: 用于及时保护行动的媒体监控工具",
    "translated_abstract": "环保非政府组织对监测相关媒体并及时了解基础建设项目的更新具有重要兴趣，因为这些项目可能会对重要的保护区域产生巨大影响。然而，这种监测很难且需要耗费时间。我们介绍了一个名为NewsPanda的工具包，它可以自动检测和分析与环保和基础建设相关的网上文章。我们使用主动学习方法和噪声校正算法对BERT模型进行微调，以识别与保护和基础建设相关的文章。对已识别出的文章，我们进行进一步的分析，提取关键字并找到可能相关的来源。NewsPanda自2022年2月以来已被世界自然基金会团队在英国、印度和尼泊尔成功部署。它目前监测了印度80,000个网站和1,074个保护地点。",
    "tldr": "NewsPanda是一个可以自动检测和分析与环保和基础建设相关的网上文章的工具。该工具使用主动学习方法和噪声校正算法对BERT模型进行微调以识别相关文章，并提取关键字和找到相关来源。已被世界自然基金会团队在英国、印度和尼泊尔成功部署。",
    "en_tdlr": "NewsPanda is an automated tool for detecting and analyzing online articles related to environmental conservation and infrastructure construction. It uses active learning methods and noise correction algorithms to fine-tune a BERT-based model for identifying relevant articles, and performs further analysis by extracting keywords and finding potentially related sources. It has been successfully deployed by the World Wide Fund for Nature teams in the UK, India, and Nepal since February 2022, monitoring over 80,000 websites and 1,074 conservation sites across India."
}