{
    "title": "Short-term Temporal Dependency Detection under Heterogeneous Event Dynamic with Hawkes Processes. (arXiv:2305.18412v1 [stat.AP])",
    "abstract": "Many event sequence data exhibit mutually exciting or inhibiting patterns. Reliable detection of such temporal dependency is crucial for scientific investigation. The de facto model is the Multivariate Hawkes Process (MHP), whose impact function naturally encodes a causal structure in Granger causality. However, the vast majority of existing methods use direct or nonlinear transform of standard MHP intensity with constant baseline, inconsistent with real-world data. Under irregular and unknown heterogeneous intensity, capturing temporal dependency is hard as one struggles to distinguish the effect of mutual interaction from that of intensity fluctuation. In this paper, we address the short-term temporal dependency detection issue. We show the maximum likelihood estimation (MLE) for cross-impact from MHP has an error that can not be eliminated but may be reduced by order of magnitude, using heterogeneous intensity not of the target HP but of the interacting HP. Then we proposed a robust",
    "link": "http://arxiv.org/abs/2305.18412",
    "context": "Title: Short-term Temporal Dependency Detection under Heterogeneous Event Dynamic with Hawkes Processes. (arXiv:2305.18412v1 [stat.AP])\nAbstract: Many event sequence data exhibit mutually exciting or inhibiting patterns. Reliable detection of such temporal dependency is crucial for scientific investigation. The de facto model is the Multivariate Hawkes Process (MHP), whose impact function naturally encodes a causal structure in Granger causality. However, the vast majority of existing methods use direct or nonlinear transform of standard MHP intensity with constant baseline, inconsistent with real-world data. Under irregular and unknown heterogeneous intensity, capturing temporal dependency is hard as one struggles to distinguish the effect of mutual interaction from that of intensity fluctuation. In this paper, we address the short-term temporal dependency detection issue. We show the maximum likelihood estimation (MLE) for cross-impact from MHP has an error that can not be eliminated but may be reduced by order of magnitude, using heterogeneous intensity not of the target HP but of the interacting HP. Then we proposed a robust",
    "path": "papers/23/05/2305.18412.json",
    "total_tokens": 1003,
    "translated_title": "Hawkes过程下异质事件动态的短时序依赖检测",
    "translated_abstract": "许多事件序列数据表现出相互激励或抑制的模式。可靠地检测这种时间依赖性对科学研究至关重要。现有模型中最常用的是多元Hawkes过程(MHP)，其影响函数自然地编码了Granger因果结构。然而，绝大多数现有方法使用标准MHP强度的直接或非线性变换，与真实数据不一致。在不规则和未知的异质强度下，捕捉时序依赖性很困难，因为人们难以区分相互作用的影响和强度波动的影响。本文针对短时序依赖性检测问题进行了讨论。我们展示了来自MHP的交叉影响的最大似然估计(MLE)存在无法消除但可以通过数量级减少的误差，使用的是互动HP的异质强度而不是目标HP的异质强度。然后，我们提出了一种结合MHP和自激神经网络用于短时序依赖检测的鲁棒框架。基于合成和真实世界数据的实证实验表明了所提出方法的卓越性能。",
    "tldr": "本论文讨论了Hawkes过程下异质事件动态的短时序依赖检测问题，提出了一种结合MHP和自激神经网络的鲁棒框架，实验结果显示其卓越性能。",
    "en_tdlr": "This paper discusses the issue of short-term temporal dependency detection under heterogeneous event dynamics with Hawkes processes. It proposes a robust framework that combines MHP and self-exciting neural network, demonstrating its superior performance through empirical experiments on synthetic and real-world datasets."
}