{
    "title": "Terraforming -- Environment Manipulation during Disruptions for Multi-Agent Pickup and Delivery. (arXiv:2305.11510v1 [cs.AI])",
    "abstract": "In automated warehouses, teams of mobile robots fulfill the packaging process by transferring inventory pods to designated workstations while navigating narrow aisles formed by tightly packed pods. This problem is typically modeled as a Multi-Agent Pickup and Delivery (MAPD) problem, which is then solved by repeatedly planning collision-free paths for agents on a fixed graph, as in the Rolling-Horizon Collision Resolution (RHCR) algorithm. However, existing approaches make the limiting assumption that agents are only allowed to move pods that correspond to their current task, while considering the other pods as stationary obstacles (even though all pods are movable). This behavior can result in unnecessarily long paths which could otherwise be avoided by opening additional corridors via pod manipulation. To this end, we explore the implications of allowing agents the flexibility of dynamically relocating pods. We call this new problem Terraforming MAPD (tMAPD) and develop an RHCR-based",
    "link": "http://arxiv.org/abs/2305.11510",
    "context": "Title: Terraforming -- Environment Manipulation during Disruptions for Multi-Agent Pickup and Delivery. (arXiv:2305.11510v1 [cs.AI])\nAbstract: In automated warehouses, teams of mobile robots fulfill the packaging process by transferring inventory pods to designated workstations while navigating narrow aisles formed by tightly packed pods. This problem is typically modeled as a Multi-Agent Pickup and Delivery (MAPD) problem, which is then solved by repeatedly planning collision-free paths for agents on a fixed graph, as in the Rolling-Horizon Collision Resolution (RHCR) algorithm. However, existing approaches make the limiting assumption that agents are only allowed to move pods that correspond to their current task, while considering the other pods as stationary obstacles (even though all pods are movable). This behavior can result in unnecessarily long paths which could otherwise be avoided by opening additional corridors via pod manipulation. To this end, we explore the implications of allowing agents the flexibility of dynamically relocating pods. We call this new problem Terraforming MAPD (tMAPD) and develop an RHCR-based",
    "path": "papers/23/05/2305.11510.json",
    "total_tokens": 861,
    "translated_title": "Terraforming - 多智能体取送货期间的环境操作",
    "translated_abstract": "在自动化仓库中，由移动机器人组成的团队在在紧密排列的库存货架之间穿行，并将货架传递到指定的工作站以完成包装流程。该问题通常被建模为多智能体取送货（MAPD）问题，然后通过在固定图形上为机器人规划无碰撞路径来解决，例如Rolling-Horizon碰撞解决（RHCR）算法。然而，现有方法作出了一项限制性的假设，即规定机器人只能移动与其当前任务对应的货架，而将其他货架视为静止障碍物（尽管所有货架都是可移动的）。这种行为可能导致不必要的长路径，否则可以通过货架操作打开额外的通道来避免。因此，我们探讨了允许机器人动态重新定位货架的灵活性所带来的影响。我们称之为新的问题Terraforming MAPD（tMAPD），并开发了一个基于RHCR的算法来解决该问题。",
    "tldr": "在自动化仓库的多智能体取送货问题中，运用Terraforming技术灵活地重新定位货架，可以减少路径长度和提高运输效率。",
    "en_tdlr": "The use of Terraforming technology for flexible pod relocation in the Multi-Agent Pickup and Delivery problem of automated warehouses can reduce path length and increase efficiency of transport."
}