{
    "title": "Efficient Computation of General Modules for ALC Ontologies (Extended Version). (arXiv:2305.09503v1 [cs.AI])",
    "abstract": "We present a method for extracting general modules for ontologies formulated in the description logic ALC. A module for an ontology is an ideally substantially smaller ontology that preserves all entailments for a user-specified set of terms. As such, it has applications such as ontology reuse and ontology analysis. Different from classical modules, general modules may use axioms not explicitly present in the input ontology, which allows for additional conciseness. So far, general modules have only been investigated for lightweight description logics. We present the first work that considers the more expressive description logic ALC. In particular, our contribution is a new method based on uniform interpolation supported by some new theoretical results. Our evaluation indicates that our general modules are often smaller than classical modules and uniform interpolants computed by the state-of-the-art, and compared with uniform interpolants, can be computed in a significantly shorter tim",
    "link": "http://arxiv.org/abs/2305.09503",
    "context": "Title: Efficient Computation of General Modules for ALC Ontologies (Extended Version). (arXiv:2305.09503v1 [cs.AI])\nAbstract: We present a method for extracting general modules for ontologies formulated in the description logic ALC. A module for an ontology is an ideally substantially smaller ontology that preserves all entailments for a user-specified set of terms. As such, it has applications such as ontology reuse and ontology analysis. Different from classical modules, general modules may use axioms not explicitly present in the input ontology, which allows for additional conciseness. So far, general modules have only been investigated for lightweight description logics. We present the first work that considers the more expressive description logic ALC. In particular, our contribution is a new method based on uniform interpolation supported by some new theoretical results. Our evaluation indicates that our general modules are often smaller than classical modules and uniform interpolants computed by the state-of-the-art, and compared with uniform interpolants, can be computed in a significantly shorter tim",
    "path": "papers/23/05/2305.09503.json",
    "total_tokens": 878,
    "translated_title": "ALC本体的通用模块的高效计算方法（扩展版）",
    "translated_abstract": "我们提出了一种从描述逻辑ALC中提取本体通用模块的方法。对于用户指定集合的术语，一个模块是一个理论性质上大大简化的本体，它可以保留所有蕴含。因此，它具有本体重用和本体分析等应用。不同于传统模块，通用模块可以使用输入本体中未显式出现的公理，这允许额外的简明性。迄今为止，通用模块仅针对轻量级描述逻辑进行了研究。我们提出了第一个考虑更具表达力的描述逻辑ALC的工作。我们的贡献是一种基于均匀插值的新方法，这种方法由一些新的理论结果支持。我们的评估表明，我们的通用模块通常比经典模块和最先进的均匀插值计算出的均匀插值小，并且与均匀插值相比，可以在显着较短的时间内计算出来。",
    "tldr": "该论文提出了一种从ALC本体中提取通用模块的方法，并且通过评估表明其可以在显着较短的时间内计算出，相比于最先进的方法可以得到更小的结果。"
}