{
    "title": "FedNC: A Secure and Efficient Federated Learning Method Inspired by Network Coding. (arXiv:2305.03292v1 [cs.LG])",
    "abstract": "Federated Learning (FL) is a promising distributed learning mechanism which still faces two major challenges, namely privacy breaches and system efficiency. In this work, we reconceptualize the FL system from the perspective of network information theory, and formulate an original FL communication framework, FedNC, which is inspired by Network Coding (NC). The main idea of FedNC is mixing the information of the local models by making random linear combinations of the original packets, before uploading for further aggregation. Due to the benefits of the coding scheme, both theoretical and experimental analysis indicate that FedNC improves the performance of traditional FL in several important ways, including security, throughput, and robustness. To the best of our knowledge, this is the first framework where NC is introduced in FL. As FL continues to evolve within practical network frameworks, more applications and variants can be further designed based on FedNC.",
    "link": "http://arxiv.org/abs/2305.03292",
    "context": "Title: FedNC: A Secure and Efficient Federated Learning Method Inspired by Network Coding. (arXiv:2305.03292v1 [cs.LG])\nAbstract: Federated Learning (FL) is a promising distributed learning mechanism which still faces two major challenges, namely privacy breaches and system efficiency. In this work, we reconceptualize the FL system from the perspective of network information theory, and formulate an original FL communication framework, FedNC, which is inspired by Network Coding (NC). The main idea of FedNC is mixing the information of the local models by making random linear combinations of the original packets, before uploading for further aggregation. Due to the benefits of the coding scheme, both theoretical and experimental analysis indicate that FedNC improves the performance of traditional FL in several important ways, including security, throughput, and robustness. To the best of our knowledge, this is the first framework where NC is introduced in FL. As FL continues to evolve within practical network frameworks, more applications and variants can be further designed based on FedNC.",
    "path": "papers/23/05/2305.03292.json",
    "total_tokens": 803,
    "translated_title": "FedNC：基于网络编码启发的安全高效联合学习方法",
    "translated_abstract": "联合学习是一种有前途的分布式学习机制，但仍然面临两个主要挑战，即隐私泄漏和系统效率。在本文中，我们从网络信息理论的角度重新构思了联合学习系统，并制定了一个原创的联合学习通信框架FedNC，该框架受到网络编码的启发。 FedNC的主要思想是通过对原始数据包进行随机线性组合，将本地模型的信息混合在一起，然后再上传进行进一步的聚合，从而使FL系统更加安全，吞吐量更高，鲁棒性更好。据我们所知，这是第一个将NC引入FL的框架。随着FL在实际网络框架中的不断演变，可以基于FedNC进一步设计更多的应用和变体。",
    "tldr": "本文提出FedNC，一个联合学习的通信框架，结合了网络编码技术，能够提高系统的隐私、吞吐量和鲁棒性。",
    "en_tdlr": "FedNC is proposed as a communication framework for federated learning, inspired by network coding, which can improve system privacy, throughput, and robustness."
}