{
    "title": "A spectral approach to stock market performance. (arXiv:2305.05762v1 [econ.GN])",
    "abstract": "We pose the estimation and predictability of stock market performance. Three cases are taken: US, Japan, Germany, the monthly index of the value of realized investment in stocks, prices plus the value of dividend payments (OECD data). Once deflated and trend removed, harmonic analysis is applied. The series are taken with and without the periods with evidence of exogenous shocks. The series are erratic and the random walk hypothesis is reasonably falsified. The estimation reveals relevant hidden periodicities, which approximate stock value movements. From July 2008 onwards, it is successfully analyzed whether the subsequent fall in share value would have been predictable. Again, the data are irregular and scattered, but the sum of the first five harmonics in relevance anticipates the fall in stock market values that followed.",
    "link": "http://arxiv.org/abs/2305.05762",
    "context": "Title: A spectral approach to stock market performance. (arXiv:2305.05762v1 [econ.GN])\nAbstract: We pose the estimation and predictability of stock market performance. Three cases are taken: US, Japan, Germany, the monthly index of the value of realized investment in stocks, prices plus the value of dividend payments (OECD data). Once deflated and trend removed, harmonic analysis is applied. The series are taken with and without the periods with evidence of exogenous shocks. The series are erratic and the random walk hypothesis is reasonably falsified. The estimation reveals relevant hidden periodicities, which approximate stock value movements. From July 2008 onwards, it is successfully analyzed whether the subsequent fall in share value would have been predictable. Again, the data are irregular and scattered, but the sum of the first five harmonics in relevance anticipates the fall in stock market values that followed.",
    "path": "papers/23/05/2305.05762.json",
    "total_tokens": 807,
    "translated_title": "一种股票市场表现的频谱方法",
    "translated_abstract": "我们提出了评估和预测股票市场表现的问题。我们以美国、日本、德国为例，考虑了按股票实现投资价值、价格和股息支付的价值的月度指数（OECD数据）。一旦将其除趋势和通货膨胀调整，我们将应用谐波分析。将序列采用存在外生冲击证据和无证据的情况。序列不规则而随机漫步假设合理被证伪。估计揭示了相关的隐藏周期性，近似股票价值的波动。从2008年7月开始，我们成功地分析了随后的股票价格下跌是否可预测。同样，数据不规则而分散，但前五个谐波的和趋势可预测随后的股票市场价值下跌。",
    "tldr": "该研究提出了一种对股票市场表现进行评估和预测的频谱方法，并揭示了相关的隐藏周期性，能够近似股票价值的波动，此方法可以在一定程度上预测股票市场价值的下跌。",
    "en_tdlr": "This study proposes a spectral approach to evaluate and predict stock market performance, revealing relevant hidden periodicities that approximate the movements of stock values, and successfully forecasting the fall in stock market values to some extent."
}