{
    "title": "The Relationship between Consumption and Economic Growth of Chinese Urban and Rural Residents since Reform and Opening-up -- An Empirical Analysis Based on Econometrics Models. (arXiv:2305.02138v1 [econ.GN])",
    "abstract": "Since Reform and Opening-up 40 years ago, China has made remarkable achievements in economic fields. And consumption activities, including household consumption, have played an important role in it. Consumer activity is the end of economic activity, because the ultimate aim of other economic activities is to meet consumer demand; consumer activity is the starting point of economic activity, because consumption can drive economic and social development. This paper selects the economic data of more than 40 years since Reform and Opening-up, and establishes the Vector Autoregressive (VAR) model and Vector Error Correction (VEC) model, analyzing the influence of consumption level and total consumption of urban and rural residents on economic growth. The conclusion is that the increase of urban consumption and rural consumption can lead to the increase of GDP, and in the long run, urban consumption can promote economic growth more than rural consumption. According to this conclusion, we ana",
    "link": "http://arxiv.org/abs/2305.02138",
    "context": "Title: The Relationship between Consumption and Economic Growth of Chinese Urban and Rural Residents since Reform and Opening-up -- An Empirical Analysis Based on Econometrics Models. (arXiv:2305.02138v1 [econ.GN])\nAbstract: Since Reform and Opening-up 40 years ago, China has made remarkable achievements in economic fields. And consumption activities, including household consumption, have played an important role in it. Consumer activity is the end of economic activity, because the ultimate aim of other economic activities is to meet consumer demand; consumer activity is the starting point of economic activity, because consumption can drive economic and social development. This paper selects the economic data of more than 40 years since Reform and Opening-up, and establishes the Vector Autoregressive (VAR) model and Vector Error Correction (VEC) model, analyzing the influence of consumption level and total consumption of urban and rural residents on economic growth. The conclusion is that the increase of urban consumption and rural consumption can lead to the increase of GDP, and in the long run, urban consumption can promote economic growth more than rural consumption. According to this conclusion, we ana",
    "path": "papers/23/05/2305.02138.json",
    "total_tokens": 936,
    "translated_title": "改革开放以来中国城乡居民消费与经济增长的关系——基于计量经济学模型的实证分析",
    "translated_abstract": "改革开放四十年来，中国在经济领域取得了显著的成就，而其中消费活动，包括家庭消费在内，发挥了重要作用。消费活动是经济活动的终点，因为其他经济活动的最终目的是满足消费需求；消费活动是经济活动的起点，因为消费可以推动经济和社会发展。本文选择了改革开放以来40多年的经济数据，建立了向量自回归（VAR）模型和向量误差纠正（VEC）模型，分析了城乡居民消费水平和总消费对经济增长的影响。结论是城市消费和农村消费的增加可以导致GDP的增长，在长期内，城市消费可以比农村消费更能促进经济增长。据此，我们分析了原因并提出了相关政策建议。",
    "tldr": "本文分析改革开放以来中国城乡居民消费与经济增长的关系，得出城市消费和农村消费的增加可以促进经济增长并且城市消费更有利于经济增长的结论，提出相关政策建议。",
    "en_tdlr": "This paper analyzes the relationship between consumption and economic growth of Chinese urban and rural residents since Reform and Opening-up. The conclusion is that the increase of urban and rural consumption can lead to GDP growth, and urban consumption can promote economic growth more than rural consumption in the long run. Relevant policy suggestions are proposed."
}