{
    "title": "Optimizing Forest Fire Prevention: Intelligent Scheduling Algorithms for Drone-Based Surveillance System. (arXiv:2305.10444v1 [cs.RO])",
    "abstract": "Given the importance of forests and their role in maintaining the ecological balance, which directly affects the planet, the climate, and the life on this planet, this research presents the problem of forest fire monitoring using drones. The forest monitoring process is performed continuously to track any changes in the monitored region within the forest. During fires, drones' capture data is used to increase the follow-up speed and enhance the control process of these fires to prevent their spread. The time factor in such problems determines the success rate of the fire extinguishing process, as appropriate data at the right time may be the decisive factor in controlling fires, preventing their spread, extinguishing them, and limiting their losses. Therefore, this research presented the problem of monitoring task scheduling for drones in the forest monitoring system. This problem is solved by developing several algorithms with the aim of minimizing the total completion time required t",
    "link": "http://arxiv.org/abs/2305.10444",
    "context": "Title: Optimizing Forest Fire Prevention: Intelligent Scheduling Algorithms for Drone-Based Surveillance System. (arXiv:2305.10444v1 [cs.RO])\nAbstract: Given the importance of forests and their role in maintaining the ecological balance, which directly affects the planet, the climate, and the life on this planet, this research presents the problem of forest fire monitoring using drones. The forest monitoring process is performed continuously to track any changes in the monitored region within the forest. During fires, drones' capture data is used to increase the follow-up speed and enhance the control process of these fires to prevent their spread. The time factor in such problems determines the success rate of the fire extinguishing process, as appropriate data at the right time may be the decisive factor in controlling fires, preventing their spread, extinguishing them, and limiting their losses. Therefore, this research presented the problem of monitoring task scheduling for drones in the forest monitoring system. This problem is solved by developing several algorithms with the aim of minimizing the total completion time required t",
    "path": "papers/23/05/2305.10444.json",
    "total_tokens": 898,
    "translated_abstract": "鉴于森林及其在维护生态平衡中的重要性直接影响地球、气候和地球上的生命，本研究提出使用无人机进行森林火灾监测的问题。森林监测过程是持续进行的，以跟踪监测区域内的任何变化。在火灾期间，使用无人机捕获数据以增加跟踪速度，增强控制这些火灾的过程，以防止火势蔓延。时间因素在这类问题中决定了灭火过程的成功率，因为适时的正确数据可能是控制火灾、防止蔓延、熄灭火灾和限制损失的决定因素。因此，本研究提出了森林监测系统中无人机监测任务调度的问题。通过开发几种算法来解决这个问题，以最小化所需的总完成时间。",
    "tldr": "本研究提出使用无人机进行森林火灾监测的问题，并设计了几种算法解决森林监测系统中无人机监测任务调度的问题。这有助于提高火灾的控制过程，防止火势蔓延并限制损失。",
    "en_tdlr": "This research addresses the use of drones for forest fire monitoring and presents several algorithms to solve the scheduling problem of drone monitoring tasks in the forest monitoring system. This helps improve the control process of fires, prevent their spread, and limit losses."
}