{
    "title": "AutoTrial: Prompting Language Models for Clinical Trial Design. (arXiv:2305.11366v1 [cs.CL])",
    "abstract": "Clinical trials are critical for drug development. Constructing the appropriate eligibility criteria (i.e., the inclusion/exclusion criteria for patient recruitment) is essential for the trial's success. Proper design of clinical trial protocols should consider similar precedent trials and their eligibility criteria to ensure sufficient patient coverage. In this paper, we present a method named AutoTrial to aid the design of clinical eligibility criteria using language models. It allows (1) controllable generation under instructions via a hybrid of discrete and neural prompting, (2) scalable knowledge incorporation via in-context learning, and (3) explicit reasoning chains to provide rationales for understanding the outputs. Experiments on over 70K clinical trials verify that AutoTrial generates high-quality criteria texts that are fluent and coherent and with high accuracy in capturing the relevant clinical concepts to the target trial. It is noteworthy that our method, with a much sm",
    "link": "http://arxiv.org/abs/2305.11366",
    "context": "Title: AutoTrial: Prompting Language Models for Clinical Trial Design. (arXiv:2305.11366v1 [cs.CL])\nAbstract: Clinical trials are critical for drug development. Constructing the appropriate eligibility criteria (i.e., the inclusion/exclusion criteria for patient recruitment) is essential for the trial's success. Proper design of clinical trial protocols should consider similar precedent trials and their eligibility criteria to ensure sufficient patient coverage. In this paper, we present a method named AutoTrial to aid the design of clinical eligibility criteria using language models. It allows (1) controllable generation under instructions via a hybrid of discrete and neural prompting, (2) scalable knowledge incorporation via in-context learning, and (3) explicit reasoning chains to provide rationales for understanding the outputs. Experiments on over 70K clinical trials verify that AutoTrial generates high-quality criteria texts that are fluent and coherent and with high accuracy in capturing the relevant clinical concepts to the target trial. It is noteworthy that our method, with a much sm",
    "path": "papers/23/05/2305.11366.json",
    "total_tokens": 954,
    "translated_title": "AutoTrial：用自然语言生成临床试验设计指南",
    "translated_abstract": "临床试验对于药物开发至关重要。为患者拟定合适的纳入/排除标准是试验成功的关键。临床试验方案的正确设计应考虑到类似的先例试验及其纳入/排除标准，以确保患者的充分覆盖。本文提出了一种名为AutoTrial的方法，使用自然语言生成模型来帮助设计临床纳入/排除标准。它允许（1）通过离散和神经提示的混合进行可控的指导生成，（2）通过上下文学习进行可扩展的知识融合，以及（3）提供明确的推理链以理解输出的合理性。对超过70,000项临床试验的实验验证了AutoTrial生成的标准文本具有流畅性和连贯性，并且在捕捉目标试验相关临床概念方面准确度高。值得注意的是，我们的方法在计算资源占用更少的情况下，实现了可与最先进的方法相媲美的性能。",
    "tldr": "AutoTrial是一种使用语言模型自动生成临床试验纳入/排除标准的方法，它可以可控生成、可扩展学习、提供推理链，实验表明，它能够生成流畅准确的标准文本，与先进方法相媲美，但资源占用更少。",
    "en_tdlr": "AutoTrial is a method that uses natural language generation models to aid the design of clinical eligibility criteria, which allows controllable generation, scalable knowledge incorporation, and explicit reasoning chains. Experiments show that it generates fluent and accurate criteria texts comparable to state-of-the-art methods, while using significantly fewer computational resources."
}