{
    "title": "Real-time Simultaneous Multi-Object 3D Shape Reconstruction, 6DoF Pose Estimation and Dense Grasp Prediction. (arXiv:2305.09510v1 [cs.RO])",
    "abstract": "Robotic manipulation systems operating in complex environments rely on perception systems that provide information about the geometry (pose and 3D shape) of the objects in the scene along with other semantic information such as object labels. This information is then used for choosing the feasible grasps on relevant objects. In this paper, we present a novel method to provide this geometric and semantic information of all objects in the scene as well as feasible grasps on those objects simultaneously. The main advantage of our method is its speed as it avoids sequential perception and grasp planning steps. With detailed quantitative analysis, we show that our method delivers competitive performance compared to the state-of-the-art dedicated methods for object shape, pose, and grasp predictions while providing fast inference at 30 frames per second speed.",
    "link": "http://arxiv.org/abs/2305.09510",
    "context": "Title: Real-time Simultaneous Multi-Object 3D Shape Reconstruction, 6DoF Pose Estimation and Dense Grasp Prediction. (arXiv:2305.09510v1 [cs.RO])\nAbstract: Robotic manipulation systems operating in complex environments rely on perception systems that provide information about the geometry (pose and 3D shape) of the objects in the scene along with other semantic information such as object labels. This information is then used for choosing the feasible grasps on relevant objects. In this paper, we present a novel method to provide this geometric and semantic information of all objects in the scene as well as feasible grasps on those objects simultaneously. The main advantage of our method is its speed as it avoids sequential perception and grasp planning steps. With detailed quantitative analysis, we show that our method delivers competitive performance compared to the state-of-the-art dedicated methods for object shape, pose, and grasp predictions while providing fast inference at 30 frames per second speed.",
    "path": "papers/23/05/2305.09510.json",
    "total_tokens": 850,
    "translated_title": "实时同时多物体三维形状重建，6DoF姿态估计和密集抓取预测。",
    "translated_abstract": "在复杂环境中操作的机器人操作系统依赖于感知系统，该系统提供有关场景中对象的几何（姿态和三维形状）以及其他语义信息（例如对象标签）的信息。然后利用这些信息选择相关对象上的可行抓取。在本文中，我们提出了一种新方法，可以同时提供场景中所有对象的几何和语义信息以及这些对象上的可行抓取。我们方法的主要优点在于其速度，因为它避免了顺序感知和抓取规划步骤。通过详细的定量分析，我们展示了我们的方法提供与面向对象形状、姿态和抓取预测的最新专用方法相比具有竞争力的性能，同时提供每秒30帧的快速推理。",
    "tldr": "该论文提出了一种实现实时同时多物体三维形状重建、6DoF姿态估计和密集抓取预测的新方法，无需顺序感知和抓取规划步骤，具有快速推理且具有竞争力的性能。",
    "en_tdlr": "This paper proposes a new method for real-time simultaneous multi-object 3D shape reconstruction, 6DoF pose estimation and dense grasp prediction, which avoids sequential perception and grasp planning steps and provides fast inference at 30 frames per second speed, with competitive performance compared to state-of-the-art dedicated methods."
}