{
    "title": "Optimal Support for Distressed Subsidiaries -- a Systemic Risk Perspective",
    "abstract": "arXiv:2201.12731v3 Announce Type: replace  Abstract: We consider a network of bank holdings, where every holding has two subsidiaries of different types. A subsidiary can trade with another holding's subsidiary of the same type. Holdings support their subsidiaries up to a certain level when they would otherwise fail to honor their financial obligations. We investigate the spread of contagion in this banking network when the number of bank holdings is large, and find the final number of defaulted subsidiaries under different rules for the holding support. We also consider resilience of this multilayered network to small shocks. Our work sheds light onto the role that holding structures can play in the amplification of financial stress. We find that depending on the capitalization of the network, a holding structure can be beneficial as compared to smaller separated entities. In other instances, it can be harmful and actually increase contagion. We illustrate our results in a numerical c",
    "link": "https://arxiv.org/abs/2201.12731",
    "context": "Title: Optimal Support for Distressed Subsidiaries -- a Systemic Risk Perspective\nAbstract: arXiv:2201.12731v3 Announce Type: replace  Abstract: We consider a network of bank holdings, where every holding has two subsidiaries of different types. A subsidiary can trade with another holding's subsidiary of the same type. Holdings support their subsidiaries up to a certain level when they would otherwise fail to honor their financial obligations. We investigate the spread of contagion in this banking network when the number of bank holdings is large, and find the final number of defaulted subsidiaries under different rules for the holding support. We also consider resilience of this multilayered network to small shocks. Our work sheds light onto the role that holding structures can play in the amplification of financial stress. We find that depending on the capitalization of the network, a holding structure can be beneficial as compared to smaller separated entities. In other instances, it can be harmful and actually increase contagion. We illustrate our results in a numerical c",
    "path": "papers/22/01/2201.12731.json",
    "total_tokens": 872,
    "translated_title": "对于陷入困境的子公司的最佳支持——一个系统性风险的视角",
    "translated_abstract": "我们考虑一个银行控股网络，每个控股拥有两种不同类型的子公司。子公司可以与另一家控股的同类型子公司进行交易。当子公司无法履行其财务义务时，控股支持其子公司达到一定程度。我们研究了在银行控股数量很大时，在控股支持规则不同的情况下，在这种银行网络中传染扩散的情况，并找到不同控股支持规则下的最终违约子公司数量。我们还考虑了这个多层网络对小冲击的弹性。我们的研究揭示了控股结构在增加金融压力方面可以发挥的作用。我们发现，取决于网络的资本化程度，与较小的独立实体相比，控股结构可能是有利的。在其他情况下，它可能是有害的，并实际上会增加传染性。我们通过数值实例说明了我们的结果。",
    "tldr": "该研究探讨了银行控股网络中对陷入困境的子公司的最佳支持策略，并发现控股结构对于金融压力的放大起到关键作用。",
    "en_tdlr": "This study examines the optimal support for distressed subsidiaries in a banking network and highlights the crucial role of holding structures in amplifying financial stress."
}