{
    "title": "Rawlsian Fairness in Online Bipartite Matching: Two-sided, Group, and Individual. (arXiv:2201.06021v3 [cs.GT] UPDATED)",
    "abstract": "Online bipartite-matching platforms are ubiquitous and find applications in important areas such as crowdsourcing and ridesharing. In the most general form, the platform consists of three entities: two sides to be matched and a platform operator that decides the matching. The design of algorithms for such platforms has traditionally focused on the operator's (expected) profit. Since fairness has become an important consideration that was ignored in the existing algorithms a collection of online matching algorithms have been developed that give a fair treatment guarantee for one side of the market at the expense of a drop in the operator's profit. In this paper, we generalize the existing work to offer fair treatment guarantees to both sides of the market simultaneously, at a calculated worst case drop to operator profit. We consider group and individual Rawlsian fairness criteria. Moreover, our algorithms have theoretical guarantees and have adjustable parameters that can be tuned as d",
    "link": "http://arxiv.org/abs/2201.06021",
    "context": "Title: Rawlsian Fairness in Online Bipartite Matching: Two-sided, Group, and Individual. (arXiv:2201.06021v3 [cs.GT] UPDATED)\nAbstract: Online bipartite-matching platforms are ubiquitous and find applications in important areas such as crowdsourcing and ridesharing. In the most general form, the platform consists of three entities: two sides to be matched and a platform operator that decides the matching. The design of algorithms for such platforms has traditionally focused on the operator's (expected) profit. Since fairness has become an important consideration that was ignored in the existing algorithms a collection of online matching algorithms have been developed that give a fair treatment guarantee for one side of the market at the expense of a drop in the operator's profit. In this paper, we generalize the existing work to offer fair treatment guarantees to both sides of the market simultaneously, at a calculated worst case drop to operator profit. We consider group and individual Rawlsian fairness criteria. Moreover, our algorithms have theoretical guarantees and have adjustable parameters that can be tuned as d",
    "path": "papers/22/01/2201.06021.json",
    "total_tokens": 834,
    "translated_title": "在线二分匹配中的Rawlsian公平性：双侧、群体和个人。",
    "translated_abstract": "在线二分匹配平台是普遍存在的，被广泛应用于众包和拼车等重要领域。平台由三个实体组成：两个需要匹配的双方，以及一个决定匹配的平台操作者。传统上，对于这种平台的算法设计关注的是操作者的（预期）利润。然而，随着公平性变得越来越重要，同时忽略市场中任意一方的公平性保证的现有算法已经无法满足要求。本文将现有工作推广到同时为市场中的双方提供公平性保证，以计算最坏情况下操作者利润的降低为代价。我们考虑组和个人Rawlsian公平性标准。此外，我们的算法具有理论保证，并具有可以调整的参数。",
    "tldr": "本文提出了一种通用的在线匹配算法，它为在线二分匹配平台中的两个双方同时提供公平性保证，而以降低操作者利润为代价。"
}