{
    "title": "Coordinate Descent Methods for Fractional Minimization. (arXiv:2201.12691v3 [math.OC] UPDATED)",
    "abstract": "We consider a class of structured fractional minimization problems, in which the numerator part of the objective is the sum of a differentiable convex function and a convex non-smooth function, while the denominator part is a convex or concave function. This problem is difficult to solve since it is non-convex. By exploiting the structure of the problem, we propose two Coordinate Descent (CD) methods for solving this problem. The proposed methods iteratively solve a one-dimensional subproblem \\textit{globally}, and they are guaranteed to converge to coordinate-wise stationary points. In the case of a convex denominator, under a weak \\textit{locally bounded non-convexity condition}, we prove that the optimality of coordinate-wise stationary point is stronger than that of the standard critical point and directional point. Under additional suitable conditions, CD methods converge Q-linearly to coordinate-wise stationary points. In the case of a concave denominator, we show that any critic",
    "link": "http://arxiv.org/abs/2201.12691",
    "context": "Title: Coordinate Descent Methods for Fractional Minimization. (arXiv:2201.12691v3 [math.OC] UPDATED)\nAbstract: We consider a class of structured fractional minimization problems, in which the numerator part of the objective is the sum of a differentiable convex function and a convex non-smooth function, while the denominator part is a convex or concave function. This problem is difficult to solve since it is non-convex. By exploiting the structure of the problem, we propose two Coordinate Descent (CD) methods for solving this problem. The proposed methods iteratively solve a one-dimensional subproblem \\textit{globally}, and they are guaranteed to converge to coordinate-wise stationary points. In the case of a convex denominator, under a weak \\textit{locally bounded non-convexity condition}, we prove that the optimality of coordinate-wise stationary point is stronger than that of the standard critical point and directional point. Under additional suitable conditions, CD methods converge Q-linearly to coordinate-wise stationary points. In the case of a concave denominator, we show that any critic",
    "path": "papers/22/01/2201.12691.json",
    "total_tokens": 841,
    "translated_title": "分数规划的坐标下降方法",
    "translated_abstract": "我们考虑一类结构化的分数规划问题，其中目标函数的分子部分是一个可微的凸函数和一个凸非光滑函数的和，而分母部分是一个凸或凹函数。由于该问题是非凸的，所以很难解决。通过利用问题的结构，我们提出了两种坐标下降方法来解决这个问题。所提出的方法迭代地解决一个一维子问题，而且保证收敛到逐坐标静止点。在分母为凸函数的情况下，在弱局部有界非凸条件下，我们证明了逐坐标静态点的最优性比标准临界点和方向性点的最优性更强。在满足适当的条件下，坐标下降算法以Q-线性方式收敛到逐坐标静态点。在分母为凹函数的情况下，我们展示了任何临界点都是逐坐标最优点的充分条件。",
    "tldr": "本文提出两种坐标下降方法，用于解决具有结构化约束的分数规划问题，并保证收敛到逐坐标静态点。",
    "en_tdlr": "This paper proposes two coordinate descent methods to solve structured fractional minimization problems, with guaranteed convergence to coordinate-wise stationary points."
}