{
    "title": "The Benefits of Coarse Preferences. (arXiv:2201.10141v5 [econ.TH] UPDATED)",
    "abstract": "We study the strategic advantages of coarsening one's utility by clustering nearby payoffs together (i.e., classifying them the same way). Our solution concept, coarse-utility equilibrium (CUE) requires that (1) each player maximizes her coarse utility, given the opponent's strategy, and (2) the classifications form best replies to one another. We characterize CUEs in various games. In particular, we show that there is a qualitative difference between CUEs in which only one of the players clusters payoffs, and those in which all players cluster their payoffs, and that the latter type induce players to treat co-players better than in Nash equilibria in the large class of games with monotone externalities.",
    "link": "http://arxiv.org/abs/2201.10141",
    "context": "Title: The Benefits of Coarse Preferences. (arXiv:2201.10141v5 [econ.TH] UPDATED)\nAbstract: We study the strategic advantages of coarsening one's utility by clustering nearby payoffs together (i.e., classifying them the same way). Our solution concept, coarse-utility equilibrium (CUE) requires that (1) each player maximizes her coarse utility, given the opponent's strategy, and (2) the classifications form best replies to one another. We characterize CUEs in various games. In particular, we show that there is a qualitative difference between CUEs in which only one of the players clusters payoffs, and those in which all players cluster their payoffs, and that the latter type induce players to treat co-players better than in Nash equilibria in the large class of games with monotone externalities.",
    "path": "papers/22/01/2201.10141.json",
    "total_tokens": 902,
    "translated_title": "粗略偏好的优势研究",
    "translated_abstract": "本文研究了通过将附近的收益聚类在一起（即以相同方式进行分类）来粗略化自己的效用，从而获得的战略优势。我们的解决方案概念，粗略效用均衡（CUE）要求（1）每个玩家在对手的策略下最大化他的粗略效用，（2）分类形成相互最佳应答。我们特征化了各种游戏中的CUE。特别地，在具有单调外部性的大类游戏中，我们展示了只有一个玩家聚类收益的CUE与所有玩家聚类收益的CUE之间存在定性差异，后者诱导玩家对待共同玩家更好地超过Nash均衡。",
    "tldr": "本文研究通过将附近的收益聚类在一起来粗略化自己的效用，从而获得战略优势。CUE的解决方案要求每个玩家最大化他的粗略效用，形成相互最佳应答。不同类型的CUE之间存在定性差异，后者在具有单调外部性的大类游戏中使得玩家对待共同玩家更好地超过Nash均衡。",
    "en_tdlr": "This paper studies the strategic advantages of coarsening one's utility by clustering nearby payoffs together, and proposes the coarse-utility equilibrium (CUE) concept which requires each player to maximize their coarse utility and form best replies to one another's classification. The paper shows that CUEs with different types induce players to treat co-players differently, with the latter type leading to better treatment of co-players than Nash equilibrium in games with monotone externalities."
}