{
    "title": "Fast Distributed k-Means with a Small Number of Rounds. (arXiv:2201.13217v2 [cs.DC] UPDATED)",
    "abstract": "We propose a new algorithm for k-means clustering in a distributed setting, where the data is distributed across many machines, and a coordinator communicates with these machines to calculate the output clustering. Our algorithm guarantees a cost approximation factor and a number of communication rounds that depend only on the computational capacity of the coordinator. Moreover, the algorithm includes a built-in stopping mechanism, which allows it to use fewer communication rounds whenever possible. We show both theoretically and empirically that in many natural cases, indeed 1-4 rounds suffice. In comparison with the popular k-means|| algorithm, our approach allows exploiting a larger coordinator capacity to obtain a smaller number of rounds. Our experiments show that the k-means cost obtained by the proposed algorithm is usually better than the cost obtained by k-means||, even when the latter is allowed a larger number of rounds. Moreover, the machine running time in our approach is ",
    "link": "http://arxiv.org/abs/2201.13217",
    "context": "Title: Fast Distributed k-Means with a Small Number of Rounds. (arXiv:2201.13217v2 [cs.DC] UPDATED)\nAbstract: We propose a new algorithm for k-means clustering in a distributed setting, where the data is distributed across many machines, and a coordinator communicates with these machines to calculate the output clustering. Our algorithm guarantees a cost approximation factor and a number of communication rounds that depend only on the computational capacity of the coordinator. Moreover, the algorithm includes a built-in stopping mechanism, which allows it to use fewer communication rounds whenever possible. We show both theoretically and empirically that in many natural cases, indeed 1-4 rounds suffice. In comparison with the popular k-means|| algorithm, our approach allows exploiting a larger coordinator capacity to obtain a smaller number of rounds. Our experiments show that the k-means cost obtained by the proposed algorithm is usually better than the cost obtained by k-means||, even when the latter is allowed a larger number of rounds. Moreover, the machine running time in our approach is ",
    "path": "papers/22/01/2201.13217.json",
    "total_tokens": 828,
    "translated_title": "快速分布式k-Means算法，通信轮数较少",
    "translated_abstract": "我们提出了一种新的k-Means算法，用于分布式环境下的聚类，并保证误差近似因子和通信轮数仅取决于协调者的计算能力。此外，该算法包括内置的停止机制，可以尽可能地减少通信轮数。理论和实验证明，在许多实际情况下，只需要1-4轮即可完成。与k-means||算法相比，我们的方法允许利用更大的协调能力以获得更少的轮数。我们的实验表明，所提出的算法所得到的k-Means成本通常比k-means||算法更好，即使后者允许更多的通信轮数。此外，我们的算法在运行时间方面要比k-means ||短得多。",
    "tldr": "该文提出了一种适用于分布式环境下聚类的快速算法，保证通信轮数较少且成本更低。",
    "en_tdlr": "The paper proposes a fast algorithm for distributed k-means clustering with a small number of communication rounds, which guarantees a lower cost and a built-in stopping mechanism for reducing the communication rounds. The experiments show that the proposed algorithm outperforms k-means|| in terms of both cost and running time."
}