{
    "title": "Spatiotemporal Clustering with Neyman-Scott Processes via Connections to Bayesian Nonparametric Mixture Models. (arXiv:2201.05044v3 [stat.ML] UPDATED)",
    "abstract": "Neyman-Scott processes (NSPs) are point process models that generate clusters of points in time or space. They are natural models for a wide range of phenomena, ranging from neural spike trains to document streams. The clustering property is achieved via a doubly stochastic formulation: first, a set of latent events is drawn from a Poisson process; then, each latent event generates a set of observed data points according to another Poisson process. This construction is similar to Bayesian nonparametric mixture models like the Dirichlet process mixture model (DPMM) in that the number of latent events (i.e. clusters) is a random variable, but the point process formulation makes the NSP especially well suited to modeling spatiotemporal data. While many specialized algorithms have been developed for DPMMs, comparatively fewer works have focused on inference in NSPs. Here, we present novel connections between NSPs and DPMMs, with the key link being a third class of Bayesian mixture models c",
    "link": "http://arxiv.org/abs/2201.05044",
    "context": "Title: Spatiotemporal Clustering with Neyman-Scott Processes via Connections to Bayesian Nonparametric Mixture Models. (arXiv:2201.05044v3 [stat.ML] UPDATED)\nAbstract: Neyman-Scott processes (NSPs) are point process models that generate clusters of points in time or space. They are natural models for a wide range of phenomena, ranging from neural spike trains to document streams. The clustering property is achieved via a doubly stochastic formulation: first, a set of latent events is drawn from a Poisson process; then, each latent event generates a set of observed data points according to another Poisson process. This construction is similar to Bayesian nonparametric mixture models like the Dirichlet process mixture model (DPMM) in that the number of latent events (i.e. clusters) is a random variable, but the point process formulation makes the NSP especially well suited to modeling spatiotemporal data. While many specialized algorithms have been developed for DPMMs, comparatively fewer works have focused on inference in NSPs. Here, we present novel connections between NSPs and DPMMs, with the key link being a third class of Bayesian mixture models c",
    "path": "papers/22/01/2201.05044.json",
    "total_tokens": 917,
    "translated_title": "通过与贝叶斯非参数混合模型的联系，使用Neyman-Scott过程进行时空聚类",
    "translated_abstract": "Neyman-Scott过程（NSPs）是生成时间或空间中点簇的点过程模型。它们是一种适用于广泛现象的自然模型，从神经脉冲序列到文档流。聚类属性是通过双重随机公式实现的：首先，从泊松过程中绘制一组潜在事件；然后，每个潜在事件根据另一个泊松过程生成一组观测数据点。这个结构类似于贝叶斯非参数混合模型，如狄利克雷过程混合模型（DPMM），其中潜在事件（即簇）的数量是一个随机变量，但点过程的构造使得NSP特别适合于建模时空数据。虽然为DPMM开发了许多专门算法，但相对较少的工作集中在NSP的推断上。在这里，我们介绍了NSP与DPMM之间的新颖联系，关键的连接是第三类贝叶斯混合模型",
    "tldr": "这篇论文介绍了Neyman-Scott过程（NSPs）和贝叶斯非参数混合模型（DPMM）之间的新颖联系，并探讨了NSP在时空数据建模中的应用。",
    "en_tdlr": "This paper presents novel connections between Neyman-Scott processes (NSPs) and Bayesian nonparametric mixture models (DPMM), and explores the application of NSP in spatiotemporal data modeling."
}