{
    "title": "A Cognitive Explainer for Fetal ultrasound images classifier Based on Medical Concepts. (arXiv:2201.07798v3 [cs.LG] UPDATED)",
    "abstract": "Fetal standard scan plane detection during 2-D mid-pregnancy examinations is a highly complex task, which requires extensive medical knowledge and years of training. Although deep neural networks (DNN) can assist inexperienced operators in these tasks, their lack of transparency and interpretability limit their application. Despite some researchers have been committed to visualizing the decision process of DNN, most of them only focus on the pixel-level features and do not take into account the medical prior knowledge. In this work, we propose an interpretable framework based on key medical concepts, which provides explanations from the perspective of clinicians' cognition. Moreover, we utilize a concept-based graph convolutional neural(GCN) network to construct the relationships between key medical concepts. Extensive experimental analysis on a private dataset has shown that the proposed method provides easy-to-understand insights about reasoning results for clinicians.",
    "link": "http://arxiv.org/abs/2201.07798",
    "context": "Title: A Cognitive Explainer for Fetal ultrasound images classifier Based on Medical Concepts. (arXiv:2201.07798v3 [cs.LG] UPDATED)\nAbstract: Fetal standard scan plane detection during 2-D mid-pregnancy examinations is a highly complex task, which requires extensive medical knowledge and years of training. Although deep neural networks (DNN) can assist inexperienced operators in these tasks, their lack of transparency and interpretability limit their application. Despite some researchers have been committed to visualizing the decision process of DNN, most of them only focus on the pixel-level features and do not take into account the medical prior knowledge. In this work, we propose an interpretable framework based on key medical concepts, which provides explanations from the perspective of clinicians' cognition. Moreover, we utilize a concept-based graph convolutional neural(GCN) network to construct the relationships between key medical concepts. Extensive experimental analysis on a private dataset has shown that the proposed method provides easy-to-understand insights about reasoning results for clinicians.",
    "path": "papers/22/01/2201.07798.json",
    "total_tokens": 859,
    "translated_title": "基于医学概念的胎儿超声图像分类器的认知解释器",
    "translated_abstract": "在二维孕期检查中，胎儿标准扫描平面的检测是一项非常复杂的任务，需要广泛的医学知识和多年的培训。虽然深度神经网络(DNN)可以协助经验不足的医生完成这些任务，但它们的透明度和可解释性限制了它们的应用。本研究提出了一种基于关键医学概念的可解释框架，从临床医生的认知角度提供解释。此外，我们利用基于概念的图卷积神经网络(GCN)构建关键医学概念之间的关系。对一个私有数据集的广泛实验分析表明，所提出的方法为临床医生提供了易于理解的推理结果见解。",
    "tldr": "本研究提出了一种基于关键医学概念的可解释框架，利用概念间的关系构建图卷积神经网络，解释胎儿超声图像分类器的决策过程，为临床医生提供易于理解的推理结果见解。",
    "en_tdlr": "A cognitive explainer for fetal ultrasound images classifier is proposed based on key medical concepts, utilizing a concept-based graph convolutional neural network to construct relationships, which provides easy-to-understand insights about reasoning results for clinicians."
}