{
    "title": "Multi-Scale Adaptive Graph Neural Network for Multivariate Time Series Forecasting. (arXiv:2201.04828v2 [cs.LG] UPDATED)",
    "abstract": "Multivariate time series (MTS) forecasting plays an important role in the automation and optimization of intelligent applications. It is a challenging task, as we need to consider both complex intra-variable dependencies and inter-variable dependencies. Existing works only learn temporal patterns with the help of single inter-variable dependencies. However, there are multi-scale temporal patterns in many real-world MTS. Single inter-variable dependencies make the model prefer to learn one type of prominent and shared temporal patterns. In this paper, we propose a multi-scale adaptive graph neural network (MAGNN) to address the above issue. MAGNN exploits a multi-scale pyramid network to preserve the underlying temporal dependencies at different time scales. Since the inter-variable dependencies may be different under distinct time scales, an adaptive graph learning module is designed to infer the scale-specific inter-variable dependencies without pre-defined priors. Given the multi-sca",
    "link": "http://arxiv.org/abs/2201.04828",
    "context": "Title: Multi-Scale Adaptive Graph Neural Network for Multivariate Time Series Forecasting. (arXiv:2201.04828v2 [cs.LG] UPDATED)\nAbstract: Multivariate time series (MTS) forecasting plays an important role in the automation and optimization of intelligent applications. It is a challenging task, as we need to consider both complex intra-variable dependencies and inter-variable dependencies. Existing works only learn temporal patterns with the help of single inter-variable dependencies. However, there are multi-scale temporal patterns in many real-world MTS. Single inter-variable dependencies make the model prefer to learn one type of prominent and shared temporal patterns. In this paper, we propose a multi-scale adaptive graph neural network (MAGNN) to address the above issue. MAGNN exploits a multi-scale pyramid network to preserve the underlying temporal dependencies at different time scales. Since the inter-variable dependencies may be different under distinct time scales, an adaptive graph learning module is designed to infer the scale-specific inter-variable dependencies without pre-defined priors. Given the multi-sca",
    "path": "papers/22/01/2201.04828.json",
    "total_tokens": 1190,
    "translated_title": "多尺度自适应图神经网络用于多元时间序列预测",
    "translated_abstract": "多元时间序列(MTS)预测在智能应用的自动化和优化中扮演着重要角色，但其需要考虑到复杂的 intra-variable 和 inter-variable 的依赖关系，是一个具有挑战性的任务。现有的方法仅通过单一的 inter-variable 的依赖关系来学习时间模式。然而，在许多实际的MTS数据中，存在多尺度的时间模式。单个交互变量依赖关系使得模型更倾向于学习一种突出和共享的时间模式。本文提出了一种多尺度自适应图神经网络(MAGNN)来解决上述问题。MAGNN利用多尺度金字塔网络来保留不同时间尺度下的基本时间依赖性。由于在不同的时间尺度下，交互变量依赖关系可能不同，因此设计了一种自适应图学习模块来推导尺度特定的交互变量依赖性，而不需要预定义先验知识。鉴于多尺度表示，MAGNN进一步利用注意机制有效地捕获最具信息的预测模式。实验结果表明，与现有最优方法相比，本文提出的MAGNN模型在合成数据集和现实数据集上的预测效果更好。",
    "tldr": "本文提出了一个新的多尺度自适应图神经网络 (MAGNN) 模型，旨在解决传统多元时间序列预测方法中只能学习单一依赖关系的问题，通过多尺度金字塔网络和自适应图学习模块，使模型能够在不同的时间尺度下推导出尺度特定的交互变量依赖性，同时，利用注意机制有效捕获最具信息的预测模式，实验结果表明，MAGNN 对于合成数据集和现实数据集的预测效果优于现有最优方法。",
    "en_tdlr": "This paper proposes a new Multi-Scale Adaptive Graph Neural Network (MAGNN) model to tackle the problem of traditional multivariate time series forecasting methods only being able to learn single dependencies. The MAGNN model uses a multi-scale pyramid network and an adaptive graph learning module to infer scale-specific inter-variable dependencies without the need for predefined knowledge. Additionally, the model utilizes an attention mechanism to effectively capture informative patterns for forecasting. The experimental results show MAGNN outperforms existing state-of-the-art methods on both synthetic and real-world datasets."
}