{
    "title": "Explainable AI Integrated Feature Selection for Landslide Susceptibility Mapping using TreeSHAP. (arXiv:2201.03225v2 [cs.LG] UPDATED)",
    "abstract": "Landslides have been a regular occurrence and an alarming threat to human life and property in the era of anthropogenic global warming. An early prediction of landslide susceptibility using a data-driven approach is a demand of time. In this study, we explored the eloquent features that best describe landslide susceptibility with state-of-the-art machine learning methods. In our study, we employed state-of-the-art machine learning algorithms including XgBoost, LR, KNN, SVM, and Adaboost for landslide susceptibility prediction. To find the best hyperparameters of each individual classifier for optimized performance, we have incorporated the Grid Search method, with 10 Fold Cross-Validation. In this context, the optimized version of XgBoost outperformed all other classifiers with a Cross-validation Weighted F1 score of 94.62 %. Followed by this empirical evidence, we explored the XgBoost classifier by incorporating TreeSHAP, a game-theory-based statistical algorithm used to explain Machi",
    "link": "http://arxiv.org/abs/2201.03225",
    "context": "Title: Explainable AI Integrated Feature Selection for Landslide Susceptibility Mapping using TreeSHAP. (arXiv:2201.03225v2 [cs.LG] UPDATED)\nAbstract: Landslides have been a regular occurrence and an alarming threat to human life and property in the era of anthropogenic global warming. An early prediction of landslide susceptibility using a data-driven approach is a demand of time. In this study, we explored the eloquent features that best describe landslide susceptibility with state-of-the-art machine learning methods. In our study, we employed state-of-the-art machine learning algorithms including XgBoost, LR, KNN, SVM, and Adaboost for landslide susceptibility prediction. To find the best hyperparameters of each individual classifier for optimized performance, we have incorporated the Grid Search method, with 10 Fold Cross-Validation. In this context, the optimized version of XgBoost outperformed all other classifiers with a Cross-validation Weighted F1 score of 94.62 %. Followed by this empirical evidence, we explored the XgBoost classifier by incorporating TreeSHAP, a game-theory-based statistical algorithm used to explain Machi",
    "path": "papers/22/01/2201.03225.json",
    "total_tokens": 927,
    "translated_title": "使用TreeSHAP的可解释人工智能集成特征选择进行滑坡易发性制图",
    "translated_abstract": "在人为全球变暖时代，滑坡频繁发生并对人类生命和财产构成威胁。利用数据驱动方法进行早期滑坡易发性预测是时代的需求。本研究探索了最能描述滑坡易发性的优秀特征，并采用了最先进的机器学习方法进行分析。我们使用了XgBoost、LR、KNN、SVM和Adaboost等最先进的机器学习算法进行滑坡易发性预测。为了找到每个分类器的最佳超参数以达到最优性能，我们采用了网格搜索方法和10折交叉验证。在此情况下，经过优化的XgBoost表现优于其他所有分类器，交叉验证加权F1分数达到94.62％。在这个经验的基础上，我们通过引入TreeSHAP方法探索了XgBoost分类器，该方法是一种基于博弈论的统计算法，用于解释机器学习模型。",
    "tldr": "本研究使用最先进的机器学习方法来描述滑坡易发性，并通过XgBoost算法和TreeSHAP方法进行优化。经过实验证明，优化后的XgBoost表现优于其他分类器，具有较高的交叉验证加权F1分数。",
    "en_tdlr": "This study utilized state-of-the-art machine learning methods to describe landslide susceptibility, and optimized the analysis with XgBoost algorithm and TreeSHAP method. Empirical evidence showed that the optimized XgBoost outperformed other classifiers, achieving a high Cross-validation Weighted F1 score."
}