{
    "title": "A Non-Classical Parameterization for Density Estimation Using Sample Moments. (arXiv:2201.04786v5 [stat.ML] UPDATED)",
    "abstract": "Probability density estimation is a core problem of statistics and signal processing. Moment methods are an important means of density estimation, but they are generally strongly dependent on the choice of feasible functions, which severely affects the performance. In this paper, we propose a non-classical parametrization for density estimation using sample moments, which does not require the choice of such functions. The parametrization is induced by the squared Hellinger distance, and the solution of it, which is proved to exist and be unique subject to a simple prior that does not depend on data, and can be obtained by convex optimization. Statistical properties of the density estimator, together with an asymptotic error upper bound are proposed for the estimator by power moments. Applications of the proposed density estimator in signal processing tasks are given. Simulation results validate the performance of the estimator by a comparison to several prevailing methods. To the best ",
    "link": "http://arxiv.org/abs/2201.04786",
    "context": "Title: A Non-Classical Parameterization for Density Estimation Using Sample Moments. (arXiv:2201.04786v5 [stat.ML] UPDATED)\nAbstract: Probability density estimation is a core problem of statistics and signal processing. Moment methods are an important means of density estimation, but they are generally strongly dependent on the choice of feasible functions, which severely affects the performance. In this paper, we propose a non-classical parametrization for density estimation using sample moments, which does not require the choice of such functions. The parametrization is induced by the squared Hellinger distance, and the solution of it, which is proved to exist and be unique subject to a simple prior that does not depend on data, and can be obtained by convex optimization. Statistical properties of the density estimator, together with an asymptotic error upper bound are proposed for the estimator by power moments. Applications of the proposed density estimator in signal processing tasks are given. Simulation results validate the performance of the estimator by a comparison to several prevailing methods. To the best ",
    "path": "papers/22/01/2201.04786.json",
    "total_tokens": 879,
    "translated_title": "一种使用样本矩方法的非传统参数化密度估计",
    "translated_abstract": "概率密度估计是统计学和信号处理的核心问题。矩方法是密度估计的重要方法，但通常强烈依赖于可行函数的选择，这严重影响了性能。在本文中，我们提出了一种使用样本矩方法进行密度估计的非传统参数化方法，不需要选择这样的函数。该参数化是由平方Hellinger距离引起的，并且它的解被证明在不依赖于数据的简单先验条件下存在并且是唯一的，并且可以通过凸优化得到。通过幂矩估计提出了密度估计器的统计性质，以及估计器的渐近误差上界。给出了所提出的密度估计器在信号处理任务中的应用。通过与几种流行方法的比较，模拟结果验证了估计器的性能。",
    "tldr": "本文提出了一种使用样本矩方法进行非传统参数化密度估计的方法，通过平方Hellinger距离进行参数化，并通过凸优化得到唯一解。通过幂矩估计提出了估计器的统计性质和渐近误差上界，模拟结果验证了该方法的性能。",
    "en_tdlr": "This paper proposes a non-classical parameterization for density estimation using sample moments, which is induced by the squared Hellinger distance and solved through convex optimization. The statistical properties and asymptotic error upper bound of the estimator are presented using power moments. Simulation results confirm the performance of the proposed method."
}