{
    "title": "Measuring Non-Probabilistic Uncertainty: A cognitive, logical and computational assessment of known and unknown unknowns. (arXiv:2201.05818v5 [cs.AI] UPDATED)",
    "abstract": "There are two reasons why uncertainty may not be adequately described by Probability Theory. The first one is due to unique or nearly-unique events, that either never realized or occurred too seldom for frequencies to be reliably measured. The second one arises when one fears that something may happen, that one is not even able to figure out, e.g., if one asks: \"Climate change, financial crises, pandemic, war, what next?\"  In both cases, simple one-to-one cognitive maps between available alternatives and possible consequences eventually melt down. However, such destructions reflect into the changing narratives of business executives, employees and other stakeholders in specific, identifiable and differential ways. In particular, texts such as consultants' reports or letters to shareholders can be analysed in order to detect the impact of both sorts of uncertainty onto the causal relations that normally guide decision-making.  We propose structural measures of cognitive maps as a means ",
    "link": "http://arxiv.org/abs/2201.05818",
    "context": "Title: Measuring Non-Probabilistic Uncertainty: A cognitive, logical and computational assessment of known and unknown unknowns. (arXiv:2201.05818v5 [cs.AI] UPDATED)\nAbstract: There are two reasons why uncertainty may not be adequately described by Probability Theory. The first one is due to unique or nearly-unique events, that either never realized or occurred too seldom for frequencies to be reliably measured. The second one arises when one fears that something may happen, that one is not even able to figure out, e.g., if one asks: \"Climate change, financial crises, pandemic, war, what next?\"  In both cases, simple one-to-one cognitive maps between available alternatives and possible consequences eventually melt down. However, such destructions reflect into the changing narratives of business executives, employees and other stakeholders in specific, identifiable and differential ways. In particular, texts such as consultants' reports or letters to shareholders can be analysed in order to detect the impact of both sorts of uncertainty onto the causal relations that normally guide decision-making.  We propose structural measures of cognitive maps as a means ",
    "path": "papers/22/01/2201.05818.json",
    "total_tokens": 852,
    "translated_title": "测量非概率不确定性：已知和未知未知的认知、逻辑和计算评估",
    "translated_abstract": "不确定性无法用概率论充分描述的原因有两个。第一个原因是由于独特或几乎独特的事件，这些事件从未发生或发生得太少，以至于无法可靠地测量频率。第二个原因是当人们担心可能发生某些事情，而自己甚至无法想象，例如： \"气候变化、金融危机、大流行、战争，下一个是什么？\" 在这两种情况下，简单的一对一认知地图将最终崩溃。然而，这种破坏从具体、可识别和差异化的方式影响到企业高管、员工和其他利益相关者的不同讲述。特别是，可以通过分析诸如咨询报告或向股东的信函等文本，以检测这两种不确定性对通常指导决策的因果关系的影响。",
    "tldr": "该论文提出了一种测量非概率不确定性的方法，该方法可以通过分析文本来检测不确定性对决策因果关系的影响。",
    "en_tdlr": "This paper proposes a method for measuring non-probabilistic uncertainty, which can detect the impact of uncertainty on causal relations in decision-making by analyzing text."
}