{
    "title": "On the effectiveness of Randomized Signatures as Reservoir for Learning Rough Dynamics. (arXiv:2201.00384v3 [cs.LG] UPDATED)",
    "abstract": "Many finance, physics, and engineering phenomena are modeled by continuous-time dynamical systems driven by highly irregular (stochastic) inputs. A powerful tool to perform time series analysis in this context is rooted in rough path theory and leverages the so-called Signature Transform. This algorithm enjoys strong theoretical guarantees but is hard to scale to high-dimensional data. In this paper, we study a recently derived random projection variant called Randomized Signature, obtained using the Johnson-Lindenstrauss Lemma. We provide an in-depth experimental evaluation of the effectiveness of the Randomized Signature approach, in an attempt to showcase the advantages of this reservoir to the community. Specifically, we find that this method is preferable to the truncated Signature approach and alternative deep learning techniques in terms of model complexity, training time, accuracy, robustness, and data hungriness.",
    "link": "http://arxiv.org/abs/2201.00384",
    "context": "Title: On the effectiveness of Randomized Signatures as Reservoir for Learning Rough Dynamics. (arXiv:2201.00384v3 [cs.LG] UPDATED)\nAbstract: Many finance, physics, and engineering phenomena are modeled by continuous-time dynamical systems driven by highly irregular (stochastic) inputs. A powerful tool to perform time series analysis in this context is rooted in rough path theory and leverages the so-called Signature Transform. This algorithm enjoys strong theoretical guarantees but is hard to scale to high-dimensional data. In this paper, we study a recently derived random projection variant called Randomized Signature, obtained using the Johnson-Lindenstrauss Lemma. We provide an in-depth experimental evaluation of the effectiveness of the Randomized Signature approach, in an attempt to showcase the advantages of this reservoir to the community. Specifically, we find that this method is preferable to the truncated Signature approach and alternative deep learning techniques in terms of model complexity, training time, accuracy, robustness, and data hungriness.",
    "path": "papers/22/01/2201.00384.json",
    "total_tokens": 795,
    "translated_title": "随机签名作为学习粗糙动态的储备库的有效性研究",
    "translated_abstract": "许多金融、物理和工程现象都由高度不规则（随机）输入驱动的连续时间动态系统建模。由于粗路径理论，并利用所谓的签名变换，在这种情况下执行时间序列分析的强有力工具已经出现。该算法享有强大的理论保证，但很难扩展到高维数据。本文研究了最近推导的随机投影变量，称为随机签名。我们对随机签名方法的有效性进行了深入的实验评估，旨在展示这种储备库对社区的优势。我们发现，在模型复杂性、训练时间、准确性、稳健性和数据需求方面，这种方法优于截断签名方法和其他深度学习技术。",
    "tldr": "本文研究了随机签名方法在学习粗糙动态中的表现，并发现它比截断签名方法和其他深度学习技术更具优势。",
    "en_tdlr": "This paper studies the effectiveness of the Randomized Signature approach in learning rough dynamics and finds it superior to the truncated Signature approach and other deep learning techniques."
}