{
    "title": "Pricing Bermudan options using regression trees/random forests. (arXiv:2201.02587v2 [q-fin.CP] UPDATED)",
    "abstract": "The value of an American option is the maximized value of the discounted cash flows from the option. At each time step, one needs to compare the immediate exercise value with the continuation value and decide to exercise as soon as the exercise value is strictly greater than the continuation value. We can formulate this problem as a dynamic programming equation, where the main difficulty comes from the computation of the conditional expectations representing the continuation values at each time step. In (Longstaff and Schwartz, 2001), these conditional expectations were estimated using regressions on a finite-dimensional vector space (typically a polynomial basis). In this paper, we follow the same algorithm; only the conditional expectations are estimated using Regression trees or Random forests. We discuss the convergence of the LS algorithm when the standard least squares regression is replaced with regression trees. Finally, we expose some numerical results with regression trees an",
    "link": "http://arxiv.org/abs/2201.02587",
    "context": "Title: Pricing Bermudan options using regression trees/random forests. (arXiv:2201.02587v2 [q-fin.CP] UPDATED)\nAbstract: The value of an American option is the maximized value of the discounted cash flows from the option. At each time step, one needs to compare the immediate exercise value with the continuation value and decide to exercise as soon as the exercise value is strictly greater than the continuation value. We can formulate this problem as a dynamic programming equation, where the main difficulty comes from the computation of the conditional expectations representing the continuation values at each time step. In (Longstaff and Schwartz, 2001), these conditional expectations were estimated using regressions on a finite-dimensional vector space (typically a polynomial basis). In this paper, we follow the same algorithm; only the conditional expectations are estimated using Regression trees or Random forests. We discuss the convergence of the LS algorithm when the standard least squares regression is replaced with regression trees. Finally, we expose some numerical results with regression trees an",
    "path": "papers/22/01/2201.02587.json",
    "total_tokens": 882,
    "translated_title": "使用回归树/随机森林定价百慕大期权",
    "translated_abstract": "美式期权的价值是期权折现现金流的最大化价值。在每个时间步骤中，需要将即时行权价值与继续价值进行比较，并在行权价值严格大于继续价值时决定行权。我们可以将这个问题列为一个动态规划方程，其中主要困难是计算每个时间步骤表示继续价值的条件期望。在(Longstaff和Schwartz，2001)中，这些条件期望是利用有限维向量空间（通常是多项式基）上的回归估计出来的。在本文中，我们遵循相同的算法；只是条件期望是采用回归树或随机森林估计出来的。我们讨论了当标准最小二乘回归被回归树替换时，LS算法的收敛性。最后，我们揭示了一些回归树和随机森林的数值结果；这些结果表明这个新算法挑战了之前金融文献的最新研究成果。",
    "tldr": "本论文使用回归树/随机森林估计条件期望，并在数值结果上取得了表现超过先前金融文献的进展。",
    "en_tdlr": "This paper uses regression trees/random forests to estimate conditional expectations and makes progress beyond prior financial literature in numerical results."
}