{
    "title": "Information-Based Trading. (arXiv:2201.08875v4 [q-fin.MF] UPDATED)",
    "abstract": "We consider a pair of traders in a market where the information available to the second trader is a strict subset of the information available to the first trader. The traders make prices based on the information available concerning a security that pays a random cash flow at a fixed time $T$ in the future. Market information is modelled in line with the scheme of Brody, Hughston & Macrina (2007, 2008) and Brody, Davis, Friedman & Hughston (2009). The risk-neutral distribution of the cash flow is known to the traders, who make prices with a fixed multiplicative bid-offer spread and report their prices to a game master who declares that a trade has been made when the bid price of one of the traders crosses the offer price of the other. We prove that the value of the first trader's position is strictly greater than that of the second. The results are analyzed by use of simulation studies and generalized to situations where (a) there is a hierarchy of traders, (b) there are multiple succe",
    "link": "http://arxiv.org/abs/2201.08875",
    "context": "Title: Information-Based Trading. (arXiv:2201.08875v4 [q-fin.MF] UPDATED)\nAbstract: We consider a pair of traders in a market where the information available to the second trader is a strict subset of the information available to the first trader. The traders make prices based on the information available concerning a security that pays a random cash flow at a fixed time $T$ in the future. Market information is modelled in line with the scheme of Brody, Hughston & Macrina (2007, 2008) and Brody, Davis, Friedman & Hughston (2009). The risk-neutral distribution of the cash flow is known to the traders, who make prices with a fixed multiplicative bid-offer spread and report their prices to a game master who declares that a trade has been made when the bid price of one of the traders crosses the offer price of the other. We prove that the value of the first trader's position is strictly greater than that of the second. The results are analyzed by use of simulation studies and generalized to situations where (a) there is a hierarchy of traders, (b) there are multiple succe",
    "path": "papers/22/01/2201.08875.json",
    "total_tokens": 837,
    "translated_title": "基于信息的交易",
    "translated_abstract": "我们考虑一个市场中的一对交易者，其中第二个交易者可获得的信息是第一个交易者可获得信息的严格子集。交易者根据可获得的关于未来某个固定时间T时支付随机现金流的证券的信息制定价格。市场信息模型与Brody，Hughston和Macrina（2007，2008）以及Brody，Davis，Friedman和Hughston（2009）的方案一致。现金流的风险中性分布为交易者所知，他们以固定的乘性买卖价差制定价格，并将其报告给游戏主持人，当其中一个交易者的买价穿过另一个交易者的卖价时，宣布交易已成立。我们证明第一个交易者的头寸价值严格大于第二个交易者的价值。通过模拟研究对结果进行了分析，并推广到存在（a）交易者层次结构的情况，以及（b）存在多个成功交易者的情况。",
    "tldr": "在信息不对称的市场中，第一个交易者的头寸价值严格大于第二个交易者的价值。"
}