{
    "title": "Control of Dual-Sourcing Inventory Systems using Recurrent Neural Networks. (arXiv:2201.06126v4 [cs.LG] UPDATED)",
    "abstract": "A key challenge in inventory management is to identify policies that optimally replenish inventory from multiple suppliers. To solve such optimization problems, inventory managers need to decide what quantities to order from each supplier, given the net inventory and outstanding orders, so that the expected backlogging, holding, and sourcing costs are jointly minimized. Inventory management problems have been studied extensively for over 60 years, and yet even basic dual-sourcing problems, in which orders from an expensive supplier arrive faster than orders from a regular supplier, remain intractable in their general form. In addition, there is an emerging need to develop proactive, scalable optimization algorithms that can adjust their recommendations to dynamic demand shifts in a timely fashion. In this work, we approach dual sourcing from a neural network--based optimization lens and incorporate information on inventory dynamics and its replenishment (i.e., control) policies into th",
    "link": "http://arxiv.org/abs/2201.06126",
    "context": "Title: Control of Dual-Sourcing Inventory Systems using Recurrent Neural Networks. (arXiv:2201.06126v4 [cs.LG] UPDATED)\nAbstract: A key challenge in inventory management is to identify policies that optimally replenish inventory from multiple suppliers. To solve such optimization problems, inventory managers need to decide what quantities to order from each supplier, given the net inventory and outstanding orders, so that the expected backlogging, holding, and sourcing costs are jointly minimized. Inventory management problems have been studied extensively for over 60 years, and yet even basic dual-sourcing problems, in which orders from an expensive supplier arrive faster than orders from a regular supplier, remain intractable in their general form. In addition, there is an emerging need to develop proactive, scalable optimization algorithms that can adjust their recommendations to dynamic demand shifts in a timely fashion. In this work, we approach dual sourcing from a neural network--based optimization lens and incorporate information on inventory dynamics and its replenishment (i.e., control) policies into th",
    "path": "papers/22/01/2201.06126.json",
    "total_tokens": 864,
    "translated_title": "采用循环神经网络控制双重供应链库存系统",
    "translated_abstract": "库存管理中一个关键的挑战是识别出最优的从多个供应商重新补充库存的策略。为了解决这类优化问题，库存管理者需要决定从每个供应商订购哪些数量的产品，考虑到净库存和待处理订单，以便同时最小化预期的滞后、持有和调度成本。库存管理问题已经被广泛研究超过60年，然而即使是基本的双重采购问题，在其中一个供应商的订单比另一个供应商的订单要快的情况下，在其一般形式中依然难以解决。此外，还有一个新兴的需求，即开发主动的可扩展优化算法，能够及时地根据动态的需求变化调整其推荐结果。在这项工作中，我们将双重采购问题视为神经网络优化问题，并将库存动态及其补充（即控制）策略的信息融入其中。",
    "tldr": "本论文采用循环神经网络令库存管理者能够更好地决策如何重新补充库存，特别是在考虑多个供应商订单和成本的情况下快速调整需求。",
    "en_tdlr": "This paper proposes using recurrent neural networks to better inform inventory managers how to efficiently replenish inventory from multiple suppliers, in particular in the context of fast-changing demand and various ordering costs."
}