{
    "title": "Cryptocurrency Valuation: An Explainable AI Approach. (arXiv:2201.12893v4 [econ.GN] UPDATED)",
    "abstract": "Currently, there are no convincing proxies for the fundamentals of cryptocurrency assets. We propose a new market-to-fundamental ratio, the price-to-utility (PU) ratio, utilizing unique blockchain accounting methods. We then proxy various existing fundamental-to-market ratios by Bitcoin historical data and find they have little predictive power for short-term bitcoin returns. However, PU ratio effectively predicts long-term bitcoin returns than alternative methods. Furthermore, we verify the explainability of PU ratio using machine learning. Finally, we present an automated trading strategy advised by the PU ratio that outperforms the conventional buy-and-hold and market-timing strategies. Our research contributes to explainable AI in finance from three facets: First, our market-to-fundamental ratio is based on classic monetary theory and the unique UTXO model of Bitcoin accounting rather than ad hoc; Second, the empirical evidence testifies the buy-low and sell-high implications of th",
    "link": "http://arxiv.org/abs/2201.12893",
    "context": "Title: Cryptocurrency Valuation: An Explainable AI Approach. (arXiv:2201.12893v4 [econ.GN] UPDATED)\nAbstract: Currently, there are no convincing proxies for the fundamentals of cryptocurrency assets. We propose a new market-to-fundamental ratio, the price-to-utility (PU) ratio, utilizing unique blockchain accounting methods. We then proxy various existing fundamental-to-market ratios by Bitcoin historical data and find they have little predictive power for short-term bitcoin returns. However, PU ratio effectively predicts long-term bitcoin returns than alternative methods. Furthermore, we verify the explainability of PU ratio using machine learning. Finally, we present an automated trading strategy advised by the PU ratio that outperforms the conventional buy-and-hold and market-timing strategies. Our research contributes to explainable AI in finance from three facets: First, our market-to-fundamental ratio is based on classic monetary theory and the unique UTXO model of Bitcoin accounting rather than ad hoc; Second, the empirical evidence testifies the buy-low and sell-high implications of th",
    "path": "papers/22/01/2201.12893.json",
    "total_tokens": 927,
    "translated_abstract": "目前，没有令人信服的加密货币资产基本面代理。我们提出了一种基于独特的区块链会计方法的市场基本面比率——价格-效用（PU）比率。我们使用比特币历史数据来代理各种现有的基本面-市场比率，并发现它们对短期比特币回报的预测能力很小。然而，PU比率比其他方法更有效地预测长期比特币回报。此外，我们使用机器学习验证了PU比率的可解释性。最后，我们提出了一个根据PU比率指导的自动交易策略，胜过传统的买入持有和市场定时策略。我们的研究从三个方面为金融中的可解释AI做出了贡献：首先，我们的市场基本面比率基于经典货币理论和比特币会计的独特UTXO模型，而不是专门设计的；其次，实证证据证明了买低卖高的含义。",
    "tldr": "该论文提出一种基于价格-效用（PU）比率的加密货币估值方法，该方法有效预测长期比特币回报，并且具有可解释性，同时由此提出的自动交易策略胜过传统的买入持有和市场定时策略。",
    "en_tdlr": "This paper proposes a cryptocurrency valuation method based on the price-to-utility (PU) ratio, which effectively predicts long-term Bitcoin returns and is explainable using machine learning. An automated trading strategy based on the PU ratio is also presented and outperforms traditional buy-and-hold and market-timing strategies."
}