{
    "title": "Hypothesis Testing for Unknown Dynamical Systems and System Anomaly Detection via Autoencoders. (arXiv:2201.12358v2 [cs.LG] UPDATED)",
    "abstract": "We study the hypothesis testing problem for unknown dynamical systems. More specifically, we observe sequential input and output data from a dynamical system with unknown parameters, and we aim to determine whether the collected data is from a null distribution. Such a problem can have many applications. Here we formulate anomaly detection as hypothesis testing where the anomaly is defined through the alternative hypothesis. Consequently, hypothesis testing algorithms can detect faults in real-world systems such as robots, weather, energy systems, and stock markets. Although recent works achieved state-of-the-art performances in these tasks with deep learning models, we show that a careful analysis using hypothesis testing and graphical models can not only justify the effectiveness of autoencoder models, but also lead to a novel neural network design, termed DyAD (DYnamical system Anomaly Detection), with improved performances. We then show that DyAD achieves state-of-the-art performan",
    "link": "http://arxiv.org/abs/2201.12358",
    "context": "Title: Hypothesis Testing for Unknown Dynamical Systems and System Anomaly Detection via Autoencoders. (arXiv:2201.12358v2 [cs.LG] UPDATED)\nAbstract: We study the hypothesis testing problem for unknown dynamical systems. More specifically, we observe sequential input and output data from a dynamical system with unknown parameters, and we aim to determine whether the collected data is from a null distribution. Such a problem can have many applications. Here we formulate anomaly detection as hypothesis testing where the anomaly is defined through the alternative hypothesis. Consequently, hypothesis testing algorithms can detect faults in real-world systems such as robots, weather, energy systems, and stock markets. Although recent works achieved state-of-the-art performances in these tasks with deep learning models, we show that a careful analysis using hypothesis testing and graphical models can not only justify the effectiveness of autoencoder models, but also lead to a novel neural network design, termed DyAD (DYnamical system Anomaly Detection), with improved performances. We then show that DyAD achieves state-of-the-art performan",
    "path": "papers/22/01/2201.12358.json",
    "total_tokens": 833,
    "translated_title": "未知动态系统的假设检验及自编码器进行系统异常检测",
    "translated_abstract": "本文研究了未知动态系统的假设检验问题。具体地，我们观测到具有未知参数的动态系统的连续输入和输出数据，旨在确定收集到的数据是否来自零分布。这样的问题可以有许多应用。我们将异常检测定义为通过备择假设来进行假设检验的一种方法。因此，假设检验算法可以检测机器人、天气、能源系统和股票市场等实际系统中的故障。虽然最近的研究使用深度学习模型在这些任务中取得了最先进的性能，但我们展示了使用假设检验和图模型进行仔细分析，不仅可以证明自编码器模型的有效性，还可以导致一种改进性能的新型神经网络设计，称为DyAD（动态系统异常检测）。然后，我们展示了DyAD取得了最先进的性能。",
    "tldr": "本文研究了未知动态系统的假设检验问题，并将异常检测定义为通过备选假设来进行假设检验。通过假设检验和图模型的分析，提出了一种新的神经网络设计，DyAD，该设计可以用于改进系统异常检测的性能。"
}