{
    "title": "Graph-based Algorithm Unfolding for Energy-aware Power Allocation in Wireless Networks. (arXiv:2201.11799v2 [eess.SY] UPDATED)",
    "abstract": "We develop a novel graph-based trainable framework to maximize the weighted sum energy efficiency (WSEE) for power allocation in wireless communication networks. To address the non-convex nature of the problem, the proposed method consists of modular structures inspired by a classical iterative suboptimal approach and enhanced with learnable components. More precisely, we propose a deep unfolding of the successive concave approximation (SCA) method. In our unfolded SCA (USCA) framework, the originally preset parameters are now learnable via graph convolutional neural networks (GCNs) that directly exploit multi-user channel state information as the underlying graph adjacency matrix. We show the permutation equivariance of the proposed architecture, which is a desirable property for models applied to wireless network data. The USCA framework is trained through a stochastic gradient descent approach using a progressive training strategy. The unsupervised loss is carefully devised to featu",
    "link": "http://arxiv.org/abs/2201.11799",
    "context": "Title: Graph-based Algorithm Unfolding for Energy-aware Power Allocation in Wireless Networks. (arXiv:2201.11799v2 [eess.SY] UPDATED)\nAbstract: We develop a novel graph-based trainable framework to maximize the weighted sum energy efficiency (WSEE) for power allocation in wireless communication networks. To address the non-convex nature of the problem, the proposed method consists of modular structures inspired by a classical iterative suboptimal approach and enhanced with learnable components. More precisely, we propose a deep unfolding of the successive concave approximation (SCA) method. In our unfolded SCA (USCA) framework, the originally preset parameters are now learnable via graph convolutional neural networks (GCNs) that directly exploit multi-user channel state information as the underlying graph adjacency matrix. We show the permutation equivariance of the proposed architecture, which is a desirable property for models applied to wireless network data. The USCA framework is trained through a stochastic gradient descent approach using a progressive training strategy. The unsupervised loss is carefully devised to featu",
    "path": "papers/22/01/2201.11799.json",
    "total_tokens": 907,
    "translated_title": "无线网络能量感知功率分配的基于图算法的展开",
    "translated_abstract": "我们开发了一种新颖的基于图算法的可训练框架，用于最大化无线通信网络功率分配的加权能效比（WSEE）。为了解决问题的非凸性，该方法由受经典迭代次优方法启发的模块化结构组成，并增强了学习组件。更具体地，我们提出了一种连续凸逼近（SCA）方法的深层展开。在我们展开的SCA（USCA）框架中，原来预设的参数现在通过直接利用多用户信道状态信息作为底层图邻接矩阵的图卷积神经网络（GCNs）进行学习。我们展示了所提建筑的置换等变性，这是一个应用于无线网络数据的理想属性。通过渐进训练策略使用随机梯度下降方法训练USCA框架。无监督损失被精心设计为考虑多个位置的相关性。",
    "tldr": "该论文提出了一种基于图的算法用于无线通信网络功率分配的加权能效比最大化，该算法采用模块化结构和图卷积神经网络，可以解决问题的非凸性，并展示了置换等变性。",
    "en_tdlr": "The paper proposes a graph-based algorithm for maximizing the weighted sum energy efficiency for power allocation in wireless communication networks, which addresses the non-convex issue by using a modular structure and graph convolutional neural networks. The proposed architecture shows permutation equivariance, and is trained using stochastic gradient descent with a carefully designed unsupervised loss."
}