{
    "title": "Fine-grained Graph Learning for Multi-view Subspace Clustering. (arXiv:2201.04604v4 [cs.LG] UPDATED)",
    "abstract": "Multi-view subspace clustering (MSC) is a popular unsupervised method by integrating heterogeneous information to reveal the intrinsic clustering structure hidden across views. Usually, MSC methods use graphs (or affinity matrices) fusion to learn a common structure, and further apply graph-based approaches to clustering. Despite progress, most of the methods do not establish the connection between graph learning and clustering. Meanwhile, conventional graph fusion strategies assign coarse-grained weights to combine multi-graph, ignoring the importance of local structure. In this paper, we propose a fine-grained graph learning framework for multi-view subspace clustering (FGL-MSC) to address these issues. To utilize the multi-view information sufficiently, we design a specific graph learning method by introducing graph regularization and a local structure fusion pattern. The main challenge is how to optimize the fine-grained fusion weights while generating the learned graph that fits t",
    "link": "http://arxiv.org/abs/2201.04604",
    "context": "Title: Fine-grained Graph Learning for Multi-view Subspace Clustering. (arXiv:2201.04604v4 [cs.LG] UPDATED)\nAbstract: Multi-view subspace clustering (MSC) is a popular unsupervised method by integrating heterogeneous information to reveal the intrinsic clustering structure hidden across views. Usually, MSC methods use graphs (or affinity matrices) fusion to learn a common structure, and further apply graph-based approaches to clustering. Despite progress, most of the methods do not establish the connection between graph learning and clustering. Meanwhile, conventional graph fusion strategies assign coarse-grained weights to combine multi-graph, ignoring the importance of local structure. In this paper, we propose a fine-grained graph learning framework for multi-view subspace clustering (FGL-MSC) to address these issues. To utilize the multi-view information sufficiently, we design a specific graph learning method by introducing graph regularization and a local structure fusion pattern. The main challenge is how to optimize the fine-grained fusion weights while generating the learned graph that fits t",
    "path": "papers/22/01/2201.04604.json",
    "total_tokens": 881,
    "translated_title": "多视角子空间聚类的细粒度图学习",
    "translated_abstract": "多视角子空间聚类（MSC）是一种通过整合异构信息来揭示不同视角下隐藏的内在聚类结构的一种流行无监督方法。通常，MSC方法使用图（或相似性矩阵）融合来学习一个共同的结构，并进一步应用基于图的方法进行聚类。尽管取得了进展，但大多数方法没有建立图学习和聚类之间的关联。同时，传统的图融合策略将粗粒度权重分配给多图的组合，忽视了局部结构的重要性。在本文中，我们提出了一种针对多视角子空间聚类的细粒度图学习框架（FGL-MSC）来解决这些问题。为了充分利用多视角信息，我们设计了一种特定的图学习方法，引入图正则化和局部结构融合模式。主要挑战是如何在生成适应于聚类的学习图的同时优化细粒度融合权重。",
    "tldr": "本文提出了一种细粒度图学习框架用于多视角子空间聚类，解决了传统方法未建立图学习和聚类之间关联以及忽略局部结构重要性的问题。",
    "en_tdlr": "This paper proposes a fine-grained graph learning framework for multi-view subspace clustering, addressing the issues of the lack of connection between graph learning and clustering, as well as the ignorance of the importance of local structure."
}