{
    "title": "FedComm: Federated Learning as a Medium for Covert Communication. (arXiv:2201.08786v3 [cs.CR] UPDATED)",
    "abstract": "Proposed as a solution to mitigate the privacy implications related to the adoption of deep learning, Federated Learning (FL) enables large numbers of participants to successfully train deep neural networks without having to reveal the actual private training data. To date, a substantial amount of research has investigated the security and privacy properties of FL, resulting in a plethora of innovative attack and defense strategies. This paper thoroughly investigates the communication capabilities of an FL scheme. In particular, we show that a party involved in the FL learning process can use FL as a covert communication medium to send an arbitrary message. We introduce FedComm, a novel multi-system covert-communication technique that enables robust sharing and transfer of targeted payloads within the FL framework. Our extensive theoretical and empirical evaluations show that FedComm provides a stealthy communication channel, with minimal disruptions to the training process. Our experi",
    "link": "http://arxiv.org/abs/2201.08786",
    "context": "Title: FedComm: Federated Learning as a Medium for Covert Communication. (arXiv:2201.08786v3 [cs.CR] UPDATED)\nAbstract: Proposed as a solution to mitigate the privacy implications related to the adoption of deep learning, Federated Learning (FL) enables large numbers of participants to successfully train deep neural networks without having to reveal the actual private training data. To date, a substantial amount of research has investigated the security and privacy properties of FL, resulting in a plethora of innovative attack and defense strategies. This paper thoroughly investigates the communication capabilities of an FL scheme. In particular, we show that a party involved in the FL learning process can use FL as a covert communication medium to send an arbitrary message. We introduce FedComm, a novel multi-system covert-communication technique that enables robust sharing and transfer of targeted payloads within the FL framework. Our extensive theoretical and empirical evaluations show that FedComm provides a stealthy communication channel, with minimal disruptions to the training process. Our experi",
    "path": "papers/22/01/2201.08786.json",
    "total_tokens": 901,
    "translated_title": "FedComm: 基于联邦学习的隐蔽通信方法研究",
    "translated_abstract": "为了减轻深度学习带来的隐私问题，联邦学习（FL）被提出作为一种解决方案，大量参与者能够成功训练深度神经网络，无需向外界透露私密训练数据。本文深入探究了FL方案的通信能力，并提出了FedComm，一种多系统隐蔽通信技术，能够在FL框架内稳健地共享和传输有针对性的负载。我们的理论和实证评估表明，FedComm提供了一个隐蔽的通信通道，对训练过程的干扰最小。实验结果表明，FedComm实现了高传输速率和低检测率，是实际场景中隐蔽通信的有前景的候选方法。",
    "tldr": "本文探究了联邦学习作为隐蔽通信媒介的可能性，提出了一种名为FedComm的隐蔽通信技术，其有效地实现了在FL框架内共享和传输有针对性的负载，使得通信更为隐蔽，且技术检测困难。"
}