{
    "title": "Reputation, Learning and Project Choice in Frictional Economies. (arXiv:2201.01813v3 [econ.TH] UPDATED)",
    "abstract": "I introduce a dynamic model of learning and random meetings between a long-lived agent with unknown ability and heterogeneous projects with observable qualities. The outcomes of the agent's matches with the projects determine her posterior belief about her ability (i.e., her reputation). In a self-type learning framework with endogenous outside option, I find the optimal project selection strategy of the agent, that determines what types of projects the agent with a certain level of reputation will accept. Sections of the optimal matching set become increasing intervals, with different cutoffs across different types of the projects. Increasing the meeting rate has asymmetric effects on the sections of the matching sets: it unambiguously expands the section for the high type projects, while on some regions, it initially expands and then shrinks the section of the low type projects.",
    "link": "http://arxiv.org/abs/2201.01813",
    "context": "Title: Reputation, Learning and Project Choice in Frictional Economies. (arXiv:2201.01813v3 [econ.TH] UPDATED)\nAbstract: I introduce a dynamic model of learning and random meetings between a long-lived agent with unknown ability and heterogeneous projects with observable qualities. The outcomes of the agent's matches with the projects determine her posterior belief about her ability (i.e., her reputation). In a self-type learning framework with endogenous outside option, I find the optimal project selection strategy of the agent, that determines what types of projects the agent with a certain level of reputation will accept. Sections of the optimal matching set become increasing intervals, with different cutoffs across different types of the projects. Increasing the meeting rate has asymmetric effects on the sections of the matching sets: it unambiguously expands the section for the high type projects, while on some regions, it initially expands and then shrinks the section of the low type projects.",
    "path": "papers/22/01/2201.01813.json",
    "total_tokens": 864,
    "translated_title": "声誉、学习和摩擦经济中的项目选择",
    "translated_abstract": "我引入了一个动态的学习模型，涉及到一个长寿命智力未知的代理者与可观察品质的异质项目之间的随机匹配。代理者与项目的匹配结果决定了她对自己智力的后验信念（即声誉）。在一个自身类型学习框架中，外生选择是内生化的，我找到了代理者的最优项目选择策略，这决定了代理者在一定声誉水平下接受哪些类型的项目。最优匹配集的一些部分成为不断增加的区间，在不同类型的项目之间有不同的截止点。增加会面率对匹配集的不同部分有不对称的影响：它明确扩大高质量项目的部分，而对于低质量项目的某些区域，它会开始扩大然后缩小匹配集。",
    "tldr": "该论文提出了一个动态学习模型，研究了智力未知的代理者与不同质量项目之间的匹配。研究发现增加会面率会扩大高质量项目的选择，而对于低质量项目在某些区域会先扩大再缩小。",
    "en_tdlr": "This paper proposes a dynamic learning model that investigates the matching of an agent with unknown ability and heterogeneous projects. It finds that increasing meeting rates expands the selection of high quality projects, but may initially expand and then shrink the selection of low quality projects in some regions."
}