{
    "title": "Continuous-time Markowitz's mean-variance model under different borrowing and saving rates. (arXiv:2201.00914v2 [q-fin.MF] UPDATED)",
    "abstract": "We study Markowitz's mean-variance portfolio selection problem in a continuous-time Black-Scholes market with different borrowing and saving rates. The associated Hamilton-Jacobi-Bellman equation is fully nonlinear. Using a delicate partial differential equation and verification argument, the value function is proven to be $C^{3,2}$ smooth. It is also shown that there are a borrowing boundary and a saving barrier which divide the entire trading area into a borrowing-money region, an all-in-stock region, and a saving-money region in ascending order. The optimal trading strategy is a mixture of continuous-time strategy (as suggested by most continuous-time models) and discontinuous-time strategy (as suggested by models with transaction costs): one should put all her wealth in the stock in the middle all-in-stock region, and continuously trade it in the other two regions in a feedback form of wealth and time. It is never optimal to short sale the stock. Numerical examples are also present",
    "link": "http://arxiv.org/abs/2201.00914",
    "context": "Title: Continuous-time Markowitz's mean-variance model under different borrowing and saving rates. (arXiv:2201.00914v2 [q-fin.MF] UPDATED)\nAbstract: We study Markowitz's mean-variance portfolio selection problem in a continuous-time Black-Scholes market with different borrowing and saving rates. The associated Hamilton-Jacobi-Bellman equation is fully nonlinear. Using a delicate partial differential equation and verification argument, the value function is proven to be $C^{3,2}$ smooth. It is also shown that there are a borrowing boundary and a saving barrier which divide the entire trading area into a borrowing-money region, an all-in-stock region, and a saving-money region in ascending order. The optimal trading strategy is a mixture of continuous-time strategy (as suggested by most continuous-time models) and discontinuous-time strategy (as suggested by models with transaction costs): one should put all her wealth in the stock in the middle all-in-stock region, and continuously trade it in the other two regions in a feedback form of wealth and time. It is never optimal to short sale the stock. Numerical examples are also present",
    "path": "papers/22/01/2201.00914.json",
    "total_tokens": 1026,
    "translated_title": "不同借贷与储蓄利率下的连续时间马科维茨平均方差模型",
    "translated_abstract": "本文研究了连续时间下与不同借贷和储蓄利率相关的黑-斯科尔斯市场中的马科维茨平均方差组合选择问题。相关的哈密尔顿-雅可比-贝尔曼方程是完全非线性的。通过使用微妙的偏微分方程和验证论证，证明了价值函数是$C^{3,2}$光滑的。同时，证明了存在一个借贷边界和一个储蓄壁垒，将整个交易区域分为逐渐增长的借钱区域、全仓股票区域和储蓄钱区域。最优交易策略是连续时间交易策略（由大多数连续时间模型建议）和不连续时间交易策略（由具有交易成本模型建议）的混合：在中间的全仓股票区域中，应该把所有的财富都投入到股票中，并在其他两个区域中不断以财富和时间的反馈形式进行交易。卖空股票永远不是最优策略。同时还给出了一些数值例子。",
    "tldr": "本文就连续时间下不同借贷与储蓄利率的黑-斯科尔斯市场中马科维茨平均方差组合选择问题进行了研究，结果发现最优交易策略是连续时间交易策略和不连续时间交易策略的混合，其中卖空股票永远不是最优策略。",
    "en_tdlr": "This paper studies the Markowitz mean-variance portfolio selection problem in a continuous-time Black-Scholes market with different borrowing and saving rates, revealing the optimal trading strategy as a mixture of continuous-time and discontinuous-time strategies and proving that short selling the stock is never optimal."
}