{
    "title": "Compactness Score: A Fast Filter Method for Unsupervised Feature Selection. (arXiv:2201.13194v3 [cs.LG] UPDATED)",
    "abstract": "Along with the flourish of the information age, massive amounts of data are generated day by day. Due to the large-scale and high-dimensional characteristics of these data, it is often difficult to achieve better decision-making in practical applications. Therefore, an efficient big data analytics method is urgently needed. For feature engineering, feature selection seems to be an important research content in which is anticipated to select \"excellent\" features from candidate ones. Different functions can be realized through feature selection, such as dimensionality reduction, model effect improvement, and model performance improvement. In many classification tasks, researchers found that data seem to be usually close to each other if they are from the same class; thus, local compactness is of great importance for the evaluation of a feature. In this manuscript, we propose a fast unsupervised feature selection method, named as, Compactness Score (CSUFS), to select desired features. To ",
    "link": "http://arxiv.org/abs/2201.13194",
    "context": "Title: Compactness Score: A Fast Filter Method for Unsupervised Feature Selection. (arXiv:2201.13194v3 [cs.LG] UPDATED)\nAbstract: Along with the flourish of the information age, massive amounts of data are generated day by day. Due to the large-scale and high-dimensional characteristics of these data, it is often difficult to achieve better decision-making in practical applications. Therefore, an efficient big data analytics method is urgently needed. For feature engineering, feature selection seems to be an important research content in which is anticipated to select \"excellent\" features from candidate ones. Different functions can be realized through feature selection, such as dimensionality reduction, model effect improvement, and model performance improvement. In many classification tasks, researchers found that data seem to be usually close to each other if they are from the same class; thus, local compactness is of great importance for the evaluation of a feature. In this manuscript, we propose a fast unsupervised feature selection method, named as, Compactness Score (CSUFS), to select desired features. To ",
    "path": "papers/22/01/2201.13194.json",
    "total_tokens": 877,
    "translated_title": "紧密度分数：一种用于无监督特征选择的快速过滤方法",
    "translated_abstract": "随着信息时代的兴起，每天产生了大量的数据。由于这些数据的大规模和高维特性，往往难以在实际应用中实现更好的决策。因此，急需一种高效的大数据分析方法。对于特征工程，特征选择似乎是一个重要的研究内容，其中预计从候选特征中选择“优秀”的特征。特征选择可以实现不同的功能，如降维、模型效果提高和模型性能提高。在许多分类任务中，研究人员发现，如果数据来自同一类别，则这些数据似乎通常彼此接近；因此，局部紧密度对于特征的评估非常重要。在本文中，我们提出了一种快速的无监督特征选择方法，名为紧密度分数（CSUFS），用于选择所需特征。",
    "tldr": "本文提出了一种快速的无监督特征选择方法，名为紧密度分数（CSUFS），通过评估局部紧密度来选择所需特征，能够实现降维、模型效果提高和模型性能提高等功能。"
}