{
    "title": "CPTAM: Constituency Parse Tree Aggregation Method. (arXiv:2201.07905v2 [cs.CL] UPDATED)",
    "abstract": "Diverse Natural Language Processing tasks employ constituency parsing to understand the syntactic structure of a sentence according to a phrase structure grammar. Many state-of-the-art constituency parsers are proposed, but they may provide different results for the same sentences, especially for corpora outside their training domains. This paper adopts the truth discovery idea to aggregate constituency parse trees from different parsers by estimating their reliability in the absence of ground truth. Our goal is to consistently obtain high-quality aggregated constituency parse trees. We formulate the constituency parse tree aggregation problem in two steps, structure aggregation and constituent label aggregation. Specifically, we propose the first truth discovery solution for tree structures by minimizing the weighted sum of Robinson-Foulds (RF) distances, a classic symmetric distance metric between two trees. Extensive experiments are conducted on benchmark datasets in different langu",
    "link": "http://arxiv.org/abs/2201.07905",
    "context": "Title: CPTAM: Constituency Parse Tree Aggregation Method. (arXiv:2201.07905v2 [cs.CL] UPDATED)\nAbstract: Diverse Natural Language Processing tasks employ constituency parsing to understand the syntactic structure of a sentence according to a phrase structure grammar. Many state-of-the-art constituency parsers are proposed, but they may provide different results for the same sentences, especially for corpora outside their training domains. This paper adopts the truth discovery idea to aggregate constituency parse trees from different parsers by estimating their reliability in the absence of ground truth. Our goal is to consistently obtain high-quality aggregated constituency parse trees. We formulate the constituency parse tree aggregation problem in two steps, structure aggregation and constituent label aggregation. Specifically, we propose the first truth discovery solution for tree structures by minimizing the weighted sum of Robinson-Foulds (RF) distances, a classic symmetric distance metric between two trees. Extensive experiments are conducted on benchmark datasets in different langu",
    "path": "papers/22/01/2201.07905.json",
    "total_tokens": 922,
    "translated_title": "CPTAM: 依存句法树聚合方法",
    "translated_abstract": "许多自然语言处理任务使用依存句法分析来根据短语结构语法理解句子的句法结构。许多最先进的依存句法分析器已被提出，但它们对于相同的句子可能会提供不同的结果，特别是对于训练领域之外的语料库。本文采用真实性发现的思想，通过估计不同解析器的可靠性来聚合来自不同解析器的依存句法树，以持续获得高质量的聚合依存句法树。我们将依存句法树聚合问题分为两个步骤：结构聚合和成分标签聚合。具体地，我们提出了第一个用于树结构的真实性发现解决方案，通过最小化两个树之间的经典对称距离度量，即罗宾逊-福尔兹距离的加权和。对不同语言的基准数据集进行了广泛的实验。",
    "tldr": "本文提出了一种依存句法树聚合方法，通过估计不同解析器的可靠性，以持续获得高质量的聚合依存句法树。具体来说，通过最小化树之间的经典对称距离度量，罗宾逊-福尔兹距离的加权和，实现了树结构的真实性发现。",
    "en_tdlr": "This paper proposes a constituency parse tree aggregation method that consistently obtains high-quality aggregated trees by estimating the reliability of different parsers. Specifically, it achieves tree structure truth discovery by minimizing the weighted sum of Robinson-Foulds distances, a classic symmetric distance metric between trees."
}