{
    "title": "Dynamic Risk Measurement by EVT based on Stochastic Volatility models via MCMC. (arXiv:2201.09434v4 [stat.AP] UPDATED)",
    "abstract": "This paper aims to characterize the typical factual characteristics of financial market returns and volatility and address the problem that the tail characteristics of asset returns have been not sufficiently considered, as an attempt to more effectively avoid risks and productively manage stock market risks. Thus, in this paper, the fat-tailed distribution and the leverage effect are introduced into the SV model. Next, the model parameters are estimated through MCMC. Subsequently, the fat-tailed distribution of financial market returns is comprehensively characterized and then incorporated with extreme value theory to fit the tail distribution of standard residuals. Afterward, a new financial risk measurement model is built, which is termed the SV-EVT-VaR-based dynamic model. With the use of daily S&P 500 index and simulated returns, the empirical results are achieved, which reveal that the SV-EVT-based models can outperform other models for out-of-sample data in backtesting and depic",
    "link": "http://arxiv.org/abs/2201.09434",
    "context": "Title: Dynamic Risk Measurement by EVT based on Stochastic Volatility models via MCMC. (arXiv:2201.09434v4 [stat.AP] UPDATED)\nAbstract: This paper aims to characterize the typical factual characteristics of financial market returns and volatility and address the problem that the tail characteristics of asset returns have been not sufficiently considered, as an attempt to more effectively avoid risks and productively manage stock market risks. Thus, in this paper, the fat-tailed distribution and the leverage effect are introduced into the SV model. Next, the model parameters are estimated through MCMC. Subsequently, the fat-tailed distribution of financial market returns is comprehensively characterized and then incorporated with extreme value theory to fit the tail distribution of standard residuals. Afterward, a new financial risk measurement model is built, which is termed the SV-EVT-VaR-based dynamic model. With the use of daily S&P 500 index and simulated returns, the empirical results are achieved, which reveal that the SV-EVT-based models can outperform other models for out-of-sample data in backtesting and depic",
    "path": "papers/22/01/2201.09434.json",
    "total_tokens": 864,
    "translated_title": "通过MCMC基于随机波动模型的EVT动态风险测量",
    "translated_abstract": "本文旨在描述金融市场回报和波动性的典型事实特征，并解决资产回报的尾部特征未被充分考虑的问题，以更有效地避免风险和生产性地管理股票市场风险。因此，本文将重尾分布和杠杆效应引入SV模型。然后，通过MCMC估算模型参数。随后，全面描述了金融市场回报的重尾分布，并将其与极值理论相结合，以拟合标准残差的尾部分布。其后，建立了一种新的金融风险测量模型，称为SV-EVT-VaR动态模型。通过使用每日的标普500指数和模拟回报，达成了实证结果，揭示了SV-EVT模型在外样本回测中可以优于其他模型。",
    "tldr": "本文介绍了一种基于随机波动模型和极值理论的动态风险测量模型，结合重尾分布和杠杆效应，能够更有效地避免金融风险。",
    "en_tdlr": "This paper proposes a dynamic risk measurement model based on stochastic volatility models and extreme value theory, which incorporates fat-tailed distribution and leverage effect to more effectively manage financial risks. The model outperforms other models in out-of-sample data in backtesting."
}