{
    "title": "SMGRL: Scalable Multi-resolution Graph Representation Learning. (arXiv:2201.12670v3 [cs.LG] UPDATED)",
    "abstract": "Graph convolutional networks (GCNs) allow us to learn topologically-aware node embeddings, which can be useful for classification or link prediction. However, they are unable to capture long-range dependencies between nodes without adding additional layers -- which in turn leads to over-smoothing and increased time and space complexity. Further, the complex dependencies between nodes make mini-batching challenging, limiting their applicability to large graphs. We propose a Scalable Multi-resolution Graph Representation Learning (SMGRL) framework that enables us to learn multi-resolution node embeddings efficiently. Our framework is model-agnostic and can be applied to any existing GCN model. We dramatically reduce training costs by training only on a reduced-dimension coarsening of the original graph, then exploit self-similarity to apply the resulting algorithm at multiple resolutions. The resulting multi-resolution embeddings can be aggregated to yield high-quality node embeddings th",
    "link": "http://arxiv.org/abs/2201.12670",
    "context": "Title: SMGRL: Scalable Multi-resolution Graph Representation Learning. (arXiv:2201.12670v3 [cs.LG] UPDATED)\nAbstract: Graph convolutional networks (GCNs) allow us to learn topologically-aware node embeddings, which can be useful for classification or link prediction. However, they are unable to capture long-range dependencies between nodes without adding additional layers -- which in turn leads to over-smoothing and increased time and space complexity. Further, the complex dependencies between nodes make mini-batching challenging, limiting their applicability to large graphs. We propose a Scalable Multi-resolution Graph Representation Learning (SMGRL) framework that enables us to learn multi-resolution node embeddings efficiently. Our framework is model-agnostic and can be applied to any existing GCN model. We dramatically reduce training costs by training only on a reduced-dimension coarsening of the original graph, then exploit self-similarity to apply the resulting algorithm at multiple resolutions. The resulting multi-resolution embeddings can be aggregated to yield high-quality node embeddings th",
    "path": "papers/22/01/2201.12670.json",
    "total_tokens": 905,
    "translated_title": "SMGRL：可扩展的多分辨率图表示学习",
    "translated_abstract": "图卷积网络（GCN）可以用于学习具有拓扑感知能力的节点嵌入，对于分类或链接预测非常有用。然而，它们无法捕捉节点之间的长程依赖关系，除非添加额外的层次——而这又导致过度平滑和时间空间复杂度增加。此外，节点之间的复杂依赖关系使得小批量处理变得困难，限制了它们在大型图上的适用性。我们提出了一个可扩展的多分辨率图表示学习（SMGRL）框架，使我们能够高效地学习多分辨率节点嵌入。我们的框架与模型无关，可以应用于任何现有的GCN模型。通过仅在原始图的降维粗化上进行训练，然后利用自相似性在多个分辨率上应用所得算法，我们显著降低了训练成本。最终的多分辨率嵌入可以聚合以产生高质量的节点嵌入。",
    "tldr": "本论文提出了一个可扩展的多分辨率图表示学习框架（SMGRL），通过降低训练成本和利用自相似性在多个分辨率上应用算法，能够高效地学习多分辨率节点嵌入。",
    "en_tdlr": "This paper proposes a scalable multi-resolution graph representation learning framework (SMGRL), which efficiently learns multi-resolution node embeddings by reducing training costs and applying algorithms at multiple resolutions using self-similarity."
}