{
    "title": "Fat Tails and Optimal Liability Driven Portfolios. (arXiv:2201.10846v3 [q-fin.PM] UPDATED)",
    "abstract": "We look at optimal liability-driven portfolios in a family of fat-tailed and extremal risk measures, especially in the context of pension fund and insurance fixed cashflow liability profiles, but also those arising in derivatives books such as delta one books or options books in the presence of stochastic volatilities. In the extremal limit, we recover a new tail risk measure, Extreme Deviation (XD), an extremal risk measure significantly more sensitive to extremal returns than CVaR. Resulting optimal portfolios optimize the return per unit of XD, with portfolio weights consisting of a liability hedging contribution, and a risk contribution seeking to generate positive risk-adjusted return. The resulting allocations are analyzed qualitatively and quantitatively in a number of different limits.",
    "link": "http://arxiv.org/abs/2201.10846",
    "context": "Title: Fat Tails and Optimal Liability Driven Portfolios. (arXiv:2201.10846v3 [q-fin.PM] UPDATED)\nAbstract: We look at optimal liability-driven portfolios in a family of fat-tailed and extremal risk measures, especially in the context of pension fund and insurance fixed cashflow liability profiles, but also those arising in derivatives books such as delta one books or options books in the presence of stochastic volatilities. In the extremal limit, we recover a new tail risk measure, Extreme Deviation (XD), an extremal risk measure significantly more sensitive to extremal returns than CVaR. Resulting optimal portfolios optimize the return per unit of XD, with portfolio weights consisting of a liability hedging contribution, and a risk contribution seeking to generate positive risk-adjusted return. The resulting allocations are analyzed qualitatively and quantitatively in a number of different limits.",
    "path": "papers/22/01/2201.10846.json",
    "total_tokens": 862,
    "translated_title": "Fat Tails和最优负责任驱动投资组合",
    "translated_abstract": "我们研究了一系列重尾风险度量下的最优负责任驱动投资组合，尤其是在养老基金和保险固定现金流义务配置方面，但也包括在衍生品交易中出现的数据一交易或存在随机波动率的期权交易。在极值极限下，我们得出了一个新的尾部风险度量，即“极端偏差”(XD)，这是一个比条件风险价值更加敏感的极值风险度量。最优组合将优化每单位的XD回报，其中投资比重包括对冲义务贡献和寻求产生正的风险调整回报的风险贡献。所得到的资产分配在多种不同限制条件下进行了质量和数量分析。",
    "tldr": "研究了一系列重尾风险度量下的最优负责任驱动投资组合，提出了一种比条件风险价值更加敏感的新的极值风险度量，即“极端偏差”(XD)，最优组合将优化每单位的XD回报。",
    "en_tdlr": "This paper studies optimal liability-driven portfolios under a family of fat-tailed and extremal risk measures. A new tail risk measure, Extreme Deviation (XD), is proposed, which is significantly more sensitive to extremal returns than CVaR. The resulting optimal portfolios aim to maximize the return per unit of XD, with portfolio weights consisting of a liability hedging contribution and a risk contribution seeking to generate positive risk-adjusted return."
}