{
    "title": "Grammatical cues to subjecthood are redundant in a majority of simple clauses across languages. (arXiv:2201.12911v3 [cs.CL] UPDATED)",
    "abstract": "Grammatical cues are sometimes redundant with word meanings in natural language. For instance, English word order rules constrain the word order of a sentence like \"The dog chewed the bone\" even though the status of \"dog\" as subject and \"bone\" as object can be inferred from world knowledge and plausibility. Quantifying how often this redundancy occurs, and how the level of redundancy varies across typologically diverse languages, can shed light on the function and evolution of grammar. To that end, we performed a behavioral experiment in English and Russian and a cross-linguistic computational analysis measuring the redundancy of grammatical cues in transitive clauses extracted from corpus text. English and Russian speakers (n=484) were presented with subjects, verbs, and objects (in random order and with morphological markings removed) extracted from naturally occurring sentences and were asked to identify which noun is the subject of the action. Accuracy was high in both languages (~",
    "link": "http://arxiv.org/abs/2201.12911",
    "context": "Title: Grammatical cues to subjecthood are redundant in a majority of simple clauses across languages. (arXiv:2201.12911v3 [cs.CL] UPDATED)\nAbstract: Grammatical cues are sometimes redundant with word meanings in natural language. For instance, English word order rules constrain the word order of a sentence like \"The dog chewed the bone\" even though the status of \"dog\" as subject and \"bone\" as object can be inferred from world knowledge and plausibility. Quantifying how often this redundancy occurs, and how the level of redundancy varies across typologically diverse languages, can shed light on the function and evolution of grammar. To that end, we performed a behavioral experiment in English and Russian and a cross-linguistic computational analysis measuring the redundancy of grammatical cues in transitive clauses extracted from corpus text. English and Russian speakers (n=484) were presented with subjects, verbs, and objects (in random order and with morphological markings removed) extracted from naturally occurring sentences and were asked to identify which noun is the subject of the action. Accuracy was high in both languages (~",
    "path": "papers/22/01/2201.12911.json",
    "total_tokens": 915,
    "translated_title": "跨语言情况下，大多数简单从句中的语法线索是多余的",
    "translated_abstract": "在自然语言中，语法线索有时与词义重复。例如，英语的词序规则限制了句子的词序，即使可以从世界知识和可信性推断出\"dog\"作为主语，\"bone\"作为宾语的状态。量化这种冗余的发生频率，以及冗余水平在不同类型的语言中如何变化，可以揭示语法的功能和演化。为此，我们在英语和俄语中进行了一项行为实验，并进行了跨语言的计算分析，测量从语料库文本中提取的及物从句中语法线索的冗余程度。英语和俄语的参与者（n = 484）被呈现由自然发生的句子中提取的主语、动词和宾语（以随机顺序和删除形态标记），并被要求确定哪个名词是行为的主语。两种语言的准确率都很高（〜",
    "tldr": "借助语法线索来确定句子的主语在大多数简单从句中是多余的，这个冗余性在跨语言中也存在。在这项研究中，通过行为实验和计算分析，我们发现这种冗余性的发生频率很高，这有助于揭示语法的功能和演化。"
}