{
    "title": "Partition-Based Active Learning for Graph Neural Networks. (arXiv:2201.09391v2 [cs.LG] UPDATED)",
    "abstract": "We study the problem of semi-supervised learning with Graph Neural Networks (GNNs) in an active learning setup. We propose GraphPart, a novel partition-based active learning approach for GNNs. GraphPart first splits the graph into disjoint partitions and then selects representative nodes within each partition to query. The proposed method is motivated by a novel analysis of the classification error under realistic smoothness assumptions over the graph and the node features. Extensive experiments on multiple benchmark datasets demonstrate that the proposed method outperforms existing active learning methods for GNNs under a wide range of annotation budget constraints. In addition, the proposed method does not introduce additional hyperparameters, which is crucial for model training, especially in the active learning setting where a labeled validation set may not be available.",
    "link": "http://arxiv.org/abs/2201.09391",
    "context": "Title: Partition-Based Active Learning for Graph Neural Networks. (arXiv:2201.09391v2 [cs.LG] UPDATED)\nAbstract: We study the problem of semi-supervised learning with Graph Neural Networks (GNNs) in an active learning setup. We propose GraphPart, a novel partition-based active learning approach for GNNs. GraphPart first splits the graph into disjoint partitions and then selects representative nodes within each partition to query. The proposed method is motivated by a novel analysis of the classification error under realistic smoothness assumptions over the graph and the node features. Extensive experiments on multiple benchmark datasets demonstrate that the proposed method outperforms existing active learning methods for GNNs under a wide range of annotation budget constraints. In addition, the proposed method does not introduce additional hyperparameters, which is crucial for model training, especially in the active learning setting where a labeled validation set may not be available.",
    "path": "papers/22/01/2201.09391.json",
    "total_tokens": 804,
    "translated_title": "基于分区的图神经网络主动学习方法研究",
    "translated_abstract": "我们研究了在主动学习设置下，使用图神经网络（GNNs）进行半监督学习的问题。我们提出了一种新的基于分区的GNN主动学习方法GraphPart。GraphPart首先将图分成不相交的子图，然后在每个子图中选择代表性节点进行查询。所提出的方法是基于图和节点特征下的现实平滑假设的分类误差的新颖分析。对多个基准数据集的广泛实验表明，该方法在各种注释预算约束下，优于现有的GNN主动学习方法。此外，该方法不会引入额外的超参数，这对于模型训练尤为重要，特别是在没有标记验证集的主动学习设置下。",
    "tldr": "本文提出了一种基于分区的图神经网络主动学习方法GraphPart，该方法在不引入额外超参数的情况下，在多个基准数据集上显著优于现有主动学习方法，并且在不同的注释预算约束下性能稳定。",
    "en_tdlr": "This paper proposes a partition-based active learning approach for Graph Neural Networks (GNNs) called GraphPart, which outperforms existing methods on multiple benchmark datasets and does not introduce additional hyperparameters, making it suitable for active learning settings without a labeled validation set."
}