{
    "title": "A Probabilistic Graph Coupling View of Dimension Reduction. (arXiv:2201.13053v3 [math.PR] UPDATED)",
    "abstract": "Most popular dimension reduction (DR) methods like t-SNE and UMAP are based on minimizing a cost between input and latent pairwise similarities. Though widely used, these approaches lack clear probabilistic foundations to enable a full understanding of their properties and limitations. To that extent, we introduce a unifying statistical framework based on the coupling of hidden graphs using cross entropy. These graphs induce a Markov random field dependency structure among the observations in both input and latent spaces. We show that existing pairwise similarity DR methods can be retrieved from our framework with particular choices of priors for the graphs. Moreover this reveals that these methods suffer from a statistical deficiency that explains poor performances in conserving coarse-grain dependencies. Our model is leveraged and extended to address this issue while new links are drawn with Laplacian eigenmaps and PCA.",
    "link": "http://arxiv.org/abs/2201.13053",
    "context": "Title: A Probabilistic Graph Coupling View of Dimension Reduction. (arXiv:2201.13053v3 [math.PR] UPDATED)\nAbstract: Most popular dimension reduction (DR) methods like t-SNE and UMAP are based on minimizing a cost between input and latent pairwise similarities. Though widely used, these approaches lack clear probabilistic foundations to enable a full understanding of their properties and limitations. To that extent, we introduce a unifying statistical framework based on the coupling of hidden graphs using cross entropy. These graphs induce a Markov random field dependency structure among the observations in both input and latent spaces. We show that existing pairwise similarity DR methods can be retrieved from our framework with particular choices of priors for the graphs. Moreover this reveals that these methods suffer from a statistical deficiency that explains poor performances in conserving coarse-grain dependencies. Our model is leveraged and extended to address this issue while new links are drawn with Laplacian eigenmaps and PCA.",
    "path": "papers/22/01/2201.13053.json",
    "total_tokens": 899,
    "translated_title": "降维的概率图耦合视角",
    "translated_abstract": "大多数流行的降维方法（如t-SNE和UMAP）基于最小化输入和潜在空间中成对相似度之间的成本。尽管被广泛使用，但这些方法缺乏清晰的概率基础，无法完全理解它们的属性和局限性。为此，我们引入了一个基于交叉熵的隐藏图耦合的统一统计框架。这些图在输入空间和潜在空间中的观测之间引入了马尔科夫随机场依赖结构。我们展示了现有的成对相似度降维方法可以从我们的框架中通过对图的先验进行特定选择来检索。此外，这揭示了这些方法在保留粗粒度依赖性方面存在统计上的不足，从而解释了性能的不佳。我们利用和扩展了我们的模型以解决这个问题，并将其与拉普拉斯特征映射和PCA建立了新的联系。",
    "tldr": "本文提出了一个基于图耦合的概率统计框架，来统一理解不同的降维方法，并发现现有方法在保留粗粒度依赖性方面存在统计不足。通过对模型进行改进和扩展，我们能够解决这个问题，并与其他降维方法建立了新的联系。",
    "en_tdlr": "This paper introduces a probabilistic graph coupling framework to unify the understanding of different dimension reduction methods and reveals the statistical deficiency in existing methods for preserving coarse-grain dependencies. By improving and extending the model, this issue can be addressed and new connections are made with other dimension reduction methods."
}