{
    "title": "Homophily in preferences or meetings? Identifying and estimating an iterative network formation model. (arXiv:2201.06694v3 [econ.EM] UPDATED)",
    "abstract": "Is homophily in social and economic networks driven by a taste for homogeneity (preferences) or by a higher probability of meeting individuals with similar attributes (opportunity)? This paper studies identification and estimation of an iterative network game that distinguishes between these two mechanisms. Our approach enables us to assess the counterfactual effects of changing the meeting protocol between agents. As an application, we study the role of preferences and meetings in shaping classroom friendship networks in Brazil. In a network structure in which homophily due to preferences is stronger than homophily due to meeting opportunities, tracking students may improve welfare. Still, the relative benefit of this policy diminishes over the school year.",
    "link": "http://arxiv.org/abs/2201.06694",
    "context": "Title: Homophily in preferences or meetings? Identifying and estimating an iterative network formation model. (arXiv:2201.06694v3 [econ.EM] UPDATED)\nAbstract: Is homophily in social and economic networks driven by a taste for homogeneity (preferences) or by a higher probability of meeting individuals with similar attributes (opportunity)? This paper studies identification and estimation of an iterative network game that distinguishes between these two mechanisms. Our approach enables us to assess the counterfactual effects of changing the meeting protocol between agents. As an application, we study the role of preferences and meetings in shaping classroom friendship networks in Brazil. In a network structure in which homophily due to preferences is stronger than homophily due to meeting opportunities, tracking students may improve welfare. Still, the relative benefit of this policy diminishes over the school year.",
    "path": "papers/22/01/2201.06694.json",
    "total_tokens": 870,
    "translated_title": "偏好或相遇中的同质性？识别并估计一种迭代网络形成模型。",
    "translated_abstract": "社交和经济网络中的同质性是由于对同质性（偏好）的偏好还是更可能遇到具有类似属性的个体（机会）驱动的？本文研究了一种迭代网络游戏的识别和估计方法，可区分这两种机制。我们的方法使我们能够评估改变代理人之间会议协议的反事实效应。作为一种应用，我们研究偏好和会议在塑造巴西的课堂友谊网络中的作用。在一种网络结构中，由于偏好而产生的同质性比由于会议机会而产生的同质性更强，追踪学生可能会提高福利。然而，这项政策的相对效益随着学年的推移而减弱。",
    "tldr": "本文讨论同质性在社交和经济网络中产生的机制，提出了一种区分偏好和机会的迭代网络游戏的方法，并且进行了应用研究，发现偏好的同质性比机会的同质性更强，追踪学生可能会提高福利，但是效益随着时间推移而减弱。",
    "en_tdlr": "This paper discusses the mechanism of homophily in social and economic networks, proposes a method to distinguish preferences and opportunities through an iterative network game, conducts an applied study, and finds that homophily due to preferences is stronger than homophily due to meeting opportunities, and tracking students may improve welfare but the benefit diminishes over time."
}