{
    "title": "CFU Playground: Full-Stack Open-Source Framework for Tiny Machine Learning (tinyML) Acceleration on FPGAs. (arXiv:2201.01863v3 [cs.LG] UPDATED)",
    "abstract": "Need for the efficient processing of neural networks has given rise to the development of hardware accelerators. The increased adoption of specialized hardware has highlighted the need for more agile design flows for hardware-software co-design and domain-specific optimizations. In this paper, we present CFU Playground: a full-stack open-source framework that enables rapid and iterative design and evaluation of machine learning (ML) accelerators for embedded ML systems. Our tool provides a completely open-source end-to-end flow for hardware-software co-design on FPGAs and future systems research. This full-stack framework gives the users access to explore experimental and bespoke architectures that are customized and co-optimized for embedded ML. Our rapid, deploy-profile-optimization feedback loop lets ML hardware and software developers achieve significant returns out of a relatively small investment in customization. Using CFU Playground's design and evaluation loop, we show substan",
    "link": "http://arxiv.org/abs/2201.01863",
    "context": "Title: CFU Playground: Full-Stack Open-Source Framework for Tiny Machine Learning (tinyML) Acceleration on FPGAs. (arXiv:2201.01863v3 [cs.LG] UPDATED)\nAbstract: Need for the efficient processing of neural networks has given rise to the development of hardware accelerators. The increased adoption of specialized hardware has highlighted the need for more agile design flows for hardware-software co-design and domain-specific optimizations. In this paper, we present CFU Playground: a full-stack open-source framework that enables rapid and iterative design and evaluation of machine learning (ML) accelerators for embedded ML systems. Our tool provides a completely open-source end-to-end flow for hardware-software co-design on FPGAs and future systems research. This full-stack framework gives the users access to explore experimental and bespoke architectures that are customized and co-optimized for embedded ML. Our rapid, deploy-profile-optimization feedback loop lets ML hardware and software developers achieve significant returns out of a relatively small investment in customization. Using CFU Playground's design and evaluation loop, we show substan",
    "path": "papers/22/01/2201.01863.json",
    "total_tokens": 935,
    "translated_title": "CFU Playground: 面向FPGA的TinyML加速的全栈开源框架",
    "translated_abstract": "需要高效处理神经网络的需求催生了硬件加速器的发展。专用硬件的广泛应用凸显出需要更灵活的硬件-软件协同设计和领域特定优化工具流程。本文介绍了CFU Playground：一种全栈开源框架，它可以快速迭代设计和评估嵌入式机器学习系统的机器学习加速器。我们的工具提供了一个完全开源的FPGA和未来系统硬件-软件协同设计流程。这个全栈框架使用户可以访问定制和协同优化的实验性和定制体系结构，特别针对嵌入式机器学习。使用CFU Playground的设计和评估回路，我们展示了显著的回报，而相对较小的定制投资即可让机器学习硬件和软件开发者受益。",
    "tldr": "CFU Playground是一个全栈开源框架，为嵌入式机器学习系统提供快速迭代设计和评估机器学习加速器的工具。通过CFU Playground，可以定制和协同优化实验性和定制体系结构，实现相对较小的定制投资即可让机器学习硬件和软件开发者获得显著回报。",
    "en_tdlr": "CFU Playground is a full-stack open-source framework that offers a rapid iterative design and evaluation tool for ML accelerators to embedded systems. With CFU Playground, experimental and bespoke architectures are customized and co-optimized for embedded ML. The customization investment using CFU Playground delivers significant returns for ML hardware and software developers."
}