{
    "title": "Improving Expert Predictions with Conformal Prediction. (arXiv:2201.12006v5 [cs.LG] UPDATED)",
    "abstract": "Automated decision support systems promise to help human experts solve multiclass classification tasks more efficiently and accurately. However, existing systems typically require experts to understand when to cede agency to the system or when to exercise their own agency. Otherwise, the experts may be better off solving the classification tasks on their own. In this work, we develop an automated decision support system that, by design, does not require experts to understand when to trust the system to improve performance. Rather than providing (single) label predictions and letting experts decide when to trust these predictions, our system provides sets of label predictions constructed using conformal prediction$\\unicode{x2014}$prediction sets$\\unicode{x2014}$and forcefully asks experts to predict labels from these sets. By using conformal prediction, our system can precisely trade-off the probability that the true label is not in the prediction set, which determines how frequently ou",
    "link": "http://arxiv.org/abs/2201.12006",
    "context": "Title: Improving Expert Predictions with Conformal Prediction. (arXiv:2201.12006v5 [cs.LG] UPDATED)\nAbstract: Automated decision support systems promise to help human experts solve multiclass classification tasks more efficiently and accurately. However, existing systems typically require experts to understand when to cede agency to the system or when to exercise their own agency. Otherwise, the experts may be better off solving the classification tasks on their own. In this work, we develop an automated decision support system that, by design, does not require experts to understand when to trust the system to improve performance. Rather than providing (single) label predictions and letting experts decide when to trust these predictions, our system provides sets of label predictions constructed using conformal prediction$\\unicode{x2014}$prediction sets$\\unicode{x2014}$and forcefully asks experts to predict labels from these sets. By using conformal prediction, our system can precisely trade-off the probability that the true label is not in the prediction set, which determines how frequently ou",
    "path": "papers/22/01/2201.12006.json",
    "total_tokens": 809,
    "translated_title": "使用符合预测改进专家预测",
    "translated_abstract": "自动决策支持系统承诺帮助专家更高效准确地解决多类分类任务。然而，现有系统通常要求专家理解何时放弃自己的决策权以及何时行使自己的决策权。否则，专家可能更适合自行解决分类任务。在此工作中，我们开发了一种自动决策支持系统，它不需要专家理解何时信任系统以提高性能。我们的系统不提供单一的标签预测并让专家决定何时信任这些预测，而是提供使用符合预测构建的标签预测集合，并强制要求专家从这些集合中预测标签。通过使用符合预测，我们的系统可以精确地权衡真实标签不在预测集合中的概率，从而确定输出预测的频率。",
    "tldr": "本研究开发了一种自动决策支持系统，通过使用符合预测构建的标签预测集合，精确地权衡了真实标签不在预测集合中的概率。"
}