{
    "title": "C2-CRS: Coarse-to-Fine Contrastive Learning for Conversational Recommender System. (arXiv:2201.02732v3 [cs.CL] UPDATED)",
    "abstract": "Conversational recommender systems (CRS) aim to recommend suitable items to users through natural language conversations. For developing effective CRSs, a major technical issue is how to accurately infer user preference from very limited conversation context. To address issue, a promising solution is to incorporate external data for enriching the context information. However, prior studies mainly focus on designing fusion models tailored for some specific type of external data, which is not general to model and utilize multi-type external data.  To effectively leverage multi-type external data, we propose a novel coarse-to-fine contrastive learning framework to improve data semantic fusion for CRS. In our approach, we first extract and represent multi-grained semantic units from different data signals, and then align the associated multi-type semantic units in a coarse-to-fine way. To implement this framework, we design both coarse-grained and fine-grained procedures for modeling user ",
    "link": "http://arxiv.org/abs/2201.02732",
    "context": "Title: C2-CRS: Coarse-to-Fine Contrastive Learning for Conversational Recommender System. (arXiv:2201.02732v3 [cs.CL] UPDATED)\nAbstract: Conversational recommender systems (CRS) aim to recommend suitable items to users through natural language conversations. For developing effective CRSs, a major technical issue is how to accurately infer user preference from very limited conversation context. To address issue, a promising solution is to incorporate external data for enriching the context information. However, prior studies mainly focus on designing fusion models tailored for some specific type of external data, which is not general to model and utilize multi-type external data.  To effectively leverage multi-type external data, we propose a novel coarse-to-fine contrastive learning framework to improve data semantic fusion for CRS. In our approach, we first extract and represent multi-grained semantic units from different data signals, and then align the associated multi-type semantic units in a coarse-to-fine way. To implement this framework, we design both coarse-grained and fine-grained procedures for modeling user ",
    "path": "papers/22/01/2201.02732.json",
    "total_tokens": 886,
    "translated_title": "C2-CRS：面向对话推荐系统的粗到细对比学习",
    "translated_abstract": "对话式推荐系统旨在通过自然语言交互向用户推荐适合的物品。为了开发有效的对话式推荐系统，一个主要的技术问题是如何从非常有限的对话上下文中准确地推断用户偏好。为了解决这个问题，一种有前途的解决方案是结合外部数据来丰富上下文信息。然而，以往的研究主要集中在为一些特定类型的外部数据设计融合模型，这不适用于模型和利用多类型的外部数据。为了有效利用多类型的外部数据，我们提出了一种新的粗到细对比学习框架来改善对话式推荐系统的数据语义融合。在我们的方法中，我们首先从不同的数据信号中提取和表示多种粒度的语义单元，然后以粗到细的方式对齐相关的多种语义单元。为了实现这个框架，我们设计了粗粒度和细粒度的过程来对用户建模。",
    "tldr": "本文提出了一种新的粗到细对比学习框架，用于对话式推荐系统中多类型外部数据的数据语义融合，在此基础上提高了数据的处理效率。",
    "en_tdlr": "This paper proposes a novel coarse-to-fine contrastive learning framework for semantic fusion of multi-type external data in conversational recommender systems, which improves the processing efficiency of data."
}