{
    "title": "On robust fundamental theorems of asset pricing in discrete time",
    "abstract": "arXiv:2007.02553v4 Announce Type: replace  Abstract: This paper is devoted to a study of robust fundamental theorems of asset pricing in discrete time and finite horizon settings. Uncertainty is modelled by a (possibly uncountable) family of price processes on the same probability space. Our technical assumption is the continuity of the price processes with respect to uncertain parameters. In this setting, we introduce a new topological framework which allows us to use the classical arguments in arbitrage pricing theory involving $L^p$ spaces, the Hahn-Banach separation theorem and other tools from functional analysis. The first result is the equivalence of a ``no robust arbitrage\" condition and the existence of a new ``robust pricing system\". The second result shows superhedging dualities and the existence of superhedging strategies without restrictive conditions on payoff functions, unlike other related studies. The third result discusses completeness in the present robust setting. W",
    "link": "https://arxiv.org/abs/2007.02553",
    "context": "Title: On robust fundamental theorems of asset pricing in discrete time\nAbstract: arXiv:2007.02553v4 Announce Type: replace  Abstract: This paper is devoted to a study of robust fundamental theorems of asset pricing in discrete time and finite horizon settings. Uncertainty is modelled by a (possibly uncountable) family of price processes on the same probability space. Our technical assumption is the continuity of the price processes with respect to uncertain parameters. In this setting, we introduce a new topological framework which allows us to use the classical arguments in arbitrage pricing theory involving $L^p$ spaces, the Hahn-Banach separation theorem and other tools from functional analysis. The first result is the equivalence of a ``no robust arbitrage\" condition and the existence of a new ``robust pricing system\". The second result shows superhedging dualities and the existence of superhedging strategies without restrictive conditions on payoff functions, unlike other related studies. The third result discusses completeness in the present robust setting. W",
    "path": "papers/20/07/2007.02553.json",
    "total_tokens": 902,
    "translated_title": "论离散时间中资产定价的鲁棒基本定理",
    "translated_abstract": "本文致力于研究离散时间和有限时间跨度下资产定价的鲁棒基本定理。不确定性通过同一概率空间上的（可能是不可数的）一族价格过程建模。我们的技术假设是价格过程对于不确定参数是连续的。在这一环境中，我们引入了一个新的拓扑框架，使我们能够使用涉及 $L^p$ 空间、Hahn-Banach 分离定理以及其他来自泛函分析的工具的经典套利定价理论论证。第一个结果是“无鲁棒套利”条件与存在新的“鲁棒定价体系”之间的等价性。第二个结果展示了双向套期保值和在支付函数上不存在限制性条件的套期保值策略的存在，这与其他相关研究不同。第三个结果讨论了当前鲁棒设置中的完备性。",
    "tldr": "本文研究了离散时间下资产定价的鲁棒基本定理，引入了新的拓扑框架，创新性地证明了“无鲁棒套利”条件与“鲁棒定价体系”的等价性，展示了双向套期保值以及完备性。",
    "en_tdlr": "This paper investigates the robust fundamental theorems of asset pricing in discrete time, introduces a new topological framework, innovatively proves the equivalence between the \"no robust arbitrage\" condition and the \"robust pricing system\", demonstrates superhedging dualities and completeness in the present robust setting."
}