{
    "title": "A model of interaction semantics. (arXiv:2007.06258v3 [cs.AI] UPDATED)",
    "abstract": "Purpose: The purpose of this article is to propose, based on a model of an interaction semantics, a certain understanding of the ''meaning'' of the exchanged characters within an interaction.  Methodology: Based on a model of system interaction, I structure the model of interaction semantics similar to the semantics of a formal language: first, I identify adequate variables in my interaction model to assign values to, and second, I identify the interpretation function to provide meaning. Thereby I arrive at a model of interaction semantics which, in the sense of the late Ludwig Wittgenstein, can do without a 'mental' mapping from characters to concepts.  Findings: The key findings are a better understanding of the tight relation between the informatical approach to model interactions and game theory; of the central 'chicken and egg' problem, any natural language has to solve, namely that to interact sensibly, we have to understand each other and to acquire a common understanding, we ha",
    "link": "http://arxiv.org/abs/2007.06258",
    "context": "Title: A model of interaction semantics. (arXiv:2007.06258v3 [cs.AI] UPDATED)\nAbstract: Purpose: The purpose of this article is to propose, based on a model of an interaction semantics, a certain understanding of the ''meaning'' of the exchanged characters within an interaction.  Methodology: Based on a model of system interaction, I structure the model of interaction semantics similar to the semantics of a formal language: first, I identify adequate variables in my interaction model to assign values to, and second, I identify the interpretation function to provide meaning. Thereby I arrive at a model of interaction semantics which, in the sense of the late Ludwig Wittgenstein, can do without a 'mental' mapping from characters to concepts.  Findings: The key findings are a better understanding of the tight relation between the informatical approach to model interactions and game theory; of the central 'chicken and egg' problem, any natural language has to solve, namely that to interact sensibly, we have to understand each other and to acquire a common understanding, we ha",
    "path": "papers/20/07/2007.06258.json",
    "total_tokens": 743,
    "translated_title": "交互语义模型",
    "translated_abstract": "本文基于交互语义模型，提出了关于交互中“含义”理解的某种观点。通过构建系统交互模型，我将交互语义模型结构化，类似于形式语言的语义：首先，我确定适当的变量以赋值，然后，我确定解释函数以提供意义。从而得到一个交互语义模型，可以不依赖于从字符到概念的“心理”映射，这与路德维希·维特根斯坦的观点相符。",
    "tldr": "本研究提出了一种交互语义模型，通过构建系统交互模型，并不依赖于字符到概念的“心理”映射，来理解交互中字符的“含义”。"
}