{
    "title": "Benchmarking Multivariate Time Series Classification Algorithms. (arXiv:2007.13156v2 [cs.LG] UPDATED)",
    "abstract": "Time Series Classification (TSC) involved building predictive models for a discrete target variable from ordered, real valued, attributes. Over recent years, a new set of TSC algorithms have been developed which have made significant improvement over the previous state of the art. The main focus has been on univariate TSC, i.e. the problem where each case has a single series and a class label. In reality, it is more common to encounter multivariate TSC (MTSC) problems where multiple series are associated with a single label. Despite this, much less consideration has been given to MTSC than the univariate case. The UEA archive of 30 MTSC problems released in 2018 has made comparison of algorithms easier. We review recently proposed bespoke MTSC algorithms based on deep learning, shapelets and bag of words approaches. The simplest approach to MTSC is to ensemble univariate classifiers over the multivariate dimensions. We compare the bespoke algorithms to these dimension independent appro",
    "link": "http://arxiv.org/abs/2007.13156",
    "context": "Title: Benchmarking Multivariate Time Series Classification Algorithms. (arXiv:2007.13156v2 [cs.LG] UPDATED)\nAbstract: Time Series Classification (TSC) involved building predictive models for a discrete target variable from ordered, real valued, attributes. Over recent years, a new set of TSC algorithms have been developed which have made significant improvement over the previous state of the art. The main focus has been on univariate TSC, i.e. the problem where each case has a single series and a class label. In reality, it is more common to encounter multivariate TSC (MTSC) problems where multiple series are associated with a single label. Despite this, much less consideration has been given to MTSC than the univariate case. The UEA archive of 30 MTSC problems released in 2018 has made comparison of algorithms easier. We review recently proposed bespoke MTSC algorithms based on deep learning, shapelets and bag of words approaches. The simplest approach to MTSC is to ensemble univariate classifiers over the multivariate dimensions. We compare the bespoke algorithms to these dimension independent appro",
    "path": "papers/20/07/2007.13156.json",
    "total_tokens": 883,
    "translated_title": "多元时间序列分类算法基准测试",
    "translated_abstract": "时间序列分类（TSC）涉及从有序的实值属性中构建用于离散目标变量的预测模型。最近几年，一组新的TSC算法已经开发出来，这些算法在之前的技术水平上取得了重大进展。主要关注的是单变量TSC，即每个案例都有一个单一序列和一个类标签的问题。但实际上，更常见的是遇到多元TSC(MTSC)问题，其中多个序列与单一标签关联。然而，对于MTSC的考虑远不如单变量情况那么多。2018年推出了30个MTSC问题的UEA存档库，使算法之间的比较更容易。我们回顾了基于深度学习、形状和单词袋方法提出的定制MTSC算法。 MTSC的最简单方法是通过多元维度上的集成单变量分类器。我们将这些定制算法与这些维度无关方法进行比较。",
    "tldr": "该论文比较了单变量时间序列分类（TSC）与多元TSC(MTSC)问题的算法。作者测试了基于深度学习、形状和单词袋方法的算法，并将其与维度无关的方法进行比较。",
    "en_tdlr": "This paper compares algorithms for univariate time series classification (TSC) and multivariate TSC (MTSC). The authors tested algorithms based on deep learning, shapelets, and bag of words approaches, and compared them to dimension-independent methods."
}