{
    "title": "Defeasible RDFS via Rational Closure. (arXiv:2007.07573v2 [cs.AI] UPDATED)",
    "abstract": "In the field of non-monotonic logics, the notion of Rational Closure (RC) is acknowledged as a prominent approach. In recent years, RC has gained even more popularity in the context of Description Logics (DLs), the logic underpinning the semantic web standard ontology language OWL 2, whose main ingredients are classes and roles. In this work, we show how to integrate RC within the triple language RDFS, which together with OWL2 are the two major standard semantic web ontology languages. To do so, we start from $\\rho df$, which is the logic behind RDFS, and then extend it to $\\rho df_\\bot$, allowing to state that two entities are incompatible. Eventually, we propose defeasible $\\rho df_\\bot$ via a typical RC construction. The main features of our approach are: (i) unlike most other approaches that add an extra non-monotone rule layer on top of monotone RDFS, defeasible $\\rho df_\\bot$ remains syntactically a triple language and is a simple extension of $\\rho df_\\bot$ by introducing some n",
    "link": "http://arxiv.org/abs/2007.07573",
    "context": "Title: Defeasible RDFS via Rational Closure. (arXiv:2007.07573v2 [cs.AI] UPDATED)\nAbstract: In the field of non-monotonic logics, the notion of Rational Closure (RC) is acknowledged as a prominent approach. In recent years, RC has gained even more popularity in the context of Description Logics (DLs), the logic underpinning the semantic web standard ontology language OWL 2, whose main ingredients are classes and roles. In this work, we show how to integrate RC within the triple language RDFS, which together with OWL2 are the two major standard semantic web ontology languages. To do so, we start from $\\rho df$, which is the logic behind RDFS, and then extend it to $\\rho df_\\bot$, allowing to state that two entities are incompatible. Eventually, we propose defeasible $\\rho df_\\bot$ via a typical RC construction. The main features of our approach are: (i) unlike most other approaches that add an extra non-monotone rule layer on top of monotone RDFS, defeasible $\\rho df_\\bot$ remains syntactically a triple language and is a simple extension of $\\rho df_\\bot$ by introducing some n",
    "path": "papers/20/07/2007.07573.json",
    "total_tokens": 928,
    "translated_title": "基于Rational Closure的可撤销RDFS",
    "translated_abstract": "在非单调逻辑领域，Rational Closure（RC）的概念被认为是一种重要的方法。近年来，在描述逻辑（DLs）的上下文中，RC在 OWL 2 的主要成分（类和角色）的语义Web标准本体语言下得到了更广泛的应用。在本文中，我们展示了如何将RC集成到三元语言RDFS中，RDFS是与OWL2一起构成主要的语义Web本体语言的两个标准之一。为此，我们从RDFS背后的$\\rho df$开始，然后将其扩展为$\\rho df_\\bot$，允许声明两个实体是不兼容的。最终，我们通过典型的RC构造提出了可撤销的$\\rho df_\\bot$。我们方法的主要特点是：（i）与大多数在单调RDFS之上添加一个额外的非单调规则层的方法不同，可撤销的$\\rho df_\\bot$仍然是语法上的三元语言，并且是通过引入一些新规则来简单地扩展$\\rho df_\\bot$。",
    "tldr": "本文介绍了如何将Rational Closure整合到RDFS中，提出了可撤销的$\\rho df_\\bot$，使其仍然保持三元语言的语法，并通过引入新规则进行简单的扩展，以声明不兼容的实体。"
}