{
    "title": "Towards a new Social Choice Theory. (arXiv:2007.15393v3 [cs.AI] UPDATED)",
    "abstract": "Social choice is the theory about collective decision towards social welfare starting from individual opinions, preferences, interests or welfare. The field of Computational Social Welfare is somewhat recent and it is gaining impact in the Artificial Intelligence Community. Classical literature makes the assumption of single-peaked preferences, i.e. there exist a order in the preferences and there is a global maximum in this order. This year some theoretical results were published about Two-stage Approval Voting Systems (TAVs), Multi-winner Selection Rules (MWSR) and Incomplete (IPs) and Circular Preferences (CPs). The purpose of this paper is three-fold: Firstly, I want to introduced Social Choice Optimisation as a generalisation of TAVs where there is a max stage and a min stage implementing thus a Minimax, well-known Artificial Intelligence decision-making rule to minimize hindering towards a (Social) Goal. Secondly, I want to introduce, following my Open Standardization and Open In",
    "link": "http://arxiv.org/abs/2007.15393",
    "context": "Title: Towards a new Social Choice Theory. (arXiv:2007.15393v3 [cs.AI] UPDATED)\nAbstract: Social choice is the theory about collective decision towards social welfare starting from individual opinions, preferences, interests or welfare. The field of Computational Social Welfare is somewhat recent and it is gaining impact in the Artificial Intelligence Community. Classical literature makes the assumption of single-peaked preferences, i.e. there exist a order in the preferences and there is a global maximum in this order. This year some theoretical results were published about Two-stage Approval Voting Systems (TAVs), Multi-winner Selection Rules (MWSR) and Incomplete (IPs) and Circular Preferences (CPs). The purpose of this paper is three-fold: Firstly, I want to introduced Social Choice Optimisation as a generalisation of TAVs where there is a max stage and a min stage implementing thus a Minimax, well-known Artificial Intelligence decision-making rule to minimize hindering towards a (Social) Goal. Secondly, I want to introduce, following my Open Standardization and Open In",
    "path": "papers/20/07/2007.15393.json",
    "total_tokens": 820,
    "translated_title": "朝着一种新的社会选择理论迈进",
    "translated_abstract": "社会选择理论是关于从个体意见、偏好、利益或福利出发，向社会福利进行集体决策的理论。计算社会福利领域相对较新，并在人工智能社区中产生了影响。经典文献假设偏好是单峰的，即存在一种偏好的顺序，并且在这个顺序中存在一个全局最大值。今年有关两阶段批准投票系统（TAVs）、多赢家选择规则（MWSR）以及不完全（IPs）和循环偏好（CPs）的一些理论结果已经发表。本文的目的有三个：首先，我想将社会选择优化作为TAVs的一种泛化引入，其中有一个最大阶段和一个最小阶段，从而实现了一种减少对（社会）目标产生阻碍的人工智能决策规则：Minimax。其次，我想通过我的开放标准化和开放创新方法引入一个：",
    "tldr": "这篇论文介绍了一种新的社会选择理论，通过引入社会选择优化作为TAVs的泛化，以最小化对（社会）目标的阻碍。"
}