{
    "title": "A Deep Learning Framework for Generation and Analysis of Driving Scenario Trajectories. (arXiv:2007.14524v2 [cs.CV] UPDATED)",
    "abstract": "We propose a unified deep learning framework for the generation and analysis of driving scenario trajectories, and validate its effectiveness in a principled way. To model and generate scenarios of trajectories with different lengths, we develop two approaches. First, we adapt the Recurrent Conditional Generative Adversarial Networks (RC-GAN) by conditioning on the length of the trajectories. This provides us the flexibility to generate variable-length driving trajectories, a desirable feature for scenario test case generation in the verification of autonomous driving. Second, we develop an architecture based on Recurrent Autoencoder with GANs to obviate the variable length issue, wherein we train a GAN to learn/generate the latent representations of original trajectories. In this approach, we train an integrated feed-forward neural network to estimate the length of the trajectories to be able to bring them back from the latent space representation. In addition to trajectory generation",
    "link": "http://arxiv.org/abs/2007.14524",
    "context": "Title: A Deep Learning Framework for Generation and Analysis of Driving Scenario Trajectories. (arXiv:2007.14524v2 [cs.CV] UPDATED)\nAbstract: We propose a unified deep learning framework for the generation and analysis of driving scenario trajectories, and validate its effectiveness in a principled way. To model and generate scenarios of trajectories with different lengths, we develop two approaches. First, we adapt the Recurrent Conditional Generative Adversarial Networks (RC-GAN) by conditioning on the length of the trajectories. This provides us the flexibility to generate variable-length driving trajectories, a desirable feature for scenario test case generation in the verification of autonomous driving. Second, we develop an architecture based on Recurrent Autoencoder with GANs to obviate the variable length issue, wherein we train a GAN to learn/generate the latent representations of original trajectories. In this approach, we train an integrated feed-forward neural network to estimate the length of the trajectories to be able to bring them back from the latent space representation. In addition to trajectory generation",
    "path": "papers/20/07/2007.14524.json",
    "total_tokens": 841,
    "translated_title": "深度学习框架用于生成和分析驾驶场景轨迹",
    "translated_abstract": "我们提出了一个统一的深度学习框架，用于生成和分析驾驶场景轨迹，并以一种原则性的方式验证其有效性。为了对不同长度的轨迹进行建模和生成，我们开发了两种方法。首先，我们通过在轨迹长度的条件下来调整循环条件生成对抗网络（RC-GAN），从而能够生成可变长度的驾驶轨迹，这是自主驾驶验证中生成测试案例的理想特性。其次，我们基于循环自编码器与生成对抗网络的架构来解决可变长度的问题，在这个方法中，我们训练一个生成对抗网络来学习/生成原始轨迹的潜在表示。在这种方法中，我们训练一个集成的前馈神经网络来估计轨迹的长度，从而能够将其从潜在空间表示中还原出来。除了轨迹生成外",
    "tldr": "我们提出了一个深度学习框架，用于生成和分析驾驶场景轨迹。我们开发了两种方法来处理不同长度的轨迹，并通过实验证明了其有效性。"
}