{
    "title": "A Survey of Privacy Attacks in Machine Learning. (arXiv:2007.07646v3 [cs.CR] UPDATED)",
    "abstract": "As machine learning becomes more widely used, the need to study its implications in security and privacy becomes more urgent. Although the body of work in privacy has been steadily growing over the past few years, research on the privacy aspects of machine learning has received less focus than the security aspects. Our contribution in this research is an analysis of more than 40 papers related to privacy attacks against machine learning that have been published during the past seven years. We propose an attack taxonomy, together with a threat model that allows the categorization of different attacks based on the adversarial knowledge, and the assets under attack. An initial exploration of the causes of privacy leaks is presented, as well as a detailed analysis of the different attacks. Finally, we present an overview of the most commonly proposed defenses and a discussion of the open problems and future directions identified during our analysis.",
    "link": "http://arxiv.org/abs/2007.07646",
    "context": "Title: A Survey of Privacy Attacks in Machine Learning. (arXiv:2007.07646v3 [cs.CR] UPDATED)\nAbstract: As machine learning becomes more widely used, the need to study its implications in security and privacy becomes more urgent. Although the body of work in privacy has been steadily growing over the past few years, research on the privacy aspects of machine learning has received less focus than the security aspects. Our contribution in this research is an analysis of more than 40 papers related to privacy attacks against machine learning that have been published during the past seven years. We propose an attack taxonomy, together with a threat model that allows the categorization of different attacks based on the adversarial knowledge, and the assets under attack. An initial exploration of the causes of privacy leaks is presented, as well as a detailed analysis of the different attacks. Finally, we present an overview of the most commonly proposed defenses and a discussion of the open problems and future directions identified during our analysis.",
    "path": "papers/20/07/2007.07646.json",
    "total_tokens": 817,
    "translated_title": "机器学习中隐私攻击的调查",
    "translated_abstract": "随着机器学习的广泛应用，研究其安全和隐私的影响变得更加紧迫。尽管在隐私方面的研究工作在过去几年里稳步增长，但与安全方面相比，对机器学习的隐私方面研究的关注度较低。本研究的贡献是对过去七年发表的与机器学习隐私攻击相关的40多篇论文进行分析。我们提出了一种攻击分类方法，并提出了威胁模型，可以根据对手知识和受攻击资产对不同攻击进行分类。我们首先对隐私泄露的原因进行了初步探讨，然后对不同的攻击进行了详细分析。最后，我们总结了最常见的防御方法，并讨论了我们分析过程中发现的开放问题和未来的研究方向。",
    "tldr": "该研究对机器学习中的隐私攻击进行了调查，提出了攻击分类和威胁模型，并分析了不同攻击的原因和防御方法。",
    "en_tdlr": "This study surveys privacy attacks in machine learning, proposes attack taxonomy and threat model, and analyzes the causes and defenses of different attacks."
}