{
    "title": "Understanding fluctuations through Multivariate Circulant Singular Spectrum Analysis. (arXiv:2007.07561v5 [eess.SP] UPDATED)",
    "abstract": "We introduce Multivariate Circulant Singular Spectrum Analysis (M-CiSSA) to provide a comprehensive framework to analyze fluctuations, extracting the underlying components of a set of time series, disentangling their sources of variation and assessing their relative phase or cyclical position at each frequency. Our novel method is non-parametric and can be applied to series out of phase, highly nonlinear and modulated both in frequency and amplitude. We prove a uniqueness theorem that in the case of common information and without the need of fitting a factor model, allows us to identify common sources of variation. This technique can be quite useful in several fields such as climatology, biometrics, engineering or economics among others. We show the performance of M-CiSSA through a synthetic example of latent signals modulated both in amplitude and frequency and through the real data analysis of energy prices to understand the main drivers and co-movements of primary energy commodity p",
    "link": "http://arxiv.org/abs/2007.07561",
    "context": "Title: Understanding fluctuations through Multivariate Circulant Singular Spectrum Analysis. (arXiv:2007.07561v5 [eess.SP] UPDATED)\nAbstract: We introduce Multivariate Circulant Singular Spectrum Analysis (M-CiSSA) to provide a comprehensive framework to analyze fluctuations, extracting the underlying components of a set of time series, disentangling their sources of variation and assessing their relative phase or cyclical position at each frequency. Our novel method is non-parametric and can be applied to series out of phase, highly nonlinear and modulated both in frequency and amplitude. We prove a uniqueness theorem that in the case of common information and without the need of fitting a factor model, allows us to identify common sources of variation. This technique can be quite useful in several fields such as climatology, biometrics, engineering or economics among others. We show the performance of M-CiSSA through a synthetic example of latent signals modulated both in amplitude and frequency and through the real data analysis of energy prices to understand the main drivers and co-movements of primary energy commodity p",
    "path": "papers/20/07/2007.07561.json",
    "total_tokens": 913,
    "translated_title": "通过多变量循环奇异谱分析理解波动",
    "translated_abstract": "我们引入了多变量循环奇异谱分析（M-CiSSA），提供了一个综合框架来分析波动，提取一组时间序列的基本成分，解开它们的变化来源，并评估它们在每个频率上的相对相位或周期位置。我们的新方法是非参数的，可以应用于相位错开、高度非线性和频率和幅度都有调制的序列。我们证明了一个唯一性定理，在共享信息的情况下，无需拟合因子模型，即可识别共同的变化源。这种技术在气候学、生物测量学、工程学或经济学等多个领域非常有用。我们通过一个合成示例和能源价格的实际数据分析展示了M-CiSSA的性能，以了解主要能源商品价格的驱动因素和共同变动。",
    "tldr": "我们引入了多变量循环奇异谱分析（M-CiSSA），提供了一种综合分析波动的框架。该方法是非参数的，可以识别共同的变化源，适用于相位错开、高度非线性和调制的序列。此技术在气候学、生物测量学、工程学等领域非常有用。"
}