{
    "title": "Fast Adaptive Non-Monotone Submodular Maximization Subject to a Knapsack Constraint. (arXiv:2007.05014v2 [cs.DS] UPDATED)",
    "abstract": "Submodular maximization is a classic algorithmic problem with multiple applications in data mining and machine learning; there, the growing need to deal with massive instances motivates the design of algorithms balancing the quality of the solution with applicability. For the latter, an important measure is the \\emph{adaptive complexity}, which captures the number of sequential rounds of parallel computation needed by an algorithm to terminate. In this work, we obtain the first \\emph{constant factor} approximation algorithm for non-monotone submodular maximization subject to a knapsack constraint with \\emph{near-optimal} $O(\\log n)$ adaptive complexity. Low adaptivity by itself, however, is not enough: a crucial feature to account for is represented by the total number of function evaluations (or value queries). Our algorithm asks $\\tilde{O}(n^2)$ value queries but can be modified to run with only $\\tilde{O}(n)$ instead while retaining a low adaptive complexity of $O(\\log^2n)$. Besides",
    "link": "http://arxiv.org/abs/2007.05014",
    "context": "Title: Fast Adaptive Non-Monotone Submodular Maximization Subject to a Knapsack Constraint. (arXiv:2007.05014v2 [cs.DS] UPDATED)\nAbstract: Submodular maximization is a classic algorithmic problem with multiple applications in data mining and machine learning; there, the growing need to deal with massive instances motivates the design of algorithms balancing the quality of the solution with applicability. For the latter, an important measure is the \\emph{adaptive complexity}, which captures the number of sequential rounds of parallel computation needed by an algorithm to terminate. In this work, we obtain the first \\emph{constant factor} approximation algorithm for non-monotone submodular maximization subject to a knapsack constraint with \\emph{near-optimal} $O(\\log n)$ adaptive complexity. Low adaptivity by itself, however, is not enough: a crucial feature to account for is represented by the total number of function evaluations (or value queries). Our algorithm asks $\\tilde{O}(n^2)$ value queries but can be modified to run with only $\\tilde{O}(n)$ instead while retaining a low adaptive complexity of $O(\\log^2n)$. Besides",
    "path": "papers/20/07/2007.05014.json",
    "total_tokens": 859,
    "translated_title": "快速适应性非单调子模最大化问题在背包约束下的研究",
    "translated_abstract": "子模最大化是一个经典的算法问题，在数据挖掘和机器学习中有多种应用。针对大规模实例的需求，设计能够在解的质量和适用性之间取得平衡的算法成为动力。本文针对非单调子模最大化在背包约束下的问题，得到了第一个具有常数逼近比和接近最优的O(log n)适应性复杂度的算法。此外，我们的算法在求解过程中询问的函数值数量可以通过修改变为O(n)而保持适应性复杂度为O(log^2n)。",
    "tldr": "本研究提出了一种针对非单调子模最大化问题的快速适应性算法，能够在背包约束下以O(log n)的复杂度接近最优解，并可以通过修改将函数值询问的数量减少到O(n)而保持较低的适应性复杂度。",
    "en_tdlr": "This research introduces a fast adaptive algorithm for non-monotone submodular maximization problems subject to a knapsack constraint, achieving a constant factor approximation with near-optimal O(log n) adaptive complexity. It can also be modified to reduce the number of value queries to O(n) while maintaining a low adaptive complexity of O(log^2 n)."
}