{
    "title": "Online Causal Inference for Advertising in Real-Time Bidding Auctions",
    "abstract": "arXiv:1908.08600v4 Announce Type: replace  Abstract: Real-time bidding (RTB) systems, which utilize auctions to allocate user impressions to competing advertisers, continue to enjoy success in digital advertising. Assessing the effectiveness of such advertising remains a challenge in research and practice. This paper proposes a new approach to perform causal inference on advertising bought through such mechanisms. Leveraging the economic structure of first- and second-price auctions, we first show that the effects of advertising are identified by the optimal bids. Hence, since these optimal bids are the only objects that need to be recovered, we introduce an adapted Thompson sampling (TS) algorithm to solve a multi-armed bandit problem that succeeds in recovering such bids and, consequently, the effects of advertising while minimizing the costs of experimentation. We derive a regret bound for our algorithm which is order optimal and use data from RTB auctions to show that it outperform",
    "link": "https://arxiv.org/abs/1908.08600",
    "context": "Title: Online Causal Inference for Advertising in Real-Time Bidding Auctions\nAbstract: arXiv:1908.08600v4 Announce Type: replace  Abstract: Real-time bidding (RTB) systems, which utilize auctions to allocate user impressions to competing advertisers, continue to enjoy success in digital advertising. Assessing the effectiveness of such advertising remains a challenge in research and practice. This paper proposes a new approach to perform causal inference on advertising bought through such mechanisms. Leveraging the economic structure of first- and second-price auctions, we first show that the effects of advertising are identified by the optimal bids. Hence, since these optimal bids are the only objects that need to be recovered, we introduce an adapted Thompson sampling (TS) algorithm to solve a multi-armed bandit problem that succeeds in recovering such bids and, consequently, the effects of advertising while minimizing the costs of experimentation. We derive a regret bound for our algorithm which is order optimal and use data from RTB auctions to show that it outperform",
    "path": "papers/19/08/1908.08600.json",
    "total_tokens": 875,
    "translated_title": "实时竞价广告中的在线因果推断",
    "translated_abstract": "实时竞价（RTB）系统通过拍卖将用户曝光分配给竞争对手的广告商，继续在数字广告领域取得成功。评估这种广告的有效性在研究和实践中仍然是一个挑战。本文提出了一种新的方法来对通过这种机制购买的广告进行因果推断。利用一价和二价拍卖的经济结构，我们首先展示了广告效果由最佳出价确定。因此，由于这些最佳出价是唯一需要恢复的对象，我们引入了一种改进的汤普森抽样（TS）算法，来解决一个多臂老虎机问题，成功恢复这些出价和因此广告效果，同时最小化实验成本。我们推导了算法的遗憾上界，该上界是顺序最优的，并利用RTB拍卖数据展示了它的性能表现。",
    "tldr": "该论文提出了一种新的在线因果推断方法，利用一价和二价拍卖的经济结构，通过引入改进的汤普森抽样算法来有效识别实时竞价广告的效果，最小化实验成本，并获得了顺序最优的遗憾上界。",
    "en_tdlr": "This paper introduces a novel online causal inference approach that leverages the economic structure of first- and second-price auctions to effectively identify the effects of real-time bidding advertising by introducing an improved Thompson sampling algorithm, minimizing experimental costs, and achieving a sequentially optimal regret bound."
}