{
    "title": "Offensive Language and Hate Speech Detection for Danish. (arXiv:1908.04531v2 [cs.CL] UPDATED)",
    "abstract": "The presence of offensive language on social media platforms and the implications this poses is becoming a major concern in modern society. Given the enormous amount of content created every day, automatic methods are required to detect and deal with this type of content. Until now, most of the research has focused on solving the problem for the English language, while the problem is multilingual.  We construct a Danish dataset containing user-generated comments from \\textit{Reddit} and \\textit{Facebook}. It contains user generated comments from various social media platforms, and to our knowledge, it is the first of its kind. Our dataset is annotated to capture various types and target of offensive language. We develop four automatic classification systems, each designed to work for both the English and the Danish language. In the detection of offensive language in English, the best performing system achieves a macro averaged F1-score of $0.74$, and the best performing system for Dani",
    "link": "http://arxiv.org/abs/1908.04531",
    "context": "Title: Offensive Language and Hate Speech Detection for Danish. (arXiv:1908.04531v2 [cs.CL] UPDATED)\nAbstract: The presence of offensive language on social media platforms and the implications this poses is becoming a major concern in modern society. Given the enormous amount of content created every day, automatic methods are required to detect and deal with this type of content. Until now, most of the research has focused on solving the problem for the English language, while the problem is multilingual.  We construct a Danish dataset containing user-generated comments from \\textit{Reddit} and \\textit{Facebook}. It contains user generated comments from various social media platforms, and to our knowledge, it is the first of its kind. Our dataset is annotated to capture various types and target of offensive language. We develop four automatic classification systems, each designed to work for both the English and the Danish language. In the detection of offensive language in English, the best performing system achieves a macro averaged F1-score of $0.74$, and the best performing system for Dani",
    "path": "papers/19/08/1908.04531.json",
    "total_tokens": 995,
    "translated_title": "Offensive Language and Hate Speech Detection for Danish（丹麦语的恶意语言和仇恨言论检测）",
    "translated_abstract": "社交媒体平台上存在攻击性语言及其可能带来的影响正成为现代社会的一个主要问题。由于每天创造的内容量巨大，因此需要自动化方法来检测和处理此类内容。到目前为止，大部分研究都集中在解决英语语言问题上，而这个问题是多语言的。我们构建了一个包含Reddit和Facebook中用户生成的评论的丹麦数据集，其中包含各种社交媒体平台上的用户生成的评论，据我们所知，这是第一个这样的数据集。 我们的数据集进行了注释，以捕捉各种攻击性语言的类型和目标。我们开发了四个自动分类系统，每个系统都设计用于英语和丹麦语。在英语攻击性语言的检测中，最佳性能系统的平均宏F1得分为0.74，而对于丹麦语的最佳系统，其平均宏F1得分为0.67。我们的贡献有两个方面：首先，我们提出了一个适用于检测攻击性语言的丹麦数据集；其次，我们为英语和丹麦语的攻击性语言检测建立了最新技术性能。",
    "tldr": "该论文提出了一个适用于检测攻击性语言的丹麦数据集，并为英语和丹麦语的恶意语言检测建立了最新技术性能。",
    "en_tdlr": "This paper proposes a Danish dataset suitable for detecting offensive language and establishes state-of-the-art performance for both English and Danish hate speech detection."
}