{
    "title": "L2P: Learning to Place for Estimating Heavy-Tailed Distributed Outcomes. (arXiv:1908.04628v3 [cs.LG] UPDATED)",
    "abstract": "Many real-world prediction tasks have outcome variables that have characteristic heavy-tail distributions. Examples include copies of books sold, auction prices of art pieces, demand for commodities in warehouses, etc. By learning heavy-tailed distributions, \"big and rare\" instances (e.g., the best-sellers) will have accurate predictions. Most existing approaches are not dedicated to learning heavy-tailed distribution; thus, they heavily under-predict such instances. To tackle this problem, we introduce Learning to Place (L2P), which exploits the pairwise relationships between instances for learning. In its training phase, L2P learns a pairwise preference classifier: is instance A > instance B? In its placing phase, L2P obtains a prediction by placing the new instance among the known instances. Based on its placement, the new instance is then assigned a value for its outcome variable. Experiments on real data show that L2P outperforms competing approaches in terms of accuracy and abili",
    "link": "http://arxiv.org/abs/1908.04628",
    "context": "Title: L2P: Learning to Place for Estimating Heavy-Tailed Distributed Outcomes. (arXiv:1908.04628v3 [cs.LG] UPDATED)\nAbstract: Many real-world prediction tasks have outcome variables that have characteristic heavy-tail distributions. Examples include copies of books sold, auction prices of art pieces, demand for commodities in warehouses, etc. By learning heavy-tailed distributions, \"big and rare\" instances (e.g., the best-sellers) will have accurate predictions. Most existing approaches are not dedicated to learning heavy-tailed distribution; thus, they heavily under-predict such instances. To tackle this problem, we introduce Learning to Place (L2P), which exploits the pairwise relationships between instances for learning. In its training phase, L2P learns a pairwise preference classifier: is instance A > instance B? In its placing phase, L2P obtains a prediction by placing the new instance among the known instances. Based on its placement, the new instance is then assigned a value for its outcome variable. Experiments on real data show that L2P outperforms competing approaches in terms of accuracy and abili",
    "path": "papers/19/08/1908.04628.json",
    "total_tokens": 900,
    "translated_title": "L2P: 学习放置用于估计重尾分布结果",
    "translated_abstract": "许多现实世界的预测任务具有具有重尾分布特征的结果变量。例如，销售的图书副本，艺术品拍卖价格，仓库中商品的需求等。通过学习重尾分布，\"大而罕见\"的实例（例如，畅销书）将具有准确的预测。大多数现有方法并不专注于学习重尾分布；因此，它们往往会对这些实例进行严重低估。为了解决这个问题，我们引入了学习放置（L2P）方法，它利用实例之间的成对关系进行学习。在训练阶段，L2P学习一对一偏好分类器：实例A是否大于实例B？在放置阶段，L2P通过将新实例放置在已知实例之间来获得预测结果。根据其放置位置，新实例被分配一个结果变量的值。实验结果表明，L2P在准确度和能力方面优于竞争方法。",
    "tldr": "L2P是一种利用实例之间成对关系进行学习的方法，用于解决具有重尾分布特征的预测任务。实验证明，L2P在准确度和能力方面优于竞争方法。",
    "en_tdlr": "L2P is an approach that learns from pairwise relationships between instances to tackle prediction tasks with heavy-tailed distributions. Experimental results show that L2P outperforms competing methods in terms of accuracy and ability."
}