{
    "title": "NLPExplorer: Exploring the Universe of NLP Papers. (arXiv:1910.07351v2 [cs.IR] UPDATED)",
    "abstract": "Understanding the current research trends, problems, and their innovative solutions remains a bottleneck due to the ever-increasing volume of scientific articles. In this paper, we propose NLPExplorer, a completely automatic portal for indexing, searching, and visualizing Natural Language Processing (NLP) research volume. NLPExplorer presents interesting insights from papers, authors, venues, and topics. In contrast to previous topic modelling based approaches, we manually curate five course-grained non-exclusive topical categories namely Linguistic Target (Syntax, Discourse, etc.), Tasks (Tagging, Summarization, etc.), Approaches (unsupervised, supervised, etc.), Languages (English, Chinese,etc.) and Dataset types (news, clinical notes, etc.). Some of the novel features include a list of young popular authors, popular URLs, and datasets, a list of topically diverse papers and recent popular papers. Also, it provides temporal statistics such as yearwise popularity of topics, datasets, ",
    "link": "http://arxiv.org/abs/1910.07351",
    "context": "Title: NLPExplorer: Exploring the Universe of NLP Papers. (arXiv:1910.07351v2 [cs.IR] UPDATED)\nAbstract: Understanding the current research trends, problems, and their innovative solutions remains a bottleneck due to the ever-increasing volume of scientific articles. In this paper, we propose NLPExplorer, a completely automatic portal for indexing, searching, and visualizing Natural Language Processing (NLP) research volume. NLPExplorer presents interesting insights from papers, authors, venues, and topics. In contrast to previous topic modelling based approaches, we manually curate five course-grained non-exclusive topical categories namely Linguistic Target (Syntax, Discourse, etc.), Tasks (Tagging, Summarization, etc.), Approaches (unsupervised, supervised, etc.), Languages (English, Chinese,etc.) and Dataset types (news, clinical notes, etc.). Some of the novel features include a list of young popular authors, popular URLs, and datasets, a list of topically diverse papers and recent popular papers. Also, it provides temporal statistics such as yearwise popularity of topics, datasets, ",
    "path": "papers/19/10/1910.07351.json",
    "total_tokens": 926,
    "translated_title": "NLPExplorer：探索自然语言处理论文的宇宙",
    "translated_abstract": "随着科学文章数量的不断增加，了解当前研究趋势、问题及其创新解决方案仍然是一个瓶颈。本文提出了NLPExplorer，这是一个完全自动化的门户网站，用于索引、搜索和可视化自然语言处理（NLP）研究体量。与之前基于主题建模的方法不同，NLPExplorer手动策划了五个粗略的、非排他的主题类别，即语言目标（语法、语篇等）、任务（标注、摘要等）、方法（无监督、监督等）、语言（英语、中文等）和数据集类型（新闻、临床笔记等）。其中一些新颖的功能包括年轻热门作者、热门URL和数据集列表、不同主题的论文列表以及最近热门的论文。此外，它还提供了诸如按年度热度的主题、数据集的统计信息等。",
    "tldr": "NLPExplorer是一个自动化门户网站，用于索引、搜索和可视化NLP研究文献，手动策划五类主题类别。提供了年轻热门作者、热门URL和数据集列表、不同主题的论文列表，以及最近热门的论文等。",
    "en_tdlr": "NLPExplorer is an automatic portal for indexing, searching, and visualizing NLP research volume, with five manually curated course-grained non-exclusive topical categories. It provides novel features such as a list of young popular authors, popular URLs, and datasets, a list of topically diverse papers and recent popular papers, and temporal statistics."
}