{
    "title": "Volterra Neural Networks (VNNs). (arXiv:1910.09616v5 [cs.CV] UPDATED)",
    "abstract": "The importance of inference in Machine Learning (ML) has led to an explosive number of different proposals in ML, and particularly in Deep Learning. In an attempt to reduce the complexity of Convolutional Neural Networks, we propose a Volterra filter-inspired Network architecture. This architecture introduces controlled non-linearities in the form of interactions between the delayed input samples of data. We propose a cascaded implementation of Volterra Filtering so as to significantly reduce the number of parameters required to carry out the same classification task as that of a conventional Neural Network. We demonstrate an efficient parallel implementation of this Volterra Neural Network (VNN), along with its remarkable performance while retaining a relatively simpler and potentially more tractable structure. Furthermore, we show a rather sophisticated adaptation of this network to nonlinearly fuse the RGB (spatial) information and the Optical Flow (temporal) information of a video ",
    "link": "http://arxiv.org/abs/1910.09616",
    "context": "Title: Volterra Neural Networks (VNNs). (arXiv:1910.09616v5 [cs.CV] UPDATED)\nAbstract: The importance of inference in Machine Learning (ML) has led to an explosive number of different proposals in ML, and particularly in Deep Learning. In an attempt to reduce the complexity of Convolutional Neural Networks, we propose a Volterra filter-inspired Network architecture. This architecture introduces controlled non-linearities in the form of interactions between the delayed input samples of data. We propose a cascaded implementation of Volterra Filtering so as to significantly reduce the number of parameters required to carry out the same classification task as that of a conventional Neural Network. We demonstrate an efficient parallel implementation of this Volterra Neural Network (VNN), along with its remarkable performance while retaining a relatively simpler and potentially more tractable structure. Furthermore, we show a rather sophisticated adaptation of this network to nonlinearly fuse the RGB (spatial) information and the Optical Flow (temporal) information of a video ",
    "path": "papers/19/10/1910.09616.json",
    "total_tokens": 948,
    "translated_title": "Volterra神经网络（VNNs）",
    "translated_abstract": "机器学习（ML）中推理的重要性导致了ML的大量提案，特别是深度学习。为了降低卷积神经网络的复杂性，我们提出了一种Volterra滤波器启发的网络架构。该架构通过输入数据的延迟采样之间的交互引入了受控非线性。我们提出了Volterra滤波器的串级实现，以显著降低进行与传统神经网络相同的分类任务所需的参数数量。我们展示了这种Volterra神经网络（VNN）的高效并行实现，以及其在保持相对较简单且可能更易于处理的结构的同时表现出的显著性能。此外，我们展示了这个网络对视频的RGB（空间）信息和光流（时间）信息进行非线性融合的比较复杂的自适应。",
    "tldr": "该论文提出了一种Volterra滤波器启发的神经网络架构，旨在通过输入数据的延迟采样之间的交互引入受控的非线性，以降低卷积神经网络的复杂性。通过串行实现Volterra滤波器，减少了进行与传统神经网络相同的分类任务所需的参数数量。此外，作者还展示了该网络对视频的RGB信息和光流信息进行非线性融合的自适应。",
    "en_tdlr": "The paper proposes a Volterra filter-inspired neural network architecture that introduces controlled non-linearities in the form of interactions between delayed input samples of data to reduce the complexity of convolutional neural networks. By using a cascaded implementation of Volterra filtering, the proposed network significantly reduces the number of parameters required for classification tasks. The authors demonstrate an efficient parallel implementation of the Volterra neural network and its ability to adaptively fuse spatial and temporal information from video data."
}