{
    "title": "Method for the semantic indexing of concept hierarchies, uniform representation, use of relational database systems and generic and case-based reasoning. (arXiv:1910.01539v2 [cs.AI] UPDATED)",
    "abstract": "This paper presents a method for semantic indexing and describes its application in the field of knowledge representation. Starting point of the semantic indexing is the knowledge represented by concept hierarchies. The goal is to assign keys to nodes (concepts) that are hierarchically ordered and syntactically and semantically correct. With the indexing algorithm, keys are computed such that concepts are partially unifiable with all more specific concepts and only semantically correct concepts are allowed to be added. The keys represent terminological relationships. Correctness and completeness of the underlying indexing algorithm are proven. The use of classical relational databases for the storage of instances is described. Because of the uniform representation, inference can be done using case-based reasoning and generic problem solving methods.",
    "link": "http://arxiv.org/abs/1910.01539",
    "context": "Title: Method for the semantic indexing of concept hierarchies, uniform representation, use of relational database systems and generic and case-based reasoning. (arXiv:1910.01539v2 [cs.AI] UPDATED)\nAbstract: This paper presents a method for semantic indexing and describes its application in the field of knowledge representation. Starting point of the semantic indexing is the knowledge represented by concept hierarchies. The goal is to assign keys to nodes (concepts) that are hierarchically ordered and syntactically and semantically correct. With the indexing algorithm, keys are computed such that concepts are partially unifiable with all more specific concepts and only semantically correct concepts are allowed to be added. The keys represent terminological relationships. Correctness and completeness of the underlying indexing algorithm are proven. The use of classical relational databases for the storage of instances is described. Because of the uniform representation, inference can be done using case-based reasoning and generic problem solving methods.",
    "path": "papers/19/10/1910.01539.json",
    "total_tokens": 808,
    "translated_title": "概念层次结构的语义索引方法，统一表示，关系数据库系统和通用与基于案例的推理方法",
    "translated_abstract": "本文提出了一种语义索引方法，并描述了其在知识表示领域的应用。语义索引的起点是通过概念层次结构表示的知识。其目标是将键分配给节点（概念），这些节点按层次顺序排列且语法和语义正确。使用索引算法，计算键，使得概念与所有更具体的概念部分可统一，并且只允许添加语义正确的概念。键表示术语关系。所述索引算法的正确性和完备性已被证明。描述了将经典关系数据库用于实例存储的方法。由于统一表示，可以使用基于案例的推理和通用问题解决方法进行推理。",
    "tldr": "本文提出了一种语义索引方法，通过概念层次结构表示知识并将键分配给节点，使得概念与所有更具体的概念部分可统一，并且只允许添加语义正确的概念。此方法可以使用基于案例的推理和通用问题解决方法进行推理。",
    "en_tdlr": "This paper presents a method for semantic indexing using concept hierarchies to assign keys to nodes and ensure semantic correctness, allowing for inference using case-based reasoning and generic problem solving methods."
}