{
    "title": "Deep Semantic Segmentation of Natural and Medical Images: A Review",
    "abstract": "arXiv:1910.07655v4 Announce Type: replace-cross  Abstract: The semantic image segmentation task consists of classifying each pixel of an image into an instance, where each instance corresponds to a class. This task is a part of the concept of scene understanding or better explaining the global context of an image. In the medical image analysis domain, image segmentation can be used for image-guided interventions, radiotherapy, or improved radiological diagnostics. In this review, we categorize the leading deep learning-based medical and non-medical image segmentation solutions into six main groups of deep architectural, data synthesis-based, loss function-based, sequenced models, weakly supervised, and multi-task methods and provide a comprehensive review of the contributions in each of these groups. Further, for each group, we analyze each variant of these groups and discuss the limitations of the current approaches and present potential future research directions for semantic image s",
    "link": "https://arxiv.org/abs/1910.07655",
    "context": "Title: Deep Semantic Segmentation of Natural and Medical Images: A Review\nAbstract: arXiv:1910.07655v4 Announce Type: replace-cross  Abstract: The semantic image segmentation task consists of classifying each pixel of an image into an instance, where each instance corresponds to a class. This task is a part of the concept of scene understanding or better explaining the global context of an image. In the medical image analysis domain, image segmentation can be used for image-guided interventions, radiotherapy, or improved radiological diagnostics. In this review, we categorize the leading deep learning-based medical and non-medical image segmentation solutions into six main groups of deep architectural, data synthesis-based, loss function-based, sequenced models, weakly supervised, and multi-task methods and provide a comprehensive review of the contributions in each of these groups. Further, for each group, we analyze each variant of these groups and discuss the limitations of the current approaches and present potential future research directions for semantic image s",
    "path": "papers/19/10/1910.07655.json",
    "total_tokens": 838,
    "translated_title": "自然和医学图像的深度语义分割：一项综述",
    "translated_abstract": "语义图像分割任务包括将图像的每个像素分类为一个实例，其中每个实例对应一个类别。这项任务是场景理解概念的一部分，或者更好地解释图像的全局上下文。在医学图像分析领域，图像分割可用于图像引导介入、放射治疗或改善放射诊断。本综述将领先的基于深度学习的医学和非医学图像分割解决方案分类为六大主要组：深度结构、数据合成、损失函数、序列模型、弱监督和多任务方法，并全面审查了每个组中的贡献。此外，对于每个组，我们分析了每个变体，并讨论了当前方法的局限性，提出了语义图像分割的潜在未来研究方向。",
    "tldr": "对于自然和医学图像的深度语义分割任务，本综述将深度学习模型分为六大类别，全面审查了各组方法的贡献并讨论了当前方法的局限性和未来研究方向。",
    "en_tdlr": "This review categorizes deep learning models into six main groups for semantic segmentation of natural and medical images, comprehensively reviews the contributions of each group, discusses the limitations of current methods, and presents potential future research directions."
}