{
    "title": "Computation of systemic risk measures: a mixed-integer programming approach. (arXiv:1903.08367v4 [q-fin.MF] UPDATED)",
    "abstract": "Systemic risk is concerned with the instability of a financial system whose members are interdependent in the sense that the failure of a few institutions may trigger a chain of defaults throughout the system. Recently, several systemic risk measures have been proposed in the literature that are used to determine capital requirements for the members subject to joint risk considerations. We address the problem of computing systemic risk measures for systems with sophisticated clearing mechanisms. In particular, we consider an extension of Rogers-Veraart network model where the operating cash flows are unrestricted in sign. We propose a mixed-integer programming problem that can be used to compute clearing vectors in this model. Due to the binary variables in this problem, the corresponding (set-valued) systemic risk measure fails to have convex values in general. We associate nonconvex vector optimization problems to the systemic risk measure and provide theoretical results related to t",
    "link": "http://arxiv.org/abs/1903.08367",
    "context": "Title: Computation of systemic risk measures: a mixed-integer programming approach. (arXiv:1903.08367v4 [q-fin.MF] UPDATED)\nAbstract: Systemic risk is concerned with the instability of a financial system whose members are interdependent in the sense that the failure of a few institutions may trigger a chain of defaults throughout the system. Recently, several systemic risk measures have been proposed in the literature that are used to determine capital requirements for the members subject to joint risk considerations. We address the problem of computing systemic risk measures for systems with sophisticated clearing mechanisms. In particular, we consider an extension of Rogers-Veraart network model where the operating cash flows are unrestricted in sign. We propose a mixed-integer programming problem that can be used to compute clearing vectors in this model. Due to the binary variables in this problem, the corresponding (set-valued) systemic risk measure fails to have convex values in general. We associate nonconvex vector optimization problems to the systemic risk measure and provide theoretical results related to t",
    "path": "papers/19/03/1903.08367.json",
    "total_tokens": 904,
    "translated_abstract": "系统性风险涉及到一个金融系统的不稳定性，这个系统的成员是相互依赖的，即少数机构的失败可能会在整个系统中引发一系列违约。近年来，文献提出了几个系统性风险度量指标，用于确定受联合风险考虑影响的成员的资本要求。我们解决了对于具有复杂结算机制的系统计算系统性风险度量指标的问题。特别地，我们考虑了Rogers-Veraart网络模型的扩展，其中运营现金流的符号是无限制的。我们提出了一个混合整数规划问题，可用于在此模型中计算结算向量。由于这个问题中的二元变量，相应的（集合值的）系统性风险指标通常无法具有凸值。我们将非凸向量优化问题与系统性风险度量指标相关联，并提供了与该度量指标相关的理论结果。",
    "tldr": "该论文提出了一种用混合整数规划方法计算系统性风险指标的方案，这种方案适用于具有复杂结算机制的系统。该方案关注Rogers-Veraart网络模型的扩展，用于计算结算向量，同时也与非凸向量优化问题相关联。",
    "en_tdlr": "This paper proposes a mixed-integer programming approach to compute systemic risk measures for systems with sophisticated clearing mechanisms, focusing on an extension of the Rogers-Veraart network model. The proposed approach addresses the issue of binary variables in systemic risk measures and provides theoretical results."
}