{
    "title": "Recovery Bounds on Class-Based Optimal Transport: A Sum-of-Norms Regularization Framework. (arXiv:1903.03850v3 [cs.LG] UPDATED)",
    "abstract": "We develop a novel theoretical framework for understating OT schemes respecting a class structure. For this purpose, we propose a convex OT program with a sum-of-norms regularization term, which provably recovers the underlying class structure under geometric assumptions. Furthermore, we derive an accelerated proximal algorithm with a closed-form projection and proximal operator scheme, thereby affording a more scalable algorithm for computing optimal transport plans. We provide a novel argument for the uniqueness of the optimum even in the absence of strong convexity. Our experiments show that the new regularizer not only results in a better preservation of the class structure in the data but also yields additional robustness to the data geometry, compared to previous regularizers.",
    "link": "http://arxiv.org/abs/1903.03850",
    "context": "Title: Recovery Bounds on Class-Based Optimal Transport: A Sum-of-Norms Regularization Framework. (arXiv:1903.03850v3 [cs.LG] UPDATED)\nAbstract: We develop a novel theoretical framework for understating OT schemes respecting a class structure. For this purpose, we propose a convex OT program with a sum-of-norms regularization term, which provably recovers the underlying class structure under geometric assumptions. Furthermore, we derive an accelerated proximal algorithm with a closed-form projection and proximal operator scheme, thereby affording a more scalable algorithm for computing optimal transport plans. We provide a novel argument for the uniqueness of the optimum even in the absence of strong convexity. Our experiments show that the new regularizer not only results in a better preservation of the class structure in the data but also yields additional robustness to the data geometry, compared to previous regularizers.",
    "path": "papers/19/03/1903.03850.json",
    "total_tokens": 930,
    "translated_title": "基于类结构的最优传输恢复界限: 一种范数求和正则化框架",
    "translated_abstract": "我们开展了一个新的理论框架，用于理解尊重类结构的最优传输方案。为此，我们提出了一个带有范数求和正则化项的凸性最优传输程序，该程序在几何假设条件下可证明恢复基础类结构。此外，我们推导出一种加速的近端算法，该算法具有闭式投影和近端操作符方案，从而为计算最优传输计划提供了更可扩展的算法。我们提供了一种新的唯一性优化方式，即使在缺乏强凸性的情况下，也可得到最优解。我们的实验表明，与以前的正则化程序相比，新的正则化程序不仅可以更好地保留数据中的类结构，还可以在数据几何形状方面提供额外的鲁棒性。",
    "tldr": "该论文提出了一个基于范数求和正则化项的凸性最优传输程序，在几何假设条件下可证明恢复基础类结构。该论文还提供了一种加速的近端算法，并提出了一种新的唯一性优化方式。实验表明，新的正则化程序不仅可以更好地保留数据中的类结构，还可以在数据几何形状方面提供额外的鲁棒性。",
    "en_tdlr": "The paper proposes a convex OT program with a sum-of-norms regularization term, which can recover the underlying class structure under geometric assumptions. An accelerated proximal algorithm is derived with a closed-form projection and proximal operator scheme. The paper also provides a novel argument for the uniqueness of the optimum even in the absence of strong convexity. The experiments demonstrate that the new regularizer achieves better preservation of the class structure and additional robustness to the data geometry compared to previous regularizers."
}