{
    "title": "Fine-grained Species Recognition with Privileged Pooling: Better Sample Efficiency Through Supervised Attention. (arXiv:2003.09168v4 [cs.CV] UPDATED)",
    "abstract": "We propose a scheme for supervised image classification that uses privileged information, in the form of keypoint annotations for the training data, to learn strong models from small and/or biased training sets. Our main motivation is the recognition of animal species for ecological applications such as biodiversity modelling, which is challenging because of long-tailed species distributions due to rare species, and strong dataset biases such as repetitive scene background in camera traps. To counteract these challenges, we propose a visual attention mechanism that is supervised via keypoint annotations that highlight important object parts. This privileged information, implemented as a novel privileged pooling operation, is only required during training and helps the model to focus on regions that are discriminative. In experiments with three different animal species datasets, we show that deep networks with privileged pooling can use small training sets more efficiently and generaliz",
    "link": "http://arxiv.org/abs/2003.09168",
    "context": "Title: Fine-grained Species Recognition with Privileged Pooling: Better Sample Efficiency Through Supervised Attention. (arXiv:2003.09168v4 [cs.CV] UPDATED)\nAbstract: We propose a scheme for supervised image classification that uses privileged information, in the form of keypoint annotations for the training data, to learn strong models from small and/or biased training sets. Our main motivation is the recognition of animal species for ecological applications such as biodiversity modelling, which is challenging because of long-tailed species distributions due to rare species, and strong dataset biases such as repetitive scene background in camera traps. To counteract these challenges, we propose a visual attention mechanism that is supervised via keypoint annotations that highlight important object parts. This privileged information, implemented as a novel privileged pooling operation, is only required during training and helps the model to focus on regions that are discriminative. In experiments with three different animal species datasets, we show that deep networks with privileged pooling can use small training sets more efficiently and generaliz",
    "path": "papers/20/03/2003.09168.json",
    "total_tokens": 931,
    "translated_title": "使用特权汇集的细粒度物种识别：通过监督关注提高样本效率。",
    "translated_abstract": "我们提出了一种监督图像分类方案，利用特权信息，以训练数据的关键点注释的形式，从小量和/或偏见的训练集中学习强大的模型。我们的主要动机是用于生态应用（如生物多样性建模）的动物物种识别，这是具有挑战性的，因为由于稀有物种和相机陷阱中重复的场景背景等原因，存在长尾物种分布和强烈的数据集偏差。为了应对这些挑战，我们提出了一种视觉注意机制，通过关键点注释进行监督，突出重要的物体部分。这种特权信息作为一种新颖的特权汇集操作，在训练过程中仅需要，并有助于模型专注于具有区分度的区域。在三个不同的动物物种数据集上的实验中，我们展示了带有特权汇集的深度网络可以更高效地使用小的训练集，并且具有更好的泛化性能。",
    "tldr": "该论文提出了一种使用关键点注释来监督学习模型的方案，通过特权汇集和视觉注意机制，实现了对具有长尾物种分布和数据集偏差的动物物种进行细粒度识别，提高了小样本训练的效率和泛化能力。",
    "en_tdlr": "This paper proposes a scheme that uses keypoint annotations to supervise the learning of models, achieving fine-grained recognition of animal species with long-tailed distributions and dataset biases through privileged pooling and visual attention mechanisms, thereby improving the efficiency and generalization ability of small sample training."
}