{
    "title": "Multilevel Monte Carlo with Numerical Smoothing for Robust and Efficient Computation of Probabilities and Densities. (arXiv:2003.05708v3 [q-fin.CP] UPDATED)",
    "abstract": "The multilevel Monte Carlo (MLMC) method is highly efficient for estimating expectations of a functional of a solution to a stochastic differential equation (SDE). However, MLMC estimators may be unstable and have a poor (noncanonical) complexity in the case of low regularity of the functional. To overcome this issue, we extend our previously introduced idea of numerical smoothing in (Quantitative Finance, 23(2), 209-227, 2023), in the context of deterministic quadrature methods to the MLMC setting. The numerical smoothing technique is based on root-finding methods combined with one-dimensional numerical integration with respect to a single well-chosen variable. This study is motivated by the computation of probabilities of events, pricing options with a discontinuous payoff, and density estimation problems for dynamics where the discretization of the underlying stochastic processes is necessary. The analysis and numerical experiments reveal that the numerical smoothing significantly i",
    "link": "http://arxiv.org/abs/2003.05708",
    "context": "Title: Multilevel Monte Carlo with Numerical Smoothing for Robust and Efficient Computation of Probabilities and Densities. (arXiv:2003.05708v3 [q-fin.CP] UPDATED)\nAbstract: The multilevel Monte Carlo (MLMC) method is highly efficient for estimating expectations of a functional of a solution to a stochastic differential equation (SDE). However, MLMC estimators may be unstable and have a poor (noncanonical) complexity in the case of low regularity of the functional. To overcome this issue, we extend our previously introduced idea of numerical smoothing in (Quantitative Finance, 23(2), 209-227, 2023), in the context of deterministic quadrature methods to the MLMC setting. The numerical smoothing technique is based on root-finding methods combined with one-dimensional numerical integration with respect to a single well-chosen variable. This study is motivated by the computation of probabilities of events, pricing options with a discontinuous payoff, and density estimation problems for dynamics where the discretization of the underlying stochastic processes is necessary. The analysis and numerical experiments reveal that the numerical smoothing significantly i",
    "path": "papers/20/03/2003.05708.json",
    "total_tokens": 920,
    "translated_title": "多层蒙特卡罗方法与数值平滑用于可靠高效计算概率与密度",
    "translated_abstract": "多层蒙特卡罗（MLMC）方法在估计随机微分方程（SDE）解的函数期望时非常高效。然而，在函数低正则性的情况下，MLMC估计器可能不稳定且复杂性差（非标准复杂度）。为了解决这个问题，我们将我们先前在《量化金融》中介绍的数值平滑方法（数值平滑方法基于找根法和一维数值积分）扩展到MLMC设置中。这个研究与在概率计算、背离奖励的期权定价以及需要对底层随机进程进行离散化密度估计问题相关。分析和数值实验表明，数值平滑在上述应用中显著提高了MLMC估计器的稳定性和复杂性。",
    "tldr": "本研究使用多层蒙特卡罗与数值平滑方法，解决了函数低正则性时的估计器不稳定和复杂度差问题，可以用于概率计算、背离奖励的期权定价和随机进程的密度估计等场景。",
    "en_tdlr": "This study presents the use of Multilevel Monte Carlo with numerical smoothing to improve stability and complexity in estimating low regularity functionals, applicable in probability computation, pricing options with a discontinuous payoff and density estimation in stochastic processes with discretization."
}