{
    "title": "Optimal No-regret Learning in Repeated First-price Auctions. (arXiv:2003.09795v6 [cs.LG] UPDATED)",
    "abstract": "We study online learning in repeated first-price auctions where a bidder, only observing the winning bid at the end of each auction, learns to adaptively bid in order to maximize her cumulative payoff. To achieve this goal, the bidder faces a censored feedback: if she wins the bid, then she is not able to observe the highest bid of the other bidders, which we assume is \\textit{iid} drawn from an unknown distribution. In this paper, we develop the first learning algorithm that achieves a near-optimal $\\widetilde{O}(\\sqrt{T})$ regret bound, by exploiting two structural properties of first-price auctions, i.e. the specific feedback structure and payoff function.  The feedback in first-price auctions combines the graph feedback across actions (bids), the cross learning across contexts (private values), and a partial order over the contexts; we generalize it as the partially ordered contextual bandits. We establish both strengths and weaknesses of this framework, by showing a curious separa",
    "link": "http://arxiv.org/abs/2003.09795",
    "context": "Title: Optimal No-regret Learning in Repeated First-price Auctions. (arXiv:2003.09795v6 [cs.LG] UPDATED)\nAbstract: We study online learning in repeated first-price auctions where a bidder, only observing the winning bid at the end of each auction, learns to adaptively bid in order to maximize her cumulative payoff. To achieve this goal, the bidder faces a censored feedback: if she wins the bid, then she is not able to observe the highest bid of the other bidders, which we assume is \\textit{iid} drawn from an unknown distribution. In this paper, we develop the first learning algorithm that achieves a near-optimal $\\widetilde{O}(\\sqrt{T})$ regret bound, by exploiting two structural properties of first-price auctions, i.e. the specific feedback structure and payoff function.  The feedback in first-price auctions combines the graph feedback across actions (bids), the cross learning across contexts (private values), and a partial order over the contexts; we generalize it as the partially ordered contextual bandits. We establish both strengths and weaknesses of this framework, by showing a curious separa",
    "path": "papers/20/03/2003.09795.json",
    "total_tokens": 1114,
    "translated_title": "重复首价拍卖中的最优无悔学习",
    "translated_abstract": "本研究探讨了在重复首价拍卖中的在线学习问题，拍卖者只在每次拍卖结束后看到最高的出价，为了最大化收益，她必须进行适应性出价。然而，拍卖者只能面对被审查的反馈，如果她赢得出价，就无法观察到其他竞标者的最高出价，而其他竞标者的最高出价是从未知的分布中\\textit{iid}抽取的。本文开发了第一个学习算法，通过利用首价拍卖的两个结构性质，即特定的反馈结构和支付函数，实现了接近最优的$\\widetilde{O}(\\sqrt{T})$遗憾界限。首价拍卖中的反馈机制结合了跨行动(出价)的图形反馈、跨上下文(私人价值)的交叉学习以及对上下文的部分排序，我们将其推广为部分排序情境赌博机。通过展示损失函数与优化结构之间的奇怪分离，我们建立了此框架的优点和缺点。我们的算法使用后验风险最小化的有效变体，称为“带有基于方差的正则化的连续调用正则化经验风险最小化器”。我们的分析利用了对问题本质结构和Kwon-Singer定理的仔细探索。",
    "tldr": "本文提出了重复首价拍卖的最优无悔学习算法，通过利用特定的反馈结构和支付函数，实现了接近最优的遗憾界限。",
    "en_tdlr": "This paper proposes an optimal no-regret learning algorithm for repeated first-price auctions by exploiting the specific feedback structure and payoff function, achieving a near-optimal $\\widetilde{O}(\\sqrt{T})$ regret bound. The algorithm uses an efficient variant of the mirror descent algorithm and the analysis utilizes the Kwon-Singer theorem from optimal transport theory."
}