{
    "title": "A diffusion approach to Stein's method on Riemannian manifolds. (arXiv:2003.11497v3 [math.PR] UPDATED)",
    "abstract": "We detail an approach to develop Stein's method for bounding integral metrics on probability measures defined on a Riemannian manifold $\\mathbf M$. Our approach exploits the relationship between the generator of a diffusion on $\\mathbf M$ with target invariant measure and its characterising Stein operator. We consider a pair of such diffusions with different starting points, and through analysis of the distance process between the pair, derive Stein factors, which bound the solution to the Stein equation and its derivatives. The Stein factors contain curvature-dependent terms and reduce to those currently available for $\\mathbb R^m$, and moreover imply that the bounds for $\\mathbb R^m$ remain valid when $\\mathbf M$ is a flat manifold",
    "link": "http://arxiv.org/abs/2003.11497",
    "context": "Title: A diffusion approach to Stein's method on Riemannian manifolds. (arXiv:2003.11497v3 [math.PR] UPDATED)\nAbstract: We detail an approach to develop Stein's method for bounding integral metrics on probability measures defined on a Riemannian manifold $\\mathbf M$. Our approach exploits the relationship between the generator of a diffusion on $\\mathbf M$ with target invariant measure and its characterising Stein operator. We consider a pair of such diffusions with different starting points, and through analysis of the distance process between the pair, derive Stein factors, which bound the solution to the Stein equation and its derivatives. The Stein factors contain curvature-dependent terms and reduce to those currently available for $\\mathbb R^m$, and moreover imply that the bounds for $\\mathbb R^m$ remain valid when $\\mathbf M$ is a flat manifold",
    "path": "papers/20/03/2003.11497.json",
    "total_tokens": 754,
    "translated_title": "Riemann流形上Stein方法的扩散方法",
    "translated_abstract": "我们详细阐述了一种用于边界概率流形上积分度量限制的Stein方法的方法。我们的方法利用了扩散在$\\mathbf M$上生成器与其表征Stein算子之间的关系。我们考虑了一对具有不同起始点的此类扩散，并通过分析它们之间的距离过程，导出了Stein因子，这些因子限制了Stein方程及其导数。Stein因子包含曲率相关的项，并缩减到目前适用于$\\mathbb R^m$的因子，并且意味着当$\\mathbf M$是平坦流形时，对于$\\mathbb R ^m$的限制仍然有效。",
    "tldr": "该论文介绍了一种用于Riemann流形上积分度量限制的Stein方法的扩散方法，并通过分析一对具有不同起始点的扩散之间的距离过程，导出了曲率相关的Stein因子。",
    "en_tdlr": "This paper introduces a diffusion approach to Stein's method for bounding integral metrics on Riemannian manifolds, which derives curvature-dependent Stein factors by analyzing the distance process between a pair of diffusions with different starting points."
}