{
    "title": "Analysis of ResearchGate, A Community Detection Approach. (arXiv:2003.05591v3 [cs.SI] UPDATED)",
    "abstract": "We are living in the data age. Communications over scientific networks creates new opportunities for researchers who aim to discover the hidden pattern in these huge repositories. This study utilizes network science to create collaboration network of Iranian Scientific Institutions. A modularity-based approach applied to find network communities. To reach a big picture of science production flow, analysis of the collaboration network is crucial. Our results demonstrated that geographic location closeness and ethnic attributes has important roles in academic collaboration network establishment. Besides, it shows that famous scientific centers in the capital city of Iran, Tehran has strong influence on the production flow of scientific activities. These academic papers are mostly viewed and downloaded from the United State of America, China, India, and Iran. The motivation of this research is that by discovering hidden communities in the network and finding the structure of intuitions co",
    "link": "http://arxiv.org/abs/2003.05591",
    "context": "Title: Analysis of ResearchGate, A Community Detection Approach. (arXiv:2003.05591v3 [cs.SI] UPDATED)\nAbstract: We are living in the data age. Communications over scientific networks creates new opportunities for researchers who aim to discover the hidden pattern in these huge repositories. This study utilizes network science to create collaboration network of Iranian Scientific Institutions. A modularity-based approach applied to find network communities. To reach a big picture of science production flow, analysis of the collaboration network is crucial. Our results demonstrated that geographic location closeness and ethnic attributes has important roles in academic collaboration network establishment. Besides, it shows that famous scientific centers in the capital city of Iran, Tehran has strong influence on the production flow of scientific activities. These academic papers are mostly viewed and downloaded from the United State of America, China, India, and Iran. The motivation of this research is that by discovering hidden communities in the network and finding the structure of intuitions co",
    "path": "papers/20/03/2003.05591.json",
    "total_tokens": 864,
    "translated_title": "研究ResearchGate的社区检测方法分析",
    "translated_abstract": "我们正处于数据时代。在科学网络中的交流为希望在这些巨大的知识库中发现隐藏模式的研究人员创造了新的机会。本研究利用网络科学方法创建了伊朗科学机构的协作网络，并应用基于模块性的方法来发现网络社区。分析协作网络对于理解科研产出流程至关重要。我们的研究结果表明，地理位置的亲近性和民族属性在学术协作网络的建立中起着重要作用。此外，研究还显示伊朗首都德黑兰的著名科研中心对科研活动的产出流程具有强大影响力。这些学术论文主要被美国、中国、印度和伊朗浏览和下载。本研究的动机在于通过发现网络中的隐藏社区并找到机构间的结构，从而促进学术研究的发展。",
    "tldr": "这项研究利用网络科学方法分析了ResearchGate社区，并发现了地理位置和民族属性对学术协作网络的建立和科研产出流程具有重要影响。这有助于促进学术研究的发展。",
    "en_tdlr": "This study analyzed ResearchGate community using network science and found that geographic location and ethnic attributes have significant impact on the establishment of academic collaboration networks and the flow of scientific production. This contributes to the advancement of academic research."
}