{
    "title": "Improving Certified Robustness via Statistical Learning with Logical Reasoning. (arXiv:2003.00120v9 [cs.LG] UPDATED)",
    "abstract": "Intensive algorithmic efforts have been made to enable the rapid improvements of certificated robustness for complex ML models recently. However, current robustness certification methods are only able to certify under a limited perturbation radius. Given that existing pure data-driven statistical approaches have reached a bottleneck, in this paper, we propose to integrate statistical ML models with knowledge (expressed as logical rules) as a reasoning component using Markov logic networks (MLN, so as to further improve the overall certified robustness. This opens new research questions about certifying the robustness of such a paradigm, especially the reasoning component (e.g., MLN). As the first step towards understanding these questions, we first prove that the computational complexity of certifying the robustness of MLN is #P-hard. Guided by this hardness result, we then derive the first certified robustness bound for MLN by carefully analyzing different model regimes. Finally, we c",
    "link": "http://arxiv.org/abs/2003.00120",
    "context": "Title: Improving Certified Robustness via Statistical Learning with Logical Reasoning. (arXiv:2003.00120v9 [cs.LG] UPDATED)\nAbstract: Intensive algorithmic efforts have been made to enable the rapid improvements of certificated robustness for complex ML models recently. However, current robustness certification methods are only able to certify under a limited perturbation radius. Given that existing pure data-driven statistical approaches have reached a bottleneck, in this paper, we propose to integrate statistical ML models with knowledge (expressed as logical rules) as a reasoning component using Markov logic networks (MLN, so as to further improve the overall certified robustness. This opens new research questions about certifying the robustness of such a paradigm, especially the reasoning component (e.g., MLN). As the first step towards understanding these questions, we first prove that the computational complexity of certifying the robustness of MLN is #P-hard. Guided by this hardness result, we then derive the first certified robustness bound for MLN by carefully analyzing different model regimes. Finally, we c",
    "path": "papers/20/03/2003.00120.json",
    "total_tokens": 935,
    "translated_title": "通过逻辑推理与统计学习提高认证鲁棒性",
    "translated_abstract": "最近，针对复杂 ML 模型的认证鲁棒性快速提高需要进行密集的算法工作。然而，目前鲁棒性认证方法只能在有限的扰动半径内进行认证。考虑到现有的纯数据驱动的统计方法已经达到瓶颈，在本文中，我们提出使用马尔可夫逻辑网络（MLN）将统计 ML 模型与知识（通过逻辑规则表示）作为推理组件进行集成，以进一步提高整体的认证鲁棒性。这引发了关于认证这种范式（特别是推理组件，如 MLN）鲁棒性的新的研究问题。作为理解这些问题的第一步，我们首先证明了证明 MLN 鲁棒性计算复杂度是 #P-难的。在这个难度结果的指导下，我们通过仔细分析不同的模型规则，推导出了 MLN 的第一个认证的鲁棒性界限。最后，我们在两个广泛使用的数据集上进行了实验验证。",
    "tldr": "本研究通过将统计 ML 模型与逻辑推理组件集成，提出了方法来进一步提高 ML 模型的认证鲁棒性，同时给出了首个适用于马尔可夫逻辑网络的鲁棒性界限。",
    "en_tdlr": "This paper proposes a method to improve the certified robustness of ML models by integrating statistical ML models with logical reasoning components using Markov logic networks. It also provides the first certified robustness bound for Markov logic networks and raises new questions for certifying the robustness of such a paradigm."
}