<rss version="2.0"><channel><title>Chat Arxiv cs.CL</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CL</description><item><title>&#36890;&#36807;OccCANINE&#24037;&#20855;&#65292;&#25105;&#20204;&#25104;&#21151;&#25171;&#30772;&#20102;HISCO&#38556;&#30861;&#65292;&#23454;&#29616;&#20102;&#33258;&#21160;&#21270;&#32844;&#19994;&#26631;&#20934;&#21270;&#65292;&#20174;&#32780;&#22823;&#22823;&#31616;&#21270;&#20102;&#23545;&#32844;&#19994;&#25551;&#36848;&#30340;&#22788;&#29702;&#21644;&#20998;&#31867;&#36807;&#31243;&#65292;&#20026;&#32463;&#27982;&#23398;&#12289;&#32463;&#27982;&#21382;&#21490;&#31561;&#39046;&#22495;&#30340;&#32844;&#19994;&#32467;&#26500;&#20998;&#26512;&#25552;&#20379;&#20102;&#39640;&#25928;&#19988;&#20934;&#30830;&#30340;&#25968;&#25454;&#12290;</title><link>https://arxiv.org/abs/2402.13604</link><description>&lt;p&gt;
&#25171;&#30772;HISCO&#38556;&#30861;&#65306;&#20351;&#29992;OccCANINE&#36827;&#34892;&#33258;&#21160;&#32844;&#19994;&#26631;&#20934;&#21270;
&lt;/p&gt;
&lt;p&gt;
Breaking the HISCO Barrier: Automatic Occupational Standardization with OccCANINE
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.13604
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;OccCANINE&#24037;&#20855;&#65292;&#25105;&#20204;&#25104;&#21151;&#25171;&#30772;&#20102;HISCO&#38556;&#30861;&#65292;&#23454;&#29616;&#20102;&#33258;&#21160;&#21270;&#32844;&#19994;&#26631;&#20934;&#21270;&#65292;&#20174;&#32780;&#22823;&#22823;&#31616;&#21270;&#20102;&#23545;&#32844;&#19994;&#25551;&#36848;&#30340;&#22788;&#29702;&#21644;&#20998;&#31867;&#36807;&#31243;&#65292;&#20026;&#32463;&#27982;&#23398;&#12289;&#32463;&#27982;&#21382;&#21490;&#31561;&#39046;&#22495;&#30340;&#32844;&#19994;&#32467;&#26500;&#20998;&#26512;&#25552;&#20379;&#20102;&#39640;&#25928;&#19988;&#20934;&#30830;&#30340;&#25968;&#25454;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#26032;&#24037;&#20855;OccCANINE&#65292;&#21487;&#33258;&#21160;&#23558;&#32844;&#19994;&#25551;&#36848;&#36716;&#25442;&#20026;HISCO&#20998;&#31867;&#31995;&#32479;&#12290;&#22788;&#29702;&#21644;&#20998;&#31867;&#32844;&#19994;&#25551;&#36848;&#28041;&#21450;&#30340;&#25163;&#21160;&#24037;&#20316;&#23481;&#26131;&#20986;&#38169;&#12289;&#32321;&#29712;&#19988;&#32791;&#26102;&#12290;&#25105;&#20204;&#23545;&#19968;&#20010;&#29616;&#26377;&#30340;&#35821;&#35328;&#27169;&#22411;&#65288;CANINE&#65289;&#36827;&#34892;&#20102;&#24494;&#35843;&#65292;&#20351;&#20854;&#33021;&#22815;&#22312;&#20960;&#31186;&#38047;&#21040;&#20960;&#20998;&#38047;&#20869;&#33258;&#21160;&#23436;&#25104;&#27492;&#36807;&#31243;&#65292;&#32780;&#20197;&#21069;&#38656;&#35201;&#25968;&#22825;&#29978;&#33267;&#25968;&#21608;&#12290;&#35813;&#27169;&#22411;&#22312;&#26469;&#33258;22&#20010;&#19981;&#21516;&#26469;&#28304;&#36129;&#29486;&#30340;13&#31181;&#35821;&#35328;&#20013;&#30340;1400&#19975;&#23545;&#32844;&#19994;&#25551;&#36848;&#21644;HISCO&#20195;&#30721;&#19978;&#36827;&#34892;&#35757;&#32451;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#34920;&#29616;&#20986;&#31934;&#24230;&#12289;&#21484;&#22238;&#29575;&#21644;&#20934;&#30830;&#29575;&#22343;&#36229;&#36807;90%&#12290;&#25105;&#20204;&#30340;&#24037;&#20855;&#31361;&#30772;&#20102;&#35937;&#24449;&#24615;HISCO&#38556;&#30861;&#65292;&#24182;&#20351;&#36825;&#20123;&#25968;&#25454;&#21487;&#20379;&#32463;&#27982;&#23398;&#12289;&#32463;&#27982;&#21382;&#21490;&#21644;&#21508;&#31181;&#30456;&#20851;&#23398;&#31185;&#20013;&#30340;&#32844;&#19994;&#32467;&#26500;&#20998;&#26512;&#20351;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.13604v1 Announce Type: new  Abstract: This paper introduces a new tool, OccCANINE, to automatically transform occupational descriptions into the HISCO classification system. The manual work involved in processing and classifying occupational descriptions is error-prone, tedious, and time-consuming. We finetune a preexisting language model (CANINE) to do this automatically thereby performing in seconds and minutes what previously took days and weeks. The model is trained on 14 million pairs of occupational descriptions and HISCO codes in 13 different languages contributed by 22 different sources. Our approach is shown to have accuracy, recall and precision above 90 percent. Our tool breaks the metaphorical HISCO barrier and makes this data readily available for analysis of occupational structures with broad applicability in economics, economic history and various related disciplines.
&lt;/p&gt;</description></item><item><title>ChatGPT&#34920;&#29616;&#20986;&#20154;&#31867;&#35821;&#35328;&#22788;&#29702;&#30340;&#38899;&#38901;&#20559;&#35265;&#65292;&#26356;&#20542;&#21521;&#20110;&#20351;&#29992;&#36741;&#38899;&#32780;&#19981;&#26159;&#20803;&#38899;&#26469;&#35782;&#21035;&#21333;&#35789;&#12290;</title><link>http://arxiv.org/abs/2305.15929</link><description>&lt;p&gt;
ChatGPT&#20013;&#20986;&#29616;&#20102;&#38899;&#38901;&#20559;&#35265;
&lt;/p&gt;
&lt;p&gt;
Emergence of a phonological bias in ChatGPT. (arXiv:2305.15929v1 [cs.CL])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.15929
&lt;/p&gt;
&lt;p&gt;
ChatGPT&#34920;&#29616;&#20986;&#20154;&#31867;&#35821;&#35328;&#22788;&#29702;&#30340;&#38899;&#38901;&#20559;&#35265;&#65292;&#26356;&#20542;&#21521;&#20110;&#20351;&#29992;&#36741;&#38899;&#32780;&#19981;&#26159;&#20803;&#38899;&#26469;&#35782;&#21035;&#21333;&#35789;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24403;&#21069;&#30340;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65292;&#20363;&#22914;OpenAI&#30340;ChatGPT&#65292;&#22240;&#20854;&#22312;&#35821;&#35328;&#20351;&#29992;&#26041;&#38754;&#30340;&#20986;&#33394;&#34920;&#29616;&#32780;&#21463;&#21040;&#20844;&#20247;&#30340;&#20851;&#27880;&#12290;&#22312;&#36825;&#37324;&#65292;&#25105;&#35777;&#26126;&#20102;ChatGPT&#26174;&#31034;&#20102;&#20154;&#31867;&#35821;&#35328;&#22788;&#29702;&#30340;&#38899;&#38901;&#20559;&#35265;&#12290;&#26356;&#20855;&#20307;&#22320;&#35828;&#65292;&#23601;&#20687;&#20154;&#31867;&#19968;&#26679;&#65292;ChatGPT&#20855;&#26377;&#19968;&#20010;&#36741;&#38899;&#20559;&#35265;&#12290;&#20063;&#23601;&#26159;&#35828;&#65292;&#36825;&#20010;&#32842;&#22825;&#26426;&#22120;&#20154;&#20542;&#21521;&#20110;&#20351;&#29992;&#36741;&#38899;&#32780;&#19981;&#26159;&#20803;&#38899;&#26469;&#35782;&#21035;&#21333;&#35789;&#12290;&#36825;&#22312;&#20855;&#26377;&#19981;&#21516;&#36741;&#38899;&#21644;&#20803;&#38899;&#20998;&#24067;&#27604;&#20363;&#30340;&#35821;&#35328;&#65288;&#22914;&#33521;&#35821;&#21644;&#35199;&#29677;&#29273;&#35821;&#65289;&#20013;&#37117;&#26377;&#35266;&#23519;&#21040;&#12290;&#23613;&#31649;&#24403;&#21069;&#20154;&#24037;&#26234;&#33021;&#35821;&#35328;&#27169;&#22411;&#22312;&#22788;&#29702;&#35821;&#35328;&#21050;&#28608;&#21644;&#20154;&#31867;&#23156;&#20799;&#33719;&#24471;&#35821;&#35328;&#30340;&#26041;&#24335;&#19978;&#23384;&#22312;&#24046;&#24322;&#65292;&#20294;&#36825;&#26679;&#30340;&#35757;&#32451;&#20284;&#20046;&#36275;&#20197;&#22312;ChatGPT&#20013;&#24341;&#20986;&#19968;&#20010;&#38899;&#38901;&#20559;&#35265;&#12290;
&lt;/p&gt;
&lt;p&gt;
Current large language models, such as OpenAI's ChatGPT, have captured the public's attention because how remarkable they are in the use of language. Here, I demonstrate that ChatGPT displays phonological biases that are a hallmark of human language processing. More concretely, just like humans, ChatGPT has a consonant bias. That is, the chatbot has a tendency to use consonants over vowels to identify words. This is observed across languages that differ in their relative distribution of consonants and vowels such as English and Spanish. Despite the differences in how current artificial intelligence language models are trained to process linguistic stimuli and how human infants acquire language, such training seems to be enough for the emergence of a phonological bias in ChatGPT
&lt;/p&gt;</description></item><item><title>ChatGPT&#24102;&#26469;&#30340;&#22823;&#35821;&#35328;&#27169;&#22411;(LLMs)&#34429;&#28982;&#26377;&#24456;&#22810;&#20248;&#21183;&#65292;&#20294;&#26159;&#38543;&#26426;&#40550;&#40521;&#21644;&#24187;&#35273;&#31561;&#26032;&#30340;&#27861;&#24459;&#21644;&#20262;&#29702;&#39118;&#38505;&#20063;&#38543;&#20043;&#32780;&#26469;&#12290;&#27431;&#27954;AI&#30417;&#31649;&#33539;&#24335;&#38656;&#35201;&#36827;&#19968;&#27493;&#21457;&#23637;&#20197;&#20943;&#36731;&#36825;&#20123;&#39118;&#38505;&#12290;</title><link>http://arxiv.org/abs/2304.14347</link><description>&lt;p&gt;
ChatGPT&#30340;&#40657;&#26263;&#38754;&#65306;&#26469;&#33258;&#38543;&#26426;&#40550;&#40521;&#21644;&#24187;&#35273;&#30340;&#27861;&#24459;&#21644;&#20262;&#29702;&#25361;&#25112;
&lt;/p&gt;
&lt;p&gt;
The Dark Side of ChatGPT: Legal and Ethical Challenges from Stochastic Parrots and Hallucination. (arXiv:2304.14347v1 [cs.CY])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.14347
&lt;/p&gt;
&lt;p&gt;
ChatGPT&#24102;&#26469;&#30340;&#22823;&#35821;&#35328;&#27169;&#22411;(LLMs)&#34429;&#28982;&#26377;&#24456;&#22810;&#20248;&#21183;&#65292;&#20294;&#26159;&#38543;&#26426;&#40550;&#40521;&#21644;&#24187;&#35273;&#31561;&#26032;&#30340;&#27861;&#24459;&#21644;&#20262;&#29702;&#39118;&#38505;&#20063;&#38543;&#20043;&#32780;&#26469;&#12290;&#27431;&#27954;AI&#30417;&#31649;&#33539;&#24335;&#38656;&#35201;&#36827;&#19968;&#27493;&#21457;&#23637;&#20197;&#20943;&#36731;&#36825;&#20123;&#39118;&#38505;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38543;&#30528;ChatGPT&#30340;&#25512;&#20986;&#65292;&#22823;&#35821;&#35328;&#27169;&#22411;&#65288;LLMs&#65289;&#27491;&#22312;&#21160;&#25671;&#25105;&#20204;&#25972;&#20010;&#31038;&#20250;&#65292;&#24555;&#36895;&#25913;&#21464;&#25105;&#20204;&#30340;&#24605;&#32500;&#12289;&#21019;&#36896;&#21644;&#29983;&#27963;&#26041;&#24335;&#12290;&#28982;&#32780;&#65292;&#38543;&#30528;&#38543;&#26426;&#40550;&#40521;&#21644;&#24187;&#35273;&#31561;&#26032;&#30340;&#27861;&#24459;&#21644;&#20262;&#29702;&#39118;&#38505;&#20986;&#29616;&#65292;&#26032;&#20852;LLMs&#20063;&#24102;&#26469;&#20102;&#35768;&#22810;&#25361;&#25112;&#12290;&#27431;&#30431;&#26159;&#31532;&#19968;&#20010;&#23558;&#37325;&#28857;&#25918;&#22312;AI&#27169;&#22411;&#30417;&#31649;&#19978;&#30340;&#21496;&#27861;&#31649;&#36758;&#21306;&#12290;&#28982;&#32780;&#65292;&#26032;LLMs&#24102;&#26469;&#30340;&#39118;&#38505;&#21487;&#33021;&#20250;&#34987;&#26032;&#20852;&#30340;&#27431;&#30431;&#30417;&#31649;&#33539;&#24335;&#25152;&#20302;&#20272;&#12290;&#22240;&#27492;&#65292;&#26412;&#20989;&#21578;&#35686;&#31034;&#27431;&#27954;AI&#30417;&#31649;&#33539;&#24335;&#24517;&#39035;&#36827;&#19968;&#27493;&#21457;&#23637;&#20197;&#20943;&#36731;&#36825;&#20123;&#39118;&#38505;&#12290;
&lt;/p&gt;
&lt;p&gt;
With the launch of ChatGPT, Large Language Models (LLMs) are shaking up our whole society, rapidly altering the way we think, create and live. For instance, the GPT integration in Bing has altered our approach to online searching. While nascent LLMs have many advantages, new legal and ethical risks are also emerging, stemming in particular from stochastic parrots and hallucination. The EU is the first and foremost jurisdiction that has focused on the regulation of AI models. However, the risks posed by the new LLMs are likely to be underestimated by the emerging EU regulatory paradigm. Therefore, this correspondence warns that the European AI regulatory paradigm must evolve further to mitigate such risks.
&lt;/p&gt;</description></item></channel></rss>