<rss version="2.0"><channel><title>Chat Arxiv cs.CL</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CL</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;DistilWhisper&#26041;&#27861;&#65292;&#36890;&#36807;&#20351;&#29992;&#35821;&#35328;&#29305;&#23450;&#19987;&#23478;&#36827;&#34892;&#36731;&#37327;&#32423;&#27169;&#22359;&#21270;ASR&#24494;&#35843;&#21644;&#30693;&#35782;&#33976;&#39311;&#65292;&#25104;&#21151;&#24357;&#21512;&#20102;&#22810;&#20219;&#21153;&#35821;&#38899;&#27169;&#22411;&#22312;&#23569;&#25968;&#35821;&#35328;&#19978;&#30340;&#24615;&#33021;&#24046;&#36317;&#65292;&#21516;&#26102;&#20445;&#30041;&#20102;&#22810;&#20219;&#21153;&#21644;&#22810;&#35821;&#35328;&#33021;&#21147;&#30340;&#20248;&#21183;&#12290;</title><link>http://arxiv.org/abs/2311.01070</link><description>&lt;p&gt;
DistilWhisper&#65306;&#36890;&#36807;&#35821;&#35328;&#29305;&#23450;&#19987;&#23478;&#39640;&#25928;&#21387;&#32553;&#22810;&#20219;&#21153;&#35821;&#38899;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
DistilWhisper: Efficient Distillation of Multi-task Speech Models via Language-Specific Experts. (arXiv:2311.01070v1 [cs.CL])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2311.01070
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;DistilWhisper&#26041;&#27861;&#65292;&#36890;&#36807;&#20351;&#29992;&#35821;&#35328;&#29305;&#23450;&#19987;&#23478;&#36827;&#34892;&#36731;&#37327;&#32423;&#27169;&#22359;&#21270;ASR&#24494;&#35843;&#21644;&#30693;&#35782;&#33976;&#39311;&#65292;&#25104;&#21151;&#24357;&#21512;&#20102;&#22810;&#20219;&#21153;&#35821;&#38899;&#27169;&#22411;&#22312;&#23569;&#25968;&#35821;&#35328;&#19978;&#30340;&#24615;&#33021;&#24046;&#36317;&#65292;&#21516;&#26102;&#20445;&#30041;&#20102;&#22810;&#20219;&#21153;&#21644;&#22810;&#35821;&#35328;&#33021;&#21147;&#30340;&#20248;&#21183;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
Whisper&#26159;&#19968;&#20010;&#22810;&#20219;&#21153;&#21644;&#22810;&#35821;&#35328;&#30340;&#35821;&#38899;&#27169;&#22411;&#65292;&#28085;&#30422;99&#31181;&#35821;&#35328;&#12290;&#23427;&#22312;&#20854;&#28085;&#30422;&#30340;&#37096;&#20998;&#35821;&#35328;&#20013;&#33719;&#24471;&#20102;&#20196;&#20154;&#31216;&#36190;&#30340;&#33258;&#21160;&#35821;&#38899;&#35782;&#21035;&#65288;ASR&#65289;&#32467;&#26524;&#65292;&#20294;&#22312;&#19968;&#20123;&#25968;&#37327;&#21487;&#35266;&#30340;&#23569;&#25968;&#35821;&#35328;&#20013;&#65292;&#35813;&#27169;&#22411;&#20173;&#28982;&#34920;&#29616;&#19981;&#20339;&#65292;&#23588;&#20854;&#22312;&#36739;&#23567;&#30340;&#27169;&#22411;&#29256;&#26412;&#20013;&#34920;&#29616;&#26356;&#20026;&#20005;&#37325;&#12290;&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;DistilWhisper&#65292;&#19968;&#31181;&#33021;&#22815;&#22312;ASR&#26041;&#38754;&#24357;&#21512;&#36825;&#20123;&#35821;&#35328;&#30340;&#24615;&#33021;&#24046;&#36317;&#65292;&#21516;&#26102;&#20445;&#30041;&#22810;&#20219;&#21153;&#21644;&#22810;&#35821;&#35328;&#33021;&#21147;&#20248;&#21183;&#30340;&#26041;&#27861;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#21253;&#25324;&#20004;&#20010;&#20851;&#38190;&#31574;&#30053;&#65306;&#20351;&#29992;&#35821;&#35328;&#29305;&#23450;&#19987;&#23478;&#23545;whisper-small&#36827;&#34892;&#36731;&#37327;&#32423;&#27169;&#22359;&#21270;ASR&#24494;&#35843;&#65292;&#24182;&#20174;whisper-large-v2&#36827;&#34892;&#30693;&#35782;&#33976;&#39311;&#12290;&#36825;&#31181;&#21452;&#37325;&#26041;&#27861;&#20351;&#25105;&#20204;&#33021;&#22815;&#22312;&#20445;&#25345;&#22810;&#20219;&#21153;&#21644;&#22810;&#35821;&#35328;&#39044;&#35757;&#32451;&#30340;&#40065;&#26834;&#24615;&#30340;&#21516;&#26102;&#26377;&#25928;&#25552;&#21319;ASR&#24615;&#33021;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;&#25105;&#20204;&#30340;&#26041;&#27861;&#27604;&#26631;&#20934;&#24494;&#35843;&#25110;LoRA&#36866;&#37197;&#22120;&#26356;&#26377;&#25928;&#65292;&#22312;&#30446;&#26631;&#35821;&#35328;&#20013;&#25552;&#21319;&#20102;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;
Whisper is a multitask and multilingual speech model covering 99 languages. It yields commendable automatic speech recognition (ASR) results in a subset of its covered languages, but the model still under-performs on a non-negligible number of under-represented languages, a problem exacerbated in smaller model versions. In this work, we propose DistilWhisper, an approach able to bridge the performance gap in ASR for these languages while retaining the advantages of multitask and multilingual capabilities. Our approach involves two key strategies: lightweight modular ASR fine-tuning of whisper-small using language-specific experts, and knowledge distillation from whisper-large-v2. This dual approach allows us to effectively boost ASR performance while keeping the robustness inherited from the multitask and multilingual pre-training. Results demonstrate that our approach is more effective than standard fine-tuning or LoRA adapters, boosting performance in the targeted languages for both 
&lt;/p&gt;</description></item></channel></rss>