<rss version="2.0"><channel><title>Chat Arxiv cs.CL</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CL</description><item><title>&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;MUSE&#30340;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65292;&#36890;&#36807;&#35775;&#38382;&#26368;&#26032;&#20449;&#24687;&#24182;&#35780;&#20272;&#21487;&#20449;&#24230;&#65292;&#20197;&#35299;&#20915;&#31038;&#20132;&#23186;&#20307;&#19978;&#35823;&#20449;&#24687;&#32416;&#27491;&#30340;&#38590;&#39064;&#12290;</title><link>https://arxiv.org/abs/2403.11169</link><description>&lt;p&gt;
&#20351;&#29992;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#32416;&#27491;&#31038;&#20132;&#23186;&#20307;&#19978;&#30340;&#38169;&#35823;&#20449;&#24687;
&lt;/p&gt;
&lt;p&gt;
Correcting misinformation on social media with a large language model
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.11169
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;MUSE&#30340;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65292;&#36890;&#36807;&#35775;&#38382;&#26368;&#26032;&#20449;&#24687;&#24182;&#35780;&#20272;&#21487;&#20449;&#24230;&#65292;&#20197;&#35299;&#20915;&#31038;&#20132;&#23186;&#20307;&#19978;&#35823;&#20449;&#24687;&#32416;&#27491;&#30340;&#38590;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35823;&#20449;&#24687;&#20250;&#30772;&#22351;&#20844;&#20247;&#23545;&#31185;&#23398;&#21644;&#27665;&#20027;&#30340;&#20449;&#20219;&#65292;&#29305;&#21035;&#26159;&#22312;&#31038;&#20132;&#23186;&#20307;&#19978;&#65292;&#19981;&#20934;&#30830;&#20449;&#24687;&#20250;&#36805;&#36895;&#20256;&#25773;&#12290;&#19987;&#23478;&#21644;&#26222;&#36890;&#20154;&#36890;&#36807;&#25163;&#21160;&#35782;&#21035;&#21644;&#35299;&#37322;&#19981;&#20934;&#30830;&#20449;&#24687;&#24050;&#32463;&#34987;&#35777;&#26126;&#26159;&#26377;&#25928;&#30340;&#32416;&#27491;&#35823;&#20449;&#24687;&#30340;&#26041;&#27861;&#12290;&#28982;&#32780;&#65292;&#36825;&#31181;&#26041;&#27861;&#24456;&#38590;&#25193;&#23637;&#65292;&#36825;&#26159;&#19968;&#20010;&#25285;&#24551;&#65292;&#22240;&#20026;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLMs&#65289;&#31561;&#25216;&#26415;&#20351;&#35823;&#20449;&#24687;&#26356;&#23481;&#26131;&#29983;&#25104;&#12290;LLMs&#36824;&#20855;&#26377;&#22810;&#21151;&#33021;&#33021;&#21147;&#65292;&#21487;&#20197;&#21152;&#36895;&#32416;&#27491;&#35823;&#20449;&#24687;&#65307;&#28982;&#32780;&#65292;&#23427;&#20204;&#30001;&#20110;&#32570;&#20047;&#26368;&#26032;&#20449;&#24687;&#12289;&#20542;&#21521;&#20110;&#29983;&#25104;&#20284;&#26159;&#32780;&#38750;&#30340;&#20869;&#23481;&#21644;&#24341;&#29992;&#20197;&#21450;&#26080;&#27861;&#22788;&#29702;&#22810;&#27169;&#24577;&#20449;&#24687;&#32780;&#38754;&#20020;&#22256;&#38590;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20123;&#38382;&#39064;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;MUSE&#65292;&#36825;&#26159;&#19968;&#20010;&#24102;&#26377;&#26368;&#26032;&#20449;&#24687;&#35775;&#38382;&#21644;&#21487;&#20449;&#24230;&#35780;&#20272;&#30340;LLM&#12290;&#36890;&#36807;&#26816;&#32034;&#19978;&#19979;&#25991;&#35777;&#25454;&#21644;&#21453;&#39539;&#65292;MUSE&#21487;&#20197;&#25552;&#20379;&#20934;&#30830;&#21487;&#20449;&#30340;&#35299;&#37322;&#21644;&#21442;&#32771;&#12290;&#23427;&#36824;&#25551;&#36848;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.11169v1 Announce Type: cross  Abstract: Misinformation undermines public trust in science and democracy, particularly on social media where inaccuracies can spread rapidly. Experts and laypeople have shown to be effective in correcting misinformation by manually identifying and explaining inaccuracies. Nevertheless, this approach is difficult to scale, a concern as technologies like large language models (LLMs) make misinformation easier to produce. LLMs also have versatile capabilities that could accelerate misinformation correction; however, they struggle due to a lack of recent information, a tendency to produce plausible but false content and references, and limitations in addressing multimodal information. To address these issues, we propose MUSE, an LLM augmented with access to and credibility evaluation of up-to-date information. By retrieving contextual evidence and refutations, MUSE can provide accurate and trustworthy explanations and references. It also describes 
&lt;/p&gt;</description></item><item><title>&#25552;&#20986;&#20102;&#19968;&#20010;&#20004;&#38454;&#27573;&#33539;&#24335;"&#27983;&#35272;&#21644;&#38598;&#20013;"&#65292;&#36890;&#36807;&#22312;&#23558;&#29305;&#24449;&#36755;&#20837;LLMs&#20043;&#21069;&#36827;&#34892;&#28145;&#20837;&#30340;&#22810;&#27169;&#24577;&#19978;&#19979;&#25991;&#34701;&#21512;&#65292;&#35299;&#20915;&#20102;&#22810;&#27169;&#24577;&#20869;&#23481;&#29702;&#35299;&#20013;&#30340; prior-LLM &#27169;&#24577;&#38548;&#31163;&#38382;&#39064;</title><link>https://arxiv.org/abs/2402.12195</link><description>&lt;p&gt;
&#36890;&#36807; prior-LLM &#19978;&#19979;&#25991;&#34701;&#21512;&#26469;&#29702;&#35299;&#22810;&#27169;&#24577;&#20869;&#23481;
&lt;/p&gt;
&lt;p&gt;
Browse and Concentrate: Comprehending Multimodal Content via prior-LLM Context Fusion
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.12195
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#20010;&#20004;&#38454;&#27573;&#33539;&#24335;"&#27983;&#35272;&#21644;&#38598;&#20013;"&#65292;&#36890;&#36807;&#22312;&#23558;&#29305;&#24449;&#36755;&#20837;LLMs&#20043;&#21069;&#36827;&#34892;&#28145;&#20837;&#30340;&#22810;&#27169;&#24577;&#19978;&#19979;&#25991;&#34701;&#21512;&#65292;&#35299;&#20915;&#20102;&#22810;&#27169;&#24577;&#20869;&#23481;&#29702;&#35299;&#20013;&#30340; prior-LLM &#27169;&#24577;&#38548;&#31163;&#38382;&#39064;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38543;&#30528;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLMs&#65289;&#30340;&#20852;&#36215;&#65292;&#36817;&#26399;&#23558;LLMs&#19982;&#39044;&#35757;&#32451;&#30340;&#35270;&#35273;&#27169;&#22411;&#30456;&#32467;&#21512;&#30340;&#22810;&#27169;&#24577;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;MLLMs&#65289;&#24050;&#32463;&#23637;&#29616;&#20986;&#22312;&#21508;&#31181;&#35270;&#35273;&#35821;&#35328;&#20219;&#21153;&#19978;&#20196;&#20154;&#21360;&#35937;&#28145;&#21051;&#30340;&#24615;&#33021;&#12290;&#28982;&#32780;&#65292;&#23427;&#20204;&#22312;&#29702;&#35299;&#28041;&#21450;&#22810;&#24352;&#22270;&#29255;&#30340;&#19978;&#19979;&#25991;&#26041;&#38754;&#20173;&#26377;&#19981;&#36275;&#12290;&#36825;&#19968;&#32570;&#38519;&#30340;&#20027;&#35201;&#21407;&#22240;&#26159;&#65292;&#22312;&#23558;&#35270;&#35273;&#29305;&#24449;&#36755;&#20837;LLM&#20027;&#24178;&#20043;&#21069;&#65292;&#27599;&#24352;&#22270;&#29255;&#30340;&#35270;&#35273;&#29305;&#24449;&#37117;&#26159;&#30001;&#20923;&#32467;&#30340;&#32534;&#30721;&#22120;&#21333;&#29420;&#32534;&#30721;&#30340;&#65292;&#32570;&#20047;&#23545;&#20854;&#20182;&#22270;&#29255;&#21644;&#22810;&#27169;&#24577;&#25351;&#20196;&#30340;&#24847;&#35782;&#12290;&#25105;&#20204;&#23558;&#36825;&#19968;&#38382;&#39064;&#31216;&#20026; prior-LLM &#27169;&#24577;&#38548;&#31163;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#20010;&#20004;&#38454;&#27573;&#33539;&#24335;&#65292;&#21363;&#8220;&#27983;&#35272;&#21644;&#38598;&#20013;&#8221;&#65292;&#20197;&#23454;&#29616;&#22312;&#23558;&#29305;&#24449;&#36755;&#20837;LLMs&#20043;&#21069;&#36827;&#34892;&#28145;&#20837;&#30340;&#22810;&#27169;&#24577;&#19978;&#19979;&#25991;&#34701;&#21512;&#12290;&#36825;&#31181;&#33539;&#24335;&#26368;&#21021;&#8220;&#27983;&#35272;&#8221;&#36755;&#20837;&#20197;&#33719;&#21462;&#20851;&#38190;&#35265;&#35299;&#65292;&#28982;&#21518;&#20877;&#27425;&#22238;&#39038;&#36755;&#20837;&#8220;&#38598;&#20013;&#8221;&#20110;&#20851;&#38190;&#32454;&#33410;&#65292;&#36890;&#36807;&#36825;&#20123;&#35265;&#35299;&#30340;&#25351;&#23548;&#65292;&#20174;&#32780;&#23454;&#29616;&#23545;&#22810;&#27169;&#24577;&#20869;&#23481;&#26356;&#20840;&#38754;&#30340;&#29702;&#35299;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.12195v1 Announce Type: new  Abstract: With the bloom of Large Language Models (LLMs), Multimodal Large Language Models (MLLMs) that incorporate LLMs with pre-trained vision models have recently demonstrated impressive performance across diverse vision-language tasks. However, they fall short to comprehend context involving multiple images. A primary reason for this shortcoming is that the visual features for each images are encoded individually by frozen encoders before feeding into the LLM backbone, lacking awareness of other images and the multimodal instructions. We term this issue as prior-LLM modality isolation and propose a two phase paradigm, browse-and-concentrate, to enable in-depth multimodal context fusion prior to feeding the features into LLMs. This paradigm initially "browses" through the inputs for essential insights, and then revisits the inputs to "concentrate" on crucial details, guided by these insights, to achieve a more comprehensive understanding of the
&lt;/p&gt;</description></item></channel></rss>