<rss version="2.0"><channel><title>Chat Arxiv cs.CL</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CL</description><item><title>FineMath&#26159;&#19968;&#20010;&#29992;&#20110;&#35780;&#20272;&#20013;&#25991;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#25968;&#23398;&#25512;&#29702;&#33021;&#21147;&#30340;&#32454;&#31890;&#24230;&#25968;&#23398;&#35780;&#20272;&#22522;&#20934;&#25968;&#25454;&#38598;&#65292;&#28085;&#30422;&#23567;&#23398;&#25968;&#23398;&#20013;&#30340;&#20027;&#35201;&#27010;&#24565;&#65292;&#21010;&#20998;&#20026;17&#31867;&#25968;&#23398;&#38382;&#39064;&#65292;&#24182;&#25163;&#21160;&#27880;&#37322;&#38590;&#24230;&#32423;&#21035;&#65292;&#23454;&#39564;&#35777;&#23454;&#22312;&#25968;&#23398;&#26041;&#38754;&#20173;&#26377;&#25913;&#36827;&#31354;&#38388;&#12290;</title><link>https://arxiv.org/abs/2403.07747</link><description>&lt;p&gt;
FineMath&#65306;&#19968;&#31181;&#29992;&#20110;&#35780;&#20272;&#20013;&#25991;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#30340;&#32454;&#31890;&#24230;&#25968;&#23398;&#35780;&#20272;&#22522;&#20934;
&lt;/p&gt;
&lt;p&gt;
FineMath: A Fine-Grained Mathematical Evaluation Benchmark for Chinese Large Language Models
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.07747
&lt;/p&gt;
&lt;p&gt;
FineMath&#26159;&#19968;&#20010;&#29992;&#20110;&#35780;&#20272;&#20013;&#25991;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#25968;&#23398;&#25512;&#29702;&#33021;&#21147;&#30340;&#32454;&#31890;&#24230;&#25968;&#23398;&#35780;&#20272;&#22522;&#20934;&#25968;&#25454;&#38598;&#65292;&#28085;&#30422;&#23567;&#23398;&#25968;&#23398;&#20013;&#30340;&#20027;&#35201;&#27010;&#24565;&#65292;&#21010;&#20998;&#20026;17&#31867;&#25968;&#23398;&#38382;&#39064;&#65292;&#24182;&#25163;&#21160;&#27880;&#37322;&#38590;&#24230;&#32423;&#21035;&#65292;&#23454;&#39564;&#35777;&#23454;&#22312;&#25968;&#23398;&#26041;&#38754;&#20173;&#26377;&#25913;&#36827;&#31354;&#38388;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20026;&#20102;&#20840;&#38754;&#35780;&#20272;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLMs&#65289;&#30340;&#25968;&#23398;&#25512;&#29702;&#33021;&#21147;&#65292;&#25105;&#20204;&#38656;&#35201;&#31934;&#24515;&#31574;&#21010;&#28085;&#30422;&#19981;&#21516;&#38590;&#24230;&#32423;&#21035;&#30340;&#21508;&#31181;&#25968;&#23398;&#27010;&#24565;&#21644;&#25968;&#23398;&#38382;&#39064;&#30340;&#35780;&#20272;&#25968;&#25454;&#38598;&#12290;&#20026;&#20102;&#23454;&#29616;&#36825;&#19968;&#30446;&#26631;&#65292;&#25105;&#20204;&#22312;&#26412;&#25991;&#20013;&#25552;&#20986;&#20102;FineMath&#65292;&#36825;&#26159;&#19968;&#20010;&#29992;&#20110;&#35780;&#20272;&#20013;&#25991;LLMs&#30340;&#32454;&#31890;&#24230;&#25968;&#23398;&#35780;&#20272;&#22522;&#20934;&#25968;&#25454;&#38598;&#12290;FineMath&#26088;&#22312;&#28085;&#30422;&#23567;&#23398;&#25968;&#23398;&#20013;&#25945;&#25480;&#30340;&#20027;&#35201;&#25968;&#23398;&#27010;&#24565;&#65292;&#36827;&#19968;&#27493;&#21010;&#20998;&#20026;17&#31867;&#25968;&#23398;&#38382;&#39064;&#65292;&#20174;&#32780;&#28145;&#20837;&#20998;&#26512;LLMs&#30340;&#25968;&#23398;&#25512;&#29702;&#33021;&#21147;&#12290;&#25152;&#26377;17&#31867;&#25968;&#23398;&#38382;&#39064;&#22343;&#26681;&#25454;&#35299;&#20915;&#36825;&#20123;&#38382;&#39064;&#25152;&#38656;&#30340;&#25512;&#29702;&#27493;&#39588;&#25968;&#37327;&#36827;&#34892;&#25163;&#21160;&#27880;&#37322;&#20854;&#38590;&#24230;&#32423;&#21035;&#12290;&#25105;&#20204;&#22312;FineMath&#19978;&#23545;&#21508;&#31181;LLMs&#36827;&#34892;&#20102;&#24191;&#27867;&#23454;&#39564;&#65292;&#24182;&#21457;&#29616;&#22312;&#25968;&#23398;&#26041;&#38754;&#20173;&#26377;&#30456;&#24403;&#22823;&#30340;&#25913;&#36827;&#31354;&#38388;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.07747v1 Announce Type: cross  Abstract: To thoroughly assess the mathematical reasoning abilities of Large Language Models (LLMs), we need to carefully curate evaluation datasets covering diverse mathematical concepts and mathematical problems at different difficulty levels. In pursuit of this objective, we propose FineMath in this paper, a fine-grained mathematical evaluation benchmark dataset for assessing Chinese LLMs. FineMath is created to cover the major key mathematical concepts taught in elementary school math, which are further divided into 17 categories of math word problems, enabling in-depth analysis of mathematical reasoning abilities of LLMs. All the 17 categories of math word problems are manually annotated with their difficulty levels according to the number of reasoning steps required to solve these problems. We conduct extensive experiments on a wide range of LLMs on FineMath and find that there is still considerable room for improvements in terms of mathem
&lt;/p&gt;</description></item></channel></rss>