<rss version="2.0"><channel><title>Chat Arxiv cs.CL</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.CL</description><item><title>&#20171;&#32461;&#20102;GPTopic&#65292;&#19968;&#31181;&#21033;&#29992;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#21019;&#24314;&#21160;&#24577;&#12289;&#20132;&#20114;&#24335;&#20027;&#39064;&#34920;&#31034;&#30340;&#36719;&#20214;&#21253;&#65292;&#36890;&#36807;&#30452;&#35266;&#30340;&#32842;&#22825;&#30028;&#38754;&#20351;&#20027;&#39064;&#24314;&#27169;&#26356;&#26131;&#29992;&#21644;&#20840;&#38754;&#12290;</title><link>https://arxiv.org/abs/2403.03628</link><description>&lt;p&gt;
&#21160;&#24577;&#20132;&#20114;&#24335;&#20027;&#39064;&#34920;&#31034;
&lt;/p&gt;
&lt;p&gt;
GPTopic: Dynamic and Interactive Topic Representations
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.03628
&lt;/p&gt;
&lt;p&gt;
&#20171;&#32461;&#20102;GPTopic&#65292;&#19968;&#31181;&#21033;&#29992;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#21019;&#24314;&#21160;&#24577;&#12289;&#20132;&#20114;&#24335;&#20027;&#39064;&#34920;&#31034;&#30340;&#36719;&#20214;&#21253;&#65292;&#36890;&#36807;&#30452;&#35266;&#30340;&#32842;&#22825;&#30028;&#38754;&#20351;&#20027;&#39064;&#24314;&#27169;&#26356;&#26131;&#29992;&#21644;&#20840;&#38754;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20027;&#39064;&#24314;&#27169;&#20284;&#20046;&#20960;&#20046;&#31561;&#21516;&#20110;&#29983;&#25104;&#21015;&#20986;&#39030;&#37096;&#21333;&#35789;&#20197;&#34920;&#31034;&#22823;&#22411;&#25991;&#26412;&#35821;&#26009;&#24211;&#20013;&#30340;&#20027;&#39064;&#12290;&#28982;&#32780;&#65292;&#20174;&#36825;&#26679;&#19968;&#21015;&#20010;&#21035;&#26415;&#35821;&#20013;&#25512;&#26029;&#20027;&#39064;&#21487;&#33021;&#38656;&#35201;&#22823;&#37327;&#30340;&#19987;&#19994;&#30693;&#35782;&#21644;&#32463;&#39564;&#65292;&#20351;&#24471;&#20027;&#39064;&#24314;&#27169;&#23545;&#20110;&#23545;&#29305;&#23450;&#39030;&#35789;&#35299;&#37322;&#30340;&#32454;&#24494;&#24046;&#21035;&#21644;&#32570;&#38519;&#19981;&#29087;&#24713;&#30340;&#20154;&#32676;&#19981;&#22815;&#26131;&#29992;&#12290;&#20165;&#38480;&#20110;&#39030;&#35789;&#30340;&#20027;&#39064;&#34920;&#31034;&#21487;&#33021;&#36827;&#19968;&#27493;&#26080;&#27861;&#25552;&#20379;&#20027;&#39064;&#21487;&#33021;&#20855;&#26377;&#30340;&#21508;&#20010;&#26041;&#38754;&#12289;&#26041;&#38754;&#21644;&#32454;&#24494;&#24046;&#21035;&#30340;&#20840;&#38754;&#19988;&#26131;&#20110;&#35775;&#38382;&#30340;&#34920;&#24449;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20123;&#25361;&#25112;&#65292;&#25105;&#20204;&#20171;&#32461;&#20102;GPTopic&#65292;&#19968;&#20010;&#21033;&#29992;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLMs&#65289;&#21019;&#24314;&#21160;&#24577;&#65292;&#20132;&#20114;&#24335;&#20027;&#39064;&#34920;&#31034;&#30340;&#36719;&#20214;&#21253;&#12290;GPTopic&#25552;&#20379;&#30452;&#35266;&#30340;&#32842;&#22825;&#30028;&#38754;&#65292;&#20379;&#29992;&#25143;&#20132;&#20114;&#22320;&#25506;&#32034;&#12289;&#20998;&#26512;&#21644;&#23436;&#21892;&#20027;&#39064;&#65292;&#20351;&#20027;&#39064;&#24314;&#27169;&#26356;&#26131;&#20351;&#29992;&#21644;&#20840;&#38754;&#12290;&#30456;&#24212;&#30340;&#20195;&#30721;&#21487;&#22312;&#27492;&#22788;&#25214;&#21040;&#65306;https://gith
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.03628v1 Announce Type: new  Abstract: Topic modeling seems to be almost synonymous with generating lists of top words to represent topics within large text corpora. However, deducing a topic from such list of individual terms can require substantial expertise and experience, making topic modelling less accessible to people unfamiliar with the particularities and pitfalls of top-word interpretation. A topic representation limited to top-words might further fall short of offering a comprehensive and easily accessible characterization of the various aspects, facets and nuances a topic might have. To address these challenges, we introduce GPTopic, a software package that leverages Large Language Models (LLMs) to create dynamic, interactive topic representations. GPTopic provides an intuitive chat interface for users to explore, analyze, and refine topics interactively, making topic modeling more accessible and comprehensive. The corresponding code is available here: https://gith
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#30740;&#31350;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#26159;&#21542;&#33021;&#22815;&#21462;&#20195;&#32463;&#27982;&#23454;&#39564;&#23460;&#36827;&#34892;&#36873;&#25321;&#39044;&#27979;&#65292;&#24182;&#36890;&#36807;&#30456;&#20851;&#23454;&#39564;&#35777;&#26126;&#20102;&#20854;&#21487;&#34892;&#24615;&#12290;</title><link>https://arxiv.org/abs/2401.17435</link><description>&lt;p&gt;
&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#33021;&#21542;&#21462;&#20195;&#32463;&#27982;&#36873;&#25321;&#39044;&#27979;&#23454;&#39564;&#23460;&#65311;
&lt;/p&gt;
&lt;p&gt;
Can Large Language Models Replace Economic Choice Prediction Labs?
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2401.17435
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#30740;&#31350;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#26159;&#21542;&#33021;&#22815;&#21462;&#20195;&#32463;&#27982;&#23454;&#39564;&#23460;&#36827;&#34892;&#36873;&#25321;&#39044;&#27979;&#65292;&#24182;&#36890;&#36807;&#30456;&#20851;&#23454;&#39564;&#35777;&#26126;&#20102;&#20854;&#21487;&#34892;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#32463;&#27982;&#36873;&#25321;&#39044;&#27979;&#26159;&#19968;&#39033;&#20855;&#26377;&#25361;&#25112;&#24615;&#30340;&#37325;&#35201;&#20219;&#21153;&#65292;&#24448;&#24448;&#21463;&#38480;&#20110;&#33719;&#21462;&#20154;&#31867;&#36873;&#25321;&#25968;&#25454;&#30340;&#22256;&#38590;&#12290;&#23454;&#39564;&#32463;&#27982;&#23398;&#30740;&#31350;&#22312;&#24456;&#22823;&#31243;&#24230;&#19978;&#19987;&#27880;&#20110;&#31616;&#21333;&#30340;&#36873;&#25321;&#29615;&#22659;&#12290;&#26368;&#36817;&#65292;&#20154;&#24037;&#26234;&#33021;&#30028;&#20197;&#20004;&#31181;&#26041;&#24335;&#20026;&#35813;&#21162;&#21147;&#20570;&#20986;&#20102;&#36129;&#29486;&#65306;&#32771;&#34385;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#26159;&#21542;&#21487;&#20197;&#20195;&#26367;&#20154;&#31867;&#22312;&#19978;&#36848;&#31616;&#21333;&#36873;&#25321;&#39044;&#27979;&#29615;&#22659;&#20013;&#65292;&#20197;&#21450;&#36890;&#36807;&#26426;&#22120;&#23398;&#20064;&#35270;&#35282;&#30740;&#31350;&#26356;&#22797;&#26434;&#20294;&#20173;&#20005;&#26684;&#30340;&#23454;&#39564;&#32463;&#27982;&#23398;&#29615;&#22659;&#65292;&#21253;&#25324;&#19981;&#23436;&#20840;&#20449;&#24687;&#12289;&#37325;&#22797;&#21338;&#24328;&#21644;&#22522;&#20110;&#33258;&#28982;&#35821;&#35328;&#20132;&#27969;&#30340;&#35828;&#26381;&#28216;&#25103;&#12290;&#36825;&#24341;&#21457;&#20102;&#19968;&#20010;&#37325;&#35201;&#30340;&#28789;&#24863;&#65306;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#26159;&#21542;&#33021;&#22815;&#23436;&#20840;&#27169;&#25311;&#32463;&#27982;&#29615;&#22659;&#65292;&#24182;&#29983;&#25104;&#29992;&#20110;&#39640;&#25928;&#20154;&#31867;&#36873;&#25321;&#39044;&#27979;&#30340;&#25968;&#25454;&#65292;&#26367;&#20195;&#22797;&#26434;&#30340;&#32463;&#27982;&#23454;&#39564;&#23460;&#30740;&#31350;&#65311;&#25105;&#20204;&#22312;&#36825;&#20010;&#20027;&#39064;&#19978;&#24320;&#21019;&#20102;&#30740;&#31350;&#65292;&#24182;&#23637;&#31034;&#20102;&#20854;&#21487;&#34892;&#24615;&#12290;&#29305;&#21035;&#26159;&#65292;&#25105;&#20204;&#34920;&#26126;&#20165;&#22312;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#29983;&#25104;&#30340;&#25968;&#25454;&#19978;&#35757;&#32451;&#30340;&#27169;&#22411;&#21487;&#20197;&#26377;&#25928;&#22320;&#36827;&#34892;&#39044;&#27979;&#12290;
&lt;/p&gt;
&lt;p&gt;
Economic choice prediction is an essential challenging task, often constrained by the difficulties in acquiring human choice data. Indeed, experimental economics studies had focused mostly on simple choice settings. The AI community has recently contributed to that effort in two ways: considering whether LLMs can substitute for humans in the above-mentioned simple choice prediction settings, and the study through ML lens of more elaborated but still rigorous experimental economics settings, employing incomplete information, repetitive play, and natural language communication, notably language-based persuasion games. This leaves us with a major inspiration: can LLMs be used to fully simulate the economic environment and generate data for efficient human choice prediction, substituting for the elaborated economic lab studies? We pioneer the study of this subject, demonstrating its feasibility. In particular, we show that a model trained solely on LLM-generated data can effectively predic
&lt;/p&gt;</description></item></channel></rss>