<rss version="2.0"><channel><title>Chat Arxiv cs.IR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.IR</description><item><title>&#36825;&#39033;&#30740;&#31350;&#21457;&#29616;&#20102;&#19968;&#31181;&#26032;&#30340;&#23433;&#20840;&#28431;&#27934;&#8212;&#8212;&#38459;&#25239;&#27844;&#28431;&#65292;&#36890;&#36807;&#21033;&#29992;&#35813;&#28431;&#27934;&#21487;&#20197;&#20174;&#23884;&#20837;&#24335;&#35774;&#22791;&#20013;&#25552;&#21462;&#21463;&#20445;&#25252;&#20869;&#23384;&#20013;&#30340;&#36719;&#20214;&#25351;&#20196;&#12290;</title><link>http://arxiv.org/abs/2310.03175</link><description>&lt;p&gt;
&#38459;&#25239;&#27844;&#28431;&#33030;&#24369;&#24615;&#21450;&#20854;&#22312;&#36870;&#21521;&#24037;&#31243;&#23884;&#20837;&#24335;&#36719;&#20214;&#20013;&#30340;&#21033;&#29992;
&lt;/p&gt;
&lt;p&gt;
Impedance Leakage Vulnerability and its Utilization in Reverse-engineering Embedded Software. (arXiv:2310.03175v1 [cs.CR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.03175
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#30740;&#31350;&#21457;&#29616;&#20102;&#19968;&#31181;&#26032;&#30340;&#23433;&#20840;&#28431;&#27934;&#8212;&#8212;&#38459;&#25239;&#27844;&#28431;&#65292;&#36890;&#36807;&#21033;&#29992;&#35813;&#28431;&#27934;&#21487;&#20197;&#20174;&#23884;&#20837;&#24335;&#35774;&#22791;&#20013;&#25552;&#21462;&#21463;&#20445;&#25252;&#20869;&#23384;&#20013;&#30340;&#36719;&#20214;&#25351;&#20196;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21457;&#29616;&#26032;&#30340;&#28431;&#27934;&#21644;&#23454;&#26045;&#23433;&#20840;&#21644;&#38544;&#31169;&#25514;&#26045;&#23545;&#20110;&#20445;&#25252;&#31995;&#32479;&#21644;&#25968;&#25454;&#20813;&#21463;&#29289;&#29702;&#25915;&#20987;&#33267;&#20851;&#37325;&#35201;&#12290;&#20854;&#20013;&#19968;&#31181;&#28431;&#27934;&#26159;&#38459;&#25239;&#65292;&#19968;&#31181;&#35774;&#22791;&#30340;&#22266;&#26377;&#23646;&#24615;&#65292;&#21487;&#20197;&#36890;&#36807;&#24847;&#22806;&#30340;&#20391;&#20449;&#36947;&#27844;&#38706;&#20449;&#24687;&#65292;&#20174;&#32780;&#24102;&#26469;&#20005;&#37325;&#30340;&#23433;&#20840;&#21644;&#38544;&#31169;&#39118;&#38505;&#12290;&#19982;&#20256;&#32479;&#30340;&#28431;&#27934;&#19981;&#21516;&#65292;&#38459;&#25239;&#36890;&#24120;&#34987;&#24573;&#35270;&#25110;&#20165;&#22312;&#30740;&#31350;&#21644;&#35774;&#35745;&#20013;&#20197;&#29305;&#23450;&#39057;&#29575;&#30340;&#22266;&#23450;&#20540;&#26469;&#22788;&#29702;&#12290;&#27492;&#22806;&#65292;&#38459;&#25239;&#20174;&#26410;&#34987;&#25506;&#32034;&#36807;&#20316;&#20026;&#20449;&#24687;&#27844;&#28431;&#30340;&#28304;&#22836;&#12290;&#26412;&#25991;&#35777;&#26126;&#20102;&#23884;&#20837;&#24335;&#35774;&#22791;&#30340;&#38459;&#25239;&#24182;&#38750;&#24658;&#23450;&#65292;&#24182;&#30452;&#25509;&#19982;&#35774;&#22791;&#19978;&#25191;&#34892;&#30340;&#31243;&#24207;&#30456;&#20851;&#12290;&#25105;&#20204;&#23558;&#27492;&#29616;&#35937;&#23450;&#20041;&#20026;&#38459;&#25239;&#27844;&#28431;&#65292;&#24182;&#23558;&#20854;&#20316;&#20026;&#19968;&#31181;&#20391;&#20449;&#36947;&#20174;&#21463;&#20445;&#25252;&#30340;&#20869;&#23384;&#20013;&#25552;&#21462;&#36719;&#20214;&#25351;&#20196;&#12290;&#25105;&#20204;&#22312;ATmega328P&#24494;&#25511;&#21046;&#22120;&#21644;Artix 7 FPGA&#19978;&#30340;&#23454;&#39564;&#34920;&#26126;&#65292;&#38459;&#25239;&#20391;&#20449;&#36947;
&lt;/p&gt;
&lt;p&gt;
Discovering new vulnerabilities and implementing security and privacy measures are important to protect systems and data against physical attacks. One such vulnerability is impedance, an inherent property of a device that can be exploited to leak information through an unintended side channel, thereby posing significant security and privacy risks. Unlike traditional vulnerabilities, impedance is often overlooked or narrowly explored, as it is typically treated as a fixed value at a specific frequency in research and design endeavors. Moreover, impedance has never been explored as a source of information leakage. This paper demonstrates that the impedance of an embedded device is not constant and directly relates to the programs executed on the device. We define this phenomenon as impedance leakage and use this as a side channel to extract software instructions from protected memory. Our experiment on the ATmega328P microcontroller and the Artix 7 FPGA indicates that the impedance side 
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#20110;&#20855;&#26377;&#22823;&#21160;&#20316;&#31354;&#38388;&#30340;&#31163;&#31574;&#30053;&#35780;&#20272;&#30340;&#21452;&#37325;&#31283;&#20581;&#20272;&#35745;&#22120;&#65288;MDR&#65289;&#12290;&#19982;&#29616;&#26377;&#30340;&#22522;&#20934;&#20272;&#35745;&#22120;&#30456;&#27604;&#65292;MDR&#33021;&#22815;&#22312;&#20943;&#23567;&#26041;&#24046;&#30340;&#21516;&#26102;&#20445;&#25345;&#26080;&#20559;&#24615;&#65292;&#20174;&#32780;&#25552;&#39640;&#20102;&#20272;&#35745;&#30340;&#20934;&#30830;&#24615;&#12290;&#23454;&#39564;&#32467;&#26524;&#35777;&#23454;&#20102;MDR&#30456;&#23545;&#20110;&#29616;&#26377;&#20272;&#35745;&#22120;&#30340;&#20248;&#36234;&#24615;&#12290;</title><link>http://arxiv.org/abs/2308.03443</link><description>&lt;p&gt;
&#29992;&#20110;&#20855;&#26377;&#22823;&#21160;&#20316;&#31354;&#38388;&#30340;&#31163;&#31574;&#30053;&#35780;&#20272;&#30340;&#21452;&#37325;&#31283;&#20581;&#20272;&#35745;&#22120;
&lt;/p&gt;
&lt;p&gt;
Doubly Robust Estimator for Off-Policy Evaluation with Large Action Spaces. (arXiv:2308.03443v1 [stat.ML])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.03443
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#20110;&#20855;&#26377;&#22823;&#21160;&#20316;&#31354;&#38388;&#30340;&#31163;&#31574;&#30053;&#35780;&#20272;&#30340;&#21452;&#37325;&#31283;&#20581;&#20272;&#35745;&#22120;&#65288;MDR&#65289;&#12290;&#19982;&#29616;&#26377;&#30340;&#22522;&#20934;&#20272;&#35745;&#22120;&#30456;&#27604;&#65292;MDR&#33021;&#22815;&#22312;&#20943;&#23567;&#26041;&#24046;&#30340;&#21516;&#26102;&#20445;&#25345;&#26080;&#20559;&#24615;&#65292;&#20174;&#32780;&#25552;&#39640;&#20102;&#20272;&#35745;&#30340;&#20934;&#30830;&#24615;&#12290;&#23454;&#39564;&#32467;&#26524;&#35777;&#23454;&#20102;MDR&#30456;&#23545;&#20110;&#29616;&#26377;&#20272;&#35745;&#22120;&#30340;&#20248;&#36234;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#20855;&#26377;&#22823;&#21160;&#20316;&#31354;&#38388;&#30340;&#32972;&#26223;&#19979;&#30340;&#31163;&#31574;&#30053;&#35780;&#20272;&#65288;OPE&#65289;&#12290;&#29616;&#26377;&#30340;&#22522;&#20934;&#20272;&#35745;&#22120;&#23384;&#22312;&#20005;&#37325;&#30340;&#20559;&#24046;&#21644;&#26041;&#24046;&#25240;&#34935;&#38382;&#39064;&#12290;&#21442;&#25968;&#21270;&#26041;&#27861;&#30001;&#20110;&#24456;&#38590;&#30830;&#23450;&#27491;&#30830;&#30340;&#27169;&#22411;&#32780;&#23548;&#33268;&#20559;&#24046;&#65292;&#32780;&#37325;&#35201;&#24615;&#21152;&#26435;&#26041;&#27861;&#30001;&#20110;&#26041;&#24046;&#32780;&#20135;&#29983;&#38382;&#39064;&#12290;&#20026;&#20102;&#20811;&#26381;&#36825;&#20123;&#38480;&#21046;&#65292;&#26412;&#25991;&#25552;&#20986;&#20102;&#22522;&#20110;&#21028;&#21035;&#24335;&#30340;&#19981;&#33391;&#34892;&#20026;&#25233;&#21046;&#22120;&#65288;MIPS&#65289;&#26469;&#36890;&#36807;&#23545;&#21160;&#20316;&#30340;&#23884;&#20837;&#26469;&#20943;&#23567;&#20272;&#35745;&#22120;&#30340;&#26041;&#24046;&#12290;&#20026;&#20102;&#20351;&#20272;&#35745;&#22120;&#26356;&#20934;&#30830;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;MIPS&#30340;&#21452;&#37325;&#31283;&#20581;&#20272;&#35745;&#22120;&#8212;&#8212;&#36793;&#38469;&#21270;&#21452;&#37325;&#31283;&#20581;&#65288;MDR&#65289;&#20272;&#35745;&#22120;&#12290;&#29702;&#35770;&#20998;&#26512;&#34920;&#26126;&#65292;&#25152;&#25552;&#20986;&#30340;&#20272;&#35745;&#22120;&#22312;&#27604;MIPS&#26356;&#24369;&#30340;&#20551;&#35774;&#19979;&#26159;&#26080;&#20559;&#30340;&#65292;&#21516;&#26102;&#20445;&#25345;&#20102;&#23545;IPS&#30340;&#26041;&#24046;&#20943;&#23567;&#65292;&#36825;&#26159;MIPS&#30340;&#20027;&#35201;&#20248;&#21183;&#12290;&#32463;&#39564;&#23454;&#39564;&#35777;&#23454;&#20102;MDR&#30456;&#23545;&#20110;&#29616;&#26377;&#20272;&#35745;&#22120;&#30340;&#20248;&#36234;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study Off-Policy Evaluation (OPE) in contextual bandit settings with large action spaces. The benchmark estimators suffer from severe bias and variance tradeoffs. Parametric approaches suffer from bias due to difficulty specifying the correct model, whereas ones with importance weight suffer from variance. To overcome these limitations, Marginalized Inverse Propensity Scoring (MIPS) was proposed to mitigate the estimator's variance via embeddings of an action. To make the estimator more accurate, we propose the doubly robust estimator of MIPS called the Marginalized Doubly Robust (MDR) estimator. Theoretical analysis shows that the proposed estimator is unbiased under weaker assumptions than MIPS while maintaining variance reduction against IPS, which was the main advantage of MIPS. The empirical experiment verifies the supremacy of MDR against existing estimators.
&lt;/p&gt;</description></item></channel></rss>