<rss version="2.0"><channel><title>Chat Arxiv cs.IR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.IR</description><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#26041;&#27861;&#65292;&#20026;&#29992;&#25143;&#20986;&#21457;&#22320;&#21487;&#21040;&#36798;&#30340;&#22478;&#24066;&#26053;&#34892;&#20998;&#37197;&#21487;&#25345;&#32493;&#24615;&#25351;&#26631;&#65288;SF&#25351;&#25968;&#65289;&#12290;</title><link>https://arxiv.org/abs/2403.18604</link><description>&lt;p&gt;
&#24314;&#27169;&#21487;&#25345;&#32493;&#22478;&#24066;&#26053;&#34892;&#65306;&#23558;CO2&#25490;&#25918;&#12289;&#28909;&#24230;&#21644;&#23395;&#33410;&#24615;&#25972;&#21512;&#21040;&#26053;&#28216;&#25512;&#33616;&#31995;&#32479;&#20013;
&lt;/p&gt;
&lt;p&gt;
Modeling Sustainable City Trips: Integrating CO2 Emissions, Popularity, and Seasonality into Tourism Recommender Systems
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.18604
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#26041;&#27861;&#65292;&#20026;&#29992;&#25143;&#20986;&#21457;&#22320;&#21487;&#21040;&#36798;&#30340;&#22478;&#24066;&#26053;&#34892;&#20998;&#37197;&#21487;&#25345;&#32493;&#24615;&#25351;&#26631;&#65288;SF&#25351;&#25968;&#65289;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#20449;&#24687;&#36807;&#36733;&#21644;&#22797;&#26434;&#20915;&#31574;&#36807;&#31243;&#30340;&#26102;&#20195;&#65292;&#25512;&#33616;&#31995;&#32479;&#65288;RS&#65289;&#24050;&#25104;&#20026;&#21508;&#20010;&#39046;&#22495;&#19981;&#21487;&#25110;&#32570;&#30340;&#24037;&#20855;&#65292;&#23588;&#20854;&#26159;&#26053;&#34892;&#21644;&#26053;&#28216;&#39046;&#22495;&#12290;&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#26041;&#27861;&#65292;&#20026;&#29992;&#25143;&#20986;&#21457;&#22320;&#21487;&#21040;&#36798;&#30340;&#22478;&#24066;&#26053;&#34892;&#20998;&#37197;&#21487;&#25345;&#32493;&#24615;&#25351;&#26631;&#65288;SF&#25351;&#25968;&#65289;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.18604v1 Announce Type: new  Abstract: In an era of information overload and complex decision-making processes, Recommender Systems (RS) have emerged as indispensable tools across diverse domains, particularly travel and tourism. These systems simplify trip planning by offering personalized recommendations that consider individual preferences and address broader challenges like seasonality, travel regulations, and capacity constraints. The intricacies of the tourism domain, characterized by multiple stakeholders, including consumers, item providers, platforms, and society, underscore the complexity of achieving balance among diverse interests. Although previous research has focused on fairness in Tourism Recommender Systems (TRS) from a multistakeholder perspective, limited work has focused on generating sustainable recommendations.   Our paper introduces a novel approach for assigning a sustainability indicator (SF index) for city trips accessible from the users' starting po
&lt;/p&gt;</description></item></channel></rss>