<rss version="2.0"><channel><title>Chat Arxiv cs.IR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.IR</description><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#21033;&#29992;&#29992;&#25143;&#35780;&#20215;&#26469;&#21019;&#24314;&#33258;&#28982;&#35821;&#35328;&#37197;&#32622;&#25991;&#20214;&#65292;&#20197;&#35299;&#20915;&#20256;&#32479;&#25512;&#33616;&#31995;&#32479;&#20013;&#30340;&#19981;&#36879;&#26126;&#24615;&#21644;&#21487;&#35299;&#37322;&#24615;&#30340;&#38382;&#39064;&#12290;&#36890;&#36807;&#36825;&#31181;&#26041;&#27861;&#65292;&#25105;&#20204;&#30340;&#31995;&#32479;&#33021;&#22815;&#25552;&#20379;&#36879;&#26126;&#30340;&#33258;&#28982;&#35821;&#35328;&#25512;&#33616;&#65292;&#32780;&#19988;&#24615;&#33021;&#27700;&#24179;&#19982;&#20256;&#32479;&#30340;&#25512;&#33616;&#31995;&#32479;&#30456;&#24403;&#12290;</title><link>https://arxiv.org/abs/2402.05810</link><description>&lt;p&gt;
&#36879;&#26126;&#19982;&#21487;&#35299;&#37322;&#30340;&#25512;&#33616;&#31995;&#32479;&#30340;&#33258;&#28982;&#35821;&#35328;&#29992;&#25143;&#37197;&#32622;&#25991;&#20214;
&lt;/p&gt;
&lt;p&gt;
Natural Language User Profiles for Transparent and Scrutable Recommendations
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.05810
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#21033;&#29992;&#29992;&#25143;&#35780;&#20215;&#26469;&#21019;&#24314;&#33258;&#28982;&#35821;&#35328;&#37197;&#32622;&#25991;&#20214;&#65292;&#20197;&#35299;&#20915;&#20256;&#32479;&#25512;&#33616;&#31995;&#32479;&#20013;&#30340;&#19981;&#36879;&#26126;&#24615;&#21644;&#21487;&#35299;&#37322;&#24615;&#30340;&#38382;&#39064;&#12290;&#36890;&#36807;&#36825;&#31181;&#26041;&#27861;&#65292;&#25105;&#20204;&#30340;&#31995;&#32479;&#33021;&#22815;&#25552;&#20379;&#36879;&#26126;&#30340;&#33258;&#28982;&#35821;&#35328;&#25512;&#33616;&#65292;&#32780;&#19988;&#24615;&#33021;&#27700;&#24179;&#19982;&#20256;&#32479;&#30340;&#25512;&#33616;&#31995;&#32479;&#30456;&#24403;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24403;&#21069;&#26368;&#20808;&#36827;&#30340;&#25512;&#33616;&#31995;&#32479;&#20027;&#35201;&#20381;&#36182;&#20110;&#29992;&#25143;&#30340;&#38544;&#24335;&#25110;&#26174;&#24335;&#21453;&#39304;&#26469;&#24314;&#35758;&#26032;&#39033;&#30446;&#12290;&#34429;&#28982;&#22312;&#25512;&#33616;&#26032;&#36873;&#39033;&#26041;&#38754;&#26377;&#25928;&#65292;&#20294;&#36825;&#20123;&#20256;&#32479;&#31995;&#32479;&#36890;&#24120;&#20351;&#29992;&#19981;&#21487;&#35299;&#37322;&#30340;&#23884;&#20837;&#12290;&#36825;&#31181;&#32570;&#20047;&#36879;&#26126;&#24230;&#19981;&#20165;&#38480;&#21046;&#20102;&#29992;&#25143;&#23545;&#20026;&#20160;&#20040;&#24314;&#35758;&#26576;&#20123;&#39033;&#30446;&#30340;&#29702;&#35299;&#65292;&#36824;&#20943;&#23569;&#20102;&#29992;&#25143;&#36731;&#26494;&#23457;&#26597;&#21644;&#32534;&#36753;&#20854;&#20559;&#22909;&#30340;&#33021;&#21147;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20123;&#38480;&#21046;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#31181;&#26032;&#30340;&#26041;&#27861;&#65292;&#21033;&#29992;&#29992;&#25143;&#35780;&#20215;&#26469;&#21019;&#24314;&#25551;&#36848;&#29992;&#25143;&#20559;&#22909;&#30340;&#20010;&#24615;&#21270;&#33258;&#28982;&#35821;&#35328;&#37197;&#32622;&#25991;&#20214;&#12290;&#36890;&#36807;&#36825;&#20123;&#25551;&#36848;&#24615;&#37197;&#32622;&#25991;&#20214;&#65292;&#25105;&#20204;&#30340;&#31995;&#32479;&#25552;&#20379;&#36879;&#26126;&#30340;&#33258;&#28982;&#35821;&#35328;&#25512;&#33616;&#12290;&#25105;&#20204;&#30340;&#35780;&#20272;&#32467;&#26524;&#34920;&#26126;&#65292;&#36825;&#31181;&#26032;&#26041;&#27861;&#22312;&#19982;&#24050;&#24314;&#31435;&#30340;&#25512;&#33616;&#31995;&#32479;&#30456;&#24403;&#30340;&#24615;&#33021;&#27700;&#24179;&#19978;&#12290;
&lt;/p&gt;
&lt;p&gt;
Current state-of-the-art recommender systems predominantly rely on either implicit or explicit feedback from users to suggest new items. While effective in recommending novel options, these conventional systems often use uninterpretable embeddings. This lack of transparency not only limits user understanding of why certain items are suggested but also reduces the user's ability to easily scrutinize and edit their preferences. For example, if a user has a change in interests, they would need to make significant changes to their interaction history to adjust the model's recommendations. To address these limitations, we introduce a novel method that utilizes user reviews to craft personalized, natural language profiles describing users' preferences. Through these descriptive profiles, our system provides transparent recommendations in natural language. Our evaluations show that this novel approach maintains a performance level on par with established recommender systems, but with the adde
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#36890;&#36807;&#22855;&#24322;&#35889;&#24179;&#28369;&#31639;&#27861;&#32531;&#35299;&#39034;&#24207;&#25512;&#33616;&#20013;&#24207;&#21015;&#19982;&#39033;&#30446;&#25490;&#21517;&#36864;&#21270;&#38382;&#39064;&#30340;&#26041;&#27861;&#65292;&#24182;&#25552;&#20986;&#20102;SSA&#25351;&#26631;&#26469;&#35780;&#20272;&#35813;&#38382;&#39064;&#30340;&#20005;&#37325;&#24615;&#12290;</title><link>http://arxiv.org/abs/2306.11986</link><description>&lt;p&gt;
&#36890;&#36807;&#22855;&#24322;&#35889;&#24179;&#28369;&#35299;&#20915;&#39034;&#24207;&#25512;&#33616;&#20013;&#30340;&#25490;&#21517;&#36864;&#21270;&#38382;&#39064;
&lt;/p&gt;
&lt;p&gt;
Addressing the Rank Degeneration in Sequential Recommendation via Singular Spectrum Smoothing. (arXiv:2306.11986v1 [cs.IR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.11986
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#36890;&#36807;&#22855;&#24322;&#35889;&#24179;&#28369;&#31639;&#27861;&#32531;&#35299;&#39034;&#24207;&#25512;&#33616;&#20013;&#24207;&#21015;&#19982;&#39033;&#30446;&#25490;&#21517;&#36864;&#21270;&#38382;&#39064;&#30340;&#26041;&#27861;&#65292;&#24182;&#25552;&#20986;&#20102;SSA&#25351;&#26631;&#26469;&#35780;&#20272;&#35813;&#38382;&#39064;&#30340;&#20005;&#37325;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#39034;&#24207;&#25512;&#33616;&#30740;&#31350;&#21160;&#24577;&#29992;&#25143;&#20559;&#22909;&#24314;&#27169;&#24182;&#29983;&#25104;&#19979;&#19968;&#20010;&#39033;&#30446;&#39044;&#27979;&#12290;&#19979;&#19968;&#20010;&#39033;&#30446;&#30340;&#20559;&#22909;&#36890;&#24120;&#26159;&#36890;&#36807;&#24207;&#21015;&#21644;&#39033;&#30446;&#34920;&#31034;&#20043;&#38388;&#30340;&#20146;&#21644;&#24230;&#29983;&#25104;&#30340;&#12290;&#28982;&#32780;&#65292;&#30001;&#20110;&#25968;&#25454;&#31232;&#30095;&#38382;&#39064;&#65292;&#24207;&#21015;&#21644;&#39033;&#30446;&#34920;&#31034;&#37117;&#20250;&#36973;&#21463;&#25490;&#21517;&#38477;&#32423;&#38382;&#39064;&#12290;&#25490;&#21517;&#36864;&#21270;&#38382;&#39064;&#20005;&#37325;&#25439;&#23475;&#20102;&#39034;&#24207;&#25512;&#33616;&#30340;&#34920;&#31034;&#12290;&#22240;&#27492;&#25105;&#20204;&#25552;&#20986;&#20102;&#36890;&#36807;&#29702;&#35770;&#36830;&#25509;&#24207;&#21015;&#34920;&#31034;&#38477;&#32423;&#38382;&#39064;&#19982;&#39033;&#30446;&#25490;&#21517;&#36864;&#21270;&#38382;&#39064;&#30340;&#26041;&#27861;&#12290;&#25105;&#20204;&#36824;&#21457;&#29616;&#20102;&#24555;&#36895;&#22855;&#24322;&#20540;&#34928;&#20943;&#29616;&#35937;&#19982;&#36716;&#25442;&#22120;&#24207;&#21015;&#36755;&#20986;&#21644;&#39033;&#30446;&#23884;&#20837;&#20013;&#30340;&#25490;&#21517;&#25240;&#21472;&#38382;&#39064;&#20043;&#38388;&#30340;&#32852;&#31995;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#22855;&#24322;&#20540;&#26354;&#32447;&#19979;&#38754;&#31215;&#65288;SSA&#65289;&#35780;&#20272;&#25351;&#26631;&#65292;&#21516;&#26102;&#32531;&#35299;&#39034;&#24207;&#25512;&#33616;&#20013;&#30340;&#24207;&#21015;&#21644;&#39033;&#30446;&#34920;&#31034;&#25490;&#21517;&#36864;&#21270;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;
Sequential recommendation (SR) investigates the dynamic user preferences modeling and generates the next-item prediction. The next item preference is typically generated by the affinity between the sequence and item representations. However, both sequence and item representations suffer from the rank degeneration issue due to the data sparsity problem. The rank degeneration issue significantly impairs the representations for SR. This motivates us to measure how severe is the rank degeneration issue and alleviate the sequence and item representation rank degeneration issues simultaneously for SR.  In this work, we theoretically connect the sequence representation degeneration issue with the item rank degeneration, particularly for short sequences and cold items. We also identify the connection between the fast singular value decay phenomenon and the rank collapse issue in transformer sequence output and item embeddings. We propose the area under the singular value curve metric to evalua
&lt;/p&gt;</description></item></channel></rss>