<rss version="2.0"><channel><title>Chat Arxiv cs.IR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.IR</description><item><title>CDRNP&#26159;&#19968;&#31181;&#36890;&#36807;&#31070;&#32463;&#32593;&#32476;&#23558;&#29992;&#25143;&#34920;&#31034;&#20174;&#28304;&#39046;&#22495;&#36716;&#31227;&#21040;&#30446;&#26631;&#39046;&#22495;&#65292;&#35299;&#20915;&#29992;&#25143;&#20919;&#21551;&#21160;&#38382;&#39064;&#30340;&#36328;&#39046;&#22495;&#25512;&#33616;&#26041;&#27861;&#12290;</title><link>http://arxiv.org/abs/2401.12732</link><description>&lt;p&gt;
CDRNP: &#36890;&#36807;&#31070;&#32463;&#36807;&#31243;&#23454;&#29616;&#36328;&#39046;&#22495;&#25512;&#33616;&#20197;&#35299;&#20915;&#20919;&#21551;&#21160;&#29992;&#25143;&#38382;&#39064;
&lt;/p&gt;
&lt;p&gt;
CDRNP: Cross-Domain Recommendation to Cold-Start Users via Neural Process. (arXiv:2401.12732v1 [cs.IR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.12732
&lt;/p&gt;
&lt;p&gt;
CDRNP&#26159;&#19968;&#31181;&#36890;&#36807;&#31070;&#32463;&#32593;&#32476;&#23558;&#29992;&#25143;&#34920;&#31034;&#20174;&#28304;&#39046;&#22495;&#36716;&#31227;&#21040;&#30446;&#26631;&#39046;&#22495;&#65292;&#35299;&#20915;&#29992;&#25143;&#20919;&#21551;&#21160;&#38382;&#39064;&#30340;&#36328;&#39046;&#22495;&#25512;&#33616;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36328;&#39046;&#22495;&#25512;&#33616;&#65288;CDR&#65289;&#24050;&#34987;&#35777;&#26126;&#26159;&#35299;&#20915;&#29992;&#25143;&#20919;&#21551;&#21160;&#38382;&#39064;&#30340;&#19968;&#31181;&#26377;&#25928;&#26041;&#27861;&#65292;&#26088;&#22312;&#36890;&#36807;&#20174;&#28304;&#39046;&#22495;&#36716;&#31227;&#29992;&#25143;&#20559;&#22909;&#26469;&#20026;&#30446;&#26631;&#39046;&#22495;&#30340;&#29992;&#25143;&#36827;&#34892;&#25512;&#33616;&#12290;&#20256;&#32479;&#30340;CDR&#30740;&#31350;&#36981;&#24490;&#23884;&#20837;&#21644;&#26144;&#23556;&#65288;EMCDR&#65289;&#33539; paradigm&#65292;&#36890;&#36807;&#23398;&#20064;&#19968;&#20010;&#29992;&#25143;&#20849;&#20139;&#26144;&#23556;&#20989;&#25968;&#23558;&#29992;&#25143;&#34920;&#31034;&#20174;&#28304;&#39046;&#22495;&#36716;&#31227;&#21040;&#30446;&#26631;&#39046;&#22495;&#65292;&#24573;&#35270;&#20102;&#29992;&#25143;&#29305;&#23450;&#20559;&#22909;&#12290;&#26368;&#36817;&#30340;CDR&#30740;&#31350;&#23581;&#35797;&#22312;&#20803;&#23398;&#20064;&#33539; paradigm &#19979;&#23398;&#20064;&#29992;&#25143;&#29305;&#23450;&#26144;&#23556;&#20989;&#25968;&#65292;&#23558;&#27599;&#20010;&#29992;&#25143;&#30340;CDR&#35270;&#20026;&#29420;&#31435;&#20219;&#21153;&#65292;&#20294;&#24573;&#35270;&#20102;&#29992;&#25143;&#20043;&#38388;&#30340;&#20559;&#22909;&#30456;&#20851;&#24615;&#65292;&#38480;&#21046;&#20102;&#29992;&#20110;&#34920;&#31034;&#29992;&#25143;&#30340;&#26377;&#30410;&#20449;&#24687;&#12290;&#27492;&#22806;&#65292;&#36825;&#20004;&#20010;&#33539; paradigm &#37117;&#24573;&#30053;&#20102;&#26144;&#23556;&#36807;&#31243;&#20013;&#26469;&#33258;&#20004;&#20010;&#39046;&#22495;&#30340;&#29992;&#25143;-&#39033;&#30446;&#26174;&#24335;&#20132;&#20114;&#12290;&#20026;&#20102;&#35299;&#20915;&#19978;&#36848;&#38382;&#39064;&#65292;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;CDR&#26694;&#26550;&#65292;&#20351;&#29992;&#31070;&#32463;&#36807;&#31243;&#65288;NP&#65289;&#65292;&#31216;&#20026;CDRNP&#12290;
&lt;/p&gt;
&lt;p&gt;
Cross-domain recommendation (CDR) has been proven as a promising way to tackle the user cold-start problem, which aims to make recommendations for users in the target domain by transferring the user preference derived from the source domain. Traditional CDR studies follow the embedding and mapping (EMCDR) paradigm, which transfers user representations from the source to target domain by learning a user-shared mapping function, neglecting the user-specific preference. Recent CDR studies attempt to learn user-specific mapping functions in meta-learning paradigm, which regards each user's CDR as an individual task, but neglects the preference correlations among users, limiting the beneficial information for user representations. Moreover, both of the paradigms neglect the explicit user-item interactions from both domains during the mapping process. To address the above issues, this paper proposes a novel CDR framework with neural process (NP), termed as CDRNP. Particularly, it develops th
&lt;/p&gt;</description></item></channel></rss>