<rss version="2.0"><channel><title>Chat Arxiv cs.IR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.IR</description><item><title>&#26412;&#25991;&#35843;&#26597;&#20102;&#22270;&#31070;&#32463;&#32593;&#32476;&#22312;&#29616;&#23454;&#19990;&#30028;&#20013;&#38754;&#20020;&#30340;&#19981;&#24179;&#34913;&#12289;&#22122;&#22768;&#12289;&#38544;&#31169;&#21644;OOD&#25361;&#25112;&#65292;&#24182;&#33268;&#21147;&#20110;&#25552;&#39640;&#27169;&#22411;&#24615;&#33021;&#12289;&#21487;&#38752;&#24615;&#21644;&#40065;&#26834;&#24615;&#12290;</title><link>https://arxiv.org/abs/2403.04468</link><description>&lt;p&gt;
&#20851;&#20110;&#22270;&#31070;&#32463;&#32593;&#32476;&#22312;&#29616;&#23454;&#19990;&#30028;&#20013;&#30340;&#35843;&#26597;&#65306;&#19981;&#24179;&#34913;&#12289;&#22122;&#22768;&#12289;&#38544;&#31169;&#21644;OOD&#25361;&#25112;
&lt;/p&gt;
&lt;p&gt;
A Survey of Graph Neural Networks in Real world: Imbalance, Noise, Privacy and OOD Challenges
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.04468
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#35843;&#26597;&#20102;&#22270;&#31070;&#32463;&#32593;&#32476;&#22312;&#29616;&#23454;&#19990;&#30028;&#20013;&#38754;&#20020;&#30340;&#19981;&#24179;&#34913;&#12289;&#22122;&#22768;&#12289;&#38544;&#31169;&#21644;OOD&#25361;&#25112;&#65292;&#24182;&#33268;&#21147;&#20110;&#25552;&#39640;&#27169;&#22411;&#24615;&#33021;&#12289;&#21487;&#38752;&#24615;&#21644;&#40065;&#26834;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
arXiv:2403.04468v1 &#21457;&#24067;&#31867;&#22411;: &#36328;&#22495; &#25688;&#35201;: &#22270;&#32467;&#26500;&#21270;&#25968;&#25454;&#34920;&#29616;&#20986;&#26222;&#36866;&#24615;&#21644;&#24191;&#27867;&#36866;&#29992;&#24615;&#65292;&#28085;&#30422;&#31038;&#20132;&#32593;&#32476;&#20998;&#26512;&#12289;&#29983;&#29289;&#21270;&#23398;&#12289;&#37329;&#34701;&#27450;&#35784;&#26816;&#27979;&#21644;&#32593;&#32476;&#23433;&#20840;&#31561;&#22810;&#20010;&#39046;&#22495;&#12290;&#22312;&#21033;&#29992;&#22270;&#31070;&#32463;&#32593;&#32476;&#65288;GNNs&#65289;&#21462;&#24471;&#26174;&#33879;&#25104;&#21151;&#26041;&#38754;&#24050;&#32463;&#21462;&#24471;&#20102;&#37325;&#35201;&#36827;&#23637;&#12290;&#28982;&#32780;&#65292;&#22312;&#23454;&#38469;&#24212;&#29992;&#22330;&#26223;&#20013;&#65292;&#27169;&#22411;&#30340;&#35757;&#32451;&#29615;&#22659;&#24448;&#24448;&#36828;&#38750;&#29702;&#24819;&#65292;&#30001;&#20110;&#21508;&#31181;&#19981;&#21033;&#22240;&#32032;&#65292;&#21253;&#25324;&#25968;&#25454;&#20998;&#24067;&#19981;&#24179;&#34913;&#12289;&#38169;&#35823;&#25968;&#25454;&#20013;&#23384;&#22312;&#22122;&#22768;&#12289;&#25935;&#24863;&#20449;&#24687;&#30340;&#38544;&#31169;&#20445;&#25252;&#20197;&#21450;&#23545;&#20110;OOD&#22330;&#26223;&#30340;&#27867;&#21270;&#33021;&#21147;&#65292;&#23548;&#33268;GNN&#27169;&#22411;&#30340;&#24615;&#33021;&#22823;&#24133;&#19979;&#38477;&#12290;&#20026;&#35299;&#20915;&#36825;&#20123;&#38382;&#39064;&#65292;&#20154;&#20204;&#33268;&#21147;&#20110;&#25913;&#21892;GNN&#27169;&#22411;&#22312;&#23454;&#38469;&#24212;&#29992;&#22330;&#26223;&#20013;&#30340;&#24615;&#33021;&#65292;&#25552;&#39640;&#20854;&#21487;&#38752;&#24615;&#21644;&#40065;&#26834;&#24615;&#12290;&#26412;&#25991;&#20840;&#38754;&#35843;&#26597;&#20102;...
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.04468v1 Announce Type: cross  Abstract: Graph-structured data exhibits universality and widespread applicability across diverse domains, such as social network analysis, biochemistry, financial fraud detection, and network security. Significant strides have been made in leveraging Graph Neural Networks (GNNs) to achieve remarkable success in these areas. However, in real-world scenarios, the training environment for models is often far from ideal, leading to substantial performance degradation of GNN models due to various unfavorable factors, including imbalance in data distribution, the presence of noise in erroneous data, privacy protection of sensitive information, and generalization capability for out-of-distribution (OOD) scenarios. To tackle these issues, substantial efforts have been devoted to improving the performance of GNN models in practical real-world scenarios, as well as enhancing their reliability and robustness. In this paper, we present a comprehensive surv
&lt;/p&gt;</description></item></channel></rss>