<rss version="2.0"><channel><title>Chat Arxiv cs.IR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.IR</description><item><title>PDS-Net is a novel framework for QoS prediction that effectively reduces errors resulting from noise data by utilizing a probabilistic space and a condition-based multitasking loss function.</title><link>http://arxiv.org/abs/2308.02580</link><description>&lt;p&gt;
Probabilistic Deep Supervision Network: &#19968;&#31181;&#25239;&#22122;&#22768;&#30340;QoS&#39044;&#27979;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Probabilistic Deep Supervision Network: A Noise-Resilient Approach for QoS Prediction. (arXiv:2308.02580v1 [cs.SE])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.02580
&lt;/p&gt;
&lt;p&gt;
PDS-Net is a novel framework for QoS prediction that effectively reduces errors resulting from noise data by utilizing a probabilistic space and a condition-based multitasking loss function.
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#25512;&#33616;&#31995;&#32479;&#20013;&#65292;QoS&#65288;&#26381;&#21153;&#36136;&#37327;&#65289;&#30340;&#39044;&#27979;&#26159;&#19968;&#39033;&#37325;&#35201;&#20219;&#21153;&#65292;&#20934;&#30830;&#39044;&#27979;&#26410;&#30693;&#30340;QoS&#20540;&#21487;&#20197;&#25552;&#39640;&#29992;&#25143;&#28385;&#24847;&#24230;&#12290;&#28982;&#32780;&#65292;&#29616;&#26377;&#30340;QoS&#39044;&#27979;&#25216;&#26415;&#22312;&#23384;&#22312;&#22122;&#22768;&#25968;&#25454;&#65288;&#22914;&#34394;&#20551;&#20301;&#32622;&#20449;&#24687;&#25110;&#34394;&#25311;&#32593;&#20851;&#65289;&#26102;&#21487;&#33021;&#34920;&#29616;&#19981;&#20339;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;QoS&#39044;&#27979;&#26694;&#26550;&#8212;&#8212;&#27010;&#29575;&#28145;&#24230;&#30417;&#30563;&#32593;&#32476;&#65288;PDS-Net&#65289;&#65292;&#20197;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#12290;PDS-Net&#21033;&#29992;&#22522;&#20110;&#39640;&#26031;&#30340;&#27010;&#29575;&#31354;&#38388;&#30417;&#30563;&#20013;&#38388;&#23618;&#65292;&#24182;&#23398;&#20064;&#24050;&#30693;&#29305;&#24449;&#21644;&#30495;&#23454;&#26631;&#31614;&#30340;&#27010;&#29575;&#31354;&#38388;&#12290;&#27492;&#22806;&#65292;PDS-Net&#37319;&#29992;&#22522;&#20110;&#26465;&#20214;&#30340;&#22810;&#20219;&#21153;&#25439;&#22833;&#20989;&#25968;&#26469;&#35782;&#21035;&#20855;&#26377;&#22122;&#22768;&#25968;&#25454;&#30340;&#23545;&#35937;&#65292;&#24182;&#36890;&#36807;&#20248;&#21270;&#36825;&#20123;&#23545;&#35937;&#30340;&#27010;&#29575;&#31354;&#38388;&#19982;&#30495;&#23454;&#26631;&#31614;&#27010;&#29575;&#31354;&#38388;&#20043;&#38388;&#30340;Kullback-Leibler&#36317;&#31163;&#65292;&#30452;&#25509;&#23545;&#20174;&#27010;&#29575;&#31354;&#38388;&#20013;&#37319;&#26679;&#30340;&#28145;&#24230;&#29305;&#24449;&#36827;&#34892;&#30417;&#30563;&#12290;&#22240;&#27492;&#65292;PDS-Net&#26377;&#25928;&#20943;&#23569;&#20102;&#22240;&#20256;&#25773;&#24341;&#36215;&#30340;&#38169;&#35823;&#12290;
&lt;/p&gt;
&lt;p&gt;
Quality of Service (QoS) prediction is an essential task in recommendation systems, where accurately predicting unknown QoS values can improve user satisfaction. However, existing QoS prediction techniques may perform poorly in the presence of noise data, such as fake location information or virtual gateways. In this paper, we propose the Probabilistic Deep Supervision Network (PDS-Net), a novel framework for QoS prediction that addresses this issue. PDS-Net utilizes a Gaussian-based probabilistic space to supervise intermediate layers and learns probability spaces for both known features and true labels. Moreover, PDS-Net employs a condition-based multitasking loss function to identify objects with noise data and applies supervision directly to deep features sampled from the probability space by optimizing the Kullback-Leibler distance between the probability space of these objects and the real-label probability space. Thus, PDS-Net effectively reduces errors resulting from the propag
&lt;/p&gt;</description></item></channel></rss>