<rss version="2.0"><channel><title>Chat Arxiv cs.IR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.IR</description><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#21517;&#20026;AutoSAM&#30340;&#33258;&#21160;&#37319;&#26679;&#26694;&#26550;&#65292;&#29992;&#20110;&#23545;&#36830;&#32493;&#25512;&#33616;&#31995;&#32479;&#20013;&#30340;&#29992;&#25143;&#34892;&#20026;&#36827;&#34892;&#38750;&#22343;&#21248;&#22788;&#29702;&#12290;&#35813;&#26694;&#26550;&#36890;&#36807;&#33258;&#36866;&#24212;&#22320;&#23398;&#20064;&#21382;&#21490;&#34892;&#20026;&#30340;&#20559;&#26012;&#20998;&#24067;&#65292;&#24182;&#37319;&#26679;&#20986;&#20449;&#24687;&#20016;&#23500;&#30340;&#23376;&#38598;&#65292;&#20197;&#26500;&#24314;&#26356;&#20855;&#21487;&#27867;&#21270;&#24615;&#30340;&#36830;&#32493;&#25512;&#33616;&#31995;&#32479;&#12290;</title><link>http://arxiv.org/abs/2311.00388</link><description>&lt;p&gt;
&#23454;&#29616;&#33258;&#21160;&#37319;&#26679;&#23545;&#20110;&#36830;&#32493;&#25512;&#33616;&#31995;&#32479;&#20013;&#29992;&#25143;&#34892;&#20026;&#30340;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Towards Automatic Sampling of User Behaviors for Sequential Recommender Systems. (arXiv:2311.00388v1 [cs.IR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2311.00388
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#21517;&#20026;AutoSAM&#30340;&#33258;&#21160;&#37319;&#26679;&#26694;&#26550;&#65292;&#29992;&#20110;&#23545;&#36830;&#32493;&#25512;&#33616;&#31995;&#32479;&#20013;&#30340;&#29992;&#25143;&#34892;&#20026;&#36827;&#34892;&#38750;&#22343;&#21248;&#22788;&#29702;&#12290;&#35813;&#26694;&#26550;&#36890;&#36807;&#33258;&#36866;&#24212;&#22320;&#23398;&#20064;&#21382;&#21490;&#34892;&#20026;&#30340;&#20559;&#26012;&#20998;&#24067;&#65292;&#24182;&#37319;&#26679;&#20986;&#20449;&#24687;&#20016;&#23500;&#30340;&#23376;&#38598;&#65292;&#20197;&#26500;&#24314;&#26356;&#20855;&#21487;&#27867;&#21270;&#24615;&#30340;&#36830;&#32493;&#25512;&#33616;&#31995;&#32479;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#30001;&#20110;&#36830;&#32493;&#25512;&#33616;&#31995;&#32479;&#33021;&#22815;&#26377;&#25928;&#25429;&#25417;&#21160;&#24577;&#29992;&#25143;&#20559;&#22909;&#65292;&#22240;&#27492;&#23427;&#20204;&#22312;&#25512;&#33616;&#39046;&#22495;&#20013;&#24191;&#21463;&#27426;&#36814;&#12290;&#24403;&#21069;&#36830;&#32493;&#25512;&#33616;&#31995;&#32479;&#30340;&#19968;&#20010;&#40664;&#35748;&#35774;&#32622;&#26159;&#23558;&#27599;&#20010;&#21382;&#21490;&#34892;&#20026;&#22343;&#21248;&#22320;&#35270;&#20026;&#27491;&#21521;&#20132;&#20114;&#12290;&#28982;&#32780;&#65292;&#23454;&#38469;&#19978;&#65292;&#36825;&#31181;&#35774;&#32622;&#26377;&#21487;&#33021;&#23548;&#33268;&#24615;&#33021;&#19981;&#20339;&#65292;&#22240;&#20026;&#27599;&#20010;&#21830;&#21697;&#23545;&#29992;&#25143;&#30340;&#20852;&#36259;&#26377;&#19981;&#21516;&#30340;&#36129;&#29486;&#12290;&#20363;&#22914;&#65292;&#36141;&#20080;&#30340;&#21830;&#21697;&#24212;&#35813;&#27604;&#28857;&#20987;&#30340;&#21830;&#21697;&#26356;&#37325;&#35201;&#12290;&#22240;&#27492;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#36890;&#29992;&#30340;&#33258;&#21160;&#37319;&#26679;&#26694;&#26550;&#65292;&#21517;&#20026;AutoSAM&#65292;&#29992;&#20110;&#38750;&#22343;&#21248;&#22320;&#22788;&#29702;&#21382;&#21490;&#34892;&#20026;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;AutoSAM&#36890;&#36807;&#22312;&#26631;&#20934;&#30340;&#36830;&#32493;&#25512;&#33616;&#26550;&#26500;&#20013;&#22686;&#21152;&#19968;&#20010;&#37319;&#26679;&#22120;&#23618;&#65292;&#33258;&#36866;&#24212;&#22320;&#23398;&#20064;&#21407;&#22987;&#36755;&#20837;&#30340;&#20559;&#26012;&#20998;&#24067;&#65292;&#24182;&#37319;&#26679;&#20986;&#20449;&#24687;&#20016;&#23500;&#30340;&#23376;&#38598;&#65292;&#20197;&#26500;&#24314;&#26356;&#20855;&#21487;&#27867;&#21270;&#24615;&#30340;&#36830;&#32493;&#25512;&#33616;&#31995;&#32479;&#12290;&#20026;&#20102;&#20811;&#26381;&#38750;&#21487;&#24494;&#20998;&#37319;&#26679;&#25805;&#20316;&#30340;&#25361;&#25112;&#65292;&#21516;&#26102;&#24341;&#20837;&#22810;&#20010;&#20915;&#31574;&#22240;&#32032;&#36827;&#34892;&#37319;&#26679;&#65292;&#25105;&#20204;&#36824;&#25552;&#20986;&#20102;&#36827;&#19968;&#27493;&#30340;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
Sequential recommender systems (SRS) have gained widespread popularity in recommendation due to their ability to effectively capture dynamic user preferences. One default setting in the current SRS is to uniformly consider each historical behavior as a positive interaction. Actually, this setting has the potential to yield sub-optimal performance, as each item makes a distinct contribution to the user's interest. For example, purchased items should be given more importance than clicked ones. Hence, we propose a general automatic sampling framework, named AutoSAM, to non-uniformly treat historical behaviors. Specifically, AutoSAM augments the standard sequential recommendation architecture with an additional sampler layer to adaptively learn the skew distribution of the raw input, and then sample informative sub-sets to build more generalizable SRS. To overcome the challenges of non-differentiable sampling actions and also introduce multiple decision factors for sampling, we further int
&lt;/p&gt;</description></item></channel></rss>