<rss version="2.0"><channel><title>Chat Arxiv cs.IR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.IR</description><item><title>&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#20026;&#20102;&#26356;&#26377;&#25928;&#22320;&#31579;&#36873;&#31995;&#32479;&#24615;&#23457;&#26597;&#29983;&#25104;&#33258;&#28982;&#35821;&#35328;&#26597;&#35810;&#30340;&#26041;&#27861;&#12290;&#36890;&#36807;&#25506;&#32034;&#20351;&#29992;&#19981;&#21516;&#30340;&#26597;&#35810;&#26469;&#28304;&#65292;&#22914;&#29992;&#20110;&#26816;&#32034;&#25991;&#26723;&#21644;&#22522;&#20110;&#25351;&#20196;&#30340;&#22823;&#35268;&#27169;&#35821;&#35328;&#27169;&#22411;&#29983;&#25104;&#30340;&#26597;&#35810;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#26041;&#27861;&#65292;&#21487;&#20197;&#22312;&#31579;&#36873;&#36807;&#31243;&#20013;&#26356;&#20934;&#30830;&#22320;&#25490;&#21517;&#37325;&#35201;&#25991;&#26723;&#65292;&#24182;&#21462;&#24471;&#20102;&#24456;&#22909;&#30340;&#25928;&#26524;&#12290;</title><link>http://arxiv.org/abs/2309.05238</link><description>&lt;p&gt;
&#20026;&#26356;&#26377;&#25928;&#30340;&#31995;&#32479;&#24615;&#23457;&#26597;&#31579;&#36873;&#29983;&#25104;&#33258;&#28982;&#35821;&#35328;&#26597;&#35810;
&lt;/p&gt;
&lt;p&gt;
Generating Natural Language Queries for More Effective Systematic Review Screening Prioritisation. (arXiv:2309.05238v2 [cs.IR] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.05238
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#20026;&#20102;&#26356;&#26377;&#25928;&#22320;&#31579;&#36873;&#31995;&#32479;&#24615;&#23457;&#26597;&#29983;&#25104;&#33258;&#28982;&#35821;&#35328;&#26597;&#35810;&#30340;&#26041;&#27861;&#12290;&#36890;&#36807;&#25506;&#32034;&#20351;&#29992;&#19981;&#21516;&#30340;&#26597;&#35810;&#26469;&#28304;&#65292;&#22914;&#29992;&#20110;&#26816;&#32034;&#25991;&#26723;&#21644;&#22522;&#20110;&#25351;&#20196;&#30340;&#22823;&#35268;&#27169;&#35821;&#35328;&#27169;&#22411;&#29983;&#25104;&#30340;&#26597;&#35810;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#26041;&#27861;&#65292;&#21487;&#20197;&#22312;&#31579;&#36873;&#36807;&#31243;&#20013;&#26356;&#20934;&#30830;&#22320;&#25490;&#21517;&#37325;&#35201;&#25991;&#26723;&#65292;&#24182;&#21462;&#24471;&#20102;&#24456;&#22909;&#30340;&#25928;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21307;&#23398;&#31995;&#32479;&#24615;&#23457;&#26597;&#20013;&#30340;&#31579;&#36873;&#20248;&#20808;&#32423;&#30446;&#26631;&#26159;&#36890;&#36807;&#22797;&#26434;&#30340;&#24067;&#23572;&#26597;&#35810;&#23545;&#26816;&#32034;&#21040;&#30340;&#25991;&#26723;&#38598;&#36827;&#34892;&#25490;&#21517;&#12290;&#20248;&#20808;&#22788;&#29702;&#26368;&#37325;&#35201;&#30340;&#25991;&#26723;&#21487;&#20197;&#30830;&#20445;&#21518;&#32493;&#23457;&#26597;&#27493;&#39588;&#33021;&#22815;&#26356;&#39640;&#25928;&#12289;&#26356;&#26377;&#25928;&#22320;&#36827;&#34892;&#12290;&#30446;&#21069;&#30340;&#26368;&#26032;&#25216;&#26415;&#20351;&#29992;&#23457;&#26597;&#30340;&#26368;&#32456;&#26631;&#39064;&#20316;&#20026;&#26597;&#35810;&#65292;&#21033;&#29992;&#22522;&#20110;BERT&#30340;&#31070;&#32463;&#25490;&#24207;&#22120;&#23545;&#25991;&#26723;&#36827;&#34892;&#25490;&#21517;&#12290;&#28982;&#32780;&#65292;&#26368;&#32456;&#26631;&#39064;&#21482;&#22312;&#23457;&#26597;&#36807;&#31243;&#32467;&#26463;&#26102;&#24418;&#25104;&#65292;&#36825;&#20351;&#24471;&#35813;&#26041;&#27861;&#19981;&#20999;&#23454;&#38469;&#65292;&#22240;&#20026;&#23427;&#20381;&#36182;&#20110;ex post facto&#30340;&#20449;&#24687;&#12290;&#22312;&#31579;&#36873;&#30340;&#26102;&#20505;&#65292;&#21482;&#26377;&#19968;&#20010;&#31895;&#30053;&#30340;&#24037;&#20316;&#26631;&#39064;&#21487;&#29992;&#65292;&#20351;&#29992;BERT-based&#25490;&#24207;&#22120;&#26102;&#25928;&#26524;&#26126;&#26174;&#19981;&#22914;&#26368;&#32456;&#26631;&#39064;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25506;&#32034;&#20102;&#29992;&#20110;&#31579;&#36873;&#20248;&#20808;&#32423;&#30340;&#26597;&#35810;&#30340;&#26367;&#20195;&#26469;&#28304;&#65292;&#20363;&#22914;&#29992;&#20110;&#26816;&#32034;&#24453;&#31579;&#36873;&#25991;&#26723;&#30340;&#24067;&#23572;&#26597;&#35810;&#65292;&#20197;&#21450;&#30001;&#22522;&#20110;&#25351;&#20196;&#30340;&#22823;&#35268;&#27169;&#35821;&#35328;&#27169;&#22411;&#65288;&#22914;ChatGPT&#21644;Alpaca&#65289;&#29983;&#25104;&#30340;&#26597;&#35810;&#12290;&#25105;&#20204;&#30340;&#26368;&#20339;&#26041;&#27861;&#19981;&#20165;&#20165;&#26159;
&lt;/p&gt;
&lt;p&gt;
Screening prioritisation in medical systematic reviews aims to rank the set of documents retrieved by complex Boolean queries. Prioritising the most important documents ensures that subsequent review steps can be carried out more efficiently and effectively. The current state of the art uses the final title of the review as a query to rank the documents using BERT-based neural rankers. However, the final title is only formulated at the end of the review process, which makes this approach impractical as it relies on ex post facto information. At the time of screening, only a rough working title is available, with which the BERT-based ranker performs significantly worse than with the final title. In this paper, we explore alternative sources of queries for prioritising screening, such as the Boolean query used to retrieve the documents to be screened and queries generated by instruction-based generative large-scale language models such as ChatGPT and Alpaca. Our best approach is not only
&lt;/p&gt;</description></item></channel></rss>