<rss version="2.0"><channel><title>Chat Arxiv cs.IR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.IR</description><item><title>&#35813;&#35770;&#25991;&#32508;&#36848;&#20102;&#20256;&#32479;&#30340;&#20113;&#25512;&#33616;&#31995;&#32479;&#65288;CloudRSs&#65289;&#19982;&#22522;&#20110;&#35774;&#22791;&#30340;&#25512;&#33616;&#31995;&#32479;&#65288;DeviceRSs&#65289;&#20043;&#38388;&#30340;&#21306;&#21035;&#21644;&#20248;&#21183;&#65292;&#24182;&#25552;&#20986;&#20102;&#21033;&#29992;&#36793;&#32536;&#35774;&#22791;&#30340;&#23384;&#20648;&#12289;&#36890;&#20449;&#21644;&#35745;&#31639;&#33021;&#21147;&#26469;&#35299;&#20915;&#36164;&#28304;&#28040;&#32791;&#12289;&#21709;&#24212;&#24310;&#36831;&#20197;&#21450;&#38544;&#31169;&#21644;&#23433;&#20840;&#39118;&#38505;&#30340;&#26041;&#27861;&#12290;</title><link>https://arxiv.org/abs/2401.11441</link><description>&lt;p&gt;
&#35774;&#22791;&#19978;&#30340;&#25512;&#33616;&#31995;&#32479;&#65306;&#32508;&#36848;
&lt;/p&gt;
&lt;p&gt;
On-Device Recommender Systems: A Comprehensive Survey
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2401.11441
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#32508;&#36848;&#20102;&#20256;&#32479;&#30340;&#20113;&#25512;&#33616;&#31995;&#32479;&#65288;CloudRSs&#65289;&#19982;&#22522;&#20110;&#35774;&#22791;&#30340;&#25512;&#33616;&#31995;&#32479;&#65288;DeviceRSs&#65289;&#20043;&#38388;&#30340;&#21306;&#21035;&#21644;&#20248;&#21183;&#65292;&#24182;&#25552;&#20986;&#20102;&#21033;&#29992;&#36793;&#32536;&#35774;&#22791;&#30340;&#23384;&#20648;&#12289;&#36890;&#20449;&#21644;&#35745;&#31639;&#33021;&#21147;&#26469;&#35299;&#20915;&#36164;&#28304;&#28040;&#32791;&#12289;&#21709;&#24212;&#24310;&#36831;&#20197;&#21450;&#38544;&#31169;&#21644;&#23433;&#20840;&#39118;&#38505;&#30340;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25512;&#33616;&#31995;&#32479;&#24050;&#32463;&#22312;&#21508;&#31181;&#23454;&#38469;&#24212;&#29992;&#20013;&#24191;&#27867;&#37096;&#32626;&#65292;&#20197;&#24110;&#21161;&#29992;&#25143;&#20174;&#28023;&#37327;&#20449;&#24687;&#20013;&#25214;&#21040;&#24863;&#20852;&#36259;&#30340;&#20869;&#23481;&#12290;&#20256;&#32479;&#30340;&#25512;&#33616;&#31995;&#32479;&#36890;&#36807;&#22312;&#20113;&#25968;&#25454;&#20013;&#24515;&#25910;&#38598;&#29992;&#25143;-&#29289;&#21697;&#20132;&#20114;&#25968;&#25454;&#65292;&#24182;&#35757;&#32451;&#19968;&#20010;&#38598;&#20013;&#24335;&#27169;&#22411;&#26469;&#36827;&#34892;&#25512;&#33616;&#26381;&#21153;&#12290;&#28982;&#32780;&#65292;&#36825;&#31181;&#22522;&#20110;&#20113;&#30340;&#25512;&#33616;&#31995;&#32479;&#65288;CloudRSs&#65289;&#19981;&#21487;&#36991;&#20813;&#22320;&#38754;&#20020;&#30528;&#36807;&#22810;&#30340;&#36164;&#28304;&#28040;&#32791;&#12289;&#21709;&#24212;&#24310;&#36831;&#20197;&#21450;&#28041;&#21450;&#25968;&#25454;&#21644;&#27169;&#22411;&#30340;&#38544;&#31169;&#21644;&#23433;&#20840;&#39118;&#38505;&#12290;&#26368;&#36817;&#65292;&#21463;&#21040;&#36793;&#32536;&#35774;&#22791;&#23384;&#20648;&#12289;&#36890;&#20449;&#21644;&#35745;&#31639;&#33021;&#21147;&#30340;&#36827;&#27493;&#25512;&#21160;&#65292;&#20154;&#20204;&#36880;&#28176;&#20174;CloudRSs&#36716;&#21521;&#20102;&#35774;&#22791;&#19978;&#30340;&#25512;&#33616;&#31995;&#32479;&#65288;DeviceRSs&#65289;&#65292;&#36825;&#20123;&#31995;&#32479;&#21033;&#29992;&#36793;&#32536;&#35774;&#22791;&#30340;&#33021;&#21147;&#26469;&#26368;&#23567;&#21270;&#38598;&#20013;&#24335;&#25968;&#25454;&#23384;&#20648;&#30340;&#35201;&#27714;&#65292;&#20943;&#23569;&#36890;&#20449;&#24320;&#38144;&#24102;&#26469;&#30340;&#21709;&#24212;&#24310;&#36831;&#65292;&#24182;&#36890;&#36807;&#26412;&#22320;&#21270;&#30340;&#26041;&#24335;&#22686;&#24378;&#29992;&#25143;&#30340;&#38544;&#31169;&#21644;&#23433;&#20840;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2401.11441v2 Announce Type: replace  Abstract: Recommender systems have been widely deployed in various real-world applications to help users identify content of interest from massive amounts of information. Traditional recommender systems work by collecting user-item interaction data in a cloud-based data center and training a centralized model to perform the recommendation service. However, such cloud-based recommender systems (CloudRSs) inevitably suffer from excessive resource consumption, response latency, as well as privacy and security risks concerning both data and models. Recently, driven by the advances in storage, communication, and computation capabilities of edge devices, there has been a shift of focus from CloudRSs to on-device recommender systems (DeviceRSs), which leverage the capabilities of edge devices to minimize centralized data storage requirements, reduce the response latency caused by communication overheads, and enhance user privacy and security by local
&lt;/p&gt;</description></item></channel></rss>