<rss version="2.0"><channel><title>Chat Arxiv cs.IR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.IR</description><item><title>&#36825;&#39033;&#30740;&#31350;&#25552;&#20986;&#20102;&#25968;&#25454;&#21019;&#24314;&#32773;&#21644;&#25968;&#25454;&#37325;&#29992;&#32773;&#20043;&#38388;&#36317;&#31163;&#30340;&#29702;&#35770;&#26500;&#24314;&#65292;&#24182;&#30830;&#23450;&#20102;&#24433;&#21709;&#26377;&#25928;&#20256;&#36882;&#30693;&#35782;&#33021;&#21147;&#30340;&#20845;&#20010;&#36317;&#31163;&#32500;&#24230;&#65292;&#20026;&#25968;&#25454;&#31649;&#29702;&#25237;&#36164;&#21644;&#25913;&#36827;&#25968;&#25454;&#20132;&#25442;&#36807;&#31243;&#25552;&#20379;&#25351;&#23548;&#12290;</title><link>https://arxiv.org/abs/2402.07926</link><description>&lt;p&gt;
&#20174;&#25968;&#25454;&#21019;&#24314;&#32773;&#21040;&#25968;&#25454;&#37325;&#29992;&#32773;&#65306;&#36317;&#31163;&#30340;&#37325;&#35201;&#24615;
&lt;/p&gt;
&lt;p&gt;
From Data Creator to Data Reuser: Distance Matters
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.07926
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#30740;&#31350;&#25552;&#20986;&#20102;&#25968;&#25454;&#21019;&#24314;&#32773;&#21644;&#25968;&#25454;&#37325;&#29992;&#32773;&#20043;&#38388;&#36317;&#31163;&#30340;&#29702;&#35770;&#26500;&#24314;&#65292;&#24182;&#30830;&#23450;&#20102;&#24433;&#21709;&#26377;&#25928;&#20256;&#36882;&#30693;&#35782;&#33021;&#21147;&#30340;&#20845;&#20010;&#36317;&#31163;&#32500;&#24230;&#65292;&#20026;&#25968;&#25454;&#31649;&#29702;&#25237;&#36164;&#21644;&#25913;&#36827;&#25968;&#25454;&#20132;&#25442;&#36807;&#31243;&#25552;&#20379;&#25351;&#23548;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20849;&#20139;&#30740;&#31350;&#25968;&#25454;&#26159;&#22797;&#26434;&#12289;&#21171;&#21160;&#23494;&#38598;&#12289;&#26114;&#36149;&#30340;&#65292;&#38656;&#35201;&#22810;&#20010;&#21033;&#30410;&#30456;&#20851;&#32773;&#30340;&#22522;&#30784;&#35774;&#26045;&#25237;&#36164;&#12290;&#24320;&#25918;&#31185;&#23398;&#25919;&#31574;&#20391;&#37325;&#20110;&#25968;&#25454;&#21457;&#24067;&#32780;&#19981;&#26159;&#25968;&#25454;&#37325;&#29992;&#65292;&#28982;&#32780;&#37325;&#29992;&#20063;&#26159;&#22256;&#38590;&#12289;&#26114;&#36149;&#30340;&#65292;&#21487;&#33021;&#27704;&#36828;&#19981;&#20250;&#21457;&#29983;&#12290;&#36890;&#36807;&#32771;&#34385;&#35841;&#21487;&#33021;&#37325;&#29992;&#25968;&#25454;&#65292;&#22914;&#20309;&#37325;&#29992;&#25968;&#25454;&#65292;&#20026;&#20309;&#37325;&#29992;&#25968;&#25454;&#65292;&#20197;&#21450;&#20309;&#26102;&#37325;&#29992;&#25968;&#25454;&#31561;&#22240;&#32032;&#65292;&#21487;&#20197;&#26356;&#26126;&#26234;&#22320;&#36827;&#34892;&#25968;&#25454;&#31649;&#29702;&#25237;&#36164;&#12290;&#25968;&#25454;&#21019;&#36896;&#32773;&#26080;&#27861;&#39044;&#35265;&#25152;&#26377;&#21487;&#33021;&#30340;&#37325;&#29992;&#25110;&#37325;&#29992;&#32773;&#65307;&#25105;&#20204;&#30340;&#30446;&#26631;&#26159;&#30830;&#23450;&#21487;&#33021;&#26377;&#21161;&#20110;&#21033;&#30410;&#30456;&#20851;&#32773;&#20915;&#23450;&#22914;&#20309;&#25237;&#36164;&#30740;&#31350;&#25968;&#25454;&#65292;&#22914;&#20309;&#30830;&#23450;&#28508;&#22312;&#30340;&#37325;&#29992;&#21644;&#37325;&#29992;&#32773;&#65292;&#20197;&#21450;&#22914;&#20309;&#25913;&#36827;&#25968;&#25454;&#20132;&#25442;&#36807;&#31243;&#30340;&#22240;&#32032;&#12290;&#22522;&#20110;&#25968;&#25454;&#20849;&#20139;&#21644;&#37325;&#29992;&#30340;&#23454;&#35777;&#30740;&#31350;&#65292;&#25105;&#20204;&#24320;&#21457;&#20102;&#25968;&#25454;&#21019;&#24314;&#32773;&#21644;&#25968;&#25454;&#37325;&#29992;&#32773;&#20043;&#38388;&#36317;&#31163;&#30340;&#29702;&#35770;&#26500;&#24314;&#65292;&#24182;&#30830;&#23450;&#20102;&#24433;&#21709;&#26377;&#25928;&#20256;&#36882;&#30693;&#35782;&#33021;&#21147;&#30340;&#20845;&#20010;&#36317;&#31163;&#32500;&#24230;&#65306;&#39046;&#22495;&#12289;&#26041;&#27861;&#12289;&#21512;&#20316;&#12289;&#31574;&#21010;&#12289;&#30446;&#30340;&#21644;&#26102;&#38388;&#24615;&#12290;&#36825;&#20123;&#32500;&#24230;&#20027;&#35201;&#26159;
&lt;/p&gt;
&lt;p&gt;
Sharing research data is complex, labor-intensive, expensive, and requires infrastructure investments by multiple stakeholders. Open science policies focus on data release rather than on data reuse, yet reuse is also difficult, expensive, and may never occur. Investments in data management could be made more wisely by considering who might reuse data, how, why, for what purposes, and when. Data creators cannot anticipate all possible reuses or reusers; our goal is to identify factors that may aid stakeholders in deciding how to invest in research data, how to identify potential reuses and reusers, and how to improve data exchange processes. Drawing upon empirical studies of data sharing and reuse, we develop the theoretical construct of distance between data creator and data reuser, identifying six distance dimensions that influence the ability to transfer knowledge effectively: domain, methods, collaboration, curation, purposes, and time and temporality. These dimensions are primarily
&lt;/p&gt;</description></item></channel></rss>