<rss version="2.0"><channel><title>Chat Arxiv cs.IR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.IR</description><item><title>S+t-SNE&#26159;t-SNE&#31639;&#27861;&#30340;&#25913;&#36827;&#29256;&#26412;&#65292;&#22312;&#22788;&#29702;&#25968;&#25454;&#27969;&#26102;&#20855;&#26377;&#22686;&#37327;&#26356;&#26032;&#21644;&#30450;&#30446;&#28418;&#31227;&#31649;&#29702;&#30340;&#29305;&#28857;&#65292;&#33021;&#22815;&#23454;&#29616;&#39640;&#25928;&#30340;&#38477;&#32500;&#21644;&#20449;&#24687;&#21487;&#35270;&#21270;&#12290;</title><link>https://arxiv.org/abs/2403.17643</link><description>&lt;p&gt;
S+t-SNE - &#23558;&#38477;&#32500;&#24341;&#20837;&#25968;&#25454;&#27969;
&lt;/p&gt;
&lt;p&gt;
S+t-SNE - Bringing dimensionality reduction to data streams
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.17643
&lt;/p&gt;
&lt;p&gt;
S+t-SNE&#26159;t-SNE&#31639;&#27861;&#30340;&#25913;&#36827;&#29256;&#26412;&#65292;&#22312;&#22788;&#29702;&#25968;&#25454;&#27969;&#26102;&#20855;&#26377;&#22686;&#37327;&#26356;&#26032;&#21644;&#30450;&#30446;&#28418;&#31227;&#31649;&#29702;&#30340;&#29305;&#28857;&#65292;&#33021;&#22815;&#23454;&#29616;&#39640;&#25928;&#30340;&#38477;&#32500;&#21644;&#20449;&#24687;&#21487;&#35270;&#21270;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;S+t-SNE&#65292;&#36825;&#26159;t-SNE&#31639;&#27861;&#30340;&#19968;&#31181;&#25913;&#36827;&#65292;&#26088;&#22312;&#22788;&#29702;&#26080;&#38480;&#25968;&#25454;&#27969;&#12290;S+t-SNE&#30340;&#26680;&#24515;&#24605;&#24819;&#26159;&#38543;&#30528;&#26032;&#25968;&#25454;&#30340;&#21040;&#26469;&#36880;&#27493;&#26356;&#26032;t-SNE&#23884;&#20837;&#65292;&#30830;&#20445;&#21487;&#25193;&#23637;&#24615;&#21644;&#36866;&#24212;&#24615;&#65292;&#20197;&#22788;&#29702;&#27969;&#24335;&#22330;&#26223;&#12290;&#36890;&#36807;&#22312;&#27599;&#19968;&#27493;&#36873;&#25321;&#26368;&#37325;&#35201;&#30340;&#28857;&#65292;&#35813;&#31639;&#27861;&#30830;&#20445;&#21487;&#25193;&#23637;&#24615;&#21516;&#26102;&#20445;&#25345;&#20449;&#24687;&#21487;&#35270;&#21270;&#12290;&#37319;&#29992;&#30450;&#30446;&#26041;&#27861;&#36827;&#34892;&#28418;&#31227;&#31649;&#29702;&#35843;&#25972;&#23884;&#20837;&#31354;&#38388;&#65292;&#20419;&#36827;&#19981;&#26029;&#21487;&#35270;&#21270;&#19981;&#26029;&#21457;&#23637;&#30340;&#25968;&#25454;&#21160;&#24577;&#12290;&#25105;&#20204;&#30340;&#23454;&#39564;&#35780;&#20272;&#35777;&#26126;&#20102;S+t-SNE&#30340;&#26377;&#25928;&#24615;&#21644;&#25928;&#29575;&#12290;&#32467;&#26524;&#31361;&#26174;&#20102;&#20854;&#22312;&#27969;&#24335;&#22330;&#26223;&#20013;&#25429;&#25417;&#27169;&#24335;&#30340;&#33021;&#21147;&#12290;&#25105;&#20204;&#24076;&#26395;&#25105;&#20204;&#30340;&#26041;&#27861;&#20026;&#30740;&#31350;&#20154;&#21592;&#21644;&#20174;&#19994;&#32773;&#25552;&#20379;&#19968;&#20010;&#23454;&#26102;&#24037;&#20855;&#65292;&#29992;&#20110;&#29702;&#35299;&#21644;&#35299;&#37322;&#39640;&#32500;&#25968;&#25454;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.17643v1 Announce Type: new  Abstract: We present S+t-SNE, an adaptation of the t-SNE algorithm designed to handle infinite data streams. The core idea behind S+t-SNE is to update the t-SNE embedding incrementally as new data arrives, ensuring scalability and adaptability to handle streaming scenarios. By selecting the most important points at each step, the algorithm ensures scalability while keeping informative visualisations. Employing a blind method for drift management adjusts the embedding space, facilitating continuous visualisation of evolving data dynamics. Our experimental evaluations demonstrate the effectiveness and efficiency of S+t-SNE. The results highlight its ability to capture patterns in a streaming scenario. We hope our approach offers researchers and practitioners a real-time tool for understanding and interpreting high-dimensional data.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#36890;&#36807;NLP&#20998;&#26512;&#20102;ESG&#20027;&#23548;&#30340;DLT&#30740;&#31350;&#30340;&#28436;&#21270;&#65292;&#36890;&#36807;&#26500;&#24314;&#24341;&#29992;&#32593;&#32476;&#21644;&#21629;&#21517;&#23454;&#20307;&#35782;&#21035;&#20219;&#21153;&#65292;&#23545;DLT&#22312;ESG&#32972;&#26223;&#19979;&#30340;&#21457;&#23637;&#36827;&#34892;&#20102;&#25991;&#29486;&#32508;&#36848;&#12290;</title><link>http://arxiv.org/abs/2308.12420</link><description>&lt;p&gt;
ESG&#20027;&#23548;&#30340;DLT&#30740;&#31350;&#30340;&#28436;&#21270;&#65306;&#23545;&#25991;&#29486;&#36827;&#34892;NLP&#20998;&#26512;
&lt;/p&gt;
&lt;p&gt;
Evolution of ESG-focused DLT Research: An NLP Analysis of the Literature. (arXiv:2308.12420v1 [cs.IR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.12420
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#36890;&#36807;NLP&#20998;&#26512;&#20102;ESG&#20027;&#23548;&#30340;DLT&#30740;&#31350;&#30340;&#28436;&#21270;&#65292;&#36890;&#36807;&#26500;&#24314;&#24341;&#29992;&#32593;&#32476;&#21644;&#21629;&#21517;&#23454;&#20307;&#35782;&#21035;&#20219;&#21153;&#65292;&#23545;DLT&#22312;ESG&#32972;&#26223;&#19979;&#30340;&#21457;&#23637;&#36827;&#34892;&#20102;&#25991;&#29486;&#32508;&#36848;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20998;&#24067;&#24335;&#36134;&#26412;&#25216;&#26415;(DLT)&#36805;&#36895;&#21457;&#23637;&#65292;&#38656;&#35201;&#20840;&#38754;&#20102;&#35299;&#20854;&#21508;&#20010;&#32452;&#25104;&#37096;&#20998;&#12290;&#28982;&#32780;&#65292;&#38024;&#23545;DLT&#30340;&#29615;&#22659;&#12289;&#21487;&#25345;&#32493;&#24615;&#21644;&#27835;&#29702;(ESG)&#32452;&#25104;&#37096;&#20998;&#30340;&#31995;&#32479;&#25991;&#29486;&#32508;&#36848;&#36824;&#19981;&#36275;&#12290;&#20026;&#22635;&#34917;&#36825;&#19968;&#31354;&#30333;&#65292;&#25105;&#20204;&#36873;&#25321;&#20102;107&#31687;&#31181;&#23376;&#25991;&#29486;&#65292;&#26500;&#24314;&#20102;&#19968;&#20010;&#21253;&#21547;63,083&#20010;&#21442;&#32771;&#25991;&#29486;&#30340;&#24341;&#29992;&#32593;&#32476;&#65292;&#24182;&#23558;&#20854;&#31934;&#28860;&#20026;24,539&#31687;&#25991;&#29486;&#30340;&#35821;&#26009;&#24211;&#36827;&#34892;&#20998;&#26512;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#26681;&#25454;&#19968;&#20010;&#24050;&#24314;&#31435;&#30340;&#25216;&#26415;&#20998;&#31867;&#27861;&#20174;46&#31687;&#35770;&#25991;&#20013;&#26631;&#35760;&#20102;&#21629;&#21517;&#23454;&#20307;&#65292;&#24182;&#36890;&#36807;&#25214;&#20986;DLT&#30340;ESG&#35201;&#32032;&#26469;&#23436;&#21892;&#36825;&#20010;&#20998;&#31867;&#27861;&#12290;&#21033;&#29992;&#22522;&#20110;transformer&#30340;&#35821;&#35328;&#27169;&#22411;&#65292;&#25105;&#20204;&#23545;&#19968;&#20010;&#39044;&#20808;&#35757;&#32451;&#30340;&#35821;&#35328;&#27169;&#22411;&#36827;&#34892;&#20102;&#32454;&#21270;&#35843;&#25972;&#65292;&#29992;&#20110;&#21629;&#21517;&#23454;&#20307;&#35782;&#21035;&#20219;&#21153;&#65292;&#20351;&#29992;&#25105;&#20204;&#26631;&#35760;&#30340;&#25968;&#25454;&#38598;&#12290;&#25105;&#20204;&#21033;&#29992;&#25105;&#20204;&#35843;&#25972;&#21518;&#30340;&#35821;&#35328;&#27169;&#22411;&#23545;&#35821;&#26009;&#24211;&#36827;&#34892;&#20102;&#31934;&#31616;&#65292;&#24471;&#21040;&#20102;505&#31687;&#20851;&#38190;&#35770;&#25991;&#65292;&#36890;&#36807;&#21629;&#21517;&#23454;&#20307;&#21644;&#26102;&#38388;&#22270;&#20998;&#26512;&#65292;&#20419;&#36827;&#20102;&#23545;DLT&#22312;ESG&#32972;&#26223;&#19979;&#30340;&#28436;&#21270;&#30340;&#25991;&#29486;&#32508;&#36848;&#12290;
&lt;/p&gt;
&lt;p&gt;
Distributed Ledger Technologies (DLTs) have rapidly evolved, necessitating comprehensive insights into their diverse components. However, a systematic literature review that emphasizes the Environmental, Sustainability, and Governance (ESG) components of DLT remains lacking. To bridge this gap, we selected 107 seed papers to build a citation network of 63,083 references and refined it to a corpus of 24,539 publications for analysis. Then, we labeled the named entities in 46 papers according to twelve top-level categories derived from an established technology taxonomy and enhanced the taxonomy by pinpointing DLT's ESG elements. Leveraging transformer-based language models, we fine-tuned a pre-trained language model for a Named Entity Recognition (NER) task using our labeled dataset. We used our fine-tuned language model to distill the corpus to 505 key papers, facilitating a literature review via named entities and temporal graph analysis on DLT evolution in the context of ESG. Our con
&lt;/p&gt;</description></item></channel></rss>