<rss version="2.0"><channel><title>Chat Arxiv cs.IR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.IR</description><item><title>&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;&#28548;&#28165;&#38382;&#39064;&#23545;&#29992;&#25143;&#28385;&#24847;&#24230;&#30340;&#37325;&#35201;&#24433;&#21709;&#65292;&#30740;&#31350;&#21457;&#29616;&#20855;&#20307;&#38382;&#39064;&#12289;&#38382;&#39064;&#30340;&#20027;&#35266;&#24615;&#21644;&#24773;&#24863;&#33394;&#24425;&#20197;&#21450;&#26597;&#35810;&#38271;&#24230;&#31561;&#29305;&#24449;&#23545;&#28548;&#28165;&#30340;&#26377;&#25928;&#24615;&#26377;&#26126;&#26174;&#24433;&#21709;&#12290;</title><link>https://arxiv.org/abs/2402.01934</link><description>&lt;p&gt;
&#28548;&#28165;&#36335;&#24452;&#23545;&#29992;&#25143;&#28385;&#24847;&#24230;&#30340;&#24433;&#21709;&#65306;&#23545;&#28548;&#28165;&#38382;&#39064;&#26377;&#29992;&#24615;&#30340;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Clarifying the Path to User Satisfaction: An Investigation into Clarification Usefulness
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.01934
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;&#28548;&#28165;&#38382;&#39064;&#23545;&#29992;&#25143;&#28385;&#24847;&#24230;&#30340;&#37325;&#35201;&#24433;&#21709;&#65292;&#30740;&#31350;&#21457;&#29616;&#20855;&#20307;&#38382;&#39064;&#12289;&#38382;&#39064;&#30340;&#20027;&#35266;&#24615;&#21644;&#24773;&#24863;&#33394;&#24425;&#20197;&#21450;&#26597;&#35810;&#38271;&#24230;&#31561;&#29305;&#24449;&#23545;&#28548;&#28165;&#30340;&#26377;&#25928;&#24615;&#26377;&#26126;&#26174;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#28548;&#28165;&#38382;&#39064;&#26159;&#29616;&#20195;&#20449;&#24687;&#26816;&#32034;&#31995;&#32479;&#30340;&#37325;&#35201;&#32452;&#25104;&#37096;&#20998;&#65292;&#30452;&#25509;&#24433;&#21709;&#29992;&#25143;&#28385;&#24847;&#24230;&#21644;&#25972;&#20307;&#31995;&#32479;&#24615;&#33021;&#12290;&#38169;&#35823;&#26500;&#24314;&#30340;&#38382;&#39064;&#21487;&#33021;&#23548;&#33268;&#29992;&#25143;&#30340;&#19981;&#28385;&#21644;&#22256;&#24785;&#65292;&#36827;&#32780;&#23545;&#31995;&#32479;&#30340;&#24615;&#33021;&#20135;&#29983;&#36127;&#38754;&#24433;&#21709;&#12290;&#26412;&#30740;&#31350;&#26088;&#22312;&#36843;&#20999;&#38656;&#35201;&#30830;&#23450;&#21644;&#21033;&#29992;&#26377;&#21161;&#20110;&#20998;&#31867;&#28548;&#28165;&#38382;&#39064;&#30340;&#20851;&#38190;&#29305;&#24449;&#65292;&#20197;&#25552;&#21319;&#29992;&#25143;&#28385;&#24847;&#24230;&#12290;&#20026;&#20102;&#26356;&#28145;&#20837;&#22320;&#20102;&#35299;&#19981;&#21516;&#29305;&#24449;&#23545;&#29992;&#25143;&#28385;&#24847;&#24230;&#30340;&#24433;&#21709;&#65292;&#25105;&#20204;&#36827;&#34892;&#20102;&#20840;&#38754;&#30340;&#20998;&#26512;&#65292;&#32771;&#34385;&#20102;&#24191;&#27867;&#30340;&#35789;&#27719;&#12289;&#35821;&#20041;&#21644;&#32479;&#35745;&#29305;&#24449;&#65292;&#22914;&#38382;&#39064;&#38271;&#24230;&#21644;&#24773;&#24863;&#26497;&#24615;&#31561;&#12290;&#25105;&#20204;&#30340;&#23454;&#35777;&#32467;&#26524;&#25552;&#20379;&#20102;&#20851;&#20110;&#26377;&#25928;&#26597;&#35810;&#28548;&#28165;&#30340;&#19977;&#20010;&#20027;&#35201;&#35265;&#35299;&#65306;&#65288;1&#65289;&#20855;&#20307;&#30340;&#38382;&#39064;&#27604;&#27867;&#21270;&#30340;&#38382;&#39064;&#26356;&#26377;&#25928;&#65307;&#65288;2&#65289;&#38382;&#39064;&#30340;&#20027;&#35266;&#24615;&#21644;&#24773;&#24863;&#33394;&#24425;&#36215;&#21040;&#19968;&#23450;&#20316;&#29992;&#65307;&#65288;3&#65289;&#36739;&#30701;&#21644;&#26356;&#27169;&#31946;&#30340;&#26597;&#35810;&#22312;&#28548;&#28165;&#36807;&#31243;&#20013;&#24471;&#30410;&#33391;&#22810;&#12290;
&lt;/p&gt;
&lt;p&gt;
Clarifying questions are an integral component of modern information retrieval systems, directly impacting user satisfaction and overall system performance. Poorly formulated questions can lead to user frustration and confusion, negatively affecting the system's performance. This research addresses the urgent need to identify and leverage key features that contribute to the classification of clarifying questions, enhancing user satisfaction. To gain deeper insights into how different features influence user satisfaction, we conduct a comprehensive analysis, considering a broad spectrum of lexical, semantic, and statistical features, such as question length and sentiment polarity. Our empirical results provide three main insights into the qualities of effective query clarification: (1) specific questions are more effective than generic ones; (2) the subjectivity and emotional tone of a question play a role; and (3) shorter and more ambiguous queries benefit significantly from clarificat
&lt;/p&gt;</description></item></channel></rss>