<rss version="2.0"><channel><title>Chat Arxiv cs.IR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.IR</description><item><title>&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;LIST&#30340;&#26032;&#25216;&#26415;&#65292;&#36890;&#36807;&#23398;&#20064;&#20026;&#22522;&#20110;&#23884;&#20837;&#30340;&#31354;&#38388;&#20851;&#38190;&#35789;&#26597;&#35810;&#24314;&#31435;&#31354;&#38388;&#25991;&#26412;&#25968;&#25454;&#32034;&#24341;&#65292;&#20197;&#21152;&#36895;top-k&#25628;&#32034;&#36807;&#31243;&#12290;</title><link>https://arxiv.org/abs/2403.07331</link><description>&lt;p&gt;
LIST: &#23398;&#20064;&#20026;&#22522;&#20110;&#23884;&#20837;&#30340;&#31354;&#38388;&#20851;&#38190;&#35789;&#26597;&#35810;&#24314;&#31435;&#31354;&#38388;&#25991;&#26412;&#25968;&#25454;&#32034;&#24341;
&lt;/p&gt;
&lt;p&gt;
LIST: Learning to Index Spatio-Textual Data for Embedding based Spatial Keyword Queries
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.07331
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;LIST&#30340;&#26032;&#25216;&#26415;&#65292;&#36890;&#36807;&#23398;&#20064;&#20026;&#22522;&#20110;&#23884;&#20837;&#30340;&#31354;&#38388;&#20851;&#38190;&#35789;&#26597;&#35810;&#24314;&#31435;&#31354;&#38388;&#25991;&#26412;&#25968;&#25454;&#32034;&#24341;&#65292;&#20197;&#21152;&#36895;top-k&#25628;&#32034;&#36807;&#31243;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38543;&#30528;&#31354;&#38388;&#25991;&#26412;&#25968;&#25454;&#30340;&#26222;&#21450;&#65292;&#8220;Top-k KNN&#31354;&#38388;&#20851;&#38190;&#35789;&#26597;&#35810;&#65288;TkQs&#65289;&#8221;&#24050;&#32463;&#22312;&#35768;&#22810;&#23454;&#38469;&#24212;&#29992;&#20013;&#21457;&#29616;&#65292;&#23427;&#22522;&#20110;&#19968;&#20010;&#35780;&#20215;&#31354;&#38388;&#21644;&#25991;&#26412;&#30456;&#20851;&#24615;&#30340;&#25490;&#21517;&#20989;&#25968;&#36820;&#22238;&#19968;&#20010;&#23545;&#35937;&#21015;&#34920;&#12290;&#29616;&#26377;&#30340;&#29992;&#20110;TkQs&#30340;geo-textual&#32034;&#24341;&#20351;&#29992;&#20256;&#32479;&#30340;&#26816;&#32034;&#27169;&#22411;&#65288;&#22914;BM25&#65289;&#26469;&#35745;&#31639;&#25991;&#26412;&#30456;&#20851;&#24615;&#65292;&#24182;&#36890;&#24120;&#21033;&#29992;&#31616;&#21333;&#30340;&#32447;&#24615;&#20989;&#25968;&#26469;&#35745;&#31639;&#31354;&#38388;&#30456;&#20851;&#24615;&#65292;&#20294;&#20854;&#25928;&#26524;&#26377;&#38480;&#12290;&#20026;&#20102;&#25552;&#39640;&#25928;&#26524;&#65292;&#26368;&#36817;&#25552;&#20986;&#20102;&#20960;&#31181;&#28145;&#24230;&#23398;&#20064;&#27169;&#22411;&#65292;&#20294;&#23427;&#20204;&#23384;&#22312;&#20005;&#37325;&#30340;&#25928;&#29575;&#38382;&#39064;&#12290;&#25454;&#25105;&#20204;&#25152;&#30693;&#65292;&#30446;&#21069;&#27809;&#26377;&#20026;&#21152;&#36895;&#36825;&#20123;&#28145;&#24230;&#23398;&#20064;&#27169;&#22411;&#30340;top-k&#25628;&#32034;&#36807;&#31243;&#19987;&#38376;&#35774;&#35745;&#30340;&#26377;&#25928;&#32034;&#24341;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20123;&#38382;&#39064;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#25216;&#26415;&#65292;&#36890;&#36807;&#23398;&#20064;&#20026;&#22238;&#31572;&#22522;&#20110;&#23884;&#20837;&#30340;&#31354;&#38388;&#20851;&#38190;&#35789;&#26597;&#35810;&#65288;&#31216;&#20026;LIST&#65289;&#24314;&#31435;&#31354;&#38388;&#25991;&#26412;&#25968;&#25454;&#32034;&#24341;&#12290;LIST&#20855;&#26377;&#20004;&#20010;&#26032;&#39062;&#32452;&#20214;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.07331v1 Announce Type: new  Abstract: With the proliferation of spatio-textual data, Top-k KNN spatial keyword queries (TkQs), which return a list of objects based on a ranking function that evaluates both spatial and textual relevance, have found many real-life applications. Existing geo-textual indexes for TkQs use traditional retrieval models like BM25 to compute text relevance and usually exploit a simple linear function to compute spatial relevance, but its effectiveness is limited. To improve effectiveness, several deep learning models have recently been proposed, but they suffer severe efficiency issues. To the best of our knowledge, there are no efficient indexes specifically designed to accelerate the top-k search process for these deep learning models.   To tackle these issues, we propose a novel technique, which Learns to Index the Spatio-Textual data for answering embedding based spatial keyword queries (called LIST). LIST is featured with two novel components. F
&lt;/p&gt;</description></item></channel></rss>