<rss version="2.0"><channel><title>Chat Arxiv cs.IR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.IR</description><item><title>&#35813;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#22522;&#20110;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#30340;&#29992;&#25143;&#25628;&#32034;&#34892;&#20026;&#27169;&#25311;&#22120; USimAgent&#65292;&#21487;&#20197;&#27169;&#25311;&#29992;&#25143;&#22312;&#25628;&#32034;&#36807;&#31243;&#20013;&#30340;&#26597;&#35810;&#12289;&#28857;&#20987;&#21644;&#20572;&#27490;&#34892;&#20026;&#65292;&#23454;&#29616;&#29983;&#25104;&#29305;&#23450;&#25628;&#32034;&#30340;&#23436;&#25972;&#25628;&#32034;&#20250;&#35805;&#12290;</title><link>https://arxiv.org/abs/2403.09142</link><description>&lt;p&gt;
USimAgent&#65306;&#29992;&#20110;&#27169;&#25311;&#25628;&#32034;&#29992;&#25143;&#30340;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
USimAgent: Large Language Models for Simulating Search Users
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.09142
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#22522;&#20110;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#30340;&#29992;&#25143;&#25628;&#32034;&#34892;&#20026;&#27169;&#25311;&#22120; USimAgent&#65292;&#21487;&#20197;&#27169;&#25311;&#29992;&#25143;&#22312;&#25628;&#32034;&#36807;&#31243;&#20013;&#30340;&#26597;&#35810;&#12289;&#28857;&#20987;&#21644;&#20572;&#27490;&#34892;&#20026;&#65292;&#23454;&#29616;&#29983;&#25104;&#29305;&#23450;&#25628;&#32034;&#30340;&#23436;&#25972;&#25628;&#32034;&#20250;&#35805;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#30001;&#20110;&#25104;&#26412;&#25928;&#30410;&#21644;&#21487;&#37325;&#29616;&#24615;&#26041;&#38754;&#30340;&#20248;&#21183;&#65292;&#29992;&#25143;&#27169;&#25311;&#24050;&#25104;&#20026;&#20449;&#24687;&#26816;&#32034;&#31995;&#32479;&#29992;&#25143;&#20026;&#20013;&#24515;&#35780;&#20272;&#30340;&#26377;&#21069;&#36884;&#30340;&#35299;&#20915;&#26041;&#26696;&#12290;&#28982;&#32780;&#65292;&#20934;&#30830;&#27169;&#25311;&#29992;&#25143;&#25628;&#32034;&#34892;&#20026;&#19968;&#30452;&#26159;&#19968;&#39033;&#25361;&#25112;&#65292;&#22240;&#20026;&#29992;&#25143;&#22312;&#25628;&#32034;&#20013;&#30340;&#34892;&#20026;&#38750;&#24120;&#22797;&#26434;&#65292;&#21463;&#21040;&#23398;&#20064;&#12289;&#25512;&#29702;&#21644;&#35268;&#21010;&#31561;&#38169;&#32508;&#22797;&#26434;&#35748;&#30693;&#36807;&#31243;&#30340;&#39537;&#21160;&#12290;&#26368;&#36817;&#65292;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLMs&#65289;&#24050;&#32463;&#23637;&#31034;&#20986;&#22312;&#27169;&#25311;&#20154;&#31867;&#32423;&#26234;&#33021;&#26041;&#38754;&#30340;&#28508;&#21147;&#65292;&#24182;&#24050;&#34987;&#29992;&#20110;&#26500;&#24314;&#21508;&#31181;&#20219;&#21153;&#30340;&#33258;&#20027;&#20195;&#29702;&#12290;&#28982;&#32780;&#65292;&#23578;&#26410;&#20805;&#20998;&#25506;&#32034;&#20351;&#29992;LLM&#27169;&#25311;&#25628;&#32034;&#34892;&#20026;&#30340;&#28508;&#21147;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#20171;&#32461;&#20102;&#19968;&#31181;&#22522;&#20110;LLM&#30340;&#29992;&#25143;&#25628;&#32034;&#34892;&#20026;&#27169;&#25311;&#22120;&#65292;&#21363;USimAgent&#12290;&#25552;&#20986;&#30340;&#27169;&#25311;&#22120;&#21487;&#20197;&#27169;&#25311;&#29992;&#25143;&#22312;&#25628;&#32034;&#36807;&#31243;&#20013;&#30340;&#26597;&#35810;&#12289;&#28857;&#20987;&#21644;&#20572;&#27490;&#34892;&#20026;&#65292;&#22240;&#27492;&#33021;&#22815;&#29983;&#25104;&#29305;&#23450;&#25628;&#32034;&#30340;&#23436;&#25972;&#25628;&#32034;&#20250;&#35805;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.09142v1 Announce Type: cross  Abstract: Due to the advantages in the cost-efficiency and reproducibility, user simulation has become a promising solution to the user-centric evaluation of information retrieval systems. Nonetheless, accurately simulating user search behaviors has long been a challenge, because users' actions in search are highly complex and driven by intricate cognitive processes such as learning, reasoning, and planning. Recently, Large Language Models (LLMs) have demonstrated remarked potential in simulating human-level intelligence and have been used in building autonomous agents for various tasks. However, the potential of using LLMs in simulating search behaviors has not yet been fully explored. In this paper, we introduce a LLM-based user search behavior simulator, USimAgent. The proposed simulator can simulate users' querying, clicking, and stopping behaviors during search, and thus, is capable of generating complete search sessions for specific search
&lt;/p&gt;</description></item></channel></rss>