<rss version="2.0"><channel><title>Chat Arxiv cs.IR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.IR</description><item><title>Covidia&#26159;&#19968;&#31181;COVID-19&#36328;&#23398;&#31185;&#23398;&#26415;&#30693;&#35782;&#22270;&#35889;&#65292;&#36890;&#36807;&#26377;&#25928;&#30340;&#35770;&#25991;&#20998;&#31867;&#21644;&#39640;&#25928;&#30340;&#36328;&#39046;&#22495;&#30693;&#35782;&#25552;&#21462;&#21644;&#25972;&#21512;&#65292;&#24357;&#21512;&#20102;&#19981;&#21516;&#39046;&#22495;&#23545;COVID-19&#30693;&#35782;&#30340;&#24046;&#36317;&#12290;</title><link>http://arxiv.org/abs/2304.07242</link><description>&lt;p&gt;
Covidia: COVID-19 &#36328;&#23398;&#31185;&#23398;&#26415;&#30693;&#35782;&#22270;&#35889;
&lt;/p&gt;
&lt;p&gt;
Covidia: COVID-19 Interdisciplinary Academic Knowledge Graph. (arXiv:2304.07242v1 [cs.IR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.07242
&lt;/p&gt;
&lt;p&gt;
Covidia&#26159;&#19968;&#31181;COVID-19&#36328;&#23398;&#31185;&#23398;&#26415;&#30693;&#35782;&#22270;&#35889;&#65292;&#36890;&#36807;&#26377;&#25928;&#30340;&#35770;&#25991;&#20998;&#31867;&#21644;&#39640;&#25928;&#30340;&#36328;&#39046;&#22495;&#30693;&#35782;&#25552;&#21462;&#21644;&#25972;&#21512;&#65292;&#24357;&#21512;&#20102;&#19981;&#21516;&#39046;&#22495;&#23545;COVID-19&#30693;&#35782;&#30340;&#24046;&#36317;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
COVID-19 &#30123;&#24773;&#28608;&#21457;&#20102;&#19981;&#21516;&#39046;&#22495;&#24191;&#27867;&#30340;&#30740;&#31350;&#24037;&#20316;&#12290;&#29616;&#26377;&#30340;COVID-19&#25991;&#29486;&#21644;&#30693;&#35782;&#24179;&#21488;&#21482;&#20851;&#27880;&#29983;&#29289;&#23398;&#21644;&#21307;&#23398;&#39046;&#22495;&#30340;&#35770;&#25991;&#25910;&#38598;&#65292;&#24573;&#30053;&#20102;&#36328;&#23398;&#31185;&#30340;&#21162;&#21147;&#65292;&#36825;&#22952;&#30861;&#20102;&#39046;&#22495;&#38388;&#30340;&#30693;&#35782;&#20849;&#20139;&#21644;&#30740;&#31350;&#21512;&#20316;&#20197;&#35299;&#20915;&#38382;&#39064;&#12290;&#30740;&#31350;&#36328;&#23398;&#31185;&#30740;&#31350;&#38656;&#35201;&#26377;&#25928;&#30340;&#35770;&#25991;&#20998;&#31867;&#21644;&#39640;&#25928;&#30340;&#36328;&#39046;&#22495;&#30693;&#35782;&#25552;&#21462;&#21644;&#25972;&#21512;&#12290;&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;Covidia&#65292;COVID-19&#36328;&#23398;&#31185;&#23398;&#26415;&#30693;&#35782;&#22270;&#35889;&#65292;&#20197;&#24357;&#21512;&#19981;&#21516;&#39046;&#22495;&#23545;COVID-19&#30693;&#35782;&#30340;&#24046;&#36317;&#12290;&#25105;&#20204;&#22522;&#20110;&#23545;&#27604;&#23398;&#20064;&#35774;&#35745;&#26694;&#26550;&#36827;&#34892;&#23398;&#31185;&#20998;&#31867;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#23398;&#26415;&#30693;&#35782;&#22270;&#35889;&#26041;&#26696;&#65292;&#29992;&#20110;&#20132;&#21449;&#39046;&#22495;&#30340;&#23454;&#20307;&#25552;&#21462;&#12289;&#20851;&#31995;&#20998;&#31867;&#21644;&#26412;&#20307;&#35770;&#31649;&#29702;&#12290;&#22522;&#20110;Covidia&#65292;&#25105;&#20204;&#36824;&#24314;&#31435;&#20102;&#21457;&#29616;COVID-19&#30740;&#31350;&#30340;&#30693;&#35782;&#21457;&#29616;&#22522;&#20934;&#12290;
&lt;/p&gt;
&lt;p&gt;
The pandemic of COVID-19 has inspired extensive works across different research fields. Existing literature and knowledge platforms on COVID-19 only focus on collecting papers on biology and medicine, neglecting the interdisciplinary efforts, which hurdles knowledge sharing and research collaborations between fields to address the problem. Studying interdisciplinary researches requires effective paper category classification and efficient cross-domain knowledge extraction and integration. In this work, we propose Covidia, COVID-19 interdisciplinary academic knowledge graph to bridge the gap between knowledge of COVID-19 on different domains. We design frameworks based on contrastive learning for disciplinary classification, and propose a new academic knowledge graph scheme for entity extraction, relation classification and ontology management in accordance with interdisciplinary researches. Based on Covidia, we also establish knowledge discovery benchmarks for finding COVID-19 research
&lt;/p&gt;</description></item><item><title>EvalRS 2023&#26088;&#22312;&#25506;&#35752;&#25512;&#33616;&#31995;&#32479;&#30340;&#20840;&#38754;&#35780;&#20272;&#65292;&#20851;&#27880;&#20854;&#22312;&#29616;&#23454;&#22330;&#26223;&#19979;&#30340;&#23454;&#38469;&#24433;&#21709;&#12290;&#36807;&#21435;&#21482;&#26377;&#20934;&#30830;&#24230;&#30340;&#27979;&#37327;&#26041;&#27861;&#21487;&#33021;&#26080;&#27861;&#20840;&#38754;&#35780;&#20272;&#20854;&#24615;&#33021;&#65292;&#20844;&#24179;&#24615;&#12289;&#20559;&#35265;&#12289;&#26377;&#29992;&#24615;&#21644;&#20449;&#24687;&#37327;&#31561;&#26041;&#38754;&#20063;&#24212;&#35813;&#34987;&#20851;&#27880;&#12290;&#26412;&#27425;&#30740;&#35752;&#20250;&#26159;&#21435;&#24180;CIKM&#30740;&#35752;&#20250;&#30340;&#32487;&#25215;&#21644;&#21457;&#23637;&#65292;&#24102;&#26377;&#23454;&#38469;&#25805;&#20316;&#24615;&#21644;&#20114;&#21160;&#24615;&#12290;</title><link>http://arxiv.org/abs/2304.07145</link><description>&lt;p&gt;
EvalRS 2023. &#38754;&#21521;&#23454;&#38469;&#24212;&#29992;&#30340;&#20840;&#38754;&#25512;&#33616;&#31995;&#32479;&#35780;&#20272;
&lt;/p&gt;
&lt;p&gt;
EvalRS 2023. Well-Rounded Recommender Systems For Real-World Deployments. (arXiv:2304.07145v1 [cs.IR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.07145
&lt;/p&gt;
&lt;p&gt;
EvalRS 2023&#26088;&#22312;&#25506;&#35752;&#25512;&#33616;&#31995;&#32479;&#30340;&#20840;&#38754;&#35780;&#20272;&#65292;&#20851;&#27880;&#20854;&#22312;&#29616;&#23454;&#22330;&#26223;&#19979;&#30340;&#23454;&#38469;&#24433;&#21709;&#12290;&#36807;&#21435;&#21482;&#26377;&#20934;&#30830;&#24230;&#30340;&#27979;&#37327;&#26041;&#27861;&#21487;&#33021;&#26080;&#27861;&#20840;&#38754;&#35780;&#20272;&#20854;&#24615;&#33021;&#65292;&#20844;&#24179;&#24615;&#12289;&#20559;&#35265;&#12289;&#26377;&#29992;&#24615;&#21644;&#20449;&#24687;&#37327;&#31561;&#26041;&#38754;&#20063;&#24212;&#35813;&#34987;&#20851;&#27880;&#12290;&#26412;&#27425;&#30740;&#35752;&#20250;&#26159;&#21435;&#24180;CIKM&#30740;&#35752;&#20250;&#30340;&#32487;&#25215;&#21644;&#21457;&#23637;&#65292;&#24102;&#26377;&#23454;&#38469;&#25805;&#20316;&#24615;&#21644;&#20114;&#21160;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
EvalRS&#26088;&#22312;&#27719;&#32858;&#20135;&#19994;&#21644;&#23398;&#26415;&#30028;&#30340;&#20174;&#19994;&#32773;&#65292;&#20419;&#36827;&#23545;&#25512;&#33616;&#31995;&#32479;&#30340;&#20840;&#38754;&#35780;&#20272;&#30340;&#35752;&#35770;&#65292;&#24182;&#37325;&#28857;&#20851;&#27880;&#22312;&#21508;&#31181;&#37096;&#32626;&#22330;&#26223;&#19979;&#30340;&#23454;&#38469;&#24433;&#21709;&#12290;&#25512;&#33616;&#31995;&#32479;&#36890;&#24120;&#21482;&#36890;&#36807;&#20934;&#30830;&#24615;&#25351;&#26631;&#36827;&#34892;&#35780;&#20272;&#65292;&#36825;&#20123;&#25351;&#26631;&#26080;&#27861;&#23436;&#20840;&#25551;&#36848;&#20854;&#27867;&#21270;&#33021;&#21147;&#24182;&#24573;&#35270;&#20102;&#37325;&#35201;&#30340;&#26041;&#38754;&#65292;&#22914;&#20844;&#24179;&#24615;&#12289;&#20559;&#35265;&#12289;&#26377;&#29992;&#24615;&#12289;&#20449;&#24687;&#37327;&#31561;&#12290;&#26412;&#27425;&#30740;&#35752;&#20250;&#22312;CIKM&#21435;&#24180;&#30740;&#35752;&#20250;&#30340;&#25104;&#21151;&#22522;&#30784;&#19978;&#36827;&#19968;&#27493;&#25193;&#22823;&#33539;&#22260;&#65292;&#24182;&#37319;&#21462;&#20114;&#21160;&#24418;&#24335;&#12290;
&lt;/p&gt;
&lt;p&gt;
EvalRS aims to bring together practitioners from industry and academia to foster a debate on rounded evaluation of recommender systems, with a focus on real-world impact across a multitude of deployment scenarios. Recommender systems are often evaluated only through accuracy metrics, which fall short of fully characterizing their generalization capabilities and miss important aspects, such as fairness, bias, usefulness, informativeness. This workshop builds on the success of last year's workshop at CIKM, but with a broader scope and an interactive format.
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#21517;&#20026;CONVSR&#30340;&#26694;&#26550;&#65292;&#21487;&#20197;&#22312;&#19981;&#24433;&#21709;&#23545;&#35805;&#24615;&#36136;&#30340;&#21516;&#26102;&#65292;&#20351;&#29992;&#32467;&#26500;&#21270;&#34920;&#31034;&#35299;&#20915;&#23545;&#35805;&#24335;&#38382;&#31572;&#20013;&#30340;&#20381;&#36182;&#20851;&#31995;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2304.07125</link><description>&lt;p&gt;
&#35753;&#38382;&#39064;&#26356;&#20855;&#23545;&#35805;&#24615;&#65306;&#20351;&#29992;&#32467;&#26500;&#21270;&#34920;&#31034;&#35299;&#20915;&#38382;&#31572;&#20013;&#30340;&#20381;&#36182;&#20851;&#31995;
&lt;/p&gt;
&lt;p&gt;
Keeping the Questions Conversational: Using Structured Representations to Resolve Dependency in Conversational Question Answering. (arXiv:2304.07125v1 [cs.CL])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.07125
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#21517;&#20026;CONVSR&#30340;&#26694;&#26550;&#65292;&#21487;&#20197;&#22312;&#19981;&#24433;&#21709;&#23545;&#35805;&#24615;&#36136;&#30340;&#21516;&#26102;&#65292;&#20351;&#29992;&#32467;&#26500;&#21270;&#34920;&#31034;&#35299;&#20915;&#23545;&#35805;&#24335;&#38382;&#31572;&#20013;&#30340;&#20381;&#36182;&#20851;&#31995;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25317;&#26377;&#19968;&#20010;&#33021;&#22815;&#21442;&#19982;&#23545;&#35805;&#24335;&#38382;&#31572;&#65288;ConvQA&#65289;&#30340;&#26234;&#33021;&#23545;&#35805;&#20195;&#29702;&#29616;&#22312;&#24050;&#19981;&#20165;&#20165;&#23616;&#38480;&#20110;&#31185;&#24187;&#30005;&#24433;&#65292;&#24182;&#19988;&#24050;&#32463;&#25104;&#20026;&#29616;&#23454;&#12290;&#36825;&#20123;&#26234;&#33021;&#20195;&#29702;&#38656;&#35201;&#29702;&#35299;&#21644;&#27491;&#30830;&#35299;&#37322;&#20316;&#20026;&#32473;&#23450;&#38382;&#39064;&#32972;&#26223;&#30340;&#39034;&#24207;&#36716;&#25442;&#12290;&#28982;&#32780;&#65292;&#36825;&#20123;&#39034;&#24207;&#30340;&#38382;&#39064;&#26377;&#26102;&#20250;&#34987;&#30041;&#19979;&#38544;&#21547;&#30340;&#65292;&#22240;&#27492;&#38656;&#35201;&#35299;&#20915;&#19968;&#20123;&#33258;&#28982;&#35821;&#35328;&#29616;&#35937;&#65292;&#20363;&#22914;&#25351;&#20195;&#21644;&#30465;&#30053;&#12290;&#23545;&#38382;&#39064;&#37325;&#20889;&#30340;&#20219;&#21153;&#26377;&#28508;&#21147;&#36890;&#36807;&#23558;&#23427;&#20204;&#36716;&#25442;&#25104;&#26126;&#30830;&#24847;&#22270;&#30340;&#38382;&#39064;&#26469;&#35299;&#20915;&#35299;&#20915;&#19978;&#19979;&#25991;&#36716;&#25442;&#20043;&#38388;&#20381;&#36182;&#20851;&#31995;&#30340;&#25361;&#25112;&#12290;&#28982;&#32780;&#65292;&#37325;&#20889;&#38544;&#24335;&#38382;&#39064;&#30340;&#35299;&#20915;&#26041;&#26696;&#23384;&#22312;&#19968;&#20123;&#28508;&#22312;&#30340;&#25361;&#25112;&#65292;&#20363;&#22914;&#29983;&#25104;&#20887;&#38271;&#30340;&#38382;&#39064;&#24182;&#36890;&#36807;&#29983;&#25104;&#33258;&#21253;&#21547;&#38382;&#39064;&#30340;&#26041;&#24335;&#20351;&#23545;&#35805;&#20013;&#30340;&#24773;&#22659;&#21066;&#24369;&#20102;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#26032;&#30340;&#26694;&#26550;CONVSR&#65288;&#20351;&#29992;&#32467;&#26500;&#21270;&#34920;&#31034;&#30340;CONVQA&#65289;&#12290;
&lt;/p&gt;
&lt;p&gt;
Having an intelligent dialogue agent that can engage in conversational question answering (ConvQA) is now no longer limited to Sci-Fi movies only and has, in fact, turned into a reality. These intelligent agents are required to understand and correctly interpret the sequential turns provided as the context of the given question. However, these sequential questions are sometimes left implicit and thus require the resolution of some natural language phenomena such as anaphora and ellipsis. The task of question rewriting has the potential to address the challenges of resolving dependencies amongst the contextual turns by transforming them into intent-explicit questions. Nonetheless, the solution of rewriting the implicit questions comes with some potential challenges such as resulting in verbose questions and taking conversational aspect out of the scenario by generating self-contained questions. In this paper, we propose a novel framework, CONVSR (CONVQA using Structured Representations)
&lt;/p&gt;</description></item><item><title>&#25552;&#20986;&#20102;&#19968;&#20010;&#21487;&#25193;&#23637;&#30340;&#23454;&#20307;&#23545;&#40784;&#31995;&#32479;SEA&#65292;&#23427;&#21253;&#25324;&#20102;&#20845;&#20010;&#26368;&#20808;&#36827;&#30340;EA&#27169;&#22411;&#24182;&#33021;&#22815;&#20351;&#29992;&#25143;&#36731;&#26494;&#24314;&#31435;&#12289;&#35780;&#20272;&#33258;&#24049;&#30340;&#27169;&#22411;&#65292;&#25552;&#39640;&#20102;&#22522;&#20110;GNN&#30340;EA&#27169;&#22411;&#22312;&#23454;&#38469;&#24212;&#29992;&#20013;&#30340;&#21487;&#29992;&#24615;&#21644;&#25928;&#29575;&#12290;</title><link>http://arxiv.org/abs/2304.07065</link><description>&lt;p&gt;
SEA: &#19968;&#20010;&#21487;&#25193;&#23637;&#23454;&#20307;&#23545;&#40784;&#31995;&#32479;
&lt;/p&gt;
&lt;p&gt;
SEA: A Scalable Entity Alignment System. (arXiv:2304.07065v1 [cs.CL])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.07065
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#20010;&#21487;&#25193;&#23637;&#30340;&#23454;&#20307;&#23545;&#40784;&#31995;&#32479;SEA&#65292;&#23427;&#21253;&#25324;&#20102;&#20845;&#20010;&#26368;&#20808;&#36827;&#30340;EA&#27169;&#22411;&#24182;&#33021;&#22815;&#20351;&#29992;&#25143;&#36731;&#26494;&#24314;&#31435;&#12289;&#35780;&#20272;&#33258;&#24049;&#30340;&#27169;&#22411;&#65292;&#25552;&#39640;&#20102;&#22522;&#20110;GNN&#30340;EA&#27169;&#22411;&#22312;&#23454;&#38469;&#24212;&#29992;&#20013;&#30340;&#21487;&#29992;&#24615;&#21644;&#25928;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#23454;&#20307;&#23545;&#40784;&#26088;&#22312;&#22312;&#19981;&#21516;&#30693;&#35782;&#22270;&#35889;&#20013;&#25214;&#21040;&#30456;&#24212;&#30340;&#23454;&#20307;&#12290;&#29616;&#26377;&#30340;&#23454;&#20307;&#23545;&#40784;&#26041;&#27861;&#36890;&#24120;&#20351;&#29992;&#22270;&#31070;&#32463;&#32593;&#32476;&#26469;&#32534;&#30721;&#23454;&#20307;&#12290;&#28982;&#32780;&#65292;&#22823;&#22810;&#25968;&#26041;&#27861;&#37117;&#26159;&#22312;&#20840;&#25209;&#37327;&#27169;&#24335;&#19979;&#35757;&#32451;&#27169;&#22411;&#21644;&#35780;&#20272;&#32467;&#26524;&#65292;&#36825;&#20351;&#24471;&#23454;&#20307;&#23545;&#40784;&#22312;&#22823;&#35268;&#27169;&#25968;&#25454;&#38598;&#19978;&#26080;&#27861;&#25193;&#23637;&#12290;&#20026;&#20102;&#22686;&#24378;&#22522;&#20110;&#22270;&#31070;&#32463;&#32593;&#32476;&#30340;&#23454;&#20307;&#23545;&#40784;&#27169;&#22411;&#22312;&#23454;&#38469;&#24212;&#29992;&#20013;&#30340;&#21487;&#29992;&#24615;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#21487;&#25193;&#23637;&#30340;&#23454;&#20307;&#23545;&#40784;&#31995;&#32479;SEA&#12290;&#23427;&#33021;&#22815;(i)&#35757;&#32451;&#22823;&#35268;&#27169;&#30340;&#22270;&#31070;&#32463;&#32593;&#32476;&#29992;&#20110;&#23454;&#20307;&#23545;&#40784;&#65292;(ii)&#21152;&#36895;&#24402;&#19968;&#21270;&#21644;&#35780;&#20272;&#36807;&#31243;&#65292;(iii)&#20026;&#29992;&#25143;&#25552;&#20379;&#28165;&#26224;&#30340;&#32467;&#26524;&#20197;&#20272;&#35745;&#19981;&#21516;&#30340;&#27169;&#22411;&#21644;&#21442;&#25968;&#35774;&#32622;&#12290;SEA&#21482;&#38656;&#35201;&#19968;&#20010;&#22270;&#24418;&#21345;&#23601;&#21487;&#20197;&#36816;&#34892;&#12290;&#27492;&#22806;&#65292;SEA&#21253;&#25324;&#20845;&#20010;&#26368;&#20808;&#36827;&#30340;&#23454;&#20307;&#23545;&#40784;&#27169;&#22411;&#65292;&#24182;&#20026;&#29992;&#25143;&#25552;&#20379;&#24555;&#36895;&#24314;&#31435;&#21644;&#35780;&#20272;&#33258;&#24049;&#27169;&#22411;&#30340;&#26041;&#27861;&#12290;&#22240;&#27492;&#65292;SEA&#20801;&#35768;&#29992;&#25143;&#22312;&#19981;&#28041;&#21450;&#22797;&#26434;&#23454;&#29616;&#30340;&#24773;&#20917;&#19979;&#25191;&#34892;&#23454;&#20307;&#23545;&#40784;&#65292;&#22914;&#36127;&#25277;&#26679;&#21644;GPU&#21152;&#36895;&#12290;
&lt;/p&gt;
&lt;p&gt;
Entity alignment (EA) aims to find equivalent entities in different knowledge graphs (KGs). State-of-the-art EA approaches generally use Graph Neural Networks (GNNs) to encode entities. However, most of them train the models and evaluate the results in a fullbatch fashion, which prohibits EA from being scalable on largescale datasets. To enhance the usability of GNN-based EA models in real-world applications, we present SEA, a scalable entity alignment system that enables to (i) train large-scale GNNs for EA, (ii) speed up the normalization and the evaluation process, and (iii) report clear results for users to estimate different models and parameter settings. SEA can be run on a computer with merely one graphic card. Moreover, SEA encompasses six state-of-the-art EA models and provides access for users to quickly establish and evaluate their own models. Thus, SEA allows users to perform EA without being involved in tedious implementations, such as negative sampling and GPU-accelerated
&lt;/p&gt;</description></item><item><title>&#25552;&#20986;&#20102;&#19968;&#20010;&#22522;&#20110;&#22270;ODE&#30340;&#36830;&#32493;&#26102;&#38388;&#24207;&#21015;&#25512;&#33616;&#26694;&#26550;GDERec&#65292;&#23427;&#36890;&#36807;&#36830;&#32493;&#26102;&#38388;&#22270;&#21367;&#31215;&#32593;&#32476;&#35299;&#20915;&#21327;&#20316;&#20449;&#21495;&#28436;&#21270;&#21644;&#19981;&#35268;&#21017;&#37319;&#26679;&#38382;&#39064;&#65292;&#24182;&#22312;&#22235;&#20010;&#30495;&#23454;&#25968;&#25454;&#38598;&#19978;&#21462;&#24471;&#26174;&#33879;&#20248;&#20110;&#29616;&#26377;&#26041;&#27861;&#30340;&#25928;&#26524;&#12290;</title><link>http://arxiv.org/abs/2304.07042</link><description>&lt;p&gt;
&#36830;&#32493;&#26102;&#38388;&#24207;&#21015;&#25512;&#33616;&#20013;&#30340;&#22270;ODE&#23398;&#20064;
&lt;/p&gt;
&lt;p&gt;
Learning Graph ODE for Continuous-Time Sequential Recommendation. (arXiv:2304.07042v1 [cs.IR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.07042
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#20010;&#22522;&#20110;&#22270;ODE&#30340;&#36830;&#32493;&#26102;&#38388;&#24207;&#21015;&#25512;&#33616;&#26694;&#26550;GDERec&#65292;&#23427;&#36890;&#36807;&#36830;&#32493;&#26102;&#38388;&#22270;&#21367;&#31215;&#32593;&#32476;&#35299;&#20915;&#21327;&#20316;&#20449;&#21495;&#28436;&#21270;&#21644;&#19981;&#35268;&#21017;&#37319;&#26679;&#38382;&#39064;&#65292;&#24182;&#22312;&#22235;&#20010;&#30495;&#23454;&#25968;&#25454;&#38598;&#19978;&#21462;&#24471;&#26174;&#33879;&#20248;&#20110;&#29616;&#26377;&#26041;&#27861;&#30340;&#25928;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36830;&#32493;&#26102;&#38388;&#24207;&#21015;&#25512;&#33616;&#26088;&#22312;&#36890;&#36807;&#25429;&#33719;&#29992;&#25143;&#36807;&#21435;&#20132;&#20114;&#20013;&#30340;&#39033;&#36141;&#20080;&#24207;&#21015;&#65292;&#29702;&#35299;&#29992;&#25143;&#30340;&#20559;&#22909;&#12290;&#29616;&#26377;&#26041;&#27861;&#36890;&#24120;&#36890;&#36807;&#24314;&#27169;&#39034;&#24207;&#27169;&#24335;&#26469;&#39044;&#27979;&#19979;&#19968;&#20010;&#39033;&#30446;&#12290;&#23613;&#31649;&#26377;&#25928;&#65292;&#28982;&#32780;&#23384;&#22312;&#20004;&#20010;&#22825;&#28982;&#19981;&#36275;&#65306;&#65288;i&#65289;&#29992;&#25143;&#20559;&#22909;&#20855;&#26377;&#21160;&#24577;&#24615;&#65292;&#24182;&#19988;&#32463;&#24120;&#24573;&#30053;&#21327;&#20316;&#20449;&#21495;&#30340;&#28436;&#21270;&#65307;&#65288;ii&#65289;&#35266;&#23519;&#21040;&#30340;&#20132;&#20114;&#36890;&#24120;&#26159;&#19981;&#35268;&#21017;&#37319;&#26679;&#30340;&#65292;&#32780;&#29616;&#26377;&#26041;&#27861;&#21017;&#20551;&#35774;&#22343;&#21248;&#38388;&#38548;&#26469;&#36827;&#34892;&#39033;&#30446;&#36716;&#25442;&#24314;&#27169;&#12290;&#22240;&#27492;&#65292;&#22914;&#20309;&#26377;&#25928;&#22320;&#23545;&#29992;&#25143;&#20559;&#22909;&#30340;&#22522;&#30784;&#21160;&#24577;&#24314;&#27169;&#21644;&#39044;&#27979;&#25104;&#20026;&#19968;&#20010;&#20851;&#38190;&#30340;&#30740;&#31350;&#38382;&#39064;&#12290;&#20026;&#20102;&#35299;&#20915;&#19978;&#36848;&#25361;&#25112;&#65292;&#26412;&#25991;&#20851;&#27880;&#20110;&#36830;&#32493;&#26102;&#38388;&#24207;&#21015;&#25512;&#33616;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#22270;&#27491;&#21017;&#24494;&#20998;&#26041;&#31243;&#65288;graph ordinary differential equation, GDERec&#65289;&#30340;&#36830;&#32493;&#26102;&#38388;&#24207;&#21015;&#25512;&#33616;&#26694;&#26550;&#12290;&#25216;&#26415;&#19978;&#65292;GDERec&#30001;&#19968;&#20010;&#33258;&#22238;&#24402;&#22270;&#27491;&#21017;&#24494;&#20998;&#26041;&#31243;&#32452;&#25104;&#65292;&#36890;&#36807;&#36830;&#32493;&#26102;&#38388;&#22270;&#21367;&#31215;&#32593;&#32476;&#26469;&#24314;&#27169;&#39033;&#36716;&#31227;&#21160;&#24577;&#12290;&#22312;&#22235;&#20010;&#30495;&#23454;&#25968;&#25454;&#38598;&#19978;&#30340;&#23454;&#35777;&#32467;&#26524;&#34920;&#26126;&#65292;GDERec&#26174;&#33879;&#20248;&#20110;&#29616;&#26377;&#26041;&#27861;&#65292;&#24182;&#25552;&#20379;&#20102;&#36830;&#32493;&#26102;&#38388;&#29992;&#25143;&#20559;&#22909;&#21160;&#24577;&#30340;&#21487;&#35299;&#37322;&#35265;&#35299;&#12290;
&lt;/p&gt;
&lt;p&gt;
Sequential recommendation aims at understanding user preference by capturing successive behavior correlations, which are usually represented as the item purchasing sequences based on their past interactions. Existing efforts generally predict the next item via modeling the sequential patterns. Despite effectiveness, there exist two natural deficiencies: (i) user preference is dynamic in nature, and the evolution of collaborative signals is often ignored; and (ii) the observed interactions are often irregularly-sampled, while existing methods model item transitions assuming uniform intervals. Thus, how to effectively model and predict the underlying dynamics for user preference becomes a critical research problem. To tackle the above challenges, in this paper, we focus on continuous-time sequential recommendation and propose a principled graph ordinary differential equation framework named GDERec. Technically, GDERec is characterized by an autoregressive graph ordinary differential equa
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#25193;&#25955;&#31639;&#27861;&#37319;&#26679;&#29992;&#25143;&#31354;&#38388;&#20559;&#22909;&#30340;POI&#25512;&#33616;&#27169;&#22411;&#65292;&#35299;&#20915;&#20102;&#29616;&#26377;&#26041;&#27861;&#21482;&#22522;&#20110;&#29992;&#25143;&#20808;&#21069;&#35775;&#38382;&#20301;&#32622;&#32858;&#21512;&#30340;&#32570;&#28857;&#65292;&#36866;&#29992;&#20110;&#25512;&#33616;&#26032;&#39062;&#21306;&#22495;&#30340;POI&#12290;</title><link>http://arxiv.org/abs/2304.07041</link><description>&lt;p&gt;
&#19968;&#31181;POI&#25512;&#33616;&#30340;&#25193;&#25955;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
A Diffusion model for POI recommendation. (arXiv:2304.07041v1 [cs.IR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.07041
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#25193;&#25955;&#31639;&#27861;&#37319;&#26679;&#29992;&#25143;&#31354;&#38388;&#20559;&#22909;&#30340;POI&#25512;&#33616;&#27169;&#22411;&#65292;&#35299;&#20915;&#20102;&#29616;&#26377;&#26041;&#27861;&#21482;&#22522;&#20110;&#29992;&#25143;&#20808;&#21069;&#35775;&#38382;&#20301;&#32622;&#32858;&#21512;&#30340;&#32570;&#28857;&#65292;&#36866;&#29992;&#20110;&#25512;&#33616;&#26032;&#39062;&#21306;&#22495;&#30340;POI&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#19979;&#19968;&#20010;&#20852;&#36259;&#28857;&#65288;POI&#65289;&#30340;&#25512;&#33616;&#26159;&#23450;&#20301;&#26381;&#21153;&#20013;&#30340;&#20851;&#38190;&#20219;&#21153;&#65292;&#26088;&#22312;&#20026;&#29992;&#25143;&#30340;&#19979;&#19968;&#20010;&#30446;&#30340;&#22320;&#25552;&#20379;&#20010;&#24615;&#21270;&#24314;&#35758;&#12290;&#20808;&#21069;&#20851;&#20110;POI&#25512;&#33616;&#30340;&#24037;&#20316;&#20391;&#37325;&#20110;&#23545;&#29992;&#25143;&#31354;&#38388;&#20559;&#22909;&#30340;&#24314;&#27169;&#12290;&#28982;&#32780;&#65292;&#29616;&#26377;&#30340;&#21033;&#29992;&#31354;&#38388;&#20449;&#24687;&#30340;&#26041;&#27861;&#20165;&#22522;&#20110;&#29992;&#25143;&#20808;&#21069;&#35775;&#38382;&#20301;&#32622;&#30340;&#32858;&#21512;&#65292;&#36825;&#20250;&#20351;&#27169;&#22411;&#19981;&#20250;&#25512;&#33616;&#26032;&#39062;&#21306;&#22495;&#30340;POI&#65292;&#20174;&#32780;&#25439;&#23475;&#20854;&#22312;&#35768;&#22810;&#24773;&#20917;&#19979;&#30340;&#24615;&#33021;&#12290;&#27492;&#22806;&#65292;&#23558;&#26102;&#38388;&#39034;&#24207;&#20449;&#24687;&#34701;&#20837;&#29992;&#25143;&#30340;&#31354;&#38388;&#20559;&#22909;&#20173;&#26159;&#19968;&#20010;&#25361;&#25112;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;Diff-POI&#65306;&#19968;&#31181;&#22522;&#20110;&#25193;&#25955;&#30340;&#27169;&#22411;&#65292;&#29992;&#20110;&#37319;&#26679;&#29992;&#25143;&#30340;&#31354;&#38388;&#20559;&#22909;&#65292;&#20197;&#36827;&#34892;&#19979;&#19968;&#27493;POI&#25512;&#33616;&#12290;&#22312;&#25193;&#25955;&#31639;&#27861;&#22312;&#20174;&#20998;&#24067;&#20013;&#36827;&#34892;&#37319;&#26679;&#26041;&#38754;&#30340;&#24191;&#27867;&#24212;&#29992;&#30340;&#21551;&#21457;&#19979;&#65292;Diff-POI&#20351;&#29992;&#20004;&#20010;&#37327;&#36523;&#23450;&#21046;&#30340;&#22270;&#32534;&#30721;&#27169;&#22359;&#23545;&#29992;&#25143;&#30340;&#35775;&#38382;&#24207;&#21015;&#21644;&#31354;&#38388;&#29305;&#24615;&#36827;&#34892;&#32534;&#30721;&#12290;
&lt;/p&gt;
&lt;p&gt;
Next Point-of-Interest (POI) recommendation is a critical task in location-based services that aim to provide personalized suggestions for the user's next destination. Previous works on POI recommendation have laid focused on modeling the user's spatial preference. However, existing works that leverage spatial information are only based on the aggregation of users' previous visited positions, which discourages the model from recommending POIs in novel areas. This trait of position-based methods will harm the model's performance in many situations. Additionally, incorporating sequential information into the user's spatial preference remains a challenge. In this paper, we propose Diff-POI: a Diffusion-based model that samples the user's spatial preference for the next POI recommendation. Inspired by the wide application of diffusion algorithm in sampling from distributions, Diff-POI encodes the user's visiting sequence and spatial character with two tailor-designed graph encoding modules
&lt;/p&gt;</description></item><item><title>WYTIWYR&#26694;&#26550;&#26159;&#19968;&#20010;&#22522;&#20110;&#22810;&#27169;&#24577;&#36755;&#20837;&#21644;&#29992;&#25143;&#24847;&#22270;&#24863;&#30693;&#30340;&#21487;&#35270;&#21270;&#26816;&#32034;&#24037;&#20855;&#65292;&#36890;&#36807;&#20998;&#20026;&#20004;&#38454;&#27573;&#8212;&#8212;&#35299;&#32806;&#35270;&#35273;&#23646;&#24615;&#21644;&#23884;&#20837;&#29992;&#25143;&#24847;&#22270;&#8212;&#8212;&#26469;&#23454;&#29616;&#22270;&#34920;&#30340;&#20010;&#24615;&#21270;&#26816;&#32034;&#12290;</title><link>http://arxiv.org/abs/2304.06991</link><description>&lt;p&gt;
WYTIWYR:&#19968;&#31181;&#22522;&#20110;&#22810;&#27169;&#24577;&#36755;&#20837;&#21644;&#29992;&#25143;&#24847;&#22270;&#24863;&#30693;&#30340;&#21487;&#35270;&#21270;&#26816;&#32034;&#26694;&#26550;
&lt;/p&gt;
&lt;p&gt;
WYTIWYR: A User Intent-Aware Framework with Multi-modal Inputs for Visualization Retrieval. (arXiv:2304.06991v1 [cs.IR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.06991
&lt;/p&gt;
&lt;p&gt;
WYTIWYR&#26694;&#26550;&#26159;&#19968;&#20010;&#22522;&#20110;&#22810;&#27169;&#24577;&#36755;&#20837;&#21644;&#29992;&#25143;&#24847;&#22270;&#24863;&#30693;&#30340;&#21487;&#35270;&#21270;&#26816;&#32034;&#24037;&#20855;&#65292;&#36890;&#36807;&#20998;&#20026;&#20004;&#38454;&#27573;&#8212;&#8212;&#35299;&#32806;&#35270;&#35273;&#23646;&#24615;&#21644;&#23884;&#20837;&#29992;&#25143;&#24847;&#22270;&#8212;&#8212;&#26469;&#23454;&#29616;&#22270;&#34920;&#30340;&#20010;&#24615;&#21270;&#26816;&#32034;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#22823;&#37327;&#35821;&#26009;&#24211;&#20013;&#26816;&#32034;&#22270;&#34920;&#26159;&#19968;&#39033;&#22522;&#26412;&#20219;&#21153;&#65292;&#21487;&#20197;&#24800;&#21450;&#20247;&#22810;&#24212;&#29992;&#65292;&#22914;&#21487;&#35270;&#21270;&#25512;&#33616;&#12290;&#26816;&#32034;&#32467;&#26524;&#24212;&#31526;&#21512;&#26174;&#24335;&#30340;&#35270;&#35273;&#23646;&#24615;&#65288;&#20363;&#22914;&#22270;&#34920;&#31867;&#22411;&#12289;&#33394;&#22270;&#65289;&#21644;&#38544;&#21547;&#30340;&#29992;&#25143;&#24847;&#22270;&#65288;&#20363;&#22914;&#35774;&#35745;&#39118;&#26684;&#12289;&#19978;&#19979;&#25991;&#20449;&#24687;&#65289;&#65292;&#36825;&#20123;&#24847;&#22270;&#26681;&#25454;&#24212;&#29992;&#22330;&#26223;&#32780;&#24322;&#12290;&#28982;&#32780;&#65292;&#29616;&#26377;&#30340;&#22522;&#20110;&#31034;&#20363;&#30340;&#22270;&#34920;&#26816;&#32034;&#26041;&#27861;&#26159;&#24314;&#31435;&#22312;&#38590;&#20197;&#35299;&#37322;&#30340;&#38750;&#35299;&#32806;&#21512;&#21644;&#20302;&#32423;&#21035;&#35270;&#35273;&#29305;&#24449;&#19978;&#30340;&#65292;&#32780;&#22522;&#20110;&#23450;&#20041;&#30340;&#26041;&#27861;&#21463;&#21040;&#39044;&#23450;&#20041;&#23646;&#24615;&#30340;&#38480;&#21046;&#65292;&#38590;&#20197;&#25193;&#23637;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#26694;&#26550;&#65292;&#21363;WYTIWYR&#65288;What-You-Think-Is-What-You-Retrieve&#65289;&#65292;&#23558;&#29992;&#25143;&#24847;&#22270;&#25972;&#21512;&#21040;&#22270;&#34920;&#26816;&#32034;&#36807;&#31243;&#20013;&#12290;&#35813;&#26694;&#26550;&#20998;&#20026;&#20004;&#20010;&#38454;&#27573;&#65306;&#39318;&#20808;&#65292;&#27880;&#37322;&#38454;&#27573;&#23558;&#20301;&#22270;&#26597;&#35810;&#22270;&#34920;&#20013;&#30340;&#35270;&#35273;&#23646;&#24615;&#36827;&#34892;&#35299;&#32806;&#65307;&#20854;&#27425;&#65292;&#26816;&#32034;&#38454;&#27573;&#36890;&#36807;&#23450;&#21046;&#30340;&#25991;&#26412;&#25552;&#31034;&#21644;&#26597;&#35810;&#22270;&#34920;&#23884;&#20837;&#29992;&#25143;&#30340;&#24847;&#22270;&#65292;&#20197;&#25552;&#21462;&#22270;&#34920;&#12290;
&lt;/p&gt;
&lt;p&gt;
Retrieving charts from a large corpus is a fundamental task that can benefit numerous applications such as visualization recommendations.The retrieved results are expected to conform to both explicit visual attributes (e.g., chart type, colormap) and implicit user intents (e.g., design style, context information) that vary upon application scenarios. However, existing example-based chart retrieval methods are built upon non-decoupled and low-level visual features that are hard to interpret, while definition-based ones are constrained to pre-defined attributes that are hard to extend. In this work, we propose a new framework, namely WYTIWYR (What-You-Think-Is-What-You-Retrieve), that integrates user intents into the chart retrieval process. The framework consists of two stages: first, the Annotation stage disentangles the visual attributes within the bitmap query chart; and second, the Retrieval stage embeds the user's intent with customized text prompt as well as query chart, to recall
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#29992;&#20110;&#22823;&#35268;&#27169;&#25512;&#33616;&#31995;&#32479;&#30340;&#25506;&#32034;&#26694;&#26550;&#65292;&#21253;&#25324;&#29992;&#25143;-&#21019;&#24314;&#32773;&#25506;&#32034;&#12289;&#22312;&#32447;&#25506;&#32034;&#26694;&#26550;&#21644;&#21453;&#39304;&#32452;&#25104;&#26426;&#21046;&#65292;&#20197;&#35299;&#20915;&#25512;&#33616;&#31995;&#32479;&#20013;&#27969;&#34892;&#20869;&#23481;&#30340;&#38480;&#21046;&#21644;&#26080;&#27861;&#31995;&#32479;&#25506;&#32034;&#29992;&#25143;&#20852;&#36259;&#30340;&#25361;&#25112;&#65292;&#20174;&#32780;&#25552;&#39640;&#25512;&#33616;&#30340;&#25972;&#20307;&#36136;&#37327;&#21644;&#35757;&#32451;&#25968;&#25454;&#30340;&#26377;&#25928;&#24615;&#12290;</title><link>http://arxiv.org/abs/2304.06844</link><description>&lt;p&gt;
PIE: &#38024;&#23545;&#22823;&#35268;&#27169;&#25512;&#33616;&#31995;&#32479;&#30340;&#20010;&#24615;&#21270;&#20852;&#36259;&#25506;&#32034;
&lt;/p&gt;
&lt;p&gt;
PIE: Personalized Interest Exploration for Large-Scale Recommender Systems. (arXiv:2304.06844v1 [cs.IR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.06844
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#29992;&#20110;&#22823;&#35268;&#27169;&#25512;&#33616;&#31995;&#32479;&#30340;&#25506;&#32034;&#26694;&#26550;&#65292;&#21253;&#25324;&#29992;&#25143;-&#21019;&#24314;&#32773;&#25506;&#32034;&#12289;&#22312;&#32447;&#25506;&#32034;&#26694;&#26550;&#21644;&#21453;&#39304;&#32452;&#25104;&#26426;&#21046;&#65292;&#20197;&#35299;&#20915;&#25512;&#33616;&#31995;&#32479;&#20013;&#27969;&#34892;&#20869;&#23481;&#30340;&#38480;&#21046;&#21644;&#26080;&#27861;&#31995;&#32479;&#25506;&#32034;&#29992;&#25143;&#20852;&#36259;&#30340;&#25361;&#25112;&#65292;&#20174;&#32780;&#25552;&#39640;&#25512;&#33616;&#30340;&#25972;&#20307;&#36136;&#37327;&#21644;&#35757;&#32451;&#25968;&#25454;&#30340;&#26377;&#25928;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25512;&#33616;&#31995;&#32479;&#36234;&#26469;&#36234;&#25104;&#21151;&#22320;&#21521;&#29992;&#25143;&#25512;&#33616;&#20010;&#24615;&#21270;&#20869;&#23481;&#12290;&#28982;&#32780;&#65292;&#36825;&#20123;&#31995;&#32479;&#24120;&#24120;&#21033;&#29992;&#28909;&#38376;&#20869;&#23481;&#65292;&#19988;&#29992;&#25143;&#20852;&#36259;&#30340;&#25345;&#32493;&#28436;&#36827;&#38656;&#35201;&#34987;&#25429;&#25417;&#65292;&#20294;&#27809;&#26377;&#30452;&#25509;&#30340;&#26041;&#24335;&#26469;&#31995;&#32479;&#24615;&#22320;&#25506;&#32034;&#29992;&#25143;&#30340;&#20852;&#36259;&#12290;&#36825;&#20063;&#32463;&#24120;&#24433;&#21709;&#21040;&#25512;&#33616;&#31995;&#32479;&#30340;&#25972;&#20307;&#36136;&#37327;&#65292;&#22240;&#20026;&#35757;&#32451;&#25968;&#25454;&#26159;&#20174;&#25512;&#33616;&#32473;&#29992;&#25143;&#30340;&#20505;&#36873;&#39033;&#20013;&#29983;&#25104;&#30340;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#20110;&#22823;&#35268;&#27169;&#25512;&#33616;&#31995;&#32479;&#20013;&#30340;&#25506;&#32034;&#26694;&#26550;&#26469;&#35299;&#20915;&#36825;&#20123;&#25361;&#25112;&#12290;&#23427;&#30001;&#19977;&#20010;&#37096;&#20998;&#32452;&#25104;&#65306;&#31532;&#19968;&#37096;&#20998;&#26159;&#29992;&#25143;&#21019;&#24314;&#32773;&#25506;&#32034;&#65292;&#19987;&#27880;&#20110;&#35782;&#21035;&#29992;&#25143;&#24863;&#20852;&#36259;&#30340;&#26368;&#20339;&#21019;&#24314;&#32773;&#65292;&#31532;&#20108;&#37096;&#20998;&#26159;&#22312;&#32447;&#25506;&#32034;&#26694;&#26550;&#65292;&#31532;&#19977;&#37096;&#20998;&#26159;&#19968;&#20010;&#24179;&#34913;&#25506;&#32034;&#19982;&#21033;&#29992;&#30340;&#21453;&#39304;&#32452;&#25104;&#26426;&#21046;&#65292;&#20197;&#30830;&#20445;&#25506;&#32034;&#24615;&#35270;&#39057;&#30340;&#26368;&#20339;&#26222;&#21450;&#29575;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#21487;&#20197;&#24456;&#23481;&#26131;&#22320;&#34987;&#38598;&#25104;&#21040;&#29616;&#26377;&#30340;&#22823;&#35268;&#27169;&#25512;&#33616;&#31995;&#32479;&#20013;&#65292;&#21482;&#38656;&#36827;&#34892;&#26368;&#23567;&#38480;&#24230;&#30340;&#20462;&#25913;&#12290;
&lt;/p&gt;
&lt;p&gt;
Recommender systems are increasingly successful in recommending personalized content to users. However, these systems often capitalize on popular content. There is also a continuous evolution of user interests that need to be captured, but there is no direct way to systematically explore users' interests. This also tends to affect the overall quality of the recommendation pipeline as training data is generated from the candidates presented to the user. In this paper, we present a framework for exploration in large-scale recommender systems to address these challenges. It consists of three parts, first the user-creator exploration which focuses on identifying the best creators that users are interested in, second the online exploration framework and third a feed composition mechanism that balances explore and exploit to ensure optimal prevalence of exploratory videos. Our methodology can be easily integrated into an existing large-scale recommender system with minimal modifications. We 
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;&#8220;&#26080;&#20559;&#25104;&#23545;&#23398;&#20064;&#65288;NPLwVC&#65289;&#8221;&#30340;&#26032;&#26694;&#26550;&#65292;&#35299;&#20915;&#20102;&#25512;&#33616;&#31995;&#32479;&#20013;&#38544;&#24335;&#21453;&#39304;&#25968;&#25454;&#30340;&#20559;&#20272;&#38382;&#39064;&#65292;&#23454;&#39564;&#32467;&#26524;&#34920;&#26126;&#20854;&#22312;&#20004;&#20010;&#20844;&#20849;&#25968;&#25454;&#38598;&#19978;&#34920;&#29616;&#20248;&#20110;&#29616;&#26377;&#26368;&#20808;&#36827;&#26041;&#27861;&#12290;</title><link>http://arxiv.org/abs/2304.05066</link><description>&lt;p&gt;
&#38754;&#21521;&#25512;&#33616;&#31995;&#32479;&#30340;&#26080;&#20559;&#25104;&#23545;&#23398;&#20064;&#31639;&#27861;
&lt;/p&gt;
&lt;p&gt;
Unbiased Pairwise Learning from Implicit Feedback for Recommender Systems without Biased Variance Control. (arXiv:2304.05066v1 [cs.IR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.05066
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;&#8220;&#26080;&#20559;&#25104;&#23545;&#23398;&#20064;&#65288;NPLwVC&#65289;&#8221;&#30340;&#26032;&#26694;&#26550;&#65292;&#35299;&#20915;&#20102;&#25512;&#33616;&#31995;&#32479;&#20013;&#38544;&#24335;&#21453;&#39304;&#25968;&#25454;&#30340;&#20559;&#20272;&#38382;&#39064;&#65292;&#23454;&#39564;&#32467;&#26524;&#34920;&#26126;&#20854;&#22312;&#20004;&#20010;&#20844;&#20849;&#25968;&#25454;&#38598;&#19978;&#34920;&#29616;&#20248;&#20110;&#29616;&#26377;&#26368;&#20808;&#36827;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25512;&#33616;&#31995;&#32479;&#30340;&#27169;&#22411;&#35757;&#32451;&#19968;&#33324;&#22522;&#20110;&#26174;&#24335;&#21453;&#39304;&#21644;&#38544;&#24335;&#21453;&#39304;&#20004;&#31181;&#25968;&#25454;&#12290;&#38544;&#24335;&#21453;&#39304;&#25968;&#25454;&#20013;&#20165;&#21253;&#21547;&#27491;&#21453;&#39304;&#65292;&#22240;&#27492;&#24456;&#38590;&#21028;&#26029;&#26410;&#20114;&#21160;&#39033;&#21040;&#24213;&#26159;&#36127;&#21453;&#39304;&#36824;&#26159;&#26410;&#26333;&#20809;&#12290;&#21516;&#26102;&#65292;&#31232;&#26377;&#29289;&#21697;&#30340;&#30456;&#20851;&#24615;&#24448;&#24448;&#34987;&#20302;&#20272;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20123;&#38382;&#39064;&#65292;&#20808;&#21069;&#25552;&#20986;&#20102;&#26080;&#20559;&#25104;&#23545;&#23398;&#20064;&#31639;&#27861;&#65292;&#20294;&#23384;&#22312;&#20559;&#24046;&#26041;&#24046;&#25511;&#21046;&#38382;&#39064;&#12290;&#26412;&#25991;&#25552;&#20986;&#19968;&#31181;&#21517;&#20026;&#8220;&#26080;&#20559;&#25104;&#23545;&#23398;&#20064;&#65288;NPLwVC&#65289;&#8221;&#30340;&#26032;&#26694;&#26550;&#65292;&#19981;&#38656;&#35201;&#20559;&#24046;&#26041;&#24046;&#25511;&#21046;&#39033;&#65292;&#20174;&#32780;&#31616;&#21270;&#31639;&#27861;&#12290;&#20004;&#20010;&#20844;&#20849;&#25968;&#25454;&#38598;&#30340;&#23454;&#39564;&#32467;&#26524;&#34920;&#26126;&#65292;NPLwVC&#22312;&#20445;&#25345;&#26080;&#20559;&#24615;&#30340;&#21516;&#26102;&#26174;&#33879;&#20248;&#20110;&#29616;&#26377;&#26368;&#20808;&#36827;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
Generally speaking, the model training for recommender systems can be based on two types of data, namely explicit feedback and implicit feedback. Moreover, because of its general availability, we see wide adoption of implicit feedback data, such as click signal. There are mainly two challenges for the application of implicit feedback. First, implicit data just includes positive feedback. Therefore, we are not sure whether the non-interacted items are really negative or positive but not displayed to the corresponding user. Moreover, the relevance of rare items is usually underestimated since much fewer positive feedback of rare items is collected compared with popular ones. To tackle such difficulties, both pointwise and pairwise solutions are proposed before for unbiased relevance learning. As pairwise learning suits well for the ranking tasks, the previously proposed unbiased pairwise learning algorithm already achieves state-of-the-art performance. Nonetheless, the existing unbiased 
&lt;/p&gt;</description></item><item><title>&#25512;&#33616;&#31995;&#32479;&#20013;&#65292;&#20351;&#29992;&#21807;&#19968;&#26631;&#35782;&#30340;IDRec&#27169;&#22411;&#30456;&#27604;&#20351;&#29992;&#27169;&#24577;&#30340;MoRec&#27169;&#22411;&#22312;&#25512;&#33616;&#20934;&#30830;&#24615;&#21644;&#25928;&#29575;&#19978;&#34920;&#29616;&#26356;&#22909;&#65292;&#28982;&#32780;&#65292;&#38656;&#35201;&#26681;&#25454;&#20855;&#20307;&#24773;&#20917;&#36873;&#25321;&#36866;&#21512;&#30340;&#25512;&#33616;&#27169;&#22411;&#12290;</title><link>http://arxiv.org/abs/2303.13835</link><description>&lt;p&gt;
&#25512;&#33616;&#31995;&#32479;&#20309;&#21435;&#20309;&#20174;&#65311;ID- vs. &#22522;&#20110;&#27169;&#24577;&#30340;&#25512;&#33616;&#27169;&#22411;&#20877;&#25506;&#35752;
&lt;/p&gt;
&lt;p&gt;
Where to Go Next for Recommender Systems? ID- vs. Modality-based recommender models revisited. (arXiv:2303.13835v1 [cs.IR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.13835
&lt;/p&gt;
&lt;p&gt;
&#25512;&#33616;&#31995;&#32479;&#20013;&#65292;&#20351;&#29992;&#21807;&#19968;&#26631;&#35782;&#30340;IDRec&#27169;&#22411;&#30456;&#27604;&#20351;&#29992;&#27169;&#24577;&#30340;MoRec&#27169;&#22411;&#22312;&#25512;&#33616;&#20934;&#30830;&#24615;&#21644;&#25928;&#29575;&#19978;&#34920;&#29616;&#26356;&#22909;&#65292;&#28982;&#32780;&#65292;&#38656;&#35201;&#26681;&#25454;&#20855;&#20307;&#24773;&#20917;&#36873;&#25321;&#36866;&#21512;&#30340;&#25512;&#33616;&#27169;&#22411;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36807;&#21435;&#21313;&#24180;&#65292;&#21033;&#29992;&#21807;&#19968;&#26631;&#35782;&#65288;ID&#65289;&#26469;&#34920;&#31034;&#19981;&#21516;&#29992;&#25143;&#21644;&#29289;&#21697;&#30340;&#25512;&#33616;&#27169;&#22411;&#19968;&#30452;&#26159;&#26368;&#20808;&#36827;&#30340;&#65292;&#24182;&#19988;&#22312;&#25512;&#33616;&#31995;&#32479;&#25991;&#29486;&#20013;&#21344;&#20027;&#23548;&#22320;&#20301;&#12290;&#19982;&#27492;&#21516;&#26102;&#65292;&#39044;&#35757;&#32451;&#27169;&#24577;&#32534;&#30721;&#22120;&#65288;&#22914;BERT&#21644;ViT&#65289;&#22312;&#23545;&#29289;&#21697;&#30340;&#21407;&#22987;&#27169;&#24577;&#29305;&#24449;&#65288;&#22914;&#25991;&#26412;&#21644;&#22270;&#20687;&#65289;&#36827;&#34892;&#24314;&#27169;&#26041;&#38754;&#21464;&#24471;&#36234;&#26469;&#36234;&#24378;&#22823;&#12290;&#22240;&#27492;&#65292;&#33258;&#28982;&#32780;&#28982;&#30340;&#38382;&#39064;&#26159;&#65306;&#36890;&#36807;&#29992;&#26368;&#20808;&#36827;&#30340;&#27169;&#24577;&#32534;&#30721;&#22120;&#26367;&#25442;&#29289;&#21697;ID&#23884;&#20837;&#21521;&#37327;&#65292;&#19968;&#20010;&#32431;&#31929;&#30340;&#22522;&#20110;&#27169;&#24577;&#30340;&#25512;&#33616;&#27169;&#22411;&#65288;MoRec&#65289;&#33021;&#21542;&#32988;&#36807;&#25110;&#19982;&#32431;ID&#22522;&#30784;&#27169;&#22411;&#65288;IDRec&#65289;&#30456;&#21305;&#37197;&#65311;&#23454;&#38469;&#19978;&#65292;&#26089;&#22312;&#21313;&#24180;&#21069;&#65292;&#36825;&#20010;&#38382;&#39064;&#23601;&#34987;&#22238;&#31572;&#20102;&#65292;IDRec&#22312;&#25512;&#33616;&#20934;&#30830;&#24615;&#21644;&#25928;&#29575;&#26041;&#38754;&#37117;&#36828;&#36828;&#32988;&#36807;MoRec&#12290;&#25105;&#20204;&#26088;&#22312;&#37325;&#26032;&#23457;&#35270;&#36825;&#20010;&#8220;&#32769;&#38382;&#39064;&#8221;&#65292;&#20174;&#22810;&#20010;&#26041;&#38754;&#23545;MoRec&#36827;&#34892;&#31995;&#32479;&#30740;&#31350;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#20960;&#20010;&#23376;&#38382;&#39064;&#65306;&#65288;i&#65289;&#22312;&#23454;&#38469;&#22330;&#26223;&#20013;&#65292;MoRec&#25110;IDRec&#21738;&#20010;&#25512;&#33616;&#27169;&#24335;&#34920;&#29616;&#26356;&#22909;&#65292;&#29305;&#21035;&#26159;&#22312;&#19968;&#33324;&#24773;&#20917;&#21644;......
&lt;/p&gt;
&lt;p&gt;
Recommendation models that utilize unique identities (IDs) to represent distinct users and items have been state-of-the-art (SOTA) and dominated the recommender systems (RS) literature for over a decade. Meanwhile, the pre-trained modality encoders, such as BERT and ViT, have become increasingly powerful in modeling the raw modality features of an item, such as text and images. Given this, a natural question arises: can a purely modality-based recommendation model (MoRec) outperforms or matches a pure ID-based model (IDRec) by replacing the itemID embedding with a SOTA modality encoder? In fact, this question was answered ten years ago when IDRec beats MoRec by a strong margin in both recommendation accuracy and efficiency. We aim to revisit this `old' question and systematically study MoRec from several aspects. Specifically, we study several sub-questions: (i) which recommendation paradigm, MoRec or IDRec, performs better in practical scenarios, especially in the general setting and 
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#20171;&#32461;&#20102;TwERC&#26041;&#27861;&#65292;&#29992;&#20110;&#35299;&#20915;Twitter&#24191;&#21578;&#25512;&#33616;&#30340;&#20505;&#36873;&#29983;&#25104;&#38382;&#39064;&#12290;&#35813;&#26041;&#27861;&#32467;&#21512;&#20102;&#23454;&#26102;&#36731;&#22411;&#25490;&#21517;&#22120;&#21644;&#25968;&#25454;&#26469;&#28304;&#31574;&#30053;&#65292;&#25104;&#21151;&#25552;&#39640;&#20102;&#25512;&#33616;&#31995;&#32479;&#30340;&#24615;&#33021;&#21644;&#25910;&#20837;&#12290;&#20854;&#20013;&#65292;&#22522;&#20110;&#30456;&#20114;&#20316;&#29992;&#22270;&#21644;&#25490;&#21517;&#20998;&#25968;&#32531;&#23384;&#30340;&#20004;&#31181;&#31574;&#30053;&#20114;&#34917;&#24212;&#29992;&#65292;&#20998;&#21035;&#23454;&#29616;&#20102;4.08%&#21644;1.38%&#30340;&#22686;&#30410;&#12290;</title><link>http://arxiv.org/abs/2302.13915</link><description>&lt;p&gt;
TwERC: Twitter&#24191;&#21578;&#25512;&#33616;&#39640;&#24615;&#33021;&#38598;&#25104;&#24335;&#20505;&#36873;&#29983;&#25104;
&lt;/p&gt;
&lt;p&gt;
TwERC: High Performance Ensembled Candidate Generation for Ads Recommendation at Twitter. (arXiv:2302.13915v2 [cs.IR] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2302.13915
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;TwERC&#26041;&#27861;&#65292;&#29992;&#20110;&#35299;&#20915;Twitter&#24191;&#21578;&#25512;&#33616;&#30340;&#20505;&#36873;&#29983;&#25104;&#38382;&#39064;&#12290;&#35813;&#26041;&#27861;&#32467;&#21512;&#20102;&#23454;&#26102;&#36731;&#22411;&#25490;&#21517;&#22120;&#21644;&#25968;&#25454;&#26469;&#28304;&#31574;&#30053;&#65292;&#25104;&#21151;&#25552;&#39640;&#20102;&#25512;&#33616;&#31995;&#32479;&#30340;&#24615;&#33021;&#21644;&#25910;&#20837;&#12290;&#20854;&#20013;&#65292;&#22522;&#20110;&#30456;&#20114;&#20316;&#29992;&#22270;&#21644;&#25490;&#21517;&#20998;&#25968;&#32531;&#23384;&#30340;&#20004;&#31181;&#31574;&#30053;&#20114;&#34917;&#24212;&#29992;&#65292;&#20998;&#21035;&#23454;&#29616;&#20102;4.08%&#21644;1.38%&#30340;&#22686;&#30410;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25512;&#33616;&#31995;&#32479;&#26159;&#31038;&#20132;&#23186;&#20307;&#20844;&#21496;&#30340;&#26680;&#24515;&#21151;&#33021;&#65292;&#21253;&#25324;&#26377;&#26426;&#21644;&#25512;&#24191;&#20869;&#23481;&#25512;&#33616;&#12290;&#29616;&#20195;&#25512;&#33616;&#31995;&#32479;&#36890;&#24120;&#20998;&#20026;&#22810;&#20010;&#38454;&#27573;&#65292;&#21363;&#20505;&#36873;&#29983;&#25104;&#21644;&#37325;&#25490;&#24207;&#65292;&#20197;&#24179;&#34913;&#35745;&#31639;&#25104;&#26412;&#21644;&#25512;&#33616;&#36136;&#37327;&#12290;&#26412;&#25991;&#32858;&#28966;&#20110;&#22823;&#35268;&#27169;&#24191;&#21578;&#25512;&#33616;&#38382;&#39064;&#20013;&#30340;&#20505;&#36873;&#29983;&#25104;&#38454;&#27573;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#26426;&#22120;&#23398;&#20064;&#20026;&#20808;&#30340;&#24322;&#26500;&#37325;&#26500;&#26041;&#27861;&#65292;&#31216;&#20026;TwERC&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#19968;&#20010;&#23558;&#23454;&#26102;&#36731;&#22411;&#25490;&#21517;&#22120;&#19982;&#33021;&#22815;&#25429;&#33719;&#39069;&#22806;&#20449;&#24687;&#30340;&#25968;&#25454;&#26469;&#28304;&#31574;&#30053;&#30456;&#32467;&#21512;&#30340;&#31995;&#32479;&#65292;&#21487;&#20197;&#25552;&#20379;&#39564;&#35777;&#22686;&#30410;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#20004;&#31181;&#31574;&#30053;&#12290;&#31532;&#19968;&#20010;&#31574;&#30053;&#20351;&#29992;&#30456;&#20114;&#20316;&#29992;&#22270;&#20013;&#30340;&#30456;&#20284;&#24615;&#27010;&#24565;&#65292;&#32780;&#31532;&#20108;&#20010;&#31574;&#30053;&#32531;&#23384;&#25490;&#21517;&#38454;&#27573;&#30340;&#20808;&#21069;&#24471;&#20998;&#12290;&#22522;&#20110;&#22270;&#24418;&#30340;&#31574;&#30053;&#23454;&#29616;&#20102;4.08%&#30340;&#25910;&#20837;&#22686;&#30410;&#65292;&#32780;&#22522;&#20110;&#25490;&#21517;&#20998;&#25968;&#30340;&#31574;&#30053;&#23454;&#29616;&#20102;1.38%&#30340;&#22686;&#30410;&#12290;&#36825;&#20004;&#31181;&#31574;&#30053;&#20855;&#26377;&#20114;&#34917;&#20559;&#24046;&#12290;
&lt;/p&gt;
&lt;p&gt;
Recommendation systems are a core feature of social media companies with their uses including recommending organic and promoted contents. Many modern recommendation systems are split into multiple stages - candidate generation and heavy ranking - to balance computational cost against recommendation quality. We focus on the candidate generation phase of a large-scale ads recommendation problem in this paper, and present a machine learning first heterogeneous re-architecture of this stage which we term TwERC. We show that a system that combines a real-time light ranker with sourcing strategies capable of capturing additional information provides validated gains. We present two strategies. The first strategy uses a notion of similarity in the interaction graph, while the second strategy caches previous scores from the ranking stage. The graph based strategy achieves a 4.08% revenue gain and the rankscore based strategy achieves a 1.38% gain. These two strategies have biases that complemen
&lt;/p&gt;</description></item><item><title>&#36825;&#20010;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#20010;&#26032;&#30340;&#38463;&#27931;&#26222;&#22827;&#27861;&#35821;&#38382;&#31572;&#25968;&#25454;&#38598;&#65292;&#25910;&#38598;&#20102;&#26469;&#33258;10,368&#21517;&#23398;&#29983;&#30340;29,349&#20010;&#38382;&#39064;&#21644;&#35299;&#37322;&#65292;&#24182;&#23637;&#31034;&#20102;&#22312;&#20449;&#24687;&#26816;&#32034;&#20219;&#21153;&#20013;&#20351;&#29992;&#35813;&#25968;&#25454;&#38598;&#30340;&#26696;&#20363;&#30740;&#31350;&#12290;</title><link>http://arxiv.org/abs/2302.07738</link><description>&lt;p&gt;
Alloprof&#65306;&#19968;&#20010;&#26032;&#30340;&#27861;&#35821;&#38382;&#31572;&#25945;&#32946;&#25968;&#25454;&#38598;&#21450;&#20854;&#22312;&#20449;&#24687;&#26816;&#32034;&#26696;&#20363;&#30740;&#31350;&#20013;&#30340;&#24212;&#29992;
&lt;/p&gt;
&lt;p&gt;
Alloprof: a new French question-answer education dataset and its use in an information retrieval case study. (arXiv:2302.07738v2 [cs.CL] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2302.07738
&lt;/p&gt;
&lt;p&gt;
&#36825;&#20010;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#20010;&#26032;&#30340;&#38463;&#27931;&#26222;&#22827;&#27861;&#35821;&#38382;&#31572;&#25968;&#25454;&#38598;&#65292;&#25910;&#38598;&#20102;&#26469;&#33258;10,368&#21517;&#23398;&#29983;&#30340;29,349&#20010;&#38382;&#39064;&#21644;&#35299;&#37322;&#65292;&#24182;&#23637;&#31034;&#20102;&#22312;&#20449;&#24687;&#26816;&#32034;&#20219;&#21153;&#20013;&#20351;&#29992;&#35813;&#25968;&#25454;&#38598;&#30340;&#26696;&#20363;&#30740;&#31350;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25945;&#24072;&#21644;&#23398;&#29983;&#36234;&#26469;&#36234;&#20381;&#36182;&#22312;&#32447;&#23398;&#20064;&#36164;&#28304;&#26469;&#34917;&#20805;&#23398;&#26657;&#25552;&#20379;&#30340;&#36164;&#28304;&#12290;&#21487;&#29992;&#36164;&#28304;&#30340;&#24191;&#24230;&#21644;&#28145;&#24230;&#30340;&#22686;&#21152;&#23545;&#23398;&#29983;&#26469;&#35828;&#26159;&#19968;&#20214;&#22909;&#20107;&#65292;&#20294;&#21069;&#25552;&#26159;&#20182;&#20204;&#33021;&#22815;&#25214;&#21040;&#31572;&#26696;&#12290;&#38382;&#31572;&#21644;&#20449;&#24687;&#26816;&#32034;&#31995;&#32479;&#24050;&#21463;&#30410;&#20110;&#20844;&#20849;&#25968;&#25454;&#38598;&#65292;&#20197;&#35757;&#32451;&#21644;&#35780;&#20272;&#20854;&#31639;&#27861;&#65292;&#20294;&#22823;&#22810;&#25968;&#36825;&#20123;&#25968;&#25454;&#38598;&#37117;&#26159;&#33521;&#25991;&#25991;&#26412;&#65292;&#30001;&#25104;&#24180;&#20154;&#32534;&#20889;&#21644;&#38405;&#35835;&#12290;&#25105;&#20204;&#20171;&#32461;&#20102;&#19968;&#20010;&#26032;&#30340;&#20844;&#20849;&#27861;&#35821;&#38382;&#31572;&#25968;&#25454;&#38598;&#65292;&#20174;&#24635;&#37096;&#20301;&#20110;&#39745;&#21271;&#20811;&#30340;&#23567;&#23398;&#21644;&#20013;&#23398;&#24110;&#21161;&#32593;&#31449;Alloprof&#25910;&#38598;&#65292;&#21253;&#21547;29,349&#20010;&#38382;&#39064;&#21450;&#20854;&#35299;&#37322;&#65292;&#28085;&#30422;&#21508;&#31181;&#23398;&#31185;&#30340;10,368&#21517;&#23398;&#29983;&#65292;&#36229;&#36807;&#19968;&#21322;&#30340;&#35299;&#37322;&#21253;&#21547;&#38142;&#25509;&#21040;&#20854;&#20182;&#38382;&#39064;&#25110;&#32593;&#31449;&#19978;&#30340;2,596&#20010;&#21442;&#32771;&#39029;&#38754;&#20043;&#19968;&#12290;&#25105;&#20204;&#36824;&#21521;&#24744;&#23637;&#31034;&#20102;&#22312;&#20449;&#24687;&#26816;&#32034;&#20219;&#21153;&#20013;&#20351;&#29992;&#26412;&#25968;&#25454;&#38598;&#30340;&#26696;&#20363;&#30740;&#31350;&#12290;
&lt;/p&gt;
&lt;p&gt;
Teachers and students are increasingly relying on online learning resources to supplement the ones provided in school. This increase in the breadth and depth of available resources is a great thing for students, but only provided they are able to find answers to their queries. Question-answering and information retrieval systems have benefited from public datasets to train and evaluate their algorithms, but most of these datasets have been in English text written by and for adults. We introduce a new public French question-answering dataset collected from Alloprof, a Quebec-based primary and high-school help website, containing 29 349 questions and their explanations in a variety of school subjects from 10 368 students, with more than half of the explanations containing links to other questions or some of the 2 596 reference pages on the website. We also present a case study of this dataset in an information retrieval task. This dataset was collected on the Alloprof public forum, with 
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#35748;&#20026;Reddit&#26159;&#19968;&#20010;&#24222;&#22823;&#12289;&#20998;&#31867;&#12289;&#24320;&#25918;&#33719;&#21462;&#30340;&#25968;&#25454;&#38598;&#65292;&#20960;&#20046;&#21487;&#20197;&#28085;&#30422;&#8220;&#20219;&#20309;&#20027;&#39064;&#8221;&#65292;&#36866;&#29992;&#20110;&#25968;&#25454;&#31185;&#23398;&#21644;&#30693;&#35782;&#25506;&#32034;&#12290;&#20316;&#32773;&#25552;&#20986;&#20102;&#19968;&#20010;&#24320;&#28304;&#24037;&#20855;&#65292;&#21487;&#25552;&#20379;Reddit&#36164;&#28304;&#30340;&#26131;&#20110;&#35775;&#38382;&#24615;&#21644;&#23545;Reddit&#22914;&#20309;&#28085;&#30422;&#36873;&#23450;&#20027;&#39064;&#36827;&#34892;&#25506;&#32034;&#24615;&#25968;&#25454;&#20998;&#26512;&#12290;</title><link>http://arxiv.org/abs/2110.02158</link><description>&lt;p&gt;
&#25506;&#32034; Reddit &#22312;&#25968;&#25454;&#31185;&#23398;&#21644;&#30693;&#35782;&#22788;&#29702;&#20013;&#30340;&#21487;&#29992;&#24615;
&lt;/p&gt;
&lt;p&gt;
Exploring usability of Reddit in data science and knowledge processing. (arXiv:2110.02158v3 [cs.IR] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2110.02158
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#35748;&#20026;Reddit&#26159;&#19968;&#20010;&#24222;&#22823;&#12289;&#20998;&#31867;&#12289;&#24320;&#25918;&#33719;&#21462;&#30340;&#25968;&#25454;&#38598;&#65292;&#20960;&#20046;&#21487;&#20197;&#28085;&#30422;&#8220;&#20219;&#20309;&#20027;&#39064;&#8221;&#65292;&#36866;&#29992;&#20110;&#25968;&#25454;&#31185;&#23398;&#21644;&#30693;&#35782;&#25506;&#32034;&#12290;&#20316;&#32773;&#25552;&#20986;&#20102;&#19968;&#20010;&#24320;&#28304;&#24037;&#20855;&#65292;&#21487;&#25552;&#20379;Reddit&#36164;&#28304;&#30340;&#26131;&#20110;&#35775;&#38382;&#24615;&#21644;&#23545;Reddit&#22914;&#20309;&#28085;&#30422;&#36873;&#23450;&#20027;&#39064;&#36827;&#34892;&#25506;&#32034;&#24615;&#25968;&#25454;&#20998;&#26512;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#35748;&#20026;&#20316;&#20026;&#19968;&#20010;&#24222;&#22823;&#12289;&#20998;&#31867;&#12289;&#24320;&#25918;&#33719;&#21462;&#30340;&#25968;&#25454;&#38598;&#65292;Reddit&#26159;&#19968;&#20010;&#26377;&#29992;&#30340;&#25968;&#25454;&#26469;&#28304;&#65292;&#20960;&#20046;&#21487;&#20197;&#28085;&#30422;&#8220;&#20219;&#20309;&#20027;&#39064;&#8221;&#12290;&#22240;&#27492;&#65292;Reddit&#21487;&#20197;&#29992;&#20110;&#25968;&#25454;&#31185;&#23398;&#65292;&#27604;&#22914;&#29992;&#20110;&#30693;&#35782;&#25506;&#32034;&#12290;&#36825;&#20010;&#35266;&#28857;&#26159;&#22522;&#20110;180&#31687;&#25163;&#21160;&#27880;&#37322;&#30340;Reddit&#30456;&#20851;&#35770;&#25991;&#21644;&#20174;&#31185;&#23398;&#35770;&#25991;&#30340;&#27969;&#34892;&#25968;&#25454;&#24211;&#20013;&#33719;&#24471;&#30340;&#25968;&#25454;&#36827;&#34892;&#20998;&#26512;&#24471;&#20986;&#30340;&#12290;&#26368;&#21518;&#65292;&#20171;&#32461;&#20102;&#19968;&#20010;&#24320;&#28304;&#24037;&#20855;&#65292;&#25552;&#20379;&#20102;&#23545;Reddit&#36164;&#28304;&#30340;&#26131;&#20110;&#35775;&#38382;&#24615;&#65292;&#24182;&#23545;Reddit&#22914;&#20309;&#28085;&#30422;&#36873;&#23450;&#20027;&#39064;&#36827;&#34892;&#20102;&#25506;&#32034;&#24615;&#25968;&#25454;&#20998;&#26512;&#12290;&#36825;&#20123;&#21151;&#33021;&#21487;&#20197;&#20316;&#20026;&#26356;&#24191;&#27867;&#25506;&#32034;Reddit&#36866;&#29992;&#24615;&#30340;&#21069;&#22863;&#20998;&#26512;&#12290;
&lt;/p&gt;
&lt;p&gt;
This contribution argues that Reddit, as a massive, categorized, open-access dataset, is a useful data source, for "almost any topic". Hence, it can be used in data science, e.g. for knowledge exploration. This statement is backed-up with presented analysis, based on 180 manually annotated papers, related to Reddit itself, and data acquired from popular databases of scientific papers. Finally, an open source tool is introduced, which provides an easy access to Reddit resources, and an exploratory data analysis of how Reddit covers selected topics. These functions can be used as a prelude analysis to a broader exploration of Reddit's applicability.
&lt;/p&gt;</description></item></channel></rss>