<rss version="2.0"><channel><title>Chat Arxiv cs.IR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.IR</description><item><title>&#36890;&#36807;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#23454;&#29616;&#20102;&#32479;&#19968;&#26694;&#26550;&#65292;&#21487;&#20197;&#22312;&#22810;&#20010;&#39046;&#22495;&#36827;&#34892;&#28857;&#20987;&#29575;&#39044;&#27979;&#65292;&#36991;&#20813;&#20102;&#20256;&#32479;&#27169;&#22411;&#20013;&#24573;&#30053;&#35821;&#20041;&#20449;&#24687;&#23548;&#33268;&#30340;&#27867;&#21270;&#22256;&#38590;&#65292;&#24182;&#35299;&#20915;&#20102;&#37096;&#20998;&#39046;&#22495;&#20027;&#23548;&#24615;&#23548;&#33268;&#24615;&#33021;&#19979;&#38477;&#30340;&#38382;&#39064;&#12290;</title><link>https://arxiv.org/abs/2312.10743</link><description>&lt;p&gt;
&#36890;&#36807;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#23454;&#29616;&#22810;&#39046;&#22495;&#28857;&#20987;&#29575;&#39044;&#27979;&#30340;&#32479;&#19968;&#26694;&#26550;
&lt;/p&gt;
&lt;p&gt;
A Unified Framework for Multi-Domain CTR Prediction via Large Language Models
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2312.10743
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#23454;&#29616;&#20102;&#32479;&#19968;&#26694;&#26550;&#65292;&#21487;&#20197;&#22312;&#22810;&#20010;&#39046;&#22495;&#36827;&#34892;&#28857;&#20987;&#29575;&#39044;&#27979;&#65292;&#36991;&#20813;&#20102;&#20256;&#32479;&#27169;&#22411;&#20013;&#24573;&#30053;&#35821;&#20041;&#20449;&#24687;&#23548;&#33268;&#30340;&#27867;&#21270;&#22256;&#38590;&#65292;&#24182;&#35299;&#20915;&#20102;&#37096;&#20998;&#39046;&#22495;&#20027;&#23548;&#24615;&#23548;&#33268;&#24615;&#33021;&#19979;&#38477;&#30340;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#28857;&#20987;&#29575;&#65288;CTR&#65289;&#39044;&#27979;&#26159;&#22312;&#32447;&#25512;&#33616;&#24179;&#21488;&#20013;&#30340;&#37325;&#35201;&#20219;&#21153;&#65292;&#28041;&#21450;&#20272;&#35745;&#29992;&#25143;&#36890;&#36807;&#28857;&#20987;&#24191;&#21578;&#25110;&#29289;&#21697;&#32780;&#21442;&#19982;&#30340;&#27010;&#29575;&#12290;&#32473;&#23450;&#21508;&#31867;&#26381;&#21153;&#22914;&#22312;&#32447;&#36141;&#29289;&#12289;&#25171;&#36710;&#12289;&#22806;&#21334;&#21644;&#19987;&#19994;&#26381;&#21153;&#22312;&#21830;&#19994;&#24179;&#21488;&#19978;&#30340;&#21487;&#29992;&#24615;&#65292;&#36825;&#20123;&#24179;&#21488;&#30340;&#25512;&#33616;&#31995;&#32479;&#38656;&#35201;&#36328;&#22810;&#20010;&#39046;&#22495;&#36827;&#34892;CTR&#39044;&#27979;&#65292;&#32780;&#19981;&#20165;&#20165;&#26159;&#21333;&#19968;&#39046;&#22495;&#12290;&#28982;&#32780;&#65292;&#30001;&#20110;&#39046;&#22495;&#20043;&#38388;&#30340;&#22797;&#26434;&#30456;&#20114;&#24433;&#21709;&#65292;&#22810;&#39046;&#22495;&#28857;&#20987;&#29575;&#65288;MDCTR&#65289;&#39044;&#27979;&#20173;&#28982;&#26159;&#22312;&#32447;&#25512;&#33616;&#20013;&#19968;&#20010;&#20855;&#26377;&#25361;&#25112;&#24615;&#30340;&#20219;&#21153;&#12290;&#20256;&#32479;&#30340;MDCTR&#27169;&#22411;&#36890;&#24120;&#23558;&#39046;&#22495;&#32534;&#30721;&#20026;&#31163;&#25955;&#26631;&#35782;&#31526;&#65292;&#24573;&#30053;&#20102;&#28508;&#22312;&#30340;&#20016;&#23500;&#35821;&#20041;&#20449;&#24687;&#12290;&#22240;&#27492;&#65292;&#23427;&#20204;&#24456;&#38590;&#25512;&#24191;&#21040;&#26032;&#30340;&#39046;&#22495;&#12290;&#27492;&#22806;&#65292;&#29616;&#26377;&#27169;&#22411;&#24456;&#23481;&#26131;&#34987;&#26576;&#20123;&#29305;&#23450;&#39046;&#22495;&#25152;&#20027;&#23548;&#65292;&#23548;&#33268;&#24615;&#33021;&#26174;&#33879;&#19979;&#38477;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2312.10743v3 Announce Type: replace  Abstract: Click-Through Rate (CTR) prediction is a crucial task in online recommendation platforms as it involves estimating the probability of user engagement with advertisements or items by clicking on them. Given the availability of various services like online shopping, ride-sharing, food delivery, and professional services on commercial platforms, recommendation systems in these platforms are required to make CTR predictions across multiple domains rather than just a single domain. However, multi-domain click-through rate (MDCTR) prediction remains a challenging task in online recommendation due to the complex mutual influence between domains. Traditional MDCTR models typically encode domains as discrete identifiers, ignoring rich semantic information underlying. Consequently, they can hardly generalize to new domains. Besides, existing models can be easily dominated by some specific domains, which results in significant performance drops
&lt;/p&gt;</description></item></channel></rss>