<rss version="2.0"><channel><title>Chat Arxiv cs.IR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.IR</description><item><title>UniMatch&#26159;&#19968;&#20010;&#32479;&#19968;&#30340;&#29992;&#25143;-&#29289;&#21697;&#21305;&#37197;&#26694;&#26550;&#65292;&#36890;&#36807;&#20351;&#29992;&#19968;&#20010;&#27169;&#22411;&#21516;&#26102;&#36827;&#34892;&#29289;&#21697;&#25512;&#33616;&#21644;&#29992;&#25143;&#23450;&#20301;&#65292;&#20943;&#23569;&#20102;&#21830;&#23478;&#36141;&#20080;&#22810;&#20010;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#30340;&#25104;&#26412;&#12290;&#21033;&#29992;&#22810;&#39033;&#20998;&#24067;&#24314;&#27169;&#29992;&#25143;-&#29289;&#21697;&#20132;&#20114;&#30697;&#38453;&#65292;&#24182;&#36890;&#36807;&#21452;&#21521;&#20559;&#24046;&#26657;&#27491;&#30340;&#25439;&#22833;&#20989;&#25968;&#25351;&#23548;&#27169;&#22411;&#23398;&#20064;&#29992;&#25143;-&#29289;&#21697;&#32852;&#21512;&#27010;&#29575;&#65292;&#23454;&#29616;&#20102;&#20248;&#21270;&#12290;</title><link>http://arxiv.org/abs/2307.09989</link><description>&lt;p&gt;
UniMatch:&#19968;&#20010;&#32479;&#19968;&#30340;&#29992;&#25143;-&#29289;&#21697;&#21305;&#37197;&#26694;&#26550;&#65292;&#29992;&#20110;&#22810;&#29992;&#36884;&#21830;&#23478;&#33829;&#38144;
&lt;/p&gt;
&lt;p&gt;
UniMatch: A Unified User-Item Matching Framework for the Multi-purpose Merchant Marketing. (arXiv:2307.09989v1 [cs.IR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.09989
&lt;/p&gt;
&lt;p&gt;
UniMatch&#26159;&#19968;&#20010;&#32479;&#19968;&#30340;&#29992;&#25143;-&#29289;&#21697;&#21305;&#37197;&#26694;&#26550;&#65292;&#36890;&#36807;&#20351;&#29992;&#19968;&#20010;&#27169;&#22411;&#21516;&#26102;&#36827;&#34892;&#29289;&#21697;&#25512;&#33616;&#21644;&#29992;&#25143;&#23450;&#20301;&#65292;&#20943;&#23569;&#20102;&#21830;&#23478;&#36141;&#20080;&#22810;&#20010;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#30340;&#25104;&#26412;&#12290;&#21033;&#29992;&#22810;&#39033;&#20998;&#24067;&#24314;&#27169;&#29992;&#25143;-&#29289;&#21697;&#20132;&#20114;&#30697;&#38453;&#65292;&#24182;&#36890;&#36807;&#21452;&#21521;&#20559;&#24046;&#26657;&#27491;&#30340;&#25439;&#22833;&#20989;&#25968;&#25351;&#23548;&#27169;&#22411;&#23398;&#20064;&#29992;&#25143;-&#29289;&#21697;&#32852;&#21512;&#27010;&#29575;&#65292;&#23454;&#29616;&#20102;&#20248;&#21270;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#20351;&#29992;&#20113;&#26381;&#21153;&#36827;&#34892;&#31169;&#26377;&#39046;&#22495;&#33829;&#38144;&#26102;&#65292;&#21830;&#23478;&#36890;&#24120;&#38656;&#35201;&#20026;&#22810;&#20010;&#33829;&#38144;&#30446;&#30340;&#36141;&#20080;&#19981;&#21516;&#30340;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#65292;&#23548;&#33268;&#25104;&#26412;&#38750;&#24120;&#39640;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#32479;&#19968;&#30340;&#29992;&#25143;-&#29289;&#21697;&#21305;&#37197;&#26694;&#26550;&#65292;&#21487;&#20197;&#36890;&#36807;&#19968;&#20010;&#27169;&#22411;&#21516;&#26102;&#36827;&#34892;&#29289;&#21697;&#25512;&#33616;&#21644;&#29992;&#25143;&#23450;&#20301;&#12290;&#25105;&#20204;&#36890;&#36807;&#23545;&#29992;&#25143;-&#29289;&#21697;&#20132;&#20114;&#30697;&#38453;&#36827;&#34892;&#22810;&#39033;&#20998;&#24067;&#24314;&#27169;&#30340;&#23454;&#39564;&#39564;&#35777;&#20102;&#19978;&#36848;&#24182;&#21457;&#24314;&#27169;&#30340;&#21487;&#34892;&#24615;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#20010;&#21452;&#21521;&#20559;&#24046;&#26657;&#27491;&#30340;NCE loss&#26469;&#23454;&#29616;&#12290;&#25552;&#20986;&#30340;&#25439;&#22833;&#20989;&#25968;&#36890;&#36807;&#32416;&#27491;&#30001;&#20110;&#25209;&#27425;&#20869;&#36127;&#37319;&#26679;&#24341;&#36215;&#30340;&#29992;&#25143;&#21644;&#29289;&#21697;&#20559;&#24046;&#65292;&#24341;&#23548;&#27169;&#22411;&#23398;&#20064;&#29992;&#25143;-&#29289;&#21697;&#32852;&#21512;&#27010;&#29575;p(u,i)&#65292;&#32780;&#19981;&#26159;&#26465;&#20214;&#27010;&#29575;p(i|u)&#25110;p(u|i)&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#30340;&#26694;&#26550;&#23545;&#27169;&#22411;&#26550;&#26500;&#20855;&#26377;&#28789;&#27963;&#30340;&#36866;&#24212;&#24615;&#12290;&#24191;&#27867;&#30340;&#23454;&#39564;&#35777;&#26126;&#65292;&#25105;&#20204;&#30340;&#26694;&#26550;&#21487;&#20197;&#26174;&#33879;&#25552;&#39640;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;
When doing private domain marketing with cloud services, the merchants usually have to purchase different machine learning models for the multiple marketing purposes, leading to a very high cost. We present a unified user-item matching framework to simultaneously conduct item recommendation and user targeting with just one model. We empirically demonstrate that the above concurrent modeling is viable via modeling the user-item interaction matrix with the multinomial distribution, and propose a bidirectional bias-corrected NCE loss for the implementation. The proposed loss function guides the model to learn the user-item joint probability $p(u,i)$ instead of the conditional probability $p(i|u)$ or $p(u|i)$ through correcting both the users and items' biases caused by the in-batch negative sampling. In addition, our framework is model-agnostic enabling a flexible adaptation of different model architectures. Extensive experiments demonstrate that our framework results in significant perfo
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#36890;&#36807;&#23545;MovieLens&#25968;&#25454;&#38598;&#30340;&#20998;&#26512;&#65292;&#21457;&#29616;&#29992;&#25143;&#19982;&#35813;&#24179;&#21488;&#30340;&#20132;&#20114;&#22312;&#19981;&#21516;&#38454;&#27573;&#23384;&#22312;&#26174;&#33879;&#24046;&#24322;&#65292;&#24182;&#19988;&#29992;&#25143;&#20132;&#20114;&#21463;&#21040;&#24179;&#21488;&#25512;&#33616;&#31639;&#27861;&#25512;&#33616;&#30340;&#20505;&#36873;&#30005;&#24433;&#30340;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2307.09985</link><description>&lt;p&gt;
&#25105;&#20204;&#30340;&#27169;&#22411;&#22312;MovieLens&#19978;&#21462;&#24471;&#20102;&#20986;&#33394;&#30340;&#34920;&#29616;&#65306;&#36825;&#24847;&#21619;&#30528;&#20160;&#20040;&#65311;
&lt;/p&gt;
&lt;p&gt;
Our Model Achieves Excellent Performance on MovieLens: What Does it Mean?. (arXiv:2307.09985v1 [cs.IR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.09985
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#36890;&#36807;&#23545;MovieLens&#25968;&#25454;&#38598;&#30340;&#20998;&#26512;&#65292;&#21457;&#29616;&#29992;&#25143;&#19982;&#35813;&#24179;&#21488;&#30340;&#20132;&#20114;&#22312;&#19981;&#21516;&#38454;&#27573;&#23384;&#22312;&#26174;&#33879;&#24046;&#24322;&#65292;&#24182;&#19988;&#29992;&#25143;&#20132;&#20114;&#21463;&#21040;&#24179;&#21488;&#25512;&#33616;&#31639;&#27861;&#25512;&#33616;&#30340;&#20505;&#36873;&#30005;&#24433;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25512;&#33616;&#31995;&#32479;&#35780;&#20272;&#30340;&#20856;&#22411;&#22522;&#20934;&#25968;&#25454;&#38598;&#26159;&#22312;&#26576;&#19968;&#26102;&#38388;&#27573;&#20869;&#22312;&#24179;&#21488;&#19978;&#29983;&#25104;&#30340;&#29992;&#25143;-&#29289;&#21697;&#20132;&#20114;&#25968;&#25454;&#12290;&#20132;&#20114;&#29983;&#25104;&#26426;&#21046;&#37096;&#20998;&#35299;&#37322;&#20102;&#20026;&#20160;&#20040;&#29992;&#25143;&#19982;&#29289;&#21697;&#36827;&#34892;&#20132;&#20114;&#65288;&#22914;&#21916;&#27426;&#12289;&#36141;&#20080;&#12289;&#35780;&#20998;&#65289;&#20197;&#21450;&#29305;&#23450;&#20132;&#20114;&#21457;&#29983;&#30340;&#32972;&#26223;&#12290;&#22312;&#26412;&#30740;&#31350;&#20013;&#65292;&#25105;&#20204;&#23545;MovieLens&#25968;&#25454;&#38598;&#36827;&#34892;&#20102;&#32454;&#33268;&#30340;&#20998;&#26512;&#65292;&#24182;&#35299;&#37322;&#20102;&#20351;&#29992;&#35813;&#25968;&#25454;&#38598;&#36827;&#34892;&#35780;&#20272;&#25512;&#33616;&#31639;&#27861;&#26102;&#21487;&#33021;&#30340;&#24433;&#21709;&#12290;&#25105;&#20204;&#20174;&#20998;&#26512;&#20013;&#24471;&#20986;&#20102;&#19968;&#20123;&#20027;&#35201;&#21457;&#29616;&#12290;&#39318;&#20808;&#65292;&#22312;&#29992;&#25143;&#19982;MovieLens&#24179;&#21488;&#20132;&#20114;&#30340;&#19981;&#21516;&#38454;&#27573;&#23384;&#22312;&#26174;&#33879;&#24046;&#24322;&#12290;&#26089;&#26399;&#20132;&#20114;&#22312;&#24456;&#22823;&#31243;&#24230;&#19978;&#23450;&#20041;&#20102;&#29992;&#25143;&#30011;&#20687;&#65292;&#24433;&#21709;&#20102;&#21518;&#32493;&#30340;&#20132;&#20114;&#12290;&#20854;&#27425;&#65292;&#29992;&#25143;&#20132;&#20114;&#21463;&#21040;&#24179;&#21488;&#20869;&#37096;&#25512;&#33616;&#31639;&#27861;&#25512;&#33616;&#30340;&#20505;&#36873;&#30005;&#24433;&#30340;&#24456;&#22823;&#24433;&#21709;&#12290;&#21024;&#38500;&#38752;&#36817;&#26368;&#21518;&#20960;&#27425;&#20132;&#20114;&#30340;&#20132;&#20114;&#20250;&#23545;&#32467;&#26524;&#20135;&#29983;&#36739;&#22823;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
A typical benchmark dataset for recommender system (RecSys) evaluation consists of user-item interactions generated on a platform within a time period. The interaction generation mechanism partially explains why a user interacts with (e.g.,like, purchase, rate) an item, and the context of when a particular interaction happened. In this study, we conduct a meticulous analysis on the MovieLens dataset and explain the potential impact on using the dataset for evaluating recommendation algorithms. We make a few main findings from our analysis. First, there are significant differences in user interactions at the different stages when a user interacts with the MovieLens platform. The early interactions largely define the user portrait which affect the subsequent interactions. Second, user interactions are highly affected by the candidate movies that are recommended by the platform's internal recommendation algorithm(s). Removal of interactions that happen nearer to the last few interactions 
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#35843;&#26597;&#20102;&#35895;&#27468;&#26032;&#38395;&#19982;&#20420;&#32599;&#26031;&#22269;&#26377;&#38468;&#23646;&#26032;&#38395;&#26469;&#28304;&#30340;&#20851;&#31995;&#65292;&#21457;&#29616;&#22312;&#20840;&#29699;&#33539;&#22260;&#20869;&#65292;&#35895;&#27468;&#22312;&#20256;&#25773;&#22269;&#23478;&#36190;&#21161;&#20449;&#24687;&#26041;&#38754;&#36215;&#21040;&#20102;&#37325;&#35201;&#30340;&#20316;&#29992;&#12290;</title><link>http://arxiv.org/abs/2307.09834</link><description>&lt;p&gt;
&#35841;&#25552;&#20379;&#20102;&#26368;&#22823;&#30340;&#25193;&#38899;&#22120;&#65311;&#35895;&#27468;&#26032;&#38395;&#22312;&#20419;&#36827;&#20420;&#32599;&#26031;&#22269;&#26377;&#38468;&#23646;&#26032;&#38395;&#26469;&#28304;&#20013;&#30340;&#35282;&#33394;&#12290;
&lt;/p&gt;
&lt;p&gt;
Who Provides the Largest Megaphone? The Role of Google News in Promoting Russian State-Affiliated News Sources. (arXiv:2307.09834v1 [cs.IR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.09834
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#35843;&#26597;&#20102;&#35895;&#27468;&#26032;&#38395;&#19982;&#20420;&#32599;&#26031;&#22269;&#26377;&#38468;&#23646;&#26032;&#38395;&#26469;&#28304;&#30340;&#20851;&#31995;&#65292;&#21457;&#29616;&#22312;&#20840;&#29699;&#33539;&#22260;&#20869;&#65292;&#35895;&#27468;&#22312;&#20256;&#25773;&#22269;&#23478;&#36190;&#21161;&#20449;&#24687;&#26041;&#38754;&#36215;&#21040;&#20102;&#37325;&#35201;&#30340;&#20316;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20114;&#32852;&#32593;&#19981;&#20165;&#25968;&#23383;&#21270;&#20102;&#20449;&#24687;&#65292;&#36824;&#20351;&#20840;&#29699;&#33539;&#22260;&#20869;&#30340;&#20449;&#24687;&#33719;&#21462;&#21464;&#24471;&#27665;&#20027;&#21270;&#12290;&#36825;&#31181;&#36880;&#27493;&#20294;&#20855;&#26377;&#31361;&#30772;&#24615;&#30340;&#22312;&#32447;&#20449;&#24687;&#20256;&#25773;&#26041;&#24335;&#23548;&#33268;&#25628;&#32034;&#24341;&#25806;&#22312;&#22609;&#36896;&#20154;&#31867;&#30693;&#35782;&#33719;&#21462;&#26041;&#38754;&#21457;&#25381;&#36234;&#26469;&#36234;&#37325;&#35201;&#30340;&#20316;&#29992;&#12290;&#24403;&#20114;&#32852;&#32593;&#29992;&#25143;&#36755;&#20837;&#26597;&#35810;&#26102;&#65292;&#25628;&#32034;&#24341;&#25806;&#20250;&#23545;&#25968;&#30334;&#20159;&#20010;&#21487;&#33021;&#30340;&#32593;&#39029;&#36827;&#34892;&#25490;&#24207;&#20197;&#30830;&#23450;&#35201;&#26174;&#31034;&#30340;&#20869;&#23481;&#12290;&#35895;&#27468;&#22312;&#25628;&#32034;&#24341;&#25806;&#24066;&#22330;&#21344;&#25454;&#20027;&#23548;&#22320;&#20301;&#65292;&#22312;&#36807;&#21435;&#21313;&#24180;&#20013;&#65292;&#35895;&#27468;&#25628;&#32034;&#22312;&#20840;&#29699;&#33539;&#22260;&#20869;&#30340;&#24066;&#22330;&#20221;&#39069;&#36229;&#36807;80&#65285;&#12290;&#21482;&#26377;&#22312;&#20420;&#32599;&#26031;&#21644;&#20013;&#22269;&#65292;&#31454;&#20105;&#23545;&#25163;&#20204;&#22312;&#24066;&#22330;&#20221;&#39069;&#26041;&#38754;&#36229;&#36807;&#20102;&#35895;&#27468;&#65292;&#22823;&#32422;60&#65285;&#30340;&#20420;&#32599;&#26031;&#20114;&#32852;&#32593;&#29992;&#25143;&#26356;&#21916;&#27426;&#20351;&#29992;Yandex&#65288;&#32780;&#19981;&#26159;Google&#65289;&#65292;&#25130;&#33267;2022&#24180;&#65292;80&#65285;&#20197;&#19978;&#30340;&#20013;&#22269;&#20114;&#32852;&#32593;&#29992;&#25143;&#20351;&#29992;Baidu&#12290;&#23613;&#31649;&#22312;&#20114;&#32852;&#32593;&#25628;&#32034;&#25552;&#20379;&#21830;&#26041;&#38754;&#23384;&#22312;&#38271;&#26399;&#30340;&#22320;&#21306;&#24046;&#24322;&#65292;&#20294;&#26377;&#38480;&#30340;&#30740;&#31350;&#26174;&#31034;&#20102;&#36825;&#20123;&#25552;&#20379;&#21830;&#22312;&#20256;&#25773;&#22269;&#23478;&#36190;&#21161;&#20449;&#24687;&#26041;&#38754;&#30340;&#27604;&#36739;&#24773;&#20917;&#12290;
&lt;/p&gt;
&lt;p&gt;
The Internet has not only digitized but also democratized information access across the globe. This gradual but path-breaking move to online information propagation has resulted in search engines playing an increasingly prominent role in shaping access to human knowledge. When an Internet user enters a query, the search engine sorts through the hundreds of billions of possible webpages to determine what to show. Google dominates the search engine market, with Google Search surpassing 80% market share globally every year of the last decade. Only in Russia and China do Google competitors claim more market share, with approximately 60% of Internet users in Russia preferring Yandex (compared to 40% in favor of Google) and more than 80% of China's Internet users accessing Baidu as of 2022. Notwithstanding this long-standing regional variation in Internet search providers, there is limited research showing how these providers compare in terms of propagating state-sponsored information. Our s
&lt;/p&gt;</description></item><item><title>DisCover&#26159;&#19968;&#20010;&#38024;&#23545;Cover&#27468;&#26354;&#35782;&#21035;&#30340;&#35299;&#32544;&#32469;&#38899;&#20048;&#34920;&#31034;&#23398;&#20064;&#26694;&#26550;&#65292;&#26088;&#22312;&#35299;&#32544;&#29305;&#23450;&#29256;&#26412;&#22240;&#32032;&#21644;&#26080;&#29256;&#26412;&#22240;&#32032;&#65292;&#20174;&#32780;&#20351;&#27169;&#22411;&#21487;&#20197;&#23398;&#20064;&#21040;&#36866;&#29992;&#20110;&#26410;&#35265;&#26597;&#35810;&#27468;&#26354;&#30340;&#19981;&#21464;&#38899;&#20048;&#34920;&#31034;&#12290;</title><link>http://arxiv.org/abs/2307.09775</link><description>&lt;p&gt;
DisCover: &#38024;&#23545;Cover&#27468;&#26354;&#35782;&#21035;&#30340;&#35299;&#32544;&#32469;&#38899;&#20048;&#34920;&#31034;&#23398;&#20064;
&lt;/p&gt;
&lt;p&gt;
DisCover: Disentangled Music Representation Learning for Cover Song Identification. (arXiv:2307.09775v1 [cs.IR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.09775
&lt;/p&gt;
&lt;p&gt;
DisCover&#26159;&#19968;&#20010;&#38024;&#23545;Cover&#27468;&#26354;&#35782;&#21035;&#30340;&#35299;&#32544;&#32469;&#38899;&#20048;&#34920;&#31034;&#23398;&#20064;&#26694;&#26550;&#65292;&#26088;&#22312;&#35299;&#32544;&#29305;&#23450;&#29256;&#26412;&#22240;&#32032;&#21644;&#26080;&#29256;&#26412;&#22240;&#32032;&#65292;&#20174;&#32780;&#20351;&#27169;&#22411;&#21487;&#20197;&#23398;&#20064;&#21040;&#36866;&#29992;&#20110;&#26410;&#35265;&#26597;&#35810;&#27468;&#26354;&#30340;&#19981;&#21464;&#38899;&#20048;&#34920;&#31034;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#38899;&#20048;&#20449;&#24687;&#26816;&#32034;&#65288;MIR&#65289;&#39046;&#22495;&#20013;&#65292;Cover&#27468;&#26354;&#35782;&#21035;&#65288;CSI&#65289;&#26159;&#19968;&#39033;&#20855;&#26377;&#25361;&#25112;&#24615;&#30340;&#20219;&#21153;&#65292;&#26088;&#22312;&#20174;&#22823;&#37327;&#30340;&#27468;&#26354;&#24211;&#20013;&#35782;&#21035;&#20986;&#26597;&#35810;&#27468;&#26354;&#30340;Cover&#29256;&#26412;&#12290;&#29616;&#26377;&#30340;&#26041;&#27861;&#30001;&#20110;&#24314;&#27169;&#20013;&#29305;&#23450;&#29256;&#26412;&#22240;&#32032;&#21644;&#26080;&#29256;&#26412;&#22240;&#32032;&#30340;&#32544;&#32469;&#24615;&#65292;&#20173;&#28982;&#23384;&#22312;&#39640;&#20869;&#37096;&#21644;&#22806;&#37096;&#27468;&#26354;&#20043;&#38388;&#30340;&#21464;&#24322;&#24615;&#21644;&#30456;&#20851;&#24615;&#12290;&#22312;&#26412;&#30740;&#31350;&#20013;&#65292;&#25105;&#20204;&#30340;&#30446;&#26631;&#26159;&#35299;&#32544;&#20986;&#29305;&#23450;&#29256;&#26412;&#22240;&#32032;&#21644;&#26080;&#29256;&#26412;&#22240;&#32032;&#65292;&#36825;&#33021;&#22815;&#20351;&#27169;&#22411;&#26356;&#23481;&#26131;&#23398;&#20064;&#21040;&#36866;&#29992;&#20110;&#26410;&#35265;&#26597;&#35810;&#27468;&#26354;&#30340;&#19981;&#21464;&#38899;&#20048;&#34920;&#31034;&#12290;&#25105;&#20204;&#20351;&#29992;&#22240;&#26524;&#22270;&#25216;&#26415;&#20197;&#35299;&#32544;&#30340;&#35270;&#35282;&#20998;&#26512;&#20102;CSI&#20219;&#21153;&#65292;&#24182;&#30830;&#23450;&#20102;&#24433;&#21709;&#19981;&#21464;&#23398;&#20064;&#30340;&#20869;&#37096;&#29256;&#26412;&#21644;&#22806;&#37096;&#29256;&#26412;&#25928;&#24212;&#12290;&#20026;&#20102;&#38459;&#27490;&#36825;&#20123;&#25928;&#24212;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#29992;&#20110;CSI&#30340;&#35299;&#32544;&#32469;&#38899;&#20048;&#34920;&#31034;&#23398;&#20064;&#26694;&#26550;&#65288;DisCover&#65289;&#12290;DisCover&#21253;&#25324;&#20004;&#20010;&#20851;&#38190;&#32452;&#20214;&#65306;&#65288;1&#65289;&#30693;&#35782;&#24341;&#23548;&#30340;&#35299;&#32544;&#27169;&#22359;&#65288;KDM&#65289;&#21644;&#65288;2&#65289;&#22522;&#20110;&#26799;&#24230;&#30340;&#23545;&#25239;&#35299;&#32544;&#12290;
&lt;/p&gt;
&lt;p&gt;
In the field of music information retrieval (MIR), cover song identification (CSI) is a challenging task that aims to identify cover versions of a query song from a massive collection. Existing works still suffer from high intra-song variances and inter-song correlations, due to the entangled nature of version-specific and version-invariant factors in their modeling. In this work, we set the goal of disentangling version-specific and version-invariant factors, which could make it easier for the model to learn invariant music representations for unseen query songs. We analyze the CSI task in a disentanglement view with the causal graph technique, and identify the intra-version and inter-version effects biasing the invariant learning. To block these effects, we propose the disentangled music representation learning framework (DisCover) for CSI. DisCover consists of two critical components: (1) Knowledge-guided Disentanglement Module (KDM) and (2) Gradient-based Adversarial Disentanglemen
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#24635;&#32467;&#20102;&#20013;&#22269;&#20449;&#24687;&#26816;&#32034;&#30028;&#20851;&#20110;&#20449;&#24687;&#26816;&#32034;&#19982;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#30456;&#32467;&#21512;&#30340;&#25112;&#30053;&#25253;&#21578;&#12290;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#22312;&#25991;&#26412;&#29702;&#35299;&#12289;&#29983;&#25104;&#21644;&#30693;&#35782;&#25512;&#29702;&#26041;&#38754;&#20855;&#26377;&#20986;&#33394;&#33021;&#21147;&#65292;&#20026;&#20449;&#24687;&#26816;&#32034;&#30740;&#31350;&#24320;&#36767;&#20102;&#26032;&#30340;&#26041;&#21521;&#12290;&#27492;&#22806;&#65292;IR&#27169;&#22411;&#12289;LLM&#21644;&#20154;&#31867;&#20043;&#38388;&#30340;&#21327;&#21516;&#20851;&#31995;&#24418;&#25104;&#20102;&#19968;&#31181;&#26356;&#24378;&#22823;&#30340;&#20449;&#24687;&#23547;&#27714;&#25216;&#26415;&#33539;&#24335;&#12290;&#28982;&#32780;&#65292;&#35813;&#39046;&#22495;&#20173;&#38754;&#20020;&#35745;&#31639;&#25104;&#26412;&#12289;&#21487;&#20449;&#24230;&#12289;&#39046;&#22495;&#29305;&#23450;&#38480;&#21046;&#21644;&#20262;&#29702;&#32771;&#34385;&#31561;&#25361;&#25112;&#12290;</title><link>http://arxiv.org/abs/2307.09751</link><description>&lt;p&gt;
&#20449;&#24687;&#26816;&#32034;&#36935;&#19978;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65306;&#20013;&#22269;&#20449;&#24687;&#26816;&#32034;&#30028;&#30340;&#25112;&#30053;&#25253;&#21578;
&lt;/p&gt;
&lt;p&gt;
Information Retrieval Meets Large Language Models: A Strategic Report from Chinese IR Community. (arXiv:2307.09751v1 [cs.IR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.09751
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#24635;&#32467;&#20102;&#20013;&#22269;&#20449;&#24687;&#26816;&#32034;&#30028;&#20851;&#20110;&#20449;&#24687;&#26816;&#32034;&#19982;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#30456;&#32467;&#21512;&#30340;&#25112;&#30053;&#25253;&#21578;&#12290;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#22312;&#25991;&#26412;&#29702;&#35299;&#12289;&#29983;&#25104;&#21644;&#30693;&#35782;&#25512;&#29702;&#26041;&#38754;&#20855;&#26377;&#20986;&#33394;&#33021;&#21147;&#65292;&#20026;&#20449;&#24687;&#26816;&#32034;&#30740;&#31350;&#24320;&#36767;&#20102;&#26032;&#30340;&#26041;&#21521;&#12290;&#27492;&#22806;&#65292;IR&#27169;&#22411;&#12289;LLM&#21644;&#20154;&#31867;&#20043;&#38388;&#30340;&#21327;&#21516;&#20851;&#31995;&#24418;&#25104;&#20102;&#19968;&#31181;&#26356;&#24378;&#22823;&#30340;&#20449;&#24687;&#23547;&#27714;&#25216;&#26415;&#33539;&#24335;&#12290;&#28982;&#32780;&#65292;&#35813;&#39046;&#22495;&#20173;&#38754;&#20020;&#35745;&#31639;&#25104;&#26412;&#12289;&#21487;&#20449;&#24230;&#12289;&#39046;&#22495;&#29305;&#23450;&#38480;&#21046;&#21644;&#20262;&#29702;&#32771;&#34385;&#31561;&#25361;&#25112;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20449;&#24687;&#26816;&#32034;&#65288;IR&#65289;&#39046;&#22495;&#24050;&#32463;&#21462;&#24471;&#20102;&#26174;&#33879;&#30340;&#21457;&#23637;&#65292;&#36229;&#36234;&#20102;&#20256;&#32479;&#25628;&#32034;&#65292;&#20197;&#28385;&#36275;&#22810;&#26679;&#21270;&#30340;&#29992;&#25143;&#20449;&#24687;&#38656;&#27714;&#12290;&#26368;&#36817;&#65292;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLM&#65289;&#22312;&#25991;&#26412;&#29702;&#35299;&#12289;&#29983;&#25104;&#21644;&#30693;&#35782;&#25512;&#29702;&#26041;&#38754;&#23637;&#31034;&#20102;&#20986;&#33394;&#30340;&#33021;&#21147;&#65292;&#20026;IR&#30740;&#31350;&#24320;&#36767;&#20102;&#26032;&#30340;&#22865;&#26426;&#12290;LLM&#19981;&#20165;&#33021;&#22815;&#20419;&#36827;&#29983;&#25104;&#24335;&#26816;&#32034;&#65292;&#36824;&#25552;&#20379;&#20102;&#25913;&#36827;&#30340;&#29992;&#25143;&#29702;&#35299;&#12289;&#27169;&#22411;&#35780;&#20272;&#21644;&#29992;&#25143;&#31995;&#32479;&#20132;&#20114;&#26041;&#26696;&#12290;&#26356;&#37325;&#35201;&#30340;&#26159;&#65292;IR&#27169;&#22411;&#12289;LLM&#21644;&#20154;&#31867;&#20043;&#38388;&#30340;&#21327;&#21516;&#20851;&#31995;&#26500;&#25104;&#20102;&#19968;&#31181;&#26356;&#24378;&#22823;&#30340;&#20449;&#24687;&#23547;&#27714;&#25216;&#26415;&#33539;&#24335;&#12290;IR&#27169;&#22411;&#25552;&#20379;&#23454;&#26102;&#21644;&#30456;&#20851;&#30340;&#20449;&#24687;&#65292;LLM&#36129;&#29486;&#20869;&#37096;&#30693;&#35782;&#65292;&#32780;&#20154;&#31867;&#22312;&#20449;&#24687;&#26381;&#21153;&#30340;&#21487;&#38752;&#24615;&#26041;&#38754;&#36215;&#30528;&#38656;&#27714;&#32773;&#21644;&#35780;&#20272;&#32773;&#30340;&#20013;&#24515;&#20316;&#29992;&#12290;&#28982;&#32780;&#65292;&#20173;&#28982;&#23384;&#22312;&#30528;&#19968;&#20123;&#37325;&#35201;&#25361;&#25112;&#65292;&#21253;&#25324;&#35745;&#31639;&#25104;&#26412;&#12289;&#21487;&#20449;&#24230;&#38382;&#39064;&#12289;&#39046;&#22495;&#29305;&#23450;&#38480;&#21046;&#21644;&#20262;&#29702;&#32771;&#34385;&#12290;
&lt;/p&gt;
&lt;p&gt;
The research field of Information Retrieval (IR) has evolved significantly, expanding beyond traditional search to meet diverse user information needs. Recently, Large Language Models (LLMs) have demonstrated exceptional capabilities in text understanding, generation, and knowledge inference, opening up exciting avenues for IR research. LLMs not only facilitate generative retrieval but also offer improved solutions for user understanding, model evaluation, and user-system interactions. More importantly, the synergistic relationship among IR models, LLMs, and humans forms a new technical paradigm that is more powerful for information seeking. IR models provide real-time and relevant information, LLMs contribute internal knowledge, and humans play a central role of demanders and evaluators to the reliability of information services. Nevertheless, significant challenges exist, including computational costs, credibility concerns, domain-specific limitations, and ethical considerations. To 
&lt;/p&gt;</description></item><item><title>Amazon-M2&#26159;&#19968;&#20010;&#22810;&#35821;&#35328;&#22810;&#21306;&#22495;&#36141;&#29289;&#20250;&#35805;&#25968;&#25454;&#38598;&#65292;&#21487;&#20197;&#22686;&#24378;&#20010;&#24615;&#21270;&#25512;&#33616;&#21644;&#29702;&#35299;&#29992;&#25143;&#20559;&#22909;&#33021;&#21147;&#12290;</title><link>http://arxiv.org/abs/2307.09688</link><description>&lt;p&gt;
Amazon-M2: &#19968;&#20010;&#29992;&#20110;&#25512;&#33616;&#21644;&#25991;&#26412;&#29983;&#25104;&#30340;&#22810;&#35821;&#35328;&#22810;&#21306;&#22495;&#36141;&#29289;&#20250;&#35805;&#25968;&#25454;&#38598;
&lt;/p&gt;
&lt;p&gt;
Amazon-M2: A Multilingual Multi-locale Shopping Session Dataset for Recommendation and Text Generation. (arXiv:2307.09688v1 [cs.IR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.09688
&lt;/p&gt;
&lt;p&gt;
Amazon-M2&#26159;&#19968;&#20010;&#22810;&#35821;&#35328;&#22810;&#21306;&#22495;&#36141;&#29289;&#20250;&#35805;&#25968;&#25454;&#38598;&#65292;&#21487;&#20197;&#22686;&#24378;&#20010;&#24615;&#21270;&#25512;&#33616;&#21644;&#29702;&#35299;&#29992;&#25143;&#20559;&#22909;&#33021;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#23545;&#20110;&#30005;&#23376;&#21830;&#21153;&#26469;&#35828;&#65292;&#24314;&#27169;&#23458;&#25143;&#36141;&#29289;&#24847;&#22270;&#26159;&#19968;&#20010;&#37325;&#35201;&#30340;&#20219;&#21153;&#65292;&#22240;&#20026;&#23427;&#30452;&#25509;&#24433;&#21709;&#29992;&#25143;&#20307;&#39564;&#21644;&#21442;&#19982;&#24230;&#12290;&#22240;&#27492;&#65292;&#20934;&#30830;&#29702;&#35299;&#23458;&#25143;&#30340;&#20559;&#22909;&#23545;&#20110;&#25552;&#20379;&#20010;&#24615;&#21270;&#25512;&#33616;&#33267;&#20851;&#37325;&#35201;&#12290;&#22522;&#20110;&#20250;&#35805;&#30340;&#25512;&#33616;&#25216;&#26415;&#21033;&#29992;&#23458;&#25143;&#20250;&#35805;&#25968;&#25454;&#26469;&#39044;&#27979;&#20182;&#20204;&#30340;&#19979;&#19968;&#27425;&#20114;&#21160;&#65292;&#24050;&#32463;&#36234;&#26469;&#36234;&#21463;&#21040;&#27426;&#36814;&#12290;&#28982;&#32780;&#65292;&#29616;&#26377;&#30340;&#20250;&#35805;&#25968;&#25454;&#38598;&#22312;&#39033;&#30446;&#23646;&#24615;&#12289;&#29992;&#25143;&#22810;&#26679;&#24615;&#21644;&#25968;&#25454;&#38598;&#35268;&#27169;&#26041;&#38754;&#23384;&#22312;&#23616;&#38480;&#24615;&#12290;&#22240;&#27492;&#65292;&#23427;&#20204;&#19981;&#33021;&#20840;&#38754;&#22320;&#25429;&#25417;&#29992;&#25143;&#34892;&#20026;&#21644;&#20559;&#22909;&#30340;&#35889;&#31995;&#12290;&#20026;&#20102;&#24357;&#34917;&#36825;&#19968;&#24046;&#36317;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;Amazon Multilingual Multi-locale Shopping Session Dataset&#65292;&#21363;Amazon-M2&#12290;&#23427;&#26159;&#31532;&#19968;&#20010;&#30001;&#26469;&#33258;&#20845;&#20010;&#19981;&#21516;&#21306;&#22495;&#30340;&#25968;&#30334;&#19975;&#29992;&#25143;&#20250;&#35805;&#32452;&#25104;&#30340;&#22810;&#35821;&#35328;&#25968;&#25454;&#38598;&#65292;&#20854;&#20013;&#20135;&#21697;&#30340;&#20027;&#35201;&#35821;&#35328;&#26159;&#33521;&#35821;&#12289;&#24503;&#35821;&#12289;&#26085;&#35821;&#12289;&#27861;&#35821;&#12289;&#24847;&#22823;&#21033;&#35821;&#21644;&#35199;&#29677;&#29273;&#35821;&#12290;&#20540;&#24471;&#27880;&#24847;&#30340;&#26159;&#65292;&#36825;&#20010;&#25968;&#25454;&#38598;&#21487;&#20197;&#24110;&#21161;&#25105;&#20204;&#22686;&#24378;&#20010;&#24615;&#21270;&#21644;&#29702;&#35299;&#29992;&#25143;&#20559;&#22909;&#33021;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;
Modeling customer shopping intentions is a crucial task for e-commerce, as it directly impacts user experience and engagement. Thus, accurately understanding customer preferences is essential for providing personalized recommendations. Session-based recommendation, which utilizes customer session data to predict their next interaction, has become increasingly popular. However, existing session datasets have limitations in terms of item attributes, user diversity, and dataset scale. As a result, they cannot comprehensively capture the spectrum of user behaviors and preferences. To bridge this gap, we present the Amazon Multilingual Multi-locale Shopping Session Dataset, namely Amazon-M2. It is the first multilingual dataset consisting of millions of user sessions from six different locales, where the major languages of products are English, German, Japanese, French, Italian, and Spanish. Remarkably, the dataset can help us enhance personalization and understanding of user preferences, w
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#24635;&#32467;&#20102;&#29983;&#29289;&#21307;&#23398;&#25991;&#29486;&#26816;&#32034;&#39046;&#22495;&#30340;&#26368;&#26032;&#36827;&#23637;&#21644;&#26368;&#20339;&#23454;&#36341;&#65292;&#20171;&#32461;&#20102;&#38024;&#23545;&#19981;&#21516;&#29983;&#29289;&#21307;&#23398;&#20449;&#24687;&#38656;&#27714;&#30340;&#25991;&#29486;&#26816;&#32034;&#24037;&#20855;&#65292;&#24182;&#26088;&#22312;&#24110;&#21161;&#35835;&#32773;&#39640;&#25928;&#28385;&#36275;&#20854;&#20449;&#24687;&#38656;&#27714;&#12290;</title><link>http://arxiv.org/abs/2307.09683</link><description>&lt;p&gt;
PubMed&#21450;&#20854;&#20182;&#65306;&#29983;&#29289;&#21307;&#23398;&#25991;&#29486;&#26816;&#32034;&#30340;&#26368;&#26032;&#36827;&#23637;&#21644;&#26368;&#20339;&#23454;&#36341;
&lt;/p&gt;
&lt;p&gt;
PubMed and Beyond: Recent Advances and Best Practices in Biomedical Literature Search. (arXiv:2307.09683v1 [cs.IR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.09683
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#24635;&#32467;&#20102;&#29983;&#29289;&#21307;&#23398;&#25991;&#29486;&#26816;&#32034;&#39046;&#22495;&#30340;&#26368;&#26032;&#36827;&#23637;&#21644;&#26368;&#20339;&#23454;&#36341;&#65292;&#20171;&#32461;&#20102;&#38024;&#23545;&#19981;&#21516;&#29983;&#29289;&#21307;&#23398;&#20449;&#24687;&#38656;&#27714;&#30340;&#25991;&#29486;&#26816;&#32034;&#24037;&#20855;&#65292;&#24182;&#26088;&#22312;&#24110;&#21161;&#35835;&#32773;&#39640;&#25928;&#28385;&#36275;&#20854;&#20449;&#24687;&#38656;&#27714;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#29983;&#29289;&#21307;&#23398;&#30740;&#31350;&#20135;&#29983;&#20102;&#20016;&#23500;&#30340;&#20449;&#24687;&#65292;&#20854;&#20013;&#24456;&#22810;&#21482;&#33021;&#36890;&#36807;&#25991;&#29486;&#33719;&#21462;&#12290;&#22240;&#27492;&#65292;&#25991;&#29486;&#26816;&#32034;&#26159;&#20020;&#24202;&#21644;&#29983;&#29289;&#21307;&#23398;&#30740;&#31350;&#20013;&#24314;&#31435;&#22312;&#20808;&#21069;&#30693;&#35782;&#22522;&#30784;&#19978;&#30340;&#37325;&#35201;&#24037;&#20855;&#12290;&#23613;&#31649;&#20154;&#24037;&#26234;&#33021;&#30340;&#26368;&#26032;&#36827;&#23637;&#24050;&#32463;&#23558;&#21151;&#33021;&#25193;&#23637;&#21040;&#20102;&#36229;&#36234;&#22522;&#20110;&#20851;&#38190;&#23383;&#30340;&#25628;&#32034;&#65292;&#20294;&#36825;&#20123;&#36827;&#23637;&#21487;&#33021;&#23545;&#20020;&#24202;&#21307;&#29983;&#21644;&#30740;&#31350;&#20154;&#21592;&#26469;&#35828;&#36824;&#27604;&#36739;&#38476;&#29983;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#20123;&#29305;&#23450;&#20110;&#29983;&#29289;&#21307;&#23398;&#39046;&#22495;&#20449;&#24687;&#38656;&#27714;&#30340;&#25991;&#29486;&#26816;&#32034;&#24037;&#20855;&#65292;&#26088;&#22312;&#24110;&#21161;&#35835;&#32773;&#39640;&#25928;&#22320;&#28385;&#36275;&#20182;&#20204;&#30340;&#20449;&#24687;&#38656;&#27714;&#12290;&#25105;&#20204;&#39318;&#20808;&#23545;&#24191;&#27867;&#20351;&#29992;&#30340;PubMed&#25628;&#32034;&#24341;&#25806;&#36827;&#34892;&#20102;&#35752;&#35770;&#65292;&#21253;&#25324;&#26368;&#26032;&#30340;&#25913;&#36827;&#21644;&#20173;&#28982;&#23384;&#22312;&#30340;&#25361;&#25112;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#25551;&#36848;&#20102;&#20116;&#31181;&#29305;&#23450;&#20449;&#24687;&#38656;&#27714;&#30340;&#25991;&#29486;&#26816;&#32034;&#24037;&#20855;&#65306;1.&#20026;&#24490;&#35777;&#21307;&#23398;&#23547;&#25214;&#39640;&#36136;&#37327;&#20020;&#24202;&#30740;&#31350;&#12290;2.&#20026;&#31934;&#20934;&#21307;&#23398;&#21644;&#22522;&#22240;&#32452;&#23398;&#26816;&#32034;&#22522;&#22240;&#30456;&#20851;&#20449;&#24687;&#12290;3.&#26681;&#25454;&#24847;&#20041;&#25628;&#32034;&#12290;
&lt;/p&gt;
&lt;p&gt;
Biomedical research yields a wealth of information, much of which is only accessible through the literature. Consequently, literature search is an essential tool for building on prior knowledge in clinical and biomedical research. Although recent improvements in artificial intelligence have expanded functionality beyond keyword-based search, these advances may be unfamiliar to clinicians and researchers. In response, we present a survey of literature search tools tailored to both general and specific information needs in biomedicine, with the objective of helping readers efficiently fulfill their information needs. We first examine the widely used PubMed search engine, discussing recent improvements and continued challenges. We then describe literature search tools catering to five specific information needs: 1. Identifying high-quality clinical research for evidence-based medicine. 2. Retrieving gene-related information for precision medicine and genomics. 3. Searching by meaning, inc
&lt;/p&gt;</description></item><item><title>&#25552;&#20986;&#20102;&#19968;&#20010;&#21517;&#20026;NeuroSeqRet&#30340;&#27169;&#22411;&#65292;&#29992;&#20110;&#35299;&#20915;&#22823;&#35268;&#27169;&#26816;&#32034;&#36830;&#32493;&#26102;&#38388;&#20107;&#20214;&#24207;&#21015;&#30340;&#20219;&#21153;&#12290;&#36890;&#36807;&#20351;&#29992;&#21487;&#23398;&#20064;&#30340;&#21704;&#24076;&#21644;&#31070;&#32463;&#26102;&#38388;&#28857;&#36807;&#31243;&#65292;&#35813;&#27169;&#22411;&#33021;&#22815;&#20026;&#36755;&#20837;&#30340;&#26597;&#35810;&#24207;&#21015;&#36820;&#22238;&#19968;&#20010;&#30456;&#20851;&#24207;&#21015;&#30340;&#25490;&#24207;&#21015;&#34920;&#12290;</title><link>http://arxiv.org/abs/2307.09613</link><description>&lt;p&gt;
&#20351;&#29992;&#21487;&#23398;&#20064;&#30340;&#21704;&#24076;&#30340;&#31070;&#32463;&#26102;&#38388;&#28857;&#36807;&#31243;&#26816;&#32034;&#36830;&#32493;&#26102;&#38388;&#20107;&#20214;&#24207;&#21015;
&lt;/p&gt;
&lt;p&gt;
Retrieving Continuous Time Event Sequences using Neural Temporal Point Processes with Learnable Hashing. (arXiv:2307.09613v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.09613
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#20010;&#21517;&#20026;NeuroSeqRet&#30340;&#27169;&#22411;&#65292;&#29992;&#20110;&#35299;&#20915;&#22823;&#35268;&#27169;&#26816;&#32034;&#36830;&#32493;&#26102;&#38388;&#20107;&#20214;&#24207;&#21015;&#30340;&#20219;&#21153;&#12290;&#36890;&#36807;&#20351;&#29992;&#21487;&#23398;&#20064;&#30340;&#21704;&#24076;&#21644;&#31070;&#32463;&#26102;&#38388;&#28857;&#36807;&#31243;&#65292;&#35813;&#27169;&#22411;&#33021;&#22815;&#20026;&#36755;&#20837;&#30340;&#26597;&#35810;&#24207;&#21015;&#36820;&#22238;&#19968;&#20010;&#30456;&#20851;&#24207;&#21015;&#30340;&#25490;&#24207;&#21015;&#34920;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26102;&#38388;&#24207;&#21015;&#24050;&#32463;&#22312;&#21508;&#31181;&#23454;&#38469;&#24212;&#29992;&#20013;&#21464;&#24471;&#26222;&#36941;&#12290;&#22240;&#27492;&#65292;&#20197;&#36830;&#32493;&#26102;&#38388;&#20107;&#20214;&#24207;&#21015;&#65288;CTES&#65289;&#24418;&#24335;&#20135;&#29983;&#30340;&#25968;&#25454;&#37327;&#22312;&#36807;&#21435;&#20960;&#24180;&#20013;&#21576;&#25351;&#25968;&#22686;&#38271;&#12290;&#22240;&#27492;&#65292;&#38024;&#23545;CTES&#25968;&#25454;&#38598;&#30340;&#24403;&#21069;&#30740;&#31350;&#30340;&#37325;&#35201;&#37096;&#20998;&#26159;&#35774;&#35745;&#29992;&#20110;&#35299;&#20915;&#19979;&#28216;&#20219;&#21153;&#65288;&#22914;&#19979;&#19968;&#20010;&#20107;&#20214;&#39044;&#27979;&#12289;&#38271;&#26399;&#39044;&#27979;&#12289;&#24207;&#21015;&#20998;&#31867;&#31561;&#65289;&#30340;&#27169;&#22411;&#12290;&#20351;&#29992;&#26631;&#35760;&#30340;&#26102;&#38388;&#28857;&#36807;&#31243;&#65288;MTPP&#65289;&#36827;&#34892;&#39044;&#27979;&#24314;&#27169;&#30340;&#26368;&#26032;&#21457;&#23637;&#20351;&#24471;&#33021;&#22815;&#20934;&#30830;&#22320;&#23545;&#28041;&#21450;CTES&#30340;&#20960;&#20010;&#23454;&#38469;&#24212;&#29992;&#36827;&#34892;&#34920;&#24449;&#12290;&#28982;&#32780;&#65292;&#30001;&#20110;&#36825;&#20123;CTES&#25968;&#25454;&#38598;&#30340;&#22797;&#26434;&#24615;&#65292;&#36807;&#21435;&#30340;&#25991;&#29486;&#24573;&#35270;&#20102;&#22823;&#35268;&#27169;&#26816;&#32034;&#26102;&#38388;&#24207;&#21015;&#30340;&#20219;&#21153;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#36890;&#36807;CTES&#26816;&#32034;&#65292;&#25105;&#20204;&#25351;&#30340;&#26159;&#23545;&#20110;&#19968;&#20010;&#36755;&#20837;&#26597;&#35810;&#24207;&#21015;&#65292;&#26816;&#32034;&#31995;&#32479;&#24517;&#39035;&#20174;&#19968;&#20010;&#22823;&#30340;&#35821;&#26009;&#24211;&#20013;&#36820;&#22238;&#19968;&#20010;&#30456;&#20851;&#24207;&#21015;&#30340;&#25490;&#24207;&#21015;&#34920;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;NeuroSeqRet&#65292;&#36825;&#26159;&#19968;&#20010;&#20856;&#22411;&#30340;
&lt;/p&gt;
&lt;p&gt;
Temporal sequences have become pervasive in various real-world applications. Consequently, the volume of data generated in the form of continuous time-event sequence(s) or CTES(s) has increased exponentially in the past few years. Thus, a significant fraction of the ongoing research on CTES datasets involves designing models to address downstream tasks such as next-event prediction, long-term forecasting, sequence classification etc. The recent developments in predictive modeling using marked temporal point processes (MTPP) have enabled an accurate characterization of several real-world applications involving the CTESs. However, due to the complex nature of these CTES datasets, the task of large-scale retrieval of temporal sequences has been overlooked by the past literature. In detail, by CTES retrieval we mean that for an input query sequence, a retrieval system must return a ranked list of relevant sequences from a large corpus. To tackle this, we propose NeuroSeqRet, a first-of-its
&lt;/p&gt;</description></item><item><title>&#30740;&#31350;&#31639;&#27861;&#20013;&#31435;&#24615;&#20197;&#21450;&#19982;&#31639;&#27861;&#20559;&#35265;&#30340;&#20851;&#31995;&#65292;&#20197;&#25628;&#32034;&#24341;&#25806;&#20026;&#26696;&#20363;&#30740;&#31350;&#65292;&#24471;&#20986;&#25628;&#32034;&#20013;&#31435;&#24615;&#26159;&#19981;&#21487;&#33021;&#30340;&#32467;&#35770;&#12290;</title><link>http://arxiv.org/abs/2303.05103</link><description>&lt;p&gt;
&#31639;&#27861;&#20013;&#31435;&#24615;
&lt;/p&gt;
&lt;p&gt;
Algorithmic neutrality. (arXiv:2303.05103v2 [cs.CY] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.05103
&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#31639;&#27861;&#20013;&#31435;&#24615;&#20197;&#21450;&#19982;&#31639;&#27861;&#20559;&#35265;&#30340;&#20851;&#31995;&#65292;&#20197;&#25628;&#32034;&#24341;&#25806;&#20026;&#26696;&#20363;&#30740;&#31350;&#65292;&#24471;&#20986;&#25628;&#32034;&#20013;&#31435;&#24615;&#26159;&#19981;&#21487;&#33021;&#30340;&#32467;&#35770;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20559;&#35265;&#24433;&#21709;&#30528;&#36234;&#26469;&#36234;&#22810;&#25484;&#25511;&#25105;&#20204;&#29983;&#27963;&#30340;&#31639;&#27861;&#12290;&#39044;&#27979;&#24615;&#35686;&#21153;&#31995;&#32479;&#38169;&#35823;&#22320;&#39640;&#20272;&#26377;&#33394;&#20154;&#31181;&#31038;&#21306;&#30340;&#29359;&#32618;&#29575;&#65307;&#25307;&#32856;&#31639;&#27861;&#21066;&#24369;&#20102;&#21512;&#26684;&#30340;&#22899;&#24615;&#20505;&#36873;&#20154;&#30340;&#26426;&#20250;&#65307;&#20154;&#33080;&#35782;&#21035;&#36719;&#20214;&#38590;&#20197;&#35782;&#21035;&#40657;&#30382;&#32932;&#30340;&#38754;&#37096;&#12290;&#31639;&#27861;&#20559;&#35265;&#24050;&#32463;&#21463;&#21040;&#20102;&#37325;&#35270;&#65292;&#30456;&#27604;&#20043;&#19979;&#65292;&#31639;&#27861;&#20013;&#31435;&#24615;&#21364;&#22522;&#26412;&#34987;&#24573;&#35270;&#20102;&#12290;&#31639;&#27861;&#20013;&#31435;&#24615;&#26159;&#25105;&#30340;&#30740;&#31350;&#20027;&#39064;&#12290;&#25105;&#25552;&#20986;&#20102;&#19977;&#20010;&#38382;&#39064;&#12290;&#31639;&#27861;&#20013;&#31435;&#24615;&#26159;&#20160;&#20040;&#65311;&#31639;&#27861;&#20013;&#31435;&#24615;&#26159;&#21542;&#21487;&#33021;&#65311;&#24403;&#25105;&#20204;&#32771;&#34385;&#31639;&#27861;&#20013;&#31435;&#24615;&#26102;&#65292;&#25105;&#20204;&#21487;&#20197;&#20174;&#31639;&#27861;&#20559;&#35265;&#20013;&#23398;&#21040;&#20160;&#20040;&#65311;&#20026;&#20102;&#20855;&#20307;&#22238;&#31572;&#36825;&#20123;&#38382;&#39064;&#65292;&#25105;&#36873;&#25321;&#20102;&#19968;&#20010;&#26696;&#20363;&#30740;&#31350;&#65306;&#25628;&#32034;&#24341;&#25806;&#12290;&#20511;&#37492;&#20851;&#20110;&#31185;&#23398;&#20013;&#31435;&#24615;&#30340;&#30740;&#31350;&#65292;&#25105;&#35748;&#20026;&#21482;&#26377;&#24403;&#25628;&#32034;&#24341;&#25806;&#30340;&#25490;&#21517;&#19981;&#21463;&#26576;&#20123;&#20215;&#20540;&#35266;&#30340;&#24433;&#21709;&#26102;&#65292;&#25628;&#32034;&#24341;&#25806;&#25165;&#26159;&#20013;&#31435;&#30340;&#65292;&#27604;&#22914;&#25919;&#27835;&#24847;&#35782;&#24418;&#24577;&#25110;&#25628;&#32034;&#24341;&#25806;&#36816;&#33829;&#21830;&#30340;&#32463;&#27982;&#21033;&#30410;&#12290;&#25105;&#35748;&#20026;&#25628;&#32034;&#20013;&#31435;&#24615;&#26159;&#19981;&#21487;&#33021;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
Bias infects the algorithms that wield increasing control over our lives. Predictive policing systems overestimate crime in communities of color; hiring algorithms dock qualified female candidates; and facial recognition software struggles to recognize dark-skinned faces. Algorithmic bias has received significant attention. Algorithmic neutrality, in contrast, has been largely neglected. Algorithmic neutrality is my topic. I take up three questions. What is algorithmic neutrality? Is algorithmic neutrality possible? When we have algorithmic neutrality in mind, what can we learn about algorithmic bias? To answer these questions in concrete terms, I work with a case study: search engines. Drawing on work about neutrality in science, I say that a search engine is neutral only if certain values -- like political ideologies or the financial interests of the search engine operator -- play no role in how the search engine ranks pages. Search neutrality, I argue, is impossible. Its impossibili
&lt;/p&gt;</description></item><item><title>&#21487;&#20449;&#24230;&#25512;&#33616;&#31995;&#32479;&#30740;&#31350;&#24050;&#32463;&#20174;&#20197;&#20934;&#30830;&#24615;&#20026;&#23548;&#21521;&#36716;&#21464;&#20026;&#20197;&#36879;&#26126;&#12289;&#20844;&#27491;&#12289;&#31283;&#20581;&#24615;&#20026;&#29305;&#28857;&#30340;&#21487;&#20449;&#24230;&#25512;&#33616;&#31995;&#32479;&#12290;&#26412;&#25991;&#25552;&#20379;&#20102;&#21487;&#20449;&#24230;&#25512;&#33616;&#31995;&#32479;&#39046;&#22495;&#30340;&#25991;&#29486;&#32508;&#36848;&#21644;&#35752;&#35770;&#12290;</title><link>http://arxiv.org/abs/2208.06265</link><description>&lt;p&gt;
&#21487;&#20449;&#25512;&#33616;&#31995;&#32479;
&lt;/p&gt;
&lt;p&gt;
Trustworthy Recommender Systems. (arXiv:2208.06265v2 [cs.IR] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2208.06265
&lt;/p&gt;
&lt;p&gt;
&#21487;&#20449;&#24230;&#25512;&#33616;&#31995;&#32479;&#30740;&#31350;&#24050;&#32463;&#20174;&#20197;&#20934;&#30830;&#24615;&#20026;&#23548;&#21521;&#36716;&#21464;&#20026;&#20197;&#36879;&#26126;&#12289;&#20844;&#27491;&#12289;&#31283;&#20581;&#24615;&#20026;&#29305;&#28857;&#30340;&#21487;&#20449;&#24230;&#25512;&#33616;&#31995;&#32479;&#12290;&#26412;&#25991;&#25552;&#20379;&#20102;&#21487;&#20449;&#24230;&#25512;&#33616;&#31995;&#32479;&#39046;&#22495;&#30340;&#25991;&#29486;&#32508;&#36848;&#21644;&#35752;&#35770;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25512;&#33616;&#31995;&#32479;&#26088;&#22312;&#24110;&#21161;&#29992;&#25143;&#20174;&#24222;&#22823;&#30340;&#30446;&#24405;&#20013;&#26377;&#25928;&#22320;&#26816;&#32034;&#24863;&#20852;&#36259;&#30340;&#29289;&#21697;&#12290;&#38271;&#26399;&#20197;&#26469;&#65292;&#30740;&#31350;&#20154;&#21592;&#19968;&#30452;&#33268;&#21147;&#20110;&#24320;&#21457;&#20934;&#30830;&#30340;&#25512;&#33616;&#31995;&#32479;&#12290;&#28982;&#32780;&#65292;&#36817;&#24180;&#26469;&#65292;&#25512;&#33616;&#31995;&#32479;&#38754;&#20020;&#36234;&#26469;&#36234;&#22810;&#30340;&#23041;&#32961;&#65292;&#21253;&#25324;&#26469;&#33258;&#25915;&#20987;&#12289;&#31995;&#32479;&#21644;&#29992;&#25143;&#20135;&#29983;&#30340;&#24178;&#25200;&#20197;&#21450;&#31995;&#32479;&#30340;&#20559;&#35265;&#12290;&#22240;&#27492;&#65292;&#20165;&#20165;&#20851;&#27880;&#20934;&#30830;&#24615;&#24050;&#32463;&#19981;&#22815;&#65292;&#30740;&#31350;&#24517;&#39035;&#32771;&#34385;&#20854;&#20182;&#37325;&#35201;&#22240;&#32032;&#65292;&#22914;&#21487;&#20449;&#24230;&#12290;&#23545;&#20110;&#32456;&#31471;&#29992;&#25143;&#26469;&#35828;&#65292;&#19968;&#20010;&#20540;&#24471;&#20449;&#36182;&#30340;&#25512;&#33616;&#31995;&#32479;&#19981;&#20165;&#35201;&#20934;&#30830;&#65292;&#32780;&#19988;&#36824;&#35201;&#36879;&#26126;&#12289;&#26080;&#20559;&#35265;&#12289;&#20844;&#27491;&#65292;&#24182;&#19988;&#23545;&#24178;&#25200;&#25110;&#25915;&#20987;&#20855;&#26377;&#31283;&#20581;&#24615;&#12290;&#36825;&#20123;&#35266;&#23519;&#23454;&#38469;&#19978;&#23548;&#33268;&#20102;&#25512;&#33616;&#31995;&#32479;&#30740;&#31350;&#30340;&#33539;&#24335;&#36716;&#21464;: &#20174;&#20197;&#20934;&#30830;&#24615;&#20026;&#23548;&#21521;&#30340;&#25512;&#33616;&#31995;&#32479;&#36716;&#21521;&#20102;&#20197;&#21487;&#20449;&#24230;&#20026;&#23548;&#21521;&#30340;&#25512;&#33616;&#31995;&#32479;&#12290;&#28982;&#32780;&#65292;&#30740;&#31350;&#20154;&#21592;&#32570;&#20047;&#23545;&#21487;&#20449;&#24230;&#25512;&#33616;&#31995;&#32479;&#39046;&#22495;&#30340;&#25991;&#29486;&#30340;&#31995;&#32479;&#27010;&#36848;&#21644;&#35752;&#35770;&#12290;&#22240;&#27492;&#65292;&#26412;&#25991;&#25552;&#20379;&#20102;&#21487;&#20449;&#24230;&#25512;&#33616;&#31995;&#32479;&#30340;&#27010;&#36848;&#65292;&#21253;&#25324;&#23545;&#35813;&#26032;&#20852;&#19988;&#24555;&#36895;&#21457;&#23637;&#39046;&#22495;&#30340;&#25991;&#29486;&#30340;&#35752;&#35770;&#12290;
&lt;/p&gt;
&lt;p&gt;
Recommender systems (RSs) aim to help users to effectively retrieve items of their interests from a large catalogue. For a quite long period of time, researchers and practitioners have been focusing on developing accurate RSs. Recent years have witnessed an increasing number of threats to RSs, coming from attacks, system and user generated noise, system bias. As a result, it has become clear that a strict focus on RS accuracy is limited and the research must consider other important factors, e.g., trustworthiness. For end users, a trustworthy RS (TRS) should not only be accurate, but also transparent, unbiased and fair as well as robust to noise or attacks. These observations actually led to a paradigm shift of the research on RSs: from accuracy-oriented RSs to TRSs. However, researchers lack a systematic overview and discussion of the literature in this novel and fast developing field of TRSs. To this end, in this paper, we provide an overview of TRSs, including a discussion of the mo
&lt;/p&gt;</description></item></channel></rss>