<rss version="2.0"><channel><title>Chat Arxiv cs.IR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.IR</description><item><title>EasyRL4Rec&#26159;&#19968;&#20010;&#38754;&#21521;&#22522;&#20110;&#24378;&#21270;&#23398;&#20064;&#30340;&#25512;&#33616;&#31995;&#32479;&#30340;&#29992;&#25143;&#21451;&#22909;&#21644;&#39640;&#25928;&#24211;&#65292;&#25552;&#20379;&#20102;&#22810;&#26679;&#21270;&#30340;RL&#29615;&#22659;&#12289;&#20840;&#38754;&#30340;&#26680;&#24515;&#27169;&#22359;&#12289;&#19968;&#33268;&#30340;&#35780;&#20272;&#26631;&#20934;&#21644;&#23450;&#21046;&#35299;&#20915;&#26041;&#26696;&#65292;&#26088;&#22312;&#24110;&#21161;&#31616;&#21270;&#27169;&#22411;&#24320;&#21457;&#24182;&#25913;&#21892;&#38271;&#26399;&#29992;&#25143;&#21442;&#19982;&#24230;&#12290;</title><link>https://arxiv.org/abs/2402.15164</link><description>&lt;p&gt;
EasyRL4Rec&#65306;&#38754;&#21521;&#22522;&#20110;&#24378;&#21270;&#23398;&#20064;&#30340;&#25512;&#33616;&#31995;&#32479;&#30340;&#29992;&#25143;&#21451;&#22909;&#20195;&#30721;&#24211;
&lt;/p&gt;
&lt;p&gt;
EasyRL4Rec: A User-Friendly Code Library for Reinforcement Learning Based Recommender Systems
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.15164
&lt;/p&gt;
&lt;p&gt;
EasyRL4Rec&#26159;&#19968;&#20010;&#38754;&#21521;&#22522;&#20110;&#24378;&#21270;&#23398;&#20064;&#30340;&#25512;&#33616;&#31995;&#32479;&#30340;&#29992;&#25143;&#21451;&#22909;&#21644;&#39640;&#25928;&#24211;&#65292;&#25552;&#20379;&#20102;&#22810;&#26679;&#21270;&#30340;RL&#29615;&#22659;&#12289;&#20840;&#38754;&#30340;&#26680;&#24515;&#27169;&#22359;&#12289;&#19968;&#33268;&#30340;&#35780;&#20272;&#26631;&#20934;&#21644;&#23450;&#21046;&#35299;&#20915;&#26041;&#26696;&#65292;&#26088;&#22312;&#24110;&#21161;&#31616;&#21270;&#27169;&#22411;&#24320;&#21457;&#24182;&#25913;&#21892;&#38271;&#26399;&#29992;&#25143;&#21442;&#19982;&#24230;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24378;&#21270;&#23398;&#20064;&#65288;RL&#65289;-&#22522;&#30784;&#30340;&#25512;&#33616;&#31995;&#32479;&#65288;RSs&#65289;&#36234;&#26469;&#36234;&#34987;&#35748;&#21487;&#20854;&#25552;&#39640;&#38271;&#26399;&#29992;&#25143;&#21442;&#19982;&#24230;&#30340;&#33021;&#21147;&#12290;&#28982;&#32780;&#65292;&#36825;&#20010;&#39046;&#22495;&#38754;&#20020;&#25361;&#25112;&#65292;&#22914;&#32570;&#20047;&#26131;&#29992;&#30340;&#26694;&#26550;&#12289;&#35780;&#20272;&#26631;&#20934;&#19981;&#19968;&#33268;&#20197;&#21450;&#22797;&#21046;&#20197;&#21069;&#30340;&#24037;&#20316;&#30340;&#22797;&#26434;&#24615;&#12290;&#20026;&#35299;&#20915;&#36825;&#20123;&#38556;&#30861;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;EasyRL4Rec&#65292;&#19968;&#20010;&#19987;&#20026;&#22522;&#20110;RL&#30340;RSs&#37327;&#36523;&#23450;&#21046;&#30340;&#29992;&#25143;&#21451;&#22909;&#21644;&#39640;&#25928;&#30340;&#24211;&#12290;EasyRL4Rec&#20855;&#26377;&#22522;&#20110;&#20116;&#20010;&#24191;&#27867;&#20351;&#29992;&#30340;&#20844;&#20849;&#25968;&#25454;&#38598;&#26500;&#24314;&#30340;&#36731;&#37327;&#32423;&#12289;&#22810;&#26679;&#21270;&#30340;RL&#29615;&#22659;&#65292;&#24182;&#37197;&#22791;&#20102;&#20840;&#38754;&#30340;&#26680;&#24515;&#27169;&#22359;&#65292;&#25552;&#20379;&#20016;&#23500;&#30340;&#36873;&#39033;&#26469;&#31616;&#21270;&#27169;&#22411;&#30340;&#24320;&#21457;&#12290;&#23427;&#24314;&#31435;&#20102;&#19968;&#33268;&#30340;&#35780;&#20272;&#26631;&#20934;&#65292;&#37325;&#28857;&#20851;&#27880;&#38271;&#26399;&#24433;&#21709;&#65292;&#24182;&#24341;&#20837;&#20102;&#38024;&#23545;&#25512;&#33616;&#31995;&#32479;&#23450;&#21046;&#30340;&#29366;&#24577;&#24314;&#27169;&#21644;&#34892;&#20026;&#34920;&#31034;&#30340;&#23450;&#21046;&#35299;&#20915;&#26041;&#26696;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#20998;&#20139;&#20102;&#36890;&#36807;&#19982;&#24403;&#21069;&#26041;&#27861;&#36827;&#34892;&#30340;&#22823;&#37327;&#23454;&#39564;&#33719;&#24471;&#30340;&#23453;&#36149;&#35265;&#35299;&#12290;EasyRL4Rec&#26088;&#22312;&#20419;&#36827;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.15164v1 Announce Type: cross  Abstract: Reinforcement Learning (RL)-Based Recommender Systems (RSs) are increasingly recognized for their ability to improve long-term user engagement. Yet, the field grapples with challenges such as the absence of accessible frameworks, inconsistent evaluation standards, and the complexity of replicating prior work. Addressing these obstacles, we present EasyRL4Rec, a user-friendly and efficient library tailored for RL-based RSs. EasyRL4Rec features lightweight, diverse RL environments built on five widely-used public datasets, and is equipped with comprehensive core modules that offer rich options to ease the development of models. It establishes consistent evaluation criteria with a focus on long-term impacts and introduces customized solutions for state modeling and action representation tailored to recommender systems. Additionally, we share valuable insights gained from extensive experiments with current methods. EasyRL4Rec aims to facil
&lt;/p&gt;</description></item><item><title>&#36825;&#39033;&#30740;&#31350;&#25193;&#23637;&#20102;AI&#25945;&#36741;Kwame&#65292;&#38754;&#21521;&#35199;&#38750;&#31185;&#23398;&#25945;&#32946;&#65292;&#24182;&#23558;&#20854;&#20316;&#20026;&#19968;&#20010;&#32593;&#32476;&#24212;&#29992;&#31243;&#24207;&#36827;&#34892;&#20102;&#23454;&#38469;&#37096;&#32626;&#21644;&#35780;&#20272;&#12290;&#32467;&#26524;&#26174;&#31034;&#65292;&#22312;&#23454;&#38469;&#29615;&#22659;&#20013;&#65292;Kwame for Science&#21462;&#24471;&#20102;&#24456;&#39640;&#30340;&#20934;&#30830;&#29575;&#65292;&#24182;&#19988;&#33719;&#24471;&#20102;&#24191;&#27867;&#30340;&#29992;&#25143;&#21644;&#38382;&#39064;&#25552;&#38382;&#37327;&#12290;</title><link>https://arxiv.org/abs/2302.10786</link><description>&lt;p&gt;
&#38754;&#21521;&#35199;&#38750;&#31185;&#23398;&#25945;&#32946;&#30340;AI&#25945;&#36741;Kwame&#30340;&#29616;&#23454;&#19990;&#30028;&#37096;&#32626;&#21644;&#35780;&#20272;
&lt;/p&gt;
&lt;p&gt;
Real-World Deployment and Evaluation of Kwame for Science, An AI Teaching Assistant for Science Education in West Africa
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2302.10786
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#30740;&#31350;&#25193;&#23637;&#20102;AI&#25945;&#36741;Kwame&#65292;&#38754;&#21521;&#35199;&#38750;&#31185;&#23398;&#25945;&#32946;&#65292;&#24182;&#23558;&#20854;&#20316;&#20026;&#19968;&#20010;&#32593;&#32476;&#24212;&#29992;&#31243;&#24207;&#36827;&#34892;&#20102;&#23454;&#38469;&#37096;&#32626;&#21644;&#35780;&#20272;&#12290;&#32467;&#26524;&#26174;&#31034;&#65292;&#22312;&#23454;&#38469;&#29615;&#22659;&#20013;&#65292;Kwame for Science&#21462;&#24471;&#20102;&#24456;&#39640;&#30340;&#20934;&#30830;&#29575;&#65292;&#24182;&#19988;&#33719;&#24471;&#20102;&#24191;&#27867;&#30340;&#29992;&#25143;&#21644;&#38382;&#39064;&#25552;&#38382;&#37327;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38750;&#27954;&#25945;&#24072;&#19982;&#23398;&#29983;&#30340;&#27604;&#20363;&#39640;&#65292;&#36825;&#38480;&#21046;&#20102;&#23398;&#29983;&#20204;&#33719;&#21462;&#25945;&#32946;&#38382;&#39064;&#35299;&#31572;&#31561;&#23398;&#20064;&#25903;&#25345;&#30340;&#26426;&#20250;&#12290;&#26412;&#30740;&#31350;&#23558;&#38754;&#21521;&#32534;&#30721;&#25945;&#32946;&#30340;AI&#25945;&#36741;Kwame&#25193;&#23637;&#20026;&#38754;&#21521;&#31185;&#23398;&#25945;&#32946;&#65292;&#24182;&#23558;&#20854;&#37096;&#32626;&#20026;&#19968;&#20010;&#32593;&#32476;&#24212;&#29992;&#31243;&#24207;&#12290;Kwame for Science&#36890;&#36807;&#25552;&#20379;&#26469;&#33258;&#31934;&#36873;&#30693;&#35782;&#26469;&#28304;&#30340;&#27573;&#33853;&#20197;&#21450;&#22522;&#20110;&#35199;&#38750;&#39640;&#32423;&#20013;&#23398;&#35777;&#20070;&#32771;&#35797;&#65288;WASSCE&#65289;&#30340;&#32508;&#21512;&#31185;&#23398;&#31185;&#30446;&#30340;&#30456;&#20851;&#36807;&#21435;&#30340;&#22269;&#23478;&#32771;&#35797;&#38382;&#39064;&#30340;&#31572;&#26696;&#26469;&#22238;&#31572;&#23398;&#29983;&#20204;&#30340;&#38382;&#39064;&#12290;&#27492;&#22806;&#65292;&#23398;&#29983;&#20204;&#36824;&#21487;&#20197;&#26597;&#30475;&#36807;&#21435;&#30340;&#22269;&#23478;&#32771;&#35797;&#38382;&#39064;&#21450;&#20854;&#31572;&#26696;&#65292;&#24182;&#36890;&#36807;&#25105;&#20204;&#24320;&#21457;&#30340;&#20027;&#39064;&#26816;&#27979;&#27169;&#22411;&#36827;&#34892;&#25353;&#24180;&#20221;&#12289;&#38382;&#39064;&#31867;&#22411;&#21644;&#20027;&#39064;&#30340;&#33258;&#21160;&#20998;&#31867;&#65288;91%&#38750;&#21152;&#26435;&#24179;&#22343;&#21484;&#22238;&#29575;&#65289;&#12290;&#25105;&#20204;&#22312;&#23454;&#38469;&#29615;&#22659;&#20013;&#37096;&#32626;&#20102;Kwame for Science&#36229;&#36807;8&#20010;&#26376;&#65292;&#26377;&#26469;&#33258;32&#20010;&#22269;&#23478;&#65288;&#20854;&#20013;15&#20010;&#22312;&#38750;&#27954;&#65289;&#30340;750&#20010;&#29992;&#25143;&#65292;&#20849;&#25552;&#20986;&#20102;1.5K&#30340;&#38382;&#39064;&#12290;&#25105;&#20204;&#30340;&#35780;&#20272;&#32467;&#26524;&#26174;&#31034;&#65292;87.2%&#30340;&#21069;&#19977;&#21517;&#38382;&#39064;&#20934;&#30830;&#29575;&#65288;n=109&#65289;&#12290;
&lt;/p&gt;
&lt;p&gt;
Africa has a high student-to-teacher ratio which limits students' access to teachers for learning support such as educational question answering. In this work, we extended Kwame, a bilingual AI teaching assistant for coding education, adapted it for science education, and deployed it as a web app. Kwame for Science provides passages from well-curated knowledge sources and related past national exam questions as answers to questions from students based on the Integrated Science subject of the West African Senior Secondary Certificate Examination (WASSCE). Furthermore, students can view past national exam questions along with their answers and filter by year, question type, and topics that were automatically categorized by a topic detection model which we developed (91% unweighted average recall). We deployed Kwame for Science in the real world over 8 months and had 750 users across 32 countries (15 in Africa) and 1.5K questions asked. Our evaluation showed an 87.2% top 3 accuracy (n=109
&lt;/p&gt;</description></item><item><title>&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#25552;&#31034;&#30340;&#22810;&#20852;&#36259;&#23398;&#20064;&#26041;&#27861;&#65288;PoMRec&#65289;&#65292;&#29992;&#20110;&#39034;&#24207;&#25512;&#33616;&#12290;&#35813;&#26041;&#27861;&#36890;&#36807;&#21033;&#29992;&#20855;&#20307;&#30340;&#25552;&#31034;&#26469;&#25351;&#23548;&#20852;&#36259;&#25552;&#21462;&#21644;&#26435;&#37325;&#39044;&#27979;&#27169;&#22359;&#30340;&#23398;&#20064;&#65292;&#20197;&#20811;&#26381;&#29616;&#26377;&#26041;&#27861;&#20013;&#23384;&#22312;&#30340;&#38480;&#21046;&#12290;</title><link>http://arxiv.org/abs/2401.04312</link><description>&lt;p&gt;
&#22522;&#20110;&#25552;&#31034;&#30340;&#22810;&#20852;&#36259;&#23398;&#20064;&#26041;&#27861;&#29992;&#20110;&#39034;&#24207;&#25512;&#33616;
&lt;/p&gt;
&lt;p&gt;
Prompt-based Multi-interest Learning Method for Sequential Recommendation. (arXiv:2401.04312v1 [cs.IR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.04312
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#25552;&#31034;&#30340;&#22810;&#20852;&#36259;&#23398;&#20064;&#26041;&#27861;&#65288;PoMRec&#65289;&#65292;&#29992;&#20110;&#39034;&#24207;&#25512;&#33616;&#12290;&#35813;&#26041;&#27861;&#36890;&#36807;&#21033;&#29992;&#20855;&#20307;&#30340;&#25552;&#31034;&#26469;&#25351;&#23548;&#20852;&#36259;&#25552;&#21462;&#21644;&#26435;&#37325;&#39044;&#27979;&#27169;&#22359;&#30340;&#23398;&#20064;&#65292;&#20197;&#20811;&#26381;&#29616;&#26377;&#26041;&#27861;&#20013;&#23384;&#22312;&#30340;&#38480;&#21046;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#39034;&#24207;&#25512;&#33616;&#30340;&#22810;&#20852;&#36259;&#23398;&#20064;&#26041;&#27861;&#26088;&#22312;&#26681;&#25454;&#29992;&#25143;&#30340;&#22810;&#26041;&#38754;&#20852;&#36259;&#39044;&#27979;&#19979;&#19968;&#20010;&#39033;&#30446;&#65292;&#32473;&#23450;&#29992;&#25143;&#30340;&#21382;&#21490;&#20114;&#21160;&#12290;&#29616;&#26377;&#26041;&#27861;&#20027;&#35201;&#30001;&#20004;&#20010;&#27169;&#22359;&#32452;&#25104;&#65306;&#22810;&#20852;&#36259;&#25552;&#21462;&#27169;&#22359;&#23398;&#20064;&#29992;&#25143;&#30340;&#22810;&#20852;&#36259;&#23884;&#20837;&#20197;&#25429;&#25417;&#29992;&#25143;&#22810;&#20852;&#36259;&#65292;&#22810;&#20852;&#36259;&#26435;&#37325;&#39044;&#27979;&#27169;&#22359;&#23398;&#20064;&#27599;&#20010;&#20852;&#36259;&#30340;&#26435;&#37325;&#65292;&#20197;&#32858;&#21512;&#23398;&#20064;&#21040;&#30340;&#22810;&#20852;&#36259;&#23884;&#20837;&#20197;&#24471;&#21040;&#29992;&#25143;&#23884;&#20837;&#65292;&#29992;&#20110;&#39044;&#27979;&#29992;&#25143;&#23545;&#39033;&#30446;&#30340;&#35780;&#20998;&#12290;&#23613;&#31649;&#36825;&#20123;&#26041;&#27861;&#24456;&#26377;&#25928;&#65292;&#20294;&#23384;&#22312;&#20004;&#20010;&#20027;&#35201;&#38480;&#21046;&#65306;1)&#23427;&#20204;&#30452;&#25509;&#23558;&#29992;&#25143;&#20114;&#21160;&#36755;&#20837;&#20004;&#20010;&#27169;&#22359;&#20013;&#65292;&#32780;&#24573;&#30053;&#20102;&#23427;&#20204;&#19981;&#21516;&#30340;&#23398;&#20064;&#30446;&#26631;&#65307;2)&#23427;&#20204;&#20165;&#32771;&#34385;&#29992;&#25143;&#20114;&#21160;&#30340;&#20013;&#24515;&#24615;&#26469;&#23398;&#20064;&#29992;&#25143;&#30340;&#22810;&#20852;&#36259;&#65292;&#24573;&#35270;&#20102;&#23427;&#20204;&#30340;&#31163;&#25955;&#24615;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20123;&#38480;&#21046;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#25552;&#31034;&#30340;&#22810;&#20852;&#36259;&#23398;&#20064;&#26041;&#27861;&#65288;PoMRec&#65289;&#65292;&#20854;&#20013;&#20855;&#20307;&#30340;&#25552;&#31034;&#34987;&#29992;&#26469;&#25351;&#23548;&#22810;&#20852;&#36259;&#23884;&#20837;&#27169;&#22359;&#21644;&#22810;&#20852;&#36259;&#26435;&#37325;&#39044;&#27979;&#27169;&#22359;&#30340;&#23398;&#20064;&#12290;
&lt;/p&gt;
&lt;p&gt;
Multi-interest learning method for sequential recommendation aims to predict the next item according to user multi-faceted interests given the user historical interactions. Existing methods mainly consist of two modules: the multi-interest extraction module that learns user multi-interest embeddings to capture the user multi-interests, and the multi-interest weight prediction module that learns the weight of each interest for aggregating the learned multi-interest embeddings to derive the user embedding, used for predicting the user rating to an item. Despite their effectiveness, existing methods have two key limitations: 1) they directly feed the user interactions into the two modules, while ignoring their different learning objectives, and 2) they merely consider the centrality of the user interactions to learn the user multi-interests, while overlooking their dispersion. To tackle these limitations, we propose a prompt-based multi-interest learning method (PoMRec), where specific pr
&lt;/p&gt;</description></item></channel></rss>