<rss version="2.0"><channel><title>Chat Arxiv cs.IR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.IR</description><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;HGCC&#30340;&#21327;&#21516;&#36807;&#28388;&#27169;&#22411;&#65292;&#23427;&#36890;&#36807;&#28155;&#21152;&#24130;&#24459;&#20559;&#24046;&#26469;&#20445;&#25345;&#21327;&#21516;&#22270;&#30340;&#38271;&#23614;&#24615;&#36136;&#65292;&#24182;&#30452;&#25509;&#32858;&#21512;&#37051;&#23621;&#33410;&#28857;&#65292;&#20197;&#25552;&#39640;&#25512;&#33616;&#24615;&#33021;&#12290;</title><link>http://arxiv.org/abs/2304.02961</link><description>&lt;p&gt;
HGCC&#65306;&#25552;&#39640;&#24322;&#26500;&#21327;&#21516;&#22270;&#19978;&#30340;&#36229;&#20960;&#20309;&#22270;&#21367;&#31215;&#32593;&#32476;&#29992;&#20110;&#25512;&#33616;
&lt;/p&gt;
&lt;p&gt;
HGCC: Enhancing Hyperbolic Graph Convolution Networks on Heterogeneous Collaborative Graph for Recommendation. (arXiv:2304.02961v1 [cs.IR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.02961
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;HGCC&#30340;&#21327;&#21516;&#36807;&#28388;&#27169;&#22411;&#65292;&#23427;&#36890;&#36807;&#28155;&#21152;&#24130;&#24459;&#20559;&#24046;&#26469;&#20445;&#25345;&#21327;&#21516;&#22270;&#30340;&#38271;&#23614;&#24615;&#36136;&#65292;&#24182;&#30452;&#25509;&#32858;&#21512;&#37051;&#23621;&#33410;&#28857;&#65292;&#20197;&#25552;&#39640;&#25512;&#33616;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#30001;&#20110;&#25512;&#33616;&#20219;&#21153;&#20013;&#29992;&#25143;-&#29289;&#21697;&#20132;&#20114;&#25968;&#25454;&#30340;&#33258;&#28982;&#24130;&#24459;&#20998;&#24067;&#29305;&#24615;&#65292;&#36229;&#20960;&#20309;&#31354;&#38388;&#24314;&#27169;&#24050;&#34987;&#24341;&#20837;&#21327;&#21516;&#36807;&#28388;&#26041;&#27861;&#20013;&#12290;&#20854;&#20013;&#65292;&#36229;&#20960;&#20309;GCN&#32467;&#21512;&#20102;GCN&#21644;&#36229;&#20960;&#20309;&#31354;&#38388;&#30340;&#20248;&#21183;&#65292;&#24182;&#21462;&#24471;&#20102;&#20196;&#20154;&#24778;&#35766;&#30340;&#24615;&#33021;&#12290;&#28982;&#32780;&#65292;&#36825;&#20123;&#26041;&#27861;&#20165;&#22312;&#35774;&#35745;&#20013;&#37096;&#20998;&#21033;&#29992;&#20102;&#36229;&#20960;&#20309;&#31354;&#38388;&#30340;&#29305;&#24615;&#65292;&#30001;&#20110;&#23436;&#20840;&#38543;&#26426;&#30340;&#23884;&#20837;&#21021;&#22987;&#21270;&#21644;&#19981;&#31934;&#30830;&#30340;&#20999;&#32447;&#31354;&#38388;&#32858;&#21512;&#12290;&#27492;&#22806;&#65292;&#36825;&#20123;&#24037;&#20316;&#20013;&#20351;&#29992;&#30340;&#25968;&#25454;&#20027;&#35201;&#38598;&#20013;&#22312;&#20165;&#29992;&#25143;-&#29289;&#21697;&#20132;&#20114;&#25968;&#25454;&#20013;&#65292;&#36825;&#36827;&#19968;&#27493;&#38480;&#21046;&#20102;&#27169;&#22411;&#30340;&#24615;&#33021;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#36229;&#20960;&#20309;GCN&#21327;&#21516;&#36807;&#28388;&#27169;&#22411;HGCC&#65292;&#23427;&#25913;&#36827;&#20102;&#29616;&#26377;&#30340;&#36229;&#20960;&#20309;GCN&#32467;&#26500;&#65292;&#29992;&#20110;&#21327;&#21516;&#36807;&#28388;&#24182;&#32435;&#20837;&#20102;&#38468;&#21152;&#20449;&#24687;&#12290;&#23427;&#36890;&#36807;&#22312;&#33410;&#28857;&#23884;&#20837;&#21021;&#22987;&#21270;&#26102;&#28155;&#21152;&#24130;&#24459;&#20559;&#24046;&#26469;&#20445;&#25345;&#21327;&#21516;&#22270;&#30340;&#38271;&#23614;&#24615;&#36136;&#65307;&#28982;&#21518;&#65292;&#23427;&#30452;&#25509;&#32858;&#21512;&#37051;&#23621;&#33410;&#28857;&#65292;&#20197;&#25552;&#39640;&#25512;&#33616;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;
Due to the naturally power-law distributed nature of user-item interaction data in recommendation tasks, hyperbolic space modeling has recently been introduced into collaborative filtering methods. Among them, hyperbolic GCN combines the advantages of GCN and hyperbolic space and achieves a surprising performance. However, these methods only partially exploit the nature of hyperbolic space in their designs due to completely random embedding initialization and an inaccurate tangent space aggregation. In addition, the data used in these works mainly focus on user-item interaction data only, which further limits the performance of the models. In this paper, we propose a hyperbolic GCN collaborative filtering model, HGCC, which improves the existing hyperbolic GCN structure for collaborative filtering and incorporates side information. It keeps the long-tailed nature of the collaborative graph by adding power law prior to node embedding initialization; then, it aggregates neighbors directl
&lt;/p&gt;</description></item></channel></rss>