<rss version="2.0"><channel><title>Chat Arxiv cs.IR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.IR</description><item><title>&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;REAR&#30340;&#26032;&#26041;&#27861;&#65292;&#26088;&#22312;&#35299;&#20915;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#22312;&#26816;&#32034;&#22686;&#24378;&#29983;&#25104;&#20013;&#26080;&#27861;&#20934;&#30830;&#35780;&#20272;&#26816;&#32034;&#25991;&#26723;&#30456;&#20851;&#24615;&#30340;&#38382;&#39064;&#65292;&#36890;&#36807;&#22686;&#24378;&#23545;&#26816;&#32034;&#25991;&#26723;&#30456;&#20851;&#24615;&#30340;&#33258;&#25105;&#24847;&#35782;&#65292;&#33021;&#22815;&#33258;&#36866;&#24212;&#22320;&#21033;&#29992;&#22806;&#37096;&#30693;&#35782;&#12290;</title><link>https://arxiv.org/abs/2402.17497</link><description>&lt;p&gt;
REAR&#65306;&#19968;&#31181;&#38754;&#21521;&#24320;&#25918;&#22495;&#38382;&#31572;&#30340;&#20851;&#27880;&#24230;&#24863;&#30693;&#26816;&#32034;&#22686;&#24378;&#26694;&#26550;
&lt;/p&gt;
&lt;p&gt;
REAR: A Relevance-Aware Retrieval-Augmented Framework for Open-Domain Question Answering
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.17497
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;REAR&#30340;&#26032;&#26041;&#27861;&#65292;&#26088;&#22312;&#35299;&#20915;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#22312;&#26816;&#32034;&#22686;&#24378;&#29983;&#25104;&#20013;&#26080;&#27861;&#20934;&#30830;&#35780;&#20272;&#26816;&#32034;&#25991;&#26723;&#30456;&#20851;&#24615;&#30340;&#38382;&#39064;&#65292;&#36890;&#36807;&#22686;&#24378;&#23545;&#26816;&#32034;&#25991;&#26723;&#30456;&#20851;&#24615;&#30340;&#33258;&#25105;&#24847;&#35782;&#65292;&#33021;&#22815;&#33258;&#36866;&#24212;&#22320;&#21033;&#29992;&#22806;&#37096;&#30693;&#35782;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#32771;&#34385;&#21040;&#26377;&#38480;&#30340;&#20869;&#37096;&#21442;&#25968;&#21270;&#30693;&#35782;&#65292;&#26816;&#32034;&#22686;&#24378;&#29983;&#25104;&#65288;RAG&#65289;&#34987;&#24191;&#27867;&#29992;&#20110;&#25193;&#23637;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLMs&#65289;&#30340;&#30693;&#35782;&#33539;&#22260;&#12290;&#23613;&#31649;&#22312;RAG&#30740;&#31350;&#19978;&#36827;&#34892;&#20102;&#22823;&#37327;&#21162;&#21147;&#65292;&#20294;&#22312;&#29616;&#26377;&#26041;&#27861;&#20013;&#65292;LLMs &#26080;&#27861;&#20934;&#30830;&#35780;&#20272;&#26816;&#32034;&#25991;&#26723;&#30340;&#30456;&#20851;&#24615;&#65292;&#22240;&#27492;&#24456;&#21487;&#33021;&#23548;&#33268;&#23545;&#22806;&#37096;&#30693;&#35782;&#65288;&#21363;&#26816;&#32034;&#25991;&#26723;&#65289;&#30340;&#35823;&#23548;&#29978;&#33267;&#38169;&#35823;&#21033;&#29992;&#12290;&#20026;&#35299;&#20915;&#36825;&#19968;&#38382;&#39064;&#65292;&#26412;&#25991;&#25552;&#20986;&#20102; REAR&#65292;&#19968;&#31181;&#38754;&#21521;&#24320;&#25918;&#22495;&#38382;&#31572;&#65288;QA&#65289;&#30340;&#20851;&#27880;&#24230;&#24863;&#30693;&#26816;&#32034;&#22686;&#24378;&#26041;&#27861;&#12290;&#20316;&#20026;&#20851;&#38190;&#21160;&#26426;&#65292;&#25105;&#20204;&#26088;&#22312;&#22686;&#24378;LLMs&#23545;&#26469;&#28304;&#30456;&#20851;&#24615;&#30340;&#33258;&#25105;&#24847;&#35782;&#65292;&#20197;&#20415;&#22312;RAG&#31995;&#32479;&#20013;&#33258;&#36866;&#24212;&#22320;&#21033;&#29992;&#22806;&#37096;&#30693;&#35782;&#12290;&#29305;&#21035;&#26159;&#65292;&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#31181;&#26032;&#30340;&#22522;&#20110;LLM&#30340;RAG&#31995;&#32479;&#26550;&#26500;&#65292;&#36890;&#36807;&#25972;&#21512;&#19968;&#20010;&#31934;&#30830;&#35780;&#20272;&#26816;&#32034;&#25991;&#26723;&#30456;&#20851;&#24615;&#30340;&#29305;&#21035;&#35774;&#35745;&#30340;&#25490;&#21517;&#22836;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#25913;&#36827;&#30340;&#35757;&#32451;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.17497v1 Announce Type: new  Abstract: Considering the limited internal parametric knowledge, retrieval-augmented generation (RAG) has been widely used to extend the knowledge scope of large language models (LLMs). Despite the extensive efforts on RAG research, in existing methods, LLMs cannot precisely assess the relevance of retrieved documents, thus likely leading to misleading or even incorrect utilization of external knowledge (i.e., retrieved documents). To address this issue, in this paper, we propose REAR, a RElevance-Aware Retrieval-augmented approach for open-domain question answering (QA). As the key motivation, we aim to enhance the self-awareness of source relevance for LLMs, so as to adaptively utilize external knowledge in RAG systems. Specially, we develop a new architecture for LLM based RAG system, by incorporating a specially designed rank head that precisely assesses the relevance of retrieved documents. Furthermore, we propose an improved training method 
&lt;/p&gt;</description></item></channel></rss>