<rss version="2.0"><channel><title>Chat Arxiv cs.IR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.IR</description><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#21327;&#20316;&#23398;&#20064;&#25512;&#33616;&#31995;&#32479;&#38024;&#23545;&#19968;&#31181;&#26032;&#22411;&#38544;&#31169;&#25915;&#20987;&#8212;&#8212;&#31038;&#21306;&#26816;&#27979;&#25915;&#20987;&#65288;CDA&#65289;&#30340;&#38887;&#24615;&#12290;</title><link>https://arxiv.org/abs/2306.08929</link><description>&lt;p&gt;
&#20851;&#20110;&#21327;&#20316;&#23398;&#20064;&#25512;&#33616;&#31995;&#32479;&#38024;&#23545;&#31038;&#21306;&#26816;&#27979;&#25915;&#20987;&#30340;&#38887;&#24615;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
On the resilience of Collaborative Learning-based Recommender Systems Against Community Detection Attack
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2306.08929
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#21327;&#20316;&#23398;&#20064;&#25512;&#33616;&#31995;&#32479;&#38024;&#23545;&#19968;&#31181;&#26032;&#22411;&#38544;&#31169;&#25915;&#20987;&#8212;&#8212;&#31038;&#21306;&#26816;&#27979;&#25915;&#20987;&#65288;CDA&#65289;&#30340;&#38887;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21327;&#20316;&#23398;&#20064;&#25512;&#33616;&#31995;&#32479;&#28304;&#20110;&#21327;&#20316;&#23398;&#20064;&#25216;&#26415;&#65288;&#22914;&#32852;&#37030;&#23398;&#20064;&#21644;&#20843;&#21350;&#23398;&#20064;&#65289;&#30340;&#25104;&#21151;&#12290;&#22312;&#36825;&#20123;&#31995;&#32479;&#20013;&#65292;&#29992;&#25143;&#21442;&#19982;&#25512;&#33616;&#31995;&#32479;&#30340;&#35757;&#32451;&#21516;&#26102;&#22312;&#20854;&#35774;&#22791;&#19978;&#20445;&#30041;&#24050;&#28040;&#36153;&#39033;&#30446;&#30340;&#21382;&#21490;&#35760;&#24405;&#12290;&#34429;&#28982;&#36825;&#20123;&#35299;&#20915;&#26041;&#26696;&#20045;&#19968;&#30475;&#20284;&#20046;&#26377;&#21033;&#20110;&#20445;&#25252;&#21442;&#19982;&#32773;&#30340;&#38544;&#31169;&#65292;&#20294;&#26368;&#36817;&#30340;&#30740;&#31350;&#34920;&#26126;&#65292;&#21327;&#20316;&#23398;&#20064;&#21487;&#33021;&#23481;&#26131;&#21463;&#21040;&#21508;&#31181;&#38544;&#31169;&#25915;&#20987;&#30340;&#23041;&#32961;&#12290;&#26412;&#25991;&#30740;&#31350;&#20102;&#21327;&#20316;&#23398;&#20064;&#25512;&#33616;&#31995;&#32479;&#38024;&#23545;&#19968;&#31181;&#31216;&#20026;&#31038;&#21306;&#26816;&#27979;&#25915;&#20987;&#65288;CDA&#65289;&#30340;&#26032;&#22411;&#38544;&#31169;&#25915;&#20987;&#30340;&#38887;&#24615;&#12290;&#36825;&#31181;&#25915;&#20987;&#20351;&#24471;&#23545;&#25163;&#33021;&#22815;&#22522;&#20110;&#19968;&#20010;&#36873;&#25321;&#30340;&#39033;&#30446;&#38598;&#65288;&#22914;&#35782;&#21035;&#23545;&#29305;&#23450;&#20852;&#36259;&#28857;&#24863;&#20852;&#36259;&#30340;&#29992;&#25143;&#65289;&#26469;&#35782;&#21035;&#31038;&#21306;&#25104;&#21592;&#12290;&#36890;&#36807;&#22312;&#19977;&#20010;&#30495;&#23454;&#25512;&#33616;&#25968;&#25454;&#38598;&#19978;&#36827;&#34892;&#23454;&#39564;&#65292;&#20351;&#29992;&#20004;&#31181;&#26368;&#20808;&#36827;&#30340;&#25512;&#33616;
&lt;/p&gt;
&lt;p&gt;
arXiv:2306.08929v2 Announce Type: replace-cross  Abstract: Collaborative-learning-based recommender systems emerged following the success of collaborative learning techniques such as Federated Learning (FL) and Gossip Learning (GL). In these systems, users participate in the training of a recommender system while maintaining their history of consumed items on their devices. While these solutions seemed appealing for preserving the privacy of the participants at first glance, recent studies have revealed that collaborative learning can be vulnerable to various privacy attacks. In this paper, we study the resilience of collaborative learning-based recommender systems against a novel privacy attack called Community Detection Attack (CDA). This attack enables an adversary to identify community members based on a chosen set of items (eg., identifying users interested in specific points-of-interest). Through experiments on three real recommendation datasets using two state-of-the-art recomme
&lt;/p&gt;</description></item></channel></rss>