<rss version="2.0"><channel><title>Chat Arxiv cs.IR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.IR</description><item><title>Parmesan&#26159;&#19968;&#20010;&#21407;&#22411;&#31995;&#32479;&#65292;&#29992;&#20110;&#22312;&#19978;&#19979;&#25991;&#20013;&#25628;&#32034;&#21644;&#23450;&#20041;&#25968;&#23398;&#27010;&#24565;&#65292;&#29305;&#21035;&#20851;&#27880;&#33539;&#30068;&#35770;&#39046;&#22495;&#12290;&#35813;&#31995;&#32479;&#21033;&#29992;&#33258;&#28982;&#35821;&#35328;&#22788;&#29702;&#32452;&#20214;&#36827;&#34892;&#27010;&#24565;&#25552;&#21462;&#12289;&#20851;&#31995;&#25552;&#21462;&#12289;&#23450;&#20041;&#25552;&#21462;&#21644;&#23454;&#20307;&#38142;&#25509;&#12290;&#36890;&#36807;&#35813;&#31995;&#32479;&#30340;&#24320;&#21457;&#65292;&#21487;&#20197;&#35299;&#20915;&#29616;&#26377;&#25216;&#26415;&#19981;&#33021;&#30452;&#25509;&#24212;&#29992;&#20110;&#33539;&#30068;&#35770;&#39046;&#22495;&#30340;&#38382;&#39064;&#65292;&#24182;&#25552;&#20379;&#20102;&#20004;&#20010;&#25968;&#23398;&#35821;&#26009;&#24211;&#20197;&#25903;&#25345;&#31995;&#32479;&#30340;&#20351;&#29992;&#12290;</title><link>http://arxiv.org/abs/2307.06699</link><description>&lt;p&gt;
Parmesan&#65306;&#25945;&#32946;&#20013;&#30340;&#25968;&#23398;&#27010;&#24565;&#25552;&#21462;
&lt;/p&gt;
&lt;p&gt;
Parmesan: mathematical concept extraction for education. (arXiv:2307.06699v1 [cs.CL])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.06699
&lt;/p&gt;
&lt;p&gt;
Parmesan&#26159;&#19968;&#20010;&#21407;&#22411;&#31995;&#32479;&#65292;&#29992;&#20110;&#22312;&#19978;&#19979;&#25991;&#20013;&#25628;&#32034;&#21644;&#23450;&#20041;&#25968;&#23398;&#27010;&#24565;&#65292;&#29305;&#21035;&#20851;&#27880;&#33539;&#30068;&#35770;&#39046;&#22495;&#12290;&#35813;&#31995;&#32479;&#21033;&#29992;&#33258;&#28982;&#35821;&#35328;&#22788;&#29702;&#32452;&#20214;&#36827;&#34892;&#27010;&#24565;&#25552;&#21462;&#12289;&#20851;&#31995;&#25552;&#21462;&#12289;&#23450;&#20041;&#25552;&#21462;&#21644;&#23454;&#20307;&#38142;&#25509;&#12290;&#36890;&#36807;&#35813;&#31995;&#32479;&#30340;&#24320;&#21457;&#65292;&#21487;&#20197;&#35299;&#20915;&#29616;&#26377;&#25216;&#26415;&#19981;&#33021;&#30452;&#25509;&#24212;&#29992;&#20110;&#33539;&#30068;&#35770;&#39046;&#22495;&#30340;&#38382;&#39064;&#65292;&#24182;&#25552;&#20379;&#20102;&#20004;&#20010;&#25968;&#23398;&#35821;&#26009;&#24211;&#20197;&#25903;&#25345;&#31995;&#32479;&#30340;&#20351;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25968;&#23398;&#26159;&#19968;&#20010;&#39640;&#24230;&#19987;&#19994;&#21270;&#30340;&#39046;&#22495;&#65292;&#20855;&#26377;&#33258;&#24049;&#29420;&#29305;&#30340;&#25361;&#25112;&#65292;&#20294;&#22312;&#33258;&#28982;&#35821;&#35328;&#22788;&#29702;&#39046;&#22495;&#30340;&#30740;&#31350;&#21364;&#26377;&#38480;&#12290;&#28982;&#32780;&#65292;&#25968;&#23398;&#22312;&#35768;&#22810;&#19981;&#21516;&#39046;&#22495;&#30340;&#36328;&#23398;&#31185;&#30740;&#31350;&#20013;&#32463;&#24120;&#20381;&#36182;&#20110;&#23545;&#25968;&#23398;&#27010;&#24565;&#30340;&#29702;&#35299;&#12290;&#20026;&#20102;&#24110;&#21161;&#26469;&#33258;&#20854;&#20182;&#39046;&#22495;&#30340;&#30740;&#31350;&#20154;&#21592;&#65292;&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#20010;&#21407;&#22411;&#31995;&#32479;&#65292;&#29992;&#20110;&#22312;&#19978;&#19979;&#25991;&#20013;&#25628;&#32034;&#21644;&#23450;&#20041;&#25968;&#23398;&#27010;&#24565;&#65292;&#37325;&#28857;&#20851;&#27880;&#33539;&#30068;&#35770;&#39046;&#22495;&#12290;&#36825;&#20010;&#31995;&#32479;&#21517;&#20026;Parmesan&#65292;&#20381;&#36182;&#20110;&#33258;&#28982;&#35821;&#35328;&#22788;&#29702;&#32452;&#20214;&#65292;&#21253;&#25324;&#27010;&#24565;&#25552;&#21462;&#12289;&#20851;&#31995;&#25552;&#21462;&#12289;&#23450;&#20041;&#25552;&#21462;&#21644;&#23454;&#20307;&#38142;&#25509;&#12290;&#22312;&#24320;&#21457;&#36825;&#20010;&#31995;&#32479;&#30340;&#36807;&#31243;&#20013;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#29616;&#26377;&#25216;&#26415;&#19981;&#33021;&#30452;&#25509;&#24212;&#29992;&#20110;&#33539;&#30068;&#35770;&#39046;&#22495;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#28151;&#21512;&#25216;&#26415;&#65292;&#36825;&#31181;&#25216;&#26415;&#34920;&#29616;&#33391;&#22909;&#65292;&#20294;&#25105;&#20204;&#39044;&#35745;&#31995;&#32479;&#23558;&#38543;&#30528;&#26102;&#38388;&#30340;&#25512;&#31227;&#32780;&#19981;&#26029;&#28436;&#21464;&#12290;&#25105;&#20204;&#36824;&#25552;&#20379;&#20102;&#20004;&#20010;&#28165;&#29702;&#36807;&#30340;&#25968;&#23398;&#35821;&#26009;&#24211;&#65292;&#29992;&#20110;&#25903;&#25345;&#21407;&#22411;&#31995;&#32479;&#65292;&#36825;&#20123;&#35821;&#26009;&#24211;&#22522;&#20110;&#26399;&#21002;&#25991;&#31456;&#12290;
&lt;/p&gt;
&lt;p&gt;
Mathematics is a highly specialized domain with its own unique set of challenges that has seen limited study in natural language processing. However, mathematics is used in a wide variety of fields and multidisciplinary research in many different domains often relies on an understanding of mathematical concepts. To aid researchers coming from other fields, we develop a prototype system for searching for and defining mathematical concepts in context, focusing on the field of category theory. This system, Parmesan, depends on natural language processing components including concept extraction, relation extraction, definition extraction, and entity linking. In developing this system, we show that existing techniques cannot be applied directly to the category theory domain, and suggest hybrid techniques that do perform well, though we expect the system to evolve over time. We also provide two cleaned mathematical corpora that power the prototype system, which are based on journal articles 
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#21517;&#20026;GLORY&#30340;&#27169;&#22411;&#65292;&#36890;&#36807;&#20840;&#23616;&#22270;&#19982;&#26412;&#22320;&#34920;&#31034;&#30456;&#32467;&#21512;&#65292;&#22686;&#24378;&#20102;&#20010;&#24615;&#21270;&#25512;&#33616;&#31995;&#32479;&#12290;&#35813;&#27169;&#22411;&#36890;&#36807;&#26500;&#24314;&#20840;&#23616;&#24863;&#30693;&#21382;&#21490;&#26032;&#38395;&#32534;&#30721;&#22120;&#26469;&#34701;&#21512;&#21382;&#21490;&#26032;&#38395;&#34920;&#31034;&#65292;&#24182;&#32771;&#34385;&#20102;&#29992;&#25143;&#38544;&#34255;&#30340;&#21160;&#26426;&#21644;&#34892;&#20026;&#12290;</title><link>http://arxiv.org/abs/2307.06576</link><description>&lt;p&gt;
&#36229;&#36234;&#26412;&#22320;&#33539;&#22260;&#65306;&#20840;&#29699;&#22270;&#22686;&#24378;&#20010;&#24615;&#21270;&#26032;&#38395;&#25512;&#33616;
&lt;/p&gt;
&lt;p&gt;
Going Beyond Local: Global Graph-Enhanced Personalized News Recommendations. (arXiv:2307.06576v1 [cs.IR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.06576
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#21517;&#20026;GLORY&#30340;&#27169;&#22411;&#65292;&#36890;&#36807;&#20840;&#23616;&#22270;&#19982;&#26412;&#22320;&#34920;&#31034;&#30456;&#32467;&#21512;&#65292;&#22686;&#24378;&#20102;&#20010;&#24615;&#21270;&#25512;&#33616;&#31995;&#32479;&#12290;&#35813;&#27169;&#22411;&#36890;&#36807;&#26500;&#24314;&#20840;&#23616;&#24863;&#30693;&#21382;&#21490;&#26032;&#38395;&#32534;&#30721;&#22120;&#26469;&#34701;&#21512;&#21382;&#21490;&#26032;&#38395;&#34920;&#31034;&#65292;&#24182;&#32771;&#34385;&#20102;&#29992;&#25143;&#38544;&#34255;&#30340;&#21160;&#26426;&#21644;&#34892;&#20026;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#31934;&#30830;&#22320;&#21521;&#29992;&#25143;&#25512;&#33616;&#20505;&#36873;&#26032;&#38395;&#25991;&#31456;&#19968;&#30452;&#26159;&#20010;&#24615;&#21270;&#26032;&#38395;&#25512;&#33616;&#31995;&#32479;&#30340;&#26680;&#24515;&#25361;&#25112;&#12290;&#22823;&#22810;&#25968;&#36817;&#26399;&#30340;&#30740;&#31350;&#20027;&#35201;&#38598;&#20013;&#22312;&#20351;&#29992;&#20808;&#36827;&#30340;&#33258;&#28982;&#35821;&#35328;&#22788;&#29702;&#25216;&#26415;&#20174;&#20016;&#23500;&#30340;&#25991;&#26412;&#25968;&#25454;&#20013;&#25552;&#21462;&#35821;&#20041;&#20449;&#24687;&#65292;&#20351;&#29992;&#20174;&#26412;&#22320;&#21382;&#21490;&#26032;&#38395;&#27966;&#29983;&#30340;&#22522;&#20110;&#20869;&#23481;&#30340;&#26041;&#27861;&#12290;&#28982;&#32780;&#65292;&#36825;&#31181;&#26041;&#27861;&#32570;&#20047;&#20840;&#23616;&#35270;&#35282;&#65292;&#26410;&#33021;&#32771;&#34385;&#29992;&#25143;&#38544;&#34255;&#30340;&#21160;&#26426;&#21644;&#34892;&#20026;&#65292;&#36229;&#36234;&#35821;&#20041;&#20449;&#24687;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#27169;&#22411; GLORY&#65288;Global-LOcal news Recommendation sYstem&#65289;&#65292;&#23427;&#32467;&#21512;&#20102;&#20174;&#20854;&#20182;&#29992;&#25143;&#23398;&#21040;&#30340;&#20840;&#23616;&#34920;&#31034;&#21644;&#26412;&#22320;&#34920;&#31034;&#65292;&#26469;&#22686;&#24378;&#20010;&#24615;&#21270;&#25512;&#33616;&#31995;&#32479;&#12290;&#25105;&#20204;&#36890;&#36807;&#26500;&#24314;&#19968;&#20010;&#20840;&#23616;&#24863;&#30693;&#21382;&#21490;&#26032;&#38395;&#32534;&#30721;&#22120;&#26469;&#23454;&#29616;&#36825;&#19968;&#30446;&#26631;&#65292;&#20854;&#20013;&#21253;&#25324;&#19968;&#20010;&#20840;&#23616;&#26032;&#38395;&#22270;&#65292;&#24182;&#20351;&#29992;&#38376;&#25511;&#22270;&#31070;&#32463;&#32593;&#32476;&#26469;&#20016;&#23500;&#26032;&#38395;&#34920;&#31034;&#65292;&#20174;&#32780;&#36890;&#36807;&#21382;&#21490;&#26032;&#38395;&#32858;&#21512;&#22120;&#34701;&#21512;&#21382;&#21490;&#26032;&#38395;&#34920;&#31034;&#12290;
&lt;/p&gt;
&lt;p&gt;
Precisely recommending candidate news articles to users has always been a core challenge for personalized news recommendation systems. Most recent works primarily focus on using advanced natural language processing techniques to extract semantic information from rich textual data, employing content-based methods derived from local historical news. However, this approach lacks a global perspective, failing to account for users' hidden motivations and behaviors beyond semantic information. To address this challenge, we propose a novel model called GLORY (Global-LOcal news Recommendation sYstem), which combines global representations learned from other users with local representations to enhance personalized recommendation systems. We accomplish this by constructing a Global-aware Historical News Encoder, which includes a global news graph and employs gated graph neural networks to enrich news representations, thereby fusing historical news representations by a historical news aggregator.
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#35780;&#20272;&#20102;&#32842;&#22825;&#22411;AI&#27169;&#22411;ChatGPT&#22312;&#31995;&#32479;&#24615;&#32508;&#36848;&#65288;SR&#65289;&#25991;&#31456;&#31579;&#36873;&#20013;&#30340;&#24615;&#33021;&#65292;&#32467;&#26524;&#34920;&#26126;ChatGPT&#26159;&#33258;&#21160;&#21270;SR&#36807;&#31243;&#30340;&#21487;&#34892;&#36873;&#25321;&#12290;</title><link>http://arxiv.org/abs/2307.06464</link><description>&lt;p&gt;
&#35780;&#20272;ChatGPT&#23545;&#20110;&#31995;&#32479;&#24615;&#32508;&#36848;&#25991;&#31456;&#31579;&#36873;&#30340;&#33021;&#21147;
&lt;/p&gt;
&lt;p&gt;
Assessing the Ability of ChatGPT to Screen Articles for Systematic Reviews. (arXiv:2307.06464v1 [cs.SE])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.06464
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#35780;&#20272;&#20102;&#32842;&#22825;&#22411;AI&#27169;&#22411;ChatGPT&#22312;&#31995;&#32479;&#24615;&#32508;&#36848;&#65288;SR&#65289;&#25991;&#31456;&#31579;&#36873;&#20013;&#30340;&#24615;&#33021;&#65292;&#32467;&#26524;&#34920;&#26126;ChatGPT&#26159;&#33258;&#21160;&#21270;SR&#36807;&#31243;&#30340;&#21487;&#34892;&#36873;&#25321;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#22312;&#30740;&#31350;&#39046;&#22495;&#20869;&#32452;&#32455;&#30693;&#35782;&#65292;&#31995;&#32479;&#24615;&#32508;&#36848;&#65288;SR&#65289;&#20026;&#30740;&#31350;&#25552;&#20379;&#20102;&#23453;&#36149;&#30340;&#32447;&#32034;&#12290;&#26377;&#35777;&#25454;&#34920;&#26126;&#65292;SR&#24050;&#25104;&#20026;&#36719;&#20214;&#24037;&#31243;&#20013;&#19968;&#27969;&#30340;&#33402;&#26415;&#21697;&#12290;&#28982;&#32780;&#65292;SR&#31579;&#36873;&#38454;&#27573;&#25152;&#38656;&#30340;&#32321;&#29712;&#25163;&#21160;&#24037;&#20316;&#20351;&#24471;&#36825;&#20123;&#30740;&#31350;&#21464;&#24471;&#26114;&#36149;&#19988;&#23481;&#26131;&#20986;&#38169;&#12290;&#23613;&#31649;&#20256;&#32479;&#19978;&#35748;&#20026;&#31579;&#36873;&#19981;&#36866;&#21512;&#33258;&#21160;&#21270;&#65292;&#20294;&#22522;&#20110;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#25903;&#25345;&#30340;&#29983;&#25104;&#24335;AI&#39537;&#21160;&#30340;&#32842;&#22825;&#26426;&#22120;&#20154;&#30340;&#20986;&#29616;&#23558;&#25913;&#21464;&#36825;&#19968;&#24773;&#20917;&#12290;&#22312;&#26412;&#25253;&#21578;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#21033;&#29992;&#36825;&#20123;&#26032;&#25216;&#26415;&#21457;&#23637;&#33258;&#21160;&#21270;SR&#31579;&#36873;&#30340;&#26041;&#27861;&#12290;&#25105;&#20204;&#35780;&#20272;&#20102;ChatGPT&#22312;SR&#25991;&#31456;&#31579;&#36873;&#20013;&#30340;&#19968;&#33268;&#24615;&#12289;&#20998;&#31867;&#24615;&#33021;&#21644;&#25512;&#24191;&#33021;&#21147;&#65292;&#24182;&#23558;&#36825;&#20123;&#25968;&#25454;&#19982;&#20256;&#32479;&#29992;&#20110;SR&#33258;&#21160;&#21270;&#30340;&#20998;&#31867;&#22120;&#36827;&#34892;&#27604;&#36739;&#12290;&#25105;&#20204;&#30340;&#32467;&#26524;&#34920;&#26126;&#65292;ChatGPT&#26159;&#33258;&#21160;&#21270;SR&#36807;&#31243;&#30340;&#21487;&#34892;&#36873;&#25321;&#65292;&#20294;&#24320;&#21457;&#32773;&#22312;&#38598;&#25104;&#26102;&#38656;&#35201;&#20180;&#32454;&#32771;&#34385;&#12290;
&lt;/p&gt;
&lt;p&gt;
By organizing knowledge within a research field, Systematic Reviews (SR) provide valuable leads to steer research. Evidence suggests that SRs have become first-class artifacts in software engineering. However, the tedious manual effort associated with the screening phase of SRs renders these studies a costly and error-prone endeavor. While screening has traditionally been considered not amenable to automation, the advent of generative AI-driven chatbots, backed with large language models is set to disrupt the field. In this report, we propose an approach to leverage these novel technological developments for automating the screening of SRs. We assess the consistency, classification performance, and generalizability of ChatGPT in screening articles for SRs and compare these figures with those of traditional classifiers used in SR automation. Our results indicate that ChatGPT is a viable option to automate the SR processes, but requires careful considerations from developers when integra
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#33258;&#36866;&#24212;&#22270;&#23545;&#27604;&#23398;&#20064;&#30340;&#25512;&#33616;&#26694;&#26550;&#65292;&#36890;&#36807;&#23545;&#27604;&#23398;&#20064;&#30340;&#26041;&#24335;&#25913;&#36827;&#29992;&#25143;&#21644;&#29289;&#21697;&#30340;&#34920;&#31034;&#65292;&#20851;&#27880;&#25968;&#25454;&#20013;&#30340;&#38590;&#20197;&#21306;&#20998;&#30340;&#36127;&#38754;&#20363;&#23376;&#30340;&#20449;&#24687;&#12290;</title><link>http://arxiv.org/abs/2305.10837</link><description>&lt;p&gt;
&#33258;&#36866;&#24212;&#22270;&#23545;&#27604;&#23398;&#20064;&#29992;&#20110;&#25512;&#33616;&#31995;&#32479;
&lt;/p&gt;
&lt;p&gt;
Adaptive Graph Contrastive Learning for Recommendation. (arXiv:2305.10837v1 [cs.IR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.10837
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#33258;&#36866;&#24212;&#22270;&#23545;&#27604;&#23398;&#20064;&#30340;&#25512;&#33616;&#26694;&#26550;&#65292;&#36890;&#36807;&#23545;&#27604;&#23398;&#20064;&#30340;&#26041;&#24335;&#25913;&#36827;&#29992;&#25143;&#21644;&#29289;&#21697;&#30340;&#34920;&#31034;&#65292;&#20851;&#27880;&#25968;&#25454;&#20013;&#30340;&#38590;&#20197;&#21306;&#20998;&#30340;&#36127;&#38754;&#20363;&#23376;&#30340;&#20449;&#24687;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36817;&#24180;&#26469;&#65292;&#22270;&#31070;&#32463;&#32593;&#32476;&#24050;&#25104;&#21151;&#22320;&#24212;&#29992;&#20110;&#25512;&#33616;&#31995;&#32479;&#65292;&#25104;&#20026;&#19968;&#31181;&#26377;&#25928;&#30340;&#21327;&#21516;&#36807;&#28388;&#26041;&#27861;&#12290;&#22522;&#20110;&#22270;&#31070;&#32463;&#32593;&#32476;&#30340;&#25512;&#33616;&#31995;&#32479;&#30340;&#20851;&#38190;&#24605;&#24819;&#26159;&#27839;&#30528;&#29992;&#25143;-&#29289;&#21697;&#20132;&#20114;&#36793;&#36882;&#24402;&#22320;&#25191;&#34892;&#28040;&#24687;&#20256;&#36882;&#65292;&#20197;&#23436;&#21892;&#32534;&#30721;&#23884;&#20837;&#65292;&#36825;&#20381;&#36182;&#20110;&#20805;&#36275;&#21644;&#39640;&#36136;&#37327;&#30340;&#35757;&#32451;&#25968;&#25454;&#12290;&#30001;&#20110;&#23454;&#38469;&#25512;&#33616;&#22330;&#26223;&#20013;&#30340;&#29992;&#25143;&#34892;&#20026;&#25968;&#25454;&#36890;&#24120;&#23384;&#22312;&#22122;&#22768;&#24182;&#21576;&#29616;&#20986;&#20542;&#26012;&#20998;&#24067;&#65292;&#19968;&#20123;&#25512;&#33616;&#26041;&#27861;&#21033;&#29992;&#33258;&#30417;&#30563;&#23398;&#20064;&#26469;&#25913;&#21892;&#29992;&#25143;&#34920;&#31034;&#65292;&#20363;&#22914;SGL&#21644;SimGCL&#12290; &#28982;&#32780;&#65292;&#23613;&#31649;&#23427;&#20204;&#38750;&#24120;&#26377;&#25928;&#65292;&#20294;&#23427;&#20204;&#36890;&#36807;&#21019;&#24314;&#23545;&#27604;&#35270;&#22270;&#36827;&#34892;&#33258;&#30417;&#30563;&#23398;&#20064;&#65292;&#20855;&#26377;&#25968;&#25454;&#22686;&#24378;&#25506;&#32034;&#65292;&#38656;&#35201;&#36827;&#34892;&#32321;&#29712;&#30340;&#35797;&#38169;&#36873;&#25321;&#22686;&#24378;&#26041;&#27861;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#33258;&#36866;&#24212;&#22270;&#23545;&#27604;&#23398;&#20064;&#65288;AdaptiveGCL&#65289;&#26694;&#26550;&#65292;&#36890;&#36807;&#33258;&#36866;&#24212;&#20294;&#20851;&#27880;&#25968;&#25454;&#20013;&#30340;&#38590;&#20197;&#21306;&#20998;&#30340;&#36127;&#38754;&#20363;&#23376;&#30340;&#20449;&#24687;&#65292;&#29992;&#23545;&#27604;&#23398;&#20064;&#30340;&#26041;&#24335;&#25913;&#36827;&#29992;&#25143;&#21644;&#29289;&#21697;&#30340;&#34920;&#31034;&#12290;
&lt;/p&gt;
&lt;p&gt;
Recently, graph neural networks (GNNs) have been successfully applied to recommender systems as an effective collaborative filtering (CF) approach. The key idea of GNN-based recommender system is to recursively perform the message passing along the user-item interaction edge for refining the encoded embeddings, relying on sufficient and high-quality training data. Since user behavior data in practical recommendation scenarios is often noisy and exhibits skewed distribution, some recommendation approaches, e.g., SGL and SimGCL, leverage self-supervised learning to improve user representations against the above issues. Despite their effectiveness, however, they conduct self-supervised learning through creating contrastvie views, depending on the exploration of data augmentations with the problem of tedious trial-and-error selection of augmentation methods. In this paper, we propose a novel Adaptive Graph Contrastive Learning (AdaptiveGCL) framework which conducts graph contrastive learni
&lt;/p&gt;</description></item></channel></rss>