<rss version="2.0"><channel><title>Chat Arxiv cs.IR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.IR</description><item><title>HiNet&#26159;&#19968;&#31181;&#22810;&#22330;&#26223;&#21644;&#22810;&#20219;&#21153;&#23398;&#20064;&#32593;&#32476;&#65292;&#20855;&#26377;&#23618;&#27425;&#20449;&#24687;&#25552;&#21462;&#21644;&#22330;&#26223;&#24863;&#30693;&#27880;&#24847;&#65292;&#21487;&#20197;&#22686;&#24378;&#25512;&#33616;&#31995;&#32479;&#30340;&#23398;&#20064;&#33021;&#21147;&#21644;&#25928;&#26524;&#12290;</title><link>http://arxiv.org/abs/2303.06095</link><description>&lt;p&gt;
HiNet: &#19968;&#31181;&#20855;&#26377;&#23618;&#27425;&#20449;&#24687;&#25552;&#21462;&#30340;&#26032;&#22411;&#22810;&#22330;&#26223;&#21644;&#22810;&#20219;&#21153;&#23398;&#20064;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
HiNet: Novel Multi-Scenario &amp; Multi-Task Learning with Hierarchical Information Extraction. (arXiv:2303.06095v2 [cs.IR] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.06095
&lt;/p&gt;
&lt;p&gt;
HiNet&#26159;&#19968;&#31181;&#22810;&#22330;&#26223;&#21644;&#22810;&#20219;&#21153;&#23398;&#20064;&#32593;&#32476;&#65292;&#20855;&#26377;&#23618;&#27425;&#20449;&#24687;&#25552;&#21462;&#21644;&#22330;&#26223;&#24863;&#30693;&#27880;&#24847;&#65292;&#21487;&#20197;&#22686;&#24378;&#25512;&#33616;&#31995;&#32479;&#30340;&#23398;&#20064;&#33021;&#21147;&#21644;&#25928;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#24037;&#19994;&#24212;&#29992;&#30340;&#35768;&#22810;&#25512;&#33616;&#31995;&#32479;&#20013;&#65292;&#22810;&#22330;&#26223;&#21644;&#22810;&#20219;&#21153;&#23398;&#20064;&#24050;&#34987;&#24191;&#27867;&#24212;&#29992;&#65292;&#20854;&#20013;&#19968;&#31181;&#26377;&#25928;&#21644;&#23454;&#29992;&#30340;&#26041;&#27861;&#26159;&#22312;&#28151;&#21512;&#19987;&#23478;&#65288;MoE&#65289;&#26550;&#26500;&#30340;&#22522;&#30784;&#19978;&#36827;&#34892;&#22810;&#22330;&#26223;&#36801;&#31227;&#23398;&#20064;&#12290;&#28982;&#32780;&#65292;&#20197;&#23558;&#25152;&#26377;&#20449;&#24687;&#25237;&#24433;&#21040;&#21516;&#19968;&#29305;&#24449;&#31354;&#38388;&#20026;&#30446;&#26631;&#30340;MoE&#26041;&#27861;&#26080;&#27861;&#26377;&#25928;&#22320;&#22788;&#29702;&#21508;&#31181;&#22330;&#26223;&#21644;&#20219;&#21153;&#20043;&#38388;&#30340;&#22797;&#26434;&#20851;&#31995;&#65292;&#23548;&#33268;&#24615;&#33021;&#19981;&#22914;&#20154;&#24847;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#20110;&#22810;&#22330;&#26223;&#21644;&#22810;&#20219;&#21153;&#25512;&#33616;&#30340;Hierarchical information extraction Network&#65288;HiNet&#65289;&#65292;&#35813;&#32593;&#32476;&#22522;&#20110;&#20174;&#31895;&#21040;&#32454;&#30340;&#30693;&#35782;&#36716;&#31227;&#26041;&#26696;&#23454;&#29616;&#20998;&#23618;&#25552;&#21462;&#12290;&#20998;&#23618;&#32593;&#32476;&#30340;&#22810;&#20010;&#25552;&#21462;&#23618;&#20351;&#27169;&#22411;&#33021;&#22815;&#22686;&#24378;&#36328;&#22330;&#26223;&#20256;&#36882;&#26377;&#20215;&#20540;&#20449;&#24687;&#30340;&#33021;&#21147;&#65292;&#21516;&#26102;&#20445;&#30041;&#22330;&#26223;&#21644;&#20219;&#21153;&#30340;&#29305;&#23450;&#29305;&#24449;&#12290;&#27492;&#22806;&#65292;&#24341;&#20837;&#19968;&#31181;&#26032;&#39062;&#30340;&#22330;&#26223;&#24863;&#30693;&#27880;&#24847;&#32593;&#32476;&#65292;&#20197;&#22686;&#24378;&#27169;&#22411;&#23545;&#20219;&#21153;&#30456;&#20851;&#24615;&#21644;&#22330;&#26223;&#29420;&#29305;&#24615;&#30340;&#23398;&#20064;&#33021;&#21147;&#12290;&#23454;&#39564;&#32467;&#26524;&#34920;&#26126;&#65292;&#19982;&#29616;&#26377;&#26041;&#27861;&#30456;&#27604;&#65292;&#25152;&#25552;&#20986;&#30340;HiNet&#20855;&#26377;&#26356;&#39640;&#30340;&#25928;&#26524;&#21644;&#20248;&#36234;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Multi-scenario &amp; multi-task learning has been widely applied to many recommendation systems in industrial applications, wherein an effective and practical approach is to carry out multi-scenario transfer learning on the basis of the Mixture-of-Expert (MoE) architecture. However, the MoE-based method, which aims to project all information in the same feature space, cannot effectively deal with the complex relationships inherent among various scenarios and tasks, resulting in unsatisfactory performance. To tackle the problem, we propose a Hierarchical information extraction Network (HiNet) for multi-scenario and multi-task recommendation, which achieves hierarchical extraction based on coarse-to-fine knowledge transfer scheme. The multiple extraction layers of the hierarchical network enable the model to enhance the capability of transferring valuable information across scenarios while preserving specific features of scenarios and tasks. Furthermore, a novel scenario-aware attentive netw
&lt;/p&gt;</description></item></channel></rss>