<rss version="2.0"><channel><title>Chat Arxiv cs.IR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.IR</description><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;Vec2Text&#23545;&#23494;&#38598;&#26816;&#32034;&#31995;&#32479;&#30340;&#23041;&#32961;&#20197;&#21450;&#22914;&#20309;&#32531;&#35299;&#65292;&#36890;&#36807;&#23545;&#36317;&#31163;&#24230;&#37327;&#12289;&#27744;&#21270;&#20989;&#25968;&#12289;&#29942;&#39048;&#39044;&#35757;&#32451;&#31561;&#26041;&#38754;&#36827;&#34892;&#28145;&#20837;&#20998;&#26512;&#65292;&#20197;&#33719;&#24471;&#23545;&#23494;&#38598;&#26816;&#32034;&#31995;&#32479;&#20013;&#25991;&#26412;&#21487;&#24674;&#22797;&#24615;&#21644;&#26816;&#32034;&#25928;&#26524;&#26435;&#34913;&#20851;&#38190;&#20803;&#32032;&#30340;&#26356;&#28145;&#20837;&#29702;&#35299;&#12290;</title><link>https://arxiv.org/abs/2402.12784</link><description>&lt;p&gt;
&#29702;&#35299;&#21644;&#32531;&#35299;Vec2Text&#23545;&#23494;&#38598;&#26816;&#32034;&#31995;&#32479;&#30340;&#23041;&#32961;
&lt;/p&gt;
&lt;p&gt;
Understanding and Mitigating the Threat of Vec2Text to Dense Retrieval Systems
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.12784
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;Vec2Text&#23545;&#23494;&#38598;&#26816;&#32034;&#31995;&#32479;&#30340;&#23041;&#32961;&#20197;&#21450;&#22914;&#20309;&#32531;&#35299;&#65292;&#36890;&#36807;&#23545;&#36317;&#31163;&#24230;&#37327;&#12289;&#27744;&#21270;&#20989;&#25968;&#12289;&#29942;&#39048;&#39044;&#35757;&#32451;&#31561;&#26041;&#38754;&#36827;&#34892;&#28145;&#20837;&#20998;&#26512;&#65292;&#20197;&#33719;&#24471;&#23545;&#23494;&#38598;&#26816;&#32034;&#31995;&#32479;&#20013;&#25991;&#26412;&#21487;&#24674;&#22797;&#24615;&#21644;&#26816;&#32034;&#25928;&#26524;&#26435;&#34913;&#20851;&#38190;&#20803;&#32032;&#30340;&#26356;&#28145;&#20837;&#29702;&#35299;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24341;&#20837;Vec2Text&#25216;&#26415;&#65292;&#19968;&#31181;&#29992;&#20110;&#21453;&#36716;&#25991;&#26412;&#23884;&#20837;&#30340;&#25216;&#26415;&#65292;&#24341;&#21457;&#20102;&#20154;&#20204;&#23545;&#23494;&#38598;&#26816;&#32034;&#31995;&#32479;&#20013;&#23384;&#22312;&#20005;&#37325;&#38544;&#31169;&#38382;&#39064;&#30340;&#25285;&#24551;&#65292;&#21253;&#25324;&#37027;&#20123;&#20351;&#29992;OpenAI&#21644;Cohere&#25552;&#20379;&#30340;&#25991;&#26412;&#23884;&#20837;&#30340;&#31995;&#32479;&#12290;&#36825;&#31181;&#23041;&#32961;&#26469;&#33258;&#20110;&#19968;&#20010;&#24694;&#24847;&#25915;&#20987;&#32773;&#36890;&#36807;&#35775;&#38382;&#25991;&#26412;&#23884;&#20837;&#26469;&#37325;&#26500;&#21407;&#22987;&#25991;&#26412;&#12290;&#26412;&#25991;&#30740;&#31350;&#20102;&#24433;&#21709;&#20351;&#29992;Vec2Text&#24674;&#22797;&#25991;&#26412;&#30340;&#23884;&#20837;&#27169;&#22411;&#30340;&#21508;&#20010;&#26041;&#38754;&#12290;&#25105;&#20204;&#30340;&#25506;&#32034;&#28041;&#21450;&#36317;&#31163;&#24230;&#37327;&#12289;&#27744;&#21270;&#20989;&#25968;&#12289;&#29942;&#39048;&#39044;&#35757;&#32451;&#12289;&#21152;&#22122;&#22768;&#35757;&#32451;&#12289;&#23884;&#20837;&#37327;&#21270;&#21644;&#23884;&#20837;&#32500;&#24230;&#31561;&#22240;&#32032;&#65292;&#36825;&#20123;&#22240;&#32032;&#22312;&#21407;&#22987;Vec2Text&#35770;&#25991;&#20013;&#23578;&#26410;&#34987;&#35752;&#35770;&#12290;&#36890;&#36807;&#23545;&#36825;&#20123;&#22240;&#32032;&#30340;&#28145;&#20837;&#20998;&#26512;&#65292;&#25105;&#20204;&#26088;&#22312;&#26356;&#28145;&#20837;&#22320;&#20102;&#35299;&#24433;&#21709;&#23494;&#38598;&#26816;&#32034;&#31995;&#32479;&#20013;&#25991;&#26412;&#21487;&#24674;&#22797;&#24615;&#21644;&#26816;&#32034;&#25928;&#26524;&#20043;&#38388;&#26435;&#34913;&#30340;&#20851;&#38190;&#22240;&#32032;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.12784v1 Announce Type: cross  Abstract: The introduction of Vec2Text, a technique for inverting text embeddings, has raised serious privacy concerns within dense retrieval systems utilizing text embeddings, including those provided by OpenAI and Cohere. This threat comes from the ability for a malicious attacker with access to text embeddings to reconstruct the original text.   In this paper, we investigate various aspects of embedding models that could influence the recoverability of text using Vec2Text. Our exploration involves factors such as distance metrics, pooling functions, bottleneck pre-training, training with noise addition, embedding quantization, and embedding dimensions -- aspects not previously addressed in the original Vec2Text paper. Through a thorough analysis of these factors, our aim is to gain a deeper understanding of the critical elements impacting the trade-offs between text recoverability and retrieval effectiveness in dense retrieval systems. This a
&lt;/p&gt;</description></item></channel></rss>