<rss version="2.0"><channel><title>Chat Arxiv cs.IR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.IR</description><item><title>&#35813;&#35770;&#25991;&#20171;&#32461;&#20102;&#22312;&#22810;&#36890;&#36947;&#38646;&#21806;&#20013;&#30340;&#36328;&#36890;&#36947;&#25512;&#33616;&#31995;&#32479;&#30740;&#31350;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#27169;&#22411;&#20197;&#35299;&#20915;&#29992;&#25143;&#20559;&#22909;&#25972;&#21512;&#30340;&#25361;&#25112;&#12290;</title><link>https://arxiv.org/abs/2404.00972</link><description>&lt;p&gt;
&#36328;&#36890;&#36947;&#25512;&#33616;&#22312;&#22810;&#36890;&#36947;&#38646;&#21806;&#20013;&#30340;&#24212;&#29992;
&lt;/p&gt;
&lt;p&gt;
Cross-channel Recommendation for Multi-channel Retail
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2404.00972
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#20171;&#32461;&#20102;&#22312;&#22810;&#36890;&#36947;&#38646;&#21806;&#20013;&#30340;&#36328;&#36890;&#36947;&#25512;&#33616;&#31995;&#32479;&#30740;&#31350;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#27169;&#22411;&#20197;&#35299;&#20915;&#29992;&#25143;&#20559;&#22909;&#25972;&#21512;&#30340;&#25361;&#25112;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36234;&#26469;&#36234;&#22810;&#30340;&#20256;&#32479;&#38646;&#21806;&#21830;&#27491;&#22312;&#23558;&#19994;&#21153;&#25299;&#23637;&#21040;&#22312;&#32447;&#39046;&#22495;&#65292;&#36716;&#21464;&#20026;&#22810;&#36890;&#36947;&#38646;&#21806;&#21830;&#12290;&#36825;&#31181;&#36716;&#21464;&#24378;&#35843;&#20102;&#36328;&#36890;&#36947;&#25512;&#33616;&#31995;&#32479;&#30340;&#38656;&#27714;&#65292;&#26088;&#22312;&#22686;&#24378;&#32447;&#19979;&#21644;&#32447;&#19978;&#28192;&#36947;&#30340;&#25910;&#20837;&#12290;&#26412;&#25991;&#20171;&#32461;&#20102;&#25105;&#20204;&#22312;&#36328;&#36890;&#36947;&#38646;&#21806;&#25512;&#33616;&#20013;&#30340;&#21407;&#21019;&#24037;&#20316;&#65292;&#20351;&#29992;&#26469;&#33258;&#22810;&#36890;&#36947;&#38646;&#21806;&#21830;&#30340;&#30495;&#23454;&#25968;&#25454;&#38598;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#25972;&#21512;&#29992;&#25143;&#20559;&#22909;&#22312;&#20004;&#20010;&#36890;&#36947;&#20043;&#38388;&#30340;&#26174;&#33879;&#25361;&#25112;&#12290;&#22240;&#27492;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#21033;&#29992;&#22522;&#20110;&#36890;&#36947;&#30340;&#27880;&#24847;&#26426;&#21046;&#30340;&#26032;&#39062;&#27169;&#22411;&#65292;&#20197;&#35299;&#20915;&#36825;&#20010;&#25361;&#25112;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2404.00972v1 Announce Type: new  Abstract: An increasing number of brick-and-mortar retailers are expanding their channels to the online domain, transforming them into multi-channel retailers. This transition emphasizes the need for cross-channel recommender systems, aiming to enhance revenue across both offline and online channels. Given that each retail channel represents a separate domain with a unique context, this can be regarded as a cross-domain recommendation (CDR). However, the existing studies on CDR did not address the scenarios where both users and items partially overlap across multi-retail channels which we define as "cross-channel retail recommendation (CCRR)". This paper introduces our original work on CCRR using real-world datasets from a multi-channel retail store. Specifically, (1) we present significant challenges in integrating user preferences across both channels. (2) Accordingly, we propose a novel model for CCRR using a channel-wise attention mechanism to
&lt;/p&gt;</description></item></channel></rss>