<rss version="2.0"><channel><title>Chat Arxiv cs.IR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.IR</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#25193;&#23637;&#20256;&#23548;&#30693;&#35782;&#22270;&#23884;&#20837;&#26041;&#27861;&#30340;&#27169;&#22411;&#65292;&#29992;&#20110;&#22788;&#29702;&#24402;&#32435;&#25512;&#29702;&#20219;&#21153;&#12290;&#36890;&#36807;&#24341;&#20837;&#24191;&#20041;&#30340;&#35856;&#27874;&#25193;&#23637;&#65292;&#21033;&#29992;&#20256;&#23548;&#23884;&#20837;&#26041;&#27861;&#23398;&#20064;&#30340;&#34920;&#31034;&#26469;&#25512;&#26029;&#22312;&#25512;&#29702;&#26102;&#24341;&#20837;&#30340;&#26032;&#23454;&#20307;&#30340;&#34920;&#31034;&#12290;</title><link>http://arxiv.org/abs/2309.03773</link><description>&lt;p&gt;
&#25193;&#23637;&#20256;&#23548;&#30693;&#35782;&#22270;&#23884;&#20837;&#27169;&#22411;&#29992;&#20110;&#24402;&#32435;&#36923;&#36753;&#20851;&#31995;&#25512;&#29702;
&lt;/p&gt;
&lt;p&gt;
Extending Transductive Knowledge Graph Embedding Models for Inductive Logical Relational Inference. (arXiv:2309.03773v1 [cs.AI])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.03773
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#25193;&#23637;&#20256;&#23548;&#30693;&#35782;&#22270;&#23884;&#20837;&#26041;&#27861;&#30340;&#27169;&#22411;&#65292;&#29992;&#20110;&#22788;&#29702;&#24402;&#32435;&#25512;&#29702;&#20219;&#21153;&#12290;&#36890;&#36807;&#24341;&#20837;&#24191;&#20041;&#30340;&#35856;&#27874;&#25193;&#23637;&#65292;&#21033;&#29992;&#20256;&#23548;&#23884;&#20837;&#26041;&#27861;&#23398;&#20064;&#30340;&#34920;&#31034;&#26469;&#25512;&#26029;&#22312;&#25512;&#29702;&#26102;&#24341;&#20837;&#30340;&#26032;&#23454;&#20307;&#30340;&#34920;&#31034;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35768;&#22810;&#30693;&#35782;&#22270;&#30340;&#19979;&#28216;&#25512;&#29702;&#20219;&#21153;&#65292;&#20363;&#22914;&#20851;&#31995;&#39044;&#27979;&#65292;&#22312;&#20256;&#23548;&#35774;&#32622;&#19979;&#24050;&#32463;&#25104;&#21151;&#22788;&#29702;&#20102;&#12290;&#20026;&#20102;&#22788;&#29702;&#24402;&#32435;&#35774;&#32622;&#65292;&#20063;&#23601;&#26159;&#22312;&#25512;&#29702;&#26102;&#24341;&#20837;&#26032;&#23454;&#20307;&#21040;&#30693;&#35782;&#22270;&#20013;&#65292;&#36739;&#26032;&#30340;&#24037;&#20316;&#36873;&#25321;&#20102;&#36890;&#36807;&#32593;&#32476;&#23376;&#22270;&#32467;&#26500;&#30340;&#22797;&#26434;&#20989;&#25968;&#23398;&#20064;&#30693;&#35782;&#22270;&#30340;&#38544;&#24335;&#34920;&#31034;&#30340;&#27169;&#22411;&#65292;&#36890;&#24120;&#30001;&#22270;&#31070;&#32463;&#32593;&#32476;&#26550;&#26500;&#21442;&#25968;&#21270;&#12290;&#36825;&#20123;&#27169;&#22411;&#30340;&#25104;&#26412;&#26159;&#22686;&#21152;&#30340;&#21442;&#25968;&#21270;&#12289;&#38477;&#20302;&#30340;&#21487;&#35299;&#37322;&#24615;&#21644;&#23545;&#20854;&#20182;&#19979;&#28216;&#25512;&#29702;&#20219;&#21153;&#30340;&#26377;&#38480;&#27867;&#21270;&#33021;&#21147;&#12290;&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#36890;&#36807;&#24341;&#20837;&#24191;&#20041;&#30340;&#35856;&#27874;&#25193;&#23637;&#26469;&#24357;&#21512;&#20256;&#32479;&#20256;&#23548;&#30693;&#35782;&#22270;&#23884;&#20837;&#26041;&#27861;&#21644;&#36739;&#26032;&#30340;&#24402;&#32435;&#20851;&#31995;&#39044;&#27979;&#27169;&#22411;&#20043;&#38388;&#30340;&#24046;&#36317;&#65292;&#36890;&#36807;&#21033;&#29992;&#36890;&#36807;&#20256;&#23548;&#23884;&#20837;&#26041;&#27861;&#23398;&#20064;&#30340;&#34920;&#31034;&#26469;&#25512;&#26029;&#22312;&#25512;&#29702;&#26102;&#24341;&#20837;&#30340;&#26032;&#23454;&#20307;&#30340;&#34920;&#31034;&#12290;
&lt;/p&gt;
&lt;p&gt;
Many downstream inference tasks for knowledge graphs, such as relation prediction, have been handled successfully by knowledge graph embedding techniques in the transductive setting. To address the inductive setting wherein new entities are introduced into the knowledge graph at inference time, more recent work opts for models which learn implicit representations of the knowledge graph through a complex function of a network's subgraph structure, often parametrized by graph neural network architectures. These come at the cost of increased parametrization, reduced interpretability and limited generalization to other downstream inference tasks. In this work, we bridge the gap between traditional transductive knowledge graph embedding approaches and more recent inductive relation prediction models by introducing a generalized form of harmonic extension which leverages representations learned through transductive embedding methods to infer representations of new entities introduced at infe
&lt;/p&gt;</description></item></channel></rss>