<rss version="2.0"><channel><title>Chat Arxiv cs.IR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.IR</description><item><title>&#26412;&#25945;&#31243;&#38024;&#23545;&#25512;&#33616;&#20013;&#30340;&#22270;&#31070;&#32463;&#32593;&#32476;&#30340;&#19977;&#20010;&#20851;&#38190;&#26041;&#38754;&#36827;&#34892;&#20102;&#25506;&#35752;&#65306;&#26368;&#20808;&#36827;&#26041;&#27861;&#30340;&#21487;&#22797;&#29616;&#24615;&#65292;&#22270;&#25299;&#25169;&#29305;&#24449;&#23545;&#27169;&#22411;&#24615;&#33021;&#30340;&#24433;&#21709;&#65292;&#20197;&#21450;&#23398;&#20064;&#33410;&#28857;&#34920;&#31034;&#30340;&#31574;&#30053;&#12290;</title><link>http://arxiv.org/abs/2310.11270</link><description>&lt;p&gt;
&#25512;&#33616;&#31995;&#32479;&#20013;&#30340;&#22270;&#31070;&#32463;&#32593;&#32476;: &#21487;&#22797;&#29616;&#24615;&#12289;&#22270;&#25299;&#25169;&#21644;&#33410;&#28857;&#34920;&#31034;
&lt;/p&gt;
&lt;p&gt;
Graph Neural Networks for Recommendation: Reproducibility, Graph Topology, and Node Representation. (arXiv:2310.11270v2 [cs.IR] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.11270
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25945;&#31243;&#38024;&#23545;&#25512;&#33616;&#20013;&#30340;&#22270;&#31070;&#32463;&#32593;&#32476;&#30340;&#19977;&#20010;&#20851;&#38190;&#26041;&#38754;&#36827;&#34892;&#20102;&#25506;&#35752;&#65306;&#26368;&#20808;&#36827;&#26041;&#27861;&#30340;&#21487;&#22797;&#29616;&#24615;&#65292;&#22270;&#25299;&#25169;&#29305;&#24449;&#23545;&#27169;&#22411;&#24615;&#33021;&#30340;&#24433;&#21709;&#65292;&#20197;&#21450;&#23398;&#20064;&#33410;&#28857;&#34920;&#31034;&#30340;&#31574;&#30053;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26368;&#36817;&#20960;&#24180;&#65292;&#22270;&#31070;&#32463;&#32593;&#32476;&#65288;GNNs&#65289;&#22312;&#25512;&#33616;&#31995;&#32479;&#20013;&#21464;&#24471;&#36234;&#26469;&#36234;&#37325;&#35201;&#12290;&#36890;&#36807;&#23558;&#29992;&#25143;-&#29289;&#21697;&#30697;&#38453;&#34920;&#31034;&#20026;&#19968;&#20010;&#20108;&#37096;&#22270;&#21644;&#26080;&#21521;&#22270;&#65292;GNN&#33021;&#22815;&#25429;&#25417;&#29992;&#25143;-&#29289;&#21697;&#20043;&#38388;&#30340;&#36817;&#36317;&#31163;&#21644;&#36828;&#36317;&#31163;&#20132;&#20114;&#65292;&#20174;&#32780;&#27604;&#20256;&#32479;&#25512;&#33616;&#26041;&#27861;&#23398;&#20064;&#21040;&#26356;&#20934;&#30830;&#30340;&#20559;&#22909;&#27169;&#24335;&#12290;&#19982;&#20043;&#21069;&#30340;&#21516;&#31867;&#25945;&#31243;&#19981;&#21516;&#65292;&#26412;&#25945;&#31243;&#26088;&#22312;&#23637;&#31034;&#21644;&#25506;&#35752;&#25512;&#33616;&#20013;GNNs&#30340;&#19977;&#20010;&#20851;&#38190;&#26041;&#38754;&#65306;&#65288;i&#65289;&#26368;&#20808;&#36827;&#26041;&#27861;&#30340;&#21487;&#22797;&#29616;&#24615;&#65292;&#65288;ii&#65289;&#22270;&#25299;&#25169;&#29305;&#24449;&#23545;&#27169;&#22411;&#24615;&#33021;&#30340;&#28508;&#22312;&#24433;&#21709;&#65292;&#20197;&#21450;&#65288;iii&#65289;&#22312;&#20174;&#38646;&#24320;&#22987;&#35757;&#32451;&#29305;&#24449;&#25110;&#21033;&#29992;&#39044;&#35757;&#32451;&#23884;&#20837;&#20316;&#20026;&#39069;&#22806;&#29289;&#21697;&#20449;&#24687;&#65288;&#20363;&#22914;&#22810;&#27169;&#24577;&#29305;&#24449;&#65289;&#26102;&#65292;&#23398;&#20064;&#33410;&#28857;&#34920;&#31034;&#30340;&#31574;&#30053;&#12290;&#25105;&#20204;&#30340;&#30446;&#26631;&#26159;&#20026;&#35813;&#39046;&#22495;&#25552;&#20379;&#19977;&#20010;&#26032;&#39062;&#30340;&#29702;&#35770;&#21644;&#23454;&#36341;&#35270;&#35282;&#65292;&#30446;&#21069;&#22312;&#22270;&#23398;&#20064;&#20013;&#23384;&#22312;&#20105;&#35758;&#12290;
&lt;/p&gt;
&lt;p&gt;
Graph neural networks (GNNs) have gained prominence in recommendation systems in recent years. By representing the user-item matrix as a bipartite and undirected graph, GNNs have demonstrated their potential to capture short- and long-distance user-item interactions, thereby learning more accurate preference patterns than traditional recommendation approaches. In contrast to previous tutorials on the same topic, this tutorial aims to present and examine three key aspects that characterize GNNs for recommendation: (i) the reproducibility of state-of-the-art approaches, (ii) the potential impact of graph topological characteristics on the performance of these models, and (iii) strategies for learning node representations when training features from scratch or utilizing pre-trained embeddings as additional item information (e.g., multimodal features). The goal is to provide three novel theoretical and practical perspectives on the field, currently subject to debate in graph learning but l
&lt;/p&gt;</description></item><item><title>&#36825;&#39033;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#20174;&#19987;&#21033;&#25991;&#20214;&#20013;&#25552;&#21462;&#24037;&#31243;&#35774;&#35745;&#30693;&#35782;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#26500;&#24314;&#30693;&#35782;&#22270;&#26469;&#22635;&#20805;&#36890;&#29992;&#35774;&#35745;&#30693;&#35782;&#65292;&#24182;&#19982;&#29616;&#26377;&#26041;&#27861;&#36827;&#34892;&#20102;&#27604;&#36739;&#12290;</title><link>http://arxiv.org/abs/2307.06985</link><description>&lt;p&gt;
&#36808;&#21521;&#22635;&#20805;&#36890;&#29992;&#24037;&#31243;&#35774;&#35745;&#30693;&#35782;&#30340;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Towards Populating Generalizable Engineering Design Knowledge. (arXiv:2307.06985v1 [cs.CL])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.06985
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#20174;&#19987;&#21033;&#25991;&#20214;&#20013;&#25552;&#21462;&#24037;&#31243;&#35774;&#35745;&#30693;&#35782;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#26500;&#24314;&#30693;&#35782;&#22270;&#26469;&#22635;&#20805;&#36890;&#29992;&#35774;&#35745;&#30693;&#35782;&#65292;&#24182;&#19982;&#29616;&#26377;&#26041;&#27861;&#36827;&#34892;&#20102;&#27604;&#36739;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20026;&#20102;&#22635;&#20805;&#36890;&#29992;&#24037;&#31243;&#35774;&#35745;&#30693;&#35782;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#20174;&#19987;&#21033;&#25991;&#20214;&#20013;&#25552;&#21462;head entity :: relationship :: tail entity&#24418;&#24335;&#20107;&#23454;&#30340;&#26041;&#27861;&#12290;&#36825;&#20123;&#20107;&#23454;&#21487;&#20197;&#22312;&#19987;&#21033;&#25991;&#20214;&#20869;&#37096;&#21644;&#36328;&#25991;&#20214;&#20043;&#38388;&#32452;&#21512;&#24418;&#25104;&#30693;&#35782;&#22270;&#65292;&#29992;&#20316;&#34920;&#31034;&#21644;&#23384;&#20648;&#35774;&#35745;&#30693;&#35782;&#30340;&#26041;&#26696;&#12290;&#29616;&#26377;&#30340;&#24037;&#31243;&#35774;&#35745;&#25991;&#29486;&#20013;&#30340;&#26041;&#27861;&#36890;&#24120;&#21033;&#29992;&#19968;&#32452;&#39044;&#23450;&#20041;&#30340;&#20851;&#31995;&#26469;&#22635;&#20805;&#32479;&#35745;&#36817;&#20284;&#32780;&#38750;&#20107;&#23454;&#30340;&#19977;&#20803;&#32452;&#12290;&#22312;&#25105;&#20204;&#30340;&#26041;&#27861;&#20013;&#65292;&#25105;&#20204;&#35757;&#32451;&#19968;&#20010;&#26631;&#35760;&#22120;&#26469;&#35782;&#21035;&#21477;&#23376;&#20013;&#30340;&#23454;&#20307;&#21644;&#20851;&#31995;&#12290;&#22312;&#30830;&#23450;&#20102;&#19968;&#23545;&#23454;&#20307;&#21518;&#65292;&#25105;&#20204;&#35757;&#32451;&#21478;&#19968;&#20010;&#26631;&#35760;&#22120;&#26469;&#35782;&#21035;&#29305;&#23450;&#34920;&#31034;&#36825;&#23545;&#23454;&#20307;&#20043;&#38388;&#20851;&#31995;&#30340;&#20851;&#31995;&#26631;&#35760;&#12290;&#20026;&#20102;&#35757;&#32451;&#36825;&#20123;&#26631;&#35760;&#22120;&#65292;&#25105;&#20204;&#25163;&#21160;&#26500;&#24314;&#20102;&#19968;&#20010;&#21253;&#21547;44,227&#20010;&#21477;&#23376;&#21644;&#30456;&#24212;&#20107;&#23454;&#30340;&#25968;&#25454;&#38598;&#12290;&#25105;&#20204;&#36824;&#23558;&#35813;&#26041;&#27861;&#30340;&#24615;&#33021;&#19982;&#36890;&#24120;&#25512;&#33616;&#30340;&#26041;&#27861;&#36827;&#34892;&#20102;&#27604;&#36739;&#65292;&#20854;&#20013;&#25105;&#20204;&#39044;.
&lt;/p&gt;
&lt;p&gt;
Aiming to populate generalizable engineering design knowledge, we propose a method to extract facts of the form head entity :: relationship :: tail entity from sentences found in patent documents. These facts could be combined within and across patent documents to form knowledge graphs that serve as schemes for representing as well as storing design knowledge. Existing methods in engineering design literature often utilise a set of predefined relationships to populate triples that are statistical approximations rather than facts. In our method, we train a tagger to identify both entities and relationships from a sentence. Given a pair of entities thus identified, we train another tagger to identify the relationship tokens that specifically denote the relationship between the pair. For training these taggers, we manually construct a dataset of 44,227 sentences and corresponding facts. We also compare the performance of the method against typically recommended approaches, wherein, we pre
&lt;/p&gt;</description></item></channel></rss>