<rss version="2.0"><channel><title>Chat Arxiv cs.IR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.IR</description><item><title>&#31038;&#21306;&#24212;&#35813;&#37325;&#26032;&#23558;&#30740;&#31350;&#35758;&#31243;&#32858;&#28966;&#20110;&#31038;&#20250;&#38656;&#27714;&#65292;&#28040;&#38500;&#20844;&#24179;&#24615;&#12289;&#38382;&#36131;&#21046;&#12289;&#36879;&#26126;&#24230;&#21644;&#36947;&#24503;&#30740;&#31350;&#19982;&#20449;&#24687;&#26816;&#32034;&#20854;&#20182;&#39046;&#22495;&#20043;&#38388;&#30340;&#20154;&#20026;&#38548;&#31163;&#65292;&#31215;&#26497;&#35774;&#23450;&#30740;&#31350;&#35758;&#31243;&#65292;&#28608;&#21169;&#26500;&#24314;&#26126;&#30830;&#38472;&#36848;&#30340;&#31038;&#20250;&#25216;&#26415;&#24819;&#35937;&#21147;&#25152;&#21551;&#21457;&#30340;&#31995;&#32479;&#31867;&#22411;&#12290;</title><link>https://arxiv.org/abs/2403.17901</link><description>&lt;p&gt;
&#25628;&#32034;&#19982;&#31038;&#20250;&#65306;&#37325;&#26032;&#26500;&#24819;&#28608;&#36827;&#26410;&#26469;&#30340;&#20449;&#24687;&#33719;&#21462;
&lt;/p&gt;
&lt;p&gt;
Search and Society: Reimagining Information Access for Radical Futures
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.17901
&lt;/p&gt;
&lt;p&gt;
&#31038;&#21306;&#24212;&#35813;&#37325;&#26032;&#23558;&#30740;&#31350;&#35758;&#31243;&#32858;&#28966;&#20110;&#31038;&#20250;&#38656;&#27714;&#65292;&#28040;&#38500;&#20844;&#24179;&#24615;&#12289;&#38382;&#36131;&#21046;&#12289;&#36879;&#26126;&#24230;&#21644;&#36947;&#24503;&#30740;&#31350;&#19982;&#20449;&#24687;&#26816;&#32034;&#20854;&#20182;&#39046;&#22495;&#20043;&#38388;&#30340;&#20154;&#20026;&#38548;&#31163;&#65292;&#31215;&#26497;&#35774;&#23450;&#30740;&#31350;&#35758;&#31243;&#65292;&#28608;&#21169;&#26500;&#24314;&#26126;&#30830;&#38472;&#36848;&#30340;&#31038;&#20250;&#25216;&#26415;&#24819;&#35937;&#21147;&#25152;&#21551;&#21457;&#30340;&#31995;&#32479;&#31867;&#22411;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
arXiv: 2403.17901v1 &#20844;&#21578;&#31867;&#22411;&#65306;&#26032;&#25688;&#35201;&#65306;&#20449;&#24687;&#26816;&#32034;&#65288;IR&#65289;&#25216;&#26415;&#21644;&#30740;&#31350;&#27491;&#22312;&#32463;&#21382;&#21464;&#38761;&#12290;&#25105;&#20204;&#35748;&#20026;&#31038;&#21306;&#24212;&#35813;&#25235;&#20303;&#36825;&#20010;&#26426;&#20250;&#65292;&#37325;&#26032;&#23558;&#30740;&#31350;&#35758;&#31243;&#32858;&#28966;&#20110;&#31038;&#20250;&#38656;&#27714;&#65292;&#21516;&#26102;&#28040;&#38500;IR&#30340;&#20844;&#24179;&#24615;&#12289;&#38382;&#36131;&#21046;&#12289;&#36879;&#26126;&#24230;&#21644;&#36947;&#24503;&#30740;&#31350;&#19982;IR&#20854;&#20182;&#39046;&#22495;&#20043;&#38388;&#30340;&#20154;&#20026;&#38548;&#31163;&#12290;&#31038;&#21306;&#19981;&#24212;&#37319;&#21462;&#35797;&#22270;&#20943;&#36731;&#26032;&#20852;&#25216;&#26415;&#21487;&#33021;&#24102;&#26469;&#31038;&#20250;&#23475;&#22788;&#30340;&#21453;&#24212;&#24615;&#31574;&#30053;&#65292;&#32780;&#24212;&#35813;&#31215;&#26497;&#35774;&#23450;&#30740;&#31350;&#35758;&#31243;&#65292;&#28608;&#21169;&#25105;&#20204;&#26500;&#24314;&#21508;&#31181;&#26126;&#30830;&#38472;&#36848;&#30340;&#31038;&#20250;&#25216;&#26415;&#24819;&#35937;&#21147;&#25152;&#21551;&#21457;&#30340;&#31995;&#32479;&#31867;&#22411;&#12290;&#25903;&#25745;&#20449;&#24687;&#33719;&#21462;&#25216;&#26415;&#35774;&#35745;&#21644;&#24320;&#21457;&#30340;&#31038;&#20250;&#25216;&#26415;&#24819;&#35937;&#21147;&#38656;&#35201;&#26126;&#30830;&#34920;&#36798;&#65292;&#25105;&#20204;&#38656;&#35201;&#22312;&#36825;&#20123;&#19981;&#21516;&#35270;&#35282;&#30340;&#32972;&#26223;&#19979;&#21457;&#23637;&#21464;&#38761;&#29702;&#35770;&#12290;&#25105;&#20204;&#30340;&#25351;&#23548;&#26410;&#26469;&#24819;&#35937;&#21147;&#24517;&#39035;&#21463;&#21040;&#20854;&#20182;&#23398;&#26415;&#39046;&#22495;&#30340;&#21551;&#21457;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.17901v1 Announce Type: new  Abstract: Information retrieval (IR) technologies and research are undergoing transformative changes. It is our perspective that the community should accept this opportunity to re-center our research agendas on societal needs while dismantling the artificial separation between the work on fairness, accountability, transparency, and ethics in IR and the rest of IR research. Instead of adopting a reactionary strategy of trying to mitigate potential social harms from emerging technologies, the community should aim to proactively set the research agenda for the kinds of systems we should build inspired by diverse explicitly stated sociotechnical imaginaries. The sociotechnical imaginaries that underpin the design and development of information access technologies needs to be explicitly articulated, and we need to develop theories of change in context of these diverse perspectives. Our guiding future imaginaries must be informed by other academic field
&lt;/p&gt;</description></item><item><title>ICPE&#26159;&#19968;&#31181;&#38754;&#21521;&#25512;&#33616;&#21435;&#20559;&#20506;&#30340;&#39033;&#30446;&#32858;&#31867;&#22810;&#30446;&#26631;&#20248;&#21270;&#26694;&#26550;&#65292;&#36890;&#36807;&#24179;&#34913;&#19981;&#21516;&#27969;&#34892;&#24230;&#30340;&#39033;&#30446;&#32858;&#31867;&#30340;&#23398;&#20064;&#65292;&#35299;&#20915;&#20102;&#25512;&#33616;&#27169;&#22411;&#20174;&#20559;&#20506;&#25968;&#25454;&#29983;&#25104;&#25512;&#33616;&#30340;&#38382;&#39064;&#65292;&#23454;&#29616;&#20102;&#23545;&#28508;&#22312;&#26377;&#36259;&#39033;&#30446;&#30340;&#25506;&#32034;&#12290;</title><link>http://arxiv.org/abs/2109.12887</link><description>&lt;p&gt;
ICPE:&#19968;&#31181;&#38754;&#21521;&#25512;&#33616;&#21435;&#20559;&#20506;&#30340;&#39033;&#30446;&#32858;&#31867;&#22810;&#30446;&#26631;&#20248;&#21270;&#26694;&#26550;
&lt;/p&gt;
&lt;p&gt;
ICPE: An Item Cluster-Wise Pareto-Efficient Framework for Recommendation Debiasing. (arXiv:2109.12887v4 [cs.IR] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2109.12887
&lt;/p&gt;
&lt;p&gt;
ICPE&#26159;&#19968;&#31181;&#38754;&#21521;&#25512;&#33616;&#21435;&#20559;&#20506;&#30340;&#39033;&#30446;&#32858;&#31867;&#22810;&#30446;&#26631;&#20248;&#21270;&#26694;&#26550;&#65292;&#36890;&#36807;&#24179;&#34913;&#19981;&#21516;&#27969;&#34892;&#24230;&#30340;&#39033;&#30446;&#32858;&#31867;&#30340;&#23398;&#20064;&#65292;&#35299;&#20915;&#20102;&#25512;&#33616;&#27169;&#22411;&#20174;&#20559;&#20506;&#25968;&#25454;&#29983;&#25104;&#25512;&#33616;&#30340;&#38382;&#39064;&#65292;&#23454;&#29616;&#20102;&#23545;&#28508;&#22312;&#26377;&#36259;&#39033;&#30446;&#30340;&#25506;&#32034;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22522;&#20110;&#21382;&#21490;&#29992;&#25143;-&#39033;&#30446;&#20132;&#20114;&#30340;&#25512;&#33616;&#31995;&#32479;&#23545;&#20110;&#22522;&#20110;web&#30340;&#26381;&#21153;&#33267;&#20851;&#37325;&#35201;&#12290;&#28982;&#32780;&#65292;&#29992;&#20110;&#35757;&#32451;&#25512;&#33616;&#27169;&#22411;&#30340;&#35266;&#23519;&#25968;&#25454;&#23384;&#22312;&#20005;&#37325;&#30340;&#20559;&#20506;&#38382;&#39064;&#12290;&#23454;&#38469;&#19978;&#65292;&#25968;&#25454;&#38598;&#30340;&#39033;&#30446;&#39057;&#29575;&#20998;&#24067;&#21576;&#39640;&#24230;&#20559;&#26012;&#30340;&#24130;&#24459;&#20998;&#24067;&#12290;&#19968;&#23567;&#37096;&#20998;&#28909;&#38376;&#39033;&#30446;&#30340;&#20132;&#20114;&#20960;&#20046;&#21344;&#25454;&#20102;&#25972;&#20010;&#35757;&#32451;&#25968;&#25454;&#12290;&#20174;&#36825;&#31181;&#20559;&#20506;&#25968;&#25454;&#35757;&#32451;&#30340;&#27491;&#24120;&#27169;&#22411;&#20542;&#21521;&#20110;&#37325;&#22797;&#29983;&#25104;&#26469;&#33258;&#28909;&#38376;&#39033;&#30446;&#30340;&#25512;&#33616;&#65292;&#36827;&#19968;&#27493;&#21152;&#21095;&#20102;&#20559;&#20506;&#24182;&#24433;&#21709;&#20102;&#23545;&#28508;&#22312;&#26377;&#36259;&#39033;&#30446;&#30340;&#25506;&#32034;&#12290;&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#20174;&#39033;&#30446;&#32858;&#31867;&#30340;&#22810;&#30446;&#26631;&#20248;&#21270;&#35270;&#35282;&#21019;&#26032;&#24615;&#22320;&#25506;&#32034;&#25512;&#33616;&#21435;&#20559;&#20506;&#30340;&#26680;&#24515;&#20027;&#39064;&#12290;&#20026;&#20102;&#22312;&#35757;&#32451;&#36807;&#31243;&#20013;&#24179;&#34913;&#23545;&#19981;&#21516;&#27969;&#34892;&#24230;&#30340;&#39033;&#30446;&#32858;&#31867;&#30340;&#23398;&#20064;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#27169;&#22411;&#26080;&#20851;&#30340;&#26694;&#26550;&#65292;&#21363;Item Cluster-Wise Pareto-Efficient Recommendation&#65288;ICPE&#65289;&#12290;
&lt;/p&gt;
&lt;p&gt;
Recommender system based on historical user-item interactions is of vital importance for web-based services. However, the observed data used to train the recommender model suffers from severe bias issues. Practically, the item frequency distribution of the dataset is a highly skewed power-law distribution. Interactions of a small fraction of head items account for almost the whole training data. The normal training paradigm from such biased data tends to repetitively generate recommendations from the head items, which further exacerbates the biases and affects the exploration of potentially interesting items from the niche set. In this work, we innovatively explore the central theme of recommendation debiasing from an item cluster-wise multi-objective optimization perspective. Aiming to balance the learning on various item clusters that differ in popularity during the training process, we propose a model-agnostic framework namely Item Cluster-Wise Pareto-Efficient Recommendation (ICPE)
&lt;/p&gt;</description></item></channel></rss>