<rss version="2.0"><channel><title>Chat Arxiv cs.IR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.IR</description><item><title>&#35813;&#30740;&#31350;&#25506;&#35752;&#20102;&#35825;&#39285;&#25928;&#24212;&#23545;&#29992;&#25143;&#25628;&#32034;&#20132;&#20114;&#30340;&#24433;&#21709;&#65292;&#25552;&#20986;&#20102;&#26032;&#30340;&#34913;&#37327;IR&#31995;&#32479;&#33030;&#24369;&#24615;&#30340;&#26041;&#27861;&#65292;&#24182;&#20171;&#32461;&#20102;DEJA-VU&#25351;&#26631;&#26469;&#35780;&#20272;&#31995;&#32479;&#23545;&#35825;&#39285;&#25928;&#24212;&#30340;&#26131;&#24863;&#24615;&#12290;</title><link>https://arxiv.org/abs/2403.18462</link><description>&lt;p&gt;
&#25628;&#32034;&#20132;&#20114;&#20013;&#30340;&#35825;&#39285;&#25928;&#24212;&#65306;&#29702;&#35299;&#29992;&#25143;&#34892;&#20026;&#21644;&#27979;&#37327;&#31995;&#32479;&#33030;&#24369;&#24615;
&lt;/p&gt;
&lt;p&gt;
Decoy Effect In Search Interaction: Understanding User Behavior and Measuring System Vulnerability
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.18462
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#25506;&#35752;&#20102;&#35825;&#39285;&#25928;&#24212;&#23545;&#29992;&#25143;&#25628;&#32034;&#20132;&#20114;&#30340;&#24433;&#21709;&#65292;&#25552;&#20986;&#20102;&#26032;&#30340;&#34913;&#37327;IR&#31995;&#32479;&#33030;&#24369;&#24615;&#30340;&#26041;&#27861;&#65292;&#24182;&#20171;&#32461;&#20102;DEJA-VU&#25351;&#26631;&#26469;&#35780;&#20272;&#31995;&#32479;&#23545;&#35825;&#39285;&#25928;&#24212;&#30340;&#26131;&#24863;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#32771;&#23519;&#20102;&#35825;&#39285;&#25928;&#24212;&#23545;&#29992;&#25143;&#25628;&#32034;&#20132;&#20114;&#30340;&#24433;&#21709;&#65292;&#20197;&#21450;&#34913;&#37327;&#20449;&#24687;&#26816;&#32034;&#65288;IR&#65289;&#31995;&#32479;&#23545;&#36825;&#31181;&#24433;&#21709;&#30340;&#33030;&#24369;&#24615;&#30340;&#26041;&#27861;&#12290;&#23427;&#25506;&#35752;&#20102;&#35825;&#39285;&#32467;&#26524;&#22914;&#20309;&#25913;&#21464;&#29992;&#25143;&#22312;&#25628;&#32034;&#24341;&#25806;&#32467;&#26524;&#39029;&#38754;&#19978;&#30340;&#20132;&#20114;&#65292;&#20851;&#27880;&#28857;&#20987;&#27010;&#29575;&#12289;&#27983;&#35272;&#26102;&#38388;&#21644;&#24863;&#30693;&#25991;&#26723;&#26377;&#29992;&#24615;&#31561;&#25351;&#26631;&#12290;&#36890;&#36807;&#20998;&#26512;&#26469;&#33258;&#22810;&#20010;&#25968;&#25454;&#38598;&#30340;&#29992;&#25143;&#20132;&#20114;&#26085;&#24535;&#65292;&#30740;&#31350;&#34920;&#26126;&#35825;&#39285;&#32467;&#26524;&#26174;&#33879;&#24433;&#21709;&#29992;&#25143;&#34892;&#20026;&#21644;&#24863;&#30693;&#12290;&#27492;&#22806;&#65292;&#30740;&#31350;&#36824;&#35843;&#26597;&#20102;&#19981;&#21516;&#20219;&#21153;&#38590;&#24230;&#21644;&#29992;&#25143;&#30693;&#35782;&#27700;&#24179;&#22914;&#20309;&#20462;&#25913;&#35825;&#39285;&#25928;&#24212;&#30340;&#24433;&#21709;&#65292;&#21457;&#29616;&#26356;&#23481;&#26131;&#30340;&#20219;&#21153;&#21644;&#36739;&#20302;&#30340;&#30693;&#35782;&#27700;&#24179;&#20250;&#23548;&#33268;&#26356;&#39640;&#30340;&#30446;&#26631;&#25991;&#26723;&#21442;&#19982;&#24230;&#12290;&#22312;IR&#31995;&#32479;&#35780;&#20272;&#26041;&#38754;&#65292;&#30740;&#31350;&#24341;&#20837;&#20102;DEJA-VU&#25351;&#26631;&#26469;&#35780;&#20272;&#31995;&#32479;&#23545;&#35825;&#39285;&#25928;&#24212;&#30340;&#26131;&#24863;&#24615;&#65292;&#24182;&#22312;&#29305;&#23450;&#26816;&#32034;&#20219;&#21153;&#19978;&#36827;&#34892;&#27979;&#35797;&#12290;&#32467;&#26524;&#26174;&#31034;&#22312;&#31995;&#32479;&#19978;&#23384;&#22312;&#24046;&#24322;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.18462v1 Announce Type: new  Abstract: This study examines the decoy effect's underexplored influence on user search interactions and methods for measuring information retrieval (IR) systems' vulnerability to this effect. It explores how decoy results alter users' interactions on search engine result pages, focusing on metrics like click-through likelihood, browsing time, and perceived document usefulness. By analyzing user interaction logs from multiple datasets, the study demonstrates that decoy results significantly affect users' behavior and perceptions. Furthermore, it investigates how different levels of task difficulty and user knowledge modify the decoy effect's impact, finding that easier tasks and lower knowledge levels lead to higher engagement with target documents. In terms of IR system evaluation, the study introduces the DEJA-VU metric to assess systems' susceptibility to the decoy effect, testing it on specific retrieval tasks. The results show differences in 
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22312;&#20004;&#22612;&#25512;&#33616;&#27169;&#22411;&#20013;&#20351;&#29992;&#21333;&#27425;&#21453;&#21521;&#20256;&#25773;&#26356;&#26032;&#31574;&#30053;&#30340;&#26041;&#27861;&#65292;&#25361;&#25112;&#20102;&#29616;&#26377;&#31639;&#27861;&#20013;&#24179;&#31561;&#23545;&#24453;&#29992;&#25143;&#21644;&#29289;&#21697;&#30340;&#20551;&#35774;&#12290;</title><link>https://arxiv.org/abs/2403.18227</link><description>&lt;p&gt;
&#20004;&#22612;&#25512;&#33616;&#27169;&#22411;&#20013;&#30340;&#21333;&#27425;&#21453;&#21521;&#20256;&#25773;
&lt;/p&gt;
&lt;p&gt;
One Backpropagation in Two Tower Recommendation Models
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.18227
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22312;&#20004;&#22612;&#25512;&#33616;&#27169;&#22411;&#20013;&#20351;&#29992;&#21333;&#27425;&#21453;&#21521;&#20256;&#25773;&#26356;&#26032;&#31574;&#30053;&#30340;&#26041;&#27861;&#65292;&#25361;&#25112;&#20102;&#29616;&#26377;&#31639;&#27861;&#20013;&#24179;&#31561;&#23545;&#24453;&#29992;&#25143;&#21644;&#29289;&#21697;&#30340;&#20551;&#35774;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26368;&#36817;&#20960;&#24180;&#65292;&#24050;&#32463;&#30475;&#21040;&#20026;&#20102;&#20943;&#36731;&#20449;&#24687;&#36807;&#36733;&#32780;&#24320;&#21457;&#20004;&#22612;&#25512;&#33616;&#27169;&#22411;&#30340;&#24191;&#27867;&#30740;&#31350;&#12290;&#36825;&#31181;&#27169;&#22411;&#20013;&#21487;&#20197;&#35782;&#21035;&#20986;&#22235;&#20010;&#26500;&#24314;&#27169;&#22359;&#65292;&#20998;&#21035;&#26159;&#29992;&#25143;-&#29289;&#21697;&#32534;&#30721;&#12289;&#36127;&#37319;&#26679;&#12289;&#25439;&#22833;&#35745;&#31639;&#21644;&#21453;&#21521;&#20256;&#25773;&#26356;&#26032;&#12290;&#25454;&#25105;&#20204;&#25152;&#30693;&#65292;&#29616;&#26377;&#31639;&#27861;&#20165;&#30740;&#31350;&#20102;&#21069;&#19977;&#20010;&#27169;&#22359;&#65292;&#21364;&#24573;&#30053;&#20102;&#21453;&#21521;&#20256;&#25773;&#27169;&#22359;&#12290;&#20182;&#20204;&#37117;&#37319;&#29992;&#26576;&#31181;&#24418;&#24335;&#30340;&#21452;&#21453;&#21521;&#20256;&#25773;&#31574;&#30053;&#65292;&#22522;&#20110;&#19968;&#20010;&#38544;&#21547;&#30340;&#20551;&#35774;&#65292;&#21363;&#22312;&#35757;&#32451;&#38454;&#27573;&#24179;&#31561;&#23545;&#24453;&#29992;&#25143;&#21644;&#29289;&#21697;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25361;&#25112;&#20102;&#36825;&#31181;&#24179;&#31561;&#35757;&#32451;&#20551;&#35774;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#21333;&#27425;&#21453;&#21521;&#20256;&#25773;&#26356;&#26032;&#31574;&#30053;&#65292;&#36825;&#31181;&#31574;&#30053;&#20445;&#30041;&#20102;&#29289;&#21697;&#32534;&#30721;&#22612;&#30340;&#27491;&#24120;&#26799;&#24230;&#21453;&#21521;&#20256;&#25773;&#65292;&#20294;&#21066;&#20943;&#20102;&#29992;&#25143;&#32534;&#30721;&#22612;&#30340;&#21453;&#21521;&#20256;&#25773;&#12290;&#30456;&#21453;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#31227;&#21160;&#32858;&#21512;&#26356;&#26032;&#31574;&#30053;&#26469;&#26356;&#26032;&#27599;&#20010;&#35757;&#32451;&#21608;&#26399;&#20013;&#30340;&#29992;&#25143;&#32534;&#30721;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.18227v1 Announce Type: new  Abstract: Recent years have witnessed extensive researches on developing two tower recommendation models for relieving information overload. Four building modules can be identified in such models, namely, user-item encoding, negative sampling, loss computing and back-propagation updating. To the best of our knowledge, existing algorithms have researched only on the first three modules, yet neglecting the backpropagation module. They all adopt a kind of two backpropagation strategy, which are based on an implicit assumption of equally treating users and items in the training phase. In this paper, we challenge such an equal training assumption and propose a novel one backpropagation updating strategy, which keeps the normal gradient backpropagation for the item encoding tower, but cuts off the backpropagation for the user encoding tower. Instead, we propose a moving-aggregation updating strategy to update a user encoding in each training epoch. Exce
&lt;/p&gt;</description></item><item><title>ConFIRM&#26159;&#19968;&#31181;&#20250;&#35805;&#24335;&#37329;&#34701;&#20449;&#24687;&#26816;&#32034;&#27169;&#22411;&#65292;&#36890;&#36807;&#21512;&#25104;&#37329;&#34701;&#39046;&#22495;&#29305;&#23450;&#38382;&#31572;&#23545;&#21644;&#35780;&#20272;&#21442;&#25968;&#24494;&#35843;&#26041;&#27861;&#65292;&#23454;&#29616;&#20102;&#36229;&#36807;90%&#30340;&#20934;&#30830;&#24615;&#65292;&#20026;&#37329;&#34701;&#23545;&#35805;&#31995;&#32479;&#25552;&#20379;&#20102;&#25968;&#25454;&#39640;&#25928;&#30340;&#35299;&#20915;&#26041;&#26696;&#12290;</title><link>http://arxiv.org/abs/2310.13001</link><description>&lt;p&gt;
&#20250;&#35805;&#24335;&#37329;&#34701;&#20449;&#24687;&#26816;&#32034;&#27169;&#22411;&#65288;ConFIRM&#65289;
&lt;/p&gt;
&lt;p&gt;
Conversational Financial Information Retrieval Model (ConFIRM). (arXiv:2310.13001v1 [cs.IR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.13001
&lt;/p&gt;
&lt;p&gt;
ConFIRM&#26159;&#19968;&#31181;&#20250;&#35805;&#24335;&#37329;&#34701;&#20449;&#24687;&#26816;&#32034;&#27169;&#22411;&#65292;&#36890;&#36807;&#21512;&#25104;&#37329;&#34701;&#39046;&#22495;&#29305;&#23450;&#38382;&#31572;&#23545;&#21644;&#35780;&#20272;&#21442;&#25968;&#24494;&#35843;&#26041;&#27861;&#65292;&#23454;&#29616;&#20102;&#36229;&#36807;90%&#30340;&#20934;&#30830;&#24615;&#65292;&#20026;&#37329;&#34701;&#23545;&#35805;&#31995;&#32479;&#25552;&#20379;&#20102;&#25968;&#25454;&#39640;&#25928;&#30340;&#35299;&#20915;&#26041;&#26696;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38543;&#30528;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLM&#65289;&#30340;&#25351;&#25968;&#32423;&#22686;&#38271;&#65292;&#21033;&#29992;&#23427;&#20204;&#22312;&#37329;&#34701;&#31561;&#19987;&#38376;&#39046;&#22495;&#30340;&#26032;&#20852;&#29305;&#24615;&#20855;&#26377;&#25506;&#32034;&#30340;&#20215;&#20540;&#12290;&#28982;&#32780;&#65292;&#37329;&#34701;&#31561;&#21463;&#30417;&#31649;&#39046;&#22495;&#20855;&#26377;&#29420;&#29305;&#30340;&#32422;&#26463;&#26465;&#20214;&#65292;&#38656;&#35201;&#20855;&#22791;&#38024;&#23545;&#35813;&#39046;&#22495;&#30340;&#20248;&#21270;&#26694;&#26550;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;ConFIRM&#65292;&#19968;&#31181;&#22522;&#20110;LLM&#30340;&#20250;&#35805;&#24335;&#37329;&#34701;&#20449;&#24687;&#26816;&#32034;&#27169;&#22411;&#65292;&#29992;&#20110;&#26597;&#35810;&#24847;&#22270;&#20998;&#31867;&#21644;&#30693;&#35782;&#24211;&#26631;&#35760;&#12290;ConFIRM&#21253;&#25324;&#20004;&#20010;&#27169;&#22359;&#65306;1&#65289;&#19968;&#31181;&#21512;&#25104;&#37329;&#34701;&#39046;&#22495;&#29305;&#23450;&#38382;&#31572;&#23545;&#30340;&#26041;&#27861;&#65292;&#20197;&#21450;2&#65289;&#35780;&#20272;&#21442;&#25968;&#39640;&#25928;&#30340;&#24494;&#35843;&#26041;&#27861;&#26469;&#36827;&#34892;&#26597;&#35810;&#20998;&#31867;&#20219;&#21153;&#12290;&#25105;&#20204;&#29983;&#25104;&#20102;&#19968;&#20010;&#21253;&#21547;4000&#22810;&#20010;&#26679;&#26412;&#30340;&#25968;&#25454;&#38598;&#65292;&#24182;&#22312;&#21333;&#29420;&#30340;&#27979;&#35797;&#38598;&#19978;&#35780;&#20272;&#20102;&#20934;&#30830;&#24615;&#12290;ConFIRM&#23454;&#29616;&#20102;&#36229;&#36807;90%&#30340;&#20934;&#30830;&#24615;&#65292;&#36825;&#23545;&#20110;&#31526;&#21512;&#30417;&#31649;&#35201;&#27714;&#33267;&#20851;&#37325;&#35201;&#12290;ConFIRM&#25552;&#20379;&#20102;&#19968;&#31181;&#25968;&#25454;&#39640;&#25928;&#30340;&#35299;&#20915;&#26041;&#26696;&#65292;&#29992;&#20110;&#25552;&#21462;&#37329;&#34701;&#23545;&#35805;&#31995;&#32479;&#30340;&#31934;&#30830;&#26597;&#35810;&#24847;&#22270;&#12290;
&lt;/p&gt;
&lt;p&gt;
With the exponential growth in large language models (LLMs), leveraging their emergent properties for specialized domains like finance merits exploration. However, regulated fields such as finance pose unique constraints, requiring domain-optimized frameworks. We present ConFIRM, an LLM-based conversational financial information retrieval model tailored for query intent classification and knowledge base labeling.  ConFIRM comprises two modules:  1) a method to synthesize finance domain-specific question-answer pairs, and  2) evaluation of parameter efficient fine-tuning approaches for the query classification task. We generate a dataset of over 4000 samples, assessing accuracy on a separate test set.  ConFIRM achieved over 90% accuracy, essential for regulatory compliance. ConFIRM provides a data-efficient solution to extract precise query intent for financial dialog systems.
&lt;/p&gt;</description></item><item><title>SR-PredictAO&#26159;&#19968;&#31181;&#22522;&#20110;&#20250;&#35805;&#30340;&#25512;&#33616;&#31995;&#32479;&#65292;&#36890;&#36807;&#24341;&#20837;&#39640;&#33021;&#21147;&#39044;&#27979;&#22120;&#27169;&#22359;&#65292;&#35299;&#20915;&#20102;&#29616;&#26377;&#27169;&#22411;&#20013;&#20302;&#33021;&#21147;&#39044;&#27979;&#22120;&#27169;&#22359;&#30340;&#38382;&#39064;&#65292;&#21487;&#20197;&#22312;&#23384;&#22312;&#38543;&#26426;&#29992;&#25143;&#34892;&#20026;&#30340;&#24773;&#20917;&#19979;&#39044;&#27979;&#29992;&#25143;&#30340;&#19979;&#19968;&#20010;&#21160;&#20316;&#12290;</title><link>http://arxiv.org/abs/2309.12218</link><description>&lt;p&gt;
SR-PredictAO: &#20855;&#26377;&#39640;&#33021;&#21147;&#39044;&#27979;&#22120;&#38468;&#21152;&#20214;&#30340;&#22522;&#20110;&#20250;&#35805;&#30340;&#25512;&#33616;&#31995;&#32479;
&lt;/p&gt;
&lt;p&gt;
SR-PredictAO: Session-based Recommendation with High-Capability Predictor Add-On. (arXiv:2309.12218v1 [cs.IR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.12218
&lt;/p&gt;
&lt;p&gt;
SR-PredictAO&#26159;&#19968;&#31181;&#22522;&#20110;&#20250;&#35805;&#30340;&#25512;&#33616;&#31995;&#32479;&#65292;&#36890;&#36807;&#24341;&#20837;&#39640;&#33021;&#21147;&#39044;&#27979;&#22120;&#27169;&#22359;&#65292;&#35299;&#20915;&#20102;&#29616;&#26377;&#27169;&#22411;&#20013;&#20302;&#33021;&#21147;&#39044;&#27979;&#22120;&#27169;&#22359;&#30340;&#38382;&#39064;&#65292;&#21487;&#20197;&#22312;&#23384;&#22312;&#38543;&#26426;&#29992;&#25143;&#34892;&#20026;&#30340;&#24773;&#20917;&#19979;&#39044;&#27979;&#29992;&#25143;&#30340;&#19979;&#19968;&#20010;&#21160;&#20316;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22522;&#20110;&#20250;&#35805;&#30340;&#25512;&#33616;&#31995;&#32479;&#26088;&#22312;&#36890;&#36807;&#20165;&#22522;&#20110;&#21333;&#20010;&#20250;&#35805;&#20013;&#30340;&#20449;&#24687;&#26469;&#39044;&#27979;&#29992;&#25143;&#30340;&#19979;&#19968;&#20010;&#39033;&#30446;&#28857;&#20987;&#65292;&#21363;&#20351;&#22312;&#23384;&#22312;&#26576;&#20123;&#38543;&#26426;&#29992;&#25143;&#34892;&#20026;&#30340;&#24773;&#20917;&#19979;&#65292;&#36825;&#26159;&#19968;&#20010;&#22797;&#26434;&#30340;&#38382;&#39064;&#12290;&#36825;&#20010;&#22797;&#26434;&#30340;&#38382;&#39064;&#38656;&#35201;&#19968;&#20010;&#39640;&#33021;&#21147;&#30340;&#39044;&#27979;&#29992;&#25143;&#19979;&#19968;&#20010;&#21160;&#20316;&#30340;&#27169;&#22411;&#12290;&#22823;&#22810;&#25968;&#65288;&#22914;&#26524;&#19981;&#26159;&#20840;&#37096;&#65289;&#29616;&#26377;&#27169;&#22411;&#36981;&#24490;&#32534;&#30721;&#22120;-&#39044;&#27979;&#22120;&#33539;&#24335;&#65292;&#22312;&#36825;&#20010;&#33539;&#24335;&#20013;&#25152;&#26377;&#30340;&#30740;&#31350;&#37117;&#38598;&#20013;&#22312;&#22914;&#20309;&#24191;&#27867;&#20248;&#21270;&#32534;&#30721;&#22120;&#27169;&#22359;&#65292;&#20294;&#23427;&#20204;&#24573;&#35270;&#20102;&#22914;&#20309;&#20248;&#21270;&#39044;&#27979;&#22120;&#27169;&#22359;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#21457;&#29616;&#20102;&#29616;&#26377;&#27169;&#22411;&#20013;&#20302;&#33021;&#21147;&#39044;&#27979;&#22120;&#27169;&#22359;&#23384;&#22312;&#30340;&#20851;&#38190;&#38382;&#39064;&#12290;&#21463;&#27492;&#21551;&#21457;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#26694;&#26550;&#31216;&#20026;\emph{\underline{S}ession-based \underline{R}ecommendation with \underline{Pred}ictor \underline{A}dd-\underline{O}n} (SR-PredictAO)&#12290;&#22312;&#36825;&#20010;&#26694;&#26550;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#39640;&#33021;&#21147;&#30340;&#39044;&#27979;&#22120;&#27169;&#22359;&#65292;&#21487;&#20197;&#20943;&#36731;&#38543;&#26426;&#29992;&#25143;&#34892;&#20026;&#23545;&#39044;&#27979;&#30340;&#24433;&#21709;&#12290;&#20540;&#24471;&#19968;&#25552;&#30340;&#26159;&#65292;
&lt;/p&gt;
&lt;p&gt;
Session-based recommendation, aiming at making the prediction of the user's next item click based on the information in a single session only even in the presence of some random user's behavior, is a complex problem. This complex problem requires a high-capability model of predicting the user's next action. Most (if not all) existing models follow the encoder-predictor paradigm where all studies focus on how to optimize the encoder module extensively in the paradigm but they ignore how to optimize the predictor module. In this paper, we discover the existing critical issue of the low-capability predictor module among existing models. Motivated by this, we propose a novel framework called \emph{\underline{S}ession-based \underline{R}ecommendation with \underline{Pred}ictor \underline{A}dd-\underline{O}n} (SR-PredictAO). In this framework, we propose a high-capability predictor module which could alleviate the effect of random user's behavior for prediction. It is worth mentioning that t
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#21517;&#20026;Irl4Rec&#30340;&#26032;&#39062;&#24207;&#21015;&#25512;&#33616;&#26694;&#26550;&#65292;&#21033;&#29992;&#19981;&#21464;&#34920;&#31034;&#23398;&#20064;&#21644;&#32771;&#34385;&#34394;&#20551;&#20851;&#31995;&#65292;&#25552;&#39640;&#20102;&#25512;&#33616;&#20934;&#30830;&#24615;&#12290;&#35813;&#26694;&#26550;&#22312;&#27604;&#36739;&#20998;&#26512;&#21644;&#28040;&#34701;&#30740;&#31350;&#20013;&#37117;&#34920;&#29616;&#20986;&#20102;&#20248;&#36234;&#24615;&#33021;&#12290;</title><link>http://arxiv.org/abs/2308.11728</link><description>&lt;p&gt;
&#24207;&#21015;&#25512;&#33616;&#30340;&#19981;&#21464;&#34920;&#31034;&#23398;&#20064;
&lt;/p&gt;
&lt;p&gt;
Invariant representation learning for sequential recommendation. (arXiv:2308.11728v1 [cs.IR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.11728
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#21517;&#20026;Irl4Rec&#30340;&#26032;&#39062;&#24207;&#21015;&#25512;&#33616;&#26694;&#26550;&#65292;&#21033;&#29992;&#19981;&#21464;&#34920;&#31034;&#23398;&#20064;&#21644;&#32771;&#34385;&#34394;&#20551;&#20851;&#31995;&#65292;&#25552;&#39640;&#20102;&#25512;&#33616;&#20934;&#30830;&#24615;&#12290;&#35813;&#26694;&#26550;&#22312;&#27604;&#36739;&#20998;&#26512;&#21644;&#28040;&#34701;&#30740;&#31350;&#20013;&#37117;&#34920;&#29616;&#20986;&#20102;&#20248;&#36234;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24207;&#21015;&#25512;&#33616;&#28041;&#21450;&#26681;&#25454;&#29992;&#25143;&#30340;&#21382;&#21490;&#29289;&#21697;&#24207;&#21015;&#33258;&#21160;&#25512;&#33616;&#19979;&#19968;&#20010;&#29289;&#21697;&#12290;&#34429;&#28982;&#22823;&#22810;&#25968;&#20808;&#21069;&#30340;&#30740;&#31350;&#37319;&#29992;RNN&#25110;transformer&#26041;&#27861;&#20174;&#29289;&#21697;&#24207;&#21015;&#20013;&#33719;&#21462;&#20449;&#24687;&#65292;&#20026;&#27599;&#20010;&#29992;&#25143;-&#29289;&#21697;&#23545;&#29983;&#25104;&#27010;&#29575;&#65292;&#24182;&#25512;&#33616;&#21069;&#20960;&#20010;&#29289;&#21697;&#65292;&#20294;&#36825;&#20123;&#26041;&#27861;&#36890;&#24120;&#24573;&#35270;&#20102;&#34394;&#20551;&#20851;&#31995;&#24102;&#26469;&#30340;&#25361;&#25112;&#12290;&#26412;&#25991;&#29305;&#21035;&#35299;&#20915;&#20102;&#36825;&#20123;&#34394;&#20551;&#20851;&#31995;&#38382;&#39064;&#12290;&#25105;&#20204;&#20171;&#32461;&#20102;&#19968;&#20010;&#26032;&#39062;&#30340;&#24207;&#21015;&#25512;&#33616;&#26694;&#26550;&#31216;&#20026;Irl4Rec&#12290;&#35813;&#26694;&#26550;&#21033;&#29992;&#19981;&#21464;&#34920;&#31034;&#23398;&#20064;&#65292;&#24182;&#22312;&#27169;&#22411;&#35757;&#32451;&#36807;&#31243;&#20013;&#32771;&#34385;&#20102;&#34394;&#20551;&#21464;&#37327;&#21644;&#35843;&#25972;&#21464;&#37327;&#20043;&#38388;&#30340;&#20851;&#31995;&#65292;&#26377;&#21161;&#20110;&#35782;&#21035;&#34394;&#20551;&#20851;&#31995;&#12290;&#27604;&#36739;&#20998;&#26512;&#34920;&#26126;&#65292;&#25105;&#20204;&#30340;&#26694;&#26550;&#20248;&#20110;&#19977;&#31181;&#20856;&#22411;&#26041;&#27861;&#65292;&#20984;&#26174;&#20102;&#25105;&#20204;&#27169;&#22411;&#30340;&#26377;&#25928;&#24615;&#12290;&#27492;&#22806;&#65292;&#28040;&#34701;&#30740;&#31350;&#36827;&#19968;&#27493;&#35777;&#26126;&#20102;&#25105;&#20204;&#30340;&#27169;&#22411;&#22312;&#26816;&#27979;&#34394;&#20551;&#20851;&#31995;&#20013;&#30340;&#20851;&#38190;&#20316;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;
Sequential recommendation involves automatically recommending the next item to users based on their historical item sequence. While most prior research employs RNN or transformer methods to glean information from the item sequence-generating probabilities for each user-item pair and recommending the top items, these approaches often overlook the challenge posed by spurious relationships. This paper specifically addresses these spurious relations. We introduce a novel sequential recommendation framework named Irl4Rec. This framework harnesses invariant learning and employs a new objective that factors in the relationship between spurious variables and adjustment variables during model training. This approach aids in identifying spurious relations. Comparative analyses reveal that our framework outperforms three typical methods, underscoring the effectiveness of our model. Moreover, an ablation study further demonstrates the critical role our model plays in detecting spurious relations.
&lt;/p&gt;</description></item></channel></rss>