<rss version="2.0"><channel><title>Chat Arxiv cs.IR</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.IR</description><item><title>&#26412;&#30740;&#31350;&#36890;&#36807;&#23545;&#22810;&#20010;&#25968;&#25454;&#38598;&#36827;&#34892;&#35780;&#20272;&#21457;&#29616;&#65292;&#39034;&#24207;&#25512;&#33616;&#31995;&#32479;&#20013;&#21024;&#38500;&#24207;&#21015;&#26411;&#23614;&#30340;&#39033;&#30446;&#26174;&#33879;&#38477;&#20302;&#20102;&#24615;&#33021;&#65292;&#32780;&#21024;&#38500;&#24207;&#21015;&#24320;&#22836;&#25110;&#20013;&#38388;&#30340;&#39033;&#30446;&#21017;&#27809;&#26377;&#26126;&#26174;&#24433;&#21709;&#12290;&#36825;&#19968;&#21457;&#29616;&#24378;&#35843;&#20102;&#32771;&#34385;&#35757;&#32451;&#25968;&#25454;&#20013;&#25200;&#21160;&#39033;&#30446;&#20301;&#32622;&#30340;&#37325;&#35201;&#24615;&#65292;&#24182;&#33021;&#25351;&#23548;&#26356;&#20855;&#40065;&#26834;&#24615;&#30340;&#39034;&#24207;&#25512;&#33616;&#31995;&#32479;&#30340;&#35774;&#35745;&#12290;</title><link>http://arxiv.org/abs/2307.13165</link><description>&lt;p&gt;
&#30740;&#31350;&#39034;&#24207;&#25512;&#33616;&#31995;&#32479;&#23545;&#35757;&#32451;&#25968;&#25454;&#25200;&#21160;&#30340;&#40065;&#26834;&#24615;&#65306;&#19968;&#39033;&#32463;&#39564;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Investigating the Robustness of Sequential Recommender Systems Against Training Data Perturbations: an Empirical Study. (arXiv:2307.13165v1 [cs.IR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.13165
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#36890;&#36807;&#23545;&#22810;&#20010;&#25968;&#25454;&#38598;&#36827;&#34892;&#35780;&#20272;&#21457;&#29616;&#65292;&#39034;&#24207;&#25512;&#33616;&#31995;&#32479;&#20013;&#21024;&#38500;&#24207;&#21015;&#26411;&#23614;&#30340;&#39033;&#30446;&#26174;&#33879;&#38477;&#20302;&#20102;&#24615;&#33021;&#65292;&#32780;&#21024;&#38500;&#24207;&#21015;&#24320;&#22836;&#25110;&#20013;&#38388;&#30340;&#39033;&#30446;&#21017;&#27809;&#26377;&#26126;&#26174;&#24433;&#21709;&#12290;&#36825;&#19968;&#21457;&#29616;&#24378;&#35843;&#20102;&#32771;&#34385;&#35757;&#32451;&#25968;&#25454;&#20013;&#25200;&#21160;&#39033;&#30446;&#20301;&#32622;&#30340;&#37325;&#35201;&#24615;&#65292;&#24182;&#33021;&#25351;&#23548;&#26356;&#20855;&#40065;&#26834;&#24615;&#30340;&#39034;&#24207;&#25512;&#33616;&#31995;&#32479;&#30340;&#35774;&#35745;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#39034;&#24207;&#25512;&#33616;&#31995;&#32479;&#34987;&#24191;&#27867;&#29992;&#20110;&#24314;&#27169;&#29992;&#25143;&#38543;&#26102;&#38388;&#21464;&#21270;&#30340;&#34892;&#20026;&#65292;&#28982;&#32780;&#20854;&#22312;&#38754;&#23545;&#35757;&#32451;&#25968;&#25454;&#25200;&#21160;&#26102;&#30340;&#40065;&#26834;&#24615;&#26159;&#19968;&#20010;&#20851;&#38190;&#38382;&#39064;&#12290;&#26412;&#25991;&#36827;&#34892;&#20102;&#19968;&#39033;&#32463;&#39564;&#30740;&#31350;&#65292;&#25506;&#31350;&#20102;&#22312;&#26102;&#38388;&#39034;&#24207;&#24207;&#21015;&#20013;&#19981;&#21516;&#20301;&#32622;&#19978;&#21024;&#38500;&#39033;&#30446;&#30340;&#25928;&#26524;&#12290;&#25105;&#20204;&#35780;&#20272;&#20102;&#20004;&#31181;&#19981;&#21516;&#30340;&#39034;&#24207;&#25512;&#33616;&#31995;&#32479;&#27169;&#22411;&#22312;&#22810;&#20010;&#25968;&#25454;&#38598;&#19978;&#30340;&#34920;&#29616;&#65292;&#20351;&#29992;&#24402;&#19968;&#21270;&#25240;&#29616;&#32047;&#31215;&#22686;&#30410;&#65288;NDCG&#65289;&#25351;&#26631;&#21644;&#25490;&#21517;&#25935;&#24863;&#24230;&#21015;&#34920;&#65288;Rank Sensitivity List&#65289;&#25351;&#26631;&#26469;&#34913;&#37327;&#20854;&#24615;&#33021;&#12290;&#25105;&#20204;&#30340;&#32467;&#26524;&#26174;&#31034;&#65292;&#21024;&#38500;&#24207;&#21015;&#26411;&#23614;&#30340;&#39033;&#30446;&#26174;&#33879;&#24433;&#21709;&#24615;&#33021;&#65292;NDCG&#19979;&#38477;&#39640;&#36798;60&#65285;&#65292;&#32780;&#21024;&#38500;&#24207;&#21015;&#24320;&#22836;&#25110;&#20013;&#38388;&#30340;&#39033;&#30446;&#27809;&#26377;&#26174;&#33879;&#24433;&#21709;&#12290;&#36825;&#20123;&#21457;&#29616;&#20984;&#26174;&#20102;&#32771;&#34385;&#35757;&#32451;&#25968;&#25454;&#20013;&#25200;&#21160;&#39033;&#30446;&#20301;&#32622;&#30340;&#37325;&#35201;&#24615;&#65292;&#24182;&#21487;&#25351;&#23548;&#26356;&#20855;&#40065;&#26834;&#24615;&#30340;&#39034;&#24207;&#25512;&#33616;&#31995;&#32479;&#30340;&#35774;&#35745;&#12290;
&lt;/p&gt;
&lt;p&gt;
Sequential Recommender Systems (SRSs) have been widely used to model user behavior over time, but their robustness in the face of perturbations to training data is a critical issue. In this paper, we conduct an empirical study to investigate the effects of removing items at different positions within a temporally ordered sequence. We evaluate two different SRS models on multiple datasets, measuring their performance using Normalized Discounted Cumulative Gain (NDCG) and Rank Sensitivity List metrics. Our results demonstrate that removing items at the end of the sequence significantly impacts performance, with NDCG decreasing up to 60\%, while removing items from the beginning or middle has no significant effect. These findings highlight the importance of considering the position of the perturbed items in the training data and shall inform the design of more robust SRSs.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#31216;&#20026;&#8220;&#27169;&#31946;&#20559;&#22909;&#22810;&#36718;&#20250;&#35805;&#25512;&#33616;&#8221;&#65288;VPMCR&#65289;&#30340;&#26032;&#22330;&#26223;&#65292;&#32771;&#34385;&#20102;&#29992;&#25143;&#22312; CRS &#20013;&#30340;&#27169;&#31946;&#21644;&#27874;&#21160;&#30340;&#20559;&#22909;&#12290;&#35813;&#26041;&#27861;&#37319;&#29992;&#36719;&#20272;&#35745;&#26426;&#21046;&#36991;&#20813;&#36807;&#28388;&#36807;&#24230;&#65292;&#24182;&#36890;&#36807;&#33258;&#36866;&#24212;&#27169;&#31946;&#20559;&#22909;&#31574;&#30053;&#23398;&#20064;&#26694;&#26550;&#33719;&#24471;&#20102;&#23454;&#39564;&#19978;&#30340;&#33391;&#22909;&#25512;&#33616;&#25928;&#26524;&#12290;</title><link>http://arxiv.org/abs/2306.04487</link><description>&lt;p&gt;
&#25509;&#21463;&#19981;&#30830;&#23450;&#24615;&#65306;&#33258;&#36866;&#24212;&#27169;&#31946;&#20559;&#22909;&#31574;&#30053;&#23398;&#20064;&#29992;&#20110;&#22810;&#36718;&#20250;&#35805;&#25512;&#33616;
&lt;/p&gt;
&lt;p&gt;
Embracing Uncertainty: Adaptive Vague Preference Policy Learning for Multi-round Conversational Recommendation. (arXiv:2306.04487v1 [cs.IR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.04487
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#31216;&#20026;&#8220;&#27169;&#31946;&#20559;&#22909;&#22810;&#36718;&#20250;&#35805;&#25512;&#33616;&#8221;&#65288;VPMCR&#65289;&#30340;&#26032;&#22330;&#26223;&#65292;&#32771;&#34385;&#20102;&#29992;&#25143;&#22312; CRS &#20013;&#30340;&#27169;&#31946;&#21644;&#27874;&#21160;&#30340;&#20559;&#22909;&#12290;&#35813;&#26041;&#27861;&#37319;&#29992;&#36719;&#20272;&#35745;&#26426;&#21046;&#36991;&#20813;&#36807;&#28388;&#36807;&#24230;&#65292;&#24182;&#36890;&#36807;&#33258;&#36866;&#24212;&#27169;&#31946;&#20559;&#22909;&#31574;&#30053;&#23398;&#20064;&#26694;&#26550;&#33719;&#24471;&#20102;&#23454;&#39564;&#19978;&#30340;&#33391;&#22909;&#25512;&#33616;&#25928;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20250;&#35805;&#24335;&#25512;&#33616;&#31995;&#32479; (CRS) &#36890;&#36807;&#22810;&#36718;&#20132;&#20114;&#65292;&#21160;&#24577;&#24341;&#23548;&#29992;&#25143;&#34920;&#36798;&#20559;&#22909;&#65292;&#26377;&#25928;&#22320;&#35299;&#20915;&#20449;&#24687;&#19981;&#23545;&#31216;&#38382;&#39064;&#12290;&#29616;&#26377;&#30340; CRS &#22522;&#26412;&#19978;&#20551;&#35774;&#29992;&#25143;&#26377;&#26126;&#30830;&#30340;&#20559;&#22909;&#12290;&#22312;&#36825;&#31181;&#24773;&#20917;&#19979;&#65292;&#20195;&#29702;&#23558;&#23436;&#20840;&#20449;&#20219;&#29992;&#25143;&#21453;&#39304;&#65292;&#24182;&#23558;&#25509;&#21463;&#25110;&#25298;&#32477;&#20449;&#21495;&#35270;&#20026;&#36807;&#28388;&#39033;&#30446;&#21644;&#20943;&#23569;&#20505;&#36873;&#31354;&#38388;&#30340;&#24378;&#25351;&#26631;&#65292;&#36825;&#21487;&#33021;&#23548;&#33268;&#36807;&#28388;&#36807;&#24230;&#30340;&#38382;&#39064;&#12290;&#28982;&#32780;&#65292;&#22312;&#29616;&#23454;&#20013;&#65292;&#29992;&#25143;&#30340;&#20559;&#22909;&#24448;&#24448;&#26159;&#27169;&#31946;&#21644;&#27874;&#21160;&#30340;&#65292;&#23384;&#22312;&#19981;&#30830;&#23450;&#24615;&#65292;&#20182;&#20204;&#22312;&#20132;&#20114;&#36807;&#31243;&#20013;&#30340;&#24895;&#26395;&#21644;&#20915;&#31574;&#21487;&#33021;&#20250;&#21457;&#29983;&#21464;&#21270;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#20010;&#26032;&#39062;&#30340;&#22330;&#26223;&#65292;&#31216;&#20026;&#8220;&#27169;&#31946;&#20559;&#22909;&#22810;&#36718;&#20250;&#35805;&#25512;&#33616;&#8221;&#65288;VPMCR&#65289;&#65292;&#23427;&#32771;&#34385;&#21040;&#29992;&#25143;&#22312; CRS &#20013;&#30340;&#27169;&#31946;&#21644;&#27874;&#21160;&#30340;&#20559;&#22909;&#12290;VPMCR &#37319;&#29992;&#36719;&#20272;&#35745;&#26426;&#21046;&#20026;&#25152;&#26377;&#20505;&#36873;&#39033;&#30446;&#20998;&#37197;&#38750;&#38646;&#32622;&#20449;&#24230;&#20998;&#25968;&#65292;&#33258;&#28982;&#22320;&#36991;&#20813;&#20102;&#36807;&#28388;&#36807;&#24230;&#30340;&#38382;&#39064;&#12290;&#22312; VPMCR &#35774;&#32622;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#33258;&#36866;&#24212;&#27169;&#31946;&#20559;&#22909;&#31574;&#30053;&#23398;&#20064;&#26694;&#26550;&#65292;&#21033;&#29992;&#24378;&#21270;&#23398;&#20064;&#21644;&#20559;&#22909;&#24341;&#23548;&#26469;&#23398;&#20064; CRS &#20195;&#29702;&#30340;&#26368;&#20248;&#31574;&#30053;&#12290;&#22312;&#20004;&#20010;&#30495;&#23454;&#25968;&#25454;&#38598;&#19978;&#30340;&#23454;&#39564;&#32467;&#26524;&#34920;&#26126;&#65292;&#30456;&#36739;&#20110;&#20960;&#31181;&#26368;&#20808;&#36827;&#30340;&#22522;&#20934;&#26041;&#27861;&#65292;&#25105;&#20204;&#25552;&#20986;&#30340; VPMCR &#26041;&#27861;&#20855;&#26377;&#26356;&#22909;&#30340;&#25512;&#33616;&#25928;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
Conversational recommendation systems (CRS) effectively address information asymmetry by dynamically eliciting user preferences through multi-turn interactions. Existing CRS widely assumes that users have clear preferences. Under this assumption, the agent will completely trust the user feedback and treat the accepted or rejected signals as strong indicators to filter items and reduce the candidate space, which may lead to the problem of over-filtering. However, in reality, users' preferences are often vague and volatile, with uncertainty about their desires and changing decisions during interactions.  To address this issue, we introduce a novel scenario called Vague Preference Multi-round Conversational Recommendation (VPMCR), which considers users' vague and volatile preferences in CRS.VPMCR employs a soft estimation mechanism to assign a non-zero confidence score for all candidate items to be displayed, naturally avoiding the over-filtering problem. In the VPMCR setting, we introduc
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#20219;&#21153;&#8212;&#8212;&#32534;&#36753;&#22522;&#20110;&#35821;&#35328;&#27169;&#22411;&#30340;&#30693;&#35782;&#22270;&#35889;&#23884;&#20837;&#65292;&#26088;&#22312;&#23454;&#29616;&#23545;KG&#23884;&#20837;&#30340;&#25968;&#25454;&#39640;&#25928;&#21644;&#24555;&#36895;&#26356;&#26032;&#12290;&#38024;&#23545;&#36825;&#19968;&#20219;&#21153;&#65292;&#25552;&#20986;&#20102;&#19968;&#20010;&#31616;&#21333;&#32780;&#24378;&#22823;&#30340;&#26041;&#26696;&#8212;&#8212;KGEditor&#65292;&#21487;&#20197;&#26356;&#22909;&#22320;&#26356;&#26032;&#29305;&#23450;&#20107;&#23454;&#32780;&#19981;&#24433;&#21709;&#20854;&#20313;&#37096;&#20998;&#30340;&#24615;&#33021;&#12290;</title><link>http://arxiv.org/abs/2301.10405</link><description>&lt;p&gt;
&#22522;&#20110;&#35821;&#35328;&#27169;&#22411;&#30340;&#30693;&#35782;&#22270;&#35889;&#23884;&#20837;&#32534;&#36753;
&lt;/p&gt;
&lt;p&gt;
Editing Language Model-based Knowledge Graph Embeddings. (arXiv:2301.10405v4 [cs.CL] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2301.10405
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#20219;&#21153;&#8212;&#8212;&#32534;&#36753;&#22522;&#20110;&#35821;&#35328;&#27169;&#22411;&#30340;&#30693;&#35782;&#22270;&#35889;&#23884;&#20837;&#65292;&#26088;&#22312;&#23454;&#29616;&#23545;KG&#23884;&#20837;&#30340;&#25968;&#25454;&#39640;&#25928;&#21644;&#24555;&#36895;&#26356;&#26032;&#12290;&#38024;&#23545;&#36825;&#19968;&#20219;&#21153;&#65292;&#25552;&#20986;&#20102;&#19968;&#20010;&#31616;&#21333;&#32780;&#24378;&#22823;&#30340;&#26041;&#26696;&#8212;&#8212;KGEditor&#65292;&#21487;&#20197;&#26356;&#22909;&#22320;&#26356;&#26032;&#29305;&#23450;&#20107;&#23454;&#32780;&#19981;&#24433;&#21709;&#20854;&#20313;&#37096;&#20998;&#30340;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36817;&#20960;&#21313;&#24180;&#26469;&#65292;&#20351;&#29992;&#35821;&#35328;&#27169;&#22411;&#36827;&#34892;&#30693;&#35782;&#22270;&#35889;&#65288;KG&#65289;&#23884;&#20837;&#24050;&#32463;&#21462;&#24471;&#20102;&#23454;&#35777;&#25104;&#21151;&#12290;&#20294;&#26159;&#65292;&#22522;&#20110;&#35821;&#35328;&#27169;&#22411;&#30340;KG&#23884;&#20837;&#36890;&#24120;&#20316;&#20026;&#38745;&#24577;&#24037;&#20214;&#37096;&#32626;&#65292;&#20462;&#25913;&#36215;&#26469;&#20855;&#26377;&#25361;&#25112;&#24615;&#65292;&#38656;&#35201;&#37325;&#26032;&#35757;&#32451;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#20219;&#21153;&#65292;&#21363;&#32534;&#36753;&#22522;&#20110;&#35821;&#35328;&#27169;&#22411;&#30340;KG&#23884;&#20837;&#12290;&#35813;&#20219;&#21153;&#26088;&#22312;&#23454;&#29616;&#23545;KG&#23884;&#20837;&#30340;&#25968;&#25454;&#39640;&#25928;&#21644;&#24555;&#36895;&#26356;&#26032;&#65292;&#32780;&#19981;&#24433;&#21709;&#20854;&#20313;&#37096;&#20998;&#30340;&#24615;&#33021;&#12290;&#25105;&#20204;&#26500;&#24314;&#20102;&#22235;&#20010;&#26032;&#25968;&#25454;&#38598;&#65306;E-FB15k237&#12289;A-FB15k237&#12289;E-WN18RR &#21644; A-WN18RR&#65292;&#24182;&#35780;&#20272;&#20102;&#20960;&#31181;&#30693;&#35782;&#32534;&#36753;&#22522;&#32447;&#65292;&#35777;&#26126;&#20102;&#20043;&#21069;&#30340;&#27169;&#22411;&#22788;&#29702;&#35813;&#20219;&#21153;&#30340;&#33021;&#21147;&#26377;&#38480;&#12290;&#25105;&#20204;&#36827;&#19968;&#27493;&#25552;&#20986;&#20102;&#19968;&#20010;&#31616;&#21333;&#20294;&#24378;&#22823;&#30340;&#22522;&#32447;&#8212;&#8212;KGEditor&#65292;&#23427;&#21033;&#29992;&#36229;&#32593;&#32476;&#30340;&#38468;&#21152;&#21442;&#25968;&#23618;&#26469;&#32534;&#36753;/&#28155;&#21152;&#20107;&#23454;&#12290;&#20840;&#38754;&#30340;&#23454;&#39564;&#32467;&#26524;&#34920;&#26126;&#65292;&#24403;&#26356;&#26032;&#29305;&#23450;&#20107;&#23454;&#32780;&#19981;&#24433;&#21709;&#20854;&#20313;&#37096;&#20998;&#30340;&#24615;&#33021;&#26102;&#65292;KGEditor &#30340;&#34920;&#29616;&#26356;&#22909;&#12290;
&lt;/p&gt;
&lt;p&gt;
Recently decades have witnessed the empirical success of framing Knowledge Graph (KG) embeddings via language models. However, language model-based KG embeddings are usually deployed as static artifacts, which are challenging to modify without re-training after deployment. To address this issue, we propose a new task of editing language model-based KG embeddings in this paper. The proposed task aims to enable data-efficient and fast updates to KG embeddings without damaging the performance of the rest. We build four new datasets: E-FB15k237, A-FB15k237, E-WN18RR, and A-WN18RR, and evaluate several knowledge editing baselines demonstrating the limited ability of previous models to handle the proposed challenging task. We further propose a simple yet strong baseline dubbed KGEditor, which utilizes additional parametric layers of the hyper network to edit/add facts. Comprehensive experimental results demonstrate that KGEditor can perform better when updating specific facts while not affec
&lt;/p&gt;</description></item></channel></rss>