<rss version="2.0"><channel><title>Chat Arxiv cs.LG</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.LG</description><item><title>&#35813;&#35770;&#25991;&#24341;&#20837;&#20102;&#22810;&#28608;&#21457;&#25237;&#24433;&#27169;&#25311;&#65288;mePS&#65289;&#65292;&#36890;&#36807;&#22312;&#36229;&#22270;&#19978;&#22810;&#20010;&#31890;&#23376;&#30340;&#38543;&#26426;&#28216;&#36208;&#65292;&#35299;&#20915;&#20102;&#25237;&#24433;&#27169;&#25311;&#65288;PS&#65289;&#26080;&#27861;&#27169;&#25311;&#21516;&#26102;&#32467;&#21512;&#22810;&#20010;&#27010;&#24565;&#30340;&#24605;&#32500;&#30340;&#38382;&#39064;&#12290;</title><link>https://arxiv.org/abs/2402.10192</link><description>&lt;p&gt;
&#20511;&#37492;&#22810;&#20307;&#29289;&#29702;&#30340;&#24402;&#32435;&#20559;&#32622;&#30340;&#22810;&#28608;&#21457;&#25237;&#24433;&#27169;&#25311;
&lt;/p&gt;
&lt;p&gt;
Multi-Excitation Projective Simulation with a Many-Body Physics Inspired Inductive Bias
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.10192
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#24341;&#20837;&#20102;&#22810;&#28608;&#21457;&#25237;&#24433;&#27169;&#25311;&#65288;mePS&#65289;&#65292;&#36890;&#36807;&#22312;&#36229;&#22270;&#19978;&#22810;&#20010;&#31890;&#23376;&#30340;&#38543;&#26426;&#28216;&#36208;&#65292;&#35299;&#20915;&#20102;&#25237;&#24433;&#27169;&#25311;&#65288;PS&#65289;&#26080;&#27861;&#27169;&#25311;&#21516;&#26102;&#32467;&#21512;&#22810;&#20010;&#27010;&#24565;&#30340;&#24605;&#32500;&#30340;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38543;&#30528;&#28145;&#24230;&#23398;&#20064;&#30340;&#36827;&#27493;&#65292;&#20381;&#36182;&#20110;&#26426;&#22120;&#23398;&#20064;&#30340;&#24212;&#29992;&#27491;&#22312;&#36234;&#26469;&#36234;&#22810;&#22320;&#34701;&#20837;&#26085;&#24120;&#29983;&#27963;&#12290;&#28982;&#32780;&#65292;&#22823;&#22810;&#25968;&#28145;&#24230;&#23398;&#20064;&#27169;&#22411;&#20855;&#26377;&#19981;&#36879;&#26126;&#30340;&#12289;&#31867;&#20284;&#20110;&#31070;&#35861;&#33324;&#30340;&#29305;&#24615;&#65292;&#20351;&#24471;&#35299;&#37322;&#21644;&#29702;&#35299;&#23427;&#20204;&#30340;&#20915;&#31574;&#21464;&#24471;&#22256;&#38590;&#12290;&#36825;&#20010;&#38382;&#39064;&#23548;&#33268;&#20102;&#34987;&#31216;&#20026;&#21487;&#35299;&#37322;&#20154;&#24037;&#26234;&#33021;&#65288;XAI&#65289;&#30340;&#39046;&#22495;&#30340;&#21457;&#23637;&#12290;&#35813;&#39046;&#22495;&#20013;&#30340;&#19968;&#31181;&#26041;&#27861;&#31216;&#20026;&#25237;&#24433;&#27169;&#25311;&#65288;PS&#65289;&#65292;&#23558;&#24605;&#32500;&#36807;&#31243;&#24314;&#27169;&#20026;&#19968;&#20010;&#22312;&#20855;&#26377;&#27010;&#24565;&#38468;&#21152;&#30340;&#39030;&#28857;&#30340;&#22270;&#19978;&#30340;&#31890;&#23376;&#30340;&#38543;&#26426;&#28216;&#36208;&#12290;&#34429;&#28982;&#36825;&#31181;&#25551;&#36848;&#20855;&#26377;&#21508;&#31181;&#22909;&#22788;&#65292;&#21253;&#25324;&#37327;&#21270;&#30340;&#21487;&#33021;&#24615;&#65292;&#20294;&#19981;&#33021;&#33258;&#28982;&#22320;&#29992;&#26469;&#27169;&#25311;&#21516;&#26102;&#32467;&#21512;&#22810;&#20010;&#27010;&#24565;&#30340;&#24605;&#32500;&#12290;&#20026;&#20102;&#20811;&#26381;&#36825;&#20010;&#38480;&#21046;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#31181;&#31216;&#20026;&#22810;&#28608;&#21457;&#25237;&#24433;&#27169;&#25311;&#65288;mePS&#65289;&#30340;&#25512;&#24191;&#65292;&#23427;&#23558;&#24605;&#32500;&#36807;&#31243;&#35270;&#20026;&#36229;&#22270;&#19978;&#22810;&#20010;&#31890;&#23376;&#30340;&#38543;&#26426;&#28216;&#36208;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.10192v1 Announce Type: cross  Abstract: With the impressive progress of deep learning, applications relying on machine learning are increasingly being integrated into daily life. However, most deep learning models have an opaque, oracle-like nature making it difficult to interpret and understand their decisions. This problem led to the development of the field known as eXplainable Artificial Intelligence (XAI). One method in this field known as Projective Simulation (PS) models a chain-of-thought as a random walk of a particle on a graph with vertices that have concepts attached to them. While this description has various benefits, including the possibility of quantization, it cannot be naturally used to model thoughts that combine several concepts simultaneously. To overcome this limitation, we introduce Multi-Excitation Projective Simulation (mePS), a generalization that considers a chain-of-thought to be a random walk of several particles on a hypergraph. A definition for
&lt;/p&gt;</description></item><item><title>P-tensors &#25552;&#20379;&#20102;&#26500;&#24314;&#39640;&#38454;&#28040;&#24687;&#20256;&#36882;&#32593;&#32476;&#30340;&#36890;&#29992;&#24418;&#24335;&#65292;&#20854;&#22312;&#20998;&#23376;&#31561;&#39640;&#24230;&#32467;&#26500;&#21270;&#30340;&#22270;&#24418;&#20013;&#20855;&#26377;&#20248;&#24322;&#30340;&#24615;&#33021;&#34920;&#29616;&#12290;</title><link>http://arxiv.org/abs/2306.10767</link><description>&lt;p&gt;
P&#24352;&#37327;&#65306;&#26500;&#24314;&#39640;&#38454;&#28040;&#24687;&#20256;&#36882;&#32593;&#32476;&#30340;&#36890;&#29992;&#24418;&#24335;&#12290;
&lt;/p&gt;
&lt;p&gt;
P-tensors: a General Formalism for Constructing Higher Order Message Passing Networks. (arXiv:2306.10767v1 [stat.ML])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.10767
&lt;/p&gt;
&lt;p&gt;
P-tensors &#25552;&#20379;&#20102;&#26500;&#24314;&#39640;&#38454;&#28040;&#24687;&#20256;&#36882;&#32593;&#32476;&#30340;&#36890;&#29992;&#24418;&#24335;&#65292;&#20854;&#22312;&#20998;&#23376;&#31561;&#39640;&#24230;&#32467;&#26500;&#21270;&#30340;&#22270;&#24418;&#20013;&#20855;&#26377;&#20248;&#24322;&#30340;&#24615;&#33021;&#34920;&#29616;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26368;&#36817;&#30340;&#20960;&#31687;&#35770;&#25991;&#34920;&#26126;&#65292;&#39640;&#38454;&#22270;&#31070;&#32463;&#32593;&#32476;&#22312;&#39640;&#24230;&#32467;&#26500;&#21270;&#30340;&#22270;&#24418;&#22914;&#20998;&#23376;&#20013;&#33021;&#22815;&#27604;&#20854;&#26631;&#20934;&#30340;&#28040;&#24687;&#20256;&#36882;&#23545;&#24212;&#29289;&#33719;&#24471;&#26356;&#22909;&#30340;&#20934;&#30830;&#24615;&#12290;&#36825;&#20123;&#27169;&#22411;&#36890;&#24120;&#36890;&#36807;&#32771;&#34385;&#21253;&#21547;&#22312;&#32473;&#23450;&#22270;&#24418;&#20013;&#30340;&#23376;&#22270;&#30340;&#39640;&#38454;&#34920;&#31034;&#65292;&#28982;&#21518;&#22312;&#23427;&#20204;&#20043;&#38388;&#25191;&#34892;&#26576;&#20123;&#32447;&#24615;&#26144;&#23556;&#26469;&#24037;&#20316;&#12290;&#25105;&#20204;&#23558;&#36825;&#20123;&#32467;&#26500;&#27491;&#24335;&#21270;&#20026;&#25490;&#21015;&#31561;&#21464;&#24352;&#37327;&#25110;P&#24352;&#37327;&#65292;&#24182;&#25512;&#23548;&#20986;&#25152;&#26377;&#32447;&#24615;&#26144;&#23556;&#20043;&#38388;&#30340;&#20219;&#24847;&#39034;&#24207;&#31561;&#21464;P&#24352;&#37327;&#30340;&#22522;&#30784;&#12290;&#22312;&#23454;&#39564;&#20013;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#36825;&#31181;&#33539;&#24335;&#22312;&#20960;&#20010;&#22522;&#20934;&#25968;&#25454;&#38598;&#19978;&#36798;&#21040;&#20102;&#29616;&#26377;&#26368;&#20808;&#36827;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;
Several recent papers have recently shown that higher order graph neural networks can achieve better accuracy than their standard message passing counterparts, especially on highly structured graphs such as molecules. These models typically work by considering higher order representations of subgraphs contained within a given graph and then perform some linear maps between them. We formalize these structures as permutation equivariant tensors, or P-tensors, and derive a basis for all linear maps between arbitrary order equivariant P-tensors. Experimentally, we demonstrate this paradigm achieves state of the art performance on several benchmark datasets.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#22312;&#39044;&#23450;&#21464;&#25442;&#32676;&#19979;&#23398;&#20064;&#19981;&#21464;&#30340;&#23383;&#20856;&#38382;&#39064;&#12290;&#21033;&#29992;&#38750;&#38463;&#36125;&#23572;&#20613;&#37324;&#21494;&#20998;&#26512;&#65292;&#25552;&#20379;&#20102;&#31639;&#27861;&#65292;&#24314;&#31435;&#20102;&#23383;&#20856;&#23398;&#20064;&#38382;&#39064;&#21487;&#20197;&#34987;&#26377;&#25928;&#22320;&#29702;&#35299;&#20026;&#26576;&#20123;&#30697;&#38453;&#20248;&#21270;&#38382;&#39064;&#30340;&#29702;&#35770;&#22522;&#30784;&#12290;</title><link>http://arxiv.org/abs/2305.19557</link><description>&lt;p&gt;
&#36890;&#36807;&#32676;&#34920;&#31034;&#23398;&#20064;&#23545;&#31216;&#19979;&#30340;&#23383;&#20856;&#23398;&#20064;
&lt;/p&gt;
&lt;p&gt;
Dictionary Learning under Symmetries via Group Representations. (arXiv:2305.19557v1 [math.OC])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.19557
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#22312;&#39044;&#23450;&#21464;&#25442;&#32676;&#19979;&#23398;&#20064;&#19981;&#21464;&#30340;&#23383;&#20856;&#38382;&#39064;&#12290;&#21033;&#29992;&#38750;&#38463;&#36125;&#23572;&#20613;&#37324;&#21494;&#20998;&#26512;&#65292;&#25552;&#20379;&#20102;&#31639;&#27861;&#65292;&#24314;&#31435;&#20102;&#23383;&#20856;&#23398;&#20064;&#38382;&#39064;&#21487;&#20197;&#34987;&#26377;&#25928;&#22320;&#29702;&#35299;&#20026;&#26576;&#20123;&#30697;&#38453;&#20248;&#21270;&#38382;&#39064;&#30340;&#29702;&#35770;&#22522;&#30784;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#23383;&#20856;&#23398;&#20064;&#38382;&#39064;&#21487;&#20197;&#34987;&#30475;&#20316;&#26159;&#19968;&#20010;&#25968;&#25454;&#39537;&#21160;&#30340;&#36807;&#31243;&#65292;&#26088;&#22312;&#23398;&#20064;&#19968;&#20010;&#21512;&#36866;&#30340;&#21464;&#25442;&#65292;&#20197;&#20415;&#36890;&#36807;&#31034;&#20363;&#25968;&#25454;&#30452;&#25509;&#34920;&#31034;&#25968;&#25454;&#30340;&#31232;&#30095;&#24615;&#12290;&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#39044;&#23450;&#30340;&#21464;&#25442;&#32676;&#19979;&#23398;&#20064;&#19981;&#21464;&#30340;&#23383;&#20856;&#38382;&#39064;&#12290;&#33258;&#28982;&#30340;&#24212;&#29992;&#39046;&#22495;&#21253;&#25324;&#20919;&#20923;&#30005;&#38236;&#12289;&#22810;&#30446;&#26631;&#36319;&#36394;&#12289;&#21516;&#27493;&#21644;&#23039;&#24577;&#20272;&#35745;&#31561;&#12290;&#25105;&#20204;&#29305;&#21035;&#20174;&#25968;&#23398;&#34920;&#31034;&#29702;&#35770;&#30340;&#35282;&#24230;&#30740;&#31350;&#20102;&#36825;&#20010;&#38382;&#39064;&#12290;&#36890;&#36807;&#21033;&#29992;&#38750;&#38463;&#36125;&#23572;&#20613;&#37324;&#21494;&#20998;&#26512;&#65292;&#25105;&#20204;&#20026;&#31526;&#21512;&#36825;&#20123;&#19981;&#21464;&#24615;&#30340;&#23383;&#20856;&#23398;&#20064;&#25552;&#20379;&#20102;&#31639;&#27861;&#12290;&#25105;&#20204;&#23558;&#33258;&#28982;&#30028;&#20013;&#30340;&#23383;&#20856;&#23398;&#20064;&#38382;&#39064;&#65292;&#20854;&#33258;&#28982;&#34987;&#24314;&#27169;&#20026;&#26080;&#38480;&#32500;&#24230;&#30340;&#38382;&#39064;&#65292;&#19982;&#30456;&#20851;&#30340;&#35745;&#31639;&#38382;&#39064;&#65292;&#36825;&#24517;&#28982;&#26159;&#26377;&#38480;&#32500;&#24230;&#30340;&#38382;&#39064;&#65292;&#32852;&#31995;&#36215;&#26469;&#12290;&#25105;&#20204;&#24314;&#31435;&#20102;&#23383;&#20856;&#23398;&#20064;&#38382;&#39064;&#21487;&#20197;&#34987;&#26377;&#25928;&#22320;&#29702;&#35299;&#20026;&#26576;&#20123;&#30697;&#38453;&#20248;&#21270;&#38382;&#39064;&#30340;&#29702;&#35770;&#22522;&#30784;&#12290;
&lt;/p&gt;
&lt;p&gt;
The dictionary learning problem can be viewed as a data-driven process to learn a suitable transformation so that data is sparsely represented directly from example data. In this paper, we examine the problem of learning a dictionary that is invariant under a pre-specified group of transformations. Natural settings include Cryo-EM, multi-object tracking, synchronization, pose estimation, etc. We specifically study this problem under the lens of mathematical representation theory. Leveraging the power of non-abelian Fourier analysis for functions over compact groups, we prescribe an algorithmic recipe for learning dictionaries that obey such invariances. We relate the dictionary learning problem in the physical domain, which is naturally modelled as being infinite dimensional, with the associated computational problem, which is necessarily finite dimensional. We establish that the dictionary learning problem can be effectively understood as an optimization instance over certain matrix o
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#36890;&#36807;&#20154;&#24037;&#21644;&#26426;&#22120;&#23457;&#26680;&#21592;&#30340;&#20849;&#24773;&#20882;&#29359;&#21644;&#22122;&#22768;&#23457;&#35745;&#30740;&#31350;&#20102;&#20882;&#29359;&#24615;&#35328;&#35770;&#26816;&#27979;&#20013;&#30340;&#24046;&#24322;&#24615;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;&#23457;&#26680;&#21592;&#20043;&#38388;&#23384;&#22312;&#24191;&#27867;&#30340;&#20998;&#27495;&#65292;&#24182;&#19988;&#20154;&#24037;&#23457;&#26680;&#21592;&#21644;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#20998;&#31867;&#22120;&#26080;&#27861;&#39044;&#27979;&#20854;&#20182;&#23457;&#26680;&#21592;&#30340;&#22238;&#24212;&#12290;&#36825;&#23545;&#20110;&#20869;&#23481;&#23457;&#26680;&#20855;&#26377;&#37325;&#35201;&#24847;&#20041;&#12290;</title><link>http://arxiv.org/abs/2301.12534</link><description>&lt;p&gt;
&#20154;&#24037;&#21644;&#26426;&#22120;&#20851;&#20110;&#20160;&#20040;&#26159;&#20882;&#29359;&#23384;&#22312;&#36739;&#22823;&#20998;&#27495;&#30340;&#20849;&#24773;&#20882;&#29359;&#21644;&#22122;&#22768;&#23457;&#35745;&#65306;&#32479;&#19968;&#20027;&#35266;&#20882;&#29359;&#30340;&#20154;&#31867;&#21644;&#26426;&#22120;&#24046;&#24322;
&lt;/p&gt;
&lt;p&gt;
Vicarious Offense and Noise Audit of Offensive Speech Classifiers: Unifying Human and Machine Disagreement on What is Offensive. (arXiv:2301.12534v3 [cs.CL] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2301.12534
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36890;&#36807;&#20154;&#24037;&#21644;&#26426;&#22120;&#23457;&#26680;&#21592;&#30340;&#20849;&#24773;&#20882;&#29359;&#21644;&#22122;&#22768;&#23457;&#35745;&#30740;&#31350;&#20102;&#20882;&#29359;&#24615;&#35328;&#35770;&#26816;&#27979;&#20013;&#30340;&#24046;&#24322;&#24615;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;&#23457;&#26680;&#21592;&#20043;&#38388;&#23384;&#22312;&#24191;&#27867;&#30340;&#20998;&#27495;&#65292;&#24182;&#19988;&#20154;&#24037;&#23457;&#26680;&#21592;&#21644;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#20998;&#31867;&#22120;&#26080;&#27861;&#39044;&#27979;&#20854;&#20182;&#23457;&#26680;&#21592;&#30340;&#22238;&#24212;&#12290;&#36825;&#23545;&#20110;&#20869;&#23481;&#23457;&#26680;&#20855;&#26377;&#37325;&#35201;&#24847;&#20041;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20882;&#29359;&#24615;&#35328;&#35770;&#26816;&#27979;&#26159;&#20869;&#23481;&#23457;&#26680;&#30340;&#19968;&#20010;&#20851;&#38190;&#32452;&#25104;&#37096;&#20998;&#12290;&#28982;&#32780;&#65292;&#20160;&#20040;&#26159;&#20882;&#29359;&#24615;&#30340;&#21487;&#20197;&#26159;&#39640;&#24230;&#20027;&#35266;&#30340;&#12290;&#26412;&#25991;&#30740;&#31350;&#20102;&#24403;&#28041;&#21450;&#21040;&#29616;&#23454;&#19990;&#30028;&#31038;&#20132;&#32593;&#31449;&#25919;&#27835;&#35328;&#35770;&#26102;&#65292;&#20154;&#24037;&#21644;&#26426;&#22120;&#23457;&#26680;&#21592;&#23545;&#20110;&#20160;&#20040;&#26159;&#20882;&#29359;&#24615;&#30340;&#23384;&#22312;&#20998;&#27495;&#12290;&#25105;&#20204;&#21457;&#29616;&#65288;1&#65289;&#23457;&#26680;&#21592;&#20043;&#38388;&#65288;&#21253;&#25324;&#20154;&#24037;&#21644;&#26426;&#22120;&#65289;&#23384;&#22312;&#24191;&#27867;&#20998;&#27495;&#65307;&#21644;&#65288;2&#65289;&#20154;&#24037;&#23457;&#26680;&#21592;&#21644;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#20998;&#31867;&#22120;&#26080;&#27861;&#39044;&#27979;&#20854;&#20182;&#23457;&#26680;&#21592;&#22522;&#20110;&#20182;&#20204;&#30340;&#25919;&#27835;&#20542;&#21521;&#22914;&#20309;&#22238;&#24212;&#12290;&#23545;&#20110;&#65288;1&#65289;&#65292;&#25105;&#20204;&#36827;&#34892;&#20102;&#19968;&#20010;&#21069;&#25152;&#26410;&#26377;&#35268;&#27169;&#30340;&#22122;&#22768;&#23457;&#35745;&#65292;&#32467;&#21512;&#20102;&#26426;&#22120;&#21644;&#20154;&#24037;&#22238;&#31572;&#12290;&#23545;&#20110;&#65288;2&#65289;&#65292;&#25105;&#20204;&#20171;&#32461;&#20102;&#19968;&#20010;&#39318;&#21019;&#30340;&#20849;&#24773;&#20882;&#29359;&#30340;&#25968;&#25454;&#38598;&#12290;&#25105;&#20204;&#30340;&#22122;&#22768;&#23457;&#35745;&#25581;&#31034;&#20102;&#19981;&#21516;&#26426;&#22120;&#23457;&#26680;&#21592;&#20043;&#38388;&#30340;&#23457;&#26680;&#32467;&#26524;&#24046;&#24322;&#24456;&#22823;&#12290;&#25105;&#20204;&#19982;&#20154;&#24037;&#23457;&#26680;&#21592;&#36827;&#34892;&#30340;&#23454;&#39564;&#34920;&#26126;&#65292;&#25919;&#27835;&#20542;&#21521;&#32467;&#21512;&#25935;&#24863;&#38382;&#39064;&#20250;&#24433;&#21709;&#21040;&#19968;&#23545;&#19968;&#30340;&#20882;&#29359;&#65292;&#20197;&#21450;&#20849;&#24773;&#20882;&#29359;&#12290;&#25968;&#25454;&#38598;&#21487;&#36890;&#36807;https://github.com/Homan-Lab/voic&#33719;&#24471;&#12290;
&lt;/p&gt;
&lt;p&gt;
Offensive speech detection is a key component of content moderation. However, what is offensive can be highly subjective. This paper investigates how machine and human moderators disagree on what is offensive when it comes to real-world social web political discourse. We show that (1) there is extensive disagreement among the moderators (humans and machines); and (2) human and large-language-model classifiers are unable to predict how other human raters will respond, based on their political leanings. For (1), we conduct a noise audit at an unprecedented scale that combines both machine and human responses. For (2), we introduce a first-of-its-kind dataset of vicarious offense. Our noise audit reveals that moderation outcomes vary wildly across different machine moderators. Our experiments with human moderators suggest that political leanings combined with sensitive issues affect both first-person and vicarious offense. The dataset is available through https://github.com/Homan-Lab/voic
&lt;/p&gt;</description></item></channel></rss>