<rss version="2.0"><channel><title>Chat Arxiv cs.LG</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.LG</description><item><title>&#36890;&#36807;&#20351;&#29992;&#25289;&#32454;&#23391;&#21010;&#20998;&#38598;&#65292;&#25105;&#20204;&#33021;&#22815;&#22312;&#22240;&#23376;&#25968;&#25454;&#20013;&#31283;&#20581;&#22320;&#20272;&#35745;&#24322;&#36136;&#24615;&#65292;&#24182;&#23558;&#22240;&#23376;&#31354;&#38388;&#21010;&#20998;&#25104;&#21327;&#21464;&#37327;&#32452;&#21512;&#30340;&#8220;&#27744;&#8221;&#65292;&#20197;&#20415;&#21306;&#20998;&#32467;&#26524;&#30340;&#24046;&#24322;&#12290;</title><link>https://arxiv.org/abs/2404.02141</link><description>&lt;p&gt;
&#20351;&#29992;&#25289;&#32454;&#23391;&#21010;&#20998;&#22312;&#22240;&#23376;&#25968;&#25454;&#20013;&#31283;&#20581;&#20272;&#35745;&#24322;&#36136;&#24615;
&lt;/p&gt;
&lt;p&gt;
Robustly estimating heterogeneity in factorial data using Rashomon Partitions
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2404.02141
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#20351;&#29992;&#25289;&#32454;&#23391;&#21010;&#20998;&#38598;&#65292;&#25105;&#20204;&#33021;&#22815;&#22312;&#22240;&#23376;&#25968;&#25454;&#20013;&#31283;&#20581;&#22320;&#20272;&#35745;&#24322;&#36136;&#24615;&#65292;&#24182;&#23558;&#22240;&#23376;&#31354;&#38388;&#21010;&#20998;&#25104;&#21327;&#21464;&#37327;&#32452;&#21512;&#30340;&#8220;&#27744;&#8221;&#65292;&#20197;&#20415;&#21306;&#20998;&#32467;&#26524;&#30340;&#24046;&#24322;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35768;&#22810;&#32479;&#35745;&#20998;&#26512;&#65292;&#26080;&#35770;&#26159;&#22312;&#35266;&#27979;&#25968;&#25454;&#36824;&#26159;&#38543;&#26426;&#23545;&#29031;&#35797;&#39564;&#20013;&#65292;&#37117;&#20250;&#38382;&#65306;&#24863;&#20852;&#36259;&#30340;&#32467;&#26524;&#22914;&#20309;&#38543;&#21487;&#35266;&#23519;&#21327;&#21464;&#37327;&#32452;&#21512;&#21464;&#21270;&#65311;&#19981;&#21516;&#30340;&#33647;&#29289;&#32452;&#21512;&#22914;&#20309;&#24433;&#21709;&#20581;&#24247;&#32467;&#26524;&#65292;&#31185;&#25216;&#37319;&#32435;&#22914;&#20309;&#20381;&#36182;&#28608;&#21169;&#21644;&#20154;&#21475;&#32479;&#35745;&#23398;&#65311;&#25105;&#20204;&#30340;&#30446;&#26631;&#26159;&#23558;&#36825;&#20010;&#22240;&#23376;&#31354;&#38388;&#21010;&#20998;&#25104;&#21327;&#21464;&#37327;&#32452;&#21512;&#30340;&#8220;&#27744;&#8221;&#65292;&#22312;&#36825;&#20123;&#27744;&#20013;&#32467;&#26524;&#20250;&#21457;&#29983;&#24046;&#24322;&#65288;&#20294;&#27744;&#20869;&#37096;&#19981;&#20250;&#21457;&#29983;&#65289;&#65292;&#32780;&#29616;&#26377;&#26041;&#27861;&#35201;&#20040;&#23547;&#25214;&#19968;&#20010;&#21333;&#19968;&#30340;&#8220;&#26368;&#20248;&#8221;&#20998;&#21106;&#65292;&#35201;&#20040;&#20174;&#21487;&#33021;&#20998;&#21106;&#30340;&#25972;&#20010;&#38598;&#21512;&#20013;&#25277;&#26679;&#12290;&#36825;&#20004;&#31181;&#26041;&#27861;&#37117;&#24573;&#35270;&#20102;&#36825;&#26679;&#19968;&#20010;&#20107;&#23454;&#65306;&#29305;&#21035;&#26159;&#22312;&#21327;&#21464;&#37327;&#20043;&#38388;&#23384;&#22312;&#30456;&#20851;&#32467;&#26500;&#30340;&#24773;&#20917;&#19979;&#65292;&#21487;&#33021;&#20197;&#35768;&#22810;&#31181;&#26041;&#24335;&#21010;&#20998;&#21327;&#21464;&#37327;&#31354;&#38388;&#65292;&#22312;&#32479;&#35745;&#19978;&#26159;&#26080;&#27861;&#21306;&#20998;&#30340;&#65292;&#23613;&#31649;&#23545;&#25919;&#31574;&#25110;&#31185;&#23398;&#26377;&#30528;&#38750;&#24120;&#19981;&#21516;&#30340;&#24433;&#21709;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;&#25289;&#32454;&#23391;&#21010;&#20998;&#38598;&#30340;&#26367;&#20195;&#35270;&#35282;
&lt;/p&gt;
&lt;p&gt;
arXiv:2404.02141v1 Announce Type: cross  Abstract: Many statistical analyses, in both observational data and randomized control trials, ask: how does the outcome of interest vary with combinations of observable covariates? How do various drug combinations affect health outcomes, or how does technology adoption depend on incentives and demographics? Our goal is to partition this factorial space into ``pools'' of covariate combinations where the outcome differs across the pools (but not within a pool). Existing approaches (i) search for a single ``optimal'' partition under assumptions about the association between covariates or (ii) sample from the entire set of possible partitions. Both these approaches ignore the reality that, especially with correlation structure in covariates, many ways to partition the covariate space may be statistically indistinguishable, despite very different implications for policy or science. We develop an alternative perspective, called Rashomon Partition Set
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#30005;&#23376;&#20581;&#24247;&#35760;&#24405;&#30340;&#22810;&#27169;&#24577;&#20998;&#26512;&#65292;&#24378;&#35843;&#20102;&#32467;&#26500;&#21270;&#21644;&#38750;&#32467;&#26500;&#21270;&#25968;&#25454;&#20043;&#38388;&#30340;&#21327;&#21516;&#20316;&#29992;&#65292;&#24182;&#23581;&#35797;&#23558;&#22810;&#27169;&#24577;&#23545;&#27604;&#23398;&#20064;&#26041;&#27861;&#24212;&#29992;&#20110;&#25552;&#39640;&#24739;&#32773;&#21307;&#30103;&#21382;&#21490;&#30340;&#23436;&#25972;&#24615;&#12290;</title><link>https://arxiv.org/abs/2403.14926</link><description>&lt;p&gt;
&#30005;&#23376;&#20581;&#24247;&#35760;&#24405;&#30340;&#22810;&#27169;&#24577;&#20998;&#26512;&#19978;&#30340;&#23545;&#27604;&#23398;&#20064;
&lt;/p&gt;
&lt;p&gt;
Contrastive Learning on Multimodal Analysis of Electronic Health Records
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.14926
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#30005;&#23376;&#20581;&#24247;&#35760;&#24405;&#30340;&#22810;&#27169;&#24577;&#20998;&#26512;&#65292;&#24378;&#35843;&#20102;&#32467;&#26500;&#21270;&#21644;&#38750;&#32467;&#26500;&#21270;&#25968;&#25454;&#20043;&#38388;&#30340;&#21327;&#21516;&#20316;&#29992;&#65292;&#24182;&#23581;&#35797;&#23558;&#22810;&#27169;&#24577;&#23545;&#27604;&#23398;&#20064;&#26041;&#27861;&#24212;&#29992;&#20110;&#25552;&#39640;&#24739;&#32773;&#21307;&#30103;&#21382;&#21490;&#30340;&#23436;&#25972;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#30005;&#23376;&#20581;&#24247;&#35760;&#24405;&#65288;EHR&#65289;&#31995;&#32479;&#21253;&#21547;&#22823;&#37327;&#30340;&#22810;&#27169;&#24577;&#20020;&#24202;&#25968;&#25454;&#65292;&#21253;&#25324;&#32467;&#26500;&#21270;&#25968;&#25454;&#22914;&#20020;&#24202;&#32534;&#30721;&#21644;&#38750;&#32467;&#26500;&#21270;&#25968;&#25454;&#22914;&#20020;&#24202;&#31508;&#35760;&#12290;&#28982;&#32780;&#65292;&#35768;&#22810;&#29616;&#26377;&#30340;&#38024;&#23545;EHR&#30340;&#30740;&#31350;&#20256;&#32479;&#19978;&#35201;&#20040;&#38598;&#20013;&#20110;&#20010;&#21035;&#27169;&#24577;&#65292;&#35201;&#20040;&#20197;&#19968;&#31181;&#30456;&#24403;&#31895;&#31961;&#30340;&#26041;&#24335;&#21512;&#24182;&#19981;&#21516;&#30340;&#27169;&#24577;&#12290;&#36825;&#31181;&#26041;&#27861;&#36890;&#24120;&#20250;&#23548;&#33268;&#23558;&#32467;&#26500;&#21270;&#21644;&#38750;&#32467;&#26500;&#21270;&#25968;&#25454;&#35270;&#20026;&#21333;&#29420;&#23454;&#20307;&#65292;&#24573;&#30053;&#23427;&#20204;&#20043;&#38388;&#22266;&#26377;&#30340;&#21327;&#21516;&#20316;&#29992;&#12290;&#20855;&#20307;&#26469;&#35828;&#65292;&#36825;&#20004;&#20010;&#37325;&#35201;&#30340;&#27169;&#24577;&#21253;&#21547;&#20020;&#24202;&#30456;&#20851;&#12289;&#23494;&#20999;&#30456;&#20851;&#21644;&#20114;&#34917;&#30340;&#20581;&#24247;&#20449;&#24687;&#12290;&#36890;&#36807;&#32852;&#21512;&#20998;&#26512;&#36825;&#20004;&#31181;&#25968;&#25454;&#27169;&#24577;&#21487;&#20197;&#25429;&#25417;&#21040;&#24739;&#32773;&#21307;&#30103;&#21382;&#21490;&#30340;&#26356;&#23436;&#25972;&#30011;&#38754;&#12290;&#23613;&#31649;&#22810;&#27169;&#24577;&#23545;&#27604;&#23398;&#20064;&#22312;&#35270;&#35273;&#35821;&#35328;&#39046;&#22495;&#21462;&#24471;&#20102;&#24040;&#22823;&#25104;&#21151;&#65292;&#20294;&#22312;&#22810;&#27169;&#24577;EHR&#39046;&#22495;&#65292;&#23588;&#20854;&#26159;&#22312;&#29702;&#35770;&#29702;&#35299;&#26041;&#38754;&#65292;&#20854;&#28508;&#21147;&#20173;&#26410;&#20805;&#20998;&#25366;&#25496;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.14926v1 Announce Type: cross  Abstract: Electronic health record (EHR) systems contain a wealth of multimodal clinical data including structured data like clinical codes and unstructured data such as clinical notes. However, many existing EHR-focused studies has traditionally either concentrated on an individual modality or merged different modalities in a rather rudimentary fashion. This approach often results in the perception of structured and unstructured data as separate entities, neglecting the inherent synergy between them. Specifically, the two important modalities contain clinically relevant, inextricably linked and complementary health information. A more complete picture of a patient's medical history is captured by the joint analysis of the two modalities of data. Despite the great success of multimodal contrastive learning on vision-language, its potential remains under-explored in the realm of multimodal EHR, particularly in terms of its theoretical understandi
&lt;/p&gt;</description></item><item><title>&#36825;&#31687;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#20110;&#26597;&#35810;&#23398;&#20064;&#20855;&#26377;&#23450;&#26102;&#22120;&#30340;Mealy&#26426;&#22120;&#30340;&#31639;&#27861;&#65292;&#22312;&#23454;&#29616;&#19978;&#26126;&#26174;&#27604;&#24050;&#26377;&#31639;&#27861;&#26356;&#26377;&#25928;&#29575;&#12290;</title><link>https://arxiv.org/abs/2403.02019</link><description>&lt;p&gt;
&#20855;&#26377;&#23450;&#26102;&#22120;&#30340;Mealy&#26426;&#22120;&#30340;&#20027;&#21160;&#23398;&#20064;
&lt;/p&gt;
&lt;p&gt;
Active Learning of Mealy Machines with Timers
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.02019
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#20110;&#26597;&#35810;&#23398;&#20064;&#20855;&#26377;&#23450;&#26102;&#22120;&#30340;Mealy&#26426;&#22120;&#30340;&#31639;&#27861;&#65292;&#22312;&#23454;&#29616;&#19978;&#26126;&#26174;&#27604;&#24050;&#26377;&#31639;&#27861;&#26356;&#26377;&#25928;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#22312;&#40657;&#30418;&#29615;&#22659;&#20013;&#25552;&#20986;&#20102;&#31532;&#19968;&#20010;&#29992;&#20110;&#26597;&#35810;&#23398;&#20064;&#19968;&#33324;&#31867;&#21035;&#30340;&#20855;&#26377;&#23450;&#26102;&#22120;&#30340;Mealy&#26426;&#22120;&#65288;MMTs&#65289;&#30340;&#31639;&#27861;&#12290;&#25105;&#20204;&#30340;&#31639;&#27861;&#26159;Vaandrager&#31561;&#20154;&#30340;L&#65283;&#31639;&#27861;&#23545;&#23450;&#26102;&#35774;&#32622;&#30340;&#25193;&#23637;&#12290;&#31867;&#20284;&#20110;Waga&#25552;&#20986;&#30340;&#29992;&#20110;&#23398;&#20064;&#23450;&#26102;&#33258;&#21160;&#26426;&#30340;&#31639;&#27861;&#65292;&#25105;&#20204;&#30340;&#31639;&#27861;&#21463;&#21040;Maler&#65286;Pnueli&#24605;&#24819;&#30340;&#21551;&#21457;&#12290;&#25105;&#20204;&#30340;&#31639;&#27861;&#21644;Waga&#30340;&#31639;&#27861;&#37117;&#20351;&#29992;&#31526;&#21495;&#26597;&#35810;&#36827;&#34892;&#22522;&#30784;&#35821;&#35328;&#23398;&#20064;&#65292;&#28982;&#21518;&#20351;&#29992;&#26377;&#38480;&#25968;&#37327;&#30340;&#20855;&#20307;&#26597;&#35810;&#36827;&#34892;&#23454;&#29616;&#12290;&#28982;&#32780;&#65292;Waga&#38656;&#35201;&#25351;&#25968;&#32423;&#30340;&#20855;&#20307;&#26597;&#35810;&#26469;&#23454;&#29616;&#21333;&#20010;&#31526;&#21495;&#26597;&#35810;&#65292;&#32780;&#25105;&#20204;&#21482;&#38656;&#35201;&#22810;&#39033;&#24335;&#25968;&#37327;&#12290;&#36825;&#26159;&#22240;&#20026;&#35201;&#23398;&#20064;&#23450;&#26102;&#33258;&#21160;&#26426;&#65292;&#23398;&#20064;&#32773;&#38656;&#35201;&#30830;&#23450;&#27599;&#20010;&#36716;&#25442;&#30340;&#30830;&#20999;&#21355;&#20853;&#21644;&#37325;&#32622;&#65288;&#26377;&#25351;&#25968;&#22810;&#31181;&#21487;&#33021;&#24615;&#65289;&#65292;&#32780;&#35201;&#23398;&#20064;MMT&#65292;&#23398;&#20064;&#32773;&#21482;&#38656;&#35201;&#24324;&#28165;&#26970;&#21738;&#20123;&#20808;&#21069;&#30340;&#36716;&#25442;&#23548;&#33268;&#36229;&#26102;&#12290;&#27491;&#22914;&#25105;&#20204;&#20043;&#21069;&#30340;&#24037;&#20316;&#25152;&#31034;&#65292;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.02019v1 Announce Type: cross  Abstract: We present the first algorithm for query learning of a general class of Mealy machines with timers (MMTs) in a black-box context. Our algorithm is an extension of the L# algorithm of Vaandrager et al. to a timed setting. Like the algorithm for learning timed automata proposed by Waga, our algorithm is inspired by ideas of Maler &amp; Pnueli. Based on the elementary languages of, both Waga's and our algorithm use symbolic queries, which are then implemented using finitely many concrete queries. However, whereas Waga needs exponentially many concrete queries to implement a single symbolic query, we only need a polynomial number. This is because in order to learn a timed automaton, a learner needs to determine the exact guard and reset for each transition (out of exponentially many possibilities), whereas for learning an MMT a learner only needs to figure out which of the preceding transitions caused a timeout. As shown in our previous work, 
&lt;/p&gt;</description></item><item><title>&#32858;&#31867;&#26102;&#38388;&#24207;&#21015;&#30340;&#26032;&#38382;&#39064;&#65292;&#25552;&#20986;&#32852;&#21512;&#21010;&#20998;&#36712;&#36857;&#38598;&#24182;&#23398;&#20064;&#27599;&#20010;&#37096;&#20998;&#30340;&#32447;&#24615;&#21160;&#24577;&#31995;&#32479;&#27169;&#22411;&#65292;&#20197;&#26368;&#23567;&#21270;&#25152;&#26377;&#27169;&#22411;&#30340;&#26368;&#22823;&#35823;&#24046;</title><link>https://arxiv.org/abs/2311.02181</link><description>&lt;p&gt;
&#23398;&#20064;&#22810;&#20010;&#21160;&#24577;&#31995;&#32479;&#20013;&#30340;&#32852;&#21512;&#38382;&#39064;
&lt;/p&gt;
&lt;p&gt;
Joint Problems in Learning Multiple Dynamical Systems
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2311.02181
&lt;/p&gt;
&lt;p&gt;
&#32858;&#31867;&#26102;&#38388;&#24207;&#21015;&#30340;&#26032;&#38382;&#39064;&#65292;&#25552;&#20986;&#32852;&#21512;&#21010;&#20998;&#36712;&#36857;&#38598;&#24182;&#23398;&#20064;&#27599;&#20010;&#37096;&#20998;&#30340;&#32447;&#24615;&#21160;&#24577;&#31995;&#32479;&#27169;&#22411;&#65292;&#20197;&#26368;&#23567;&#21270;&#25152;&#26377;&#27169;&#22411;&#30340;&#26368;&#22823;&#35823;&#24046;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26102;&#38388;&#24207;&#21015;&#30340;&#32858;&#31867;&#26159;&#19968;&#20010;&#32463;&#36807;&#20805;&#20998;&#30740;&#31350;&#30340;&#38382;&#39064;&#65292;&#20854;&#24212;&#29992;&#33539;&#22260;&#20174;&#36890;&#36807;&#20195;&#35874;&#20135;&#29289;&#27987;&#24230;&#33719;&#24471;&#30340;&#23450;&#37327;&#20010;&#24615;&#21270;&#20195;&#35874;&#27169;&#22411;&#21040;&#37327;&#23376;&#20449;&#24687;&#29702;&#35770;&#20013;&#30340;&#29366;&#24577;&#21028;&#21035;&#12290;&#25105;&#20204;&#32771;&#34385;&#20102;&#19968;&#20010;&#21464;&#31181;&#65292;&#21363;&#32473;&#23450;&#19968;&#32452;&#36712;&#36857;&#21644;&#19968;&#20123;&#37096;&#20998;&#65292;&#25105;&#20204;&#32852;&#21512;&#21010;&#20998;&#36712;&#36857;&#38598;&#24182;&#23398;&#20064;&#27599;&#20010;&#37096;&#20998;&#30340;&#32447;&#24615;&#21160;&#24577;&#31995;&#32479;&#65288;LDS&#65289;&#27169;&#22411;&#65292;&#20197;&#20351;&#24471;&#25152;&#26377;&#27169;&#22411;&#30340;&#26368;&#22823;&#35823;&#24046;&#26368;&#23567;&#21270;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#20840;&#23616;&#25910;&#25947;&#30340;&#26041;&#27861;&#21644;EM&#21551;&#21457;&#24335;&#31639;&#27861;&#65292;&#24182;&#38468;&#19978;&#20102;&#26377;&#21069;&#26223;&#30340;&#35745;&#31639;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2311.02181v2 Announce Type: replace-cross  Abstract: Clustering of time series is a well-studied problem, with applications ranging from quantitative, personalized models of metabolism obtained from metabolite concentrations to state discrimination in quantum information theory. We consider a variant, where given a set of trajectories and a number of parts, we jointly partition the set of trajectories and learn linear dynamical system (LDS) models for each part, so as to minimize the maximum error across all the models. We present globally convergent methods and EM heuristics, accompanied by promising computational results.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#21033;&#29992;&#25513;&#30721;&#33258;&#32534;&#30721;&#22120;&#30340;&#30450;&#30446;&#38450;&#24481;&#26694;&#26550;&#65288;BDMAE&#65289;&#65292;&#21487;&#20197;&#22312;&#27979;&#35797;&#26102;&#38450;&#24481;&#30450;&#30446;&#21518;&#38376;&#25915;&#20987;&#65292;&#19981;&#38656;&#35201;&#39564;&#35777;&#25968;&#25454;&#21644;&#27169;&#22411;&#21442;&#25968;&#65292;&#36890;&#36807;&#27979;&#35797;&#22270;&#20687;&#21644; MAE &#36824;&#21407;&#20043;&#38388;&#30340;&#32467;&#26500;&#30456;&#20284;&#24615;&#21644;&#26631;&#31614;&#19968;&#33268;&#24615;&#26469;&#26816;&#27979;&#21518;&#38376;&#25915;&#20987;&#12290;</title><link>http://arxiv.org/abs/2303.15564</link><description>&lt;p&gt;
&#25513;&#30721;&#36824;&#21407;&#25216;&#26415;&#65306;&#21033;&#29992;&#25513;&#30721;&#33258;&#32534;&#30721;&#22120;&#22312;&#27979;&#35797;&#26102;&#38450;&#24481;&#30450;&#30446;&#21518;&#38376;&#25915;&#20987;
&lt;/p&gt;
&lt;p&gt;
Mask and Restore: Blind Backdoor Defense at Test Time with Masked Autoencoder. (arXiv:2303.15564v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.15564
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#21033;&#29992;&#25513;&#30721;&#33258;&#32534;&#30721;&#22120;&#30340;&#30450;&#30446;&#38450;&#24481;&#26694;&#26550;&#65288;BDMAE&#65289;&#65292;&#21487;&#20197;&#22312;&#27979;&#35797;&#26102;&#38450;&#24481;&#30450;&#30446;&#21518;&#38376;&#25915;&#20987;&#65292;&#19981;&#38656;&#35201;&#39564;&#35777;&#25968;&#25454;&#21644;&#27169;&#22411;&#21442;&#25968;&#65292;&#36890;&#36807;&#27979;&#35797;&#22270;&#20687;&#21644; MAE &#36824;&#21407;&#20043;&#38388;&#30340;&#32467;&#26500;&#30456;&#20284;&#24615;&#21644;&#26631;&#31614;&#19968;&#33268;&#24615;&#26469;&#26816;&#27979;&#21518;&#38376;&#25915;&#20987;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#23481;&#26131;&#21463;&#21040;&#24694;&#24847;&#25915;&#20987;&#65292;&#25915;&#20987;&#32773;&#20250;&#36890;&#36807;&#22312;&#22270;&#20687;&#19978;&#21472;&#21152;&#29305;&#27530;&#30340;&#35302;&#21457;&#22120;&#26469;&#24694;&#24847;&#25805;&#32437;&#27169;&#22411;&#34892;&#20026;&#65292;&#36825;&#31216;&#20026;&#21518;&#38376;&#25915;&#20987;&#12290;&#29616;&#26377;&#30340;&#21518;&#38376;&#38450;&#24481;&#26041;&#27861;&#36890;&#24120;&#38656;&#35201;&#35775;&#38382;&#19968;&#20123;&#39564;&#35777;&#25968;&#25454;&#21644;&#27169;&#22411;&#21442;&#25968;&#65292;&#36825;&#22312;&#35768;&#22810;&#23454;&#38469;&#24212;&#29992;&#20013;&#26159;&#19981;&#20999;&#23454;&#38469;&#30340;&#65292;&#20363;&#22914;&#24403;&#27169;&#22411;&#20316;&#20026;&#20113;&#26381;&#21153;&#25552;&#20379;&#26102;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;&#26412;&#25991;&#33268;&#21147;&#20110;&#27979;&#35797;&#26102;&#30340;&#30450;&#30446;&#21518;&#38376;&#38450;&#24481;&#23454;&#36341;&#65292;&#29305;&#21035;&#26159;&#38024;&#23545;&#40657;&#30418;&#27169;&#22411;&#12290;&#27599;&#20010;&#27979;&#35797;&#22270;&#20687;&#30340;&#30495;&#23454;&#26631;&#31614;&#38656;&#35201;&#20174;&#21487;&#30097;&#27169;&#22411;&#30340;&#30828;&#26631;&#31614;&#39044;&#27979;&#20013;&#24674;&#22797;&#12290;&#28982;&#32780;&#65292;&#22312;&#22270;&#20687;&#31354;&#38388;&#20013;&#21551;&#21457;&#24335;&#35302;&#21457;&#22120;&#25628;&#32034;&#19981;&#36866;&#29992;&#20110;&#22797;&#26434;&#35302;&#21457;&#22120;&#25110;&#39640;&#20998;&#36776;&#29575;&#30340;&#22270;&#29255;&#12290;&#25105;&#20204;&#36890;&#36807;&#21033;&#29992;&#36890;&#29992;&#22270;&#20687;&#29983;&#25104;&#27169;&#22411;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#21033;&#29992;&#25513;&#30721;&#33258;&#32534;&#30721;&#22120;&#30340;&#30450;&#30446;&#38450;&#24481;&#26694;&#26550;&#65288;BDMAE&#65289;&#65292;&#36890;&#36807;&#27979;&#35797;&#22270;&#20687;&#21644; MAE &#36824;&#21407;&#20043;&#38388;&#30340;&#32467;&#26500;&#30456;&#20284;&#24615;&#21644;&#26631;&#31614;&#19968;&#33268;&#24615;&#26469;&#26816;&#27979;&#21518;&#38376;&#25915;&#20987;&#12290;
&lt;/p&gt;
&lt;p&gt;
Deep neural networks are vulnerable to backdoor attacks, where an adversary maliciously manipulates the model behavior through overlaying images with special triggers. Existing backdoor defense methods often require accessing a few validation data and model parameters, which are impractical in many real-world applications, e.g., when the model is provided as a cloud service. In this paper, we address the practical task of blind backdoor defense at test time, in particular for black-box models. The true label of every test image needs to be recovered on the fly from the hard label predictions of a suspicious model. The heuristic trigger search in image space, however, is not scalable to complex triggers or high image resolution. We circumvent such barrier by leveraging generic image generation models, and propose a framework of Blind Defense with Masked AutoEncoder (BDMAE). It uses the image structural similarity and label consistency between the test image and MAE restorations to detec
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#21517;&#20026;&#26377;&#38480;&#34920;&#36798;&#26041;&#27861;&#65288;FEX&#65289;&#30340;&#26032;&#26041;&#27861;&#65292;&#29992;&#20110;&#22312;&#20855;&#26377;&#26377;&#38480;&#20010;&#35299;&#26512;&#34920;&#36798;&#24335;&#30340;&#20989;&#25968;&#31354;&#38388;&#20013;&#23547;&#25214;&#39640;&#32500;&#20559;&#24494;&#20998;&#26041;&#31243;&#30340;&#36817;&#20284;&#35299;&#12290;&#36890;&#36807;&#20351;&#29992;&#28145;&#24230;&#24378;&#21270;&#23398;&#20064;&#26041;&#27861;&#23558;FEX&#24212;&#29992;&#20110;&#21508;&#31181;&#39640;&#32500;&#20559;&#24494;&#20998;&#26041;&#31243;&#65292;&#21487;&#20197;&#23454;&#29616;&#39640;&#24230;&#20934;&#30830;&#30340;&#27714;&#35299;&#65292;&#24182;&#19988;&#36991;&#20813;&#20102;&#32500;&#24230;&#28798;&#38590;&#12290;&#36825;&#31181;&#26377;&#38480;&#35299;&#26512;&#34920;&#36798;&#24335;&#30340;&#36817;&#20284;&#35299;&#36824;&#21487;&#20197;&#25552;&#20379;&#23545;&#30495;&#23454;&#20559;&#24494;&#20998;&#26041;&#31243;&#35299;&#30340;&#21487;&#35299;&#37322;&#27934;&#23519;&#12290;</title><link>http://arxiv.org/abs/2206.10121</link><description>&lt;p&gt;
&#29992;&#20110;&#27714;&#35299;&#39640;&#32500;&#20559;&#24494;&#20998;&#26041;&#31243;&#30340;&#26377;&#38480;&#34920;&#36798;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Finite Expression Method for Solving High-Dimensional Partial Differential Equations. (arXiv:2206.10121v3 [math.NA] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2206.10121
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#21517;&#20026;&#26377;&#38480;&#34920;&#36798;&#26041;&#27861;&#65288;FEX&#65289;&#30340;&#26032;&#26041;&#27861;&#65292;&#29992;&#20110;&#22312;&#20855;&#26377;&#26377;&#38480;&#20010;&#35299;&#26512;&#34920;&#36798;&#24335;&#30340;&#20989;&#25968;&#31354;&#38388;&#20013;&#23547;&#25214;&#39640;&#32500;&#20559;&#24494;&#20998;&#26041;&#31243;&#30340;&#36817;&#20284;&#35299;&#12290;&#36890;&#36807;&#20351;&#29992;&#28145;&#24230;&#24378;&#21270;&#23398;&#20064;&#26041;&#27861;&#23558;FEX&#24212;&#29992;&#20110;&#21508;&#31181;&#39640;&#32500;&#20559;&#24494;&#20998;&#26041;&#31243;&#65292;&#21487;&#20197;&#23454;&#29616;&#39640;&#24230;&#20934;&#30830;&#30340;&#27714;&#35299;&#65292;&#24182;&#19988;&#36991;&#20813;&#20102;&#32500;&#24230;&#28798;&#38590;&#12290;&#36825;&#31181;&#26377;&#38480;&#35299;&#26512;&#34920;&#36798;&#24335;&#30340;&#36817;&#20284;&#35299;&#36824;&#21487;&#20197;&#25552;&#20379;&#23545;&#30495;&#23454;&#20559;&#24494;&#20998;&#26041;&#31243;&#35299;&#30340;&#21487;&#35299;&#37322;&#27934;&#23519;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35774;&#35745;&#39640;&#25928;&#20934;&#30830;&#30340;&#39640;&#32500;&#20559;&#24494;&#20998;&#26041;&#31243;&#25968;&#20540;&#27714;&#35299;&#22120;&#20173;&#28982;&#26159;&#35745;&#31639;&#31185;&#23398;&#21644;&#24037;&#31243;&#20013;&#19968;&#20010;&#20855;&#26377;&#25361;&#25112;&#24615;&#21644;&#37325;&#35201;&#24615;&#30340;&#35838;&#39064;&#65292;&#20027;&#35201;&#26159;&#30001;&#20110;&#22312;&#35774;&#35745;&#33021;&#22815;&#25353;&#32500;&#25968;&#36827;&#34892;&#25193;&#23637;&#30340;&#25968;&#20540;&#26041;&#26696;&#20013;&#23384;&#22312;&#8220;&#32500;&#24230;&#28798;&#38590;&#8221;&#12290;&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#26032;&#30340;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#22312;&#20855;&#26377;&#26377;&#38480;&#20010;&#35299;&#26512;&#34920;&#36798;&#24335;&#30340;&#20989;&#25968;&#31354;&#38388;&#20013;&#23547;&#25214;&#36817;&#20284;&#30340;&#20559;&#24494;&#20998;&#26041;&#31243;&#35299;&#65292;&#22240;&#27492;&#23558;&#35813;&#26041;&#27861;&#21629;&#21517;&#20026;&#26377;&#38480;&#34920;&#36798;&#26041;&#27861;&#65288;FEX&#65289;&#12290;&#22312;&#36817;&#20284;&#29702;&#35770;&#20013;&#35777;&#26126;&#20102;FEX&#21487;&#20197;&#36991;&#20813;&#32500;&#24230;&#28798;&#38590;&#12290;&#20316;&#20026;&#27010;&#24565;&#35777;&#26126;&#65292;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#28145;&#24230;&#24378;&#21270;&#23398;&#20064;&#26041;&#27861;&#65292;&#29992;&#20110;&#22312;&#19981;&#21516;&#32500;&#24230;&#19978;&#23454;&#29616;FEX&#27714;&#35299;&#21508;&#31181;&#39640;&#32500;&#20559;&#24494;&#20998;&#26041;&#31243;&#65292;&#23454;&#29616;&#20102;&#39640;&#29978;&#33267;&#26426;&#22120;&#31934;&#24230;&#65292;&#24182;&#20855;&#26377;&#22810;&#39033;&#24335;&#32500;&#24230;&#30340;&#35760;&#24518;&#22797;&#26434;&#24230;&#21644;&#21487;&#25805;&#20316;&#30340;&#26102;&#38388;&#22797;&#26434;&#24230;&#12290;&#20855;&#26377;&#26377;&#38480;&#35299;&#26512;&#34920;&#36798;&#24335;&#30340;&#36817;&#20284;&#35299;&#36824;&#20026;&#22320;&#38754;&#30495;&#23454;&#20559;&#24494;&#20998;&#26041;&#31243;&#35299;&#25552;&#20379;&#20102;&#21487;&#35299;&#37322;&#30340;&#27934;&#23519;&#12290;
&lt;/p&gt;
&lt;p&gt;
Designing efficient and accurate numerical solvers for high-dimensional partial differential equations (PDEs) remains a challenging and important topic in computational science and engineering, mainly due to the "curse of dimensionality" in designing numerical schemes that scale in dimension. This paper introduces a new methodology that seeks an approximate PDE solution in the space of functions with finitely many analytic expressions and, hence, this methodology is named the finite expression method (FEX). It is proved in approximation theory that FEX can avoid the curse of dimensionality. As a proof of concept, a deep reinforcement learning method is proposed to implement FEX for various high-dimensional PDEs in different dimensions, achieving high and even machine accuracy with a memory complexity polynomial in dimension and an amenable time complexity. An approximate solution with finite analytic expressions also provides interpretable insights into the ground truth PDE solution, w
&lt;/p&gt;</description></item></channel></rss>