<rss version="2.0"><channel><title>Chat Arxiv cs.LG</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.LG</description><item><title>&#25968;&#21315;&#20301;AI&#20316;&#32773;&#23545;&#26410;&#26469;AI&#30340;&#39044;&#27979;&#26174;&#31034;&#65292;&#21040;2028&#24180;&#65292;AI&#31995;&#32479;&#26377;50%&#30340;&#20960;&#29575;&#23454;&#29616;&#22810;&#20010;&#37324;&#31243;&#30865;&#65292;&#21253;&#25324;&#33258;&#20027;&#26500;&#24314;&#20840;&#26032;&#30340;&#20184;&#27454;&#22788;&#29702;&#32593;&#31449;&#12289;&#21019;&#20316;&#19968;&#39318;&#19982;&#30693;&#21517;&#38899;&#20048;&#23478;&#30340;&#26032;&#27468;&#38590;&#20197;&#21306;&#20998;&#30340;&#27468;&#26354;&#65292;&#24182;&#33258;&#20027;&#19979;&#36733;&#21644;&#35843;&#25972;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#12290;&#21516;&#26102;&#65292;&#26080;&#38656;&#36741;&#21161;&#30340;&#26426;&#22120;&#22312;&#21508;&#31181;&#20219;&#21153;&#19978;&#32988;&#36807;&#20154;&#31867;&#30340;&#20960;&#29575;&#20272;&#35745;&#20026;10%&#21040;2047&#24180;&#20026;50%&#12290;</title><link>http://arxiv.org/abs/2401.02843</link><description>&lt;p&gt;
&#25968;&#21315;&#20301;AI&#20316;&#32773;&#23545;&#26410;&#26469;AI&#30340;&#39044;&#27979;
&lt;/p&gt;
&lt;p&gt;
Thousands of AI Authors on the Future of AI. (arXiv:2401.02843v1 [cs.CY])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.02843
&lt;/p&gt;
&lt;p&gt;
&#25968;&#21315;&#20301;AI&#20316;&#32773;&#23545;&#26410;&#26469;AI&#30340;&#39044;&#27979;&#26174;&#31034;&#65292;&#21040;2028&#24180;&#65292;AI&#31995;&#32479;&#26377;50%&#30340;&#20960;&#29575;&#23454;&#29616;&#22810;&#20010;&#37324;&#31243;&#30865;&#65292;&#21253;&#25324;&#33258;&#20027;&#26500;&#24314;&#20840;&#26032;&#30340;&#20184;&#27454;&#22788;&#29702;&#32593;&#31449;&#12289;&#21019;&#20316;&#19968;&#39318;&#19982;&#30693;&#21517;&#38899;&#20048;&#23478;&#30340;&#26032;&#27468;&#38590;&#20197;&#21306;&#20998;&#30340;&#27468;&#26354;&#65292;&#24182;&#33258;&#20027;&#19979;&#36733;&#21644;&#35843;&#25972;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#12290;&#21516;&#26102;&#65292;&#26080;&#38656;&#36741;&#21161;&#30340;&#26426;&#22120;&#22312;&#21508;&#31181;&#20219;&#21153;&#19978;&#32988;&#36807;&#20154;&#31867;&#30340;&#20960;&#29575;&#20272;&#35745;&#20026;10%&#21040;2047&#24180;&#20026;50%&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#36804;&#20170;&#20026;&#27490;&#26368;&#22823;&#35268;&#27169;&#30340;&#35843;&#26597;&#20013;&#65292;2778&#21517;&#22312;&#39030;&#32423;&#20154;&#24037;&#26234;&#33021;&#65288;AI&#65289;&#20250;&#35758;&#19978;&#21457;&#34920;&#36807;&#35770;&#25991;&#30340;&#30740;&#31350;&#20154;&#21592;&#23545;AI&#36827;&#23637;&#30340;&#36895;&#24230;&#12289;&#39640;&#32423;AI&#31995;&#32479;&#30340;&#24615;&#36136;&#21644;&#24433;&#21709;&#36827;&#34892;&#20102;&#39044;&#27979;&#12290;&#24635;&#20307;&#39044;&#27979;&#26174;&#31034;&#65292;&#21040;2028&#24180;&#65292;AI&#31995;&#32479;&#33267;&#23569;&#26377;50%&#30340;&#20960;&#29575;&#23454;&#29616;&#22810;&#20010;&#37324;&#31243;&#30865;&#65292;&#21253;&#25324;&#33258;&#20027;&#26500;&#24314;&#19968;&#20010;&#20840;&#26032;&#30340;&#20184;&#27454;&#22788;&#29702;&#32593;&#31449;&#12289;&#21019;&#20316;&#19968;&#39318;&#21487;&#20197;&#19982;&#30693;&#21517;&#38899;&#20048;&#23478;&#30340;&#26032;&#27468;&#38590;&#20197;&#21306;&#20998;&#30340;&#27468;&#26354;&#65292;&#24182;&#33258;&#20027;&#19979;&#36733;&#21644;&#35843;&#25972;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#12290;&#22914;&#26524;&#31185;&#23398;&#25345;&#32493;&#19981;&#21463;&#24178;&#25200;&#65292;2027&#24180;&#26080;&#38656;&#36741;&#21161;&#30340;&#26426;&#22120;&#22312;&#21508;&#31181;&#20219;&#21153;&#19978;&#32988;&#36807;&#20154;&#31867;&#30340;&#20960;&#29575;&#20272;&#35745;&#20026;10%&#65292;&#21040;2047&#24180;&#20026;50%&#12290;&#21518;&#32773;&#30340;&#20272;&#35745;&#27604;&#25105;&#20204;&#19968;&#24180;&#21069;&#36827;&#34892;&#30340;&#31867;&#20284;&#35843;&#26597;[Grace et al., 2022]&#25552;&#21069;&#20102;13&#24180;&#12290;&#28982;&#32780;&#65292;&#25152;&#26377;&#20154;&#31867;&#32844;&#19994;&#23436;&#20840;&#21487;&#33258;&#21160;&#21270;&#30340;&#20960;&#29575;&#39044;&#35745;&#35201;&#21040;2037&#24180;&#36798;&#21040;10%&#65292;&#21040;2116&#24180;&#25165;&#36798;&#21040;50%&#65288;&#19982;2022&#24180;&#35843;&#26597;&#20013;&#30340;2164&#24180;&#30456;&#27604;&#65289;&#12290;
&lt;/p&gt;
&lt;p&gt;
In the largest survey of its kind, 2,778 researchers who had published in top-tier artificial intelligence (AI) venues gave predictions on the pace of AI progress and the nature and impacts of advanced AI systems The aggregate forecasts give at least a 50% chance of AI systems achieving several milestones by 2028, including autonomously constructing a payment processing site from scratch, creating a song indistinguishable from a new song by a popular musician, and autonomously downloading and fine-tuning a large language model. If science continues undisrupted, the chance of unaided machines outperforming humans in every possible task was estimated at 10% by 2027, and 50% by 2047. The latter estimate is 13 years earlier than that reached in a similar survey we conducted only one year earlier [Grace et al., 2022]. However, the chance of all human occupations becoming fully automatable was forecast to reach 10% by 2037, and 50% as late as 2116 (compared to 2164 in the 2022 survey).  Most
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#26102;&#38388;&#24046;&#24322;&#29256;&#26412;&#30340;&#23545;&#27604;&#39044;&#27979;&#32534;&#30721;&#65292;&#36890;&#36807;&#23558;&#19981;&#21516;&#26102;&#38388;&#24207;&#21015;&#25968;&#25454;&#30340;&#29255;&#27573;&#32452;&#21512;&#22312;&#19968;&#36215;&#65292;&#26469;&#20943;&#23569;&#23398;&#20064;&#39044;&#27979;&#26410;&#26469;&#20107;&#20214;&#25152;&#38656;&#30340;&#25968;&#25454;&#37327;&#12290;&#23454;&#39564;&#35777;&#26126;&#65292;&#19982;&#20808;&#21069;&#30340;&#26041;&#27861;&#30456;&#27604;&#65292;&#25105;&#20204;&#30340;&#26041;&#27861;&#22312;&#25104;&#21151;&#29575;&#19978;&#25552;&#39640;&#20102;2&#20493;&#65292;&#24182;&#19988;&#23545;&#20110;&#38543;&#26426;&#29615;&#22659;&#26377;&#26356;&#22909;&#30340;&#36866;&#24212;&#33021;&#21147;&#12290;</title><link>http://arxiv.org/abs/2310.20141</link><description>&lt;p&gt;
&#23545;&#27604;&#24046;&#24322;&#24615;&#39044;&#27979;&#32534;&#30721;
&lt;/p&gt;
&lt;p&gt;
Contrastive Difference Predictive Coding. (arXiv:2310.20141v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.20141
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#26102;&#38388;&#24046;&#24322;&#29256;&#26412;&#30340;&#23545;&#27604;&#39044;&#27979;&#32534;&#30721;&#65292;&#36890;&#36807;&#23558;&#19981;&#21516;&#26102;&#38388;&#24207;&#21015;&#25968;&#25454;&#30340;&#29255;&#27573;&#32452;&#21512;&#22312;&#19968;&#36215;&#65292;&#26469;&#20943;&#23569;&#23398;&#20064;&#39044;&#27979;&#26410;&#26469;&#20107;&#20214;&#25152;&#38656;&#30340;&#25968;&#25454;&#37327;&#12290;&#23454;&#39564;&#35777;&#26126;&#65292;&#19982;&#20808;&#21069;&#30340;&#26041;&#27861;&#30456;&#27604;&#65292;&#25105;&#20204;&#30340;&#26041;&#27861;&#22312;&#25104;&#21151;&#29575;&#19978;&#25552;&#39640;&#20102;2&#20493;&#65292;&#24182;&#19988;&#23545;&#20110;&#38543;&#26426;&#29615;&#22659;&#26377;&#26356;&#22909;&#30340;&#36866;&#24212;&#33021;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#39044;&#27979;&#21644;&#25512;&#29702;&#26410;&#26469;&#26159;&#35768;&#22810;&#26102;&#38388;&#24207;&#21015;&#38382;&#39064;&#30340;&#26680;&#24515;&#12290;&#20363;&#22914;&#65292;&#30446;&#26631;&#23548;&#21521;&#30340;&#24378;&#21270;&#23398;&#20064;&#21487;&#20197;&#34987;&#30475;&#20316;&#26159;&#23398;&#20064;&#34920;&#31034;&#20197;&#39044;&#27979;&#26410;&#26469;&#21487;&#33021;&#35775;&#38382;&#30340;&#29366;&#24577;&#12290;&#34429;&#28982;&#20808;&#21069;&#30340;&#26041;&#27861;&#24050;&#32463;&#20351;&#29992;&#23545;&#27604;&#24615;&#39044;&#27979;&#32534;&#30721;&#26469;&#24314;&#27169;&#26102;&#38388;&#24207;&#21015;&#25968;&#25454;&#65292;&#20294;&#23398;&#20064;&#32534;&#30721;&#38271;&#26399;&#20381;&#36182;&#36890;&#24120;&#38656;&#35201;&#22823;&#37327;&#30340;&#25968;&#25454;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#31181;&#26102;&#38388;&#24046;&#24322;&#29256;&#26412;&#30340;&#23545;&#27604;&#39044;&#27979;&#32534;&#30721;&#65292;&#23558;&#19981;&#21516;&#26102;&#38388;&#24207;&#21015;&#25968;&#25454;&#30340;&#29255;&#27573;&#32452;&#21512;&#22312;&#19968;&#36215;&#65292;&#20197;&#20943;&#23569;&#23398;&#20064;&#26410;&#26469;&#20107;&#20214;&#39044;&#27979;&#25152;&#38656;&#30340;&#25968;&#25454;&#37327;&#12290;&#25105;&#20204;&#23558;&#36825;&#31181;&#34920;&#31034;&#23398;&#20064;&#26041;&#27861;&#24212;&#29992;&#20110;&#23548;&#20986;&#30446;&#26631;&#23548;&#21521;&#30340;&#24378;&#21270;&#23398;&#20064;&#30340;&#31163;&#31574;&#30053;&#31639;&#27861;&#12290;&#23454;&#39564;&#35777;&#26126;&#65292;&#19982;&#20808;&#21069;&#30340;&#24378;&#21270;&#23398;&#20064;&#26041;&#27861;&#30456;&#27604;&#65292;&#25105;&#20204;&#30340;&#26041;&#27861;&#22312;&#25104;&#21151;&#29575;&#19978;&#23454;&#29616;&#20102;&#20013;&#20301;&#25968;&#25552;&#39640;2&#20493;&#65292;&#24182;&#19988;&#21487;&#20197;&#26356;&#22909;&#22320;&#24212;&#23545;&#38543;&#26426;&#29615;&#22659;&#12290;&#22312;&#34920;&#26684;&#35774;&#32622;&#20013;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#25105;&#20204;&#30340;&#26041;&#27861;&#32422;&#20026;20&#20493;&#12290;
&lt;/p&gt;
&lt;p&gt;
Predicting and reasoning about the future lie at the heart of many time-series questions. For example, goal-conditioned reinforcement learning can be viewed as learning representations to predict which states are likely to be visited in the future. While prior methods have used contrastive predictive coding to model time series data, learning representations that encode long-term dependencies usually requires large amounts of data. In this paper, we introduce a temporal difference version of contrastive predictive coding that stitches together pieces of different time series data to decrease the amount of data required to learn predictions of future events. We apply this representation learning method to derive an off-policy algorithm for goal-conditioned RL. Experiments demonstrate that, compared with prior RL methods, ours achieves $2 \times$ median improvement in success rates and can better cope with stochastic environments. In tabular settings, we show that our method is about $20
&lt;/p&gt;</description></item><item><title>&#22270;&#24418;-SCP&#26159;&#19968;&#31181;&#20351;&#29992;&#22270;&#31070;&#32463;&#32593;&#32476;&#21152;&#36895;&#38598;&#21512;&#35206;&#30422;&#38382;&#39064;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#23398;&#20064;&#35782;&#21035;&#21253;&#21547;&#35299;&#31354;&#38388;&#30340;&#36739;&#23567;&#23376;&#38382;&#39064;&#26469;&#25552;&#39640;&#20248;&#21270;&#27714;&#35299;&#22120;&#30340;&#24615;&#33021;&#65292;&#23454;&#39564;&#32467;&#26524;&#34920;&#26126;&#65292;&#22270;&#24418;-SCP&#33021;&#22815;&#23558;&#38382;&#39064;&#22823;&#23567;&#20943;&#23569;30-70%&#65292;&#21644;&#21830;&#19994;&#27714;&#35299;&#22120;&#30456;&#27604;&#21152;&#36895;&#39640;&#36798;25&#20493;&#65292;&#24182;&#19988;&#33021;&#22815;&#22312;&#32473;&#23450;&#30340;&#26368;&#20248;&#24615;&#38408;&#20540;&#19979;&#25913;&#36827;&#25110;&#23454;&#29616;100%&#30340;&#26368;&#20248;&#24615;&#12290;</title><link>http://arxiv.org/abs/2310.07979</link><description>&lt;p&gt;
&#22270;&#24418;-SCP: &#29992;&#22270;&#31070;&#32463;&#32593;&#32476;&#21152;&#36895;&#38598;&#21512;&#35206;&#30422;&#38382;&#39064;
&lt;/p&gt;
&lt;p&gt;
Graph-SCP: Accelerating Set Cover Problems with Graph Neural Networks. (arXiv:2310.07979v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.07979
&lt;/p&gt;
&lt;p&gt;
&#22270;&#24418;-SCP&#26159;&#19968;&#31181;&#20351;&#29992;&#22270;&#31070;&#32463;&#32593;&#32476;&#21152;&#36895;&#38598;&#21512;&#35206;&#30422;&#38382;&#39064;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#23398;&#20064;&#35782;&#21035;&#21253;&#21547;&#35299;&#31354;&#38388;&#30340;&#36739;&#23567;&#23376;&#38382;&#39064;&#26469;&#25552;&#39640;&#20248;&#21270;&#27714;&#35299;&#22120;&#30340;&#24615;&#33021;&#65292;&#23454;&#39564;&#32467;&#26524;&#34920;&#26126;&#65292;&#22270;&#24418;-SCP&#33021;&#22815;&#23558;&#38382;&#39064;&#22823;&#23567;&#20943;&#23569;30-70%&#65292;&#21644;&#21830;&#19994;&#27714;&#35299;&#22120;&#30456;&#27604;&#21152;&#36895;&#39640;&#36798;25&#20493;&#65292;&#24182;&#19988;&#33021;&#22815;&#22312;&#32473;&#23450;&#30340;&#26368;&#20248;&#24615;&#38408;&#20540;&#19979;&#25913;&#36827;&#25110;&#23454;&#29616;100%&#30340;&#26368;&#20248;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#36234;&#26469;&#36234;&#22810;&#22320;&#29992;&#20110;&#21152;&#36895;&#32452;&#21512;&#20248;&#21270;&#38382;&#39064;&#12290;&#25105;&#20204;&#29305;&#21035;&#20851;&#27880;&#38598;&#21512;&#35206;&#30422;&#38382;&#39064;&#65288;SCP&#65289;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;&#22270;&#24418;-SCP&#30340;&#22270;&#31070;&#32463;&#32593;&#32476;&#26041;&#27861;&#65292;&#21487;&#20197;&#36890;&#36807;&#23398;&#20064;&#35782;&#21035;&#21253;&#21547;&#35299;&#31354;&#38388;&#30340;&#22823;&#22823;&#36739;&#23567;&#30340;&#23376;&#38382;&#39064;&#26469;&#22686;&#24378;&#29616;&#26377;&#30340;&#20248;&#21270;&#27714;&#35299;&#22120;&#12290;&#25105;&#20204;&#22312;&#20855;&#26377;&#19981;&#21516;&#38382;&#39064;&#29305;&#24449;&#21644;&#22797;&#26434;&#24230;&#30340;&#21512;&#25104;&#21152;&#26435;&#21644;&#38750;&#21152;&#26435;SCP&#23454;&#20363;&#19978;&#35780;&#20272;&#20102;&#22270;&#24418;-SCP&#30340;&#24615;&#33021;&#65292;&#24182;&#22312;OR Library&#30340;&#23454;&#20363;&#19978;&#36827;&#34892;&#20102;&#35780;&#20272;&#65292;&#36825;&#26159;SCP&#30340;&#19968;&#20010;&#32463;&#20856;&#22522;&#20934;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#22270;&#24418;-SCP&#23558;&#38382;&#39064;&#22823;&#23567;&#20943;&#23569;&#20102;30-70%&#65292;&#24182;&#19988;&#30456;&#23545;&#20110;&#21830;&#19994;&#27714;&#35299;&#22120;&#65288;Gurobi&#65289;&#23454;&#29616;&#20102;&#39640;&#36798;25&#20493;&#30340;&#36816;&#34892;&#26102;&#38388;&#21152;&#36895;&#12290;&#22312;&#32473;&#23450;&#25152;&#38656;&#30340;&#26368;&#20248;&#24615;&#38408;&#20540;&#30340;&#24773;&#20917;&#19979;&#65292;&#22270;&#24418;-SCP&#23558;&#25913;&#36827;&#25110;&#29978;&#33267;&#23454;&#29616;100%&#30340;&#26368;&#20248;&#24615;&#12290;&#36825;&#19982;&#24555;&#36895;&#36138;&#23146;&#35299;&#20915;&#26041;&#26696;&#24418;&#25104;&#20102;&#23545;&#27604;&#65292;&#21518;&#32773;&#22312;&#20445;&#35777;&#22810;&#39033;&#24335;&#36816;&#34892;&#26102;&#38388;&#30340;&#21516;&#26102;&#26126;&#26174;&#25439;&#23475;&#20102;&#35299;&#20915;&#26041;&#26696;&#30340;&#36136;&#37327;&#12290;&#22270;&#24418;-SCP&#21487;&#20197;&#25512;&#24191;&#21040;&#26356;&#22823;&#30340;&#38382;&#39064;&#35268;&#27169;&#12290;
&lt;/p&gt;
&lt;p&gt;
Machine learning (ML) approaches are increasingly being used to accelerate combinatorial optimization (CO) problems. We look specifically at the Set Cover Problem (SCP) and propose Graph-SCP, a graph neural network method that can augment existing optimization solvers by learning to identify a much smaller sub-problem that contains the solution space. We evaluate the performance of Graph-SCP on synthetic weighted and unweighted SCP instances with diverse problem characteristics and complexities, and on instances from the OR Library, a canonical benchmark for SCP. We show that Graph-SCP reduces the problem size by 30-70% and achieves run time speedups up to~25x when compared to commercial solvers (Gurobi). Given a desired optimality threshold, Graph-SCP will improve upon it or even achieve 100% optimality. This is in contrast to fast greedy solutions that significantly compromise solution quality to achieve guaranteed polynomial run time. Graph-SCP can generalize to larger problem sizes
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25506;&#35752;&#20102;&#22478;&#24066;&#35268;&#21010;&#19982;&#20154;&#24037;&#26234;&#33021;&#30340;&#20132;&#21449;&#24212;&#29992;&#65292;&#37325;&#28857;&#26159;&#33258;&#21160;&#21270;&#29992;&#22320;&#37197;&#32622;&#65292;&#36890;&#36807;&#23545;&#25239;&#23398;&#20064;&#12289;&#29983;&#25104;&#31070;&#32463;&#32593;&#32476;&#12289;&#28145;&#24230;&#32534;&#30721;&#22120;-&#35299;&#30721;&#22120;&#32593;&#32476;&#12289;&#23545;&#35805;&#24335; AI &#21644;&#22320;&#29702;&#31354;&#38388;&#21644;&#26102;&#38388;&#26426;&#22120;&#23398;&#20064;&#31561;&#25216;&#26415;&#65292;AI &#21487;&#20197;&#20026;&#29616;&#20195;&#22478;&#24066;&#35268;&#21010;&#24102;&#26469;&#19981;&#23569;&#21019;&#26032;&#19982;&#36129;&#29486;&#12290;</title><link>http://arxiv.org/abs/2304.03892</link><description>&lt;p&gt;
&#33258;&#21160;&#21270;&#22478;&#24066;&#35268;&#21010;&#65306;&#29983;&#25104;&#24335;&#21644;&#32842;&#22825;&#24335; AI &#30456;&#32467;&#21512;&#30340;&#22478;&#24066;&#35268;&#21010;&#25506;&#32034;
&lt;/p&gt;
&lt;p&gt;
Towards Automated Urban Planning: When Generative and ChatGPT-like AI Meets Urban Planning. (arXiv:2304.03892v1 [cs.AI])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.03892
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25506;&#35752;&#20102;&#22478;&#24066;&#35268;&#21010;&#19982;&#20154;&#24037;&#26234;&#33021;&#30340;&#20132;&#21449;&#24212;&#29992;&#65292;&#37325;&#28857;&#26159;&#33258;&#21160;&#21270;&#29992;&#22320;&#37197;&#32622;&#65292;&#36890;&#36807;&#23545;&#25239;&#23398;&#20064;&#12289;&#29983;&#25104;&#31070;&#32463;&#32593;&#32476;&#12289;&#28145;&#24230;&#32534;&#30721;&#22120;-&#35299;&#30721;&#22120;&#32593;&#32476;&#12289;&#23545;&#35805;&#24335; AI &#21644;&#22320;&#29702;&#31354;&#38388;&#21644;&#26102;&#38388;&#26426;&#22120;&#23398;&#20064;&#31561;&#25216;&#26415;&#65292;AI &#21487;&#20197;&#20026;&#29616;&#20195;&#22478;&#24066;&#35268;&#21010;&#24102;&#26469;&#19981;&#23569;&#21019;&#26032;&#19982;&#36129;&#29486;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22478;&#24066;&#35268;&#21010;&#39046;&#22495;&#21644;&#20154;&#24037;&#26234;&#33021;&#39046;&#22495;&#26366;&#32463;&#26159;&#29420;&#31435;&#21457;&#23637;&#30340;&#65292;&#20294;&#29616;&#22312;&#20004;&#20010;&#39046;&#22495;&#24320;&#22987;&#20132;&#21449;&#27719;&#21512;&#65292;&#20114;&#30456;&#20511;&#37492;&#21644;&#21463;&#30410;&#12290;&#26412;&#25991;&#20171;&#32461;&#20102;&#22478;&#24066;&#35268;&#21010;&#20174;&#21487;&#25345;&#32493;&#24615;&#12289;&#29983;&#27963;&#12289;&#32463;&#27982;&#12289;&#28798;&#23475;&#21644;&#29615;&#22659;&#31561;&#26041;&#38754;&#30340;&#37325;&#35201;&#24615;&#65292;&#22238;&#39038;&#20102;&#22478;&#24066;&#35268;&#21010;&#30340;&#22522;&#26412;&#27010;&#24565;&#65292;&#24182;&#23558;&#36825;&#20123;&#27010;&#24565;&#19982;&#26426;&#22120;&#23398;&#20064;&#30340;&#20851;&#38190;&#24320;&#25918;&#38382;&#39064;&#32852;&#31995;&#36215;&#26469;&#65292;&#21253;&#25324;&#23545;&#25239;&#23398;&#20064;&#12289;&#29983;&#25104;&#31070;&#32463;&#32593;&#32476;&#12289;&#28145;&#24230;&#32534;&#30721;&#22120;-&#35299;&#30721;&#22120;&#32593;&#32476;&#12289;&#23545;&#35805;&#24335; AI &#20197;&#21450;&#22320;&#29702;&#31354;&#38388;&#21644;&#26102;&#38388;&#26426;&#22120;&#23398;&#20064;&#31561;&#65292;&#35780;&#20272;&#20102; AI &#22914;&#20309;&#20026;&#29616;&#20195;&#22478;&#24066;&#35268;&#21010;&#20570;&#20986;&#36129;&#29486;&#12290;&#22240;&#27492;&#65292;&#19968;&#20010;&#26680;&#24515;&#38382;&#39064;&#26159;&#33258;&#21160;&#21270;&#29992;&#22320;&#37197;&#32622;&#65292;&#21363;&#20174;&#21608;&#22260;&#30340;&#22320;&#29702;&#31354;&#38388;&#12289;&#20154;&#31867;&#31227;&#21160;&#12289;&#31038;&#20132;&#23186;&#20307;&#12289;&#29615;&#22659;&#21644;&#32463;&#27982;&#27963;&#21160;&#20013;&#20026;&#30446;&#26631;&#21306;&#22495;&#29983;&#25104;&#22303;&#22320;&#29992;&#36884;&#21644;&#24314;&#31569;&#37197;&#32622;&#12290;&#26368;&#21518;&#65292;&#26412;&#25991;&#21246;&#30011;&#20102;&#38598;&#25104; AI &#21644;&#22478;&#24066;&#35268;&#21010;&#38754;&#20020;&#30340;&#19968;&#20123;&#25361;&#25112;&#21644;&#28508;&#22312;&#35299;&#20915;&#26041;&#26696;&#12290;
&lt;/p&gt;
&lt;p&gt;
The two fields of urban planning and artificial intelligence (AI) arose and developed separately. However, there is now cross-pollination and increasing interest in both fields to benefit from the advances of the other. In the present paper, we introduce the importance of urban planning from the sustainability, living, economic, disaster, and environmental perspectives. We review the fundamental concepts of urban planning and relate these concepts to crucial open problems of machine learning, including adversarial learning, generative neural networks, deep encoder-decoder networks, conversational AI, and geospatial and temporal machine learning, thereby assaying how AI can contribute to modern urban planning. Thus, a central problem is automated land-use configuration, which is formulated as the generation of land uses and building configuration for a target area from surrounding geospatial, human mobility, social media, environment, and economic activities. Finally, we delineate some 
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#32479;&#19968;&#30340;&#29983;&#25104;&#27169;&#22411;&#65292;&#35813;&#27169;&#22411;&#22522;&#20110;&#38543;&#26426;&#25554;&#20540;&#26694;&#26550;&#65292;&#21487;&#20197;&#23454;&#29616;&#27969;&#21644;&#25193;&#25955;&#26041;&#27861;&#30340;&#32479;&#19968;&#12290;&#20316;&#32773;&#26500;&#24314;&#20102;&#19968;&#31867;&#24191;&#27867;&#30340;&#36830;&#32493;&#26102;&#38388;&#38543;&#26426;&#36807;&#31243;&#65292;&#29992;&#20110;&#23558;&#20004;&#20010;&#20219;&#24847;&#30340;&#23494;&#24230;&#22312;&#26377;&#38480;&#26102;&#38388;&#20869;&#31934;&#30830;&#22320;&#36830;&#25509;&#12290;&#36825;&#31181;&#26041;&#27861;&#21487;&#20197;&#29992;&#20110;&#22522;&#20110;&#27010;&#29575;&#24494;&#20998;&#26041;&#31243;&#30340;&#30830;&#23450;&#24615;&#21644;&#38543;&#26426;&#29983;&#25104;&#27169;&#22411;&#30340;&#26500;&#24314;&#12290;</title><link>http://arxiv.org/abs/2303.08797</link><description>&lt;p&gt;
&#38543;&#26426;&#25554;&#20540;&#65306;&#27969;&#21644;&#25193;&#25955;&#30340;&#32479;&#19968;&#26694;&#26550;
&lt;/p&gt;
&lt;p&gt;
Stochastic Interpolants: A Unifying Framework for Flows and Diffusions. (arXiv:2303.08797v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.08797
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#32479;&#19968;&#30340;&#29983;&#25104;&#27169;&#22411;&#65292;&#35813;&#27169;&#22411;&#22522;&#20110;&#38543;&#26426;&#25554;&#20540;&#26694;&#26550;&#65292;&#21487;&#20197;&#23454;&#29616;&#27969;&#21644;&#25193;&#25955;&#26041;&#27861;&#30340;&#32479;&#19968;&#12290;&#20316;&#32773;&#26500;&#24314;&#20102;&#19968;&#31867;&#24191;&#27867;&#30340;&#36830;&#32493;&#26102;&#38388;&#38543;&#26426;&#36807;&#31243;&#65292;&#29992;&#20110;&#23558;&#20004;&#20010;&#20219;&#24847;&#30340;&#23494;&#24230;&#22312;&#26377;&#38480;&#26102;&#38388;&#20869;&#31934;&#30830;&#22320;&#36830;&#25509;&#12290;&#36825;&#31181;&#26041;&#27861;&#21487;&#20197;&#29992;&#20110;&#22522;&#20110;&#27010;&#29575;&#24494;&#20998;&#26041;&#31243;&#30340;&#30830;&#23450;&#24615;&#21644;&#38543;&#26426;&#29983;&#25104;&#27169;&#22411;&#30340;&#26500;&#24314;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#20171;&#32461;&#20102;&#19968;&#31867;&#24314;&#31435;&#22312;&#38543;&#26426;&#25554;&#20540;&#26694;&#26550;&#19978;&#30340;&#29983;&#25104;&#27169;&#22411;&#65292;&#35813;&#26694;&#26550;&#26159;&#22522;&#20110;Albergo&#65286;Vanden-Eijnden&#65288;2023&#65289;&#25552;&#20986;&#30340;&#65292;&#22312;&#27969;&#21644;&#25193;&#25955;&#26041;&#27861;&#19978;&#23454;&#29616;&#32479;&#19968;&#65292;&#25105;&#20204;&#39318;&#20808;&#23637;&#31034;&#20102;&#22914;&#20309;&#26500;&#24314;&#19968;&#31867;&#24191;&#27867;&#30340;&#36830;&#32493;&#26102;&#38388;&#38543;&#26426;&#36807;&#31243;&#65292;&#20854;&#26102;&#38388;&#20381;&#36182;&#30340;&#27010;&#29575;&#23494;&#24230;&#20989;&#25968;&#22312;&#26377;&#38480;&#26102;&#38388;&#20869;&#31934;&#30830;&#22320;&#36830;&#25509;&#20004;&#20010;&#20219;&#24847;&#30340;&#23494;&#24230;&#12290;&#36825;&#20123;&#8220;&#38543;&#26426;&#25554;&#20540;&#22120;&#8221;&#26159;&#36890;&#36807;&#23558;&#26469;&#33258;&#20004;&#20010;&#23494;&#24230;&#30340;&#25968;&#25454;&#19982;&#20854;&#20182;&#28508;&#22312;&#21464;&#37327;&#30456;&#32467;&#21512;&#26500;&#24314;&#30340;&#65292;&#24182;&#19988;&#26500;&#36896;&#30340;&#20855;&#20307;&#32454;&#33410;&#21487;&#20197;&#28789;&#27963;&#22320;&#22609;&#36896;&#23548;&#33268;&#30340;&#26102;&#38388;&#20381;&#36182;&#23494;&#24230;&#12290;&#28982;&#21518;&#25105;&#20204;&#23637;&#31034;&#20102;&#38543;&#26426;&#25554;&#20540;&#22120;&#30340;&#26102;&#38388;&#20381;&#36182;&#23494;&#24230;&#28385;&#36275;&#19968;&#38454;&#36755;&#36816;&#26041;&#31243;&#20197;&#21450;&#19968;&#31995;&#21015;&#20855;&#26377;&#21487;&#35843;&#25193;&#25955;&#30340;&#27491;&#21521;&#21644;&#21453;&#21521;Fokker-Planck&#26041;&#31243;&#26063;; &#22312;&#32771;&#34385;&#21333;&#20010;&#26679;&#26412;&#30340;&#26102;&#38388;&#28436;&#21270;&#26102;&#65292;&#36825;&#20010;&#35266;&#28857;&#31435;&#21363;&#23548;&#33268;&#20102;&#22522;&#20110;&#27010;&#29575;&#24494;&#20998;&#26041;&#31243;&#30340;&#30830;&#23450;&#24615;&#21644;&#38543;&#26426;&#29983;&#25104;&#27169;&#22411;&#12290;
&lt;/p&gt;
&lt;p&gt;
We introduce a class of generative models based on the stochastic interpolant framework proposed in Albergo &amp; Vanden-Eijnden (2023) that unifies flow-based and diffusion-based methods. We first show how to construct a broad class of continuous-time stochastic processes whose time-dependent probability density function bridges two arbitrary densities exactly in finite time. These `stochastic interpolants' are built by combining data from the two densities with an additional latent variable, and the specific details of the construction can be leveraged to shape the resulting time-dependent density in a flexible way. We then show that the time-dependent density of the stochastic interpolant satisfies a first-order transport equation as well as a family of forward and backward Fokker-Planck equations with tunable diffusion; upon consideration of the time evolution of an individual sample, this viewpoint immediately leads to both deterministic and stochastic generative models based on proba
&lt;/p&gt;</description></item></channel></rss>