<rss version="2.0"><channel><title>Chat Arxiv cs.LG</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.LG</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#27169;&#22411;&#65292;&#25429;&#25417;&#20869;&#23481;&#23457;&#26680;&#20013;&#20154;&#24037;&#26234;&#33021;&#30340;&#30456;&#20114;&#20316;&#29992;&#12290;</title><link>https://arxiv.org/abs/2402.12237</link><description>&lt;p&gt;
&#23398;&#20064;&#22312;&#20869;&#23481;&#23457;&#26680;&#20013;&#25512;&#36831;&#65306;&#20154;&#24037;&#26234;&#33021;&#19982;&#20154;&#31867;&#21327;&#21516;&#20316;&#29992;
&lt;/p&gt;
&lt;p&gt;
Learning to Defer in Content Moderation: The Human-AI Interplay
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.12237
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#27169;&#22411;&#65292;&#25429;&#25417;&#20869;&#23481;&#23457;&#26680;&#20013;&#20154;&#24037;&#26234;&#33021;&#30340;&#30456;&#20114;&#20316;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25104;&#21151;&#30340;&#22312;&#32447;&#24179;&#21488;&#20869;&#23481;&#23457;&#26680;&#20381;&#36182;&#20110;&#20154;&#24037;&#26234;&#33021;&#21327;&#21516;&#26041;&#27861;&#12290;&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#20010;&#27169;&#22411;&#65292;&#25429;&#25417;&#20869;&#23481;&#23457;&#26680;&#20013;&#20154;&#24037;&#26234;&#33021;&#30340;&#30456;&#20114;&#20316;&#29992;&#12290;&#31639;&#27861;&#35266;&#23519;&#21040;&#21363;&#23558;&#21457;&#24067;&#30340;&#24086;&#23376;&#30340;&#32972;&#26223;&#20449;&#24687;&#65292;&#20570;&#20986;&#20998;&#31867;&#21644;&#20934;&#20837;&#20915;&#31574;&#65292;&#24182;&#23433;&#25490;&#24086;&#23376;&#36827;&#34892;&#20154;&#24037;&#23457;&#26680;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.12237v1 Announce Type: cross  Abstract: Successful content moderation in online platforms relies on a human-AI collaboration approach. A typical heuristic estimates the expected harmfulness of a post and uses fixed thresholds to decide whether to remove it and whether to send it for human review. This disregards the prediction uncertainty, the time-varying element of human review capacity and post arrivals, and the selective sampling in the dataset (humans only review posts filtered by the admission algorithm).   In this paper, we introduce a model to capture the human-AI interplay in content moderation. The algorithm observes contextual information for incoming posts, makes classification and admission decisions, and schedules posts for human review. Only admitted posts receive human reviews on their harmfulness. These reviews help educate the machine-learning algorithms but are delayed due to congestion in the human review system. The classical learning-theoretic way to ca
&lt;/p&gt;</description></item><item><title>&#36825;&#39033;&#24037;&#20316;&#25552;&#20986;&#20102;&#19968;&#31181;&#24378;&#21046;&#31070;&#32463;&#25512;&#29702;&#22120;&#32500;&#25252;&#25191;&#34892;&#36712;&#36857;&#20316;&#20026;&#26377;&#38480;&#39044;&#23450;&#20041;&#29366;&#24577;&#32452;&#21512;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#23545;&#31639;&#27861;&#29366;&#24577;&#36716;&#25442;&#30340;&#30417;&#30563;&#35757;&#32451;&#65292;&#20351;&#27169;&#22411;&#33021;&#22815;&#19982;&#21407;&#22987;&#31639;&#27861;&#23436;&#32654;&#23545;&#40784;&#65292;&#24182;&#22312;&#22522;&#20934;&#27979;&#35797;&#20013;&#21462;&#24471;&#20102;&#23436;&#32654;&#30340;&#27979;&#35797;&#25104;&#32489;&#12290;</title><link>https://arxiv.org/abs/2402.11628</link><description>&lt;p&gt;
&#31163;&#25955;&#31070;&#32463;&#31639;&#27861;&#25512;&#29702;
&lt;/p&gt;
&lt;p&gt;
Discrete Neural Algorithmic Reasoning
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.11628
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#24037;&#20316;&#25552;&#20986;&#20102;&#19968;&#31181;&#24378;&#21046;&#31070;&#32463;&#25512;&#29702;&#22120;&#32500;&#25252;&#25191;&#34892;&#36712;&#36857;&#20316;&#20026;&#26377;&#38480;&#39044;&#23450;&#20041;&#29366;&#24577;&#32452;&#21512;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#23545;&#31639;&#27861;&#29366;&#24577;&#36716;&#25442;&#30340;&#30417;&#30563;&#35757;&#32451;&#65292;&#20351;&#27169;&#22411;&#33021;&#22815;&#19982;&#21407;&#22987;&#31639;&#27861;&#23436;&#32654;&#23545;&#40784;&#65292;&#24182;&#22312;&#22522;&#20934;&#27979;&#35797;&#20013;&#21462;&#24471;&#20102;&#23436;&#32654;&#30340;&#27979;&#35797;&#25104;&#32489;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#31070;&#32463;&#31639;&#27861;&#25512;&#29702;&#26088;&#22312;&#36890;&#36807;&#23398;&#20064;&#27169;&#20223;&#32463;&#20856;&#31639;&#27861;&#30340;&#25191;&#34892;&#26469;&#25429;&#25417;&#31070;&#32463;&#32593;&#32476;&#20013;&#30340;&#35745;&#31639;&#12290;&#23613;&#31649;&#24120;&#35265;&#30340;&#26550;&#26500;&#36275;&#22815;&#34920;&#36798;&#27491;&#30830;&#30340;&#27169;&#22411;&#22312;&#26435;&#37325;&#31354;&#38388;&#20013;&#65292;&#20294;&#24403;&#21069;&#30340;&#31070;&#32463;&#25512;&#29702;&#22120;&#22312;&#22788;&#29702;&#36229;&#20986;&#20998;&#24067;&#25968;&#25454;&#26102;&#38754;&#20020;&#27867;&#21270;&#22256;&#38590;&#12290;&#21478;&#19968;&#26041;&#38754;&#65292;&#32463;&#20856;&#35745;&#31639;&#19981;&#21463;&#20998;&#24067;&#21464;&#21270;&#30340;&#24433;&#21709;&#65292;&#22240;&#20026;&#23427;&#20204;&#21487;&#20197;&#25551;&#36848;&#20026;&#31163;&#25955;&#35745;&#31639;&#29366;&#24577;&#20043;&#38388;&#30340;&#36716;&#25442;&#12290;&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#24378;&#21046;&#31070;&#32463;&#25512;&#29702;&#22120;&#23558;&#25191;&#34892;&#36712;&#36857;&#20316;&#20026;&#26377;&#38480;&#39044;&#23450;&#20041;&#29366;&#24577;&#30340;&#32452;&#21512;&#36827;&#34892;&#32500;&#25252;&#12290;&#36890;&#36807;&#23545;&#31639;&#27861;&#29366;&#24577;&#36716;&#25442;&#30340;&#30417;&#30563;&#35757;&#32451;&#65292;&#36825;&#31181;&#27169;&#22411;&#33021;&#22815;&#19982;&#21407;&#22987;&#31639;&#27861;&#23436;&#32654;&#23545;&#40784;&#12290;&#20026;&#20102;&#35777;&#26126;&#36825;&#19968;&#28857;&#65292;&#25105;&#20204;&#22312;SALSA-CLRS&#22522;&#20934;&#27979;&#35797;&#19978;&#35780;&#20272;&#25105;&#20204;&#30340;&#26041;&#27861;&#65292;&#22312;&#37027;&#37324;&#25105;&#20204;&#20026;&#25152;&#26377;&#20219;&#21153;&#33719;&#24471;&#20102;&#23436;&#32654;&#30340;&#27979;&#35797;&#25104;&#32489;&#12290;&#27492;&#22806;&#65292;&#25152;&#25552;&#20986;&#30340;&#26550;&#26500;&#36873;&#25321;&#20351;&#25105;&#20204;&#33021;&#22815;&#35777;&#26126;...
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.11628v1 Announce Type: new  Abstract: Neural algorithmic reasoning aims to capture computations with neural networks via learning the models to imitate the execution of classical algorithms. While common architectures are expressive enough to contain the correct model in the weights space, current neural reasoners are struggling to generalize well on out-of-distribution data. On the other hand, classical computations are not affected by distribution shifts as they can be described as transitions between discrete computational states. In this work, we propose to force neural reasoners to maintain the execution trajectory as a combination of finite predefined states. Trained with supervision on the algorithm's state transitions, such models are able to perfectly align with the original algorithm. To show this, we evaluate our approach on the SALSA-CLRS benchmark, where we get perfect test scores for all tasks. Moreover, the proposed architectural choice allows us to prove the 
&lt;/p&gt;</description></item><item><title>&#36825;&#39033;&#30740;&#31350;&#20351;&#29992;&#24182;&#34892;&#28151;&#21512;&#31070;&#32463;&#32593;&#32476;&#32467;&#26500;&#26469;&#39044;&#27979;&#21457;&#30005;&#21378;&#20013;&#30340;&#33976;&#27773;&#36136;&#37327;&#27969;&#37327;&#65292;&#30456;&#27604;&#32431;&#32463;&#20856;&#21644;&#32431;&#37327;&#23376;&#27169;&#22411;&#65292;&#35813;&#28151;&#21512;&#27169;&#22411;&#22312;&#27979;&#35797;&#38598;&#19978;&#21462;&#24471;&#20102;&#26356;&#22909;&#30340;&#24615;&#33021;&#65292;&#24179;&#22343;&#24179;&#26041;&#35823;&#24046;&#38477;&#20302;&#20102;5.7&#20493;&#21644;4.9&#20493;&#65292;&#24182;&#19988;&#30456;&#23545;&#35823;&#24046;&#36739;&#23567;&#65292;&#26368;&#22810;&#25552;&#21319;&#20102;2&#20493;&#12290;</title><link>http://arxiv.org/abs/2307.09483</link><description>&lt;p&gt;
&#20351;&#29992;&#24182;&#34892;&#28151;&#21512;&#32593;&#32476;&#39044;&#27979;&#21457;&#30005;&#21378;&#20013;&#30340;&#33976;&#27773;&#36136;&#37327;&#27969;&#37327;
&lt;/p&gt;
&lt;p&gt;
Forecasting the steam mass flow in a powerplant using the parallel hybrid network. (arXiv:2307.09483v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.09483
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#30740;&#31350;&#20351;&#29992;&#24182;&#34892;&#28151;&#21512;&#31070;&#32463;&#32593;&#32476;&#32467;&#26500;&#26469;&#39044;&#27979;&#21457;&#30005;&#21378;&#20013;&#30340;&#33976;&#27773;&#36136;&#37327;&#27969;&#37327;&#65292;&#30456;&#27604;&#32431;&#32463;&#20856;&#21644;&#32431;&#37327;&#23376;&#27169;&#22411;&#65292;&#35813;&#28151;&#21512;&#27169;&#22411;&#22312;&#27979;&#35797;&#38598;&#19978;&#21462;&#24471;&#20102;&#26356;&#22909;&#30340;&#24615;&#33021;&#65292;&#24179;&#22343;&#24179;&#26041;&#35823;&#24046;&#38477;&#20302;&#20102;5.7&#20493;&#21644;4.9&#20493;&#65292;&#24182;&#19988;&#30456;&#23545;&#35823;&#24046;&#36739;&#23567;&#65292;&#26368;&#22810;&#25552;&#21319;&#20102;2&#20493;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#39640;&#25928;&#21487;&#25345;&#32493;&#30340;&#21457;&#30005;&#26159;&#33021;&#28304;&#39046;&#22495;&#30340;&#19968;&#20010;&#20851;&#38190;&#38382;&#39064;&#12290;&#23588;&#20854;&#26159;&#28909;&#30005;&#21378;&#22312;&#20934;&#30830;&#39044;&#27979;&#33976;&#27773;&#36136;&#37327;&#27969;&#37327;&#26041;&#38754;&#38754;&#20020;&#22256;&#38590;&#65292;&#36825;&#23545;&#20110;&#36816;&#33829;&#25928;&#29575;&#21644;&#25104;&#26412;&#38477;&#20302;&#33267;&#20851;&#37325;&#35201;&#12290;&#22312;&#26412;&#30740;&#31350;&#20013;&#65292;&#25105;&#20204;&#20351;&#29992;&#19968;&#20010;&#24182;&#34892;&#28151;&#21512;&#31070;&#32463;&#32593;&#32476;&#32467;&#26500;&#65292;&#35813;&#32467;&#26500;&#23558;&#21442;&#25968;&#21270;&#37327;&#23376;&#30005;&#36335;&#21644;&#20256;&#32479;&#30340;&#21069;&#39304;&#31070;&#32463;&#32593;&#32476;&#30456;&#32467;&#21512;&#65292;&#29305;&#21035;&#35774;&#35745;&#29992;&#20110;&#24037;&#19994;&#29615;&#22659;&#20013;&#30340;&#26102;&#38388;&#24207;&#21015;&#39044;&#27979;&#65292;&#20197;&#25552;&#39640;&#23545;&#26410;&#26469;15&#20998;&#38047;&#20869;&#33976;&#27773;&#36136;&#37327;&#27969;&#37327;&#30340;&#39044;&#27979;&#33021;&#21147;&#12290;&#25105;&#20204;&#30340;&#32467;&#26524;&#34920;&#26126;&#65292;&#24182;&#34892;&#28151;&#21512;&#27169;&#22411;&#20248;&#20110;&#29420;&#31435;&#30340;&#32463;&#20856;&#21644;&#37327;&#23376;&#27169;&#22411;&#65292;&#22312;&#35757;&#32451;&#21518;&#30340;&#27979;&#35797;&#38598;&#19978;&#30456;&#23545;&#20110;&#32431;&#32463;&#20856;&#27169;&#22411;&#21644;&#32431;&#37327;&#23376;&#32593;&#32476;&#65292;&#24179;&#22343;&#24179;&#26041;&#35823;&#24046;&#65288;MSE&#65289;&#25439;&#22833;&#20998;&#21035;&#38477;&#20302;&#20102;5.7&#20493;&#21644;4.9&#20493;&#12290;&#27492;&#22806;&#65292;&#35813;&#28151;&#21512;&#27169;&#22411;&#22312;&#27979;&#35797;&#38598;&#19978;&#34920;&#29616;&#20986;&#30456;&#23545;&#35823;&#24046;&#36739;&#23567;&#65292;&#27604;&#32431;&#32463;&#20856;&#27169;&#22411;&#26356;&#22909;&#65292;&#26368;&#22810;&#25552;&#21319;&#20102;2&#20493;&#12290;
&lt;/p&gt;
&lt;p&gt;
Efficient and sustainable power generation is a crucial concern in the energy sector. In particular, thermal power plants grapple with accurately predicting steam mass flow, which is crucial for operational efficiency and cost reduction. In this study, we use a parallel hybrid neural network architecture that combines a parametrized quantum circuit and a conventional feed-forward neural network specifically designed for time-series prediction in industrial settings to enhance predictions of steam mass flow 15 minutes into the future. Our results show that the parallel hybrid model outperforms standalone classical and quantum models, achieving more than 5.7 and 4.9 times lower mean squared error (MSE) loss on the test set after training compared to pure classical and pure quantum networks, respectively. Furthermore, the hybrid model demonstrates smaller relative errors between the ground truth and the model predictions on the test set, up to 2 times better than the pure classical model.
&lt;/p&gt;</description></item></channel></rss>