<rss version="2.0"><channel><title>Chat Arxiv cs.LG</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for cs.LG</description><item><title>&#25552;&#20986;&#20102;&#31070;&#32463;&#24494;&#20998;&#20195;&#25968;&#26041;&#31243;&#65288;NDAEs&#65289;&#29992;&#20110;&#25968;&#25454;&#39537;&#21160;&#30340;&#24314;&#27169;&#65292;&#23637;&#31034;&#20102;&#20854;&#22312;&#31995;&#32479;&#29702;&#35770;&#25968;&#25454;&#39537;&#21160;&#24314;&#27169;&#20219;&#21153;&#20013;&#30340;&#36866;&#29992;&#24615;&#65292;&#24182;&#36890;&#36807;&#20855;&#20307;&#31034;&#20363;&#34920;&#26126;&#20102;&#20854;&#22312;&#22122;&#22768;&#21644;&#22806;&#37096;&#24178;&#25200;&#19979;&#30340;&#40065;&#26834;&#24615;&#12290;</title><link>https://arxiv.org/abs/2403.12938</link><description>&lt;p&gt;
&#31070;&#32463;&#24494;&#20998;&#20195;&#25968;&#26041;&#31243;
&lt;/p&gt;
&lt;p&gt;
Neural Differential Algebraic Equations
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.12938
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#31070;&#32463;&#24494;&#20998;&#20195;&#25968;&#26041;&#31243;&#65288;NDAEs&#65289;&#29992;&#20110;&#25968;&#25454;&#39537;&#21160;&#30340;&#24314;&#27169;&#65292;&#23637;&#31034;&#20102;&#20854;&#22312;&#31995;&#32479;&#29702;&#35770;&#25968;&#25454;&#39537;&#21160;&#24314;&#27169;&#20219;&#21153;&#20013;&#30340;&#36866;&#29992;&#24615;&#65292;&#24182;&#36890;&#36807;&#20855;&#20307;&#31034;&#20363;&#34920;&#26126;&#20102;&#20854;&#22312;&#22122;&#22768;&#21644;&#22806;&#37096;&#24178;&#25200;&#19979;&#30340;&#40065;&#26834;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24494;&#20998;&#20195;&#25968;&#26041;&#31243;&#65288;DAEs&#65289;&#25551;&#36848;&#20102;&#31526;&#21512;&#24494;&#20998;&#21644;&#20195;&#25968;&#32422;&#26463;&#30340;&#31995;&#32479;&#30340;&#26102;&#38388;&#28436;&#21270;&#12290;&#29305;&#21035;&#24863;&#20852;&#36259;&#30340;&#26159;&#21253;&#21547;&#20854;&#32452;&#20214;&#20043;&#38388;&#38544;&#24615;&#20851;&#31995;&#65288;&#22914;&#23432;&#24658;&#20851;&#31995;&#65289;&#30340;&#31995;&#32479;&#12290;&#22312;&#36825;&#37324;&#65292;&#25105;&#20204;&#25552;&#20986;&#36866;&#29992;&#20110;&#22522;&#20110;&#25968;&#25454;&#30340;DAE&#24314;&#27169;&#30340;&#31070;&#32463;&#24494;&#20998;&#20195;&#25968;&#26041;&#31243;&#65288;NDAEs&#65289;&#12290;&#36825;&#19968;&#26041;&#27861;&#24314;&#31435;&#22312;&#36890;&#29992;&#24494;&#20998;&#26041;&#31243;&#30340;&#27010;&#24565;&#20043;&#19978;&#65307;&#21363;&#65292;&#26500;&#24314;&#20026;&#21463;&#29305;&#23450;&#31185;&#23398;&#39046;&#22495;&#29702;&#35770;&#25903;&#25345;&#30340;&#19968;&#32452;&#31070;&#32463;&#24120;&#24494;&#20998;&#26041;&#31243;&#30340;&#27169;&#22411;&#12290;&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#25152;&#25552;&#20986;&#30340;NDAEs&#25277;&#35937;&#36866;&#29992;&#20110;&#30456;&#20851;&#31995;&#32479;&#29702;&#35770;&#25968;&#25454;&#39537;&#21160;&#30340;&#24314;&#27169;&#20219;&#21153;&#12290;&#25152;&#31034;&#31034;&#20363;&#21253;&#25324;&#65288;i&#65289;&#27833;&#31665;&#27969;&#24418;&#21160;&#24577;&#30340;&#36870;&#38382;&#39064;&#21644;&#65288;ii&#65289;&#27893;&#12289;&#27833;&#31665;&#21644;&#31649;&#36947;&#32593;&#32476;&#30340;&#24046;&#24322;&#24314;&#27169;&#12290;&#25105;&#20204;&#30340;&#23454;&#39564;&#34920;&#26126;&#20102;&#25152;&#25552;&#26041;&#27861;&#23545;&#22122;&#22768;&#21644;&#22806;&#37096;&#24178;&#25200;&#30340;&#31283;&#20581;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.12938v1 Announce Type: new  Abstract: Differential-Algebraic Equations (DAEs) describe the temporal evolution of systems that obey both differential and algebraic constraints. Of particular interest are systems that contain implicit relationships between their components, such as conservation relationships. Here, we present Neural Differential-Algebraic Equations (NDAEs) suitable for data-driven modeling of DAEs. This methodology is built upon the concept of the Universal Differential Equation; that is, a model constructed as a system of Neural Ordinary Differential Equations informed by theory from particular science domains. In this work, we show that the proposed NDAEs abstraction is suitable for relevant system-theoretic data-driven modeling tasks. Presented examples include (i) the inverse problem of tank-manifold dynamics and (ii) discrepancy modeling of a network of pumps, tanks, and pipes. Our experiments demonstrate the proposed method's robustness to noise and extr
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#37327;&#21270;&#21644;&#20943;&#36731;&#34920;&#26684;&#29983;&#25104;&#27169;&#22411;&#30340;&#38544;&#31169;&#39118;&#38505;&#65292;&#36890;&#36807;&#23545;&#20116;&#31181;&#26368;&#20808;&#36827;&#30340;&#34920;&#26684;&#21512;&#25104;&#22120;&#36827;&#34892;&#23454;&#35777;&#20998;&#26512;&#65292;&#25552;&#20986;&#20102;&#24046;&#20998;&#38544;&#31169;&#34920;&#26684;&#28508;&#22312;&#25193;&#25955;&#27169;&#22411;&#12290;</title><link>https://arxiv.org/abs/2403.07842</link><description>&lt;p&gt;
&#37327;&#21270;&#21644;&#20943;&#36731;&#34920;&#26684;&#29983;&#25104;&#27169;&#22411;&#30340;&#38544;&#31169;&#39118;&#38505;
&lt;/p&gt;
&lt;p&gt;
Quantifying and Mitigating Privacy Risks for Tabular Generative Models
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.07842
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#37327;&#21270;&#21644;&#20943;&#36731;&#34920;&#26684;&#29983;&#25104;&#27169;&#22411;&#30340;&#38544;&#31169;&#39118;&#38505;&#65292;&#36890;&#36807;&#23545;&#20116;&#31181;&#26368;&#20808;&#36827;&#30340;&#34920;&#26684;&#21512;&#25104;&#22120;&#36827;&#34892;&#23454;&#35777;&#20998;&#26512;&#65292;&#25552;&#20986;&#20102;&#24046;&#20998;&#38544;&#31169;&#34920;&#26684;&#28508;&#22312;&#25193;&#25955;&#27169;&#22411;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38024;&#23545;&#21512;&#25104;&#25968;&#25454;&#29983;&#25104;&#27169;&#22411;&#20986;&#29616;&#20316;&#20026;&#20445;&#25252;&#38544;&#31169;&#30340;&#25968;&#25454;&#20849;&#20139;&#35299;&#20915;&#26041;&#26696;&#30340;&#24773;&#20917;&#65292;&#35813;&#21512;&#25104;&#25968;&#25454;&#38598;&#24212;&#35813;&#31867;&#20284;&#20110;&#21407;&#22987;&#25968;&#25454;&#65292;&#32780;&#19981;&#20250;&#36879;&#38706;&#21487;&#35782;&#21035;&#30340;&#31169;&#20154;&#20449;&#24687;&#12290;&#34920;&#26684;&#21512;&#25104;&#22120;&#30340;&#26680;&#24515;&#25216;&#26415;&#26681;&#26893;&#20110;&#22270;&#20687;&#29983;&#25104;&#27169;&#22411;&#65292;&#33539;&#22260;&#20174;&#29983;&#25104;&#23545;&#25239;&#32593;&#32476;&#65288;GAN&#65289;&#21040;&#26368;&#36817;&#30340;&#25193;&#25955;&#27169;&#22411;&#12290;&#26368;&#36817;&#30340;&#20808;&#21069;&#24037;&#20316;&#25581;&#31034;&#21644;&#37327;&#21270;&#20102;&#34920;&#26684;&#25968;&#25454;&#19978;&#30340;&#25928;&#29992;-&#38544;&#31169;&#26435;&#34913;&#65292;&#25581;&#31034;&#20102;&#21512;&#25104;&#25968;&#25454;&#30340;&#38544;&#31169;&#39118;&#38505;&#12290;&#25105;&#20204;&#39318;&#20808;&#36827;&#34892;&#20102;&#35814;&#23613;&#30340;&#23454;&#35777;&#20998;&#26512;&#65292;&#31361;&#20986;&#20102;&#20116;&#31181;&#26368;&#20808;&#36827;&#30340;&#34920;&#26684;&#21512;&#25104;&#22120;&#38024;&#23545;&#20843;&#31181;&#38544;&#31169;&#25915;&#20987;&#30340;&#25928;&#29992;-&#38544;&#31169;&#26435;&#34913;&#65292;&#29305;&#21035;&#20851;&#27880;&#25104;&#21592;&#25512;&#26029;&#25915;&#20987;&#12290;&#22312;&#35266;&#23519;&#21040;&#34920;&#26684;&#25193;&#25955;&#20013;&#39640;&#25968;&#25454;&#36136;&#37327;&#20294;&#20063;&#39640;&#38544;&#31169;&#39118;&#38505;&#30340;&#24773;&#20917;&#19979;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;DP-TLDM&#65292;&#24046;&#20998;&#38544;&#31169;&#34920;&#26684;&#28508;&#22312;&#25193;&#25955;&#27169;&#22411;&#65292;&#30001;&#33258;&#21160;&#32534;&#30721;&#22120;&#32593;&#32476;&#32452;&#25104;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.07842v1 Announce Type: new  Abstract: Synthetic data from generative models emerges as the privacy-preserving data-sharing solution. Such a synthetic data set shall resemble the original data without revealing identifiable private information. The backbone technology of tabular synthesizers is rooted in image generative models, ranging from Generative Adversarial Networks (GANs) to recent diffusion models. Recent prior work sheds light on the utility-privacy tradeoff on tabular data, revealing and quantifying privacy risks on synthetic data. We first conduct an exhaustive empirical analysis, highlighting the utility-privacy tradeoff of five state-of-the-art tabular synthesizers, against eight privacy attacks, with a special focus on membership inference attacks. Motivated by the observation of high data quality but also high privacy risk in tabular diffusion, we propose DP-TLDM, Differentially Private Tabular Latent Diffusion Model, which is composed of an autoencoder networ
&lt;/p&gt;</description></item><item><title>&#30740;&#31350;&#23545;&#30693;&#35782;&#33976;&#39311;&#22312;&#39044;&#35757;&#32451;&#27169;&#22411;&#20013;&#30340;&#24212;&#29992;&#36827;&#34892;&#20102;&#28145;&#20837;&#27604;&#36739;&#65292;&#21253;&#25324;&#20248;&#21270;&#30340;&#28201;&#24230;&#21644;&#26435;&#37325;&#21442;&#25968;&#30340;&#35843;&#25972;&#65292;&#20197;&#21450;&#25968;&#25454;&#20998;&#21306;KD&#65292;&#25581;&#31034;&#20102;&#26368;&#26377;&#25928;&#30340;&#30693;&#35782;&#33976;&#39311;&#31574;&#30053;&#12290;</title><link>https://arxiv.org/abs/2402.14922</link><description>&lt;p&gt;
&#38024;&#23545;&#39044;&#35757;&#32451;&#27169;&#22411;&#30340;&#30693;&#35782;&#33976;&#39311;&#30340;&#23454;&#36341;&#35265;&#35299;
&lt;/p&gt;
&lt;p&gt;
Practical Insights into Knowledge Distillation for Pre-Trained Models
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.14922
&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#23545;&#30693;&#35782;&#33976;&#39311;&#22312;&#39044;&#35757;&#32451;&#27169;&#22411;&#20013;&#30340;&#24212;&#29992;&#36827;&#34892;&#20102;&#28145;&#20837;&#27604;&#36739;&#65292;&#21253;&#25324;&#20248;&#21270;&#30340;&#28201;&#24230;&#21644;&#26435;&#37325;&#21442;&#25968;&#30340;&#35843;&#25972;&#65292;&#20197;&#21450;&#25968;&#25454;&#20998;&#21306;KD&#65292;&#25581;&#31034;&#20102;&#26368;&#26377;&#25928;&#30340;&#30693;&#35782;&#33976;&#39311;&#31574;&#30053;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#30740;&#31350;&#25506;&#35752;&#20102;&#22312;&#39044;&#35757;&#32451;&#27169;&#22411;&#20013;&#23545;&#30693;&#35782;&#33976;&#39311;&#65288;KD&#65289;&#36807;&#31243;&#30340;&#22686;&#24378;&#65292;&#36825;&#26159;&#30693;&#35782;&#20256;&#36755;&#20013;&#19968;&#20010;&#26032;&#20852;&#39046;&#22495;&#65292;&#24182;&#23545;&#20998;&#24067;&#24335;&#35757;&#32451;&#21644;&#32852;&#37030;&#23398;&#20064;&#29615;&#22659;&#20135;&#29983;&#37325;&#35201;&#24433;&#21709;&#12290;&#23613;&#31649;&#37319;&#29992;&#20102;&#35768;&#22810;&#30693;&#35782;&#33976;&#39311;&#26041;&#27861;&#26469;&#22312;&#39044;&#35757;&#32451;&#27169;&#22411;&#20043;&#38388;&#20256;&#36882;&#30693;&#35782;&#65292;&#20294;&#22312;&#36825;&#20123;&#22330;&#26223;&#20013;&#20102;&#35299;&#30693;&#35782;&#33976;&#39311;&#30340;&#24212;&#29992;&#20173;&#28982;&#32570;&#20047;&#20840;&#38754;&#30340;&#29702;&#35299;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#23545;&#22810;&#31181;&#30693;&#35782;&#33976;&#39311;&#25216;&#26415;&#36827;&#34892;&#20102;&#24191;&#27867;&#27604;&#36739;&#65292;&#21253;&#25324;&#26631;&#20934;KD&#12289;&#32463;&#36807;&#20248;&#21270;&#28201;&#24230;&#21644;&#26435;&#37325;&#21442;&#25968;&#35843;&#25972;&#30340;KD&#12289;&#28145;&#24230;&#30456;&#20114;&#23398;&#20064;&#20197;&#21450;&#25968;&#25454;&#20998;&#21306;KD&#12290;&#25105;&#20204;&#35780;&#20272;&#36825;&#20123;&#26041;&#27861;&#22312;&#19981;&#21516;&#25968;&#25454;&#20998;&#24067;&#31574;&#30053;&#19979;&#30340;&#34920;&#29616;&#65292;&#20197;&#30830;&#23450;&#27599;&#31181;&#26041;&#27861;&#26368;&#26377;&#25928;&#30340;&#24773;&#22659;&#12290;&#36890;&#36807;&#35814;&#32454;&#30740;&#31350;&#36229;&#21442;&#25968;&#35843;&#25972;&#65292;&#32467;&#21512;&#24191;&#27867;&#30340;&#32593;&#26684;&#25628;&#32034;&#35780;&#20272;&#26469;&#33719;&#21462;&#20449;&#24687;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.14922v1 Announce Type: cross  Abstract: This research investigates the enhancement of knowledge distillation (KD) processes in pre-trained models, an emerging field in knowledge transfer with significant implications for distributed training and federated learning environments. These environments benefit from reduced communication demands and accommodate various model architectures. Despite the adoption of numerous KD approaches for transferring knowledge among pre-trained models, a comprehensive understanding of KD's application in these scenarios is lacking. Our study conducts an extensive comparison of multiple KD techniques, including standard KD, tuned KD (via optimized temperature and weight parameters), deep mutual learning, and data partitioning KD. We assess these methods across various data distribution strategies to identify the most effective contexts for each. Through detailed examination of hyperparameter tuning, informed by extensive grid search evaluations, w
&lt;/p&gt;</description></item><item><title>&#38543;&#26426;&#26862;&#26519;&#30456;&#23545;&#20110;&#35013;&#34955;&#27861;&#20855;&#26377;&#20943;&#23569;&#20559;&#24046;&#30340;&#33021;&#21147;&#65292;&#22312;&#25581;&#31034;&#25968;&#25454;&#27169;&#24335;&#21644;&#39640;&#20449;&#22122;&#27604;&#24773;&#20917;&#19979;&#34920;&#29616;&#26356;&#22909;&#30340;&#29305;&#28857;&#65292;&#20026;&#38543;&#26426;&#26862;&#26519;&#22312;&#19981;&#21516;&#20449;&#22122;&#27604;&#29615;&#22659;&#19979;&#30340;&#25104;&#21151;&#25552;&#20379;&#20102;&#35299;&#37322;&#21644;&#23454;&#29992;&#35265;&#35299;&#12290;</title><link>https://arxiv.org/abs/2402.12668</link><description>&lt;p&gt;
&#38543;&#26426;&#21270;&#26082;&#21487;&#20197;&#20943;&#23569;&#20559;&#24046;&#21448;&#21487;&#20197;&#20943;&#23569;&#26041;&#24046;&#65306;&#38543;&#26426;&#26862;&#26519;&#30340;&#26696;&#20363;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Randomization Can Reduce Both Bias and Variance: A Case Study in Random Forests
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.12668
&lt;/p&gt;
&lt;p&gt;
&#38543;&#26426;&#26862;&#26519;&#30456;&#23545;&#20110;&#35013;&#34955;&#27861;&#20855;&#26377;&#20943;&#23569;&#20559;&#24046;&#30340;&#33021;&#21147;&#65292;&#22312;&#25581;&#31034;&#25968;&#25454;&#27169;&#24335;&#21644;&#39640;&#20449;&#22122;&#27604;&#24773;&#20917;&#19979;&#34920;&#29616;&#26356;&#22909;&#30340;&#29305;&#28857;&#65292;&#20026;&#38543;&#26426;&#26862;&#26519;&#22312;&#19981;&#21516;&#20449;&#22122;&#27604;&#29615;&#22659;&#19979;&#30340;&#25104;&#21151;&#25552;&#20379;&#20102;&#35299;&#37322;&#21644;&#23454;&#29992;&#35265;&#35299;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#24448;&#24448;&#34987;&#24573;&#35270;&#30340;&#29616;&#35937;&#65292;&#39318;&#27425;&#22312;\cite{breiman2001random}&#20013;&#25351;&#20986;&#65292;&#21363;&#38543;&#26426;&#26862;&#26519;&#20284;&#20046;&#27604;&#35013;&#34955;&#27861;&#20943;&#23569;&#20102;&#20559;&#24046;&#12290;&#21463;\cite{mentch2020randomization}&#19968;&#31687;&#26377;&#36259;&#30340;&#35770;&#25991;&#30340;&#21551;&#21457;&#65292;&#20854;&#20013;&#20316;&#32773;&#35748;&#20026;&#38543;&#26426;&#26862;&#26519;&#20943;&#23569;&#20102;&#26377;&#25928;&#33258;&#30001;&#24230;&#65292;&#24182;&#19988;&#21482;&#26377;&#22312;&#20302;&#20449;&#22122;&#27604;&#65288;SNR&#65289;&#29615;&#22659;&#19979;&#25165;&#33021;&#32988;&#36807;&#35013;&#34955;&#38598;&#25104;&#65292;&#25105;&#20204;&#25506;&#35752;&#20102;&#38543;&#26426;&#26862;&#26519;&#22914;&#20309;&#33021;&#22815;&#25581;&#31034;&#34987;&#35013;&#34955;&#27861;&#24573;&#35270;&#30340;&#25968;&#25454;&#27169;&#24335;&#12290;&#25105;&#20204;&#22312;&#23454;&#35777;&#20013;&#35777;&#26126;&#65292;&#22312;&#23384;&#22312;&#36825;&#31181;&#27169;&#24335;&#30340;&#24773;&#20917;&#19979;&#65292;&#38543;&#26426;&#26862;&#26519;&#19981;&#20165;&#21487;&#20197;&#20943;&#23567;&#20559;&#24046;&#36824;&#33021;&#20943;&#23567;&#26041;&#24046;&#65292;&#24182;&#19988;&#24403;&#20449;&#22122;&#27604;&#39640;&#26102;&#38543;&#26426;&#26862;&#26519;&#30340;&#34920;&#29616;&#24840;&#21457;&#22909;&#20110;&#35013;&#34955;&#38598;&#25104;&#12290;&#25105;&#20204;&#30340;&#35266;&#23519;&#20026;&#35299;&#37322;&#38543;&#26426;&#26862;&#26519;&#22312;&#21508;&#31181;&#20449;&#22122;&#27604;&#24773;&#20917;&#19979;&#30340;&#30495;&#23454;&#19990;&#30028;&#25104;&#21151;&#25552;&#20379;&#20102;&#35265;&#35299;&#65292;&#24182;&#22686;&#36827;&#20102;&#25105;&#20204;&#23545;&#38543;&#26426;&#26862;&#26519;&#19982;&#35013;&#34955;&#38598;&#25104;&#22312;&#27599;&#27425;&#20998;&#21106;&#27880;&#20837;&#30340;&#38543;&#26426;&#21270;&#26041;&#38754;&#30340;&#24046;&#24322;&#30340;&#29702;&#35299;&#12290;&#25105;&#20204;&#30340;&#35843;&#26597;&#32467;&#26524;&#36824;&#25552;&#20379;&#20102;&#23454;&#29992;&#35265;&#35299;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.12668v1 Announce Type: cross  Abstract: We study the often overlooked phenomenon, first noted in \cite{breiman2001random}, that random forests appear to reduce bias compared to bagging. Motivated by an interesting paper by \cite{mentch2020randomization}, where the authors argue that random forests reduce effective degrees of freedom and only outperform bagging ensembles in low signal-to-noise ratio (SNR) settings, we explore how random forests can uncover patterns in the data missed by bagging. We empirically demonstrate that in the presence of such patterns, random forests reduce bias along with variance and increasingly outperform bagging ensembles when SNR is high. Our observations offer insights into the real-world success of random forests across a range of SNRs and enhance our understanding of the difference between random forests and bagging ensembles with respect to the randomization injected into each split. Our investigations also yield practical insights into the 
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25506;&#35752;&#20102;&#31185;&#23398;&#39046;&#22495;&#20013;&#22522;&#20110;LLM&#30340;&#26234;&#33021;&#26426;&#22120;&#20154;&#30340;&#28431;&#27934;&#19982;&#39118;&#38505;&#65292;&#24182;&#24378;&#35843;&#20102;&#23545;&#23433;&#20840;&#25514;&#26045;&#30340;&#37325;&#35201;&#24615;&#12290;</title><link>https://arxiv.org/abs/2402.04247</link><description>&lt;p&gt;
&#20248;&#20808;&#23433;&#20840;&#20445;&#38556;&#32780;&#38750;&#33258;&#27835;&#65306;&#31185;&#23398;&#20013;LLM&#26234;&#33021;&#26426;&#22120;&#20154;&#30340;&#39118;&#38505;
&lt;/p&gt;
&lt;p&gt;
Prioritizing Safeguarding Over Autonomy: Risks of LLM Agents for Science
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.04247
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25506;&#35752;&#20102;&#31185;&#23398;&#39046;&#22495;&#20013;&#22522;&#20110;LLM&#30340;&#26234;&#33021;&#26426;&#22120;&#20154;&#30340;&#28431;&#27934;&#19982;&#39118;&#38505;&#65292;&#24182;&#24378;&#35843;&#20102;&#23545;&#23433;&#20840;&#25514;&#26045;&#30340;&#37325;&#35201;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#30001;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLMs&#65289;&#39537;&#21160;&#30340;&#26234;&#33021;&#26426;&#22120;&#20154;&#22312;&#21508;&#20010;&#23398;&#31185;&#20013;&#33258;&#20027;&#36827;&#34892;&#23454;&#39564;&#21644;&#20419;&#36827;&#31185;&#23398;&#21457;&#29616;&#26041;&#38754;&#23637;&#31034;&#20102;&#24040;&#22823;&#30340;&#21069;&#26223;&#12290;&#23613;&#31649;&#23427;&#20204;&#30340;&#33021;&#21147;&#38750;&#24120;&#26377;&#21069;&#36884;&#65292;&#20294;&#20063;&#24341;&#20837;&#20102;&#19968;&#20123;&#26032;&#30340;&#28431;&#27934;&#65292;&#38656;&#35201;&#20180;&#32454;&#32771;&#34385;&#23433;&#20840;&#24615;&#12290;&#28982;&#32780;&#65292;&#25991;&#29486;&#20013;&#23384;&#22312;&#26174;&#33879;&#30340;&#31354;&#30333;&#65292;&#23578;&#26410;&#23545;&#36825;&#20123;&#28431;&#27934;&#36827;&#34892;&#20840;&#38754;&#25506;&#35752;&#12290;&#26412;&#25991;&#36890;&#36807;&#23545;&#31185;&#23398;&#39046;&#22495;&#20013;&#22522;&#20110;LLM&#30340;&#26426;&#22120;&#20154;&#30340;&#28431;&#27934;&#36827;&#34892;&#28145;&#20837;&#30740;&#31350;&#65292;&#25581;&#31034;&#20102;&#23427;&#20204;&#35823;&#29992;&#21487;&#33021;&#24102;&#26469;&#30340;&#28508;&#22312;&#39118;&#38505;&#65292;&#24182;&#24378;&#35843;&#20102;&#23545;&#23433;&#20840;&#25514;&#26045;&#30340;&#38656;&#27714;&#65292;&#22635;&#34917;&#20102;&#36825;&#19968;&#31354;&#30333;&#12290;&#25105;&#20204;&#39318;&#20808;&#20840;&#38754;&#27010;&#36848;&#20102;&#31185;&#23398;LLM&#26426;&#22120;&#20154;&#22266;&#26377;&#30340;&#28508;&#22312;&#39118;&#38505;&#65292;&#32771;&#34385;&#20102;&#29992;&#25143;&#24847;&#22270;&#12289;&#29305;&#23450;&#30340;&#31185;&#23398;&#39046;&#22495;&#20197;&#21450;&#23427;&#20204;&#23545;&#22806;&#37096;&#29615;&#22659;&#21487;&#33021;&#36896;&#25104;&#30340;&#24433;&#21709;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#28145;&#20837;&#25506;&#35752;&#20102;&#36825;&#20123;&#28431;&#27934;&#30340;&#36215;&#28304;&#21644;&#25552;&#20379;&#30340;&#35299;&#20915;&#26041;&#26696;&#12290;
&lt;/p&gt;
&lt;p&gt;
Intelligent agents powered by large language models (LLMs) have demonstrated substantial promise in autonomously conducting experiments and facilitating scientific discoveries across various disciplines. While their capabilities are promising, they also introduce novel vulnerabilities that demand careful consideration for safety. However, there exists a notable gap in the literature, as there has been no comprehensive exploration of these vulnerabilities. This position paper fills this gap by conducting a thorough examination of vulnerabilities in LLM-based agents within scientific domains, shedding light on potential risks associated with their misuse and emphasizing the need for safety measures. We begin by providing a comprehensive overview of the potential risks inherent to scientific LLM agents, taking into account user intent, the specific scientific domain, and their potential impact on the external environment. Then, we delve into the origins of these vulnerabilities and provid
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;ROAM&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#21033;&#29992;&#20808;&#21069;&#23398;&#20064;&#21040;&#30340;&#34892;&#20026;&#26469;&#23454;&#26102;&#35843;&#33410;&#26426;&#22120;&#20154;&#22312;&#37096;&#32626;&#36807;&#31243;&#20013;&#24212;&#23545;&#26410;&#26366;&#35265;&#36807;&#30340;&#24773;&#20917;&#12290;&#22312;&#27979;&#35797;&#20013;&#65292;ROAM&#21487;&#20197;&#22312;&#21333;&#20010;&#38454;&#27573;&#20869;&#23454;&#29616;&#24555;&#36895;&#36866;&#24212;&#65292;&#24182;&#19988;&#22312;&#27169;&#25311;&#29615;&#22659;&#21644;&#30495;&#23454;&#22330;&#26223;&#20013;&#21462;&#24471;&#20102;&#25104;&#21151;&#65292;&#20855;&#26377;&#36739;&#39640;&#30340;&#25928;&#29575;&#21644;&#36866;&#24212;&#24615;&#12290;</title><link>http://arxiv.org/abs/2311.01059</link><description>&lt;p&gt;
&#22312;&#37096;&#32626;&#26102;&#36827;&#34892;&#23454;&#26102;&#35843;&#33410;&#65306;&#29992;&#20110;&#21333;&#26426;&#22120;&#20154;&#37096;&#32626;&#30340;&#34892;&#20026;&#35843;&#25511;
&lt;/p&gt;
&lt;p&gt;
Adapt On-the-Go: Behavior Modulation for Single-Life Robot Deployment. (arXiv:2311.01059v1 [cs.RO])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2311.01059
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;ROAM&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#21033;&#29992;&#20808;&#21069;&#23398;&#20064;&#21040;&#30340;&#34892;&#20026;&#26469;&#23454;&#26102;&#35843;&#33410;&#26426;&#22120;&#20154;&#22312;&#37096;&#32626;&#36807;&#31243;&#20013;&#24212;&#23545;&#26410;&#26366;&#35265;&#36807;&#30340;&#24773;&#20917;&#12290;&#22312;&#27979;&#35797;&#20013;&#65292;ROAM&#21487;&#20197;&#22312;&#21333;&#20010;&#38454;&#27573;&#20869;&#23454;&#29616;&#24555;&#36895;&#36866;&#24212;&#65292;&#24182;&#19988;&#22312;&#27169;&#25311;&#29615;&#22659;&#21644;&#30495;&#23454;&#22330;&#26223;&#20013;&#21462;&#24471;&#20102;&#25104;&#21151;&#65292;&#20855;&#26377;&#36739;&#39640;&#30340;&#25928;&#29575;&#21644;&#36866;&#24212;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20026;&#20102;&#22312;&#29616;&#23454;&#19990;&#30028;&#20013;&#21462;&#24471;&#25104;&#21151;&#65292;&#26426;&#22120;&#20154;&#24517;&#39035;&#24212;&#23545;&#35757;&#32451;&#36807;&#31243;&#20013;&#26410;&#26366;&#35265;&#36807;&#30340;&#24773;&#20917;&#12290;&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;&#22312;&#37096;&#32626;&#36807;&#31243;&#20013;&#38024;&#23545;&#36825;&#20123;&#26032;&#22330;&#26223;&#30340;&#23454;&#26102;&#35843;&#33410;&#38382;&#39064;&#65292;&#36890;&#36807;&#21033;&#29992;&#20808;&#21069;&#23398;&#20064;&#21040;&#30340;&#22810;&#26679;&#21270;&#34892;&#20026;&#24211;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#65292;RObust Autonomous Modulation&#65288;ROAM&#65289;&#65292;&#24341;&#20837;&#20102;&#22522;&#20110;&#39044;&#35757;&#32451;&#34892;&#20026;&#30340;&#24863;&#30693;&#20215;&#20540;&#30340;&#26426;&#21046;&#65292;&#20197;&#22312;&#29305;&#23450;&#24773;&#20917;&#19979;&#36873;&#25321;&#21644;&#35843;&#25972;&#39044;&#35757;&#32451;&#34892;&#20026;&#12290;&#20851;&#38190;&#26159;&#65292;&#36825;&#31181;&#35843;&#33410;&#36807;&#31243;&#22312;&#27979;&#35797;&#26102;&#30340;&#21333;&#20010;&#38454;&#27573;&#20869;&#23436;&#25104;&#65292;&#26080;&#38656;&#20219;&#20309;&#20154;&#31867;&#30417;&#30563;&#12290;&#25105;&#20204;&#23545;&#36873;&#25321;&#26426;&#21046;&#36827;&#34892;&#20102;&#29702;&#35770;&#20998;&#26512;&#65292;&#24182;&#35777;&#26126;&#20102;ROAM&#20351;&#24471;&#26426;&#22120;&#20154;&#33021;&#22815;&#22312;&#27169;&#25311;&#29615;&#22659;&#21644;&#30495;&#23454;&#30340;&#22235;&#36275;&#21160;&#29289;Go1&#19978;&#24555;&#36895;&#36866;&#24212;&#21160;&#24577;&#21464;&#21270;&#65292;&#29978;&#33267;&#22312;&#33050;&#19978;&#22871;&#30528;&#28378;&#36718;&#28369;&#38795;&#30340;&#24773;&#20917;&#19979;&#25104;&#21151;&#21069;&#36827;&#12290;&#19982;&#29616;&#26377;&#26041;&#27861;&#30456;&#27604;&#65292;&#25105;&#20204;&#30340;&#26041;&#27861;&#22312;&#38754;&#23545;&#21508;&#31181;&#20998;&#24067;&#24773;&#20917;&#30340;&#37096;&#32626;&#26102;&#33021;&#22815;&#20197;&#36229;&#36807;2&#20493;&#30340;&#25928;&#29575;&#36827;&#34892;&#35843;&#33410;&#65292;&#36890;&#36807;&#26377;&#25928;&#36873;&#25321;&#26469;&#23454;&#29616;&#36866;&#24212;&#12290;
&lt;/p&gt;
&lt;p&gt;
To succeed in the real world, robots must cope with situations that differ from those seen during training. We study the problem of adapting on-the-fly to such novel scenarios during deployment, by drawing upon a diverse repertoire of previously learned behaviors. Our approach, RObust Autonomous Modulation (ROAM), introduces a mechanism based on the perceived value of pre-trained behaviors to select and adapt pre-trained behaviors to the situation at hand. Crucially, this adaptation process all happens within a single episode at test time, without any human supervision. We provide theoretical analysis of our selection mechanism and demonstrate that ROAM enables a robot to adapt rapidly to changes in dynamics both in simulation and on a real Go1 quadruped, even successfully moving forward with roller skates on its feet. Our approach adapts over 2x as efficiently compared to existing methods when facing a variety of out-of-distribution situations during deployment by effectively choosing
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#38024;&#23545;&#20855;&#26377;&#23454;&#26102;&#24863;&#30693;&#33021;&#21147;&#30340;IoT&#32593;&#32476;&#35774;&#35745;&#30340;&#22522;&#20110;&#26679;&#26412;&#39537;&#21160;&#30340;&#32852;&#37030;&#23398;&#20064;&#26041;&#27861;&#65292;&#36890;&#36807;&#25511;&#21046;&#37319;&#26679;&#36807;&#31243;&#26469;&#20943;&#36731;&#36807;&#25311;&#21512;&#38382;&#39064;&#65292;&#25552;&#39640;&#25972;&#20307;&#20934;&#30830;&#24615;&#65292;&#24182;&#35299;&#20915;&#33021;&#25928;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2310.07497</link><description>&lt;p&gt;
&#22522;&#20110;&#26679;&#26412;&#39537;&#21160;&#30340;&#32852;&#37030;&#23398;&#20064;&#29992;&#20110;&#33021;&#25928;&#21644;&#23454;&#26102;IoT&#24863;&#30693;
&lt;/p&gt;
&lt;p&gt;
Sample-Driven Federated Learning for Energy-Efficient and Real-Time IoT Sensing. (arXiv:2310.07497v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.07497
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#38024;&#23545;&#20855;&#26377;&#23454;&#26102;&#24863;&#30693;&#33021;&#21147;&#30340;IoT&#32593;&#32476;&#35774;&#35745;&#30340;&#22522;&#20110;&#26679;&#26412;&#39537;&#21160;&#30340;&#32852;&#37030;&#23398;&#20064;&#26041;&#27861;&#65292;&#36890;&#36807;&#25511;&#21046;&#37319;&#26679;&#36807;&#31243;&#26469;&#20943;&#36731;&#36807;&#25311;&#21512;&#38382;&#39064;&#65292;&#25552;&#39640;&#25972;&#20307;&#20934;&#30830;&#24615;&#65292;&#24182;&#35299;&#20915;&#33021;&#25928;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#32852;&#37030;&#23398;&#20064;&#31995;&#32479;&#39046;&#22495;&#65292;&#26368;&#36817;&#30340;&#21069;&#27839;&#26041;&#27861;&#22312;&#25910;&#25947;&#20998;&#26512;&#20013;&#20005;&#37325;&#20381;&#36182;&#20110;&#29702;&#24819;&#26465;&#20214;&#12290;&#29305;&#21035;&#22320;&#65292;&#36825;&#20123;&#26041;&#27861;&#20551;&#35774;IoT&#35774;&#22791;&#19978;&#30340;&#35757;&#32451;&#25968;&#25454;&#20855;&#26377;&#19982;&#20840;&#23616;&#25968;&#25454;&#20998;&#24067;&#30456;&#20284;&#30340;&#23646;&#24615;&#12290;&#28982;&#32780;&#65292;&#22312;&#23454;&#26102;&#24863;&#30693;&#32852;&#37030;&#23398;&#20064;&#31995;&#32479;&#20013;&#65292;&#36825;&#31181;&#26041;&#27861;&#26080;&#27861;&#25429;&#25417;&#21040;&#25968;&#25454;&#29305;&#24449;&#30340;&#20840;&#38754;&#33539;&#22260;&#12290;&#20026;&#20102;&#20811;&#26381;&#36825;&#20010;&#38480;&#21046;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#38024;&#23545;&#20855;&#26377;&#23454;&#26102;&#24863;&#30693;&#33021;&#21147;&#30340;IoT&#32593;&#32476;&#35774;&#35745;&#30340;&#26032;&#26041;&#27861;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#32771;&#34385;&#20102;&#30001;&#29992;&#25143;&#25968;&#25454;&#37319;&#26679;&#36807;&#31243;&#24341;&#36215;&#30340;&#27867;&#21270;&#24046;&#36317;&#12290;&#36890;&#36807;&#26377;&#25928;&#22320;&#25511;&#21046;&#36825;&#20010;&#37319;&#26679;&#36807;&#31243;&#65292;&#25105;&#20204;&#21487;&#20197;&#20943;&#36731;&#36807;&#25311;&#21512;&#38382;&#39064;&#65292;&#24182;&#25552;&#39640;&#25972;&#20307;&#20934;&#30830;&#24615;&#12290;&#29305;&#21035;&#22320;&#65292;&#25105;&#20204;&#39318;&#20808;&#21046;&#23450;&#20102;&#19968;&#20010;&#20248;&#21270;&#38382;&#39064;&#65292;&#21033;&#29992;&#37319;&#26679;&#36807;&#31243;&#21516;&#26102;&#20943;&#23569;&#36807;&#25311;&#21512;&#21644;&#26368;&#22823;&#21270;&#20934;&#30830;&#24615;&#12290;&#20026;&#20102;&#36798;&#21040;&#36825;&#20010;&#30446;&#26631;&#65292;&#25105;&#20204;&#30340;&#26367;&#20195;&#20248;&#21270;&#38382;&#39064;&#25797;&#38271;&#22788;&#29702;&#33021;&#25928;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;
In the domain of Federated Learning (FL) systems, recent cutting-edge methods heavily rely on ideal conditions convergence analysis. Specifically, these approaches assume that the training datasets on IoT devices possess similar attributes to the global data distribution. However, this approach fails to capture the full spectrum of data characteristics in real-time sensing FL systems. In order to overcome this limitation, we suggest a new approach system specifically designed for IoT networks with real-time sensing capabilities. Our approach takes into account the generalization gap due to the user's data sampling process. By effectively controlling this sampling process, we can mitigate the overfitting issue and improve overall accuracy. In particular, We first formulate an optimization problem that harnesses the sampling process to concurrently reduce overfitting while maximizing accuracy. In pursuit of this objective, our surrogate optimization problem is adept at handling energy ef
&lt;/p&gt;</description></item><item><title>&#36825;&#31687;&#25991;&#31456;&#25506;&#35752;&#20102;&#22312;&#25968;&#25454;&#27969;&#19978;&#30340;&#26426;&#22120;&#23398;&#20064;&#20219;&#21153;&#30340;&#23450;&#20041;&#21644;&#35774;&#32622;&#23384;&#22312;&#30340;&#38382;&#39064;&#65292;&#38024;&#23545;&#36825;&#20123;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#37325;&#26032;&#26500;&#24605;&#30417;&#30563;&#25968;&#25454;&#27969;&#23398;&#20064;&#30340;&#22522;&#26412;&#23450;&#20041;&#21644;&#35774;&#32622;&#65292;&#24182;&#37325;&#26032;&#32771;&#34385;&#20102;&#19968;&#20123;&#20851;&#20110;&#25968;&#25454;&#27969;&#23398;&#20064;&#30340;&#22522;&#26412;&#20551;&#35774;&#12290;</title><link>http://arxiv.org/abs/2212.14720</link><description>&lt;p&gt;
&#20174;&#25968;&#25454;&#27969;&#20013;&#23398;&#20064;&#65306;&#27010;&#36848;&#19982;&#26356;&#26032;
&lt;/p&gt;
&lt;p&gt;
Learning from Data Streams: An Overview and Update. (arXiv:2212.14720v2 [cs.LG] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2212.14720
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#25991;&#31456;&#25506;&#35752;&#20102;&#22312;&#25968;&#25454;&#27969;&#19978;&#30340;&#26426;&#22120;&#23398;&#20064;&#20219;&#21153;&#30340;&#23450;&#20041;&#21644;&#35774;&#32622;&#23384;&#22312;&#30340;&#38382;&#39064;&#65292;&#38024;&#23545;&#36825;&#20123;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#37325;&#26032;&#26500;&#24605;&#30417;&#30563;&#25968;&#25454;&#27969;&#23398;&#20064;&#30340;&#22522;&#26412;&#23450;&#20041;&#21644;&#35774;&#32622;&#65292;&#24182;&#37325;&#26032;&#32771;&#34385;&#20102;&#19968;&#20123;&#20851;&#20110;&#25968;&#25454;&#27969;&#23398;&#20064;&#30340;&#22522;&#26412;&#20551;&#35774;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#25968;&#25454;&#27969;&#19978;&#30340;&#26426;&#22120;&#23398;&#20064;&#25991;&#29486;&#38750;&#24120;&#24191;&#27867;&#19988;&#19981;&#26029;&#22686;&#38271;&#12290;&#28982;&#32780;&#65292;&#20851;&#20110;&#25968;&#25454;&#27969;&#23398;&#20064;&#20219;&#21153;&#30340;&#23450;&#20041;&#20551;&#35774;&#36890;&#24120;&#22826;&#24378;&#65292;&#22312;&#23454;&#36341;&#20013;&#38590;&#20197;&#28385;&#36275;&#25110;&#32773;&#29978;&#33267;&#30456;&#20114;&#30683;&#30462;&#65292;&#23588;&#20854;&#22312;&#30417;&#30563;&#23398;&#20064;&#30340;&#32972;&#26223;&#19979;&#12290;&#31639;&#27861;&#30340;&#36873;&#25321;&#21644;&#35774;&#35745;&#22522;&#20110;&#36890;&#24120;&#19981;&#26126;&#30830;&#35828;&#26126;&#30340;&#26631;&#20934;&#65292;&#38024;&#23545;&#19981;&#26126;&#30830;&#23450;&#20041;&#30340;&#38382;&#39064;&#35774;&#32622;&#65292;&#22312;&#19981;&#29616;&#23454;&#30340;&#29615;&#22659;&#20013;&#36827;&#34892;&#27979;&#35797;&#65292;&#24182;&#19988;&#19982;&#26356;&#24191;&#27867;&#30340;&#25991;&#29486;&#20013;&#30340;&#30456;&#20851;&#26041;&#27861;&#23396;&#31435;&#22320;&#36827;&#34892;&#12290;&#36825;&#23545;&#20110;&#22312;&#36825;&#31181;&#32972;&#26223;&#19979;&#26500;&#24605;&#30340;&#35768;&#22810;&#26041;&#27861;&#20135;&#29983;&#20102;&#30495;&#23454;&#19990;&#30028;&#24433;&#21709;&#30340;&#21487;&#33021;&#24615;&#25552;&#20986;&#20102;&#36136;&#30097;&#65292;&#24182;&#19988;&#23384;&#22312;&#20256;&#25773;&#35823;&#23548;&#24615;&#30740;&#31350;&#28966;&#28857;&#30340;&#39118;&#38505;&#12290;&#25105;&#20204;&#25552;&#35758;&#36890;&#36807;&#37325;&#26032;&#26500;&#24605;&#30417;&#30563;&#25968;&#25454;&#27969;&#23398;&#20064;&#30340;&#22522;&#26412;&#23450;&#20041;&#21644;&#35774;&#32622;&#65292;&#20197;&#32771;&#34385;&#30456;&#20851;&#27010;&#24565;&#28418;&#31227;&#21644;&#26102;&#38388;&#20381;&#36182;&#30340;&#29616;&#20195;&#24605;&#32771;&#26041;&#24335;&#26469;&#35299;&#20915;&#36825;&#20123;&#38382;&#39064;&#65307;&#21516;&#26102;&#65292;&#25105;&#20204;&#37325;&#26032;&#23457;&#35270;&#20102;&#20160;&#20040;&#26500;&#25104;&#20102;&#30417;&#30563;&#25968;&#25454;&#27969;&#23398;&#20064;&#20219;&#21153;&#65292;&#20197;&#21450;&#37325;&#26032;&#32771;&#34385;&#19968;&#20123;&#20851;&#20110;&#25968;&#25454;&#27969;&#23398;&#20064;&#30340;&#22522;&#26412;&#20551;&#35774;&#12290;
&lt;/p&gt;
&lt;p&gt;
The literature on machine learning in the context of data streams is vast and growing. However, many of the defining assumptions regarding data-stream learning tasks are too strong to hold in practice, or are even contradictory such that they cannot be met in the contexts of supervised learning. Algorithms are chosen and designed based on criteria which are often not clearly stated, for problem settings not clearly defined, tested in unrealistic settings, and/or in isolation from related approaches in the wider literature. This puts into question the potential for real-world impact of many approaches conceived in such contexts, and risks propagating a misguided research focus. We propose to tackle these issues by reformulating the fundamental definitions and settings of supervised data-stream learning with regard to contemporary considerations of concept drift and temporal dependence; and we take a fresh look at what constitutes a supervised data-stream learning task, and a reconsidera
&lt;/p&gt;</description></item></channel></rss>