<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#30740;&#31350;&#25293;&#21334;&#35774;&#35745;&#20013;&#24066;&#22330;&#21402;&#24230;&#21644;&#20449;&#24687;&#20043;&#38388;&#30340;&#26435;&#34913;&#65292;&#29305;&#21035;&#20851;&#27880;&#19968;&#20215;&#21644;&#20108;&#20215;&#25293;&#21334;&#12290;</title><link>https://arxiv.org/abs/2403.11022</link><description>&lt;p&gt;
&#20855;&#26377;&#21160;&#24577;&#35780;&#20998;&#30340;&#25293;&#21334;
&lt;/p&gt;
&lt;p&gt;
Auctions with Dynamic Scoring
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.11022
&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#25293;&#21334;&#35774;&#35745;&#20013;&#24066;&#22330;&#21402;&#24230;&#21644;&#20449;&#24687;&#20043;&#38388;&#30340;&#26435;&#34913;&#65292;&#29305;&#21035;&#20851;&#27880;&#19968;&#20215;&#21644;&#20108;&#20215;&#25293;&#21334;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#20855;&#26377;&#21160;&#24577;&#35780;&#20998;&#30340;&#25293;&#21334;&#35774;&#35745;&#65292;&#36825;&#20123;&#25293;&#21334;&#26681;&#25454;&#32473;&#23450;&#30340;&#35780;&#20998;&#35268;&#21017;&#20998;&#37197;&#21333;&#20010;&#29289;&#21697;&#12290;&#25105;&#20204;&#30340;&#21160;&#26426;&#26469;&#33258;&#22312;&#32447;&#24191;&#21578;&#25293;&#21334;&#65292;&#24403;&#29992;&#25143;&#22312;&#20250;&#35805;&#26399;&#38388;&#19982;&#24179;&#21488;&#20114;&#21160;&#26102;&#12290;&#24179;&#21488;&#26681;&#25454;&#25237;&#26631;&#21644;&#36136;&#37327;&#24471;&#20998;&#30340;&#32452;&#21512;&#23545;&#24191;&#21578;&#36827;&#34892;&#25490;&#21517;&#65292;&#24182;&#26681;&#25454;&#29992;&#25143;&#30340;&#22312;&#32447;&#27963;&#21160;&#22312;&#20250;&#35805;&#26399;&#38388;&#26356;&#26032;&#36136;&#37327;&#24471;&#20998;&#12290;&#24179;&#21488;&#24517;&#39035;&#20915;&#23450;&#20309;&#26102;&#22312;&#20250;&#35805;&#26399;&#38388;&#23637;&#31034;&#24191;&#21578;&#12290;&#36890;&#36807;&#25512;&#36831;&#25293;&#21334;&#65292;&#25293;&#21334;&#32773;&#21487;&#20197;&#33719;&#21462;&#26377;&#20851;&#24191;&#21578;&#36136;&#37327;&#30340;&#20449;&#24687;&#65292;&#25552;&#39640;&#36873;&#25321;&#39640;&#36136;&#37327;&#24191;&#21578;&#30340;&#26426;&#20250;&#12290;&#28982;&#32780;&#65292;&#20449;&#24687;&#26159;&#26377;&#25104;&#26412;&#30340;&#65292;&#22240;&#20026;&#24310;&#36831;&#20250;&#20943;&#23569;&#24066;&#22330;&#21402;&#24230;&#65292;&#20174;&#32780;&#20943;&#23569;&#25910;&#20837;&#12290;&#25293;&#21334;&#32773;&#24212;&#35813;&#20309;&#26102;&#20998;&#37197;&#21360;&#35937;&#20197;&#24179;&#34913;&#36825;&#20123;&#21147;&#37327;&#65311;&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#20010;&#29702;&#35770;&#27169;&#22411;&#26469;&#30740;&#31350;&#24066;&#22330;&#35774;&#35745;&#23545;&#24066;&#22330;&#21402;&#24230;&#21644;&#20449;&#24687;&#20043;&#38388;&#30340;&#26435;&#34913;&#30340;&#24433;&#21709;&#12290;&#20855;&#20307;&#26469;&#35828;&#65292;&#25105;&#20204;&#20851;&#27880;&#19968;&#20215;&#21644;&#20108;&#20215;&#25293;&#21334;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.11022v1 Announce Type: new  Abstract: We study the design of auctions with dynamic scoring, which allocate a single item according to a given scoring rule. We are motivated by online advertising auctions when users interact with a platform over the course of a session. The platform ranks ads based on a combination of bids and quality scores, and updates the quality scores throughout the session based on the user's online activity. The platform must decide when to show an ad during the session. By delaying the auction, the auctioneer acquires information about an ad's quality, improving her chances of selecting a high quality ad. However information is costly, because delay reduces market thickness and in turn revenue. When should the auctioneer allocate the impression to balance these forces?   We develop a theoretical model to study the effect of market design on the trade-off between market thickness and information. In particular, we focus on first- and second-price aucti
&lt;/p&gt;</description></item><item><title>&#23545;&#20110;&#27169;&#31946;&#20998;&#31867;&#38382;&#39064;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#28385;&#36275;&#24369;&#19968;&#33268;&#24615;&#26465;&#20214;&#30340;&#29420;&#31435;&#32858;&#21512;&#35268;&#21017;&#23646;&#20110;&#21152;&#26435;&#31639;&#26415;&#24179;&#22343;&#25968;&#30340;&#23478;&#26063;&#65292;&#24182;&#32473;&#20986;&#20102;$m= p= 2$&#30340;&#29305;&#24449;&#21270;&#32467;&#26524;&#12290;</title><link>https://arxiv.org/abs/2402.17620</link><description>&lt;p&gt;
&#27169;&#31946;&#20998;&#31867;&#32858;&#21512;
&lt;/p&gt;
&lt;p&gt;
Fuzzy Classification Aggregation
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.17620
&lt;/p&gt;
&lt;p&gt;
&#23545;&#20110;&#27169;&#31946;&#20998;&#31867;&#38382;&#39064;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#28385;&#36275;&#24369;&#19968;&#33268;&#24615;&#26465;&#20214;&#30340;&#29420;&#31435;&#32858;&#21512;&#35268;&#21017;&#23646;&#20110;&#21152;&#26435;&#31639;&#26415;&#24179;&#22343;&#25968;&#30340;&#23478;&#26063;&#65292;&#24182;&#32473;&#20986;&#20102;$m= p= 2$&#30340;&#29305;&#24449;&#21270;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#32771;&#34385;&#19968;&#20010;&#38382;&#39064;&#65292;&#21363;&#19968;&#32452;&#20010;&#20307;&#24517;&#39035;&#23558;$m$&#20010;&#23545;&#35937;&#20998;&#31867;&#21040;$p$&#20010;&#31867;&#21035;&#20013;&#65292;&#24182;&#36890;&#36807;&#32858;&#21512;&#20010;&#20307;&#20998;&#31867;&#26469;&#23454;&#29616;&#12290;&#25105;&#20204;&#35777;&#26126;&#65292;&#22914;&#26524;$m\geq 3$&#65292;$m\geq p\geq 2$&#65292;&#24182;&#19988;&#20998;&#31867;&#26159;&#27169;&#31946;&#30340;&#65292;&#20063;&#23601;&#26159;&#35828;&#65292;&#23545;&#35937;&#23646;&#20110;&#26576;&#19968;&#31867;&#21035;&#30340;&#31243;&#24230;&#19981;&#21516;&#65292;&#21017;&#28385;&#36275;&#24369;&#19968;&#33268;&#24615;&#26465;&#20214;&#30340;&#29420;&#31435;&#32858;&#21512;&#35268;&#21017;&#23646;&#20110;&#21152;&#26435;&#31639;&#26415;&#24179;&#22343;&#25968;&#30340;&#23478;&#26063;&#12290;&#25105;&#20204;&#36824;&#33719;&#24471;&#20102;$m= p= 2$&#30340;&#29305;&#24449;&#21270;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.17620v1 Announce Type: new  Abstract: We consider the problem where a set of individuals has to classify $m$ objects into $p$ categories and does so by aggregating the individual classifications. We show that if $m\geq 3$, $m\geq p\geq 2$, and classifications are fuzzy, that is, objects belong to a category to a certain degree, then an independent aggregator rule that satisfies a weak unanimity condition belongs to the family of Weighted Arithmetic Means. We also obtain characterization results for $m= p= 2$.
&lt;/p&gt;</description></item><item><title>&#35813;&#30740;&#31350;&#35780;&#20272;&#20102;K-12&#23398;&#26657;&#22312;&#23485;&#24102;&#20114;&#32852;&#32593;&#37319;&#36141;&#20013;&#36890;&#36807;&#25414;&#32465;&#38656;&#27714;&#30340;&#25928;&#26524;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#21442;&#19982;&#32773;&#30340;&#20215;&#26684;&#24179;&#22343;&#19979;&#38477;&#20102;&#19977;&#20998;&#20043;&#19968;&#65292;&#36141;&#20080;&#30340;&#23485;&#24102;&#36895;&#24230;&#22686;&#21152;&#20102;&#20845;&#20493;&#12290;&#21442;&#19982;&#23398;&#26657;&#33410;&#30465;&#30340;&#37329;&#39069;&#33267;&#23569;&#31561;&#20110;&#32852;&#37030;&#25919;&#24220;&#30340;&#34917;&#36148;&#37329;&#39069;&#12290;&#26681;&#25454;&#24369;&#20551;&#35774;&#65292;&#21442;&#19982;&#23398;&#26657;&#33719;&#24471;&#20102;&#24040;&#22823;&#30340;&#31119;&#21033;&#25552;&#21319;&#12290;</title><link>https://arxiv.org/abs/2402.07277</link><description>&lt;p&gt;
K-12&#23485;&#24102;&#37319;&#36141;&#20013;&#30340;&#38656;&#27714;&#25414;&#32465;&#25928;&#24212;
&lt;/p&gt;
&lt;p&gt;
Bundling Demand in K-12 Broadband Procurement
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.07277
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#35780;&#20272;&#20102;K-12&#23398;&#26657;&#22312;&#23485;&#24102;&#20114;&#32852;&#32593;&#37319;&#36141;&#20013;&#36890;&#36807;&#25414;&#32465;&#38656;&#27714;&#30340;&#25928;&#26524;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#21442;&#19982;&#32773;&#30340;&#20215;&#26684;&#24179;&#22343;&#19979;&#38477;&#20102;&#19977;&#20998;&#20043;&#19968;&#65292;&#36141;&#20080;&#30340;&#23485;&#24102;&#36895;&#24230;&#22686;&#21152;&#20102;&#20845;&#20493;&#12290;&#21442;&#19982;&#23398;&#26657;&#33410;&#30465;&#30340;&#37329;&#39069;&#33267;&#23569;&#31561;&#20110;&#32852;&#37030;&#25919;&#24220;&#30340;&#34917;&#36148;&#37329;&#39069;&#12290;&#26681;&#25454;&#24369;&#20551;&#35774;&#65292;&#21442;&#19982;&#23398;&#26657;&#33719;&#24471;&#20102;&#24040;&#22823;&#30340;&#31119;&#21033;&#25552;&#21319;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#35780;&#20272;&#20102;K-12&#23398;&#26657;&#36890;&#36807;&#25414;&#32465;&#38656;&#27714;&#33719;&#24471;&#23485;&#24102;&#20114;&#32852;&#32593;&#30340;&#25928;&#26524;&#12290;2014&#24180;&#65292;&#26032;&#27901;&#35199;&#24030;&#20174;&#20998;&#25955;&#30340;&#37319;&#36141;&#26041;&#24335;&#36716;&#21464;&#20026;&#23558;&#23398;&#26657;&#20998;&#20026;&#22235;&#20010;&#21306;&#22495;&#32452;&#21512;&#30340;&#26032;&#37319;&#36141;&#31995;&#32479;&#12290;&#37319;&#29992;&#20107;&#20214;&#30740;&#31350;&#26041;&#27861;&#65292;&#25105;&#20204;&#21457;&#29616;&#21442;&#19982;&#32773;&#30340;&#20215;&#26684;&#24179;&#22343;&#19979;&#38477;&#20102;&#19977;&#20998;&#20043;&#19968;&#65292;&#36141;&#20080;&#30340;&#23485;&#24102;&#36895;&#24230;&#22686;&#21152;&#20102;&#20845;&#20493;&#12290;&#25105;&#20204;&#23545;&#35813;&#35745;&#21010;&#23548;&#33268;&#30340;&#23398;&#26657;&#25903;&#20986;&#21464;&#21270;&#36827;&#34892;&#20102;&#30028;&#23450;&#65292;&#21457;&#29616;&#21442;&#19982;&#32773;&#33410;&#30465;&#30340;&#37329;&#39069;&#33267;&#23569;&#31561;&#20110;&#20182;&#20204;&#20174;&#32852;&#37030;&#25919;&#24220;&#33719;&#24471;&#30340;"E-rate"&#34917;&#36148;&#24635;&#39069;&#12290;&#22312;&#23545;&#38656;&#27714;&#36827;&#34892;&#24369;&#20551;&#35774;&#30340;&#24773;&#20917;&#19979;&#65292;&#25105;&#20204;&#34920;&#26126;&#21442;&#19982;&#23398;&#26657;&#33719;&#24471;&#20102;&#24040;&#22823;&#30340;&#31119;&#21033;&#25552;&#21319;&#12290;
&lt;/p&gt;
&lt;p&gt;
We evaluate the effects of bundling demand for broadband internet by K-12 schools. In 2014, New Jersey switched from decentralized procurements to a new procurement system that bundled schools into four regional groups. Using an event study approach, we find that, on average, prices for participants decreased by one-third, and broadband speed purchased increased sixfold. We bound the change in school expenditures due to the program and find that participants saved at least as much as their total "E-rate" subsidy from the federal government. Under weak assumptions on demand, we show that participating schools experienced large welfare gains.
&lt;/p&gt;</description></item></channel></rss>