<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#35813;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#33258;&#36866;&#24212;&#30340;Neyman&#20998;&#37197;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#33021;&#22815;&#26681;&#25454;&#19981;&#21516;&#38454;&#27573;&#30340;&#35266;&#27979;&#26469;&#20272;&#35745;&#26631;&#20934;&#24046;&#65292;&#20174;&#32780;&#25351;&#23548;&#21518;&#32493;&#38454;&#27573;&#30340;&#20998;&#32452;&#20915;&#31574;&#12290;</title><link>http://arxiv.org/abs/2309.08808</link><description>&lt;p&gt;
&#33258;&#36866;&#24212;&#30340;Neyman&#20998;&#37197;
&lt;/p&gt;
&lt;p&gt;
Adaptive Neyman Allocation. (arXiv:2309.08808v1 [stat.ME])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.08808
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#33258;&#36866;&#24212;&#30340;Neyman&#20998;&#37197;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#33021;&#22815;&#26681;&#25454;&#19981;&#21516;&#38454;&#27573;&#30340;&#35266;&#27979;&#26469;&#20272;&#35745;&#26631;&#20934;&#24046;&#65292;&#20174;&#32780;&#25351;&#23548;&#21518;&#32493;&#38454;&#27573;&#30340;&#20998;&#32452;&#20915;&#31574;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#23454;&#39564;&#35774;&#35745;&#20013;&#65292;Neyman&#20998;&#37197;&#26159;&#25351;&#23558;&#21463;&#35797;&#32773;&#20998;&#37197;&#21040;&#22788;&#29702;&#32452;&#21644;&#23545;&#29031;&#32452;&#30340;&#20570;&#27861;&#65292;&#21487;&#33021;&#25353;&#29031;&#23427;&#20204;&#21508;&#33258;&#30340;&#26631;&#20934;&#24046;&#25104;&#27604;&#20363;&#22320;&#20998;&#37197;&#65292;&#20854;&#30446;&#26631;&#26159;&#26368;&#23567;&#21270;&#27835;&#30103;&#25928;&#24212;&#20272;&#35745;&#22120;&#30340;&#26041;&#24046;&#12290;&#36825;&#31181;&#24191;&#27867;&#35748;&#21487;&#30340;&#26041;&#27861;&#22312;&#22788;&#29702;&#32452;&#21644;&#23545;&#29031;&#32452;&#20855;&#26377;&#19981;&#21516;&#26631;&#20934;&#24046;&#30340;&#24773;&#20917;&#19979;&#22686;&#21152;&#20102;&#32479;&#35745;&#25928;&#21147;&#65292;&#36825;&#22312;&#31038;&#20250;&#23454;&#39564;&#12289;&#20020;&#24202;&#35797;&#39564;&#12289;&#24066;&#22330;&#30740;&#31350;&#21644;&#22312;&#32447;A/B&#27979;&#35797;&#20013;&#32463;&#24120;&#21457;&#29983;&#12290;&#28982;&#32780;&#65292;&#38500;&#38750;&#25552;&#21069;&#30693;&#36947;&#26631;&#20934;&#24046;&#65292;&#21542;&#21017;&#26080;&#27861;&#23454;&#26045;Neyman&#20998;&#37197;&#12290;&#24184;&#36816;&#30340;&#26159;&#65292;&#19978;&#36848;&#24212;&#29992;&#30340;&#22810;&#38454;&#27573;&#24615;&#36136;&#20351;&#24471;&#21487;&#20197;&#20351;&#29992;&#36739;&#26089;&#38454;&#27573;&#30340;&#35266;&#27979;&#26469;&#20272;&#35745;&#26631;&#20934;&#24046;&#65292;&#36827;&#19968;&#27493;&#25351;&#23548;&#21518;&#32493;&#38454;&#27573;&#30340;&#20998;&#37197;&#20915;&#31574;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#20010;&#31454;&#20105;&#20998;&#26512;&#26694;&#26550;&#26469;&#30740;&#31350;&#36825;&#20010;&#22810;&#38454;&#27573;&#23454;&#39564;&#35774;&#35745;&#38382;&#39064;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#31616;&#21333;&#30340;&#33258;&#36866;&#24212;Neyman&#20998;&#37197;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
In experimental design, Neyman allocation refers to the practice of allocating subjects into treated and control groups, potentially in unequal numbers proportional to their respective standard deviations, with the objective of minimizing the variance of the treatment effect estimator. This widely recognized approach increases statistical power in scenarios where the treated and control groups have different standard deviations, as is often the case in social experiments, clinical trials, marketing research, and online A/B testing. However, Neyman allocation cannot be implemented unless the standard deviations are known in advance. Fortunately, the multi-stage nature of the aforementioned applications allows the use of earlier stage observations to estimate the standard deviations, which further guide allocation decisions in later stages. In this paper, we introduce a competitive analysis framework to study this multi-stage experimental design problem. We propose a simple adaptive Neym
&lt;/p&gt;</description></item></channel></rss>