<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#36890;&#36807;&#20840;&#22269;&#21508;&#24030;&#20043;&#38388;&#30340;&#32463;&#27982;&#32852;&#31995;&#65292;&#30740;&#31350;&#21457;&#29616;&#32654;&#22269;&#21508;&#24030;&#20043;&#38388;&#23384;&#22312;&#26126;&#26174;&#30340;&#23439;&#35266;&#32463;&#27982;&#27668;&#20505;&#20914;&#20987;&#28322;&#20986;&#25928;&#24212;&#12290;</title><link>https://arxiv.org/abs/2403.10907</link><description>&lt;p&gt;
&#32654;&#22269;&#21508;&#24030;&#27668;&#20505;&#20914;&#20987;&#30340;&#23439;&#35266;&#32463;&#27982;&#28322;&#20986;&#25928;&#24212;
&lt;/p&gt;
&lt;p&gt;
Macroeconomic Spillovers of Weather Shocks across U.S. States
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.10907
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#20840;&#22269;&#21508;&#24030;&#20043;&#38388;&#30340;&#32463;&#27982;&#32852;&#31995;&#65292;&#30740;&#31350;&#21457;&#29616;&#32654;&#22269;&#21508;&#24030;&#20043;&#38388;&#23384;&#22312;&#26126;&#26174;&#30340;&#23439;&#35266;&#32463;&#27982;&#27668;&#20505;&#20914;&#20987;&#28322;&#20986;&#25928;&#24212;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#20272;&#35745;&#26497;&#31471;&#22825;&#27668;&#20914;&#20987;&#23545;&#24403;&#22320;&#32463;&#27982;&#27963;&#21160;&#30340;&#30701;&#26399;&#24433;&#21709;&#65292;&#24182;&#35780;&#20272;&#36890;&#36807;&#32654;&#22269;&#21508;&#24030;&#20043;&#38388;&#30340;&#32463;&#27982;&#32852;&#31995;&#20135;&#29983;&#30340;&#36328;&#22659;&#28322;&#20986;&#25928;&#24212;&#12290;&#25105;&#20204;&#21033;&#29992;&#33258;&#28982;&#28798;&#23475;&#35302;&#21457;&#30340;&#32039;&#24613;&#23459;&#35328;&#30340;&#21439;&#32423;&#35814;&#32454;&#25968;&#25454;&#24211;&#26469;&#34913;&#37327;&#22825;&#27668;&#20914;&#20987;&#65292;&#24182;&#21033;&#29992;&#32654;&#22269;&#21508;&#24030;&#30340;&#26376;&#24230;&#20840;&#29699;&#21521;&#37327;&#33258;&#22238;&#24402;&#65288;GVAR&#65289;&#27169;&#22411;&#26469;&#20272;&#35745;&#23427;&#20204;&#30340;&#24433;&#21709;&#12290;&#33033;&#20914;&#21709;&#24212;&#31361;&#20986;&#20102;&#21521;&#29305;&#23450;&#22320;&#21306;&#20914;&#20987;&#30340;&#22825;&#27668;&#20914;&#20987;&#22312;&#20840;&#22269;&#33539;&#22260;&#20869;&#30340;&#23439;&#35266;&#32463;&#27982;&#25928;&#24212;&#12290;&#25105;&#20204;&#36824;&#34920;&#26126;&#65292;&#65288;i&#65289;&#32771;&#34385;&#21040;&#21508;&#24030;&#20043;&#38388;&#30340;&#32463;&#27982;&#32852;&#31995;&#21487;&#20197;&#25429;&#25417;&#21040;&#27604;&#21333;&#32431;&#30340;&#31354;&#38388;&#37051;&#36817;&#24615;&#26356;&#24378;&#30340;&#28322;&#20986;&#25928;&#24212;&#65292;&#65288;ii&#65289;&#22320;&#29702;&#24322;&#36136;&#24615;&#23545;&#35780;&#20272;&#22825;&#27668;&#20914;&#20987;&#30340;&#20840;&#22269;&#25928;&#24212;&#33267;&#20851;&#37325;&#35201;&#65292;&#65288;iii&#65289;&#32593;&#32476;&#25928;&#24212;&#25918;&#22823;&#20102;&#36825;&#20123;&#20914;&#20987;&#30340;&#23616;&#37096;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.10907v1 Announce Type: new  Abstract: We estimate the short-run effects of severe weather shocks on local economic activity and assess cross-border spillovers operating through economic linkages between U.S. states. We measure weather shocks using a detailed county-level database on emergency declarations triggered by natural disasters and estimate their impacts with a monthly Global Vector Autoregressive (GVAR) model for the U.S. states. Impulse responses highlight significant country-wide macroeconomic effects of weather shocks hitting individual regions. We also show that (i) taking into account economic interconnections between states allows capturing much stronger spillover effects than those associated with mere spatial adjacency, (ii) geographical heterogeneity is critical for assessing country-wide effects of weather shocks, and (iii) network effects amplify the local impacts of these shocks.
&lt;/p&gt;</description></item></channel></rss>