<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#36825;&#31687;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26082;&#23562;&#37325;&#20010;&#20154;&#24847;&#24895;&#21448;&#39640;&#25928;&#30340;&#25424;&#36192;&#26426;&#21046;&#65292;&#36890;&#36807;&#20197;&#39640;&#25928;&#30340;&#26041;&#24335;&#20998;&#37197;&#27599;&#20010;&#25424;&#36192;&#32773;&#30340;&#36129;&#29486;&#65292;&#27809;&#26377;&#20219;&#20309;&#25424;&#21161;&#20154;&#26377;&#21160;&#26426;&#37325;&#26032;&#20998;&#37197;&#20182;&#20204;&#30340;&#25424;&#27454;&#12290;</title><link>http://arxiv.org/abs/2305.10286</link><description>&lt;p&gt;
&#24179;&#34913;&#25424;&#36192;&#32773;&#21327;&#35843;
&lt;/p&gt;
&lt;p&gt;
Balanced Donor Coordination. (arXiv:2305.10286v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.10286
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26082;&#23562;&#37325;&#20010;&#20154;&#24847;&#24895;&#21448;&#39640;&#25928;&#30340;&#25424;&#36192;&#26426;&#21046;&#65292;&#36890;&#36807;&#20197;&#39640;&#25928;&#30340;&#26041;&#24335;&#20998;&#37197;&#27599;&#20010;&#25424;&#36192;&#32773;&#30340;&#36129;&#29486;&#65292;&#27809;&#26377;&#20219;&#20309;&#25424;&#21161;&#20154;&#26377;&#21160;&#26426;&#37325;&#26032;&#20998;&#37197;&#20182;&#20204;&#30340;&#25424;&#27454;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24904;&#21892;&#36890;&#24120;&#30001;&#20010;&#20154;&#25424;&#36192;&#32773;&#25110;&#20013;&#22830;&#32452;&#32455;&#65288;&#22914;&#25919;&#24220;&#25110;&#24066;&#25919;&#26426;&#26500;&#65289;&#36827;&#34892;&#65292;&#20182;&#20204;&#25910;&#38598;&#20010;&#20154;&#25424;&#27454;&#24182;&#23558;&#23427;&#20204;&#20998;&#37197;&#32473;&#19968;&#32452;&#24904;&#21892;&#26426;&#26500;&#12290;&#19968;&#26041;&#38754;&#65292;&#20010;&#20154;&#24904;&#21892;&#23562;&#37325;&#25424;&#36192;&#32773;&#30340;&#24847;&#24895;&#65292;&#20294;&#30001;&#20110;&#32570;&#20047;&#21327;&#35843;&#32780;&#21487;&#33021;&#25928;&#29575;&#20302;&#19979;&#12290;&#21478;&#19968;&#26041;&#38754;&#65292;&#38598;&#20013;&#24904;&#21892;&#21487;&#33021;&#26356;&#26377;&#25928;&#65292;&#20294;&#21487;&#33021;&#24573;&#30053;&#20010;&#20154;&#25424;&#36192;&#32773;&#30340;&#24847;&#24895;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26426;&#21046;&#65292;&#23427;&#32467;&#21512;&#20102;&#20004;&#31181;&#26041;&#27861;&#30340;&#20248;&#28857;&#65292;&#36890;&#36807;&#20197;&#39640;&#25928;&#30340;&#26041;&#24335;&#20998;&#37197;&#27599;&#20010;&#25424;&#36192;&#32773;&#30340;&#36129;&#29486;&#65292;&#27809;&#26377;&#20219;&#20309;&#25424;&#21161;&#20154;&#26377;&#21160;&#26426;&#37325;&#26032;&#20998;&#37197;&#20182;&#20204;&#30340;&#25424;&#27454;&#12290;&#22312;&#20551;&#35774;Leontief&#25928;&#29992;&#20989;&#25968;&#65288;&#21363;&#27599;&#20010;&#25424;&#36192;&#32773;&#22343;&#24076;&#26395;&#26368;&#22823;&#21270;&#25152;&#26377;&#24904;&#21892;&#26426;&#26500;&#30340;&#26368;&#23567;&#36129;&#29486;&#30340;&#20010;&#20154;&#21152;&#26435;&#20043;&#21644;&#65289;&#30340;&#24773;&#20917;&#19979;&#65292;&#25105;&#20204;&#30340;&#26426;&#21046;&#26159;&#32452;&#31574;&#30053;&#27491;&#30830;&#12289;&#20559;&#22909;&#21333;&#35843;&#12289;&#36129;&#29486;&#21333;&#35843;&#12289;&#26368;&#22823;&#21270;&#32435;&#20160;&#31119;&#21033;&#24182;&#21487;&#20197;&#35745;&#31639;&#12290;
&lt;/p&gt;
&lt;p&gt;
Charity is typically done either by individual donors, who donate money to the charities that they support, or by centralized organizations such as governments or municipalities, which collect the individual contributions and distribute them among a set of charities. On the one hand, individual charity respects the will of the donors but may be inefficient due to a lack of coordination. On the other hand, centralized charity is potentially more efficient but may ignore the will of individual donors. We present a mechanism that combines the advantages of both methods by distributing the contribution of each donor in an efficient way such that no subset of donors has an incentive to redistribute their donations. Assuming Leontief utilities (i.e., each donor is interested in maximizing an individually weighted minimum of all contributions across the charities), our mechanism is group-strategyproof, preference-monotonic, contribution-monotonic, maximizes Nash welfare, and can be computed u
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;&#24314;&#31435;&#28176;&#36817;&#25512;&#26029;&#38750;&#23545;&#31216;&#30697;&#38453;&#29305;&#24449;&#21521;&#37327;&#31243;&#24207;&#30340;&#24517;&#35201;&#26465;&#20214;&#65292;&#24182;&#38024;&#23545;&#23436;&#20840;&#21521;&#37327;&#21644;&#27599;&#20010;&#31995;&#25968;&#20551;&#35774;&#20998;&#21035;&#24314;&#31435;&#20102; Wald &#21644; t &#26816;&#39564;&#30340;&#20998;&#24067;&#29702;&#35770;&#65292;&#26159;&#22810;&#20803;&#32479;&#35745;&#23398;&#20013;&#30340;&#19968;&#31181;&#26377;&#29992;&#24037;&#20855;&#12290;</title><link>http://arxiv.org/abs/2303.18233</link><description>&lt;p&gt;
&#38750;&#23545;&#31216;&#30697;&#38453;&#29305;&#24449;&#21521;&#37327;&#30340;&#25512;&#26029;
&lt;/p&gt;
&lt;p&gt;
Inference on eigenvectors of non-symmetric matrices. (arXiv:2303.18233v1 [math.ST])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.18233
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;&#24314;&#31435;&#28176;&#36817;&#25512;&#26029;&#38750;&#23545;&#31216;&#30697;&#38453;&#29305;&#24449;&#21521;&#37327;&#31243;&#24207;&#30340;&#24517;&#35201;&#26465;&#20214;&#65292;&#24182;&#38024;&#23545;&#23436;&#20840;&#21521;&#37327;&#21644;&#27599;&#20010;&#31995;&#25968;&#20551;&#35774;&#20998;&#21035;&#24314;&#31435;&#20102; Wald &#21644; t &#26816;&#39564;&#30340;&#20998;&#24067;&#29702;&#35770;&#65292;&#26159;&#22810;&#20803;&#32479;&#35745;&#23398;&#20013;&#30340;&#19968;&#31181;&#26377;&#29992;&#24037;&#20855;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#35748;&#20026;&#65292;Tyler&#65288;1981&#65289;&#30340;&#21487;&#23545;&#31216;&#21270;&#26465;&#20214;&#24182;&#38750;&#24314;&#31435;&#28176;&#36817;&#25512;&#26029;&#29305;&#24449;&#21521;&#37327;&#31243;&#24207;&#25152;&#24517;&#38656;&#30340;&#12290; &#25105;&#20204;&#20026;&#23436;&#20840;&#21521;&#37327;&#21644;&#27599;&#20010;&#31995;&#25968;&#20551;&#35774;&#20998;&#21035;&#24314;&#31435;&#20102; Wald &#21644; t &#26816;&#39564;&#30340;&#20998;&#24067;&#29702;&#35770;&#12290; &#25105;&#20204;&#30340;&#26816;&#39564;&#32479;&#35745;&#37327;&#26469;&#28304;&#20110;&#38750;&#23545;&#31216;&#30697;&#38453;&#30340;&#29305;&#24449;&#25237;&#24433;&#12290; &#36890;&#36807;&#23558;&#25237;&#24433;&#34920;&#31034;&#20026;&#20174;&#22522;&#30784;&#30697;&#38453;&#21040;&#20854;&#35889;&#25968;&#25454;&#30340;&#26144;&#23556;&#65292;&#25105;&#20204;&#36890;&#36807;&#35299;&#26512;&#25668;&#21160;&#29702;&#35770;&#25214;&#21040;&#20102;&#23548;&#25968;&#12290; &#36825;&#20123;&#32467;&#26524;&#28436;&#31034;&#20102; Sun&#65288;1991&#65289;&#30340;&#35299;&#26512;&#25668;&#21160;&#29702;&#35770;&#26159;&#22810;&#20803;&#32479;&#35745;&#23398;&#20013;&#30340;&#19968;&#31181;&#26377;&#29992;&#24037;&#20855;&#65292;&#24182;&#19988;&#20855;&#26377;&#29420;&#31435;&#30340;&#20852;&#36259;&#12290;&#20316;&#20026;&#19968;&#31181;&#24212;&#29992;&#65292;&#25105;&#20204;&#20026;&#30001;&#26377;&#21521;&#22270;&#24341;&#21457;&#30340;&#37051;&#25509;&#30697;&#38453;&#20272;&#35745;&#30340; Bonacich &#20013;&#24515;&#24615;&#23450;&#20041;&#32622;&#20449;&#21306;&#38388;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper argues that the symmetrisability condition in Tyler(1981) is not necessary to establish asymptotic inference procedures for eigenvectors. We establish distribution theory for a Wald and t-test for full-vector and individual coefficient hypotheses, respectively. Our test statistics originate from eigenprojections of non-symmetric matrices. Representing projections as a mapping from the underlying matrix to its spectral data, we find derivatives through analytic perturbation theory. These results demonstrate how the analytic perturbation theory of Sun(1991) is a useful tool in multivariate statistics and are of independent interest. As an application, we define confidence sets for Bonacich centralities estimated from adjacency matrices induced by directed graphs.
&lt;/p&gt;</description></item></channel></rss>