<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#26412;&#25991;&#23545;&#22788;&#29702;&#23545;&#32467;&#26524;&#30340;&#24179;&#22343;&#22240;&#26524;&#25928;&#24212;&#36827;&#34892;&#20102;&#30740;&#31350;&#65292;&#32771;&#34385;&#20102;&#32467;&#26524;&#23454;&#29616;&#19981;&#21450;&#26102;&#30340;&#24773;&#20917;&#65292;&#30740;&#31350;&#20102;&#32463;&#24120;&#29992;&#20110;&#20272;&#35745;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#30340;&#20960;&#31181;&#26631;&#20934;&#65292;&#24182;&#25506;&#35752;&#20102;&#19981;&#21516;&#26631;&#20934;&#30340;&#35299;&#37322;&#26041;&#24335;&#12290;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;&#19977;&#31181;&#26368;&#21463;&#27426;&#36814;&#30340;&#20272;&#35745;&#37327;&#36890;&#24120;&#19981;&#28385;&#36275;&#24378;&#31526;&#21495;&#20445;&#30041;&#12290;</title><link>http://arxiv.org/abs/2302.11505</link><description>&lt;p&gt;
&#24310;&#36831;&#32467;&#26524;&#24773;&#24418;&#19979;&#30340;&#22788;&#29702;&#25928;&#26524;&#20998;&#35299;&#21644;&#35299;&#37322;
&lt;/p&gt;
&lt;p&gt;
Decomposition and Interpretation of Treatment Effects in Settings with Delayed Outcomes. (arXiv:2302.11505v2 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2302.11505
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#23545;&#22788;&#29702;&#23545;&#32467;&#26524;&#30340;&#24179;&#22343;&#22240;&#26524;&#25928;&#24212;&#36827;&#34892;&#20102;&#30740;&#31350;&#65292;&#32771;&#34385;&#20102;&#32467;&#26524;&#23454;&#29616;&#19981;&#21450;&#26102;&#30340;&#24773;&#20917;&#65292;&#30740;&#31350;&#20102;&#32463;&#24120;&#29992;&#20110;&#20272;&#35745;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#30340;&#20960;&#31181;&#26631;&#20934;&#65292;&#24182;&#25506;&#35752;&#20102;&#19981;&#21516;&#26631;&#20934;&#30340;&#35299;&#37322;&#26041;&#24335;&#12290;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;&#19977;&#31181;&#26368;&#21463;&#27426;&#36814;&#30340;&#20272;&#35745;&#37327;&#36890;&#24120;&#19981;&#28385;&#36275;&#24378;&#31526;&#21495;&#20445;&#30041;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#35782;&#21035;&#21644;&#20272;&#35745;&#20108;&#36827;&#21046;&#22788;&#29702;&#23545;&#32467;&#26524;&#30340;&#24179;&#22343;&#22240;&#26524;&#25928;&#24212;&#12290;&#25105;&#20204;&#32771;&#34385;&#19968;&#31181;&#24773;&#24418;&#65292;&#21363;&#22788;&#29702;&#20998;&#37197;&#21518;&#32467;&#26524;&#23454;&#29616;&#24182;&#38750;&#31435;&#21363;&#23454;&#29616;&#65292;&#36825;&#26159;&#23454;&#35777;&#30740;&#31350;&#20013;&#26222;&#36941;&#23384;&#22312;&#30340;&#29305;&#24449;&#12290;&#22788;&#29702;&#21644;&#32467;&#26524;&#23454;&#29616;&#20043;&#38388;&#30340;&#36825;&#27573;&#26102;&#38388;&#20801;&#35768;&#20854;&#20182;&#35266;&#23519;&#21040;&#30340;&#34892;&#21160;&#21457;&#29983;&#24182;&#24433;&#21709;&#32467;&#26524;&#12290;&#22312;&#36825;&#31181;&#24773;&#20917;&#19979;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#20960;&#31181;&#32463;&#24120;&#29992;&#20110;&#25429;&#25417;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#30340;&#22522;&#20110;&#22238;&#24402;&#30340;&#20272;&#35745;&#26631;&#20934;&#65292;&#24182;&#38416;&#26126;&#20102;&#23427;&#20204;&#22312;&#24658;&#23450;&#20854;&#20182;&#22240;&#32032;&#25928;&#24212;&#12289;&#38388;&#25509;&#22240;&#26524;&#25928;&#24212;&#21644;&#36873;&#25321;&#39033;&#26041;&#38754;&#30340;&#35299;&#37322;&#12290;&#25105;&#20204;&#24471;&#20986;&#20102;&#19977;&#20010;&#20027;&#35201;&#19988;&#30456;&#20851;&#30340;&#32467;&#35770;&#12290;&#39318;&#20808;&#65292;&#19977;&#31181;&#26368;&#21463;&#27426;&#36814;&#30340;&#20272;&#35745;&#37327;&#36890;&#24120;&#19981;&#28385;&#36275;&#25105;&#20204;&#25152;&#35828;&#30340;&#24378;&#31526;&#21495;&#20445;&#30041;&#65292;&#22312;&#36825;&#31181;&#24847;&#20041;&#19978;&#65292;&#21363;&#20351;&#20219;&#20309;&#21487;&#33021;&#30340;&#32452;&#21512;&#26465;&#20214;&#19979;&#22788;&#29702;&#27491;&#25928;&#24212;&#24433;&#21709;&#32467;&#26524;&#65292;&#36825;&#20123;&#20272;&#35745;&#37327;&#20063;&#21487;&#33021;&#20026;&#36127;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper studies settings where the analyst is interested in identifying and estimating the average causal effect of a binary treatment on an outcome. We consider a setup in which the outcome realization does not get immediately realized after the treatment assignment, a feature that is ubiquitous in empirical settings. The period between the treatment and the realization of the outcome allows other observed actions to occur and affect the outcome. In this context, we study several regression-based estimands routinely used in empirical work to capture the average treatment effect and shed light on interpreting them in terms of ceteris paribus effects, indirect causal effects, and selection terms. We obtain three main and related takeaways. First, the three most popular estimands do not generally satisfy what we call strong sign preservation, in the sense that these estimands may be negative even when the treatment positively affects the outcome conditional on any possible combination
&lt;/p&gt;</description></item></channel></rss>