<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#37327;&#21270;&#20915;&#31574;&#38382;&#39064;&#20013;&#20449;&#24687;&#20215;&#20540;&#30340;&#26041;&#27861;&#65292;&#19968;&#20010;&#26159;&#20840;&#23616;&#20985;&#30340;&#65292;&#21478;&#19968;&#20010;&#20960;&#20046;&#20174;&#19981;&#26159;&#12290;</title><link>https://arxiv.org/abs/2404.01190</link><description>&lt;p&gt;
&#21483;&#29273;&#21307;&#65281;&#20449;&#24687;&#20215;&#20540;&#20013;&#30340;&#65288;&#20985;&#65289;&#27934;
&lt;/p&gt;
&lt;p&gt;
Call the Dentist! A (Con-)Cavity in the Value of Information
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2404.01190
&lt;/p&gt;
&lt;p&gt;
&#37327;&#21270;&#20915;&#31574;&#38382;&#39064;&#20013;&#20449;&#24687;&#20215;&#20540;&#30340;&#26041;&#27861;&#65292;&#19968;&#20010;&#26159;&#20840;&#23616;&#20985;&#30340;&#65292;&#21478;&#19968;&#20010;&#20960;&#20046;&#20174;&#19981;&#26159;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#19968;&#31181;&#33258;&#28982;&#30340;&#37327;&#21270;&#20915;&#31574;&#38382;&#39064;&#20013;&#8220;&#20449;&#24687;&#37327;&#8221;&#30340;&#26041;&#27861;&#20135;&#29983;&#20102;&#19968;&#20010;&#20840;&#23616;&#20985;&#30340;&#20449;&#24687;&#20215;&#20540;&#12290;&#21478;&#19968;&#31181;&#65288;&#30456;&#27604;&#20043;&#19979;&#65292;&#20855;&#26377;&#23545;&#25239;&#24615;&#30340;&#65289;&#26041;&#27861;&#20960;&#20046;&#20174;&#19981;&#36825;&#26679;&#20570;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2404.01190v1 Announce Type: new  Abstract: A natural way of quantifying the ``amount of information'' in decision problems yields a globally concave value for information. Another (in contrast, adversarial) way almost never does.
&lt;/p&gt;</description></item><item><title>&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#22810;&#20803;&#37325;&#23614;&#20998;&#24067;&#65292;&#21363;&#21367;&#31215;t&#20998;&#24067;&#65292;&#20855;&#26377;&#28789;&#27963;&#30340;&#38750;&#32447;&#24615;&#20381;&#36182;&#24615;&#21644;&#31616;&#21333;&#30340;&#23494;&#24230;&#20989;&#25968;&#65292;&#21487;&#22312;&#23454;&#29616;&#27874;&#21160;&#29575;&#27979;&#37327;&#30340;&#20998;&#26512;&#20013;&#21457;&#25381;&#37325;&#35201;&#20316;&#29992;&#12290;</title><link>https://arxiv.org/abs/2404.00864</link><description>&lt;p&gt;
&#21367;&#31215;t&#20998;&#24067;
&lt;/p&gt;
&lt;p&gt;
Convolution-t Distributions
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2404.00864
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#22810;&#20803;&#37325;&#23614;&#20998;&#24067;&#65292;&#21363;&#21367;&#31215;t&#20998;&#24067;&#65292;&#20855;&#26377;&#28789;&#27963;&#30340;&#38750;&#32447;&#24615;&#20381;&#36182;&#24615;&#21644;&#31616;&#21333;&#30340;&#23494;&#24230;&#20989;&#25968;&#65292;&#21487;&#22312;&#23454;&#29616;&#27874;&#21160;&#29575;&#27979;&#37327;&#30340;&#20998;&#26512;&#20013;&#21457;&#25381;&#37325;&#35201;&#20316;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#20171;&#32461;&#20102;&#19968;&#31867;&#26032;&#30340;&#22810;&#20803;&#37325;&#23614;&#20998;&#24067;&#65292;&#36825;&#20123;&#20998;&#24067;&#26159;&#24322;&#36136;&#22810;&#20803;t&#20998;&#24067;&#30340;&#21367;&#31215;&#12290;&#19982;&#24120;&#29992;&#30340;&#37325;&#23614;&#20998;&#24067;&#19981;&#21516;&#65292;&#22810;&#20803;&#21367;&#31215;t&#20998;&#24067;&#20307;&#29616;&#20102;&#20855;&#26377;&#28789;&#27963;&#38750;&#32447;&#24615;&#20381;&#36182;&#24615;&#21644;&#24322;&#36136;&#36793;&#32536;&#20998;&#24067;&#30340;&#31751;&#32467;&#26500;&#12290;&#37325;&#35201;&#30340;&#26159;&#65292;&#21367;&#31215;t&#20998;&#24067;&#20855;&#26377;&#31616;&#21333;&#30340;&#23494;&#24230;&#20989;&#25968;&#65292;&#26377;&#21161;&#20110;&#20272;&#35745;&#21644;&#22522;&#20110;&#20284;&#28982;&#30340;&#25512;&#26029;&#12290;&#21457;&#29616;&#21367;&#31215;t&#20998;&#24067;&#30340;&#29305;&#24449;&#22312;&#23454;&#29616;&#27874;&#21160;&#29575;&#27979;&#37327;&#30340;&#32463;&#39564;&#20998;&#26512;&#20013;&#38750;&#24120;&#37325;&#35201;&#65292;&#24182;&#26377;&#21161;&#20110;&#35782;&#21035;&#20854;&#28508;&#22312;&#22240;&#23376;&#32467;&#26500;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2404.00864v1 Announce Type: new  Abstract: We introduce a new class of multivariate heavy-tailed distributions that are convolutions of heterogeneous multivariate t-distributions. Unlike commonly used heavy-tailed distributions, the multivariate convolution-t distributions embody cluster structures with flexible nonlinear dependencies and heterogeneous marginal distributions. Importantly, convolution-t distributions have simple density functions that facilitate estimation and likelihood-based inference. The characteristic features of convolution-t distributions are found to be important in an empirical analysis of realized volatility measures and help identify their underlying factor structure.
&lt;/p&gt;</description></item><item><title>&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#30340;&#31639;&#27861;&#23450;&#20215;&#20195;&#29702;&#22312;&#23521;&#22836;&#24066;&#22330;&#29615;&#22659;&#20013;&#33258;&#20027;&#21246;&#32467;&#65292;&#23545;&#28040;&#36153;&#32773;&#21033;&#30410;&#26377;&#23475;&#65292;&#20854;&#35828;&#26126;&#20070;&#20013;&#30340;&#30701;&#35821;&#21464;&#21270;&#21487;&#33021;&#22686;&#21152;&#21246;&#32467;&#12290;</title><link>https://arxiv.org/abs/2404.00806</link><description>&lt;p&gt;
&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#30340;&#31639;&#27861;&#21246;&#32467;
&lt;/p&gt;
&lt;p&gt;
Algorithmic Collusion by Large Language Models
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2404.00806
&lt;/p&gt;
&lt;p&gt;
&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#30340;&#31639;&#27861;&#23450;&#20215;&#20195;&#29702;&#22312;&#23521;&#22836;&#24066;&#22330;&#29615;&#22659;&#20013;&#33258;&#20027;&#21246;&#32467;&#65292;&#23545;&#28040;&#36153;&#32773;&#21033;&#30410;&#26377;&#23475;&#65292;&#20854;&#35828;&#26126;&#20070;&#20013;&#30340;&#30701;&#35821;&#21464;&#21270;&#21487;&#33021;&#22686;&#21152;&#21246;&#32467;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
arXiv:2404.00806v1 &#20844;&#21578;&#31867;&#22411;:&#20132;&#21449;&#25688;&#35201;:&#31639;&#27861;&#23450;&#20215;&#30340;&#20852;&#36215;&#24341;&#36215;&#20102;&#23545;&#31639;&#27861;&#21246;&#32467;&#30340;&#25285;&#24551;&#12290;&#25105;&#20204;&#23545;&#22522;&#20110;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLMs&#65289;&#29305;&#21035;&#26159;GPT-4&#30340;&#31639;&#27861;&#23450;&#20215;&#20195;&#29702;&#36827;&#34892;&#23454;&#39564;&#12290;&#25105;&#20204;&#21457;&#29616;&#65306;&#65288;1&#65289;&#22522;&#20110;LLM&#30340;&#20195;&#29702;&#22312;&#23450;&#20215;&#20219;&#21153;&#19978;&#34920;&#29616;&#20986;&#33394;&#65292;&#65288;2&#65289;&#22522;&#20110;LLM&#30340;&#23450;&#20215;&#20195;&#29702;&#22312;&#23521;&#22836;&#24066;&#22330;&#29615;&#22659;&#20013;&#33258;&#20027;&#21246;&#32467;&#65292;&#25439;&#23475;&#28040;&#36153;&#32773;&#21033;&#30410;&#65292;&#65288;3&#65289;LLM&#35828;&#26126;&#20070;&#20013;&#30475;&#20284;&#26080;&#23475;&#30701;&#35821;("&#25552;&#31034;")&#30340;&#21464;&#21270;&#21487;&#33021;&#20250;&#22686;&#21152;&#21246;&#32467;&#12290;&#36825;&#20123;&#32467;&#26524;&#20063;&#36866;&#29992;&#20110;&#25293;&#21334;&#35774;&#32622;&#12290;&#25105;&#20204;&#30340;&#21457;&#29616;&#24378;&#35843;&#20102;&#26377;&#20851;&#31639;&#27861;&#23450;&#20215;&#30340;&#21453;&#22404;&#26029;&#30417;&#31649;&#30340;&#24517;&#35201;&#24615;&#65292;&#24182;&#21457;&#29616;&#20102;&#22522;&#20110;LLM&#30340;&#23450;&#20215;&#20195;&#29702;&#25152;&#38754;&#20020;&#30340;&#30417;&#31649;&#25361;&#25112;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2404.00806v1 Announce Type: cross  Abstract: The rise of algorithmic pricing raises concerns of algorithmic collusion. We conduct experiments with algorithmic pricing agents based on Large Language Models (LLMs), and specifically GPT-4. We find that (1) LLM-based agents are adept at pricing tasks, (2) LLM-based pricing agents autonomously collude in oligopoly settings to the detriment of consumers, and (3) variation in seemingly innocuous phrases in LLM instructions ("prompts") may increase collusion. These results extend to auction settings. Our findings underscore the need for antitrust regulation regarding algorithmic pricing, and uncover regulatory challenges unique to LLM-based pricing agents.
&lt;/p&gt;</description></item><item><title>&#20174;&#22024;&#26434;&#25968;&#25454;&#20013;&#20272;&#35745;&#39640;&#26031;-&#39532;&#23572;&#21487;&#22827;&#36807;&#31243;&#30340;&#26679;&#26412;&#36335;&#24452;&#65292;&#30740;&#31350;&#20102;&#23545;&#20219;&#24847;&#39640;&#26031;-&#39532;&#23572;&#21487;&#22827;&#36807;&#31243;&#30340;&#28857;&#24577;&#26465;&#20214;&#22343;&#20540;&#21644;&#26041;&#24046;&#20197;&#21450;&#29305;&#27530;&#24773;&#20917;&#19979;&#30340;&#24067;&#26391;&#36816;&#21160;&#21644;&#26725;&#25509;&#12290;</title><link>https://arxiv.org/abs/2404.00784</link><description>&lt;p&gt;
&#20174;&#22024;&#26434;&#25968;&#25454;&#20013;&#20272;&#35745;&#39640;&#26031;-&#39532;&#23572;&#21487;&#22827;&#36807;&#31243;&#30340;&#26679;&#26412;&#36335;&#24452;
&lt;/p&gt;
&lt;p&gt;
Estimating sample paths of Gauss-Markov processes from noisy data
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2404.00784
&lt;/p&gt;
&lt;p&gt;
&#20174;&#22024;&#26434;&#25968;&#25454;&#20013;&#20272;&#35745;&#39640;&#26031;-&#39532;&#23572;&#21487;&#22827;&#36807;&#31243;&#30340;&#26679;&#26412;&#36335;&#24452;&#65292;&#30740;&#31350;&#20102;&#23545;&#20219;&#24847;&#39640;&#26031;-&#39532;&#23572;&#21487;&#22827;&#36807;&#31243;&#30340;&#28857;&#24577;&#26465;&#20214;&#22343;&#20540;&#21644;&#26041;&#24046;&#20197;&#21450;&#29305;&#27530;&#24773;&#20917;&#19979;&#30340;&#24067;&#26391;&#36816;&#21160;&#21644;&#26725;&#25509;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#25512;&#23548;&#20986;&#20102;&#23545;&#20219;&#24847;&#39640;&#26031;-&#39532;&#23572;&#21487;&#22827;&#36807;&#31243;&#30340;&#28857;&#24577;&#26465;&#20214;&#22343;&#20540;&#21644;&#26041;&#24046;&#65292;&#32771;&#34385;&#20102;&#23545;&#26679;&#26412;&#36335;&#24452;&#19978;&#30340;&#28857;&#36827;&#34892;&#22122;&#22768;&#35266;&#27979;&#12290;&#36825;&#20123;&#26102;&#21051;&#20381;&#36182;&#20110;&#36807;&#31243;&#30340;&#22343;&#20540;&#21644;&#21327;&#26041;&#24046;&#20989;&#25968;&#65292;&#20197;&#21450;&#34987;&#21462;&#26679;&#28857;&#30340;&#26465;&#20214;&#26102;&#21051;&#12290;&#25105;&#30740;&#31350;&#20102;&#24067;&#26391;&#36816;&#21160;&#21644;&#26725;&#25509;&#20316;&#20026;&#29305;&#27530;&#24773;&#20917;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2404.00784v1 Announce Type: cross  Abstract: I derive the pointwise conditional means and variances of an arbitrary Gauss-Markov process, given noisy observations of points on a sample path. These moments depend on the process's mean and covariance functions, and on the conditional moments of the sampled points. I study the Brownian motion and bridge as special cases.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#20813;&#30123;&#20316;&#24330;&#30340;&#25293;&#21334;&#24418;&#24335;&#65292;&#21457;&#29616;&#33655;&#20848;&#24335;&#25293;&#21334;&#65288;&#35774;&#26377;&#36866;&#24403;&#20445;&#30041;&#20215;&#65289;&#26159;&#21807;&#19968;&#30340;&#26368;&#20248;&#19988;&#24378;&#20813;&#30123;&#20316;&#24330;&#30340;&#25293;&#21334;&#65292;&#21516;&#26102;&#33655;&#20848;&#24335;&#25293;&#21334;&#65288;&#27809;&#26377;&#20445;&#30041;&#20215;&#65289;&#26159;&#21807;&#19968;&#21516;&#26102;&#39640;&#25928;&#21644;&#24369;&#20813;&#30123;&#20316;&#24330;&#30340;&#20808;&#39564;&#29420;&#31435;&#25293;&#21334;&#12290;</title><link>https://arxiv.org/abs/2404.00475</link><description>&lt;p&gt;
&#20813;&#30123;&#20316;&#24330;&#25293;&#21334;
&lt;/p&gt;
&lt;p&gt;
Shill-Proof Auctions
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2404.00475
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#20813;&#30123;&#20316;&#24330;&#30340;&#25293;&#21334;&#24418;&#24335;&#65292;&#21457;&#29616;&#33655;&#20848;&#24335;&#25293;&#21334;&#65288;&#35774;&#26377;&#36866;&#24403;&#20445;&#30041;&#20215;&#65289;&#26159;&#21807;&#19968;&#30340;&#26368;&#20248;&#19988;&#24378;&#20813;&#30123;&#20316;&#24330;&#30340;&#25293;&#21334;&#65292;&#21516;&#26102;&#33655;&#20848;&#24335;&#25293;&#21334;&#65288;&#27809;&#26377;&#20445;&#30041;&#20215;&#65289;&#26159;&#21807;&#19968;&#21516;&#26102;&#39640;&#25928;&#21644;&#24369;&#20813;&#30123;&#20316;&#24330;&#30340;&#20808;&#39564;&#29420;&#31435;&#25293;&#21334;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#21333;&#21697;&#25293;&#21334;&#20013;&#65292;&#19968;&#20010;&#27450;&#35784;&#24615;&#30340;&#21334;&#23478;&#21487;&#33021;&#20250;&#20266;&#35013;&#25104;&#19968;&#20010;&#25110;&#22810;&#20010;&#31454;&#26631;&#32773;&#65292;&#20197;&#25805;&#32437;&#25104;&#20132;&#20215;&#26684;&#12290;&#26412;&#25991;&#23545;&#37027;&#20123;&#20813;&#30123;&#20316;&#24330;&#30340;&#25293;&#21334;&#26684;&#24335;&#36827;&#34892;&#20102;&#34920;&#24449;&#65306;&#19968;&#20010;&#21033;&#28070;&#26368;&#22823;&#21270;&#30340;&#21334;&#23478;&#27809;&#26377;&#20219;&#20309;&#21160;&#26426;&#25552;&#20132;&#20219;&#20309;&#34394;&#20551;&#25253;&#20215;&#12290;&#25105;&#20204;&#21306;&#20998;&#20102;&#24378;&#20813;&#30123;&#20316;&#24330;&#65292;&#21363;&#19968;&#20010;&#20102;&#35299;&#31454;&#26631;&#32773;&#20272;&#20540;&#30340;&#21334;&#23478;&#27704;&#36828;&#26080;&#27861;&#20174;&#20316;&#24330;&#20013;&#33719;&#21033;&#65292;&#21644;&#24369;&#20813;&#30123;&#20316;&#24330;&#65292;&#23427;&#20165;&#35201;&#27714;&#20174;&#20316;&#24330;&#20013;&#24471;&#21040;&#30340;&#24179;&#34913;&#39044;&#26399;&#21033;&#28070;&#20026;&#38750;&#27491;&#12290;&#33655;&#20848;&#24335;&#25293;&#21334;&#65288;&#35774;&#26377;&#36866;&#24403;&#20445;&#30041;&#20215;&#65289;&#26159;&#21807;&#19968;&#30340;&#26368;&#20248;&#21644;&#24378;&#20813;&#30123;&#20316;&#24330;&#25293;&#21334;&#12290;&#27492;&#22806;&#65292;&#33655;&#20848;&#24335;&#25293;&#21334;&#65288;&#27809;&#26377;&#20445;&#30041;&#20215;&#65289;&#26159;&#21807;&#19968;&#30340;&#20855;&#26377;&#20808;&#39564;&#29420;&#31435;&#24615;&#30340;&#25293;&#21334;&#65292;&#26082;&#39640;&#25928;&#21448;&#24369;&#20813;&#30123;&#20316;&#24330;&#12290;&#34429;&#28982;&#23384;&#22312;&#22810;&#31181;&#31574;&#30053;&#35777;&#26126;&#12289;&#24369;&#20813;&#30123;&#20316;&#24330;&#21644;&#26368;&#20248;&#25293;&#21334;&#65307;&#20219;&#20309;&#26368;&#20248;&#25293;&#21334;&#21482;&#33021;&#28385;&#36275;&#38598;&#21512; {&#38745;&#24577;&#12289;&#31574;&#30053;&#35777;&#26126;&#12289;&#24369;&#20813;&#30123;&#20316;&#24330;} &#20013;&#30340;&#20004;&#20010;&#24615;&#36136;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2404.00475v1 Announce Type: new  Abstract: In a single-item auction, a duplicitous seller may masquerade as one or more bidders in order to manipulate the clearing price. This paper characterizes auction formats that are shill-proof: a profit-maximizing seller has no incentive to submit any shill bids. We distinguish between strong shill-proofness, in which a seller with full knowledge of bidders' valuations can never profit from shilling, and weak shill-proofness, which requires only that the expected equilibrium profit from shilling is nonpositive. The Dutch auction (with suitable reserve) is the unique optimal and strongly shill-proof auction. Moreover, the Dutch auction (with no reserve) is the unique prior-independent auction that is both efficient and weakly shill-proof. While there are a multiplicity of strategy-proof, weakly shill-proof, and optimal auctions; any optimal auction can satisfy only two properties in the set {static, strategy-proof, weakly shill-proof}.
&lt;/p&gt;</description></item><item><title>&#23398;&#20064;&#21033;&#29992;&#35266;&#27979;&#25968;&#25454;&#25552;&#20986;&#20102;&#19968;&#31181;&#36880;&#27493;&#21452;&#37325;&#24378;&#20581;&#26041;&#27861;&#65292;&#36890;&#36807;&#21521;&#21518;&#24402;&#32435;&#35299;&#20915;&#20102;&#26368;&#20339;&#21160;&#24577;&#27835;&#30103;&#26041;&#26696;&#30340;&#38382;&#39064;</title><link>https://arxiv.org/abs/2404.00221</link><description>&lt;p&gt;
&#21033;&#29992;&#35266;&#27979;&#25968;&#25454;&#36827;&#34892;&#24378;&#20581;&#23398;&#20064;&#20197;&#33719;&#24471;&#26368;&#20339;&#21160;&#24577;&#27835;&#30103;&#26041;&#26696;
&lt;/p&gt;
&lt;p&gt;
Robust Learning for Optimal Dynamic Treatment Regimes with Observational Data
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2404.00221
&lt;/p&gt;
&lt;p&gt;
&#23398;&#20064;&#21033;&#29992;&#35266;&#27979;&#25968;&#25454;&#25552;&#20986;&#20102;&#19968;&#31181;&#36880;&#27493;&#21452;&#37325;&#24378;&#20581;&#26041;&#27861;&#65292;&#36890;&#36807;&#21521;&#21518;&#24402;&#32435;&#35299;&#20915;&#20102;&#26368;&#20339;&#21160;&#24577;&#27835;&#30103;&#26041;&#26696;&#30340;&#38382;&#39064;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35768;&#22810;&#20844;&#20849;&#25919;&#31574;&#21644;&#21307;&#30103;&#24178;&#39044;&#28041;&#21450;&#20854;&#27835;&#30103;&#20998;&#37197;&#20013;&#30340;&#21160;&#24577;&#24615;&#65292;&#27835;&#30103;&#36890;&#24120;&#20381;&#25454;&#20808;&#21069;&#27835;&#30103;&#30340;&#21382;&#21490;&#21644;&#30456;&#20851;&#29305;&#24449;&#23545;&#27599;&#20010;&#38454;&#27573;&#30340;&#25928;&#26524;&#20855;&#26377;&#24322;&#36136;&#24615;&#12290;&#26412;&#25991;&#30740;&#31350;&#20102;&#32479;&#35745;&#23398;&#20064;&#26368;&#20339;&#21160;&#24577;&#27835;&#30103;&#26041;&#26696;(DTR)&#65292;&#26681;&#25454;&#20010;&#20307;&#30340;&#21382;&#21490;&#25351;&#23548;&#27599;&#20010;&#38454;&#27573;&#30340;&#26368;&#20339;&#27835;&#30103;&#20998;&#37197;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#35266;&#27979;&#25968;&#25454;&#30340;&#36880;&#27493;&#21452;&#37325;&#24378;&#20581;&#26041;&#27861;&#65292;&#22312;&#39034;&#24207;&#21487;&#24573;&#30053;&#24615;&#20551;&#35774;&#19979;&#23398;&#20064;&#26368;&#20339;DTR&#12290;&#35813;&#26041;&#27861;&#36890;&#36807;&#21521;&#21518;&#24402;&#32435;&#35299;&#20915;&#20102;&#39034;&#24207;&#27835;&#30103;&#20998;&#37197;&#38382;&#39064;&#65292;&#22312;&#27599;&#19968;&#27493;&#20013;&#65292;&#25105;&#20204;&#32467;&#21512;&#20542;&#21521;&#35780;&#20998;&#21644;&#34892;&#21160;&#20540;&#20989;&#25968;(Q&#20989;&#25968;)&#30340;&#20272;&#35745;&#37327;&#65292;&#26500;&#24314;&#20102;&#25919;&#31574;&#20215;&#20540;&#30340;&#22686;&#24378;&#21453;&#21521;&#27010;&#29575;&#21152;&#26435;&#20272;&#35745;&#37327;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2404.00221v1 Announce Type: cross  Abstract: Many public policies and medical interventions involve dynamics in their treatment assignments, where treatments are sequentially assigned to the same individuals across multiple stages, and the effect of treatment at each stage is usually heterogeneous with respect to the history of prior treatments and associated characteristics. We study statistical learning of optimal dynamic treatment regimes (DTRs) that guide the optimal treatment assignment for each individual at each stage based on the individual's history. We propose a step-wise doubly-robust approach to learn the optimal DTR using observational data under the assumption of sequential ignorability. The approach solves the sequential treatment assignment problem through backward induction, where, at each step, we combine estimators of propensity scores and action-value functions (Q-functions) to construct augmented inverse probability weighting estimators of values of policies 
&lt;/p&gt;</description></item><item><title>&#26126;&#30830;&#20026;&#36127;&#38754;&#20914;&#20987;&#21487;&#20197;&#22686;&#21152;&#21592;&#24037;&#30041;&#20219;&#65292;&#36890;&#36807;&#35774;&#22791;&#30456;&#20851;&#30340;&#20914;&#20987;&#23548;&#33268;&#21592;&#24037;&#23545;&#20844;&#21496;&#30340;&#24773;&#24863;&#25215;&#35834;&#22686;&#21152;&#65292;&#31361;&#20986;&#20102;&#28608;&#21169;&#19968;&#33268;&#24615;&#22312;&#20914;&#20987;&#36716;&#21270;&#20026;&#30041;&#20219;&#20013;&#30340;&#20851;&#38190;&#20316;&#29992;&#12290;</title><link>https://arxiv.org/abs/2404.00183</link><description>&lt;p&gt;
&#20998;&#20139;&#22256;&#22659;&#22686;&#24378;&#32852;&#31995;&#65306;&#36127;&#38754;&#20914;&#20987;&#12289;&#20869;&#23884;&#24615;&#21644;&#21592;&#24037;&#30041;&#20219;
&lt;/p&gt;
&lt;p&gt;
Shared Hardships Strengthen Bonds: Negative Shocks, Embeddedness and Employee Retention
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2404.00183
&lt;/p&gt;
&lt;p&gt;
&#26126;&#30830;&#20026;&#36127;&#38754;&#20914;&#20987;&#21487;&#20197;&#22686;&#21152;&#21592;&#24037;&#30041;&#20219;&#65292;&#36890;&#36807;&#35774;&#22791;&#30456;&#20851;&#30340;&#20914;&#20987;&#23548;&#33268;&#21592;&#24037;&#23545;&#20844;&#21496;&#30340;&#24773;&#24863;&#25215;&#35834;&#22686;&#21152;&#65292;&#31361;&#20986;&#20102;&#28608;&#21169;&#19968;&#33268;&#24615;&#22312;&#20914;&#20987;&#36716;&#21270;&#20026;&#30041;&#20219;&#20013;&#30340;&#20851;&#38190;&#20316;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24847;&#22806;&#20107;&#20214;&#8212;&#8212;&#8220;&#20914;&#20987;&#8221;&#8212;&#8212;&#26159;&#35299;&#37322;&#20869;&#23884;&#24615;&#21644;&#21592;&#24037;&#30041;&#20219;&#21464;&#21270;&#30340;&#21160;&#21147;&#65292;&#22312;&#21171;&#21160;&#21147;&#27969;&#21160;&#30340;&#19981;&#26029;&#28436;&#21464;&#27169;&#22411;&#20013;&#21457;&#25381;&#20316;&#29992;&#12290;&#22823;&#37327;&#30740;&#31350;&#21162;&#21147;&#25506;&#35752;&#22914;&#20309;&#35753;&#21463;&#37325;&#35270;&#30340;&#21592;&#24037;&#20813;&#21463;&#19981;&#21033;&#20914;&#20987;&#12290;&#28982;&#32780;&#65292;&#26412;&#25991;&#25552;&#20379;&#23454;&#35777;&#35777;&#25454;&#34920;&#26126;&#65292;&#24403;&#20844;&#21496;&#21644;&#21592;&#24037;&#19982;&#36825;&#20123;&#20914;&#20987;&#30456;&#20851;&#30340;&#28608;&#21169;&#30456;&#19968;&#33268;&#26102;&#65292;&#26126;&#30830;&#20026;&#36127;&#38754;&#20914;&#20987;&#21487;&#20197;&#22686;&#21152;&#21592;&#24037;&#30041;&#20219;&#12290;&#36890;&#36807;&#23545;&#26469;&#33258;21&#23478;&#21345;&#36710;&#20844;&#21496;&#30340;466,236&#26465;&#36890;&#20449;&#35760;&#24405;&#21644;45,873&#27425;&#23601;&#19994;&#35760;&#24405;&#30340;&#29420;&#29305;&#25968;&#25454;&#38598;&#36827;&#34892;&#29983;&#23384;&#20998;&#26512;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#35774;&#22791;&#30456;&#20851;&#30340;&#20914;&#20987;&#24448;&#24448;&#20250;&#24310;&#38271;&#23601;&#19994;&#26399;&#38480;&#12290; &#35774;&#22791;&#20914;&#20987;&#36824;&#20135;&#29983;&#30683;&#30462;&#30340;&#31215;&#26497;&#24773;&#32490;&#65292;&#34920;&#26126;&#21592;&#24037;&#23545;&#20844;&#21496;&#30340;&#24773;&#24863;&#25215;&#35834;&#22686;&#21152;&#12290;&#25105;&#20204;&#30340;&#32467;&#26524;&#31361;&#20986;&#20102;&#28608;&#21169;&#19968;&#33268;&#24615;&#22312;&#20914;&#20987;&#26368;&#32456;&#22914;&#20309;&#36716;&#21270;&#20026;&#30041;&#20219;&#20013;&#30340;&#37325;&#35201;&#35843;&#33410;&#20316;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2404.00183v1 Announce Type: new  Abstract: Unexpected events -- "shocks" -- are the motive force in explaining changes in embeddedness and retention within the unfolding model of labor turnover. Substantial research effort has examined strategies for insulating valued employees from adverse shocks. However, this paper provides empirical evidence that unambiguously negative shocks can increase employee retention when underlying firm and employee incentives with respect to these shocks are aligned. Using survival analysis on a unique data set of 466,236 communication records and 45,873 employment spells from 21 trucking companies, we show how equipment-related shocks tend to increase the duration of employment. Equipment shocks also generate paradoxically positive sentiments that demonstrate an increase in employees' affective commitment to the firm. Our results highlight the important moderating role aligned incentives have in how shocks ultimately translate into retention. Shared
&lt;/p&gt;</description></item><item><title>&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#20272;&#35745;&#22120;--&#36830;&#32493;&#21512;&#25104;&#30340;&#24046;&#24322;&#20110;&#24046;&#24322;(Sequential SDiD)&#65292;&#22312;&#20855;&#26377;&#20132;&#20114;&#20316;&#29992;&#22266;&#23450;&#25928;&#24212;&#30340;&#32447;&#24615;&#27169;&#22411;&#20013;&#20855;&#26377;&#29702;&#35770;&#24615;&#36136;&#65292;&#19988;&#22312;&#25928;&#29575;&#21644;&#27491;&#24577;&#24615;&#26041;&#38754;&#20855;&#26377;&#20445;&#35777;</title><link>https://arxiv.org/abs/2404.00164</link><description>&lt;p&gt;
&#36830;&#32493;&#21512;&#25104;&#30340;&#24046;&#24322;&#20110;&#24046;&#24322;
&lt;/p&gt;
&lt;p&gt;
Sequential Synthetic Difference in Differences
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2404.00164
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#20272;&#35745;&#22120;--&#36830;&#32493;&#21512;&#25104;&#30340;&#24046;&#24322;&#20110;&#24046;&#24322;(Sequential SDiD)&#65292;&#22312;&#20855;&#26377;&#20132;&#20114;&#20316;&#29992;&#22266;&#23450;&#25928;&#24212;&#30340;&#32447;&#24615;&#27169;&#22411;&#20013;&#20855;&#26377;&#29702;&#35770;&#24615;&#36136;&#65292;&#19988;&#22312;&#25928;&#29575;&#21644;&#27491;&#24577;&#24615;&#26041;&#38754;&#20855;&#26377;&#20445;&#35777;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#22312;&#20998;&#38454;&#27573;&#22788;&#29702;&#26041;&#26696;&#25512;&#20986;&#30340;&#29615;&#22659;&#20013;&#20272;&#35745;&#20108;&#20803;&#25919;&#31574;&#30340;&#27835;&#30103;&#25928;&#26524;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#20272;&#35745;&#37327;&#8212;&#8212;&#36830;&#32493;&#21512;&#25104;&#30340;&#24046;&#24322;&#20110;&#24046;&#24322;(Sequential SDiD)&#65292;&#24182;&#22312;&#20855;&#26377;&#20132;&#20114;&#20316;&#29992;&#22266;&#23450;&#25928;&#24212;&#30340;&#32447;&#24615;&#27169;&#22411;&#20013;&#24314;&#31435;&#20102;&#20854;&#29702;&#35770;&#24615;&#36136;&#12290;&#25105;&#20204;&#30340;&#20272;&#35745;&#22120;&#22522;&#20110;&#39034;&#24207;&#24212;&#29992;&#21407;&#22987;SDiD&#20272;&#35745;&#22120;&#21040;&#36866;&#24403;&#32858;&#21512;&#30340;&#25968;&#25454;&#19978;&#12290;&#20026;&#20102;&#24314;&#31435;&#25105;&#20204;&#26041;&#27861;&#30340;&#29702;&#35770;&#24615;&#36136;&#65292;&#25105;&#20204;&#23558;&#20854;&#19982;&#19968;&#31181;&#22522;&#20110;&#20114;&#21160;&#22266;&#23450;&#25928;&#24212;&#24352;&#25104;&#23376;&#31354;&#38388;&#30693;&#35782;&#30340;&#19981;&#21487;&#34892;OLS&#20272;&#35745;&#22120;&#36827;&#34892;&#27604;&#36739;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#36825;&#20010;OLS&#20272;&#35745;&#22120;&#20855;&#26377;&#39034;&#24207;&#34920;&#31034;&#65292;&#24182;&#21033;&#29992;&#36825;&#19968;&#32467;&#26524;&#34920;&#26126;&#23427;&#19982;&#36830;&#32493;SDiD&#20272;&#35745;&#22120;&#22312;&#28176;&#36817;&#24847;&#20041;&#19979;&#26159;&#31561;&#20215;&#30340;&#12290;&#36825;&#19968;&#32467;&#26524;&#24847;&#21619;&#30528;&#25105;&#20204;&#30340;&#20272;&#35745;&#22120;&#22312;&#28176;&#36817;&#24847;&#20041;&#19979;&#26159;&#27491;&#24577;&#30340;&#65292;&#24182;&#20855;&#26377;&#30456;&#24212;&#30340;&#25928;&#29575;&#20445;&#35777;&#12290;&#26412;&#25991;&#24320;&#21457;&#30340;&#26041;&#27861;&#21576;&#29616;&#20102;
&lt;/p&gt;
&lt;p&gt;
arXiv:2404.00164v1 Announce Type: new  Abstract: We study the estimation of treatment effects of a binary policy in environments with a staggered treatment rollout. We propose a new estimator -- Sequential Synthetic Difference in Difference (Sequential SDiD) -- and establish its theoretical properties in a linear model with interactive fixed effects. Our estimator is based on sequentially applying the original SDiD estimator proposed in Arkhangelsky et al. (2021) to appropriately aggregated data. To establish the theoretical properties of our method, we compare it to an infeasible OLS estimator based on the knowledge of the subspaces spanned by the interactive fixed effects. We show that this OLS estimator has a sequential representation and use this result to show that it is asymptotically equivalent to the Sequential SDiD estimator. This result implies the asymptotic normality of our estimator along with corresponding efficiency guarantees. The method developed in this paper presents
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#39318;&#27425;&#32771;&#34385;&#20102;&#36127;&#30456;&#20851;&#24615;&#21644;&#27491;&#30456;&#20851;&#24615;&#65292;&#26500;&#24314;&#20102;&#20013;&#22269;A&#32929;&#19978;&#24066;&#32929;&#31080;&#20043;&#38388;&#30340;&#21152;&#26435;&#26102;&#38388;&#21453;&#32593;&#32476;&#21644;&#32593;&#32476;&#65292;&#25581;&#31034;&#20102;&#22312;21&#19990;&#32426;&#21069;24&#24180;&#26399;&#38388;&#65288;&#21453;&#65289;&#32593;&#32476;&#20043;&#38388;&#33410;&#28857;&#24230;&#21644;&#24378;&#24230;&#12289;&#21516;&#37197;&#24615;&#31995;&#25968;&#12289;&#24179;&#22343;&#23616;&#37096;&#32858;&#31867;&#31995;&#25968;&#20197;&#21450;&#24179;&#22343;&#26368;&#30701;&#36335;&#24452;&#38271;&#24230;&#31561;&#26041;&#38754;&#30340;&#19968;&#20123;&#37325;&#35201;&#24046;&#24322;</title><link>https://arxiv.org/abs/2404.00028</link><description>&lt;p&gt;
&#20013;&#22269;A&#32929;&#20043;&#38388;&#30340;&#21453;&#32593;&#32476;
&lt;/p&gt;
&lt;p&gt;
Antinetwork among China A-shares
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2404.00028
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#39318;&#27425;&#32771;&#34385;&#20102;&#36127;&#30456;&#20851;&#24615;&#21644;&#27491;&#30456;&#20851;&#24615;&#65292;&#26500;&#24314;&#20102;&#20013;&#22269;A&#32929;&#19978;&#24066;&#32929;&#31080;&#20043;&#38388;&#30340;&#21152;&#26435;&#26102;&#38388;&#21453;&#32593;&#32476;&#21644;&#32593;&#32476;&#65292;&#25581;&#31034;&#20102;&#22312;21&#19990;&#32426;&#21069;24&#24180;&#26399;&#38388;&#65288;&#21453;&#65289;&#32593;&#32476;&#20043;&#38388;&#33410;&#28857;&#24230;&#21644;&#24378;&#24230;&#12289;&#21516;&#37197;&#24615;&#31995;&#25968;&#12289;&#24179;&#22343;&#23616;&#37096;&#32858;&#31867;&#31995;&#25968;&#20197;&#21450;&#24179;&#22343;&#26368;&#30701;&#36335;&#24452;&#38271;&#24230;&#31561;&#26041;&#38754;&#30340;&#19968;&#20123;&#37325;&#35201;&#24046;&#24322;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22522;&#20110;&#28072;&#36300;&#24133;&#26102;&#38388;&#24207;&#21015;&#20043;&#38388;&#30340;&#30456;&#20851;&#20851;&#31995;&#26500;&#24314;&#30340;&#37329;&#34701;&#32593;&#32476;&#24471;&#21040;&#20102;&#24191;&#27867;&#30740;&#31350;&#12290;&#28982;&#32780;&#65292;&#36825;&#20123;&#30740;&#31350;&#24573;&#35270;&#20102;&#36127;&#30456;&#20851;&#24615;&#30340;&#37325;&#35201;&#24615;&#12290;&#26412;&#25991;&#39318;&#27425;&#32771;&#34385;&#20102;&#36127;&#30456;&#20851;&#24615;&#21644;&#27491;&#30456;&#20851;&#24615;&#65292;&#24182;&#30456;&#24212;&#22320;&#26500;&#24314;&#20102;&#19978;&#28023;&#21644;&#28145;&#22323;&#35777;&#21048;&#20132;&#26131;&#25152;&#19978;&#24066;&#32929;&#31080;&#20043;&#38388;&#30340;&#21152;&#26435;&#26102;&#38388;&#21453;&#32593;&#32476;&#21644;&#32593;&#32476;&#12290;&#23545;21&#19990;&#32426;&#21069;24&#24180;&#30340;(&#21453;)&#32593;&#32476;&#65292;&#31995;&#32479;&#20998;&#26512;&#20102;&#33410;&#28857;&#30340;&#24230;&#21644;&#24378;&#24230;&#12289;&#21516;&#37197;&#24615;&#31995;&#25968;&#12289;&#24179;&#22343;&#23616;&#37096;&#32858;&#31867;&#31995;&#25968;&#21644;&#24179;&#22343;&#26368;&#30701;&#36335;&#24452;&#38271;&#24230;&#12290;&#26412;&#25991;&#25581;&#31034;&#20102;&#36825;&#20123;&#25299;&#25169;&#27979;&#37327;&#25351;&#26631;&#22312;&#21453;&#32593;&#32476;&#21644;&#32593;&#32476;&#20043;&#38388;&#30340;&#19968;&#20123;&#22522;&#26412;&#24046;&#24322;&#12290;&#36825;&#20123;&#24046;&#24322;&#30340;&#21457;&#29616;&#22312;&#29702;&#35299;
&lt;/p&gt;
&lt;p&gt;
arXiv:2404.00028v1 Announce Type: cross  Abstract: The correlation-based financial networks, constructed with the correlation relationships among the time series of fluctuations of daily logarithmic prices of stocks, are intensively studied. However, these studies ignore the importance of negative correlations. This paper is the first time to consider the negative and positive correlations separately, and accordingly to construct weighted temporal antinetwork and network among stocks listed in the Shanghai and Shenzhen stock exchanges. For (anti)networks during the first 24 years of the 21st century, the node's degree and strength, the assortativity coefficient, the average local clustering coefficient, and the average shortest path length are analyzed systematically. This paper unveils some essential differences in these topological measurements between antinetwork and network. The findings of the differences between antinetwork and network have an important role in understanding the 
&lt;/p&gt;</description></item><item><title>&#30740;&#31350;&#21457;&#29616;&#65292;&#23545;&#20110;&#19968;&#20010;agent&#30340;&#20915;&#31574;&#38382;&#39064;&#65292;&#36890;&#36807;&#19968;&#23450;&#25968;&#37327;&#30340;&#25490;&#24207;&#25968;&#25454;&#21487;&#20197;&#35782;&#21035;&#20854;&#26080;&#25903;&#37197;&#34892;&#21160;&#38598;&#21644;&#20351;&#27599;&#20010;&#34892;&#21160;&#26368;&#20248;&#30340;&#20449;&#24565;&#65292;&#32780;&#36890;&#36807;&#23569;&#37327;&#22522;&#25968;&#25968;&#25454;&#21487;&#20197;&#30830;&#23450;&#20854;&#25928;&#29992;&#20989;&#25968;&#12290;</title><link>https://arxiv.org/abs/2403.06344</link><description>&lt;p&gt;
&#33021;&#21542;&#36890;&#36807;&#22768;&#38899;&#20102;&#35299;&#19968;&#20010;&#20915;&#31574;&#38382;&#39064;&#30340;&#24418;&#29366;
&lt;/p&gt;
&lt;p&gt;
Can One Hear the Shape of a Decision Problem?
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.06344
&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#21457;&#29616;&#65292;&#23545;&#20110;&#19968;&#20010;agent&#30340;&#20915;&#31574;&#38382;&#39064;&#65292;&#36890;&#36807;&#19968;&#23450;&#25968;&#37327;&#30340;&#25490;&#24207;&#25968;&#25454;&#21487;&#20197;&#35782;&#21035;&#20854;&#26080;&#25903;&#37197;&#34892;&#21160;&#38598;&#21644;&#20351;&#27599;&#20010;&#34892;&#21160;&#26368;&#20248;&#30340;&#20449;&#24565;&#65292;&#32780;&#36890;&#36807;&#23569;&#37327;&#22522;&#25968;&#25968;&#25454;&#21487;&#20197;&#30830;&#23450;&#20854;&#25928;&#29992;&#20989;&#25968;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25506;&#35752;&#20102;&#19968;&#20010;agent&#30340;&#20915;&#31574;&#38382;&#39064;&#19982;&#22905;&#23545;&#20449;&#24687;&#32467;&#26500;&#30340;&#25490;&#21517;&#20043;&#38388;&#30340;&#32852;&#31995;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#26377;&#38480;&#25968;&#37327;&#30340;agent&#23545;&#23454;&#39564;&#25490;&#24207;&#30340;&#24207;&#25968;&#25968;&#25454;&#36275;&#20197;&#30830;&#23450;&#22905;&#30340;&#65288;&#26377;&#38480;&#65289;&#26080;&#25903;&#37197;&#34892;&#21160;&#38598;&#65288;&#36890;&#36807;&#37325;&#26032;&#26631;&#35760;&#21644;&#22797;&#21046;&#65289;&#20197;&#21450;&#20351;&#27599;&#20010;&#36825;&#26679;&#30340;&#34892;&#21160;&#26368;&#20248;&#30340;&#20449;&#24565;&#12290;&#39069;&#22806;&#30340;&#23569;&#37327;&#22522;&#25968;&#25968;&#25454;&#65292;&#23558;&#30456;&#23545;&#22320;&#35780;&#20272;agent&#23545;&#26377;&#38480;&#23545;&#23454;&#39564;&#30340;&#25968;&#23545;&#30340;&#20215;&#20540;&#65292;&#21487;&#20197;&#30830;&#23450;&#22905;&#30340;&#25928;&#29992;&#20989;&#25968;&#65292;&#30452;&#21040;&#19981;&#21463;&#34892;&#21160;&#29420;&#31435;&#30340;&#25903;&#20184;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.06344v1 Announce Type: new  Abstract: We explore the connection between an agent's decision problem and her ranking of information structures. We find that a finite amount of ordinal data on the agent's ranking of experiments is enough to identify her (finite) set of undominated actions (up to relabeling and duplication) and the beliefs rendering each such action optimal. An additional smattering of cardinal data, comparing the relative value to the agent of finitely many pairs of experiments, identifies her utility function up to an action-independent payoff.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#20110;&#23450;&#37327;&#31354;&#38388;&#27169;&#22411;&#20013;&#22788;&#29702;&#21453;&#20107;&#23454;&#19981;&#30830;&#23450;&#24615;&#30340;&#26041;&#27861;&#65292;&#21033;&#29992;&#32463;&#39564;&#36125;&#21494;&#26031;&#26041;&#27861;&#37327;&#21270;&#19981;&#30830;&#23450;&#24615;&#65292;&#24182;&#22312;&#20004;&#20010;&#24212;&#29992;&#31243;&#24207;&#20013;&#21457;&#29616;&#20102;&#26377;&#20851;&#21453;&#20107;&#23454;&#30340;&#38750;&#24179;&#20961;&#19981;&#30830;&#23450;&#24615;&#12290;</title><link>https://arxiv.org/abs/2311.14032</link><description>&lt;p&gt;
&#23450;&#37327;&#31354;&#38388;&#27169;&#22411;&#20013;&#30340;&#21453;&#20107;&#23454;&#25935;&#24863;&#24615;
&lt;/p&gt;
&lt;p&gt;
Counterfactual Sensitivity in Quantitative Spatial Models
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2311.14032
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#20110;&#23450;&#37327;&#31354;&#38388;&#27169;&#22411;&#20013;&#22788;&#29702;&#21453;&#20107;&#23454;&#19981;&#30830;&#23450;&#24615;&#30340;&#26041;&#27861;&#65292;&#21033;&#29992;&#32463;&#39564;&#36125;&#21494;&#26031;&#26041;&#27861;&#37327;&#21270;&#19981;&#30830;&#23450;&#24615;&#65292;&#24182;&#22312;&#20004;&#20010;&#24212;&#29992;&#31243;&#24207;&#20013;&#21457;&#29616;&#20102;&#26377;&#20851;&#21453;&#20107;&#23454;&#30340;&#38750;&#24179;&#20961;&#19981;&#30830;&#23450;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#23450;&#37327;&#31354;&#38388;&#27169;&#22411;&#20013;&#30340;&#21453;&#20107;&#23454;&#26159;&#24403;&#21069;&#19990;&#30028;&#29366;&#24577;&#21644;&#27169;&#22411;&#21442;&#25968;&#30340;&#20989;&#25968;&#12290;&#24403;&#21069;&#20570;&#27861;&#23558;&#24403;&#21069;&#19990;&#30028;&#29366;&#24577;&#35270;&#20026;&#23436;&#20840;&#21487;&#35266;&#27979;&#65292;&#20294;&#25105;&#20204;&#26377;&#20805;&#20998;&#29702;&#30001;&#30456;&#20449;&#23384;&#22312;&#27979;&#37327;&#35823;&#24046;&#12290;&#26412;&#25991;&#25552;&#20379;&#20102;&#19968;&#31181;&#24037;&#20855;&#65292;&#29992;&#20110;&#22312;&#24403;&#21069;&#19990;&#30028;&#29366;&#24577;&#23384;&#22312;&#27979;&#37327;&#35823;&#24046;&#26102;&#37327;&#21270;&#20851;&#20110;&#21453;&#20107;&#23454;&#30340;&#19981;&#30830;&#23450;&#24615;&#12290;&#25105;&#25512;&#33616;&#19968;&#31181;&#32463;&#39564;&#36125;&#21494;&#26031;&#26041;&#27861;&#29992;&#20110;&#19981;&#30830;&#23450;&#24615;&#37327;&#21270;&#65292;&#36825;&#26082;&#23454;&#29992;&#21448;&#22312;&#29702;&#35770;&#19978;&#34987;&#35777;&#26126;&#20102;&#12290;&#25105;&#23558;&#25152;&#25552;&#20986;&#30340;&#26041;&#27861;&#24212;&#29992;&#20110;Adao, Costinot&#21644;Donaldson (2017)&#20197;&#21450;Allen&#21644;Arkolakis (2022)&#30340;&#24212;&#29992;&#20013;&#65292;&#24182;&#21457;&#29616;&#26377;&#20851;&#21453;&#20107;&#23454;&#30340;&#38750;&#24179;&#20961;&#19981;&#30830;&#23450;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2311.14032v2 Announce Type: replace  Abstract: Counterfactuals in quantitative spatial models are functions of the current state of the world and the model parameters. Current practice treats the current state of the world as perfectly observed, but there is good reason to believe that it is measured with error. This paper provides tools for quantifying uncertainty about counterfactuals when the current state of the world is measured with error. I recommend an empirical Bayes approach to uncertainty quantification, which is both practical and theoretically justified. I apply the proposed method to the applications in Adao, Costinot, and Donaldson (2017) and Allen and Arkolakis (2022) and find non-trivial uncertainty about counterfactuals.
&lt;/p&gt;</description></item><item><title>&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#20462;&#27491;&#32447;&#24615;&#21333;&#20803;&#65288;ReLU&#65289;&#30340;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#65288;DNN&#65289;&#26041;&#27861;&#65292;&#36890;&#36807;&#25552;&#20379;&#26356;&#22810;&#36879;&#26126;&#24615;&#12289;&#23450;&#20041;&#19981;&#21516;&#31867;&#22411;&#30340;&#31232;&#30095;&#24615;&#12289;&#23637;&#31034;&#21487;&#21306;&#20998;&#24615;&#12289;&#25351;&#20986;&#26377;&#25928;&#21442;&#25968;&#38598;&#21644;&#25552;&#20379;ReLU&#30340;&#26032;&#21464;&#20307;&#31561;&#26041;&#24335;&#20026;DNN&#35774;&#35745;&#20570;&#20986;&#36129;&#29486;&#65292;&#24182;&#24314;&#31435;&#20102;&#28176;&#36817;&#24615;&#36136;&#21644;&#25512;&#26029;&#30340;&#21487;&#34892;&#31243;&#24207;&#12290;</title><link>https://arxiv.org/abs/2311.02789</link><description>&lt;p&gt;
&#19968;&#31867;&#24191;&#20041;&#20998;&#23618;&#27169;&#22411;&#30340;&#20272;&#35745;&#21644;&#25512;&#26029;
&lt;/p&gt;
&lt;p&gt;
Estimation and Inference for a Class of Generalized Hierarchical Models
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2311.02789
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#20462;&#27491;&#32447;&#24615;&#21333;&#20803;&#65288;ReLU&#65289;&#30340;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#65288;DNN&#65289;&#26041;&#27861;&#65292;&#36890;&#36807;&#25552;&#20379;&#26356;&#22810;&#36879;&#26126;&#24615;&#12289;&#23450;&#20041;&#19981;&#21516;&#31867;&#22411;&#30340;&#31232;&#30095;&#24615;&#12289;&#23637;&#31034;&#21487;&#21306;&#20998;&#24615;&#12289;&#25351;&#20986;&#26377;&#25928;&#21442;&#25968;&#38598;&#21644;&#25552;&#20379;ReLU&#30340;&#26032;&#21464;&#20307;&#31561;&#26041;&#24335;&#20026;DNN&#35774;&#35745;&#20570;&#20986;&#36129;&#29486;&#65292;&#24182;&#24314;&#31435;&#20102;&#28176;&#36817;&#24615;&#36136;&#21644;&#25512;&#26029;&#30340;&#21487;&#34892;&#31243;&#24207;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#36825;&#31687;&#35770;&#25991;&#20013;&#65292;&#25105;&#20204;&#32771;&#34385;&#20102;&#19968;&#31867;&#24191;&#20041;&#20998;&#23618;&#27169;&#22411;&#20013;&#28041;&#21450;&#30340;&#26410;&#30693;&#21442;&#25968;&#21644;&#20989;&#25968;&#30340;&#20272;&#35745;&#21644;&#25512;&#26029;&#12290;&#36825;&#20123;&#27169;&#22411;&#22312;&#31070;&#32463;&#32593;&#32476;&#39046;&#22495;&#65288;&#22914;Bauer&#21644;Kohler, 2019&#65289;&#30340;&#25991;&#29486;&#20013;&#20855;&#26377;&#37325;&#35201;&#24847;&#20041;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#22522;&#20110;&#20462;&#27491;&#32447;&#24615;&#21333;&#20803;&#65288;ReLU&#65289;&#30340;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#65288;DNN&#65289;&#26041;&#27861;&#65292;&#24182;&#36890;&#36807;i&#65289;&#25552;&#20379;&#26356;&#22810;&#36879;&#26126;&#24615;&#65292;ii&#65289;&#23450;&#20041;&#19981;&#21516;&#31867;&#22411;&#30340;&#31232;&#30095;&#24615;&#65292;iii&#65289;&#23637;&#31034;&#21487;&#21306;&#20998;&#24615;&#65292;iv&#65289;&#25351;&#20986;&#26377;&#25928;&#21442;&#25968;&#38598;&#65292;&#20197;&#21450;v&#65289;&#25552;&#20379;&#20462;&#27491;&#32447;&#24615;&#28608;&#27963;&#20989;&#25968;&#65288;ReLU&#65289;&#30340;&#26032;&#21464;&#20307;&#31561;&#26041;&#38754;&#65292;&#20026;DNN&#30340;&#35774;&#35745;&#20570;&#20986;&#20102;&#36129;&#29486;&#12290;&#30456;&#24212;&#22320;&#24314;&#31435;&#20102;&#28176;&#36817;&#24615;&#36136;&#65292;&#24182;&#25552;&#20986;&#20102;&#29992;&#20110;&#25512;&#26029;&#30340;&#21487;&#34892;&#31243;&#24207;&#12290;&#25105;&#20204;&#36827;&#34892;&#20102;&#22823;&#37327;&#30340;&#25968;&#20540;&#30740;&#31350;&#65292;&#20197;&#26816;&#39564;&#20272;&#35745;&#26041;&#27861;&#30340;&#26377;&#38480;&#26679;&#26412;&#24615;&#33021;&#65292;&#24182;&#35780;&#20272;&#20102;&#32463;&#39564;&#30340;&#30456;&#20851;&#24615;&#21644;&#36866;&#29992;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2311.02789v4 Announce Type: replace  Abstract: In this paper, we consider estimation and inference for the unknown parameters and function involved in a class of generalized hierarchical models. Such models are of great interest in the literature of neural networks (such as Bauer and Kohler, 2019). We propose a rectified linear unit (ReLU) based deep neural network (DNN) approach, and contribute to the design of DNN by i) providing more transparency for practical implementation, ii) defining different types of sparsity, iii) showing the differentiability, iv) pointing out the set of effective parameters, and v) offering a new variant of rectified linear activation function (ReLU), etc. Asymptotic properties are established accordingly, and a feasible procedure for the purpose of inference is also proposed. We conduct extensive numerical studies to examine the finite-sample performance of the estimation methods, and we also evaluate the empirical relevance and applicability of the
&lt;/p&gt;</description></item><item><title>&#20998;&#26512;&#20102;&#22312;&#21333;&#23792;&#21644;&#21333;&#35895;&#20559;&#22909;&#39046;&#22495;&#20013;&#23450;&#20301;&#20844;&#20849;&#35774;&#26045;&#30340;&#31574;&#30053;&#24615;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#25152;&#26377;&#26080;&#20316;&#24330;&#35268;&#21017;&#30340;&#29305;&#24449;&#65292;&#24182;&#23637;&#31034;&#20102;&#23427;&#20204;&#21487;&#20197;&#20998;&#35299;&#20026;&#20004;&#20010;&#27493;&#39588;&#12290;</title><link>https://arxiv.org/abs/2303.05781</link><description>&lt;p&gt;
&#20855;&#26377;&#21333;&#23792;&#21644;&#21333;&#35895;&#20559;&#22909;&#30340;&#26080;&#20316;&#24330;&#31574;&#30053;&#24615;&#38382;&#39064;
&lt;/p&gt;
&lt;p&gt;
Strategy-proofness with single-peaked and single-dipped preferences
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2303.05781
&lt;/p&gt;
&lt;p&gt;
&#20998;&#26512;&#20102;&#22312;&#21333;&#23792;&#21644;&#21333;&#35895;&#20559;&#22909;&#39046;&#22495;&#20013;&#23450;&#20301;&#20844;&#20849;&#35774;&#26045;&#30340;&#31574;&#30053;&#24615;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#25152;&#26377;&#26080;&#20316;&#24330;&#35268;&#21017;&#30340;&#29305;&#24449;&#65292;&#24182;&#23637;&#31034;&#20102;&#23427;&#20204;&#21487;&#20197;&#20998;&#35299;&#20026;&#20004;&#20010;&#27493;&#39588;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#20998;&#26512;&#20102;&#22312;&#31038;&#20250;&#35268;&#21010;&#32773;&#20102;&#35299;&#27599;&#20010;&#20195;&#29702;&#20154;&#20559;&#22909;&#31867;&#22411;&#65288;&#21333;&#23792;&#25110;&#21333;&#35895;&#65289;&#30340;&#24773;&#20917;&#19979;&#65292;&#22312;&#20855;&#26377;&#21333;&#23792;&#21644;&#21333;&#35895;&#20559;&#22909;&#30340;&#39046;&#22495;&#20013;&#23450;&#20301;&#20844;&#20849;&#35774;&#26045;&#30340;&#38382;&#39064;&#12290;&#25105;&#20204;&#30340;&#20027;&#35201;&#32467;&#26524;&#21051;&#30011;&#20102;&#25152;&#26377;&#26080;&#20316;&#24330;&#35268;&#21017;&#65292;&#24182;&#26174;&#31034;&#23427;&#20204;&#21487;&#20197;&#20998;&#35299;&#20026;&#20004;&#20010;&#27493;&#39588;&#12290;&#22312;&#31532;&#19968;&#27493;&#20013;&#65292;&#35201;&#27714;&#20855;&#26377;&#21333;&#23792;&#20559;&#22909;&#30340;&#20195;&#29702;&#20154;&#35828;&#26126;&#20854;&#23792;&#20540;&#65292;&#24182;&#38024;&#23545;&#27599;&#20010;&#25253;&#21578;&#30340;&#23792;&#20540;&#37197;&#32622;&#65292;&#26368;&#22810;&#39044;&#36873;&#20004;&#20010;&#22791;&#36873;&#26041;&#26696;&#12290;&#22312;&#31532;&#20108;&#27493;&#20013;&#65292;&#35201;&#27714;&#20855;&#26377;&#21333;&#35895;&#20559;&#22909;&#30340;&#20195;&#29702;&#20154;&#25581;&#31034;&#20854;&#35895;&#24213;&#65292;&#20197;&#23436;&#25104;&#22312;&#39044;&#36873;&#22791;&#36873;&#26041;&#26696;&#20043;&#38388;&#30340;&#20915;&#31574;&#12290;&#25105;&#20204;&#30340;&#32467;&#26524;&#25512;&#24191;&#20102;Moulin&#65288;1980&#65289;&#21644;Barber\`a&#19982;Jackson&#65288;1994&#65289;&#20851;&#20110;&#21333;&#23792;&#20559;&#22909;&#20197;&#21450;Manjunath&#65288;2014&#65289;&#20851;&#20110;&#21333;&#35895;&#20559;&#22909;&#30340;&#30740;&#31350;&#32467;&#26524;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#34920;&#26126;&#25152;&#26377;&#26080;&#20316;&#24330;&#35268;&#21017;&#20063;&#26159;&#32676;&#20307;&#26080;&#20316;&#24330;&#30340;&#65292;&#24182;&#20998;&#26512;&#20102;&#24085;&#32047;&#25176;&#25928;&#29575;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2303.05781v2 Announce Type: replace  Abstract: We analyze the problem of locating a public facility in a domain of single-peaked and single-dipped preferences when the social planner knows the type of preference (single-peaked or single-dipped) of each agent. Our main result characterizes all strategy-proof rules and shows that they can be decomposed into two steps. In the first step, the agents with single-peaked preferences are asked about their peaks and, for each profile of reported peaks, at most two alternatives are preselected. In the second step, the agents with single-dipped preferences are asked to reveal their dips to complete the decision between the preselected alternatives. Our result generalizes the findings of Moulin (1980) and Barber\`a and Jackson (1994) for single-peaked and of Manjunath (2014) for single-dipped preferences. Finally, we show that all strategy-proof rules are also group strategy-proof and analyze the implications of Pareto efficiency.
&lt;/p&gt;</description></item><item><title>&#24052;&#35199;&#22996;&#20869;&#29790;&#25289;&#38590;&#27665;&#21361;&#26426;&#23545;&#32599;&#36182;&#39532;&#24030;&#21171;&#21160;&#21147;&#24066;&#22330;&#30340;&#24433;&#21709;&#34920;&#26126;&#65292;&#34429;&#28982;&#24052;&#35199;&#20154;&#30340;&#26376;&#24037;&#36164;&#22686;&#21152;&#32422;2&#65285;&#65292;&#20294;&#20027;&#35201;&#21463;&#26080;&#38590;&#27665;&#21442;&#19982;&#30340;&#37096;&#38376;&#21644;&#32844;&#19994;&#24433;&#21709;&#65292;&#21516;&#26102;&#38750;&#27491;&#35268;&#24066;&#22330;&#20013;&#30340;&#31227;&#27665;&#25269;&#28040;&#20102;&#27491;&#35268;&#24066;&#22330;&#30340;&#26367;&#20195;&#25928;&#24212;&#12290;</title><link>https://arxiv.org/abs/2302.04201</link><description>&lt;p&gt;
&#24052;&#35199;&#22996;&#20869;&#29790;&#25289;&#38590;&#27665;&#21361;&#26426;&#23545;&#21171;&#21160;&#21147;&#24066;&#22330;&#30340;&#24433;&#21709;
&lt;/p&gt;
&lt;p&gt;
Labor Market Effects of the Venezuelan Refugee Crisis in Brazil
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2302.04201
&lt;/p&gt;
&lt;p&gt;
&#24052;&#35199;&#22996;&#20869;&#29790;&#25289;&#38590;&#27665;&#21361;&#26426;&#23545;&#32599;&#36182;&#39532;&#24030;&#21171;&#21160;&#21147;&#24066;&#22330;&#30340;&#24433;&#21709;&#34920;&#26126;&#65292;&#34429;&#28982;&#24052;&#35199;&#20154;&#30340;&#26376;&#24037;&#36164;&#22686;&#21152;&#32422;2&#65285;&#65292;&#20294;&#20027;&#35201;&#21463;&#26080;&#38590;&#27665;&#21442;&#19982;&#30340;&#37096;&#38376;&#21644;&#32844;&#19994;&#24433;&#21709;&#65292;&#21516;&#26102;&#38750;&#27491;&#35268;&#24066;&#22330;&#20013;&#30340;&#31227;&#27665;&#25269;&#28040;&#20102;&#27491;&#35268;&#24066;&#22330;&#30340;&#26367;&#20195;&#25928;&#24212;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#21033;&#29992;&#24052;&#35199;&#27491;&#24335;&#24037;&#20154;&#26222;&#36941;&#20351;&#29992;&#30340;&#34892;&#25919;&#38754;&#26495;&#25968;&#25454;&#65292;&#30740;&#31350;&#20102;&#22996;&#20869;&#29790;&#25289;&#21361;&#26426;&#23545;&#24052;&#35199;&#21171;&#21160;&#21147;&#24066;&#22330;&#30340;&#24433;&#21709;&#65292;&#37325;&#28857;&#20851;&#27880;&#36793;&#22659;&#24030;&#32599;&#36182;&#39532;&#12290;&#24046;&#24322;&#22788;&#29702;&#32467;&#26524;&#34920;&#26126;&#65292;&#32599;&#36182;&#39532;&#24030;&#30340;&#24052;&#35199;&#20154;&#26376;&#24037;&#36164;&#22686;&#38271;&#20102;&#32422;2&#65285;&#65292;&#20027;&#35201;&#26159;&#30001;&#37027;&#20123;&#20174;&#20107;&#27809;&#26377;&#38590;&#27665;&#21442;&#19982;&#30340;&#37096;&#38376;&#21644;&#32844;&#19994;&#30340;&#20154;&#39537;&#21160;&#30340;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#24052;&#35199;&#20154;&#20960;&#20046;&#27809;&#26377;&#22833;&#19994;&#65292;&#20294;&#21457;&#29616;&#26412;&#22320;&#24037;&#20154;&#36716;&#31227;&#21040;&#27809;&#26377;&#31227;&#27665;&#30340;&#32844;&#19994;&#12290;&#25105;&#20204;&#36824;&#21457;&#29616;&#65292;&#38750;&#27491;&#35268;&#24066;&#22330;&#20013;&#30340;&#31227;&#27665;&#25269;&#28040;&#20102;&#27491;&#35268;&#24066;&#22330;&#20013;&#30340;&#26367;&#20195;&#25928;&#24212;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2302.04201v2 Announce Type: replace  Abstract: We use administrative panel data on the universe of Brazilian formal workers to investigate the labor market effects of the Venezuelan crisis in Brazil, focusing on the border state of Roraima. The results using difference-in-differences show that the monthly wages of Brazilians in Roraima increased by around 2 percent, which was mostly driven by those working in sectors and occupations with no refugee involvement. The study finds negligible job displacement for Brazilians but finds evidence of native workers moving to occupations without immigrants. We also find that immigrants in the informal market offset the substitution effects in the formal market.
&lt;/p&gt;</description></item><item><title>&#22522;&#20110;&#27431;&#27954;&#22303;&#22320;&#38480;&#21046;&#32531;&#35299;&#23548;&#33268;&#30340;&#22823;&#20998;&#27495;&#20551;&#35774;&#65292;&#36825;&#20010;&#30740;&#31350;&#26500;&#24314;&#20102;&#19968;&#20010;&#22686;&#38271;&#27169;&#22411;&#65292;&#23545;&#20892;&#19994;&#21644;&#21046;&#36896;&#19994;&#37096;&#38376;&#36827;&#34892;&#20102;&#24418;&#24335;&#21270;&#65292;&#24182;&#23637;&#31034;&#20102;&#32463;&#27982;&#20174;&#39532;&#23572;&#33832;&#26031;&#29366;&#24577;&#21521;&#38750;&#39532;&#23572;&#33832;&#26031;&#29366;&#24577;&#36716;&#21464;&#30340;&#36807;&#31243;&#12290;</title><link>https://arxiv.org/abs/2108.03110</link><description>&lt;p&gt;
&#19968;&#20010;&#20851;&#20110;&#22823;&#20998;&#27495;&#30340;&#27874;&#33707;&#20848;&#22686;&#38271;&#29702;&#35770;
&lt;/p&gt;
&lt;p&gt;
A Pomeranzian Growth Theory of the Great Divergence
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2108.03110
&lt;/p&gt;
&lt;p&gt;
&#22522;&#20110;&#27431;&#27954;&#22303;&#22320;&#38480;&#21046;&#32531;&#35299;&#23548;&#33268;&#30340;&#22823;&#20998;&#27495;&#20551;&#35774;&#65292;&#36825;&#20010;&#30740;&#31350;&#26500;&#24314;&#20102;&#19968;&#20010;&#22686;&#38271;&#27169;&#22411;&#65292;&#23545;&#20892;&#19994;&#21644;&#21046;&#36896;&#19994;&#37096;&#38376;&#36827;&#34892;&#20102;&#24418;&#24335;&#21270;&#65292;&#24182;&#23637;&#31034;&#20102;&#32463;&#27982;&#20174;&#39532;&#23572;&#33832;&#26031;&#29366;&#24577;&#21521;&#38750;&#39532;&#23572;&#33832;&#26031;&#29366;&#24577;&#36716;&#21464;&#30340;&#36807;&#31243;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#30740;&#31350;&#26500;&#24314;&#20102;&#19968;&#20010;&#20851;&#20110;&#22823;&#20998;&#27495;&#30340;&#22686;&#38271;&#27169;&#22411;&#65292;&#24418;&#24335;&#21270;&#20102;&#27874;&#33707;&#20848;&#20857;&#65288;2000&#65289;&#30340;&#20551;&#35774;&#65292;&#21363;&#27431;&#27954;&#22303;&#22320;&#38480;&#21046;&#30340;&#32531;&#35299;&#23548;&#33268;&#20102;&#33258;19&#19990;&#32426;&#20197;&#26469;&#27431;&#27954;&#19982;&#20013;&#22269;&#32463;&#27982;&#22686;&#38271;&#20043;&#38388;&#30340;&#20998;&#27495;&#12290;&#35813;&#27169;&#22411;&#30001;&#20892;&#19994;&#21644;&#21046;&#36896;&#19994;&#32452;&#25104;&#12290;&#20892;&#19994;&#37096;&#38376;&#20174;&#22303;&#22320;&#19978;&#29983;&#20135;&#29983;&#27963;&#24517;&#38656;&#21697;&#12289;&#26469;&#33258;&#21046;&#36896;&#19994;&#30340;&#20013;&#38388;&#21697;&#21644;&#21171;&#21160;&#21147;&#12290;&#21046;&#36896;&#19994;&#37096;&#38376;&#36890;&#36807;&#20840;&#32844;&#21046;&#36896;&#19994;&#24037;&#20154;&#30340;&#23454;&#36341;&#25104;&#38271;&#26469;&#29983;&#20135;&#21830;&#21697;&#12290;&#23478;&#24237;&#20570;&#20986;&#29983;&#32946;&#20915;&#31574;&#12290;&#22312;&#27169;&#22411;&#20013;&#65292;&#23545;&#22303;&#22320;&#20379;&#24212;&#30340;&#22823;&#35268;&#27169;&#22806;&#29983;&#24615;&#27491;&#38754;&#20914;&#20987;&#20351;&#32463;&#27982;&#20174;&#39532;&#23572;&#33832;&#26031;&#29366;&#24577;&#36716;&#21464;&#20026;&#38750;&#39532;&#23572;&#33832;&#26031;&#29366;&#24577;&#65292;&#20854;&#20013;&#25152;&#26377;&#24037;&#20154;&#37117;&#20174;&#20107;&#20892;&#19994;&#29983;&#20135;&#65292;&#20154;&#22343;&#25910;&#20837;&#24658;&#23450;&#65292;&#21040;&#21442;&#19982;&#20892;&#19994;&#29983;&#20135;&#30340;&#24037;&#20154;&#27604;&#20363;&#36880;&#28176;&#20943;&#23569;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2108.03110v3 Announce Type: replace  Abstract: This study constructs a growth model of the Great Divergence that formalizes Pomeranz's (2000) hypothesis that the relief of land constraints in Europe has caused divergence in economic growth between Europe and China since the 19th century. The model consists of the agricultural and manufacturing sectors. The agricultural sector produces subsistence goods from land, intermediate goods from the manufacturing sector, and labor. The manufacturing sector produces goods from labor, and its productivity grows through the learning-by-doing of full-time manufacturing workers. Households make fertility decisions. In the model, a large exogenous positive shock in land supply causes the transition of the economy from the Malthusian state, in which all workers are engaged in agricultural production and per capita income is constant, to the non-Malthusian state, in which the share of workers engaged in agricultural production gradually decreases
&lt;/p&gt;</description></item><item><title>&#36135;&#26550;&#35774;&#35745;&#23545;&#20135;&#21697;&#38656;&#27714;&#26377;&#26174;&#33879;&#24433;&#21709;&#65292;&#30740;&#31350;&#21457;&#29616;&#31454;&#20105;&#25928;&#24212;&#36890;&#24120;&#26356;&#24378;&#65292;&#20294;&#24182;&#38750;&#24635;&#26159;&#22914;&#27492;&#12290;</title><link>https://arxiv.org/abs/2010.09227</link><description>&lt;p&gt;
&#36890;&#36807;&#36135;&#26550;&#35774;&#35745;&#24433;&#21709;&#31454;&#20105;
&lt;/p&gt;
&lt;p&gt;
Influencing Competition Through Shelf Design
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2010.09227
&lt;/p&gt;
&lt;p&gt;
&#36135;&#26550;&#35774;&#35745;&#23545;&#20135;&#21697;&#38656;&#27714;&#26377;&#26174;&#33879;&#24433;&#21709;&#65292;&#30740;&#31350;&#21457;&#29616;&#31454;&#20105;&#25928;&#24212;&#36890;&#24120;&#26356;&#24378;&#65292;&#20294;&#24182;&#38750;&#24635;&#26159;&#22914;&#27492;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36135;&#26550;&#35774;&#35745;&#20915;&#31574;&#24378;&#28872;&#24433;&#21709;&#20135;&#21697;&#38656;&#27714;&#12290;&#29305;&#21035;&#26159;&#23558;&#20135;&#21697;&#25918;&#32622;&#22312;&#29702;&#24819;&#20301;&#32622;&#20250;&#22686;&#21152;&#38656;&#27714;&#12290;&#36135;&#26550;&#20301;&#32622;&#23545;&#38656;&#27714;&#26377;&#20027;&#35201;&#24433;&#21709;&#65292;&#20294;&#20063;&#23384;&#22312;&#22522;&#20110;&#38468;&#36817;&#20135;&#21697;&#30456;&#23545;&#20301;&#32622;&#30340;&#27425;&#35201;&#24433;&#21709;&#12290;&#30452;&#35273;&#19978;&#65292;&#30456;&#37051;&#20301;&#32622;&#30340;&#20135;&#21697;&#26356;&#26377;&#21487;&#33021;&#34987;&#27604;&#36739;&#65292;&#20135;&#29983;&#31215;&#26497;&#21644;&#28040;&#26497;&#25928;&#24212;&#12290;&#36890;&#36807;&#20462;&#25913;GEV&#31867;&#27169;&#22411;&#65292;&#20197;&#20801;&#35768;&#38656;&#27714;&#21463;&#31454;&#20105;&#23545;&#25163;&#30340;&#25509;&#36817;&#31243;&#24230;&#35843;&#33410;&#65292;&#36825;&#20004;&#31181;&#25928;&#24212;&#20250;&#33258;&#28982;&#20135;&#29983;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2010.09227v3 Announce Type: replace  Abstract: Shelf design decisions strongly influence product demand. In particular, placing products in desirable locations increases demand. This primary effect on shelf position is clear, but there is a secondary effect based on the relative positioning of nearby products. Intuitively, products located next to each other are more likely to be compared having positive and negative effects. On the one hand, locations closer to relatively strong products will be undesirable, as these strong products will draw demand from others -- an effect that is stronger for those in close proximity. On the other hand, because strong products tend to attract more traffic, locations closer to them elicit high consumer attention by increased visibility. Modifying the GEV class of models to allow demand to be moderated by competitors' proximity, these two effects emerge naturally. We found that although the competition effect is usually stronger, it is not alway
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#23545;&#23450;&#37327;&#34913;&#37327;&#21516;&#36136;&#20135;&#19994;&#20869;&#36164;&#28304;&#38169;&#37197;&#30340;&#24120;&#35268;&#26041;&#27861;&#36827;&#34892;&#20102;&#37325;&#26032;&#35780;&#20272;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#24050;&#35782;&#21035;&#30340;&#25919;&#31574;&#21464;&#21270;&#30340;&#27604;&#36739;&#20998;&#26512;&#31574;&#30053;&#12290;&#30740;&#31350;&#34920;&#26126;&#65292;&#37329;&#34701;&#21361;&#26426;&#23545;&#29983;&#20135;&#35201;&#32032;&#30340;&#24433;&#21709;&#23548;&#33268;&#36164;&#28304;&#37197;&#32622;&#20005;&#37325;&#22833;&#35843;&#65292;&#32780;&#25919;&#31574;&#24178;&#39044;&#21487;&#33021;&#20250;&#25439;&#23475;&#25972;&#20307;&#32463;&#27982;&#25928;&#29575;&#12290;</title><link>http://arxiv.org/abs/2306.08760</link><description>&lt;p&gt;
&#29983;&#20135;&#29575;&#12289;&#35201;&#32032;&#38169;&#37197;&#19982;&#37329;&#34701;&#21361;&#26426;
&lt;/p&gt;
&lt;p&gt;
Productivity, Inputs Misallocation, and the Financial Crisis. (arXiv:2306.08760v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.08760
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#23545;&#23450;&#37327;&#34913;&#37327;&#21516;&#36136;&#20135;&#19994;&#20869;&#36164;&#28304;&#38169;&#37197;&#30340;&#24120;&#35268;&#26041;&#27861;&#36827;&#34892;&#20102;&#37325;&#26032;&#35780;&#20272;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#24050;&#35782;&#21035;&#30340;&#25919;&#31574;&#21464;&#21270;&#30340;&#27604;&#36739;&#20998;&#26512;&#31574;&#30053;&#12290;&#30740;&#31350;&#34920;&#26126;&#65292;&#37329;&#34701;&#21361;&#26426;&#23545;&#29983;&#20135;&#35201;&#32032;&#30340;&#24433;&#21709;&#23548;&#33268;&#36164;&#28304;&#37197;&#32622;&#20005;&#37325;&#22833;&#35843;&#65292;&#32780;&#25919;&#31574;&#24178;&#39044;&#21487;&#33021;&#20250;&#25439;&#23475;&#25972;&#20307;&#32463;&#27982;&#25928;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#37325;&#26032;&#35780;&#20272;&#20102;&#23450;&#37327;&#34913;&#37327;&#21516;&#36136;&#20135;&#19994;&#20869;&#36164;&#28304;&#38169;&#37197;&#30340;&#24120;&#35268;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#36890;&#24120;&#20351;&#29992;&#19968;&#20010;&#36755;&#20837;&#36793;&#38469;&#20135;&#21697;&#30340;&#31163;&#25955;&#24230;&#26469;&#34913;&#37327;&#12290;&#25105;&#30340;&#30740;&#31350;&#21457;&#29616;&#65292;&#36825;&#19968;&#32479;&#35745;&#37327;&#21253;&#25324;&#22266;&#26377;&#30340;&#29983;&#20135;&#29575;&#24322;&#36136;&#24615;&#21644;&#29305;&#26377;&#30340;&#29983;&#20135;&#29575;&#20914;&#20987;&#65292;&#32780;&#19981;&#32771;&#34385;&#25152;&#30740;&#31350;&#30340;&#36755;&#20837;&#12290;&#21033;&#29992;&#32654;&#22269;&#21644;&#27431;&#27954;&#21046;&#36896;&#19994;&#20844;&#21496;&#30340;&#36164;&#20135;&#36127;&#20538;&#34920;&#25968;&#25454;&#65292;&#25105;&#21457;&#29616;&#24635;&#29983;&#20135;&#35201;&#32032;&#29983;&#20135;&#29575;&#27874;&#21160;&#20540;&#21344;&#36164;&#26412;&#36793;&#38469;&#20135;&#21697;&#30340;&#26041;&#24046;&#30340;7&#65285;&#65292;&#21171;&#21160;&#21147;&#20026;9&#65285;&#65292;&#26448;&#26009;&#36755;&#20837;&#20026;10&#65285;&#12290;&#22240;&#27492;&#65292;&#36825;&#20010;&#25351;&#25968;&#20197;&#34920;&#38754;&#20215;&#20540;&#34920;&#31034;&#26102;&#65292;&#26080;&#27861;&#35782;&#21035;&#20986;&#20219;&#20309;&#29983;&#20135;&#35201;&#32032;&#30340;&#25919;&#31574;&#24341;&#21457;&#30340;&#38169;&#37197;&#12290;&#20026;&#20102;&#20811;&#26381;&#36825;&#19968;&#23616;&#38480;&#24615;&#65292;&#25105;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#24050;&#35782;&#21035;&#30340;&#25919;&#31574;&#21464;&#21270;&#30340;&#27604;&#36739;&#20998;&#26512;&#31574;&#30053;&#12290;&#36825;&#31181;&#26041;&#27861;&#20801;&#35768;&#30740;&#31350;&#20154;&#21592;&#22312;&#30456;&#23545;&#30340;&#26465;&#20214;&#19979;&#35780;&#20272;&#35825;&#23548;&#22833;&#37197;&#65292;&#21516;&#26102;&#25511;&#21046;TFP&#27874;&#21160;&#24615;&#30340;&#24046;&#24322;&#12290;&#25105;&#21457;&#29616;&#37329;&#34701;&#21361;&#26426;&#23545;&#29983;&#20135;&#35201;&#32032;&#30340;&#24433;&#21709;&#26159;&#19981;&#22343;&#34913;&#30340;&#65292;&#23548;&#33268;&#36164;&#28304;&#37197;&#32622;&#20005;&#37325;&#22833;&#35843;&#12290;&#36890;&#36807;&#27604;&#36739;&#19981;&#21516;&#22320;&#21306;&#21644;&#34892;&#19994;&#30340;&#37329;&#34701;&#21361;&#26426;&#21069;&#21644;&#37329;&#34701;&#21361;&#26426;&#26399;&#38388;&#65292;&#32463;&#27982;&#37329;&#34701;&#29615;&#22659;&#31283;&#23450;&#30340;&#24773;&#20917;&#65292;&#25105;&#21457;&#29616;&#37329;&#34701;&#21361;&#26426;&#23545;&#21046;&#36896;&#19994;&#30340;&#36127;&#38754;&#24433;&#21709;&#27604;&#26381;&#21153;&#19994;&#26356;&#20026;&#26126;&#26174;&#65292;&#23545;&#27431;&#27954;&#19994;&#21153;&#26356;&#20026;&#20005;&#37325;&#65292;&#32780;&#19988;&#36825;&#31181;&#22833;&#35843;&#26159;&#30001;&#20110;&#37329;&#34701;&#32039;&#32553;&#25919;&#31574;&#24341;&#36215;&#30340;&#12290;&#36825;&#19968;&#30740;&#31350;&#34920;&#26126;&#65292;&#25919;&#31574;&#24178;&#39044;&#21487;&#33021;&#20250;&#23548;&#33268;&#36164;&#28304;&#37197;&#32622;&#22833;&#35843;&#65292;&#25439;&#23475;&#25972;&#20307;&#32463;&#27982;&#25928;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper reevaluates the conventional approach to quantifying within-industry resource misallocation, typically measured by the dispersion of an input marginal product. My findings suggest that this statistic incorporates inherent productivity heterogeneity and idiosyncratic productivity shocks, irrespective of the input under scrutiny. Using balance sheet data from American and European manufacturing firms, I show that total factor productivity (TFP) volatility accounts for 7% of the variance in the marginal product of capital, 9% for labor, and 10% for material inputs. Consequently, this index, taken at face value, fails to identify policy-induced misallocation for any production input. To overcome this limitation, I propose a comparative analysis strategy driven by an identified policy variation. This approach allows the researcher to assess induced misallocation in relative terms whilst controlling for differences in TFP volatility. I show that the financial crisis had an uneven 
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#20004;&#31181;&#32463;&#20856;&#31574;&#30053;&#35777;&#26126;&#21305;&#37197;&#26426;&#21046;&#30340;&#22797;&#26434;&#24615;&#65292;&#24182;&#25552;&#20986;&#22235;&#20010;&#24120;&#35265;&#38382;&#39064;&#26469;&#35268;&#33539;&#25105;&#20204;&#30340;&#30740;&#31350;&#12290;DA&#21644;TTC&#30340;&#22797;&#26434;&#24230;&#22312;&#26576;&#20123;&#38382;&#39064;&#19978;&#26159;&#21487;&#27604;&#36739;&#30340;&#65292;&#36825;&#20026;&#25105;&#20204;&#25552;&#20379;&#20102;&#26032;&#30340;&#20005;&#26684;&#30028;&#38480;&#12290;</title><link>http://arxiv.org/abs/2212.08709</link><description>&lt;p&gt;
&#21305;&#37197;&#26426;&#21046;&#30340;&#32467;&#26500;&#22797;&#26434;&#24615;
&lt;/p&gt;
&lt;p&gt;
Structural Complexities of Matching Mechanisms. (arXiv:2212.08709v2 [cs.GT] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2212.08709
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#20004;&#31181;&#32463;&#20856;&#31574;&#30053;&#35777;&#26126;&#21305;&#37197;&#26426;&#21046;&#30340;&#22797;&#26434;&#24615;&#65292;&#24182;&#25552;&#20986;&#22235;&#20010;&#24120;&#35265;&#38382;&#39064;&#26469;&#35268;&#33539;&#25105;&#20204;&#30340;&#30740;&#31350;&#12290;DA&#21644;TTC&#30340;&#22797;&#26434;&#24230;&#22312;&#26576;&#20123;&#38382;&#39064;&#19978;&#26159;&#21487;&#27604;&#36739;&#30340;&#65292;&#36825;&#20026;&#25105;&#20204;&#25552;&#20379;&#20102;&#26032;&#30340;&#20005;&#26684;&#30028;&#38480;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#29992;&#20110;&#20004;&#20010;&#32463;&#20856;&#31574;&#30053;&#35777;&#26126;&#21305;&#37197;&#26426;&#21046;&#65288;DA&#21644;TTC&#65289;&#30340;&#21508;&#31181;&#26032;&#30340;&#22797;&#26434;&#24230;&#24230;&#37327;&#26631;&#20934;&#12290; &#25105;&#20204;&#30340;&#24230;&#37327;&#26631;&#20934;&#26088;&#22312;&#25429;&#25417;&#21508;&#31181;&#32467;&#26500;&#65288;&#32780;&#38750;&#35745;&#31639;&#65289;&#26041;&#38754;&#30340;&#22797;&#26434;&#24615;&#65292;&#29305;&#21035;&#26159;&#36817;&#26399;&#22312;&#32463;&#27982;&#39046;&#22495;&#36234;&#21457;&#37325;&#35201;&#30340;&#26041;&#38754;&#12290;&#25105;&#20204;&#32771;&#34385;&#20102;&#19968;&#20010;&#32463;&#20856;&#32780;&#28789;&#27963;&#30340;&#26041;&#27861;&#26469;&#35268;&#33539;&#25105;&#20204;&#30340;&#38382;&#39064;&#65306;&#23450;&#20041;&#19968;&#20010;&#25191;&#34892;&#26576;&#20010;&#20219;&#21153;&#30340;&#21327;&#35758;&#25110;&#25968;&#25454;&#32467;&#26500;&#65292;&#24182;&#38480;&#21046;&#23427;&#25152;&#38656;&#30340;&#20301;&#25968;&#12290;&#25105;&#20204;&#30340;&#32467;&#26524;&#23558;&#36825;&#31181;&#26041;&#27861;&#24212;&#29992;&#20110;&#22235;&#20010;&#26222;&#36941;&#20851;&#24515;&#30340;&#38382;&#39064;&#12290;&#23545;&#20110;&#23558;&#30003;&#35831;&#20154;&#19982;&#26426;&#26500;&#36827;&#34892;&#21305;&#37197;&#65292;&#25105;&#20204;&#38382;&#65306;&#65288;1&#65289;&#19968;&#20010;&#30003;&#35831;&#20154;&#22914;&#20309;&#24433;&#21709;&#21305;&#37197;&#32467;&#26524;&#65311;&#65288;2&#65289;&#19968;&#20010;&#30003;&#35831;&#20154;&#22914;&#20309;&#24433;&#21709;&#21478;&#19968;&#20010;&#30003;&#35831;&#20154;&#30340;&#36873;&#25321;&#38598;&#65311;&#65288;3&#65289;&#21305;&#37197;&#32467;&#26524;&#22914;&#20309;&#34920;&#31034;/&#36890;&#20449;&#65311; &#65288;4&#65289;&#22914;&#20309;&#39564;&#35777;&#21305;&#37197;&#32467;&#26524;&#65311;&#25105;&#20204;&#35777;&#26126;&#65292;&#22312;&#38382;&#39064;&#65288;1&#65289;&#21644;&#65288;4&#65289;&#19979;&#65292;DA&#21644;TTC&#30340;&#22797;&#26434;&#24230;&#26159;&#21487;&#27604;&#36739;&#30340;&#65292;&#25552;&#20379;&#20102;&#26032;&#30340;&#20005;&#26684;&#23626;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study various novel complexity measures for two-sided matching mechanisms, applied to the two canonical strategyproof matching mechanisms, Deferred Acceptance (DA) and Top Trading Cycles (TTC). Our metrics are designed to capture the complexity of various structural (rather than computational) concerns, in particular ones of recent interest from economics. We consider a canonical, flexible approach to formalizing our questions: define a protocol or data structure performing some task, and bound the number of bits that it requires. Our results apply this approach to four questions of general interest; for matching applicants to institutions, we ask:  (1) How can one applicant affect the outcome matching?  (2) How can one applicant affect another applicant's set of options?  (3) How can the outcome matching be represented / communicated?  (4) How can the outcome matching be verified?  We prove that DA and TTC are comparable in complexity under questions (1) and (4), giving new tight l
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#19968;&#31181;&#35745;&#31639;&#38750;&#21487;&#24494;&#38656;&#27714;&#20989;&#25968;&#30340;&#25928;&#29992;&#20989;&#25968;&#30340;&#26041;&#27861;&#65292;&#24182;&#24471;&#21040;&#20102;&#20004;&#20010;&#26032;&#30340;&#20805;&#20998;&#21644;&#24517;&#35201;&#26465;&#20214;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36824;&#23637;&#31034;&#20102;&#21807;&#19968;&#24615;&#21644;&#24369;&#24207;&#30340;&#34920;&#31034;&#12290;&#25105;&#20204;&#23558;&#36825;&#20123;&#32467;&#26524;&#24212;&#29992;&#20110;&#35745;&#37327;&#32463;&#27982;&#29702;&#35770;&#65292;&#24182;&#24471;&#21040;&#20102;&#20851;&#20110;&#38656;&#27714;&#20989;&#25968;&#25910;&#25947;&#24615;&#21644;&#20855;&#26377;&#22343;&#21248;&#21033;&#26222;&#24076;&#33576;&#24120;&#25968;&#30340;&#32467;&#26524;&#12290;</title><link>http://arxiv.org/abs/2203.04770</link><description>&lt;p&gt;
&#38750;&#20809;&#28369;&#21487;&#31215;&#29702;&#35770;
&lt;/p&gt;
&lt;p&gt;
Non-Smooth Integrability Theory. (arXiv:2203.04770v3 [econ.TH] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2203.04770
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#19968;&#31181;&#35745;&#31639;&#38750;&#21487;&#24494;&#38656;&#27714;&#20989;&#25968;&#30340;&#25928;&#29992;&#20989;&#25968;&#30340;&#26041;&#27861;&#65292;&#24182;&#24471;&#21040;&#20102;&#20004;&#20010;&#26032;&#30340;&#20805;&#20998;&#21644;&#24517;&#35201;&#26465;&#20214;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36824;&#23637;&#31034;&#20102;&#21807;&#19968;&#24615;&#21644;&#24369;&#24207;&#30340;&#34920;&#31034;&#12290;&#25105;&#20204;&#23558;&#36825;&#20123;&#32467;&#26524;&#24212;&#29992;&#20110;&#35745;&#37327;&#32463;&#27982;&#29702;&#35770;&#65292;&#24182;&#24471;&#21040;&#20102;&#20851;&#20110;&#38656;&#27714;&#20989;&#25968;&#25910;&#25947;&#24615;&#21644;&#20855;&#26377;&#22343;&#21248;&#21033;&#26222;&#24076;&#33576;&#24120;&#25968;&#30340;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#19968;&#31181;&#20174;&#19968;&#20010;&#19981;&#21487;&#24494;&#20294;&#23616;&#37096;&#21033;&#26222;&#24076;&#33576;&#30340;&#38656;&#27714;&#20989;&#25968;&#20505;&#36873;&#20013;&#35745;&#31639;&#25928;&#29992;&#20989;&#25968;&#30340;&#26041;&#27861;&#12290;&#21033;&#29992;&#36825;&#31181;&#26041;&#27861;&#65292;&#25105;&#20204;&#24471;&#21040;&#20102;&#19968;&#20010;&#38656;&#27714;&#20989;&#25968;&#20505;&#36873;&#20026;&#38656;&#27714;&#20989;&#25968;&#30340;&#20004;&#20010;&#26032;&#30340;&#24517;&#35201;&#21644;&#20805;&#20998;&#26465;&#20214;&#12290;&#31532;&#19968;&#20010;&#26159;&#20851;&#20110;&#26031;&#25289;&#33576;&#22522;&#30697;&#38453;&#30340;&#26465;&#20214;&#65292;&#31532;&#20108;&#20010;&#26159;&#20851;&#20110;&#20559;&#24494;&#20998;&#26041;&#31243;&#30340;&#20985;&#35299;&#30340;&#23384;&#22312;&#24615;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36824;&#23637;&#31034;&#20102;&#23545;&#24212;&#20110;&#38656;&#27714;&#20989;&#25968;&#30340;&#19978;&#21322;&#36830;&#32493;&#24369;&#24207;&#26159;&#21807;&#19968;&#30340;&#65292;&#24182;&#19988;&#36825;&#20010;&#24369;&#24207;&#21487;&#20197;&#29992;&#25105;&#20204;&#35745;&#31639;&#20986;&#30340;&#25928;&#29992;&#20989;&#25968;&#34920;&#31034;&#12290;&#25105;&#20204;&#23558;&#36825;&#20123;&#32467;&#26524;&#24212;&#29992;&#20110;&#35745;&#37327;&#32463;&#27982;&#29702;&#35770;&#12290;&#39318;&#20808;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#22312;&#19968;&#20123;&#35201;&#27714;&#19979;&#65292;&#22914;&#26524;&#19968;&#20010;&#38656;&#27714;&#20989;&#25968;&#24207;&#21015;&#30456;&#23545;&#20110;&#32039;&#33268;&#25910;&#25947;&#24230;&#37327;&#25910;&#25947;&#21040;&#26576;&#20010;&#20989;&#25968;&#65292;&#37027;&#20040;&#26497;&#38480;&#20989;&#25968;&#20063;&#26159;&#19968;&#20010;&#38656;&#27714;&#20989;&#25968;&#12290;&#20854;&#27425;&#65292;&#23545;&#20110;&#22312;&#20219;&#20309;&#32039;&#33268;&#38598;&#19978;&#20855;&#26377;&#22343;&#21248;&#21033;&#26222;&#24076;&#33576;&#24120;&#25968;&#30340;&#38656;&#27714;&#20989;&#25968;&#31354;&#38388;&#22312;&#19978;&#36848;&#24230;&#37327;&#19979;&#26159;&#32039;&#33268;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study a method for calculating the utility function from a candidate of a demand function that is not differentiable, but is locally Lipschitz. Using this method, we obtain two new necessary and sufficient conditions for a candidate of a demand function to be a demand function. The first is conditions for the Slutsky matrix, and the second is the existence of a concave solution to a partial differential equation. Moreover, we show that the upper semi-continuous weak order that corresponds to the demand function is unique, and that this weak order is represented by our calculated utility function. We provide applications of these results to econometric theory. First, we show that, under several requirements, if a sequence of demand functions converges to some function with respect to the metric of compact convergence, then the limit is also a demand function. Second, the space of demand functions that have uniform Lipschitz constants on any compact set is compact under the above metr
&lt;/p&gt;</description></item></channel></rss>