<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#36861;&#36880;&#31454;&#36187;&#27169;&#22411;&#65292;&#20854;&#20013;&#20004;&#20010;&#19981;&#23545;&#31216;&#30340;&#31454;&#20105;&#32773;&#22312;&#36830;&#32493;&#26102;&#38388;&#26694;&#26550;&#20013;&#36827;&#34892;&#21162;&#21147;&#65292;&#39046;&#20808;&#32773;&#24050;&#32463;&#21462;&#24471;&#19968;&#27425;&#31361;&#30772;&#65292;&#32780;&#36861;&#36214;&#32773;&#38656;&#35201;&#21462;&#24471;&#20004;&#27425;&#31361;&#30772;&#25165;&#33021;&#33719;&#32988;&#65292;&#22312;&#19981;&#21516;&#25259;&#38706;&#25919;&#31574;&#19979;&#23454;&#29616;&#22343;&#34913;&#24182;&#27604;&#36739;&#20102;&#19981;&#23545;&#31216;&#28608;&#21169;&#12290;</title><link>https://arxiv.org/abs/2404.02756</link><description>&lt;p&gt;
&#36861;&#36880;&#31454;&#36187;
&lt;/p&gt;
&lt;p&gt;
Chasing Contests
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2404.02756
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#36861;&#36880;&#31454;&#36187;&#27169;&#22411;&#65292;&#20854;&#20013;&#20004;&#20010;&#19981;&#23545;&#31216;&#30340;&#31454;&#20105;&#32773;&#22312;&#36830;&#32493;&#26102;&#38388;&#26694;&#26550;&#20013;&#36827;&#34892;&#21162;&#21147;&#65292;&#39046;&#20808;&#32773;&#24050;&#32463;&#21462;&#24471;&#19968;&#27425;&#31361;&#30772;&#65292;&#32780;&#36861;&#36214;&#32773;&#38656;&#35201;&#21462;&#24471;&#20004;&#27425;&#31361;&#30772;&#25165;&#33021;&#33719;&#32988;&#65292;&#22312;&#19981;&#21516;&#25259;&#38706;&#25919;&#31574;&#19979;&#23454;&#29616;&#22343;&#34913;&#24182;&#27604;&#36739;&#20102;&#19981;&#23545;&#31216;&#28608;&#21169;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21160;&#24577;&#30740;&#31350;&#31454;&#36187;&#65292;&#21363;&#36861;&#36880;&#31454;&#36187;&#65292;&#22312;&#36830;&#32493;&#26102;&#38388;&#26694;&#26550;&#20013;&#65292;&#20004;&#20010;&#19981;&#23545;&#31216;&#30340;&#31454;&#20105;&#32773;&#20250;&#20184;&#20986;&#25104;&#26412;&#26469;&#23454;&#29616;&#20004;&#20010;&#31361;&#30772;&#12290;&#36825;&#20004;&#20010;&#31454;&#20105;&#32773;&#20998;&#20026;&#19981;&#23545;&#31216;&#30340;&#20004;&#31867;&#65292;&#19968;&#31867;&#26159;&#23384;&#22312;&#20559;&#22909;&#30340;&#65292;&#24182;&#19988;&#24050;&#32463;&#21462;&#24471;&#20102;&#19968;&#20010;&#31361;&#30772; (&#39046;&#20808;&#32773;)&#65292;&#32780;&#21478;&#19968;&#31867;&#26159;&#26102;&#38388;&#19968;&#33268;&#30340;&#65292;&#38656;&#35201;&#23454;&#29616;&#20004;&#20010;&#31361;&#30772;&#25165;&#33021;&#33719;&#32988;(&#36861;&#36214;&#32773;)&#12290;&#22996;&#25176;&#20154;&#21487;&#20197;&#22312;&#20004;&#31181;&#25259;&#38706;&#25919;&#31574;&#20043;&#38388;&#36827;&#34892;&#36873;&#25321;&#65292;&#19968;&#31181;&#26159;&#31435;&#21363;&#23459;&#24067;&#36861;&#36880;&#32773;&#30340;&#31532;&#19968;&#20010;&#31361;&#30772; (&#20844;&#24320;&#36861;&#36880;&#31454;&#36187;)&#65292;&#21478;&#19968;&#31181;&#26159;&#30452;&#21040;&#32456;&#28857;&#25165;&#23459;&#24067;&#31454;&#36187;&#32467;&#26524;(&#38544;&#34255;&#30340;&#36861;&#36880;&#31454;&#36187;)&#12290;&#25105;&#20204;&#23436;&#20840;&#21051;&#30011;&#20102;&#36861;&#36880;&#31454;&#36187;&#22312;&#36825;&#20004;&#31181;&#25259;&#38706;&#25919;&#31574;&#19979;&#30340;&#21807;&#19968;x&#36215;&#28857;&#21644;y&#32456;&#28857;&#30340;&#22343;&#34913;&#65292;&#39046;&#20808;&#32773;&#20174;&#26102;&#21051;x&#24320;&#22987;&#24037;&#20316;&#65292;&#32780;&#36861;&#36214;&#32773;&#22312;&#26102;&#21051;y&#20572;&#27490;&#21162;&#21147;&#12290;&#25105;&#20204;&#36827;&#19968;&#27493;&#27604;&#36739;&#20102;&#20004;&#31181;&#25259;&#38706;&#25919;&#31574;&#19979;&#30340;&#19981;&#23545;&#31216;&#28608;&#21169;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2404.02756v1 Announce Type: new  Abstract: This paper proposes a dynamic research contest, namely the chasing contest, in which two asymmetric contestants exert costly effort to accomplish two breakthroughs in a continuous-time framework. The contestants are asymmetric in that one of them is present-biased and has already achieved one breakthrough (the leader), while the other is time-consistent and needs to achieve two breakthroughs to win (the chaser). The principal can choose between two disclosure policies, which either immediately announces the first breakthrough of the chaser (public chasing contest), or only announces the contest results until its terminus (hidden chasing contest). We fully characterize the unique x-start and y-stop equilibrium of the chasing contest with the two disclosure policies, in which the leader starts working from an instant x to the end while the chaser stops exerting effort by the instant y. We further compare the asymmetric incentives of the tw
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#26032;&#30340;&#35745;&#37327;&#32463;&#27982;&#23398;&#24037;&#20855;&#26469;&#35299;&#26512;&#36731;&#32618;&#29359;&#30340;&#21009;&#32602;&#23545;&#20877;&#29359;&#26102;&#38388;&#30340;&#24322;&#36136;&#25928;&#24212;&#12290;&#30740;&#31350;&#32467;&#26524;&#21457;&#29616;&#65292;&#23545;&#20110;&#32477;&#22823;&#22810;&#25968;&#27861;&#23448;&#20250;&#24809;&#32602;&#30340;&#20154;&#32780;&#35328;&#65292;&#21009;&#32602;&#20250;&#24310;&#38271;&#20877;&#29359;&#26102;&#38388;&#65292;&#32780;&#21482;&#26377;&#20005;&#21385;&#30340;&#27861;&#23448;&#25165;&#20250;&#23545;&#20877;&#29359;&#29575;&#20135;&#29983;&#24433;&#21709;&#12290;</title><link>https://arxiv.org/abs/2311.13969</link><description>&lt;p&gt;
&#23545;&#24052;&#35199;&#20877;&#29359;&#26102;&#38388;&#30340;&#26367;&#20195;&#21009;&#32602;&#25928;&#26524;&#24322;&#36136;&#24615;&#30340;&#21400;&#28165;&#65292;&#38597;&#24343;&#23572;&#29305;&#30340;&#24576;&#30097;&#26159;&#21542;&#21512;&#29702;&#65311;
&lt;/p&gt;
&lt;p&gt;
Was Javert right to be suspicious? Unpacking treatment effect heterogeneity of alternative sentences on time-to-recidivism in Brazil
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2311.13969
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#26032;&#30340;&#35745;&#37327;&#32463;&#27982;&#23398;&#24037;&#20855;&#26469;&#35299;&#26512;&#36731;&#32618;&#29359;&#30340;&#21009;&#32602;&#23545;&#20877;&#29359;&#26102;&#38388;&#30340;&#24322;&#36136;&#25928;&#24212;&#12290;&#30740;&#31350;&#32467;&#26524;&#21457;&#29616;&#65292;&#23545;&#20110;&#32477;&#22823;&#22810;&#25968;&#27861;&#23448;&#20250;&#24809;&#32602;&#30340;&#20154;&#32780;&#35328;&#65292;&#21009;&#32602;&#20250;&#24310;&#38271;&#20877;&#29359;&#26102;&#38388;&#65292;&#32780;&#21482;&#26377;&#20005;&#21385;&#30340;&#27861;&#23448;&#25165;&#20250;&#23545;&#20877;&#29359;&#29575;&#20135;&#29983;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#26032;&#30340;&#35745;&#37327;&#32463;&#27982;&#23398;&#24037;&#20855;&#65292;&#20197;&#35299;&#26512;&#24809;&#32602;&#36731;&#32618;&#29359;&#23545;&#20877;&#29359;&#26102;&#38388;&#30340;&#24322;&#36136;&#27835;&#30103;&#25928;&#24212;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#22914;&#20309;&#22312;&#27835;&#30103;&#36873;&#25321;&#26159;&#20869;&#29983;&#30340;&#24773;&#20917;&#19979;&#65292;&#23545;&#32463;&#24120;&#26159;&#22312;&#21491;&#20391;&#25130;&#26029;&#30340;&#25345;&#32493;&#21464;&#37327;&#31561;&#24863;&#20852;&#36259;&#30340;&#32467;&#26524;&#36827;&#34892;&#20998;&#24067;&#12289;&#20998;&#20301;&#25968;&#21644;&#24179;&#22343;&#36793;&#38469;&#27835;&#30103;&#25928;&#24212;&#30340;&#35782;&#21035;&#12289;&#20272;&#35745;&#21644;&#25512;&#26029;&#12290;&#21033;&#29992;&#22312;&#24052;&#35199;&#22307;&#20445;&#32599;&#24030;2010&#24180;&#33267;2019&#24180;&#27861;&#23448;&#23545;&#26696;&#20214;&#30340;&#20223;&#25311;&#38543;&#26426;&#20998;&#37197;&#65292;&#25105;&#20204;&#25506;&#32034;&#20102;&#25105;&#20204;&#25552;&#20986;&#30340;&#35745;&#37327;&#32463;&#27982;&#23398;&#26041;&#27861;&#26469;&#35780;&#20272;&#32602;&#27454;&#21644;&#31038;&#21306;&#26381;&#21153;&#21477;&#20316;&#20026;&#19968;&#31181;&#24809;&#32602;&#24418;&#24335;&#23545;&#20877;&#29359;&#26102;&#38388;&#30340;&#24433;&#21709;&#12290;&#25105;&#20204;&#30340;&#32467;&#26524;&#31361;&#26174;&#20102;&#20854;&#20182;&#24037;&#20855;&#26080;&#27861;&#25429;&#25417;&#21040;&#30340;&#26174;&#33879;&#27835;&#30103;&#25928;&#24212;&#24322;&#36136;&#24615;&#12290;&#20363;&#22914;&#65292;&#25105;&#20204;&#21457;&#29616;&#22823;&#22810;&#25968;&#27861;&#23448;&#20250;&#24809;&#32602;&#30340;&#20154;&#30001;&#20110;&#22788;&#32602;&#32780;&#20877;&#29359;&#30340;&#26102;&#38388;&#26356;&#38271;&#65292;&#32780;&#21482;&#26377;&#20005;&#21385;&#30340;&#27861;&#23448;&#20250;&#24809;&#32602;&#30340;&#20154;&#20877;&#29359;&#29575;&#36739;&#39640;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper presents new econometric tools to unpack the treatment effect heterogeneity of punishing misdemeanor offenses on time-to-recidivism. We show how one can identify, estimate, and make inferences on the distributional, quantile, and average marginal treatment effects in setups where the treatment selection is endogenous and the outcome of interest, usually a duration variable, is potentially right-censored. We explore our proposed econometric methodology to evaluate the effect of fines and community service sentences as a form of punishment on time-to-recidivism in the State of S\~ao Paulo, Brazil, between 2010 and 2019, leveraging the as-if random assignment of judges to cases. Our results highlight substantial treatment effect heterogeneity that other tools are not meant to capture. For instance, we find that people whom most judges would punish take longer to recidivate as a consequence of the punishment, while people who would be punished only by strict judges recidivate at
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#26679;&#26412;&#36873;&#25321;&#27169;&#22411;&#20013;&#22788;&#29702;&#25928;&#24212;&#30340;&#37096;&#20998;&#35782;&#21035;&#38382;&#39064;&#65292;&#24403;&#25490;&#38500;&#38480;&#21046;&#22833;&#25928;&#21644;&#36873;&#25321;&#25928;&#24212;&#30340;&#21333;&#35843;&#24615;&#20551;&#35774;&#19981;&#23436;&#20840;&#25104;&#31435;&#26102;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#20801;&#35768;&#22312;&#21333;&#35843;&#24615;&#19981;&#20005;&#26684;&#25104;&#31435;&#30340;&#24773;&#20917;&#19979;&#33719;&#24471;&#26377;&#29992;&#30340;&#30028;&#38480;&#12290;</title><link>http://arxiv.org/abs/2311.00439</link><description>&lt;p&gt;
&#22312;&#26679;&#26412;&#36873;&#25321;&#27169;&#22411;&#20013;&#30340;&#38543;&#26426;&#21333;&#35843;&#24615;&#20551;&#35774;&#19979;&#30340;&#22788;&#29702;&#25928;&#24212;&#30028;&#38480;
&lt;/p&gt;
&lt;p&gt;
Bounds on Treatment Effects under Stochastic Monotonicity Assumption in Sample Selection Models. (arXiv:2311.00439v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2311.00439
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#26679;&#26412;&#36873;&#25321;&#27169;&#22411;&#20013;&#22788;&#29702;&#25928;&#24212;&#30340;&#37096;&#20998;&#35782;&#21035;&#38382;&#39064;&#65292;&#24403;&#25490;&#38500;&#38480;&#21046;&#22833;&#25928;&#21644;&#36873;&#25321;&#25928;&#24212;&#30340;&#21333;&#35843;&#24615;&#20551;&#35774;&#19981;&#23436;&#20840;&#25104;&#31435;&#26102;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#20801;&#35768;&#22312;&#21333;&#35843;&#24615;&#19981;&#20005;&#26684;&#25104;&#31435;&#30340;&#24773;&#20917;&#19979;&#33719;&#24471;&#26377;&#29992;&#30340;&#30028;&#38480;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#35752;&#35770;&#20102;&#22312;&#26679;&#26412;&#36873;&#25321;&#27169;&#22411;&#20013;&#22788;&#29702;&#25928;&#24212;&#30340;&#37096;&#20998;&#35782;&#21035;&#65292;&#24403;&#25490;&#38500;&#38480;&#21046;&#22833;&#25928;&#21644;&#36873;&#25321;&#25928;&#24212;&#30340;&#21333;&#35843;&#24615;&#20551;&#35774;&#19981;&#33021;&#23436;&#20840;&#25104;&#31435;&#26102;&#65292;&#36825;&#20004;&#20010;&#37117;&#26159;&#24212;&#29992;&#29616;&#26377;&#26041;&#27861;&#30340;&#20027;&#35201;&#25361;&#25112;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#22522;&#20110;Lee&#65288;2009&#65289;&#30340;&#36807;&#31243;&#65292;&#20182;&#32771;&#34385;&#20102;&#21333;&#35843;&#24615;&#20551;&#35774;&#19979;&#30340;&#37096;&#20998;&#35782;&#21035;&#65292;&#20294;&#25105;&#20204;&#21482;&#20551;&#35774;&#20102;&#38543;&#26426;&#65288;&#26356;&#24369;&#65289;&#29256;&#26412;&#30340;&#21333;&#35843;&#24615;&#65292;&#36825;&#20381;&#36182;&#20110;&#39044;&#20808;&#25351;&#23450;&#30340;&#21442;&#25968;$ \vartheta $&#65292;&#20195;&#34920;&#30740;&#31350;&#20154;&#21592;&#23545;&#21333;&#35843;&#24615;&#21512;&#29702;&#24615;&#30340;&#20449;&#24565;&#12290;&#22312;&#36825;&#31181;&#20551;&#35774;&#19979;&#65292;&#25105;&#20204;&#35777;&#26126;&#21363;&#20351;&#21333;&#35843;&#34892;&#20026;&#27169;&#22411;&#19981;&#20005;&#26684;&#25104;&#31435;&#65292;&#25105;&#20204;&#20173;&#28982;&#21487;&#20197;&#33719;&#24471;&#26377;&#29992;&#30340;&#30028;&#38480;&#12290;&#24403;&#23454;&#35777;&#30740;&#31350;&#20154;&#21592;&#39044;&#35745;&#20154;&#21475;&#20013;&#21482;&#26377;&#19968;&#23567;&#37096;&#20998;&#20154;&#20250;&#22312;&#36873;&#25321;&#20013;&#34920;&#29616;&#20986;&#21333;&#35843;&#34892;&#20026;&#26102;&#65292;&#25105;&#20204;&#30340;&#26041;&#27861;&#38750;&#24120;&#26377;&#29992;&#65307;&#23427;&#36824;&#21487;&#20197;&#29992;&#20110;&#36827;&#34892;&#25935;&#24863;&#24615;&#20998;&#26512;&#25110;&#26816;&#39564;&#35782;&#21035;&#33021;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper discusses the partial identification of treatment effects in sample selection models when the exclusion restriction fails and the monotonicity assumption in the selection effect does not hold exactly, both of which are key challenges in applying the existing methodologies. Our approach builds on Lee's (2009) procedure, who considers partial identification under the monotonicity assumption, but we assume only a stochastic (and weaker) version of monotonicity, which depends on a prespecified parameter $\vartheta$ that represents researchers' belief in the plausibility of the monotonicity. Under this assumption, we show that we can still obtain useful bounds even when the monotonic behavioral model does not strictly hold. Our procedure is useful when empirical researchers anticipate that a small fraction of the population will not behave monotonically in selection; it can also be an effective tool for performing sensitivity analysis or examining the identification power of the 
&lt;/p&gt;</description></item><item><title>&#36825;&#31687;&#35770;&#25991;&#30740;&#31350;&#20102;&#38750;&#32447;&#24615;&#38431;&#21015;&#38754;&#26495;&#20013;&#30340;&#26368;&#23567;&#20108;&#20056;&#20272;&#35745;&#19982;&#32463;&#39564;&#23398;&#20064;&#65292;&#25506;&#35752;&#20102;&#20272;&#35745;&#21644;&#25512;&#26029;&#30340;&#25216;&#26415;&#65292;&#24182;&#39564;&#35777;&#20102;Malmendier&#21644;Nagel&#22312;2016&#24180;&#30340;&#32463;&#20856;&#35770;&#25991;&#20013;&#20351;&#29992;&#30340;&#20272;&#35745;&#22120;&#30340;&#24615;&#36136;&#21644;&#23454;&#29992;&#24615;&#12290;</title><link>http://arxiv.org/abs/2309.08982</link><description>&lt;p&gt;
&#38750;&#32447;&#24615;&#38431;&#21015;&#38754;&#26495;&#20013;&#30340;&#26368;&#23567;&#20108;&#20056;&#20272;&#35745;&#19982;&#32463;&#39564;&#23398;&#20064;
&lt;/p&gt;
&lt;p&gt;
Least squares estimation in nonlinear cohort panels with learning from experience. (arXiv:2309.08982v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.08982
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#30740;&#31350;&#20102;&#38750;&#32447;&#24615;&#38431;&#21015;&#38754;&#26495;&#20013;&#30340;&#26368;&#23567;&#20108;&#20056;&#20272;&#35745;&#19982;&#32463;&#39564;&#23398;&#20064;&#65292;&#25506;&#35752;&#20102;&#20272;&#35745;&#21644;&#25512;&#26029;&#30340;&#25216;&#26415;&#65292;&#24182;&#39564;&#35777;&#20102;Malmendier&#21644;Nagel&#22312;2016&#24180;&#30340;&#32463;&#20856;&#35770;&#25991;&#20013;&#20351;&#29992;&#30340;&#20272;&#35745;&#22120;&#30340;&#24615;&#36136;&#21644;&#23454;&#29992;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#35752;&#35770;&#20102;&#22312;&#38750;&#32447;&#24615;&#38431;&#21015;&#38754;&#26495;&#20013;&#36827;&#34892;&#20272;&#35745;&#21644;&#25512;&#26029;&#30340;&#25216;&#26415;&#65292;&#20854;&#20013;&#28041;&#21450;&#21040;&#20102;Malmendier&#21644;Nagel&#22312;2016&#24180;&#30340;&#32463;&#20856;&#35770;&#25991;&#20013;&#20351;&#29992;&#30340;&#38750;&#32447;&#24615;&#26368;&#23567;&#20108;&#20056;&#20272;&#35745;&#22120;&#30340;&#19968;&#33268;&#24615;&#21644;&#28176;&#36817;&#27491;&#24577;&#24615;&#12290;&#25105;&#20204;&#36824;&#37492;&#23450;&#20102;&#20551;&#35774;&#26816;&#39564;&#21487;&#33021;&#23384;&#22312;&#30340;&#28508;&#22312;&#38519;&#38449;&#65292;&#24182;&#25552;&#20986;&#20102;&#35299;&#20915;&#26041;&#26696;&#12290;&#33945;&#29305;&#21345;&#32599;&#27169;&#25311;&#39564;&#35777;&#20102;&#26377;&#38480;&#26679;&#26412;&#20013;&#20272;&#35745;&#22120;&#21644;&#30456;&#24212;&#30340;&#26816;&#39564;&#32479;&#35745;&#37327;&#30340;&#29305;&#24615;&#65292;&#32780;&#23545;&#19968;&#32452;&#35843;&#26597;&#39044;&#26399;&#30340;&#24212;&#29992;&#21017;&#35777;&#26126;&#20102;&#25152;&#24320;&#21457;&#29702;&#35770;&#30340;&#23454;&#29992;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
We discuss techniques of estimation and inference for nonlinear cohort panels with learning from experience, showing, inter alia, the consistency and asymptotic normality of the nonlinear least squares estimator employed in the seminal paper by Malmendier and Nagel (2016). Potential pitfalls for hypothesis testing are identified and solutions proposed. Monte Carlo simulations verify the properties of the estimator and corresponding test statistics in finite samples, while an application to a panel of survey expectations demonstrates the usefulness of the theory developed.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#22810;&#20010;&#25237;&#36164;&#32773;&#22312;&#21021;&#22987;&#36130;&#23500;&#12289;&#39118;&#38505;&#35268;&#36991;&#21442;&#25968;&#20197;&#21450;&#32456;&#27490;&#26102;&#38388;&#30340;&#38543;&#26426;&#36127;&#20538;&#26041;&#38754;&#23384;&#22312;&#24046;&#24322;&#26102;&#30340;&#22343;&#34913;&#20215;&#26684;&#24418;&#25104;&#38382;&#39064;&#65292;&#36890;&#36807;&#19968;&#20010;&#26032;&#30340;&#22343;&#22330;&#21453;&#21521;&#38543;&#26426;&#24494;&#20998;&#26041;&#31243;&#65288;BSDE&#65289;&#30340;&#35299;&#26469;&#34920;&#24449;&#39118;&#38505;&#32929;&#31080;&#30340;&#22343;&#34913;&#39118;&#38505;&#28322;&#20215;&#36807;&#31243;&#65292;&#24182;&#35777;&#26126;&#20854;&#28165;&#38500;&#24066;&#22330;&#12290;</title><link>http://arxiv.org/abs/2304.07108</link><description>&lt;p&gt;
&#24102;&#25351;&#25968;&#25928;&#29992;&#20989;&#25968;&#30340;&#22343;&#20540;&#22330;&#22343;&#34913;&#20215;&#26684;&#24418;&#25104;
&lt;/p&gt;
&lt;p&gt;
Mean-field equilibrium price formation with exponential utility. (arXiv:2304.07108v1 [q-fin.MF])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.07108
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22810;&#20010;&#25237;&#36164;&#32773;&#22312;&#21021;&#22987;&#36130;&#23500;&#12289;&#39118;&#38505;&#35268;&#36991;&#21442;&#25968;&#20197;&#21450;&#32456;&#27490;&#26102;&#38388;&#30340;&#38543;&#26426;&#36127;&#20538;&#26041;&#38754;&#23384;&#22312;&#24046;&#24322;&#26102;&#30340;&#22343;&#34913;&#20215;&#26684;&#24418;&#25104;&#38382;&#39064;&#65292;&#36890;&#36807;&#19968;&#20010;&#26032;&#30340;&#22343;&#22330;&#21453;&#21521;&#38543;&#26426;&#24494;&#20998;&#26041;&#31243;&#65288;BSDE&#65289;&#30340;&#35299;&#26469;&#34920;&#24449;&#39118;&#38505;&#32929;&#31080;&#30340;&#22343;&#34913;&#39118;&#38505;&#28322;&#20215;&#36807;&#31243;&#65292;&#24182;&#35777;&#26126;&#20854;&#28165;&#38500;&#24066;&#22330;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22810;&#20301;&#25237;&#36164;&#32773;&#22312;&#21021;&#22987;&#36130;&#23500;&#12289;&#39118;&#38505;&#35268;&#36991;&#21442;&#25968;&#20197;&#21450;&#32456;&#27490;&#26102;&#38388;&#30340;&#38543;&#26426;&#36127;&#20538;&#26041;&#38754;&#23384;&#22312;&#24046;&#24322;&#26102;&#30340;&#22343;&#34913;&#20215;&#26684;&#24418;&#25104;&#38382;&#39064;&#12290;&#25105;&#20204;&#36890;&#36807;&#19968;&#20010;&#26032;&#30340;&#22343;&#22330;&#21453;&#21521;&#38543;&#26426;&#24494;&#20998;&#26041;&#31243;&#65288;BSDE&#65289;&#30340;&#35299;&#26469;&#34920;&#24449;&#39118;&#38505;&#32929;&#31080;&#30340;&#22343;&#34913;&#39118;&#38505;&#28322;&#20215;&#36807;&#31243;&#65292;&#20854;&#29305;&#24449;&#26159;&#39537;&#21160;&#31243;&#24207;&#22312;&#38543;&#26426;&#31215;&#20998;&#21644;&#26465;&#20214;&#26399;&#26395;&#19978;&#37117;&#20855;&#26377;&#20108;&#27425;&#22686;&#38271;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#22312;&#22810;&#20010;&#26465;&#20214;&#19979;&#22343;&#22330;BSDE&#23384;&#22312;&#35299;&#65292;&#24182;&#19988;&#34920;&#26126;&#38543;&#30528;&#20154;&#21475;&#35268;&#27169;&#30340;&#22686;&#22823;&#65292;&#32467;&#26524;&#39118;&#38505;&#28322;&#20215;&#36827;&#31243;&#23454;&#38469;&#19978;&#20250;&#28165;&#38500;&#24066;&#22330;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this paper, we study a problem of equilibrium price formation among many investors with exponential utility. The investors are heterogeneous in their initial wealth, risk-averseness parameter, as well as stochastic liability at the terminal time. We characterize the equilibrium risk-premium process of the risky stocks in terms of the solution to a novel mean-field backward stochastic differential equation (BSDE), whose driver has quadratic growth both in the stochastic integrands and in their conditional expectations. We prove the existence of a solution to the mean-field BSDE under several conditions and show that the resultant risk-premium process actually clears the market in the large population limit.
&lt;/p&gt;</description></item><item><title>&#36890;&#36807;&#27604;&#36739;&#22235;&#31181;&#20154;&#24037;&#31070;&#32463;&#32593;&#32476;&#21644;&#21160;&#24577;&#22240;&#23376;&#27169;&#22411;&#23545;&#32654;&#22269;GDP&#23395;&#24230;&#22686;&#38271;&#30340;&#39044;&#27979;&#34920;&#29616;&#65292;&#30740;&#31350;&#21457;&#29616;&#22312;&#24179;&#34913;&#32463;&#27982;&#22686;&#38271;&#26399;&#38388;&#65292;&#26356;&#38271;&#30340;&#36755;&#20837;&#24207;&#21015;&#33021;&#22815;&#23454;&#29616;&#26356;&#20934;&#30830;&#30340;&#39044;&#27979;&#65292;&#20294;&#26159;&#36825;&#31181;&#25928;&#26524;&#20250;&#22312;&#19981;&#21040;&#20004;&#24180;&#30340;&#26102;&#38388;&#20869;&#28040;&#22833;&#12290;&#22312;&#32463;&#27982;&#21160;&#33633;&#26102;&#26399;&#65292;&#38271;&#26399;&#35760;&#24518;&#30340;&#25928;&#26524;&#21464;&#24471;&#26126;&#26174;&#12290;</title><link>http://arxiv.org/abs/2304.05805</link><description>&lt;p&gt;
&#29992;&#20154;&#24037;&#31070;&#32463;&#32593;&#32476;&#39044;&#27979;&#22269;&#20869;&#29983;&#20135;&#24635;&#20540;&#65306;&#38271;&#26399;&#35760;&#24518;&#26377;&#22810;&#22823;&#30340;&#20316;&#29992;&#65311;
&lt;/p&gt;
&lt;p&gt;
GDP nowcasting with artificial neural networks: How much does long-term memory matter?. (arXiv:2304.05805v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.05805
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#27604;&#36739;&#22235;&#31181;&#20154;&#24037;&#31070;&#32463;&#32593;&#32476;&#21644;&#21160;&#24577;&#22240;&#23376;&#27169;&#22411;&#23545;&#32654;&#22269;GDP&#23395;&#24230;&#22686;&#38271;&#30340;&#39044;&#27979;&#34920;&#29616;&#65292;&#30740;&#31350;&#21457;&#29616;&#22312;&#24179;&#34913;&#32463;&#27982;&#22686;&#38271;&#26399;&#38388;&#65292;&#26356;&#38271;&#30340;&#36755;&#20837;&#24207;&#21015;&#33021;&#22815;&#23454;&#29616;&#26356;&#20934;&#30830;&#30340;&#39044;&#27979;&#65292;&#20294;&#26159;&#36825;&#31181;&#25928;&#26524;&#20250;&#22312;&#19981;&#21040;&#20004;&#24180;&#30340;&#26102;&#38388;&#20869;&#28040;&#22833;&#12290;&#22312;&#32463;&#27982;&#21160;&#33633;&#26102;&#26399;&#65292;&#38271;&#26399;&#35760;&#24518;&#30340;&#25928;&#26524;&#21464;&#24471;&#26126;&#26174;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#26412;&#30740;&#31350;&#20013;&#65292;&#25105;&#20204;&#23558;&#19981;&#21516;&#30340;&#32479;&#35745;&#27169;&#22411;&#24212;&#29992;&#20110;&#32654;&#22269;&#32463;&#27982;&#23395;&#24230;&#22269;&#20869;&#29983;&#20135;&#24635;&#20540;&#65288;GDP&#65289;&#22686;&#38271;&#39044;&#27979;&#12290;&#20351;&#29992;&#27599;&#26376;&#30340;FRED-MD&#25968;&#25454;&#24211;&#65292;&#25105;&#20204;&#27604;&#36739;&#20102;&#21160;&#24577;&#22240;&#23376;&#27169;&#22411;&#65288;DFM&#65289;&#21644;&#22235;&#20010;&#20154;&#24037;&#31070;&#32463;&#32593;&#32476;&#65288;ANNs&#65289;&#30340;&#39044;&#27979;&#34920;&#29616;&#65306;&#22810;&#23618;&#24863;&#30693;&#26426;&#65288;MLP&#65289;&#12289;&#19968;&#32500;&#21367;&#31215;&#31070;&#32463;&#32593;&#32476;&#65288;1D CNN&#65289;&#12289;&#38271;&#30701;&#26399;&#35760;&#24518;&#32593;&#32476;&#65288;LSTM&#65289;&#21644;&#38376;&#25511;&#24490;&#29615;&#21333;&#20803;&#65288;GRU&#65289;&#12290;&#23454;&#35777;&#20998;&#26512;&#21576;&#29616;&#20102;&#20004;&#20010;&#19981;&#21516;&#35780;&#20272;&#21608;&#26399;&#30340;&#32467;&#26524;&#12290;&#31532;&#19968;&#20010;&#21608;&#26399;&#65288;2010&#24180;&#31532;1&#23395;&#24230;&#33267;2019&#24180;&#31532;4&#23395;&#24230;&#65289;&#20855;&#26377;&#24179;&#34913;&#30340;&#32463;&#27982;&#22686;&#38271;&#65292;&#32780;&#31532;&#20108;&#20010;&#21608;&#26399;&#65288;2010&#24180;&#31532;1&#23395;&#24230;&#33267;2022&#24180;&#31532;3&#23395;&#24230;&#65289;&#36824;&#21253;&#25324;COVID-19&#34928;&#36864;&#26399;&#38388;&#30340;&#26102;&#38388;&#12290;&#26681;&#25454;&#25105;&#20204;&#30340;&#32467;&#26524;&#65292;&#26356;&#38271;&#30340;&#36755;&#20837;&#24207;&#21015;&#22312;&#24179;&#34913;&#32463;&#27982;&#22686;&#38271;&#26399;&#38388;&#33021;&#22815;&#23454;&#29616;&#26356;&#20934;&#30830;&#30340;&#39044;&#27979;&#12290;&#28982;&#32780;&#65292;&#22312;&#19968;&#20010;&#30456;&#23545;&#36739;&#20302;&#30340;&#38408;&#20540;&#20540;&#65288;&#32422;&#20845;&#20010;&#23395;&#24230;&#25110;&#21313;&#20843;&#20010;&#26376;&#65289;&#20197;&#21518;&#65292;&#36825;&#31181;&#25928;&#24212;&#20250;&#28040;&#22833;&#12290;&#22312;&#32463;&#27982;&#21160;&#33633;&#26399;&#65288;&#22914;COVID-19&#34928;&#36864;&#26399;&#38388;&#65289;&#65292;&#38271;&#26399;&#35760;&#24518;&#30340;&#25928;&#26524;&#20250;&#21464;&#24471;&#36739;&#20026;&#26126;&#26174;&#12290;
&lt;/p&gt;
&lt;p&gt;
In our study, we apply different statistical models to nowcast quarterly GDP growth for the US economy. Using the monthly FRED-MD database, we compare the nowcasting performance of the dynamic factor model (DFM) and four artificial neural networks (ANNs): the multilayer perceptron (MLP), the one-dimensional convolutional neural network (1D CNN), the long short-term memory network (LSTM), and the gated recurrent unit (GRU). The empirical analysis presents the results from two distinctively different evaluation periods. The first (2010:Q1 -- 2019:Q4) is characterized by balanced economic growth, while the second (2010:Q1 -- 2022:Q3) also includes periods of the COVID-19 recession. According to our results, longer input sequences result in more accurate nowcasts in periods of balanced economic growth. However, this effect ceases above a relatively low threshold value of around six quarters (eighteen months). During periods of economic turbulence (e.g., during the COVID-19 recession), long
&lt;/p&gt;</description></item></channel></rss>