<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#35813;&#35770;&#25991;&#35752;&#35770;&#20102;&#24322;&#36136;&#24615;&#27835;&#30103;&#25928;&#24212;&#23545;&#20110;&#22240;&#26524;&#26426;&#21046;&#30340;&#25512;&#26029;&#65292;&#24182;&#25351;&#20986;&#20102;&#23384;&#22312;&#30340;&#25361;&#25112;&#21644;&#23616;&#38480;&#24615;&#12290;</title><link>https://arxiv.org/abs/2404.01566</link><description>&lt;p&gt;
&#24322;&#36136;&#24615;&#27835;&#30103;&#25928;&#24212;&#21644;&#22240;&#26524;&#26426;&#21046;
&lt;/p&gt;
&lt;p&gt;
Heterogeneous Treatment Effects and Causal Mechanisms
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2404.01566
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#35752;&#35770;&#20102;&#24322;&#36136;&#24615;&#27835;&#30103;&#25928;&#24212;&#23545;&#20110;&#22240;&#26524;&#26426;&#21046;&#30340;&#25512;&#26029;&#65292;&#24182;&#25351;&#20986;&#20102;&#23384;&#22312;&#30340;&#25361;&#25112;&#21644;&#23616;&#38480;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
arXiv:2404.01566v1 &#20844;&#21578;&#31867;&#22411;:&#26032;&#25688;&#35201;:&#21487;&#20449;&#24230;&#38761;&#21629;&#25512;&#21160;&#20102;&#21033;&#29992;&#30740;&#31350;&#35774;&#35745;&#26469;&#35782;&#21035;&#21644;&#20272;&#35745;&#22240;&#26524;&#25928;&#24212;&#30340;&#21457;&#23637;&#12290;&#28982;&#32780;&#65292;&#20102;&#35299;&#21738;&#20123;&#26426;&#21046;&#20135;&#29983;&#20102;&#27979;&#37327;&#30340;&#22240;&#26524;&#25928;&#24212;&#20173;&#28982;&#26159;&#19968;&#20010;&#25361;&#25112;&#12290;&#30446;&#21069;&#20851;&#20110;&#23450;&#37327;&#35780;&#20272;&#26426;&#21046;&#30340;&#20027;&#35201;&#26041;&#27861;&#20381;&#36182;&#20110;&#26816;&#27979;&#19982;&#22788;&#29702;&#21069;&#21327;&#21464;&#37327;&#30456;&#20851;&#30340;&#24322;&#36136;&#24615;&#22788;&#29702;&#25928;&#24212;&#12290;&#26412;&#25991;&#24320;&#21457;&#20102;&#19968;&#20010;&#26694;&#26550;&#65292;&#29992;&#20110;&#29702;&#35299;&#22312;&#20309;&#31181;&#24773;&#20917;&#19979;&#36825;&#31181;&#24322;&#36136;&#24615;&#22788;&#29702;&#25928;&#24212;&#30340;&#23384;&#22312;&#33021;&#22815;&#25903;&#25345;&#26377;&#20851;&#26426;&#21046;&#28608;&#27963;&#30340;&#25512;&#26029;&#12290;&#25105;&#20204;&#39318;&#20808;&#23637;&#31034;&#65292;&#36825;&#31181;&#35774;&#35745;&#22312;&#27809;&#26377;&#39069;&#22806;&#12289;&#36890;&#24120;&#26159;&#38544;&#21547;&#30340;&#20551;&#35774;&#30340;&#24773;&#20917;&#19979;&#26080;&#27861;&#20026;&#26426;&#21046;&#28608;&#27963;&#25552;&#20379;&#35777;&#25454;&#12290;&#27492;&#22806;&#65292;&#21363;&#20351;&#36825;&#20123;&#20551;&#35774;&#24471;&#21040;&#28385;&#36275;&#65292;&#22914;&#26524;&#19968;&#20010;&#27979;&#37327;&#32467;&#26524;&#26159;&#36890;&#36807;&#30452;&#25509;&#21463;&#24433;&#21709;&#30340;&#24863;&#20852;&#36259;&#29702;&#35770;&#32467;&#26524;&#30340;&#38750;&#32447;&#24615;&#36716;&#25442;&#20135;&#29983;&#30340;&#65292;&#24322;&#36136;&#24615;&#22788;&#29702;&#25928;&#24212;&#20063;&#19981;&#36275;&#20197;&#25512;&#26029;&#26426;&#21046;&#28608;&#27963;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;n
&lt;/p&gt;
&lt;p&gt;
arXiv:2404.01566v1 Announce Type: new  Abstract: The credibility revolution advances the use of research designs that permit identification and estimation of causal effects. However, understanding which mechanisms produce measured causal effects remains a challenge. A dominant current approach to the quantitative evaluation of mechanisms relies on the detection of heterogeneous treatment effects with respect to pre-treatment covariates. This paper develops a framework to understand when the existence of such heterogeneous treatment effects can support inferences about the activation of a mechanism. We show first that this design cannot provide evidence of mechanism activation without additional, generally implicit, assumptions. Further, even when these assumptions are satisfied, if a measured outcome is produced by a non-linear transformation of a directly-affected outcome of theoretical interest, heterogeneous treatment effects are not informative of mechanism activation. We provide n
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#30740;&#31350;&#35758;&#31243;&#65292;&#20171;&#32461;&#20102;&#31038;&#20250;&#29615;&#22659;&#35774;&#35745;&#20316;&#20026;&#19968;&#31181;&#29992;&#20110;&#33258;&#21160;&#21270;&#25919;&#31574;&#21046;&#23450;&#30340;AI&#36890;&#29992;&#26694;&#26550;&#65292;&#26088;&#22312;&#25429;&#25417;&#19968;&#33324;&#32463;&#27982;&#29615;&#22659;&#65292;&#36890;&#36807;AI&#27169;&#25311;&#31995;&#32479;&#20998;&#26512;&#25919;&#24220;&#21644;&#32463;&#27982;&#25919;&#31574;&#65292;&#24182;&#24378;&#35843;&#26410;&#26469;&#22522;&#20110;AI&#30340;&#25919;&#31574;&#21046;&#23450;&#30740;&#31350;&#20013;&#30340;&#20851;&#38190;&#25361;&#25112;&#12290;</title><link>https://arxiv.org/abs/2402.14090</link><description>&lt;p&gt;
&#31038;&#20250;&#29615;&#22659;&#35774;&#35745;
&lt;/p&gt;
&lt;p&gt;
Social Environment Design
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.14090
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#30740;&#31350;&#35758;&#31243;&#65292;&#20171;&#32461;&#20102;&#31038;&#20250;&#29615;&#22659;&#35774;&#35745;&#20316;&#20026;&#19968;&#31181;&#29992;&#20110;&#33258;&#21160;&#21270;&#25919;&#31574;&#21046;&#23450;&#30340;AI&#36890;&#29992;&#26694;&#26550;&#65292;&#26088;&#22312;&#25429;&#25417;&#19968;&#33324;&#32463;&#27982;&#29615;&#22659;&#65292;&#36890;&#36807;AI&#27169;&#25311;&#31995;&#32479;&#20998;&#26512;&#25919;&#24220;&#21644;&#32463;&#27982;&#25919;&#31574;&#65292;&#24182;&#24378;&#35843;&#26410;&#26469;&#22522;&#20110;AI&#30340;&#25919;&#31574;&#21046;&#23450;&#30740;&#31350;&#20013;&#30340;&#20851;&#38190;&#25361;&#25112;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20154;&#24037;&#26234;&#33021;&#65288;AI&#65289;&#20316;&#20026;&#19968;&#31181;&#29992;&#20110;&#25913;&#21892;&#25919;&#24220;&#21644;&#32463;&#27982;&#25919;&#31574;&#21046;&#23450;&#30340;&#25216;&#26415;&#20855;&#26377;&#28508;&#21147;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#26032;&#30340;&#30740;&#31350;&#35758;&#31243;&#65292;&#20171;&#32461;&#20102;&#31038;&#20250;&#29615;&#22659;&#35774;&#35745;&#65292;&#36825;&#26159;&#19968;&#31181;&#29992;&#20110;&#33258;&#21160;&#21270;&#25919;&#31574;&#21046;&#23450;&#30340;AI&#36890;&#29992;&#26694;&#26550;&#65292;&#19982;&#24378;&#21270;&#23398;&#20064;&#12289;&#32463;&#27982;&#19982;&#35745;&#31639;&#31038;&#20250;&#36873;&#25321;&#31038;&#21306;&#30456;&#36830;&#25509;&#12290;&#35813;&#26694;&#26550;&#26088;&#22312;&#25429;&#25417;&#19968;&#33324;&#32463;&#27982;&#29615;&#22659;&#65292;&#21253;&#25324;&#23545;&#25919;&#31574;&#30446;&#26631;&#30340;&#25237;&#31080;&#65292;&#24182;&#20026;&#36890;&#36807;AI&#27169;&#25311;&#23545;&#25919;&#24220;&#21644;&#32463;&#27982;&#25919;&#31574;&#36827;&#34892;&#31995;&#32479;&#20998;&#26512;&#25552;&#20379;&#25351;&#23548;&#12290;&#25105;&#20204;&#24378;&#35843;&#20102;&#26410;&#26469;&#22522;&#20110;AI&#30340;&#25919;&#31574;&#21046;&#23450;&#30740;&#31350;&#20013;&#30340;&#20851;&#38190;&#24320;&#25918;&#38382;&#39064;&#12290;&#36890;&#36807;&#35299;&#20915;&#36825;&#20123;&#25361;&#25112;&#65292;&#25105;&#20204;&#24076;&#26395;&#23454;&#29616;&#21508;&#31181;&#31038;&#20250;&#31119;&#21033;&#30446;&#26631;&#65292;&#20174;&#32780;&#20419;&#36827;&#26356;&#20855;&#36947;&#24503;&#21644;&#36127;&#36131;&#20219;&#30340;&#20915;&#31574;&#21046;&#23450;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.14090v1 Announce Type: new  Abstract: Artificial Intelligence (AI) holds promise as a technology that can be used to improve government and economic policy-making. This paper proposes a new research agenda towards this end by introducing Social Environment Design, a general framework for the use of AI for automated policy-making that connects with the Reinforcement Learning, EconCS, and Computational Social Choice communities. The framework seeks to capture general economic environments, includes voting on policy objectives, and gives a direction for the systematic analysis of government and economic policy through AI simulation. We highlight key open problems for future research in AI-based policy-making. By solving these challenges, we hope to achieve various social welfare objectives, thereby promoting more ethical and responsible decision making.
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#20215;&#26684;&#24046;&#24322;&#21270;&#22312;&#38544;&#31169;&#32422;&#26463;&#19979;&#30340;&#38480;&#21046;&#38382;&#39064;&#65292;&#21457;&#29616;&#38544;&#31169;&#26426;&#21046;&#20250;&#36890;&#36807;&#38477;&#20302;&#26368;&#22823;&#21644;&#26368;&#23567;&#21487;&#36798;&#21040;&#30340;&#25928;&#29992;&#26469;&#25439;&#23475;&#29983;&#20135;&#32773;&#12290;</title><link>https://arxiv.org/abs/2402.08223</link><description>&lt;p&gt;
&#20215;&#26684;&#24046;&#24322;&#21270;&#22312;&#38544;&#31169;&#32422;&#26463;&#19979;&#30340;&#38480;&#21046;
&lt;/p&gt;
&lt;p&gt;
The Limits of Price Discrimination Under Privacy Constraints
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.08223
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#20215;&#26684;&#24046;&#24322;&#21270;&#22312;&#38544;&#31169;&#32422;&#26463;&#19979;&#30340;&#38480;&#21046;&#38382;&#39064;&#65292;&#21457;&#29616;&#38544;&#31169;&#26426;&#21046;&#20250;&#36890;&#36807;&#38477;&#20302;&#26368;&#22823;&#21644;&#26368;&#23567;&#21487;&#36798;&#21040;&#30340;&#25928;&#29992;&#26469;&#25439;&#23475;&#29983;&#20135;&#32773;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#32771;&#34385;&#29983;&#20135;&#32773;&#22312;&#21521;&#19968;&#31995;&#21015;&#27880;&#37325;&#38544;&#31169;&#30340;&#28040;&#36153;&#32773;&#38144;&#21806;&#20135;&#21697;&#26102;&#38754;&#20020;&#30340;&#38382;&#39064;&#65292;&#29983;&#20135;&#32773;&#21487;&#20197;&#23454;&#26045;&#31532;&#19977;&#24230;&#20215;&#26684;&#24046;&#24322;&#21270;&#65292;&#20026;&#19981;&#21516;&#30340;&#24066;&#22330;&#32454;&#20998;&#25552;&#20379;&#19981;&#21516;&#30340;&#20215;&#26684;&#12290;&#22312;&#27809;&#26377;&#38544;&#31169;&#32422;&#26463;&#30340;&#24773;&#20917;&#19979;&#65292;Bergemann&#65292;Brooks&#65292;&#21644;Morris [2015]&#21051;&#30011;&#20102;&#25152;&#26377;&#21487;&#33021;&#30340;&#28040;&#36153;&#32773;-&#29983;&#20135;&#32773;&#25928;&#29992;&#38598;&#21512;&#65292;&#34920;&#26126;&#23427;&#26159;&#19968;&#20010;&#19977;&#35282;&#24418;&#12290;&#25105;&#20204;&#32771;&#34385;&#20102;&#19968;&#31181;&#38544;&#31169;&#26426;&#21046;&#65292;&#36890;&#36807;&#27010;&#29575;&#22320;&#25513;&#30422;&#27599;&#20010;&#24066;&#22330;&#32454;&#20998;&#26469;&#25552;&#20379;&#19968;&#23450;&#31243;&#24230;&#30340;&#20445;&#25252;&#65292;&#24182;&#19988;&#25105;&#20204;&#30830;&#23450;&#25152;&#24471;&#21040;&#30340;&#25152;&#26377;&#28040;&#36153;&#32773;-&#29983;&#20135;&#32773;&#25928;&#29992;&#38598;&#21512;&#24418;&#25104;&#19968;&#20010;&#20984;&#22810;&#36793;&#24418;&#65292;&#26126;&#30830;&#22320;&#34920;&#36798;&#20026;&#26576;&#20010;&#39640;&#32500;&#20984;&#22810;&#38754;&#20307;&#21040;$\mathbb{R}^2$&#30340;&#32447;&#24615;&#26144;&#23556;&#12290;&#36825;&#31181;&#21051;&#30011;&#20351;&#25105;&#20204;&#33021;&#22815;&#30740;&#31350;&#38544;&#31169;&#26426;&#21046;&#23545;&#29983;&#20135;&#32773;&#21644;&#28040;&#36153;&#32773;&#25928;&#29992;&#30340;&#24433;&#21709;&#12290;&#29305;&#21035;&#22320;&#65292;&#25105;&#20204;&#30830;&#23450;&#38544;&#31169;&#32422;&#26463;&#24635;&#26159;&#36890;&#36807;&#38477;&#20302;&#26368;&#22823;&#21644;&#26368;&#23567;&#21487;&#36798;&#21040;&#30340;&#25928;&#29992;&#26469;&#25439;&#23475;&#29983;&#20135;&#32773;&#12290;
&lt;/p&gt;
&lt;p&gt;
We consider a producer's problem of selling a product to a continuum of privacy-conscious consumers, where the producer can implement third-degree price discrimination, offering different prices to different market segments. In the absence of privacy constraints, Bergemann, Brooks, and Morris [2015] characterize the set of all possible consumer-producer utilities, showing that it is a triangle. We consider a privacy mechanism that provides a degree of protection by probabilistically masking each market segment, and we establish that the resultant set of all consumer-producer utilities forms a convex polygon, characterized explicitly as a linear mapping of a certain high-dimensional convex polytope into $\mathbb{R}^2$. This characterization enables us to investigate the impact of the privacy mechanism on both producer and consumer utilities. In particular, we establish that the privacy constraint always hurts the producer by reducing both the maximum and minimum utility achievable. From
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#40065;&#26834;&#30340;&#31532;&#19977;&#24230;&#20215;&#26684;&#27495;&#35270;&#27169;&#22411;&#65292;&#22312;&#20080;&#26041;&#20272;&#20540;&#26410;&#30693;&#30340;&#24773;&#20917;&#19979;&#65292;&#36890;&#36807;&#21521;&#21334;&#26041;&#36879;&#38706;&#20449;&#24687;&#26469;&#26368;&#22823;&#21270;&#20080;&#26041;&#21097;&#20313;&#65292;&#24182;&#24471;&#21040;&#20102;&#20851;&#20110;&#36951;&#25022;&#24230;&#30340;&#30028;&#38480;&#12290;</title><link>http://arxiv.org/abs/2401.16942</link><description>&lt;p&gt;
&#40065;&#26834;&#30340;&#20215;&#26684;&#27495;&#35270;
&lt;/p&gt;
&lt;p&gt;
Robust Price Discrimination. (arXiv:2401.16942v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.16942
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#40065;&#26834;&#30340;&#31532;&#19977;&#24230;&#20215;&#26684;&#27495;&#35270;&#27169;&#22411;&#65292;&#22312;&#20080;&#26041;&#20272;&#20540;&#26410;&#30693;&#30340;&#24773;&#20917;&#19979;&#65292;&#36890;&#36807;&#21521;&#21334;&#26041;&#36879;&#38706;&#20449;&#24687;&#26469;&#26368;&#22823;&#21270;&#20080;&#26041;&#21097;&#20313;&#65292;&#24182;&#24471;&#21040;&#20102;&#20851;&#20110;&#36951;&#25022;&#24230;&#30340;&#30028;&#38480;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#32771;&#34385;&#20102;&#19968;&#20010;&#31532;&#19977;&#24230;&#20215;&#26684;&#27495;&#35270;&#30340;&#27169;&#22411;&#65292;&#20854;&#20013;&#21334;&#26041;&#23545;&#20135;&#21697;&#30340;&#20272;&#20540;&#26410;&#30693;&#20110;&#24066;&#22330;&#35774;&#35745;&#32773;&#65292;&#21518;&#32773;&#36890;&#36807;&#21521;&#21334;&#26041;&#36879;&#38706;&#20080;&#26041;&#20272;&#20540;&#30340;&#20449;&#24687;&#26469;&#26368;&#22823;&#21270;&#20080;&#26041;&#21097;&#20313;&#12290;&#25105;&#20204;&#30340;&#20027;&#35201;&#32467;&#26524;&#34920;&#26126;&#65292;&#36951;&#25022;&#24230;&#38480;&#21046;&#20026;$U^*(0)/e$&#65292;&#20854;&#20013; $U^*(0)$&#26159;&#22312;&#21334;&#26041;&#23545;&#20135;&#21697;&#27809;&#26377;&#20272;&#20540;&#30340;&#24773;&#20917;&#19979;&#30340;&#26368;&#20248;&#20080;&#26041;&#21097;&#20313;&#12290;&#35813;&#38480;&#21046;&#36890;&#36807;&#38543;&#26426;&#25277;&#21462;&#21334;&#26041;&#20272;&#20540;&#24182;&#24212;&#29992;Bergemann&#31561;&#20154;&#65288;2015&#65289;&#23545;&#20110;&#25277;&#21462;&#20272;&#20540;&#30340;&#20998;&#21106;&#26041;&#27861;&#24471;&#21040;&#12290;&#25105;&#20204;&#36824;&#35777;&#26126;&#20102;&#22312;&#20108;&#20998;&#31867;&#20080;&#26041;&#20272;&#20540;&#30340;&#24773;&#20917;&#19979;&#65292;$U^*(0)/e$&#38480;&#21046;&#26159;&#32039;&#23494;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
We consider a model of third-degree price discrimination, in which the seller has a valuation for the product which is unknown to the market designer, who aims to maximize the buyers' surplus by revealing information regarding the buyer's valuation to the seller. Our main result shows that the regret is bounded by $U^*(0)/e$, where $U^*(0)$ is the optimal buyer surplus in the case where the seller has zero valuation for the product. This bound is attained by randomly drawing a seller valuation and applying the segmentation of Bergemann et al. (2015) with respect to the drawn valuation. We show that the $U^*(0)/e$ bound is tight in the case of binary buyer valuation.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#20351;&#29992;&#32858;&#21512;&#21338;&#24328;&#30340;&#26694;&#26550;&#65292;&#30740;&#31350;&#20102;&#22303;&#22320;&#25152;&#26377;&#21046;&#20307;&#21046;&#30340;&#36716;&#21464;&#36807;&#31243;&#65292;&#21457;&#29616;&#20154;&#21475;&#23494;&#24230;&#12289;&#25216;&#26415;&#25913;&#36827;&#12289;&#22260;&#22320;&#25104;&#26412;&#12289;&#32676;&#20307;&#20957;&#32858;&#21147;&#21644;&#35848;&#21028;&#21147;&#30340;&#21464;&#21270;&#65292;&#20197;&#21450;&#25919;&#31574;&#21644;&#21046;&#24230;&#29615;&#22659;&#31561;&#22240;&#32032;&#20250;&#24433;&#21709;&#22303;&#22320;&#31169;&#26377;&#21270;&#30340;&#25928;&#29575;&#12290;</title><link>http://arxiv.org/abs/2311.01592</link><description>&lt;p&gt;
&#12298;&#22260;&#22320;&#27169;&#22411;&#65306;&#22303;&#22320;&#20135;&#26435;&#36716;&#21464;&#20013;&#30340;&#21327;&#35843;&#12289;&#20914;&#31361;&#21644;&#25928;&#29575;&#12299;
&lt;/p&gt;
&lt;p&gt;
A Model of Enclosures: Coordination, Conflict, and Efficiency in the Transformation of Land Property Rights. (arXiv:2311.01592v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2311.01592
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#20351;&#29992;&#32858;&#21512;&#21338;&#24328;&#30340;&#26694;&#26550;&#65292;&#30740;&#31350;&#20102;&#22303;&#22320;&#25152;&#26377;&#21046;&#20307;&#21046;&#30340;&#36716;&#21464;&#36807;&#31243;&#65292;&#21457;&#29616;&#20154;&#21475;&#23494;&#24230;&#12289;&#25216;&#26415;&#25913;&#36827;&#12289;&#22260;&#22320;&#25104;&#26412;&#12289;&#32676;&#20307;&#20957;&#32858;&#21147;&#21644;&#35848;&#21028;&#21147;&#30340;&#21464;&#21270;&#65292;&#20197;&#21450;&#25919;&#31574;&#21644;&#21046;&#24230;&#29615;&#22659;&#31561;&#22240;&#32032;&#20250;&#24433;&#21709;&#22303;&#22320;&#31169;&#26377;&#21270;&#30340;&#25928;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21382;&#21490;&#23398;&#23478;&#21644;&#25919;&#27835;&#32463;&#27982;&#23398;&#23478;&#38271;&#26399;&#20197;&#26469;&#19968;&#30452;&#22312;&#35752;&#35770;&#23548;&#33268;&#36793;&#30086;&#22320;&#21306;&#22303;&#22320;&#12289;&#20844;&#20849;&#39046;&#22495;&#21644;&#21508;&#31181;&#20064;&#20439;&#22303;&#22320;&#25152;&#26377;&#21046;&#36716;&#21464;&#20026;&#26356;&#20026;&#25490;&#20182;&#24418;&#24335;&#30340;&#31169;&#20154;&#36130;&#20135;&#30340;&#36807;&#31243;&#12290;&#25105;&#20204;&#20351;&#29992;&#32858;&#21512;&#21338;&#24328;&#30340;&#26694;&#26550;&#65292;&#30740;&#31350;&#22303;&#22320;&#25152;&#26377;&#21046;&#20307;&#21046;&#65292;&#22312;&#36825;&#31181;&#20307;&#21046;&#19979;&#65292;&#36890;&#36807;&#21344;&#26377;&#21644;&#20351;&#29992;&#26469;&#30830;&#31435;&#23545;&#22303;&#22320;&#30340;&#33719;&#21462;&#26435;&#65292;&#28982;&#21518;&#25506;&#32034;&#21487;&#33021;&#24341;&#21457;&#21435;&#20013;&#24515;&#21270;&#31169;&#26377;&#21270;&#36807;&#31243;&#30340;&#22240;&#32032;&#12290;&#20154;&#21475;&#23494;&#24230;&#12289;&#25216;&#26415;&#25913;&#36827;&#30340;&#28508;&#21147;&#12289;&#22260;&#22320;&#25104;&#26412;&#12289;&#32676;&#20307;&#20957;&#32858;&#21147;&#21644;&#35848;&#21028;&#21147;&#21464;&#21270;&#12289;&#20197;&#21450;&#25919;&#31574;&#21644;&#21046;&#24230;&#29615;&#22659;&#31561;&#22240;&#32032;&#20915;&#23450;&#20102;&#36130;&#20135;&#21046;&#24230;&#30340;&#24179;&#34913;&#32452;&#21512;&#12290;&#23613;&#31649;&#22312;&#26576;&#20123;&#24773;&#20917;&#19979;&#21435;&#20013;&#24515;&#21270;&#30340;&#36807;&#31243;&#21487;&#20197;&#20135;&#29983;&#26377;&#25928;&#30340;&#22260;&#22320;&#21644;&#25216;&#26415;&#36716;&#21464;&#65292;&#20294;&#22312;&#20854;&#20182;&#24773;&#20917;&#19979;&#65292;&#32467;&#26524;&#21364;&#36798;&#19981;&#21040;&#26368;&#20339;&#29366;&#24577;&#12290;&#36825;&#26159;&#30001;&#19981;&#21516;&#30340;&#28322;&#20986;&#25928;&#24212;&#30456;&#20114;&#20316;&#29992;&#24341;&#36215;&#30340;&#65292;&#23548;&#33268;&#22260;&#22320;&#21644;&#25216;&#26415;&#36716;&#21464;&#30340;&#25928;&#29575;&#20302;&#20110;&#29702;&#24819;&#29366;&#24577;&#12290;
&lt;/p&gt;
&lt;p&gt;
Historians and political economists have long debated the processes that led land in frontier regions, managed commons, and a variety of customary landholding regimes to be enclosed and transformed into more exclusive forms of private property. Using the framework of aggregative games, we examine land-holding regimes where access to land is established via possession and use, and then explore the factors that may initiate decentralized privatization processes. Factors including population density, potential for technology improvement, enclosure costs, shifts in group cohesion and bargaining power, or the policy and institutional environment determine the equilibrium mix of property regimes. While decentralized processes yield efficient enclosure and technological transformation in some circumstances, in others, the outcomes fall short of second-best. This stems from the interaction of different spillover effects, leading to inefficiently low rates of enclosure and technological transfo
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#20027;&#35201;&#30740;&#31350;&#20102;&#25903;&#25345;AI&#29983;&#25104;&#20869;&#23481;&#30340;&#25293;&#21334;&#26426;&#21046;&#35774;&#35745;&#65292;&#36890;&#36807;&#25552;&#20986;&#20196;&#29260;&#25293;&#21334;&#27169;&#22411;&#65292;&#23454;&#29616;&#20102;&#20197;&#28608;&#21169;&#20860;&#23481;&#30340;&#26041;&#24335;&#32858;&#21512;&#22810;&#20010;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65292;&#24182;&#29992;&#20110;&#32467;&#21512;&#19981;&#21516;&#24191;&#21578;&#21830;&#30340;&#36755;&#20837;&#12290;&#36825;&#20010;&#26426;&#21046;&#35774;&#35745;&#26377;&#29420;&#29305;&#30340;&#29305;&#28857;&#65292;&#24182;&#36890;&#36807;&#21046;&#23450;&#33258;&#28982;&#30340;&#28608;&#21169;&#29305;&#24615;&#24471;&#21040;&#20102;&#39564;&#35777;&#12290;</title><link>http://arxiv.org/abs/2310.10826</link><description>&lt;p&gt;
&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#30340;&#26426;&#21046;&#35774;&#35745;
&lt;/p&gt;
&lt;p&gt;
Mechanism Design for Large Language Models. (arXiv:2310.10826v1 [cs.GT])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.10826
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#20027;&#35201;&#30740;&#31350;&#20102;&#25903;&#25345;AI&#29983;&#25104;&#20869;&#23481;&#30340;&#25293;&#21334;&#26426;&#21046;&#35774;&#35745;&#65292;&#36890;&#36807;&#25552;&#20986;&#20196;&#29260;&#25293;&#21334;&#27169;&#22411;&#65292;&#23454;&#29616;&#20102;&#20197;&#28608;&#21169;&#20860;&#23481;&#30340;&#26041;&#24335;&#32858;&#21512;&#22810;&#20010;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65292;&#24182;&#29992;&#20110;&#32467;&#21512;&#19981;&#21516;&#24191;&#21578;&#21830;&#30340;&#36755;&#20837;&#12290;&#36825;&#20010;&#26426;&#21046;&#35774;&#35745;&#26377;&#29420;&#29305;&#30340;&#29305;&#28857;&#65292;&#24182;&#36890;&#36807;&#21046;&#23450;&#33258;&#28982;&#30340;&#28608;&#21169;&#29305;&#24615;&#24471;&#21040;&#20102;&#39564;&#35777;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#25293;&#21334;&#26426;&#21046;&#20197;&#25903;&#25345;&#26032;&#20852;&#30340;AI&#29983;&#25104;&#20869;&#23481;&#30340;&#26684;&#24335;&#12290;&#25105;&#20204;&#29305;&#21035;&#30740;&#31350;&#22914;&#20309;&#20197;&#28608;&#21169;&#20860;&#23481;&#30340;&#26041;&#24335;&#32858;&#21512;&#22810;&#20010;LLM&#12290;&#22312;&#36825;&#20010;&#38382;&#39064;&#20013;&#65292;&#27599;&#20010;&#20195;&#29702;&#23545;&#38543;&#26426;&#29983;&#25104;&#30340;&#20869;&#23481;&#30340;&#20559;&#22909;&#34987;&#25551;&#36848;/&#32534;&#30721;&#20026;&#19968;&#20010;LLM&#12290;&#35774;&#35745;&#19968;&#20010;&#29992;&#20110;AI&#29983;&#25104;&#30340;&#24191;&#21578;&#21019;&#24847;&#30340;&#25293;&#21334;&#26684;&#24335;&#26469;&#32467;&#21512;&#26469;&#33258;&#19981;&#21516;&#24191;&#21578;&#21830;&#30340;&#36755;&#20837;&#26159;&#19968;&#20010;&#20851;&#38190;&#21160;&#26426;&#12290;&#25105;&#20204;&#35748;&#20026;&#65292;&#23613;&#31649;&#36825;&#20010;&#38382;&#39064;&#36890;&#24120;&#23646;&#20110;&#26426;&#21046;&#35774;&#35745;&#30340;&#33539;&#30068;&#65292;&#20294;&#23427;&#20855;&#26377;&#19968;&#20123;&#29420;&#29305;&#30340;&#29305;&#28857;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#36890;&#29992;&#30340;&#24418;&#24335;&#21270;&#26041;&#27861;&#8212;&#8212;&#20196;&#29260;&#25293;&#21334;&#27169;&#22411;&#8212;&#8212;&#26469;&#30740;&#31350;&#36825;&#20010;&#38382;&#39064;&#12290;&#36825;&#20010;&#27169;&#22411;&#30340;&#19968;&#20010;&#20851;&#38190;&#29305;&#28857;&#26159;&#23427;&#20197;&#20196;&#29260;&#20026;&#21333;&#20301;&#36827;&#34892;&#25805;&#20316;&#65292;&#24182;&#20801;&#35768;LLM&#20195;&#29702;&#36890;&#36807;&#19968;&#32500;&#20986;&#20215;&#24433;&#21709;&#29983;&#25104;&#30340;&#20869;&#23481;&#12290;&#25105;&#20204;&#39318;&#20808;&#25506;&#35752;&#20102;&#19968;&#20010;&#24378;&#22823;&#30340;&#25293;&#21334;&#35774;&#35745;&#26041;&#27861;&#65292;&#20854;&#20013;&#25105;&#20204;&#20551;&#35774;&#30340;&#26159;&#20195;&#29702;&#20154;&#30340;&#20559;&#22909;&#28041;&#21450;&#21040;&#32467;&#26524;&#20998;&#24067;&#30340;&#20559;&#24207;&#12290;&#25105;&#20204;&#21046;&#23450;&#20102;&#20004;&#20010;&#33258;&#28982;&#30340;&#28608;&#21169;&#29305;&#24615;&#65292;&#24182;&#35777;&#26126;&#20102;&#36825;&#20123;&#29305;&#24615;&#30340;&#37325;&#35201;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
We investigate auction mechanisms to support the emerging format of AI-generated content. We in particular study how to aggregate several LLMs in an incentive compatible manner. In this problem, the preferences of each agent over stochastically generated contents are described/encoded as an LLM. A key motivation is to design an auction format for AI-generated ad creatives to combine inputs from different advertisers. We argue that this problem, while generally falling under the umbrella of mechanism design, has several unique features. We propose a general formalism -- the token auction model -- for studying this problem. A key feature of this model is that it acts on a token-by-token basis and lets LLM agents influence generated contents through single dimensional bids.  We first explore a robust auction design approach, in which all we assume is that agent preferences entail partial orders over outcome distributions. We formulate two natural incentive properties, and show that these 
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#35843;&#26597;&#20102;&#8220;&#21033;&#29992;&#20449;&#24687;&#19981;&#23545;&#31216;&#30340;&#21093;&#21066;&#19994;&#21153;&#8221;&#27169;&#24335;&#65292;&#21363;&#36890;&#36807;&#36164;&#26412;&#21270;&#20449;&#24687;&#19981;&#23545;&#31216;&#26469;&#21093;&#21066;&#24369;&#21183;&#32676;&#20307;&#65292;&#29305;&#21035;&#20851;&#27880;&#20197;&#38750;&#19987;&#23478;&#20026;&#30446;&#26631;&#30340;&#20225;&#19994;&#25110;&#27450;&#35784;&#32773;&#21033;&#29992;&#20449;&#24687;&#19981;&#23545;&#31216;&#21521;&#32477;&#26395;&#20010;&#20307;&#38144;&#21806;&#20135;&#21697;&#25110;&#26381;&#21153;&#12290;</title><link>http://arxiv.org/abs/2310.09802</link><description>&lt;p&gt;
&#21033;&#29992;&#20449;&#24687;&#19981;&#23545;&#31216;&#30340;&#21093;&#21066;&#19994;&#21153;
&lt;/p&gt;
&lt;p&gt;
Exploitation Business: Leveraging Information Asymmetry. (arXiv:2310.09802v1 [cs.CY])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.09802
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#35843;&#26597;&#20102;&#8220;&#21033;&#29992;&#20449;&#24687;&#19981;&#23545;&#31216;&#30340;&#21093;&#21066;&#19994;&#21153;&#8221;&#27169;&#24335;&#65292;&#21363;&#36890;&#36807;&#36164;&#26412;&#21270;&#20449;&#24687;&#19981;&#23545;&#31216;&#26469;&#21093;&#21066;&#24369;&#21183;&#32676;&#20307;&#65292;&#29305;&#21035;&#20851;&#27880;&#20197;&#38750;&#19987;&#23478;&#20026;&#30446;&#26631;&#30340;&#20225;&#19994;&#25110;&#27450;&#35784;&#32773;&#21033;&#29992;&#20449;&#24687;&#19981;&#23545;&#31216;&#21521;&#32477;&#26395;&#20010;&#20307;&#38144;&#21806;&#20135;&#21697;&#25110;&#26381;&#21153;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#35843;&#26597;&#20102;&#8220;&#21033;&#29992;&#20449;&#24687;&#19981;&#23545;&#31216;&#30340;&#21093;&#21066;&#19994;&#21153;&#8221;&#27169;&#24335;&#65292;&#35813;&#27169;&#24335;&#21033;&#29992;&#20449;&#24687;&#19981;&#23545;&#31216;&#26469;&#21093;&#21066;&#24369;&#21183;&#32676;&#20307;&#12290;&#23427;&#20027;&#35201;&#20851;&#27880;&#20197;&#38750;&#19987;&#23478;&#20026;&#30446;&#26631;&#30340;&#20225;&#19994;&#25110;&#27450;&#35784;&#32773;&#65292;&#20182;&#20204;&#21033;&#29992;&#20449;&#24687;&#19981;&#23545;&#31216;&#21521;&#32477;&#26395;&#30340;&#20010;&#20307;&#38144;&#21806;&#20135;&#21697;&#25110;&#26381;&#21153;&#12290;&#36825;&#31181;&#29616;&#35937;&#20063;&#34987;&#25551;&#36848;&#20026;&#8220;&#22522;&#20110;&#20449;&#24687;&#21093;&#21066;&#30340;&#30408;&#21033;&#27963;&#21160;&#8221;&#65292;&#23427;&#20381;&#36182;&#20110;&#20010;&#20307;&#23545;&#20449;&#24687;&#30340;&#26377;&#38480;&#33719;&#21462;&#12289;&#32570;&#20047;&#19987;&#19994;&#30693;&#35782;&#20197;&#21450;&#23545;&#38169;&#22833;&#26426;&#20250;&#30340;&#24656;&#24807;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper investigates the "Exploitation Business" model, which capitalizes on information asymmetry to exploit vulnerable populations. It focuses on businesses targeting non-experts or fraudsters who capitalize on information asymmetry to sell their products or services to desperate individuals. This phenomenon is also described as "profit-making activities based on informational exploitation," which thrives on individuals' limited access to information, lack of expertise, and Fear of Missing Out (FOMO).
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#36890;&#36807;&#24341;&#20837;&#19968;&#20010;&#26032;&#30340;&#25968;&#23383;&#20135;&#21697;&#20986;&#21475;&#21644;&#36827;&#21475;&#25968;&#25454;&#38598;&#65292;&#25506;&#35752;&#20102;&#25968;&#23383;&#20135;&#21697;&#36152;&#26131;&#30340;&#20116;&#20010;&#20851;&#38190;&#26041;&#38754;&#65306;1&#65289;&#25968;&#23383;&#20135;&#21697;&#20986;&#21475;&#30340;&#36215;&#28304;&#26356;&#21152;&#31354;&#38388;&#38598;&#20013;&#65307;2&#65289;&#25968;&#23383;&#20135;&#21697;&#36152;&#26131;&#22686;&#38271;&#36895;&#24230;&#24555;&#20110;&#23454;&#29289;&#36152;&#26131;&#65307;3&#65289;&#25968;&#23383;&#20135;&#21697;&#36152;&#26131;&#35268;&#27169;&#36275;&#22815;&#22823;&#65292;&#21487;&#20197;&#22312;&#19968;&#23450;&#31243;&#24230;&#19978;&#25269;&#28040;&#23454;&#29289;&#36152;&#26131;&#36870;&#24046;&#65307;4&#65289;&#23558;&#32463;&#27982;&#22686;&#38271;&#19982;&#28201;&#23460;&#27668;&#20307;&#25490;&#25918;&#20998;&#31163;&#30340;&#22269;&#23478;&#22312;&#25968;&#23383;&#20135;&#21697;&#39046;&#22495;&#25317;&#26377;&#36739;&#22823;&#19988;&#22686;&#38271;&#26356;&#24555;&#30340;&#20986;&#21475;&#65307;5&#65289;&#25968;&#23383;&#20135;&#21697;&#34987;&#32435;&#20837;&#32463;&#27982;&#22797;&#26434;&#24615;&#30340;&#34913;&#37327;&#25351;&#26631;&#20013;&#12290;</title><link>http://arxiv.org/abs/2310.02253</link><description>&lt;p&gt;
&#25968;&#23383;&#20135;&#21697;&#30340;&#22686;&#38271;&#12289;&#22320;&#29702;&#21644;&#36152;&#26131;&#24433;&#21709;
&lt;/p&gt;
&lt;p&gt;
The Growth, Geography, and Implications of Trade in Digital Products. (arXiv:2310.02253v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.02253
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#36890;&#36807;&#24341;&#20837;&#19968;&#20010;&#26032;&#30340;&#25968;&#23383;&#20135;&#21697;&#20986;&#21475;&#21644;&#36827;&#21475;&#25968;&#25454;&#38598;&#65292;&#25506;&#35752;&#20102;&#25968;&#23383;&#20135;&#21697;&#36152;&#26131;&#30340;&#20116;&#20010;&#20851;&#38190;&#26041;&#38754;&#65306;1&#65289;&#25968;&#23383;&#20135;&#21697;&#20986;&#21475;&#30340;&#36215;&#28304;&#26356;&#21152;&#31354;&#38388;&#38598;&#20013;&#65307;2&#65289;&#25968;&#23383;&#20135;&#21697;&#36152;&#26131;&#22686;&#38271;&#36895;&#24230;&#24555;&#20110;&#23454;&#29289;&#36152;&#26131;&#65307;3&#65289;&#25968;&#23383;&#20135;&#21697;&#36152;&#26131;&#35268;&#27169;&#36275;&#22815;&#22823;&#65292;&#21487;&#20197;&#22312;&#19968;&#23450;&#31243;&#24230;&#19978;&#25269;&#28040;&#23454;&#29289;&#36152;&#26131;&#36870;&#24046;&#65307;4&#65289;&#23558;&#32463;&#27982;&#22686;&#38271;&#19982;&#28201;&#23460;&#27668;&#20307;&#25490;&#25918;&#20998;&#31163;&#30340;&#22269;&#23478;&#22312;&#25968;&#23383;&#20135;&#21697;&#39046;&#22495;&#25317;&#26377;&#36739;&#22823;&#19988;&#22686;&#38271;&#26356;&#24555;&#30340;&#20986;&#21475;&#65307;5&#65289;&#25968;&#23383;&#20135;&#21697;&#34987;&#32435;&#20837;&#32463;&#27982;&#22797;&#26434;&#24615;&#30340;&#34913;&#37327;&#25351;&#26631;&#20013;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#23613;&#31649;&#20840;&#29699;&#21162;&#21147;&#21327;&#35843;&#22269;&#38469;&#36152;&#26131;&#32479;&#35745;&#25968;&#25454;&#65292;&#25105;&#20204;&#23545;&#25968;&#23383;&#20135;&#21697;&#30340;&#36152;&#26131;&#21450;&#20854;&#24433;&#21709;&#30340;&#29702;&#35299;&#20173;&#28982;&#19981;&#28165;&#26970;&#12290;&#22312;&#36825;&#37324;&#65292;&#25105;&#20204;&#36890;&#36807;&#24341;&#20837;&#19968;&#20010;&#26032;&#30340;&#25968;&#23383;&#20135;&#21697;&#20986;&#21475;&#21644;&#36827;&#21475;&#25968;&#25454;&#38598;&#65292;&#30740;&#31350;&#25968;&#23383;&#20135;&#21697;&#36152;&#26131;&#30340;&#20116;&#20010;&#20851;&#38190;&#26041;&#38754;&#12290;&#39318;&#20808;&#65292;&#25105;&#20204;&#34920;&#26126;&#19982;&#23454;&#29289;&#21830;&#21697;&#36152;&#26131;&#30456;&#27604;&#65292;&#25968;&#23383;&#20135;&#21697;&#20986;&#21475;&#30340;&#36215;&#28304;&#26356;&#21152;&#31354;&#38388;&#38598;&#20013;&#12290;&#20854;&#27425;&#65292;&#25105;&#20204;&#34920;&#26126;&#22312;2016&#24180;&#33267;2021&#24180;&#20043;&#38388;&#65292;&#25968;&#23383;&#20135;&#21697;&#36152;&#26131;&#22686;&#38271;&#36895;&#24230;&#24555;&#20110;&#23454;&#29289;&#36152;&#26131;&#65292;&#24180;&#22343;&#22686;&#38271;&#29575;&#20026;20%&#65292;&#32780;&#23454;&#29289;&#36152;&#26131;&#20026;6%&#12290;&#31532;&#19977;&#65292;&#25105;&#20204;&#34920;&#26126;&#25968;&#23383;&#20135;&#21697;&#36152;&#26131;&#35268;&#27169;&#36275;&#22815;&#22823;&#65292;&#21487;&#20197;&#22312;&#19968;&#23450;&#31243;&#24230;&#19978;&#25269;&#28040;&#19968;&#20123;&#37325;&#35201;&#30340;&#36152;&#26131;&#24179;&#34913;&#20272;&#35745;&#65292;&#22914;&#32654;&#22269;&#30340;&#23454;&#29289;&#36152;&#26131;&#36870;&#24046;&#12290;&#31532;&#22235;&#65292;&#25105;&#20204;&#34920;&#26126;&#37027;&#20123;&#23558;&#32463;&#27982;&#22686;&#38271;&#19982;&#28201;&#23460;&#27668;&#20307;&#25490;&#25918;&#20998;&#31163;&#30340;&#22269;&#23478;&#65292;&#22312;&#25968;&#23383;&#20135;&#21697;&#39046;&#22495;&#25317;&#26377;&#36739;&#22823;&#19988;&#22686;&#38271;&#26356;&#24555;&#30340;&#20986;&#21475;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#23558;&#25968;&#23383;&#20135;&#21697;&#32435;&#20837;&#32463;&#27982;&#22797;&#26434;&#24615;&#30340;&#34913;&#37327;&#25351;&#26631;&#20013;&#12290;
&lt;/p&gt;
&lt;p&gt;
Despite global efforts to harmonize international trade statistics, our understanding about trade in digital products and its implications remains elusive. Here, we study five key aspects of trade in digital products by introducing a novel dataset on the exports and imports of digital products. First, we show that compared to trade in physical goods, the origin of digital products exports is more spatially concentrated. Second, we show that between 2016 and 2021 trade in digital products grew faster than physical trade, at an annualized growth rate of 20% compared to 6% for physical trade. Third, we show that trade in digital products is large enough to partly offset some important trade balance estimates, like the physical trade deficit of the United States. Fourth, we show that countries that have decoupled economic growth from greenhouse gas emissions have larger and faster growing exports in digital product sectors. Finally, we add digital products to measures of economic complexit
&lt;/p&gt;</description></item><item><title>&#36825;&#31687;&#35770;&#25991;&#24320;&#21457;&#20102;&#19968;&#20010;&#26032;&#30340;&#38750;&#21442;&#25968;&#27169;&#22411;&#26469;&#35299;&#20915;&#38750;&#36776;&#35782;&#24615;&#38382;&#39064;&#65292;&#35813;&#27169;&#22411;&#20551;&#35774;&#28040;&#36153;&#32773;&#26377;&#26377;&#30028;&#29702;&#24615;&#65292;&#24182;&#19988;&#33021;&#22815;&#20934;&#30830;&#35299;&#37322;&#23458;&#25143;&#30340;&#36873;&#25321;&#34892;&#20026;&#12290;</title><link>http://arxiv.org/abs/2302.04354</link><description>&lt;p&gt;
&#19968;&#20010;&#38750;&#21442;&#25968;&#38543;&#26426;&#38598;&#21512;&#27169;&#22411;&#65306;&#37492;&#21035;&#65292;&#20248;&#21270;&#21644;&#39044;&#27979;
&lt;/p&gt;
&lt;p&gt;
A Nonparametric Stochastic Set Model: Identification, Optimization, and Prediction. (arXiv:2302.04354v2 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2302.04354
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#24320;&#21457;&#20102;&#19968;&#20010;&#26032;&#30340;&#38750;&#21442;&#25968;&#27169;&#22411;&#26469;&#35299;&#20915;&#38750;&#36776;&#35782;&#24615;&#38382;&#39064;&#65292;&#35813;&#27169;&#22411;&#20551;&#35774;&#28040;&#36153;&#32773;&#26377;&#26377;&#30028;&#29702;&#24615;&#65292;&#24182;&#19988;&#33021;&#22815;&#20934;&#30830;&#35299;&#37322;&#23458;&#25143;&#30340;&#36873;&#25321;&#34892;&#20026;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36873;&#25321;&#27169;&#22411;&#30340;&#37492;&#21035;&#23545;&#20110;&#29702;&#35299;&#28040;&#36153;&#32773;&#34892;&#20026;&#65292;&#35774;&#35745;&#33829;&#38144;&#25919;&#31574;&#21644;&#24320;&#21457;&#26032;&#20135;&#21697;&#33267;&#20851;&#37325;&#35201;&#12290;&#21442;&#25968;&#36873;&#25321;&#22522;&#20110;&#38656;&#27714;&#27169;&#22411;&#30340;&#37492;&#21035;&#65292;&#22914;&#22810;&#39033;&#24335;&#36873;&#25321;&#27169;&#22411;&#65288;MNL&#65289;&#65292;&#36890;&#24120;&#26159;&#30452;&#25509;&#30340;&#12290;&#28982;&#32780;&#65292;&#38750;&#21442;&#25968;&#27169;&#22411;&#22312;&#35299;&#37322;&#23458;&#25143;&#36873;&#25321;&#26041;&#38754;&#38750;&#24120;&#26377;&#25928;&#21644;&#28789;&#27963;&#65292;&#20294;&#21487;&#33021;&#20250;&#36935;&#21040;&#32500;&#24230;&#28798;&#38590;&#65292;&#24182;&#22833;&#21435;&#21487;&#36776;&#35782;&#24615;&#12290;&#20363;&#22914;&#65292;&#25490;&#21517;&#27169;&#22411;&#26159;&#19968;&#20010;&#38750;&#21442;&#25968;&#27169;&#22411;&#65292;&#26088;&#22312;&#27169;&#25311;&#38543;&#26426;&#25928;&#29992;&#26368;&#22823;&#21270;&#65288;RUM&#65289;&#21407;&#21017;&#65292;&#24050;&#34987;&#35748;&#20026;&#20809;&#20174;&#36873;&#25321;&#27010;&#29575;&#38598;&#21512;&#26412;&#36523;&#26080;&#27861;&#36776;&#35782;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#20010;&#26032;&#30340;&#38750;&#21442;&#25968;&#27169;&#22411;&#31867;&#21035;&#65292;&#19981;&#21463;&#38750;&#36776;&#35782;&#24615;&#38382;&#39064;&#30340;&#24433;&#21709;&#12290;&#25105;&#20204;&#30340;&#27169;&#22411;&#20551;&#35774;&#28040;&#36153;&#32773;&#26377;&#26377;&#30028;&#29702;&#24615;&#65292;&#23548;&#33268;&#23545;&#31216;&#38656;&#27714; cannibalization &#24182;&#26377;&#36259;&#22320;&#23454;&#29616;&#23436;&#20840;&#36776;&#35782;&#12290;&#20063;&#23601;&#26159;&#35828;&#65292;&#25105;&#20204;&#21487;&#20197;&#21807;&#19968;&#26500;&#24314;&#27169;&#22411;&#21442;&#25968;&#65292;&#20197;&#31934;&#30830;&#22320;&#35299;&#37322;&#23458;&#25143;&#36873;&#25321;&#34892;&#20026;&#12290;
&lt;/p&gt;
&lt;p&gt;
The identification of choice models is crucial for understanding consumer behavior, designing marketing policies, and developing new products. The identification of parametric choice-based demand models, such as the multinomial choice model (MNL), is typically straightforward. However, nonparametric models, which are highly effective and flexible in explaining customer choices, may encounter the curse of the dimensionality and lose their identifiability. For example, the ranking-based model, which is a nonparametric model and designed to mirror the random utility maximization (RUM) principle, is known to be nonidentifiable from the collection of choice probabilities alone. In this paper, we develop a new class of nonparametric models that is not subject to the problem of nonidentifiability. Our model assumes bounded rationality of consumers, which results in symmetric demand cannibalization and intriguingly enables full identification. That is to say, we can uniquely construct the mode
&lt;/p&gt;</description></item></channel></rss>