<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#26412;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#20351;&#29992;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#22312;&#25968;&#23383;&#24179;&#21488;&#19978;&#36827;&#34892;&#36328;&#26102;&#39044;&#27979;&#21327;&#35843;&#30340;&#38750;&#32447;&#24615;&#20998;&#23618;&#39044;&#27979;&#21327;&#35843;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#33021;&#22815;&#30452;&#25509;&#19988;&#33258;&#21160;&#21270;&#22320;&#29983;&#25104;&#36328;&#26102;&#39044;&#27979;&#21327;&#35843;&#30340;&#39044;&#27979;&#65292;&#36890;&#36807;&#23545;&#26469;&#33258;&#25353;&#38656;&#20132;&#20184;&#24179;&#21488;&#30340;&#22823;&#35268;&#27169;&#27969;&#24335;&#25968;&#25454;&#38598;&#36827;&#34892;&#23454;&#35777;&#27979;&#35797;&#12290;</title><link>https://arxiv.org/abs/2402.09033</link><description>&lt;p&gt;
&#20351;&#29992;&#26426;&#22120;&#23398;&#20064;&#22312;&#25968;&#23383;&#24179;&#21488;&#19978;&#36827;&#34892;&#36328;&#26102;&#39044;&#27979;&#21327;&#35843;
&lt;/p&gt;
&lt;p&gt;
Cross-Temporal Forecast Reconciliation at Digital Platforms with Machine Learning
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.09033
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#20351;&#29992;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#22312;&#25968;&#23383;&#24179;&#21488;&#19978;&#36827;&#34892;&#36328;&#26102;&#39044;&#27979;&#21327;&#35843;&#30340;&#38750;&#32447;&#24615;&#20998;&#23618;&#39044;&#27979;&#21327;&#35843;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#33021;&#22815;&#30452;&#25509;&#19988;&#33258;&#21160;&#21270;&#22320;&#29983;&#25104;&#36328;&#26102;&#39044;&#27979;&#21327;&#35843;&#30340;&#39044;&#27979;&#65292;&#36890;&#36807;&#23545;&#26469;&#33258;&#25353;&#38656;&#20132;&#20184;&#24179;&#21488;&#30340;&#22823;&#35268;&#27169;&#27969;&#24335;&#25968;&#25454;&#38598;&#36827;&#34892;&#23454;&#35777;&#27979;&#35797;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24179;&#21488;&#19994;&#21153;&#22312;&#25968;&#23383;&#26680;&#24515;&#19978;&#36816;&#20316;&#65292;&#20854;&#20915;&#31574;&#38656;&#35201;&#19981;&#21516;&#23618;&#27425;&#65288;&#20363;&#22914;&#22320;&#29702;&#21306;&#22495;&#65289;&#21644;&#26102;&#38388;&#32858;&#21512;&#65288;&#20363;&#22914;&#20998;&#38047;&#21040;&#22825;&#65289;&#30340;&#39640;&#32500;&#20934;&#30830;&#39044;&#27979;&#27969;&#12290;&#20026;&#20102;&#30830;&#20445;&#19981;&#21516;&#35268;&#21010;&#21333;&#20803;&#65288;&#22914;&#23450;&#20215;&#12289;&#20135;&#21697;&#12289;&#25511;&#21046;&#21644;&#25112;&#30053;&#65289;&#20043;&#38388;&#30340;&#20915;&#31574;&#19968;&#33268;&#65292;&#20063;&#38656;&#35201;&#22312;&#23618;&#27425;&#32467;&#26500;&#30340;&#25152;&#26377;&#32423;&#21035;&#19978;&#36827;&#34892;&#21327;&#35843;&#39044;&#27979;&#12290;&#37492;&#20110;&#24179;&#21488;&#25968;&#25454;&#27969;&#20855;&#26377;&#22797;&#26434;&#30340;&#29305;&#24449;&#21644;&#30456;&#20114;&#20381;&#36182;&#20851;&#31995;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#31181;&#38750;&#32447;&#24615;&#20998;&#23618;&#39044;&#27979;&#21327;&#35843;&#26041;&#27861;&#65292;&#36890;&#36807;&#20351;&#29992;&#27969;&#34892;&#30340;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#65292;&#20197;&#30452;&#25509;&#21644;&#33258;&#21160;&#21270;&#30340;&#26041;&#24335;&#29983;&#25104;&#36328;&#26102;&#39044;&#27979;&#21327;&#35843;&#30340;&#39044;&#27979;&#12290;&#35813;&#26041;&#27861;&#36275;&#22815;&#24555;&#65292;&#21487;&#20197;&#28385;&#36275;&#24179;&#21488;&#25152;&#38656;&#30340;&#22522;&#20110;&#39044;&#27979;&#30340;&#39640;&#39057;&#20915;&#31574;&#12290;&#25105;&#20204;&#20351;&#29992;&#26469;&#33258;&#39046;&#20808;&#30340;&#25353;&#38656;&#20132;&#20184;&#24179;&#21488;&#30340;&#29420;&#29305;&#22823;&#35268;&#27169;&#27969;&#24335;&#25968;&#25454;&#38598;&#23545;&#25105;&#20204;&#30340;&#26694;&#26550;&#36827;&#34892;&#20102;&#23454;&#35777;&#27979;&#35797;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.09033v1 Announce Type: new Abstract: Platform businesses operate on a digital core and their decision making requires high-dimensional accurate forecast streams at different levels of cross-sectional (e.g., geographical regions) and temporal aggregation (e.g., minutes to days). It also necessitates coherent forecasts across all levels of the hierarchy to ensure aligned decision making across different planning units such as pricing, product, controlling and strategy. Given that platform data streams feature complex characteristics and interdependencies, we introduce a non-linear hierarchical forecast reconciliation method that produces cross-temporal reconciled forecasts in a direct and automated way through the use of popular machine learning methods. The method is sufficiently fast to allow forecast-based high-frequency decision making that platforms require. We empirically test our framework on a unique, large-scale streaming dataset from a leading on-demand delivery plat
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#24191;&#20041;&#38543;&#26426;&#26862;&#26519;&#30340;&#38750;&#21442;&#25968;&#20272;&#35745;&#26041;&#27861;&#65292;&#29992;&#20110;&#20272;&#35745;&#32473;&#23450;X&#26465;&#20214;&#19979;Y&#30340;&#26465;&#20214;&#23494;&#24230;&#12290;&#35813;&#26041;&#27861;&#37319;&#29992;&#20102;&#25351;&#25968;&#32423;&#25968;&#26469;&#34920;&#31034;&#26465;&#20214;&#23494;&#24230;&#65292;&#24182;&#36890;&#36807;&#35299;&#20915;&#19968;&#20010;&#38750;&#32447;&#24615;&#26041;&#31243;&#32452;&#26469;&#24471;&#21040;&#31995;&#25968;&#12290;&#23454;&#39564;&#32467;&#26524;&#34920;&#26126;&#65292;&#35813;&#26041;&#27861;&#26159;&#19968;&#33268;&#30340;&#65292;&#24182;&#19988;&#22312;&#20801;&#35768;&#22522;&#20989;&#25968;&#32500;&#24230;&#26080;&#38480;&#22686;&#38271;&#30340;&#24773;&#20917;&#19979;&#28176;&#36817;&#27491;&#24577;&#12290;&#21516;&#26102;&#65292;&#26412;&#25991;&#36824;&#25552;&#20379;&#20102;&#19968;&#20010;&#26631;&#20934;&#35823;&#20844;&#24335;&#26469;&#26500;&#24314;&#32622;&#20449;&#21306;&#38388;&#12290;</title><link>http://arxiv.org/abs/2309.13251</link><description>&lt;p&gt;
&#27010;&#29575;&#26080;&#38480;&#21046;&#20272;&#35745;&#19979;&#30340;&#26465;&#20214;&#23494;&#24230;&#30340;&#38750;&#21442;&#25968;&#20272;&#35745;&#26041;&#27861;&#65306;&#24191;&#20041;&#38543;&#26426;&#26862;&#26519;
&lt;/p&gt;
&lt;p&gt;
Nonparametric estimation of conditional densities by generalized random forests. (arXiv:2309.13251v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.13251
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#24191;&#20041;&#38543;&#26426;&#26862;&#26519;&#30340;&#38750;&#21442;&#25968;&#20272;&#35745;&#26041;&#27861;&#65292;&#29992;&#20110;&#20272;&#35745;&#32473;&#23450;X&#26465;&#20214;&#19979;Y&#30340;&#26465;&#20214;&#23494;&#24230;&#12290;&#35813;&#26041;&#27861;&#37319;&#29992;&#20102;&#25351;&#25968;&#32423;&#25968;&#26469;&#34920;&#31034;&#26465;&#20214;&#23494;&#24230;&#65292;&#24182;&#36890;&#36807;&#35299;&#20915;&#19968;&#20010;&#38750;&#32447;&#24615;&#26041;&#31243;&#32452;&#26469;&#24471;&#21040;&#31995;&#25968;&#12290;&#23454;&#39564;&#32467;&#26524;&#34920;&#26126;&#65292;&#35813;&#26041;&#27861;&#26159;&#19968;&#33268;&#30340;&#65292;&#24182;&#19988;&#22312;&#20801;&#35768;&#22522;&#20989;&#25968;&#32500;&#24230;&#26080;&#38480;&#22686;&#38271;&#30340;&#24773;&#20917;&#19979;&#28176;&#36817;&#27491;&#24577;&#12290;&#21516;&#26102;&#65292;&#26412;&#25991;&#36824;&#25552;&#20379;&#20102;&#19968;&#20010;&#26631;&#20934;&#35823;&#20844;&#24335;&#26469;&#26500;&#24314;&#32622;&#20449;&#21306;&#38388;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#32771;&#34385;&#36830;&#32493;&#38543;&#26426;&#21464;&#37327;Y&#21644;&#36830;&#32493;&#38543;&#26426;&#21521;&#37327;X&#30340;&#24773;&#20917;&#19979;&#65292;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#38750;&#21442;&#25968;&#20272;&#35745;&#22120;f^(.|x)&#65292;&#29992;&#20110;&#32473;&#23450;X=x&#26465;&#20214;&#19979;Y&#30340;&#26465;&#20214;&#23494;&#24230;&#12290;&#35813;&#20272;&#35745;&#22120;&#37319;&#29992;&#20102;&#19968;&#20010;&#25351;&#25968;&#32423;&#25968;&#30340;&#24418;&#24335;&#65292;&#20854;&#31995;&#25968;T = (T1,...,TJ)&#26159;&#19968;&#32452;&#20381;&#36182;&#20110;&#26465;&#20214;&#26399;&#26395;&#20272;&#35745;&#22120;E[p(Y)|X=x]&#30340;&#38750;&#32447;&#24615;&#26041;&#31243;&#32452;&#30340;&#35299;&#65292;&#20854;&#20013;p(.)&#26159;&#19968;&#20010;J&#32500;&#22522;&#20989;&#25968;&#21521;&#37327;&#12290;&#19968;&#20010;&#20851;&#38190;&#29305;&#28857;&#26159;E[p(Y)|X=x]&#36890;&#36807;&#24191;&#20041;&#38543;&#26426;&#26862;&#26519;&#65288;Athey, Tibshirani, and Wager, 2019&#65289;&#26469;&#36827;&#34892;&#20272;&#35745;&#65292;&#20197;&#38024;&#23545;&#19981;&#21516;x&#19979;T&#30340;&#24322;&#36136;&#24615;&#12290;&#25105;&#35777;&#26126;&#20102;f^(.|x)&#26159;&#19968;&#33268;&#30340;&#65292;&#24182;&#19988;&#22312;&#20801;&#35768;J&#26080;&#38480;&#22686;&#38271;&#30340;&#24773;&#20917;&#19979;&#28176;&#36817;&#27491;&#24577;&#65292;&#24182;&#25552;&#20379;&#20102;&#19968;&#20010;&#26631;&#20934;&#35823;&#20844;&#24335;&#26469;&#26500;&#24314;&#28176;&#36817;&#26377;&#25928;&#30340;&#32622;&#20449;&#21306;&#38388;&#12290;&#36890;&#36807;Monte Carlo&#23454;&#39564;&#21644;&#23454;&#35777;&#20998;&#26512;&#24471;&#21040;&#20102;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
Considering a continuous random variable Y together with a continuous random vector X, I propose a nonparametric estimator f^(.|x) for the conditional density of Y given X=x. This estimator takes the form of an exponential series whose coefficients T = (T1,...,TJ) are the solution of a system of nonlinear equations that depends on an estimator of the conditional expectation E[p(Y)|X=x], where p(.) is a J-dimensional vector of basis functions. A key feature is that E[p(Y)|X=x] is estimated by generalized random forest (Athey, Tibshirani, and Wager, 2019), targeting the heterogeneity of T across x. I show that f^(.|x) is uniformly consistent and asymptotically normal, while allowing J to grow to infinity. I also provide a standard error formula to construct asymptotically valid confidence intervals. Results from Monte Carlo experiments and an empirical illustration are provided.
&lt;/p&gt;</description></item><item><title>&#36164;&#26412;&#22686;&#38271;&#21644;&#21152;&#36895;&#19981;&#20381;&#36182;&#20110;&#20928;&#20648;&#33988;&#25110;&#28040;&#36153;&#30340;&#38480;&#21046;&#65292;&#23545;&#32463;&#27982;&#25945;&#32946;&#21644;&#20844;&#20849;&#25919;&#31574;&#26377;&#37325;&#35201;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2309.03403</link><description>&lt;p&gt;
&#36164;&#26412;&#22686;&#38271;&#30340;&#26469;&#28304;
&lt;/p&gt;
&lt;p&gt;
Sources of capital growth. (arXiv:2309.03403v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.03403
&lt;/p&gt;
&lt;p&gt;
&#36164;&#26412;&#22686;&#38271;&#21644;&#21152;&#36895;&#19981;&#20381;&#36182;&#20110;&#20928;&#20648;&#33988;&#25110;&#28040;&#36153;&#30340;&#38480;&#21046;&#65292;&#23545;&#32463;&#27982;&#25945;&#32946;&#21644;&#20844;&#20849;&#25919;&#31574;&#26377;&#37325;&#35201;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26681;&#25454;&#22269;&#27665;&#36134;&#25143;&#25968;&#25454;&#26174;&#31034;&#65292;&#20928;&#20648;&#33988;&#25110;&#28040;&#36153;&#30340;&#21464;&#21270;&#19982;&#24066;&#20540;&#36164;&#26412;&#22686;&#38271;&#29575;&#30340;&#21464;&#21270;&#65288;&#36164;&#26412;&#21152;&#36895;&#24230;&#65289;&#20043;&#38388;&#27809;&#26377;&#24433;&#21709;&#12290;&#22240;&#27492;&#65292;&#36164;&#26412;&#22686;&#38271;&#21644;&#21152;&#36895;&#20284;&#20046;&#19981;&#20381;&#36182;&#20110;&#20928;&#20648;&#33988;&#25110;&#28040;&#36153;&#30340;&#38480;&#21046;&#12290;&#25105;&#20204;&#25506;&#35752;&#20102;&#36825;&#31181;&#21487;&#33021;&#24615;&#65292;&#24182;&#35752;&#35770;&#20102;&#23545;&#32463;&#27982;&#25945;&#32946;&#21644;&#20844;&#20849;&#25919;&#31574;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
Data from national accounts show no effect of change in net saving or consumption, in ratio to market-value capital, on change in growth rate of market-value capital (capital acceleration). Thus it appears that capital growth and acceleration arrive without help from net saving or consumption restraint. We explore ways in which this is possible, and discuss implications for economic teaching and public policy
&lt;/p&gt;</description></item></channel></rss>