<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#25552;&#20986;&#20102;&#39640;&#32500;&#23614;&#25351;&#25968;&#22238;&#24402;&#26041;&#27861;&#65292;&#21033;&#29992;&#27491;&#21017;&#21270;&#20272;&#35745;&#21644;&#21435;&#20559;&#26041;&#27861;&#36827;&#34892;&#25512;&#26029;&#65292;&#25903;&#25345;&#29702;&#35770;&#30340;&#20223;&#30495;&#30740;&#31350;&#65292;&#24182;&#22312;&#31038;&#20132;&#23186;&#20307;&#30149;&#27602;&#24086;&#23376;&#25991;&#26412;&#20998;&#26512;&#20013;&#24212;&#29992;&#12290;</title><link>https://arxiv.org/abs/2403.01318</link><description>&lt;p&gt;
&#39640;&#32500;&#23614;&#25351;&#25968;&#22238;&#24402;&#65306;&#20197;&#31038;&#20132;&#23186;&#20307;&#30149;&#27602;&#24086;&#23376;&#25991;&#26412;&#20998;&#26512;&#20026;&#20363;
&lt;/p&gt;
&lt;p&gt;
High-Dimensional Tail Index Regression: with An Application to Text Analyses of Viral Posts in Social Media
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.01318
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#39640;&#32500;&#23614;&#25351;&#25968;&#22238;&#24402;&#26041;&#27861;&#65292;&#21033;&#29992;&#27491;&#21017;&#21270;&#20272;&#35745;&#21644;&#21435;&#20559;&#26041;&#27861;&#36827;&#34892;&#25512;&#26029;&#65292;&#25903;&#25345;&#29702;&#35770;&#30340;&#20223;&#30495;&#30740;&#31350;&#65292;&#24182;&#22312;&#31038;&#20132;&#23186;&#20307;&#30149;&#27602;&#24086;&#23376;&#25991;&#26412;&#20998;&#26512;&#20013;&#24212;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21463;&#31038;&#20132;&#23186;&#20307;&#30149;&#27602;&#24086;&#23376;&#30340;&#28857;&#36190;&#20998;&#24067;&#65288;&#22914;&#28857;&#36190;&#25968;&#37327;&#65289;&#32463;&#39564;&#24615;&#24130;&#24459;&#30340;&#21551;&#21457;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#39640;&#32500;&#23614;&#25351;&#25968;&#22238;&#24402;&#21450;&#20854;&#21442;&#25968;&#30340;&#20272;&#35745;&#21644;&#25512;&#26029;&#26041;&#27861;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#27491;&#21017;&#21270;&#20272;&#35745;&#37327;&#65292;&#35777;&#26126;&#20102;&#23427;&#30340;&#19968;&#33268;&#24615;&#65292;&#24182;&#25512;&#23548;&#20102;&#20854;&#25910;&#25947;&#36895;&#24230;&#12290;&#20026;&#20102;&#36827;&#34892;&#25512;&#26029;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#21435;&#20559;&#27491;&#21017;&#21270;&#20272;&#35745;&#65292;&#35777;&#26126;&#20102;&#21435;&#20559;&#20272;&#35745;&#37327;&#30340;&#28176;&#36817;&#27491;&#24577;&#24615;&#12290;&#20223;&#30495;&#30740;&#31350;&#25903;&#25345;&#20102;&#25105;&#20204;&#30340;&#29702;&#35770;&#12290;&#36825;&#20123;&#26041;&#27861;&#34987;&#24212;&#29992;&#20110;&#23545;&#28041;&#21450; LGBTQ+ &#35805;&#39064;&#30340; X&#65288;&#21407; Twitter&#65289;&#30149;&#27602;&#24086;&#23376;&#30340;&#25991;&#26412;&#20998;&#26512;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.01318v1 Announce Type: cross  Abstract: Motivated by the empirical power law of the distributions of credits (e.g., the number of "likes") of viral posts in social media, we introduce the high-dimensional tail index regression and methods of estimation and inference for its parameters. We propose a regularized estimator, establish its consistency, and derive its convergence rate. To conduct inference, we propose to debias the regularized estimate, and establish the asymptotic normality of the debiased estimator. Simulation studies support our theory. These methods are applied to text analyses of viral posts in X (formerly Twitter) concerning LGBTQ+.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#20004;&#21521;&#38598;&#32676;&#20381;&#36182;&#19979;&#30340;&#26497;&#20540;&#20998;&#20301;&#25968;&#65292;&#21457;&#29616;&#22312;&#23614;&#37096;&#65292;&#26080;&#26465;&#20214;&#30340;&#20013;&#38388;&#32423;&#21035;&#20998;&#20301;&#25968;&#30340;&#26497;&#38480;&#20998;&#24067;&#25910;&#25947;&#20110;&#39640;&#26031;&#20998;&#24067;&#65292;&#24182;&#23558;&#20854;&#25193;&#23637;&#21040;&#20013;&#38388;&#32423;&#21035;&#30340;&#26497;&#20540;&#20998;&#20301;&#25968;&#22238;&#24402;&#12290;</title><link>https://arxiv.org/abs/2402.19268</link><description>&lt;p&gt;
&#20004;&#21521;&#32858;&#31867;&#19979;&#20013;&#38388;&#32423;&#21035;&#39034;&#24207;&#30340;&#26497;&#20540;&#20998;&#20301;&#25968;
&lt;/p&gt;
&lt;p&gt;
Extremal quantiles of intermediate orders under two-way clustering
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.19268
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#20004;&#21521;&#38598;&#32676;&#20381;&#36182;&#19979;&#30340;&#26497;&#20540;&#20998;&#20301;&#25968;&#65292;&#21457;&#29616;&#22312;&#23614;&#37096;&#65292;&#26080;&#26465;&#20214;&#30340;&#20013;&#38388;&#32423;&#21035;&#20998;&#20301;&#25968;&#30340;&#26497;&#38480;&#20998;&#24067;&#25910;&#25947;&#20110;&#39640;&#26031;&#20998;&#24067;&#65292;&#24182;&#23558;&#20854;&#25193;&#23637;&#21040;&#20013;&#38388;&#32423;&#21035;&#30340;&#26497;&#20540;&#20998;&#20301;&#25968;&#22238;&#24402;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#20004;&#21521;&#38598;&#32676;&#20381;&#36182;&#19979;&#30340;&#26497;&#20540;&#20998;&#20301;&#25968;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#23614;&#37096;&#26080;&#26465;&#20214;&#20013;&#38388;&#32423;&#21035;&#20998;&#20301;&#25968;&#30340;&#26497;&#38480;&#20998;&#24067;&#25910;&#25947;&#20110;&#39640;&#26031;&#20998;&#24067;&#12290;&#36825;&#19968;&#28857;&#38750;&#24120;&#37325;&#35201;&#65292;&#22240;&#20026;&#36890;&#24120;&#24773;&#20917;&#19979;&#65292;&#20004;&#21521;&#38598;&#32676;&#20381;&#36182;&#28041;&#21450;&#28508;&#22312;&#30340;&#38750;&#39640;&#26031;&#24615;&#65292;&#20294;&#26497;&#20540;&#20998;&#20301;&#25968;&#19981;&#20250;&#21463;&#21040;&#27492;&#38382;&#39064;&#30340;&#24433;&#21709;&#12290;&#22522;&#20110;&#36825;&#19968;&#32467;&#26524;&#65292;&#25105;&#20204;&#23558;&#20998;&#26512;&#25193;&#23637;&#21040;&#20013;&#38388;&#32423;&#21035;&#30340;&#26497;&#20540;&#20998;&#20301;&#25968;&#22238;&#24402;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.19268v1 Announce Type: cross  Abstract: This paper investigates extremal quantiles under two-way cluster dependence. We demonstrate that the limiting distribution of the unconditional intermediate order quantiles in the tails converges to a Gaussian distribution. This is remarkable as two-way cluster dependence entails potential non-Gaussianity in general, but extremal quantiles do not suffer from this issue. Building upon this result, we extend our analysis to extremal quantile regressions of intermediate order.
&lt;/p&gt;</description></item></channel></rss>