<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#26412;&#30740;&#31350;&#26500;&#24314;&#20102;&#19968;&#20010;&#21160;&#24577;&#36135;&#24065;&#27169;&#22411;&#26469;&#30740;&#31350;&#20805;&#20998;&#20934;&#22791;&#37329;&#38134;&#34892;&#20307;&#31995;&#30340;&#19981;&#31283;&#23450;&#24615;&#65292;&#21457;&#29616;&#24403;&#20934;&#22791;&#37329;&#35201;&#27714;&#36739;&#20302;&#26102;&#65292;&#24179;&#34913;&#26356;&#23481;&#26131;&#34920;&#29616;&#20986;&#20869;&#29983;&#30340;&#21608;&#26399;&#24615;&#12289;&#28151;&#27788;&#24615;&#21644;&#38543;&#26426;&#21160;&#24577;&#65292;&#36825;&#21487;&#33021;&#26159;&#32463;&#27982;&#27874;&#21160;&#30340;&#21478;&#19968;&#20010;&#26469;&#28304;&#12290;</title><link>http://arxiv.org/abs/2305.14503</link><description>&lt;p&gt;
&#35770;&#20805;&#20998;&#20934;&#22791;&#37329;&#38134;&#34892;&#30340;&#19981;&#31283;&#23450;&#24615;
&lt;/p&gt;
&lt;p&gt;
On the Instability of Fractional Reserve Banking. (arXiv:2305.14503v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.14503
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#26500;&#24314;&#20102;&#19968;&#20010;&#21160;&#24577;&#36135;&#24065;&#27169;&#22411;&#26469;&#30740;&#31350;&#20805;&#20998;&#20934;&#22791;&#37329;&#38134;&#34892;&#20307;&#31995;&#30340;&#19981;&#31283;&#23450;&#24615;&#65292;&#21457;&#29616;&#24403;&#20934;&#22791;&#37329;&#35201;&#27714;&#36739;&#20302;&#26102;&#65292;&#24179;&#34913;&#26356;&#23481;&#26131;&#34920;&#29616;&#20986;&#20869;&#29983;&#30340;&#21608;&#26399;&#24615;&#12289;&#28151;&#27788;&#24615;&#21644;&#38543;&#26426;&#21160;&#24577;&#65292;&#36825;&#21487;&#33021;&#26159;&#32463;&#27982;&#27874;&#21160;&#30340;&#21478;&#19968;&#20010;&#26469;&#28304;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#26500;&#24314;&#20102;&#19968;&#20010;&#21160;&#24577;&#36135;&#24065;&#27169;&#22411;&#26469;&#30740;&#31350;&#20805;&#20998;&#20934;&#22791;&#37329;&#38134;&#34892;&#20307;&#31995;&#30340;&#65288;&#19981;&#65289;&#31283;&#23450;&#24615;&#12290;&#27169;&#22411;&#34920;&#26126;&#65292;&#20805;&#20998;&#20934;&#22791;&#37329;&#38134;&#34892;&#20307;&#31995;&#22312;&#36739;&#20302;&#30340;&#20934;&#22791;&#37329;&#35201;&#27714;&#19979;&#65292;&#24179;&#34913;&#26356;&#23481;&#26131;&#34920;&#29616;&#20986;&#20869;&#29983;&#30340;&#21608;&#26399;&#24615;&#12289;&#28151;&#27788;&#24615;&#21644;&#38543;&#26426;&#21160;&#24577;&#65292;&#23613;&#31649;&#23427;&#33021;&#22815;&#22686;&#21152;&#31283;&#24577;&#28040;&#36153;&#12290;&#23558;&#20869;&#29983;&#26080;&#25269;&#25276;&#20449;&#36151;&#24341;&#20837;&#22522;&#32447;&#27169;&#22411;&#24182;&#19981;&#25913;&#21464;&#20027;&#35201;&#32467;&#26524;&#12290;&#26412;&#25991;&#36824;&#25552;&#20379;&#20102;&#19982;&#27169;&#22411;&#39044;&#27979;&#19968;&#33268;&#30340;&#23454;&#35777;&#35777;&#25454;&#12290;&#26657;&#20934;&#30340;&#32451;&#20064;&#34920;&#26126;&#65292;&#36825;&#31181;&#28192;&#36947;&#21487;&#33021;&#26159;&#32463;&#27982;&#27874;&#21160;&#30340;&#21478;&#19968;&#20010;&#26469;&#28304;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper develops a dynamic monetary model to study the (in)stability of the fractional reserve banking system. The model shows that the fractional reserve banking system can endanger stability in that equilibrium is more prone to exhibit endogenous cyclic, chaotic, and stochastic dynamics under lower reserve requirements, although it can increase consumption in the steady-state. Introducing endogenous unsecured credit to the baseline model does not change the main results. This paper also provides empirical evidence that is consistent with the prediction of the model. The calibrated exercise suggests that this channel could be another source of economic fluctuations.
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#23558;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#31639;&#27861;&#24212;&#29992;&#20110;&#26102;&#38388;&#24207;&#21015;&#39044;&#27979;&#65292;&#20197;&#25552;&#39640;&#38754;&#26495;&#25968;&#25454;&#20013;&#30340;&#22240;&#26524;&#25512;&#26029;&#20934;&#30830;&#24615;&#12290;&#36890;&#36807;&#23454;&#39564;&#35777;&#26126;&#65292;&#35813;&#31639;&#27861;&#22312;&#21508;&#31181;&#24773;&#26223;&#19979;&#26126;&#26174;&#20248;&#20110;&#29616;&#26377;&#26041;&#27861;&#65292;&#20026;&#38754;&#26495;&#25968;&#25454;&#30740;&#31350;&#25552;&#20379;&#20102;&#26032;&#30340;&#26041;&#27861;&#21644;&#24037;&#20855;&#12290;</title><link>http://arxiv.org/abs/2208.03489</link><description>&lt;p&gt;
&#38754;&#26495;&#25968;&#25454;&#22240;&#26524;&#25512;&#26029;&#30340;&#39044;&#27979;&#31639;&#27861;
&lt;/p&gt;
&lt;p&gt;
Forecasting Algorithms for Causal Inference with Panel Data. (arXiv:2208.03489v2 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2208.03489
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#23558;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#31639;&#27861;&#24212;&#29992;&#20110;&#26102;&#38388;&#24207;&#21015;&#39044;&#27979;&#65292;&#20197;&#25552;&#39640;&#38754;&#26495;&#25968;&#25454;&#20013;&#30340;&#22240;&#26524;&#25512;&#26029;&#20934;&#30830;&#24615;&#12290;&#36890;&#36807;&#23454;&#39564;&#35777;&#26126;&#65292;&#35813;&#31639;&#27861;&#22312;&#21508;&#31181;&#24773;&#26223;&#19979;&#26126;&#26174;&#20248;&#20110;&#29616;&#26377;&#26041;&#27861;&#65292;&#20026;&#38754;&#26495;&#25968;&#25454;&#30740;&#31350;&#25552;&#20379;&#20102;&#26032;&#30340;&#26041;&#27861;&#21644;&#24037;&#20855;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#31038;&#20250;&#31185;&#23398;&#30740;&#31350;&#20013;&#65292;&#20351;&#29992;&#38754;&#26495;&#25968;&#25454;&#36827;&#34892;&#22240;&#26524;&#25512;&#26029;&#26159;&#19968;&#39033;&#26680;&#24515;&#25361;&#25112;&#12290;&#25105;&#20204;&#23558;&#19968;&#31181;&#28145;&#24230;&#31070;&#32463;&#26550;&#26500;&#29992;&#20110;&#26102;&#38388;&#24207;&#21015;&#39044;&#27979;&#65288;N-BEATS&#31639;&#27861;&#65289;&#65292;&#20197;&#26356;&#20934;&#30830;&#22320;&#39044;&#27979;&#22312;&#26410;&#36827;&#34892;&#22788;&#29702;&#30340;&#24773;&#20917;&#19979;&#21463;&#27835;&#30103;&#21333;&#20301;&#30340;&#21453;&#20107;&#23454;&#28436;&#21464;&#12290;&#22312;&#21508;&#31181;&#24773;&#22659;&#19979;&#65292;&#25152;&#24471;&#21040;&#30340;&#20272;&#35745;&#22120;&#65288;&#8220;SyNBEATS&#8221;&#65289;&#22312;&#24615;&#33021;&#19978;&#26126;&#26174;&#20248;&#20110;&#24120;&#29992;&#26041;&#27861;&#65288;&#21512;&#25104;&#23545;&#29031;&#27861;&#12289;&#21452;&#21521;&#22266;&#23450;&#25928;&#24212;&#65289;&#65292;&#24182;&#19988;&#19982;&#26368;&#36817;&#25552;&#20986;&#30340;&#26041;&#27861;&#65288;&#21512;&#25104;&#24046;&#24322;&#27861;&#12289;&#30697;&#38453;&#34917;&#20840;&#65289;&#22312;&#20934;&#30830;&#24615;&#19978;&#36798;&#21040;&#20102;&#30456;&#24403;&#30340;&#27700;&#24179;&#25110;&#26356;&#39640;&#12290;&#25105;&#20204;&#30340;&#32467;&#26524;&#31361;&#26174;&#20102;&#22914;&#20309;&#21033;&#29992;&#39044;&#27979;&#25991;&#29486;&#30340;&#36827;&#23637;&#26469;&#25913;&#21892;&#38754;&#26495;&#25968;&#25454;&#29615;&#22659;&#19979;&#30340;&#22240;&#26524;&#25512;&#26029;&#12290;
&lt;/p&gt;
&lt;p&gt;
Conducting causal inference with panel data is a core challenge in social science research. We adapt a deep neural architecture for time series forecasting (the N-BEATS algorithm) to more accurately predict the counterfactual evolution of a treated unit had treatment not occurred. Across a range of settings, the resulting estimator ("SyNBEATS") significantly outperforms commonly employed methods (synthetic controls, two-way fixed effects), and attains comparable or more accurate performance compared to recently proposed methods (synthetic difference-in-differences, matrix completion). Our results highlight how advances in the forecasting literature can be harnessed to improve causal inference in panel data settings.
&lt;/p&gt;</description></item></channel></rss>