<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21483;&#20570;&#21512;&#25104;&#21305;&#37197;&#25511;&#21046;&#26041;&#27861;&#30340;&#31616;&#21333;&#32780;&#26377;&#25928;&#30340;&#26041;&#27861;&#26469;&#35299;&#20915;&#21512;&#25104;&#25511;&#21046;&#26041;&#27861;&#20013;&#30340;&#36873;&#25321;&#23545;&#40784;&#38382;&#39064;&#21644;&#27424;&#25311;&#21512;&#38382;&#39064;&#65292;&#24182;&#36890;&#36807;&#23545;&#27604;&#23454;&#39564;&#34920;&#26126;&#35813;&#26041;&#27861;&#26377;&#25928;&#22320;&#25552;&#39640;&#20102;&#22240;&#26524;&#25928;&#24212;&#30340;&#20272;&#35745;&#31934;&#24230;&#12290;</title><link>http://arxiv.org/abs/2306.02584</link><description>&lt;p&gt;
&#21512;&#25104;&#21305;&#37197;&#25511;&#21046;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Synthetic Matching Control Method. (arXiv:2306.02584v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.02584
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21483;&#20570;&#21512;&#25104;&#21305;&#37197;&#25511;&#21046;&#26041;&#27861;&#30340;&#31616;&#21333;&#32780;&#26377;&#25928;&#30340;&#26041;&#27861;&#26469;&#35299;&#20915;&#21512;&#25104;&#25511;&#21046;&#26041;&#27861;&#20013;&#30340;&#36873;&#25321;&#23545;&#40784;&#38382;&#39064;&#21644;&#27424;&#25311;&#21512;&#38382;&#39064;&#65292;&#24182;&#36890;&#36807;&#23545;&#27604;&#23454;&#39564;&#34920;&#26126;&#35813;&#26041;&#27861;&#26377;&#25928;&#22320;&#25552;&#39640;&#20102;&#22240;&#26524;&#25928;&#24212;&#30340;&#20272;&#35745;&#31934;&#24230;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#21512;&#25104;&#25511;&#21046;&#26041;&#27861;&#20013;&#65292;&#20272;&#35745;&#26435;&#37325;&#28041;&#21450;&#21516;&#26102;&#36873;&#25321;&#21644;&#23545;&#40784;&#23545;&#29031;&#32452;&#20197;&#25509;&#36817;&#21305;&#37197;&#22788;&#29702;&#32452;&#30340;&#20248;&#21270;&#36807;&#31243;&#12290;&#28982;&#32780;&#65292;&#36825;&#31181;&#21516;&#26102;&#36873;&#25321;&#21644;&#23545;&#40784;&#25511;&#21046;&#32452;&#21333;&#20301;&#30340;&#26041;&#24335;&#21487;&#33021;&#23548;&#33268;&#21512;&#25104;&#25511;&#21046;&#26041;&#27861;&#25928;&#29575;&#30340;&#19979;&#38477;&#12290;&#21478;&#19968;&#20010;&#25285;&#24551;&#26159;&#30001;&#20110;&#19981;&#23436;&#32654;&#30340;&#39044;&#22788;&#29702;&#25311;&#21512;&#32780;&#23548;&#33268;&#30340;&#27424;&#25311;&#21512;&#38382;&#39064;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20004;&#20010;&#38382;&#39064;&#65292;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#31616;&#21333;&#26377;&#25928;&#30340;&#26041;&#27861;&#8212;&#8212;&#21512;&#25104;&#21305;&#37197;&#25511;&#21046;&#26041;&#27861;&#12290;&#35813;&#26041;&#27861;&#36890;&#36807;&#25191;&#34892;&#21333;&#21464;&#37327;&#32447;&#24615;&#22238;&#24402;&#26469;&#24314;&#31435;&#25511;&#21046;&#32452;&#30340;&#39044;&#22788;&#29702;&#26399;&#19982;&#22788;&#29702;&#32452;&#20043;&#38388;&#30340;&#36866;&#24403;&#21305;&#37197;&#65292;&#24182;&#36890;&#36807;&#21512;&#25104;&#21305;&#37197;&#26469;&#33719;&#24471;&#19968;&#20010;SMC&#20272;&#35745;&#37327;&#65292;&#20174;&#32780;&#25913;&#21892;&#20102;&#20272;&#35745;&#30340;&#25928;&#29575;&#21644;&#25311;&#21512;&#24230;&#12290;
&lt;/p&gt;
&lt;p&gt;
Estimating weights in the synthetic control method involves an optimization procedure that simultaneously selects and aligns control units in order to closely match the treated unit. However, this simultaneous selection and alignment of control units may lead to a loss of efficiency in the synthetic control method. Another concern arising from the aforementioned procedure is its susceptibility to under-fitting due to imperfect pretreatment fit. It is not uncommon for the linear combination, using nonnegative weights, of pre-treatment period outcomes for the control units to inadequately approximate the pre-treatment outcomes for the treated unit. To address both of these issues, this paper proposes a simple and effective method called Synthetic Matching Control (SMC). The SMC method begins by performing the univariate linear regression to establish a proper match between the pre-treatment periods of the control units and the treated unit. Subsequently, a SMC estimator is obtained by sy
&lt;/p&gt;</description></item></channel></rss>