<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#22810;&#32500;RDD&#30340;&#25805;&#32437;&#27979;&#35797;&#26041;&#27861;&#65292;&#36890;&#36807;&#29702;&#35770;&#27169;&#22411;&#25512;&#23548;&#20986;&#20851;&#20110;&#26465;&#20214;&#36793;&#38469;&#23494;&#24230;&#30340;&#21487;&#27979;&#35797;&#26263;&#31034;&#65292;&#24182;&#22522;&#20110;&#32479;&#35745;&#37327;&#30690;&#37327;&#30340;&#20108;&#27425;&#24418;&#24335;&#26500;&#24314;&#27979;&#35797;&#12290;</title><link>https://arxiv.org/abs/2402.10836</link><description>&lt;p&gt;
&#22810;&#32500;RDD&#30340;&#25805;&#32437;&#27979;&#35797;
&lt;/p&gt;
&lt;p&gt;
Manipulation Test for Multidimensional RDD
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.10836
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#22810;&#32500;RDD&#30340;&#25805;&#32437;&#27979;&#35797;&#26041;&#27861;&#65292;&#36890;&#36807;&#29702;&#35770;&#27169;&#22411;&#25512;&#23548;&#20986;&#20851;&#20110;&#26465;&#20214;&#36793;&#38469;&#23494;&#24230;&#30340;&#21487;&#27979;&#35797;&#26263;&#31034;&#65292;&#24182;&#22522;&#20110;&#32479;&#35745;&#37327;&#30690;&#37327;&#30340;&#20108;&#27425;&#24418;&#24335;&#26500;&#24314;&#27979;&#35797;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
Lee (2008)&#25552;&#20986;&#30340;&#22240;&#26524;&#25512;&#26029;&#27169;&#22411;&#36866;&#29992;&#20110;&#22238;&#24402;&#26029;&#28857;&#35774;&#35745;(RDD)&#65292;&#20381;&#36182;&#20110;&#26263;&#31034;&#20998;&#37197;&#65288;&#36816;&#34892;&#65289;&#21464;&#37327;&#30340;&#23494;&#24230;&#36830;&#32493;&#24615;&#30340;&#20551;&#35774;&#12290;&#36825;&#31181;&#20551;&#35774;&#30340;&#27979;&#35797;&#36890;&#24120;&#34987;&#31216;&#20026;&#25805;&#32437;&#27979;&#35797;&#65292;&#24182;&#22312;&#24212;&#29992;&#30740;&#31350;&#20013;&#32463;&#24120;&#25253;&#21578;&#65292;&#20197;&#21152;&#24378;&#35774;&#35745;&#30340;&#26377;&#25928;&#24615;&#12290;&#22810;&#32500;RDD&#65288;MRDD&#65289;&#23558;RDD&#25193;&#23637;&#21040;&#27835;&#30103;&#20998;&#37197;&#21462;&#20915;&#20110;&#22810;&#20010;&#36816;&#34892;&#21464;&#37327;&#30340;&#24773;&#22659;&#12290;&#26412;&#25991;&#24341;&#20837;&#20102;MRDD&#30340;&#25805;&#32437;&#27979;&#35797;&#12290;&#39318;&#20808;&#65292;&#23427;&#20026;MRDD&#36827;&#34892;&#22240;&#26524;&#25512;&#26029;&#30340;&#29702;&#35770;&#27169;&#22411;&#65292;&#29992;&#20110;&#25512;&#23548;&#20851;&#20110;&#36816;&#34892;&#21464;&#37327;&#30340;&#26465;&#20214;&#36793;&#38469;&#23494;&#24230;&#30340;&#21487;&#27979;&#35797;&#26263;&#31034;&#12290;&#28982;&#21518;&#65292;&#23427;&#22522;&#20110;&#20026;&#27599;&#20010;&#36793;&#38469;&#23494;&#24230;&#21333;&#29420;&#35745;&#31639;&#30340;&#32479;&#35745;&#37327;&#30690;&#37327;&#30340;&#20108;&#27425;&#24418;&#24335;&#26500;&#24314;&#20102;&#35813;&#20551;&#35774;&#30340;&#27979;&#35797;&#12290;&#26368;&#21518;&#65292;&#25552;&#20986;&#30340;&#27979;&#35797;&#19982;&#24120;&#29992;&#30340;&#22791;&#36873;&#31243;&#24207;&#36827;&#34892;&#20102;&#27604;&#36739;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.10836v1 Announce Type: new  Abstract: The causal inference model proposed by Lee (2008) for the regression discontinuity design (RDD) relies on assumptions that imply the continuity of the density of the assignment (running) variable. The test for this implication is commonly referred to as the manipulation test and is regularly reported in applied research to strengthen the design's validity. The multidimensional RDD (MRDD) extends the RDD to contexts where treatment assignment depends on several running variables. This paper introduces a manipulation test for the MRDD. First, it develops a theoretical model for causal inference with the MRDD, used to derive a testable implication on the conditional marginal densities of the running variables. Then, it constructs the test for the implication based on a quadratic form of a vector of statistics separately computed for each marginal density. Finally, the proposed test is compared with alternative procedures commonly employed i
&lt;/p&gt;</description></item><item><title>&#36890;&#36807;&#26681;&#25454;&#35009;&#21028;&#22312;&#27599;&#20010;&#22238;&#21512;&#20013;&#30340;&#32988;&#32773;&#26469;&#20915;&#23450;&#32988;&#21033;&#32773;&#30340;&#35780;&#20998;&#26041;&#27861;&#65292;&#21487;&#20197;&#20943;&#23569;&#25331;&#20987;&#35009;&#21028;&#30340;&#20559;&#35265;&#23545;&#27604;&#36187;&#32467;&#26524;&#30340;&#24433;&#21709;&#12290;</title><link>https://arxiv.org/abs/2402.06594</link><description>&lt;p&gt;
&#20182;&#20204;&#34987;&#25250;&#21163;&#20102;&#65281;&#36890;&#36807;&#20013;&#38388;&#20540;&#35780;&#20998;&#20943;&#23569;&#25331;&#20987;&#35009;&#21028;&#30340;&#20559;&#35265;
&lt;/p&gt;
&lt;p&gt;
They were robbed! Scoring by the middlemost to attenuate biased judging in boxing
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.06594
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#26681;&#25454;&#35009;&#21028;&#22312;&#27599;&#20010;&#22238;&#21512;&#20013;&#30340;&#32988;&#32773;&#26469;&#20915;&#23450;&#32988;&#21033;&#32773;&#30340;&#35780;&#20998;&#26041;&#27861;&#65292;&#21487;&#20197;&#20943;&#23569;&#25331;&#20987;&#35009;&#21028;&#30340;&#20559;&#35265;&#23545;&#27604;&#36187;&#32467;&#26524;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25331;&#20987;&#38271;&#26399;&#23384;&#22312;&#30528;&#20559;&#35265;&#35780;&#21028;&#30340;&#38382;&#39064;&#65292;&#19981;&#20165;&#24433;&#21709;&#32844;&#19994;&#25331;&#20987;&#36187;&#20107;&#65292;&#20063;&#24433;&#21709;&#22885;&#36816;&#27604;&#36187;&#12290;&#25152;&#35859;&#30340;&#8220;&#25250;&#21163;&#8221;&#29616;&#35937;&#35753;&#25331;&#20987;&#36816;&#21160;&#30340;&#31881;&#19997;&#21644;&#36816;&#21160;&#21592;&#20204;&#23545;&#27492;&#20135;&#29983;&#20102;&#30097;&#34385;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#31616;&#21270;&#30340;&#25331;&#20987;&#35780;&#20998;&#35843;&#25972;&#26041;&#27861;&#65306;&#26681;&#25454;&#35009;&#21028;&#22312;&#27599;&#20010;&#22238;&#21512;&#20013;&#30340;&#32988;&#32773;&#26469;&#20915;&#23450;&#32988;&#21033;&#32773;&#65292;&#32780;&#19981;&#26159;&#20381;&#38752;&#35009;&#21028;&#23545;&#25972;&#22330;&#27604;&#36187;&#30340;&#24635;&#20307;&#35780;&#20998;&#12290;&#36825;&#31181;&#26041;&#27861;&#22522;&#20110;&#31038;&#20250;&#36873;&#25321;&#29702;&#35770;&#65292;&#37319;&#29992;&#22810;&#25968;&#35268;&#21017;&#21644;&#20013;&#38388;&#20540;&#32858;&#21512;&#20989;&#25968;&#65292;&#23545;&#20559;&#34962;&#35009;&#21028;&#26500;&#25104;&#21327;&#35843;&#38382;&#39064;&#65292;&#20943;&#24369;&#20854;&#24433;&#21709;&#21147;&#12290;&#25105;&#20204;&#30340;&#27169;&#22411;&#20998;&#26512;&#21644;&#27169;&#25311;&#32467;&#26524;&#34920;&#26126;&#65292;&#36825;&#31181;&#26041;&#27861;&#21487;&#20197;&#26174;&#33879;&#20943;&#23569;&#20559;&#34962;&#35009;&#21028;&#24433;&#21709;&#27604;&#36187;&#32467;&#26524;&#30340;&#21487;&#33021;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Boxing has a long-standing problem with biased judging, impacting both professional and Olympic bouts. ''Robberies'', where boxers are widely seen as being denied rightful victories, threaten to drive fans and athletes away from the sport. To tackle this problem, we propose a minimalist adjustment in how boxing is scored: the winner would be decided by the majority of round-by-round victories according to the judges, rather than relying on the judges' overall bout scores. This approach, rooted in social choice theory and utilising majority rule and middlemost aggregation functions, creates a coordination problem for partisan judges and attenuates their influence. Our model analysis and simulations demonstrate the potential to significantly decrease the likelihood of a partisan judge swaying the result of a bout.
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#22312;&#38169;&#37197;&#30340;Copula&#27169;&#22411;&#20013;&#38480;&#21046;&#21453;&#39304;&#30340;&#21098;&#20999;&#26041;&#27861;&#65292;&#24182;&#35777;&#26126;&#20102;&#22312;&#21482;&#26377;&#19968;&#20010;&#27169;&#22359;&#38169;&#37197;&#30340;&#24773;&#20917;&#19979;&#65292;&#36866;&#24403;&#30340;&#21098;&#20999;&#21518;&#39564;&#25552;&#20379;&#20102;&#20934;&#30830;&#30340;&#19981;&#30830;&#23450;&#24615;&#37327;&#21270;&#12290;&#35813;&#26041;&#27861;&#22312;&#36125;&#21494;&#26031;&#25512;&#26029;&#20013;&#20855;&#26377;&#37325;&#35201;&#30340;&#24212;&#29992;&#12290;</title><link>http://arxiv.org/abs/2310.03521</link><description>&lt;p&gt;
&#22312;&#38169;&#37197;&#30340;Copula&#27169;&#22411;&#20013;&#38480;&#21046;&#21453;&#39304;&#30340;&#21098;&#20999;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Cutting Feedback in Misspecified Copula Models. (arXiv:2310.03521v1 [stat.ME])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.03521
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#22312;&#38169;&#37197;&#30340;Copula&#27169;&#22411;&#20013;&#38480;&#21046;&#21453;&#39304;&#30340;&#21098;&#20999;&#26041;&#27861;&#65292;&#24182;&#35777;&#26126;&#20102;&#22312;&#21482;&#26377;&#19968;&#20010;&#27169;&#22359;&#38169;&#37197;&#30340;&#24773;&#20917;&#19979;&#65292;&#36866;&#24403;&#30340;&#21098;&#20999;&#21518;&#39564;&#25552;&#20379;&#20102;&#20934;&#30830;&#30340;&#19981;&#30830;&#23450;&#24615;&#37327;&#21270;&#12290;&#35813;&#26041;&#27861;&#22312;&#36125;&#21494;&#26031;&#25512;&#26029;&#20013;&#20855;&#26377;&#37325;&#35201;&#30340;&#24212;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;Copula&#27169;&#22411;&#20013;&#65292;&#36793;&#32536;&#20998;&#24067;&#21644;Copula&#20989;&#25968;&#34987;&#20998;&#21035;&#25351;&#23450;&#12290;&#25105;&#20204;&#23558;&#23427;&#20204;&#35270;&#20026;&#27169;&#22359;&#21270;&#36125;&#21494;&#26031;&#25512;&#26029;&#26694;&#26550;&#20013;&#30340;&#20004;&#20010;&#27169;&#22359;&#65292;&#24182;&#25552;&#20986;&#36890;&#36807;&#8220;&#21098;&#20999;&#21453;&#39304;&#8221;&#36827;&#34892;&#20462;&#25913;&#30340;&#36125;&#21494;&#26031;&#25512;&#26029;&#26041;&#27861;&#12290;&#21098;&#20999;&#21453;&#39304;&#38480;&#21046;&#20102;&#21518;&#39564;&#25512;&#26029;&#20013;&#28508;&#22312;&#38169;&#37197;&#27169;&#22359;&#30340;&#24433;&#21709;&#12290;&#25105;&#20204;&#32771;&#34385;&#20004;&#31181;&#31867;&#22411;&#30340;&#21098;&#20999;&#26041;&#27861;&#12290;&#31532;&#19968;&#31181;&#38480;&#21046;&#20102;&#38169;&#37197;Copula&#23545;&#36793;&#32536;&#25512;&#26029;&#30340;&#24433;&#21709;&#65292;&#36825;&#26159;&#27969;&#34892;&#30340;&#36793;&#38469;&#25512;&#26029;&#65288;IFM&#65289;&#20272;&#35745;&#30340;&#36125;&#21494;&#26031;&#31867;&#20284;&#26041;&#27861;&#12290;&#31532;&#20108;&#31181;&#36890;&#36807;&#20351;&#29992;&#31209;&#20284;&#28982;&#23450;&#20041;&#21098;&#20999;&#27169;&#22411;&#26469;&#38480;&#21046;&#38169;&#37197;&#36793;&#32536;&#23545;Copula&#21442;&#25968;&#25512;&#26029;&#30340;&#24433;&#21709;&#12290;&#25105;&#20204;&#35777;&#26126;&#65292;&#22914;&#26524;&#21482;&#26377;&#19968;&#20010;&#27169;&#22359;&#38169;&#37197;&#65292;&#37027;&#20040;&#36866;&#24403;&#30340;&#21098;&#20999;&#21518;&#39564;&#22312;&#21478;&#19968;&#20010;&#27169;&#22359;&#30340;&#21442;&#25968;&#30340;&#28176;&#36817;&#19981;&#30830;&#23450;&#24615;&#37327;&#21270;&#26041;&#38754;&#26159;&#20934;&#30830;&#30340;&#12290;&#35745;&#31639;&#21098;&#20999;&#21518;&#39564;&#24456;&#22256;&#38590;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#26032;&#30340;&#21464;&#20998;&#25512;&#26029;&#26041;&#27861;&#26469;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;
In copula models the marginal distributions and copula function are specified separately. We treat these as two modules in a modular Bayesian inference framework, and propose conducting modified Bayesian inference by ``cutting feedback''. Cutting feedback limits the influence of potentially misspecified modules in posterior inference. We consider two types of cuts. The first limits the influence of a misspecified copula on inference for the marginals, which is a Bayesian analogue of the popular Inference for Margins (IFM) estimator. The second limits the influence of misspecified marginals on inference for the copula parameters by using a rank likelihood to define the cut model. We establish that if only one of the modules is misspecified, then the appropriate cut posterior gives accurate uncertainty quantification asymptotically for the parameters in the other module. Computation of the cut posteriors is difficult, and new variational inference methods to do so are proposed. The effic
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#19981;&#23436;&#20840;&#36981;&#23432;&#30340;&#38543;&#26426;&#23545;&#29031;&#35797;&#39564;&#20013;&#65292;&#26681;&#25454;"&#21305;&#37197;&#23545;"&#30830;&#23450;&#27835;&#30103;&#29366;&#24577;&#30340;&#23616;&#37096;&#24179;&#22343;&#27835;&#30103;&#25928;&#24212;&#30340;&#25512;&#26029;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#23545;&#26497;&#38480;&#26041;&#24046;&#30340;&#19968;&#33268;&#20272;&#35745;&#22120;&#12290;</title><link>http://arxiv.org/abs/2307.13094</link><description>&lt;p&gt;
&#21305;&#37197;&#23545;&#21644;&#19981;&#23436;&#20840;&#36981;&#23432;&#19979;&#30340;&#23454;&#39564;&#25512;&#26029;
&lt;/p&gt;
&lt;p&gt;
Inference in Experiments with Matched Pairs and Imperfect Compliance. (arXiv:2307.13094v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.13094
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#19981;&#23436;&#20840;&#36981;&#23432;&#30340;&#38543;&#26426;&#23545;&#29031;&#35797;&#39564;&#20013;&#65292;&#26681;&#25454;"&#21305;&#37197;&#23545;"&#30830;&#23450;&#27835;&#30103;&#29366;&#24577;&#30340;&#23616;&#37096;&#24179;&#22343;&#27835;&#30103;&#25928;&#24212;&#30340;&#25512;&#26029;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#23545;&#26497;&#38480;&#26041;&#24046;&#30340;&#19968;&#33268;&#20272;&#35745;&#22120;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#19981;&#23436;&#20840;&#36981;&#23432;&#30340;&#38543;&#26426;&#23545;&#29031;&#35797;&#39564;&#20013;&#65292;&#26681;&#25454;&#8220;&#21305;&#37197;&#23545;&#8221;&#30830;&#23450;&#27835;&#30103;&#29366;&#24577;&#30340;&#23616;&#37096;&#24179;&#22343;&#27835;&#30103;&#25928;&#24212;&#30340;&#25512;&#26029;&#12290;&#36890;&#36807;&#8220;&#21305;&#37197;&#23545;&#8221;&#65292;&#25105;&#20204;&#25351;&#30340;&#26159;&#20174;&#24863;&#20852;&#36259;&#30340;&#24635;&#20307;&#20013;&#29420;&#31435;&#21644;&#38543;&#26426;&#25277;&#21462;&#21333;&#20301;&#65292;&#26681;&#25454;&#35266;&#23519;&#21040;&#30340;&#22522;&#32447;&#21327;&#21464;&#37327;&#36827;&#34892;&#37197;&#23545;&#65292;&#28982;&#21518;&#22312;&#27599;&#20010;&#23545;&#20013;&#65292;&#38543;&#26426;&#36873;&#25321;&#19968;&#20010;&#21333;&#20301;&#36827;&#34892;&#27835;&#30103;&#12290;&#22312;&#23545;&#21305;&#37197;&#36136;&#37327;&#36827;&#34892;&#30340;&#24369;&#20551;&#35774;&#19979;&#65292;&#25105;&#20204;&#39318;&#20808;&#25512;&#23548;&#20102;&#20256;&#32479;&#30340;Wald&#65288;&#21363;&#20108;&#38454;&#26368;&#23567;&#20108;&#20056;&#65289;&#20272;&#35745;&#22120;&#30340;&#23616;&#37096;&#24179;&#22343;&#27835;&#30103;&#25928;&#24212;&#30340;&#26497;&#38480;&#34892;&#20026;&#12290;&#25105;&#20204;&#36827;&#19968;&#27493;&#26174;&#31034;&#65292;&#20256;&#32479;&#30340;&#24322;&#26041;&#24046;&#24615;&#31283;&#20581;&#20272;&#35745;&#22120;&#30340;&#26497;&#38480;&#26041;&#24046;&#36890;&#24120;&#26159;&#20445;&#23432;&#30340;&#65292;&#21363;&#20854;&#21487;&#33021;&#24615;&#26497;&#38480;&#27604;&#26497;&#38480;&#26041;&#24046;&#65288;&#36890;&#24120;&#20005;&#26684;&#22320;&#65289;&#22823;&#12290;&#22240;&#27492;&#65292;&#25105;&#20204;&#25552;&#20379;&#20102;&#19968;&#31181;&#23545;&#25152;&#38656;&#25968;&#37327;&#19968;&#33268;&#30340;&#26497;&#38480;&#26041;&#24046;&#30340;&#26367;&#20195;&#20272;&#35745;&#22120;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#32771;&#34385;&#20102;&#39069;&#22806;&#35266;&#23519;&#21040;&#30340;&#22522;&#32447;&#21327;&#21464;&#37327;&#30340;&#20351;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper studies inference for the local average treatment effect in randomized controlled trials with imperfect compliance where treatment status is determined according to "matched pairs." By "matched pairs," we mean that units are sampled i.i.d. from the population of interest, paired according to observed, baseline covariates and finally, within each pair, one unit is selected at random for treatment. Under weak assumptions governing the quality of the pairings, we first derive the limiting behavior of the usual Wald (i.e., two-stage least squares) estimator of the local average treatment effect. We show further that the conventional heteroskedasticity-robust estimator of its limiting variance is generally conservative in that its limit in probability is (typically strictly) larger than the limiting variance. We therefore provide an alternative estimator of the limiting variance that is consistent for the desired quantity. Finally, we consider the use of additional observed, base
&lt;/p&gt;</description></item><item><title>&#22312;&#22823;&#22411;&#36817;&#20284;&#22240;&#23376;&#27169;&#22411;&#20013;&#65292;&#25105;&#20204;&#35777;&#26126;&#20027;&#25104;&#20998;&#20272;&#35745;&#30340;&#22240;&#23376;&#36733;&#33655;&#19982;&#20934;&#26497;&#22823;&#20284;&#28982;&#20272;&#35745;&#30340;&#36733;&#33655;&#31561;&#20215;&#65292;&#21516;&#26102;&#36825;&#20004;&#31181;&#20272;&#35745;&#20063;&#19982;&#19981;&#21487;&#34892;&#26368;&#23567;&#20108;&#20056;&#20272;&#35745;&#30340;&#36733;&#33655;&#31561;&#20215;&#12290;&#25105;&#20204;&#36824;&#35777;&#26126;&#20102;&#20934;&#26497;&#22823;&#20284;&#28982;&#20272;&#35745;&#30340;&#21327;&#26041;&#24046;&#30697;&#38453;&#19982;&#19981;&#21487;&#34892;&#26368;&#23567;&#20108;&#20056;&#30340;&#21327;&#26041;&#24046;&#30697;&#38453;&#31561;&#20215;&#65292;&#20174;&#32780;&#21487;&#20197;&#31616;&#21270;&#20934;&#26497;&#22823;&#20284;&#28982;&#20272;&#35745;&#30340;&#32622;&#20449;&#21306;&#38388;&#30340;&#20272;&#35745;&#36807;&#31243;&#12290;&#25152;&#26377;&#32467;&#26524;&#37117;&#36866;&#29992;&#20110;&#20551;&#35774;&#24322;&#26041;&#24046;&#36328;&#25130;&#38754;&#30340;&#19968;&#33324;&#24773;&#20917;&#12290;</title><link>http://arxiv.org/abs/2307.09864</link><description>&lt;p&gt;
&#22823;&#22411;&#36817;&#20284;&#22240;&#23376;&#27169;&#22411;&#20013;&#20027;&#25104;&#20998;&#21644;&#20934;&#26497;&#22823;&#20284;&#28982;&#20272;&#35745;&#37327;&#30340;&#28176;&#36817;&#31561;&#20215;&#24615;&#20998;&#26512;
&lt;/p&gt;
&lt;p&gt;
Asymptotic equivalence of Principal Component and Quasi Maximum Likelihood estimators in Large Approximate Factor Models. (arXiv:2307.09864v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.09864
&lt;/p&gt;
&lt;p&gt;
&#22312;&#22823;&#22411;&#36817;&#20284;&#22240;&#23376;&#27169;&#22411;&#20013;&#65292;&#25105;&#20204;&#35777;&#26126;&#20027;&#25104;&#20998;&#20272;&#35745;&#30340;&#22240;&#23376;&#36733;&#33655;&#19982;&#20934;&#26497;&#22823;&#20284;&#28982;&#20272;&#35745;&#30340;&#36733;&#33655;&#31561;&#20215;&#65292;&#21516;&#26102;&#36825;&#20004;&#31181;&#20272;&#35745;&#20063;&#19982;&#19981;&#21487;&#34892;&#26368;&#23567;&#20108;&#20056;&#20272;&#35745;&#30340;&#36733;&#33655;&#31561;&#20215;&#12290;&#25105;&#20204;&#36824;&#35777;&#26126;&#20102;&#20934;&#26497;&#22823;&#20284;&#28982;&#20272;&#35745;&#30340;&#21327;&#26041;&#24046;&#30697;&#38453;&#19982;&#19981;&#21487;&#34892;&#26368;&#23567;&#20108;&#20056;&#30340;&#21327;&#26041;&#24046;&#30697;&#38453;&#31561;&#20215;&#65292;&#20174;&#32780;&#21487;&#20197;&#31616;&#21270;&#20934;&#26497;&#22823;&#20284;&#28982;&#20272;&#35745;&#30340;&#32622;&#20449;&#21306;&#38388;&#30340;&#20272;&#35745;&#36807;&#31243;&#12290;&#25152;&#26377;&#32467;&#26524;&#37117;&#36866;&#29992;&#20110;&#20551;&#35774;&#24322;&#26041;&#24046;&#36328;&#25130;&#38754;&#30340;&#19968;&#33324;&#24773;&#20917;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#35777;&#26126;&#22312;&#19968;&#20010;$n$&#32500;&#30340;&#31283;&#23450;&#26102;&#38388;&#24207;&#21015;&#21521;&#37327;&#30340;&#36817;&#20284;&#22240;&#23376;&#27169;&#22411;&#20013;&#65292;&#36890;&#36807;&#20027;&#25104;&#20998;&#20272;&#35745;&#30340;&#22240;&#23376;&#36733;&#33655;&#22312;$n\to\infty$&#26102;&#19982;&#20934;&#26497;&#22823;&#20284;&#28982;&#20272;&#35745;&#24471;&#21040;&#30340;&#36733;&#33655;&#31561;&#20215;&#12290;&#36825;&#20004;&#31181;&#20272;&#35745;&#37327;&#22312;$n\to\infty$&#26102;&#20063;&#19982;&#22914;&#26524;&#35266;&#23519;&#21040;&#22240;&#23376;&#26102;&#30340;&#19981;&#21487;&#34892;&#26368;&#23567;&#20108;&#20056;&#20272;&#35745;&#31561;&#20215;&#12290;&#25105;&#20204;&#36824;&#35777;&#26126;&#20102;&#20934;&#26497;&#22823;&#20284;&#28982;&#20272;&#35745;&#30340;&#28176;&#36817;&#21327;&#26041;&#24046;&#30697;&#38453;&#30340;&#20256;&#32479;&#19977;&#26126;&#27835;&#24418;&#24335;&#19982;&#19981;&#21487;&#34892;&#26368;&#23567;&#20108;&#20056;&#30340;&#31616;&#21333;&#28176;&#36817;&#21327;&#26041;&#24046;&#30697;&#38453;&#31561;&#20215;&#12290;&#36825;&#25552;&#20379;&#20102;&#19968;&#31181;&#31616;&#21333;&#30340;&#26041;&#27861;&#26469;&#20272;&#35745;&#20934;&#26497;&#22823;&#20284;&#28982;&#20272;&#35745;&#30340;&#28176;&#36817;&#32622;&#20449;&#21306;&#38388;&#65292;&#32780;&#19981;&#38656;&#35201;&#20272;&#35745;&#22797;&#26434;&#30340;&#28023;&#26862;&#30697;&#38453;&#21644;&#36153;&#35874;&#23572;&#20449;&#24687;&#30697;&#38453;&#12290;&#25152;&#26377;&#32467;&#26524;&#22343;&#36866;&#29992;&#20110;&#20551;&#35774;&#24322;&#26041;&#24046;&#36328;&#25130;&#38754;&#30340;&#19968;&#33324;&#24773;&#20917;&#12290;
&lt;/p&gt;
&lt;p&gt;
We prove that in an approximate factor model for an $n$-dimensional vector of stationary time series the factor loadings estimated via Principal Components are asymptotically equivalent, as $n\to\infty$, to those estimated by Quasi Maximum Likelihood. Both estimators are, in turn, also asymptotically equivalent, as $n\to\infty$, to the unfeasible Ordinary Least Squares estimator we would have if the factors were observed. We also show that the usual sandwich form of the asymptotic covariance matrix of the Quasi Maximum Likelihood estimator is asymptotically equivalent to the simpler asymptotic covariance matrix of the unfeasible Ordinary Least Squares. This provides a simple way to estimate asymptotic confidence intervals for the Quasi Maximum Likelihood estimator without the need of estimating the Hessian and Fisher information matrices whose expressions are very complex. All our results hold in the general case in which the idiosyncratic components are cross-sectionally heteroskedast
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#27604;&#20363;&#20195;&#34920;&#26041;&#27861;&#65292;COWPEA&#65292;&#21487;&#26681;&#25454;&#20505;&#36873;&#20154;&#19981;&#21516;&#30340;&#26435;&#37325;&#36827;&#34892;&#26368;&#20248;&#36873;&#20030;&#65292;&#24182;&#21487;&#36716;&#25442;&#20026;&#20998;&#25968;&#25110;&#20998;&#32423;&#25237;&#31080;&#26041;&#27861;&#12290;</title><link>http://arxiv.org/abs/2305.08857</link><description>&lt;p&gt;
COWPEA&#65288;&#20505;&#36873;&#20154;&#25353;&#27604;&#20363;&#20351;&#29992;&#36190;&#25104;&#25237;&#31080;&#36827;&#34892;&#26368;&#20248;&#21152;&#26435;&#65289;&#65306;&#19968;&#31181;&#26032;&#30340;&#27604;&#20363;&#20195;&#34920;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
COWPEA (Candidates Optimally Weighted in Proportional Election using Approval voting). (arXiv:2305.08857v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.08857
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#27604;&#20363;&#20195;&#34920;&#26041;&#27861;&#65292;COWPEA&#65292;&#21487;&#26681;&#25454;&#20505;&#36873;&#20154;&#19981;&#21516;&#30340;&#26435;&#37325;&#36827;&#34892;&#26368;&#20248;&#36873;&#20030;&#65292;&#24182;&#21487;&#36716;&#25442;&#20026;&#20998;&#25968;&#25110;&#20998;&#32423;&#25237;&#31080;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25551;&#36848;&#20102;&#19968;&#31181;&#20351;&#29992;&#36190;&#25104;&#25237;&#31080;&#30340;&#27604;&#20363;&#20195;&#34920;&#26032;&#26041;&#27861;&#65292;&#31216;&#20026;COWPEA&#65288;&#20505;&#36873;&#20154;&#25353;&#27604;&#20363;&#20351;&#29992;&#36190;&#25104;&#25237;&#31080;&#36827;&#34892;&#26368;&#20248;&#21152;&#26435;&#65289;&#12290;COWPEA&#22312;&#36873;&#25321;&#19968;&#23450;&#25968;&#37327;&#30340;&#20505;&#36873;&#20154;&#26102;&#65292;&#21487;&#20197;&#26681;&#25454;&#20854;&#19981;&#21516;&#30340;&#26435;&#37325;&#36827;&#34892;&#26368;&#20248;&#36873;&#20030;&#65292;&#32780;&#19981;&#26159;&#21482;&#32473;&#20104;&#22266;&#23450;&#25968;&#37327;&#30456;&#21516;&#30340;&#26435;&#37325;&#12290;COWPEA Lottery &#26159;&#19968;&#20010;&#19981;&#30830;&#23450;&#24615;&#30340;&#29256;&#26412;&#65292;&#21487;&#20197;&#36873;&#25321;&#19968;&#23450;&#25968;&#37327;&#30340;&#20505;&#36873;&#20154;&#65292;&#24182;&#20351;&#23427;&#20204;&#25317;&#26377;&#30456;&#31561;&#30340;&#26435;&#37325;&#12290;COWPEA&#26159;&#21807;&#19968;&#24050;&#30693;&#36890;&#36807;&#21333;&#35843;&#24615;&#12289;&#19982;&#26080;&#20851;&#36873;&#31080;&#21644;&#26222;&#36941;&#21916;&#27426;&#30340;&#20505;&#36873;&#20154;&#26631;&#20934;&#30340;&#27604;&#20363;&#26041;&#27861;&#12290;&#21516;&#26102;&#65292;&#20063;&#26377;&#26041;&#27861;&#21487;&#20197;&#23558;COWPEA&#21644;COWPEA Lottery&#36716;&#25442;&#20026;&#20998;&#25968;&#25110;&#20998;&#32423;&#25237;&#31080;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper describes a new method of proportional representation that uses approval voting, known as COWPEA (Candidates Optimally Weighted in Proportional Election using Approval voting). COWPEA optimally elects an unlimited number of candidates with potentially different weights to a body, rather than giving a fixed number equal weight. A version that elects a fixed a number of candidates with equal weight does exist, but it is non-deterministic, and is known as COWPEA Lottery. This is the only proportional method known to pass monotonicity, Independence of Irrelevant Ballots, and the Universally Liked Candidate criterion. There are also ways to convert COWPEA and COWPEA Lottery to a score or graded voting method.
&lt;/p&gt;</description></item></channel></rss>