<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;Probit&#21644;Tobit&#27169;&#22411;&#20013;&#30340;&#31471;&#28857;&#25928;&#24212;&#19982;&#20869;&#29983;&#24615;&#65292;&#35777;&#26126;&#20102;&#26410;&#21306;&#20998;&#20004;&#31181;&#20869;&#29983;&#24615;&#20250;&#23548;&#33268;&#23545;&#20559;&#25928;&#24212;&#30340;&#20302;&#20272;&#25110;&#39640;&#20272;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#31616;&#21333;&#30340;&#20559;&#25928;&#24212;&#33539;&#22260;&#20272;&#35745;&#22120;&#24182;&#25552;&#20379;&#26131;&#20110;&#23454;&#29616;&#30340;&#32622;&#20449;&#21306;&#38388;&#12290;</title><link>http://arxiv.org/abs/2306.14862</link><description>&lt;p&gt;
Probit&#21644;Tobit&#27169;&#22411;&#20013;&#30340;&#31471;&#28857;&#25928;&#24212;&#19982;&#20869;&#29983;&#24615;
&lt;/p&gt;
&lt;p&gt;
Marginal Effects for Probit and Tobit with Endogeneity. (arXiv:2306.14862v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.14862
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;Probit&#21644;Tobit&#27169;&#22411;&#20013;&#30340;&#31471;&#28857;&#25928;&#24212;&#19982;&#20869;&#29983;&#24615;&#65292;&#35777;&#26126;&#20102;&#26410;&#21306;&#20998;&#20004;&#31181;&#20869;&#29983;&#24615;&#20250;&#23548;&#33268;&#23545;&#20559;&#25928;&#24212;&#30340;&#20302;&#20272;&#25110;&#39640;&#20272;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#31616;&#21333;&#30340;&#20559;&#25928;&#24212;&#33539;&#22260;&#20272;&#35745;&#22120;&#24182;&#25552;&#20379;&#26131;&#20110;&#23454;&#29616;&#30340;&#32622;&#20449;&#21306;&#38388;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#35780;&#20272;&#20559;&#25928;&#24212;&#26102;&#65292;&#21306;&#20998;&#32467;&#26500;&#24615;&#20869;&#29983;&#24615;&#21644;&#27979;&#37327;&#35823;&#24046;&#38750;&#24120;&#37325;&#35201;&#12290;&#19982;&#32447;&#24615;&#27169;&#22411;&#19981;&#21516;&#65292;&#36825;&#20004;&#31181;&#20869;&#29983;&#24615;&#26469;&#28304;&#22312;&#38750;&#32447;&#24615;&#27169;&#22411;&#20013;&#23545;&#20559;&#25928;&#24212;&#30340;&#24433;&#21709;&#19981;&#21516;&#12290;&#26412;&#25991;&#20197;&#24037;&#20855;&#21464;&#37327;&#65288;IV&#65289;Probit&#21644;Tobit&#27169;&#22411;&#20026;&#37325;&#28857;&#30740;&#31350;&#20102;&#36825;&#20010;&#38382;&#39064;&#12290;&#25105;&#20204;&#34920;&#26126;&#65292;&#21363;&#20351;&#23384;&#22312;&#26377;&#25928;&#30340;IV&#65292;&#26410;&#33021;&#21306;&#20998;&#36825;&#20004;&#31181;&#20869;&#29983;&#24615;&#31867;&#22411;&#20063;&#21487;&#33021;&#23548;&#33268;&#20559;&#25928;&#24212;&#34987;&#20302;&#20272;&#25110;&#39640;&#20272;&#12290;&#25105;&#20204;&#24320;&#21457;&#20102;&#31616;&#21333;&#30340;&#20559;&#25928;&#24212;&#33539;&#22260;&#20272;&#35745;&#22120;&#65292;&#24182;&#25552;&#20379;&#26131;&#20110;&#23454;&#29616;&#30340;&#32622;&#20449;&#21306;&#38388;&#65292;&#35813;&#21306;&#38388;&#27491;&#30830;&#22320;&#32771;&#34385;&#20102;&#20004;&#31181;&#31867;&#22411;&#30340;&#20869;&#29983;&#24615;&#12290;&#25105;&#20204;&#22312;Monte Carlo&#27169;&#25311;&#21644;&#23454;&#35777;&#24212;&#29992;&#20013;&#35828;&#26126;&#20102;&#36825;&#20123;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
When evaluating partial effects, it is important to distinguish between structural endogeneity and measurement errors. In contrast to linear models, these two sources of endogeneity affect partial effects differently in nonlinear models. We study this issue focusing on the Instrumental Variable (IV) Probit and Tobit models. We show that even when a valid IV is available, failing to differentiate between the two types of endogeneity can lead to either under- or over-estimation of the partial effects. We develop simple estimators of the bounds on the partial effects and provide easy to implement confidence intervals that correctly account for both types of endogeneity. We illustrate the methods in a Monte Carlo simulation and an empirical application.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#20110;&#22823;&#25968;&#25454;&#30340;&#36817;&#20284;&#36125;&#21494;&#26031;&#26041;&#27861;&#65292;&#22522;&#20110; Langevin &#25193;&#25955;&#36807;&#31243;&#65292;&#20351;&#29992; Fisher &#24658;&#31561;&#24335;&#31215;&#20998;&#25481;&#20102;&#28508;&#21464;&#37327;&#65292;&#19981;&#38656;&#35201;&#36873;&#25321;&#26410;&#30693;&#21442;&#25968;&#30340;&#21442;&#25968;&#20998;&#24067;&#65292;&#24182;&#22312;&#31163;&#25955;&#36873;&#25321;&#23454;&#20363;&#20013;&#36827;&#34892;&#20102;&#39564;&#35777;&#12290;</title><link>http://arxiv.org/abs/2306.14445</link><description>&lt;p&gt;
&#39640;&#32500;&#28508;&#21464;&#37327;&#27169;&#22411;&#30340;&#28151;&#21512;&#26410;&#35843;&#25972; Langevin &#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Hybrid unadjusted Langevin methods for high-dimensional latent variable models. (arXiv:2306.14445v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.14445
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#20110;&#22823;&#25968;&#25454;&#30340;&#36817;&#20284;&#36125;&#21494;&#26031;&#26041;&#27861;&#65292;&#22522;&#20110; Langevin &#25193;&#25955;&#36807;&#31243;&#65292;&#20351;&#29992; Fisher &#24658;&#31561;&#24335;&#31215;&#20998;&#25481;&#20102;&#28508;&#21464;&#37327;&#65292;&#19981;&#38656;&#35201;&#36873;&#25321;&#26410;&#30693;&#21442;&#25968;&#30340;&#21442;&#25968;&#20998;&#24067;&#65292;&#24182;&#22312;&#31163;&#25955;&#36873;&#25321;&#23454;&#20363;&#20013;&#36827;&#34892;&#20102;&#39564;&#35777;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20272;&#35745;&#24102;&#26377;&#22823;&#25968;&#25454;&#30340;&#28508;&#21464;&#37327;&#27169;&#22411;&#26159;&#24456;&#20855;&#26377;&#25361;&#25112;&#24615;&#30340;&#12290;&#28508;&#21464;&#37327;&#38656;&#35201;&#36827;&#34892;&#25968;&#20540;&#31215;&#20998;&#65292;&#24182;&#19988;&#38543;&#30528;&#26679;&#26412;&#22823;&#23567;&#30340;&#22686;&#21152;&#65292;&#28508;&#21464;&#37327;&#30340;&#32500;&#25968;&#20063;&#20250;&#22686;&#21152;&#12290;&#26412;&#25991;&#22522;&#20110; Langevin &#25193;&#25955;&#36807;&#31243;&#24320;&#21457;&#20102;&#19968;&#31181;&#26032;&#30340;&#36817;&#20284;&#36125;&#21494;&#26031;&#26041;&#27861;&#12290;&#35813;&#26041;&#27861;&#21033;&#29992; Fisher &#24658;&#31561;&#24335;&#31215;&#20998;&#25481;&#20102;&#28508;&#21464;&#37327;&#65292;&#36825;&#20351;&#24471;&#24403;&#24212;&#29992;&#20110;&#22823;&#25968;&#25454;&#26102;&#23427;&#26082;&#20934;&#30830;&#21448;&#35745;&#31639;&#21487;&#34892;&#12290;&#19982;&#20854;&#20182;&#36817;&#20284;&#20272;&#35745;&#26041;&#27861;&#19981;&#21516;&#65292;&#23427;&#19981;&#38656;&#35201;&#36873;&#25321;&#26410;&#30693;&#21442;&#25968;&#30340;&#21442;&#25968;&#20998;&#24067;&#65292;&#36825;&#24448;&#24448;&#20250;&#23548;&#33268;&#19981;&#20934;&#30830;&#24615;&#12290;&#22312;&#19968;&#20010;&#25317;&#26377;&#19968;&#30334;&#19975;&#20010;&#35266;&#27979;&#20540;&#30340;&#31163;&#25955;&#36873;&#25321;&#23454;&#20363;&#20013;&#65292;&#35813;&#26041;&#27861;&#21482;&#20351;&#29992;&#20102;&#31934;&#30830; MCMC &#35745;&#31639;&#26102;&#38388;&#30340; 2&#65285;&#65292;&#21364;&#31934;&#30830;&#22320;&#20272;&#35745;&#20102;&#21518;&#39564;&#36873;&#25321;&#27010;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;
The exact estimation of latent variable models with big data is known to be challenging. The latents have to be integrated out numerically, and the dimension of the latent variables increases with the sample size. This paper develops a novel approximate Bayesian method based on the Langevin diffusion process. The method employs the Fisher identity to integrate out the latent variables, which makes it accurate and computationally feasible when applied to big data. In contrast to other approximate estimation methods, it does not require the choice of a parametric distribution for the unknowns, which often leads to inaccuracies. In an empirical discrete choice example with a million observations, the proposed method accurately estimates the posterior choice probabilities using only 2% of the computation time of exact MCMC.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#35299;&#20915;&#24191;&#20041;&#30697;&#37327;&#26041;&#27861;&#65288;GMM&#65289;&#26694;&#26550;&#19979;&#21464;&#37327;&#35823;&#24046;&#65288;EIV&#65289;&#38382;&#39064;&#30340;&#26041;&#27861;&#65292;&#23545;&#20110;&#20219;&#20309;&#21021;&#22987;&#30697;&#26465;&#20214;&#65292;&#35813;&#26041;&#27861;&#25552;&#20379;&#20102;&#32416;&#27491;&#21518;&#23545;EIV&#20855;&#26377;&#40065;&#26834;&#24615;&#30340;&#30697;&#26465;&#20214;&#38598;&#65292;&#36825;&#20351;&#24471;GMM&#20272;&#35745;&#37327;&#26159;&#26681;&#21495;&#19979;n&#19968;&#33268;&#30340;&#65292;&#26631;&#20934;&#26816;&#39564;&#21644;&#32622;&#20449;&#21306;&#38388;&#25552;&#20379;&#26377;&#25928;&#30340;&#25512;&#35770;&#65292;&#23545;&#20110;&#20855;&#26377;&#22810;&#20010;&#21327;&#21464;&#37327;&#21644;&#22810;&#20803;&#30340;&#65292;&#24207;&#36143;&#30456;&#20851;&#25110;&#38750;&#32463;&#20856;EIV&#30340;&#24212;&#29992;&#31243;&#24207;&#29305;&#21035;&#37325;&#35201;&#12290;</title><link>http://arxiv.org/abs/2306.14311</link><description>&lt;p&gt;
&#27979;&#37327;&#35823;&#24046;&#20013;&#21322;&#21442;&#25968;&#27169;&#22411;&#30340;&#31616;&#21333;&#20272;&#35745;
&lt;/p&gt;
&lt;p&gt;
Simple Estimation of Semiparametric Models with Measurement Errors. (arXiv:2306.14311v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.14311
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#35299;&#20915;&#24191;&#20041;&#30697;&#37327;&#26041;&#27861;&#65288;GMM&#65289;&#26694;&#26550;&#19979;&#21464;&#37327;&#35823;&#24046;&#65288;EIV&#65289;&#38382;&#39064;&#30340;&#26041;&#27861;&#65292;&#23545;&#20110;&#20219;&#20309;&#21021;&#22987;&#30697;&#26465;&#20214;&#65292;&#35813;&#26041;&#27861;&#25552;&#20379;&#20102;&#32416;&#27491;&#21518;&#23545;EIV&#20855;&#26377;&#40065;&#26834;&#24615;&#30340;&#30697;&#26465;&#20214;&#38598;&#65292;&#36825;&#20351;&#24471;GMM&#20272;&#35745;&#37327;&#26159;&#26681;&#21495;&#19979;n&#19968;&#33268;&#30340;&#65292;&#26631;&#20934;&#26816;&#39564;&#21644;&#32622;&#20449;&#21306;&#38388;&#25552;&#20379;&#26377;&#25928;&#30340;&#25512;&#35770;&#65292;&#23545;&#20110;&#20855;&#26377;&#22810;&#20010;&#21327;&#21464;&#37327;&#21644;&#22810;&#20803;&#30340;&#65292;&#24207;&#36143;&#30456;&#20851;&#25110;&#38750;&#32463;&#20856;EIV&#30340;&#24212;&#29992;&#31243;&#24207;&#29305;&#21035;&#37325;&#35201;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#22312;&#24191;&#20041;&#30697;&#37327;&#26041;&#27861;&#65288;GMM&#65289;&#26694;&#26550;&#19979;&#24320;&#21457;&#20102;&#19968;&#31181;&#35299;&#20915;&#21464;&#37327;&#35823;&#24046;&#65288;EIV&#65289;&#38382;&#39064;&#30340;&#23454;&#29992;&#26041;&#27861;&#12290;&#25105;&#20204;&#20851;&#27880;&#30340;&#26159;EIV&#30340;&#21487;&#21464;&#24615;&#26159;&#27979;&#37327;&#35823;&#24046;&#21464;&#37327;&#30340;&#19968;&#23567;&#37096;&#20998;&#30340;&#24773;&#20917;&#65292;&#36825;&#22312;&#23454;&#35777;&#24212;&#29992;&#20013;&#24456;&#24120;&#35265;&#12290;&#23545;&#20110;&#20219;&#20309;&#21021;&#22987;&#30697;&#26465;&#20214;&#65292;&#25105;&#20204;&#30340;&#26041;&#27861;&#25552;&#20379;&#20102;&#32416;&#27491;&#21518;&#23545;EIV&#20855;&#26377;&#40065;&#26834;&#24615;&#30340;&#30697;&#26465;&#20214;&#38598;&#12290;&#25105;&#20204;&#34920;&#26126;&#65292;&#22522;&#20110;&#36825;&#20123;&#30697;&#30340;GMM&#20272;&#35745;&#37327;&#26159;&#26681;&#21495;&#19979;n&#19968;&#33268;&#30340;&#65292;&#26631;&#20934;&#26816;&#39564;&#21644;&#32622;&#20449;&#21306;&#38388;&#25552;&#20379;&#26377;&#25928;&#30340;&#25512;&#35770;&#12290;&#21363;&#20351;EIV&#24456;&#22823;&#65292;&#26420;&#32032;&#20272;&#35745;&#37327;&#65288;&#24573;&#30053;EIV&#38382;&#39064;&#65289;&#21487;&#33021;&#20005;&#37325;&#20559;&#35823;&#24182;&#19988;&#32622;&#20449;&#21306;&#38388;&#30340;&#35206;&#30422;&#29575;&#20026;0&#65285;&#65292;&#25105;&#20204;&#30340;&#26041;&#27861;&#20063;&#33021;&#22788;&#29702;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#19981;&#28041;&#21450;&#38750;&#21442;&#25968;&#20272;&#35745;&#65292;&#36825;&#23545;&#20110;&#20855;&#26377;&#22810;&#20010;&#21327;&#21464;&#37327;&#21644;&#22810;&#20803;&#30340;&#65292;&#24207;&#36143;&#30456;&#20851;&#25110;&#38750;&#32463;&#20856;EIV&#30340;&#24212;&#29992;&#31243;&#24207;&#29305;&#21035;&#37325;&#35201;&#12290;
&lt;/p&gt;
&lt;p&gt;
We develop a practical way of addressing the Errors-In-Variables (EIV) problem in the Generalized Method of Moments (GMM) framework. We focus on the settings in which the variability of the EIV is a fraction of that of the mismeasured variables, which is typical for empirical applications. For any initial set of moment conditions our approach provides a corrected set of moment conditions that are robust to the EIV. We show that the GMM estimator based on these moments is root-n-consistent, with the standard tests and confidence intervals providing valid inference. This is true even when the EIV are so large that naive estimators (that ignore the EIV problem) may be heavily biased with the confidence intervals having 0% coverage. Our approach involves no nonparametric estimation, which is particularly important for applications with multiple covariates, and settings with multivariate, serially correlated, or non-classical EIV.
&lt;/p&gt;</description></item><item><title>&#30740;&#31350;&#20102;&#19968;&#31181;&#20197;&#21253;&#35013;&#25104;&#26412;&#20026;&#20195;&#20215;&#30340;&#22810;&#20010;&#20114;&#34917;&#21697;&#30340;&#38144;&#21806;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#31038;&#20250;&#31119;&#21033;&#26368;&#22823;&#21270;&#30340;&#23494;&#23553;&#24335;&#31454;&#26631;&#25293;&#21334;&#65292;&#20445;&#35777;&#20844;&#24179;&#36879;&#26126;&#30340;&#23450;&#20215;&#24182;&#20855;&#26377;&#23545;&#24066;&#22330;&#38598;&#20013;&#30340;&#20559;&#22909;&#12290;</title><link>http://arxiv.org/abs/2306.14247</link><description>&lt;p&gt;
&#20197;&#21253;&#35013;&#25104;&#26412;&#20026;&#20195;&#20215;&#30340;&#22810;&#20010;&#20114;&#34917;&#21697;&#30340;&#38144;&#21806;
&lt;/p&gt;
&lt;p&gt;
Selling Multiple Complements with Packaging Costs. (arXiv:2306.14247v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.14247
&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#20102;&#19968;&#31181;&#20197;&#21253;&#35013;&#25104;&#26412;&#20026;&#20195;&#20215;&#30340;&#22810;&#20010;&#20114;&#34917;&#21697;&#30340;&#38144;&#21806;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#31038;&#20250;&#31119;&#21033;&#26368;&#22823;&#21270;&#30340;&#23494;&#23553;&#24335;&#31454;&#26631;&#25293;&#21334;&#65292;&#20445;&#35777;&#20844;&#24179;&#36879;&#26126;&#30340;&#23450;&#20215;&#24182;&#20855;&#26377;&#23545;&#24066;&#22330;&#38598;&#20013;&#30340;&#20559;&#22909;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#19968;&#31181;&#21253;&#35013;&#20998;&#37197;&#38382;&#39064;&#65292;&#20854;&#20013;&#22810;&#20010;&#19981;&#21487;&#20998;&#21106;&#29289;&#21697;&#20998;&#37197;&#32473;&#20010;&#20154;&#12290;&#21334;&#26041;&#23558;&#20998;&#37197;&#20559;&#22909;&#35268;&#23450;&#20026;&#21253;&#35013;&#19978;&#30340;&#25104;&#26412;&#33410;&#30465;&#12290;&#20316;&#32773;&#25552;&#20986;&#20102;&#19968;&#20010;&#31038;&#20250;&#31119;&#21033;&#26368;&#22823;&#21270;&#30340;&#23494;&#23553;&#24335;&#31454;&#26631;&#25293;&#21334;&#65292;&#20351;&#29992;&#26032;&#39062;&#30340;&#25104;&#26412;&#20989;&#25968;&#22270;&#34920;&#36798;&#21334;&#26041;&#20559;&#22909;&#65292;&#20419;&#36827;&#20351;&#29992;&#32447;&#24615;&#35268;&#21010;&#25214;&#21040;&#21311;&#21517;&#12289;&#26377;&#31454;&#20105;&#24615;&#12289;&#21253;&#32447;&#24615;&#20215;&#26684;&#12290;&#22914;&#26524;&#20195;&#29702;&#25353;&#23454;&#24773;&#31454;&#26631;&#65292;&#36825;&#20123;&#20215;&#26684;&#25903;&#25345;&#29926;&#23572;&#25289;&#26031;&#22343;&#34913;&#12290;&#20316;&#32773;&#25552;&#20379;&#20102;&#29926;&#23572;&#25289;&#26031;&#22343;&#34913;&#30340;&#24517;&#35201;&#26465;&#20214;&#21644;&#20805;&#20998;&#26465;&#20214;&#65292;&#24182;&#19988;&#25293;&#21334;&#20445;&#35777;&#20844;&#24179;&#36879;&#26126;&#30340;&#23450;&#20215;&#24182;&#20855;&#26377;&#23545;&#24066;&#22330;&#38598;&#20013;&#30340;&#20559;&#22909;&#12290;
&lt;/p&gt;
&lt;p&gt;
I consider a package assignment problem where multiple units of indivisible items are allocated among individuals. The seller specifies allocation preferences as cost savings on packages. I propose a social welfare maximising, sealed-bid auction with a novel cost function graph to express seller preferences. It facilitates the use of linear programming to find anonymous, competitive, package-linear prices. If agents bid truthfully, these prices support a Walrasian equilibrium. I provide necessary and sufficient conditions, and additional sufficient conditions, for the existence of Walrasian equilibria. The auction guarantees fair and transparent pricing and admits preferences over the market concentration.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#20998;&#26512;&#20102;&#23558;&#39046;&#22495;&#30693;&#35782;&#32534;&#30721;&#24212;&#29992;&#20110;&#30005;&#21147;&#20215;&#26684;&#39044;&#27979;&#20013;&#65292;&#36890;&#36807;&#22312;&#20215;&#26684;&#39044;&#27979;&#38382;&#39064;&#19978;&#26045;&#21152;&#32467;&#26500;&#26469;&#32435;&#20837;&#39046;&#22495;&#30693;&#35782;&#65292;&#24341;&#20837;&#20013;&#38388;&#25968;&#37327;&#39044;&#27979;&#21644;&#20379;&#32473;&#26354;&#32447;&#30340;&#20272;&#35745;&#21487;&#20197;&#26377;&#25928;&#20943;&#23569;&#35757;&#32451;&#25968;&#25454;&#38598;&#30340;&#38656;&#27714;&#65292;&#24182;&#25552;&#39640;&#31934;&#24230;&#12290;</title><link>http://arxiv.org/abs/2306.14186</link><description>&lt;p&gt;
&#32479;&#35745;&#30005;&#21147;&#20215;&#26684;&#39044;&#27979;&#65306;&#19968;&#31181;&#32467;&#26500;&#21270;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Statistical electricity price forecasting: A structural approach. (arXiv:2306.14186v1 [stat.AP])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.14186
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#20998;&#26512;&#20102;&#23558;&#39046;&#22495;&#30693;&#35782;&#32534;&#30721;&#24212;&#29992;&#20110;&#30005;&#21147;&#20215;&#26684;&#39044;&#27979;&#20013;&#65292;&#36890;&#36807;&#22312;&#20215;&#26684;&#39044;&#27979;&#38382;&#39064;&#19978;&#26045;&#21152;&#32467;&#26500;&#26469;&#32435;&#20837;&#39046;&#22495;&#30693;&#35782;&#65292;&#24341;&#20837;&#20013;&#38388;&#25968;&#37327;&#39044;&#27979;&#21644;&#20379;&#32473;&#26354;&#32447;&#30340;&#20272;&#35745;&#21487;&#20197;&#26377;&#25928;&#20943;&#23569;&#35757;&#32451;&#25968;&#25454;&#38598;&#30340;&#38656;&#27714;&#65292;&#24182;&#25552;&#39640;&#31934;&#24230;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#19982;&#30005;&#21147;&#26085;&#21069;&#20215;&#26684;&#21644;&#22522;&#26412;&#20215;&#26684;&#24418;&#25104;&#36807;&#31243;&#30456;&#20851;&#30340;&#21382;&#21490;&#25968;&#25454;&#30340;&#21487;&#29992;&#24615;&#26159;&#26377;&#38480;&#30340;&#12290;&#27492;&#22806;&#65292;&#27431;&#27954;&#30005;&#21147;&#24066;&#22330;&#27491;&#22312;&#38754;&#20020;&#24555;&#36895;&#36716;&#22411;&#65292;&#36825;&#38480;&#21046;&#20102;&#29992;&#20110;&#39044;&#27979;&#30446;&#30340;&#30340;&#26087;&#35266;&#23519;&#32467;&#26524;&#30340;&#20195;&#34920;&#24615;&#12290;&#26412;&#30740;&#31350;&#20998;&#26512;&#20102;&#23558;&#34892;&#19994;&#20869;&#24050;&#32463;&#24314;&#31435;&#30340;&#39046;&#22495;&#30693;&#35782;&#32534;&#30721;&#30340;&#26377;&#25928;&#24615;&#65292;&#20197;&#20943;&#23569;&#22823;&#37327;&#35757;&#32451;&#25968;&#25454;&#38598;&#30340;&#38656;&#27714;&#12290;&#36890;&#36807;&#22312;&#20215;&#26684;&#39044;&#27979;&#38382;&#39064;&#19978;&#26045;&#21152;&#32467;&#26500;&#26469;&#32435;&#20837;&#39046;&#22495;&#30693;&#35782;&#65292;&#23454;&#39564;&#37327;&#21270;&#20102;&#30001;&#27492;&#24102;&#26469;&#30340;&#31934;&#24230;&#25552;&#39640;&#12290;&#19982;&#8220;&#38750;&#32467;&#26500;&#21270;&#8221;&#30340;&#32431;&#32479;&#35745;&#27169;&#22411;&#30456;&#27604;&#65292;&#24341;&#20837;&#36127;&#33655;&#12289;&#21487;&#20877;&#29983;&#33021;&#28304;&#27880;&#20837;&#21644;&#36328;&#30028;&#20132;&#27969;&#30340;&#20013;&#38388;&#25968;&#37327;&#39044;&#27979;&#20197;&#21450;&#20379;&#32473;&#26354;&#32447;&#30340;&#20272;&#35745;&#21487;&#20197;&#20351;NRMSE&#38477;&#20302;0.1&#12290;
&lt;/p&gt;
&lt;p&gt;
The availability of historical data related to electricity day-ahead prices and to the underlying price formation process is limited. In addition, the electricity market in Europe is facing a rapid transformation, which limits the representativeness of older observations for predictive purposes. On the other hand, machine learning methods that gained traction also in the domain of electricity price forecasting typically require large amounts of data. This study analyses the effectiveness of encoding well-established domain knowledge to mitigate the need for large training datasets. The domain knowledge is incorporated by imposing a structure on the price forecasting problem; the resulting accuracy gains are quantified in an experiment. Compared to an "unstructured" purely statistical model, it is shown that introducing intermediate quantity forecasts of load, renewable infeed, and cross-border exchange, paired with the estimation of supply curves, can result in a NRMSE reduction by 0.1
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#30701;&#38754;&#26495;&#20013;&#28508;&#22312;&#22240;&#23376;&#20998;&#26512;&#30340;&#25512;&#29702;&#24037;&#20855;&#65292;&#29983;&#25104;&#20284;&#28982;&#27604;&#32479;&#35745;&#37327;&#24182;&#24471;&#20986;&#20102;AUMPI&#29305;&#24449;&#65292;&#32463;&#23454;&#35777;&#24212;&#29992;&#21457;&#29616;&#30701;&#23376;&#26399;&#29305;&#26377;&#27874;&#21160;&#29575;&#21576;&#19978;&#21319;&#36235;&#21183;&#12290;</title><link>http://arxiv.org/abs/2306.14004</link><description>&lt;p&gt;
&#30701;&#38754;&#26495;&#20013;&#30340;&#28508;&#22312;&#22240;&#23376;&#20998;&#26512;
&lt;/p&gt;
&lt;p&gt;
Latent Factor Analysis in Short Panels. (arXiv:2306.14004v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.14004
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#30701;&#38754;&#26495;&#20013;&#28508;&#22312;&#22240;&#23376;&#20998;&#26512;&#30340;&#25512;&#29702;&#24037;&#20855;&#65292;&#29983;&#25104;&#20284;&#28982;&#27604;&#32479;&#35745;&#37327;&#24182;&#24471;&#20986;&#20102;AUMPI&#29305;&#24449;&#65292;&#32463;&#23454;&#35777;&#24212;&#29992;&#21457;&#29616;&#30701;&#23376;&#26399;&#29305;&#26377;&#27874;&#21160;&#29575;&#21576;&#19978;&#21319;&#36235;&#21183;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#24320;&#21457;&#20102;&#30701;&#38754;&#26495;&#20013;&#28508;&#22312;&#22240;&#23376;&#20998;&#26512;&#30340;&#25512;&#29702;&#24037;&#20855;&#12290; &#22312;&#22823;&#30340;&#27178;&#25130;&#38754;&#32500;&#24230;n&#21644;&#22266;&#23450;&#26102;&#38388;&#24207;&#21015;&#32500;&#24230;T&#30340;&#20266;&#26368;&#22823;&#20284;&#28982;&#35774;&#32622;&#20013;&#65292;&#20381;&#36182;&#20110;&#38169;&#35823;&#30340;&#23545;&#35282;&#32447;T&#215;T&#21327;&#26041;&#24046;&#30697;&#38453;&#65292;&#32780;&#19981;&#24378;&#21152;&#29699;&#24418;&#25110;&#39640;&#26031;&#24615;&#12290; &#25105;&#20204;&#27010;&#36848;&#20102;&#28508;&#22312;&#22240;&#23376;&#21644;&#35823;&#24046;&#21327;&#26041;&#24046;&#20272;&#35745;&#30340;&#28176;&#36817;&#20998;&#24067;&#65292;&#20197;&#21450;&#22522;&#20110;&#20284;&#28982;&#27604;&#32479;&#35745;&#37327;&#30340;&#28176;&#36817;&#19968;&#33268;&#26368;&#26377;&#21147;&#19981;&#21464;&#65288;AUMPI&#65289;&#27979;&#35797;&#30340;&#28176;&#36817;&#20998;&#24067;&#65292;&#27979;&#35797;&#22240;&#23376;&#30340;&#25968;&#37327;&#12290; &#25105;&#20204;&#20174;&#30830;&#20445;&#27491;&#24577;&#21464;&#37327;&#20013;&#27491;&#23450;&#20108;&#27425;&#24418;&#24335;&#30340;&#21333;&#35843;&#20284;&#28982;&#27604;&#23646;&#24615;&#30340;&#19981;&#31561;&#24335;&#20013;&#23548;&#20986;&#20102;AUMPI&#29305;&#24449;&#12290; &#23545;&#32654;&#22269;&#19968;&#22823;&#25209;&#26376;&#24230;&#32929;&#31080;&#25910;&#30410;&#30340;&#23454;&#35777;&#24212;&#29992;&#22522;&#20110;&#25152;&#36873;&#22240;&#23376;&#25968;&#37327;&#65292;&#23558;&#30701;&#23376;&#26399;&#30340;&#29275;&#24066;&#19982;&#29066;&#24066;&#20043;&#21518;&#30340;&#26085;&#26399;&#31995;&#32479;&#21644;&#29305;&#26377;&#39118;&#38505;&#20998;&#24320;&#12290; &#25105;&#20204;&#35266;&#23519;&#21040;&#65292;&#26679;&#26412;&#26399;&#38388;&#29305;&#26377;&#27874;&#21160;&#29575;&#21576;&#19978;&#21319;&#36235;&#21183;&#65292;&#32780;&#31995;&#32479;&#39118;&#38505;&#20445;&#25345;&#31283;&#23450;&#12290;
&lt;/p&gt;
&lt;p&gt;
We develop inferential tools for latent factor analysis in short panels. The pseudo maximum likelihood setting under a large cross-sectional dimension $n$ and a fixed time series dimension $T$ relies on a diagonal $T \times T$ covariance matrix of the errors without imposing sphericity or Gaussianity. We outline the asymptotic distributions of the latent factor and error covariance estimates as well as of an asymptotically uniformly most powerful invariant (AUMPI) test based on the likelihood ratio statistic for tests of the number of factors. We derive the AUMPI characterization from inequalities ensuring the monotone likelihood ratio property for positive definite quadratic forms in normal variables. An empirical application to a large panel of monthly U.S. stock returns separates date after date systematic and idiosyncratic risks in short subperiods of bear vs. bull market based on the selected number of factors. We observe an uptrend in idiosyncratic volatility while the systematic
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#36890;&#36807;&#25552;&#20986;&#19968;&#20010;&#26032;&#30340;&#30899;&#24378;&#24230;&#27169;&#22411;&#65292;&#35780;&#20272;&#20102;&#36807;&#21435;20&#24180;&#20013;&#22269;&#21644;&#21360;&#24230;&#20303;&#23429;&#24314;&#31569;&#36816;&#33829;&#33073;&#30899;&#30340;&#36827;&#23637;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#23478;&#24237;&#25903;&#20986;&#30456;&#20851;&#30340;&#33021;&#28304;&#24378;&#24230;&#21644;&#25490;&#25918;&#22240;&#32032;&#26159;&#20303;&#23429;&#24314;&#31569;&#33073;&#30899;&#30340;&#20851;&#38190;&#65292;&#24314;&#31569;&#30005;&#27668;&#21270;&#21644;&#21487;&#20877;&#29983;&#33021;&#28304;&#24212;&#29992;&#26159;&#33073;&#30899;&#30340;&#37325;&#35201;&#25163;&#27573;&#65292;&#20294;&#20004;&#22269;&#22312;2030&#24180;&#23454;&#29616;&#36816;&#33829;&#33073;&#30899;&#30446;&#26631;&#20173;&#38754;&#20020;&#25361;&#25112;&#12290;</title><link>http://arxiv.org/abs/2306.13858</link><description>&lt;p&gt;
&#20013;&#22269;&#21644;&#21360;&#24230;&#20303;&#23429;&#36816;&#33829;&#30340;&#33073;&#30899;&#27169;&#24335;
&lt;/p&gt;
&lt;p&gt;
Decarbonization patterns of residential building operations in China and India. (arXiv:2306.13858v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.13858
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#36890;&#36807;&#25552;&#20986;&#19968;&#20010;&#26032;&#30340;&#30899;&#24378;&#24230;&#27169;&#22411;&#65292;&#35780;&#20272;&#20102;&#36807;&#21435;20&#24180;&#20013;&#22269;&#21644;&#21360;&#24230;&#20303;&#23429;&#24314;&#31569;&#36816;&#33829;&#33073;&#30899;&#30340;&#36827;&#23637;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#23478;&#24237;&#25903;&#20986;&#30456;&#20851;&#30340;&#33021;&#28304;&#24378;&#24230;&#21644;&#25490;&#25918;&#22240;&#32032;&#26159;&#20303;&#23429;&#24314;&#31569;&#33073;&#30899;&#30340;&#20851;&#38190;&#65292;&#24314;&#31569;&#30005;&#27668;&#21270;&#21644;&#21487;&#20877;&#29983;&#33021;&#28304;&#24212;&#29992;&#26159;&#33073;&#30899;&#30340;&#37325;&#35201;&#25163;&#27573;&#65292;&#20294;&#20004;&#22269;&#22312;2030&#24180;&#23454;&#29616;&#36816;&#33829;&#33073;&#30899;&#30446;&#26631;&#20173;&#38754;&#20020;&#25361;&#25112;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20316;&#20026;&#20004;&#20010;&#25805;&#20316;&#24615;&#30899;&#25490;&#25918;&#22686;&#38271;&#26368;&#24555;&#30340;&#26032;&#20852;&#25490;&#25918;&#22269;&#65292;&#20013;&#22269;&#21644;&#21360;&#24230;&#30340;&#21382;&#21490;&#25490;&#25918;&#27169;&#24335;&#21644;&#33073;&#30899;&#21162;&#21147;&#20173;&#38656;&#36827;&#19968;&#27493;&#25506;&#35752;&#12290;&#26412;&#30740;&#31350;&#26088;&#22312;&#39318;&#27425;&#25552;&#20986;&#19968;&#20010;&#32771;&#34385;&#32456;&#31471;&#20351;&#29992;&#24615;&#33021;&#30340;&#30899;&#24378;&#24230;&#27169;&#22411;&#65292;&#21033;&#29992;&#25913;&#36827;&#30340;&#32467;&#26500;&#20998;&#35299;&#26041;&#27861;&#35780;&#20272;&#20102;&#36807;&#21435;20&#24180;&#20013;&#22269;&#21644;&#21360;&#24230;&#20303;&#23429;&#24314;&#31569;&#36816;&#33829;&#33073;&#30899;&#36827;&#23637;&#12290;&#32467;&#26524;&#34920;&#26126;&#65306;(1) 2000&#24180;&#33267;2020&#24180;&#38388;&#20013;&#22269;&#21644;&#21360;&#24230;&#20303;&#23429;&#24314;&#31569;&#24635;&#20307;&#36816;&#33829;&#30899;&#24378;&#24230;&#20998;&#21035;&#22686;&#21152;&#20102;1.4%&#21644;2.5%&#12290;&#23478;&#24237;&#25903;&#20986;&#30456;&#20851;&#30340;&#33021;&#28304;&#24378;&#24230;&#21644;&#25490;&#25918;&#22240;&#32032;&#26159;&#20303;&#23429;&#24314;&#31569;&#33073;&#30899;&#30340;&#20851;&#38190;&#12290; (2) &#24314;&#31569;&#30005;&#27668;&#21270;&#22312;&#20303;&#23429;&#31354;&#35843;&#65288;&#20013;&#22269;&#20943;&#23569;&#20102;87.7&#21315;&#20811;&#20108;&#27687;&#21270;&#30899;&#25490;&#25918;&#37327;&#65292;&#21360;&#24230;&#20943;&#23569;&#20102;130.2&#21315;&#20811;&#20108;&#27687;&#21270;&#30899;&#25490;&#25918;&#37327;&#65289;&#21644;&#23478;&#29992;&#30005;&#22120;&#65288;&#20013;&#22269;&#20943;&#23569;&#20102;169.7&#21315;&#20811;&#20108;&#27687;&#21270;&#30899;&#25490;&#25918;&#37327;&#65292;&#21360;&#24230;&#20943;&#23569;&#20102;43.4&#21315;&#20811;&#20108;&#27687;&#21270;&#30899;&#25490;&#25918;&#37327;&#65289;&#30340;&#33073;&#30899;&#20013;&#21457;&#25381;&#20102;&#37325;&#35201;&#20316;&#29992;&#12290; (3) &#21487;&#20877;&#29983;&#33021;&#28304;&#22312;&#30005;&#21147;&#29983;&#20135;&#20013;&#30340;&#24212;&#29992;&#26159;&#20013;&#22269;&#36816;&#33829;&#30899;&#24378;&#24230;&#19979;&#38477;&#36235;&#21183;&#30340;&#20027;&#35201;&#39537;&#21160;&#22240;&#32032;&#12290;&#20294;&#20004;&#22269;&#22312;2030&#24180;&#23454;&#29616;&#36816;&#33829;&#33073;&#30899;&#30446;&#26631;&#20173;&#20855;&#26377;&#25361;&#25112;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
As the two largest emerging emitters with the highest growth in operational carbon from residential buildings, the historical emission patterns and decarbonization efforts of China and India warrant further exploration. This study aims to be the first to present a carbon intensity model considering end-use performances, assessing the operational decarbonization progress of residential building in India and China over the past two decades using the improved decomposing structural decomposition approach. Results indicate (1) the overall operational carbon intensity increased by 1.4% and 2.5% in China and India, respectively, between 2000 and 2020. Household expenditure-related energy intensity and emission factors were crucial in decarbonizing residential buildings. (2) Building electrification played a significant role in decarbonizing space cooling (-87.7 in China and -130.2 kilograms of carbon dioxide (kgCO2) per household in India) and appliances (-169.7 in China and -43.4 kgCO2 per 
&lt;/p&gt;</description></item><item><title>&#27668;&#20505;&#21464;&#21270;&#23548;&#33268;&#26497;&#31471;&#39640;&#28201;&#65292;&#25913;&#21464;&#20102;&#20154;&#20204;&#22312;&#20844;&#20849;&#22330;&#25152;&#30340;&#20572;&#30041;&#26102;&#38388;&#65292;&#21152;&#21095;&#31181;&#26063;&#38548;&#31163;&#12290;</title><link>http://arxiv.org/abs/2306.13772</link><description>&lt;p&gt;
&#28909;&#28010;&#21152;&#21095;&#32654;&#22269;&#31181;&#26063;&#38548;&#31163;
&lt;/p&gt;
&lt;p&gt;
Heat increases experienced racial segregation in the United States. (arXiv:2306.13772v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.13772
&lt;/p&gt;
&lt;p&gt;
&#27668;&#20505;&#21464;&#21270;&#23548;&#33268;&#26497;&#31471;&#39640;&#28201;&#65292;&#25913;&#21464;&#20102;&#20154;&#20204;&#22312;&#20844;&#20849;&#22330;&#25152;&#30340;&#20572;&#30041;&#26102;&#38388;&#65292;&#21152;&#21095;&#31181;&#26063;&#38548;&#31163;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26681;&#25454;&#26368;&#36817;&#30340;&#30740;&#31350;&#65292;&#20844;&#20849;&#22330;&#25152;&#25552;&#20379;&#20102;&#20016;&#23500;&#30340;&#26426;&#20250;&#36827;&#34892;&#21508;&#31181;&#26063;&#38388;&#30340;&#20132;&#27969;&#65292;&#20294;&#27668;&#20505;&#21464;&#21270;&#23548;&#33268;&#26497;&#31471;&#39640;&#28201;&#65292;&#20010;&#20307;&#20204;&#20250;&#35843;&#25972;&#22312;&#36825;&#20123;&#22330;&#25152;&#30340;&#20572;&#30041;&#26102;&#38388;&#12290;&#25105;&#20204;&#20351;&#29992;&#20102;2018-2020&#24180;315&#20010;&#32654;&#22269;&#22478;&#24066;&#20960;&#30334;&#19975;&#20010;&#22320;&#28857;&#30340;&#22823;&#35268;&#27169;&#20154;&#27969;&#37327;&#25968;&#25454;&#26469;&#20272;&#35745;&#19981;&#21516;&#26063;&#32676;&#20043;&#38388;&#30340;&#26085;&#24120;&#25308;&#35775;&#23396;&#31435;&#25351;&#25968;&#65292;&#21457;&#29616;&#39640;&#28201;&#21152;&#21095;&#20102;&#31181;&#26063;&#38548;&#31163;&#12290;&#22312;&#27931;&#26441;&#30710;&#31561;&#22478;&#24066;&#20013;&#65292;&#22825;&#27668;&#22312;33&#176;C&#20197;&#19978;&#30340;&#19968;&#21608;&#20250;&#20351;&#24471;&#35775;&#38382;&#23396;&#31435;&#29575;&#19978;&#21319;0.7&#20010;&#30334;&#20998;&#28857;&#65292;&#30456;&#24403;&#20110;&#22686;&#21152;&#20102;14%&#30340;&#38548;&#31163;&#25351;&#25968;&#24046;&#24322;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#34920;&#26126;&#27668;&#20505;&#21464;&#21270;&#21487;&#33021;&#20250;&#21152;&#21095;&#25105;&#20204;&#38754;&#20020;&#30340;&#26368;&#26174;&#33879;&#30340;&#31038;&#20250;&#25361;&#25112;&#20043;&#19968;&#12290;
&lt;/p&gt;
&lt;p&gt;
Segregation on the basis of ethnic groups stands as a pervasive and persistent social challenge in many cities across the globe. Public spaces provide opportunities for diverse encounters but recent research suggests individuals adjust their time spent in such places to cope with extreme temperatures. We evaluate to what extent such adaptation affects racial segregation and thus shed light on a yet unexplored channel through which global warming might affect social welfare. We use large-scale foot traffic data for millions of places in 315 US cities between 2018 and 2020 to estimate an index of experienced isolation in daily visits between whites and other ethnic groups. We find that heat increases segregation. Results from panel regressions imply that a week with temperatures above 33{\deg}C in a city like Los Angeles induces an upward shift of visit isolation by 0.7 percentage points, which equals about 14% of the difference in the isolation index of Los Angeles to the more segregate
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#23454;&#35777;&#26694;&#26550;&#65292;&#29992;&#20110;&#20272;&#31639;&#35777;&#25454;&#20915;&#31574;&#30340;&#20215;&#20540;&#21644;&#32479;&#35745;&#31934;&#24230;&#25237;&#36164;&#22238;&#25253;&#12290;</title><link>http://arxiv.org/abs/2306.13681</link><description>&lt;p&gt;
&#20272;&#31639;&#22522;&#20110;&#35777;&#25454;&#20915;&#31574;&#30340;&#20215;&#20540;
&lt;/p&gt;
&lt;p&gt;
Estimating the Value of Evidence-Based Decision Making. (arXiv:2306.13681v1 [stat.ME])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.13681
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#23454;&#35777;&#26694;&#26550;&#65292;&#29992;&#20110;&#20272;&#31639;&#35777;&#25454;&#20915;&#31574;&#30340;&#20215;&#20540;&#21644;&#32479;&#35745;&#31934;&#24230;&#25237;&#36164;&#22238;&#25253;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21830;&#19994;/&#25919;&#31574;&#20915;&#31574;&#36890;&#24120;&#22522;&#20110;&#38543;&#26426;&#23454;&#39564;&#21644;&#35266;&#23519;&#24615;&#30740;&#31350;&#30340;&#35777;&#25454;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#23454;&#35777;&#26694;&#26550;&#26469;&#20272;&#31639;&#22522;&#20110;&#35777;&#25454;&#30340;&#20915;&#31574;&#65288;EBDM&#65289;&#30340;&#20215;&#20540;&#21644;&#32479;&#35745;&#31934;&#24230;&#25237;&#36164;&#22238;&#25253;&#12290;
&lt;/p&gt;
&lt;p&gt;
Business/policy decisions are often based on evidence from randomized experiments and observational studies. In this article we propose an empirical framework to estimate the value of evidence-based decision making (EBDM) and the return on the investment in statistical precision.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#21517;&#20026;&#8220;&#21160;&#24577;&#20928;&#33021;&#35745;&#37327;&#8221;&#30340;&#26426;&#21046;&#65292;&#35813;&#26426;&#21046;&#21160;&#24577;&#22320;&#26681;&#25454;&#32858;&#21512;&#30340;&#31038;&#21306;&#36164;&#28304;&#35774;&#32622;&#31038;&#21306;&#20928;&#33021;&#35745;&#37327;&#20215;&#26684;&#65292;&#22312;&#20445;&#35777;&#27599;&#20010;&#31038;&#21306;&#25104;&#21592;&#33719;&#24471;&#30340;&#21033;&#30410;&#39640;&#20110;&#31038;&#21306;&#22806;&#21487;&#33021;&#33719;&#24471;&#30340;&#21033;&#30410;&#30340;&#21516;&#26102;&#65292;&#23558;&#27599;&#20010;&#25104;&#21592;&#30340;&#28608;&#21169;&#19982;&#31038;&#21306;&#30340;&#28608;&#21169;&#30456;&#19968;&#33268;&#65292;&#20197;&#36798;&#21040;&#26368;&#22823;&#21270;&#31038;&#21306;&#31038;&#20250;&#31119;&#21033;&#30340;&#30446;&#30340;&#12290;</title><link>http://arxiv.org/abs/2306.13677</link><description>&lt;p&gt;
&#33021;&#28304;&#31038;&#21306;&#30340;&#21160;&#24577;&#20928;&#35745;&#37327;&#21046;&#24230;
&lt;/p&gt;
&lt;p&gt;
Dynamic Net Metering for Energy Communities. (arXiv:2306.13677v1 [eess.SY])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.13677
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#21517;&#20026;&#8220;&#21160;&#24577;&#20928;&#33021;&#35745;&#37327;&#8221;&#30340;&#26426;&#21046;&#65292;&#35813;&#26426;&#21046;&#21160;&#24577;&#22320;&#26681;&#25454;&#32858;&#21512;&#30340;&#31038;&#21306;&#36164;&#28304;&#35774;&#32622;&#31038;&#21306;&#20928;&#33021;&#35745;&#37327;&#20215;&#26684;&#65292;&#22312;&#20445;&#35777;&#27599;&#20010;&#31038;&#21306;&#25104;&#21592;&#33719;&#24471;&#30340;&#21033;&#30410;&#39640;&#20110;&#31038;&#21306;&#22806;&#21487;&#33021;&#33719;&#24471;&#30340;&#21033;&#30410;&#30340;&#21516;&#26102;&#65292;&#23558;&#27599;&#20010;&#25104;&#21592;&#30340;&#28608;&#21169;&#19982;&#31038;&#21306;&#30340;&#28608;&#21169;&#30456;&#19968;&#33268;&#65292;&#20197;&#36798;&#21040;&#26368;&#22823;&#21270;&#31038;&#21306;&#31038;&#20250;&#31119;&#21033;&#30340;&#30446;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#31038;&#20250;&#31119;&#21033;&#26368;&#22823;&#21270;&#30340;&#24066;&#22330;&#26426;&#21046;&#65292;&#29992;&#20110;&#23558;&#20010;&#20154;&#21644;&#20849;&#20139;&#31038;&#21306;&#33021;&#28304;&#36164;&#28304;&#32858;&#21512;&#22312;&#19968;&#36215;&#65292;&#24182;&#26681;&#25454;&#19968;&#33324;&#30340;&#20928;&#33021;&#35745;&#37327;&#25919;&#31574;&#26469;&#21160;&#24577;&#35774;&#32622;&#31038;&#21306;&#20928;&#33021;&#35745;&#37327;&#20215;&#26684;&#12290;&#27492;&#26426;&#21046;&#34987;&#31216;&#20026;&#21160;&#24577;&#20928;&#33021;&#35745;&#37327;&#65288;D-NEM&#65289;&#65292;&#23427;&#21487;&#20197;&#20445;&#35777;&#27599;&#20010;&#31038;&#21306;&#25104;&#21592;&#33719;&#24471;&#30340;&#21033;&#30410;&#39640;&#20110;&#31038;&#21306;&#22806;&#21487;&#33021;&#33719;&#24471;&#30340;&#21033;&#30410;&#65292;&#32780;&#27809;&#26377;&#23376;&#31038;&#21306;&#20250;&#26356;&#22909;&#22320;&#33073;&#31163;&#20854;&#27597;&#20307;&#31038;&#21306;&#12290;D-NEM&#23558;&#27599;&#20010;&#25104;&#21592;&#30340;&#28608;&#21169;&#19982;&#31038;&#21306;&#30340;&#28608;&#21169;&#30456;&#19968;&#33268;&#65292;&#20197;&#20415;&#22312;D-NEM&#19979;&#26368;&#22823;&#21270;&#20010;&#20307;&#20313;&#39069;&#30340;&#27599;&#20010;&#25104;&#21592;&#37117;&#20250;&#24102;&#26469;&#26368;&#22823;&#31038;&#21306;&#31038;&#20250;&#31119;&#21033;&#12290;&#23454;&#35777;&#30740;&#31350;&#23558;&#25152;&#25552;&#20986;&#30340;&#26426;&#21046;&#19982;&#29616;&#26377;&#22522;&#20934;&#36827;&#34892;&#20102;&#27604;&#36739;&#65292;&#35777;&#26126;&#20102;&#20854;&#23545;&#25104;&#21592;&#21644;&#31038;&#21306;&#31119;&#21033;&#30340;&#30410;&#22788;&#12290;
&lt;/p&gt;
&lt;p&gt;
We propose a social welfare maximizing market mechanism for an energy community that aggregates individual and community-shared energy resources under a general net energy metering (NEM) policy. Referred to as Dynamic NEM (D-NEM), the proposed mechanism dynamically sets the community NEM price based on aggregated community resources. D-NEM guarantees a higher benefit to each community member than possible outside the community, and no sub-communities would be better off departing from its parent community. D-NEM aligns each member's incentive with that of the community such that each member maximizing individual surplus under D-NEM results in maximum community social welfare. Empirical studies compare the proposed mechanism with existing benchmarks, demonstrating its member and community-level welfare benefits.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#38750;&#21442;&#25968;&#21270;&#26816;&#39564;&#26041;&#27861;&#65292;&#29992;&#20110;&#23545;$m$&#38454;&#36870;&#38543;&#26426;&#20248;&#21183;&#36827;&#34892;&#26816;&#39564;&#65292;&#32467;&#26524;&#34920;&#26126;&#35813;&#26041;&#27861;&#36866;&#29992;&#20110;&#35780;&#20272;&#31038;&#20250;&#31119;&#21033;&#65292;&#24182;&#22312;&#33521;&#22269;&#19981;&#24179;&#31561;&#22686;&#38271;&#38382;&#39064;&#30340;&#30740;&#31350;&#20013;&#24471;&#20197;&#24212;&#29992;&#12290;</title><link>http://arxiv.org/abs/2306.12271</link><description>&lt;p&gt;
&#19968;&#31181;$m$&#38454;&#36870;&#38543;&#26426;&#20248;&#21183;&#30340;&#38750;&#21442;&#25968;&#21270;&#26816;&#39564;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
A Nonparametric Test of $m$th-degree Inverse Stochastic Dominance. (arXiv:2306.12271v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.12271
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#38750;&#21442;&#25968;&#21270;&#26816;&#39564;&#26041;&#27861;&#65292;&#29992;&#20110;&#23545;$m$&#38454;&#36870;&#38543;&#26426;&#20248;&#21183;&#36827;&#34892;&#26816;&#39564;&#65292;&#32467;&#26524;&#34920;&#26126;&#35813;&#26041;&#27861;&#36866;&#29992;&#20110;&#35780;&#20272;&#31038;&#20250;&#31119;&#21033;&#65292;&#24182;&#22312;&#33521;&#22269;&#19981;&#24179;&#31561;&#22686;&#38271;&#38382;&#39064;&#30340;&#30740;&#31350;&#20013;&#24471;&#20197;&#24212;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#38750;&#21442;&#25968;&#26816;&#39564;&#26041;&#27861;&#65292;&#29992;&#20110;&#23545;$m$&#38454;&#36870;&#38543;&#26426;&#20248;&#21183;&#36827;&#34892;&#26816;&#39564;&#65292;&#35813;&#26041;&#27861;&#26159;&#35780;&#20272;&#31038;&#20250;&#31119;&#21033;&#30340;&#26377;&#25928;&#24037;&#20855;&#12290;&#25105;&#20204;&#22522;&#20110;&#32463;&#39564;&#36807;&#31243;&#29702;&#35770;&#26500;&#24314;&#20102;&#36825;&#20010;&#26816;&#39564;&#26041;&#27861;&#12290;&#35813;&#26816;&#39564;&#26041;&#27861;&#34987;&#35777;&#26126;&#20855;&#26377;&#28176;&#36817;&#22823;&#23567;&#25511;&#21046;&#21644;&#19968;&#33268;&#24615;&#12290;&#36890;&#36807;&#33945;&#29305;&#21345;&#32599;&#27169;&#25311;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#35813;&#26816;&#39564;&#26041;&#27861;&#20855;&#26377;&#33391;&#22909;&#30340;&#26377;&#38480;&#26679;&#26412;&#24615;&#36136;&#12290;&#25105;&#20204;&#23558;&#36825;&#20010;&#26816;&#39564;&#26041;&#27861;&#24212;&#29992;&#20110;&#30740;&#31350;1995&#24180;&#33267;2010&#24180;&#33521;&#22269;&#30340;&#19981;&#24179;&#31561;&#22686;&#38271;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper proposes a nonparametric test for $m$th-degree inverse stochastic dominance which is a powerful tool for ranking distribution functions according to social welfare. We construct the test based on empirical process theory. The test is shown to be asymptotically size controlled and consistent. The good finite sample properties of the test are illustrated via Monte Carlo simulations. We apply our test to the inequality growth in the United Kingdom from 1995 to 2010.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#22312;On-Chain Auction&#20013;&#30830;&#20445;&#23457;&#26597;&#25239;&#25298;&#30340;&#26032;&#26426;&#21046;&#65292;&#36890;&#36807;&#23450;&#20041;&#23457;&#26597;&#25239;&#25298;&#30340;&#27010;&#24565;&#24182;&#23558;&#20854;&#24212;&#29992;&#20110;&#31454;&#25293;&#19978;&#19979;&#25991;&#20013;&#65292;&#26159;&#21435;&#20013;&#24515;&#21270;&#24066;&#22330;&#26356;&#20026;&#20581;&#22766;&#21644;&#23433;&#20840;&#30340;&#22522;&#30784;&#12290;</title><link>http://arxiv.org/abs/2301.13321</link><description>&lt;p&gt;
On-Chain Auctions&#20013;&#30340;&#23457;&#26597;&#25239;&#25298;
&lt;/p&gt;
&lt;p&gt;
Censorship Resistance in On-Chain Auctions. (arXiv:2301.13321v2 [econ.TH] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2301.13321
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#22312;On-Chain Auction&#20013;&#30830;&#20445;&#23457;&#26597;&#25239;&#25298;&#30340;&#26032;&#26426;&#21046;&#65292;&#36890;&#36807;&#23450;&#20041;&#23457;&#26597;&#25239;&#25298;&#30340;&#27010;&#24565;&#24182;&#23558;&#20854;&#24212;&#29992;&#20110;&#31454;&#25293;&#19978;&#19979;&#25991;&#20013;&#65292;&#26159;&#21435;&#20013;&#24515;&#21270;&#24066;&#22330;&#26356;&#20026;&#20581;&#22766;&#21644;&#23433;&#20840;&#30340;&#22522;&#30784;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#29616;&#20195;&#21306;&#22359;&#38142;&#20445;&#35777;&#25552;&#20132;&#30340;&#20132;&#26131;&#26368;&#32456;&#20250;&#34987;&#21253;&#21547;&#22312;&#20869;&#65292;&#36825;&#26159;&#19968;&#31181;&#24418;&#24335;&#19978;&#31216;&#20026;&#27963;&#24615;&#30340;&#24615;&#36136;&#12290;&#20294;&#26159;&#65292;&#37329;&#34701;&#27963;&#21160;&#38656;&#35201;&#21450;&#26102;&#22320;&#23558;&#20132;&#26131;&#21253;&#21547;&#22312;&#20869;&#12290;&#19981;&#24184;&#30340;&#26159;&#65292;&#32463;&#20856;&#30340;&#27963;&#24615;&#24182;&#19981;&#36275;&#20197;&#20445;&#35777;&#36825;&#19968;&#28857;&#65292;&#29305;&#21035;&#26159;&#22312;&#23384;&#22312;&#26377;&#21160;&#26426;&#30340;&#23545;&#25163;&#20174;&#23457;&#26597;&#20132;&#26131;&#20013;&#21463;&#30410;&#30340;&#24773;&#20917;&#19979;&#12290;&#25105;&#20204;&#23558;&#23457;&#26597;&#25239;&#25298;&#23450;&#20041;&#20026;&#23545;&#25163;&#20026;&#23457;&#26597;&#19982;&#22266;&#23450;&#26102;&#38388;&#38388;&#38548;&#30456;&#20851;&#30340;&#23567;&#36153;&#33457;&#36153;&#30340;&#25968;&#37327;&#20989;&#25968;&#12290;&#36825;&#20010;&#23450;&#20041;&#26377;&#20004;&#20010;&#20248;&#28857;&#65306;&#39318;&#20808;&#65292;&#23427;&#25429;&#25417;&#21040;&#38543;&#30528;&#30719;&#24037;&#23567;&#36153;&#30340;&#22686;&#21152;&#65292;&#23457;&#26597;&#20195;&#20215;&#21487;&#33021;&#26356;&#39640;&#30340;&#20107;&#23454;&#65292;&#22240;&#27492;&#26356;&#26377;&#21487;&#33021;&#36805;&#36895;&#36827;&#20837;&#38142;&#20013;&#12290;&#20854;&#27425;&#65292;&#23427;&#36866;&#29992;&#20110;&#26377;&#38480;&#30340;&#26102;&#38388;&#31383;&#21475;&#65292;&#22240;&#27492;&#21487;&#20197;&#29992;&#26469;&#35780;&#20272;&#21306;&#22359;&#38142;&#26159;&#21542;&#33021;&#22815;&#25215;&#36733;&#20381;&#36182;&#21450;&#26102;&#21253;&#21547;&#30340;&#37329;&#34701;&#27963;&#21160;&#12290;&#25105;&#20204;&#23558;&#36825;&#20010;&#23450;&#20041;&#24212;&#29992;&#22312;&#31454;&#25293;&#30340;&#19978;&#19979;&#25991;&#20013;&#12290;&#31454;&#25293;&#26159;&#35768;&#22810;&#21435;&#20013;&#24515;&#21270;&#24212;&#29992;&#31243;&#24207;&#30340;&#22522;&#26412;&#26500;&#24314;&#22359;&#65292;&#20294;&#38656;&#35201;&#24555;&#36895;&#30340;&#20132;&#26131;&#26102;&#38388;&#25165;&#33021;&#23454;&#29616;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#20026;&#30830;&#20445;On-Chain Auction&#20013;&#30340;&#23457;&#26597;&#25239;&#25298;&#25552;&#20379;&#20102;&#19968;&#31181;&#26032;&#30340;&#26426;&#21046;&#65292;&#20174;&#32780;&#23454;&#29616;&#26356;&#20581;&#22766;&#21644;&#23433;&#20840;&#30340;&#21435;&#20013;&#24515;&#21270;&#24066;&#22330;&#12290;
&lt;/p&gt;
&lt;p&gt;
Modern blockchains guarantee that submitted transactions will be included eventually; a property formally known as liveness. But financial activity requires transactions to be included in a timely manner. Unfortunately, classical liveness is not strong enough to guarantee this, particularly in the presence of a motivated adversary who benefits from censoring transactions. We define censorship resistance as the amount it would cost the adversary to censor a transaction for a fixed interval of time as a function of the associated tip. This definition has two advantages, first it captures the fact that transactions with a higher miner tip can be more costly to censor, and therefore are more likely to swiftly make their way onto the chain. Second, it applies to a finite time window, so it can be used to assess whether a blockchain is capable of hosting financial activity that relies on timely inclusion.  We apply this definition in the context of auctions. Auctions are a building block for
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#35299;&#20915;&#20998;&#37197;&#38382;&#39064;&#30340;&#31639;&#27861;&#65292;&#33021;&#22815;&#20844;&#24179;&#39640;&#25928;&#22320;&#23558;&#20195;&#29702;&#20998;&#37197;&#21040;&#38754;&#20020;&#25317;&#22622;&#30340;&#32844;&#20301;&#19978;&#65292;&#31639;&#27861;&#30340;&#20851;&#38190;&#26159;&#35299;&#20915;&#21311;&#21517;&#30340;&#25317;&#22622;&#38382;&#39064;&#65292;&#36890;&#36807;&#25317;&#22622;&#23481;&#24525;&#24230;&#19978;&#38480;&#21644;&#26080;&#23241;&#22930;&#33258;&#30001;&#30340;&#35201;&#27714;&#65292;&#20445;&#35777;&#20102;&#20844;&#24179;&#24615;&#21644;&#25928;&#29575;&#24615;&#12290;</title><link>http://arxiv.org/abs/2301.12163</link><description>&lt;p&gt;
&#25317;&#22622;&#20998;&#37197;&#38382;&#39064;
&lt;/p&gt;
&lt;p&gt;
The congested assignment problem. (arXiv:2301.12163v2 [econ.TH] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2301.12163
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#35299;&#20915;&#20998;&#37197;&#38382;&#39064;&#30340;&#31639;&#27861;&#65292;&#33021;&#22815;&#20844;&#24179;&#39640;&#25928;&#22320;&#23558;&#20195;&#29702;&#20998;&#37197;&#21040;&#38754;&#20020;&#25317;&#22622;&#30340;&#32844;&#20301;&#19978;&#65292;&#31639;&#27861;&#30340;&#20851;&#38190;&#26159;&#35299;&#20915;&#21311;&#21517;&#30340;&#25317;&#22622;&#38382;&#39064;&#65292;&#36890;&#36807;&#25317;&#22622;&#23481;&#24525;&#24230;&#19978;&#38480;&#21644;&#26080;&#23241;&#22930;&#33258;&#30001;&#30340;&#35201;&#27714;&#65292;&#20445;&#35777;&#20102;&#20844;&#24179;&#24615;&#21644;&#25928;&#29575;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#20844;&#24179;&#39640;&#25928;&#30340;&#35299;&#20915;&#26041;&#26696;&#65292;&#23558;&#20195;&#29702;&#20998;&#37197;&#32473;&#38754;&#20020;&#25317;&#22622;&#30340;m&#20010;&#32844;&#20301;&#65292;&#24403;&#20195;&#29702;&#20851;&#24515;&#20182;&#20204;&#30340;&#32844;&#20301;&#21450;&#20854;&#25317;&#22622;&#26102;&#12290;&#20363;&#22914;&#65292;&#23558;&#24037;&#20316;&#20998;&#37197;&#32473;&#32321;&#24537;&#30340;&#26381;&#21153;&#22120;&#65292;&#23558;&#23398;&#29983;&#20998;&#37197;&#21040;&#25317;&#25380;&#30340;&#23398;&#26657;&#25110;&#25317;&#25380;&#30340;&#29677;&#32423;&#65292;&#23558;&#36890;&#21220;&#32773;&#20998;&#37197;&#21040;&#25317;&#25380;&#30340;&#36335;&#32447;&#65292;&#23558;&#24037;&#20154;&#20998;&#37197;&#21040;&#25317;&#25380;&#30340;&#21150;&#20844;&#31354;&#38388;&#25110;&#22242;&#38431;&#39033;&#30446;&#31561;&#12290;&#25317;&#22622;&#26159;&#21311;&#21517;&#30340;&#65288;&#23427;&#21482;&#21462;&#20915;&#20110;&#32473;&#23450;&#32844;&#20301;&#20013;&#20195;&#29702;&#25968;&#37327;n&#65289;&#12290;&#20808;&#21069;&#20844;&#24179;&#30340;&#19968;&#20010;&#20856;&#22411;&#35299;&#37322;&#20801;&#35768;&#27599;&#20010;&#20195;&#29702;&#36873;&#25321;&#29305;&#23450;&#20110;&#32844;&#20301;&#30340;&#25317;&#22622;&#23481;&#24525;&#24230;&#19978;&#38480;m&#65306;&#20165;&#24403;&#36825;&#20123;&#35831;&#27714;&#20043;&#21644;&#20026;n&#26102;&#65292;&#23427;&#20204;&#26159;&#30456;&#20114;&#21487;&#34892;&#30340;&#12290;&#23545;&#20110;&#21518;&#26399;&#20844;&#24179;&#65292;&#25105;&#20204;&#26045;&#21152;&#20102;&#19968;&#39033;&#35201;&#27714;&#65292;&#25509;&#36817;&#20110;&#26080;&#23241;&#22930;&#33258;&#30001;&#65306;&#22312;&#32473;&#23450;&#25317;&#22622;&#37197;&#32622;&#30340;&#24773;&#20917;&#19979;&#65292;&#27599;&#20010;&#20195;&#29702;&#34987;&#20998;&#37197;&#21040;&#22905;&#26368;&#22909;&#30340;&#19968;&#20010;&#32844;&#20301;&#12290;&#22914;&#26524;&#23384;&#22312;&#31454;&#20105;&#24615;&#20998;&#37197;&#65292;&#23427;&#20250;&#25552;&#20379;&#29420;&#29305;&#30340;&#25317;&#22622;&#21644;&#31119;&#21033;&#37197;&#32622;&#65292;&#24182;&#19988;&#20063;&#26159;&#26377;&#25928;&#21644;&#20808;&#21069;&#20844;&#24179;&#30340;&#12290;&#22312;&#25105;&#20204;&#27169;&#22411;&#30340;&#20998;&#25968;&#65288;&#38543;&#26426;&#25110;&#26102;&#38388;&#20849;&#20139;&#65289;&#29256;&#26412;&#20013;&#65292;
&lt;/p&gt;
&lt;p&gt;
We propose a fair and efficient solution for assigning agents to m posts subject to congestion, when agents care about both their post and its congestion. Examples include assigning jobs to busy servers, students to crowded schools or crowded classes, commuters to congested routes, workers to crowded office spaces or to team projects etc... Congestion is anonymous (it only depends on the number n of agents in a given post). A canonical interpretation of ex ante fairness allows each agent to choose m post-specific caps on the congestion they tolerate: these requests are mutually feasible if and only if the sum of the caps is n. For ex post fairness we impose a competitive requirement close to envy freeness: taking the congestion profile as given each agent is assigned to one of her best posts. If a competitive assignment exists, it delivers unique congestion and welfare profiles and is also efficient and ex ante fair. In a fractional (randomised or time sharing) version of our model, a 
&lt;/p&gt;</description></item><item><title>&#20998;&#26512;&#20102;&#24615;&#21035;&#20998;&#21106;&#21171;&#21160;&#21147;&#24066;&#22330;&#22312;&#22269;&#38469;&#36152;&#26131;&#20013;&#30340;&#26412;&#22320;&#24433;&#21709;&#65292;&#29702;&#35770;&#26694;&#26550;&#23637;&#31034;&#20986;&#34892;&#19994;&#23545;&#20110;&#22806;&#37096;&#38656;&#27714;&#20914;&#20987;&#30340;&#21453;&#24212;&#20915;&#23450;&#30528;&#22899;&#24615;&#30456;&#23545;&#20110;&#30007;&#24615;&#23601;&#19994;&#30340;&#27604;&#29575;&#22686;&#21152;&#25110;&#20943;&#23569;&#12290;&#22312;&#31361;&#23612;&#26031;&#30340;&#23454;&#35777;&#32467;&#26524;&#20063;&#35777;&#26126;&#20102;&#27492;&#29702;&#35770;&#12290;</title><link>http://arxiv.org/abs/2301.09252</link><description>&lt;p&gt;
&#8220;&#24615;&#21035;&#20998;&#21106;&#30340;&#21171;&#21160;&#21147;&#24066;&#22330;&#19982;&#36152;&#26131;&#38663;&#33633;&#8221;
&lt;/p&gt;
&lt;p&gt;
Gender-Segmented Labor Markets and Trade Shocks. (arXiv:2301.09252v2 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2301.09252
&lt;/p&gt;
&lt;p&gt;
&#20998;&#26512;&#20102;&#24615;&#21035;&#20998;&#21106;&#21171;&#21160;&#21147;&#24066;&#22330;&#22312;&#22269;&#38469;&#36152;&#26131;&#20013;&#30340;&#26412;&#22320;&#24433;&#21709;&#65292;&#29702;&#35770;&#26694;&#26550;&#23637;&#31034;&#20986;&#34892;&#19994;&#23545;&#20110;&#22806;&#37096;&#38656;&#27714;&#20914;&#20987;&#30340;&#21453;&#24212;&#20915;&#23450;&#30528;&#22899;&#24615;&#30456;&#23545;&#20110;&#30007;&#24615;&#23601;&#19994;&#30340;&#27604;&#29575;&#22686;&#21152;&#25110;&#20943;&#23569;&#12290;&#22312;&#31361;&#23612;&#26031;&#30340;&#23454;&#35777;&#32467;&#26524;&#20063;&#35777;&#26126;&#20102;&#27492;&#29702;&#35770;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#37325;&#28857;&#30740;&#31350;&#24615;&#21035;&#20998;&#21106;&#21171;&#21160;&#21147;&#24066;&#22330;&#22914;&#20309;&#24433;&#21709;&#22269;&#38469;&#36152;&#26131;&#30340;&#26412;&#22320;&#25928;&#24212;&#12290;&#39318;&#20808;&#65292;&#25105;&#20204;&#26500;&#24314;&#19968;&#20010;&#29702;&#35770;&#26694;&#26550;&#65292;&#23558;&#36152;&#26131;&#21644;&#24615;&#21035;&#20998;&#21106;&#30340;&#21171;&#21160;&#21147;&#24066;&#22330;&#32467;&#21512;&#36215;&#26469;&#65292;&#20197;&#23637;&#31034;&#22806;&#37096;&#38656;&#27714;&#20914;&#20987;&#21487;&#33021;&#22686;&#21152;&#25110;&#20943;&#23569;&#22899;&#24615;&#30456;&#23545;&#20110;&#30007;&#24615;&#30340;&#23601;&#19994;&#27604;&#29575;&#12290;&#20851;&#38190;&#30340;&#29702;&#35770;&#32467;&#26524;&#27491;&#24335;&#34920;&#26126;&#65292;&#36152;&#26131;&#23545;&#24615;&#21035;&#20998;&#21106;&#21171;&#21160;&#21147;&#24066;&#22330;&#30340;&#24433;&#21709;&#20851;&#38190;&#21462;&#20915;&#20110;&#65288;a&#65289;&#38754;&#23545;&#22806;&#22269;&#38656;&#27714;&#20914;&#20987;&#30340;&#34892;&#19994;&#65307;&#20197;&#21450;&#65288;b&#65289;&#38656;&#27714;&#20914;&#20987;&#26469;&#33258;&#30340;&#22269;&#22806;&#24066;&#22330;&#22312;&#22269;&#20869;&#30340;&#30456;&#20851;&#37325;&#35201;&#24615;&#12290;&#22914;&#26524;&#19968;&#20010;&#30456;&#20851;&#24066;&#22330;&#30340;&#22806;&#37096;&#38656;&#27714;&#20914;&#20987;&#21457;&#29983;&#22312;&#19968;&#20010;&#22899;&#24615;&#23494;&#38598;&#65288;&#30007;&#24615;&#23494;&#38598;&#65289;&#30340;&#34892;&#19994;&#20013;&#65292;&#37027;&#20040;&#27169;&#22411;&#39044;&#27979;&#22899;&#24615;&#30456;&#23545;&#20110;&#30007;&#24615;&#30340;&#23601;&#19994;&#27604;&#29575;&#24212;&#35813;&#22686;&#21152;&#65288;&#19979;&#38477;&#65289;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#21033;&#29992;&#31361;&#23612;&#26031;&#26412;&#22320;&#21171;&#21160;&#21147;&#24066;&#22330;&#26292;&#38706;&#20110;&#22806;&#37096;&#38656;&#27714;&#20914;&#20987;&#30340;&#21487;&#20449;&#22806;&#29983;&#21464;&#21270;&#65292;&#24182;&#23637;&#31034;&#23454;&#35777;&#32467;&#26524;&#19982;&#29702;&#35770;&#39044;&#27979;&#19968;&#33268;&#12290;&#22312;&#31361;&#23612;&#26031;&#36825;&#26679;&#19968;&#20010;&#22269;&#23478;&#65292;
&lt;/p&gt;
&lt;p&gt;
This paper focuses on how gender segmentation in labor markets shapes the local effects of international trade. We first develop a theoretical framework that embeds trade and gender-segmented labor markets to show that foreign demand shocks may either increase or decrease the female-to-male employment ratio. The key theoretical result shows formally that the effects of trade on gender-segmented labor markets depend crucially on (a) the sectors that face the foreign demand shock; and (b) the domestic relevance of the foreign countries in which the demand shocks originate from. If the foreign demand shock from a relevant market happens in a female-intensive (male-intensive) sector, the model predicts that the female-to-male employment ratio should increase (decrease). We then use plausibly exogenous variation in the exposure of Tunisian local labor markets to foreign demand shocks and show that the empirical results are consistent with the theoretical prediction. In Tunisia, a country wi
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#24037;&#20855;&#21464;&#37327;&#35782;&#21035;&#26041;&#27861;&#65292;&#23558;&#24120;&#35268;&#30340;&#22806;&#29983;&#24615;&#25918;&#26494;&#20026;&#22312;&#19968;&#20123;&#26410;&#35266;&#27979;&#20849;&#21516;&#28151;&#28102;&#22240;&#32032;&#26465;&#20214;&#19979;&#30340;&#22806;&#29983;&#24615;&#12290;&#20316;&#32773;&#25552;&#20986;&#20195;&#29702;&#21487;&#20197;&#30452;&#25509;&#24433;&#21709;&#20869;&#29983;&#22238;&#24402;&#22120;&#21644;&#32467;&#26524;&#12290;</title><link>http://arxiv.org/abs/2301.02052</link><description>&lt;p&gt;
&#36890;&#36807;&#20849;&#21516;&#28151;&#28102;&#22240;&#32032;&#25918;&#26494;&#24037;&#20855;&#30340;&#22806;&#29983;&#24615;
&lt;/p&gt;
&lt;p&gt;
Relaxing Instrument Exogeneity with Common Confounders. (arXiv:2301.02052v2 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2301.02052
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#24037;&#20855;&#21464;&#37327;&#35782;&#21035;&#26041;&#27861;&#65292;&#23558;&#24120;&#35268;&#30340;&#22806;&#29983;&#24615;&#25918;&#26494;&#20026;&#22312;&#19968;&#20123;&#26410;&#35266;&#27979;&#20849;&#21516;&#28151;&#28102;&#22240;&#32032;&#26465;&#20214;&#19979;&#30340;&#22806;&#29983;&#24615;&#12290;&#20316;&#32773;&#25552;&#20986;&#20195;&#29702;&#21487;&#20197;&#30452;&#25509;&#24433;&#21709;&#20869;&#29983;&#22238;&#24402;&#22120;&#21644;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24037;&#20855;&#21464;&#37327;&#21487;&#29992;&#20110;&#22312;&#23384;&#22312;&#26410;&#35266;&#27979;&#28151;&#28102;&#30340;&#24773;&#20917;&#19979;&#30830;&#23450;&#22240;&#26524;&#25928;&#24212;&#65292;&#22312;&#33879;&#21517;&#30340;&#30456;&#20851;&#24615;&#21644;&#22806;&#29983;&#24615;&#65288;&#26080;&#28151;&#28102;&#19982;&#25490;&#38500;&#65289;&#20551;&#35774;&#19979;&#12290;&#30001;&#20110;&#22806;&#29983;&#24615;&#38590;&#20197;&#35777;&#26126;&#24182;&#19988;&#22312;&#26576;&#31181;&#31243;&#24230;&#19978;&#26159;&#19981;&#21487;&#27979;&#35797;&#30340;&#65292;&#22240;&#27492;&#23427;&#32463;&#24120;&#21463;&#21040;&#24212;&#29992;&#20013;&#30340;&#25209;&#35780;&#12290;&#20026;&#20102;&#32531;&#35299;&#36825;&#20010;&#38382;&#39064;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#35782;&#21035;&#26041;&#27861;&#65292;&#23427;&#23558;&#20256;&#32479;&#30340;&#24037;&#20855;&#21464;&#37327;&#22806;&#29983;&#24615;&#25918;&#26494;&#20026;&#22312;&#19968;&#20123;&#26410;&#35266;&#27979;&#20849;&#21516;&#28151;&#28102;&#22240;&#32032;&#26465;&#20214;&#19979;&#30340;&#22806;&#29983;&#24615;&#12290;&#25105;&#20204;&#20551;&#35774;&#23384;&#22312;&#19968;&#20123;&#26410;&#35266;&#27979;&#20849;&#21516;&#28151;&#28102;&#22240;&#32032;&#30340;&#30456;&#20851;&#20195;&#29702;&#12290;&#19982;&#20856;&#22411;&#20195;&#29702;&#19981;&#21516;&#65292;&#25105;&#20204;&#30340;&#20195;&#29702;&#21487;&#20197;&#30452;&#25509;&#24433;&#21709;&#20869;&#29983;&#22238;&#24402;&#22120;&#21644;&#32467;&#26524;&#12290;&#25105;&#20204;&#22312;&#24178;&#25200;&#20013;&#25552;&#20379;&#20102;&#32447;&#24615;&#21487;&#20998;&#31163;&#30340;&#32467;&#26524;&#27169;&#22411;&#30340;&#23450;&#28857;&#35782;&#21035;&#32467;&#26524;&#65292;&#25110;&#32773;&#22312;&#31532;&#19968;&#38454;&#27573;&#20855;&#26377;&#20005;&#26684;&#21333;&#35843;&#24615;&#30340;&#24773;&#20917;&#19979;&#25552;&#20379;&#20102;&#23450;&#28857;&#35782;&#21035;&#32467;&#26524;&#12290;&#25105;&#20204;&#36830;&#32493;&#25512;&#23548;&#20102;&#36890;&#29992;&#30340;&#21452;&#37325;&#31283;&#20581;&#21644;Neyman&#27491;&#20132;&#30697;&#65292;&#20197;&#20415;&#23613;&#31649;&#39640;&#32500;&#21442;&#25968;&#65292;&#20063;&#33021;&#36827;&#34892;&#30452;&#25509;&#30340;&#26681;-n&#20272;&#35745;&#12290;
&lt;/p&gt;
&lt;p&gt;
Instruments can be used to identify causal effects in the presence of unobserved confounding, under the famous relevance and exogeneity (unconfoundedness and exclusion) assumptions. As exogeneity is difficult to justify and to some degree untestable, it often invites criticism in applications. Hoping to alleviate this problem, we propose a novel identification approach, which relaxes traditional IV exogeneity to exogeneity conditional on some unobserved common confounders. We assume there exist some relevant proxies for the unobserved common confounders. Unlike typical proxies, our proxies can have a direct effect on the endogenous regressor and the outcome. We provide point identification results with a linearly separable outcome model in the disturbance, and alternatively with strict monotonicity in the first stage. General doubly robust and Neyman orthogonal moments are derived consecutively to enable the straightforward root-n estimation of low-dimensional parameters despite the hi
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;1960&#24180;&#30422;&#23572;&#37325;&#35201;&#30340;&#35770;&#25991;&#65292;&#35777;&#26126;&#20102;&#20182;&#25152;&#26500;&#24314;&#30340;&#38656;&#27714;&#20989;&#25968;&#20505;&#36873;&#32773;&#19981;&#26159;&#19968;&#20010;&#38656;&#27714;&#20989;&#25968;&#65292;&#25581;&#31034;&#20102;&#26174;&#24335;&#20559;&#22909;&#29702;&#35770;&#20013;&#30340;&#19968;&#20123;&#37325;&#35201;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2208.07970</link><description>&lt;p&gt;
&#20851;&#20110;&#30422;&#23572;&#22312;&#26174;&#24335;&#20559;&#22909;&#29702;&#35770;&#20013;&#30340;&#36129;&#29486;
&lt;/p&gt;
&lt;p&gt;
On Gale's Contribution in Revealed Preference Theory. (arXiv:2208.07970v2 [econ.TH] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2208.07970
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;1960&#24180;&#30422;&#23572;&#37325;&#35201;&#30340;&#35770;&#25991;&#65292;&#35777;&#26126;&#20102;&#20182;&#25152;&#26500;&#24314;&#30340;&#38656;&#27714;&#20989;&#25968;&#20505;&#36873;&#32773;&#19981;&#26159;&#19968;&#20010;&#38656;&#27714;&#20989;&#25968;&#65292;&#25581;&#31034;&#20102;&#26174;&#24335;&#20559;&#22909;&#29702;&#35770;&#20013;&#30340;&#19968;&#20123;&#37325;&#35201;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;1960&#24180;&#30422;&#23572;&#21457;&#34920;&#30340;&#19968;&#31687;&#37325;&#35201;&#35770;&#25991;&#12290;&#35813;&#35770;&#25991;&#32473;&#20986;&#20102;&#19968;&#20010;&#38656;&#27714;&#20989;&#25968;&#30340;&#20505;&#36873;&#32773;&#30340;&#20363;&#23376;&#65292;&#23427;&#28385;&#36275;&#26174;&#24335;&#20559;&#22909;&#30340;&#24369;&#20844;&#29702;&#65292;&#20294;&#21364;&#23384;&#22312;&#20105;&#35758;&#65292;&#23427;&#26159;&#21542;&#26159;&#26576;&#20010;&#24369;&#24207;&#30340;&#38656;&#27714;&#20989;&#25968;&#12290;&#25105;&#20204;&#23545;&#36825;&#31687;&#35770;&#25991;&#36827;&#34892;&#20102;&#32454;&#33268;&#30340;&#35299;&#35835;&#65292;&#39318;&#20808;&#23457;&#26597;&#20102;&#30422;&#23572;&#25152;&#35777;&#26126;&#30340;&#20869;&#23481;&#65292;&#28982;&#21518;&#25105;&#20204;&#21457;&#29616;&#20102;&#30422;&#23572;&#35777;&#26126;&#20013;&#30340;&#19968;&#20010;&#32570;&#21475;&#65292;&#24182;&#19988;&#35777;&#26126;&#20102;&#20182;&#26410;&#33021;&#35777;&#26126;&#36825;&#20010;&#38656;&#27714;&#20989;&#25968;&#20505;&#36873;&#32773;&#19981;&#26159;&#19968;&#20010;&#38656;&#27714;&#20989;&#25968;&#12290;&#25509;&#30528;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19977;&#20010;&#23436;&#25972;&#30340;&#35777;&#26126;&#26469;&#35777;&#26126;&#30422;&#23572;&#30340;&#20027;&#24352;&#12290;&#31532;&#19968;&#20010;&#35777;&#26126;&#26159;&#22522;&#20110;Gale&#26412;&#20154;&#25152;&#35777;&#26126;&#30340;&#20107;&#23454;&#65292;&#31532;&#20108;&#20010;&#35777;&#26126;&#26159;&#20351;&#29992;Shephard&#24341;&#29702;&#65292;&#31616;&#21333;&#32780;&#29616;&#20195;&#21270;&#65292;&#31532;&#19977;&#20010;&#35777;&#26126;&#26159;&#27839;&#30528;&#30422;&#23572;&#26368;&#21021;&#26500;&#24605;&#30340;&#26041;&#21521;&#36827;&#34892;&#30340;&#12290;&#25105;&#20204;&#30340;&#32467;&#35770;&#26159;&#65306;&#23613;&#31649;&#22312;1960&#24180;&#65292;&#30422;&#23572;&#26410;&#33021;&#35777;&#26126;&#25152;&#26500;&#24314;&#30340;&#38656;&#27714;&#20989;&#25968;&#20505;&#36873;&#32773;&#19981;&#26159;&#19968;&#20010;&#38656;&#27714;&#20989;&#25968;&#65292;&#20294;&#20182;&#22522;&#26412;&#35777;&#26126;&#20102;&#23427;&#65292;&#22240;&#27492;&#21487;&#20197;&#35828;&#65292;&#35813;&#38656;&#27714;&#20989;&#25968;&#20505;&#36873;&#32773;&#19981;&#26159;&#19968;&#20010;&#38656;&#27714;&#20989;&#25968;&#12290;
&lt;/p&gt;
&lt;p&gt;
We investigate Gale's important paper published in 1960. This paper contains an example of a candidate of the demand function that satisfies the weak axiom of revealed preference and that is doubtful that it is a demand function of some weak order. We examine this paper and first scrutinize what Gale proved. Then we identify a gap in Gale's proof and show that he failed to show that this candidate of the demand function is not a demand function. Next, we present three complete proofs of Gale's claim. First, we construct a proof that was constructible in 1960 by a fact that Gale himself demonstrated. Second, we construct a modern and simple proof using Shephard's lemma. Third, we construct a proof that follows the direction that Gale originally conceived. Our conclusion is as follows: although, in 1960, Gale was not able to prove that the candidate of the demand function that he constructed is not a demand function, he substantially proved it, and therefore it is fair to say that the cr
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#35752;&#35770;&#20102;&#32463;&#27982;&#21160;&#24577;&#20013;&#30340;&#21704;&#23494;&#39039;-&#38597;&#21487;&#27604;-&#36125;&#23572;&#26364;&#26041;&#31243;&#38382;&#39064;&#65292;&#21457;&#29616;&#24403;&#21407;&#38382;&#39064;&#26080;&#35299;&#26102;&#20250;&#20986;&#29616;&#20215;&#20540;&#20989;&#25968;&#19981;&#28385;&#36275;&#35813;&#26041;&#31243;&#30340;&#29616;&#35937;&#65292;&#24182;&#22312;&#29305;&#23450;&#26465;&#20214;&#19979;&#35777;&#26126;&#20102;&#21407;&#38382;&#39064;&#23384;&#22312;&#35299;&#24403;&#19988;&#20165;&#24403;&#20215;&#20540;&#20989;&#25968;&#28385;&#36275;&#35813;&#26041;&#31243;&#12290;&#27492;&#22806;&#65292;&#20215;&#20540;&#20989;&#25968;&#26159;&#21704;&#23494;&#39039;-&#38597;&#21487;&#27604;-&#36125;&#23572;&#26364;&#26041;&#31243;&#30340;&#21807;&#19968;&#38750;&#38477;&#20985;&#35299;&#12290;</title><link>http://arxiv.org/abs/2203.10595</link><description>&lt;p&gt;
&#20851;&#20110;&#32463;&#27982;&#21160;&#24577;&#20013;&#21704;&#23494;&#39039;-&#38597;&#21487;&#27604;-&#36125;&#23572;&#26364;&#26041;&#31243;&#22522;&#30784;&#33030;&#24369;&#24615;&#30340;&#25506;&#35752;
&lt;/p&gt;
&lt;p&gt;
On the Fragility of the Basis on the Hamilton-Jacobi-Bellman Equation in Economic Dynamics. (arXiv:2203.10595v3 [econ.TH] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2203.10595
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#35752;&#35770;&#20102;&#32463;&#27982;&#21160;&#24577;&#20013;&#30340;&#21704;&#23494;&#39039;-&#38597;&#21487;&#27604;-&#36125;&#23572;&#26364;&#26041;&#31243;&#38382;&#39064;&#65292;&#21457;&#29616;&#24403;&#21407;&#38382;&#39064;&#26080;&#35299;&#26102;&#20250;&#20986;&#29616;&#20215;&#20540;&#20989;&#25968;&#19981;&#28385;&#36275;&#35813;&#26041;&#31243;&#30340;&#29616;&#35937;&#65292;&#24182;&#22312;&#29305;&#23450;&#26465;&#20214;&#19979;&#35777;&#26126;&#20102;&#21407;&#38382;&#39064;&#23384;&#22312;&#35299;&#24403;&#19988;&#20165;&#24403;&#20215;&#20540;&#20989;&#25968;&#28385;&#36275;&#35813;&#26041;&#31243;&#12290;&#27492;&#22806;&#65292;&#20215;&#20540;&#20989;&#25968;&#26159;&#21704;&#23494;&#39039;-&#38597;&#21487;&#27604;-&#36125;&#23572;&#26364;&#26041;&#31243;&#30340;&#21807;&#19968;&#38750;&#38477;&#20985;&#35299;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20379;&#20102;&#19968;&#20010;&#26368;&#20248;&#22686;&#38271;&#27169;&#22411;&#30340;&#20363;&#23376;&#65292;&#20854;&#20013;&#23384;&#22312;&#26080;&#38480;&#22810;&#20010;&#21704;&#23494;&#39039;-&#38597;&#21487;&#27604;-&#36125;&#23572;&#26364;&#26041;&#31243;&#30340;&#35299;&#65292;&#20294;&#20215;&#20540;&#20989;&#25968;&#21364;&#19981;&#28385;&#36275;&#35813;&#26041;&#31243;&#12290;&#25105;&#20204;&#25506;&#31350;&#20102;&#36825;&#31181;&#29616;&#35937;&#30340;&#21407;&#22240;&#65292;&#24182;&#21457;&#29616;&#21407;&#38382;&#39064;&#26080;&#35299;&#26159;&#20851;&#38190;&#25152;&#22312;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#22312;&#33509;&#24178;&#26465;&#20214;&#19979;&#65292;&#21407;&#38382;&#39064;&#23384;&#22312;&#35299;&#24403;&#19988;&#20165;&#24403;&#20215;&#20540;&#20989;&#25968;&#28385;&#36275;&#21704;&#23494;&#39039;-&#38597;&#21487;&#27604;-&#36125;&#23572;&#26364;&#26041;&#31243;&#12290;&#27492;&#22806;&#65292;&#22312;&#36825;&#31181;&#24773;&#20917;&#19979;&#65292;&#20215;&#20540;&#20989;&#25968;&#26159;&#21704;&#23494;&#39039;-&#38597;&#21487;&#27604;-&#36125;&#23572;&#26364;&#26041;&#31243;&#30340;&#21807;&#19968;&#38750;&#38477;&#20985;&#35299;&#12290;&#25105;&#20204;&#36824;&#35777;&#26126;&#20102;&#22312;&#27809;&#26377;&#25105;&#20204;&#26465;&#20214;&#30340;&#24773;&#20917;&#19979;&#65292;&#36825;&#31181;&#21807;&#19968;&#24615;&#32467;&#26524;&#26159;&#19981;&#25104;&#31435;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this paper, we provide an example of the optimal growth model in which there exist infinitely many solutions to the Hamilton-Jacobi-Bellman equation but the value function does not satisfy this equation. We consider the cause of this phenomenon, and find that the lack of a solution to the original problem is crucial. We show that under several conditions, there exists a solution to the original problem if and only if the value function solves the Hamilton-Jacobi-Bellman equation. Moreover, in this case, the value function is the unique nondecreasing concave solution to the Hamilton-Jacobi-Bellman equation. We also show that without our conditions, this uniqueness result does not hold.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#38750;&#27954;&#30719;&#19994;&#24320;&#37319;&#23545;&#24403;&#22320;&#32463;&#27982;&#30340;&#24433;&#21709;&#65292;&#32467;&#26524;&#21457;&#29616;&#30719;&#20117;&#24320;&#25918;&#20250;&#26174;&#33879;&#20419;&#36827;&#24403;&#22320;&#22478;&#24066;&#22320;&#21306;&#30340;&#22686;&#38271;&#65292;&#20294;&#25919;&#27835;&#36164;&#28304;&#35781;&#21650;&#23384;&#22312;&#20110;&#23041;&#26435;&#20027;&#20041;&#22269;&#23478;&#65292;&#32780;&#30701;&#26242;&#30340;&#22686;&#38271;&#20165;&#20250;&#38543;&#30528;&#30719;&#20117;&#30340;&#20851;&#38381;&#32780;&#20943;&#36864;&#12290;</title><link>http://arxiv.org/abs/2111.05783</link><description>&lt;p&gt;
&#38750;&#27954;&#30719;&#19994;&#23545;&#24403;&#22320;&#32463;&#27982;&#30340;&#24433;&#21709;&#65306;&#22522;&#20110;&#22235;&#21313;&#24180;&#21355;&#26143;&#22270;&#20687;&#30340;&#35777;&#25454;
&lt;/p&gt;
&lt;p&gt;
The Local Economic Impact of Mineral Mining in Africa: Evidence from Four Decades of Satellite Imagery. (arXiv:2111.05783v4 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2111.05783
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#38750;&#27954;&#30719;&#19994;&#24320;&#37319;&#23545;&#24403;&#22320;&#32463;&#27982;&#30340;&#24433;&#21709;&#65292;&#32467;&#26524;&#21457;&#29616;&#30719;&#20117;&#24320;&#25918;&#20250;&#26174;&#33879;&#20419;&#36827;&#24403;&#22320;&#22478;&#24066;&#22320;&#21306;&#30340;&#22686;&#38271;&#65292;&#20294;&#25919;&#27835;&#36164;&#28304;&#35781;&#21650;&#23384;&#22312;&#20110;&#23041;&#26435;&#20027;&#20041;&#22269;&#23478;&#65292;&#32780;&#30701;&#26242;&#30340;&#22686;&#38271;&#20165;&#20250;&#38543;&#30528;&#30719;&#20117;&#30340;&#20851;&#38381;&#32780;&#20943;&#36864;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36816;&#29992;&#35745;&#31639;&#26426;&#35270;&#35273;&#30340;&#26368;&#26032;&#25216;&#26415;&#65292;&#25105;&#20204;&#20998;&#26512;&#20102;1984&#24180;&#33267;2019&#24180;&#26399;&#38388;&#35206;&#30422;&#38750;&#27954;&#22823;&#38470;12%&#30340;100&#19975;&#24352;&#21355;&#26143;&#22270;&#20687;&#65292;&#36319;&#36394;1,658&#20010;&#30719;&#24202;&#21608;&#22260;&#30340;&#24403;&#22320;&#21457;&#23637;&#24773;&#20917;&#12290;&#25105;&#20204;&#20351;&#29992;&#22534;&#31215;&#20107;&#20214;&#30740;&#31350;&#21644;&#24046;&#24322;&#27861;&#27169;&#22411;&#26469;&#20272;&#35745;&#30719;&#20117;&#24320;&#25918;&#21644;&#20851;&#38381;&#30340;&#24433;&#21709;&#12290;&#30719;&#20117;&#24320;&#25918;&#30340;&#24433;&#21709;&#31243;&#24230;&#30456;&#24403;&#22823;- 15&#24180;&#21518;&#65292;&#22312;&#24320;&#25918;&#30719;&#20117;20&#20844;&#37324;&#20869;&#30340;&#22478;&#24066;&#22320;&#21306;&#20960;&#20046;&#22686;&#38271;&#20102;&#19968;&#20493;&#12290;&#25105;&#20204;&#21457;&#29616;&#24378;&#26377;&#21147;&#30340;&#25919;&#27835;&#36164;&#28304;&#35781;&#21650;&#22312;&#22320;&#26041;&#23618;&#38754;&#23384;&#22312;&#12290;&#23613;&#31649;&#30719;&#19994;&#22312;&#27665;&#20027;&#22269;&#23478;&#20013;&#25552;&#25391;&#20102;&#24403;&#22320;&#32463;&#27982;&#65292;&#20294;&#22312;&#23041;&#26435;&#20027;&#20041;&#22269;&#23478;&#20013;&#65292;&#36825;&#20123;&#25910;&#30410;&#24494;&#19981;&#36275;&#36947;&#65292;&#24182;&#20197;&#19977;&#20493;&#20110;&#30719;&#19994;&#24320;&#23637;&#21069;&#30340;&#20914;&#31361;&#21487;&#33021;&#24615;&#20026;&#20195;&#20215;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#30340;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;&#22312;&#30719;&#21306;&#21152;&#36895;&#22686;&#38271;&#20165;&#26159;&#26242;&#26102;&#30340;&#65292;&#38543;&#30528;&#30719;&#20117;&#20851;&#38381;&#32780;&#20943;&#36864;&#12290;
&lt;/p&gt;
&lt;p&gt;
Using state-of-the-art techniques in computer vision, we analyze one million satellite images covering 12% of the African continent between 1984 and 2019 to track local development around 1,658 mineral deposits. We use stacked event studies and difference-in-difference models to estimate the impact of mine openings and closings. The magnitude of the effect of mine openings is considerable - after 15 years, urban areas within 20km of an opening mine almost double in size. We find strong evidence of a political resource curse at the local level. Although mining boosts the local economy in democratic countries, these gains are meager in autocracies and come at the expense of tripling the likelihood of conflict relative to prior the onset of mining. Furthermore, our results suggest that the growth acceleration in mining areas is only temporary and diminishes with the closure of the mine.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#26032;&#30340;&#32858;&#25314;&#35782;&#21035;&#31574;&#30053;&#65292;&#20811;&#26381;&#20102;&#24403;&#21069;&#26041;&#27861;&#25935;&#24863;&#24615;&#38382;&#39064;&#65292;&#23637;&#31034;&#20102;&#32858;&#25314;&#24377;&#24615;&#22914;&#20309;&#20381;&#36182;&#20110;&#19981;&#21516;&#30340;&#35782;&#21035;&#20551;&#35774;&#65292;&#24182;&#33719;&#24471;&#20102;&#33258;&#38599;&#21644;&#26410;&#23130;&#32435;&#31246;&#20154;&#30340;&#31283;&#20581;&#20272;&#35745;&#12290;</title><link>http://arxiv.org/abs/2101.01170</link><description>&lt;p&gt;
&#26356;&#22909;&#30340;&#32858;&#25314;&#65292;&#26356;&#22909;&#30340;&#20999;&#21475;&#8212;&#8212;&#19968;&#39033;&#20851;&#20110;&#22870;&#21169;&#35745;&#21010;&#24433;&#21709;&#35780;&#20272;&#26041;&#27861;&#30340;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Better Bunching, Nicer Notching. (arXiv:2101.01170v3 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2101.01170
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#26032;&#30340;&#32858;&#25314;&#35782;&#21035;&#31574;&#30053;&#65292;&#20811;&#26381;&#20102;&#24403;&#21069;&#26041;&#27861;&#25935;&#24863;&#24615;&#38382;&#39064;&#65292;&#23637;&#31034;&#20102;&#32858;&#25314;&#24377;&#24615;&#22914;&#20309;&#20381;&#36182;&#20110;&#19981;&#21516;&#30340;&#35782;&#21035;&#20551;&#35774;&#65292;&#24182;&#33719;&#24471;&#20102;&#33258;&#38599;&#21644;&#26410;&#23130;&#32435;&#31246;&#20154;&#30340;&#31283;&#20581;&#20272;&#35745;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#29992;&#20110;&#24377;&#24615;&#21442;&#25968;&#30340;&#32858;&#25314;&#35782;&#21035;&#31574;&#30053;&#65292;&#35813;&#21442;&#25968;&#24635;&#32467;&#20102;&#20195;&#29702;&#20154;&#23545;&#20110;&#28608;&#21169;&#35745;&#21010;&#20013;&#26012;&#29575;&#65288;&#25296;&#28857;&#65289;&#25110;&#25130;&#36317;&#65288;&#20999;&#21475;&#65289;&#21464;&#21270;&#30340;&#21453;&#24212;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#24403;&#21069;&#30340;&#32858;&#25314;&#26041;&#27861;&#21487;&#33021;&#38750;&#24120;&#25935;&#24863;&#20110;&#25991;&#29486;&#20013;&#20851;&#20110;&#26410;&#35266;&#27979;&#21040;&#30340;&#20010;&#20307;&#24322;&#36136;&#24615;&#30340;&#38544;&#21547;&#20551;&#35774;&#12290;&#36890;&#36807;&#24341;&#20837;&#26032;&#30340;&#38750;&#21442;&#25968;&#20272;&#35745;&#37327;&#21644;&#21322;&#21442;&#25968;&#20272;&#35745;&#37327;&#65292;&#25105;&#20204;&#20811;&#26381;&#20102;&#36825;&#31181;&#25935;&#24863;&#24615;&#38382;&#39064;&#12290;&#25105;&#20204;&#30340;&#20272;&#35745;&#22120;&#20801;&#35768;&#30740;&#31350;&#20154;&#21592;&#23637;&#31034;&#32858;&#25314;&#24377;&#24615;&#22914;&#20309;&#20381;&#36182;&#20110;&#19981;&#21516;&#30340;&#35782;&#21035;&#20551;&#35774;&#65292;&#20197;&#21450;&#24377;&#24615;&#22312;&#20551;&#35774;&#19979;&#26159;&#21542;&#31283;&#20581;&#12290;&#25105;&#20204;&#36981;&#24490;&#25991;&#29486;&#24182;&#22312;&#31561;&#24377;&#24615;&#25928;&#29992;&#27169;&#22411;&#21644;&#21019;&#36896;&#20998;&#27573;&#32447;&#24615;&#39044;&#31639;&#38480;&#21046;&#30340;&#25152;&#24471;&#31246;&#35745;&#21010;&#30340;&#32972;&#26223;&#19979;&#25512;&#23548;&#20102;&#25105;&#20204;&#30340;&#26041;&#27861;&#12290;&#25105;&#20204;&#22312;&#32654;&#22269;&#33719;&#24471;&#25152;&#24471;&#31246;&#25269;&#20813;&#20013;&#23637;&#31034;&#20102;&#32858;&#25314;&#34892;&#20026;&#25552;&#20379;&#20102;&#33258;&#38599;&#21644;&#26410;&#23130;&#32435;&#31246;&#20154;&#31283;&#20581;&#30340;&#20272;&#35745;&#12290;&#30456;&#27604;&#20043;&#19979;&#65292;&#33258;&#38599;&#21644;&#24050;&#23130;&#32435;&#31246;&#20154;&#30340;&#20272;&#35745;&#20381;&#36182;&#20110;&#20855;&#20307;&#30340;&#35782;&#21035;&#20551;&#35774;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper studies the bunching identification strategy for an elasticity parameter that summarizes agents' responses to changes in slope (kink) or intercept (notch) of a schedule of incentives. We show that current bunching methods may be very sensitive to implicit assumptions in the literature about unobserved individual heterogeneity. We overcome this sensitivity concern with new non- and semi-parametric estimators. Our estimators allow researchers to show how bunching elasticities depend on different identifying assumptions and when elasticities are robust to them. We follow the literature and derive our methods in the context of the iso-elastic utility model and an income tax schedule that creates a piece-wise linear budget constraint. We demonstrate bunching behavior provides robust estimates for self-employed and not-married taxpayers in the context of the U.S. Earned Income Tax Credit. In contrast, estimates for self-employed and married taxpayers depend on specific identifying
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#32447;&#24615;&#26377;&#29702;&#39044;&#26399;&#27169;&#22411;&#65292;&#22312;&#39057;&#22495;&#19979;&#25552;&#20986;&#20102;&#27491;&#21017;&#21270;&#35299;&#65292;&#22312;&#35299;&#30340;&#21807;&#19968;&#24615;&#12289;&#36830;&#32493;&#24615;&#21644;&#21487;&#24494;&#24615;&#26041;&#38754;&#25552;&#20379;&#20102;&#29702;&#35770;&#20445;&#35777;&#12290;</title><link>http://arxiv.org/abs/2007.13804</link><description>&lt;p&gt;
&#32447;&#24615;&#26377;&#29702;&#39044;&#26399;&#27169;&#22411;&#30340;&#35889;&#26041;&#27861;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
The Spectral Approach to Linear Rational Expectations Models. (arXiv:2007.13804v4 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2007.13804
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#32447;&#24615;&#26377;&#29702;&#39044;&#26399;&#27169;&#22411;&#65292;&#22312;&#39057;&#22495;&#19979;&#25552;&#20986;&#20102;&#27491;&#21017;&#21270;&#35299;&#65292;&#22312;&#35299;&#30340;&#21807;&#19968;&#24615;&#12289;&#36830;&#32493;&#24615;&#21644;&#21487;&#24494;&#24615;&#26041;&#38754;&#25552;&#20379;&#20102;&#29702;&#35770;&#20445;&#35777;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#22312;&#19968;&#33324;&#26465;&#20214;&#19979;&#32771;&#34385;&#32447;&#24615;&#26377;&#29702;&#39044;&#26399;&#27169;&#22411;&#30340;&#39057;&#22495;&#38382;&#39064;&#12290;&#26412;&#25991;&#21457;&#23637;&#20102;&#29305;&#23450;&#21644;&#19968;&#33324;&#31995;&#32479;&#23384;&#22312;&#21807;&#19968;&#24615;&#30340;&#24517;&#35201;&#21644;&#20805;&#20998;&#26465;&#20214;&#65292;&#24182;&#23558;&#25152;&#26377;&#35299;&#30340;&#31354;&#38388;&#21051;&#30011;&#20026;&#39057;&#22495;&#20013;&#30340;&#20223;&#23556;&#31354;&#38388;&#12290;&#30740;&#31350;&#34920;&#26126;&#65292;&#35299;&#36890;&#24120;&#19981;&#36830;&#32493;&#65292;&#36825;&#20351;&#24471;&#20027;&#27969;&#30340;&#39057;&#29575;&#27966;&#21644;&#36125;&#21494;&#26031;&#26041;&#27861;&#22833;&#25928;&#65292;&#36825;&#20010;&#38382;&#39064;&#30340;&#19981;&#36866;&#23450;&#24615;&#20419;&#36827;&#20102;&#29702;&#35770;&#19978;&#20445;&#35777;&#29420;&#29305;&#24615;&#12289;&#36830;&#32493;&#24615;&#29978;&#33267;&#21487;&#24494;&#24615;&#30340;&#27491;&#21017;&#35299;&#12290;&#26412;&#25991;&#23545;&#20004;&#20010;&#20998;&#26512;&#24615;&#21487;&#22788;&#29702;&#27169;&#22411;&#30340;&#26497;&#38480;&#39640;&#26031;&#20284;&#28982;&#20989;&#25968;&#30340;&#20998;&#26512;&#20013;&#32473;&#20986;&#20102;&#27491;&#21017;&#21270;&#30340;&#20363;&#23376;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper considers linear rational expectations models in the frequency domain under general conditions. The paper develops necessary and sufficient conditions for existence and uniqueness of particular and generic systems and characterizes the space of all solutions as an affine space in the frequency domain. It is demonstrated that solutions are not generally continuous with respect to the parameters of the models, invalidating mainstream frequentist and Bayesian methods. The ill-posedness of the problem motivates regularized solutions with theoretically guaranteed uniqueness, continuity, and even differentiability properties. Regularization is illustrated in an analysis of the limiting Gaussian likelihood functions of two analytically tractable models.
&lt;/p&gt;</description></item></channel></rss>