<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#35813;&#35770;&#25991;&#25209;&#21028;&#24615;&#22320;&#20998;&#26512;&#20102;&#39321;&#28207;-&#20329;&#22855;&#23450;&#29702;&#65292;&#22312;&#25506;&#35752;&#38598;&#20307;&#26234;&#33021;&#20013;&#22810;&#26679;&#24615;&#21644;&#33021;&#21147;&#30340;&#30456;&#20114;&#20316;&#29992;&#26102;&#65292;&#25581;&#31034;&#20102;&#20854;&#22266;&#26377;&#30340;&#32570;&#38519;&#21644;&#35823;&#35299;&#12290;&#21516;&#26102;&#65292;&#35813;&#35770;&#25991;&#24378;&#35843;&#22312;&#24212;&#29992;&#25968;&#23398;&#21407;&#21017;&#20110;&#31038;&#20250;&#31185;&#23398;&#26102;&#35201;&#36991;&#20813;&#28389;&#29992;&#65292;&#24182;&#24378;&#35843;&#20102;&#8220;&#33021;&#21147;&#8221;&#30340;&#37325;&#35201;&#24615;&#12290;</title><link>http://arxiv.org/abs/2307.04709</link><description>&lt;p&gt;
&#39321;&#28207;-&#20329;&#22855;&#23450;&#29702;&#21644;Landemore&#30340;&#35748;&#35782;&#35770;&#35770;&#35777;&#20013;&#30340;&#33268;&#21629;&#25968;&#23398;&#38169;&#35823;
&lt;/p&gt;
&lt;p&gt;
Fatal mathematical errors in Hong-Page Theorem and Landemore's epistemic argument. (arXiv:2307.04709v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.04709
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25209;&#21028;&#24615;&#22320;&#20998;&#26512;&#20102;&#39321;&#28207;-&#20329;&#22855;&#23450;&#29702;&#65292;&#22312;&#25506;&#35752;&#38598;&#20307;&#26234;&#33021;&#20013;&#22810;&#26679;&#24615;&#21644;&#33021;&#21147;&#30340;&#30456;&#20114;&#20316;&#29992;&#26102;&#65292;&#25581;&#31034;&#20102;&#20854;&#22266;&#26377;&#30340;&#32570;&#38519;&#21644;&#35823;&#35299;&#12290;&#21516;&#26102;&#65292;&#35813;&#35770;&#25991;&#24378;&#35843;&#22312;&#24212;&#29992;&#25968;&#23398;&#21407;&#21017;&#20110;&#31038;&#20250;&#31185;&#23398;&#26102;&#35201;&#36991;&#20813;&#28389;&#29992;&#65292;&#24182;&#24378;&#35843;&#20102;&#8220;&#33021;&#21147;&#8221;&#30340;&#37325;&#35201;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#29702;&#35299;&#38598;&#20307;&#26234;&#33021;&#30340;&#36807;&#31243;&#20013;&#65292;&#39321;&#28207;-&#20329;&#22855;&#23450;&#29702;&#34987;&#25552;&#20986;&#20316;&#20026;&#22810;&#26679;&#24615;&#21644;&#33021;&#21147;&#30456;&#20114;&#20316;&#29992;&#30340;&#22522;&#30707;&#12290;&#28982;&#32780;&#65292;&#22312;&#32463;&#36807;&#20005;&#26684;&#30340;&#23457;&#26597;&#21518;&#65292;&#36825;&#20123;&#23450;&#29702;&#20013;&#20284;&#20046;&#23384;&#22312;&#30528;&#22266;&#26377;&#30340;&#32570;&#38519;&#21644;&#35823;&#35299;&#12290;H&#233;l&#232;ne Landemore&#22312;&#22905;&#30340;&#35748;&#35782;&#35770;&#35770;&#35777;&#21644;&#25919;&#27835;&#25552;&#26696;&#20013;&#23545;&#36825;&#20123;&#23450;&#29702;&#30340;&#24212;&#29992;&#23637;&#31034;&#20102;&#23545;&#25968;&#23398;&#21407;&#21017;&#30340;&#19981;&#24403;&#20351;&#29992;&#12290;&#26412;&#25991;&#23545;&#39321;&#28207;-&#20329;&#22855;&#23450;&#29702;&#36827;&#34892;&#20102;&#25209;&#21028;&#24615;&#21078;&#26512;&#65292;&#25581;&#31034;&#20102;&#37325;&#22823;&#30340;&#19981;&#19968;&#33268;&#24615;&#21644;&#30095;&#24573;&#65292;&#24182;&#24378;&#35843;&#20102;&#22312;&#32676;&#20307;&#38382;&#39064;&#35299;&#20915;&#32972;&#26223;&#19979;&#65292;&#8220;&#33021;&#21147;&#8221;&#30340;&#19981;&#21487;&#25110;&#32570;&#24615;&#12290;&#26412;&#25991;&#26088;&#22312;&#24378;&#35843;&#19981;&#28389;&#29992;&#25968;&#23398;&#21407;&#21017;&#30340;&#21361;&#38505;&#20197;&#21450;&#22312;&#23558;&#20854;&#24212;&#29992;&#20110;&#31038;&#20250;&#31185;&#23398;&#26102;&#26356;&#21152;&#32454;&#33268;&#30340;&#29702;&#35299;&#25968;&#23398;&#32467;&#26524;&#30340;&#24517;&#35201;&#24615;&#65292;&#32780;&#19981;&#26159;&#21066;&#24369;&#22810;&#26679;&#24615;&#30340;&#37325;&#35201;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
In the pursuit of understanding collective intelligence, the Hong-Page Theorems have been presented as cornerstones of the interplay between diversity and ability. However, upon rigorous examination, there seem to be inherent flaws and misinterpretations within these theorems. H\'el\`ene Landemore's application of these theorems in her epistemic argument and her political proposal showcases a rather unsettling misuse of mathematical principles. This paper critically dissects the HongPage Theorems, revealing significant inconsistencies and oversights, and underscores the indispensable role of 'ability' in group problem-solving contexts. This paper aims not to undermine the importance of diversity, but rather to highlight the dangers of misusing mathematical principles and the necessity for a more nuanced comprehension of mathematical results when applying them to social sciences.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#24320;&#21457;&#20102;&#19968;&#22871;&#25351;&#26631;&#20307;&#31995;&#26469;&#35780;&#20272;&#20449;&#24687;&#19981;&#23545;&#31216;&#32972;&#26223;&#19979;&#35777;&#21048;&#24066;&#22330;&#30340;&#32489;&#25928;&#65292;&#20026;&#35777;&#21048;&#24066;&#22330;&#21457;&#23637;&#25552;&#20379;&#20102;&#26377;&#25928;&#30340;&#25919;&#31574;&#65292;&#24182;&#36890;&#36807;&#23545;&#20420;&#32599;&#26031;&#35777;&#21048;&#24066;&#22330;&#30340;&#26696;&#20363;&#30740;&#31350;&#65292;&#25552;&#20379;&#20102;&#19968;&#20010;&#35780;&#20272;&#35777;&#21048;&#24066;&#22330;&#32489;&#25928;&#30340;&#21407;&#22987;&#35780;&#20998;&#26631;&#20934;&#12290;</title><link>http://arxiv.org/abs/2307.04140</link><description>&lt;p&gt;
&#20449;&#24687;&#19981;&#23545;&#31216;&#32972;&#26223;&#19979;&#30340;&#35777;&#21048;&#24066;&#22330;&#21160;&#24577;&#65306;&#21457;&#23637;&#26032;&#20852;&#35777;&#21048;&#24066;&#22330;&#30340;&#26041;&#27861;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Dynamics of the securities market in the information asymmetry context: developing a methodology for emerging securities markets. (arXiv:2307.04140v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.04140
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#24320;&#21457;&#20102;&#19968;&#22871;&#25351;&#26631;&#20307;&#31995;&#26469;&#35780;&#20272;&#20449;&#24687;&#19981;&#23545;&#31216;&#32972;&#26223;&#19979;&#35777;&#21048;&#24066;&#22330;&#30340;&#32489;&#25928;&#65292;&#20026;&#35777;&#21048;&#24066;&#22330;&#21457;&#23637;&#25552;&#20379;&#20102;&#26377;&#25928;&#30340;&#25919;&#31574;&#65292;&#24182;&#36890;&#36807;&#23545;&#20420;&#32599;&#26031;&#35777;&#21048;&#24066;&#22330;&#30340;&#26696;&#20363;&#30740;&#31350;&#65292;&#25552;&#20379;&#20102;&#19968;&#20010;&#35780;&#20272;&#35777;&#21048;&#24066;&#22330;&#32489;&#25928;&#30340;&#21407;&#22987;&#35780;&#20998;&#26631;&#20934;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21457;&#23637;&#19968;&#20010;&#21453;&#26144;&#35777;&#21048;&#24066;&#22330;&#23653;&#34892;&#20851;&#38190;&#21151;&#33021;&#31243;&#24230;&#30340;&#25351;&#26631;&#20307;&#31995;&#23545;&#20110;&#35780;&#20272;&#20854;&#21457;&#23637;&#27700;&#24179;&#33267;&#20851;&#37325;&#35201;&#12290;&#22312;&#20449;&#24687;&#19981;&#23545;&#31216;&#30340;&#26465;&#20214;&#19979;&#65292;&#23427;&#36824;&#21487;&#20197;&#25552;&#20379;&#26377;&#25928;&#30340;&#35777;&#21048;&#24066;&#22330;&#21457;&#23637;&#25919;&#31574;&#12290;&#26412;&#25991;&#26088;&#22312;&#21457;&#23637;&#19968;&#22871;&#25351;&#26631;&#26469;&#35780;&#20272;&#35777;&#21048;&#24066;&#22330;&#30340;&#32489;&#25928;&#65292;&#29305;&#21035;&#26159;&#22312;&#20449;&#24687;&#19981;&#23545;&#31216;&#30340;&#32972;&#26223;&#19979;&#12290;&#20026;&#27492;&#65292;&#25105;&#20204;&#36873;&#25321;&#20102;&#20420;&#32599;&#26031;&#35777;&#21048;&#24066;&#22330;&#20316;&#20026;&#20449;&#24687;&#19981;&#23545;&#31216;&#32972;&#26223;&#30340;&#26696;&#20363;&#65292;&#19982;&#20854;&#20182;&#21518;&#33487;&#32852;&#22269;&#23478;&#36827;&#34892;&#27604;&#36739;&#65292;&#35843;&#26597;&#20854;&#22312;&#23653;&#34892;&#20851;&#38190;&#21151;&#33021;&#26041;&#38754;&#30340;&#25104;&#21151;&#21644;&#22833;&#36133;&#12290;&#22312;&#27492;&#22522;&#30784;&#19978;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#30740;&#31350;&#20551;&#35774;&#65292;&#24182;&#37319;&#29992;&#19968;&#31181;&#29702;&#35770;&#30740;&#31350;&#26041;&#27861;&#65292;&#26681;&#25454;&#24066;&#22330;&#29702;&#35770;&#27169;&#22411;&#20316;&#20026;&#26816;&#39564;&#20551;&#35774;&#30340;&#26631;&#20934;&#12290;&#30740;&#31350;&#32467;&#26524;&#25552;&#20379;&#20102;&#19968;&#20010;&#35780;&#20272;&#35777;&#21048;&#24066;&#22330;&#32489;&#25928;&#30340;&#21407;&#22987;&#35780;&#20998;&#26631;&#20934;&#12290;&#30740;&#31350;&#32467;&#26524;&#36824;&#26377;&#21161;&#20110;&#20174;&#19994;&#20154;&#21592;&#30340;&#20915;&#31574;&#12290;
&lt;/p&gt;
&lt;p&gt;
Developing a system of indicators that reflects the degree to which the securities market fulfils its key functions, is essential to assess the level of its development. In the conditions of asymmetric information it can also provide effective policies for securities market development. This paper is aimed to develop a set of indicators to assess the securities market performance, especially in the asymmetric information context. To this goal, we selected the Russian securities market as a case of asymmetric information context, in comparison with other post-Soviet countries, to investigate its success and failure in fulfilling its key functions. Regarding this, we developed research hypotheses and we conducted a normative research method, based on an ideal model of market functioning that is used as a criterion for testing the hypotheses. The results offer an original scale for assessing the performance of securities market of its functions. The findings also help practitioners with e
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#22312;&#32447;&#24615;Fisher&#24066;&#22330;&#20013;&#30340;&#24322;&#27493;&#27604;&#20363;&#21709;&#24212;&#21160;&#21147;&#23398;&#65292;&#24182;&#35777;&#26126;&#20102;&#22914;&#26524;&#27599;&#20010;&#25237;&#26631;&#20154;&#22312;&#34987;&#23545;&#25163;&#36873;&#25321;&#30340;&#25237;&#26631;&#20154;&#32452;&#20013;&#26102;&#37117;&#20010;&#21035;&#22320;&#20351;&#29992;PRD&#26356;&#26032;&#35268;&#21017;&#65292;&#37027;&#20040;&#25972;&#20010;&#21160;&#24577;&#36807;&#31243;&#23558;&#20250;&#25910;&#25947;&#21040;&#24066;&#22330;&#30340;&#31454;&#20105;&#22343;&#34913;&#12290;</title><link>http://arxiv.org/abs/2307.04108</link><description>&lt;p&gt;
&#24322;&#27493;&#27604;&#20363;&#21709;&#24212;&#21160;&#21147;&#23398;&#22312;&#24102;&#26377;&#23545;&#25239;&#35843;&#24230;&#30340;&#24066;&#22330;&#20013;&#30340;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Asynchronous Proportional Response Dynamics in Markets with Adversarial Scheduling. (arXiv:2307.04108v1 [cs.GT])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.04108
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#22312;&#32447;&#24615;Fisher&#24066;&#22330;&#20013;&#30340;&#24322;&#27493;&#27604;&#20363;&#21709;&#24212;&#21160;&#21147;&#23398;&#65292;&#24182;&#35777;&#26126;&#20102;&#22914;&#26524;&#27599;&#20010;&#25237;&#26631;&#20154;&#22312;&#34987;&#23545;&#25163;&#36873;&#25321;&#30340;&#25237;&#26631;&#20154;&#32452;&#20013;&#26102;&#37117;&#20010;&#21035;&#22320;&#20351;&#29992;PRD&#26356;&#26032;&#35268;&#21017;&#65292;&#37027;&#20040;&#25972;&#20010;&#21160;&#24577;&#36807;&#31243;&#23558;&#20250;&#25910;&#25947;&#21040;&#24066;&#22330;&#30340;&#31454;&#20105;&#22343;&#34913;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#32447;&#24615;Fisher&#24066;&#22330;&#20013;&#30340;&#27604;&#20363;&#21709;&#24212;&#21160;&#21147;&#23398;&#65288;PRD&#65289;&#65292;&#20854;&#20013;&#21442;&#19982;&#32773;&#20197;&#24322;&#27493;&#30340;&#26041;&#24335;&#34892;&#21160;&#12290;&#25105;&#20204;&#23558;&#36825;&#20010;&#24773;&#26223;&#24314;&#27169;&#20026;&#19968;&#20010;&#39034;&#24207;&#36807;&#31243;&#65292;&#27599;&#19968;&#27493;&#20013;&#65292;&#23545;&#25163;&#36873;&#25321;&#19968;&#20010;&#23376;&#38598;&#30340;&#29609;&#23478;&#26469;&#26356;&#26032;&#20182;&#20204;&#30340;&#20986;&#20215;&#65292;&#21516;&#26102;&#28385;&#36275;&#27963;&#24615;&#32422;&#26463;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#22914;&#26524;&#27599;&#20010;&#25237;&#26631;&#20154;&#22312;&#34987;&#23545;&#25163;&#36873;&#25321;&#30340;&#25237;&#26631;&#20154;&#32452;&#20013;&#26102;&#37117;&#20010;&#21035;&#22320;&#20351;&#29992;PRD&#26356;&#26032;&#35268;&#21017;&#65292;&#37027;&#20040;&#65288;&#22312;&#19968;&#33324;&#24773;&#20917;&#19979;&#65289;&#25972;&#20010;&#21160;&#24577;&#36807;&#31243;&#23558;&#20250;&#25910;&#25947;&#21040;&#24066;&#22330;&#30340;&#31454;&#20105;&#22343;&#34913;&#12290;&#25105;&#20204;&#30340;&#35777;&#26126;&#26041;&#27861;&#36824;&#25581;&#31034;&#20102;&#32447;&#24615;Fisher&#24066;&#22330;&#30340;&#20854;&#20182;&#24615;&#36136;&#65292;&#27604;&#22914;&#22312;&#19968;&#33324;&#21442;&#25968;&#19979;&#22343;&#34913;&#30340;&#21807;&#19968;&#24615;&#20197;&#21450;&#22312;&#26576;&#20123;&#26465;&#20214;&#19979;&#30456;&#20851;&#26368;&#20339;&#21709;&#24212;&#21160;&#21147;&#23398;&#21644;&#26080;&#20132;&#25442;&#36951;&#25022;&#21160;&#21147;&#23398;&#30340;&#25910;&#25947;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study Proportional Response Dynamics (PRD) in linear Fisher markets where participants act asynchronously. We model this scenario as a sequential process in which in every step, an adversary selects a subset of the players that will update their bids, subject to liveness constraints. We show that if every bidder individually uses the PRD update rule whenever they are included in the group of bidders selected by the adversary, then (in the generic case) the entire dynamic converges to a competitive equilibrium of the market. Our proof technique uncovers further properties of linear Fisher markets, such as the uniqueness of the equilibrium for generic parameters and the convergence of associated best-response dynamics and no-swap regret dynamics under certain conditions.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#36890;&#36807;&#30740;&#31350;&#20195;&#29702;&#20154;&#23545;&#28216;&#25103;&#32467;&#26524;&#30340;&#21518;&#39564;&#20449;&#24565;&#65292;&#23545;&#32422;&#20943;&#24418;&#24335;&#25293;&#21334;&#36827;&#34892;&#20102;&#29305;&#24449;&#21270;&#65292;&#24471;&#21040;&#20102;&#22522;&#20110;&#20449;&#24565;&#30340;Border&#19981;&#31561;&#24335;&#30340;&#29305;&#24449;&#21270;&#21644;Aumann&#30340;&#21327;&#35758;&#23450;&#29702;&#30340;&#25512;&#24191;, &#24182;&#19988;&#36890;&#36807;&#36793;&#30028;&#20195;&#29702;&#20154;&#32852;&#21512;&#21518;&#39564;&#20449;&#24565;&#30340;&#30456;&#20851;&#24615;&#12290;</title><link>http://arxiv.org/abs/2307.04070</link><description>&lt;p&gt;
&#19968;&#31181;&#22522;&#20110;&#20449;&#24565;&#30340;&#32422;&#20943;&#24418;&#24335;&#25293;&#21334;&#30340;&#29305;&#24449;&#21270;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
A Belief-Based Characterization of Reduced-Form Auctions. (arXiv:2307.04070v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.04070
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#36890;&#36807;&#30740;&#31350;&#20195;&#29702;&#20154;&#23545;&#28216;&#25103;&#32467;&#26524;&#30340;&#21518;&#39564;&#20449;&#24565;&#65292;&#23545;&#32422;&#20943;&#24418;&#24335;&#25293;&#21334;&#36827;&#34892;&#20102;&#29305;&#24449;&#21270;&#65292;&#24471;&#21040;&#20102;&#22522;&#20110;&#20449;&#24565;&#30340;Border&#19981;&#31561;&#24335;&#30340;&#29305;&#24449;&#21270;&#21644;Aumann&#30340;&#21327;&#35758;&#23450;&#29702;&#30340;&#25512;&#24191;, &#24182;&#19988;&#36890;&#36807;&#36793;&#30028;&#20195;&#29702;&#20154;&#32852;&#21512;&#21518;&#39564;&#20449;&#24565;&#30340;&#30456;&#20851;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#25277;&#35937;&#24418;&#24335;&#20013;&#30340;&#26426;&#20250;&#28216;&#25103;&#65288;&#20363;&#22914;&#25169;&#20811;&#12289;&#39600;&#23376;&#12289;&#36187;&#39532;&#31561;&#65289;&#65292;&#20854;&#20013;&#20195;&#29702;&#20154;&#23545;&#28216;&#25103;&#32467;&#26524;&#30340;&#19968;&#38454;&#21518;&#39564;&#20449;&#24565;&#36215;&#30528;&#20316;&#29992;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#20197;&#19979;&#38382;&#39064;&#65306;&#23545;&#20110;&#20219;&#20309;&#20195;&#29702;&#20154;&#21518;&#39564;&#20449;&#24565;&#30340;&#37197;&#32622;&#65292;&#26159;&#21542;&#23384;&#22312;&#19968;&#20010;&#28216;&#25103;&#21487;&#20197;&#29983;&#25104;&#36825;&#20123;&#20449;&#24565;&#65311;&#25105;&#20204;&#23436;&#20840;&#25551;&#36848;&#20102;&#21487;&#20197;&#20174;&#36825;&#20123;&#28216;&#25103;&#20013;&#33719;&#24471;&#30340;&#25152;&#26377;&#21487;&#34892;&#30340;&#32852;&#21512;&#21518;&#39564;&#20449;&#24565;&#12290;&#36825;&#31181;&#25551;&#36848;&#20351;&#25105;&#20204;&#33021;&#22815;&#25214;&#21040;&#19968;&#31181;&#26032;&#30340;Border&#19981;&#31561;&#24335;&#30340;&#21464;&#20307;&#65288;Border, 1991&#65289;&#65292;&#25105;&#20204;&#31216;&#20043;&#20026;&#22522;&#20110;&#20449;&#24565;&#30340;Border&#19981;&#31561;&#24335;&#30340;&#29305;&#24449;&#21270;&#12290;&#23427;&#36824;&#23548;&#33268;&#20102;Aumann&#30340;&#21327;&#35758;&#23450;&#29702;&#30340;&#25512;&#24191;&#12290;&#25105;&#20204;&#35777;&#26126;&#36825;&#31181;&#29305;&#24615;&#32467;&#26524;&#22312;&#38480;&#21046;&#20195;&#29702;&#20154;&#32852;&#21512;&#21518;&#39564;&#20449;&#24565;&#30340;&#30456;&#20851;&#24615;&#26041;&#38754;&#38750;&#24120;&#24378;&#22823;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study games of chance (e.g., pokers, dices, horse races) in the form of agents' first-order posterior beliefs about game outcomes. We ask for any profile of agents' posterior beliefs, is there a game that can generate these beliefs? We completely characterize all feasible joint posterior beliefs from these games. The characterization enables us to find a new variant of Border's inequalities (Border, 1991), which we call a belief-based characterization of Border's inequalities. It also leads to a generalization of Aumann's Agreement Theorem. We show that the characterization results are powerful in bounding the correlation of agents' joint posterior beliefs.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#20110;&#21160;&#24577;&#23450;&#20215;&#21644;&#27719;&#32858;&#32593;&#32476;&#30340;&#24066;&#22330;&#35774;&#35745;&#65292;&#36890;&#36807;&#35774;&#32622;&#36793;&#32536;&#20215;&#26684;&#28608;&#21169;&#20195;&#29702;&#21830;&#20849;&#20139;&#26377;&#38480;&#32593;&#32476;&#23481;&#37327;&#12290;&#22312;&#32771;&#34385;&#20102;&#25972;&#25968;&#21644;&#32593;&#32476;&#32422;&#26463;&#20197;&#21450;&#20195;&#29702;&#21830;&#24322;&#36136;&#20559;&#22909;&#30340;&#24773;&#20917;&#19979;&#65292;&#25105;&#20204;&#25552;&#20379;&#20102;&#20805;&#20998;&#26465;&#20214;&#65292;&#20445;&#35777;&#24066;&#22330;&#22343;&#34913;&#30340;&#23384;&#22312;&#21644;&#22810;&#39033;&#24335;&#26102;&#38388;&#35745;&#31639;&#65292;&#24182;&#35782;&#21035;&#20102;&#23454;&#29616;&#26368;&#22823;&#25928;&#29992;&#30340;&#29305;&#23450;&#24066;&#22330;&#22343;&#34913;&#12290;</title><link>http://arxiv.org/abs/2307.03994</link><description>&lt;p&gt;
&#21160;&#24577;&#23450;&#20215;&#21644;&#27719;&#32858;&#32593;&#32476;&#30340;&#24066;&#22330;&#35774;&#35745;
&lt;/p&gt;
&lt;p&gt;
Market Design for Dynamic Pricing and Pooling in Capacitated Networks. (arXiv:2307.03994v1 [cs.GT])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.03994
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#20110;&#21160;&#24577;&#23450;&#20215;&#21644;&#27719;&#32858;&#32593;&#32476;&#30340;&#24066;&#22330;&#35774;&#35745;&#65292;&#36890;&#36807;&#35774;&#32622;&#36793;&#32536;&#20215;&#26684;&#28608;&#21169;&#20195;&#29702;&#21830;&#20849;&#20139;&#26377;&#38480;&#32593;&#32476;&#23481;&#37327;&#12290;&#22312;&#32771;&#34385;&#20102;&#25972;&#25968;&#21644;&#32593;&#32476;&#32422;&#26463;&#20197;&#21450;&#20195;&#29702;&#21830;&#24322;&#36136;&#20559;&#22909;&#30340;&#24773;&#20917;&#19979;&#65292;&#25105;&#20204;&#25552;&#20379;&#20102;&#20805;&#20998;&#26465;&#20214;&#65292;&#20445;&#35777;&#24066;&#22330;&#22343;&#34913;&#30340;&#23384;&#22312;&#21644;&#22810;&#39033;&#24335;&#26102;&#38388;&#35745;&#31639;&#65292;&#24182;&#35782;&#21035;&#20102;&#23454;&#29616;&#26368;&#22823;&#25928;&#29992;&#30340;&#29305;&#23450;&#24066;&#22330;&#22343;&#34913;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#19968;&#31181;&#24066;&#22330;&#26426;&#21046;&#65292;&#36890;&#36807;&#35774;&#32622;&#36793;&#32536;&#20215;&#26684;&#26469;&#28608;&#21169;&#25112;&#30053;&#24615;&#20195;&#29702;&#21830;&#32452;&#32455;&#26053;&#34892;&#65292;&#20197;&#26377;&#25928;&#20849;&#20139;&#26377;&#38480;&#30340;&#32593;&#32476;&#23481;&#37327;&#12290;&#35813;&#24066;&#22330;&#20801;&#35768;&#20195;&#29702;&#21830;&#32452;&#25104;&#22242;&#38431;&#20849;&#20139;&#26053;&#34892;&#65292;&#20570;&#20986;&#20986;&#21457;&#26102;&#38388;&#21644;&#36335;&#32447;&#36873;&#25321;&#30340;&#20915;&#31574;&#65292;&#24182;&#25903;&#20184;&#36793;&#32536;&#20215;&#26684;&#21644;&#20854;&#20182;&#25104;&#26412;&#12290;&#25105;&#20204;&#21457;&#23637;&#20102;&#19968;&#31181;&#26032;&#30340;&#26041;&#27861;&#26469;&#20998;&#26512;&#24066;&#22330;&#22343;&#34913;&#30340;&#23384;&#22312;&#21644;&#35745;&#31639;&#65292;&#24314;&#31435;&#22312;&#32452;&#21512;&#25293;&#21334;&#21644;&#21160;&#24577;&#32593;&#32476;&#27969;&#29702;&#35770;&#30340;&#22522;&#30784;&#19978;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#35299;&#20915;&#20102;&#24066;&#22330;&#22343;&#34913;&#29305;&#24449;&#21270;&#20013;&#30340;&#25361;&#25112;&#65292;&#21253;&#25324;&#65306;&#65288;a&#65289;&#20849;&#20139;&#26377;&#38480;&#36793;&#32536;&#23481;&#37327;&#20013;&#26053;&#34892;&#30340;&#21160;&#24577;&#27969;&#37327;&#25152;&#24341;&#21457;&#30340;&#25972;&#25968;&#21644;&#32593;&#32476;&#32422;&#26463;&#65307;&#65288;b&#65289;&#25112;&#30053;&#24615;&#20195;&#29702;&#21830;&#30340;&#24322;&#36136;&#21644;&#31169;&#20154;&#20559;&#22909;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#20851;&#20110;&#32593;&#32476;&#25299;&#25169;&#21644;&#20195;&#29702;&#21830;&#20559;&#22909;&#30340;&#20805;&#20998;&#26465;&#20214;&#65292;&#20197;&#30830;&#20445;&#24066;&#22330;&#22343;&#34913;&#30340;&#23384;&#22312;&#21644;&#22810;&#39033;&#24335;&#26102;&#38388;&#35745;&#31639;&#12290;&#25105;&#20204;&#30830;&#23450;&#20102;&#19968;&#20010;&#29305;&#23450;&#30340;&#24066;&#22330;&#22343;&#34913;&#65292;&#23454;&#29616;&#20102;&#25152;&#26377;&#20195;&#29702;&#21830;&#30340;&#26368;&#22823;&#25928;&#29992;&#65292;&#24182;&#19988;&#19982;&#32463;&#20856;&#30340;&#26368;&#22823;&#27969;&#26368;&#23567;&#21106;&#38382;&#39064;&#31561;&#20215;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study a market mechanism that sets edge prices to incentivize strategic agents to organize trips that efficiently share limited network capacity. This market allows agents to form groups to share trips, make decisions on departure times and route choices, and make payments to cover edge prices and other costs. We develop a new approach to analyze the existence and computation of market equilibrium, building on theories of combinatorial auctions and dynamic network flows. Our approach tackles the challenges in market equilibrium characterization arising from: (a) integer and network constraints on the dynamic flow of trips in sharing limited edge capacity; (b) heterogeneous and private preferences of strategic agents. We provide sufficient conditions on the network topology and agents' preferences that ensure the existence and polynomial-time computation of market equilibrium. We identify a particular market equilibrium that achieves maximum utilities for all agents, and is equivalen
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#36890;&#36807;&#30740;&#31350;&#19977;&#22823;&#27773;&#36710;&#21046;&#36896;&#21830;&#22312;&#20840;&#29699;&#19981;&#21516;&#22320;&#21306;&#30340;&#30005;&#21160;&#21270;&#20135;&#21697;&#31995;&#21015;&#36873;&#25321;&#65292;&#21457;&#29616;&#21306;&#22495;&#38388;&#23384;&#22312;&#36710;&#22411;&#20559;&#22909;&#24046;&#24322;&#65292;&#24182;&#19988;&#29305;&#26031;&#25289;&#22312;BEV&#24066;&#22330;&#30340;&#20027;&#23548;&#22320;&#20301;&#24433;&#21709;&#20102;&#30005;&#27744;&#21270;&#23398;&#30340;&#36873;&#25321;&#12290;</title><link>http://arxiv.org/abs/2307.03808</link><description>&lt;p&gt;
&#30005;&#21160;&#36731;&#22411;&#36710;&#36742;&#21046;&#36896;&#21830;&#30340;&#21306;&#22495;&#24615;&#20998;&#26512;
&lt;/p&gt;
&lt;p&gt;
A Regional Analysis of Electric LDV Portfolio Choices by Vehicle Manufacturers. (arXiv:2307.03808v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.03808
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36890;&#36807;&#30740;&#31350;&#19977;&#22823;&#27773;&#36710;&#21046;&#36896;&#21830;&#22312;&#20840;&#29699;&#19981;&#21516;&#22320;&#21306;&#30340;&#30005;&#21160;&#21270;&#20135;&#21697;&#31995;&#21015;&#36873;&#25321;&#65292;&#21457;&#29616;&#21306;&#22495;&#38388;&#23384;&#22312;&#36710;&#22411;&#20559;&#22909;&#24046;&#24322;&#65292;&#24182;&#19988;&#29305;&#26031;&#25289;&#22312;BEV&#24066;&#22330;&#30340;&#20027;&#23548;&#22320;&#20301;&#24433;&#21709;&#20102;&#30005;&#27744;&#21270;&#23398;&#30340;&#36873;&#25321;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
2022&#24180;&#65292;&#20840;&#29699;&#36731;&#22411;&#30005;&#21160;&#36710;&#38144;&#37327;&#36229;&#36807;1050&#19975;&#36742;&#65292;&#21516;&#27604;&#22686;&#38271;55&#65285;&#65292;&#20294;&#36825;&#20123;&#36235;&#21183;&#22312;&#19981;&#21516;&#22320;&#21306;&#26377;&#25152;&#19981;&#21516;&#12290;&#23613;&#31649;&#38144;&#37327;&#22686;&#38271;&#24378;&#21170;&#65292;&#20294;&#21069;&#26399;&#36141;&#20080;&#20215;&#26684;&#20173;&#28982;&#26159;&#28040;&#36153;&#32773;&#38754;&#20020;&#30340;&#25361;&#25112;&#65292;&#22240;&#27492;&#27773;&#36710;&#21046;&#36896;&#21830;&#20250;&#20570;&#20986;&#25216;&#26415;&#36873;&#25321;&#20197;&#28385;&#36275;&#24066;&#22330;&#38656;&#27714;&#12290;&#26412;&#25991;&#30740;&#31350;&#20102;&#19977;&#22823;&#27773;&#36710;&#21046;&#36896;&#21830;&#22312;&#27431;&#27954;&#12289;&#32654;&#27954;&#12289;&#20122;&#22826;&#22320;&#21306;&#21644;&#38750;&#27954;/&#20013;&#19996;&#22320;&#21306;&#19981;&#21516;&#22320;&#21306;&#30340;&#30005;&#21160;&#21270;&#20135;&#21697;&#31995;&#21015;&#36873;&#25321;&#12290;&#20998;&#26512;&#37325;&#28857;&#20851;&#27880;&#30005;&#27744;&#30005;&#21160;&#36710;&#65288;BEV&#65289;&#21644;&#25554;&#30005;&#28151;&#21512;&#21160;&#21147;&#36710;&#65288;PHEV&#65289;&#30340;&#20027;&#23548;&#24066;&#22330;&#36235;&#21183;&#65292;&#20197;&#21450;&#30005;&#27744;&#21270;&#23398;&#36873;&#25321;&#12290;&#21306;&#22495;&#24046;&#24322;&#34920;&#26126;SUV&#25104;&#20026;BEV&#21644;PHEV&#30340;&#20027;&#27969;&#36235;&#21183;&#12290;&#29305;&#26031;&#25289;&#22312;BEV&#24066;&#22330;&#30340;&#20027;&#23548;&#22320;&#20301;&#24433;&#21709;&#30528;&#30005;&#27744;&#21270;&#23398;&#36873;&#25321;&#12290;&#22312;&#27431;&#27954;&#21644;&#32654;&#27954;&#65292;BEV&#30340;&#24179;&#22343;&#30005;&#27744;&#23481;&#37327;&#20445;&#25345;&#30456;&#20284;&#65292;&#32780;&#22312;&#20122;&#22826;&#22320;&#21306;&#21644;&#38750;&#27954;/&#20013;&#19996;&#22320;&#21306;&#36739;&#20302;&#12290;
&lt;/p&gt;
&lt;p&gt;
Global light duty electric vehicle (EV) sales exceeded 10.5 million units in 2022, with a year-on-year growth of 55%, but these trends differ regionally. Despite the robust growth, upfront purchase price remains a challenge for consumers in different regions, and thus, OEMs make technology choices to respond to market needs. This paper examines the electrification portfolio choices of three major automotive manufacturers (OEMs) in different regions of the world, including Europe, Americas, Asia Pacific, and Africa/Middle-East. The analysis focuses on trends in dominant segments for Battery Electric Vehicles (BEV) and Plug-in Hybrid Electric Vehicles (PHEV), as well as battery chemistry choices. Regional differences show a trend towards SUVs for both BEVs and PHEVs. Tesla's dominance in the BEV market influences battery chemistry choices. Average battery sizes for BEVs remain similar in Europe and Americas, but lower in Asia Pacific and Africa/Middle East.
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#24191;&#20041;&#21270;&#20102;&#21327;&#26041;&#24046;&#30340;&#27010;&#24565;&#65292;&#24182;&#29992;&#20854;&#20182;&#32479;&#35745;&#20989;&#25968;&#26367;&#20195;&#20102;&#22343;&#20540;&#65292;&#26500;&#36896;&#20102;&#24191;&#20041;&#30456;&#20851;&#24615;&#26469;&#34913;&#37327;&#38543;&#26426;&#21464;&#37327;&#20043;&#38388;&#30340;&#20381;&#36182;&#20851;&#31995;&#12290;&#36825;&#20123;&#26032;&#30340;&#20381;&#36182;&#24230;&#37327;&#20855;&#26377;&#26377;&#21033;&#30340;&#29305;&#24615;&#65292;&#21487;&#20197;&#29992;&#20110;&#26174;&#31034;&#25972;&#20010;&#20381;&#36182;&#32467;&#26500;&#65292;&#24182;&#19988;&#21487;&#20197;&#21462;&#20195;&#20256;&#32479;&#30340;&#23614;&#37096;&#20381;&#36182;&#31995;&#25968;&#12290;</title><link>http://arxiv.org/abs/2307.03594</link><description>&lt;p&gt;
&#24191;&#20041;&#21327;&#26041;&#24046;&#21644;&#30456;&#20851;&#24615;
&lt;/p&gt;
&lt;p&gt;
Generalised Covariances and Correlations. (arXiv:2307.03594v1 [stat.ME] CROSS LISTED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.03594
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#24191;&#20041;&#21270;&#20102;&#21327;&#26041;&#24046;&#30340;&#27010;&#24565;&#65292;&#24182;&#29992;&#20854;&#20182;&#32479;&#35745;&#20989;&#25968;&#26367;&#20195;&#20102;&#22343;&#20540;&#65292;&#26500;&#36896;&#20102;&#24191;&#20041;&#30456;&#20851;&#24615;&#26469;&#34913;&#37327;&#38543;&#26426;&#21464;&#37327;&#20043;&#38388;&#30340;&#20381;&#36182;&#20851;&#31995;&#12290;&#36825;&#20123;&#26032;&#30340;&#20381;&#36182;&#24230;&#37327;&#20855;&#26377;&#26377;&#21033;&#30340;&#29305;&#24615;&#65292;&#21487;&#20197;&#29992;&#20110;&#26174;&#31034;&#25972;&#20010;&#20381;&#36182;&#32467;&#26500;&#65292;&#24182;&#19988;&#21487;&#20197;&#21462;&#20195;&#20256;&#32479;&#30340;&#23614;&#37096;&#20381;&#36182;&#31995;&#25968;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20004;&#20010;&#38543;&#26426;&#21464;&#37327;&#30340;&#21327;&#26041;&#24046;&#34913;&#37327;&#23427;&#20204;&#30456;&#23545;&#20110;&#21508;&#33258;&#22343;&#20540;&#30340;&#32852;&#21512;&#20559;&#24046;&#30340;&#24179;&#22343;&#20540;&#12290;&#25105;&#20204;&#36890;&#36807;&#29992;&#20854;&#20182;&#32479;&#35745;&#20989;&#25968;&#65288;&#22914;&#20998;&#20301;&#25968;&#12289;&#26399;&#26395;&#37327;&#12289;&#25110;&#38408;&#20540;&#65289;&#26367;&#20195;&#22343;&#20540;&#26469;&#25512;&#24191;&#36825;&#20010;&#20247;&#25152;&#21608;&#30693;&#30340;&#24230;&#37327;&#12290;&#36825;&#20123;&#20989;&#25968;&#30340;&#20559;&#24046;&#36890;&#36807;&#24191;&#20041;&#35823;&#24046;&#23450;&#20041;&#65292;&#36890;&#24120;&#30001;&#35782;&#21035;&#25110;&#30697;&#20989;&#25968;&#24341;&#21457;&#12290;&#20316;&#20026;&#19968;&#31181;&#24402;&#19968;&#21270;&#30340;&#20381;&#36182;&#24230;&#37327;&#65292;&#25105;&#20204;&#26500;&#36896;&#20102;&#24191;&#20041;&#30456;&#20851;&#24615;&#12290;&#36890;&#36807;&#29992;&#19968;&#31181;&#26032;&#39062;&#30340;Fr\'echet-Hoeffding&#24402;&#19968;&#21270;&#26367;&#20195;&#24120;&#35265;&#30340;Cauchy-Schwarz&#24402;&#19968;&#21270;&#65292;&#25105;&#20204;&#33719;&#24471;&#20102;&#23545;&#20110;&#20219;&#20309;&#32473;&#23450;&#36793;&#32536;&#20998;&#24067;&#65292;&#25972;&#20010;&#21306;&#38388;$[-1, 1]$&#30340;&#21487;&#36798;&#24615;&#12290;&#25105;&#20204;&#21457;&#29616;&#20102;&#36825;&#20123;&#26032;&#30340;&#20381;&#36182;&#24230;&#37327;&#30340;&#26377;&#21033;&#29305;&#24615;&#12290;&#20998;&#20301;&#25968;&#21644;&#38408;&#20540;&#30456;&#20851;&#24615;&#30340;&#23478;&#26063;&#20135;&#29983;&#20102;&#20989;&#25968;&#20540;&#20998;&#24067;&#30456;&#20851;&#24615;&#65292;&#26174;&#31034;&#20102;&#25972;&#20010;&#20381;&#36182;&#32467;&#26500;&#12290;&#23427;&#20204;&#23548;&#33268;&#20102;&#23614;&#37096;&#30456;&#20851;&#24615;&#65292;&#36825;&#21487;&#33021;&#24212;&#35813;&#21462;&#20195;&#23614;&#37096;&#20381;&#36182;&#31995;&#25968;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#26500;&#36896;&#20102;&#25688;&#35201;&#21327;&#26041;&#24046;&#65288;corre&#65289;
&lt;/p&gt;
&lt;p&gt;
The covariance of two random variables measures the average joint deviations from their respective means. We generalise this well-known measure by replacing the means with other statistical functionals such as quantiles, expectiles, or thresholds. Deviations from these functionals are defined via generalised errors, often induced by identification or moment functions. As a normalised measure of dependence, a generalised correlation is constructed. Replacing the common Cauchy-Schwarz normalisation by a novel Fr\'echet-Hoeffding normalisation, we obtain attainability of the entire interval $[-1, 1]$ for any given marginals. We uncover favourable properties of these new dependence measures. The families of quantile and threshold correlations give rise to function-valued distributional correlations, exhibiting the entire dependence structure. They lead to tail correlations, which should arguably supersede the coefficients of tail dependence. Finally, we construct summary covariances (corre
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#20171;&#32461;&#20102;&#19968;&#31181;&#33258;&#21160;&#21270;&#24066;&#22330;&#21046;&#36896;&#21830;&#65288;AMM&#65289;&#30340;&#35774;&#35745;&#21709;&#24212;&#8212;&#8212;&#20351;&#29992;&#25209;&#37327;&#20132;&#26131;&#12290;&#36890;&#36807;&#25209;&#37327;&#20132;&#26131;&#20197;&#36793;&#38469;&#20215;&#26684;&#36827;&#34892;&#20132;&#26131;&#65292;&#20351;&#24471;AMM&#33021;&#22815;&#26368;&#22823;&#21270;&#20854;&#21151;&#33021;&#65292;&#24182;&#28040;&#38500;&#22871;&#21033;&#21033;&#28070;&#21644;&#22841;&#24515;&#25915;&#20987;&#30340;&#38382;&#39064;&#12290;&#30740;&#31350;&#20351;&#29992;&#24065;&#23433;&#20215;&#26684;&#25968;&#25454;&#36827;&#34892;&#27169;&#25311;&#65292;&#32467;&#26524;&#26174;&#31034;&#65292;&#25552;&#20379;&#27969;&#21160;&#24615;&#32473;AMM&#30340;&#25910;&#30410;&#19979;&#38480;&#19982;&#22312;Uniswap v3&#19978;&#25552;&#20379;&#27969;&#21160;&#24615;&#30340;&#23454;&#38469;&#25910;&#30410;&#38750;&#24120;&#25509;&#36817;&#12290;</title><link>http://arxiv.org/abs/2307.02074</link><description>&lt;p&gt;
&#31639;&#27861;&#20132;&#26131;&#21592;&#30340;&#21033;&#28070;&#12289;LVR&#21644;&#22841;&#24515;&#25915;&#20987;&#65306;&#25209;&#37327;&#20132;&#26131;&#20316;&#20026;AMM&#35774;&#35745;&#30340;&#21709;&#24212;
&lt;/p&gt;
&lt;p&gt;
Arbitrageurs' profits, LVR, and sandwich attacks: batch trading as an AMM design response. (arXiv:2307.02074v1 [cs.DC])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.02074
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#20171;&#32461;&#20102;&#19968;&#31181;&#33258;&#21160;&#21270;&#24066;&#22330;&#21046;&#36896;&#21830;&#65288;AMM&#65289;&#30340;&#35774;&#35745;&#21709;&#24212;&#8212;&#8212;&#20351;&#29992;&#25209;&#37327;&#20132;&#26131;&#12290;&#36890;&#36807;&#25209;&#37327;&#20132;&#26131;&#20197;&#36793;&#38469;&#20215;&#26684;&#36827;&#34892;&#20132;&#26131;&#65292;&#20351;&#24471;AMM&#33021;&#22815;&#26368;&#22823;&#21270;&#20854;&#21151;&#33021;&#65292;&#24182;&#28040;&#38500;&#22871;&#21033;&#21033;&#28070;&#21644;&#22841;&#24515;&#25915;&#20987;&#30340;&#38382;&#39064;&#12290;&#30740;&#31350;&#20351;&#29992;&#24065;&#23433;&#20215;&#26684;&#25968;&#25454;&#36827;&#34892;&#27169;&#25311;&#65292;&#32467;&#26524;&#26174;&#31034;&#65292;&#25552;&#20379;&#27969;&#21160;&#24615;&#32473;AMM&#30340;&#25910;&#30410;&#19979;&#38480;&#19982;&#22312;Uniswap v3&#19978;&#25552;&#20379;&#27969;&#21160;&#24615;&#30340;&#23454;&#38469;&#25910;&#30410;&#38750;&#24120;&#25509;&#36817;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#32771;&#34385;&#20102;&#19968;&#31181;&#33258;&#21160;&#21270;&#24066;&#22330;&#21046;&#36896;&#21830;&#65288;AMM&#65289;&#65292;&#20854;&#20013;&#25152;&#26377;&#20132;&#26131;&#37117;&#20197;&#25209;&#37327;&#26041;&#24335;&#25191;&#34892;&#65292;&#24182;&#22312;&#25209;&#37327;&#20132;&#26131;&#21518;&#20197;&#36793;&#38469;&#20215;&#26684;&#65288;&#21363;&#20219;&#24847;&#23567;&#39069;&#20132;&#26131;&#30340;&#20215;&#26684;&#65289;&#36827;&#34892;&#20132;&#26131;&#12290;&#25105;&#20204;&#34920;&#26126;&#65292;&#36825;&#31181;AMM&#26159;&#26368;&#22823;&#21270;AMM&#21151;&#33021;&#65288;&#25110;FM-AMM&#65289;&#30340;&#20989;&#25968;&#65306;&#23545;&#20110;&#32473;&#23450;&#30340;&#20215;&#26684;&#65292;&#23427;&#20132;&#26131;&#20197;&#36798;&#21040;&#32473;&#23450;&#20989;&#25968;&#30340;&#26368;&#39640;&#21487;&#33021;&#20215;&#20540;&#12290;&#27492;&#22806;&#65292;&#31639;&#27861;&#20132;&#26131;&#21592;&#20043;&#38388;&#30340;&#31454;&#20105;&#20445;&#35777;&#20102;FM-AMM&#22987;&#32456;&#20197;&#20844;&#24179;&#12289;&#22343;&#34913;&#30340;&#20215;&#26684;&#36827;&#34892;&#20132;&#26131;&#65292;&#24182;&#28040;&#38500;&#20102;&#22871;&#21033;&#21033;&#28070;&#65288;&#20063;&#31216;&#20026;LVR&#65289;&#12290;&#22841;&#24515;&#25915;&#20987;&#20063;&#34987;&#28040;&#38500;&#65292;&#22240;&#20026;&#25152;&#26377;&#20132;&#26131;&#21457;&#29983;&#22312;&#22806;&#29983;&#30830;&#23450;&#30340;&#22343;&#34913;&#20215;&#26684;&#19978;&#12290;&#25105;&#20204;&#20351;&#29992;&#24065;&#23433;&#20215;&#26684;&#25968;&#25454;&#27169;&#25311;&#25552;&#20379;&#27969;&#21160;&#24615;&#32473;FM-AMM&#30340;&#25910;&#30410;&#19979;&#38480;&#65292;&#24182;&#34920;&#26126;&#65292;&#33267;&#23569;&#23545;&#20110;&#25105;&#20204;&#32771;&#34385;&#30340;&#20195;&#24065;&#23545;&#21644;&#26102;&#38388;&#27573;&#26469;&#35828;&#65292;&#36825;&#31181;&#19979;&#38480;&#38750;&#24120;&#25509;&#36817;&#22312;Uniswap v3&#19978;&#25552;&#20379;&#27969;&#21160;&#24615;&#30340;&#23454;&#35777;&#25910;&#30410;&#12290;
&lt;/p&gt;
&lt;p&gt;
We consider an automated market maker (AMM) in which all trades are batched and executed at a price equal to the marginal price (i.e., the price of an arbitrary small trade) after the batch trades. We show that such an AMM is a function maximizing AMM (or FM-AMM): for given prices, it trades to reach the highest possible value of a given function. Also, competition between arbitrageurs guarantees that an FM-AMM always trades at a fair, equilibrium price, and arbitrage profits (also known as LVR) are eliminated. Sandwich attacks are also eliminated because all trades occur at the exogenously-determined equilibrium price. We use Binance price data to simulate a lower bound to the return of providing liquidity to an FM-AMM and show that, at least for the token pairs and the period we consider, such lower bound is very close to the empirical returns of providing liquidity on Uniswap v3.
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#20855;&#26377;&#36830;&#32493;&#29366;&#24577;&#21644;&#31163;&#25955;&#20449;&#21495;&#31354;&#38388;&#30340;&#20449;&#24687;&#35774;&#35745;&#38382;&#39064;&#65292;&#22312;&#20984;&#20215;&#20540;&#20989;&#25968;&#19979;&#65292;&#26368;&#20248;&#20449;&#24687;&#32467;&#26500;&#26159;&#21306;&#38388;&#20998;&#27573;&#30340;&#65292;&#21516;&#26102;&#22312;&#23545;&#25968;&#20984;&#29615;&#22659;&#20013;&#65292;&#20449;&#24687;&#20250;&#21464;&#24471;&#26356;&#21152;&#31895;&#31961;&#12290;</title><link>http://arxiv.org/abs/2305.18020</link><description>&lt;p&gt;
&#31895;&#31961;&#30340;&#20449;&#24687;&#35774;&#35745;
&lt;/p&gt;
&lt;p&gt;
Coarse Information Design. (arXiv:2305.18020v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.18020
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#20855;&#26377;&#36830;&#32493;&#29366;&#24577;&#21644;&#31163;&#25955;&#20449;&#21495;&#31354;&#38388;&#30340;&#20449;&#24687;&#35774;&#35745;&#38382;&#39064;&#65292;&#22312;&#20984;&#20215;&#20540;&#20989;&#25968;&#19979;&#65292;&#26368;&#20248;&#20449;&#24687;&#32467;&#26500;&#26159;&#21306;&#38388;&#20998;&#27573;&#30340;&#65292;&#21516;&#26102;&#22312;&#23545;&#25968;&#20984;&#29615;&#22659;&#20013;&#65292;&#20449;&#24687;&#20250;&#21464;&#24471;&#26356;&#21152;&#31895;&#31961;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#19968;&#20010;&#20855;&#26377;&#36830;&#32493;&#29366;&#24577;&#21644;&#31163;&#25955;&#20449;&#21495;&#31354;&#38388;&#30340;&#20449;&#24687;&#35774;&#35745;&#38382;&#39064;&#12290;&#25105;&#20204;&#21457;&#29616;&#35774;&#35745;&#32773;&#30340;&#20013;&#38388;&#20215;&#20540;&#20989;&#25968;&#20165;&#36890;&#36807;&#20854;&#26354;&#29575;&#24433;&#21709;&#35299;&#20915;&#26041;&#26696;&#12290;&#20808;&#39564;&#20998;&#24067;&#19982;&#36793;&#38469;&#20215;&#20540;&#20989;&#25968;&#20043;&#38388;&#23384;&#22312;&#23545;&#20598;&#20851;&#31995;&#12290;&#22312;&#20984;&#20215;&#20540;&#20989;&#25968;&#19979;&#65292;&#26368;&#20248;&#20449;&#24687;&#32467;&#26500;&#26159;&#21306;&#38388;&#20998;&#27573;&#30340;&#12290;&#27492;&#22806;&#65292;&#22312;&#23545;&#25968;&#20984;&#29615;&#22659;&#20013;&#65292;&#19968;&#20010;&#23457;&#26597;&#20013;&#24515;&#23558;&#20986;&#29616;&#24182;&#19988;&#23545;&#20110;&#36828;&#31163;&#23427;&#30340;&#29366;&#24577;&#65292;&#20449;&#24687;&#21464;&#24471;&#26356;&#31895;&#31961;&#12290;&#25105;&#20204;&#30830;&#23450;&#20102;&#23457;&#26597;&#20013;&#24515;&#24182;&#25552;&#20379;&#20102;&#23545;&#20110;&#20808;&#39564;&#20998;&#24067;&#21644;&#20215;&#20540;&#20989;&#25968;&#26469;&#35828;&#20449;&#24687;&#32467;&#26500;&#30340;&#27604;&#36739;&#38745;&#24577;&#20998;&#26512;&#12290;&#35813;&#20998;&#26512;&#21487;&#25193;&#23637;&#21040;S&#24418;&#20215;&#20540;&#20989;&#25968;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study an information design problem with continuous state and discrete signal space. We find that the designer's interim value function affects the solution only through its curvature. There is a dual relation between the prior distribution and the marginal value function. Under convex value functions, the optimal information structure is interval-partitional. Moreover, in logconcave environments, a center of scrutiny emerges and information becomes coarser for states farther from it. We locate the scrutiny center and provide comparative statics on information structure with respect to prior distributions and value functions. The analysis can be extended to S-shaped value functions.
&lt;/p&gt;</description></item><item><title>&#35813;&#30740;&#31350;&#20998;&#26512;&#20102;&#21152;&#25343;&#22823;&#24378;&#21046;&#23454;&#26045;&#23478;&#24237;&#21307;&#23398;&#20303;&#38498;&#21307;&#24072;&#35268;&#23450;&#30340;&#24433;&#21709;&#65292;&#21457;&#29616;&#24310;&#38271;&#20303;&#38498;&#21307;&#24072;&#22521;&#35757;&#26102;&#38388;&#21487;&#33021;&#23548;&#33268;&#23478;&#24237;&#21307;&#23398;&#20174;&#19994;&#32773;&#20379;&#24212;&#19979;&#38477;5%-10%&#12290;</title><link>http://arxiv.org/abs/2303.14232</link><description>&lt;p&gt;
&#24310;&#38271;&#20303;&#38498;&#21307;&#24072;&#35268;&#23450;&#23545;&#23478;&#24237;&#21307;&#23398;&#20174;&#19994;&#32773;&#20379;&#24212;&#30340;&#24433;&#21709;&#65306;&#21152;&#25343;&#22823;&#24378;&#21046;&#23454;&#26045;&#23478;&#24237;&#21307;&#23398;&#20303;&#38498;&#21307;&#24072;&#35268;&#23450;&#24046;&#24322;&#24615;&#20998;&#26512;
&lt;/p&gt;
&lt;p&gt;
Effects of extending residencies on the supply of family medicine practitioners; difference-in-differences evidence from the implementation of mandatory family medicine residencies in Canada. (arXiv:2303.14232v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.14232
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#20998;&#26512;&#20102;&#21152;&#25343;&#22823;&#24378;&#21046;&#23454;&#26045;&#23478;&#24237;&#21307;&#23398;&#20303;&#38498;&#21307;&#24072;&#35268;&#23450;&#30340;&#24433;&#21709;&#65292;&#21457;&#29616;&#24310;&#38271;&#20303;&#38498;&#21307;&#24072;&#22521;&#35757;&#26102;&#38388;&#21487;&#33021;&#23548;&#33268;&#23478;&#24237;&#21307;&#23398;&#20174;&#19994;&#32773;&#20379;&#24212;&#19979;&#38477;5%-10%&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#32972;&#26223;&#65306;&#24403;&#21069;&#65292;&#21253;&#25324;&#32654;&#22269;&#21644;&#21152;&#25343;&#22823;&#22312;&#20869;&#30340;&#19968;&#20123;&#22269;&#23478;&#26377;&#20852;&#36259;&#24310;&#38271;&#21307;&#23398;&#20303;&#38498;&#21307;&#24072;&#22521;&#35757;&#26102;&#38388;&#12290;&#30446;&#21069;&#20851;&#20110;&#24310;&#38271;&#20303;&#38498;&#21307;&#24072;&#22521;&#35757;&#26102;&#38388;&#23545;&#21021;&#32423;&#21307;&#30103;&#20445;&#20581;&#20174;&#19994;&#32773;&#20379;&#24212;&#30340;&#24433;&#21709;&#36824;&#32570;&#20047;&#35777;&#25454;&#12290;&#26041;&#27861;&#65306;&#35813;&#30740;&#31350;&#21033;&#29992;&#21152;&#25343;&#22823;1976&#24180;&#33267;1994&#24180;&#24378;&#21046;&#23454;&#26045;&#30340;&#19968;&#39033;&#23478;&#24237;&#21307;&#23398;&#20303;&#38498;&#21307;&#24072;&#35268;&#23450;&#65292;&#23545;&#30465;&#20221;&#19982;&#30465;&#20221;&#20043;&#38388;&#30340;&#23454;&#26045;&#24773;&#20917;&#36827;&#34892;&#23545;&#27604;&#30740;&#31350;&#65292;&#23545;&#23478;&#24237;&#21307;&#23398;&#20174;&#19994;&#32773;&#19982;&#20854;&#20182;&#26080;&#21464;&#21270;&#30340;&#21307;&#30103;&#20154;&#21592;&#36827;&#34892;&#27604;&#36739;&#12290;&#21033;&#29992;&#24180;&#24230;&#21307;&#30103;&#20379;&#24212;&#25968;&#25454;&#36827;&#34892;&#24046;&#24322;&#24615;&#20272;&#35745;&#31574;&#30053;&#12290;&#32467;&#26524;&#65306;&#23454;&#26045;&#20303;&#38498;&#21307;&#24072;&#35268;&#23450;&#21518;&#65292;&#23478;&#24237;&#21307;&#23398;&#20174;&#19994;&#32773;&#30340;&#20379;&#24212;&#37327;&#20943;&#23569;&#20102;5%-10%&#12290;
&lt;/p&gt;
&lt;p&gt;
Background: There is currently interest in extending medical residency training in several countries including the United States and Canada. There is little evidence on what impacts extending medical residency has on supply of primary care practitioners.  Methods: I leverage the province-by-province roll-out of mandatory family medicine residencies in Canada from 1976 to 1994. This mandated that practitioners had to complete a two year residency instead of a one year internship. I use annual Canadian Institute of Health Information data on supply of physicians by specialty and province. I employ a difference-in-differences estimation strategy comparing specialties impacted by the legislation to those that had no change in their residency length (first difference). I compare before and after legislation by province (second difference).  Results: I find reductions in the supply of family medicine practitioners in the range of 5-10% of overall supply after implementation of a longer resid
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20379;&#20102;&#19968;&#20010;&#22522;&#26412;&#29702;&#35770;&#65292;&#30740;&#31350;&#20102;&#24102;&#26377;&#39640;&#38454;&#20449;&#24687;&#30340;&#26399;&#26435;&#24066;&#22330;&#20013;&#20215;&#26684;&#30340;&#21457;&#29616;&#26426;&#21046;&#12290;&#19982;&#27492;&#21516;&#26102;&#65292;&#35813;&#30740;&#31350;&#36824;&#20197;&#20869;&#24149;&#20132;&#26131;&#30340;&#24418;&#24335;&#21576;&#29616;&#20102;&#20854;&#20013;&#30340;&#29305;&#20363;&#65292;&#32473;&#20986;&#20102;&#36890;&#36135;&#33192;&#32960;&#38656;&#27714;&#12289;&#20215;&#26684;&#20914;&#20987;&#21644;&#20449;&#24687;&#25928;&#29575;&#30340;&#38381;&#24335;&#35299;&#12290;</title><link>http://arxiv.org/abs/2302.13426</link><description>&lt;p&gt;
&#26399;&#26435;&#30340;&#20215;&#26684;&#21457;&#29616;
&lt;/p&gt;
&lt;p&gt;
Price Discovery for Derivatives. (arXiv:2302.13426v5 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2302.13426
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20379;&#20102;&#19968;&#20010;&#22522;&#26412;&#29702;&#35770;&#65292;&#30740;&#31350;&#20102;&#24102;&#26377;&#39640;&#38454;&#20449;&#24687;&#30340;&#26399;&#26435;&#24066;&#22330;&#20013;&#20215;&#26684;&#30340;&#21457;&#29616;&#26426;&#21046;&#12290;&#19982;&#27492;&#21516;&#26102;&#65292;&#35813;&#30740;&#31350;&#36824;&#20197;&#20869;&#24149;&#20132;&#26131;&#30340;&#24418;&#24335;&#21576;&#29616;&#20102;&#20854;&#20013;&#30340;&#29305;&#20363;&#65292;&#32473;&#20986;&#20102;&#36890;&#36135;&#33192;&#32960;&#38656;&#27714;&#12289;&#20215;&#26684;&#20914;&#20987;&#21644;&#20449;&#24687;&#25928;&#29575;&#30340;&#38381;&#24335;&#35299;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36890;&#36807;&#19968;&#20010;&#27169;&#22411;&#65292;&#32771;&#34385;&#20102;&#31169;&#26377;&#20449;&#24687;&#21644;&#39640;&#38454;&#20449;&#24687;&#23545;&#26399;&#26435;&#24066;&#22330;&#20215;&#26684;&#30340;&#24433;&#21709;&#12290;&#27169;&#22411;&#20801;&#35768;&#26377;&#31169;&#26377;&#20449;&#24687;&#30340;&#20132;&#26131;&#32773;&#22312;&#29366;&#24577;-&#32034;&#36180;&#38598;&#24066;&#22330;&#19978;&#20132;&#26131;&#12290;&#31561;&#20215;&#30340;&#26399;&#26435;&#24418;&#24335;&#19979;&#65292;&#25105;&#20204;&#32771;&#34385;&#20102;&#25317;&#26377;&#20851;&#20110;&#22522;&#30784;&#36164;&#20135;&#25910;&#30410;&#30340;&#20998;&#24067;&#30340;&#31169;&#26377;&#20449;&#24687;&#65292;&#24182;&#20801;&#35768;&#20132;&#26131;&#20219;&#24847;&#26399;&#26435;&#32452;&#21512;&#30340;&#25805;&#32437;&#32773;&#12290;&#25105;&#20204;&#24471;&#20986;&#20102;&#36890;&#36135;&#33192;&#32960;&#38656;&#27714;&#12289;&#20215;&#26684;&#20914;&#20987;&#21644;&#20449;&#24687;&#25928;&#29575;&#30340;&#38381;&#24335;&#35299;&#65292;&#36825;&#20123;&#35299;&#25552;&#20379;&#20102;&#20851;&#20110;&#20869;&#24149;&#20132;&#26131;&#30340;&#39640;&#38454;&#20449;&#24687;&#65292;&#22914;&#20219;&#20309;&#32473;&#23450;&#30340;&#26102;&#21051;&#20132;&#26131;&#26399;&#26435;&#31574;&#30053;&#65292;&#24182;&#23558;&#36825;&#20123;&#31574;&#30053;&#27867;&#21270;&#21040;&#20102;&#27874;&#21160;&#29575;&#20132;&#26131;&#31561;&#23454;&#36341;&#39046;&#22495;&#12290;
&lt;/p&gt;
&lt;p&gt;
We obtain a basic theory of price discovery across derivative markets with respect to higher-order information, using a model where an agent with general private information regarding state probabilities is allowed to trade arbitrary portfolios of state-contingent claims. In an equivalent options formulation, the informed agent has private information regarding arbitrary aspects of the payoff distribution of an underlying asset and is allowed to trade arbitrary option portfolios. We characterize, in closed form, the informed demand, price impact, and information efficiency of prices. Our results offer a theory of insider trading on higher moments of the underlying payoff as a special case. The informed demand formula prescribes option strategies for trading on any given moment and extends those used in practice for, e.g. volatility trading.
&lt;/p&gt;</description></item><item><title>Forest-PLS&#26159;&#19968;&#31181;&#29305;&#24449;&#36873;&#25321;&#26041;&#27861;&#65292;&#33021;&#22815;&#26356;&#28789;&#27963;&#21644;&#20840;&#38754;&#22320;&#20998;&#26512;&#20010;&#24615;&#21270;&#25919;&#31574;&#25928;&#26524;&#30340;&#24322;&#36136;&#24615;&#12290;&#36890;&#36807;&#20559;&#26368;&#23567;&#20108;&#20056;&#27861;&#35782;&#21035;&#20154;&#32676;&#30340;&#30446;&#26631;&#32452;&#20998;&#65292;&#24182;&#21033;&#29992;&#22240;&#26524;&#26862;&#26519;&#20272;&#35745;&#20010;&#24615;&#21270;&#25919;&#31574;&#25928;&#26524;&#12290;&#24212;&#29992;&#20110;&#23454;&#38469;&#25968;&#25454;&#20998;&#26512;&#21518;&#21457;&#29616;&#65292;&#36130;&#25919;&#28608;&#21169;&#21487;&#20197;&#28608;&#21169;&#19968;&#20123;&#24180;&#36731;&#30340;&#38750;&#30333;&#20154;&#20010;&#20307;&#36827;&#20837;&#21171;&#21160;&#24066;&#22330;&#12290;</title><link>http://arxiv.org/abs/2301.00251</link><description>&lt;p&gt;
&#20010;&#24615;&#21270;&#25919;&#31574;&#20998;&#26512;&#30340;&#29305;&#24449;&#36873;&#25321;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Feature Selection for Personalized Policy Analysis. (arXiv:2301.00251v2 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2301.00251
&lt;/p&gt;
&lt;p&gt;
Forest-PLS&#26159;&#19968;&#31181;&#29305;&#24449;&#36873;&#25321;&#26041;&#27861;&#65292;&#33021;&#22815;&#26356;&#28789;&#27963;&#21644;&#20840;&#38754;&#22320;&#20998;&#26512;&#20010;&#24615;&#21270;&#25919;&#31574;&#25928;&#26524;&#30340;&#24322;&#36136;&#24615;&#12290;&#36890;&#36807;&#20559;&#26368;&#23567;&#20108;&#20056;&#27861;&#35782;&#21035;&#20154;&#32676;&#30340;&#30446;&#26631;&#32452;&#20998;&#65292;&#24182;&#21033;&#29992;&#22240;&#26524;&#26862;&#26519;&#20272;&#35745;&#20010;&#24615;&#21270;&#25919;&#31574;&#25928;&#26524;&#12290;&#24212;&#29992;&#20110;&#23454;&#38469;&#25968;&#25454;&#20998;&#26512;&#21518;&#21457;&#29616;&#65292;&#36130;&#25919;&#28608;&#21169;&#21487;&#20197;&#28608;&#21169;&#19968;&#20123;&#24180;&#36731;&#30340;&#38750;&#30333;&#20154;&#20010;&#20307;&#36827;&#20837;&#21171;&#21160;&#24066;&#22330;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#36825;&#31687;&#35770;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;Forest-PLS&#30340;&#29305;&#24449;&#36873;&#25321;&#26041;&#27861;&#65292;&#29992;&#20110;&#20998;&#26512;&#25919;&#31574;&#25928;&#26524;&#30340;&#24322;&#36136;&#24615;&#12290;&#19982;&#20256;&#32479;&#26041;&#27861;&#30456;&#27604;&#65292;&#25105;&#20204;&#30340;&#26041;&#27861;&#26356;&#21152;&#28789;&#27963;&#21644;&#20840;&#38754;&#65292;&#33021;&#22815;&#25429;&#25417;&#20154;&#32676;&#20013;&#22522;&#20110;&#21487;&#35266;&#23519;&#29305;&#24449;&#23450;&#20041;&#30340;&#23376;&#32676;&#20869;&#22806;&#30340;&#25919;&#31574;&#25928;&#26524;&#24322;&#36136;&#24615;&#12290;&#20026;&#20102;&#23454;&#29616;&#36825;&#19968;&#30446;&#26631;&#65292;&#25105;&#20204;&#37319;&#29992;&#20559;&#26368;&#23567;&#20108;&#20056;&#27861;&#26469;&#35782;&#21035;&#20154;&#32676;&#30340;&#30446;&#26631;&#32452;&#20998;&#65292;&#24182;&#21033;&#29992;&#22240;&#26524;&#26862;&#26519;&#26469;&#20272;&#35745;&#36825;&#20123;&#32452;&#20998;&#19978;&#30340;&#20010;&#24615;&#21270;&#25919;&#31574;&#25928;&#26524;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#35813;&#26041;&#27861;&#30340;&#19968;&#33268;&#24615;&#65292;&#24182;&#35777;&#26126;&#25919;&#31574;&#25928;&#26524;&#28176;&#36817;&#22320;&#26381;&#20174;&#27491;&#24577;&#20998;&#24067;&#12290;&#20026;&#20102;&#39564;&#35777;&#25105;&#20204;&#26041;&#27861;&#30340;&#26377;&#25928;&#24615;&#65292;&#25105;&#20204;&#23558;&#20854;&#24212;&#29992;&#20110;1988&#24180;&#33267;1989&#24180;&#38388;&#22312;&#23486;&#22805;&#27861;&#23612;&#20122;&#24030;&#36827;&#34892;&#30340;&#37325;&#26032;&#23601;&#19994;&#22870;&#21169;&#23454;&#39564;&#30340;&#25968;&#25454;&#12290;&#20998;&#26512;&#26174;&#31034;&#65292;&#36130;&#25919;&#28608;&#21169;&#21487;&#20197;&#28608;&#21169;&#19968;&#20123;&#24180;&#36731;&#30340;&#38750;&#30333;&#20154;&#20010;&#20307;&#36827;&#20837;&#21171;&#21160;&#24066;&#22330;&#12290;&#28982;&#32780;&#65292;&#36825;&#20123;&#28608;&#21169;&#20063;&#21487;&#33021;&#25552;&#20379;&#19968;&#31181;&#20020;&#26102;&#30340;&#36130;&#21153;&#32531;&#20914;
&lt;/p&gt;
&lt;p&gt;
In this paper, we propose Forest-PLS, a feature selection method for analyzing policy effect heterogeneity in a more flexible and comprehensive manner than is typically available with conventional methods. In particular, our method is able to capture policy effect heterogeneity both within and across subgroups of the population defined by observable characteristics. To achieve this, we employ partial least squares to identify target components of the population and causal forests to estimate personalized policy effects across these components. We show that the method is consistent and leads to asymptotically normally distributed policy effects. To demonstrate the efficacy of our approach, we apply it to the data from the Pennsylvania Reemployment Bonus Experiments, which were conducted in 1988-1989. The analysis reveals that financial incentives can motivate some young non-white individuals to enter the labor market. However, these incentives may also provide a temporary financial cush
&lt;/p&gt;</description></item><item><title>&#32463;&#27982;&#23398;&#23478;&#32463;&#24120;&#20272;&#35745;&#20197;&#32467;&#26524;&#30340;&#23545;&#25968;&#21464;&#25442;&#20026;&#22522;&#30784;&#30340;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#65292;&#20294;&#26159;&#36825;&#20123;&#25928;&#24212;&#21462;&#20915;&#20110;&#32467;&#26524;&#30340;&#21333;&#20301;&#65292;&#22240;&#27492;&#19981;&#24212;&#35299;&#37322;&#20026;&#30334;&#20998;&#27604;&#25928;&#24212;&#65292;&#24182;&#19988;&#23545;&#32467;&#26524;&#30340;&#27604;&#20363;&#21464;&#25442;&#20250;&#23548;&#33268;&#32467;&#26524;&#30340;&#21464;&#21270;&#65307;&#24403;&#32467;&#26524;&#21487;&#33021;&#20026;&#38646;&#26102;&#65292;&#21017;&#19981;&#23384;&#22312;&#28857;&#35782;&#21035;&#19988;&#21333;&#20301;&#19981;&#21464;&#30340;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#65292;&#38656;&#35201;&#32771;&#34385;&#26367;&#20195;&#30446;&#26631;&#21442;&#25968;&#12290;</title><link>http://arxiv.org/abs/2212.06080</link><description>&lt;p&gt;
&#35770;&#25991;&#26631;&#39064;&#65306;&#23450;&#20041;&#20026;&#38646;&#30340;&#32467;&#26524;&#25152;&#30830;&#23450;&#30340;&#31867;&#23545;&#25968;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#20855;&#26377;&#20219;&#24847;&#26631;&#24230;&#20381;&#36182;&#24615;
&lt;/p&gt;
&lt;p&gt;
Log-like? Identified ATEs defined with zero-valued outcomes are (arbitrarily) scale-dependent. (arXiv:2212.06080v5 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2212.06080
&lt;/p&gt;
&lt;p&gt;
&#32463;&#27982;&#23398;&#23478;&#32463;&#24120;&#20272;&#35745;&#20197;&#32467;&#26524;&#30340;&#23545;&#25968;&#21464;&#25442;&#20026;&#22522;&#30784;&#30340;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#65292;&#20294;&#26159;&#36825;&#20123;&#25928;&#24212;&#21462;&#20915;&#20110;&#32467;&#26524;&#30340;&#21333;&#20301;&#65292;&#22240;&#27492;&#19981;&#24212;&#35299;&#37322;&#20026;&#30334;&#20998;&#27604;&#25928;&#24212;&#65292;&#24182;&#19988;&#23545;&#32467;&#26524;&#30340;&#27604;&#20363;&#21464;&#25442;&#20250;&#23548;&#33268;&#32467;&#26524;&#30340;&#21464;&#21270;&#65307;&#24403;&#32467;&#26524;&#21487;&#33021;&#20026;&#38646;&#26102;&#65292;&#21017;&#19981;&#23384;&#22312;&#28857;&#35782;&#21035;&#19988;&#21333;&#20301;&#19981;&#21464;&#30340;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#65292;&#38656;&#35201;&#32771;&#34385;&#26367;&#20195;&#30446;&#26631;&#21442;&#25968;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#32463;&#27982;&#23398;&#23478;&#32463;&#24120;&#20026;&#38646;&#28857;&#33391;&#22909;&#23450;&#20041;&#20294;&#22312;$y$&#24456;&#22823;&#26102;&#34920;&#29616;&#20986;$log(y)$&#30340;&#36716;&#21270;&#32467;&#26524;&#20272;&#35745;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#65288;ATE&#65289;&#65288;&#20363;&#22914;$log(1+y)$&#12289;$arcsinh(y)$&#65289;&#12290;&#25105;&#20204;&#34920;&#26126;&#65292;&#36825;&#20123;ATE&#23545;&#32467;&#26524;&#30340;&#21333;&#20301;&#20855;&#26377;&#20219;&#24847;&#20381;&#36182;&#24615;&#65292;&#22240;&#27492;&#19981;&#24212;&#35299;&#37322;&#20026;&#30334;&#20998;&#27604;&#25928;&#24212;&#12290;&#19982;&#27492;&#32467;&#26524;&#19968;&#33268;&#65292;&#25105;&#20204;&#21457;&#29616;&#65292;&#24403;&#23558;&#32467;&#26524;&#30340;&#21333;&#20301;&#20056;&#20197;100&#65288;&#20363;&#22914;&#23558;&#32654;&#20803;&#36716;&#25442;&#20026;&#32654;&#20998;&#65289;&#26102;&#65292;&#32654;&#22269;&#32463;&#27982;&#35780;&#35770;&#20013;&#21457;&#34920;&#30340;$arcsinh$&#36716;&#21270;&#21518;&#30340;&#32467;&#26524;&#30340;&#20272;&#35745;&#22788;&#29702;&#25928;&#24212;&#20250;&#21457;&#29983;&#30456;&#24403;&#22823;&#30340;&#21464;&#21270;&#12290;&#20026;&#20102;&#24110;&#21161;&#30028;&#23450;&#26367;&#20195;&#26041;&#27861;&#65292;&#25105;&#20204;&#35777;&#26126;&#65292;&#24403;&#32467;&#26524;&#21487;&#33021;&#31561;&#20110;&#38646;&#26102;&#65292;&#19981;&#23384;&#22312;&#24418;&#24335;&#20026;$E_P[g(Y(1),Y(0))]$&#30340;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#26159;&#28857;&#35782;&#21035;&#19988;&#21333;&#20301;&#19981;&#21464;&#30340;&#12290;&#25105;&#20204;&#26368;&#21518;&#35752;&#35770;&#20102;&#20855;&#26377;&#38646;&#20215;&#20540;&#32467;&#26524;&#30340;&#35774;&#32622;&#30340;&#26126;&#26234;&#30340;&#26367;&#20195;&#30446;&#26631;&#21442;&#25968;&#65292;&#25918;&#23485;&#20102;&#36825;&#20123;&#35201;&#27714;&#20013;&#30340;&#33267;&#23569;&#19968;&#20010;&#35201;&#27714;&#12290;
&lt;/p&gt;
&lt;p&gt;
Economists frequently estimate average treatment effects (ATEs) for transformations of the outcome that are well-defined at zero but behave like $\log(y)$ when $y$ is large (e.g., $\log(1+y)$, $\mathrm{arcsinh}(y)$). We show that these ATEs depend arbitrarily on the units of the outcome, and thus should not be interpreted as percentage effects. In line with this result, we find that estimated treatment effects for $\mathrm{arcsinh}$-transformed outcomes published in the American Economic Review change substantially when we multiply the units of the outcome by 100 (e.g., convert dollars to cents). To help delineate alternative approaches, we prove that when the outcome can equal zero, there is no average treatment effect of the form $E_P[g(Y(1),Y(0))]$ that is point-identified and unit-invariant. We conclude by discussing sensible alternative target parameters for settings with zero-valued outcomes that relax at least one of these requirements.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#23545;&#20027;&#27969;&#20998;&#25955;&#21270;&#38134;&#34892;&#20351;&#29992;&#20132;&#26131;&#25968;&#25454;&#36827;&#34892;&#26680;&#24515;-&#22806;&#22260;&#32593;&#32476;&#29305;&#24449;&#20998;&#26512;&#65292;&#32467;&#26524;&#26174;&#31034;MakerDao&#21644;Compound&#27604;Aave&#21644;Liquity&#26356;&#20026;&#20998;&#25955;&#21270;&#65292;&#22312;&#20132;&#26131;&#20013;&#20173;&#23384;&#22312;&#30528;&#20027;&#35201;&#30340;&#22806;&#37096;&#20132;&#26131;&#12290;</title><link>http://arxiv.org/abs/2212.05632</link><description>&lt;p&gt;
&#21306;&#22359;&#38142;&#32593;&#32476;&#20998;&#26512;&#65306;&#20998;&#25955;&#21270;&#38134;&#34892;&#30340;&#27604;&#36739;&#30740;&#31350;&#12290;
&lt;/p&gt;
&lt;p&gt;
Blockchain Network Analysis: A Comparative Study of Decentralized Banks. (arXiv:2212.05632v3 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2212.05632
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#23545;&#20027;&#27969;&#20998;&#25955;&#21270;&#38134;&#34892;&#20351;&#29992;&#20132;&#26131;&#25968;&#25454;&#36827;&#34892;&#26680;&#24515;-&#22806;&#22260;&#32593;&#32476;&#29305;&#24449;&#20998;&#26512;&#65292;&#32467;&#26524;&#26174;&#31034;MakerDao&#21644;Compound&#27604;Aave&#21644;Liquity&#26356;&#20026;&#20998;&#25955;&#21270;&#65292;&#22312;&#20132;&#26131;&#20013;&#20173;&#23384;&#22312;&#30528;&#20027;&#35201;&#30340;&#22806;&#37096;&#20132;&#26131;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20998;&#25955;&#21270;&#37329;&#34701;&#65288;DeFi&#65289;&#20197;&#20854;&#29420;&#29305;&#30340;&#26426;&#21046;&#35774;&#35745;&#32780;&#38395;&#21517;&#65292;&#20854;&#24212;&#29992;&#26234;&#33021;&#21512;&#32422;&#20197;&#20419;&#36827;&#28857;&#23545;&#28857;&#20132;&#26131;&#12290;&#20998;&#25955;&#21270;&#38134;&#34892;&#26159;&#19968;&#31181;&#20856;&#22411;&#30340;DeFi&#24212;&#29992;&#12290;&#29702;&#24819;&#24773;&#20917;&#19979;&#65292;&#20998;&#25955;&#21270;&#38134;&#34892;&#24212;&#35813;&#22312;&#20132;&#26131;&#26041;&#38754;&#20063;&#20998;&#25955;&#21270;&#12290;&#28982;&#32780;&#65292;&#35768;&#22810;&#26368;&#36817;&#30340;&#30740;&#31350;&#21457;&#29616;&#65292;&#20998;&#25955;&#21270;&#38134;&#34892;&#24182;&#27809;&#26377;&#23454;&#29616;&#26174;&#33879;&#30340;&#20998;&#25955;&#21270;&#31243;&#24230;&#12290;&#26412;&#30740;&#31350;&#23545;&#20027;&#27969;&#20998;&#25955;&#21270;&#38134;&#34892;&#36827;&#34892;&#20102;&#27604;&#36739;&#30740;&#31350;&#12290;&#25105;&#20204;&#20351;&#29992;&#22235;&#23478;&#20998;&#25955;&#21270;&#38134;&#34892;&#65288;Liquity&#12289;Aave&#12289;MakerDao&#21644;Compound&#65289;&#30340;&#20132;&#26131;&#25968;&#25454;&#24212;&#29992;&#26680;&#24515;-&#22806;&#22260;&#32593;&#32476;&#29305;&#24449;&#20998;&#26512;&#12290;&#25105;&#20204;&#25552;&#21462;&#20102;&#20845;&#20010;&#29305;&#24449;&#24182;&#22312;&#27178;&#25130;&#38754;&#19978;&#27604;&#36739;&#20102;&#38134;&#34892;&#30340;&#20998;&#25955;&#21270;&#27700;&#24179;&#12290;&#26681;&#25454;&#20998;&#26512;&#32467;&#26524;&#65292;&#25105;&#20204;&#21457;&#29616;&#65306;1&#65289;MakerDao&#21644;Compound&#22312;&#20132;&#26131;&#20013;&#27604;Aave&#21644;Liquity&#26356;&#20026;&#20998;&#25955;&#21270;&#12290;2&#65289;&#23613;&#31649;&#20998;&#25955;&#21270;&#38134;&#34892;&#20132;&#26131;&#24212;&#35813;&#26159;&#20998;&#25955;&#21270;&#30340;&#65292;&#20294;&#25968;&#25454;&#26174;&#31034;&#22235;&#23478;&#38134;&#34892;&#23384;&#22312;&#20027;&#35201;&#30340;&#22806;&#37096;&#20132;&#26131;&#12290;
&lt;/p&gt;
&lt;p&gt;
Decentralized finance (DeFi) is known for its unique mechanism design, which applies smart contracts to facilitate peer-to-peer transactions. The decentralized bank is a typical DeFi application. Ideally, a decentralized bank should be decentralized in the transaction. However, many recent studies have found that decentralized banks have not achieved a significant degree of decentralization. This research conducts a comparative study among mainstream decentralized banks. We apply core-periphery network features analysis using the transaction data from four decentralized banks, Liquity, Aave, MakerDao, and Compound. We extract six features and compare the banks' levels of decentralization cross-sectionally. According to the analysis results, we find that: 1) MakerDao and Compound are more decentralized in the transactions than Aave and Liquity. 2) Although decentralized banking transactions are supposed to be decentralized, the data show that four banks have primary external transaction
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#33756;&#21333;&#25551;&#36848;&#22312;&#23637;&#31034;&#26426;&#21046;&#31574;&#30053;&#26080;&#25032;&#21487;&#20987;&#24615;&#26041;&#38754;&#30340;&#20316;&#29992;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#31616;&#21333;&#33756;&#21333;&#25551;&#36848;&#30340;&#24310;&#36831;&#25509;&#21463;&#26426;&#21046;&#65292;&#24182;&#36890;&#36807;&#23454;&#39564;&#39564;&#35777;&#20102;&#33756;&#21333;&#25551;&#36848;&#30340;&#20248;&#21183;&#21644;&#25361;&#25112;&#12290;</title><link>http://arxiv.org/abs/2209.13148</link><description>&lt;p&gt;
&#20855;&#26377;&#31574;&#30053;&#26080;&#25032;&#21487;&#20987;&#24615;&#30340;&#26292;&#38706;&#26426;&#21046;&#25551;&#36848;
&lt;/p&gt;
&lt;p&gt;
Strategyproofness-Exposing Mechanism Descriptions. (arXiv:2209.13148v2 [econ.TH] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2209.13148
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#33756;&#21333;&#25551;&#36848;&#22312;&#23637;&#31034;&#26426;&#21046;&#31574;&#30053;&#26080;&#25032;&#21487;&#20987;&#24615;&#26041;&#38754;&#30340;&#20316;&#29992;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#31616;&#21333;&#33756;&#21333;&#25551;&#36848;&#30340;&#24310;&#36831;&#25509;&#21463;&#26426;&#21046;&#65292;&#24182;&#36890;&#36807;&#23454;&#39564;&#39564;&#35777;&#20102;&#33756;&#21333;&#25551;&#36848;&#30340;&#20248;&#21183;&#21644;&#25361;&#25112;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#33756;&#21333;&#25551;&#36848;&#20197;&#20004;&#20010;&#27493;&#39588;&#21521;&#29609;&#23478;i&#23637;&#31034;&#26426;&#21046;&#12290;&#31532;&#19968;&#27493;&#20351;&#29992;&#20854;&#20182;&#29609;&#23478;&#30340;&#25253;&#21578;&#25551;&#36848;i&#30340;&#33756;&#21333;&#65306;&#21363;i&#30340;&#28508;&#22312;&#32467;&#26524;&#38598;&#21512;&#12290;&#31532;&#20108;&#27493;&#20351;&#29992;i&#30340;&#25253;&#21578;&#20174;&#22905;&#30340;&#33756;&#21333;&#20013;&#36873;&#25321;i&#26368;&#21916;&#27426;&#30340;&#32467;&#26524;&#12290;&#33756;&#21333;&#25551;&#36848;&#33021;&#26356;&#22909;&#22320;&#26292;&#38706;&#31574;&#30053;&#26080;&#25032;&#21487;&#20987;&#24615;&#21527;&#65292;&#32780;&#19981;&#20250;&#29306;&#29298;&#31616;&#21333;&#24615;&#65311;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#26032;&#30340;&#31616;&#21333;&#33756;&#21333;&#25551;&#36848;&#30340;&#24310;&#36831;&#25509;&#21463;&#26426;&#21046;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#65292;&#19982;&#20854;&#20182;&#24120;&#35265;&#30340;&#21305;&#37197;&#26426;&#21046;&#30456;&#27604;&#65292;&#36825;&#31181;&#33756;&#21333;&#25551;&#36848;&#24517;&#39035;&#19982;&#30456;&#24212;&#30340;&#20256;&#32479;&#25551;&#36848;&#26377;&#30528;&#23454;&#36136;&#24615;&#30340;&#19981;&#21516;&#12290;&#25105;&#20204;&#36890;&#36807;&#23545;&#20004;&#31181;&#22522;&#26412;&#26426;&#21046;&#30340;&#23454;&#39564;&#23460;&#23454;&#39564;&#35777;&#26126;&#20102;&#33756;&#21333;&#25551;&#36848;&#30340;&#20248;&#21183;&#21644;&#25361;&#25112;&#12290;
&lt;/p&gt;
&lt;p&gt;
A menu description presents a mechanism to player $i$ in two steps. Step (1) uses the reports of other players to describe $i$'s menu: the set of $i$'s potential outcomes. Step (2) uses $i$'s report to select $i$'s favorite outcome from her menu. Can menu descriptions better expose strategyproofness, without sacrificing simplicity? We propose a new, simple menu description of Deferred Acceptance. We prove that -- in contrast with other common matching mechanisms -- this menu description must differ substantially from the corresponding traditional description. We demonstrate, with a lab experiment on two elementary mechanisms, the promise and challenges of menu descriptions.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#26041;&#27861;&#65292;&#21033;&#29992;&#24494;&#35266;&#32423;&#20132;&#26131;&#25968;&#25454;&#36870;&#21521;&#20272;&#35745;&#36135;&#24065;&#30340;&#20256;&#36755;&#36895;&#24230;&#12290;&#36890;&#36807;&#27979;&#37327;&#36135;&#24065;&#22312;&#20010;&#20154;&#36134;&#25143;&#19978;&#30340;&#25345;&#26377;&#26102;&#38388;&#65292;&#24182;&#35745;&#31639;&#20854;&#36870;&#21453;&#65292;&#25105;&#20204;&#21457;&#29616;Sarafu&#22312;&#32943;&#23612;&#20122;&#30340;&#20256;&#36755;&#36895;&#24230;&#27604;&#24635;&#20307;&#19978;&#26356;&#39640;&#65292;&#22240;&#20026;&#24182;&#38750;&#25152;&#26377;&#30340;Sarafu&#21333;&#20301;&#37117;&#20445;&#25345;&#22312;&#27963;&#36291;&#24490;&#29615;&#20013;&#12290;</title><link>http://arxiv.org/abs/2209.01512</link><description>&lt;p&gt;
&#36135;&#24065;&#20256;&#36755;&#36895;&#24230;&#30340;&#36870;&#25512;&#20272;&#35745;
&lt;/p&gt;
&lt;p&gt;
Inverse estimation of the transfer velocity of money. (arXiv:2209.01512v2 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2209.01512
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#26041;&#27861;&#65292;&#21033;&#29992;&#24494;&#35266;&#32423;&#20132;&#26131;&#25968;&#25454;&#36870;&#21521;&#20272;&#35745;&#36135;&#24065;&#30340;&#20256;&#36755;&#36895;&#24230;&#12290;&#36890;&#36807;&#27979;&#37327;&#36135;&#24065;&#22312;&#20010;&#20154;&#36134;&#25143;&#19978;&#30340;&#25345;&#26377;&#26102;&#38388;&#65292;&#24182;&#35745;&#31639;&#20854;&#36870;&#21453;&#65292;&#25105;&#20204;&#21457;&#29616;Sarafu&#22312;&#32943;&#23612;&#20122;&#30340;&#20256;&#36755;&#36895;&#24230;&#27604;&#24635;&#20307;&#19978;&#26356;&#39640;&#65292;&#22240;&#20026;&#24182;&#38750;&#25152;&#26377;&#30340;Sarafu&#21333;&#20301;&#37117;&#20445;&#25345;&#22312;&#27963;&#36291;&#24490;&#29615;&#20013;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#30417;&#27979;&#36135;&#24065;&#20379;&#24212;&#26159;&#36827;&#34892;&#20581;&#20840;&#36135;&#24065;&#25919;&#31574;&#30340;&#37325;&#35201;&#21069;&#25552;&#65292;&#20294;&#20256;&#32479;&#19978;&#36135;&#24065;&#25351;&#26631;&#30340;&#20272;&#35745;&#26159;&#20197;&#24635;&#20307;&#20026;&#21333;&#20301;&#36827;&#34892;&#30340;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#33021;&#22815;&#21033;&#29992;&#29616;&#23454;&#19990;&#30028;&#25903;&#20184;&#31995;&#32479;&#30340;&#24494;&#35266;&#32423;&#20132;&#26131;&#25968;&#25454;&#30340;&#26032;&#26041;&#27861;&#12290;&#25105;&#20204;&#24212;&#29992;&#19968;&#31181;&#26032;&#39062;&#30340;&#35745;&#31639;&#25216;&#26415;&#26469;&#27979;&#37327;&#36135;&#24065;&#22312;&#20010;&#20154;&#36134;&#25143;&#20013;&#25345;&#26377;&#30340;&#25345;&#32493;&#26102;&#38388;&#65292;&#24182;&#36890;&#36807;&#20854;&#36870;&#21453;&#35745;&#31639;&#36135;&#24065;&#30340;&#20256;&#36755;&#36895;&#24230;&#12290;&#25105;&#20204;&#30340;&#26032;&#23450;&#20041;&#22312;&#20256;&#32479;&#20551;&#35774;&#19979;&#36864;&#21270;&#20026;&#29616;&#26377;&#23450;&#20041;&#12290;&#28982;&#32780;&#65292;&#22312;&#24635;&#20313;&#39069;&#27874;&#21160;&#21644;&#28040;&#36153;&#27169;&#24335;&#21457;&#29983;&#25913;&#21464;&#30340;&#25903;&#20184;&#31995;&#32479;&#20013;&#65292;&#36870;&#20272;&#35745;&#20173;&#28982;&#36866;&#29992;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#24212;&#29992;&#20110;&#32943;&#23612;&#20122;&#30340;&#19968;&#20010;&#23567;&#22411;&#25968;&#23383;&#31038;&#21306;&#36135;&#24065;Sarafu&#30340;&#30740;&#31350;&#20013;&#65292;&#20174;2020&#24180;1&#26376;25&#26085;&#21040;2021&#24180;6&#26376;15&#26085;&#21487;&#20197;&#33719;&#24471;&#20132;&#26131;&#25968;&#25454;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;Sarafu&#30340;&#20256;&#36755;&#36895;&#24230;&#27604;&#30475;&#36215;&#26469;&#30340;&#35201;&#39640;&#65292;&#22240;&#20026;&#24182;&#38750;&#25152;&#26377;&#30340;Sarafu&#21333;&#20301;&#37117;&#20445;&#25345;&#22312;&#27963;&#36291;&#24490;&#29615;&#20013;&#12290;
&lt;/p&gt;
&lt;p&gt;
Monitoring the money supply is an important prerequisite for conducting sound monetary policy, yet monetary indicators are conventionally estimated in aggregate. This paper proposes a new methodology that is able to leverage micro-level transaction data from real-world payment systems. We apply a novel computational technique to measure the durations for which money is held in individual accounts, and compute the transfer velocity of money from its inverse. Our new definition reduces to existing definitions under conventional assumptions. However, inverse estimation remains suitable for payment systems where the total balance fluctuates and spending patterns change in time. Our method is applied to study Sarafu, a small digital community currency in Kenya, where transaction data is available from 25 January 2020 to 15 June 2021. We find that the transfer velocity of Sarafu was higher than it would seem, in aggregate, because not all units of Sarafu remained in active circulation. Moreo
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#19981;&#21516;&#31867;&#21035;&#30340;&#25237;&#31080;&#35268;&#21017;&#22312;&#35825;&#23548;&#20195;&#29702;&#20154;&#30495;&#23454;&#25253;&#21578;&#20559;&#22909;&#26102;&#30340;&#33021;&#21147;&#65292;&#35777;&#26126;&#20102;&#26080;&#36951;&#25022;&#30340;&#30495;&#23454;&#25253;&#21578;&#19982;&#20165;&#23545;&#21069;&#20960;&#20010;&#35268;&#21017;&#30340;&#31574;&#30053;&#24615;&#31561;&#20215;&#65292;&#24182;&#23545;maxmin&#12289;&#35780;&#20998;&#21644;&#24247;&#22810;&#22622;&#19968;&#33268;&#35268;&#21017;&#36827;&#34892;&#20102;&#35752;&#35770;&#21644;&#20998;&#26512;&#65292;&#25552;&#20986;&#20102;&#27491;&#21453;&#20004;&#26041;&#38754;&#30340;&#32467;&#26524;&#21644;&#24517;&#35201;&#26465;&#20214;&#65292;&#24182;&#30740;&#31350;&#20102;&#24247;&#22810;&#22622;&#19968;&#33268;&#35268;&#21017;&#21644;&#36830;&#32493;&#28040;&#38500;&#35268;&#21017;&#30340;&#29305;&#24615;&#12290;</title><link>http://arxiv.org/abs/2208.13853</link><description>&lt;p&gt;
&#26080;&#36951;&#25022;&#30340;&#30495;&#23454;&#25237;&#31080;&#35268;&#21017;
&lt;/p&gt;
&lt;p&gt;
Regret-free truth-telling voting rules. (arXiv:2208.13853v2 [econ.TH] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2208.13853
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#19981;&#21516;&#31867;&#21035;&#30340;&#25237;&#31080;&#35268;&#21017;&#22312;&#35825;&#23548;&#20195;&#29702;&#20154;&#30495;&#23454;&#25253;&#21578;&#20559;&#22909;&#26102;&#30340;&#33021;&#21147;&#65292;&#35777;&#26126;&#20102;&#26080;&#36951;&#25022;&#30340;&#30495;&#23454;&#25253;&#21578;&#19982;&#20165;&#23545;&#21069;&#20960;&#20010;&#35268;&#21017;&#30340;&#31574;&#30053;&#24615;&#31561;&#20215;&#65292;&#24182;&#23545;maxmin&#12289;&#35780;&#20998;&#21644;&#24247;&#22810;&#22622;&#19968;&#33268;&#35268;&#21017;&#36827;&#34892;&#20102;&#35752;&#35770;&#21644;&#20998;&#26512;&#65292;&#25552;&#20986;&#20102;&#27491;&#21453;&#20004;&#26041;&#38754;&#30340;&#32467;&#26524;&#21644;&#24517;&#35201;&#26465;&#20214;&#65292;&#24182;&#30740;&#31350;&#20102;&#24247;&#22810;&#22622;&#19968;&#33268;&#35268;&#21017;&#21644;&#36830;&#32493;&#28040;&#38500;&#35268;&#21017;&#30340;&#29305;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#19981;&#21516;&#31867;&#21035;&#30340;&#25237;&#31080;&#35268;&#21017;&#22312;&#35825;&#23548;&#20195;&#29702;&#20154;&#30495;&#23454;&#25253;&#21578;&#20854;&#20559;&#22909;&#26102;&#30340;&#33021;&#21147;&#65292;&#22914;&#26524;&#20195;&#29702;&#20154;&#24819;&#35201;&#36991;&#20813;&#36951;&#25022;&#30340;&#35805;&#12290;&#39318;&#20808;&#65292;&#25105;&#20204;&#35777;&#26126;&#26080;&#36951;&#25022;&#30340;&#30495;&#23454;&#25253;&#21578;&#31561;&#20215;&#20110;&#20165;&#23545;&#21069;&#20960;&#20010;&#35268;&#21017;&#30340;&#31574;&#30053;&#24615;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#30528;&#37325;&#30740;&#31350;&#20102;&#19977;&#20010;&#37325;&#35201;&#23478;&#26063;&#30340;&#38750;&#20165;&#23545;&#21069;&#20960;&#20010;&#35268;&#21017;&#30340;&#25237;&#31080;&#26041;&#27861;&#65306;maxmin&#12289;&#35780;&#20998;&#21644;&#24247;&#22810;&#22622;&#19968;&#33268;&#35268;&#21017;&#12290;&#25105;&#20204;&#23545;maxmin&#21644;&#35780;&#20998;&#35268;&#21017;&#30340;&#20013;&#24615;&#21644;&#21311;&#21517;&#29256;&#26412;&#35777;&#26126;&#20102;&#27491;&#21453;&#20004;&#26041;&#38754;&#30340;&#32467;&#26524;&#12290;&#22312;&#20960;&#20010;&#23454;&#20363;&#20013;&#65292;&#25105;&#20204;&#25552;&#20379;&#20102;&#24517;&#35201;&#21644;&#20805;&#20998;&#30340;&#26465;&#20214;&#12290;&#25105;&#20204;&#36824;&#35777;&#26126;&#20102;&#28385;&#36275;&#19968;&#23450;&#21333;&#35843;&#24615;&#35201;&#27714;&#30340;&#24247;&#22810;&#22622;&#19968;&#33268;&#35268;&#21017;&#24182;&#19981;&#26159;&#26080;&#36951;&#25022;&#30340;&#30495;&#23454;&#25253;&#21578;&#12290;&#23613;&#31649;&#19981;&#28385;&#36275;&#21333;&#35843;&#24615;&#26465;&#20214;&#65292;&#20294;&#36830;&#32493;&#28040;&#38500;&#35268;&#21017;&#20063;&#26080;&#27861;&#20570;&#21040;&#26080;&#36951;&#25022;&#30340;&#30495;&#23454;&#25253;&#21578;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#20026;&#19977;&#20010;&#36873;&#39033;&#21644;&#20004;&#20010;&#20195;&#29702;&#20154;&#30340;&#24773;&#20917;&#25552;&#20379;&#20102;&#20004;&#31181;&#29305;&#24449;&#25551;&#36848;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study the ability of different classes of voting rules to induce agents to report their preferences truthfully, if agents want to avoid regret. First, we show that regret-free truth-telling is equivalent to strategy-proofness among tops-only rules. Then, we focus on three important families of (non-tops-only) voting methods: maxmin, scoring, and Condorcet consistent ones. We prove positive and negative results for both neutral and anonymous versions of maxmin and scoring rules. In several instances we provide necessary and sufficient conditions. We also show that Condorcet consistent rules that satisfy a mild monotonicity requirement are not regret-free truth-telling. Successive elimination rules fail to be regret-free truth-telling despite not satisfying the monotonicity condition. Lastly, we provide two characterizations for the case of three alternatives and two agents.
&lt;/p&gt;</description></item><item><title>&#36825;&#39033;&#30740;&#31350;&#22312;&#22238;&#24402;&#19981;&#36830;&#32493;&#35774;&#35745;&#19979;&#32771;&#34385;&#20102;&#31574;&#30053;&#23398;&#20064;&#65292;&#24182;&#24320;&#21457;&#20102;&#19968;&#31181;&#40065;&#26834;&#20248;&#21270;&#26041;&#27861;&#26469;&#25214;&#21040;&#26368;&#20248;&#27835;&#30103;&#25130;&#28857;&#65292;&#20197;&#25552;&#39640;&#27835;&#30103;&#25928;&#26524;&#12290;</title><link>http://arxiv.org/abs/2208.13323</link><description>&lt;p&gt;
&#22312;&#20855;&#26377;&#22810;&#20010;&#25130;&#28857;&#30340;&#22238;&#24402;&#19981;&#36830;&#32493;&#35774;&#35745;&#19979;&#30340;&#23433;&#20840;&#31574;&#30053;&#23398;&#20064;
&lt;/p&gt;
&lt;p&gt;
Safe Policy Learning under Regression Discontinuity Designs with Multiple Cutoffs. (arXiv:2208.13323v3 [stat.ME] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2208.13323
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#30740;&#31350;&#22312;&#22238;&#24402;&#19981;&#36830;&#32493;&#35774;&#35745;&#19979;&#32771;&#34385;&#20102;&#31574;&#30053;&#23398;&#20064;&#65292;&#24182;&#24320;&#21457;&#20102;&#19968;&#31181;&#40065;&#26834;&#20248;&#21270;&#26041;&#27861;&#26469;&#25214;&#21040;&#26368;&#20248;&#27835;&#30103;&#25130;&#28857;&#65292;&#20197;&#25552;&#39640;&#27835;&#30103;&#25928;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22238;&#24402;&#19981;&#36830;&#32493;&#35774;&#35745;&#24191;&#27867;&#29992;&#20110;&#35266;&#27979;&#25968;&#25454;&#30340;&#31243;&#24207;&#35780;&#20272;&#12290;&#29616;&#26377;&#25991;&#29486;&#20027;&#35201;&#20851;&#27880;&#22312;&#29616;&#26377;&#30340;&#27835;&#30103;&#25130;&#28857;&#19978;&#20272;&#35745;&#23616;&#37096;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#12290;&#30456;&#27604;&#20043;&#19979;&#65292;&#25105;&#20204;&#32771;&#34385;&#22312;&#22238;&#24402;&#19981;&#36830;&#32493;&#35774;&#35745;&#19979;&#30340;&#31574;&#30053;&#23398;&#20064;&#12290;&#30001;&#20110;&#27835;&#30103;&#20998;&#37197;&#26426;&#21046;&#26159;&#30830;&#23450;&#24615;&#30340;&#65292;&#23398;&#20064;&#26356;&#22909;&#30340;&#27835;&#30103;&#25130;&#28857;&#38656;&#35201;&#22806;&#25512;&#12290;&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#31181;&#40065;&#26834;&#20248;&#21270;&#26041;&#27861;&#65292;&#29992;&#20110;&#25214;&#21040;&#25913;&#36827;&#29616;&#26377;&#25130;&#28857;&#30340;&#26368;&#20248;&#27835;&#30103;&#25130;&#28857;&#12290;&#25105;&#20204;&#39318;&#20808;&#23558;&#39044;&#26399;&#25928;&#29992;&#20998;&#35299;&#20026;&#21487;&#28857;&#37492;&#21035;&#21644;&#19981;&#21487;&#37492;&#21035;&#30340;&#32452;&#25104;&#37096;&#20998;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#39640;&#25928;&#30340;&#21452;&#37325;&#40065;&#26834;&#20272;&#35745;&#22120;&#26469;&#20272;&#35745;&#21487;&#37492;&#21035;&#37096;&#20998;&#12290;&#20026;&#20102;&#32771;&#34385;&#19981;&#21487;&#37492;&#21035;&#30340;&#25104;&#20998;&#65292;&#25105;&#20204;&#21033;&#29992;&#20102;&#22312;&#22238;&#24402;&#19981;&#36830;&#32493;&#35774;&#35745;&#19979;&#20849;&#21516;&#23384;&#22312;&#30340;&#22810;&#20010;&#25130;&#28857;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#25105;&#20204;&#20551;&#35774;&#19981;&#21516;&#32452;&#21035;&#28508;&#22312;&#32467;&#26524;&#30340;&#26465;&#20214;&#26399;&#26395;&#30340;&#24322;&#36136;&#24615;&#22312;&#36816;&#34892;&#21518;&#27839;&#30528;&#26576;&#19968;&#26041;&#21521;&#24179;&#28369;&#21464;&#21270;&#12290;
&lt;/p&gt;
&lt;p&gt;
The regression discontinuity (RD) design is widely used for program evaluation with observational data. The primary focus of the existing literature has been the estimation of the local average treatment effect at the existing treatment cutoff. In contrast, we consider policy learning under the RD design. Because the treatment assignment mechanism is deterministic, learning better treatment cutoffs requires extrapolation. We develop a robust optimization approach to finding optimal treatment cutoffs that improve upon the existing ones. We first decompose the expected utility into point-identifiable and unidentifiable components. We then propose an efficient doubly-robust estimator for the identifiable parts. To account for the unidentifiable components, we leverage the existence of multiple cutoffs that are common under the RD design. Specifically, we assume that the heterogeneity in the conditional expectations of potential outcomes across different groups vary smoothly along the runn
&lt;/p&gt;</description></item><item><title>&#30422;&#27888;&#30340;&#35299;&#20915;&#26041;&#26696;&#26159;&#19968;&#31181;&#35848;&#21028;&#35299;&#20915;&#26041;&#26696;&#65292;&#36890;&#36807;&#26368;&#23567;&#21270;&#29609;&#23478;&#23545;&#20998;&#37197;&#29983;&#25104;&#30340;&#38598;&#20307;&#25910;&#30410;&#30340;&#30772;&#22351;&#20542;&#21521;&#26469;&#23454;&#29616;&#12290;&#22312;&#27491;&#21017;&#30340;&#19977;&#20154;&#28216;&#25103;&#20013;&#65292;&#30422;&#27888;&#35299;&#22312;&#26680;&#24515;&#20869;&#65292;&#24182;&#19988;&#23545;&#20110;&#24191;&#27867;&#30340;&#28216;&#25103;&#31867;&#21035;&#26159;&#26126;&#30830;&#23450;&#20041;&#30340;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#30422;&#27888;&#20540;&#19982;&#27801;&#26222;&#21033;&#20540;&#20043;&#38388;&#30340;&#20851;&#31995;&#12290;</title><link>http://arxiv.org/abs/2208.10189</link><description>&lt;p&gt;
&#21512;&#20316;&#21338;&#24328;&#20013;&#30340;&#30422;&#27888;&#20540;
&lt;/p&gt;
&lt;p&gt;
Gately Values of Cooperative Games. (arXiv:2208.10189v2 [econ.TH] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2208.10189
&lt;/p&gt;
&lt;p&gt;
&#30422;&#27888;&#30340;&#35299;&#20915;&#26041;&#26696;&#26159;&#19968;&#31181;&#35848;&#21028;&#35299;&#20915;&#26041;&#26696;&#65292;&#36890;&#36807;&#26368;&#23567;&#21270;&#29609;&#23478;&#23545;&#20998;&#37197;&#29983;&#25104;&#30340;&#38598;&#20307;&#25910;&#30410;&#30340;&#30772;&#22351;&#20542;&#21521;&#26469;&#23454;&#29616;&#12290;&#22312;&#27491;&#21017;&#30340;&#19977;&#20154;&#28216;&#25103;&#20013;&#65292;&#30422;&#27888;&#35299;&#22312;&#26680;&#24515;&#20869;&#65292;&#24182;&#19988;&#23545;&#20110;&#24191;&#27867;&#30340;&#28216;&#25103;&#31867;&#21035;&#26159;&#26126;&#30830;&#23450;&#20041;&#30340;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#30422;&#27888;&#20540;&#19982;&#27801;&#26222;&#21033;&#20540;&#20043;&#38388;&#30340;&#20851;&#31995;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#20855;&#26377;&#21487;&#36716;&#35753;&#25928;&#29992;&#30340;&#21512;&#20316;&#21338;&#24328;&#20013;&#30340;&#30422;&#27888;&#35299;&#27010;&#24565;&#12290;&#30422;&#27888;&#30340;&#27010;&#24565;&#24341;&#20837;&#20102;&#19968;&#31181;&#35848;&#21028;&#35299;&#20915;&#26041;&#26696;&#65292;&#35813;&#35299;&#20915;&#26041;&#26696;&#26368;&#23567;&#21270;&#20102;&#35848;&#21028;&#36807;&#31243;&#20013;&#29609;&#23478;&#23545;&#20998;&#37197;&#29983;&#25104;&#30340;&#38598;&#20307;&#25910;&#30410;&#30340;&#8220;&#30772;&#22351;&#20542;&#21521;&#8221;&#30340;&#26368;&#22823;&#37327;&#21270;&#12290;&#30422;&#27888;&#30340;&#35299;&#20915;&#26041;&#26696;&#23545;&#20110;&#24191;&#27867;&#30340;&#28216;&#25103;&#31867;&#21035;&#26159;&#26126;&#30830;&#23450;&#20041;&#30340;&#12290;&#25105;&#20204;&#36824;&#32771;&#34385;&#20102;&#22522;&#20110;&#21442;&#25968;&#25968;&#37327;&#21270;&#30340;&#30772;&#22351;&#20542;&#21521;&#30340;&#19968;&#31181;&#25512;&#24191;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#36825;&#20123;&#24191;&#20041;&#30422;&#27888;&#20540;&#19982;&#26680;&#24515;&#21644;&#26680;&#20540;&#20043;&#38388;&#30340;&#20851;&#31995;&#65292;&#24182;&#19988;&#35777;&#26126;&#20102;&#22312;&#25152;&#26377;&#27491;&#21017;&#30340;&#19977;&#20154;&#28216;&#25103;&#20013;&#65292;&#30422;&#27888;&#35299;&#22312;&#26680;&#24515;&#20869;&#12290;&#25105;&#20204;&#30830;&#23450;&#20102;&#22312;&#19968;&#33324;&#21512;&#20316;&#21338;&#24328;&#20013;&#65292;&#36890;&#24120;&#24773;&#20917;&#19979;&#36825;&#20123;&#30422;&#27888;&#20540;&#26159;&#26680;&#24515;&#20998;&#37197;&#30340;&#30830;&#20999;&#26465;&#20214;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#30422;&#27888;&#20540;&#19982;&#27801;&#26222;&#21033;&#20540;&#20043;&#38388;&#30340;&#20851;&#31995;&#12290;
&lt;/p&gt;
&lt;p&gt;
We investigate Gately's solution concept for cooperative games with transferable utilities. Gately's conception introduced a bargaining solution that minimises the maximal quantified ``propensity to disrupt'' the negotiation process of the players over the allocation of the generated collective payoffs. Gately's solution concept is well-defined for a broad class of games. We also consider a generalisation based on a parameter-based quantification of the propensity to disrupt. Furthermore, we investigate the relationship of these generalised Gately values with the Core and the Nucleolus and show that Gately's solution is in the Core for all regular 3-player games. We identify exact conditions under which generally these Gately values are Core imputations for arbitrary regular cooperative games. Finally, we investigate the relationship of the Gately value with the Shapley value.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20379;&#20102;&#20851;&#20110;&#21463;&#37329;&#34701;&#32422;&#26463;&#30340;&#20225;&#19994;&#36827;&#34892;&#30740;&#31350;&#32852;&#21512;&#20225;&#19994;&#30340;&#26032;&#29702;&#35770;&#12290;&#32852;&#21512;&#20225;&#19994;&#21487;&#20197;&#21327;&#35843;&#30740;&#31350;&#21162;&#21147;&#65292;&#20943;&#23569;&#23545;&#37325;&#22797;&#39033;&#30446;&#30340;&#25237;&#36164;&#65292;&#22686;&#21152;&#21019;&#26032;&#30340;&#21487;&#33021;&#24615;&#12290;&#22312;&#24066;&#22330;&#31454;&#20105;&#24369;&#21644;&#22806;&#37096;&#34701;&#36164;&#26465;&#20214;&#19981;&#20339;&#26102;&#65292;&#32852;&#21512;&#20225;&#19994;&#25913;&#21892;&#20102;&#21019;&#26032;&#32467;&#26524;&#65292;&#22686;&#21152;&#20102;&#28040;&#36153;&#32773;&#21097;&#20313;&#65292;&#24182;&#19988;&#20542;&#21521;&#20110;&#30408;&#21033;&#12290;</title><link>http://arxiv.org/abs/2207.04856</link><description>&lt;p&gt;
&#30740;&#31350;&#32852;&#21512;&#20225;&#19994;&#65306;&#37329;&#34701;&#32422;&#26463;&#30340;&#20316;&#29992;
&lt;/p&gt;
&lt;p&gt;
Research Joint Ventures: The Role of Financial Constraints. (arXiv:2207.04856v3 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2207.04856
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20379;&#20102;&#20851;&#20110;&#21463;&#37329;&#34701;&#32422;&#26463;&#30340;&#20225;&#19994;&#36827;&#34892;&#30740;&#31350;&#32852;&#21512;&#20225;&#19994;&#30340;&#26032;&#29702;&#35770;&#12290;&#32852;&#21512;&#20225;&#19994;&#21487;&#20197;&#21327;&#35843;&#30740;&#31350;&#21162;&#21147;&#65292;&#20943;&#23569;&#23545;&#37325;&#22797;&#39033;&#30446;&#30340;&#25237;&#36164;&#65292;&#22686;&#21152;&#21019;&#26032;&#30340;&#21487;&#33021;&#24615;&#12290;&#22312;&#24066;&#22330;&#31454;&#20105;&#24369;&#21644;&#22806;&#37096;&#34701;&#36164;&#26465;&#20214;&#19981;&#20339;&#26102;&#65292;&#32852;&#21512;&#20225;&#19994;&#25913;&#21892;&#20102;&#21019;&#26032;&#32467;&#26524;&#65292;&#22686;&#21152;&#20102;&#28040;&#36153;&#32773;&#21097;&#20313;&#65292;&#24182;&#19988;&#20542;&#21521;&#20110;&#30408;&#21033;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20379;&#20102;&#19968;&#20010;&#20851;&#20110;&#21463;&#37329;&#34701;&#32422;&#26463;&#30340;&#20225;&#19994;&#36827;&#34892;&#30740;&#31350;&#32852;&#21512;&#20225;&#19994;&#30340;&#26032;&#29702;&#35770;&#12290;&#24403;&#20225;&#19994;&#36873;&#25321;&#30740;&#21457;&#32452;&#21512;&#26102;&#65292;&#32852;&#21512;&#20225;&#19994;&#21487;&#20197;&#24110;&#21161;&#21327;&#35843;&#30740;&#31350;&#21162;&#21147;&#65292;&#20943;&#23569;&#23545;&#37325;&#22797;&#39033;&#30446;&#30340;&#25237;&#36164;&#12290;&#36825;&#21487;&#20197;&#37322;&#25918;&#36164;&#28304;&#65292;&#22686;&#21152;&#36861;&#27714;&#30340;&#39033;&#30446;&#30340;&#22810;&#26679;&#24615;&#65292;&#20174;&#32780;&#22686;&#21152;&#21019;&#26032;&#30340;&#21487;&#33021;&#24615;&#12290;&#24403;&#24066;&#22330;&#31454;&#20105;&#24369;&#21644;&#22806;&#37096;&#34701;&#36164;&#26465;&#20214;&#19981;&#20339;&#26102;&#65292;&#32852;&#21512;&#20225;&#19994;&#25913;&#21892;&#20102;&#21019;&#26032;&#32467;&#26524;&#12290;&#32852;&#21512;&#20225;&#19994;&#21487;&#33021;&#22686;&#21152;&#21019;&#26032;&#30340;&#27010;&#29575;&#65292;&#21516;&#26102;&#38477;&#20302;&#24635;&#30740;&#21457;&#25104;&#26412;&#12290;&#22686;&#21152;&#21019;&#26032;&#30340;&#32852;&#21512;&#20225;&#19994;&#20063;&#22686;&#21152;&#20102;&#28040;&#36153;&#32773;&#21097;&#20313;&#65292;&#24182;&#19988;&#20542;&#21521;&#20110;&#30408;&#21033;&#65292;&#20294;&#20063;&#23384;&#22312;&#21066;&#20943;&#21019;&#26032;&#30340;&#32852;&#21512;&#20225;&#19994;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#23558;&#32852;&#21512;&#20225;&#19994;&#19982;&#22686;&#24378;&#21019;&#26032;&#30340;&#21512;&#24182;&#36827;&#34892;&#20102;&#27604;&#36739;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper provides a novel theory of research joint ventures for financially constrained firms. When firms choose R&amp;D portfolios, an RJV can help to coordinate research efforts, reducing investments in duplicate projects. This can free up resources, increase the variety of pursued projects and thereby increase the probability of discovering the innovation. RJVs improve innovation outcomes when market competition is weak and external financing conditions are bad. An RJV may increase the innovation probability and nevertheless lower total R&amp;D costs. RJVs that increase innovation also increase consumer surplus and tend to be profitable, but innovation-reducing RJVs also exist. Finally, we compare RJVs to innovation-enhancing mergers.
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#35748;&#35777;&#26041;&#27861;&#65292;&#29992;&#20110;&#28216;&#25103;&#20013;&#30340;&#20449;&#24687;&#35774;&#35745;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#22312;&#35774;&#35745;&#24072;&#26399;&#26395;&#30340;&#36125;&#21494;&#26031;&#32435;&#20160;&#22343;&#34913;&#20013;&#35825;&#23548;&#20986;&#26469;&#30340;&#20449;&#24687;&#32467;&#26500;&#20063;&#21487;&#20197;&#36890;&#36807;&#36741;&#21161;&#21512;&#21516;&#38382;&#39064;&#35825;&#23548;&#20986;&#26469;&#12290;&#35813;&#26041;&#27861;&#36866;&#29992;&#20110;&#35299;&#20915;&#25237;&#36164;&#28216;&#25103;&#21644;&#20215;&#26684;&#31454;&#20105;&#28216;&#25103;&#20013;&#30340;&#38382;&#39064;&#65292;&#24182;&#24471;&#21040;&#20102;&#31283;&#20581;&#26368;&#20248;&#30340;&#35299;&#20915;&#26041;&#27861;&#12290;</title><link>http://arxiv.org/abs/2202.10883</link><description>&lt;p&gt;
&#28216;&#25103;&#20013;&#30340;&#20449;&#24687;&#35774;&#35745;: &#35748;&#35777;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Information Design in Games: Certification Approach. (arXiv:2202.10883v3 [econ.TH] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2202.10883
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#35748;&#35777;&#26041;&#27861;&#65292;&#29992;&#20110;&#28216;&#25103;&#20013;&#30340;&#20449;&#24687;&#35774;&#35745;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#22312;&#35774;&#35745;&#24072;&#26399;&#26395;&#30340;&#36125;&#21494;&#26031;&#32435;&#20160;&#22343;&#34913;&#20013;&#35825;&#23548;&#20986;&#26469;&#30340;&#20449;&#24687;&#32467;&#26500;&#20063;&#21487;&#20197;&#36890;&#36807;&#36741;&#21161;&#21512;&#21516;&#38382;&#39064;&#35825;&#23548;&#20986;&#26469;&#12290;&#35813;&#26041;&#27861;&#36866;&#29992;&#20110;&#35299;&#20915;&#25237;&#36164;&#28216;&#25103;&#21644;&#20215;&#26684;&#31454;&#20105;&#28216;&#25103;&#20013;&#30340;&#38382;&#39064;&#65292;&#24182;&#24471;&#21040;&#20102;&#31283;&#20581;&#26368;&#20248;&#30340;&#35299;&#20915;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22810;&#20010;&#21442;&#19982;&#32773;&#22312;&#20855;&#26377;&#36830;&#32493;&#21160;&#20316;&#30340;&#28216;&#25103;&#20013;&#21442;&#19982;&#12290;&#35774;&#35745;&#24072;&#36873;&#25321;&#19968;&#31181;&#20449;&#24687;&#32467;&#26500;--&#19968;&#20010;&#29366;&#24577;&#21644;&#31169;&#26377;&#20449;&#21495;&#30340;&#32852;&#21512;&#20998;&#24067;&#65292;&#24182;&#26681;&#25454;&#22312;&#24341;&#36215;&#36125;&#21494;&#26031;&#32435;&#20160;&#22343;&#34913;&#20013;&#30340;&#39044;&#26399;&#35774;&#35745;&#24072;&#22238;&#25253;&#26469;&#35780;&#20272;&#23427;&#12290;&#25105;&#20204;&#34920;&#26126;&#65292;&#24403;&#20449;&#24687;&#32467;&#26500;&#36824;&#21487;&#20197;&#22312;&#36741;&#21161;&#21512;&#21516;&#38382;&#39064;&#20013;&#35825;&#23548;&#20986;&#32435;&#20160;&#22343;&#34913;&#26102;&#65292;&#35813;&#20449;&#24687;&#32467;&#26500;&#26159;&#35774;&#35745;&#24072;&#26368;&#20248;&#30340;&#12290;&#36825;&#19968;&#21457;&#29616;&#24341;&#21457;&#20102;&#19968;&#20010;&#21487;&#22788;&#29702;&#30340;&#35299;&#20915;&#26041;&#27861;&#65292;&#25105;&#20204;&#29992;&#23427;&#26469;&#30740;&#31350;&#20004;&#20010;&#26032;&#30340;&#24212;&#29992;&#12290;&#22312;&#19968;&#20010;&#25237;&#36164;&#28216;&#25103;&#20013;&#65292;&#26368;&#20248;&#32467;&#26500;&#21521;&#21333;&#20010;&#25237;&#36164;&#32773;&#25552;&#20379;&#23436;&#20840;&#20449;&#24687;&#65292;&#20294;&#23545;&#20854;&#20182;&#25237;&#36164;&#32773;&#19981;&#25552;&#20379;&#20219;&#20309;&#20449;&#24687;&#12290;&#36825;&#31181;&#32467;&#26500;&#22312;&#20219;&#20309;&#29366;&#24577;&#20998;&#24067;&#21644;&#25237;&#36164;&#32773;&#25968;&#37327;&#19979;&#37117;&#26159;&#31283;&#20581;&#26368;&#20248;&#30340;&#12290;&#22312;&#19968;&#20010;&#20215;&#26684;&#31454;&#20105;&#28216;&#25103;&#20013;&#65292;&#26368;&#20248;&#32467;&#26500;&#26159;&#39640;&#26031;&#30340;&#65292;&#24182;&#19988;&#22312;&#29366;&#24577;&#20013;&#32447;&#24615;&#25512;&#33616;&#20215;&#26684;&#12290;&#36825;&#31181;&#32467;&#26500;&#26159;&#21807;&#19968;&#26368;&#20248;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
Several players participate in a game with a continuum of actions. A designer chooses an information structure -- a joint distribution of a state and private signals -- and evaluates it according to the expected designer's payoff in the induced Bayes Nash equilibrium. We show an information structure is designer-optimal whenever the equilibrium play it induces can also be induced in an auxiliary contracting problem.  This finding gives rise to a tractable solution method, which we use to study two novel applications. In an investment game, an optimal structure fully informs a single investor while providing no information to others. This structure is robustly optimal, for any state distribution and number of investors. In a price competition game, an optimal structure is Gaussian and recommends prices linearly in the state. This structure is uniquely optimal.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#38750;&#21442;&#25968;&#22238;&#24402;&#20013;&#30340;&#30456;&#21464;&#38382;&#39064;&#65292;&#26681;&#25454;&#26368;&#23567;&#26497;&#22823;MISE&#36895;&#29575;&#30340;&#19981;&#21516;&#24773;&#20917;&#65292;&#30830;&#23450;&#20102;&#19981;&#21516;&#33539;&#22260;&#20869;&#26368;&#20339;&#30340;&#24179;&#28369;&#24230;&#12290;&#21516;&#26102;&#65292;&#26412;&#25991;&#36824;&#25552;&#20986;&#20102;&#19968;&#32452;&#29992;&#20110;&#24179;&#28369;&#20989;&#25968;&#31867;&#21035;&#30340;&#24230;&#37327;&#29109;&#30028;&#38480;&#12290;</title><link>http://arxiv.org/abs/2112.03626</link><description>&lt;p&gt;
&#38750;&#21442;&#25968;&#22238;&#24402;&#20013;&#30340;&#30456;&#21464;
&lt;/p&gt;
&lt;p&gt;
Phase transitions in nonparametric regressions. (arXiv:2112.03626v6 [math.ST] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2112.03626
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#38750;&#21442;&#25968;&#22238;&#24402;&#20013;&#30340;&#30456;&#21464;&#38382;&#39064;&#65292;&#26681;&#25454;&#26368;&#23567;&#26497;&#22823;MISE&#36895;&#29575;&#30340;&#19981;&#21516;&#24773;&#20917;&#65292;&#30830;&#23450;&#20102;&#19981;&#21516;&#33539;&#22260;&#20869;&#26368;&#20339;&#30340;&#24179;&#28369;&#24230;&#12290;&#21516;&#26102;&#65292;&#26412;&#25991;&#36824;&#25552;&#20986;&#20102;&#19968;&#32452;&#29992;&#20110;&#24179;&#28369;&#20989;&#25968;&#31867;&#21035;&#30340;&#24230;&#37327;&#29109;&#30028;&#38480;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24403;&#24050;&#30693;&#21333;&#21464;&#37327;&#30340;&#26410;&#30693;&#22238;&#24402;&#20989;&#25968;&#30340;&#23548;&#25968;&#22312;&#32477;&#23545;&#20540;&#19978;&#30452;&#21040;$(\gamma+1)$&#38454;&#37117;&#21463;&#21040;&#19968;&#20010;&#20844;&#20849;&#24120;&#25968;&#30340;&#30028;&#38480;&#65288;&#21363;$(\gamma+1)$&#38454;&#24179;&#28369;&#24230;&#65289;&#65292;&#25991;&#29486;&#20013;&#32473;&#20986;&#30340;&#22343;&#26041;&#35823;&#24046;&#65288;MISE&#65289;&#30340;&#26368;&#23567;&#26497;&#22823;&#36895;&#29575;&#20026;$\left(\frac{1}{n}\right)^{\frac{2\gamma+2}{2\gamma+3}}$&#12290;&#26412;&#25991;&#34920;&#26126;&#65306;&#65288;i&#65289;&#22914;&#26524;$n\leq\left(\gamma+1\right)^{2\gamma+3}$&#65292;&#21017;&#26368;&#23567;&#26497;&#22823;MISE&#36895;&#29575;&#20026;$\frac{\log n}{n\log(\log n)}$&#65292;&#24182;&#19988;&#26368;&#20339;&#21033;&#29992;&#30340;&#24179;&#28369;&#24230;&#20026;&#22823;&#32422;$\max\left\{ \left\lfloor \frac{\log n}{2\log\left(\log n\right)}\right\rfloor ,\,1\right\}$&#65307;&#65288;ii&#65289;&#22914;&#26524;$n&gt;\left(\gamma+1\right)^{2\gamma+3}$&#65292;&#21017;&#26368;&#23567;&#26497;&#22823;MISE&#36895;&#29575;&#20026;$\left(\frac{1}{n}\right)^{\frac{2\gamma+2}{2\gamma+3}}$&#65292;&#24182;&#19988;&#26368;&#20339;&#21033;&#29992;&#30340;&#24179;&#28369;&#24230;&#20026;$\gamma+1$&#12290;&#26412;&#25991;&#30340;&#22522;&#26412;&#36129;&#29486;&#26159;&#25105;&#20204;&#20026;&#24179;&#28369;&#20989;&#25968;&#31867;&#21035;&#21046;&#23450;&#30340;&#19968;&#32452;&#24230;&#37327;&#29109;&#30028;&#38480;&#12290;
&lt;/p&gt;
&lt;p&gt;
When the unknown regression function of a single variable is known to have derivatives up to the $(\gamma+1)$th order bounded in absolute values by a common constant everywhere or a.e. (i.e., $(\gamma+1)$th degree of smoothness), the minimax optimal rate of the mean integrated squared error (MISE) is stated as $\left(\frac{1}{n}\right)^{\frac{2\gamma+2}{2\gamma+3}}$ in the literature. This paper shows that: (i) if $n\leq\left(\gamma+1\right)^{2\gamma+3}$, the minimax optimal MISE rate is $\frac{\log n}{n\log(\log n)}$ and the optimal degree of smoothness to exploit is roughly $\max\left\{ \left\lfloor \frac{\log n}{2\log\left(\log n\right)}\right\rfloor ,\,1\right\} $; (ii) if $n&gt;\left(\gamma+1\right)^{2\gamma+3}$, the minimax optimal MISE rate is $\left(\frac{1}{n}\right)^{\frac{2\gamma+2}{2\gamma+3}}$ and the optimal degree of smoothness to exploit is $\gamma+1$. The fundamental contribution of this paper is a set of metric entropy bounds we develop for smooth function classes. Some 
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#22522;&#20110;&#25581;&#31034;&#24615;&#20559;&#22909;&#30340;&#23130;&#23035;&#31283;&#23450;&#24615;&#21051;&#30011;&#65292;&#26126;&#30830;&#32771;&#34385;&#20102;&#35843;&#33410;&#23130;&#23035;&#35299;&#25955;&#30340;&#31163;&#23130;&#27861;&#24459;&#19979;&#30340;&#20114;&#24847;&#31163;&#23130;&#65292;&#20026;&#20102;&#35780;&#20272;&#35813;&#21051;&#30011;&#22312;&#30830;&#23450;&#23478;&#24237;&#20869;&#28040;&#36153;&#26041;&#38754;&#30340;&#28508;&#21147;&#65292;&#36824;&#36827;&#34892;&#20102;&#27169;&#25311;&#23454;&#39564;&#12290;</title><link>http://arxiv.org/abs/2110.10781</link><description>&lt;p&gt;
&#22522;&#20110;&#25581;&#31034;&#24615;&#20559;&#22909;&#30340;&#20114;&#24847;&#31163;&#23130;&#19979;&#23130;&#23035;&#31283;&#23450;&#24615;&#30340;&#21051;&#30011;
&lt;/p&gt;
&lt;p&gt;
Revealed preference characterization of marital stability under mutual consent divorce. (arXiv:2110.10781v3 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2110.10781
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#22522;&#20110;&#25581;&#31034;&#24615;&#20559;&#22909;&#30340;&#23130;&#23035;&#31283;&#23450;&#24615;&#21051;&#30011;&#65292;&#26126;&#30830;&#32771;&#34385;&#20102;&#35843;&#33410;&#23130;&#23035;&#35299;&#25955;&#30340;&#31163;&#23130;&#27861;&#24459;&#19979;&#30340;&#20114;&#24847;&#31163;&#23130;&#65292;&#20026;&#20102;&#35780;&#20272;&#35813;&#21051;&#30011;&#22312;&#30830;&#23450;&#23478;&#24237;&#20869;&#28040;&#36153;&#26041;&#38754;&#30340;&#28508;&#21147;&#65292;&#36824;&#36827;&#34892;&#20102;&#27169;&#25311;&#23454;&#39564;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#22522;&#20110;&#25581;&#31034;&#24615;&#20559;&#22909;&#30340;&#23130;&#23035;&#31283;&#23450;&#24615;&#21051;&#30011;&#65292;&#26126;&#30830;&#32771;&#34385;&#20102;&#35843;&#33410;&#23130;&#23035;&#35299;&#25955;&#30340;&#31163;&#23130;&#27861;&#24459;&#12290;&#25105;&#20204;&#37325;&#28857;&#30740;&#31350;&#20102;&#20114;&#24847;&#31163;&#23130;&#65292;&#21363;&#24403;&#20107;&#20154;&#21482;&#26377;&#22312;&#33719;&#24471;&#20102;&#23545;&#26041;&#30340;&#21516;&#24847;&#26102;&#25165;&#33021;&#31163;&#23130;&#12290;&#25105;&#20204;&#25552;&#20379;&#29702;&#35770;&#35265;&#35299;&#65292;&#25506;&#35752;&#20102;&#35813;&#21051;&#30011;&#22312;&#30830;&#23450;&#23478;&#24237;&#20869;&#28040;&#36153;&#26041;&#38754;&#30340;&#28508;&#21147;&#12290;&#25105;&#20204;&#20351;&#29992;&#20174;&#8220;&#31038;&#20250;&#31185;&#23398;&#30340;&#32593;&#32476;&#21270;&#32437;&#21521;&#30740;&#31350;&#8221;&#65288;LISS&#65289;&#23567;&#32452;&#25277;&#21462;&#30340;&#23478;&#24237;&#25968;&#25454;&#36827;&#34892;&#27169;&#25311;&#23454;&#39564;&#65292;&#32467;&#26524;&#25903;&#25345;&#20102;&#25105;&#20204;&#30340;&#29702;&#35770;&#21457;&#29616;&#12290;
&lt;/p&gt;
&lt;p&gt;
We present a revealed preference characterization of marital stability explicitly accounting for the divorce law governing marital dissolution. We focus on mutual consent divorce, where individuals can divorce their partner only if they can obtain their consent. We provide theoretical insights into the potential of the characterization for identifying intrahousehold consumption. Simulation exercises using household data drawn from the Longitudinal Internet Studies for the Social Sciences (LISS) panel support our theoretical findings.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#27809;&#26377;&#36716;&#31227;&#30340;&#22810;&#23545;&#19968;&#21452;&#36793;&#21305;&#37197;&#20013;&#30340;&#35782;&#21035;&#21644;&#20272;&#35745;&#65292;&#36890;&#36807;&#21333;&#20010;&#24066;&#22330;&#30340;&#25968;&#25454;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#22312;&#35266;&#27979;&#21040;&#30340;&#31283;&#23450;&#21305;&#37197;&#26465;&#20214;&#19979;&#65292;&#21452;&#26041;&#20559;&#22909;&#30340;&#38750;&#21442;&#25968;&#35782;&#21035;&#12290;&#22312;&#24212;&#29992;&#20110;&#23454;&#38469;&#25968;&#25454;&#26102;&#65292;&#36890;&#36807;Monte Carlo&#27169;&#25311;&#65292;&#25105;&#20204;&#21457;&#29616;&#24102;&#26377;Gibbs&#37319;&#26679;&#22120;&#30340;&#21442;&#25968;&#36125;&#21494;&#26031;&#26041;&#27861;&#22312;&#23454;&#38469;&#35268;&#27169;&#38382;&#39064;&#20013;&#34920;&#29616;&#33391;&#22909;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#22312;&#26234;&#21033;&#30340;&#20844;&#31435;&#21644;&#31169;&#31435;&#23398;&#26657;&#20013;&#24212;&#29992;&#20102;&#25105;&#20204;&#30340;&#26041;&#27861;&#65292;&#24182;&#23545;&#24179;&#26435;&#25919;&#31574;&#36827;&#34892;&#20102;&#21453;&#20107;&#23454;&#20998;&#26512;&#12290;</title><link>http://arxiv.org/abs/2104.02009</link><description>&lt;p&gt;
&#27809;&#26377;&#36716;&#31227;&#30340;&#22810;&#23545;&#19968;&#21452;&#36793;&#21305;&#37197;&#20013;&#30340;&#35782;&#21035;&#21644;&#20272;&#35745;
&lt;/p&gt;
&lt;p&gt;
Identification and Estimation in Many-to-one Two-sided Matching without Transfers. (arXiv:2104.02009v3 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2104.02009
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#27809;&#26377;&#36716;&#31227;&#30340;&#22810;&#23545;&#19968;&#21452;&#36793;&#21305;&#37197;&#20013;&#30340;&#35782;&#21035;&#21644;&#20272;&#35745;&#65292;&#36890;&#36807;&#21333;&#20010;&#24066;&#22330;&#30340;&#25968;&#25454;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#22312;&#35266;&#27979;&#21040;&#30340;&#31283;&#23450;&#21305;&#37197;&#26465;&#20214;&#19979;&#65292;&#21452;&#26041;&#20559;&#22909;&#30340;&#38750;&#21442;&#25968;&#35782;&#21035;&#12290;&#22312;&#24212;&#29992;&#20110;&#23454;&#38469;&#25968;&#25454;&#26102;&#65292;&#36890;&#36807;Monte Carlo&#27169;&#25311;&#65292;&#25105;&#20204;&#21457;&#29616;&#24102;&#26377;Gibbs&#37319;&#26679;&#22120;&#30340;&#21442;&#25968;&#36125;&#21494;&#26031;&#26041;&#27861;&#22312;&#23454;&#38469;&#35268;&#27169;&#38382;&#39064;&#20013;&#34920;&#29616;&#33391;&#22909;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#22312;&#26234;&#21033;&#30340;&#20844;&#31435;&#21644;&#31169;&#31435;&#23398;&#26657;&#20013;&#24212;&#29992;&#20102;&#25105;&#20204;&#30340;&#26041;&#27861;&#65292;&#24182;&#23545;&#24179;&#26435;&#25919;&#31574;&#36827;&#34892;&#20102;&#21453;&#20107;&#23454;&#20998;&#26512;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#27809;&#26377;&#21487;&#36716;&#35753;&#25928;&#29992;&#30340;&#22810;&#23545;&#19968;&#21452;&#36793;&#21305;&#37197;&#22330;&#26223;&#20013;&#65292;&#20363;&#22914;&#22823;&#23398;&#25307;&#29983;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#22312;&#19968;&#20010;&#21333;&#20010;&#24066;&#22330;&#25968;&#25454;&#19979;&#65292;&#21452;&#26041;&#20559;&#22909;&#30340;&#35782;&#21035;&#26465;&#20214;&#12290;&#19981;&#35770;&#24066;&#22330;&#26159;&#38598;&#20013;&#24335;&#36824;&#26159;&#20998;&#25955;&#24335;&#65292;&#25105;&#20204;&#20551;&#35774;&#35266;&#27979;&#21040;&#30340;&#21305;&#37197;&#26159;&#31283;&#23450;&#30340;&#24773;&#20917;&#19979;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#22312;&#29305;&#23450;&#25490;&#38500;&#38480;&#21046;&#26465;&#20214;&#19979;&#65292;&#23545;&#21452;&#26041;&#20559;&#22909;&#30340;&#38750;&#21442;&#25968;&#35782;&#21035;&#12290;&#20026;&#20102;&#23558;&#25105;&#20204;&#30340;&#32467;&#26524;&#24212;&#29992;&#20110;&#25968;&#25454;&#65292;&#25105;&#20204;&#20351;&#29992;&#20102;&#33945;&#29305;&#21345;&#27931;&#27169;&#25311;&#26469;&#35780;&#20272;&#19981;&#21516;&#30340;&#20272;&#35745;&#37327;&#65292;&#21253;&#25324;&#30452;&#25509;&#20174;&#35782;&#21035;&#20013;&#26500;&#24314;&#30340;&#20272;&#35745;&#37327;&#12290;&#25105;&#20204;&#21457;&#29616;&#22312;&#23454;&#38469;&#35268;&#27169;&#30340;&#38382;&#39064;&#20013;&#65292;&#24102;&#26377;Gibbs&#37319;&#26679;&#22120;&#30340;&#21442;&#25968;&#36125;&#21494;&#26031;&#26041;&#27861;&#25928;&#26524;&#33391;&#22909;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#22312;&#26234;&#21033;&#30340;&#20844;&#31435;&#21644;&#31169;&#31435;&#23398;&#26657;&#20013;&#38416;&#36848;&#20102;&#25105;&#20204;&#30340;&#26041;&#27861;&#65292;&#24182;&#23545;&#24179;&#26435;&#25919;&#31574;&#36827;&#34892;&#20102;&#21453;&#20107;&#23454;&#20998;&#26512;&#12290;
&lt;/p&gt;
&lt;p&gt;
In a setting of many-to-one two-sided matching with non-transferable utilities, e.g., college admissions, we study conditions under which preferences of both sides are identified with data on one single market. Regardless of whether the market is centralized or decentralized, assuming that the observed matching is stable, we show nonparametric identification of preferences of both sides under certain exclusion restrictions. To take our results to the data, we use Monte Carlo simulations to evaluate different estimators, including the ones that are directly constructed from the identification. We find that a parametric Bayesian approach with a Gibbs sampler works well in realistically sized problems. Finally, we illustrate our methodology in decentralized admissions to public and private schools in Chile and conduct a counterfactual analysis of an affirmative action policy.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#36890;&#36807;&#20351;&#29992;&#35821;&#20041;&#32593;&#32476;&#20998;&#26512;&#26469;&#39044;&#27979;&#37329;&#34701;&#24066;&#22330;&#65292;&#22522;&#20110;&#26032;&#30340;&#25991;&#26412;&#25968;&#25454;&#25351;&#26631;&#65292;&#35780;&#20272;&#32463;&#27982;&#30456;&#20851;&#20851;&#38190;&#35789;&#30340;&#37325;&#35201;&#24615;&#65292;&#24182;&#24212;&#29992;&#20110;&#24847;&#22823;&#21033;&#32929;&#31080;&#21644;&#20538;&#21048;&#24066;&#22330;&#12290;&#30740;&#31350;&#32467;&#26524;&#26174;&#31034;&#65292;&#35813;&#25351;&#26631;&#33021;&#22815;&#24456;&#22909;&#22320;&#25429;&#25417;&#21040;&#37329;&#34701;&#26102;&#38388;&#24207;&#21015;&#30340;&#19981;&#21516;&#38454;&#27573;&#65292;&#24182;&#19988;&#23545;&#20110;&#20538;&#21048;&#24066;&#22330;&#25968;&#25454;&#21644;&#32929;&#31080;&#24066;&#22330;&#27874;&#21160;&#24615;&#37117;&#23384;&#22312;&#26126;&#26174;&#30340;&#21487;&#39044;&#27979;&#24615;&#12290;</title><link>http://arxiv.org/abs/2009.04975</link><description>&lt;p&gt;
&#22312;COVID-19&#21361;&#26426;&#20013;&#20351;&#29992;&#35821;&#20041;&#32593;&#32476;&#20998;&#26512;&#39044;&#27979;&#37329;&#34701;&#24066;&#22330;
&lt;/p&gt;
&lt;p&gt;
Forecasting financial markets with semantic network analysis in the COVID-19 crisis. (arXiv:2009.04975v4 [q-fin.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2009.04975
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36890;&#36807;&#20351;&#29992;&#35821;&#20041;&#32593;&#32476;&#20998;&#26512;&#26469;&#39044;&#27979;&#37329;&#34701;&#24066;&#22330;&#65292;&#22522;&#20110;&#26032;&#30340;&#25991;&#26412;&#25968;&#25454;&#25351;&#26631;&#65292;&#35780;&#20272;&#32463;&#27982;&#30456;&#20851;&#20851;&#38190;&#35789;&#30340;&#37325;&#35201;&#24615;&#65292;&#24182;&#24212;&#29992;&#20110;&#24847;&#22823;&#21033;&#32929;&#31080;&#21644;&#20538;&#21048;&#24066;&#22330;&#12290;&#30740;&#31350;&#32467;&#26524;&#26174;&#31034;&#65292;&#35813;&#25351;&#26631;&#33021;&#22815;&#24456;&#22909;&#22320;&#25429;&#25417;&#21040;&#37329;&#34701;&#26102;&#38388;&#24207;&#21015;&#30340;&#19981;&#21516;&#38454;&#27573;&#65292;&#24182;&#19988;&#23545;&#20110;&#20538;&#21048;&#24066;&#22330;&#25968;&#25454;&#21644;&#32929;&#31080;&#24066;&#22330;&#27874;&#21160;&#24615;&#37117;&#23384;&#22312;&#26126;&#26174;&#30340;&#21487;&#39044;&#27979;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20351;&#29992;&#19968;&#31181;&#26032;&#30340;&#25991;&#26412;&#25968;&#25454;&#25351;&#26631;&#26469;&#39044;&#27979;&#32929;&#31080;&#24066;&#22330;&#25968;&#25454;&#12290;&#35813;&#25351;&#26631;&#24212;&#29992;&#20110;&#22823;&#37327;&#26032;&#38395;&#20013;&#65292;&#35780;&#20272;&#25991;&#26412;&#20013;&#20986;&#29616;&#30340;&#19968;&#20010;&#25110;&#22810;&#20010;&#19982;&#32463;&#27982;&#30456;&#20851;&#30340;&#20851;&#38190;&#35789;&#30340;&#37325;&#35201;&#24615;&#12290;&#35813;&#25351;&#26631;&#26681;&#25454;&#20851;&#38190;&#35789;&#30340;&#20351;&#29992;&#39057;&#29575;&#21644;&#35821;&#20041;&#32593;&#32476;&#20301;&#32622;&#35780;&#20272;&#20854;&#37325;&#35201;&#24615;&#12290;&#25105;&#20204;&#23558;&#20854;&#24212;&#29992;&#20110;&#24847;&#22823;&#21033;&#26032;&#38395;&#65292;&#24182;&#26500;&#24314;&#25351;&#25968;&#26469;&#39044;&#27979;&#24847;&#22823;&#21033;&#32929;&#31080;&#21644;&#20538;&#21048;&#24066;&#22330;&#30340;&#22238;&#25253;&#29575;&#21644;&#27874;&#21160;&#24615;&#65292;&#21253;&#25324;COVID-19&#21361;&#26426;&#26399;&#38388;&#30340;&#25968;&#25454;&#12290;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;&#35813;&#25351;&#26631;&#24456;&#22909;&#22320;&#25429;&#25417;&#21040;&#37329;&#34701;&#26102;&#38388;&#24207;&#21015;&#30340;&#19981;&#21516;&#38454;&#27573;&#12290;&#27492;&#22806;&#65292;&#30740;&#31350;&#32467;&#26524;&#26174;&#31034;&#65292;&#20538;&#21048;&#24066;&#22330;&#25968;&#25454;&#65292;&#26080;&#35770;&#26159;&#22238;&#25253;&#29575;&#36824;&#26159;&#27874;&#21160;&#24615;&#65292;&#22312;&#30701;&#26399;&#21644;&#38271;&#26399;&#21040;&#26399;&#26085;&#20197;&#21450;&#32929;&#31080;&#24066;&#22330;&#27874;&#21160;&#24615;&#26041;&#38754;&#37117;&#23384;&#22312;&#26126;&#26174;&#30340;&#21487;&#39044;&#27979;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper uses a new textual data index for predicting stock market data. The index is applied to a large set of news to evaluate the importance of one or more general economic-related keywords appearing in the text. The index assesses the importance of the economic-related keywords, based on their frequency of use and semantic network position. We apply it to the Italian press and construct indices to predict Italian stock and bond market returns and volatilities in a recent sample period, including the COVID-19 crisis. The evidence shows that the index captures the different phases of financial time series well. Moreover, results indicate strong evidence of predictability for bond market data, both returns and volatilities, short and long maturities, and stock market volatility.
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#20171;&#32461;&#20102;Stata&#21253;Binsreg&#65292;&#35813;&#21253;&#23454;&#29616;&#20102;Binscatter&#26041;&#27861;&#65292;&#24182;&#25552;&#20379;&#20102;&#19971;&#20010;&#21629;&#20196;&#26469;&#36827;&#34892;&#22238;&#24402;&#20998;&#26512;&#12290;&#36825;&#20123;&#21629;&#20196;&#33021;&#22815;&#36827;&#34892;&#28857;&#20272;&#35745;&#12289;&#19981;&#30830;&#23450;&#24615;&#37327;&#21270;&#21644;&#25512;&#26029;&#27979;&#35797;&#65292;&#21516;&#26102;&#25552;&#20379;&#20102;&#20998;&#32452;&#25955;&#28857;&#22270;&#21644;&#22810;&#32452;&#32479;&#35745;&#27604;&#36739;&#12290;</title><link>http://arxiv.org/abs/1902.09615</link><description>&lt;p&gt;
Binscatter&#22238;&#24402;
&lt;/p&gt;
&lt;p&gt;
Binscatter Regressions. (arXiv:1902.09615v4 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/1902.09615
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#20171;&#32461;&#20102;Stata&#21253;Binsreg&#65292;&#35813;&#21253;&#23454;&#29616;&#20102;Binscatter&#26041;&#27861;&#65292;&#24182;&#25552;&#20379;&#20102;&#19971;&#20010;&#21629;&#20196;&#26469;&#36827;&#34892;&#22238;&#24402;&#20998;&#26512;&#12290;&#36825;&#20123;&#21629;&#20196;&#33021;&#22815;&#36827;&#34892;&#28857;&#20272;&#35745;&#12289;&#19981;&#30830;&#23450;&#24615;&#37327;&#21270;&#21644;&#25512;&#26029;&#27979;&#35797;&#65292;&#21516;&#26102;&#25552;&#20379;&#20102;&#20998;&#32452;&#25955;&#28857;&#22270;&#21644;&#22810;&#32452;&#32479;&#35745;&#27604;&#36739;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#20171;&#32461;&#20102;Stata&#36719;&#20214;&#21253;Binsreg&#65292;&#35813;&#36719;&#20214;&#21253;&#23454;&#29616;&#20102;Cattaneo&#12289;Crump&#12289;Farrell&#21644;Feng&#65288;2023a,b&#65289;&#24320;&#21457;&#30340;binscatter&#26041;&#27861;&#12290;&#35813;&#36719;&#20214;&#21253;&#21253;&#25324;&#19971;&#20010;&#21629;&#20196;&#65306;binsreg&#12289;binslogit&#12289;binsprobit&#12289;binsqreg&#12289;binstest&#12289;binspwc&#21644;binsregselect&#12290;&#21069;&#22235;&#20010;&#21629;&#20196;&#23454;&#29616;&#20102;&#22522;&#26412;&#21644;&#25193;&#23637;&#30340;&#26368;&#23567;&#20108;&#20056;binscatter&#22238;&#24402;&#65288;binsreg&#65289;&#30340;&#28857;&#20272;&#35745;&#21644;&#19981;&#30830;&#23450;&#24615;&#37327;&#21270;&#65288;&#32622;&#20449;&#21306;&#38388;&#21644;&#32622;&#20449;&#24102;&#65289;&#65292;&#20197;&#21450;&#24191;&#20041;&#38750;&#32447;&#24615;binscatter&#22238;&#24402;&#65288;binslogit&#29992;&#20110;Logit&#22238;&#24402;&#65292;binsprobit&#29992;&#20110;Probit&#22238;&#24402;&#65292;binsqreg&#29992;&#20110;&#20998;&#20301;&#25968;&#22238;&#24402;&#65289;&#12290;&#36825;&#20123;&#21629;&#20196;&#36824;&#25552;&#20379;&#20102;&#20998;&#32452;&#25955;&#28857;&#22270;&#65292;&#36866;&#29992;&#20110;&#21333;&#26679;&#26412;&#21644;&#22810;&#26679;&#26412;&#35774;&#32622;&#12290;&#21518;&#20004;&#20010;&#21629;&#20196;&#38598;&#20013;&#22312;&#28857;&#24577;&#21644;&#19968;&#33268;&#24615;&#25512;&#26029;&#26041;&#38754;&#65306;binstest&#23454;&#26045;&#20102;&#20851;&#20110;&#21442;&#25968;&#35774;&#23450;&#21644;&#26410;&#30693;&#22238;&#24402;&#20989;&#25968;&#30340;&#38750;&#21442;&#25968;&#24418;&#29366;&#38480;&#21046;&#30340;&#20551;&#35774;&#26816;&#39564;&#31243;&#24207;&#65292;&#32780;binspwc&#23454;&#26045;&#20102;&#22810;&#32452;&#25104;&#23545;&#32479;&#35745;&#27604;&#36739;&#12290;
&lt;/p&gt;
&lt;p&gt;
We introduce the Stata package Binsreg, which implements the binscatter methods developed in Cattaneo, Crump, Farrell and Feng (2023a,b). The package includes seven commands: binsreg, binslogit, binsprobit, binsqreg, binstest, binspwc, and binsregselect. The first four commands implement point estimation and uncertainty quantification (confidence intervals and confidence bands) for canonical and extended least squares binscatter regression (binsreg) as well as generalized nonlinear binscatter regression (binslogit for Logit regression, binsprobit for Probit regression, and binsqreg for quantile regression). These commands also offer binned scatter plots, allowing for one- and multi-sample settings. The next two commands focus on pointwise and uniform inference: binstest implements hypothesis testing procedures for parametric specifications and for nonparametric shape restrictions of the unknown regression function, while binspwc implements multi-group pairwise statistical comparisons. 
&lt;/p&gt;</description></item></channel></rss>