<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#20351;&#29992;&#26377;&#38480;&#28151;&#21512;&#27169;&#22411;&#21644;&#25511;&#21046;&#21327;&#21464;&#37327;&#26469;&#22788;&#29702;&#22788;&#29702;&#25928;&#24212;&#20998;&#24067;&#30340;&#26041;&#27861;&#12290;</title><link>https://arxiv.org/abs/2403.18503</link><description>&lt;p&gt;
&#20855;&#26377;&#26377;&#38480;&#28151;&#21512;&#30340;&#20998;&#24067;&#24335;&#22788;&#29702;&#25928;&#24212;
&lt;/p&gt;
&lt;p&gt;
Distributional Treatment Effect with Finite Mixture
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.18503
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#20351;&#29992;&#26377;&#38480;&#28151;&#21512;&#27169;&#22411;&#21644;&#25511;&#21046;&#21327;&#21464;&#37327;&#26469;&#22788;&#29702;&#22788;&#29702;&#25928;&#24212;&#20998;&#24067;&#30340;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22788;&#29702;&#25928;&#24212;&#30340;&#24322;&#36136;&#24615;&#22312;&#35780;&#20272;&#27835;&#30103;&#26102;&#38750;&#24120;&#37325;&#35201;&#12290;&#28982;&#32780;&#65292;&#21363;&#20351;&#22312;&#20108;&#20803;&#22788;&#29702;&#30340;&#31616;&#21333;&#24773;&#20917;&#19979;&#65292;&#30001;&#20110;&#25105;&#20204;&#26080;&#27861;&#35266;&#23519;&#21040;&#32473;&#23450;&#20010;&#20307;&#30340;&#24050;&#22788;&#29702;&#28508;&#22312;&#32467;&#26524;&#21644;&#26410;&#22788;&#29702;&#28508;&#22312;&#32467;&#26524;&#30340;&#22522;&#26412;&#38480;&#21046;&#65292;&#22788;&#29702;&#25928;&#24212;&#30340;&#20998;&#24067;&#20063;&#24456;&#38590;&#30830;&#23450;&#12290;&#26412;&#25991;&#22312;&#28508;&#22312;&#32467;&#26524;&#19978;&#20551;&#35774;&#20102;&#19968;&#20010;&#26377;&#38480;&#28151;&#21512;&#27169;&#22411;&#21644;&#19968;&#20010;&#25511;&#21046;&#21327;&#21464;&#37327;&#21521;&#37327;&#65292;&#20197;&#35299;&#20915;&#22788;&#29702;&#20869;&#29983;&#24615;&#65292;&#24182;&#23545;&#27599;&#31181;&#31867;&#22411;&#30340;&#28508;&#22312;&#32467;&#26524;&#21644;&#21327;&#21464;&#37327;&#26045;&#21152;&#20102;&#39532;&#23572;&#21487;&#22827;&#26465;&#20214;&#65292;&#20197;&#30830;&#23450;&#22788;&#29702;&#25928;&#24212;&#20998;&#24067;&#12290;&#26377;&#38480;&#28151;&#21512;&#27169;&#22411;&#30340;&#28151;&#21512;&#26435;&#37325;&#36890;&#36807;&#38750;&#36127;&#30697;&#38453;&#20998;&#35299;&#31639;&#27861;&#19968;&#33268;&#20272;&#35745;&#65292;&#20174;&#32780;&#20351;&#25105;&#20204;&#33021;&#22815;&#19968;&#33268;&#22320;&#20272;&#35745;&#32452;&#20214;&#20998;&#24067;&#21442;&#25968;&#65292;&#21253;&#25324;&#22788;&#29702;&#25928;&#24212;&#20998;&#24067;&#30340;&#21442;&#25968;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.18503v1 Announce Type: new  Abstract: Treatment effect heterogeneity is of a great concern when evaluating the treatment. However, even with a simple case of a binary treatment, the distribution of treatment effect is difficult to identify due to the fundamental limitation that we cannot observe both treated potential outcome and untreated potential outcome for a given individual. This paper assumes a finite mixture model on the potential outcomes and a vector of control covariates to address treatment endogeneity and imposes a Markov condition on the potential outcomes and covariates within each type to identify the treatment effect distribution. The mixture weights of the finite mixture model are consistently estimated with a nonnegative matrix factorization algorithm, thus allowing us to consistently estimate the component distribution parameters, including ones for the treatment effect distribution.
&lt;/p&gt;</description></item><item><title>&#30740;&#31350;&#20316;&#32773;&#36890;&#36807;&#24046;&#24322;&#20998;&#26512;&#33258;&#28982;&#23454;&#39564;&#21457;&#29616;&#65292;&#38750;&#27954;&#28023;&#24213;&#20114;&#32852;&#32593;&#30005;&#32518;&#30340;&#21040;&#26469;&#23545;&#20010;&#20154;&#21644;&#20225;&#19994;&#32423;&#23601;&#19994;&#20197;&#21450;&#22812;&#38388;&#20809;&#29031;&#25490;&#25918;&#20135;&#29983;&#20102;&#27491;&#38754;&#24433;&#21709;&#65292;&#20294;&#36825;&#20123;&#24433;&#21709;&#20027;&#35201;&#30001;&#20110;&#22320;&#29702;&#32534;&#30721;&#38169;&#35823;&#12289;&#21355;&#26143;&#26356;&#25442;&#24341;&#36215;&#30340;&#38388;&#26029;&#20197;&#21450;&#23545;&#24453;&#30103;&#21306;&#30340;&#23450;&#20041;&#19981;&#20934;&#30830;&#31561;&#21407;&#22240;&#32780;&#20135;&#29983;&#12290;</title><link>http://arxiv.org/abs/2401.13694</link><description>&lt;p&gt;
&#24555;&#36895;&#20114;&#32852;&#32593;&#30340;&#21040;&#26469;&#19982;&#38750;&#27954;&#23601;&#19994;&#65306;&#35780;&#35770;
&lt;/p&gt;
&lt;p&gt;
The Arrival of Fast Internet and Employment in Africa: Comment. (arXiv:2401.13694v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.13694
&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#20316;&#32773;&#36890;&#36807;&#24046;&#24322;&#20998;&#26512;&#33258;&#28982;&#23454;&#39564;&#21457;&#29616;&#65292;&#38750;&#27954;&#28023;&#24213;&#20114;&#32852;&#32593;&#30005;&#32518;&#30340;&#21040;&#26469;&#23545;&#20010;&#20154;&#21644;&#20225;&#19994;&#32423;&#23601;&#19994;&#20197;&#21450;&#22812;&#38388;&#20809;&#29031;&#25490;&#25918;&#20135;&#29983;&#20102;&#27491;&#38754;&#24433;&#21709;&#65292;&#20294;&#36825;&#20123;&#24433;&#21709;&#20027;&#35201;&#30001;&#20110;&#22320;&#29702;&#32534;&#30721;&#38169;&#35823;&#12289;&#21355;&#26143;&#26356;&#25442;&#24341;&#36215;&#30340;&#38388;&#26029;&#20197;&#21450;&#23545;&#24453;&#30103;&#21306;&#30340;&#23450;&#20041;&#19981;&#20934;&#30830;&#31561;&#21407;&#22240;&#32780;&#20135;&#29983;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
Hjort&#21644;Poulsen&#65288;2019&#65289;&#23558;&#20844;&#20803;2010&#24180;&#21069;&#21518;&#38750;&#27954;&#28023;&#23736;&#19978;&#30340;&#28023;&#24213;&#20114;&#32852;&#32593;&#30005;&#32518;&#30340;&#38169;&#20301;&#21040;&#36798;&#20316;&#20026;&#19968;&#31181;&#24046;&#24322;&#20998;&#26512;&#33258;&#28982;&#23454;&#39564;&#65292;&#30740;&#31350;&#20102;&#23485;&#24102;&#25509;&#20837;&#23545;&#20010;&#20154;&#21644;&#20225;&#19994;&#32423;&#23601;&#19994;&#20197;&#21450;&#22812;&#38388;&#20809;&#29031;&#25490;&#25918;&#30340;&#27491;&#38754;&#24433;&#21709;&#12290;&#26412;&#35770;&#25991;&#21457;&#29616;&#36825;&#20123;&#32467;&#26524;&#20027;&#35201;&#30001;&#20110;&#22320;&#29702;&#32534;&#30721;&#38169;&#35823;&#12289;2009&#24180;&#24213;&#21355;&#26143;&#26356;&#25442;&#24341;&#36215;&#30340;&#38388;&#26029;&#20197;&#21450;&#19968;&#20010;&#23545;&#24453;&#30103;&#21306;&#30340;&#23450;&#20041;&#19981;&#28165;&#26224;&#30340;&#25216;&#26415;&#22522;&#30784;&#12289;&#27604;&#20960;&#20046;&#25152;&#26377;&#25968;&#25454;&#26469;&#28304;&#30340;&#31354;&#38388;&#20998;&#36776;&#29575;&#31364;&#65292;&#19988;&#23545;&#23485;&#24102;&#21487;&#29992;&#24615;&#22320;&#29702;&#20998;&#24067;&#30340;&#20195;&#34920;&#24615;&#36739;&#24369;&#12290;
&lt;/p&gt;
&lt;p&gt;
Hjort and Poulsen (2019) frames the staggered arrival of submarine Internet cables on the shores of Africa circa 2010 as a difference-in-differences natural experiment in broadband access. The paper finds positive impacts on individual- and firm-level employment and nighttime light emissions. These results are largely ascribable to geocoding errors; to discontinuities from a satellite changeover at end-2009; and to a definition of the treated zone that has unclear technological basis, is narrower than the spatial resolution of nearly all the data sources, and is weakly representative of the geography of broadband availability.
&lt;/p&gt;</description></item></channel></rss>