<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#35813;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#21019;&#26032;&#26041;&#27861; UN--DID&#65292;&#29992;&#20110;&#20272;&#35745;&#20855;&#26377;&#19981;&#21487;&#28151;&#21512;&#25968;&#25454;&#30340;&#24046;&#24322;&#20013;&#30340;&#24046;&#24322;&#65292;&#24182;&#36890;&#36807;&#35843;&#25972;&#38468;&#21152;&#21327;&#21464;&#37327;&#12289;&#22810;&#32452;&#21644;&#38169;&#24320;&#37319;&#32435;&#26469;&#25552;&#20379;&#26377;&#20851;&#21463;&#35797;&#32773;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#65288;ATT&#65289;&#30340;&#20272;&#35745;&#12290;</title><link>https://arxiv.org/abs/2403.15910</link><description>&lt;p&gt;
&#20855;&#26377;&#19981;&#21487;&#28151;&#21512;&#25968;&#25454;&#30340;&#24046;&#24322;&#20013;&#30340;&#24046;&#24322;
&lt;/p&gt;
&lt;p&gt;
Difference-in-Differences with Unpoolable Data
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.15910
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#21019;&#26032;&#26041;&#27861; UN--DID&#65292;&#29992;&#20110;&#20272;&#35745;&#20855;&#26377;&#19981;&#21487;&#28151;&#21512;&#25968;&#25454;&#30340;&#24046;&#24322;&#20013;&#30340;&#24046;&#24322;&#65292;&#24182;&#36890;&#36807;&#35843;&#25972;&#38468;&#21152;&#21327;&#21464;&#37327;&#12289;&#22810;&#32452;&#21644;&#38169;&#24320;&#37319;&#32435;&#26469;&#25552;&#20379;&#26377;&#20851;&#21463;&#35797;&#32773;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#65288;ATT&#65289;&#30340;&#20272;&#35745;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#26412;&#30740;&#31350;&#20013;&#65292;&#25105;&#20204;&#30830;&#23450;&#24182;&#25918;&#23485;&#20102;&#24046;&#24322;&#20013;&#30340;&#24046;&#24322;&#65288;DID&#65289;&#20272;&#35745;&#20013;&#25968;&#25454;&#8220;&#21487;&#28151;&#21512;&#24615;&#8221;&#30340;&#20551;&#35774;&#12290;&#30001;&#20110;&#25968;&#25454;&#38544;&#31169;&#38382;&#39064;&#65292;&#24448;&#24448;&#26080;&#27861;&#32452;&#21512;&#26469;&#33258;&#21463;&#35797;&#32773;&#21644;&#23545;&#29031;&#32452;&#30340;&#35266;&#27979;&#25968;&#25454;&#65292;&#22240;&#27492;&#21487;&#28151;&#21512;&#24615;&#19981;&#21487;&#34892;&#12290;&#20363;&#22914;&#65292;&#23384;&#20648;&#22312;&#23433;&#20840;&#35774;&#26045;&#20013;&#30340;&#34892;&#25919;&#20581;&#24247;&#25968;&#25454;&#24448;&#24448;&#26080;&#27861;&#36328;&#19981;&#21516;&#21496;&#27861;&#31649;&#36758;&#21306;&#32452;&#21512;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#21019;&#26032;&#26041;&#27861;&#26469;&#20272;&#35745;&#20855;&#26377;&#19981;&#21487;&#28151;&#21512;&#25968;&#25454;&#30340;DID&#65306;UN--DID&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#21253;&#25324;&#23545;&#38468;&#21152;&#21327;&#21464;&#37327;&#12289;&#22810;&#32452;&#21644;&#38169;&#24320;&#37319;&#32435;&#36827;&#34892;&#35843;&#25972;&#12290;&#22312;&#27809;&#26377;&#21327;&#21464;&#37327;&#30340;&#24773;&#20917;&#19979;&#65292;UN--DID&#21644;&#20256;&#32479;DID&#32473;&#20986;&#20102;&#30456;&#21516;&#30340;&#21463;&#35797;&#32773;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#65288;ATT&#65289;&#20272;&#35745;&#12290;&#26377;&#21327;&#21464;&#37327;&#26102;&#65292;&#25105;&#20204;&#36890;&#36807;&#25968;&#23398;&#21644;&#27169;&#25311;&#34920;&#26126;UN--DID&#21644;&#20256;&#32479;DID&#25552;&#20379;&#20102;&#19981;&#21516;&#20294;&#21516;&#26679;&#20449;&#24687;&#20016;&#23500;&#30340;ATT&#20272;&#35745;&#12290;&#19968;&#20010;&#23454;&#35777;&#31034;&#20363;&#36827;&#19968;&#27493;&#24378;&#35843;&#20102;&#25105;&#20204;&#26041;&#27861;&#30340;&#23454;&#29992;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.15910v1 Announce Type: new  Abstract: In this study, we identify and relax the assumption of data "poolability" in difference-in-differences (DID) estimation. Poolability, or the combination of observations from treated and control units into one dataset, is often not possible due to data privacy concerns. For instance, administrative health data stored in secure facilities is often not combinable across jurisdictions. We propose an innovative approach to estimate DID with unpoolable data: UN--DID. Our method incorporates adjustments for additional covariates, multiple groups, and staggered adoption. Without covariates, UN--DID and conventional DID give identical estimates of the average treatment effect on the treated (ATT). With covariates, we show mathematically and through simulations that UN--DID and conventional DID provide different, but equally informative, estimates of the ATT. An empirical example further underscores the utility of our methodology. The UN--DID meth
&lt;/p&gt;</description></item><item><title>&#30740;&#31350;&#21457;&#29616;&#22312;&#25919;&#31574;&#23454;&#26045;&#20013;&#65292;&#25919;&#27835;&#23478;&#21644;&#23448;&#20698;&#20043;&#38388;&#30340;&#20114;&#21160;&#22312;&#36873;&#20030;&#28608;&#21169;&#19979;&#20250;&#20135;&#29983;&#35752;&#22909;&#34892;&#20026;&#65292;&#19981;&#21516;&#31867;&#22411;&#30340;&#23448;&#20698;&#23545;&#27492;&#26377;&#19981;&#21516;&#24577;&#24230;&#65292;&#20998;&#26512;&#26174;&#31034;&#23448;&#20698;&#20027;&#20041;&#30340;&#24433;&#21709;&#31243;&#24230;&#33021;&#22815;&#26368;&#22823;&#21270;&#36873;&#27665;&#31119;&#21033;&#12290;</title><link>https://arxiv.org/abs/2402.17526</link><description>&lt;p&gt;
&#25919;&#27835;&#35752;&#22909;&#21644;&#23448;&#20698;&#20027;&#20041;&#24433;&#21709;
&lt;/p&gt;
&lt;p&gt;
Political Pandering and Bureaucratic Influence
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.17526
&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#21457;&#29616;&#22312;&#25919;&#31574;&#23454;&#26045;&#20013;&#65292;&#25919;&#27835;&#23478;&#21644;&#23448;&#20698;&#20043;&#38388;&#30340;&#20114;&#21160;&#22312;&#36873;&#20030;&#28608;&#21169;&#19979;&#20250;&#20135;&#29983;&#35752;&#22909;&#34892;&#20026;&#65292;&#19981;&#21516;&#31867;&#22411;&#30340;&#23448;&#20698;&#23545;&#27492;&#26377;&#19981;&#21516;&#24577;&#24230;&#65292;&#20998;&#26512;&#26174;&#31034;&#23448;&#20698;&#20027;&#20041;&#30340;&#24433;&#21709;&#31243;&#24230;&#33021;&#22815;&#26368;&#22823;&#21270;&#36873;&#27665;&#31119;&#21033;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#36873;&#20030;&#28608;&#21169;&#20135;&#29983;&#35752;&#22909;&#34892;&#20026;&#30340;&#29615;&#22659;&#20013;&#65292;&#23448;&#20698;&#20027;&#20041;&#23545;&#25919;&#31574;&#23454;&#26045;&#30340;&#24433;&#21709;&#12290;&#36890;&#36807;&#21457;&#23637;&#19968;&#20010;&#20004;&#26399;&#27169;&#22411;&#26469;&#20998;&#26512;&#25919;&#27835;&#23478;&#21644;&#23448;&#20698;&#20043;&#38388;&#30340;&#20114;&#21160;&#65292;&#20182;&#20204;&#34987;&#20998;&#31867;&#20026;&#19982;&#36873;&#27665;&#20559;&#22909;&#25919;&#31574;&#30456;&#19968;&#33268;&#30340;&#23545;&#40784;&#22411;&#25110;&#32773;&#24847;&#22270;&#21046;&#23450;&#26377;&#21033;&#20110;&#31934;&#33521;&#38598;&#22242;&#30340;&#25919;&#31574;&#30340;&#23448;&#20698;&#12290;&#30740;&#31350;&#32467;&#26524;&#25581;&#31034;&#20102;&#22312;&#23545;&#40784;&#30340;&#25919;&#27835;&#23478;&#35785;&#35832;&#20110;&#35752;&#22909;&#30340;&#22343;&#34913;&#29366;&#24577;&#65292;&#32780;&#23545;&#40784;&#30340;&#23448;&#20698;&#21017;&#25903;&#25345;&#25110;&#21453;&#23545;&#36825;&#31181;&#34892;&#20026;&#12290;&#20998;&#26512;&#36827;&#19968;&#27493;&#34920;&#26126;&#65292;&#26681;&#25454;&#21442;&#25968;&#30340;&#19981;&#21516;&#65292;&#23448;&#20698;&#20027;&#20041;&#30340;&#20219;&#20309;&#31243;&#24230;&#37117;&#21487;&#33021;&#20351;&#36873;&#27665;&#30340;&#31119;&#21033;&#26368;&#22823;&#21270;&#65292;&#33539;&#22260;&#20174;&#20840;&#33021;&#30340;&#21040;&#26080;&#21147;&#30340;&#23448;&#20698;&#20307;&#31995;&#24773;&#26223;&#37117;&#26377;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.17526v1 Announce Type: new  Abstract: This paper examines the impact of bureaucracy on policy implementation in environments where electoral incentives generate pandering. A two-period model is developed to analyze the interactions between politicians and bureaucrats, who are categorized as either aligned -- sharing the voters' preferences over policies -- or intent on enacting policies that favor elite groups. The findings reveal equilibria in which aligned politicians resort to pandering, whereas aligned bureaucrats either support or oppose such behavior. The analysis further indicates that, depending on parameters, any level of bureaucratic influence can maximize the voters' welfare, ranging from scenarios with an all-powerful to a toothless bureaucracy.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#20010;&#20851;&#20110;&#27604;&#36739;&#22797;&#26434;&#24615;&#30340;&#29702;&#35770;&#65292;&#24182;&#35777;&#26126;&#20102;&#27604;&#36739;&#22797;&#26434;&#24615;&#23548;&#33268;&#36873;&#25321;&#38169;&#35823;&#21644;&#31995;&#32479;&#24615;&#38169;&#35823;&#12290;&#25105;&#20204;&#30340;&#27169;&#22411;&#34920;&#26126;&#65292;&#36873;&#39033;&#30340;&#30456;&#20284;&#24615;&#21644;&#25509;&#36817;&#25903;&#37197;&#24230;&#26159;&#24433;&#21709;&#27604;&#36739;&#22797;&#26434;&#24615;&#30340;&#20004;&#20010;&#37325;&#35201;&#22240;&#32032;&#12290;&#35813;&#30740;&#31350;&#30340;&#23454;&#35777;&#32467;&#26524;&#36824;&#34920;&#26126;&#65292;&#27604;&#36739;&#22797;&#26434;&#24615;&#24230;&#37327;&#21487;&#20197;&#39044;&#27979;&#36873;&#25321;&#38169;&#35823;&#12289;&#36873;&#25321;&#19981;&#19968;&#33268;&#20197;&#21450;&#35748;&#30693;&#19981;&#30830;&#23450;&#24615;&#65292;&#24182;&#21487;&#20197;&#35299;&#37322;&#36873;&#25321;&#21644;&#35780;&#20272;&#20013;&#30340;&#32463;&#20856;&#24322;&#24120;&#29616;&#35937;&#12290;</title><link>https://arxiv.org/abs/2401.17578</link><description>&lt;p&gt;
&#30456;&#20284;&#24615;&#21644;&#27604;&#36739;&#30340;&#22797;&#26434;&#24615;
&lt;/p&gt;
&lt;p&gt;
Similarity and Comparison Complexity
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2401.17578
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#20010;&#20851;&#20110;&#27604;&#36739;&#22797;&#26434;&#24615;&#30340;&#29702;&#35770;&#65292;&#24182;&#35777;&#26126;&#20102;&#27604;&#36739;&#22797;&#26434;&#24615;&#23548;&#33268;&#36873;&#25321;&#38169;&#35823;&#21644;&#31995;&#32479;&#24615;&#38169;&#35823;&#12290;&#25105;&#20204;&#30340;&#27169;&#22411;&#34920;&#26126;&#65292;&#36873;&#39033;&#30340;&#30456;&#20284;&#24615;&#21644;&#25509;&#36817;&#25903;&#37197;&#24230;&#26159;&#24433;&#21709;&#27604;&#36739;&#22797;&#26434;&#24615;&#30340;&#20004;&#20010;&#37325;&#35201;&#22240;&#32032;&#12290;&#35813;&#30740;&#31350;&#30340;&#23454;&#35777;&#32467;&#26524;&#36824;&#34920;&#26126;&#65292;&#27604;&#36739;&#22797;&#26434;&#24615;&#24230;&#37327;&#21487;&#20197;&#39044;&#27979;&#36873;&#25321;&#38169;&#35823;&#12289;&#36873;&#25321;&#19981;&#19968;&#33268;&#20197;&#21450;&#35748;&#30693;&#19981;&#30830;&#23450;&#24615;&#65292;&#24182;&#21487;&#20197;&#35299;&#37322;&#36873;&#25321;&#21644;&#35780;&#20272;&#20013;&#30340;&#32463;&#20856;&#24322;&#24120;&#29616;&#35937;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#19968;&#20123;&#36873;&#25321;&#36873;&#39033;&#27604;&#20854;&#20182;&#36873;&#39033;&#26356;&#38590;&#27604;&#36739;&#12290;&#26412;&#25991;&#24314;&#31435;&#20102;&#19968;&#20010;&#20851;&#20110;&#20160;&#20040;&#23548;&#33268;&#27604;&#36739;&#22797;&#26434;&#20197;&#21450;&#27604;&#36739;&#22797;&#26434;&#22914;&#20309;&#22312;&#36873;&#25321;&#20013;&#20135;&#29983;&#31995;&#32479;&#24615;&#38169;&#35823;&#30340;&#29702;&#35770;&#12290;&#22312;&#25105;&#20204;&#30340;&#27169;&#22411;&#20013;&#65292;&#24403;&#36873;&#39033;&#20849;&#20139;&#30456;&#20284;&#29305;&#24449;&#65288;&#22312;&#22266;&#23450;&#20215;&#20540;&#24046;&#24322;&#30340;&#24773;&#20917;&#19979;&#65289;&#19988;&#26356;&#25509;&#36817;&#25903;&#37197;&#26102;&#65292;&#27604;&#36739;&#26356;&#23481;&#26131;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#22914;&#20309;&#22312;&#22810;&#23646;&#24615;&#12289;&#24425;&#31080;&#21644;&#26102;&#38388;&#38388;&#38548;&#36873;&#25321;&#39046;&#22495;&#36890;&#36807;&#36825;&#20004;&#20010;&#20551;&#35774;&#24471;&#20986;&#21487;&#25805;&#20316;&#30340;&#27604;&#36739;&#22797;&#26434;&#24615;&#24230;&#37327;&#12290;&#20351;&#29992;&#20851;&#20110;&#20108;&#20803;&#36873;&#25321;&#30340;&#23454;&#39564;&#25968;&#25454;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#25105;&#20204;&#30340;&#22797;&#26434;&#24615;&#24230;&#37327;&#21487;&#20197;&#39044;&#27979;&#36873;&#25321;&#38169;&#35823;&#12289;&#36873;&#25321;&#19981;&#19968;&#33268;&#20197;&#21450;&#35748;&#30693;&#19981;&#30830;&#23450;&#24615;&#22312;&#36825;&#19977;&#20010;&#39046;&#22495;&#20013;&#30340;&#23384;&#22312;&#12290;&#28982;&#21518;&#25105;&#20204;&#23637;&#31034;&#20102;&#22312;&#36873;&#25321;&#21644;&#35780;&#20272;&#20013;&#30340;&#32463;&#20856;&#24322;&#24120;&#29616;&#35937;&#65292;&#35832;&#22914;&#24773;&#22659;&#25928;&#24212;&#12289;&#20559;&#22909;&#36870;&#36716;&#20197;&#21450;&#22312;&#23545;&#20882;&#38505;&#21644;&#26102;&#38388;&#38388;&#38548;&#21069;&#26223;&#30340;&#35780;&#20272;&#20013;&#34920;&#29616;&#20986;&#30340;&#26126;&#26174;&#27010;&#29575;&#21152;&#26435;&#21644;&#26102;&#38388;&#20559;&#24046;&#65292;&#21487;&#20197;&#34987;&#29702;&#35299;&#20026;&#23545;&#27604;&#36739;&#22797;&#26434;&#24615;&#30340;&#21453;&#24212;&#12290;
&lt;/p&gt;
&lt;p&gt;
Some choice options are more difficult to compare than others. This paper develops a theory of what makes a comparison complex, and how comparison complexity generates systematic mistakes in choice. In our model, options are easier to compare when they 1) share similar features, holding fixed their value difference, and 2) are closer to dominance. We show how these two postulates yield tractable measures of comparison complexity in the domains of multiattribute, lottery, and intertemporal choice. Using experimental data on binary choices, we demonstrate that our complexity measures predict choice errors, choice inconsistency, and cognitive uncertainty across all three domains. We then show how canonical anomalies in choice and valuation, such as context effects, preference reversals, and apparent probability weighting and present bias in the valuation of risky and intertemporal prospects, can be understood as responses to comparison complexity.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#36890;&#36807;&#25918;&#26494;&#24179;&#34892;&#36235;&#21183;&#20551;&#35774;&#24182;&#21033;&#29992;&#19968;&#20010;&#26497;&#20540;&#20998;&#31867;&#22120;&#23545;&#28508;&#22312;&#31867;&#22411;&#36827;&#34892;&#20272;&#35745;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#31867;&#22411;&#29305;&#23450;&#30340;&#24046;&#24322;&#27861;&#20272;&#35745;&#22120;&#29992;&#20110;&#20272;&#35745;&#31867;&#22411;&#29305;&#23450;CATT&#65292;&#30740;&#31350;&#20102;&#22788;&#29702;&#25928;&#24212;&#20013;&#30340;&#24322;&#36136;&#24615;&#12290;</title><link>https://arxiv.org/abs/2204.02346</link><description>&lt;p&gt;
&#20107;&#20214;&#30740;&#31350;&#20013;&#30340;&#26377;&#38480;&#24322;&#36136;&#22788;&#29702;&#25928;&#24212;
&lt;/p&gt;
&lt;p&gt;
Finitely Heterogeneous Treatment Effect in Event-study
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2204.02346
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36890;&#36807;&#25918;&#26494;&#24179;&#34892;&#36235;&#21183;&#20551;&#35774;&#24182;&#21033;&#29992;&#19968;&#20010;&#26497;&#20540;&#20998;&#31867;&#22120;&#23545;&#28508;&#22312;&#31867;&#22411;&#36827;&#34892;&#20272;&#35745;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#31867;&#22411;&#29305;&#23450;&#30340;&#24046;&#24322;&#27861;&#20272;&#35745;&#22120;&#29992;&#20110;&#20272;&#35745;&#31867;&#22411;&#29305;&#23450;CATT&#65292;&#30740;&#31350;&#20102;&#22788;&#29702;&#25928;&#24212;&#20013;&#30340;&#24322;&#36136;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20107;&#20214;&#30740;&#31350;&#35774;&#35745;&#20013;&#24046;&#24322;&#27604;&#36739;&#27861;&#30340;&#20851;&#38190;&#20551;&#35774;&#26159;&#26410;&#22788;&#29702;&#28508;&#22312;&#32467;&#26524;&#24046;&#24322;&#19982;&#22788;&#29702;&#26102;&#38388;&#30340;&#22343;&#20540;&#29420;&#31435;&#24615;&#65306;&#24179;&#34892;&#36235;&#21183;&#20551;&#35774;&#12290;&#26412;&#25991;&#36890;&#36807;&#20551;&#35774;&#19968;&#20010;&#28508;&#22312;&#30340;&#31867;&#22411;&#21464;&#37327;&#65292;&#24182;&#24320;&#21457;&#20102;&#19968;&#31181;&#31867;&#22411;&#29305;&#23450;&#30340;&#24179;&#34892;&#36235;&#21183;&#20551;&#35774;&#26469;&#25918;&#26494;&#24179;&#34892;&#36235;&#21183;&#20551;&#35774;&#12290;&#22312;&#23545;&#28508;&#22312;&#31867;&#22411;&#21464;&#37327;&#26377;&#38480;&#25903;&#25345;&#30340;&#20551;&#35774;&#19979;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#19968;&#20010;&#26497;&#20540;&#20998;&#31867;&#22120;&#33021;&#22815;&#19968;&#33268;&#22320;&#20272;&#35745;&#31867;&#22411;&#20998;&#37197;&#12290;&#22522;&#20110;&#20998;&#31867;&#32467;&#26524;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#31867;&#22411;&#29305;&#23450;&#30340;&#24046;&#24322;&#27861;&#20272;&#35745;&#22120;&#29992;&#20110;&#31867;&#22411;&#29305;&#23450;CATT&#30340;&#20272;&#35745;&#12290;&#36890;&#36807;&#23545;&#28508;&#22312;&#31867;&#22411;&#20272;&#35745;CATT&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#22788;&#29702;&#25928;&#24212;&#20013;&#30340;&#24322;&#36136;&#24615;&#65292;&#38500;&#20102;&#22522;&#32447;&#32467;&#26524;&#20013;&#30340;&#24322;&#36136;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
The key assumption of the differences-in-differences approach in the event-study design is that untreated potential outcome differences are mean independent of treatment timing: the parallel trend assumption. In this paper, we relax the parallel trend assumption by assuming a latent type variable and developing a type-specific parallel trend assumption. With a finite support assumption on the latent type variable, we show that an extremum classifier consistently estimates the type assignment. Based on the classification result, we propose a type-specific diff-in-diff estimator for type-specific CATT. By estimating the CATT with regard to the latent type, we study heterogeneity in treatment effect, in addition to heterogeneity in baseline outcomes.
&lt;/p&gt;</description></item><item><title>&#20840;&#29699;&#22823;&#37096;&#20998;&#22320;&#21306;&#20173;&#28982;&#32570;&#20047;&#36275;&#22815;&#25968;&#37327;&#30340;&#20581;&#24247;&#39135;&#29289;&#65292;&#29305;&#21035;&#26159;&#27700;&#26524;&#12289;&#34092;&#33756;&#12289;&#35910;&#31867;&#21644;&#22362;&#26524;&#12289;&#31181;&#23376;&#26041;&#38754;&#23384;&#22312;&#24040;&#22823;&#19981;&#36275;&#65292;&#32780;&#19988;&#21508;&#20010;&#22320;&#21306;&#23545;&#21160;&#29289;&#28304;&#24615;&#39135;&#29289;&#30340;&#20351;&#29992;&#23384;&#22312;&#24040;&#22823;&#30340;&#24046;&#24322;&#12290;&#26410;&#26469;&#30340;&#39044;&#27979;&#26174;&#31034;&#65292;&#38500;&#20102;&#22686;&#21152;&#20892;&#20135;&#21697;&#20379;&#24212;&#30340;&#25237;&#36164;&#22806;&#65292;&#36824;&#38656;&#35201;&#22686;&#21152;&#36141;&#20080;&#21147;&#21644;&#23545;&#26410;&#20805;&#20998;&#28040;&#36153;&#30340;&#39135;&#29289;&#31867;&#21035;&#30340;&#38656;&#27714;&#12290;</title><link>http://arxiv.org/abs/2401.01080</link><description>&lt;p&gt;
&#20840;&#29699;&#39135;&#29289;&#20379;&#24212;&#22312;&#20581;&#24247;&#39278;&#39135;&#26041;&#38754;&#23384;&#22312;&#21738;&#20123;&#19981;&#36275;&#65306;1961-2020&#24180;&#21644;2010-2050&#24180;&#30340;&#21382;&#21490;&#36235;&#21183;&#21644;&#26410;&#26469;&#39044;&#27979;
&lt;/p&gt;
&lt;p&gt;
How and where global food supplies fall short of healthy diets: Past trends and future projections, 1961-2020 and 2010-2050. (arXiv:2401.01080v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.01080
&lt;/p&gt;
&lt;p&gt;
&#20840;&#29699;&#22823;&#37096;&#20998;&#22320;&#21306;&#20173;&#28982;&#32570;&#20047;&#36275;&#22815;&#25968;&#37327;&#30340;&#20581;&#24247;&#39135;&#29289;&#65292;&#29305;&#21035;&#26159;&#27700;&#26524;&#12289;&#34092;&#33756;&#12289;&#35910;&#31867;&#21644;&#22362;&#26524;&#12289;&#31181;&#23376;&#26041;&#38754;&#23384;&#22312;&#24040;&#22823;&#19981;&#36275;&#65292;&#32780;&#19988;&#21508;&#20010;&#22320;&#21306;&#23545;&#21160;&#29289;&#28304;&#24615;&#39135;&#29289;&#30340;&#20351;&#29992;&#23384;&#22312;&#24040;&#22823;&#30340;&#24046;&#24322;&#12290;&#26410;&#26469;&#30340;&#39044;&#27979;&#26174;&#31034;&#65292;&#38500;&#20102;&#22686;&#21152;&#20892;&#20135;&#21697;&#20379;&#24212;&#30340;&#25237;&#36164;&#22806;&#65292;&#36824;&#38656;&#35201;&#22686;&#21152;&#36141;&#20080;&#21147;&#21644;&#23545;&#26410;&#20805;&#20998;&#28040;&#36153;&#30340;&#39135;&#29289;&#31867;&#21035;&#30340;&#38656;&#27714;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20840;&#29699;&#22823;&#37096;&#20998;&#22320;&#21306;&#20173;&#28982;&#32570;&#20047;&#36275;&#22815;&#25968;&#37327;&#30340;&#25152;&#26377;&#39135;&#29289;&#31867;&#21035;&#65292;&#20197;&#20415;&#36807;&#19978;&#31215;&#26497;&#20581;&#24247;&#30340;&#29983;&#27963;&#12290;&#26412;&#30740;&#31350;&#36861;&#36394;&#20840;&#29699;&#39135;&#29289;&#31995;&#32479;&#22312;&#19982;&#32852;&#21512;&#22269;&#26426;&#26500;&#21644;&#19990;&#30028;&#38134;&#34892;&#29992;&#20110;&#30417;&#27979;&#20840;&#29699;&#20581;&#24247;&#39278;&#39135;&#25104;&#26412;&#21644;&#21487;&#25903;&#20184;&#24615;&#30340;&#26032;&#20581;&#24247;&#39278;&#39135;&#31726;&#23376;&#65288;HDB&#65289;&#30340;&#19968;&#33268;&#24615;&#26041;&#38754;&#30340;&#21382;&#21490;&#21644;&#39044;&#35745;&#21464;&#21270;&#12290;&#25105;&#20204;&#20351;&#29992;HDB&#20316;&#20026;&#26631;&#20934;&#34913;&#37327;&#22269;&#23478;&#12289;&#22320;&#21306;&#21644;&#20840;&#29699;&#20379;&#38656;&#24179;&#34913;&#30340;&#20805;&#36275;&#24615;&#65292;&#21457;&#29616;&#22312;&#19982;&#33203;&#39135;&#25351;&#21335;&#26356;&#21152;&#25509;&#36817;&#30340;&#26041;&#21521;&#19978;&#21462;&#24471;&#20102;&#23454;&#36136;&#24615;&#20294;&#19981;&#19968;&#33268;&#30340;&#36827;&#23637;&#65292;&#20840;&#29699;&#27700;&#26524;&#12289;&#34092;&#33756;&#12289;&#35910;&#31867;&#21644;&#22362;&#26524;&#12289;&#31181;&#23376;&#26041;&#38754;&#23384;&#22312;&#24040;&#22823;&#30340;&#19981;&#36275;&#65292;&#21508;&#20010;&#22320;&#21306;&#22312;&#21160;&#29289;&#28304;&#24615;&#39135;&#29289;&#30340;&#28040;&#36153;&#19978;&#23384;&#22312;&#24040;&#22823;&#30340;&#24046;&#24322;&#12290;&#39044;&#27979;&#26174;&#31034;&#65292;&#39069;&#22806;&#30340;&#25237;&#36164;&#20110;&#20892;&#20135;&#21697;&#20379;&#24212;&#23558;&#22312;&#26368;&#20005;&#37325;&#30340;&#19981;&#36275;&#22320;&#21306;&#30053;&#24494;&#21152;&#24555;&#20805;&#36275;&#24615;&#25913;&#21892;&#65292;&#25581;&#31034;&#20102;&#38656;&#35201;&#36890;&#36807;&#25552;&#39640;&#36141;&#20080;&#21147;&#21644;&#23545;&#26410;&#20805;&#20998;&#28040;&#36153;&#30340;&#39135;&#29289;&#31867;&#21035;&#38656;&#27714;&#30340;&#34917;&#20805;&#24615;&#25237;&#36164;&#12290;
&lt;/p&gt;
&lt;p&gt;
Most of the world still lacks access to sufficient quantities of all food groups needed for an active and healthy life. This study traces historical and projected changes in global food systems toward alignment with the new Healthy Diet Basket (HDB) used by UN agencies and the World Bank to monitor the cost and affordability of healthy diets worldwide. We use HDB as a standard to measure adequacy of national, regional and global supply-demand balances, finding substantial but inconsistent progress toward closer alignment with dietary guidelines, with large global shortfalls in fruits, vegetables, and legumes, nuts, and seeds, and large disparities among regions in use of animal source foods. Projections show that additional investments in the supply of agricultural products would modestly accelerate improvements in adequacy where shortfalls are greatest, revealing the need for complementary investments to increase purchasing power and demand for under-consumed food groups especially in
&lt;/p&gt;</description></item><item><title>&#35813;&#30740;&#31350;&#27604;&#36739;&#20102;&#21360;&#24230;15&#20010;&#37030;&#22312;1981-2011&#24180;&#26399;&#38388;&#22478;&#20065;&#35782;&#23383;&#29575;&#30340;&#24046;&#24322;&#65292;&#24182;&#30740;&#31350;&#20102;&#20943;&#23569;&#22478;&#20065;&#25945;&#32946;&#19981;&#24179;&#31561;&#30340;&#22240;&#32032;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#23613;&#31649;&#35782;&#23383;&#24046;&#36317;&#22312;&#20943;&#23567;&#65292;&#20294;2011&#24180;&#23433;&#24471;&#25289;&#37030;&#12289;&#20013;&#22830;&#37030;&#12289;&#21476;&#21513;&#25289;&#29305;&#37030;&#12289;&#22885;&#37324;&#33832;&#37030;&#12289;&#39532;&#21704;&#25289;&#26045;&#29305;&#25289;&#37030;&#29978;&#33267;&#21345;&#32435;&#22612;&#20811;&#37030;&#22312;&#22478;&#20065;&#25945;&#32946;&#26041;&#38754;&#20173;&#38754;&#20020;&#36739;&#39640;&#30340;&#19981;&#24179;&#31561;&#12290;&#27492;&#22806;&#65292;&#30740;&#31350;&#36824;&#25351;&#20986;&#65292;&#20892;&#26449;&#22919;&#22899;&#29983;&#32946;&#29575;&#30340;&#38477;&#20302;&#21644;&#20892;&#26449;&#22899;&#24615;21&#23681;&#21518;&#23130;&#23035;&#30340;&#27604;&#20363;&#36739;&#39640;&#21487;&#20197;&#20943;&#23569;&#22478;&#20065;&#22320;&#21306;&#30340;&#35782;&#23383;&#24046;&#36317;&#12290;</title><link>http://arxiv.org/abs/2307.16238</link><description>&lt;p&gt;
&#21360;&#24230;&#32972;&#26223;&#19979;&#25945;&#32946;&#27700;&#24179;&#30340;&#19981;&#24179;&#31561;&#65306;&#22478;&#20065;&#27604;&#36739;
&lt;/p&gt;
&lt;p&gt;
Inequality in Educational Attainment: Urban-Rural Comparison in the Indian Context. (arXiv:2307.16238v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.16238
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#27604;&#36739;&#20102;&#21360;&#24230;15&#20010;&#37030;&#22312;1981-2011&#24180;&#26399;&#38388;&#22478;&#20065;&#35782;&#23383;&#29575;&#30340;&#24046;&#24322;&#65292;&#24182;&#30740;&#31350;&#20102;&#20943;&#23569;&#22478;&#20065;&#25945;&#32946;&#19981;&#24179;&#31561;&#30340;&#22240;&#32032;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#23613;&#31649;&#35782;&#23383;&#24046;&#36317;&#22312;&#20943;&#23567;&#65292;&#20294;2011&#24180;&#23433;&#24471;&#25289;&#37030;&#12289;&#20013;&#22830;&#37030;&#12289;&#21476;&#21513;&#25289;&#29305;&#37030;&#12289;&#22885;&#37324;&#33832;&#37030;&#12289;&#39532;&#21704;&#25289;&#26045;&#29305;&#25289;&#37030;&#29978;&#33267;&#21345;&#32435;&#22612;&#20811;&#37030;&#22312;&#22478;&#20065;&#25945;&#32946;&#26041;&#38754;&#20173;&#38754;&#20020;&#36739;&#39640;&#30340;&#19981;&#24179;&#31561;&#12290;&#27492;&#22806;&#65292;&#30740;&#31350;&#36824;&#25351;&#20986;&#65292;&#20892;&#26449;&#22919;&#22899;&#29983;&#32946;&#29575;&#30340;&#38477;&#20302;&#21644;&#20892;&#26449;&#22899;&#24615;21&#23681;&#21518;&#23130;&#23035;&#30340;&#27604;&#20363;&#36739;&#39640;&#21487;&#20197;&#20943;&#23569;&#22478;&#20065;&#22320;&#21306;&#30340;&#35782;&#23383;&#24046;&#36317;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#35797;&#22270;&#27604;&#36739;&#21360;&#24230;&#36873;&#23450;&#30340;15&#20010;&#37030;&#22312;1981-2011&#24180;&#26399;&#38388;&#22478;&#20065;&#35782;&#23383;&#29575;&#65292;&#24182;&#25506;&#35752;&#20943;&#23569;&#22478;&#20065;&#25945;&#32946;&#21462;&#24471;&#24046;&#24322;&#30340;&#24037;&#20855;&#12290;&#30740;&#31350;&#26500;&#24314;&#20102;Sopher&#30340;&#22478;&#20065;&#24046;&#24322;&#35782;&#23383;&#25351;&#25968;&#65292;&#20998;&#26512;&#20102;&#21360;&#24230;15&#20010;&#37030;&#30340;&#35782;&#23383;&#24046;&#36317;&#36235;&#21183;&#12290;&#23613;&#31649;&#35782;&#23383;&#24046;&#36317;&#38543;&#30528;&#26102;&#38388;&#30340;&#25512;&#31227;&#26377;&#25152;&#20943;&#23567;&#65292;&#20294;Sopher&#25351;&#25968;&#26174;&#31034;&#65292;2011&#24180;&#23433;&#24471;&#25289;&#37030;&#12289;&#20013;&#22830;&#37030;&#12289;&#21476;&#21513;&#25289;&#29305;&#37030;&#12289;&#22885;&#37324;&#33832;&#37030;&#12289;&#39532;&#21704;&#25289;&#26045;&#29305;&#25289;&#37030;&#29978;&#33267;&#21345;&#32435;&#22612;&#20811;&#37030;&#22312;&#22478;&#20065;&#25945;&#32946;&#26041;&#38754;&#38754;&#20020;&#36739;&#39640;&#30340;&#19981;&#24179;&#31561;&#12290;&#27492;&#22806;&#65292;&#26412;&#30740;&#31350;&#36824;&#24212;&#29992;&#20102;&#22266;&#23450;&#25928;&#24212;&#38754;&#26495;&#25968;&#25454;&#22238;&#24402;&#25216;&#26415;&#65292;&#20197;&#30830;&#23450;&#24433;&#21709;&#22478;&#20065;&#25945;&#32946;&#19981;&#24179;&#31561;&#30340;&#22240;&#32032;&#12290;&#27169;&#22411;&#34920;&#26126;&#65292;&#20197;&#19979;&#22240;&#32032;&#21487;&#20197;&#20943;&#23569;&#21360;&#24230;&#22478;&#20065;&#22320;&#21306;&#20043;&#38388;&#30340;&#35782;&#23383;&#24046;&#36317;&#65306;&#20892;&#26449;&#22919;&#22899;&#29983;&#32946;&#29575;&#20302;&#65292;&#20892;&#26449;&#22899;&#24615;21&#23681;&#21518;&#23130;&#23035;&#30340;&#27604;&#20363;&#36739;&#39640;&#12290;
&lt;/p&gt;
&lt;p&gt;
The article tries to compare urban and rural literacy of fifteen selected Indian states during 1981 - 2011 and explores the instruments which can reduce the disparity in urban and rural educational attainment. The study constructs Sopher's urban-rural differential literacy index to analyze the trends of literacy disparity across fifteen states in India over time. Although literacy disparity has decreased over time, Sopher's index shows that the states of Andhra Pradesh, Madhya Pradesh, Gujarat, Odisha, Maharashtra and even Karnataka faced high inequality in education between urban and rural India in 2011. Additionally, the Fixed Effect panel data regression technique has been applied in the study to identify the factors which influence urban-rural inequality in education. The model shows that the following factors can reduce literacy disparity between urban and rural areas of India: low fertility rate in rural women, higher percentages of rural females marrying after the age of 21 year
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#36890;&#29992;&#30340;&#26032;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#32467;&#21512;&#20102;&#26377;&#20851;&#20195;&#29702;&#31867;&#22411;&#30340;&#20391;&#38754;&#20449;&#24687;&#65292;&#24182;&#20855;&#26377;&#21516;&#26102;&#29983;&#25104;&#39640;&#31038;&#20250;&#31119;&#21033;&#21644;&#39640;&#25910;&#20837;&#30340;&#21452;&#30446;&#26631;&#35201;&#27714;&#65292;&#20854;&#20013;&#22522;&#20110;&#26368;&#24369;&#31454;&#20105;&#32773;&#27010;&#24565;&#30340;&#26032;&#39062;&#26500;&#36896;&#25551;&#36848;&#20102;&#20803;&#26426;&#21046;&#30340;&#29305;&#24615;&#12290;</title><link>http://arxiv.org/abs/2302.14234</link><description>&lt;p&gt;
&#20855;&#26377;&#20391;&#38754;&#20449;&#24687;&#30340;&#21452;&#30446;&#26631;&#22810;&#32500;&#26426;&#21046;&#35774;&#35745;
&lt;/p&gt;
&lt;p&gt;
Bicriteria Multidimensional Mechanism Design with Side Information. (arXiv:2302.14234v3 [cs.GT] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2302.14234
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#36890;&#29992;&#30340;&#26032;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#32467;&#21512;&#20102;&#26377;&#20851;&#20195;&#29702;&#31867;&#22411;&#30340;&#20391;&#38754;&#20449;&#24687;&#65292;&#24182;&#20855;&#26377;&#21516;&#26102;&#29983;&#25104;&#39640;&#31038;&#20250;&#31119;&#21033;&#21644;&#39640;&#25910;&#20837;&#30340;&#21452;&#30446;&#26631;&#35201;&#27714;&#65292;&#20854;&#20013;&#22522;&#20110;&#26368;&#24369;&#31454;&#20105;&#32773;&#27010;&#24565;&#30340;&#26032;&#39062;&#26500;&#36896;&#25551;&#36848;&#20102;&#20803;&#26426;&#21046;&#30340;&#29305;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#31181;&#36866;&#29992;&#20110;&#22810;&#32500;&#26426;&#21046;&#35774;&#35745;&#30340;&#36890;&#29992;&#26032;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#32467;&#21512;&#20102;&#26377;&#20851;&#20195;&#29702;&#31867;&#22411;&#30340;&#20391;&#38754;&#20449;&#24687;&#65292;&#20855;&#26377;&#21516;&#26102;&#29983;&#25104;&#39640;&#31038;&#20250;&#31119;&#21033;&#21644;&#39640;&#25910;&#20837;&#30340;&#21452;&#30446;&#26631;&#35201;&#27714;&#12290;&#20391;&#38754;&#20449;&#24687;&#21487;&#20197;&#26469;&#33258;&#21508;&#31181;&#26469;&#28304;----&#20363;&#22914;&#65292;&#26469;&#33258;&#39046;&#22495;&#19987;&#23478;&#30340;&#24314;&#35758;&#65292;&#21382;&#21490;&#20195;&#29702;&#25968;&#25454;&#35757;&#32451;&#30340;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#30340;&#39044;&#27979;&#65292;&#29978;&#33267;&#26159;&#26426;&#21046;&#35774;&#35745;&#24072;&#33258;&#24049;&#30340;&#30452;&#35273;----&#22312;&#23454;&#36341;&#20013;&#36825;&#31867;&#20449;&#24687;&#24456;&#20016;&#23500;&#12290;&#26412;&#25991;&#37319;&#29992;&#19981;&#32771;&#34385;&#20391;&#38754;&#20449;&#24687;&#27491;&#30830;&#24615;&#12289;&#20934;&#30830;&#24615;&#25110;&#26469;&#28304;&#30340;&#20808;&#39564;&#35270;&#35282;&#12290;&#39318;&#20808;&#65292;&#25105;&#20204;&#35774;&#35745;&#20102;&#19968;&#20010;&#20803;&#26426;&#21046;&#65292;&#23558;&#36755;&#20837;&#30340;&#20391;&#38754;&#20449;&#24687;&#19982;&#20256;&#32479;VCG&#26426;&#21046;&#30340;&#25913;&#36827;&#30456;&#32467;&#21512;&#12290;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#20123;&#26032;&#39062;&#26500;&#36896;&#65292;&#20197;&#26368;&#24369;&#31454;&#20105;&#32773;&#30340;&#27010;&#24565;&#20026;&#22522;&#30784;&#65292;&#23545;&#25105;&#20204;&#30340;&#20803;&#26426;&#21046;&#30340;&#31119;&#21033;&#12289;&#25910;&#20837;&#21644;&#28608;&#21169;&#29305;&#24615;&#36827;&#34892;&#20102;&#25551;&#36848;&#65292;&#26368;&#24369;&#31454;&#20105;&#32773;&#26159;&#23545;&#31119;&#21033;&#24433;&#21709;&#26368;&#23567;&#30340;&#20195;&#29702;&#12290;
&lt;/p&gt;
&lt;p&gt;
We develop a versatile new methodology for multidimensional mechanism design that incorporates side information about agent types with the bicriteria goal of generating high social welfare and high revenue simultaneously. Side information can come from a variety of sources -- examples include advice from a domain expert, predictions from a machine-learning model trained on historical agent data, or even the mechanism designer's own gut instinct -- and in practice such sources are abundant. In this paper we adopt a prior-free perspective that makes no assumptions on the correctness, accuracy, or source of the side information. First, we design a meta-mechanism that integrates input side information with an improvement of the classical VCG mechanism. The welfare, revenue, and incentive properties of our meta-mechanism are characterized by a number of novel constructions we introduce based on the notion of a weakest competitor, which is an agent that has the smallest impact on welfare. We
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#21452;&#37325;&#40065;&#26834;&#36125;&#21494;&#26031;&#25512;&#26029;&#31243;&#24207;&#65292;&#23454;&#29616;&#20102;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#30340;&#20559;&#24046;&#26657;&#27491;&#24182;&#24418;&#25104;&#20102;&#21487;&#20449;&#21306;&#38388;&#12290;</title><link>http://arxiv.org/abs/2211.16298</link><description>&lt;p&gt;
&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#30340;&#21452;&#37325;&#40065;&#26834;&#36125;&#21494;&#26031;&#25512;&#26029;
&lt;/p&gt;
&lt;p&gt;
Double Robust Bayesian Inference on Average Treatment Effects. (arXiv:2211.16298v3 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2211.16298
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#21452;&#37325;&#40065;&#26834;&#36125;&#21494;&#26031;&#25512;&#26029;&#31243;&#24207;&#65292;&#23454;&#29616;&#20102;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#30340;&#20559;&#24046;&#26657;&#27491;&#24182;&#24418;&#25104;&#20102;&#21487;&#20449;&#21306;&#38388;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#26080;&#20559;&#24615;&#19979;&#30340;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#65288;ATE&#65289;&#30340;&#21452;&#37325;&#40065;&#26834;&#36125;&#21494;&#26031;&#25512;&#26029;&#31243;&#24207;&#12290;&#25105;&#20204;&#30340;&#40065;&#26834;&#36125;&#21494;&#26031;&#26041;&#27861;&#21253;&#25324;&#20004;&#20010;&#35843;&#25972;&#27493;&#39588;&#65306;&#39318;&#20808;&#65292;&#25105;&#20204;&#23545;&#26465;&#20214;&#22343;&#20540;&#20989;&#25968;&#30340;&#20808;&#39564;&#20998;&#24067;&#36827;&#34892;&#26657;&#27491;&#65307;&#20854;&#27425;&#65292;&#25105;&#20204;&#22312;&#20135;&#29983;&#30340;ATE&#30340;&#21518;&#39564;&#20998;&#24067;&#19978;&#24341;&#20837;&#19968;&#20010;&#37325;&#26032;&#23621;&#20013;&#26415;&#35821;&#12290;&#25105;&#20204;&#36890;&#36807;&#24314;&#31435;&#21452;&#37325;&#40065;&#26834;&#24615;&#19979;&#30340;&#21322;&#21442;&#25968;Bernstein-von Mises&#23450;&#29702;&#65292;&#35777;&#26126;&#20102;&#25105;&#20204;&#30340;&#36125;&#21494;&#26031;&#20272;&#35745;&#37327;&#21644;&#21452;&#37325;&#40065;&#26834;&#39057;&#29575;&#20272;&#35745;&#37327;&#30340;&#28176;&#36817;&#31561;&#20215;&#24615;&#65307;&#21363;&#65292;&#26465;&#20214;&#22343;&#20540;&#20989;&#25968;&#30340;&#32570;&#20047;&#24179;&#28369;&#24615;&#21487;&#20197;&#36890;&#36807;&#27010;&#29575;&#24471;&#20998;&#30340;&#39640;&#35268;&#21017;&#24615;&#36827;&#34892;&#34917;&#20607;&#65292;&#21453;&#20043;&#20134;&#28982;&#12290;&#22240;&#27492;&#65292;&#20135;&#29983;&#30340;&#36125;&#21494;&#26031;&#28857;&#20272;&#35745;&#20869;&#22312;&#21270;&#20102;&#39057;&#29575;&#22411;&#21452;&#37325;&#40065;&#26834;&#20272;&#35745;&#37327;&#30340;&#20559;&#24046;&#26657;&#27491;&#65292;&#32780;&#36125;&#21494;&#26031;&#21487;&#20449;&#38598;&#24418;&#25104;&#30340;&#32622;&#20449;&#21306;&#38388;&#20855;&#26377;&#28176;&#36817;&#31934;&#30830;&#30340;&#35206;&#30422;&#27010;&#29575;&#12290;&#22312;&#27169;&#25311;&#20013;&#65292;&#25105;&#20204;&#21457;&#29616;&#36825;&#31181;&#40065;&#26834;&#30340;&#36125;&#21494;&#26031;&#31243;&#24207;&#23548;&#33268;&#20102;&#26174;&#30528;&#30340;...
&lt;/p&gt;
&lt;p&gt;
We study a double robust Bayesian inference procedure on the average treatment effect (ATE) under unconfoundedness. Our robust Bayesian approach involves two adjustment steps: first, we make a correction for prior distributions of the conditional mean function; second, we introduce a recentering term on the posterior distribution of the resulting ATE. We prove asymptotic equivalence of our Bayesian estimator and double robust frequentist estimators by establishing a new semiparametric Bernstein-von Mises theorem under double robustness; i.e., the lack of smoothness of conditional mean functions can be compensated by high regularity of the propensity score and vice versa. Consequently, the resulting Bayesian point estimator internalizes the bias correction as the frequentist-type doubly robust estimator, and the Bayesian credible sets form confidence intervals with asymptotically exact coverage probability. In simulations, we find that this robust Bayesian procedure leads to significant
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#26694;&#26550;&#65292;&#20854;&#20013;&#20195;&#29702;&#20154;&#34987;&#38480;&#21046;&#20351;&#29992;&#31616;&#21333;&#27169;&#22411;&#26469;&#39044;&#27979;&#32463;&#27982;&#21464;&#37327;&#65292;&#24182;&#25551;&#36848;&#20102;&#30001;&#27492;&#20135;&#29983;&#30340;&#20559;&#35265;&#12290;&#20351;&#29992;&#31616;&#21333;&#27169;&#22411;&#20250;&#22686;&#21152;&#21069;&#30651;&#20915;&#31574;&#30340;&#25345;&#20037;&#24615;&#21644;&#23427;&#20204;&#20043;&#38388;&#30340;&#20849;&#21516;&#34892;&#21160;&#12290;&#21516;&#26102;&#65292;&#20316;&#32773;&#36824;&#35299;&#37322;&#20102;&#22914;&#20309;&#21033;&#29992;&#36825;&#19968;&#35266;&#28857;&#23558;&#19977;&#20010;&#20027;&#27969;&#23439;&#35266;&#32463;&#27982;&#27169;&#22411;&#30340;&#39044;&#27979;&#25509;&#36817;&#20110;&#25968;&#25454;&#12290;</title><link>http://arxiv.org/abs/2202.06921</link><description>&lt;p&gt;
&#31616;&#21333;&#27169;&#22411;&#21644;&#26377;&#20559;&#39044;&#27979;
&lt;/p&gt;
&lt;p&gt;
Simple Models and Biased Forecasts. (arXiv:2202.06921v4 [econ.TH] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2202.06921
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#26694;&#26550;&#65292;&#20854;&#20013;&#20195;&#29702;&#20154;&#34987;&#38480;&#21046;&#20351;&#29992;&#31616;&#21333;&#27169;&#22411;&#26469;&#39044;&#27979;&#32463;&#27982;&#21464;&#37327;&#65292;&#24182;&#25551;&#36848;&#20102;&#30001;&#27492;&#20135;&#29983;&#30340;&#20559;&#35265;&#12290;&#20351;&#29992;&#31616;&#21333;&#27169;&#22411;&#20250;&#22686;&#21152;&#21069;&#30651;&#20915;&#31574;&#30340;&#25345;&#20037;&#24615;&#21644;&#23427;&#20204;&#20043;&#38388;&#30340;&#20849;&#21516;&#34892;&#21160;&#12290;&#21516;&#26102;&#65292;&#20316;&#32773;&#36824;&#35299;&#37322;&#20102;&#22914;&#20309;&#21033;&#29992;&#36825;&#19968;&#35266;&#28857;&#23558;&#19977;&#20010;&#20027;&#27969;&#23439;&#35266;&#32463;&#27982;&#27169;&#22411;&#30340;&#39044;&#27979;&#25509;&#36817;&#20110;&#25968;&#25454;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#26694;&#26550;&#65292;&#20854;&#20013;&#20195;&#29702;&#20154;&#34987;&#38480;&#21046;&#20351;&#29992;&#31616;&#21333;&#27169;&#22411;&#26469;&#39044;&#27979;&#32463;&#27982;&#21464;&#37327;&#65292;&#24182;&#25551;&#36848;&#20102;&#30001;&#27492;&#20135;&#29983;&#30340;&#20559;&#35265;&#12290;&#23427;&#32771;&#34385;&#20102;&#21482;&#33021;&#20351;&#29992;&#19981;&#36229;&#36807;$d$&#20010;&#29366;&#24577;&#30340;&#29366;&#24577;&#31354;&#38388;&#27169;&#22411;&#30340;&#20195;&#29702;&#20154;&#65292;&#20854;&#20013;$d$&#34913;&#37327;&#20102;&#27169;&#22411;&#30340;&#26102;&#38388;&#22797;&#26434;&#24615;&#12290;&#20195;&#29702;&#20154;&#26377;&#26377;&#38480;&#30340;&#29702;&#24615;&#65292;&#21482;&#33021;&#32771;&#34385;&#37027;&#20123;&#36807;&#20110;&#31616;&#21333;&#32780;&#26080;&#27861;&#23884;&#22871;&#30495;&#23454;&#36807;&#31243;&#30340;&#27169;&#22411;&#65292;&#28982;&#21518;&#36873;&#25321;&#20854;&#20013;&#26368;&#22909;&#30340;&#27169;&#22411;&#12290;&#25105;&#34920;&#26126;&#20351;&#29992;&#31616;&#21333;&#27169;&#22411;&#20250;&#22686;&#21152;&#21069;&#30651;&#20915;&#31574;&#30340;&#25345;&#20037;&#24615;&#21644;&#23427;&#20204;&#20043;&#38388;&#30340;&#20849;&#21516;&#34892;&#21160;&#12290;&#28982;&#21518;&#25105;&#35299;&#37322;&#20102;&#22914;&#20309;&#21033;&#29992;&#36825;&#19968;&#35266;&#28857;&#23558;&#19977;&#20010;&#20027;&#27969;&#23439;&#35266;&#32463;&#27982;&#27169;&#22411;&#30340;&#39044;&#27979;&#25509;&#36817;&#20110;&#25968;&#25454;&#12290;&#22312;&#26032;&#20975;&#24681;&#26031;&#27169;&#22411;&#20013;&#65292;&#21069;&#30651;&#25351;&#23548;&#30340;&#25928;&#21147;&#38477;&#20302;&#12290;&#22312;&#30495;&#23454;&#21830;&#19994;&#21608;&#26399;&#27169;&#22411;&#20013;&#65292;&#28040;&#36153;&#23545;&#29983;&#20135;&#21147;&#20914;&#20987;&#30340;&#21453;&#24212;&#21464;&#24471;&#26356;&#21152;&#36831;&#32531;&#12290;Diamond-Mortensen-Pissarides&#27169;&#22411;&#22312;&#23545;&#29983;&#20135;&#21147;&#30340;&#21709;&#24212;&#20013;&#34920;&#29616;&#20986;&#26356;&#22810;&#30340;&#20869;&#37096;&#20256;&#25773;&#21644;&#26356;&#30495;&#23454;&#30340;&#20849;&#21516;&#34892;&#21160;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper proposes a framework in which agents are constrained to use simple models to forecast economic variables and characterizes the resulting biases. It considers agents who can only entertain state-space models with no more than $d$ states, where $d$ measures the intertemporal complexity of a model. Agents are boundedly rational in that they can only consider models that are too simple to nest the true process, yet they use the best model among those considered. I show that using simple models adds persistence to forward-looking decisions and increases the comovement among them. I then explain how this insight can bring the predictions of three workhorse macroeconomic models closer to data. In the new-Keynesian model, forward guidance becomes less powerful. In the real business cycle model, consumption responds more sluggishly to productivity shocks. The Diamond--Mortensen--Pissarides model exhibits more internal propagation and more realistic comovement in response to productiv
&lt;/p&gt;</description></item></channel></rss>