<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#20449;&#24687;&#25552;&#20379;&#23454;&#39564;&#29992;&#20110;&#30830;&#23450;&#20449;&#24565;&#22914;&#20309;&#22240;&#26524;&#22320;&#24433;&#21709;&#20915;&#31574;&#21644;&#34892;&#20026;&#12290;&#36890;&#36807;&#24212;&#29992;&#36125;&#21494;&#26031;&#20272;&#35745;&#22120;&#65292;&#21487;&#20197;&#20934;&#30830;&#35782;&#21035;&#20986;&#65288;&#38750;&#21152;&#26435;&#30340;&#65289;&#24179;&#22343;&#37096;&#20998;&#25928;&#24212;&#12290;</title><link>http://arxiv.org/abs/2309.11387</link><description>&lt;p&gt;
&#20449;&#24687;&#25552;&#20379;&#23454;&#39564;&#20013;&#30340;&#22240;&#26524;&#25928;&#24212;&#35782;&#21035;
&lt;/p&gt;
&lt;p&gt;
Identifying Causal Effects in Information Provision Experiments. (arXiv:2309.11387v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.11387
&lt;/p&gt;
&lt;p&gt;
&#20449;&#24687;&#25552;&#20379;&#23454;&#39564;&#29992;&#20110;&#30830;&#23450;&#20449;&#24565;&#22914;&#20309;&#22240;&#26524;&#22320;&#24433;&#21709;&#20915;&#31574;&#21644;&#34892;&#20026;&#12290;&#36890;&#36807;&#24212;&#29992;&#36125;&#21494;&#26031;&#20272;&#35745;&#22120;&#65292;&#21487;&#20197;&#20934;&#30830;&#35782;&#21035;&#20986;&#65288;&#38750;&#21152;&#26435;&#30340;&#65289;&#24179;&#22343;&#37096;&#20998;&#25928;&#24212;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20449;&#24687;&#25552;&#20379;&#23454;&#39564;&#26159;&#19968;&#31181;&#36234;&#26469;&#36234;&#27969;&#34892;&#30340;&#24037;&#20855;&#65292;&#29992;&#20110;&#30830;&#23450;&#20449;&#24565;&#22914;&#20309;&#22240;&#26524;&#22320;&#24433;&#21709;&#20915;&#31574;&#21644;&#34892;&#20026;&#12290;&#22312;&#22522;&#20110;&#36127;&#25285;&#20449;&#24687;&#33719;&#21462;&#30340;&#31616;&#21333;&#36125;&#21494;&#26031;&#20449;&#24565;&#24418;&#25104;&#27169;&#22411;&#20013;&#65292;&#24403;&#36825;&#20123;&#20449;&#24565;&#23545;&#20182;&#20204;&#30340;&#20915;&#31574;&#33267;&#20851;&#37325;&#35201;&#26102;&#65292;&#20154;&#20204;&#24418;&#25104;&#31934;&#30830;&#30340;&#20449;&#24565;&#12290;&#20808;&#21069;&#20449;&#24565;&#30340;&#31934;&#30830;&#24230;&#25511;&#21046;&#30528;&#24403;&#20182;&#20204;&#25509;&#21463;&#26032;&#20449;&#24687;&#26102;&#20182;&#20204;&#30340;&#20449;&#24565;&#21464;&#21270;&#31243;&#24230;&#65288;&#21363;&#31532;&#19968;&#38454;&#27573;&#30340;&#24378;&#24230;&#65289;&#12290;&#30001;&#20110;&#20004;&#38454;&#27573;&#26368;&#23567;&#20108;&#20056;&#27861;&#65288;TSLS&#65289;&#20197;&#26435;&#37325;&#19982;&#31532;&#19968;&#38454;&#27573;&#30340;&#24378;&#24230;&#25104;&#27604;&#20363;&#30340;&#21152;&#26435;&#24179;&#22343;&#20026;&#30446;&#26631;&#65292;TSLS&#20250;&#36807;&#24230;&#21152;&#26435;&#20855;&#26377;&#36739;&#23567;&#22240;&#26524;&#25928;&#24212;&#30340;&#20010;&#20307;&#65292;&#24182;&#20302;&#20272;&#20855;&#26377;&#36739;&#22823;&#25928;&#24212;&#30340;&#20010;&#20307;&#65292;&#20174;&#32780;&#20302;&#20272;&#20102;&#20449;&#24565;&#23545;&#34892;&#20026;&#30340;&#24179;&#22343;&#37096;&#20998;&#25928;&#24212;&#12290;&#22312;&#25152;&#26377;&#21442;&#19982;&#32773;&#37117;&#25509;&#21463;&#26032;&#20449;&#24687;&#30340;&#23454;&#39564;&#35774;&#35745;&#20013;&#65292;&#36125;&#21494;&#26031;&#26356;&#26032;&#24847;&#21619;&#30528;&#21487;&#20197;&#20351;&#29992;&#25511;&#21046;&#20989;&#25968;&#26469;&#30830;&#23450;&#65288;&#38750;&#21152;&#26435;&#30340;&#65289;&#24179;&#22343;&#37096;&#20998;&#25928;&#24212;&#12290;&#25105;&#23558;&#36825;&#20010;&#20272;&#35745;&#22120;&#24212;&#29992;&#20110;&#26368;&#36817;&#19968;&#39033;&#20851;&#20110;&#25928;&#24212;&#30340;&#30740;&#31350;&#12290;
&lt;/p&gt;
&lt;p&gt;
Information provision experiments are an increasingly popular tool to identify how beliefs causally affect decision-making and behavior. In a simple Bayesian model of belief formation via costly information acquisition, people form precise beliefs when these beliefs are important for their decision-making. The precision of prior beliefs controls how much their beliefs shift when they are shown new information (i.e., the strength of the first stage). Since two-stage least squares (TSLS) targets a weighted average with weights proportional to the strength of the first stage, TSLS will overweight individuals with smaller causal effects and underweight those with larger effects, thus understating the average partial effect of beliefs on behavior. In experimental designs where all participants are exposed to new information, Bayesian updating implies that a control function can be used to identify the (unweighted) average partial effect. I apply this estimator to a recent study of the effec
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#20272;&#35745;&#26041;&#27861;&#8212;&#8212;&#40065;&#26834;&#24615;&#31890;&#24230;&#20202;&#22120;&#21464;&#37327;&#65288;RGIV&#65289;&#8212;&#8212;&#21487;&#20197;&#22788;&#29702;&#21333;&#20301;&#32423;&#24322;&#36136;&#24615;&#21644;&#26410;&#30693;&#30340;&#20914;&#20987;&#26041;&#24046;&#65292;&#36866;&#29992;&#20110;&#21508;&#31181;&#32463;&#27982;&#29615;&#22659;&#65292;&#27604;&#29616;&#26377;&#26041;&#27861;&#26356;&#20855;&#24191;&#27867;&#36866;&#29992;&#24615;&#12290;</title><link>http://arxiv.org/abs/2304.01273</link><description>&lt;p&gt;
&#24322;&#36136;&#24615;&#40065;&#26834;&#24615;&#30340;&#31890;&#24230;&#20202;&#22120;
&lt;/p&gt;
&lt;p&gt;
Heterogeneity-robust granular instruments. (arXiv:2304.01273v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.01273
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#20272;&#35745;&#26041;&#27861;&#8212;&#8212;&#40065;&#26834;&#24615;&#31890;&#24230;&#20202;&#22120;&#21464;&#37327;&#65288;RGIV&#65289;&#8212;&#8212;&#21487;&#20197;&#22788;&#29702;&#21333;&#20301;&#32423;&#24322;&#36136;&#24615;&#21644;&#26410;&#30693;&#30340;&#20914;&#20987;&#26041;&#24046;&#65292;&#36866;&#29992;&#20110;&#21508;&#31181;&#32463;&#27982;&#29615;&#22659;&#65292;&#27604;&#29616;&#26377;&#26041;&#27861;&#26356;&#20855;&#24191;&#27867;&#36866;&#29992;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#31890;&#24230;&#20202;&#22120;&#21464;&#37327;&#22312;&#32463;&#39564;&#23439;&#35266;&#37329;&#34701;&#26041;&#38754;&#24471;&#21040;&#20102;&#24555;&#36895;&#21457;&#23637;&#12290;&#23427;&#20204;&#30340;&#21560;&#24341;&#21147;&#22312;&#20110;&#23427;&#20204;&#36866;&#29992;&#20110;&#21508;&#31181;&#32463;&#27982;&#29615;&#22659;&#65292;&#22914;&#38656;&#27714;&#31995;&#32479;&#21644;&#28322;&#20986;&#30340;&#20272;&#35745;&#12290;&#25105;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#20272;&#35745;&#26041;&#27861;&#8212;&#8212;&#40065;&#26834;&#24615;&#31890;&#24230;&#20202;&#22120;&#21464;&#37327;&#65288;RGIV&#65289;&#8212;&#8212;&#23427;&#19981;&#20687;GIV&#37027;&#26679;&#21482;&#26159;&#20801;&#35768;&#21333;&#20301;&#23545;&#24635;&#37327;&#21464;&#37327;&#20135;&#29983;&#30340;&#21709;&#24212;&#19981;&#21516;&#65292;&#32780;&#19988;&#36824;&#21487;&#22788;&#29702;&#21333;&#20301;&#32423;&#24322;&#36136;&#24615;&#21644;&#26410;&#30693;&#30340;&#20914;&#20987;&#26041;&#24046;&#12290;&#20854;&#24191;&#27867;&#36866;&#29992;&#24615;&#20351;&#24471;&#30740;&#31350;&#20154;&#21592;&#21487;&#20197;&#32771;&#34385;&#21644;&#30740;&#31350;&#21333;&#20301;&#23618;&#38754;&#30340;&#24046;&#24322;&#12290;&#25105;&#36824;&#24320;&#21457;&#20102;&#19968;&#20010;&#36229;&#35782;&#21035;&#26816;&#39564;&#65292;&#35780;&#20272;RGIV&#19982;&#25968;&#25454;&#30340;&#20860;&#23481;&#24615;&#65292;&#20197;&#21450;&#19968;&#20010;&#21442;&#25968;&#38480;&#21046;&#26816;&#39564;&#65292;&#35780;&#20272;&#21516;&#36136;&#31995;&#25968;&#20551;&#35774;&#30340;&#36866;&#24403;&#24615;&#12290;&#22312;&#27169;&#25311;&#20013;&#65292;&#25105;&#35777;&#26126;RGIV&#20135;&#29983;&#21487;&#38752;&#19988;&#20449;&#24687;&#20016;&#23500;&#30340;&#32622;&#20449;&#21306;&#38388;&#12290;
&lt;/p&gt;
&lt;p&gt;
Granular instrumental variables have experienced sharp growth in empirical macro-finance. Their attraction lies in their applicability to a wide set of economic environments like demand systems and the estimation of spillovers. I propose a new estimator$\unicode{x2014}$called robust granular instrumental variables (RGIV)$\unicode{x2014}$that, unlike GIV, allows for heterogeneous responses across units to the aggregate variable, unknown shock variances, and does not rely on skewness of the size distribution of units. Its generality allows researchers to account for and study unit-level heterogeneity. I also develop an overidentification test that evaluates the RGIV's compatibility with the data and a parameter restriction test that evaluates the appropriateness of the homogeneous coefficient assumption. In simulations, I show that RGIV produces reliable and informative confidence intervals.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#32771;&#34385;&#20102;&#22312;&#26377;&#20559;&#20272;&#35745;&#37327;&#24773;&#20917;&#19979;&#30340;Bootstrap&#25512;&#26029;&#65292;&#24182;&#23637;&#31034;&#20102;&#36890;&#36807;&#27491;&#30830;&#23454;&#26045;&#39044;&#20272;&#20462;&#27491;&#26041;&#27861;&#21487;&#20197;&#24471;&#21040;&#26377;&#25928;&#25512;&#26029;&#12290;&#30740;&#31350;&#25552;&#20986;&#20102;&#20004;&#31181;&#39044;&#20272;&#20462;&#27491;&#30340;&#23454;&#29616;&#26041;&#27861;&#65292;&#24182;&#32473;&#20986;&#20102;&#36890;&#29992;&#30340;&#26465;&#20214;&#30830;&#20445;Bootstrap&#25512;&#26029;&#30340;&#26377;&#25928;&#24615;&#12290;&#26681;&#25454;&#20116;&#20010;&#20855;&#20307;&#20363;&#23376;&#30340;&#35752;&#35770;&#65292;&#30740;&#31350;&#35777;&#26126;&#20102;&#25552;&#20986;&#26041;&#27861;&#30340;&#23454;&#38469;&#30456;&#20851;&#24615;&#21644;&#23454;&#26045;&#26041;&#27861;&#12290;</title><link>http://arxiv.org/abs/2208.02028</link><description>&lt;p&gt;
&#22312;&#20559;&#24046;&#23384;&#22312;&#30340;&#24773;&#20917;&#19979;&#30340;Bootstrap&#25512;&#26029;
&lt;/p&gt;
&lt;p&gt;
Bootstrap inference in the presence of bias. (arXiv:2208.02028v2 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2208.02028
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#32771;&#34385;&#20102;&#22312;&#26377;&#20559;&#20272;&#35745;&#37327;&#24773;&#20917;&#19979;&#30340;Bootstrap&#25512;&#26029;&#65292;&#24182;&#23637;&#31034;&#20102;&#36890;&#36807;&#27491;&#30830;&#23454;&#26045;&#39044;&#20272;&#20462;&#27491;&#26041;&#27861;&#21487;&#20197;&#24471;&#21040;&#26377;&#25928;&#25512;&#26029;&#12290;&#30740;&#31350;&#25552;&#20986;&#20102;&#20004;&#31181;&#39044;&#20272;&#20462;&#27491;&#30340;&#23454;&#29616;&#26041;&#27861;&#65292;&#24182;&#32473;&#20986;&#20102;&#36890;&#29992;&#30340;&#26465;&#20214;&#30830;&#20445;Bootstrap&#25512;&#26029;&#30340;&#26377;&#25928;&#24615;&#12290;&#26681;&#25454;&#20116;&#20010;&#20855;&#20307;&#20363;&#23376;&#30340;&#35752;&#35770;&#65292;&#30740;&#31350;&#35777;&#26126;&#20102;&#25552;&#20986;&#26041;&#27861;&#30340;&#23454;&#38469;&#30456;&#20851;&#24615;&#21644;&#23454;&#26045;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#32771;&#34385;&#23545;&#65288;&#28176;&#36817;&#65289;&#26377;&#20559;&#20272;&#35745;&#37327;&#30340;Bootstrap&#25512;&#26029;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#21363;&#20351;&#20559;&#24046;&#39033;&#26080;&#27861;&#19968;&#33268;&#20272;&#35745;&#65292;&#36890;&#36807;&#27491;&#30830;&#23454;&#26045;Bootstrap&#65292;&#20173;&#28982;&#21487;&#20197;&#24471;&#21040;&#26377;&#25928;&#30340;&#25512;&#26029;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;Beran&#65288;1987, 1988&#65289;&#30340;&#39044;&#20272;&#20462;&#27491;&#26041;&#27861;&#65292;&#21407;&#26412;&#26088;&#22312;&#25552;&#20379;&#26356;&#39640;&#38454;&#30340;&#25913;&#36827;&#65292;&#36890;&#36807;&#23558;&#21407;&#22987;&#30340;Bootstrap p&#20540;&#36716;&#21270;&#20026;&#28176;&#36817;&#22343;&#21248;&#38543;&#26426;&#21464;&#37327;&#65292;&#24674;&#22797;&#20102;Bootstrap&#30340;&#26377;&#25928;&#24615;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#20004;&#31181;&#39044;&#20272;&#20462;&#27491;&#30340;&#23454;&#29616;&#26041;&#27861;&#65288;&#25554;&#20837;&#27861;&#21644;&#21452;&#37325;Bootstrap&#65289;&#65292;&#24182;&#25552;&#20379;&#20102;&#19968;&#33324;&#39640;&#32423;&#26465;&#20214;&#65292;&#36825;&#20123;&#26465;&#20214;&#24847;&#21619;&#30528;Bootstrap&#25512;&#26029;&#30340;&#26377;&#25928;&#24615;&#12290;&#20026;&#20102;&#35828;&#26126;&#25105;&#20204;&#32467;&#26524;&#30340;&#23454;&#38469;&#30456;&#20851;&#24615;&#21644;&#23454;&#26045;&#26041;&#27861;&#65292;&#25105;&#20204;&#35752;&#35770;&#20102;&#20116;&#20010;&#20363;&#23376;&#65306;&#65288;i&#65289;&#22522;&#20110;&#27169;&#22411;&#24179;&#22343;&#30340;&#30446;&#26631;&#21442;&#25968;&#25512;&#26029;&#65307;&#65288;ii&#65289;&#23725;&#22411;&#27491;&#21017;&#21270;&#20272;&#35745;&#37327;&#65307;&#65288;iii&#65289;&#38750;&#21442;&#25968;&#22238;&#24402;&#65307;&#65288;iv&#65289;&#26080;&#31351;&#26041;&#24046;&#25968;&#25454;&#30340;&#20301;&#32622;&#27169;&#22411;&#65307;&#65288;v&#65289;&#21160;&#24577;&#38754;&#26495;&#25968;&#25454;&#27169;&#22411;&#12290;
&lt;/p&gt;
&lt;p&gt;
We consider bootstrap inference for estimators which are (asymptotically) biased. We show that, even when the bias term cannot be consistently estimated, valid inference can be obtained by proper implementations of the bootstrap. Specifically, we show that the prepivoting approach of Beran (1987, 1988), originally proposed to deliver higher-order refinements, restores bootstrap validity by transforming the original bootstrap p-value into an asymptotically uniform random variable. We propose two different implementations of prepivoting (plug-in and double bootstrap), and provide general high-level conditions that imply validity of bootstrap inference. To illustrate the practical relevance and implementation of our results, we discuss five examples: (i) inference on a target parameter based on model averaging; (ii) ridge-type regularized estimators; (iii) nonparametric regression; (iv) a location model for infinite variance data; and (v) dynamic panel data models.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#26356;&#24378;&#30340;&#21333;&#35843;&#20449;&#21495;&#24179;&#34913;&#65292;&#25552;&#20986;&#20102;&#38024;&#23545;&#31283;&#23450;&#21305;&#37197;&#30340;&#31454;&#20105;&#24615;&#20449;&#21495;&#22343;&#34913;&#27010;&#24565;&#65292;&#24182;&#32473;&#20986;&#20102;&#28385;&#36275; D1 &#20934;&#21017;&#30340;&#26465;&#20214;&#12290;&#22312;&#20855;&#26377;&#20934;&#32447;&#24615;&#25928;&#29992;&#20989;&#25968;&#30340;&#21333;&#19968;&#21305;&#37197;&#24066;&#22330;&#19978;&#24314;&#31435;&#20102;&#21807;&#19968;&#30340;&#26356;&#24378;&#21333;&#35843;&#24179;&#34913;&#12290;</title><link>http://arxiv.org/abs/2109.03370</link><description>&lt;p&gt;
&#26356;&#24378;&#30340;&#21333;&#35843;&#20449;&#21495;&#24179;&#34913;
&lt;/p&gt;
&lt;p&gt;
Stronger Monotone Signaling Equilibrium. (arXiv:2109.03370v3 [econ.TH] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2109.03370
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#26356;&#24378;&#30340;&#21333;&#35843;&#20449;&#21495;&#24179;&#34913;&#65292;&#25552;&#20986;&#20102;&#38024;&#23545;&#31283;&#23450;&#21305;&#37197;&#30340;&#31454;&#20105;&#24615;&#20449;&#21495;&#22343;&#34913;&#27010;&#24565;&#65292;&#24182;&#32473;&#20986;&#20102;&#28385;&#36275; D1 &#20934;&#21017;&#30340;&#26465;&#20214;&#12290;&#22312;&#20855;&#26377;&#20934;&#32447;&#24615;&#25928;&#29992;&#20989;&#25968;&#30340;&#21333;&#19968;&#21305;&#37197;&#24066;&#22330;&#19978;&#24314;&#31435;&#20102;&#21807;&#19968;&#30340;&#26356;&#24378;&#21333;&#35843;&#24179;&#34913;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#21333;&#35843;&#20449;&#21495;&#24179;&#34913;&#65292;&#20854;&#20013;&#24179;&#34913;&#32467;&#26524;&#8212;&#8212;&#34892;&#21160;&#12289;&#21453;&#24212;&#12289;&#20449;&#24565;&#65288;&#21305;&#37197;&#27169;&#22411;&#20013;&#30340;&#21305;&#37197;&#65289;&#8212;&#8212;&#22343;&#22312;&#26356;&#24378;&#30340;&#38598;&#21512;&#24207;&#21015;&#20013;&#26159;&#21333;&#35843;&#30340;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#22914;&#26524;&#21457;&#36865;&#32773;&#30340;&#25928;&#29992;&#26159;&#21333;&#35843;&#36229;&#27169;&#22411;&#30340;&#65292;&#21017;&#23545;&#20110;&#19968;&#23545;&#21457;&#36865;&#32773;&#21644;&#25509;&#25910;&#32773;&#30340;&#21338;&#24328;&#65292;&#22914;&#26524;&#36890;&#36807; D1 &#20934;&#21017;&#65288;Cho &#21644; Kreps&#65288;1987&#65289;&#12289;Banks &#21644; Sobel(1987)&#65289;&#21017;&#32431;&#31574;&#30053;&#23436;&#32654;&#36125;&#21494;&#26031;&#22343;&#34913;&#26356;&#24378;&#21333;&#35843;&#12290;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#31181;&#22522;&#20110;&#31283;&#23450;&#21305;&#37197;&#30340;&#21333;&#19968;&#21305;&#37197;&#24066;&#22330;&#19978;&#30340;&#31454;&#20105;&#24615;&#20449;&#21495;&#22343;&#34913;&#65288;CSE&#65289;&#27010;&#24565;&#65292;&#20854;&#20013;&#21457;&#36865;&#32773;&#21644;&#25509;&#25910;&#32773;&#37117;&#26159;&#24322;&#26500;&#30340;&#36830;&#32493;&#21464;&#37327;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#22914;&#26524;&#21457;&#36865;&#32773;&#25928;&#29992;&#26159;&#21333;&#35843;&#36229;&#27169;&#22411;&#30340;&#35805;&#65292;&#22914;&#26524;&#25509;&#25910;&#32773;&#25928;&#29992;&#26159;&#24369;&#21333;&#35843;&#36229;&#27169;&#22411;&#65292;&#37027;&#20040; CSE &#26356;&#24378;&#21333;&#35843;&#65292;&#24403;&#19988;&#20165;&#24403;&#23427;&#36890;&#36807; D1 &#20934;&#21017;&#12290;&#26368;&#21518;&#65292;&#22312;&#20855;&#26377;&#20934;&#32447;&#24615;&#25928;&#29992;&#20989;&#25968;&#30340;&#21333;&#19968;&#21305;&#37197;&#24066;&#22330;&#19978;&#65292;&#22312;&#25509;&#25910;&#32773;&#21487;&#20197;&#37319;&#21462;&#20219;&#20309;&#21487;&#34892;&#21453;&#24212;&#30340;&#21306;&#38388;&#20869;&#65292;&#24314;&#31435;&#20102;&#19968;&#20010;&#21807;&#19968;&#30340;&#26356;&#24378;&#21333;&#35843;&#24179;&#34913;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study monotone signaling equilibrium where equilibrium outcomes - actions, reactions, beliefs (and matching in a matching model) - are all monotone in the stronger set order. We show that if the sender's utility is monotone-supermodular, a pure-strategy perfect Bayesian equilibrium of games with one sender and one receiver is stronger monotone if and only if it passes Criterion D1 (Cho and Kreps (1987), Banks and Sobel (1987)). We introduce a notion of competitive signaling equilibrium (CSE) in one-to-one matching markets with a continuum of heterogeneous senders and receivers, based on the notion of stable matching. We show that if the sender utility is monotone-supermodular and the receiver's utility is weakly monotone-supermodular, a CSE is stronger monotone if and only if it passes Criterion D1. Finally, in one-to-one matching markets with quasilinear utilities, a unique stronger monotone equilibrium is established given any interval of feasible reactions that receivers can take
&lt;/p&gt;</description></item></channel></rss>