<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#25552;&#20379;&#20102;&#19968;&#20010;&#23454;&#29992;&#24037;&#20855;&#21253;&#65292;&#29992;&#20110;&#20998;&#26512;&#20107;&#20214;&#30740;&#31350;&#20013;&#30340;&#25928;&#24212;&#24322;&#36136;&#24615;&#65292;&#24378;&#35843;&#20102;&#20010;&#20307;&#32423;&#21035;&#25928;&#24212;&#30340;&#37325;&#35201;&#24615;&#65292;&#24182;&#25581;&#31034;&#20102;&#32447;&#24615;&#27835;&#30103;&#25928;&#24212;&#30340;&#25361;&#25112;&#12290;</title><link>https://arxiv.org/abs/2403.19563</link><description>&lt;p&gt;
&#20107;&#20214;&#30740;&#31350;&#20013;&#20010;&#20307;&#24322;&#36136;&#24615;&#30340;&#28789;&#27963;&#20998;&#26512;&#65306;&#20197;&#23376;&#22899;&#24809;&#32602;&#20026;&#20363;
&lt;/p&gt;
&lt;p&gt;
Flexible Analysis of Individual Heterogeneity in Event Studies: Application to the Child Penalty
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.19563
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20379;&#20102;&#19968;&#20010;&#23454;&#29992;&#24037;&#20855;&#21253;&#65292;&#29992;&#20110;&#20998;&#26512;&#20107;&#20214;&#30740;&#31350;&#20013;&#30340;&#25928;&#24212;&#24322;&#36136;&#24615;&#65292;&#24378;&#35843;&#20102;&#20010;&#20307;&#32423;&#21035;&#25928;&#24212;&#30340;&#37325;&#35201;&#24615;&#65292;&#24182;&#25581;&#31034;&#20102;&#32447;&#24615;&#27835;&#30103;&#25928;&#24212;&#30340;&#25361;&#25112;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20379;&#20102;&#19968;&#20010;&#23454;&#29992;&#24037;&#20855;&#21253;&#65292;&#29992;&#20110;&#20998;&#26512;&#20107;&#20214;&#30740;&#31350;&#20013;&#30340;&#25928;&#24212;&#24322;&#36136;&#24615;&#12290;&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#20010;&#20272;&#35745;&#31639;&#27861;&#65292;&#24182;&#35843;&#25972;&#29616;&#26377;&#30340;&#35745;&#37327;&#32463;&#27982;&#32467;&#26524;&#65292;&#25552;&#20379;&#20854;&#29702;&#35770;&#22522;&#30784;&#12290;&#25105;&#20204;&#23558;&#36825;&#20123;&#24037;&#20855;&#24212;&#29992;&#20110;&#33655;&#20848;&#34892;&#25919;&#25968;&#25454;&#65292;&#20197;&#19977;&#31181;&#26041;&#24335;&#30740;&#31350;&#23376;&#22899;&#24809;&#32602;&#65288;CP&#65289;&#32972;&#26223;&#19979;&#30340;&#20010;&#20307;&#24322;&#36136;&#24615;&#12290;&#39318;&#20808;&#65292;&#25105;&#20204;&#35760;&#24405;&#20102;&#20010;&#20307;&#32423;&#21035;CP&#36712;&#36857;&#30340;&#26174;&#33879;&#24322;&#36136;&#24615;&#65292;&#24378;&#35843;&#36229;&#36234;&#24179;&#22343;CP&#30340;&#37325;&#35201;&#24615;&#12290;&#20854;&#27425;&#65292;&#25105;&#20204;&#20351;&#29992;&#20010;&#20307;&#32423;&#21035;&#20272;&#35745;&#26469;&#26816;&#39564;&#25176;&#20799;&#26381;&#21153;&#20379;&#32473;&#25193;&#23637;&#25919;&#31574;&#30340;&#24433;&#21709;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#25581;&#31034;&#20102;&#38750;&#32447;&#24615;&#27835;&#30103;&#25928;&#24212;&#65292;&#25361;&#25112;&#20102;&#21463;&#38480;&#20110;&#36739;&#23569;&#28789;&#27963;&#35268;&#33539;&#30340;&#20256;&#32479;&#25919;&#31574;&#35780;&#20272;&#26041;&#27861;&#12290;&#31532;&#19977;&#65292;&#25105;&#20204;&#20351;&#29992;&#20010;&#20307;&#32423;&#21035;&#20272;&#35745;&#20316;&#20026;&#22238;&#24402;&#21464;&#37327;&#26469;&#30740;&#31350;&#27597;&#22899;&#20043;&#38388;CP&#30340;&#20195;&#38469;&#24377;&#24615;&#12290;&#22312;&#35843;&#25972;&#27979;&#37327;&#35823;&#24046;&#20559;&#24046;&#20043;&#21518;&#65292;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.19563v1 Announce Type: new  Abstract: We provide a practical toolkit for analyzing effect heterogeneity in event studies. We develop an estimation algorithm and adapt existing econometric results to provide its theoretical justification. We apply these tools to Dutch administrative data to study individual heterogeneity in the child-penalty (CP) context in three ways. First, we document significant heterogeneity in the individual-level CP trajectories, emphasizing the importance of going beyond the average CP. Second, we use individual-level estimates to examine the impact of childcare supply expansion policies. Our approach uncovers nonlinear treatment effects, challenging the conventional policy evaluation methods constrained to less flexible specifications. Third, we use the individual-level estimates as a regressor on the right-hand side to study the intergenerational elasticity of the CP between mothers and daughters. After adjusting for the measurement error bias, we f
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#22312;&#32473;&#23450;&#22343;&#34913;&#25928;&#29992;&#30340;&#24773;&#20917;&#19979;&#65292;&#25214;&#21040;&#20102;&#19968;&#31181;&#20851;&#20110;&#25910;&#20837;&#21644;&#20004;&#20010;&#20559;&#22909;&#21442;&#25968;&#30340;&#20844;&#20849;&#20135;&#21697;&#20379;&#32473;&#21464;&#21270;&#30340;&#31934;&#30830;&#38381;&#21512;&#24335;&#34917;&#20607;&#21464;&#21160;&#65288;CV&#65289;&#34920;&#36798;&#24335;&#65292;&#24182;&#19988;&#25552;&#20986;&#20102;&#19968;&#20010;&#20559;&#22909;&#21442;&#25968;&#30340;&#21333;&#19968;&#20805;&#20998;&#32479;&#35745;&#37327;&#12290;</title><link>http://arxiv.org/abs/2401.15493</link><description>&lt;p&gt;
&#20844;&#20849;&#20135;&#21697;&#20379;&#32473;&#19982;&#34917;&#20607;&#21464;&#21160;
&lt;/p&gt;
&lt;p&gt;
Public Good Provision and Compensating Variation. (arXiv:2401.15493v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.15493
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#22312;&#32473;&#23450;&#22343;&#34913;&#25928;&#29992;&#30340;&#24773;&#20917;&#19979;&#65292;&#25214;&#21040;&#20102;&#19968;&#31181;&#20851;&#20110;&#25910;&#20837;&#21644;&#20004;&#20010;&#20559;&#22909;&#21442;&#25968;&#30340;&#20844;&#20849;&#20135;&#21697;&#20379;&#32473;&#21464;&#21270;&#30340;&#31934;&#30830;&#38381;&#21512;&#24335;&#34917;&#20607;&#21464;&#21160;&#65288;CV&#65289;&#34920;&#36798;&#24335;&#65292;&#24182;&#19988;&#25552;&#20986;&#20102;&#19968;&#20010;&#20559;&#22909;&#21442;&#25968;&#30340;&#21333;&#19968;&#20805;&#20998;&#32479;&#35745;&#37327;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25919;&#24220;&#25552;&#20379;&#20844;&#20849;&#20135;&#21697;&#20250;&#20135;&#29983;&#37325;&#22823;&#25104;&#26412;&#65292;&#20294;&#26159;&#23545;&#20844;&#20849;&#20135;&#21697;&#30340;&#25903;&#20184;&#24847;&#24895;&#24182;&#19981;&#30452;&#25509;&#21487;&#35266;&#27979;&#12290;&#26412;&#30740;&#31350;&#22312;&#32473;&#23450;&#22343;&#34913;&#25928;&#29992;&#30340;&#24773;&#20917;&#19979;&#65292;&#25214;&#21040;&#20102;&#19968;&#31181;&#20851;&#20110;&#25910;&#20837;&#21644;&#20004;&#20010;&#20559;&#22909;&#21442;&#25968;&#30340;&#20844;&#20849;&#20135;&#21697;&#20379;&#32473;&#21464;&#21270;&#30340;&#31934;&#30830;&#38381;&#21512;&#24335;&#34917;&#20607;&#21464;&#21160;&#65288;CV&#65289;&#34920;&#36798;&#24335;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#25105;&#20204;&#30340;CV&#34920;&#36798;&#24335;&#21482;&#26377;&#22312;&#24213;&#23618;&#20989;&#25968;&#22312;&#31169;&#20154;&#20135;&#21697;&#20013;&#26159;&#40784;&#27425;&#30340;&#65292;&#24182;&#19988;&#22312;&#20844;&#20849;&#20135;&#21697;&#20013;&#20063;&#26159;&#20998;&#21035;&#40784;&#27425;&#30340;&#24773;&#20917;&#19979;&#25165;&#33021;&#20135;&#29983;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#25214;&#21040;&#20102;&#19968;&#20010;&#20559;&#22909;&#21442;&#25968;&#30340;&#21333;&#19968;&#20805;&#20998;&#32479;&#35745;&#37327;&#65292;&#24182;&#23637;&#31034;&#20102;&#22914;&#20309;&#22312;&#23454;&#35777;&#24212;&#29992;&#20013;&#24674;&#22797;&#36825;&#19968;&#20805;&#20998;&#32479;&#35745;&#37327;&#12290;&#25152;&#26377;&#32467;&#26524;&#37117;&#36866;&#29992;&#20110;&#20844;&#20849;&#20135;&#21697;&#30340;&#36793;&#38469;&#21644;&#38750;&#36793;&#38469;&#21464;&#21270;&#12290;
&lt;/p&gt;
&lt;p&gt;
Public good provision by governments incurs significant costs but the willingness to pay for public goods is not directly observable. This study finds an exact closed-form compensating variation (CV) expression for a change in public good provision as a function of income and two preference parameters given homothetic utility. We prove that our CV expression arises if and only if the underlying function is homogeneous in the private goods and separately homogeneous in the public good(s). Then, we find a single sufficient statistic for the preference parameters and show how this sufficient statistic can be recovered in empirical applications. All results hold for marginal and non-marginal changes in public goods.
&lt;/p&gt;</description></item><item><title>&#20449;&#24687;&#25552;&#20379;&#23454;&#39564;&#29992;&#20110;&#30830;&#23450;&#20449;&#24565;&#22914;&#20309;&#22240;&#26524;&#22320;&#24433;&#21709;&#20915;&#31574;&#21644;&#34892;&#20026;&#12290;&#36890;&#36807;&#24212;&#29992;&#36125;&#21494;&#26031;&#20272;&#35745;&#22120;&#65292;&#21487;&#20197;&#20934;&#30830;&#35782;&#21035;&#20986;&#65288;&#38750;&#21152;&#26435;&#30340;&#65289;&#24179;&#22343;&#37096;&#20998;&#25928;&#24212;&#12290;</title><link>http://arxiv.org/abs/2309.11387</link><description>&lt;p&gt;
&#20449;&#24687;&#25552;&#20379;&#23454;&#39564;&#20013;&#30340;&#22240;&#26524;&#25928;&#24212;&#35782;&#21035;
&lt;/p&gt;
&lt;p&gt;
Identifying Causal Effects in Information Provision Experiments. (arXiv:2309.11387v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.11387
&lt;/p&gt;
&lt;p&gt;
&#20449;&#24687;&#25552;&#20379;&#23454;&#39564;&#29992;&#20110;&#30830;&#23450;&#20449;&#24565;&#22914;&#20309;&#22240;&#26524;&#22320;&#24433;&#21709;&#20915;&#31574;&#21644;&#34892;&#20026;&#12290;&#36890;&#36807;&#24212;&#29992;&#36125;&#21494;&#26031;&#20272;&#35745;&#22120;&#65292;&#21487;&#20197;&#20934;&#30830;&#35782;&#21035;&#20986;&#65288;&#38750;&#21152;&#26435;&#30340;&#65289;&#24179;&#22343;&#37096;&#20998;&#25928;&#24212;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20449;&#24687;&#25552;&#20379;&#23454;&#39564;&#26159;&#19968;&#31181;&#36234;&#26469;&#36234;&#27969;&#34892;&#30340;&#24037;&#20855;&#65292;&#29992;&#20110;&#30830;&#23450;&#20449;&#24565;&#22914;&#20309;&#22240;&#26524;&#22320;&#24433;&#21709;&#20915;&#31574;&#21644;&#34892;&#20026;&#12290;&#22312;&#22522;&#20110;&#36127;&#25285;&#20449;&#24687;&#33719;&#21462;&#30340;&#31616;&#21333;&#36125;&#21494;&#26031;&#20449;&#24565;&#24418;&#25104;&#27169;&#22411;&#20013;&#65292;&#24403;&#36825;&#20123;&#20449;&#24565;&#23545;&#20182;&#20204;&#30340;&#20915;&#31574;&#33267;&#20851;&#37325;&#35201;&#26102;&#65292;&#20154;&#20204;&#24418;&#25104;&#31934;&#30830;&#30340;&#20449;&#24565;&#12290;&#20808;&#21069;&#20449;&#24565;&#30340;&#31934;&#30830;&#24230;&#25511;&#21046;&#30528;&#24403;&#20182;&#20204;&#25509;&#21463;&#26032;&#20449;&#24687;&#26102;&#20182;&#20204;&#30340;&#20449;&#24565;&#21464;&#21270;&#31243;&#24230;&#65288;&#21363;&#31532;&#19968;&#38454;&#27573;&#30340;&#24378;&#24230;&#65289;&#12290;&#30001;&#20110;&#20004;&#38454;&#27573;&#26368;&#23567;&#20108;&#20056;&#27861;&#65288;TSLS&#65289;&#20197;&#26435;&#37325;&#19982;&#31532;&#19968;&#38454;&#27573;&#30340;&#24378;&#24230;&#25104;&#27604;&#20363;&#30340;&#21152;&#26435;&#24179;&#22343;&#20026;&#30446;&#26631;&#65292;TSLS&#20250;&#36807;&#24230;&#21152;&#26435;&#20855;&#26377;&#36739;&#23567;&#22240;&#26524;&#25928;&#24212;&#30340;&#20010;&#20307;&#65292;&#24182;&#20302;&#20272;&#20855;&#26377;&#36739;&#22823;&#25928;&#24212;&#30340;&#20010;&#20307;&#65292;&#20174;&#32780;&#20302;&#20272;&#20102;&#20449;&#24565;&#23545;&#34892;&#20026;&#30340;&#24179;&#22343;&#37096;&#20998;&#25928;&#24212;&#12290;&#22312;&#25152;&#26377;&#21442;&#19982;&#32773;&#37117;&#25509;&#21463;&#26032;&#20449;&#24687;&#30340;&#23454;&#39564;&#35774;&#35745;&#20013;&#65292;&#36125;&#21494;&#26031;&#26356;&#26032;&#24847;&#21619;&#30528;&#21487;&#20197;&#20351;&#29992;&#25511;&#21046;&#20989;&#25968;&#26469;&#30830;&#23450;&#65288;&#38750;&#21152;&#26435;&#30340;&#65289;&#24179;&#22343;&#37096;&#20998;&#25928;&#24212;&#12290;&#25105;&#23558;&#36825;&#20010;&#20272;&#35745;&#22120;&#24212;&#29992;&#20110;&#26368;&#36817;&#19968;&#39033;&#20851;&#20110;&#25928;&#24212;&#30340;&#30740;&#31350;&#12290;
&lt;/p&gt;
&lt;p&gt;
Information provision experiments are an increasingly popular tool to identify how beliefs causally affect decision-making and behavior. In a simple Bayesian model of belief formation via costly information acquisition, people form precise beliefs when these beliefs are important for their decision-making. The precision of prior beliefs controls how much their beliefs shift when they are shown new information (i.e., the strength of the first stage). Since two-stage least squares (TSLS) targets a weighted average with weights proportional to the strength of the first stage, TSLS will overweight individuals with smaller causal effects and underweight those with larger effects, thus understating the average partial effect of beliefs on behavior. In experimental designs where all participants are exposed to new information, Bayesian updating implies that a control function can be used to identify the (unweighted) average partial effect. I apply this estimator to a recent study of the effec
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#32771;&#34385;&#20102;&#22312;&#27809;&#26377;&#23545;&#29031;&#32452;&#30340;&#24773;&#20917;&#19979;&#20272;&#35745;&#21644;&#25512;&#26029;&#25919;&#31574;&#25928;&#26524;&#30340;&#38382;&#39064;&#12290;&#25105;&#20204;&#21033;&#29992;&#30701;&#26399;&#27835;&#30103;&#21069;&#25968;&#25454;&#65292;&#22522;&#20110;&#39044;&#27979;&#21453;&#20107;&#23454;&#24773;&#20917;&#24471;&#21040;&#20102;&#20010;&#20307;&#27835;&#30103;&#25928;&#26524;&#30340;&#26080;&#20559;&#20272;&#35745;&#21644;&#24179;&#22343;&#27835;&#30103;&#25928;&#26524;&#30340;&#19968;&#33268;&#19988;&#28176;&#36817;&#27491;&#24577;&#30340;&#20272;&#35745;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#20851;&#27880;&#39044;&#27979;&#30340;&#26080;&#20559;&#24615;&#32780;&#19981;&#26159;&#20934;&#30830;&#24615;&#26159;&#24456;&#37325;&#35201;&#30340;&#65292;&#32780;&#39044;&#27979;&#27169;&#22411;&#30340;&#27491;&#30830;&#35268;&#33539;&#24182;&#19981;&#26159;&#24517;&#38656;&#30340;&#65292;&#31616;&#21333;&#30340;&#22522;&#30784;&#20989;&#25968;&#22238;&#24402;&#21487;&#20197;&#36798;&#21040;&#26080;&#20559;&#20272;&#35745;&#12290;&#22312;&#19968;&#23450;&#26465;&#20214;&#19979;&#65292;&#25105;&#20204;&#30340;&#26041;&#27861;&#20855;&#26377;&#19968;&#33268;&#24615;&#21644;&#28176;&#36817;&#27491;&#24577;&#24615;&#12290;</title><link>http://arxiv.org/abs/2309.05639</link><description>&lt;p&gt;
&#39044;&#27979;&#27835;&#30103;&#25928;&#26524;
&lt;/p&gt;
&lt;p&gt;
Forecasted Treatment Effects. (arXiv:2309.05639v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.05639
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#32771;&#34385;&#20102;&#22312;&#27809;&#26377;&#23545;&#29031;&#32452;&#30340;&#24773;&#20917;&#19979;&#20272;&#35745;&#21644;&#25512;&#26029;&#25919;&#31574;&#25928;&#26524;&#30340;&#38382;&#39064;&#12290;&#25105;&#20204;&#21033;&#29992;&#30701;&#26399;&#27835;&#30103;&#21069;&#25968;&#25454;&#65292;&#22522;&#20110;&#39044;&#27979;&#21453;&#20107;&#23454;&#24773;&#20917;&#24471;&#21040;&#20102;&#20010;&#20307;&#27835;&#30103;&#25928;&#26524;&#30340;&#26080;&#20559;&#20272;&#35745;&#21644;&#24179;&#22343;&#27835;&#30103;&#25928;&#26524;&#30340;&#19968;&#33268;&#19988;&#28176;&#36817;&#27491;&#24577;&#30340;&#20272;&#35745;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#20851;&#27880;&#39044;&#27979;&#30340;&#26080;&#20559;&#24615;&#32780;&#19981;&#26159;&#20934;&#30830;&#24615;&#26159;&#24456;&#37325;&#35201;&#30340;&#65292;&#32780;&#39044;&#27979;&#27169;&#22411;&#30340;&#27491;&#30830;&#35268;&#33539;&#24182;&#19981;&#26159;&#24517;&#38656;&#30340;&#65292;&#31616;&#21333;&#30340;&#22522;&#30784;&#20989;&#25968;&#22238;&#24402;&#21487;&#20197;&#36798;&#21040;&#26080;&#20559;&#20272;&#35745;&#12290;&#22312;&#19968;&#23450;&#26465;&#20214;&#19979;&#65292;&#25105;&#20204;&#30340;&#26041;&#27861;&#20855;&#26377;&#19968;&#33268;&#24615;&#21644;&#28176;&#36817;&#27491;&#24577;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#32771;&#34385;&#22312;&#27809;&#26377;&#23545;&#29031;&#32452;&#30340;&#24773;&#20917;&#19979;&#20272;&#35745;&#21644;&#25512;&#26029;&#25919;&#31574;&#25928;&#26524;&#12290;&#25105;&#20204;&#22522;&#20110;&#20351;&#29992;&#19968;&#27573;&#30701;&#26399;&#27835;&#30103;&#21069;&#25968;&#25454;&#39044;&#27979;&#21453;&#20107;&#23454;&#24773;&#20917;&#65292;&#24471;&#21040;&#20102;&#20010;&#20307;&#65288;&#24322;&#36136;&#65289;&#27835;&#30103;&#25928;&#26524;&#30340;&#26080;&#20559;&#20272;&#35745;&#21644;&#19968;&#33268;&#19988;&#28176;&#36817;&#27491;&#24577;&#30340;&#24179;&#22343;&#27835;&#30103;&#25928;&#26524;&#20272;&#35745;&#12290;&#25105;&#20204;&#34920;&#26126;&#65292;&#24212;&#35813;&#20851;&#27880;&#39044;&#27979;&#26080;&#20559;&#24615;&#32780;&#19981;&#26159;&#20934;&#30830;&#24615;&#12290;&#23545;&#39044;&#27979;&#27169;&#22411;&#30340;&#27491;&#30830;&#35268;&#33539;&#24182;&#19981;&#26159;&#33719;&#24471;&#20010;&#20307;&#27835;&#30103;&#25928;&#26524;&#30340;&#26080;&#20559;&#20272;&#35745;&#25152;&#24517;&#38656;&#30340;&#12290;&#30456;&#21453;&#65292;&#22312;&#24191;&#27867;&#30340;&#25968;&#25454;&#29983;&#25104;&#36807;&#31243;&#19979;&#65292;&#31616;&#21333;&#30340;&#22522;&#30784;&#20989;&#25968;&#65288;&#22914;&#22810;&#39033;&#24335;&#26102;&#38388;&#36235;&#21183;&#65289;&#22238;&#24402;&#21487;&#20197;&#25552;&#20379;&#26080;&#20559;&#24615;&#26469;&#20272;&#35745;&#20010;&#20307;&#21453;&#20107;&#23454;&#24773;&#20917;&#12290;&#22522;&#20110;&#27169;&#22411;&#30340;&#39044;&#27979;&#21487;&#33021;&#24341;&#20837;&#35268;&#33539;&#38169;&#35823;&#20559;&#24046;&#65292;&#24182;&#19988;&#21363;&#20351;&#22312;&#27491;&#30830;&#35268;&#33539;&#19979;&#20063;&#19981;&#19968;&#23450;&#33021;&#25552;&#39640;&#24615;&#33021;&#12290;&#25105;&#20204;&#30340;&#39044;&#27979;&#24179;&#22343;&#27835;&#30103;&#25928;&#26524;&#65288;FAT&#65289;&#20272;&#35745;&#22120;&#30340;&#19968;&#33268;&#24615;&#21644;&#28176;&#36817;&#27491;&#24577;&#24615;&#22312;&#19968;&#23450;&#26465;&#20214;&#19979;&#24471;&#21040;&#20445;&#35777;&#12290;
&lt;/p&gt;
&lt;p&gt;
We consider estimation and inference of the effects of a policy in the absence of a control group. We obtain unbiased estimators of individual (heterogeneous) treatment effects and a consistent and asymptotically normal estimator of the average treatment effects, based on forecasting counterfactuals using a short time series of pre-treatment data. We show that the focus should be on forecast unbiasedness rather than accuracy. Correct specification of the forecasting model is not necessary to obtain unbiased estimates of individual treatment effects. Instead, simple basis function (e.g., polynomial time trends) regressions deliver unbiasedness under a broad class of data-generating processes for the individual counterfactuals. Basing the forecasts on a model can introduce misspecification bias and does not necessarily improve performance even under correct specification. Consistency and asymptotic normality of our Forecasted Average Treatment effects (FAT) estimator are attained under a
&lt;/p&gt;</description></item></channel></rss>