<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#36825;&#31687;&#35770;&#25991;&#20174;&#32479;&#35745;&#29289;&#29702;&#30340;&#35282;&#24230;&#65292;&#36890;&#36807;&#23454;&#35777;&#25968;&#25454;&#35777;&#26126;&#20102;&#20840;&#29699;&#25910;&#20837;&#30340;&#25351;&#25968;&#20998;&#24067;&#20197;&#21450;&#32654;&#22269;&#25910;&#20837;&#20998;&#37197;&#30340;&#20004;&#31867;&#32467;&#26500;&#65292;&#36825;&#23545;&#20110;&#32463;&#27982;&#23398;&#20013;&#30340;&#32463;&#27982;&#19981;&#24179;&#31561;&#38382;&#39064;&#25552;&#20379;&#20102;&#26032;&#30340;&#35270;&#35282;&#21644;&#35299;&#37322;&#12290;</title><link>http://arxiv.org/abs/2307.02470</link><description>&lt;p&gt;
&#32463;&#27982;&#19981;&#24179;&#31561;&#30340;&#32479;&#35745;&#29289;&#29702;&#35270;&#35282;
&lt;/p&gt;
&lt;p&gt;
Statistical Physics Perspective on Economic Inequality. (arXiv:2307.02470v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.02470
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#20174;&#32479;&#35745;&#29289;&#29702;&#30340;&#35282;&#24230;&#65292;&#36890;&#36807;&#23454;&#35777;&#25968;&#25454;&#35777;&#26126;&#20102;&#20840;&#29699;&#25910;&#20837;&#30340;&#25351;&#25968;&#20998;&#24067;&#20197;&#21450;&#32654;&#22269;&#25910;&#20837;&#20998;&#37197;&#30340;&#20004;&#31867;&#32467;&#26500;&#65292;&#36825;&#23545;&#20110;&#32463;&#27982;&#23398;&#20013;&#30340;&#32463;&#27982;&#19981;&#24179;&#31561;&#38382;&#39064;&#25552;&#20379;&#20102;&#26032;&#30340;&#35270;&#35282;&#21644;&#35299;&#37322;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#26159;&#25105;&#22312;&#12298;&#22797;&#26434;&#32463;&#27982;&#23398;&#25163;&#20876;&#12299;&#65288;2023&#65289;&#20013;&#20027;&#35201;&#36129;&#29486;&#30340;&#34917;&#20805;&#12290;&#22522;&#20110;&#26368;&#36817;&#30340;&#19977;&#31687;&#35770;&#25991;&#65292;&#20174;&#32479;&#35745;&#29289;&#29702;&#30340;&#35282;&#24230;&#25552;&#20986;&#20102;&#19968;&#31181;&#38750;&#20256;&#32479;&#30340;&#32463;&#27982;&#19981;&#24179;&#31561;&#35270;&#35282;&#12290;&#20854;&#20013;&#19968;&#33410;&#23637;&#31034;&#20102;&#20840;&#29699;67&#20010;&#22269;&#23478;&#25910;&#20837;&#30340;&#25351;&#25968;&#20998;&#24067;&#30340;&#23454;&#35777;&#35777;&#25454;&#12290;&#25351;&#25968;&#20998;&#24067;&#22312;&#20027;&#27969;&#32463;&#27982;&#23398;&#23478;&#20013;&#24182;&#19981;&#24120;&#35265;&#65292;&#30452;&#21040;&#29289;&#29702;&#23398;&#23478;&#36890;&#36807;&#31867;&#27604;&#29627;&#23572;&#20857;&#26364;-&#21513;&#24067;&#26031;&#20998;&#24067;&#33021;&#37327;&#30340;&#26041;&#24335;&#24341;&#20837;&#65292;&#24182;&#36890;&#36807;&#23454;&#35777;&#25968;&#25454;&#22312;&#35768;&#22810;&#22269;&#23478;&#24471;&#21040;&#30830;&#35748;&#12290;&#21478;&#19968;&#33410;&#22238;&#39038;&#20102;&#32654;&#22269;&#25910;&#20837;&#20998;&#37197;&#30340;&#20004;&#31867;&#32467;&#26500;&#12290;&#34429;&#28982;&#25351;&#25968;&#23450;&#24459;&#25551;&#36848;&#20102;&#22823;&#22810;&#25968;&#20154;&#21475;&#65288;&#19979;&#23618;&#38454;&#32423;&#65289;&#65292;&#20294;&#25910;&#20837;&#20998;&#24067;&#30340;&#39030;&#23614;&#65288;&#19978;&#23618;&#38454;&#32423;&#65289;&#20197;&#24085;&#32047;&#25176;&#24130;&#23450;&#24459;&#20026;&#29305;&#24449;&#65292;&#24182;&#19988;&#20043;&#38388;&#27809;&#26377;&#26126;&#30830;&#23450;&#20041;&#30340;&#20013;&#20135;&#38454;&#32423;&#12290;&#22240;&#27492;&#65292;&#25972;&#20010;&#20998;&#24067;&#21487;&#20197;&#20165;&#20351;&#29992;&#36825;&#20004;&#20010;&#23450;&#24459;&#38750;&#24120;&#22909;&#22320;&#25311;&#21512;&#12290;
&lt;/p&gt;
&lt;p&gt;
This article is a supplement to my main contribution to the Routledge Handbook of Complexity Economics (2023). On the basis of three recent papers, it presents an unconventional perspective on economic inequality from a statistical physics point of view. One section demonstrates empirical evidence for the exponential distribution of income in 67 countries around the world. The exponential distribution was not familiar to mainstream economists until it was introduced by physicists by analogy with the Boltzmann-Gibbs distribution of energy and subsequently confirmed in empirical data for many countries. Another section reviews the two-class structure of income distribution in the USA. While the exponential law describes the majority of population (the lower class), the top tail of income distribution (the upper class) is characterized by the Pareto power law, and there is no clearly defined middle class in between. As a result, the whole distribution can be very well fitted by using only
&lt;/p&gt;</description></item><item><title>&#24310;&#36831;&#36864;&#20241;&#20844;&#21578;&#23545;&#20013;&#22269;&#23478;&#24237;&#30340;&#20648;&#33988;&#29575;&#20135;&#29983;&#20102;&#26174;&#33879;&#30340;&#24433;&#21709;&#65292;&#29305;&#21035;&#26159;&#23545;&#39640;&#25910;&#20837;&#23478;&#24237;&#12290;&#36825;&#31181;&#24433;&#21709;&#19982;&#20154;&#20204;&#23545;&#26410;&#26469;&#20859;&#32769;&#37329;&#25910;&#20837;&#30340;&#36127;&#38754;&#39044;&#26399;&#26377;&#20851;&#12290;</title><link>http://arxiv.org/abs/2307.02455</link><description>&lt;p&gt;
&#25919;&#31574;&#39044;&#26399;&#26377;&#20851;&#21527;&#65311;&#24310;&#36831;&#36864;&#20241;&#20844;&#21578;&#23545;&#22478;&#24066;&#23478;&#24237;&#20648;&#33988;&#29575;&#30340;&#24433;&#21709;
&lt;/p&gt;
&lt;p&gt;
Policy Expectation Counts? The Impact of Delayed Retirement Announcement on Urban Households Savings Rates. (arXiv:2307.02455v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.02455
&lt;/p&gt;
&lt;p&gt;
&#24310;&#36831;&#36864;&#20241;&#20844;&#21578;&#23545;&#20013;&#22269;&#23478;&#24237;&#30340;&#20648;&#33988;&#29575;&#20135;&#29983;&#20102;&#26174;&#33879;&#30340;&#24433;&#21709;&#65292;&#29305;&#21035;&#26159;&#23545;&#39640;&#25910;&#20837;&#23478;&#24237;&#12290;&#36825;&#31181;&#24433;&#21709;&#19982;&#20154;&#20204;&#23545;&#26410;&#26469;&#20859;&#32769;&#37329;&#25910;&#20837;&#30340;&#36127;&#38754;&#39044;&#26399;&#26377;&#20851;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#21033;&#29992;&#20013;&#22269;&#23478;&#24237;&#36861;&#36394;&#35843;&#26597;&#25968;&#25454;&#65292;&#30740;&#31350;&#20102;&#24310;&#36831;&#36864;&#20241;&#20844;&#21578;&#23545;&#23478;&#24237;&#20648;&#33988;&#34892;&#20026;&#30340;&#24433;&#21709;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#21463;&#21040;&#25919;&#31574;&#20844;&#21578;&#24433;&#21709;&#30340;&#23478;&#24237;&#30340;&#20648;&#33988;&#29575;&#24179;&#22343;&#22686;&#21152;&#20102;8%&#12290;&#36825;&#20010;&#20272;&#35745;&#32467;&#26524;&#26174;&#33879;&#19988;&#31283;&#20581;&#12290;&#19981;&#21516;&#31867;&#22411;&#30340;&#23478;&#24237;&#23545;&#25919;&#31574;&#20844;&#21578;&#30340;&#21709;&#24212;&#31243;&#24230;&#19981;&#21516;&#65292;&#39640;&#25910;&#20837;&#23478;&#24237;&#30340;&#24433;&#21709;&#26356;&#22823;&#12290;&#23478;&#24237;&#20648;&#33988;&#30340;&#22686;&#21152;&#21487;&#20197;&#24402;&#22240;&#20110;&#23545;&#26410;&#26469;&#20859;&#32769;&#37329;&#25910;&#20837;&#30340;&#36127;&#38754;&#39044;&#26399;&#12290;
&lt;/p&gt;
&lt;p&gt;
This article examines the effects of a delayed retirement announcement on households' savings behavior using data from China Family Panel Studies (CFPS). The article finds that treated households, on average, experience an 8% increase in savings rates as a result of the policy announcement. This estimation is both significant and robust. Different types of households exhibit varying degrees of responsiveness to the policy announcement, with higher-income households showing a greater impact. The increase in household savings can be attributed to negative perceptions about future pension income.
&lt;/p&gt;</description></item><item><title>&#36825;&#39033;&#30740;&#31350;&#21457;&#23637;&#20102;&#19968;&#31181;&#22522;&#20110;&#32479;&#35745;&#36317;&#31163;&#30340;&#26041;&#27861;&#65292;&#25581;&#31034;&#20102;&#29702;&#24819;&#20027;&#20041;&#24605;&#32500;&#30340;&#39118;&#38505;&#24605;&#32500;&#65292;&#25506;&#35752;&#20102;&#29702;&#24819;&#20027;&#20041;&#20915;&#31574;&#32773;&#20559;&#26012;&#21644;&#39118;&#38505;&#36873;&#25321;&#30340;&#20559;&#22909;&#26465;&#20214;&#12290;</title><link>http://arxiv.org/abs/2307.02422</link><description>&lt;p&gt;
&#19968;&#31181;&#22522;&#20110;&#32479;&#35745;&#36317;&#31163;&#30340;&#26041;&#27861;&#25581;&#31034;&#20102;&#29702;&#24819;&#20027;&#20041;&#24605;&#32500;&#30340;&#39118;&#38505;&#24605;&#32500;
&lt;/p&gt;
&lt;p&gt;
Wishful Thinking is Risky Thinking: A Statistical-Distance Based Approach. (arXiv:2307.02422v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.02422
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#30740;&#31350;&#21457;&#23637;&#20102;&#19968;&#31181;&#22522;&#20110;&#32479;&#35745;&#36317;&#31163;&#30340;&#26041;&#27861;&#65292;&#25581;&#31034;&#20102;&#29702;&#24819;&#20027;&#20041;&#24605;&#32500;&#30340;&#39118;&#38505;&#24605;&#32500;&#65292;&#25506;&#35752;&#20102;&#29702;&#24819;&#20027;&#20041;&#20915;&#31574;&#32773;&#20559;&#26012;&#21644;&#39118;&#38505;&#36873;&#25321;&#30340;&#20559;&#22909;&#26465;&#20214;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#21457;&#23637;&#20102;&#19968;&#20010;&#29702;&#24819;&#20027;&#20041;&#24605;&#32500;&#27169;&#22411;&#65292;&#32771;&#34385;&#20102;&#20559;&#35265;&#20449;&#24565;&#30340;&#25104;&#26412;&#21644;&#25910;&#30410;&#12290;&#25105;&#20204;&#24314;&#31435;&#20102;&#25197;&#26354;&#20449;&#24565;&#19982;&#39118;&#38505;&#20043;&#38388;&#30340;&#32852;&#31995;&#65292;&#25581;&#31034;&#20102;&#29702;&#24819;&#20027;&#20041;&#24605;&#32500;&#22914;&#20309;&#20174;&#39118;&#38505;&#24230;&#37327;&#30340;&#35282;&#24230;&#29702;&#35299;&#12290;&#25105;&#20204;&#30340;&#27169;&#22411;&#21253;&#21547;&#26497;&#31471;&#20449;&#24565;&#65292;&#20801;&#35768;&#29702;&#24819;&#20027;&#20041;&#20915;&#31574;&#32773;&#23545;&#19981;&#33391;&#29366;&#24577;&#36171;&#20104;&#38646;&#27010;&#29575;&#65292;&#24182;&#23545;&#20854;&#20182;&#19981;&#21487;&#33021;&#29366;&#24577;&#36171;&#20104;&#27491;&#27010;&#29575;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36824;&#35777;&#26126;&#20102;&#38408;&#20540;&#20449;&#24565;&#25197;&#26354;&#25104;&#26412;&#20989;&#25968;&#31867;&#30340;&#29702;&#24819;&#20027;&#20041;&#24605;&#32500;&#34892;&#20026;&#31561;&#21516;&#20110;&#20998;&#20301;&#25968;&#25928;&#29992;&#26368;&#22823;&#21270;&#12290;&#26368;&#21518;&#65292;&#21033;&#29992;&#36825;&#20010;&#31561;&#20215;&#24615;&#65292;&#25105;&#20204;&#25512;&#23548;&#20986;&#20048;&#35266;&#30340;&#20915;&#31574;&#32773;&#26356;&#21916;&#27426;&#20559;&#26012;&#21644;&#26356;&#20855;&#39118;&#38505;&#30340;&#36873;&#25321;&#30340;&#26465;&#20214;&#12290;
&lt;/p&gt;
&lt;p&gt;
We develop a model of wishful thinking that incorporates the costs and benefits of biased beliefs. We establish the connection between distorted beliefs and risk, revealing how wishful thinking can be understood in terms of risk measures. Our model accommodates extreme beliefs, allowing wishful-thinking decision-makers to assign zero probability to undesirable states and positive probability to otherwise impossible states. Furthermore, we establish that wishful thinking behavior is equivalent to quantile-utility maximization for the class of threshold beliefs distortion cost functions. Finally, exploiting this equivalence, we derive conditions under which an optimistic decision-maker prefers skewed and riskier choices.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#20351;&#29992;&#36125;&#21494;&#26031;&#21464;&#28857;&#26816;&#27979;&#26041;&#27861;&#35782;&#21035;&#23454;&#26102;&#35746;&#21333;&#27969;&#21464;&#21270;&#30340;&#26041;&#27861;&#65292;&#24182;&#36890;&#36807;&#24320;&#21457;&#19968;&#31181;&#26032;&#30340;BOCPD&#26041;&#27861;&#65292;&#21487;&#20197;&#26356;&#20934;&#30830;&#22320;&#39044;&#27979;&#35746;&#21333;&#27969;&#21644;&#24066;&#22330;&#24433;&#21709;&#12290;&#23454;&#35777;&#32467;&#26524;&#34920;&#26126;&#65292;&#25105;&#20204;&#30340;&#27169;&#22411;&#22312;&#26679;&#26412;&#22806;&#39044;&#27979;&#24615;&#33021;&#19978;&#20248;&#20110;&#29616;&#26377;&#27169;&#22411;&#12290;</title><link>http://arxiv.org/abs/2307.02375</link><description>&lt;p&gt;
&#22312;&#32447;&#23398;&#20064;&#35746;&#21333;&#27969;&#19982;&#24066;&#22330;&#24433;&#21709;&#30340;&#36125;&#21494;&#26031;&#21464;&#28857;&#26816;&#27979;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Online Learning of Order Flow and Market Impact with Bayesian Change-Point Detection Methods. (arXiv:2307.02375v1 [q-fin.TR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.02375
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#20351;&#29992;&#36125;&#21494;&#26031;&#21464;&#28857;&#26816;&#27979;&#26041;&#27861;&#35782;&#21035;&#23454;&#26102;&#35746;&#21333;&#27969;&#21464;&#21270;&#30340;&#26041;&#27861;&#65292;&#24182;&#36890;&#36807;&#24320;&#21457;&#19968;&#31181;&#26032;&#30340;BOCPD&#26041;&#27861;&#65292;&#21487;&#20197;&#26356;&#20934;&#30830;&#22320;&#39044;&#27979;&#35746;&#21333;&#27969;&#21644;&#24066;&#22330;&#24433;&#21709;&#12290;&#23454;&#35777;&#32467;&#26524;&#34920;&#26126;&#65292;&#25105;&#20204;&#30340;&#27169;&#22411;&#22312;&#26679;&#26412;&#22806;&#39044;&#27979;&#24615;&#33021;&#19978;&#20248;&#20110;&#29616;&#26377;&#27169;&#22411;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#37329;&#34701;&#35746;&#21333;&#27969;&#34920;&#29616;&#20986;&#26126;&#26174;&#30340;&#25345;&#20037;&#24615;&#65292;&#20080;&#20837;&#65288;&#21334;&#20986;&#65289;&#20132;&#26131;&#24120;&#24120;&#20250;&#22312;&#19968;&#23450;&#26102;&#38388;&#27573;&#21518;&#36319;&#38543;&#30528;&#36827;&#19968;&#27493;&#30340;&#20080;&#20837;&#65288;&#21334;&#20986;&#65289;&#20132;&#26131;&#12290;&#36825;&#31181;&#25345;&#20037;&#24615;&#21487;&#20197;&#24402;&#22240;&#20110;&#22823;&#35746;&#21333;&#30340;&#21010;&#20998;&#21644;&#36880;&#27493;&#25191;&#34892;&#12290;&#22240;&#27492;&#65292;&#21487;&#33021;&#20250;&#20986;&#29616;&#19981;&#21516;&#30340;&#35746;&#21333;&#27969;&#27169;&#24335;&#65292;&#21487;&#20197;&#36890;&#36807;&#36866;&#29992;&#20110;&#24066;&#22330;&#25968;&#25454;&#30340;&#36866;&#24403;&#26102;&#38388;&#24207;&#21015;&#27169;&#22411;&#26469;&#35782;&#21035;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#20351;&#29992;&#36125;&#21494;&#26031;&#22312;&#32447;&#21464;&#28857;&#26816;&#27979;&#65288;BOCPD&#65289;&#26041;&#27861;&#26469;&#23454;&#26102;&#35782;&#21035;&#21046;&#24230;&#24615;&#36716;&#21464;&#65292;&#24182;&#23454;&#29616;&#35746;&#21333;&#27969;&#21644;&#24066;&#22330;&#24433;&#21709;&#30340;&#22312;&#32447;&#39044;&#27979;&#12290;&#20026;&#20102;&#25552;&#39640;&#25105;&#20204;&#26041;&#27861;&#30340;&#26377;&#25928;&#24615;&#65292;&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#31181;&#20351;&#29992;&#35780;&#20998;&#39537;&#21160;&#26041;&#27861;&#30340;&#26032;&#22411;BOCPD&#26041;&#27861;&#12290;&#35813;&#26041;&#27861;&#36866;&#24212;&#27599;&#20010;&#21046;&#24230;&#20869;&#30340;&#26102;&#38388;&#30456;&#20851;&#24615;&#21644;&#26102;&#38388;&#21464;&#21270;&#21442;&#25968;&#12290;&#36890;&#36807;&#23545;&#32435;&#26031;&#36798;&#20811;&#25968;&#25454;&#30340;&#23454;&#35777;&#24212;&#29992;&#65292;&#25105;&#20204;&#21457;&#29616;&#65306;&#65288;i&#65289;&#25105;&#20204;&#26032;&#25552;&#20986;&#30340;&#27169;&#22411;&#23637;&#31034;&#20986;&#20248;&#20110;&#29616;&#26377;&#20551;&#35774;&#29420;&#31435;&#21516;&#20998;&#24067;&#30340;&#27169;&#22411;&#30340;&#26679;&#26412;&#22806;&#39044;&#27979;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;
Financial order flow exhibits a remarkable level of persistence, wherein buy (sell) trades are often followed by subsequent buy (sell) trades over extended periods. This persistence can be attributed to the division and gradual execution of large orders. Consequently, distinct order flow regimes might emerge, which can be identified through suitable time series models applied to market data. In this paper, we propose the use of Bayesian online change-point detection (BOCPD) methods to identify regime shifts in real-time and enable online predictions of order flow and market impact. To enhance the effectiveness of our approach, we have developed a novel BOCPD method using a score-driven approach. This method accommodates temporal correlations and time-varying parameters within each regime. Through empirical application to NASDAQ data, we have found that: (i) Our newly proposed model demonstrates superior out-of-sample predictive performance compared to existing models that assume i.i.d.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#20998;&#31867;&#31639;&#27861;&#22312;&#20915;&#31574;&#20013;&#30340;&#24212;&#29992;&#21644;&#24433;&#21709;&#65292;&#37325;&#28857;&#32771;&#23519;&#20102;&#31639;&#27861;&#35774;&#35745;&#23545;&#20154;&#32676;&#34892;&#20026;&#20998;&#24067;&#30340;&#24433;&#21709;&#65292;&#20197;&#21450;&#20998;&#31867;&#22870;&#24809;&#30340;&#27665;&#20027;&#21270;&#23545;&#31038;&#20250;&#30340;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2307.02319</link><description>&lt;p&gt;
&#31639;&#27861;&#12289;&#28608;&#21169;&#21644;&#27665;&#20027;
&lt;/p&gt;
&lt;p&gt;
Algorithms, Incentives, and Democracy. (arXiv:2307.02319v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.02319
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#20998;&#31867;&#31639;&#27861;&#22312;&#20915;&#31574;&#20013;&#30340;&#24212;&#29992;&#21644;&#24433;&#21709;&#65292;&#37325;&#28857;&#32771;&#23519;&#20102;&#31639;&#27861;&#35774;&#35745;&#23545;&#20154;&#32676;&#34892;&#20026;&#20998;&#24067;&#30340;&#24433;&#21709;&#65292;&#20197;&#21450;&#20998;&#31867;&#22870;&#24809;&#30340;&#27665;&#20027;&#21270;&#23545;&#31038;&#20250;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20998;&#31867;&#31639;&#27861;&#22312;&#25151;&#23627;&#12289;&#20449;&#36151;&#21644;&#25191;&#27861;&#31561;&#39046;&#22495;&#36234;&#26469;&#36234;&#24191;&#27867;&#22320;&#34987;&#29992;&#20110;&#20915;&#31574;&#65292;&#24433;&#21709;&#20154;&#20204;&#30340;&#29983;&#27963;&#12290;&#36825;&#20123;&#31639;&#27861;&#21487;&#20197;&#26377;&#24847;&#22320;&#25913;&#21464;&#20010;&#20307;&#34892;&#20026;&#65288;&#36890;&#36807;&#27450;&#35784;&#39044;&#27979;&#31639;&#27861;&#39044;&#38450;&#27450;&#35784;&#34892;&#20026;&#65289;&#65292;&#20063;&#21487;&#20197;&#26080;&#24847;&#20013;&#25913;&#21464;&#34892;&#20026;&#65288;&#36890;&#36807;&#20869;&#23481;&#25490;&#24207;&#31639;&#27861;&#20256;&#25773;&#34394;&#20551;&#20449;&#24687;&#65289;&#65292;&#23427;&#20204;&#36234;&#26469;&#36234;&#38754;&#20020;&#20844;&#20247;&#23457;&#26597;&#21644;&#30417;&#31649;&#12290;&#26412;&#25991;&#30740;&#31350;&#20102;&#31639;&#27861;&#35774;&#35745;&#32773;&#36890;&#36807;&#26368;&#20248;&#20998;&#31867;&#22914;&#20309;&#24433;&#21709;&#20154;&#32676;&#34892;&#20026;&#30340;&#20998;&#24067;&#65292;&#26377;&#26102;&#20250;&#20135;&#29983;&#24847;&#24819;&#19981;&#21040;&#30340;&#32467;&#26524;&#12290;&#28982;&#21518;&#25105;&#20204;&#30740;&#31350;&#20102;&#23545;&#31639;&#27861;&#20998;&#31867;&#30340;&#22870;&#24809;&#25110;&#21033;&#23475;&#20851;&#31995;&#36827;&#34892;&#27665;&#20027;&#21270;&#30340;&#24433;&#21709;&#65292;&#20197;&#25506;&#35752;&#31038;&#20250;&#22914;&#20309;&#28508;&#22312;&#22320;&#38450;&#27490;&#65288;&#25110;&#20419;&#36827;&#65289;&#25504;&#22842;&#24615;&#20998;&#31867;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#32467;&#26524;&#28041;&#21450;&#31639;&#27861;&#20844;&#24179;&#24615;&#30340;&#38382;&#39064;&#65292;&#22312;&#29305;&#23450;&#20998;&#31867;&#30340;&#24773;&#22659;&#20013;&#20855;&#26377;&#37325;&#35201;&#24847;&#20041;&#12290;
&lt;/p&gt;
&lt;p&gt;
Classification algorithms are increasingly used in areas such as housing, credit, and law enforcement in order to make decisions affecting peoples' lives. These algorithms can change individual behavior deliberately (a fraud prediction algorithm deterring fraud) or inadvertently (content sorting algorithms spreading misinformation), and they are increasingly facing public scrutiny and regulation. Some of these regulations, like the elimination of cash bail in some states, have focused on \textit{lowering the stakes of certain classifications}. In this paper we characterize how optimal classification by an algorithm designer can affect the distribution of behavior in a population -- sometimes in surprising ways. We then look at the effect of democratizing the rewards and punishments, or stakes, to algorithmic classification to consider how a society can potentially stem (or facilitate!) predatory classification. Our results speak to questions of algorithmic fairness in settings where be
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#20171;&#32461;&#20102;&#19968;&#31181;&#33258;&#21160;&#21270;&#24066;&#22330;&#21046;&#36896;&#21830;&#65288;AMM&#65289;&#30340;&#35774;&#35745;&#21709;&#24212;&#8212;&#8212;&#20351;&#29992;&#25209;&#37327;&#20132;&#26131;&#12290;&#36890;&#36807;&#25209;&#37327;&#20132;&#26131;&#20197;&#36793;&#38469;&#20215;&#26684;&#36827;&#34892;&#20132;&#26131;&#65292;&#20351;&#24471;AMM&#33021;&#22815;&#26368;&#22823;&#21270;&#20854;&#21151;&#33021;&#65292;&#24182;&#28040;&#38500;&#22871;&#21033;&#21033;&#28070;&#21644;&#22841;&#24515;&#25915;&#20987;&#30340;&#38382;&#39064;&#12290;&#30740;&#31350;&#20351;&#29992;&#24065;&#23433;&#20215;&#26684;&#25968;&#25454;&#36827;&#34892;&#27169;&#25311;&#65292;&#32467;&#26524;&#26174;&#31034;&#65292;&#25552;&#20379;&#27969;&#21160;&#24615;&#32473;AMM&#30340;&#25910;&#30410;&#19979;&#38480;&#19982;&#22312;Uniswap v3&#19978;&#25552;&#20379;&#27969;&#21160;&#24615;&#30340;&#23454;&#38469;&#25910;&#30410;&#38750;&#24120;&#25509;&#36817;&#12290;</title><link>http://arxiv.org/abs/2307.02074</link><description>&lt;p&gt;
&#31639;&#27861;&#20132;&#26131;&#21592;&#30340;&#21033;&#28070;&#12289;LVR&#21644;&#22841;&#24515;&#25915;&#20987;&#65306;&#25209;&#37327;&#20132;&#26131;&#20316;&#20026;AMM&#35774;&#35745;&#30340;&#21709;&#24212;
&lt;/p&gt;
&lt;p&gt;
Arbitrageurs' profits, LVR, and sandwich attacks: batch trading as an AMM design response. (arXiv:2307.02074v1 [cs.DC])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.02074
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#20171;&#32461;&#20102;&#19968;&#31181;&#33258;&#21160;&#21270;&#24066;&#22330;&#21046;&#36896;&#21830;&#65288;AMM&#65289;&#30340;&#35774;&#35745;&#21709;&#24212;&#8212;&#8212;&#20351;&#29992;&#25209;&#37327;&#20132;&#26131;&#12290;&#36890;&#36807;&#25209;&#37327;&#20132;&#26131;&#20197;&#36793;&#38469;&#20215;&#26684;&#36827;&#34892;&#20132;&#26131;&#65292;&#20351;&#24471;AMM&#33021;&#22815;&#26368;&#22823;&#21270;&#20854;&#21151;&#33021;&#65292;&#24182;&#28040;&#38500;&#22871;&#21033;&#21033;&#28070;&#21644;&#22841;&#24515;&#25915;&#20987;&#30340;&#38382;&#39064;&#12290;&#30740;&#31350;&#20351;&#29992;&#24065;&#23433;&#20215;&#26684;&#25968;&#25454;&#36827;&#34892;&#27169;&#25311;&#65292;&#32467;&#26524;&#26174;&#31034;&#65292;&#25552;&#20379;&#27969;&#21160;&#24615;&#32473;AMM&#30340;&#25910;&#30410;&#19979;&#38480;&#19982;&#22312;Uniswap v3&#19978;&#25552;&#20379;&#27969;&#21160;&#24615;&#30340;&#23454;&#38469;&#25910;&#30410;&#38750;&#24120;&#25509;&#36817;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#32771;&#34385;&#20102;&#19968;&#31181;&#33258;&#21160;&#21270;&#24066;&#22330;&#21046;&#36896;&#21830;&#65288;AMM&#65289;&#65292;&#20854;&#20013;&#25152;&#26377;&#20132;&#26131;&#37117;&#20197;&#25209;&#37327;&#26041;&#24335;&#25191;&#34892;&#65292;&#24182;&#22312;&#25209;&#37327;&#20132;&#26131;&#21518;&#20197;&#36793;&#38469;&#20215;&#26684;&#65288;&#21363;&#20219;&#24847;&#23567;&#39069;&#20132;&#26131;&#30340;&#20215;&#26684;&#65289;&#36827;&#34892;&#20132;&#26131;&#12290;&#25105;&#20204;&#34920;&#26126;&#65292;&#36825;&#31181;AMM&#26159;&#26368;&#22823;&#21270;AMM&#21151;&#33021;&#65288;&#25110;FM-AMM&#65289;&#30340;&#20989;&#25968;&#65306;&#23545;&#20110;&#32473;&#23450;&#30340;&#20215;&#26684;&#65292;&#23427;&#20132;&#26131;&#20197;&#36798;&#21040;&#32473;&#23450;&#20989;&#25968;&#30340;&#26368;&#39640;&#21487;&#33021;&#20215;&#20540;&#12290;&#27492;&#22806;&#65292;&#31639;&#27861;&#20132;&#26131;&#21592;&#20043;&#38388;&#30340;&#31454;&#20105;&#20445;&#35777;&#20102;FM-AMM&#22987;&#32456;&#20197;&#20844;&#24179;&#12289;&#22343;&#34913;&#30340;&#20215;&#26684;&#36827;&#34892;&#20132;&#26131;&#65292;&#24182;&#28040;&#38500;&#20102;&#22871;&#21033;&#21033;&#28070;&#65288;&#20063;&#31216;&#20026;LVR&#65289;&#12290;&#22841;&#24515;&#25915;&#20987;&#20063;&#34987;&#28040;&#38500;&#65292;&#22240;&#20026;&#25152;&#26377;&#20132;&#26131;&#21457;&#29983;&#22312;&#22806;&#29983;&#30830;&#23450;&#30340;&#22343;&#34913;&#20215;&#26684;&#19978;&#12290;&#25105;&#20204;&#20351;&#29992;&#24065;&#23433;&#20215;&#26684;&#25968;&#25454;&#27169;&#25311;&#25552;&#20379;&#27969;&#21160;&#24615;&#32473;FM-AMM&#30340;&#25910;&#30410;&#19979;&#38480;&#65292;&#24182;&#34920;&#26126;&#65292;&#33267;&#23569;&#23545;&#20110;&#25105;&#20204;&#32771;&#34385;&#30340;&#20195;&#24065;&#23545;&#21644;&#26102;&#38388;&#27573;&#26469;&#35828;&#65292;&#36825;&#31181;&#19979;&#38480;&#38750;&#24120;&#25509;&#36817;&#22312;Uniswap v3&#19978;&#25552;&#20379;&#27969;&#21160;&#24615;&#30340;&#23454;&#35777;&#25910;&#30410;&#12290;
&lt;/p&gt;
&lt;p&gt;
We consider an automated market maker (AMM) in which all trades are batched and executed at a price equal to the marginal price (i.e., the price of an arbitrary small trade) after the batch trades. We show that such an AMM is a function maximizing AMM (or FM-AMM): for given prices, it trades to reach the highest possible value of a given function. Also, competition between arbitrageurs guarantees that an FM-AMM always trades at a fair, equilibrium price, and arbitrage profits (also known as LVR) are eliminated. Sandwich attacks are also eliminated because all trades occur at the exogenously-determined equilibrium price. We use Binance price data to simulate a lower bound to the return of providing liquidity to an FM-AMM and show that, at least for the token pairs and the period we consider, such lower bound is very close to the empirical returns of providing liquidity on Uniswap v3.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#36890;&#36807;&#24341;&#20837;&#25345;&#32493;&#26102;&#38388;&#30340;&#38543;&#26426;&#25968;&#37327;&#21644;&#26377;&#38480;&#22343;&#20540;&#30340;&#35201;&#27714;&#65292;&#23545;&#24191;&#20041;&#33258;&#22238;&#24402;&#26465;&#20214;&#25345;&#32493;&#26102;&#38388;&#27169;&#22411;&#30340;&#28176;&#36817;&#24615;&#36136;&#36827;&#34892;&#20102;&#20998;&#26512;&#12290;</title><link>http://arxiv.org/abs/2307.01779</link><description>&lt;p&gt;
&#24191;&#20041;&#33258;&#22238;&#24402;&#26465;&#20214;&#25345;&#32493;&#26102;&#38388;&#27169;&#22411;&#30340;&#28176;&#36817;&#24615;&#36136;
&lt;/p&gt;
&lt;p&gt;
Asymptotics for the Generalized Autoregressive Conditional Duration Model. (arXiv:2307.01779v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.01779
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36890;&#36807;&#24341;&#20837;&#25345;&#32493;&#26102;&#38388;&#30340;&#38543;&#26426;&#25968;&#37327;&#21644;&#26377;&#38480;&#22343;&#20540;&#30340;&#35201;&#27714;&#65292;&#23545;&#24191;&#20041;&#33258;&#22238;&#24402;&#26465;&#20214;&#25345;&#32493;&#26102;&#38388;&#27169;&#22411;&#30340;&#28176;&#36817;&#24615;&#36136;&#36827;&#34892;&#20102;&#20998;&#26512;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
Engle&#21644;Russell (1998, Econometrica, 66:1127-1162)&#23558;GARCH&#25991;&#29486;&#20013;&#30340;&#32467;&#26524;&#24212;&#29992;&#21040;&#24191;&#20041;&#33258;&#22238;&#24402;&#26465;&#20214;&#25345;&#32493;&#26102;&#38388;&#65288;ACD&#65289;&#27169;&#22411;&#30340;(&#25351;&#25968;) QMLE&#30340;&#19968;&#33268;&#24615;&#21644;&#28176;&#36817;&#27491;&#24577;&#24615;&#30340;&#35777;&#26126;&#20013;&#65292;&#20063;&#23601;&#26159;&#25152;&#35859;&#30340;ACD(1,1)&#65292;&#22312;&#20005;&#26684;&#24179;&#31283;&#21644;&#36941;&#21382;&#24615;&#30340;&#20551;&#35774;&#19979;&#12290;&#28982;&#32780;&#65292;GARCH&#30340;&#32467;&#26524;&#27809;&#26377;&#32771;&#34385;&#21040;&#32473;&#23450;&#35266;&#27979;&#26399;&#20869;&#25345;&#32493;&#26102;&#38388;&#25968;&#37327;&#26159;&#38543;&#26426;&#30340;&#36825;&#19968;&#20107;&#23454;&#12290;&#22240;&#27492;&#65292;&#19982;Engle&#21644;Russell (1998)&#30456;&#21453;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#20165;&#20165;&#20005;&#26684;&#24179;&#31283;&#21644;&#36941;&#21382;&#24615;&#26159;&#19981;&#36275;&#20197;&#20445;&#35777;&#19968;&#33268;&#24615;&#21644;&#28176;&#36817;&#27491;&#24577;&#24615;&#30340;&#65292;&#24182;&#25552;&#20379;&#20102;&#39069;&#22806;&#30340;&#20805;&#20998;&#26465;&#20214;&#26469;&#32771;&#34385;&#25345;&#32493;&#26102;&#38388;&#30340;&#38543;&#26426;&#25968;&#37327;&#12290;&#29305;&#21035;&#26159;&#65292;&#25105;&#20204;&#35748;&#20026;&#25345;&#32493;&#26102;&#38388;&#38656;&#35201;&#28385;&#36275;&#26377;&#38480;&#22343;&#20540;&#30340;&#26356;&#24378;&#35201;&#27714;&#12290;
&lt;/p&gt;
&lt;p&gt;
Engle and Russell (1998, Econometrica, 66:1127--1162) apply results from the GARCH literature to prove consistency and asymptotic normality of the (exponential) QMLE for the generalized autoregressive conditional duration (ACD) model, the so-called ACD(1,1), under the assumption of strict stationarity and ergodicity. The GARCH results, however, do not account for the fact that the number of durations over a given observation period is random. Thus, in contrast with Engle and Russell (1998), we show that strict stationarity and ergodicity alone are not sufficient for consistency and asymptotic normality, and provide additional sufficient conditions to account for the random number of durations. In particular, we argue that the durations need to satisfy the stronger requirement that they have finite mean.
&lt;/p&gt;</description></item><item><title>&#36890;&#36807;&#24341;&#20837;&#27963;&#36291;&#30340;&#21306;&#22359;&#29983;&#20135;&#32773;&#65292;&#26412;&#25991;&#30740;&#31350;&#20102;&#21306;&#22359;&#38142;&#20132;&#26131;&#36153;&#26426;&#21046;&#30340;&#28608;&#21169;&#20860;&#23481;&#24615;&#12290;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;&#22312;&#23384;&#22312;&#20027;&#21160;&#21306;&#22359;&#29983;&#20135;&#32773;&#30340;&#24773;&#20917;&#19979;&#65292;&#26082;&#33021;&#28608;&#21169;&#29992;&#25143;&#21448;&#33021;&#28608;&#21169;&#21306;&#22359;&#29983;&#20135;&#32773;&#30340;&#38750;&#24179;&#20961;&#20132;&#26131;&#36153;&#26426;&#21046;&#35774;&#35745;&#26159;&#26681;&#26412;&#22256;&#38590;&#30340;&#12290;</title><link>http://arxiv.org/abs/2307.01686</link><description>&lt;p&gt;
&#36890;&#36807;&#20027;&#21160;&#30340;&#21306;&#22359;&#29983;&#20135;&#32773;&#35774;&#35745;&#20132;&#26131;&#36153;&#26426;&#21046;
&lt;/p&gt;
&lt;p&gt;
Transaction Fee Mechanism Design with Active Block Producers. (arXiv:2307.01686v1 [cs.GT])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.01686
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#24341;&#20837;&#27963;&#36291;&#30340;&#21306;&#22359;&#29983;&#20135;&#32773;&#65292;&#26412;&#25991;&#30740;&#31350;&#20102;&#21306;&#22359;&#38142;&#20132;&#26131;&#36153;&#26426;&#21046;&#30340;&#28608;&#21169;&#20860;&#23481;&#24615;&#12290;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;&#22312;&#23384;&#22312;&#20027;&#21160;&#21306;&#22359;&#29983;&#20135;&#32773;&#30340;&#24773;&#20917;&#19979;&#65292;&#26082;&#33021;&#28608;&#21169;&#29992;&#25143;&#21448;&#33021;&#28608;&#21169;&#21306;&#22359;&#29983;&#20135;&#32773;&#30340;&#38750;&#24179;&#20961;&#20132;&#26131;&#36153;&#26426;&#21046;&#35774;&#35745;&#26159;&#26681;&#26412;&#22256;&#38590;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20197;&#21069;&#30340;&#30740;&#31350;&#20027;&#35201;&#20851;&#27880;&#20110;&#30001;&#32431;&#31929;&#23545;&#20849;&#35782;&#23618;&#20928;&#22870;&#21169;&#24863;&#20852;&#36259;&#30340;&#8220;&#34987;&#21160;&#8221;&#21306;&#22359;&#29983;&#20135;&#32773;&#30340;&#21306;&#22359;&#38142;&#20132;&#26131;&#36153;&#26426;&#21046;&#30340;&#28608;&#21169;&#20860;&#23481;&#24615;&#12290;&#26412;&#25991;&#24341;&#20837;&#20102;&#19968;&#20010;&#27169;&#22411;&#65292;&#20854;&#20013;&#26377;&#20854;&#33258;&#24049;&#23545;&#21306;&#22359;&#26377;&#31169;&#20154;&#20272;&#20540;&#30340;&#8220;&#20027;&#21160;&#8221;&#21306;&#22359;&#29983;&#20135;&#32773;&#65288;&#20363;&#22914;&#65292;&#24212;&#29992;&#23618;&#20135;&#29983;&#30340;&#38468;&#21152;&#20215;&#20540;&#65289;&#12290;&#25105;&#20204;&#30340;&#27169;&#22411;&#20013;&#30340;&#21306;&#22359;&#29983;&#20135;&#32773;&#21097;&#20313;&#21487;&#20197;&#34987;&#35299;&#37322;&#20026;&#8220;MEV&#8221;&#19968;&#35789;&#30340;&#19968;&#31181;&#26356;&#24120;&#35265;&#30340;&#21475;&#22836;&#24847;&#20041;&#20043;&#19968;&#12290;&#26412;&#25991;&#30340;&#20027;&#35201;&#32467;&#26524;&#34920;&#26126;&#65292;&#19982;&#34987;&#21160;&#21306;&#22359;&#29983;&#20135;&#32773;&#30456;&#27604;&#65292;&#24102;&#26377;&#20027;&#21160;&#21306;&#22359;&#29983;&#20135;&#32773;&#30340;&#20132;&#26131;&#36153;&#26426;&#21046;&#35774;&#35745;&#20174;&#26681;&#26412;&#19978;&#26356;&#22256;&#38590;&#65306;&#23545;&#20110;&#29992;&#25143;&#21644;&#21306;&#22359;&#29983;&#20135;&#32773;&#32780;&#35328;&#65292;&#27809;&#26377;&#38750;&#24179;&#20961;&#30340;&#25110;&#36817;&#20284;&#26368;&#22823;&#21270;&#31119;&#21033;&#30340;&#20132;&#26131;&#36153;&#26426;&#21046;&#21487;&#20197;&#28608;&#21169;&#20860;&#23481;&#12290;&#36825;&#20123;&#32467;&#26524;&#21487;&#20197;&#34987;&#35299;&#37322;&#20026;&#22312;&#24403;&#21069;&#22686;&#21152;&#38468;&#21152;&#26426;&#21046;&#30340;&#25968;&#23398;&#27491;&#24403;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
The incentive-compatibility properties of blockchain transaction fee mechanisms have been investigated with *passive* block producers that are motivated purely by the net rewards earned at the consensus layer. This paper introduces a model of *active* block producers that have their own private valuations for blocks (representing, for example, additional value derived from the application layer). The block producer surplus in our model can be interpreted as one of the more common colloquial meanings of the term ``MEV.''  The main results of this paper show that transaction fee mechanism design is fundamentally more difficult with active block producers than with passive ones: with active block producers, no non-trivial or approximately welfare-maximizing transaction fee mechanism can be incentive-compatible for both users and block producers. These results can be interpreted as a mathematical justification for the current interest in augmenting transaction fee mechanisms with additiona
&lt;/p&gt;</description></item><item><title>&#36825;&#31181;&#21452;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#23558;&#23454;&#39564;&#21644;&#35266;&#27979;&#30740;&#31350;&#32467;&#21512;&#36215;&#26469;&#65292;&#33021;&#22815;&#27979;&#35797;&#20551;&#35774;&#30340;&#36829;&#21453;&#24773;&#20917;&#24182;&#19968;&#33268;&#20272;&#35745;&#22788;&#29702;&#25928;&#24212;&#12290;&#23427;&#25552;&#20379;&#20102;&#21322;&#21442;&#25968;&#39640;&#25928;&#30340;&#22788;&#29702;&#25928;&#24212;&#20272;&#35745;&#22120;&#12290;&#36825;&#31181;&#26041;&#27861;&#22312;&#23454;&#38469;&#29615;&#22659;&#20013;&#26159;&#21487;&#34892;&#30340;&#12290;</title><link>http://arxiv.org/abs/2307.01449</link><description>&lt;p&gt;
&#23558;&#23454;&#39564;&#25968;&#25454;&#19982;&#35266;&#27979;&#25968;&#25454;&#32467;&#21512;&#30340;&#21452;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
A Double Machine Learning Approach to Combining Experimental and Observational Data. (arXiv:2307.01449v1 [stat.ME])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.01449
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31181;&#21452;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#23558;&#23454;&#39564;&#21644;&#35266;&#27979;&#30740;&#31350;&#32467;&#21512;&#36215;&#26469;&#65292;&#33021;&#22815;&#27979;&#35797;&#20551;&#35774;&#30340;&#36829;&#21453;&#24773;&#20917;&#24182;&#19968;&#33268;&#20272;&#35745;&#22788;&#29702;&#25928;&#24212;&#12290;&#23427;&#25552;&#20379;&#20102;&#21322;&#21442;&#25968;&#39640;&#25928;&#30340;&#22788;&#29702;&#25928;&#24212;&#20272;&#35745;&#22120;&#12290;&#36825;&#31181;&#26041;&#27861;&#22312;&#23454;&#38469;&#29615;&#22659;&#20013;&#26159;&#21487;&#34892;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#23454;&#39564;&#21644;&#35266;&#27979;&#30740;&#31350;&#36890;&#24120;&#30001;&#20110;&#26080;&#27861;&#27979;&#35797;&#30340;&#20551;&#35774;&#32780;&#32570;&#20047;&#26377;&#25928;&#24615;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#21452;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#65292;&#23558;&#23454;&#39564;&#21644;&#35266;&#27979;&#30740;&#31350;&#32467;&#21512;&#36215;&#26469;&#65292;&#20351;&#20174;&#19994;&#20154;&#21592;&#33021;&#22815;&#27979;&#35797;&#20551;&#35774;&#36829;&#21453;&#24773;&#20917;&#24182;&#19968;&#33268;&#20272;&#35745;&#22788;&#29702;&#25928;&#24212;&#12290;&#25105;&#20204;&#30340;&#26694;&#26550;&#22312;&#36739;&#36731;&#30340;&#20551;&#35774;&#19979;&#27979;&#35797;&#22806;&#37096;&#25928;&#24230;&#21644;&#21487;&#24573;&#35270;&#24615;&#30340;&#36829;&#21453;&#24773;&#20917;&#12290;&#24403;&#21482;&#26377;&#19968;&#20010;&#20551;&#35774;&#34987;&#36829;&#21453;&#26102;&#65292;&#25105;&#20204;&#25552;&#20379;&#21322;&#21442;&#25968;&#39640;&#25928;&#30340;&#22788;&#29702;&#25928;&#24212;&#20272;&#35745;&#22120;&#12290;&#28982;&#32780;&#65292;&#25105;&#20204;&#30340;&#26080;&#20813;&#36153;&#21320;&#39184;&#23450;&#29702;&#24378;&#35843;&#20102;&#20934;&#30830;&#35782;&#21035;&#36829;&#21453;&#30340;&#20551;&#35774;&#23545;&#19968;&#33268;&#30340;&#22788;&#29702;&#25928;&#24212;&#20272;&#35745;&#30340;&#24517;&#35201;&#24615;&#12290;&#25105;&#20204;&#36890;&#36807;&#19977;&#20010;&#23454;&#38469;&#26696;&#20363;&#30740;&#31350;&#23637;&#31034;&#20102;&#25105;&#20204;&#26041;&#27861;&#30340;&#36866;&#29992;&#24615;&#65292;&#24182;&#31361;&#20986;&#20102;&#20854;&#22312;&#23454;&#38469;&#29615;&#22659;&#20013;&#30340;&#30456;&#20851;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Experimental and observational studies often lack validity due to untestable assumptions. We propose a double machine learning approach to combine experimental and observational studies, allowing practitioners to test for assumption violations and estimate treatment effects consistently. Our framework tests for violations of external validity and ignorability under milder assumptions. When only one assumption is violated, we provide semi-parametrically efficient treatment effect estimators. However, our no-free-lunch theorem highlights the necessity of accurately identifying the violated assumption for consistent treatment effect estimation. We demonstrate the applicability of our approach in three real-world case studies, highlighting its relevance for practical settings.
&lt;/p&gt;</description></item><item><title>&#36890;&#32960;&#20943;&#32531;&#27861;&#26696;&#65288;IRA&#65289;&#30340;&#30740;&#31350;&#26174;&#31034;&#65292;&#35813;&#27861;&#26696;&#30340;&#20851;&#38190;&#26465;&#27454;&#21487;&#33021;&#20351;&#21040;2035&#24180;&#32463;&#27982;&#30340;&#25490;&#25918;&#37327;&#22312;2005&#24180;&#22522;&#30784;&#19978;&#20943;&#23569;43-48%&#12290;</title><link>http://arxiv.org/abs/2307.01443</link><description>&lt;p&gt;
&#36890;&#32960;&#20943;&#32531;&#27861;&#26696;&#30340;&#25490;&#25918;&#21644;&#33021;&#28304;&#24433;&#21709;
&lt;/p&gt;
&lt;p&gt;
Emissions and Energy Impacts of the Inflation Reduction Act. (arXiv:2307.01443v1 [physics.soc-ph])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.01443
&lt;/p&gt;
&lt;p&gt;
&#36890;&#32960;&#20943;&#32531;&#27861;&#26696;&#65288;IRA&#65289;&#30340;&#30740;&#31350;&#26174;&#31034;&#65292;&#35813;&#27861;&#26696;&#30340;&#20851;&#38190;&#26465;&#27454;&#21487;&#33021;&#20351;&#21040;2035&#24180;&#32463;&#27982;&#30340;&#25490;&#25918;&#37327;&#22312;2005&#24180;&#22522;&#30784;&#19978;&#20943;&#23569;43-48%&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22914;&#26524;&#24052;&#40654;&#21327;&#23450;&#35774;&#23450;&#30340;&#30446;&#26631;&#24471;&#20197;&#23454;&#29616;&#65292;&#20840;&#29699;&#21487;&#33021;&#23558;&#20840;&#38754;&#25511;&#21046;&#21319;&#28201;&#22312;2&#25668;&#27663;&#24230;&#20197;&#19979;&#65307;&#28982;&#32780;&#65292;&#21508;&#26041;&#22312;&#20817;&#29616;&#36825;&#20123;&#25215;&#35834;&#26041;&#38754;&#36827;&#23637;&#19981;&#39034;&#65292;&#36234;&#26469;&#36234;&#37325;&#35270;&#25919;&#31574;&#23454;&#26045;&#26469;&#32553;&#23567;&#38596;&#24515;&#21644;&#34892;&#21160;&#20043;&#38388;&#30340;&#24046;&#36317;&#12290;&#26368;&#36817;&#65292;&#32654;&#22269;&#25919;&#24220;&#36890;&#36807;&#20102;&#20854;&#36804;&#20170;&#20026;&#27490;&#26368;&#37325;&#35201;&#30340;&#27668;&#20505;&#31435;&#27861;&#65292;&#21363;2022&#24180;&#30340;&#36890;&#32960;&#20943;&#32531;&#27861;&#26696;&#65288;IRA&#65289;&#65292;&#26088;&#22312;&#25237;&#36164;&#20110;&#19968;&#31995;&#21015;&#35745;&#21010;&#65292;&#20854;&#20013;&#21253;&#25324;&#28608;&#21169;&#28165;&#27905;&#33021;&#28304;&#21644;&#30899;&#31649;&#29702;&#12289;&#40723;&#21169;&#30005;&#27668;&#21270;&#21644;&#25928;&#29575;&#25514;&#26045;&#12289;&#20943;&#23569;&#30002;&#28919;&#25490;&#25918;&#12289;&#20419;&#36827;&#22269;&#20869;&#20379;&#24212;&#38142;&#65292;&#24182;&#35299;&#20915;&#29615;&#22659;&#20844;&#27491;&#38382;&#39064;&#31561;&#12290;IRA&#30340;&#33539;&#22260;&#21644;&#22797;&#26434;&#24615;&#20351;&#24314;&#27169;&#23545;&#20110;&#29702;&#35299;&#20854;&#23545;&#25490;&#25918;&#21644;&#33021;&#28304;&#31995;&#32479;&#30340;&#24433;&#21709;&#38750;&#24120;&#37325;&#35201;&#12290;&#25105;&#20204;&#21033;&#29992;&#20061;&#20010;&#29420;&#31435;&#30340;&#20808;&#36827;&#27169;&#22411;&#30340;&#32467;&#26524;&#65292;&#30740;&#31350;&#20102;IRA&#20851;&#38190;&#26465;&#27454;&#30340;&#28508;&#22312;&#24433;&#21709;&#65292;&#26174;&#31034;&#21040;2035&#24180;&#65292;&#20840;&#38754;&#32463;&#27982;&#20943;&#25490;&#37327;&#22312;2005&#24180;&#30340;&#22522;&#30784;&#19978;&#23558;&#20943;&#23569;43-48%&#12290;
&lt;/p&gt;
&lt;p&gt;
If goals set under the Paris Agreement are met, the world may hold warming well below 2 C; however, parties are not on track to deliver these commitments, increasing focus on policy implementation to close the gap between ambition and action. Recently, the US government passed its most prominent piece of climate legislation to date, the Inflation Reduction Act of 2022 (IRA), designed to invest in a wide range of programs that, among other provisions, incentivize clean energy and carbon management, encourage electrification and efficiency measures, reduce methane emissions, promote domestic supply chains, and address environmental justice concerns. IRA's scope and complexity make modeling important to understand impacts on emissions and energy systems. We leverage results from nine independent, state-of-the-art models to examine potential implications of key IRA provisions, showing economy wide emissions reductions between 43-48% below 2005 by 2035.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#35843;&#26597;&#20102;&#21335;&#36798;&#31185;&#20182;&#24030;&#32654;&#27954;&#21360;&#31532;&#23433;&#20154;&#23545;&#31038;&#20132;&#23186;&#20307;&#30340;&#20559;&#22909;&#21644;&#30475;&#27861;&#65292;&#32467;&#26524;&#26174;&#31034;Facebook&#12289;YouTube&#12289;TikTok&#12289;Instagram&#21644;Snapchat&#26159;&#26368;&#21463;&#27426;&#36814;&#30340;&#24179;&#21488;&#65292;&#22823;&#22810;&#25968;&#21442;&#19982;&#32773;&#35748;&#20026;COVID-19&#26399;&#38388;&#31038;&#20132;&#23186;&#20307;&#30340;&#20351;&#29992;&#22823;&#24133;&#22686;&#21152;&#65292;&#24182;&#34920;&#31034;&#36127;&#38754;&#24433;&#21709;&#36739;&#22810;&#65292;&#22914;&#20167;&#24680;&#35328;&#35770;&#12289;&#34394;&#20551;&#20449;&#24687;&#21644;&#21482;&#21548;&#19968;&#31181;&#35266;&#28857;&#12290;</title><link>http://arxiv.org/abs/2307.01404</link><description>&lt;p&gt;
&#21335;&#36798;&#31185;&#20182;&#24030;&#32654;&#27954;&#21360;&#31532;&#23433;&#20154;&#30340;&#31038;&#20132;&#23186;&#20307;&#20351;&#29992;&#65306;&#20559;&#22909;&#21644;&#30475;&#27861;
&lt;/p&gt;
&lt;p&gt;
Social media use among American Indians in South Dakota: Preferences and perceptions. (arXiv:2307.01404v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.01404
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#35843;&#26597;&#20102;&#21335;&#36798;&#31185;&#20182;&#24030;&#32654;&#27954;&#21360;&#31532;&#23433;&#20154;&#23545;&#31038;&#20132;&#23186;&#20307;&#30340;&#20559;&#22909;&#21644;&#30475;&#27861;&#65292;&#32467;&#26524;&#26174;&#31034;Facebook&#12289;YouTube&#12289;TikTok&#12289;Instagram&#21644;Snapchat&#26159;&#26368;&#21463;&#27426;&#36814;&#30340;&#24179;&#21488;&#65292;&#22823;&#22810;&#25968;&#21442;&#19982;&#32773;&#35748;&#20026;COVID-19&#26399;&#38388;&#31038;&#20132;&#23186;&#20307;&#30340;&#20351;&#29992;&#22823;&#24133;&#22686;&#21152;&#65292;&#24182;&#34920;&#31034;&#36127;&#38754;&#24433;&#21709;&#36739;&#22810;&#65292;&#22914;&#20167;&#24680;&#35328;&#35770;&#12289;&#34394;&#20551;&#20449;&#24687;&#21644;&#21482;&#21548;&#19968;&#31181;&#35266;&#28857;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#31038;&#20132;&#23186;&#20307;&#20351;&#29992;&#25968;&#25454;&#24191;&#27867;&#34987;&#29992;&#20110;&#20998;&#26512;&#20154;&#31867;&#34892;&#20026;&#30340;&#20581;&#24247;&#12289;&#24515;&#29702;&#23398;&#21644;&#24066;&#22330;&#30740;&#31350;&#65292;&#20294;&#25105;&#20204;&#23545;&#32654;&#27954;&#21360;&#31532;&#23433;&#20154;&#30340;&#31038;&#20132;&#23186;&#20307;&#20351;&#29992;&#30693;&#20043;&#29978;&#23569;&#12290;&#26412;&#30740;&#31350;&#26088;&#22312;&#35780;&#20272;COVID-19&#26399;&#38388;&#32654;&#27954;&#21360;&#31532;&#23433;&#20154;&#23545;&#31038;&#20132;&#23186;&#20307;&#20351;&#29992;&#30340;&#20559;&#22909;&#21644;&#30475;&#27861;&#12290;&#25105;&#20204;&#36890;&#36807;&#22312;&#32447;&#35843;&#26597;&#25910;&#38598;&#26469;&#33258;&#21335;&#36798;&#31185;&#20182;&#24030;&#32654;&#27954;&#21360;&#31532;&#23433;&#20154;&#30340;&#25968;&#25454;&#12290;&#32467;&#26524;&#26174;&#31034;&#65292;Facebook&#12289;YouTube&#12289;TikTok&#12289;Instagram&#21644;Snapchat&#26159;&#26368;&#21463;&#27426;&#36814;&#30340;&#31038;&#20132;&#23186;&#20307;&#24179;&#21488;&#12290;&#22823;&#22810;&#25968;&#21442;&#19982;&#32773;&#25253;&#21578;&#31216;&#65292;&#22312;COVID-19&#26399;&#38388;&#31038;&#20132;&#23186;&#20307;&#30340;&#20351;&#29992;&#22823;&#24133;&#22686;&#21152;&#65292;&#24182;&#19988;&#26377;&#26356;&#22810;&#36127;&#38754;&#24433;&#21709;&#30340;&#30475;&#27861;&#12290;&#20167;&#24680;/&#39578;&#25200;/&#26497;&#31471;&#20027;&#20041;&#12289;&#34394;&#20551;&#20449;&#24687;/&#25423;&#36896;&#26032;&#38395;&#20197;&#21450;&#20154;&#20204;&#21482;&#21548;&#19968;&#31181;&#35266;&#28857;&#26159;&#36127;&#38754;&#24433;&#21709;&#30340;&#20027;&#35201;&#21407;&#22240;&#12290;
&lt;/p&gt;
&lt;p&gt;
Social media use data is widely being used in health, psychology, and marketing research to analyze human behavior. However, we have very limited knowledge on social media use among American Indians. In this context, this study was designed to assess preferences and perceptions of social media use among American Indians during COVID-19. We collected data from American Indians in South Dakota using online survey. Results show that Facebook, YouTube, TikTok, Instagram and Snapchat are the most preferred social media platforms. Most of the participants reported that the use of social media increased tremendously during COVID-19 and had perceptions of more negative effects than positive effects. Hate/harassment/extremism, misinformation/made up news, and people getting one point of view were the top reasons for negative effects.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#33258;&#36866;&#24212;&#20027;&#25104;&#20998;&#22238;&#24402;&#26041;&#27861;&#65292;&#24182;&#22312;&#38754;&#26495;&#25968;&#25454;&#20013;&#30340;&#24212;&#29992;&#20013;&#33719;&#24471;&#20102;&#22343;&#21248;&#26377;&#38480;&#26679;&#26412;&#20445;&#35777;&#12290;&#35813;&#26041;&#27861;&#21487;&#20197;&#29992;&#20110;&#38754;&#26495;&#25968;&#25454;&#20013;&#30340;&#23454;&#39564;&#35774;&#35745;&#65292;&#29305;&#21035;&#26159;&#24403;&#24178;&#39044;&#26041;&#26696;&#26159;&#33258;&#36866;&#24212;&#20998;&#37197;&#30340;&#24773;&#20917;&#12290;</title><link>http://arxiv.org/abs/2307.01357</link><description>&lt;p&gt;
&#33258;&#36866;&#24212;&#20027;&#25104;&#20998;&#22238;&#24402;&#22312;&#38754;&#26495;&#25968;&#25454;&#20013;&#30340;&#24212;&#29992;
&lt;/p&gt;
&lt;p&gt;
Adaptive Principal Component Regression with Applications to Panel Data. (arXiv:2307.01357v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.01357
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#33258;&#36866;&#24212;&#20027;&#25104;&#20998;&#22238;&#24402;&#26041;&#27861;&#65292;&#24182;&#22312;&#38754;&#26495;&#25968;&#25454;&#20013;&#30340;&#24212;&#29992;&#20013;&#33719;&#24471;&#20102;&#22343;&#21248;&#26377;&#38480;&#26679;&#26412;&#20445;&#35777;&#12290;&#35813;&#26041;&#27861;&#21487;&#20197;&#29992;&#20110;&#38754;&#26495;&#25968;&#25454;&#20013;&#30340;&#23454;&#39564;&#35774;&#35745;&#65292;&#29305;&#21035;&#26159;&#24403;&#24178;&#39044;&#26041;&#26696;&#26159;&#33258;&#36866;&#24212;&#20998;&#37197;&#30340;&#24773;&#20917;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20027;&#25104;&#20998;&#22238;&#24402;(PCR)&#26159;&#19968;&#31181;&#27969;&#34892;&#30340;&#22266;&#23450;&#35774;&#35745;&#35823;&#24046;&#21464;&#37327;&#22238;&#24402;&#25216;&#26415;&#65292;&#23427;&#26159;&#32447;&#24615;&#22238;&#24402;&#30340;&#25512;&#24191;&#65292;&#35266;&#27979;&#30340;&#21327;&#21464;&#37327;&#21463;&#21040;&#38543;&#26426;&#22122;&#22768;&#30340;&#27745;&#26579;&#12290;&#25105;&#20204;&#22312;&#25968;&#25454;&#25910;&#38598;&#26102;&#25552;&#20379;&#20102;&#22312;&#32447;&#65288;&#27491;&#21017;&#21270;&#65289;PCR&#30340;&#31532;&#19968;&#27425;&#22343;&#21248;&#26377;&#38480;&#26679;&#26412;&#20445;&#35777;&#12290;&#30001;&#20110;&#20998;&#26512;&#22266;&#23450;&#35774;&#35745;&#20013;PCR&#30340;&#35777;&#26126;&#25216;&#26415;&#26080;&#27861;&#24456;&#23481;&#26131;&#22320;&#25193;&#23637;&#21040;&#22312;&#32447;&#35774;&#32622;&#65292;&#25105;&#20204;&#30340;&#32467;&#26524;&#20381;&#36182;&#20110;&#23558;&#29616;&#20195;&#38789;&#27987;&#24230;&#30340;&#24037;&#20855;&#36866;&#24212;&#21040;&#35823;&#24046;&#21464;&#37327;&#35774;&#32622;&#20013;&#12290;&#20316;&#20026;&#25105;&#20204;&#30028;&#38480;&#30340;&#24212;&#29992;&#65292;&#25105;&#20204;&#22312;&#38754;&#26495;&#25968;&#25454;&#35774;&#32622;&#20013;&#25552;&#20379;&#20102;&#23454;&#39564;&#35774;&#35745;&#26694;&#26550;&#65292;&#24403;&#24178;&#39044;&#34987;&#33258;&#36866;&#24212;&#22320;&#20998;&#37197;&#26102;&#12290;&#25105;&#20204;&#30340;&#26694;&#26550;&#21487;&#20197;&#34987;&#35748;&#20026;&#26159;&#21512;&#25104;&#25511;&#21046;&#21644;&#21512;&#25104;&#24178;&#39044;&#26694;&#26550;&#30340;&#27867;&#21270;&#65292;&#20854;&#20013;&#25968;&#25454;&#26159;&#36890;&#36807;&#33258;&#36866;&#24212;&#24178;&#39044;&#20998;&#37197;&#31574;&#30053;&#25910;&#38598;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
Principal component regression (PCR) is a popular technique for fixed-design error-in-variables regression, a generalization of the linear regression setting in which the observed covariates are corrupted with random noise. We provide the first time-uniform finite sample guarantees for online (regularized) PCR whenever data is collected adaptively. Since the proof techniques for analyzing PCR in the fixed design setting do not readily extend to the online setting, our results rely on adapting tools from modern martingale concentration to the error-in-variables setting. As an application of our bounds, we provide a framework for experiment design in panel data settings when interventions are assigned adaptively. Our framework may be thought of as a generalization of the synthetic control and synthetic interventions frameworks, where data is collected via an adaptive intervention assignment policy.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#38750;&#21442;&#25968;&#26041;&#27861;&#65292;&#36890;&#36807;&#32467;&#21512;&#38750;&#21442;&#25968;&#26680;&#24179;&#28369;&#21644;&#24191;&#20041;&#25910;&#32553;&#25216;&#26415;&#65292;&#24182;&#22312;&#22122;&#22768;&#26080;&#25968;&#25454;&#30340;&#24773;&#20917;&#19979;&#22522;&#20110;&#22343;&#21248;&#31232;&#30095;&#24615;&#20551;&#35774;&#65292;&#23454;&#29616;&#20102;&#23545;&#39640;&#39057;&#37329;&#34701;&#25968;&#25454;&#20013;&#22823;&#37327;&#36164;&#20135;&#30340;&#29616;&#36135;&#27874;&#21160;&#29575;&#30697;&#38453;&#30340;&#20272;&#35745;&#12290;&#21516;&#26102;&#65292;&#20026;&#39640;&#39057;&#25968;&#25454;&#21463;&#24494;&#35266;&#32467;&#26500;&#22122;&#22768;&#27745;&#26579;&#30340;&#24773;&#20917;&#24341;&#20837;&#20102;&#23616;&#37096;&#39044;&#24179;&#22343;&#20272;&#35745;&#26041;&#27861;&#12290;&#22312;&#26080;&#22122;&#22768;&#21644;&#26377;&#22122;&#22768;&#24773;&#26223;&#19979;&#65292;&#25512;&#23548;&#20102;&#27874;&#21160;&#29575;&#30697;&#38453;&#20272;&#35745;&#22120;&#30340;&#22343;&#21248;&#25910;&#25947;&#36895;&#29575;&#12290;&#36890;&#36807;&#23558;&#26680;&#24179;&#28369;&#19982;&#25910;&#32553;&#25216;&#26415;&#30456;&#32467;&#21512;&#65292;&#20063;&#23454;&#29616;&#20102;&#23545;&#26102;&#21464;&#27874;&#21160;&#29575;&#30340;&#20272;&#35745;&#12290;</title><link>http://arxiv.org/abs/2307.01348</link><description>&lt;p&gt;
&#39640;&#39057;&#37329;&#34701;&#25968;&#25454;&#30340;&#22823;&#35268;&#27169;&#29616;&#36135;&#27874;&#21160;&#29575;&#30697;&#38453;&#30340;&#38750;&#21442;&#25968;&#20272;&#35745;
&lt;/p&gt;
&lt;p&gt;
Nonparametric Estimation of Large Spot Volatility Matrices for High-Frequency Financial Data. (arXiv:2307.01348v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.01348
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#38750;&#21442;&#25968;&#26041;&#27861;&#65292;&#36890;&#36807;&#32467;&#21512;&#38750;&#21442;&#25968;&#26680;&#24179;&#28369;&#21644;&#24191;&#20041;&#25910;&#32553;&#25216;&#26415;&#65292;&#24182;&#22312;&#22122;&#22768;&#26080;&#25968;&#25454;&#30340;&#24773;&#20917;&#19979;&#22522;&#20110;&#22343;&#21248;&#31232;&#30095;&#24615;&#20551;&#35774;&#65292;&#23454;&#29616;&#20102;&#23545;&#39640;&#39057;&#37329;&#34701;&#25968;&#25454;&#20013;&#22823;&#37327;&#36164;&#20135;&#30340;&#29616;&#36135;&#27874;&#21160;&#29575;&#30697;&#38453;&#30340;&#20272;&#35745;&#12290;&#21516;&#26102;&#65292;&#20026;&#39640;&#39057;&#25968;&#25454;&#21463;&#24494;&#35266;&#32467;&#26500;&#22122;&#22768;&#27745;&#26579;&#30340;&#24773;&#20917;&#24341;&#20837;&#20102;&#23616;&#37096;&#39044;&#24179;&#22343;&#20272;&#35745;&#26041;&#27861;&#12290;&#22312;&#26080;&#22122;&#22768;&#21644;&#26377;&#22122;&#22768;&#24773;&#26223;&#19979;&#65292;&#25512;&#23548;&#20102;&#27874;&#21160;&#29575;&#30697;&#38453;&#20272;&#35745;&#22120;&#30340;&#22343;&#21248;&#25910;&#25947;&#36895;&#29575;&#12290;&#36890;&#36807;&#23558;&#26680;&#24179;&#28369;&#19982;&#25910;&#32553;&#25216;&#26415;&#30456;&#32467;&#21512;&#65292;&#20063;&#23454;&#29616;&#20102;&#23545;&#26102;&#21464;&#27874;&#21160;&#29575;&#30340;&#20272;&#35745;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#32771;&#34385;&#23545;&#22823;&#37327;&#36164;&#20135;&#30340;&#39640;&#39057;&#25968;&#25454;&#36827;&#34892;&#29616;&#36135;/&#30636;&#26102;&#27874;&#21160;&#29575;&#30697;&#38453;&#30340;&#20272;&#35745;&#12290;&#25105;&#20204;&#39318;&#20808;&#23558;&#32463;&#20856;&#30340;&#38750;&#21442;&#25968;&#26680;&#24179;&#28369;&#19982;&#24191;&#20041;&#25910;&#32553;&#25216;&#26415;&#30456;&#32467;&#21512;&#65292;&#23545;&#22122;&#38899;&#26080;&#25968;&#25454;&#36827;&#34892;&#30697;&#38453;&#20272;&#35745;&#65292;&#22312;&#22343;&#21248;&#31232;&#30095;&#24615;&#20551;&#35774;&#19979;&#65292;&#36825;&#26159;&#25991;&#29486;&#20013;&#24120;&#29992;&#30340;&#36817;&#20284;&#31232;&#30095;&#24615;&#30340;&#33258;&#28982;&#25193;&#23637;&#12290;&#35813;&#26041;&#27861;&#30340;&#22343;&#21248;&#19968;&#33268;&#24615;&#24615;&#36136;&#24471;&#21040;&#20102;&#35777;&#26126;&#65292;&#24182;&#20855;&#26377;&#19982;&#26368;&#20248;&#26497;&#23567;&#26497;&#22823;&#25910;&#25947;&#36895;&#29575;&#30456;&#24403;&#30340;&#25910;&#25947;&#36895;&#29575;&#12290;&#23545;&#20110;&#21463;&#24494;&#35266;&#32467;&#26500;&#22122;&#22768;&#27745;&#26579;&#30340;&#39640;&#39057;&#25968;&#25454;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#31181;&#23616;&#37096;&#39044;&#24179;&#22343;&#20272;&#35745;&#26041;&#27861;&#65292;&#21487;&#20197;&#38477;&#20302;&#22122;&#22768;&#30340;&#26377;&#25928;&#24133;&#24230;&#12290;&#28982;&#21518;&#25105;&#20204;&#20351;&#29992;&#22312;&#26080;&#22122;&#22768;&#24773;&#24418;&#19979;&#24320;&#21457;&#30340;&#20272;&#35745;&#24037;&#20855;&#65292;&#24182;&#20026;&#25152;&#24320;&#21457;&#30340;&#29616;&#36135;&#27874;&#21160;&#29575;&#30697;&#38453;&#20272;&#35745;&#22120;&#25512;&#23548;&#20102;&#22343;&#21248;&#25910;&#25947;&#36895;&#29575;&#12290;&#25105;&#20204;&#36827;&#19968;&#27493;&#23558;&#26680;&#24179;&#28369;&#19982;&#25910;&#32553;&#25216;&#26415;&#30456;&#32467;&#21512;&#65292;&#20272;&#35745;&#26102;&#21464;&#27874;&#21160;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this paper, we consider estimating spot/instantaneous volatility matrices of high-frequency data collected for a large number of assets. We first combine classic nonparametric kernel-based smoothing with a generalised shrinkage technique in the matrix estimation for noise-free data under a uniform sparsity assumption, a natural extension of the approximate sparsity commonly used in the literature. The uniform consistency property is derived for the proposed spot volatility matrix estimator with convergence rates comparable to the optimal minimax one. For the high-frequency data contaminated by microstructure noise, we introduce a localised pre-averaging estimation method that reduces the effective magnitude of the noise. We then use the estimation tool developed in the noise-free scenario, and derive the uniform convergence rates for the developed spot volatility matrix estimator. We further combine the kernel smoothing with the shrinkage technique to estimate the time-varying volat
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#20171;&#32461;&#20102;&#22312;&#24369;&#30456;&#20851;&#26465;&#20214;&#19979;&#38024;&#23545;&#23616;&#37096;&#32463;&#39564;&#36807;&#31243;&#30340;&#26497;&#22823;&#19981;&#31561;&#24335;&#65292;&#35813;&#19981;&#31561;&#24335;&#21487;&#20197;&#32479;&#19968;&#22320;&#25511;&#21046;&#20272;&#35745;&#35823;&#24046;&#65292;&#36866;&#29992;&#20110;&#19981;&#26029;&#22686;&#21152;&#22797;&#26434;&#24615;&#30340;&#20989;&#25968;&#31867;&#65292;&#24182;&#19988;&#22312;&#26680;&#23494;&#24230;&#20272;&#35745;&#20013;&#36798;&#21040;&#20102;&#19982;&#29420;&#31435;&#21516;&#20998;&#24067;&#35774;&#32622;&#30456;&#21516;&#30340;&#23574;&#38160;&#19968;&#33268;&#24102;&#23485;&#29575;&#12290;</title><link>http://arxiv.org/abs/2307.01328</link><description>&lt;p&gt;
&#24369;&#30456;&#20851;&#26465;&#20214;&#19979;&#23616;&#37096;&#32463;&#39564;&#36807;&#31243;&#30340;&#26497;&#22823;&#19981;&#31561;&#24335;
&lt;/p&gt;
&lt;p&gt;
A maximal inequality for local empirical processes under weak dependence. (arXiv:2307.01328v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.01328
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#22312;&#24369;&#30456;&#20851;&#26465;&#20214;&#19979;&#38024;&#23545;&#23616;&#37096;&#32463;&#39564;&#36807;&#31243;&#30340;&#26497;&#22823;&#19981;&#31561;&#24335;&#65292;&#35813;&#19981;&#31561;&#24335;&#21487;&#20197;&#32479;&#19968;&#22320;&#25511;&#21046;&#20272;&#35745;&#35823;&#24046;&#65292;&#36866;&#29992;&#20110;&#19981;&#26029;&#22686;&#21152;&#22797;&#26434;&#24615;&#30340;&#20989;&#25968;&#31867;&#65292;&#24182;&#19988;&#22312;&#26680;&#23494;&#24230;&#20272;&#35745;&#20013;&#36798;&#21040;&#20102;&#19982;&#29420;&#31435;&#21516;&#20998;&#24067;&#35774;&#32622;&#30456;&#21516;&#30340;&#23574;&#38160;&#19968;&#33268;&#24102;&#23485;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#20010;&#38024;&#23545;&#24378;&#28151;&#21512;&#25968;&#25454;&#19979;&#23616;&#37096;&#32463;&#39564;&#36807;&#31243;&#30340;&#26497;&#22823;&#19981;&#31561;&#24335;&#12290;&#23616;&#37096;&#32463;&#39564;&#36807;&#31243;&#34987;&#23450;&#20041;&#20026;&#65288;&#23616;&#37096;&#65289;&#24179;&#22343;&#20540;$\frac{1}{nh}\sum_{i=1}^n \mathbf{1}\{x - h \leq X_i \leq x+h\}f(Z_i)$&#65292;&#20854;&#20013;$f$&#23646;&#20110;&#19968;&#20010;&#20989;&#25968;&#31867;&#65292;$x \in \mathbb{R}$&#65292;&#32780;$h &gt; 0$&#26159;&#19968;&#20010;&#24102;&#23485;&#12290;&#25105;&#20204;&#30340;&#38750;&#28176;&#36827;&#36793;&#30028;&#21487;&#20197;&#32479;&#19968;&#22320;&#25511;&#21046;&#20989;&#25968;&#31867;&#12289;&#35780;&#20272;&#28857;$x$&#21644;&#24102;&#23485;$h$&#19978;&#30340;&#20272;&#35745;&#35823;&#24046;&#12290;&#23427;&#20204;&#20063;&#36275;&#22815;&#19968;&#33324;&#65292;&#21487;&#20197;&#36866;&#24212;&#38543;&#30528;$n$&#22686;&#38271;&#32780;&#22686;&#21152;&#22797;&#26434;&#24615;&#30340;&#20989;&#25968;&#31867;&#12290;&#20316;&#20026;&#24212;&#29992;&#65292;&#25105;&#20204;&#23558;&#25105;&#20204;&#30340;&#36793;&#30028;&#24212;&#29992;&#20110;&#22312;&#19968;&#33268;&#35206;&#30422;&#25968;&#20013;&#21576;&#22810;&#39033;&#24335;&#34928;&#20943;&#30340;&#20989;&#25968;&#31867;&#12290;&#24403;&#24212;&#29992;&#20110;&#26680;&#23494;&#24230;&#20272;&#35745;&#30340;&#38382;&#39064;&#26102;&#65292;&#25105;&#20204;&#30340;&#36793;&#30028;&#25581;&#31034;&#20986;&#65292;&#22312;&#24369;&#30456;&#20851;&#21644;&#25351;&#25968;&#34928;&#20943;&#24773;&#20917;&#19979;&#65292;&#36825;&#20123;&#20272;&#35745;&#37327;&#23454;&#29616;&#20102;&#19982;&#29420;&#31435;&#21516;&#20998;&#24067;&#35774;&#32622;&#20013;&#30001;\cite{Einmahl2005}&#24471;&#20986;&#30340;&#23574;&#38160;&#19968;&#33268;&#24102;&#23485;&#29575;&#30456;&#21516;&#65288;&#24046;&#19968;&#20010;&#23545;&#25968;&#22240;&#23376;&#65289;&#12290;
&lt;/p&gt;
&lt;p&gt;
We introduce a maximal inequality for a local empirical process under strongly mixing data. Local empirical processes are defined as the (local) averages $\frac{1}{nh}\sum_{i=1}^n \mathbf{1}\{x - h \leq X_i \leq x+h\}f(Z_i)$, where $f$ belongs to a class of functions, $x \in \mathbb{R}$ and $h &gt; 0$ is a bandwidth. Our nonasymptotic bounds control estimation error uniformly over the function class, evaluation point $x$ and bandwidth $h$. They are also general enough to accomodate function classes whose complexity increases with $n$. As an application, we apply our bounds to function classes that exhibit polynomial decay in their uniform covering numbers. When specialized to the problem of kernel density estimation, our bounds reveal that, under weak dependence with exponential decay, these estimators achieve the same (up to a logarithmic factor) sharp uniform-in-bandwidth rates derived in the iid setting by \cite{Einmahl2005}.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#22269;&#23478;&#26368;&#20302;&#24037;&#36164;&#23545;&#23601;&#19994;&#21644;&#24037;&#36164;&#30340;&#22240;&#26524;&#25928;&#24212;&#65292;&#24182;&#21457;&#29616;&#21463;&#24433;&#21709;&#27604;&#20363;&#35774;&#35745;&#23384;&#22312;&#20559;&#24046;&#65292;&#23548;&#33268;&#23545;&#30495;&#23454;&#22240;&#26524;&#25928;&#24212;&#30340;&#25298;&#32477;&#29575;&#36807;&#39640;&#12290;&#25105;&#36824;&#25552;&#20986;&#20102;&#20004;&#31181;&#35786;&#26029;&#26041;&#27861;&#26469;&#39564;&#35777;&#36825;&#31181;&#35774;&#35745;&#65292;&#23545;&#20110;&#26377;&#25928;&#26368;&#20302;&#24037;&#36164;&#35774;&#35745;&#65292;Lee(1999)&#24378;&#35843;&#30340;&#35782;&#21035;&#20551;&#35774;&#33267;&#20851;&#37325;&#35201;&#12290;</title><link>http://arxiv.org/abs/2307.01284</link><description>&lt;p&gt;
&#21306;&#22495;&#24037;&#36164;&#27700;&#24179;&#30340;&#21464;&#21270;&#33021;&#21542;&#30830;&#23450;&#22269;&#23478;&#26368;&#20302;&#24037;&#36164;&#30340;&#24433;&#21709;&#65311;
&lt;/p&gt;
&lt;p&gt;
Does regional variation in wage levels identify the effects of a national minimum wage?. (arXiv:2307.01284v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.01284
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22269;&#23478;&#26368;&#20302;&#24037;&#36164;&#23545;&#23601;&#19994;&#21644;&#24037;&#36164;&#30340;&#22240;&#26524;&#25928;&#24212;&#65292;&#24182;&#21457;&#29616;&#21463;&#24433;&#21709;&#27604;&#20363;&#35774;&#35745;&#23384;&#22312;&#20559;&#24046;&#65292;&#23548;&#33268;&#23545;&#30495;&#23454;&#22240;&#26524;&#25928;&#24212;&#30340;&#25298;&#32477;&#29575;&#36807;&#39640;&#12290;&#25105;&#36824;&#25552;&#20986;&#20102;&#20004;&#31181;&#35786;&#26029;&#26041;&#27861;&#26469;&#39564;&#35777;&#36825;&#31181;&#35774;&#35745;&#65292;&#23545;&#20110;&#26377;&#25928;&#26368;&#20302;&#24037;&#36164;&#35774;&#35745;&#65292;Lee(1999)&#24378;&#35843;&#30340;&#35782;&#21035;&#20551;&#35774;&#33267;&#20851;&#37325;&#35201;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25506;&#35752;&#20102;&#20272;&#35745;&#22269;&#23478;&#26368;&#20302;&#24037;&#36164;&#23545;&#23601;&#19994;&#21644;&#24037;&#36164;&#30340;&#22240;&#26524;&#25928;&#24212;&#30340;&#20272;&#35745;&#37327;&#25152;&#20381;&#36182;&#30340;&#35782;&#21035;&#20551;&#35774;&#65292;&#20363;&#22914;&#8220;&#21463;&#24433;&#21709;&#27604;&#20363;&#8221;&#21644;&#8220;&#26377;&#25928;&#26368;&#20302;&#24037;&#36164;&#8221;&#35774;&#35745;&#12290;&#20855;&#20307;&#26469;&#35828;&#65292;&#25105;&#36827;&#34892;&#20102;&#19968;&#31995;&#21015;&#27169;&#25311;&#23454;&#39564;&#65292;&#30740;&#31350;&#36825;&#20123;&#20551;&#35774;&#22312;&#29305;&#23450;&#32463;&#27982;&#27169;&#22411;&#19979;&#26159;&#21542;&#25104;&#31435;&#20316;&#20026;&#25968;&#25454;&#29983;&#25104;&#27969;&#31243;&#12290;&#25105;&#21457;&#29616;&#65292;&#22312;&#35768;&#22810;&#24773;&#20917;&#19979;&#65292;&#21463;&#24433;&#21709;&#27604;&#20363;&#35774;&#35745;&#26174;&#31034;&#20986;&#23567;&#30340;&#20559;&#24046;&#65292;&#23548;&#33268;&#23545;&#30495;&#23454;&#22240;&#26524;&#25928;&#24212;&#30340;&#25298;&#32477;&#29575;&#36807;&#39640;&#12290;&#22312;&#24037;&#36164;&#24046;&#24322;&#22312;&#19981;&#21516;&#22320;&#21306;&#25193;&#22823;&#12289;&#23545;&#26368;&#20302;&#24037;&#36164;&#30340;&#22343;&#34913;&#21453;&#24212;&#25110;&#24179;&#34892;&#36235;&#21183;&#20551;&#35774;&#30340;&#36829;&#21453;&#23384;&#22312;&#26102;&#65292;&#36825;&#20123;&#20559;&#24046;&#21487;&#33021;&#26356;&#22823;&#12290;&#25105;&#25552;&#20986;&#20102;&#20004;&#31181;&#35786;&#26029;&#26041;&#27861;&#65292;&#20197;&#34917;&#20805;&#24120;&#29992;&#20110;&#39564;&#35777;&#36825;&#31181;&#35774;&#35745;&#30340;&#24046;&#24322;&#39044;&#36235;&#21183;&#30340;&#26631;&#20934;&#27979;&#35797;&#12290;&#23545;&#20110;&#26377;&#25928;&#26368;&#20302;&#24037;&#36164;&#35774;&#35745;&#65292;&#25105;&#34920;&#26126;Lee(1999)&#24378;&#35843;&#30340;&#35782;&#21035;&#20551;&#35774;&#33267;&#20851;&#37325;&#35201;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper examines the identification assumptions underlying estimators of the causal effects of national minimum wages on employment and wages, such as the "fraction affected" and "effective minimum wage" designs. Specifically, I conduct a series of simulation exercises to investigate whether these assumptions hold in the context of particular economic models used as data-generating processes. I find that, in many cases, the fraction affected design exhibits small biases that lead to inflated rejection rates of the true causal effect. These biases can be larger in the presence of either trends in the dispersion of wages within regions, equilibrium responses to the minimum wage, or violations of the parallel trends assumption. I propose two diagnostic exercises to complement the standard test for differential pre-trends commonly used to validate this design. For the effective minimum wage design, I show that while the identification assumptions emphasized by Lee (1999) are crucial, th
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#20855;&#26377;&#20132;&#20114;&#22266;&#23450;&#25928;&#24212;&#30340;&#38754;&#26495;&#25968;&#25454;&#20013;&#22238;&#24402;&#31995;&#25968;&#30340;&#20272;&#35745;&#21644;&#25512;&#26029;&#38382;&#39064;&#12290;&#36890;&#36807;&#37319;&#29992;&#25913;&#36827;&#30340;&#20272;&#35745;&#22120;&#21644;&#20559;&#20506;&#24863;&#30693;&#32622;&#20449;&#21306;&#38388;&#65292;&#25105;&#20204;&#33021;&#22815;&#35299;&#20915;&#22240;&#32032;&#24369;&#24341;&#36215;&#30340;&#20559;&#20506;&#21644;&#22823;&#23567;&#22833;&#30495;&#30340;&#38382;&#39064;&#65292;&#26080;&#35770;&#22240;&#32032;&#26159;&#21542;&#24378;&#22766;&#65292;&#37117;&#33021;&#24471;&#21040;&#32479;&#19968;&#26377;&#25928;&#30340;&#32467;&#26524;&#12290;</title><link>http://arxiv.org/abs/2210.06639</link><description>&lt;p&gt;
&#20855;&#26377;&#20132;&#20114;&#22266;&#23450;&#25928;&#24212;&#30340;&#38754;&#26495;&#25968;&#25454;&#20013;&#30340;&#40065;&#26834;&#20272;&#35745;&#21644;&#25512;&#26029;
&lt;/p&gt;
&lt;p&gt;
Robust Estimation and Inference in Panels with Interactive Fixed Effects. (arXiv:2210.06639v2 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2210.06639
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#20855;&#26377;&#20132;&#20114;&#22266;&#23450;&#25928;&#24212;&#30340;&#38754;&#26495;&#25968;&#25454;&#20013;&#22238;&#24402;&#31995;&#25968;&#30340;&#20272;&#35745;&#21644;&#25512;&#26029;&#38382;&#39064;&#12290;&#36890;&#36807;&#37319;&#29992;&#25913;&#36827;&#30340;&#20272;&#35745;&#22120;&#21644;&#20559;&#20506;&#24863;&#30693;&#32622;&#20449;&#21306;&#38388;&#65292;&#25105;&#20204;&#33021;&#22815;&#35299;&#20915;&#22240;&#32032;&#24369;&#24341;&#36215;&#30340;&#20559;&#20506;&#21644;&#22823;&#23567;&#22833;&#30495;&#30340;&#38382;&#39064;&#65292;&#26080;&#35770;&#22240;&#32032;&#26159;&#21542;&#24378;&#22766;&#65292;&#37117;&#33021;&#24471;&#21040;&#32479;&#19968;&#26377;&#25928;&#30340;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#32771;&#34385;&#20855;&#26377;&#20132;&#20114;&#22266;&#23450;&#25928;&#24212;&#65288;&#21363;&#20855;&#26377;&#22240;&#23376;&#32467;&#26500;&#65289;&#30340;&#38754;&#26495;&#25968;&#25454;&#20013;&#22238;&#24402;&#31995;&#25968;&#30340;&#20272;&#35745;&#21644;&#25512;&#26029;&#38382;&#39064;&#12290;&#25105;&#20204;&#21457;&#29616;&#20043;&#21069;&#24320;&#21457;&#30340;&#20272;&#35745;&#22120;&#21644;&#32622;&#20449;&#21306;&#38388;&#21487;&#33021;&#22312;&#19968;&#20123;&#22240;&#32032;&#36739;&#24369;&#30340;&#24773;&#20917;&#19979;&#23384;&#22312;&#20005;&#37325;&#30340;&#20559;&#20506;&#21644;&#22823;&#23567;&#22833;&#30495;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#20855;&#26377;&#25913;&#36827;&#25910;&#25947;&#36895;&#24230;&#21644;&#20559;&#20506;&#24863;&#30693;&#32622;&#20449;&#21306;&#38388;&#30340;&#20272;&#35745;&#22120;&#65292;&#26080;&#35770;&#22240;&#32032;&#26159;&#21542;&#24378;&#22766;&#37117;&#33021;&#20445;&#25345;&#32479;&#19968;&#26377;&#25928;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#37319;&#29992;&#26368;&#23567;&#21270;&#32447;&#24615;&#20272;&#35745;&#29702;&#35770;&#65292;&#22312;&#21021;&#22987;&#20132;&#20114;&#22266;&#23450;&#25928;&#24212;&#30340;&#35823;&#24046;&#19978;&#20351;&#29992;&#26680;&#33539;&#25968;&#32422;&#26463;&#26469;&#24418;&#25104;&#19968;&#20010;&#26080;&#20559;&#20272;&#35745;&#12290;&#25105;&#20204;&#21033;&#29992;&#25152;&#24471;&#20272;&#35745;&#26500;&#24314;&#19968;&#20010;&#32771;&#34385;&#21040;&#22240;&#32032;&#24369;&#24341;&#36215;&#30340;&#21097;&#20313;&#20559;&#24046;&#30340;&#20559;&#20506;&#24863;&#30693;&#32622;&#20449;&#21306;&#38388;&#12290;&#22312;&#33945;&#29305;&#21345;&#27931;&#23454;&#39564;&#20013;&#65292;&#25105;&#20204;&#21457;&#29616;&#22312;&#22240;&#32032;&#36739;&#24369;&#30340;&#24773;&#20917;&#19979;&#30456;&#36739;&#20110;&#20256;&#32479;&#26041;&#27861;&#26377;&#26174;&#33879;&#25913;&#36827;&#65292;&#24182;&#19988;&#22312;&#22240;&#32032;&#36739;&#24378;&#30340;&#24773;&#20917;&#19979;&#20960;&#20046;&#27809;&#26377;&#20272;&#35745;&#35823;&#24046;&#30340;&#25439;&#22833;&#12290;
&lt;/p&gt;
&lt;p&gt;
We consider estimation and inference for a regression coefficient in panels with interactive fixed effects (i.e., with a factor structure). We show that previously developed estimators and confidence intervals (CIs) might be heavily biased and size-distorted when some of the factors are weak. We propose estimators with improved rates of convergence and bias-aware CIs that are uniformly valid regardless of whether the factors are strong or not. Our approach applies the theory of minimax linear estimation to form a debiased estimate using a nuclear norm bound on the error of an initial estimate of the interactive fixed effects. We use the obtained estimate to construct a bias-aware CI taking into account the remaining bias due to weak factors. In Monte Carlo experiments, we find a substantial improvement over conventional approaches when factors are weak, with little cost to estimation error when factors are strong.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#38024;&#23545;&#36716;&#31227;&#19981;&#20801;&#35768;&#26102;&#30340;&#19981;&#21487;&#20998;&#21106;&#29289;&#21697;&#20998;&#37197;&#38382;&#39064;&#65292;&#24341;&#20837;&#20102;Rawlsian Assignments&#30340;&#27010;&#24565;&#65292;&#24182;&#19988;&#35777;&#26126;&#20102;&#23384;&#22312;&#19968;&#31181;&#29420;&#29305;&#30340;Rawlsian Assignments&#21487;&#20197;&#22312;&#20445;&#25345;&#26377;&#25928;&#21644;&#21311;&#21517;&#24615;&#30340;&#21516;&#26102;&#28385;&#36275;&#24179;&#31561;&#20027;&#20041;&#30340;&#35201;&#27714;&#12290;</title><link>http://arxiv.org/abs/2207.02930</link><description>&lt;p&gt;
Rawlsian Assignments&#65288;&#35770;&#25991;&#32534;&#21495;&#65306;arXiv:2207.02930v2 [econ.TH]&#65292;&#24050;&#26356;&#26032;&#65289;
&lt;/p&gt;
&lt;p&gt;
Rawlsian Assignments. (arXiv:2207.02930v2 [econ.TH] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2207.02930
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#38024;&#23545;&#36716;&#31227;&#19981;&#20801;&#35768;&#26102;&#30340;&#19981;&#21487;&#20998;&#21106;&#29289;&#21697;&#20998;&#37197;&#38382;&#39064;&#65292;&#24341;&#20837;&#20102;Rawlsian Assignments&#30340;&#27010;&#24565;&#65292;&#24182;&#19988;&#35777;&#26126;&#20102;&#23384;&#22312;&#19968;&#31181;&#29420;&#29305;&#30340;Rawlsian Assignments&#21487;&#20197;&#22312;&#20445;&#25345;&#26377;&#25928;&#21644;&#21311;&#21517;&#24615;&#30340;&#21516;&#26102;&#28385;&#36275;&#24179;&#31561;&#20027;&#20041;&#30340;&#35201;&#27714;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#24403;&#36716;&#31227;&#19981;&#20801;&#35768;&#26102;&#22914;&#20309;&#20998;&#37197;&#19981;&#21487;&#20998;&#21106;&#30340;&#29289;&#21697;&#32473;&#20010;&#20154;&#12290;&#20197;&#21069;&#30340;&#25991;&#29486;&#20027;&#35201;&#20851;&#27880;&#25928;&#29575;&#65288;&#20174;&#21069;&#21518;&#20004;&#20010;&#35282;&#24230;&#65289;&#20197;&#21450;&#20010;&#20307;&#20844;&#24179;&#20998;&#37197;&#12290;&#22240;&#27492;&#65292;&#24179;&#31561;&#20027;&#20041;&#30340;&#38382;&#39064;&#24120;&#24120;&#34987;&#24573;&#35270;&#12290;&#26412;&#25991;&#21463;&#20303;&#25151;&#21512;&#20316;&#31038;&#20013;&#20844;&#23507;&#30340;&#20998;&#37197;&#25152;&#21551;&#21457;&#65292;&#23478;&#24237;&#24076;&#26395;&#20998;&#37197;&#30340;&#24179;&#31561;&#24615;&#25104;&#20026;&#31532;&#19968;&#35201;&#27714;&#12290;&#29305;&#21035;&#26159;&#65292;&#20182;&#20204;&#24819;&#36991;&#20813;&#20998;&#37197;&#26102;&#26377;&#30340;&#23478;&#24237;&#24471;&#21040;&#20102;&#33258;&#24049;&#26368;&#21916;&#27426;&#30340;&#20844;&#23507;&#65292;&#32780;&#20854;&#20182;&#23478;&#24237;&#21017;&#25317;&#26377;&#26497;&#20302;&#30340;&#36873;&#25321;&#26435;&#12290;&#22522;&#20110;Rawls&#30340;&#20844;&#24179;&#29702;&#24565;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;Rawlsian Assignments&#30340;&#27010;&#24565;&#12290;&#25105;&#20204;&#35777;&#26126;&#65292;&#24635;&#26159;&#23384;&#22312;&#19968;&#31181;&#29420;&#29305;&#30340;Rawlsian Assignments&#65292;&#23427;&#26159;&#26377;&#25928;&#30340;&#24182;&#28385;&#36275;&#21311;&#21517;&#24615;&#12290;&#25105;&#20204;&#29992;&#26469;&#33258;&#20303;&#25151;&#21512;&#20316;&#31038;&#30340;&#20559;&#22909;&#25968;&#25454;&#26469;&#35828;&#26126;&#25105;&#20204;&#30340;&#20998;&#26512;&#12290;&#25105;&#20204;&#30340;&#32467;&#26524;&#34920;&#26126;&#65292;&#20174;&#24179;&#31561;&#20027;&#20041;&#30340;&#35282;&#24230;&#26469;&#30475;&#65292;Rawlsian Assignments&#21487;&#20197;&#26174;&#33879;&#25913;&#21892;&#27010;&#29575;&#25928;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study the assignment of indivisible objects to individuals when transfers are not allowed. Previous literature has mainly focused on efficiency (from ex-ante and ex-post perspectives), and individually fair assignments. Consequently, egalitarian concerns have been overlooked. We are inspired by the assignment of apartments in housing cooperatives where families regard the egalitarianism of the assignments as a first-order requirement. In particular, they want to avoid assignments where some families get their most preferred apartment, while others get options ranked very low in their preferences. Based on Rawls' idea of fairness, we introduce the notion of Rawlsian assignments. We prove that there always exists a unique Rawlsian assignment, which is efficient, and satisfies anonymity. We illustrate our analysis with preference data from housing cooperatives. Our results show that the Rawlsian assignment substantially improves, from an egalitarian perspective, both the probabilistic 
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#24102;&#26377;&#22266;&#23450;&#25928;&#24212;&#30340;&#20108;&#36873;&#19968;&#27169;&#22411;&#30340;&#35782;&#21035;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#31526;&#21495;&#39281;&#21644;&#26465;&#20214;&#24182;&#35777;&#26126;&#20854;&#36275;&#20197;&#23454;&#29616;&#27169;&#22411;&#30340;&#35782;&#21035;&#12290;&#21516;&#26102;&#65292;&#25105;&#20204;&#36824;&#25552;&#20379;&#20102;&#19968;&#20010;&#27979;&#35797;&#26469;&#26816;&#39564;&#31526;&#21495;&#39281;&#21644;&#26465;&#20214;&#65292;&#24182;&#21487;&#20351;&#29992;&#29616;&#26377;&#30340;&#26368;&#22823;&#20998;&#25968;&#20272;&#35745;&#31639;&#27861;&#36827;&#34892;&#23454;&#26045;&#12290;</title><link>http://arxiv.org/abs/2206.10475</link><description>&lt;p&gt;
&#20108;&#36873;&#19968;&#27169;&#22411;&#20013;&#22266;&#23450;&#25928;&#24212;&#35782;&#21035;&#30340;&#26032;&#21487;&#33021;&#24615;
&lt;/p&gt;
&lt;p&gt;
New possibilities in identification of binary choice models with fixed effects. (arXiv:2206.10475v4 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2206.10475
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#24102;&#26377;&#22266;&#23450;&#25928;&#24212;&#30340;&#20108;&#36873;&#19968;&#27169;&#22411;&#30340;&#35782;&#21035;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#31526;&#21495;&#39281;&#21644;&#26465;&#20214;&#24182;&#35777;&#26126;&#20854;&#36275;&#20197;&#23454;&#29616;&#27169;&#22411;&#30340;&#35782;&#21035;&#12290;&#21516;&#26102;&#65292;&#25105;&#20204;&#36824;&#25552;&#20379;&#20102;&#19968;&#20010;&#27979;&#35797;&#26469;&#26816;&#39564;&#31526;&#21495;&#39281;&#21644;&#26465;&#20214;&#65292;&#24182;&#21487;&#20351;&#29992;&#29616;&#26377;&#30340;&#26368;&#22823;&#20998;&#25968;&#20272;&#35745;&#31639;&#27861;&#36827;&#34892;&#23454;&#26045;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#24102;&#26377;&#22266;&#23450;&#25928;&#24212;&#30340;&#20108;&#36873;&#19968;&#27169;&#22411;&#30340;&#35782;&#21035;&#38382;&#39064;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#19968;&#31181;&#31216;&#20026;&#31526;&#21495;&#39281;&#21644;&#26465;&#20214;&#30340;&#26465;&#20214;&#65292;&#24182;&#35777;&#26126;&#35813;&#26465;&#20214;&#36275;&#20197;&#23545;&#35813;&#27169;&#22411;&#36827;&#34892;&#35782;&#21035;&#12290;&#29305;&#21035;&#26159;&#65292;&#25105;&#20204;&#21487;&#20197;&#20445;&#35777;&#21363;&#20351;&#22312;&#26377;&#30028;&#30340;&#22238;&#24402;&#21464;&#37327;&#24773;&#20917;&#19979;&#20063;&#33021;&#23454;&#29616;&#35782;&#21035;&#12290;&#25105;&#20204;&#36824;&#35777;&#26126;&#20102;&#22312;&#27809;&#26377;&#31526;&#21495;&#39281;&#21644;&#26465;&#20214;&#30340;&#24773;&#20917;&#19979;&#65292;&#38500;&#38750;&#35823;&#24046;&#20998;&#24067;&#23646;&#20110;&#19968;&#20010;&#23567;&#31867;&#21035;&#65292;&#21542;&#21017;&#26080;&#27861;&#23545;&#35813;&#27169;&#22411;&#36827;&#34892;&#35782;&#21035;&#12290;&#30456;&#21516;&#30340;&#31526;&#21495;&#39281;&#21644;&#26465;&#20214;&#20063;&#23545;&#20110;&#35782;&#21035;&#27835;&#30103;&#25928;&#24212;&#30340;&#31526;&#21495;&#33267;&#20851;&#37325;&#35201;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#19968;&#20010;&#27979;&#35797;&#26469;&#26816;&#26597;&#31526;&#21495;&#39281;&#21644;&#26465;&#20214;&#65292;&#24182;&#21487;&#20197;&#20351;&#29992;&#29616;&#26377;&#30340;&#26368;&#22823;&#20998;&#25968;&#20272;&#35745;&#31639;&#27861;&#36827;&#34892;&#23454;&#26045;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study the identification of binary choice models with fixed effects. We provide a condition called sign saturation and show that this condition is sufficient for the identification of the model. In particular, we can guarantee identification even with bounded regressors. We also show that without this condition, the model is not identified unless the error distribution belongs to a small class. The same sign saturation condition is also essential for identifying the sign of treatment effects. A test is provided to check the sign saturation condition and can be implemented using existing algorithms for the maximum score estimator.
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#25935;&#24863;&#24615;&#20998;&#26512;&#26041;&#27861;&#65292;&#36991;&#20813;&#20102;&#20256;&#32479;&#26041;&#27861;&#20013;&#24120;&#24120;&#34987;&#35748;&#20026;&#26159;&#24378;&#20551;&#35774;&#21644;&#19981;&#21487;&#34892;&#30340;&#20551;&#35774;&#65292;&#20801;&#35768;&#30465;&#30053;&#30340;&#21464;&#37327;&#19982;&#21253;&#21547;&#30340;&#25511;&#21046;&#21464;&#37327;&#30456;&#20851;&#65292;&#24182;&#20801;&#35768;&#30740;&#31350;&#20154;&#21592;&#26657;&#20934;&#28789;&#25935;&#24230;&#12290;</title><link>http://arxiv.org/abs/2206.02303</link><description>&lt;p&gt;
&#24403;&#25511;&#21046;&#21464;&#37327;&#23384;&#22312;&#20869;&#29983;&#24615;&#26102;&#65292;&#35780;&#20272;&#30465;&#30053;&#21464;&#37327;&#20559;&#35823;
&lt;/p&gt;
&lt;p&gt;
Assessing Omitted Variable Bias when the Controls are Endogenous. (arXiv:2206.02303v3 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2206.02303
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#25935;&#24863;&#24615;&#20998;&#26512;&#26041;&#27861;&#65292;&#36991;&#20813;&#20102;&#20256;&#32479;&#26041;&#27861;&#20013;&#24120;&#24120;&#34987;&#35748;&#20026;&#26159;&#24378;&#20551;&#35774;&#21644;&#19981;&#21487;&#34892;&#30340;&#20551;&#35774;&#65292;&#20801;&#35768;&#30465;&#30053;&#30340;&#21464;&#37327;&#19982;&#21253;&#21547;&#30340;&#25511;&#21046;&#21464;&#37327;&#30456;&#20851;&#65292;&#24182;&#20801;&#35768;&#30740;&#31350;&#20154;&#21592;&#26657;&#20934;&#28789;&#25935;&#24230;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#30465;&#30053;&#21464;&#37327;&#26159;&#23548;&#33268;&#22240;&#26524;&#25928;&#24212;&#35782;&#21035;&#21463;&#21040;&#26368;&#22823;&#23041;&#32961;&#30340;&#22240;&#32032;&#20043;&#19968;&#12290;&#21253;&#25324;Oster&#65288;2019&#65289;&#22312;&#20869;&#30340;&#20960;&#31181;&#24191;&#27867;&#20351;&#29992;&#30340;&#26041;&#27861;&#36890;&#36807;&#23558;&#21487;&#35266;&#27979;&#36873;&#25321;&#27979;&#37327;&#19982;&#19981;&#21487;&#35266;&#27979;&#36873;&#25321;&#27979;&#37327;&#36827;&#34892;&#27604;&#36739;&#26469;&#35780;&#20272;&#30465;&#30053;&#21464;&#37327;&#23545;&#32463;&#39564;&#32467;&#35770;&#30340;&#24433;&#21709;&#12290;&#36825;&#20123;&#26041;&#27861;&#35201;&#20040;&#65288;1&#65289;&#20551;&#35774;&#30465;&#30053;&#30340;&#21464;&#37327;&#19982;&#21253;&#25324;&#30340;&#25511;&#21046;&#21464;&#37327;&#19981;&#30456;&#20851;&#65292;&#36825;&#20010;&#20551;&#35774;&#24120;&#24120;&#34987;&#35748;&#20026;&#26159;&#24378;&#20551;&#35774;&#21644;&#19981;&#21487;&#34892;&#30340;&#65292;&#35201;&#20040;&#65288;2&#65289;&#20351;&#29992;&#27531;&#24046;&#27861;&#26469;&#36991;&#20813;&#36825;&#20010;&#20551;&#35774;&#12290;&#22312;&#25105;&#20204;&#30340;&#31532;&#19968;&#39033;&#36129;&#29486;&#20013;&#65292;&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#20010;&#26694;&#26550;&#65292;&#29992;&#20110;&#23458;&#35266;&#22320;&#27604;&#36739;&#25935;&#24863;&#24230;&#21442;&#25968;&#12290;&#25105;&#20204;&#21033;&#29992;&#36825;&#20010;&#26694;&#26550;&#27491;&#24335;&#35777;&#26126;&#27531;&#24046;&#21270;&#26041;&#27861;&#36890;&#24120;&#20250;&#23548;&#33268;&#26377;&#20851;&#40065;&#26834;&#24615;&#30340;&#38169;&#35823;&#32467;&#35770;&#12290;&#22312;&#25105;&#20204;&#30340;&#31532;&#20108;&#39033;&#36129;&#29486;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#25935;&#24863;&#24615;&#20998;&#26512;&#26041;&#27861;&#65292;&#36991;&#20813;&#20102;&#36825;&#20010;&#25209;&#35780;&#65292;&#20801;&#35768;&#30465;&#30053;&#30340;&#21464;&#37327;&#19982;&#21253;&#21547;&#30340;&#25511;&#21046;&#21464;&#37327;&#30456;&#20851;&#65292;&#24182;&#20801;&#35768;&#30740;&#31350;&#20154;&#21592;&#26657;&#20934;&#28789;&#25935;&#24230;&#12290;
&lt;/p&gt;
&lt;p&gt;
Omitted variables are one of the most important threats to the identification of causal effects. Several widely used approaches, including Oster (2019), assess the impact of omitted variables on empirical conclusions by comparing measures of selection on observables with measures of selection on unobservables. These approaches either (1) assume the omitted variables are uncorrelated with the included controls, an assumption that is often considered strong and implausible, or (2) use a method called residualization to avoid this assumption. In our first contribution, we develop a framework for objectively comparing sensitivity parameters. We use this framework to formally prove that the residualization method generally leads to incorrect conclusions about robustness. In our second contribution, we then provide a new approach to sensitivity analysis that avoids this critique, allows the omitted variables to be correlated with the included controls, and lets researchers calibrate sensitiv
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#24615;&#36136;&#65288;&#22522;&#22240;&#36164;&#36136;&#65289;&#21644;&#22521;&#20859;&#65288;&#29615;&#22659;&#65289;&#22312;&#25945;&#32946;&#25104;&#23601;&#20013;&#30340;&#30456;&#20114;&#20316;&#29992;&#65292;&#21457;&#29616;&#20855;&#26377;&#36739;&#39640;&#22522;&#22240;&#36164;&#36136;&#30340;&#20154;&#22312;&#25104;&#20026;&#23478;&#20013;&#38271;&#23376;&#25110;&#38271;&#22899;&#26102;&#33719;&#30410;&#26356;&#22810;&#12290;</title><link>http://arxiv.org/abs/2012.05021</link><description>&lt;p&gt;
&#25945;&#32946;&#25104;&#23601;&#20013;&#30340;&#24615;&#36136;&#19982;&#22521;&#20859;&#30456;&#20114;&#20316;&#29992;
&lt;/p&gt;
&lt;p&gt;
Nature-nurture interplay in educational attainment. (arXiv:2012.05021v3 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2012.05021
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#24615;&#36136;&#65288;&#22522;&#22240;&#36164;&#36136;&#65289;&#21644;&#22521;&#20859;&#65288;&#29615;&#22659;&#65289;&#22312;&#25945;&#32946;&#25104;&#23601;&#20013;&#30340;&#30456;&#20114;&#20316;&#29992;&#65292;&#21457;&#29616;&#20855;&#26377;&#36739;&#39640;&#22522;&#22240;&#36164;&#36136;&#30340;&#20154;&#22312;&#25104;&#20026;&#23478;&#20013;&#38271;&#23376;&#25110;&#38271;&#22899;&#26102;&#33719;&#30410;&#26356;&#22810;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#23637;&#31034;&#20102;&#24615;&#36136;&#65288;&#21363;&#20010;&#20307;&#30340;&#22522;&#22240;&#36164;&#36136;&#65289;&#21644;&#22521;&#20859;&#65288;&#21363;&#20010;&#20307;&#30340;&#29615;&#22659;&#65289;&#22312;&#25945;&#32946;&#25104;&#23601;&#20013;&#30340;&#30456;&#20114;&#20316;&#29992;&#12290;&#36890;&#36807;&#20351;&#29992;&#25945;&#32946;&#25104;&#23601;&#30340;&#22810;&#22522;&#22240;&#35780;&#20998;&#26469;&#24230;&#37327;&#22522;&#22240;&#36164;&#36136;&#65292;&#21516;&#26102;&#23558;&#20986;&#29983;&#39034;&#24207;&#20316;&#20026;&#25945;&#32946;&#25104;&#23601;&#30340;&#37325;&#35201;&#29615;&#22659;&#20915;&#23450;&#22240;&#32032;&#12290;&#30001;&#20110;&#22522;&#22240;&#36164;&#36136;&#22312;&#21516;&#19968;&#23478;&#24237;&#20869;&#26159;&#38543;&#26426;&#20998;&#37197;&#30340;&#65292;&#24182;&#19988;&#19982;&#20986;&#29983;&#39034;&#24207;&#27491;&#20132;&#65292;&#25105;&#20204;&#30340;&#23478;&#24237;&#22266;&#23450;&#25928;&#24212;&#26041;&#27861;&#21033;&#29992;&#20102;&#22522;&#22240;&#36164;&#36136;&#21644;&#29615;&#22659;&#30340;&#22806;&#29983;&#21464;&#21270;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#20855;&#26377;&#36739;&#39640;&#22522;&#22240;&#36164;&#36136;&#30340;&#20154;&#22312;&#25104;&#20026;&#23478;&#20013;&#38271;&#23376;&#25110;&#38271;&#22899;&#26102;&#20174;&#20013;&#33719;&#30410;&#26356;&#22810;&#65292;&#30456;&#27604;&#20043;&#19979;&#65292;&#22522;&#22240;&#36164;&#36136;&#36739;&#20302;&#30340;&#20154;&#33719;&#30410;&#36739;&#23569;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper shows how nature (i.e., one's genetic endowments) and nurture (i.e., one's environment) interact in producing educational attainment. Genetic endowments are measured using a polygenic score for educational attainment, while we use birth order as an important environmental determinant of educational attainment. Since genetic endowments are randomly assigned within-families and orthogonal to one's birth order, our family fixed effects approach exploits exogenous variation in genetic endowments as well as environments. We find that those with higher genetic endowments benefit disproportionally more from being firstborn compared to those with lower genetic endowments.
&lt;/p&gt;</description></item></channel></rss>