<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#35813;&#30740;&#31350;&#25581;&#31034;&#20102;LLM&#20195;&#29702;&#29978;&#33267;&#22312;&#31454;&#20105;&#29615;&#22659;&#20013;&#20063;&#33021;&#33258;&#21457;&#24418;&#25104;&#21512;&#20316;&#20851;&#31995;&#30340;&#33021;&#21147;&#65292;&#39564;&#35777;&#20102;&#35745;&#31639;&#31038;&#20250;&#31185;&#23398;&#30340;&#24895;&#26223;&#65292;&#34920;&#26126;LLM&#20195;&#29702;&#21487;&#20197;&#29992;&#20110;&#27169;&#25311;&#20154;&#31867;&#31038;&#20250;&#20114;&#21160;&#65292;&#21253;&#25324;&#33258;&#21457;&#21512;&#20316;&#30340;&#20114;&#21160;&#65292;&#20026;&#31038;&#20250;&#29616;&#35937;&#25552;&#20379;&#27934;&#23519;&#12290;</title><link>https://arxiv.org/abs/2402.12327</link><description>&lt;p&gt;
&#25105;&#20204;&#24212;&#35813;&#20132;&#27969;&#21527;&#65306;&#25506;&#32034;&#31454;&#20105;LLM&#20195;&#29702;&#20043;&#38388;&#30340;&#33258;&#21457;&#21512;&#20316;
&lt;/p&gt;
&lt;p&gt;
Shall We Talk: Exploring Spontaneous Collaborations of Competing LLM Agents
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.12327
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#25581;&#31034;&#20102;LLM&#20195;&#29702;&#29978;&#33267;&#22312;&#31454;&#20105;&#29615;&#22659;&#20013;&#20063;&#33021;&#33258;&#21457;&#24418;&#25104;&#21512;&#20316;&#20851;&#31995;&#30340;&#33021;&#21147;&#65292;&#39564;&#35777;&#20102;&#35745;&#31639;&#31038;&#20250;&#31185;&#23398;&#30340;&#24895;&#26223;&#65292;&#34920;&#26126;LLM&#20195;&#29702;&#21487;&#20197;&#29992;&#20110;&#27169;&#25311;&#20154;&#31867;&#31038;&#20250;&#20114;&#21160;&#65292;&#21253;&#25324;&#33258;&#21457;&#21512;&#20316;&#30340;&#20114;&#21160;&#65292;&#20026;&#31038;&#20250;&#29616;&#35937;&#25552;&#20379;&#27934;&#23519;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26368;&#36817;&#30340;&#36827;&#23637;&#34920;&#26126;&#65292;&#30001;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLMs&#65289;&#39537;&#21160;&#30340;&#20195;&#29702;&#20855;&#26377;&#27169;&#25311;&#20154;&#31867;&#34892;&#20026;&#21644;&#31038;&#20250;&#21160;&#24577;&#30340;&#33021;&#21147;&#12290;&#28982;&#32780;&#65292;&#23578;&#26410;&#30740;&#31350;LLM&#20195;&#29702;&#22312;&#27809;&#26377;&#26126;&#30830;&#25351;&#20196;&#30340;&#24773;&#20917;&#19979;&#33258;&#21457;&#24314;&#31435;&#21512;&#20316;&#20851;&#31995;&#30340;&#28508;&#21147;&#12290;&#20026;&#20102;&#24357;&#34917;&#36825;&#19968;&#31354;&#30333;&#65292;&#25105;&#20204;&#36827;&#34892;&#20102;&#19977;&#39033;&#26696;&#20363;&#30740;&#31350;&#65292;&#25581;&#31034;&#20102;LLM&#20195;&#29702;&#29978;&#33267;&#22312;&#31454;&#20105;&#29615;&#22659;&#20013;&#20063;&#33021;&#33258;&#21457;&#24418;&#25104;&#21512;&#20316;&#20851;&#31995;&#30340;&#33021;&#21147;&#12290;&#36825;&#19968;&#21457;&#29616;&#19981;&#20165;&#23637;&#31034;&#20102;LLM&#20195;&#29702;&#27169;&#25311;&#20154;&#31867;&#31038;&#20250;&#20013;&#31454;&#20105;&#19982;&#21512;&#20316;&#30340;&#33021;&#21147;&#65292;&#20063;&#39564;&#35777;&#20102;&#35745;&#31639;&#31038;&#20250;&#31185;&#23398;&#30340;&#19968;&#20010;&#26377;&#21069;&#36884;&#30340;&#24895;&#26223;&#12290;&#20855;&#20307;&#26469;&#35828;&#65292;&#36825;&#34920;&#26126;LLM&#20195;&#29702;&#21487;&#20197;&#29992;&#20110;&#24314;&#27169;&#20154;&#31867;&#31038;&#20250;&#20114;&#21160;&#65292;&#21253;&#25324;&#37027;&#20123;&#33258;&#21457;&#21512;&#20316;&#30340;&#20114;&#21160;&#65292;&#20174;&#32780;&#25552;&#20379;&#23545;&#31038;&#20250;&#29616;&#35937;&#30340;&#27934;&#23519;&#12290;&#36825;&#39033;&#30740;&#31350;&#30340;&#28304;&#20195;&#30721;&#21487;&#22312;https://github.com/wuzengqing001225/SABM_ShallWe &#25214;&#21040;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.12327v1 Announce Type: new  Abstract: Recent advancements have shown that agents powered by large language models (LLMs) possess capabilities to simulate human behaviors and societal dynamics. However, the potential for LLM agents to spontaneously establish collaborative relationships in the absence of explicit instructions has not been studied. To address this gap, we conduct three case studies, revealing that LLM agents are capable of spontaneously forming collaborations even within competitive settings. This finding not only demonstrates the capacity of LLM agents to mimic competition and cooperation in human societies but also validates a promising vision of computational social science. Specifically, it suggests that LLM agents could be utilized to model human social interactions, including those with spontaneous collaborations, thus offering insights into social phenomena. The source codes for this study are available at https://github.com/wuzengqing001225/SABM_ShallWe
&lt;/p&gt;</description></item><item><title>LTU&#21305;&#37197;&#38382;&#39064;&#21487;&#20197;&#30475;&#20316;&#26159;&#20004;&#20010;&#29609;&#23478;&#20043;&#38388;&#30340;&#38750;&#38646;&#21644;&#21338;&#24328;&#65292;&#24341;&#20837;&#20102;&#26032;&#30340;&#26725;&#26753;&#23558;&#38750;TU&#21305;&#37197;&#38382;&#39064;&#19982;&#21452;&#30697;&#38453;&#21338;&#24328;&#29702;&#35770;&#32852;&#31995;&#36215;&#26469;&#65292;&#23545;&#20110;&#31283;&#23450;&#32467;&#26524;&#30340;&#35745;&#31639;&#26377;&#37325;&#35201;&#24433;&#21709;&#12290;</title><link>https://arxiv.org/abs/2402.12200</link><description>&lt;p&gt;
&#20855;&#26377;&#32447;&#24615;&#36716;&#31227;&#30340;&#21305;&#37197;&#38382;&#39064;&#31561;&#21516;&#20110;&#36530;&#29483;&#29483;&#28216;&#25103;
&lt;/p&gt;
&lt;p&gt;
The matching problem with linear transfers is equivalent to a hide-and-seek game
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.12200
&lt;/p&gt;
&lt;p&gt;
LTU&#21305;&#37197;&#38382;&#39064;&#21487;&#20197;&#30475;&#20316;&#26159;&#20004;&#20010;&#29609;&#23478;&#20043;&#38388;&#30340;&#38750;&#38646;&#21644;&#21338;&#24328;&#65292;&#24341;&#20837;&#20102;&#26032;&#30340;&#26725;&#26753;&#23558;&#38750;TU&#21305;&#37197;&#38382;&#39064;&#19982;&#21452;&#30697;&#38453;&#21338;&#24328;&#29702;&#35770;&#32852;&#31995;&#36215;&#26469;&#65292;&#23545;&#20110;&#31283;&#23450;&#32467;&#26524;&#30340;&#35745;&#31639;&#26377;&#37325;&#35201;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20855;&#26377;&#32447;&#24615;&#21487;&#36716;&#31227;&#25928;&#29992;&#65288;LTU&#65289;&#30340;&#21305;&#37197;&#38382;&#39064;&#36890;&#36807;&#25918;&#23485;&#22312;&#21305;&#37197;&#23545;&#20013;&#25928;&#29992;&#25353;&#27604;&#20363;&#36716;&#31227;&#30340;&#20551;&#35774;&#65292;&#23558;&#20256;&#32479;&#30340;&#21487;&#36716;&#31227;&#25928;&#29992;&#65288;TU&#65289;&#24773;&#24418;&#36827;&#34892;&#20102;&#25512;&#24191;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;LTU&#21305;&#37197;&#38382;&#39064;&#21487;&#20197;&#37325;&#26032;&#26500;&#24314;&#20026;&#20004;&#20010;&#29609;&#23478;&#20043;&#38388;&#30340;&#38750;&#38646;&#21644;&#21338;&#24328;&#65292;&#20174;&#32780;&#25512;&#24191;&#20102;&#20911;&#183;&#35834;&#20381;&#26364;&#30340;&#19968;&#20010;&#32467;&#26524;&#12290;&#28982;&#32780;&#65292;&#24403;&#36716;&#21521;LTU&#26102;&#65292;TU&#21305;&#37197;&#38382;&#39064;&#30340;&#22522;&#30784;&#32447;&#24615;&#35268;&#21010;&#32467;&#26500;&#20250;&#20002;&#22833;&#12290;&#36825;&#20123;&#32467;&#26524;&#22312;&#38750;TU&#21305;&#37197;&#38382;&#39064;&#21644;&#21452;&#30697;&#38453;&#21338;&#24328;&#29702;&#35770;&#20043;&#38388;&#25645;&#24314;&#20102;&#19968;&#24231;&#26032;&#30340;&#26725;&#26753;&#65292;&#23588;&#20854;&#22312;&#31283;&#23450;&#32467;&#26524;&#30340;&#35745;&#31639;&#26041;&#38754;&#20135;&#29983;&#20102;&#37325;&#35201;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.12200v1 Announce Type: new  Abstract: Matching problems with linearly transferable utility (LTU) generalize the well-studied transferable utility (TU) case by relaxing the assumption that utility is transferred one-for-one within matched pairs. We show that LTU matching problems can be reframed as nonzero-sum games between two players, thus generalizing a result from von Neumann. The underlying linear programming structure of TU matching problems, however, is lost when moving to LTU. These results draw a new bridge between non-TU matching problems and the theory of bimatrix games, with consequences notably regarding the computation of stable outcomes.
&lt;/p&gt;</description></item><item><title>&#30740;&#31350;&#20998;&#26512;&#20102;&#20844;&#21496;&#25259;&#38706;&#35268;&#23450;&#20013;&#36879;&#26126;&#24230;&#30340;&#31119;&#21033;&#21518;&#26524;&#65292;&#21457;&#29616;&#20102;&#36879;&#26126;&#24230;&#19982;&#22806;&#37096;&#24615;&#20043;&#38388;&#30340;&#28508;&#22312;&#26435;&#34913;&#65292;&#21516;&#26102;&#25351;&#20986;&#24378;&#21046;&#36827;&#34892;&#20840;&#38754;&#25259;&#38706;&#19982;&#26368;&#22823;&#21270;&#20844;&#21496;&#31169;&#20154;&#21033;&#30410;&#30340;&#25928;&#26524;&#30456;&#21516;&#12290;</title><link>https://arxiv.org/abs/2402.11961</link><description>&lt;p&gt;
&#27668;&#20505;&#25259;&#38706;&#25919;&#31574;&#30340;&#26368;&#20248;&#35774;&#35745;&#65306;&#36879;&#26126;&#24230;&#23545;&#22806;&#37096;&#24615;&#30340;&#24433;&#21709;
&lt;/p&gt;
&lt;p&gt;
Optimal Design of Climate Disclosure Policies: Transparency versus Externality
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.11961
&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#20998;&#26512;&#20102;&#20844;&#21496;&#25259;&#38706;&#35268;&#23450;&#20013;&#36879;&#26126;&#24230;&#30340;&#31119;&#21033;&#21518;&#26524;&#65292;&#21457;&#29616;&#20102;&#36879;&#26126;&#24230;&#19982;&#22806;&#37096;&#24615;&#20043;&#38388;&#30340;&#28508;&#22312;&#26435;&#34913;&#65292;&#21516;&#26102;&#25351;&#20986;&#24378;&#21046;&#36827;&#34892;&#20840;&#38754;&#25259;&#38706;&#19982;&#26368;&#22823;&#21270;&#20844;&#21496;&#31169;&#20154;&#21033;&#30410;&#30340;&#25928;&#26524;&#30456;&#21516;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20998;&#26512;&#20102;&#20844;&#21496;&#25259;&#38706;&#35268;&#23450;&#20013;&#36879;&#26126;&#24230;&#30340;&#31119;&#21033;&#21518;&#26524;&#65292;&#20854;&#20013;&#30417;&#31649;&#24615;&#25259;&#38706;&#26500;&#25104;&#26680;&#23454;&#20225;&#19994;&#25490;&#25918;&#30340;&#21807;&#19968;&#36884;&#24452;&#12290;&#30740;&#31350;&#34920;&#26126;&#65292;&#25259;&#38706;&#36879;&#26126;&#24230;&#19982;&#22806;&#37096;&#24615;&#20043;&#38388;&#23384;&#22312;&#28508;&#22312;&#30340;&#26435;&#34913;&#65292;&#20108;&#32773;&#20043;&#38388;&#21576;&#38750;&#21333;&#35843;&#20851;&#31995;&#12290;&#32780;&#22686;&#21152;&#36879;&#26126;&#24230;&#27704;&#36828;&#19981;&#20250;&#35753;&#20844;&#21496;&#21464;&#24471;&#26356;&#31967;&#12290;&#22240;&#27492;&#65292;&#24378;&#21046;&#36827;&#34892;&#20840;&#38754;&#25259;&#38706;&#19982;&#26368;&#22823;&#21270;&#20844;&#21496;&#31169;&#20154;&#21033;&#30410;&#30340;&#25928;&#26524;&#30456;&#21516;&#65292;&#32780;&#24573;&#35270;&#38543;&#20043;&#20135;&#29983;&#30340;&#22806;&#37096;&#24615;&#12290;&#24403;&#30417;&#31649;&#26426;&#26500;&#23545;&#20844;&#21496;&#30340;&#33021;&#28304;&#25928;&#29575;&#27700;&#24179;&#20855;&#26377;&#23545;&#31216;&#20449;&#24687;&#26102;&#65292;&#36879;&#26126;&#24230;&#36229;&#20986;&#20108;&#20803;&#25259;&#38706;&#24182;&#19981;&#20250;&#23548;&#33268;&#31119;&#21033;&#25913;&#21892;&#12290;&#22312;&#20449;&#24687;&#19981;&#23545;&#31216;&#30340;&#24773;&#20917;&#19979;&#65292;&#26368;&#22823;&#21270;&#31119;&#21033;&#30340;&#25259;&#38706;&#37319;&#21462;&#38408;&#20540;&#24418;&#24335;&#65306;&#38408;&#20540;&#20197;&#19978;&#30340;&#25152;&#26377;&#25490;&#25918;&#23384;&#22312;&#22806;&#37096;.
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.11961v1 Announce Type: new  Abstract: Does a more transparent climate disclosure policy induce lower emissions? This paper analyzes the welfare consequences of transparency in corporate disclosure regulation in an environment in which regulatory disclosure constitutes the sole avenue for the verification of a firm's emissions. On the one hand, a potential trade-off between disclosure transparency and externality suggests a non-monotonic relationship between them. On the other hand, increased transparency never makes the firm worse off. Consequently, mandating full disclosure is no different from maximizing the firm's private benefit while disregarding the ensuing externality. When the regulator is symmetrically informed about the firm's energy efficiency level, transparency beyond binary disclosure does not lead to welfare improvements. In the presence of information asymmetry, the welfare-maximizing disclosure takes a threshold form: all emissions above the threshold are po
&lt;/p&gt;</description></item><item><title>&#24403;&#34394;&#25311;&#20215;&#20540;&#26159;&#25311;&#20985;&#20989;&#25968;&#26102;&#65292;&#21487;&#20197;&#36890;&#36807;&#36866;&#24403;&#25130;&#26029;&#25918;&#26494;&#38382;&#39064;&#30340;&#35299;&#26469;&#25214;&#21040;&#26368;&#20248;&#20998;&#37197;&#65292;&#24182;&#25552;&#20379;&#20102;&#19968;&#20010;&#31616;&#21333;&#31639;&#27861;&#26469;&#23454;&#29616;&#12290;</title><link>https://arxiv.org/abs/2402.11881</link><description>&lt;p&gt;
&#29096;&#28907;&#20998;&#37197;
&lt;/p&gt;
&lt;p&gt;
Ironing allocations
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.11881
&lt;/p&gt;
&lt;p&gt;
&#24403;&#34394;&#25311;&#20215;&#20540;&#26159;&#25311;&#20985;&#20989;&#25968;&#26102;&#65292;&#21487;&#20197;&#36890;&#36807;&#36866;&#24403;&#25130;&#26029;&#25918;&#26494;&#38382;&#39064;&#30340;&#35299;&#26469;&#25214;&#21040;&#26368;&#20248;&#20998;&#37197;&#65292;&#24182;&#25552;&#20379;&#20102;&#19968;&#20010;&#31616;&#21333;&#31639;&#27861;&#26469;&#23454;&#29616;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#26041;&#27861;&#26469;&#35299;&#20915;&#26631;&#20934;&#31579;&#36873;&#38382;&#39064;&#65292;&#24403;&#21333;&#35843;&#24615;&#32422;&#26463;&#21457;&#29983;&#26102;&#12290;&#19968;&#20010;&#31616;&#21333;&#30340;&#20960;&#20309;&#35770;&#35777;&#34920;&#26126;&#65292;&#24403;&#34394;&#25311;&#20215;&#20540;&#26159;&#25311;&#20985;&#20989;&#25968;&#26102;&#65292;&#21487;&#20197;&#36890;&#36807;&#36866;&#24403;&#25130;&#26029;&#25918;&#26494;&#38382;&#39064;&#30340;&#35299;&#26469;&#25214;&#21040;&#26368;&#20248;&#20998;&#37197;&#12290;&#25105;&#25552;&#20379;&#20102;&#19968;&#20010;&#31616;&#21333;&#30340;&#31639;&#27861;&#26469;&#25214;&#21040;&#36825;&#31181;&#26368;&#20248;&#25130;&#26029;&#65292;&#24403;&#34394;&#25311;&#20215;&#20540;&#26159;&#20985;&#20989;&#25968;&#26102;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.11881v1 Announce Type: new  Abstract: I propose a new approach to solving standard screening problems when the monotonicity constraint binds. A simple geometric argument shows that when virtual values are quasi-concave, the optimal allocation can be found by appropriately truncating the solution to the relaxed problem. I provide a simple algorithm for finding this optimal truncation when virtual values are concave.
&lt;/p&gt;</description></item><item><title>&#22686;&#21152;&#25215;&#35834;&#33021;&#21147;&#23545;&#20449;&#24687;&#25552;&#20379;&#30340;&#24433;&#21709;&#65292;&#24403;&#24066;&#22330;&#31232;&#30095;&#26102;&#65292;&#28040;&#36153;&#32773;&#26356;&#21916;&#27426;&#28608;&#28872;&#30340;&#20215;&#26684;&#31454;&#20105;&#65292;&#32780;&#20844;&#21496;&#24635;&#26159;&#26356;&#21916;&#27426;&#21516;&#26102;&#25351;&#23548;&#25628;&#32034;&#30340;&#24773;&#20917;&#12290;</title><link>https://arxiv.org/abs/2402.11754</link><description>&lt;p&gt;
&#36890;&#36807;&#20215;&#26684;&#21644;&#20449;&#24687;&#21560;&#24341;
&lt;/p&gt;
&lt;p&gt;
Attraction Via Prices and Information
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.11754
&lt;/p&gt;
&lt;p&gt;
&#22686;&#21152;&#25215;&#35834;&#33021;&#21147;&#23545;&#20449;&#24687;&#25552;&#20379;&#30340;&#24433;&#21709;&#65292;&#24403;&#24066;&#22330;&#31232;&#30095;&#26102;&#65292;&#28040;&#36153;&#32773;&#26356;&#21916;&#27426;&#28608;&#28872;&#30340;&#20215;&#26684;&#31454;&#20105;&#65292;&#32780;&#20844;&#21496;&#24635;&#26159;&#26356;&#21916;&#27426;&#21516;&#26102;&#25351;&#23548;&#25628;&#32034;&#30340;&#24773;&#20917;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#22312;&#19968;&#20010;&#23384;&#22312;&#25628;&#32034;&#25705;&#25830;&#30340;&#23521;&#22836;&#24066;&#22330;&#20013;&#65292;&#22686;&#21152;&#25215;&#35834;&#33021;&#21147;&#23545;&#20449;&#24687;&#25552;&#20379;&#30340;&#24433;&#21709;&#12290;&#23613;&#31649;&#20215;&#26684;&#34987;&#20844;&#24067;&#24182;&#24341;&#23548;&#25628;&#32034;&#65292;&#20294;&#22914;&#26524;&#20844;&#21496;&#26080;&#27861;&#25215;&#35834;&#20449;&#24687;&#25552;&#20379;&#25919;&#31574;&#65292;&#37027;&#20040;&#22312;&#22343;&#34913;&#29366;&#24577;&#19979;&#27809;&#26377;&#31215;&#26497;&#30340;&#25628;&#32034;&#65292;&#22240;&#27492;&#28040;&#36153;&#32773;&#26368;&#22810;&#21482;&#20250;&#35775;&#38382;&#65288;&#24182;&#20174;&#20013;&#36141;&#20080;&#65289;&#19968;&#20010;&#20844;&#21496;&#12290;&#22914;&#26524;&#20844;&#21496;&#21487;&#20197;&#36890;&#36807;&#23427;&#20204;&#30340;&#20215;&#26684;&#21644;&#20449;&#24687;&#25919;&#31574;&#24341;&#23548;&#25628;&#32034;&#65292;&#37027;&#20040;&#23384;&#22312;&#19968;&#20010;&#29420;&#29305;&#30340;&#23545;&#31216;&#22343;&#34913;&#65292;&#34920;&#29616;&#20986;&#20215;&#26684;&#20998;&#25955;&#21644;&#31215;&#26497;&#30340;&#25628;&#32034;&#12290;&#28982;&#32780;&#65292;&#24403;&#24066;&#22330;&#31232;&#30095;&#26102;&#65292;&#28040;&#36153;&#32773;&#26356;&#21916;&#27426;&#21069;&#19968;&#31181;&#24773;&#20917;&#65292;&#22240;&#20026;&#23427;&#34920;&#29616;&#20986;&#28608;&#28872;&#30340;&#20215;&#26684;&#31454;&#20105;&#12290;&#32780;&#20844;&#21496;&#24635;&#26159;&#26356;&#21916;&#27426;&#21518;&#32773;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.11754v1 Announce Type: new  Abstract: We study the ramifications of increased commitment power for information provision in an oligopolistic market with search frictions. Although prices are posted and, therefore, guide search, if firms cannot commit to information provision policies, there is no active search at equilibrium so consumers visit (and purchase from) at most one firm. If firms can guide search by both their prices and information policies, there exists a unique symmetric equilibrium exhibiting price dispersion and active search. Nevertheless, when the market is thin, consumers prefer the former case, which features intense price competition. Firms always prefer the latter.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#24341;&#20837;&#20102;&#31867;&#20284;&#20110;&#32463;&#20856;Gerber-Shiu&#39044;&#26399;&#25240;&#25187;&#32602;&#20989;&#25968;&#30340;&#20989;&#25968;&#65292;&#29992;&#20110;&#20998;&#26512;&#23478;&#24237;&#36164;&#26412;&#38519;&#20837;&#36139;&#22256;&#38519;&#38449;&#26102;&#30340;&#29305;&#24449;&#65292;&#24182;&#33719;&#24471;&#20102;&#19968;&#20123;&#32463;&#20856;&#39118;&#38505;&#29702;&#35770;&#20013;&#36890;&#24120;&#30740;&#31350;&#30340;&#37327;&#30340;&#38381;&#21512;&#24418;&#24335;&#34920;&#36798;&#24335;&#12290;</title><link>https://arxiv.org/abs/2402.11715</link><description>&lt;p&gt;
&#12298;Gerber-Shiu&#39044;&#26399;&#25240;&#25187;&#32602;&#20989;&#25968;&#65306;&#36139;&#22256;&#38519;&#38449;&#30340;&#24212;&#29992;&#12299;
&lt;/p&gt;
&lt;p&gt;
The Gerber-Shiu Expected Discounted Penalty Function: An Application to Poverty Trapping
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.11715
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#24341;&#20837;&#20102;&#31867;&#20284;&#20110;&#32463;&#20856;Gerber-Shiu&#39044;&#26399;&#25240;&#25187;&#32602;&#20989;&#25968;&#30340;&#20989;&#25968;&#65292;&#29992;&#20110;&#20998;&#26512;&#23478;&#24237;&#36164;&#26412;&#38519;&#20837;&#36139;&#22256;&#38519;&#38449;&#26102;&#30340;&#29305;&#24449;&#65292;&#24182;&#33719;&#24471;&#20102;&#19968;&#20123;&#32463;&#20856;&#39118;&#38505;&#29702;&#35770;&#20013;&#36890;&#24120;&#30740;&#31350;&#30340;&#37327;&#30340;&#38381;&#21512;&#24418;&#24335;&#34920;&#36798;&#24335;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#36825;&#31687;&#25991;&#31456;&#20013;&#65292;&#25105;&#20204;&#32771;&#34385;&#20102;&#19968;&#20010;&#20855;&#26377;&#30830;&#23450;&#24615;&#22686;&#38271;&#21644;&#25353;&#27604;&#20363;&#25439;&#22833;&#30340;&#39118;&#38505;&#36807;&#31243;&#65292;&#20197;&#27169;&#25311;&#19968;&#20010;&#23478;&#24237;&#30340;&#36164;&#26412;&#12290;&#25105;&#20204;&#30340;&#24037;&#20316;&#38598;&#20013;&#22312;&#20998;&#26512;&#36825;&#26679;&#19968;&#20010;&#36807;&#31243;&#30340;&#38519;&#38449;&#26102;&#38388;&#65292;&#24403;&#19968;&#20010;&#23478;&#24237;&#30340;&#36164;&#26412;&#27700;&#24179;&#38519;&#20837;&#36139;&#22256;&#21306;&#22495;&#26102;&#23601;&#20250;&#21457;&#29983;&#38519;&#38449;&#65292;&#36825;&#26159;&#19968;&#20010;&#24456;&#38590;&#22312;&#27809;&#26377;&#22806;&#37096;&#24110;&#21161;&#30340;&#24773;&#20917;&#19979;&#25670;&#33073;&#30340;&#21306;&#22495;&#12290;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#20010;&#31867;&#20284;&#20110;&#32463;&#20856;&#30340;Gerber-Shiu&#39044;&#26399;&#25240;&#25187;&#32602;&#20989;&#25968;&#30340;&#20989;&#25968;&#65292;&#23427;&#21253;&#21547;&#20102;&#20851;&#20110;&#38519;&#38449;&#26102;&#38388;&#12289;&#38519;&#20837;&#38519;&#38449;&#21069;&#31435;&#21363;&#21097;&#20313;&#36164;&#26412;&#21644;&#38519;&#38449;&#26102;&#30340;&#36164;&#26412;&#36196;&#23383;&#30340;&#20449;&#24687;&#12290;&#37492;&#20110;&#22312;&#32463;&#21382;&#36164;&#26412;&#25439;&#22833;&#26102;&#30340;&#21097;&#20313;&#36164;&#26412;&#27604;&#20363;&#20026;$Beta(\alpha,1)$&#20998;&#24067;&#65292;&#25105;&#20204;&#24471;&#21040;&#20102;&#32463;&#20856;&#39118;&#38505;&#29702;&#35770;&#20013;&#36890;&#24120;&#30740;&#31350;&#30340;&#37327;&#30340;&#38381;&#21512;&#24418;&#24335;&#34920;&#36798;&#24335;&#65292;&#21253;&#25324;&#38519;&#38449;&#26102;&#38388;&#30340;&#25289;&#26222;&#25289;&#26031;&#21464;&#25442;&#21644;&#38519;&#38449;&#26102;&#30340;&#36164;&#26412;&#36196;&#23383;&#30340;&#20998;&#24067;&#12290;&#29305;&#21035;&#22320;&#65292;&#25105;&#20204;&#24471;&#21040;&#20102;&#19968;&#20010;&#27169;&#22411;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.11715v1 Announce Type: new  Abstract: In this article, we consider a risk process with deterministic growth and prorated losses to model the capital of a household. Our work focuses on the analysis of the trapping time of such a process, where trapping occurs when a household's capital level falls into the poverty area, a region from which it is difficult to escape without external help. A function analogous to the classical Gerber-Shiu expected discounted penalty function is introduced, which incorporates information on the trapping time, the capital surplus immediately before trapping and the capital deficit at trapping. Given that the remaining proportion of capital upon experiencing a capital loss is $Beta(\alpha,1)-$distributed, closed-form expressions are obtained for quantities typically studied in classical risk theory, including the Laplace transform of the trapping time and the distribution of the capital deficit at trapping. In particular, we derive a model belong
&lt;/p&gt;</description></item><item><title>&#26377;&#21521;&#26080;&#29615;&#22270;&#65288;DAGs&#65289;&#30340;&#36816;&#29992;&#21487;&#20197;&#24110;&#21161;&#30740;&#31350;&#20154;&#21592;&#36827;&#34892;&#23454;&#35777;&#30740;&#31350;&#65292;&#35780;&#20272;&#35777;&#25454;&#36136;&#37327;&#65292;&#36991;&#20813;&#36807;&#20998;&#20381;&#36182;&#30740;&#31350;&#27169;&#26495;&#12290;</title><link>https://arxiv.org/abs/2402.11659</link><description>&lt;p&gt;
&#36229;&#36234;&#29609;&#20855;&#27169;&#22411;&#30340;&#21487;&#20449;&#22240;&#26524;&#25512;&#26029;
&lt;/p&gt;
&lt;p&gt;
Credible causal inference beyond toy models
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.11659
&lt;/p&gt;
&lt;p&gt;
&#26377;&#21521;&#26080;&#29615;&#22270;&#65288;DAGs&#65289;&#30340;&#36816;&#29992;&#21487;&#20197;&#24110;&#21161;&#30740;&#31350;&#20154;&#21592;&#36827;&#34892;&#23454;&#35777;&#30740;&#31350;&#65292;&#35780;&#20272;&#35777;&#25454;&#36136;&#37327;&#65292;&#36991;&#20813;&#36807;&#20998;&#20381;&#36182;&#30740;&#31350;&#27169;&#26495;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20351;&#29992;&#35266;&#27979;&#25968;&#25454;&#36827;&#34892;&#22240;&#26524;&#25512;&#26029;&#20851;&#38190;&#22312;&#20110;&#19981;&#21487;&#26816;&#39564;&#21644;&#39069;&#22806;&#30340;&#32479;&#35745;&#21069;&#25552;&#65292;&#36825;&#20123;&#21069;&#25552;&#26377;&#26102;&#20855;&#26377;&#21487;&#26816;&#39564;&#30340;&#21547;&#20041;&#12290;&#36275;&#20197;&#35777;&#26126;&#26576;&#20123;&#20272;&#35745;&#37327;&#30340;&#22240;&#26524;&#35299;&#37322;&#30340;&#24050;&#30693;&#21069;&#25552;&#38598;&#31216;&#20026;&#35782;&#21035;&#31574;&#30053;&#12290;&#28982;&#32780;&#65292;&#36825;&#20123;&#22240;&#26524;&#20998;&#26512;&#30340;&#27169;&#26495;&#19981;&#33021;&#23436;&#20840;&#26144;&#23556;&#21040;&#23454;&#35777;&#30740;&#31350;&#23454;&#36341;&#20013;&#12290;&#22312;&#36825;&#31687;&#25991;&#31456;&#20013;&#65292;&#25105;&#23637;&#31034;&#20102;&#26377;&#21521;&#26080;&#29615;&#22270;&#65288;DAGs&#65289;&#22914;&#20309;&#24110;&#21161;&#30740;&#31350;&#20154;&#21592;&#36827;&#34892;&#23454;&#35777;&#30740;&#31350;&#65292;&#24182;&#35780;&#20272;&#35777;&#25454;&#36136;&#37327;&#65292;&#32780;&#19981;&#36807;&#20998;&#20381;&#36182;&#30740;&#31350;&#27169;&#26495;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.11659v1 Announce Type: cross  Abstract: Causal inference with observational data critically relies on untestable and extra-statistical assumptions that have (sometimes) testable implications. Well-known sets of assumptions that are sufficient to justify the causal interpretation of certain estimators are called identification strategies. These templates for causal analysis, however, do not perfectly map into empirical research practice. Researchers are often left in the disjunctive of either abstracting away from their particular setting to fit in the templates, risking erroneous inferences, or avoiding situations in which the templates cannot be applied, missing valuable opportunities for conducting empirical analysis. In this article, I show how directed acyclic graphs (DAGs) can help researchers to conduct empirical research and assess the quality of evidence without excessively relying on research templates. First, I offer a concise introduction to causal inference frame
&lt;/p&gt;</description></item><item><title>&#25552;&#20986;&#20102;&#19968;&#31181;&#21452;&#37325;&#31283;&#20581;&#30340;&#20272;&#35745;&#37327;&#26694;&#26550;&#65292;&#21487;&#20197;&#22312;&#29616;&#20195;&#25968;&#25454;&#20016;&#23500;&#30340;&#29615;&#22659;&#20013;&#20272;&#35745;&#23384;&#22312;&#26410;&#35266;&#23519;&#28151;&#26434;&#22240;&#32032;&#19979;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#65292;&#20855;&#26377;&#33391;&#22909;&#30340;&#26377;&#38480;&#26679;&#26412;&#21644;&#28176;&#36817;&#24615;&#36136;&#65292;&#24182;&#22312;&#21442;&#25968;&#36895;&#29575;&#19979;&#23558;&#20854;&#35823;&#24046;&#25910;&#25947;&#20026;&#38646;&#22343;&#20540;&#39640;&#26031;&#20998;&#24067;&#12290;</title><link>https://arxiv.org/abs/2402.11652</link><description>&lt;p&gt;
&#22240;&#26524;&#28508;&#22312;&#22240;&#23376;&#27169;&#22411;&#20013;&#30340;&#21452;&#37325;&#31283;&#20581;&#25512;&#26029;
&lt;/p&gt;
&lt;p&gt;
Doubly Robust Inference in Causal Latent Factor Models
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.11652
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#21452;&#37325;&#31283;&#20581;&#30340;&#20272;&#35745;&#37327;&#26694;&#26550;&#65292;&#21487;&#20197;&#22312;&#29616;&#20195;&#25968;&#25454;&#20016;&#23500;&#30340;&#29615;&#22659;&#20013;&#20272;&#35745;&#23384;&#22312;&#26410;&#35266;&#23519;&#28151;&#26434;&#22240;&#32032;&#19979;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#65292;&#20855;&#26377;&#33391;&#22909;&#30340;&#26377;&#38480;&#26679;&#26412;&#21644;&#28176;&#36817;&#24615;&#36136;&#65292;&#24182;&#22312;&#21442;&#25968;&#36895;&#29575;&#19979;&#23558;&#20854;&#35823;&#24046;&#25910;&#25947;&#20026;&#38646;&#22343;&#20540;&#39640;&#26031;&#20998;&#24067;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#22312;&#29616;&#20195;&#25968;&#25454;&#20016;&#23500;&#29615;&#22659;&#20013;&#20272;&#35745;&#23384;&#22312;&#26410;&#35266;&#23519;&#28151;&#26434;&#22240;&#32032;&#19979;&#30340;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#30340;&#26032;&#26694;&#26550;&#65292;&#35813;&#29615;&#22659;&#20855;&#26377;&#22823;&#37327;&#21333;&#20301;&#21644;&#32467;&#26524;&#12290;&#25152;&#25552;&#20986;&#30340;&#20272;&#35745;&#37327;&#26159;&#21452;&#37325;&#31283;&#20581;&#30340;&#65292;&#32467;&#21512;&#20102;&#32467;&#26524;&#22635;&#34917;&#12289;&#20498;&#25968;&#27010;&#29575;&#21152;&#26435;&#20197;&#21450;&#19968;&#31181;&#29992;&#20110;&#30697;&#38453;&#34917;&#20840;&#30340;&#26032;&#22411;&#20132;&#21449;&#37197;&#23545;&#31243;&#24207;&#12290;&#25105;&#20204;&#25512;&#23548;&#20102;&#26377;&#38480;&#26679;&#26412;&#21644;&#28176;&#36817;&#20445;&#35777;&#65292;&#24182;&#23637;&#31034;&#20102;&#26032;&#20272;&#35745;&#37327;&#30340;&#35823;&#24046;&#25910;&#25947;&#21040;&#21442;&#25968;&#36895;&#29575;&#19979;&#30340;&#38646;&#22343;&#20540;&#39640;&#26031;&#20998;&#24067;&#12290;&#27169;&#25311;&#32467;&#26524;&#23637;&#31034;&#20102;&#26412;&#25991;&#20998;&#26512;&#30340;&#20272;&#35745;&#37327;&#30340;&#24418;&#24335;&#29305;&#24615;&#30340;&#23454;&#38469;&#30456;&#20851;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.11652v1 Announce Type: cross  Abstract: This article introduces a new framework for estimating average treatment effects under unobserved confounding in modern data-rich environments featuring large numbers of units and outcomes. The proposed estimator is doubly robust, combining outcome imputation, inverse probability weighting, and a novel cross-fitting procedure for matrix completion. We derive finite-sample and asymptotic guarantees, and show that the error of the new estimator converges to a mean-zero Gaussian distribution at a parametric rate. Simulation results demonstrate the practical relevance of the formal properties of the estimators analyzed in this article.
&lt;/p&gt;</description></item><item><title>&#35780;&#20272;&#20302;&#30899;&#26053;&#28216;&#21457;&#23637;&#27700;&#24179;&#65292;&#20511;&#21161;&#40644;&#27827;&#27969;&#22495;&#26696;&#20363;&#65292;&#20174;&#30899;&#25490;&#25918;&#12289;&#32463;&#27982;&#24433;&#21709;&#21644;&#29983;&#20135;&#29575;&#19977;&#20010;&#26041;&#38754;&#36827;&#34892;&#32508;&#21512;&#20998;&#26512;&#12290;</title><link>https://arxiv.org/abs/2402.11579</link><description>&lt;p&gt;
&#20174;&#22810;&#26041;&#38754;&#20998;&#26512;&#35780;&#20272;&#20302;&#30899;&#26053;&#28216;&#21457;&#23637;&#65306;&#20197;&#20013;&#22269;&#40644;&#27827;&#27969;&#22495;&#20026;&#20363;
&lt;/p&gt;
&lt;p&gt;
Assessment of low-carbon tourism development from multi-aspect analysis: A case study of the Yellow River Basin, China
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.11579
&lt;/p&gt;
&lt;p&gt;
&#35780;&#20272;&#20302;&#30899;&#26053;&#28216;&#21457;&#23637;&#27700;&#24179;&#65292;&#20511;&#21161;&#40644;&#27827;&#27969;&#22495;&#26696;&#20363;&#65292;&#20174;&#30899;&#25490;&#25918;&#12289;&#32463;&#27982;&#24433;&#21709;&#21644;&#29983;&#20135;&#29575;&#19977;&#20010;&#26041;&#38754;&#36827;&#34892;&#32508;&#21512;&#20998;&#26512;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#27668;&#20505;&#21464;&#21270;&#24050;&#25104;&#20026;&#23454;&#29616;&#21487;&#25345;&#32493;&#21457;&#23637;&#26080;&#27861;&#22238;&#36991;&#30340;&#38382;&#39064;&#12290;&#20316;&#20026;&#20840;&#29699;&#20027;&#35201;&#20135;&#19994;&#20043;&#19968;&#65292;&#26053;&#28216;&#19994;&#21487;&#20197;&#22312;&#20943;&#32531;&#27668;&#20505;&#21464;&#21270;&#26041;&#38754;&#21457;&#25381;&#37325;&#35201;&#20316;&#29992;&#12290;&#26412;&#25991;&#30340;&#20027;&#35201;&#30446;&#26631;&#26159;&#20197;&#40644;&#27827;&#27969;&#22495;&#20026;&#20363;&#65292;&#20174;&#22810;&#20010;&#26041;&#38754;&#35780;&#20272;&#20302;&#30899;&#26053;&#28216;&#21457;&#23637;&#27700;&#24179;&#12290;&#39318;&#20808;&#65292;&#35813;&#30740;&#31350;&#37327;&#21270;&#20102;&#26053;&#28216;&#19994;&#20108;&#27687;&#21270;&#30899;&#25490;&#25918;&#21644;&#26053;&#28216;&#32463;&#27982;&#65292;&#24182;&#20998;&#26512;&#20102;&#23427;&#20204;&#30340;&#28436;&#21464;&#29305;&#24449;&#12290;&#28982;&#21518;&#65292;&#20351;&#29992;&#25913;&#36827;&#30340;&#32806;&#21512;&#21327;&#35843;&#24230;&#27169;&#22411;&#20998;&#26512;&#20102;&#26053;&#28216;&#19994;&#20108;&#27687;&#21270;&#30899;&#25490;&#25918;&#21644;&#26053;&#28216;&#32463;&#27982;&#20043;&#38388;&#30340;&#20114;&#21160;&#21644;&#21327;&#35843;&#31243;&#24230;&#12290;&#26368;&#21518;&#65292;&#36890;&#36807;&#35745;&#31639;Malmquist-Luenberger&#29983;&#20135;&#29575;&#25351;&#25968;&#65292;&#20998;&#26512;&#20102;&#20302;&#30899;&#26053;&#28216;&#30340;&#24635;&#35201;&#32032;&#29983;&#20135;&#29575;&#21464;&#21270;&#12290;&#32467;&#26524;&#26174;&#31034;&#65306;&#65288;1&#65289;&#40644;&#27827;&#27969;&#22495;&#30340;&#26053;&#28216;&#19994;&#20855;&#26377;&#21021;&#22987;&#29615;&#22659;&#24211;&#20857;&#28037;&#33576;&#26354;&#32447;&#30340;&#29305;&#24449;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.11579v1 Announce Type: new  Abstract: Climate change has become an unavoidable problem in achieving sustainable development. As one of the major industries worldwide, tourism can make a significant contribution to mitigating climate change. The main objective of the paper is to assess the development level of low-carbon tourism from multi-aspect, using the Yellow River Basin as an example. Firstly, this study quantified tourism carbon dioxide emissions and tourism economy, and analyzed their evolution characteristics. The interaction and coordination degree between tourism carbon dioxide emissions and tourism economy were then analyzed using the improved coupling coordination degree model. Finally, this study analyzed the change in total factor productivity of low-carbon tourism by calculating the Malmquist-Luenberger productivity index. The results showed that: (1) The tourism industry in the Yellow River Basin has the characteristics of the initial environmental Kuznets cu
&lt;/p&gt;</description></item><item><title>&#36825;&#37324;&#26159;&#20013;&#25991;&#24635;&#32467;&#20986;&#30340;&#19968;&#21477;&#35805;&#35201;&#28857;&#65306;&#30740;&#31350;&#20102;&#32593;&#32476;&#28216;&#25103;&#20013;&#30340;&#21152;&#26435;Myerson&#20540;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#27867;&#21270;&#32593;&#32476;&#28216;&#25103;Myerson&#20540;&#30340;&#20998;&#37197;&#35268;&#21017;&#65292;&#24182;&#35777;&#26126;&#20102;&#23427;&#22312;&#38750;&#21512;&#20316;&#26694;&#26550;&#19979;&#26159;&#27425;&#21338;&#24328;&#23436;&#32654;&#32435;&#20160;&#22343;&#34913;&#12290;</title><link>https://arxiv.org/abs/2402.11464</link><description>&lt;p&gt;
&#32593;&#32476;&#28216;&#25103;&#20013;&#30340;&#21152;&#26435;Myerson&#20540;
&lt;/p&gt;
&lt;p&gt;
Weighted Myerson value for Network games
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.11464
&lt;/p&gt;
&lt;p&gt;
&#36825;&#37324;&#26159;&#20013;&#25991;&#24635;&#32467;&#20986;&#30340;&#19968;&#21477;&#35805;&#35201;&#28857;&#65306;&#30740;&#31350;&#20102;&#32593;&#32476;&#28216;&#25103;&#20013;&#30340;&#21152;&#26435;Myerson&#20540;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#27867;&#21270;&#32593;&#32476;&#28216;&#25103;Myerson&#20540;&#30340;&#20998;&#37197;&#35268;&#21017;&#65292;&#24182;&#35777;&#26126;&#20102;&#23427;&#22312;&#38750;&#21512;&#20316;&#26694;&#26550;&#19979;&#26159;&#27425;&#21338;&#24328;&#23436;&#32654;&#32435;&#20160;&#22343;&#34913;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#32593;&#32476;&#28216;&#25103;&#20013;&#30340;&#21152;&#26435;Myerson&#20540;&#65292;&#25193;&#23637;&#20102;&#31867;&#20284;&#27010;&#24565;&#29992;&#20110;&#36890;&#20449;&#24773;&#22659;&#12290;&#32593;&#32476;&#28216;&#25103;&#19982;&#36890;&#20449;&#24773;&#22659;&#19981;&#21516;&#65292;&#23558;&#29609;&#23478;&#20043;&#38388;&#30340;&#30452;&#25509;&#21644;&#38388;&#25509;&#36830;&#32467;&#21306;&#20998;&#23545;&#24453;&#65292;&#24182;&#22312;&#20215;&#20540;&#29983;&#25104;&#21644;&#20998;&#37197;&#36807;&#31243;&#20013;&#21306;&#20998;&#23427;&#20204;&#30340;&#24433;&#21709;&#12290;&#21152;&#26435;Myerson&#20540;&#26159;&#32593;&#32476;&#28216;&#25103;&#30340;&#19968;&#20010;&#20998;&#37197;&#35268;&#21017;&#65292;&#23427;&#27867;&#21270;&#20102;&#32593;&#32476;&#28216;&#25103;&#30340;Myerson&#20540;&#12290;&#22312;&#36825;&#37324;&#65292;&#20551;&#35774;&#29609;&#23478;&#20855;&#26377;&#19968;&#23450;&#26435;&#37325;&#65292;&#29992;&#26469;&#34913;&#37327;&#20182;&#20204;&#19982;&#20854;&#20182;&#29609;&#23478;&#24418;&#25104;&#36830;&#32467;&#30340;&#33021;&#21147;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#21152;&#26435;Myerson&#20540;&#30340;&#20004;&#31181;&#34920;&#24449;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#20986;&#20215;&#26426;&#21046;&#65292;&#35777;&#26126;&#20102;&#22312;&#38750;&#21512;&#20316;&#26694;&#26550;&#19979;&#65292;&#21152;&#26435;Myerson&#20540;&#26159;&#19968;&#20010;&#27425;&#21338;&#24328;&#23436;&#32654;&#32435;&#20160;&#22343;&#34913;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.11464v1 Announce Type: new  Abstract: We study the weighted Myerson value for Network games extending a similar concept for communication situations. Network games, unlike communication situations, treat direct and indirect links among players differently and distinguish their effects in both worth generation and allocation processes. The weighted Myerson value is an allocation rule for Network games that generalizes the Myerson value of Network games. Here, the players are assumed to have some weights measuring their capacity to form links with other players. Two characterization of the weighted Myerson value are provided. Finally, we propose a bidding mechanism to show that the weighted Myerson value is a subgame-perfect Nash equilibrium under a non-cooperative framework.
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#35745;&#31639;&#20998;&#37197;&#21338;&#24328;&#30340;&#26356;&#21152;&#20844;&#24179;&#26680;&#20998;&#37197;&#30340;&#32452;&#21512;&#22810;&#39033;&#24335;&#26102;&#38388;&#26426;&#21046;&#12290;</title><link>https://arxiv.org/abs/2402.11437</link><description>&lt;p&gt;
&#12298;&#20998;&#37197;&#21338;&#24328;&#65306;&#20844;&#24179;&#26680;&#20998;&#37197;&#30340;&#26032;&#26426;&#21046;&#12299;
&lt;/p&gt;
&lt;p&gt;
The Assignment Game: New Mechanisms for Equitable Core Imputations
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.11437
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#35745;&#31639;&#20998;&#37197;&#21338;&#24328;&#30340;&#26356;&#21152;&#20844;&#24179;&#26680;&#20998;&#37197;&#30340;&#32452;&#21512;&#22810;&#39033;&#24335;&#26102;&#38388;&#26426;&#21046;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#12298;&#20998;&#37197;&#21338;&#24328;&#12299;&#30340;&#26680;&#20998;&#37197;&#38598;&#24418;&#25104;&#19968;&#20010;&#65288;&#38750;&#26377;&#38480;&#65289;&#20998;&#37197;&#26684;&#12290;&#36804;&#20170;&#20026;&#27490;&#65292;&#20165;&#24050;&#30693;&#26377;&#25928;&#31639;&#27861;&#29992;&#20110;&#35745;&#31639;&#20854;&#20004;&#20010;&#26497;&#31471;&#20998;&#37197;&#65307;&#20294;&#26159;&#65292;&#20854;&#20013;&#27599;&#19968;&#20010;&#37117;&#26368;&#22823;&#31243;&#24230;&#22320;&#20559;&#34962;&#19968;&#20010;&#26041;&#65292;&#19981;&#21033;&#20110;&#21452;&#26041;&#30340;&#20998;&#37197;&#65292;&#23548;&#33268;&#30408;&#21033;&#19981;&#22343;&#34913;&#12290;&#21478;&#19968;&#20010;&#38382;&#39064;&#26159;&#65292;&#30001;&#19968;&#20010;&#29609;&#23478;&#32452;&#25104;&#30340;&#23376;&#32852;&#30431;&#65288;&#25110;&#32773;&#26469;&#33258;&#20998;&#37197;&#20004;&#20391;&#30340;&#19968;&#31995;&#29609;&#23478;&#65289;&#21487;&#20197;&#33719;&#24471;&#38646;&#21033;&#28070;&#65292;&#22240;&#27492;&#26680;&#20998;&#37197;&#19981;&#24517;&#32473;&#20104;&#20182;&#20204;&#20219;&#20309;&#21033;&#28070;&#12290;&#22240;&#27492;&#65292;&#26680;&#20998;&#37197;&#22312;&#20010;&#20307;&#20195;&#29702;&#20154;&#23618;&#38754;&#19978;&#19981;&#25552;&#20379;&#20219;&#20309;&#20844;&#24179;&#24615;&#20445;&#35777;&#12290;&#36825;&#24341;&#20986;&#19968;&#20010;&#38382;&#39064;&#65292;&#21363;&#22914;&#20309;&#35745;&#31639;&#26356;&#20844;&#24179;&#30340;&#26680;&#20998;&#37197;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#35745;&#31639;&#20998;&#37197;&#21338;&#24328;&#30340;Leximin&#21644;Leximax&#26680;&#20998;&#37197;&#30340;&#32452;&#21512;&#65288;&#21363;&#65292;&#35813;&#26426;&#21046;&#19981;&#28041;&#21450;LP&#27714;&#35299;&#22120;&#65289;&#22810;&#39033;&#24335;&#26102;&#38388;&#26426;&#21046;&#12290;&#36825;&#20123;&#20998;&#37197;&#20197;&#19981;&#21516;&#26041;&#24335;&#23454;&#29616;&#20102;&#8220;&#20844;&#24179;&#24615;&#8221;&#65306;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.11437v1 Announce Type: cross  Abstract: The set of core imputations of the assignment game forms a (non-finite) distributive lattice. So far, efficient algorithms were known for computing only its two extreme imputations; however, each of them maximally favors one side and disfavors the other side of the bipartition, leading to inequitable profit sharing. Another issue is that a sub-coalition consisting of one player (or a set of players from the same side of the bipartition) can make zero profit, therefore a core imputation is not obliged to give them any profit. Hence core imputations make no fairness guarantee at the level of individual agents. This raises the question of computing {\em more equitable core imputations}.   In this paper, we give combinatorial (i.e., the mechanism does not invoke an LP-solver) polynomial time mechanisms for computing the leximin and leximax core imputations for the assignment game. These imputations achieve ``fairness'' in different ways: w
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#38024;&#23545;&#19968;&#33324;&#28151;&#21512;&#38543;&#26426;&#36807;&#31243;&#30340;&#26679;&#26412;&#22343;&#20540;&#19978;&#30830;&#30028;&#30340;&#30028;&#38480;&#65292;&#19981;&#21463;&#28151;&#21512;&#36895;&#24230;&#30340;&#24433;&#21709;&#65292;&#24378;&#35843;&#20102;&#38598;&#20013;&#36895;&#29575;&#21644;&#22797;&#26434;&#24230;&#24230;&#37327;&#30340;&#37325;&#35201;&#24615;&#65292;&#24182;&#21457;&#29616;&#20102;&#28151;&#21512;&#36895;&#24230;&#23545;&#38598;&#20013;&#36895;&#29575;&#30340;&#24433;&#21709;&#65292;&#24341;&#20837;&#20102;&#30456;&#21464;&#30340;&#27010;&#24565;&#12290;</title><link>https://arxiv.org/abs/2402.11394</link><description>&lt;p&gt;
&#22522;&#20110;&#19968;&#33324;&#28151;&#21512;&#26465;&#20214;&#30340;&#32463;&#39564;&#36807;&#31243;&#30340;&#26497;&#20540;&#19981;&#31561;&#24335;&#21450;&#20854;&#22312;&#24378;&#36924;&#36817;&#20013;&#30340;&#24212;&#29992;
&lt;/p&gt;
&lt;p&gt;
Maximal Inequalities for Empirical Processes under General Mixing Conditions with an Application to Strong Approximations
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.11394
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#38024;&#23545;&#19968;&#33324;&#28151;&#21512;&#38543;&#26426;&#36807;&#31243;&#30340;&#26679;&#26412;&#22343;&#20540;&#19978;&#30830;&#30028;&#30340;&#30028;&#38480;&#65292;&#19981;&#21463;&#28151;&#21512;&#36895;&#24230;&#30340;&#24433;&#21709;&#65292;&#24378;&#35843;&#20102;&#38598;&#20013;&#36895;&#29575;&#21644;&#22797;&#26434;&#24230;&#24230;&#37327;&#30340;&#37325;&#35201;&#24615;&#65292;&#24182;&#21457;&#29616;&#20102;&#28151;&#21512;&#36895;&#24230;&#23545;&#38598;&#20013;&#36895;&#29575;&#30340;&#24433;&#21709;&#65292;&#24341;&#20837;&#20102;&#30456;&#21464;&#30340;&#27010;&#24565;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#38024;&#23545;&#20855;&#26377;&#20219;&#24847;&#28151;&#21512;&#29575;&#30340;&#19968;&#33324;&#28151;&#21512;&#38543;&#26426;&#36807;&#31243;&#25552;&#20379;&#20102;&#19968;&#20010;&#26679;&#26412;&#22343;&#20540;&#30340;&#19978;&#30830;&#30028;&#30340;&#30028;&#38480;&#12290;&#26080;&#35770;&#28151;&#21512;&#30340;&#36895;&#24230;&#22914;&#20309;&#65292;&#35813;&#30028;&#38480;&#30001;&#19968;&#20010;&#38598;&#20013;&#36895;&#29575;&#21644;&#19968;&#31181;&#26032;&#39062;&#30340;&#22797;&#26434;&#24230;&#24230;&#37327;&#32452;&#25104;&#12290;&#28982;&#32780;&#65292;&#28151;&#21512;&#30340;&#36895;&#24230;&#24433;&#21709;&#21069;&#32773;&#30340;&#25968;&#37327;&#65292;&#24847;&#21619;&#30528;&#20986;&#29616;&#20102;&#30456;&#21464;&#12290;&#24555;&#36895;&#28151;&#21512;&#23548;&#33268;&#26631;&#20934;&#30340;&#26681;&#21495;n&#38598;&#20013;&#36895;&#29575;&#65292;&#32780;&#24930;&#36895;&#28151;&#21512;&#23548;&#33268;&#36739;&#24930;&#30340;&#38598;&#20013;&#36895;&#29575;&#65292;&#20854;&#36895;&#24230;&#21462;&#20915;&#20110;&#28151;&#21512;&#32467;&#26500;&#12290;&#25105;&#20204;&#30340;&#21457;&#29616;&#24212;&#29992;&#20110;&#25512;&#23548;&#20855;&#26377;&#20219;&#24847;&#28151;&#21512;&#29575;&#30340;&#19968;&#33324;&#28151;&#21512;&#36807;&#31243;&#30340;&#24378;&#36924;&#36817;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.11394v1 Announce Type: cross  Abstract: This paper provides a bound for the supremum of sample averages over a class of functions for a general class of mixing stochastic processes with arbitrary mixing rates. Regardless of the speed of mixing, the bound is comprised of a concentration rate and a novel measure of complexity. The speed of mixing, however, affects the former quantity implying a phase transition. Fast mixing leads to the standard root-n concentration rate, while slow mixing leads to a slower concentration rate, its speed depends on the mixing structure. Our findings are applied to derive strong approximation results for a general class of mixing processes with arbitrary mixing rates.
&lt;/p&gt;</description></item><item><title>&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#24494;&#35266;&#25968;&#25454;&#20272;&#35745;&#24322;&#36136;&#20195;&#29702;&#21830;&#19994;&#21608;&#26399;&#27169;&#22411;&#30340;&#38388;&#25509;&#25512;&#26029;&#31574;&#30053;&#65292;&#36890;&#36807;&#19968;&#38454;&#21521;&#37327;&#33258;&#22238;&#24402;&#24555;&#36895;&#12289;&#31616;&#21333;&#12289;&#31283;&#20581;&#22320;&#35745;&#31639;&#36817;&#20284;&#20284;&#28982;&#65292;&#21487;&#36731;&#26494;&#19982;&#26631;&#20934;&#26041;&#27861;&#37197;&#23545;&#65292;&#24378;&#35843;&#20102;&#25972;&#20010;&#24494;&#35266;&#23618;&#32423;&#20998;&#24067;&#20013;&#21253;&#21547;&#30340;&#37325;&#35201;&#20449;&#24687;&#12290;</title><link>https://arxiv.org/abs/2402.11379</link><description>&lt;p&gt;
&#29992;&#24494;&#35266;&#25968;&#25454;&#20272;&#35745;HANK&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
Estimating HANK with Micro Data
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.11379
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#24494;&#35266;&#25968;&#25454;&#20272;&#35745;&#24322;&#36136;&#20195;&#29702;&#21830;&#19994;&#21608;&#26399;&#27169;&#22411;&#30340;&#38388;&#25509;&#25512;&#26029;&#31574;&#30053;&#65292;&#36890;&#36807;&#19968;&#38454;&#21521;&#37327;&#33258;&#22238;&#24402;&#24555;&#36895;&#12289;&#31616;&#21333;&#12289;&#31283;&#20581;&#22320;&#35745;&#31639;&#36817;&#20284;&#20284;&#28982;&#65292;&#21487;&#36731;&#26494;&#19982;&#26631;&#20934;&#26041;&#27861;&#37197;&#23545;&#65292;&#24378;&#35843;&#20102;&#25972;&#20010;&#24494;&#35266;&#23618;&#32423;&#20998;&#24067;&#20013;&#21253;&#21547;&#30340;&#37325;&#35201;&#20449;&#24687;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#21033;&#29992;&#38388;&#25509;&#25512;&#26029;&#31574;&#30053;&#26469;&#20272;&#35745;&#20855;&#26377;&#24494;&#35266;&#25968;&#25454;&#30340;&#24322;&#36136;&#20195;&#29702;&#21830;&#19994;&#21608;&#26399;&#27169;&#22411;&#12290;&#20854;&#26680;&#24515;&#26159;&#19968;&#20010;&#19968;&#38454;&#21521;&#37327;&#33258;&#22238;&#24402;&#65292;&#23427;&#22522;&#20110;&#32447;&#24615;&#28388;&#27874;&#29702;&#35770;&#65292;&#22312;&#25130;&#38754;&#19981;&#26029;&#22686;&#22823;&#26102;&#25104;&#31435;&#12290;&#32467;&#26524;&#26159;&#19968;&#31181;&#24555;&#36895;&#12289;&#31616;&#21333;&#21644;&#31283;&#20581;&#30340;&#31639;&#27861;&#65292;&#21487;&#20197;&#36731;&#26494;&#22320;&#19982;&#26631;&#20934;&#30340;&#32463;&#20856;&#25110;&#36125;&#21494;&#26031;&#26041;&#27861;&#37197;&#23545;&#12290;&#37325;&#35201;&#30340;&#26159;&#65292;&#25105;&#20204;&#30340;&#26041;&#27861;&#19982;&#27969;&#34892;&#30340;&#24207;&#21015;&#31354;&#38388;&#35299;&#27861;&#26041;&#27861;&#20860;&#23481;&#65292;&#19981;&#21516;&#20110;&#29616;&#26377;&#30340;&#26368;&#20808;&#36827;&#26041;&#27861;&#12290;&#25105;&#20204;&#36890;&#36807;&#20272;&#35745;&#20855;&#26377;&#27719;&#24635;&#21644;&#25130;&#38754;&#20914;&#20987;&#30340;&#32463;&#20856;HANK&#27169;&#22411;&#26469;&#27979;&#35797;&#25105;&#20204;&#30340;&#26041;&#27861;&#12290;&#20223;&#30495;&#32467;&#26524;&#19981;&#20165;&#35777;&#26126;&#20102;&#25105;&#20204;&#26041;&#27861;&#30340;&#21560;&#24341;&#21147;&#65292;&#20063;&#24378;&#35843;&#20102;&#25972;&#20010;&#24494;&#35266;&#23618;&#32423;&#20998;&#24067;&#20013;&#21253;&#21547;&#30340;&#37325;&#35201;&#20449;&#24687;&#65292;&#36828;&#36828;&#36229;&#20986;&#31616;&#21333;&#26102;&#21051;&#30340;&#33539;&#22260;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.11379v1 Announce Type: new  Abstract: We propose an indirect inference strategy for estimating heterogeneous-agent business cycle models with micro data. At its heart is a first-order vector autoregression that is grounded in linear filtering theory as the cross-section grows large. The result is a fast, simple and robust algorithm for computing an approximate likelihood that can be easily paired with standard classical or Bayesian methods. Importantly, our method is compatible with the popular sequence-space solution method, unlike existing state-of-the-art approaches. We test-drive our method by estimating a canonical HANK model with shocks in both the aggregate and cross-section. Not only do simulation results demonstrate the appeal of our method, they also emphasize the important information contained in the entire micro-level distribution over and above simple moments.
&lt;/p&gt;</description></item><item><title>&#22522;&#20110;&#24615;&#33021;&#30340;&#23548;&#33322;&#25216;&#26415;&#22312;&#24052;&#35199;&#39134;&#34892;&#20013;&#36215;&#21040;&#20102;&#31215;&#26497;&#20316;&#29992;&#65292;&#32422;&#21487;&#23558;&#39134;&#34892;&#26102;&#38388;&#32553;&#30701;1-2%&#12290;</title><link>https://arxiv.org/abs/2402.11374</link><description>&lt;p&gt;
&#33322;&#31354;&#36816;&#36755;&#20013;&#22522;&#20110;&#24615;&#33021;&#30340;&#23548;&#33322;&#23545;&#39134;&#34892;&#26102;&#38388;&#30340;&#24433;&#21709;
&lt;/p&gt;
&lt;p&gt;
Impactos da Navega\c{c}\~ao Baseada em Performance nos Tempos de Voo da Avia\c{c}\~ao Comercial
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.11374
&lt;/p&gt;
&lt;p&gt;
&#22522;&#20110;&#24615;&#33021;&#30340;&#23548;&#33322;&#25216;&#26415;&#22312;&#24052;&#35199;&#39134;&#34892;&#20013;&#36215;&#21040;&#20102;&#31215;&#26497;&#20316;&#29992;&#65292;&#32422;&#21487;&#23558;&#39134;&#34892;&#26102;&#38388;&#32553;&#30701;1-2%&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#30740;&#31350;&#20998;&#26512;&#20102;&#24433;&#21709;&#24052;&#35199;&#39134;&#34892;&#26102;&#38388;&#30340;&#22240;&#32032;&#65292;&#29305;&#21035;&#20851;&#27880;&#26032;&#25216;&#26415;&#23454;&#26045;&#30340;&#24433;&#21709;&#65292;&#29305;&#21035;&#26159;&#22522;&#20110;&#24615;&#33021;&#30340;&#23548;&#33322;&#65288;PBN&#65289;&#12290;PBN&#31243;&#24207;&#22987;&#20110;2009&#24180;&#22312;&#24052;&#35199;&#39046;&#31354;&#23454;&#26045;&#65292;&#20195;&#34920;&#20102;&#19968;&#31181;&#21033;&#29992;&#21355;&#26143;&#21019;&#24314;3D&#39134;&#34892;&#36335;&#32447;&#30340;&#26032;&#22411;&#33322;&#31354;&#23548;&#33322;&#27010;&#24565;&#65292;&#20351;&#39134;&#34892;&#36317;&#31163;&#26356;&#30701;&#26356;&#31934;&#30830;&#65292;&#28508;&#22312;&#22320;&#20943;&#23569;&#20102;&#39134;&#34892;&#26102;&#38388;&#21644;&#24310;&#35823;&#12290;&#39134;&#34892;&#26102;&#38388;&#21462;&#20915;&#20110;&#21508;&#31181;&#22240;&#32032;&#65292;&#22914;&#36215;&#39134;&#21644;&#30446;&#30340;&#22320;&#26426;&#22330;&#30340;&#22823;&#23567;&#21644;&#22797;&#26434;&#24230;&#65292;&#22825;&#27668;&#26465;&#20214;&#65292;&#39134;&#26426;&#22411;&#21495;&#20197;&#21450;&#33322;&#29677;&#30340;&#28385;&#36733;&#24773;&#20917;&#12290;&#22240;&#27492;&#65292;&#20026;&#20102;&#35780;&#20272;&#26032;&#31243;&#24207;&#30340;&#24433;&#21709;&#65292;&#24517;&#39035;&#32771;&#34385;&#36825;&#19968;&#31995;&#21015;&#22240;&#32032;&#30340;&#21464;&#21270;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.11374v1 Announce Type: new  Abstract: This work presents an analysis of recent literature examining factors that influence flight times in Brazil, with special attention to the impact of new technology implementations, specifically Performance-Based Navigation (PBN). PBN procedures began to be implemented in Brazilian airspace in 2009 and represent a new concept of air navigation, using satellites to create 3D flight routes that are shorter and more precise, potentially reducing the distances flown and consequently flight times and delays. Flight times depend on various factors, such as the size and complexity of the origin and destination airports, weather conditions, aircraft models, and how full the flights are. Therefore, to assess the impact of the new procedures, the variation in this set of factors must be taken into account. The results found in the literature suggest that Performance-Based Navigation had a positive impact, reducing flight times by about 1-2%, repres
&lt;/p&gt;</description></item><item><title>&#35813;&#30740;&#31350;&#36890;&#36807;&#32771;&#34385;&#26412;&#22320;&#21644;&#20840;&#29699;&#31454;&#20105;&#23545;&#24310;&#35823;&#30340;&#24433;&#21709;&#65292;&#25581;&#31034;&#20102;&#26426;&#22330;&#25317;&#25380;&#30340;&#8220;&#22806;&#37096;&#24615;&#20869;&#37096;&#21270;&#8221;&#29616;&#35937;&#21644;&#33322;&#32447;&#36136;&#37327;&#31454;&#20105;&#20043;&#38388;&#30340;&#20851;&#31995;&#65292;&#21516;&#26102;&#35752;&#35770;&#20102;&#24265;&#20215;&#33322;&#31354;&#20844;&#21496;&#36827;&#20837;&#23545;&#24052;&#35199;&#33322;&#31354;&#24066;&#22330;&#29616;&#26377;&#33322;&#31354;&#20844;&#21496;&#24310;&#35823;&#36896;&#25104;&#30340;&#24433;&#21709;&#12290;</title><link>https://arxiv.org/abs/2402.11373</link><description>&lt;p&gt;
&#33322;&#29677;&#24310;&#35823;&#22312;&#26426;&#22330;&#21644;&#33322;&#32447;&#19978;&#30340;&#31454;&#20105;&#20915;&#23450;&#22240;&#32032;
&lt;/p&gt;
&lt;p&gt;
Determinantes concorrenciais dos atrasos dos voos no aeroporto e na rota
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.11373
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#36890;&#36807;&#32771;&#34385;&#26412;&#22320;&#21644;&#20840;&#29699;&#31454;&#20105;&#23545;&#24310;&#35823;&#30340;&#24433;&#21709;&#65292;&#25581;&#31034;&#20102;&#26426;&#22330;&#25317;&#25380;&#30340;&#8220;&#22806;&#37096;&#24615;&#20869;&#37096;&#21270;&#8221;&#29616;&#35937;&#21644;&#33322;&#32447;&#36136;&#37327;&#31454;&#20105;&#20043;&#38388;&#30340;&#20851;&#31995;&#65292;&#21516;&#26102;&#35752;&#35770;&#20102;&#24265;&#20215;&#33322;&#31354;&#20844;&#21496;&#36827;&#20837;&#23545;&#24052;&#35199;&#33322;&#31354;&#24066;&#22330;&#29616;&#26377;&#33322;&#31354;&#20844;&#21496;&#24310;&#35823;&#36896;&#25104;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#33322;&#29677;&#24310;&#35823;&#26159;&#29616;&#20195;&#20840;&#29699;&#33322;&#31354;&#19994;&#30340;&#29616;&#23454;&#12290;&#28982;&#32780;&#65292;&#25991;&#29486;&#20013;&#30340;&#30740;&#31350;&#24050;&#32463;&#20998;&#21035;&#35843;&#26597;&#20102;&#36215;&#22240;&#20110;&#26426;&#22330;&#21644;&#27839;&#36884;&#22240;&#32032;&#30340;&#24310;&#35823;&#30340;&#31454;&#20105;&#20915;&#23450;&#22240;&#32032;&#12290;&#26412;&#30740;&#31350;&#26088;&#22312;&#21576;&#29616;&#19968;&#39033;&#22269;&#23478;&#24615;&#30740;&#31350;&#65292;&#35813;&#30740;&#31350;&#37319;&#29992;&#20102;&#25991;&#29486;&#20013;&#30340;&#32479;&#19968;&#26041;&#27861;&#65292;&#32771;&#34385;&#20102;&#31454;&#20105;&#23545;&#24310;&#35823;&#30340;&#22320;&#26041;&#21644;&#20840;&#29699;&#25928;&#24212;&#12290;&#35813;&#20998;&#26512;&#32771;&#34385;&#20102;&#34987;&#31216;&#20026;&#26426;&#22330;&#25317;&#25380;&#30340;&#8220;&#22806;&#37096;&#24615;&#20869;&#37096;&#21270;&#8221;&#29616;&#35937;&#12290;&#27492;&#22806;&#65292;&#35770;&#25991;&#36824;&#35752;&#35770;&#20102;&#33322;&#32447;&#19978;&#36136;&#37327;&#21644;&#31454;&#20105;&#20043;&#38388;&#30340;&#20851;&#31995;&#65292;&#20197;&#21450;&#24265;&#20215;&#33322;&#31354;&#20844;&#21496;(LCC)&#36827;&#20837;&#24052;&#35199;&#33322;&#31354;&#24066;&#22330;&#23545;&#29616;&#26377;&#33322;&#31354;&#20844;&#21496;&#24310;&#35823;&#30340;&#24433;&#21709;&#12290;&#25991;&#29486;&#34920;&#26126;&#65292;&#22312;&#24052;&#35199;&#26426;&#22330;&#23384;&#22312;&#20869;&#37096;&#21270;&#25317;&#25380;&#30340;&#35777;&#25454;&#65292;&#19982;&#33322;&#32447;&#23618;&#38754;&#30340;&#36136;&#37327;&#31454;&#20105;&#24182;&#34892;&#12290;&#27492;&#22806;&#65292;&#30001;&#24265;&#20215;&#33322;&#31354;&#20844;&#21496;&#36827;&#20837;&#24341;&#36215;&#30340;&#28508;&#22312;&#31454;&#20105;&#20063;&#21487;&#33021;&#23548;&#33268;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.11373v1 Announce Type: new  Abstract: Flight delays are a reality in the modern air industry worldwide. However, studies in the literature have investigated the competitive determinants of delays arising from factors originating at the airport and along the route separately. This work aims to present a national study that used a unifying approach from the literature, considering the local and global effects of competition on delays. The analysis took into account a phenomenon known as the "internalization of externalities" of airport congestion. Furthermore, it discusses the relationship between quality and competition on the route and the impacts of the entry of a low-cost carrier (LCC) on the delays of incumbent airlines in the Brazilian air market. The literature suggests that there is evidence of congestion internalization at Brazilian airports, in parallel with competition for quality at the route level. Additionally, the potential competition caused by the presence of 
&lt;/p&gt;</description></item><item><title>&#35770;&#25991;&#35752;&#35770;&#20102;&#20302;&#25104;&#26412;&#33322;&#31354;&#23545;&#33322;&#31354;&#24066;&#22330;&#30340;&#24433;&#21709;&#65292;&#24182;&#24635;&#32467;&#20986;&#23545;&#31454;&#20105;&#23545;&#25163;&#12289;&#26426;&#22330;&#12289;&#33322;&#31354;&#38656;&#27714;&#12289;&#20056;&#23458;&#36873;&#25321;&#21644;&#22320;&#29702;&#21306;&#22495;&#30340;&#24433;&#21709;&#20998;&#31867;&#12290;</title><link>https://arxiv.org/abs/2402.11372</link><description>&lt;p&gt;
&#20302;&#25104;&#26412;&#33322;&#31354;&#65306;&#37325;&#35201;&#24615;&#21644;&#24433;&#21709;
&lt;/p&gt;
&lt;p&gt;
Low costs na avia\c{c}\~ao: import\^ancia e desdobramentos
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.11372
&lt;/p&gt;
&lt;p&gt;
&#35770;&#25991;&#35752;&#35770;&#20102;&#20302;&#25104;&#26412;&#33322;&#31354;&#23545;&#33322;&#31354;&#24066;&#22330;&#30340;&#24433;&#21709;&#65292;&#24182;&#24635;&#32467;&#20986;&#23545;&#31454;&#20105;&#23545;&#25163;&#12289;&#26426;&#22330;&#12289;&#33322;&#31354;&#38656;&#27714;&#12289;&#20056;&#23458;&#36873;&#25321;&#21644;&#22320;&#29702;&#21306;&#22495;&#30340;&#24433;&#21709;&#20998;&#31867;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#26088;&#22312;&#35752;&#35770;&#20302;&#25104;&#26412;&#33322;&#31354;&#23545;&#33322;&#31354;&#36816;&#36755;&#24066;&#22330;&#30340;&#24433;&#21709;&#65292;&#29305;&#21035;&#26159;&#20171;&#32461;&#39046;&#22495;&#20869;&#19987;&#19994;&#25991;&#29486;&#30340;&#26368;&#26032;&#30740;&#31350;&#25104;&#26524;&#12290;&#20026;&#27492;&#65292;&#36873;&#21462;&#24182;&#20998;&#26512;&#20102;&#33258;2015&#24180;&#20197;&#26469;&#21457;&#34920;&#30340;&#20851;&#20110;&#35813;&#20027;&#39064;&#30340;&#21508;&#31181;&#20316;&#21697;&#12290;&#36890;&#36807;&#36825;&#19968;&#20998;&#26512;&#65292;&#23558;&#35770;&#25991;&#20013;&#35752;&#35770;&#30340;&#20027;&#35201;&#35805;&#39064;&#24402;&#31867;&#20026;&#20116;&#20010;&#32452;&#21035;&#65306;(i) &#20302;&#25104;&#26412;&#33322;&#31354;&#23545;&#31454;&#20105;&#33322;&#31354;&#20844;&#21496;&#30340;&#24433;&#21709;&#65307;(ii) &#23545;&#26426;&#22330;&#30340;&#24433;&#21709;&#65307;(iii) &#23545;&#33322;&#31354;&#36816;&#36755;&#38656;&#27714;&#30340;&#24635;&#20307;&#24433;&#21709;&#65307;(iv) &#23545;&#20056;&#23458;&#36873;&#25321;&#36807;&#31243;&#30340;&#24433;&#21709;&#65307;&#20197;&#21450;(v) &#23545;&#22320;&#29702;&#21306;&#22495;&#30340;&#24635;&#20307;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.11372v1 Announce Type: new  Abstract: This study aims to discuss the impacts of a low-cost airline on the air transport market and, especially, to present the most recent findings from specialized literature in the field. To this end, various works on this topic, published since 2015, were selected and analyzed. From this analysis, it was possible to categorize the main topics discussed in the papers into five groups: (i) the impacts of a low-cost airline on competing airlines; (ii) impacts on airports; (iii) general impacts on the demand for air transport; (iv) effects on passengers' choice process; and (v) general effects on a geographical region.
&lt;/p&gt;</description></item><item><title>&#24052;&#35199;&#33322;&#31354;&#20844;&#21496;&#19994;&#21153;&#27169;&#24335;&#34701;&#21512;&#30740;&#31350;&#21457;&#29616;&#65292;&#22312;&#33322;&#31354;&#36816;&#36755;&#19994;&#21153;&#20013;&#23384;&#22312;&#20840;&#26041;&#20301;&#26381;&#21153;&#20844;&#21496;&#21644;&#32769;&#24335;&#20302;&#25104;&#26412;&#20844;&#21496;&#20043;&#38388;&#30340;&#32593;&#32476;&#24418;&#25104;&#31574;&#30053;&#25910;&#25947;&#65292;&#20197;&#21450;&#22312;&#21512;&#24182;&#25910;&#36141;&#21518;&#19994;&#21153;&#27169;&#24335;&#30340;&#35843;&#25972;&#12290;</title><link>https://arxiv.org/abs/2402.11371</link><description>&lt;p&gt;
&#33322;&#31354;&#20844;&#21496;&#37117;&#19968;&#26679;&#21527;&#65311;&#24052;&#35199;&#33322;&#31354;&#36816;&#36755;&#19994;&#21153;&#27169;&#24335;&#30340;&#34701;&#21512;
&lt;/p&gt;
&lt;p&gt;
Companhias a\'ereas s\~ao todas iguais? A converg\^encia dos modelos de neg\'ocios no transporte a\'ereo
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.11371
&lt;/p&gt;
&lt;p&gt;
&#24052;&#35199;&#33322;&#31354;&#20844;&#21496;&#19994;&#21153;&#27169;&#24335;&#34701;&#21512;&#30740;&#31350;&#21457;&#29616;&#65292;&#22312;&#33322;&#31354;&#36816;&#36755;&#19994;&#21153;&#20013;&#23384;&#22312;&#20840;&#26041;&#20301;&#26381;&#21153;&#20844;&#21496;&#21644;&#32769;&#24335;&#20302;&#25104;&#26412;&#20844;&#21496;&#20043;&#38388;&#30340;&#32593;&#32476;&#24418;&#25104;&#31574;&#30053;&#25910;&#25947;&#65292;&#20197;&#21450;&#22312;&#21512;&#24182;&#25910;&#36141;&#21518;&#19994;&#21153;&#27169;&#24335;&#30340;&#35843;&#25972;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;&#20851;&#20110;&#24052;&#35199;&#33322;&#31354;&#36816;&#36755;&#19994;&#33322;&#31354;&#20844;&#21496;&#19994;&#21153;&#27169;&#24335;&#34701;&#21512;&#30340;&#25991;&#29486;&#65292;&#37325;&#28857;&#20851;&#27880;&#33322;&#29677;&#32593;&#32476;&#30340;&#24418;&#25104;&#12290;&#39318;&#20808;&#65292;&#20998;&#26512;&#20102;&#22312;&#37096;&#38376;&#35299;&#38500;&#31649;&#21046;&#21518;&#30340;&#22836;&#20960;&#24180;&#20869;&#33322;&#31354;&#20844;&#21496;&#8220;&#22522;&#26412;&#8221;&#19994;&#21153;&#27169;&#24335;&#65288;&#20856;&#22411;&#65289;&#30340;&#32593;&#32476;&#24418;&#25104;&#27169;&#24335;&#30340;&#20915;&#23450;&#22240;&#32032;&#12290;&#28982;&#21518;&#65292;&#35752;&#35770;&#20102;&#24052;&#35199;&#20844;&#21496;&#30340;&#19994;&#21153;&#27169;&#24335;&#22914;&#20309;&#31867;&#20284;&#20110;&#36825;&#20123;&#27169;&#24335;&#12290;&#25991;&#29486;&#24378;&#35843;&#20102;&#20840;&#26041;&#20301;&#26381;&#21153;&#20844;&#21496;&#30340;&#32593;&#32476;&#24418;&#25104;&#25112;&#30053;&#19982;&#36739;&#32769;&#30340;&#20302;&#25104;&#26412;&#20844;&#21496;&#20043;&#38388;&#30340;&#25910;&#25947;&#65292;&#20197;&#21450;&#22312;&#21512;&#24182;&#21644;&#25910;&#36141;&#20043;&#21518;&#19994;&#21153;&#27169;&#24335;&#30340;&#37325;&#26032;&#23450;&#20301;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.11371v1 Announce Type: new  Abstract: This study discusses the literature on the convergence of business models of airlines in Brazilian air transport, focusing on the formation of flight networks. Initially, it analyzes the determinants of the network formation patterns of the "fundamental" business models (archetypes) of airlines in the first years after the sector's deregulation. Then, it discusses how the business models of Brazilian companies resemble these patterns. The literature highlights convergences between the network formation strategies of full-service companies in relation to older low-cost companies, in addition to business model redirections after mergers and acquisitions.
&lt;/p&gt;</description></item><item><title>&#30740;&#31350;&#21305;&#37197;&#38382;&#39064;&#20013;&#30340;&#31283;&#23450;&#33756;&#21333;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#20445;&#35777;&#23384;&#22312;&#31283;&#23450;&#35299;&#20915;&#26041;&#26696;&#30340;&#26465;&#20214;&#65292;&#23545;&#26080;&#31574;&#30053;&#24615;&#31283;&#23450;&#21305;&#37197;&#32473;&#20986;&#20102;&#31215;&#26497;&#21644;&#28040;&#26497;&#32467;&#26524;&#12290;</title><link>https://arxiv.org/abs/2402.11370</link><description>&lt;p&gt;
&#20844;&#20849;&#29289;&#21697;&#30340;&#31283;&#23450;&#33756;&#21333;: &#19968;&#20010;&#21305;&#37197;&#38382;&#39064;
&lt;/p&gt;
&lt;p&gt;
Stable Menus of Public Goods: A Matching Problem
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.11370
&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#21305;&#37197;&#38382;&#39064;&#20013;&#30340;&#31283;&#23450;&#33756;&#21333;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#20445;&#35777;&#23384;&#22312;&#31283;&#23450;&#35299;&#20915;&#26041;&#26696;&#30340;&#26465;&#20214;&#65292;&#23545;&#26080;&#31574;&#30053;&#24615;&#31283;&#23450;&#21305;&#37197;&#32473;&#20986;&#20102;&#31215;&#26497;&#21644;&#28040;&#26497;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#22312;&#27809;&#26377;&#36135;&#24065;&#36716;&#31227;&#30340;&#24773;&#22659;&#19979;&#65292;&#20195;&#29702;&#32773;&#21644;&#20844;&#20849;&#29289;&#21697;&#20043;&#38388;&#30340;&#21305;&#37197;&#38382;&#39064;&#12290;&#30001;&#20110;&#29289;&#21697;&#26159;&#20844;&#20849;&#30340;&#65292;&#23427;&#20204;&#27809;&#26377;&#23481;&#37327;&#38480;&#21046;&#12290;&#27809;&#26377;&#22806;&#29983;&#23450;&#20041;&#30340;&#25552;&#20379;&#29289;&#21697;&#30340;&#39044;&#31639;&#12290;&#30456;&#21453;&#65292;&#27599;&#20010;&#25552;&#20379;&#30340;&#29289;&#21697;&#24517;&#39035;&#35777;&#26126;&#20854;&#25104;&#26412;&#65292;&#23548;&#33268;&#22312;&#29289;&#21697;&#30340;&#8220;&#20559;&#22909;&#8221;&#20013;&#23384;&#22312;&#24456;&#24378;&#30340;&#20114;&#34917;&#24615;&#12290;&#27492;&#22806;&#65292;&#37492;&#20110;&#24050;&#25552;&#20379;&#30340;&#20854;&#20182;&#29289;&#21697;&#65292;&#37027;&#20123;&#38656;&#27714;&#37327;&#39640;&#30340;&#29289;&#21697;&#20063;&#24517;&#39035;&#24471;&#21040;&#25552;&#20379;&#12290;&#23384;&#22312;&#19968;&#20010;&#31283;&#23450;&#35299;&#20915;&#26041;&#26696;&#65288;&#25552;&#20379;&#30340;&#20844;&#20849;&#29289;&#21697;&#30340;&#33756;&#21333;&#65289;&#30340;&#38382;&#39064;&#23637;&#31034;&#20102;&#20016;&#23500;&#30340;&#32452;&#21512;&#32467;&#26500;&#12290;&#25105;&#20204;&#25581;&#31034;&#20102;&#20445;&#35777;&#23384;&#22312;&#31283;&#23450;&#35299;&#20915;&#26041;&#26696;&#30340;&#20805;&#20998;&#26465;&#20214;&#21644;&#24517;&#35201;&#26465;&#20214;&#65292;&#24182;&#20026;&#26080;&#31574;&#30053;&#24615;&#31283;&#23450;&#21305;&#37197;&#24471;&#20986;&#20102;&#31215;&#26497;&#21644;&#28040;&#26497;&#30340;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.11370v1 Announce Type: cross  Abstract: We study a matching problem between agents and public goods, in settings without monetary transfers. Since goods are public, they have no capacity constraints. There is no exogenously defined budget of goods to be provided. Rather, each provided good must justify its cost, leading to strong complementarities in the "preferences" of goods. Furthermore, goods that are in high demand given other already-provided goods must also be provided. The question of the existence of a stable solution (a menu of public goods to be provided) exhibits a rich combinatorial structure. We uncover sufficient conditions and necessary conditions for guaranteeing the existence of a stable solution, and derive both positive and negative results for strategyproof stable matching.
&lt;/p&gt;</description></item><item><title>&#30740;&#31350;&#20102;&#22312;&#23433;&#20840;&#28216;&#25103;&#20013;&#31616;&#21333;&#21270;&#25509;&#36817;&#26368;&#20248;&#35299;&#65292;&#35299;&#20915;&#20102;&#27450;&#35784;&#34892;&#20026;&#23545;&#29992;&#25143;&#21644;&#31649;&#29702;&#32773;&#21487;&#33021;&#36896;&#25104;&#30340;&#36127;&#38754;&#24433;&#21709;&#12290;</title><link>https://arxiv.org/abs/2402.11209</link><description>&lt;p&gt;
&#24403;&#31616;&#21333;&#21270;&#22312;&#23433;&#20840;&#28216;&#25103;&#20013;&#25509;&#36817;&#26368;&#20248;
&lt;/p&gt;
&lt;p&gt;
When Simple in Near-Optimal in Security Games
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.11209
&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#20102;&#22312;&#23433;&#20840;&#28216;&#25103;&#20013;&#31616;&#21333;&#21270;&#25509;&#36817;&#26368;&#20248;&#35299;&#65292;&#35299;&#20915;&#20102;&#27450;&#35784;&#34892;&#20026;&#23545;&#29992;&#25143;&#21644;&#31649;&#29702;&#32773;&#21487;&#33021;&#36896;&#25104;&#30340;&#36127;&#38754;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36328;&#24212;&#29992;&#31243;&#24207;&#20013;&#26222;&#36941;&#23384;&#22312;&#27450;&#35784;&#25110;&#38750;&#27861;&#27963;&#21160;&#65292;&#24182;&#28041;&#21450;&#29992;&#25143;&#32469;&#36807;&#27861;&#24459;&#65292;&#36890;&#24120;&#20197;&#33719;&#21462;&#19968;&#20123;&#22312;&#21512;&#27861;&#34892;&#20026;&#33539;&#22260;&#20869;&#26080;&#27861;&#33719;&#24471;&#30340;&#21033;&#30410;&#20026;&#25112;&#30053;&#30446;&#30340;&#12290;&#28982;&#32780;&#65292;&#29992;&#25143;&#27450;&#35784;&#20855;&#26377;&#36127;&#38754;&#24433;&#21709;&#65292;&#21487;&#33021;&#21361;&#23475;&#23433;&#20840;&#25110;&#23545;&#29305;&#23450;&#20154;&#32676;&#26045;&#21152;&#19981;&#25104;&#27604;&#20363;&#30340;&#36127;&#38754;&#22806;&#37096;&#24615;&#12290;&#20026;&#20943;&#36731;&#29992;&#25143;&#27450;&#35784;&#30340;&#28508;&#22312;&#21361;&#23475;&#65292;&#25105;&#20204;&#23558;&#27450;&#35784;&#34892;&#20026;&#30417;&#31649;&#38382;&#39064;&#35270;&#20026;&#31649;&#29702;&#21592;&#21644;&#29992;&#25143;&#20043;&#38388;&#30340;&#23433;&#20840;&#28216;&#25103;&#12290;&#22312;&#36825;&#20010;&#28216;&#25103;&#20013;&#65292;&#31649;&#29702;&#21592;&#36890;&#36807;$R$&#20010;&#23433;&#20840;&#36164;&#28304;&#65288;&#20363;&#22914;&#35686;&#23519;&#65289;&#22312;$L$&#20010;&#20301;&#32622;&#37096;&#32626;&#65292;&#24182;&#23545;&#22312;&#36825;&#20123;&#20301;&#32622;&#36827;&#34892;&#27450;&#35784;&#30340;&#29992;&#25143;&#24449;&#25910;&#32602;&#27454;&#12290;&#23545;&#20110;&#36825;&#20010;&#23433;&#20840;&#28216;&#25103;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#31649;&#29702;&#21592;&#30340;&#31119;&#21033;&#21644;&#25910;&#20837;&#26368;&#22823;&#21270;&#30446;&#26631;&#12290;&#22312;&#20004;&#31181;&#35774;&#32622;&#20013;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#35745;&#31639;&#26368;&#20248;&#31649;&#29702;&#21592;&#31574;&#30053;&#26159;NP&#38590;&#39064;&#65292;&#24182;&#20026;&#27492;&#24320;&#21457;&#20102;&#33258;&#28982;&#30340;&#36138;&#23146;&#31639;&#27861;&#21464;&#20307;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.11209v1 Announce Type: cross  Abstract: Fraudulent or illegal activities are ubiquitous across applications and involve users bypassing the rule of law, often with the strategic aim of obtaining some benefit that would otherwise be unattainable within the bounds of lawful conduct. However, user fraud is detrimental, as it may compromise safety or impose disproportionate negative externalities on particular population groups.   To mitigate the potential harms of user fraud, we study the problem of policing such fraud as a security game between an administrator and users. In this game, an administrator deploys $R$ security resources (e.g., police officers) across $L$ locations and levies fines against users engaging in fraud at those locations. For this security game, we study both welfare and revenue maximization administrator objectives. In both settings, we show that computing the optimal administrator strategy is NP-hard and develop natural greedy algorithm variants for th
&lt;/p&gt;</description></item><item><title>&#20998;&#26512;&#20102;&#20197;&#22826;&#22346;2.0&#20013;&#22870;&#21169;&#30340;&#21160;&#24577;&#21644;&#21435;&#20013;&#24515;&#21270;&#31243;&#24230;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#39640;&#32423;&#25968;&#25454;&#24037;&#31243;&#24037;&#20316;&#27969;&#21644;&#20840;&#38754;&#25968;&#25454;&#38598;&#65292;&#26377;&#21161;&#20110;&#26356;&#22909;&#22320;&#29702;&#35299;&#26435;&#30410;&#35777;&#26126;&#28608;&#21169;&#30340;&#22870;&#21169;&#20998;&#37197;&#21644;&#28436;&#21464;&#12290;</title><link>https://arxiv.org/abs/2402.11170</link><description>&lt;p&gt;
&#20998;&#26512;&#20197;&#22826;&#22346;2.0&#20013;&#22870;&#21169;&#21160;&#24577;&#21644;&#21435;&#20013;&#24515;&#21270;: &#19968;&#31181;&#39640;&#32423;&#25968;&#25454;&#24037;&#31243;&#24037;&#20316;&#27969;&#21644;&#20840;&#38754;&#25968;&#25454;&#38598;&#65292;&#29992;&#20110;&#26435;&#30410;&#35777;&#26126;&#28608;&#21169;
&lt;/p&gt;
&lt;p&gt;
Analyzing Reward Dynamics and Decentralization in Ethereum 2.0: An Advanced Data Engineering Workflow and Comprehensive Datasets for Proof-of-Stake Incentives
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.11170
&lt;/p&gt;
&lt;p&gt;
&#20998;&#26512;&#20102;&#20197;&#22826;&#22346;2.0&#20013;&#22870;&#21169;&#30340;&#21160;&#24577;&#21644;&#21435;&#20013;&#24515;&#21270;&#31243;&#24230;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#39640;&#32423;&#25968;&#25454;&#24037;&#31243;&#24037;&#20316;&#27969;&#21644;&#20840;&#38754;&#25968;&#25454;&#38598;&#65292;&#26377;&#21161;&#20110;&#26356;&#22909;&#22320;&#29702;&#35299;&#26435;&#30410;&#35777;&#26126;&#28608;&#21169;&#30340;&#22870;&#21169;&#20998;&#37197;&#21644;&#28436;&#21464;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20316;&#20026;&#21331;&#36234;&#30340;&#26234;&#33021;&#21512;&#32422;&#21306;&#22359;&#38142;&#24179;&#21488;&#65292;&#20197;&#22826;&#22346;2.0&#20445;&#35777;&#20102;&#24212;&#29992;&#30340;&#31934;&#30830;&#25191;&#34892;&#65292;&#26080;&#38656;&#31532;&#19977;&#26041;&#24178;&#39044;&#12290;&#26412;&#31995;&#32479;&#30340;&#26680;&#24515;&#26159;&#21033;&#29992;&#26435;&#30410;&#35777;&#26126;&#65288;PoS&#65289;&#20849;&#35782;&#26426;&#21046;&#65292;&#21033;&#29992;&#38543;&#26426;&#36807;&#31243;&#36873;&#25321;&#39564;&#35777;&#20154;&#21592;&#36827;&#34892;&#21306;&#22359;&#25552;&#35758;&#21644;&#39564;&#35777;&#65292;&#38543;&#21518;&#22870;&#21169;&#20182;&#20204;&#30340;&#36129;&#29486;&#12290;&#28982;&#32780;&#65292;&#21306;&#22359;&#38142;&#25216;&#26415;&#30340;&#23454;&#29616;&#32463;&#24120;&#20559;&#31163;&#20102;&#21435;&#20013;&#24515;&#21270;&#20849;&#35782;&#30340;&#26680;&#24515;&#21407;&#21017;&#65292;&#24102;&#26469;&#20102;&#37325;&#22823;&#30340;&#20998;&#26512;&#25361;&#25112;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#25910;&#38598;&#20102;&#20197;&#22826;&#22346;Beacon&#38142;&#30340;&#20849;&#35782;&#22870;&#21169;&#25968;&#25454;&#65292;&#24182;&#23545;&#22870;&#21169;&#20998;&#37197;&#21644;&#28436;&#21464;&#36827;&#34892;&#20102;&#20840;&#38754;&#20998;&#26512;&#65292;&#23558;&#20854;&#20998;&#31867;&#20026;&#35777;&#26126;&#12289;&#25552;&#35758;&#32773;&#21644;&#21516;&#27493;&#22996;&#21592;&#20250;&#22870;&#21169;&#12290;&#20026;&#35780;&#20272;&#20197;&#22826;&#22346;&#26435;&#30410;&#35777;&#26126;&#20013;&#30340;&#21435;&#20013;&#24515;&#21270;&#31243;&#24230;&#65292;&#25105;&#20204;&#24212;&#29992;&#20102;&#20960;&#31181;&#19981;&#24179;&#31561;&#25351;&#25968;&#65292;&#21253;&#25324;&#39321;&#20892;&#29109;&#12289;&#22522;&#23612;&#31995;&#25968;&#12289;&#20013;&#26412;&#32874;&#31995;&#25968;&#21644;&#36203;&#33452;&#36798;&#23572;&#25351;&#25968;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.11170v1 Announce Type: new  Abstract: Ethereum 2.0, as the preeminent smart contract blockchain platform, guarantees the precise execution of applications without third-party intervention. At its core, this system leverages the Proof-of-Stake (PoS) consensus mechanism, which utilizes a stochastic process to select validators for block proposal and validation, consequently rewarding them for their contributions. However, the implementation of blockchain technology often diverges from its central tenet of decentralized consensus, presenting significant analytical challenges. Our study collects consensus reward data from the Ethereum Beacon chain and conducts a comprehensive analysis of reward distribution and evolution, categorizing them into attestation, proposer and sync committee rewards. To evaluate the degree of decentralization in PoS Ethereum, we apply several inequality indices, including the Shannon entropy, the Gini Index, the Nakamoto Coefficient, and the Herfindahl
&lt;/p&gt;</description></item><item><title>&#26426;&#22120;&#23398;&#20064;&#31639;&#27861;&#26159;&#26631;&#20934;&#21270;&#30340;&#65292;&#35780;&#20272;&#25152;&#26377;&#20010;&#20307;&#26102;&#36890;&#36807;&#22266;&#23450;&#30340;&#20849;&#21464;&#37327;&#65292;&#32780;&#20154;&#31867;&#35780;&#20272;&#32773;&#36890;&#36807;&#23450;&#21046;&#20849;&#21464;&#37327;&#30340;&#33719;&#21462;&#23545;&#27599;&#20010;&#20010;&#20307;&#36827;&#34892;&#35780;&#20272;&#65292;&#25105;&#20204;&#23637;&#31034;&#22312;&#39640;&#32500;&#25968;&#25454;&#29615;&#22659;&#20013;&#65292;&#19978;&#19979;&#25991;&#30340;&#23450;&#21046;&#21270;&#20248;&#21183;&#12290;</title><link>https://arxiv.org/abs/2402.11157</link><description>&lt;p&gt;
&#19978;&#19979;&#25991;&#30340;&#20215;&#20540;&#65306;&#20154;&#31867;&#35780;&#20272;&#32773;&#19982;&#40657;&#21283;&#23376;&#35780;&#20272;&#32773;
&lt;/p&gt;
&lt;p&gt;
The Value of Context: Human versus Black Box Evaluators
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.11157
&lt;/p&gt;
&lt;p&gt;
&#26426;&#22120;&#23398;&#20064;&#31639;&#27861;&#26159;&#26631;&#20934;&#21270;&#30340;&#65292;&#35780;&#20272;&#25152;&#26377;&#20010;&#20307;&#26102;&#36890;&#36807;&#22266;&#23450;&#30340;&#20849;&#21464;&#37327;&#65292;&#32780;&#20154;&#31867;&#35780;&#20272;&#32773;&#36890;&#36807;&#23450;&#21046;&#20849;&#21464;&#37327;&#30340;&#33719;&#21462;&#23545;&#27599;&#20010;&#20010;&#20307;&#36827;&#34892;&#35780;&#20272;&#65292;&#25105;&#20204;&#23637;&#31034;&#22312;&#39640;&#32500;&#25968;&#25454;&#29615;&#22659;&#20013;&#65292;&#19978;&#19979;&#25991;&#30340;&#23450;&#21046;&#21270;&#20248;&#21183;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35780;&#20272;&#26366;&#32463;&#21482;&#22312;&#20154;&#31867;&#19987;&#23478;&#39046;&#22495;&#20869;&#36827;&#34892;&#65288;&#20363;&#22914;&#21307;&#29983;&#36827;&#34892;&#30340;&#21307;&#23398;&#35786;&#26029;&#65289;&#65292;&#29616;&#22312;&#20063;&#21487;&#20197;&#36890;&#36807;&#26426;&#22120;&#23398;&#20064;&#31639;&#27861;&#36827;&#34892;&#12290;&#36825;&#24341;&#21457;&#20102;&#19968;&#20010;&#26032;&#30340;&#27010;&#24565;&#38382;&#39064;&#65306;&#34987;&#20154;&#31867;&#21644;&#31639;&#27861;&#35780;&#20272;&#20043;&#38388;&#26377;&#20160;&#20040;&#21306;&#21035;&#65292;&#22312;&#20160;&#20040;&#26102;&#20505;&#20010;&#20154;&#24212;&#35813;&#26356;&#21916;&#27426;&#20854;&#20013;&#19968;&#31181;&#24418;&#24335;&#30340;&#35780;&#20272;&#65311;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#29702;&#35770;&#26694;&#26550;&#65292;&#24418;&#24335;&#21270;&#20102;&#36825;&#20004;&#31181;&#35780;&#20272;&#24418;&#24335;&#20043;&#38388;&#30340;&#19968;&#20010;&#20851;&#38190;&#21306;&#21035;&#65306;&#26426;&#22120;&#23398;&#20064;&#31639;&#27861;&#26159;&#26631;&#20934;&#21270;&#30340;&#65292;&#36890;&#36807;&#22266;&#23450;&#30340;&#20849;&#21464;&#37327;&#26469;&#35780;&#20272;&#25152;&#26377;&#20010;&#20307;&#65292;&#32780;&#20154;&#31867;&#35780;&#20272;&#32773;&#21017;&#26681;&#25454;&#20010;&#20307;&#23450;&#21046;&#33719;&#21462;&#21738;&#20123;&#20849;&#21464;&#37327;&#12290;&#25105;&#20204;&#30340;&#26694;&#26550;&#23450;&#20041;&#24182;&#20998;&#26512;&#20102;&#36825;&#31181;&#23450;&#21046;&#21270;&#30340;&#20248;&#21183;&#8212;&#8212;&#19978;&#19979;&#25991;&#30340;&#20215;&#20540;&#65292;&#22312;&#20855;&#26377;&#38750;&#24120;&#39640;&#32500;&#25968;&#25454;&#30340;&#29615;&#22659;&#20013;&#12290;&#25105;&#20204;&#34920;&#26126;&#65292;&#38500;&#38750;&#20195;&#29702;&#20154;&#23545;&#20849;&#21464;&#37327;&#30340;&#32852;&#21512;&#20998;&#24067;&#26377;&#31934;&#30830;&#30340;&#30693;&#35782;&#65292;&#26356;&#22810;&#20849;&#21464;&#37327;&#30340;&#20215;&#20540;&#36229;&#36807;&#20102;&#19978;&#19979;&#25991;&#30340;&#20215;&#20540;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.11157v1 Announce Type: new  Abstract: Evaluations once solely within the domain of human experts (e.g., medical diagnosis by doctors) can now also be carried out by machine learning algorithms. This raises a new conceptual question: what is the difference between being evaluated by humans and algorithms, and when should an individual prefer one form of evaluation over the other? We propose a theoretical framework that formalizes one key distinction between the two forms of evaluation: Machine learning algorithms are standardized, fixing a common set of covariates by which to assess all individuals, while human evaluators customize which covariates are acquired to each individual. Our framework defines and analyzes the advantage of this customization -- the value of context -- in environments with very high-dimensional data. We show that unless the agent has precise knowledge about the joint distribution of covariates, the value of more covariates exceeds the value of context
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#20989;&#25968;&#20559;&#26368;&#23567;&#20108;&#20056;&#20272;&#35745;&#22120;&#65292;&#20854;&#22312;&#19968;&#31867;&#26925;&#29699;&#19978;&#23454;&#29616;&#20102;&#65288;&#36817;&#20046;&#65289;&#26368;&#20248;&#30340;&#25910;&#25947;&#36895;&#29575;&#65292;&#24182;&#24341;&#20837;&#20102;&#36866;&#24212;&#26410;&#30693;&#36870;&#38382;&#39064;&#24230;&#30340;&#25552;&#21069;&#20572;&#27490;&#35268;&#21017;&#12290;</title><link>https://arxiv.org/abs/2402.11134</link><description>&lt;p&gt;
&#20989;&#25968;&#20559;&#26368;&#23567;&#20108;&#20056;&#27861;&#65306;&#26368;&#20248;&#25910;&#25947;&#29575;&#21644;&#33258;&#36866;&#24212;&#24615;
&lt;/p&gt;
&lt;p&gt;
Functional Partial Least-Squares: Optimal Rates and Adaptation
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.11134
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#20989;&#25968;&#20559;&#26368;&#23567;&#20108;&#20056;&#20272;&#35745;&#22120;&#65292;&#20854;&#22312;&#19968;&#31867;&#26925;&#29699;&#19978;&#23454;&#29616;&#20102;&#65288;&#36817;&#20046;&#65289;&#26368;&#20248;&#30340;&#25910;&#25947;&#36895;&#29575;&#65292;&#24182;&#24341;&#20837;&#20102;&#36866;&#24212;&#26410;&#30693;&#36870;&#38382;&#39064;&#24230;&#30340;&#25552;&#21069;&#20572;&#27490;&#35268;&#21017;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#32771;&#34385;&#20855;&#26377;&#26631;&#37327;&#21709;&#24212;&#21644; Hilbert &#31354;&#38388;&#20540;&#39044;&#27979;&#21464;&#37327;&#30340;&#20989;&#25968;&#32447;&#24615;&#22238;&#24402;&#27169;&#22411;&#65292;&#36825;&#26159;&#19968;&#20010;&#20247;&#25152;&#21608;&#30693;&#30340;&#21453;&#38382;&#39064;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#19982;&#20849;&#36717;&#26799;&#24230;&#26041;&#27861;&#30456;&#20851;&#30340;&#20989;&#25968;&#20559;&#26368;&#23567;&#20108;&#20056;&#65288;PLS&#65289;&#20272;&#35745;&#30340;&#26032;&#20844;&#24335;&#12290;&#25105;&#20204;&#23558;&#23637;&#31034;&#35813;&#20272;&#35745;&#22120;&#22312;&#19968;&#31867;&#26925;&#29699;&#19978;&#23454;&#29616;&#20102;&#65288;&#36817;&#20046;&#65289;&#26368;&#20248;&#30340;&#25910;&#25947;&#36895;&#29575;&#65292;&#24182;&#24341;&#20837;&#20102;&#19968;&#20010;&#33021;&#22815;&#36866;&#24212;&#26410;&#30693;&#36870;&#38382;&#39064;&#24230;&#30340;&#25552;&#21069;&#20572;&#27490;&#35268;&#21017;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#20272;&#35745;&#22120;&#19982;&#20027;&#25104;&#20998;&#22238;&#24402;&#20272;&#35745;&#22120;&#20043;&#38388;&#30340;&#19968;&#20123;&#29702;&#35770;&#21644;&#20223;&#30495;&#27604;&#36739;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.11134v1 Announce Type: cross  Abstract: We consider the functional linear regression model with a scalar response and a Hilbert space-valued predictor, a well-known ill-posed inverse problem. We propose a new formulation of the functional partial least-squares (PLS) estimator related to the conjugate gradient method. We shall show that the estimator achieves the (nearly) optimal convergence rate on a class of ellipsoids and we introduce an early stopping rule which adapts to the unknown degree of ill-posedness. Some theoretical and simulation comparison between the estimator and the principal component regression estimator is provided.
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#36890;&#36807;&#23454;&#39564;&#27979;&#35797;&#21457;&#29616;&#22312;&#35825;&#20154;&#26465;&#20214;&#19979;&#26377;66%&#30340;&#20010;&#20307;&#20855;&#26377;&#33258;&#25511;&#24847;&#35782;&#65292;&#21516;&#26102;&#34920;&#26126;&#25215;&#35834;&#21644;&#28789;&#27963;&#25104;&#26412;&#23545;&#20010;&#20307;&#31119;&#21033;&#30340;&#24433;&#21709;&#65292;&#23545;&#33829;&#38144;&#21644;&#25919;&#31574;&#21046;&#23450;&#39046;&#22495;&#25552;&#20379;&#21487;&#38752;&#21442;&#32771;&#12290;</title><link>https://arxiv.org/abs/2402.11072</link><description>&lt;p&gt;
&#33258;&#25511;&#24847;&#35782;&#30340;&#35748;&#30693;
&lt;/p&gt;
&lt;p&gt;
Awareness of self-control
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.11072
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#36890;&#36807;&#23454;&#39564;&#27979;&#35797;&#21457;&#29616;&#22312;&#35825;&#20154;&#26465;&#20214;&#19979;&#26377;66%&#30340;&#20010;&#20307;&#20855;&#26377;&#33258;&#25511;&#24847;&#35782;&#65292;&#21516;&#26102;&#34920;&#26126;&#25215;&#35834;&#21644;&#28789;&#27963;&#25104;&#26412;&#23545;&#20010;&#20307;&#31119;&#21033;&#30340;&#24433;&#21709;&#65292;&#23545;&#33829;&#38144;&#21644;&#25919;&#31574;&#21046;&#23450;&#39046;&#22495;&#25552;&#20379;&#21487;&#38752;&#21442;&#32771;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#32463;&#27982;&#23398;&#23478;&#20351;&#29992;&#26102;&#38388;&#19981;&#19968;&#33268;&#24615;&#20559;&#22909;&#27169;&#22411;&#23545;&#20855;&#26377;&#33258;&#25511;&#38382;&#39064;&#30340;&#20154;&#20204;&#22312;&#20915;&#31574;&#20013;&#36827;&#34892;&#24314;&#27169;&#12290;&#20182;&#20204;&#35748;&#20026;&#33258;&#25511;&#38382;&#39064;&#30340;&#26681;&#28304;&#21487;&#33021;&#26159;&#19981;&#30830;&#23450;&#24615;&#21644;&#35825;&#24785;&#12290;&#26412;&#25991;&#36890;&#36807;&#23545;&#20010;&#20307;&#25552;&#20379;&#21363;&#26102;&#22870;&#21169;&#21644;&#26410;&#26469;&#22870;&#21169;&#30340;&#23454;&#39564;&#27979;&#35797;&#65292;&#34913;&#37327;&#20102;&#22312;&#35825;&#20154;&#26465;&#20214;&#19979;&#33258;&#25511;&#38382;&#39064;&#30340;&#35748;&#30693;&#65292;&#24182;&#34913;&#37327;&#20102;&#25215;&#35834;&#21644;&#28789;&#27963;&#25104;&#26412;&#23545;&#20854;&#31119;&#21033;&#30340;&#24433;&#21709;&#12290;&#35813;&#30740;&#31350;&#20351;&#29992;&#20102;&#24102;&#26377;&#26102;&#38388;&#25240;&#29616;&#22240;&#23376;&#21644;&#29616;&#22312;&#20559;&#24046;&#30340;&#20934;&#21452;&#26354;&#32447;&#36148;&#29616;&#27169;&#22411;&#65292;&#29992;&#20110;&#21046;&#23450;&#34913;&#37327;&#24847;&#35782;&#21644;&#36873;&#25321;&#39072;&#20498;&#26465;&#20214;&#30340;&#27169;&#22411;&#12290;&#27979;&#35797;&#26174;&#31034;66%&#30340;&#20010;&#20307;&#20855;&#26377;&#33258;&#25511;&#24847;&#35782;&#65288;&#37096;&#20998;&#22825;&#30495;&#34892;&#20026;&#65289;&#12290;&#23545;&#20110;&#20010;&#20307;&#65292;&#31119;&#21033;&#38543;&#30528;&#25215;&#35834;&#21644;&#28789;&#27963;&#25104;&#26412;&#30340;&#22686;&#21152;&#32780;&#22686;&#21152;&#12290;&#35813;&#32467;&#26524;&#22312;&#31934;&#30830;&#20026;&#23458;&#25143;&#21644;&#31038;&#20250;&#35774;&#35745;&#20248;&#24800;&#30340;&#33829;&#38144;&#21644;&#25919;&#31574;&#21046;&#23450;&#39046;&#22495;&#20013;&#21487;&#33021;&#26377;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.11072v1 Announce Type: new  Abstract: Economists modeled self-control problems in decisions of people with the time-inconsistence preferences model. They argued that the source of self-control problems could be uncertainty and temptation. This paper uses an experimental test offered to individuals instantaneous reward and future rewards to measure awareness of self-control problems in a tempting condition and also measure the effect of commitment and flexibility cost on their welfare. The quasi-hyperbolic discounting model with time discount factor and present bias at the same time was used for making a model for measuring awareness and choice reversal conditions. The test showed 66% awareness of self-control (partially naive behaviors) in individuals. The welfare implication for individuals increased with commitment and flexibility costs. The result can be useful in marketing and policy-making fields design precisely offers for customers and society.
&lt;/p&gt;</description></item><item><title>&#36825;&#26159;&#19968;&#20010;&#29992;&#20110;&#39044;&#27979;&#30701;&#26399;&#30005;&#21147;&#38656;&#27714;&#30340;MATLAB&#24037;&#20855;&#31665;&#65292;&#21487;&#20197;&#25552;&#20379;&#26356;&#20934;&#30830;&#30340;&#39044;&#27979;&#12290;</title><link>https://arxiv.org/abs/2402.10982</link><description>&lt;p&gt;
mshw&#65292;&#19968;&#31181;&#22522;&#20110;&#22810;&#23395;&#33410;Holt-Winters&#30340;&#39044;&#27979;&#24211;&#65292;&#29992;&#20110;&#39044;&#27979;&#30701;&#26399;&#30005;&#21147;&#38656;&#27714;
&lt;/p&gt;
&lt;p&gt;
mshw, a forecasting library to predict short-term electricity demand based on multiple seasonal Holt-Winters
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.10982
&lt;/p&gt;
&lt;p&gt;
&#36825;&#26159;&#19968;&#20010;&#29992;&#20110;&#39044;&#27979;&#30701;&#26399;&#30005;&#21147;&#38656;&#27714;&#30340;MATLAB&#24037;&#20855;&#31665;&#65292;&#21487;&#20197;&#25552;&#20379;&#26356;&#20934;&#30830;&#30340;&#39044;&#27979;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36755;&#30005;&#31995;&#32479;&#36816;&#33829;&#21830;&#36234;&#26469;&#36234;&#38656;&#35201;&#26356;&#20934;&#30830;&#30340;&#30005;&#21147;&#38656;&#27714;&#39044;&#27979;&#12290;&#30446;&#21069;&#30340;&#30005;&#21147;&#31995;&#32479;&#22312;&#24456;&#22823;&#31243;&#24230;&#19978;&#38656;&#35201;&#38656;&#27714;&#39044;&#27979;&#65292;&#20197;&#20415;&#30005;&#21147;&#24066;&#22330;&#21046;&#23450;&#30005;&#21147;&#20215;&#26684;&#20197;&#21450;&#29983;&#20135;&#21333;&#20803;&#30340;&#32534;&#31243;&#12290;&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#20010;&#29992;&#20110;&#30005;&#21147;&#38656;&#27714;&#39044;&#27979;&#30340;MATLAB&#24037;&#20855;&#31665;&#65292;&#23454;&#29616;&#20102;&#22810;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.10982v1 Announce Type: new  Abstract: Transmission system operators have a growing need for more accurate forecasting of electricity demand. Current electricity systems largely require demand forecasting so that the electricity market establishes electricity prices as well as the programming of production units. The companies that are part of the electrical system use exclusive software to obtain predictions, based on the use of time series and prediction tools, whether statistical or artificial intelligence. However, the most common form of prediction is based on hybrid models that use both technologies. In any case, it is software with a complicated structure, with a large number of associated variables and that requires a high computational load to make predictions. The predictions they can offer are not much better than those that simple models can offer. In this paper we present a MATLAB toolbox created for the prediction of electrical demand. The toolbox implements mul
&lt;/p&gt;</description></item><item><title>&#36825;&#31687;&#35770;&#25991;&#30740;&#31350;&#20102;&#37325;&#22797;&#20844;&#24179;&#20998;&#21106;&#38382;&#39064;&#20013;&#30340;&#31454;&#20105;&#31574;&#30053;&#65292;&#21457;&#29616;&#22914;&#26524;Bob&#36807;&#20110;&#20559;&#22909;&#26576;&#19968;&#22359;&#34507;&#31957;&#65292;Alice&#21033;&#29992;&#31867;&#20284;&#20110;&#20108;&#20998;&#26597;&#25214;&#30340;&#31574;&#30053;&#21487;&#20197;&#31995;&#32479;&#24615;&#22320;&#23545;Bob&#23454;&#26045;&#21093;&#21066;&#65292;&#20174;&#32780;&#22312;&#26102;&#38388;&#19978;&#33719;&#24471;&#26356;&#22810;&#36164;&#28304;&#20221;&#39069;&#12290;</title><link>https://arxiv.org/abs/2402.08547</link><description>&lt;p&gt;
&#25581;&#31034;&#20102;&#22312;&#37325;&#22797;&#30340;&#34507;&#31957;&#20999;&#21106;&#20013;&#33521;&#21191;&#31454;&#20105;&#30340;&#33402;&#26415;
&lt;/p&gt;
&lt;p&gt;
Dueling Over Dessert, Mastering the Art of Repeated Cake Cutting
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.08547
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#30740;&#31350;&#20102;&#37325;&#22797;&#20844;&#24179;&#20998;&#21106;&#38382;&#39064;&#20013;&#30340;&#31454;&#20105;&#31574;&#30053;&#65292;&#21457;&#29616;&#22914;&#26524;Bob&#36807;&#20110;&#20559;&#22909;&#26576;&#19968;&#22359;&#34507;&#31957;&#65292;Alice&#21033;&#29992;&#31867;&#20284;&#20110;&#20108;&#20998;&#26597;&#25214;&#30340;&#31574;&#30053;&#21487;&#20197;&#31995;&#32479;&#24615;&#22320;&#23545;Bob&#23454;&#26045;&#21093;&#21066;&#65292;&#20174;&#32780;&#22312;&#26102;&#38388;&#19978;&#33719;&#24471;&#26356;&#22810;&#36164;&#28304;&#20221;&#39069;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#32771;&#34385;&#20102;&#20004;&#20010;&#29609;&#23478;&#65292;&#20998;&#21035;&#20195;&#34920;Alice&#21644;Bob&#65292;&#36890;&#36807;&#23545;&#34507;&#31957;&#30340;&#20010;&#20154;&#20272;&#20540;&#36827;&#34892;&#20102;&#37325;&#22797;&#30340;&#20844;&#24179;&#20998;&#21106;&#12290;&#22312;&#27599;&#19968;&#36718;&#20013;&#65292;&#20250;&#20986;&#29616;&#19968;&#22359;&#19982;&#20043;&#21069;&#36718;&#27425;&#30456;&#21516;&#30340;&#26032;&#34507;&#31957;&#12290;Alice&#22312;&#33258;&#24049;&#36873;&#25321;&#30340;&#19968;&#20010;&#28857;&#19978;&#20999;&#21106;&#34507;&#31957;&#65292;&#32780;Bob&#36873;&#25321;&#24038;&#36793;&#30340;&#37096;&#20998;&#25110;&#21491;&#36793;&#30340;&#37096;&#20998;&#65292;&#25226;&#21097;&#20313;&#30340;&#32473;Alice&#12290;&#25105;&#20204;&#32771;&#34385;&#20102;&#20004;&#20010;&#21464;&#31181;&#65306;&#39034;&#24207;&#27169;&#24335;&#65292;Bob&#22312;&#36873;&#25321;&#24038;/&#21491;&#20043;&#21069;&#35266;&#23519;Alice&#30340;&#20999;&#21106;&#28857;&#65307;&#21516;&#26102;&#27169;&#24335;&#65292;&#20182;&#21482;&#22312;&#20570;&#20986;&#36873;&#25321;&#21518;&#35266;&#23519;&#22905;&#30340;&#20999;&#21106;&#28857;&#12290;&#21516;&#26102;&#27169;&#24335;&#26159;&#30001;Aumann&#21644;Maschler&#65288;1995&#65289;&#39318;&#27425;&#25552;&#20986;&#30340;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#22914;&#26524;Bob&#20960;&#20046;&#26159;&#30446;&#20809;&#30701;&#27973;&#30340;&#65292;&#24182;&#19988;&#32463;&#24120;&#36873;&#25321;&#33258;&#24049;&#21916;&#27426;&#30340;&#37096;&#20998;&#65292;&#37027;&#20040;&#20182;&#21487;&#20197;&#34987;Alice&#36890;&#36807;&#31867;&#20284;&#20110;&#20108;&#20998;&#26597;&#25214;&#30340;&#31574;&#30053;&#31995;&#32479;&#24615;&#22320;&#21033;&#29992;&#12290;&#36825;&#20010;&#31574;&#30053;&#20351;&#24471;Alice&#21487;&#20197;&#36234;&#26469;&#36234;&#31934;&#30830;&#22320;&#27169;&#25311;Bob&#30340;&#20559;&#22909;&#65292;&#20174;&#32780;&#22312;&#26102;&#38388;&#19978;&#33719;&#24471;&#19981;&#25104;&#27604;&#20363;&#30340;&#36164;&#28304;&#20221;&#39069;&#12290;&#25105;&#20204;&#20998;&#26512;&#20102;&#19968;&#20010;&#29609;&#23478;&#33021;&#22815;&#21033;&#29992;&#20854;&#20248;&#21183;&#30340;&#26497;&#38480;&#12290;
&lt;/p&gt;
&lt;p&gt;
We consider the setting of repeated fair division between two players, denoted Alice and Bob, with private valuations over a cake. In each round, a new cake arrives, which is identical to the ones in previous rounds. Alice cuts the cake at a point of her choice, while Bob chooses the left piece or the right piece, leaving the remainder for Alice. We consider two versions: sequential, where Bob observes Alice's cut point before choosing left/right, and simultaneous, where he only observes her cut point after making his choice. The simultaneous version was first considered by Aumann and Maschler (1995).   We observe that if Bob is almost myopic and chooses his favorite piece too often, then he can be systematically exploited by Alice through a strategy akin to a binary search. This strategy allows Alice to approximate Bob's preferences with increasing precision, thereby securing a disproportionate share of the resource over time.   We analyze the limits of how much a player can exploit t
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#20215;&#26684;&#24046;&#24322;&#21270;&#22312;&#38544;&#31169;&#32422;&#26463;&#19979;&#30340;&#38480;&#21046;&#38382;&#39064;&#65292;&#21457;&#29616;&#38544;&#31169;&#26426;&#21046;&#20250;&#36890;&#36807;&#38477;&#20302;&#26368;&#22823;&#21644;&#26368;&#23567;&#21487;&#36798;&#21040;&#30340;&#25928;&#29992;&#26469;&#25439;&#23475;&#29983;&#20135;&#32773;&#12290;</title><link>https://arxiv.org/abs/2402.08223</link><description>&lt;p&gt;
&#20215;&#26684;&#24046;&#24322;&#21270;&#22312;&#38544;&#31169;&#32422;&#26463;&#19979;&#30340;&#38480;&#21046;
&lt;/p&gt;
&lt;p&gt;
The Limits of Price Discrimination Under Privacy Constraints
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.08223
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#20215;&#26684;&#24046;&#24322;&#21270;&#22312;&#38544;&#31169;&#32422;&#26463;&#19979;&#30340;&#38480;&#21046;&#38382;&#39064;&#65292;&#21457;&#29616;&#38544;&#31169;&#26426;&#21046;&#20250;&#36890;&#36807;&#38477;&#20302;&#26368;&#22823;&#21644;&#26368;&#23567;&#21487;&#36798;&#21040;&#30340;&#25928;&#29992;&#26469;&#25439;&#23475;&#29983;&#20135;&#32773;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#32771;&#34385;&#29983;&#20135;&#32773;&#22312;&#21521;&#19968;&#31995;&#21015;&#27880;&#37325;&#38544;&#31169;&#30340;&#28040;&#36153;&#32773;&#38144;&#21806;&#20135;&#21697;&#26102;&#38754;&#20020;&#30340;&#38382;&#39064;&#65292;&#29983;&#20135;&#32773;&#21487;&#20197;&#23454;&#26045;&#31532;&#19977;&#24230;&#20215;&#26684;&#24046;&#24322;&#21270;&#65292;&#20026;&#19981;&#21516;&#30340;&#24066;&#22330;&#32454;&#20998;&#25552;&#20379;&#19981;&#21516;&#30340;&#20215;&#26684;&#12290;&#22312;&#27809;&#26377;&#38544;&#31169;&#32422;&#26463;&#30340;&#24773;&#20917;&#19979;&#65292;Bergemann&#65292;Brooks&#65292;&#21644;Morris [2015]&#21051;&#30011;&#20102;&#25152;&#26377;&#21487;&#33021;&#30340;&#28040;&#36153;&#32773;-&#29983;&#20135;&#32773;&#25928;&#29992;&#38598;&#21512;&#65292;&#34920;&#26126;&#23427;&#26159;&#19968;&#20010;&#19977;&#35282;&#24418;&#12290;&#25105;&#20204;&#32771;&#34385;&#20102;&#19968;&#31181;&#38544;&#31169;&#26426;&#21046;&#65292;&#36890;&#36807;&#27010;&#29575;&#22320;&#25513;&#30422;&#27599;&#20010;&#24066;&#22330;&#32454;&#20998;&#26469;&#25552;&#20379;&#19968;&#23450;&#31243;&#24230;&#30340;&#20445;&#25252;&#65292;&#24182;&#19988;&#25105;&#20204;&#30830;&#23450;&#25152;&#24471;&#21040;&#30340;&#25152;&#26377;&#28040;&#36153;&#32773;-&#29983;&#20135;&#32773;&#25928;&#29992;&#38598;&#21512;&#24418;&#25104;&#19968;&#20010;&#20984;&#22810;&#36793;&#24418;&#65292;&#26126;&#30830;&#22320;&#34920;&#36798;&#20026;&#26576;&#20010;&#39640;&#32500;&#20984;&#22810;&#38754;&#20307;&#21040;$\mathbb{R}^2$&#30340;&#32447;&#24615;&#26144;&#23556;&#12290;&#36825;&#31181;&#21051;&#30011;&#20351;&#25105;&#20204;&#33021;&#22815;&#30740;&#31350;&#38544;&#31169;&#26426;&#21046;&#23545;&#29983;&#20135;&#32773;&#21644;&#28040;&#36153;&#32773;&#25928;&#29992;&#30340;&#24433;&#21709;&#12290;&#29305;&#21035;&#22320;&#65292;&#25105;&#20204;&#30830;&#23450;&#38544;&#31169;&#32422;&#26463;&#24635;&#26159;&#36890;&#36807;&#38477;&#20302;&#26368;&#22823;&#21644;&#26368;&#23567;&#21487;&#36798;&#21040;&#30340;&#25928;&#29992;&#26469;&#25439;&#23475;&#29983;&#20135;&#32773;&#12290;
&lt;/p&gt;
&lt;p&gt;
We consider a producer's problem of selling a product to a continuum of privacy-conscious consumers, where the producer can implement third-degree price discrimination, offering different prices to different market segments. In the absence of privacy constraints, Bergemann, Brooks, and Morris [2015] characterize the set of all possible consumer-producer utilities, showing that it is a triangle. We consider a privacy mechanism that provides a degree of protection by probabilistically masking each market segment, and we establish that the resultant set of all consumer-producer utilities forms a convex polygon, characterized explicitly as a linear mapping of a certain high-dimensional convex polytope into $\mathbb{R}^2$. This characterization enables us to investigate the impact of the privacy mechanism on both producer and consumer utilities. In particular, we establish that the privacy constraint always hurts the producer by reducing both the maximum and minimum utility achievable. From
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#24230;&#37327;&#26631;&#20934;&#65292;&#36890;&#36807;&#23558;&#24377;&#24615;&#27010;&#24565;&#21270;&#20026;&#19968;&#31181;&#26041;&#27861;&#65292;&#21487;&#20197;&#22312;&#24066;&#22330;&#19978;&#39044;&#27979;&#20215;&#26684;&#24863;&#30693;&#38382;&#39064;&#65292;&#24182;&#36873;&#25321;&#27491;&#30830;&#30340;&#25112;&#30053;&#23450;&#20215;&#26041;&#27861;&#12290;</title><link>https://arxiv.org/abs/2402.05152</link><description>&lt;p&gt;
&#20215;&#26684;&#26159;&#21542;&#21512;&#29702;&#65311;&#37325;&#26032;&#26500;&#24605;&#20215;&#26684;&#21644;&#25910;&#20837;&#24377;&#24615;&#20197;&#39044;&#27979;&#20215;&#26684;&#24863;&#30693;&#38382;&#39064;
&lt;/p&gt;
&lt;p&gt;
Is the price right? Reconceptualizing price and income elasticity to anticipate price perception issues
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.05152
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#24230;&#37327;&#26631;&#20934;&#65292;&#36890;&#36807;&#23558;&#24377;&#24615;&#27010;&#24565;&#21270;&#20026;&#19968;&#31181;&#26041;&#27861;&#65292;&#21487;&#20197;&#22312;&#24066;&#22330;&#19978;&#39044;&#27979;&#20215;&#26684;&#24863;&#30693;&#38382;&#39064;&#65292;&#24182;&#36873;&#25321;&#27491;&#30830;&#30340;&#25112;&#30053;&#23450;&#20215;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#28040;&#36153;&#32773;&#23545;&#20215;&#26684;&#30340;&#24863;&#30693;&#23545;&#20110;&#20225;&#19994;&#33021;&#21542;&#27491;&#30830;&#21644;&#30408;&#21033;&#22320;&#20026;&#20854;&#20135;&#21697;&#25110;&#26381;&#21153;&#23450;&#20215;&#21644;&#38144;&#21806;&#26500;&#25104;&#20102;&#25361;&#25112;&#65292;&#29305;&#21035;&#26159;&#22312;&#29305;&#23450;&#24066;&#22330;&#21644;&#26032;&#30340;&#30446;&#26631;&#24066;&#22330;&#19978;&#12290;&#20215;&#26684;&#24863;&#30693;&#30340;&#22797;&#26434;&#24615;&#22312;&#20110;&#20215;&#26684;&#21644;&#25910;&#20837;&#24377;&#24615;&#30340;&#21160;&#24577;&#24615;&#20197;&#21450;&#28040;&#36153;&#32773;&#20559;&#22909;&#30340;&#24322;&#36136;&#24615;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#24230;&#37327;&#26631;&#20934;&#65292;&#20197;&#23558;&#24377;&#24615;&#27010;&#24565;&#21270;&#20026;&#19968;&#31181;&#22312;&#24066;&#22330;&#19978;&#19968;&#33324;&#37327;&#21270;&#28508;&#22312;&#20215;&#26684;&#24863;&#30693;&#38382;&#39064;&#30340;&#26041;&#27861;&#65292;&#20351;&#29992;&#19968;&#31181;&#20248;&#38597;&#19988;&#38750;&#25928;&#29992;&#22522;&#30784;&#30340;&#36523;&#20221;&#35748;&#21516;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;&#26681;&#25454;&#24050;&#30693;&#30340;&#20215;&#26684;&#21644;&#25910;&#20837;&#24377;&#24615;&#20540;&#65292;&#20225;&#19994;&#21487;&#20197;&#20107;&#20808;&#39044;&#27979;&#23450;&#20215;&#24863;&#30693;&#38382;&#39064;&#65292;&#24182;&#35299;&#20915;&#20854;&#20215;&#20540;&#20027;&#24352;&#21487;&#33021;&#36973;&#21463;&#30340;&#30772;&#22351;&#24615;&#22833;&#30495;&#12290;&#27492;&#22806;&#65292;&#20225;&#19994;&#21487;&#20197;&#21033;&#29992;&#36825;&#19968;&#27934;&#23519;&#21147;&#26469;&#27491;&#30830;&#36873;&#25321;&#25112;&#30053;&#23450;&#20215;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
Price perception by consumers represents a challenge to the ability of a business to correctly and profitably price and sell their products or services in a given market and any new target market. Complicating the perception of prices is the dynamics of price and income elasticity and the heterogeneity of consumer preferences. This article proposes a novel metric that conceptualizes elasticity as a means of generally quantifying the potential for price perception problems in a market using an elegant and non-utility based identity. The results suggest that given known price and income elasticity values, a business can anticipate pricing perception problems in advance and address the potential for the damaging distortion of their value proposition. Further, the business can use this insight to correctly choose a strategic pricing approach..
&lt;/p&gt;</description></item><item><title>&#19968;&#20010;&#31038;&#20250;&#36873;&#25321;&#20989;&#25968;&#21516;&#26102;&#23454;&#29616;&#21069;&#32622;&#24085;&#32047;&#25176;&#39640;&#25928;&#21644;&#36125;&#21494;&#26031;&#28608;&#21169;&#20860;&#23481;&#65292;&#24403;&#19988;&#20165;&#24403;&#23427;&#26159;&#29420;&#35009;&#30340;&#12290;</title><link>https://arxiv.org/abs/2303.05968</link><description>&lt;p&gt;
&#19968;&#33324;&#20851;&#20110;&#24085;&#32047;&#25176;&#25928;&#29575;&#21644;&#36125;&#21494;&#26031;&#28608;&#21169;&#20860;&#23481;&#24615;&#30340;&#19981;&#21487;&#33021;&#23450;&#29702;
&lt;/p&gt;
&lt;p&gt;
A General Impossibility Theorem on Pareto Efficiency and Bayesian Incentive Compatibility
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2303.05968
&lt;/p&gt;
&lt;p&gt;
&#19968;&#20010;&#31038;&#20250;&#36873;&#25321;&#20989;&#25968;&#21516;&#26102;&#23454;&#29616;&#21069;&#32622;&#24085;&#32047;&#25176;&#39640;&#25928;&#21644;&#36125;&#21494;&#26031;&#28608;&#21169;&#20860;&#23481;&#65292;&#24403;&#19988;&#20165;&#24403;&#23427;&#26159;&#29420;&#35009;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#19968;&#31867;&#31038;&#20250;&#36873;&#25321;&#38382;&#39064;&#65292;&#20854;&#20013;&#20195;&#29702;&#30340;&#25903;&#20184;&#20989;&#25968;&#65288;&#25110;&#31867;&#22411;&#65289;&#26159;&#31169;&#23494;&#21487;&#35266;&#27979;&#30340;&#38543;&#26426;&#21464;&#37327;&#65292;&#19988;&#36135;&#24065;&#36716;&#31227;&#19981;&#21487;&#29992;&#12290;&#25105;&#20204;&#32771;&#34385;&#20102;&#22522;&#25968;&#31038;&#20250;&#36873;&#25321;&#20989;&#25968;&#65292;&#23427;&#21487;&#20197;&#23545;&#20195;&#29702;&#30340;&#20559;&#22909;&#24378;&#24230;&#21644;&#20559;&#22909;&#25490;&#24207;&#20570;&#20986;&#21453;&#24212;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#22914;&#26524;&#19968;&#20010;&#31038;&#20250;&#36873;&#25321;&#20989;&#25968;&#26159;&#21069;&#32622;&#24085;&#32047;&#25176;&#39640;&#25928;&#21644;&#36125;&#21494;&#26031;&#28608;&#21169;&#20860;&#23481;&#30340;&#65292;&#21017;&#23427;&#24517;&#39035;&#26159;&#29420;&#35009;&#30340;&#12290;&#36825;&#20010;&#32467;&#26524;&#23545;&#20110;&#20219;&#24847;&#25968;&#37327;&#30340;&#20195;&#29702;&#21644;&#22791;&#36873;&#39033;&#37117;&#25104;&#31435;&#65292;&#24182;&#19988;&#22312;&#20851;&#20110;&#31867;&#22411;&#30340;&#32852;&#21512;&#20998;&#24067;&#19978;&#26377;&#19968;&#20010;&#30456;&#24403;&#24369;&#30340;&#20551;&#35774;&#19979;&#25104;&#31435;&#65292;&#35813;&#20551;&#35774;&#20801;&#35768;&#20219;&#24847;&#30340;&#30456;&#20851;&#24615;&#21644;&#19981;&#23545;&#31216;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2303.05968v2 Announce Type: replace  Abstract: This paper studies a general class of social choice problems in which agents' payoff functions (or types) are privately observable random variables, and monetary transfers are not available. We consider cardinal social choice functions which may respond to agents' preference intensities as well as preference rankings. We show that a social choice function is ex ante Pareto efficient and Bayesian incentive compatible if and only if it is dictatorial. The result holds for arbitrary numbers of agents and alternatives, and under a fairly weak assumption on the joint distribution of types, which allows for arbitrary correlations and asymmetries.
&lt;/p&gt;</description></item><item><title>&#38024;&#23545;&#25910;&#30410;&#22686;&#38271;&#30340;&#26465;&#20214;&#20998;&#24067;&#20013;&#19981;&#23384;&#22312;&#30340;&#30697;&#65292;&#25552;&#20986;&#20102;&#31283;&#20581;&#30340;&#26465;&#20214;Pareto&#25351;&#25968;&#20316;&#20026;&#26032;&#30340;&#25910;&#30410;&#39118;&#38505;&#34913;&#37327;&#26631;&#20934;&#65292;&#24182;&#21457;&#23637;&#20102;&#23545;&#24212;&#30340;&#20272;&#35745;&#21644;&#25512;&#26029;&#26041;&#27861;&#12290;</title><link>https://arxiv.org/abs/2203.08014</link><description>&lt;p&gt;
&#25910;&#30410;&#22686;&#38271;&#20013;&#19981;&#23384;&#22312;&#30340;&#30697;
&lt;/p&gt;
&lt;p&gt;
Non-Existent Moments of Earnings Growth
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2203.08014
&lt;/p&gt;
&lt;p&gt;
&#38024;&#23545;&#25910;&#30410;&#22686;&#38271;&#30340;&#26465;&#20214;&#20998;&#24067;&#20013;&#19981;&#23384;&#22312;&#30340;&#30697;&#65292;&#25552;&#20986;&#20102;&#31283;&#20581;&#30340;&#26465;&#20214;Pareto&#25351;&#25968;&#20316;&#20026;&#26032;&#30340;&#25910;&#30410;&#39118;&#38505;&#34913;&#37327;&#26631;&#20934;&#65292;&#24182;&#21457;&#23637;&#20102;&#23545;&#24212;&#30340;&#20272;&#35745;&#21644;&#25512;&#26029;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25991;&#29486;&#36890;&#24120;&#20351;&#29992;&#22522;&#20110;&#30697;&#30340;&#25910;&#30410;&#39118;&#38505;&#34913;&#37327;&#26041;&#27861;&#65292;&#22914;&#26041;&#24046;&#12289;&#20559;&#24230;&#21644;&#23792;&#24230;&#12290;&#28982;&#32780;&#65292;&#22312;&#37325;&#23614;&#20998;&#24067;&#19979;&#65292;&#36825;&#20123;&#30697;&#21487;&#33021;&#22312;&#24635;&#20307;&#20013;&#19981;&#23384;&#22312;&#12290;&#25105;&#20204;&#30340;&#23454;&#35777;&#20998;&#26512;&#21457;&#29616;&#65292;&#25910;&#30410;&#22686;&#38271;&#30340;&#26465;&#20214;&#20998;&#24067;&#20013;&#65292;&#24635;&#20307;&#23792;&#24230;&#12289;&#20559;&#24230;&#21644;&#26041;&#24046;&#36890;&#24120;&#19981;&#23384;&#22312;&#12290;&#36825;&#25361;&#25112;&#20102;&#22522;&#20110;&#30697;&#30340;&#20998;&#26512;&#12290;&#25105;&#20204;&#25552;&#20986;&#31283;&#20581;&#30340;&#26465;&#20214;Pareto&#25351;&#25968;&#20316;&#20026;&#26032;&#39062;&#30340;&#25910;&#30410;&#39118;&#38505;&#34913;&#37327;&#26631;&#20934;&#65292;&#24182;&#21457;&#23637;&#20102;&#20272;&#35745;&#21644;&#25512;&#26029;&#26041;&#27861;&#12290;&#21033;&#29992;&#33521;&#22269;&#26032;&#25910;&#20837;&#35843;&#26597;&#38754;&#26495;&#25968;&#25454;&#38598;&#65288;NESPD&#65289;&#21644;&#32654;&#22269;&#25910;&#20837;&#21160;&#24577;&#38754;&#26495;&#30740;&#31350;&#65288;PSID&#65289;&#65292;&#25105;&#20204;&#21457;&#29616;&#65306;1&#65289;&#30697;&#32463;&#24120;&#19981;&#23384;&#22312;&#65307;2&#65289;&#25910;&#30410;&#39118;&#38505;&#38543;&#30528;&#29983;&#21629;&#21608;&#26399;&#22686;&#21152;&#65307;3&#65289;&#31283;&#23450;&#24037;&#20316;&#32773;&#38754;&#20020;&#26356;&#39640;&#30340;&#25910;&#30410;&#39118;&#38505;&#65307;4&#65289;&#36825;&#20123;&#27169;&#24335;&#22312;2007-2008&#24180;&#34928;&#36864;&#26399;&#21644;2015-2016&#24180;&#22686;&#38271;&#26399;&#38388;&#25345;&#32493;&#23384;&#22312;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2203.08014v3 Announce Type: replace  Abstract: The literature often employs moment-based earnings risk measures like variance, skewness, and kurtosis. However, under heavy-tailed distributions, these moments may not exist in the population. Our empirical analysis reveals that population kurtosis, skewness, and variance often do not exist for the conditional distribution of earnings growth. This challenges moment-based analyses. We propose robust conditional Pareto exponents as novel earnings risk measures, developing estimation and inference methods. Using the UK New Earnings Survey Panel Dataset (NESPD) and US Panel Study of Income Dynamics (PSID), we find: 1) Moments often fail to exist; 2) Earnings risk increases over the life cycle; 3) Job stayers face higher earnings risk; 4) These patterns persist during the 2007--2008 recession and the 2015--2016 positive growth period.
&lt;/p&gt;</description></item><item><title>&#21033;&#29992;&#19987;&#23478;&#23450;&#20041;&#30340;&#22810;&#31181;&#24773;&#26223;&#20449;&#24687;&#65292;&#37319;&#29992;&#21046;&#24230;&#36716;&#25442;&#26694;&#26550;&#29983;&#25104;&#23439;&#35266;&#32463;&#27982;&#23494;&#24230;&#39044;&#27979;&#65292;&#24182;&#36890;&#36807;&#20248;&#21270;&#23458;&#35266;&#20989;&#25968;&#32452;&#21512;&#19981;&#21516;&#24773;&#26223;&#30340;&#39044;&#27979;&#23494;&#24230;&#65292;&#23637;&#31034;&#20102;&#26412;&#25991;&#30340;&#26041;&#27861;&#12290;&#35813;&#26041;&#27861;&#22312;&#24179;&#22343;&#39044;&#27979;&#20998;&#25968;&#21644;&#39044;&#27979;&#20998;&#24067;&#26657;&#20934;&#26041;&#38754;&#34920;&#29616;&#33391;&#22909;&#65292;&#24182;&#21487;&#29992;&#20110;&#35780;&#20272;&#32463;&#27982;&#23398;&#23478;&#24773;&#26223;&#23545;&#23494;&#24230;&#39044;&#27979;&#24615;&#33021;&#30340;&#36129;&#29486;&#12290;</title><link>https://arxiv.org/abs/2110.13761</link><description>&lt;p&gt;
&#21033;&#29992;&#32463;&#27982;&#23398;&#23478;&#30340;&#24773;&#26223;&#36827;&#34892;&#36716;&#21464;&#23494;&#24230;&#39044;&#27979;
&lt;/p&gt;
&lt;p&gt;
Regime-Switching Density Forecasts Using Economists' Scenarios
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2110.13761
&lt;/p&gt;
&lt;p&gt;
&#21033;&#29992;&#19987;&#23478;&#23450;&#20041;&#30340;&#22810;&#31181;&#24773;&#26223;&#20449;&#24687;&#65292;&#37319;&#29992;&#21046;&#24230;&#36716;&#25442;&#26694;&#26550;&#29983;&#25104;&#23439;&#35266;&#32463;&#27982;&#23494;&#24230;&#39044;&#27979;&#65292;&#24182;&#36890;&#36807;&#20248;&#21270;&#23458;&#35266;&#20989;&#25968;&#32452;&#21512;&#19981;&#21516;&#24773;&#26223;&#30340;&#39044;&#27979;&#23494;&#24230;&#65292;&#23637;&#31034;&#20102;&#26412;&#25991;&#30340;&#26041;&#27861;&#12290;&#35813;&#26041;&#27861;&#22312;&#24179;&#22343;&#39044;&#27979;&#20998;&#25968;&#21644;&#39044;&#27979;&#20998;&#24067;&#26657;&#20934;&#26041;&#38754;&#34920;&#29616;&#33391;&#22909;&#65292;&#24182;&#21487;&#29992;&#20110;&#35780;&#20272;&#32463;&#27982;&#23398;&#23478;&#24773;&#26223;&#23545;&#23494;&#24230;&#39044;&#27979;&#24615;&#33021;&#30340;&#36129;&#29486;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26041;&#27861;&#65292;&#29992;&#20110;&#29983;&#25104;&#32467;&#21512;&#20102;&#19987;&#23478;&#23450;&#20041;&#30340;&#22810;&#31181;&#24773;&#26223;&#20449;&#24687;&#30340;&#23439;&#35266;&#32463;&#27982;&#23494;&#24230;&#39044;&#27979;&#12290;&#25105;&#20204;&#37319;&#29992;&#20102;&#19968;&#20010;&#21046;&#24230;&#36716;&#25442;&#26694;&#26550;&#65292;&#20854;&#20013;&#19968;&#32452;&#24773;&#26223;&#65288;&#8220;&#35266;&#28857;&#8221;&#65289;&#34987;&#29992;&#20316;&#36125;&#21494;&#26031;&#20808;&#39564;&#65292;&#29992;&#20110;&#32463;&#27982;&#21046;&#24230;&#12290;&#28982;&#21518;&#36890;&#36807;&#20248;&#21270;&#23494;&#24230;&#39044;&#27979;&#30340;&#23458;&#35266;&#20989;&#25968;&#26469;&#23558;&#26469;&#33258;&#19981;&#21516;&#35266;&#28857;&#30340;&#39044;&#27979;&#23494;&#24230;&#32452;&#21512;&#36215;&#26469;&#12290;&#25105;&#20204;&#36890;&#36807;&#23545;&#32654;&#22269;&#23454;&#26102;&#23395;&#24230;GDP&#22686;&#38271;&#39044;&#27979;&#30340;&#32463;&#39564;&#24212;&#29992;&#23637;&#31034;&#20102;&#36825;&#31181;&#26041;&#27861;&#65292;&#24182;&#21033;&#29992;&#20102;&#32852;&#37030;&#20648;&#22791;&#31995;&#32479;&#29992;&#20110;&#38134;&#34892;&#21387;&#21147;&#27979;&#35797;&#30340;&#23439;&#35266;&#32463;&#27982;&#24773;&#26223;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#36825;&#31181;&#26041;&#27861;&#22312;&#24179;&#22343;&#39044;&#27979;&#20998;&#25968;&#21644;&#39044;&#27979;&#20998;&#24067;&#26657;&#20934;&#26041;&#38754;&#23454;&#29616;&#20102;&#33391;&#22909;&#30340;&#20934;&#30830;&#24615;&#12290;&#27492;&#22806;&#65292;&#23427;&#21487;&#20197;&#29992;&#20110;&#35780;&#20272;&#32463;&#27982;&#23398;&#23478;&#24773;&#26223;&#23545;&#23494;&#24230;&#39044;&#27979;&#24615;&#33021;&#30340;&#36129;&#29486;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2110.13761v2 Announce Type: replace  Abstract: We propose an approach for generating macroeconomic density forecasts that incorporate information on multiple scenarios defined by experts. We adopt a regime-switching framework in which sets of scenarios ("views") are used as Bayesian priors on economic regimes. Predictive densities coming from different views are then combined by optimizing objective functions of density forecasting. We illustrate the approach with an empirical application to quarterly real-time forecasts of U.S. GDP growth, in which we exploit the Fed's macroeconomic scenarios used for bank stress tests. We show that the approach achieves good accuracy in terms of average predictive scores and good calibration of forecast distributions. Moreover, it can be used to evaluate the contribution of economists' scenarios to density forecast performance.
&lt;/p&gt;</description></item><item><title>&#31227;&#27665;&#23545;&#24847;&#22823;&#21033;&#30340;&#32463;&#27982;&#26377;&#31215;&#26497;&#36129;&#29486;&#65292;&#20294;&#22312;&#39640;&#25216;&#33021;&#23494;&#38598;&#22411;&#24066;&#22330;&#20013;&#38599;&#20027;&#21644;&#38599;&#21592;&#26159;&#36194;&#23478;&#65292;&#20302;&#25216;&#33021;&#24066;&#22330;&#20013;&#38599;&#20027;&#26159;&#36755;&#23478;&#65292;&#32780;&#20302;&#25216;&#33021;&#21592;&#24037;&#30340;&#24433;&#21709;&#19981;&#26126;&#30830;&#12290;</title><link>https://arxiv.org/abs/2107.06544</link><description>&lt;p&gt;
&#31227;&#27665;&#30340;&#36194;&#23478;&#21644;&#36755;&#23478;
&lt;/p&gt;
&lt;p&gt;
Winners and losers of immigration
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2107.06544
&lt;/p&gt;
&lt;p&gt;
&#31227;&#27665;&#23545;&#24847;&#22823;&#21033;&#30340;&#32463;&#27982;&#26377;&#31215;&#26497;&#36129;&#29486;&#65292;&#20294;&#22312;&#39640;&#25216;&#33021;&#23494;&#38598;&#22411;&#24066;&#22330;&#20013;&#38599;&#20027;&#21644;&#38599;&#21592;&#26159;&#36194;&#23478;&#65292;&#20302;&#25216;&#33021;&#24066;&#22330;&#20013;&#38599;&#20027;&#26159;&#36755;&#23478;&#65292;&#32780;&#20302;&#25216;&#33021;&#21592;&#24037;&#30340;&#24433;&#21709;&#19981;&#26126;&#30830;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#19968;&#20010;&#36890;&#29992;&#22343;&#34913;&#25628;&#32034;&#21644;&#21305;&#37197;&#27169;&#22411;&#20013;&#20302;&#25216;&#33021;&#31227;&#27665;&#30340;&#24433;&#21709;&#65292;&#20854;&#20013;&#26377;&#29983;&#20135;&#20013;&#38388;&#20135;&#21697;&#30340;&#24322;&#36136;&#24037;&#20154;&#65292;&#36825;&#20123;&#20135;&#21697;&#29992;&#20110;&#29983;&#20135;&#20004;&#31181;&#26368;&#32456;&#20135;&#21697;&#12290;&#38500;&#20102;&#26412;&#22320;&#24037;&#20154;&#21644;&#38750;&#26412;&#22320;&#24037;&#20154;&#20043;&#38388;&#30340;&#20114;&#34917;&#24615;/&#26367;&#20195;&#24615;&#65292;&#25105;&#20204;&#36824;&#25506;&#35752;&#20102;&#31227;&#27665;&#22914;&#20309;&#24433;&#21709;&#26368;&#32456;&#20135;&#21697;&#30340;&#30456;&#23545;&#20215;&#26684;&#21644;&#24037;&#36164;&#12290;&#23545;&#24847;&#22823;&#21033;&#30340;&#19968;&#20010;&#24212;&#29992;&#26174;&#31034;&#20986;&#31227;&#27665;&#23545;&#22269;&#20869;&#29983;&#20135;&#24635;&#20540;&#12289;&#20844;&#20849;&#25910;&#20837;&#20197;&#21450;&#20154;&#22343;&#25552;&#20379;&#30340;&#20844;&#20849;&#21830;&#21697;&#26377;&#31215;&#26497;&#36129;&#29486;&#12290;&#39640;&#25216;&#33021;&#23494;&#38598;&#22411;&#24066;&#22330;&#30340;&#38599;&#20027;&#21644;&#38599;&#21592;&#26159;&#36194;&#23478;&#65292;&#32780;&#20302;&#25216;&#33021;&#23494;&#38598;&#22411;&#24066;&#22330;&#30340;&#38599;&#20027;&#26159;&#36755;&#23478;&#12290;&#32780;&#23545;&#20302;&#25216;&#33021;&#21592;&#24037;&#30340;&#24433;&#21709;&#21017;&#24182;&#19981;&#26126;&#30830;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2107.06544v3 Announce Type: replace  Abstract: We study the impact of low-skilled immigration in a general equilibrium search and matching model, with heterogeneous workers producing intermediate goods, which are used in the production of two final goods. In addition to complementarity/substitution between native and non-native workers, we explore how immigration affects the relative prices of final goods and wages. An application to Italy reveals a positive contribution of immigrants to GDP, public revenues, and the per capita provision of public goods. Employers and employees in the high-skilled-intensive market are winners, while losers are employers in the low-skilled-intensive market. The effects on low-skilled employees are instead inconclusive.
&lt;/p&gt;</description></item><item><title>&#20154;&#24037;&#26234;&#33021;&#31995;&#32479;&#22312;&#32416;&#27491;&#20154;&#31867;&#38169;&#35823;&#26041;&#38754;&#36215;&#21040;&#20102;&#31215;&#26497;&#20316;&#29992;&#65292;&#20294;&#27492;&#20030;&#20063;&#28508;&#22312;&#23548;&#33268;&#24515;&#29702;&#25104;&#26412;&#65292;&#24182;&#24433;&#21709;&#20154;&#30340;&#20915;&#31574;&#12290;&#36890;&#36807;&#30740;&#31350;&#32593;&#29699;&#27604;&#36187;&#20013;&#30340;Hawk-Eye&#23457;&#26597;&#31995;&#32479;&#65292;&#25105;&#20204;&#21457;&#29616;&#24341;&#20837;AI&#30417;&#30563;&#21518;&#65292;&#35009;&#21028;&#21592;&#30340;&#38169;&#35823;&#29575;&#19979;&#38477;&#65292;&#24515;&#29702;&#25104;&#26412;&#23548;&#33268;&#20182;&#20204;&#26356;&#20542;&#21521;&#20110;&#23558;&#29699;&#21028;&#20026;&#36827;&#30028;&#65292;&#20174;&#32780;&#20135;&#29983;&#20102;&#31867;&#22411;&#38169;&#21028;&#30340;&#36716;&#21464;&#12290;</title><link>http://arxiv.org/abs/2401.16754</link><description>&lt;p&gt;
AI&#30417;&#30563;&#21644;&#20154;&#31867;&#38169;&#35823;&#65306;&#26469;&#33258;&#20013;&#24515;&#27861;&#24237;&#30340;&#35777;&#25454;
&lt;/p&gt;
&lt;p&gt;
AI Oversight and Human Mistakes: Evidence from Centre Court. (arXiv:2401.16754v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.16754
&lt;/p&gt;
&lt;p&gt;
&#20154;&#24037;&#26234;&#33021;&#31995;&#32479;&#22312;&#32416;&#27491;&#20154;&#31867;&#38169;&#35823;&#26041;&#38754;&#36215;&#21040;&#20102;&#31215;&#26497;&#20316;&#29992;&#65292;&#20294;&#27492;&#20030;&#20063;&#28508;&#22312;&#23548;&#33268;&#24515;&#29702;&#25104;&#26412;&#65292;&#24182;&#24433;&#21709;&#20154;&#30340;&#20915;&#31574;&#12290;&#36890;&#36807;&#30740;&#31350;&#32593;&#29699;&#27604;&#36187;&#20013;&#30340;Hawk-Eye&#23457;&#26597;&#31995;&#32479;&#65292;&#25105;&#20204;&#21457;&#29616;&#24341;&#20837;AI&#30417;&#30563;&#21518;&#65292;&#35009;&#21028;&#21592;&#30340;&#38169;&#35823;&#29575;&#19979;&#38477;&#65292;&#24515;&#29702;&#25104;&#26412;&#23548;&#33268;&#20182;&#20204;&#26356;&#20542;&#21521;&#20110;&#23558;&#29699;&#21028;&#20026;&#36827;&#30028;&#65292;&#20174;&#32780;&#20135;&#29983;&#20102;&#31867;&#22411;&#38169;&#21028;&#30340;&#36716;&#21464;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#26426;&#22120;&#23398;&#20064;&#31639;&#27861;&#19981;&#26029;&#25552;&#21319;&#30340;&#39537;&#21160;&#19979;&#65292;&#20154;&#24037;&#26234;&#33021;&#65288;AI&#65289;&#31995;&#32479;&#24050;&#32463;&#24320;&#22987;&#22312;&#35768;&#22810;&#22330;&#21512;&#29992;&#20110;&#32416;&#27491;&#20154;&#31867;&#38169;&#35823;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#39318;&#20010;&#23454;&#22320;&#35777;&#25454;&#65292;&#35777;&#26126;&#36825;&#31181;AI&#30417;&#30563;&#20250;&#20135;&#29983;&#24515;&#29702;&#25104;&#26412;&#65292;&#24433;&#21709;&#20154;&#30340;&#20915;&#31574;&#12290;&#25105;&#20204;&#35843;&#26597;&#20102;AI&#30417;&#30563;&#21457;&#29983;&#30340;&#26368;&#39640;&#21487;&#35265;&#24615;&#22330;&#26223;&#20043;&#19968;&#65306;&#39030;&#32423;&#32593;&#29699;&#27604;&#36187;&#20013;&#35009;&#21028;&#30340;Hawk-Eye&#23457;&#26597;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#24341;&#20837;Hawk-Eye&#23457;&#26597;&#21518;&#65292;&#35009;&#21028;&#30340;&#25972;&#20307;&#38169;&#35823;&#29575;&#38477;&#20302;&#65292;&#31526;&#21512;&#24515;&#29702;&#25104;&#26412;&#34987;AI&#21542;&#23450;&#30340;&#21512;&#29702;&#24573;&#35270;&#29616;&#35937;&#12290;&#25105;&#20204;&#36824;&#21457;&#29616;&#65292;&#35009;&#21028;&#22686;&#21152;&#20102;&#23545;&#29699;&#20837;&#20869;&#30340;&#21028;&#23450;&#29575;&#65292;&#20174;&#32780;&#20135;&#29983;&#20102;&#20174;II&#31867;&#38169;&#35823;&#65288;&#23558;&#29699;&#21028;&#20026;&#20986;&#30028;&#65292;&#23454;&#38469;&#19978;&#26159;&#36827;&#30028;&#65289;&#21040;I&#31867;&#38169;&#35823;&#65288;&#23558;&#29699;&#21028;&#20026;&#36827;&#30028;&#65292;&#23454;&#38469;&#19978;&#26159;&#20986;&#30028;&#65289;&#30340;&#36716;&#21464;&#12290;&#36890;&#36807;&#23545;&#29702;&#24615;&#19981;&#27880;&#24847;&#30340;&#35009;&#21028;&#27169;&#22411;&#36827;&#34892;&#24515;&#29702;&#25104;&#26412;&#30340;&#32467;&#26500;&#20272;&#35745;&#65292;&#25105;&#20204;&#30340;&#32467;&#26524;&#34920;&#26126;&#65292;&#30001;&#20110;AI&#21542;&#23450;&#30340;&#24515;&#29702;&#25104;&#26412;&#65292;&#35009;&#21028;&#21592;&#38477;&#20302;&#20102;&#38169;&#35823;&#21028;&#23450;&#30340;&#39118;&#38505;&#24182;&#25552;&#39640;&#20102;&#29699;&#20837;&#20869;&#30340;&#21028;&#23450;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;
Powered by the increasing predictive capabilities of machine learning algorithms, artificial intelligence (AI) systems have begun to be used to overrule human mistakes in many settings. We provide the first field evidence this AI oversight carries psychological costs that can impact human decision-making. We investigate one of the highest visibility settings in which AI oversight has occurred: the Hawk-Eye review of umpires in top tennis tournaments. We find that umpires lowered their overall mistake rate after the introduction of Hawk-Eye review, in line with rational inattention given psychological costs of being overruled by AI. We also find that umpires increased the rate at which they called balls in, which produced a shift from making Type II errors (calling a ball out when in) to Type I errors (calling a ball in when out). We structurally estimate the psychological costs of being overruled by AI using a model of rational inattentive umpires, and our results suggest that because 
&lt;/p&gt;</description></item><item><title>&#35813;&#30740;&#31350;&#35780;&#20272;&#20102;&#21488;&#21271;&#30340;&#31038;&#21306;&#20132;&#36890;&#29615;&#22659;&#25913;&#21892;&#35745;&#21010;&#65292;&#21457;&#29616;&#35813;&#35745;&#21010;&#36890;&#36807;&#32472;&#21046;&#32511;&#33394;&#20154;&#34892;&#36947;&#31561;&#26041;&#24335;&#25104;&#21151;&#20943;&#23569;&#20102;&#30333;&#22825;&#20132;&#36890;&#20107;&#25925;&#21644;&#21463;&#20260;&#20154;&#25968;&#12290;</title><link>http://arxiv.org/abs/2401.16752</link><description>&lt;p&gt;
&#22686;&#24378;&#22478;&#24066;&#20132;&#36890;&#23433;&#20840;&#65306;&#23545;&#21488;&#21271;&#31038;&#21306;&#20132;&#36890;&#29615;&#22659;&#25913;&#21892;&#35745;&#21010;&#30340;&#35780;&#20272;
&lt;/p&gt;
&lt;p&gt;
Enhancing Urban Traffic Safety: An Evaluation on Taipei's Neighborhood Traffic Environment Improvement Program. (arXiv:2401.16752v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.16752
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#35780;&#20272;&#20102;&#21488;&#21271;&#30340;&#31038;&#21306;&#20132;&#36890;&#29615;&#22659;&#25913;&#21892;&#35745;&#21010;&#65292;&#21457;&#29616;&#35813;&#35745;&#21010;&#36890;&#36807;&#32472;&#21046;&#32511;&#33394;&#20154;&#34892;&#36947;&#31561;&#26041;&#24335;&#25104;&#21151;&#20943;&#23569;&#20102;&#30333;&#22825;&#20132;&#36890;&#20107;&#25925;&#21644;&#21463;&#20260;&#20154;&#25968;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#20154;&#21475;&#31264;&#23494;&#30340;&#22478;&#24066;&#22320;&#21306;&#65292;&#34892;&#20154;&#12289;&#36710;&#36742;&#21644;&#25705;&#25176;&#36710;&#20043;&#38388;&#30340;&#20114;&#21160;&#39057;&#32321;&#19988;&#22797;&#26434;&#65292;&#20132;&#36890;&#23433;&#20840;&#26159;&#19968;&#20010;&#20851;&#38190;&#38382;&#39064;&#12290;&#26412;&#25991;&#35780;&#20272;&#20102;&#21488;&#21271;&#30340;&#31038;&#21306;&#20132;&#36890;&#29615;&#22659;&#25913;&#21892;&#35745;&#21010;&#65292;&#35813;&#35745;&#21010;&#21253;&#25324;&#32472;&#21046;&#32511;&#33394;&#20154;&#34892;&#36947;&#12289;&#35843;&#25972;&#31105;&#27490;&#20572;&#36710;&#30340;&#32418;/&#40644;&#32447;&#20197;&#21450;&#22312;&#36710;&#36947;&#21644;&#23567;&#24055;&#19978;&#32472;&#21046;&#38480;&#36895;&#21644;&#20572;&#27490;/&#24930;&#34892;&#26631;&#24535;&#12290;&#21033;&#29992;&#25919;&#31574;&#23454;&#26045;&#30340;&#38454;&#27573;&#24615;&#25512;&#20986;&#21644;&#34892;&#25919;&#20132;&#36890;&#20107;&#25925;&#25968;&#25454;&#65292;&#25105;&#20204;&#21457;&#29616;&#35813;&#35745;&#21010;&#23558;&#30333;&#22825;&#20132;&#36890;&#20107;&#25925;&#20943;&#23569;&#20102;5%&#65292;&#21463;&#20260;&#20154;&#25968;&#20943;&#23569;&#20102;8%&#65292;&#32780;&#23545;&#22812;&#38388;&#20107;&#25925;&#27809;&#26377;&#26174;&#33879;&#24433;&#21709;&#12290;&#30333;&#22825;&#35745;&#21010;&#30340;&#26377;&#25928;&#24615;&#20027;&#35201;&#24402;&#21151;&#20110;&#32472;&#21046;&#30340;&#32511;&#33394;&#20154;&#34892;&#36947;&#65292;&#20805;&#36275;&#30340;&#38451;&#20809;&#20063;&#23545;&#35745;&#21010;&#30340;&#25104;&#21151;&#36215;&#21040;&#19968;&#23450;&#20316;&#29992;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;&#20687;&#32511;&#33394;&#20154;&#34892;&#36947;&#36825;&#26679;&#30340;&#25104;&#26412;&#25928;&#30410;&#39640;&#30340;&#31574;&#30053;&#22312;&#20154;&#21475;&#31264;&#23494;&#21644;&#25705;&#25176;&#36710;&#27969;&#37327;&#22823;&#30340;&#22320;&#21306;&#26159;&#26377;&#25928;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
In densely populated urban areas, where interactions between pedestrians, vehicles, and motorcycles are frequent and complex, traffic safety is a critical concern. This paper evaluates the Neighborhood Traffic Environment Improvement Program in Taipei, which involved painting green pedestrian paths, adjusting no-parking red/yellow lines, and painting speed limit and stop/slow signs on lanes and alleys. Exploiting staggered rollout of policy implementation and administrative traffic accident data, we found that the program reduced daytime traffic accidents by 5 percent and injuries by 8 percent, while having no significant impact on nighttime incidents. The effectiveness of the program during the day is mainly attributed to the painted green sidewalks, with adequate sunlight playing a part in the program's success. Our findings indicate that cost-effective strategies like green pedestrian lanes can be effective in areas with dense populations and high motorcycle traffic, as they improve
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#19968;&#20010;M/M/1&#25490;&#38431;&#27169;&#22411;&#65292;&#39038;&#23458;&#21487;&#20197;&#26681;&#25454;&#31574;&#30053;&#20915;&#23450;&#21152;&#20837;&#38431;&#21015;&#25110;&#36864;&#20986;&#38431;&#21015;&#65292;&#24182;&#19988;&#32473;&#20986;&#20102;&#19968;&#31867;&#25490;&#38431;&#21046;&#24230;&#65292;&#20351;&#24471;&#22312;&#20219;&#20309;&#21442;&#25968;&#19979;&#65292;&#31038;&#20250;&#25928;&#29575;&#34892;&#20026;&#37117;&#26159;&#22343;&#34913;&#32467;&#26524;&#12290;</title><link>http://arxiv.org/abs/2401.13812</link><description>&lt;p&gt;
&#26368;&#20248;&#25490;&#38431;&#21046;&#24230;
&lt;/p&gt;
&lt;p&gt;
Optimal Queueing Regimes. (arXiv:2401.13812v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.13812
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#19968;&#20010;M/M/1&#25490;&#38431;&#27169;&#22411;&#65292;&#39038;&#23458;&#21487;&#20197;&#26681;&#25454;&#31574;&#30053;&#20915;&#23450;&#21152;&#20837;&#38431;&#21015;&#25110;&#36864;&#20986;&#38431;&#21015;&#65292;&#24182;&#19988;&#32473;&#20986;&#20102;&#19968;&#31867;&#25490;&#38431;&#21046;&#24230;&#65292;&#20351;&#24471;&#22312;&#20219;&#20309;&#21442;&#25968;&#19979;&#65292;&#31038;&#20250;&#25928;&#29575;&#34892;&#20026;&#37117;&#26159;&#22343;&#34913;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#32771;&#34385;&#20102;&#19968;&#20010;M/M/1&#25490;&#38431;&#27169;&#22411;&#65292;&#20854;&#20013;&#39038;&#23458;&#21487;&#20197;&#26681;&#25454;&#31574;&#30053;&#20915;&#23450;&#26159;&#21542;&#21152;&#20837;&#38431;&#21015;&#12289;&#20309;&#26102;&#36864;&#20986;&#38431;&#21015;&#12290;&#25105;&#20204;&#23545;&#25490;&#38431;&#21046;&#24230;&#30340;&#31867;&#21035;&#36827;&#34892;&#20102;&#21051;&#30011;&#65292;&#20351;&#24471;&#22312;&#27169;&#22411;&#30340;&#20219;&#20309;&#21442;&#25968;&#19979;&#65292;&#31038;&#20250;&#25928;&#29575;&#34892;&#20026;&#37117;&#26159;&#22343;&#34913;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
We consider an M/M/1 queueing model where customers can strategically decide whether to join the queue or balk and when to renege. We characterize the class of queueing regimes such that, for any parameters of the model, the socially efficient behavior is an equilibrium outcome.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#21452;&#37325;&#31283;&#20581;&#20272;&#35745;&#22120;&#65292;&#20197;&#24212;&#23545;&#37051;&#23621;&#24178;&#25200;&#23545;&#20110;&#8220;&#21306;&#21035;&#20110;&#24046;&#20998;&#8221;&#31867;&#22411;&#30340;&#20272;&#35745;&#22120;&#25928;&#26524;&#30340;&#24433;&#21709;&#12290;&#22312;&#26412;&#25991;&#25552;&#20986;&#30340;&#26377;&#38480;&#20154;&#21475;&#35270;&#35282;&#19979;&#65292;&#21487;&#20197;&#22788;&#29702;&#30452;&#25509;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#20197;&#21450;&#24179;&#22343;&#28322;&#20986;&#25928;&#24212;&#65292;&#20855;&#26377;&#19968;&#23450;&#30340;&#30740;&#31350;&#20215;&#20540;&#12290;</title><link>http://arxiv.org/abs/2306.12003</link><description>&lt;p&gt;
&#21306;&#21035;&#20110;&#24046;&#20998;&#30340;&#24178;&#25200;&#25928;&#24212;&#65306;&#26377;&#38480;&#20154;&#21475;&#35270;&#35282;&#19979;&#30340;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Difference-in-Differences with Interference: A Finite Population Perspective. (arXiv:2306.12003v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.12003
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#21452;&#37325;&#31283;&#20581;&#20272;&#35745;&#22120;&#65292;&#20197;&#24212;&#23545;&#37051;&#23621;&#24178;&#25200;&#23545;&#20110;&#8220;&#21306;&#21035;&#20110;&#24046;&#20998;&#8221;&#31867;&#22411;&#30340;&#20272;&#35745;&#22120;&#25928;&#26524;&#30340;&#24433;&#21709;&#12290;&#22312;&#26412;&#25991;&#25552;&#20986;&#30340;&#26377;&#38480;&#20154;&#21475;&#35270;&#35282;&#19979;&#65292;&#21487;&#20197;&#22788;&#29702;&#30452;&#25509;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#20197;&#21450;&#24179;&#22343;&#28322;&#20986;&#25928;&#24212;&#65292;&#20855;&#26377;&#19968;&#23450;&#30340;&#30740;&#31350;&#20215;&#20540;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#35768;&#22810;&#24773;&#20917;&#19979;&#65292;&#22914;&#23545;&#22522;&#20110;&#22320;&#28857;&#30340;&#25919;&#31574;&#36827;&#34892;&#35780;&#20272;&#26102;&#65292;&#28508;&#22312;&#32467;&#26524;&#19981;&#20165;&#21462;&#20915;&#20110;&#21333;&#20301;&#26412;&#36523;&#30340;&#22788;&#29702;&#65292;&#36824;&#21462;&#20915;&#20110;&#20854;&#37051;&#23621;&#30340;&#22788;&#29702;&#12290;&#23613;&#31649;&#22914;&#27492;&#65292;&#8220;&#21306;&#21035;&#20110;&#24046;&#20998;&#8221;&#65288;DID&#65289;&#31867;&#22411;&#30340;&#20272;&#35745;&#22120;&#36890;&#24120;&#24573;&#30053;&#37051;&#23621;&#20043;&#38388;&#30340;&#24178;&#25200;&#12290;&#26412;&#25991;&#25351;&#20986;&#65292;&#22312;&#37051;&#23621;&#24178;&#25200;&#23384;&#22312;&#30340;&#24773;&#20917;&#19979;&#65292;&#32463;&#20856;&#30340;DID&#20272;&#35745;&#22120;&#36890;&#24120;&#26080;&#27861;&#35782;&#21035;&#26377;&#36259;&#30340;&#22240;&#26524;&#25928;&#24212;&#12290;&#20026;&#20102;&#23558;&#24178;&#25200;&#32467;&#26500;&#24341;&#20837;DID&#20272;&#35745;&#20013;&#65292;&#31508;&#32773;&#25552;&#20986;&#20102;&#21452;&#37325;&#31283;&#20581;&#20272;&#35745;&#22120;&#65292;&#29992;&#20110;&#22788;&#29702;&#30452;&#25509;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#20197;&#21450;&#25913;&#36827;&#21518;&#30340;&#24179;&#34892;&#36235;&#21183;&#20551;&#35774;&#19979;&#30340;&#24179;&#22343;&#28322;&#20986;&#25928;&#24212;&#12290;&#24403;&#38656;&#35201;&#32771;&#34385;&#28322;&#20986;&#25928;&#24212;&#26102;&#65292;&#36890;&#24120;&#20250;&#23545;&#25972;&#20010;&#20154;&#21475;&#36827;&#34892;&#25277;&#26679;&#12290;&#22240;&#27492;&#65292;&#26412;&#25991;&#37319;&#29992;&#20102;&#26377;&#38480;&#20154;&#21475;&#35270;&#35282;&#65292;&#21363;&#23558;&#20272;&#35745;&#37327;&#23450;&#20041;&#20026;&#20154;&#21475;&#24179;&#22343;&#20540;&#65292;&#24182;&#19988;&#25512;&#26029;&#26159;&#26377;&#26465;&#20214;&#30340;&#65292;&#22522;&#20110;&#25152;&#26377;&#20154;&#21475;&#21333;&#20301;&#30340;&#23646;&#24615;&#12290;&#26412;&#25991;&#25552;&#20986;&#30340;&#19968;&#33324;&#21644;&#32479;&#19968;&#30340;&#26041;&#27861;&#23558;&#24178;&#25200;&#25928;&#24212;&#32435;&#20837;&#21040;DID&#20272;&#35745;&#20013;&#65292;&#20855;&#26377;&#19968;&#23450;&#30340;&#30740;&#31350;&#20215;&#20540;&#12290;
&lt;/p&gt;
&lt;p&gt;
In many scenarios, such as the evaluation of place-based policies, potential outcomes are not only dependent upon the unit's own treatment but also its neighbors' treatment. In spite of this, the "difference-in-differences" (DID) type estimators typically ignore such interference among neighbors. I show in this paper that the canonical DID estimators generally do not identify interesting causal effects in the presence of neighborhood interference. To incorporate interference structure into DID estimation, I propose doubly robust estimators for the direct average treatment effect on the treated as well as the average spillover effects under a modified parallel trends assumption. When spillover effects are of interest, we often sample the entire population. Thus, I adopt a finite population perspective in the sense that the estimands are defined as population averages and inference is conditional on the attributes of all population units. The general and unified approach in this paper re
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#32452;&#35780;&#20272;&#21516;&#31867;&#20559;&#22909;&#27979;&#37327;&#25351;&#26631;&#30340;&#26631;&#20934;&#65292;&#24182;&#21457;&#29616;Liu-Lu&#39034;&#24207;&#25351;&#26631;&#21644;Naszodi-Mendonca&#26041;&#27861;&#26500;&#24314;&#30340;&#22522;&#25968;&#25351;&#26631;&#31526;&#21512;&#25152;&#26377;&#26631;&#20934;&#65292;&#32780;&#22823;&#22810;&#25968;&#25991;&#29486;&#20013;&#24120;&#29992;&#30340;&#25351;&#26631;&#19981;&#31526;&#21512;&#26631;&#20934;&#12290;</title><link>http://arxiv.org/abs/2305.00231</link><description>&lt;p&gt;
&#21516;&#31867;&#20559;&#29233;&#30340;&#21382;&#21490;&#36235;&#21183;&#65306;U&#22411;&#36824;&#26159;&#38750;U&#22411;&#65311;&#25110;&#32773;&#35828;&#65292;&#22914;&#20309;&#36873;&#25321;&#26368;&#20339;&#26631;&#20934;&#26469;&#34913;&#37327;&#21516;&#31867;&#20559;&#29233;&#30340;&#21464;&#21270;&#36235;&#21183;&#65311;
&lt;/p&gt;
&lt;p&gt;
Historical trend of homophily: U-shaped or not U-shaped? Or, how would you set a criterion to decide which criterion is better to choose a criterion?. (arXiv:2305.00231v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.00231
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#32452;&#35780;&#20272;&#21516;&#31867;&#20559;&#22909;&#27979;&#37327;&#25351;&#26631;&#30340;&#26631;&#20934;&#65292;&#24182;&#21457;&#29616;Liu-Lu&#39034;&#24207;&#25351;&#26631;&#21644;Naszodi-Mendonca&#26041;&#27861;&#26500;&#24314;&#30340;&#22522;&#25968;&#25351;&#26631;&#31526;&#21512;&#25152;&#26377;&#26631;&#20934;&#65292;&#32780;&#22823;&#22810;&#25968;&#25991;&#29486;&#20013;&#24120;&#29992;&#30340;&#25351;&#26631;&#19981;&#31526;&#21512;&#26631;&#20934;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24403;&#21487;&#23130;&#30007;&#22899;&#30340;&#21463;&#25945;&#32946;&#20998;&#24067;&#20063;&#26159;&#19990;&#20195;&#29305;&#23450;&#26102;&#65292;&#27979;&#37327;&#25945;&#32946;&#23130;&#23035;&#21516;&#31867;&#20559;&#22909;&#22312;&#20004;&#20195;&#20154;&#20043;&#38388;&#30340;&#24046;&#24322;&#26159;&#20855;&#26377;&#25361;&#25112;&#24615;&#30340;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#32452;&#35780;&#20272;&#21516;&#31867;&#20559;&#22909;&#27979;&#37327;&#25351;&#26631;&#26159;&#21542;&#36866;&#29992;&#30340;&#26631;&#20934;&#12290;&#20854;&#20013;&#19968;&#20010;&#20998;&#26512;&#26631;&#20934;&#26159;&#23545;&#19981;&#21516;&#25945;&#32946;&#31867;&#21035;&#25968;&#37327;&#30340;&#40065;&#26834;&#24615;&#35201;&#27714;&#12290;&#25105;&#20204;&#23450;&#20041;&#30340;&#21478;&#19968;&#20010;&#20998;&#26512;&#26631;&#20934;&#28041;&#21450;&#20195;&#38469;&#27969;&#21160;&#24615;&#21644;&#21516;&#31867;&#20559;&#22909;&#20043;&#38388;&#30340;&#20851;&#31995;&#12290;&#31532;&#19977;&#20010;&#26631;&#20934;&#26159;&#23454;&#35777;&#30340;&#65292;&#20851;&#27880;&#20102;&#21516;&#31867;&#20559;&#22909;&#22312;1960&#24180;&#33267;2015&#20043;&#38388;&#22312;&#32654;&#22269;&#30340;&#21382;&#21490;&#36235;&#21183;&#12290;&#23613;&#31649;Liu-Lu&#39034;&#24207;&#25351;&#26631;&#21644;Naszodi-Mendonca&#26041;&#27861;&#26500;&#24314;&#30340;&#22522;&#25968;&#25351;&#26631;&#31526;&#21512;&#25152;&#26377;&#19977;&#20010;&#26631;&#20934;&#65292;&#20294;&#22823;&#22810;&#25968;&#25991;&#29486;&#20013;&#24120;&#29992;&#30340;&#25351;&#26631;&#37117;&#19981;&#31526;&#21512;&#26631;&#20934;&#12290;&#25105;&#20204;&#30340;&#20998;&#26512;&#25581;&#31034;&#20102;&#36829;&#21453;&#26576;&#20123;&#26631;&#20934;&#19982;&#21382;&#21490;&#36235;&#21183;&#25935;&#24863;&#24615;&#20043;&#38388;&#30340;&#20851;&#31995;&#12290;
&lt;/p&gt;
&lt;p&gt;
Measuring the extent to which educational marital homophily differs in two consecutive generations is challenging when the educational distributions of marriageable men and women are also generation-specific. We propose a set of criteria that indicators may have to satisfy to be considered as suitable measures of homophily. One of our analytical criteria is on the robustness to the number of educational categories. Another analytical criterion defined by us is on the association between intergenerational mobility and homophily. A third criterion is empirical and concerns the identified historical trend of homophily, a comprehensive aspect of inequality, in the US between 1960 and 2015. While the ordinal Liu--Lu-indicator and the cardinal indicator constructed with the Naszodi--Mendonca method satisfy all three criteria, most indices commonly applied in the literature do not. Our analysis sheds light on the link between the violation of certain criteria and the sensitivity of the histor
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#22411;&#20195;&#29702;&#25910;&#32553;&#20808;&#39564;&#26041;&#27861;&#65292;&#33021;&#22815;&#22312;&#19981;&#20381;&#36182;&#20110;&#20195;&#29702;&#21464;&#37327;&#26377;&#25928;&#24615;&#30340;&#24378;&#28872;&#20551;&#35774;&#30340;&#24773;&#20917;&#19979;&#65292;&#20272;&#35745;&#36130;&#25919;&#25919;&#31574;&#20914;&#20987;&#30340;&#25928;&#24212;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#22686;&#21152;&#25919;&#24220;&#25903;&#20986;&#27604;&#20943;&#31246;&#26356;&#26377;&#25928;&#22320;&#21050;&#28608;&#32463;&#27982;&#65292;&#24182;&#26500;&#24314;&#20102;&#26032;&#30340;&#22806;&#29983;&#20195;&#29702;&#21464;&#37327;&#65292;&#21487;&#20197;&#29992;&#20110;&#20256;&#32479;&#30340;&#20195;&#29702;VAR&#26041;&#27861;&#20013;&#65292;&#19982;&#20195;&#29702;&#25910;&#32553;&#27169;&#22411;&#30340;&#32467;&#26524;&#30456;&#20284;&#12290;</title><link>http://arxiv.org/abs/2302.13066</link><description>&lt;p&gt;
&#20351;&#29992;&#26032;&#22411;&#20195;&#29702;&#25910;&#32553;&#20808;&#39564;&#20272;&#35745;&#36130;&#25919;&#25919;&#31574;&#25928;&#24212;
&lt;/p&gt;
&lt;p&gt;
Estimating the Effects of Fiscal Policy using a Novel Proxy Shrinkage Prior. (arXiv:2302.13066v2 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2302.13066
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#22411;&#20195;&#29702;&#25910;&#32553;&#20808;&#39564;&#26041;&#27861;&#65292;&#33021;&#22815;&#22312;&#19981;&#20381;&#36182;&#20110;&#20195;&#29702;&#21464;&#37327;&#26377;&#25928;&#24615;&#30340;&#24378;&#28872;&#20551;&#35774;&#30340;&#24773;&#20917;&#19979;&#65292;&#20272;&#35745;&#36130;&#25919;&#25919;&#31574;&#20914;&#20987;&#30340;&#25928;&#24212;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#22686;&#21152;&#25919;&#24220;&#25903;&#20986;&#27604;&#20943;&#31246;&#26356;&#26377;&#25928;&#22320;&#21050;&#28608;&#32463;&#27982;&#65292;&#24182;&#26500;&#24314;&#20102;&#26032;&#30340;&#22806;&#29983;&#20195;&#29702;&#21464;&#37327;&#65292;&#21487;&#20197;&#29992;&#20110;&#20256;&#32479;&#30340;&#20195;&#29702;VAR&#26041;&#27861;&#20013;&#65292;&#19982;&#20195;&#29702;&#25910;&#32553;&#27169;&#22411;&#30340;&#32467;&#26524;&#30456;&#20284;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#36130;&#25919;&#25919;&#31574;&#32467;&#26500;&#21521;&#37327;&#33258;&#22238;&#24402;&#20013;&#65292;&#19981;&#21516;&#30340;&#20195;&#29702;&#21464;&#37327;&#20250;&#24471;&#20986;&#20914;&#31361;&#30340;&#32467;&#35770;&#65292;&#24847;&#21619;&#30528;&#26576;&#20123;&#22806;&#29983;&#24615;&#20551;&#35774;&#21487;&#33021;&#26080;&#27861;&#28385;&#36275;&#12290;&#25105;&#20204;&#23558;&#25968;&#25454;&#39537;&#21160;&#35782;&#21035;&#19982;&#26032;&#22411;&#20195;&#29702;&#25910;&#32553;&#20808;&#39564;&#30456;&#32467;&#21512;&#65292;&#20351;&#25105;&#20204;&#33021;&#22815;&#22312;&#19981;&#20381;&#36182;&#20110;&#20195;&#29702;&#21464;&#37327;&#26377;&#25928;&#24615;&#30340;&#24378;&#28872;&#20551;&#35774;&#30340;&#24773;&#20917;&#19979;&#20272;&#35745;&#36130;&#25919;&#25919;&#31574;&#20914;&#20987;&#30340;&#25928;&#24212;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;&#22686;&#21152;&#25919;&#24220;&#25903;&#20986;&#26159;&#21050;&#28608;&#32463;&#27982;&#30340;&#26356;&#26377;&#25928;&#24037;&#20855;&#27604;&#20943;&#31246;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#25552;&#20379;&#35777;&#25454;&#34920;&#26126;&#65292;&#25991;&#29486;&#20013;&#24120;&#29992;&#30340;&#20195;&#29702;&#21464;&#37327;&#19982;&#32467;&#26500;&#24615;&#20914;&#20987;&#20855;&#26377;&#20869;&#29983;&#30456;&#20851;&#24615;&#65292;&#36825;&#23548;&#33268;&#20272;&#35745;&#32467;&#26524;&#23384;&#22312;&#20559;&#24046;&#12290;&#25105;&#20204;&#26500;&#24314;&#20102;&#26032;&#30340;&#22806;&#29983;&#20195;&#29702;&#21464;&#37327;&#65292;&#21487;&#20197;&#29992;&#20110;&#20256;&#32479;&#30340;&#20195;&#29702; VAR &#26041;&#27861;&#20013;&#65292;&#32467;&#26524;&#19982;&#25105;&#20204;&#30340;&#20195;&#29702;&#25910;&#32553;&#27169;&#22411;&#30456;&#20284;&#12290;
&lt;/p&gt;
&lt;p&gt;
Different proxy variables commonly used in fiscal policy SVARs lead to contradicting conclusions implying that some of the exogeneity assumptions may not be fulfilled. We combine data-driven identification with a novel proxy shrinkage prior which enables us to estimate the effects of fiscal policy shocks without relying on strong assumptions about the validity of the proxy variables. Our results suggest that increasing government spending is a more effective tool to stimulate the economy than reducing taxes. Additionally, we provide evidence that the commonly used proxies in the literature are endogenously related to the structural shocks which leads to biased estimates. We construct new exogenous proxies that can be used in the traditional proxy VAR approach resulting in similar estimates compared to our proxy shrinkage model.
&lt;/p&gt;</description></item><item><title>&#30740;&#31350;&#34920;&#26126;&#65292;&#20195;&#29702;&#20154;&#36866;&#24230;&#34920;&#29616;&#20986;&#23621;&#39640;&#20020;&#19979;&#30340;&#34892;&#20026;&#21487;&#20197;&#25552;&#39640;&#31038;&#20132;&#23398;&#20064;&#30340;&#25928;&#26524;&#65292;&#32780;&#36807;&#24230;&#30340;&#23621;&#39640;&#20020;&#19979;&#21644;&#21453;&#23621;&#39640;&#20020;&#19979;&#21017;&#20250;&#23548;&#33268;&#32467;&#26524;&#21464;&#24046;&#12290;</title><link>http://arxiv.org/abs/2301.11237</link><description>&lt;p&gt;
&#31038;&#20132;&#23398;&#20064;&#20013;&#23621;&#39640;&#20020;&#19979;&#30340;&#21361;&#23475;&#19982;&#22909;&#22788;&#12290;
&lt;/p&gt;
&lt;p&gt;
The Hazards and Benefits of Condescension in Social Learning. (arXiv:2301.11237v2 [econ.TH] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2301.11237
&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#34920;&#26126;&#65292;&#20195;&#29702;&#20154;&#36866;&#24230;&#34920;&#29616;&#20986;&#23621;&#39640;&#20020;&#19979;&#30340;&#34892;&#20026;&#21487;&#20197;&#25552;&#39640;&#31038;&#20132;&#23398;&#20064;&#30340;&#25928;&#26524;&#65292;&#32780;&#36807;&#24230;&#30340;&#23621;&#39640;&#20020;&#19979;&#21644;&#21453;&#23621;&#39640;&#20020;&#19979;&#21017;&#20250;&#23548;&#33268;&#32467;&#26524;&#21464;&#24046;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#19968;&#31181;&#38169;&#35823;&#30340;&#31038;&#20132;&#23398;&#20064;&#29615;&#22659;&#20013;&#65292;&#22914;&#26524;&#20195;&#29702;&#20154;&#35748;&#20026;&#21516;&#20276;&#30340;&#31169;&#20154;&#20449;&#24687;&#36136;&#37327;&#20302;&#20110;&#23454;&#38469;&#27700;&#24179;&#65292;&#37027;&#20040;&#20182;&#20204;&#23601;&#20250;&#34920;&#29616;&#20986;&#23621;&#39640;&#20020;&#19979;&#30340;&#34892;&#20026;&#12290;&#23558;&#20854;&#24212;&#29992;&#20110;&#26631;&#20934;&#30340;&#24207;&#21015;&#27169;&#22411;&#65292;&#25105;&#20204;&#21457;&#29616;&#20195;&#29702;&#20154;&#36866;&#24230;&#34920;&#29616;&#20986;&#23621;&#39640;&#20020;&#19979;&#30340;&#34892;&#20026;&#26102;&#65292;&#32467;&#26524;&#20250;&#24471;&#21040;&#25913;&#21892;&#65292;&#30456;&#21453;&#65292;&#36807;&#24230;&#30340;&#23621;&#39640;&#20020;&#19979;&#21644;&#21453;&#23621;&#39640;&#20020;&#19979;&#37117;&#20250;&#23548;&#33268;&#32467;&#26524;&#21464;&#24046;&#12290;
&lt;/p&gt;
&lt;p&gt;
In a misspecified social learning setting, agents are condescending if they perceive their peers as having private information that is of lower quality than it is in reality. Applying this to a standard sequential model, we show that outcomes improve when agents are mildly condescending. In contrast, too much condescension leads to worse outcomes, as does anti-condescension.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#36890;&#29992;&#26694;&#26550;&#65292;&#28085;&#30422;&#20102;&#36138;&#23146;&#21644;&#38750;&#36138;&#23146;&#20004;&#31181;&#24773;&#20917;&#65292;&#35299;&#20915;&#20102;&#20184;&#36153;&#31454;&#20215;&#26426;&#21046;&#19981;&#21344;&#20248;&#31574;&#30053;&#28608;&#21169;&#20860;&#23481;&#30340;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#36817;&#20284;&#25910;&#30410;&#21644;&#31119;&#21033;&#26368;&#20248;&#30340;&#36138;&#23146;&#30719;&#24037;&#21338;&#24328;&#20860;&#23481;&#65288;MMIC&#65289;&#12290;</title><link>http://arxiv.org/abs/2210.07793</link><description>&lt;p&gt;
&#38750;&#36138;&#23146;&#19982;&#36138;&#23146;&#30719;&#24037;&#30340;&#36138;&#24515;&#20132;&#26131;&#36153;&#26426;&#21046;
&lt;/p&gt;
&lt;p&gt;
Greedy Transaction Fee Mechanisms for (Non-)myopic Miners. (arXiv:2210.07793v3 [cs.GT] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2210.07793
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#36890;&#29992;&#26694;&#26550;&#65292;&#28085;&#30422;&#20102;&#36138;&#23146;&#21644;&#38750;&#36138;&#23146;&#20004;&#31181;&#24773;&#20917;&#65292;&#35299;&#20915;&#20102;&#20184;&#36153;&#31454;&#20215;&#26426;&#21046;&#19981;&#21344;&#20248;&#31574;&#30053;&#28608;&#21169;&#20860;&#23481;&#30340;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#36817;&#20284;&#25910;&#30410;&#21644;&#31119;&#21033;&#26368;&#20248;&#30340;&#36138;&#23146;&#30719;&#24037;&#21338;&#24328;&#20860;&#23481;&#65288;MMIC&#65289;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20998;&#25955;&#24335;&#21152;&#23494;&#36135;&#24065;&#26159;&#20381;&#36182;&#20110;&#29992;&#25143;&#21644;&#30719;&#24037;&#38388;&#22870;&#21169;&#21327;&#35843;&#20197;&#20445;&#35777;&#20854;&#27491;&#30830;&#36816;&#20316;&#24182;&#21521;&#29992;&#25143;&#25552;&#20379;&#39640;&#36136;&#37327;&#26381;&#21153;&#30340;&#25903;&#20184;&#20307;&#31995;&#12290;&#26368;&#36817;&#30340;&#25991;&#29486;&#30740;&#31350;&#20132;&#26131;&#36153;&#26426;&#21046;&#65288;TFM&#65289;&#25293;&#21334;&#30340;&#26426;&#21046;&#35774;&#35745;&#38382;&#39064;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#36890;&#29992;&#26694;&#26550;&#65292;&#28085;&#30422;&#20102;&#36138;&#23146;&#21644;&#38750;&#36138;&#23146;&#20004;&#31181;&#24773;&#20917;&#65292;&#20197;&#21450;&#29992;&#25143;&#21487;&#33021;&#30340;&#19981;&#21516;&#25112;&#30053;&#27169;&#22411;&#12290;&#22312;&#36825;&#20010;&#36890;&#29992;&#26694;&#26550;&#20013;&#65292;&#24403;&#38480;&#21046;&#20026;&#36138;&#23146;&#24773;&#20917;&#26102;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#36153;&#29575;&#30001;&#29992;&#25143;&#33258;&#20027;&#20915;&#23450;&#65292;&#22522;&#20110;&#25910;&#36153;&#24773;&#20917;&#36138;&#23146;&#36873;&#25321;&#21487;&#29992;&#20132;&#26131;&#30340;&#26426;&#21046;&#23545;&#29992;&#25143;&#32780;&#35328;&#24182;&#19981;&#26159;&#21344;&#20248;&#31574;&#30053;&#28608;&#21169;&#20860;&#23481;&#30340;&#12290;&#28982;&#32780;&#65292;&#23427;&#26377;&#19968;&#20010;&#36125;&#21494;&#26031;-&#32435;&#20160;&#22343;&#34913;&#65292;&#20351;&#24471;&#23545;&#25253;&#20215;&#36827;&#34892;&#30053;&#24494;&#24369;&#21270;&#12290;&#36890;&#36807;&#25918;&#26494;&#36825;&#31181;&#28608;&#21169;&#20860;&#23481;&#24615;&#35201;&#27714;&#65292;&#26082;&#33021;&#32469;&#36807;&#20808;&#21069;&#24037;&#20316;&#35777;&#26126;&#30340;&#19981;&#21487;&#33021;&#24615;&#32467;&#26524;&#65292;&#21448;&#33021;&#23454;&#29616;&#36817;&#20284;&#25910;&#30410;&#21644;&#31119;&#21033;&#26368;&#20248;&#30340;&#36138;&#23146;&#30719;&#24037;&#21338;&#24328;&#20860;&#23481;&#65288;MMIC&#65289;&#12290;
&lt;/p&gt;
&lt;p&gt;
Decentralized cryptocurrencies are payment systems that rely on aligning the incentives of users and miners to operate correctly and offer a high quality of service to users. Recent literature studies the mechanism design problem of the auction serving as a cryptocurrency's transaction fee mechanism (TFM). We present a general framework that captures both myopic and non-myopic settings, as well as different possible strategic models for users. Within this general framework, when restricted to the myopic case, we show that while the mechanism that requires a user to "pay-as-bid", and greedily chooses among available transactions based on their fees, is not dominant strategy incentive-compatible for users, it has a Bayesian-Nash equilibrium where bids are slightly shaded. Relaxing this incentive compatibility requirement circumvents the impossibility results proven by previous works, and allows for an approximately revenue and welfare optimal, myopic miner incentive-compatible (MMIC), an
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#27604;&#36739;&#20102;&#31616;&#21333;&#28216;&#25103;&#20013;&#22522;&#20110;&#21512;&#20316;&#21644;&#20998;&#35010;&#30340;&#20851;&#38190;&#31243;&#24230;&#27010;&#24565;&#21644;&#24046;&#20998;&#20851;&#38190;&#24615;&#27010;&#24565;&#65292;&#25552;&#20986;&#20102;&#28385;&#36275;&#25193;&#23637;&#24378;&#21333;&#35843;&#24615;&#12289;&#19981;&#20998;&#37197;&#26435;&#21147;&#32473;&#21713;&#20803;&#29609;&#23478;&#21644;&#33258;&#30001;&#39569;&#25163;&#30340;&#26032;&#27010;&#24565;&#65292;&#24182;&#20171;&#32461;&#20102;&#19968;&#20010;&#32676;&#20307;&#26426;&#20250;&#27979;&#35797;&#26469;&#32479;&#19968;&#20004;&#31181;&#35266;&#28857;&#12290;</title><link>http://arxiv.org/abs/2207.03565</link><description>&lt;p&gt;
&#31616;&#21333;&#28216;&#25103;&#20013;&#32676;&#20307;&#37325;&#35201;&#24615;&#27010;&#24565;&#30340;&#27604;&#36739;
&lt;/p&gt;
&lt;p&gt;
A Comparison of Group Criticality Notions for Simple Games. (arXiv:2207.03565v2 [econ.TH] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2207.03565
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#27604;&#36739;&#20102;&#31616;&#21333;&#28216;&#25103;&#20013;&#22522;&#20110;&#21512;&#20316;&#21644;&#20998;&#35010;&#30340;&#20851;&#38190;&#31243;&#24230;&#27010;&#24565;&#21644;&#24046;&#20998;&#20851;&#38190;&#24615;&#27010;&#24565;&#65292;&#25552;&#20986;&#20102;&#28385;&#36275;&#25193;&#23637;&#24378;&#21333;&#35843;&#24615;&#12289;&#19981;&#20998;&#37197;&#26435;&#21147;&#32473;&#21713;&#20803;&#29609;&#23478;&#21644;&#33258;&#30001;&#39569;&#25163;&#30340;&#26032;&#27010;&#24565;&#65292;&#24182;&#20171;&#32461;&#20102;&#19968;&#20010;&#32676;&#20307;&#26426;&#20250;&#27979;&#35797;&#26469;&#32479;&#19968;&#20004;&#31181;&#35266;&#28857;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#22522;&#20110;&#29609;&#23478;&#20043;&#38388;&#30340;&#21512;&#20316;&#65288;&#25110;&#20998;&#35010;&#65289;&#26469;&#23450;&#20041;&#31616;&#21333;&#21333;&#35843;&#21338;&#24328;&#20013;&#29609;&#23478;&#30340;&#20851;&#38190;&#31243;&#24230;&#27010;&#24565;&#65292;&#35201;&#27714;&#25152;&#26377;&#21442;&#19982;&#32773;&#37117;&#20855;&#26377;&#37325;&#35201;&#35282;&#33394;&#12290;&#25105;&#20204;&#23558;&#20854;&#19982;Beisbart&#25552;&#20986;&#30340;&#24046;&#20998;&#20851;&#38190;&#24615;&#27010;&#24565;&#36827;&#34892;&#27604;&#36739;&#65292;&#21518;&#32773;&#23558;&#26435;&#21147;&#23450;&#20041;&#20026;&#20854;&#20182;&#29609;&#23478;&#30041;&#19979;&#30340;&#26426;&#20250;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#25105;&#20204;&#30340;&#25552;&#35758;&#28385;&#36275;Young&#24341;&#20837;&#30340;&#24378;&#21333;&#35843;&#24615;&#30340;&#25193;&#23637;&#65292;&#19981;&#20250;&#20026;&#21713;&#20803;&#29609;&#23478;&#21644;&#33258;&#30001;&#39569;&#25163;&#20998;&#37197;&#20219;&#20309;&#26435;&#21147;&#65292;&#24182;&#19988;&#21487;&#20197;&#20174;&#26368;&#23567;&#30340;&#33719;&#32988;&#21644;&#38459;&#22622;&#32852;&#30431;&#20013;&#36731;&#26494;&#35745;&#31639;&#12290;&#25105;&#20204;&#30340;&#20998;&#26512;&#34920;&#26126;&#65292;&#36804;&#20170;&#20026;&#27490;&#23450;&#20041;&#30340;&#32676;&#20307;&#20851;&#38190;&#24615;&#24230;&#37327;&#26080;&#27861;&#34913;&#37327;&#37325;&#35201;&#30340;&#29609;&#23478;&#65292;&#21516;&#26102;&#20165;&#20445;&#25345;&#20026;&#26426;&#20250;&#24230;&#37327;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#32676;&#20307;&#26426;&#20250;&#27979;&#35797;&#26469;&#21327;&#35843;&#20004;&#31181;&#35266;&#28857;&#12290;
&lt;/p&gt;
&lt;p&gt;
We define a notion of the criticality of a player for simple monotone games based on cooperation with other players, either to form a winning coalition or to break a winning one, with an essential role for all the players involved. We compare it with the notion of differential criticality given by Beisbart that measures power as the opportunity left by other players.  We prove that our proposal satisfies an extension of the strong monotonicity introduced by Young, it assigns no power to dummy players and free riders, and it can easily be computed from the minimal winning and blocking coalitions. Our analysis shows that the measures of group criticality defined so far cannot weigh essential players while only remaining an opportunity measure. We propose a group opportunity test to reconcile the two views.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#19968;&#31181;&#35745;&#31639;&#38750;&#21487;&#24494;&#38656;&#27714;&#20989;&#25968;&#30340;&#25928;&#29992;&#20989;&#25968;&#30340;&#26041;&#27861;&#65292;&#24182;&#24471;&#21040;&#20102;&#20004;&#20010;&#26032;&#30340;&#20805;&#20998;&#21644;&#24517;&#35201;&#26465;&#20214;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36824;&#23637;&#31034;&#20102;&#21807;&#19968;&#24615;&#21644;&#24369;&#24207;&#30340;&#34920;&#31034;&#12290;&#25105;&#20204;&#23558;&#36825;&#20123;&#32467;&#26524;&#24212;&#29992;&#20110;&#35745;&#37327;&#32463;&#27982;&#29702;&#35770;&#65292;&#24182;&#24471;&#21040;&#20102;&#20851;&#20110;&#38656;&#27714;&#20989;&#25968;&#25910;&#25947;&#24615;&#21644;&#20855;&#26377;&#22343;&#21248;&#21033;&#26222;&#24076;&#33576;&#24120;&#25968;&#30340;&#32467;&#26524;&#12290;</title><link>http://arxiv.org/abs/2203.04770</link><description>&lt;p&gt;
&#38750;&#20809;&#28369;&#21487;&#31215;&#29702;&#35770;
&lt;/p&gt;
&lt;p&gt;
Non-Smooth Integrability Theory. (arXiv:2203.04770v3 [econ.TH] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2203.04770
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#19968;&#31181;&#35745;&#31639;&#38750;&#21487;&#24494;&#38656;&#27714;&#20989;&#25968;&#30340;&#25928;&#29992;&#20989;&#25968;&#30340;&#26041;&#27861;&#65292;&#24182;&#24471;&#21040;&#20102;&#20004;&#20010;&#26032;&#30340;&#20805;&#20998;&#21644;&#24517;&#35201;&#26465;&#20214;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36824;&#23637;&#31034;&#20102;&#21807;&#19968;&#24615;&#21644;&#24369;&#24207;&#30340;&#34920;&#31034;&#12290;&#25105;&#20204;&#23558;&#36825;&#20123;&#32467;&#26524;&#24212;&#29992;&#20110;&#35745;&#37327;&#32463;&#27982;&#29702;&#35770;&#65292;&#24182;&#24471;&#21040;&#20102;&#20851;&#20110;&#38656;&#27714;&#20989;&#25968;&#25910;&#25947;&#24615;&#21644;&#20855;&#26377;&#22343;&#21248;&#21033;&#26222;&#24076;&#33576;&#24120;&#25968;&#30340;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#19968;&#31181;&#20174;&#19968;&#20010;&#19981;&#21487;&#24494;&#20294;&#23616;&#37096;&#21033;&#26222;&#24076;&#33576;&#30340;&#38656;&#27714;&#20989;&#25968;&#20505;&#36873;&#20013;&#35745;&#31639;&#25928;&#29992;&#20989;&#25968;&#30340;&#26041;&#27861;&#12290;&#21033;&#29992;&#36825;&#31181;&#26041;&#27861;&#65292;&#25105;&#20204;&#24471;&#21040;&#20102;&#19968;&#20010;&#38656;&#27714;&#20989;&#25968;&#20505;&#36873;&#20026;&#38656;&#27714;&#20989;&#25968;&#30340;&#20004;&#20010;&#26032;&#30340;&#24517;&#35201;&#21644;&#20805;&#20998;&#26465;&#20214;&#12290;&#31532;&#19968;&#20010;&#26159;&#20851;&#20110;&#26031;&#25289;&#33576;&#22522;&#30697;&#38453;&#30340;&#26465;&#20214;&#65292;&#31532;&#20108;&#20010;&#26159;&#20851;&#20110;&#20559;&#24494;&#20998;&#26041;&#31243;&#30340;&#20985;&#35299;&#30340;&#23384;&#22312;&#24615;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36824;&#23637;&#31034;&#20102;&#23545;&#24212;&#20110;&#38656;&#27714;&#20989;&#25968;&#30340;&#19978;&#21322;&#36830;&#32493;&#24369;&#24207;&#26159;&#21807;&#19968;&#30340;&#65292;&#24182;&#19988;&#36825;&#20010;&#24369;&#24207;&#21487;&#20197;&#29992;&#25105;&#20204;&#35745;&#31639;&#20986;&#30340;&#25928;&#29992;&#20989;&#25968;&#34920;&#31034;&#12290;&#25105;&#20204;&#23558;&#36825;&#20123;&#32467;&#26524;&#24212;&#29992;&#20110;&#35745;&#37327;&#32463;&#27982;&#29702;&#35770;&#12290;&#39318;&#20808;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#22312;&#19968;&#20123;&#35201;&#27714;&#19979;&#65292;&#22914;&#26524;&#19968;&#20010;&#38656;&#27714;&#20989;&#25968;&#24207;&#21015;&#30456;&#23545;&#20110;&#32039;&#33268;&#25910;&#25947;&#24230;&#37327;&#25910;&#25947;&#21040;&#26576;&#20010;&#20989;&#25968;&#65292;&#37027;&#20040;&#26497;&#38480;&#20989;&#25968;&#20063;&#26159;&#19968;&#20010;&#38656;&#27714;&#20989;&#25968;&#12290;&#20854;&#27425;&#65292;&#23545;&#20110;&#22312;&#20219;&#20309;&#32039;&#33268;&#38598;&#19978;&#20855;&#26377;&#22343;&#21248;&#21033;&#26222;&#24076;&#33576;&#24120;&#25968;&#30340;&#38656;&#27714;&#20989;&#25968;&#31354;&#38388;&#22312;&#19978;&#36848;&#24230;&#37327;&#19979;&#26159;&#32039;&#33268;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study a method for calculating the utility function from a candidate of a demand function that is not differentiable, but is locally Lipschitz. Using this method, we obtain two new necessary and sufficient conditions for a candidate of a demand function to be a demand function. The first is conditions for the Slutsky matrix, and the second is the existence of a concave solution to a partial differential equation. Moreover, we show that the upper semi-continuous weak order that corresponds to the demand function is unique, and that this weak order is represented by our calculated utility function. We provide applications of these results to econometric theory. First, we show that, under several requirements, if a sequence of demand functions converges to some function with respect to the metric of compact convergence, then the limit is also a demand function. Second, the space of demand functions that have uniform Lipschitz constants on any compact set is compact under the above metr
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#22238;&#24402;&#26029;&#28857;&#35774;&#35745;&#65288;RDD&#65289;&#20998;&#26512;&#20013;&#21487;&#33021;&#23384;&#22312;&#39640;&#32500;&#21327;&#21464;&#37327;&#30340;&#24773;&#20917;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#31283;&#23450;&#30340;&#20272;&#35745;&#21644;&#25512;&#26029;&#26041;&#27861;&#65292;&#21033;&#29992;&#26680;&#26435;&#37325;&#21644;$\ell_{1}$&#24809;&#32602;&#26469;&#22788;&#29702;&#39640;&#32500;&#21327;&#21464;&#37327;&#12290;&#23454;&#39564;&#32467;&#26524;&#34920;&#26126;&#35813;&#26041;&#27861;&#22312;&#21327;&#21464;&#37327;&#25968;&#37327;&#30340;&#21464;&#21270;&#19979;&#34920;&#29616;&#40065;&#26834;&#24615;&#65292;&#30456;&#23545;&#20110;&#20256;&#32479;&#30340;&#21327;&#21464;&#37327;&#35843;&#25972;&#20272;&#35745;&#22120;&#22312;&#26576;&#20123;&#24773;&#20917;&#19979;&#26356;&#26377;&#25928;&#12290;</title><link>http://arxiv.org/abs/2109.08351</link><description>&lt;p&gt;
&#21487;&#33021;&#26377;&#22810;&#20010;&#21327;&#21464;&#37327;&#30340;&#22238;&#24402;&#26029;&#28857;&#35774;&#35745;
&lt;/p&gt;
&lt;p&gt;
Regression Discontinuity Design with Potentially Many Covariates. (arXiv:2109.08351v3 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2109.08351
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22238;&#24402;&#26029;&#28857;&#35774;&#35745;&#65288;RDD&#65289;&#20998;&#26512;&#20013;&#21487;&#33021;&#23384;&#22312;&#39640;&#32500;&#21327;&#21464;&#37327;&#30340;&#24773;&#20917;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#31283;&#23450;&#30340;&#20272;&#35745;&#21644;&#25512;&#26029;&#26041;&#27861;&#65292;&#21033;&#29992;&#26680;&#26435;&#37325;&#21644;$\ell_{1}$&#24809;&#32602;&#26469;&#22788;&#29702;&#39640;&#32500;&#21327;&#21464;&#37327;&#12290;&#23454;&#39564;&#32467;&#26524;&#34920;&#26126;&#35813;&#26041;&#27861;&#22312;&#21327;&#21464;&#37327;&#25968;&#37327;&#30340;&#21464;&#21270;&#19979;&#34920;&#29616;&#40065;&#26834;&#24615;&#65292;&#30456;&#23545;&#20110;&#20256;&#32479;&#30340;&#21327;&#21464;&#37327;&#35843;&#25972;&#20272;&#35745;&#22120;&#22312;&#26576;&#20123;&#24773;&#20917;&#19979;&#26356;&#26377;&#25928;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22238;&#24402;&#26029;&#28857;&#35774;&#35745;&#65288;RDD&#65289;&#20998;&#26512;&#20013;&#21487;&#33021;&#23384;&#22312;&#39640;&#32500;&#21327;&#21464;&#37327;&#30340;&#24773;&#20917;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#22312;&#21327;&#21464;&#37327;&#36873;&#25321;&#26102;&#36827;&#34892;&#20272;&#35745;&#21644;&#25512;&#26029;&#30340;RDD&#27169;&#22411;&#30340;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#22312;&#21327;&#21464;&#37327;&#25968;&#37327;&#19981;&#35770;&#22914;&#20309;&#37117;&#33021;&#31283;&#23450;&#22320;&#36827;&#34892;&#12290;&#25152;&#25552;&#20986;&#30340;&#26041;&#27861;&#23558;&#20351;&#29992;&#26680;&#26435;&#37325;&#30340;&#23616;&#37096;&#26041;&#27861;&#19982;$\ell_{1}$&#24809;&#32602;&#30456;&#32467;&#21512;&#65292;&#20197;&#22788;&#29702;&#39640;&#32500;&#21327;&#21464;&#37327;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#29702;&#35770;&#21644;&#25968;&#20540;&#32467;&#26524;&#65292;&#20197;&#35828;&#26126;&#25152;&#25552;&#20986;&#26041;&#27861;&#30340;&#26377;&#29992;&#24615;&#12290;&#20174;&#29702;&#35770;&#19978;&#35762;&#65292;&#25105;&#20204;&#20998;&#21035;&#20026;&#28857;&#20272;&#35745;&#21644;&#25512;&#26029;&#26041;&#27861;&#25552;&#20379;&#20102;&#39118;&#38505;&#21644;&#35206;&#30422;&#29575;&#29305;&#24615;&#12290;&#22312;&#26576;&#20123;&#29305;&#27530;&#24773;&#20917;&#19979;&#65292;&#25152;&#25552;&#20986;&#30340;&#20272;&#35745;&#22120;&#22312;&#28385;&#36275;&#39069;&#22806;&#30340;&#31232;&#30095;&#26465;&#20214;&#30340;&#20195;&#20215;&#19979;&#27604;&#20256;&#32479;&#30340;&#21327;&#21464;&#37327;&#35843;&#25972;&#20272;&#35745;&#22120;&#26356;&#26377;&#25928;&#12290;&#20174;&#25968;&#20540;&#19978;&#30475;&#65292;&#25105;&#20204;&#30340;&#27169;&#25311;&#23454;&#39564;&#21644;&#23454;&#35777;&#20363;&#23376;&#34920;&#26126;&#20102;&#25152;&#25552;&#20986;&#26041;&#27861;&#23545;&#20110;&#21327;&#21464;&#37327;&#25968;&#37327;&#22312;&#20559;&#24046;&#21644;&#26041;&#24046;&#26041;&#38754;&#30340;&#31283;&#20581;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper studies the case of possibly high-dimensional covariates in the regression discontinuity design (RDD) analysis. In particular, we propose estimation and inference methods for the RDD models with covariate selection which perform stably regardless of the number of covariates. The proposed methods combine the local approach using kernel weights with $\ell_{1}$-penalization to handle high-dimensional covariates. We provide theoretical and numerical results which illustrate the usefulness of the proposed methods. Theoretically, we present risk and coverage properties for our point estimation and inference methods, respectively. Under certain special case, the proposed estimator becomes more efficient than the conventional covariate adjusted estimator at the cost of an additional sparsity condition. Numerically, our simulation experiments and empirical example show the robust behaviors of the proposed methods to the number of covariates in terms of bias and variance for point est
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#21442;&#32771;&#20381;&#36182;&#24615;&#36873;&#25321;&#22312;&#25429;&#25417;&#39118;&#38505;&#12289;&#26102;&#38388;&#21644;&#31038;&#20250;&#20559;&#22909;&#26041;&#38754;&#30340;&#24212;&#29992;&#65292;&#20174;&#32780;&#25581;&#31034;&#20102;&#21442;&#32771;&#20381;&#36182;&#24615;&#36873;&#25321;&#22312;&#26631;&#20934;&#34892;&#20026;&#20551;&#35774;&#20013;&#30340;&#20869;&#22312;&#20381;&#36182;&#24615;&#12290;</title><link>http://arxiv.org/abs/2105.12915</link><description>&lt;p&gt;
&#26377;&#24207;&#30340;&#21442;&#32771;&#20381;&#36182;&#24615;&#36873;&#25321;
&lt;/p&gt;
&lt;p&gt;
Ordered Reference Dependent Choice. (arXiv:2105.12915v3 [econ.TH] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2105.12915
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#21442;&#32771;&#20381;&#36182;&#24615;&#36873;&#25321;&#22312;&#25429;&#25417;&#39118;&#38505;&#12289;&#26102;&#38388;&#21644;&#31038;&#20250;&#20559;&#22909;&#26041;&#38754;&#30340;&#24212;&#29992;&#65292;&#20174;&#32780;&#25581;&#31034;&#20102;&#21442;&#32771;&#20381;&#36182;&#24615;&#36873;&#25321;&#22312;&#26631;&#20934;&#34892;&#20026;&#20551;&#35774;&#20013;&#30340;&#20869;&#22312;&#20381;&#36182;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#32467;&#26500;&#20551;&#35774;&#65288;&#27604;&#22914;&#26399;&#26395;&#25928;&#29992;&#21644;&#25351;&#25968;&#25240;&#25187;&#65289;&#30340;&#36829;&#21453;&#22914;&#20309;&#19982;&#28304;&#33258;&#21442;&#32771;&#20381;&#36182;&#20559;&#22909;&#30340;&#21512;&#29702;&#24615;&#36829;&#21453;&#30456;&#36830;&#25509;&#65292;&#21363;&#20351;&#34892;&#20026;&#22312;&#21442;&#32771;&#22266;&#23450;&#24773;&#20917;&#19979;&#23436;&#20840;&#26631;&#20934;&#12290;&#38024;&#23545;&#19981;&#21516;&#30340;&#36873;&#25321;&#39046;&#22495;&#65292;&#21442;&#32771;&#20381;&#36182;&#30340;&#24191;&#20041;&#21462;&#20195;&#20219;&#24847;&#34892;&#20026;&#20551;&#35774;&#65292;&#24182;&#19988;&#20135;&#29983;&#20869;&#29983;&#22320;&#30830;&#23450;&#21442;&#32771;&#22791;&#36873;&#26041;&#26696;&#30340;&#32447;&#24615;&#39034;&#24207;&#65292;&#36827;&#32780;&#30830;&#23450;&#36873;&#25321;&#38382;&#39064;&#30340;&#20559;&#22909;&#21442;&#25968;&#12290;&#36890;&#36807;&#20351;&#29992;&#20363;&#22914;&#25928;&#29992;&#20989;&#25968;&#30340;&#20985;&#24615;&#21644;&#25240;&#25187;&#22240;&#23376;&#30340;&#32423;&#21035;&#31561;&#24050;&#30693;&#25216;&#26415;&#65292;&#21487;&#20197;&#25429;&#25417;&#20559;&#22909;&#30340;&#21464;&#21270;&#12290;&#35813;&#26694;&#26550;&#20801;&#35768;&#25105;&#20204;&#38598;&#20307;&#30740;&#31350;&#39118;&#38505;&#12289;&#26102;&#38388;&#21644;&#31038;&#20250;&#20559;&#22909;&#65292;&#20854;&#20013;&#30475;&#20284;&#29420;&#31435;&#30340;&#21453;&#24120;&#29616;&#35937;&#36890;&#36807;&#21442;&#32771;&#20381;&#36182;&#36873;&#25321;&#30340;&#38236;&#22836;&#30456;&#20114;&#36830;&#25509;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper studies how violations of structural assumptions like expected utility and exponential discounting can be connected to rationality violations that arise from reference-dependent preferences, even if behavior is fully standard when the reference is fixed. A reference-dependent generalization of arbitrarily behavioral postulates captures changing preferences across choice domains. It gives rise to a linear order that endogenously determines reference alternatives, which in turn determines the preference parameters for a choice problem. With canonical models as backbones, preference changes are captured using known technologies like the concavity of utility functions and the levels of discount factors. The framework allows us to study risk, time, and social preferences collectively, where seemingly independent anomalies are interconnected through the lens of reference-dependent choice.
&lt;/p&gt;</description></item></channel></rss>