<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#30740;&#31350;&#21457;&#29616;S\"onmez&#21644;Yenmez&#65288;2022&#65289;&#30340;&#36229;&#36807;&#36873;&#25321;&#35268;&#21017;&#34920;&#24449;&#32467;&#26524;&#26159;&#19981;&#27491;&#30830;&#30340;&#65292;&#20294;&#36890;&#36807;&#37325;&#26032;&#21046;&#23450;&#35813;&#20844;&#29702;&#65292;&#24471;&#21040;&#20102;&#27491;&#30830;&#30340;&#34920;&#24449;&#32467;&#26524;&#12290;</title><link>http://arxiv.org/abs/2305.11758</link><description>&lt;p&gt;
&#21360;&#24230;&#36890;&#36807;&#22402;&#30452;&#65292;&#27700;&#24179;&#21644;&#37325;&#21472;&#20445;&#30041;&#23454;&#26045;&#24179;&#26435;&#34892;&#21160;&#65306;&#35780;&#35770;&#12290;
&lt;/p&gt;
&lt;p&gt;
Affirmative Action in India via Vertical, Horizontal, and Overlapping Reservations: Comment. (arXiv:2305.11758v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.11758
&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#21457;&#29616;S\"onmez&#21644;Yenmez&#65288;2022&#65289;&#30340;&#36229;&#36807;&#36873;&#25321;&#35268;&#21017;&#34920;&#24449;&#32467;&#26524;&#26159;&#19981;&#27491;&#30830;&#30340;&#65292;&#20294;&#36890;&#36807;&#37325;&#26032;&#21046;&#23450;&#35813;&#20844;&#29702;&#65292;&#24471;&#21040;&#20102;&#27491;&#30830;&#30340;&#34920;&#24449;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
S\"onmez&#21644;Yenmez&#65288;2022&#65289;&#23384;&#22312;&#25216;&#26415;&#32570;&#38519;&#12290;&#35813;&#25991;&#31456;&#22768;&#31216;&#34920;&#24449;&#36229;&#36807;&#36873;&#25321;&#35268;&#21017;&#65292;&#20294;&#26410;&#27491;&#24335;&#23450;&#20041;&#20844;&#29702;&#12290;&#37492;&#20110;&#36825;&#20123;&#20844;&#29702;&#30340;&#38750;&#27491;&#24335;&#25551;&#36848;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#25152;&#22768;&#31216;&#30340;&#34920;&#24449;&#32467;&#26524;&#26159;&#19981;&#27491;&#30830;&#30340;&#12290;&#36825;&#19968;&#38169;&#35823;&#28304;&#20110;&#8220;&#36229;&#36807;&#8221;&#20844;&#29702;&#30340;&#38472;&#36848;&#12290;&#36890;&#36807;&#20005;&#26684;&#37325;&#26032;&#21046;&#23450;&#35813;&#20844;&#29702;&#65292;&#25105;&#20204;&#20462;&#22797;&#24182;&#35777;&#26126;&#20102;&#34920;&#24449;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
S\"onmez and Yenmez (2022) suffer from a technical shortcoming. The paper claims to characterize the over-and-above-choice rule, albeit without formally defining the axioms. Given the axioms' informal description, we show that the claimed characterization is incorrect. The error stems from the statement of the ``over-and-above" axiom. By rigorously re-formulating this axiom, we repair and prove the characterization result.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25506;&#35752;&#20102;&#22312;&#21046;&#36896;&#19994;&#32972;&#26223;&#19979;&#65292;&#21487;&#20449;&#12289;&#36127;&#36131;&#12289;&#36947;&#24503;&#30340;&#20154;&#24037;&#26234;&#33021;&#30340;&#36866;&#29992;&#24615;&#65292;&#24182;&#20351;&#29992;&#23454;&#20363;&#35752;&#35770;&#20102;&#27599;&#19968;&#27493;&#21487;&#33021;&#23548;&#33268;&#30340;&#20154;&#24037;&#26234;&#33021;&#20449;&#20219;&#38382;&#39064;&#65292;&#21516;&#26102;&#36824;&#25552;&#20986;&#20102;&#26410;&#26469;&#30340;&#30740;&#31350;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2305.11581</link><description>&lt;p&gt;
&#21046;&#36896;&#19994;&#21644;&#20379;&#24212;&#38142;&#20013;&#21487;&#20449;&#12289;&#36127;&#36131;&#12289;&#36947;&#24503;&#30340;&#20154;&#24037;&#26234;&#33021;&#65306;&#32508;&#36848;&#21450;&#26032;&#20852;&#30740;&#31350;&#38382;&#39064;
&lt;/p&gt;
&lt;p&gt;
Trustworthy, responsible, ethical AI in manufacturing and supply chains: synthesis and emerging research questions. (arXiv:2305.11581v1 [cs.AI])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.11581
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25506;&#35752;&#20102;&#22312;&#21046;&#36896;&#19994;&#32972;&#26223;&#19979;&#65292;&#21487;&#20449;&#12289;&#36127;&#36131;&#12289;&#36947;&#24503;&#30340;&#20154;&#24037;&#26234;&#33021;&#30340;&#36866;&#29992;&#24615;&#65292;&#24182;&#20351;&#29992;&#23454;&#20363;&#35752;&#35770;&#20102;&#27599;&#19968;&#27493;&#21487;&#33021;&#23548;&#33268;&#30340;&#20154;&#24037;&#26234;&#33021;&#20449;&#20219;&#38382;&#39064;&#65292;&#21516;&#26102;&#36824;&#25552;&#20986;&#20102;&#26410;&#26469;&#30340;&#30740;&#31350;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#23613;&#31649;&#21046;&#36896;&#19994;&#20013;&#20154;&#24037;&#26234;&#33021;&#30340;&#24212;&#29992;&#36234;&#26469;&#36234;&#26222;&#36941;&#65292;&#20294;&#23545;&#20110;&#21487;&#33021;&#24341;&#21457;&#30340;&#39118;&#38505;&#20173;&#30693;&#20043;&#29978;&#23569;&#12290;&#34429;&#28982;&#25552;&#20986;&#20102;&#21508;&#31181;&#39640;&#23618;&#26694;&#26550;&#21644;&#23450;&#20041;&#26469;&#24041;&#22266;&#28508;&#22312;&#39118;&#38505;&#65292;&#20294;&#20174;&#19994;&#32773;&#20173;&#38590;&#20197;&#29702;&#35299;&#21644;&#23454;&#26045;&#12290;&#36825;&#31181;&#32570;&#20047;&#29702;&#35299;&#20351;&#24471;&#21046;&#36896;&#19994;&#38754;&#20020;&#30528;&#22810;&#31181;&#39118;&#38505;&#65292;&#21253;&#25324;&#32452;&#32455;&#12289;&#24037;&#20154;&#20197;&#21450;&#20379;&#24212;&#21830;&#21644;&#23458;&#25143;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25506;&#35752;&#21644;&#35299;&#37322;&#20102;&#36127;&#36131;&#12289;&#36947;&#24503;&#21644;&#21487;&#20449;&#30340;&#20154;&#24037;&#26234;&#33021;&#22312;&#21046;&#36896;&#19994;&#32972;&#26223;&#19979;&#30340;&#36866;&#29992;&#24615;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#20351;&#29992;&#26426;&#22120;&#23398;&#20064;&#29983;&#21629;&#21608;&#26399;&#30340;&#25193;&#23637;&#29256;&#26412;&#65292;&#36890;&#36807;&#23454;&#20363;&#35752;&#35770;&#20102;&#27599;&#19968;&#27493;&#21487;&#33021;&#23548;&#33268;&#30340;&#20154;&#24037;&#26234;&#33021;&#20449;&#20219;&#38382;&#39064;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36824;&#25552;&#20986;&#20102;&#19968;&#20123;&#30740;&#31350;&#38382;&#39064;&#65292;&#20197;&#24110;&#21161;&#21046;&#36896;&#19994;&#30740;&#31350;&#30028;&#24341;&#39046;&#26410;&#26469;&#30340;&#30740;&#31350;&#65292;&#20197;&#33719;&#24471;&#32463;&#27982;&#21644;&#31038;&#20250;&#30340;&#21452;&#37325;&#30410;&#22788;&#12290;
&lt;/p&gt;
&lt;p&gt;
While the increased use of AI in the manufacturing sector has been widely noted, there is little understanding on the risks that it may raise in a manufacturing organisation. Although various high level frameworks and definitions have been proposed to consolidate potential risks, practitioners struggle with understanding and implementing them.  This lack of understanding exposes manufacturing to a multitude of risks, including the organisation, its workers, as well as suppliers and clients. In this paper, we explore and interpret the applicability of responsible, ethical, and trustworthy AI within the context of manufacturing. We then use a broadened adaptation of a machine learning lifecycle to discuss, through the use of illustrative examples, how each step may result in a given AI trustworthiness concern. We additionally propose a number of research questions to the manufacturing research community, in order to help guide future research so that the economic and societal benefits en
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#20154;&#24037;&#26234;&#33021;&#20840;&#29699;&#27835;&#29702;&#30740;&#31350;&#30340;&#35758;&#31243;&#65292;&#21253;&#25324;&#23454;&#35777;&#26041;&#27861;&#21644;&#35268;&#33539;&#26041;&#27861;&#12290;&#23454;&#35777;&#26041;&#27861;&#26088;&#22312;&#32472;&#21046;&#21644;&#35299;&#37322;&#20840;&#29699;&#20154;&#24037;&#26234;&#33021;&#27835;&#29702;&#65307;&#35268;&#33539;&#26041;&#27861;&#26088;&#22312;&#24320;&#21457;&#21644;&#24212;&#29992;&#20840;&#29699;&#20154;&#24037;&#26234;&#33021;&#27835;&#29702;&#26631;&#20934;&#12290;&#21516;&#26102;&#65292;&#26412;&#25991;&#25351;&#20986;&#65292;&#25506;&#32034;&#20154;&#24037;&#26234;&#33021;&#20316;&#20026;&#30417;&#31649;&#38382;&#39064;&#26159;&#20248;&#21270;&#29616;&#26377;&#19968;&#33324;&#26041;&#27861;&#30340;&#37325;&#35201;&#26426;&#20250;&#12290;</title><link>http://arxiv.org/abs/2305.11528</link><description>&lt;p&gt;
&#20154;&#24037;&#26234;&#33021;&#30340;&#20840;&#29699;&#27835;&#29702;&#65306;&#23454;&#35777;&#21644;&#35268;&#33539;&#30740;&#31350;&#30340;&#19979;&#19968;&#27493;&#12290;
&lt;/p&gt;
&lt;p&gt;
The Global Governance of Artificial Intelligence: Next Steps for Empirical and Normative Research. (arXiv:2305.11528v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.11528
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#20154;&#24037;&#26234;&#33021;&#20840;&#29699;&#27835;&#29702;&#30740;&#31350;&#30340;&#35758;&#31243;&#65292;&#21253;&#25324;&#23454;&#35777;&#26041;&#27861;&#21644;&#35268;&#33539;&#26041;&#27861;&#12290;&#23454;&#35777;&#26041;&#27861;&#26088;&#22312;&#32472;&#21046;&#21644;&#35299;&#37322;&#20840;&#29699;&#20154;&#24037;&#26234;&#33021;&#27835;&#29702;&#65307;&#35268;&#33539;&#26041;&#27861;&#26088;&#22312;&#24320;&#21457;&#21644;&#24212;&#29992;&#20840;&#29699;&#20154;&#24037;&#26234;&#33021;&#27835;&#29702;&#26631;&#20934;&#12290;&#21516;&#26102;&#65292;&#26412;&#25991;&#25351;&#20986;&#65292;&#25506;&#32034;&#20154;&#24037;&#26234;&#33021;&#20316;&#20026;&#30417;&#31649;&#38382;&#39064;&#26159;&#20248;&#21270;&#29616;&#26377;&#19968;&#33324;&#26041;&#27861;&#30340;&#37325;&#35201;&#26426;&#20250;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20154;&#24037;&#26234;&#33021;&#20195;&#34920;&#20102;&#19968;&#22330;&#28508;&#22312;&#25913;&#21464;&#20154;&#31867;&#31038;&#20250;&#30340;&#25216;&#26415;&#21464;&#38761;&#12290;&#30001;&#20110;&#20854;&#21464;&#38761;&#28508;&#21147;&#65292;&#20154;&#24037;&#26234;&#33021;&#36234;&#26469;&#36234;&#21463;&#21040;&#20840;&#29699;&#30417;&#31649;&#20030;&#25514;&#30340;&#24433;&#21709;&#12290;&#28982;&#32780;&#65292;&#21040;&#30446;&#21069;&#20026;&#27490;&#65292;&#25919;&#27835;&#23398;&#21644;&#22269;&#38469;&#20851;&#31995;&#30340;&#23398;&#32773;&#26356;&#22810;&#22320;&#20851;&#27880;&#20110;&#20154;&#24037;&#26234;&#33021;&#24212;&#29992;&#65292;&#32780;&#19981;&#26159;&#20840;&#29699;&#20154;&#24037;&#26234;&#33021;&#30417;&#31649;&#30340;&#26032;&#20852;&#26550;&#26500;&#12290;&#26412;&#25991;&#26088;&#22312;&#27010;&#36848;&#20154;&#24037;&#26234;&#33021;&#20840;&#29699;&#27835;&#29702;&#30740;&#31350;&#30340;&#35758;&#31243;&#12290;&#26412;&#25991;&#21306;&#20998;&#20102;&#20004;&#31181;&#24191;&#27867;&#30340;&#35270;&#35282;&#65306;&#19968;&#31181;&#26159;&#23454;&#35777;&#26041;&#27861;&#65292;&#26088;&#22312;&#32472;&#21046;&#21644;&#35299;&#37322;&#20840;&#29699;&#20154;&#24037;&#26234;&#33021;&#27835;&#29702;&#65307;&#21478;&#19968;&#31181;&#26159;&#35268;&#33539;&#26041;&#27861;&#65292;&#26088;&#22312;&#24320;&#21457;&#21644;&#24212;&#29992;&#36866;&#24403;&#30340;&#20840;&#29699;&#20154;&#24037;&#26234;&#33021;&#27835;&#29702;&#26631;&#20934;&#12290;&#36825;&#20004;&#31181;&#26041;&#27861;&#25552;&#20379;&#20102;&#26377;&#21161;&#20110;&#29702;&#35299;&#20154;&#24037;&#26234;&#33021;&#20840;&#29699;&#27835;&#29702;&#26032;&#20852;&#24773;&#20917;&#30340;&#38382;&#39064;&#12289;&#27010;&#24565;&#21644;&#29702;&#35770;&#12290;&#30456;&#21453;&#65292;&#25506;&#32034;&#20154;&#24037;&#26234;&#33021;&#20316;&#20026;&#30417;&#31649;&#38382;&#39064;&#25552;&#20379;&#20102;&#19968;&#20010;&#37325;&#35201;&#26426;&#20250;&#65292;&#21487;&#20197;&#20248;&#21270;&#29616;&#26377;&#30340;&#19968;&#33324;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
Artificial intelligence (AI) represents a technological upheaval with the potential to change human society. Because of its transformative potential, AI is increasingly becoming subject to regulatory initiatives at the global level. Yet, so far, scholarship in political science and international relations has focused more on AI applications than on the emerging architecture of global AI regulation. The purpose of this article is to outline an agenda for research into the global governance of AI. The article distinguishes between two broad perspectives: an empirical approach, aimed at mapping and explaining global AI governance; and a normative approach, aimed at developing and applying standards for appropriate global AI governance. The two approaches offer questions, concepts, and theories that are helpful in gaining an understanding of the emerging global governance of AI. Conversely, exploring AI as a regulatory issue offers a critical opportunity to refine existing general approach
&lt;/p&gt;</description></item><item><title>&#26412;&#31687;&#25991;&#31456;&#30740;&#31350;&#20102;&#27431;&#27954;&#32852;&#30431;AI&#27861;&#26696;&#65292;&#23545;&#38750;&#22269;&#23478;&#34892;&#20026;&#32773;&#30340;&#35268;&#21046;&#20559;&#22909;&#36827;&#34892;&#20102;&#31995;&#32479;&#20998;&#26512;&#12290;&#25152;&#26377;&#31867;&#22411;&#30340;&#38750;&#22269;&#23478;&#34892;&#20026;&#32773;&#37117;&#25903;&#25345;&#23545;AI&#36827;&#34892;&#26576;&#31181;&#24418;&#24335;&#30340;&#35268;&#21046;&#65292;&#20294;&#26159;&#22312;&#35268;&#21046;&#33539;&#22260;&#21644;&#20005;&#26684;&#24615;&#19978;&#23384;&#22312;&#26174;&#30528;&#24046;&#24322;&#65292;&#36825;&#21487;&#20197;&#35299;&#37322;&#20026;&#34892;&#19994;&#27700;&#24179;&#30340;&#31454;&#20105;&#21644;&#27861;&#35268;&#21487;&#33021;&#24102;&#26469;&#30340;&#20998;&#37197;&#32467;&#26524;&#24046;&#24322;&#12290;</title><link>http://arxiv.org/abs/2305.11523</link><description>&lt;p&gt;
&#27431;&#27954;&#32852;&#30431;&#30340;&#20154;&#24037;&#26234;&#33021;&#35268;&#21046;: &#25506;&#31350;&#38750;&#22269;&#23478;&#34892;&#20026;&#32773;&#30340;&#20559;&#22909;
&lt;/p&gt;
&lt;p&gt;
AI Regulation in the European Union: Examining Non-State Actor Preferences. (arXiv:2305.11523v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.11523
&lt;/p&gt;
&lt;p&gt;
&#26412;&#31687;&#25991;&#31456;&#30740;&#31350;&#20102;&#27431;&#27954;&#32852;&#30431;AI&#27861;&#26696;&#65292;&#23545;&#38750;&#22269;&#23478;&#34892;&#20026;&#32773;&#30340;&#35268;&#21046;&#20559;&#22909;&#36827;&#34892;&#20102;&#31995;&#32479;&#20998;&#26512;&#12290;&#25152;&#26377;&#31867;&#22411;&#30340;&#38750;&#22269;&#23478;&#34892;&#20026;&#32773;&#37117;&#25903;&#25345;&#23545;AI&#36827;&#34892;&#26576;&#31181;&#24418;&#24335;&#30340;&#35268;&#21046;&#65292;&#20294;&#26159;&#22312;&#35268;&#21046;&#33539;&#22260;&#21644;&#20005;&#26684;&#24615;&#19978;&#23384;&#22312;&#26174;&#30528;&#24046;&#24322;&#65292;&#36825;&#21487;&#20197;&#35299;&#37322;&#20026;&#34892;&#19994;&#27700;&#24179;&#30340;&#31454;&#20105;&#21644;&#27861;&#35268;&#21487;&#33021;&#24102;&#26469;&#30340;&#20998;&#37197;&#32467;&#26524;&#24046;&#24322;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38543;&#30528;&#20154;&#24037;&#26234;&#33021;&#65288;AI&#65289;&#30340;&#21457;&#23637;&#21644;&#24212;&#29992;&#19981;&#26029;&#22686;&#38271;&#65292;&#25919;&#31574;&#21046;&#23450;&#32773;&#36234;&#26469;&#36234;&#22312;&#21162;&#21147;&#35299;&#20915;&#22914;&#20309;&#35268;&#21046;&#35813;&#25216;&#26415;&#30340;&#38382;&#39064;&#12290;&#26368;&#20855;&#24433;&#21709;&#21147;&#30340;&#22269;&#38469;&#20513;&#35758;&#26159;&#27431;&#27954;&#32852;&#30431;&#65288;EU&#65289;&#30340;AI&#27861;&#26696;&#65292;&#26088;&#22312;&#24314;&#31435;&#31532;&#19968;&#20010;&#20840;&#38754;&#30340;AI&#35268;&#21046;&#26694;&#26550;&#12290;&#26412;&#25991;&#39318;&#27425;&#31995;&#32479;&#20998;&#26512;&#20102;&#38750;&#22269;&#23478;&#34892;&#20026;&#32773;&#23545;&#20154;&#24037;&#26234;&#33021;&#22269;&#38469;&#35268;&#21046;&#30340;&#20559;&#22909;&#65292;&#37325;&#28857;&#30740;&#31350;&#20102;EU AI&#27861;&#26696;&#30340;&#24773;&#20917;&#12290;&#22312;&#29702;&#35770;&#19978;&#65292;&#25105;&#20204;&#38416;&#36848;&#20102;&#21830;&#19994;&#34892;&#20026;&#32773;&#21644;&#20854;&#20182;&#38750;&#22269;&#23478;&#34892;&#20026;&#32773;&#22312;&#19981;&#21516;&#30340;AI&#34892;&#19994;&#31454;&#20105;&#26465;&#20214;&#19979;&#30340;&#35268;&#21046;&#20559;&#22909;&#30340;&#35770;&#28857;&#12290;&#22312;&#32463;&#39564;&#19978;&#65292;&#25105;&#20204;&#20351;&#29992;&#20851;&#20110;&#27431;&#27954;AI&#35268;&#21046;&#30340;&#20844;&#20849;&#21672;&#35810;&#20013;&#38750;&#22269;&#23478;&#34892;&#20026;&#32773;&#20559;&#22909;&#30340;&#25968;&#25454;&#26469;&#27979;&#35797;&#36825;&#20123;&#26399;&#26395;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#32467;&#26524;&#26377;&#19977;&#20010;&#26041;&#38754;&#12290;&#39318;&#20808;&#65292;&#25152;&#26377;&#31867;&#22411;&#30340;&#38750;&#22269;&#23478;&#34892;&#20026;&#32773;&#37117;&#34920;&#36798;&#20102;&#23545;AI&#30340;&#25285;&#24551;&#65292;&#24182;&#25903;&#25345;&#20197;&#26576;&#31181;&#24418;&#24335;&#35268;&#21046;AI&#12290;&#20854;&#27425;&#65292;&#23613;&#31649;&#22914;&#27492;&#65292;&#19981;&#21516;&#31867;&#22411;&#30340;&#38750;&#22269;&#23478;&#34892;&#20026;&#32773;&#22312;AI&#30340;&#35268;&#21046;&#20005;&#26684;&#24615;&#21644;&#33539;&#22260;&#26041;&#38754;&#23384;&#22312;&#26174;&#30528;&#24046;&#24322;&#12290;&#31532;&#19977;&#65292;&#36825;&#20123;&#24046;&#24322;&#37096;&#20998;&#21487;&#20197;&#36890;&#36807;&#35268;&#21046;&#21487;&#33021;&#24102;&#26469;&#30340;&#34892;&#19994;&#27700;&#24179;&#31454;&#20105;&#21644;&#20998;&#37197;&#32467;&#26524;&#30340;&#24046;&#24322;&#26469;&#35299;&#37322;&#12290;&#24635;&#20307;&#32780;&#35328;&#65292;&#25105;&#20204;&#30340;&#20998;&#26512;&#25581;&#31034;&#20102;AI&#35268;&#21046;&#30340;&#22797;&#26434;&#21644;&#26377;&#20105;&#35758;&#30340;&#25919;&#27835;&#65292;&#19981;&#20165;&#22312;&#27431;&#30431;&#20869;&#37096;&#65292;&#32780;&#19988;&#36229;&#36234;&#27431;&#30431;&#30340;&#32972;&#26223;&#19979;&#20063;&#26159;&#22914;&#27492;&#12290;
&lt;/p&gt;
&lt;p&gt;
As the development and use of artificial intelligence (AI) continues to grow, policymakers are increasingly grappling with the question of how to regulate this technology. The most far-reaching international initiative is the European Union (EU) AI Act, which aims to establish the first comprehensive framework for regulating AI. In this article, we offer the first systematic analysis of non-state actor preferences toward international regulation of AI, focusing on the case of the EU AI Act. Theoretically, we develop an argument about the regulatory preferences of business actors and other non-state actors under varying conditions of AI sector competitiveness. Empirically, we test these expectations using data on non-state actor preferences from public consultations on European AI regulation. Our findings are threefold. First, all types of non-state actors express concerns about AI and support regulation in some form. Second, there are nonetheless significant differences across actor ty
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#35752;&#35770;&#20102;&#20351;&#29992;&#20154;&#24037;&#26234;&#33021;&#20316;&#20026;&#22806;&#37096;&#20195;&#26367;&#24037;&#20855;&#65292;&#25198;&#28436;&#20122;&#24403;&#183;&#26031;&#23494;&#30340;&#20844;&#27491;&#26049;&#35266;&#32773;&#35282;&#33394;&#30340;&#21487;&#33021;&#24615;&#65292;&#20197;&#25552;&#20379;&#26356;&#20840;&#38754;&#30340;&#36947;&#24503;&#35780;&#20272;&#35270;&#35282;&#12290;</title><link>http://arxiv.org/abs/2305.11519</link><description>&lt;p&gt;
&#20154;&#24037;&#26234;&#33021;&#20316;&#20026;&#20122;&#24403;&#183;&#26031;&#23494;&#30340;&#20844;&#27491;&#26049;&#35266;&#32773;&#30340;&#36947;&#24503;&#20195;&#29702;
&lt;/p&gt;
&lt;p&gt;
Artificial intelligence moral agent as Adam Smith's impartial spectator. (arXiv:2305.11519v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.11519
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#35752;&#35770;&#20102;&#20351;&#29992;&#20154;&#24037;&#26234;&#33021;&#20316;&#20026;&#22806;&#37096;&#20195;&#26367;&#24037;&#20855;&#65292;&#25198;&#28436;&#20122;&#24403;&#183;&#26031;&#23494;&#30340;&#20844;&#27491;&#26049;&#35266;&#32773;&#35282;&#33394;&#30340;&#21487;&#33021;&#24615;&#65292;&#20197;&#25552;&#20379;&#26356;&#20840;&#38754;&#30340;&#36947;&#24503;&#35780;&#20272;&#35270;&#35282;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20122;&#24403;&#183;&#26031;&#23494;&#21457;&#23637;&#20102;&#19968;&#31181;&#36947;&#24503;&#21746;&#23398;&#65292;&#35748;&#20026;&#36890;&#36807;&#23457;&#38382;&#25105;&#20204;&#20869;&#22312;&#30340;&#20844;&#27491;&#26049;&#35266;&#32773;&#20570;&#20986;&#26356;&#22909;&#30340;&#20915;&#31574;&#12290;&#25105;&#20204;&#35752;&#35770;&#20102;&#20351;&#29992;&#19968;&#20010;&#22806;&#37096;&#30340;&#12289;&#38750;&#22522;&#20110;&#20154;&#31867;&#30340;&#20195;&#26367;&#24037;&#20855;&#30340;&#21487;&#33021;&#24615;&#65292;&#23427;&#23558;&#22686;&#24378;&#25105;&#20204;&#30340;&#20869;&#22312;&#24605;&#32500;&#36807;&#31243;&#65292;&#25198;&#28436;&#20844;&#27491;&#26049;&#35266;&#32773;&#30340;&#35282;&#33394;&#12290;&#36825;&#31181;&#24037;&#20855;&#23558;&#25317;&#26377;&#26356;&#22810;&#30340;&#20851;&#20110;&#19990;&#30028;&#30340;&#30693;&#35782;&#65292;&#26356;&#20844;&#27491;&#65292;&#25552;&#20379;&#26356;&#20840;&#38754;&#30340;&#36947;&#24503;&#35780;&#20272;&#35270;&#35282;&#12290;
&lt;/p&gt;
&lt;p&gt;
Adam Smith developed a version of moral philosophy where better decisions are made by interrogating an impartial spectator within us. We discuss the possibility of using an external non-human-based substitute tool that would augment our internal mental processes and play the role of the impartial spectator. Such tool would have more knowledge about the world, be more impartial, and would provide a more encompassing perspective on moral assessment.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#20171;&#32461;&#20102;&#22522;&#20110;&#22343;&#34913;&#27010;&#24565;&#30340;&#20844;&#24179;&#20998;&#37197;&#31639;&#27861;A-CEEI&#65292;&#24320;&#21457;&#20102;&#19968;&#31181;&#26032;&#30340;&#21551;&#21457;&#24335;&#31639;&#27861;&#65292;&#20351;&#25105;&#20204;&#31532;&#19968;&#27425;&#33021;&#22815;&#23545;&#30495;&#23454;&#19990;&#30028;&#30340;&#36755;&#20837;&#36827;&#34892;&#23454;&#39564;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#21363;&#20351;&#22312;&#31526;&#21512;EF-TB&#21644;SP-L&#23646;&#24615;&#30340;&#29616;&#23454;&#23454;&#26045;&#20013;&#65292;&#20195;&#29702;&#20063;&#21487;&#33021;&#26377;&#24778;&#20154;&#32780;&#21512;&#29702;&#30340;&#19981;&#30495;&#23454;&#25253;&#21578;&#20559;&#31163;&#12290;</title><link>http://arxiv.org/abs/2305.11406</link><description>&lt;p&gt;
&#22522;&#20110;&#22343;&#34913;&#27010;&#24565;&#30340;&#20844;&#24179;&#20998;&#37197;&#30340;&#23454;&#29992;&#31639;&#27861;&#21644;&#23454;&#39564;&#35777;&#26126;&#65288;A-CEEI&#65289;
&lt;/p&gt;
&lt;p&gt;
Practical algorithms and experimentally validated incentives for equilibrium-based fair division (A-CEEI). (arXiv:2305.11406v1 [cs.GT])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.11406
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#22522;&#20110;&#22343;&#34913;&#27010;&#24565;&#30340;&#20844;&#24179;&#20998;&#37197;&#31639;&#27861;A-CEEI&#65292;&#24320;&#21457;&#20102;&#19968;&#31181;&#26032;&#30340;&#21551;&#21457;&#24335;&#31639;&#27861;&#65292;&#20351;&#25105;&#20204;&#31532;&#19968;&#27425;&#33021;&#22815;&#23545;&#30495;&#23454;&#19990;&#30028;&#30340;&#36755;&#20837;&#36827;&#34892;&#23454;&#39564;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#21363;&#20351;&#22312;&#31526;&#21512;EF-TB&#21644;SP-L&#23646;&#24615;&#30340;&#29616;&#23454;&#23454;&#26045;&#20013;&#65292;&#20195;&#29702;&#20063;&#21487;&#33021;&#26377;&#24778;&#20154;&#32780;&#21512;&#29702;&#30340;&#19981;&#30495;&#23454;&#25253;&#21578;&#20559;&#31163;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#8220;&#31561;&#25910;&#20837;&#36817;&#20284;&#31454;&#20105;&#22343;&#34913;&#8221;&#65288;A-CEEI&#65289;&#26159;&#19968;&#31181;&#22522;&#20110;&#22343;&#34913;&#27010;&#24565;&#29992;&#20110;&#23558;&#31163;&#25955;&#29289;&#21697;&#20844;&#24179;&#20998;&#37197;&#32473;&#24102;&#26377;&#32452;&#21512;&#38656;&#27714;&#30340;&#20195;&#29702;&#30340;&#35299;&#20915;&#26041;&#26696;&#27010;&#24565;&#12290;&#22312;&#29702;&#35770;&#19978;&#24050;&#32463;&#30693;&#36947;&#65292;&#22312;&#28176;&#36817;&#22823;&#24066;&#22330;&#19978;&#65292;&#23545;&#20110;&#28608;&#21169;&#25514;&#26045;&#65292;A-CEEI&#26426;&#21046;&#26159;&#8220;&#26080;&#23241;&#22930;&#21487;&#20294;&#39035;&#30772;&#22351;&#24179;&#25163;&#8221;&#30340;&#65288;EF-TB&#65289;&#65292;&#36825;&#24847;&#21619;&#30528;&#23427;&#26159;&#8220;&#22823;&#33539;&#22260;&#19978;&#30340;&#31574;&#30053;&#35777;&#26126;&#8221;&#65288;SP-L&#65289;&#12290;&#20174;&#35745;&#31639;&#30340;&#35282;&#24230;&#26469;&#30475;&#65292;&#35745;&#31639;&#22343;&#34913;&#35299;&#26159;&#19968;&#31181;&#35745;&#31639;&#19978;&#19981;&#21487;&#34892;&#30340;&#38382;&#39064;&#65288;&#22312;&#26368;&#22351;&#30340;&#24773;&#20917;&#19979;&#65292;&#20551;&#35774; $\textsf{PPAD} \neq \textsf {FP}$&#65289;&#12290;&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#31181;&#26032;&#30340;&#21551;&#21457;&#24335;&#31639;&#27861;&#65292;&#20854;&#24615;&#33021;&#27604;&#20043;&#21069;&#30340;&#26368;&#20808;&#36827;&#31639;&#27861;&#39640;&#20986;&#22810;&#20010;&#25968;&#37327;&#32423;&#12290;&#36825;&#31181;&#26356;&#24555;&#30340;&#26032;&#31639;&#27861;&#20351;&#25105;&#20204;&#31532;&#19968;&#27425;&#33021;&#22815;&#23545;&#30495;&#23454;&#19990;&#30028;&#30340;&#36755;&#20837;&#36827;&#34892;&#23454;&#39564;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#21363;&#20351;&#22312;&#31526;&#21512;EF-TB&#21644;SP-L&#23646;&#24615;&#30340;&#29616;&#23454;&#23454;&#26045;&#20013;&#65292;&#20195;&#29702;&#20063;&#21487;&#33021;&#26377;&#24778;&#20154;&#32780;&#21512;&#29702;&#30340;&#19981;&#30495;&#23454;&#25253;&#21578;&#20559;&#31163;&#12290;
&lt;/p&gt;
&lt;p&gt;
Approximate Competitive Equilibrium from Equal Incomes (A-CEEI) is an equilibrium-based solution concept for fair division of discrete items to agents with combinatorial demands. In theory, it is known that in asymptotically large markets:  1. For incentives, the A-CEEI mechanism is Envy-Free-but-for-Tie-Breaking (EF-TB), which implies that it is Strategyproof-in-the-Large (SP-L).  2. From a computational perspective, computing the equilibrium solution is unfortunately a computationally intractable problem (in the worst-case, assuming $\textsf{PPAD}\ne \textsf{FP}$).  We develop a new heuristic algorithm that outperforms the previous state-of-the-art by multiple orders of magnitude. This new, faster algorithm lets us perform experiments on real-world inputs for the first time. We discover that with real-world preferences, even in a realistic implementation that satisfies the EF-TB and SP-L properties, agents may have surprisingly simple and plausible deviations from truthful reporting 
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25506;&#35752;&#20102;&#22914;&#20309;&#24212;&#29992;&#22312;&#32447;&#23398;&#20064;&#30340;&#26041;&#27861;&#20248;&#21270;&#21019;&#20316;&#32773;&#32463;&#27982;&#23398;&#20013;&#30340;&#24179;&#21488;&#25910;&#30410;&#65292;&#20998;&#26512;&#21644;&#27604;&#36739;&#20102;&#22522;&#20110;&#22238;&#25253;&#30340;&#21644;&#22522;&#20110;&#29305;&#24449;&#30340;&#20004;&#31181;&#21512;&#21516;&#31867;&#22411;&#12290;</title><link>http://arxiv.org/abs/2305.11381</link><description>&lt;p&gt;
&#21019;&#20316;&#32773;&#32463;&#27982;&#23398;&#20013;&#30340;&#22312;&#32447;&#23398;&#20064;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Online Learning in a Creator Economy. (arXiv:2305.11381v1 [cs.GT])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.11381
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25506;&#35752;&#20102;&#22914;&#20309;&#24212;&#29992;&#22312;&#32447;&#23398;&#20064;&#30340;&#26041;&#27861;&#20248;&#21270;&#21019;&#20316;&#32773;&#32463;&#27982;&#23398;&#20013;&#30340;&#24179;&#21488;&#25910;&#30410;&#65292;&#20998;&#26512;&#21644;&#27604;&#36739;&#20102;&#22522;&#20110;&#22238;&#25253;&#30340;&#21644;&#22522;&#20110;&#29305;&#24449;&#30340;&#20004;&#31181;&#21512;&#21516;&#31867;&#22411;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21019;&#20316;&#32773;&#32463;&#27982;&#23398;&#38761;&#26032;&#20102;&#36890;&#36807;&#22312;&#32447;&#24179;&#21488;&#33719;&#21462;&#21033;&#28070;&#30340;&#26041;&#24335;&#12290;&#26412;&#25991;&#36890;&#36807;&#23558;&#21019;&#20316;&#32773;&#32463;&#27982;&#23398;&#24314;&#27169;&#20026;&#29992;&#25143;&#12289;&#24179;&#21488;&#21644;&#20869;&#23481;&#21019;&#20316;&#32773;&#20043;&#38388;&#30340;&#19977;&#26041;&#21338;&#24328;&#65292;&#25506;&#35752;&#20102;&#22914;&#20309;&#24212;&#29992;&#22312;&#32447;&#23398;&#20064;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#21512;&#21516;&#21644;&#25512;&#33616;&#31995;&#32479;&#20248;&#21270;&#24179;&#21488;&#25910;&#30410;&#12290;&#35813;&#30740;&#31350;&#20027;&#35201;&#20998;&#26512;&#21644;&#27604;&#36739;&#20102;&#20004;&#31181;&#31867;&#22411;&#30340;&#21512;&#21516;&#65306;&#22522;&#20110;&#22238;&#25253;&#30340;&#21512;&#21516;&#21644;&#22522;&#20110;&#29305;&#24449;&#30340;&#21512;&#21516;&#12290;
&lt;/p&gt;
&lt;p&gt;
The creator economy has revolutionized the way individuals can profit through online platforms. In this paper, we initiate the study of online learning in the creator economy by modeling the creator economy as a three-party game between the users, platform, and content creators, with the platform interacting with the content creator under a principal-agent model through contracts to encourage better content. Additionally, the platform interacts with the users to recommend new content, receive an evaluation, and ultimately profit from the content, which can be modeled as a recommender system.  Our study aims to explore how the platform can jointly optimize the contract and recommender system to maximize the utility in an online learning fashion. We primarily analyze and compare two families of contracts: return-based contracts and feature-based contracts. Return-based contracts pay the content creator a fraction of the reward the platform gains. In contrast, feature-based contracts pay 
&lt;/p&gt;</description></item><item><title>&#20449;&#29992;&#21345;&#26368;&#20302;&#25903;&#20184;&#37329;&#39069;&#30340;&#38170;&#23450;&#25928;&#24212;&#23545;&#20110;&#28040;&#36153;&#32773;&#30340;&#25903;&#20184;&#34892;&#20026;&#20135;&#29983;&#20102;&#26174;&#33879;&#30340;&#24433;&#21709;&#65292;&#24182;&#25552;&#20986;&#20102;&#21435;&#38500;&#38170;&#23450;&#24178;&#39044;&#25514;&#26045;&#26469;&#25913;&#21892;&#28040;&#36153;&#32773;&#30340;&#25903;&#20184;&#20064;&#24815;&#12290;</title><link>http://arxiv.org/abs/2305.11375</link><description>&lt;p&gt;
&#20449;&#29992;&#21345;&#27424;&#27454;&#30340;&#38170;&#23450;&#25928;&#24212;
&lt;/p&gt;
&lt;p&gt;
Weighing Anchor on Credit Card Debt. (arXiv:2305.11375v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.11375
&lt;/p&gt;
&lt;p&gt;
&#20449;&#29992;&#21345;&#26368;&#20302;&#25903;&#20184;&#37329;&#39069;&#30340;&#38170;&#23450;&#25928;&#24212;&#23545;&#20110;&#28040;&#36153;&#32773;&#30340;&#25903;&#20184;&#34892;&#20026;&#20135;&#29983;&#20102;&#26174;&#33879;&#30340;&#24433;&#21709;&#65292;&#24182;&#25552;&#20986;&#20102;&#21435;&#38500;&#38170;&#23450;&#24178;&#39044;&#25514;&#26045;&#26469;&#25913;&#21892;&#28040;&#36153;&#32773;&#30340;&#25903;&#20184;&#20064;&#24815;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#21457;&#29616;&#65292;&#35768;&#22810;&#27809;&#26377;&#36130;&#21153;&#22256;&#22659;&#30340;&#28040;&#36153;&#32773;&#20250;&#36873;&#25321;&#25903;&#20184;&#25110;&#25509;&#36817;&#25903;&#20184;&#26368;&#20302;&#37329;&#39069;&#65292;&#36825;&#31181;&#27169;&#24335;&#38590;&#20197;&#29992;&#32463;&#27982;&#22240;&#32032;&#26469;&#35299;&#37322;&#65292;&#20294;&#21487;&#20197;&#36890;&#36807;&#32473;&#28040;&#36153;&#32773;&#21576;&#29616;&#30340;&#26368;&#20302;&#20184;&#27454;&#20449;&#24687;&#20316;&#20026;&#38170;&#23450;&#22240;&#32032;&#26469;&#35299;&#37322;&#12290;&#22312;Stewart&#65288;2009&#65289;&#30340;&#22522;&#30784;&#19978;&#65292;&#25105;&#20204;&#36827;&#34892;&#20102;&#19968;&#20010;&#20551;&#35774;&#30340;&#20449;&#29992;&#21345;&#25903;&#20184;&#23454;&#39564;&#65292;&#20197;&#27979;&#35797;&#21435;&#38500;&#38170;&#23450;&#25928;&#24212;&#30340;&#24178;&#39044;&#25514;&#26045;&#12290;&#36825;&#31181;&#24178;&#39044;&#25514;&#26045;&#26377;&#25928;&#22320;&#38450;&#27490;&#28040;&#36153;&#32773;&#36873;&#25321;&#21512;&#21516;&#26368;&#20302;&#25903;&#20184;&#37329;&#39069;&#12290;&#23427;&#36824;&#25552;&#39640;&#20102;&#20182;&#20204;&#30340;&#24179;&#22343;&#20184;&#27454;&#27700;&#24179;&#65292;&#24182;&#25913;&#21464;&#20102;&#20184;&#27454;&#20998;&#24067;&#12290;&#36890;&#36807;&#21435;&#38500;&#26368;&#20302;&#25903;&#20184;&#37329;&#39069;&#30340;&#38170;&#23450;&#65292;&#28040;&#36153;&#32773;&#26085;&#30410;&#20542;&#21521;&#20110;&#36873;&#25321;&#20840;&#39069;&#20184;&#27454;-&#36825;&#21487;&#33021;&#25104;&#20026;&#28040;&#36153;&#32773;&#30340;&#30446;&#26631;&#20184;&#27454;&#12290;&#25105;&#20204;&#30340;&#21019;&#26032;&#22312;&#20110;&#23558;&#23454;&#39564;&#21709;&#24212;&#19982;&#35843;&#26597;&#21709;&#24212;&#21644;&#23454;&#38469;&#20449;&#29992;&#21345;&#20184;&#27454;&#34892;&#20026;&#30456;&#38142;&#25509;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#36825;&#31181;&#24178;&#39044;&#25514;&#26045;&#22823;&#22823;&#25552;&#39640;&#20102;&#28040;&#36153;&#32773;&#30340;&#20184;&#27454;&#27700;&#24179;&#12290;
&lt;/p&gt;
&lt;p&gt;
We find it is common for consumers who are not in financial distress to make credit card payments at or close to the minimum. This pattern is difficult to reconcile with economic factors but can be explained by minimum payment information presented to consumers acting as an anchor that weighs payments down. Building on Stewart (2009), we conduct a hypothetical credit card payment experiment to test an intervention to de-anchor payment choices. This intervention effectively stops consumers selecting payments at the contractual minimum. It also increases their average payments, as well as shifting the distribution of payments. By de-anchoring choices from the minimum, consumers increasingly choose the full payment amount - which potentially seems to act as a target payment for consumers. We innovate by linking the experimental responses to survey responses on financial distress and to actual credit card payment behaviours. We find that the intervention largely increases payments made by 
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#38024;&#23545;&#20013;&#22830;&#21171;&#21160;&#24066;&#22330;&#20013;&#38754;&#35797;&#21305;&#37197;&#30340;&#38477;&#26412;&#25552;&#25928;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#22810;&#23545;&#22810;&#38754;&#35797;&#21305;&#37197;&#26426;&#21046;&#65292;&#24182;&#20026;&#21508;&#31181;&#26426;&#21046;&#25552;&#20379;&#29702;&#35770;&#20445;&#35777;&#12290;</title><link>http://arxiv.org/abs/2305.11350</link><description>&lt;p&gt;
&#38543;&#26426;&#24066;&#22330;&#20013;&#30340;&#38754;&#35797;&#21305;&#37197;
&lt;/p&gt;
&lt;p&gt;
Interviewing Matching in Random Markets. (arXiv:2305.11350v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.11350
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#38024;&#23545;&#20013;&#22830;&#21171;&#21160;&#24066;&#22330;&#20013;&#38754;&#35797;&#21305;&#37197;&#30340;&#38477;&#26412;&#25552;&#25928;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#22810;&#23545;&#22810;&#38754;&#35797;&#21305;&#37197;&#26426;&#21046;&#65292;&#24182;&#20026;&#21508;&#31181;&#26426;&#21046;&#25552;&#20379;&#29702;&#35770;&#20445;&#35777;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#35768;&#22810;&#20013;&#22830;&#21171;&#21160;&#21147;&#24066;&#22330;&#19978;&#65292;&#27714;&#32844;&#32773;&#22312;&#21442;&#19982;&#21305;&#37197;&#21069;&#20250;&#19982;&#28508;&#22312;&#38599;&#20027;&#36827;&#34892;&#38754;&#35797;&#12290;&#19968;&#20010;&#26174;&#33879;&#30340;&#20363;&#23376;&#26159;&#21307;&#23398;&#20303;&#38498;&#21307;&#21644;&#30740;&#31350;&#21592;&#24066;&#22330;&#65292;&#22312;&#36817;&#24180;&#26469;&#24050;&#32463;&#26377;&#20102;&#22823;&#37327;&#38754;&#35797;&#12290;&#24050;&#32463;&#26377;&#35768;&#22810;&#21162;&#21147;&#37319;&#29992;&#21508;&#31181;&#20449;&#21495;&#26426;&#21046;&#26469;&#38477;&#20302;&#36825;&#20123;&#24066;&#22330;&#20013;&#38754;&#35797;&#25104;&#26412;&#65292;&#28982;&#32780;&#65292;&#36825;&#20123;&#26426;&#21046;&#22312;&#20855;&#26377;&#20016;&#23500;&#20559;&#22909;&#30340;&#27169;&#22411;&#20013;&#30340;&#29702;&#35770;&#24615;&#36136;&#23578;&#26410;&#24471;&#21040;&#31995;&#32479;&#30740;&#31350;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#20026;&#21508;&#31181;&#26426;&#21046;&#25552;&#20379;&#29702;&#35770;&#20445;&#35777;&#65292;&#21457;&#29616;&#36825;&#20123;&#26426;&#21046;&#24517;&#39035;&#24688;&#24403;&#22320;&#24179;&#34913;&#31454;&#20105;&#12290;&#25105;&#20204;&#32771;&#34385;&#19968;&#20010;&#38543;&#26426;&#24066;&#22330;&#65292;&#22312;&#36825;&#20010;&#24066;&#22330;&#19978;&#65292;&#20195;&#29702;&#21830;&#30340;&#28508;&#22312;&#20559;&#22909;&#22522;&#20110;&#35266;&#23519;&#21040;&#30340;&#36136;&#37327;&#12289;&#20010;&#20154;&#21697;&#21619;&#21644;&#65288;&#20107;&#21518;&#65289;&#38754;&#35797;&#20914;&#20987;&#65292;&#24182;&#20551;&#35774;&#22312;&#38754;&#35797;&#26426;&#21046;&#21518;&#65292;&#20250;&#26681;&#25454;&#23545;&#38754;&#35797;&#20276;&#20387;&#30340;&#20559;&#22909;&#29983;&#25104;&#26368;&#32456;&#31283;&#23450;&#21305;&#37197;&#12290;&#25105;&#20204;&#30740;&#31350;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#22810;&#23545;&#22810;&#38754;&#35797;&#21305;&#37197;&#26426;&#21046;&#12290;
&lt;/p&gt;
&lt;p&gt;
In many centralized labor markets candidates interview with potential employers before matches are formed through a clearinghouse One prominent example is the market for medical residencies and fellowships, which in recent years has had a large increase in the number of interviews. There have been numerous efforts to reduce the cost of interviewing in these markets using a variety of signalling mechanisms, however, the theoretical properties of these mechanisms have not been systematically studied in models with rich preferences. In this paper we give theoretical guarantees for a variety of mechanisms, finding that these mechanisms must properly balance competition.  We consider a random market in which agents' latent preferences are based on observed qualities, personal taste and (ex post) interview shocks and assume that following an interview mechanism a final stable match is generated with respect to preferences over interview partners. We study a novel many-to-many interview match
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25506;&#35752;&#20102;&#20855;&#26377;&#23614;&#37096;&#20272;&#35745;&#21327;&#26041;&#24046;&#32467;&#26500;&#30340;&#35268;&#33539;&#21270;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#33410;&#28857;&#20998;&#20301;&#25968;&#39044;&#27979;&#22238;&#24402;&#27169;&#22411;&#30340;&#21327;&#26041;&#24046;&#32467;&#26500;&#32479;&#35745;&#20272;&#35745;&#26041;&#27861;&#21644;&#19968;&#31181;&#26080;&#35843;&#21442;&#21464;&#37327;&#36873;&#25321;&#31639;&#27861;&#12290;&#36825;&#20123;&#26041;&#27861;&#22312;&#24314;&#27169;&#32593;&#32476;&#20013;&#30340;&#31995;&#32479;&#39118;&#38505;&#26041;&#38754;&#20855;&#26377;&#23454;&#38469;&#24212;&#29992;&#20215;&#20540;&#12290;</title><link>http://arxiv.org/abs/2305.11282</link><description>&lt;p&gt;
&#22522;&#20110;&#33410;&#28857;&#20998;&#20301;&#25968;&#39044;&#27979;&#22238;&#24402;&#27169;&#22411;&#30340;&#23614;&#37096;&#20272;&#35745;&#21327;&#26041;&#24046;&#32467;&#26500;&#32479;&#35745;&#20272;&#35745;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Statistical Estimation for Covariance Structures with Tail Estimates using Nodewise Quantile Predictive Regression Models. (arXiv:2305.11282v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.11282
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25506;&#35752;&#20102;&#20855;&#26377;&#23614;&#37096;&#20272;&#35745;&#21327;&#26041;&#24046;&#32467;&#26500;&#30340;&#35268;&#33539;&#21270;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#33410;&#28857;&#20998;&#20301;&#25968;&#39044;&#27979;&#22238;&#24402;&#27169;&#22411;&#30340;&#21327;&#26041;&#24046;&#32467;&#26500;&#32479;&#35745;&#20272;&#35745;&#26041;&#27861;&#21644;&#19968;&#31181;&#26080;&#35843;&#21442;&#21464;&#37327;&#36873;&#25321;&#31639;&#27861;&#12290;&#36825;&#20123;&#26041;&#27861;&#22312;&#24314;&#27169;&#32593;&#32476;&#20013;&#30340;&#31995;&#32479;&#39118;&#38505;&#26041;&#38754;&#20855;&#26377;&#23454;&#38469;&#24212;&#29992;&#20215;&#20540;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25506;&#35752;&#20102;&#20855;&#26377;&#23614;&#37096;&#20272;&#35745;&#21327;&#26041;&#24046;&#32467;&#26500;&#30340;&#35268;&#33539;&#21270;&#12290;&#25105;&#20204;&#20851;&#27880;&#20004;&#20010;&#26041;&#38754;&#65306;&#65288;i&#65289;&#22312;&#19981;&#20551;&#35774;&#23384;&#22312;&#38750;&#24179;&#31283;&#22238;&#24402;&#22120;&#30340;&#24773;&#20917;&#19979;&#65292;&#20351;&#29992;&#20998;&#20301;&#25968;&#39044;&#27979;&#22238;&#24402;&#27169;&#22411;&#20272;&#35745;&#20855;&#26377;&#22823;&#20110;&#25237;&#36164;&#32452;&#21512;&#36164;&#20135;&#25968;&#30340;&#26102;&#38388;&#24207;&#21015;&#35266;&#27979;&#20540;&#30340;VaR-CoVar&#39118;&#38505;&#30697;&#38453;&#65307;&#65288;ii&#65289;&#26500;&#24314;&#19968;&#31181;&#26032;&#30340;&#21464;&#37327;&#36873;&#25321;&#31639;&#27861;&#65292;&#31216;&#20026;Centrality Exclusion&#65288;FOCE&#65289;&#30340;&#29305;&#24449;&#25490;&#24207;&#65292;&#23427;&#22522;&#20110;&#19968;&#20010;&#26080;&#21442;&#25968;&#22238;&#24402;&#26694;&#26550;&#65292;&#27809;&#26377;&#35843;&#33410;&#21442;&#25968;&#65292;&#24182;&#34987;&#35777;&#26126;&#22312;&#19968;&#33324;&#31232;&#30095;&#24615;&#20551;&#35774;&#19979;&#26159;&#19968;&#33268;&#30340;&#12290;&#25105;&#20204;&#36890;&#36807;&#23454;&#38469;&#21644;&#27169;&#25311;&#25968;&#25454;&#38598;&#30340;&#25968;&#23383;&#30740;&#31350;&#23637;&#31034;&#20102;&#25105;&#20204;&#25552;&#20986;&#30340;&#26041;&#27861;&#30340;&#26377;&#29992;&#24615;&#65292;&#29992;&#20110;&#24314;&#27169;&#32593;&#32476;&#20013;&#30340;&#31995;&#32479;&#39118;&#38505;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper considers the specification of covariance structures with tail estimates. We focus on two aspects: (i) the estimation of the VaR-CoVaR risk matrix in the case of larger number of time series observations than assets in a portfolio using quantile predictive regression models without assuming the presence of nonstationary regressors and; (ii) the construction of a novel variable selection algorithm, so-called, Feature Ordering by Centrality Exclusion (FOCE), which is based on an assumption-lean regression framework, has no tuning parameters and is proved to be consistent under general sparsity assumptions. We illustrate the usefulness of our proposed methodology with numerical studies of real and simulated datasets when modelling systemic risk in a network.
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#25506;&#35752;&#20102;&#22312;&#19981;&#21516;&#27169;&#22411;&#20013;&#29992;&#20110;&#20272;&#35745;&#24322;&#36136;&#32593;&#32476;&#27169;&#22411;&#21442;&#25968;&#30340;&#19977;&#31181;&#26041;&#27861;&#65292;&#24378;&#35843;&#20102;&#22312;&#21516;&#36136;&#27169;&#22411;&#19982;&#24322;&#36136;&#32593;&#32476;&#27169;&#22411;&#20013;&#30340;&#31561;&#20215;&#21644;&#24046;&#24322;&#12290;</title><link>http://arxiv.org/abs/2303.02716</link><description>&lt;p&gt;
&#30830;&#23450;&#24615;&#12289;&#28140;&#28779;&#25110;&#36864;&#28779;&#65311;&#24322;&#36136;&#32593;&#32476;&#27169;&#22411;&#21442;&#25968;&#20272;&#35745;&#30340;&#24046;&#24322;&#12290;
&lt;/p&gt;
&lt;p&gt;
Deterministic, quenched or annealed? Differences in the parameter estimation of heterogeneous network models. (arXiv:2303.02716v3 [physics.soc-ph] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.02716
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25506;&#35752;&#20102;&#22312;&#19981;&#21516;&#27169;&#22411;&#20013;&#29992;&#20110;&#20272;&#35745;&#24322;&#36136;&#32593;&#32476;&#27169;&#22411;&#21442;&#25968;&#30340;&#19977;&#31181;&#26041;&#27861;&#65292;&#24378;&#35843;&#20102;&#22312;&#21516;&#36136;&#27169;&#22411;&#19982;&#24322;&#36136;&#32593;&#32476;&#27169;&#22411;&#20013;&#30340;&#31561;&#20215;&#21644;&#24046;&#24322;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20998;&#26512;&#21152;&#26435;&#32593;&#32476;&#38656;&#35201;&#21516;&#26102;&#24314;&#27169;&#20108;&#36827;&#21046;&#21644;&#26435;&#37325;&#23646;&#24615;&#12290;&#25105;&#20204;&#24378;&#35843;&#20102;&#19977;&#31181;&#29992;&#20110;&#20272;&#35745;&#20108;&#32773;&#36127;&#36131;&#21442;&#25968;&#30340;&#26041;&#27861;&#65306;&#23558;&#25299;&#25169;&#35270;&#20026;&#30830;&#23450;&#24615;&#30340;&#35745;&#37327;&#25216;&#26415;&#65292;&#32479;&#35745;&#25216;&#26415;&#24179;&#22343;&#21442;&#25968;&#25110;&#36890;&#36807;&#23545;&#25299;&#25169;&#38543;&#26426;&#24615;&#30340;&#24179;&#22343;&#21487;&#33021;&#24615;&#36827;&#34892;&#26368;&#22823;&#21270;&#12290;&#22312;&#21516;&#36136;&#27169;&#22411;&#20013;&#65292;&#31561;&#20215;&#24615;&#25104;&#31435;&#65307;&#22312;&#24322;&#36136;&#32593;&#32476;&#27169;&#22411;&#20013;&#65292;&#23616;&#37096;&#22833;&#35843;&#25171;&#30772;&#20102;&#23427;&#65292;&#36825;&#19982;&#22833;&#24207;&#31995;&#32479;&#29289;&#29702;&#20013;&#8220;&#28140;&#28779;&#8221;&#21644;&#8220;&#36864;&#28779;&#8221;&#24179;&#22343;&#20540;&#20043;&#38388;&#30340;&#24046;&#24322;&#30456;&#20284;&#12290;
&lt;/p&gt;
&lt;p&gt;
Analysing weighted networks requires modelling the binary and weighted properties simultaneously. We highlight three approaches for estimating the parameters responsible for them: econometric techniques treating topology as deterministic and statistical techniques either ensemble-averaging parameters or maximising an averaged likelihood over the topological randomness. In homogeneous models, equivalence holds; in heterogeneous network models, the local disorder breaks it, in a way reminiscent of the difference between `quenched' and `annealed' averages in the physics of disordered systems.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#20998;&#26512;&#20102;&#19968;&#20010;&#22522;&#20110;&#31354;&#38388;&#32463;&#27982;&#27169;&#22411;&#30340;&#36328;&#21306;&#22495;&#21019;&#26032;&#65292;&#22312;&#21046;&#36896;&#19994;&#30340;&#19981;&#26029;&#22686;&#38271;&#21644;&#30693;&#35782;&#30340;&#21019;&#36896;&#21644;&#20256;&#25773;&#20013;&#65292;&#30740;&#31350;&#20154;&#21592;&#20043;&#38388;&#30340;&#36328;&#21306;&#22495;&#20114;&#21160;&#23545;&#20110;&#21019;&#26032;&#30340;&#25104;&#21151;&#21313;&#20998;&#20851;&#38190;&#65292;&#26377;&#21161;&#20110;&#32463;&#27982;&#27963;&#21160;&#22312;&#21021;&#26399;&#30340;&#32858;&#38598;&#20043;&#21518;&#37325;&#26032;&#20998;&#25955;&#12290;</title><link>http://arxiv.org/abs/2212.14475</link><description>&lt;p&gt;
&#22522;&#20110;&#31354;&#38388;&#32463;&#27982;&#27169;&#22411;&#30340;&#36328;&#21306;&#22495;&#20114;&#21160;&#21019;&#26032;
&lt;/p&gt;
&lt;p&gt;
Innovation through inter-regional interaction in a spatial economic model. (arXiv:2212.14475v3 [econ.TH] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2212.14475
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20998;&#26512;&#20102;&#19968;&#20010;&#22522;&#20110;&#31354;&#38388;&#32463;&#27982;&#27169;&#22411;&#30340;&#36328;&#21306;&#22495;&#21019;&#26032;&#65292;&#22312;&#21046;&#36896;&#19994;&#30340;&#19981;&#26029;&#22686;&#38271;&#21644;&#30693;&#35782;&#30340;&#21019;&#36896;&#21644;&#20256;&#25773;&#20013;&#65292;&#30740;&#31350;&#20154;&#21592;&#20043;&#38388;&#30340;&#36328;&#21306;&#22495;&#20114;&#21160;&#23545;&#20110;&#21019;&#26032;&#30340;&#25104;&#21151;&#21313;&#20998;&#20851;&#38190;&#65292;&#26377;&#21161;&#20110;&#32463;&#27982;&#27963;&#21160;&#22312;&#21021;&#26399;&#30340;&#32858;&#38598;&#20043;&#21518;&#37325;&#26032;&#20998;&#25955;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20998;&#26512;&#20102;&#19968;&#20010;&#20855;&#26377;&#22402;&#30452;&#21019;&#26032;&#30340;&#20004;&#22320;&#21306;&#27169;&#22411;&#65292;&#35813;&#27169;&#22411;&#25552;&#39640;&#20102;&#27599;&#20010;&#22320;&#21306;&#29983;&#20135;&#30340;&#27700;&#24179;&#24046;&#24322;&#21046;&#36896;&#21697;&#31181;&#30340;&#36136;&#37327;&#12290;&#25105;&#20204;&#30740;&#31350;&#30693;&#35782;&#30340;&#21019;&#36896;&#21644;&#20256;&#25773;&#20197;&#21450;&#21046;&#36896;&#19994;&#30340;&#19981;&#26029;&#22686;&#38271;&#22914;&#20309;&#30456;&#20114;&#20316;&#29992;&#26469;&#22609;&#36896;&#31354;&#38388;&#32463;&#27982;&#12290;&#21019;&#26032;&#21457;&#29983;&#30340;&#27010;&#29575;&#21462;&#20915;&#20110;&#30740;&#31350;&#20154;&#21592;&#65288;&#27969;&#21160;&#24037;&#20154;&#65289;&#20043;&#38388;&#30340;&#36328;&#21306;&#22495;&#20114;&#21160;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#22914;&#26524;&#21644;&#22806;&#22269;&#31185;&#23398;&#23478;&#30340;&#20114;&#21160;&#20851;&#31995;&#23545;&#20110;&#21019;&#26032;&#30340;&#25104;&#21151;&#27604;&#36739;&#37325;&#35201;&#65292;&#38543;&#30528;&#36816;&#36755;&#25104;&#26412;&#20174;&#39640;&#27700;&#24179;&#38477;&#20302;&#65292;&#35813;&#27169;&#22411;&#21487;&#20197;&#35299;&#37322;&#32463;&#27982;&#27963;&#21160;&#22312;&#21021;&#26399;&#30340;&#28176;&#36827;&#24615;&#32858;&#38598;&#20043;&#21518;&#37325;&#26032;&#20998;&#25955;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper analyses a two-region model with vertical innovations that enhance the quality of varieties of the horizontally differentiated manufactures produced in each of the two regions. We look at how the creation and diffusion of knowledge and increasing returns in manufacturing interact to shape the spatial economy. Innovations occur with a probability that depends on the inter-regional interaction between researchers (mobile workers). We find that, if the weight of interaction with foreign scientists is relatively more important for the success of innovation, the model accounts for re-dispersion of economic activities after an initial stage of progressive agglomeration as transport costs decrease from a high level.
&lt;/p&gt;</description></item><item><title>&#36825;&#31687;&#35770;&#25991;&#20171;&#32461;&#20102;&#32463;&#27982;&#23398;&#20013;&#20851;&#20110;&#20449;&#24687;&#21644;&#23398;&#20064;&#30340;&#19968;&#20123;&#37325;&#35201;&#29702;&#35770;&#35838;&#39064;&#65292;&#21253;&#25324;&#22914;&#20309;&#36827;&#34892;&#36125;&#21494;&#26031;&#26356;&#26032;&#12289;&#23398;&#20064;&#21644;&#21512;&#24182;&#20449;&#24565;&#12289;&#22914;&#20309;&#22788;&#29702;&#27169;&#22411;&#19981;&#30830;&#23450;&#24615;&#21644;&#38169;&#35823;&#31561;&#12290;</title><link>http://arxiv.org/abs/2212.07521</link><description>&lt;p&gt;
&#32463;&#27982;&#23398;&#20013;&#30340;&#20449;&#24687;&#21644;&#23398;&#20064;&#29702;&#35770;
&lt;/p&gt;
&lt;p&gt;
Information and Learning in Economic Theory. (arXiv:2212.07521v2 [econ.TH] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2212.07521
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#20171;&#32461;&#20102;&#32463;&#27982;&#23398;&#20013;&#20851;&#20110;&#20449;&#24687;&#21644;&#23398;&#20064;&#30340;&#19968;&#20123;&#37325;&#35201;&#29702;&#35770;&#35838;&#39064;&#65292;&#21253;&#25324;&#22914;&#20309;&#36827;&#34892;&#36125;&#21494;&#26031;&#26356;&#26032;&#12289;&#23398;&#20064;&#21644;&#21512;&#24182;&#20449;&#24565;&#12289;&#22914;&#20309;&#22788;&#29702;&#27169;&#22411;&#19981;&#30830;&#23450;&#24615;&#21644;&#38169;&#35823;&#31561;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#38506;&#20276;&#19968;&#38376;&#20851;&#20110;&#32463;&#27982;&#23398;&#20013;&#20449;&#24687;&#21644;&#23398;&#20064;&#29702;&#35770;&#30340;&#30740;&#31350;&#29983;&#35838;&#31243;&#65292;&#20027;&#35201;&#20869;&#23481;&#21253;&#25324;&#20849;&#30693;&#12289;&#36125;&#21494;&#26031;&#26356;&#26032;&#12289;&#21333;&#35843;&#20284;&#28982;&#27604;&#24615;&#36136;&#12289;&#38582;&#23646;&#20851;&#31995;&#12289;&#24067;&#33713;&#20811;&#38886;&#23572;&#25490;&#24207;&#12289;&#20449;&#24687;&#25104;&#26412;&#12289;&#20449;&#24565;&#30340;&#23398;&#20064;&#21644;&#21512;&#24182;&#12289;&#27169;&#22411;&#19981;&#30830;&#23450;&#24615;&#12289;&#27169;&#22411;&#38169;&#35823;&#21644;&#20449;&#24687;&#35774;&#35745;&#12290;
&lt;/p&gt;
&lt;p&gt;
These lecture notes accompany a one-semester graduate course on information and learning in economic theory. Topics include common knowledge, Bayesian updating, monotone-likelihood ratio properties, affiliation, the Blackwell order, cost of information, learning and merging of beliefs, model uncertainty, model misspecification, and information design.
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#36125;&#21494;&#26031;&#31283;&#23450;&#22343;&#34913;&#30340;&#23454;&#35777;&#26694;&#26550;&#65292;&#21487;&#29992;&#20110;&#20998;&#26512;&#23384;&#22312;&#19981;&#23436;&#20840;&#20449;&#24687;&#30340;&#31283;&#23450;&#32467;&#26524;&#12290;&#27492;&#26694;&#26550;&#24378;&#20110;&#36125;&#21494;&#26031;&#30456;&#20851;&#22343;&#34913;&#30830;&#23450;&#38598;&#65292;&#24182;&#22312;&#40614;&#24403;&#21171;&#21644;&#27721;&#22561;&#29579;&#30340;&#31454;&#20105;&#30740;&#31350;&#20013;&#24471;&#21040;&#20102;&#24212;&#29992;&#12290;</title><link>http://arxiv.org/abs/2205.04990</link><description>&lt;p&gt;
&#28216;&#25103;&#20013;&#30340;&#31283;&#23450;&#32467;&#26524;&#19982;&#20449;&#24687;&#65306;&#19968;&#20010;&#23454;&#35777;&#26694;&#26550;
&lt;/p&gt;
&lt;p&gt;
Stable Outcomes and Information in Games: An Empirical Framework. (arXiv:2205.04990v2 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2205.04990
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#36125;&#21494;&#26031;&#31283;&#23450;&#22343;&#34913;&#30340;&#23454;&#35777;&#26694;&#26550;&#65292;&#21487;&#29992;&#20110;&#20998;&#26512;&#23384;&#22312;&#19981;&#23436;&#20840;&#20449;&#24687;&#30340;&#31283;&#23450;&#32467;&#26524;&#12290;&#27492;&#26694;&#26550;&#24378;&#20110;&#36125;&#21494;&#26031;&#30456;&#20851;&#22343;&#34913;&#30830;&#23450;&#38598;&#65292;&#24182;&#22312;&#40614;&#24403;&#21171;&#21644;&#27721;&#22561;&#29579;&#30340;&#31454;&#20105;&#30740;&#31350;&#20013;&#24471;&#21040;&#20102;&#24212;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#35768;&#22810;&#25112;&#30053;&#29615;&#22659;&#20013;&#65292;&#31283;&#23450;&#30340;&#32467;&#26524;&#36890;&#24120;&#20855;&#26377;&#20844;&#24320;&#21487;&#35265;&#30340;&#29609;&#23478;&#20915;&#31574;&#65292;&#20294;&#27809;&#26377;&#29609;&#23478;&#25235;&#20303;&#26426;&#20250;&#36827;&#34892;&#20559;&#31163;&#12290;&#20026;&#20102;&#20998;&#26512;&#36825;&#31181;&#23384;&#22312;&#19981;&#23436;&#20840;&#20449;&#24687;&#30340;&#24773;&#20917;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#35299;&#27010;&#24565;&#8212;&#8212;&#36125;&#21494;&#26031;&#31283;&#23450;&#22343;&#34913;&#20316;&#20026;&#23454;&#35777;&#26694;&#26550;&#12290;&#25105;&#20204;&#30340;&#26694;&#26550;&#20801;&#35768;&#30740;&#31350;&#32773;&#23545;&#29609;&#23478;&#30340;&#20449;&#24687;&#21644;&#22343;&#34913;&#36873;&#25321;&#35268;&#21017;&#20445;&#25345;&#19981;&#21487;&#30693;&#29366;&#24577;&#12290;&#22312;&#29609;&#23478;&#20449;&#24687;&#23384;&#22312;&#24378;&#20551;&#35774;&#30340;&#24773;&#20917;&#19979;&#65292;&#36125;&#21494;&#26031;&#31283;&#23450;&#22343;&#34913;&#30830;&#23450;&#38598;&#20250;&#25910;&#32553;&#21040;&#23436;&#20840;&#20449;&#24687;&#32431;&#31574;&#30053;&#32435;&#20160;&#22343;&#34913;&#30830;&#23450;&#38598;&#20013;&#12290;&#27492;&#22806;&#65292;&#22312;&#20854;&#20182;&#22240;&#32032;&#30456;&#31561;&#30340;&#24773;&#20917;&#19979;&#65292;&#23427;&#27604;&#36125;&#21494;&#26031;&#30456;&#20851;&#22343;&#34913;&#30830;&#23450;&#38598;&#26356;&#32039;&#12290;&#25105;&#20204;&#36824;&#25552;&#20986;&#20102;&#21487;&#35745;&#31639;&#30340;&#20272;&#35745;&#21644;&#25512;&#26029;&#26041;&#27861;&#12290;&#22312;&#19968;&#20010;&#24212;&#29992;&#20013;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#40614;&#24403;&#21171;&#21644;&#27721;&#22561;&#29579;&#22312;&#32654;&#22269;&#30340;&#25112;&#30053;&#36827;&#20837;&#20915;&#31574;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#32467;&#26524;&#31361;&#20986;&#20102;&#20449;&#24687;&#20551;&#35774;&#22312;&#28216;&#25103;&#20013;&#30340;&#35782;&#21035;&#21147;&#65292;&#24182;&#25552;&#20379;&#20102;&#26377;&#20851;&#24555;&#39184;&#34892;&#19994;&#31454;&#20105;&#21160;&#24577;&#30340;&#26032;&#35265;&#35299;&#12290;
&lt;/p&gt;
&lt;p&gt;
Empirically, many strategic settings are characterized by stable outcomes in which players' decisions are publicly observed, yet no player takes the opportunity to deviate. To analyze such situations in the presence of incomplete information, we build an empirical framework by introducing a novel solution concept that we call Bayes stable equilibrium. Our framework allows the researcher to be agnostic about players' information and the equilibrium selection rule. The Bayes stable equilibrium identified set collapses to the complete information pure strategy Nash equilibrium identified set under strong assumptions on players' information. Furthermore, all else equal, it is weakly tighter than the Bayes correlated equilibrium identified set. We also propose computationally tractable approaches for estimation and inference. In an application, we study the strategic entry decisions of McDonald's and Burger King in the US. Our results highlight the identifying power of informational assumpt
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#26377;&#26102;&#38388;&#21464;&#37327;&#30340;&#24322;&#36136;&#24615;&#23545;&#27604;&#20013;&#30340;&#24179;&#34892;&#36235;&#21183;&#20551;&#35774;&#30340;&#35782;&#21035;&#21644;&#20272;&#35745;&#31574;&#30053;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#21033;&#29992;&#23616;&#37096;&#25237;&#24433;&#24471;&#21040;&#30340;&#39640;&#32500;&#27531;&#24046;&#20043;&#38388;&#30340;&#24046;&#24322;&#30340;&#26032;&#30340;&#35782;&#21035;&#21644;&#20272;&#35745;&#31574;&#30053;&#65292;&#33021;&#22815;&#22312;&#26356;&#22810;&#24773;&#20917;&#19979;&#20855;&#26377;&#40065;&#26834;&#24615;&#21644;&#39640;&#25928;&#24615;&#65292;&#21487;&#29992;&#20110;&#20272;&#35745;&#23384;&#22312;&#24322;&#36136;&#24615;&#27835;&#30103;&#25928;&#24212;&#21644;/&#25110;&#24178;&#25200;&#30340;&#29615;&#22659;&#20013;&#30340;&#22240;&#26524;&#25928;&#24212;&#12290;</title><link>http://arxiv.org/abs/2202.02903</link><description>&lt;p&gt;
&#26377;&#26102;&#38388;&#21464;&#37327;&#30340;&#24322;&#36136;&#24615;&#23545;&#27604;&#20013;&#30340;&#24179;&#34892;&#36235;&#21183;&#20551;&#35774;&#38382;&#39064;
&lt;/p&gt;
&lt;p&gt;
Difference-in-Differences with Time-Varying Covariates in the Parallel Trends Assumption. (arXiv:2202.02903v2 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2202.02903
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#26377;&#26102;&#38388;&#21464;&#37327;&#30340;&#24322;&#36136;&#24615;&#23545;&#27604;&#20013;&#30340;&#24179;&#34892;&#36235;&#21183;&#20551;&#35774;&#30340;&#35782;&#21035;&#21644;&#20272;&#35745;&#31574;&#30053;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#21033;&#29992;&#23616;&#37096;&#25237;&#24433;&#24471;&#21040;&#30340;&#39640;&#32500;&#27531;&#24046;&#20043;&#38388;&#30340;&#24046;&#24322;&#30340;&#26032;&#30340;&#35782;&#21035;&#21644;&#20272;&#35745;&#31574;&#30053;&#65292;&#33021;&#22815;&#22312;&#26356;&#22810;&#24773;&#20917;&#19979;&#20855;&#26377;&#40065;&#26834;&#24615;&#21644;&#39640;&#25928;&#24615;&#65292;&#21487;&#29992;&#20110;&#20272;&#35745;&#23384;&#22312;&#24322;&#36136;&#24615;&#27835;&#30103;&#25928;&#24212;&#21644;/&#25110;&#24178;&#25200;&#30340;&#29615;&#22659;&#20013;&#30340;&#22240;&#26524;&#25928;&#24212;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#24322;&#36136;&#24615;&#23545;&#27604;&#30340;&#35782;&#21035;&#21644;&#20272;&#35745;&#31574;&#30053;&#65292;&#20854;&#20013;&#24179;&#34892;&#36235;&#21183;&#20551;&#35774;&#26159;&#22312;&#23545;&#26102;&#38388;&#21464;&#37327;&#21644;/&#25110;&#26102;&#38388;&#19981;&#21464;&#21327;&#21464;&#37327;&#36827;&#34892;&#26465;&#20214;&#21270;&#21518;&#25104;&#31435;&#30340;&#12290;&#25105;&#20204;&#30340;&#31532;&#19968;&#20010;&#20027;&#35201;&#36129;&#29486;&#26159;&#25351;&#20986;&#20102;&#24120;&#29992;&#30340;&#21452;&#21521;&#22266;&#23450;&#25928;&#24212;&#65288;TWFE&#65289;&#22238;&#24402;&#22312;&#36825;&#31181;&#24773;&#20917;&#19979;&#23384;&#22312;&#19968;&#20123;&#24369;&#28857;&#12290;&#38500;&#20102;&#25991;&#29486;&#20013;&#24378;&#35843;&#30340;&#28041;&#21450;&#22810;&#20010;&#26102;&#26399;&#21644;&#27835;&#30103;&#26102;&#26426;&#21464;&#21270;&#30340;&#38382;&#39064;&#20043;&#22806;&#65292;&#25105;&#20204;&#36824;&#34920;&#26126;&#65292;&#21363;&#20351;&#22312;&#21482;&#26377;&#20004;&#20010;&#26102;&#38388;&#27573;&#30340;&#24773;&#20917;&#19979;&#65292;TWFE&#22238;&#24402;&#20063;&#19981;&#19968;&#23450;&#33021;&#22815;&#25269;&#24481;&#65288;i&#65289;&#26410;&#25509;&#21463;&#22788;&#29702;&#30340;&#28508;&#22312;&#32467;&#26524;&#36335;&#24452;&#21462;&#20915;&#20110;&#26102;&#38388;&#21464;&#37327;&#30340;&#27700;&#24179;&#65288;&#32780;&#19981;&#20165;&#20165;&#26159;&#26102;&#38388;&#20869;&#21464;&#37327;&#30340;&#21464;&#21270;&#65289;&#65292;&#65288;ii&#65289;&#26410;&#25509;&#21463;&#22788;&#29702;&#30340;&#28508;&#22312;&#32467;&#26524;&#36335;&#24452;&#21462;&#20915;&#20110;&#26102;&#38388;&#19981;&#21464;&#30340;&#21327;&#21464;&#37327;&#65292;&#20197;&#21450;&#65288;iii&#65289;&#32467;&#26524;&#38543;&#26102;&#38388;&#21644;/&#25110;&#20542;&#21521;&#24471;&#20998;&#30340;&#32447;&#24615;&#26465;&#20214;&#36829;&#21453;&#30340;&#24773;&#20917;&#12290;&#21363;&#20351;&#22312;&#21069;&#19977;&#20010;&#38382;&#39064;&#37117;&#19981;&#25104;&#31435;&#30340;&#24773;&#20917;&#19979;&#65292;&#25105;&#20204;&#36824;&#26159;&#34920;&#26126;&#65292;TWFE&#22238;&#24402;&#21487;&#33021;&#20250;&#21463;&#21040;&#26174;&#33879;&#30340;&#25928;&#29575;&#25439;&#22833;&#12290;&#25105;&#20204;&#30340;&#31532;&#20108;&#20010;&#20027;&#35201;&#36129;&#29486;&#26159;&#25552;&#20986;&#20102;&#19968;&#31181;&#21033;&#29992;&#23616;&#37096;&#25237;&#24433;&#24471;&#21040;&#30340;&#39640;&#32500;&#27531;&#24046;&#20043;&#38388;&#30340;&#24046;&#24322;&#30340;&#26032;&#30340;&#35782;&#21035;&#21644;&#20272;&#35745;&#31574;&#30053;&#12290;&#30001;&#20110;&#26500;&#36896;&#26041;&#24335;&#65292;&#36825;&#31181;&#26032;&#31574;&#30053;&#36890;&#24120;&#23545;&#19978;&#36848;&#25152;&#26377;&#38382;&#39064;&#37117;&#20855;&#26377;&#40065;&#26834;&#24615;&#65292;&#21253;&#25324;&#32467;&#26524;&#25110;&#27835;&#30103;&#20998;&#37197;&#35268;&#21017;&#20013;&#30340;&#28508;&#22312;&#38750;&#32447;&#24615;&#12290;&#37325;&#35201;&#30340;&#26159;&#65292;&#25105;&#20204;&#30340;&#26041;&#27861;&#21487;&#20197;&#29992;&#29616;&#25104;&#30340;&#36719;&#20214;&#21253;&#23454;&#29616;&#65292;&#20063;&#21487;&#20197;&#29992;&#20110;&#20272;&#35745;&#23384;&#22312;&#24322;&#36136;&#24615;&#27835;&#30103;&#25928;&#24212;&#21644;/&#25110;&#24178;&#25200;&#30340;&#29615;&#22659;&#20013;&#30340;&#22240;&#26524;&#25928;&#24212;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this paper, we study difference-in-differences identification and estimation strategies where the parallel trends assumption holds after conditioning on time-varying covariates and/or time-invariant covariates. Our first main contribution is to point out a number of weaknesses of commonly used two-way fixed effects (TWFE) regressions in this context. In addition to issues related to multiple periods and variation in treatment timing that have been emphasized in the literature, we show that, even in the case with only two time periods, TWFE regressions are not generally robust to (i) paths of untreated potential outcomes depending on the level of time-varying covariates (as opposed to only the change in the covariates over time), (ii) paths of untreated potential outcomes depending on time-invariant covariates, and (iii) violations of linearity conditions for outcomes over time and/or the propensity score. Even in cases where none of the previous three issues hold, we show that TWFE 
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#24320;&#21457;&#20102;&#32447;&#24615;&#24037;&#20855;&#21464;&#37327;&#22238;&#24402;&#20013;&#20581;&#22766;&#30340;&#32622;&#25442;&#26816;&#39564;&#29256;&#26412;&#65292;&#19982;&#29616;&#26377;&#30340;&#20551;&#35774;&#20202;&#22120;&#21644;&#35823;&#24046;&#39033;&#20043;&#38388;&#29420;&#31435;&#30340;&#38543;&#26426;&#21270;&#21644;&#22522;&#20110;&#31209;&#30340;&#26816;&#39564;&#20551;&#35774;&#19981;&#21516;&#65292;&#36825;&#20123;&#27979;&#35797;&#20855;&#26377;&#26465;&#20214;&#24322;&#26041;&#24046;&#30340;&#40065;&#26834;&#24615;&#24182;&#19988;&#22312;&#20202;&#22120;&#19982;&#35823;&#24046;&#39033;&#27491;&#20132;&#26102;&#34920;&#29616;&#20986;&#28176;&#36817;&#30456;&#20284;&#12290;&#22312;&#20202;&#22120;&#19982;&#32467;&#26500;&#24615;&#35823;&#24046;&#39033;&#29420;&#31435;&#26102;&#65292;&#32622;&#25442;AR&#27979;&#35797;&#26159;&#31934;&#30830;&#30340;&#65292;&#22240;&#27492;&#23545;&#20110;&#37325;&#23614;&#26159;&#40065;&#26834;&#30340;&#12290;</title><link>http://arxiv.org/abs/2111.13774</link><description>&lt;p&gt;
&#32447;&#24615;&#24037;&#20855;&#21464;&#37327;&#22238;&#24402;&#20013;&#20581;&#22766;&#30340;&#32622;&#25442;&#26816;&#39564;
&lt;/p&gt;
&lt;p&gt;
Robust Permutation Tests in Linear Instrumental Variables Regression. (arXiv:2111.13774v2 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2111.13774
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#24320;&#21457;&#20102;&#32447;&#24615;&#24037;&#20855;&#21464;&#37327;&#22238;&#24402;&#20013;&#20581;&#22766;&#30340;&#32622;&#25442;&#26816;&#39564;&#29256;&#26412;&#65292;&#19982;&#29616;&#26377;&#30340;&#20551;&#35774;&#20202;&#22120;&#21644;&#35823;&#24046;&#39033;&#20043;&#38388;&#29420;&#31435;&#30340;&#38543;&#26426;&#21270;&#21644;&#22522;&#20110;&#31209;&#30340;&#26816;&#39564;&#20551;&#35774;&#19981;&#21516;&#65292;&#36825;&#20123;&#27979;&#35797;&#20855;&#26377;&#26465;&#20214;&#24322;&#26041;&#24046;&#30340;&#40065;&#26834;&#24615;&#24182;&#19988;&#22312;&#20202;&#22120;&#19982;&#35823;&#24046;&#39033;&#27491;&#20132;&#26102;&#34920;&#29616;&#20986;&#28176;&#36817;&#30456;&#20284;&#12290;&#22312;&#20202;&#22120;&#19982;&#32467;&#26500;&#24615;&#35823;&#24046;&#39033;&#29420;&#31435;&#26102;&#65292;&#32622;&#25442;AR&#27979;&#35797;&#26159;&#31934;&#30830;&#30340;&#65292;&#22240;&#27492;&#23545;&#20110;&#37325;&#23614;&#26159;&#40065;&#26834;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#24320;&#21457;&#20986;&#32447;&#24615;&#24037;&#20855;&#21464;&#37327;&#65288;IV&#65289;&#22238;&#24402;&#20013;&#37492;&#21035;&#26377;&#21147;&#30340;&#32622;&#25442;&#26816;&#39564;&#29256;&#26412;&#12290;&#19982;&#29616;&#26377;&#30340;&#38543;&#26426;&#21270;&#21644;&#22522;&#20110;&#31209;&#30340;&#26816;&#39564;&#20551;&#35774;&#20202;&#22120;&#21644;&#35823;&#24046;&#39033;&#20043;&#38388;&#29420;&#31435;&#19981;&#21516;&#65292;&#32622;&#25442;Anderson-Rubin&#65288;AR&#65289;&#12289;Lagrange Multiplier&#65288;LM&#65289;&#21644;Conditional Likelihood Ratio&#65288;CLR&#65289;&#26816;&#39564;&#22312;&#26631;&#20934;&#25490;&#38500;&#38480;&#21046;&#21363;&#20202;&#22120;&#21644;&#35823;&#24046;&#39033;&#27491;&#20132;&#26102;&#28176;&#36817;&#30456;&#20284;&#19988;&#20855;&#26377;&#26465;&#20214;&#24322;&#26041;&#24046;&#30340;&#40065;&#26834;&#24615;&#12290;&#27492;&#22806;&#65292;&#24403;&#20202;&#22120;&#19982;&#32467;&#26500;&#24615;&#35823;&#24046;&#39033;&#29420;&#31435;&#26102;&#65292;&#32622;&#25442;AR&#26816;&#39564;&#26159;&#31934;&#30830;&#30340;&#65292;&#22240;&#27492;&#26159;&#23545;&#37325;&#23614;&#40065;&#26834;&#30340;&#12290;&#22240;&#27492;&#65292;&#36825;&#20123;&#27979;&#35797;&#20855;&#26377;&#22522;&#20110;&#31209;&#30340;&#27979;&#35797;&#21644;&#37326;bootstrap AR&#27979;&#35797;&#30340;&#20248;&#28857;&#12290;&#25968;&#20540;&#23454;&#20363;&#35777;&#23454;&#20102;&#29702;&#35770;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper develops permutation versions of identification-robust tests in linear instrumental variables (IV) regression. Unlike the existing randomization and rank-based tests in which independence between the instruments and the error terms is assumed, the permutation Anderson- Rubin (AR), Lagrange Multiplier (LM) and Conditional Likelihood Ratio (CLR) tests are asymptotically similar and robust to conditional heteroskedasticity under standard exclusion restriction i.e. the orthogonality between the instruments and the error terms. Moreover, when the instruments are independent of the structural error term, the permutation AR tests are exact, hence robust to heavy tails. As such, these tests share the strengths of the rank-based tests and the wild bootstrap AR tests. Numerical illustrations corroborate the theoretical results.
&lt;/p&gt;</description></item></channel></rss>