<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#26412;&#30740;&#31350;&#20351;&#29992;&#23457;&#35745;&#26041;&#27861;&#25506;&#32034;&#20102;ChatGPT&#22312;&#27714;&#32844;&#32773;&#31579;&#36873;&#20013;&#30340;&#31995;&#32479;&#20559;&#35265;&#65292;&#30740;&#31350;&#21457;&#29616;&#35821;&#35328;&#25552;&#31034;&#21644;&#30003;&#35831;&#32773;&#22995;&#21517;&#20013;&#30340;&#31181;&#26063;&#36523;&#20221;&#32447;&#32034;&#20250;&#24433;&#21709;ChatGPT&#30340;&#35780;&#20272;&#12290;</title><link>http://arxiv.org/abs/2309.07664</link><description>&lt;p&gt;
&#35745;&#31639;&#26426;&#35828;&#8220;&#19981;&#34892;&#8221;: &#20351;&#29992;&#23457;&#35745;&#26041;&#27861;&#25506;&#32034;ChatGPT&#20013;&#30340;&#31995;&#32479;&#25307;&#32856;&#20559;&#35265;
&lt;/p&gt;
&lt;p&gt;
Computer says 'no': Exploring systemic hiring bias in ChatGPT using an audit approach. (arXiv:2309.07664v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.07664
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#20351;&#29992;&#23457;&#35745;&#26041;&#27861;&#25506;&#32034;&#20102;ChatGPT&#22312;&#27714;&#32844;&#32773;&#31579;&#36873;&#20013;&#30340;&#31995;&#32479;&#20559;&#35265;&#65292;&#30740;&#31350;&#21457;&#29616;&#35821;&#35328;&#25552;&#31034;&#21644;&#30003;&#35831;&#32773;&#22995;&#21517;&#20013;&#30340;&#31181;&#26063;&#36523;&#20221;&#32447;&#32034;&#20250;&#24433;&#21709;ChatGPT&#30340;&#35780;&#20272;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#22312;&#20248;&#21270;&#32844;&#19994;&#27963;&#21160;&#26041;&#38754;&#20855;&#26377;&#37325;&#35201;&#28508;&#21147;&#65292;&#22914;&#31616;&#21270;&#20154;&#21592;&#36873;&#25300;&#31243;&#24207;&#12290;&#28982;&#32780;&#65292;&#20154;&#20204;&#25285;&#24515;&#36825;&#20123;&#27169;&#22411;&#20250;&#24310;&#32493;&#39044;&#35757;&#32451;&#25968;&#25454;&#20013;&#23884;&#20837;&#30340;&#31995;&#32479;&#20559;&#35265;&#12290;&#36825;&#39033;&#30740;&#31350;&#25506;&#35752;&#20102;ChatGPT&#22312;&#27714;&#32844;&#32773;&#31579;&#36873;&#26041;&#38754;&#26159;&#21542;&#34920;&#29616;&#20986;&#31181;&#26063;&#25110;&#24615;&#21035;&#20559;&#35265;&#65292;ChatGPT&#26159;&#19968;&#20010;&#33021;&#22815;&#29983;&#25104;&#31867;&#20284;&#20154;&#31867;&#22238;&#24212;&#30340;&#32842;&#22825;&#26426;&#22120;&#20154;&#12290;&#36890;&#36807;&#20351;&#29992;&#19968;&#31181;&#36890;&#20449;&#23457;&#35745;&#26041;&#27861;&#65292;&#25105;&#27169;&#25311;&#20102;&#19968;&#20010;&#31616;&#21382;&#31579;&#36873;&#20219;&#21153;&#65292;&#25351;&#31034;&#32842;&#22825;&#26426;&#22120;&#20154;&#35780;&#20215;&#34394;&#26500;&#30340;&#30003;&#35831;&#32773;&#31616;&#21382;&#65292;&#36825;&#20123;&#31616;&#21382;&#21482;&#26377;&#21517;&#23383;&#19981;&#21516;&#65292;&#20197;&#26263;&#31034;&#31181;&#26063;&#21644;&#24615;&#21035;&#36523;&#20221;&#12290;&#36890;&#36807;&#27604;&#36739;&#38463;&#25289;&#20271;&#12289;&#20122;&#27954;&#12289;&#32654;&#22269;&#40657;&#20154;&#12289;&#20013;&#38750;&#12289;&#33655;&#20848;&#12289;&#19996;&#27431;&#12289;&#35199;&#29677;&#29273;&#35028;&#12289;&#22303;&#32819;&#20854;&#21644;&#32654;&#22269;&#30333;&#20154;&#30007;&#24615;&#21644;&#22899;&#24615;&#30003;&#35831;&#32773;&#30340;&#35780;&#20998;&#65292;&#25105;&#21457;&#29616;&#31181;&#26063;&#21644;&#24615;&#21035;&#36523;&#20221;&#20250;&#24433;&#21709;ChatGPT&#30340;&#35780;&#20272;&#12290;&#31181;&#26063;&#20559;&#35265;&#20284;&#20046;&#37096;&#20998;&#28304;&#20110;&#25552;&#31034;&#35821;&#35328;&#65292;&#37096;&#20998;&#28304;&#20110;&#30003;&#35831;&#32773;&#22995;&#21517;&#20013;&#30340;&#31181;&#26063;&#36523;&#20221;&#32447;&#32034;&#12290;
&lt;/p&gt;
&lt;p&gt;
Large language models offer significant potential for optimising professional activities, such as streamlining personnel selection procedures. However, concerns exist about these models perpetuating systemic biases embedded into their pre-training data. This study explores whether ChatGPT, a chatbot producing human-like responses to language tasks, displays ethnic or gender bias in job applicant screening. Using a correspondence audit approach, I simulated a CV screening task in which I instructed the chatbot to rate fictitious applicant profiles only differing in names, signalling ethnic and gender identity. Comparing ratings of Arab, Asian, Black American, Central African, Dutch, Eastern European, Hispanic, Turkish, and White American male and female applicants, I show that ethnic and gender identity influence ChatGPT's evaluations. The ethnic bias appears to arise partly from the prompts' language and partly from ethnic identity cues in applicants' names. Although ChatGPT produces n
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#32593;&#32476;&#23454;&#39564;&#20013;&#30340;&#22240;&#26524;&#25512;&#26029;&#12290;&#30740;&#31350;&#21457;&#29616;&#36828;&#31163;&#28966;&#28857;&#20010;&#20307;&#30340;&#22788;&#29702;&#23545;&#28966;&#28857;&#20010;&#20307;&#30340;&#25928;&#24212;&#20250;&#20943;&#24369;&#20294;&#20173;&#26377;&#21487;&#33021;&#19981;&#20026;&#38646;&#12290;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#22238;&#24402;&#20998;&#26512;&#30340;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#19981;&#20165;&#33021;&#22815;&#25552;&#20379;&#26631;&#20934;&#35823;&#20272;&#35745;&#22120;&#65292;&#36824;&#33021;&#22815;&#25972;&#21512;&#21327;&#21464;&#37327;&#12290;</title><link>http://arxiv.org/abs/2309.07476</link><description>&lt;p&gt;
&#32593;&#32476;&#23454;&#39564;&#20013;&#30340;&#22240;&#26524;&#25512;&#26029;&#65306;&#22522;&#20110;&#22238;&#24402;&#20998;&#26512;&#21644;&#22522;&#20110;&#35774;&#35745;&#30340;&#24615;&#36136;
&lt;/p&gt;
&lt;p&gt;
Causal inference in network experiments: regression-based analysis and design-based properties. (arXiv:2309.07476v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.07476
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#32593;&#32476;&#23454;&#39564;&#20013;&#30340;&#22240;&#26524;&#25512;&#26029;&#12290;&#30740;&#31350;&#21457;&#29616;&#36828;&#31163;&#28966;&#28857;&#20010;&#20307;&#30340;&#22788;&#29702;&#23545;&#28966;&#28857;&#20010;&#20307;&#30340;&#25928;&#24212;&#20250;&#20943;&#24369;&#20294;&#20173;&#26377;&#21487;&#33021;&#19981;&#20026;&#38646;&#12290;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#22238;&#24402;&#20998;&#26512;&#30340;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#19981;&#20165;&#33021;&#22815;&#25552;&#20379;&#26631;&#20934;&#35823;&#20272;&#35745;&#22120;&#65292;&#36824;&#33021;&#22815;&#25972;&#21512;&#21327;&#21464;&#37327;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#32593;&#32476;&#23454;&#39564;&#24191;&#27867;&#29992;&#20110;&#30740;&#31350;&#21333;&#20301;&#20043;&#38388;&#30340;&#24178;&#25200;&#12290;&#22312;Leung&#31561;&#20154;&#24341;&#20837;&#30340;&#8220;&#36817;&#20284;&#37051;&#23621;&#24178;&#25200;&#8221;&#26694;&#26550;&#19979;&#65292;&#23545;&#20110;&#36828;&#31163;&#28966;&#28857;&#20010;&#20307;&#30340;&#20010;&#20307;&#20998;&#37197;&#30340;&#22788;&#29702;&#32467;&#26524;&#20250;&#23545;&#28966;&#28857;&#20010;&#20307;&#30340;&#21709;&#24212;&#20135;&#29983;&#20943;&#24369;&#25928;&#24212;&#65292;&#20294;&#25928;&#24212;&#20173;&#28982;&#21487;&#33021;&#19981;&#20026;&#38646;&#12290;Leung&#31561;&#20154;&#22312;&#24178;&#25200;&#23384;&#22312;&#19979;&#65292;&#24314;&#31435;&#20102;&#36870;&#27010;&#29575;&#21152;&#26435;&#20272;&#35745;&#22120;&#30340;&#19968;&#33268;&#24615;&#21644;&#28176;&#36827;&#27491;&#24577;&#24615;&#65292;&#29992;&#20110;&#20272;&#35745;&#22240;&#26524;&#25928;&#24212;&#12290;&#25105;&#20204;&#23558;&#36825;&#20123;&#28176;&#36827;&#32467;&#26524;&#25193;&#23637;&#21040;Hajek&#20272;&#35745;&#22120;&#65292;&#35813;&#20272;&#35745;&#22120;&#19982;&#22522;&#20110;&#26333;&#20809;&#27010;&#29575;&#30340;&#21152;&#26435;&#26368;&#23567;&#20108;&#20056;&#25311;&#21512;&#30340;&#31995;&#25968;&#22312;&#25968;&#20540;&#19978;&#26159;&#30456;&#21516;&#30340;&#12290;&#25968;&#20540;&#31561;&#25928;&#30340;&#22522;&#20110;&#22238;&#24402;&#30340;&#26041;&#27861;&#20855;&#26377;&#20004;&#20010;&#26174;&#33879;&#30340;&#20248;&#21183;&#65306;&#23427;&#21487;&#20197;&#36890;&#36807;&#30456;&#21516;&#30340;&#21152;&#26435;&#26368;&#23567;&#20108;&#20056;&#25311;&#21512;&#25552;&#20379;&#26631;&#20934;&#35823;&#20272;&#35745;&#22120;&#65292;&#24182;&#19988;&#23427;&#20801;&#35768;&#23558;&#21327;&#21464;&#37327;&#38598;&#25104;&#21040;&#20998;&#26512;&#20013;&#12290;
&lt;/p&gt;
&lt;p&gt;
Network experiments have been widely used in investigating interference among units. Under the ``approximate neighborhood interference" framework introduced by \cite{Leung2022}, treatments assigned to individuals farther from the focal individual result in a diminished effect on the focal individual's response, while the effect remains potentially nonzero. \cite{Leung2022} establishes the consistency and asymptotic normality of the inverse-probability weighting estimator for estimating causal effects in the presence of interference. We extend these asymptotic results to the Hajek estimator which is numerically identical to the coefficient from the weighted-least-squares fit based on the inverse probability of the exposure mapping. The numerically equivalent regression-based approach offers two notable advantages: it can provide standard error estimators through the same weighted-least-squares fit, and it allows for the integration of covariates into the analysis. Furthermore, we introd
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#36890;&#36807;&#23558;&#20154;&#31867;&#21442;&#19982;&#32773;&#19982;&#26426;&#22120;&#20154;&#29609;&#23478;&#37197;&#23545;&#65292;&#21457;&#29616;&#24403;&#19982;&#26426;&#22120;&#20154;&#37197;&#23545;&#26102;&#65292;&#20010;&#20307;&#34920;&#29616;&#20986;&#36739;&#39640;&#30340;&#29702;&#24615;&#27700;&#24179;&#65292;&#24182;&#22312;&#19981;&#21516;&#28216;&#25103;&#20013;&#20445;&#25345;&#31283;&#23450;&#27700;&#24179;&#12290;&#36825;&#20026;&#35780;&#20272;&#20010;&#20307;&#25112;&#30053;&#33021;&#21147;&#25552;&#20379;&#20102;&#19968;&#31181;&#26032;&#26041;&#27861;&#12290;</title><link>http://arxiv.org/abs/2309.07427</link><description>&lt;p&gt;
&#29992;&#20449;&#24565;&#25511;&#21046;&#26469;&#34913;&#37327;&#39640;&#38454;&#29702;&#24615;
&lt;/p&gt;
&lt;p&gt;
Measuring Higher-Order Rationality with Belief Control. (arXiv:2309.07427v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.07427
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#36890;&#36807;&#23558;&#20154;&#31867;&#21442;&#19982;&#32773;&#19982;&#26426;&#22120;&#20154;&#29609;&#23478;&#37197;&#23545;&#65292;&#21457;&#29616;&#24403;&#19982;&#26426;&#22120;&#20154;&#37197;&#23545;&#26102;&#65292;&#20010;&#20307;&#34920;&#29616;&#20986;&#36739;&#39640;&#30340;&#29702;&#24615;&#27700;&#24179;&#65292;&#24182;&#22312;&#19981;&#21516;&#28216;&#25103;&#20013;&#20445;&#25345;&#31283;&#23450;&#27700;&#24179;&#12290;&#36825;&#20026;&#35780;&#20272;&#20010;&#20307;&#25112;&#30053;&#33021;&#21147;&#25552;&#20379;&#20102;&#19968;&#31181;&#26032;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20165;&#22522;&#20110;&#36873;&#25321;&#25968;&#25454;&#30830;&#23450;&#20010;&#20307;&#30340;&#25112;&#30053;&#25512;&#29702;&#33021;&#21147;&#26159;&#19968;&#39033;&#22797;&#26434;&#30340;&#20219;&#21153;&#12290;&#36825;&#31181;&#22797;&#26434;&#24615;&#28304;&#20110;&#22797;&#26434;&#30340;&#29609;&#23478;&#21487;&#33021;&#23545;&#20854;&#20182;&#20154;&#26377;&#38750;&#22343;&#34913;&#30340;&#20449;&#24565;&#65292;&#23548;&#33268;&#38750;&#22343;&#34913;&#30340;&#34892;&#20026;&#12290;&#22312;&#25105;&#20204;&#30340;&#30740;&#31350;&#20013;&#65292;&#25105;&#20204;&#23558;&#20154;&#31867;&#21442;&#19982;&#32773;&#19982;&#24050;&#30693;&#23436;&#20840;&#29702;&#24615;&#30340;&#35745;&#31639;&#26426;&#29609;&#23478;&#37197;&#23545;&#12290;&#36890;&#36807;&#20351;&#29992;&#26426;&#22120;&#20154;&#29609;&#23478;&#65292;&#25105;&#20204;&#33021;&#22815;&#23558;&#26377;&#38480;&#30340;&#25512;&#29702;&#33021;&#21147;&#19982;&#20449;&#24565;&#24418;&#25104;&#21644;&#31038;&#20250;&#20559;&#24046;&#30456;&#21306;&#20998;&#24320;&#26469;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;&#24403;&#19982;&#26426;&#22120;&#20154;&#37197;&#23545;&#26102;&#65292;&#34987;&#35797;&#34920;&#29616;&#20986;&#22987;&#32456;&#36739;&#39640;&#30340;&#29702;&#24615;&#27700;&#24179;&#65292;&#24182;&#22312;&#19981;&#21516;&#28216;&#25103;&#20013;&#20445;&#25345;&#31283;&#23450;&#30340;&#29702;&#24615;&#27700;&#24179;&#65292;&#30456;&#27604;&#20043;&#19979;&#19982;&#20154;&#31867;&#37197;&#23545;&#26102;&#21017;&#19981;&#28982;&#12290;&#36825;&#34920;&#26126;&#25112;&#30053;&#25512;&#29702;&#21487;&#33021;&#30340;&#30830;&#26159;&#20010;&#20307;&#30340;&#19968;&#31181;&#19968;&#36143;&#29305;&#24449;&#12290;&#27492;&#22806;&#65292;&#30830;&#23450;&#30340;&#29702;&#24615;&#38480;&#21046;&#21487;&#20197;&#20316;&#20026;&#35780;&#20272;&#20010;&#20307;&#23545;&#20182;&#20154;&#20449;&#24565;&#36866;&#24403;&#25511;&#21046;&#26102;&#30340;&#25112;&#30053;&#33021;&#21147;&#30340;&#25351;&#26631;&#12290;
&lt;/p&gt;
&lt;p&gt;
Determining an individual's strategic reasoning capability based solely on choice data is a complex task. This complexity arises because sophisticated players might have non-equilibrium beliefs about others, leading to non-equilibrium actions. In our study, we pair human participants with computer players known to be fully rational. This use of robot players allows us to disentangle limited reasoning capacity from belief formation and social biases. Our results show that, when paired with robots, subjects consistently demonstrate higher levels of rationality and maintain stable rationality levels across different games compared to when paired with humans. This suggests that strategic reasoning might indeed be a consistent trait in individuals. Furthermore, the identified rationality limits could serve as a measure for evaluating an individual's strategic capacity when their beliefs about others are adequately controlled.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#36890;&#36807;&#20351;&#29992;&#32654;&#22269;&#21382;&#21490;&#25968;&#25454;&#65292;&#21457;&#29616;&#24403;&#20538;&#21153;&#25104;&#20026;&#36130;&#25919;&#36127;&#25285;&#26102;&#65292;&#25919;&#24220;&#36890;&#36807;&#38480;&#21046;&#20538;&#21153;&#21457;&#34892;&#26469;&#24212;&#23545;&#25903;&#20986;&#20914;&#20987;&#65292;&#23548;&#33268;&#36130;&#25919;&#25919;&#31574;&#22833;&#21435;&#20102;&#21050;&#28608;&#32463;&#27982;&#27963;&#21160;&#30340;&#33021;&#21147;&#12290;</title><link>http://arxiv.org/abs/2309.07371</link><description>&lt;p&gt;
&#20844;&#20849;&#20538;&#21153;&#30340;&#36130;&#25919;&#25104;&#26412;&#21644;&#25919;&#24220;&#25903;&#20986;&#20914;&#20987;
&lt;/p&gt;
&lt;p&gt;
The Fiscal Cost of Public Debt and Government Spending Shocks. (arXiv:2309.07371v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.07371
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#36890;&#36807;&#20351;&#29992;&#32654;&#22269;&#21382;&#21490;&#25968;&#25454;&#65292;&#21457;&#29616;&#24403;&#20538;&#21153;&#25104;&#20026;&#36130;&#25919;&#36127;&#25285;&#26102;&#65292;&#25919;&#24220;&#36890;&#36807;&#38480;&#21046;&#20538;&#21153;&#21457;&#34892;&#26469;&#24212;&#23545;&#25903;&#20986;&#20914;&#20987;&#65292;&#23548;&#33268;&#36130;&#25919;&#25919;&#31574;&#22833;&#21435;&#20102;&#21050;&#28608;&#32463;&#27982;&#27963;&#21160;&#30340;&#33021;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#20844;&#20849;&#20538;&#21153;&#25104;&#26412;&#22914;&#20309;&#22609;&#36896;&#36130;&#25919;&#25919;&#31574;&#21450;&#20854;&#23545;&#32463;&#27982;&#30340;&#24433;&#21709;&#12290;&#21033;&#29992;&#32654;&#22269;&#30340;&#21382;&#21490;&#25968;&#25454;&#65292;&#25105;&#34920;&#26126;&#24403;&#20538;&#21153;&#26381;&#21153;&#25104;&#20026;&#36130;&#25919;&#36127;&#25285;&#26102;&#65292;&#25919;&#24220;&#36890;&#36807;&#38480;&#21046;&#20538;&#21153;&#21457;&#34892;&#26469;&#24212;&#23545;&#25903;&#20986;&#20914;&#20987;&#12290;&#22240;&#27492;&#65292;&#21021;&#22987;&#20914;&#20987;&#21482;&#22312;&#30701;&#26399;&#20869;&#24341;&#21457;&#23545;&#20844;&#20849;&#25903;&#20986;&#30340;&#26377;&#38480;&#22686;&#21152;&#65292;&#24182;&#19988;&#29978;&#33267;&#23548;&#33268;&#38271;&#26399;&#20869;&#30340;&#25903;&#20986;&#36870;&#36716;&#12290;&#22312;&#36825;&#31181;&#24773;&#20917;&#19979;&#65292;&#36130;&#25919;&#25919;&#31574;&#22833;&#21435;&#20102;&#21050;&#28608;&#32463;&#27982;&#27963;&#21160;&#30340;&#33021;&#21147;&#12290;&#36825;&#19968;&#32467;&#26524;&#26159;&#30001;&#20110;&#36130;&#25919;&#24403;&#23616;&#38480;&#21046;&#33258;&#36523;&#20511;&#27454;&#33021;&#21147;&#20197;&#30830;&#20445;&#20844;&#20849;&#20538;&#21153;&#21487;&#25345;&#32493;&#24615;&#12290;&#36825;&#20123;&#21457;&#29616;&#22312;&#22810;&#20010;&#35782;&#21035;&#21644;&#20272;&#35745;&#31574;&#30053;&#19979;&#37117;&#20855;&#26377;&#40065;&#26834;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper investigates how the cost of public debt shapes fiscal policy and its effect on the economy. Using U.S. historical data, I show that when servicing the debt creates a fiscal burden, the government responds to spending shocks by limiting debt issuance. As a result, the initial shock triggers only a limited increase in public spending in the short run, and even leads to spending reversal in the long run. Under these conditions, fiscal policy loses its ability to stimulate economic activity. This outcome arises as the fiscal authority limits its own ability to borrow to ensure public debt sustainability. These findings are robust to several identification and estimation strategies.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#37197;&#39069;&#26426;&#21046;&#22312;&#20195;&#29702;&#20154;&#38754;&#20020;&#22810;&#20010;&#20915;&#31574;&#19988;&#36135;&#24065;&#36716;&#31227;&#19981;&#21487;&#34892;&#26102;&#30340;&#24212;&#29992;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#38543;&#30528;&#20915;&#31574;&#25968;&#37327;&#30340;&#22686;&#21152;&#65292;&#37197;&#39069;&#26426;&#21046;&#21487;&#20197;&#23454;&#29616;&#19982;&#20351;&#29992;&#36716;&#31227;&#30340;&#29420;&#31435;&#26426;&#21046;&#30456;&#21516;&#30340;&#31038;&#20250;&#36873;&#25321;&#20989;&#25968;&#38598;&#21512;&#65292;&#24182;&#19988;&#23545;&#20110;&#20195;&#29702;&#23545;&#24444;&#27492;&#30340;&#20449;&#24565;&#26159;&#40065;&#26834;&#30340;&#12290;&#30740;&#31350;&#36824;&#21457;&#29616;&#65292;&#20026;&#20102;&#35774;&#32622;&#27491;&#30830;&#30340;&#37197;&#39069;&#65292;&#35774;&#35745;&#32773;&#24517;&#39035;&#23545;&#29615;&#22659;&#26377;&#31934;&#30830;&#30340;&#20102;&#35299;&#65292;&#21542;&#21017;&#21482;&#33021;&#23454;&#26045;&#24179;&#20961;&#30340;&#31038;&#20250;&#36873;&#25321;&#35268;&#21017;&#12290;&#21516;&#26102;&#65292;&#37197;&#39069;&#20351;&#24471;&#25253;&#21578;&#30340;&#20998;&#24067;&#25104;&#20026;&#20849;&#30693;&#12290;</title><link>http://arxiv.org/abs/2309.07363</link><description>&lt;p&gt;
&#38142;&#25509;&#26426;&#21046;&#65306;&#38480;&#21046;&#21644;&#40065;&#26834;&#24615;
&lt;/p&gt;
&lt;p&gt;
Linking Mechanisms: Limits and Robustness. (arXiv:2309.07363v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.07363
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#37197;&#39069;&#26426;&#21046;&#22312;&#20195;&#29702;&#20154;&#38754;&#20020;&#22810;&#20010;&#20915;&#31574;&#19988;&#36135;&#24065;&#36716;&#31227;&#19981;&#21487;&#34892;&#26102;&#30340;&#24212;&#29992;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#38543;&#30528;&#20915;&#31574;&#25968;&#37327;&#30340;&#22686;&#21152;&#65292;&#37197;&#39069;&#26426;&#21046;&#21487;&#20197;&#23454;&#29616;&#19982;&#20351;&#29992;&#36716;&#31227;&#30340;&#29420;&#31435;&#26426;&#21046;&#30456;&#21516;&#30340;&#31038;&#20250;&#36873;&#25321;&#20989;&#25968;&#38598;&#21512;&#65292;&#24182;&#19988;&#23545;&#20110;&#20195;&#29702;&#23545;&#24444;&#27492;&#30340;&#20449;&#24565;&#26159;&#40065;&#26834;&#30340;&#12290;&#30740;&#31350;&#36824;&#21457;&#29616;&#65292;&#20026;&#20102;&#35774;&#32622;&#27491;&#30830;&#30340;&#37197;&#39069;&#65292;&#35774;&#35745;&#32773;&#24517;&#39035;&#23545;&#29615;&#22659;&#26377;&#31934;&#30830;&#30340;&#20102;&#35299;&#65292;&#21542;&#21017;&#21482;&#33021;&#23454;&#26045;&#24179;&#20961;&#30340;&#31038;&#20250;&#36873;&#25321;&#35268;&#21017;&#12290;&#21516;&#26102;&#65292;&#37197;&#39069;&#20351;&#24471;&#25253;&#21578;&#30340;&#20998;&#24067;&#25104;&#20026;&#20849;&#30693;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#37197;&#39069;&#26426;&#21046;&#22312;&#20195;&#29702;&#38754;&#23545;&#22810;&#20010;&#20915;&#31574;&#19988;&#36135;&#24065;&#36716;&#31227;&#19981;&#21487;&#34892;&#26102;&#24120;&#34987;&#29992;&#20110;&#24341;&#20986;&#31169;&#20154;&#20449;&#24687;&#12290;&#24403;&#20915;&#31574;&#25968;&#37327;&#22686;&#21152;&#26102;&#65292;&#37197;&#39069;&#26426;&#21046;&#28176;&#36817;&#22320;&#23454;&#26045;&#19982;&#20351;&#29992;&#36716;&#31227;&#30340;&#29420;&#31435;&#26426;&#21046;&#30456;&#21516;&#30340;&#31038;&#20250;&#36873;&#25321;&#20989;&#25968;&#38598;&#21512;&#12290;&#25105;&#20204;&#20998;&#26512;&#20102;&#37197;&#39069;&#26426;&#21046;&#30340;&#40065;&#26834;&#24615;&#12290;&#20026;&#20102;&#35774;&#32622;&#27491;&#30830;&#30340;&#37197;&#39069;&#65292;&#35774;&#35745;&#32773;&#24517;&#39035;&#23545;&#29615;&#22659;&#26377;&#31934;&#30830;&#30340;&#20102;&#35299;&#12290;&#25105;&#20204;&#35777;&#26126;&#65292;&#27809;&#26377;&#36716;&#31227;&#30340;&#24773;&#20917;&#19979;&#65292;&#21482;&#26377;&#24179;&#20961;&#30340;&#31038;&#20250;&#36873;&#25321;&#35268;&#21017;&#21487;&#20197;&#20197;&#20808;&#39564;&#29420;&#31435;&#30340;&#26041;&#24335;&#23454;&#26045;&#12290;&#24403;&#37197;&#39069;&#19981;&#21305;&#37197;&#30495;&#23454;&#30340;&#31867;&#22411;&#20998;&#24067;&#26102;&#65292;&#25105;&#20204;&#24471;&#21040;&#20102;&#20915;&#31574;&#35823;&#24046;&#30340;&#32039;&#23494;&#30028;&#38480;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#35777;&#26126;&#22312;&#22810;&#20195;&#29702;&#30340;&#29615;&#22659;&#20013;&#65292;&#37197;&#39069;&#23545;&#20110;&#20195;&#29702;&#23545;&#24444;&#27492;&#30340;&#20449;&#24565;&#26159;&#40065;&#26834;&#30340;&#12290;&#20851;&#38190;&#26159;&#65292;&#37197;&#39069;&#20351;&#24471;&#25253;&#21578;&#30340;&#20998;&#24067;&#25104;&#20026;&#20849;&#30693;&#12290;
&lt;/p&gt;
&lt;p&gt;
Quota mechanisms are commonly used to elicit private information when agents face multiple decisions and monetary transfers are infeasible. As the number of decisions grows large, quotas asymptotically implement the same set of social choice functions as do separate mechanisms with transfers. We analyze the robustness of quota mechanisms. To set the correct quota, the designer must have precise knowledge of the environment. We show that, without transfers, only trivial social choice rules can be implemented in a prior-independent way. We obtain a tight bound on the decision error that results when the quota does not match the true type distribution. Finally, we show that in a multi-agent setting, quotas are robust to agents' beliefs about each other. Crucially, quotas make the distribution of reports common knowledge.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#36890;&#36807;&#29702;&#35770;&#20998;&#26512;&#21644;&#32463;&#39564;&#24314;&#27169;&#65292;&#25506;&#35752;&#20102;&#23478;&#24237;&#20027;&#22919;&#21171;&#21160;&#23545;GDP&#35745;&#31639;&#30340;&#24433;&#21709;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#20154;&#31867;&#29305;&#24449;&#30340;&#21464;&#21270;&#23548;&#33268;&#20102;&#26377;&#38480;&#29702;&#24615;&#20010;&#20307;&#29305;&#24449;&#30340;&#24418;&#25104;&#65292;&#22899;&#24615;&#26356;&#20542;&#21521;&#20110;&#25104;&#20026;&#23478;&#24237;&#20027;&#22919;&#30340;&#36873;&#25321;&#12290;&#23454;&#35777;&#20998;&#26512;&#25581;&#31034;&#20102;&#23478;&#24237;&#20027;&#22919;&#21171;&#21160;&#30340;&#32463;&#27982;&#20215;&#20540;&#12290;</title><link>http://arxiv.org/abs/2309.07160</link><description>&lt;p&gt;
&#20027;&#22919;&#21171;&#21160;&#23545;GDP&#35745;&#31639;&#30340;&#24433;&#21709;
&lt;/p&gt;
&lt;p&gt;
The effect of housewife labor on gdp calculations. (arXiv:2309.07160v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.07160
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#36890;&#36807;&#29702;&#35770;&#20998;&#26512;&#21644;&#32463;&#39564;&#24314;&#27169;&#65292;&#25506;&#35752;&#20102;&#23478;&#24237;&#20027;&#22919;&#21171;&#21160;&#23545;GDP&#35745;&#31639;&#30340;&#24433;&#21709;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#20154;&#31867;&#29305;&#24449;&#30340;&#21464;&#21270;&#23548;&#33268;&#20102;&#26377;&#38480;&#29702;&#24615;&#20010;&#20307;&#29305;&#24449;&#30340;&#24418;&#25104;&#65292;&#22899;&#24615;&#26356;&#20542;&#21521;&#20110;&#25104;&#20026;&#23478;&#24237;&#20027;&#22919;&#30340;&#36873;&#25321;&#12290;&#23454;&#35777;&#20998;&#26512;&#25581;&#31034;&#20102;&#23478;&#24237;&#20027;&#22919;&#21171;&#21160;&#30340;&#32463;&#27982;&#20215;&#20540;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#35797;&#22270;&#36890;&#36807;&#29702;&#35770;&#20998;&#26512;&#25581;&#31034;&#21171;&#21160;&#21147;&#30340;&#28436;&#21270;&#21457;&#23637;&#12290;&#20197;&#34913;&#37327;&#31038;&#20250;&#31119;&#21033;&#30340;GDP&#20026;&#20363;&#65292;&#35797;&#22270;&#36890;&#36807;&#32463;&#39564;&#24314;&#27169;&#26469;&#34913;&#37327;&#23478;&#24237;&#20027;&#22919;&#21171;&#21160;&#30340;&#32463;&#27982;&#20215;&#20540;&#12290;&#20026;&#27492;&#65292;&#39318;&#20808;&#36136;&#30097;&#20102;&#27491;&#32479;&#65288;&#20027;&#27969;&#65289;&#32463;&#27982;&#29702;&#35770;&#20013;&#21171;&#21160;&#30340;&#27010;&#24565;&#65307;&#28982;&#21518;&#65292;&#25682;&#24323;&#21171;&#21160;&#23601;&#19994;&#20851;&#31995;&#65292;&#32771;&#23519;&#20102;&#22312;&#36164;&#26412;&#20027;&#20041;&#20307;&#21046;&#19979;&#22833;&#19994;&#30340;&#26080;&#20607;&#23478;&#24237;&#20027;&#22919;&#21171;&#21160;&#23545;GDP&#30340;&#24433;&#21709;&#12290;&#22312;&#29702;&#35770;&#20998;&#26512;&#20013;&#65292;&#30830;&#23450;&#20102;&#20154;&#31867;&#29305;&#24449;&#30340;&#21464;&#21270;&#20351;&#20854;&#36828;&#31163;&#29702;&#24615;&#65292;&#24418;&#25104;&#20102;&#26377;&#38480;&#29702;&#24615;&#21644;&#24322;&#36136;&#20010;&#20307;&#29305;&#24449;&#30340;&#38480;&#21046;&#29702;&#24615;&#20010;&#20307;&#29305;&#24449;&#12290;&#23558;&#22899;&#24615;&#23450;&#20041;&#20026;&#24322;&#36136;&#20010;&#20307;&#30340;&#26032;&#20363;&#23376;&#65292;&#22240;&#20026;&#22905;&#20204;&#26356;&#36866;&#21512;&#26377;&#38480;&#29702;&#24615;&#20010;&#20307;&#30340;&#23450;&#20041;&#65292;&#21363;&#26356;&#20542;&#21521;&#20110;&#25104;&#20026;&#23478;&#24237;&#20027;&#22919;&#12290;&#22312;&#26412;&#30740;&#31350;&#30340;&#23454;&#35777;&#20998;&#26512;&#20013;&#65292;&#23545;&#23478;&#24237;&#20027;&#22919;&#21171;&#21160;&#36827;&#34892;&#20102;&#30740;&#31350;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this study, the evolutionary development of labor has been tried to be revealed based on theoretical analysis. Using the example of gdp, which is an indicator of social welfare, the economic value of the labor of housewives was tried to be measured with an empirical modeling. To this end; first of all, the concept of labor was questioned in orthodox (mainstream) economic theories; then, by abstracting from the labor-employment relationship, it was examined what effect the labor of unpaid housewives who are unemployed in the capitalist system could have on gdp. In theoretical analysis; It has been determined that the changing human profile moves away from rationality and creates limited rationality and, accordingly, a heterogeneous individual profile. Women were defined as the new example of heterogeneous individuals, as those who best fit the definition of limited rational individuals because they prefer to be housewives. In the empirical analysis of the study, housewife labor was t
&lt;/p&gt;</description></item><item><title>&#36825;&#31687;&#35770;&#25991;&#23637;&#31034;&#20102;&#22312;&#22810;&#20010;&#24322;&#26500;&#29289;&#21697;&#30340;&#26426;&#21046;&#35774;&#35745;&#38382;&#39064;&#19982;&#22312;&#30456;&#21516;&#29289;&#21697;&#30340;&#26426;&#21046;&#35774;&#35745;&#38382;&#39064;&#20043;&#38388;&#30340;&#31561;&#20215;&#24615;&#65292;&#21516;&#26102;&#25552;&#20986;&#20102;&#20445;&#25345;&#25490;&#21517;&#30340;&#23545;&#31216;&#21644;&#28608;&#21169;&#30456;&#23481;&#26426;&#21046;&#65292;&#24182;&#22312;&#19977;&#20010;&#24212;&#29992;&#20013;&#36827;&#34892;&#20102;&#20351;&#29992;&#12290;</title><link>http://arxiv.org/abs/2209.10137</link><description>&lt;p&gt;
&#20445;&#25345;&#25490;&#21517;&#30340;&#22810;&#32500;&#24230;&#26426;&#21046;
&lt;/p&gt;
&lt;p&gt;
Rank-Preserving Multidimensional Mechanisms. (arXiv:2209.10137v3 [econ.TH] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2209.10137
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#23637;&#31034;&#20102;&#22312;&#22810;&#20010;&#24322;&#26500;&#29289;&#21697;&#30340;&#26426;&#21046;&#35774;&#35745;&#38382;&#39064;&#19982;&#22312;&#30456;&#21516;&#29289;&#21697;&#30340;&#26426;&#21046;&#35774;&#35745;&#38382;&#39064;&#20043;&#38388;&#30340;&#31561;&#20215;&#24615;&#65292;&#21516;&#26102;&#25552;&#20986;&#20102;&#20445;&#25345;&#25490;&#21517;&#30340;&#23545;&#31216;&#21644;&#28608;&#21169;&#30456;&#23481;&#26426;&#21046;&#65292;&#24182;&#22312;&#19977;&#20010;&#24212;&#29992;&#20013;&#36827;&#34892;&#20102;&#20351;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#23637;&#31034;&#20102;&#23545;&#20110;&#19968;&#20010;&#22404;&#26029;&#32773;&#21521;&#19968;&#20010;&#20855;&#26377;&#21069;&#26399;&#23545;&#31216;&#21644;&#21487;&#21152;&#20540;&#30340;&#20080;&#23478;&#20986;&#21806;&#22810;&#20010;&#24322;&#26500;&#29289;&#21697;&#30340;&#26426;&#21046;&#35774;&#35745;&#38382;&#39064;&#19982;&#23545;&#20110;&#19968;&#20010;&#21521;&#19968;&#20010;&#20855;&#26377;&#36882;&#20943;&#36793;&#38469;&#20540;&#30340;&#20080;&#23478;&#20986;&#21806;&#30456;&#21516;&#29289;&#21697;&#30340;&#22404;&#26029;&#32773;&#30340;&#26426;&#21046;&#35774;&#35745;&#38382;&#39064;&#26159;&#31561;&#20215;&#30340;&#12290;&#23545;&#20110;&#24322;&#26500;&#29289;&#21697;&#65292;&#23545;&#31216;&#21644;&#28608;&#21169;&#30456;&#23481;&#30340;&#26426;&#21046;&#26159;&#20445;&#25345;&#25490;&#21517;&#30340;&#65292;&#21363;&#39640;&#20215;&#20540;&#29289;&#21697;&#20855;&#26377;&#26356;&#39640;&#30340;&#20998;&#37197;&#27010;&#29575;&#12290;&#22312;&#30456;&#21516;&#29289;&#21697;&#27169;&#22411;&#20013;&#65292;&#27599;&#20010;&#26426;&#21046;&#37117;&#26159;&#20445;&#25345;&#25490;&#21517;&#30340;&#12290;&#36825;&#20419;&#36827;&#20102;&#25105;&#20204;&#22312;&#19977;&#20010;&#24212;&#29992;&#20013;&#30340;&#31561;&#20215;&#24615;&#30340;&#20351;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;
We show that the mechanism-design problem for a monopolist selling multiple, heterogeneous objects to a buyer with ex ante symmetric and additive values is equivalent to the mechanism-design problem for a monopolist selling identical objects to a buyer with decreasing marginal values. Symmetric and incentive-compatible mechanisms for heterogeneous objects are rank preserving, i.e., higher-valued objects are assigned with a higher probability. In the identical-objects model, every mechanism is rank preserving. This facilitates the equivalence, which we use in three applications.
&lt;/p&gt;</description></item></channel></rss>