<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#25105;&#20204;&#30740;&#31350;&#20102;&#25293;&#21334;&#20013;&#23450;&#20215;&#23545;&#20080;&#23478;&#21097;&#20313;&#20998;&#37197;&#30340;&#24433;&#21709;&#65292;&#24182;&#25552;&#20986;&#20102;&#36194;&#23478;&#30340;&#32463;&#39564;&#26041;&#24046;&#20316;&#20026;&#19968;&#20010;&#21097;&#20313;&#20844;&#24179;&#30340;&#24230;&#37327;&#26631;&#20934;&#65292;&#34920;&#26126;&#22312;&#19968;&#23450;&#31169;&#26377;-&#20844;&#20849;&#20215;&#20540;&#27604;&#20363;&#19979;&#65292;&#25353;&#31454;&#26631;&#25903;&#20184;&#21644;&#32479;&#19968;&#23450;&#20215;&#28151;&#21512;&#21487;&#20197;&#26368;&#23567;&#21270;&#21097;&#20313;&#30340;&#26041;&#24046;&#12290;</title><link>https://arxiv.org/abs/2403.07799</link><description>&lt;p&gt;
&#25293;&#21334;&#20013;&#30340;&#20844;&#24179;&#23450;&#20215;
&lt;/p&gt;
&lt;p&gt;
Equitable Pricing in Auctions
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.07799
&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#25293;&#21334;&#20013;&#23450;&#20215;&#23545;&#20080;&#23478;&#21097;&#20313;&#20998;&#37197;&#30340;&#24433;&#21709;&#65292;&#24182;&#25552;&#20986;&#20102;&#36194;&#23478;&#30340;&#32463;&#39564;&#26041;&#24046;&#20316;&#20026;&#19968;&#20010;&#21097;&#20313;&#20844;&#24179;&#30340;&#24230;&#37327;&#26631;&#20934;&#65292;&#34920;&#26126;&#22312;&#19968;&#23450;&#31169;&#26377;-&#20844;&#20849;&#20215;&#20540;&#27604;&#20363;&#19979;&#65292;&#25353;&#31454;&#26631;&#25903;&#20184;&#21644;&#32479;&#19968;&#23450;&#20215;&#28151;&#21512;&#21487;&#20197;&#26368;&#23567;&#21270;&#21097;&#20313;&#30340;&#26041;&#24046;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#23450;&#20215;&#22914;&#20309;&#24433;&#21709;&#22312;&#22810;&#21333;&#20301;&#25293;&#21334;&#20013;&#20080;&#23478;&#20043;&#38388;&#30340;&#21097;&#20313;&#20998;&#37197;&#12290;&#25105;&#20204;&#30340;&#20844;&#24179;&#30446;&#26631;&#21487;&#33021;&#24456;&#37325;&#35201;&#65292;&#20363;&#22914;&#65292;&#23545;&#20110;&#19979;&#28216;&#24066;&#22330;&#20013;&#30340;&#31454;&#20105;&#38382;&#39064;&#65292;&#36825;&#26159;&#23545;&#38271;&#26399;&#20851;&#20110;&#25910;&#20837;&#21644;&#25928;&#29575;&#30340;&#36777;&#35770;&#30340;&#19968;&#20010;&#34917;&#20805;&#12290;&#25105;&#20204;&#30740;&#31350;&#20102;&#19968;&#20010;&#32463;&#20856;&#30340;&#22810;&#19981;&#21487;&#20998;&#21333;&#20803;&#25293;&#21334;&#27169;&#22411;&#65292;&#20854;&#20013;&#26377;&#21333;&#20301;&#38656;&#27714;&#30340;&#20080;&#23478;&#21644;&#20855;&#26377;&#31169;&#26377;&#21644;&#20844;&#20849;&#25104;&#20998;&#30340;&#20272;&#20540;&#65292;&#24182;&#32771;&#34385;&#20102;&#25152;&#26377;&#23450;&#20215;&#35268;&#21017;&#65292;&#36825;&#20123;&#35268;&#21017;&#26159;&#25353;&#31454;&#26631;&#25903;&#20184;&#21644;&#32479;&#19968;&#23450;&#20215;&#30340;&#28151;&#21512;&#65288;&#21363;&#20984;&#32452;&#21512;&#65289;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#36194;&#23478;&#30340;&#32463;&#39564;&#26041;&#24046;&#65288;WEV&#65289;&#65292;&#21363;&#36194;&#23478;&#20043;&#38388;&#21097;&#20313;&#30340;&#39044;&#26399;&#32463;&#39564;&#26041;&#24046;&#65292;&#20316;&#20026;&#21097;&#20313;&#20844;&#24179;&#30340;&#24230;&#37327;&#26631;&#20934;&#12290;&#25105;&#20204;&#34920;&#26126;&#65292;&#22312;&#19968;&#31995;&#21015;&#31169;&#26377;-&#20844;&#20849;&#20215;&#20540;&#27604;&#20363;&#20013;&#65292;&#25216;&#26415;&#20869;&#37096;&#30340;&#25353;&#31454;&#26631;&#20184;&#36153;&#21644;&#32479;&#19968;&#23450;&#20215;&#28151;&#21512;&#26368;&#23567;&#21270;&#20102;WEV&#12290;&#20174;&#20844;&#24179;&#30340;&#35282;&#24230;&#26469;&#30475;&#65292;&#20855;&#26377;&#26356;&#39640;&#31169;&#26377;&#20540;&#25104;&#20998;&#30340;&#25293;&#21334;&#21463;&#30410;&#20110;&#26356;&#22810;&#30340;&#20215;&#26684;&#27495;&#35270;&#65292;&#32780;&#20165;&#20855;&#26377;&#36275;&#22815;&#22823;&#23567;&#31169;&#26377;&#20540;&#25104;&#20998;&#30340;&#25293;&#21334;&#25165;&#33021;&#33719;&#30410;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.07799v1 Announce Type: new  Abstract: We study how pricing affects the division of surplus among buyers in auctions for multiple units. Our equity objective may be important, e.g., for competition concerns in downstream markets, complementing the long-standing debate on revenue and efficiency. We study a canonical model of auctions for multiple indivisible units with unit demand buyers and valuations with a private and a common component and consider all pricing rules that are a mixture (i.e., a convex combination) of pay-as-bid and uniform pricing. We propose the winners' empirical variance (WEV), the expected empirical variance of surplus among the winners, as a metric for surplus equity. We show that, for a range of private-common value proportions, a strictly interior mix of pay-as-bid and uniform pricing minimizes WEV. From an equity perspective, auctions with a higher private value component benefit from more price discrimination, whereas only auctions with a sufficien
&lt;/p&gt;</description></item><item><title>&#21463;&#30123;&#24773;&#24433;&#21709;&#65292;&#35843;&#26597;&#26174;&#31034;&#20154;&#20204;&#26356;&#23481;&#24525;&#22522;&#20110;&#25104;&#26412;&#20914;&#20987;&#32780;&#38750;&#38656;&#27714;&#20914;&#20987;&#30340;&#20215;&#26684;&#19978;&#28072;&#65292;&#19981;&#36807;&#19981;&#21516;&#31181;&#32676;&#21450;&#21830;&#21697;&#20043;&#38388;&#23384;&#22312;&#36739;&#22823;&#24046;&#24322;&#12290;</title><link>https://arxiv.org/abs/2403.07617</link><description>&lt;p&gt;
&#30123;&#24773;&#20013;&#30340;&#20215;&#26684;&#25805;&#32437;&#36824;&#26159;&#24066;&#22330;&#21147;&#37327;&#65311;&#20844;&#27491;&#24863;&#30693;&#19982;&#20215;&#26684;&#19978;&#28072;&#30340;&#20851;&#31995;
&lt;/p&gt;
&lt;p&gt;
Price Gouging or Market Forces? Fairness Perceptions of Price Hikes in the Pandemic
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.07617
&lt;/p&gt;
&lt;p&gt;
&#21463;&#30123;&#24773;&#24433;&#21709;&#65292;&#35843;&#26597;&#26174;&#31034;&#20154;&#20204;&#26356;&#23481;&#24525;&#22522;&#20110;&#25104;&#26412;&#20914;&#20987;&#32780;&#38750;&#38656;&#27714;&#20914;&#20987;&#30340;&#20215;&#26684;&#19978;&#28072;&#65292;&#19981;&#36807;&#19981;&#21516;&#31181;&#32676;&#21450;&#21830;&#21697;&#20043;&#38388;&#23384;&#22312;&#36739;&#22823;&#24046;&#24322;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25253;&#21578;&#20102;&#25105;&#20204;&#22312;2020&#24180;&#22312;&#32654;&#22269;&#21644;&#20197;&#33394;&#21015;&#36827;&#34892;&#30340;&#35843;&#26597;&#32467;&#26524;&#65292;&#24403;&#26102;&#38543;&#30528;&#30123;&#24773;&#20256;&#25773;&#65292;&#35768;&#22810;&#20215;&#26684;&#20986;&#29616;&#20102;&#19978;&#28072;&#12290;&#20026;&#20102;&#35780;&#20272;&#21463;&#35775;&#32773;&#23545;&#20215;&#26684;&#19978;&#28072;&#30340;&#30475;&#27861;&#65292;&#25105;&#20204;&#20851;&#27880;&#20102;&#22312;&#30123;&#24773;&#26399;&#38388;&#20215;&#26684;&#19978;&#28072;&#30340;&#21830;&#21697;&#65292;&#21253;&#25324;&#19968;&#20123;&#24517;&#38656;&#21697;&#12290;&#19982;&#21452;&#37325;&#26435;&#21033;&#21407;&#21017;&#19968;&#33268;&#65292;&#25105;&#20204;&#21457;&#29616;&#22914;&#26524;&#20215;&#26684;&#19978;&#28072;&#26159;&#30001;&#25104;&#26412;&#20914;&#20987;&#24341;&#36215;&#30340;&#65292;&#21463;&#35775;&#32773;&#35748;&#20026;&#36825;&#31181;&#24773;&#20917;&#26356;&#20026;&#21487;&#25509;&#21463;&#65292;&#32780;&#22914;&#26524;&#26159;&#30001;&#38656;&#27714;&#20914;&#20987;&#23548;&#33268;&#30340;&#65292;&#21017;&#35748;&#20026;&#19981;&#22826;&#21487;&#25509;&#21463;&#12290;&#28982;&#32780;&#65292;&#25105;&#20204;&#36824;&#21457;&#29616;&#20004;&#20010;&#31181;&#32676;&#20197;&#21450;&#21830;&#21697;&#20043;&#38388;&#23384;&#22312;&#24456;&#22823;&#30340;&#24046;&#24322;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.07617v1 Announce Type: new  Abstract: We report the results of surveys we conducted in the US and Israel in 2020, a time when many prices increased following the spread of the pandemic. To assess respondents perceptions of price increases, we focus on goods whose prices have increased during the pandemic, including some essential goods. Consistent with the principle of dual entitlement, we find that respondents perceive price increases as more acceptable if they are due to cost shocks than if they are due to demand shocks. However, we also find large differences across the two populations, as well as across goods.
&lt;/p&gt;</description></item><item><title>&#19981;&#21516;&#32789;&#20316;&#23454;&#36341;&#22914;&#26377;&#26426;&#32789;&#20316;&#12289;&#35206;&#30422;&#20316;&#29289;&#12289;&#20445;&#25252;&#32789;&#20316;&#21644;&#20892;&#26519;&#22797;&#21512;&#23545;&#25552;&#39640;&#22303;&#22756;&#26377;&#26426;&#30899;&#21547;&#37327;&#36215;&#30528;&#37325;&#35201;&#20316;&#29992;&#65292;&#36890;&#36807;&#22686;&#21152;&#24494;&#29983;&#29289;&#27963;&#24615;&#12289;&#20445;&#25345;&#22303;&#22756;&#32467;&#26500;&#21644;&#21152;&#24555;&#20859;&#20998;&#24490;&#29615;&#31561;&#26041;&#24335;&#26469;&#21487;&#25345;&#32493;&#22686;&#21152;&#22303;&#22756;SOC&#21547;&#37327;&#12290;</title><link>https://arxiv.org/abs/2403.07530</link><description>&lt;p&gt;
&#19981;&#21516;&#20892;&#19994;&#23454;&#36341;&#23545;&#32789;&#20316;&#22303;&#22756;&#30340;&#30899;&#32463;&#27982;&#23398;
&lt;/p&gt;
&lt;p&gt;
Carbon Economics of Different Agricultural Practices for Farming Soil
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.07530
&lt;/p&gt;
&lt;p&gt;
&#19981;&#21516;&#32789;&#20316;&#23454;&#36341;&#22914;&#26377;&#26426;&#32789;&#20316;&#12289;&#35206;&#30422;&#20316;&#29289;&#12289;&#20445;&#25252;&#32789;&#20316;&#21644;&#20892;&#26519;&#22797;&#21512;&#23545;&#25552;&#39640;&#22303;&#22756;&#26377;&#26426;&#30899;&#21547;&#37327;&#36215;&#30528;&#37325;&#35201;&#20316;&#29992;&#65292;&#36890;&#36807;&#22686;&#21152;&#24494;&#29983;&#29289;&#27963;&#24615;&#12289;&#20445;&#25345;&#22303;&#22756;&#32467;&#26500;&#21644;&#21152;&#24555;&#20859;&#20998;&#24490;&#29615;&#31561;&#26041;&#24335;&#26469;&#21487;&#25345;&#32493;&#22686;&#21152;&#22303;&#22756;SOC&#21547;&#37327;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22303;&#22756;&#26377;&#26426;&#30899;&#65288;SOC&#65289;&#30340;&#27969;&#22833;&#23545;&#19990;&#30028;&#21508;&#22320;&#30340;&#20892;&#19994;&#21487;&#25345;&#32493;&#24615;&#26500;&#25104;&#20005;&#37325;&#21361;&#38505;&#12290;&#26412;&#32508;&#36848;&#32771;&#23519;&#20102;&#21508;&#31181;&#32789;&#20316;&#23454;&#36341;&#21450;&#20854;&#23545;&#22303;&#22756;&#26377;&#26426;&#30899;&#20648;&#23384;&#30340;&#24433;&#21709;&#12290;&#22312;&#20180;&#32454;&#23457;&#38405;&#25991;&#29486;&#21518;&#65292;&#22823;&#37096;&#20998;&#30740;&#31350;&#34920;&#26126;&#65292;&#26377;&#26426;&#32789;&#20316;&#12289;&#35206;&#30422;&#20316;&#29289;&#12289;&#20445;&#25252;&#32789;&#20316;&#21644;&#20892;&#26519;&#22797;&#21512;&#31561;&#19981;&#21516;&#32789;&#20316;&#23454;&#36341;&#22312;&#21487;&#25345;&#32493;&#22686;&#21152;&#22303;&#22756;SOC&#21547;&#37327;&#20013;&#21457;&#25381;&#30528;&#37325;&#35201;&#20316;&#29992;&#12290;&#35206;&#30422;&#20316;&#29289;&#30340;&#26681;&#31995;&#20998;&#27852;&#29289;&#22686;&#21152;&#20102;&#24494;&#29983;&#29289;&#27963;&#24615;&#65292;&#24182;&#26377;&#21161;&#20110;&#23558;&#22797;&#26434;&#26377;&#26426;&#21270;&#21512;&#29289;&#20998;&#35299;&#20026;&#26377;&#26426;&#30899;&#12290;&#20445;&#25252;&#32789;&#20316;&#22686;&#24378;&#20102;&#22303;&#22756;&#32467;&#26500;&#65292;&#24182;&#22312;&#19981;&#25200;&#20081;&#22303;&#22756;&#30340;&#24773;&#20917;&#19979;&#20445;&#25345;&#30899;&#20648;&#23384;&#12290;&#20892;&#26519;&#22797;&#21512;&#31995;&#32479;&#22686;&#21152;&#26377;&#26426;&#30899;&#36755;&#20837;&#65292;&#21152;&#24555;&#20859;&#20998;&#24490;&#29615;&#65292;&#22240;&#20026;&#26641;&#26408;&#21644;&#20316;&#29289;&#20855;&#26377;&#20849;&#29983;&#20851;&#31995;&#12290;&#38388;&#20316;&#21644;&#36718;&#20316;&#22312;&#25913;&#21464;&#26893;&#29289;&#27531;&#20307;&#32452;&#25104;&#21644;&#20419;&#36827;&#30899;&#20648;&#23384;&#26041;&#38754;&#21457;&#25381;&#20316;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.07530v1 Announce Type: new  Abstract: The loss of soil organic carbon (SOC) poses a severe danger to agricultural sustainability around the World. This review examines various farming practices and their impact on soil organic carbon storage. After a careful review of the literature, most of the research indicated that different farming practices, such as organic farming, cover crops, conservation tillage, and agroforestry, play vital roles in increasing the SOC content of the soil sustainably. Root exudation from cover crops increases microbial activity and helps break down complex organic compounds into organic carbon. Conservation tillage enhances the soil structure and maintains carbon storage without disturbing the soil. Agroforestry systems boost organic carbon input and fasten nutrient cycling because the trees and crops have symbiotic relationships. Intercropping and crop rotations have a role in changing the composition of plant residues and promoting carbon storage
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26041;&#27861;&#65292;&#22312;&#24050;&#34987;&#32858;&#21512;&#30340;&#25968;&#25454;&#20013;&#37096;&#20998;&#35782;&#21035;&#20986;&#20108;&#20540;&#32467;&#26524;&#27169;&#22411;&#20013;&#30340;&#20010;&#20307;&#27700;&#24179;&#21442;&#25968;&#65292;&#21516;&#26102;&#23613;&#21487;&#33021;&#23569;&#22320;&#23545;&#25968;&#25454;&#29983;&#25104;&#36807;&#31243;&#26045;&#21152;&#38480;&#21046;&#12290;</title><link>https://arxiv.org/abs/2403.07236</link><description>&lt;p&gt;
&#22312;&#38750;&#21442;&#25968;&#20108;&#20540;&#32467;&#26524;&#27169;&#22411;&#20013;&#20351;&#29992;&#32858;&#21512;&#25968;&#25454;&#37096;&#20998;&#35782;&#21035;&#20010;&#20307;&#27700;&#24179;&#21442;&#25968;
&lt;/p&gt;
&lt;p&gt;
Partial Identification of Individual-Level Parameters Using Aggregate Data in a Nonparametric Binary Outcome Model
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.07236
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26041;&#27861;&#65292;&#22312;&#24050;&#34987;&#32858;&#21512;&#30340;&#25968;&#25454;&#20013;&#37096;&#20998;&#35782;&#21035;&#20986;&#20108;&#20540;&#32467;&#26524;&#27169;&#22411;&#20013;&#30340;&#20010;&#20307;&#27700;&#24179;&#21442;&#25968;&#65292;&#21516;&#26102;&#23613;&#21487;&#33021;&#23569;&#22320;&#23545;&#25968;&#25454;&#29983;&#25104;&#36807;&#31243;&#26045;&#21152;&#38480;&#21046;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20247;&#25152;&#21608;&#30693;&#65292;&#20010;&#20307;&#27700;&#24179;&#21464;&#37327;&#20043;&#38388;&#30340;&#20851;&#31995;&#21487;&#33021;&#19982;&#23545;&#36825;&#20123;&#21464;&#37327;&#36827;&#34892;&#32858;&#21512;&#21518;&#24471;&#21040;&#30340;&#20851;&#31995;&#19981;&#21516;&#12290;&#24403;&#30740;&#31350;&#20154;&#21592;&#24076;&#26395;&#20102;&#35299;&#20010;&#20307;&#27700;&#24179;&#20851;&#31995;&#20294;&#21482;&#33021;&#33719;&#24471;&#24050;&#34987;&#32858;&#21512;&#30340;&#25968;&#25454;&#26102;&#65292;&#32858;&#21512;&#38382;&#39064;&#21464;&#24471;&#30456;&#20851;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26041;&#27861;&#65292;&#20174;&#32858;&#21512;&#25968;&#25454;&#20013;&#37096;&#20998;&#35782;&#21035;&#20986;&#26465;&#20214;&#24179;&#22343;&#32467;&#26524;&#30340;&#32447;&#24615;&#32452;&#21512;&#65292;&#24403;&#24863;&#20852;&#36259;&#30340;&#32467;&#26524;&#26159;&#20108;&#20540;&#26102;&#65292;&#21516;&#26102;&#23545;&#28508;&#22312;&#25968;&#25454;&#29983;&#25104;&#36807;&#31243;&#26045;&#21152;&#23613;&#21487;&#33021;&#23569;&#30340;&#38480;&#21046;&#12290;&#25105;&#20351;&#29992;&#20801;&#35768;&#30740;&#31350;&#20154;&#21592;&#26045;&#21152;&#39069;&#22806;&#24418;&#29366;&#38480;&#21046;&#30340;&#20248;&#21270;&#31243;&#24207;&#26500;&#24314;&#20102;&#37492;&#21035;&#38598;&#12290;&#25105;&#36824;&#25552;&#20379;&#20102;&#19968;&#33268;&#24615;&#32467;&#26524;&#24182;&#26500;&#24314;&#20102;&#19968;&#31181;&#25512;&#35770;&#31243;&#24207;&#65292;&#35813;&#31243;&#24207;&#22312;&#21482;&#25552;&#20379;&#26377;&#20851;&#27599;&#20010;&#21464;&#37327;&#30340;&#36793;&#38469;&#20449;&#24687;&#30340;&#32858;&#21512;&#25968;&#25454;&#20013;&#26159;&#26377;&#25928;&#30340;&#12290;&#25105;&#23558;&#35813;&#26041;&#27861;&#24212;&#29992;&#20110;&#27169;&#25311;&#21644;&#23454;&#38469;&#25968;&#25454;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.07236v1 Announce Type: new  Abstract: It is well known that the relationship between variables at the individual level can be different from the relationship between those same variables aggregated over individuals. This problem of aggregation becomes relevant when the researcher wants to learn individual-level relationships, but only has access to data that has been aggregated. In this paper, I develop a methodology to partially identify linear combinations of conditional average outcomes from aggregate data when the outcome of interest is binary, while imposing as few restrictions on the underlying data generating process as possible. I construct identified sets using an optimization program that allows for researchers to impose additional shape restrictions. I also provide consistency results and construct an inference procedure that is valid with aggregate data, which only provides marginal information about each variable. I apply the methodology to simulated and real-wo
&lt;/p&gt;</description></item><item><title>&#22312;&#31639;&#27861;&#23450;&#20215;&#27169;&#22411;&#20013;&#65292;&#36890;&#36807;&#21442;&#25968;&#21270;&#27169;&#22411;&#35268;&#33539;&#30340;&#31639;&#27861;&#65292;&#20844;&#21496;&#21487;&#20197;&#22312;&#27809;&#26377;&#20849;&#35851;&#30340;&#24773;&#20917;&#19979;&#20135;&#29983;&#21608;&#26399;&#24615;&#30340;&#20849;&#35851;&#32467;&#26524;&#65292;&#36825;&#20026;&#31454;&#20105;&#25919;&#31574;&#25552;&#20986;&#20102;&#25361;&#25112;&#12290;</title><link>https://arxiv.org/abs/2403.07177</link><description>&lt;p&gt;
&#26080;&#38656;&#20849;&#35851;&#30340;&#20849;&#35851;&#32467;&#26524;
&lt;/p&gt;
&lt;p&gt;
Collusive Outcomes Without Collusion
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.07177
&lt;/p&gt;
&lt;p&gt;
&#22312;&#31639;&#27861;&#23450;&#20215;&#27169;&#22411;&#20013;&#65292;&#36890;&#36807;&#21442;&#25968;&#21270;&#27169;&#22411;&#35268;&#33539;&#30340;&#31639;&#27861;&#65292;&#20844;&#21496;&#21487;&#20197;&#22312;&#27809;&#26377;&#20849;&#35851;&#30340;&#24773;&#20917;&#19979;&#20135;&#29983;&#21608;&#26399;&#24615;&#30340;&#20849;&#35851;&#32467;&#26524;&#65292;&#36825;&#20026;&#31454;&#20105;&#25919;&#31574;&#25552;&#20986;&#20102;&#25361;&#25112;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#20010;&#31639;&#27861;&#23450;&#20215;&#27169;&#22411;&#65292;&#21487;&#20197;&#22312;&#20851;&#38381;&#25152;&#26377;&#26126;&#31034;&#25110;&#26263;&#31034;&#30340;&#20849;&#35851;&#28192;&#36947;&#30340;&#21516;&#26102;&#20135;&#29983;&#20849;&#35851;&#32467;&#26524;&#12290;&#25105;&#20204;&#20998;&#26512;&#20102;&#19968;&#20010;&#22404;&#26029;&#24066;&#22330;&#30340;&#21160;&#24577;&#65292;&#20854;&#20013;&#20004;&#23478;&#20844;&#21496;&#20351;&#29992;&#21253;&#21547;&#21442;&#25968;&#21270;&#27169;&#22411;&#35268;&#33539;&#23478;&#26063;&#30340;&#23450;&#20215;&#31639;&#27861;&#12290;&#20844;&#21496;&#26681;&#25454;&#24066;&#22330;&#32467;&#26524;&#20869;&#29983;&#22320;&#35843;&#25972;&#21442;&#25968;&#21644;&#27169;&#22411;&#26435;&#37325;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#24066;&#22330;&#32463;&#21382;&#20102;&#21608;&#26399;&#24615;&#30340;&#20107;&#20214;&#65292;&#20854;&#20013;&#20004;&#23478;&#20844;&#21496;&#37117;&#23558;&#20215;&#26684;&#23450;&#22312;&#20849;&#35851;&#27700;&#24179;&#12290;&#25105;&#20204;&#29992;&#22823;&#20559;&#24046;&#29702;&#35770;&#26469;&#20998;&#26512;&#27169;&#22411;&#30340;&#21160;&#24577;&#65292;&#24182;&#35299;&#37322;&#20102;&#20849;&#35851;&#32467;&#26524;&#30340;&#21608;&#26399;&#24615;&#20107;&#20214;&#12290;&#25105;&#20204;&#30340;&#32467;&#26524;&#34920;&#26126;&#65292;&#22312;&#20855;&#26377;&#20114;&#34917;&#24615;&#21644;&#20869;&#29983;&#36866;&#24212;&#24615;&#30340;&#31639;&#27861;&#29615;&#22659;&#20013;&#65292;&#20849;&#35851;&#32467;&#26524;&#21487;&#33021;&#26159;&#19968;&#20010;&#32463;&#24120;&#20986;&#29616;&#30340;&#29305;&#24449;&#65292;&#20026;&#31454;&#20105;&#25919;&#31574;&#25552;&#20986;&#20102;&#25361;&#25112;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.07177v1 Announce Type: new  Abstract: We develop a model of algorithmic pricing that shuts down every channel for explicit or implicit collusion while still generating collusive outcomes. We analyze the dynamics of a duopoly market where both firms use pricing algorithms consisting of a parameterized family of model specifications. The firms update both the parameters and the weights on models to adapt endogenously to market outcomes. We show that the market experiences recurrent episodes where both firms set prices at collusive levels. We analytically characterize the dynamics of the model, using large deviation theory to explain the recurrent episodes of collusive outcomes. Our results show that collusive outcomes may be a recurrent feature of algorithmic environments with complementarities and endogenous adaptation, providing a challenge for competition policy.
&lt;/p&gt;</description></item><item><title>&#23567;&#24133;&#20215;&#26684;&#21464;&#21160;&#19982;&#38144;&#21806;&#25968;&#37327;&#30456;&#20851;&#65292;&#39640;&#38144;&#21806;&#37327;&#20135;&#21697;&#26356;&#23481;&#26131;&#20986;&#29616;&#23567;&#24133;&#20215;&#26684;&#21464;&#21160;&#65292;&#36825;&#19968;&#21457;&#29616;&#22312;&#19981;&#21516;&#23618;&#38754;&#19978;&#37117;&#24471;&#21040;&#39564;&#35777;&#12290;</title><link>https://arxiv.org/abs/2403.07166</link><description>&lt;p&gt;
&#23567;&#24133;&#20215;&#26684;&#21464;&#21160;&#12289;&#38144;&#21806;&#25968;&#37327;&#21644;&#33756;&#21333;&#25104;&#26412;
&lt;/p&gt;
&lt;p&gt;
Small Price Changes, Sales Volume, and Menu Cost
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.07166
&lt;/p&gt;
&lt;p&gt;
&#23567;&#24133;&#20215;&#26684;&#21464;&#21160;&#19982;&#38144;&#21806;&#25968;&#37327;&#30456;&#20851;&#65292;&#39640;&#38144;&#21806;&#37327;&#20135;&#21697;&#26356;&#23481;&#26131;&#20986;&#29616;&#23567;&#24133;&#20215;&#26684;&#21464;&#21160;&#65292;&#36825;&#19968;&#21457;&#29616;&#22312;&#19981;&#21516;&#23618;&#38754;&#19978;&#37117;&#24471;&#21040;&#39564;&#35777;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35768;&#22810;&#38646;&#21806;&#20215;&#26684;&#25968;&#25454;&#38598;&#20013;&#21457;&#29616;&#23567;&#24133;&#20215;&#26684;&#21464;&#21160;&#30340;&#29616;&#35937;&#36890;&#24120;&#34987;&#35270;&#20026;&#19968;&#20010;&#35868;&#39064;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#19968;&#20010;&#21487;&#33021;&#30340;&#35299;&#37322;&#65292;&#21363;&#23567;&#24133;&#20215;&#26684;&#21464;&#21160;&#23384;&#22312;&#30340;&#19968;&#20010;&#21407;&#22240;&#19982;&#38144;&#21806;&#25968;&#37327;&#26377;&#20851;&#65292;&#36825;&#19968;&#35266;&#23519;&#22312;&#29616;&#26377;&#25991;&#29486;&#20013;&#34987;&#24573;&#35270;&#12290;&#36890;&#36807;&#20998;&#26512;&#19968;&#20010;&#21253;&#21547;&#20215;&#26684;&#21644;&#38144;&#21806;&#25968;&#37327;&#20449;&#24687;&#30340;&#22823;&#22411;&#38646;&#21806;&#25195;&#25551;&#20202;&#20215;&#26684;&#25968;&#25454;&#38598;&#65292;&#25105;&#20204;&#21457;&#29616;&#24403;&#20135;&#21697;&#38144;&#21806;&#25968;&#37327;&#36739;&#39640;&#26102;&#65292;&#23567;&#24133;&#20215;&#26684;&#21464;&#21160;&#26356;&#20026;&#39057;&#32321;&#12290;&#36825;&#19968;&#21457;&#29616;&#22312;&#20135;&#21697;&#31867;&#21035;&#20043;&#38388;&#12289;&#20135;&#21697;&#31867;&#21035;&#20869;&#37096;&#20197;&#21450;&#21333;&#20010;&#20135;&#21697;&#26041;&#38754;&#37117;&#25104;&#31435;&#65292;&#19988;&#23545;&#20110;&#21508;&#31181;&#25935;&#24863;&#24615;&#20998;&#26512;&#37117;&#20855;&#26377;&#31283;&#20581;&#24615;&#65292;&#20363;&#22914;&#27979;&#37327;&#35823;&#24046;&#12289;&#23567;&#24133;&#20215;&#26684;&#21464;&#21160;&#30340;&#23450;&#20041;&#12289;&#20215;&#26684;&#21516;&#27493;&#24230;&#30340;&#21152;&#20837;&#12289;&#29983;&#20135;&#32773;&#35268;&#27169;&#12289;&#29992;&#20110;&#35745;&#31639;&#24179;&#22343;&#38144;&#21806;&#25968;&#37327;&#30340;&#26102;&#38388;&#36328;&#24230;&#12289;&#25910;&#20837;&#12289;&#31454;&#20105;&#12289;&#36141;&#29289;&#32773;&#29305;&#24449;&#31561;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.07166v1 Announce Type: new  Abstract: The finding of small price changes in many retail price datasets is often viewed as a puzzle. We show that a possible explanation for the presence of small price changes is related to sales volume, an observation that has been overlooked in the existing literature. Analyzing a large retail scanner price dataset that contains information on both prices and sales volume, we find that small price changes are more frequent when products sales volume is high. This finding holds across product categories, within product categories, and for individual products. It is also robust to various sensitivity analyses such as measurement errors, the definition of small price changes, the inclusion of measures of price synchronization, the size of producers, the time horizon used to compute the average sales volume, the revenues, the competition, shoppers characteristics, etc.
&lt;/p&gt;</description></item><item><title>&#32771;&#34385;&#20102;&#22823;&#22411;&#27604;&#36187;&#20013;&#25104;&#21151;&#20989;&#25968;&#30340;&#20844;&#29702;&#21270;&#34920;&#31034;&#65292;&#23637;&#31034;&#20102;&#21327;&#21333;&#35843;&#24615;&#23646;&#24615;&#22312;&#19968;&#33324;&#24773;&#20917;&#19979;&#30340;&#24517;&#35201;&#24615;&#20197;&#21450;&#33719;&#24471;&#21487;&#21152;&#32467;&#26500;&#38656;&#35201;&#26356;&#24378;&#30340;&#26465;&#20214;&#30340;&#37325;&#35201;&#24615;</title><link>https://arxiv.org/abs/2403.07152</link><description>&lt;p&gt;
&#22823;&#22411;&#27604;&#36187;&#20013;&#30340;&#25104;&#21151;&#20989;&#25968;
&lt;/p&gt;
&lt;p&gt;
Success functions in large contests
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.07152
&lt;/p&gt;
&lt;p&gt;
&#32771;&#34385;&#20102;&#22823;&#22411;&#27604;&#36187;&#20013;&#25104;&#21151;&#20989;&#25968;&#30340;&#20844;&#29702;&#21270;&#34920;&#31034;&#65292;&#23637;&#31034;&#20102;&#21327;&#21333;&#35843;&#24615;&#23646;&#24615;&#22312;&#19968;&#33324;&#24773;&#20917;&#19979;&#30340;&#24517;&#35201;&#24615;&#20197;&#21450;&#33719;&#24471;&#21487;&#21152;&#32467;&#26500;&#38656;&#35201;&#26356;&#24378;&#30340;&#26465;&#20214;&#30340;&#37325;&#35201;&#24615;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#32771;&#34385;&#20102;&#20855;&#26377;&#22823;&#37327;&#21442;&#19982;&#32773;&#65288;&#36830;&#32493;&#20307;&#65289;&#30340;&#27604;&#36187;&#65292;&#24182;&#23545;&#24403;&#34920;&#29616;&#30001;&#21162;&#21147;&#21644;&#38543;&#26426;&#22240;&#32032;&#32452;&#25104;&#26102;&#20197;&#21450;&#36194;&#23478;&#26159;&#37027;&#20123;&#34920;&#29616;&#36229;&#36807;&#30001;&#24066;&#22330;&#28165;&#31639;&#26465;&#20214;&#30830;&#23450;&#30340;&#25130;&#27490;&#28857;&#26102;&#20135;&#29983;&#30340;&#27604;&#36187;&#25104;&#21151;&#20989;&#25968;&#36827;&#34892;&#20844;&#29702;&#21270;&#12290;&#22312;&#19968;&#33324;&#24773;&#20917;&#19979;&#65292;&#22522;&#26412;&#19978;&#21482;&#38656;&#35201;&#19968;&#20010;&#21327;&#21333;&#35843;&#24615;&#23646;&#24615;&#25165;&#33021;&#34920;&#31034;&#20986;&#26469;&#65292;&#20294;&#24517;&#39035;&#28385;&#36275;&#26356;&#24378;&#30340;&#26465;&#20214;&#25165;&#33021;&#33719;&#24471;&#21487;&#21152;&#32467;&#26500;&#12290;&#25105;&#20204;&#36890;&#36807;&#37325;&#26032;&#23457;&#35270;&#27604;&#36187;&#25991;&#29486;&#20013;&#30340;&#19968;&#20123;&#32463;&#20856;&#38382;&#39064;&#26469;&#35828;&#26126;&#36825;&#19968;&#26694;&#26550;&#30340;&#23454;&#29992;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.07152v1 Announce Type: new  Abstract: We consider contests with a large set (continuum) of participants and axiomatize contest success functions that arise when performance is composed of both effort and a random element, and when winners are those whose performance exceeds a cutoff determined by a market clearing condition. A co-monotonicity property is essentially all that is needed for a representation in the general case, but significantly stronger conditions must hold to obtain an additive structure. We illustrate the usefulness of this framework by revisiting some of the classic questions in the contests literature.
&lt;/p&gt;</description></item><item><title>&#30740;&#31350;&#25506;&#35752;&#27700;&#21361;&#26426;&#30340;&#21407;&#22240;&#65292;&#21253;&#25324;&#20154;&#21475;&#22686;&#38271;&#12289;&#27668;&#20505;&#21464;&#21270;&#21644;&#27700;&#31649;&#29702;&#25216;&#26415;&#65292;&#24182;&#25552;&#20986;&#25913;&#21892;&#21355;&#29983;&#21644;&#21355;&#29983;&#31243;&#24207;&#12289;&#27700;&#31649;&#29702;&#21644;&#20445;&#25252;&#25216;&#26415;&#31561;&#22810;&#31181;&#26041;&#27861;&#20197;&#20943;&#36731;&#27700;&#36164;&#28304;&#21294;&#20047;&#23545;&#20154;&#31867;&#20581;&#24247;&#30340;&#28508;&#22312;&#24433;&#21709;&#12290;</title><link>https://arxiv.org/abs/2403.07019</link><description>&lt;p&gt;
&#27700;&#21361;&#26426;&#21450;&#20854;&#28508;&#22312;&#20581;&#24247;&#24433;&#21709;&#30340;&#21407;&#22240;
&lt;/p&gt;
&lt;p&gt;
Reasons behind the Water Crisis and its Potential Health Outcomes
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.07019
&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#25506;&#35752;&#27700;&#21361;&#26426;&#30340;&#21407;&#22240;&#65292;&#21253;&#25324;&#20154;&#21475;&#22686;&#38271;&#12289;&#27668;&#20505;&#21464;&#21270;&#21644;&#27700;&#31649;&#29702;&#25216;&#26415;&#65292;&#24182;&#25552;&#20986;&#25913;&#21892;&#21355;&#29983;&#21644;&#21355;&#29983;&#31243;&#24207;&#12289;&#27700;&#31649;&#29702;&#21644;&#20445;&#25252;&#25216;&#26415;&#31561;&#22810;&#31181;&#26041;&#27861;&#20197;&#20943;&#36731;&#27700;&#36164;&#28304;&#21294;&#20047;&#23545;&#20154;&#31867;&#20581;&#24247;&#30340;&#28508;&#22312;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20840;&#29699;&#33539;&#22260;&#20869;&#65292;&#27700;&#21361;&#26426;&#24050;&#25104;&#20026;&#24433;&#21709;&#21457;&#23637;&#20013;&#22269;&#23478;&#21644;&#24037;&#19994;&#21270;&#22269;&#23478;&#30340;&#37325;&#22823;&#38382;&#39064;&#12290;&#32570;&#27700;&#20250;&#36890;&#36807;&#22686;&#21152;&#24863;&#26579;&#27700;&#20256;&#25773;&#30142;&#30149;&#12289;&#33073;&#27700;&#21644;&#33829;&#20859;&#19981;&#33391;&#30340;&#21487;&#33021;&#24615;&#26469;&#21361;&#23475;&#20844;&#20849;&#20581;&#24247;&#12290;&#26412;&#30740;&#31350;&#26088;&#22312;&#30740;&#31350;&#27700;&#38382;&#39064;&#30340;&#21407;&#22240;&#21450;&#20854;&#23545;&#20154;&#31867;&#20581;&#24247;&#30340;&#21487;&#33021;&#24433;&#21709;&#12290;&#30740;&#31350;&#23457;&#35270;&#20102;&#23548;&#33268;&#27700;&#21361;&#26426;&#30340;&#21407;&#22240;&#65292;&#21253;&#25324;&#20154;&#21475;&#22686;&#38271;&#12289;&#27668;&#20505;&#21464;&#21270;&#21644;&#20302;&#25928;&#30340;&#27700;&#31649;&#29702;&#25216;&#26415;&#12290;&#30740;&#31350;&#36824;&#25581;&#31034;&#20102;&#27700;&#36164;&#28304;&#21294;&#20047;&#23545;&#20154;&#31867;&#20581;&#24247;&#30340;&#32467;&#26524;&#65292;&#22914;&#20256;&#26579;&#30149;&#30340;&#20256;&#25773;&#12289;&#26356;&#39640;&#30340;&#39269;&#39295;&#21644;&#33073;&#27700;&#39118;&#38505;&#65292;&#20197;&#21450;&#24515;&#29702;&#21387;&#21147;&#12290;&#30740;&#31350;&#36827;&#19968;&#27493;&#25552;&#20986;&#20102;&#24212;&#23545;&#27700;&#24773;&#20917;&#24182;&#20943;&#36731;&#20854;&#23545;&#20154;&#31867;&#20581;&#24247;&#28508;&#22312;&#24433;&#21709;&#30340;&#20960;&#31181;&#26041;&#27861;&#12290;&#36825;&#20123;&#30103;&#27861;&#21253;&#25324;&#25913;&#21892;&#21355;&#29983;&#21644;&#21355;&#29983;&#31243;&#24207;&#12289;&#27700;&#31649;&#29702;&#21644;&#20445;&#25252;&#25216;&#26415;&#65292;&#22914;&#38632;&#27700;&#25910;&#38598;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.07019v1 Announce Type: new  Abstract: Globally, the water crisis has become a significant problem that affects developing and industrialized nations. Water shortage can harm public health by increasing the chance of contracting water-borne diseases, dehydration, and malnutrition. This study aims to examine the causes of the water problem and its likely effects on human health. The study scrutinizes the reasons behind the water crisis, including population increase, climate change, and inefficient water management techniques. The results of a lack of water on human health, such as the spread of infectious diseases, a higher risk of starvation and dehydration, and psychological stress, are also concealed in the study. The research further suggests several ways to deal with the water situation and lessen its potential outcomes on human health. These remedies include enhanced sanitation and hygiene procedures, water management, and conservation techniques like rainwater gatherin
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#38024;&#23545;&#39640;&#32500;&#21521;&#37327;&#35823;&#24046;&#20462;&#27491;&#27169;&#22411;&#30340;&#36125;&#21494;&#26031;&#20998;&#26512;&#26041;&#27861;&#65292;&#36890;&#36807;&#20998;&#26512;&#21327;&#25972;&#30697;&#38453;&#26469;&#30830;&#23450;&#21327;&#25972;&#31209;&#65292;&#20855;&#26377;&#36739;&#39640;&#25928;&#29575;&#21644;&#24212;&#29992;&#21069;&#26223;&#65292;&#33021;&#26377;&#25928;&#30740;&#31350;S&amp;P 500&#25351;&#25968;&#30340;&#26500;&#25104;&#37096;&#20998;&#65292;&#23588;&#20854;&#22312;&#20302;&#27874;&#21160;&#29575;&#32452;&#21512;&#30340;&#35782;&#21035;&#26041;&#38754;&#20855;&#26377;&#20248;&#21183;&#12290;</title><link>https://arxiv.org/abs/2312.17061</link><description>&lt;p&gt;
&#39640;&#32500;&#21521;&#37327;&#35823;&#24046;&#20462;&#27491;&#27169;&#22411;&#30340;&#36125;&#21494;&#26031;&#20998;&#26512;
&lt;/p&gt;
&lt;p&gt;
Bayesian Analysis of High Dimensional Vector Error Correction Model
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2312.17061
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#38024;&#23545;&#39640;&#32500;&#21521;&#37327;&#35823;&#24046;&#20462;&#27491;&#27169;&#22411;&#30340;&#36125;&#21494;&#26031;&#20998;&#26512;&#26041;&#27861;&#65292;&#36890;&#36807;&#20998;&#26512;&#21327;&#25972;&#30697;&#38453;&#26469;&#30830;&#23450;&#21327;&#25972;&#31209;&#65292;&#20855;&#26377;&#36739;&#39640;&#25928;&#29575;&#21644;&#24212;&#29992;&#21069;&#26223;&#65292;&#33021;&#26377;&#25928;&#30740;&#31350;S&amp;P 500&#25351;&#25968;&#30340;&#26500;&#25104;&#37096;&#20998;&#65292;&#23588;&#20854;&#22312;&#20302;&#27874;&#21160;&#29575;&#32452;&#21512;&#30340;&#35782;&#21035;&#26041;&#38754;&#20855;&#26377;&#20248;&#21183;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21521;&#37327;&#35823;&#24046;&#20462;&#27491;&#27169;&#22411;(VECM)&#26159;&#20998;&#26512;&#22810;&#20803;&#38750;&#24179;&#31283;&#26102;&#38388;&#24207;&#21015;&#20043;&#38388;&#21327;&#25972;&#20851;&#31995;&#30340;&#32463;&#20856;&#26041;&#27861;&#12290;&#26412;&#25991;&#30528;&#37325;&#20110;&#39640;&#32500;&#35774;&#32622;&#65292;&#23547;&#27714;&#19968;&#31181;&#26679;&#26412;&#22823;&#23567;&#26377;&#25928;&#30340;&#26041;&#27861;&#26469;&#30830;&#23450;&#21327;&#25972;&#27700;&#24179;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#38598;&#20013;&#22312;&#36125;&#21494;&#26031;&#26041;&#27861;&#19978;&#65292;&#20998;&#26512;&#21327;&#25972;&#30697;&#38453;&#65292;&#20174;&#32780;&#30830;&#23450;&#21327;&#25972;&#31209;&#12290;&#25105;&#20204;&#35774;&#35745;&#20102;&#20004;&#31181;&#31639;&#27861;&#65292;&#24182;&#23558;&#23427;&#20204;&#24212;&#29992;&#20110;&#27169;&#25311;&#31034;&#20363;&#20013;&#65292;&#22312;&#22788;&#29702;&#39640;&#25968;&#37327;&#21464;&#37327;&#21644;&#30456;&#23545;&#20302;&#25968;&#37327;&#35266;&#27979;&#26102;&#20135;&#29983;&#20102;&#26377;&#24076;&#26395;&#30340;&#32467;&#26524;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#23558;&#36825;&#31181;&#26041;&#27861;&#25193;&#23637;&#21040;&#23454;&#35777;&#35843;&#26597;&#26631;&#20934;&#26222;&#23572;500&#25351;&#25968;&#30340;&#32452;&#25104;&#37096;&#20998;&#65292;&#21487;&#22312;&#26679;&#26412;&#20869;&#35757;&#32451;&#21644;&#26679;&#26412;&#22806;&#27979;&#35797;&#26399;&#38388;&#25214;&#21040;&#20302;&#27874;&#21160;&#29575;&#32452;&#21512;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2312.17061v2 Announce Type: replace-cross  Abstract: Vector Error Correction Model (VECM) is a classic method to analyse cointegration relationships amongst multivariate non-stationary time series. In this paper, we focus on high dimensional setting and seek for sample-size-efficient methodology to determine the level of cointegration. Our investigation centres at a Bayesian approach to analyse the cointegration matrix, henceforth determining the cointegration rank. We design two algorithms and implement them on simulated examples, yielding promising results particularly when dealing with high number of variables and relatively low number of observations. Furthermore, we extend this methodology to empirically investigate the constituents of the S&amp;P 500 index, where low-volatility portfolios can be found during both in-sample training and out-of-sample testing periods.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#36890;&#36807;&#20998;&#26512;&#31185;&#23398;&#23478;&#30340;&#26102;&#38388;&#21033;&#29992;&#35843;&#26597;&#25968;&#25454;&#65292;&#21457;&#29616;&#31185;&#23398;&#23478;&#22312;&#31609;&#27454;&#21644;&#30740;&#31350;&#19978;&#30340;&#26102;&#38388;&#20998;&#37197;&#34920;&#29616;&#20986;&#27491;&#21521;&#21162;&#21147;&#22806;&#37096;&#24615;&#65292;&#21363;&#36861;&#27714;&#36192;&#27454;&#26102;&#20135;&#29983;&#30340;&#31038;&#20250;&#20215;&#20540;&#65292;&#20174;&#32780;&#25913;&#21464;&#20102;&#31454;&#20105;&#19982;&#36192;&#27454;&#31454;&#36187;&#30340;&#24635;&#20307;&#29983;&#20135;&#21147;&#20043;&#38388;&#30340;&#20851;&#31995;&#12290;</title><link>https://arxiv.org/abs/2207.02379</link><description>&lt;p&gt;
&#31454;&#20105;&#23545;&#36192;&#27454;&#31454;&#36187;&#30340;&#19968;&#20123;&#26435;&#34913;
&lt;/p&gt;
&lt;p&gt;
Some Tradeoffs of Competition in Grant Contests
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2207.02379
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36890;&#36807;&#20998;&#26512;&#31185;&#23398;&#23478;&#30340;&#26102;&#38388;&#21033;&#29992;&#35843;&#26597;&#25968;&#25454;&#65292;&#21457;&#29616;&#31185;&#23398;&#23478;&#22312;&#31609;&#27454;&#21644;&#30740;&#31350;&#19978;&#30340;&#26102;&#38388;&#20998;&#37197;&#34920;&#29616;&#20986;&#27491;&#21521;&#21162;&#21147;&#22806;&#37096;&#24615;&#65292;&#21363;&#36861;&#27714;&#36192;&#27454;&#26102;&#20135;&#29983;&#30340;&#31038;&#20250;&#20215;&#20540;&#65292;&#20174;&#32780;&#25913;&#21464;&#20102;&#31454;&#20105;&#19982;&#36192;&#27454;&#31454;&#36187;&#30340;&#24635;&#20307;&#29983;&#20135;&#21147;&#20043;&#38388;&#30340;&#20851;&#31995;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#36164;&#21161;&#20844;&#20849;&#21697;&#26102;&#65292;&#36164;&#28304;&#36890;&#24120;&#36890;&#36807;&#31867;&#20284;&#31454;&#36187;&#30340;&#26426;&#21046;&#20998;&#37197;&#65292;&#23588;&#20854;&#26159;&#22312;&#30740;&#31350;&#36164;&#21161;&#26041;&#38754;&#12290;&#23545;&#36825;&#20123;&#31454;&#36187;&#30340;&#24120;&#35265;&#25209;&#35780;&#26159;&#23427;&#20204;&#20250;&#24341;&#36215;&#21442;&#19982;&#32773;&#8220;&#20184;&#20986;&#36807;&#22810;&#8221;&#30340;&#21162;&#21147;&#12290;&#20294;&#22914;&#26524;&#31454;&#36187;&#20013;&#30340;&#21162;&#21147;&#26412;&#36523;&#26159;&#20026;&#20102;&#20844;&#20849;&#21033;&#30410;&#65292;&#23601;&#26410;&#24517;&#27491;&#30830;&#12290;&#26412;&#25991;&#20998;&#26512;&#20102;&#31185;&#23398;&#23478;&#26102;&#38388;&#21033;&#29992;&#30340;&#35843;&#26597;&#25968;&#25454;&#65292;&#24182;&#21457;&#29616;&#31185;&#23398;&#23478;&#22312;&#26102;&#38388;&#20998;&#37197;&#19978;&#34920;&#29616;&#20986;&#19982;&#31609;&#27454;&#21162;&#21147;&#65288;&#20363;&#22914;&#25776;&#20889;&#36192;&#27454;&#30003;&#35831;&#65289;&#20855;&#26377;&#22266;&#26377;&#31185;&#23398;&#20215;&#20540;&#30340;&#19968;&#33268;&#24615;--&#21363;&#20351;&#22312;&#25511;&#21046;&#28151;&#26434;&#22240;&#32032;&#21518;&#65292;&#33457;&#26356;&#22810;&#26102;&#38388;&#31609;&#27454;&#30340;&#31185;&#23398;&#23478;&#22312;&#30740;&#31350;&#19978;&#20063;&#27809;&#26377;&#26126;&#26174;&#20943;&#23569;&#26102;&#38388;&#12290;&#36890;&#36807;&#31454;&#36187;&#30340;&#29702;&#35770;&#27169;&#22411;&#34920;&#26126;&#20102;&#36825;&#31181;&#27491;&#21521;&#21162;&#21147;&#22806;&#37096;&#24615;&#30340;&#23384;&#22312;&#65292;&#31185;&#23398;&#23478;&#22312;&#36861;&#27714;&#36192;&#27454;&#26102;&#20135;&#29983;&#31038;&#20250;&#20215;&#20540;&#65292;&#20250;&#25913;&#21464;&#31454;&#20105;&#19982;&#36192;&#27454;&#31454;&#36187;&#30340;&#24635;&#20307;&#29983;&#20135;&#21147;&#20043;&#38388;&#30340;&#20851;&#31995;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2207.02379v2 Announce Type: replace  Abstract: When funding public goods, resources are often allocated via mechanisms that resemble contests, especially in the case of research grants. A common critique of these contests is that they induce ``too much'' effort from participants. This need not be true if the effort in the contest is itself directed towards the public good. This papers analyzes survey data on scientists' time use and finds that scientists allocate their time in a way that is consistent with fundraising effort (e.g., grant writing) having inherent scientific value -- scientists who spend more time fundraising do not spent significantly less time on research even after conditioning on confounding factors. Theoretical models of contests are used to show that the presence of such a positive effort externality, where scientists generate social value when pursuing grants, changes the relationship between competition and the aggregate productivity of a grant contest. Ens
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#37325;&#26032;&#23457;&#35270;&#20102;&#26631;&#20934;&#30340;&#36947;&#24503;&#39118;&#38505;&#27169;&#22411;&#65292;&#25552;&#20986;&#20102;&#20048;&#35266;&#21644;&#36807;&#24230;&#33258;&#20449;&#30340;&#23450;&#20041;&#65292;&#24182;&#34920;&#24449;&#36825;&#20123;&#23450;&#20041;&#19982;&#35813;&#27169;&#22411;&#21442;&#25968;&#30340;&#20851;&#31995;&#12290;</title><link>http://arxiv.org/abs/2304.08343</link><description>&lt;p&gt;
&#20048;&#35266;&#19982;&#36807;&#24230;&#33258;&#20449;&#65288;&#32463;&#27982;&#23398;&#27169;&#22411;&#26041;&#38754;&#65289;
&lt;/p&gt;
&lt;p&gt;
Optimism and overconfidence. (arXiv:2304.08343v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.08343
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#37325;&#26032;&#23457;&#35270;&#20102;&#26631;&#20934;&#30340;&#36947;&#24503;&#39118;&#38505;&#27169;&#22411;&#65292;&#25552;&#20986;&#20102;&#20048;&#35266;&#21644;&#36807;&#24230;&#33258;&#20449;&#30340;&#23450;&#20041;&#65292;&#24182;&#34920;&#24449;&#36825;&#20123;&#23450;&#20041;&#19982;&#35813;&#27169;&#22411;&#21442;&#25968;&#30340;&#20851;&#31995;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#37325;&#26032;&#23457;&#35270;&#20102;&#26631;&#20934;&#36947;&#24503;&#39118;&#38505;&#27169;&#22411;&#65292;&#20854;&#20013;&#20195;&#29702;&#20154;&#23545;&#21512;&#21516;&#30340;&#20559;&#22909;&#28304;&#20110;&#20184;&#20986;&#26114;&#36149;&#30340;&#21162;&#21147;&#36873;&#25321;&#12290;&#20316;&#32773;&#36890;&#36807;&#23454;&#35777;&#26816;&#39564;&#30340;&#20844;&#29702;&#26469;&#34920;&#24449;&#27169;&#22411;&#30340;&#34892;&#20026;&#20869;&#23481;&#65292;&#24182;&#23637;&#31034;&#20102;&#35813;&#27169;&#22411;&#30340;&#21442;&#25968;&#34987;&#35782;&#21035;&#12290;&#20316;&#32773;&#25552;&#20986;&#30456;&#23545;&#65288;&#36807;&#24230;&#65289;&#33258;&#20449;&#21644;&#20048;&#35266;&#20027;&#20041;&#30340;&#19968;&#33324;&#34892;&#20026;&#23450;&#20041;&#65292;&#24182;&#25353;&#36947;&#24503;&#39118;&#38505;&#27169;&#22411;&#30340;&#21442;&#25968;&#26469;&#34920;&#24449;&#36825;&#20123;&#23450;&#20041;&#12290;&#27491;&#24335;&#32467;&#26524;&#22522;&#20110;&#19968;&#20010;&#31616;&#21333;&#32780;&#24378;&#22823;&#30340;&#27934;&#23519;&#21147;&#65306;&#36947;&#24503;&#39118;&#38505;&#27169;&#22411;&#19982;&#20247;&#25152;&#21608;&#30693;&#30340;&#8220;&#21464;&#20998;&#8221;&#19981;&#30830;&#23450;&#24615;&#36873;&#25321;&#27169;&#22411;&#23494;&#20999;&#30456;&#20851;&#12290;
&lt;/p&gt;
&lt;p&gt;
I revisit the standard moral-hazard model, in which an agent's preference over contracts is rooted in costly effort choice. I characterise the behavioural content of the model in terms of empirically testable axioms, and show that the model's parameters are identified. I propose general behavioural definitions of relative (over)confidence and optimism, and characterise these in terms of the parameters of the moral-hazard model. My formal results are rooted in a simple but powerful insight: that the moral-hazard model is closely related to the well-known 'variational' model of choice under uncertainty.
&lt;/p&gt;</description></item></channel></rss>