<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#21306;&#22359;&#38142;&#30340;&#21435;&#20013;&#24515;&#21270;&#32852;&#21512;&#27835;&#29702;&#27169;&#22411;&#65292;&#26088;&#22312;&#35299;&#20915;&#20256;&#32479;&#20247;&#31609;&#26041;&#27861;&#20013;&#23384;&#22312;&#30340;&#38382;&#39064;&#65292;&#21253;&#25324;&#39640;&#20132;&#26131;&#25104;&#26412;&#12289;&#32570;&#20047;&#36879;&#26126;&#24230;&#12289;&#27450;&#35784;&#21644;&#20302;&#25928;&#30340;&#36164;&#28304;&#20998;&#37197;&#12290;&#36825;&#20010;&#27169;&#22411;&#36890;&#36807;&#19977;&#26041;&#20849;&#27835;&#32467;&#26500;&#23454;&#29616;&#65292;&#20855;&#26377;&#21171;&#21160;&#12289;&#36164;&#26412;&#21644;&#27835;&#29702;&#31038;&#21306;&#65292;&#20026;&#20013;&#23567;&#24494;&#20225;&#19994;&#21644;&#21019;&#26032;&#39033;&#30446;&#25552;&#20379;&#21487;&#25345;&#32493;&#20247;&#31609;&#30340;&#35299;&#20915;&#26041;&#26696;&#12290;</title><link>http://arxiv.org/abs/2306.00869</link><description>&lt;p&gt;
&#22522;&#20110;&#21306;&#22359;&#38142;&#30340;&#21435;&#20013;&#24515;&#21270;&#32852;&#21512;&#27835;&#29702;&#65306;&#21487;&#25345;&#32493;&#20247;&#31609;&#30340;&#21019;&#26032;&#21644;&#35299;&#20915;&#26041;&#26696;&#12290;
&lt;/p&gt;
&lt;p&gt;
Blockchain-based Decentralized Co-governance: Innovations and Solutions for Sustainable Crowdfunding. (arXiv:2306.00869v1 [cs.CY])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.00869
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#21306;&#22359;&#38142;&#30340;&#21435;&#20013;&#24515;&#21270;&#32852;&#21512;&#27835;&#29702;&#27169;&#22411;&#65292;&#26088;&#22312;&#35299;&#20915;&#20256;&#32479;&#20247;&#31609;&#26041;&#27861;&#20013;&#23384;&#22312;&#30340;&#38382;&#39064;&#65292;&#21253;&#25324;&#39640;&#20132;&#26131;&#25104;&#26412;&#12289;&#32570;&#20047;&#36879;&#26126;&#24230;&#12289;&#27450;&#35784;&#21644;&#20302;&#25928;&#30340;&#36164;&#28304;&#20998;&#37197;&#12290;&#36825;&#20010;&#27169;&#22411;&#36890;&#36807;&#19977;&#26041;&#20849;&#27835;&#32467;&#26500;&#23454;&#29616;&#65292;&#20855;&#26377;&#21171;&#21160;&#12289;&#36164;&#26412;&#21644;&#27835;&#29702;&#31038;&#21306;&#65292;&#20026;&#20013;&#23567;&#24494;&#20225;&#19994;&#21644;&#21019;&#26032;&#39033;&#30446;&#25552;&#20379;&#21487;&#25345;&#32493;&#20247;&#31609;&#30340;&#35299;&#20915;&#26041;&#26696;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#28145;&#20837;&#25506;&#35752;&#20102;&#21435;&#20013;&#24515;&#21270;&#32852;&#21512;&#27835;&#29702;&#20247;&#31609;&#65288;DCC&#65289;&#29983;&#24577;&#31995;&#32479;&#65292;&#36825;&#26159;&#19968;&#31181;&#26032;&#30340;&#35299;&#20915;&#26041;&#26696;&#65292;&#26088;&#22312;&#35299;&#20915;&#20013;&#23567;&#24494;&#20225;&#19994;&#21644;&#21019;&#26032;&#39033;&#30446;&#25152;&#38754;&#20020;&#30340;&#20256;&#32479;&#20247;&#31609;&#26041;&#27861;&#20013;&#23384;&#22312;&#30340;&#38382;&#39064;&#12290;&#23427;&#35797;&#22270;&#32531;&#35299;&#30340;&#38382;&#39064;&#21253;&#25324;&#39640;&#20132;&#26131;&#25104;&#26412;&#12289;&#32570;&#20047;&#36879;&#26126;&#24230;&#12289;&#27450;&#35784;&#21644;&#20302;&#25928;&#30340;&#36164;&#28304;&#20998;&#37197;&#12290;&#36890;&#36807;&#20840;&#38754;&#35780;&#20272;&#29616;&#26377;&#25991;&#29486;&#23545;&#20247;&#31609;&#32463;&#27982;&#27963;&#21160;&#20197;&#21450;&#21306;&#22359;&#38142;&#23545;&#32452;&#32455;&#27835;&#29702;&#24433;&#21709;&#30340;&#30740;&#31350;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#25968;&#23383;&#20195;&#24065;&#21644;&#21435;&#20013;&#24515;&#21270;&#32852;&#21512;&#27835;&#29702;&#30340;&#36716;&#22411;&#31038;&#20250;&#32463;&#27982;&#27169;&#22411;&#12290;&#36825;&#20010;&#29983;&#24577;&#31995;&#32479;&#20855;&#26377;&#19977;&#26041;&#20849;&#27835;&#32467;&#26500;&#8212;&#8212;&#21171;&#21160;&#12289;&#36164;&#26412;&#21644;&#27835;&#29702;&#31038;&#21306;&#8212;&#8212;&#27599;&#20010;&#31038;&#21306;&#22312;&#29983;&#24577;&#31995;&#32479;&#30340;&#36816;&#33829;&#20013;&#37117;&#26377;&#20854;&#29420;&#29305;&#30340;&#36129;&#29486;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#23637;&#31034;&#20102;DCC&#29983;&#24577;&#31995;&#32479;&#30340;&#28436;&#21464;&#65292;&#25552;&#20379;&#20102;&#19968;&#31181;&#26032;&#30340;&#29702;&#35299;&#21435;&#20013;&#24515;&#21270;&#25968;&#23383;&#19990;&#30028;&#30340;&#31038;&#20250;&#32463;&#27982;&#21160;&#24577;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#36824;&#28145;&#20837;&#25506;&#35752;&#20102;DCC&#29983;&#24577;&#31995;&#32479;&#19981;&#21516;&#38454;&#27573;&#30340;&#20869;&#22312;&#22797;&#26434;&#24615;&#21644;&#27835;&#29702;&#26426;&#21046;&#12290;
&lt;/p&gt;
&lt;p&gt;
This thesis provides an in-depth exploration of the Decentralized Co-governance Crowdfunding (DCC) Ecosystem, a novel solution addressing prevailing challenges in conventional crowdfunding methods faced by MSMEs and innovative projects. Among the problems it seeks to mitigate are high transaction costs, lack of transparency, fraud, and inefficient resource allocation. Leveraging a comprehensive review of the existing literature on crowdfunding economic activities and blockchain's impact on organizational governance, we propose a transformative socio-economic model based on digital tokens and decentralized co-governance. This ecosystem is marked by a tripartite community structure - the Labor, Capital, and Governance communities - each contributing uniquely to the ecosystem's operation. Our research unfolds the evolution of the DCC ecosystem through distinct phases, offering a novel understanding of socioeconomic dynamics in a decentralized digital world. It also delves into the intrica
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#24378;&#21487;&#25345;&#32493;&#24615;&#33539;&#24335;&#30340;&#20998;&#26512;&#23618;&#27425;&#36807;&#31243; (SSP-AHP) &#26041;&#27861;&#65292;&#26088;&#22312;&#24320;&#21457;&#19968;&#20010;&#21487;&#25345;&#32493;&#24615;&#25351;&#26631;&#21442;&#32771;&#20215;&#20540;&#24182;&#35780;&#20272;&#31038;&#20250;&#21487;&#25345;&#32493;&#24615;&#21307;&#30103;&#20445;&#20581;&#31995;&#32479;&#12290;&#35813;&#26041;&#27861;&#21487;&#23454;&#29616;&#31995;&#32479;&#27604;&#36739;&#21644;&#22522;&#20934;&#35774;&#32622;&#65292;&#21516;&#26102;&#36991;&#20813;&#20102;&#20934;&#21017;&#21487;&#20132;&#25442;&#24615;&#65292;&#20174;&#32780;&#26356;&#22909;&#22320;&#23454;&#29616;&#20102;&#21487;&#25345;&#32493;&#24615;&#12290;</title><link>http://arxiv.org/abs/2306.00718</link><description>&lt;p&gt;
&#22522;&#20110;&#24378;&#21487;&#25345;&#32493;&#24615;&#33539;&#24335;&#30340;&#20998;&#26512;&#23618;&#27425;&#36807;&#31243;(SSP-AHP)&#26041;&#27861;&#29992;&#20110;&#35780;&#20272;&#21487;&#25345;&#32493;&#21307;&#30103;&#20445;&#20581;&#31995;&#32479;
&lt;/p&gt;
&lt;p&gt;
A Strong Sustainability Paradigm Based Analytical Hierarchy Process (SSP-AHP) Method to Evaluate Sustainable Healthcare Systems. (arXiv:2306.00718v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.00718
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#24378;&#21487;&#25345;&#32493;&#24615;&#33539;&#24335;&#30340;&#20998;&#26512;&#23618;&#27425;&#36807;&#31243; (SSP-AHP) &#26041;&#27861;&#65292;&#26088;&#22312;&#24320;&#21457;&#19968;&#20010;&#21487;&#25345;&#32493;&#24615;&#25351;&#26631;&#21442;&#32771;&#20215;&#20540;&#24182;&#35780;&#20272;&#31038;&#20250;&#21487;&#25345;&#32493;&#24615;&#21307;&#30103;&#20445;&#20581;&#31995;&#32479;&#12290;&#35813;&#26041;&#27861;&#21487;&#23454;&#29616;&#31995;&#32479;&#27604;&#36739;&#21644;&#22522;&#20934;&#35774;&#32622;&#65292;&#21516;&#26102;&#36991;&#20813;&#20102;&#20934;&#21017;&#21487;&#20132;&#25442;&#24615;&#65292;&#20174;&#32780;&#26356;&#22909;&#22320;&#23454;&#29616;&#20102;&#21487;&#25345;&#32493;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36817;&#26469;&#30340;&#30740;&#31350;&#34920;&#26126;&#30740;&#31350;&#20154;&#21592;&#36234;&#26469;&#36234;&#20851;&#27880;&#22312;&#21508;&#20010;&#23618;&#38754;&#21644;&#39046;&#22495;&#65288;&#21253;&#25324;&#21307;&#30103;&#20445;&#20581;&#65289;&#30417;&#27979;&#21644;&#34913;&#37327;&#21487;&#25345;&#32493;&#24615;&#32489;&#25928;&#65292;&#20294;&#26159;&#36824;&#27809;&#26377;&#32479;&#19968;&#30340;&#26041;&#27861;&#26469;&#35780;&#20272;&#21307;&#30103;&#20445;&#20581;&#31995;&#32479;&#30340;&#21487;&#25345;&#32493;&#24615;&#12290;&#27492;&#22806;&#65292;&#31038;&#20250;&#25351;&#26631;&#30340;&#24320;&#21457;&#31243;&#24230;&#20063;&#36739;&#20302;&#12290;&#22240;&#27492;&#65292;&#20316;&#32773;&#35797;&#22270;&#22312;&#21307;&#30103;&#20445;&#20581;&#39046;&#22495;&#21046;&#23450;&#21487;&#25345;&#32493;&#21442;&#32771;&#20215;&#20540;&#65292;&#24182;&#25552;&#20986;&#19968;&#20010;&#21487;&#20197;&#25351;&#23548;&#31038;&#20250;&#21487;&#25345;&#32493;&#24615;&#21307;&#30103;&#20445;&#20581;&#31995;&#32479;&#27979;&#37327;&#30340;&#27010;&#24565;&#24615;&#21644;&#32467;&#26500;&#21270;&#26694;&#26550;&#12290;&#22522;&#20110;&#19968;&#31181;&#31216;&#20026;&#22522;&#20110;&#24378;&#21487;&#25345;&#32493;&#24615;&#33539;&#24335;&#30340;&#20998;&#26512;&#23618;&#27425;&#36807;&#31243;(SSP-AHP)&#30340;&#26032;&#30340;&#22810;&#20934;&#21017;&#26041;&#27861;&#65292;&#25152;&#25552;&#20986;&#30340;&#26041;&#27861;&#25171;&#24320;&#20102;&#31995;&#32479;&#27604;&#36739;&#21644;&#22522;&#20934;&#35774;&#32622;&#30340;&#21487;&#34892;&#24615;&#12290;&#23558;&#24378;&#21487;&#25345;&#32493;&#24615;&#33539;&#24335;&#32435;&#20837;&#22810;&#20934;&#21017;&#35780;&#20272;&#26041;&#27861;&#20013;&#65292;&#36890;&#36807;&#25512;&#24191;&#22312;&#25152;&#26377;&#20934;&#21017;&#19978;&#23454;&#29616;&#33391;&#22909;&#32489;&#25928;&#20540;&#30340;&#26367;&#20195;&#26041;&#26696;&#65292;&#36991;&#20813;&#20102;&#20934;&#21017;&#21487;&#20132;&#25442;&#24615;&#65292;&#20174;&#32780;&#23454;&#29616;&#21487;&#25345;&#32493;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
The recent studies signify the growing concern of researchers towards monitoring and measuring sustainability performance at various levels and in many fields, including healthcare. However, there is no agreed approach to assessing the sustainability of health systems. Moreover, social indicators are less developed and less succinct. Therefore, the authors seek to map sustainable reference values in healthcare and propose a conceptual and structured framework that can guide the measurement of the social sustainability-oriented health systems. Based on a new multi-criteria method called Strong Sustainability Paradigm based Analytical Hierarchy Process, (SSP-AHP), the presented approach opens the availability for systems' comparison and benchmarking. The Strong Sustainability Paradigm incorporated into the multi-criteria evaluation method prevents the exchangeability of criteria by promoting alternatives that achieve good performance values on all criteria, implying sustainability. The r
&lt;/p&gt;</description></item><item><title>&#35813;&#30740;&#31350;&#20998;&#26512;&#20102;&#36719;&#36829;&#32422;&#65288;&#36926;&#26399;90&#22825;&#20197;&#19978;&#65289;&#23545;&#20010;&#20154;&#36712;&#36857;&#30340;&#24433;&#21709;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#36719;&#36829;&#32422;&#23545;&#20449;&#29992;&#35780;&#20998;&#12289;&#20449;&#29992;&#39069;&#24230;&#24635;&#25968;&#12289;&#20303;&#25151;&#25152;&#26377;&#26435;&#21644;&#25910;&#20837;&#26041;&#38754;&#20135;&#29983;&#20102;&#38271;&#26399;&#19988;&#37325;&#22823;&#30340;&#36127;&#38754;&#24433;&#21709;&#65292;&#35813;&#24433;&#21709;&#20250;&#25345;&#32493;&#21313;&#24180;&#24038;&#21491;&#12290;</title><link>http://arxiv.org/abs/2306.00574</link><description>&lt;p&gt;
&#36719;&#36829;&#32422;&#21518;&#30340;&#29983;&#27963;
&lt;/p&gt;
&lt;p&gt;
Life after (Soft) Default. (arXiv:2306.00574v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.00574
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#20998;&#26512;&#20102;&#36719;&#36829;&#32422;&#65288;&#36926;&#26399;90&#22825;&#20197;&#19978;&#65289;&#23545;&#20010;&#20154;&#36712;&#36857;&#30340;&#24433;&#21709;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#36719;&#36829;&#32422;&#23545;&#20449;&#29992;&#35780;&#20998;&#12289;&#20449;&#29992;&#39069;&#24230;&#24635;&#25968;&#12289;&#20303;&#25151;&#25152;&#26377;&#26435;&#21644;&#25910;&#20837;&#26041;&#38754;&#20135;&#29983;&#20102;&#38271;&#26399;&#19988;&#37325;&#22823;&#30340;&#36127;&#38754;&#24433;&#21709;&#65292;&#35813;&#24433;&#21709;&#20250;&#25345;&#32493;&#21313;&#24180;&#24038;&#21491;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#20998;&#26512;&#20102;&#36719;&#36829;&#32422;&#65288;&#21363;&#36926;&#26399;90&#22825;&#20197;&#19978;&#30340;&#24773;&#20917;&#65289;&#23545;&#20010;&#20154;&#36712;&#36857;&#30340;&#24433;&#21709;&#12290;&#20351;&#29992;&#19968;&#20221;&#32422;200&#19975;&#20154;&#30340;&#19987;&#26377;&#25968;&#25454;&#38598;&#65292;&#26102;&#38388;&#27573;&#20026;2004&#24180;&#21040;2020&#24180;&#65292;&#25105;&#20204;&#21457;&#29616;&#36719;&#36829;&#32422;&#23545;&#20449;&#29992;&#35780;&#20998;&#12289;&#20449;&#29992;&#39069;&#24230;&#24635;&#25968;&#12289;&#20303;&#25151;&#25152;&#26377;&#26435;&#29366;&#20917;&#21644;&#25910;&#20837;&#31561;&#26041;&#38754;&#37117;&#20135;&#29983;&#20102;&#37325;&#22823;&#19988;&#38271;&#26399;&#30340;&#65288;&#21363;&#20107;&#20214;&#21457;&#29983;&#21518;&#38271;&#36798;&#21313;&#24180;&#30340;&#65289;&#36127;&#38754;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
We analyze the impact of soft credit default (i.e. a delinquency of 90+ days) on individual trajectories. Using a proprietary dataset on about 2 million individuals for the years 2004 to 2020, we find that a soft default has substantial and long-lasting (i.e. up to ten years after the event) negative effects on credit score, total credit limit, home-ownership status, and income.
&lt;/p&gt;</description></item><item><title>&#35770;&#25991;&#20171;&#32461;&#20102;&#20010;&#24615;&#21270;&#31995;&#32479;&#20013;&#29992;&#25143;&#34892;&#20026;&#30340;&#38750;&#21442;&#25968;&#22240;&#26524;&#27169;&#22411;&#65292;&#24182;&#25552;&#20986;&#20102;&#26032;&#30340;&#23454;&#39564;&#35774;&#35745;&#26041;&#26696;&#65292;&#20197;&#24110;&#21161;&#20998;&#21035;&#30830;&#23450;&#22240;&#29992;&#25143;&#23398;&#20064;&#21644;&#20010;&#24615;&#21270;&#20171;&#23548;&#30340;&#22240;&#26524;&#25928;&#24212;&#65292;&#20197;&#27492;&#26469;&#25552;&#39640;&#23454;&#39564;&#30340;&#20934;&#30830;&#24230;&#12290;</title><link>http://arxiv.org/abs/2306.00485</link><description>&lt;p&gt;
&#20010;&#24615;&#21270;&#31995;&#32479;&#20013;&#29992;&#25143;&#23398;&#20064;&#30340;&#22240;&#26524;&#20272;&#35745;
&lt;/p&gt;
&lt;p&gt;
Causal Estimation of User Learning in Personalized Systems. (arXiv:2306.00485v1 [stat.ME])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.00485
&lt;/p&gt;
&lt;p&gt;
&#35770;&#25991;&#20171;&#32461;&#20102;&#20010;&#24615;&#21270;&#31995;&#32479;&#20013;&#29992;&#25143;&#34892;&#20026;&#30340;&#38750;&#21442;&#25968;&#22240;&#26524;&#27169;&#22411;&#65292;&#24182;&#25552;&#20986;&#20102;&#26032;&#30340;&#23454;&#39564;&#35774;&#35745;&#26041;&#26696;&#65292;&#20197;&#24110;&#21161;&#20998;&#21035;&#30830;&#23450;&#22240;&#29992;&#25143;&#23398;&#20064;&#21644;&#20010;&#24615;&#21270;&#20171;&#23548;&#30340;&#22240;&#26524;&#25928;&#24212;&#65292;&#20197;&#27492;&#26469;&#25552;&#39640;&#23454;&#39564;&#30340;&#20934;&#30830;&#24230;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#22312;&#32447;&#24179;&#21488;&#19978;&#65292;&#35266;&#23519;&#32467;&#26524;&#30340;&#27835;&#30103;&#24433;&#21709;&#38543;&#30528;&#26102;&#38388;&#30340;&#25512;&#31227;&#21487;&#33021;&#20250;&#21457;&#29983;&#21464;&#21270;&#65292;&#21407;&#22240;&#26159;1&#65289;&#29992;&#25143;&#20102;&#35299;&#24178;&#39044;&#65292;2&#65289;&#31995;&#32479;&#20010;&#24615;&#21270;&#65292;&#20363;&#22914;&#20010;&#24615;&#21270;&#25512;&#33616;&#65292;&#38543;&#30528;&#26102;&#38388;&#30340;&#25512;&#31227;&#32780;&#21457;&#29983;&#21464;&#21270;&#12290;&#25105;&#20204;&#20171;&#32461;&#20102;&#20010;&#24615;&#21270;&#31995;&#32479;&#20013;&#29992;&#25143;&#34892;&#20026;&#30340;&#38750;&#21442;&#25968;&#22240;&#26524;&#27169;&#22411;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;Cookie-Cookie-Day&#65288;CCD&#65289;&#23454;&#39564;&#65292;&#22312;&#23384;&#22312;&#20010;&#24615;&#21270;&#26102;&#23384;&#22312;&#20559;&#24046;&#65292;&#35813;&#23454;&#39564;&#26088;&#22312;&#27979;&#37327;&#29992;&#25143;&#23398;&#20064;&#25928;&#24212;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#26032;&#30340;&#23454;&#39564;&#35774;&#35745;&#65292;&#24178;&#39044;&#20010;&#24615;&#21270;&#31995;&#32479;&#20197;&#20135;&#29983;&#24517;&#35201;&#30340;&#21464;&#21270;&#65292;&#20197;&#20998;&#21035;&#30830;&#23450;&#36890;&#36807;&#29992;&#25143;&#23398;&#20064;&#21644;&#20010;&#24615;&#21270;&#20171;&#23548;&#30340;&#22240;&#26524;&#25928;&#24212;&#12290;&#36890;&#36807;&#36827;&#34892;&#21442;&#25968;&#20551;&#35774;&#65292;&#21487;&#20197;&#22522;&#20110;&#20013;&#26399;&#23454;&#39564;&#20272;&#35745;&#38271;&#26399;&#22240;&#26524;&#25928;&#24212;&#12290;&#22312;&#27169;&#25311;&#20013;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#25105;&#20204;&#30340;&#26032;&#35774;&#35745;&#25104;&#21151;&#22320;&#24674;&#22797;&#20102;&#24863;&#20852;&#36259;&#30340;&#21160;&#24577;&#22240;&#26524;&#25928;&#24212;&#12290;
&lt;/p&gt;
&lt;p&gt;
In online platforms, the impact of a treatment on an observed outcome may change over time as 1) users learn about the intervention, and 2) the system personalization, such as individualized recommendations, change over time. We introduce a non-parametric causal model of user actions in a personalized system. We show that the Cookie-Cookie-Day (CCD) experiment, designed for the measurement of the user learning effect, is biased when there is personalization. We derive new experimental designs that intervene in the personalization system to generate the variation necessary to separately identify the causal effect mediated through user learning and personalization. Making parametric assumptions allows for the estimation of long-term causal effects based on medium-term experiments. In simulations, we show that our new designs successfully recover the dynamic causal effects of interest.
&lt;/p&gt;</description></item><item><title>&#30740;&#31350;&#24403;&#39044;&#27979;&#22238;&#24402;&#21464;&#37327;&#20855;&#26377;&#36817;&#20284;&#21333;&#20301;&#26681;&#26102;&#65292;&#39044;&#27979;&#20998;&#20301;&#25968;&#22238;&#24402;&#30340;&#25512;&#26029;&#38382;&#39064;, &#24182;&#25552;&#20986;&#19968;&#31181;&#23436;&#20840;&#20462;&#27491;&#30340;&#39044;&#27979;&#27979;&#35797;&#26041;&#27861;, &#22312;&#23567;&#26679;&#26412;&#19979;&#26377;&#21487;&#38752;&#30340;&#22823;&#23567;&#65292;&#24182;&#22312;&#39044;&#27979;&#22238;&#24402;&#38382;&#39064;&#26368;&#20026;&#20005;&#37325;&#26102;&#20855;&#26377;&#24456;&#22909;&#30340;&#21151;&#25928;&#12290;</title><link>http://arxiv.org/abs/2306.00296</link><description>&lt;p&gt;
&#39044;&#27979;&#20998;&#20301;&#25968;&#22238;&#24402;&#20013;&#30340;&#25512;&#26029;
&lt;/p&gt;
&lt;p&gt;
Inference in Predictive Quantile Regressions. (arXiv:2306.00296v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.00296
&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#24403;&#39044;&#27979;&#22238;&#24402;&#21464;&#37327;&#20855;&#26377;&#36817;&#20284;&#21333;&#20301;&#26681;&#26102;&#65292;&#39044;&#27979;&#20998;&#20301;&#25968;&#22238;&#24402;&#30340;&#25512;&#26029;&#38382;&#39064;, &#24182;&#25552;&#20986;&#19968;&#31181;&#23436;&#20840;&#20462;&#27491;&#30340;&#39044;&#27979;&#27979;&#35797;&#26041;&#27861;, &#22312;&#23567;&#26679;&#26412;&#19979;&#26377;&#21487;&#38752;&#30340;&#22823;&#23567;&#65292;&#24182;&#22312;&#39044;&#27979;&#22238;&#24402;&#38382;&#39064;&#26368;&#20026;&#20005;&#37325;&#26102;&#20855;&#26377;&#24456;&#22909;&#30340;&#21151;&#25928;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#24403;&#39044;&#27979;&#22238;&#24402;&#21464;&#37327;&#20855;&#26377;&#36817;&#20284;&#21333;&#20301;&#26681;&#26102;&#65292;&#39044;&#27979;&#20998;&#20301;&#25968;&#22238;&#24402;&#30340;&#25512;&#26029;&#38382;&#39064;&#12290;&#25105;&#20204;&#36890;&#36807;&#22885;&#24681;&#26031;&#22374;-&#20044;&#20262;&#36125;&#20811;&#36807;&#31243;&#30340;&#20989;&#25968;&#25512;&#23548;&#20986;&#20102;&#20998;&#20301;&#25968;&#22238;&#24402;&#20272;&#35745;&#37327;&#21450;&#20854;&#24322;&#26041;&#24046;&#24615;&#21644;&#33258;&#30456;&#20851;&#19968;&#33268;&#65288;HAC&#65289;t&#32479;&#35745;&#37327;&#30340;&#28176;&#36817;&#20998;&#24067;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#23436;&#20840;&#20462;&#27491;&#30340;&#39044;&#27979;&#27979;&#35797;&#26041;&#27861;&#65292;&#29992;&#20110;&#20855;&#26377;&#25345;&#32493;&#22238;&#24402;&#21464;&#37327;&#30340;&#20998;&#20301;&#39044;&#27979;&#24615;&#12290;&#24403;&#39044;&#27979;&#21464;&#37327;&#20855;&#26377;&#36817;&#20284;&#21333;&#20301;&#26681;&#26102;&#65292;&#25152;&#25552;&#20986;&#30340;&#27979;&#35797;&#37319;&#29992;&#20102;FM&#39118;&#26684;&#20462;&#27491;&#65292;&#24182;&#22312;&#23616;&#37096;&#21040;&#21333;&#20301;&#24615;&#21442;&#25968;&#19978;&#20351;&#29992;Bonferroni&#36793;&#30028;&#12290;&#24403;&#39044;&#27979;&#21464;&#37327;&#30340;&#26368;&#22823;&#26681;&#22312;&#24179;&#31283;&#33539;&#22260;&#20869;&#26102;&#65292;&#23427;&#20250;&#20999;&#25442;&#21040;&#20855;&#26377;&#31245;&#24494;&#20445;&#23432;&#20020;&#30028;&#20540;&#30340;&#26631;&#20934;&#39044;&#27979;&#20998;&#20301;&#25968;&#22238;&#24402;&#27979;&#35797;&#12290;&#27169;&#25311;&#32467;&#26524;&#34920;&#26126;&#65292;&#35813;&#27979;&#35797;&#22312;&#23567;&#26679;&#26412;&#19979;&#26377;&#21487;&#38752;&#30340;&#22823;&#23567;&#65292;&#24182;&#22312;&#39044;&#27979;&#22238;&#24402;&#38382;&#39064;&#26368;&#20026;&#20005;&#37325;&#26102;&#65292;&#21363;&#39044;&#27979;&#21464;&#37327;&#26159;&#25345;&#20037;&#24615;&#21644;&#20869;&#29983;&#24615;&#26102;&#20855;&#26377;&#24456;&#22909;&#30340;&#21151;&#25928;&#12290;&#25105;&#20204;&#37319;&#29992;&#36825;&#31181;&#26032;&#30340;&#26041;&#27861;&#35770;&#26469;&#20998;&#26512;&#19968;&#20010;&#23454;&#38469;&#30340;&#25968;&#25454;&#38598;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper studies inference in predictive quantile regressions when the predictive regressor has a near-unit root. We derive asymptotic distributions for the quantile regression estimator and its heteroskedasticity and autocorrelation consistent (HAC) t-statistic in terms of functionals of Ornstein-Uhlenbeck processes. We then propose a switching-fully modified (FM) predictive test for quantile predictability with persistent regressors. The proposed test employs an FM style correction with a Bonferroni bound for the local-to-unity parameter when the predictor has a near unit root. It switches to a standard predictive quantile regression test with a slightly conservative critical value when the largest root of the predictor lies in the stationary range. Simulations indicate that the test has reliable size in small samples and particularly good power when the predictor is persistent and endogenous, i.e., when the predictive regression problem is most acute. We employ this new methodolog
&lt;/p&gt;</description></item><item><title>&#22312;&#22478;&#24066;&#33073;&#30899;&#26041;&#38754;&#65292;SolarEV City&#65288;&#21363;&#23627;&#39030;&#20809;&#20239;&#19982;&#30005;&#21160;&#27773;&#36710;&#30340;&#32467;&#21512;&#65289;&#30340;&#25928;&#26524;&#21462;&#20915;&#20110;&#22320;&#29702;&#33539;&#22260;&#22823;&#23567;&#65292;&#23558;EV&#19982;PV&#36890;&#36807;V2H&#25110;V2B&#31995;&#32479;&#22312;&#22320;&#29702;&#33539;&#22260;&#26356;&#22823;&#30340;&#22320;&#21306;&#32467;&#21512;&#20351;&#29992;&#26356;&#26377;&#25928;&#12290;</title><link>http://arxiv.org/abs/2306.00132</link><description>&lt;p&gt;
&#24052;&#40654;SolarEV&#22478;&#24066;&#27010;&#24565;&#65306;&#19968;&#20010;&#26377;&#21069;&#36884;&#30340;&#24819;&#27861;&#21527;&#65311;
&lt;/p&gt;
&lt;p&gt;
SolarEV City Concept for Paris: A promising idea?. (arXiv:2306.00132v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.00132
&lt;/p&gt;
&lt;p&gt;
&#22312;&#22478;&#24066;&#33073;&#30899;&#26041;&#38754;&#65292;SolarEV City&#65288;&#21363;&#23627;&#39030;&#20809;&#20239;&#19982;&#30005;&#21160;&#27773;&#36710;&#30340;&#32467;&#21512;&#65289;&#30340;&#25928;&#26524;&#21462;&#20915;&#20110;&#22320;&#29702;&#33539;&#22260;&#22823;&#23567;&#65292;&#23558;EV&#19982;PV&#36890;&#36807;V2H&#25110;V2B&#31995;&#32479;&#22312;&#22320;&#29702;&#33539;&#22260;&#26356;&#22823;&#30340;&#22320;&#21306;&#32467;&#21512;&#20351;&#29992;&#26356;&#26377;&#25928;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22478;&#24066;&#33073;&#30899;&#26159;&#23454;&#29616;&#20840;&#29699;&#30899;&#20013;&#21644;&#25112;&#30053;&#30340;&#25903;&#26609;&#20043;&#19968;&#12290;&#28982;&#32780;&#65292;&#24403;&#21069;&#30340;&#22478;&#24066;&#33073;&#30899;&#36895;&#24230;&#19981;&#36275;&#20197;&#36319;&#19978;&#23454;&#29616;&#36825;&#19968;&#30446;&#26631;&#30340;&#21162;&#21147;&#12290;&#23627;&#39030;&#20809;&#20239;&#19982;&#30005;&#21160;&#27773;&#36710;&#65288;EV&#65289;&#38598;&#25104;&#20026;&#30005;&#27744;&#30340;SolarEV&#22478;&#24066;&#27010;&#24565;&#26159;&#19968;&#31181;&#26377;&#21069;&#36884;&#30340;&#25216;&#26415;&#65292;&#33021;&#22815;&#22312;&#22478;&#24066;&#29615;&#22659;&#20013;&#25552;&#20379;&#26080;CO2&#12289;&#23454;&#24800;&#12289;&#21487;&#35843;&#24230;&#30340;&#30005;&#21147;&#12290;&#22312;&#36825;&#37324;&#65292;&#25105;&#20204;&#35780;&#20272;&#20102;&#24052;&#40654;&#65292;&#27861;&#22269;&#30340;&#23627;&#39030;&#20809;&#20239;+EV&#19982;&#21608;&#36793;&#37066;&#21306;Ile-de-France&#21644;&#26085;&#26412;&#30340;&#20140;&#37117;&#30340;&#33073;&#30899;&#28508;&#21147;&#12290;&#25105;&#20204;&#36890;&#36807;&#35745;&#31639;PV + EV&#31995;&#32479;&#25110;&#20165;PV&#31995;&#32479;&#30340;&#33021;&#28304;&#20805;&#36275;&#24615;&#12289;&#33258;&#29992;&#29575;&#12289;&#33258;&#32473;&#33258;&#36275;&#29575;&#12289;&#25104;&#26412;&#33410;&#32422;&#21644;CO2&#25490;&#25918;&#20943;&#23569;&#31561;&#25351;&#26631;&#65292;&#23545;&#21508;&#31181;&#22330;&#26223;&#36827;&#34892;&#20102;&#35780;&#20272;&#12290;&#23558;EV&#19982;PV&#36890;&#36807;V2H&#25110;V2B&#31995;&#32479;&#22312;&#22478;&#24066;&#25110;&#22320;&#21306;&#23618;&#38754;&#19978;&#32467;&#21512;&#20351;&#29992;&#65292;&#22312;Ile-de-France&#27604;&#24052;&#40654;&#26356;&#26377;&#25928;&#65292;&#36825;&#34920;&#26126;SolarEV&#22478;&#24066;&#27010;&#24565;&#22312;&#22320;&#29702;&#33539;&#22260;&#26356;&#22823;&#30340;&#22320;&#21306;&#26356;&#26377;&#25928;&#12290;
&lt;/p&gt;
&lt;p&gt;
Urban decarbonization is one of the pillars for strategies to achieve carbon neutrality around the world. However, the current speed of urban decarbonization is insufficient to keep pace with efforts to achieve this goal. Rooftop PVs integrated with electric vehicles (EVs) as battery is a promising technology capable to supply CO2-free, affordable, and dispatchable electricity in urban environments (SolarEV City Concept). Here, we evaluated Paris, France for the decarbonization potentials of rooftop PV + EV in comparison to the surrounding suburban area Ile-de-France and Kyoto, Japan. We assessed various scenarios by calculating the energy sufficiency, self-consumption, self-sufficiency, cost savings, and CO2 emission reduction of the PV + EV system or PV only system. The combination of EVs with PVs by V2H or V2B systems at the city or region level was found to be more effective in Ile-de-France than in Paris suggesting that SolarEV City is more effective for geographically larger area
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26694;&#26550;&#65292;&#23558;&#39046;&#22495;&#30693;&#35782;&#21644;&#20808;&#39564;&#20449;&#24565;&#32435;&#20837;&#31163;&#25955;&#36873;&#25321;&#27169;&#22411;&#65288;DCM&#65289;&#30340;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#65288;DNN&#65289;&#20013;&#65292;&#20197;&#25193;&#23637;&#25968;&#25454;&#39537;&#21160;&#26041;&#27861;&#22312;DCM&#20013;&#30340;&#28508;&#21147;&#12290;&#25152;&#25552;&#20986;&#30340;&#26041;&#27861;&#26082;&#20855;&#26377;&#21487;&#35299;&#37322;&#24615;&#65292;&#21448;&#20445;&#30041;&#20102;DCM&#30340;&#20248;&#28857;&#21644;DNNs&#30340;&#28789;&#27963;&#24615;&#65292;&#24182;&#20248;&#20110;&#29616;&#26377;&#30340;&#26368;&#20808;&#36827;&#26041;&#27861;&#12290;</title><link>http://arxiv.org/abs/2306.00016</link><description>&lt;p&gt;
&#23558;&#39046;&#22495;&#30693;&#35782;&#32435;&#20837;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#30340;&#31163;&#25955;&#36873;&#25321;&#27169;&#22411;&#20013;
&lt;/p&gt;
&lt;p&gt;
Incorporating Domain Knowledge in Deep Neural Networks for Discrete Choice Models. (arXiv:2306.00016v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.00016
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26694;&#26550;&#65292;&#23558;&#39046;&#22495;&#30693;&#35782;&#21644;&#20808;&#39564;&#20449;&#24565;&#32435;&#20837;&#31163;&#25955;&#36873;&#25321;&#27169;&#22411;&#65288;DCM&#65289;&#30340;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#65288;DNN&#65289;&#20013;&#65292;&#20197;&#25193;&#23637;&#25968;&#25454;&#39537;&#21160;&#26041;&#27861;&#22312;DCM&#20013;&#30340;&#28508;&#21147;&#12290;&#25152;&#25552;&#20986;&#30340;&#26041;&#27861;&#26082;&#20855;&#26377;&#21487;&#35299;&#37322;&#24615;&#65292;&#21448;&#20445;&#30041;&#20102;DCM&#30340;&#20248;&#28857;&#21644;DNNs&#30340;&#28789;&#27963;&#24615;&#65292;&#24182;&#20248;&#20110;&#29616;&#26377;&#30340;&#26368;&#20808;&#36827;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#31163;&#25955;&#36873;&#25321;&#27169;&#22411;&#65288;DCM&#65289;&#34987;&#24191;&#27867;&#24212;&#29992;&#20110;&#26053;&#34892;&#38656;&#27714;&#20998;&#26512;&#20013;&#65292;&#20316;&#20026;&#19968;&#31181;&#24378;&#22823;&#30340;&#29702;&#35770;&#35745;&#37327;&#26694;&#26550;&#26469;&#29702;&#35299;&#21644;&#39044;&#27979;&#36873;&#25321;&#34892;&#20026;&#12290;DCM&#26159;&#38543;&#26426;&#25928;&#29992;&#27169;&#22411;&#65288;RUM&#65289;&#65292;&#20854;&#20027;&#35201;&#20248;&#28857;&#26159;&#21487;&#35299;&#37322;&#24615;&#12290;&#28982;&#32780;&#65292;&#20272;&#35745;&#36825;&#20123;&#27169;&#22411;&#30340;&#26680;&#24515;&#35201;&#27714;&#26159;&#20808;&#39564;&#25351;&#23450;&#30456;&#20851;&#30340;&#25928;&#29992;&#20989;&#25968;&#65292;&#20351;&#20854;&#23545;&#27169;&#22411;&#20154;&#21592;&#30340;&#20027;&#35266;&#20449;&#24565;&#25935;&#24863;&#12290;&#26368;&#36817;&#65292;&#26426;&#22120;&#23398;&#20064;&#65288;ML&#65289;&#26041;&#27861;&#24050;&#32463;&#25104;&#20026;&#23398;&#20064;DCM&#20013;&#26410;&#35266;&#27979;&#21040;&#30340;&#38750;&#32447;&#24615;&#20851;&#31995;&#30340;&#19968;&#31181;&#26377;&#21069;&#36884;&#30340;&#26041;&#27861;&#12290;&#28982;&#32780;&#65292;ML&#27169;&#22411;&#34987;&#35748;&#20026;&#26159;&#8220;&#40657;&#30418;&#23376;&#8221;&#65292;&#21487;&#33021;&#19982;&#39044;&#26399;&#30340;&#20851;&#31995;&#19981;&#31526;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#26694;&#26550;&#65292;&#36890;&#36807;&#32422;&#26463;&#25903;&#25345;&#24320;&#21457;&#24182;&#23558;&#39046;&#22495;&#30693;&#35782;&#21644;&#20808;&#39564;&#20449;&#24565;&#32435;&#20837;&#21487;&#35299;&#37322;&#27169;&#22411;&#20013;&#65292;&#20197;&#25193;&#23637;&#25968;&#25454;&#39537;&#21160;&#26041;&#27861;&#22312;DCM&#20013;&#30340;&#28508;&#21147;&#12290;&#25152;&#25552;&#20986;&#30340;&#26694;&#26550;&#21253;&#25324;&#20195;&#34920;&#25152;&#38656;&#20851;&#31995;&#30340;&#20266;&#25968;&#25454;&#26679;&#26412;&#21644;&#23558;DCM&#36716;&#25442;&#20026;&#20855;&#26377;&#36719;&#32422;&#26463;&#30340;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#65288;DNN&#65289;&#30340;&#23545;&#25968;&#20284;&#28982;&#20989;&#25968;&#12290;&#30001;&#27492;&#24471;&#21040;&#30340;&#27169;&#22411;&#26082;&#20855;&#26377;&#21487;&#35299;&#37322;&#24615;&#65292;&#21448;&#20445;&#30041;&#20102;RUM&#30340;&#20248;&#28857;&#21644;DNNs&#30340;&#28789;&#27963;&#24615;&#12290;&#23454;&#39564;&#32467;&#26524;&#34920;&#26126;&#65292;&#25152;&#25552;&#20986;&#30340;&#26041;&#27861;&#20248;&#20110;&#29616;&#26377;&#30340;&#26368;&#20808;&#36827;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
Discrete choice models (DCM) are widely employed in travel demand analysis as a powerful theoretical econometric framework for understanding and predicting choice behaviors. DCMs are formed as random utility models (RUM), with their key advantage of interpretability. However, a core requirement for the estimation of these models is a priori specification of the associated utility functions, making them sensitive to modelers' subjective beliefs. Recently, machine learning (ML) approaches have emerged as a promising avenue for learning unobserved non-linear relationships in DCMs. However, ML models are considered "black box" and may not correspond with expected relationships. This paper proposes a framework that expands the potential of data-driven approaches for DCM by supporting the development of interpretable models that incorporate domain knowledge and prior beliefs through constraints. The proposed framework includes pseudo data samples that represent required relationships and a l
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#20351;&#29992;Dominicy-Hill-Worton&#20272;&#35745;&#37327;&#20102;&#35299;&#20154;&#31867;&#27668;&#20505;&#36866;&#29983;&#21306;&#30340;&#29616;&#29366;&#21644;&#26410;&#26469;&#24773;&#20917;&#65292;&#21457;&#29616;&#27668;&#20505;&#21464;&#26262;&#27604;&#21464;&#20919;&#26356;&#20196;&#20154;&#25285;&#24551;&#65292;&#28526;&#28287;&#27604;&#24178;&#29157;&#26356;&#20196;&#20154;&#25285;&#24551;&#65292;&#28201;&#24230;&#21464;&#21270;&#27604;&#38477;&#27700;&#21464;&#21270;&#26356;&#37325;&#35201;&#12290;</title><link>http://arxiv.org/abs/2306.00002</link><description>&lt;p&gt;
&#20154;&#31867;&#27668;&#20505;&#21033;&#22522;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
The climate niche of Homo Sapiens. (arXiv:2306.00002v1 [physics.soc-ph])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.00002
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20351;&#29992;Dominicy-Hill-Worton&#20272;&#35745;&#37327;&#20102;&#35299;&#20154;&#31867;&#27668;&#20505;&#36866;&#29983;&#21306;&#30340;&#29616;&#29366;&#21644;&#26410;&#26469;&#24773;&#20917;&#65292;&#21457;&#29616;&#27668;&#20505;&#21464;&#26262;&#27604;&#21464;&#20919;&#26356;&#20196;&#20154;&#25285;&#24551;&#65292;&#28526;&#28287;&#27604;&#24178;&#29157;&#26356;&#20196;&#20154;&#25285;&#24551;&#65292;&#28201;&#24230;&#21464;&#21270;&#27604;&#38477;&#27700;&#21464;&#21270;&#26356;&#37325;&#35201;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;Dominicy-Hill-Worton&#20272;&#35745;&#37327;&#26469;&#20272;&#31639;&#20154;&#31867;&#21450;&#25105;&#20204;&#30340;&#20316;&#29289;&#22303;&#22320;&#24403;&#21069;&#30340;&#27668;&#20505;&#36866;&#29983;&#21306;&#65292;&#29992;&#20197;&#25512;&#26029;&#26410;&#26469;&#27668;&#20505;&#24322;&#24120;&#31243;&#24230;&#12290;&#36890;&#36807;Worton&#30340;&#21093;&#31163;&#22771;&#31561;&#26041;&#27861;&#65292;&#26412;&#25991;&#25214;&#21040;&#20302;&#28201;&#24230;&#30340;&#21402;&#23614;&#37096;&#32780;&#39640;&#28201;&#24230;&#30340;&#34180;&#23614;&#37096;&#65292;&#22240;&#27492;&#65292;&#21464;&#26262;&#27604;&#21464;&#20919;&#26356;&#20196;&#20154;&#25285;&#24551;&#65307;&#21516;&#26679;&#65292;&#28526;&#28287;&#27604;&#24178;&#29157;&#26356;&#20196;&#20154;&#25285;&#24551;&#12290;&#27492;&#22806;&#65292;&#28201;&#24230;&#21464;&#21270;&#27604;&#38477;&#27700;&#21464;&#21270;&#26356;&#37325;&#35201;&#12290;&#26412;&#25991;&#20351;&#29992;QQ&#26041;&#27861;&#26367;&#25442;&#20102;Hill&#20272;&#35745;&#37327;&#24182;&#36827;&#34892;&#20102;&#20462;&#27491;&#65292;&#20294;&#23450;&#24615;&#30340;&#32467;&#26524;&#19981;&#21463;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
I propose the Dominicy-Hill-Worton estimator to estimate the current climate niche of Homo Sapiens and our croplands. I use this to extrapolate the degree of unprecedentedness of future climates. Worton's peeled hull is a non-parametric, N-dimensional generalization of order statistics. Dominicy and colleagues show that Hill's estimator of the tail-index can be applied to any homogeneous function of multivariate order statistics. I apply the Dominicy-Hill estimator to transects through Worton's peels. I find a thick tail for low temperatures and a thin tail for high ones. That is, warming is more worrying than cooling. Similarly, wettening is more worrying than drying. Furthermore, temperature changes are more important than changes in precipitation. The results are not affected by income, population density, or time. I replace the Hill estimator by the QQ one and correct it for top-censoring. The qualitative results are unaffected.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;&#8220;&#39034;&#24207;&#26607;&#35199;&#32452;&#21512;&#26816;&#39564;&#8221;&#30340;&#22810;&#37325;&#26816;&#39564;&#25511;&#21046;&#24037;&#20855;&#65292;&#21487;&#29992;&#20110;&#25511;&#21046;&#38169;&#35823;&#21457;&#29616;&#21644;&#35782;&#21035;&#21333;&#20010;&#20449;&#21495;&#12290;&#35813;&#26816;&#39564;&#23454;&#29616;&#20102;&#24378;&#22823;&#30340;&#23478;&#26063;&#35823;&#24046;&#29575;&#25511;&#21046;&#65292;&#24182;&#19988;&#24403;&#26816;&#39564;&#32479;&#35745;&#37327;&#20381;&#36182;&#20110;&#29616;&#26377;&#30340;&#25511;&#21046;&#31243;&#24207;&#26102;&#65292;&#27604;&#29616;&#26377;&#30340;&#25511;&#21046;&#31243;&#24207;&#20445;&#23432;&#31243;&#24230;&#26356;&#20302;&#65292;&#20174;&#32780;&#23548;&#33268;&#26356;&#39640;&#30340;&#20840;&#23616;&#21151;&#29575;&#21644;&#25104;&#21151;&#30340;&#26816;&#27979;&#29575;&#12290;</title><link>http://arxiv.org/abs/2303.13406</link><description>&lt;p&gt;
&#22810;&#37325;&#26816;&#39564;&#38382;&#39064;&#20013;&#30340;&#39034;&#24207;&#26607;&#35199;&#32452;&#21512;&#26816;&#39564;&#21450;&#20854;&#22312;&#37329;&#34701;&#24212;&#29992;&#20013;&#30340;&#24212;&#29992;
&lt;/p&gt;
&lt;p&gt;
Sequential Cauchy Combination Test for Multiple Testing Problems with Financial Applications. (arXiv:2303.13406v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.13406
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;&#8220;&#39034;&#24207;&#26607;&#35199;&#32452;&#21512;&#26816;&#39564;&#8221;&#30340;&#22810;&#37325;&#26816;&#39564;&#25511;&#21046;&#24037;&#20855;&#65292;&#21487;&#29992;&#20110;&#25511;&#21046;&#38169;&#35823;&#21457;&#29616;&#21644;&#35782;&#21035;&#21333;&#20010;&#20449;&#21495;&#12290;&#35813;&#26816;&#39564;&#23454;&#29616;&#20102;&#24378;&#22823;&#30340;&#23478;&#26063;&#35823;&#24046;&#29575;&#25511;&#21046;&#65292;&#24182;&#19988;&#24403;&#26816;&#39564;&#32479;&#35745;&#37327;&#20381;&#36182;&#20110;&#29616;&#26377;&#30340;&#25511;&#21046;&#31243;&#24207;&#26102;&#65292;&#27604;&#29616;&#26377;&#30340;&#25511;&#21046;&#31243;&#24207;&#20445;&#23432;&#31243;&#24230;&#26356;&#20302;&#65292;&#20174;&#32780;&#23548;&#33268;&#26356;&#39640;&#30340;&#20840;&#23616;&#21151;&#29575;&#21644;&#25104;&#21151;&#30340;&#26816;&#27979;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#31181;&#31616;&#21333;&#30340;&#24037;&#20855;&#65292;&#29992;&#20110;&#22312;&#23384;&#22312;&#35768;&#22810;&#26816;&#39564;&#12289;&#26816;&#39564;&#32479;&#35745;&#37327;&#30456;&#20851;&#19988;&#20449;&#21495;&#28508;&#22312;&#31232;&#30095;&#30340;&#24773;&#20917;&#19979;&#25511;&#21046;&#38169;&#35823;&#21457;&#29616;&#24182;&#35782;&#21035;&#21333;&#20010;&#20449;&#21495;&#12290;&#35813;&#24037;&#20855;&#22312;&#19968;&#31995;&#21015;&#19981;&#26029;&#25193;&#23637;&#30340;$p$&#20540;&#23376;&#38598;&#19978;&#36882;&#24402;&#24212;&#29992;&#26607;&#35199;&#32452;&#21512;&#26816;&#39564;&#65292;&#24182;&#31216;&#20026;&#39034;&#24207;&#26607;&#35199;&#32452;&#21512;&#26816;&#39564;&#12290;&#34429;&#28982;&#21407;&#22987;&#30340;&#26607;&#35199;&#32452;&#21512;&#26816;&#39564;&#26088;&#22312;&#36890;&#36807;&#23545;&#36716;&#25442;&#21518;&#30340;$p$&#20540;&#27714;&#21644;&#23545;&#19968;&#32452;&#38646;&#20551;&#35774;&#36827;&#34892;&#20840;&#23616;&#22768;&#26126;&#65292;&#20294;&#39034;&#24207;&#29256;&#26412;&#30830;&#23450;&#21738;&#20123;$p$&#20540;&#35302;&#21457;&#25298;&#32477;&#20840;&#23616;&#38646;&#20551;&#35774;&#12290;&#35813;&#26816;&#39564;&#23454;&#29616;&#20102;&#24378;&#22823;&#30340;&#23478;&#26063;&#35823;&#24046;&#29575;&#25511;&#21046;&#65292;&#24182;&#19988;&#24403;&#26816;&#39564;&#32479;&#35745;&#37327;&#20381;&#36182;&#20110;&#29616;&#26377;&#30340;&#25511;&#21046;&#31243;&#24207;&#26102;&#65292;&#27604;&#29616;&#26377;&#30340;&#25511;&#21046;&#31243;&#24207;&#20445;&#23432;&#31243;&#24230;&#26356;&#20302;&#65292;&#20174;&#32780;&#23548;&#33268;&#26356;&#39640;&#30340;&#20840;&#23616;&#21151;&#29575;&#21644;&#25104;&#21151;&#30340;&#26816;&#27979;&#29575;&#12290;&#20316;&#20026;&#35828;&#26126;&#65292;&#25105;&#20204;&#32771;&#34385;&#20102;&#20004;&#31181;&#27969;&#34892;&#30340;&#37329;&#34701;&#35745;&#37327;&#24212;&#29992;&#31243;&#24207;&#65292;&#20004;&#32773;&#30340;&#26816;&#39564;&#32479;&#35745;&#37327;&#20855;&#26377;&#24207;&#21015;&#20381;&#36182;&#24615;&#25110;&#27178;&#25130;&#38754;&#20381;&#36182;&#24615;&#65306;&#30417;&#27979;&#28418;&#31227;&#12290;
&lt;/p&gt;
&lt;p&gt;
We introduce a simple tool to control for false discoveries and identify individual signals when there are many tests, the test statistics are correlated, and the signals are potentially sparse. The tool applies the Cauchy combination test recursively on a sequence of expanding subsets of $p$-values and is referred to as the sequential Cauchy combination test. While the original Cauchy combination test aims for a global statement over a set of null hypotheses by summing transformed $p$-values, the sequential version determines which $p$-values trigger the rejection of the global null. The test achieves strong familywise error rate control and is less conservative than existing controlling procedures when the test statistics are dependent, leading to higher global powers and successful detection rates. As illustrations, we consider two popular financial econometric applications for which the test statistics have either serial dependence or cross-sectional dependence: monitoring drift bu
&lt;/p&gt;</description></item><item><title>&#30740;&#31350;&#20272;&#35745;&#20102;&#39640;&#28201;&#23545;&#24037;&#20154;&#20581;&#24247;&#30340;&#24433;&#21709;&#65292;&#21457;&#29616;&#39640;&#28201;&#23548;&#33268;&#26356;&#22810;&#30340;&#32034;&#36180;&#65292;&#29305;&#21035;&#26159;&#22312;&#25143;&#22806;&#22522;&#30784;&#34892;&#19994;&#20174;&#20107;&#20307;&#21147;&#21171;&#21160;&#30340;&#24037;&#20154;&#20013;&#24433;&#21709;&#26368;&#26174;&#33879;&#12290;&#32844;&#19994;&#20013;&#21463;&#28909;&#24433;&#21709;&#26368;&#20005;&#37325;&#30340;&#24037;&#20154;&#26159;&#22899;&#24615;&#12289;&#24180;&#40836;&#36739;&#22823;&#19988;&#34218;&#36164;&#36739;&#39640;&#30340;&#24037;&#20154;&#12290;&#28909;&#30340;&#33030;&#24369;&#24615;&#27491;&#22312;&#22686;&#21152;&#65292;&#23588;&#20854;&#26159;&#22312;2015-2020&#24180;&#26399;&#38388;&#12290;</title><link>http://arxiv.org/abs/2301.11554</link><description>&lt;p&gt;
&#28909;&#28010;&#23545;&#24037;&#20154;&#20581;&#24247;&#30340;&#24433;&#21709;
&lt;/p&gt;
&lt;p&gt;
Heat and Worker Health. (arXiv:2301.11554v2 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2301.11554
&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#20272;&#35745;&#20102;&#39640;&#28201;&#23545;&#24037;&#20154;&#20581;&#24247;&#30340;&#24433;&#21709;&#65292;&#21457;&#29616;&#39640;&#28201;&#23548;&#33268;&#26356;&#22810;&#30340;&#32034;&#36180;&#65292;&#29305;&#21035;&#26159;&#22312;&#25143;&#22806;&#22522;&#30784;&#34892;&#19994;&#20174;&#20107;&#20307;&#21147;&#21171;&#21160;&#30340;&#24037;&#20154;&#20013;&#24433;&#21709;&#26368;&#26174;&#33879;&#12290;&#32844;&#19994;&#20013;&#21463;&#28909;&#24433;&#21709;&#26368;&#20005;&#37325;&#30340;&#24037;&#20154;&#26159;&#22899;&#24615;&#12289;&#24180;&#40836;&#36739;&#22823;&#19988;&#34218;&#36164;&#36739;&#39640;&#30340;&#24037;&#20154;&#12290;&#28909;&#30340;&#33030;&#24369;&#24615;&#27491;&#22312;&#22686;&#21152;&#65292;&#23588;&#20854;&#26159;&#22312;2015-2020&#24180;&#26399;&#38388;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#39640;&#28201;&#23545;&#24037;&#20154;&#30340;&#35748;&#30693;&#12289;&#23398;&#20064;&#21644;&#20219;&#21153;&#32489;&#25928;&#22343;&#20135;&#29983;&#36127;&#38754;&#24433;&#21709;&#12290;&#38543;&#30528;&#20840;&#29699;&#27668;&#28201;&#30340;&#21319;&#39640;&#65292;&#24037;&#20154;&#21487;&#33021;&#20250;&#38754;&#20020;&#26356;&#39640;&#30340;&#32844;&#19994;&#20260;&#23475;&#21644;&#30142;&#30149;&#39118;&#38505;&#12290;&#35813;&#30740;&#31350;&#21033;&#29992;&#28595;&#22823;&#21033;&#20122;&#24378;&#21046;&#20445;&#38505;&#35745;&#21010;&#36328;&#36234;1985-2020&#24180;&#30340;&#35760;&#24405;&#65292;&#20272;&#35745;&#20102;&#28201;&#24230;&#23545;&#24037;&#20154;&#20581;&#24247;&#30340;&#24433;&#21709;&#12290;&#21457;&#29616;&#39640;&#28201;&#23548;&#33268;&#26356;&#22810;&#30340;&#32034;&#36180;&#65292;&#23588;&#20854;&#26159;&#22312;&#25143;&#22806;&#22522;&#30784;&#34892;&#19994;&#20174;&#20107;&#20307;&#21147;&#21171;&#21160;&#30340;&#24037;&#20154;&#12290;&#36825;&#20123;&#19981;&#21033;&#24433;&#21709;&#22312;&#26102;&#38388;&#19978;&#27809;&#26377;&#20943;&#23569;&#65292;&#23588;&#20854;&#26159;&#22312;2015-2020&#24180;&#26399;&#38388;&#65292;&#34920;&#26126;&#23545;&#28909;&#30340;&#33030;&#24369;&#24615;&#27491;&#22312;&#22686;&#21152;&#12290;&#22312;&#32844;&#19994;&#26041;&#38754;&#65292;&#21463;&#28909;&#24433;&#21709;&#26368;&#20005;&#37325;&#30340;&#24037;&#20154;&#26159;&#22899;&#24615;&#12289;&#24180;&#40836;&#36739;&#22823;&#19988;&#34218;&#36164;&#36739;&#39640;&#30340;&#24037;&#20154;&#12290;&#26368;&#21518;&#65292;&#20225;&#19994;&#32423;&#38754;&#26495;&#20998;&#26512;&#32467;&#26524;&#34920;&#26126;&#65292;&#22312;&#28814;&#28909;&#30340;&#22825;&#27668;&#20013;&#65292;&#32034;&#36180;&#29575;&#22686;&#21152;&#30340;&#30334;&#20998;&#27604;&#26368;&#22823;&#30340;&#26159;&#8220;&#26356;&#23433;&#20840;&#8221;&#30340;&#20844;&#21496;&#12290;
&lt;/p&gt;
&lt;p&gt;
Extreme heat negatively impacts cognition, learning, and task performance. With increasing global temperatures, workers may therefore be at increased risk of work-related injuries and illness. This study estimates the effects of temperature on worker health using records spanning 1985-2020 from an Australian mandatory insurance scheme. High temperatures are found to cause significantly more claims, particularly among manual workers in outdoor-based industries. These adverse effects have not diminished across time, with the largest effect observed for the 2015-2020 period, indicating increasing vulnerability to heat. Within occupations, the workers most adversely affected by heat are female, older-aged and higher-earning. Finally, results from firm-level panel analyses show that the percentage increase in claims on hot days is largest at "safer" firms.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#19968;&#31181;&#39044;&#27979;&#32858;&#21512;&#27169;&#22411;&#65292;&#32771;&#34385;&#20102;&#36125;&#21494;&#26031;&#26041;&#27861;&#24212;&#29992;&#20110;&#19987;&#23478;&#21629;&#20013;&#21518;&#30340;&#20449;&#21495;&#27719;&#32858;&#12290;&#35770;&#25991;&#20013;&#25552;&#20379;&#20102;&#23545;&#20110;&#35813;&#38382;&#39064;&#30340;&#26679;&#26412;&#22797;&#26434;&#24230;&#65292;&#34920;&#26126;&#35813;&#22797;&#26434;&#24230;&#33267;&#23569;&#20026; $\tilde \Omega(m^{n-2} / \varepsilon)$&#65292;&#20854;&#20013; m &#26159;&#27599;&#20010;&#19987;&#23478;&#20449;&#21495;&#31354;&#38388;&#30340;&#22823;&#23567;&#12290;</title><link>http://arxiv.org/abs/2207.13126</link><description>&lt;p&gt;
&#39044;&#27979;&#32858;&#21512;&#30340;&#26679;&#26412;&#22797;&#26434;&#24230;
&lt;/p&gt;
&lt;p&gt;
Sample Complexity of Forecast Aggregation. (arXiv:2207.13126v3 [cs.LG] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2207.13126
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#19968;&#31181;&#39044;&#27979;&#32858;&#21512;&#27169;&#22411;&#65292;&#32771;&#34385;&#20102;&#36125;&#21494;&#26031;&#26041;&#27861;&#24212;&#29992;&#20110;&#19987;&#23478;&#21629;&#20013;&#21518;&#30340;&#20449;&#21495;&#27719;&#32858;&#12290;&#35770;&#25991;&#20013;&#25552;&#20379;&#20102;&#23545;&#20110;&#35813;&#38382;&#39064;&#30340;&#26679;&#26412;&#22797;&#26434;&#24230;&#65292;&#34920;&#26126;&#35813;&#22797;&#26434;&#24230;&#33267;&#23569;&#20026; $\tilde \Omega(m^{n-2} / \varepsilon)$&#65292;&#20854;&#20013; m &#26159;&#27599;&#20010;&#19987;&#23478;&#20449;&#21495;&#31354;&#38388;&#30340;&#22823;&#23567;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#32771;&#34385;&#20102;&#19968;&#31181;&#36125;&#21494;&#26031;&#39044;&#27979;&#32858;&#21512;&#27169;&#22411;&#65292;&#26377; n &#20010;&#19987;&#23478;&#26681;&#25454;&#26410;&#30693;&#20108;&#20803;&#20107;&#20214;&#30340;&#31169;&#26377;&#20449;&#21495;&#25253;&#21578;&#20107;&#20214;&#30340;&#21518;&#39564;&#20449;&#24565;&#32473;&#36127;&#36131;&#20154;&#65292;&#38543;&#21518;&#35813;&#36127;&#36131;&#20154;&#23558;&#25253;&#21578;&#32858;&#21512;&#20026;&#23545;&#35813;&#20107;&#20214;&#30340;&#21333;&#20010;&#39044;&#27979;&#12290;&#19987;&#23478;&#30340;&#20449;&#21495;&#21644;&#20107;&#20214;&#30340;&#32467;&#26524;&#26381;&#20174;&#19968;&#20010;&#32852;&#21512;&#20998;&#24067;&#65292;&#35813;&#20998;&#24067;&#23545;&#20110;&#36127;&#36131;&#20154;&#26159;&#26410;&#30693;&#30340;&#65292;&#20294;&#36127;&#36131;&#20154;&#21487;&#20197;&#20174;&#20998;&#24067;&#20013;&#24471;&#21040; i.i.d.&#8220;&#26679;&#26412;&#8221;&#65292;&#20854;&#20013;&#27599;&#20010;&#26679;&#26412;&#37117;&#26159;&#30001;&#19987;&#23478;&#30340;&#25253;&#21578;&#65288;&#19981;&#26159;&#20449;&#21495;&#65289;&#21644;&#20107;&#20214;&#30340;&#23454;&#29616;&#32452;&#25104;&#30340;&#20803;&#32452;&#12290;&#20351;&#29992;&#36825;&#20123;&#26679;&#26412;&#65292;&#36127;&#36131;&#20154;&#26088;&#22312;&#25214;&#21040;&#19968;&#20010; $\varepsilon$-&#26368;&#20248;&#32858;&#21512;&#22120;&#65292;&#20854;&#20013;&#26368;&#20248;&#24615;&#26159;&#20197;&#32858;&#21512;&#39044;&#27979;&#19982;&#20107;&#20214;&#23454;&#29616;&#20043;&#38388;&#30340;&#39044;&#26399;&#24179;&#26041;&#36317;&#31163;&#26469;&#34913;&#37327;&#30340;&#12290;&#25105;&#20204;&#35777;&#26126;&#65292;&#23545;&#20110;&#20219;&#24847;&#31163;&#25955;&#20998;&#24067;&#65292;&#36825;&#20010;&#38382;&#39064;&#30340;&#26679;&#26412;&#22797;&#26434;&#24230;&#33267;&#23569;&#26159; $\tilde \Omega(m^{n-2} / \varepsilon)$&#65292;&#20854;&#20013; m &#26159;&#27599;&#20010;&#19987;&#23478;&#20449;&#21495;&#31354;&#38388;&#30340;&#22823;&#23567;&#12290;
&lt;/p&gt;
&lt;p&gt;
We consider a Bayesian forecast aggregation model where $n$ experts, after observing private signals about an unknown binary event, report their posterior beliefs about the event to a principal, who then aggregates the reports into a single prediction for the event. The signals of the experts and the outcome of the event follow a joint distribution that is unknown to the principal, but the principal has access to i.i.d. "samples" from the distribution, where each sample is a tuple of the experts' reports (not signals) and the realization of the event. Using these samples, the principal aims to find an $\varepsilon$-approximately optimal aggregator, where optimality is measured in terms of the expected squared distance between the aggregated prediction and the realization of the event. We show that the sample complexity of this problem is at least $\tilde \Omega(m^{n-2} / \varepsilon)$ for arbitrary discrete distributions, where $m$ is the size of each expert's signal space. This sample
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#38024;&#23545;&#32447;&#24615;&#22238;&#24402;&#27169;&#22411;&#20013;&#31995;&#25968;&#23376;&#21521;&#37327;&#25512;&#26029;&#30340;&#26032;&#32622;&#25442;&#26816;&#39564;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#20855;&#26377;&#31934;&#30830;&#24615;&#21644;&#31283;&#20581;&#24615;&#65292;&#22312;&#29305;&#23450;&#26465;&#20214;&#19979;&#20855;&#26377;&#27491;&#30830;&#30340;&#27700;&#24179;&#12289;&#19968;&#33268;&#24615;&#21644;&#23545;&#23616;&#37096;&#26367;&#20195;&#26041;&#27861;&#30340;&#21151;&#29575;&#12290;</title><link>http://arxiv.org/abs/2205.06713</link><description>&lt;p&gt;
&#19968;&#31181;&#32447;&#24615;&#22238;&#24402;&#23376;&#21521;&#37327;&#25512;&#26029;&#30340;&#31283;&#20581;&#32622;&#25442;&#26816;&#39564;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
A Robust Permutation Test for Subvector Inference in Linear Regressions. (arXiv:2205.06713v3 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2205.06713
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#38024;&#23545;&#32447;&#24615;&#22238;&#24402;&#27169;&#22411;&#20013;&#31995;&#25968;&#23376;&#21521;&#37327;&#25512;&#26029;&#30340;&#26032;&#32622;&#25442;&#26816;&#39564;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#20855;&#26377;&#31934;&#30830;&#24615;&#21644;&#31283;&#20581;&#24615;&#65292;&#22312;&#29305;&#23450;&#26465;&#20214;&#19979;&#20855;&#26377;&#27491;&#30830;&#30340;&#27700;&#24179;&#12289;&#19968;&#33268;&#24615;&#21644;&#23545;&#23616;&#37096;&#26367;&#20195;&#26041;&#27861;&#30340;&#21151;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#31181;&#26032;&#30340;&#32622;&#25442;&#26816;&#39564;&#26041;&#27861;&#65292;&#29992;&#20110;&#32447;&#24615;&#27169;&#22411;&#20013;&#31995;&#25968;&#30340;&#23376;&#21521;&#37327;&#25512;&#26029;&#12290;&#24403;&#33258;&#21464;&#37327;&#21644;&#35823;&#24046;&#39033;&#29420;&#31435;&#26102;&#65292;&#35813;&#26816;&#39564;&#26041;&#27861;&#26159;&#31934;&#30830;&#30340;&#12290;&#25509;&#30528;&#65292;&#25105;&#20204;&#35777;&#26126;&#22312;&#20004;&#20010;&#20027;&#35201;&#26465;&#20214;&#19979;&#65292;&#24403;&#29420;&#31435;&#26465;&#20214;&#24471;&#21040;&#25918;&#26494;&#26102;&#65292;&#35813;&#26816;&#39564;&#26041;&#27861;&#22312;&#28176;&#36827;&#24847;&#20041;&#19979;&#20855;&#26377;&#27491;&#30830;&#30340;&#27700;&#24179;&#12289;&#19968;&#33268;&#24615;&#21644;&#23545;&#23616;&#37096;&#26367;&#20195;&#26041;&#27861;&#30340;&#21151;&#29575;&#12290;&#31532;&#19968;&#20010;&#26465;&#20214;&#26159;&#36890;&#24120;&#30340;&#33258;&#21464;&#37327;&#21644;&#35823;&#24046;&#39033;&#20043;&#38388;&#32570;&#20047;&#30456;&#20851;&#24615;&#30340;&#30053;&#24494;&#24378;&#21270;&#12290;&#31532;&#20108;&#20010;&#26465;&#20214;&#26159;&#65292;&#30001;&#19981;&#28041;&#21450;&#23376;&#21521;&#37327;&#26816;&#39564;&#30340;&#33258;&#21464;&#37327;&#20540;&#23450;&#20041;&#30340;&#20998;&#23618;&#25968;&#30446;&#30456;&#23545;&#20110;&#26679;&#26412;&#37327;&#24456;&#23567;&#12290;&#36825;&#24847;&#21619;&#30528;&#24178;&#25200;&#33258;&#21464;&#37327;&#21521;&#37327;&#26159;&#31163;&#25955;&#30340;&#12290;&#27169;&#25311;&#21644;&#23454;&#35777;&#35828;&#26126;&#65292;&#22914;&#26524;&#30340;&#30830;&#26377;&#23569;&#37327;&#30340;&#20998;&#23618;&#30456;&#23545;&#20110;&#26679;&#26412;&#37327;&#32780;&#35328;&#65292;&#35813;&#26816;&#39564;&#26041;&#27861;&#22312;&#23454;&#36341;&#20013;&#20855;&#26377;&#33391;&#22909;&#30340;&#21151;&#25928;&#12290;
&lt;/p&gt;
&lt;p&gt;
We develop a new permutation test for inference on a subvector of coefficients in linear models. The test is exact when the regressors and the error terms are independent. Then, we show that the test is asymptotically of correct level, consistent and has power against local alternatives when the independence condition is relaxed, under two main conditions. The first is a slight reinforcement of the usual absence of correlation between the regressors and the error term. The second is that the number of strata, defined by values of the regressors not involved in the subvector test, is small compared to the sample size. The latter implies that the vector of nuisance regressors is discrete. Simulations and empirical illustrations suggest that the test has good power in practice if, indeed, the number of strata is small compared to the sample size.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#23545;&#27495;&#35270;&#29702;&#35770;&#36827;&#34892;&#20102;&#32508;&#36848;&#24182;&#25552;&#20986;&#20102;&#26032;&#30340;&#30740;&#31350;&#25104;&#26524;&#65292;&#21253;&#25324;&#29305;&#23450;&#23398;&#20064;&#21644;&#20449;&#20196;&#29615;&#22659;&#19979;&#30340;&#24605;&#32771;&#65292;&#31639;&#27861;&#23398;&#20064;&#21644;&#20915;&#31574;&#21046;&#23450;&#65292;&#20197;&#21450;&#24341;&#20837;&#34892;&#20026;&#20559;&#24046;&#21644;&#35823;&#35774;&#20449;&#24565;&#30340;&#20195;&#29702;&#12290;&#27492;&#22806;&#65292;&#35813;&#25991;&#30830;&#23450;&#20102;&#19968;&#20010;&#30001;&#27495;&#35270;&#24615;&#31038;&#20250;&#35268;&#33539;&#21644;&#27495;&#35270;&#24615;&#21046;&#24230;&#35774;&#35745;&#29702;&#35770;&#32452;&#25104;&#30340;&#27495;&#35270;&#24615;&#26426;&#26500;&#27169;&#22411;&#31867;&#21035;&#65292;&#25506;&#35752;&#20102;&#20851;&#20110;&#27495;&#35270;&#27979;&#37327;&#21644;&#27495;&#35270;&#20998;&#31867;&#30340;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2205.05994</link><description>&lt;p&gt;
&#27495;&#35270;&#29702;&#35770;&#30340;&#36817;&#26399;&#36129;&#29486;
&lt;/p&gt;
&lt;p&gt;
Recent Contributions to Theories of Discrimination. (arXiv:2205.05994v3 [econ.TH] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2205.05994
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#23545;&#27495;&#35270;&#29702;&#35770;&#36827;&#34892;&#20102;&#32508;&#36848;&#24182;&#25552;&#20986;&#20102;&#26032;&#30340;&#30740;&#31350;&#25104;&#26524;&#65292;&#21253;&#25324;&#29305;&#23450;&#23398;&#20064;&#21644;&#20449;&#20196;&#29615;&#22659;&#19979;&#30340;&#24605;&#32771;&#65292;&#31639;&#27861;&#23398;&#20064;&#21644;&#20915;&#31574;&#21046;&#23450;&#65292;&#20197;&#21450;&#24341;&#20837;&#34892;&#20026;&#20559;&#24046;&#21644;&#35823;&#35774;&#20449;&#24565;&#30340;&#20195;&#29702;&#12290;&#27492;&#22806;&#65292;&#35813;&#25991;&#30830;&#23450;&#20102;&#19968;&#20010;&#30001;&#27495;&#35270;&#24615;&#31038;&#20250;&#35268;&#33539;&#21644;&#27495;&#35270;&#24615;&#21046;&#24230;&#35774;&#35745;&#29702;&#35770;&#32452;&#25104;&#30340;&#27495;&#35270;&#24615;&#26426;&#26500;&#27169;&#22411;&#31867;&#21035;&#65292;&#25506;&#35752;&#20102;&#20851;&#20110;&#27495;&#35270;&#27979;&#37327;&#21644;&#27495;&#35270;&#20998;&#31867;&#30340;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#32508;&#36848;&#20102;&#20851;&#20110;&#27495;&#35270;&#29702;&#35770;&#30340;&#25991;&#29486;&#65292;&#20027;&#35201;&#20851;&#27880;&#20110;&#26032;&#30340;&#30740;&#31350;&#25104;&#26524;&#12290;&#26368;&#36817;&#30340;&#29702;&#35770;&#25193;&#23637;&#20102;&#20256;&#32479;&#30340;&#22522;&#20110;&#21697;&#21619;&#21644;&#32479;&#35745;&#27495;&#35270;&#26694;&#26550;&#65292;&#36890;&#36807;&#32771;&#34385;&#23398;&#20064;&#21644;&#20449;&#21495;&#29615;&#22659;&#30340;&#29305;&#23450;&#29305;&#28857;&#65292;&#32463;&#24120;&#20351;&#29992;&#26032;&#30340;&#20449;&#24687;&#21644;&#26426;&#21046;&#35774;&#35745;&#35821;&#35328;&#65307;&#36890;&#36807;&#20998;&#26512;&#31639;&#27861;&#30340;&#23398;&#20064;&#21644;&#20915;&#31574;&#21046;&#23450;&#65307;&#24182;&#24341;&#20837;&#20855;&#26377;&#34892;&#20026;&#20559;&#24046;&#21644;&#35823;&#35774;&#20449;&#24565;&#30340;&#20195;&#29702;&#12290;&#35813;&#32508;&#36848;&#36824;&#23581;&#35797;&#32553;&#23567;&#32463;&#27982;&#23398;&#35282;&#24230;&#23545;&#8220;&#27495;&#35270;&#29702;&#35770;&#8221;&#30340;&#30475;&#27861;&#19982;&#31038;&#20250;&#31185;&#23398;&#25991;&#29486;&#20013;&#26356;&#24191;&#27867;&#30340;&#27495;&#35270;&#30740;&#31350;&#20043;&#38388;&#30340;&#24046;&#36317;&#12290;&#22312;&#36825;&#26041;&#38754;&#65292;&#25105;&#39318;&#20808;&#36890;&#36807;&#30830;&#23450;&#19968;&#20010;&#30001;&#27495;&#35270;&#24615;&#31038;&#20250;&#35268;&#33539;&#21644;&#27495;&#35270;&#24615;&#21046;&#24230;&#35774;&#35745;&#29702;&#35770;&#32452;&#25104;&#30340;&#27495;&#35270;&#24615;&#26426;&#26500;&#27169;&#22411;&#31867;&#21035;&#20570;&#20986;&#36129;&#29486;&#12290;&#20854;&#27425;&#65292;&#35752;&#35770;&#28041;&#21450;&#27495;&#35270;&#27979;&#37327;&#21644;&#23558;&#27495;&#35270;&#20998;&#31867;&#20026;&#20559;&#35265;&#25110;&#32479;&#35745;&#23398;&#65292;&#30452;&#25509;&#25110;&#31995;&#32479;&#24615;&#20197;&#21450;&#19990;&#30028;&#24615;&#31561;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper surveys the literature on theories of discrimination, focusing mainly on new contributions. Recent theories expand on the traditional taste-based and statistical discrimination frameworks by considering specific features of learning and signaling environments, often using novel informationand mechanism-design language; analyzing learning and decision making by algorithms; and introducing agents with behavioral biases and misspecified beliefs. This survey also attempts to narrow the gap between the economic perspective on ``theories of discrimination'' and the broader study of discrimination in the social science literature. In that respect, I first contribute by identifying a class of models of discriminatory institutions, made up of theories of discriminatory social norms and discriminatory institutional design. Second, I discuss issues relating to the measurement of discrimination, and the classification of discrimination as bias or statistical, direct or systemic, and a
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#32943;&#23612;&#20122;&#36873;&#20030;&#26292;&#21147;&#23545;&#20154;&#31867;&#20135;&#29983;&#30340;&#38271;&#26399;&#24433;&#21709;&#65292;&#21457;&#29616;&#26292;&#21147;&#26292;&#38706;&#26399;&#38388;&#30340;&#33829;&#20859;&#29366;&#20917;&#20250;&#24433;&#21709;&#25104;&#24180;&#36523;&#39640;&#65292;&#32780;&#35813;&#24433;&#21709;&#21487;&#33021;&#20250;&#22312;&#20195;&#38469;&#38388;&#20256;&#36882;&#65292;&#21482;&#26377;&#30007;&#23401;&#20250;&#34920;&#29616;&#20986;&#36825;&#31181;&#25928;&#24212;&#12290;</title><link>http://arxiv.org/abs/2112.13849</link><description>&lt;p&gt;
&#32943;&#23612;&#20122;&#36873;&#20030;&#26292;&#21147;&#23545;&#20581;&#24247;&#21644;&#20154;&#21147;&#36164;&#26412;&#30340;&#38271;&#26399;&#24433;&#21709;
&lt;/p&gt;
&lt;p&gt;
The Long-Run Impact of Electoral Violence on Health and Human Capital in Kenya. (arXiv:2112.13849v3 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2112.13849
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#32943;&#23612;&#20122;&#36873;&#20030;&#26292;&#21147;&#23545;&#20154;&#31867;&#20135;&#29983;&#30340;&#38271;&#26399;&#24433;&#21709;&#65292;&#21457;&#29616;&#26292;&#21147;&#26292;&#38706;&#26399;&#38388;&#30340;&#33829;&#20859;&#29366;&#20917;&#20250;&#24433;&#21709;&#25104;&#24180;&#36523;&#39640;&#65292;&#32780;&#35813;&#24433;&#21709;&#21487;&#33021;&#20250;&#22312;&#20195;&#38469;&#38388;&#20256;&#36882;&#65292;&#21482;&#26377;&#30007;&#23401;&#20250;&#34920;&#29616;&#20986;&#36825;&#31181;&#25928;&#24212;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#20135;&#21069;&#12289;&#31461;&#24180;&#21644;&#38738;&#23569;&#24180;&#26292;&#38706;&#20110;&#36873;&#20030;&#26292;&#21147;&#23545;&#20581;&#24247;&#21644;&#20154;&#21147;&#36164;&#26412;&#30340;&#38271;&#26399;&#24433;&#21709;&#65292;&#24182;&#25506;&#35752;&#20102;&#36825;&#20123;&#24433;&#21709;&#26159;&#21542;&#20250;&#20256;&#36882;&#32473;&#26410;&#26469;&#30340;&#21518;&#20195;&#12290;&#25105;&#20204;&#21033;&#29992;1992&#24180;&#33267;2013&#24180;&#26399;&#38388;&#32943;&#23612;&#20122;&#36873;&#20030;&#26292;&#21147;&#30340;&#26102;&#38388;&#21644;&#31354;&#38388;&#21464;&#21270;&#20197;&#21450;&#20840;&#22269;&#20195;&#34920;&#24615;&#35843;&#26597;&#26469;&#30830;&#23450;&#26292;&#21147;&#20107;&#20214;&#30340;&#26292;&#38706;&#20154;&#32676;&#12290;&#36890;&#36807;&#31895;&#30053;&#21305;&#37197;&#65292;&#25105;&#20204;&#21457;&#29616;&#20135;&#21069;&#21040;16&#23681;&#26399;&#38388;&#26292;&#38706;&#20110;&#36873;&#20030;&#26292;&#21147;&#20250;&#38477;&#20302;&#25104;&#24180;&#20154;&#30340;&#36523;&#39640;&#12290;&#20808;&#21069;&#30340;&#30740;&#31350;&#34920;&#26126;&#65292;&#38271;&#26399;&#30340;&#22823;&#35268;&#27169;&#27494;&#35013;&#20914;&#31361;&#20250;&#23558;&#21457;&#32946;&#36831;&#32531;&#30340;&#24433;&#21709;&#20256;&#36882;&#32473;&#21518;&#20195;&#12290;&#19982;&#36825;&#20123;&#30740;&#31350;&#19968;&#33268;&#65292;&#25105;&#20204;&#21457;&#29616;&#32943;&#23612;&#20122;&#20302;&#35268;&#27169;&#20294;&#39057;&#32321;&#21457;&#29983;&#30340;&#36873;&#20030;&#26292;&#21147;&#24433;&#21709;&#20102;&#37027;&#20123;&#22312;&#25104;&#38271;&#26399;&#38388;&#30340;&#29238;&#27597;&#26292;&#38706;&#20110;&#27492;&#31867;&#26292;&#21147;&#20107;&#20214;&#20013;&#30340;&#20799;&#31461;&#36523;&#39640;&#12290;&#21482;&#26377;&#30007;&#23401;&#34920;&#29616;&#20986;&#36825;&#31181;&#20195;&#38469;&#25928;&#24212;&#65292;&#21487;&#33021;&#26159;&#30001;&#20110;&#20182;&#20204;&#26356;&#23481;&#26131;&#21463;&#21040;&#33829;&#20859;&#19981;&#33391;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper examines the long-term effects of prenatal, childhood, and teen exposure to electoral violence on health and human capital. Furthermore, it investigates whether these effects are passed down to future generations. We exploit the temporal and spatial variation of electoral violence in Kenya between 1992 and 2013 in conjunction with a nationally representative survey to identify people exposed to such violence. Using coarsened matching, we find that exposure to electoral violence between prenatal and the age of sixteen reduces adult height. Previous research has demonstrated that protracted, large-scale armed conflicts can pass down stunting effects to descendants. In line with these studies, we find that the low-scale but recurrent electoral violence in Kenya has affected the height-for-age of children whose parents were exposed to such violence during their growing years. Only boys exhibit this intergenerational effect, possibly due to their increased susceptibility to malnu
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#24320;&#21457;&#20102;&#32447;&#24615;&#24037;&#20855;&#21464;&#37327;&#22238;&#24402;&#20013;&#20581;&#22766;&#30340;&#32622;&#25442;&#26816;&#39564;&#29256;&#26412;&#65292;&#19982;&#29616;&#26377;&#30340;&#20551;&#35774;&#20202;&#22120;&#21644;&#35823;&#24046;&#39033;&#20043;&#38388;&#29420;&#31435;&#30340;&#38543;&#26426;&#21270;&#21644;&#22522;&#20110;&#31209;&#30340;&#26816;&#39564;&#20551;&#35774;&#19981;&#21516;&#65292;&#36825;&#20123;&#27979;&#35797;&#20855;&#26377;&#26465;&#20214;&#24322;&#26041;&#24046;&#30340;&#40065;&#26834;&#24615;&#24182;&#19988;&#22312;&#20202;&#22120;&#19982;&#35823;&#24046;&#39033;&#27491;&#20132;&#26102;&#34920;&#29616;&#20986;&#28176;&#36817;&#30456;&#20284;&#12290;&#22312;&#20202;&#22120;&#19982;&#32467;&#26500;&#24615;&#35823;&#24046;&#39033;&#29420;&#31435;&#26102;&#65292;&#32622;&#25442;AR&#27979;&#35797;&#26159;&#31934;&#30830;&#30340;&#65292;&#22240;&#27492;&#23545;&#20110;&#37325;&#23614;&#26159;&#40065;&#26834;&#30340;&#12290;</title><link>http://arxiv.org/abs/2111.13774</link><description>&lt;p&gt;
&#32447;&#24615;&#24037;&#20855;&#21464;&#37327;&#22238;&#24402;&#20013;&#20581;&#22766;&#30340;&#32622;&#25442;&#26816;&#39564;
&lt;/p&gt;
&lt;p&gt;
Robust Permutation Tests in Linear Instrumental Variables Regression. (arXiv:2111.13774v2 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2111.13774
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#24320;&#21457;&#20102;&#32447;&#24615;&#24037;&#20855;&#21464;&#37327;&#22238;&#24402;&#20013;&#20581;&#22766;&#30340;&#32622;&#25442;&#26816;&#39564;&#29256;&#26412;&#65292;&#19982;&#29616;&#26377;&#30340;&#20551;&#35774;&#20202;&#22120;&#21644;&#35823;&#24046;&#39033;&#20043;&#38388;&#29420;&#31435;&#30340;&#38543;&#26426;&#21270;&#21644;&#22522;&#20110;&#31209;&#30340;&#26816;&#39564;&#20551;&#35774;&#19981;&#21516;&#65292;&#36825;&#20123;&#27979;&#35797;&#20855;&#26377;&#26465;&#20214;&#24322;&#26041;&#24046;&#30340;&#40065;&#26834;&#24615;&#24182;&#19988;&#22312;&#20202;&#22120;&#19982;&#35823;&#24046;&#39033;&#27491;&#20132;&#26102;&#34920;&#29616;&#20986;&#28176;&#36817;&#30456;&#20284;&#12290;&#22312;&#20202;&#22120;&#19982;&#32467;&#26500;&#24615;&#35823;&#24046;&#39033;&#29420;&#31435;&#26102;&#65292;&#32622;&#25442;AR&#27979;&#35797;&#26159;&#31934;&#30830;&#30340;&#65292;&#22240;&#27492;&#23545;&#20110;&#37325;&#23614;&#26159;&#40065;&#26834;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#24320;&#21457;&#20986;&#32447;&#24615;&#24037;&#20855;&#21464;&#37327;&#65288;IV&#65289;&#22238;&#24402;&#20013;&#37492;&#21035;&#26377;&#21147;&#30340;&#32622;&#25442;&#26816;&#39564;&#29256;&#26412;&#12290;&#19982;&#29616;&#26377;&#30340;&#38543;&#26426;&#21270;&#21644;&#22522;&#20110;&#31209;&#30340;&#26816;&#39564;&#20551;&#35774;&#20202;&#22120;&#21644;&#35823;&#24046;&#39033;&#20043;&#38388;&#29420;&#31435;&#19981;&#21516;&#65292;&#32622;&#25442;Anderson-Rubin&#65288;AR&#65289;&#12289;Lagrange Multiplier&#65288;LM&#65289;&#21644;Conditional Likelihood Ratio&#65288;CLR&#65289;&#26816;&#39564;&#22312;&#26631;&#20934;&#25490;&#38500;&#38480;&#21046;&#21363;&#20202;&#22120;&#21644;&#35823;&#24046;&#39033;&#27491;&#20132;&#26102;&#28176;&#36817;&#30456;&#20284;&#19988;&#20855;&#26377;&#26465;&#20214;&#24322;&#26041;&#24046;&#30340;&#40065;&#26834;&#24615;&#12290;&#27492;&#22806;&#65292;&#24403;&#20202;&#22120;&#19982;&#32467;&#26500;&#24615;&#35823;&#24046;&#39033;&#29420;&#31435;&#26102;&#65292;&#32622;&#25442;AR&#26816;&#39564;&#26159;&#31934;&#30830;&#30340;&#65292;&#22240;&#27492;&#26159;&#23545;&#37325;&#23614;&#40065;&#26834;&#30340;&#12290;&#22240;&#27492;&#65292;&#36825;&#20123;&#27979;&#35797;&#20855;&#26377;&#22522;&#20110;&#31209;&#30340;&#27979;&#35797;&#21644;&#37326;bootstrap AR&#27979;&#35797;&#30340;&#20248;&#28857;&#12290;&#25968;&#20540;&#23454;&#20363;&#35777;&#23454;&#20102;&#29702;&#35770;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper develops permutation versions of identification-robust tests in linear instrumental variables (IV) regression. Unlike the existing randomization and rank-based tests in which independence between the instruments and the error terms is assumed, the permutation Anderson- Rubin (AR), Lagrange Multiplier (LM) and Conditional Likelihood Ratio (CLR) tests are asymptotically similar and robust to conditional heteroskedasticity under standard exclusion restriction i.e. the orthogonality between the instruments and the error terms. Moreover, when the instruments are independent of the structural error term, the permutation AR tests are exact, hence robust to heavy tails. As such, these tests share the strengths of the rank-based tests and the wild bootstrap AR tests. Numerical illustrations corroborate the theoretical results.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#27979;&#35797;&#20102;&#32463;&#27982;&#35843;&#26597;&#20013;&#29992;&#20110;&#39044;&#27979;&#30340;&#20013;&#24515;&#36235;&#21183;&#24230;&#37327;&#30340;&#21512;&#29702;&#24615;&#65292;&#21457;&#29616;&#23545;&#31216;&#20998;&#24067;&#24773;&#20917;&#19979;&#30340;&#35782;&#21035;&#38382;&#39064;&#24182;&#25552;&#20986;&#20102;&#26032;&#22411;&#21512;&#29702;&#24615;&#26816;&#39564;&#12290;&#22312;&#24212;&#29992;&#21040;&#32445;&#32422;&#32852;&#37030;&#20648;&#22791;&#38134;&#34892;&#30340;&#35843;&#26597;&#20013;&#65292;&#21457;&#29616;&#25910;&#20837;&#39044;&#27979;&#21487;&#20197;&#20316;&#20026;&#20247;&#25968;&#39044;&#27979;&#21512;&#29702;&#21270;&#65292;&#20294;&#19981;&#21487;&#20316;&#20026;&#22343;&#20540;&#25110;&#20013;&#20301;&#25968;&#39044;&#27979;&#21512;&#29702;&#21270;&#65292;&#19988;&#22312;&#19981;&#21516;&#26679;&#26412;&#20998;&#23618;&#19979;&#23384;&#22312;&#24322;&#36136;&#24615;&#12290;</title><link>http://arxiv.org/abs/1910.12545</link><description>&lt;p&gt;
&#23545;&#20013;&#24515;&#36235;&#21183;&#24230;&#37327;&#30340;&#39044;&#27979;&#21512;&#29702;&#24615;&#36827;&#34892;&#27979;&#35797;
&lt;/p&gt;
&lt;p&gt;
Testing Forecast Rationality for Measures of Central Tendency. (arXiv:1910.12545v4 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/1910.12545
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#27979;&#35797;&#20102;&#32463;&#27982;&#35843;&#26597;&#20013;&#29992;&#20110;&#39044;&#27979;&#30340;&#20013;&#24515;&#36235;&#21183;&#24230;&#37327;&#30340;&#21512;&#29702;&#24615;&#65292;&#21457;&#29616;&#23545;&#31216;&#20998;&#24067;&#24773;&#20917;&#19979;&#30340;&#35782;&#21035;&#38382;&#39064;&#24182;&#25552;&#20986;&#20102;&#26032;&#22411;&#21512;&#29702;&#24615;&#26816;&#39564;&#12290;&#22312;&#24212;&#29992;&#21040;&#32445;&#32422;&#32852;&#37030;&#20648;&#22791;&#38134;&#34892;&#30340;&#35843;&#26597;&#20013;&#65292;&#21457;&#29616;&#25910;&#20837;&#39044;&#27979;&#21487;&#20197;&#20316;&#20026;&#20247;&#25968;&#39044;&#27979;&#21512;&#29702;&#21270;&#65292;&#20294;&#19981;&#21487;&#20316;&#20026;&#22343;&#20540;&#25110;&#20013;&#20301;&#25968;&#39044;&#27979;&#21512;&#29702;&#21270;&#65292;&#19988;&#22312;&#19981;&#21516;&#26679;&#26412;&#20998;&#23618;&#19979;&#23384;&#22312;&#24322;&#36136;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#32463;&#27982;&#35843;&#26597;&#30340;&#21512;&#29702;&#21463;&#35775;&#32773;&#21487;&#33021;&#20250;&#25253;&#21578;&#20219;&#20309;&#20013;&#24515;&#36235;&#21183;&#24230;&#37327;&#65288;&#20363;&#22914;&#22343;&#20540;&#12289;&#20013;&#20301;&#25968;&#12289;&#20247;&#25968;&#25110;&#20219;&#20309;&#20984;&#32452;&#21512;&#65289;&#20316;&#20026;&#28857;&#39044;&#27979;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22312;&#21463;&#35775;&#32773;&#20351;&#29992;&#30340;&#20013;&#24515;&#36235;&#21183;&#24230;&#37327;&#26410;&#30693;&#26102;&#30340;&#39044;&#27979;&#21512;&#29702;&#24615;&#27979;&#35797;&#26041;&#27861;&#12290;&#25105;&#20204;&#20811;&#26381;&#20102;&#24403;&#20013;&#24515;&#36235;&#21183;&#24230;&#37327;&#30456;&#31561;&#25110;&#20301;&#20110;&#24444;&#27492;&#30340;&#23616;&#37096;&#37051;&#22495;&#20869;&#26102;&#65288;&#23545;&#20110;&#65288;&#20960;&#20046;&#65289;&#23545;&#31216;&#30340;&#20998;&#24067;&#24773;&#20917;&#65289;&#65292;&#20986;&#29616;&#30340;&#35782;&#21035;&#38382;&#39064;&#12290;&#20316;&#20026;&#26500;&#24314;&#22359;&#65292;&#25105;&#20204;&#36824;&#25552;&#20986;&#20102;&#23545;&#20247;&#25968;&#39044;&#27979;&#30340;&#26032;&#22411;&#21512;&#29702;&#24615;&#26816;&#39564;&#12290;&#25105;&#20204;&#23558;&#27979;&#35797;&#24212;&#29992;&#20110;&#32445;&#32422;&#32852;&#37030;&#20648;&#22791;&#38134;&#34892;&#30340;&#28040;&#36153;&#32773;&#39044;&#26399;&#35843;&#26597;&#20013;&#30340;&#25910;&#20837;&#39044;&#27979;&#12290;&#25105;&#20204;&#21457;&#29616;&#36825;&#20123;&#39044;&#27979;&#21487;&#20197;&#20316;&#20026;&#20247;&#25968;&#39044;&#27979;&#21512;&#29702;&#21270;&#65292;&#20294;&#19981;&#21487;&#20197;&#20316;&#20026;&#22343;&#20540;&#25110;&#20013;&#20301;&#25968;&#39044;&#27979;&#21512;&#29702;&#21270;&#12290;&#25105;&#20204;&#36824;&#21457;&#29616;&#22312;&#26679;&#26412;&#20998;&#23618;&#20013;&#65292;&#21463;&#35775;&#32773;&#20351;&#29992;&#30340;&#20013;&#24515;&#24230;&#37327;&#23384;&#22312;&#25910;&#20837;&#12289;&#24180;&#40836;&#12289;&#24037;&#20316;&#31283;&#23450;&#24615;&#21644;&#36807;&#21435;&#23601;&#19994;&#29366;&#24577;&#30340;&#24322;&#36136;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Rational respondents to economic surveys may report as a point forecast any measure of the central tendency of their (possibly latent) predictive distribution, for example the mean, median, mode, or any convex combination thereof. We propose tests of forecast rationality when the measure of central tendency used by the respondent is unknown. We overcome an identification problem that arises when the measures of central tendency are equal or in a local neighborhood of each other, as is the case for (exactly or nearly) symmetric distributions. As a building block, we also present novel tests for the rationality of mode forecasts. We apply our tests to income forecasts from the Federal Reserve Bank of New York's Survey of Consumer Expectations. We find these forecasts are rationalizable as mode forecasts, but not as mean or median forecasts. We also find heterogeneity in the measure of centrality used by respondents when stratifying the sample by past income, age, job stability, and past 
&lt;/p&gt;</description></item></channel></rss>