<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#36890;&#36807;&#23545;37&#31687;&#20351;&#29992;&#35266;&#23519;&#38754;&#26495;&#25968;&#25454;&#30340;&#25991;&#31456;&#36827;&#34892;&#22797;&#21046;&#21644;&#37325;&#26032;&#20998;&#26512;&#65292;&#25105;&#20204;&#21457;&#29616;&#21452;&#21521;&#22266;&#23450;&#25928;&#24212;&#27169;&#22411;&#30340;&#26680;&#24515;&#32467;&#35770;&#22312;&#26032;&#30340;&#24322;&#36136;&#27835;&#30103;&#25928;&#24212;&#40065;&#26834;&#20272;&#35745;&#22120;&#19979;&#22522;&#26412;&#20445;&#25345;&#19981;&#21464;&#65292;&#20294;&#24179;&#34892;&#36235;&#21183;&#20551;&#35774;&#36829;&#21453;&#21644;&#32479;&#35745;&#21147;&#37327;&#19981;&#36275;&#20173;&#28982;&#26159;&#21487;&#20449;&#25512;&#35770;&#30340;&#37325;&#35201;&#38556;&#30861;&#12290;</title><link>http://arxiv.org/abs/2309.15983</link><description>&lt;p&gt;
&#22914;&#20309;&#22312;&#24179;&#34892;&#36235;&#21183;&#19979;&#36827;&#34892;&#22240;&#26524;&#38754;&#26495;&#20998;&#26512;&#65306;&#19968;&#39033;&#22823;&#35268;&#27169;&#20877;&#20998;&#26512;&#30740;&#31350;&#30340;&#25945;&#35757;
&lt;/p&gt;
&lt;p&gt;
What To Do (and Not to Do) with Causal Panel Analysis under Parallel Trends: Lessons from A Large Reanalysis Study. (arXiv:2309.15983v1 [stat.ME])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.15983
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#23545;37&#31687;&#20351;&#29992;&#35266;&#23519;&#38754;&#26495;&#25968;&#25454;&#30340;&#25991;&#31456;&#36827;&#34892;&#22797;&#21046;&#21644;&#37325;&#26032;&#20998;&#26512;&#65292;&#25105;&#20204;&#21457;&#29616;&#21452;&#21521;&#22266;&#23450;&#25928;&#24212;&#27169;&#22411;&#30340;&#26680;&#24515;&#32467;&#35770;&#22312;&#26032;&#30340;&#24322;&#36136;&#27835;&#30103;&#25928;&#24212;&#40065;&#26834;&#20272;&#35745;&#22120;&#19979;&#22522;&#26412;&#20445;&#25345;&#19981;&#21464;&#65292;&#20294;&#24179;&#34892;&#36235;&#21183;&#20551;&#35774;&#36829;&#21453;&#21644;&#32479;&#35745;&#21147;&#37327;&#19981;&#36275;&#20173;&#28982;&#26159;&#21487;&#20449;&#25512;&#35770;&#30340;&#37325;&#35201;&#38556;&#30861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21452;&#21521;&#22266;&#23450;&#25928;&#24212;&#27169;&#22411;&#22312;&#25919;&#27835;&#31185;&#23398;&#20013;&#30340;&#22240;&#26524;&#38754;&#26495;&#20998;&#26512;&#20013;&#26222;&#36941;&#24212;&#29992;&#12290;&#28982;&#32780;&#65292;&#26368;&#36817;&#30340;&#26041;&#27861;&#35770;&#35752;&#35770;&#25361;&#25112;&#20102;&#20854;&#22312;&#23384;&#22312;&#24322;&#36136;&#27835;&#30103;&#25928;&#24212;&#21644;&#24179;&#34892;&#36235;&#21183;&#20551;&#35774;&#36829;&#21453;&#24773;&#20917;&#19979;&#30340;&#26377;&#25928;&#24615;&#12290;&#36825;&#19968;&#26032;&#20852;&#30340;&#25991;&#29486;&#24341;&#20837;&#20102;&#22810;&#20010;&#20272;&#35745;&#22120;&#21644;&#35786;&#26029;&#26041;&#27861;&#65292;&#23548;&#33268;&#23454;&#35777;&#30740;&#31350;&#20154;&#21592;&#22312;&#20004;&#20010;&#26041;&#38754;&#20135;&#29983;&#20102;&#22256;&#24785;&#65306;&#22522;&#20110;&#21452;&#21521;&#22266;&#23450;&#25928;&#24212;&#27169;&#22411;&#30340;&#29616;&#26377;&#32467;&#26524;&#30340;&#21487;&#38752;&#24615;&#21644;&#30446;&#21069;&#30340;&#26368;&#20339;&#23454;&#36341;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20123;&#38382;&#39064;&#65292;&#25105;&#20204;&#32771;&#23519;&#12289;&#22797;&#21046;&#21644;&#37325;&#26032;&#20998;&#26512;&#20102;&#19977;&#20010;&#39046;&#20808;&#25919;&#27835;&#31185;&#23398;&#26399;&#21002;&#19978;&#20849;37&#31687;&#36816;&#29992;&#35266;&#23519;&#38754;&#26495;&#25968;&#25454;&#21644;&#20108;&#20803;&#27835;&#30103;&#30340;&#25991;&#31456;&#12290;&#20351;&#29992;&#20845;&#31181;&#26032;&#24341;&#20837;&#30340;&#24322;&#36136;&#27835;&#30103;&#25928;&#24212;&#40065;&#26834;&#20272;&#35745;&#22120;&#65292;&#25105;&#20204;&#21457;&#29616;&#23613;&#31649;&#31934;&#30830;&#24615;&#21487;&#33021;&#21463;&#21040;&#24433;&#21709;&#65292;&#20294;&#22522;&#20110;&#21452;&#21521;&#22266;&#23450;&#25928;&#24212;&#20272;&#35745;&#30340;&#26680;&#24515;&#32467;&#35770;&#22312;&#24456;&#22823;&#31243;&#24230;&#19978;&#20445;&#25345;&#19981;&#21464;&#12290;&#28982;&#32780;&#65292;&#24179;&#34892;&#36235;&#21183;&#20551;&#35774;&#30340;&#36829;&#21453;&#21644;&#32479;&#35745;&#21147;&#37327;&#19981;&#36275;&#20173;&#28982;&#26159;&#21487;&#20449;&#25512;&#35770;&#30340;&#37325;&#35201;&#38556;&#30861;&#12290;
&lt;/p&gt;
&lt;p&gt;
Two-way fixed effects (TWFE) models are ubiquitous in causal panel analysis in political science. However, recent methodological discussions challenge their validity in the presence of heterogeneous treatment effects (HTE) and violations of the parallel trends assumption (PTA). This burgeoning literature has introduced multiple estimators and diagnostics, leading to confusion among empirical researchers on two fronts: the reliability of existing results based on TWFE models and the current best practices. To address these concerns, we examined, replicated, and reanalyzed 37 articles from three leading political science journals that employed observational panel data with binary treatments. Using six newly introduced HTE-robust estimators, we find that although precision may be affected, the core conclusions derived from TWFE estimates largely remain unchanged. PTA violations and insufficient statistical power, however, continue to be significant obstacles to credible inferences. Based 
&lt;/p&gt;</description></item></channel></rss>