<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#28608;&#21169;&#20860;&#23481;&#19988;&#20010;&#20307;&#29702;&#24615;&#30340;vertiport&#39044;&#35746;&#26426;&#21046;&#65292;&#26088;&#22312;&#21327;&#35843;&#22810;&#20010;&#36816;&#33829;&#21830;&#25805;&#20316;&#30340;&#30005;&#21160;&#22402;&#30452;&#36215;&#38477;&#65288;eVTOL&#65289;&#39134;&#34892;&#22120;&#22312;vertiports&#20043;&#38388;&#31227;&#21160;&#65292;&#26368;&#22823;&#21270;&#25152;&#26377;&#36816;&#33829;&#21830;&#30340;&#24635;&#20272;&#20540;&#21516;&#26102;&#26368;&#23567;&#21270;vertiports&#30340;&#25317;&#22581;&#12290;</title><link>https://arxiv.org/abs/2403.18166</link><description>&lt;p&gt;
&#20855;&#26377;&#28608;&#21169;&#20860;&#23481;&#24615;&#30340;&#20808;&#36827;&#31354;&#20013;&#31227;&#21160;&#20013;&#30340;Vertiport&#39044;&#35746;&#65306;&#22522;&#20110;&#25293;&#21334;&#30340;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Incentive-Compatible Vertiport Reservation in Advanced Air Mobility: An Auction-Based Approach
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.18166
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#28608;&#21169;&#20860;&#23481;&#19988;&#20010;&#20307;&#29702;&#24615;&#30340;vertiport&#39044;&#35746;&#26426;&#21046;&#65292;&#26088;&#22312;&#21327;&#35843;&#22810;&#20010;&#36816;&#33829;&#21830;&#25805;&#20316;&#30340;&#30005;&#21160;&#22402;&#30452;&#36215;&#38477;&#65288;eVTOL&#65289;&#39134;&#34892;&#22120;&#22312;vertiports&#20043;&#38388;&#31227;&#21160;&#65292;&#26368;&#22823;&#21270;&#25152;&#26377;&#36816;&#33829;&#21830;&#30340;&#24635;&#20272;&#20540;&#21516;&#26102;&#26368;&#23567;&#21270;vertiports&#30340;&#25317;&#22581;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#39044;&#35745;&#26410;&#26469;&#20808;&#36827;&#31354;&#20013;&#31227;&#21160;&#65288;AAM&#65289;&#30340;&#23835;&#36215;&#23558;&#25104;&#20026;&#19968;&#20010;&#25968;&#21313;&#20159;&#32654;&#20803;&#30340;&#20135;&#19994;&#12290;&#24066;&#22330;&#26426;&#21046;&#34987;&#35748;&#20026;&#26159;AAM&#36816;&#33829;&#30340;&#19968;&#20010;&#37325;&#35201;&#32452;&#25104;&#37096;&#20998;&#65292;&#20854;&#20013;&#21253;&#25324;&#20855;&#26377;&#31169;&#20154;&#20272;&#20540;&#30340;&#24322;&#26500;&#36816;&#33829;&#21830;&#12290;&#26412;&#25991;&#30740;&#31350;&#20102;&#35774;&#35745;&#19968;&#31181;&#26426;&#21046;&#26469;&#21327;&#35843;&#30001;&#22810;&#20010;&#20855;&#26377;&#19982;&#20854;&#26426;&#32676;&#20851;&#32852;&#30340;&#24322;&#26500;&#20272;&#20540;&#30340;&#36816;&#33829;&#21830;&#25805;&#20316;&#30340;&#30005;&#21160;&#22402;&#30452;&#36215;&#38477;&#65288;eVTOL&#65289;&#39134;&#34892;&#22120;&#22312;vertiports&#20043;&#38388;&#31227;&#21160;&#30340;&#38382;&#39064;&#65292;&#21516;&#26102;&#24378;&#21046;&#25191;&#34892;vertiports&#30340;&#21040;&#36798;&#12289;&#31163;&#24320;&#21644;&#20572;&#36710;&#32422;&#26463;&#12290;&#29305;&#21035;&#26159;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#28608;&#21169;&#20860;&#23481;&#19988;&#20010;&#20307;&#29702;&#24615;&#30340;vertiport&#39044;&#35746;&#26426;&#21046;&#65292;&#35813;&#26426;&#21046;&#26368;&#22823;&#21270;&#20102;&#19968;&#20010;&#31038;&#20250;&#31119;&#21033;&#24230;&#37327;&#26631;&#20934;&#65292;&#20174;&#32780;&#21253;&#25324;&#26368;&#22823;&#21270;&#25152;&#26377;&#36816;&#33829;&#21830;&#30340;&#24635;&#20272;&#20540;&#21516;&#26102;&#26368;&#23567;&#21270;vertiports&#30340;&#25317;&#22581;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#25552;&#39640;&#20102;&#35774;&#35745;&#36825;&#19968;&#26426;&#21046;&#30340;&#35745;&#31639;&#21487;&#22788;&#29702;&#24615;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.18166v1 Announce Type: cross  Abstract: The rise of advanced air mobility (AAM) is expected to become a multibillion-dollar industry in the near future. Market-based mechanisms are touted to be an integral part of AAM operations, which comprise heterogeneous operators with private valuations. In this work, we study the problem of designing a mechanism to coordinate the movement of electric vertical take-off and landing (eVTOL) aircraft, operated by multiple operators each having heterogeneous valuations associated with their fleet, between vertiports, while enforcing the arrival, departure, and parking constraints at vertiports. Particularly, we propose an incentive-compatible and individually rational vertiport reservation mechanism that maximizes a social welfare metric, which encapsulates the objective of maximizing the overall valuations of all operators while minimizing the congestion at vertiports. Additionally, we improve the computational tractability of designing th
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#21160;&#24577;&#26426;&#21046;&#65292;&#36890;&#36807;&#26356;&#26032;&#26368;&#22823;&#21487;&#25552;&#21462;&#20215;&#20540;&#65288;MEV&#65289;&#25552;&#21462;&#29575;&#65292;&#20197;&#22312;&#30719;&#24037;&#21644;&#29992;&#25143;&#20043;&#38388;&#32500;&#25345;&#20581;&#24247;&#24179;&#34913;&#12290;</title><link>https://arxiv.org/abs/2402.15849</link><description>&lt;p&gt;
&#20851;&#20110;&#26368;&#22823;&#21487;&#25552;&#21462;&#20215;&#20540;&#20877;&#20998;&#37197;&#30340;&#21160;&#24577;&#26426;&#21046;
&lt;/p&gt;
&lt;p&gt;
On the Redistribution of Maximal Extractable Value: A Dynamic Mechanism
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.15849
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#21160;&#24577;&#26426;&#21046;&#65292;&#36890;&#36807;&#26356;&#26032;&#26368;&#22823;&#21487;&#25552;&#21462;&#20215;&#20540;&#65288;MEV&#65289;&#25552;&#21462;&#29575;&#65292;&#20197;&#22312;&#30719;&#24037;&#21644;&#29992;&#25143;&#20043;&#38388;&#32500;&#25345;&#20581;&#24247;&#24179;&#34913;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26368;&#22823;&#21487;&#25552;&#21462;&#20215;&#20540;&#65288;MEV&#65289;&#24050;&#32463;&#25104;&#20026;&#21306;&#22359;&#38142;&#31995;&#32479;&#35774;&#35745;&#39046;&#22495;&#30340;&#19968;&#20010;&#26032;&#21069;&#27839;&#12290;&#21435;&#20013;&#24515;&#21270;&#21644;&#37329;&#34701;&#30340;&#32467;&#21512;&#36171;&#20104;&#20102;&#21306;&#22359;&#29983;&#20135;&#32773;&#65288;&#21363;&#30719;&#24037;&#65289;&#19981;&#20165;&#36873;&#25321;&#21644;&#28155;&#21152;&#20132;&#26131;&#21040;&#21306;&#22359;&#38142;&#30340;&#26435;&#21147;&#65292;&#26356;&#37325;&#35201;&#30340;&#26159;&#65292;&#36824;&#21487;&#20197;&#23545;&#20854;&#36827;&#34892;&#25490;&#24207;&#65292;&#20197;&#23613;&#21487;&#33021;&#22810;&#22320;&#20174;&#20013;&#33719;&#21033;&#12290;&#34429;&#28982;&#36825;&#31181;&#20215;&#26684;&#23545;&#20110;&#21306;&#22359;&#29983;&#20135;&#32773;&#25552;&#20379;&#30340;&#26381;&#21153;&#26469;&#35828;&#21487;&#33021;&#26159;&#19981;&#21487;&#36991;&#20813;&#30340;&#65292;&#20294;&#38142;&#19978;&#29992;&#25143;&#20174;&#38271;&#36828;&#26469;&#30475;&#21487;&#33021;&#26356;&#24895;&#24847;&#20351;&#29992;&#19981;&#37027;&#20040;&#25504;&#22842;&#24615;&#30340;&#31995;&#32479;&#12290;&#26412;&#25991;&#25552;&#20986;&#23558;MEV&#25552;&#21462;&#29575;&#32435;&#20837;&#21327;&#35758;&#35774;&#35745;&#31354;&#38388;&#20013;&#12290;&#25105;&#20204;&#30340;&#30446;&#26631;&#26159;&#21033;&#29992;&#27492;&#21442;&#25968;&#26469;&#32500;&#25345;&#30719;&#24037;&#65288;&#38656;&#35201;&#24471;&#21040;&#34917;&#20607;&#65289;&#21644;&#29992;&#25143;&#65288;&#38656;&#35201;&#24863;&#21040;&#34987;&#40723;&#21169;&#36827;&#34892;&#20132;&#26131;&#65289;&#20043;&#38388;&#30340;&#20581;&#24247;&#24179;&#34913;&#12290;&#21463;EIP-1559&#24341;&#20837;&#30340;&#20132;&#26131;&#36153;&#21407;&#21017;&#30340;&#21551;&#21457;&#65292;&#25105;&#20204;&#35774;&#35745;&#20102;&#19968;&#20010;&#21160;&#24577;&#26426;&#21046;&#65292;&#26088;&#22312;&#36890;&#36807;&#26356;&#26032;MEV&#25552;&#21462;&#29575;&#26469;&#36798;&#21040;&#31283;&#23450;&#30446;&#26631;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.15849v1 Announce Type: cross  Abstract: Maximal Extractable Value (MEV) has emerged as a new frontier in the design of blockchain systems. The marriage between decentralization and finance gives the power to block producers (a.k.a., miners) not only to select and add transactions to the blockchain but, crucially, also to order them so as to extract as much financial gain as possible for themselves. Whilst this price may be unavoidable for the service provided by block producers, users of the chain may in the long run prefer to use less predatory systems. In this paper, we propose to make the MEV extraction rate part of the protocol design space. Our aim is to leverage this parameter to maintain a healthy balance between miners (who need to be compensated) and users (who need to feel encouraged to transact). Inspired by the principles introduced by EIP-1559 for transaction fees, we design a dynamic mechanism which updates the MEV extraction rate with the goal of stabilizing i
&lt;/p&gt;</description></item><item><title>&#20171;&#32461;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#21151;&#33021;&#24615;&#31354;&#38388;&#33258;&#22238;&#24402;&#27169;&#22411;&#65292;&#25552;&#20986;&#20102;&#30830;&#20445;&#25968;&#25454;&#23454;&#29616;&#21807;&#19968;&#24615;&#30340;&#26465;&#20214;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#20110;&#21151;&#33021;&#21442;&#25968;&#30340;&#27491;&#21017;&#21270;&#20004;&#38454;&#27573;&#26368;&#23567;&#20108;&#20056;&#20272;&#35745;&#22120;&#65292;&#20197;&#35299;&#20915;&#20869;&#29983;&#24615;&#38382;&#39064;&#65292;&#21516;&#26102;&#36824;&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#20110;&#26816;&#27979;&#31354;&#38388;&#25928;&#24212;&#30340;&#31616;&#21333;Wald&#31867;&#22411;&#26816;&#39564;</title><link>https://arxiv.org/abs/2402.14763</link><description>&lt;p&gt;
&#21151;&#33021;&#24615;&#31354;&#38388;&#33258;&#22238;&#24402;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
Functional Spatial Autoregressive Models
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.14763
&lt;/p&gt;
&lt;p&gt;
&#20171;&#32461;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#21151;&#33021;&#24615;&#31354;&#38388;&#33258;&#22238;&#24402;&#27169;&#22411;&#65292;&#25552;&#20986;&#20102;&#30830;&#20445;&#25968;&#25454;&#23454;&#29616;&#21807;&#19968;&#24615;&#30340;&#26465;&#20214;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#20110;&#21151;&#33021;&#21442;&#25968;&#30340;&#27491;&#21017;&#21270;&#20004;&#38454;&#27573;&#26368;&#23567;&#20108;&#20056;&#20272;&#35745;&#22120;&#65292;&#20197;&#35299;&#20915;&#20869;&#29983;&#24615;&#38382;&#39064;&#65292;&#21516;&#26102;&#36824;&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#20110;&#26816;&#27979;&#31354;&#38388;&#25928;&#24212;&#30340;&#31616;&#21333;Wald&#31867;&#22411;&#26816;&#39564;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#30740;&#31350;&#20171;&#32461;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#31354;&#38388;&#33258;&#22238;&#24402;&#27169;&#22411;&#65292;&#20854;&#20013;&#22240;&#21464;&#37327;&#26159;&#21487;&#33021;&#26174;&#31034;&#19982;&#38468;&#36817;&#21333;&#20301;&#30340;&#32467;&#26524;&#20989;&#25968;&#23384;&#22312;&#21151;&#33021;&#33258;&#30456;&#20851;&#24615;&#30340;&#20989;&#25968;&#12290;&#36825;&#31181;&#27169;&#22411;&#21487;&#20197;&#34987;&#25551;&#36848;&#20026;&#19968;&#20010;&#21516;&#26102;&#30340;&#31215;&#20998;&#26041;&#31243;&#31995;&#32479;&#65292;&#36890;&#24120;&#24773;&#20917;&#19979;&#24182;&#27809;&#26377;&#21807;&#19968;&#35299;&#12290;&#38024;&#23545;&#36825;&#20010;&#38382;&#39064;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#31616;&#21333;&#30340;&#31354;&#38388;&#20132;&#20114;&#20316;&#29992;&#37327;&#22823;&#23567;&#30340;&#26465;&#20214;&#65292;&#20197;&#30830;&#20445;&#25968;&#25454;&#23454;&#29616;&#30340;&#21807;&#19968;&#24615;&#12290;&#20026;&#20102;&#20272;&#35745;&#65292;&#20026;&#20102;&#32771;&#34385;&#30001;&#31354;&#38388;&#30456;&#20114;&#20316;&#29992;&#24341;&#36215;&#30340;&#20869;&#29983;&#24615;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#22522;&#20110;&#22522;&#20989;&#25968;&#36924;&#36817;&#30340;&#27491;&#21017;&#21270;&#20004;&#38454;&#27573;&#26368;&#23567;&#20108;&#20056;&#20272;&#35745;&#37327;&#12290;&#20272;&#35745;&#37327;&#30340;&#28176;&#36817;&#24615;&#36136;&#65292;&#21253;&#25324;&#19968;&#33268;&#24615;&#21644;&#28176;&#36817;&#27491;&#24577;&#24615;&#65292;&#22312;&#19968;&#23450;&#26465;&#20214;&#19979;&#36827;&#34892;&#20102;&#30740;&#31350;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#31616;&#21333;&#30340;Wald&#31867;&#22411;&#26816;&#39564;&#65292;&#29992;&#20110;&#26816;&#27979;&#31354;&#38388;&#25928;&#24212;&#30340;&#23384;&#22312;&#12290;&#20316;&#20026;&#23454;&#35777;&#31034;&#20363;&#65292;&#25105;&#20204;&#24212;&#29992;&#20102;prop&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.14763v1 Announce Type: new  Abstract: This study introduces a novel spatial autoregressive model in which the dependent variable is a function that may exhibit functional autocorrelation with the outcome functions of nearby units. This model can be characterized as a simultaneous integral equation system, which, in general, does not necessarily have a unique solution. For this issue, we provide a simple condition on the magnitude of the spatial interaction to ensure the uniqueness in data realization. For estimation, to account for the endogeneity caused by the spatial interaction, we propose a regularized two-stage least squares estimator based on a basis approximation for the functional parameter. The asymptotic properties of the estimator including the consistency and asymptotic normality are investigated under certain conditions. Additionally, we propose a simple Wald-type test for detecting the presence of spatial effects. As an empirical illustration, we apply the prop
&lt;/p&gt;</description></item><item><title>&#20351;&#29992;&#19981;&#23547;&#24120;&#30340;&#25968;&#25454;&#38598;&#32452;&#21512;&#21487;&#20197;&#26174;&#33879;&#36129;&#29486;&#20110;&#31185;&#23398;&#21644;&#26356;&#24191;&#27867;&#30340;&#24433;&#21709;&#65292;&#24182;&#20419;&#36827;&#31185;&#23398;&#30340;&#36827;&#27493;&#12290;</title><link>https://arxiv.org/abs/2402.05024</link><description>&lt;p&gt;
&#20351;&#29992;&#19981;&#23547;&#24120;&#30340;&#25968;&#25454;&#38598;&#32452;&#21512;&#26159;&#21542;&#26377;&#21161;&#20110;&#26356;&#22823;&#30340;&#31185;&#23398;&#24433;&#21709;&#21147;&#65311;
&lt;/p&gt;
&lt;p&gt;
Does the Use of Unusual Combinations of Datasets Contribute to Greater Scientific Impact?
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.05024
&lt;/p&gt;
&lt;p&gt;
&#20351;&#29992;&#19981;&#23547;&#24120;&#30340;&#25968;&#25454;&#38598;&#32452;&#21512;&#21487;&#20197;&#26174;&#33879;&#36129;&#29486;&#20110;&#31185;&#23398;&#21644;&#26356;&#24191;&#27867;&#30340;&#24433;&#21709;&#65292;&#24182;&#20419;&#36827;&#31185;&#23398;&#30340;&#36827;&#27493;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#31185;&#23398;&#25968;&#25454;&#38598;&#22312;&#24403;&#20195;&#25968;&#25454;&#39537;&#21160;&#30740;&#31350;&#20013;&#36215;&#30528;&#33267;&#20851;&#37325;&#35201;&#30340;&#20316;&#29992;&#65292;&#23427;&#20204;&#36890;&#36807;&#20419;&#36827;&#26032;&#27169;&#24335;&#21644;&#29616;&#35937;&#30340;&#21457;&#29616;&#65292;&#25512;&#21160;&#31185;&#23398;&#30340;&#36827;&#27493;&#12290;&#36825;&#31181;&#23545;&#23454;&#35777;&#30740;&#31350;&#30340;&#19981;&#26029;&#38656;&#27714;&#24341;&#21457;&#20102;&#20851;&#20110;&#22914;&#20309;&#22312;&#30740;&#31350;&#39033;&#30446;&#20013;&#25112;&#30053;&#24615;&#22320;&#21033;&#29992;&#25968;&#25454;&#20197;&#20419;&#36827;&#31185;&#23398;&#36827;&#27493;&#30340;&#37325;&#35201;&#38382;&#39064;&#12290;&#26412;&#30740;&#31350;&#22522;&#20110;&#37325;&#32452;&#29702;&#35770;&#25552;&#20986;&#20102;&#19968;&#20010;&#20551;&#35774;&#65292;&#21363;&#21019;&#26032;&#24615;&#22320;&#32452;&#21512;&#29616;&#26377;&#30693;&#35782;&#65292;&#21253;&#25324;&#20351;&#29992;&#19981;&#23547;&#24120;&#30340;&#25968;&#25454;&#38598;&#32452;&#21512;&#65292;&#21487;&#20197;&#23548;&#33268;&#39640;&#24433;&#21709;&#30340;&#21457;&#29616;&#12290;&#25105;&#20204;&#35843;&#26597;&#20102;&#36229;&#36807;30,000&#31687;&#25991;&#31456;&#20013;&#20351;&#29992;&#20102;&#36229;&#36807;6,000&#20010;&#25968;&#25454;&#38598;&#30340;&#31038;&#20250;&#31185;&#23398;&#25968;&#25454;&#24211;ICPSR&#20013;&#36825;&#31181;&#38750;&#20856;&#22411;&#25968;&#25454;&#32452;&#21512;&#30340;&#31185;&#23398;&#25104;&#26524;&#12290;&#26412;&#30740;&#31350;&#25552;&#20379;&#20102;&#22235;&#20010;&#37325;&#35201;&#30340;&#35265;&#35299;&#12290;&#39318;&#20808;&#65292;&#32452;&#21512;&#25968;&#25454;&#38598;&#65292;&#29305;&#21035;&#26159;&#37027;&#20123;&#19981;&#24120;&#35265;&#30340;&#32452;&#21512;&#65292;&#23545;&#31185;&#23398;&#21644;&#26356;&#24191;&#27867;&#30340;&#24433;&#21709;&#65288;&#20363;&#22914;&#21521;&#19968;&#33324;&#20844;&#20247;&#20256;&#25773;&#65289;&#37117;&#26377;&#26174;&#33879;&#36129;&#29486;&#12290;
&lt;/p&gt;
&lt;p&gt;
Scientific datasets play a crucial role in contemporary data-driven research, as they allow for the progress of science by facilitating the discovery of new patterns and phenomena. This mounting demand for empirical research raises important questions on how strategic data utilization in research projects can stimulate scientific advancement. In this study, we examine the hypothesis inspired by the recombination theory, which suggests that innovative combinations of existing knowledge, including the use of unusual combinations of datasets, can lead to high-impact discoveries. We investigate the scientific outcomes of such atypical data combinations in more than 30,000 publications that leverage over 6,000 datasets curated within one of the largest social science databases, ICPSR. This study offers four important insights. First, combining datasets, particularly those infrequently paired, significantly contributes to both scientific and broader impacts (e.g., dissemination to the genera
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#24320;&#21457;&#20102;&#19968;&#20010;&#32771;&#34385;&#30456;&#20851;&#24615;&#30340;&#20998;&#26512;&#24066;&#22330;&#65292;&#36890;&#36807;&#37319;&#29992;Shapley&#20540;&#30340;&#24402;&#22240;&#31574;&#30053;&#26469;&#20998;&#37197;&#25910;&#20837;&#65292;&#20419;&#36827;&#20102;&#25968;&#25454;&#20849;&#20139;&#20197;&#25552;&#39640;&#33021;&#28304;&#39044;&#27979;&#30340;&#20934;&#30830;&#24615;&#12290;</title><link>http://arxiv.org/abs/2310.06000</link><description>&lt;p&gt;
&#40723;&#21169;&#25968;&#25454;&#20849;&#20139;&#20197;&#36827;&#34892;&#33021;&#28304;&#39044;&#27979;&#65306;&#20855;&#26377;&#30456;&#20851;&#25968;&#25454;&#30340;&#20998;&#26512;&#24066;&#22330;
&lt;/p&gt;
&lt;p&gt;
Incentivizing Data Sharing for Energy Forecasting: Analytics Markets with Correlated Data. (arXiv:2310.06000v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.06000
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#24320;&#21457;&#20102;&#19968;&#20010;&#32771;&#34385;&#30456;&#20851;&#24615;&#30340;&#20998;&#26512;&#24066;&#22330;&#65292;&#36890;&#36807;&#37319;&#29992;Shapley&#20540;&#30340;&#24402;&#22240;&#31574;&#30053;&#26469;&#20998;&#37197;&#25910;&#20837;&#65292;&#20419;&#36827;&#20102;&#25968;&#25454;&#20849;&#20139;&#20197;&#25552;&#39640;&#33021;&#28304;&#39044;&#27979;&#30340;&#20934;&#30830;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20934;&#30830;&#22320;&#39044;&#27979;&#19981;&#30830;&#23450;&#30340;&#30005;&#21147;&#20135;&#37327;&#23545;&#20110;&#30005;&#21147;&#24066;&#22330;&#30340;&#31038;&#20250;&#31119;&#21033;&#20855;&#26377;&#30410;&#22788;&#65292;&#21487;&#20197;&#20943;&#23569;&#24179;&#34913;&#36164;&#28304;&#30340;&#38656;&#27714;&#12290;&#23558;&#36825;&#31181;&#39044;&#27979;&#25551;&#36848;&#20026;&#19968;&#39033;&#20998;&#26512;&#20219;&#21153;&#65292;&#24403;&#21069;&#25991;&#29486;&#25552;&#20986;&#20102;&#20197;&#20998;&#26512;&#24066;&#22330;&#20316;&#20026;&#28608;&#21169;&#25163;&#27573;&#26469;&#25913;&#21892;&#31934;&#24230;&#30340;&#25968;&#25454;&#20849;&#20139;&#26041;&#27861;&#65292;&#20363;&#22914;&#21033;&#29992;&#26102;&#31354;&#30456;&#20851;&#24615;&#12290;&#25361;&#25112;&#22312;&#20110;&#65292;&#24403;&#30456;&#20851;&#25968;&#25454;&#29992;&#20316;&#39044;&#27979;&#30340;&#36755;&#20837;&#29305;&#24449;&#26102;&#65292;&#37325;&#21472;&#20449;&#24687;&#30340;&#20215;&#20540;&#22312;&#20110;&#25910;&#20837;&#20998;&#37197;&#26041;&#38754;&#20351;&#24066;&#22330;&#35774;&#35745;&#22797;&#26434;&#21270;&#65292;&#22240;&#20026;&#36825;&#31181;&#20215;&#20540;&#22312;&#26412;&#36136;&#19978;&#26159;&#32452;&#21512;&#30340;&#12290;&#25105;&#20204;&#20026;&#39118;&#21147;&#39044;&#27979;&#24212;&#29992;&#24320;&#21457;&#20102;&#19968;&#20010;&#32771;&#34385;&#30456;&#20851;&#24615;&#30340;&#20998;&#26512;&#24066;&#22330;&#12290;&#20026;&#20102;&#20998;&#37197;&#25910;&#20837;&#65292;&#25105;&#20204;&#37319;&#29992;&#20102;&#22522;&#20110;Shapley&#20540;&#30340;&#24402;&#22240;&#31574;&#30053;&#65292;&#23558;&#20195;&#29702;&#20154;&#30340;&#29305;&#24449;&#35270;&#20026;&#29609;&#23478;&#65292;&#23558;&#20182;&#20204;&#30340;&#30456;&#20114;&#20316;&#29992;&#35270;&#20026;&#19968;&#20010;&#29305;&#24449;&#20989;&#25968;&#21338;&#24328;&#12290;&#25105;&#20204;&#35828;&#26126;&#20102;&#25551;&#36848;&#36825;&#31181;&#21338;&#24328;&#30340;&#22810;&#31181;&#36873;&#39033;&#65292;&#27599;&#20010;&#36873;&#39033;&#37117;&#26377;&#22240;&#26524;&#32454;&#24494;&#24046;&#21035;&#65292;&#24433;&#21709;&#30528;&#29305;&#24449;&#30456;&#20851;&#26102;&#30340;&#24066;&#22330;&#34892;&#20026;&#12290;
&lt;/p&gt;
&lt;p&gt;
Reliably forecasting uncertain power production is beneficial for the social welfare of electricity markets by reducing the need for balancing resources. Describing such forecasting as an analytics task, the current literature proposes analytics markets as an incentive for data sharing to improve accuracy, for instance by leveraging spatio-temporal correlations. The challenge is that, when used as input features for forecasting, correlated data complicates the market design with respect to the revenue allocation, as the value of overlapping information is inherently combinatorial. We develop a correlation-aware analytics market for a wind power forecasting application. To allocate revenue, we adopt a Shapley value-based attribution policy, framing the features of agents as players and their interactions as a characteristic function game. We illustrate that there are multiple options to describe such a game, each having causal nuances that influence market behavior when features are cor
&lt;/p&gt;</description></item><item><title>&#31227;&#27665;&#22312;&#19968;&#20010;&#37197;&#32473;&#32844;&#20301;&#30340;&#21305;&#37197;&#27169;&#22411;&#20013;&#21487;&#33021;&#38477;&#20302;&#26412;&#22320;&#24037;&#20154;&#30340;&#23601;&#19994;&#29575;&#65292;&#20294;&#31227;&#27665;&#23545;&#26412;&#22320;&#31119;&#21033;&#30340;&#24635;&#20307;&#24433;&#21709;&#21462;&#20915;&#20110;&#21171;&#21160;&#21147;&#24066;&#22330;&#30340;&#29366;&#24577;&#65292;&#24403;&#21171;&#21160;&#21147;&#24066;&#22330;&#32321;&#33635;&#26102;&#65292;&#31227;&#27665;&#30340;&#24433;&#21709;&#21487;&#33021;&#26159;&#27491;&#38754;&#30340;&#12290;</title><link>http://arxiv.org/abs/2303.13319</link><description>&lt;p&gt;
&#20026;&#20160;&#20040;&#31227;&#27665;&#24635;&#34987;&#25351;&#36131;&#31363;&#21462;&#20154;&#20204;&#30340;&#24037;&#20316;?
&lt;/p&gt;
&lt;p&gt;
Why Are Immigrants Always Accused of Stealing People's Jobs?. (arXiv:2303.13319v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.13319
&lt;/p&gt;
&lt;p&gt;
&#31227;&#27665;&#22312;&#19968;&#20010;&#37197;&#32473;&#32844;&#20301;&#30340;&#21305;&#37197;&#27169;&#22411;&#20013;&#21487;&#33021;&#38477;&#20302;&#26412;&#22320;&#24037;&#20154;&#30340;&#23601;&#19994;&#29575;&#65292;&#20294;&#31227;&#27665;&#23545;&#26412;&#22320;&#31119;&#21033;&#30340;&#24635;&#20307;&#24433;&#21709;&#21462;&#20915;&#20110;&#21171;&#21160;&#21147;&#24066;&#22330;&#30340;&#29366;&#24577;&#65292;&#24403;&#21171;&#21160;&#21147;&#24066;&#22330;&#32321;&#33635;&#26102;&#65292;&#31227;&#27665;&#30340;&#24433;&#21709;&#21487;&#33021;&#26159;&#27491;&#38754;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#31227;&#27665;&#24635;&#26159;&#34987;&#25351;&#36131;&#31363;&#21462;&#20154;&#20204;&#30340;&#24037;&#20316;&#12290;&#28982;&#32780;&#65292;&#22312;&#21171;&#21160;&#21147;&#24066;&#22330;&#30340;&#26032;&#21476;&#20856;&#27169;&#22411;&#20013;&#65292;&#27599;&#20010;&#20154;&#37117;&#26377;&#24037;&#20316;&#21487;&#20570;&#65292;&#20063;&#27809;&#26377;&#24037;&#20316;&#21487;&#34987;&#31363;&#21462;&#65288;&#27809;&#26377;&#22833;&#19994;&#65292;&#22240;&#27492;&#24819;&#24037;&#20316;&#30340;&#20154;&#37117;&#21487;&#20197;&#24037;&#20316;&#65289;&#12290;&#22312;&#26631;&#20934;&#21305;&#37197;&#27169;&#22411;&#20013;&#65292;&#23384;&#22312;&#19968;&#20123;&#22833;&#19994;&#65292;&#20294;&#30001;&#20110;&#21171;&#21160;&#21147;&#38656;&#27714;&#23436;&#20840;&#24377;&#24615;&#65292;&#22240;&#27492;&#26032;&#36827;&#20837;&#21171;&#21160;&#21147;&#24066;&#22330;&#30340;&#20154;&#34987;&#21560;&#25910;&#26102;&#19981;&#20250;&#24433;&#21709;&#27714;&#32844;&#32773;&#30340;&#21069;&#26223;&#12290;&#20877;&#27425;&#35828;&#26126;&#65292;&#24403;&#31227;&#27665;&#21040;&#36798;&#26102;&#27809;&#26377;&#24037;&#20316;&#20250;&#34987;&#31363;&#21462;&#12290;&#26412;&#25991;&#26174;&#31034;&#65292;&#22312;&#19968;&#20010;&#20855;&#26377;&#23601;&#19994;&#37197;&#32473;&#30340;&#21305;&#37197;&#27169;&#22411;&#20013;&#65292;&#31227;&#27665;&#30340;&#36827;&#20837;&#20250;&#38477;&#20302;&#26412;&#22320;&#24037;&#20154;&#30340;&#23601;&#19994;&#29575;&#12290;&#27492;&#22806;&#65292;&#24403;&#21171;&#21160;&#21147;&#24066;&#22330;&#19981;&#26223;&#27668;&#26102;&#65292;&#23601;&#19994;&#29575;&#30340;&#38477;&#24133;&#26356;&#22823;&#65292;&#22240;&#20026;&#37027;&#26102;&#24037;&#20316;&#26356;&#21152;&#31232;&#32570;&#12290;&#22240;&#20026;&#31227;&#27665;&#38477;&#20302;&#20102;&#21171;&#21160;&#21147;&#24066;&#22330;&#30340;&#32039;&#24352;&#31243;&#24230;&#65292;&#20351;&#24471;&#20844;&#21496;&#26356;&#23481;&#26131;&#25307;&#32856;&#65292;&#24182;&#25913;&#21892;&#20844;&#21496;&#21033;&#28070;&#12290;&#31227;&#27665;&#23545;&#26412;&#22320;&#31119;&#21033;&#30340;&#24635;&#20307;&#24433;&#21709;&#21462;&#20915;&#20110;&#21171;&#21160;&#21147;&#24066;&#22330;&#30340;&#29366;&#24577;&#12290;&#24403;&#21171;&#21160;&#21147;&#24066;&#22330;&#20986;&#29616;&#34928;&#36864;&#26102;&#24635;&#20307;&#24433;&#21709;&#22987;&#32456;&#26159;&#36127;&#38754;&#30340;&#65292;&#24182;&#19988;&#24403;&#21171;&#21160;&#21147;&#24066;&#22330;&#32321;&#33635;&#26102;&#21487;&#33021;&#26159;&#27491;&#38754;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
Immigrants are always accused of stealing people's jobs. Yet, in a neoclassical model of the labor market, there are jobs for everybody and no jobs to steal. (There is no unemployment, so anybody who wants to work can work.) In standard matching models, there is some unemployment, but labor demand is perfectly elastic so new entrants into the labor force are absorbed without affecting jobseekers' prospects. Once again, no jobs are stolen when immigrants arrive. This paper shows that in a matching model with job rationing, in contrast, the entry of immigrants reduces the employment rate of native workers. Moreover, the reduction in employment rate is sharper when the labor market is depressed -- because jobs are more scarce then. Because immigration reduces labor-market tightness, it makes it easier for firms to recruit and improves firm profits. The overall effect of immigration on native welfare depends on the state of the labor market. It is always negative when the labor market is i
&lt;/p&gt;</description></item></channel></rss>