<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21033;&#29992;&#38656;&#27714;&#39640;&#38454;&#30697;&#26469;&#20272;&#35745;&#24179;&#22343;&#31119;&#21033;&#25928;&#24212;&#30340;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#23545;&#26410;&#35266;&#23519;&#21040;&#30340;&#20559;&#22909;&#24322;&#36136;&#24615;&#24456;&#24378;&#65292;&#24182;&#19988;&#23545;&#31119;&#21033;&#21464;&#21270;&#30340;&#20998;&#24067;&#21487;&#20197;&#36827;&#34892;&#40065;&#26834;&#25512;&#26029;&#12290;&#21516;&#26102;&#65292;&#35770;&#25991;&#36824;&#24471;&#20986;&#20102;&#38656;&#27714;&#30697;&#24517;&#39035;&#28385;&#36275;&#26377;&#29702;&#28040;&#36153;&#32773;&#32676;&#20307;&#20551;&#35774;&#30340;&#26465;&#20214;&#12290;</title><link>http://arxiv.org/abs/2303.01231</link><description>&lt;p&gt;
&#20010;&#20307;&#24322;&#36136;&#24615;&#19979;&#30340;&#40065;&#26834;&#31119;&#21033;&#20998;&#26512;
&lt;/p&gt;
&lt;p&gt;
Robust Welfare Analysis under Individual Heterogeneity. (arXiv:2303.01231v2 [econ.TH] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.01231
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21033;&#29992;&#38656;&#27714;&#39640;&#38454;&#30697;&#26469;&#20272;&#35745;&#24179;&#22343;&#31119;&#21033;&#25928;&#24212;&#30340;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#23545;&#26410;&#35266;&#23519;&#21040;&#30340;&#20559;&#22909;&#24322;&#36136;&#24615;&#24456;&#24378;&#65292;&#24182;&#19988;&#23545;&#31119;&#21033;&#21464;&#21270;&#30340;&#20998;&#24067;&#21487;&#20197;&#36827;&#34892;&#40065;&#26834;&#25512;&#26029;&#12290;&#21516;&#26102;&#65292;&#35770;&#25991;&#36824;&#24471;&#20986;&#20102;&#38656;&#27714;&#30697;&#24517;&#39035;&#28385;&#36275;&#26377;&#29702;&#28040;&#36153;&#32773;&#32676;&#20307;&#20551;&#35774;&#30340;&#26465;&#20214;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#30446;&#21069;&#27979;&#37327;&#20215;&#26684;&#21464;&#21270;&#30340;&#31119;&#21033;&#25928;&#24212;&#36890;&#24120;&#20351;&#29992;&#27178;&#25130;&#38754;&#25968;&#25454;&#12290;&#20294;&#26159;&#65292;&#20351;&#29992;&#27178;&#25130;&#38754;&#25968;&#25454;&#26080;&#27861;&#35782;&#21035;&#38656;&#27714;&#65292;&#38500;&#38750;&#20551;&#35774;&#25152;&#26377;&#28040;&#36153;&#32773;&#37117;&#26159;&#30456;&#21516;&#30340;&#12290;&#26412;&#25991;&#21033;&#29992;&#20174;&#27178;&#25130;&#38754;&#25968;&#25454;&#20013;&#21487;&#35782;&#21035;&#30340;&#38656;&#27714;&#39640;&#38454;&#30697;&#26469;&#24320;&#21457;&#20272;&#35745;&#24179;&#22343;&#31119;&#21033;&#25928;&#24212;&#30340;&#26041;&#27861;&#65292;&#36825;&#31181;&#26041;&#27861;&#40065;&#26834;&#24615;&#23545;&#26410;&#35266;&#23519;&#21040;&#30340;&#20559;&#22909;&#24322;&#36136;&#24615;&#24456;&#24378;&#12290;&#25105;&#20204;&#30340;&#23616;&#37096;&#36817;&#20284;&#19981;&#23545;&#26410;&#35266;&#23519;&#21040;&#30340;&#19996;&#35199;&#26045;&#21152;&#20219;&#20309;&#38480;&#21046;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#30340;&#26041;&#27861;&#20351;&#24471;&#31119;&#21033;&#21464;&#21270;&#30340;&#20998;&#24067;&#21487;&#20197;&#36827;&#34892;&#40065;&#26834;&#25512;&#26029;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#24471;&#20986;&#20102;&#38656;&#27714;&#30697;&#24517;&#39035;&#28385;&#36275;&#26377;&#29702;&#28040;&#36153;&#32773;&#32676;&#20307;&#20551;&#35774;&#30340;&#26465;&#20214;&#12290;&#25105;&#20204;&#22312;&#33521;&#22269;&#23478;&#24237;&#39044;&#31639;&#35843;&#26597;&#25968;&#25454;&#19978;&#35828;&#26126;&#20102;&#25105;&#20204;&#30340;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
Welfare effects of price changes are often estimated with cross-sectional data. However, cross-sectional data do not identify demand unless all consumers are assumed to be identical. We exploit higher moments of demand, identifiable from cross-sectional data, to develop estimates of average welfare effects that are robust to unobserved preference heterogeneity. Our local approximations do not impose any restrictions on unobservables. In addition, our approach enables robust inference on the distribution of welfare changes. Finally, we obtain conditions that moments of demand must satisfy to arise from a population of rational consumers. We illustrate our methods on household budget survey data from the UK.
&lt;/p&gt;</description></item></channel></rss>