<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#22312;&#22810;&#20803;&#22238;&#24402;&#19981;&#36830;&#32493;&#35774;&#35745;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#22810;&#20803;&#23616;&#37096;&#22810;&#39033;&#24335;&#20272;&#35745;&#26041;&#27861;&#65292;&#33021;&#22815;&#22788;&#29702;&#22810;&#20803;&#35774;&#35745;&#24182;&#25429;&#25417;&#36793;&#30028;&#22788;&#30340;&#24322;&#36136;&#27835;&#30103;&#25928;&#24212;&#12290;</title><link>https://arxiv.org/abs/2402.08941</link><description>&lt;p&gt;
&#22810;&#20803;&#22238;&#24402;&#19981;&#36830;&#32493;&#35774;&#35745;&#30340;&#23616;&#37096;&#22810;&#39033;&#24335;&#20272;&#35745;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Local-Polynomial Estimation for Multivariate Regression Discontinuity Designs
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.08941
&lt;/p&gt;
&lt;p&gt;
&#22312;&#22810;&#20803;&#22238;&#24402;&#19981;&#36830;&#32493;&#35774;&#35745;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#22810;&#20803;&#23616;&#37096;&#22810;&#39033;&#24335;&#20272;&#35745;&#26041;&#27861;&#65292;&#33021;&#22815;&#22788;&#29702;&#22810;&#20803;&#35774;&#35745;&#24182;&#25429;&#25417;&#36793;&#30028;&#22788;&#30340;&#24322;&#36136;&#27835;&#30103;&#25928;&#24212;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#20010;&#22810;&#20803;&#23616;&#37096;&#32447;&#24615;&#20272;&#35745;&#22120;&#65292;&#29992;&#20110;&#22788;&#29702;&#22810;&#20803;&#22238;&#24402;&#19981;&#36830;&#32493;&#35774;&#35745;&#20013;&#30340;&#27835;&#30103;&#20998;&#37197;&#38382;&#39064;&#12290;&#29616;&#26377;&#30340;&#26041;&#27861;&#20351;&#29992;&#20174;&#36793;&#30028;&#28857;&#21040;&#27431;&#27663;&#36317;&#31163;&#20316;&#20026;&#26631;&#37327;&#36816;&#34892;&#21464;&#37327;&#65292;&#22240;&#27492;&#22810;&#20803;&#35774;&#35745;&#34987;&#22788;&#29702;&#20026;&#21333;&#21464;&#37327;&#35774;&#35745;&#12290;&#28982;&#32780;&#65292;&#36317;&#31163;&#36816;&#34892;&#21464;&#37327;&#19982;&#28176;&#36817;&#26377;&#25928;&#24615;&#30340;&#20551;&#35774;&#19981;&#30456;&#23481;&#12290;&#25105;&#20204;&#23558;&#22810;&#20803;&#35774;&#35745;&#20316;&#20026;&#22810;&#20803;&#22788;&#29702;&#12290;&#22312;&#36825;&#39033;&#30740;&#31350;&#20013;&#65292;&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#31181;&#38024;&#23545;&#22810;&#20803;&#23616;&#37096;&#22810;&#39033;&#24335;&#20272;&#35745;&#22120;&#30340;&#26032;&#22411;&#28176;&#36817;&#27491;&#24120;&#24615;&#12290;&#25105;&#20204;&#30340;&#20272;&#35745;&#22120;&#26159;&#28176;&#36817;&#26377;&#25928;&#30340;&#65292;&#24182;&#33021;&#25429;&#25417;&#36793;&#30028;&#22788;&#30340;&#24322;&#36136;&#27835;&#30103;&#25928;&#24212;&#12290;&#36890;&#36807;&#25968;&#20540;&#27169;&#25311;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#25105;&#20204;&#20272;&#35745;&#22120;&#30340;&#26377;&#25928;&#24615;&#12290;&#25105;&#20204;&#22312;&#21733;&#20262;&#27604;&#20122;&#22870;&#23398;&#37329;&#30740;&#31350;&#20013;&#30340;&#23454;&#35777;&#35828;&#26126;&#25581;&#31034;&#20102;&#27835;&#30103;&#25928;&#24212;&#30340;&#26356;&#20016;&#23500;&#30340;&#24322;&#36136;&#24615;&#65288;&#21253;&#25324;&#20854;&#19981;&#23384;&#22312;&#65289;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.08941v1 Announce Type: new Abstract: We introduce a multivariate local-linear estimator for multivariate regression discontinuity designs in which treatment is assigned by crossing a boundary in the space of running variables. The dominant approach uses the Euclidean distance from a boundary point as the scalar running variable; hence, multivariate designs are handled as uni-variate designs. However, the distance running variable is incompatible with the assumption for asymptotic validity. We handle multivariate designs as multivariate. In this study, we develop a novel asymptotic normality for multivariate local-polynomial estimators. Our estimator is asymptotically valid and can capture heterogeneous treatment effects over the boundary. We demonstrate the effectiveness of our estimator through numerical simulations. Our empirical illustration of a Colombian scholarship study reveals a richer heterogeneity (including its absence) of the treatment effect that is hidden in th
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#26399;&#26395;&#25928;&#29992;&#20989;&#25968;&#30340;&#36830;&#32493;&#24615;&#65292;&#24182;&#32473;&#20986;&#20102;&#22312;&#31616;&#21333;&#27010;&#29575;&#31354;&#38388;&#21644;&#20855;&#26377;&#32039;&#25903;&#25745;&#30340;&#27010;&#29575;&#31354;&#38388;&#19978;&#65292;&#20351;&#24471;&#24369;&#27425;&#24207;&#20855;&#26377;&#36830;&#32493;&#26399;&#26395;&#25928;&#29992;&#20989;&#25968;&#30340;&#24517;&#35201;&#19988;&#20805;&#20998;&#26465;&#20214;&#12290;</title><link>http://arxiv.org/abs/2310.16806</link><description>&lt;p&gt;
&#23545;&#26399;&#26395;&#25928;&#29992;&#20989;&#25968;&#36830;&#32493;&#24615;&#30340;&#27880;&#37322;
&lt;/p&gt;
&lt;p&gt;
A Note on the Continuity of Expected Utility Functions. (arXiv:2310.16806v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.16806
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#26399;&#26395;&#25928;&#29992;&#20989;&#25968;&#30340;&#36830;&#32493;&#24615;&#65292;&#24182;&#32473;&#20986;&#20102;&#22312;&#31616;&#21333;&#27010;&#29575;&#31354;&#38388;&#21644;&#20855;&#26377;&#32039;&#25903;&#25745;&#30340;&#27010;&#29575;&#31354;&#38388;&#19978;&#65292;&#20351;&#24471;&#24369;&#27425;&#24207;&#20855;&#26377;&#36830;&#32493;&#26399;&#26395;&#25928;&#29992;&#20989;&#25968;&#30340;&#24517;&#35201;&#19988;&#20805;&#20998;&#26465;&#20214;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#26399;&#26395;&#25928;&#29992;&#20989;&#25968;&#30340;&#36830;&#32493;&#24615;&#65292;&#24182;&#23548;&#20986;&#20102;&#19968;&#20010;&#24369;&#27425;&#24207;&#22312;&#31616;&#21333;&#27010;&#29575;&#31354;&#38388;&#19978;&#20855;&#26377;&#36830;&#32493;&#26399;&#26395;&#25928;&#29992;&#20989;&#25968;&#30340;&#24517;&#35201;&#19982;&#20805;&#20998;&#26465;&#20214;&#12290;&#25105;&#20204;&#36824;&#39564;&#35777;&#20102;&#20960;&#20046;&#30456;&#21516;&#30340;&#26465;&#20214;&#23545;&#20110;&#20855;&#26377;&#32039;&#25903;&#25745;&#30340;&#27010;&#29575;&#31354;&#38388;&#19978;&#30340;&#24369;&#27425;&#24207;&#20855;&#26377;&#36830;&#32493;&#26399;&#26395;&#25928;&#29992;&#20989;&#25968;&#32780;&#35328;&#20063;&#26159;&#24517;&#35201;&#19988;&#20805;&#20998;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this paper, we study the continuity of expected utility functions, and derive a necessary and sufficient condition for a weak order on the space of simple probabilities to have a continuous expected utility function. We also verify that almost the same condition is necessary and sufficient for a weak order on the space of probabilities with compact-support to have a continuous expected utility function.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;&#24314;&#31435;&#28176;&#36817;&#25512;&#26029;&#38750;&#23545;&#31216;&#30697;&#38453;&#29305;&#24449;&#21521;&#37327;&#31243;&#24207;&#30340;&#24517;&#35201;&#26465;&#20214;&#65292;&#24182;&#38024;&#23545;&#23436;&#20840;&#21521;&#37327;&#21644;&#27599;&#20010;&#31995;&#25968;&#20551;&#35774;&#20998;&#21035;&#24314;&#31435;&#20102; Wald &#21644; t &#26816;&#39564;&#30340;&#20998;&#24067;&#29702;&#35770;&#65292;&#26159;&#22810;&#20803;&#32479;&#35745;&#23398;&#20013;&#30340;&#19968;&#31181;&#26377;&#29992;&#24037;&#20855;&#12290;</title><link>http://arxiv.org/abs/2303.18233</link><description>&lt;p&gt;
&#38750;&#23545;&#31216;&#30697;&#38453;&#29305;&#24449;&#21521;&#37327;&#30340;&#25512;&#26029;
&lt;/p&gt;
&lt;p&gt;
Inference on eigenvectors of non-symmetric matrices. (arXiv:2303.18233v1 [math.ST])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.18233
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;&#24314;&#31435;&#28176;&#36817;&#25512;&#26029;&#38750;&#23545;&#31216;&#30697;&#38453;&#29305;&#24449;&#21521;&#37327;&#31243;&#24207;&#30340;&#24517;&#35201;&#26465;&#20214;&#65292;&#24182;&#38024;&#23545;&#23436;&#20840;&#21521;&#37327;&#21644;&#27599;&#20010;&#31995;&#25968;&#20551;&#35774;&#20998;&#21035;&#24314;&#31435;&#20102; Wald &#21644; t &#26816;&#39564;&#30340;&#20998;&#24067;&#29702;&#35770;&#65292;&#26159;&#22810;&#20803;&#32479;&#35745;&#23398;&#20013;&#30340;&#19968;&#31181;&#26377;&#29992;&#24037;&#20855;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#35748;&#20026;&#65292;Tyler&#65288;1981&#65289;&#30340;&#21487;&#23545;&#31216;&#21270;&#26465;&#20214;&#24182;&#38750;&#24314;&#31435;&#28176;&#36817;&#25512;&#26029;&#29305;&#24449;&#21521;&#37327;&#31243;&#24207;&#25152;&#24517;&#38656;&#30340;&#12290; &#25105;&#20204;&#20026;&#23436;&#20840;&#21521;&#37327;&#21644;&#27599;&#20010;&#31995;&#25968;&#20551;&#35774;&#20998;&#21035;&#24314;&#31435;&#20102; Wald &#21644; t &#26816;&#39564;&#30340;&#20998;&#24067;&#29702;&#35770;&#12290; &#25105;&#20204;&#30340;&#26816;&#39564;&#32479;&#35745;&#37327;&#26469;&#28304;&#20110;&#38750;&#23545;&#31216;&#30697;&#38453;&#30340;&#29305;&#24449;&#25237;&#24433;&#12290; &#36890;&#36807;&#23558;&#25237;&#24433;&#34920;&#31034;&#20026;&#20174;&#22522;&#30784;&#30697;&#38453;&#21040;&#20854;&#35889;&#25968;&#25454;&#30340;&#26144;&#23556;&#65292;&#25105;&#20204;&#36890;&#36807;&#35299;&#26512;&#25668;&#21160;&#29702;&#35770;&#25214;&#21040;&#20102;&#23548;&#25968;&#12290; &#36825;&#20123;&#32467;&#26524;&#28436;&#31034;&#20102; Sun&#65288;1991&#65289;&#30340;&#35299;&#26512;&#25668;&#21160;&#29702;&#35770;&#26159;&#22810;&#20803;&#32479;&#35745;&#23398;&#20013;&#30340;&#19968;&#31181;&#26377;&#29992;&#24037;&#20855;&#65292;&#24182;&#19988;&#20855;&#26377;&#29420;&#31435;&#30340;&#20852;&#36259;&#12290;&#20316;&#20026;&#19968;&#31181;&#24212;&#29992;&#65292;&#25105;&#20204;&#20026;&#30001;&#26377;&#21521;&#22270;&#24341;&#21457;&#30340;&#37051;&#25509;&#30697;&#38453;&#20272;&#35745;&#30340; Bonacich &#20013;&#24515;&#24615;&#23450;&#20041;&#32622;&#20449;&#21306;&#38388;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper argues that the symmetrisability condition in Tyler(1981) is not necessary to establish asymptotic inference procedures for eigenvectors. We establish distribution theory for a Wald and t-test for full-vector and individual coefficient hypotheses, respectively. Our test statistics originate from eigenprojections of non-symmetric matrices. Representing projections as a mapping from the underlying matrix to its spectral data, we find derivatives through analytic perturbation theory. These results demonstrate how the analytic perturbation theory of Sun(1991) is a useful tool in multivariate statistics and are of independent interest. As an application, we define confidence sets for Bonacich centralities estimated from adjacency matrices induced by directed graphs.
&lt;/p&gt;</description></item></channel></rss>