<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#35813;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#22312;&#39640;&#32500;&#38754;&#26495;&#25968;&#25454;&#20013;&#36827;&#34892;&#22240;&#23376;&#20998;&#26512;&#30340;&#26032;&#26041;&#27861;&#65292;&#21363;&#22797;&#21512;&#20998;&#20301;&#25968;&#22240;&#23376;&#27169;&#22411;&#12290;&#20854;&#21019;&#26032;&#20043;&#22788;&#22312;&#20110;&#22312;&#19981;&#21516;&#20998;&#20301;&#25968;&#19978;&#20272;&#35745;&#22240;&#23376;&#21644;&#22240;&#23376;&#36733;&#33655;&#65292;&#25552;&#39640;&#20102;&#20272;&#35745;&#32467;&#26524;&#30340;&#36866;&#24212;&#24615;&#65292;&#24182;&#24341;&#20837;&#20102;&#19968;&#31181;&#19968;&#33268;&#36873;&#25321;&#22240;&#23376;&#25968;&#30340;&#20449;&#24687;&#20934;&#21017;&#12290;&#27169;&#25311;&#32467;&#26524;&#21644;&#23454;&#35777;&#30740;&#31350;&#34920;&#26126;&#65292;&#35813;&#26041;&#27861;&#22312;&#38750;&#27491;&#24577;&#20998;&#24067;&#19979;&#20855;&#26377;&#33391;&#22909;&#30340;&#24615;&#36136;&#12290;</title><link>http://arxiv.org/abs/2308.02450</link><description>&lt;p&gt;
&#22797;&#21512;&#20998;&#20301;&#25968;&#22240;&#23376;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
Composite Quantile Factor Models. (arXiv:2308.02450v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.02450
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#22312;&#39640;&#32500;&#38754;&#26495;&#25968;&#25454;&#20013;&#36827;&#34892;&#22240;&#23376;&#20998;&#26512;&#30340;&#26032;&#26041;&#27861;&#65292;&#21363;&#22797;&#21512;&#20998;&#20301;&#25968;&#22240;&#23376;&#27169;&#22411;&#12290;&#20854;&#21019;&#26032;&#20043;&#22788;&#22312;&#20110;&#22312;&#19981;&#21516;&#20998;&#20301;&#25968;&#19978;&#20272;&#35745;&#22240;&#23376;&#21644;&#22240;&#23376;&#36733;&#33655;&#65292;&#25552;&#39640;&#20102;&#20272;&#35745;&#32467;&#26524;&#30340;&#36866;&#24212;&#24615;&#65292;&#24182;&#24341;&#20837;&#20102;&#19968;&#31181;&#19968;&#33268;&#36873;&#25321;&#22240;&#23376;&#25968;&#30340;&#20449;&#24687;&#20934;&#21017;&#12290;&#27169;&#25311;&#32467;&#26524;&#21644;&#23454;&#35777;&#30740;&#31350;&#34920;&#26126;&#65292;&#35813;&#26041;&#27861;&#22312;&#38750;&#27491;&#24577;&#20998;&#24067;&#19979;&#20855;&#26377;&#33391;&#22909;&#30340;&#24615;&#36136;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#22312;&#39640;&#32500;&#38754;&#26495;&#25968;&#25454;&#20013;&#36827;&#34892;&#22240;&#23376;&#20998;&#26512;&#30340;&#26041;&#27861;&#65292;&#21363;&#22797;&#21512;&#20998;&#20301;&#25968;&#22240;&#23376;&#27169;&#22411;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#22312;&#19981;&#21516;&#20998;&#20301;&#25968;&#19978;&#20272;&#35745;&#22240;&#23376;&#21644;&#22240;&#23376;&#36733;&#33655;&#30340;&#26041;&#27861;&#65292;&#20351;&#24471;&#20272;&#35745;&#32467;&#26524;&#33021;&#22815;&#26356;&#22909;&#22320;&#36866;&#24212;&#19981;&#21516;&#20998;&#20301;&#25968;&#19979;&#25968;&#25454;&#30340;&#29305;&#24449;&#65292;&#24182;&#19988;&#20173;&#28982;&#33021;&#22815;&#23545;&#25968;&#25454;&#30340;&#22343;&#20540;&#36827;&#34892;&#24314;&#27169;&#12290;&#25105;&#20204;&#25512;&#23548;&#20102;&#20272;&#35745;&#30340;&#22240;&#23376;&#21644;&#22240;&#23376;&#36733;&#33655;&#30340;&#26497;&#38480;&#20998;&#24067;&#65292;&#24182;&#35752;&#35770;&#20102;&#19968;&#31181;&#19968;&#33268;&#36873;&#25321;&#22240;&#23376;&#25968;&#30340;&#20449;&#24687;&#20934;&#21017;&#12290;&#27169;&#25311;&#32467;&#26524;&#34920;&#26126;&#65292;&#25152;&#25552;&#20986;&#30340;&#20272;&#35745;&#22120;&#21644;&#20449;&#24687;&#20934;&#21017;&#23545;&#20110;&#20960;&#31181;&#38750;&#27491;&#24577;&#20998;&#24067;&#20855;&#26377;&#33391;&#22909;&#30340;&#26377;&#38480;&#26679;&#26412;&#24615;&#36136;&#12290;&#25105;&#20204;&#36824;&#23545;246&#20010;&#23395;&#24230;&#23439;&#35266;&#32463;&#27982;&#21464;&#37327;&#30340;&#22240;&#23376;&#20998;&#26512;&#36827;&#34892;&#20102;&#23454;&#35777;&#30740;&#31350;&#65292;&#24182;&#24320;&#21457;&#20102;&#19968;&#20010;&#21517;&#20026;cqrfactor&#30340;&#20276;&#38543;R&#21253;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper introduces the method of composite quantile factor model for factor analysis in high-dimensional panel data. We propose to estimate the factors and factor loadings across different quantiles of the data, allowing the estimates to better adapt to features of the data at different quantiles while still modeling the mean of the data. We develop the limiting distribution of the estimated factors and factor loadings, and an information criterion for consistent factor number selection is also discussed. Simulations show that the proposed estimator and the information criterion have good finite sample properties for several non-normal distributions under consideration. We also consider an empirical study on the factor analysis for 246 quarterly macroeconomic variables. A companion R package cqrfactor is developed.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#30697;&#38453;&#34917;&#20840;&#30340;&#25512;&#26029;&#26694;&#26550;&#65292;&#21487;&#20197;&#22788;&#29702;&#38750;&#38543;&#26426;&#32570;&#22833;&#19988;&#26080;&#38656;&#24378;&#20449;&#21495;&#65292;&#26041;&#27861;&#21253;&#25324;&#23558;&#32570;&#22833;&#26465;&#30446;&#20998;&#32452;&#24182;&#24212;&#29992;&#26680;&#33539;&#25968;&#27491;&#21017;&#21270;&#36827;&#34892;&#20272;&#35745;&#12290;&#30740;&#31350;&#21463;&#21040;Tick Size Pilot Program&#30340;&#21551;&#21457;&#65292;&#35813;&#23454;&#39564;&#35780;&#20272;&#20102;&#25193;&#22823;Tick Size&#23545;&#32929;&#31080;&#24066;&#22330;&#21697;&#36136;&#30340;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2308.02364</link><description>&lt;p&gt;
&#30697;&#38453;&#34917;&#20840;: &#38750;&#38543;&#26426;&#32570;&#22833;&#21450;&#20854;&#22312;&#22240;&#26524;&#38754;&#26495;&#25968;&#25454;&#27169;&#22411;&#20013;&#30340;&#24212;&#29992;
&lt;/p&gt;
&lt;p&gt;
Matrix Completion When Missing Is Not at Random and Its Applications in Causal Panel Data Models. (arXiv:2308.02364v1 [stat.ME])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.02364
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#30697;&#38453;&#34917;&#20840;&#30340;&#25512;&#26029;&#26694;&#26550;&#65292;&#21487;&#20197;&#22788;&#29702;&#38750;&#38543;&#26426;&#32570;&#22833;&#19988;&#26080;&#38656;&#24378;&#20449;&#21495;&#65292;&#26041;&#27861;&#21253;&#25324;&#23558;&#32570;&#22833;&#26465;&#30446;&#20998;&#32452;&#24182;&#24212;&#29992;&#26680;&#33539;&#25968;&#27491;&#21017;&#21270;&#36827;&#34892;&#20272;&#35745;&#12290;&#30740;&#31350;&#21463;&#21040;Tick Size Pilot Program&#30340;&#21551;&#21457;&#65292;&#35813;&#23454;&#39564;&#35780;&#20272;&#20102;&#25193;&#22823;Tick Size&#23545;&#32929;&#31080;&#24066;&#22330;&#21697;&#36136;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#22312;&#32570;&#22833;&#25968;&#25454;&#38750;&#38543;&#26426;&#30340;&#24773;&#20917;&#19979;&#65292;&#24320;&#21457;&#20102;&#19968;&#20010;&#25512;&#26029;&#26694;&#26550;&#26469;&#36827;&#34892;&#30697;&#38453;&#34917;&#20840;&#65292;&#24182;&#19988;&#26080;&#38656;&#24378;&#20449;&#21495;&#30340;&#35201;&#27714;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#22522;&#20110;&#35266;&#23519;&#21040;&#65292;&#22914;&#26524;&#32570;&#22833;&#26465;&#30446;&#30340;&#25968;&#37327;&#30456;&#23545;&#20110;&#38754;&#26495;&#30340;&#22823;&#23567;&#36275;&#22815;&#23567;&#65292;&#21363;&#20351;&#32570;&#22833;&#26159;&#38750;&#38543;&#26426;&#30340;&#65292;&#20063;&#21487;&#20197;&#24456;&#22909;&#22320;&#20272;&#35745;&#23427;&#20204;&#12290;&#21033;&#29992;&#36825;&#20010;&#20107;&#23454;&#65292;&#25105;&#20204;&#23558;&#32570;&#22833;&#30340;&#26465;&#30446;&#20998;&#25104;&#36739;&#23567;&#30340;&#32452;&#65292;&#24182;&#36890;&#36807;&#26680;&#33539;&#25968;&#27491;&#21017;&#21270;&#26469;&#20272;&#35745;&#27599;&#32452;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36824;&#35777;&#26126;&#20102;&#65292;&#22312;&#36866;&#24403;&#30340;&#21435;&#20559;&#20272;&#35745;&#19979;&#65292;&#25105;&#20204;&#25552;&#20986;&#30340;&#20272;&#35745;&#37327;&#21363;&#20351;&#23545;&#20110;&#30456;&#24403;&#24369;&#30340;&#20449;&#21495;&#20063;&#26159;&#28176;&#36817;&#27491;&#24577;&#30340;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#21463;&#21040;&#20102;&#26368;&#36817;&#20851;&#20110;Tick Size Pilot Program&#30340;&#30740;&#31350;&#30340;&#21551;&#21457;&#65292;&#36825;&#26159;&#19968;&#39033;&#30001;&#32654;&#22269;&#35777;&#21048;&#20132;&#26131;&#22996;&#21592;&#20250;&#65288;SEC&#65289;&#20174;2016&#24180;&#21040;2018&#24180;&#36827;&#34892;&#30340;&#23454;&#39564;&#65292;&#26088;&#22312;&#35780;&#20272;&#25193;&#22823;&#32929;&#31080;&#26368;&#23567;&#21464;&#21160;&#20215;&#20301;&#65288;Tick Size&#65289;&#23545;&#24066;&#22330;&#21697;&#36136;&#30340;&#24433;&#21709;&#12290;&#32780;&#20197;&#24448;&#30340;&#30740;&#31350;&#37117;&#26159;&#22522;&#20110;&#20256;&#32479;&#30340;&#22238;&#24402;&#25110;&#24046;&#20998;&#27861;&#65292;&#20551;&#35774;&#22788;&#29702;&#25928;&#24212;&#22312;&#19981;&#21464;&#30340;&#24773;&#20917;&#19979;&#36827;&#34892;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper develops an inferential framework for matrix completion when missing is not at random and without the requirement of strong signals. Our development is based on the observation that if the number of missing entries is small enough compared to the panel size, then they can be estimated well even when missing is not at random. Taking advantage of this fact, we divide the missing entries into smaller groups and estimate each group via nuclear norm regularization. In addition, we show that with appropriate debiasing, our proposed estimate is asymptotically normal even for fairly weak signals. Our work is motivated by recent research on the Tick Size Pilot Program, an experiment conducted by the Security and Exchange Commission (SEC) to evaluate the impact of widening the tick size on the market quality of stocks from 2016 to 2018. While previous studies were based on traditional regression or difference-in-difference methods by assuming that the treatment effect is invariant wit
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#22522;&#20110;&#21512;&#20316;&#21338;&#24328;&#20013;&#30340;Gately&#20540;&#65292;&#24341;&#20837;&#20102;&#19968;&#31181;&#26032;&#30340;&#32593;&#32476;&#20013;&#24515;&#24615;&#24230;&#37327;&#26041;&#27861;&#65292;&#29992;&#20110;&#34913;&#37327;&#26377;&#21521;&#32593;&#32476;&#30340;&#26435;&#21147;&#20998;&#37197;&#24182;&#25506;&#35752;&#20102;&#20854;&#29305;&#24615;&#21644;&#19982;&#20854;&#20182;&#34913;&#37327;&#26041;&#27861;&#30340;&#20851;&#31995;&#12290;</title><link>http://arxiv.org/abs/2308.02274</link><description>&lt;p&gt;
&#22522;&#20110;Gately&#21338;&#24328;&#35770;&#30340;&#26377;&#21521;&#32593;&#32476;Gately&#33021;&#37327;&#34913;&#37327;&#30340;&#22522;&#30784;
&lt;/p&gt;
&lt;p&gt;
Game theoretic foundations of the Gately power measure for directed networks. (arXiv:2308.02274v1 [cs.GT])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.02274
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#22522;&#20110;&#21512;&#20316;&#21338;&#24328;&#20013;&#30340;Gately&#20540;&#65292;&#24341;&#20837;&#20102;&#19968;&#31181;&#26032;&#30340;&#32593;&#32476;&#20013;&#24515;&#24615;&#24230;&#37327;&#26041;&#27861;&#65292;&#29992;&#20110;&#34913;&#37327;&#26377;&#21521;&#32593;&#32476;&#30340;&#26435;&#21147;&#20998;&#37197;&#24182;&#25506;&#35752;&#20102;&#20854;&#29305;&#24615;&#21644;&#19982;&#20854;&#20182;&#34913;&#37327;&#26041;&#27861;&#30340;&#20851;&#31995;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#31181;&#26032;&#30340;&#32593;&#32476;&#20013;&#24515;&#24615;&#24230;&#37327;&#65292;&#22522;&#20110;&#21487;&#36716;&#31227;&#25928;&#29992;&#30340;&#21512;&#20316;&#21338;&#24328;&#20013;&#30340;Gately&#20540;&#12290;&#26377;&#21521;&#32593;&#32476;&#34987;&#35299;&#37322;&#20026;&#20195;&#34920;&#29609;&#23478;&#20043;&#38388;&#30340;&#25511;&#21046;&#25110;&#26435;&#23041;&#20851;&#31995; - &#26500;&#25104;&#19968;&#20010;&#31561;&#32423;&#32593;&#32476;&#12290;&#23618;&#32423;&#32593;&#32476;&#30340;&#26435;&#21147;&#20998;&#37197;&#21487;&#20197;&#36890;&#36807;TU&#21338;&#24328;&#26469;&#34920;&#31034;&#12290;&#25105;&#20204;&#30740;&#31350;&#20102;&#36825;&#20010;TU&#34920;&#31034;&#30340;&#29305;&#24615;&#65292;&#24182;&#30740;&#31350;&#20102;&#30001;&#27492;&#20135;&#29983;&#30340;Gately&#33021;&#37327;&#34913;&#37327;&#20013;&#30340;Gately&#20540;&#12290;&#25105;&#20204;&#30830;&#23450;&#20102;&#20309;&#26102;Gately&#34913;&#37327;&#20026;&#26680;&#24515;&#33021;&#37327;&#34913;&#37327;&#65292;&#30740;&#31350;&#20102;Gately&#19982;&#946;-&#34913;&#37327;&#30340;&#20851;&#31995;&#65292;&#24182;&#26500;&#24314;&#20102;Gately&#34913;&#37327;&#30340;&#20844;&#29702;&#21270;&#12290;
&lt;/p&gt;
&lt;p&gt;
We introduce a new network centrality measure founded on the Gately value for cooperative games with transferable utilities. A directed network is interpreted as representing control or authority relations between players--constituting a hierarchical network. The power distribution of a hierarchical network can be represented through a TU-game. We investigate the properties of this TU-representation and investigate the Gately value of the TU-representation resulting in the Gately power measure. We establish when the Gately measure is a Core power gauge, investigate the relationship of the Gately with the $\beta$-measure, and construct an axiomatisation of the Gately measure.
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#25351;&#20986;&#22825;&#30495;&#30340;&#32593;&#32476;&#25235;&#21462;&#31243;&#24207;&#21487;&#33021;&#23548;&#33268;&#25910;&#38598;&#25968;&#25454;&#20013;&#30340;&#25277;&#26679;&#20559;&#24046;&#65292;&#24182;&#25551;&#36848;&#20102;&#26469;&#28304;&#20110;&#32593;&#32476;&#20869;&#23481;&#26131;&#21464;&#24615;&#12289;&#20010;&#24615;&#21270;&#21644;&#26410;&#32034;&#24341;&#30340;&#25277;&#26679;&#20559;&#24046;&#12290;&#36890;&#36807;&#20363;&#23376;&#35828;&#26126;&#20102;&#25277;&#26679;&#20559;&#24046;&#30340;&#26222;&#36941;&#24615;&#21644;&#31243;&#24230;&#65292;&#24182;&#25552;&#20379;&#20102;&#20811;&#26381;&#25277;&#26679;&#20559;&#24046;&#30340;&#24314;&#35758;&#12290;</title><link>http://arxiv.org/abs/2308.02231</link><description>&lt;p&gt;
&#25105;&#20204;&#24212;&#35813;&#30456;&#20449;&#32593;&#32476;&#25235;&#21462;&#30340;&#25968;&#25454;&#21527;&#65311;
&lt;/p&gt;
&lt;p&gt;
Should we trust web-scraped data?. (arXiv:2308.02231v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.02231
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25351;&#20986;&#22825;&#30495;&#30340;&#32593;&#32476;&#25235;&#21462;&#31243;&#24207;&#21487;&#33021;&#23548;&#33268;&#25910;&#38598;&#25968;&#25454;&#20013;&#30340;&#25277;&#26679;&#20559;&#24046;&#65292;&#24182;&#25551;&#36848;&#20102;&#26469;&#28304;&#20110;&#32593;&#32476;&#20869;&#23481;&#26131;&#21464;&#24615;&#12289;&#20010;&#24615;&#21270;&#21644;&#26410;&#32034;&#24341;&#30340;&#25277;&#26679;&#20559;&#24046;&#12290;&#36890;&#36807;&#20363;&#23376;&#35828;&#26126;&#20102;&#25277;&#26679;&#20559;&#24046;&#30340;&#26222;&#36941;&#24615;&#21644;&#31243;&#24230;&#65292;&#24182;&#25552;&#20379;&#20102;&#20811;&#26381;&#25277;&#26679;&#20559;&#24046;&#30340;&#24314;&#35758;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#23454;&#35777;&#30740;&#31350;&#20154;&#21592;&#36234;&#26469;&#36234;&#22810;&#22320;&#37319;&#29992;&#35745;&#37327;&#32463;&#27982;&#23398;&#21644;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#65292;&#23548;&#33268;&#20102;&#23545;&#19968;&#31181;&#25968;&#25454;&#25910;&#38598;&#26041;&#27861;&#30340;&#24191;&#27867;&#20351;&#29992;&#65306;&#32593;&#32476;&#25235;&#21462;&#12290;&#32593;&#32476;&#25235;&#21462;&#25351;&#30340;&#26159;&#20351;&#29992;&#33258;&#21160;&#21270;&#35745;&#31639;&#26426;&#31243;&#24207;&#35775;&#38382;&#32593;&#31449;&#24182;&#19979;&#36733;&#20854;&#20869;&#23481;&#12290;&#26412;&#25991;&#30340;&#20027;&#35201;&#35770;&#28857;&#26159;&#65292;&#22825;&#30495;&#30340;&#32593;&#32476;&#25235;&#21462;&#31243;&#24207;&#21487;&#33021;&#20250;&#23548;&#33268;&#25910;&#38598;&#25968;&#25454;&#20013;&#30340;&#25277;&#26679;&#20559;&#24046;&#12290;&#26412;&#25991;&#25551;&#36848;&#20102;&#32593;&#32476;&#25235;&#21462;&#25968;&#25454;&#20013;&#30340;&#19977;&#31181;&#25277;&#26679;&#20559;&#24046;&#26469;&#28304;&#12290;&#26356;&#20855;&#20307;&#22320;&#35828;&#65292;&#25277;&#26679;&#20559;&#24046;&#28304;&#20110;&#32593;&#32476;&#20869;&#23481;&#30340;&#26131;&#21464;&#24615;&#65288;&#21363;&#21487;&#33021;&#21457;&#29983;&#21464;&#21270;&#65289;&#12289;&#20010;&#24615;&#21270;&#65288;&#21363;&#26681;&#25454;&#35831;&#27714;&#29305;&#24449;&#21576;&#29616;&#65289;&#21644;&#26410;&#32034;&#24341;&#65288;&#21363;&#20154;&#21475;&#30331;&#35760;&#31807;&#30340;&#20016;&#23500;&#24615;&#65289;&#12290;&#36890;&#36807;&#19968;&#31995;&#21015;&#20363;&#23376;&#65292;&#25105;&#35828;&#26126;&#20102;&#25277;&#26679;&#20559;&#24046;&#30340;&#26222;&#36941;&#24615;&#21644;&#31243;&#24230;&#12290;&#20026;&#20102;&#25903;&#25345;&#30740;&#31350;&#20154;&#21592;&#21644;&#23457;&#31295;&#20154;&#65292;&#26412;&#25991;&#25552;&#20379;&#20102;&#20851;&#20110;&#23545;&#32593;&#32476;&#25235;&#21462;&#25968;&#25454;&#30340;&#25277;&#26679;&#20559;&#24046;&#36827;&#34892;&#39044;&#26399;&#12289;&#26816;&#27979;&#21644;&#20811;&#26381;&#30340;&#24314;&#35758;&#12290;
&lt;/p&gt;
&lt;p&gt;
The increasing adoption of econometric and machine-learning approaches by empirical researchers has led to a widespread use of one data collection method: web scraping. Web scraping refers to the use of automated computer programs to access websites and download their content. The key argument of this paper is that na\"ive web scraping procedures can lead to sampling bias in the collected data. This article describes three sources of sampling bias in web-scraped data. More specifically, sampling bias emerges from web content being volatile (i.e., being subject to change), personalized (i.e., presented in response to request characteristics), and unindexed (i.e., abundance of a population register). In a series of examples, I illustrate the prevalence and magnitude of sampling bias. To support researchers and reviewers, this paper provides recommendations on anticipating, detecting, and overcoming sampling bias in web-scraped data.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#26816;&#39564;&#26399;&#26395;&#25928;&#29992;&#21644;&#20985;&#20984;&#24615;&#30340;&#31616;&#21333;&#26041;&#27861;&#65292;&#32467;&#26524;&#21457;&#29616;&#20960;&#20046;&#27809;&#26377;&#25903;&#25345;&#36825;&#20004;&#20010;&#27169;&#22411;&#12290;&#27492;&#22806;&#65292;&#30740;&#31350;&#36824;&#35777;&#26126;&#20351;&#29992;&#27969;&#34892;&#30340;&#22810;&#20215;&#26684;&#28165;&#21333;&#26041;&#27861;&#27979;&#37327;&#39118;&#38505;&#35268;&#36991;&#26159;&#19981;&#21512;&#36866;&#30340;&#65292;&#30001;&#20110;&#21442;&#25968;&#38169;&#35823;&#23548;&#33268;&#20102;&#39118;&#38505;&#35268;&#36991;&#39640;&#26222;&#36941;&#24615;&#30340;&#29616;&#35937;&#12290;</title><link>http://arxiv.org/abs/2308.02083</link><description>&lt;p&gt;
&#39118;&#38505;&#35268;&#36991;&#30340;&#38750;&#21442;&#25968;&#26816;&#39564;
&lt;/p&gt;
&lt;p&gt;
A Non-Parametric Test of Risk Aversion. (arXiv:2308.02083v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.02083
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#26816;&#39564;&#26399;&#26395;&#25928;&#29992;&#21644;&#20985;&#20984;&#24615;&#30340;&#31616;&#21333;&#26041;&#27861;&#65292;&#32467;&#26524;&#21457;&#29616;&#20960;&#20046;&#27809;&#26377;&#25903;&#25345;&#36825;&#20004;&#20010;&#27169;&#22411;&#12290;&#27492;&#22806;&#65292;&#30740;&#31350;&#36824;&#35777;&#26126;&#20351;&#29992;&#27969;&#34892;&#30340;&#22810;&#20215;&#26684;&#28165;&#21333;&#26041;&#27861;&#27979;&#37327;&#39118;&#38505;&#35268;&#36991;&#26159;&#19981;&#21512;&#36866;&#30340;&#65292;&#30001;&#20110;&#21442;&#25968;&#38169;&#35823;&#23548;&#33268;&#20102;&#39118;&#38505;&#35268;&#36991;&#39640;&#26222;&#36941;&#24615;&#30340;&#29616;&#35937;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#32463;&#27982;&#23398;&#20013;&#65292;&#36890;&#36807;&#26399;&#26395;&#25928;&#29992;&#33539;&#24335;&#20869;&#30340;&#20985;&#20984;&#20271;&#21162;&#21033;&#25928;&#29992;&#26469;&#24314;&#27169;&#39118;&#38505;&#35268;&#36991;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#31616;&#21333;&#30340;&#26399;&#26395;&#25928;&#29992;&#21644;&#20985;&#20984;&#24615;&#30340;&#27979;&#35797;&#26041;&#27861;&#12290;&#25105;&#20204;&#21457;&#29616;&#24456;&#23569;&#25903;&#25345;&#20219;&#20309;&#19968;&#31181;&#27169;&#22411;&#65306;&#21482;&#26377;30%&#30340;&#36873;&#25321;&#31526;&#21512;&#20985;&#20984;&#25928;&#29992;&#65292;&#21482;&#26377;72&#21517;&#21463;&#35797;&#32773;&#20013;&#30340;&#20004;&#20154;&#31526;&#21512;&#26399;&#26395;&#25928;&#29992;&#65292;&#32780;&#20854;&#20013;&#21482;&#26377;&#19968;&#20154;&#31526;&#21512;&#32463;&#27982;&#23398;&#20013;&#30340;&#39118;&#38505;&#35268;&#36991;&#27169;&#22411;&#12290;&#25105;&#20204;&#30340;&#32467;&#26524;&#19982;&#20351;&#29992;&#27969;&#34892;&#30340;&#22810;&#20215;&#26684;&#28165;&#21333;&#26041;&#27861;&#33719;&#21462;&#30340;&#30475;&#20284;&#8220;&#39118;&#38505;&#35268;&#36991;&#8221;&#30340;&#36873;&#25321;&#30340;&#26222;&#36941;&#29616;&#35937;&#24418;&#25104;&#23545;&#27604;&#65292;&#36825;&#19968;&#32467;&#26524;&#25105;&#20204;&#22312;&#26412;&#25991;&#20013;&#37325;&#22797;&#20102;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#36825;&#31181;&#26041;&#27861;&#19981;&#36866;&#29992;&#20110;&#34913;&#37327;&#39118;&#38505;&#35268;&#36991;&#65292;&#24182;&#19988;&#23427;&#20135;&#29983;&#39118;&#38505;&#35268;&#36991;&#39640;&#26222;&#36941;&#24615;&#30340;&#21407;&#22240;&#26159;&#21442;&#25968;&#38169;&#35823;&#12290;
&lt;/p&gt;
&lt;p&gt;
In economics, risk aversion is modeled via a concave Bernoulli utility within the expected-utility paradigm. We propose a simple test of expected utility and concavity. We find little support for either: only 30 percent of the choices are consistent with a concave utility, only two out of 72 subjects are consistent with expected utility, and only one of them fits the economic model of risk aversion. Our findings contrast with the preponderance of seemingly "risk-averse" choices that have been elicited using the popular multiple-price list methodology, a result we replicate in this paper. We demonstrate that this methodology is unfit to measure risk aversion, and that the high prevalence of risk aversion it produces is due to parametric misspecification.
&lt;/p&gt;</description></item><item><title>&#25552;&#20986;&#20102;&#26377;&#38480;&#30693;&#35782;&#19979;n&#20154;&#21338;&#24328;&#30340;&#26694;&#26550;&#65292;&#24341;&#20837;&#20102;&#8220;&#28216;&#25103;&#26234;&#33021;&#8221;&#26426;&#21046;&#21644;&#8220;&#38450;&#20316;&#24330;&#24615;&#8221;&#27010;&#24565;&#65292;GI&#26426;&#21046;&#21487;&#20197;&#23454;&#38469;&#35780;&#20272;&#29609;&#23478;&#30340;&#26234;&#33021;&#65292;&#24212;&#29992;&#24191;&#27867;&#12290;</title><link>http://arxiv.org/abs/2302.13937</link><description>&lt;p&gt;
&#26377;&#38480;&#30693;&#35782;&#19979;n&#20154;&#21338;&#24328;&#30340;&#20154;&#31867;&#19982;&#26426;&#22120;&#26234;&#33021;
&lt;/p&gt;
&lt;p&gt;
Human and Machine Intelligence in n-Person Games with Partial Knowledge. (arXiv:2302.13937v2 [econ.TH] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2302.13937
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#26377;&#38480;&#30693;&#35782;&#19979;n&#20154;&#21338;&#24328;&#30340;&#26694;&#26550;&#65292;&#24341;&#20837;&#20102;&#8220;&#28216;&#25103;&#26234;&#33021;&#8221;&#26426;&#21046;&#21644;&#8220;&#38450;&#20316;&#24330;&#24615;&#8221;&#27010;&#24565;&#65292;GI&#26426;&#21046;&#21487;&#20197;&#23454;&#38469;&#35780;&#20272;&#29609;&#23478;&#30340;&#26234;&#33021;&#65292;&#24212;&#29992;&#24191;&#27867;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#26032;&#30340;&#26694;&#26550;&#8212;&#8212;&#26377;&#38480;&#30693;&#35782;&#19979;&#30340;n&#20154;&#21338;&#24328;&#65292;&#20854;&#20013;&#29609;&#23478;&#21482;&#23545;&#28216;&#25103;&#30340;&#26576;&#20123;&#26041;&#38754;&#65288;&#21253;&#25324;&#34892;&#21160;&#12289;&#32467;&#26524;&#21644;&#20854;&#20182;&#29609;&#23478;&#65289;&#26377;&#38480;&#30340;&#20102;&#35299;&#12290;&#20026;&#20102;&#20998;&#26512;&#36825;&#20123;&#28216;&#25103;&#65292;&#25105;&#20171;&#32461;&#20102;&#19968;&#32452;&#26032;&#30340;&#27010;&#24565;&#21644;&#26426;&#21046;&#65292;&#37325;&#28857;&#20851;&#27880;&#20154;&#31867;&#21644;&#26426;&#22120;&#20915;&#31574;&#20043;&#38388;&#30340;&#30456;&#20114;&#20316;&#29992;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#25105;&#24341;&#20837;&#20102;&#20004;&#20010;&#20027;&#35201;&#27010;&#24565;&#65306;&#31532;&#19968;&#20010;&#26159;&#8220;&#28216;&#25103;&#26234;&#33021;&#8221;&#65288;GI&#65289;&#26426;&#21046;&#65292;&#23427;&#36890;&#36807;&#32771;&#34385;&#21442;&#32771;&#26426;&#22120;&#26234;&#33021;&#19979;&#30340;&#8220;&#38169;&#35823;&#8221;&#65292;&#19981;&#20165;&#20165;&#26159;&#28216;&#25103;&#30340;&#32467;&#26524;&#65292;&#37327;&#21270;&#20102;&#29609;&#23478;&#22312;&#28216;&#25103;&#20013;&#23637;&#31034;&#20986;&#30340;&#26234;&#33021;&#12290;&#31532;&#20108;&#20010;&#26159;&#8220;&#38450;&#20316;&#24330;&#24615;&#8221;&#65292;&#36825;&#26159;&#19968;&#31181;&#23454;&#29992;&#30340;&#12289;&#21487;&#35745;&#31639;&#30340;&#31574;&#30053;&#26080;&#20851;&#24615;&#30340;&#27010;&#24565;&#12290;GI&#26426;&#21046;&#25552;&#20379;&#20102;&#19968;&#31181;&#23454;&#29992;&#30340;&#26041;&#27861;&#26469;&#35780;&#20272;&#29609;&#23478;&#65292;&#21487;&#20197;&#28508;&#22312;&#22320;&#24212;&#29992;&#20110;&#20174;&#22312;&#32447;&#28216;&#25103;&#21040;&#29616;&#23454;&#29983;&#27963;&#20915;&#31574;&#30340;&#21508;&#31181;&#28216;&#25103;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this note, I introduce a new framework called n-person games with partial knowledge, in which players have only limited knowledge about the aspects of the game -- including actions, outcomes, and other players. For example, playing an actual game of chess is a game of partial knowledge. To analyze these games, I introduce a set of new concepts and mechanisms for measuring the intelligence of players, with a focus on the interplay between human- and machine-based decision-making. Specifically, I introduce two main concepts: firstly, the Game Intelligence (GI) mechanism, which quantifies a player's demonstrated intelligence in a game by considering not only the game's outcome but also the "mistakes" made during the game according to the reference machine's intelligence. Secondly, I define gaming-proofness, a practical and computational concept of strategy-proofness. The GI mechanism provides a practicable way to assess players and can potentially be applied to a wide range of games, f
&lt;/p&gt;</description></item><item><title>&#36890;&#36807;&#22312;&#29790;&#20856;Covid-19&#30123;&#33495;&#25512;&#20986;&#20013;&#30340;&#21306;&#22495;&#21464;&#21270;&#65292;&#30740;&#31350;&#20102;&#23545;&#28608;&#21169;&#26377;&#24046;&#24322;&#30340;&#32676;&#20307;&#30340;&#25552;&#31034;&#25928;&#26524;&#65292;&#32467;&#26524;&#26174;&#31034;&#25552;&#31034;&#23545;&#20110;&#20010;&#20154;&#26080;&#24847;&#20041;&#30340;&#36873;&#25321;&#26356;&#26377;&#25928;&#12290;</title><link>http://arxiv.org/abs/2301.08797</link><description>&lt;p&gt;
&#40664;&#35748;&#25552;&#31034;&#20160;&#20040;&#26102;&#20505;&#26377;&#25928;?
&lt;/p&gt;
&lt;p&gt;
When do Default Nudges Work?. (arXiv:2301.08797v3 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2301.08797
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#22312;&#29790;&#20856;Covid-19&#30123;&#33495;&#25512;&#20986;&#20013;&#30340;&#21306;&#22495;&#21464;&#21270;&#65292;&#30740;&#31350;&#20102;&#23545;&#28608;&#21169;&#26377;&#24046;&#24322;&#30340;&#32676;&#20307;&#30340;&#25552;&#31034;&#25928;&#26524;&#65292;&#32467;&#26524;&#26174;&#31034;&#25552;&#31034;&#23545;&#20110;&#20010;&#20154;&#26080;&#24847;&#20041;&#30340;&#36873;&#25321;&#26356;&#26377;&#25928;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25552;&#31034;&#26159;&#31185;&#23398;&#21644;&#25919;&#31574;&#19978;&#19968;&#20010;&#26032;&#20852;&#30340;&#35805;&#39064;&#65292;&#20294;&#19981;&#21516;&#28608;&#21169;&#32676;&#20307;&#20013;&#30340;&#25552;&#31034;&#25928;&#26524;&#30340;&#35777;&#25454;&#36824;&#19981;&#36275;&#12290;&#26412;&#25991;&#21033;&#29992;&#29790;&#20856;Covid-19&#30123;&#33495;&#25512;&#20986;&#36807;&#31243;&#20013;&#30340;&#21306;&#22495;&#21464;&#21270;&#65292;&#30740;&#31350;&#20102;&#23545;&#28608;&#21169;&#26377;&#24046;&#24322;&#30340;&#32676;&#20307;&#30340;&#25552;&#31034;&#25928;&#26524;&#65306;&#23545;&#20110;16-17&#23681;&#30340;&#23401;&#23376;&#65292;Covid-19&#19981;&#21361;&#38505;&#65292;&#32780;50-59&#23681;&#30340;&#20154;&#21017;&#38754;&#20020;&#30528;&#20005;&#37325;&#30142;&#30149;&#25110;&#27515;&#20129;&#30340;&#24040;&#22823;&#39118;&#38505;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#24180;&#36731;&#20154;&#30340;&#21453;&#24212;&#26174;&#33879;&#24378;&#28872;&#65292;&#36825;&#19982;&#25552;&#31034;&#23545;&#20110;&#20010;&#20154;&#26080;&#24847;&#20041;&#30340;&#36873;&#25321;&#26356;&#26377;&#25928;&#30340;&#29702;&#35770;&#30456;&#19968;&#33268;&#12290;
&lt;/p&gt;
&lt;p&gt;
Nudging is a burgeoning topic in science and in policy, but evidence on the effectiveness of nudges among differentially-incentivized groups is lacking. This paper exploits regional variations in the roll-out of the Covid-19 vaccine in Sweden to examine the effect of a nudge on groups whose intrinsic incentives are different: 16-17-year-olds, for whom Covid-19 is not dangerous, and 50-59-year-olds, who face a substantial risk of death or severe dis-ease. We find a significantly stronger response in the younger group, consistent with the theory that nudges are more effective for choices that are not meaningful to the individual.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#31038;&#20132;&#23186;&#20307;&#19978;&#30340;&#23398;&#20064;&#65292;&#21457;&#29616;&#21521;&#29992;&#25143;&#23637;&#31034;&#30149;&#27602;&#24615;&#25925;&#20107;&#21487;&#20197;&#22686;&#21152;&#20449;&#24687;&#27719;&#38598;&#65292;&#20294;&#20063;&#21487;&#33021;&#23548;&#33268;&#22823;&#22810;&#25968;&#20998;&#20139;&#30340;&#25925;&#20107;&#26159;&#38169;&#35823;&#30340;&#31283;&#23450;&#29366;&#24577;&#12290;&#36825;&#20123;&#35823;&#23548;&#24615;&#30340;&#31283;&#23450;&#29366;&#24577;&#20250;&#33258;&#25105;&#32500;&#25345;&#65292;&#23545;&#24179;&#21488;&#35774;&#35745;&#21644;&#40065;&#26834;&#24615;&#20135;&#29983;&#22810;&#31181;&#21518;&#26524;&#12290;</title><link>http://arxiv.org/abs/2210.01267</link><description>&lt;p&gt;
&#20174;&#30149;&#27602;&#24615;&#20869;&#23481;&#20013;&#23398;&#20064;
&lt;/p&gt;
&lt;p&gt;
Learning from Viral Content. (arXiv:2210.01267v2 [econ.TH] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2210.01267
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#31038;&#20132;&#23186;&#20307;&#19978;&#30340;&#23398;&#20064;&#65292;&#21457;&#29616;&#21521;&#29992;&#25143;&#23637;&#31034;&#30149;&#27602;&#24615;&#25925;&#20107;&#21487;&#20197;&#22686;&#21152;&#20449;&#24687;&#27719;&#38598;&#65292;&#20294;&#20063;&#21487;&#33021;&#23548;&#33268;&#22823;&#22810;&#25968;&#20998;&#20139;&#30340;&#25925;&#20107;&#26159;&#38169;&#35823;&#30340;&#31283;&#23450;&#29366;&#24577;&#12290;&#36825;&#20123;&#35823;&#23548;&#24615;&#30340;&#31283;&#23450;&#29366;&#24577;&#20250;&#33258;&#25105;&#32500;&#25345;&#65292;&#23545;&#24179;&#21488;&#35774;&#35745;&#21644;&#40065;&#26834;&#24615;&#20135;&#29983;&#22810;&#31181;&#21518;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#31038;&#20132;&#23186;&#20307;&#19978;&#30340;&#23398;&#20064;&#65292;&#37319;&#29992;&#20102;&#19968;&#20010;&#22343;&#34913;&#27169;&#22411;&#26469;&#25551;&#36848;&#29992;&#25143;&#19982;&#20849;&#20139;&#26032;&#38395;&#25925;&#20107;&#36827;&#34892;&#20132;&#20114;&#12290;&#29702;&#24615;&#29992;&#25143;&#25353;&#39034;&#24207;&#21040;&#36798;&#65292;&#35266;&#23519;&#21040;&#21407;&#22987;&#25925;&#20107;&#65288;&#21363;&#31169;&#26377;&#20449;&#21495;&#65289;&#21644;&#26032;&#38395;&#25512;&#36865;&#20013;&#21069;&#36744;&#25925;&#20107;&#30340;&#26679;&#26412;&#65292;&#28982;&#21518;&#20915;&#23450;&#20998;&#20139;&#21738;&#20123;&#25925;&#20107;&#12290;&#35266;&#23519;&#21040;&#30340;&#25925;&#20107;&#26679;&#26412;&#21462;&#20915;&#20110;&#21069;&#36744;&#20998;&#20139;&#30340;&#20869;&#23481;&#20197;&#21450;&#29983;&#25104;&#26032;&#38395;&#25512;&#36865;&#30340;&#25277;&#26679;&#31639;&#27861;&#12290;&#25105;&#20204;&#37325;&#28857;&#30740;&#31350;&#20102;&#36825;&#20010;&#31639;&#27861;&#22914;&#20309;&#36873;&#25321;&#26356;&#20855;&#30149;&#27602;&#24615;&#65288;&#21363;&#34987;&#24191;&#27867;&#20998;&#20139;&#65289;&#30340;&#25925;&#20107;&#30340;&#39057;&#29575;&#12290;&#21521;&#29992;&#25143;&#23637;&#31034;&#30149;&#27602;&#24615;&#25925;&#20107;&#21487;&#20197;&#22686;&#21152;&#20449;&#24687;&#27719;&#38598;&#65292;&#20294;&#20063;&#21487;&#33021;&#20135;&#29983;&#22823;&#22810;&#25968;&#20998;&#20139;&#25925;&#20107;&#38169;&#35823;&#30340;&#31283;&#23450;&#29366;&#24577;&#12290;&#36825;&#20123;&#35823;&#23548;&#24615;&#30340;&#31283;&#23450;&#29366;&#24577;&#33258;&#25105;&#25345;&#32493;&#65292;&#22240;&#20026;&#35266;&#23519;&#21040;&#38169;&#35823;&#25925;&#20107;&#30340;&#29992;&#25143;&#20250;&#24418;&#25104;&#38169;&#35823;&#30340;&#20449;&#24565;&#65292;&#20174;&#32780;&#29702;&#24615;&#22320;&#32487;&#32493;&#20998;&#20139;&#23427;&#20204;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#25551;&#36848;&#20102;&#24179;&#21488;&#35774;&#35745;&#21644;&#40065;&#26834;&#24615;&#26041;&#38754;&#30340;&#33509;&#24178;&#21518;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study learning on social media with an equilibrium model of users interacting with shared news stories. Rational users arrive sequentially, observe an original story (i.e., a private signal) and a sample of predecessors' stories in a news feed, and then decide which stories to share. The observed sample of stories depends on what predecessors share as well as the sampling algorithm generating news feeds. We focus on how often this algorithm selects more viral (i.e., widely shared) stories. Showing users viral stories can increase information aggregation, but it can also generate steady states where most shared stories are wrong. These misleading steady states self-perpetuate, as users who observe wrong stories develop wrong beliefs, and thus rationally continue to share them. Finally, we describe several consequences for platform design and robustness.
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#20026;&#21306;&#22359;&#38142;&#21435;&#20013;&#24515;&#21270;&#39046;&#22495;&#30340;&#30693;&#35782;&#31995;&#32479;&#21270;&#65292;&#25552;&#20986;&#20102;&#20998;&#31867;&#27861;&#24182;&#24314;&#35758;&#20351;&#29992;&#25351;&#25968;&#26469;&#34913;&#37327;&#21644;&#37327;&#21270;&#21306;&#22359;&#38142;&#30340;&#21435;&#20013;&#24515;&#21270;&#27700;&#24179;&#12290;&#38500;&#20102;&#20849;&#35782;&#21435;&#20013;&#24515;&#21270;&#22806;&#65292;&#20854;&#20182;&#26041;&#38754;&#30340;&#30740;&#31350;&#30456;&#23545;&#36739;&#23569;&#12290;&#36825;&#39033;&#24037;&#20316;&#20026;&#26410;&#26469;&#30340;&#30740;&#31350;&#25552;&#20379;&#20102;&#22522;&#20934;&#21644;&#25351;&#23548;&#12290;</title><link>http://arxiv.org/abs/2205.04256</link><description>&lt;p&gt;
SoK&#65306;&#21306;&#22359;&#38142;&#21435;&#20013;&#24515;&#21270;
&lt;/p&gt;
&lt;p&gt;
SoK: Blockchain Decentralization. (arXiv:2205.04256v4 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2205.04256
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#20026;&#21306;&#22359;&#38142;&#21435;&#20013;&#24515;&#21270;&#39046;&#22495;&#30340;&#30693;&#35782;&#31995;&#32479;&#21270;&#65292;&#25552;&#20986;&#20102;&#20998;&#31867;&#27861;&#24182;&#24314;&#35758;&#20351;&#29992;&#25351;&#25968;&#26469;&#34913;&#37327;&#21644;&#37327;&#21270;&#21306;&#22359;&#38142;&#30340;&#21435;&#20013;&#24515;&#21270;&#27700;&#24179;&#12290;&#38500;&#20102;&#20849;&#35782;&#21435;&#20013;&#24515;&#21270;&#22806;&#65292;&#20854;&#20182;&#26041;&#38754;&#30340;&#30740;&#31350;&#30456;&#23545;&#36739;&#23569;&#12290;&#36825;&#39033;&#24037;&#20316;&#20026;&#26410;&#26469;&#30340;&#30740;&#31350;&#25552;&#20379;&#20102;&#22522;&#20934;&#21644;&#25351;&#23548;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21306;&#22359;&#38142;&#36890;&#36807;&#22312;&#28857;&#23545;&#28857;&#32593;&#32476;&#20013;&#23454;&#29616;&#20998;&#24067;&#24335;&#20449;&#20219;&#65292;&#20026;&#21435;&#20013;&#24515;&#21270;&#32463;&#27982;&#25552;&#20379;&#20102;&#25903;&#25345;&#12290;&#28982;&#32780;&#65292;&#20196;&#20154;&#24778;&#35766;&#30340;&#26159;&#65292;&#30446;&#21069;&#36824;&#32570;&#20047;&#24191;&#27867;&#25509;&#21463;&#30340;&#21435;&#20013;&#24515;&#21270;&#23450;&#20041;&#25110;&#24230;&#37327;&#26631;&#20934;&#12290;&#25105;&#20204;&#36890;&#36807;&#20840;&#38754;&#20998;&#26512;&#29616;&#26377;&#30740;&#31350;&#65292;&#25506;&#32034;&#20102;&#21306;&#22359;&#38142;&#21435;&#20013;&#24515;&#21270;&#30340;&#30693;&#35782;&#31995;&#32479;&#21270;&#65288;SoK&#65289;&#12290;&#39318;&#20808;&#65292;&#25105;&#20204;&#36890;&#36807;&#23545;&#29616;&#26377;&#30740;&#31350;&#30340;&#23450;&#24615;&#20998;&#26512;&#65292;&#22312;&#20849;&#35782;&#12289;&#32593;&#32476;&#12289;&#27835;&#29702;&#12289;&#36130;&#23500;&#21644;&#20132;&#26131;&#31561;&#20116;&#20010;&#26041;&#38754;&#24314;&#31435;&#20102;&#29992;&#20110;&#20998;&#26512;&#21306;&#22359;&#38142;&#21435;&#20013;&#24515;&#21270;&#30340;&#20998;&#31867;&#27861;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#38500;&#20102;&#20849;&#35782;&#21435;&#20013;&#24515;&#21270;&#20197;&#22806;&#65292;&#20854;&#20182;&#26041;&#38754;&#30340;&#30740;&#31350;&#30456;&#23545;&#36739;&#23569;&#12290;&#20854;&#27425;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#25351;&#25968;&#65292;&#36890;&#36807;&#36716;&#25442;&#39321;&#20892;&#29109;&#26469;&#34913;&#37327;&#21644;&#37327;&#21270;&#21306;&#22359;&#38142;&#22312;&#19981;&#21516;&#26041;&#38754;&#30340;&#21435;&#20013;&#24515;&#21270;&#27700;&#24179;&#12290;&#25105;&#20204;&#36890;&#36807;&#27604;&#36739;&#38745;&#24577;&#27169;&#25311;&#39564;&#35777;&#20102;&#35813;&#25351;&#25968;&#30340;&#21487;&#35299;&#37322;&#24615;&#12290;&#25105;&#20204;&#36824;&#25552;&#20379;&#20102;&#20854;&#20182;&#25351;&#25968;&#30340;&#23450;&#20041;&#21644;&#35752;&#35770;&#65292;&#21253;&#25324;&#22522;&#23612;&#31995;&#25968;&#12289;&#20013;&#26412;&#32874;&#31995;&#25968;&#21644;&#36203;&#23572;&#26364;-&#36203;&#23572;&#19996;&#25351;&#25968;&#31561;&#12290;&#25105;&#20204;&#30340;&#24037;&#20316;&#27010;&#36848;&#20102;&#24403;&#21069;&#21306;&#22359;&#38142;&#21435;&#20013;&#24515;&#21270;&#30340;&#26223;&#35937;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#20010;&#37327;&#21270;&#30340;&#24230;&#37327;&#26631;&#20934;&#65292;&#20026;&#26410;&#26469;&#30340;&#30740;&#31350;&#25552;&#20379;&#22522;&#20934;&#12290;
&lt;/p&gt;
&lt;p&gt;
Blockchain empowers a decentralized economy by enabling distributed trust in a peer-to-peer network. However, surprisingly, a widely accepted definition or measurement of decentralization is still lacking. We explore a systematization of knowledge (SoK) on blockchain decentralization by comprehensively analyzing existing studies in various aspects. First, we establish a taxonomy for analyzing blockchain decentralization in the five facets of consensus, network, governance, wealth, and transaction bu qualitative analysis of existing research. We find relatively little research on aspects other than consensus decentralization. Second, we propose an index that measures and quantifies the decentralization level of blockchain across different facets by transforming Shannon entropy. We verify the explainability of the index via comparative static simulations. We also provide the definition and discussion of alternative indices including the Gini Coefficient, Nakamoto Coefficient, and Herfind
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#30740;&#31350;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#22312;&#32447;&#23454;&#39564;&#35774;&#35745;&#38382;&#39064;&#65292;&#31216;&#20026;&#8220;&#22312;&#32447;&#38459;&#22622;&#38382;&#39064;&#8221;&#65292;&#26088;&#22312;&#24179;&#34913;&#39034;&#24207;&#21040;&#36798;&#30340;&#20855;&#26377;&#24322;&#36136;&#21327;&#21464;&#20449;&#24687;&#30340;&#23454;&#39564;&#23545;&#35937;&#65292;&#20197;&#26368;&#23567;&#21270;&#24635;&#24046;&#24322;&#12290;&#20316;&#32773;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;&#8220;&#40509;&#24034;&#35774;&#35745;&#8221;&#30340;&#26041;&#27861;&#26469;&#35299;&#20915;&#35813;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2201.12936</link><description>&lt;p&gt;
&#40509;&#24034;&#35774;&#35745;&#65306;&#20174;&#22312;&#32447;&#21305;&#37197;&#30340;&#35270;&#35282;&#24179;&#34913;&#39034;&#24207;&#23454;&#39564;
&lt;/p&gt;
&lt;p&gt;
Pigeonhole Design: Balancing Sequential Experiments from an Online Matching Perspective. (arXiv:2201.12936v4 [stat.ME] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2201.12936
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#30740;&#31350;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#22312;&#32447;&#23454;&#39564;&#35774;&#35745;&#38382;&#39064;&#65292;&#31216;&#20026;&#8220;&#22312;&#32447;&#38459;&#22622;&#38382;&#39064;&#8221;&#65292;&#26088;&#22312;&#24179;&#34913;&#39034;&#24207;&#21040;&#36798;&#30340;&#20855;&#26377;&#24322;&#36136;&#21327;&#21464;&#20449;&#24687;&#30340;&#23454;&#39564;&#23545;&#35937;&#65292;&#20197;&#26368;&#23567;&#21270;&#24635;&#24046;&#24322;&#12290;&#20316;&#32773;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;&#8220;&#40509;&#24034;&#35774;&#35745;&#8221;&#30340;&#26041;&#27861;&#26469;&#35299;&#20915;&#35813;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#23454;&#36341;&#32773;&#21644;&#23398;&#32773;&#38271;&#26399;&#20197;&#26469;&#37117;&#35748;&#35782;&#21040;&#23454;&#39564;&#23545;&#20844;&#21496;&#24102;&#26469;&#30340;&#22909;&#22788;&#12290;&#28982;&#32780;&#65292;&#23545;&#20110;&#36816;&#34892;&#22312;&#32447;A/B&#27979;&#35797;&#30340;&#38754;&#21521;Web&#30340;&#20844;&#21496;&#26469;&#35828;&#65292;&#22312;&#39034;&#24207;&#21040;&#36798;&#23454;&#39564;&#23545;&#35937;&#26102;&#24179;&#34913;&#21327;&#21464;&#20449;&#24687;&#20173;&#28982;&#20855;&#26377;&#25361;&#25112;&#24615;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#22312;&#32447;&#23454;&#39564;&#35774;&#35745;&#38382;&#39064;&#65292;&#25105;&#20204;&#31216;&#20043;&#20026;&#8220;&#22312;&#32447;&#38459;&#22622;&#38382;&#39064;&#8221;&#12290;&#22312;&#36825;&#20010;&#38382;&#39064;&#20013;&#65292;&#20855;&#26377;&#24322;&#36136;&#21327;&#21464;&#20449;&#24687;&#30340;&#23454;&#39564;&#23545;&#35937;&#25353;&#39034;&#24207;&#21040;&#36798;&#65292;&#24517;&#39035;&#31435;&#21363;&#20998;&#37197;&#21040;&#25511;&#21046;&#32452;&#25110;&#22788;&#29702;&#32452;&#20013;&#65292;&#30446;&#26631;&#26159;&#26368;&#23567;&#21270;&#24635;&#24046;&#24322;&#65292;&#21363;&#20004;&#32452;&#20043;&#38388;&#30340;&#26368;&#23567;&#26435;&#37325;&#23436;&#32654;&#21305;&#37197;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#23454;&#39564;&#35774;&#35745;&#26041;&#27861;&#65292;&#31216;&#20026;&#8220;&#40509;&#24034;&#35774;&#35745;&#8221;&#12290;&#40509;&#24034;&#35774;&#35745;&#39318;&#20808;&#23558;&#21327;&#21464;&#31354;&#38388;&#21010;&#20998;&#20026;&#36739;&#23567;&#30340;&#31354;&#38388;&#65292;&#25105;&#20204;&#31216;&#20043;&#20026;&#40509;&#24034;&#65292;&#28982;&#21518;&#22312;&#27599;&#20010;&#40509;&#24034;&#20013;&#21040;&#36798;&#23454;&#39564;&#23545;&#35937;&#26102;&#12290;
&lt;/p&gt;
&lt;p&gt;
Practitioners and academics have long appreciated the benefits that experimentation brings to firms. For web-facing firms running online A/B tests, however, it still remains challenging in balancing covariate information when experimental subjects arrive sequentially. In this paper, we study a novel online experimental design problem, which we refer to as the "Online Blocking Problem." In this problem, experimental subjects with heterogeneous covariate information arrive sequentially and must be immediately assigned into either the control or the treatment group, with an objective of minimizing the total discrepancy, which is defined as the minimum weight perfect matching between the two groups. To solve this problem, we propose a novel experimental design approach, which we refer to as the "Pigeonhole Design." The pigeonhole design first partitions the covariate space into smaller spaces, which we refer to as pigeonholes, and then, when the experimental subjects arrive at each pigeonh
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#19968;&#31181;&#35745;&#31639;&#26041;&#27861;&#65292;&#33021;&#22815;&#22312;&#23384;&#22312;&#26410;&#35266;&#23519;&#21040;&#30340;&#24322;&#36136;&#24615;&#21644;&#20165;&#26377;&#20108;&#20540;&#24037;&#20855;&#21464;&#37327;&#30340;&#24773;&#20917;&#19979;&#65292;&#25512;&#24191;&#23616;&#37096;&#27835;&#30103;&#25928;&#24212;&#21040;&#19981;&#21516;&#30340;&#21453;&#20107;&#23454;&#24773;&#22659;&#65292;&#24182;&#19988;&#25552;&#20986;&#20102;&#19968;&#20010;&#26032;&#30340;&#26694;&#26550;&#65292;&#21487;&#20197;&#31995;&#32479;&#22320;&#35745;&#31639;&#21508;&#31181;&#19982;&#25919;&#31574;&#30456;&#20851;&#30340;&#27835;&#30103;&#21442;&#25968;&#30340;&#23574;&#38160;&#38750;&#21442;&#25968;&#30028;&#38480;&#12290;</title><link>http://arxiv.org/abs/2009.13861</link><description>&lt;p&gt;
&#19968;&#31181;&#29992;&#20110;&#25919;&#31574;&#35780;&#20272;&#30340;&#27835;&#30103;&#25928;&#26524;&#35782;&#21035;&#30340;&#35745;&#31639;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
A Computational Approach to Identification of Treatment Effects for Policy Evaluation. (arXiv:2009.13861v3 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2009.13861
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#19968;&#31181;&#35745;&#31639;&#26041;&#27861;&#65292;&#33021;&#22815;&#22312;&#23384;&#22312;&#26410;&#35266;&#23519;&#21040;&#30340;&#24322;&#36136;&#24615;&#21644;&#20165;&#26377;&#20108;&#20540;&#24037;&#20855;&#21464;&#37327;&#30340;&#24773;&#20917;&#19979;&#65292;&#25512;&#24191;&#23616;&#37096;&#27835;&#30103;&#25928;&#24212;&#21040;&#19981;&#21516;&#30340;&#21453;&#20107;&#23454;&#24773;&#22659;&#65292;&#24182;&#19988;&#25552;&#20986;&#20102;&#19968;&#20010;&#26032;&#30340;&#26694;&#26550;&#65292;&#21487;&#20197;&#31995;&#32479;&#22320;&#35745;&#31639;&#21508;&#31181;&#19982;&#25919;&#31574;&#30456;&#20851;&#30340;&#27835;&#30103;&#21442;&#25968;&#30340;&#23574;&#38160;&#38750;&#21442;&#25968;&#30028;&#38480;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#23545;&#20110;&#21453;&#20107;&#23454;&#25919;&#31574;&#35780;&#20272;&#65292;&#30830;&#20445;&#27835;&#30103;&#21442;&#25968;&#19982;&#25152;&#35752;&#35770;&#30340;&#25919;&#31574;&#30456;&#20851;&#38750;&#24120;&#37325;&#35201;&#12290;&#22312;&#23384;&#22312;&#26410;&#35266;&#23519;&#21040;&#30340;&#24322;&#36136;&#24615;&#30340;&#24773;&#20917;&#19979;&#65292;&#36825;&#19968;&#28857;&#23588;&#20026;&#20855;&#26377;&#25361;&#25112;&#24615;&#65292;&#32780;&#36825;&#22312;&#23616;&#37096;&#24179;&#22343;&#27835;&#30103;&#25928;&#24212;&#65288;LATE&#65289;&#30340;&#23450;&#20041;&#20013;&#24471;&#21040;&#20102;&#24456;&#22909;&#30340;&#20307;&#29616;&#12290;&#20316;&#20026;&#20869;&#22312;&#30340;&#23616;&#37096;&#25928;&#24212;&#65292;LATE&#24050;&#30693;&#22312;&#21453;&#20107;&#23454;&#29615;&#22659;&#19979;&#32570;&#20047;&#22806;&#37096;&#25928;&#24230;&#12290;&#26412;&#25991;&#30740;&#31350;&#20102;&#24403;&#24037;&#20855;&#21464;&#37327;&#20165;&#20026;&#20108;&#20540;&#26102;&#65292;&#23558;&#23616;&#37096;&#27835;&#30103;&#25928;&#24212;&#25512;&#24191;&#21040;&#19981;&#21516;&#21453;&#20107;&#23454;&#24773;&#22659;&#30340;&#21487;&#33021;&#24615;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#26032;&#30340;&#26694;&#26550;&#65292;&#31995;&#32479;&#22320;&#35745;&#31639;&#21508;&#31181;&#19982;&#25919;&#31574;&#30456;&#20851;&#30340;&#27835;&#30103;&#21442;&#25968;&#30340;&#23574;&#38160;&#38750;&#21442;&#25968;&#30028;&#38480;&#65292;&#36825;&#20123;&#21442;&#25968;&#34987;&#23450;&#20041;&#20026;&#36793;&#38469;&#27835;&#30103;&#25928;&#24212;&#65288;MTE&#65289;&#30340;&#21152;&#26435;&#24179;&#22343;&#12290;&#25105;&#20204;&#30340;&#26694;&#26550;&#36275;&#22815;&#28789;&#27963;&#65292;&#33021;&#22815;&#20805;&#20998;&#34701;&#20837;&#24037;&#20855;&#21464;&#37327;&#30340;&#32479;&#35745;&#29420;&#31435;&#24615;&#65288;&#32780;&#19981;&#20165;&#20165;&#26159;&#22343;&#20540;&#29420;&#31435;&#24615;&#65289;&#65292;&#24182;&#19988;&#33021;&#22815;&#32771;&#34385;&#22810;&#31181;&#24418;&#29366;&#32422;&#26463;&#20043;&#22806;&#30340;&#37492;&#23450;&#20551;&#35774;&#65292;&#36825;&#20123;&#24418;&#29366;&#32422;&#26463;&#22312;&#20043;&#21069;&#30340;&#30740;&#31350;&#20013;&#24050;&#32463;&#34987;&#32771;&#34385;&#36807;&#20102;&#12290;
&lt;/p&gt;
&lt;p&gt;
For counterfactual policy evaluation, it is important to ensure that treatment parameters are relevant to policies in question. This is especially challenging under unobserved heterogeneity, as is well featured in the definition of the local average treatment effect (LATE). Being intrinsically local, the LATE is known to lack external validity in counterfactual environments. This paper investigates the possibility of extrapolating local treatment effects to different counterfactual settings when instrumental variables are only binary. We propose a novel framework to systematically calculate sharp nonparametric bounds on various policy-relevant treatment parameters that are defined as weighted averages of the marginal treatment effect (MTE). Our framework is flexible enough to fully incorporate statistical independence (rather than mean independence) of instruments and a large menu of identifying assumptions beyond the shape restrictions on the MTE that have been considered in prior stu
&lt;/p&gt;</description></item></channel></rss>