<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#26412;&#30740;&#31350;&#20998;&#26512;&#20102;&#36798;&#21345;&#32929;&#31080;&#20132;&#26131;&#25152;&#32929;&#31080;&#20215;&#26684;&#19982;&#23439;&#35266;&#32463;&#27982;&#21464;&#37327;&#20043;&#38388;&#30340;&#38271;&#26399;&#20851;&#31995;&#65292;&#32467;&#26524;&#34920;&#26126;&#28040;&#36153;&#20215;&#26684;&#25351;&#25968;&#12289;&#36135;&#24065;&#20379;&#24212;&#21644;&#27719;&#29575;&#19982;&#32929;&#31080;&#22238;&#25253;&#23494;&#20999;&#30456;&#20851;&#65292;&#32780;&#24066;&#22330;&#36164;&#26412;&#21270;&#19982;&#32929;&#31080;&#22238;&#25253;&#21576;&#36127;&#30456;&#20851;&#12290;</title><link>http://arxiv.org/abs/2305.02229</link><description>&lt;p&gt;
&#23439;&#35266;&#32463;&#27982;&#22240;&#32032;&#19982;&#32929;&#31080;&#24066;&#22330;&#22238;&#25253;&#65306;&#19968;&#39033;&#32479;&#35745;&#20998;&#26512;
&lt;/p&gt;
&lt;p&gt;
Macroeconomic factors and Stock exchange return: A Statistical Analysis. (arXiv:2305.02229v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.02229
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#20998;&#26512;&#20102;&#36798;&#21345;&#32929;&#31080;&#20132;&#26131;&#25152;&#32929;&#31080;&#20215;&#26684;&#19982;&#23439;&#35266;&#32463;&#27982;&#21464;&#37327;&#20043;&#38388;&#30340;&#38271;&#26399;&#20851;&#31995;&#65292;&#32467;&#26524;&#34920;&#26126;&#28040;&#36153;&#20215;&#26684;&#25351;&#25968;&#12289;&#36135;&#24065;&#20379;&#24212;&#21644;&#27719;&#29575;&#19982;&#32929;&#31080;&#22238;&#25253;&#23494;&#20999;&#30456;&#20851;&#65292;&#32780;&#24066;&#22330;&#36164;&#26412;&#21270;&#19982;&#32929;&#31080;&#22238;&#25253;&#21576;&#36127;&#30456;&#20851;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#26088;&#22312;&#30740;&#31350;&#36798;&#21345;&#32929;&#31080;&#20132;&#26131;&#25152;&#25351;&#25968;&#22238;&#25253;&#19982;&#27719;&#29575;&#12289;&#36890;&#36135;&#33192;&#32960;&#12289;&#36135;&#24065;&#20379;&#24212;&#31561;&#23439;&#35266;&#32463;&#27982;&#21464;&#37327;&#20043;&#38388;&#30340;&#20851;&#31995;&#12290;&#36890;&#36807;&#20351;&#29992;&#32422;&#32752;&#36874;&#20849;&#25972;&#21512;&#26816;&#39564;&#12289;&#22686;&#24191;&#36842;&#22522;-&#31119;&#21202;&#65288;ADF&#65289;&#21644;&#33778;&#21033;&#26222;&#183;&#20329;&#38534;&#65288;PP&#65289;&#26816;&#39564;&#20998;&#26512;&#20102;&#23439;&#35266;&#32463;&#27982;&#21464;&#37327;&#19982;&#32929;&#31080;&#24066;&#22330;&#22238;&#25253;&#20043;&#38388;&#30340;&#38271;&#26399;&#20851;&#31995;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;&#36798;&#21345;&#32929;&#31080;&#20132;&#26131;&#25152;&#32929;&#31080;&#20215;&#26684;&#19982;&#23439;&#35266;&#32463;&#27982;&#21464;&#37327;&#20043;&#38388;&#23384;&#22312;&#21327;&#25972;&#20851;&#31995;&#12290;&#28040;&#36153;&#20215;&#26684;&#25351;&#25968;&#12289;&#36135;&#24065;&#20379;&#24212;&#21644;&#27719;&#29575;&#19982;&#32929;&#31080;&#22238;&#25253;&#23494;&#20999;&#30456;&#20851;&#65292;&#32780;&#24066;&#22330;&#36164;&#26412;&#21270;&#19982;&#32929;&#31080;&#22238;&#25253;&#21576;&#36127;&#30456;&#20851;&#12290;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;&#38271;&#26399;&#26469;&#30475;&#65292;&#36798;&#21345;&#32929;&#31080;&#20132;&#26131;&#25152;&#23545;&#23439;&#35266;&#32463;&#27982;&#25351;&#26631;&#20855;&#26377;&#21453;&#24212;&#33021;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;
The purpose of this research is to examine the relationship between the Dhaka Stock exchange index return and macroeconomic variables such as exchange rate, inflation, money supply etc. The long-term relationship between macroeconomic variables and stock market returns has been analyzed by using the Johnson Cointegration test, Augmented Dicky Fuller (ADF) and Phillip Perron (PP) tests. The results revealed the existence of cointegrating relationship between stock prices and the macroeconomic variables in the Dhaka stock exchange. The consumer price index, money supply, and exchange rates proved to be strongly associated with stock returns, while market capitalization was found to be negatively associated with stock returns. The findings suggest that in the long run, the Dhaka stock exchange is reactive to macroeconomic indicators.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#21452;&#37325;&#31283;&#20581;&#25512;&#26029;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#21487;&#29992;&#20110;&#26500;&#24314;&#22312;&#24046;&#20998;&#20013;&#30340;&#32452;&#26102;&#38388;&#26465;&#20214;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#20989;&#25968;&#30340;&#19968;&#33268;&#32622;&#20449;&#24102;&#12290;</title><link>http://arxiv.org/abs/2305.02185</link><description>&lt;p&gt;
&#21452;&#37325;&#31283;&#20581;&#19968;&#33268;&#32622;&#20449;&#24102;&#22312;&#24046;&#20998;&#20013;&#30340;&#32452;&#26102;&#38388;&#26465;&#20214;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#20013;&#30340;&#24212;&#29992;
&lt;/p&gt;
&lt;p&gt;
Doubly Robust Uniform Confidence Bands for Group-Time Conditional Average Treatment Effects in Difference-in-Differences. (arXiv:2305.02185v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.02185
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#21452;&#37325;&#31283;&#20581;&#25512;&#26029;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#21487;&#29992;&#20110;&#26500;&#24314;&#22312;&#24046;&#20998;&#20013;&#30340;&#32452;&#26102;&#38388;&#26465;&#20214;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#20989;&#25968;&#30340;&#19968;&#33268;&#32622;&#20449;&#24102;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#32771;&#34385;&#20102;&#23545;&#38754;&#26495;&#25968;&#25454;&#36827;&#34892;&#20998;&#26512;&#65292;&#20197;&#30740;&#31350;&#22312;Callaway&#21644;Sant'Anna&#65288;2021&#65289;&#30340;&#38169;&#20301;&#24046;&#20998;&#35774;&#32622;&#20013;&#65292;&#38024;&#23545;&#24863;&#20852;&#36259;&#30340;&#39044;&#22788;&#29702;&#21327;&#21464;&#37327;&#30340;&#27835;&#30103;&#25928;&#24212;&#24322;&#36136;&#24615;&#12290;&#22312;&#19968;&#32452;&#26631;&#20934;&#35782;&#21035;&#26465;&#20214;&#19979;&#65292;&#19968;&#20010;&#22522;&#20110;&#21327;&#21464;&#37327;&#30340;&#21452;&#37325;&#31283;&#20581;&#20272;&#35745;&#20540;&#35782;&#21035;&#20102;&#32473;&#23450;&#21327;&#21464;&#37327;&#30340;&#32452;&#26102;&#38388;&#26465;&#20214;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#12290;&#37492;&#20110;&#36825;&#20010;&#35782;&#21035;&#32467;&#26524;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#22522;&#20110;&#38750;&#21442;&#25968;&#23616;&#37096;&#32447;&#24615;&#22238;&#24402;&#21644;&#21442;&#25968;&#20272;&#35745;&#26041;&#27861;&#30340;&#19977;&#27493;&#20272;&#35745;&#31243;&#24207;&#65292;&#24182;&#24320;&#21457;&#20102;&#19968;&#20010;&#21452;&#37325;&#31283;&#20581;&#25512;&#26029;&#26041;&#27861;&#26469;&#26500;&#24314;&#32452;&#26102;&#38388;&#26465;&#20214;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#20989;&#25968;&#30340;&#19968;&#33268;&#32622;&#20449;&#24102;&#12290;
&lt;/p&gt;
&lt;p&gt;
This study considers a panel data analysis to examine the heterogeneity in treatment effects with respect to a pre-treatment covariate of interest in the staggered difference-in-differences setting in Callaway and Sant'Anna (2021). Under a set of standard identification conditions, a doubly robust estimand conditional on the covariate identifies the group-time conditional average treatment effect given the covariate. Given this identification result, we propose a three-step estimation procedure based on nonparametric local linear regressions and parametric estimation methods, and develop a doubly robust inference method to construct a uniform confidence band of the group-time conditional average treatment effect function.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#32654;&#22269;878&#20010;&#22320;&#26041;&#36758;&#21306;&#22312;2010-2020&#24180;&#38388;&#22303;&#22320;&#21033;&#29992;&#31649;&#21046;&#20005;&#26684;&#31243;&#24230;&#23545;&#38646;&#21806;&#12289;&#19987;&#19994;&#21644;&#20449;&#24687;&#19977;&#20010;&#34892;&#19994;&#23601;&#19994;&#22686;&#38271;&#30340;&#24433;&#21709;&#65292;&#32467;&#26524;&#34920;&#26126;&#36807;&#24230;&#30340;&#22303;&#22320;&#21033;&#29992;&#31649;&#21046;&#20005;&#26684;&#31243;&#24230;&#20351;&#24471;&#20303;&#25151;&#25104;&#26412;&#36127;&#25285;&#22686;&#21152;&#65292;&#20303;&#25151;&#25104;&#26412;&#36127;&#25285;&#25104;&#20026;&#20102;&#38459;&#30861;&#23601;&#19994;&#22686;&#38271;&#30340;&#20013;&#20171;&#21464;&#37327;&#65292;&#20449;&#24687;&#34892;&#19994;&#30340;&#25928;&#24212;&#26368;&#20026;&#26126;&#26174;&#12290;</title><link>http://arxiv.org/abs/2305.02159</link><description>&lt;p&gt;
&#22303;&#22320;&#21033;&#29992;&#31649;&#21046;&#20005;&#26684;&#31243;&#24230;&#19982;&#23601;&#19994;&#21160;&#24577;&#20851;&#31995;&#30340;&#20013;&#20171;&#20998;&#26512;
&lt;/p&gt;
&lt;p&gt;
A Mediation Analysis of the Relationship Between Land Use Regulation Stringency and Employment Dynamics. (arXiv:2305.02159v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.02159
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#32654;&#22269;878&#20010;&#22320;&#26041;&#36758;&#21306;&#22312;2010-2020&#24180;&#38388;&#22303;&#22320;&#21033;&#29992;&#31649;&#21046;&#20005;&#26684;&#31243;&#24230;&#23545;&#38646;&#21806;&#12289;&#19987;&#19994;&#21644;&#20449;&#24687;&#19977;&#20010;&#34892;&#19994;&#23601;&#19994;&#22686;&#38271;&#30340;&#24433;&#21709;&#65292;&#32467;&#26524;&#34920;&#26126;&#36807;&#24230;&#30340;&#22303;&#22320;&#21033;&#29992;&#31649;&#21046;&#20005;&#26684;&#31243;&#24230;&#20351;&#24471;&#20303;&#25151;&#25104;&#26412;&#36127;&#25285;&#22686;&#21152;&#65292;&#20303;&#25151;&#25104;&#26412;&#36127;&#25285;&#25104;&#20026;&#20102;&#38459;&#30861;&#23601;&#19994;&#22686;&#38271;&#30340;&#20013;&#20171;&#21464;&#37327;&#65292;&#20449;&#24687;&#34892;&#19994;&#30340;&#25928;&#24212;&#26368;&#20026;&#26126;&#26174;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#26088;&#22312;&#30740;&#31350;&#32654;&#22269;878&#20010;&#22320;&#26041;&#36758;&#21306;&#65288;2010-2020&#24180;&#65289;&#20851;&#20110;&#23621;&#20303;&#29992;&#36884;&#31649;&#21046;&#25351;&#25968;&#65288;WRLURI&#65289;&#20005;&#26684;&#31243;&#24230;&#23545;&#38646;&#21806;&#12289;&#19987;&#19994;&#21644;&#20449;&#24687;&#19977;&#20010;&#34892;&#19994;&#23601;&#19994;&#22686;&#38271;&#30340;&#24433;&#21709;&#12290;&#26412;&#25991;&#37319;&#29992;&#20013;&#20171;&#20998;&#26512;&#26694;&#26550;&#65292;&#30740;&#31350;&#22303;&#22320;&#21033;&#29992;&#31649;&#21046;&#20005;&#26684;&#31243;&#24230;&#23545;&#34892;&#19994;&#23601;&#19994;&#22686;&#38271;&#21644;&#19987;&#19994;&#21270;&#30340;&#30452;&#25509;&#24433;&#21709;&#21644;&#38388;&#25509;&#24433;&#21709;&#12290;&#20998;&#26512;&#32467;&#26524;&#34920;&#26126;&#65292;&#36807;&#24230;&#30340;&#22303;&#22320;&#21033;&#29992;&#31649;&#21046;&#20005;&#26684;&#31243;&#24230;&#19982;&#20303;&#25151;&#25104;&#26412;&#36127;&#25285;&#20043;&#38388;&#23384;&#22312;&#23436;&#20840;&#20013;&#20171;&#30340;&#20851;&#31995;&#65292;&#24182;&#19988;&#20303;&#25151;&#25104;&#26412;&#36127;&#25285;&#26159;&#20013;&#20171;&#21464;&#37327;&#65292;&#36825;&#38459;&#30861;&#20102;&#23601;&#19994;&#22686;&#38271;&#65292;&#20449;&#24687;&#34892;&#19994;&#30340;&#25928;&#24212;&#26368;&#20026;&#26126;&#26174;&#12290;
&lt;/p&gt;
&lt;p&gt;
The paper examines the effects of stringent land use regulations, measured using the Wharton Residential Land Use Regulatory Index (WRLURI), on employment growth during the period 2010-2020 in the Retail, Professional, and Information sectors across 878 local jurisdictions in the United States. All the local jurisdictions exist in both (2006 and 2018) waves of the WRLURI surveys and hence constitute a unique panel data. We apply a mediation analytical framework to decompose the direct and indirect effects of land use regulation stringency on sectoral employment growth and specialization. Our analysis suggests a fully mediated pattern in the relationship between excessive land use regulations and employment growth, with housing cost burden as the mediator. Specifically, a one standard deviation increase in the WRLURI index is associated with an approximate increase of 0.8 percentage point in the proportion of cost burdened renters. Relatedly, higher prevalence of cost-burdened renters h
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#20998;&#26512;&#25913;&#38761;&#24320;&#25918;&#20197;&#26469;&#20013;&#22269;&#22478;&#20065;&#23621;&#27665;&#28040;&#36153;&#19982;&#32463;&#27982;&#22686;&#38271;&#30340;&#20851;&#31995;&#65292;&#24471;&#20986;&#22478;&#24066;&#28040;&#36153;&#21644;&#20892;&#26449;&#28040;&#36153;&#30340;&#22686;&#21152;&#21487;&#20197;&#20419;&#36827;&#32463;&#27982;&#22686;&#38271;&#24182;&#19988;&#22478;&#24066;&#28040;&#36153;&#26356;&#26377;&#21033;&#20110;&#32463;&#27982;&#22686;&#38271;&#30340;&#32467;&#35770;&#65292;&#25552;&#20986;&#30456;&#20851;&#25919;&#31574;&#24314;&#35758;&#12290;</title><link>http://arxiv.org/abs/2305.02138</link><description>&lt;p&gt;
&#25913;&#38761;&#24320;&#25918;&#20197;&#26469;&#20013;&#22269;&#22478;&#20065;&#23621;&#27665;&#28040;&#36153;&#19982;&#32463;&#27982;&#22686;&#38271;&#30340;&#20851;&#31995;&#8212;&#8212;&#22522;&#20110;&#35745;&#37327;&#32463;&#27982;&#23398;&#27169;&#22411;&#30340;&#23454;&#35777;&#20998;&#26512;
&lt;/p&gt;
&lt;p&gt;
The Relationship between Consumption and Economic Growth of Chinese Urban and Rural Residents since Reform and Opening-up -- An Empirical Analysis Based on Econometrics Models. (arXiv:2305.02138v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.02138
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20998;&#26512;&#25913;&#38761;&#24320;&#25918;&#20197;&#26469;&#20013;&#22269;&#22478;&#20065;&#23621;&#27665;&#28040;&#36153;&#19982;&#32463;&#27982;&#22686;&#38271;&#30340;&#20851;&#31995;&#65292;&#24471;&#20986;&#22478;&#24066;&#28040;&#36153;&#21644;&#20892;&#26449;&#28040;&#36153;&#30340;&#22686;&#21152;&#21487;&#20197;&#20419;&#36827;&#32463;&#27982;&#22686;&#38271;&#24182;&#19988;&#22478;&#24066;&#28040;&#36153;&#26356;&#26377;&#21033;&#20110;&#32463;&#27982;&#22686;&#38271;&#30340;&#32467;&#35770;&#65292;&#25552;&#20986;&#30456;&#20851;&#25919;&#31574;&#24314;&#35758;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25913;&#38761;&#24320;&#25918;&#22235;&#21313;&#24180;&#26469;&#65292;&#20013;&#22269;&#22312;&#32463;&#27982;&#39046;&#22495;&#21462;&#24471;&#20102;&#26174;&#33879;&#30340;&#25104;&#23601;&#65292;&#32780;&#20854;&#20013;&#28040;&#36153;&#27963;&#21160;&#65292;&#21253;&#25324;&#23478;&#24237;&#28040;&#36153;&#22312;&#20869;&#65292;&#21457;&#25381;&#20102;&#37325;&#35201;&#20316;&#29992;&#12290;&#28040;&#36153;&#27963;&#21160;&#26159;&#32463;&#27982;&#27963;&#21160;&#30340;&#32456;&#28857;&#65292;&#22240;&#20026;&#20854;&#20182;&#32463;&#27982;&#27963;&#21160;&#30340;&#26368;&#32456;&#30446;&#30340;&#26159;&#28385;&#36275;&#28040;&#36153;&#38656;&#27714;&#65307;&#28040;&#36153;&#27963;&#21160;&#26159;&#32463;&#27982;&#27963;&#21160;&#30340;&#36215;&#28857;&#65292;&#22240;&#20026;&#28040;&#36153;&#21487;&#20197;&#25512;&#21160;&#32463;&#27982;&#21644;&#31038;&#20250;&#21457;&#23637;&#12290;&#26412;&#25991;&#36873;&#25321;&#20102;&#25913;&#38761;&#24320;&#25918;&#20197;&#26469;40&#22810;&#24180;&#30340;&#32463;&#27982;&#25968;&#25454;&#65292;&#24314;&#31435;&#20102;&#21521;&#37327;&#33258;&#22238;&#24402;&#65288;VAR&#65289;&#27169;&#22411;&#21644;&#21521;&#37327;&#35823;&#24046;&#32416;&#27491;&#65288;VEC&#65289;&#27169;&#22411;&#65292;&#20998;&#26512;&#20102;&#22478;&#20065;&#23621;&#27665;&#28040;&#36153;&#27700;&#24179;&#21644;&#24635;&#28040;&#36153;&#23545;&#32463;&#27982;&#22686;&#38271;&#30340;&#24433;&#21709;&#12290;&#32467;&#35770;&#26159;&#22478;&#24066;&#28040;&#36153;&#21644;&#20892;&#26449;&#28040;&#36153;&#30340;&#22686;&#21152;&#21487;&#20197;&#23548;&#33268;GDP&#30340;&#22686;&#38271;&#65292;&#22312;&#38271;&#26399;&#20869;&#65292;&#22478;&#24066;&#28040;&#36153;&#21487;&#20197;&#27604;&#20892;&#26449;&#28040;&#36153;&#26356;&#33021;&#20419;&#36827;&#32463;&#27982;&#22686;&#38271;&#12290;&#25454;&#27492;&#65292;&#25105;&#20204;&#20998;&#26512;&#20102;&#21407;&#22240;&#24182;&#25552;&#20986;&#20102;&#30456;&#20851;&#25919;&#31574;&#24314;&#35758;&#12290;
&lt;/p&gt;
&lt;p&gt;
Since Reform and Opening-up 40 years ago, China has made remarkable achievements in economic fields. And consumption activities, including household consumption, have played an important role in it. Consumer activity is the end of economic activity, because the ultimate aim of other economic activities is to meet consumer demand; consumer activity is the starting point of economic activity, because consumption can drive economic and social development. This paper selects the economic data of more than 40 years since Reform and Opening-up, and establishes the Vector Autoregressive (VAR) model and Vector Error Correction (VEC) model, analyzing the influence of consumption level and total consumption of urban and rural residents on economic growth. The conclusion is that the increase of urban consumption and rural consumption can lead to the increase of GDP, and in the long run, urban consumption can promote economic growth more than rural consumption. According to this conclusion, we ana
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#27604;&#36739;&#20102;&#21619;&#36947;&#20914;&#20987;&#21644;&#40657;&#31665;&#20248;&#21270;&#22120;&#20004;&#31181;&#26041;&#27861;&#35299;&#20915;&#21160;&#24577;&#35268;&#21010;&#38382;&#39064;&#30340;&#20248;&#32570;&#28857;&#65292;&#21457;&#29616;&#21619;&#36947;&#20914;&#20987;&#22312;&#22810;&#32500;&#38382;&#39064;&#20013;&#26080;&#27861;&#23454;&#29616;&#25910;&#25947;&#12290;&#23545;&#20110;&#26080;&#27861;&#36731;&#26494;&#35745;&#31639;&#23548;&#25968;&#30340;&#24773;&#20917;&#65292;&#25105;&#20204;&#25512;&#33616;&#20351;&#29992;Nelder-Mead&#19979;&#23665;&#21333;&#32431;&#24418;&#31639;&#27861;&#12289; Powell&#26041;&#21521;&#38598;&#31639;&#27861;&#21644;&#20849;&#36717;&#26799;&#24230;&#26041;&#27861;BOBYQA&#31561;&#20248;&#21270;&#31639;&#27861;&#12290;</title><link>http://arxiv.org/abs/2305.02027</link><description>&lt;p&gt;
&#40657;&#31665;&#20248;&#21270;&#22120; vs &#21619;&#36947;&#20914;&#20987;
&lt;/p&gt;
&lt;p&gt;
Black-box Optimizers vs Taste Shocks. (arXiv:2305.02027v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.02027
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#27604;&#36739;&#20102;&#21619;&#36947;&#20914;&#20987;&#21644;&#40657;&#31665;&#20248;&#21270;&#22120;&#20004;&#31181;&#26041;&#27861;&#35299;&#20915;&#21160;&#24577;&#35268;&#21010;&#38382;&#39064;&#30340;&#20248;&#32570;&#28857;&#65292;&#21457;&#29616;&#21619;&#36947;&#20914;&#20987;&#22312;&#22810;&#32500;&#38382;&#39064;&#20013;&#26080;&#27861;&#23454;&#29616;&#25910;&#25947;&#12290;&#23545;&#20110;&#26080;&#27861;&#36731;&#26494;&#35745;&#31639;&#23548;&#25968;&#30340;&#24773;&#20917;&#65292;&#25105;&#20204;&#25512;&#33616;&#20351;&#29992;Nelder-Mead&#19979;&#23665;&#21333;&#32431;&#24418;&#31639;&#27861;&#12289; Powell&#26041;&#21521;&#38598;&#31639;&#27861;&#21644;&#20849;&#36717;&#26799;&#24230;&#26041;&#27861;BOBYQA&#31561;&#20248;&#21270;&#31639;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#35780;&#20272;&#21644;&#25193;&#23637;&#20102;&#21160;&#24577;&#35268;&#21010;&#20013;&#20855;&#26377;&#20108;&#20803;&#21644;&#22810;&#36830;&#32493;&#36873;&#25321;&#21464;&#37327;&#30340;&#27169;&#22411;&#30340;&#35299;&#20915;&#26041;&#27861;&#65292;&#29305;&#21035;&#26159;&#22312;&#31163;&#25955;&#29366;&#24577;&#31354;&#38388;&#35299;&#20915;&#26041;&#27861;&#19981;&#21487;&#34892;&#30340;&#24773;&#20917;&#19979;&#12290;&#22240;&#27492;&#65292;&#25105;&#20204;&#20351;&#29992;&#24212;&#29992;&#25968;&#23398;&#23478;&#29992;&#20110;&#22522;&#20934;&#27979;&#35797;&#31639;&#27861;&#30340;&#21619;&#36947;&#20914;&#20987;&#25110;&#40657;&#30418;&#20248;&#21270;&#22120;&#26469;&#36817;&#20284;&#35299;&#20915;&#26041;&#26696;&#12290;&#25105;&#20204;&#23558;&#36825;&#20123;&#26041;&#27861;&#24212;&#29992;&#20110;&#19968;&#20010;&#40664;&#35748;&#26694;&#26550;&#65292;&#20854;&#20013;&#20195;&#29702;&#24517;&#39035;&#35299;&#20915;&#20855;&#26377;&#38271;&#26399;&#20538;&#21153;&#30340;&#25237;&#36164;&#32452;&#21512;&#38382;&#39064;&#12290;&#25105;&#20204;&#34920;&#26126;&#65292;&#35299;&#20915;&#26041;&#26696;&#26041;&#27861;&#30340;&#36873;&#25321;&#24456;&#37325;&#35201;&#65292;&#22240;&#20026;&#21619;&#36947;&#38663;&#33633;&#22312;&#22810;&#32500;&#38382;&#39064;&#20013;&#26080;&#27861;&#23454;&#29616;&#25910;&#25947;&#12290;&#25105;&#20204;&#27604;&#36739;&#20102;&#20351;&#29992;&#22235;&#20010;&#20248;&#21270;&#31639;&#27861;&#30340;&#30456;&#23545;&#20248;&#21183;&#65306;Nelder-Mead&#19979;&#23665;&#21333;&#32431;&#24418;&#31639;&#27861;&#65292;&#24102;LINMIN&#30340;Powell&#26041;&#21521;&#38598;&#31639;&#27861;&#65292;&#20849;&#36717;&#26799;&#24230;&#26041;&#27861;BOBYQA&#21644;&#25311;&#29275;&#39039;Davidon-Fletcher-Powell&#65288;DFPMIN&#65289;&#31639;&#27861;&#12290;&#25152;&#26377;&#36825;&#20123;&#26041;&#27861;&#38500;&#20102;&#26368;&#21518;&#19968;&#31181;&#26041;&#27861;&#22806;&#65292;&#22312;&#19981;&#33021;&#36731;&#26494;&#35745;&#31639;&#23548;&#25968;&#26102;&#37117;&#24456;&#20248;&#36873;&#12290;&#26368;&#32456;&#65292;&#25105;&#20204;&#21457;&#29616;Po
&lt;/p&gt;
&lt;p&gt;
We evaluate and extend the solution methods for models with binary and multiple continuous choice variables in dynamic programming, particularly in cases where a discrete state space solution method is not viable. Therefore, we approximate the solution using taste shocks or black-box optimizers that applied mathematicians use to benchmark their algorithms. We apply these methods to a default framework in which agents have to solve a portfolio problem with long-term debt. We show that the choice of solution method matters, as taste shocks fail to attain convergence in multidimensional problems. We compare the relative advantages of using four optimization algorithms: the Nelder-Mead downhill simplex algorithm, Powell's direction-set algorithm with LINMIN, the conjugate gradient method BOBYQA, and the quasi-Newton Davidon-Fletcher-Powell (DFPMIN) algorithm. All of these methods, except for the last one, are preferred when derivatives cannot be easily computed. Ultimately, we find that Po
&lt;/p&gt;</description></item><item><title>&#38543;&#30528;&#27604;&#29305;&#24065;&#30340;&#21457;&#23637;&#65292;&#23427;&#38754;&#20020;&#30528;&#39640;&#30899;&#25490;&#25918;&#30340;&#38382;&#39064;&#65292;&#32780;&#30446;&#21069;&#26377;&#24456;&#22810;&#21487;&#25345;&#32493;&#27604;&#29305;&#24065;&#20250;&#35745;&#31995;&#32479;&#65292;&#20294;&#32570;&#20047;&#19968;&#20010;&#32479;&#19968;&#26631;&#20934;&#35748;&#35777;&#26631;&#20934;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#21487;&#34892;&#30340;&#35299;&#20915;&#26041;&#26696;&#65292;&#24182;&#35814;&#32454;&#20998;&#26512;&#20102;&#19981;&#21516;&#31995;&#32479;&#30340;&#20248;&#32570;&#28857;&#21644;&#25361;&#25112;&#12290;</title><link>http://arxiv.org/abs/2305.01815</link><description>&lt;p&gt;
&#19981;&#35201;&#20449;&#20219;&#65292;&#35201;&#39564;&#35777;&#65306;&#36808;&#21521;&#27604;&#29305;&#24065;&#32511;&#33394;&#21270;&#26694;&#26550;
&lt;/p&gt;
&lt;p&gt;
Don't Trust, Verify: Towards a Framework for the Greening of Bitcoin. (arXiv:2305.01815v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.01815
&lt;/p&gt;
&lt;p&gt;
&#38543;&#30528;&#27604;&#29305;&#24065;&#30340;&#21457;&#23637;&#65292;&#23427;&#38754;&#20020;&#30528;&#39640;&#30899;&#25490;&#25918;&#30340;&#38382;&#39064;&#65292;&#32780;&#30446;&#21069;&#26377;&#24456;&#22810;&#21487;&#25345;&#32493;&#27604;&#29305;&#24065;&#20250;&#35745;&#31995;&#32479;&#65292;&#20294;&#32570;&#20047;&#19968;&#20010;&#32479;&#19968;&#26631;&#20934;&#35748;&#35777;&#26631;&#20934;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#21487;&#34892;&#30340;&#35299;&#20915;&#26041;&#26696;&#65292;&#24182;&#35814;&#32454;&#20998;&#26512;&#20102;&#19981;&#21516;&#31995;&#32479;&#30340;&#20248;&#32570;&#28857;&#21644;&#25361;&#25112;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#36807;&#21435;&#30340;&#21313;&#22810;&#24180;&#20013;&#65292;&#27604;&#29305;&#24065;&#26082;&#24471;&#21040;&#20102;&#36234;&#26469;&#36234;&#22810;&#30340;&#35748;&#21487;&#65292;&#20063;&#21463;&#21040;&#20102;&#24456;&#22810;&#25209;&#35780;&#12290;&#22522;&#26412;&#19978;&#65292;&#27604;&#29305;&#24065;&#22240;&#20854;&#39640;&#33021;&#32791;&#30340;&#24037;&#20316;&#37327;&#35777;&#26126;&#65288;PoW&#65289;&#20849;&#35782;&#31639;&#27861;&#25152;&#23548;&#33268;&#30340;&#39640;&#30899;&#25490;&#25918;&#37327;&#32780;&#22791;&#21463;&#20105;&#35758;&#12290;&#28982;&#32780;&#65292;&#26377;&#19968;&#20010;&#36235;&#21183;&#26159;&#65292;&#27604;&#29305;&#24065;&#25366;&#25496;&#27491;&#26397;&#30528;&#23454;&#29616;&#30899;&#36127;&#25285;&#30340;&#26041;&#21521;&#21457;&#23637;&#65292;&#36825;&#20027;&#35201;&#26159;&#30001;&#20110;&#37319;&#29992;&#20102;&#22522;&#20110;&#30002;&#28919;&#30340;&#25366;&#25496;&#21644;&#25903;&#25345;&#21487;&#21464;&#21487;&#20877;&#29983;&#33021;&#28304;&#65288;VRE&#65289;&#21457;&#30005;&#30340;&#25366;&#25496;&#28789;&#27963;&#36127;&#33655;&#21709;&#24212;&#65288;FLR&#65289;&#12290;&#30719;&#24037;&#21644;&#30005;&#21147;&#38144;&#21806;&#21830;&#19981;&#20165;&#21487;&#20197;&#21033;&#29992;&#36807;&#21097;&#33021;&#28304;&#26469;&#22686;&#21152;&#20182;&#20204;&#30340;&#30408;&#21033;&#33021;&#21147;&#65292;&#36824;&#21487;&#20197;&#21521;&#37027;&#20123;&#26377;&#20852;&#36259;&#32511;&#21270;&#33258;&#24049;&#25237;&#36164;&#32452;&#21512;&#30340;&#20080;&#23478;&#20986;&#21806;&#32511;&#33394;&#20195;&#24065;&#12290;&#28982;&#32780;&#65292;&#19968;&#20010;&#21512;&#36866;&#30340;&#8220;&#32511;&#33394;&#27604;&#29305;&#24065;&#8221;&#20250;&#35745;&#31995;&#32479;&#38656;&#35201;&#19968;&#20010;&#21487;&#25345;&#32493;&#27604;&#29305;&#24065;&#25345;&#26377;&#30340;&#35748;&#35777;&#26631;&#20934;&#26694;&#26550;&#12290;&#24314;&#31435;&#36825;&#26679;&#30340;&#26694;&#26550;&#30340;&#27491;&#30830;&#26041;&#27861;&#20173;&#26377;&#20105;&#35758;&#12290;&#26412;&#25991;&#35843;&#26597;&#20102;&#19981;&#21516;&#30340;&#21487;&#25345;&#32493;&#27604;&#29305;&#24065;&#20250;&#35745;&#31995;&#32479;&#65292;&#20998;&#26512;&#20102;&#23427;&#20204;&#30340;&#20248;&#32570;&#28857;&#21450;&#20854;&#25361;&#25112;&#12290;
&lt;/p&gt;
&lt;p&gt;
For more than a decade, Bitcoin has gained as much adoption as it has received criticism. Fundamentally, Bitcoin is under fire for the high carbon footprint that results from the energy-intensive proof-of-work (PoW) consensus algorithm. There is a trend however for Bitcoin mining to adopt a trajectory toward achieving carbon-negative status, notably due to the adoption of methane-based mining and mining-based flexible load response (FLR) to complement variable renewable energy (VRE) generation. Miners and electricity sellers may increase their profitability not only by taking advantage of excess energy, but also by selling green tokens to buyers interested in greening their portfolios. Nevertheless, a proper ''green Bitcoin'' accounting system requires a standard framework for the accreditation of sustainable bitcoin holdings. The proper way to build such a framework remains contested. In this paper, we survey the different sustainable Bitcoin accounting systems. Analyzing the various 
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#26041;&#27861;&#65292;&#29992;&#20110;&#35782;&#21035;&#20855;&#26377;&#20219;&#24847;&#30456;&#20851;&#21516;&#26399;&#25910;&#20837;&#20914;&#20987;&#30340;&#30408;&#21033;&#21160;&#24577;&#27169;&#22411;&#20013;&#30340;&#31995;&#25968;&#12290;</title><link>http://arxiv.org/abs/2303.08460</link><description>&lt;p&gt;
&#35782;&#21035;&#20855;&#26377;&#30456;&#20851;&#21516;&#26399;&#25910;&#20837;&#20914;&#20987;&#30340;&#30408;&#21033;&#36807;&#31243;
&lt;/p&gt;
&lt;p&gt;
Identifying an Earnings Process With Dependent Contemporaneous Income Shocks. (arXiv:2303.08460v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.08460
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#26041;&#27861;&#65292;&#29992;&#20110;&#35782;&#21035;&#20855;&#26377;&#20219;&#24847;&#30456;&#20851;&#21516;&#26399;&#25910;&#20837;&#20914;&#20987;&#30340;&#30408;&#21033;&#21160;&#24577;&#27169;&#22411;&#20013;&#30340;&#31995;&#25968;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#26041;&#27861;&#65292;&#29992;&#20110;&#35782;&#21035;&#20855;&#26377;&#20219;&#24847;&#30456;&#20851;&#21516;&#26399;&#25910;&#20837;&#20914;&#20987;&#30340;&#30408;&#21033;&#21160;&#24577;&#27169;&#22411;&#20013;&#30340;&#31995;&#25968;&#12290;&#20256;&#32479;&#26041;&#27861;&#20381;&#36182;&#20110;&#20108;&#38454;&#30697;&#26080;&#27861;&#35782;&#21035;&#36825;&#20123;&#31995;&#25968;&#65292;&#24378;&#35843;&#20102;&#38656;&#35201;&#25429;&#25417;&#39640;&#38454;&#30697;&#20449;&#24687;&#30340;&#38750;&#39640;&#26031;&#20551;&#35774;&#30340;&#24517;&#35201;&#24615;&#12290;&#20363;&#22914;&#65292;&#25105;&#20204;&#30340;&#32467;&#26524;&#26377;&#21161;&#20110;&#30408;&#21033;&#21160;&#24577;&#25991;&#29486;&#65292;&#20801;&#35768;&#30408;&#21033;&#27169;&#22411;&#20855;&#26377;&#24037;&#20316;&#21464;&#21160;&#30340;&#27704;&#20037;&#25910;&#20837;&#20914;&#20987;&#19982;&#21516;&#26399;&#30701;&#26242;&#25910;&#20837;&#20914;&#20987;&#30340;&#20851;&#32852;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper proposes a novel approach for identifying coefficients in an earnings dynamics model with arbitrarily dependent contemporaneous income shocks. Traditional methods relying on second moments fail to identify these coefficients, emphasizing the need for nongaussianity assumptions that capture information from higher moments. Our results contribute to the literature on earnings dynamics by allowing models of earnings to have, for example, the permanent income shock of a job change to be linked to the contemporaneous transitory income shock of a relocation bonus.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#21152;&#23494;&#36135;&#24065;&#24179;&#21488;&#30340;&#20013;&#24515;&#21270;&#28436;&#21270;&#65292;&#20351;&#29992;&#22797;&#26434;&#31995;&#32479;&#25991;&#29486;&#20013;&#24191;&#27867;&#30340;&#26041;&#27861;&#23545;&#27604;&#20102;&#19968;&#31995;&#21015;&#21306;&#22359;&#38142;&#65292;&#36136;&#30097;&#20102;&#24403;&#21069;&#21152;&#23494;&#36135;&#24065;&#26159;&#21542;&#30495;&#27491;&#21435;&#20013;&#24515;&#21270;&#12290;</title><link>http://arxiv.org/abs/2206.05081</link><description>&lt;p&gt;
&#21152;&#23494;&#36135;&#24065;&#24179;&#21488;&#30340;&#20013;&#24515;&#21270;&#28436;&#21270;
&lt;/p&gt;
&lt;p&gt;
The Evolution Of Centralisation on Cryptocurrency Platforms. (arXiv:2206.05081v2 [physics.soc-ph] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2206.05081
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#21152;&#23494;&#36135;&#24065;&#24179;&#21488;&#30340;&#20013;&#24515;&#21270;&#28436;&#21270;&#65292;&#20351;&#29992;&#22797;&#26434;&#31995;&#32479;&#25991;&#29486;&#20013;&#24191;&#27867;&#30340;&#26041;&#27861;&#23545;&#27604;&#20102;&#19968;&#31995;&#21015;&#21306;&#22359;&#38142;&#65292;&#36136;&#30097;&#20102;&#24403;&#21069;&#21152;&#23494;&#36135;&#24065;&#26159;&#21542;&#30495;&#27491;&#21435;&#20013;&#24515;&#21270;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21313;&#22810;&#24180;&#21069;&#65292;&#21306;&#22359;&#38142;&#34987;&#35465;&#20026;&#20811;&#26381;&#22312;&#32447;&#25903;&#20184;&#20013;&#24515;&#21270;&#20449;&#20219;&#31532;&#19977;&#26041;&#30340;&#35299;&#20915;&#26041;&#26696;&#12290;&#38543;&#30528;&#26102;&#38388;&#30340;&#25512;&#31227;&#65292;&#21152;&#23494;&#36135;&#24065;&#36816;&#21160;&#21457;&#29983;&#20102;&#25913;&#21464;&#21644;&#21457;&#23637;&#65292;&#23613;&#31649;&#21435;&#20013;&#24515;&#21270;&#20173;&#28982;&#26159;&#26680;&#24515;&#24847;&#35782;&#24418;&#24577;&#21644;&#27599;&#20010;&#26032;&#30340;&#21152;&#23494;&#39033;&#30446;&#24212;&#35813;&#25552;&#20379;&#30340;&#24517;&#35201;&#21151;&#33021;&#12290;&#26412;&#25991;&#20351;&#29992;&#22797;&#26434;&#31995;&#32479;&#25991;&#29486;&#20013;&#24191;&#27867;&#30340;&#26041;&#27861;&#30740;&#31350;&#20102;&#21152;&#23494;&#36135;&#24065;&#20013;&#24515;&#21270;&#30340;&#27010;&#24565;&#65292;&#23545;&#27604;&#20102;&#19968;&#31995;&#21015;&#21306;&#22359;&#38142;&#31995;&#32479;&#65292;&#20197;&#23450;&#20041;&#21306;&#22359;&#38142;&#31995;&#32479;&#21487;&#33021;&#23637;&#31034;&#30340;&#35768;&#22810;&#19981;&#21516;&#32423;&#21035;&#30340;&#65288;&#21435;&#65289;&#20013;&#24515;&#21270;&#65292;&#24182;&#36136;&#30097;&#24403;&#21069;&#21152;&#23494;&#36135;&#24065;&#22312;&#25216;&#26415;&#21644;&#32463;&#27982;&#24847;&#20041;&#19978;&#26159;&#21542;&#30495;&#27491;&#21435;&#20013;&#24515;&#21270;&#12290;
&lt;/p&gt;
&lt;p&gt;
More than ten years ago the blockchain was acclaimed as the solution to overcome centralised trusted third parties for online payments. Through the years the crypto-movement changed and evolved, although decentralisation remained the core ideology and the necessary feature every new crypto-project should provide. In this paper we study the concept of centralisation in cryptocurrencies using a wide array of methodologies from the complex systems literature, on a comparative collection of blockchains, in order to define the many different levels a blockchain system may display (de-)centralisation and to question whether the present state of cryptocurrencies is, in a technological and economical sense, actually decentralised.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;MicroVelocity&#26694;&#26550;&#26469;&#20998;&#26512;&#25968;&#23383;&#36135;&#24065;&#30340;&#36135;&#24065;&#27969;&#36890;&#36895;&#24230;&#65292;&#25581;&#31034;&#20102;&#20010;&#20307;&#20195;&#29702;&#36129;&#29486;&#30340;&#20998;&#24067;&#29305;&#28857;&#65292;&#35760;&#24405;&#20102;&#39640;&#36895;&#20013;&#20171;&#30340;&#20986;&#29616;&#65292;&#20026;&#25968;&#23383;&#36135;&#24065;&#30340;&#21457;&#23637;&#21644;&#20998;&#26512;&#25552;&#20379;&#25919;&#31574;&#27934;&#35265;&#12290;</title><link>http://arxiv.org/abs/2201.13416</link><description>&lt;p&gt;
&#12298;MicroVelocity: &#37325;&#26032;&#24605;&#32771;&#25968;&#23383;&#36135;&#24065;&#30340;&#36135;&#24065;&#36895;&#24230;&#12299;
&lt;/p&gt;
&lt;p&gt;
MicroVelocity: rethinking the Velocity of Money for digital currencies. (arXiv:2201.13416v2 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2201.13416
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;MicroVelocity&#26694;&#26550;&#26469;&#20998;&#26512;&#25968;&#23383;&#36135;&#24065;&#30340;&#36135;&#24065;&#27969;&#36890;&#36895;&#24230;&#65292;&#25581;&#31034;&#20102;&#20010;&#20307;&#20195;&#29702;&#36129;&#29486;&#30340;&#20998;&#24067;&#29305;&#28857;&#65292;&#35760;&#24405;&#20102;&#39640;&#36895;&#20013;&#20171;&#30340;&#20986;&#29616;&#65292;&#20026;&#25968;&#23383;&#36135;&#24065;&#30340;&#21457;&#23637;&#21644;&#20998;&#26512;&#25552;&#20379;&#25919;&#31574;&#27934;&#35265;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#26032;&#30340;&#26694;&#26550;&#26469;&#20998;&#26512;&#36135;&#24065;&#27969;&#36890;&#36895;&#24230;&#65292;&#21363;&#27599;&#20010;&#20010;&#20307;&#20195;&#29702;&#30340;&#36129;&#29486;&#65288;MicroVelocity&#65289;&#65292;&#24182;&#25581;&#31034;&#24635;&#20307;&#36135;&#24065;&#36895;&#24230;&#30340;&#20998;&#24067;&#20915;&#23450;&#22240;&#32032;&#12290;&#36890;&#36807;&#21033;&#29992;&#23384;&#20648;&#22312;&#22235;&#31181;&#21152;&#23494;&#36135;&#24065;&#21306;&#22359;&#38142;&#20013;&#30340;&#23436;&#25972;&#20844;&#24320;&#20132;&#26131;&#25968;&#25454;&#65292;&#25105;&#20204;&#23454;&#35777;&#21457;&#29616;MicroVelocity i)&#38750;&#24120;&#24322;&#36136;&#20998;&#24067;&#65292;ii)&#19982;&#20195;&#29702;&#30340;&#36130;&#23500;&#24378;&#30456;&#20851;&#12290;&#25105;&#20204;&#36827;&#19968;&#27493;&#35760;&#24405;&#39640;&#36895;&#20013;&#20171;&#30340;&#20986;&#29616;&#65292;&#20174;&#32780;&#25361;&#25112;&#20102;&#36825;&#20123;&#31995;&#32479;&#23436;&#20840;&#21435;&#20013;&#24515;&#21270;&#30340;&#24819;&#27861;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#25552;&#20986;&#30340;&#26694;&#26550;&#21644;&#32467;&#26524;&#20026;&#25968;&#23383;&#36135;&#24065;&#30340;&#21457;&#23637;&#21644;&#20998;&#26512;&#25552;&#20379;&#20102;&#25919;&#31574;&#27934;&#35265;&#12290;
&lt;/p&gt;
&lt;p&gt;
We propose a novel framework to analyse the velocity of money in terms of the contribution (MicroVelocity) of each individual agent, and to uncover the distributional determinants of aggregate velocity. Leveraging on complete publicly available transactions data stored in blockchains from four cryptocurrencies, we empirically find that MicroVelocity i) is very heterogeneously distributed and ii) strongly correlates with agents' wealth. We further document the emergence of high-velocity intermediaries, thereby challenging the idea that these systems are fully decentralised. Further, our framework and results provide policy insights for the development and analysis of digital currencies.
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#20195;&#29702;&#21830;&#22312;&#20849;&#20139;&#25216;&#26415;&#20013;&#30340;&#38598;&#20307;&#21019;&#26032;&#38382;&#39064;&#65292;&#21457;&#29616;&#20801;&#35768;&#20195;&#29702;&#21830;&#20002;&#24323;&#21019;&#26032;&#21487;&#20197;&#22686;&#21152;&#22343;&#34913;&#21162;&#21147;&#21644;&#31119;&#21033;&#12290;</title><link>http://arxiv.org/abs/2109.01885</link><description>&lt;p&gt;
&#38598;&#20307;&#21019;&#26032;&#30340;&#28608;&#21169;&#26041;&#24335;
&lt;/p&gt;
&lt;p&gt;
Incentives for Collective Innovation. (arXiv:2109.01885v6 [econ.TH] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2109.01885
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#20195;&#29702;&#21830;&#22312;&#20849;&#20139;&#25216;&#26415;&#20013;&#30340;&#38598;&#20307;&#21019;&#26032;&#38382;&#39064;&#65292;&#21457;&#29616;&#20801;&#35768;&#20195;&#29702;&#21830;&#20002;&#24323;&#21019;&#26032;&#21487;&#20197;&#22686;&#21152;&#22343;&#34913;&#21162;&#21147;&#21644;&#31119;&#21033;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20195;&#29702;&#21830;&#20204;&#20026;&#20849;&#20139;&#30340;&#25216;&#26415;&#20184;&#20986;&#38544;&#34255;&#30340;&#21162;&#21147;&#65292;&#20197;&#20135;&#29983;&#38543;&#26426;&#22823;&#23567;&#30340;&#21019;&#26032;&#12290;&#38543;&#30528;&#25216;&#26415;&#30340;&#21457;&#23637;&#65292;&#20351;&#29992;&#25216;&#26415;&#30340;&#22238;&#25253;&#20063;&#38543;&#20043;&#22686;&#38271;&#65292;&#20294;&#30001;&#20110;&#8220;&#25506;&#32034;-&#21033;&#29992;&#8221;&#26435;&#34913;&#65292;&#21162;&#21147;&#30340;&#26426;&#20250;&#25104;&#26412;&#20063;&#38543;&#20043;&#22686;&#21152;&#12290;&#30001;&#20110;&#30417;&#27979;&#26159;&#19981;&#23436;&#32654;&#30340;&#65292;&#23384;&#22312;&#19968;&#20010;&#65288;&#24378;&#65289;&#23545;&#31216;&#22343;&#34913;&#65292;&#20219;&#20309;&#22343;&#34913;&#20013;&#30340;&#21162;&#21147;&#22343;&#19981;&#26202;&#20110;&#21333;&#19968;&#20195;&#29702;&#21830;&#38382;&#39064;&#20013;&#30340;&#21162;&#21147;&#12290;&#23567;&#30340;&#21019;&#26032;&#21487;&#33021;&#20250;&#20005;&#37325;&#38477;&#20302;&#25152;&#26377;&#20195;&#29702;&#21830;&#22312;&#23545;&#31216;&#22343;&#34913;&#20013;&#30340;&#21162;&#21147;&#12290;&#20801;&#35768;&#20195;&#29702;&#21830;&#20002;&#24323;&#21019;&#26032;&#21487;&#20197;&#22686;&#21152;&#22343;&#34913;&#21162;&#21147;&#21644;&#31119;&#21033;&#12290;&#22914;&#26524;&#20195;&#29702;&#21830;&#21487;&#20197;&#38544;&#30610;&#21019;&#26032;&#65292;&#37027;&#20040;&#23384;&#22312;&#23436;&#32654;&#30340;&#36125;&#21494;&#26031;&#22343;&#34913;&#65292;&#20854;&#20013;&#25913;&#36827;&#20250;&#34987;&#31192;&#23494;&#22320;&#23436;&#21892;&#65292;&#30452;&#21040;&#36275;&#22815;&#22823;&#12290;&#22312;&#33258;&#28982;&#26465;&#20214;&#19979;&#65292;&#35813;&#22343;&#34913;&#20248;&#20110;&#25152;&#26377;&#24378;&#21046;&#20844;&#24320;&#30340;&#22343;&#34913;&#12290;
&lt;/p&gt;
&lt;p&gt;
Agents exert hidden effort to produce randomly-sized innovations in a technology they share. Returns from using the technology grow as it develops, but so does the opportunity cost of effort, due to an 'exploration-exploitation' trade-off. As monitoring is imperfect, there exists a unique (strongly) symmetric equilibrium, and effort in any equilibrium ceases no later than in the single-agent problem. Small innovations may hurt all agents in the symmetric equilibrium, as they severely reduce effort. Allowing agents to discard innovations increases equilibrium effort and welfare. If agents can instead conceal innovations, there exists a perfect Bayesian equilibrium in which improvements are refined in secret until they are sufficiently large. Under natural conditions, this equilibrium improves on all equilibria with forced disclosure.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#22312;&#22238;&#24402;&#19981;&#36830;&#32493;&#35774;&#35745;&#20013;&#26356;&#26377;&#25928;&#22320;&#21033;&#29992;&#21327;&#21464;&#37327;&#20449;&#24687;&#30340;&#20272;&#35745;&#22120;&#31867;&#65292;&#21487;&#20197;&#23481;&#32435;&#22823;&#37327;&#30340;&#31163;&#25955;&#25110;&#36830;&#32493;&#21327;&#21464;&#37327;&#65292;&#24182;&#32463;&#30001;&#26426;&#22120;&#23398;&#20064;&#12289;&#38750;&#21442;&#25968;&#22238;&#24402;&#25110;&#32463;&#20856;&#21442;&#25968;&#26041;&#27861;&#26469;&#20272;&#35745;&#12290;&#36890;&#36807;&#23545;&#32467;&#26524;&#21464;&#37327;&#36866;&#24403;&#20462;&#25913;&#65292;&#36825;&#31181;&#20272;&#35745;&#22120;&#26131;&#20110;&#23454;&#29616;&#65292;&#21487;&#20197;&#36873;&#25321;&#31867;&#20284;&#20110;&#20256;&#32479;RD&#20998;&#26512;&#30340;&#35843;&#25972;&#21442;&#25968;&#12290;</title><link>http://arxiv.org/abs/2107.07942</link><description>&lt;p&gt;
&#22238;&#24402;&#19981;&#36830;&#32493;&#35774;&#35745;&#20013;&#30340;&#28789;&#27963;&#21327;&#21464;&#37327;&#35843;&#25972;
&lt;/p&gt;
&lt;p&gt;
Flexible Covariate Adjustments in Regression Discontinuity Designs. (arXiv:2107.07942v2 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2107.07942
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#22312;&#22238;&#24402;&#19981;&#36830;&#32493;&#35774;&#35745;&#20013;&#26356;&#26377;&#25928;&#22320;&#21033;&#29992;&#21327;&#21464;&#37327;&#20449;&#24687;&#30340;&#20272;&#35745;&#22120;&#31867;&#65292;&#21487;&#20197;&#23481;&#32435;&#22823;&#37327;&#30340;&#31163;&#25955;&#25110;&#36830;&#32493;&#21327;&#21464;&#37327;&#65292;&#24182;&#32463;&#30001;&#26426;&#22120;&#23398;&#20064;&#12289;&#38750;&#21442;&#25968;&#22238;&#24402;&#25110;&#32463;&#20856;&#21442;&#25968;&#26041;&#27861;&#26469;&#20272;&#35745;&#12290;&#36890;&#36807;&#23545;&#32467;&#26524;&#21464;&#37327;&#36866;&#24403;&#20462;&#25913;&#65292;&#36825;&#31181;&#20272;&#35745;&#22120;&#26131;&#20110;&#23454;&#29616;&#65292;&#21487;&#20197;&#36873;&#25321;&#31867;&#20284;&#20110;&#20256;&#32479;RD&#20998;&#26512;&#30340;&#35843;&#25972;&#21442;&#25968;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#23454;&#35777;&#22238;&#24402;&#19981;&#36830;&#32493;&#65288;RD&#65289;&#30740;&#31350;&#36890;&#24120;&#20351;&#29992;&#21327;&#21464;&#37327;&#26469;&#22686;&#21152;&#20854;&#20272;&#35745;&#32467;&#26524;&#30340;&#31934;&#24230;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#20272;&#35745;&#22120;&#31867;&#65292;&#27604;&#30446;&#21069;&#23454;&#36341;&#20013;&#24191;&#27867;&#20351;&#29992;&#30340;&#32447;&#24615;&#35843;&#25972;&#20272;&#35745;&#22120;&#26356;&#26377;&#25928;&#22320;&#21033;&#29992;&#36825;&#20123;&#21327;&#21464;&#37327;&#20449;&#24687;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#21487;&#20197;&#23481;&#32435;&#21487;&#33021;&#22823;&#37327;&#30340;&#31163;&#25955;&#25110;&#36830;&#32493;&#21327;&#21464;&#37327;&#12290;&#23427;&#28041;&#21450;&#20351;&#29992;&#36866;&#24403;&#20462;&#25913;&#20102;&#30340;&#32467;&#26524;&#21464;&#37327;&#36816;&#34892;&#26631;&#20934;RD&#20998;&#26512;&#65292;&#35813;&#21464;&#37327;&#30340;&#24418;&#24335;&#20026;&#21407;&#22987;&#32467;&#26524;&#19982;&#21327;&#21464;&#37327;&#20989;&#25968;&#30340;&#24046;&#24322;&#12290;&#25105;&#20204;&#34920;&#24449;&#20102;&#23548;&#33268;&#28176;&#36817;&#26041;&#24046;&#26368;&#23567;&#30340;&#20272;&#35745;&#22120;&#30340;&#20989;&#25968;&#65292;&#24182;&#23637;&#31034;&#20102;&#22914;&#20309;&#36890;&#36807;&#29616;&#20195;&#26426;&#22120;&#23398;&#20064;&#12289;&#38750;&#21442;&#25968;&#22238;&#24402;&#25110;&#32463;&#20856;&#21442;&#25968;&#26041;&#27861;&#26469;&#20272;&#35745;&#23427;&#12290;&#30001;&#27492;&#20135;&#29983;&#30340;&#20272;&#35745;&#22120;&#26131;&#20110;&#23454;&#29616;&#65292;&#22240;&#20026;&#21487;&#20197;&#36873;&#25321;&#31867;&#20284;&#20110;&#20256;&#32479;RD&#20998;&#26512;&#30340;&#35843;&#25972;&#21442;&#25968;&#12290;&#24191;&#27867;&#30340;&#27169;&#25311;&#30740;&#31350;&#35828;&#26126;&#20102;&#25105;&#20204;&#30340;&#26041;&#27861;&#22312;&#26377;&#38480;&#26679;&#26412;&#20013;&#30340;&#24615;&#33021;&#65292;&#21478;&#22806;&#65292;&#19968;&#20010;&#26696;&#20363;&#30740;&#31350;&#31361;&#20986;&#20102;&#23427;&#30340;&#23454;&#35777;&#30456;&#20851;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Empirical regression discontinuity (RD) studies often use covariates to increase the precision of their estimates. In this paper, we propose a novel class of estimators that use such covariate information more efficiently than the linear adjustment estimators that are currently used widely in practice. Our approach can accommodate a possibly large number of either discrete or continuous covariates. It involves running a standard RD analysis with an appropriately modified outcome variable, which takes the form of the difference between the original outcome and a function of the covariates. We characterize the function that leads to the estimator with the smallest asymptotic variance, and show how it can be estimated via modern machine learning, nonparametric regression, or classical parametric methods. The resulting estimator is easy to implement, as tuning parameters can be chosen as in a conventional RD analysis. An extensive simulation study illustrates the performance of our approac
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#26816;&#39564;&#21160;&#24577;&#31163;&#25955;&#21338;&#24328;&#20013;&#20851;&#38190;&#20551;&#23450;&#8220;&#21516;&#36136;&#24615;&#20551;&#35774;&#8221;&#30340;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#33021;&#36890;&#36807;&#38543;&#26426;&#21270;&#26816;&#39564;&#26469;&#39564;&#35777;&#35813;&#20551;&#35774;&#26159;&#21542;&#25104;&#31435;&#12290;</title><link>http://arxiv.org/abs/2010.02297</link><description>&lt;p&gt;
&#26377;&#38480;&#26679;&#26412;&#20013;&#21160;&#24577;&#31163;&#25955;&#21338;&#24328;&#30340;&#21516;&#36136;&#24615;&#26816;&#39564;
&lt;/p&gt;
&lt;p&gt;
Testing homogeneity in dynamic discrete games in finite samples. (arXiv:2010.02297v2 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2010.02297
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#26816;&#39564;&#21160;&#24577;&#31163;&#25955;&#21338;&#24328;&#20013;&#20851;&#38190;&#20551;&#23450;&#8220;&#21516;&#36136;&#24615;&#20551;&#35774;&#8221;&#30340;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#33021;&#36890;&#36807;&#38543;&#26426;&#21270;&#26816;&#39564;&#26469;&#39564;&#35777;&#35813;&#20551;&#35774;&#26159;&#21542;&#25104;&#31435;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21160;&#24577;&#31163;&#25955;&#21338;&#24328;&#30340;&#25991;&#29486;&#32463;&#24120;&#20551;&#23450;&#26465;&#20214;&#36873;&#25321;&#27010;&#29575;&#21644;&#29366;&#24577;&#36716;&#31227;&#27010;&#29575;&#22312;&#19981;&#21516;&#24066;&#22330;&#21644;&#26102;&#38388;&#19978;&#26159;&#21516;&#36136;&#30340;&#12290;&#25105;&#20204;&#31216;&#20043;&#20026;&#8220;&#21160;&#24577;&#31163;&#25955;&#21338;&#24328;&#20013;&#30340;&#21516;&#36136;&#24615;&#20551;&#35774;&#8221;&#12290;&#35813;&#20551;&#35774;&#20351;&#24471;&#32463;&#39564;&#30740;&#31350;&#21487;&#20197;&#36890;&#36807;&#27719;&#24635;&#22810;&#20010;&#24066;&#22330;&#21644;&#22810;&#20010;&#26102;&#38388;&#27573;&#30340;&#25968;&#25454;&#26469;&#20272;&#35745;&#28216;&#25103;&#30340;&#32467;&#26500;&#21442;&#25968;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#20551;&#35774;&#26816;&#39564;&#26469;&#35780;&#20272;&#25968;&#25454;&#26159;&#21542;&#31526;&#21512;&#21516;&#36136;&#24615;&#20551;&#35774;&#12290;&#25105;&#20204;&#30340;&#20551;&#35774;&#26816;&#39564;&#26159;&#36890;&#36807;&#39532;&#23572;&#21487;&#22827;&#38142;&#33945;&#29305;&#21345;&#32599;&#65288;MCMC&#65289;&#31639;&#27861;&#23454;&#29616;&#36817;&#20284;&#38543;&#26426;&#21270;&#26816;&#39564;&#30340;&#32467;&#26524;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#24403;&#65288;&#29992;&#25143;&#23450;&#20041;&#30340;&#65289;MCMC&#25277;&#26679;&#27425;&#25968;&#36235;&#20110;&#26080;&#31351;&#22823;&#26102;&#65292;&#25105;&#20204;&#30340;&#20551;&#35774;&#26816;&#39564;&#23601;&#26159;&#26377;&#25928;&#30340;&#65292;&#23545;&#20110;&#20219;&#20309;&#22266;&#23450;&#30340;&#24066;&#22330;&#12289;&#26102;&#38388;&#27573;&#21644;&#29609;&#23478;&#25968;&#37327;&#12290;&#25105;&#20204;&#23558;&#25105;&#20204;&#30340;&#26816;&#39564;&#24212;&#29992;&#20110;&#29790;&#23433;&#65288;2012&#65289;&#23545;&#32654;&#22269;&#27874;&#29305;&#20848;&#27700;&#27877;&#24037;&#19994;&#30340;&#32463;&#39564;&#30740;&#31350;&#20013;&#12290;
&lt;/p&gt;
&lt;p&gt;
The literature on dynamic discrete games often assumes that the conditional choice probabilities and the state transition probabilities are homogeneous across markets and over time. We refer to this as the "homogeneity assumption" in dynamic discrete games. This assumption enables empirical studies to estimate the game's structural parameters by pooling data from multiple markets and from many time periods. In this paper, we propose a hypothesis test to evaluate whether the homogeneity assumption holds in the data. Our hypothesis test is the result of an approximate randomization test, implemented via a Markov chain Monte Carlo (MCMC) algorithm. We show that our hypothesis test becomes valid as the (user-defined) number of MCMC draws diverges, for any fixed number of markets, time periods, and players. We apply our test to the empirical study of the U.S.\ Portland cement industry in Ryan (2012).
&lt;/p&gt;</description></item></channel></rss>