<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21160;&#24577;&#22238;&#24402;&#19981;&#36830;&#32493;&#24615;&#35774;&#35745;&#26041;&#27861;&#65292;&#29992;&#20110;&#30830;&#23450;&#32463;&#27982;&#21487;&#35299;&#37322;&#30340;&#26102;&#38388;&#38388;&#38548;&#22788;&#29702;&#25928;&#24212;&#12290;&#30740;&#31350;&#37319;&#29992;&#20102;&#21160;&#24577;&#28508;&#22312;&#32467;&#26524;&#27169;&#22411;&#65292;&#24182;&#29305;&#21035;&#23545;&#26080;&#39044;&#26399;&#21644;&#20849;&#21516;&#36235;&#21183;&#38480;&#21046;&#36827;&#34892;&#20102;&#22788;&#29702;&#65292;&#20197;&#30830;&#23450;&#25351;&#23450;&#20999;&#28857;&#30340;&#20914;&#20987;&#21453;&#24212;&#12290;&#20272;&#35745;&#37327;&#21487;&#20197;&#36890;&#36807;&#26631;&#20934;&#30340;&#23616;&#37096;&#22810;&#39033;&#24335;&#26041;&#27861;&#36827;&#34892;&#35745;&#31639;&#12290;</title><link>http://arxiv.org/abs/2307.14203</link><description>&lt;p&gt;
&#21160;&#24577;&#22238;&#24402;&#19981;&#36830;&#32493;&#24615;&#65306;&#19968;&#31181;&#20869;&#37096;&#35774;&#35745;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
Dynamic Regression Discontinuity: A Within-Design Approach. (arXiv:2307.14203v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.14203
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21160;&#24577;&#22238;&#24402;&#19981;&#36830;&#32493;&#24615;&#35774;&#35745;&#26041;&#27861;&#65292;&#29992;&#20110;&#30830;&#23450;&#32463;&#27982;&#21487;&#35299;&#37322;&#30340;&#26102;&#38388;&#38388;&#38548;&#22788;&#29702;&#25928;&#24212;&#12290;&#30740;&#31350;&#37319;&#29992;&#20102;&#21160;&#24577;&#28508;&#22312;&#32467;&#26524;&#27169;&#22411;&#65292;&#24182;&#29305;&#21035;&#23545;&#26080;&#39044;&#26399;&#21644;&#20849;&#21516;&#36235;&#21183;&#38480;&#21046;&#36827;&#34892;&#20102;&#22788;&#29702;&#65292;&#20197;&#30830;&#23450;&#25351;&#23450;&#20999;&#28857;&#30340;&#20914;&#20987;&#21453;&#24212;&#12290;&#20272;&#35745;&#37327;&#21487;&#20197;&#36890;&#36807;&#26631;&#20934;&#30340;&#23616;&#37096;&#22810;&#39033;&#24335;&#26041;&#27861;&#36827;&#34892;&#35745;&#31639;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#35770;&#35777;&#26041;&#27861;&#65292;&#29992;&#26469;&#22312;&#21160;&#24577;&#22238;&#24402;&#19981;&#36830;&#32493;&#24615;&#35774;&#35745;&#20013;&#30830;&#23450;&#32463;&#27982;&#21487;&#35299;&#37322;&#30340;&#26102;&#38388;&#38388;&#38548;&#22788;&#29702;&#25928;&#24212;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#25105;&#21457;&#23637;&#20102;&#19968;&#20010;&#21160;&#24577;&#28508;&#22312;&#32467;&#26524;&#27169;&#22411;&#65292;&#24182;&#29305;&#22320;&#23545;&#24046;&#24322;-in-differences&#25991;&#29486;&#20013;&#30340;&#20004;&#20010;&#20551;&#35774;&#36827;&#34892;&#20102;&#19987;&#38376;&#21270;&#22788;&#29702;&#65292;&#21363;&#26080;&#39044;&#26399;&#21644;&#20849;&#21516;&#36235;&#21183;&#38480;&#21046;&#65292;&#20197;&#30830;&#23450;&#25351;&#23450;&#20999;&#28857;&#30340;&#20914;&#20987;&#21453;&#24212;&#12290;&#19982;&#27599;&#20010;&#30446;&#26631;&#21442;&#25968;&#30456;&#20851;&#30340;&#20272;&#35745;&#37327;&#21487;&#20197;&#34920;&#31034;&#20026;&#20004;&#20010;&#38745;&#24577;&#22238;&#24402;&#19981;&#36830;&#32493;&#24615;&#35774;&#35745;&#32467;&#26524;&#23545;&#27604;&#30340;&#21644;&#65292;&#20174;&#32780;&#21487;&#20197;&#36890;&#36807;&#26631;&#20934;&#30340;&#23616;&#37096;&#22810;&#39033;&#24335;&#24037;&#20855;&#36827;&#34892;&#20272;&#35745;&#12290;&#25105;&#21033;&#29992;&#26377;&#38480;&#36335;&#24452;&#29420;&#31435;&#24615;&#20551;&#35774;&#26469;&#38477;&#20302;&#38382;&#39064;&#30340;&#32500;&#24230;&#12290;
&lt;/p&gt;
&lt;p&gt;
I propose a novel argument to point identify economically interpretable intertemporal treatment effects in dynamic regression discontinuity designs (RDDs). Specifically, I develop a dynamic potential outcomes model and specialize two assumptions of the difference-in-differences literature, the no anticipation and common trends restrictions, to point identify cutoff-specific impulse responses. The estimand associated with each target parameter can be expressed as the sum of two static RDD outcome contrasts, thereby allowing for estimation via standard local polynomial tools. I leverage a limited path independence assumption to reduce the dimensionality of the problem.
&lt;/p&gt;</description></item><item><title>&#35813;&#30740;&#31350;&#27979;&#37327;&#20102;&#25910;&#20837;&#20914;&#20987;&#23545;&#28040;&#36153;&#20445;&#38505;&#30340;&#24433;&#21709;&#31243;&#24230;&#65292;&#35777;&#23454;&#23614;&#37096;&#25910;&#20837;&#39118;&#38505;&#23545;&#28040;&#36153;&#20855;&#26377;&#37325;&#35201;&#24433;&#21709;&#65292;&#25910;&#20837;&#36127;&#38754;&#20914;&#20987;&#23545;&#28040;&#36153;&#30340;&#20256;&#23548;&#29575;&#22823;&#20110;&#27491;&#38754;&#20914;&#20987;&#12290;</title><link>http://arxiv.org/abs/2306.13208</link><description>&lt;p&gt;
&#22312;&#23614;&#37096;&#25910;&#20837;&#39118;&#38505;&#30340;&#23384;&#22312;&#19979;&#65292;&#28040;&#36153;&#37096;&#20998;&#20445;&#38505;
&lt;/p&gt;
&lt;p&gt;
Consumption Partial Insurance in the Presence of Tail Income Risk. (arXiv:2306.13208v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.13208
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#27979;&#37327;&#20102;&#25910;&#20837;&#20914;&#20987;&#23545;&#28040;&#36153;&#20445;&#38505;&#30340;&#24433;&#21709;&#31243;&#24230;&#65292;&#35777;&#23454;&#23614;&#37096;&#25910;&#20837;&#39118;&#38505;&#23545;&#28040;&#36153;&#20855;&#26377;&#37325;&#35201;&#24433;&#21709;&#65292;&#25910;&#20837;&#36127;&#38754;&#20914;&#20987;&#23545;&#28040;&#36153;&#30340;&#20256;&#23548;&#29575;&#22823;&#20110;&#27491;&#38754;&#20914;&#20987;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#36890;&#36807;&#32771;&#34385;&#25910;&#20837;&#20998;&#24067;&#39640;&#38454;&#30697;&#30340;&#24433;&#21709;&#65292;&#34913;&#37327;&#20102;&#25910;&#20837;&#20914;&#20987;&#23545;&#28040;&#36153;&#20445;&#38505;&#30340;&#24433;&#21709;&#31243;&#24230;&#12290;&#25105;&#20204;&#23548;&#20986;&#20102;&#19968;&#20010;&#38750;&#32447;&#24615;&#28040;&#36153;&#20989;&#25968;&#65292;&#20854;&#20013;&#20445;&#38505;&#31243;&#24230;&#38543;&#30528;&#25910;&#20837;&#20914;&#20987;&#30340;&#31526;&#21495;&#21644;&#22823;&#23567;&#32780;&#21464;&#21270;&#12290;&#21033;&#29992;PSID&#25968;&#25454;&#65292;&#25105;&#20204;&#20272;&#35745;&#20102;&#22351;&#30340;&#30456;&#23545;&#20110;&#22909;&#30340;&#27704;&#20037;&#24615;&#20914;&#20987;&#30340;&#38750;&#23545;&#31216;&#20256;&#23548;&#29575;-- 3 sigma&#36127;&#20914;&#20987;&#30340;&#30340;17%&#20256;&#23548;&#21040;&#28040;&#36153;&#65292;&#32780;&#30456;&#21516;&#22823;&#23567;&#30340;&#27491;&#20914;&#20987;&#21482;&#26377;9%&#20256;&#23548;&#21040;&#28040;&#36153;-- &#38543;&#30528;&#20914;&#20987;&#24694;&#21270;&#65292;&#20256;&#23548;&#29575;&#22686;&#21152;&#12290;&#25105;&#20204;&#30340;&#32467;&#26524;&#19982;&#23545;&#20551;&#24819;&#20107;&#20214;&#28040;&#36153;&#21453;&#24212;&#30340;&#35843;&#26597;&#19968;&#33268;&#65292;&#24182;&#34920;&#26126;&#23614;&#37096;&#25910;&#20837;&#39118;&#38505;&#23545;&#28040;&#36153;&#20855;&#26377;&#37325;&#35201;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
We measure the extent of consumption insurance to income shocks accounting for high-order moments of the income distribution. We derive a nonlinear consumption function, in which the extent of insurance varies with the sign and magnitude of income shocks. Using PSID data, we estimate an asymmetric pass-through of bad versus good permanent shocks -- 17% of a 3 sigma negative shock transmits to consumption compared to 9% of an equal-sized positive shock -- and the pass-through increases as the shock worsens. Our results are consistent with surveys of consumption responses to hypothetical events and suggest that tail income risk matters substantially for consumption.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#20449;&#20219;&#21830;&#21697;&#24066;&#22330;&#20013;&#19987;&#23478;&#38144;&#21806;&#32773;&#21644;&#23458;&#25143;&#20043;&#38388;&#30340;&#36890;&#35759;&#38382;&#39064;&#65292;&#25552;&#20379;&#20102;&#20960;&#20309;&#29305;&#24449;&#25551;&#36848;&#21644;&#24517;&#35201;&#26465;&#20214;&#65292;&#20197;&#21450;&#23545;&#20108;&#20803;&#24773;&#24418;&#19979;&#30340;&#25152;&#26377;&#22343;&#34913;&#36827;&#34892;&#20102;&#31119;&#21033;&#20998;&#26512;&#12290;</title><link>http://arxiv.org/abs/2303.13295</link><description>&lt;p&gt;
&#22404;&#26029;&#24615;&#20449;&#20219;&#21830;&#21697;&#24066;&#22330;&#20013;&#30340;&#20449;&#24687;&#20256;&#36882;
&lt;/p&gt;
&lt;p&gt;
Information transmission in monopolistic credence goods markets. (arXiv:2303.13295v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.13295
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#20449;&#20219;&#21830;&#21697;&#24066;&#22330;&#20013;&#19987;&#23478;&#38144;&#21806;&#32773;&#21644;&#23458;&#25143;&#20043;&#38388;&#30340;&#36890;&#35759;&#38382;&#39064;&#65292;&#25552;&#20379;&#20102;&#20960;&#20309;&#29305;&#24449;&#25551;&#36848;&#21644;&#24517;&#35201;&#26465;&#20214;&#65292;&#20197;&#21450;&#23545;&#20108;&#20803;&#24773;&#24418;&#19979;&#30340;&#25152;&#26377;&#22343;&#34913;&#36827;&#34892;&#20102;&#31119;&#21033;&#20998;&#26512;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#19968;&#20010;&#28085;&#30422; $N$ &#20010;&#38382;&#39064;&#31867;&#22411;&#21644; $N$ &#31181;&#27835;&#30103;&#26041;&#27861;&#30340;&#20449;&#20219;&#21830;&#21697;&#27169;&#22411;&#12290;&#19987;&#23478;&#38144;&#21806;&#32773;&#21644;&#23458;&#25143;&#20043;&#38388;&#30340;&#36890;&#35759;&#34987;&#24314;&#27169;&#20026;&#24265;&#20215;&#35848;&#21028;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#22312;&#27495;&#35270;&#24615;&#23450;&#20215;&#19979;&#65292;&#19987;&#23478;&#30340;&#22343;&#34913;&#22238;&#25253;&#20855;&#26377;&#20960;&#20309;&#29305;&#24449;&#25551;&#36848;&#65292;&#21363;&#19987;&#23478;&#20197;&#20449;&#24565;&#21033;&#28070;&#20989;&#25968;&#30340;&#25311;&#19979;&#20984;&#21253;&#20026;&#20195;&#20215;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#23458;&#25143;&#26368;&#24046;&#30340;&#22343;&#34913;&#23384;&#22312;&#24615;&#65292;&#24182;&#23558;&#36825;&#20010;&#20960;&#20309;&#29305;&#24449;&#24212;&#29992;&#20110;&#20043;&#21069;&#20851;&#20110;&#20449;&#20219;&#21830;&#21697;&#30340;&#30740;&#31350;&#20013;&#65292;&#24182;&#20026;&#36890;&#35759;&#20309;&#26102;&#26377;&#30410;&#20110;&#19987;&#23478;&#25552;&#20379;&#20102;&#20805;&#20998;&#24517;&#35201;&#26465;&#20214;&#12290;&#23545;&#20110;&#20108;&#20803;&#24773;&#24418;&#65292;&#25105;&#20204;&#27714;&#35299;&#20102;&#25152;&#26377;&#22343;&#34913;&#65292;&#24182;&#20998;&#26512;&#20102;&#23427;&#20204;&#30340;&#31119;&#21033;&#23646;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study a general credence goods model with $N$ problem types and $N$ treatments. Communication between the expert seller and the client is modeled as cheap talk. We find that the expert's equilibrium payoffs admit a geometric characterization, described by the quasiconcave envelope of his belief-based profits function under discriminatory pricing. We establish the existence of client-worst equilibria, apply the geometric characterization to previous research on credence goods, and provide a necessary and sufficient condition for when communication benefits the expert. For the binary case, we solve for all equilibria and analyze their welfare properties.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#32593;&#32476;&#32467;&#26500;&#19979;&#27178;&#21521;&#21160;&#21147;&#23398;&#30340;&#26694;&#26550;&#65292;&#21487;&#20197;&#29992;&#20110;&#20272;&#35745;&#21160;&#24577;&#32593;&#32476;&#25928;&#24212;&#21644;&#24314;&#27169;&#38477;&#32500;&#31561;&#24212;&#29992;&#12290;&#31532;&#19968;&#27425;&#24212;&#29992;&#35813;&#26694;&#26550;&#26102;&#65292;&#20316;&#32773;&#20272;&#35745;&#20102;&#37096;&#38376;&#29983;&#20135;&#21147;&#20914;&#20987;&#22914;&#20309;&#27839;&#30528;&#20379;&#24212;&#38142;&#20256;&#36755;&#24182;&#24433;&#21709;&#32654;&#22269;&#32463;&#27982;&#20013;&#37096;&#38376;&#20215;&#26684;&#30340;&#21160;&#24577;&#12290;&#20998;&#26512;&#34920;&#26126;&#65292;&#32593;&#32476;&#20301;&#32622;&#19981;&#20165;&#21487;&#20197;&#35299;&#37322;&#32463;&#27982;&#21464;&#21270;&#30340;&#24378;&#24230;&#65292;&#36824;&#21487;&#20197;&#35299;&#37322;&#20379;&#24212;&#38142;&#30340;&#20316;&#29992;&#12290;</title><link>http://arxiv.org/abs/2211.13610</link><description>&lt;p&gt;
&#32593;&#32476;&#32467;&#26500;&#19979;&#30340;&#27178;&#21521;&#21160;&#21147;&#23398;: &#29702;&#35770;&#21450;&#20854;&#23439;&#35266;&#32463;&#27982;&#23398;&#24212;&#29992;
&lt;/p&gt;
&lt;p&gt;
Cross-Sectional Dynamics Under Network Structure: Theory and Macroeconomic Applications. (arXiv:2211.13610v2 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2211.13610
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#32593;&#32476;&#32467;&#26500;&#19979;&#27178;&#21521;&#21160;&#21147;&#23398;&#30340;&#26694;&#26550;&#65292;&#21487;&#20197;&#29992;&#20110;&#20272;&#35745;&#21160;&#24577;&#32593;&#32476;&#25928;&#24212;&#21644;&#24314;&#27169;&#38477;&#32500;&#31561;&#24212;&#29992;&#12290;&#31532;&#19968;&#27425;&#24212;&#29992;&#35813;&#26694;&#26550;&#26102;&#65292;&#20316;&#32773;&#20272;&#35745;&#20102;&#37096;&#38376;&#29983;&#20135;&#21147;&#20914;&#20987;&#22914;&#20309;&#27839;&#30528;&#20379;&#24212;&#38142;&#20256;&#36755;&#24182;&#24433;&#21709;&#32654;&#22269;&#32463;&#27982;&#20013;&#37096;&#38376;&#20215;&#26684;&#30340;&#21160;&#24577;&#12290;&#20998;&#26512;&#34920;&#26126;&#65292;&#32593;&#32476;&#20301;&#32622;&#19981;&#20165;&#21487;&#20197;&#35299;&#37322;&#32463;&#27982;&#21464;&#21270;&#30340;&#24378;&#24230;&#65292;&#36824;&#21487;&#20197;&#35299;&#37322;&#20379;&#24212;&#38142;&#30340;&#20316;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35768;&#22810;&#32463;&#27982;&#23398;&#39046;&#22495;&#37117;&#28041;&#21450;&#36890;&#36807;&#21452;&#36793;&#32852;&#31995;&#32852;&#31995;&#22312;&#19968;&#36215;&#30340;&#21333;&#20301;&#27178;&#21521;&#20999;&#38754;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#30740;&#31350;&#21033;&#29992;&#36825;&#31181;&#32593;&#32476;&#32467;&#26500;&#30740;&#31350;&#27178;&#21521;&#21464;&#37327;&#21160;&#24577;&#30340;&#26694;&#26550;&#12290;&#23427;&#26159;&#19968;&#20010;&#30690;&#37327;&#33258;&#22238;&#24402;&#65292;&#20854;&#20013;&#21019;&#26032;&#20165;&#36890;&#36807;&#21452;&#36793;&#32852;&#31995;&#22312;&#27178;&#21521;&#20256;&#36755;&#65292;&#24182;&#19988;&#21487;&#20197;&#23481;&#32435;&#32593;&#32476;&#25928;&#24212;&#30340;&#39640;&#38454;&#22914;&#20309;&#38543;&#26102;&#38388;&#32047;&#31215;&#30340;&#20016;&#23500;&#27169;&#24335;&#12290;&#35813;&#27169;&#22411;&#21487;&#29992;&#20110;&#20272;&#35745;&#21160;&#24577;&#32593;&#32476;&#25928;&#24212;&#65292;&#20854;&#20013;&#32593;&#32476;&#30001;&#25968;&#25454;&#20013;&#30340;&#21160;&#24577;&#20132;&#21449;&#30456;&#20851;&#24615;&#30830;&#23450;&#25110;&#25512;&#26029;&#12290;&#23427;&#36824;&#25552;&#20379;&#20102;&#19968;&#31181;&#24314;&#27169;(new_word)&#30340;&#38477;&#32500;&#25216;&#26415;&#65292;&#22240;&#20026;&#32593;&#32476;&#33021;&#22815;&#36890;&#36807;&#30456;&#23545;&#36739;&#23569;&#30340;&#38750;&#38646;&#21452;&#36793;&#38142;&#25509;&#27719;&#24635;&#21333;&#20301;&#20043;&#38388;&#30340;&#22797;&#26434;&#20851;&#31995;&#12290;
&lt;/p&gt;
&lt;p&gt;
Many environments in economics feature a cross-section of units linked by bilateral ties. I develop a framework for studying dynamics of cross-sectional variables exploiting this network structure. It is a vector autoregression in which innovations transmit cross-sectionally only via bilateral links and which can accommodate rich patterns of how network effects of higher order accumulate over time. The model can be used to estimate dynamic network effects, with the network given or inferred from dynamic cross-correlations in the data. It also offers a dimensionality-reduction technique for modeling (cross-sectional) processes, owing to networks' ability to summarize complex relations among units by relatively few non-zero bilateral links. In a first application, I estimate how sectoral productivity shocks transmit along supply chain linkages and affect dynamics of sectoral prices in the US economy. The analysis suggests that network positions can rationalize not only the strength of a 
&lt;/p&gt;</description></item></channel></rss>