<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#20154;&#24037;&#26234;&#33021;&#22312;&#37329;&#34701;&#30417;&#31649;&#26041;&#38754;&#30340;&#24212;&#29992;&#26377;&#21161;&#20110;&#24494;&#35266;&#30417;&#31649;&#65292;&#20294;&#23545;&#20110;&#23439;&#35266;&#30417;&#31649;&#26469;&#35828;&#23384;&#22312;&#25361;&#25112;&#12290;&#23613;&#31649;&#22914;&#27492;&#65292;&#30001;&#20110;&#25104;&#26412;&#25928;&#30410;&#21644;&#20934;&#30830;&#24615;&#30340;&#20248;&#21183;&#65292;AI&#24456;&#21487;&#33021;&#21462;&#20195;&#39640;&#27700;&#24179;&#30340;&#24314;&#35758;&#21644;&#20915;&#31574;&#12290;</title><link>http://arxiv.org/abs/2310.11293</link><description>&lt;p&gt;
&#20851;&#20110;&#20154;&#24037;&#26234;&#33021;&#22312;&#37329;&#34701;&#30417;&#31649;&#20013;&#30340;&#24212;&#29992;&#21450;&#23545;&#37329;&#34701;&#31283;&#23450;&#30340;&#24433;&#21709;
&lt;/p&gt;
&lt;p&gt;
On the use of artificial intelligence in financial regulations and the impact on financial stability. (arXiv:2310.11293v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.11293
&lt;/p&gt;
&lt;p&gt;
&#20154;&#24037;&#26234;&#33021;&#22312;&#37329;&#34701;&#30417;&#31649;&#26041;&#38754;&#30340;&#24212;&#29992;&#26377;&#21161;&#20110;&#24494;&#35266;&#30417;&#31649;&#65292;&#20294;&#23545;&#20110;&#23439;&#35266;&#30417;&#31649;&#26469;&#35828;&#23384;&#22312;&#25361;&#25112;&#12290;&#23613;&#31649;&#22914;&#27492;&#65292;&#30001;&#20110;&#25104;&#26412;&#25928;&#30410;&#21644;&#20934;&#30830;&#24615;&#30340;&#20248;&#21183;&#65292;AI&#24456;&#21487;&#33021;&#21462;&#20195;&#39640;&#27700;&#24179;&#30340;&#24314;&#35758;&#21644;&#20915;&#31574;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20154;&#24037;&#26234;&#33021;&#65288;AI&#65289;&#27491;&#22312;&#37329;&#34701;&#30417;&#31649;&#39046;&#22495;&#36805;&#36895;&#21457;&#23637;&#12290;&#23545;&#20110;&#24494;&#35266;&#30417;&#31649;&#65288;&#22914;&#28040;&#36153;&#32773;&#20445;&#25252;&#21644;&#24120;&#35268;&#38134;&#34892;&#30417;&#31649;&#65289;&#26469;&#35828;&#65292;&#30001;&#20110;&#25968;&#25454;&#20016;&#23500;&#12289;&#26102;&#38388;&#21608;&#26399;&#30701;&#12289;&#30446;&#26631;&#26126;&#30830;&#21644;&#37325;&#22797;&#20915;&#31574;&#65292;AI&#23558;&#21463;&#30410;&#12290;&#28982;&#32780;&#65292;&#23545;&#20110;&#20851;&#27880;&#25972;&#20010;&#37329;&#34701;&#31995;&#32479;&#31283;&#23450;&#30340;&#23439;&#35266;&#30417;&#31649;&#26469;&#35828;&#65292;&#30001;&#20110;&#19981;&#32463;&#24120;&#21457;&#29983;&#19988;&#22823;&#22810;&#25968;&#26159;&#29420;&#29305;&#20107;&#20214;&#65292;AI&#23398;&#20064;&#21463;&#21040;&#25361;&#25112;&#12290;&#22312;&#26497;&#24230;&#21387;&#21147;&#19979;&#65292;&#20998;&#24067;&#24335;&#30340;&#20154;&#31867;&#20915;&#31574;&#27604;&#38598;&#20013;&#24335;&#30340;AI&#20915;&#31574;&#26356;&#20855;&#20248;&#21183;&#65292;&#32780;&#19988;&#30001;&#20110;&#24040;&#22823;&#30340;&#38169;&#35823;&#25104;&#26412;&#65292;&#36825;&#20063;&#24341;&#21457;&#20102;&#23545;&#20110;&#23439;&#35266;&#30417;&#31649;&#20013;AI&#20351;&#29992;&#30340;&#36136;&#30097;&#12290;&#23613;&#31649;&#22914;&#27492;&#65292;&#30001;&#20110;&#25104;&#26412;&#25928;&#30410;&#12289;&#31283;&#20581;&#24615;&#21644;&#20934;&#30830;&#24615;&#20248;&#20110;&#20154;&#31867;&#30417;&#31649;&#32773;&#65292;AI&#24456;&#21487;&#33021;&#24708;&#28982;&#21462;&#20195;&#36234;&#26469;&#36234;&#39640;&#27700;&#24179;&#30340;&#24314;&#35758;&#21644;&#20915;&#31574;&#32780;&#34987;&#24191;&#27867;&#20351;&#29992;&#12290;&#25105;&#20204;&#25552;&#20986;&#20845;&#20010;&#21028;&#26029;AI&#20351;&#29992;&#36866;&#21512;&#24615;&#30340;&#26631;&#20934;&#12290;
&lt;/p&gt;
&lt;p&gt;
Artificial intelligence (AI) is making rapid inroads in financial regulations. It will benefit micro regulations, concerned with issues like consumer protection and routine banking regulations, because of ample data, short time horizons, clear objectives, and repeated decisions that leave plenty of data for AI to train on. It is different with macro regulations focused on the stability of the entire financial system. Here, infrequent and mostly unique events frustrate AI learning. Distributed human decision making in times of extreme stress has strong advantages over centralised AI decisions, which, coupled with the catastrophic cost of mistakes, raises questions about AI used in macro regulations. However, AI will likely become widely used by stealth as it takes over increasingly high level advice and decisions, driven by significant cost efficiencies, robustness and accuracy compared to human regulators. We propose six criteria against which to judge the suitability of AI use by the 
&lt;/p&gt;</description></item><item><title>&#35813;&#30740;&#31350;&#35843;&#26597;&#20102;&#20840;&#38754;&#24615;&#20581;&#24247;&#25945;&#32946;&#23545;&#20010;&#20307;&#29983;&#21629;&#21608;&#26399;&#30340;&#24433;&#21709;&#65292;&#30740;&#31350;&#32467;&#26524;&#26174;&#31034;&#65292;&#35813;&#25945;&#32946;&#25913;&#38761;&#23545;&#30007;&#24615;&#21644;&#22899;&#24615;&#20135;&#29983;&#20102;&#31215;&#26497;&#30340;&#24433;&#21709;&#65292;&#38477;&#20302;&#20102;&#24615;&#21035;&#19981;&#24179;&#31561;&#65292;&#21516;&#26102;&#20063;&#40723;&#21169;&#20102;&#19979;&#19968;&#20195;&#22899;&#24615;&#30340;&#26426;&#20250;&#21644;&#33258;&#20027;&#26435;&#12290;</title><link>http://arxiv.org/abs/2310.11151</link><description>&lt;p&gt;
&#20840;&#38754;&#24615;&#20581;&#24247;&#25945;&#32946;&#30340;&#29983;&#21629;&#21608;&#26399;&#25928;&#24212;
&lt;/p&gt;
&lt;p&gt;
Life-Cycle Effects of Comprehensive Sex Education. (arXiv:2310.11151v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.11151
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#35843;&#26597;&#20102;&#20840;&#38754;&#24615;&#20581;&#24247;&#25945;&#32946;&#23545;&#20010;&#20307;&#29983;&#21629;&#21608;&#26399;&#30340;&#24433;&#21709;&#65292;&#30740;&#31350;&#32467;&#26524;&#26174;&#31034;&#65292;&#35813;&#25945;&#32946;&#25913;&#38761;&#23545;&#30007;&#24615;&#21644;&#22899;&#24615;&#20135;&#29983;&#20102;&#31215;&#26497;&#30340;&#24433;&#21709;&#65292;&#38477;&#20302;&#20102;&#24615;&#21035;&#19981;&#24179;&#31561;&#65292;&#21516;&#26102;&#20063;&#40723;&#21169;&#20102;&#19979;&#19968;&#20195;&#22899;&#24615;&#30340;&#26426;&#20250;&#21644;&#33258;&#20027;&#26435;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24615;&#25945;&#32946;&#21487;&#20197;&#24433;&#21709;&#23398;&#29983;&#30340;&#24615;&#34892;&#20026;&#65292;&#24182;&#20256;&#36798;&#26377;&#20851;&#23478;&#24237;&#24418;&#25104;&#21644;&#36131;&#20219;&#30340;&#31038;&#20250;&#35268;&#33539;&#65292;&#36825;&#23545;&#20182;&#20204;&#30340;&#26410;&#26469;&#20135;&#29983;&#37325;&#35201;&#24433;&#21709;&#12290;&#20026;&#20102;&#30740;&#31350;&#31038;&#20250;&#35268;&#33539;&#20256;&#36882;&#30340;&#29983;&#21629;&#21608;&#26399;&#25928;&#24212;&#65292;&#26412;&#30740;&#31350;&#21033;&#29992;&#29790;&#20856;&#23567;&#23398;40&#24180;&#20195;&#33267;50&#24180;&#20195;&#24341;&#20837;&#20840;&#38754;&#24615;&#20581;&#24247;&#25945;&#32946;&#30340;&#24773;&#20917;&#36827;&#34892;&#20102;&#35843;&#26597;&#12290;&#22312;&#36825;&#19968;&#26102;&#26399;&#65292;&#21463;&#21040;&#31038;&#20250;&#27665;&#20027;&#20215;&#20540;&#35266;&#30340;&#21551;&#21457;&#65292;&#24615;&#25945;&#32946;&#25945;&#23548;&#23398;&#29983;&#20851;&#20110;&#31105;&#27442;&#12289;&#29702;&#24615;&#30340;&#23478;&#24237;&#35745;&#21010;&#36873;&#25321;&#20197;&#21450;&#23545;&#20010;&#20154;&#20915;&#31574;&#25215;&#25285;&#31038;&#20250;&#36131;&#20219;&#30340;&#37325;&#35201;&#24615;&#12290;&#35813;&#30740;&#31350;&#36816;&#29992;&#20102;&#19968;&#31181;&#20808;&#36827;&#30340;&#8220;&#24046;&#24322;&#21644;&#24046;&#24322;&#8221;&#26041;&#27861;&#26469;&#35780;&#20272;&#30007;&#24615;&#21644;&#22899;&#24615;&#22312;&#25972;&#20010;&#29983;&#21629;&#21608;&#26399;&#20013;&#21508;&#31181;&#32467;&#26524;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;&#35813;&#25913;&#38761;&#23545;&#30007;&#24615;&#21644;&#22899;&#24615;&#30340;&#22823;&#22810;&#25968;&#39044;&#26399;&#32467;&#26524;&#20135;&#29983;&#24433;&#21709;&#65292;&#26368;&#32456;&#38477;&#20302;&#20102;&#25910;&#20837;&#26041;&#38754;&#30340;&#24615;&#21035;&#19981;&#24179;&#31561;&#12290;&#35813;&#25913;&#38761;&#30340;&#24433;&#21709;&#20063;&#24310;&#20280;&#21040;&#20102;&#19979;&#19968;&#20195;&#22899;&#24615;&#65292;&#40723;&#21169;&#22905;&#20204;&#25317;&#26377;&#26356;&#22810;&#30340;&#26426;&#20250;&#21644;&#33258;&#20027;&#26435;&#12290;
&lt;/p&gt;
&lt;p&gt;
Sex education can impact pupils sexual activity and convey the social norms regarding family formation and responsibility, which can have significant consequences to their future. To investigate the life-cycle effects of social norm transmission, this study drew on the introduction of comprehensive sex education in the curriculum of Swedish primary schools during the 1940s to the 1950s. Inspired by social-democratic values, sex education during this period taught students about abstinence, rational family planning choices, and the importance of taking social responsibility for their personal decisions. The study applied a state-of-the-art estimator of the difference-in-differences method to various outcomes of men and women throughout the life cycle. The results showed that the reform affected most intended outcomes for men and women, ultimately decreasing gender inequality in earnings. The effects of the reform also extended to the succeding generation of girls, encouraging them to ch
&lt;/p&gt;</description></item><item><title>&#35813;&#30740;&#31350;&#23545;&#21360;&#24230;&#20799;&#31461;&#23398;&#20064;&#33521;&#35821;&#30340;&#25945;&#32946;&#24212;&#29992;&#31243;&#24207;&#36827;&#34892;&#20102;&#22522;&#20110;&#31454;&#36187;&#30340;&#24178;&#39044;&#65292;&#20197;&#24110;&#21161;&#20182;&#20204;&#24314;&#31435;&#23398;&#20064;&#20064;&#24815;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#22312;&#31454;&#36187;&#32467;&#26463;&#21518;&#30340;12&#21608;&#65292;&#27835;&#30103;&#32452;&#32487;&#32493;&#20445;&#25345;&#23545;&#24212;&#29992;&#31243;&#24207;&#30340;&#21442;&#19982;&#12290;</title><link>http://arxiv.org/abs/2310.10850</link><description>&lt;p&gt;
&#22312;&#25945;&#32946;&#25216;&#26415;&#20013;&#30340;&#25968;&#23383;&#24178;&#39044;&#21644;&#20064;&#24815;&#24418;&#25104;
&lt;/p&gt;
&lt;p&gt;
Digital interventions and habit formation in educational technology. (arXiv:2310.10850v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.10850
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#23545;&#21360;&#24230;&#20799;&#31461;&#23398;&#20064;&#33521;&#35821;&#30340;&#25945;&#32946;&#24212;&#29992;&#31243;&#24207;&#36827;&#34892;&#20102;&#22522;&#20110;&#31454;&#36187;&#30340;&#24178;&#39044;&#65292;&#20197;&#24110;&#21161;&#20182;&#20204;&#24314;&#31435;&#23398;&#20064;&#20064;&#24815;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#22312;&#31454;&#36187;&#32467;&#26463;&#21518;&#30340;12&#21608;&#65292;&#27835;&#30103;&#32452;&#32487;&#32493;&#20445;&#25345;&#23545;&#24212;&#29992;&#31243;&#24207;&#30340;&#21442;&#19982;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38543;&#30528;&#22312;&#32447;&#25945;&#32946;&#25216;&#26415;&#20135;&#21697;&#36234;&#26469;&#36234;&#24120;&#35265;&#65292;&#22823;&#37327;&#35777;&#25454;&#25351;&#20986;&#65292;&#23398;&#20064;&#32773;&#24448;&#24448;&#24456;&#38590;&#24314;&#31435;&#35268;&#24459;&#30340;&#23398;&#20064;&#20064;&#24815;&#24182;&#23436;&#25104;&#20182;&#20204;&#30340;&#35838;&#31243;&#12290;&#19982;&#27492;&#21516;&#26102;&#65292;&#38754;&#21521;&#23089;&#20048;&#21644;&#31038;&#20132;&#20114;&#21160;&#30340;&#22312;&#32447;&#20135;&#21697;&#26377;&#26102;&#22312;&#22686;&#21152;&#29992;&#25143;&#21442;&#19982;&#24230;&#21644;&#21019;&#36896;&#39057;&#32321;&#20351;&#29992;&#20064;&#24815;&#26041;&#38754;&#38750;&#24120;&#26377;&#25928;&#65292;&#21364;&#26080;&#24847;&#20013;&#23548;&#33268;&#25968;&#23383;&#19978;&#30270;&#65292;&#29305;&#21035;&#26159;&#22312;&#38738;&#23569;&#24180;&#20013;&#12290;&#22312;&#36825;&#20010;&#39033;&#30446;&#20013;&#65292;&#25105;&#20204;&#22312;&#19968;&#20010;&#29992;&#20110;&#21360;&#24230;&#20799;&#31461;&#23398;&#20064;&#33521;&#35821;&#30340;&#25945;&#32946;&#24212;&#29992;&#31243;&#24207;&#19978;&#36827;&#34892;&#20102;&#22522;&#20110;&#31454;&#36187;&#30340;&#24178;&#39044;&#65292;&#36825;&#22312;&#23089;&#20048;&#29615;&#22659;&#20013;&#24456;&#24120;&#35265;&#12290;&#22823;&#32422;&#19968;&#19975;&#21517;&#38543;&#26426;&#36873;&#25321;&#30340;&#23398;&#20064;&#32773;&#21442;&#21152;&#20102;&#19968;&#20010;&#20026;&#26399;100&#22825;&#30340;&#38405;&#35835;&#31454;&#36187;&#12290;&#22914;&#26524;&#20182;&#20204;&#22312;&#22522;&#20110;&#23398;&#20064;&#20869;&#23481;&#28040;&#32791;&#37327;&#30340;&#25490;&#34892;&#27036;&#19978;&#25490;&#21517;&#36275;&#22815;&#39640;&#65292;&#20182;&#20204;&#23558;&#36194;&#24471;&#19968;&#22871;&#23454;&#20307;&#20070;&#31821;&#20316;&#20026;&#22870;&#21697;&#12290;&#27604;&#36187;&#32467;&#26463;&#21518;&#30340;12&#21608;&#65292;&#24403;&#27835;&#30103;&#32452;&#27809;&#26377;&#39069;&#22806;&#30340;&#28608;&#21169;&#20351;&#29992;&#35813;&#24212;&#29992;&#31243;&#24207;&#26102;&#65292;&#20182;&#20204;&#32487;&#32493;&#21442;&#19982;&#20854;&#20013;&#12290;
&lt;/p&gt;
&lt;p&gt;
As online educational technology products have become increasingly prevalent, rich evidence indicates that learners often find it challenging to establish regular learning habits and complete their programs. Concurrently, online products geared towards entertainment and social interactions are sometimes so effective in increasing user engagement and creating frequent usage habits that they inadvertently lead to digital addiction, especially among youth. In this project, we carry out a contest-based intervention, common in the entertainment context, on an educational app for Indian children learning English. Approximately ten thousand randomly selected learners entered a 100-day reading contest. They would win a set of physical books if they ranked sufficiently high on a leaderboard based on the amount of educational content consumed. Twelve weeks after the end of the contest, when the treatment group had no additional incentives to use the app, they continued their engagement with it a
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#20027;&#35201;&#30740;&#31350;&#20102;&#25903;&#25345;AI&#29983;&#25104;&#20869;&#23481;&#30340;&#25293;&#21334;&#26426;&#21046;&#35774;&#35745;&#65292;&#36890;&#36807;&#25552;&#20986;&#20196;&#29260;&#25293;&#21334;&#27169;&#22411;&#65292;&#23454;&#29616;&#20102;&#20197;&#28608;&#21169;&#20860;&#23481;&#30340;&#26041;&#24335;&#32858;&#21512;&#22810;&#20010;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65292;&#24182;&#29992;&#20110;&#32467;&#21512;&#19981;&#21516;&#24191;&#21578;&#21830;&#30340;&#36755;&#20837;&#12290;&#36825;&#20010;&#26426;&#21046;&#35774;&#35745;&#26377;&#29420;&#29305;&#30340;&#29305;&#28857;&#65292;&#24182;&#36890;&#36807;&#21046;&#23450;&#33258;&#28982;&#30340;&#28608;&#21169;&#29305;&#24615;&#24471;&#21040;&#20102;&#39564;&#35777;&#12290;</title><link>http://arxiv.org/abs/2310.10826</link><description>&lt;p&gt;
&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#30340;&#26426;&#21046;&#35774;&#35745;
&lt;/p&gt;
&lt;p&gt;
Mechanism Design for Large Language Models. (arXiv:2310.10826v1 [cs.GT])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.10826
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#20027;&#35201;&#30740;&#31350;&#20102;&#25903;&#25345;AI&#29983;&#25104;&#20869;&#23481;&#30340;&#25293;&#21334;&#26426;&#21046;&#35774;&#35745;&#65292;&#36890;&#36807;&#25552;&#20986;&#20196;&#29260;&#25293;&#21334;&#27169;&#22411;&#65292;&#23454;&#29616;&#20102;&#20197;&#28608;&#21169;&#20860;&#23481;&#30340;&#26041;&#24335;&#32858;&#21512;&#22810;&#20010;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65292;&#24182;&#29992;&#20110;&#32467;&#21512;&#19981;&#21516;&#24191;&#21578;&#21830;&#30340;&#36755;&#20837;&#12290;&#36825;&#20010;&#26426;&#21046;&#35774;&#35745;&#26377;&#29420;&#29305;&#30340;&#29305;&#28857;&#65292;&#24182;&#36890;&#36807;&#21046;&#23450;&#33258;&#28982;&#30340;&#28608;&#21169;&#29305;&#24615;&#24471;&#21040;&#20102;&#39564;&#35777;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#25293;&#21334;&#26426;&#21046;&#20197;&#25903;&#25345;&#26032;&#20852;&#30340;AI&#29983;&#25104;&#20869;&#23481;&#30340;&#26684;&#24335;&#12290;&#25105;&#20204;&#29305;&#21035;&#30740;&#31350;&#22914;&#20309;&#20197;&#28608;&#21169;&#20860;&#23481;&#30340;&#26041;&#24335;&#32858;&#21512;&#22810;&#20010;LLM&#12290;&#22312;&#36825;&#20010;&#38382;&#39064;&#20013;&#65292;&#27599;&#20010;&#20195;&#29702;&#23545;&#38543;&#26426;&#29983;&#25104;&#30340;&#20869;&#23481;&#30340;&#20559;&#22909;&#34987;&#25551;&#36848;/&#32534;&#30721;&#20026;&#19968;&#20010;LLM&#12290;&#35774;&#35745;&#19968;&#20010;&#29992;&#20110;AI&#29983;&#25104;&#30340;&#24191;&#21578;&#21019;&#24847;&#30340;&#25293;&#21334;&#26684;&#24335;&#26469;&#32467;&#21512;&#26469;&#33258;&#19981;&#21516;&#24191;&#21578;&#21830;&#30340;&#36755;&#20837;&#26159;&#19968;&#20010;&#20851;&#38190;&#21160;&#26426;&#12290;&#25105;&#20204;&#35748;&#20026;&#65292;&#23613;&#31649;&#36825;&#20010;&#38382;&#39064;&#36890;&#24120;&#23646;&#20110;&#26426;&#21046;&#35774;&#35745;&#30340;&#33539;&#30068;&#65292;&#20294;&#23427;&#20855;&#26377;&#19968;&#20123;&#29420;&#29305;&#30340;&#29305;&#28857;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#36890;&#29992;&#30340;&#24418;&#24335;&#21270;&#26041;&#27861;&#8212;&#8212;&#20196;&#29260;&#25293;&#21334;&#27169;&#22411;&#8212;&#8212;&#26469;&#30740;&#31350;&#36825;&#20010;&#38382;&#39064;&#12290;&#36825;&#20010;&#27169;&#22411;&#30340;&#19968;&#20010;&#20851;&#38190;&#29305;&#28857;&#26159;&#23427;&#20197;&#20196;&#29260;&#20026;&#21333;&#20301;&#36827;&#34892;&#25805;&#20316;&#65292;&#24182;&#20801;&#35768;LLM&#20195;&#29702;&#36890;&#36807;&#19968;&#32500;&#20986;&#20215;&#24433;&#21709;&#29983;&#25104;&#30340;&#20869;&#23481;&#12290;&#25105;&#20204;&#39318;&#20808;&#25506;&#35752;&#20102;&#19968;&#20010;&#24378;&#22823;&#30340;&#25293;&#21334;&#35774;&#35745;&#26041;&#27861;&#65292;&#20854;&#20013;&#25105;&#20204;&#20551;&#35774;&#30340;&#26159;&#20195;&#29702;&#20154;&#30340;&#20559;&#22909;&#28041;&#21450;&#21040;&#32467;&#26524;&#20998;&#24067;&#30340;&#20559;&#24207;&#12290;&#25105;&#20204;&#21046;&#23450;&#20102;&#20004;&#20010;&#33258;&#28982;&#30340;&#28608;&#21169;&#29305;&#24615;&#65292;&#24182;&#35777;&#26126;&#20102;&#36825;&#20123;&#29305;&#24615;&#30340;&#37325;&#35201;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
We investigate auction mechanisms to support the emerging format of AI-generated content. We in particular study how to aggregate several LLMs in an incentive compatible manner. In this problem, the preferences of each agent over stochastically generated contents are described/encoded as an LLM. A key motivation is to design an auction format for AI-generated ad creatives to combine inputs from different advertisers. We argue that this problem, while generally falling under the umbrella of mechanism design, has several unique features. We propose a general formalism -- the token auction model -- for studying this problem. A key feature of this model is that it acts on a token-by-token basis and lets LLM agents influence generated contents through single dimensional bids.  We first explore a robust auction design approach, in which all we assume is that agent preferences entail partial orders over outcome distributions. We formulate two natural incentive properties, and show that these 
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#26465;&#20214;&#65292;&#21487;&#20197;&#29992;&#29983;&#25104;&#20989;&#25968;&#26469;&#34920;&#24449;&#20869;&#29983;&#32593;&#32476;&#24418;&#25104;&#36807;&#31243;&#30340;&#31283;&#24577;&#20998;&#24067;&#12290;&#36825;&#20010;&#26465;&#20214;&#19982;&#32593;&#32476;&#20043;&#38388;&#30340;&#36716;&#21270;&#20989;&#25968;&#26377;&#20851;&#65292;&#24403;&#36825;&#20010;&#36716;&#21270;&#19982;&#32593;&#32476;&#20043;&#38388;&#30340;&#36716;&#21270;&#29420;&#31435;&#26102;&#65292;&#35777;&#26126;&#20102;&#35813;&#36807;&#31243;&#26159;&#21487;&#36870;&#30340;&#65292;&#22240;&#27492;&#21487;&#20197;&#26500;&#36896;&#20986;&#19968;&#20010;&#29983;&#25104;&#20989;&#25968;&#12290;&#21033;&#29992;&#36825;&#20010;&#31283;&#24577;&#20998;&#24067;&#65292;&#30740;&#31350;&#20102;&#21516;&#36136;&#21160;&#21147;&#23398;&#21644;&#22269;&#38469;&#36152;&#26131;&#27169;&#22411;&#30340;&#38271;&#26399;&#29305;&#24615;&#12290;</title><link>http://arxiv.org/abs/2310.10764</link><description>&lt;p&gt;
&#21487;&#22788;&#29702;&#30340;&#20869;&#29983;&#32593;&#32476;&#24418;&#25104;&#27169;&#22411;&#20013;&#30340;&#32858;&#21512;&#26041;&#24335;
&lt;/p&gt;
&lt;p&gt;
Tractable Aggregation in Endogenous Network Formation Models. (arXiv:2310.10764v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.10764
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#26465;&#20214;&#65292;&#21487;&#20197;&#29992;&#29983;&#25104;&#20989;&#25968;&#26469;&#34920;&#24449;&#20869;&#29983;&#32593;&#32476;&#24418;&#25104;&#36807;&#31243;&#30340;&#31283;&#24577;&#20998;&#24067;&#12290;&#36825;&#20010;&#26465;&#20214;&#19982;&#32593;&#32476;&#20043;&#38388;&#30340;&#36716;&#21270;&#20989;&#25968;&#26377;&#20851;&#65292;&#24403;&#36825;&#20010;&#36716;&#21270;&#19982;&#32593;&#32476;&#20043;&#38388;&#30340;&#36716;&#21270;&#29420;&#31435;&#26102;&#65292;&#35777;&#26126;&#20102;&#35813;&#36807;&#31243;&#26159;&#21487;&#36870;&#30340;&#65292;&#22240;&#27492;&#21487;&#20197;&#26500;&#36896;&#20986;&#19968;&#20010;&#29983;&#25104;&#20989;&#25968;&#12290;&#21033;&#29992;&#36825;&#20010;&#31283;&#24577;&#20998;&#24067;&#65292;&#30740;&#31350;&#20102;&#21516;&#36136;&#21160;&#21147;&#23398;&#21644;&#22269;&#38469;&#36152;&#26131;&#27169;&#22411;&#30340;&#38271;&#26399;&#29305;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#22312;&#20869;&#29983;&#32593;&#32476;&#24418;&#25104;&#36807;&#31243;&#20013;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#26465;&#20214;&#65292;&#21487;&#20197;&#21033;&#29992;&#29983;&#25104;&#20989;&#25968;&#26469;&#34920;&#24449;&#38543;&#26426;&#32593;&#32476;&#24418;&#25104;&#36807;&#31243;&#30340;&#31283;&#24577;&#20998;&#24067;&#12290;&#36825;&#20123;&#26465;&#20214;&#26159;&#26681;&#25454;&#32593;&#32476;&#20043;&#38388;&#30340;&#36716;&#21270;&#20989;&#25968;&#32473;&#20986;&#30340;&#65306;&#22914;&#26524;&#20004;&#20010;&#32593;&#32476;&#20043;&#38388;&#30340;&#24635;&#36716;&#21270;&#19981;&#20381;&#36182;&#20110;&#36825;&#20123;&#32593;&#32476;&#22914;&#20309;&#30456;&#20114;&#36716;&#21270;&#65288;&#36890;&#36807;&#28155;&#21152;&#25110;&#21024;&#38500;&#38142;&#25509;&#65289;&#65292;&#37027;&#20040;&#35813;&#36807;&#31243;&#26159;&#21487;&#36870;&#30340;&#65292;&#24182;&#19988;&#21487;&#20197;&#26500;&#36896;&#19968;&#20010;&#29983;&#25104;&#20989;&#25968;&#12290;&#24403;&#32593;&#32476;&#24418;&#25104;&#36807;&#31243;&#36890;&#36807;&#31163;&#25955;&#38142;&#25509;&#36873;&#25321;&#32473;&#20986;&#26102;&#65292;&#36825;&#20010;&#36807;&#31243;&#31561;&#20215;&#20110;&#35777;&#26126;&#19982;&#30456;&#20851;&#25928;&#29992;&#20989;&#25968;&#30456;&#20851;&#32852;&#30340;&#21338;&#24328;&#26159;&#19968;&#20010;&#28508;&#22312;&#21338;&#24328;&#12290;&#36825;&#24847;&#21619;&#30528;&#28508;&#22312;&#21338;&#24328;&#30340;&#29305;&#24449;&#19982;&#32593;&#32476;&#24418;&#25104;&#36807;&#31243;&#30340;&#21487;&#36870;&#24615;&#21644;&#21487;&#22788;&#29702;&#24615;&#26377;&#20851;&#12290;&#28982;&#21518;&#65292;&#25105;&#21033;&#29992;&#21051;&#30011;&#30340;&#31283;&#24577;&#20998;&#24067;&#30740;&#31350;&#21516;&#36136;&#21160;&#21147;&#23398;&#21644;&#22269;&#38469;&#36152;&#26131;&#31616;&#21333;&#27169;&#22411;&#30340;&#38271;&#26399;&#29305;&#24615;&#12290;&#22312;&#28155;&#21152;&#21069;&#30651;&#24615;&#30340;&#20195;&#29702;&#20154;&#21644;&#36716;&#25442;&#26102;&#30340;&#25928;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper presents new conditions under which the stationary distribution of a stochastic network formation process can be characterized in terms of a generating function. These conditions are given in terms of a transforming function between networks: if the total transformation between two networks is independent of how these networks transform into each other (by adding or deleting links), then the process is reversible and a generating function can be constructed. When the network formation process is given by discrete choices of link formation, this procedure is equivalent to proving that the game with the associated utilities is a potential game. This implies that the potential game characterization is related to reversibility and tractability of network formation processes. I then use the characterized stationary distribution to study long-run properties of simple models of homophilic dynamics and international trade. The effects of adding forward-looking agents and switching c
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#35752;&#35770;&#20102;&#31185;&#23398;&#30740;&#31350;&#21644;&#31454;&#20105;&#32972;&#26223;&#19979;&#21331;&#36234;&#30340;&#27010;&#24565;&#12290;</title><link>http://arxiv.org/abs/2310.09588</link><description>&lt;p&gt;
"&#20851;&#20110;&#31185;&#23398;&#21331;&#36234;&#19982;&#31454;&#20105;&#30340;&#35770;&#25991;"
&lt;/p&gt;
&lt;p&gt;
\"Uber wissenschaftliche Exzellenz und Wettbewerb. (arXiv:2310.09588v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.09588
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#35752;&#35770;&#20102;&#31185;&#23398;&#30740;&#31350;&#21644;&#31454;&#20105;&#32972;&#26223;&#19979;&#21331;&#36234;&#30340;&#27010;&#24565;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36861;&#27714;&#21331;&#36234;&#20284;&#20046;&#26159;&#23398;&#26415;&#30028;&#30340;&#30495;&#27491;&#30446;&#26631;&#12290;&#21331;&#36234;&#26159;&#20160;&#20040;&#24847;&#24605;&#65311;&#33021;&#21542;&#34913;&#37327;&#21331;&#36234;&#65311;&#26412;&#25991;&#35752;&#35770;&#20102;&#22312;&#30740;&#31350;&#21644;&#31454;&#20105;&#30340;&#32972;&#26223;&#19979;&#21331;&#36234;&#30340;&#27010;&#24565;&#12290;
&lt;/p&gt;
&lt;p&gt;
The pursuit of excellence seems to be the True North of academia. What is meant by excellence? Can excellence be measured? This article discusses the concept of excellence in the context of research and competition.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#26032;&#39062;&#30340;&#26694;&#26550;&#65292;&#29992;&#20110;&#30740;&#31350;&#20849;&#26377;&#36164;&#28304;&#30340;&#37319;&#38598;&#21644;&#20154;&#31867;-&#29615;&#22659;&#31995;&#32479;&#20013;&#30340;&#21512;&#20316;&#12290;&#36890;&#36807;&#32771;&#34385;&#36164;&#28304;&#21487;&#29992;&#24615;&#21644;&#20849;&#35782;&#25928;&#24212;&#31561;&#22240;&#32032;&#65292;&#25105;&#20204;&#30830;&#23450;&#20102;&#22312;&#19981;&#21516;&#24773;&#26223;&#19979;&#30830;&#20445;&#36164;&#28304;&#21487;&#25345;&#32493;&#24615;&#30340;&#20851;&#38190;&#20540;&#12290;</title><link>http://arxiv.org/abs/2310.07577</link><description>&lt;p&gt;
&#36164;&#28304;&#21487;&#29992;&#24615;&#21644;&#20849;&#35782;&#25928;&#24212;&#23545;&#20849;&#26377;&#36164;&#28304;&#30340;&#21487;&#25345;&#32493;&#24615;&#30340;&#24433;&#21709;
&lt;/p&gt;
&lt;p&gt;
Impact of resource availability and conformity effect on sustainability of common-pool resources. (arXiv:2310.07577v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.07577
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#26032;&#39062;&#30340;&#26694;&#26550;&#65292;&#29992;&#20110;&#30740;&#31350;&#20849;&#26377;&#36164;&#28304;&#30340;&#37319;&#38598;&#21644;&#20154;&#31867;-&#29615;&#22659;&#31995;&#32479;&#20013;&#30340;&#21512;&#20316;&#12290;&#36890;&#36807;&#32771;&#34385;&#36164;&#28304;&#21487;&#29992;&#24615;&#21644;&#20849;&#35782;&#25928;&#24212;&#31561;&#22240;&#32032;&#65292;&#25105;&#20204;&#30830;&#23450;&#20102;&#22312;&#19981;&#21516;&#24773;&#26223;&#19979;&#30830;&#20445;&#36164;&#28304;&#21487;&#25345;&#32493;&#24615;&#30340;&#20851;&#38190;&#20540;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20849;&#26377;&#36164;&#28304;&#30340;&#21487;&#25345;&#32493;&#24615;&#21462;&#20915;&#20110;&#20154;&#31867;&#21644;&#29615;&#22659;&#31995;&#32479;&#20043;&#38388;&#30340;&#30456;&#20114;&#20316;&#29992;&#12290;&#28982;&#32780;&#65292;&#30446;&#21069;&#36824;&#32570;&#20047;&#19968;&#20010;&#26032;&#39062;&#21644;&#20840;&#38754;&#30340;&#26694;&#26550;&#26469;&#24314;&#27169;&#20849;&#26377;&#36164;&#28304;&#30340;&#37319;&#38598;&#21644;&#20154;&#31867;&#20195;&#29702;&#20154;&#30340;&#21512;&#20316;&#65292;&#33021;&#22815;&#32771;&#34385;&#21040;&#22609;&#36896;&#31995;&#32479;&#34892;&#20026;&#21644;&#32467;&#26524;&#30340;&#19981;&#21516;&#22240;&#32032;&#12290;&#29305;&#21035;&#26159;&#65292;&#25105;&#20204;&#20173;&#28982;&#32570;&#20047;&#22312;&#19981;&#21516;&#24773;&#26223;&#19979;&#30830;&#20445;&#36164;&#28304;&#21487;&#25345;&#32493;&#24615;&#30340;&#20851;&#38190;&#20540;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#26032;&#39062;&#30340;&#26694;&#26550;&#65292;&#29992;&#20110;&#30740;&#31350;&#20849;&#26377;&#36164;&#28304;&#30340;&#36164;&#28304;&#37319;&#38598;&#21644;&#20154;&#31867;-&#29615;&#22659;&#31995;&#32479;&#20013;&#30340;&#21512;&#20316;&#12290;&#25105;&#20204;&#25506;&#35752;&#20102;&#19981;&#21516;&#22240;&#32032;&#65292;&#22914;&#36164;&#28304;&#21487;&#29992;&#24615;&#21644;&#20849;&#35782;&#25928;&#24212;&#65292;&#23545;&#21442;&#19982;&#32773;&#20915;&#31574;&#21644;&#36164;&#28304;&#32467;&#26524;&#30340;&#24433;&#21709;&#12290;&#25105;&#20204;&#30830;&#23450;&#20102;&#22312;&#19981;&#21516;&#24773;&#26223;&#19979;&#30830;&#20445;&#36164;&#28304;&#21487;&#25345;&#32493;&#24615;&#30340;&#20851;&#38190;&#20540;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#35266;&#23519;&#21040;&#30340;&#29616;&#35937;&#23545;&#27169;&#22411;&#30340;&#22797;&#26434;&#24615;&#21644;&#20551;&#35774;&#30340;&#31283;&#20581;&#24615;&#65292;&#24182;&#35752;&#35770;&#20102;&#30740;&#31350;&#23545;&#25919;&#31574;&#21644;&#23454;&#36341;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
Sustainability of common-pool resources hinges on the interplay between human and environmental systems. However, there is still a lack of a novel and comprehensive framework for modelling extraction of common-pool resources and cooperation of human agents that can account for different factors that shape the system behavior and outcomes. In particular, we still lack a critical value for ensuring resource sustainability under different scenarios. In this paper, we present a novel framework for studying resource extraction and cooperation in human-environmental systems for common-pool resources. We explore how different factors, such as resource availability and conformity effect, influence the players' decisions and the resource outcomes. We identify critical values for ensuring resource sustainability under various scenarios. We demonstrate the observed phenomena are robust to the complexity and assumptions of the models and discuss implications of our study for policy and practice, a
&lt;/p&gt;</description></item><item><title>&#36825;&#31687;&#35770;&#25991;&#36890;&#36807;&#26681;&#26412;&#24615;&#30340;&#25913;&#38761;&#65292;&#23558;&#30005;&#23376;&#36135;&#24065;&#32435;&#20837;&#32463;&#27982;&#19982;&#37329;&#34701;&#29702;&#35770;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#29702;&#35770;&#26694;&#26550;&#65292;&#21253;&#25324;&#30005;&#23376;&#36135;&#24065;&#30340;&#20272;&#20540;&#22522;&#20110;&#23439;&#35266;&#32463;&#27982;&#29702;&#35770;&#21644;&#36135;&#24065;&#25919;&#31574;&#30340;&#22522;&#26412;&#26041;&#31243;&#65292;&#20197;&#21450;&#30005;&#23376;&#36135;&#24065;&#31649;&#29702;&#20844;&#21496;&#20316;&#20026;&#21327;&#35843;&#27425;&#32463;&#27982;&#20307;&#36135;&#24065;&#21644;&#36130;&#25919;&#25919;&#31574;&#30340;&#23454;&#20307;&#12290;&#35813;&#30740;&#31350;&#36991;&#20813;&#20351;&#29992;&#26222;&#36941;&#20294;&#19981;&#36866;&#24403;&#30340;&#25351;&#25968;&#39118;&#38505;&#27169;&#22411;&#65292;&#32780;&#26159;&#37319;&#29992;&#22810;&#26102;&#38388;&#23610;&#24230;&#30340;&#27169;&#22411;&#12290;</title><link>http://arxiv.org/abs/2310.04986</link><description>&lt;p&gt;
&#19968;&#31181;&#20851;&#20110;&#36135;&#24065;&#30340;&#26032;&#30340;&#32463;&#27982;&#19982;&#37329;&#34701;&#29702;&#35770;
&lt;/p&gt;
&lt;p&gt;
A new economic and financial theory of money. (arXiv:2310.04986v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.04986
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#36890;&#36807;&#26681;&#26412;&#24615;&#30340;&#25913;&#38761;&#65292;&#23558;&#30005;&#23376;&#36135;&#24065;&#32435;&#20837;&#32463;&#27982;&#19982;&#37329;&#34701;&#29702;&#35770;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#29702;&#35770;&#26694;&#26550;&#65292;&#21253;&#25324;&#30005;&#23376;&#36135;&#24065;&#30340;&#20272;&#20540;&#22522;&#20110;&#23439;&#35266;&#32463;&#27982;&#29702;&#35770;&#21644;&#36135;&#24065;&#25919;&#31574;&#30340;&#22522;&#26412;&#26041;&#31243;&#65292;&#20197;&#21450;&#30005;&#23376;&#36135;&#24065;&#31649;&#29702;&#20844;&#21496;&#20316;&#20026;&#21327;&#35843;&#27425;&#32463;&#27982;&#20307;&#36135;&#24065;&#21644;&#36130;&#25919;&#25919;&#31574;&#30340;&#23454;&#20307;&#12290;&#35813;&#30740;&#31350;&#36991;&#20813;&#20351;&#29992;&#26222;&#36941;&#20294;&#19981;&#36866;&#24403;&#30340;&#25351;&#25968;&#39118;&#38505;&#27169;&#22411;&#65292;&#32780;&#26159;&#37319;&#29992;&#22810;&#26102;&#38388;&#23610;&#24230;&#30340;&#27169;&#22411;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#23545;&#32463;&#27982;&#19982;&#37329;&#34701;&#29702;&#35770;&#36827;&#34892;&#20102;&#26681;&#26412;&#24615;&#25913;&#38761;&#65292;&#21253;&#25324;&#30005;&#23376;&#36135;&#24065;&#22312;&#20869;&#12290;&#30005;&#23376;&#36135;&#24065;&#30340;&#20272;&#20540;&#23558;&#22522;&#20110;&#23439;&#35266;&#32463;&#27982;&#29702;&#35770;&#21644;&#36135;&#24065;&#25919;&#31574;&#30340;&#22522;&#26412;&#26041;&#31243;&#65292;&#32780;&#19981;&#26159;&#24494;&#35266;&#32463;&#27982;&#23398;&#20013;&#30340;&#36148;&#29616;&#29616;&#37329;&#27969;&#29702;&#35770;&#12290;&#19982;&#23558;&#32929;&#31080;&#35270;&#20026;&#19982;&#27425;&#32463;&#27982;&#20307;&#30340;&#26080;&#24418;&#36164;&#20135;&#20851;&#32852;&#30340;&#25152;&#26377;&#26435;&#19981;&#21516;&#65292;&#25105;&#20204;&#23558;&#21457;&#23637;&#30005;&#23376;&#36135;&#24065;&#20316;&#20026;&#19982;&#27425;&#32463;&#27982;&#20307;&#26377;&#24418;&#36164;&#20135;&#20851;&#32852;&#30340;&#20132;&#26131;&#26435;&#30410;&#30340;&#35266;&#28857;&#12290;&#25105;&#20204;&#36824;&#23558;&#21457;&#23637;&#30005;&#23376;&#36135;&#24065;&#31649;&#29702;&#20844;&#21496;&#20316;&#20026;&#19968;&#20010;&#36127;&#36131;&#21327;&#35843;&#27425;&#32463;&#27982;&#20307;&#30340;&#36135;&#24065;&#65288;&#30005;&#23376;&#36135;&#24065;&#20379;&#24212;&#21644;&#20215;&#20540;&#31283;&#23450;&#65289;&#21644;&#36130;&#25919;&#65288;&#25237;&#36164;&#21644;&#36816;&#33829;&#65289;&#25919;&#31574;&#30340;&#23454;&#20307;&#30340;&#35270;&#35282;&#65292;&#20197;&#23454;&#29616;&#30005;&#23376;&#36135;&#24065;&#30340;&#27969;&#21160;&#24615;&#12290;&#22312;&#20272;&#20540;&#21644;&#20915;&#31574;&#20013;&#20351;&#29992;&#30340;&#39118;&#38505;&#27169;&#22411;&#19981;&#20250;&#26159;&#26080;&#22788;&#19981;&#22312;&#20294;&#19981;&#21512;&#36866;&#30340;&#25351;&#25968;&#39118;&#38505;&#27169;&#22411;&#65292;&#23427;&#23558;&#23548;&#33268;&#36148;&#29616;&#29575;&#65292;&#32780;&#26159;&#22810;&#26102;&#38388;&#23610;&#24230;&#30340;&#27169;&#22411;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper fundamentally reformulates economic and financial theory to include electronic currencies. The valuation of the electronic currencies will be based on macroeconomic theory and the fundamental equation of monetary policy, not the microeconomic theory of discounted cash flows. The view of electronic currency as a transactional equity associated with tangible assets of a sub-economy will be developed, in contrast to the view of stock as an equity associated mostly with intangible assets of a sub-economy. The view will be developed of the electronic currency management firm as an entity responsible for coordinated monetary (electronic currency supply and value stabilization) and fiscal (investment and operational) policies of a substantial (for liquidity of the electronic currency) sub-economy. The risk model used in the valuations and the decision-making will not be the ubiquitous, yet inappropriate, exponential risk model that leads to discount rates, but will be multi time sc
&lt;/p&gt;</description></item><item><title>DeepVol&#26159;&#19968;&#31181;&#29992;&#20110;&#36890;&#29992;&#36164;&#20135;&#27874;&#21160;&#24615;&#24314;&#27169;&#30340;&#28145;&#24230;&#36801;&#31227;&#23398;&#20064;&#26041;&#27861;&#65292;&#36890;&#36807;&#19968;&#20010;&#36890;&#29992;&#27169;&#22411;&#26377;&#25928;&#22320;&#25429;&#25417;&#21644;&#24314;&#27169;&#25152;&#26377;&#37329;&#34701;&#36164;&#20135;&#30340;&#27874;&#21160;&#24615;&#21160;&#24577;&#65292;&#21487;&#33021;&#25913;&#21464;&#23545;&#27874;&#21160;&#24615;&#30340;&#29702;&#35299;&#21644;&#39044;&#27979;&#26041;&#24335;&#12290;</title><link>http://arxiv.org/abs/2309.02072</link><description>&lt;p&gt;
DeepVol&#65306;&#19968;&#31181;&#29992;&#20110;&#36890;&#29992;&#36164;&#20135;&#27874;&#21160;&#24615;&#24314;&#27169;&#30340;&#28145;&#24230;&#36801;&#31227;&#23398;&#20064;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
DeepVol: A Deep Transfer Learning Approach for Universal Asset Volatility Modeling. (arXiv:2309.02072v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.02072
&lt;/p&gt;
&lt;p&gt;
DeepVol&#26159;&#19968;&#31181;&#29992;&#20110;&#36890;&#29992;&#36164;&#20135;&#27874;&#21160;&#24615;&#24314;&#27169;&#30340;&#28145;&#24230;&#36801;&#31227;&#23398;&#20064;&#26041;&#27861;&#65292;&#36890;&#36807;&#19968;&#20010;&#36890;&#29992;&#27169;&#22411;&#26377;&#25928;&#22320;&#25429;&#25417;&#21644;&#24314;&#27169;&#25152;&#26377;&#37329;&#34701;&#36164;&#20135;&#30340;&#27874;&#21160;&#24615;&#21160;&#24577;&#65292;&#21487;&#33021;&#25913;&#21464;&#23545;&#27874;&#21160;&#24615;&#30340;&#29702;&#35299;&#21644;&#39044;&#27979;&#26041;&#24335;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#26032;&#30340;&#28145;&#24230;&#23398;&#20064;&#27874;&#21160;&#24615;&#27169;&#22411;DeepVol&#65292;&#23427;&#22312;&#27169;&#22411;&#30340;&#24191;&#27867;&#24615;&#26041;&#38754;&#20248;&#20110;&#20256;&#32479;&#30340;&#35745;&#37327;&#32463;&#27982;&#27169;&#22411;&#12290;DeepVol&#21033;&#29992;&#36801;&#31227;&#23398;&#20064;&#30340;&#33021;&#21147;&#65292;&#36890;&#36807;&#19968;&#20010;&#36890;&#29992;&#27169;&#22411;&#26377;&#25928;&#22320;&#25429;&#25417;&#21644;&#24314;&#27169;&#25152;&#26377;&#37329;&#34701;&#36164;&#20135;&#30340;&#27874;&#21160;&#24615;&#21160;&#24577;&#65292;&#21253;&#25324;&#20197;&#21069;&#26410;&#35265;&#36807;&#30340;&#36164;&#20135;&#12290;&#36825;&#19982;&#35745;&#37327;&#32463;&#27982;&#23398;&#25991;&#29486;&#20013;&#30340;&#20027;&#27969;&#20570;&#27861;&#24418;&#25104;&#40092;&#26126;&#23545;&#27604;&#65292;&#21518;&#32773;&#38656;&#35201;&#20026;&#19981;&#21516;&#25968;&#25454;&#38598;&#35757;&#32451;&#21333;&#29420;&#30340;&#27169;&#22411;&#12290;&#24341;&#20837;DeepVol&#20026;&#37329;&#34701;&#34892;&#19994;&#30340;&#27874;&#21160;&#24615;&#24314;&#27169;&#21644;&#39044;&#27979;&#24320;&#36767;&#20102;&#26032;&#30340;&#36884;&#24452;&#65292;&#21487;&#33021;&#20250;&#25913;&#21464;&#23545;&#27874;&#21160;&#24615;&#30340;&#29702;&#35299;&#21644;&#39044;&#27979;&#26041;&#24335;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper introduces DeepVol, a promising new deep learning volatility model that outperforms traditional econometric models in terms of model generality. DeepVol leverages the power of transfer learning to effectively capture and model the volatility dynamics of all financial assets, including previously unseen ones, using a single universal model. This contrasts to the prevailing practice in econometrics literature, which necessitates training separate models for individual datasets. The introduction of DeepVol opens up new avenues for volatility modeling and forecasting in the finance industry, potentially transforming the way volatility is understood and predicted.
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#19968;&#20123;&#22269;&#23478;&#27861;&#24459;&#23545;&#39640;&#21033;&#24687;&#36151;&#27454;&#30340;&#38480;&#21046;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#25193;&#23637;&#38480;&#21046;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#35777;&#26126;&#36825;&#20010;&#25193;&#23637;&#19982;&#19968;&#32452;&#33258;&#28982;&#20844;&#29702;&#30456;&#19968;&#33268;&#12290;</title><link>http://arxiv.org/abs/2307.08861</link><description>&lt;p&gt;
&#19968;&#39033;&#25918;&#36151;&#27861;&#24459;&#65306;&#19968;&#20010;&#28548;&#28165;
&lt;/p&gt;
&lt;p&gt;
A usury law: a clarification. (arXiv:2307.08861v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.08861
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#19968;&#20123;&#22269;&#23478;&#27861;&#24459;&#23545;&#39640;&#21033;&#24687;&#36151;&#27454;&#30340;&#38480;&#21046;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#25193;&#23637;&#38480;&#21046;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#35777;&#26126;&#36825;&#20010;&#25193;&#23637;&#19982;&#19968;&#32452;&#33258;&#28982;&#20844;&#29702;&#30456;&#19968;&#33268;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#19968;&#20123;&#22269;&#23478;&#30340;&#22269;&#23478;&#27861;&#24459;&#31105;&#27490;&#20197;&#39640;&#21033;&#24687;&#36151;&#27454;&#12290;&#22823;&#22810;&#25968;&#22269;&#23478;&#38480;&#21046;&#26377;&#25928;&#21033;&#29575;&#65288;&#32780;&#19981;&#20165;&#20165;&#26159;&#21517;&#20041;&#21033;&#29575;&#65289;&#65292;&#20854;&#20013;&#21253;&#25324;&#25152;&#26377;&#21487;&#33021;&#19982;&#36151;&#27454;&#30456;&#20851;&#30340;&#20323;&#37329;&#21644;&#36153;&#29992;&#12290;&#22312;&#36825;&#31181;&#24773;&#20917;&#19979;&#65292;&#23545;&#20110;&#29616;&#37329;&#27969;&#27809;&#26377;&#20869;&#37096;&#22238;&#25253;&#29575;&#30340;&#36151;&#27454;&#65292;&#38480;&#21046;&#19981;&#26126;&#30830;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#22914;&#20309;&#23558;&#27492;&#38480;&#21046;&#25193;&#23637;&#21040;&#25152;&#26377;&#36151;&#27454;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#23384;&#22312;&#19968;&#20010;&#29420;&#29305;&#30340;&#25193;&#23637;&#65292;&#19982;&#19968;&#32452;&#33258;&#28982;&#20844;&#29702;&#19968;&#33268;&#12290;
&lt;/p&gt;
&lt;p&gt;
The national legislation of some countries prohibits lending money at a usurious interest rate. Most countries restrict the effective (rather than nominal) interest rate, which includes all commissions and fees that may come with a loan. In this case, the restriction is vague for loans whose cash flow steams have no internal rate of return. In this note, we show how to extend this restriction to all loans. We prove that there is a unique such extension consistent with a set of natural axioms.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#19968;&#31181;&#26032;&#30340;&#22810;&#20803;&#27010;&#29575;CRPS&#23398;&#20064;&#26041;&#27861;&#65292;&#24212;&#29992;&#20110;&#26085;&#21069;&#30005;&#20215;&#39044;&#27979;&#20013;&#65292;&#30456;&#27604;&#20110;&#32479;&#19968;&#32452;&#21512;&#22312;CRPS&#26041;&#38754;&#21462;&#24471;&#20102;&#26174;&#33879;&#25913;&#36827;&#12290;</title><link>http://arxiv.org/abs/2303.10019</link><description>&lt;p&gt;
&#22810;&#20803;&#27010;&#29575;CRPS&#23398;&#20064;&#21450;&#20854;&#22312;&#26085;&#21069;&#30005;&#20215;&#39044;&#27979;&#20013;&#30340;&#24212;&#29992;
&lt;/p&gt;
&lt;p&gt;
Multivariate Probabilistic CRPS Learning with an Application to Day-Ahead Electricity Prices. (arXiv:2303.10019v1 [stat.ML])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.10019
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#19968;&#31181;&#26032;&#30340;&#22810;&#20803;&#27010;&#29575;CRPS&#23398;&#20064;&#26041;&#27861;&#65292;&#24212;&#29992;&#20110;&#26085;&#21069;&#30005;&#20215;&#39044;&#27979;&#20013;&#65292;&#30456;&#27604;&#20110;&#32479;&#19968;&#32452;&#21512;&#22312;CRPS&#26041;&#38754;&#21462;&#24471;&#20102;&#26174;&#33879;&#25913;&#36827;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#32771;&#34385;&#20998;&#20301;&#25968;&#21644;&#21327;&#21464;&#37327;&#20381;&#36182;&#20851;&#31995;&#30340;&#22810;&#20803;&#27010;&#29575;&#39044;&#27979;&#30340;&#32467;&#21512;&#26041;&#27861;&#65292;&#24182;&#36890;&#36807;&#24179;&#28369;&#36807;&#31243;&#20801;&#35768;&#22312;&#32447;&#23398;&#20064;&#12290;&#36890;&#36807;&#32500;&#25968;&#38477;&#20302;&#21644;&#32602;&#20989;&#25968;&#24179;&#28369;&#31561;&#20004;&#31181;&#24179;&#28369;&#26041;&#27861;&#26469;&#23558;&#26631;&#20934;CRPS&#23398;&#20064;&#26694;&#26550;&#25512;&#24191;&#21040;&#22810;&#20803;&#32500;&#24230;&#20013;&#12290;&#23558;&#35813;&#26041;&#27861;&#24212;&#29992;&#20110;&#39044;&#27979;&#26085;&#21069;&#30005;&#20215;&#65292;&#30456;&#27604;&#20110;&#32479;&#19968;&#32452;&#21512;&#65292;&#22312;CRPS&#26041;&#38754;&#21462;&#24471;&#20102;&#26174;&#33879;&#25913;&#36827;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper presents a new method for combining (or aggregating or ensembling) multivariate probabilistic forecasts, taking into account dependencies between quantiles and covariates through a smoothing procedure that allows for online learning. Two smoothing methods are discussed: dimensionality reduction using Basis matrices and penalized smoothing. The new online learning algorithm generalizes the standard CRPS learning framework into multivariate dimensions. It is based on Bernstein Online Aggregation (BOA) and yields optimal asymptotic learning properties. We provide an in-depth discussion on possible extensions of the algorithm and several nested cases related to the existing literature on online forecast combination. The methodology is applied to forecasting day-ahead electricity prices, which are 24-dimensional distributional forecasts. The proposed method yields significant improvements over uniform combination in terms of continuous ranked probability score (CRPS). We discuss 
&lt;/p&gt;</description></item><item><title>&#20351;&#29992;&#28145;&#24230;&#23398;&#20064;&#65288;LSTM&#65289;&#21644;&#23454;&#29616;&#27874;&#21160;&#29575;&#27979;&#37327;&#30340;&#26032;&#26694;&#26550;&#33021;&#22815;&#20849;&#21516;&#24314;&#27169;&#25910;&#30410;&#21644;&#23454;&#29616;&#27874;&#21160;&#29575;&#27979;&#37327;&#65292;&#22312;&#32479;&#35745;&#25512;&#26029;&#21644;&#39044;&#27979;&#26041;&#38754;&#20855;&#26377;&#20986;&#33394;&#30340;&#24615;&#33021;&#65292;&#24182;&#19988;&#33021;&#22815;&#36866;&#24212;&#27874;&#21160;&#29575;&#30340;&#23450;&#24335;&#20107;&#23454;&#12290;</title><link>http://arxiv.org/abs/2302.08002</link><description>&lt;p&gt;
&#28145;&#24230;&#23398;&#20064;&#22686;&#24378;&#30340;&#23454;&#29616;GARCH&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
Deep Learning Enhanced Realized GARCH. (arXiv:2302.08002v2 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2302.08002
&lt;/p&gt;
&lt;p&gt;
&#20351;&#29992;&#28145;&#24230;&#23398;&#20064;&#65288;LSTM&#65289;&#21644;&#23454;&#29616;&#27874;&#21160;&#29575;&#27979;&#37327;&#30340;&#26032;&#26694;&#26550;&#33021;&#22815;&#20849;&#21516;&#24314;&#27169;&#25910;&#30410;&#21644;&#23454;&#29616;&#27874;&#21160;&#29575;&#27979;&#37327;&#65292;&#22312;&#32479;&#35745;&#25512;&#26029;&#21644;&#39044;&#27979;&#26041;&#38754;&#20855;&#26377;&#20986;&#33394;&#30340;&#24615;&#33021;&#65292;&#24182;&#19988;&#33021;&#22815;&#36866;&#24212;&#27874;&#21160;&#29575;&#30340;&#23450;&#24335;&#20107;&#23454;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#27874;&#21160;&#29575;&#24314;&#27169;&#26041;&#27861;&#65292;&#23558;&#28145;&#24230;&#23398;&#20064;&#65288;LSTM&#65289;&#21644;&#23454;&#29616;&#27874;&#21160;&#29575;&#27979;&#37327;&#32467;&#21512;&#36215;&#26469;&#12290;&#36825;&#31181;LSTM&#22686;&#24378;&#30340;&#23454;&#29616;GARCH&#26694;&#26550;&#34701;&#21512;&#20102;&#37329;&#34701;&#35745;&#37327;&#23398;&#12289;&#39640;&#39057;&#20132;&#26131;&#25968;&#25454;&#21644;&#28145;&#24230;&#23398;&#20064;&#30340;&#24314;&#27169;&#36827;&#23637;&#12290;&#36890;&#36807;&#39034;&#24207;&#33945;&#29305;&#21345;&#27931;&#26041;&#27861;&#37319;&#29992;&#36125;&#21494;&#26031;&#25512;&#26029;&#36827;&#34892;&#32479;&#35745;&#25512;&#26029;&#21644;&#39044;&#27979;&#12290;&#26032;&#30340;&#26694;&#26550;&#33021;&#22815;&#20849;&#21516;&#24314;&#27169;&#25910;&#30410;&#21644;&#23454;&#29616;&#27874;&#21160;&#29575;&#27979;&#37327;&#65292;&#20855;&#26377;&#38750;&#24120;&#22909;&#30340;&#20869;&#26679;&#26412;&#25311;&#21512;&#21644;&#36229;&#36807;&#20960;&#20010;&#22522;&#20934;&#27169;&#22411;&#30340;&#39044;&#27979;&#24615;&#33021;&#65292;&#21516;&#26102;&#33021;&#22815;&#24456;&#22909;&#22320;&#36866;&#24212;&#27874;&#21160;&#29575;&#30340;&#23450;&#24335;&#20107;&#23454;&#12290;&#20351;&#29992;&#24191;&#27867;&#20132;&#26131;&#30340;31&#20010;&#32929;&#31080;&#25351;&#25968;&#36827;&#34892;&#20102;&#20840;&#38754;&#23454;&#35777;&#30740;&#31350;&#65292;&#28085;&#30422;&#20102;&#21253;&#25324;COVID-19&#22823;&#27969;&#34892;&#22312;&#20869;&#30340;&#26102;&#38388;&#27573;&#12290;
&lt;/p&gt;
&lt;p&gt;
We propose a new approach to volatility modeling by combining deep learning (LSTM) and realized volatility measures. This LSTM-enhanced realized GARCH framework incorporates and distills modeling advances from financial econometrics, high frequency trading data and deep learning. Bayesian inference via the Sequential Monte Carlo method is employed for statistical inference and forecasting. The new framework can jointly model the returns and realized volatility measures, has an excellent in-sample fit and superior predictive performance compared to several benchmark models, while being able to adapt well to the stylized facts in volatility. The performance of the new framework is tested using a wide range of metrics, from marginal likelihood, volatility forecasting, to tail risk forecasting and option pricing. We report on a comprehensive empirical study using 31 widely traded stock indices over a time period that includes COVID-19 pandemic.
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22810;&#30446;&#26631;&#31574;&#30053;&#23398;&#20064;&#65288;MOPoL&#65289;&#26041;&#27861;&#65292;&#32467;&#21512;&#20102;&#26368;&#20248;&#20915;&#31574;&#26641;&#21644;&#22810;&#30446;&#26631;&#36125;&#21494;&#26031;&#20248;&#21270;&#26041;&#27861;&#65292;&#21487;&#20197;&#24179;&#34913;&#22810;&#20010;&#24863;&#20852;&#36259;&#30340;&#32467;&#26524;&#12290;</title><link>http://arxiv.org/abs/2212.06312</link><description>&lt;p&gt;
&#23545;&#22810;&#20010;&#24863;&#20852;&#36259;&#32467;&#26524;&#30340;&#31574;&#30053;&#23398;&#20064;&#65306;&#23558;&#26368;&#20248;&#31574;&#30053;&#26641;&#19982;&#22810;&#30446;&#26631;&#36125;&#21494;&#26031;&#20248;&#21270;&#30456;&#32467;&#21512;
&lt;/p&gt;
&lt;p&gt;
Policy learning for many outcomes of interest: Combining optimal policy trees with multi-objective Bayesian optimisation. (arXiv:2212.06312v2 [cs.LG] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2212.06312
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22810;&#30446;&#26631;&#31574;&#30053;&#23398;&#20064;&#65288;MOPoL&#65289;&#26041;&#27861;&#65292;&#32467;&#21512;&#20102;&#26368;&#20248;&#20915;&#31574;&#26641;&#21644;&#22810;&#30446;&#26631;&#36125;&#21494;&#26031;&#20248;&#21270;&#26041;&#27861;&#65292;&#21487;&#20197;&#24179;&#34913;&#22810;&#20010;&#24863;&#20852;&#36259;&#30340;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#23398;&#20064;&#26368;&#20248;&#31574;&#30053;&#30340;&#26041;&#27861;&#20351;&#29992;&#22240;&#26524;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#26469;&#21019;&#24314;&#20154;&#31867;&#21487;&#35299;&#37322;&#30340;&#35268;&#21017;&#65292;&#20197;&#22312;&#19981;&#21516;&#25919;&#31574;&#24178;&#39044;&#20998;&#37197;&#20013;&#36827;&#34892;&#36873;&#25321;&#12290;&#28982;&#32780;&#65292;&#22312;&#29616;&#23454;&#20013;&#30340;&#25919;&#31574;&#21046;&#23450;&#29615;&#22659;&#20013;&#65292;&#20915;&#31574;&#32773;&#36890;&#24120;&#20851;&#24515;&#19981;&#21516;&#32467;&#26524;&#20043;&#38388;&#30340;&#24179;&#34913;&#65292;&#32780;&#19981;&#20165;&#20165;&#26159;&#21333;&#32431;&#22320;&#26368;&#22823;&#21270;&#19968;&#20010;&#32467;&#26524;&#30340;&#25928;&#29992;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#34987;&#31216;&#20026;&#22810;&#30446;&#26631;&#31574;&#30053;&#23398;&#20064;&#65288;MOPoL&#65289;&#30340;&#26041;&#27861;&#65292;&#23427;&#23558;&#31574;&#30053;&#23398;&#20064;&#30340;&#26368;&#20248;&#20915;&#31574;&#26641;&#19982;&#22810;&#30446;&#26631;&#36125;&#21494;&#26031;&#20248;&#21270;&#26041;&#27861;&#30456;&#32467;&#21512;&#65292;&#20197;&#25506;&#32034;&#22810;&#20010;&#32467;&#26524;&#20043;&#38388;&#30340;&#26435;&#34913;&#12290;&#23427;&#36890;&#36807;&#26500;&#24314;&#38750;&#25903;&#37197;&#27169;&#22411;&#30340;&#24085;&#32047;&#25176;&#21069;&#27839;&#26469;&#23454;&#29616;&#65292;&#36825;&#20123;&#27169;&#22411;&#22312;&#19981;&#21516;&#30340;&#36229;&#21442;&#25968;&#35774;&#32622;&#19979;&#25511;&#21046;&#30528;&#32467;&#26524;&#30340;&#26435;&#37325;&#12290;&#20851;&#38190;&#22312;&#20110;&#65292;&#19968;&#20010;&#20302;&#25104;&#26412;&#30340;&#36138;&#24515;&#26641;&#21487;&#20197;&#20316;&#20026;&#38750;&#24120;&#35745;&#31639;&#26114;&#36149;&#30340;&#26368;&#20248;&#26641;&#30340;&#20934;&#30830;&#20195;&#29702;&#65292;&#29992;&#20110;&#20915;&#31574;&#30446;&#30340;&#65292;&#36825;&#24847;&#21619;&#30528;&#21487;&#20197;&#21453;&#22797;&#25311;&#21512;&#27169;&#22411;&#26469;&#23398;&#20064;&#24085;&#32047;&#25176;&#21069;&#27839;&#12290;&#35813;&#26041;&#27861;&#24212;&#29992;&#20110;&#23454;&#38469;&#26696;&#20363;
&lt;/p&gt;
&lt;p&gt;
Methods for learning optimal policies use causal machine learning models to create human-interpretable rules for making choices around the allocation of different policy interventions. However, in realistic policy-making contexts, decision-makers often care about trade-offs between outcomes, not just single-mindedly maximising utility for one outcome. This paper proposes an approach termed Multi-Objective Policy Learning (MOPoL) which combines optimal decision trees for policy learning with a multi-objective Bayesian optimisation approach to explore the trade-off between multiple outcomes. It does this by building a Pareto frontier of non-dominated models for different hyperparameter settings which govern outcome weighting. The key here is that a low-cost greedy tree can be an accurate proxy for the very computationally costly optimal tree for the purposes of making decisions which means models can be repeatedly fit to learn a Pareto frontier. The method is applied to a real-world case
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#36890;&#36807;&#23545;&#26679;&#26412;&#36873;&#25321;&#26465;&#20214;&#19979;&#30340;&#22240;&#26524;&#27010;&#29575;&#36827;&#34892;&#37325;&#26032;&#20998;&#26512;&#65292;&#30830;&#23450;&#20102;&#22240;&#26524;&#27010;&#29575;&#30340;&#37096;&#20998;&#30028;&#38480;&#12290;&#22312;&#32771;&#34385;&#20102;&#19981;&#21516;&#20551;&#35774;&#30340;&#24773;&#20917;&#19979;&#24471;&#21040;&#20102;&#26377;&#21147;&#30340;&#32467;&#26524;&#65292;&#24182;&#19988;&#22312;&#21733;&#20262;&#27604;&#20122;&#30340;J\'ovenes en Acci\'on&#39033;&#30446;&#20013;&#23454;&#35777;&#21457;&#29616;&#65292;&#35813;&#39033;&#30446;&#20351;&#33267;&#23569;18%&#33267;&#22810;24%&#30340;&#22987;&#32456;&#23601;&#19994;&#30340;&#22899;&#24615;&#36716;&#21521;&#20102;&#27491;&#24335;&#21171;&#21160;&#21147;&#24066;&#22330;&#12290;</title><link>http://arxiv.org/abs/2210.01938</link><description>&lt;p&gt;
&#22312;&#26679;&#26412;&#36873;&#25321;&#26465;&#20214;&#19979;&#30340;&#22240;&#26524;&#27010;&#29575;&#65306;&#23545;J\'ovenes en Acci\'on&#23545;&#24418;&#24335;&#21270;&#30340;&#24433;&#21709;&#30340;&#37325;&#26032;&#20998;&#26512;
&lt;/p&gt;
&lt;p&gt;
Probability of Causation with Sample Selection: A Reanalysis of the Impacts of J\'ovenes en Acci\'on on Formality. (arXiv:2210.01938v4 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2210.01938
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36890;&#36807;&#23545;&#26679;&#26412;&#36873;&#25321;&#26465;&#20214;&#19979;&#30340;&#22240;&#26524;&#27010;&#29575;&#36827;&#34892;&#37325;&#26032;&#20998;&#26512;&#65292;&#30830;&#23450;&#20102;&#22240;&#26524;&#27010;&#29575;&#30340;&#37096;&#20998;&#30028;&#38480;&#12290;&#22312;&#32771;&#34385;&#20102;&#19981;&#21516;&#20551;&#35774;&#30340;&#24773;&#20917;&#19979;&#24471;&#21040;&#20102;&#26377;&#21147;&#30340;&#32467;&#26524;&#65292;&#24182;&#19988;&#22312;&#21733;&#20262;&#27604;&#20122;&#30340;J\'ovenes en Acci\'on&#39033;&#30446;&#20013;&#23454;&#35777;&#21457;&#29616;&#65292;&#35813;&#39033;&#30446;&#20351;&#33267;&#23569;18%&#33267;&#22810;24%&#30340;&#22987;&#32456;&#23601;&#19994;&#30340;&#22899;&#24615;&#36716;&#21521;&#20102;&#27491;&#24335;&#21171;&#21160;&#21147;&#24066;&#22330;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#22312;&#23384;&#22312;&#26679;&#26412;&#36873;&#25321;&#26465;&#20214;&#19979;&#35782;&#21035;&#20102;&#22240;&#26524;&#27010;&#29575;&#12290;&#25105;&#20204;&#34920;&#26126;&#23545;&#20110;&#37027;&#20123;&#26080;&#35770;&#25509;&#21463;&#27835;&#30103;&#19982;&#21542;&#37117;&#22987;&#32456;&#34987;&#35266;&#23519;&#21040;&#30340;&#20010;&#20307;&#65292;&#22240;&#26524;&#27010;&#29575;&#37096;&#20998;&#34987;&#30830;&#23450;&#65292;&#24182;&#22312;&#19977;&#32452;&#36880;&#28176;&#20005;&#26684;&#30340;&#20551;&#35774;&#19979;&#24471;&#20986;&#20102;&#23574;&#38160;&#30340;&#36793;&#30028;&#12290;&#31532;&#19968;&#32452;&#20551;&#35774;&#20102;&#22806;&#29983;&#30340;&#27835;&#30103;&#21644;&#21333;&#35843;&#30340;&#26679;&#26412;&#36873;&#25321;&#26426;&#21046;&#12290;&#20026;&#20102;&#25910;&#32039;&#36825;&#20123;&#36793;&#30028;&#65292;&#31532;&#20108;&#32452;&#36824;&#20551;&#35774;&#20102;&#21333;&#35843;&#30340;&#27835;&#30103;&#21453;&#24212;&#65292;&#32780;&#31532;&#19977;&#32452;&#21478;&#22806;&#36824;&#20551;&#35774;&#20102;&#38543;&#26426;&#20248;&#21183;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#20351;&#29992;&#26469;&#33258;&#21733;&#20262;&#27604;&#20122;&#32844;&#19994;&#22521;&#35757;&#39033;&#30446;J\'ovenes en Acci\'on&#30340;&#23454;&#39564;&#25968;&#25454;&#65292;&#23454;&#35777;&#35828;&#26126;&#20102;&#25105;&#20204;&#26041;&#27861;&#30340;&#23454;&#29992;&#24615;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#23545;&#20110;&#22987;&#32456;&#23601;&#19994;&#30340;&#22899;&#24615;&#65292;&#26368;&#23569;&#26377;18%&#33267;&#22810;24%&#30340;&#20154;&#22240;&#35813;&#39033;&#30446;&#36807;&#28193;&#21040;&#20102;&#27491;&#24335;&#21171;&#21160;&#21147;&#24066;&#22330;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper identifies the probability of causation when there is sample selection. We show that the probability of causation is partially identified for individuals who are always observed regardless of treatment status and derive sharp bounds under three increasingly restrictive sets of assumptions. The first set imposes an exogenous treatment and a monotone sample selection mechanism. To tighten these bounds, the second set also imposes the monotone treatment response assumption, while the third set additionally imposes a stochastic dominance assumption. Finally, we use experimental data from the Colombian job training program J\'ovenes en Acci\'on to empirically illustrate our approach's usefulness. We find that, among always-employed women, at least 18% and at most 24% transitioned to the formal labor market because of the program.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#28789;&#27963;&#30340;&#20840;&#29699;&#39044;&#27979;&#32452;&#21512;&#26694;&#26550;&#65292;&#33021;&#22815;&#22312;&#32771;&#34385;&#20219;&#21153;&#30456;&#20851;&#24615;&#30340;&#22522;&#30784;&#19978;&#32858;&#21512;&#22810;&#20010;&#19987;&#23478;&#25110;&#27169;&#22411;&#30340;&#39044;&#27979;&#12290;&#36890;&#36807;&#21512;&#25104;&#21644;&#30495;&#23454;&#25968;&#25454;&#30340;&#27604;&#36739;&#65292;&#35777;&#26126;&#20102;&#36825;&#20123;&#20840;&#29699;&#39044;&#27979;&#32452;&#21512;&#30340;&#26377;&#25928;&#24615;&#12290;</title><link>http://arxiv.org/abs/2207.07318</link><description>&lt;p&gt;
&#28789;&#27963;&#30340;&#20840;&#29699;&#39044;&#27979;&#32452;&#21512;
&lt;/p&gt;
&lt;p&gt;
Flexible global forecast combinations. (arXiv:2207.07318v2 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2207.07318
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#28789;&#27963;&#30340;&#20840;&#29699;&#39044;&#27979;&#32452;&#21512;&#26694;&#26550;&#65292;&#33021;&#22815;&#22312;&#32771;&#34385;&#20219;&#21153;&#30456;&#20851;&#24615;&#30340;&#22522;&#30784;&#19978;&#32858;&#21512;&#22810;&#20010;&#19987;&#23478;&#25110;&#27169;&#22411;&#30340;&#39044;&#27979;&#12290;&#36890;&#36807;&#21512;&#25104;&#21644;&#30495;&#23454;&#25968;&#25454;&#30340;&#27604;&#36739;&#65292;&#35777;&#26126;&#20102;&#36825;&#20123;&#20840;&#29699;&#39044;&#27979;&#32452;&#21512;&#30340;&#26377;&#25928;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#39044;&#27979;&#32452;&#21512;&#8212;&#8212;&#23558;&#22810;&#20010;&#19987;&#23478;&#25110;&#27169;&#22411;&#30340;&#20010;&#21035;&#39044;&#27979;&#32858;&#21512;&#36215;&#26469;&#8212;&#8212;&#26159;&#19968;&#31181;&#32463;&#36807;&#39564;&#35777;&#30340;&#32463;&#27982;&#39044;&#27979;&#26041;&#27861;&#12290;&#36804;&#20170;&#20026;&#27490;&#65292;&#32463;&#27982;&#39044;&#27979;&#30740;&#31350;&#38598;&#20013;&#22312;&#23616;&#37096;&#32452;&#21512;&#26041;&#27861;&#19978;&#65292;&#36825;&#20123;&#26041;&#27861;&#22788;&#29702;&#21333;&#29420;&#20294;&#30456;&#20851;&#30340;&#39044;&#27979;&#20219;&#21153;&#12290;&#28982;&#32780;&#65292;&#26426;&#22120;&#23398;&#20064;&#31038;&#21306;&#26089;&#22312;20&#22810;&#24180;&#21069;&#23601;&#24050;&#32463;&#30693;&#36947;&#65292;&#21033;&#29992;&#20219;&#21153;&#30456;&#20851;&#24615;&#30340;&#20840;&#23616;&#26041;&#27861;&#21487;&#20197;&#25913;&#21892;&#24573;&#30053;&#30456;&#20851;&#24615;&#30340;&#23616;&#37096;&#26041;&#27861;&#12290;&#21463;&#21040;&#25913;&#36827;&#21487;&#33021;&#24615;&#30340;&#21551;&#21457;&#65292;&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#20010;&#28789;&#27963;&#30340;&#26694;&#26550;&#65292;&#29992;&#20110;&#22312;&#32771;&#34385;&#20219;&#21153;&#30456;&#20851;&#24615;&#30340;&#22522;&#30784;&#19978;&#20840;&#23616;&#32452;&#21512;&#39044;&#27979;&#12290;&#36890;&#36807;&#25105;&#20204;&#30340;&#26694;&#26550;&#65292;&#25105;&#20204;&#24320;&#21457;&#20102;&#20960;&#31181;&#29616;&#26377;&#39044;&#27979;&#32452;&#21512;&#30340;&#20840;&#23616;&#29256;&#26412;&#12290;&#20026;&#20102;&#35780;&#20272;&#36825;&#20123;&#26032;&#30340;&#20840;&#29699;&#39044;&#27979;&#32452;&#21512;&#30340;&#21151;&#25928;&#65292;&#25105;&#20204;&#20351;&#29992;&#21512;&#25104;&#21644;&#30495;&#23454;&#25968;&#25454;&#36827;&#34892;&#20102;&#24191;&#27867;&#30340;&#27604;&#36739;&#12290;&#25105;&#20204;&#30340;&#30495;&#23454;&#25968;&#25454;&#27604;&#36739;&#28041;&#21450;&#21040;&#27431;&#20803;&#21306;&#26680;&#24515;&#32463;&#27982;&#25351;&#26631;&#30340;&#39044;&#27979;&#65292;&#25552;&#20379;&#20102;&#32463;&#39564;&#35777;&#25454;&#35777;&#26126;&#36825;&#20123;&#20840;&#29699;&#39044;&#27979;&#32452;&#21512;&#30340;&#26377;&#25928;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Forecast combination -- the aggregation of individual forecasts from multiple experts or models -- is a proven approach to economic forecasting. To date, research on economic forecasting has concentrated on local combination methods, which handle separate but related forecasting tasks in isolation. Yet, it has been known for over two decades in the machine learning community that global methods, which exploit task-relatedness, can improve on local methods that ignore it. Motivated by the possibility for improvement, this paper introduces a framework for globally combining forecasts while being flexible to the level of task-relatedness. Through our framework, we develop global versions of several existing forecast combinations. To evaluate the efficacy of these new global forecast combinations, we conduct extensive comparisons using synthetic and real data. Our real data comparisons, which involve forecasts of core economic indicators in the Eurozone, provide empirical evidence that the
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#36873;&#25321;&#36827;&#20837;&#22788;&#29702;&#32452;&#21644;&#24179;&#34892;&#36235;&#21183;&#20551;&#35774;&#30340;&#20851;&#31995;&#65292;&#25512;&#23548;&#20102;&#24179;&#34892;&#36235;&#21183;&#20551;&#35774;&#30340;&#24517;&#35201;&#21644;&#20805;&#20998;&#26465;&#20214;&#65292;&#24182;&#25552;&#20986;&#20102;&#35299;&#37322;&#24615;&#21407;&#21021;&#20805;&#20998;&#26465;&#20214;&#21644;&#38024;&#23545;&#19981;&#30830;&#23450;&#30340;&#24179;&#34892;&#36235;&#21183;&#36827;&#34892;&#25935;&#24863;&#24615;&#20998;&#26512;&#30340;&#26032;&#24037;&#20855;&#12290;</title><link>http://arxiv.org/abs/2203.09001</link><description>&lt;p&gt;
&#36873;&#25321;&#19982;&#24179;&#34892;&#36235;&#21183;&#30340;&#20851;&#31995;
&lt;/p&gt;
&lt;p&gt;
Selection and parallel trends. (arXiv:2203.09001v7 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2203.09001
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#36873;&#25321;&#36827;&#20837;&#22788;&#29702;&#32452;&#21644;&#24179;&#34892;&#36235;&#21183;&#20551;&#35774;&#30340;&#20851;&#31995;&#65292;&#25512;&#23548;&#20102;&#24179;&#34892;&#36235;&#21183;&#20551;&#35774;&#30340;&#24517;&#35201;&#21644;&#20805;&#20998;&#26465;&#20214;&#65292;&#24182;&#25552;&#20986;&#20102;&#35299;&#37322;&#24615;&#21407;&#21021;&#20805;&#20998;&#26465;&#20214;&#21644;&#38024;&#23545;&#19981;&#30830;&#23450;&#30340;&#24179;&#34892;&#36235;&#21183;&#36827;&#34892;&#25935;&#24863;&#24615;&#20998;&#26512;&#30340;&#26032;&#24037;&#20855;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#36873;&#25321;&#36827;&#20837;&#22788;&#29702;&#32452;&#21644;&#24179;&#34892;&#36235;&#21183;&#20551;&#35774;&#20043;&#38388;&#30340;&#32852;&#31995;&#65292;&#36825;&#26159;&#24046;&#24322;&#27861;&#65288;DiD&#65289;&#35774;&#35745;&#22522;&#30784;&#30340;&#37325;&#35201;&#20551;&#35774;&#12290;&#25105;&#20204;&#30340;&#26694;&#26550;&#36866;&#29992;&#20110;&#19968;&#33324;&#30340;&#36873;&#25321;&#26426;&#21046;&#65292;&#21253;&#25324;&#36873;&#25321;&#22266;&#23450;&#25928;&#24212;&#12289;&#28508;&#22312;&#32467;&#26524;&#12289;&#22788;&#29702;&#25928;&#24212;&#21644;&#20854;&#20182;&#32463;&#27982;&#27169;&#22411;&#30340;&#36873;&#25321;&#12290;&#39318;&#20808;&#65292;&#25105;&#20204;&#25512;&#23548;&#20102;&#24179;&#34892;&#36235;&#21183;&#20551;&#35774;&#30340;&#24517;&#35201;&#21644;&#20805;&#20998;&#26465;&#20214;&#12290;&#36825;&#20123;&#26465;&#20214;&#22312;&#29702;&#35770;&#19978;&#28548;&#28165;&#20102;&#24179;&#34892;&#36235;&#21183;&#20551;&#35774;&#30340;&#23454;&#35777;&#20869;&#23481;&#65292;&#24182;&#23637;&#31034;&#20102;&#36873;&#25321;&#38480;&#21046;&#21644;&#26102;&#21464;&#19981;&#21487;&#35266;&#27979;&#21464;&#37327;&#20998;&#24067;&#20043;&#38388;&#30340;&#26435;&#34913;&#12290;&#20854;&#27425;&#65292;&#25105;&#20204;&#25552;&#20379;&#20102;&#19968;&#31995;&#21015;&#21487;&#35299;&#37322;&#30340;&#21407;&#21021;&#20805;&#20998;&#26465;&#20214;&#65292;&#26500;&#25104;&#20102;&#22312;&#23454;&#36341;&#20013;&#35777;&#26126;&#24046;&#24322;&#27861;&#30340;&#24418;&#24335;&#26694;&#26550;&#12290;&#31532;&#19977;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#22522;&#20110;&#36873;&#25321;&#30340;&#25935;&#24863;&#24615;&#20998;&#26512;&#30340;&#26032;&#24037;&#20855;&#65292;&#24403;&#25105;&#20204;&#23545;&#24179;&#34892;&#36235;&#21183;&#30340;&#24517;&#35201;&#26465;&#20214;&#23384;&#30097;&#26102;&#65292;&#21487;&#20197;&#20351;&#29992;&#36825;&#20123;&#24037;&#20855;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#22312;&#20855;&#26377;&#26102;&#21464;&#21327;&#21464;&#37327;&#30340;&#35774;&#32622;&#20013;&#65292;&#20856;&#22411;&#30340;&#26465;&#20214;&#24179;&#34892;&#36235;&#21183;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study the connection between selection into treatment and the parallel trends assumptions underlying difference-in-differences (DiD) designs. Our framework accommodates general selection mechanisms, including selection on fixed effects, potential outcomes, treatment effects, and other economic models of selection. First, we derive necessary and sufficient conditions for the parallel trends assumption. These conditions theoretically clarify the empirical content of the parallel trends assumption and demonstrate trade-offs between restrictions on selection and the distribution of time-varying unobservables. Second, we provide a menu of interpretable primitive sufficient conditions, which constitute a formal framework for justifying DiD in practice. Third, we propose novel tools for selection-based sensitivity analyses when our necessary conditions for parallel trends are questionable. Finally, we show that for settings with time-varying covariates, typical conditional parallel trends 
&lt;/p&gt;</description></item></channel></rss>