<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#26412;&#25991;&#25552;&#20379;&#19968;&#31181;&#32771;&#34385;&#20102;&#31574;&#30053;&#24615;&#35823;&#25253;&#30340;&#22240;&#26524;&#25928;&#24212;&#35782;&#21035;&#26041;&#27861;&#65292;&#21487;&#20197;&#23545;&#23398;&#26657;&#20998;&#37197;&#23545;&#26410;&#26469;&#32467;&#26524;&#20135;&#29983;&#30340;&#24433;&#21709;&#36827;&#34892;&#20934;&#30830;&#24230;&#37327;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#36866;&#29992;&#20110;&#21508;&#31181;&#26426;&#21046;&#65292;&#24182;&#33021;&#22815;&#24471;&#21040;&#23545;&#31574;&#30053;&#34892;&#20026;&#40065;&#26834;&#30340;&#22240;&#26524;&#25928;&#24212;&#30340;&#23574;&#38160;&#36793;&#30028;&#12290;</title><link>http://arxiv.org/abs/2307.14282</link><description>&lt;p&gt;
&#21305;&#37197;&#26426;&#21046;&#20013;&#30340;&#22240;&#26524;&#25928;&#24212;&#19982;&#31574;&#30053;&#24615;&#25253;&#21578;&#20559;&#22909;
&lt;/p&gt;
&lt;p&gt;
Causal Effects in Matching Mechanisms with Strategically Reported Preferences. (arXiv:2307.14282v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.14282
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20379;&#19968;&#31181;&#32771;&#34385;&#20102;&#31574;&#30053;&#24615;&#35823;&#25253;&#30340;&#22240;&#26524;&#25928;&#24212;&#35782;&#21035;&#26041;&#27861;&#65292;&#21487;&#20197;&#23545;&#23398;&#26657;&#20998;&#37197;&#23545;&#26410;&#26469;&#32467;&#26524;&#20135;&#29983;&#30340;&#24433;&#21709;&#36827;&#34892;&#20934;&#30830;&#24230;&#37327;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#36866;&#29992;&#20110;&#21508;&#31181;&#26426;&#21046;&#65292;&#24182;&#33021;&#22815;&#24471;&#21040;&#23545;&#31574;&#30053;&#34892;&#20026;&#40065;&#26834;&#30340;&#22240;&#26524;&#25928;&#24212;&#30340;&#23574;&#38160;&#36793;&#30028;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36234;&#26469;&#36234;&#22810;&#30340;&#20013;&#22830;&#26426;&#26500;&#20351;&#29992;&#20998;&#37197;&#26426;&#21046;&#23558;&#23398;&#29983;&#20998;&#37197;&#21040;&#23398;&#26657;&#65292;&#20197;&#21453;&#26144;&#23398;&#29983;&#30340;&#20559;&#22909;&#21644;&#23398;&#26657;&#30340;&#20248;&#20808;&#26435;&#12290;&#28982;&#32780;&#65292;&#22823;&#22810;&#25968;&#29616;&#23454;&#19990;&#30028;&#30340;&#26426;&#21046;&#20250;&#32473;&#23398;&#29983;&#25552;&#20379;&#19968;&#31181;&#31574;&#30053;&#24615;&#24182;&#35823;&#25253;&#20182;&#20204;&#30340;&#20559;&#22909;&#30340;&#28608;&#21169;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20379;&#20102;&#19968;&#31181;&#35782;&#21035;&#22240;&#26524;&#25928;&#24212;&#30340;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#32771;&#34385;&#20102;&#31574;&#30053;&#24615;&#30340;&#35823;&#25253;&#12290;&#35823;&#25253;&#21487;&#33021;&#20351;&#29616;&#26377;&#30340;&#28857;&#35782;&#21035;&#26041;&#27861;&#26080;&#25928;&#65292;&#25105;&#20204;&#25512;&#23548;&#20986;&#23545;&#31574;&#30053;&#34892;&#20026;&#40065;&#26834;&#30340;&#22240;&#26524;&#25928;&#24212;&#30340;&#23574;&#38160;&#36793;&#30028;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#36866;&#29992;&#20110;&#20219;&#20309;&#26426;&#21046;&#65292;&#21482;&#35201;&#23384;&#22312;&#25551;&#36848;&#35813;&#26426;&#21046;&#20998;&#37197;&#35268;&#21017;&#30340;&#37197;&#23545;&#20998;&#25968;&#21644;&#25130;&#28857;&#12290;&#25105;&#20204;&#20351;&#29992;&#26234;&#21033;&#19968;&#20010;&#24310;&#36831;&#25509;&#21463;&#26426;&#21046;&#30340;&#25968;&#25454;&#65292;&#35813;&#26426;&#21046;&#23558;&#23398;&#29983;&#20998;&#37197;&#21040;1000&#22810;&#20010;&#22823;&#23398;&#19987;&#19994;&#32452;&#21512;&#12290;&#23398;&#29983;&#20986;&#20110;&#31574;&#30053;&#32771;&#34385;&#32780;&#34892;&#21160;&#65292;&#22240;&#20026;&#26234;&#21033;&#30340;&#26426;&#21046;&#38480;&#21046;&#20102;&#23398;&#29983;&#22312;&#20559;&#22909;&#20013;&#25552;&#20132;&#30340;&#19987;&#19994;&#25968;&#37327;&#20026;&#20843;&#20010;&#12290;
&lt;/p&gt;
&lt;p&gt;
A growing number of central authorities use assignment mechanisms to allocate students to schools in a way that reflects student preferences and school priorities. However, most real-world mechanisms give students an incentive to be strategic and misreport their preferences. In this paper, we provide an identification approach for causal effects of school assignment on future outcomes that accounts for strategic misreporting. Misreporting may invalidate existing point-identification approaches, and we derive sharp bounds for causal effects that are robust to strategic behavior. Our approach applies to any mechanism as long as there exist placement scores and cutoffs that characterize that mechanism's allocation rule. We use data from a deferred acceptance mechanism that assigns students to more than 1,000 university-major combinations in Chile. Students behave strategically because the mechanism in Chile constrains the number of majors that students submit in their preferences to eight
&lt;/p&gt;</description></item><item><title>&#35813;&#30740;&#31350;&#36890;&#36807;&#32771;&#34385;Sakoda-Schelling&#27169;&#22411;&#20013;&#30340;&#32844;&#19994;&#27169;&#22411;&#65292;&#25581;&#31034;&#20102;&#31038;&#20250;&#32463;&#27982;&#20195;&#29702;&#20154;&#27169;&#22411;&#20013;&#30340;&#38750;&#24179;&#34913;&#21160;&#21147;&#23398;&#65292;&#24182;&#22312;&#24179;&#22343;&#22330;&#36817;&#20284;&#19979;&#23558;&#20854;&#26144;&#23556;&#20026;&#20027;&#21160;&#29289;&#36136;&#25551;&#36848;&#12290;&#36890;&#36807;&#30740;&#31350;&#38750;&#20114;&#24800;&#24615;&#20114;&#21160;&#65292;&#23637;&#31034;&#20102;&#38750;&#31283;&#24577;&#30340;&#23439;&#35266;&#34892;&#20026;&#12290;&#36825;&#19968;&#30740;&#31350;&#20026;&#22320;&#29702;&#30456;&#20851;&#30340;&#22522;&#20110;&#20195;&#29702;&#20154;&#30340;&#27169;&#22411;&#25552;&#20379;&#20102;&#32479;&#19968;&#30340;&#26694;&#26550;&#65292;&#26377;&#21161;&#20110;&#21516;&#26102;&#32771;&#34385;&#20154;&#21475;&#21644;&#20215;&#26684;&#21160;&#24577;&#12290;</title><link>http://arxiv.org/abs/2307.14270</link><description>&lt;p&gt;
&#38750;&#24179;&#34913;&#30340;Sakoda-Schelling&#27169;&#22411;&#20013;&#30340;&#31038;&#20250;&#32463;&#27982;&#20195;&#29702;&#20154;&#20316;&#20026;&#20027;&#21160;&#29289;&#36136;
&lt;/p&gt;
&lt;p&gt;
Socioeconomic agents as active matter in nonequilibrium Sakoda-Schelling models. (arXiv:2307.14270v1 [cond-mat.stat-mech])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.14270
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#36890;&#36807;&#32771;&#34385;Sakoda-Schelling&#27169;&#22411;&#20013;&#30340;&#32844;&#19994;&#27169;&#22411;&#65292;&#25581;&#31034;&#20102;&#31038;&#20250;&#32463;&#27982;&#20195;&#29702;&#20154;&#27169;&#22411;&#20013;&#30340;&#38750;&#24179;&#34913;&#21160;&#21147;&#23398;&#65292;&#24182;&#22312;&#24179;&#22343;&#22330;&#36817;&#20284;&#19979;&#23558;&#20854;&#26144;&#23556;&#20026;&#20027;&#21160;&#29289;&#36136;&#25551;&#36848;&#12290;&#36890;&#36807;&#30740;&#31350;&#38750;&#20114;&#24800;&#24615;&#20114;&#21160;&#65292;&#23637;&#31034;&#20102;&#38750;&#31283;&#24577;&#30340;&#23439;&#35266;&#34892;&#20026;&#12290;&#36825;&#19968;&#30740;&#31350;&#20026;&#22320;&#29702;&#30456;&#20851;&#30340;&#22522;&#20110;&#20195;&#29702;&#20154;&#30340;&#27169;&#22411;&#25552;&#20379;&#20102;&#32479;&#19968;&#30340;&#26694;&#26550;&#65292;&#26377;&#21161;&#20110;&#21516;&#26102;&#32771;&#34385;&#20154;&#21475;&#21644;&#20215;&#26684;&#21160;&#24577;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20195;&#29702;&#20154;&#30340;&#20915;&#31574;&#35268;&#21017;&#23545;&#20110;&#31038;&#20250;&#32463;&#27982;&#20195;&#29702;&#20154;&#27169;&#22411;&#26377;&#22810;&#20040;&#31283;&#20581;&#65311;&#25105;&#20204;&#36890;&#36807;&#32771;&#34385;&#19968;&#31181;&#31867;&#20284;Sakoda-Schelling&#27169;&#22411;&#30340;&#32844;&#19994;&#27169;&#22411;&#26469;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;&#35813;&#27169;&#22411;&#22312;&#21382;&#21490;&#19978;&#34987;&#24341;&#20837;&#20197;&#25581;&#31034;&#20154;&#31867;&#32676;&#20307;&#20043;&#38388;&#30340;&#38548;&#31163;&#21160;&#21147;&#23398;&#12290;&#23545;&#20110;&#22823;&#31867;&#30340;&#25928;&#29992;&#20989;&#25968;&#21644;&#20915;&#31574;&#35268;&#21017;&#65292;&#25105;&#20204;&#30830;&#23450;&#20102;&#20195;&#29702;&#20154;&#21160;&#21147;&#23398;&#30340;&#38750;&#24179;&#34913;&#24615;&#65292;&#21516;&#26102;&#24674;&#22797;&#20102;&#31867;&#20284;&#24179;&#34913;&#30456;&#20998;&#31163;&#30340;&#29616;&#35937;&#23398;&#12290;&#22312;&#24179;&#22343;&#22330;&#36817;&#20284;&#19979;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#35813;&#27169;&#22411;&#22312;&#19968;&#23450;&#31243;&#24230;&#19978;&#21487;&#20197;&#34987;&#26144;&#23556;&#20026;&#20027;&#21160;&#29289;&#36136;&#22330;&#25551;&#36848;&#65288;Active Model B&#65289;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#32771;&#34385;&#20102;&#20004;&#20010;&#20154;&#32676;&#20043;&#38388;&#30340;&#38750;&#20114;&#24800;&#24615;&#20114;&#21160;&#65292;&#24182;&#23637;&#31034;&#20102;&#23427;&#20204;&#22914;&#20309;&#23548;&#33268;&#38750;&#31283;&#24577;&#30340;&#23439;&#35266;&#34892;&#20026;&#12290;&#25105;&#20204;&#30456;&#20449;&#25105;&#20204;&#30340;&#26041;&#27861;&#25552;&#20379;&#20102;&#19968;&#20010;&#32479;&#19968;&#30340;&#26694;&#26550;&#65292;&#36827;&#19968;&#27493;&#30740;&#31350;&#22320;&#29702;&#30456;&#20851;&#30340;&#22522;&#20110;&#20195;&#29702;&#20154;&#30340;&#27169;&#22411;&#65292;&#23588;&#20854;&#26159;&#22312;&#22330;&#35770;&#26041;&#27861;&#20013;&#21516;&#26102;&#32771;&#34385;&#20154;&#21475;&#21644;&#20215;&#26684;&#21160;&#24577;&#30340;&#30740;&#31350;&#12290;
&lt;/p&gt;
&lt;p&gt;
How robust are socioeconomic agent-based models with respect to the details of the agents' decision rule? We tackle this question by considering an occupation model in the spirit of the Sakoda-Schelling model, historically introduced to shed light on segregation dynamics among human groups. For a large class of utility functions and decision rules, we pinpoint the nonequilibrium nature of the agent dynamics, while recovering the equilibrium-like phase separation phenomenology. Within the mean field approximation we show how the model can be mapped, to some extent, onto an active matter field description (Active Model B). Finally, we consider non-reciprocal interactions between two populations, and show how they can lead to non-steady macroscopic behavior. We believe our approach provides a unifying framework to further study geography-dependent agent-based models, notably paving the way for joint consideration of population and price dynamics within a field theoretic approach.
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21160;&#24577;&#22238;&#24402;&#19981;&#36830;&#32493;&#24615;&#35774;&#35745;&#26041;&#27861;&#65292;&#29992;&#20110;&#30830;&#23450;&#32463;&#27982;&#21487;&#35299;&#37322;&#30340;&#26102;&#38388;&#38388;&#38548;&#22788;&#29702;&#25928;&#24212;&#12290;&#30740;&#31350;&#37319;&#29992;&#20102;&#21160;&#24577;&#28508;&#22312;&#32467;&#26524;&#27169;&#22411;&#65292;&#24182;&#29305;&#21035;&#23545;&#26080;&#39044;&#26399;&#21644;&#20849;&#21516;&#36235;&#21183;&#38480;&#21046;&#36827;&#34892;&#20102;&#22788;&#29702;&#65292;&#20197;&#30830;&#23450;&#25351;&#23450;&#20999;&#28857;&#30340;&#20914;&#20987;&#21453;&#24212;&#12290;&#20272;&#35745;&#37327;&#21487;&#20197;&#36890;&#36807;&#26631;&#20934;&#30340;&#23616;&#37096;&#22810;&#39033;&#24335;&#26041;&#27861;&#36827;&#34892;&#35745;&#31639;&#12290;</title><link>http://arxiv.org/abs/2307.14203</link><description>&lt;p&gt;
&#21160;&#24577;&#22238;&#24402;&#19981;&#36830;&#32493;&#24615;&#65306;&#19968;&#31181;&#20869;&#37096;&#35774;&#35745;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
Dynamic Regression Discontinuity: A Within-Design Approach. (arXiv:2307.14203v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.14203
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21160;&#24577;&#22238;&#24402;&#19981;&#36830;&#32493;&#24615;&#35774;&#35745;&#26041;&#27861;&#65292;&#29992;&#20110;&#30830;&#23450;&#32463;&#27982;&#21487;&#35299;&#37322;&#30340;&#26102;&#38388;&#38388;&#38548;&#22788;&#29702;&#25928;&#24212;&#12290;&#30740;&#31350;&#37319;&#29992;&#20102;&#21160;&#24577;&#28508;&#22312;&#32467;&#26524;&#27169;&#22411;&#65292;&#24182;&#29305;&#21035;&#23545;&#26080;&#39044;&#26399;&#21644;&#20849;&#21516;&#36235;&#21183;&#38480;&#21046;&#36827;&#34892;&#20102;&#22788;&#29702;&#65292;&#20197;&#30830;&#23450;&#25351;&#23450;&#20999;&#28857;&#30340;&#20914;&#20987;&#21453;&#24212;&#12290;&#20272;&#35745;&#37327;&#21487;&#20197;&#36890;&#36807;&#26631;&#20934;&#30340;&#23616;&#37096;&#22810;&#39033;&#24335;&#26041;&#27861;&#36827;&#34892;&#35745;&#31639;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#35770;&#35777;&#26041;&#27861;&#65292;&#29992;&#26469;&#22312;&#21160;&#24577;&#22238;&#24402;&#19981;&#36830;&#32493;&#24615;&#35774;&#35745;&#20013;&#30830;&#23450;&#32463;&#27982;&#21487;&#35299;&#37322;&#30340;&#26102;&#38388;&#38388;&#38548;&#22788;&#29702;&#25928;&#24212;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#25105;&#21457;&#23637;&#20102;&#19968;&#20010;&#21160;&#24577;&#28508;&#22312;&#32467;&#26524;&#27169;&#22411;&#65292;&#24182;&#29305;&#22320;&#23545;&#24046;&#24322;-in-differences&#25991;&#29486;&#20013;&#30340;&#20004;&#20010;&#20551;&#35774;&#36827;&#34892;&#20102;&#19987;&#38376;&#21270;&#22788;&#29702;&#65292;&#21363;&#26080;&#39044;&#26399;&#21644;&#20849;&#21516;&#36235;&#21183;&#38480;&#21046;&#65292;&#20197;&#30830;&#23450;&#25351;&#23450;&#20999;&#28857;&#30340;&#20914;&#20987;&#21453;&#24212;&#12290;&#19982;&#27599;&#20010;&#30446;&#26631;&#21442;&#25968;&#30456;&#20851;&#30340;&#20272;&#35745;&#37327;&#21487;&#20197;&#34920;&#31034;&#20026;&#20004;&#20010;&#38745;&#24577;&#22238;&#24402;&#19981;&#36830;&#32493;&#24615;&#35774;&#35745;&#32467;&#26524;&#23545;&#27604;&#30340;&#21644;&#65292;&#20174;&#32780;&#21487;&#20197;&#36890;&#36807;&#26631;&#20934;&#30340;&#23616;&#37096;&#22810;&#39033;&#24335;&#24037;&#20855;&#36827;&#34892;&#20272;&#35745;&#12290;&#25105;&#21033;&#29992;&#26377;&#38480;&#36335;&#24452;&#29420;&#31435;&#24615;&#20551;&#35774;&#26469;&#38477;&#20302;&#38382;&#39064;&#30340;&#32500;&#24230;&#12290;
&lt;/p&gt;
&lt;p&gt;
I propose a novel argument to point identify economically interpretable intertemporal treatment effects in dynamic regression discontinuity designs (RDDs). Specifically, I develop a dynamic potential outcomes model and specialize two assumptions of the difference-in-differences literature, the no anticipation and common trends restrictions, to point identify cutoff-specific impulse responses. The estimand associated with each target parameter can be expressed as the sum of two static RDD outcome contrasts, thereby allowing for estimation via standard local polynomial tools. I leverage a limited path independence assumption to reduce the dimensionality of the problem.
&lt;/p&gt;</description></item><item><title>&#22312;&#21338;&#24328;&#35770;&#20013;&#65292;&#25105;&#20204;&#36890;&#36807;&#23558;&#26435;&#21147;&#27010;&#24565;&#36716;&#21270;&#20026;&#29609;&#23478;&#30340;&#25928;&#29992;&#32452;&#21512;&#26469;&#30740;&#31350;&#29609;&#23478;&#20043;&#38388;&#30340;&#20851;&#31995;&#12290;&#36890;&#36807;&#23558;&#21152;&#26435;&#21644;&#20056;&#31215;&#20989;&#25968;&#21472;&#21152;&#21040;&#20010;&#20307;&#25928;&#29992;&#20989;&#25968;&#20013;&#65292;&#25105;&#20204;&#21487;&#20197;&#23450;&#20041;&#31561;&#32423;&#12289;&#20114;&#21161;&#21644;&#33258;&#30001;&#31561;&#20840;&#23616;&#25351;&#26631;&#65292;&#24182;&#27979;&#37327;&#23427;&#20204;&#23545;&#28216;&#25103;&#22343;&#34913;&#30340;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2307.14170</link><description>&lt;p&gt;
&#21338;&#24328;&#35770;&#20013;&#30340;&#26435;&#21147;&#20851;&#31995;
&lt;/p&gt;
&lt;p&gt;
Power relations in Game Theory. (arXiv:2307.14170v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.14170
&lt;/p&gt;
&lt;p&gt;
&#22312;&#21338;&#24328;&#35770;&#20013;&#65292;&#25105;&#20204;&#36890;&#36807;&#23558;&#26435;&#21147;&#27010;&#24565;&#36716;&#21270;&#20026;&#29609;&#23478;&#30340;&#25928;&#29992;&#32452;&#21512;&#26469;&#30740;&#31350;&#29609;&#23478;&#20043;&#38388;&#30340;&#20851;&#31995;&#12290;&#36890;&#36807;&#23558;&#21152;&#26435;&#21644;&#20056;&#31215;&#20989;&#25968;&#21472;&#21152;&#21040;&#20010;&#20307;&#25928;&#29992;&#20989;&#25968;&#20013;&#65292;&#25105;&#20204;&#21487;&#20197;&#23450;&#20041;&#31561;&#32423;&#12289;&#20114;&#21161;&#21644;&#33258;&#30001;&#31561;&#20840;&#23616;&#25351;&#26631;&#65292;&#24182;&#27979;&#37327;&#23427;&#20204;&#23545;&#28216;&#25103;&#22343;&#34913;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#29609;&#23478;&#20043;&#38388;&#30340;&#26435;&#21147;&#27010;&#24565;&#21487;&#20197;&#36890;&#36807;&#23427;&#20204;&#30340;&#25928;&#29992;&#32452;&#21512;&#26469;&#34920;&#36798;&#12290;&#26381;&#20174;&#21478;&#19968;&#20010;&#29609;&#23478;&#30340;&#29609;&#23478;&#20250;&#32771;&#34385;&#21040;&#25903;&#37197;&#32773;&#30340;&#25928;&#29992;&#12290;&#25216;&#26415;&#19978;&#65292;&#36825;&#26159;&#23558;&#19968;&#20123;&#21152;&#26435;&#21644;&#20056;&#31215;&#20989;&#25968;&#21472;&#21152;&#21040;&#20010;&#20307;&#25928;&#29992;&#20989;&#25968;&#19978;&#65292;&#20854;&#20013;&#26435;&#37325;&#21487;&#20197;&#36890;&#36807;&#21453;&#26144;&#29609;&#23478;&#38388;&#26435;&#21147;&#20851;&#31995;&#30340;&#26377;&#21521;&#22270;&#26469;&#34920;&#31034;&#12290;&#28982;&#21518;&#21487;&#20197;&#23450;&#20041;&#19968;&#20123;&#31995;&#32479;&#30340;&#20840;&#23616;&#25351;&#26631;&#65292;&#22914;&#31561;&#32423;&#12289;&#20114;&#21161;&#21644;&#33258;&#30001;&#27700;&#24179;&#65292;&#24182;&#27979;&#37327;&#23427;&#20204;&#23545;&#28216;&#25103;&#22343;&#34913;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
The concept of power among players can be expressed as a combination of their utilities. A player who obeys another takes into account the utility of the dominant one. Technically it is a matter of superimposing some weighted sum or product function onto the individual utility function, where the weights can be represented through directed graphs that reflect a situation of power among the players. It is then possible to define some global indices of the system, such as the level of hierarchy, mutualism and freedom, and measure their effects on game equilibria.
&lt;/p&gt;</description></item><item><title>&#20351;&#29992;&#27010;&#29575;&#38472;&#36848;&#20559;&#22909;&#20998;&#26512;&#26041;&#27861;&#65292;&#30740;&#31350;&#32773;&#21487;&#20197;&#20351;&#29992;&#23454;&#38469;&#36873;&#25321;&#32416;&#27491;&#20869;&#28304;&#24615;&#24433;&#21709;&#65292;&#24674;&#22797;&#22240;&#26524;&#25928;&#24212;&#12290;</title><link>http://arxiv.org/abs/2307.13966</link><description>&lt;p&gt;
&#20351;&#29992;&#27010;&#29575;&#38472;&#36848;&#20559;&#22909;&#20998;&#26512;&#29702;&#35299;&#23454;&#38469;&#36873;&#25321;
&lt;/p&gt;
&lt;p&gt;
Using Probabilistic Stated Preference Analyses to Understand Actual Choices. (arXiv:2307.13966v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.13966
&lt;/p&gt;
&lt;p&gt;
&#20351;&#29992;&#27010;&#29575;&#38472;&#36848;&#20559;&#22909;&#20998;&#26512;&#26041;&#27861;&#65292;&#30740;&#31350;&#32773;&#21487;&#20197;&#20351;&#29992;&#23454;&#38469;&#36873;&#25321;&#32416;&#27491;&#20869;&#28304;&#24615;&#24433;&#21709;&#65292;&#24674;&#22797;&#22240;&#26524;&#25928;&#24212;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
"&#32463;&#30001;&#23558;&#27010;&#29575;&#38472;&#36848;&#36873;&#25321;&#36816;&#29992;&#20110;&#29702;&#35299;&#23454;&#38469;&#36873;&#25321;&#65292;&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#26041;&#27861;&#12290;&#35813;&#26041;&#27861;&#36866;&#29992;&#20110;&#37027;&#20123;&#26082;&#33021;&#33719;&#21462;&#20551;&#35774;&#24773;&#26223;&#19979;&#30340;&#38472;&#36848;&#36873;&#25321;&#65292;&#21448;&#33021;&#33719;&#21462;&#23454;&#38469;&#36873;&#25321;&#30340;&#30740;&#31350;&#32773;&#12290;&#20854;&#26680;&#24515;&#24605;&#24819;&#26159;&#20351;&#29992;&#27010;&#29575;&#38472;&#36848;&#36873;&#25321;&#26469;&#35782;&#21035;&#20010;&#20307;&#26410;&#35266;&#27979;&#24322;&#36136;&#24615;&#30340;&#20998;&#24067;&#65292;&#21363;&#20351;&#23384;&#22312;&#27979;&#37327;&#35823;&#24046;&#12290;&#22914;&#26524;&#36825;&#31181;&#26410;&#35266;&#27979;&#24322;&#36136;&#24615;&#26159;&#20869;&#28304;&#24615;&#30340;&#28304;&#22836;&#65292;&#30740;&#31350;&#32773;&#21487;&#20197;&#36890;&#36807;&#23454;&#38469;&#36873;&#25321;&#32416;&#27491;&#20854;&#24433;&#21709;&#65292;&#24182;&#24674;&#22797;&#22240;&#26524;&#25928;&#24212;&#12290;&#20351;&#29992;&#29616;&#25104;&#30340;&#32676;&#32452;&#22266;&#23450;&#25928;&#24212;&#20272;&#35745;&#22120;&#21487;&#20197;&#36827;&#34892;&#20272;&#35745;&#12290;"
&lt;/p&gt;
&lt;p&gt;
Can stated preferences help in counterfactual analyses of actual choice? This research proposes a novel approach to researchers who have access to both stated choices in hypothetical scenarios and actual choices. The key idea is to use probabilistic stated choices to identify the distribution of individual unobserved heterogeneity, even in the presence of measurement error. If this unobserved heterogeneity is the source of endogeneity, the researcher can correct for its influence in a demand function estimation using actual choices, and recover causal effects. Estimation is possible with an off-the-shelf Group Fixed Effects estimator.
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#22312;&#20998;&#26512;&#21592;&#26080;&#27861;&#35266;&#23519;&#20195;&#29702;&#20154;&#22312;&#29305;&#23450;&#25910;&#30410;&#26465;&#20214;&#19979;&#37319;&#21462;&#34892;&#21160;&#30340;&#24773;&#20917;&#19979;&#65292;&#20998;&#26512;&#21592;&#22914;&#20309;&#21512;&#29702;&#35299;&#37322;&#20195;&#29702;&#20154;&#36873;&#25321;&#30340;&#32467;&#26524;&#12290;&#36890;&#36807;&#32508;&#21512;&#20449;&#24687;&#35774;&#35745;&#20013;&#30340;&#39034;&#20174;&#26041;&#27861;&#21644;Bayesian Persuasion&#20013;&#30340;&#20449;&#24565;&#26041;&#27861;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#35299;&#20915;&#26041;&#27861;&#65292;&#24182;&#24212;&#29992;&#20110;&#29615;&#24418;&#32593;&#32476;&#28216;&#25103;&#21644;&#19968;&#38454;Bayesian Persuasion&#28216;&#25103;&#30340;&#20844;&#20849;&#20449;&#24687;&#32467;&#26500;&#19968;&#33268;&#24615;&#12290;</title><link>http://arxiv.org/abs/2307.13849</link><description>&lt;p&gt;
Bayesian Persuasion&#30340;&#26680;&#24515;
&lt;/p&gt;
&lt;p&gt;
The Core of Bayesian Persuasion. (arXiv:2307.13849v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.13849
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#22312;&#20998;&#26512;&#21592;&#26080;&#27861;&#35266;&#23519;&#20195;&#29702;&#20154;&#22312;&#29305;&#23450;&#25910;&#30410;&#26465;&#20214;&#19979;&#37319;&#21462;&#34892;&#21160;&#30340;&#24773;&#20917;&#19979;&#65292;&#20998;&#26512;&#21592;&#22914;&#20309;&#21512;&#29702;&#35299;&#37322;&#20195;&#29702;&#20154;&#36873;&#25321;&#30340;&#32467;&#26524;&#12290;&#36890;&#36807;&#32508;&#21512;&#20449;&#24687;&#35774;&#35745;&#20013;&#30340;&#39034;&#20174;&#26041;&#27861;&#21644;Bayesian Persuasion&#20013;&#30340;&#20449;&#24565;&#26041;&#27861;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#35299;&#20915;&#26041;&#27861;&#65292;&#24182;&#24212;&#29992;&#20110;&#29615;&#24418;&#32593;&#32476;&#28216;&#25103;&#21644;&#19968;&#38454;Bayesian Persuasion&#28216;&#25103;&#30340;&#20844;&#20849;&#20449;&#24687;&#32467;&#26500;&#19968;&#33268;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20998;&#26512;&#21592;&#35266;&#23519;&#21040;&#19968;&#20010;&#20195;&#29702;&#20154;&#37319;&#21462;&#34892;&#21160;&#30340;&#39057;&#29575;&#65292;&#20294;&#24182;&#19981;&#35266;&#23519;&#21040;&#20195;&#29702;&#20154;&#22312;&#19982;&#25910;&#30410;&#30456;&#20851;&#30340;&#24773;&#20917;&#19979;&#37319;&#21462;&#34892;&#21160;&#30340;&#39057;&#29575;&#12290;&#22312;&#36825;&#31181;&#24773;&#20917;&#19979;&#65292;&#25105;&#20204;&#38382;&#20998;&#26512;&#21592;&#20309;&#26102;&#33021;&#22815;&#23558;&#20195;&#29702;&#20154;&#30340;&#36873;&#25321;&#21512;&#29702;&#21270;&#20026;&#20195;&#29702;&#20154;&#22312;&#37319;&#21462;&#34892;&#21160;&#20043;&#21069;&#23398;&#21040;&#20102;&#19968;&#20123;&#20851;&#20110;&#24773;&#20917;&#30340;&#20449;&#24687;&#12290;&#25105;&#20204;&#30340;&#21051;&#30011;&#23558;&#20449;&#24687;&#35774;&#35745;&#20013;&#30340;&#39034;&#20174;&#26041;&#27861;&#65288;Bergemann&#21644;Morris&#65292;2016&#65289;&#21644;Bayesian Persuasion&#20013;&#30340;&#20449;&#24565;&#26041;&#27861;&#65288;Kamenica&#21644;Gentzkow&#65292;2011&#65289;&#32467;&#21512;&#36215;&#26469;&#65292;&#20381;&#36182;&#20110;Strassen&#65288;1965&#65289;&#30340;&#19968;&#20010;&#23450;&#29702;&#21644;Hall&#30340;&#23130;&#23035;&#23450;&#29702;&#12290;&#25105;&#20204;&#23558;&#32467;&#26524;&#24212;&#29992;&#20110;&#29615;&#24418;&#32593;&#32476;&#28216;&#25103;&#65292;&#24182;&#30830;&#23450;&#19968;&#20010;&#25968;&#25454;&#38598;&#22312;&#19968;&#38454;Bayesian Persuasion&#28216;&#25103;&#20013;&#19982;&#20844;&#20849;&#20449;&#24687;&#32467;&#26500;&#19968;&#33268;&#30340;&#26465;&#20214;&#12290;
&lt;/p&gt;
&lt;p&gt;
An analyst observes the frequency with which an agent takes actions, but not the frequency with which she takes actions conditional on a payoff relevant state. In this setting, we ask when the analyst can rationalize the agent's choices as the outcome of the agent learning something about the state before taking action. Our characterization marries the obedience approach in information design (Bergemann and Morris, 2016) and the belief approach in Bayesian persuasion (Kamenica and Gentzkow, 2011) relying on a theorem by Strassen (1965) and Hall's marriage theorem. We apply our results to ring-network games and to identify conditions under which a data set is consistent with a public information structure in first-order Bayesian persuasion games.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#36319;&#38543;&#32773;&#30340;&#20449;&#24687;&#22914;&#20309;&#24433;&#21709;&#21327;&#35843;&#21644;&#39640;&#25928;&#39046;&#23548;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#24403;&#36319;&#38543;&#32773;&#25317;&#26377;&#19981;&#31934;&#30830;&#30340;&#20449;&#24687;&#26102;&#65292;&#25928;&#29575;&#21487;&#20197;&#23454;&#29616;&#65307;&#28982;&#32780;&#65292;&#24403;&#36319;&#38543;&#32773;&#25317;&#26377;&#20934;&#30830;&#30340;&#20449;&#24687;&#26102;&#65292;&#39046;&#23548;&#32773;&#21487;&#33021;&#26080;&#27861;&#21327;&#35843;&#20182;&#20204;&#65292;&#29978;&#33267;&#21487;&#33021;&#37319;&#21462;&#20302;&#25928;&#34892;&#21160;&#12290;</title><link>http://arxiv.org/abs/2307.13841</link><description>&lt;p&gt;
&#19981;&#24635;&#26159;&#39046;&#23548;&#30340;&#38169;&#65306;&#30693;&#24773;&#36319;&#38543;&#32773;&#22914;&#20309;&#30772;&#22351;&#39640;&#25928;&#39046;&#23548;
&lt;/p&gt;
&lt;p&gt;
It's Not Always the Leader's Fault: How Informed Followers Can Undermine Efficient Leadership. (arXiv:2307.13841v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.13841
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#36319;&#38543;&#32773;&#30340;&#20449;&#24687;&#22914;&#20309;&#24433;&#21709;&#21327;&#35843;&#21644;&#39640;&#25928;&#39046;&#23548;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#24403;&#36319;&#38543;&#32773;&#25317;&#26377;&#19981;&#31934;&#30830;&#30340;&#20449;&#24687;&#26102;&#65292;&#25928;&#29575;&#21487;&#20197;&#23454;&#29616;&#65307;&#28982;&#32780;&#65292;&#24403;&#36319;&#38543;&#32773;&#25317;&#26377;&#20934;&#30830;&#30340;&#20449;&#24687;&#26102;&#65292;&#39046;&#23548;&#32773;&#21487;&#33021;&#26080;&#27861;&#21327;&#35843;&#20182;&#20204;&#65292;&#29978;&#33267;&#21487;&#33021;&#37319;&#21462;&#20302;&#25928;&#34892;&#21160;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21327;&#35843;&#20419;&#36827;&#21644;&#39640;&#25928;&#20915;&#31574;&#26159;&#25104;&#21151;&#39046;&#23548;&#30340;&#20004;&#20010;&#22522;&#26412;&#32452;&#25104;&#37096;&#20998;&#12290;&#26412;&#25991;&#37319;&#29992;&#20449;&#24687;&#26041;&#27861;&#30740;&#31350;&#20102;&#36319;&#38543;&#32773;&#30340;&#20449;&#24687;&#22914;&#20309;&#24433;&#21709;&#21327;&#35843;&#21644;&#39640;&#25928;&#39046;&#23548;&#65292;&#22312;&#19968;&#20010;&#21253;&#21547;&#39046;&#23548;&#32773;&#21644;&#36319;&#38543;&#32773;&#30340;&#27169;&#22411;&#20013;&#36827;&#34892;&#35843;&#26597;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#22312;&#36319;&#38543;&#32773;&#25317;&#26377;&#36275;&#22815;&#19981;&#31934;&#30830;&#30340;&#20449;&#24687;&#26102;&#65292;&#25928;&#29575;&#21487;&#20197;&#20316;&#20026;&#19968;&#31181;&#21512;&#29702;&#30340;&#32467;&#26524;&#23454;&#29616;&#12290;&#30456;&#21453;&#65292;&#22914;&#26524;&#36319;&#38543;&#32773;&#26377;&#20934;&#30830;&#30340;&#20449;&#24687;&#65292;&#39046;&#23548;&#32773;&#21487;&#33021;&#26080;&#27861;&#23558;&#20182;&#20204;&#21327;&#35843;&#21040;&#26399;&#26395;&#30340;&#32467;&#26524;&#65292;&#29978;&#33267;&#21487;&#33021;&#37319;&#21462;&#20302;&#25928;&#30340;&#34892;&#21160;&#12290;&#25105;&#20204;&#35752;&#35770;&#20102;&#32467;&#26524;&#23545;&#37329;&#34701;&#33030;&#24369;&#24615;&#21644;&#21361;&#26426;&#32972;&#26223;&#19979;&#39046;&#23548;&#32773;&#35282;&#33394;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
Coordination facilitation and efficient decision-making are two essential components of successful leadership. In this paper, we take an informational approach and investigate how followers' information impacts coordination and efficient leadership in a model featuring a leader and a team of followers. We show that efficiency is achieved as the unique rationalizable outcome of the game when followers possess sufficiently imprecise information. In contrast, if followers have accurate information, the leader may fail to coordinate them toward the desired outcome or even take an inefficient action herself. We discuss the implications of the results for the role of leaders in the context of financial fragility and crises.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#28304;&#26465;&#20214;&#21452;&#31283;&#20581;&#25512;&#26029;&#26041;&#27861;&#65292;&#29992;&#20110;&#20272;&#35745;&#32447;&#24615;&#36870;&#38382;&#39064;&#35299;&#30340;&#32447;&#24615;&#20989;&#25968;&#21442;&#25968;&#65292;&#26080;&#38656;&#30693;&#36947;&#21738;&#20010;&#36870;&#38382;&#39064;&#26356;&#33391;&#22909;&#65292;&#35813;&#26041;&#27861;&#33021;&#30830;&#20445;&#23545;&#24863;&#20852;&#36259;&#30340;&#21442;&#25968;&#30340;&#28176;&#36817;&#27491;&#24577;&#24615;&#65292;&#24182;&#25552;&#20379;&#20102;&#23545;&#36845;&#20195;Tikhonov&#27491;&#21017;&#21270;&#23545;&#25239;&#20272;&#35745;&#22120;&#30340;&#26032;&#20445;&#35777;&#12290;</title><link>http://arxiv.org/abs/2307.13793</link><description>&lt;p&gt;
&#36870;&#38382;&#39064;&#20989;&#25968;&#30340;&#28304;&#26465;&#20214;&#21452;&#31283;&#20581;&#25512;&#26029;
&lt;/p&gt;
&lt;p&gt;
Source Condition Double Robust Inference on Functionals of Inverse Problems. (arXiv:2307.13793v1 [stat.ME])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.13793
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#28304;&#26465;&#20214;&#21452;&#31283;&#20581;&#25512;&#26029;&#26041;&#27861;&#65292;&#29992;&#20110;&#20272;&#35745;&#32447;&#24615;&#36870;&#38382;&#39064;&#35299;&#30340;&#32447;&#24615;&#20989;&#25968;&#21442;&#25968;&#65292;&#26080;&#38656;&#30693;&#36947;&#21738;&#20010;&#36870;&#38382;&#39064;&#26356;&#33391;&#22909;&#65292;&#35813;&#26041;&#27861;&#33021;&#30830;&#20445;&#23545;&#24863;&#20852;&#36259;&#30340;&#21442;&#25968;&#30340;&#28176;&#36817;&#27491;&#24577;&#24615;&#65292;&#24182;&#25552;&#20379;&#20102;&#23545;&#36845;&#20195;Tikhonov&#27491;&#21017;&#21270;&#23545;&#25239;&#20272;&#35745;&#22120;&#30340;&#26032;&#20445;&#35777;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#32771;&#34385;&#20102;&#32447;&#24615;&#36870;&#38382;&#39064;&#35299;&#30340;&#32447;&#24615;&#20989;&#25968;&#21442;&#25968;&#30340;&#20272;&#35745;&#12290;&#20219;&#20309;&#36825;&#26679;&#30340;&#21442;&#25968;&#37117;&#26377;&#19968;&#20010;&#21452;&#31283;&#20581;&#34920;&#31034;&#65292;&#35813;&#34920;&#31034;&#20381;&#36182;&#20110;&#23545;&#20598;&#32447;&#24615;&#36870;&#38382;&#39064;&#30340;&#35299;&#65292;&#20854;&#20013;&#23545;&#20598;&#35299;&#21487;&#20197;&#34987;&#35270;&#20026;&#36870;&#20542;&#21521;&#20989;&#25968;&#30340;&#25512;&#24191;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#31532;&#19968;&#20010;&#28304;&#26465;&#20214;&#21452;&#31283;&#20581;&#25512;&#26029;&#26041;&#27861;&#65292;&#21482;&#35201;&#21407;&#22987;&#25110;&#23545;&#20598;&#36870;&#38382;&#39064;&#36275;&#22815;&#33391;&#22909;&#65292;&#26080;&#38656;&#30693;&#36947;&#21738;&#20010;&#36870;&#38382;&#39064;&#26356;&#33391;&#22909;&#65292;&#23601;&#33021;&#30830;&#20445;&#23545;&#24863;&#20852;&#36259;&#30340;&#21442;&#25968;&#30340;&#28176;&#36817;&#27491;&#24577;&#24615;&#12290;&#25105;&#20204;&#30340;&#32467;&#26524;&#26159;&#36890;&#36807;&#23545;&#32447;&#24615;&#36870;&#38382;&#39064;&#30340;&#36845;&#20195;Tikhonov&#27491;&#21017;&#21270;&#23545;&#25239;&#20272;&#35745;&#22120;&#22312;&#19968;&#33324;&#20551;&#35774;&#31354;&#38388;&#19978;&#30340;&#26032;&#30340;&#20445;&#35777;&#32780;&#23454;&#29616;&#30340;&#65292;&#36825;&#26159;&#19968;&#20010;&#29420;&#31435;&#21457;&#23637;&#30340;&#21033;&#30410;&#12290;
&lt;/p&gt;
&lt;p&gt;
We consider estimation of parameters defined as linear functionals of solutions to linear inverse problems. Any such parameter admits a doubly robust representation that depends on the solution to a dual linear inverse problem, where the dual solution can be thought as a generalization of the inverse propensity function. We provide the first source condition double robust inference method that ensures asymptotic normality around the parameter of interest as long as either the primal or the dual inverse problem is sufficiently well-posed, without knowledge of which inverse problem is the more well-posed one. Our result is enabled by novel guarantees for iterated Tikhonov regularized adversarial estimators for linear inverse problems, over general hypothesis spaces, which are developments of independent interest.
&lt;/p&gt;</description></item><item><title>&#35813;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#19981;&#38656;&#35201;&#35843;&#21442;&#12289;&#19981;&#38656;&#35201;&#20272;&#35745;&#21327;&#26041;&#24046;&#30697;&#38453;&#30340;&#33258;&#21161;&#27861;&#27979;&#35797;&#26041;&#27861;&#65292;&#29992;&#20110;&#35780;&#20272;&#22240;&#23376;&#22238;&#24402;&#27169;&#22411;&#22312;&#39640;&#32500;&#22240;&#23376;&#22686;&#24378;&#31232;&#30095;&#22238;&#24402;&#27169;&#22411;&#20013;&#30340;&#36866;&#29992;&#24615;&#12290;&#36890;&#36807;&#27169;&#25311;&#23454;&#39564;&#35777;&#26126;&#20102;&#35813;&#26041;&#27861;&#30340;&#33391;&#22909;&#24615;&#33021;&#65292;&#24182;&#22312;&#24212;&#29992;&#20110;&#23454;&#38469;&#25968;&#25454;&#38598;&#26102;&#25298;&#32477;&#20102;&#32463;&#20856;&#22240;&#23376;&#22238;&#24402;&#27169;&#22411;&#30340;&#25311;&#21512;&#24615;&#12290;</title><link>http://arxiv.org/abs/2307.13364</link><description>&lt;p&gt;
&#19981;&#38656;&#35201;&#35843;&#21442;&#30340;&#22240;&#23376;&#22238;&#24402;&#27979;&#35797;&#19982;&#22240;&#23376;&#22686;&#24378;&#31232;&#30095;&#30340;&#23545;&#31435;. (arXiv:2307.13364v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
Tuning-free testing of factor regression against factor-augmented sparse alternatives. (arXiv:2307.13364v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.13364
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#19981;&#38656;&#35201;&#35843;&#21442;&#12289;&#19981;&#38656;&#35201;&#20272;&#35745;&#21327;&#26041;&#24046;&#30697;&#38453;&#30340;&#33258;&#21161;&#27861;&#27979;&#35797;&#26041;&#27861;&#65292;&#29992;&#20110;&#35780;&#20272;&#22240;&#23376;&#22238;&#24402;&#27169;&#22411;&#22312;&#39640;&#32500;&#22240;&#23376;&#22686;&#24378;&#31232;&#30095;&#22238;&#24402;&#27169;&#22411;&#20013;&#30340;&#36866;&#29992;&#24615;&#12290;&#36890;&#36807;&#27169;&#25311;&#23454;&#39564;&#35777;&#26126;&#20102;&#35813;&#26041;&#27861;&#30340;&#33391;&#22909;&#24615;&#33021;&#65292;&#24182;&#22312;&#24212;&#29992;&#20110;&#23454;&#38469;&#25968;&#25454;&#38598;&#26102;&#25298;&#32477;&#20102;&#32463;&#20856;&#22240;&#23376;&#22238;&#24402;&#27169;&#22411;&#30340;&#25311;&#21512;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#24341;&#20837;&#20102;&#19968;&#31181;&#22522;&#20110;&#33258;&#21161;&#27861;&#30340;&#22240;&#23376;&#22238;&#24402;&#26377;&#25928;&#24615;&#27979;&#35797;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#22312;&#38598;&#25104;&#20102;&#22240;&#23376;&#22238;&#24402;&#21644;&#31232;&#30095;&#22238;&#24402;&#25216;&#26415;&#30340;&#39640;&#32500;&#22240;&#23376;&#22686;&#24378;&#31232;&#30095;&#22238;&#24402;&#27169;&#22411;&#20013;&#20351;&#29992;&#12290;&#35813;&#27979;&#35797;&#26041;&#27861;&#25552;&#20379;&#20102;&#19968;&#31181;&#35780;&#20272;&#32463;&#20856;&#65288;&#23494;&#38598;&#65289;&#22240;&#23376;&#22238;&#24402;&#27169;&#22411;&#19982;&#26367;&#20195;&#65288;&#31232;&#30095;&#21152;&#23494;&#38598;&#65289;&#22240;&#23376;&#22686;&#24378;&#31232;&#30095;&#22238;&#24402;&#27169;&#22411;&#30340;&#36866;&#29992;&#24615;&#30340;&#26041;&#24335;&#12290;&#25105;&#20204;&#25552;&#20986;&#30340;&#27979;&#35797;&#19981;&#38656;&#35201;&#35843;&#21442;&#65292;&#28040;&#38500;&#20102;&#20272;&#35745;&#21327;&#26041;&#24046;&#30697;&#38453;&#30340;&#38656;&#27714;&#65292;&#24182;&#19988;&#22312;&#23454;&#29616;&#19978;&#31616;&#21333;&#12290;&#35813;&#27979;&#35797;&#30340;&#26377;&#25928;&#24615;&#22312;&#26102;&#38388;&#24207;&#21015;&#30456;&#20851;&#24615;&#19979;&#22312;&#29702;&#35770;&#19978;&#24471;&#21040;&#20102;&#35777;&#26126;&#12290;&#36890;&#36807;&#27169;&#25311;&#23454;&#39564;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#25105;&#20204;&#30340;&#26041;&#27861;&#22312;&#26377;&#38480;&#26679;&#26412;&#19979;&#30340;&#33391;&#22909;&#24615;&#33021;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#20351;&#29992;FRED-MD&#25968;&#25454;&#38598;&#24212;&#29992;&#20102;&#35813;&#27979;&#35797;&#65292;&#24182;&#22312;&#22240;&#21464;&#37327;&#20026;&#36890;&#32960;&#26102;&#25298;&#32477;&#20102;&#32463;&#20856;&#22240;&#23376;&#22238;&#24402;&#27169;&#22411;&#30340;&#25311;&#21512;&#24615;&#65292;&#20294;&#22312;&#22240;&#21464;&#37327;&#20026;&#24037;&#19994;&#29983;&#20135;&#26102;&#26410;&#25298;&#32477;&#12290;&#36825;&#20123;&#21457;&#29616;&#20026;&#36873;&#25321;&#36866;&#24403;&#27169;&#22411;&#25552;&#20379;&#20102;&#21442;&#32771;&#12290;
&lt;/p&gt;
&lt;p&gt;
This study introduces a bootstrap test of the validity of factor regression within a high-dimensional factor-augmented sparse regression model that integrates factor and sparse regression techniques. The test provides a means to assess the suitability of the classical (dense) factor regression model compared to alternative (sparse plus dense) factor-augmented sparse regression models. Our proposed test does not require tuning parameters, eliminates the need to estimate covariance matrices, and offers simplicity in implementation. The validity of the test is theoretically established under time-series dependence. Through simulation experiments, we demonstrate the favorable finite sample performance of our procedure. Moreover, using the FRED-MD dataset, we apply the test and reject the adequacy of the classical factor regression model when the dependent variable is inflation but not when it is industrial production. These findings offer insights into selecting appropriate models for high
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#36890;&#36807;&#35299;&#26512;&#21327;&#35843;&#38382;&#39064;&#65292;&#24314;&#31435;&#20102;&#19968;&#31181;&#29305;&#27530;&#30340;&#34917;&#36148;&#35774;&#35745;&#27169;&#22411;&#65292;&#39318;&#27425;&#21457;&#29616;&#20102;&#8220;&#35299;&#35868;&#25928;&#24212;&#8221;&#65292;&#36890;&#36807;&#23545;&#34917;&#36148;&#30340;&#29305;&#24615;&#36827;&#34892;&#34920;&#24449;&#65292;&#25214;&#21040;&#23454;&#29616;&#32473;&#23450;&#21338;&#24328;&#32467;&#26524;&#30340;&#21807;&#19968;&#22343;&#34913;&#12290;&#35813;&#27169;&#22411;&#20855;&#26377;&#23545;&#31216;&#24615;&#65292;&#20840;&#23616;&#36830;&#32493;&#24615;&#65292;&#38543;&#26426;&#26426;&#20250;&#25104;&#26412;&#30340;&#22686;&#21152;&#21644;&#36127;&#28322;&#20986;&#25928;&#24212;&#30340;&#20943;&#23569;&#12290;&#24212;&#29992;&#21253;&#25324;&#32852;&#21512;&#25237;&#36164;&#38382;&#39064;&#12289;&#21442;&#19982;&#20915;&#31574;&#21644;&#22996;&#25176;&#20195;&#29702;&#21512;&#21516;&#12290;</title><link>http://arxiv.org/abs/2307.08557</link><description>&lt;p&gt;
&#35299;&#26512;&#21327;&#35843;&#38382;&#39064;
&lt;/p&gt;
&lt;p&gt;
Unraveling Coordination Problems. (arXiv:2307.08557v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.08557
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36890;&#36807;&#35299;&#26512;&#21327;&#35843;&#38382;&#39064;&#65292;&#24314;&#31435;&#20102;&#19968;&#31181;&#29305;&#27530;&#30340;&#34917;&#36148;&#35774;&#35745;&#27169;&#22411;&#65292;&#39318;&#27425;&#21457;&#29616;&#20102;&#8220;&#35299;&#35868;&#25928;&#24212;&#8221;&#65292;&#36890;&#36807;&#23545;&#34917;&#36148;&#30340;&#29305;&#24615;&#36827;&#34892;&#34920;&#24449;&#65292;&#25214;&#21040;&#23454;&#29616;&#32473;&#23450;&#21338;&#24328;&#32467;&#26524;&#30340;&#21807;&#19968;&#22343;&#34913;&#12290;&#35813;&#27169;&#22411;&#20855;&#26377;&#23545;&#31216;&#24615;&#65292;&#20840;&#23616;&#36830;&#32493;&#24615;&#65292;&#38543;&#26426;&#26426;&#20250;&#25104;&#26412;&#30340;&#22686;&#21152;&#21644;&#36127;&#28322;&#20986;&#25928;&#24212;&#30340;&#20943;&#23569;&#12290;&#24212;&#29992;&#21253;&#25324;&#32852;&#21512;&#25237;&#36164;&#38382;&#39064;&#12289;&#21442;&#19982;&#20915;&#31574;&#21644;&#22996;&#25176;&#20195;&#29702;&#21512;&#21516;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#21327;&#35843;&#38382;&#39064;&#20013;&#30340;&#25919;&#31574;&#35774;&#35745;&#12290;&#22312;&#21327;&#35843;&#21338;&#24328;&#20013;&#65292;&#34917;&#36148;&#25552;&#39640;&#20102;&#29609;&#23478;i&#36873;&#25321;&#34917;&#36148;&#34892;&#21160;&#30340;&#21160;&#26426;&#12290;&#36825;&#36827;&#19968;&#27493;&#25552;&#39640;&#20102;j&#36873;&#25321;&#30456;&#21516;&#34892;&#21160;&#30340;&#21160;&#26426;&#65292;&#36827;&#32780;&#28608;&#21169;i&#65292;&#20381;&#27492;&#31867;&#25512;&#12290;&#22522;&#20110;&#36825;&#31181;&#8220;&#35299;&#35868;&#25928;&#24212;&#8221;&#65292;&#25105;&#20204;&#23545;&#23454;&#26045;&#32473;&#23450;&#21338;&#24328;&#32467;&#26524;&#30340;&#34917;&#36148;&#36827;&#34892;&#20102;&#34920;&#24449;&#65292;&#23558;&#20854;&#21807;&#19968;&#22343;&#34913;&#12290;&#22312;&#20854;&#20182;&#23646;&#24615;&#20013;&#65292;&#25105;&#20204;&#30830;&#23450;&#20102;&#20197;&#19979;&#29305;&#28857;&#65306;&#65288;i&#65289;&#23545;&#20110;&#30456;&#21516;&#30340;&#21442;&#19982;&#32773;&#26159;&#23545;&#31216;&#30340;&#65307;&#65288;ii&#65289;&#22312;&#27169;&#22411;&#21442;&#25968;&#19978;&#20840;&#23616;&#36830;&#32493;&#65307;&#65288;iii&#65289;&#19982;&#26426;&#20250;&#25104;&#26412;&#27491;&#30456;&#20851;&#65307;&#65288;iv&#65289;&#19982;&#28322;&#20986;&#25928;&#24212;&#36127;&#30456;&#20851;&#12290;&#35813;&#27169;&#22411;&#30340;&#24212;&#29992;&#21253;&#25324;&#32852;&#21512;&#25237;&#36164;&#38382;&#39064;&#12289;&#21442;&#19982;&#20915;&#31574;&#21644;&#22996;&#25176;&#20195;&#29702;&#21512;&#21516;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper studies policy design in coordination problems. In coordination games, a subsidy raises player $i$'s incentive to play the subsidized action. This raises $j$'s incentive to play the same action, which further incentivizes $i$, and so on. Building upon this ``unraveling effect'', we characterize the subsidies that implement a given outcome of the game as its unique equilibrium. Among other properties, we establish that subsidies are: (i) symmetric for identical players; (ii) globally continuous in model parameters; (iii) increasing in opportunity costs; and (iv) decreasing in spillovers. Applications of the model include joint investment problems, participation decisions, and principal-agent contracting.
&lt;/p&gt;</description></item><item><title>&#36825;&#31687;&#35770;&#25991;&#30740;&#31350;&#20102;&#39046;&#23548;&#32773;&#22312;&#20840;&#29699;&#21338;&#24328;&#20013;&#30340;&#20449;&#21495;&#20316;&#29992;&#65292;&#36890;&#36807;&#30740;&#31350;&#23436;&#20840;&#20449;&#24687;&#30340;&#39046;&#23548;&#32773;&#21644;&#36861;&#38543;&#32773;&#22242;&#38431;&#38754;&#20020;&#30340;&#21327;&#35843;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#19968;&#20010;&#21807;&#19968;&#30340;&#22343;&#34913;&#31574;&#30053;&#65292;&#24182;&#35752;&#35770;&#20102;&#23545;&#32511;&#33394;&#25216;&#26415;&#37319;&#29992;&#12289;&#36135;&#24065;&#25915;&#20987;&#21644;&#38761;&#21629;&#31561;&#29616;&#35937;&#30340;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2209.12426</link><description>&lt;p&gt;
&#39046;&#23548;&#32773;&#22312;&#20840;&#29699;&#21338;&#24328;&#20013;&#30340;&#20449;&#21495;&#20316;&#29992;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
The Signaling Role of Leaders in Global Games. (arXiv:2209.12426v2 [econ.TH] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2209.12426
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#30740;&#31350;&#20102;&#39046;&#23548;&#32773;&#22312;&#20840;&#29699;&#21338;&#24328;&#20013;&#30340;&#20449;&#21495;&#20316;&#29992;&#65292;&#36890;&#36807;&#30740;&#31350;&#23436;&#20840;&#20449;&#24687;&#30340;&#39046;&#23548;&#32773;&#21644;&#36861;&#38543;&#32773;&#22242;&#38431;&#38754;&#20020;&#30340;&#21327;&#35843;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#19968;&#20010;&#21807;&#19968;&#30340;&#22343;&#34913;&#31574;&#30053;&#65292;&#24182;&#35752;&#35770;&#20102;&#23545;&#32511;&#33394;&#25216;&#26415;&#37319;&#29992;&#12289;&#36135;&#24065;&#25915;&#20987;&#21644;&#38761;&#21629;&#31561;&#29616;&#35937;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#20013;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#39046;&#23548;&#32773;&#22312;&#20840;&#29699;&#21338;&#24328;&#26694;&#26550;&#20013;&#30340;&#20449;&#21495;&#20316;&#29992;&#12290;&#36890;&#36807;&#30740;&#31350;&#23436;&#20840;&#20449;&#24687;&#30340;&#39046;&#23548;&#32773;&#21644;&#36861;&#38543;&#32773;&#22242;&#38431;&#38754;&#20020;&#30340;&#21327;&#35843;&#38382;&#39064;&#65292;&#25105;&#20204;&#32473;&#20986;&#20102;&#19968;&#20010;&#24517;&#35201;&#19988;&#20805;&#20998;&#30340;&#26465;&#20214;&#65292;&#20351;&#24471;&#21333;&#35843;&#22343;&#34913;&#31574;&#30053;&#33021;&#22815;&#21807;&#19968;&#22320;&#36798;&#21040;$\Delta$-&#21512;&#29702;&#21270;&#65292;&#24182;&#19988;&#20445;&#35777;&#22343;&#34913;&#30340;&#21807;&#19968;&#24615;&#12290;&#27492;&#22806;&#65292;&#36825;&#20010;&#21807;&#19968;&#30340;&#22343;&#34913;&#26159;&#23436;&#20840;&#39640;&#25928;&#30340;&#12290;&#24403;&#39046;&#23548;&#32773;&#35266;&#23519;&#21040;&#19968;&#20010;&#22122;&#38899;&#20449;&#21495;&#32780;&#19981;&#26159;&#30495;&#23454;&#29366;&#24577;&#26102;&#65292;&#36825;&#20010;&#32467;&#26524;&#20173;&#28982;&#25104;&#31435;&#65292;&#20294;&#21487;&#33021;&#26080;&#27861;&#36798;&#21040;&#23436;&#20840;&#30340;&#25928;&#29575;&#12290;&#25105;&#20204;&#35752;&#35770;&#20102;&#36825;&#20123;&#32467;&#26524;&#23545;&#24191;&#27867;&#30340;&#29616;&#35937;&#65292;&#22914;&#32511;&#33394;&#25216;&#26415;&#30340;&#37319;&#29992;&#12289;&#36135;&#24065;&#25915;&#20987;&#21644;&#38761;&#21629;&#31561;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
How important are leaders' actions in facilitating coordination? In this paper, we investigate their signaling role in a global games framework. A perfectly informed leader and a team of followers face a coordination problem. Despite the endogenous information generated by the leader's action, we provide a necessary and sufficient condition that makes the monotone equilibrium strategy profile uniquely $\Delta$-rationalizable and hence guarantees equilibrium uniqueness. Moreover, the unique equilibrium is fully efficient. This result remains valid when the leader observes a noisy signal about the true state except full efficiency may not be obtained. We discuss the implications of our results for a broad class of phenomena such as adoption of green technology, currency attacks and revolutions.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#26356;&#31283;&#20581;&#30340;&#24037;&#20855;&#21464;&#37327;&#30456;&#20851;&#38543;&#26426;&#31995;&#25968;&#65288;IV-CRC&#65289;&#20272;&#35745;&#22120;&#65292;&#21487;&#26356;&#22909;&#22320;&#24212;&#23545;&#24322;&#36136;&#25928;&#24212;&#65292;&#37325;&#26032;&#23457;&#35270;&#20102;&#20013;&#32654;&#36827;&#21475;&#23545;&#32654;&#22269;&#21046;&#36896;&#19994;&#23601;&#19994;&#24433;&#21709;&#30340;&#30740;&#31350;&#65292;&#32467;&#26524;&#34920;&#26126;&#65292;&#22312;&#19981;&#20551;&#35774;&#25928;&#24212;&#24658;&#23450;&#30340;&#24773;&#20917;&#19979;&#65292;&#26080;&#27861;&#24471;&#20986;&#20013;&#22269;&#36827;&#21475;&#23545;&#32654;&#22269;&#21046;&#36896;&#19994;&#23601;&#19994;&#36127;&#38754;&#24433;&#21709;&#30340;&#32467;&#35770;&#12290;</title><link>http://arxiv.org/abs/2103.06437</link><description>&lt;p&gt;
&#38754;&#26495;Bartik&#35774;&#35745;&#30340;&#26356;&#31283;&#20581;&#30340;&#20272;&#35745;&#26041;&#27861;&#65292;&#21450;&#20854;&#22312;&#20013;&#32654;&#36827;&#21475;&#36152;&#26131;&#23545;&#32654;&#22269;&#23601;&#19994;&#24433;&#21709;&#20013;&#30340;&#24212;&#29992;
&lt;/p&gt;
&lt;p&gt;
More Robust Estimators for Panel Bartik Designs, With An Application to the Effect of Imports from China on US Employment. (arXiv:2103.06437v6 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2103.06437
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#26356;&#31283;&#20581;&#30340;&#24037;&#20855;&#21464;&#37327;&#30456;&#20851;&#38543;&#26426;&#31995;&#25968;&#65288;IV-CRC&#65289;&#20272;&#35745;&#22120;&#65292;&#21487;&#26356;&#22909;&#22320;&#24212;&#23545;&#24322;&#36136;&#25928;&#24212;&#65292;&#37325;&#26032;&#23457;&#35270;&#20102;&#20013;&#32654;&#36827;&#21475;&#23545;&#32654;&#22269;&#21046;&#36896;&#19994;&#23601;&#19994;&#24433;&#21709;&#30340;&#30740;&#31350;&#65292;&#32467;&#26524;&#34920;&#26126;&#65292;&#22312;&#19981;&#20551;&#35774;&#25928;&#24212;&#24658;&#23450;&#30340;&#24773;&#20917;&#19979;&#65292;&#26080;&#27861;&#24471;&#20986;&#20013;&#22269;&#36827;&#21475;&#23545;&#32654;&#22269;&#21046;&#36896;&#19994;&#23601;&#19994;&#36127;&#38754;&#24433;&#21709;&#30340;&#32467;&#35770;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#35777;&#26126;&#65292;&#38754;&#26495;Bartik&#22238;&#24402;&#21487;&#20197;&#30830;&#23450;&#20301;&#32622;&#21644;&#26102;&#38388;&#29305;&#23450;&#30340;&#27835;&#30103;&#25928;&#24212;&#30340;&#38750;&#20984;&#32452;&#21512;&#12290;&#22240;&#27492;&#65292;&#22312;&#23384;&#22312;&#24322;&#36136;&#25928;&#24212;&#30340;&#24773;&#20917;&#19979;&#65292;&#36825;&#20123;&#22238;&#24402;&#21487;&#33021;&#23384;&#22312;&#20559;&#24046;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26367;&#20195;&#30340;&#24037;&#20855;&#21464;&#37327;&#30456;&#20851;&#38543;&#26426;&#31995;&#25968;&#65288;IV-CRC&#65289;&#20272;&#35745;&#22120;&#65292;&#21487;&#26356;&#22909;&#22320;&#24212;&#23545;&#24322;&#36136;&#25928;&#24212;&#12290;&#25105;&#20204;&#37325;&#26032;&#23457;&#35270;&#20102;Autor&#31561;&#20154;&#65288;2013&#65289;&#30340;&#30740;&#31350;&#65292;&#20182;&#20204;&#20351;&#29992;&#38754;&#26495;Bartik&#22238;&#24402;&#20272;&#35745;&#20013;&#32654;&#36827;&#21475;&#23545;&#32654;&#22269;&#21046;&#36896;&#19994;&#23601;&#19994;&#30340;&#24433;&#21709;&#12290;&#20182;&#20204;&#30340;&#22238;&#24402;&#20272;&#35745;&#20102;&#39640;&#24230;&#38750;&#20984;&#30340;&#25928;&#24212;&#32452;&#21512;&#65292;&#25105;&#20204;&#30340;IV-CRC&#20272;&#35745;&#22120;&#24456;&#23567;&#19988;&#19981;&#26174;&#33879;&#65306;&#22312;&#19981;&#20551;&#35774;&#25928;&#24212;&#24658;&#23450;&#30340;&#24773;&#20917;&#19979;&#65292;&#26080;&#27861;&#24471;&#20986;&#20013;&#22269;&#36827;&#21475;&#23545;&#32654;&#22269;&#21046;&#36896;&#19994;&#23601;&#19994;&#36127;&#38754;&#24433;&#21709;&#30340;&#32467;&#35770;&#12290;
&lt;/p&gt;
&lt;p&gt;
We show that panel Bartik regressions identify non-convex combinations of location-and-period-specific treatment effects. Thus, those regressions could be biased in the presence of heterogeneous effects. We propose an alternative instrumental-variable correlated-random-coefficient (IV-CRC) estimator, that is more robust to heterogeneous effects. We revisit Autor et al. (2013), who use a panel Bartik regression to estimate the effect of imports from China on US manufacturing employment. Their regression estimates a highly non-convex combination of effects, and our IV-CRC estimator is small and insignificant: without assuming constant effects, one cannot conclude that imports from China negatively affected US manufacturing employment.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#27604;&#36739;&#20102;&#36798;&#23572;&#25991;&#36827;&#21270;&#35770;&#19982;Nash&#22343;&#34913;&#26144;&#23556;&#36825;&#20004;&#31181;&#20998;&#26512;&#26041;&#27861;&#65292;&#20197;&#21450;&#25968;&#20540;&#20195;&#29702;&#27169;&#22411;&#21644;&#21704;&#23494;&#39039;&#21160;&#21147;&#23398;&#65292;&#21457;&#29616;&#22312;&#28909;&#21147;&#23398;&#26497;&#38480;&#19979;&#65292;&#36798;&#23572;&#25991;&#36827;&#21270;&#35770;&#26041;&#27861;&#23545;&#20110;&#31038;&#20132;&#22256;&#22659;&#28216;&#25103;&#30340;&#30913;&#21270;&#29575;&#32473;&#20986;&#20102;&#38169;&#35823;&#30340;&#27491;&#38754;&#32467;&#26524;&#65292;&#32780;&#21704;&#23494;&#39039;&#21160;&#21147;&#23398;&#26041;&#27861;&#23436;&#20840;&#22833;&#36133;&#12290;</title><link>http://arxiv.org/abs/2103.00295</link><description>&lt;p&gt;
Nash&#22343;&#34913;&#26144;&#23556;&#19982;&#21704;&#23494;&#39039;&#21160;&#21147;&#23398;&#19982;&#36798;&#23572;&#25991;&#36827;&#21270;&#35770;&#22312;&#19968;&#20123;&#31038;&#20132;&#22256;&#22659;&#28216;&#25103;&#30340;&#28909;&#21147;&#23398;&#26497;&#38480;&#20013;&#30340;&#27604;&#36739;
&lt;/p&gt;
&lt;p&gt;
Nash equilibrium mapping vs Hamiltonian dynamics vs Darwinian evolution for some social dilemma games in the thermodynamic limit. (arXiv:2103.00295v2 [cond-mat.stat-mech] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2103.00295
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#27604;&#36739;&#20102;&#36798;&#23572;&#25991;&#36827;&#21270;&#35770;&#19982;Nash&#22343;&#34913;&#26144;&#23556;&#36825;&#20004;&#31181;&#20998;&#26512;&#26041;&#27861;&#65292;&#20197;&#21450;&#25968;&#20540;&#20195;&#29702;&#27169;&#22411;&#21644;&#21704;&#23494;&#39039;&#21160;&#21147;&#23398;&#65292;&#21457;&#29616;&#22312;&#28909;&#21147;&#23398;&#26497;&#38480;&#19979;&#65292;&#36798;&#23572;&#25991;&#36827;&#21270;&#35770;&#26041;&#27861;&#23545;&#20110;&#31038;&#20132;&#22256;&#22659;&#28216;&#25103;&#30340;&#30913;&#21270;&#29575;&#32473;&#20986;&#20102;&#38169;&#35823;&#30340;&#27491;&#38754;&#32467;&#26524;&#65292;&#32780;&#21704;&#23494;&#39039;&#21160;&#21147;&#23398;&#26041;&#27861;&#23436;&#20840;&#22833;&#36133;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22914;&#20309;&#22312;&#31038;&#20132;&#22256;&#22659;&#28216;&#25103;&#30340;&#28909;&#21147;&#23398;&#25110;&#26080;&#31351;&#22823;&#21442;&#19982;&#32773;&#38480;&#21046;&#26465;&#20214;&#19979;&#21512;&#20316;&#22914;&#20309;&#28436;&#21270;&#21644;&#26174;&#29616;&#20986;&#26469;&#26159;&#19968;&#20010;&#24341;&#36215;&#24378;&#28872;&#25512;&#27979;&#30340;&#38382;&#39064;&#12290;&#24050;&#32463;&#25552;&#20986;&#20102;&#21508;&#31181;&#20998;&#26512;&#26041;&#27861;&#26469;&#20998;&#26512;&#31038;&#20132;&#22256;&#22659;&#30340;&#28909;&#21147;&#23398;&#26497;&#38480;&#12290;&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#23558;&#20004;&#31181;&#20998;&#26512;&#26041;&#27861;&#65292;&#21363;&#36798;&#23572;&#25991;&#36827;&#21270;&#35770;&#21644;Nash&#22343;&#34913;&#26144;&#23556;&#19982;&#25968;&#20540;&#20195;&#29702;&#27169;&#22411;&#36827;&#34892;&#20102;&#27604;&#36739;&#12290;&#20026;&#20102;&#23436;&#25972;&#24615;&#65292;&#25105;&#20204;&#36824;&#32473;&#20986;&#20102;&#21478;&#19968;&#31181;&#20998;&#26512;&#26041;&#27861;&#65292;&#21363;&#21704;&#23494;&#39039;&#21160;&#21147;&#23398;&#30340;&#32467;&#26524;&#12290;&#19982;&#28041;&#21450;&#26368;&#22823;&#21270;&#25152;&#26377;&#20010;&#20307;&#25910;&#30410;&#30340;&#21704;&#23494;&#39039;&#21160;&#21147;&#23398;&#19981;&#21516;&#65292;&#36798;&#23572;&#25991;&#36827;&#21270;&#35770;&#26041;&#27861;&#26159;&#38024;&#23545;&#19982;&#26368;&#36817;&#37051;&#20010;&#20307;&#20043;&#38388;&#30340;&#20114;&#21160;&#26368;&#22823;&#21270;&#21333;&#20010;&#29609;&#23478;&#30340;&#25910;&#30410;&#12290;&#19982;Nash&#22343;&#34913;&#26144;&#23556;&#30456;&#27604;&#65292;&#21704;&#23494;&#39039;&#21160;&#21147;&#23398;&#26041;&#27861;&#23436;&#20840;&#22833;&#36133;&#65292;&#32780;&#36798;&#23572;&#25991;&#36827;&#21270;&#35770;&#26041;&#27861;&#22312;&#25903;&#20184;&#28385;&#36275;&#26465;&#20214;a + d = b&#26102;&#23545;&#20110;&#28216;&#25103;&#30913;&#21270;&#29575;&#8212;&#8212;&#21512;&#20316;&#32773;&#21644;&#32570;&#20047;&#21512;&#20316;&#32773;&#20043;&#38388;&#27604;&#20363;&#30340;&#20928;&#24046;&#24322;&#8212;&#8212;&#32473;&#20986;&#20102;&#19968;&#20010;&#38169;&#35823;&#30340;&#27491;&#38754;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
How cooperation evolves and manifests itself in the thermodynamic or infinite player limit of social dilemma games is a matter of intense speculation. Various analytical methods have been proposed to analyze the thermodynamic limit of social dilemmas. In this work, we compare two analytical methods, i.e., Darwinian evolution and Nash equilibrium mapping, with a numerical agent-based approach. For completeness, we also give results for another analytical method, Hamiltonian dynamics. In contrast to Hamiltonian dynamics, which involves the maximization of payoffs of all individuals, in Darwinian evolution, the payoff of a single player is maximized with respect to its interaction with the nearest neighbor. While the Hamiltonian dynamics method utterly fails as compared to Nash equilibrium mapping, the Darwinian evolution method gives a false positive for game magnetization -- the net difference between the fraction of cooperators and defectors -- when payoffs obey the condition a + d = b
&lt;/p&gt;</description></item></channel></rss>