<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#35813;&#30740;&#31350;&#35780;&#20272;&#20102;K-12&#23398;&#26657;&#22312;&#23485;&#24102;&#20114;&#32852;&#32593;&#37319;&#36141;&#20013;&#36890;&#36807;&#25414;&#32465;&#38656;&#27714;&#30340;&#25928;&#26524;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#21442;&#19982;&#32773;&#30340;&#20215;&#26684;&#24179;&#22343;&#19979;&#38477;&#20102;&#19977;&#20998;&#20043;&#19968;&#65292;&#36141;&#20080;&#30340;&#23485;&#24102;&#36895;&#24230;&#22686;&#21152;&#20102;&#20845;&#20493;&#12290;&#21442;&#19982;&#23398;&#26657;&#33410;&#30465;&#30340;&#37329;&#39069;&#33267;&#23569;&#31561;&#20110;&#32852;&#37030;&#25919;&#24220;&#30340;&#34917;&#36148;&#37329;&#39069;&#12290;&#26681;&#25454;&#24369;&#20551;&#35774;&#65292;&#21442;&#19982;&#23398;&#26657;&#33719;&#24471;&#20102;&#24040;&#22823;&#30340;&#31119;&#21033;&#25552;&#21319;&#12290;</title><link>https://arxiv.org/abs/2402.07277</link><description>&lt;p&gt;
K-12&#23485;&#24102;&#37319;&#36141;&#20013;&#30340;&#38656;&#27714;&#25414;&#32465;&#25928;&#24212;
&lt;/p&gt;
&lt;p&gt;
Bundling Demand in K-12 Broadband Procurement
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.07277
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#35780;&#20272;&#20102;K-12&#23398;&#26657;&#22312;&#23485;&#24102;&#20114;&#32852;&#32593;&#37319;&#36141;&#20013;&#36890;&#36807;&#25414;&#32465;&#38656;&#27714;&#30340;&#25928;&#26524;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#21442;&#19982;&#32773;&#30340;&#20215;&#26684;&#24179;&#22343;&#19979;&#38477;&#20102;&#19977;&#20998;&#20043;&#19968;&#65292;&#36141;&#20080;&#30340;&#23485;&#24102;&#36895;&#24230;&#22686;&#21152;&#20102;&#20845;&#20493;&#12290;&#21442;&#19982;&#23398;&#26657;&#33410;&#30465;&#30340;&#37329;&#39069;&#33267;&#23569;&#31561;&#20110;&#32852;&#37030;&#25919;&#24220;&#30340;&#34917;&#36148;&#37329;&#39069;&#12290;&#26681;&#25454;&#24369;&#20551;&#35774;&#65292;&#21442;&#19982;&#23398;&#26657;&#33719;&#24471;&#20102;&#24040;&#22823;&#30340;&#31119;&#21033;&#25552;&#21319;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#35780;&#20272;&#20102;K-12&#23398;&#26657;&#36890;&#36807;&#25414;&#32465;&#38656;&#27714;&#33719;&#24471;&#23485;&#24102;&#20114;&#32852;&#32593;&#30340;&#25928;&#26524;&#12290;2014&#24180;&#65292;&#26032;&#27901;&#35199;&#24030;&#20174;&#20998;&#25955;&#30340;&#37319;&#36141;&#26041;&#24335;&#36716;&#21464;&#20026;&#23558;&#23398;&#26657;&#20998;&#20026;&#22235;&#20010;&#21306;&#22495;&#32452;&#21512;&#30340;&#26032;&#37319;&#36141;&#31995;&#32479;&#12290;&#37319;&#29992;&#20107;&#20214;&#30740;&#31350;&#26041;&#27861;&#65292;&#25105;&#20204;&#21457;&#29616;&#21442;&#19982;&#32773;&#30340;&#20215;&#26684;&#24179;&#22343;&#19979;&#38477;&#20102;&#19977;&#20998;&#20043;&#19968;&#65292;&#36141;&#20080;&#30340;&#23485;&#24102;&#36895;&#24230;&#22686;&#21152;&#20102;&#20845;&#20493;&#12290;&#25105;&#20204;&#23545;&#35813;&#35745;&#21010;&#23548;&#33268;&#30340;&#23398;&#26657;&#25903;&#20986;&#21464;&#21270;&#36827;&#34892;&#20102;&#30028;&#23450;&#65292;&#21457;&#29616;&#21442;&#19982;&#32773;&#33410;&#30465;&#30340;&#37329;&#39069;&#33267;&#23569;&#31561;&#20110;&#20182;&#20204;&#20174;&#32852;&#37030;&#25919;&#24220;&#33719;&#24471;&#30340;"E-rate"&#34917;&#36148;&#24635;&#39069;&#12290;&#22312;&#23545;&#38656;&#27714;&#36827;&#34892;&#24369;&#20551;&#35774;&#30340;&#24773;&#20917;&#19979;&#65292;&#25105;&#20204;&#34920;&#26126;&#21442;&#19982;&#23398;&#26657;&#33719;&#24471;&#20102;&#24040;&#22823;&#30340;&#31119;&#21033;&#25552;&#21319;&#12290;
&lt;/p&gt;
&lt;p&gt;
We evaluate the effects of bundling demand for broadband internet by K-12 schools. In 2014, New Jersey switched from decentralized procurements to a new procurement system that bundled schools into four regional groups. Using an event study approach, we find that, on average, prices for participants decreased by one-third, and broadband speed purchased increased sixfold. We bound the change in school expenditures due to the program and find that participants saved at least as much as their total "E-rate" subsidy from the federal government. Under weak assumptions on demand, we show that participating schools experienced large welfare gains.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#23616;&#37096;&#25237;&#24433;&#27531;&#24046;&#33258;&#21161;&#27861;&#26469;&#26500;&#24314;AR(1)&#27169;&#22411;&#30340;&#33033;&#20914;&#21709;&#24212;&#31995;&#25968;&#30340;&#32622;&#20449;&#21306;&#38388;&#65292;&#24182;&#35777;&#26126;&#20102;&#20854;&#19968;&#33268;&#24615;&#21644;&#28176;&#36817;&#25913;&#36827;&#24615;&#12290;</title><link>http://arxiv.org/abs/2309.01889</link><description>&lt;p&gt;
&#29992;&#20110;AR(1)&#27169;&#22411;&#30340;&#23616;&#37096;&#25237;&#24433;&#27531;&#24046;&#33258;&#21161;&#27861;
&lt;/p&gt;
&lt;p&gt;
The Local Projection Residual Bootstrap for AR(1) Models. (arXiv:2309.01889v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.01889
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#23616;&#37096;&#25237;&#24433;&#27531;&#24046;&#33258;&#21161;&#27861;&#26469;&#26500;&#24314;AR(1)&#27169;&#22411;&#30340;&#33033;&#20914;&#21709;&#24212;&#31995;&#25968;&#30340;&#32622;&#20449;&#21306;&#38388;&#65292;&#24182;&#35777;&#26126;&#20102;&#20854;&#19968;&#33268;&#24615;&#21644;&#28176;&#36817;&#25913;&#36827;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#22312;&#22522;&#20110;&#23616;&#37096;&#25237;&#24433;&#65288;LP&#65289;&#26041;&#27861;&#30340;&#33033;&#20914;&#21709;&#24212;&#31995;&#25968;&#32622;&#20449;&#21306;&#38388;&#26500;&#24314;&#39046;&#22495;&#20570;&#20986;&#20102;&#36129;&#29486;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;LP&#27531;&#24046;&#33258;&#21161;&#27861;&#26469;&#26500;&#24314;AR&#65288;1&#65289;&#27169;&#22411;&#30340;&#33033;&#20914;&#21709;&#24212;&#31995;&#25968;&#30340;&#32622;&#20449;&#21306;&#38388;&#12290;&#35813;&#26041;&#27861;&#20351;&#29992;LP&#26041;&#27861;&#21644;&#27531;&#24046;&#33258;&#21161;&#31243;&#24207;&#26469;&#35745;&#31639;&#20020;&#30028;&#20540;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#20004;&#20010;&#29702;&#35770;&#32467;&#26524;&#12290;&#39318;&#20808;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#22312;&#19968;&#33324;&#26465;&#20214;&#19979;LP&#27531;&#24046;&#33258;&#21161;&#27861;&#30340;&#19968;&#33268;&#24615;&#65292;&#36825;&#24847;&#21619;&#30528;&#25152;&#25552;&#20986;&#30340;&#32622;&#20449;&#21306;&#38388;&#26159;&#19968;&#33268;&#28176;&#36817;&#26377;&#25928;&#30340;&#12290;&#20854;&#27425;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#22312;&#26576;&#20123;&#26465;&#20214;&#19979;LP&#27531;&#24046;&#33258;&#21161;&#27861;&#21487;&#20197;&#25552;&#20379;&#32622;&#20449;&#21306;&#38388;&#30340;&#28176;&#36817;&#25913;&#36827;&#12290;&#25105;&#20204;&#36890;&#36807;&#27169;&#25311;&#30740;&#31350;&#26469;&#35828;&#26126;&#25105;&#20204;&#30340;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper contributes to a growing literature on confidence interval construction for impulse response coefficients based on the local projection (LP) approach. We propose an LP-residual bootstrap method to construct confidence intervals for the impulse response coefficients of AR(1) models. The method uses the LP approach and a residual bootstrap procedure to compute critical values. We present two theoretical results. First, we prove the uniform consistency of the LP-residual bootstrap under general conditions, which implies that the proposed confidence intervals are uniformly asymptotically valid. Second, we show that the LP-residual bootstrap can provide asymptotic refinements to the confidence intervals under certain conditions. We illustrate our results with a simulation study.
&lt;/p&gt;</description></item></channel></rss>