<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#36873;&#25321;&#36319;&#38543;&#31639;&#27861;&#26159;&#21542;&#20256;&#36798;&#26377;&#20851;&#20154;&#31867;&#33021;&#21147;&#30340;&#20449;&#24687;&#26159;&#23548;&#33268;&#31639;&#27861;&#21388;&#24694;&#29616;&#35937;&#30340;&#20851;&#38190;&#22240;&#32032;&#65292;&#36825;&#31181;&#29616;&#35937;&#34987;&#31216;&#20026;&#8220;&#31639;&#27861;&#21388;&#24694;&#8221;&#12290;</title><link>https://arxiv.org/abs/2402.15418</link><description>&lt;p&gt;
&#22768;&#35465;&#31639;&#27861;&#21388;&#24694;
&lt;/p&gt;
&lt;p&gt;
Reputational Algorithm Aversion
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.15418
&lt;/p&gt;
&lt;p&gt;
&#36873;&#25321;&#36319;&#38543;&#31639;&#27861;&#26159;&#21542;&#20256;&#36798;&#26377;&#20851;&#20154;&#31867;&#33021;&#21147;&#30340;&#20449;&#24687;&#26159;&#23548;&#33268;&#31639;&#27861;&#21388;&#24694;&#29616;&#35937;&#30340;&#20851;&#38190;&#22240;&#32032;&#65292;&#36825;&#31181;&#29616;&#35937;&#34987;&#31216;&#20026;&#8220;&#31639;&#27861;&#21388;&#24694;&#8221;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20154;&#20204;&#24120;&#24120;&#19981;&#24895;&#23558;&#31639;&#27861;&#20135;&#29983;&#30340;&#20449;&#24687;&#32435;&#20837;&#33258;&#24049;&#30340;&#20915;&#31574;&#20013;&#65292;&#36825;&#31181;&#29616;&#35937;&#34987;&#31216;&#20026;&#8220;&#31639;&#27861;&#21388;&#24694;&#8221;&#12290;&#26412;&#25991;&#23637;&#31034;&#20102;&#31639;&#27861;&#21388;&#24694;&#26159;&#22914;&#20309;&#20135;&#29983;&#30340;&#65292;&#24403;&#36873;&#25321;&#36319;&#38543;&#31639;&#27861;&#20256;&#36798;&#26377;&#20851;&#20154;&#31867;&#33021;&#21147;&#30340;&#20449;&#24687;&#26102;&#12290;&#25105;&#24314;&#31435;&#20102;&#19968;&#20010;&#27169;&#22411;&#65292;&#20854;&#20013;&#24037;&#20316;&#32773;&#26681;&#25454;&#33258;&#24049;&#30340;&#31169;&#20154;&#20449;&#24687;&#21644;&#31639;&#27861;&#30340;&#20449;&#21495;&#23545;&#38543;&#26426;&#32467;&#26524;&#36827;&#34892;&#39044;&#27979;&#12290;&#20302;&#25216;&#33021;&#24037;&#20316;&#32773;&#25509;&#25910;&#21040;&#27604;&#31639;&#27861;&#26356;&#24046;&#30340;&#20449;&#24687;&#65292;&#22240;&#27492;&#24212;&#22987;&#32456;&#36981;&#24490;&#31639;&#27861;&#30340;&#20449;&#21495;&#65292;&#32780;&#39640;&#25216;&#33021;&#24037;&#20316;&#32773;&#25509;&#25910;&#21040;&#27604;&#31639;&#27861;&#26356;&#22909;&#30340;&#20449;&#24687;&#65292;&#22240;&#27492;&#26377;&#26102;&#24212;&#35813;&#35206;&#30422;&#31639;&#27861;&#30340;&#20915;&#31574;&#12290;&#28982;&#32780;&#65292;&#30001;&#20110;&#22768;&#35465;&#19978;&#30340;&#32771;&#34385;&#65292;&#20302;&#25216;&#33021;&#24037;&#20316;&#32773;&#20250;&#19981;&#21512;&#29702;&#22320;&#35206;&#30422;&#31639;&#27861;&#65292;&#20197;&#22686;&#21152;&#34987;&#35270;&#20026;&#39640;&#25216;&#33021;&#30340;&#21487;&#33021;&#24615;&#12290;&#35813;&#27169;&#22411;&#20026;&#19982;AI&#31995;&#32479;&#21487;&#33021;&#20250;&#21462;&#20195;&#35768;&#22810;&#31867;&#22411;&#30340;&#24037;&#20316;&#32773;&#30340;&#24191;&#27867;&#20851;&#27880;&#25552;&#20379;&#20102;&#23436;&#20840;&#29702;&#24615;&#30340;&#24494;&#35266;&#22522;&#30784;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.15418v1 Announce Type: cross  Abstract: People are often reluctant to incorporate information produced by algorithms into their decisions, a phenomenon called "algorithm aversion". This paper shows how algorithm aversion arises when the choice to follow an algorithm conveys information about a human's ability. I develop a model in which workers make forecasts of a random outcome based on their own private information and an algorithm's signal. Low-skill workers receive worse information than the algorithm and hence should always follow the algorithm's signal, while high-skill workers receive better information than the algorithm and should sometimes override it. However, due to reputational concerns, low-skill workers inefficiently override the algorithm to increase the likelihood they are perceived as high-skill. The model provides a fully rational microfoundation for algorithm aversion that aligns with the broad concern that AI systems will displace many types of workers.
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#25506;&#35752;&#20102;&#22914;&#20309;&#23450;&#20041;&#12289;&#37327;&#21270;&#21644;&#27604;&#36739;&#21487;&#21464;&#21487;&#20877;&#29983;&#33021;&#28304;&#30701;&#32570;&#20107;&#20214;&#65292;&#35752;&#35770;&#20102;&#19981;&#21516;&#26041;&#27861;&#30340;&#20248;&#32570;&#28857;&#65292;&#24182;&#25552;&#20986;&#20102;&#36827;&#19968;&#27493;&#30340;&#30740;&#31350;&#26041;&#27861;&#12290;</title><link>https://arxiv.org/abs/2402.06758</link><description>&lt;p&gt;
&#27979;&#37327;Dunkelflaute&#65306;&#22914;&#20309;&#65288;&#19981;&#65289;&#20998;&#26512;&#21487;&#21464;&#21487;&#20877;&#29983;&#33021;&#28304;&#30701;&#32570;
&lt;/p&gt;
&lt;p&gt;
Measuring the Dunkelflaute: How (not) to analyze variable renewable energy shortage
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.06758
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25506;&#35752;&#20102;&#22914;&#20309;&#23450;&#20041;&#12289;&#37327;&#21270;&#21644;&#27604;&#36739;&#21487;&#21464;&#21487;&#20877;&#29983;&#33021;&#28304;&#30701;&#32570;&#20107;&#20214;&#65292;&#35752;&#35770;&#20102;&#19981;&#21516;&#26041;&#27861;&#30340;&#20248;&#32570;&#28857;&#65292;&#24182;&#25552;&#20986;&#20102;&#36827;&#19968;&#27493;&#30340;&#30740;&#31350;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38543;&#30528;&#21487;&#21464;&#21487;&#20877;&#29983;&#33021;&#28304;&#22312;&#20840;&#29699;&#33021;&#28304;&#31995;&#32479;&#20013;&#30340;&#37325;&#35201;&#24615;&#26085;&#30410;&#22686;&#21152;&#65292;&#20154;&#20204;&#23545;&#20110;&#20102;&#35299;&#21487;&#21464;&#21487;&#20877;&#29983;&#33021;&#28304;&#30701;&#32570;&#65288;&#8220;Dunkelflauten&#8221;&#65289;&#26102;&#26399;&#30340;&#20852;&#36259;&#20063;&#36234;&#26469;&#36234;&#22823;&#12290;&#22312;&#19981;&#21516;&#30340;&#21487;&#20877;&#29983;&#33021;&#28304;&#21457;&#30005;&#25216;&#26415;&#21644;&#22320;&#28857;&#20043;&#38388;&#23450;&#20041;&#12289;&#37327;&#21270;&#21644;&#27604;&#36739;&#36825;&#31181;&#30701;&#32570;&#20107;&#20214;&#65292;&#26159;&#19968;&#20010;&#38750;&#24120;&#22797;&#26434;&#30340;&#25361;&#25112;&#12290;&#19981;&#21516;&#25991;&#29486;&#20013;&#23384;&#22312;&#30528;&#21508;&#31181;&#26041;&#27861;&#65292;&#22914;&#27700;&#25991;&#23398;&#12289;&#39118;&#33021;&#21644;&#22826;&#38451;&#33021;&#20998;&#26512;&#65292;&#25110;&#33021;&#28304;&#31995;&#32479;&#24314;&#27169;&#12290;&#20808;&#21069;&#20998;&#26512;&#30340;&#30740;&#31350;&#23545;&#35937;&#33539;&#22260;&#20174;&#29305;&#23450;&#20301;&#32622;&#30340;&#21333;&#19968;&#25216;&#26415;&#21040;&#22810;&#20010;&#22320;&#21306;&#30340;&#22810;&#26679;&#21270;&#25216;&#26415;&#32452;&#21512;&#65292;&#35201;&#20040;&#20851;&#27880;&#21487;&#21464;&#21487;&#20877;&#29983;&#33021;&#28304;&#30340;&#20379;&#24212;&#65292;&#35201;&#20040;&#20851;&#27880;&#20854;&#19982;&#30005;&#21147;&#38656;&#27714;&#30340;&#19981;&#21305;&#37197;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#19968;&#31181;&#37327;&#21270;&#21487;&#21464;&#21487;&#20877;&#29983;&#33021;&#28304;&#30701;&#32570;&#30340;&#26041;&#27861;&#27010;&#36848;&#12290;&#25105;&#20204;&#35299;&#37322;&#24182;&#25209;&#21028;&#24615;&#22320;&#35752;&#35770;&#20102;&#19981;&#21516;&#26041;&#27861;&#22312;&#23450;&#20041;&#21644;&#35782;&#21035;&#30701;&#32570;&#20107;&#20214;&#26041;&#38754;&#30340;&#20248;&#28857;&#21644;&#25361;&#25112;&#65292;&#24182;&#25552;&#20986;&#20102;&#36827;&#19968;&#27493;&#30340;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
As variable renewable energy sources increasingly gain importance in global energy systems, there is a growing interest in understanding periods of variable renewable energy shortage (``Dunkelflauten''). Defining, quantifying, and comparing such shortage events across different renewable generation technologies and locations presents a surprisingly intricate challenge. Various approaches exist in different bodies of literature, such as hydrology, wind and solar energy analysis, or energy system modeling. The subject of interest in previous analyses ranges from single technologies in specific locations to diverse technology portfolios across multiple regions, focusing either on supply from variable renewables or its mismatch with electricity demand. We provide an overview of methods for quantifying variable renewable energy shortage. We explain and critically discuss the merits and challenges of different approaches for defining and identifying shortage events and propose further method
&lt;/p&gt;</description></item><item><title>&#36825;&#39033;&#24037;&#20316;&#25506;&#32034;&#20102;&#19968;&#31181;&#26080;&#27169;&#22411;&#26041;&#27861;GARHCX-NoVaS&#65292;&#23558;&#22806;&#29983;&#21464;&#37327;&#24341;&#20837;&#39044;&#27979;&#36807;&#31243;&#65292;&#25552;&#39640;&#24066;&#22330;&#27874;&#21160;&#29575;&#30340;&#39044;&#27979;&#20934;&#30830;&#24615;&#12290;&#27169;&#25311;&#30740;&#31350;&#35777;&#23454;&#20102;NoVaS&#30340;&#20248;&#36234;&#24615;&#12290;</title><link>http://arxiv.org/abs/2308.13346</link><description>&lt;p&gt;
GARHCX-NoVaS&#65306;&#19968;&#31181;&#26080;&#27169;&#22411;&#26041;&#27861;&#29992;&#20110;&#24341;&#20837;&#22806;&#29983;&#21464;&#37327;
&lt;/p&gt;
&lt;p&gt;
GARHCX-NoVaS: A Model-free Approach to Incorporate Exogenous Variables. (arXiv:2308.13346v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.13346
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#24037;&#20316;&#25506;&#32034;&#20102;&#19968;&#31181;&#26080;&#27169;&#22411;&#26041;&#27861;GARHCX-NoVaS&#65292;&#23558;&#22806;&#29983;&#21464;&#37327;&#24341;&#20837;&#39044;&#27979;&#36807;&#31243;&#65292;&#25552;&#39640;&#24066;&#22330;&#27874;&#21160;&#29575;&#30340;&#39044;&#27979;&#20934;&#30830;&#24615;&#12290;&#27169;&#25311;&#30740;&#31350;&#35777;&#23454;&#20102;NoVaS&#30340;&#20248;&#36234;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#36827;&#19968;&#27493;&#25506;&#35752;&#20102;&#26368;&#36817;&#25552;&#20986;&#30340;&#27491;&#24577;&#21270;&#21644;&#26041;&#24046;&#31283;&#23450;&#65288;NoVaS&#65289;&#36716;&#21270;&#22312;&#21253;&#21547;&#22806;&#29983;&#21464;&#37327;&#21518;&#30340;&#39044;&#27979;&#33021;&#21147;&#12290;&#22312;&#23454;&#36341;&#20013;&#65292;&#23588;&#20854;&#26159;&#22312;&#37329;&#34701;&#35745;&#37327;&#32463;&#27982;&#23398;&#39046;&#22495;&#65292;&#22914;&#26524;&#23558;&#22522;&#26412;&#38754;&#21644;&#24773;&#32490;&#31561;&#39069;&#22806;&#30693;&#35782;&#32435;&#20837;&#39044;&#27979;&#36807;&#31243;&#20013;&#65292;&#21487;&#33021;&#26377;&#21161;&#20110;&#25552;&#39640;&#24066;&#22330;&#27874;&#21160;&#29575;&#30340;&#39044;&#27979;&#20934;&#30830;&#24615;&#12290;&#22312;&#32463;&#20856;&#26041;&#27861;&#20013;&#65292;&#20154;&#20204;&#36890;&#24120;&#24212;&#29992;GARCHX&#22411;&#26041;&#27861;&#26469;&#21253;&#25324;&#22806;&#29983;&#21464;&#37327;&#12290;&#20316;&#20026;&#19968;&#31181;&#26080;&#27169;&#22411;&#39044;&#27979;&#26041;&#27861;&#65292;&#24050;&#32463;&#35777;&#26126;NoVaS&#27604;&#32463;&#20856;&#30340;GARCHX&#22411;&#26041;&#27861;&#26356;&#20934;&#30830;&#12289;&#26356;&#31283;&#23450;&#12290;&#25105;&#20204;&#20851;&#27880;&#30340;&#26159;&#22312;&#32771;&#34385;&#22806;&#29983;&#21327;&#21464;&#37327;&#21518;&#65292;&#26032;&#39062;&#30340;NoVaS&#26041;&#27861;&#26159;&#21542;&#20173;&#28982;&#20445;&#25345;&#20854;&#20248;&#21183;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#22522;&#20110;GARCHX&#27169;&#22411;&#30340;NoVaS&#36716;&#25442;&#65292;&#24182;&#22768;&#26126;&#20102;&#21253;&#21547;&#22806;&#29983;&#21464;&#37327;&#30340;&#30456;&#24212;&#39044;&#27979;&#36807;&#31243;&#12290;&#21516;&#26102;&#65292;&#27169;&#25311;&#30740;&#31350;&#39564;&#35777;&#20102;NoVaS&#30340;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this work, we further explore the forecasting ability of a recently proposed normalizing and variance-stabilizing (NoVaS) transformation after wrapping exogenous variables. In practice, especially in the area of financial econometrics, extra knowledge such as fundamentals- and sentiments-based information could be beneficial to improve the prediction accuracy of market volatility if they are incorporated into the forecasting process. In a classical approach, people usually apply GARCHX-type methods to include the exogenous variables. Being a Model-free prediction method, NoVaS has been shown to be more accurate and stable than classical GARCH-type methods. We are interested in whether the novel NoVaS method can also sustain its superiority after exogenous covariates are taken into account. We provide the NoVaS transformation based on GARCHX model and then claim the corresponding prediction procedure with exogenous variables existing. Also, simulation studies verify that the NoVaS me
&lt;/p&gt;</description></item></channel></rss>