<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#26412;&#25991;&#22312;&#35780;&#20272;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#30340;&#32463;&#27982;&#21512;&#29702;&#24615;&#26041;&#38754;&#25552;&#20986;&#20102;&#19968;&#31181;&#26041;&#27861;&#65292;&#36890;&#36807;&#37327;&#21270;&#35780;&#20998;&#27169;&#22411;&#22312;&#21508;&#20010;&#35201;&#32032;&#19978;&#30340;&#34920;&#29616;&#24182;&#32467;&#21512;&#29992;&#25143;&#25552;&#20379;&#30340;&#35780;&#20998;&#26631;&#20934;&#65292;&#29983;&#25104;&#19968;&#20221;"&#29702;&#24615;&#25253;&#21578;&#21345;"&#65292;&#20197;&#30830;&#23450;&#20195;&#29702;&#20154;&#26159;&#21542;&#36275;&#22815;&#21487;&#38752;&#12290;</title><link>https://arxiv.org/abs/2402.09552</link><description>&lt;p&gt;
&#29702;&#24615;&#25253;&#21578;&#21345;&#65306;&#35780;&#20272;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#30340;&#32463;&#27982;&#21512;&#29702;&#24615;
&lt;/p&gt;
&lt;p&gt;
Rationality Report Cards: Assessing the Economic Rationality of Large Language Models
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.09552
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#22312;&#35780;&#20272;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#30340;&#32463;&#27982;&#21512;&#29702;&#24615;&#26041;&#38754;&#25552;&#20986;&#20102;&#19968;&#31181;&#26041;&#27861;&#65292;&#36890;&#36807;&#37327;&#21270;&#35780;&#20998;&#27169;&#22411;&#22312;&#21508;&#20010;&#35201;&#32032;&#19978;&#30340;&#34920;&#29616;&#24182;&#32467;&#21512;&#29992;&#25143;&#25552;&#20379;&#30340;&#35780;&#20998;&#26631;&#20934;&#65292;&#29983;&#25104;&#19968;&#20221;"&#29702;&#24615;&#25253;&#21578;&#21345;"&#65292;&#20197;&#30830;&#23450;&#20195;&#29702;&#20154;&#26159;&#21542;&#36275;&#22815;&#21487;&#38752;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36234;&#26469;&#36234;&#22810;&#30340;&#20154;&#23545;&#23558;LLM&#29992;&#20316;&#20915;&#31574;"&#20195;&#29702;&#20154;"&#20852;&#36259;&#26085;&#30410;&#22686;&#21152;&#12290;&#36825;&#21253;&#25324;&#24456;&#22810;&#33258;&#30001;&#24230;&#65306;&#24212;&#35813;&#20351;&#29992;&#21738;&#20010;&#27169;&#22411;&#65307;&#22914;&#20309;&#36827;&#34892;&#25552;&#31034;&#65307;&#26159;&#21542;&#35201;&#27714;&#20854;&#36827;&#34892;&#20869;&#30465;&#12289;&#36827;&#34892;&#24605;&#32771;&#38142;&#31561;&#12290;&#35299;&#20915;&#36825;&#20123;&#38382;&#39064;&#65288;&#26356;&#24191;&#27867;&#22320;&#35828;&#65292;&#30830;&#23450;LLM&#20195;&#29702;&#20154;&#26159;&#21542;&#36275;&#22815;&#21487;&#38752;&#20197;&#20415;&#33719;&#24471;&#20449;&#20219;&#65289;&#38656;&#35201;&#19968;&#31181;&#35780;&#20272;&#36825;&#31181;&#20195;&#29702;&#20154;&#32463;&#27982;&#21512;&#29702;&#24615;&#30340;&#26041;&#27861;&#35770;&#65292;&#22312;&#26412;&#25991;&#20013;&#25105;&#20204;&#25552;&#20379;&#20102;&#19968;&#20010;&#26041;&#27861;&#12290;&#25105;&#20204;&#39318;&#20808;&#23545;&#29702;&#24615;&#20915;&#31574;&#30340;&#32463;&#27982;&#25991;&#29486;&#36827;&#34892;&#20102;&#35843;&#30740;&#12289;&#23558;&#20195;&#29702;&#20154;&#24212;&#35813;&#23637;&#29616;&#30340;&#22823;&#37327;&#32454;&#31890;&#24230;"&#35201;&#32032;"&#36827;&#34892;&#20998;&#31867;&#65292;&#24182;&#30830;&#23450;&#20102;&#23427;&#20204;&#20043;&#38388;&#30340;&#20381;&#36182;&#20851;&#31995;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#22522;&#20934;&#20998;&#24067;&#65292;&#20197;&#23450;&#37327;&#35780;&#20998;LLM&#22312;&#36825;&#20123;&#35201;&#32032;&#19978;&#30340;&#34920;&#29616;&#65292;&#24182;&#32467;&#21512;&#29992;&#25143;&#25552;&#20379;&#30340;&#35780;&#20998;&#26631;&#20934;&#65292;&#29983;&#25104;&#19968;&#20221;"&#29702;&#24615;&#25253;&#21578;&#21345;"&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#25551;&#36848;&#20102;&#19982;14&#31181;&#19981;&#21516;&#30340;LLM&#36827;&#34892;&#30340;&#22823;&#35268;&#27169;&#23454;&#35777;&#23454;&#39564;&#30340;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.09552v1 Announce Type: new  Abstract: There is increasing interest in using LLMs as decision-making "agents." Doing so includes many degrees of freedom: which model should be used; how should it be prompted; should it be asked to introspect, conduct chain-of-thought reasoning, etc? Settling these questions -- and more broadly, determining whether an LLM agent is reliable enough to be trusted -- requires a methodology for assessing such an agent's economic rationality. In this paper, we provide one. We begin by surveying the economic literature on rational decision making, taxonomizing a large set of fine-grained "elements" that an agent should exhibit, along with dependencies between them. We then propose a benchmark distribution that quantitatively scores an LLMs performance on these elements and, combined with a user-provided rubric, produces a "rationality report card." Finally, we describe the results of a large-scale empirical experiment with 14 different LLMs, characte
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#25414;&#32465;&#21830;&#21697;&#34917;&#36148;&#30340;&#23398;&#20064;&#25928;&#24212;&#65292;&#21457;&#29616;&#19968;&#27425;&#24615;&#34917;&#36148;&#25414;&#32465;&#21830;&#21697;&#26082;&#26377;&#30452;&#25509;&#20215;&#26684;&#25928;&#24212;&#65292;&#20063;&#26377;&#38388;&#25509;&#23398;&#20064;&#21160;&#26426;&#65292;&#21487;&#20197;&#36890;&#36807;&#22686;&#21152;&#20449;&#24687;&#36951;&#20135;&#26469;&#24341;&#36215;&#38271;&#26399;&#38656;&#27714;&#21464;&#21270;&#12290;</title><link>http://arxiv.org/abs/2311.01217</link><description>&lt;p&gt;
&#25414;&#32465;&#21830;&#21697;&#34917;&#36148;&#30340;&#23398;&#20064;&#25928;&#24212;&#65306;&#21322;&#21442;&#25968;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
The learning effects of subsidies to bundled goods: a semiparametric approach. (arXiv:2311.01217v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2311.01217
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#25414;&#32465;&#21830;&#21697;&#34917;&#36148;&#30340;&#23398;&#20064;&#25928;&#24212;&#65292;&#21457;&#29616;&#19968;&#27425;&#24615;&#34917;&#36148;&#25414;&#32465;&#21830;&#21697;&#26082;&#26377;&#30452;&#25509;&#20215;&#26684;&#25928;&#24212;&#65292;&#20063;&#26377;&#38388;&#25509;&#23398;&#20064;&#21160;&#26426;&#65292;&#21487;&#20197;&#36890;&#36807;&#22686;&#21152;&#20449;&#24687;&#36951;&#20135;&#26469;&#24341;&#36215;&#38271;&#26399;&#38656;&#27714;&#21464;&#21270;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20020;&#26102;&#34917;&#36148;&#25414;&#32465;&#21830;&#21697;&#26159;&#21542;&#33021;&#22815;&#36890;&#36807;&#23398;&#20064;&#20854;&#20013;&#19968;&#31181;&#21830;&#21697;&#30340;&#30456;&#23545;&#36136;&#37327;&#26469;&#24341;&#36215;&#38271;&#26399;&#38656;&#27714;&#21464;&#21270;&#65311;&#26412;&#25991;&#20174;&#29702;&#35770;&#21644;&#23454;&#35777;&#35282;&#24230;&#25552;&#20379;&#20102;&#20851;&#20110;&#27492;&#26426;&#21046;&#30340;&#35777;&#25454;&#12290;&#22312;&#29702;&#35770;&#19978;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#20010;&#27169;&#22411;&#65292;&#20195;&#29702;&#20154;&#36890;&#36807;&#28040;&#36153;&#26469;&#23398;&#20064;&#24517;&#38656;&#21697;&#21019;&#26032;&#30340;&#36136;&#37327;&#12290;&#25105;&#20204;&#30340;&#32467;&#26524;&#26174;&#31034;&#65292;&#23545;&#21253;&#21547;&#35813;&#21019;&#26032;&#30340;&#25414;&#32465;&#21830;&#21697;&#36827;&#34892;&#19968;&#27425;&#24615;&#34917;&#36148;&#30340;&#21363;&#26102;&#25928;&#24212;&#21487;&#20197;&#20998;&#35299;&#20026;&#30452;&#25509;&#20215;&#26684;&#25928;&#24212;&#21644;&#38388;&#25509;&#23398;&#20064;&#21160;&#26426;&#65292;&#20195;&#29702;&#20154;&#21033;&#29992;&#25240;&#25187;&#22686;&#21152;&#20449;&#24687;&#36951;&#20135;&#30041;&#32473;&#26410;&#26469;&#30340;&#33258;&#24049;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#22312;&#19968;&#20010;&#38543;&#26426;&#23454;&#39564;&#20013;&#35780;&#20272;&#20102;&#25105;&#20204;&#29702;&#35770;&#30340;&#39044;&#27979;&#65292;&#35813;&#23454;&#39564;&#22312;&#19968;&#20010;&#25340;&#36710;&#24179;&#21488;&#19978;&#20026;&#19982;&#28779;&#36710;&#25110;&#22320;&#38081;&#31449;&#25972;&#21512;&#30340;&#27773;&#36710;&#34892;&#31243;&#25552;&#20379;&#20102;&#20004;&#21608;&#30340;&#25240;&#25187;&#12290;&#32771;&#34385;&#21040;&#25105;&#20204;&#25968;&#25454;&#30340;&#37325;&#23614;&#29305;&#24615;&#65292;&#25105;&#20204;&#36981;&#24490;Athey&#65288;2023&#65289;&#30340;&#26041;&#27861;&#65292;&#24182;&#22522;&#20110;&#25105;&#20204;&#30340;&#29702;&#35770;&#25552;&#20986;&#20102;&#19968;&#20010;&#21322;&#21442;&#25968;&#27169;&#22411;&#12290;
&lt;/p&gt;
&lt;p&gt;
Can temporary subsidies to bundles induce long-run changes in demand due to learning about the relative quality of one of its constituent goods? This paper provides theoretical and experimental evidence on the role of this mechanism. Theoretically, we introduce a model where an agent learns about the quality of an innovation on an essential good through consumption. Our results show that the contemporaneous effect of a one-off subsidy to a bundle that contains the innovation may be decomposed into a direct price effect, and an indirect learning motive, whereby an agent leverages the discount to increase the informational bequest left to her future selves. We then assess the predictions of our theory in a randomised experiment in a ridesharing platform. The experiment provided two-week discounts for car trips integrating with a train or metro station (a bundle). Given the heavy-tailed nature of our data, we follow \cite{Athey2023} and, motivated by our theory, propose a semiparametric m
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#37325;&#26032;&#32771;&#34385;&#20102;&#37096;&#20998;&#35782;&#21035;&#27169;&#22411;&#20272;&#35745;&#20013;&#30340;&#26368;&#20248;&#24615;&#27010;&#24565;&#65292;&#24182;&#25552;&#20986;&#20102;&#22312;&#25152;&#26377;&#35774;&#35745;&#20013;&#25910;&#25947;&#20110;&#35782;&#21035;&#21306;&#22495;&#30340;&#26367;&#20195;&#26041;&#27861;&#12290;</title><link>http://arxiv.org/abs/2310.02414</link><description>&lt;p&gt;
&#20851;&#20110;&#37096;&#20998;&#35782;&#21035;&#20108;&#39033;&#36873;&#25321;&#27169;&#22411;&#30340;&#26368;&#20248;&#38598;&#20272;&#35745;
&lt;/p&gt;
&lt;p&gt;
On Optimal Set Estimation for Partially Identified Binary Choice Models. (arXiv:2310.02414v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.02414
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#37325;&#26032;&#32771;&#34385;&#20102;&#37096;&#20998;&#35782;&#21035;&#27169;&#22411;&#20272;&#35745;&#20013;&#30340;&#26368;&#20248;&#24615;&#27010;&#24565;&#65292;&#24182;&#25552;&#20986;&#20102;&#22312;&#25152;&#26377;&#35774;&#35745;&#20013;&#25910;&#25947;&#20110;&#35782;&#21035;&#21306;&#22495;&#30340;&#26367;&#20195;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#37325;&#26032;&#32771;&#34385;&#20102;&#37096;&#20998;&#35782;&#21035;&#27169;&#22411;&#20272;&#35745;&#20013;&#30340;&#26368;&#20248;&#24615;&#27010;&#24565;&#12290;&#25105;&#20204;&#20197;&#21322;&#21442;&#25968;&#20108;&#39033;&#36873;&#25321;&#27169;&#22411;&#20026;&#20363;&#65292;&#20197;&#31163;&#25955;&#21327;&#21464;&#37327;&#20316;&#20026;&#31034;&#20363;&#65292;&#35828;&#26126;&#20102;&#19968;&#33324;&#38382;&#39064;&#12290;&#35813;&#27169;&#22411;&#22312;&#19968;&#23450;&#31243;&#24230;&#19978;&#26159;&#37096;&#20998;&#35782;&#21035;&#30340;&#65292;&#20363;&#22914;Bierens&#21644;Hartog&#65288;1988&#65289;&#25152;&#31034;&#12290;&#36890;&#36807;&#23454;&#26045;Manski&#65288;1975&#65289;&#25552;&#20986;&#30340;&#26368;&#22823;&#20998;&#25968;&#31243;&#24207;&#65292;&#21487;&#20197;&#26500;&#24314;&#27169;&#22411;&#20013;&#22238;&#24402;&#31995;&#25968;&#30340;&#38598;&#21512;&#20272;&#35745;&#12290;&#23545;&#20110;&#35768;&#22810;&#35774;&#35745;&#65292;&#35813;&#26041;&#27861;&#25910;&#25947;&#20110;&#36825;&#20123;&#21442;&#25968;&#30340;&#35782;&#21035;&#38598;&#65292;&#22240;&#27492;&#22312;&#26576;&#31181;&#24847;&#20041;&#19978;&#26159;&#26368;&#20248;&#30340;&#12290;&#20294;&#26159;&#65292;&#27491;&#22914;Komarova&#65288;2013&#65289;&#25152;&#31034;&#65292;&#23545;&#20110;&#20854;&#20182;&#24773;&#20917;&#65292;&#26368;&#22823;&#20998;&#25968;&#30446;&#26631;&#20989;&#25968;&#32473;&#20986;&#20102;&#35782;&#21035;&#38598;&#30340;&#36793;&#30028;&#21306;&#22495;&#12290;&#36825;&#28608;&#21457;&#20102;&#23547;&#27714;&#20854;&#20182;&#20248;&#21270;&#26041;&#27861;&#30340;&#21160;&#21147;&#65292;&#36825;&#20123;&#26041;&#27861;&#22312;&#25152;&#26377;&#35774;&#35745;&#20013;&#37117;&#25910;&#25947;&#20110;&#35782;&#21035;&#21306;&#22495;&#65292;&#24182;&#19988;&#25105;&#20204;&#25552;&#20986;&#24182;&#27604;&#36739;&#20102;&#36825;&#20123;&#26041;&#27861;&#12290;&#19968;&#20010;&#26159;Hodges&#31867;&#22411;&#30340;&#20272;&#35745;&#22120;&#65292;&#23558;&#26368;&#22823;&#20998;&#25968;&#20272;&#35745;&#22120;&#19982;&#29616;&#26377;&#31243;&#24207;&#30456;&#32467;&#21512;&#12290;&#31532;&#20108;&#20010;&#26159;&#20004;&#27493;&#27861;
&lt;/p&gt;
&lt;p&gt;
In this paper we reconsider the notion of optimality in estimation of partially identified models. We illustrate the general problem in the context of a semiparametric binary choice model with discrete covariates as an example of a model which is partially identified as shown in, e.g. Bierens and Hartog (1988). A set estimator for the regression coefficients in the model can be constructed by implementing the Maximum Score procedure proposed by Manski (1975). For many designs this procedure converges to the identified set for these parameters, and so in one sense is optimal. But as shown in Komarova (2013) for other cases the Maximum Score objective function gives an outer region of the identified set. This motivates alternative methods that are optimal in one sense that they converge to the identified region in all designs, and we propose and compare such procedures. One is a Hodges type estimator combining the Maximum Score estimator with existing procedures. A second is a two step e
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20379;&#20102;&#37329;&#34701;&#24066;&#22330;&#26032;&#23450;&#20041;&#30340;&#35777;&#26126;&#65292;&#36890;&#36807;&#26500;&#36896;&#23450;&#29702;&#26469;&#30830;&#23450;&#26032;&#23450;&#20041;&#20013;&#30340;&#25928;&#29992;&#26354;&#32447;&#24418;&#29366;&#12290;&#19982;&#26631;&#20934;&#29702;&#35770;&#19981;&#21516;&#65292;&#26032;&#23450;&#20041;&#20013;&#20986;&#29616;&#20102;&#20005;&#26684;&#20985;&#24615;&#12289;&#20005;&#26684;&#20984;&#24615;&#25110;&#32447;&#24615;&#30340;&#24773;&#20917;&#12290;</title><link>http://arxiv.org/abs/2309.03003</link><description>&lt;p&gt;
&#37329;&#34701;&#24066;&#22330;&#26032;&#23450;&#20041;&#30340;&#35777;&#26126;
&lt;/p&gt;
&lt;p&gt;
Proofs for the New Definitions in Financial Markets. (arXiv:2309.03003v1 [q-fin.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.03003
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20379;&#20102;&#37329;&#34701;&#24066;&#22330;&#26032;&#23450;&#20041;&#30340;&#35777;&#26126;&#65292;&#36890;&#36807;&#26500;&#36896;&#23450;&#29702;&#26469;&#30830;&#23450;&#26032;&#23450;&#20041;&#20013;&#30340;&#25928;&#29992;&#26354;&#32447;&#24418;&#29366;&#12290;&#19982;&#26631;&#20934;&#29702;&#35770;&#19981;&#21516;&#65292;&#26032;&#23450;&#20041;&#20013;&#20986;&#29616;&#20102;&#20005;&#26684;&#20985;&#24615;&#12289;&#20005;&#26684;&#20984;&#24615;&#25110;&#32447;&#24615;&#30340;&#24773;&#20917;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26500;&#36896;&#23450;&#29702;&#21487;&#20197;&#24110;&#21161;&#30830;&#23450;&#37329;&#34701;&#24066;&#22330;&#26032;&#23450;&#20041;&#20013;&#26500;&#25104;&#30340;&#26576;&#20123;&#25928;&#29992;&#26354;&#32447;&#30340;&#24418;&#29366;&#12290;&#26412;&#30740;&#31350;&#26088;&#22312;&#20026;&#36825;&#20123;&#23450;&#29702;&#25552;&#20379;&#35777;&#26126;&#12290;&#23613;&#31649;&#39118;&#38505;&#21388;&#24694;&#12289;&#39118;&#38505;&#29233;&#22909;&#21644;&#39118;&#38505;&#20013;&#24615;&#31561;&#26415;&#35821;&#22312;&#26631;&#20934;&#29702;&#35770;&#20013;&#20998;&#21035;&#31561;&#21516;&#20110;&#20005;&#26684;&#20985;&#24615;&#12289;&#20005;&#26684;&#20984;&#24615;&#21644;&#32447;&#24615;&#65292;&#20294;&#26576;&#20123;&#26032;&#23450;&#20041;&#28385;&#36275;&#20005;&#26684;&#20985;&#24615;&#25110;&#20005;&#26684;&#20984;&#24615;&#65292;&#25110;&#32447;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Constructing theorems can help to determine the shape of certain utility curves that make up the new definitions in financial markets. The aim of this study was to present proofs for these theorems. Although the terms of risk-averse, risk-loving, and risk-neutral are equivalent to strict concavity, strict convexity, and linearity, respectively, in standard theory, certain new definitions satisfy strict concavity or strict convexity, or linearity.
&lt;/p&gt;</description></item><item><title>&#30740;&#31350;&#35777;&#23454;&#20102;&#26032;&#30340;&#37329;&#34701;&#24066;&#22330;&#23450;&#20041;&#20934;&#30830;&#21453;&#26144;&#20102;&#25237;&#36164;&#32773;&#34892;&#20026;&#65292;&#24182;&#25552;&#20379;&#20102;&#25237;&#36164;&#31574;&#30053;&#26041;&#38754;&#30340;&#24314;&#35758;&#12290;</title><link>http://arxiv.org/abs/2305.03468</link><description>&lt;p&gt;
&#37329;&#34701;&#24066;&#22330;&#26032;&#23450;&#20041;&#30340;&#32463;&#39564;&#35777;&#25454;
&lt;/p&gt;
&lt;p&gt;
Empirical Evidence for the New Definitions in Financial Markets. (arXiv:2305.03468v1 [q-fin.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.03468
&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#35777;&#23454;&#20102;&#26032;&#30340;&#37329;&#34701;&#24066;&#22330;&#23450;&#20041;&#20934;&#30830;&#21453;&#26144;&#20102;&#25237;&#36164;&#32773;&#34892;&#20026;&#65292;&#24182;&#25552;&#20379;&#20102;&#25237;&#36164;&#31574;&#30053;&#26041;&#38754;&#30340;&#24314;&#35758;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#32473;&#20986;&#20102;&#25903;&#25345;&#37329;&#34701;&#24066;&#22330;&#26032;&#23450;&#20041;&#30340;&#32463;&#39564;&#35777;&#25454;&#12290;&#20998;&#26512;&#20102;1889-1978&#24180;&#32654;&#22269;&#37329;&#34701;&#24066;&#22330;&#25237;&#36164;&#32773;&#30340;&#39118;&#38505;&#24577;&#24230;&#65292;&#32467;&#26524;&#34920;&#26126;&#65292;1977&#24180;&#22312;&#25237;&#36164;&#32508;&#21512;S&#65286;P 500&#25351;&#25968;&#30340;&#32929;&#31080;&#25237;&#36164;&#32773;&#26159;&#39118;&#38505;&#35268;&#36991;&#32773;&#12290;&#30456;&#21453;&#65292;&#25237;&#36164;&#32654;&#22269;&#22269;&#20538;&#30340;&#26080;&#39118;&#38505;&#36164;&#20135;&#25237;&#36164;&#32773;&#21017;&#34920;&#29616;&#20986;&#19981;&#36275;&#30340;&#39118;&#38505;&#20559;&#29233;&#65292;&#36825;&#21487;&#20197;&#34987;&#35748;&#20026;&#26159;&#19968;&#31181;&#39118;&#38505;&#35268;&#36991;&#34892;&#20026;&#12290;&#36825;&#20123;&#21457;&#29616;&#34920;&#26126;&#65292;&#37329;&#34701;&#24066;&#22330;&#26032;&#23450;&#20041;&#20934;&#30830;&#21453;&#26144;&#20102;&#25237;&#36164;&#32773;&#30340;&#34892;&#20026;&#65292;&#24212;&#32771;&#34385;&#22312;&#25237;&#36164;&#31574;&#30053;&#20013;&#12290;
&lt;/p&gt;
&lt;p&gt;
This study presents empirical evidence to support the validity of new definitions in financial markets. The risk attitudes of investors in US financial markets from 1889-1978 are analyzed and the results indicate that equity investors who invested in the composite S&amp;P 500 index were risk-averse in 1977. Conversely, risk-free asset investors who invested in US Treasury bills were found to exhibit not enough risk-loving behavior, which can be considered a type of risk-averse behavior. These findings suggest that the new definitions in financial markets accurately reflect the behavior of investors and should be considered in investment strategies.
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#25552;&#20379;&#20102;&#22522;&#20110;&#22270;&#35770;&#24037;&#20855;&#30340;&#38543;&#26426;&#36873;&#25321;&#27010;&#29575;&#29305;&#24449;&#25551;&#36848;&#65292;&#24182;&#22312;&#19981;&#23436;&#25972;&#39046;&#22495;&#20013;&#25552;&#20379;&#20102;&#38543;&#26426;&#29702;&#24615;&#30340;&#26032;&#21051;&#30011;&#12290;</title><link>http://arxiv.org/abs/2303.14249</link><description>&lt;p&gt;
&#20851;&#20110;&#38543;&#26426;&#36873;&#25321;&#20013;&#30340;&#22270;&#24418;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
On Graphical Methods in Stochastic Choice. (arXiv:2303.14249v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.14249
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20379;&#20102;&#22522;&#20110;&#22270;&#35770;&#24037;&#20855;&#30340;&#38543;&#26426;&#36873;&#25321;&#27010;&#29575;&#29305;&#24449;&#25551;&#36848;&#65292;&#24182;&#22312;&#19981;&#23436;&#25972;&#39046;&#22495;&#20013;&#25552;&#20379;&#20102;&#38543;&#26426;&#29702;&#24615;&#30340;&#26032;&#21051;&#30011;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36817;&#24180;&#26469;&#65292;&#26377;&#22823;&#37327;&#35770;&#25991;&#20351;&#29992;&#22270;&#35770;&#24037;&#20855;&#30740;&#31350;&#38543;&#26426;&#36873;&#25321;&#12290;Fiornini (2004)&#30340;&#30740;&#31350;&#25104;&#26524;&#20026;&#35813;&#39046;&#22495;&#25552;&#20379;&#20102;&#22522;&#30784;&#65292;&#36890;&#36807;&#25552;&#20379;&#36873;&#25321;&#27010;&#29575;&#30340;&#22270;&#24418;&#34920;&#31034;&#65292;&#24182;&#26174;&#31034;&#35813;&#22270;&#30340;&#27599;&#20010;&#20869;&#37096;&#33410;&#28857;&#24517;&#39035;&#28385;&#36275;&#27969;&#20837;&#31561;&#20110;&#27969;&#20986;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#36825;&#31181;&#27969;&#20837;&#31561;&#20110;&#27969;&#20986;&#29305;&#24615;&#20960;&#20046;&#26159;&#36873;&#25321;&#27010;&#29575;&#30340;&#29305;&#24449;&#12290;&#36890;&#36807;&#36825;&#31181;&#26041;&#24335;&#65292;&#25105;&#20204;&#20351;&#29992;&#22270;&#35770;&#24037;&#20855;&#23545;&#36873;&#25321;&#27010;&#29575;&#36827;&#34892;&#29305;&#24449;&#25551;&#36848;&#12290;&#20316;&#20026;&#35813;&#32467;&#26524;&#30340;&#19968;&#20010;&#24212;&#29992;&#65292;&#25105;&#20204;&#25552;&#20379;&#20102;&#19981;&#23436;&#25972;&#39046;&#22495;&#20013;&#38543;&#26426;&#29702;&#24615;&#30340;&#26032;&#21051;&#30011;&#12290;
&lt;/p&gt;
&lt;p&gt;
In recent years there has been an influx of papers which use graph theoretic tools to study stochastic choice. Fiorini (2004) serves as a base for this literature by providing a graphical representation of choice probabilities and showing that every interior node of this graph must satisfy inflow equals outflow. We show that this inflow equals outflow property is almost characteristic of choice probabilities. In doing so, we characterize choice probabilities through graph theoretic tools. As an application of this result, we provide a novel characterization of stochastic rationality on an incomplete domain.
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#26102;&#38388;&#24207;&#21015;&#22238;&#24402;&#20013;&#30340;&#40065;&#26834;&#25512;&#26029;&#38382;&#39064;&#65292;&#25351;&#20986;&#20102;&#23558;HAC&#20272;&#35745;&#25216;&#26415;&#24212;&#29992;&#20110;&#26102;&#38388;&#24207;&#21015;&#29615;&#22659;&#26102;&#30340;&#22256;&#38590;&#65292;&#24182;&#35752;&#35770;&#20102;OLS&#21442;&#25968;&#20272;&#35745;&#19981;&#19968;&#33268;&#12289;HAC&#22238;&#24402;&#21442;&#25968;&#20272;&#35745;&#20302;&#25928;&#20197;&#21450;HAC&#26465;&#20214;&#39044;&#27979;&#20302;&#25928;&#31561;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2203.04080</link><description>&lt;p&gt;
&#20851;&#20110;&#26102;&#38388;&#24207;&#21015;&#22238;&#24402;&#20013;&#30340;&#40065;&#26834;&#25512;&#26029;
&lt;/p&gt;
&lt;p&gt;
On Robust Inference in Time Series Regression. (arXiv:2203.04080v2 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2203.04080
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#26102;&#38388;&#24207;&#21015;&#22238;&#24402;&#20013;&#30340;&#40065;&#26834;&#25512;&#26029;&#38382;&#39064;&#65292;&#25351;&#20986;&#20102;&#23558;HAC&#20272;&#35745;&#25216;&#26415;&#24212;&#29992;&#20110;&#26102;&#38388;&#24207;&#21015;&#29615;&#22659;&#26102;&#30340;&#22256;&#38590;&#65292;&#24182;&#35752;&#35770;&#20102;OLS&#21442;&#25968;&#20272;&#35745;&#19981;&#19968;&#33268;&#12289;HAC&#22238;&#24402;&#21442;&#25968;&#20272;&#35745;&#20302;&#25928;&#20197;&#21450;HAC&#26465;&#20214;&#39044;&#27979;&#20302;&#25928;&#31561;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#27178;&#25130;&#38754;&#29615;&#22659;&#20013;&#65292;&#20855;&#26377;&#24322;&#26041;&#24046;&#21644;&#33258;&#30456;&#20851;&#19968;&#33268;&#65288;HAC&#65289;&#26631;&#20934;&#35823;&#30340;&#26368;&#23567;&#20108;&#20056;&#22238;&#24402;&#38750;&#24120;&#26377;&#29992;&#12290;&#28982;&#32780;&#65292;&#22312;&#23558;HAC&#20272;&#35745;&#25216;&#26415;&#24212;&#29992;&#20110;&#26102;&#38388;&#24207;&#21015;&#29615;&#22659;&#26102;&#65292;&#20250;&#38754;&#20020;&#20960;&#20010;&#24120;&#24120;&#34987;&#24573;&#35270;&#30340;&#20027;&#35201;&#22256;&#38590;&#12290;&#39318;&#20808;&#65292;&#22312;&#21487;&#33021;&#20986;&#29616;&#24378;&#22806;&#29983;&#24615;&#22833;&#36133;&#30340;&#26102;&#38388;&#24207;&#21015;&#29615;&#22659;&#20013;&#65292;OLS&#21442;&#25968;&#20272;&#35745;&#21487;&#33021;&#19981;&#19968;&#33268;&#65292;&#22240;&#27492;&#21363;&#20351;&#28176;&#36817;&#19979;&#20063;&#26080;&#27861;&#36827;&#34892;HAC&#25512;&#26029;&#12290;&#20854;&#27425;&#65292;&#22823;&#22810;&#25968;&#32463;&#27982;&#26102;&#38388;&#24207;&#21015;&#20855;&#26377;&#24378;&#33258;&#30456;&#20851;&#24615;&#65292;&#36825;&#20351;&#24471;HAC&#22238;&#24402;&#21442;&#25968;&#20272;&#35745;&#38750;&#24120;&#20302;&#25928;&#12290;&#31532;&#19977;&#65292;&#24378;&#33258;&#30456;&#20851;&#24615;&#21516;&#26679;&#20351;&#24471;HAC&#26465;&#20214;&#39044;&#27979;&#38750;&#24120;&#20302;&#25928;&#12290;&#26368;&#21518;&#65292;&#27969;&#34892;&#30340;HAC&#20272;&#35745;&#22120;&#30340;&#32467;&#26500;&#19981;&#36866;&#21512;&#25429;&#25417;&#36890;&#24120;&#23384;&#22312;&#20110;&#32463;&#27982;&#26102;&#38388;&#24207;&#21015;&#20013;&#30340;&#33258;&#22238;&#24402;&#33258;&#30456;&#20851;&#24615;&#65292;&#36825;&#20250;&#20135;&#29983;&#36739;&#22823;&#30340;&#35268;&#27169;&#25197;&#26354;&#21644;HAC&#20551;&#35774;&#26816;&#39564;&#20013;&#30340;&#21151;&#25928;&#38477;&#20302;&#65292;&#38500;&#38750;&#26679;&#26412;&#25968;&#37327;&#38750;&#24120;&#22823;&#12290;
&lt;/p&gt;
&lt;p&gt;
Least squares regression with heteroskedasticity and autocorrelation consistent (HAC) standard errors has proved very useful in cross section environments. However, several major difficulties, which are generally overlooked, must be confronted when transferring the HAC estimation technology to time series environments. First, in plausible time-series environments involving failure of strong exogeneity, OLS parameter estimates can be inconsistent, so that HAC inference fails even asymptotically. Second, most economic time series have strong autocorrelation, which renders HAC regression parameter estimates highly inefficient. Third, strong autocorrelation similarly renders HAC conditional predictions highly inefficient. Finally, The structure of popular HAC estimators is ill-suited for capturing the autoregressive autocorrelation typically present in economic time series, which produces large size distortions and reduced power in HACbased hypothesis testing, in all but the largest sample
&lt;/p&gt;</description></item></channel></rss>