<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#26412;&#30740;&#31350;&#30740;&#31350;&#20102;&#22788;&#32602;&#21644;&#22870;&#21169;&#23545;&#22234;&#24466;&#22256;&#22659;&#21338;&#24328;&#20013;&#21512;&#20316;&#34892;&#20026;&#30340;&#24433;&#21709;&#65292;&#24182;&#21457;&#29616;&#19968;&#33324;&#24615;&#30340;&#28608;&#21169;&#26377;&#28508;&#21147;&#28040;&#38500;&#29609;&#23478;&#32676;&#20307;&#20013;&#30340;&#25152;&#26377;&#21467;&#21464;&#34892;&#20026;&#12290;</title><link>http://arxiv.org/abs/2309.00556</link><description>&lt;p&gt;
&#22788;&#32602;&#19982;&#22870;&#21169;&#23545;&#22234;&#24466;&#22256;&#22659;&#21338;&#24328;&#20013;&#30340;&#21512;&#20316;&#34892;&#20026;&#30340;&#24433;&#21709;
&lt;/p&gt;
&lt;p&gt;
The Effect of Punishment and Reward on Cooperation in a Prisoners' Dilemma Game. (arXiv:2309.00556v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.00556
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#30740;&#31350;&#20102;&#22788;&#32602;&#21644;&#22870;&#21169;&#23545;&#22234;&#24466;&#22256;&#22659;&#21338;&#24328;&#20013;&#21512;&#20316;&#34892;&#20026;&#30340;&#24433;&#21709;&#65292;&#24182;&#21457;&#29616;&#19968;&#33324;&#24615;&#30340;&#28608;&#21169;&#26377;&#28508;&#21147;&#28040;&#38500;&#29609;&#23478;&#32676;&#20307;&#20013;&#30340;&#25152;&#26377;&#21467;&#21464;&#34892;&#20026;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;&#22788;&#32602;&#21644;&#22870;&#21169;&#23545;&#36845;&#20195;n&#20154;&#22234;&#24466;&#22256;&#22659;&#21338;&#24328;&#20013;&#21512;&#20316;&#32773;&#21644;&#32972;&#21467;&#32773;&#24179;&#34913;&#27604;&#20363;&#30340;&#24433;&#21709;&#12290;&#36890;&#36807;&#26377;&#38480;&#30340;&#29609;&#23478;&#32676;&#20307;&#37319;&#29992;&#31574;&#30053;&#30340;&#21451;&#22909;&#25253;&#22797;&#25110;&#26222;&#36941;&#32570;&#38519;&#65292;&#21487;&#20197;&#20174;&#32447;&#24615;&#21270;&#30340;&#25910;&#30410;&#20989;&#25968;&#20013;&#30830;&#23450;&#27599;&#31181;&#31867;&#22411;&#30340;&#29609;&#23478;&#30340;&#24179;&#34913;&#27604;&#20363;&#12290;&#28608;&#21169;&#20197;&#26377;&#38024;&#23545;&#24615;&#21644;&#26222;&#36941;&#24615;&#30340;&#24809;&#32602;&#20197;&#21450;&#26377;&#38024;&#23545;&#24615;&#21644;&#26222;&#36941;&#24615;&#30340;&#22870;&#21169;&#24418;&#24335;&#23384;&#22312;&#12290;&#26412;&#30740;&#31350;&#30340;&#20027;&#35201;&#36129;&#29486;&#22312;&#20110;&#28165;&#26224;&#22320;&#38416;&#36848;&#20102;&#36825;&#20123;&#28608;&#21169;&#23545;&#21512;&#20316;&#34892;&#20026;&#30340;&#35774;&#35745;&#21644;&#36793;&#38469;&#25928;&#24212;&#12290;&#19968;&#33324;&#21270;&#30340;&#32467;&#26524;&#34920;&#26126;&#65292;&#23613;&#31649;&#26377;&#38024;&#23545;&#24615;&#30340;&#28608;&#21169;&#26377;&#28508;&#21147;&#22823;&#24133;&#20943;&#23569;&#20294;&#27704;&#36828;&#19981;&#33021;&#23436;&#20840;&#28040;&#38500;&#21467;&#21464;&#34892;&#20026;&#65292;&#20294;&#23427;&#20204;&#30340;&#36793;&#38469;&#25928;&#26524;&#36882;&#20943;&#12290;&#21478;&#19968;&#26041;&#38754;&#65292;&#19968;&#33324;&#24615;&#30340;&#28608;&#21169;&#26377;&#28508;&#21147;&#28040;&#38500;&#29609;&#23478;&#32676;&#20307;&#20013;&#30340;&#25152;&#26377;&#21467;&#21464;&#34892;&#20026;&#12290;&#26412;&#30740;&#31350;&#36824;&#31616;&#35201;&#32771;&#34385;&#20102;&#23545;&#25919;&#31574;&#30340;&#24212;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;
This work studies the effect of incentives (in the form of punishment and reward) on the equilibrium fraction of cooperators and defectors in an iterated n-person prisoners' dilemma game. With a finite population of players employing a strategy of nice tit-for-tat or universal defect, an equilibrium fraction of each player-type can be identified from linearized payoff functions. Incentives take the form of targeted and general punishment, and targeted and general reward. The primary contribution of this work is in clearly articulating the design and marginal effect of these incentives on cooperation. Generalizable results indicate that while targeted incentives have the potential to substantially reduce but never entirely eliminate defection, they exhibit diminishing marginal effectiveness. General incentives on the other hand have the potential to eliminate all defection from the population of players. Applications to policy are briefly considered.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#22823;&#22411;&#36817;&#20284;&#21160;&#24577;&#22240;&#23376;&#27169;&#22411;&#30340;&#20027;&#25104;&#20998;&#20998;&#26512;&#20272;&#35745;&#21644;&#25512;&#26029;&#65292;&#25552;&#20379;&#20102;&#28176;&#36817;&#32467;&#26524;&#30340;&#26367;&#20195;&#25512;&#23548;&#65292;&#24182;&#19988;&#36890;&#36807;&#32463;&#20856;&#30340;&#26679;&#26412;&#21327;&#26041;&#24046;&#30697;&#38453;&#36827;&#34892;&#20272;&#35745;&#65292;&#24471;&#20986;&#23427;&#20204;&#31561;&#20215;&#20110;OLS&#30340;&#32467;&#35770;&#12290;</title><link>http://arxiv.org/abs/2211.01921</link><description>&lt;p&gt;
&#23545;&#22823;&#22411;&#36817;&#20284;&#21160;&#24577;&#22240;&#23376;&#27169;&#22411;&#36827;&#34892;&#20027;&#25104;&#20998;&#20998;&#26512;&#30340;&#20272;&#35745;&#21644;&#25512;&#26029;
&lt;/p&gt;
&lt;p&gt;
On Estimation and Inference of Large Approximate Dynamic Factor Models via the Principal Component Analysis. (arXiv:2211.01921v3 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2211.01921
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22823;&#22411;&#36817;&#20284;&#21160;&#24577;&#22240;&#23376;&#27169;&#22411;&#30340;&#20027;&#25104;&#20998;&#20998;&#26512;&#20272;&#35745;&#21644;&#25512;&#26029;&#65292;&#25552;&#20379;&#20102;&#28176;&#36817;&#32467;&#26524;&#30340;&#26367;&#20195;&#25512;&#23548;&#65292;&#24182;&#19988;&#36890;&#36807;&#32463;&#20856;&#30340;&#26679;&#26412;&#21327;&#26041;&#24046;&#30697;&#38453;&#36827;&#34892;&#20272;&#35745;&#65292;&#24471;&#20986;&#23427;&#20204;&#31561;&#20215;&#20110;OLS&#30340;&#32467;&#35770;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20379;&#20102;&#19968;&#31181;&#23545;&#22823;&#22411;&#36817;&#20284;&#22240;&#23376;&#27169;&#22411;&#20027;&#25104;&#20998;&#20272;&#35745;&#22120;&#30340;&#28176;&#36817;&#32467;&#26524;&#30340;&#26367;&#20195;&#25512;&#23548;&#12290;&#32467;&#26524;&#26159;&#22312;&#26368;&#23567;&#30340;&#20551;&#35774;&#38598;&#21512;&#19979;&#23548;&#20986;&#30340;&#65292;&#29305;&#21035;&#22320;&#65292;&#25105;&#20204;&#21482;&#38656;&#35201;&#23384;&#22312;4&#38454;&#30697;&#12290;&#22312;&#26102;&#38388;&#24207;&#21015;&#35774;&#32622;&#20013;&#32473;&#20104;&#20102;&#29305;&#21035;&#20851;&#27880;&#65292;&#36825;&#26159;&#20960;&#20046;&#25152;&#26377;&#26368;&#26032;&#35745;&#37327;&#24212;&#29992;&#22240;&#23376;&#27169;&#22411;&#30340;&#24773;&#20917;&#12290;&#22240;&#27492;&#65292;&#20272;&#35745;&#26159;&#22522;&#20110;&#32463;&#20856;&#30340;$n\times n$&#26679;&#26412;&#21327;&#26041;&#24046;&#30697;&#38453;&#65292;&#32780;&#19981;&#26159;&#25991;&#29486;&#20013;&#24120;&#32771;&#34385;&#30340;$T\times T$&#21327;&#26041;&#24046;&#30697;&#38453;&#12290;&#20107;&#23454;&#19978;&#65292;&#23613;&#31649;&#36825;&#20004;&#31181;&#26041;&#27861;&#22312;&#28176;&#36817;&#24847;&#20041;&#19979;&#31561;&#20215;&#65292;&#20294;&#21069;&#32773;&#26356;&#31526;&#21512;&#26102;&#38388;&#24207;&#21015;&#35774;&#32622;&#65292;&#24182;&#19988;&#23427;&#31435;&#21363;&#20801;&#35768;&#25105;&#20204;&#32534;&#20889;&#26356;&#30452;&#35266;&#30340;&#20027;&#25104;&#20998;&#20272;&#35745;&#28176;&#36817;&#23637;&#24320;&#65292;&#26174;&#31034;&#23427;&#20204;&#31561;&#20215;&#20110;OLS&#65292;&#21482;&#35201;$\sqrt n/T\to 0$&#21644;$\sqrt T/n\to 0$&#65292;&#21363;&#22312;&#26102;&#38388;&#24207;&#21015;&#22238;&#24402;&#20013;&#20272;&#35745;&#36733;&#33655;&#26102;&#20551;&#35774;&#22240;&#23376;&#24050;&#30693;&#65292;&#32780;&#22240;&#23376;&#21017;&#24050;&#30693;&#12290;
&lt;/p&gt;
&lt;p&gt;
We provide an alternative derivation of the asymptotic results for the Principal Components estimator of a large approximate factor model. Results are derived under a minimal set of assumptions and, in particular, we require only the existence of 4th order moments. A special focus is given to the time series setting, a case considered in almost all recent econometric applications of factor models. Hence, estimation is based on the classical $n\times n$ sample covariance matrix and not on a $T\times T$ covariance matrix often considered in the literature. Indeed, despite the two approaches being asymptotically equivalent, the former is more coherent with a time series setting and it immediately allows us to write more intuitive asymptotic expansions for the Principal Component estimators showing that they are equivalent to OLS as long as $\sqrt n/T\to 0$ and $\sqrt T/n\to 0$, that is the loadings are estimated in a time series regression as if the factors were known, while the factors a
&lt;/p&gt;</description></item></channel></rss>