<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>S&#22343;&#34913;&#32508;&#21512;&#20102;&#19968;&#20010;&#19990;&#32426;&#30340;&#21338;&#24328;&#35770;&#24314;&#27169;&#65292;&#36890;&#36807;&#24341;&#20837;S-&#20449;&#24565;&#21644;S-&#36873;&#25321;&#65292;&#36991;&#20813;&#20102;&#20381;&#36182;&#32435;&#20160;&#22343;&#34913;&#21644;&#29702;&#24615;&#39044;&#26399;&#30340;&#38480;&#21046;&#65292;&#24182;&#19988;&#36890;&#36807;&#35774;&#32622;&#20026;&#20540;&#22495;&#25552;&#39640;&#20102;&#39044;&#27979;&#30340;&#21487;&#38752;&#24615;&#21644;&#31934;&#30830;&#24615;&#12290;</title><link>http://arxiv.org/abs/2307.06309</link><description>&lt;p&gt;
S&#22343;&#34913;&#65306;&#65288;&#34892;&#20026;&#65289;&#21338;&#24328;&#35770;&#30340;&#32508;&#21512;&#12290; &#65288;arXiv&#65306;2307.06309v1 [econ.TH]&#65289;
&lt;/p&gt;
&lt;p&gt;
S Equilibrium: A Synthesis of (Behavioral) Game Theory. (arXiv:2307.06309v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.06309
&lt;/p&gt;
&lt;p&gt;
S&#22343;&#34913;&#32508;&#21512;&#20102;&#19968;&#20010;&#19990;&#32426;&#30340;&#21338;&#24328;&#35770;&#24314;&#27169;&#65292;&#36890;&#36807;&#24341;&#20837;S-&#20449;&#24565;&#21644;S-&#36873;&#25321;&#65292;&#36991;&#20813;&#20102;&#20381;&#36182;&#32435;&#20160;&#22343;&#34913;&#21644;&#29702;&#24615;&#39044;&#26399;&#30340;&#38480;&#21046;&#65292;&#24182;&#19988;&#36890;&#36807;&#35774;&#32622;&#20026;&#20540;&#22495;&#25552;&#39640;&#20102;&#39044;&#27979;&#30340;&#21487;&#38752;&#24615;&#21644;&#31934;&#30830;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
S&#22343;&#34913;&#32508;&#21512;&#20102;&#19968;&#20010;&#19990;&#32426;&#30340;&#21338;&#24328;&#35770;&#24314;&#27169;&#12290; S-&#20449;&#24565;&#30830;&#23450;&#36873;&#25321;&#65292;&#23601;&#20687;&#32454;&#21270;&#25991;&#29486;&#21644;k&#32423;&#21035;&#19968;&#26679;&#65292;&#32780;&#19981;&#26159;&#26500;&#24314;&#22312;&#32435;&#20160;&#22343;&#34913;&#19978;&#25110;&#32773;&#37319;&#21462;&#29305;&#23450;&#30340;&#20449;&#24565;&#24418;&#25104;&#26041;&#24335;&#12290; S-&#36873;&#25321;&#20801;&#35768;&#20986;&#29616;&#38169;&#35823;&#65292;&#23601;&#20687;QRE&#19968;&#26679;&#65292;&#32780;&#19981;&#26159;&#24378;&#21152;&#29702;&#24615;&#39044;&#26399;&#12290; S&#22343;&#34913;&#26126;&#30830;&#22320;&#35774;&#32622;&#20026;&#20540;&#22495;&#65292;&#20197;&#36991;&#20813;&#20174;&#26410;&#32463;&#23450;&#20041;&#19988;&#26410;&#32771;&#34385;&#22823;&#23567;&#30340;&#26410;&#30693;&#38598;&#21512;&#20013;&#36873;&#25321;&#26368;&#20339;&#39044;&#27979;&#30340;&#24120;&#35265;&#20570;&#27861;&#12290; S-&#22343;&#34913;&#38598;&#21512;&#38543;&#30528;&#22797;&#26434;&#24615;&#21442;&#25968;&#32780;&#21464;&#21270;&#65292;&#25552;&#20379;&#20102;&#20934;&#30830;&#24615;&#21644;&#31934;&#30830;&#24615;&#20043;&#38388;&#30340;&#26435;&#34913;&#65292;&#19982;M&#22343;&#34913;&#19981;&#21516;&#12290;&#31616;&#21333;&#30340;&#8220;&#38754;&#31215;&#24230;&#37327;&#8221;&#30830;&#23450;&#27169;&#22411;&#30340;&#21442;&#25968;&#65292;&#24182;&#26174;&#31034;&#30456;&#23545;&#22823;&#23567;&#20026;5&#65285;&#30340;&#36873;&#25321;&#38598;&#21512;&#33021;&#22815;&#25429;&#33719;58&#65285;&#30340;&#25968;&#25454;&#12290;&#22312;&#24191;&#27867;&#30340;&#23454;&#39564;&#21338;&#24328;&#25968;&#25454;&#19978;&#24212;&#29992;&#25311;&#21512;&#20248;&#24230;&#27979;&#35797;&#65292;&#30830;&#35748;&#20102;S&#22343;&#34913;&#22312;&#26679;&#26412;&#20869;&#22806;&#39044;&#27979;&#34892;&#20026;&#30340;&#33021;&#21147;&#12290;&#30456;&#27604;&#20043;&#19979;&#65292;k&#32423;&#21035;&#21644;QRE&#30340;&#36873;&#25321;&#65288;&#20449;&#24565;&#65289;&#39044;&#27979;&#22312;&#22823;&#22810;&#25968;&#24773;&#20917;&#19979;&#34987;&#25298;&#32477;&#12290;
&lt;/p&gt;
&lt;p&gt;
$S$ equilibrium synthesizes a century of game-theoretic modeling. $S$-beliefs determine choices as in the refinement literature and level-$k$, without anchoring on Nash equilibrium or imposing ad hoc belief formation. $S$-choices allow for mistakes as in QRE, without imposing rational expectations. $S$ equilibrium is explicitly set-valued to avoid the common practice of selecting the best prediction from an implicitly defined set of unknown, and unaccounted for, size. $S$-equilibrium sets vary with a complexity parameter, offering a trade-off between accuracy and precision unlike in $M$ equilibrium. Simple "areametrics" determine the model's parameter and show that choice sets with a relative size of 5 percent capture 58 percent percent of the data. Goodness-of-fit tests applied to data from a broad array of experimental games confirm $S$ equilibrium's ability to predict behavior in and out of sample. In contrast, choice (belief) predictions of level-$k$ and QRE are rejected in most (a
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#19968;&#31867;&#33021;&#22815;&#36866;&#24212;&#21463;&#20020;&#26102;&#38480;&#21046;&#30340;&#31995;&#21015;&#30340;&#22810;&#20803;&#38408;&#20540;&#33258;&#22238;&#24402;&#27169;&#22411;&#65292;&#25552;&#20986;&#20102;&#31283;&#23450;&#12289;&#36941;&#21382;&#12289;&#24369;&#20381;&#36182;&#30340;&#20805;&#20998;&#26465;&#20214;&#65292;&#24182;&#23545;&#21333;&#20301;&#26681;&#21644;&#21327;&#25972;&#24615;&#25552;&#20379;&#20102;&#22788;&#29702;&#26041;&#27861;&#12290;</title><link>http://arxiv.org/abs/2307.06190</link><description>&lt;p&gt;
&#20020;&#26102;&#38480;&#21046;&#19982;&#26102;&#19981;&#26102;&#32422;&#26463;&#19979;&#30340;&#31283;&#23450;&#24615;
&lt;/p&gt;
&lt;p&gt;
Stationarity with Occasionally Binding Constraints. (arXiv:2307.06190v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.06190
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#19968;&#31867;&#33021;&#22815;&#36866;&#24212;&#21463;&#20020;&#26102;&#38480;&#21046;&#30340;&#31995;&#21015;&#30340;&#22810;&#20803;&#38408;&#20540;&#33258;&#22238;&#24402;&#27169;&#22411;&#65292;&#25552;&#20986;&#20102;&#31283;&#23450;&#12289;&#36941;&#21382;&#12289;&#24369;&#20381;&#36182;&#30340;&#20805;&#20998;&#26465;&#20214;&#65292;&#24182;&#23545;&#21333;&#20301;&#26681;&#21644;&#21327;&#25972;&#24615;&#25552;&#20379;&#20102;&#22788;&#29702;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#19968;&#31867;&#22810;&#20803;&#38408;&#20540;&#33258;&#22238;&#24402;&#27169;&#22411;&#65292;&#21363;&#34987;&#25130;&#23614;&#21644;&#24367;&#26354;&#30340;&#32467;&#26500;&#21521;&#37327;&#33258;&#22238;&#24402;&#65288;CKSVAR&#65289;&#65292;&#36825;&#31181;&#27169;&#22411;&#33021;&#22815;&#36866;&#24212;&#21463;&#20020;&#26102;&#38480;&#21046;&#30340;&#31995;&#21015;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#32452;&#28385;&#36275;CKSVAR&#29983;&#25104;&#30340;&#36807;&#31243;&#26159;&#31283;&#23450;&#12289;&#36941;&#21382;&#12289;&#24369;&#20381;&#36182;&#30340;&#20805;&#20998;&#26465;&#20214;&#12290;&#25105;&#20204;&#30340;&#26465;&#20214;&#30452;&#25509;&#19982;&#27169;&#22411;&#30340;&#30830;&#23450;&#24615;&#37096;&#20998;&#30340;&#31283;&#23450;&#24615;&#30456;&#20851;&#65292;&#22240;&#27492;&#27604;&#19968;&#33324;&#21521;&#37327;&#38408;&#20540;&#33258;&#22238;&#24402;&#65288;VTAR&#65289;&#27169;&#22411;&#36890;&#24120;&#21487;&#29992;&#30340;&#26465;&#20214;&#26356;&#20026;&#20445;&#23432;&#12290;&#34429;&#28982;&#25105;&#20204;&#30340;&#26631;&#20934;&#28041;&#21450;&#35745;&#31639;&#19981;&#21487;&#34892;&#30340;&#25968;&#37327;&#65292;&#22914;&#32852;&#21512;&#35889;&#21322;&#24452;&#30340;&#25913;&#36827;&#65292;&#20294;&#23427;&#20204;&#21487;&#20197;&#36890;&#36807;&#25968;&#20540;&#36924;&#36817;&#20197;&#39640;&#24230;&#31934;&#30830;&#24230;&#35745;&#31639;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#32467;&#26524;&#36824;&#20801;&#35768;&#25105;&#20204;&#23545;CKSVAR&#20013;&#30340;&#21333;&#20301;&#26681;&#21644;&#21327;&#25972;&#24615;&#36827;&#34892;&#22788;&#29702;&#65292;&#29305;&#21035;&#26159;&#22312;&#27169;&#22411;&#34987;&#37197;&#32622;&#20026;&#29983;&#25104;&#32447;&#24615;&#21327;&#25972;&#20851;&#31995;&#26102;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper studies a class of multivariate threshold autoregressive models, known as censored and kinked structural vector autoregressions (CKSVAR), which are notably able to accommodate series that are subject to occasionally binding constraints. We develop a set of sufficient conditions for the processes generated by a CKSVAR to be stationary, ergodic, and weakly dependent. Our conditions relate directly to the stability of the deterministic part of the model, and are therefore less conservative than those typically available for general vector threshold autoregressive (VTAR) models. Though our criteria refer to quantities, such as refinements of the joint spectral radius, that cannot feasibly be computed exactly, they can be approximated numerically to a high degree of precision. Our results also permit us to provide a treatment of unit roots and cointegration in the CKSVAR, for the case where the model is configured so as to generate linear cointegration.
&lt;/p&gt;</description></item><item><title>&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26041;&#27861;&#65292;&#29992;&#20110;&#22312;&#31163;&#25955;&#20540;&#20202;&#22120;&#30340;&#22810;&#37325;&#27835;&#30103;&#27169;&#22411;&#20013;&#23398;&#20064;&#27835;&#30103;&#25928;&#24212;&#12290;&#36890;&#36807;&#24212;&#29992;&#21322;&#21442;&#25968;&#32422;&#26463;&#30340;&#26041;&#27861;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#22914;&#20309;&#35745;&#31639;&#20986;&#19968;&#20123;&#27835;&#30103;&#25928;&#24212;&#21442;&#25968;&#30340;&#23574;&#38160;&#30028;&#38480;&#12290;</title><link>http://arxiv.org/abs/2307.06174</link><description>&lt;p&gt;
&#22312;&#31163;&#25955;&#21464;&#24322;&#19979;&#30340;&#22810;&#37325;&#27835;&#30103;&#27169;&#22411;&#20013;&#30340;&#36776;&#35782;
&lt;/p&gt;
&lt;p&gt;
Identification in Multiple Treatment Models under Discrete Variation. (arXiv:2307.06174v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.06174
&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26041;&#27861;&#65292;&#29992;&#20110;&#22312;&#31163;&#25955;&#20540;&#20202;&#22120;&#30340;&#22810;&#37325;&#27835;&#30103;&#27169;&#22411;&#20013;&#23398;&#20064;&#27835;&#30103;&#25928;&#24212;&#12290;&#36890;&#36807;&#24212;&#29992;&#21322;&#21442;&#25968;&#32422;&#26463;&#30340;&#26041;&#27861;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#22914;&#20309;&#35745;&#31639;&#20986;&#19968;&#20123;&#27835;&#30103;&#25928;&#24212;&#21442;&#25968;&#30340;&#23574;&#38160;&#30028;&#38480;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#31181;&#26041;&#27861;&#65292;&#29992;&#20110;&#23398;&#20064;&#22312;&#24102;&#26377;&#31163;&#25955;&#20540;&#20202;&#22120;&#30340;&#22810;&#37325;&#27835;&#30103;&#27169;&#22411;&#20013;&#30340;&#27835;&#30103;&#25928;&#24212;&#12290;&#25105;&#20204;&#20801;&#35768;&#27835;&#30103;&#36873;&#25321;&#30001;&#20801;&#35768;&#22810;&#32500;&#26410;&#35266;&#23519;&#24322;&#36136;&#24615;&#30340;&#19968;&#33324;&#38376;&#38480;&#20132;&#21449;&#27169;&#22411;&#26469;&#25511;&#21046;&#12290;&#22312;&#26410;&#35266;&#23519;&#21040;&#30340;&#24322;&#36136;&#24615;&#20998;&#24067;&#19978;&#26045;&#21152;&#21322;&#21442;&#25968;&#32422;&#26463;&#30340;&#24773;&#20917;&#19979;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#22914;&#20309;&#20351;&#29992;&#19968;&#31995;&#21015;&#32447;&#24615;&#35268;&#21010;&#26469;&#35745;&#31639;&#19968;&#20123;&#27835;&#30103;&#25928;&#24212;&#21442;&#25968;&#30340;&#23574;&#38160;&#30028;&#38480;&#65292;&#24403;&#20854;&#24213;&#23618;&#30340;&#36793;&#38469;&#27835;&#30103;&#21453;&#24212;&#20989;&#25968;&#20445;&#25345;&#38750;&#21442;&#25968;&#21270;&#25110;&#26159;&#38468;&#21152;&#21442;&#25968;&#21270;&#26102;&#12290;
&lt;/p&gt;
&lt;p&gt;
We develop a method to learn about treatment effects in multiple treatment models with discrete-valued instruments. We allow selection into treatment to be governed by a general class of threshold crossing models that permits multidimensional unobserved heterogeneity. Under a semi-parametric restriction on the distribution of unobserved heterogeneity, we show how a sequence of linear programs can be used to compute sharp bounds for a number of treatment effect parameters when the marginal treatment response functions underlying them remain nonparametric or are additionally parameterized.
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#20351;&#29992;&#22806;&#37096;&#24037;&#20855;&#30340;&#35782;&#21035;&#31574;&#30053;&#26469;&#35299;&#20915;&#20914;&#20987;&#19981;&#21487;&#36870;&#21644;&#27979;&#37327;&#35823;&#24046;&#38382;&#39064;&#30340;&#26041;&#27861;&#12290;&#22312;&#27169;&#25311;&#20998;&#26512;&#21644;&#24212;&#29992;&#21040;&#32654;&#22269;&#36135;&#24065;&#25919;&#31574;&#30340;&#23454;&#35777;&#30740;&#31350;&#20013;, &#35813;&#26041;&#27861;&#33021;&#22815;&#25104;&#21151;&#22320;&#24674;&#22797;&#30495;&#23454;&#30340;&#33033;&#20914;&#21709;&#24212;&#65292;&#24182;&#35777;&#26126;&#20102;&#36135;&#24065;&#25919;&#31574;&#20914;&#20987;&#22312;&#35299;&#37322;&#32463;&#27982;&#27874;&#21160;&#20013;&#30340;&#37325;&#35201;&#24615;&#12290;</title><link>http://arxiv.org/abs/2307.06145</link><description>&lt;p&gt;
&#20351;&#29992;&#22806;&#37096;&#24037;&#20855;&#30340;&#24378;&#22823;&#33033;&#20914;&#24433;&#21709;&#65306;&#20449;&#24687;&#30340;&#20316;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;
Robust Impulse Responses using External Instruments: the Role of Information. (arXiv:2307.06145v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.06145
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#20351;&#29992;&#22806;&#37096;&#24037;&#20855;&#30340;&#35782;&#21035;&#31574;&#30053;&#26469;&#35299;&#20915;&#20914;&#20987;&#19981;&#21487;&#36870;&#21644;&#27979;&#37327;&#35823;&#24046;&#38382;&#39064;&#30340;&#26041;&#27861;&#12290;&#22312;&#27169;&#25311;&#20998;&#26512;&#21644;&#24212;&#29992;&#21040;&#32654;&#22269;&#36135;&#24065;&#25919;&#31574;&#30340;&#23454;&#35777;&#30740;&#31350;&#20013;, &#35813;&#26041;&#27861;&#33021;&#22815;&#25104;&#21151;&#22320;&#24674;&#22797;&#30495;&#23454;&#30340;&#33033;&#20914;&#21709;&#24212;&#65292;&#24182;&#35777;&#26126;&#20102;&#36135;&#24065;&#25919;&#31574;&#20914;&#20987;&#22312;&#35299;&#37322;&#32463;&#27982;&#27874;&#21160;&#20013;&#30340;&#37325;&#35201;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24403;&#20914;&#20987;&#19981;&#21487;&#36870;&#19988;&#23384;&#22312;&#27979;&#37327;&#35823;&#24046;&#26102;&#65292;&#22806;&#37096;&#24037;&#20855;&#35782;&#21035;&#20250;&#23548;&#33268;&#20559;&#20506;&#30340;&#21709;&#24212;&#12290;&#25105;&#20204;&#25552;&#20986;&#22312;&#32467;&#26500;&#21160;&#24577;&#22240;&#23376;&#27169;&#22411;&#20013;&#20351;&#29992;&#27492;&#35782;&#21035;&#31574;&#30053;&#65292;&#25105;&#20204;&#31216;&#20043;&#20026;&#20195;&#29702;DFM&#12290;&#22312;&#27169;&#25311;&#20998;&#26512;&#20013;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#20195;&#29702;DFM&#22987;&#32456;&#33021;&#22815;&#25104;&#21151;&#22320;&#24674;&#22797;&#30495;&#23454;&#30340;&#33033;&#20914;&#21709;&#24212;&#65292;&#32780;&#20195;&#29702;SVAR&#22312;&#27169;&#22411;&#38169;&#35823;&#12289;&#26410;&#21253;&#21547;&#25152;&#26377;&#30456;&#20851;&#20449;&#24687;&#25110;&#23384;&#22312;&#27979;&#37327;&#35823;&#24046;&#26102;&#31995;&#32479;&#24615;&#22320;&#22833;&#36133;&#12290;&#22312;&#23545;&#32654;&#22269;&#36135;&#24065;&#25919;&#31574;&#30340;&#24212;&#29992;&#20013;&#65292;&#20195;&#29702;DFM&#34920;&#26126;&#25910;&#32039;&#20914;&#20987;&#26080;&#30097;&#26159;&#25910;&#32553;&#24615;&#30340;&#65292;&#20276;&#38543;&#30528;&#22269;&#20869;&#38656;&#27714;&#12289;&#21171;&#21160;&#21147;&#12289;&#20449;&#36151;&#12289;&#25151;&#22320;&#20135;&#12289;&#27719;&#29575;&#21644;&#37329;&#34701;&#24066;&#22330;&#30340;&#24694;&#21270;&#12290;&#36825;&#23545;&#20110;&#25991;&#29486;&#20013;&#25552;&#20379;&#30340;&#25152;&#26377;&#21407;&#22987;&#24037;&#20855;&#37117;&#25104;&#31435;&#12290;&#26041;&#24046;&#20998;&#35299;&#20998;&#26512;&#31361;&#20986;&#20102;&#36135;&#24065;&#25919;&#31574;&#20914;&#20987;&#22312;&#35299;&#37322;&#32463;&#27982;&#27874;&#21160;&#20013;&#30340;&#37325;&#35201;&#24615;&#65292;&#23613;&#31649;&#22312;&#19981;&#21516;&#30340;&#26102;&#38388;&#36328;&#24230;&#19978;&#23384;&#22312;&#24046;&#24322;&#12290;
&lt;/p&gt;
&lt;p&gt;
External-instrument identification leads to biased responses when the shock is not invertible and the measurement error is present. We propose to use this identification strategy in a structural Dynamic Factor Model, which we call Proxy DFM. In a simulation analysis, we show that the Proxy DFM always successfully retrieves the true impulse responses, while the Proxy SVAR systematically fails to do so when the model is either misspecified, does not include all relevant information, or the measurement error is present. In an application to US monetary policy, the Proxy DFM shows that a tightening shock is unequivocally contractionary, with deteriorations in domestic demand, labor, credit, housing, exchange, and financial markets. This holds true for all raw instruments available in the literature. The variance decomposition analysis highlights the importance of monetary policy shocks in explaining economic fluctuations, albeit at different horizons.
&lt;/p&gt;</description></item><item><title>&#36825;&#31687;&#35770;&#25991;&#25506;&#35752;&#20102;&#19968;&#33324;&#21305;&#37197;&#25216;&#26415;&#19979;&#22833;&#19994;&#23545;&#29983;&#20135;&#21147;&#21464;&#21270;&#30340;&#21709;&#24212;&#12290;&#30740;&#31350;&#34920;&#26126;&#65292;&#22833;&#19994;&#23545;&#29983;&#20135;&#21147;&#21464;&#21270;&#30340;&#21709;&#24212;&#21462;&#20915;&#20110;&#21487;&#29992;&#20110;&#21019;&#36896;&#23601;&#19994;&#26426;&#20250;&#30340;&#36164;&#28304;&#65292;&#32780;&#19981;&#26159;&#21305;&#37197;&#25216;&#26415;&#26412;&#36523;&#30340;&#31867;&#22411;&#12290;</title><link>http://arxiv.org/abs/2307.05843</link><description>&lt;p&gt;
&#23545;&#20110;&#19968;&#33324;&#21305;&#37197;&#25216;&#26415;&#30340;&#29983;&#20135;&#21147;&#21464;&#21270;&#30340;&#22833;&#19994;&#21709;&#24212;
&lt;/p&gt;
&lt;p&gt;
Responses of Unemployment to Productivity Changes for a General Matching Technology. (arXiv:2307.05843v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.05843
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#25506;&#35752;&#20102;&#19968;&#33324;&#21305;&#37197;&#25216;&#26415;&#19979;&#22833;&#19994;&#23545;&#29983;&#20135;&#21147;&#21464;&#21270;&#30340;&#21709;&#24212;&#12290;&#30740;&#31350;&#34920;&#26126;&#65292;&#22833;&#19994;&#23545;&#29983;&#20135;&#21147;&#21464;&#21270;&#30340;&#21709;&#24212;&#21462;&#20915;&#20110;&#21487;&#29992;&#20110;&#21019;&#36896;&#23601;&#19994;&#26426;&#20250;&#30340;&#36164;&#28304;&#65292;&#32780;&#19981;&#26159;&#21305;&#37197;&#25216;&#26415;&#26412;&#36523;&#30340;&#31867;&#22411;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24037;&#20154;&#31163;&#32844;&#12289;&#23547;&#25214;&#24037;&#20316;&#12289;&#25509;&#21463;&#24037;&#20316;&#24182;&#29992;&#24037;&#36164;&#25903;&#20184;&#28040;&#36153;&#12290;&#20844;&#21496;&#25307;&#32856;&#24037;&#20154;&#26469;&#22635;&#34917;&#32844;&#20301;&#31354;&#32570;&#65292;&#20294;&#25628;&#32034;&#25705;&#25830;&#20351;&#24471;&#20844;&#21496;&#26080;&#27861;&#31435;&#21363;&#38599;&#20323;&#21487;&#29992;&#24037;&#20154;&#12290;&#22833;&#19994;&#25345;&#32493;&#23384;&#22312;&#12290;&#36825;&#20123;&#29305;&#24449;&#30001;Diamond-Mortensen-Pissarides&#24314;&#27169;&#26694;&#26550;&#25551;&#36848;&#12290;&#22312;&#36825;&#31867;&#27169;&#22411;&#20013;&#65292;&#22833;&#19994;&#23545;&#29983;&#20135;&#21147;&#21464;&#21270;&#30340;&#21709;&#24212;&#21462;&#20915;&#20110;&#21487;&#29992;&#20110;&#21019;&#36896;&#23601;&#19994;&#26426;&#20250;&#30340;&#36164;&#28304;&#12290;&#28982;&#32780;&#65292;&#36825;&#31181;&#29305;&#24449;&#26159;&#22312;&#21305;&#37197;&#34987;Cobb-Douglas&#25216;&#26415;&#21442;&#25968;&#21270;&#26102;&#24471;&#20986;&#30340;&#12290;&#23545;&#20110;&#19968;&#20010;&#20856;&#22411;&#30340;DMP&#27169;&#22411;&#65292;&#25105;(1)&#35777;&#26126;&#21482;&#35201;&#21021;&#22987;&#32844;&#20301;&#31354;&#32570;&#20135;&#29983;&#27491;&#30340;&#20313;&#39069;&#65292;&#23601;&#20250;&#23384;&#22312;&#21807;&#19968;&#30340;&#31283;&#24577;&#24179;&#34913;;(2)&#23545;&#19968;&#33324;&#21305;&#37197;&#25216;&#26415;&#30340;&#22833;&#19994;&#23545;&#29983;&#20135;&#21147;&#21464;&#21270;&#30340;&#21709;&#24212;&#36827;&#34892;&#20102;&#25551;&#36848;;(3)&#23637;&#31034;&#20102;&#19968;&#20010;&#19981;&#26159;Cobb-Douglas&#30340;&#21305;&#37197;&#25216;&#26415;&#24847;&#21619;&#30528;&#22833;&#19994;&#23545;&#29983;&#20135;&#21147;&#21464;&#21270;&#30340;&#21709;&#24212;&#26356;&#22823;&#65292;&#36825;&#19982;&#21487;&#29992;&#20110;&#23601;&#19994;&#21019;&#36896;&#30340;&#36164;&#28304;&#26080;&#20851;&#12290;
&lt;/p&gt;
&lt;p&gt;
Workers separate from jobs, search for jobs, accept jobs, and fund consumption with their wages. Firms recruit workers to fill vacancies, but search frictions prevent firms from instantly hiring available workers. Unemployment persists. These features are described by the Diamond--Mortensen--Pissarides modeling framework. In this class of models, how unemployment responds to productivity changes depends on resources that can be allocated to job creation. Yet, this characterization has been made when matching is parameterized by a Cobb--Douglas technology. For a canonical DMP model, I (1) demonstrate that a unique steady-state equilibrium will exist as long as the initial vacancy yields a positive surplus; (2) characterize responses of unemployment to productivity changes for a general matching technology; and (3) show how a matching technology that is not Cobb--Douglas implies unemployment responds more to productivity changes, which is independent of resources available for job creati
&lt;/p&gt;</description></item><item><title>&#36825;&#39033;&#30740;&#31350;&#27979;&#35797;&#20102;&#36890;&#36807;&#32463;&#27982;&#25919;&#31574;&#25511;&#21046;&#27668;&#20505;&#30340;&#21487;&#34892;&#24615;&#21644;&#25104;&#26412;&#65292;&#24182;&#25552;&#20379;&#20102;&#19968;&#31181;&#32479;&#35745;&#21382;&#21490;&#35780;&#20272;&#27668;&#20505;&#21644;&#32463;&#27982;&#30340;&#24037;&#20855;&#12290;&#23454;&#35777;&#32467;&#26524;&#26174;&#31034;&#65292;&#30899;&#20943;&#25490;&#25919;&#31574;&#21487;&#20197;&#26377;&#25928;&#22320;&#31283;&#23450;&#25110;&#38477;&#20302;&#20840;&#29699;&#28201;&#24230;&#65292;&#24182;&#20135;&#29983;&#38271;&#26399;&#30340;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2307.05818</link><description>&lt;p&gt;
&#25511;&#21046;&#20840;&#29699;&#28201;&#24230;&#38656;&#35201;&#20160;&#20040;&#65311;&#20272;&#35745;&#32463;&#27982;&#25919;&#31574;&#23545;&#27668;&#20505;&#24433;&#21709;&#30340;&#24037;&#20855;&#31665;
&lt;/p&gt;
&lt;p&gt;
What Does it Take to Control Global Temperatures? A toolbox for estimating the impact of economic policies on climate. (arXiv:2307.05818v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.05818
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#30740;&#31350;&#27979;&#35797;&#20102;&#36890;&#36807;&#32463;&#27982;&#25919;&#31574;&#25511;&#21046;&#27668;&#20505;&#30340;&#21487;&#34892;&#24615;&#21644;&#25104;&#26412;&#65292;&#24182;&#25552;&#20379;&#20102;&#19968;&#31181;&#32479;&#35745;&#21382;&#21490;&#35780;&#20272;&#27668;&#20505;&#21644;&#32463;&#27982;&#30340;&#24037;&#20855;&#12290;&#23454;&#35777;&#32467;&#26524;&#26174;&#31034;&#65292;&#30899;&#20943;&#25490;&#25919;&#31574;&#21487;&#20197;&#26377;&#25928;&#22320;&#31283;&#23450;&#25110;&#38477;&#20302;&#20840;&#29699;&#28201;&#24230;&#65292;&#24182;&#20135;&#29983;&#38271;&#26399;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36890;&#36807;&#32463;&#27982;&#25919;&#31574;&#27979;&#35797;&#20102;&#25511;&#21046;&#27668;&#20505;&#30340;&#21487;&#34892;&#24615;&#21644;&#25104;&#26412;&#12290;&#23427;&#25552;&#20379;&#20102;&#19968;&#31181;&#29992;&#20110;&#32479;&#35745;&#21382;&#21490;&#35780;&#20272;&#27668;&#20505;&#21644;&#32463;&#27982;&#30340;&#38543;&#26426;&#25972;&#21512;&#27169;&#22411;&#30340;&#24037;&#20855;&#31665;&#65292;&#24182;&#29992;&#20110;&#65288;&#21487;&#33021;&#26159;&#21453;&#20107;&#23454;&#30340;&#65289;&#25919;&#31574;&#20998;&#26512;&#12290;&#35748;&#35782;&#21040;&#31283;&#23450;&#38656;&#35201;&#25233;&#21046;&#36235;&#21183;&#65292;&#25105;&#20204;&#20351;&#29992;&#20102;&#19968;&#20010;&#36890;&#36807;&#26032;&#32534;&#21046;&#30340;&#25968;&#25454;&#38598;&#20272;&#35745;&#30340;&#25972;&#21512;&#21327;&#25972;&#30690;&#37327;&#33258;&#22238;&#24402;&#27169;&#22411;&#65292;&#35813;&#25968;&#25454;&#38598;&#28085;&#30422;&#20844;&#20803;1000&#24180;&#33267;2008&#24180;&#65292;&#25193;&#22823;&#20102;&#38750;&#24179;&#31283;&#31995;&#32479;&#25511;&#21046;&#29702;&#35770;&#30340;&#20808;&#21069;&#32467;&#26524;&#12290;&#25105;&#20204;&#36827;&#34892;&#20102;&#32479;&#35745;&#27979;&#35797;&#65292;&#20197;&#30830;&#23450;&#30899;&#20943;&#25490;&#25919;&#31574;&#33021;&#21542;&#26377;&#25928;&#31283;&#23450;&#25110;&#38477;&#20302;&#20840;&#29699;&#28201;&#24230;&#30340;&#24133;&#24230;&#12290;&#25105;&#20204;&#23545;&#25919;&#31574;&#21487;&#34892;&#24615;&#36827;&#34892;&#20102;&#27491;&#24335;&#27979;&#35797;&#65292;&#32467;&#26524;&#34920;&#26126;&#30899;&#20943;&#25490;&#21487;&#20197;&#23545;&#38271;&#26399;&#20135;&#29983;&#26174;&#33879;&#24433;&#21709;&#65292;&#24182;&#19988;&#25919;&#31574;&#21487;&#20197;&#20351;&#28201;&#24230;&#31283;&#23450;&#22312;&#36873;&#23450;&#30340;&#38271;&#26399;&#24179;&#22343;&#20540;&#21608;&#22260;&#12290;&#22312;&#23545;&#25105;&#20204;&#24314;&#27169;&#31574;&#30053;&#21487;&#33021;&#24615;&#30340;&#21453;&#20107;&#23454;&#23454;&#35777;&#35828;&#26126;&#20013;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#27773;&#36710;&#25104;&#26412;&#30340;&#24773;&#20917;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper tests the feasibility and estimates the cost of climate control through economic policies. It provides a toolbox for a statistical historical assessment of a Stochastic Integrated Model of Climate and the Economy, and its use in (possibly counterfactual) policy analysis. Recognizing that stabilization requires supressing a trend, we use an integrated-cointegrated Vector Autoregressive Model estimated using a newly compiled dataset ranging between years A.D. 1000-2008, extending previous results on Control Theory in nonstationary systems. We test statistically whether, and quantify to what extent, carbon abatement policies can effectively stabilize or reduce global temperatures. Our formal test of policy feasibility shows that carbon abatement can have a significant long run impact and policies can render temperatures stationary around a chosen long run mean. In a counterfactual empirical illustration of the possibilities of our modeling strategy, we show that the cost of car
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#28385;&#36275;&#20016;&#28385;&#24615;&#23646;&#24615;&#30340;&#31867;&#22411;&#32467;&#26500;&#65292;&#25552;&#20379;&#20102;&#19968;&#20123;&#20805;&#20998;&#26465;&#20214;&#65292;&#20351;&#24471;&#23436;&#25972;&#30340;&#31867;&#22411;&#32467;&#26500;&#33021;&#22815;&#34920;&#31034;&#25152;&#26377;&#30340;&#26465;&#20214;&#20449;&#24565;&#23618;&#27425;&#32467;&#26500;&#12290;</title><link>http://arxiv.org/abs/2307.05630</link><description>&lt;p&gt;
&#23436;&#25972;&#30340;&#26465;&#20214;&#31867;&#22411;&#32467;&#26500;&#65288;&#25193;&#23637;&#25688;&#35201;&#65289;
&lt;/p&gt;
&lt;p&gt;
Complete Conditional Type Structures (Extended Abstract). (arXiv:2307.05630v1 [cs.GT])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.05630
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#28385;&#36275;&#20016;&#28385;&#24615;&#23646;&#24615;&#30340;&#31867;&#22411;&#32467;&#26500;&#65292;&#25552;&#20379;&#20102;&#19968;&#20123;&#20805;&#20998;&#26465;&#20214;&#65292;&#20351;&#24471;&#23436;&#25972;&#30340;&#31867;&#22411;&#32467;&#26500;&#33021;&#22815;&#34920;&#31034;&#25152;&#26377;&#30340;&#26465;&#20214;&#20449;&#24565;&#23618;&#27425;&#32467;&#26500;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26465;&#20214;&#20449;&#24565;&#30340;&#23618;&#27425;&#32467;&#26500;&#22312;&#39034;&#24207;&#21338;&#24328;&#20013;&#30340;&#35299;&#20915;&#27010;&#24565;&#30340;&#35748;&#35782;&#20998;&#26512;&#20013;&#36215;&#30528;&#26680;&#24515;&#20316;&#29992;&#12290;&#23427;&#20204;&#26159;&#30001;&#31867;&#22411;&#32467;&#26500;&#23454;&#38469;&#24314;&#27169;&#30340;&#65292;&#20854;&#20013;&#20998;&#26512;&#24072;&#21487;&#20197;&#34920;&#31034;&#29609;&#23478;&#30340;&#23618;&#27425;&#32467;&#26500;&#65292;&#32780;&#19981;&#38656;&#35201;&#25351;&#23450;&#26080;&#38480;&#24207;&#21015;&#30340;&#26465;&#20214;&#20449;&#24565;&#12290;&#22312;&#36825;&#37324;&#65292;&#25105;&#20204;&#30740;&#31350;&#28385;&#36275;"&#20016;&#28385;&#24615;"&#23646;&#24615;&#30340;&#31867;&#22411;&#32467;&#26500;&#12290;&#36825;&#20010;&#23646;&#24615;&#20165;&#22312;&#31867;&#22411;&#32467;&#26500;&#26412;&#36523;&#19978;&#23450;&#20041;&#65292;&#24182;&#27809;&#26377;&#26126;&#30830;&#24341;&#29992;&#20449;&#24565;&#23618;&#27425;&#32467;&#26500;&#25110;&#20854;&#20182;&#31867;&#22411;&#32467;&#26500;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#20805;&#20998;&#30340;&#26465;&#20214;&#65292;&#20351;&#24471;&#23436;&#25972;&#30340;&#31867;&#22411;&#32467;&#26500;&#33021;&#22815;&#34920;&#31034;&#25152;&#26377;&#30340;&#26465;&#20214;&#20449;&#24565;&#23618;&#27425;&#32467;&#26500;&#12290;&#29305;&#21035;&#22320;&#65292;&#25105;&#20204;&#23558;&#20027;&#35201;&#32467;&#26524;&#25193;&#23637;&#21040;&#20855;&#26377;&#26465;&#20214;&#20449;&#24565;&#30340;&#31867;&#22411;&#32467;&#26500;&#20013;&#12290;
&lt;/p&gt;
&lt;p&gt;
Hierarchies of conditional beliefs (Battigalli and Siniscalchi 1999) play a central role for the epistemic analysis of solution concepts in sequential games. They are practically modelled by type structures, which allow the analyst to represent the players' hierarchies without specifying an infinite sequence of conditional beliefs. Here, we study type structures that satisfy a "richness" property, called completeness. This property is defined on the type structure alone, without explicit reference to hierarchies of beliefs or other type structures. We provide sufficient conditions under which a complete type structure represents all hierarchies of conditional beliefs. In particular, we present an extension of the main result in Friedenberg (2010) to type structures with conditional beliefs.
&lt;/p&gt;</description></item><item><title>&#36890;&#36807;&#30740;&#31350;&#38646;&#21806;&#36830;&#38145;&#24215;&#30340;&#25968;&#25454;&#65292;&#21457;&#29616;&#22312;&#22810;&#26426;&#26500;&#20225;&#19994;&#20013;&#20998;&#25955;&#24211;&#23384;&#20915;&#31574;&#23548;&#33268;&#20102;&#32463;&#29702;&#20154;&#20043;&#38388;&#30340;&#24322;&#36136;&#24615;&#65292;&#38598;&#20013;&#21270;&#24211;&#23384;&#31649;&#29702;&#21487;&#20197;&#38477;&#20302;&#25104;&#26412;&#65292;&#20294;&#20250;&#21463;&#21040;&#24310;&#36831;&#38656;&#27714;&#20449;&#24687;&#30340;&#36127;&#38754;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2307.05562</link><description>&lt;p&gt;
&#38646;&#21806;&#36830;&#38145;&#24215;&#20013;&#30340;&#20998;&#25955;&#20915;&#31574;&#65306;&#24211;&#23384;&#31649;&#29702;&#30340;&#35777;&#25454;
&lt;/p&gt;
&lt;p&gt;
Decentralized Decision-Making in Retail Chains: Evidence from Inventory Management. (arXiv:2307.05562v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.05562
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#30740;&#31350;&#38646;&#21806;&#36830;&#38145;&#24215;&#30340;&#25968;&#25454;&#65292;&#21457;&#29616;&#22312;&#22810;&#26426;&#26500;&#20225;&#19994;&#20013;&#20998;&#25955;&#24211;&#23384;&#20915;&#31574;&#23548;&#33268;&#20102;&#32463;&#29702;&#20154;&#20043;&#38388;&#30340;&#24322;&#36136;&#24615;&#65292;&#38598;&#20013;&#21270;&#24211;&#23384;&#31649;&#29702;&#21487;&#20197;&#38477;&#20302;&#25104;&#26412;&#65292;&#20294;&#20250;&#21463;&#21040;&#24310;&#36831;&#38656;&#27714;&#20449;&#24687;&#30340;&#36127;&#38754;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#21033;&#29992;&#26469;&#33258;&#19968;&#23478;&#22823;&#22411;&#38646;&#21806;&#36830;&#38145;&#24215;&#30340;&#25968;&#25454;&#65292;&#30740;&#31350;&#20102;&#22312;&#22810;&#26426;&#26500;&#20225;&#19994;&#20013;&#20998;&#25955;&#24211;&#23384;&#20915;&#31574;&#30340;&#24433;&#21709;&#12290;&#36890;&#36807;&#20998;&#26512;&#20004;&#24180;&#30340;&#27599;&#26085;&#25968;&#25454;&#65292;&#25105;&#20204;&#21457;&#29616;634&#20301;&#24215;&#38271;&#22312;&#24211;&#23384;&#20915;&#31574;&#19978;&#23384;&#22312;&#26126;&#26174;&#30340;&#24322;&#36136;&#24615;&#12290;&#36890;&#36807;&#20272;&#35745;&#19968;&#20010;&#21160;&#24577;&#32467;&#26500;&#27169;&#22411;&#65292;&#25105;&#20204;&#25581;&#31034;&#20102;&#32463;&#29702;&#20154;&#35748;&#20026;&#30340;&#25104;&#26412;&#23384;&#22312;&#22823;&#37327;&#30340;&#24322;&#36136;&#24615;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#35266;&#23519;&#21040;&#36825;&#20123;&#35748;&#30693;&#30340;&#24046;&#24322;&#19982;&#32463;&#29702;&#20154;&#30340;&#25945;&#32946;&#21644;&#32463;&#39564;&#20043;&#38388;&#23384;&#22312;&#30456;&#20851;&#24615;&#12290;&#23545;&#29031;&#23454;&#39564;&#34920;&#26126;&#65292;&#38598;&#20013;&#21270;&#24211;&#23384;&#31649;&#29702;&#36890;&#36807;&#28040;&#38500;&#32463;&#29702;&#20154;&#25216;&#33021;&#24322;&#36136;&#24615;&#30340;&#24433;&#21709;&#26469;&#38477;&#20302;&#25104;&#26412;&#12290;&#28982;&#32780;&#65292;&#36825;&#20123;&#22909;&#22788;&#34987;&#24310;&#36831;&#38656;&#27714;&#20449;&#24687;&#30340;&#36127;&#38754;&#24433;&#21709;&#25152;&#25269;&#28040;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper investigates the impact of decentralizing inventory decision-making in multi-establishment firms using data from a large retail chain. Analyzing two years of daily data, we find significant heterogeneity among the inventory decisions made by 634 store managers. By estimating a dynamic structural model, we reveal substantial heterogeneity in managers' perceived costs. Moreover, we observe a correlation between the variance of these perceptions and managers' education and experience. Counterfactual experiments show that centralized inventory management reduces costs by eliminating the impact of managers' skill heterogeneity. However, these benefits are offset by the negative impact of delayed demand information.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#39318;&#27425;&#26126;&#30830;&#21015;&#20030;&#20102;&#22312;$n\leq 7$&#20010;&#36873;&#39033;&#19978;&#30340;&#25152;&#26377;&#26368;&#22823;Condorcet&#39046;&#22495;&#65292;&#36890;&#36807;&#24320;&#21457;&#26032;&#31639;&#27861;&#24182;&#22312;&#36229;&#32423;&#35745;&#31639;&#26426;&#19978;&#23454;&#29616;&#65292;&#35299;&#20915;&#20102;&#31038;&#20250;&#31185;&#23398;&#21644;&#25968;&#23398;&#39046;&#22495;&#30340;&#22810;&#20010;&#26410;&#35299;&#38382;&#39064;&#65292;&#21516;&#26102;&#32473;&#20986;&#20102;&#20851;&#20110;Condorcet&#39046;&#22495;&#23545;&#31216;&#24615;&#30340;&#26032;&#32467;&#26524;&#65292;&#20197;&#21450;&#19982;&#20854;&#20182;&#39046;&#22495;&#31867;&#22411;&#30340;&#32852;&#31995;&#12290;</title><link>http://arxiv.org/abs/2306.15993</link><description>&lt;p&gt;
&#26368;&#22810;&#19971;&#20010;&#36873;&#39033;&#30340;Condorcet&#39046;&#22495;
&lt;/p&gt;
&lt;p&gt;
Condorcet Domains of Degree at most Seven. (arXiv:2306.15993v2 [cs.DM] CROSS LISTED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.15993
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#39318;&#27425;&#26126;&#30830;&#21015;&#20030;&#20102;&#22312;$n\leq 7$&#20010;&#36873;&#39033;&#19978;&#30340;&#25152;&#26377;&#26368;&#22823;Condorcet&#39046;&#22495;&#65292;&#36890;&#36807;&#24320;&#21457;&#26032;&#31639;&#27861;&#24182;&#22312;&#36229;&#32423;&#35745;&#31639;&#26426;&#19978;&#23454;&#29616;&#65292;&#35299;&#20915;&#20102;&#31038;&#20250;&#31185;&#23398;&#21644;&#25968;&#23398;&#39046;&#22495;&#30340;&#22810;&#20010;&#26410;&#35299;&#38382;&#39064;&#65292;&#21516;&#26102;&#32473;&#20986;&#20102;&#20851;&#20110;Condorcet&#39046;&#22495;&#23545;&#31216;&#24615;&#30340;&#26032;&#32467;&#26524;&#65292;&#20197;&#21450;&#19982;&#20854;&#20182;&#39046;&#22495;&#31867;&#22411;&#30340;&#32852;&#31995;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#39318;&#27425;&#26126;&#30830;&#21015;&#20030;&#20102;&#25152;&#26377;&#22312;$n\leq 7$&#20010;&#36873;&#39033;&#19978;&#30340;&#26368;&#22823;Condorcet&#39046;&#22495;&#12290;&#36890;&#36807;&#24320;&#21457;&#19968;&#31181;&#26032;&#30340;&#26500;&#36896;Condorcet&#39046;&#22495;&#30340;&#31639;&#27861;&#65292;&#24182;&#22312;&#36229;&#32423;&#35745;&#31639;&#26426;&#19978;&#23454;&#29616;&#35813;&#31639;&#27861;&#30340;&#36816;&#34892;&#65292;&#25105;&#20204;&#23436;&#25104;&#20102;&#36825;&#19968;&#30446;&#26631;&#12290;&#38543;&#21518;&#65292;&#25105;&#20204;&#23545;&#25152;&#26377;&#26368;&#22823;Condorcet&#39046;&#22495;&#22312;&#24230;&#25968;&#20026;7&#30340;&#24773;&#20917;&#19979;&#30340;&#23646;&#24615;&#36827;&#34892;&#20102;&#39318;&#27425;&#35843;&#26597;&#65292;&#28041;&#21450;&#31038;&#20250;&#31185;&#23398;&#21644;&#25968;&#23398;&#25991;&#29486;&#20013;&#30740;&#31350;&#30340;&#35768;&#22810;&#23646;&#24615;&#12290;&#25105;&#20204;&#36890;&#36807;&#25968;&#25454;&#31034;&#20363;&#21644;&#23450;&#29702;&#35299;&#20915;&#20102;&#20854;&#20182;&#20316;&#32773;&#25552;&#20986;&#30340;&#20960;&#20010;&#26410;&#35299;&#30097;&#38382;&#12290;&#25105;&#20204;&#32473;&#20986;&#20102;&#19968;&#32452;&#20851;&#20110;Condorcet&#39046;&#22495;&#23545;&#31216;&#24615;&#30340;&#26032;&#32467;&#26524;&#65292;&#32479;&#19968;&#20102;&#20043;&#21069;&#30340;&#20316;&#21697;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#35752;&#35770;&#20102;&#19982;&#38750;&#29420;&#35009;&#39046;&#22495;&#21644;&#27867;&#21270;&#30340;&#21333;&#23792;&#39046;&#22495;&#31561;&#20854;&#20182;&#39046;&#22495;&#31867;&#22411;&#30340;&#32852;&#31995;&#12290;&#25105;&#20204;&#36890;&#36807;&#19968;&#20010;&#26032;&#30340;&#32593;&#31449;&#20813;&#36153;&#25552;&#20379;&#25152;&#26377;&#25968;&#25454;&#20379;&#20854;&#20182;&#30740;&#31350;&#32773;&#20351;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this paper we give the first explicit enumeration of all maximal Condorcet domains on $n\leq 7$ alternatives. This has been accomplished by developing a new algorithm for constructing Condorcet domains, and an implementation of that algorithm which has been run on a supercomputer.  We follow this up by the first survey of the properties of all maximal Condorcet domains up to degree 7, with respect to many properties studied in the social sciences and mathematical literature. We resolve several open questions posed by other authors, both by examples from our data and theorems. We give a new set of results on the symmetry properties of Condorcet domains which unify earlier works.  Finally we discuss connections to other domain types such as non-dictatorial domains and generalisations of single-peaked domains. All our data is made freely available for other researches via a new website.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#26368;&#23567;&#21270;&#26399;&#26395;&#31616;&#21333;&#36951;&#25022;&#30340;&#22266;&#23450;&#39044;&#31639;&#26368;&#20248;&#33218;&#35782;&#21035;&#38382;&#39064;&#12290;&#36890;&#36807;&#25512;&#23548;&#26368;&#22351;&#24773;&#20917;&#26399;&#26395;&#31616;&#21333;&#36951;&#25022;&#30340;&#28176;&#36827;&#19979;&#30028;&#65292;&#25552;&#20986;&#20102;&#22522;&#20110;HIR&#20272;&#35745;&#30340;TS-HIR&#31574;&#30053;&#65292;&#35813;&#31574;&#30053;&#22312;&#25512;&#33616;&#26368;&#20248;&#33218;&#26102;&#34920;&#29616;&#20986;&#36817;&#20284;&#26368;&#20248;&#24615;&#12290;</title><link>http://arxiv.org/abs/2302.02988</link><description>&lt;p&gt;
&#28176;&#36827;&#26368;&#20248;&#30340;&#22266;&#23450;&#39044;&#31639;&#26368;&#20248;&#33218;&#35782;&#21035;&#26041;&#27861;&#19982;&#26041;&#24046;&#30456;&#20851;&#30028;&#38480;
&lt;/p&gt;
&lt;p&gt;
Asymptotically Optimal Fixed-Budget Best Arm Identification with Variance-Dependent Bounds. (arXiv:2302.02988v2 [cs.LG] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2302.02988
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#26368;&#23567;&#21270;&#26399;&#26395;&#31616;&#21333;&#36951;&#25022;&#30340;&#22266;&#23450;&#39044;&#31639;&#26368;&#20248;&#33218;&#35782;&#21035;&#38382;&#39064;&#12290;&#36890;&#36807;&#25512;&#23548;&#26368;&#22351;&#24773;&#20917;&#26399;&#26395;&#31616;&#21333;&#36951;&#25022;&#30340;&#28176;&#36827;&#19979;&#30028;&#65292;&#25552;&#20986;&#20102;&#22522;&#20110;HIR&#20272;&#35745;&#30340;TS-HIR&#31574;&#30053;&#65292;&#35813;&#31574;&#30053;&#22312;&#25512;&#33616;&#26368;&#20248;&#33218;&#26102;&#34920;&#29616;&#20986;&#36817;&#20284;&#26368;&#20248;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#26368;&#23567;&#21270;&#26399;&#26395;&#31616;&#21333;&#36951;&#25022;&#30340;&#22266;&#23450;&#39044;&#31639;&#26368;&#20248;&#33218;&#35782;&#21035;&#38382;&#39064;&#12290;&#22312;&#33258;&#36866;&#24212;&#23454;&#39564;&#20013;&#65292;&#20915;&#31574;&#32773;&#26681;&#25454;&#36807;&#21435;&#30340;&#35266;&#27979;&#32467;&#26524;&#36873;&#25321;&#22810;&#20010;&#22788;&#29702;&#33218;&#20043;&#19968;&#65292;&#24182;&#35266;&#23519;&#25152;&#36873;&#25321;&#30340;&#33218;&#30340;&#32467;&#26524;&#12290;&#23454;&#39564;&#32467;&#26463;&#21518;&#65292;&#20915;&#31574;&#32773;&#25512;&#33616;&#26399;&#26395;&#32467;&#26524;&#26368;&#39640;&#30340;&#22788;&#29702;&#33218;&#12290;&#25105;&#20204;&#22522;&#20110;&#26399;&#26395;&#31616;&#21333;&#36951;&#25022;&#35780;&#20272;&#20915;&#31574;&#30340;&#22909;&#22351;&#65292;&#20854;&#23450;&#20041;&#20026;&#26368;&#20248;&#33218;&#30340;&#26399;&#26395;&#32467;&#26524;&#19982;&#25512;&#33616;&#33218;&#30340;&#26399;&#26395;&#32467;&#26524;&#20043;&#24046;&#12290;&#30001;&#20110;&#22266;&#26377;&#30340;&#19981;&#30830;&#23450;&#24615;&#65292;&#25105;&#20204;&#20351;&#29992;&#26497;&#23567;&#26497;&#22823;&#20934;&#21017;&#35780;&#20272;&#36951;&#25022;&#12290;&#39318;&#20808;&#65292;&#25105;&#20204;&#25512;&#23548;&#20102;&#26368;&#22351;&#24773;&#20917;&#26399;&#26395;&#31616;&#21333;&#36951;&#25022;&#30340;&#28176;&#36827;&#19979;&#30028;&#65292;&#35813;&#19979;&#30028;&#30001;&#28508;&#22312;&#32467;&#26524;&#30340;&#26041;&#24046;&#65288;&#20027;&#23548;&#22240;&#32032;&#65289;&#25152;&#30830;&#23450;&#12290;&#22522;&#20110;&#36825;&#20123;&#19979;&#30028;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;Two-Stage (TS)-Hirano-Imbens-Ridder (HIR)&#31574;&#30053;&#65292;&#22312;&#25512;&#33616;&#26368;&#20248;&#33218;&#26102;&#21033;&#29992;HIR&#20272;&#35745;&#65288;Hirano et al., 2003&#65289;&#12290;&#25105;&#20204;&#30340;&#29702;&#35770;&#20998;&#26512;&#34920;&#26126;&#65292;TS-HIR&#31574;&#30053;&#36817;&#20284;&#26159;&#26368;&#20248;&#30340;&#65292;&#24182;&#19988;&#22312;&#19968;&#23450;&#26465;&#20214;&#19979;&#33021;&#36798;&#21040;&#26497;&#23567;&#26497;&#22823;&#20934;&#21017;&#19979;&#30340;&#28176;&#36827;&#26368;&#20248;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
We investigate the problem of fixed-budget best arm identification (BAI) for minimizing expected simple regret. In an adaptive experiment, a decision maker draws one of multiple treatment arms based on past observations and observes the outcome of the drawn arm. After the experiment, the decision maker recommends the treatment arm with the highest expected outcome. We evaluate the decision based on the expected simple regret, which is the difference between the expected outcomes of the best arm and the recommended arm. Due to inherent uncertainty, we evaluate the regret using the minimax criterion. First, we derive asymptotic lower bounds for the worst-case expected simple regret, which are characterized by the variances of potential outcomes (leading factor). Based on the lower bounds, we propose the Two-Stage (TS)-Hirano-Imbens-Ridder (HIR) strategy, which utilizes the HIR estimator (Hirano et al., 2003) in recommending the best arm. Our theoretical analysis shows that the TS-HIR str
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25193;&#23637;&#20102;&#31283;&#20581;PCE&#36890;&#32960;&#27979;&#24230;&#30340;&#33539;&#22260;&#65292;&#24182;&#35780;&#20272;&#20102;&#19981;&#21516;&#20462;&#21098;&#28857;&#30340;&#39044;&#27979;&#24615;&#33021;&#12290;&#23613;&#31649;&#20462;&#21098;&#28857;&#30340;&#36873;&#25321;&#19982;&#26102;&#38388;&#21644;&#30446;&#26631;&#26377;&#20851;&#65292;&#20294;&#26080;&#27861;&#36873;&#25321;&#21333;&#20010;&#31995;&#21015;&#20316;&#20026;&#26368;&#20339;&#39044;&#27979;&#12290;&#21508;&#31181;&#20462;&#21098;&#26041;&#24335;&#30340;&#24179;&#22343;&#39044;&#27979;&#35823;&#24046;&#30456;&#24403;&#65292;&#20294;&#23545;&#20110;&#36235;&#21183;&#36890;&#32960;&#30340;&#39044;&#27979;&#26377;&#25152;&#19981;&#21516;&#65292;&#24314;&#35758;&#20351;&#29992;&#19968;&#32452;&#25509;&#36817;&#26368;&#20339;&#30340;&#20462;&#21098;&#12290;</title><link>http://arxiv.org/abs/2207.12494</link><description>&lt;p&gt;
&#25193;&#23637;&#31283;&#20581;PCE&#36890;&#32960;&#27979;&#24230;&#30340;&#33539;&#22260;
&lt;/p&gt;
&lt;p&gt;
Extending the Range of Robust PCE Inflation Measures. (arXiv:2207.12494v2 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2207.12494
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25193;&#23637;&#20102;&#31283;&#20581;PCE&#36890;&#32960;&#27979;&#24230;&#30340;&#33539;&#22260;&#65292;&#24182;&#35780;&#20272;&#20102;&#19981;&#21516;&#20462;&#21098;&#28857;&#30340;&#39044;&#27979;&#24615;&#33021;&#12290;&#23613;&#31649;&#20462;&#21098;&#28857;&#30340;&#36873;&#25321;&#19982;&#26102;&#38388;&#21644;&#30446;&#26631;&#26377;&#20851;&#65292;&#20294;&#26080;&#27861;&#36873;&#25321;&#21333;&#20010;&#31995;&#21015;&#20316;&#20026;&#26368;&#20339;&#39044;&#27979;&#12290;&#21508;&#31181;&#20462;&#21098;&#26041;&#24335;&#30340;&#24179;&#22343;&#39044;&#27979;&#35823;&#24046;&#30456;&#24403;&#65292;&#20294;&#23545;&#20110;&#36235;&#21183;&#36890;&#32960;&#30340;&#39044;&#27979;&#26377;&#25152;&#19981;&#21516;&#65292;&#24314;&#35758;&#20351;&#29992;&#19968;&#32452;&#25509;&#36817;&#26368;&#20339;&#30340;&#20462;&#21098;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#35780;&#20272;&#20102;1960&#24180;&#33267;2022&#24180;&#20043;&#38388;&#30340;&#19968;&#31995;&#21015;&#31283;&#20581;&#36890;&#32960;&#27979;&#24230;&#30340;&#39044;&#27979;&#24615;&#33021;&#65292;&#21253;&#25324;&#23448;&#26041;&#20013;&#20301;&#25968;&#21644;&#20462;&#21098;&#22343;&#20540;&#20010;&#20154;&#28040;&#36153;&#25903;&#20986;&#36890;&#32960;&#12290;&#24403;&#20462;&#21098;&#25481;&#20855;&#26377;&#26368;&#39640;&#21644;&#26368;&#20302;&#36890;&#32960;&#29575;&#30340;&#19981;&#21516;&#25903;&#20986;&#31867;&#21035;&#26102;&#65292;&#25105;&#20204;&#21457;&#29616;&#26368;&#20339;&#20462;&#21098;&#28857;&#22312;&#19981;&#21516;&#26102;&#38388;&#19978;&#24046;&#24322;&#24456;&#22823;&#65292;&#20063;&#21462;&#20915;&#20110;&#30446;&#26631;&#30340;&#36873;&#25321;&#65307;&#24403;&#30446;&#26631;&#26159;&#26410;&#26469;&#30340;&#36235;&#21183;&#36890;&#32960;&#25110;1970&#24180;&#20195;&#33267;1980&#24180;&#20195;&#30340;&#26679;&#26412;&#26102;&#65292;&#26368;&#20339;&#20462;&#21098;&#28857;&#36739;&#39640;&#12290;&#20196;&#20154;&#24778;&#35766;&#30340;&#26159;&#65292;&#22312;&#39044;&#27979;&#24615;&#33021;&#30340;&#22522;&#30784;&#19978;&#36873;&#25321;&#21333;&#20010;&#31995;&#21015;&#26159;&#27809;&#26377;&#26681;&#25454;&#30340;&#12290;&#21253;&#25324;&#23448;&#26041;&#31283;&#20581;&#27979;&#24230;&#22312;&#20869;&#30340;&#21508;&#31181;&#20462;&#21098;&#22343;&#20855;&#26377;&#24179;&#22343;&#39044;&#27979;&#35823;&#24046;&#65292;&#20351;&#23427;&#20204;&#19982;&#34920;&#29616;&#26368;&#20339;&#30340;&#20462;&#21098;&#19981;&#21487;&#21306;&#20998;&#12290;&#23613;&#31649;&#24179;&#22343;&#35823;&#24046;&#19981;&#21487;&#21306;&#20998;&#65292;&#20294;&#36825;&#20123;&#20462;&#21098;&#22312;&#20219;&#20309;&#32473;&#23450;&#26376;&#20221;&#23545;&#20110;&#36235;&#21183;&#36890;&#32960;&#30340;&#39044;&#27979;&#19981;&#21516;&#65292;&#22312;0.5&#21040;1&#20010;&#30334;&#20998;&#28857;&#33539;&#22260;&#20869;&#65292;&#36825;&#34920;&#26126;&#20351;&#29992;&#19968;&#32452;&#25509;&#36817;&#26368;&#20339;&#30340;&#20462;&#21098;&#12290;
&lt;/p&gt;
&lt;p&gt;
We evaluate the forecasting performance of a wide set of robust inflation measures between 1960 and 2022, including official median and trimmed-mean personal-consumption-expenditure inflation. When trimming out different expenditure categories with the highest and lowest inflation rates, we find that the optimal trim points vary widely across time and also depend on the choice of target; optimal trims are higher when targeting future trend inflation or for a 1970s-1980s subsample. Surprisingly, there are no grounds to select a single series on the basis of forecasting performance. A wide range of trims-including those of the official robust measures-have an average prediction error that makes them statistically indistinguishable from the best-performing trim. Despite indistinguishable average errors, these trims imply different predictions for trend inflation in any given month, within a range of 0.5 to 1 percentage points, suggesting the use of a set of near-optimal trims.
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#22914;&#20309;&#35774;&#35745;&#19968;&#20010;&#24066;&#22330;&#26469;&#24674;&#22797;&#30001;&#26862;&#26519;&#28779;&#28798;&#36896;&#25104;&#30340;&#36164;&#20135;&#25439;&#22833;&#12290;&#30740;&#31350;&#36890;&#36807;&#20998;&#26512;&#30005;&#21147;&#20844;&#21496;&#24341;&#21457;&#28779;&#28798;&#30340;&#21407;&#22240;&#65292;&#24182;&#23558;&#28779;&#28798;&#39118;&#38505;&#32435;&#20837;&#32463;&#27982;&#27169;&#22411;&#20013;&#65292;&#25552;&#20986;&#20102;&#25910;&#21462;&#26862;&#26519;&#28779;&#28798;&#22522;&#37329;&#21644;&#20844;&#24179;&#25910;&#36153;&#30340;&#26041;&#26696;&#65292;&#20197;&#26368;&#22823;&#21270;&#31038;&#20250;&#24433;&#21709;&#21644;&#24635;&#30408;&#20313;&#12290;</title><link>http://arxiv.org/abs/2205.13773</link><description>&lt;p&gt;
&#26862;&#26519;&#28779;&#28798;&#27169;&#22411;&#65306;&#35774;&#35745;&#24066;&#22330;&#20197;&#24674;&#22797;&#36164;&#20135;
&lt;/p&gt;
&lt;p&gt;
Wildfire Modeling: Designing a Market to Restore Assets. (arXiv:2205.13773v3 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2205.13773
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#22914;&#20309;&#35774;&#35745;&#19968;&#20010;&#24066;&#22330;&#26469;&#24674;&#22797;&#30001;&#26862;&#26519;&#28779;&#28798;&#36896;&#25104;&#30340;&#36164;&#20135;&#25439;&#22833;&#12290;&#30740;&#31350;&#36890;&#36807;&#20998;&#26512;&#30005;&#21147;&#20844;&#21496;&#24341;&#21457;&#28779;&#28798;&#30340;&#21407;&#22240;&#65292;&#24182;&#23558;&#28779;&#28798;&#39118;&#38505;&#32435;&#20837;&#32463;&#27982;&#27169;&#22411;&#20013;&#65292;&#25552;&#20986;&#20102;&#25910;&#21462;&#26862;&#26519;&#28779;&#28798;&#22522;&#37329;&#21644;&#20844;&#24179;&#25910;&#36153;&#30340;&#26041;&#26696;&#65292;&#20197;&#26368;&#22823;&#21270;&#31038;&#20250;&#24433;&#21709;&#21644;&#24635;&#30408;&#20313;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#36807;&#21435;&#30340;&#21313;&#24180;&#37324;&#65292;&#22799;&#23395;&#26862;&#26519;&#28779;&#28798;&#24050;&#32463;&#25104;&#20026;&#21152;&#21033;&#31119;&#23612;&#20122;&#21644;&#32654;&#22269;&#30340;&#24120;&#24577;&#12290;&#36825;&#20123;&#28779;&#28798;&#30340;&#21407;&#22240;&#22810;&#31181;&#22810;&#26679;&#12290;&#24030;&#25919;&#24220;&#20250;&#25910;&#21462;&#26862;&#26519;&#28779;&#28798;&#22522;&#37329;&#26469;&#24110;&#21161;&#21463;&#28798;&#20154;&#21592;&#12290;&#28982;&#32780;&#65292;&#22522;&#37329;&#21482;&#22312;&#29305;&#23450;&#26465;&#20214;&#19979;&#21457;&#25918;&#65292;&#24182;&#19988;&#22312;&#25972;&#20010;&#21152;&#21033;&#31119;&#23612;&#20122;&#24030;&#22343;&#21248;&#25910;&#21462;&#12290;&#22240;&#27492;&#65292;&#35813;&#39033;&#30446;&#30340;&#25972;&#20307;&#24605;&#36335;&#26159;&#23547;&#25214;&#20851;&#20110;&#30005;&#21147;&#20844;&#21496;&#22914;&#20309;&#24341;&#21457;&#28779;&#28798;&#20197;&#21450;&#22914;&#20309;&#24110;&#21161;&#25910;&#21462;&#26862;&#26519;&#28779;&#28798;&#22522;&#37329;&#25110;&#32773;&#20844;&#24179;&#25910;&#36153;&#20197;&#26368;&#22823;&#38480;&#24230;&#22320;&#23454;&#29616;&#31038;&#20250;&#24433;&#21709;&#30340;&#25968;&#37327;&#32467;&#26524;&#12290;&#35813;&#30740;&#31350;&#39033;&#30446;&#26088;&#22312;&#25552;&#20986;&#19982;&#26893;&#34987;&#12289;&#36755;&#30005;&#32447;&#36335;&#30456;&#20851;&#30340;&#26862;&#26519;&#28779;&#28798;&#39118;&#38505;&#65292;&#24182;&#23558;&#20854;&#19982;&#37329;&#38065;&#25346;&#38057;&#12290;&#22240;&#27492;&#65292;&#35813;&#39033;&#30446;&#26377;&#21161;&#20110;&#35299;&#20915;&#19982;&#27599;&#20010;&#22320;&#28857;&#30456;&#20851;&#30340;&#26862;&#26519;&#28779;&#28798;&#22522;&#37329;&#25910;&#21462;&#38382;&#39064;&#65292;&#24182;&#32467;&#21512;&#33021;&#28304;&#20215;&#26684;&#26681;&#25454;&#22320;&#28857;&#30340;&#26862;&#26519;&#28779;&#28798;&#39118;&#38505;&#21521;&#23458;&#25143;&#25910;&#36153;&#65292;&#20197;&#23454;&#29616;&#31038;&#20250;&#30340;&#24635;&#30408;&#20313;&#26368;&#22823;&#21270;&#12290;
&lt;/p&gt;
&lt;p&gt;
In the past decade, summer wildfires have become the norm in California, and the United States of America. These wildfires are caused due to variety of reasons. The state collects wildfire funds to help the impacted customers. However, the funds are eligible only under certain conditions and are collected uniformly throughout California. Therefore, the overall idea of this project is to look for quantitative results on how electrical corporations cause wildfires and how they can help to collect the wildfire funds or charge fairly to the customers to maximize the social impact. The research project aims to propose the implication of wildfire risk associated with vegetation, and due to power lines and incorporate that in dollars. Therefore, the project helps to solve the problem of collecting wildfire funds associated with each location and incorporate energy prices to charge their customers according to their wildfire risk related to the location to maximize the social surplus for the s
&lt;/p&gt;</description></item><item><title>&#32654;&#22269;&#38646;&#21806;&#19994;&#38598;&#20013;&#24230;&#36817;&#24180;&#26469;&#21576;&#29616;&#22686;&#21152;&#36235;&#21183;&#65292;&#22823;&#37096;&#20998;&#30001;&#22810;&#24066;&#22330;&#20225;&#19994;&#36827;&#20837;&#26032;&#24066;&#22330;&#23548;&#33268;&#65292;&#26412;&#22320;&#24066;&#22330;&#20221;&#39069;&#22686;&#21152;&#20063;&#22312;1997&#24180;&#33267;2007&#24180;&#38388;&#21464;&#24471;&#26356;&#21152;&#37325;&#35201;&#12290;&#26412;&#22320;&#38598;&#20013;&#24230;&#30340;&#22686;&#21152;&#35299;&#37322;&#20102;&#25972;&#20307;&#38144;&#21806;&#22686;&#38271;&#30340;&#22235;&#20998;&#20043;&#19968;&#21040;&#19977;&#20998;&#20043;&#19968;&#12290;</title><link>http://arxiv.org/abs/2202.07609</link><description>&lt;p&gt;
&#32654;&#22269;&#38646;&#21806;&#19994;&#38598;&#20013;&#24230;&#30340;&#28436;&#21464;
&lt;/p&gt;
&lt;p&gt;
The Evolution of U.S. Retail Concentration. (arXiv:2202.07609v3 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2202.07609
&lt;/p&gt;
&lt;p&gt;
&#32654;&#22269;&#38646;&#21806;&#19994;&#38598;&#20013;&#24230;&#36817;&#24180;&#26469;&#21576;&#29616;&#22686;&#21152;&#36235;&#21183;&#65292;&#22823;&#37096;&#20998;&#30001;&#22810;&#24066;&#22330;&#20225;&#19994;&#36827;&#20837;&#26032;&#24066;&#22330;&#23548;&#33268;&#65292;&#26412;&#22320;&#24066;&#22330;&#20221;&#39069;&#22686;&#21152;&#20063;&#22312;1997&#24180;&#33267;2007&#24180;&#38388;&#21464;&#24471;&#26356;&#21152;&#37325;&#35201;&#12290;&#26412;&#22320;&#38598;&#20013;&#24230;&#30340;&#22686;&#21152;&#35299;&#37322;&#20102;&#25972;&#20307;&#38144;&#21806;&#22686;&#38271;&#30340;&#22235;&#20998;&#20043;&#19968;&#21040;&#19977;&#20998;&#20043;&#19968;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#32654;&#22269;&#30340;&#20135;&#19994;&#21160;&#24577;&#20013;&#65292;&#22269;&#23478;&#38598;&#20013;&#24230;&#30340;&#22686;&#21152;&#26159;&#19968;&#20010;&#26174;&#33879;&#29305;&#24449;&#65292;&#20063;&#24341;&#36215;&#20102;&#23545;&#24066;&#22330;&#21147;&#37327;&#22686;&#38271;&#30340;&#25285;&#24551;&#12290;&#28982;&#32780;&#65292;&#23545;&#20110;&#24066;&#22330;&#21147;&#37327;&#24773;&#20917;&#65292;&#26412;&#22320;&#36235;&#21183;&#21487;&#33021;&#26356;&#20855;&#20449;&#24687;&#37327;&#65292;&#29305;&#21035;&#26159;&#22312;&#38646;&#21806;&#37096;&#38376;&#65292;&#28040;&#36153;&#32773;&#36890;&#24120;&#22312;&#38468;&#36817;&#30340;&#21830;&#24215;&#36141;&#29289;&#12290;&#25105;&#20204;&#20351;&#29992;&#26032;&#22411;&#26222;&#26597;&#25968;&#25454;&#65292;&#35266;&#23519;&#20102;1992&#24180;&#33267;2012&#24180;&#38388;&#25152;&#26377;&#32654;&#22269;&#38646;&#21806;&#24215;&#20135;&#21697;&#32423;&#25910;&#20837;&#30340;&#26412;&#22320;&#38598;&#20013;&#24230;&#19982;&#22269;&#23478;&#38598;&#20013;&#24230;&#20960;&#20046;&#21516;&#27493;&#22686;&#21152;&#12290;&#38598;&#20013;&#24230;&#30340;&#22686;&#21152;&#24191;&#27867;&#24433;&#21709;&#22823;&#22810;&#25968;&#24066;&#22330;&#12289;&#20135;&#21697;&#21644;&#38646;&#21806;&#34892;&#19994;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#22810;&#24066;&#22330;&#20225;&#19994;&#36827;&#20837;&#26032;&#24066;&#22330;&#35299;&#37322;&#20102;&#22269;&#23478;&#38646;&#21806;&#38598;&#20013;&#24230;&#30340;&#22823;&#37096;&#20998;&#22686;&#38271;&#65292;&#32780;&#36890;&#36807;&#22686;&#21152;&#26412;&#22320;&#24066;&#22330;&#20221;&#39069;&#36827;&#34892;&#30340;&#25972;&#21512;&#22312;1997&#24180;&#33267;2007&#24180;&#38388;&#21464;&#24471;&#36234;&#26469;&#36234;&#37325;&#35201;&#65292;&#32780;&#21333;&#24066;&#22330;&#20225;&#19994;&#30340;&#20316;&#29992;&#24494;&#19981;&#36275;&#36947;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#21457;&#29616;&#26412;&#22320;&#38598;&#20013;&#24230;&#30340;&#22686;&#21152;&#21487;&#20197;&#35299;&#37322;&#25972;&#20307;&#38144;&#21806;&#22686;&#38271;&#30340;&#22235;&#20998;&#20043;&#19968;&#21040;&#19977;&#20998;&#20043;&#19968;&#12290;
&lt;/p&gt;
&lt;p&gt;
Increases in national concentration have been a salient feature of industry dynamics in the U.S. and have contributed to concerns about increasing market power. Yet, local trends may be more informative about market power, particularly in the retail sector where consumers have traditionally shopped at nearby stores. We find that local concentration has increased almost in parallel with national concentration using novel Census data on product-level revenue for all U.S. retail stores between 1992 and 2012. The increases in concentration are broad based, affecting most markets, products, and retail industries. We show that the expansion of multi-market firms into new markets explains most of the increase in national retail concentration, with consolidation via increases in local market shares increasing in importance between 1997 and 2007, and single-market firms playing a negligible role. Finally, we find that increases in local concentration can explain one-quarter to one-third of the 
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#30740;&#31350;&#20102;&#24403;&#27835;&#30103;&#34987;&#35823;&#20998;&#31867;&#26102;&#30340;&#36793;&#38469;&#22788;&#29702;&#25928;&#24212;&#65292;&#24182;&#36890;&#36807;&#20998;&#26512;&#24052;&#35199;&#30340;&#19978;&#35785;&#36807;&#31243;&#20013;&#23545;&#20877;&#29359;&#29575;&#30340;&#24433;&#21709;&#26469;&#35828;&#26126;&#12290;&#32467;&#26524;&#26174;&#31034;&#65292;&#35823;&#20998;&#31867;&#20559;&#24046;&#21487;&#33021;&#30456;&#24403;&#22823;&#65292;&#20294;&#30028;&#38480;&#21253;&#21547;&#20102;&#27491;&#30830;&#20272;&#35745;&#30340;&#25928;&#24212;&#12290;</title><link>http://arxiv.org/abs/2106.00536</link><description>&lt;p&gt;
&#29359;&#32618;&#21644;&#35823;&#27979;&#37327;&#30340;&#24809;&#32602;&#65306;&#35823;&#20998;&#31867;&#19979;&#30340;&#36793;&#38469;&#22788;&#29702;&#25928;&#24212;
&lt;/p&gt;
&lt;p&gt;
Crime and Mismeasured Punishment: Marginal Treatment Effect with Misclassification. (arXiv:2106.00536v7 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2106.00536
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#30740;&#31350;&#20102;&#24403;&#27835;&#30103;&#34987;&#35823;&#20998;&#31867;&#26102;&#30340;&#36793;&#38469;&#22788;&#29702;&#25928;&#24212;&#65292;&#24182;&#36890;&#36807;&#20998;&#26512;&#24052;&#35199;&#30340;&#19978;&#35785;&#36807;&#31243;&#20013;&#23545;&#20877;&#29359;&#29575;&#30340;&#24433;&#21709;&#26469;&#35828;&#26126;&#12290;&#32467;&#26524;&#26174;&#31034;&#65292;&#35823;&#20998;&#31867;&#20559;&#24046;&#21487;&#33021;&#30456;&#24403;&#22823;&#65292;&#20294;&#30028;&#38480;&#21253;&#21547;&#20102;&#27491;&#30830;&#20272;&#35745;&#30340;&#25928;&#24212;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24403;&#27835;&#30103;&#34987;&#35823;&#20998;&#31867;&#26102;&#65292;&#25105;&#37096;&#20998;&#30830;&#23450;&#20102;&#36793;&#38469;&#22788;&#29702;&#25928;&#24212;&#65288;MTE&#65289;&#12290;&#25105;&#30740;&#31350;&#20102;&#20004;&#20010;&#38480;&#21046;&#26465;&#20214;&#65292;&#20801;&#35768;&#24037;&#20855;&#21644;&#35823;&#20998;&#31867;&#20915;&#31574;&#20043;&#38388;&#30340;&#20381;&#36182;&#20851;&#31995;&#12290;&#22914;&#26524;&#20542;&#21521;&#20998;&#25968;&#30340;&#23548;&#25968;&#31526;&#21495;&#30456;&#31561;&#65292;&#25105;&#21487;&#20197;&#30830;&#23450;MTE&#30340;&#31526;&#21495;&#12290;&#22914;&#26524;&#36825;&#20123;&#23548;&#25968;&#30456;&#20284;&#65292;&#25105;&#21487;&#20197;&#30028;&#23450;MTE&#12290;&#20026;&#20102;&#35828;&#26126;&#36825;&#19968;&#28857;&#65292;&#25105;&#20998;&#26512;&#20102;&#22312;&#24052;&#35199;&#30340;&#19978;&#35785;&#36807;&#31243;&#20013;&#29983;&#25104;&#35823;&#20998;&#31867;&#30340;&#24773;&#20917;&#19979;&#65292;&#19981;&#21516;&#21009;&#32602;&#26041;&#24335;&#65288;&#32602;&#27454;&#21644;&#31038;&#21306;&#26381;&#21153;&#19982;&#26080;&#22788;&#32602;&#65289;&#23545;&#20877;&#29359;&#29575;&#30340;&#24433;&#21709;&#12290;&#20272;&#35745;&#30340;&#35823;&#20998;&#31867;&#20559;&#24046;&#21487;&#33021;&#30456;&#24403;&#20110;&#26368;&#22823;&#21487;&#33021;MTE&#30340;10%&#65292;&#32780;&#30028;&#38480;&#21253;&#21547;&#20102;&#27491;&#30830;&#20272;&#35745;&#30340;MTE&#12290;
&lt;/p&gt;
&lt;p&gt;
I partially identify the marginal treatment effect (MTE) when the treatment is misclassified. I explore two restrictions, allowing for dependence between the instrument and the misclassification decision. If the signs of the derivatives of the propensity scores are equal, I identify the MTE sign. If those derivatives are similar, I bound the MTE. To illustrate, I analyze the impact of alternative sentences (fines and community service v. no punishment) on recidivism in Brazil, where Appeals processes generate misclassification. The estimated misclassification bias may be as large as 10% of the largest possible MTE, and the bounds contain the correctly estimated MTE.
&lt;/p&gt;</description></item></channel></rss>