<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#25552;&#20986;&#20102;&#22522;&#20110;&#36125;&#21494;&#26031;&#21452;&#23618;&#31232;&#30095;&#32452;&#22238;&#24402;&#30340;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#65292;&#21487;&#20197;&#36827;&#34892;&#39640;&#32500;&#23439;&#35266;&#32463;&#27982;&#39044;&#27979;&#65292;&#24182;&#19988;&#29702;&#35770;&#35777;&#26126;&#20854;&#20855;&#26377;&#26368;&#23567;&#26497;&#38480;&#36895;&#29575;&#30340;&#25910;&#32553;&#24615;&#65292;&#33021;&#22815;&#24674;&#22797;&#27169;&#22411;&#21442;&#25968;&#65292;&#25903;&#25345;&#38598;&#21253;&#21547;&#27169;&#22411;&#30340;&#25903;&#25345;&#38598;&#12290;</title><link>https://arxiv.org/abs/2404.02671</link><description>&lt;p&gt;
&#22522;&#20110;&#36125;&#21494;&#26031;&#21452;&#23618;&#31232;&#30095;&#32452;&#22238;&#24402;&#30340;&#23439;&#35266;&#32463;&#27982;&#39044;&#27979;
&lt;/p&gt;
&lt;p&gt;
Bayesian Bi-level Sparse Group Regressions for Macroeconomic Forecasting
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2404.02671
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#22522;&#20110;&#36125;&#21494;&#26031;&#21452;&#23618;&#31232;&#30095;&#32452;&#22238;&#24402;&#30340;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#65292;&#21487;&#20197;&#36827;&#34892;&#39640;&#32500;&#23439;&#35266;&#32463;&#27982;&#39044;&#27979;&#65292;&#24182;&#19988;&#29702;&#35770;&#35777;&#26126;&#20854;&#20855;&#26377;&#26368;&#23567;&#26497;&#38480;&#36895;&#29575;&#30340;&#25910;&#32553;&#24615;&#65292;&#33021;&#22815;&#24674;&#22797;&#27169;&#22411;&#21442;&#25968;&#65292;&#25903;&#25345;&#38598;&#21253;&#21547;&#27169;&#22411;&#30340;&#25903;&#25345;&#38598;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#65292;&#22312;&#24050;&#30693;&#20855;&#26377;&#32452;&#32467;&#26500;&#30340;&#21327;&#21464;&#37327;&#30340;&#39640;&#32500;&#35774;&#32622;&#20013;&#36827;&#34892;&#26368;&#20248;&#23439;&#35266;&#32463;&#27982;&#39044;&#27979;&#12290;&#25105;&#20204;&#30340;&#27169;&#22411;&#28085;&#30422;&#20102;&#35768;&#22810;&#26102;&#38388;&#24207;&#21015;&#12289;&#28151;&#21512;&#39057;&#29575;&#21644;&#26410;&#30693;&#38750;&#32447;&#24615;&#30340;&#39044;&#27979;&#35774;&#32622;&#12290;&#25105;&#20204;&#24341;&#20837;&#20102;&#26102;&#38388;&#24207;&#21015;&#35745;&#37327;&#32463;&#27982;&#23398;&#20013;&#30340;&#21452;&#23618;&#31232;&#30095;&#27010;&#24565;&#65292;&#21363;&#31232;&#30095;&#24615;&#22312;&#32452;&#27700;&#24179;&#21644;&#32452;&#20869;&#22343;&#25104;&#31435;&#65292;&#25105;&#20204;&#20551;&#35774;&#30495;&#23454;&#27169;&#22411;&#31526;&#21512;&#36825;&#19968;&#20551;&#35774;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#24341;&#36215;&#21452;&#23618;&#31232;&#30095;&#24615;&#30340;&#20808;&#39564;&#65292;&#30456;&#24212;&#30340;&#21518;&#39564;&#20998;&#24067;&#34987;&#35777;&#26126;&#20197;&#26368;&#23567;&#26497;&#38480;&#36895;&#29575;&#25910;&#32553;&#65292;&#24674;&#22797;&#27169;&#22411;&#21442;&#25968;&#65292;&#24182;&#19988;&#20854;&#25903;&#25345;&#38598;&#22312;&#28176;&#36817;&#19978;&#21253;&#21547;&#27169;&#22411;&#30340;&#25903;&#25345;&#38598;&#12290;&#25105;&#20204;&#30340;&#29702;&#35770;&#20801;&#35768;&#32452;&#38388;&#30456;&#20851;&#24615;&#65292;&#32780;&#21516;&#19968;&#32452;&#20013;&#30340;&#39044;&#27979;&#21464;&#37327;&#21487;&#20197;&#36890;&#36807;&#24378;&#30456;&#20851;&#24615;&#20197;&#21450;&#20849;&#21516;&#29305;&#24449;&#21644;&#27169;&#24335;&#36827;&#34892;&#34920;&#24449;&#12290;&#36890;&#36807;&#20840;&#38754;&#23637;&#31034;&#26377;&#38480;&#26679;&#26412;&#30340;&#24615;&#33021;&#26469;&#35828;&#26126;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2404.02671v1 Announce Type: new  Abstract: We propose a Machine Learning approach for optimal macroeconomic forecasting in a high-dimensional setting with covariates presenting a known group structure. Our model encompasses forecasting settings with many series, mixed frequencies, and unknown nonlinearities. We introduce in time-series econometrics the concept of bi-level sparsity, i.e. sparsity holds at both the group level and within groups, and we assume the true model satisfies this assumption. We propose a prior that induces bi-level sparsity, and the corresponding posterior distribution is demonstrated to contract at the minimax-optimal rate, recover the model parameters, and have a support that includes the support of the model asymptotically. Our theory allows for correlation between groups, while predictors in the same group can be characterized by strong covariation as well as common characteristics and patterns. Finite sample performance is illustrated through comprehe
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#36890;&#36807;&#20840;&#29699;&#20803;&#20998;&#26512;&#24471;&#20986;&#65292;&#29983;&#24577;&#31995;&#32479;&#26381;&#21153;&#30456;&#23545;&#20215;&#26684;&#27599;&#24180;&#32422;&#20026;2.2%&#65292;&#29992;&#20110;&#20844;&#20849;&#39033;&#30446;&#35780;&#20272;&#21644;&#29615;&#22659;&#32463;&#27982;&#20250;&#35745;&#20013;&#30340;&#35843;&#25972;&#12290;</title><link>http://arxiv.org/abs/2308.04400</link><description>&lt;p&gt;
&#26377;&#38480;&#30340;&#26367;&#20195;&#24615;&#12289;&#30456;&#23545;&#20215;&#26684;&#21464;&#21160;&#19982;&#20844;&#20849;&#33258;&#28982;&#36164;&#26412;&#20215;&#20540;&#30340;&#25552;&#21319;
&lt;/p&gt;
&lt;p&gt;
Limited substitutability, relative price changes and the uplifting of public natural capital values. (arXiv:2308.04400v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.04400
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#36890;&#36807;&#20840;&#29699;&#20803;&#20998;&#26512;&#24471;&#20986;&#65292;&#29983;&#24577;&#31995;&#32479;&#26381;&#21153;&#30456;&#23545;&#20215;&#26684;&#27599;&#24180;&#32422;&#20026;2.2%&#65292;&#29992;&#20110;&#20844;&#20849;&#39033;&#30446;&#35780;&#20272;&#21644;&#29615;&#22659;&#32463;&#27982;&#20250;&#35745;&#20013;&#30340;&#35843;&#25972;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38543;&#30528;&#20840;&#29699;&#32463;&#27982;&#30340;&#19981;&#26029;&#22686;&#38271;&#65292;&#29983;&#24577;&#31995;&#32479;&#26381;&#21153;&#24448;&#24448;&#20572;&#28382;&#25110;&#20943;&#23569;&#12290;&#32463;&#27982;&#23398;&#29702;&#35770;&#24050;&#32463;&#25581;&#31034;&#20102;&#22914;&#20309;&#23558;&#36825;&#31181;&#30456;&#23545;&#31232;&#32570;&#24615;&#30340;&#36716;&#21464;&#21453;&#26144;&#21040;&#20844;&#20849;&#39033;&#30446;&#35780;&#20272;&#21644;&#29615;&#22659;&#32463;&#27982;&#20250;&#35745;&#20013;&#65292;&#20294;&#32570;&#20047;&#23454;&#35777;&#35777;&#25454;&#26469;&#23558;&#29702;&#35770;&#20184;&#35832;&#23454;&#36341;&#12290;&#20026;&#20102;&#20272;&#35745;&#21487;&#29992;&#20110;&#36827;&#34892;&#27492;&#31867;&#35843;&#25972;&#30340;&#29983;&#24577;&#31995;&#32479;&#26381;&#21153;&#30456;&#23545;&#20215;&#26684;&#21464;&#21270;&#65292;&#25105;&#20204;&#23545;&#29615;&#22659;&#20215;&#20540;&#35780;&#20272;&#30740;&#31350;&#36827;&#34892;&#20102;&#20840;&#29699;&#20803;&#20998;&#26512;&#65292;&#20197;&#25512;&#23548;&#20986;&#24847;&#24895;&#25903;&#20184;&#25910;&#20837;&#24377;&#24615;&#20316;&#20026;&#26377;&#38480;&#26367;&#20195;&#24615;&#31243;&#24230;&#30340;&#20195;&#29702;&#12290;&#22522;&#20110;749&#20010;&#25910;&#20837;-&#24847;&#24895;&#25903;&#20184;&#23545;&#65292;&#25105;&#20204;&#20272;&#35745;&#24847;&#24895;&#25903;&#20184;&#25910;&#20837;&#24377;&#24615;&#32422;&#20026;0.78&#65288;95-CI&#65306;0.6&#33267;1.0&#65289;&#12290;&#23558;&#36825;&#20123;&#32467;&#26524;&#19982;&#29983;&#24577;&#31995;&#32479;&#26381;&#21153;&#30456;&#23545;&#31232;&#32570;&#24615;&#21464;&#21270;&#30340;&#20840;&#29699;&#25968;&#25454;&#38598;&#32467;&#21512;&#36215;&#26469;&#65292;&#25105;&#20204;&#20272;&#35745;&#29983;&#24577;&#31995;&#32479;&#26381;&#21153;&#30456;&#23545;&#20215;&#26684;&#27599;&#24180;&#32422;&#20026;2.2&#65285;&#12290;&#22312;&#23545;&#38750;&#26408;&#26448;&#26519;&#29983;&#24577;&#31995;&#32479;&#30340;&#33258;&#28982;&#36164;&#26412;&#20272;&#20540;&#20013;&#24212;&#29992;&#20102;&#36825;&#20123;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
As the global economy continues to grow, ecosystem services tend to stagnate or degrow. Economic theory has shown how such shifts in relative scarcities can be reflected in the appraisal of public projects and environmental-economic accounting, but empirical evidence has been lacking to put the theory into practice. To estimate the relative price change in ecosystem services that can be used to make such adjustments, we perform a global meta-analysis of environmental valuation studies to derive income elasticities of willingness to pay (WTP) for ecosystem services as a proxy for the degree of limited substitutability. Based on 749 income-WTP pairs, we estimate an income elasticity of WTP of around 0.78 (95-CI: 0.6 to 1.0). Combining these results with a global data set on shifts in the relative scarcity of ecosystem services, we estimate relative price change of ecosystem services of around 2.2 percent per year. In an application to natural capital valuation of non-timber forest ecosys
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#23454;&#38469;&#19978;&#26159;&#22522;&#20110;&#23725;&#22238;&#24402;&#30340;&#26102;&#21464;&#21442;&#25968;&#27169;&#22411;&#65292;&#36825;&#27604;&#20256;&#32479;&#30340;&#29366;&#24577;&#31354;&#38388;&#26041;&#27861;&#35745;&#31639;&#26356;&#24555;&#65292;&#35843;&#25972;&#26356;&#23481;&#26131;&#65292;&#26377;&#21161;&#20110;&#30740;&#31350;&#32463;&#27982;&#32467;&#26500;&#24615;&#21464;&#21270;&#12290;</title><link>http://arxiv.org/abs/2009.00401</link><description>&lt;p&gt;
&#20351;&#29992;&#23725;&#22238;&#24402;&#27861;&#30340;&#26102;&#21464;&#21442;&#25968;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
Time-Varying Parameters as Ridge Regressions. (arXiv:2009.00401v3 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2009.00401
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#23454;&#38469;&#19978;&#26159;&#22522;&#20110;&#23725;&#22238;&#24402;&#30340;&#26102;&#21464;&#21442;&#25968;&#27169;&#22411;&#65292;&#36825;&#27604;&#20256;&#32479;&#30340;&#29366;&#24577;&#31354;&#38388;&#26041;&#27861;&#35745;&#31639;&#26356;&#24555;&#65292;&#35843;&#25972;&#26356;&#23481;&#26131;&#65292;&#26377;&#21161;&#20110;&#30740;&#31350;&#32463;&#27982;&#32467;&#26500;&#24615;&#21464;&#21270;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26102;&#21464;&#21442;&#25968;&#27169;&#22411;(TVPs)&#32463;&#24120;&#34987;&#29992;&#20110;&#32463;&#27982;&#23398;&#20013;&#26469;&#25429;&#25417;&#32467;&#26500;&#24615;&#21464;&#21270;&#12290;&#25105;&#24378;&#35843;&#20102;&#19968;&#20010;&#34987;&#24573;&#35270;&#30340;&#20107;&#23454;&#8212;&#8212;&#36825;&#20123;&#23454;&#38469;&#19978;&#26159;&#23725;&#22238;&#24402;&#12290;&#36825;&#20351;&#24471;&#35745;&#31639;&#12289;&#35843;&#25972;&#21644;&#23454;&#29616;&#27604;&#29366;&#24577;&#31354;&#38388;&#33539;&#24335;&#26356;&#23481;&#26131;&#12290;&#22312;&#39640;&#32500;&#24773;&#20917;&#19979;&#65292;&#35299;&#20915;&#31561;&#20215;&#30340;&#21452;&#37325;&#23725;&#38382;&#39064;&#30340;&#35745;&#31639;&#38750;&#24120;&#24555;,&#20851;&#38190;&#30340;&#8220;&#26102;&#38388;&#21464;&#21270;&#37327;&#8221;&#36890;&#24120;&#26159;&#30001;&#20132;&#21449;&#39564;&#35777;&#26469;&#35843;&#25972;&#30340;&#12290;&#20351;&#29992;&#20004;&#27493;&#22238;&#24402;&#23725;&#22238;&#24402;&#26469;&#22788;&#29702;&#19981;&#26029;&#21464;&#21270;&#30340;&#27874;&#21160;&#24615;&#12290;&#25105;&#32771;&#34385;&#20102;&#22522;&#20110;&#31232;&#30095;&#24615;(&#31639;&#27861;&#36873;&#25321;&#21738;&#20123;&#21442;&#25968;&#21464;&#21270;, &#21738;&#20123;&#19981;&#21464;)&#21644;&#38477;&#20302;&#31209;&#32422;&#26463;&#30340;&#25193;&#23637;(&#21464;&#21270;&#19982;&#22240;&#23376;&#27169;&#22411;&#30456;&#20851;&#32852;)&#12290;&#20026;&#20102;&#23637;&#31034;&#36825;&#31181;&#26041;&#27861;&#30340;&#26377;&#29992;&#24615;, &#25105;&#20351;&#29992;&#23427;&#26469;&#30740;&#31350;&#21152;&#25343;&#22823;&#36135;&#24065;&#25919;&#31574;&#30340;&#28436;&#21464;, &#24182;&#20351;&#29992;&#22823;&#35268;&#27169;&#26102;&#21464;&#23616;&#37096;&#25237;&#24433;&#20272;&#35745;&#32422;4600&#20010;TVPs, &#36825;&#19968;&#20219;&#21153;&#23436;&#20840;&#21487;&#20197;&#21033;&#29992;&#36825;&#31181;&#26032;&#26041;&#27861;&#23436;&#25104;&#12290;
&lt;/p&gt;
&lt;p&gt;
Time-varying parameters (TVPs) models are frequently used in economics to capture structural change. I highlight a rather underutilized fact -- that these are actually ridge regressions. Instantly, this makes computations, tuning, and implementation much easier than in the state-space paradigm. Among other things, solving the equivalent dual ridge problem is computationally very fast even in high dimensions, and the crucial "amount of time variation" is tuned by cross-validation. Evolving volatility is dealt with using a two-step ridge regression. I consider extensions that incorporate sparsity (the algorithm selects which parameters vary and which do not) and reduced-rank restrictions (variation is tied to a factor model). To demonstrate the usefulness of the approach, I use it to study the evolution of monetary policy in Canada using large time-varying local projections. The application requires the estimation of about 4600 TVPs, a task well within the reach of the new method.
&lt;/p&gt;</description></item></channel></rss>