<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#26412;&#30740;&#31350;&#25506;&#31350;&#20102;&#21334;&#23478;&#19982;&#20080;&#23478;&#30340;&#20215;&#20540;&#30456;&#20114;&#20381;&#36182;&#30340;&#24773;&#20917;&#19979;&#65292;&#36890;&#36807;&#20449;&#24687;&#35774;&#35745;&#21644;&#36870;&#21521;&#36873;&#25321;&#26426;&#21046;&#23454;&#29616;&#25910;&#30410;&#30340;&#38382;&#39064;&#65292;&#24403;&#20986;&#29616;&#23436;&#20840;&#23849;&#28291;&#21644;&#26592;&#27308;&#24066;&#22330;&#31561;&#29305;&#27530;&#24773;&#20917;&#26102;&#65292;&#20080;&#23478;&#21487;&#20197;&#24471;&#21040;&#25972;&#20010;&#21097;&#20313;&#20215;&#20540;&#12290;</title><link>http://arxiv.org/abs/2305.02994</link><description>&lt;p&gt;
&#26592;&#27308;&#21046;&#25104;&#26592;&#27308;&#27700;&#65306;&#20449;&#24687;&#35774;&#35745;&#19982;&#36870;&#21521;&#36873;&#25321;
&lt;/p&gt;
&lt;p&gt;
Lemonade from Lemons: Information Design and Adverse Selection. (arXiv:2305.02994v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.02994
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25506;&#31350;&#20102;&#21334;&#23478;&#19982;&#20080;&#23478;&#30340;&#20215;&#20540;&#30456;&#20114;&#20381;&#36182;&#30340;&#24773;&#20917;&#19979;&#65292;&#36890;&#36807;&#20449;&#24687;&#35774;&#35745;&#21644;&#36870;&#21521;&#36873;&#25321;&#26426;&#21046;&#23454;&#29616;&#25910;&#30410;&#30340;&#38382;&#39064;&#65292;&#24403;&#20986;&#29616;&#23436;&#20840;&#23849;&#28291;&#21644;&#26592;&#27308;&#24066;&#22330;&#31561;&#29305;&#27530;&#24773;&#20917;&#26102;&#65292;&#20080;&#23478;&#21487;&#20197;&#24471;&#21040;&#25972;&#20010;&#21097;&#20313;&#20215;&#20540;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#19968;&#20010;&#21334;&#23478;&#23545;&#20110;&#19968;&#20214;&#29289;&#21697;&#20844;&#24067;&#19968;&#20010;&#20215;&#26684;&#12290;&#21334;&#23478;&#19982;&#20080;&#23478;&#30340;&#20215;&#20540;&#21487;&#33021;&#30456;&#20114;&#20381;&#36182;&#12290;&#25105;&#20204;&#21051;&#30011;&#20102;&#25152;&#26377;&#20449;&#24687;&#32467;&#26500;&#20013;&#25910;&#30410;&#21521;&#37327;&#30340;&#38598;&#21512;&#12290;&#31616;&#21333;&#30340;&#21487;&#34892;&#24615;&#21644;&#20010;&#20154;&#21512;&#29702;&#24615;&#38480;&#21046;&#35782;&#21035;&#20102;&#25910;&#30410;&#38598;&#12290;&#20080;&#23478;&#21487;&#20197;&#33719;&#24471;&#25972;&#20010;&#21097;&#20313;&#20215;&#20540;&#12290;&#36890;&#24120;&#24773;&#20917;&#19979;&#65292;&#20854;&#20182;&#26426;&#21046;&#19981;&#33021;&#25193;&#22823;&#25910;&#30410;&#38598;&#12290;&#25105;&#20204;&#36824;&#30740;&#31350;&#20102;&#22312;&#20080;&#23478;&#27604;&#21334;&#23478;&#26356;&#30693;&#24773;&#30340;&#24773;&#20917;&#19979;&#20197;&#21450;&#22312;&#20080;&#23478;&#23436;&#20840;&#30693;&#26195;&#30340;&#24773;&#20917;&#19979;&#30340;&#25910;&#30410;&#65292;&#25152;&#26377;&#19977;&#20010;&#25910;&#30410;&#38598;&#21482;&#26377;&#22312;&#29305;&#27530;&#24773;&#20917;&#19979;&#25165;&#19968;&#33268;&#65292;&#29305;&#21035;&#26159;&#22312;&#19968;&#20010;&#8220;&#26592;&#27308;&#24066;&#22330;&#8221;&#20013;&#20986;&#29616;&#23436;&#20840;&#23849;&#28291;&#30340;&#24773;&#20917;&#19979;&#65292;&#20854;&#21334;&#23478;&#26410;&#30693;&#65292;&#20080;&#23478;&#23436;&#20840;&#30693;&#24773;&#12290;
&lt;/p&gt;
&lt;p&gt;
A seller posts a price for a single object. The seller's and buyer's values may be interdependent. We characterize the set of payoff vectors across all information structures. Simple feasibility and individual-rationality constraints identify the payoff set. The buyer can obtain the entire surplus; often, other mechanisms cannot enlarge the payoff set. We also study payoffs when the buyer is more informed than the seller, and when the buyer is fully informed. All three payoff sets coincide (only) in notable special cases -- in particular, when there is complete breakdown in a ``lemons market'' with an uninformed seller and fully-informed buyer.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#25919;&#27835;&#31454;&#20105;&#20013;&#31454;&#36873;&#32773;&#23545;&#36873;&#27665;&#20559;&#22909;&#20449;&#24687;&#20570;&#20986;&#25112;&#30053;&#35843;&#25972;&#30340;&#24773;&#20917;&#65292;&#21457;&#29616;&#22312;&#26032;&#20449;&#24687;&#26377;&#21033;&#26102;&#65292;&#31454;&#36873;&#32773;&#20250;&#37319;&#21462;&#25112;&#30053;&#8220;&#32763;&#30424;&#8221;&#20197;&#33719;&#24471;&#26080;&#25104;&#26412;&#30340;&#32988;&#21033;&#12290;</title><link>http://arxiv.org/abs/2305.02834</link><description>&lt;p&gt;
&#25919;&#27835;&#31454;&#20105;&#20013;&#30340;&#25112;&#30053;&#8220;&#32763;&#30424;&#8221;
&lt;/p&gt;
&lt;p&gt;
Strategic flip-flopping in political competition. (arXiv:2305.02834v1 [cs.GT])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.02834
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#25919;&#27835;&#31454;&#20105;&#20013;&#31454;&#36873;&#32773;&#23545;&#36873;&#27665;&#20559;&#22909;&#20449;&#24687;&#20570;&#20986;&#25112;&#30053;&#35843;&#25972;&#30340;&#24773;&#20917;&#65292;&#21457;&#29616;&#22312;&#26032;&#20449;&#24687;&#26377;&#21033;&#26102;&#65292;&#31454;&#36873;&#32773;&#20250;&#37319;&#21462;&#25112;&#30053;&#8220;&#32763;&#30424;&#8221;&#20197;&#33719;&#24471;&#26080;&#25104;&#26412;&#30340;&#32988;&#21033;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#31454;&#36873;&#32773;&#22914;&#20309;&#38024;&#23545;&#36873;&#27665;&#20559;&#22909;&#30340;&#26032;&#20449;&#24687;&#20570;&#20986;&#35843;&#25972;&#12290;&#37325;&#26032;&#23450;&#20301;&#21487;&#20351;&#31454;&#36873;&#32773;&#26356;&#25509;&#36817;&#20013;&#38388;&#36873;&#27665;&#65292;&#20294;&#20250;&#22312;&#36130;&#21153;&#21644;&#36873;&#20030;&#26041;&#38754;&#20135;&#29983;&#25104;&#26412;&#12290;&#25105;&#20204;&#30740;&#31350;&#20102;&#35843;&#25972;&#21457;&#29983;&#30340;&#26102;&#26426;&#21644;&#26041;&#21521;&#65292;&#36825;&#21462;&#20915;&#20110;&#31454;&#36873;&#32773;&#30340;&#20808;&#21069;&#31435;&#22330;&#21644;&#26032;&#20449;&#24687;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#22312;&#21807;&#19968;&#30340;&#23376;&#21338;&#24328;&#23436;&#32654;&#22343;&#34913;&#20013;&#65292;&#31454;&#36873;&#32773;&#39044;&#27979;&#21040;&#21487;&#33021;&#20250;&#26681;&#25454;&#26410;&#26469;&#30340;&#20449;&#24687;&#20570;&#20986;&#35843;&#25972;&#65292;&#24182;&#22312;&#20808;&#21069;&#20998;&#27495;&#65292;&#20197;&#22312;&#26032;&#20449;&#24687;&#26377;&#21033;&#26102;&#30830;&#20445;&#26080;&#25104;&#26412;&#30340;&#32988;&#21033;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study candidates' positioning when adjustments are possible in response to new information about voters' preferences. Re-positioning allows candidates to get closer to the median voter but is costly both financially and electorally. We examine the occurrence and the direction of the adjustments depending on the ex-ante positions and the new information. In the unique subgame perfect equilibrium, candidates anticipate the possibility to adjust in response to future information and diverge ex-ante in order to secure a cost-less victory when the new information is favorable.
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#39033;&#32463;&#27982;&#39044;&#26399;&#35843;&#26597;&#65292;&#20351;&#29992;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#23545;&#21508;&#31181;&#37329;&#34701;&#21644;&#23439;&#35266;&#32463;&#27982;&#21464;&#37327;&#30340;&#39044;&#26399;&#36827;&#34892;&#26597;&#35810;&#65292;&#21457;&#29616;LLM&#39044;&#26399;&#19982;&#29616;&#26377;&#35843;&#26597;&#30456;&#20284;&#65292;&#20294;&#20063;&#26174;&#31034;&#20986;&#35768;&#22810;&#20559;&#31163;&#29702;&#24615;&#39044;&#26399;&#30340;&#29305;&#28857;&#65292;&#35813;&#35843;&#26597;&#26041;&#27861;&#20026;&#34913;&#37327;&#32463;&#27982;&#39044;&#26399;&#25552;&#20379;&#20102;&#19968;&#31181;&#26032;&#26041;&#27861;&#12290;</title><link>http://arxiv.org/abs/2305.02823</link><description>&lt;p&gt;
&#35843;&#26597;&#29983;&#25104;AI&#23545;&#32463;&#27982;&#39044;&#26399;&#30340;&#26399;&#26395;
&lt;/p&gt;
&lt;p&gt;
Surveying Generative AI's Economic Expectations. (arXiv:2305.02823v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.02823
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#39033;&#32463;&#27982;&#39044;&#26399;&#35843;&#26597;&#65292;&#20351;&#29992;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#23545;&#21508;&#31181;&#37329;&#34701;&#21644;&#23439;&#35266;&#32463;&#27982;&#21464;&#37327;&#30340;&#39044;&#26399;&#36827;&#34892;&#26597;&#35810;&#65292;&#21457;&#29616;LLM&#39044;&#26399;&#19982;&#29616;&#26377;&#35843;&#26597;&#30456;&#20284;&#65292;&#20294;&#20063;&#26174;&#31034;&#20986;&#35768;&#22810;&#20559;&#31163;&#29702;&#24615;&#39044;&#26399;&#30340;&#29305;&#28857;&#65292;&#35813;&#35843;&#26597;&#26041;&#27861;&#20026;&#34913;&#37327;&#32463;&#27982;&#39044;&#26399;&#25552;&#20379;&#20102;&#19968;&#31181;&#26032;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#36890;&#36807;&#26597;&#35810;1984&#24180;&#33267;2021&#24180;&#21326;&#23572;&#34903;&#26085;&#25253;&#30340;&#26032;&#38395;&#25991;&#31456;&#26679;&#26412;&#65292;&#20171;&#32461;&#20102;&#19968;&#20010;&#32463;&#27982;&#39044;&#26399;&#35843;&#26597;&#65292;&#35813;&#35843;&#26597;&#26597;&#35810;&#20102;&#19968;&#20010;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLM&#65289;&#23545;&#21508;&#31181;&#37329;&#34701;&#21644;&#23439;&#35266;&#32463;&#27982;&#21464;&#37327;&#30340;&#39044;&#26399;&#12290; &#25105;&#21457;&#29616;&#65292;&#30001;&#27492;&#20135;&#29983;&#30340;&#39044;&#26399;&#19982;&#29616;&#26377;&#35843;&#26597;&#65288;&#21253;&#25324;&#19987;&#19994;&#39044;&#27979;&#32773;&#35843;&#26597;&#65288;SPF&#65289;&#12289;&#32654;&#22269;&#20010;&#20154;&#25237;&#36164;&#32773;&#21327;&#20250;&#21644;&#26460;&#20811;&#39318;&#24109;&#36130;&#21153;&#23448;&#35843;&#26597;&#65289;&#38750;&#24120;&#30456;&#20284;&#12290;&#37325;&#35201;&#30340;&#26159;&#65292;&#25105;&#35760;&#24405;&#20102;LLM&#22522;&#20110;&#27169;&#22411;&#30340;&#39044;&#26399;&#19982;&#29616;&#26377;&#35843;&#26597;&#31995;&#21015;&#20013;&#34920;&#29616;&#20986;&#30340;&#35768;&#22810;&#20840;&#20449;&#24687;&#29702;&#24615;&#39044;&#26399;&#20559;&#24046;&#21305;&#37197;&#12290;LLM&#30340;&#23439;&#35266;&#32463;&#27982;&#39044;&#26399;&#34920;&#29616;&#20986;&#20849;&#35782;SPF&#39044;&#27979;&#20013;&#24120;&#35265;&#30340;&#20302;&#21453;&#24212;&#24615;&#12290;&#27492;&#22806;&#65292;&#20854;&#22238;&#25253;&#39044;&#26399;&#26159;&#22806;&#25512;&#30340;&#65292;&#33073;&#31163;&#20102;&#39044;&#26399;&#22238;&#25253;&#30340;&#23458;&#35266;&#27979;&#37327;&#65292;&#19982;&#26410;&#26469;&#23454;&#29616;&#30340;&#22238;&#25253;&#21576;&#36127;&#30456;&#20851;&#12290;&#26368;&#21518;&#65292;&#21033;&#29992;LLM&#22521;&#35757;&#26399;&#20197;&#22806;&#30340;&#25991;&#31456;&#26679;&#26412;&#65292;&#25105;&#21457;&#29616;&#19982;&#29616;&#26377;&#35843;&#26597;&#39044;&#26399;&#30340;&#30456;&#20851;&#24615;&#20173;&#28982;&#24378;&#65292;&#36825;&#34920;&#26126;LLM&#27169;&#22411;&#30340;&#22522;&#30784;&#26694;&#26550;&#25552;&#20379;&#20102;&#19968;&#31181;&#26377;&#29992;&#30340;&#26032;&#26041;&#27861;&#26469;&#27979;&#37327;&#32463;&#27982;&#39044;&#26399;&#12290;
&lt;/p&gt;
&lt;p&gt;
I introduce a survey of economic expectations formed by querying a large language model (LLM)'s expectations of various financial and macroeconomic variables based on a sample of news articles from the Wall Street Journal between 1984 and 2021. I find the resulting expectations closely match existing surveys including the Survey of Professional Forecasters (SPF), the American Association of Individual Investors, and the Duke CFO Survey. Importantly, I document that LLM based expectations match many of the deviations from full-information rational expectations exhibited in these existing survey series. The LLM's macroeconomic expectations exhibit under-reaction commonly found in consensus SPF forecasts. Additionally, its return expectations are extrapolative, disconnected from objective measures of expected returns, and negatively correlated with future realized returns. Finally, using a sample of articles outside of the LLM's training period I find that the correlation with existing su
&lt;/p&gt;</description></item><item><title>&#30740;&#31350;&#35777;&#26126;&#22312;&#20844;&#20849;&#33286;&#35770;&#20013;&#65292;&#20013;&#38388;&#27966;&#30340;&#24847;&#35265;&#22312;&#27785;&#40664;&#20013;&#21464;&#24471;&#26080;&#22768;&#26080;&#24687;&#65292;&#32780;&#26497;&#31471;&#27966;&#21017;&#25484;&#25511;&#20102;&#35752;&#35770;&#65307;&#24182;&#21457;&#29616;&#25509;&#35302;&#21040;&#20182;&#20154;&#24847;&#35265;&#30340;&#22686;&#22810;&#20250;&#21152;&#21095;&#20010;&#20307;&#20043;&#38388;&#30340;&#26497;&#21270;&#29616;&#35937;&#12290;</title><link>http://arxiv.org/abs/2305.02604</link><description>&lt;p&gt;
&#12298;&#28748;&#36755;&#28216;&#25103;&#12299;
&lt;/p&gt;
&lt;p&gt;
The Indoctrination Game. (arXiv:2305.02604v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.02604
&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#35777;&#26126;&#22312;&#20844;&#20849;&#33286;&#35770;&#20013;&#65292;&#20013;&#38388;&#27966;&#30340;&#24847;&#35265;&#22312;&#27785;&#40664;&#20013;&#21464;&#24471;&#26080;&#22768;&#26080;&#24687;&#65292;&#32780;&#26497;&#31471;&#27966;&#21017;&#25484;&#25511;&#20102;&#35752;&#35770;&#65307;&#24182;&#21457;&#29616;&#25509;&#35302;&#21040;&#20182;&#20154;&#24847;&#35265;&#30340;&#22686;&#22810;&#20250;&#21152;&#21095;&#20010;&#20307;&#20043;&#38388;&#30340;&#26497;&#21270;&#29616;&#35937;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#12298;&#28748;&#36755;&#28216;&#25103;&#12299;&#26159;&#19968;&#22330;&#20851;&#20110;&#20844;&#20247;&#33286;&#35770;&#30340;&#23436;&#20840;&#20449;&#24687;&#31454;&#36187;&#12290;&#21442;&#36187;&#32773;&#20026;&#20102;&#25484;&#25511;&#35752;&#35770;&#65292;&#20250;&#20184;&#20986;&#26114;&#36149;&#30340;&#21162;&#21147;&#23558;&#20854;&#38544;&#31169;&#24847;&#35265;&#20844;&#20043;&#20110;&#20247;&#12290;&#25105;&#20204;&#30340;&#20998;&#26512;&#20026;&#27785;&#40664;&#30340;&#22823;&#22810;&#25968;&#21644;&#21709;&#20142;&#30340;&#23569;&#25968;&#29616;&#35937;&#25552;&#20379;&#20102;&#29702;&#35770;&#22522;&#30784;&#65292;&#21363;&#22312;&#24179;&#34913;&#29366;&#24577;&#19979;&#65292;&#25152;&#26377;&#20013;&#38388;&#27966;&#30340;&#24847;&#35265;&#20250;&#20445;&#25345;&#27785;&#40664;&#65292;&#32780;&#26497;&#31471;&#27966;&#21017;&#23436;&#20840;&#25484;&#25511;&#20102;&#35752;&#35770;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36824;&#35777;&#26126;&#65292;&#25509;&#35302;&#21040;&#20182;&#20154;&#24847;&#35265;&#30340;&#39057;&#29575;&#20250;&#22686;&#21152;&#20010;&#20307;&#20043;&#38388;&#30340;&#26497;&#21270;&#29616;&#35937;&#12290;&#22522;&#20110;&#36825;&#20123;&#32467;&#26524;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#26032;&#30340;&#31038;&#20250;&#23398;&#20064;&#26694;&#26550;&#65292;&#31216;&#20026;&#28748;&#36755;&#36807;&#31243;&#12290;
&lt;/p&gt;
&lt;p&gt;
The indoctrination game is a complete-information contest over public opinion. The players exert costly effort to manifest their private opinions in public in order to control the discussion, so that the governing opinion is similar to theirs. Our analysis provides a theoretical foundation for the silent majority and vocal minority phenomena, i.e., we show that all moderate opinions remain mute in equilibrium while allowing extremists full control of the discussion. Moreover, we prove that elevated exposure to others' opinions increases the observed polarization among individuals. Using these results, we formulate a new social-learning framework, referred to as an indoctrination process.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#20351;&#29992;Glassdoor.com&#21644;Dice.com&#30340;&#25968;&#25454;&#30740;&#31350;&#20102;&#38599;&#20027;&#22768;&#35465;&#23545;&#21171;&#21160;&#24066;&#22330;&#30340;&#24433;&#21709;&#65292;&#21457;&#29616;&#38599;&#20027;&#22768;&#35465;&#30340;&#25552;&#39640;&#23558;&#24433;&#21709;&#20854;&#21560;&#24341;&#24037;&#20154;&#30340;&#33021;&#21147;&#65292;&#23588;&#20854;&#26159;&#24403;&#26174;&#31034;&#35780;&#20998;&#20026;&#8220;&#25345;&#32493;&#8221;&#26102;&#65292;&#36825;&#31181;&#24433;&#21709;&#23545;&#20110;&#31169;&#20154;&#12289;&#36739;&#23567;&#21644;&#19981;&#37027;&#20040;&#30693;&#21517;&#30340;&#20225;&#19994;&#26368;&#20026;&#31361;&#20986;&#12290;</title><link>http://arxiv.org/abs/2305.02587</link><description>&lt;p&gt;
&#12298;&#38599;&#20027;&#22768;&#35465;&#19982;&#21171;&#21160;&#24066;&#22330;:&#26469;&#33258;Glassdoor.com&#21644;Dice.com&#30340;&#35777;&#25454;&#12299;
&lt;/p&gt;
&lt;p&gt;
Employer Reputation and the Labor Market: Evidence from Glassdoor.com and Dice.com. (arXiv:2305.02587v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.02587
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#20351;&#29992;Glassdoor.com&#21644;Dice.com&#30340;&#25968;&#25454;&#30740;&#31350;&#20102;&#38599;&#20027;&#22768;&#35465;&#23545;&#21171;&#21160;&#24066;&#22330;&#30340;&#24433;&#21709;&#65292;&#21457;&#29616;&#38599;&#20027;&#22768;&#35465;&#30340;&#25552;&#39640;&#23558;&#24433;&#21709;&#20854;&#21560;&#24341;&#24037;&#20154;&#30340;&#33021;&#21147;&#65292;&#23588;&#20854;&#26159;&#24403;&#26174;&#31034;&#35780;&#20998;&#20026;&#8220;&#25345;&#32493;&#8221;&#26102;&#65292;&#36825;&#31181;&#24433;&#21709;&#23545;&#20110;&#31169;&#20154;&#12289;&#36739;&#23567;&#21644;&#19981;&#37027;&#20040;&#30693;&#21517;&#30340;&#20225;&#19994;&#26368;&#20026;&#31361;&#20986;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38599;&#20027;&#22768;&#35465;&#23545;&#21171;&#21160;&#24066;&#22330;&#26377;&#20309;&#24433;&#21709;&#65311;&#25105;&#20204;&#20351;&#29992;&#20174;Glassdoor.com&#20013;&#25910;&#38598;&#30340;&#35780;&#35770;&#21644;Dice.com&#20013;&#30340;&#27714;&#32844;&#25968;&#25454;&#26469;&#30740;&#31350;&#36825;&#20010;&#38382;&#39064;&#12290;Glassdoor.com&#31561;&#21171;&#21160;&#24066;&#22330;&#30340;&#26426;&#26500;&#36890;&#36807;&#20247;&#21253;&#26469;&#25910;&#38598;&#38599;&#20027;&#20449;&#24687;&#65292;&#20197;&#35299;&#20915;&#24037;&#20154;&#22312;&#36873;&#25321;&#38599;&#20027;&#26102;&#38754;&#20020;&#30340;&#20449;&#24687;&#38382;&#39064;&#12290;&#20026;&#20102;&#36991;&#20813;&#36807;&#22810;&#20559;&#24046;&#65292;&#21407;&#22987;&#30340;&#20247;&#21253;&#38599;&#20027;&#35780;&#32423;&#26159;&#22312;&#26174;&#31034;&#32473;&#27714;&#32844;&#32773;&#26102;&#36827;&#34892;&#20102;&#31934;&#21152;&#24037;&#21518;&#30340;&#12290;&#36890;&#36807;&#21033;&#29992;&#31934;&#21152;&#24037;&#30340;&#38408;&#20540;&#65292;&#25105;&#20204;&#20351;&#29992;&#22238;&#24402;&#19981;&#36830;&#32493;&#24615;&#26694;&#26550;&#30830;&#23450;&#20102;Glassdoor&#35780;&#32423;&#30340;&#22240;&#26524;&#24433;&#21709;&#12290;&#25105;&#20204;&#35760;&#24405;&#20102;&#36825;&#31181;&#35780;&#32423;&#23545;&#21171;&#21160;&#21147;&#24066;&#22330;&#38656;&#27714;&#21644;&#20379;&#32473;&#26041;&#38754;&#30340;&#24433;&#21709;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#38599;&#20027;&#22768;&#35465;&#23545;&#20110;&#38599;&#20027;&#21560;&#24341;&#24037;&#20154;&#30340;&#33021;&#21147;&#26377;&#24433;&#21709;&#65292;&#29305;&#21035;&#26159;&#24403;&#26174;&#31034;&#35780;&#20998;&#20026;&#8220;&#25345;&#32493;&#8221;&#26102;&#12290;&#38599;&#20027;&#23545;&#35780;&#20998;&#36229;&#36807;&#31934;&#21152;&#24037;&#38408;&#20540;&#30340;&#22238;&#24212;&#26159;&#21457;&#24067;&#26356;&#22810;&#30340;&#26032;&#32844;&#20301;&#21644;&#37325;&#26032;&#28608;&#27963;&#26356;&#22810;&#30340;&#24037;&#20316;&#32844;&#20301;&#12290;&#36825;&#31181;&#24433;&#21709;&#23545;&#31169;&#20154;&#12289;&#36739;&#23567;&#21644;&#19981;&#37027;&#20040;&#30693;&#21517;&#30340;&#20225;&#19994;&#26368;&#20026;&#31361;&#20986;&#12290;
&lt;/p&gt;
&lt;p&gt;
How does employer reputation affect the labor market? We investigate this question using a novel dataset combining reviews from Glassdoor.com and job applications data from Dice.com. Labor market institutions such as Glassdoor.com crowd-sources information about employers to alleviate information problems faced by workers when choosing an employer. Raw crowd-sourced employer ratings are rounded when displayed to job seekers. By exploiting the rounding threshold, we identify the causal impact of Glassdoor ratings using a regression discontinuity framework. We document the effects of such ratings on both the demand and supply sides of the labor market. We find that displayed employer reputation affects an employer's ability to attract workers, especially when the displayed rating is "sticky." Employers respond to having a rating above the rounding threshold by posting more new positions and re-activating more job postings. The effects are the strongest for private, smaller, and less esta
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#20010;&#26694;&#26550;&#26469;&#29702;&#35299;AI&#24320;&#21457;&#20013;&#30340;&#31038;&#20250;&#25216;&#26415;&#31995;&#32479;&#21644;&#31038;&#20250;&#31119;&#21033;&#30340;&#30456;&#20114;&#20316;&#29992;&#65292;&#24182;&#24341;&#20837;&#20102;&#8220;&#20449;&#21495;&#20256;&#36882;&#8221;&#30340;&#27010;&#24565;&#20197;&#22686;&#24378;&#23545;AI&#31995;&#32479;&#35780;&#20272;&#21644;&#27835;&#29702;&#30340;&#29702;&#35770;&#21644;&#23454;&#36341;&#12290;</title><link>http://arxiv.org/abs/2305.02561</link><description>&lt;p&gt;
AI&#24320;&#21457;&#21160;&#24577;&#20013;&#30340;&#20844;&#30410;&#20449;&#21495;
&lt;/p&gt;
&lt;p&gt;
Beneficence Signaling in AI Development Dynamics. (arXiv:2305.02561v1 [cs.CY])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.02561
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#20010;&#26694;&#26550;&#26469;&#29702;&#35299;AI&#24320;&#21457;&#20013;&#30340;&#31038;&#20250;&#25216;&#26415;&#31995;&#32479;&#21644;&#31038;&#20250;&#31119;&#21033;&#30340;&#30456;&#20114;&#20316;&#29992;&#65292;&#24182;&#24341;&#20837;&#20102;&#8220;&#20449;&#21495;&#20256;&#36882;&#8221;&#30340;&#27010;&#24565;&#20197;&#22686;&#24378;&#23545;AI&#31995;&#32479;&#35780;&#20272;&#21644;&#27835;&#29702;&#30340;&#29702;&#35770;&#21644;&#23454;&#36341;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#24182;&#21457;&#23637;&#20102;&#19968;&#20010;&#26694;&#26550;&#65292;&#29992;&#20110;&#29702;&#35299;&#22260;&#32469;&#20154;&#24037;&#26234;&#33021;&#24320;&#21457;&#30340;&#31038;&#20250;&#25216;&#26415;&#31995;&#32479;&#22914;&#20309;&#19982;&#31038;&#20250;&#31119;&#21033;&#30456;&#20114;&#20316;&#29992;&#12290;&#23427;&#24341;&#20837;&#20102;&#36827;&#21270;&#21338;&#24328;&#35770;&#20013;&#30340;&#8220;&#20449;&#21495;&#20256;&#36882;&#8221;&#27010;&#24565;&#65292;&#24182;&#28436;&#31034;&#20102;&#23427;&#22914;&#20309;&#22686;&#24378;&#29616;&#26377;&#30340;&#20154;&#24037;&#26234;&#33021;&#31995;&#32479;&#35780;&#20272;&#21644;&#27835;&#29702;&#29702;&#35770;&#21644;&#23454;&#36341;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper motivates and develops a framework for understanding how the socio-technical systems surrounding AI development interact with social welfare. It introduces the concept of ``signaling'' from evolutionary game theory and demonstrates how it can enhance existing theory and practice surrounding the evaluation and governance of AI systems.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#36890;&#36807;&#25972;&#21512;&#20197;&#22826;&#22346;&#21306;&#22359;&#38142;&#21644;&#20869;&#23384;&#27744;&#25968;&#25454;&#65292;&#25506;&#31350;&#20102;TFMs&#20013;&#31561;&#24453;&#26102;&#38388;&#30340;&#30830;&#23450;&#22240;&#32032;&#65292;&#30740;&#31350;&#34920;&#26126;&#22238;&#24402;&#26029;&#28857;&#35774;&#35745;&#23545;&#20110;&#20998;&#26512;&#22240;&#26524;&#25512;&#29702;&#24456;&#26377;&#25928;&#65292;&#20132;&#26131;&#20302;&#20272;&#20250;&#20135;&#29983;&#22403;&#22334;&#37038;&#20214;&#25915;&#20987;&#65292;&#36825;&#20123;&#23545;&#20110;&#25552;&#39640;&#21306;&#22359;&#38142;&#31995;&#32479;&#23433;&#20840;&#21644;&#32463;&#27982;&#24615;&#33021;&#26377;&#25152;&#24110;&#21161;&#12290;</title><link>http://arxiv.org/abs/2305.02552</link><description>&lt;p&gt;
&#12298;&#29702;&#35299;&#20132;&#26131;&#36153;&#26426;&#21046;&#20013;&#30340;&#31561;&#24453;&#26102;&#38388;&#65306;&#36328;&#23398;&#31185;&#35270;&#35282;&#12299;
&lt;/p&gt;
&lt;p&gt;
Understand Waiting Time in Transaction Fee Mechanism: An Interdisciplinary Perspective. (arXiv:2305.02552v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.02552
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36890;&#36807;&#25972;&#21512;&#20197;&#22826;&#22346;&#21306;&#22359;&#38142;&#21644;&#20869;&#23384;&#27744;&#25968;&#25454;&#65292;&#25506;&#31350;&#20102;TFMs&#20013;&#31561;&#24453;&#26102;&#38388;&#30340;&#30830;&#23450;&#22240;&#32032;&#65292;&#30740;&#31350;&#34920;&#26126;&#22238;&#24402;&#26029;&#28857;&#35774;&#35745;&#23545;&#20110;&#20998;&#26512;&#22240;&#26524;&#25512;&#29702;&#24456;&#26377;&#25928;&#65292;&#20132;&#26131;&#20302;&#20272;&#20250;&#20135;&#29983;&#22403;&#22334;&#37038;&#20214;&#25915;&#20987;&#65292;&#36825;&#20123;&#23545;&#20110;&#25552;&#39640;&#21306;&#22359;&#38142;&#31995;&#32479;&#23433;&#20840;&#21644;&#32463;&#27982;&#24615;&#33021;&#26377;&#25152;&#24110;&#21161;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21306;&#22359;&#38142;&#25216;&#26415;&#20351;&#24471;&#26080;&#38656;&#20449;&#20219;&#31532;&#19977;&#26041;&#21363;&#21487;&#36827;&#34892;&#28857;&#23545;&#28857;&#20132;&#26131;&#12290;&#20197;&#22826;&#22346;&#21644;&#26234;&#33021;&#21512;&#32422;&#21306;&#22359;&#38142;&#30340;&#24555;&#36895;&#21457;&#23637;&#38656;&#35201;&#26377;&#33391;&#22909;&#35774;&#35745;&#30340;&#20132;&#26131;&#36153;&#26426;&#21046;(TFMs)&#65292;&#20197;&#20998;&#37197;&#26377;&#38480;&#30340;&#23384;&#20648;&#21644;&#35745;&#31639;&#36164;&#28304;&#12290;&#28982;&#32780;&#65292;&#29616;&#26377;&#30340;TFM&#30740;&#31350;&#24517;&#39035;&#32771;&#34385;&#20132;&#26131;&#30340;&#31561;&#24453;&#26102;&#38388;&#65292;&#36825;&#23545;&#35745;&#31639;&#26426;&#23433;&#20840;&#21644;&#32463;&#27982;&#25928;&#29575;&#33267;&#20851;&#37325;&#35201;&#12290;&#26412;&#25991;&#23558;&#20197;&#22826;&#22346;&#21306;&#22359;&#38142;&#21644;&#20869;&#23384;&#27744;&#30340;&#25968;&#25454;&#25972;&#21512;&#36215;&#26469;&#65292;&#25506;&#35752;&#20004;&#31181;&#20107;&#20214;&#22914;&#20309;&#24433;&#21709;&#20132;&#26131;&#24310;&#36831;&#12290;&#39318;&#20808;&#65292;&#25105;&#20204;&#24212;&#29992;&#22238;&#24402;&#26029;&#28857;&#35774;&#35745;(RDD)&#26469;&#30740;&#31350;Ethereum&#30340;&#26368;&#26032;&#37325;&#22823;&#21319;&#32423;&#8212;&#8212;Merge&#30340;&#22240;&#26524;&#25512;&#29702;&#12290;&#25105;&#20204;&#30340;&#32467;&#26524;&#34920;&#26126;&#65292;Merge&#26174;&#33879;&#38477;&#20302;&#20102;&#38271;&#26102;&#38388;&#31561;&#24453;&#26102;&#38388;&#12289;&#32593;&#32476;&#36127;&#36733;&#21644;&#24066;&#22330;&#25317;&#22581;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36890;&#36807;&#26816;&#26597;&#20854;&#20182;&#22797;&#21512;&#22240;&#32032;&#65288;&#20363;&#22914;&#23457;&#26597;&#21644;&#31169;&#20154;&#26356;&#25913;&#21518;&#30340;&#26410;&#35266;&#23519;&#21040;&#30340;&#24310;&#36831;&#20107;&#21153;&#65289;&#26469;&#39564;&#35777;&#32467;&#26524;&#30340;&#31283;&#20581;&#24615;&#12290;&#20854;&#27425;&#65292;&#25105;&#20204;&#36890;&#36807;&#20351;&#29992;&#20108;&#27425;&#25968;&#23398;&#27169;&#22411;&#26469;&#25551;&#36848;&#20132;&#26131;&#36153;&#31454;&#26631;&#36807;&#31243;&#65292;&#30740;&#31350;&#20102;&#20132;&#26131;&#20302;&#20272;&#23545;&#31561;&#24453;&#26102;&#38388;&#21644;&#21487;&#33021;&#30340;&#22403;&#22334;&#37038;&#20214;&#25915;&#20987;&#30340;&#24433;&#21709;&#12290;&#25105;&#20204;&#30340;&#36328;&#23398;&#31185;&#26041;&#27861;&#23558;&#35745;&#31639;&#26426;&#31185;&#23398;&#21644;&#32463;&#27982;&#23398;&#34701;&#21512;&#22312;&#19968;&#36215;&#65292;&#25552;&#20379;&#20102;TFMs&#31561;&#24453;&#26102;&#38388;&#20915;&#23450;&#22240;&#32032;&#30340;&#20840;&#38754;&#35270;&#35282;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#23545;&#20110;&#25552;&#39640;&#21306;&#22359;&#38142;&#31995;&#32479;&#30340;&#23433;&#20840;&#24615;&#21644;&#32463;&#27982;&#24615;&#33021;&#20855;&#26377;&#23454;&#38469;&#24847;&#20041;&#12290;
&lt;/p&gt;
&lt;p&gt;
Blockchain enables peer-to-peer transactions in cyberspace without a trusted third party. The rapid growth of Ethereum and smart contract blockchains generally calls for well-designed Transaction Fee Mechanisms (TFMs) to allocate limited storage and computation resources. However, existing research on TFMs must consider the waiting time for transactions, which is essential for computer security and economic efficiency. Integrating data from the Ethereum blockchain and memory pool (mempool), we explore how two types of events affect transaction latency. First, we apply regression discontinuity design (RDD) to study the causal inference of the Merge, the most recent significant upgrade of Ethereum. Our results show that the Merge significantly reduces the long waiting time, network loads, and market congestion. In addition, we verify our results' robustness by inspecting other compounding factors, such as censorship and unobserved delays of transactions via private changes. Second, exami
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#38024;&#23545;&#31351;&#20154;&#21033;&#29992;&#23567;&#39069;&#20449;&#36151;&#25237;&#36164;&#20110;&#20225;&#19994;&#25110;&#20154;&#21147;&#36164;&#26412;&#30340;&#29616;&#29366;&#36827;&#34892;&#30740;&#31350;&#65292;&#35748;&#20026;&#39118;&#38505;&#35268;&#36991;&#26159;&#21407;&#22240;&#20043;&#19968;&#65292;&#22240;&#20026;&#25237;&#36164;&#26088;&#22312;&#25552;&#39640;&#25104;&#21151;&#21487;&#33021;&#24615;&#65292;&#25152;&#20197;&#38656;&#35201;&#37319;&#21462;&#19981;&#21516;&#30340;&#31574;&#30053;&#12290;</title><link>http://arxiv.org/abs/2305.02546</link><description>&lt;p&gt;
&#20026;&#20160;&#20040;&#19981;&#20511;&#27454;&#12289;&#25237;&#36164;&#21644;&#25670;&#33073;&#36139;&#22256;&#65311;
&lt;/p&gt;
&lt;p&gt;
Why Not Borrow, Invest, and Escape Poverty?. (arXiv:2305.02546v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.02546
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#38024;&#23545;&#31351;&#20154;&#21033;&#29992;&#23567;&#39069;&#20449;&#36151;&#25237;&#36164;&#20110;&#20225;&#19994;&#25110;&#20154;&#21147;&#36164;&#26412;&#30340;&#29616;&#29366;&#36827;&#34892;&#30740;&#31350;&#65292;&#35748;&#20026;&#39118;&#38505;&#35268;&#36991;&#26159;&#21407;&#22240;&#20043;&#19968;&#65292;&#22240;&#20026;&#25237;&#36164;&#26088;&#22312;&#25552;&#39640;&#25104;&#21151;&#21487;&#33021;&#24615;&#65292;&#25152;&#20197;&#38656;&#35201;&#37319;&#21462;&#19981;&#21516;&#30340;&#31574;&#30053;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#31351;&#20154;&#21033;&#29992;&#23567;&#39069;&#20449;&#36151;&#25237;&#36164;&#20110;&#20225;&#19994;&#25110;&#20154;&#21147;&#36164;&#26412;&#30340;&#24773;&#20917;&#38750;&#24120;&#23569;&#12290;&#25105;&#20204;&#34920;&#26126;&#65292;&#22914;&#26524;&#36825;&#31181;&#25237;&#36164;&#26088;&#22312;&#25552;&#39640;&#25104;&#21151;&#30340;&#21487;&#33021;&#24615;&#65292;&#21017;&#21487;&#20197;&#35299;&#37322;&#39118;&#38505;&#35268;&#36991;&#30340;&#24773;&#20917;&#65292;&#32780;&#26080;&#38656;&#20381;&#36182;&#20110;&#22266;&#23450;&#25104;&#26412;&#25110;&#25216;&#26415;&#19978;&#30340;&#20854;&#20182;&#38750;&#20984;&#24615;&#12290;&#22312;&#36825;&#31181;&#26694;&#26550;&#19979;&#65292;&#29702;&#24615;&#30340;&#39118;&#38505;&#35268;&#36991;&#32773;&#36873;&#25321;&#36793;&#35282;&#35299;&#65292;&#19981;&#21516;&#20110;&#20855;&#26377;&#22806;&#29983;&#25104;&#21151;&#27010;&#29575;&#30340;&#39118;&#38505;&#25237;&#36164;&#30340;&#24773;&#20917;&#12290;&#25105;&#20204;&#30340;&#22312;&#32447;&#23454;&#39564;&#39564;&#35777;&#20102;&#25105;&#20204;&#30340;&#29702;&#35770;&#39044;&#27979;&#65292;&#21363;&#24403;&#38754;&#20020;&#36825;&#20004;&#31181;&#31867;&#22411;&#31867;&#22411;&#30340;&#25237;&#36164;&#26102;&#65292;&#20195;&#29702;&#21830;&#36873;&#25321;&#19981;&#21516;&#30340;&#26041;&#26696;&#12290;
&lt;/p&gt;
&lt;p&gt;
Take up of microcredit by the poor for investment in businesses or human capital turned out to be very low. We show that this could be explained by risk aversion, without relying on fixed costs or other forms of non-convexity in the technology, if the investment is aimed at increasing the probability of success. Under this framework, rational risk-averse agents choose corner solutions, unlike in the case of a risky investment with an exogenous probability of success. Our online experiment confirms our theoretical predictions about how agents' choices differ when facing the two types of investments.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#20998;&#26512;&#20102;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#22312;&#19981;&#21516;&#35821;&#35328;&#25552;&#31034;&#19979;&#30340;&#22870;&#21169;&#26102;&#38388;&#20559;&#22909;&#65292;&#24182;&#21457;&#29616;GPT&#22312;&#20855;&#26377;&#36739;&#24369;&#26410;&#26469;&#26102;&#24577;&#30340;&#35821;&#35328;&#19979;&#34920;&#29616;&#20986;&#26356;&#22823;&#30340;&#32784;&#24515;&#65292;&#36825;&#19982;&#20351;&#29992;&#35813;&#35821;&#35328;&#30340;&#20154;&#31867;&#30340;&#20559;&#22909;&#30456;&#20284;&#12290;</title><link>http://arxiv.org/abs/2305.02531</link><description>&lt;p&gt;
&#35821;&#35328;&#12289;&#26102;&#38388;&#20559;&#22909;&#21644;&#28040;&#36153;&#34892;&#20026;&#65306;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#30340;&#35777;&#25454;
&lt;/p&gt;
&lt;p&gt;
Language, Time Preferences, and Consumer Behavior: Evidence from Large Language Models. (arXiv:2305.02531v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.02531
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#20998;&#26512;&#20102;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#22312;&#19981;&#21516;&#35821;&#35328;&#25552;&#31034;&#19979;&#30340;&#22870;&#21169;&#26102;&#38388;&#20559;&#22909;&#65292;&#24182;&#21457;&#29616;GPT&#22312;&#20855;&#26377;&#36739;&#24369;&#26410;&#26469;&#26102;&#24577;&#30340;&#35821;&#35328;&#19979;&#34920;&#29616;&#20986;&#26356;&#22823;&#30340;&#32784;&#24515;&#65292;&#36825;&#19982;&#20351;&#29992;&#35813;&#35821;&#35328;&#30340;&#20154;&#31867;&#30340;&#20559;&#22909;&#30456;&#20284;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35821;&#35328;&#23545;&#25105;&#20204;&#23545;&#26102;&#38388;&#21644;&#22870;&#21169;&#30340;&#24863;&#30693;&#26377;&#24456;&#22823;&#30340;&#24433;&#21709;&#12290;&#36825;&#24341;&#21457;&#20102;&#19968;&#20010;&#38382;&#39064;&#65292;&#21363;&#24403;&#20197;&#19981;&#21516;&#30340;&#35821;&#35328;&#35810;&#38382;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#26102;&#65292;&#23427;&#20204;&#26159;&#21542;&#26174;&#31034;&#20986;&#19981;&#21516;&#30340;&#22870;&#21169;&#26102;&#38388;&#20559;&#22909;&#65292;&#24182;&#19988;&#23427;&#20204;&#30340;&#36873;&#25321;&#26159;&#21542;&#31867;&#20284;&#20110;&#20154;&#31867;&#30340;&#36873;&#25321;&#12290;&#26412;&#30740;&#31350;&#20998;&#26512;&#20102;GPT-3.5&#65288;&#20197;&#19979;&#31616;&#31216;GPT&#65289;&#22312;&#22810;&#31181;&#35821;&#35328;&#25552;&#31034;&#19979;&#30340;&#21709;&#24212;&#65292;&#25506;&#32034;&#20102;&#36739;&#23567;&#12289;&#36739;&#26089;&#30340;&#22870;&#21169;&#21644;&#36739;&#22823;&#12289;&#36739;&#26202;&#30340;&#22870;&#21169;&#20043;&#38388;&#30340;&#20559;&#22909;&#12290;&#25105;&#20204;&#30340;&#32467;&#26524;&#26174;&#31034;&#65292;&#24403;&#20197;&#35821;&#20041;&#21547;&#20041;&#36739;&#24369;&#30340;&#26410;&#26469;&#26102;&#24577;&#21442;&#32771;&#65288;FTR&#65289;&#65292;&#22914;&#24503;&#35821;&#21644;&#27721;&#35821;&#65292;&#20026;&#25552;&#31034;&#35821;&#26102;&#65292;GPT&#34920;&#29616;&#20986;&#26356;&#22823;&#30340;&#32784;&#24515;&#65292;&#30456;&#27604;&#33521;&#35821;&#21644;&#27861;&#35821;&#31561;&#20855;&#26377;&#24378;&#22823;FTR&#30340;&#35821;&#35328;&#12290;&#36825;&#20123;&#21457;&#29616;&#19982;&#29616;&#26377;&#25991;&#29486;&#19968;&#33268;&#65292;&#24182;&#34920;&#26126;&#20102;GPT&#30340;&#36873;&#25321;&#19982;&#36825;&#20123;&#35821;&#35328;&#30340;&#20351;&#29992;&#32773;&#30340;&#20559;&#22909;&#20043;&#38388;&#30340;&#20851;&#32852;&#12290;&#28982;&#32780;&#65292;&#36827;&#19968;&#27493;&#30340;&#20998;&#26512;&#25581;&#31034;&#20102;&#36739;&#26089;&#25110;&#36739;&#26202;&#22870;&#21169;&#30340;&#20559;&#22909;&#24182;&#27809;&#26377;&#38543;&#30528;&#22870;&#21169;&#24046;&#24322;&#31995;&#32479;&#22320;&#25913;&#21464;&#65292;&#36825;&#34920;&#26126;&#20102;&#19968;&#31181;&#35789;&#20856;&#24207;&#20248;&#20808;&#30340;&#36873;&#25321;&#12290;
&lt;/p&gt;
&lt;p&gt;
Language has a strong influence on our perceptions of time and rewards. This raises the question of whether large language models, when asked in different languages, show different preferences for rewards over time and if their choices are similar to those of humans. In this study, we analyze the responses of GPT-3.5 (hereafter referred to as GPT) to prompts in multiple languages, exploring preferences between smaller, sooner rewards and larger, later rewards. Our results show that GPT displays greater patience when prompted in languages with weak future tense references (FTR), such as German and Mandarin, compared to languages with strong FTR, like English and French. These findings are consistent with existing literature and suggest a correlation between GPT's choices and the preferences of speakers of these languages. However, further analysis reveals that the preference for earlier or later rewards does not systematically change with reward gaps, indicating a lexicographic preferen
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#36947;&#36335;&#34892;&#39542;&#26102;&#38388;&#30340;&#37329;&#34701;&#34893;&#29983;&#21697;&#65292;&#21487;&#20197;&#20316;&#20026;&#19968;&#31181;&#21019;&#26032;&#30340;&#23545;&#20914;&#24037;&#20855;&#65292;&#22312;&#20132;&#36890;&#39046;&#22495;&#21644;&#37329;&#34701;&#24066;&#22330;&#20013;&#37117;&#26377;&#28508;&#22312;&#30340;&#24066;&#22330;&#21644;&#38656;&#27714;&#12290;</title><link>http://arxiv.org/abs/2305.02523</link><description>&lt;p&gt;
&#22522;&#20110;&#36947;&#36335;&#34892;&#39542;&#26102;&#38388;&#30340;&#37329;&#34701;&#34893;&#29983;&#21697;&#30340;&#20570;&#24066;&#21644;&#23450;&#20215;
&lt;/p&gt;
&lt;p&gt;
Market Making and Pricing of Financial Derivatives based on Road Travel Times. (arXiv:2305.02523v1 [stat.AP])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.02523
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#36947;&#36335;&#34892;&#39542;&#26102;&#38388;&#30340;&#37329;&#34701;&#34893;&#29983;&#21697;&#65292;&#21487;&#20197;&#20316;&#20026;&#19968;&#31181;&#21019;&#26032;&#30340;&#23545;&#20914;&#24037;&#20855;&#65292;&#22312;&#20132;&#36890;&#39046;&#22495;&#21644;&#37329;&#34701;&#24066;&#22330;&#20013;&#37117;&#26377;&#28508;&#22312;&#30340;&#24066;&#22330;&#21644;&#38656;&#27714;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#20132;&#36890;&#26102;&#38388;&#34893;&#29983;&#21697;&#65292;&#36825;&#26159;&#19968;&#31181;&#22522;&#20110;&#36947;&#36335;&#34892;&#39542;&#26102;&#38388;&#30340;&#38750;&#20132;&#26131;&#22522;&#30784;&#36164;&#20135;&#30340;&#37329;&#34701;&#34893;&#29983;&#21697;&#12290;&#22312;&#20132;&#36890;&#39046;&#22495;&#65292;&#20132;&#36890;&#26102;&#38388;&#34893;&#29983;&#21697;&#34987;&#25552;&#20986;&#20316;&#20026;&#19968;&#31181;&#26356;&#21152;&#22522;&#26412;&#30340;&#23450;&#20215;&#26041;&#27861;&#65292;&#22240;&#20026;&#23427;&#19981;&#20165;&#32771;&#34385;&#20102;&#20132;&#36890;&#29366;&#20917;&#30340;&#27700;&#24179;&#65292;&#32780;&#19988;&#32771;&#34385;&#20102;&#20854;&#27874;&#21160;&#24615;&#12290;&#22312;&#37329;&#34701;&#24066;&#22330;&#20013;&#65292;&#20132;&#36890;&#26102;&#38388;&#34893;&#29983;&#21697;&#34987;&#25552;&#20986;&#20316;&#20026;&#19968;&#31181;&#21019;&#26032;&#30340;&#23545;&#20914;&#24037;&#20855;&#65292;&#21487;&#20197;&#23545;&#20914;&#24066;&#22330;&#39118;&#38505;&#65292;&#29305;&#21035;&#26159;&#22312;&#21152;&#23494;&#24066;&#22330;&#21644;&#20256;&#32479;&#38134;&#34892;&#19994;&#32463;&#21382;&#20102;&#26368;&#36817;&#30340;&#21387;&#21147;&#21518;&#12290;&#26412;&#25991;&#28041;&#21450;&#21040;&#20102;&#65288;a&#65289;&#24341;&#20837;&#27492;&#31867;&#34893;&#29983;&#21697;&#30340;&#21160;&#26426;&#65288;&#21363;&#23545;&#23545;&#20914;&#30340;&#35201;&#27714;&#65289;&#65292;&#65288;b&#65289;&#28508;&#22312;&#30340;&#24066;&#22330;&#65292;&#20197;&#21450;&#65288;c&#65289;&#20135;&#21697;&#35774;&#35745;&#21644;&#23450;&#20215;&#26041;&#26696;&#12290;&#23450;&#20215;&#26041;&#26696;&#26159;&#22522;&#20110;&#23454;&#26102;&#20256;&#24863;&#22120;&#25429;&#33719;&#30340;&#34892;&#39542;&#26102;&#38388;&#25968;&#25454;&#35774;&#35745;&#30340;&#65292;&#36825;&#20123;&#25968;&#25454;&#34987;&#24314;&#27169;&#20026;&#22885;&#24681;&#26031;&#22374;-&#20044;&#20262;&#36125;&#20811;&#65288;Ornstein-Uhlenbeck&#65289;&#36807;&#31243;&#65292;&#26356;&#26222;&#36941;&#22320;&#65292;&#26159;&#36830;&#32493;&#26102;&#38388;&#33258;&#22238;&#24402;&#31227;&#21160;&#24179;&#22343;&#65288;CARMA&#65289;&#27169;&#22411;&#12290;&#36825;&#31181;&#27169;&#22411;&#30340;&#26657;&#20934;&#26159;&#36890;&#36807;&#38544;&#34255;&#22240;&#23376;&#27169;&#22411;&#36827;&#34892;&#30340;&#65292;&#35813;&#27169;&#22411;&#25551;&#36848;&#20102;&#20132;&#36890;&#26102;&#38388;&#21160;&#24577;&#12290;
&lt;/p&gt;
&lt;p&gt;
Travel time derivatives are introduced as financial derivatives based on road travel times - a non-tradable underlying asset. In the transportation area, it is proposed as a more fundamental approach to value pricing because it conduct road pricing based on not only level but also volatility of travel time; in the financial market, it is propose as an innovative hedging instrument against market risk, especially after the recent stress of crypto market and traditional banking sector. The paper addresses (a) the motivation for introducing such derivatives (that is, the demand for hedging), (b) the potential market, and (c) the product design and pricing schemes. Pricing schemes are designed based on the travel time data captured by real time sensors, which are modeled as Ornstein - Uhlenbeck processes and more generally, continuous time auto regression moving average (CARMA) models. The calibration of such model is conducted via a hidden factor model, which described the dynamics of tra
&lt;/p&gt;</description></item><item><title>&#24052;&#35199;&#19968;&#25152;&#31934;&#33521;&#22823;&#23398;&#23454;&#26045;&#30340;&#22823;&#35268;&#27169;&#24179;&#26435;&#25919;&#31574;&#26082;&#23545;&#20110;&#40657;&#20154;&#21644;&#20302;&#25910;&#20837;&#23398;&#29983;&#20855;&#26377;&#27491;&#21521;&#25928;&#24212;&#65288;&#20351;&#24471;&#20854;&#23601;&#19994;&#25910;&#20837;&#22686;&#38271;&#65289;&#65292;&#21448;&#23545;&#20110;&#35813;&#26657;&#25490;&#21517;&#26368;&#39640;&#30340;&#23398;&#29983;&#20855;&#26377;&#37325;&#22823;&#36127;&#38754;&#24433;&#21709;&#65288;&#23548;&#33268;&#20182;&#20204;&#23601;&#19994;&#25910;&#20837;&#22823;&#24133;&#19979;&#38477;&#65289;&#12290;</title><link>http://arxiv.org/abs/2305.02513</link><description>&lt;p&gt;
&#24052;&#35199;&#19968;&#25152;&#31934;&#33521;&#22823;&#23398;&#30340;&#22823;&#35268;&#27169;&#24179;&#26435;&#25919;&#31574;&#30340;&#30452;&#25509;&#21644;&#22806;&#28322;&#25928;&#24212;
&lt;/p&gt;
&lt;p&gt;
The Direct and Spillover Effects of Large-scale Affirmative Action at an Elite Brazilian University. (arXiv:2305.02513v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.02513
&lt;/p&gt;
&lt;p&gt;
&#24052;&#35199;&#19968;&#25152;&#31934;&#33521;&#22823;&#23398;&#23454;&#26045;&#30340;&#22823;&#35268;&#27169;&#24179;&#26435;&#25919;&#31574;&#26082;&#23545;&#20110;&#40657;&#20154;&#21644;&#20302;&#25910;&#20837;&#23398;&#29983;&#20855;&#26377;&#27491;&#21521;&#25928;&#24212;&#65288;&#20351;&#24471;&#20854;&#23601;&#19994;&#25910;&#20837;&#22686;&#38271;&#65289;&#65292;&#21448;&#23545;&#20110;&#35813;&#26657;&#25490;&#21517;&#26368;&#39640;&#30340;&#23398;&#29983;&#20855;&#26377;&#37325;&#22823;&#36127;&#38754;&#24433;&#21709;&#65288;&#23548;&#33268;&#20182;&#20204;&#23601;&#19994;&#25910;&#20837;&#22823;&#24133;&#19979;&#38477;&#65289;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#19968;&#39033;&#38024;&#23545;&#24052;&#35199;&#19968;&#25152;&#31934;&#33521;&#22823;&#23398;45%&#25307;&#25910;&#40657;&#20154;&#21644;&#20302;&#25910;&#20837;&#23398;&#29983;&#30340;&#24179;&#26435;&#25919;&#31574;&#30340;&#25928;&#24212;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#36890;&#36807;&#24179;&#26435;&#25307;&#29983;&#36890;&#36947;&#20837;&#23398;&#30340;&#36793;&#32536;&#24405;&#21462;&#23398;&#29983;&#30340;&#26089;&#26399;&#32844;&#19994;&#25910;&#20837;&#22686;&#21152;&#20102;14%&#12290;&#20294;&#26159;&#65292;&#24179;&#26435;&#25919;&#31574;&#30340;&#23454;&#26045;&#20063;&#23548;&#33268;&#20102;&#35813;&#22823;&#23398;&#25490;&#21517;&#26368;&#39640;&#30340;&#23398;&#29983;&#25910;&#20837;&#22823;&#24133;&#19979;&#38477;&#12290;&#25105;&#20204;&#25552;&#20379;&#35777;&#25454;&#34920;&#26126;&#65292;&#39640;&#25490;&#21517;&#23398;&#29983;&#25910;&#20837;&#30340;&#36127;&#38754;&#28322;&#20986;&#25928;&#24212;&#26082;&#26159;&#30001;&#20110;&#20154;&#21147;&#36164;&#26412;&#31215;&#32047;&#30340;&#20943;&#23569;&#65292;&#20063;&#26159;&#30001;&#20110;&#31038;&#20132;&#32593;&#32476;&#20215;&#20540;&#30340;&#19979;&#38477;&#25152;&#23548;&#33268;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
We examine the effects of an affirmative action policy at an elite Brazilian university that reserved 45 percent of admission slots for Black and low-income students. We find that marginally-admitted students who enrolled through the affirmative action tracks experienced a 14 percent increase in early-career earnings. But the adoption of affirmative action also caused a large decrease in earnings for the university's most highly-ranked students. We present evidence that the negative spillover effects on highly-ranked students' earnings were driven by both a reduction in human capital accumulation and a decline in the value of networking.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#26500;&#24314;&#20102;&#19968;&#20010;&#26032;&#30340;&#27169;&#22411;&#65292;&#23558;&#26032;&#20852;&#25216;&#26415;&#19982;&#20840;&#29699;&#39046;&#20808;&#30340;&#30740;&#21457;&#25903;&#20986;&#20844;&#21496;&#30456;&#36830;&#25509;&#65292;&#20174;&#32780;&#33719;&#24471;&#20102;&#19968;&#20010;&#26032;&#30340;&#22320;&#22270;&#65292;&#21487;&#20197;&#20998;&#26512;&#20844;&#21496;&#19982;&#26032;&#20852;&#25216;&#26415;&#20043;&#38388;&#30340;&#26368;&#23494;&#20999;&#32852;&#31995;&#65292;&#24182;&#24471;&#21040;&#20102;&#26174;&#33879;&#30340;&#27491;&#30456;&#20851;&#24615;&#39564;&#35777;&#12290;&#27492;&#27169;&#22411;&#21487;&#29992;&#20110;&#29305;&#23450;&#25216;&#26415;&#20027;&#39064;&#12289;&#20844;&#21496;&#31454;&#20105;&#26684;&#23616;&#21644;&#22269;&#23478;&#21033;&#30410;&#31561;&#39046;&#22495;&#30340;&#30740;&#31350;&#12290;</title><link>http://arxiv.org/abs/2305.02476</link><description>&lt;p&gt;
&#20449;&#24687;&#21270;&#21019;&#26032;&#31649;&#29702;&#65306;&#23558;&#39046;&#20808;&#30340;&#30740;&#21457;&#20844;&#21496;&#19982;&#26032;&#20852;&#25216;&#26415;&#30456;&#36830;&#25509;
&lt;/p&gt;
&lt;p&gt;
Informing Innovation Management: Linking Leading R&amp;D Firms and Emerging Technologies. (arXiv:2305.02476v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.02476
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#26500;&#24314;&#20102;&#19968;&#20010;&#26032;&#30340;&#27169;&#22411;&#65292;&#23558;&#26032;&#20852;&#25216;&#26415;&#19982;&#20840;&#29699;&#39046;&#20808;&#30340;&#30740;&#21457;&#25903;&#20986;&#20844;&#21496;&#30456;&#36830;&#25509;&#65292;&#20174;&#32780;&#33719;&#24471;&#20102;&#19968;&#20010;&#26032;&#30340;&#22320;&#22270;&#65292;&#21487;&#20197;&#20998;&#26512;&#20844;&#21496;&#19982;&#26032;&#20852;&#25216;&#26415;&#20043;&#38388;&#30340;&#26368;&#23494;&#20999;&#32852;&#31995;&#65292;&#24182;&#24471;&#21040;&#20102;&#26174;&#33879;&#30340;&#27491;&#30456;&#20851;&#24615;&#39564;&#35777;&#12290;&#27492;&#27169;&#22411;&#21487;&#29992;&#20110;&#29305;&#23450;&#25216;&#26415;&#20027;&#39064;&#12289;&#20844;&#21496;&#31454;&#20105;&#26684;&#23616;&#21644;&#22269;&#23478;&#21033;&#30410;&#31561;&#39046;&#22495;&#30340;&#30740;&#31350;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#29702;&#35299;&#26032;&#20852;&#25216;&#26415;&#21644;&#30740;&#21457;&#20043;&#38388;&#30340;&#20851;&#31995;&#19968;&#30452;&#26159;&#20844;&#21496;&#12289;&#25919;&#31574;&#21046;&#23450;&#32773;&#21644;&#30740;&#31350;&#20154;&#21592;&#20851;&#27880;&#30340;&#28966;&#28857;&#12290;&#26412;&#25991;&#23558;&#26032;&#22411;&#25968;&#25454;&#26469;&#28304;&#21644;&#24037;&#20855;&#19982;&#19968;&#31181;&#26032;&#39062;&#30340;&#25216;&#26415;&#30456;&#32467;&#21512;&#65292;&#26500;&#24314;&#19968;&#20010;&#23558;&#19968;&#32452;&#26032;&#20852;&#25216;&#26415;&#19982;&#20840;&#29699;&#39046;&#20808;&#30340;&#30740;&#21457;&#25903;&#20986;&#20844;&#21496;&#30456;&#36830;&#25509;&#30340;&#27169;&#22411;&#12290;&#32467;&#26524;&#26159;&#30011;&#20986;&#20102;&#36825;&#20010;&#39046;&#22495;&#30340;&#26032;&#22320;&#22270;&#12290;&#36825;&#24352;&#22320;&#22270;&#23637;&#31034;&#20102;&#19981;&#21516;&#25216;&#26415;&#21644;&#20844;&#21496;&#22312;&#23427;&#20204;&#23545;&#24212;&#30340;&#32500;&#22522;&#30334;&#31185;&#36164;&#26009;&#20013;&#25152;&#21253;&#21547;&#30340;&#30693;&#35782;&#30340;&#30456;&#20284;&#31243;&#24230;&#65292;&#21487;&#20197;&#20998;&#26512;&#20844;&#21496;&#19982;&#26032;&#20852;&#25216;&#26415;&#20043;&#38388;&#30340;&#26368;&#23494;&#20999;&#32852;&#31995;&#12290;&#19982;&#30456;&#20851;&#30340;&#19968;&#32452;&#19987;&#21033;&#25968;&#25454;&#30340;&#26174;&#33879;&#27491;&#30456;&#20851;&#39564;&#35777;&#20102;&#35813;&#26041;&#27861;&#30340;&#26377;&#25928;&#24615;&#12290;&#26368;&#21518;&#65292;&#19968;&#32452;&#24490;&#29615;&#32463;&#27982;&#26032;&#20852;&#25216;&#26415;&#34987;&#21305;&#37197;&#21040;&#20102;&#23427;&#20204;&#26368;&#25509;&#36817;&#30340;&#39046;&#20808;&#30740;&#21457;&#25903;&#20986;&#20844;&#21496;&#65292;&#36825;&#20419;&#36827;&#20102;&#26410;&#26469;&#38024;&#23545;&#29305;&#23450;&#25216;&#26415;&#20027;&#39064;&#12289;&#20844;&#21496;&#31454;&#20105;&#26684;&#23616;&#21644;&#22269;&#23478;&#21033;&#30410;&#31561;&#26356;&#24191;&#27867;&#25110;&#26356;&#29421;&#31364;&#24212;&#29992;&#27169;&#22411;&#30340;&#30740;&#31350;&#24819;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
Understanding the relationship between emerging technology and research and development has long been of interest to companies, policy makers and researchers. In this paper new sources of data and tools are combined with a novel technique to construct a model linking a defined set of emerging technologies with the global leading R&amp;D spending companies. The result is a new map of this landscape. This map reveals the proximity of technologies and companies in the knowledge embedded in their corresponding Wikipedia profiles, enabling analysis of the closest associations between the companies and emerging technologies. A significant positive correlation for a related set of patent data validates the approach. Finally, a set of Circular Economy Emerging Technologies are matched to their closest leading R&amp;D spending company, prompting future research ideas in broader or narrower application of the model to specific technology themes, company competitor landscapes and national interest concer
&lt;/p&gt;</description></item><item><title>&#36825;&#31687;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#36817;&#20284;&#20989;&#25968;&#24046;&#20998;&#30340;&#26041;&#27861;&#65292;&#26088;&#22312;&#35299;&#20915;&#38754;&#26495;&#25968;&#25454;&#27169;&#22411;&#20013;&#25512;&#26029;&#20844;&#20849;&#21442;&#25968;&#26102;&#30340;&#38468;&#24102;&#21442;&#25968;&#38382;&#39064;&#65292;&#36866;&#29992;&#20110;&#35768;&#22810;&#38754;&#26495;&#25968;&#25454;&#27169;&#22411;&#65292;&#21363;&#20351;&#26102;&#38388;&#26399;&#25968;&#36739;&#23567;&#12290;</title><link>http://arxiv.org/abs/2301.13736</link><description>&lt;p&gt;
&#36817;&#20284;&#20989;&#25968;&#24046;&#20998;
&lt;/p&gt;
&lt;p&gt;
Approximate Functional Differencing. (arXiv:2301.13736v2 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2301.13736
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#36817;&#20284;&#20989;&#25968;&#24046;&#20998;&#30340;&#26041;&#27861;&#65292;&#26088;&#22312;&#35299;&#20915;&#38754;&#26495;&#25968;&#25454;&#27169;&#22411;&#20013;&#25512;&#26029;&#20844;&#20849;&#21442;&#25968;&#26102;&#30340;&#38468;&#24102;&#21442;&#25968;&#38382;&#39064;&#65292;&#36866;&#29992;&#20110;&#35768;&#22810;&#38754;&#26495;&#25968;&#25454;&#27169;&#22411;&#65292;&#21363;&#20351;&#26102;&#38388;&#26399;&#25968;&#36739;&#23567;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38754;&#26495;&#25968;&#25454;&#27169;&#22411;&#20013;&#20851;&#20110;&#20844;&#20849;&#21442;&#25968;&#30340;&#25512;&#26029;&#26159; Neyman &#21644; Scott&#65288;1948&#65289;&#25152;&#31216;&#30340;&#38468;&#24102;&#21442;&#25968;&#38382;&#39064;&#65288;IPP&#65289;&#30340;&#20856;&#22411;&#20363;&#23376;&#12290;&#36825;&#20010;&#38382;&#39064;&#30340;&#19968;&#31181;&#35299;&#20915;&#26041;&#27861;&#26159;&#20989;&#25968;&#24046;&#20998;&#65288;Bonhomme 2012&#65289;&#65292;&#23427;&#36866;&#29992;&#20110;&#26102;&#38388;&#26399;&#25968; T &#22266;&#23450;&#65288;&#21487;&#33021;&#24456;&#23567;&#65289;&#30340;&#24773;&#20917;&#65292;&#20294;&#36825;&#31181;&#35299;&#20915;&#26041;&#27861;&#24182;&#19981;&#36866;&#29992;&#20110;&#25152;&#26377;&#26377;&#20852;&#36259;&#30340;&#38754;&#26495;&#25968;&#25454;&#27169;&#22411;&#12290;&#21478;&#19968;&#31181;&#35299;&#20915; IPP &#30340;&#26041;&#27861;&#26159;&#8220;&#22823; T&#8221;&#20559;&#24046;&#26657;&#27491;&#65288;&#30001; Hahn &#21644; Kuersteiner 2002 &#20197;&#21450; Hahn &#21644; Newey 2004 &#24320;&#21019;&#65289;&#65292;&#20294;&#21482;&#26377;&#24403; T &#36275;&#22815;&#22823;&#26102;&#25165;&#33021;&#20445;&#35777;&#20854;&#26377;&#25928;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#32479;&#19968;&#30340;&#26041;&#27861;&#65292;&#23558;&#36825;&#20004;&#31181;&#30475;&#20284;&#19981;&#30456;&#20851;&#30340; IPP &#35299;&#20915;&#26041;&#27861;&#32852;&#31995;&#36215;&#26469;&#12290;&#22312;&#27492;&#22522;&#30784;&#19978;&#65292;&#25105;&#20204;&#25552;&#20379;&#20102;&#19968;&#20010;&#36817;&#20284;&#20989;&#25968;&#24046;&#20998;&#30340;&#29256;&#26412;&#65292;&#21363;&#19968;&#31181;&#36817;&#20284; IPP &#35299;&#20915;&#26041;&#26696;&#65292;&#36866;&#29992;&#20110;&#22823;&#31867;&#38754;&#26495;&#25968;&#25454;&#27169;&#22411;&#65292;&#21363;&#20351; T &#30456;&#23545;&#36739;&#23567;&#12290;
&lt;/p&gt;
&lt;p&gt;
Inference on common parameters in panel data models with individual-specific fixed effects is a classic example of Neyman and Scott's (1948) incidental parameter problem (IPP). One solution to this IPP is functional differencing (Bonhomme 2012), which works when the number of time periods T is fixed (and may be small), but this solution is not applicable to all panel data models of interest. Another solution, which applies to a larger class of models, is "large-T" bias correction (pioneered by Hahn and Kuersteiner 2002 and Hahn and Newey 2004), but this is only guaranteed to work well when T is sufficiently large. This paper provides a unified approach that connects those two seemingly disparate solutions to the IPP. In doing so, we provide an approximate version of functional differencing, that is, an approximate solution to the IPP that is applicable to a large class of panel data models even when T is relatively small.
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#21407;&#21017;&#30340;&#39044;&#27979;&#21306;&#38388;&#26041;&#27861;&#65292;&#29992;&#20110;&#37327;&#21270;&#21512;&#25104;&#23545;&#29031;&#39044;&#27979;&#25110;&#20272;&#35745;&#22312;&#38169;&#20301;&#22788;&#29702;&#37319;&#29992;&#30340;&#24773;&#20917;&#19979;&#30340;&#19981;&#30830;&#23450;&#24615;&#12290;</title><link>http://arxiv.org/abs/2210.05026</link><description>&lt;p&gt;
&#24102;&#26377;&#38169;&#20301;&#22788;&#29702;&#37319;&#29992;&#30340;&#21512;&#25104;&#23545;&#29031;&#20013;&#30340;&#19981;&#30830;&#23450;&#24615;&#37327;&#21270;
&lt;/p&gt;
&lt;p&gt;
Uncertainty Quantification in Synthetic Controls with Staggered Treatment Adoption. (arXiv:2210.05026v2 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2210.05026
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#21407;&#21017;&#30340;&#39044;&#27979;&#21306;&#38388;&#26041;&#27861;&#65292;&#29992;&#20110;&#37327;&#21270;&#21512;&#25104;&#23545;&#29031;&#39044;&#27979;&#25110;&#20272;&#35745;&#22312;&#38169;&#20301;&#22788;&#29702;&#37319;&#29992;&#30340;&#24773;&#20917;&#19979;&#30340;&#19981;&#30830;&#23450;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#22522;&#20110;&#21407;&#21017;&#30340;&#39044;&#27979;&#21306;&#38388;&#65292;&#29992;&#20110;&#37327;&#21270;&#22312;&#38169;&#20301;&#22788;&#29702;&#37319;&#29992;&#30340;&#24773;&#20917;&#19979;&#22823;&#31867;&#21512;&#25104;&#23545;&#29031;&#39044;&#27979;&#25110;&#20272;&#35745;&#30340;&#19981;&#30830;&#23450;&#24615;&#65292;&#25552;&#20379;&#31934;&#30830;&#30340;&#38750;&#28176;&#36817;&#35206;&#30422;&#27010;&#29575;&#20445;&#35777;&#12290;&#20174;&#26041;&#27861;&#35770;&#30340;&#35282;&#24230;&#26469;&#30475;&#65292;&#25105;&#20204;&#25552;&#20379;&#20102;&#23545;&#38656;&#35201;&#39044;&#27979;&#30340;&#19981;&#21516;&#22240;&#26524;&#37327;&#36827;&#34892;&#35814;&#32454;&#35752;&#35770;&#65292;&#25105;&#20204;&#31216;&#20854;&#20026;&#8220;&#22240;&#26524;&#39044;&#27979;&#37327;&#8221;&#65292;&#20801;&#35768;&#22312;&#21487;&#33021;&#19981;&#21516;&#26102;&#21051;&#36827;&#34892;&#22810;&#20010;&#22788;&#29702;&#21333;&#20803;&#30340;&#22788;&#29702;&#37319;&#29992;&#12290;&#20174;&#29702;&#35770;&#30340;&#35282;&#24230;&#26469;&#30475;&#65292;&#25105;&#20204;&#30340;&#19981;&#30830;&#23450;&#24615;&#37327;&#21270;&#26041;&#27861;&#25552;&#39640;&#20102;&#20043;&#21069;&#25991;&#29486;&#30340;&#27700;&#24179;&#65292;&#20855;&#20307;&#34920;&#29616;&#22312;&#65306;&#65288;i&#65289;&#35206;&#30422;&#20102;&#38169;&#20301;&#37319;&#29992;&#35774;&#32622;&#20013;&#30340;&#22823;&#31867;&#22240;&#26524;&#39044;&#27979;&#37327;&#65292;&#65288;ii&#65289;&#20801;&#35768;&#20855;&#26377;&#21487;&#33021;&#38750;&#32447;&#24615;&#32422;&#26463;&#30340;&#21512;&#25104;&#23545;&#29031;&#26041;&#27861;&#65292;&#65288;iii&#65289;&#25552;&#20986;&#21487;&#25193;&#23637;&#30340;&#40065;&#26834;&#38181;&#20248;&#21270;&#26041;&#27861;&#21644;&#22522;&#20110;&#21407;&#21017;&#30340;&#25968;&#25454;&#39537;&#21160;&#35843;&#21442;&#36873;&#25321;&#65292;&#65288;iv&#65289;&#25552;&#20379;&#20102;&#22312;&#21518;&#22788;&#29702;&#26399;&#38388;&#36827;&#34892;&#26377;&#25928;&#22343;&#21248;&#25512;&#26029;&#12290;&#25105;&#20204;&#36890;&#36807;&#23454;&#35777;&#24212;&#29992;&#23637;&#31034;&#20102;&#25105;&#20204;&#30340;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
We propose principled prediction intervals to quantify the uncertainty of a large class of synthetic control predictions or estimators in settings with staggered treatment adoption, offering precise non-asymptotic coverage probability guarantees. From a methodological perspective, we provide a detailed discussion of different causal quantities to be predicted, which we call `causal predictands', allowing for multiple treated units with treatment adoption at possibly different points in time. From a theoretical perspective, our uncertainty quantification methods improve on prior literature by (i) covering a large class of causal predictands in staggered adoption settings, (ii) allowing for synthetic control methods with possibly nonlinear constraints, (iii) proposing scalable robust conic optimization methods and principled data-driven tuning parameter selection, and (iv) offering valid uniform inference across post-treatment periods. We illustrate our methodology with an empirical appl
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#22312;&#25928;&#29992;&#26377;&#38480;&#30340;&#29615;&#22659;&#20013;&#24102;&#26377;&#35777;&#25454;&#30340;&#20840;&#38754;&#23454;&#29616;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#26032;&#30340;&#35777;&#25454;&#20998;&#31867;&#30340;&#21487;&#20197;&#22312;&#20004;&#20010;&#20195;&#29702;&#20154;&#19979;&#23454;&#29616;Nash&#22343;&#34913;&#30340;&#30452;&#25509;&#30495;&#30456;&#26426;&#21046;&#65292;&#24182;&#32473;&#20986;&#20102;&#20851;&#20110;&#37325;&#35746;&#21512;&#27861;&#30340;&#21452;&#36793;&#21512;&#21516;&#30340;&#24517;&#35201;&#20805;&#20998;&#26465;&#20214;&#12290;</title><link>http://arxiv.org/abs/2105.12298</link><description>&lt;p&gt;
&#30452;&#25509;&#35777;&#25454;&#23454;&#29616;
&lt;/p&gt;
&lt;p&gt;
Direct Implementation with Evidence. (arXiv:2105.12298v5 [econ.TH] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2105.12298
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#22312;&#25928;&#29992;&#26377;&#38480;&#30340;&#29615;&#22659;&#20013;&#24102;&#26377;&#35777;&#25454;&#30340;&#20840;&#38754;&#23454;&#29616;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#26032;&#30340;&#35777;&#25454;&#20998;&#31867;&#30340;&#21487;&#20197;&#22312;&#20004;&#20010;&#20195;&#29702;&#20154;&#19979;&#23454;&#29616;Nash&#22343;&#34913;&#30340;&#30452;&#25509;&#30495;&#30456;&#26426;&#21046;&#65292;&#24182;&#32473;&#20986;&#20102;&#20851;&#20110;&#37325;&#35746;&#21512;&#27861;&#30340;&#21452;&#36793;&#21512;&#21516;&#30340;&#24517;&#35201;&#20805;&#20998;&#26465;&#20214;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#22312;&#25928;&#29992;&#26377;&#38480;&#30340;&#29615;&#22659;&#20013;&#65292;&#24102;&#26377;&#35777;&#25454;&#30340;&#20840;&#38754;&#23454;&#29616;&#12290;&#25105;&#20204;&#35777;&#26126;&#65292;&#22914;&#26524;&#31038;&#20250;&#36873;&#25321;&#20989;&#25968;&#28385;&#36275;&#30001;BL2012&#25552;&#20986;&#30340;&#21487;&#27979;&#24615;&#26465;&#20214;&#65292;&#21017;&#22312;&#30452;&#25509;&#30495;&#30456;&#26426;&#21046;&#19979;&#65292;&#31038;&#20250;&#36873;&#25321;&#20989;&#25968;&#26159;Nash&#21487;&#23454;&#29616;&#30340;&#12290;&#35813;&#26426;&#21046;&#22522;&#20110;&#23545;&#35854;&#35328;&#26681;&#25454;&#20854;&#35777;&#25454;&#21487;&#21453;&#39539;&#24615;&#30340;&#26032;&#20998;&#31867;&#65292;&#21482;&#38656;&#35201;&#20004;&#20010;&#20195;&#29702;&#20154;&#65292;&#32771;&#34385;&#21040;&#28151;&#21512;&#31574;&#30053;&#22343;&#34913;&#21644;&#35777;&#25454;&#36153;&#29992;&#12290;&#34429;&#28982;&#20351;&#29992;&#36135;&#24065;&#36716;&#31227;&#65292;&#20294;&#23427;&#20204;&#19981;&#22312;&#22343;&#34913;&#19979;&#19988;&#21487;&#20197;&#22312;&#19977;&#20010;&#25110;&#26356;&#22810;&#20195;&#29702;&#20154;&#20013;&#24179;&#34913;&#12290;&#22312;KT2012&#25552;&#20986;&#30340;&#35777;&#25454;&#26356;&#20016;&#23500;&#30340;&#27169;&#22411;&#20013;&#65292;&#25105;&#20204;&#24314;&#31435;&#20102;&#22312;&#30452;&#25509;&#30495;&#30456;&#26426;&#21046;&#19979;&#23454;&#29616;&#20004;&#20010;&#25110;&#26356;&#22810;&#20195;&#29702;&#20154;&#30340;&#32431;&#31574;&#30053;&#12290;&#25105;&#20204;&#36824;&#26681;&#25454;&#35854;&#35328;&#30340;&#20998;&#31867;&#33719;&#24471;&#20102;&#35777;&#25454;&#32467;&#26500;&#23545;&#37325;&#35746;&#21512;&#27861;&#30340;&#21452;&#36793;&#21512;&#21516;&#30340;&#24517;&#35201;&#20805;&#20998;&#26465;&#20214;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study full implementation with evidence in an environment with bounded utilities. We show that a social choice function is Nash implementable in a direct revelation mechanism if and only if it satisfies the measurability condition proposed by &lt;cite&gt;BL2012&lt;/cite&gt;. Building on a novel classification of lies according to their refutability with evidence, the mechanism requires only two agents, accounts for mixed-strategy equilibria and accommodates evidentiary costs. While monetary transfers are used, they are off the equilibrium and can be balanced with three or more agents. In a richer model of evidence due to &lt;cite&gt;KT2012&lt;/cite&gt;, we establish pure-strategy implementation with two or more agents in a direct revelation mechanism. We also obtain a necessary and sufficient condition on the evidence structure for renegotiation-proof bilateral contracts, based on the classification of lies.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#22522;&#20110;&#32467;&#26524;&#25277;&#26679;&#30340;&#22240;&#26524;&#25512;&#26029;&#65292;&#21457;&#29616;&#24378;&#26080;&#20559;&#24615;&#19981;&#24635;&#26159;&#20687;&#38543;&#26426;&#25277;&#26679;&#19979;&#37027;&#26679;&#24378;&#22823;&#65292;&#24182;&#19988;&#26576;&#20123;&#21333;&#35843;&#24615;&#20551;&#35774;&#22312;&#38160;&#21033;&#35782;&#21035;&#38388;&#38548;&#26041;&#38754;&#20135;&#29983;&#21487;&#27604;&#36739;&#30340;&#32467;&#26524;&#12290; &#36890;&#36807;&#31639;&#27861;&#25512;&#26029;&#20986;&#21442;&#25968;&#24182;&#29992;&#23454;&#35777;&#20363;&#23376;&#35777;&#26126;&#20102;&#26041;&#27861;&#30340;&#36129;&#29486;&#12290;</title><link>http://arxiv.org/abs/2004.08318</link><description>&lt;p&gt;
&#22522;&#20110;&#32467;&#26524;&#25277;&#26679;&#30340;&#22240;&#26524;&#25512;&#26029;&#21644;&#21333;&#35843;&#24615;&#20551;&#35774;
&lt;/p&gt;
&lt;p&gt;
Causal Inference under Outcome-Based Sampling with Monotonicity Assumptions. (arXiv:2004.08318v5 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2004.08318
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22522;&#20110;&#32467;&#26524;&#25277;&#26679;&#30340;&#22240;&#26524;&#25512;&#26029;&#65292;&#21457;&#29616;&#24378;&#26080;&#20559;&#24615;&#19981;&#24635;&#26159;&#20687;&#38543;&#26426;&#25277;&#26679;&#19979;&#37027;&#26679;&#24378;&#22823;&#65292;&#24182;&#19988;&#26576;&#20123;&#21333;&#35843;&#24615;&#20551;&#35774;&#22312;&#38160;&#21033;&#35782;&#21035;&#38388;&#38548;&#26041;&#38754;&#20135;&#29983;&#21487;&#27604;&#36739;&#30340;&#32467;&#26524;&#12290; &#36890;&#36807;&#31639;&#27861;&#25512;&#26029;&#20986;&#21442;&#25968;&#24182;&#29992;&#23454;&#35777;&#20363;&#23376;&#35777;&#26126;&#20102;&#26041;&#27861;&#30340;&#36129;&#29486;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#26681;&#25454;&#26696;&#20363;&#25511;&#21046;&#21644;&#26696;&#20363;&#32676;&#20307;&#21462;&#26679;&#36827;&#34892;&#22240;&#26524;&#25512;&#26029;&#30340;&#26041;&#27861;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#25105;&#20204;&#20851;&#27880;&#20108;&#20803;&#32467;&#26524;&#21644;&#20108;&#20803;&#27835;&#30103;&#30340;&#24773;&#20917;&#65292;&#20854;&#20013;&#24863;&#20852;&#36259;&#30340;&#21442;&#25968;&#26159;&#36890;&#36807;&#28508;&#22312;&#32467;&#26524;&#26694;&#26550;&#23450;&#20041;&#30340;&#22240;&#26524;&#30456;&#23545;&#21644;&#21487;&#24402;&#22240;&#39118;&#38505;&#12290;&#25105;&#20204;&#21457;&#29616;&#24378;&#26080;&#20559;&#24615;&#19981;&#24635;&#26159;&#20687;&#38543;&#26426;&#25277;&#26679;&#19979;&#37027;&#26679;&#24378;&#22823;&#65292;&#24182;&#19988;&#26576;&#20123;&#21333;&#35843;&#24615;&#20551;&#35774;&#22312;&#38160;&#21033;&#35782;&#21035;&#38388;&#38548;&#26041;&#38754;&#20135;&#29983;&#21487;&#27604;&#36739;&#30340;&#32467;&#26524;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#36890;&#24120;&#30340;&#27604;&#20540;&#27604;&#22312;&#21333;&#35843;&#27835;&#30103;&#21453;&#24212;&#21644;&#21333;&#35843;&#27835;&#30103;&#36873;&#25321;&#20551;&#35774;&#19979;&#34987;&#35777;&#26126;&#26159;&#22240;&#26524;&#30456;&#23545;&#39118;&#38505;&#30340;&#38160;&#21033;&#35782;&#21035;&#19978;&#30028;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#32858;&#21512;&#22312;&#21327;&#21464;&#37327;&#30340;&#30495;&#23454;&#20154;&#21475;&#20998;&#24067;&#19978;&#30340;&#22240;&#26524;&#21442;&#25968;&#25512;&#26029;&#31639;&#27861;&#12290;&#25105;&#20204;&#36890;&#36807;&#30740;&#31350;&#19977;&#20010;&#23454;&#35777;&#20363;&#23376;&#23637;&#31034;&#20102;&#25105;&#20204;&#26041;&#27861;&#30340;&#26377;&#29992;&#24615;&#65306;&#22312;&#24052;&#22522;&#26031;&#22374;&#36827;&#20837;&#33879;&#21517;&#22823;&#23398;&#30340;&#31169;&#31435;&#23398;&#26657;&#21463;&#30410;&#38382;&#39064;&#19978;&#65307;&#22312;&#30041;&#22312;&#23398;&#26657;&#21644;&#25918;&#24323;&#23398;&#26657;&#26089;&#26399;&#30340;&#20851;&#31995;&#38382;&#39064;&#19978;&#65307;&#22312;&#39044;&#27979;&#23703;&#20301;&#22521;&#35757;&#25928;&#26524;&#38382;&#39064;&#19978;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study causal inference under case-control and case-population sampling. Specifically, we focus on the binary-outcome and binary-treatment case, where the parameters of interest are causal relative and attributable risks defined via the potential outcome framework. It is shown that strong ignorability is not always as powerful as it is under random sampling and that certain monotonicity assumptions yield comparable results in terms of sharp identified intervals. Specifically, the usual odds ratio is shown to be a sharp identified upper bound on causal relative risk under the monotone treatment response and monotone treatment selection assumptions. We offer algorithms for inference on the causal parameters that are aggregated over the true population distribution of the covariates. We show the usefulness of our approach by studying three empirical examples: the benefit of attending private school for entering a prestigious university in Pakistan; the relationship between staying in sc
&lt;/p&gt;</description></item></channel></rss>