<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#35813;&#30740;&#31350;&#20174;&#29702;&#35770;&#21644;&#23454;&#35777;&#35282;&#24230;&#30740;&#31350;&#20102;&#30456;&#20284;&#24037;&#20316;&#24212;&#33719;&#24471;&#21516;&#24037;&#21516;&#37228;&#25919;&#31574;&#65292;&#24182;&#21457;&#29616;&#35813;&#25919;&#31574;&#21482;&#36866;&#29992;&#20110;&#29305;&#23450;&#21463;&#20445;&#25252;&#31867;&#21035;&#26102;&#20250;&#22686;&#21152;&#24615;&#21035;&#24037;&#36164;&#24046;&#36317;&#65292;&#32780;&#23545;&#25152;&#26377;&#31867;&#21035;&#22343;&#36866;&#29992;&#30340;EPSW&#21017;&#21487;&#20197;&#20943;&#23567;&#24615;&#21035;&#24037;&#36164;&#24046;&#36317;&#12290;</title><link>http://arxiv.org/abs/2306.17111</link><description>&lt;p&gt;
&#30456;&#20284;&#24037;&#20316;&#24212;&#33719;&#24471;&#21516;&#24037;&#21516;&#37228;&#65306;&#29702;&#35770;&#21644;&#23454;&#35777;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Equal Pay for Similar Work. (arXiv:2306.17111v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.17111
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#20174;&#29702;&#35770;&#21644;&#23454;&#35777;&#35282;&#24230;&#30740;&#31350;&#20102;&#30456;&#20284;&#24037;&#20316;&#24212;&#33719;&#24471;&#21516;&#24037;&#21516;&#37228;&#25919;&#31574;&#65292;&#24182;&#21457;&#29616;&#35813;&#25919;&#31574;&#21482;&#36866;&#29992;&#20110;&#29305;&#23450;&#21463;&#20445;&#25252;&#31867;&#21035;&#26102;&#20250;&#22686;&#21152;&#24615;&#21035;&#24037;&#36164;&#24046;&#36317;&#65292;&#32780;&#23545;&#25152;&#26377;&#31867;&#21035;&#22343;&#36866;&#29992;&#30340;EPSW&#21017;&#21487;&#20197;&#20943;&#23567;&#24615;&#21035;&#24037;&#36164;&#24046;&#36317;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21516;&#24037;&#21516;&#37228;&#27861;&#35201;&#27714;&#20844;&#21496;&#20869;&#20174;&#20107;&#8220;&#30456;&#20284;&#8221;&#24037;&#20316;&#30340;&#21592;&#24037;&#33719;&#24471;&#30456;&#31561;&#30340;&#24037;&#36164;&#12290;&#25105;&#20204;&#20174;&#29702;&#35770;&#21644;&#23454;&#35777;&#30340;&#35282;&#24230;&#30740;&#31350;&#20102;&#36825;&#31181;&#8220;&#30456;&#20284;&#24037;&#20316;&#24212;&#33719;&#24471;&#21516;&#24037;&#21516;&#37228;&#8221;&#65288;EPSW&#65289;&#25919;&#31574;&#65292;&#24182;&#21033;&#29992;2009&#24180;&#26234;&#21033;&#30340;&#23454;&#35777;&#25968;&#25454;&#39564;&#35777;&#20102;&#25105;&#20204;&#27169;&#22411;&#30340;&#39044;&#27979;&#32467;&#26524;&#12290;&#24403;EPSW&#21482;&#36866;&#29992;&#20110;&#21463;&#20445;&#25252;&#31867;&#21035;&#65288;&#20363;&#22914;&#65292;&#20219;&#20309;&#22899;&#24615;&#19981;&#33021;&#27604;&#20219;&#20309;&#30456;&#20284;&#30007;&#24615;&#33719;&#24471;&#26356;&#20302;&#30340;&#24037;&#36164;&#65292;&#21453;&#20043;&#20134;&#28982;&#65289;&#26102;&#65292;&#20844;&#21496;&#20250;&#25353;&#24615;&#21035;&#23545;&#20854;&#21592;&#24037;&#36827;&#34892;&#20998;&#31163;&#12290;&#24403;&#21171;&#21160;&#21147;&#24066;&#22330;&#20013;&#30007;&#24615;&#22810;&#20110;&#22899;&#24615;&#26102;&#65292;EPSW&#20250;&#22686;&#21152;&#24615;&#21035;&#24037;&#36164;&#24046;&#36317;&#12290;&#30456;&#27604;&#20043;&#19979;&#65292;&#19981;&#22522;&#20110;&#21463;&#20445;&#25252;&#31867;&#21035;&#30340;EPSW&#21487;&#20197;&#20943;&#23567;&#24615;&#21035;&#24037;&#36164;&#24046;&#36317;&#12290;
&lt;/p&gt;
&lt;p&gt;
Equal pay laws increasingly require that workers doing "similar" work are paid equal wages within firm. We study such "equal pay for similar work" (EPSW) policies theoretically and test our model's predictions empirically using evidence from a 2009 Chilean EPSW. When EPSW only binds across protected class (e.g., no woman can be paid less than any similar man, and vice versa), firms segregate their workforce by gender. When there are more men than women in a labor market, EPSW increases the gender wage gap. By contrast, EPSW that is not based on protected class can decrease the gender wage gap.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#21152;&#23494;&#36135;&#24065;&#24066;&#22330;&#30340;&#26102;&#38388;&#27169;&#24335;&#65292;&#21457;&#29616;&#19982;&#20256;&#32479;&#32929;&#31080;&#24066;&#22330;&#19981;&#21516;&#30340;&#24066;&#22330;&#34892;&#20026;&#65292;&#34920;&#29616;&#20026;&#19977;&#20010;&#22686;&#24378;&#27963;&#21160;&#38454;&#27573;&#19982;&#19981;&#21516;&#26102;&#27573;&#30340;&#20132;&#26131;&#26102;&#27573;&#30456;&#19968;&#33268;&#12290;&#22312;15&#20998;&#38047;&#38388;&#38548;&#20869;&#20986;&#29616;&#20102;&#27963;&#21160;&#28608;&#22686;&#30340;&#26377;&#36259;&#27169;&#24335;&#65292;&#23588;&#20854;&#22312;&#25972;&#28857;&#26102;&#20986;&#29616;&#65292;&#26263;&#31034;&#20102;&#31639;&#27861;&#20132;&#26131;&#30340;&#28508;&#22312;&#20316;&#29992;&#12290;&#27492;&#22806;&#65292;&#27604;&#29305;&#24065;&#21644;&#20197;&#22826;&#22346;&#30340;&#37325;&#22797;&#27963;&#21160;&#31361;&#21457;&#19982;&#32654;&#22269;&#37325;&#22823;&#23439;&#35266;&#32463;&#27982;&#25253;&#21578;&#21457;&#24067;&#26102;&#38388;&#30456;&#19968;&#33268;&#12290;</title><link>http://arxiv.org/abs/2306.17095</link><description>&lt;p&gt;
&#23558;&#21152;&#23494;&#36135;&#24065;&#21160;&#24577;&#20998;&#35299;&#20026;&#37325;&#22797;&#21644;&#22122;&#22768;&#25104;&#20998;&#30340;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Decomposing cryptocurrency dynamics into recurring and noisy components. (arXiv:2306.17095v1 [q-fin.TR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.17095
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#21152;&#23494;&#36135;&#24065;&#24066;&#22330;&#30340;&#26102;&#38388;&#27169;&#24335;&#65292;&#21457;&#29616;&#19982;&#20256;&#32479;&#32929;&#31080;&#24066;&#22330;&#19981;&#21516;&#30340;&#24066;&#22330;&#34892;&#20026;&#65292;&#34920;&#29616;&#20026;&#19977;&#20010;&#22686;&#24378;&#27963;&#21160;&#38454;&#27573;&#19982;&#19981;&#21516;&#26102;&#27573;&#30340;&#20132;&#26131;&#26102;&#27573;&#30456;&#19968;&#33268;&#12290;&#22312;15&#20998;&#38047;&#38388;&#38548;&#20869;&#20986;&#29616;&#20102;&#27963;&#21160;&#28608;&#22686;&#30340;&#26377;&#36259;&#27169;&#24335;&#65292;&#23588;&#20854;&#22312;&#25972;&#28857;&#26102;&#20986;&#29616;&#65292;&#26263;&#31034;&#20102;&#31639;&#27861;&#20132;&#26131;&#30340;&#28508;&#22312;&#20316;&#29992;&#12290;&#27492;&#22806;&#65292;&#27604;&#29305;&#24065;&#21644;&#20197;&#22826;&#22346;&#30340;&#37325;&#22797;&#27963;&#21160;&#31361;&#21457;&#19982;&#32654;&#22269;&#37325;&#22823;&#23439;&#35266;&#32463;&#27982;&#25253;&#21578;&#21457;&#24067;&#26102;&#38388;&#30456;&#19968;&#33268;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#21152;&#23494;&#36135;&#24065;&#24066;&#22330;&#30340;&#26102;&#38388;&#27169;&#24335;&#65292;&#37325;&#28857;&#20851;&#27880;&#27604;&#29305;&#24065;&#12289;&#20197;&#22826;&#22346;&#12289;&#29399;&#29399;&#24065;&#21644;Winklink&#20174;2020&#24180;1&#26376;&#21040;2022&#24180;12&#26376;&#30340;&#24773;&#20917;&#12290;&#36890;&#36807;&#30456;&#20851;&#30697;&#38453;&#24418;&#24335;&#23558;&#24066;&#22330;&#27963;&#21160;&#25351;&#26631;&#8212;&#8212;&#23545;&#25968;&#25910;&#30410;&#12289;&#25104;&#20132;&#37327;&#21644;&#20132;&#26131;&#25968;&#37327;&#65292;&#27599;10&#31186;&#37319;&#26679;&#19968;&#27425;&#65292;&#20998;&#20026;&#26085;&#20869;&#21644;&#21608;&#20869;&#21608;&#26399;&#65292;&#28982;&#21518;&#36827;&#19968;&#27493;&#20998;&#35299;&#20026;&#37325;&#22797;&#21644;&#22122;&#22768;&#25104;&#20998;&#12290;&#20027;&#35201;&#21457;&#29616;&#21253;&#25324;&#19982;&#20256;&#32479;&#32929;&#31080;&#24066;&#22330;&#19981;&#21516;&#30340;&#24066;&#22330;&#34892;&#20026;&#65292;&#22240;&#20026;&#27809;&#26377;&#20132;&#26131;&#24320;&#25918;&#21644;&#20851;&#38381;&#12290;&#36825;&#34920;&#29616;&#20026;&#19977;&#20010;&#22686;&#24378;&#27963;&#21160;&#38454;&#27573;&#65292;&#20998;&#21035;&#19982;&#20122;&#27954;&#12289;&#27431;&#27954;&#21644;&#32654;&#22269;&#30340;&#20132;&#26131;&#26102;&#27573;&#30456;&#19968;&#33268;&#12290;&#36824;&#27880;&#24847;&#21040;&#20102;&#22312;15&#20998;&#38047;&#38388;&#38548;&#20869;&#20986;&#29616;&#30340;&#27963;&#21160;&#28608;&#22686;&#30340;&#26377;&#36259;&#27169;&#24335;&#65292;&#23588;&#20854;&#22312;&#25972;&#28857;&#26102;&#20986;&#29616;&#65292;&#26263;&#31034;&#20102;&#31639;&#27861;&#20132;&#26131;&#30340;&#28508;&#22312;&#20316;&#29992;&#12290;&#26368;&#37325;&#35201;&#30340;&#26159;&#65292;&#21457;&#29616;&#27604;&#29305;&#24065;&#21644;&#20197;&#22826;&#22346;&#30340;&#37325;&#22797;&#27963;&#21160;&#31361;&#21457;&#19982;&#32654;&#22269;&#37325;&#22823;&#23439;&#35266;&#32463;&#27982;&#25253;&#21578;&#21457;&#24067;&#26102;&#38388;&#37325;&#21512;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper investigates the temporal patterns of activity in the cryptocurrency market with a focus on bitcoin, ether, dogecoin, and winklink from January 2020 to December 2022. Market activity measures - logarithmic returns, volume, and transaction number, sampled every 10 seconds, were divided into intraday and intraweek periods and then further decomposed into recurring and noise components via correlation matrix formalism. The key findings include the distinctive market behavior from traditional stock markets due to the nonexistence of trade opening and closing. This was manifest in three enhanced-activity phases aligning with Asian, European, and US trading sessions. An intriguing pattern of activity surge in 15-minute intervals, particularly at full hours, was also noticed, implying the potential role of algorithmic trading. Most notably, recurring bursts of activity in bitcoin and ether were identified to coincide with the release times of significant US macroeconomic reports su
&lt;/p&gt;</description></item><item><title>&#35813;&#30740;&#31350;&#24320;&#21457;&#20102;&#19968;&#20010;&#29992;&#20110;&#30830;&#23450;&#21152;&#23494;&#36135;&#24065;&#26368;&#20248;&#20195;&#24065;&#20379;&#24212;&#25919;&#31574;&#30340;&#26694;&#26550;&#65292;&#24182;&#21457;&#29616;&#26368;&#20248;&#25919;&#31574;&#36981;&#24490;&#24343;&#37324;&#24503;&#26364;&#35268;&#21017;&#24182;&#21462;&#20915;&#20110;&#26080;&#39118;&#38505;&#21033;&#29575;&#21644;&#21152;&#23494;&#36135;&#24065;&#24179;&#21488;&#30340;&#22686;&#38271;&#12290;&#35813;&#30740;&#31350;&#36824;&#25552;&#20986;&#20102;&#19968;&#31995;&#21015;&#26465;&#20214;&#65292;&#35828;&#26126;&#22914;&#20309;&#36890;&#36807;&#20195;&#24065;&#20379;&#24212;&#30340;&#25910;&#32553;&#21644;&#25193;&#24352;&#20197;&#21450;&#28040;&#36153;&#31246;&#21644;&#38144;&#27585;&#25910;&#30410;&#26469;&#23454;&#26045;&#36825;&#31181;&#25919;&#31574;&#12290;</title><link>http://arxiv.org/abs/2306.17025</link><description>&lt;p&gt;
&#24343;&#37324;&#24503;&#26364;&#20250;&#28903;&#27585;&#20320;&#30340;&#20195;&#24065;&#21527;&#65311;
&lt;/p&gt;
&lt;p&gt;
Would Friedman Burn your Tokens?. (arXiv:2306.17025v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.17025
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#24320;&#21457;&#20102;&#19968;&#20010;&#29992;&#20110;&#30830;&#23450;&#21152;&#23494;&#36135;&#24065;&#26368;&#20248;&#20195;&#24065;&#20379;&#24212;&#25919;&#31574;&#30340;&#26694;&#26550;&#65292;&#24182;&#21457;&#29616;&#26368;&#20248;&#25919;&#31574;&#36981;&#24490;&#24343;&#37324;&#24503;&#26364;&#35268;&#21017;&#24182;&#21462;&#20915;&#20110;&#26080;&#39118;&#38505;&#21033;&#29575;&#21644;&#21152;&#23494;&#36135;&#24065;&#24179;&#21488;&#30340;&#22686;&#38271;&#12290;&#35813;&#30740;&#31350;&#36824;&#25552;&#20986;&#20102;&#19968;&#31995;&#21015;&#26465;&#20214;&#65292;&#35828;&#26126;&#22914;&#20309;&#36890;&#36807;&#20195;&#24065;&#20379;&#24212;&#30340;&#25910;&#32553;&#21644;&#25193;&#24352;&#20197;&#21450;&#28040;&#36153;&#31246;&#21644;&#38144;&#27585;&#25910;&#30410;&#26469;&#23454;&#26045;&#36825;&#31181;&#25919;&#31574;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21152;&#23494;&#36135;&#24065;&#24102;&#26469;&#20102;&#21508;&#31181;&#19981;&#21516;&#30340;&#20195;&#24065;&#32463;&#27982;&#25919;&#31574;&#65292;&#24182;&#19988;&#25317;&#26377;&#34987;&#25903;&#25345;&#32773;&#25551;&#36848;&#20026;&#8220;&#20581;&#20840;&#36135;&#24065;&#8221;&#29978;&#33267;&#8220;&#36229;&#32423;&#20581;&#20840;&#36135;&#24065;&#8221;&#30340;&#21487;&#21462;&#29305;&#24449;&#12290;&#28982;&#32780;&#65292;&#36825;&#20123;&#20027;&#24352;&#36890;&#24120;&#32570;&#20047;&#32463;&#27982;&#20998;&#26512;&#65292;&#22240;&#27492;&#38382;&#39064;&#22312;&#20110;&#36825;&#20123;&#24895;&#26223;&#22914;&#20309;&#31526;&#21512;&#26356;&#24191;&#38420;&#30340;&#36135;&#24065;&#32463;&#27982;&#29702;&#35770;&#32972;&#26223;&#12290;&#22312;&#26412;&#30740;&#31350;&#20013;&#65292;&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#20010;&#26694;&#26550;&#65292;&#29992;&#20110;&#30830;&#23450;&#21152;&#23494;&#36135;&#24065;&#30340;&#26368;&#20248;&#20195;&#24065;&#20379;&#24212;&#25919;&#31574;&#65292;&#24182;&#30740;&#31350;&#20102;&#22914;&#20309;&#36890;&#36807;&#31639;&#27861;&#23454;&#26045;&#36825;&#31181;&#25919;&#31574;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;&#26368;&#20248;&#25919;&#31574;&#36981;&#24490;&#24343;&#37324;&#24503;&#26364;&#35268;&#21017;&#65292;&#24182;&#21462;&#20915;&#20110;&#26080;&#39118;&#38505;&#21033;&#29575;&#20197;&#21450;&#21152;&#23494;&#36135;&#24065;&#24179;&#21488;&#30340;&#22686;&#38271;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36824;&#36890;&#36807;&#20195;&#24065;&#20379;&#24212;&#30340;&#25910;&#32553;&#21644;&#25193;&#24352;&#65288;&#21487;&#20197;&#36890;&#36807;&#21306;&#22359;&#22870;&#21169;&#12289;&#28040;&#36153;&#31246;&#21644;&#38144;&#27585;&#25910;&#30410;&#20197;&#21450;&#21306;&#22359;&#38142;&#39044;&#35328;&#26426;&#23454;&#29616;&#65289;&#26469;&#28436;&#31034;&#23454;&#26045;&#36825;&#31181;&#25919;&#31574;&#30340;&#19968;&#31995;&#21015;&#26465;&#20214;&#12290;
&lt;/p&gt;
&lt;p&gt;
Cryptocurrencies come with a variety of tokenomic policies as well as aspirations of desirable monetary characteristics that have been described by proponents as 'sound money' or even 'ultra sound money.' These propositions are typically devoid of economic analysis so it is a pertinent question how such aspirations fit in the wider context of monetary economic theory. In this work, we develop a framework that determines the optimal token supply policy of a cryptocurrency, as well as investigate how such policy may be algorithmically implemented. Our findings suggest that the optimal policy complies with the Friedman rule and it is dependent on the risk free rate, as well as the growth of the cryptocurrency platform. Furthermore, we demonstrate a wide set of conditions under which such policy can be implemented via contractions and expansions of token supply that can be realized algorithmically with block rewards, taxation of consumption and burning the proceeds, and blockchain oracles.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#36890;&#36807;&#23558;&#28180;&#19994;&#30340;&#26631;&#20934;&#29983;&#24577;&#32463;&#27982;&#27169;&#22411;&#19982;&#29359;&#32618;&#19982;&#24809;&#32602;&#29702;&#35770;&#32467;&#21512;&#65292;&#24418;&#24335;&#21270;&#22320;&#35752;&#35770;&#20102;&#30417;&#27979;&#21644;&#25191;&#27861;&#22312;&#28180;&#19994;&#31649;&#29702;&#20013;&#30340;&#37325;&#35201;&#24615;&#65292;&#24182;&#23637;&#31034;&#20102;&#27861;&#24459;&#25104;&#26412;&#39640;&#26114;&#12289;&#25191;&#27861;&#19981;&#23436;&#21892;&#23545;&#28180;&#19994;&#20844;&#21496;&#21644;&#31649;&#29702;&#34892;&#20026;&#30340;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2306.16960</link><description>&lt;p&gt;
&#32472;&#21046;&#19968;&#20010;&#38024;&#23545;&#28180;&#19994;&#25191;&#27861;&#21644;&#21512;&#35268;&#24615;&#30340;&#27169;&#22411;-&#19968;&#39033;&#35843;&#26597;
&lt;/p&gt;
&lt;p&gt;
Sketching a Model on Fisheries Enforcement and Compliance -- A Survey. (arXiv:2306.16960v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.16960
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36890;&#36807;&#23558;&#28180;&#19994;&#30340;&#26631;&#20934;&#29983;&#24577;&#32463;&#27982;&#27169;&#22411;&#19982;&#29359;&#32618;&#19982;&#24809;&#32602;&#29702;&#35770;&#32467;&#21512;&#65292;&#24418;&#24335;&#21270;&#22320;&#35752;&#35770;&#20102;&#30417;&#27979;&#21644;&#25191;&#27861;&#22312;&#28180;&#19994;&#31649;&#29702;&#20013;&#30340;&#37325;&#35201;&#24615;&#65292;&#24182;&#23637;&#31034;&#20102;&#27861;&#24459;&#25104;&#26412;&#39640;&#26114;&#12289;&#25191;&#27861;&#19981;&#23436;&#21892;&#23545;&#28180;&#19994;&#20844;&#21496;&#21644;&#31649;&#29702;&#34892;&#20026;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#30417;&#27979;&#21644;&#25191;&#27861;&#30340;&#32771;&#34385;&#22312;&#28180;&#19994;&#31649;&#29702;&#30740;&#31350;&#20013;&#34987;&#22823;&#37096;&#20998;&#20154;&#24573;&#30053;&#12290;&#26412;&#25991;&#36890;&#36807;&#27169;&#22411;&#24418;&#24335;&#21270;&#26469;&#35752;&#35770;&#36825;&#20010;&#38382;&#39064;&#65292;&#20197;&#23637;&#31034;&#27861;&#24459;&#25104;&#26412;&#39640;&#26114;&#12289;&#25191;&#27861;&#19981;&#23436;&#21892;&#23545;&#28180;&#19994;&#20844;&#21496;&#21644;&#28180;&#19994;&#31649;&#29702;&#34892;&#20026;&#30340;&#24433;&#21709;&#12290;&#29702;&#35770;&#20998;&#26512;&#23558;&#28180;&#19994;&#30340;&#26631;&#20934;&#29983;&#24577;&#32463;&#27982;&#27169;&#22411;&#65288;&#25096;&#30331;-&#33293;&#24343;&#65289;&#19982;&#36125;&#20811;&#23572;&#30340;&#29359;&#32618;&#19982;&#24809;&#32602;&#29702;&#35770;&#30456;&#32467;&#21512;&#12290;
&lt;/p&gt;
&lt;p&gt;
Monitoring and enforcement considerations have been largely forgotten in the study of fishery management. This paper discusses this issue through a model formalization to show the impacts of costly, imperfect enforcement of law on the behavior of fishing firms and fisheries management. Theoretical analysis merges a standard bio-economic model of fisheries (Gordon-Schaefer) with Becker theory of Crime and Punishment.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#36890;&#36807;&#24314;&#27169;&#20195;&#29702;&#30340;&#34892;&#20026;&#65292;&#30740;&#31350;&#20102;&#23398;&#20064;&#30340;&#20869;&#22312;&#38556;&#30861;&#12290;&#23454;&#39564;&#21457;&#29616;&#65292;&#22312;&#26576;&#20123;&#28216;&#25103;&#20013;&#65292;&#22686;&#21152;&#20934;&#30830;&#24615;&#20250;&#23548;&#33268;&#19981;&#31283;&#23450;&#30340;&#26368;&#20339;&#21453;&#24212;&#21160;&#24577;&#12290;&#36890;&#36807;&#23558;&#23398;&#20064;&#30340;&#38556;&#30861;&#23450;&#20041;&#20026;&#20445;&#25345;&#26368;&#20339;&#21453;&#24212;&#21160;&#24577;&#31283;&#23450;&#25152;&#38656;&#30340;&#26368;&#23567;&#22122;&#22768;&#27700;&#24179;&#65292;&#25552;&#20986;&#20102;&#19968;&#20010;limitQR&#22343;&#34913;&#12290;&#21516;&#26102;&#65292;&#35752;&#35770;&#20102;&#31574;&#30053;&#38480;&#21046;&#22312;&#20943;&#23569;&#25110;&#22686;&#21152;&#23398;&#20064;&#38556;&#30861;&#26041;&#38754;&#30340;&#20316;&#29992;&#12290;</title><link>http://arxiv.org/abs/2306.16904</link><description>&lt;p&gt;
&#23398;&#20064;&#30340;&#20869;&#22312;&#38556;&#30861;
&lt;/p&gt;
&lt;p&gt;
Endogenous Barriers to Learning. (arXiv:2306.16904v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.16904
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36890;&#36807;&#24314;&#27169;&#20195;&#29702;&#30340;&#34892;&#20026;&#65292;&#30740;&#31350;&#20102;&#23398;&#20064;&#30340;&#20869;&#22312;&#38556;&#30861;&#12290;&#23454;&#39564;&#21457;&#29616;&#65292;&#22312;&#26576;&#20123;&#28216;&#25103;&#20013;&#65292;&#22686;&#21152;&#20934;&#30830;&#24615;&#20250;&#23548;&#33268;&#19981;&#31283;&#23450;&#30340;&#26368;&#20339;&#21453;&#24212;&#21160;&#24577;&#12290;&#36890;&#36807;&#23558;&#23398;&#20064;&#30340;&#38556;&#30861;&#23450;&#20041;&#20026;&#20445;&#25345;&#26368;&#20339;&#21453;&#24212;&#21160;&#24577;&#31283;&#23450;&#25152;&#38656;&#30340;&#26368;&#23567;&#22122;&#22768;&#27700;&#24179;&#65292;&#25552;&#20986;&#20102;&#19968;&#20010;limitQR&#22343;&#34913;&#12290;&#21516;&#26102;&#65292;&#35752;&#35770;&#20102;&#31574;&#30053;&#38480;&#21046;&#22312;&#20943;&#23569;&#25110;&#22686;&#21152;&#23398;&#20064;&#38556;&#30861;&#26041;&#38754;&#30340;&#20316;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21160;&#26426;&#22312;&#20110;&#32570;&#20047;&#32463;&#39564;&#20250;&#23548;&#33268;&#38169;&#35823;&#65292;&#32780;&#32463;&#39564;&#21487;&#20197;&#20943;&#23569;&#36825;&#20123;&#38169;&#35823;&#65292;&#25105;&#20204;&#20351;&#29992;&#38543;&#26426;&#36873;&#25321;&#27169;&#22411;&#26469;&#24314;&#27169;&#20195;&#29702;&#30340;&#34892;&#20026;&#65292;&#23558;&#20854;&#36873;&#25321;&#30340;&#20934;&#30830;&#24615;&#35774;&#23450;&#20026;&#20869;&#29983;&#21464;&#37327;&#12290;&#22312;&#26576;&#20123;&#28216;&#25103;&#20013;&#65292;&#22686;&#21152;&#20934;&#30830;&#24615;&#26377;&#21487;&#33021;&#23548;&#33268;&#19981;&#31283;&#23450;&#30340;&#26368;&#20339;&#21453;&#24212;&#21160;&#24577;&#12290;&#25105;&#20204;&#23558;&#23398;&#20064;&#30340;&#38556;&#30861;&#23450;&#20041;&#20026;&#20445;&#25345;&#26368;&#20339;&#21453;&#24212;&#21160;&#24577;&#31283;&#23450;&#25152;&#38656;&#30340;&#26368;&#23567;&#22122;&#22768;&#27700;&#24179;&#12290;&#20351;&#29992;&#36923;&#36753;&#37327;&#21270;&#21709;&#24212;&#65292;&#36825;&#23450;&#20041;&#20102;&#19968;&#20010;limitQR&#22343;&#34913;&#12290;&#25105;&#20204;&#23558;&#35813;&#27010;&#24565;&#24212;&#29992;&#20110;&#34568;&#34467;&#12289;&#26053;&#34892;&#32773;&#22256;&#22659;&#21644;11-20&#38065;&#27714;&#28216;&#25103;&#65292;&#20197;&#21450;&#19968;&#20215;&#21644;&#20840;&#20184;&#25293;&#21334;&#65292;&#24182;&#35752;&#35770;&#31574;&#30053;&#38480;&#21046;&#22312;&#20943;&#23569;&#25110;&#22686;&#21152;&#23398;&#20064;&#38556;&#30861;&#26041;&#38754;&#30340;&#20316;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;
Motivated by the idea that lack of experience is a source of errors but that experience should reduce them, we model agents' behavior using a stochastic choice model, leaving endogenous the accuracy of their choice. In some games, increased accuracy is conducive to unstable best-response dynamics. We define the barrier to learning as the minimum level of noise which keeps the best-response dynamic stable. Using logit Quantal Response, this defines a limitQR Equilibrium. We apply the concept to centipede, travelers' dilemma, and 11-20 money-request games and to first-price and all-pay auctions, and discuss the role of strategy restrictions in reducing or amplifying barriers to learning.
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#22240;&#26524;&#26694;&#26550;&#65292;&#36890;&#36807;&#19968;&#20010;&#20013;&#38388;&#22788;&#29702;&#21464;&#37327;&#23558;&#32452;&#24046;&#24322;&#20998;&#35299;&#25104;&#19981;&#21516;&#30340;&#32452;&#25104;&#37096;&#20998;&#65292;&#24182;&#25552;&#20379;&#20102;&#19968;&#20010;&#26032;&#30340;&#35299;&#37322;&#21644;&#25913;&#21892;&#24046;&#24322;&#30340;&#26426;&#21046;&#12290;&#35813;&#26694;&#26550;&#25913;&#36827;&#20102;&#32463;&#20856;&#30340;&#20998;&#35299;&#26041;&#27861;&#65292;&#24182;&#19988;&#21487;&#20197;&#25351;&#23548;&#25919;&#31574;&#24178;&#39044;&#12290;</title><link>http://arxiv.org/abs/2306.16591</link><description>&lt;p&gt;
&#38750;&#21442;&#25968;&#22240;&#26524;&#20998;&#35299;&#32452;&#24046;&#24322;
&lt;/p&gt;
&lt;p&gt;
Nonparametric Causal Decomposition of Group Disparities. (arXiv:2306.16591v1 [stat.ME])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.16591
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#22240;&#26524;&#26694;&#26550;&#65292;&#36890;&#36807;&#19968;&#20010;&#20013;&#38388;&#22788;&#29702;&#21464;&#37327;&#23558;&#32452;&#24046;&#24322;&#20998;&#35299;&#25104;&#19981;&#21516;&#30340;&#32452;&#25104;&#37096;&#20998;&#65292;&#24182;&#25552;&#20379;&#20102;&#19968;&#20010;&#26032;&#30340;&#35299;&#37322;&#21644;&#25913;&#21892;&#24046;&#24322;&#30340;&#26426;&#21046;&#12290;&#35813;&#26694;&#26550;&#25913;&#36827;&#20102;&#32463;&#20856;&#30340;&#20998;&#35299;&#26041;&#27861;&#65292;&#24182;&#19988;&#21487;&#20197;&#25351;&#23548;&#25919;&#31574;&#24178;&#39044;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#22240;&#26524;&#26694;&#26550;&#26469;&#23558;&#32467;&#26524;&#20013;&#30340;&#32452;&#24046;&#24322;&#20998;&#35299;&#20026;&#20013;&#38388;&#22788;&#29702;&#21464;&#37327;&#12290;&#25105;&#20204;&#30340;&#26694;&#26550;&#25429;&#25417;&#20102;&#22522;&#32447;&#28508;&#22312;&#32467;&#26524;&#12289;&#22788;&#29702;&#21069;&#27839;&#12289;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#21644;&#22788;&#29702;&#36873;&#25321;&#30340;&#32452;&#24046;&#24322;&#30340;&#36129;&#29486;&#12290;&#36825;&#20010;&#26694;&#26550;&#20197;&#21453;&#20107;&#23454;&#30340;&#26041;&#24335;&#36827;&#34892;&#20102;&#25968;&#23398;&#34920;&#36798;&#65292;&#24182;&#19988;&#33021;&#22815;&#26041;&#20415;&#22320;&#25351;&#23548;&#25919;&#31574;&#24178;&#39044;&#12290;&#29305;&#21035;&#26159;&#65292;&#38024;&#23545;&#19981;&#21516;&#30340;&#22788;&#29702;&#36873;&#25321;&#36827;&#34892;&#30340;&#20998;&#35299;&#37096;&#20998;&#26159;&#29305;&#21035;&#26032;&#39062;&#30340;&#65292;&#25581;&#31034;&#20102;&#19968;&#31181;&#35299;&#37322;&#21644;&#25913;&#21892;&#24046;&#24322;&#30340;&#26032;&#26426;&#21046;&#12290;&#36825;&#20010;&#26694;&#26550;&#20197;&#22240;&#26524;&#26415;&#35821;&#37325;&#26032;&#23450;&#20041;&#20102;&#32463;&#20856;&#30340;Kitagawa-Blinder-Oaxaca&#20998;&#35299;&#65292;&#36890;&#36807;&#35299;&#37322;&#32452;&#24046;&#24322;&#32780;&#19981;&#26159;&#32452;&#25928;&#24212;&#26469;&#34917;&#20805;&#20102;&#22240;&#26524;&#20013;&#20171;&#20998;&#26512;&#65292;&#24182;&#35299;&#20915;&#20102;&#36817;&#26399;&#38543;&#26426;&#31561;&#21270;&#20998;&#35299;&#30340;&#27010;&#24565;&#22256;&#38590;&#12290;&#25105;&#20204;&#36824;&#25552;&#20379;&#20102;&#19968;&#20010;&#26465;&#20214;&#20998;&#35299;&#65292;&#20801;&#35768;&#30740;&#31350;&#20154;&#21592;&#22312;&#23450;&#20041;&#35780;&#20272;&#21644;&#30456;&#24212;&#30340;&#24178;&#39044;&#25514;&#26045;&#26102;&#32435;&#20837;&#21327;&#21464;&#37327;&#12290;
&lt;/p&gt;
&lt;p&gt;
We propose a causal framework for decomposing a group disparity in an outcome in terms of an intermediate treatment variable. Our framework captures the contributions of group differences in baseline potential outcome, treatment prevalence, average treatment effect, and selection into treatment. This framework is counterfactually formulated and readily informs policy interventions. The decomposition component for differential selection into treatment is particularly novel, revealing a new mechanism for explaining and ameliorating disparities. This framework reformulates the classic Kitagawa-Blinder-Oaxaca decomposition in causal terms, supplements causal mediation analysis by explaining group disparities instead of group effects, and resolves conceptual difficulties of recent random equalization decompositions. We also provide a conditional decomposition that allows researchers to incorporate covariates in defining the estimands and corresponding interventions. We develop nonparametric
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#20855;&#26377;&#20027;&#35201;&#24433;&#21709;&#32773;&#21644;&#38544;&#24615;&#31038;&#20132;&#24433;&#21709;&#30340;&#31038;&#21306;&#20013;&#30340;&#24847;&#35265;&#21160;&#24577;&#12290;&#36890;&#36807;&#23545;&#24120;&#35265;&#37319;&#26679;&#36817;&#20284;&#12289;&#29420;&#31435;&#37319;&#26679;&#36817;&#20284;&#20197;&#21450;&#24179;&#22343;&#22330;&#36817;&#20284;&#30340;&#30740;&#31350;&#65292;&#25105;&#20204;&#21457;&#29616;&#36825;&#19977;&#31181;&#36817;&#20284;&#26041;&#27861;&#22312;&#34913;&#37327;&#25972;&#20307;&#21644;&#20010;&#20307;&#32423;&#35823;&#24046;&#26041;&#38754;&#34920;&#29616;&#33391;&#22909;&#12290;</title><link>http://arxiv.org/abs/2306.16553</link><description>&lt;p&gt;
&#31038;&#21306;&#20013;&#20855;&#26377;&#20027;&#35201;&#24433;&#21709;&#32773;&#21644;&#38544;&#24615;&#31038;&#20132;&#24433;&#21709;&#30340;&#24847;&#35265;&#21160;&#24577;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Opinion dynamics in communities with major influencers and implicit social influence via mean-field approximation. (arXiv:2306.16553v1 [math.PR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.16553
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#20855;&#26377;&#20027;&#35201;&#24433;&#21709;&#32773;&#21644;&#38544;&#24615;&#31038;&#20132;&#24433;&#21709;&#30340;&#31038;&#21306;&#20013;&#30340;&#24847;&#35265;&#21160;&#24577;&#12290;&#36890;&#36807;&#23545;&#24120;&#35265;&#37319;&#26679;&#36817;&#20284;&#12289;&#29420;&#31435;&#37319;&#26679;&#36817;&#20284;&#20197;&#21450;&#24179;&#22343;&#22330;&#36817;&#20284;&#30340;&#30740;&#31350;&#65292;&#25105;&#20204;&#21457;&#29616;&#36825;&#19977;&#31181;&#36817;&#20284;&#26041;&#27861;&#22312;&#34913;&#37327;&#25972;&#20307;&#21644;&#20010;&#20307;&#32423;&#35823;&#24046;&#26041;&#38754;&#34920;&#29616;&#33391;&#22909;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#22312;&#19968;&#20010;&#22823;&#35268;&#27169;&#20154;&#21475;&#20013;&#30340;&#20108;&#20803;&#24847;&#35265;&#24418;&#25104;&#38382;&#39064;&#65292;&#20010;&#20307;&#30340;&#24847;&#35265;&#21463;&#20854;&#20182;&#20010;&#20307;&#30340;&#24433;&#21709;&#12290;&#35813;&#20154;&#21475;&#20855;&#26377;&#20197;&#19979;&#29305;&#24449;&#65306;(i) &#20010;&#20307;&#23646;&#20110;&#20855;&#26377;&#30456;&#20284;&#29305;&#24449;&#30340;&#31038;&#21306;&#65292;(ii) &#23384;&#22312;&#33021;&#22312;&#30701;&#26399;&#20869;&#24341;&#21457;&#24847;&#35265;&#36716;&#21464;&#30340;&#24847;&#35265;&#39046;&#34966;&#65292;(iii) &#22312;&#20010;&#20307;&#25110;&#20844;&#20849;&#24847;&#35265;&#36807;&#31243;&#30340;&#35266;&#23519;&#20013;&#23384;&#22312;&#26576;&#31181;&#31243;&#24230;&#30340;&#20449;&#24687;&#19981;&#23436;&#20840;&#24615;&#12290;&#22312;&#36825;&#20010;&#35774;&#32622;&#19979;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#19977;&#31181;&#19981;&#21516;&#30340;&#36817;&#20284;&#26426;&#21046;&#65306;&#24120;&#35265;&#37319;&#26679;&#36817;&#20284;&#12289;&#29420;&#31435;&#37319;&#26679;&#36817;&#20284;&#20197;&#21450;&#25105;&#20204;&#22312;&#26412;&#25991;&#20013;&#30340;&#20027;&#35201;&#20851;&#27880;&#28857; - McKean-Vlasov (&#25110;&#24179;&#22343;&#22330;) &#36817;&#20284;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#36825;&#19977;&#31181;&#36817;&#20284;&#22312;&#25105;&#20204;&#24341;&#20837;&#30340;&#29992;&#20110;&#34913;&#37327;&#25972;&#20307;&#21644;&#20010;&#20307;&#32423;&#35823;&#24046;&#30340;&#19981;&#21516;&#24230;&#37327;&#26631;&#20934;&#19978;&#34920;&#29616;&#33391;&#22909;&#12290;&#22312;&#20027;&#35201;&#24433;&#21709;&#32773;&#24847;&#35265;&#36807;&#31243;&#20013;&#23384;&#22312;&#19968;&#31181;&#20849;&#21516;&#22122;&#22768;&#30340;&#24773;&#20917;&#19979;&#65292;&#23613;&#31649;&#32570;&#23569;&#29305;&#36136;&#22122;&#22768;&#65292;&#25105;&#20204;&#24471;&#20986;&#20102;&#19968;&#31181;&#28151;&#27788;&#20256;&#25773;&#31867;&#22411;&#30340;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study binary opinion formation in a large population where individuals are influenced by the opinions of other individuals. The population is characterised by the existence of (i) communities where individuals share some similar features, (ii) opinion leaders that may trigger unpredictable opinion shifts in the short term (iii) some degree of incomplete information in the observation of the individual or public opinion processes. In this setting, we study three different approximate mechanisms: common sampling approximation, independent sampling approximation, and, what will be our main focus in this paper, McKean-Vlasov (or mean-field) approximation. We show that all three approximations perform well in terms of different metrics that we introduce for measuring population level and individual level errors. In the presence of a common noise represented by the major influencers opinions processes, and despite the absence of idiosyncratic noises, we derive a propagation of chaos type 
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20379;&#20102;&#19968;&#31181;&#36776;&#35782;&#31038;&#20250;&#30772;&#22351;&#30340;&#26041;&#27861;&#65292;&#24182;&#24212;&#29992;&#22312;&#20004;&#20010;&#23454;&#35777;&#35828;&#26126;&#20013;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#31038;&#20250;&#30772;&#22351;&#19968;&#33324;&#19981;&#26159;&#28857;&#36776;&#35782;&#30340;&#65292;&#20294;&#21487;&#20197;&#26500;&#24314;&#20986;&#20449;&#24687;&#20016;&#23500;&#30340;&#19978;&#19979;&#30028;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36824;&#25512;&#23548;&#20986;&#20102;&#19968;&#20010;&#23553;&#38381;&#24418;&#24335;&#30340;&#34920;&#31034;&#26469;&#36827;&#34892;&#28857;&#36776;&#35782;&#12290;</title><link>http://arxiv.org/abs/2306.15000</link><description>&lt;p&gt;
&#36776;&#35782;&#31038;&#20250;&#30772;&#22351;&#24615;&#25919;&#31574;
&lt;/p&gt;
&lt;p&gt;
Identifying Socially Disruptive Policies. (arXiv:2306.15000v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.15000
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20379;&#20102;&#19968;&#31181;&#36776;&#35782;&#31038;&#20250;&#30772;&#22351;&#30340;&#26041;&#27861;&#65292;&#24182;&#24212;&#29992;&#22312;&#20004;&#20010;&#23454;&#35777;&#35828;&#26126;&#20013;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#31038;&#20250;&#30772;&#22351;&#19968;&#33324;&#19981;&#26159;&#28857;&#36776;&#35782;&#30340;&#65292;&#20294;&#21487;&#20197;&#26500;&#24314;&#20986;&#20449;&#24687;&#20016;&#23500;&#30340;&#19978;&#19979;&#30028;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36824;&#25512;&#23548;&#20986;&#20102;&#19968;&#20010;&#23553;&#38381;&#24418;&#24335;&#30340;&#34920;&#31034;&#26469;&#36827;&#34892;&#28857;&#36776;&#35782;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#31038;&#20250;&#30772;&#22351;&#21457;&#29983;&#22312;&#25919;&#31574;&#21019;&#24314;&#25110;&#30772;&#22351;&#20102;&#35768;&#22810;&#20010;&#20307;&#20043;&#38388;&#30340;&#32593;&#32476;&#36830;&#25509;&#26102;&#12290;&#23545;&#20110;&#25919;&#31574;&#30340;&#31119;&#21033;&#24433;&#21709;&#35780;&#20272;&#65292;&#36234;&#26469;&#36234;&#22810;&#30340;&#23454;&#35777;&#25991;&#29486;&#24314;&#35758;&#27979;&#37327;&#21644;&#32771;&#34385;&#31038;&#20250;&#30772;&#22351;&#12290;&#28982;&#32780;&#65292;&#30446;&#21069;&#24456;&#23569;&#26377;&#24037;&#20316;&#25551;&#36848;&#23454;&#38469;&#25968;&#25454;&#20013;&#33021;&#22815;&#23398;&#21040;&#20851;&#20110;&#31038;&#20250;&#30772;&#22351;&#30340;&#20869;&#23481;&#12290;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#32771;&#34385;&#20102;&#19968;&#20010;&#22312;&#25991;&#29486;&#20013;&#24456;&#21463;&#27426;&#36814;&#30340;&#30740;&#31350;&#35774;&#35745;&#29992;&#20110;&#36776;&#35782;&#31038;&#20250;&#30772;&#22351;&#30340;&#38382;&#39064;&#12290;&#25105;&#20204;&#25552;&#20379;&#20004;&#32452;&#36776;&#35782;&#32467;&#26524;&#12290;&#39318;&#20808;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#31038;&#20250;&#30772;&#22351;&#36890;&#24120;&#19981;&#26159;&#28857;&#36776;&#35782;&#30340;&#65292;&#20294;&#30740;&#31350;&#32773;&#21487;&#20197;&#20351;&#29992;&#35266;&#27979;&#21040;&#30340;&#32593;&#32476;&#37051;&#25509;&#30697;&#38453;&#30340;&#29305;&#24449;&#20540;&#26500;&#24314;&#20449;&#24687;&#20016;&#23500;&#30340;&#19978;&#19979;&#30028;&#12290;&#20854;&#27425;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#28857;&#36776;&#35782;&#26469;&#33258;&#20110;&#19968;&#20010;&#29702;&#35770;&#19978;&#26377;&#25152;&#21551;&#21457;&#30340;&#21333;&#35843;&#24615;&#26465;&#20214;&#65292;&#24182;&#25512;&#23548;&#20986;&#20102;&#19968;&#20010;&#23553;&#38381;&#24418;&#24335;&#30340;&#34920;&#31034;&#12290;&#25105;&#20204;&#22312;&#20004;&#20010;&#23454;&#35777;&#35828;&#26126;&#20013;&#24212;&#29992;&#20102;&#25105;&#20204;&#30340;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
Social disruption occurs when a policy creates or destroys many network connections between agents. It is a costly side effect of many interventions and so a growing empirical literature recommends measuring and accounting for social disruption when evaluating the welfare impact of a policy. However, there is currently little work characterizing what can actually be learned about social disruption from data in practice. In this paper, we consider the problem of identifying social disruption in a research design that is popular in the literature. We provide two sets of identification results. First, we show that social disruption is not generally point identified, but informative bounds can be constructed using the eigenvalues of the network adjacency matrices observed by the researcher. Second, we show that point identification follows from a theoretically motivated monotonicity condition, and we derive a closed form representation. We apply our methods in two empirical illustrations a
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;&#24102;&#21512;&#32422;&#30340;&#21305;&#37197;&#24066;&#22330;&#20013;&#30340;&#31283;&#23450;&#24615;&#38382;&#39064;&#65292;&#21457;&#29616;&#31283;&#23450;&#24615;&#30772;&#22351;&#21518;&#65292;&#20844;&#21496;&#20934;&#31283;&#23450;&#30340;&#20998;&#37197;&#26041;&#24335;&#21487;&#20197;&#33258;&#28982;&#20986;&#29616;&#65292;&#32780;&#25105;&#20204;&#25552;&#20986;&#30340;&#31639;&#27861;&#21487;&#20197;&#20351;&#24066;&#22330;&#20174;&#20934;&#31283;&#23450;&#24615;&#20013;&#37325;&#26032;&#33719;&#24471;&#31283;&#23450;&#24615;&#12290;</title><link>http://arxiv.org/abs/2305.17948</link><description>&lt;p&gt;
&#24102;&#21512;&#32422;&#30340;&#21305;&#37197;&#24066;&#22330;&#20013;&#30340;&#20844;&#21496;&#20934;&#31283;&#23450;&#24615;&#21644;&#37325;&#26032;&#24179;&#34913;
&lt;/p&gt;
&lt;p&gt;
Firm-quasi-stability and re-equilibration in matching markets with contracts. (arXiv:2305.17948v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.17948
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;&#24102;&#21512;&#32422;&#30340;&#21305;&#37197;&#24066;&#22330;&#20013;&#30340;&#31283;&#23450;&#24615;&#38382;&#39064;&#65292;&#21457;&#29616;&#31283;&#23450;&#24615;&#30772;&#22351;&#21518;&#65292;&#20844;&#21496;&#20934;&#31283;&#23450;&#30340;&#20998;&#37197;&#26041;&#24335;&#21487;&#20197;&#33258;&#28982;&#20986;&#29616;&#65292;&#32780;&#25105;&#20204;&#25552;&#20986;&#30340;&#31639;&#27861;&#21487;&#20197;&#20351;&#24066;&#22330;&#20174;&#20934;&#31283;&#23450;&#24615;&#20013;&#37325;&#26032;&#33719;&#24471;&#31283;&#23450;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#21487;&#26367;&#20195;&#20559;&#22909;&#26465;&#20214;&#19979;&#65292;&#24102;&#26377;&#21512;&#32422;&#30340;&#22810;&#23545;&#22810;&#21305;&#37197;&#20013;&#30340;&#20844;&#21496;&#20934;&#31283;&#23450;&#24615;&#12290;&#25105;&#20204;&#24314;&#31435;&#20102;&#20844;&#21496;&#20934;&#31283;&#23450;&#24615;&#21644;&#31283;&#23450;&#24615;&#20043;&#38388;&#30340;&#21508;&#31181;&#20851;&#31995;&#65292;&#24182;&#23545;&#31283;&#23450;&#37197;&#32622;&#30340;&#23384;&#22312;&#24615;&#21644;&#26684;&#23376;&#24615;&#36136;&#25552;&#20379;&#20102;&#26032;&#30340;&#35265;&#35299;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#24403;&#24066;&#22330;&#30340;&#31283;&#23450;&#24615;&#30001;&#20110;&#26032;&#20844;&#21496;&#30340;&#21152;&#20837;&#25110;&#19968;&#20123;&#24037;&#20154;&#30340;&#36864;&#20241;&#32780;&#21463;&#21040;&#30772;&#22351;&#26102;&#65292;&#20844;&#21496;&#20934;&#31283;&#23450;&#30340;&#20998;&#37197;&#33258;&#28982;&#20986;&#29616;&#65292;&#24182;&#20171;&#32461;&#20102;&#19968;&#31181;&#24191;&#20041;&#30340;&#24310;&#36831;&#25509;&#21463;&#31639;&#27861;&#65292;&#20197;&#34920;&#26126;&#24066;&#22330;&#21487;&#20197;&#36890;&#36807;&#20998;&#25955;&#30340;&#25253;&#20215;&#21644;&#25509;&#21463;&#36807;&#31243;&#20174;&#20844;&#21496;&#20934;&#31283;&#23450;&#30340;&#20998;&#37197;&#20013;&#24674;&#22797;&#31283;&#23450;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study firm-quasi-stability in the framework of many-to-many matching with contracts under substitutable preferences. We establish various links between firm-quasi-stability and stability and give new insights into the existence and lattice property of stable allocations. Moreover, we show that firm-quasi-stable allocations appears naturally when the stability of the market is disrupted by the entry of new firms or the retirement of some workers, and introduce a generalized deferred acceptance algorithm to show that the market can regain stability from firm-quasi-stable allocations by a decentralized process of offers and acceptances.
&lt;/p&gt;</description></item><item><title>&#36825;&#39033;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;&#8220;&#27169;&#22411;&#21305;&#37197;&#8221;&#30340;&#36890;&#29992;&#26694;&#26550;&#65292;&#36890;&#36807;&#23398;&#20064;&#36317;&#31163;&#24230;&#37327;&#65292;&#21019;&#24314;&#21305;&#37197;&#32452;&#24182;&#20272;&#35745;&#27835;&#30103;&#25928;&#24212;&#65292;&#23454;&#29616;&#20102;&#21487;&#23457;&#26680;&#12289;&#26131;&#25490;&#26597;&#12289;&#20934;&#30830;&#20272;&#35745;&#21644;&#21487;&#25193;&#23637;&#30340;&#35266;&#23519;&#24615;&#22240;&#26524;&#25512;&#26029;&#26041;&#27861;&#12290;&#35813;&#26694;&#26550;&#20351;&#29992;&#21464;&#37327;&#37325;&#35201;&#24615;&#27979;&#37327;&#26500;&#24314;&#36317;&#31163;&#24230;&#37327;&#65292;&#24182;&#36890;&#36807;LASSO&#25805;&#20316;&#21270;&#23454;&#26045;&#65292;&#22312;&#19981;&#38656;&#35201;&#27491;&#30830;&#35268;&#23450;&#32447;&#24615;&#27169;&#22411;&#30340;&#24773;&#20917;&#19979;&#65292;&#23454;&#29616;&#20102;&#22312;&#28508;&#22312;&#28151;&#28102;&#21464;&#37327;&#25968;&#37327;&#19978;&#30340;&#21487;&#25193;&#23637;&#24615;&#21450;&#20934;&#30830;&#24615;&#12290;</title><link>http://arxiv.org/abs/2302.11715</link><description>&lt;p&gt;
&#21487;&#21464;&#37325;&#35201;&#24615;&#21305;&#37197;&#22312;&#22240;&#26524;&#25512;&#26029;&#20013;&#30340;&#24212;&#29992;
&lt;/p&gt;
&lt;p&gt;
Variable Importance Matching for Causal Inference. (arXiv:2302.11715v2 [stat.ME] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2302.11715
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;&#8220;&#27169;&#22411;&#21305;&#37197;&#8221;&#30340;&#36890;&#29992;&#26694;&#26550;&#65292;&#36890;&#36807;&#23398;&#20064;&#36317;&#31163;&#24230;&#37327;&#65292;&#21019;&#24314;&#21305;&#37197;&#32452;&#24182;&#20272;&#35745;&#27835;&#30103;&#25928;&#24212;&#65292;&#23454;&#29616;&#20102;&#21487;&#23457;&#26680;&#12289;&#26131;&#25490;&#26597;&#12289;&#20934;&#30830;&#20272;&#35745;&#21644;&#21487;&#25193;&#23637;&#30340;&#35266;&#23519;&#24615;&#22240;&#26524;&#25512;&#26029;&#26041;&#27861;&#12290;&#35813;&#26694;&#26550;&#20351;&#29992;&#21464;&#37327;&#37325;&#35201;&#24615;&#27979;&#37327;&#26500;&#24314;&#36317;&#31163;&#24230;&#37327;&#65292;&#24182;&#36890;&#36807;LASSO&#25805;&#20316;&#21270;&#23454;&#26045;&#65292;&#22312;&#19981;&#38656;&#35201;&#27491;&#30830;&#35268;&#23450;&#32447;&#24615;&#27169;&#22411;&#30340;&#24773;&#20917;&#19979;&#65292;&#23454;&#29616;&#20102;&#22312;&#28508;&#22312;&#28151;&#28102;&#21464;&#37327;&#25968;&#37327;&#19978;&#30340;&#21487;&#25193;&#23637;&#24615;&#21450;&#20934;&#30830;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30340;&#30446;&#26631;&#26159;&#25552;&#20986;&#19968;&#31181;&#21487;&#23457;&#26680;&#12289;&#26131;&#20110;&#25490;&#26597;&#12289;&#20934;&#30830;&#20272;&#35745;&#27835;&#30103;&#25928;&#24212;&#24182;&#21487;&#25193;&#23637;&#21040;&#39640;&#32500;&#25968;&#25454;&#30340;&#35266;&#23519;&#24615;&#22240;&#26524;&#25512;&#26029;&#26041;&#27861;&#12290;&#25105;&#20204;&#25551;&#36848;&#20102;&#19968;&#20010;&#31216;&#20026;&#8220;&#27169;&#22411;&#21305;&#37197;&#8221;&#30340;&#36890;&#29992;&#26694;&#26550;&#65292;&#36890;&#36807;&#20197;&#19979;&#27493;&#39588;&#23454;&#29616;&#36825;&#20123;&#30446;&#26631;&#65306;&#65288;i&#65289;&#36890;&#36807;&#32467;&#26524;&#24314;&#27169;&#23398;&#20064;&#36317;&#31163;&#24230;&#37327;&#65292;&#65288;ii&#65289;&#20351;&#29992;&#36317;&#31163;&#24230;&#37327;&#21019;&#24314;&#21305;&#37197;&#32452;&#65292;&#65288;iii&#65289;&#20351;&#29992;&#21305;&#37197;&#32452;&#20272;&#35745;&#27835;&#30103;&#25928;&#24212;&#12290;&#27169;&#22411;&#21305;&#37197;&#20351;&#29992;&#21464;&#37327;&#37325;&#35201;&#24615;&#27979;&#37327;&#26469;&#26500;&#24314;&#36317;&#31163;&#24230;&#37327;&#65292;&#20351;&#20854;&#25104;&#20026;&#19968;&#20010;&#28789;&#27963;&#30340;&#26694;&#26550;&#65292;&#21487;&#36866;&#24212;&#19981;&#21516;&#30340;&#24212;&#29992;&#22330;&#26223;&#12290;&#25105;&#20204;&#20851;&#27880;&#38382;&#39064;&#22312;&#28508;&#22312;&#28151;&#28102;&#21464;&#37327;&#25968;&#37327;&#19978;&#30340;&#21487;&#25193;&#23637;&#24615;&#65292;&#20351;&#29992;LASSO&#23558;&#27169;&#22411;&#21305;&#37197;&#26694;&#26550;&#25805;&#20316;&#21270;&#12290;&#25105;&#20204;&#22312;LASSO&#32467;&#26524;&#24314;&#27169;&#19968;&#33268;&#22320;&#35782;&#21035;&#20986;&#25152;&#26377;&#28151;&#28102;&#21464;&#37327;&#30340;&#24773;&#20917;&#19979;&#25512;&#23548;&#24615;&#33021;&#20445;&#35777;&#65288;&#37325;&#35201;&#30340;&#26159;&#19981;&#35201;&#27714;&#32447;&#24615;&#27169;&#22411;&#27491;&#30830;&#35268;&#23450;&#65289;&#12290;&#25105;&#20204;&#36824;&#25552;&#20379;&#23454;&#39564;&#35777;&#26126;&#20102;&#26041;&#27861;&#30340;&#25193;&#23637;&#24615;&#19982;&#20934;&#30830;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Our goal is to produce methods for observational causal inference that are auditable, easy to troubleshoot, accurate for treatment effect estimation, and scalable to high-dimensional data. We describe a general framework called Model-to-Match that achieves these goals by (i) learning a distance metric via outcome modeling, (ii) creating matched groups using the distance metric, and (iii) using the matched groups to estimate treatment effects. Model-to-Match uses variable importance measurements to construct a distance metric, making it a flexible framework that can be adapted to various applications. Concentrating on the scalability of the problem in the number of potential confounders, we operationalize the Model-to-Match framework with LASSO. We derive performance guarantees for settings where LASSO outcome modeling consistently identifies all confounders (importantly without requiring the linear model to be correctly specified). We also provide experimental results demonstrating the
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#19968;&#31561;&#20215;&#26684;&#24179;&#34913;&#30340;&#32479;&#35745;&#25512;&#26029;&#21644;A/B&#27979;&#35797;&#65292;&#24182;&#25552;&#20986;&#20102;&#36866;&#29992;&#20110;&#25293;&#21334;&#24179;&#21488;&#30340;&#32479;&#35745;&#26694;&#26550;&#65292;&#20197;&#20272;&#35745;&#26497;&#38480;FPPE&#30340;&#20851;&#38190;&#21442;&#25968;&#12290;&#20182;&#20204;&#36824;&#21457;&#23637;&#20102;&#20013;&#24515;&#26497;&#38480;&#23450;&#29702;&#12289;&#32622;&#20449;&#21306;&#38388;&#21644;&#28176;&#36817;&#23616;&#37096;&#26497;&#23567;&#26368;&#20248;&#24615;&#12290;&#36825;&#20010;&#29702;&#35770;&#21487;&#20197;&#29992;&#20110;&#23545;&#25293;&#21334;&#24179;&#21488;&#36827;&#34892;&#32479;&#35745;&#19978;&#26377;&#25928;&#30340;A/B&#27979;&#35797;&#12290;</title><link>http://arxiv.org/abs/2301.02276</link><description>&lt;p&gt;
&#38024;&#23545;&#19968;&#31561;&#20215;&#26684;&#24179;&#34913;&#30340;&#32479;&#35745;&#25512;&#26029;&#21644;A/B&#27979;&#35797;
&lt;/p&gt;
&lt;p&gt;
Statistical Inference and A/B Testing for First-Price Pacing Equilibria. (arXiv:2301.02276v3 [math.ST] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2301.02276
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#19968;&#31561;&#20215;&#26684;&#24179;&#34913;&#30340;&#32479;&#35745;&#25512;&#26029;&#21644;A/B&#27979;&#35797;&#65292;&#24182;&#25552;&#20986;&#20102;&#36866;&#29992;&#20110;&#25293;&#21334;&#24179;&#21488;&#30340;&#32479;&#35745;&#26694;&#26550;&#65292;&#20197;&#20272;&#35745;&#26497;&#38480;FPPE&#30340;&#20851;&#38190;&#21442;&#25968;&#12290;&#20182;&#20204;&#36824;&#21457;&#23637;&#20102;&#20013;&#24515;&#26497;&#38480;&#23450;&#29702;&#12289;&#32622;&#20449;&#21306;&#38388;&#21644;&#28176;&#36817;&#23616;&#37096;&#26497;&#23567;&#26368;&#20248;&#24615;&#12290;&#36825;&#20010;&#29702;&#35770;&#21487;&#20197;&#29992;&#20110;&#23545;&#25293;&#21334;&#24179;&#21488;&#36827;&#34892;&#32479;&#35745;&#19978;&#26377;&#25928;&#30340;A/B&#27979;&#35797;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#24320;&#23637;&#20102;&#38024;&#23545;&#19968;&#31561;&#20215;&#26684;&#24179;&#34913;&#65288;FPPE&#65289;&#30340;&#32479;&#35745;&#25512;&#26029;&#21644;A/B&#27979;&#35797;&#30340;&#30740;&#31350;&#12290;FPPE&#27169;&#22411;&#25429;&#25417;&#21040;&#20102;&#22823;&#35268;&#27169;&#19968;&#31561;&#20215;&#26684;&#25293;&#21334;&#24066;&#22330;&#20013;&#30340;&#21160;&#24577;&#65292;&#20854;&#20013;&#20080;&#23478;&#20351;&#29992;&#22522;&#20110;&#33410;&#22863;&#30340;&#39044;&#31639;&#31649;&#29702;&#12290;&#36825;&#26679;&#30340;&#24066;&#22330;&#20986;&#29616;&#22312;&#20114;&#32852;&#32593;&#24191;&#21578;&#30340;&#32972;&#26223;&#19979;&#65292;&#20854;&#20013;&#39044;&#31639;&#26159;&#24120;&#35265;&#30340;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;FPPE&#27169;&#22411;&#30340;&#32479;&#35745;&#26694;&#26550;&#65292;&#22312;&#36825;&#20010;&#26694;&#26550;&#20013;&#65292;&#20855;&#26377;&#26080;&#38480;&#20010;&#29289;&#21697;&#30340;&#26497;&#38480;FPPE&#27169;&#22411;&#25551;&#36848;&#20102;&#25293;&#21334;&#24179;&#21488;&#30340;&#38271;&#26399;&#31283;&#24577;&#34892;&#20026;&#65292;&#32780;&#30001;&#26377;&#38480;&#25968;&#37327;&#29289;&#21697;&#32452;&#25104;&#30340;&#21487;&#35266;&#23519;FPPE&#25552;&#20379;&#20102;&#20272;&#35745;&#26497;&#38480;FPPE&#30340;&#25968;&#25454;&#65292;&#20363;&#22914;&#25910;&#20837;&#12289;&#32435;&#20160;&#31038;&#20250;&#31119;&#21033;&#65288;&#19968;&#31181;&#20844;&#24179;&#30340;&#25928;&#29575;&#25351;&#26631;&#65289;&#21644;&#20854;&#20182;&#24863;&#20852;&#36259;&#30340;&#21442;&#25968;&#12290;&#25105;&#20204;&#21457;&#23637;&#20102;&#20013;&#24515;&#26497;&#38480;&#23450;&#29702;&#21644;&#28176;&#36817;&#26377;&#25928;&#30340;&#32622;&#20449;&#21306;&#38388;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#24314;&#31435;&#20102;&#20272;&#35745;&#22120;&#30340;&#28176;&#36817;&#23616;&#37096;&#26497;&#23567;&#26368;&#20248;&#24615;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#36825;&#20010;&#29702;&#35770;&#21487;&#20197;&#29992;&#20110;&#23545;&#25293;&#21334;&#24179;&#21488;&#36827;&#34892;&#32479;&#35745;&#19978;&#26377;&#25928;&#30340;A/B&#27979;&#35797;&#12290;
&lt;/p&gt;
&lt;p&gt;
We initiate the study of statistical inference and A/B testing for first-price pacing equilibria (FPPE). The FPPE model captures the dynamics resulting from large-scale first-price auction markets where buyers use pacing-based budget management. Such markets arise in the context of internet advertising, where budgets are prevalent.  We propose a statistical framework for the FPPE model, in which a limit FPPE with a continuum of items models the long-run steady-state behavior of the auction platform, and an observable FPPE consisting of a finite number of items provides the data to estimate primitives of the limit FPPE, such as revenue, Nash social welfare (a fair metric of efficiency), and other parameters of interest. We develop central limit theorems and asymptotically valid confidence intervals. Furthermore, we establish the asymptotic local minimax optimality of our estimators. We then show that the theory can be used for conducting statistically valid A/B testing on auction platfo
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#36890;&#36807;&#23454;&#39564;&#30740;&#31350;&#20102;&#28608;&#21457;&#25512;&#29702;&#23545;&#20449;&#24687;&#20256;&#36882;&#30340;&#24433;&#21709;&#65292;&#21457;&#29616;&#24403;&#21457;&#36865;&#32773;&#38754;&#20020;&#34987;&#25509;&#25910;&#32773;&#35780;&#23450;&#20026;&#30495;&#23454;&#30340;&#28608;&#21169;&#26102;&#65292;&#20182;&#20204;&#26356;&#20542;&#21521;&#20110;&#21457;&#36865;&#19982;&#25509;&#25910;&#32773;&#30340;&#25919;&#27835;&#21160;&#26426;&#20449;&#24565;&#19968;&#33268;&#30340;&#34394;&#20551;&#20449;&#24687;&#12290;&#25509;&#25910;&#32773;&#23545;&#21457;&#36865;&#32773;&#30340;&#35780;&#20215;&#19981;&#21463;&#21457;&#36865;&#32773;&#28608;&#21169;&#30340;&#24433;&#21709;&#12290;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;&#24403;&#23384;&#22312;&#28608;&#21457;&#20449;&#24565;&#30340;&#38382;&#39064;&#26102;&#65292;&#28608;&#21169;&#21487;&#33021;&#20250;&#23548;&#33268;&#34394;&#20551;&#20449;&#24687;&#30340;&#20256;&#25773;&#12290;</title><link>http://arxiv.org/abs/2111.06062</link><description>&lt;p&gt;
&#28608;&#21457;&#21160;&#26426;&#30340;&#20449;&#24565;&#20379;&#32473;
&lt;/p&gt;
&lt;p&gt;
The Supply of Motivated Beliefs. (arXiv:2111.06062v6 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2111.06062
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36890;&#36807;&#23454;&#39564;&#30740;&#31350;&#20102;&#28608;&#21457;&#25512;&#29702;&#23545;&#20449;&#24687;&#20256;&#36882;&#30340;&#24433;&#21709;&#65292;&#21457;&#29616;&#24403;&#21457;&#36865;&#32773;&#38754;&#20020;&#34987;&#25509;&#25910;&#32773;&#35780;&#23450;&#20026;&#30495;&#23454;&#30340;&#28608;&#21169;&#26102;&#65292;&#20182;&#20204;&#26356;&#20542;&#21521;&#20110;&#21457;&#36865;&#19982;&#25509;&#25910;&#32773;&#30340;&#25919;&#27835;&#21160;&#26426;&#20449;&#24565;&#19968;&#33268;&#30340;&#34394;&#20551;&#20449;&#24687;&#12290;&#25509;&#25910;&#32773;&#23545;&#21457;&#36865;&#32773;&#30340;&#35780;&#20215;&#19981;&#21463;&#21457;&#36865;&#32773;&#28608;&#21169;&#30340;&#24433;&#21709;&#12290;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;&#24403;&#23384;&#22312;&#28608;&#21457;&#20449;&#24565;&#30340;&#38382;&#39064;&#26102;&#65292;&#28608;&#21169;&#21487;&#33021;&#20250;&#23548;&#33268;&#34394;&#20551;&#20449;&#24687;&#30340;&#20256;&#25773;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#23454;&#39564;&#24615;&#22320;&#30740;&#31350;&#20102;&#28608;&#21457;&#25512;&#29702;&#23545;&#20449;&#24687;&#20256;&#36882;&#30340;&#24433;&#21709;&#12290;&#38543;&#26426;&#21305;&#37197;&#20102;&#21457;&#36865;&#32773;&#21644;&#19982;&#30495;&#23454;&#24773;&#20917;&#30456;&#19968;&#33268;&#25110;&#19981;&#19968;&#33268;&#30340;&#25509;&#25910;&#32773;&#65292;&#24182;&#19988;&#38754;&#20020;&#34987;&#25509;&#25910;&#32773;&#35780;&#23450;&#20026;&#30495;&#23454;&#30340;&#28608;&#21169;&#25110;&#27809;&#26377;&#28608;&#21169;&#12290;&#36825;&#31181;&#34987;&#24863;&#30693;&#20026;&#30495;&#23454;&#30340;&#28608;&#21169;&#20351;&#24471;&#21457;&#36865;&#32773;&#19981;&#37027;&#20040;&#30495;&#23454;&#65292;&#20182;&#20204;&#36716;&#32780;&#21457;&#36865;&#19982;&#25509;&#25910;&#32773;&#30340;&#25919;&#27835;&#21160;&#26426;&#20449;&#24565;&#19968;&#33268;&#30340;&#34394;&#20551;&#20449;&#24687;&#12290;&#25509;&#25910;&#32773;&#23545;&#21457;&#36865;&#32773;&#30495;&#23454;&#24615;&#30340;&#35780;&#20215;&#19981;&#21463;&#21457;&#36865;&#32773;&#28608;&#21169;&#30340;&#24433;&#21709;&#65292;&#36825;&#34920;&#26126;&#20182;&#20204;&#30456;&#23545;&#21333;&#32431;&#12290;&#36827;&#19968;&#27493;&#30340;&#23454;&#39564;&#30830;&#35748;&#20102;&#21457;&#36865;&#32773;&#20851;&#20110;&#28608;&#21457;&#25512;&#29702;&#30340;&#20449;&#24565;&#26159;&#39537;&#21160;&#26426;&#21046;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;&#24403;&#38382;&#39064;&#24341;&#21457;&#28608;&#21457;&#20449;&#24565;&#26102;&#65292;&#28608;&#21169;&#20250;&#24694;&#21270;&#34394;&#20551;&#20449;&#24687;&#30340;&#20256;&#25773;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper experimentally studies how motivated reasoning affects information transmission. Senders are randomly matched with receivers whose ideology is either aligned or misaligned with the truth, and either face incentives to be rated as truthful by receivers or face no incentives. These perceived-truth incentives make senders less truthful, as they shift to sending false information that aligns with receivers' politically-motivated beliefs. Receivers' ratings of senders' truthfulness are unaffected by senders' incentives, suggesting naivete. A complementary experiment further identifies senders' beliefs about motivated reasoning as the driving mechanism. Results indicate that incentives can perversely affect disinformation when issues evoke motivated beliefs.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#32479;&#19968;&#20102;&#25581;&#31034;&#29702;&#24615;&#24573;&#35270;&#21644;&#25581;&#31034;&#20559;&#22909;&#30340;&#20004;&#20010;&#20851;&#38190;&#32467;&#26524;&#65292;&#24182;&#21033;&#29992;&#36825;&#19968;&#32479;&#19968;&#32467;&#26524;&#22312;&#35745;&#31639;&#19978;&#25193;&#23637;&#20102;&#23545;&#25581;&#31034;&#20559;&#22909;&#27979;&#35797;&#30340;&#36866;&#24212;&#24615;&#27979;&#24230;&#65292;&#20197;&#36866;&#29992;&#20110;&#25581;&#31034;&#29702;&#24615;&#24573;&#35270;&#12290;</title><link>http://arxiv.org/abs/2106.14486</link><description>&lt;p&gt;
&#21516;&#19968;&#25581;&#31034;&#20559;&#22909;&#19982;&#25581;&#31034;&#29702;&#24615;&#24573;&#35270;&#30340;&#32467;&#21512;
&lt;/p&gt;
&lt;p&gt;
Unifying Revealed Preference and Revealed Rational Inattention. (arXiv:2106.14486v4 [econ.TH] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2106.14486
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#32479;&#19968;&#20102;&#25581;&#31034;&#29702;&#24615;&#24573;&#35270;&#21644;&#25581;&#31034;&#20559;&#22909;&#30340;&#20004;&#20010;&#20851;&#38190;&#32467;&#26524;&#65292;&#24182;&#21033;&#29992;&#36825;&#19968;&#32479;&#19968;&#32467;&#26524;&#22312;&#35745;&#31639;&#19978;&#25193;&#23637;&#20102;&#23545;&#25581;&#31034;&#20559;&#22909;&#27979;&#35797;&#30340;&#36866;&#24212;&#24615;&#27979;&#24230;&#65292;&#20197;&#36866;&#29992;&#20110;&#25581;&#31034;&#29702;&#24615;&#24573;&#35270;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#32479;&#19968;&#20102;&#32463;&#27982;&#29702;&#35770;&#20013;&#30340;&#20004;&#20010;&#20851;&#38190;&#32467;&#26524;&#65292;&#21363;&#25581;&#31034;&#29702;&#24615;&#24573;&#35270;&#21644;&#32463;&#20856;&#25581;&#31034;&#20559;&#22909;&#12290;&#25581;&#31034;&#29702;&#24615;&#24573;&#35270;&#26816;&#39564;&#36125;&#21494;&#26031;&#20915;&#31574;&#32773;&#20449;&#24687;&#33719;&#21462;&#30340;&#21512;&#29702;&#24615;&#65292;&#32780;&#32463;&#20856;&#25581;&#31034;&#20559;&#22909;&#21017;&#27979;&#35797;&#24050;&#30693;&#39044;&#31639;&#32422;&#26463;&#19979;&#25928;&#29992;&#26368;&#22823;&#21270;&#12290;&#25105;&#20204;&#30340;&#31532;&#19968;&#20010;&#32467;&#26524;&#26159;&#19968;&#20010;&#31561;&#20215;&#32467;&#26524; - &#36890;&#36807;&#20915;&#31574;&#21442;&#25968;&#19978;&#30340;&#31561;&#20215;&#26144;&#23556;&#21644;&#20915;&#31574;&#31354;&#38388;&#19978;&#30340;&#20559;&#24207;&#20851;&#31995;&#65292;&#25105;&#20204;&#32479;&#19968;&#20102;&#25581;&#31034;&#29702;&#24615;&#24573;&#35270;&#21644;&#25581;&#31034;&#20559;&#22909;&#12290;&#20854;&#27425;&#65292;&#25105;&#20204;&#21033;&#29992;&#36825;&#19968;&#32479;&#19968;&#32467;&#26524;&#22312;&#35745;&#31639;&#19978;&#25193;&#23637;&#20102;&#25991;&#29486;&#20013;&#23545;&#25581;&#31034;&#20559;&#22909;&#27979;&#35797;&#30340;&#36866;&#24212;&#24615;&#27979;&#24230;&#65292;&#20197;&#36866;&#29992;&#20110;&#25581;&#31034;&#29702;&#24615;&#24573;&#35270;&#12290;&#36825;&#31181;&#25193;&#23637;&#26377;&#21161;&#20110;&#37327;&#21270;&#36125;&#21494;&#26031;&#20915;&#31574;&#32773;&#30340;&#34892;&#20026;&#22312;&#29702;&#24615;&#24573;&#35270;&#26041;&#38754;&#30340;&#34920;&#29616;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#36890;&#36807;&#19968;&#20010;&#30495;&#23454;&#30340;YouTube&#25968;&#25454;&#38598;&#23637;&#31034;&#20102;&#32479;&#19968;&#32467;&#26524;&#30340;&#37325;&#35201;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper unifies two key results from economic theory, namely, revealed rational inattention and classical revealed preference. Revealed rational inattention tests for rationality of information acquisition for Bayesian decision makers. On the other hand, classical revealed preference tests for utility maximization under known budget constraints. Our first result is an equivalence result - we unify revealed rational inattention and revealed preference through an equivalence map over decision parameters and partial order for payoff monotonicity over the decision space in both setups. Second, we exploit the unification result computationally to extend robustness measures for goodness-of-fit of revealed preference tests in the literature to revealed rational inattention. This extension facilitates quantifying how well a Bayesian decision maker's actions satisfy rational inattention. Finally, we illustrate the significance of the unification result on a real-world YouTube dataset compris
&lt;/p&gt;</description></item><item><title>&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#38750;&#21442;&#25968;&#24314;&#27169;&#26694;&#26550;&#65292;&#29992;&#20110;&#32593;&#32476;&#24178;&#25200;&#26465;&#20214;&#19979;&#30340;&#22240;&#26524;&#25512;&#26029;&#65292;&#36890;&#36807;&#23545;&#20195;&#29702;&#20154;&#20043;&#38388;&#30340;&#36830;&#25509;&#26041;&#24335;&#36827;&#34892;&#24314;&#27169;&#21644;&#23398;&#20064;&#25919;&#31574;&#25110;&#27835;&#30103;&#20998;&#37197;&#30340;&#24433;&#21709;&#12290;&#25105;&#20204;&#36824;&#25552;&#20986;&#20102;&#19968;&#31181;&#26377;&#25928;&#30340;&#27979;&#35797;&#26041;&#27861;&#26469;&#26816;&#39564;&#25919;&#31574;&#26080;&#20851;&#24615;/&#27835;&#30103;&#25928;&#24212;&#65292;&#24182;&#23545;&#24179;&#22343;&#25110;&#20998;&#24067;&#24335;&#25919;&#31574;&#25928;&#24212;/&#27835;&#30103;&#21453;&#24212;&#30340;&#20272;&#35745;&#22120;&#32473;&#20986;&#20102;&#19978;&#30028;&#12290;</title><link>http://arxiv.org/abs/2105.03810</link><description>&lt;p&gt;
&#32593;&#32476;&#24178;&#25200;&#26465;&#20214;&#19979;&#22240;&#26524;&#25512;&#26029;&#30340;&#23616;&#37096;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
The Local Approach to Causal Inference under Network Interference. (arXiv:2105.03810v4 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2105.03810
&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#38750;&#21442;&#25968;&#24314;&#27169;&#26694;&#26550;&#65292;&#29992;&#20110;&#32593;&#32476;&#24178;&#25200;&#26465;&#20214;&#19979;&#30340;&#22240;&#26524;&#25512;&#26029;&#65292;&#36890;&#36807;&#23545;&#20195;&#29702;&#20154;&#20043;&#38388;&#30340;&#36830;&#25509;&#26041;&#24335;&#36827;&#34892;&#24314;&#27169;&#21644;&#23398;&#20064;&#25919;&#31574;&#25110;&#27835;&#30103;&#20998;&#37197;&#30340;&#24433;&#21709;&#12290;&#25105;&#20204;&#36824;&#25552;&#20986;&#20102;&#19968;&#31181;&#26377;&#25928;&#30340;&#27979;&#35797;&#26041;&#27861;&#26469;&#26816;&#39564;&#25919;&#31574;&#26080;&#20851;&#24615;/&#27835;&#30103;&#25928;&#24212;&#65292;&#24182;&#23545;&#24179;&#22343;&#25110;&#20998;&#24067;&#24335;&#25919;&#31574;&#25928;&#24212;/&#27835;&#30103;&#21453;&#24212;&#30340;&#20272;&#35745;&#22120;&#32473;&#20986;&#20102;&#19978;&#30028;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#38750;&#21442;&#25968;&#24314;&#27169;&#26694;&#26550;&#65292;&#29992;&#20110;&#22788;&#29702;&#31038;&#20132;&#25110;&#32463;&#27982;&#32593;&#32476;&#20013;&#20195;&#29702;&#20154;&#20043;&#38388;&#36830;&#25509;&#26041;&#24335;&#23545;&#32467;&#26524;&#20135;&#29983;&#24433;&#21709;&#30340;&#22240;&#26524;&#25512;&#26029;&#38382;&#39064;&#12290;&#36825;&#31181;&#32593;&#32476;&#24178;&#25200;&#25551;&#36848;&#20102;&#20851;&#20110;&#27835;&#30103;&#28322;&#20986;&#12289;&#31038;&#20132;&#20114;&#21160;&#12289;&#31038;&#20250;&#23398;&#20064;&#12289;&#20449;&#24687;&#25193;&#25955;&#12289;&#30142;&#30149;&#21644;&#37329;&#34701;&#20256;&#26579;&#12289;&#31038;&#20250;&#36164;&#26412;&#24418;&#25104;&#31561;&#39046;&#22495;&#30340;&#22823;&#37327;&#25991;&#29486;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#39318;&#20808;&#36890;&#36807;&#27979;&#37327;&#36335;&#24452;&#36317;&#31163;&#26469;&#25551;&#36848;&#20195;&#29702;&#20154;&#22312;&#32593;&#32476;&#20013;&#30340;&#36830;&#25509;&#26041;&#24335;&#65292;&#28982;&#21518;&#36890;&#36807;&#27719;&#38598;&#20855;&#26377;&#31867;&#20284;&#37197;&#32622;&#30340;&#20195;&#29702;&#20154;&#30340;&#32467;&#26524;&#25968;&#25454;&#26469;&#23398;&#20064;&#25919;&#31574;&#25110;&#27835;&#30103;&#20998;&#37197;&#30340;&#24433;&#21709;&#12290;&#25105;&#20204;&#36890;&#36807;&#25552;&#20986;&#19968;&#20010;&#28176;&#36817;&#26377;&#25928;&#30340;&#27979;&#35797;&#26469;&#28436;&#31034;&#35813;&#26041;&#27861;&#65292;&#35813;&#27979;&#35797;&#29992;&#20110;&#26816;&#39564;&#25919;&#31574;&#26080;&#20851;&#24615;/&#27835;&#30103;&#25928;&#24212;&#30340;&#20551;&#35774;&#65292;&#24182;&#32473;&#20986;&#20102;&#38024;&#23545;&#24179;&#22343;&#25110;&#20998;&#24067;&#24335;&#25919;&#31574;&#25928;&#24212;/&#27835;&#30103;&#21453;&#24212;&#30340;k&#26368;&#36817;&#37051;&#20272;&#35745;&#22120;&#30340;&#22343;&#26041;&#35823;&#24046;&#30340;&#19978;&#30028;&#12290;
&lt;/p&gt;
&lt;p&gt;
We propose a new nonparametric modeling framework for causal inference when outcomes depend on how agents are linked in a social or economic network. Such network interference describes a large literature on treatment spillovers, social interactions, social learning, information diffusion, disease and financial contagion, social capital formation, and more. Our approach works by first characterizing how an agent is linked in the network using the configuration of other agents and connections nearby as measured by path distance. The impact of a policy or treatment assignment is then learned by pooling outcome data across similarly configured agents. We demonstrate the approach by proposing an asymptotically valid test for the hypothesis of policy irrelevance/no treatment effects and bounding the mean-squared error of a k-nearest-neighbor estimator for the average or distributional policy effect/treatment response.
&lt;/p&gt;</description></item></channel></rss>