<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#26412;&#35770;&#25991;&#20171;&#32461;&#20102;Stata&#21253;Binsreg&#65292;&#35813;&#21253;&#23454;&#29616;&#20102;Binscatter&#26041;&#27861;&#65292;&#24182;&#25552;&#20379;&#20102;&#19971;&#20010;&#21629;&#20196;&#26469;&#36827;&#34892;&#22238;&#24402;&#20998;&#26512;&#12290;&#36825;&#20123;&#21629;&#20196;&#33021;&#22815;&#36827;&#34892;&#28857;&#20272;&#35745;&#12289;&#19981;&#30830;&#23450;&#24615;&#37327;&#21270;&#21644;&#25512;&#26029;&#27979;&#35797;&#65292;&#21516;&#26102;&#25552;&#20379;&#20102;&#20998;&#32452;&#25955;&#28857;&#22270;&#21644;&#22810;&#32452;&#32479;&#35745;&#27604;&#36739;&#12290;</title><link>http://arxiv.org/abs/1902.09615</link><description>&lt;p&gt;
Binscatter&#22238;&#24402;
&lt;/p&gt;
&lt;p&gt;
Binscatter Regressions. (arXiv:1902.09615v4 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/1902.09615
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#20171;&#32461;&#20102;Stata&#21253;Binsreg&#65292;&#35813;&#21253;&#23454;&#29616;&#20102;Binscatter&#26041;&#27861;&#65292;&#24182;&#25552;&#20379;&#20102;&#19971;&#20010;&#21629;&#20196;&#26469;&#36827;&#34892;&#22238;&#24402;&#20998;&#26512;&#12290;&#36825;&#20123;&#21629;&#20196;&#33021;&#22815;&#36827;&#34892;&#28857;&#20272;&#35745;&#12289;&#19981;&#30830;&#23450;&#24615;&#37327;&#21270;&#21644;&#25512;&#26029;&#27979;&#35797;&#65292;&#21516;&#26102;&#25552;&#20379;&#20102;&#20998;&#32452;&#25955;&#28857;&#22270;&#21644;&#22810;&#32452;&#32479;&#35745;&#27604;&#36739;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#20171;&#32461;&#20102;Stata&#36719;&#20214;&#21253;Binsreg&#65292;&#35813;&#36719;&#20214;&#21253;&#23454;&#29616;&#20102;Cattaneo&#12289;Crump&#12289;Farrell&#21644;Feng&#65288;2023a,b&#65289;&#24320;&#21457;&#30340;binscatter&#26041;&#27861;&#12290;&#35813;&#36719;&#20214;&#21253;&#21253;&#25324;&#19971;&#20010;&#21629;&#20196;&#65306;binsreg&#12289;binslogit&#12289;binsprobit&#12289;binsqreg&#12289;binstest&#12289;binspwc&#21644;binsregselect&#12290;&#21069;&#22235;&#20010;&#21629;&#20196;&#23454;&#29616;&#20102;&#22522;&#26412;&#21644;&#25193;&#23637;&#30340;&#26368;&#23567;&#20108;&#20056;binscatter&#22238;&#24402;&#65288;binsreg&#65289;&#30340;&#28857;&#20272;&#35745;&#21644;&#19981;&#30830;&#23450;&#24615;&#37327;&#21270;&#65288;&#32622;&#20449;&#21306;&#38388;&#21644;&#32622;&#20449;&#24102;&#65289;&#65292;&#20197;&#21450;&#24191;&#20041;&#38750;&#32447;&#24615;binscatter&#22238;&#24402;&#65288;binslogit&#29992;&#20110;Logit&#22238;&#24402;&#65292;binsprobit&#29992;&#20110;Probit&#22238;&#24402;&#65292;binsqreg&#29992;&#20110;&#20998;&#20301;&#25968;&#22238;&#24402;&#65289;&#12290;&#36825;&#20123;&#21629;&#20196;&#36824;&#25552;&#20379;&#20102;&#20998;&#32452;&#25955;&#28857;&#22270;&#65292;&#36866;&#29992;&#20110;&#21333;&#26679;&#26412;&#21644;&#22810;&#26679;&#26412;&#35774;&#32622;&#12290;&#21518;&#20004;&#20010;&#21629;&#20196;&#38598;&#20013;&#22312;&#28857;&#24577;&#21644;&#19968;&#33268;&#24615;&#25512;&#26029;&#26041;&#38754;&#65306;binstest&#23454;&#26045;&#20102;&#20851;&#20110;&#21442;&#25968;&#35774;&#23450;&#21644;&#26410;&#30693;&#22238;&#24402;&#20989;&#25968;&#30340;&#38750;&#21442;&#25968;&#24418;&#29366;&#38480;&#21046;&#30340;&#20551;&#35774;&#26816;&#39564;&#31243;&#24207;&#65292;&#32780;binspwc&#23454;&#26045;&#20102;&#22810;&#32452;&#25104;&#23545;&#32479;&#35745;&#27604;&#36739;&#12290;
&lt;/p&gt;
&lt;p&gt;
We introduce the Stata package Binsreg, which implements the binscatter methods developed in Cattaneo, Crump, Farrell and Feng (2023a,b). The package includes seven commands: binsreg, binslogit, binsprobit, binsqreg, binstest, binspwc, and binsregselect. The first four commands implement point estimation and uncertainty quantification (confidence intervals and confidence bands) for canonical and extended least squares binscatter regression (binsreg) as well as generalized nonlinear binscatter regression (binslogit for Logit regression, binsprobit for Probit regression, and binsqreg for quantile regression). These commands also offer binned scatter plots, allowing for one- and multi-sample settings. The next two commands focus on pointwise and uniform inference: binstest implements hypothesis testing procedures for parametric specifications and for nonparametric shape restrictions of the unknown regression function, while binspwc implements multi-group pairwise statistical comparisons. 
&lt;/p&gt;</description></item></channel></rss>