<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;COVID-19&#30123;&#24773;&#26399;&#38388;&#19978;&#24066;&#20844;&#21496;&#30340;&#26631;&#20215;&#21644;&#21033;&#28070;&#29575;&#65292;&#20272;&#35745;&#20102;&#22914;&#26524;&#27809;&#26377;&#30123;&#24773;&#65292;&#26631;&#35760;&#20215;&#26684;&#23558;&#27604;&#35266;&#23519;&#21040;&#30340;&#39640;&#65292;&#21033;&#28070;&#29575;&#23558;&#27604;&#39044;&#27979;&#20302;&#65292;&#27492;&#22806;&#36824;&#21457;&#29616;&#20102;&#30123;&#24773;&#23545;&#20851;&#38190;&#20844;&#21496;&#29305;&#24449;&#21644;&#34892;&#19994;&#36896;&#25104;&#30340;&#26126;&#26174;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2303.08765</link><description>&lt;p&gt;
&#30123;&#24773;&#23545;&#24066;&#22330;&#21147;&#37327;&#21644;&#30408;&#21033;&#33021;&#21147;&#30340;&#24433;&#21709;
&lt;/p&gt;
&lt;p&gt;
The Effects of the Pandemic on Market Power and Profitability. (arXiv:2303.08765v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.08765
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;COVID-19&#30123;&#24773;&#26399;&#38388;&#19978;&#24066;&#20844;&#21496;&#30340;&#26631;&#20215;&#21644;&#21033;&#28070;&#29575;&#65292;&#20272;&#35745;&#20102;&#22914;&#26524;&#27809;&#26377;&#30123;&#24773;&#65292;&#26631;&#35760;&#20215;&#26684;&#23558;&#27604;&#35266;&#23519;&#21040;&#30340;&#39640;&#65292;&#21033;&#28070;&#29575;&#23558;&#27604;&#39044;&#27979;&#20302;&#65292;&#27492;&#22806;&#36824;&#21457;&#29616;&#20102;&#30123;&#24773;&#23545;&#20851;&#38190;&#20844;&#21496;&#29305;&#24449;&#21644;&#34892;&#19994;&#36896;&#25104;&#30340;&#26126;&#26174;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;3,611&#23478;&#19978;&#24066;&#20844;&#21496;&#22312;COVID-19&#30123;&#24773;&#26399;&#38388;&#30340;&#20844;&#21496;&#27700;&#24179;&#30340;&#26631;&#35760;&#21644;&#21033;&#28070;&#29575;&#65292;&#24182;&#21457;&#29616;&#20102;&#24179;&#22343;&#20844;&#21496;&#30340;&#22686;&#38271;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#19968;&#20123;&#26465;&#20214;&#65292;&#20351;&#24471;&#26631;&#35760;&#21644;&#21033;&#28070;&#29575;&#30340;&#39044;&#27979;&#20855;&#26377;&#22240;&#26524;&#35299;&#37322;&#65292;&#21363;&#22914;&#26524;&#30123;&#24773;&#27809;&#26377;&#21457;&#29983;&#65292;&#20250;&#21457;&#29983;&#20160;&#20040;&#12290;&#25105;&#20204;&#30340;&#20272;&#35745;&#34920;&#26126;&#65292;&#22914;&#26524;&#30123;&#24773;&#27809;&#26377;&#21457;&#29983;&#65292;&#26631;&#35760;&#20215;&#26684;&#23558;&#27604;2020&#24180;&#21644;2021&#24180;&#35266;&#23519;&#21040;&#30340;&#39640;4&#65285;&#21644;7&#65285;&#65292;&#21033;&#28070;&#29575;&#23558;&#27604;&#39044;&#27979;&#20302;2.1&#21644;6.4&#20010;&#30334;&#20998;&#28857;&#12290;&#25105;&#20204;&#36827;&#34892;&#20102;&#19968;&#31995;&#21015;&#27979;&#35797;&#65292;&#20197;&#35780;&#20272;&#25105;&#20204;&#26041;&#27861;&#30340;&#31283;&#20581;&#24615;&#12290;&#25105;&#20204;&#36827;&#19968;&#27493;&#23637;&#31034;&#20102;&#30001;&#20851;&#38190;&#20844;&#21496;&#29305;&#24449;&#21644;&#34892;&#19994;&#36896;&#25104;&#30340;&#20896;&#29366;&#30149;&#27602;&#23545;&#20844;&#21496;&#24433;&#21709;&#30340;&#26174;&#33879;&#24046;&#24322;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#26631;&#35760;&#20215;&#26684;&#20302;&#20110;&#39044;&#26399;&#30340;&#20844;&#21496;&#24448;&#24448;&#22312;&#32929;&#31080;&#19978;&#20132;&#26131;&#26102;&#38388;&#36739;&#30701;&#19988;&#21592;&#24037;&#36739;&#23569;&#12290;
&lt;/p&gt;
&lt;p&gt;
We explore firm-level markup and profit rates during the COVID-19 pandemic for a panel of 3,611 publicly traded firms in Compustat and find increases for the average firm. We offer conditions to give markups and profit rate forecasts a causal interpretation of what would have happened had the pandemic not happened. Our estimations suggest that had the pandemic not happened, markups would have been 4% and 7% higher than observed in 2020 and 2021, respectively, and profit rates would have been 2.1 and 6.4 percentage points lower. We perform a battery of tests to assess the robustness of our approach. We further show significant heterogeneity in the impact of the pandemic on firms by key firm characteristics and industry. We find that firms with lower than forecasted markups tend to have lower stock-exchange tenure and fewer employees.
&lt;/p&gt;</description></item><item><title>&#35813;&#30740;&#31350;&#35777;&#26126;&#20102;&#22312;&#27491;&#24577;&#20301;&#32622;&#27169;&#22411;&#20013;&#65292;&#38480;&#21046;&#20102;&#22343;&#20540;&#26041;&#24046;&#30340;&#20808;&#39564;&#65292;&#22312;&#36125;&#21494;&#26031;&#39118;&#38505;&#19979;&#20855;&#26377;&#26377;&#38480;&#30340;&#26368;&#22823;&#35823;&#24046;&#65292;&#32467;&#26524;&#36866;&#29992;&#20110;&#21508;&#31181;&#20808;&#39564;&#21644;&#26041;&#24046;&#12290;</title><link>http://arxiv.org/abs/2303.08653</link><description>&lt;p&gt;
&#27491;&#24577;&#20301;&#32622;&#27169;&#22411;&#20013;&#30340;&#22343;&#20540;-&#26041;&#24046;&#21463;&#38480;&#20808;&#39564;&#26377;&#26377;&#38480;&#30340;&#26368;&#22823;&#36125;&#21494;&#26031;&#39118;&#38505;
&lt;/p&gt;
&lt;p&gt;
Mean-variance constrained priors have finite maximum Bayes risk in the normal location model. (arXiv:2303.08653v1 [math.ST])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.08653
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#35777;&#26126;&#20102;&#22312;&#27491;&#24577;&#20301;&#32622;&#27169;&#22411;&#20013;&#65292;&#38480;&#21046;&#20102;&#22343;&#20540;&#26041;&#24046;&#30340;&#20808;&#39564;&#65292;&#22312;&#36125;&#21494;&#26031;&#39118;&#38505;&#19979;&#20855;&#26377;&#26377;&#38480;&#30340;&#26368;&#22823;&#35823;&#24046;&#65292;&#32467;&#26524;&#36866;&#29992;&#20110;&#21508;&#31181;&#20808;&#39564;&#21644;&#26041;&#24046;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#32771;&#34385;&#19968;&#20010;&#27491;&#24577;&#20301;&#32622;&#27169;&#22411;&#65292;&#20854;&#20013; $X \mid \theta \sim N(\theta, \sigma^2)$&#65292;$\sigma^2$&#24050;&#30693;&#12290;&#20551;&#35774; $\theta \sim G_0$&#65292;&#20854;&#20013;&#20808;&#39564; $G_0$ &#20855;&#26377;&#38646;&#22343;&#20540;&#21644;&#21333;&#20301;&#26041;&#24046;&#12290;&#20196; $G_1$ &#20026;&#21487;&#33021;&#23384;&#22312;&#35823;&#24046;&#30340;&#38646;&#22343;&#20540;&#21644;&#21333;&#20301;&#26041;&#24046;&#30340;&#20808;&#39564;&#12290;&#25105;&#20204;&#34920;&#26126;&#65292;&#22312; $G_0, G_1, \sigma^2 &gt; 0$ &#33539;&#22260;&#20869;&#65292;&#36125;&#21494;&#26031;&#39118;&#38505;&#19979;&#30340;&#21518;&#39564;&#22343;&#20540;&#30340;&#24179;&#26041;&#35823;&#24046;&#26377;&#30028;&#12290;
&lt;/p&gt;
&lt;p&gt;
Consider a normal location model $X \mid \theta \sim N(\theta, \sigma^2)$ with known $\sigma^2$. Suppose $\theta \sim G_0$, where the prior $G_0$ has zero mean and unit variance. Let $G_1$ be a possibly misspecified prior with zero mean and unit variance. We show that the squared error Bayes risk of the posterior mean under $G_1$ is bounded, uniformly over $G_0, G_1, \sigma^2 &gt; 0$.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#35777;&#26126;&#20102;&#26399;&#26395;&#25928;&#29992;&#23450;&#29702;&#30340;&#19968;&#20010;&#24314;&#35774;&#24615;&#29256;&#26412;&#65292;&#22312;&#36825;&#20010;&#29256;&#26412;&#20013;&#65292;&#20559;&#22909;&#26159;&#22312;&#26576;&#20010;&#25299;&#25169;&#31354;&#38388;&#19978;&#36830;&#32493;&#21464;&#21270;&#30340;&#25277;&#31614;&#19978;&#23450;&#20041;&#30340;&#65292;&#24182;&#29992;&#36739;&#23567;&#38598;&#21512;&#30340;&#24320;&#35206;&#30422;&#20316;&#20026;&#20449;&#24687;&#32454;&#21270;&#30340;&#19968;&#20010;&#27010;&#24565;&#65292;&#36825;&#20004;&#20010;&#24314;&#35774;&#24615;&#35266;&#28857;&#28041;&#21450;&#21040;&#30452;&#35273;&#20027;&#20041;&#36923;&#36753;&#21644;&#38598;&#21512;&#30340;&#20998;&#35299;&#12290;</title><link>http://arxiv.org/abs/2303.08633</link><description>&lt;p&gt;
&#20174;&#24314;&#35774;&#24615;&#35266;&#28857;&#30475;&#26399;&#26395;&#25928;&#29992;
&lt;/p&gt;
&lt;p&gt;
Expected Utility from a Constructive Viewpoint. (arXiv:2303.08633v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.08633
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#35777;&#26126;&#20102;&#26399;&#26395;&#25928;&#29992;&#23450;&#29702;&#30340;&#19968;&#20010;&#24314;&#35774;&#24615;&#29256;&#26412;&#65292;&#22312;&#36825;&#20010;&#29256;&#26412;&#20013;&#65292;&#20559;&#22909;&#26159;&#22312;&#26576;&#20010;&#25299;&#25169;&#31354;&#38388;&#19978;&#36830;&#32493;&#21464;&#21270;&#30340;&#25277;&#31614;&#19978;&#23450;&#20041;&#30340;&#65292;&#24182;&#29992;&#36739;&#23567;&#38598;&#21512;&#30340;&#24320;&#35206;&#30422;&#20316;&#20026;&#20449;&#24687;&#32454;&#21270;&#30340;&#19968;&#20010;&#27010;&#24565;&#65292;&#36825;&#20004;&#20010;&#24314;&#35774;&#24615;&#35266;&#28857;&#28041;&#21450;&#21040;&#30452;&#35273;&#20027;&#20041;&#36923;&#36753;&#21644;&#38598;&#21512;&#30340;&#20998;&#35299;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#35777;&#26126;&#20102;&#26399;&#26395;&#25928;&#29992;&#23450;&#29702;&#30340;&#19968;&#20010;&#24314;&#35774;&#24615;&#29256;&#26412;&#12290;&#36825;&#37324;&#30340;&#24314;&#35774;&#24615;&#26377;&#20004;&#20010;&#21547;&#20041;&#8212;&#8212;&#31532;&#19968;&#65292;&#20687;&#24314;&#35774;&#24615;&#25968;&#23398;&#37027;&#26679;&#65292;&#35777;&#26126;&#25152;&#20381;&#25454;&#30340;&#36923;&#36753;&#26159;&#30452;&#35273;&#20027;&#20041;&#30340;&#65307;&#31532;&#20108;&#65292;&#24314;&#35774;&#24615;&#24847;&#21619;&#30528;&#30001;&#31616;&#21333;&#30340;&#32452;&#20214;&#26500;&#24314;&#32780;&#26469;&#12290;&#20559;&#22909;&#26159;&#22312;&#26576;&#20010;&#25299;&#25169;&#31354;&#38388;&#19978;&#36830;&#32493;&#21464;&#21270;&#30340;&#25277;&#31614;&#19978;&#23450;&#20041;&#30340;&#65292;&#32780;&#19988;&#36825;&#20123;&#25277;&#31614;&#26412;&#36523;&#34987;&#35748;&#20026;&#26159;&#21462;&#20915;&#20110;&#26576;&#31181;&#22522;&#30784;&#30340;&#27979;&#37327;&#12289;&#21830;&#35758;&#25110;&#35266;&#23519;&#36807;&#31243;&#12290;&#25299;&#25169;&#31354;&#38388;&#30340;&#24320;&#38598;&#20316;&#20026;&#26377;&#20851;&#20559;&#22909;&#30340;&#26029;&#35328;&#30340;&#21487;&#33021;&#30495;&#20540;&#65292;&#24182;&#19988;&#21046;&#32422;&#30528;&#21487;&#20197;&#27979;&#37327;&#12289;&#25512;&#23548;&#25110;&#35266;&#23519;&#21040;&#30340;&#20869;&#23481;&#12290;&#29992;&#36739;&#23567;&#38598;&#21512;&#30340;&#24320;&#35206;&#30422;&#26367;&#25442;&#24320;&#38598;&#20316;&#20026;&#20449;&#24687;&#32454;&#21270;&#30340;&#19968;&#20010;&#27010;&#24565;&#65292;&#24182;&#19988;&#23545;&#36825;&#20123;&#36739;&#23567;&#38598;&#21512;&#20316;&#20986;&#30340;&#25512;&#26029;&#21487;&#20197;&#32452;&#21512;&#25110;&#27719;&#24635;&#65292;&#20197;&#20415;&#24471;&#21040;&#22312;&#36739;&#22823;&#38598;&#21512;&#19978;&#30340;&#30456;&#24212;&#25512;&#26029;&#12290;&#36825;&#20004;&#20010;&#24314;&#35774;&#24615;&#35266;&#28857;&#32467;&#26524;&#26159;&#30456;&#20851;&#30340;&#65292;&#22240;&#20026;&#20854;&#20013;&#19968;&#20010;&#28041;&#21450;&#21040;&#30452;&#35273;&#20027;&#20041;&#36923;&#36753;&#32780;&#21478;&#19968;&#20010;&#21017;&#28041;&#21450;&#21040;&#38598;&#21512;&#30340;&#20998;&#35299;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper proves a constructive version of the expected utility theorem. The word constructive is construed here in two senses - first, as in constructive mathematics, whereby the logic underlying proofs is intuitionistic. In a second sense of the word, constructive is taken to mean built up from simpler components. Preferences are defined over lotteries that vary continuously over some topological space and are themselves assumed to vary depending upon some underlying process of measurement, deliberation, or observation. The open sets of the topology serve as the possible truth values of assertions about preference and constrain what can be measured, deduced, or observed. Replacing an open set by an open covering of smaller sets serves as a notion of refinement of information, and deductions made for these smaller sets can be combined or collated to yield corresponding deductions over the larger set. The two notions of constructive turn out to be related because the underlying logic 
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#35774;&#35745;&#20102;&#19968;&#31181;&#26679;&#26412;&#39640;&#25928;&#31639;&#27861;&#65292;&#23558; UCB &#31639;&#27861;&#65288;Auer&#31561;&#20154;&#65292;2002&#65289;&#24212;&#29992;&#20110;&#22996;&#25176;&#20195;&#29702;&#27169;&#22411;&#30340;&#22312;&#32447;&#35774;&#32622;&#65292;&#35813;&#31639;&#27861;&#33021;&#22815;&#36890;&#36807;&#19982;&#31574;&#30053;&#20195;&#29702;&#22810;&#27425;&#20114;&#21160;&#26469;&#35774;&#35745;&#26368;&#20248;&#30340;&#35745;&#20998;&#35268;&#21017;&#65292;&#24182;&#23454;&#29616;&#33391;&#22909;&#30340;&#25928;&#26524;&#12290;</title><link>http://arxiv.org/abs/2303.08613</link><description>&lt;p&gt;
&#23398;&#20064;&#22870;&#21169;&#20449;&#24687;&#33719;&#21462;&#65306;&#27491;&#30830;&#35745;&#20998;&#35268;&#21017;&#36935;&#21040;&#22996;&#25176;&#20195;&#29702;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
Learning to Incentivize Information Acquisition: Proper Scoring Rules Meet Principal-Agent Model. (arXiv:2303.08613v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.08613
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#35774;&#35745;&#20102;&#19968;&#31181;&#26679;&#26412;&#39640;&#25928;&#31639;&#27861;&#65292;&#23558; UCB &#31639;&#27861;&#65288;Auer&#31561;&#20154;&#65292;2002&#65289;&#24212;&#29992;&#20110;&#22996;&#25176;&#20195;&#29702;&#27169;&#22411;&#30340;&#22312;&#32447;&#35774;&#32622;&#65292;&#35813;&#31639;&#27861;&#33021;&#22815;&#36890;&#36807;&#19982;&#31574;&#30053;&#20195;&#29702;&#22810;&#27425;&#20114;&#21160;&#26469;&#35774;&#35745;&#26368;&#20248;&#30340;&#35745;&#20998;&#35268;&#21017;&#65292;&#24182;&#23454;&#29616;&#33391;&#22909;&#30340;&#25928;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#22996;&#25176;&#20195;&#29702;&#27169;&#22411;&#20013;&#30340;&#28608;&#21169;&#20449;&#24687;&#33719;&#21462;&#38382;&#39064;&#12290;&#27492;&#38382;&#39064;&#34987;&#24314;&#27169;&#20026;&#22996;&#25176;&#26041;&#21644;&#20195;&#29702;&#26041;&#20043;&#38388;&#30340; Stackelberg &#21338;&#24328;&#65292;&#20854;&#20013;&#22996;&#25176;&#20154;&#23459;&#24067;&#20102;&#19968;&#26465;&#24471;&#20998;&#35268;&#21017;&#26469;&#25351;&#23450;&#20184;&#27454;&#65292;&#28982;&#21518;&#20195;&#29702;&#26041;&#36873;&#25321;&#26368;&#22823;&#21270;&#20854;&#33258;&#36523;&#21033;&#28070;&#21644;&#25253;&#21578;&#20449;&#24687;&#30340;&#21162;&#21147;&#27700;&#24179;&#12290;&#25105;&#20204;&#20174;&#22996;&#25176;&#26041;&#30340;&#35282;&#24230;&#30740;&#31350;&#36825;&#20010;&#38382;&#39064;&#30340;&#22312;&#32447;&#35774;&#32622;&#65292;&#21363;&#36890;&#36807;&#19982;&#31574;&#30053;&#20195;&#29702;&#22810;&#27425;&#20132;&#20114;&#26469;&#35774;&#35745;&#26368;&#20248;&#35745;&#20998;&#35268;&#21017;&#12290;&#25105;&#20204;&#35774;&#35745;&#20102;&#19968;&#31181;&#21487;&#35777;&#26126;&#30340;&#26679;&#26412;&#39640;&#25928;&#31639;&#27861;&#65292;&#23558; UCB &#31639;&#27861; (Auer et al., 2002) &#37327;&#36523;&#23450;&#21046;&#21040;&#25105;&#20204;&#30340;&#27169;&#22411;&#20013;&#65292;&#20854;&#22312; T &#27425;&#36845;&#20195;&#21518;&#23454;&#29616;&#20102;&#27425;&#32447;&#24615; $T^{2/3}$-&#36951;&#25022;&#12290;&#25105;&#20204;&#30340;&#31639;&#27861;&#20855;&#26377;&#23545;&#22996;&#25176;&#26041;&#26368;&#20248;&#21033;&#28070;&#36827;&#34892;&#31934;&#32454;&#20272;&#35745;&#30340;&#36807;&#31243;&#20197;&#21450;&#20445;&#23432;&#32416;&#27491;&#26041;&#26696;&#65292;&#20197;&#30830;&#20445;&#20195;&#29702;&#26041;&#30340;&#34892;&#21160;&#24471;&#21040;&#26377;&#25928;&#28608;&#21169;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#30340;&#36951;&#25022;&#30028;&#30340;&#19968;&#20010;&#20851;&#38190;&#29305;&#24449;&#26159;&#23427;&#26159;&#28176;&#36827;&#26368;&#23567;&#21487;&#23454;&#29616;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study the incentivized information acquisition problem, where a principal hires an agent to gather information on her behalf. Such a problem is modeled as a Stackelberg game between the principal and the agent, where the principal announces a scoring rule that specifies the payment, and then the agent then chooses an effort level that maximizes her own profit and reports the information. We study the online setting of such a problem from the principal's perspective, i.e., designing the optimal scoring rule by repeatedly interacting with the strategic agent. We design a provably sample efficient algorithm that tailors the UCB algorithm (Auer et al., 2002) to our model, which achieves a sublinear $T^{2/3}$-regret after $T$ iterations. Our algorithm features a delicate estimation procedure for the optimal profit of the principal, and a conservative correction scheme that ensures the desired agent's actions are incentivized. Furthermore, a key feature of our regret bound is that it is i
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#26041;&#27861;&#65292;&#29992;&#20110;&#35782;&#21035;&#20855;&#26377;&#20219;&#24847;&#30456;&#20851;&#21516;&#26399;&#25910;&#20837;&#20914;&#20987;&#30340;&#30408;&#21033;&#21160;&#24577;&#27169;&#22411;&#20013;&#30340;&#31995;&#25968;&#12290;</title><link>http://arxiv.org/abs/2303.08460</link><description>&lt;p&gt;
&#35782;&#21035;&#20855;&#26377;&#30456;&#20851;&#21516;&#26399;&#25910;&#20837;&#20914;&#20987;&#30340;&#30408;&#21033;&#36807;&#31243;
&lt;/p&gt;
&lt;p&gt;
Identifying an Earnings Process With Dependent Contemporaneous Income Shocks. (arXiv:2303.08460v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.08460
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#26041;&#27861;&#65292;&#29992;&#20110;&#35782;&#21035;&#20855;&#26377;&#20219;&#24847;&#30456;&#20851;&#21516;&#26399;&#25910;&#20837;&#20914;&#20987;&#30340;&#30408;&#21033;&#21160;&#24577;&#27169;&#22411;&#20013;&#30340;&#31995;&#25968;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#26041;&#27861;&#65292;&#29992;&#20110;&#35782;&#21035;&#20855;&#26377;&#20219;&#24847;&#30456;&#20851;&#21516;&#26399;&#25910;&#20837;&#20914;&#20987;&#30340;&#30408;&#21033;&#21160;&#24577;&#27169;&#22411;&#20013;&#30340;&#31995;&#25968;&#12290;&#20256;&#32479;&#26041;&#27861;&#20381;&#36182;&#20110;&#20108;&#38454;&#30697;&#26080;&#27861;&#35782;&#21035;&#36825;&#20123;&#31995;&#25968;&#65292;&#24378;&#35843;&#20102;&#38656;&#35201;&#25429;&#25417;&#39640;&#38454;&#30697;&#20449;&#24687;&#30340;&#38750;&#39640;&#26031;&#20551;&#35774;&#30340;&#24517;&#35201;&#24615;&#12290;&#20363;&#22914;&#65292;&#25105;&#20204;&#30340;&#32467;&#26524;&#26377;&#21161;&#20110;&#30408;&#21033;&#21160;&#24577;&#25991;&#29486;&#65292;&#20801;&#35768;&#30408;&#21033;&#27169;&#22411;&#20855;&#26377;&#24037;&#20316;&#21464;&#21160;&#30340;&#27704;&#20037;&#25910;&#20837;&#20914;&#20987;&#19982;&#21516;&#26399;&#30701;&#26242;&#25910;&#20837;&#20914;&#20987;&#30340;&#20851;&#32852;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper proposes a novel approach for identifying coefficients in an earnings dynamics model with arbitrarily dependent contemporaneous income shocks. Traditional methods relying on second moments fail to identify these coefficients, emphasizing the need for nongaussianity assumptions that capture information from higher moments. Our results contribute to the literature on earnings dynamics by allowing models of earnings to have, for example, the permanent income shock of a job change to be linked to the contemporaneous transitory income shock of a relocation bonus.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#30456;&#23545;&#20195;&#38469;&#27969;&#21160;&#24615;&#30340;&#34913;&#37327;&#26041;&#24335;&#65292;&#26088;&#22312;&#25511;&#21046;&#20010;&#20154;&#21644;&#29238;&#27597;&#29305;&#24449;&#20998;&#24067;&#30340;&#21464;&#21270;&#12290;&#36890;&#36807;&#23545;&#32654;&#22269;&#20154;&#21475;&#26222;&#26597;&#25968;&#25454;&#30340;&#23454;&#35777;&#20998;&#26512;&#65292;&#25581;&#31034;&#20986;&#20805;&#20998;&#25511;&#21046;&#29305;&#24449;&#20998;&#24067;&#30340;&#21464;&#21270;&#23545;&#20110;&#20943;&#23569;&#39640;&#20013;&#27605;&#19994;&#29575;&#21644;&#22823;&#23398;&#23398;&#20301;&#36951;&#20256;&#24615;&#30340;&#25919;&#31574;&#30340;&#21046;&#23450;&#20855;&#26377;&#37325;&#35201;&#24847;&#20041;&#12290;</title><link>http://arxiv.org/abs/2303.08445</link><description>&lt;p&gt;
&#32654;&#22269;&#30340;&#39640;&#20013;&#25991;&#20973;&#21644;&#22823;&#23398;&#23398;&#21382;&#26159;&#21542;&#21516;&#26679;&#20855;&#26377;&#36951;&#20256;&#24615;&#65311;&#30456;&#23545;&#20195;&#38469;&#27969;&#21160;&#24615;&#30340;&#26032;&#34913;&#37327;&#26041;&#24335;
&lt;/p&gt;
&lt;p&gt;
Are high school degrees and university diplomas equally heritable in the US? A new measure of relative intergenerational mobility. (arXiv:2303.08445v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.08445
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#30456;&#23545;&#20195;&#38469;&#27969;&#21160;&#24615;&#30340;&#34913;&#37327;&#26041;&#24335;&#65292;&#26088;&#22312;&#25511;&#21046;&#20010;&#20154;&#21644;&#29238;&#27597;&#29305;&#24449;&#20998;&#24067;&#30340;&#21464;&#21270;&#12290;&#36890;&#36807;&#23545;&#32654;&#22269;&#20154;&#21475;&#26222;&#26597;&#25968;&#25454;&#30340;&#23454;&#35777;&#20998;&#26512;&#65292;&#25581;&#31034;&#20986;&#20805;&#20998;&#25511;&#21046;&#29305;&#24449;&#20998;&#24067;&#30340;&#21464;&#21270;&#23545;&#20110;&#20943;&#23569;&#39640;&#20013;&#27605;&#19994;&#29575;&#21644;&#22823;&#23398;&#23398;&#20301;&#36951;&#20256;&#24615;&#30340;&#25919;&#31574;&#30340;&#21046;&#23450;&#20855;&#26377;&#37325;&#35201;&#24847;&#20041;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#30456;&#23545;&#20195;&#38469;&#27969;&#21160;&#24615;&#30340;&#26032;&#34913;&#37327;&#26041;&#24335;&#65292;&#23558;&#25945;&#32946;&#29305;&#24449;&#20316;&#20026;&#26426;&#20250;&#19981;&#24179;&#31561;&#30340;&#20195;&#29702;&#12290;&#19982;&#36890;&#24120;&#20351;&#29992;&#30340;&#20195;&#38469;&#25345;&#20037;&#31995;&#25968;&#30456;&#27604;&#65292;&#26032;&#30340;&#34913;&#37327;&#26041;&#24335;&#26356;&#36866;&#21512;&#25511;&#21046;&#20010;&#20154;&#21644;&#29238;&#27597;&#29305;&#24449;&#20998;&#24067;&#30340;&#21464;&#21270;&#12290;&#26412;&#25991;&#23454;&#35777;&#20998;&#26512;&#32654;&#22269;&#20154;&#21475;&#26222;&#26597;&#25968;&#25454;&#34920;&#26126;&#65292;&#20805;&#20998;&#25511;&#21046;&#29305;&#24449;&#20998;&#24067;&#30340;&#21464;&#21270;&#23545;&#20110;&#35780;&#20272;&#20195;&#38469;&#27969;&#21160;&#20013;&#19981;&#26159;&#30001;&#25945;&#32946;&#25193;&#24352;&#24341;&#36215;&#30340;&#37096;&#20998;&#33267;&#20851;&#37325;&#35201;&#12290;&#21542;&#21017;&#65292;&#21508;&#31181;&#26088;&#22312;&#20943;&#23569;&#39640;&#20013;&#27605;&#19994;&#29575;&#21644;&#22823;&#23398;&#23398;&#20301;&#36951;&#20256;&#24615;&#30340;&#25919;&#31574;&#30340;&#30456;&#23545;&#20248;&#20808;&#32423;&#21487;&#33021;&#20250;&#34987;&#39072;&#20498;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper proposes a new measure of relative intergenerational mobility along the educational trait as a proxy of inequality of opportunity. The new measure is more suitable for controlling for the variations in the trait distributions of individuals and their parents than the commonly used intergenerational persistence coefficient. This point is illustrated by our empirical analysis of US census data from the period between 1960 and 2015: we show that controlling for the variations in the trait distributions adequately is vital in assessing the part of intergenerational mobility which is not caused by the educational expansion. Failing to do so can potentially reverse the relative priority of various policies aiming at reducing the "heritability" of high school degrees and tertiary education diplomas.
&lt;/p&gt;</description></item><item><title>&#20351;&#29992;&#19968;&#31181;&#37096;&#20998;&#25490;&#24207;&#26041;&#27861;&#26469;&#24320;&#21457;&#38543;&#26426;&#29702;&#24615;&#30340;&#24230;&#37327;&#65292;&#24182;&#24341;&#20837;&#20102;&#19968;&#20010;&#38543;&#26426;&#29702;&#24615;&#25351;&#25968;&#12290;&#35813;&#25490;&#24207;&#26816;&#27979;&#36829;&#21453;&#65288;&#38543;&#26426;&#65289;&#20256;&#36882;&#24615;&#20197;&#21450;&#36873;&#25321;&#23884;&#22871;&#33756;&#21333;&#20043;&#38388;&#30340;&#19981;&#19968;&#33268;&#24615;&#12290;</title><link>http://arxiv.org/abs/2303.08202</link><description>&lt;p&gt;
&#27979;&#37327;&#38543;&#26426;&#29702;&#24615;
&lt;/p&gt;
&lt;p&gt;
Measuring Stochastic Rationality. (arXiv:2303.08202v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.08202
&lt;/p&gt;
&lt;p&gt;
&#20351;&#29992;&#19968;&#31181;&#37096;&#20998;&#25490;&#24207;&#26041;&#27861;&#26469;&#24320;&#21457;&#38543;&#26426;&#29702;&#24615;&#30340;&#24230;&#37327;&#65292;&#24182;&#24341;&#20837;&#20102;&#19968;&#20010;&#38543;&#26426;&#29702;&#24615;&#25351;&#25968;&#12290;&#35813;&#25490;&#24207;&#26816;&#27979;&#36829;&#21453;&#65288;&#38543;&#26426;&#65289;&#20256;&#36882;&#24615;&#20197;&#21450;&#36873;&#25321;&#23884;&#22871;&#33756;&#21333;&#20043;&#38388;&#30340;&#19981;&#19968;&#33268;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#36890;&#36807;&#20026;&#20219;&#24847;&#38543;&#26426;&#36873;&#25321;&#20989;&#25968;&#20998;&#37197;&#19968;&#20010;&#19968;&#21442;&#25968;&#31867;&#30340;&#30830;&#23450;&#24615;&#36873;&#25321;&#23545;&#24212;&#26469;&#24320;&#21457;&#19968;&#31181;&#37096;&#20998;&#25490;&#24207;&#26041;&#27861;&#65292;&#20174;&#32780;&#27604;&#36739;&#23427;&#20204;&#30340;&#29702;&#24615;&#22522;&#30784;&#12290;&#28982;&#21518;&#26816;&#26597;&#36825;&#20123;&#23545;&#24212;&#22312;&#27599;&#20010;&#21442;&#25968;&#20540;&#30340;&#29702;&#24615;&#24615;&#65288;&#25353;&#29031;&#26174;&#38706;&#39318;&#36873;&#20043;&#26631;&#20934;&#65289;&#12290;&#31867;&#20284;&#20110;&#30830;&#23450;&#24615;&#29702;&#24615;&#30340;&#32463;&#20856;&#27010;&#24565;&#65292;&#25105;&#20204;&#30340;&#29702;&#24615;&#25490;&#24207;&#19981;&#20165;&#26816;&#27979;&#36829;&#21453;&#65288;&#38543;&#26426;&#65289;&#20256;&#36882;&#24615;&#65292;&#36824;&#26816;&#27979;&#23884;&#22871;&#33756;&#21333;&#20013;&#36873;&#25321;&#20043;&#38388;&#30340;&#19981;&#19968;&#33268;&#24615;&#12290;&#25105;&#20204;&#33719;&#24471;&#20102;&#19968;&#31181;&#26131;&#20110;&#20351;&#29992;&#30340;&#25490;&#24207;&#29305;&#24449;&#25551;&#36848;&#65292;&#28982;&#21518;&#20351;&#29992;&#36825;&#31181;&#29305;&#24449;&#25551;&#36848;&#24341;&#20837;&#20102;&#19968;&#20010;&#38543;&#26426;&#29702;&#24615;&#25351;&#25968;&#12290;&#25105;&#20204;&#23558;&#25105;&#20204;&#30340;&#25490;&#24207;&#21644;&#25351;&#25968;&#24212;&#29992;&#20110;&#19968;&#20123;&#33879;&#21517;&#30340;&#38543;&#26426;&#36873;&#25321;&#27169;&#22411;&#65292;&#24182;&#20351;&#29992;&#38463;&#33707;&#26031;&#183;&#29305;&#27779;&#26031;&#22522;&#30340;&#19968;&#39033;&#33879;&#21517;&#23454;&#39564;&#36827;&#34892;&#20102;&#23454;&#35777;&#24212;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;
We develop a partial ordering approach toward comparing stochastic choice functions on the basis of their rationality. We do this by assigning to any stochastic choice function a one-parameter class of deterministic choice correspondences, and then checking for the rationality (in the standard sense of revealed preference) of these correspondences for each parameter value. Similar to the classical notion of deterministic rationality, our rationality ordering detects violations of (stochastic) transitivity as well as inconsistencies between choices from nested menus. We obtain an easy-to-use characterization of this ordering, and then use that characterization to introduce an index of stochastic rationality. We apply our ordering and index to some well-known stochastic choice models and provide an empirical application using a famous experiment by Amos Tversky.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#31616;&#32422;&#24066;&#22330;&#35774;&#35745;&#30340;&#26041;&#27861;&#65292;&#20197;&#26368;&#23567;&#30340;&#24178;&#39044;&#26469;&#22686;&#24378;&#22522;&#20110;&#21033;&#30410;&#30456;&#20851;&#32773;&#30340;&#26426;&#26500;&#12290;&#36890;&#36807;&#23558;&#20891;&#38431;&#30340;&#26399;&#26395;&#20316;&#20026;&#20005;&#26684;&#30340;&#20844;&#29702;&#65292;&#25105;&#20204;&#20998;&#26512;&#20102;&#23427;&#20204;&#30340;&#24433;&#21709;&#12290;&#22312;&#25105;&#20204;&#30340;&#31616;&#32422;&#26426;&#26500;&#37325;&#26500;&#26041;&#27861;&#19979;&#65292;&#20891;&#38431;&#30340;&#30446;&#26631;&#21807;&#19968;&#30830;&#23450;&#20102;&#19968;&#20010;&#20998;&#25903;&#26426;&#21046;&#12290;&#25105;&#20204;&#30340;&#35774;&#35745;&#29616;&#22312;&#24050;&#22312;&#32654;&#22269;&#38470;&#20891;&#23558;&#20891;&#23398;&#38498;&#21644;ROTC&#20013;&#37319;&#29992;&#12290;</title><link>http://arxiv.org/abs/2303.06564</link><description>&lt;p&gt;
&#31616;&#32422;&#24066;&#22330;&#35774;&#35745;&#19979;&#30340;&#32654;&#22269;&#38470;&#20891;&#20998;&#25903;&#36827;&#31243;&#37325;&#26500;&#65306;&#19968;&#20010;&#26696;&#20363;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Redesigning the US Army's Branching Progress: A Case Study in Minimalist Market Design. (arXiv:2303.06564v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.06564
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#31616;&#32422;&#24066;&#22330;&#35774;&#35745;&#30340;&#26041;&#27861;&#65292;&#20197;&#26368;&#23567;&#30340;&#24178;&#39044;&#26469;&#22686;&#24378;&#22522;&#20110;&#21033;&#30410;&#30456;&#20851;&#32773;&#30340;&#26426;&#26500;&#12290;&#36890;&#36807;&#23558;&#20891;&#38431;&#30340;&#26399;&#26395;&#20316;&#20026;&#20005;&#26684;&#30340;&#20844;&#29702;&#65292;&#25105;&#20204;&#20998;&#26512;&#20102;&#23427;&#20204;&#30340;&#24433;&#21709;&#12290;&#22312;&#25105;&#20204;&#30340;&#31616;&#32422;&#26426;&#26500;&#37325;&#26500;&#26041;&#27861;&#19979;&#65292;&#20891;&#38431;&#30340;&#30446;&#26631;&#21807;&#19968;&#30830;&#23450;&#20102;&#19968;&#20010;&#20998;&#25903;&#26426;&#21046;&#12290;&#25105;&#20204;&#30340;&#35774;&#35745;&#29616;&#22312;&#24050;&#22312;&#32654;&#22269;&#38470;&#20891;&#23558;&#20891;&#23398;&#38498;&#21644;ROTC&#20013;&#37319;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper proposes a minimalist market design approach to enhance institutions based on stakeholders' desiderata with minimal interference. By formulating the Army's desiderata as rigorous axioms, the paper analyzes their implications and uniquely identifies a branching mechanism under the minimalist approach to institution redesign. The design is now adopted at USMA and ROTC.
&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#31616;&#32422;&#24066;&#22330;&#35774;&#35745;&#65288;S&#246;nmez&#65292;2023&#65289;&#20316;&#20026;&#19968;&#31181;&#26377;&#25928;&#30340;&#26041;&#27861;&#65292;&#20197;&#26368;&#23567;&#30340;&#24178;&#39044;&#26469;&#22686;&#24378;&#22522;&#20110;&#21033;&#30410;&#30456;&#20851;&#32773;&#30340;&#26426;&#26500;&#12290;&#33258;2006&#24180;&#20197;&#26469;&#65292;&#32654;&#22269;&#38470;&#20891;&#23558;&#20891;&#23398;&#38498;&#30340;&#20013;&#22830;&#20998;&#25903;&#36807;&#31243;&#36827;&#34892;&#20102;&#22235;&#39033;&#30446;&#26631;&#65306;&#23562;&#37325;&#21151;&#32489;&#65292;&#22686;&#21152;&#20445;&#30041;&#65292;&#35843;&#25972;&#20154;&#25165;&#21644;&#22686;&#24378;&#20449;&#20219;&#12290;&#32654;&#22269;&#38470;&#20891;2020&#24180;&#32423;&#30340;&#26426;&#21046;&#21152;&#21095;&#20102;&#23454;&#29616;&#36825;&#20123;&#30446;&#26631;&#30340;&#25361;&#25112;&#12290;&#36890;&#36807;&#23558;&#20891;&#38431;&#30340;&#26399;&#26395;&#20316;&#20026;&#20005;&#26684;&#30340;&#20844;&#29702;&#65292;&#25105;&#20204;&#20998;&#26512;&#20102;&#23427;&#20204;&#30340;&#24433;&#21709;&#12290;&#22312;&#25105;&#20204;&#30340;&#31616;&#32422;&#26426;&#26500;&#37325;&#26500;&#26041;&#27861;&#19979;&#65292;&#20891;&#38431;&#30340;&#30446;&#26631;&#21807;&#19968;&#30830;&#23450;&#20102;&#19968;&#20010;&#20998;&#25903;&#26426;&#21046;&#12290;&#25105;&#20204;&#30340;&#35774;&#35745;&#29616;&#22312;&#24050;&#22312;&#32654;&#22269;&#38470;&#20891;&#23558;&#20891;&#23398;&#38498;&#21644;ROTC&#20013;&#37319;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;
We present the proof-of-concept for minimalist market design (S\"{o}nmez, 2023) as an effective methodology to enhance an institution based on the desiderata of stakeholders with minimal interference. Four objectives-respecting merit, increasing retention, aligning talent, and enhancing trust-guided reforms to US Army's centralized branching process of cadets to military specialties since 2006. USMA's mechanism for the Class of 2020 exacerbated challenges implementing these objectives. Formulating the Army's desiderata as rigorous axioms, we analyze their implications. Under our minimalist approach to institution redesign, the Army's objectives uniquely identify a branching mechanism. Our design is now adopted at USMA and ROTC.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#38543;&#26426;&#25928;&#29992;&#27169;&#22411;&#21644;&#37325;&#22797;&#36873;&#25321;&#27169;&#22411;&#20013;&#30340;&#28040;&#36153;&#20381;&#36182;&#24615;&#65292;&#25552;&#20986;&#20102;&#20004;&#31181;&#31526;&#21512;&#38543;&#26426;&#25928;&#29992;&#30340;&#39532;&#23572;&#31185;&#22827;&#28040;&#36153;&#20381;&#36182;&#24615;&#29305;&#24449;&#65292;&#24182;&#23545;&#20004;&#26399;&#38543;&#26426;&#36873;&#25321;&#27169;&#22411;&#20013;&#30340;&#28040;&#36153;&#20381;&#36182;&#24615;&#36827;&#34892;&#20102;&#34892;&#20026;&#20869;&#23481;&#30340;&#29305;&#24449;&#21270;&#12290;</title><link>http://arxiv.org/abs/2302.05806</link><description>&lt;p&gt;
&#38543;&#26426;&#25928;&#29992;&#12289;&#37325;&#22797;&#36873;&#25321;&#21644;&#28040;&#36153;&#20381;&#36182;&#24615;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Random Utility, Repeated Choice, and Consumption Dependence. (arXiv:2302.05806v3 [econ.TH] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2302.05806
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#38543;&#26426;&#25928;&#29992;&#27169;&#22411;&#21644;&#37325;&#22797;&#36873;&#25321;&#27169;&#22411;&#20013;&#30340;&#28040;&#36153;&#20381;&#36182;&#24615;&#65292;&#25552;&#20986;&#20102;&#20004;&#31181;&#31526;&#21512;&#38543;&#26426;&#25928;&#29992;&#30340;&#39532;&#23572;&#31185;&#22827;&#28040;&#36153;&#20381;&#36182;&#24615;&#29305;&#24449;&#65292;&#24182;&#23545;&#20004;&#26399;&#38543;&#26426;&#36873;&#25321;&#27169;&#22411;&#20013;&#30340;&#28040;&#36153;&#20381;&#36182;&#24615;&#36827;&#34892;&#20102;&#34892;&#20026;&#20869;&#23481;&#30340;&#29305;&#24449;&#21270;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;&#38543;&#26426;&#36873;&#25321;&#30340;&#37325;&#22797;&#36873;&#25321;&#35299;&#37322;&#21644;&#38543;&#26426;&#25928;&#29992;&#27169;&#22411;&#30340;&#20010;&#20307;&#35299;&#37322;&#12290;&#25105;&#20204;&#32771;&#34385;&#20102;&#19968;&#20010;&#30446;&#20809;&#30701;&#27973;&#30340;&#20195;&#29702;&#20154;&#65292;&#20182;&#20204;&#26126;&#22825;&#30340;&#20559;&#22909;&#20998;&#24067;&#21487;&#33021;&#21462;&#20915;&#20110;&#20170;&#22825;&#30340;&#28040;&#36153;&#21644;&#20559;&#22909;&#12290;&#21363;&#20351;&#20195;&#29702;&#20154;&#22312;&#27599;&#20010;&#38745;&#24577;&#20915;&#31574;&#20013;&#37117;&#26159;&#32463;&#20856;&#30340;&#29702;&#24615;&#65292;&#20063;&#23384;&#22312;&#19968;&#20123;&#19982;&#38543;&#26426;&#25928;&#29992;&#20316;&#20026;&#36328;&#26102;&#38388;&#32858;&#21512;&#27169;&#22411;&#19981;&#19968;&#33268;&#30340;&#28040;&#36153;&#20381;&#36182;&#24418;&#24335;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#20004;&#20010;&#39532;&#23572;&#31185;&#22827;&#28040;&#36153;&#20381;&#36182;&#24615;&#30340;&#29305;&#24449;&#65292;&#36825;&#20123;&#29305;&#24449;&#19982;&#38543;&#26426;&#25928;&#29992;&#26159;&#19968;&#33268;&#30340;&#12290;&#36827;&#19968;&#27493;&#22320;&#65292;&#25105;&#20204;&#23545;&#20004;&#26399;&#38543;&#26426;&#36873;&#25321;&#27169;&#22411;&#20013;&#30340;&#28040;&#36153;&#20381;&#36182;&#24615;&#36827;&#34892;&#20102;&#34892;&#20026;&#20869;&#23481;&#30340;&#29305;&#24449;&#21270;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study the repeated choice interpretation of stochastic choice and the individual interpretation of the random utility model. We consider a myopic agent whose distribution over preferences tomorrow potentially depends on their consumption and preference today. Even when the agent is classically rational in each of their static decisions, there are forms of consumption dependence which are inconsistent with random utility as a model of intertemporal aggregation. We offer two characterizations of Markovian consumption dependence which are consistent with random utility. Further, we characterize the behavioral content of consumption dependence in a two period stochastic choice model.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#28151;&#21512;&#22240;&#23376;&#27169;&#22411;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#24314;&#27169;&#22522;&#20998;&#20301;&#20989;&#25968;&#30340;&#28151;&#21512;&#26469;&#20272;&#35745;&#21709;&#24212;&#21464;&#37327;&#20998;&#24067;&#65292;&#24182;&#36890;&#36807;&#20984;&#20248;&#21270;&#38382;&#39064;&#36827;&#34892;&#26657;&#20934;&#65292;&#21516;&#26102;&#36991;&#20813;&#20998;&#20301;&#20132;&#21449;&#12290;&#27492;&#22806;&#65292;&#20316;&#32773;&#36824;&#25552;&#20986;&#20102;&#19968;&#31181;&#38477;&#32500;&#26041;&#27861;&#21644;&#20132;&#26367;&#20272;&#35745;&#31639;&#27861;&#65292;&#24182;&#23558;&#35813;&#26041;&#27861;&#25512;&#24191;&#21040;&#26465;&#20214;&#28151;&#21512;&#22240;&#23376;&#27169;&#22411;&#12290;</title><link>http://arxiv.org/abs/2301.13843</link><description>&lt;p&gt;
&#28151;&#21512;&#22240;&#23376;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
Factor Model of Mixtures. (arXiv:2301.13843v2 [stat.ME] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2301.13843
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#28151;&#21512;&#22240;&#23376;&#27169;&#22411;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#24314;&#27169;&#22522;&#20998;&#20301;&#20989;&#25968;&#30340;&#28151;&#21512;&#26469;&#20272;&#35745;&#21709;&#24212;&#21464;&#37327;&#20998;&#24067;&#65292;&#24182;&#36890;&#36807;&#20984;&#20248;&#21270;&#38382;&#39064;&#36827;&#34892;&#26657;&#20934;&#65292;&#21516;&#26102;&#36991;&#20813;&#20998;&#20301;&#20132;&#21449;&#12290;&#27492;&#22806;&#65292;&#20316;&#32773;&#36824;&#25552;&#20986;&#20102;&#19968;&#31181;&#38477;&#32500;&#26041;&#27861;&#21644;&#20132;&#26367;&#20272;&#35745;&#31639;&#27861;&#65292;&#24182;&#23558;&#35813;&#26041;&#27861;&#25512;&#24191;&#21040;&#26465;&#20214;&#28151;&#21512;&#22240;&#23376;&#27169;&#22411;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#20272;&#35745;&#21709;&#24212;&#21464;&#37327;&#20998;&#24067;&#30340;&#26032;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#32771;&#34385;&#20102;&#35266;&#27979;&#21040;&#30340;&#26576;&#20123;&#22240;&#32032;&#12290;&#35813;&#26041;&#27861;&#20855;&#26377;&#28789;&#27963;&#24615;&#12289;&#21487;&#35299;&#37322;&#24615;&#12289;&#26131;&#22788;&#29702;&#24615;&#21644;&#21487;&#25193;&#23637;&#24615;&#12290;&#26465;&#20214;&#20998;&#20301;&#20989;&#25968;&#30001;&#19968;&#32452;&#22522;&#20998;&#20301;&#20989;&#25968;&#30340;&#28151;&#21512;&#65288;&#21152;&#26435;&#21644;&#65289;&#24314;&#27169;&#65292;&#20854;&#20013;&#26435;&#37325;&#21462;&#20915;&#20110;&#22240;&#23376;&#12290;&#26657;&#20934;&#38382;&#39064;&#34987;&#21046;&#23450;&#20026;&#19968;&#20010;&#20984;&#20248;&#21270;&#38382;&#39064;&#12290;&#23427;&#21487;&#20197;&#34987;&#35270;&#20026;&#21516;&#26102;&#23545;&#25152;&#26377;&#32622;&#20449;&#27700;&#24179;&#36827;&#34892;&#20998;&#20301;&#22238;&#24402;&#32780;&#36991;&#20813;&#20998;&#20301;&#20132;&#21449;&#30340;&#23450;&#20041;&#12290;&#26657;&#20934;&#38382;&#39064;&#31561;&#20215;&#20110;&#26368;&#23567;&#21270;&#36830;&#32493;&#25490;&#21517;&#27010;&#29575;&#20998;&#25968;&#65288;CRPS&#65289;&#12290;&#22522;&#20110;&#24352;&#37327;&#30340;&#35268;&#33539;&#22810;&#39033;&#20998;&#35299;&#65288;CP&#65289;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#38477;&#32500;&#26041;&#27861;&#26469;&#38477;&#20302;&#21442;&#25968;&#24352;&#37327;&#30340;&#31209;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#20010;&#20132;&#26367;&#20272;&#35745;&#31639;&#27861;&#12290;&#27492;&#22806;&#65292;&#22522;&#20110;&#39118;&#38505;&#22235;&#36793;&#24418;&#26694;&#26550;&#65292;&#25105;&#20204;&#23558;&#35813;&#26041;&#27861;&#25512;&#24191;&#21040;&#26465;&#20214;&#28151;&#21512;&#22240;&#23376;&#27169;&#22411;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper proposes a new approach to estimating the distribution of a response variable conditioned on observing some factors. The proposed approach possesses desirable properties of flexibility, interpretability, tractability and extendability. The conditional quantile function is modeled by a mixture (weighted sum) of basis quantile functions, with the weights depending on factors. The calibration problem is formulated as a convex optimization problem. It can be viewed as conducting quantile regressions for all confidence levels simultaneously while avoiding quantile crossing by definition. The calibration problem is equivalent to minimizing the continuous ranked probability score (CRPS). Based on the canonical polyadic (CP) decomposition of tensors, we propose a dimensionality reduction method that reduces the rank of the parameter tensor and propose an alternating algorithm for estimation. Additionally, based on Risk Quadrangle framework, we generalize the approach to conditional 
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#33258;&#21160;&#20986;&#20215;&#19990;&#30028;&#20013;&#30340;&#26080;&#25215;&#35834;&#25293;&#21334;&#65292;&#36890;&#36807;&#32771;&#34385;&#25215;&#35834;&#30340;&#27010;&#24565;&#65292;&#21512;&#29702;&#22320;&#37319;&#29992;&#20102;&#30475;&#20284;&#27425;&#20248;&#30340;&#25237;&#26631;&#26041;&#24335;&#12290;</title><link>http://arxiv.org/abs/2301.07312</link><description>&lt;p&gt;
&#33258;&#21160;&#20986;&#20215;&#19990;&#30028;&#20013;&#30340;&#26080;&#25215;&#35834;&#25293;&#21334;
&lt;/p&gt;
&lt;p&gt;
Auctions without commitment in the auto-bidding world. (arXiv:2301.07312v2 [econ.TH] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2301.07312
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#33258;&#21160;&#20986;&#20215;&#19990;&#30028;&#20013;&#30340;&#26080;&#25215;&#35834;&#25293;&#21334;&#65292;&#36890;&#36807;&#32771;&#34385;&#25215;&#35834;&#30340;&#27010;&#24565;&#65292;&#21512;&#29702;&#22320;&#37319;&#29992;&#20102;&#30475;&#20284;&#27425;&#20248;&#30340;&#25237;&#26631;&#26041;&#24335;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#22312;&#32447;&#24191;&#21578;&#25293;&#21334;&#20013;&#65292;&#24191;&#21578;&#20027;&#36234;&#26469;&#36234;&#22810;&#22320;&#20351;&#29992;&#33258;&#21160;&#31454;&#26631;&#26426;&#21046;&#26469;&#25237;&#26631;&#65292;&#32780;&#19981;&#26159;&#25163;&#21160;&#31454;&#26631;&#20854;&#20215;&#20540;&#12290;&#20854;&#20013;&#19968;&#20010;&#37325;&#35201;&#30340;&#33258;&#21160;&#20986;&#20215;&#26684;&#24335;&#26159;&#30446;&#26631;&#27599;&#39033;&#25104;&#26412;&#65288;tCPA&#65289;&#65292;&#23427;&#22312;&#25237;&#36164;&#22238;&#25253;&#32422;&#26463;&#26465;&#20214;&#19979;&#26368;&#22823;&#21270;&#36716;&#21270;&#37327;&#12290;&#28982;&#32780;&#65292;&#20174;&#25293;&#21334;&#29702;&#35770;&#30340;&#35282;&#24230;&#26469;&#30475;&#65292;&#36825;&#31181;&#36235;&#21183;&#20284;&#20046;&#36829;&#21453;&#20102;&#22522;&#26412;&#30340;&#32467;&#26524;&#65292;&#21363;&#23545;&#20110;&#21033;&#28070;&#26368;&#22823;&#21270;&#30340;&#25237;&#26631;&#32773;&#26469;&#35828;&#65292;&#20351;&#29992;&#32463;&#20856;&#30340;&#36793;&#38469;&#25104;&#26412;&#65288;mCPA&#65289;&#25237;&#26631;&#31995;&#32479;&#27604;&#20351;&#29992;tCPA&#31561;&#31574;&#30053;&#26356;&#20248;&#12290;&#26412;&#25991;&#22312;&#32463;&#20856;&#30340;&#20934;&#32447;&#24615;&#26694;&#26550;&#20869;&#21512;&#29702;&#22320;&#37319;&#29992;&#20102;&#36825;&#31181;&#30475;&#20284;&#27425;&#20248;&#30340;&#25237;&#26631;&#26041;&#24335;&#12290;&#35770;&#25991;&#30340;&#26680;&#24515;&#22312;&#20110;&#25215;&#35834;&#30340;&#27010;&#24565;&#12290;&#25105;&#20204;&#32771;&#34385;&#19968;&#20010;&#22810;&#38454;&#27573;&#21338;&#24328;&#65292;&#22312;&#36825;&#20010;&#21338;&#24328;&#20013;&#65292;&#39318;&#20808;&#25293;&#21334;&#20154;&#23459;&#24067;&#25293;&#21334;&#35268;&#21017;&#65307;&#28982;&#21518;&#25237;&#26631;&#20154;&#36873;&#25321;tCPA&#25110;mCPA&#20986;&#20215;&#26684;&#24335;&#65292;&#28982;&#21518;&#65292;&#22914;&#26524;&#25293;&#21334;&#20154;&#27809;&#26377;&#25215;&#35834;&#65292;&#23427;&#21487;&#20197;&#37325;&#26032;&#23457;&#35270;&#25293;&#21334;&#35268;&#21017;&#12290;
&lt;/p&gt;
&lt;p&gt;
Advertisers in online ad auctions are increasingly using auto-bidding mechanisms to bid into auctions instead of directly bidding their value manually. One prominent auto-bidding format is the target cost-per-acquisition (tCPA) which maximizes the volume of conversions subject to a return-of-investment constraint. From an auction theoretic perspective however, this trend seems to go against foundational results that postulate that for profit-maximizing bidders, it is optimal to use a classic bidding system like marginal CPA (mCPA) bidding rather than using strategies like tCPA.  In this paper we rationalize the adoption of such seemingly sub-optimal bidding within the canonical quasi-linear framework. The crux of the argument lies in the notion of commitment. We consider a multi-stage game where first the auctioneer declares the auction rules; then bidders select either the tCPA or mCPA bidding format and then, if the auctioneer lacks commitment, it can revisit the rules of the auction
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#24314;&#31435;&#20102;&#19968;&#20010;&#23450;&#37327;&#19968;&#33324;&#22343;&#34913;&#27169;&#22411;&#65292;&#30740;&#31350;&#21033;&#28070;&#36716;&#31227;&#25705;&#25830;&#23545;&#36328;&#22269;&#29983;&#20135;&#30340;&#24433;&#21709;&#65292;&#25552;&#20986;&#19968;&#31181;&#26032;&#30340;&#26657;&#20934;&#26041;&#27861;&#65292;&#24182;&#27169;&#25311;&#20102;&#31246;&#25910;&#25913;&#38761;&#30340;&#24433;&#21709;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;&#20844;&#21496;&#22269;&#38469;&#36716;&#31227;&#23545;&#22810;&#20010;&#22269;&#23478;&#30340;&#24433;&#21709;&#19982;&#21487;&#32435;&#31246;&#25910;&#20837;&#30340;&#30452;&#25509;&#22686;&#30410;&#30456;&#24403;&#12290;</title><link>http://arxiv.org/abs/2211.04388</link><description>&lt;p&gt;
&#21033;&#28070;&#36716;&#31227;&#25705;&#25830;&#19982;&#36328;&#22269;&#32463;&#33829;&#30340;&#22320;&#29702;&#20301;&#32622;
&lt;/p&gt;
&lt;p&gt;
Profit Shifting Frictions and the Geography of Multinational Activity. (arXiv:2211.04388v2 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2211.04388
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#24314;&#31435;&#20102;&#19968;&#20010;&#23450;&#37327;&#19968;&#33324;&#22343;&#34913;&#27169;&#22411;&#65292;&#30740;&#31350;&#21033;&#28070;&#36716;&#31227;&#25705;&#25830;&#23545;&#36328;&#22269;&#29983;&#20135;&#30340;&#24433;&#21709;&#65292;&#25552;&#20986;&#19968;&#31181;&#26032;&#30340;&#26657;&#20934;&#26041;&#27861;&#65292;&#24182;&#27169;&#25311;&#20102;&#31246;&#25910;&#25913;&#38761;&#30340;&#24433;&#21709;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;&#20844;&#21496;&#22269;&#38469;&#36716;&#31227;&#23545;&#22810;&#20010;&#22269;&#23478;&#30340;&#24433;&#21709;&#19982;&#21487;&#32435;&#31246;&#25910;&#20837;&#30340;&#30452;&#25509;&#22686;&#30410;&#30456;&#24403;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#24314;&#31435;&#20102;&#19968;&#20010;&#23884;&#20837;&#20225;&#19994;&#31246;&#25910;&#21644;&#21033;&#28070;&#36716;&#31227;&#30340;&#23450;&#37327;&#19968;&#33324;&#22343;&#34913;&#27169;&#22411;&#65292;&#30740;&#31350;&#20102;&#36328;&#22269;&#32463;&#33829;&#12290;&#38500;&#20102;&#36152;&#26131;&#21644;&#25237;&#36164;&#25705;&#25830;&#22806;&#65292;&#25105;&#20204;&#30340;&#27169;&#22411;&#34920;&#26126;&#21033;&#28070;&#36716;&#31227;&#25705;&#25830;&#24418;&#25104;&#20102;&#36328;&#22269;&#29983;&#20135;&#30340;&#22320;&#29702;&#20301;&#32622;&#12290;&#25105;&#20204;&#27169;&#22411;&#30340;&#20851;&#38190;&#22312;&#20110;&#21306;&#20998;&#23454;&#38469;&#27963;&#21160;&#21644;&#21033;&#28070;&#36716;&#31227;&#30340;&#20225;&#19994;&#31246;&#25910;&#24377;&#24615;&#12290;&#25105;&#20204;&#37327;&#21270;&#27169;&#22411;&#38656;&#35201;&#20272;&#31639;&#36716;&#31227;&#21033;&#28070;&#27969;&#37327;&#30340;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#19968;&#31181;&#26032;&#30340;&#12289;&#19982;&#27169;&#22411;&#19968;&#33268;&#30340;&#26041;&#27861;&#65292;&#26681;&#25454;&#20250;&#35745;&#24658;&#31561;&#24335;&#26469;&#26657;&#20934;&#21452;&#36793;&#21033;&#28070;&#36716;&#31227;&#25705;&#25830;&#12290;&#25105;&#20204;&#27169;&#25311;&#20102;&#21508;&#31181;&#26088;&#22312;&#36943;&#21046;&#36328;&#22269;&#20844;&#21496;&#36867;&#31246;&#34892;&#20026;&#30340;&#31246;&#25910;&#25913;&#38761;&#65292;&#20197;&#21450;&#23427;&#20204;&#23545;&#19968;&#31995;&#21015;&#32467;&#26524;&#30340;&#24433;&#21709;&#65292;&#21253;&#25324;&#31246;&#25910;&#25910;&#20837;&#21644;&#29983;&#20135;&#12290;&#25105;&#20204;&#30340;&#32467;&#26524;&#34920;&#26126;&#65292;&#20844;&#21496;&#22269;&#38469;&#36716;&#31227;&#23545;&#22810;&#20010;&#22269;&#23478;&#30340;&#24433;&#21709;&#19982;&#21487;&#32435;&#31246;&#25910;&#20837;&#30340;&#30452;&#25509;&#22686;&#30410;&#30456;&#24403;&#12290;
&lt;/p&gt;
&lt;p&gt;
We develop a quantitative general equilibrium model of multinational activity embedding corporate taxation and profit shifting. In addition to trade and investment frictions, our model shows that profit-shifting frictions shape the geography of multinational production. Key to our model is the distinction between the corporate tax elasticity of real activity and profit shifting. The quantification of our model requires estimates of shifted profits flows. We provide a new, model-consistent methodology to calibrate bilateral profit-shifting frictions based on accounting identities. We simulate various tax reforms aimed at curbing tax-dodging practices of multinationals and their impact on a range of outcomes, including tax revenues and production. Our results show that the effects of the international relocation of firms across countries are of comparable magnitude as the direct gains in taxable income.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21033;&#29992;&#26368;&#23567;&#20108;&#20056;&#25552;&#21319;&#27861;&#35745;&#31639;&#32447;&#24615;&#27169;&#22411;&#20013;&#27599;&#20010;&#36873;&#23450;&#21442;&#25968;&#30340;p-&#20540;&#30340;&#26041;&#27861;&#65292;&#36825;&#20123;p-&#20540;&#26159;&#36866;&#24212;&#20110;&#25552;&#21319;&#36807;&#31243;&#30340;&#36845;&#20195;&#24615;&#36136;&#65292;&#24182;&#19988;&#22312;&#27169;&#25311;&#21644;&#23454;&#38469;&#24212;&#29992;&#20013;&#37117;&#34920;&#29616;&#20986;&#33391;&#22909;&#30340;&#24615;&#33021;&#65292;&#25511;&#21046;&#20102;&#35823;&#25253;&#29575;&#65292;&#24182;&#36873;&#25321;&#20855;&#26377;&#33391;&#22909;&#39044;&#27979;&#24615;&#33021;&#30340;&#26356;&#31232;&#30095;&#30340;&#27169;&#22411;&#12290;</title><link>http://arxiv.org/abs/2211.02215</link><description>&lt;p&gt;
&#39640;&#32500;&#21521;&#37327;&#33258;&#22238;&#24402;&#27169;&#22411;&#20013;&#30340;&#25552;&#21319;p-&#20540;
&lt;/p&gt;
&lt;p&gt;
Boosted p-Values for High-Dimensional Vector Autoregression. (arXiv:2211.02215v2 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2211.02215
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21033;&#29992;&#26368;&#23567;&#20108;&#20056;&#25552;&#21319;&#27861;&#35745;&#31639;&#32447;&#24615;&#27169;&#22411;&#20013;&#27599;&#20010;&#36873;&#23450;&#21442;&#25968;&#30340;p-&#20540;&#30340;&#26041;&#27861;&#65292;&#36825;&#20123;p-&#20540;&#26159;&#36866;&#24212;&#20110;&#25552;&#21319;&#36807;&#31243;&#30340;&#36845;&#20195;&#24615;&#36136;&#65292;&#24182;&#19988;&#22312;&#27169;&#25311;&#21644;&#23454;&#38469;&#24212;&#29992;&#20013;&#37117;&#34920;&#29616;&#20986;&#33391;&#22909;&#30340;&#24615;&#33021;&#65292;&#25511;&#21046;&#20102;&#35823;&#25253;&#29575;&#65292;&#24182;&#36873;&#25321;&#20855;&#26377;&#33391;&#22909;&#39044;&#27979;&#24615;&#33021;&#30340;&#26356;&#31232;&#30095;&#30340;&#27169;&#22411;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#39640;&#32500;&#21521;&#37327;&#33258;&#22238;&#24402;&#24314;&#27169;&#20013;&#65292;&#35780;&#20272;&#21442;&#25968;&#20272;&#35745;&#30340;&#32479;&#35745;&#26174;&#33879;&#24615;&#26159;&#19968;&#20010;&#37325;&#35201;&#30340;&#27493;&#39588;&#12290;&#20351;&#29992;&#26368;&#23567;&#20108;&#20056;&#25552;&#21319;&#27861;&#65292;&#25105;&#20204;&#22312;&#32447;&#24615;&#27169;&#22411;&#30340;&#27599;&#20010;&#25552;&#21319;&#27493;&#39588;&#20013;&#35745;&#31639;&#27599;&#20010;&#36873;&#23450;&#21442;&#25968;&#30340;p-&#20540;&#12290;&#36825;&#20123;p-&#20540;&#26159;&#28176;&#36817;&#26377;&#25928;&#30340;&#65292;&#20063;&#36866;&#24212;&#20110;&#25552;&#21319;&#36807;&#31243;&#30340;&#36845;&#20195;&#24615;&#36136;&#12290;&#25105;&#20204;&#30340;&#27169;&#25311;&#23454;&#39564;&#34920;&#26126;&#65292;&#22312;&#39640;&#32500;&#21521;&#37327;&#33258;&#22238;&#24402;&#20013;&#65292;&#36825;&#20123;p-&#20540;&#21487;&#20197;&#25511;&#21046;&#35823;&#25253;&#29575;&#12290;&#22312;&#36229;&#36807;100&#20010;&#23439;&#35266;&#32463;&#27982;&#26102;&#38388;&#24207;&#21015;&#30340;&#24212;&#29992;&#20013;&#65292;&#25105;&#20204;&#36827;&#19968;&#27493;&#23637;&#31034;&#20102;&#36825;&#20123;p-&#20540;&#19981;&#20165;&#21487;&#20197;&#36873;&#25321;&#20855;&#26377;&#33391;&#22909;&#39044;&#27979;&#24615;&#33021;&#30340;&#26356;&#31232;&#30095;&#30340;&#27169;&#22411;&#65292;&#32780;&#19988;&#36824;&#26377;&#21161;&#20110;&#25511;&#21046;&#27169;&#22411;&#30340;&#31283;&#23450;&#24615;&#12290;&#25105;&#20204;&#21516;&#26102;&#24320;&#21457;&#20102;&#19968;&#20010;&#21517;&#20026;boostvar&#30340;R&#36719;&#20214;&#21253;&#12290;
&lt;/p&gt;
&lt;p&gt;
Assessing the statistical significance of parameter estimates is an important step in high-dimensional vector autoregression modeling. Using the least-squares boosting method, we compute the p-value for each selected parameter at every boosting step in a linear model. The p-values are asymptotically valid and also adapt to the iterative nature of the boosting procedure. Our simulation experiment shows that the p-values can keep false positive rate under control in high-dimensional vector autoregressions. In an application with more than 100 macroeconomic time series, we further show that the p-values can not only select a sparser model with good prediction performance but also help control model stability. A companion R package boostvar is developed.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#24037;&#20250;&#23545;&#32654;&#22269;&#24037;&#20316;&#22330;&#25152;&#12289;&#31649;&#29702;&#23618;&#21644;&#21592;&#24037;&#25919;&#27835;&#27963;&#21160;&#30340;&#24433;&#21709;&#65292;&#21457;&#29616;&#24037;&#20250;&#21270;&#23548;&#33268;&#25919;&#27835;&#27963;&#21160;&#25424;&#27454;&#21521;&#24038;&#36716;&#31227;&#65292;&#19981;&#20165;&#22312;&#24037;&#20154;&#20013;&#22686;&#21152;&#23545;&#27665;&#20027;&#20826;&#30340;&#25903;&#25345;&#65292;&#20063;&#22312;&#31649;&#29702;&#23618;&#20013;&#22686;&#21152;&#20102;&#23545;&#27665;&#20027;&#20826;&#30340;&#25903;&#25345;&#65292;&#34920;&#26126;&#20004;&#32452;&#20154;&#20043;&#38388;&#30340;&#25919;&#27835;&#20998;&#21270;&#24182;&#26410;&#22686;&#21152;&#12290;</title><link>http://arxiv.org/abs/2209.02637</link><description>&lt;p&gt;
&#24037;&#20250;&#26159;&#21542;&#22312;&#24037;&#20316;&#20013;&#22609;&#36896;&#25919;&#27835;&#24847;&#35782;&#24418;&#24577;&#65311;
&lt;/p&gt;
&lt;p&gt;
Do Unions Shape Political Ideologies at Work?. (arXiv:2209.02637v2 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2209.02637
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#24037;&#20250;&#23545;&#32654;&#22269;&#24037;&#20316;&#22330;&#25152;&#12289;&#31649;&#29702;&#23618;&#21644;&#21592;&#24037;&#25919;&#27835;&#27963;&#21160;&#30340;&#24433;&#21709;&#65292;&#21457;&#29616;&#24037;&#20250;&#21270;&#23548;&#33268;&#25919;&#27835;&#27963;&#21160;&#25424;&#27454;&#21521;&#24038;&#36716;&#31227;&#65292;&#19981;&#20165;&#22312;&#24037;&#20154;&#20013;&#22686;&#21152;&#23545;&#27665;&#20027;&#20826;&#30340;&#25903;&#25345;&#65292;&#20063;&#22312;&#31649;&#29702;&#23618;&#20013;&#22686;&#21152;&#20102;&#23545;&#27665;&#20027;&#20826;&#30340;&#25903;&#25345;&#65292;&#34920;&#26126;&#20004;&#32452;&#20154;&#20043;&#38388;&#30340;&#25919;&#27835;&#20998;&#21270;&#24182;&#26410;&#22686;&#21152;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24037;&#20250;&#23545;&#25919;&#27835;&#24433;&#21709;&#21147;&#30340;&#26368;&#22823;&#28508;&#21147;&#21487;&#33021;&#26469;&#33258;&#20110;&#23427;&#20204;&#19982;&#25968;&#30334;&#19975;&#20010;&#20307;&#22312;&#24037;&#20316;&#22330;&#25152;&#30340;&#30452;&#25509;&#32852;&#31995;&#12290;&#22312;&#37027;&#37324;&#65292;&#23427;&#20204;&#21487;&#20197;&#25913;&#21464;&#24037;&#20250;&#21270;&#24037;&#20154;&#21450;&#20854;&#38750;&#24037;&#20250;&#21270;&#31649;&#29702;&#23618;&#30340;&#24847;&#35782;&#24418;&#24577;&#31435;&#22330;&#12290;&#26412;&#25991;&#20998;&#26512;&#20102;&#32654;&#22269;1980&#24180;&#33267;2016&#24180;&#26399;&#38388;&#24037;&#20250;&#23545;&#24037;&#20316;&#22330;&#25152;&#12289;&#31649;&#29702;&#23618;&#21644;&#21592;&#24037;&#25919;&#27835;&#27963;&#21160;&#25424;&#27454;&#30340;&#24433;&#21709;&#12290;&#20026;&#27492;&#65292;&#25105;&#20204;&#23558;&#20225;&#19994;&#32423;&#24037;&#20250;&#36873;&#20030;&#25968;&#25454;&#19982;&#32852;&#37030;&#21644;&#22320;&#26041;&#20505;&#36873;&#20154;&#30340;&#25424;&#27454;&#32423;&#21035;&#30456;&#38142;&#25509;&#12290;&#20351;&#29992;&#8220;&#24046;&#24322;&#22240;&#24046;&#24322;&#27861;&#8221;&#35774;&#35745;&#65292;&#24182;&#39564;&#35777;&#22238;&#24402;&#30340;&#19981;&#36830;&#32493;&#24615;&#21644;&#26032;&#39062;&#30340;&#24037;&#20855;&#21464;&#37327;&#26041;&#27861;&#65292;&#25105;&#20204;&#21457;&#29616;&#24037;&#20250;&#21270;&#23548;&#33268;&#25919;&#27835;&#27963;&#21160;&#25424;&#27454;&#21521;&#24038;&#36716;&#31227;&#12290;&#24037;&#20250;&#21270;&#19981;&#20165;&#22312;&#24037;&#20154;&#20013;&#22686;&#21152;&#20102;&#23545;&#27665;&#20027;&#20826;&#30340;&#25903;&#25345;&#32780;&#19988;&#22312;&#31649;&#29702;&#23618;&#20013;&#20063;&#22686;&#21152;&#20102;&#23545;&#27665;&#20027;&#20826;&#30340;&#25903;&#25345;&#65292;&#36825;&#21453;&#26144;&#20986;&#20004;&#32452;&#20154;&#20043;&#38388;&#25919;&#27835;&#20998;&#35010;&#30340;&#22686;&#21152;&#12290;
&lt;/p&gt;
&lt;p&gt;
Labor unions' greatest potential for political influence likely arises from their direct connection to millions of individuals at the workplace. There, they may change the ideological positions of both unionizing workers and their non-unionizing management. In this paper, we analyze the workplace-level impact of unionization on workers' and managers' political campaign contributions over the 1980-2016 period in the United States. To do so, we link establishment-level union election data with transaction-level campaign contributions to federal and local candidates. In a difference-in-differences design that we validate with regression discontinuity tests and a novel instrumental variables approach, we find that unionization leads to a leftward shift of campaign contributions. Unionization increases the support for Democrats relative to Republicans not only among workers but also among managers, which speaks against an increase in political cleavages between the two groups. We provide ev
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;Quantal Hierarchy&#27169;&#22411;&#65292;&#25918;&#23485;&#20102;&#20114;&#30456;&#19968;&#33268;&#24615;&#21644;&#26368;&#20248;&#21453;&#24212;&#30340;&#38480;&#21046;&#65292;&#20351;&#24471;&#21487;&#20197;&#36817;&#20284;&#32423;&#21035;K&#65292;QRE&#25110;Nash&#22343;&#34913;&#34892;&#20026;&#12290;&#36825;&#31181;&#27169;&#22411;&#22522;&#20110;&#21464;&#20998;&#33258;&#30001;&#33021;&#21407;&#29702;&#30340;&#36882;&#24402;&#24418;&#24335;&#65292;&#23558;&#26356;&#39640;&#38454;&#25512;&#29702;&#34920;&#31034;&#20026;&#28436;&#21270;&#24418;&#24335;&#21338;&#24328;&#26641;&#20013;&#30340;&#65288;&#20266;&#65289;&#24207;&#21015;&#20915;&#31574;&#21046;&#23450;&#12290;</title><link>http://arxiv.org/abs/2106.15844</link><description>&lt;p&gt;
&#26377;&#30028;&#29702;&#24615;&#19979;&#30340;&#37327;&#32423;&#24207;&#21015;&#27169;&#22411;&#65306;&#25918;&#23485;&#26368;&#20248;&#21453;&#24212;&#21644;&#20114;&#30456;&#19968;&#33268;&#24615;&#30340;&#38480;&#21046;
&lt;/p&gt;
&lt;p&gt;
Bounded rationality for relaxing best response and mutual consistency: The Quantal Hierarchy model of decision-making. (arXiv:2106.15844v5 [cs.GT] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2106.15844
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;Quantal Hierarchy&#27169;&#22411;&#65292;&#25918;&#23485;&#20102;&#20114;&#30456;&#19968;&#33268;&#24615;&#21644;&#26368;&#20248;&#21453;&#24212;&#30340;&#38480;&#21046;&#65292;&#20351;&#24471;&#21487;&#20197;&#36817;&#20284;&#32423;&#21035;K&#65292;QRE&#25110;Nash&#22343;&#34913;&#34892;&#20026;&#12290;&#36825;&#31181;&#27169;&#22411;&#22522;&#20110;&#21464;&#20998;&#33258;&#30001;&#33021;&#21407;&#29702;&#30340;&#36882;&#24402;&#24418;&#24335;&#65292;&#23558;&#26356;&#39640;&#38454;&#25512;&#29702;&#34920;&#31034;&#20026;&#28436;&#21270;&#24418;&#24335;&#21338;&#24328;&#26641;&#20013;&#30340;&#65288;&#20266;&#65289;&#24207;&#21015;&#20915;&#31574;&#21046;&#23450;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#23613;&#31649;&#21338;&#24328;&#35770;&#23545;&#20915;&#31574;&#21046;&#23450;&#20855;&#26377;&#36716;&#22411;&#24615;&#30340;&#20316;&#29992;&#65292;&#20294;&#22312;&#26576;&#20123;&#24773;&#20917;&#19979;&#65292;&#25152;&#20551;&#35774;&#30340;&#26465;&#20214;&#21487;&#33021;&#36807;&#20110;&#20005;&#26684;&#12290;&#22312;&#26412;&#30740;&#31350;&#20013;&#65292;&#25105;&#20204;&#35843;&#26597;&#20102;&#29702;&#24615;&#30340;&#19968;&#20123;&#28508;&#22312;&#20551;&#35774;&#65292;&#22914;&#20114;&#30456;&#19968;&#33268;&#24615;&#21644;&#26368;&#20248;&#21453;&#24212;&#65292;&#24182;&#32771;&#34385;&#20351;&#29992;&#32423;&#21035;K&#25512;&#29702;&#21644;&#37327;&#21270;&#21453;&#39304;&#24179;&#34913;&#65288;QRE&#65289;&#30340;&#27010;&#24565;&#25918;&#23485;&#36825;&#20123;&#20551;&#35774;&#30340;&#26041;&#27861;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#21517;&#20026;Quantal Hierarchy&#27169;&#22411;&#30340;&#20449;&#24687;&#35770;&#21452;&#21442;&#25968;&#27169;&#22411;&#65292;&#21487;&#20197;&#25918;&#23485;&#20114;&#30456;&#19968;&#33268;&#24615;&#21644;&#26368;&#20248;&#21453;&#24212;&#30340;&#38480;&#21046;&#65292;&#21516;&#26102;&#22312;&#26497;&#38480;&#24773;&#20917;&#19979;&#36817;&#20284;&#32423;&#21035;K&#65292;QRE&#25110;&#20856;&#22411;&#30340;Nash&#22343;&#34913;&#34892;&#20026;&#12290;&#35813;&#27169;&#22411;&#22522;&#20110;&#21464;&#20998;&#33258;&#30001;&#33021;&#21407;&#29702;&#30340;&#36882;&#24402;&#24418;&#24335;&#65292;&#23558;&#26356;&#39640;&#38454;&#25512;&#29702;&#34920;&#31034;&#20026;&#28436;&#21270;&#24418;&#24335;&#21338;&#24328;&#26641;&#20013;&#30340;&#65288;&#20266;&#65289;&#24207;&#21015;&#20915;&#31574;&#21046;&#23450;&#12290;&#36825;&#31181;&#34920;&#31034;&#26041;&#27861;&#20351;&#25105;&#20204;&#33021;&#22815;&#20197;&#31867;&#20284;&#20110;&#39034;&#24207;&#21338;&#24328;&#30340;&#26041;&#24335;&#22788;&#29702;&#21516;&#26102;&#21338;&#24328;&#65292;&#20854;&#20013;&#25512;&#29702;&#36164;&#28304;&#22312;&#28216;&#25103;&#20013;&#36880;&#28176;&#32791;&#23613;&#12290;
&lt;/p&gt;
&lt;p&gt;
While game theory has been transformative for decision-making, the assumptions made can be overly restrictive in certain instances. In this work, we investigate some of the underlying assumptions of rationality, such as mutual consistency and best response, and consider ways to relax these assumptions using concepts from level-$k$ reasoning and quantal response equilibrium (QRE) respectively. Specifically, we propose an information-theoretic two-parameter model called the Quantal Hierarchy model, which can relax both mutual consistency and best response while still approximating level-$k$, QRE, or typical Nash equilibrium behaviour in the limiting cases. The model is based on a recursive form of the variational free energy principle, representing higher-order reasoning as (pseudo) sequential decision-making in extensive-form game tree. This representation enables us to treat simultaneous games in a similar manner to sequential games, where reasoning resources deplete throughout the gam
&lt;/p&gt;</description></item></channel></rss>