<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#26412;&#25991;&#25506;&#35752;&#20351;&#29992;&#32463;&#27982;&#20915;&#31574;&#21046;&#23450;&#30340;&#8220;&#39118;&#38505;&#25293;&#25171;&#8221;&#31574;&#30053;&#21487;&#25112;&#32988;&#20165;&#20973;&#24555;&#36895;&#21453;&#24212;&#30340;&#31574;&#30053;&#65292;&#24182;&#24212;&#29992;&#35745;&#31639;&#21338;&#24328;&#35770;&#26500;&#24314;&#20102;ERS&#28216;&#25103;&#30340;&#27169;&#25311;&#22120;&#65292;&#35777;&#26126;&#35813;&#31574;&#30053;&#22312;85%&#30340;&#28216;&#25103;&#20013;&#26377;&#25928;&#12290;</title><link>http://arxiv.org/abs/2304.01007</link><description>&lt;p&gt;
&#29992;&#35745;&#31639;&#21338;&#24328;&#35770;&#25506;&#31350;&#22467;&#21450;&#32769;&#40736;&#22841;&#32440;&#29260;&#28216;&#25103;&#30340;&#20027;&#23548;&#31574;&#30053;
&lt;/p&gt;
&lt;p&gt;
Egyptian Ratscrew: Discovering Dominant Strategies with Computational Game Theory. (arXiv:2304.01007v1 [cs.GT])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.01007
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25506;&#35752;&#20351;&#29992;&#32463;&#27982;&#20915;&#31574;&#21046;&#23450;&#30340;&#8220;&#39118;&#38505;&#25293;&#25171;&#8221;&#31574;&#30053;&#21487;&#25112;&#32988;&#20165;&#20973;&#24555;&#36895;&#21453;&#24212;&#30340;&#31574;&#30053;&#65292;&#24182;&#24212;&#29992;&#35745;&#31639;&#21338;&#24328;&#35770;&#26500;&#24314;&#20102;ERS&#28216;&#25103;&#30340;&#27169;&#25311;&#22120;&#65292;&#35777;&#26126;&#35813;&#31574;&#30053;&#22312;85%&#30340;&#28216;&#25103;&#20013;&#26377;&#25928;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22467;&#21450;&#32769;&#40736;&#22841;&#32440;&#29260;&#28216;&#25103;&#26159;&#19968;&#31181;&#29616;&#20195;&#30340;&#32654;&#22269;&#32440;&#29260;&#28216;&#25103;&#65292;&#34987;&#20840;&#29699;&#25968;&#30334;&#19975;&#29609;&#23478;&#21916;&#29233;&#12290;&#35813;&#28216;&#25103;&#30340;&#30446;&#30340;&#26159;&#25910;&#38598;&#25972;&#21103;&#29260;&#20013;&#25152;&#26377;&#30340;&#29260;&#12290;&#36890;&#24120;&#24773;&#20917;&#19979;&#65292;&#26368;&#24555;&#30340;&#21453;&#24212;&#36895;&#24230;&#26159;&#33719;&#32988;&#30340;&#20851;&#38190;&#65292;&#22240;&#20026;&#25910;&#38598;&#29260;&#30340;&#26368;&#24120;&#35265;&#31574;&#30053;&#26159;&#25104;&#20026;&#31532;&#19968;&#20010;&#22312;&#20013;&#24515;&#22534;&#20013;&#21512;&#27861;&#30340;&#29260;&#32452;&#21512;&#25918;&#19979;&#26102;&#25293;&#25171;&#22534;&#30340;&#29609;&#23478;&#12290;&#22823;&#22810;&#25968;&#29609;&#23478;&#35748;&#20026;&#65292;&#20027;&#23548;&#31574;&#30053;&#26159;&#21457;&#23637;&#27604;&#23545;&#25163;&#26356;&#24555;&#30340;&#21453;&#24212;&#26102;&#38388;&#65292;&#32780;&#35813;&#20551;&#35774;&#24182;&#26410;&#21463;&#21040;&#23398;&#26415;&#30740;&#31350;&#30340;&#25361;&#25112;&#12290;&#36825;&#31687;&#35770;&#25991;&#25506;&#35752;&#20102;&#19968;&#20010;&#8220;&#39118;&#38505;&#25293;&#25171;&#8221;&#31574;&#30053;&#23478;&#30340;&#20551;&#35774;&#65292;&#20182;&#20381;&#36182;&#23454;&#38469;&#30340;&#32463;&#27982;&#20915;&#31574;&#26469;&#25112;&#32988;&#37027;&#20123;&#21482;&#20381;&#36182;&#24555;&#36895;&#21453;&#24212;&#30340;&#29609;&#23478;&#65292;&#20174;&#32780;&#22312;&#28216;&#25103;&#20013;&#33719;&#24471;&#21387;&#20498;&#24615;&#30340;&#32988;&#21033;&#12290;&#29702;&#35770;&#19978;&#65292;&#36825;&#21487;&#20197;&#36890;&#36807;&#21033;&#29992;&#8220;&#28903;&#29260;&#35268;&#21017;&#8221;&#26469;&#23454;&#29616;&#65292;&#36825;&#26159;&#19968;&#31181;&#32602;&#27454;&#35268;&#21017;&#65292;&#36807;&#20110;&#20302;&#24265;&#65292;&#26080;&#27861;&#26377;&#25928;&#22320;&#38459;&#27490;&#29609;&#23478;&#38750;&#27861;&#22320;&#25293;&#25171;&#29260;&#22534;&#32780;&#33719;&#30410;&#12290;&#25105;&#20204;&#20351;&#29992;Ruby&#32534;&#31243;&#35821;&#35328;&#26500;&#24314;&#20102;&#19968;&#27454;ERS&#27169;&#25311;&#22120;&#65292;&#20854;&#20013;&#8220;&#39118;&#38505;&#25293;&#25171;&#8221;&#31574;&#30053;&#22312;&#32422;85%&#30340;&#28216;&#25103;&#20013;&#20987;&#36133;&#20102;&#24555;&#36895;&#21453;&#24212;&#31574;&#30053;&#12290;&#36825;&#25903;&#25345;&#20102;&#23454;&#36341;&#35777;&#26126;&#65292;&#32463;&#27982;&#20915;&#31574;&#21046;&#23450;&#21487;&#20197;&#25104;&#20026;ERS&#20013;&#19968;&#31181;&#26377;&#25928;&#30340;&#31574;&#30053;&#65292;&#21338;&#24328;&#35770;&#21487;&#25104;&#20026;&#20102;&#35299;&#21644;&#25913;&#36827;&#28216;&#25103;&#29609;&#27861;&#30340;&#26377;&#20215;&#20540;&#24037;&#20855;&#12290;
&lt;/p&gt;
&lt;p&gt;
"Egyptian Ratscrew" (ERS) is a modern American card game enjoyed by millions of players worldwide. A game of ERS is won by collecting all of the cards in the deck. Typically this game is won by the player with the fastest reflexes, since the most common strategy for collecting cards is being the first to slap the pile in the center whenever legal combinations of cards are placed down. Most players assume that the dominant strategy is to develop a faster reaction time than your opponents, and no academic inquiry has been levied against this assumption. This thesis investigates the hypothesis that a "risk slapping" strategist who relies on practical economic decision making will win an overwhelming majority of games against players who rely on quick reflexes alone. It is theorized that this can be done by exploiting the "burn rule," a penalty that is too low-cost to effectively dissuade players from slapping illegally when it benefits them. Using the Ruby programming language, we constru
&lt;/p&gt;</description></item></channel></rss>