<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#21442;&#25968;&#65292;&#24179;&#34913;&#32676;&#20307;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#65288;BGATE&#65289;&#65292;&#29992;&#20110;&#35299;&#37322;&#22788;&#29702;&#22312;&#32676;&#20307;&#38388;&#30340;&#25928;&#24212;&#24046;&#24322;&#65292;&#35813;&#21442;&#25968;&#22522;&#20110;&#22240;&#26524;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#65292;&#23545;&#31163;&#25955;&#22788;&#29702;&#36827;&#34892;&#20272;&#35745;&#12290;&#36890;&#36807;&#27604;&#36739;&#20004;&#20010;BGATE&#30340;&#24046;&#24322;&#65292;&#33021;&#26356;&#22909;&#22320;&#20998;&#26512;&#22788;&#29702;&#30340;&#24322;&#36136;&#24615;&#12290;</title><link>http://arxiv.org/abs/2401.08290</link><description>&lt;p&gt;
&#22240;&#26524;&#26426;&#22120;&#23398;&#20064;&#29992;&#20110;&#20013;&#20171;&#25928;&#24212;&#12290; (arXiv:2401.08290v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
Causal Machine Learning for Moderation Effects. (arXiv:2401.08290v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.08290
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#21442;&#25968;&#65292;&#24179;&#34913;&#32676;&#20307;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#65288;BGATE&#65289;&#65292;&#29992;&#20110;&#35299;&#37322;&#22788;&#29702;&#22312;&#32676;&#20307;&#38388;&#30340;&#25928;&#24212;&#24046;&#24322;&#65292;&#35813;&#21442;&#25968;&#22522;&#20110;&#22240;&#26524;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#65292;&#23545;&#31163;&#25955;&#22788;&#29702;&#36827;&#34892;&#20272;&#35745;&#12290;&#36890;&#36807;&#27604;&#36739;&#20004;&#20010;BGATE&#30340;&#24046;&#24322;&#65292;&#33021;&#26356;&#22909;&#22320;&#20998;&#26512;&#22788;&#29702;&#30340;&#24322;&#36136;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#23545;&#20110;&#20219;&#20309;&#20915;&#31574;&#32773;&#26469;&#35828;&#65292;&#20102;&#35299;&#20915;&#31574;&#65288;&#22788;&#29702;&#65289;&#23545;&#25972;&#20307;&#21644;&#23376;&#32676;&#30340;&#24433;&#21709;&#26159;&#38750;&#24120;&#26377;&#20215;&#20540;&#30340;&#12290;&#22240;&#26524;&#26426;&#22120;&#23398;&#20064;&#26368;&#36817;&#25552;&#20379;&#20102;&#29992;&#20110;&#20272;&#35745;&#32676;&#20307;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#65288;GATE&#65289;&#30340;&#24037;&#20855;&#65292;&#20197;&#26356;&#22909;&#22320;&#29702;&#35299;&#22788;&#29702;&#30340;&#24322;&#36136;&#24615;&#12290;&#26412;&#25991;&#35299;&#20915;&#20102;&#22312;&#32771;&#34385;&#20854;&#20182;&#21327;&#21464;&#37327;&#21464;&#21270;&#30340;&#24773;&#20917;&#19979;&#35299;&#37322;&#32676;&#20307;&#38388;&#22788;&#29702;&#25928;&#24212;&#24046;&#24322;&#30340;&#38590;&#39064;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#26032;&#30340;&#21442;&#25968;&#65292;&#21363;&#24179;&#34913;&#32676;&#20307;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#65288;BGATE&#65289;&#65292;&#23427;&#34913;&#37327;&#20102;&#20855;&#26377;&#29305;&#23450;&#20998;&#24067;&#30340;&#20808;&#39564;&#30830;&#23450;&#21327;&#21464;&#37327;&#30340;GATE&#12290;&#36890;&#36807;&#27604;&#36739;&#20004;&#20010;BGATE&#30340;&#24046;&#24322;&#65292;&#25105;&#20204;&#21487;&#20197;&#26356;&#26377;&#24847;&#20041;&#22320;&#20998;&#26512;&#24322;&#36136;&#24615;&#65292;&#32780;&#19981;&#20165;&#20165;&#27604;&#36739;&#20004;&#20010;GATE&#12290;&#36825;&#20010;&#21442;&#25968;&#30340;&#20272;&#35745;&#31574;&#30053;&#26159;&#22522;&#20110;&#26080;&#28151;&#28102;&#35774;&#32622;&#20013;&#31163;&#25955;&#22788;&#29702;&#30340;&#21452;&#37325;/&#21435;&#20559;&#26426;&#22120;&#23398;&#20064;&#65292;&#35813;&#20272;&#35745;&#37327;&#22312;&#26631;&#20934;&#26465;&#20214;&#19979;&#34920;&#29616;&#20026;$\sqrt{N}$&#19968;&#33268;&#24615;&#21644;&#28176;&#36817;&#27491;&#24577;&#24615;&#12290;&#28155;&#21152;&#39069;&#22806;&#30340;&#26631;&#35782;
&lt;/p&gt;
&lt;p&gt;
It is valuable for any decision maker to know the impact of decisions (treatments) on average and for subgroups. The causal machine learning literature has recently provided tools for estimating group average treatment effects (GATE) to understand treatment heterogeneity better. This paper addresses the challenge of interpreting such differences in treatment effects between groups while accounting for variations in other covariates. We propose a new parameter, the balanced group average treatment effect (BGATE), which measures a GATE with a specific distribution of a priori-determined covariates. By taking the difference of two BGATEs, we can analyse heterogeneity more meaningfully than by comparing two GATEs. The estimation strategy for this parameter is based on double/debiased machine learning for discrete treatments in an unconfoundedness setting, and the estimator is shown to be $\sqrt{N}$-consistent and asymptotically normal under standard conditions. Adding additional identifyin
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#19968;&#20010;&#26377;&#39044;&#31639;&#38480;&#21046;&#30340;&#24066;&#22330;&#65292;&#20080;&#23478;&#20855;&#26377;&#20934;&#32447;&#24615;&#25928;&#29992;&#21644;&#32447;&#24615;&#26367;&#20195;&#20272;&#20540;&#65292;&#21334;&#23478;&#38656;&#35201;&#25214;&#21040;&#26368;&#22823;&#21270;&#25910;&#20837;&#25110;&#31119;&#21033;&#30340;&#20215;&#26684;&#21644;&#26080;&#23241;&#22930;&#30340;&#20998;&#37197;&#12290;&#30740;&#31350;&#21457;&#29616;&#31454;&#20105;&#22343;&#34913;&#20215;&#26684;&#20063;&#26159;&#26080;&#23241;&#22930;&#25910;&#20837;&#26368;&#22823;&#21270;&#30340;&#65292;&#24182;&#25552;&#20379;&#20102;&#23545;&#8220;&#21487;&#34892;&#8221;&#20215;&#26684;&#38598;&#30340;&#26032;&#39062;&#25551;&#36848;&#12290;</title><link>http://arxiv.org/abs/2310.03692</link><description>&lt;p&gt;
&#26377;&#39044;&#31639;&#38480;&#21046;&#30340;&#26367;&#20195;&#24066;&#22330;&#65306;&#35299;&#20915;&#31454;&#20105;&#21644;&#26368;&#20248;&#20215;&#26684;&#38382;&#39064;
&lt;/p&gt;
&lt;p&gt;
Substitutes markets with budget constraints: solving for competitive and optimal prices. (arXiv:2310.03692v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.03692
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#19968;&#20010;&#26377;&#39044;&#31639;&#38480;&#21046;&#30340;&#24066;&#22330;&#65292;&#20080;&#23478;&#20855;&#26377;&#20934;&#32447;&#24615;&#25928;&#29992;&#21644;&#32447;&#24615;&#26367;&#20195;&#20272;&#20540;&#65292;&#21334;&#23478;&#38656;&#35201;&#25214;&#21040;&#26368;&#22823;&#21270;&#25910;&#20837;&#25110;&#31119;&#21033;&#30340;&#20215;&#26684;&#21644;&#26080;&#23241;&#22930;&#30340;&#20998;&#37197;&#12290;&#30740;&#31350;&#21457;&#29616;&#31454;&#20105;&#22343;&#34913;&#20215;&#26684;&#20063;&#26159;&#26080;&#23241;&#22930;&#25910;&#20837;&#26368;&#22823;&#21270;&#30340;&#65292;&#24182;&#25552;&#20379;&#20102;&#23545;&#8220;&#21487;&#34892;&#8221;&#20215;&#26684;&#38598;&#30340;&#26032;&#39062;&#25551;&#36848;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22810;&#20010;&#21487;&#20998;&#21106;&#21830;&#21697;&#30340;&#24066;&#22330;&#20174;&#25910;&#20837;&#21644;&#31119;&#21033;&#30340;&#35282;&#24230;&#24471;&#21040;&#20102;&#24191;&#27867;&#30340;&#30740;&#31350;&#12290;&#19968;&#33324;&#26469;&#35828;&#65292;&#20247;&#25152;&#21608;&#30693;&#65292;&#26080;&#23241;&#22930;&#25910;&#20837;&#26368;&#22823;&#21270;&#30340;&#32467;&#26524;&#21487;&#33021;&#20250;&#23548;&#33268;&#27604;&#31454;&#20105;&#22343;&#34913;&#30340;&#32467;&#26524;&#26356;&#20302;&#30340;&#31119;&#21033;&#12290;&#25105;&#20204;&#30740;&#31350;&#20102;&#19968;&#20010;&#24066;&#22330;&#65292;&#20080;&#23478;&#20855;&#26377;&#20934;&#32447;&#24615;&#25928;&#29992;&#21644;&#32447;&#24615;&#26367;&#20195;&#20272;&#20540;&#65292;&#24182;&#19988;&#26377;&#39044;&#31639;&#38480;&#21046;&#65292;&#21334;&#23478;&#24517;&#39035;&#25214;&#21040;&#26368;&#22823;&#21270;&#25910;&#20837;&#25110;&#31119;&#21033;&#30340;&#20215;&#26684;&#21644;&#26080;&#23241;&#22930;&#30340;&#20998;&#37197;&#12290;&#25105;&#20204;&#30340;&#35774;&#32622;&#19982;&#24191;&#21578;&#25293;&#21334;&#21644;&#37329;&#34701;&#36164;&#20135;&#20132;&#25442;&#25293;&#21334;&#31561;&#24066;&#22330;&#30456;&#20284;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#21807;&#19968;&#30340;&#31454;&#20105;&#22343;&#34913;&#20215;&#26684;&#20063;&#26159;&#26080;&#23241;&#22930;&#25910;&#20837;&#26368;&#22823;&#21270;&#30340;&#12290;&#36825;&#31181;&#26368;&#22823;&#25910;&#20837;&#21644;&#31119;&#21033;&#30340;&#24039;&#21512;&#20196;&#20154;&#24778;&#35766;&#65292;&#22312;&#20080;&#23478;&#20855;&#26377;&#20998;&#27573;&#32447;&#24615;&#20272;&#20540;&#26102;&#29978;&#33267;&#20250;&#22833;&#36133;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#19968;&#20010;&#23545;&#8220;&#21487;&#34892;&#8221;&#20215;&#26684;&#38598;&#30340;&#26032;&#39062;&#25551;&#36848;&#65292;&#34920;&#26126;&#36825;&#20010;&#38598;&#21512;&#26377;&#19968;&#20010;&#25353;&#20803;&#32032;&#26368;&#23567;&#30340;&#20215;&#26684;&#21521;&#37327;&#65292;&#35777;&#26126;&#20102;&#36825;&#20123;&#20215;&#26684;&#26368;&#22823;&#21270;&#25910;&#20837;&#21644;&#31119;&#21033;&#12290;
&lt;/p&gt;
&lt;p&gt;
Markets with multiple divisible goods have been studied widely from the perspective of revenue and welfare. In general, it is well known that envy-free revenue-maximal outcomes can result in lower welfare than competitive equilibrium outcomes. We study a market in which buyers have quasilinear utilities with linear substitutes valuations and budget constraints, and the seller must find prices and an envy-free allocation that maximise revenue or welfare. Our setup mirrors markets such as ad auctions and auctions for the exchange of financial assets. We prove that the unique competitive equilibrium prices are also envy-free revenue-maximal. This coincidence of maximal revenue and welfare is surprising and breaks down even when buyers have piecewise-linear valuations. We present a novel characterisation of the set of "feasible" prices at which demand does not exceed supply, show that this set has an elementwise minimal price vector, and demonstrate that these prices maximise revenue and w
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#21452;&#37325;&#31283;&#20581;&#25512;&#26029;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#21487;&#29992;&#20110;&#26500;&#24314;&#22312;&#24046;&#20998;&#20013;&#30340;&#32452;&#26102;&#38388;&#26465;&#20214;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#20989;&#25968;&#30340;&#19968;&#33268;&#32622;&#20449;&#24102;&#12290;</title><link>http://arxiv.org/abs/2305.02185</link><description>&lt;p&gt;
&#21452;&#37325;&#31283;&#20581;&#19968;&#33268;&#32622;&#20449;&#24102;&#22312;&#24046;&#20998;&#20013;&#30340;&#32452;&#26102;&#38388;&#26465;&#20214;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#20013;&#30340;&#24212;&#29992;
&lt;/p&gt;
&lt;p&gt;
Doubly Robust Uniform Confidence Bands for Group-Time Conditional Average Treatment Effects in Difference-in-Differences. (arXiv:2305.02185v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.02185
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#21452;&#37325;&#31283;&#20581;&#25512;&#26029;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#21487;&#29992;&#20110;&#26500;&#24314;&#22312;&#24046;&#20998;&#20013;&#30340;&#32452;&#26102;&#38388;&#26465;&#20214;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#20989;&#25968;&#30340;&#19968;&#33268;&#32622;&#20449;&#24102;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#32771;&#34385;&#20102;&#23545;&#38754;&#26495;&#25968;&#25454;&#36827;&#34892;&#20998;&#26512;&#65292;&#20197;&#30740;&#31350;&#22312;Callaway&#21644;Sant'Anna&#65288;2021&#65289;&#30340;&#38169;&#20301;&#24046;&#20998;&#35774;&#32622;&#20013;&#65292;&#38024;&#23545;&#24863;&#20852;&#36259;&#30340;&#39044;&#22788;&#29702;&#21327;&#21464;&#37327;&#30340;&#27835;&#30103;&#25928;&#24212;&#24322;&#36136;&#24615;&#12290;&#22312;&#19968;&#32452;&#26631;&#20934;&#35782;&#21035;&#26465;&#20214;&#19979;&#65292;&#19968;&#20010;&#22522;&#20110;&#21327;&#21464;&#37327;&#30340;&#21452;&#37325;&#31283;&#20581;&#20272;&#35745;&#20540;&#35782;&#21035;&#20102;&#32473;&#23450;&#21327;&#21464;&#37327;&#30340;&#32452;&#26102;&#38388;&#26465;&#20214;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#12290;&#37492;&#20110;&#36825;&#20010;&#35782;&#21035;&#32467;&#26524;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#22522;&#20110;&#38750;&#21442;&#25968;&#23616;&#37096;&#32447;&#24615;&#22238;&#24402;&#21644;&#21442;&#25968;&#20272;&#35745;&#26041;&#27861;&#30340;&#19977;&#27493;&#20272;&#35745;&#31243;&#24207;&#65292;&#24182;&#24320;&#21457;&#20102;&#19968;&#20010;&#21452;&#37325;&#31283;&#20581;&#25512;&#26029;&#26041;&#27861;&#26469;&#26500;&#24314;&#32452;&#26102;&#38388;&#26465;&#20214;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#20989;&#25968;&#30340;&#19968;&#33268;&#32622;&#20449;&#24102;&#12290;
&lt;/p&gt;
&lt;p&gt;
This study considers a panel data analysis to examine the heterogeneity in treatment effects with respect to a pre-treatment covariate of interest in the staggered difference-in-differences setting in Callaway and Sant'Anna (2021). Under a set of standard identification conditions, a doubly robust estimand conditional on the covariate identifies the group-time conditional average treatment effect given the covariate. Given this identification result, we propose a three-step estimation procedure based on nonparametric local linear regressions and parametric estimation methods, and develop a doubly robust inference method to construct a uniform confidence band of the group-time conditional average treatment effect function.
&lt;/p&gt;</description></item></channel></rss>