<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#26292;&#38706;&#20110;&#29983;&#25104;&#24335;AI&#25216;&#26415;&#30340;&#33258;&#30001;&#32844;&#19994;&#32773;&#22312;&#22312;&#32447;&#24037;&#20316;&#24179;&#21488;&#19978;&#20855;&#26377;&#26356;&#31215;&#26497;&#30340;&#25112;&#30053;&#34892;&#20026;&#65292;&#26356;&#20542;&#21521;&#20110;&#22312;&#29305;&#23450;&#39046;&#22495;&#38598;&#20013;&#30003;&#35831;&#24037;&#20316;&#32844;&#20301;&#12290;</title><link>https://arxiv.org/abs/2403.15262</link><description>&lt;p&gt;
&#22312;&#32447;&#24037;&#20316;&#24179;&#21488;&#19978;&#30340;AI&#26292;&#38706;&#21644;&#25112;&#30053;&#23450;&#20301;
&lt;/p&gt;
&lt;p&gt;
AI Exposure and Strategic Positioning on an Online Work Platform
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.15262
&lt;/p&gt;
&lt;p&gt;
&#26292;&#38706;&#20110;&#29983;&#25104;&#24335;AI&#25216;&#26415;&#30340;&#33258;&#30001;&#32844;&#19994;&#32773;&#22312;&#22312;&#32447;&#24037;&#20316;&#24179;&#21488;&#19978;&#20855;&#26377;&#26356;&#31215;&#26497;&#30340;&#25112;&#30053;&#34892;&#20026;&#65292;&#26356;&#20542;&#21521;&#20110;&#22312;&#29305;&#23450;&#39046;&#22495;&#38598;&#20013;&#30003;&#35831;&#24037;&#20316;&#32844;&#20301;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
AI&#25216;&#26415;&#26377;&#21487;&#33021;&#36890;&#36807;&#25552;&#39640;&#24037;&#20154;&#29983;&#20135;&#21147;&#21644;&#20943;&#23569;&#23545;&#26576;&#20123;&#25216;&#33021;&#25110;&#20219;&#21153;&#30340;&#38656;&#27714;&#26469;&#24433;&#21709;&#21171;&#21160;&#21147;&#24066;&#22330;&#32467;&#26524;&#12290;&#36825;&#20123;&#21464;&#21270;&#21487;&#33021;&#20250;&#23545;&#24037;&#20316;&#32773;&#23547;&#25214;&#24037;&#20316;&#21644;&#23450;&#20301;&#26041;&#24335;&#20135;&#29983;&#37325;&#35201;&#24433;&#21709;&#12290;&#22312;&#35813;&#39033;&#30446;&#20013;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#26292;&#38706;&#20110;&#29983;&#25104;&#24335;AI&#25216;&#26415;&#30340;&#33258;&#30001;&#32844;&#19994;&#32773;&#22312;2022&#24180;12&#26376;ChatGPT&#25512;&#20986;&#21518;&#20250;&#22914;&#20309;&#24433;&#21709;&#22312;&#32447;&#24037;&#20316;&#24179;&#21488;&#19978;&#30340;&#25112;&#30053;&#34892;&#20026;&#12290;&#30456;&#23545;&#20110;&#26292;&#38706;&#36739;&#23569;&#30340;&#21516;&#34892;&#65292;&#25105;&#20204;&#21457;&#29616;&#65292;&#26292;&#38706;&#24230;&#26356;&#39640;&#20110;&#35821;&#35328;&#24314;&#27169;&#25216;&#26415;&#30340;&#33258;&#30001;&#32844;&#19994;&#32773;&#22312;ChatGPT&#25512;&#20986;&#21518;&#20250;&#22312;&#35813;&#24179;&#21488;&#19978;&#30003;&#35831;&#26356;&#22810;&#30340;&#32844;&#20301;&#65292;&#24182;&#22686;&#21152;&#36825;&#20123;&#30003;&#35831;&#22312;&#29305;&#23450;&#19987;&#19994;&#20013;&#30340;&#38598;&#20013;&#24230;&#12290;&#25105;&#20204;&#35760;&#24405;&#20102;&#36825;&#31181;&#25928;&#24212;&#22312;&#33258;&#30001;&#32844;&#19994;&#32773;&#29305;&#24449;&#19978;&#30340;&#24322;&#36136;&#24615;&#65292;&#24182;&#32771;&#34385;&#36825;&#20123;&#34892;&#20026;&#22914;&#20309;&#22609;&#36896;&#25216;&#26415;&#20914;&#20987;&#26159;&#21542;&#20197;&#21450;&#22312;&#22810;&#22823;&#31243;&#24230;&#19978;&#24433;&#21709;&#33258;&#30001;&#32844;&#19994;&#32773;&#22312;&#24179;&#21488;&#19978;&#30340;&#34920;&#29616;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.15262v1 Announce Type: new  Abstract: AI technologies have the potential to affect labor market outcomes by both increasing worker productivity and reducing the demand for certain skills or tasks. Such changes may have important implications for the ways in which workers seek jobs and position themselves. In this project, we examine how exposure to generative AI technologies affects the strategic behavior of freelancer workers on an online work platform following the launch of ChatGPT in December 2022. Relative to their less exposed counterparts, we show that freelancers that are more exposed to language modeling technologies apply for more job posts on the platform following the launch of ChatGPT and increase the concentration of these applications across specializations. We document heterogeneity in this effect across freelancer characteristics and consider how such behaviors shape whether and to what extent the technological shock affects freelancer performance on the pla
&lt;/p&gt;</description></item><item><title>&#36890;&#36807;&#27604;&#36739;&#27599;&#23478;&#20844;&#21496;&#30340;&#31995;&#32479;&#37325;&#35201;&#24615;&#21644;&#20108;&#27687;&#21270;&#30899;&#25490;&#25918;&#37327;&#65292;&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#26368;&#20248;&#30340;&#20943;&#25490;&#31574;&#30053;&#65292;&#20026;&#23454;&#29616;20%&#20943;&#25490;&#30446;&#26631;&#25552;&#20379;&#20102;&#20943;&#23569;&#23601;&#19994;&#21644;&#32463;&#27982;&#25439;&#22833;&#30340;&#35299;&#20915;&#26041;&#26696;&#12290;</title><link>https://arxiv.org/abs/2302.08987</link><description>&lt;p&gt;
&#20943;&#23569;&#33073;&#30899;&#22833;&#19994;&#21644;&#32463;&#27982;&#25439;&#22833;&#30340;&#20225;&#19994;&#32423;&#20379;&#24212;&#38142;
&lt;/p&gt;
&lt;p&gt;
Firm-level supply chains to minimize decarbonization unemployment and economic losses
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2302.08987
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#27604;&#36739;&#27599;&#23478;&#20844;&#21496;&#30340;&#31995;&#32479;&#37325;&#35201;&#24615;&#21644;&#20108;&#27687;&#21270;&#30899;&#25490;&#25918;&#37327;&#65292;&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#26368;&#20248;&#30340;&#20943;&#25490;&#31574;&#30053;&#65292;&#20026;&#23454;&#29616;20%&#20943;&#25490;&#30446;&#26631;&#25552;&#20379;&#20102;&#20943;&#23569;&#23601;&#19994;&#21644;&#32463;&#27982;&#25439;&#22833;&#30340;&#35299;&#20915;&#26041;&#26696;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24613;&#38656;&#20943;&#23569;&#30899;&#25490;&#25918;&#21487;&#33021;&#23548;&#33268;&#20005;&#26684;&#30340;&#21629;&#20196;&#19982;&#25511;&#21046;&#33073;&#30899;&#31574;&#30053;&#65292;&#21487;&#33021;&#24102;&#26469;&#36127;&#38754;&#32463;&#27982;&#21518;&#26524;&#12290;&#26412;&#25991;&#20998;&#26512;&#20102;&#27431;&#27954;&#32463;&#27982;&#30340;&#25972;&#20307;&#20225;&#19994;&#32423;&#29983;&#20135;&#32593;&#32476;&#65292;&#25506;&#35752;&#20102;&#22914;&#20309;&#36991;&#20813;&#36825;&#20123;&#26041;&#27861;&#30340;&#26368;&#22351;&#32467;&#26524;&#12290;&#25105;&#20204;&#27604;&#36739;&#20102;&#27599;&#23478;&#20844;&#21496;&#30340;&#31995;&#32479;&#37325;&#35201;&#24615;&#21644;&#20854;&#24180;&#20108;&#27687;&#21270;&#30899;&#25490;&#25918;&#37327;&#65292;&#20197;&#30830;&#23450;&#20855;&#26377;&#26368;&#23567;&#39069;&#22806;&#22833;&#19994;&#21644;&#32463;&#27982;&#25439;&#22833;&#30340;&#26368;&#20339;&#20943;&#25490;&#31574;&#30053;&#12290;&#25105;&#20204;&#35774;&#23450;&#20102;&#29305;&#23450;&#30340;&#20943;&#25490;&#30446;&#26631;&#65292;&#30740;&#31350;&#20102;&#21508;&#31181;&#33073;&#30899;&#24773;&#26223;&#24182;&#37327;&#21270;&#20102;&#23427;&#20204;&#30340;&#32463;&#27982;&#21518;&#26524;&#12290;&#25105;&#20204;&#34920;&#26126;&#65292;&#23545;&#20110;&#20943;&#25490;20&#65285;&#65292;&#26368;&#26377;&#25928;&#30340;&#31574;&#30053;&#23548;&#33268;&#32422;2&#65285;&#30340;&#23601;&#19994;&#23703;&#20301;&#25439;&#22833;&#21644;2&#65285;&#30340;&#32463;&#27982;&#20135;&#20986;&#25439;&#22833;&#12290;&#30456;&#27604;&#20043;&#19979;&#65292;&#38024;&#23545;&#26368;&#22823;&#25490;&#25918;&#20225;&#19994;&#30340;&#26420;&#32032;&#24773;&#26223;&#65292;&#30456;&#21516;&#30446;&#26631;&#20250;&#23548;&#33268;28&#65285;&#30340;&#22833;&#19994;&#29575;&#21644;33&#65285;&#30340;&#20135;&#20986;&#20943;&#23569;&#12290;&#36825;&#34920;&#26126;&#21487;&#20197;&#20351;&#29992;&#20225;&#19994;&#32423;&#29983;&#20135;&#26041;&#24335;&#26469;&#23454;&#29616;&#33073;&#30899;&#30446;&#26631;&#65292;&#32780;&#19981;&#20250;&#24102;&#26469;&#36807;&#24230;&#30340;&#32463;&#27982;&#25439;&#22833;&#21644;&#22833;&#19994;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2302.08987v2 Announce Type: replace  Abstract: Urgently needed carbon emission reductions might lead to strict command-and-control decarbonization strategies with potentially negative economic consequences. Analyzing the entire firm-level production network of a European economy, we explore how the worst outcomes of such approaches can be avoided. We compare the systemic relevance of every firm with its annual CO2 emissions to identify optimal emission-reducing strategies with a minimum of additional unemployment and economic losses. Setting specific reduction targets we study various decarbonization scenarios and quantify their economic consequences. We show that for an emission-reduction of 20% the most effective strategy leads to losses of about 2% of jobs and 2% of economic output. In contrast, a naive scenario targeting largest emitters first, results in 28% job losses and 33% output reduction for the same target. This demonstrates that it is possible to use firm-level produ
&lt;/p&gt;</description></item><item><title>&#22312;&#20195;&#29702;&#20154;&#20559;&#22909;&#21333;&#23792;&#30340;&#24773;&#20917;&#19979;&#65292;&#19981;&#26126;&#26174;&#21487;&#25805;&#32437;&#30340;&#20998;&#37197;&#35268;&#21017;&#65288;NOM&#65289;&#33021;&#25551;&#36848;&#20182;&#20204;&#30340;&#25112;&#30053;&#34892;&#20026;&#65292;&#24182;&#19988;&#21487;&#20197;&#28385;&#36275;&#25928;&#29575;&#12289;&#26368;&#23567;&#20844;&#24179;&#26465;&#20214;&#12290;&#36825;&#20123;&#35268;&#21017;&#22312;&#28385;&#36275;&#20195;&#29702;&#20154;&#30340;&#23792;&#20540;&#38656;&#27714;&#30340;&#24773;&#20917;&#19979;&#65292;&#25353;&#20171;&#20110;&#24179;&#31561;&#20998;&#37197;&#21644;&#23792;&#20540;&#20043;&#38388;&#30340;&#37329;&#39069;&#36827;&#34892;&#20998;&#37197;&#12290;&#27492;&#22806;&#65292;&#21333;&#24179;&#21488;&#22495;&#26159;&#36825;&#20123;&#35268;&#21017;&#30340;&#26368;&#22823;&#29305;&#24449;&#22495;&#12290;</title><link>http://arxiv.org/abs/2309.06546</link><description>&lt;p&gt;
&#19981;&#26126;&#26174;&#21487;&#25805;&#32437;&#30340;&#20998;&#37197;&#35268;&#21017;
&lt;/p&gt;
&lt;p&gt;
Not obviously manipulable allotment rules. (arXiv:2309.06546v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.06546
&lt;/p&gt;
&lt;p&gt;
&#22312;&#20195;&#29702;&#20154;&#20559;&#22909;&#21333;&#23792;&#30340;&#24773;&#20917;&#19979;&#65292;&#19981;&#26126;&#26174;&#21487;&#25805;&#32437;&#30340;&#20998;&#37197;&#35268;&#21017;&#65288;NOM&#65289;&#33021;&#25551;&#36848;&#20182;&#20204;&#30340;&#25112;&#30053;&#34892;&#20026;&#65292;&#24182;&#19988;&#21487;&#20197;&#28385;&#36275;&#25928;&#29575;&#12289;&#26368;&#23567;&#20844;&#24179;&#26465;&#20214;&#12290;&#36825;&#20123;&#35268;&#21017;&#22312;&#28385;&#36275;&#20195;&#29702;&#20154;&#30340;&#23792;&#20540;&#38656;&#27714;&#30340;&#24773;&#20917;&#19979;&#65292;&#25353;&#20171;&#20110;&#24179;&#31561;&#20998;&#37197;&#21644;&#23792;&#20540;&#20043;&#38388;&#30340;&#37329;&#39069;&#36827;&#34892;&#20998;&#37197;&#12290;&#27492;&#22806;&#65292;&#21333;&#24179;&#21488;&#22495;&#26159;&#36825;&#20123;&#35268;&#21017;&#30340;&#26368;&#22823;&#29305;&#24449;&#22495;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#23558;&#21333;&#20010;&#38750;&#21487;&#28040;&#32791;&#21830;&#21697;&#20998;&#37197;&#32473;&#20559;&#22909;&#21333;&#23792;&#30340;&#20195;&#29702;&#20154;&#38382;&#39064;&#20013;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#19968;&#31181;&#34987;&#31216;&#20026;&#19981;&#26126;&#26174;&#21487;&#25805;&#32437;&#65288;NOM&#65289;&#30340;&#31574;&#30053;&#26080;&#25928;&#24615;&#30340;&#24369;&#21270;&#24418;&#24335;&#12290;&#22914;&#26524;&#20195;&#29702;&#20154;&#35748;&#30693;&#33021;&#21147;&#26377;&#38480;&#65292;&#21017;NOM&#36275;&#20197;&#25551;&#36848;&#20182;&#20204;&#30340;&#25112;&#30053;&#34892;&#20026;&#12290;&#25105;&#20204;&#23545;&#19968;&#22823;&#31867;&#28385;&#36275;&#25928;&#29575;&#12289;NOM&#21644;&#26368;&#23567;&#20844;&#24179;&#26465;&#20214;&#30340;&#20165;&#20855;&#21333;&#23792;&#29305;&#28857;&#30340;&#35268;&#21017;&#36827;&#34892;&#20102;&#29305;&#24449;&#21270;&#65292;&#31216;&#20043;&#20026;&#8220;&#31616;&#21333;&#8221;&#35268;&#21017;&#12290;&#22312;&#23384;&#22312;&#36807;&#21097;&#38656;&#27714;&#30340;&#32463;&#27982;&#20013;&#65292;&#31616;&#21333;&#35268;&#21017;&#23436;&#20840;&#28385;&#36275;&#23792;&#20540;&#23569;&#20110;&#25110;&#31561;&#20110;&#24179;&#31561;&#20998;&#37197;&#30340;&#20195;&#29702;&#20154;&#65292;&#24182;&#21521;&#27599;&#20010;&#21097;&#20313;&#20195;&#29702;&#20154;&#20998;&#37197;&#20171;&#20110;&#24179;&#31561;&#20998;&#37197;&#21644;&#20854;&#23792;&#20540;&#20043;&#38388;&#30340;&#37329;&#39069;&#12290;&#22312;&#23384;&#22312;&#36807;&#21097;&#20379;&#24212;&#30340;&#32463;&#27982;&#20013;&#65292;&#31616;&#21333;&#35268;&#21017;&#23545;&#31216;&#23450;&#20041;&#12290;&#25105;&#20204;&#36824;&#35777;&#26126;&#20102;&#21333;&#24179;&#21488;&#22495;&#26159;&#31616;&#21333;&#35268;&#21017;&#29305;&#24449;&#23646;&#24615;&#30340;&#26368;&#22823;&#22495;&#12290;&#22240;&#27492;&#65292;&#34429;&#28982;&#23558;&#31574;&#30053;&#26080;&#25928;&#24615;&#26367;&#25442;&#20026;NOM&#22823;&#22823;&#25193;&#23637;&#20102;&#21487;&#25509;&#21463;&#35268;&#21017;&#30340;&#33539;&#22260;&#65292;&#20294;&#25152;&#28041;&#21450;&#30340;&#20559;&#22909;&#30340;&#26368;&#22823;&#22495;&#22522;&#26412;&#20445;&#25345;&#19981;&#21464;&#12290;
&lt;/p&gt;
&lt;p&gt;
In the problem of allocating a single non-disposable commodity among agents whose preferences are single-peaked, we study a weakening of strategy-proofness called not obvious manipulability (NOM). If agents are cognitively limited, then NOM is sufficient to describe their strategic behavior. We characterize a large family of own-peak-only rules that satisfy efficiency, NOM, and a minimal fairness condition. We call these rules "simple". In economies with excess demand, simple rules fully satiate agents whose peak amount is less than or equal to equal division and assign, to each remaining agent, an amount between equal division and his peak. In economies with excess supply, simple rules are defined symmetrically. We also show that the single-plateaued domain is maximal for the characterizing properties of simple rules. Therefore, even though replacing strategy-proofness with NOM greatly expands the family of admissible rules, the maximal domain of preferences involved remains basically
&lt;/p&gt;</description></item><item><title>&#35813;&#30740;&#31350;&#25506;&#35752;&#20102;&#20849;&#20139;&#32852;&#21512;&#30740;&#31350;&#30340;&#36129;&#29486;&#65292;&#21457;&#29616;&#31616;&#21333;&#30340;&#21512;&#21516;&#20998;&#37197;&#21644;&#20165;&#22312;&#31361;&#30772;&#26102;&#21512;&#21516;&#21270;&#21162;&#21147;&#21487;&#20197;&#24674;&#22797;&#25928;&#29575;&#12290;</title><link>http://arxiv.org/abs/2307.12104</link><description>&lt;p&gt;
&#20849;&#20139;&#32852;&#21512;&#30740;&#31350;&#30340;&#36129;&#29486;
&lt;/p&gt;
&lt;p&gt;
Sharing Credit for Joint Research. (arXiv:2307.12104v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.12104
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#25506;&#35752;&#20102;&#20849;&#20139;&#32852;&#21512;&#30740;&#31350;&#30340;&#36129;&#29486;&#65292;&#21457;&#29616;&#31616;&#21333;&#30340;&#21512;&#21516;&#20998;&#37197;&#21644;&#20165;&#22312;&#31361;&#30772;&#26102;&#21512;&#21516;&#21270;&#21162;&#21147;&#21487;&#20197;&#24674;&#22797;&#25928;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#32771;&#34385;&#20102;&#19968;&#20010;&#25112;&#30053;&#23454;&#39564;&#27169;&#22411;&#65292;&#20195;&#29702;&#20154;&#21442;&#19982;&#20855;&#26377;&#22238;&#25253;&#22806;&#37096;&#24615;&#30340;&#39118;&#38505;&#30740;&#31350;&#65307;&#31361;&#30772;&#24615;&#30340;&#25104;&#26524;&#20351;&#24471;&#21457;&#29616;&#32773;&#65288;&#36194;&#23478;&#65289;&#19982;&#26410;&#21457;&#29616;&#32773;&#65288;&#36755;&#23478;&#65289;&#33719;&#24471;&#19981;&#21516;&#30340;&#22238;&#25253;&#12290;&#25105;&#23545;&#26368;&#20248;&#35299;&#36827;&#34892;&#20102;&#25551;&#36848;&#65292;&#24182;&#35777;&#26126;&#20102;&#38750;&#21512;&#20316;&#21338;&#24328;&#36890;&#24120;&#26159;&#20302;&#25928;&#30340;&#12290;&#31616;&#21333;&#30340;&#21512;&#21516;&#23558;&#36194;&#23478;&#21644;&#36755;&#23478;&#20043;&#38388;&#30340;&#22238;&#25253;&#20998;&#37197;&#36827;&#34892;&#20849;&#20139;&#65292;&#21363;&#20351;&#34892;&#21160;&#19981;&#21487;&#35266;&#27979;&#65292;&#20063;&#33021;&#24674;&#22797;&#25928;&#29575;&#12290;&#21478;&#19968;&#26041;&#38754;&#65292;&#22914;&#26524;&#36194;&#23478;&#30340;&#36523;&#20221;&#26080;&#27861;&#21512;&#21516;&#21270;&#65292;&#22312;&#31361;&#30772;&#26102;&#20165;&#23545;&#21162;&#21147;&#36827;&#34892;&#21512;&#21516;&#21270;&#20063;&#33021;&#24674;&#22797;&#25928;&#29575;&#12290;&#36825;&#20123;&#32467;&#26524;&#34920;&#26126;&#65292;&#23613;&#31649;&#25112;&#30053;&#23454;&#39564;&#36890;&#24120;&#23548;&#33268;&#20302;&#25928;&#65292;&#20294;&#20849;&#20139;&#36129;&#29486;&#26159;&#19968;&#31181;&#31283;&#20581;&#19988;&#26377;&#25928;&#30340;&#35299;&#20915;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
I consider a model of strategic experimentation where agents partake in risky research with payoff externalities; a breakthrough grants the discoverer (winner) a different payoff than the non-discoverers (losers). I characterize the first-best solution and show that the noncooperative game is generically inefficient. Simple contracts sharing payoffs between winner and losers restore efficiency, even when actions are unobserved. Alternatively, if the winner's identity is not contractible, contracting on effort only at the time of breakthrough also restores efficiency. These results suggest that although strategic experimentation generically entails inefficiency, sharing credit is a robust and effective remedy.
&lt;/p&gt;</description></item><item><title>&#24403;&#32463;&#27982;&#22686;&#38271;&#30340;&#38271;&#26399;&#22686;&#38271;&#29575;&#27604;&#32929;&#24687;&#22686;&#38271;&#24555;&#19988;&#38271;&#26399;&#26080;&#27873;&#27819;&#30340;&#21033;&#29575;&#20302;&#20110;&#32929;&#24687;&#22686;&#38271;&#26102;&#65292;&#36164;&#20135;&#20215;&#26684;&#27873;&#27819;&#26159;&#24517;&#35201;&#30340;&#12290;</title><link>http://arxiv.org/abs/2305.08268</link><description>&lt;p&gt;
&#27873;&#27819;&#24517;&#35201;&#24615;&#23450;&#29702;&#12290;
&lt;/p&gt;
&lt;p&gt;
Bubble Necessity Theorem. (arXiv:2305.08268v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.08268
&lt;/p&gt;
&lt;p&gt;
&#24403;&#32463;&#27982;&#22686;&#38271;&#30340;&#38271;&#26399;&#22686;&#38271;&#29575;&#27604;&#32929;&#24687;&#22686;&#38271;&#24555;&#19988;&#38271;&#26399;&#26080;&#27873;&#27819;&#30340;&#21033;&#29575;&#20302;&#20110;&#32929;&#24687;&#22686;&#38271;&#26102;&#65292;&#36164;&#20135;&#20215;&#26684;&#27873;&#27819;&#26159;&#24517;&#35201;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36164;&#20135;&#20215;&#26684;&#27873;&#27819;&#26159;&#25351;&#36164;&#20135;&#20215;&#26684;&#36229;&#36807;&#20197;&#32929;&#24687;&#29616;&#20540;&#23450;&#20041;&#30340;&#22522;&#26412;&#20215;&#20540;&#30340;&#24773;&#20917;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#27010;&#24565;&#19978;&#20840;&#26032;&#30340;&#23545;&#27873;&#27819;&#30340;&#35270;&#35282;&#65306;&#36164;&#20135;&#20215;&#26684;&#27873;&#27819;&#30340;&#24517;&#35201;&#24615;&#12290;&#25105;&#20204;&#22312;&#19968;&#20010;&#27604;&#36739;&#24120;&#35265;&#30340;&#32463;&#27982;&#27169;&#22411;&#31867;&#20013;&#24314;&#31435;&#20102;&#27873;&#27819;&#24517;&#35201;&#24615;&#23450;&#29702;&#65306;&#22312;&#32463;&#27982;&#22686;&#38271;&#30340;&#38271;&#26399;&#22686;&#38271;&#29575;&#65288;$G$&#65289;&#27604;&#32929;&#24687;&#22686;&#38271;&#65288;$G_d$&#65289;&#24555;&#32780;&#38271;&#26399;&#26080;&#27873;&#27819;&#30340;&#21033;&#29575;&#65288;$R$&#65289;&#20302;&#20110;&#32929;&#24687;&#22686;&#38271;&#30340;&#24773;&#20917;&#19979;&#65292;&#23384;&#22312;&#22343;&#34913;&#20294;&#19981;&#23384;&#22312;&#22522;&#26412;&#22343;&#34913;&#25110;&#32773;&#28176;&#36817;&#26080;&#27873;&#27819;&#22343;&#34913;&#12290;$R&lt;G_d&lt;G$&#30340;&#24517;&#35201;&#26465;&#20214;&#22312;&#19981;&#22343;&#21248;&#30340;&#29983;&#20135;&#29575;&#22686;&#38271;&#21644;&#36275;&#22815;&#39640;&#30340;&#20648;&#33988;&#21160;&#26426;&#30340;&#27169;&#22411;&#20013;&#33258;&#28982;&#32780;&#28982;&#22320;&#20986;&#29616;&#12290;
&lt;/p&gt;
&lt;p&gt;
Asset price bubbles are situations where asset prices exceed the fundamental values defined by the present value of dividends. This paper presents a conceptually new perspective on bubbles: the necessity of asset price bubbles. We establish the Bubble Necessity Theorem in a plausible general class of economic models: in economies with faster long run economic growth ($G$) than dividend growth ($G_d$) and long run bubbleless interest rate ($R$) below dividend growth, equilibria exist but none of them are fundamental or asymptotically bubbleless. The necessity condition $R&lt;G_d&lt;G$ naturally arises in models with uneven productivity growth and a sufficiently high savings motive.
&lt;/p&gt;</description></item><item><title>&#25293;&#21334;&#27169;&#22411;&#20026;&#25968;&#23383;&#24191;&#21578;&#25552;&#20379;&#20102;&#25968;&#25454;&#22686;&#24378;&#30340;&#31454;&#26631;&#26426;&#21046;&#65292;&#21516;&#26102;&#25176;&#31649;&#27963;&#21160;&#26426;&#21046;&#26377;&#21161;&#20110;&#20248;&#21270;&#24191;&#21578;&#37197;&#32622;&#12290;&#24179;&#21488;&#19978;&#30340;&#31038;&#20250;&#26377;&#25928;&#37197;&#32622;&#20250;&#24433;&#21709;&#24191;&#21578;&#20027;&#22312;&#24179;&#21488;&#22806;&#30340;&#20135;&#21697;&#20215;&#26684;&#65292;&#23548;&#33268;&#24179;&#21488;&#22806;&#30340;&#20998;&#37197;&#25928;&#29575;&#20302;&#19979;&#12290;</title><link>http://arxiv.org/abs/2304.08432</link><description>&lt;p&gt;
&#25968;&#23383;&#24191;&#21578;&#30340;&#25176;&#31649;&#27963;&#21160;&#21644;&#25968;&#25454;&#22686;&#24378;&#25293;&#21334;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
Managed Campaigns and Data-Augmented Auctions for Digital Advertising. (arXiv:2304.08432v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.08432
&lt;/p&gt;
&lt;p&gt;
&#25293;&#21334;&#27169;&#22411;&#20026;&#25968;&#23383;&#24191;&#21578;&#25552;&#20379;&#20102;&#25968;&#25454;&#22686;&#24378;&#30340;&#31454;&#26631;&#26426;&#21046;&#65292;&#21516;&#26102;&#25176;&#31649;&#27963;&#21160;&#26426;&#21046;&#26377;&#21161;&#20110;&#20248;&#21270;&#24191;&#21578;&#37197;&#32622;&#12290;&#24179;&#21488;&#19978;&#30340;&#31038;&#20250;&#26377;&#25928;&#37197;&#32622;&#20250;&#24433;&#21709;&#24191;&#21578;&#20027;&#22312;&#24179;&#21488;&#22806;&#30340;&#20135;&#21697;&#20215;&#26684;&#65292;&#23548;&#33268;&#24179;&#21488;&#22806;&#30340;&#20998;&#37197;&#25928;&#29575;&#20302;&#19979;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#38024;&#23545;&#25968;&#23383;&#24191;&#21578;&#24320;&#21457;&#20102;&#25293;&#21334;&#27169;&#22411;&#12290;&#22404;&#26029;&#24179;&#21488;&#20855;&#26377;&#24191;&#21578;&#20027;&#21644;&#28040;&#36153;&#32773;&#20043;&#38388;&#21305;&#37197;&#20215;&#20540;&#30340;&#25968;&#25454;&#12290;&#24179;&#21488;&#25903;&#25345;&#21033;&#29992;&#39069;&#22806;&#20449;&#24687;&#36827;&#34892;&#31454;&#26631;&#65292;&#20174;&#32780;&#22686;&#21152;&#24179;&#21488;&#20869;&#21305;&#37197;&#30340;&#21487;&#34892;&#21097;&#20313;&#12290;&#24191;&#21578;&#20027;&#20849;&#21516;&#20915;&#23450;&#20854;&#22312;&#24179;&#21488;&#19978;&#21644;&#24179;&#21488;&#22806;&#30340;&#23450;&#20215;&#31574;&#30053;&#65292;&#20197;&#21450;&#20182;&#20204;&#22312;&#24179;&#21488;&#19978;&#36827;&#34892;&#25968;&#23383;&#24191;&#21578;&#30340;&#31454;&#26631;&#12290;&#25105;&#20204;&#27604;&#36739;&#20102;&#25968;&#25454;&#22686;&#24378;&#30340;&#20108;&#20215;&#25293;&#21334;&#21644;&#25176;&#31649;&#27963;&#21160;&#26426;&#21046;&#12290;&#22312;&#25968;&#25454;&#22686;&#24378;&#30340;&#25293;&#21334;&#20013;&#65292;&#24191;&#21578;&#20027;&#30340;&#31454;&#26631;&#21463;&#21040;&#24179;&#21488;&#21305;&#37197;&#20215;&#20540;&#25968;&#25454;&#30340;&#24433;&#21709;&#12290;&#36825;&#23548;&#33268;&#20102;&#24179;&#21488;&#19978;&#30340;&#31038;&#20250;&#26377;&#25928;&#37197;&#32622;&#65292;&#20294;&#24191;&#21578;&#20027;&#20250;&#25552;&#39640;&#20854;&#22312;&#24179;&#21488;&#22806;&#30340;&#20135;&#21697;&#20215;&#26684;&#65292;&#20197;&#22312;&#24179;&#21488;&#19978;&#26356;&#20855;&#31454;&#20105;&#21147;&#12290;&#22240;&#27492;&#65292;&#30001;&#20110;&#20135;&#21697;&#20215;&#26684;&#36807;&#39640;&#65292;&#24179;&#21488;&#22806;&#30340;&#20998;&#37197;&#25928;&#29575;&#19981;&#39640;&#12290;&#25176;&#31649;&#27963;&#21160;&#26426;&#21046;&#20801;&#35768;&#24191;&#21578;&#20027;&#25552;&#20132;&#39044;&#31639;&#65292;&#28982;&#21518;&#36716;&#31227;
&lt;/p&gt;
&lt;p&gt;
We develop an auction model for digital advertising. A monopoly platform has access to data on the value of the match between advertisers and consumers. The platform support bidding with additional information and increase the feasible surplus for on-platform matches. Advertisers jointly determine their pricing strategy both on and off the platform, as well as their bidding for digital advertising on the platform. We compare a data-augmented second-price auction and a managed campaign mechanism. In the data-augmented auction, the bids by the advertisers are informed by the data of the platform regarding the value of the match. This results in a socially efficient allocation on the platform, but the advertisers increase their product prices off the platform to be more competitive on the platform. In consequence, the allocation off the platform is inefficient due to excessively high product prices. The managed campaign mechanism allows advertisers to submit budgets that are then transfor
&lt;/p&gt;</description></item></channel></rss>