<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#25552;&#20986;&#20102;&#36866;&#29992;&#20110;&#21307;&#30103;&#20445;&#20581;&#25104;&#26412;&#25928;&#30410;&#20998;&#26512;&#30340;&#22810;&#20803;&#36125;&#21494;&#26031;&#21487;&#21152;&#22238;&#24402;&#26641;&#25193;&#23637;&#65292;&#20811;&#26381;&#20102;&#29616;&#26377;&#27169;&#22411;&#30340;&#23616;&#38480;&#24615;&#65292;&#21487;&#20197;&#22788;&#29702;&#22810;&#20010;&#30456;&#20851;&#32467;&#26524;&#21464;&#37327;&#30340;&#22238;&#24402;&#21644;&#20998;&#31867;&#20998;&#26512;</title><link>https://arxiv.org/abs/2404.02228</link><description>&lt;p&gt;
&#22522;&#20110;&#36125;&#21494;&#26031;&#21487;&#21152;&#22238;&#24402;&#26641;&#30340;&#21307;&#30103;&#20445;&#20581;&#25104;&#26412;&#25928;&#30410;&#20998;&#26512;
&lt;/p&gt;
&lt;p&gt;
Seemingly unrelated Bayesian additive regression trees for cost-effectiveness analyses in healthcare
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2404.02228
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#36866;&#29992;&#20110;&#21307;&#30103;&#20445;&#20581;&#25104;&#26412;&#25928;&#30410;&#20998;&#26512;&#30340;&#22810;&#20803;&#36125;&#21494;&#26031;&#21487;&#21152;&#22238;&#24402;&#26641;&#25193;&#23637;&#65292;&#20811;&#26381;&#20102;&#29616;&#26377;&#27169;&#22411;&#30340;&#23616;&#38480;&#24615;&#65292;&#21487;&#20197;&#22788;&#29702;&#22810;&#20010;&#30456;&#20851;&#32467;&#26524;&#21464;&#37327;&#30340;&#22238;&#24402;&#21644;&#20998;&#31867;&#20998;&#26512;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36817;&#24180;&#26469;&#30340;&#29702;&#35770;&#32467;&#26524;&#21644;&#27169;&#25311;&#35777;&#25454;&#34920;&#26126;&#65292;&#36125;&#21494;&#26031;&#21487;&#21152;&#22238;&#24402;&#26641;&#26159;&#19968;&#31181;&#38750;&#24120;&#26377;&#25928;&#30340;&#38750;&#21442;&#25968;&#22238;&#24402;&#26041;&#27861;&#12290;&#21463;&#21040;&#22312;&#21355;&#29983;&#32463;&#27982;&#23398;&#20013;&#30340;&#25104;&#26412;&#25928;&#30410;&#20998;&#26512;&#30340;&#21551;&#21457;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#36866;&#29992;&#20110;&#20855;&#26377;&#22810;&#20010;&#30456;&#20851;&#32467;&#26524;&#21464;&#37327;&#30340;&#22238;&#24402;&#21644;&#20998;&#31867;&#20998;&#26512;&#30340;BART&#30340;&#22810;&#20803;&#25193;&#23637;&#12290;&#25105;&#20204;&#30340;&#26694;&#26550;&#36890;&#36807;&#20801;&#35768;&#27599;&#20010;&#20010;&#20307;&#21709;&#24212;&#19982;&#19981;&#21516;&#26641;&#32452;&#30456;&#20851;&#32852;&#65292;&#21516;&#26102;&#22788;&#29702;&#32467;&#26524;&#20043;&#38388;&#30340;&#20381;&#36182;&#20851;&#31995;&#65292;&#20811;&#26381;&#20102;&#29616;&#26377;&#22810;&#20803;BART&#27169;&#22411;&#30340;&#19968;&#20123;&#20027;&#35201;&#23616;&#38480;&#24615;&#12290;&#22312;&#36830;&#32493;&#32467;&#26524;&#30340;&#24773;&#20917;&#19979;&#65292;&#25105;&#20204;&#30340;&#27169;&#22411;&#26412;&#36136;&#19978;&#26159;&#34920;&#38754;&#26080;&#20851;&#22238;&#24402;&#30340;&#38750;&#21442;&#25968;&#29256;&#26412;&#12290;&#21516;&#26679;&#65292;&#25105;&#20204;&#38024;&#23545;&#20108;&#20803;&#32467;&#26524;&#30340;&#24314;&#35758;&#26159;&#38750;&#21442;&#25968;&#27010;&#25324;
&lt;/p&gt;
&lt;p&gt;
arXiv:2404.02228v1 Announce Type: cross  Abstract: In recent years, theoretical results and simulation evidence have shown Bayesian additive regression trees to be a highly-effective method for nonparametric regression. Motivated by cost-effectiveness analyses in health economics, where interest lies in jointly modelling the costs of healthcare treatments and the associated health-related quality of life experienced by a patient, we propose a multivariate extension of BART applicable in regression and classification analyses with several correlated outcome variables. Our framework overcomes some key limitations of existing multivariate BART models by allowing each individual response to be associated with different ensembles of trees, while still handling dependencies between the outcomes. In the case of continuous outcomes, our model is essentially a nonparametric version of seemingly unrelated regression. Likewise, our proposal for binary outcomes is a nonparametric generalisation of
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#20998;&#26512;&#20102;&#23545;&#31216;&#31867;&#22411;&#20998;&#24067;&#19979;&#30340;&#22810;&#20154;&#28040;&#32791;&#25112;&#21338;&#24328;&#65292;&#22312;&#21807;&#19968;&#22343;&#34913;&#20013;&#21457;&#29616;&#19981;&#23545;&#31216;&#24615;&#23548;&#33268;&#21442;&#19982;&#32773;&#20998;&#23618;&#34892;&#20026;&#27169;&#24335;&#12290;&#21442;&#19982;&#32773;&#30340;&#32784;&#24515;&#24230;&#12289;&#25552;&#20379;&#25104;&#26412;&#21644;&#20272;&#20540;&#20250;&#24433;&#21709;&#29289;&#21697;&#25552;&#20379;&#30340;&#36895;&#24230;&#12290;&#36890;&#36807;&#25511;&#21046;&#26368;&#24378;&#31867;&#22411;&#21487;&#20197;&#35843;&#33410;&#19981;&#23545;&#31216;&#24615;&#30340;&#25928;&#26524;&#12290;</title><link>http://arxiv.org/abs/2302.09427</link><description>&lt;p&gt;
&#23545;&#31216;&#31169;&#20154;&#20449;&#24687;&#19979;&#30340;&#22810;&#20154;&#28040;&#32791;&#25112;&#20998;&#26512;
&lt;/p&gt;
&lt;p&gt;
Multiplayer War of Attrition with Asymmetric Private Information. (arXiv:2302.09427v2 [econ.TH] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2302.09427
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20998;&#26512;&#20102;&#23545;&#31216;&#31867;&#22411;&#20998;&#24067;&#19979;&#30340;&#22810;&#20154;&#28040;&#32791;&#25112;&#21338;&#24328;&#65292;&#22312;&#21807;&#19968;&#22343;&#34913;&#20013;&#21457;&#29616;&#19981;&#23545;&#31216;&#24615;&#23548;&#33268;&#21442;&#19982;&#32773;&#20998;&#23618;&#34892;&#20026;&#27169;&#24335;&#12290;&#21442;&#19982;&#32773;&#30340;&#32784;&#24515;&#24230;&#12289;&#25552;&#20379;&#25104;&#26412;&#21644;&#20272;&#20540;&#20250;&#24433;&#21709;&#29289;&#21697;&#25552;&#20379;&#30340;&#36895;&#24230;&#12290;&#36890;&#36807;&#25511;&#21046;&#26368;&#24378;&#31867;&#22411;&#21487;&#20197;&#35843;&#33410;&#19981;&#23545;&#31216;&#24615;&#30340;&#25928;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20998;&#26512;&#20102;&#23545;&#31216;&#31867;&#22411;&#20998;&#24067;&#19979;&#30340;&#22810;&#20154;&#28040;&#32791;&#25112;&#21338;&#24328;&#65292;&#30740;&#31350;&#20102;&#22312;&#25552;&#20379;&#19981;&#21487;&#20998;&#21106;&#30340;&#20844;&#20849;&#29289;&#21697;&#30340;&#31169;&#20154;&#26426;&#21046;&#20013;&#30340;&#23545;&#31216;&#24615;&#12290;&#22312;&#21807;&#19968;&#22343;&#34913;&#20013;&#65292;&#19981;&#23545;&#31216;&#24615;&#23548;&#33268;&#20102;&#19968;&#31181;&#20998;&#23618;&#34892;&#20026;&#27169;&#24335;&#65292;&#20854;&#20013;&#19968;&#20010;&#21442;&#19982;&#32773;&#20197;&#19968;&#23450;&#27010;&#29575;&#31435;&#21363;&#25552;&#20379;&#29289;&#21697;&#65292;&#32780;&#20854;&#20182;&#21442;&#19982;&#32773;&#22312;&#26576;&#20010;&#29305;&#23450;&#26102;&#21051;&#20043;&#21069;&#27809;&#26377;&#25552;&#20379;&#30340;&#27010;&#29575;&#65292;&#24182;&#19988;&#36825;&#20010;&#26102;&#21051;&#23545;&#19981;&#21516;&#30340;&#21442;&#19982;&#32773;&#26159;&#29420;&#29305;&#30340;&#12290;&#27604;&#36739;&#38745;&#24577;&#20998;&#26512;&#34920;&#26126;&#65292;&#32784;&#24515;&#24230;&#26356;&#20302;&#12289;&#25552;&#20379;&#25104;&#26412;&#26356;&#20302;&#12289;&#20272;&#20540;&#26356;&#39640;&#30340;&#21442;&#19982;&#32773;&#33021;&#22815;&#26356;&#24555;&#22320;&#25552;&#20379;&#29289;&#21697;&#12290;&#24310;&#36831;&#25104;&#26412;&#20027;&#35201;&#30001;&#31435;&#21363;&#36864;&#20986;&#21442;&#19982;&#32773;&#30340;&#26368;&#24378;&#31867;&#22411;&#20915;&#23450;&#12290;&#26412;&#25991;&#36824;&#30740;&#31350;&#20102;&#20004;&#31181;&#19981;&#23545;&#31216;&#24615;&#30340;&#21464;&#21270;&#65306;&#25552;&#21319;&#26368;&#24378;&#31867;&#22411;&#20542;&#21521;&#20110;&#25552;&#39640;&#25928;&#29575;&#65292;&#32780;&#25511;&#21046;&#26368;&#24378;&#31867;&#22411;&#19982;&#23545;&#31216;&#24615;&#25104;&#26412;&#30340;&#31526;&#21495;&#30456;&#20851;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper analyzes a multiplayer war of attrition game with asymmetric type distributions in the setting of private provision of an indivisible public good. In the unique equilibrium, asymmetry leads to a stratified behavior pattern where one agent provides the good instantly with a positive probability, while each of the others has no probability of provision before a certain moment and this moment is idiosyncratic for different agents. Comparative statics show that an agent with less patience, lower cost of provision, and higher reputation in valuation provides the good uniformly faster. The cost of delay is mainly determined by the strongest type of the instant-exit agent. This paper investigates two types of variations of asymmetry: raising the strongest type tends to improve efficiency, whereas controlling the strongest type associates the effect of asymmetry with the sign of an intuitive measure of ``the cost of symmetry".
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#21322;&#20840;&#29699;&#26694;&#26550;&#65292;&#29992;&#20110;&#25913;&#36827;&#36125;&#21494;&#26031;VAR&#27169;&#22411;&#30340;&#39044;&#27979;&#24615;&#33021;&#12290;&#35813;&#26694;&#26550;&#26367;&#20195;&#20102;&#20256;&#32479;&#30340;&#20840;&#23616;&#32553;&#20943;&#21442;&#25968;&#65292;&#20351;&#29992;&#32452;&#21035;&#29305;&#23450;&#30340;&#32553;&#20943;&#21442;&#25968;&#12290;&#36890;&#36807;&#24191;&#27867;&#30340;&#27169;&#25311;&#30740;&#31350;&#21644;&#23454;&#35777;&#24212;&#29992;&#65292;&#23637;&#31034;&#20102;&#35813;&#26694;&#26550;&#30340;&#20248;&#28857;&#12290;&#22312;&#31232;&#30095;/&#23494;&#38598;&#20808;&#39564;&#19979;&#65292;&#39044;&#27979;&#24615;&#33021;&#22240;&#35780;&#20272;&#30340;&#32463;&#27982;&#21464;&#37327;&#21644;&#26102;&#38388;&#26694;&#26550;&#32780;&#24322;&#65292;&#20294;&#21160;&#24577;&#27169;&#22411;&#24179;&#22343;&#27861;&#21487;&#20197;&#32531;&#35299;&#36825;&#20010;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2206.04902</link><description>&lt;p&gt;
&#29992;&#36125;&#21494;&#26031;VAR&#27169;&#22411;&#39044;&#27979;&#23439;&#35266;&#32463;&#27982;&#25968;&#25454;&#65306;&#31232;&#30095;&#36824;&#26159;&#23494;&#38598;&#65311;&#35201;&#30475;&#24773;&#20917;&#65281;
&lt;/p&gt;
&lt;p&gt;
Forecasting macroeconomic data with Bayesian VARs: Sparse or dense? It depends!. (arXiv:2206.04902v3 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2206.04902
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#21322;&#20840;&#29699;&#26694;&#26550;&#65292;&#29992;&#20110;&#25913;&#36827;&#36125;&#21494;&#26031;VAR&#27169;&#22411;&#30340;&#39044;&#27979;&#24615;&#33021;&#12290;&#35813;&#26694;&#26550;&#26367;&#20195;&#20102;&#20256;&#32479;&#30340;&#20840;&#23616;&#32553;&#20943;&#21442;&#25968;&#65292;&#20351;&#29992;&#32452;&#21035;&#29305;&#23450;&#30340;&#32553;&#20943;&#21442;&#25968;&#12290;&#36890;&#36807;&#24191;&#27867;&#30340;&#27169;&#25311;&#30740;&#31350;&#21644;&#23454;&#35777;&#24212;&#29992;&#65292;&#23637;&#31034;&#20102;&#35813;&#26694;&#26550;&#30340;&#20248;&#28857;&#12290;&#22312;&#31232;&#30095;/&#23494;&#38598;&#20808;&#39564;&#19979;&#65292;&#39044;&#27979;&#24615;&#33021;&#22240;&#35780;&#20272;&#30340;&#32463;&#27982;&#21464;&#37327;&#21644;&#26102;&#38388;&#26694;&#26550;&#32780;&#24322;&#65292;&#20294;&#21160;&#24577;&#27169;&#22411;&#24179;&#22343;&#27861;&#21487;&#20197;&#32531;&#35299;&#36825;&#20010;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#24314;&#27169;&#21644;&#39044;&#27979;&#23439;&#35266;&#32463;&#27982;&#21464;&#37327;&#26102;&#65292;&#21521;&#37327;&#33258;&#22238;&#24402;&#27169;&#22411;&#65288;VARs&#65289;&#34987;&#24191;&#27867;&#24212;&#29992;&#12290;&#28982;&#32780;&#65292;&#22312;&#39640;&#32500;&#24773;&#20917;&#19979;&#65292;&#23427;&#20204;&#23481;&#26131;&#20986;&#29616;&#36807;&#25311;&#21512;&#38382;&#39064;&#12290;&#36125;&#21494;&#26031;&#26041;&#27861;&#65292;&#20855;&#20307;&#32780;&#35328;&#26159;&#32553;&#20943;&#20808;&#39564;&#26041;&#27861;&#65292;&#24050;&#32463;&#26174;&#31034;&#20986;&#22312;&#25552;&#39640;&#39044;&#27979;&#24615;&#33021;&#26041;&#38754;&#21462;&#24471;&#20102;&#25104;&#21151;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#21322;&#20840;&#29699;&#26694;&#26550;&#65292;&#20854;&#20013;&#25105;&#20204;&#29992;&#29305;&#23450;&#32452;&#21035;&#30340;&#32553;&#20943;&#21442;&#25968;&#26367;&#20195;&#20102;&#20256;&#32479;&#30340;&#20840;&#23616;&#32553;&#20943;&#21442;&#25968;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#22914;&#20309;&#23558;&#27492;&#26694;&#26550;&#24212;&#29992;&#20110;&#21508;&#31181;&#32553;&#20943;&#20808;&#39564;&#65292;&#22914;&#20840;&#23616;-&#23616;&#37096;&#20808;&#39564;&#21644;&#38543;&#26426;&#25628;&#32034;&#21464;&#37327;&#36873;&#25321;&#20808;&#39564;&#12290;&#25105;&#20204;&#36890;&#36807;&#24191;&#27867;&#30340;&#27169;&#25311;&#30740;&#31350;&#21644;&#23545;&#32654;&#22269;&#32463;&#27982;&#25968;&#25454;&#36827;&#34892;&#30340;&#23454;&#35777;&#24212;&#29992;&#65292;&#23637;&#31034;&#20102;&#25152;&#25552;&#20986;&#30340;&#26694;&#26550;&#30340;&#20248;&#28857;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#23545;&#27491;&#22312;&#36827;&#34892;&#30340;"&#31232;&#30095;&#20551;&#35937;"&#36777;&#35770;&#36827;&#34892;&#20102;&#26356;&#28145;&#20837;&#30340;&#25506;&#35752;&#65292;&#21457;&#29616;&#22312;&#31232;&#30095;/&#23494;&#38598;&#20808;&#39564;&#19979;&#30340;&#39044;&#27979;&#24615;&#33021;&#22312;&#35780;&#20272;&#30340;&#32463;&#27982;&#21464;&#37327;&#21644;&#26102;&#38388;&#26694;&#26550;&#20013;&#21464;&#21270;&#24456;&#22823;&#12290;&#28982;&#32780;&#65292;&#21160;&#24577;&#27169;&#22411;&#24179;&#22343;&#27861;&#21487;&#20197;&#32531;&#35299;&#36825;&#20010;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;
Vectorautogressions (VARs) are widely applied when it comes to modeling and forecasting macroeconomic variables. In high dimensions, however, they are prone to overfitting. Bayesian methods, more concretely shrinking priors, have shown to be successful in improving prediction performance. In the present paper, we introduce the semi-global framework, in which we replace the traditional global shrinkage parameter with group-specific shrinkage parameters. We show how this framework can be applied to various shrinking priors, such as global-local priors and stochastic search variable selection priors. We demonstrate the virtues of the proposed framework in an extensive simulation study and in an empirical application forecasting data of the US economy. Further, we shed more light on the ongoing ``Illusion of Sparsity'' debate, finding that forecasting performances under sparse/dense priors vary across evaluated economic variables and across time frames. Dynamic model averaging, however, ca
&lt;/p&gt;</description></item></channel></rss>