<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#36882;&#24402;&#20559;&#22909;&#21644;&#19981;&#30830;&#23450;&#24615;&#24577;&#24230;&#65292;&#24182;&#24471;&#20986;&#32467;&#35770;&#65292;&#22312;&#36328;&#26102;&#38388;&#28040;&#36153;&#36873;&#25321;&#38382;&#39064;&#20013;&#65292;&#36882;&#24402;&#20559;&#22909;&#24635;&#26159;&#24120;&#25968;&#32477;&#23545;&#27169;&#31946;&#35268;&#36991;&#65292;&#21516;&#26102;&#25552;&#20986;&#20102;&#24191;&#20041;&#38271;&#26041;&#24418;&#30340;&#20989;&#25968;&#26041;&#31243;&#12290;&#36882;&#24402;&#38480;&#21046;&#20102;&#25105;&#20204;&#21482;&#33021;&#37319;&#29992;&#36882;&#24402;&#21464;&#21270;&#20559;&#22909;&#12290;</title><link>http://arxiv.org/abs/2304.06830</link><description>&lt;p&gt;
&#36882;&#24402;&#20559;&#22909;&#19982;&#27169;&#31946;&#24577;&#24230;
&lt;/p&gt;
&lt;p&gt;
Recursive Preferences and Ambiguity Attitudes. (arXiv:2304.06830v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.06830
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#36882;&#24402;&#20559;&#22909;&#21644;&#19981;&#30830;&#23450;&#24615;&#24577;&#24230;&#65292;&#24182;&#24471;&#20986;&#32467;&#35770;&#65292;&#22312;&#36328;&#26102;&#38388;&#28040;&#36153;&#36873;&#25321;&#38382;&#39064;&#20013;&#65292;&#36882;&#24402;&#20559;&#22909;&#24635;&#26159;&#24120;&#25968;&#32477;&#23545;&#27169;&#31946;&#35268;&#36991;&#65292;&#21516;&#26102;&#25552;&#20986;&#20102;&#24191;&#20041;&#38271;&#26041;&#24418;&#30340;&#20989;&#25968;&#26041;&#31243;&#12290;&#36882;&#24402;&#38480;&#21046;&#20102;&#25105;&#20204;&#21482;&#33021;&#37319;&#29992;&#36882;&#24402;&#21464;&#21270;&#20559;&#22909;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#21160;&#24577;&#29615;&#22659;&#20013;&#36882;&#24402;&#30340;&#24378;&#24433;&#21709;&#65292;&#20197;&#21450;&#23545;&#19981;&#30830;&#23450;&#24615;&#24577;&#24230;&#30340;&#24433;&#21709;&#12290;&#22312;&#36328;&#26102;&#38388;&#28040;&#36153;&#36873;&#25321;&#38382;&#39064;&#20013;&#65292;&#36882;&#24402;&#20559;&#22909;&#24635;&#26159;&#24847;&#21619;&#30528;&#24120;&#25968;&#32477;&#23545;&#27169;&#31946;&#35268;&#36991;&#65292;&#21516;&#26102;&#20063;&#25552;&#20986;&#20102;&#19968;&#31181;&#31216;&#20026;&#8220;&#24191;&#20041;&#38271;&#26041;&#24418;&#8221;&#30340;&#20989;&#25968;&#26041;&#31243;&#65292;&#23427;&#23558;&#36882;&#24402;&#26368;&#23567;&#26368;&#22823;&#20559;&#22909;&#30340;&#26631;&#20934;&#27010;&#24565;&#25512;&#24191;&#21040;&#19968;&#33324;&#30340;&#30830;&#23450;&#24615;&#31561;&#20215;&#29289;&#12290;&#30740;&#31350;&#34920;&#26126;&#65292;&#22914;&#26524;&#27169;&#31946;&#35268;&#36991;&#34987;&#24314;&#27169;&#20026;&#20559;&#22909;&#30340;&#20984;&#24615;&#24418;&#24335;&#65292;&#21017;&#36882;&#24402;&#38480;&#21046;&#25105;&#20204;&#21482;&#33021;&#37319;&#29992;&#36882;&#24402;&#21464;&#21270;&#20559;&#22909;&#12290;
&lt;/p&gt;
&lt;p&gt;
We illustrate the strong implications of recursivity, a standard assumption in dynamic environments, on attitudes toward uncertainty. In intertemporal consumption choice problems, recursivity always implies constant absolute ambiguity aversion (CAAA) when applying the standard dynamic extension of monotonicity. Our analysis also yields a functional equation called "generalized rectangularity", as it generalizes the standard notion of rectangularity for recursive maxmin preferences to general certainty equivalents. Our results highlight that if uncertainty aversion is modeled as a form of convexity of preferences, recursivity limits us to only recursive variational preferences.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#20351;&#29992;&#23545;&#27604;&#35757;&#32451;&#30340;&#35270;&#35273;&#32534;&#30721;&#22120;&#65292;&#23558;OCR&#24314;&#27169;&#20026;&#23383;&#31526;&#32423;&#22270;&#20687;&#26816;&#32034;&#38382;&#39064;&#65292;&#30456;&#27604;&#20110;&#24050;&#26377;&#26550;&#26500;&#26356;&#20855;&#26679;&#26412;&#25928;&#29575;&#21644;&#21487;&#25193;&#23637;&#24615;&#65292;&#20174;&#32780;&#20351;&#25968;&#23383;&#21382;&#21490;&#26356;&#20855;&#20195;&#34920;&#24615;&#30340;&#25991;&#29486;&#21490;&#26009;&#24471;&#20197;&#26356;&#22909;&#22320;&#21442;&#19982;&#31038;&#21306;&#12290;</title><link>http://arxiv.org/abs/2304.02737</link><description>&lt;p&gt;
&#24314;&#35774;&#22810;&#26679;&#21270;&#25968;&#23383;&#21382;&#21490;&#30340;&#39640;&#25928;OCR
&lt;/p&gt;
&lt;p&gt;
Efficient OCR for Building a Diverse Digital History. (arXiv:2304.02737v1 [cs.CV])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.02737
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#20351;&#29992;&#23545;&#27604;&#35757;&#32451;&#30340;&#35270;&#35273;&#32534;&#30721;&#22120;&#65292;&#23558;OCR&#24314;&#27169;&#20026;&#23383;&#31526;&#32423;&#22270;&#20687;&#26816;&#32034;&#38382;&#39064;&#65292;&#30456;&#27604;&#20110;&#24050;&#26377;&#26550;&#26500;&#26356;&#20855;&#26679;&#26412;&#25928;&#29575;&#21644;&#21487;&#25193;&#23637;&#24615;&#65292;&#20174;&#32780;&#20351;&#25968;&#23383;&#21382;&#21490;&#26356;&#20855;&#20195;&#34920;&#24615;&#30340;&#25991;&#29486;&#21490;&#26009;&#24471;&#20197;&#26356;&#22909;&#22320;&#21442;&#19982;&#31038;&#21306;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#27599;&#22825;&#26377;&#25104;&#21315;&#19978;&#19975;&#30340;&#29992;&#25143;&#26597;&#38405;&#25968;&#23383;&#26723;&#26696;&#65292;&#20294;&#20182;&#20204;&#21487;&#20197;&#20351;&#29992;&#30340;&#20449;&#24687;&#24182;&#19981;&#33021;&#20195;&#34920;&#21508;&#31181;&#25991;&#29486;&#21490;&#26009;&#30340;&#22810;&#26679;&#24615;&#12290;&#20856;&#22411;&#29992;&#20110;&#20809;&#23398;&#23383;&#31526;&#35782;&#21035;&#65288;OCR&#65289;&#30340;&#24207;&#21015;&#21040;&#24207;&#21015;&#26550;&#26500;&#8212;&#8212;&#32852;&#21512;&#23398;&#20064;&#35270;&#35273;&#21644;&#35821;&#35328;&#27169;&#22411;&#8212;&#8212;&#22312;&#20302;&#36164;&#28304;&#25991;&#29486;&#38598;&#21512;&#20013;&#24456;&#38590;&#25193;&#23637;&#65292;&#22240;&#20026;&#23398;&#20064;&#35821;&#35328;-&#35270;&#35273;&#27169;&#22411;&#38656;&#35201;&#22823;&#37327;&#26631;&#35760;&#30340;&#24207;&#21015;&#21644;&#35745;&#31639;&#12290;&#26412;&#30740;&#31350;&#23558;OCR&#24314;&#27169;&#20026;&#23383;&#31526;&#32423;&#22270;&#20687;&#26816;&#32034;&#38382;&#39064;&#65292;&#20351;&#29992;&#23545;&#27604;&#35757;&#32451;&#30340;&#35270;&#35273;&#32534;&#30721;&#22120;&#12290;&#22240;&#20026;&#35813;&#27169;&#22411;&#21482;&#23398;&#20064;&#23383;&#31526;&#30340;&#35270;&#35273;&#29305;&#24449;&#65292;&#23427;&#27604;&#29616;&#26377;&#26550;&#26500;&#26356;&#20855;&#26679;&#26412;&#25928;&#29575;&#21644;&#21487;&#25193;&#23637;&#24615;&#65292;&#33021;&#22815;&#22312;&#29616;&#26377;&#35299;&#20915;&#26041;&#26696;&#22833;&#36133;&#30340;&#24773;&#20917;&#19979;&#23454;&#29616;&#20934;&#30830;&#30340;OCR&#12290;&#20851;&#38190;&#26159;&#65292;&#35813;&#27169;&#22411;&#20026;&#31038;&#21306;&#21442;&#19982;&#22312;&#20351;&#25968;&#23383;&#21382;&#21490;&#26356;&#20855;&#20195;&#34920;&#24615;&#30340;&#25991;&#29486;&#21490;&#26009;&#26041;&#38754;&#24320;&#36767;&#20102;&#26032;&#30340;&#36884;&#24452;&#12290;
&lt;/p&gt;
&lt;p&gt;
Thousands of users consult digital archives daily, but the information they can access is unrepresentative of the diversity of documentary history. The sequence-to-sequence architecture typically used for optical character recognition (OCR) - which jointly learns a vision and language model - is poorly extensible to low-resource document collections, as learning a language-vision model requires extensive labeled sequences and compute. This study models OCR as a character level image retrieval problem, using a contrastively trained vision encoder. Because the model only learns characters' visual features, it is more sample efficient and extensible than existing architectures, enabling accurate OCR in settings where existing solutions fail. Crucially, the model opens new avenues for community engagement in making digital history more representative of documentary history.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#21512;&#25104;&#25511;&#21046;&#26041;&#27861;&#65292;&#21487;&#20197;&#35780;&#20272;&#19968;&#31181;&#27835;&#30103;&#23545;&#20110;&#22810;&#20010;&#32467;&#26524;&#21464;&#37327;&#30340;&#24433;&#21709;&#12290;&#22312;&#20351;&#29992;&#35813;&#26041;&#27861;&#20272;&#35745;&#29790;&#20856;&#22312;COVID-19&#22823;&#27969;&#34892;&#20013;&#38750;&#33647;&#29289;&#24178;&#39044;&#25514;&#26045;&#30340;&#25928;&#26524;&#26102;&#65292;&#25105;&#20204;&#24471;&#20986;&#32467;&#35770;&#65306;&#22914;&#26524;&#29790;&#20856;&#22312;3&#26376;&#20221;&#20687;&#27431;&#27954;&#20854;&#20182;&#22269;&#23478;&#19968;&#26679;&#23454;&#26045;&#20102;&#26356;&#20005;&#26684;&#30340;&#38750;&#33647;&#29289;&#24178;&#39044;&#25514;&#26045;&#65292;&#37027;&#20040;&#21040;7&#26376;&#20221;&#65292;COVID-19&#24863;&#26579;&#30149;&#20363;&#21644;&#27515;&#20129;&#20154;&#25968;&#23558;&#20943;&#23569;&#32422;70&#65285;&#65292;&#32780;&#22312;5&#26376;&#21021;&#25152;&#26377;&#21407;&#22240;&#30340;&#27515;&#20129;&#20154;&#25968;&#23558;&#20943;&#23569;&#32422;20&#65285;&#12290;</title><link>http://arxiv.org/abs/2304.02272</link><description>&lt;p&gt;
&#24102;&#22810;&#20010;&#32467;&#26524;&#30340;&#21512;&#25104;&#25511;&#21046;&#65306;COVID-19&#22823;&#27969;&#34892;&#20013;&#20272;&#35745;&#38750;&#33647;&#29289;&#24178;&#39044;&#25928;&#26524;
&lt;/p&gt;
&lt;p&gt;
Synthetic Controls with Multiple Outcomes: Estimating the Effects of Non-Pharmaceutical Interventions in the COVID-19 Pandemic. (arXiv:2304.02272v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.02272
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#21512;&#25104;&#25511;&#21046;&#26041;&#27861;&#65292;&#21487;&#20197;&#35780;&#20272;&#19968;&#31181;&#27835;&#30103;&#23545;&#20110;&#22810;&#20010;&#32467;&#26524;&#21464;&#37327;&#30340;&#24433;&#21709;&#12290;&#22312;&#20351;&#29992;&#35813;&#26041;&#27861;&#20272;&#35745;&#29790;&#20856;&#22312;COVID-19&#22823;&#27969;&#34892;&#20013;&#38750;&#33647;&#29289;&#24178;&#39044;&#25514;&#26045;&#30340;&#25928;&#26524;&#26102;&#65292;&#25105;&#20204;&#24471;&#20986;&#32467;&#35770;&#65306;&#22914;&#26524;&#29790;&#20856;&#22312;3&#26376;&#20221;&#20687;&#27431;&#27954;&#20854;&#20182;&#22269;&#23478;&#19968;&#26679;&#23454;&#26045;&#20102;&#26356;&#20005;&#26684;&#30340;&#38750;&#33647;&#29289;&#24178;&#39044;&#25514;&#26045;&#65292;&#37027;&#20040;&#21040;7&#26376;&#20221;&#65292;COVID-19&#24863;&#26579;&#30149;&#20363;&#21644;&#27515;&#20129;&#20154;&#25968;&#23558;&#20943;&#23569;&#32422;70&#65285;&#65292;&#32780;&#22312;5&#26376;&#21021;&#25152;&#26377;&#21407;&#22240;&#30340;&#27515;&#20129;&#20154;&#25968;&#23558;&#20943;&#23569;&#32422;20&#65285;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#23558;&#21512;&#25104;&#25511;&#21046;&#26041;&#27861;&#25512;&#24191;&#21040;&#22810;&#32467;&#26524;&#26694;&#26550;&#30340;&#31639;&#27861;&#65292;&#21487;&#20197;&#25552;&#39640;&#27835;&#30103;&#25928;&#26524;&#35780;&#20272;&#30340;&#21487;&#38752;&#24615;&#12290;&#36825;&#26159;&#36890;&#36807;&#22312;&#35745;&#31639;&#21512;&#25104;&#25511;&#21046;&#26435;&#37325;&#26102;&#65292;&#23558;&#20256;&#32479;&#30340;&#39044;&#22788;&#29702;&#26102;&#38388;&#32500;&#24230;&#19982;&#30456;&#20851;&#32467;&#26524;&#30340;&#39069;&#22806;&#32500;&#24230;&#36827;&#34892;&#34917;&#20805;&#26469;&#23454;&#29616;&#30340;&#12290;&#25105;&#20204;&#30340;&#25512;&#24191;&#23545;&#20110;&#35780;&#20272;&#19968;&#31181;&#27835;&#30103;&#23545;&#20110;&#22810;&#20010;&#32467;&#26524;&#21464;&#37327;&#30340;&#24433;&#21709;&#30340;&#30740;&#31350;&#23588;&#20854;&#26377;&#29992;&#12290;&#25105;&#20204;&#29992;&#29790;&#20856;&#22312;2020&#24180;&#21069;&#19977;&#20010;&#23395;&#24230;&#30340;&#25968;&#25454;&#26469;&#35828;&#26126;&#25105;&#20204;&#30340;&#26041;&#27861;&#65292;&#20272;&#35745;&#38750;&#33647;&#29289;&#24178;&#39044;&#25514;&#26045;&#23545;&#22810;&#20010;&#32467;&#26524;&#30340;&#24433;&#21709;&#12290;&#25105;&#20204;&#30340;&#32467;&#26524;&#34920;&#26126;&#65292;&#22914;&#26524;&#29790;&#20856;&#22312;3&#26376;&#20221;&#20687;&#27431;&#27954;&#20854;&#20182;&#22269;&#23478;&#19968;&#26679;&#23454;&#26045;&#20102;&#26356;&#20005;&#26684;&#30340;&#38750;&#33647;&#29289;&#24178;&#39044;&#25514;&#26045;&#65292;&#37027;&#20040;&#21040;7&#26376;&#20221;&#65292;COVID-19&#24863;&#26579;&#30149;&#20363;&#21644;&#27515;&#20129;&#20154;&#25968;&#23558;&#20943;&#23569;&#32422;70&#65285;&#65292;&#32780;&#22312;5&#26376;&#21021;&#25152;&#26377;&#21407;&#22240;&#30340;&#27515;&#20129;&#20154;&#25968;&#23558;&#20943;&#23569;&#32422;20&#65285;&#12290;&#32780;&#38750;&#33647;&#29289;&#24178;&#39044;&#25514;&#26045;&#23545;&#21171;&#21160;&#21147;&#24066;&#22330;&#21644;&#32463;&#27982;&#32467;&#26524;&#30340;&#24433;&#21709;&#30456;&#23545;&#36739;&#23567;&#12290;
&lt;/p&gt;
&lt;p&gt;
We propose a generalization of the synthetic control method to a multiple-outcome framework, which improves the reliability of treatment effect estimation. This is done by supplementing the conventional pre-treatment time dimension with the extra dimension of related outcomes in computing the synthetic control weights. Our generalization can be particularly useful for studies evaluating the effect of a treatment on multiple outcome variables. To illustrate our method, we estimate the effects of non-pharmaceutical interventions (NPIs) on various outcomes in Sweden in the first 3 quarters of 2020. Our results suggest that if Sweden had implemented stricter NPIs like the other European countries by March, then there would have been about 70% fewer cumulative COVID-19 infection cases and deaths by July, and 20% fewer deaths from all causes in early May, whereas the impacts of the NPIs were relatively mild on the labor market and economic outcomes.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#27604;&#36739;&#20102;&#31616;&#21333;&#28216;&#25103;&#20013;&#22522;&#20110;&#21512;&#20316;&#21644;&#20998;&#35010;&#30340;&#20851;&#38190;&#31243;&#24230;&#27010;&#24565;&#21644;&#24046;&#20998;&#20851;&#38190;&#24615;&#27010;&#24565;&#65292;&#25552;&#20986;&#20102;&#28385;&#36275;&#25193;&#23637;&#24378;&#21333;&#35843;&#24615;&#12289;&#19981;&#20998;&#37197;&#26435;&#21147;&#32473;&#21713;&#20803;&#29609;&#23478;&#21644;&#33258;&#30001;&#39569;&#25163;&#30340;&#26032;&#27010;&#24565;&#65292;&#24182;&#20171;&#32461;&#20102;&#19968;&#20010;&#32676;&#20307;&#26426;&#20250;&#27979;&#35797;&#26469;&#32479;&#19968;&#20004;&#31181;&#35266;&#28857;&#12290;</title><link>http://arxiv.org/abs/2207.03565</link><description>&lt;p&gt;
&#31616;&#21333;&#28216;&#25103;&#20013;&#32676;&#20307;&#37325;&#35201;&#24615;&#27010;&#24565;&#30340;&#27604;&#36739;
&lt;/p&gt;
&lt;p&gt;
A Comparison of Group Criticality Notions for Simple Games. (arXiv:2207.03565v2 [econ.TH] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2207.03565
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#27604;&#36739;&#20102;&#31616;&#21333;&#28216;&#25103;&#20013;&#22522;&#20110;&#21512;&#20316;&#21644;&#20998;&#35010;&#30340;&#20851;&#38190;&#31243;&#24230;&#27010;&#24565;&#21644;&#24046;&#20998;&#20851;&#38190;&#24615;&#27010;&#24565;&#65292;&#25552;&#20986;&#20102;&#28385;&#36275;&#25193;&#23637;&#24378;&#21333;&#35843;&#24615;&#12289;&#19981;&#20998;&#37197;&#26435;&#21147;&#32473;&#21713;&#20803;&#29609;&#23478;&#21644;&#33258;&#30001;&#39569;&#25163;&#30340;&#26032;&#27010;&#24565;&#65292;&#24182;&#20171;&#32461;&#20102;&#19968;&#20010;&#32676;&#20307;&#26426;&#20250;&#27979;&#35797;&#26469;&#32479;&#19968;&#20004;&#31181;&#35266;&#28857;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#22522;&#20110;&#29609;&#23478;&#20043;&#38388;&#30340;&#21512;&#20316;&#65288;&#25110;&#20998;&#35010;&#65289;&#26469;&#23450;&#20041;&#31616;&#21333;&#21333;&#35843;&#21338;&#24328;&#20013;&#29609;&#23478;&#30340;&#20851;&#38190;&#31243;&#24230;&#27010;&#24565;&#65292;&#35201;&#27714;&#25152;&#26377;&#21442;&#19982;&#32773;&#37117;&#20855;&#26377;&#37325;&#35201;&#35282;&#33394;&#12290;&#25105;&#20204;&#23558;&#20854;&#19982;Beisbart&#25552;&#20986;&#30340;&#24046;&#20998;&#20851;&#38190;&#24615;&#27010;&#24565;&#36827;&#34892;&#27604;&#36739;&#65292;&#21518;&#32773;&#23558;&#26435;&#21147;&#23450;&#20041;&#20026;&#20854;&#20182;&#29609;&#23478;&#30041;&#19979;&#30340;&#26426;&#20250;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#25105;&#20204;&#30340;&#25552;&#35758;&#28385;&#36275;Young&#24341;&#20837;&#30340;&#24378;&#21333;&#35843;&#24615;&#30340;&#25193;&#23637;&#65292;&#19981;&#20250;&#20026;&#21713;&#20803;&#29609;&#23478;&#21644;&#33258;&#30001;&#39569;&#25163;&#20998;&#37197;&#20219;&#20309;&#26435;&#21147;&#65292;&#24182;&#19988;&#21487;&#20197;&#20174;&#26368;&#23567;&#30340;&#33719;&#32988;&#21644;&#38459;&#22622;&#32852;&#30431;&#20013;&#36731;&#26494;&#35745;&#31639;&#12290;&#25105;&#20204;&#30340;&#20998;&#26512;&#34920;&#26126;&#65292;&#36804;&#20170;&#20026;&#27490;&#23450;&#20041;&#30340;&#32676;&#20307;&#20851;&#38190;&#24615;&#24230;&#37327;&#26080;&#27861;&#34913;&#37327;&#37325;&#35201;&#30340;&#29609;&#23478;&#65292;&#21516;&#26102;&#20165;&#20445;&#25345;&#20026;&#26426;&#20250;&#24230;&#37327;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#32676;&#20307;&#26426;&#20250;&#27979;&#35797;&#26469;&#21327;&#35843;&#20004;&#31181;&#35266;&#28857;&#12290;
&lt;/p&gt;
&lt;p&gt;
We define a notion of the criticality of a player for simple monotone games based on cooperation with other players, either to form a winning coalition or to break a winning one, with an essential role for all the players involved. We compare it with the notion of differential criticality given by Beisbart that measures power as the opportunity left by other players.  We prove that our proposal satisfies an extension of the strong monotonicity introduced by Young, it assigns no power to dummy players and free riders, and it can easily be computed from the minimal winning and blocking coalitions. Our analysis shows that the measures of group criticality defined so far cannot weigh essential players while only remaining an opportunity measure. We propose a group opportunity test to reconcile the two views.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#24046;&#24322;&#24615;&#21306;&#21035;&#20272;&#35745;&#22120;&#65292;&#36866;&#29992;&#20110;&#27599;&#20010;&#26102;&#26399;&#36830;&#32493;&#20998;&#24067;&#30340;&#22788;&#29702;&#24773;&#20917;&#65292;&#19982;&#20256;&#32479;&#30340;&#21452;&#21521;&#22266;&#23450;&#25928;&#24212;&#22238;&#24402;&#27169;&#22411;&#30456;&#27604;&#65292;&#35813;&#26041;&#27861;&#20165;&#20381;&#36182;&#20110;&#24182;&#34892;&#36235;&#21183;&#20551;&#35774;&#12290;&#36890;&#36807;&#27604;&#36739;&#20855;&#26377;&#30456;&#21516;&#31532;&#19968;&#26102;&#26399;&#22788;&#29702;&#30340;&#20999;&#25442;&#32773;&#21644;&#20445;&#25345;&#32773;&#65292;&#26377;&#25928;&#36991;&#20813;&#20102;&#22788;&#29702;&#25928;&#24212;&#38543;&#26102;&#38388;&#21464;&#21270;&#30340;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2201.06898</link><description>&lt;p&gt;
&#22312;&#27599;&#20010;&#26102;&#26399;&#36830;&#32493;&#20998;&#24067;&#30340;&#22788;&#29702;&#20013;&#36827;&#34892;&#24046;&#24322;&#24615;&#21306;&#21035;&#20272;&#35745;&#22120;
&lt;/p&gt;
&lt;p&gt;
Difference-in-Differences Estimators for Treatments Continuously Distributed at Every Period. (arXiv:2201.06898v2 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2201.06898
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#24046;&#24322;&#24615;&#21306;&#21035;&#20272;&#35745;&#22120;&#65292;&#36866;&#29992;&#20110;&#27599;&#20010;&#26102;&#26399;&#36830;&#32493;&#20998;&#24067;&#30340;&#22788;&#29702;&#24773;&#20917;&#65292;&#19982;&#20256;&#32479;&#30340;&#21452;&#21521;&#22266;&#23450;&#25928;&#24212;&#22238;&#24402;&#27169;&#22411;&#30456;&#27604;&#65292;&#35813;&#26041;&#27861;&#20165;&#20381;&#36182;&#20110;&#24182;&#34892;&#36235;&#21183;&#20551;&#35774;&#12290;&#36890;&#36807;&#27604;&#36739;&#20855;&#26377;&#30456;&#21516;&#31532;&#19968;&#26102;&#26399;&#22788;&#29702;&#30340;&#20999;&#25442;&#32773;&#21644;&#20445;&#25345;&#32773;&#65292;&#26377;&#25928;&#36991;&#20813;&#20102;&#22788;&#29702;&#25928;&#24212;&#38543;&#26102;&#38388;&#21464;&#21270;&#30340;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#38024;&#23545;&#22312;&#27599;&#20010;&#26102;&#26399;&#36830;&#32493;&#20998;&#24067;&#30340;&#22788;&#29702;&#30340;&#26032;&#30340;&#24046;&#24322;&#24615;&#21306;&#21035;&#20272;&#35745;&#22120;&#65292;&#36825;&#31181;&#24773;&#20917;&#32463;&#24120;&#21457;&#29983;&#22312;&#36152;&#26131;&#20851;&#31246;&#25110;&#28201;&#24230;&#31561;&#24773;&#20917;&#19979;&#12290;&#25105;&#20204;&#39318;&#20808;&#20551;&#35774;&#35813;&#25968;&#25454;&#20165;&#26377;&#20004;&#20010;&#26102;&#26399;&#12290;&#25105;&#20204;&#36824;&#20551;&#35774;&#22312;&#31532;&#19968;&#26102;&#26399;&#21040;&#31532;&#20108;&#26102;&#26399;&#65292;&#26576;&#20123;&#21333;&#20301;&#65288;&#21363;&#20999;&#25442;&#32773;&#65289;&#30340;&#22788;&#29702;&#21457;&#29983;&#20102;&#21464;&#21270;&#65292;&#32780;&#20854;&#20182;&#21333;&#20301;&#65288;&#21363;&#20445;&#25345;&#32773;&#65289;&#30340;&#22788;&#29702;&#27809;&#26377;&#21464;&#21270;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#30340;&#20272;&#35745;&#22120;&#23558;&#20999;&#25442;&#32773;&#21644;&#20445;&#25345;&#32773;&#22312;&#31532;&#19968;&#26102;&#26399;&#30340;&#22788;&#29702;&#20540;&#30456;&#21516;&#30340;&#24773;&#20917;&#19979;&#30340;&#32467;&#26524;&#28436;&#21464;&#36827;&#34892;&#27604;&#36739;&#12290;&#25105;&#20204;&#30340;&#20272;&#35745;&#22120;&#20165;&#20381;&#36182;&#20110;&#24182;&#34892;&#36235;&#21183;&#20551;&#35774;&#65292;&#19981;&#20687;&#24120;&#29992;&#30340;&#21452;&#21521;&#22266;&#23450;&#25928;&#24212;&#22238;&#24402;&#27169;&#22411;&#36824;&#20381;&#36182;&#20110;&#22343;&#21248;&#22788;&#29702;&#25928;&#24212;&#20551;&#35774;&#12290;&#27604;&#36739;&#20855;&#26377;&#30456;&#21516;&#31532;&#19968;&#26102;&#26399;&#22788;&#29702;&#30340;&#20999;&#25442;&#32773;&#21644;&#20445;&#25345;&#32773;&#26159;&#24456;&#37325;&#35201;&#30340;&#65306;&#26080;&#26465;&#20214;&#27604;&#36739;&#20999;&#25442;&#32773;&#21644;&#20445;&#25345;&#32773;&#38544;&#21547;&#22320;&#20551;&#35774;&#22788;&#29702;&#25928;&#24212;&#38543;&#26102;&#38388;&#20445;&#25345;&#19981;&#21464;&#12290;&#23545;&#20110;&#36830;&#32493;&#22788;&#29702;&#65292;&#20999;&#25442;&#32773;&#26080;&#27861;&#19982;&#20855;&#26377;&#23436;&#20840;&#30456;&#21516;&#31532;&#19968;&#26102;&#26399;&#22788;&#29702;&#30340;&#20445;&#25345;&#32773;&#21305;&#37197;&#12290;
&lt;/p&gt;
&lt;p&gt;
We propose new difference-in-difference (DID) estimators for treatments continuously distributed at every time period, as is often the case of trade tariffs, or temperatures. We start by assuming that the data only has two time periods. We also assume that from period one to two, the treatment of some units, the switchers, changes, while the treatment of other units, the stayers, does not change. Then, our estimators compare the outcome evolution of switchers and stayers with the same value of the treatment at period one. Our estimators only rely on parallel trends assumptions, unlike commonly used two-way fixed effects regressions that also rely on homogeneous treatment effect assumptions. Comparing switchers and stayers with the same period-one treatment is important: unconditional comparisons of switchers and stayers implicitly assume constant treatment effects over time. With a continuous treatment, switchers cannot be matched to stayers with exactly the same period-one treatment, 
&lt;/p&gt;</description></item></channel></rss>