<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>EIP-4844&#25552;&#26696;&#30740;&#31350;&#20102;&#23545;Rollup&#31574;&#30053;&#30340;&#32463;&#27982;&#23398;&#24433;&#21709;&#65292;&#21457;&#29616;&#20302;&#20132;&#26131;&#21040;&#36798;&#29575;&#30340;Rollup&#20542;&#21521;&#20110;&#20351;&#29992;&#24120;&#35268;&#21306;&#22359;&#31354;&#38388;&#24066;&#22330;&#65292;&#21516;&#26102;&#20849;&#20139;&#30340;blob&#21457;&#24067;&#24182;&#19981;&#24635;&#26159;&#23545;&#21442;&#19982;&#30340;Rollup&#26377;&#30410;&#12290;</title><link>http://arxiv.org/abs/2310.01155</link><description>&lt;p&gt;
EIP-4844&#32463;&#27982;&#23398;&#19982;Rollup&#31574;&#30053;
&lt;/p&gt;
&lt;p&gt;
EIP-4844 Economics and Rollup Strategies. (arXiv:2310.01155v1 [cs.GT])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.01155
&lt;/p&gt;
&lt;p&gt;
EIP-4844&#25552;&#26696;&#30740;&#31350;&#20102;&#23545;Rollup&#31574;&#30053;&#30340;&#32463;&#27982;&#23398;&#24433;&#21709;&#65292;&#21457;&#29616;&#20302;&#20132;&#26131;&#21040;&#36798;&#29575;&#30340;Rollup&#20542;&#21521;&#20110;&#20351;&#29992;&#24120;&#35268;&#21306;&#22359;&#31354;&#38388;&#24066;&#22330;&#65292;&#21516;&#26102;&#20849;&#20139;&#30340;blob&#21457;&#24067;&#24182;&#19981;&#24635;&#26159;&#23545;&#21442;&#19982;&#30340;Rollup&#26377;&#30410;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;Ethereum&#25913;&#36827;&#25552;&#26696;4844&#30340;&#32463;&#27982;&#23398;&#20197;&#21450;&#23545;Rollup&#25968;&#25454;&#21457;&#24067;&#31574;&#30053;&#30340;&#24433;&#21709;&#12290;Rollup&#30340;&#25104;&#26412;&#21253;&#25324;&#20004;&#37096;&#20998;&#65306;&#25968;&#25454;&#21457;&#24067;&#25104;&#26412;&#21644;&#24310;&#36831;&#25104;&#26412;&#12290;&#22312;&#26032;&#30340;&#25552;&#26696;&#20013;&#65292;&#25968;&#25454;&#21457;&#24067;&#25104;&#26412;&#19982;blob&#21457;&#24067;&#25104;&#26412;&#30456;&#23545;&#24212;&#65292;&#24182;&#22312;&#27599;&#20010;&#21306;&#22359;&#20013;&#22266;&#23450;&#65292;&#26080;&#35770;Rollup&#21033;&#29992;&#20102;&#22810;&#23569;blob&#12290;&#36825;&#20010;&#26435;&#34913;&#26159;&#28165;&#26224;&#30340;&#65306;Rollup&#26356;&#20542;&#21521;&#20110;&#21457;&#24067;&#19968;&#20010;&#23436;&#25972;&#30340;blob&#65292;&#20294;&#26159;&#22914;&#26524;&#20854;&#20132;&#26131;&#21040;&#36798;&#29575;&#36739;&#20302;&#65292;&#22635;&#20805;blob&#31354;&#38388;&#20250;&#23548;&#33268;&#36739;&#22823;&#30340;&#24310;&#36831;&#25104;&#26412;&#12290;&#35770;&#25991;&#30340;&#31532;&#19968;&#20010;&#32467;&#26524;&#26174;&#31034;&#65292;&#22914;&#26524;&#19968;&#20010;Rollup&#30340;&#20132;&#26131;&#21040;&#36798;&#29575;&#22826;&#20302;&#65292;&#23427;&#26356;&#20542;&#21521;&#20110;&#20351;&#29992;&#24120;&#35268;&#30340;&#21306;&#22359;&#31354;&#38388;&#24066;&#22330;&#36827;&#34892;&#25968;&#25454;&#21457;&#24067;&#65292;&#22240;&#20026;&#23427;&#25552;&#20379;&#20102;&#26356;&#28789;&#27963;&#30340;&#25104;&#26412;&#32467;&#26500;&#12290;&#20854;&#27425;&#65292;&#25105;&#20204;&#34920;&#26126;&#20849;&#20139;&#30340;blob&#21457;&#24067;&#24182;&#19981;&#24635;&#26159;&#23545;&#21442;&#19982;&#30340;Rollup&#26377;&#30410;&#30340;&#65292;&#22343;&#34913;&#20013;&#30340;&#32858;&#21512;blob&#21457;&#24067;&#25104;&#26412;&#30340;&#21464;&#21270;&#21462;&#20915;&#20110;&#21442;&#19982;&#30340;Rollup&#30340;&#31867;&#22411;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#20174;&#20844;&#29702;&#35282;&#24230;&#35752;&#35770;blob&#25104;&#26412;&#20998;&#25674;&#35268;&#21017;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study the economics of the Ethereum improvement proposal 4844 and its effect on rollups' data posting strategies. Rollups' cost consists of two parts: data posting and delay. In the new proposal, the data posting cost corresponds to a blob posting cost and is fixed in each block, no matter how much of the blob is utilized by the rollup. The tradeoff is clear: the rollup prefers to post a full blob, but if its transaction arrival rate is low, filling up a blob space causes too large delay cost. The first result of the paper shows that if a rollup transaction arrival rate is too low, it prefers to use the regular blockspace market for data posting, as it offers a more flexible cost structure. Second, we show that shared blob posting is not always beneficial for participating rollups and change in the aggregate blob posting cost in the equilibrium depends on the types of participating rollups. In the end, we discuss blob cost-sharing rules from an axiomatic angle.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#20351;&#29992;&#21516;&#26102;&#20998;&#20301;&#25968;&#22238;&#24402;&#26041;&#27861;&#65292;&#30740;&#31350;&#20102;&#23439;&#35266;&#32463;&#27982;&#21644;&#37329;&#34701;&#19981;&#30830;&#23450;&#24615;&#23545;&#21407;&#27833;&#26399;&#36135;&#22238;&#25253;&#30340;&#24433;&#21709;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#36825;&#20123;&#22240;&#32032;&#23545;&#21407;&#27833;&#22238;&#25253;&#30340;&#24433;&#21709;&#22312;&#19981;&#21516;&#26102;&#26399;&#21644;&#24066;&#22330;&#26465;&#20214;&#19979;&#23384;&#22312;&#24046;&#24322;&#12290;&#36825;&#20123;&#32467;&#26524;&#21487;&#29992;&#20110;&#25351;&#23548;&#25237;&#36164;&#20915;&#31574;&#21644;&#26500;&#24314;&#39118;&#38505;&#19982;&#25910;&#30410;&#24179;&#34913;&#30340;&#25237;&#36164;&#32452;&#21512;&#12290;</title><link>http://arxiv.org/abs/2310.01123</link><description>&lt;p&gt;
&#32463;&#27982;&#19981;&#30830;&#23450;&#24615;&#12289;&#22320;&#32536;&#25919;&#27835;&#39118;&#38505;&#12289;&#30123;&#24773;&#12289;&#37329;&#34701;&#21644;&#23439;&#35266;&#32463;&#27982;&#22240;&#32032;&#23545;&#21407;&#27833;&#22238;&#25253;&#30340;&#24433;&#21709;&#8212;&#8212;&#23454;&#35777;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Impact of Economic Uncertainty, Geopolitical Risk, Pandemic, Financial &amp; Macroeconomic Factors on Crude Oil Returns -- An Empirical Investigation. (arXiv:2310.01123v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.01123
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#20351;&#29992;&#21516;&#26102;&#20998;&#20301;&#25968;&#22238;&#24402;&#26041;&#27861;&#65292;&#30740;&#31350;&#20102;&#23439;&#35266;&#32463;&#27982;&#21644;&#37329;&#34701;&#19981;&#30830;&#23450;&#24615;&#23545;&#21407;&#27833;&#26399;&#36135;&#22238;&#25253;&#30340;&#24433;&#21709;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#36825;&#20123;&#22240;&#32032;&#23545;&#21407;&#27833;&#22238;&#25253;&#30340;&#24433;&#21709;&#22312;&#19981;&#21516;&#26102;&#26399;&#21644;&#24066;&#22330;&#26465;&#20214;&#19979;&#23384;&#22312;&#24046;&#24322;&#12290;&#36825;&#20123;&#32467;&#26524;&#21487;&#29992;&#20110;&#25351;&#23548;&#25237;&#36164;&#20915;&#31574;&#21644;&#26500;&#24314;&#39118;&#38505;&#19982;&#25910;&#30410;&#24179;&#34913;&#30340;&#25237;&#36164;&#32452;&#21512;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#26088;&#22312;&#20351;&#29992;&#21516;&#26102;&#20998;&#20301;&#25968;&#22238;&#24402;&#65288;SQR&#65289;&#26469;&#30740;&#31350;&#23439;&#35266;&#32463;&#27982;&#21644;&#37329;&#34701;&#19981;&#30830;&#23450;&#24615;&#23545;&#21407;&#27833;&#26399;&#36135;&#22238;&#25253;&#65288;ROC&#65289;&#30340;&#24433;&#21709;&#65292;&#21253;&#25324;&#20840;&#29699;&#30123;&#24773;&#12289;&#22320;&#32536;&#25919;&#27835;&#39118;&#38505;&#31561;&#22240;&#32032;&#12290;&#30740;&#31350;&#25968;&#25454;&#26469;&#33258;FRED&#65288;&#32654;&#32852;&#20648;&#32463;&#27982;&#25968;&#25454;&#24211;&#65289;&#32463;&#27982;&#25968;&#25454;&#38598;&#65292;&#20351;&#29992;&#21464;&#24322;&#33192;&#32960;&#22240;&#23376;&#65288;VIF&#65289;&#21644;&#20027;&#25104;&#20998;&#20998;&#26512;&#65288;PCA&#65289;&#26469;&#39564;&#35777;&#22240;&#32032;&#30340;&#37325;&#35201;&#24615;&#12290;&#20026;&#20102;&#20840;&#38754;&#29702;&#35299;&#36825;&#20123;&#22240;&#32032;&#23545;WTI&#30340;&#32508;&#21512;&#24433;&#21709;&#65292;&#30740;&#31350;&#22312;&#22810;&#22240;&#23376;&#27169;&#22411;&#20013;&#21253;&#21547;&#20132;&#20114;&#39033;&#12290;&#23454;&#35777;&#32467;&#26524;&#34920;&#26126;&#65292;ROC&#30340;&#21464;&#21270;&#21487;&#33021;&#20250;&#26681;&#25454;&#29305;&#23450;&#26102;&#26399;&#21644;&#24066;&#22330;&#26465;&#20214;&#20135;&#29983;&#19981;&#21516;&#30340;&#24433;&#21709;&#12290;&#36825;&#20123;&#32467;&#26524;&#21487;&#29992;&#20110;&#26126;&#26234;&#30340;&#25237;&#36164;&#20915;&#31574;&#21644;&#26500;&#24314;&#39118;&#38505;&#21644;&#25910;&#30410;&#24179;&#34913;&#30340;&#25237;&#36164;&#32452;&#21512;&#12290;&#32467;&#26500;&#24615;&#21464;&#21270;&#65292;&#22914;&#20840;&#29699;&#32463;&#27982;&#29366;&#20917;&#30340;&#21464;&#21270;&#25110;&#23545;&#21407;&#27833;&#38656;&#27714;&#30340;&#36716;&#21464;&#65292;&#21487;&#20197;&#23548;&#33268;&#21407;&#27833;&#22238;&#25253;&#23545;&#20854;&#21464;&#21270;&#25935;&#24863;&#12290;
&lt;/p&gt;
&lt;p&gt;
This study aims to use simultaneous quantile regression (SQR) to examine the impact of macroeconomic and financial uncertainty including global pandemic, geopolitical risk on the futures returns of crude oil (ROC). The data for this study is sourced from the FRED (Federal Reserve Economic Database) economic dataset; the importance of the factors have been validated by using variation inflation factor (VIF) and principal component analysis (PCA). To fully understand the combined effect of these factors on WTI, study includes interaction terms in the multi-factor model. Empirical results suggest that changes in ROC can have varying impacts depending on the specific period and market conditions. The results can be used for informed investment decisions and to construct portfolios that are well-balanced in terms of risk and return. Structural breaks, such as changes in global economic conditions or shifts in demand for crude oil, can cause return on crude oil to be sensitive to changes in 
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#22522;&#20110;&#21333;&#22240;&#32032;&#39532;&#23572;&#21487;&#22827;&#26694;&#26550;&#30340;&#22810;&#26399;&#27431;&#24335;&#26399;&#26435;&#30340;&#38745;&#24577;&#23545;&#20914;&#65292;&#24182;&#23545;&#30456;&#23545;&#24615;&#33021;&#36827;&#34892;&#20102;&#23454;&#39564;&#27604;&#36739;&#12290;</title><link>http://arxiv.org/abs/2310.01104</link><description>&lt;p&gt;
&#22810;&#26399;&#27431;&#24335;&#26399;&#26435;&#30340;&#38745;&#24577;&#23545;&#20914;
&lt;/p&gt;
&lt;p&gt;
Multi-period static hedging of European options. (arXiv:2310.01104v1 [q-fin.MF])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.01104
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22522;&#20110;&#21333;&#22240;&#32032;&#39532;&#23572;&#21487;&#22827;&#26694;&#26550;&#30340;&#22810;&#26399;&#27431;&#24335;&#26399;&#26435;&#30340;&#38745;&#24577;&#23545;&#20914;&#65292;&#24182;&#23545;&#30456;&#23545;&#24615;&#33021;&#36827;&#34892;&#20102;&#23454;&#39564;&#27604;&#36739;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#32771;&#34385;&#20102;&#22312;&#22522;&#30784;&#36164;&#20135;&#20215;&#26684;&#36981;&#24490;&#21333;&#22240;&#32032;&#39532;&#23572;&#21487;&#22827;&#26694;&#26550;&#30340;&#24773;&#20917;&#19979;&#23545;&#27431;&#24335;&#26399;&#26435;&#36827;&#34892;&#23545;&#20914;&#12290;Carr&#21644;Wu [1]&#22312;&#36825;&#26679;&#30340;&#35774;&#32622;&#19979;&#65292;&#23548;&#20986;&#20102;&#32473;&#23450;&#26399;&#26435;&#19982;&#22312;&#21516;&#19968;&#36164;&#20135;&#19978;&#20889;&#30340;&#19968;&#31995;&#21015;&#36739;&#30701;&#26399;&#38480;&#26399;&#26435;&#20043;&#38388;&#30340;&#36328;&#24230;&#20851;&#31995;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#23558;&#20182;&#20204;&#30340;&#26041;&#27861;&#25193;&#23637;&#21040;&#21516;&#26102;&#21253;&#25324;&#22810;&#20010;&#30701;&#26399;&#21040;&#26399;&#30340;&#26399;&#26435;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#20351;&#29992;&#39640;&#26031;&#27714;&#31215;&#26041;&#27861;&#36890;&#36807;&#26377;&#38480;&#30340;&#19968;&#32452;&#30701;&#26399;&#26399;&#26435;&#30830;&#23450;&#23545;&#20914;&#35823;&#24046;&#30340;&#23454;&#38469;&#23454;&#29616;&#12290;&#25105;&#20204;&#23545;\textit{Black-Scholes}&#21644;\textit{Merton Jump Diffusion}&#27169;&#22411;&#36827;&#34892;&#20102;&#24191;&#27867;&#30340;&#23454;&#39564;&#65292;&#23637;&#31034;&#20102;&#36825;&#20004;&#31181;&#26041;&#27861;&#30340;&#27604;&#36739;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;
We consider the hedging of European options when the price of the underlying asset follows a single-factor Markovian framework. By working in such a setting, Carr and Wu \cite{carr2014static} derived a spanning relation between a given option and a continuum of shorter-term options written on the same asset. In this paper, we have extended their approach to simultaneously include options over multiple short maturities. We then show a practical implementation of this with a finite set of shorter-term options to determine the hedging error using a Gaussian Quadrature method. We perform a wide range of experiments for both the \textit{Black-Scholes} and \textit{Merton Jump Diffusion} models, illustrating the comparative performance of the two methods.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#20855;&#26377;&#26410;&#30693;&#25104;&#26412;&#30340;&#21322;&#31163;&#25955;&#26368;&#20248;&#36755;&#36816;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#37319;&#29992;&#22312;&#32447;&#23398;&#20064;&#21644;&#38543;&#26426;&#36924;&#36817;&#30456;&#32467;&#21512;&#30340;&#21322;&#23616;&#37096;&#31639;&#27861;&#65292;&#24182;&#35777;&#26126;&#20854;&#20855;&#26377;&#26368;&#20248;&#30340;&#25910;&#25947;&#36895;&#24230;&#12290;</title><link>http://arxiv.org/abs/2310.00786</link><description>&lt;p&gt;
&#20855;&#26377;&#26410;&#30693;&#25104;&#26412;&#30340;&#21322;&#31163;&#25955;&#26368;&#20248;&#36755;&#36816;
&lt;/p&gt;
&lt;p&gt;
Semidiscrete optimal transport with unknown costs. (arXiv:2310.00786v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.00786
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#20855;&#26377;&#26410;&#30693;&#25104;&#26412;&#30340;&#21322;&#31163;&#25955;&#26368;&#20248;&#36755;&#36816;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#37319;&#29992;&#22312;&#32447;&#23398;&#20064;&#21644;&#38543;&#26426;&#36924;&#36817;&#30456;&#32467;&#21512;&#30340;&#21322;&#23616;&#37096;&#31639;&#27861;&#65292;&#24182;&#35777;&#26126;&#20854;&#20855;&#26377;&#26368;&#20248;&#30340;&#25910;&#25947;&#36895;&#24230;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21322;&#31163;&#25955;&#26368;&#20248;&#36755;&#36816;&#26159;&#32447;&#24615;&#35268;&#21010;&#20013;&#32463;&#20856;&#36755;&#36816;&#38382;&#39064;&#30340;&#19968;&#31181;&#26377;&#25361;&#25112;&#24615;&#30340;&#25512;&#24191;&#12290;&#20854;&#30446;&#26631;&#26159;&#20197;&#22266;&#23450;&#36793;&#38469;&#20998;&#24067;&#30340;&#26041;&#24335;&#35774;&#35745;&#20004;&#20010;&#38543;&#26426;&#21464;&#37327;&#65288;&#19968;&#20010;&#36830;&#32493;&#65292;&#19968;&#20010;&#31163;&#25955;&#65289;&#30340;&#32852;&#21512;&#20998;&#24067;&#65292;&#20197;&#26368;&#23567;&#21270;&#26399;&#26395;&#25104;&#26412;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#36825;&#20010;&#38382;&#39064;&#30340;&#19968;&#20010;&#26032;&#22411;&#21464;&#20307;&#65292;&#20854;&#20013;&#25104;&#26412;&#20989;&#25968;&#26159;&#26410;&#30693;&#30340;&#65292;&#20294;&#21487;&#20197;&#36890;&#36807;&#22122;&#22768;&#35266;&#27979;&#23398;&#20064;&#65307;&#28982;&#32780;&#65292;&#27599;&#27425;&#21482;&#33021;&#37319;&#26679;&#19968;&#20010;&#20989;&#25968;&#12290;&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#31181;&#21322;&#23616;&#37096;&#31639;&#27861;&#65292;&#23558;&#22312;&#32447;&#23398;&#20064;&#19982;&#38543;&#26426;&#36924;&#36817;&#30456;&#32467;&#21512;&#65292;&#24182;&#35777;&#26126;&#20854;&#23454;&#29616;&#20102;&#26368;&#20248;&#30340;&#25910;&#25947;&#36895;&#24230;&#65292;&#23613;&#31649;&#38543;&#26426;&#26799;&#24230;&#30340;&#38750;&#20809;&#28369;&#24615;&#21644;&#30446;&#26631;&#20989;&#25968;&#30340;&#32570;&#20047;&#24378;&#20985;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Semidiscrete optimal transport is a challenging generalization of the classical transportation problem in linear programming. The goal is to design a joint distribution for two random variables (one continuous, one discrete) with fixed marginals, in a way that minimizes expected cost. We formulate a novel variant of this problem in which the cost functions are unknown, but can be learned through noisy observations; however, only one function can be sampled at a time. We develop a semi-myopic algorithm that couples online learning with stochastic approximation, and prove that it achieves optimal convergence rates, despite the non-smoothness of the stochastic gradient and the lack of strong concavity in the objective function.
&lt;/p&gt;</description></item><item><title>&#36825;&#31687;&#32508;&#36848;&#24635;&#32467;&#20102;&#20013;&#22269;&#20132;&#36890;&#37096;&#38376;&#33073;&#30899;&#38754;&#20020;&#30340;&#25361;&#25112;&#21644;&#26377;&#25928;&#31574;&#30053;&#65292;&#24182;&#25552;&#20986;&#20102;&#36890;&#36807;&#20351;&#29992;&#8220;&#36991;&#20813;&#12289;&#36716;&#31227;&#12289;&#25913;&#36827;&#8221;&#26694;&#26550;&#20197;&#21450;&#8220;&#26426;&#26500;&#33021;&#21147;&#19982;&#25216;&#26415;&#21457;&#23637;&#8221;&#30340;&#26032;&#25112;&#30053;&#30690;&#37327;&#65292;&#25512;&#21160;&#20013;&#22269;&#21521;&#21487;&#25345;&#32493;&#20132;&#36890;&#26410;&#26469;&#36807;&#28193;&#30340;&#32508;&#21512;&#20998;&#26512;&#12290;</title><link>http://arxiv.org/abs/2310.00613</link><description>&lt;p&gt;
&#12298;&#20013;&#22269;&#20132;&#36890;&#37096;&#38376;&#33073;&#30899;&#30340;&#22238;&#39038;&#65306;&#27010;&#36848;&#12289;&#20998;&#26512;&#19982;&#23637;&#26395;&#12299;&#30340;&#32508;&#36848;
&lt;/p&gt;
&lt;p&gt;
Review on Decarbonizing the Transportation Sector in China: Overview, Analysis, and Perspectives. (arXiv:2310.00613v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.00613
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#32508;&#36848;&#24635;&#32467;&#20102;&#20013;&#22269;&#20132;&#36890;&#37096;&#38376;&#33073;&#30899;&#38754;&#20020;&#30340;&#25361;&#25112;&#21644;&#26377;&#25928;&#31574;&#30053;&#65292;&#24182;&#25552;&#20986;&#20102;&#36890;&#36807;&#20351;&#29992;&#8220;&#36991;&#20813;&#12289;&#36716;&#31227;&#12289;&#25913;&#36827;&#8221;&#26694;&#26550;&#20197;&#21450;&#8220;&#26426;&#26500;&#33021;&#21147;&#19982;&#25216;&#26415;&#21457;&#23637;&#8221;&#30340;&#26032;&#25112;&#30053;&#30690;&#37327;&#65292;&#25512;&#21160;&#20013;&#22269;&#21521;&#21487;&#25345;&#32493;&#20132;&#36890;&#26410;&#26469;&#36807;&#28193;&#30340;&#32508;&#21512;&#20998;&#26512;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#32508;&#36848;&#35782;&#21035;&#20986;&#20102;&#33073;&#30899;&#20013;&#22269;&#24555;&#36895;&#22686;&#38271;&#30340;&#20132;&#36890;&#37096;&#38376;&#25152;&#38754;&#20020;&#30340;&#25361;&#25112;&#21644;&#26377;&#25928;&#31574;&#30053;&#65292;&#35813;&#37096;&#38376;&#26159;&#30446;&#21069;&#31532;&#19977;&#22823;&#30899;&#25490;&#25918;&#28304;&#65292;&#32771;&#34385;&#21040;&#20013;&#22269;&#25215;&#35834;&#22312;2030&#24180;&#21069;&#36798;&#21040;&#30899;&#25490;&#25918;&#23792;&#20540;&#24182;&#22312;2060&#24180;&#23454;&#29616;&#30899;&#20013;&#21644;&#12290;&#20027;&#35201;&#25361;&#25112;&#21253;&#25324;&#19981;&#26029;&#22686;&#38271;&#30340;&#20986;&#34892;&#38656;&#27714;&#12289;&#26410;&#36798;&#21040;&#27773;&#36710;&#25317;&#26377;&#39640;&#23792;&#12289;&#20844;&#20132;&#20056;&#23458;&#37327;&#19979;&#38477;&#12289;&#33021;&#28304;&#25216;&#26415;&#30740;&#31350;&#19982;&#23454;&#38469;&#24212;&#29992;&#20043;&#38388;&#30340;&#24046;&#36317;&#65292;&#20197;&#21450;&#33073;&#30899;&#30340;&#26377;&#38480;&#26426;&#26500;&#33021;&#21147;&#12290;&#36825;&#31687;&#32508;&#36848;&#20351;&#29992;&#8220;&#36991;&#20813;&#12289;&#36716;&#31227;&#12289;&#25913;&#36827;&#8221;&#26694;&#26550;&#23545;&#20013;&#22269;&#20132;&#36890;&#37096;&#38376;&#30446;&#21069;&#30340;&#33073;&#30899;&#25514;&#26045;&#12289;&#31574;&#30053;&#21644;&#25919;&#31574;&#36827;&#34892;&#20998;&#31867;&#65292;&#36741;&#20197;&#8220;&#26426;&#26500;&#33021;&#21147;&#19982;&#25216;&#26415;&#21457;&#23637;&#8221;&#30340;&#26032;&#25112;&#30053;&#30690;&#37327;&#20197;&#33719;&#21462;&#26356;&#24191;&#27867;&#30340;&#21457;&#23637;&#35270;&#35282;&#12290;&#36825;&#31181;&#32508;&#21512;&#20998;&#26512;&#26088;&#22312;&#20419;&#36827;&#26126;&#26234;&#30340;&#20915;&#31574;&#21644;&#20419;&#36827;&#20013;&#22269;&#21521;&#21487;&#25345;&#32493;&#20132;&#36890;&#26410;&#26469;&#30340;&#36807;&#28193;&#12290;
&lt;/p&gt;
&lt;p&gt;
This review identifies challenges and effective strategies to decarbonize China's rapidly growing transportation sector, currently the third largest carbon emitter, considering China's commitment to peak carbon emissions by 2030 and achieve carbon neutrality by 2060. Key challenges include rising travel demand, unreached peak car ownership, declining bus ridership, gaps between energy technology research and practical application, and limited institutional capacity for decarbonization. This review categorizes current decarbonization measures, strategies, and policies in China's transportation sector using the "Avoid, Shift, Improve" framework, complemented by a novel strategic vector of "Institutional Capacity &amp; Technology Development" to capture broader development perspectives. This comprehensive analysis aims to facilitate informed decision-making and promote collaborative strategies for China's transition to a sustainable transportation future.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#23545;&#20110;&#22312;&#26377;&#38480;&#32500;&#27431;&#27663;&#31354;&#38388;&#20013;&#21462;&#20540;&#30340;&#23545;&#24212;&#20851;&#31995;&#25104;&#20026;&#24320;&#20851;&#31995;&#30340;&#20805;&#20998;&#24517;&#35201;&#26465;&#20214;&#65292;&#24182;&#36890;&#36807;&#24341;&#20837;&#20998;&#21035;&#20984;&#24615;&#30340;&#27010;&#24565;&#65292;&#23558;&#20854;&#19982;&#32463;&#20856;&#30340;&#36830;&#32493;&#24615;&#27010;&#24565;&#32852;&#31995;&#36215;&#26469;&#65292;&#20174;&#32780;&#25552;&#20379;&#20102;&#19968;&#31181;&#20984;&#24615;-&#36830;&#32493;&#24615;&#20551;&#35774;&#30340;&#21512;&#24182;&#65292;&#24182;&#23545;&#36873;&#25321;&#29702;&#35770;&#20013;&#30340;&#30456;&#20851;&#27010;&#24565;&#36827;&#34892;&#20102;&#35752;&#35770;&#12290;</title><link>http://arxiv.org/abs/2310.00531</link><description>&lt;p&gt;
&#20998;&#21035;&#20984;&#24615;&#21644;&#20998;&#21035;&#36830;&#32493;&#24615;&#20559;&#22909;&#65306;&#20851;&#20110;Schmeidler&#12289;Shafer&#21644;Bergstrom-Parks-Rader&#32467;&#26524;&#30340;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Separately Convex and Separately Continuous Preferences: On Results of Schmeidler, Shafer, and Bergstrom-Parks-Rader. (arXiv:2310.00531v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.00531
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#23545;&#20110;&#22312;&#26377;&#38480;&#32500;&#27431;&#27663;&#31354;&#38388;&#20013;&#21462;&#20540;&#30340;&#23545;&#24212;&#20851;&#31995;&#25104;&#20026;&#24320;&#20851;&#31995;&#30340;&#20805;&#20998;&#24517;&#35201;&#26465;&#20214;&#65292;&#24182;&#36890;&#36807;&#24341;&#20837;&#20998;&#21035;&#20984;&#24615;&#30340;&#27010;&#24565;&#65292;&#23558;&#20854;&#19982;&#32463;&#20856;&#30340;&#36830;&#32493;&#24615;&#27010;&#24565;&#32852;&#31995;&#36215;&#26469;&#65292;&#20174;&#32780;&#25552;&#20379;&#20102;&#19968;&#31181;&#20984;&#24615;-&#36830;&#32493;&#24615;&#20551;&#35774;&#30340;&#21512;&#24182;&#65292;&#24182;&#23545;&#36873;&#25321;&#29702;&#35770;&#20013;&#30340;&#30456;&#20851;&#27010;&#24565;&#36827;&#34892;&#20102;&#35752;&#35770;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20379;&#20102;&#19968;&#20010;&#23545;&#20110;&#22312;&#26377;&#38480;&#32500;&#27431;&#27663;&#31354;&#38388;&#20013;&#21462;&#20540;&#30340;&#23545;&#24212;&#20851;&#31995;&#25104;&#20026;&#24320;&#20851;&#31995;&#30340;&#20805;&#20998;&#24517;&#35201;&#26465;&#20214;&#65292;&#20197;&#37325;&#26032;&#23457;&#35270;Schmeidler&#65288;1969&#65289;&#12289;Shafer&#65288;1974&#65289;&#12289;Shafer-Sonnenschein&#65288;1975&#65289;&#21644;Bergstrom-Rader-Parks&#65288;1976&#65289;&#30340;&#24320;&#21019;&#24615;&#24037;&#20316;&#65292;&#20197;&#22238;&#31572;&#20182;&#20204;&#21644;&#20182;&#20204;&#30340;&#36861;&#38543;&#32773;&#30041;&#19979;&#30340;&#19968;&#20123;&#26410;&#35299;&#20043;&#35868;&#12290;&#25105;&#20204;&#24341;&#20837;&#20102;&#20998;&#21035;&#20984;&#24615;&#30340;&#27010;&#24565;&#65292;&#24182;&#23558;&#20854;&#19982;&#32463;&#20856;&#30340;&#36830;&#32493;&#24615;&#27010;&#24565;&#32852;&#31995;&#36215;&#26469;&#65292;&#21516;&#26102;&#24378;&#35843;&#20108;&#20803;&#20851;&#31995;&#30340;&#20998;&#31163;&#36830;&#32493;&#24615;&#21644;&#20998;&#31163;&#20984;&#24615;&#30340;&#30456;&#20114;&#20316;&#29992;&#12290;&#22240;&#27492;&#65292;&#25105;&#20204;&#20174;&#24191;&#27867;&#30340;&#36328;&#23398;&#31185;&#35270;&#35282;&#25552;&#20379;&#20102;&#19968;&#31181;&#20984;&#24615;-&#36830;&#32493;&#24615;&#20551;&#35774;&#30340;&#21512;&#24182;&#65292;&#24182;&#35752;&#35770;&#20102;&#22312;&#36873;&#25321;&#29702;&#35770;&#20013;&#26377;&#23454;&#36136;&#24615;&#20852;&#36259;&#30340;&#21512;&#26684;&#27010;&#24565;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
We provide necessary and sufficient conditions for a correspondence taking values in a finite-dimensional Euclidean space to be open so as to revisit the pioneering work of Schmeidler (1969), Shafer (1974), Shafer-Sonnenschein (1975) and Bergstrom-Rader-Parks (1976) to answer several questions they and their followers left open. We introduce the notion of separate convexity for a correspondence and use it to relate to classical notions of continuity while giving salience to the notion of separateness as in the interplay of separate continuity and separate convexity of binary relations. As such, we provide a consolidation of the convexity-continuity postulates from a broad inter-disciplinary perspective and comment on how the qualified notions proposed here have implications of substantive interest for choice theory.
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#22238;&#39038;&#20102;&#20851;&#20110;&#37325;&#26500;&#29983;&#20135;&#32593;&#32476;&#30340;&#25991;&#29486;&#65292;&#20171;&#32461;&#20102;&#22914;&#20309;&#36890;&#36807;&#35266;&#23519;&#25968;&#25454;&#26469;&#25512;&#26029;&#20379;&#24212;&#32593;&#32476;&#30340;&#25299;&#25169;&#32467;&#26500;&#65292;&#24182;&#35752;&#35770;&#20102;&#36825;&#19968;&#20219;&#21153;&#30340;&#37325;&#35201;&#24615;&#21644;&#29420;&#29305;&#24615;&#12290;</title><link>http://arxiv.org/abs/2310.00446</link><description>&lt;p&gt;
&#37325;&#26500;&#20379;&#24212;&#32593;&#32476;
&lt;/p&gt;
&lt;p&gt;
Reconstructing supply networks. (arXiv:2310.00446v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.00446
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#22238;&#39038;&#20102;&#20851;&#20110;&#37325;&#26500;&#29983;&#20135;&#32593;&#32476;&#30340;&#25991;&#29486;&#65292;&#20171;&#32461;&#20102;&#22914;&#20309;&#36890;&#36807;&#35266;&#23519;&#25968;&#25454;&#26469;&#25512;&#26029;&#20379;&#24212;&#32593;&#32476;&#30340;&#25299;&#25169;&#32467;&#26500;&#65292;&#24182;&#35752;&#35770;&#20102;&#36825;&#19968;&#20219;&#21153;&#30340;&#37325;&#35201;&#24615;&#21644;&#29420;&#29305;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#32593;&#32476;&#37325;&#26500;&#26159;&#32593;&#32476;&#31185;&#23398;&#30340;&#19968;&#20010;&#38750;&#24120;&#21457;&#36798;&#30340;&#23376;&#39046;&#22495;&#65292;&#20294;&#30452;&#21040;&#26368;&#36817;&#25165;&#24320;&#22987;&#24212;&#29992;&#20110;&#29983;&#20135;&#32593;&#32476;&#65292;&#20854;&#20013;&#33410;&#28857;&#26159;&#20225;&#19994;&#65292;&#36793;&#20195;&#34920;&#23458;&#25143;&#20379;&#24212;&#21830;&#20851;&#31995;&#12290;&#25105;&#20204;&#22238;&#39038;&#20102;&#24050;&#32463;&#32321;&#33635;&#30340;&#25991;&#29486;&#65292;&#36890;&#36807;&#25968;&#25454;&#30340;&#37096;&#20998;&#12289;&#27719;&#24635;&#25110;&#38388;&#25509;&#35266;&#23519;&#26469;&#25512;&#26029;&#36825;&#20123;&#32593;&#32476;&#30340;&#25299;&#25169;&#32467;&#26500;&#12290;&#25105;&#20204;&#35752;&#35770;&#20102;&#20026;&#20160;&#20040;&#36825;&#26159;&#19968;&#20010;&#37325;&#35201;&#30340;&#20219;&#21153;&#65292;&#38656;&#35201;&#37325;&#26500;&#20160;&#20040;&#65292;&#20197;&#21450;&#23427;&#19982;&#20854;&#20182;&#32593;&#32476;&#37325;&#26500;&#38382;&#39064;&#30340;&#19981;&#21516;&#20043;&#22788;&#65292;&#20197;&#21450;&#19981;&#21516;&#30340;&#30740;&#31350;&#32773;&#22914;&#20309;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#12290;&#25105;&#20204;&#26368;&#21518;&#32473;&#20986;&#20102;&#19968;&#20010;&#30740;&#31350;&#35758;&#31243;&#12290;
&lt;/p&gt;
&lt;p&gt;
Network reconstruction is a well-developed sub-field of network science, but it has only recently been applied to production networks, where nodes are firms and edges represent customer-supplier relationships. We review the literature that has flourished to infer the topology of these networks by partial, aggregate, or indirect observation of the data. We discuss why this is an important endeavour, what needs to be reconstructed, what makes it different from other network reconstruction problems, and how different researchers have approached the problem. We conclude with a research agenda.
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#20351;&#29992;Luce&#30340;&#36873;&#25321;&#20844;&#29702;&#20026;&#22522;&#30784;&#30340;&#19968;&#31867;&#36873;&#25321;&#21644;&#25490;&#21517;&#27169;&#22411;&#65292;&#35777;&#26126;&#20102;&#19982;&#26368;&#22823;&#20284;&#28982;&#20272;&#35745;&#38382;&#39064;&#31561;&#25928;&#30340;&#32463;&#20856;&#30697;&#38453;&#24179;&#34913;&#38382;&#39064;&#12290;&#36890;&#36807;Sinkhorn&#31639;&#27861;&#65292;&#23558;&#36873;&#25321;&#24314;&#27169;&#31639;&#27861;&#32479;&#19968;&#20026;&#30697;&#38453;&#24179;&#34913;&#31639;&#27861;&#30340;&#29305;&#20363;&#12290;&#35770;&#25991;&#36824;&#35299;&#20915;&#20102;Sinkhorn&#31639;&#27861;&#30740;&#31350;&#20013;&#30340;&#37325;&#35201;&#38382;&#39064;&#65292;&#21253;&#25324;&#23545;&#20110;&#38750;&#36127;&#30697;&#38453;&#30340;&#20840;&#23616;&#32447;&#24615;&#25910;&#25947;&#21644;&#23574;&#38160;&#28176;&#36817;&#36895;&#24230;&#30340;&#25551;&#36848;&#12290;</title><link>http://arxiv.org/abs/2310.00260</link><description>&lt;p&gt;
&#20851;&#20110;Sinkhorn&#31639;&#27861;&#21644;&#36873;&#25321;&#24314;&#27169;&#30340;&#35770;&#25991;
&lt;/p&gt;
&lt;p&gt;
On Sinkhorn's Algorithm and Choice Modeling. (arXiv:2310.00260v1 [math.OC])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.00260
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#20351;&#29992;Luce&#30340;&#36873;&#25321;&#20844;&#29702;&#20026;&#22522;&#30784;&#30340;&#19968;&#31867;&#36873;&#25321;&#21644;&#25490;&#21517;&#27169;&#22411;&#65292;&#35777;&#26126;&#20102;&#19982;&#26368;&#22823;&#20284;&#28982;&#20272;&#35745;&#38382;&#39064;&#31561;&#25928;&#30340;&#32463;&#20856;&#30697;&#38453;&#24179;&#34913;&#38382;&#39064;&#12290;&#36890;&#36807;Sinkhorn&#31639;&#27861;&#65292;&#23558;&#36873;&#25321;&#24314;&#27169;&#31639;&#27861;&#32479;&#19968;&#20026;&#30697;&#38453;&#24179;&#34913;&#31639;&#27861;&#30340;&#29305;&#20363;&#12290;&#35770;&#25991;&#36824;&#35299;&#20915;&#20102;Sinkhorn&#31639;&#27861;&#30740;&#31350;&#20013;&#30340;&#37325;&#35201;&#38382;&#39064;&#65292;&#21253;&#25324;&#23545;&#20110;&#38750;&#36127;&#30697;&#38453;&#30340;&#20840;&#23616;&#32447;&#24615;&#25910;&#25947;&#21644;&#23574;&#38160;&#28176;&#36817;&#36895;&#24230;&#30340;&#25551;&#36848;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#23545;&#20110;&#22522;&#20110;Luce&#36873;&#25321;&#20844;&#29702;&#30340;&#24191;&#27867;&#36873;&#25321;&#21644;&#25490;&#21517;&#27169;&#22411;&#65292;&#21253;&#25324;Bradley-Terry-Luce&#21644;Plackett-Luce&#27169;&#22411;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#30456;&#20851;&#30340;&#26368;&#22823;&#20284;&#28982;&#20272;&#35745;&#38382;&#39064;&#31561;&#20215;&#20110;&#20855;&#26377;&#30446;&#26631;&#34892;&#21644;&#21015;&#21644;&#30340;&#32463;&#20856;&#30697;&#38453;&#24179;&#34913;&#38382;&#39064;&#12290;&#36825;&#20010;&#35266;&#28857;&#25171;&#24320;&#20102;&#20004;&#20010;&#30475;&#20284;&#19981;&#30456;&#20851;&#30340;&#30740;&#31350;&#39046;&#22495;&#20043;&#38388;&#30340;&#20132;&#27969;&#20043;&#38376;&#65292;&#24182;&#20351;&#25105;&#20204;&#33021;&#22815;&#23558;&#36873;&#25321;&#24314;&#27169;&#25991;&#29486;&#20013;&#30340;&#29616;&#26377;&#31639;&#27861;&#32479;&#19968;&#20026;Sinkhorn&#30697;&#38453;&#24179;&#34913;&#31639;&#27861;&#30340;&#29305;&#27530;&#23454;&#20363;&#25110;&#31867;&#20284;&#29289;&#12290;&#25105;&#20204;&#20174;&#36825;&#20123;&#32852;&#31995;&#20013;&#33719;&#24471;&#21551;&#21457;&#65292;&#24182;&#35299;&#20915;&#20102;Sinkhorn&#31639;&#27861;&#30740;&#31350;&#20013;&#30340;&#37325;&#35201;&#24320;&#25918;&#24615;&#38382;&#39064;&#12290;&#25105;&#20204;&#39318;&#20808;&#35777;&#26126;&#20102;&#24403;&#30697;&#38453;&#24179;&#34913;&#38382;&#39064;&#23384;&#22312;&#26377;&#38480;&#35299;&#26102;&#65292;Sinkhorn&#31639;&#27861;&#23545;&#20110;&#38750;&#36127;&#30697;&#38453;&#30340;&#20840;&#23616;&#32447;&#24615;&#25910;&#25947;&#12290;&#25105;&#20204;&#36890;&#36807;&#25968;&#25454;&#26500;&#24314;&#30340;&#20108;&#20998;&#22270;&#30340;&#20195;&#25968;&#36830;&#36890;&#24615;&#26469;&#25551;&#36848;&#36825;&#31181;&#20840;&#23616;&#25910;&#25947;&#36895;&#24230;&#12290;&#25509;&#19979;&#26469;&#65292;&#25105;&#20204;&#36824;&#24471;&#20986;&#20102;&#32447;&#24615;&#25910;&#25947;&#30340;&#23574;&#38160;&#28176;&#36817;&#36895;&#24230;&#12290;
&lt;/p&gt;
&lt;p&gt;
For a broad class of choice and ranking models based on Luce's choice axiom, including the Bradley--Terry--Luce and Plackett--Luce models, we show that the associated maximum likelihood estimation problems are equivalent to a classic matrix balancing problem with target row and column sums. This perspective opens doors between two seemingly unrelated research areas, and allows us to unify existing algorithms in the choice modeling literature as special instances or analogs of Sinkhorn's celebrated algorithm for matrix balancing. We draw inspirations from these connections and resolve important open problems on the study of Sinkhorn's algorithm. We first prove the global linear convergence of Sinkhorn's algorithm for non-negative matrices whenever finite solutions to the matrix balancing problem exist. We characterize this global rate of convergence in terms of the algebraic connectivity of the bipartite graph constructed from data. Next, we also derive the sharp asymptotic rate of line
&lt;/p&gt;</description></item><item><title>&#36890;&#36807;&#20351;&#29992;&#25968;&#23383;&#30165;&#36857;&#25968;&#25454;&#65292;&#25105;&#20204;&#21457;&#29616;&#20102;&#19977;&#20010;&#27979;&#37327;&#25361;&#25112;&#65306;&#32416;&#32544;&#12289;&#24179;&#22374;&#21270;&#21644;&#25414;&#32465;&#12290;&#36825;&#20123;&#25361;&#25112;&#20250;&#24341;&#20837;&#39069;&#22806;&#30340;&#19981;&#30830;&#23450;&#24615;&#21644;&#38169;&#35823;&#65292;&#20294;&#20063;&#25552;&#20379;&#20102;&#28145;&#20837;&#20102;&#35299;&#23186;&#20307;&#20351;&#29992;&#21644;&#20869;&#23481;&#28040;&#36153;&#30340;&#26426;&#20250;&#12290;</title><link>http://arxiv.org/abs/2310.00197</link><description>&lt;p&gt;
&#19977;&#20010;&#24120;&#35265;&#30340;&#25968;&#23383;&#30165;&#36857;&#25968;&#25454;&#27979;&#37327;&#32771;&#34385;&#30340;&#35782;&#21035;&#12289;&#24433;&#21709;&#21644;&#26426;&#20250;
&lt;/p&gt;
&lt;p&gt;
Identification, Impacts, and Opportunities of Three Common Measurement Considerations when using Digital Trace Data. (arXiv:2310.00197v1 [cs.HC])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.00197
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#20351;&#29992;&#25968;&#23383;&#30165;&#36857;&#25968;&#25454;&#65292;&#25105;&#20204;&#21457;&#29616;&#20102;&#19977;&#20010;&#27979;&#37327;&#25361;&#25112;&#65306;&#32416;&#32544;&#12289;&#24179;&#22374;&#21270;&#21644;&#25414;&#32465;&#12290;&#36825;&#20123;&#25361;&#25112;&#20250;&#24341;&#20837;&#39069;&#22806;&#30340;&#19981;&#30830;&#23450;&#24615;&#21644;&#38169;&#35823;&#65292;&#20294;&#20063;&#25552;&#20379;&#20102;&#28145;&#20837;&#20102;&#35299;&#23186;&#20307;&#20351;&#29992;&#21644;&#20869;&#23481;&#28040;&#36153;&#30340;&#26426;&#20250;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#32534;&#30446;&#25968;&#23383;&#30165;&#36857;&#20013;&#30340;&#29305;&#23450;URL&#12289;&#24086;&#23376;&#21644;&#24212;&#29992;&#31243;&#24207;&#26159;&#27979;&#37327;&#23186;&#20307;&#20351;&#29992;&#21644;&#20869;&#23481;&#28040;&#36153;&#30340;&#26368;&#20339;&#23454;&#36341;&#12290;&#28982;&#32780;&#65292;&#23613;&#31649;&#26356;&#31934;&#30830;&#65292;&#25968;&#23383;&#30165;&#36857;&#21487;&#33021;&#20250;&#24341;&#20837;&#39069;&#22806;&#30340;&#19981;&#30830;&#23450;&#24615;&#21644;&#26032;&#30340;&#27979;&#37327;&#38169;&#35823;&#12290;&#22312;&#26412;&#30740;&#31350;&#20013;&#65292;&#25105;&#20204;&#20351;&#29992;&#19968;&#31181;&#26032;&#30340;&#27979;&#37327;&#26694;&#26550;&#8212;Screenomics&#65292;&#35760;&#24405;&#20010;&#20307;&#19982;&#31227;&#21160;&#35774;&#22791;&#20132;&#20114;&#26102;&#27599;&#38548;&#20960;&#31186;&#38047;&#30340;&#23631;&#24149;&#25130;&#22270;&#26469;&#25366;&#25496;&#20351;&#29992;&#25968;&#23383;&#30165;&#36857;&#25968;&#25454;&#26102;&#30340;&#19977;&#20010;&#26032;&#30340;&#27979;&#37327;&#25361;&#25112;&#12290;&#25105;&#20204;&#23558;&#36825;&#20123;&#32771;&#34385;&#26631;&#35760;&#20026;&#65306;&#65288;1&#65289;&#32416;&#32544;-&#36890;&#36807;&#26367;&#20195;&#20869;&#23481;&#26333;&#20809;&#26469;&#27979;&#37327;&#26684;&#24335;&#26333;&#20809;&#30340;&#24120;&#35265;&#38169;&#35823;&#65307;&#65288;2&#65289;&#24179;&#22374;&#21270;-&#32858;&#21512;&#23186;&#20307;&#20114;&#21160;&#30340;&#29420;&#29305;&#29255;&#27573;&#32780;&#19981;&#21253;&#21547;&#26102;&#38388;&#20449;&#24687;&#65292;&#26368;&#24120;&#35265;&#30340;&#26159;&#22312;&#20010;&#20307;&#20869;&#37096;&#65307;&#65288;3&#65289;&#25414;&#32465;-&#23545;&#23186;&#20307;&#20114;&#21160;&#29255;&#27573;&#30340;&#25345;&#32493;&#26102;&#38388;&#36827;&#34892;&#27714;&#21644;&#12290;
&lt;/p&gt;
&lt;p&gt;
Cataloguing specific URLs, posts, and applications with digital traces is the new best practice for measuring media use and content consumption. Despite the apparent accuracy that comes with greater granularity, however, digital traces may introduce additional ambiguity and new errors into the measurement of media use. In this note, we identify three new measurement challenges when using Digital Trace Data that were recently uncovered using a new measurement framework - Screenomics - that records media use at the granularity of individual screenshots obtained every few seconds as people interact with mobile devices. We label the considerations as follows: (1) entangling - the common measurement error introduced by proxying exposure to content by exposure to format; (2) flattening - aggregating unique segments of media interaction without incorporating temporal information, most commonly intraindividually and (3) bundling - summation of the durations of segments of media interaction, in
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#36890;&#36807;&#24341;&#20837;&#38543;&#26426;&#21033;&#29575;&#27169;&#22411;&#21644;&#38750;&#32447;&#24615;&#34701;&#36164;&#25104;&#26412;&#26469;&#25506;&#35752;&#27668;&#20505;&#21464;&#21270;&#20943;&#32531;&#27169;&#22411;&#20013;&#30340;&#20195;&#38469;&#20844;&#24179;&#38382;&#39064;&#12290;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;&#26368;&#20248;&#30340;&#38543;&#26426;&#20943;&#25490;&#36335;&#24452;&#21487;&#33021;&#20250;&#22686;&#21152;&#25104;&#26412;&#21644;&#39118;&#38505;&#30456;&#20851;&#30340;&#20195;&#38469;&#19981;&#24179;&#31561;&#65292;&#20294;&#36890;&#36807;&#34701;&#36164;&#25104;&#26412;&#30340;&#24341;&#20837;&#21487;&#20197;&#25913;&#21892;&#36825;&#31181;&#24773;&#20917;&#12290;</title><link>http://arxiv.org/abs/2309.16186</link><description>&lt;p&gt;
&#27668;&#20505;&#21464;&#21270;&#20943;&#32531;&#27169;&#22411;&#20013;&#30340;&#20195;&#38469;&#20844;&#24179;&#65306;&#38543;&#26426;&#21033;&#29575;&#24341;&#20837;&#19981;&#21033;&#24433;&#21709;&#65292;&#20294;&#65288;&#38750;&#32447;&#24615;&#65289;&#34701;&#36164;&#25104;&#26412;&#21487;&#20197;&#25913;&#21892;&#20195;&#38469;&#20844;&#24179;&#12290;
&lt;/p&gt;
&lt;p&gt;
Intergenerational Equity in Models of Climate Change Mitigation: Stochastic Interest Rates introduce Adverse Effects, but (Non-linear) Funding Costs can Improve Intergenerational Equity. (arXiv:2309.16186v1 [q-fin.MF])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.16186
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#36890;&#36807;&#24341;&#20837;&#38543;&#26426;&#21033;&#29575;&#27169;&#22411;&#21644;&#38750;&#32447;&#24615;&#34701;&#36164;&#25104;&#26412;&#26469;&#25506;&#35752;&#27668;&#20505;&#21464;&#21270;&#20943;&#32531;&#27169;&#22411;&#20013;&#30340;&#20195;&#38469;&#20844;&#24179;&#38382;&#39064;&#12290;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;&#26368;&#20248;&#30340;&#38543;&#26426;&#20943;&#25490;&#36335;&#24452;&#21487;&#33021;&#20250;&#22686;&#21152;&#25104;&#26412;&#21644;&#39118;&#38505;&#30456;&#20851;&#30340;&#20195;&#38469;&#19981;&#24179;&#31561;&#65292;&#20294;&#36890;&#36807;&#34701;&#36164;&#25104;&#26412;&#30340;&#24341;&#20837;&#21487;&#20197;&#25913;&#21892;&#36825;&#31181;&#24773;&#20917;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35780;&#20272;&#27668;&#20505;&#21464;&#21270;&#25104;&#26412;&#23545;&#20110;&#23547;&#27714;&#21521;&#20928;&#38646;&#25490;&#25918;&#32463;&#27982;&#36716;&#22411;&#30340;&#26377;&#25928;&#36335;&#24452;&#33267;&#20851;&#37325;&#35201;&#65292;&#36825;&#23545;&#20110;&#31283;&#23450;&#20840;&#29699;&#28201;&#24230;&#33267;&#20219;&#20309;&#27700;&#24179;&#37117;&#26159;&#24517;&#35201;&#30340;&#12290;&#32771;&#34385;&#26410;&#26469;&#21033;&#29575;&#30340;&#19981;&#30830;&#23450;&#24615;&#65292;&#25105;&#20204;&#20351;&#29992;&#38543;&#26426;&#21033;&#29575;&#27169;&#22411;&#20462;&#27491;&#20102;DICE&#27169;&#22411;&#65292;&#26469;&#35780;&#20272;&#27668;&#20505;&#21464;&#21270;&#20943;&#32531;&#30340;&#25928;&#30410;&#21644;&#25104;&#26412;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#26368;&#20248;&#30340;&#38543;&#26426;&#20943;&#25490;&#36335;&#24452;&#21487;&#33021;&#20250;&#22686;&#21152;&#19982;&#25104;&#26412;&#21644;&#39118;&#38505;&#30456;&#20851;&#30340;&#20195;&#38469;&#19981;&#24179;&#31561;&#12290;&#22914;&#26524;&#25105;&#20204;&#32771;&#34385;&#21040;&#20943;&#25490;&#25104;&#26412;&#21487;&#33021;&#36890;&#36807;&#36151;&#27454;&#26469;&#34701;&#36164;&#65292;&#37027;&#20040;&#26356;&#26089;&#23454;&#29616;&#20928;&#38646;&#26159;&#26368;&#20248;&#30340;&#36873;&#25321;&#12290;&#22312;&#36825;&#37324;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#24341;&#20837;&#20943;&#25490;&#25104;&#26412;&#34701;&#36164;&#21487;&#20197;&#38477;&#20302;&#26410;&#26469;&#29616;&#37329;&#27969;&#30340;&#21464;&#24322;&#24615;&#65292;&#36825;&#20123;&#29616;&#37329;&#27969;&#22312;&#19981;&#21516;&#30340;...
&lt;/p&gt;
&lt;p&gt;
Assessing the costs of climate change is essential to find efficient pathways for the transition to a net-zero emissions economy, which is necessary to stabilise global temperatures at any level. Evaluating benefits and costs of climate change mitigation the discount rate converting future damages and costs into net-present values influences timing of mitigation.  Here, we amend the DICE model with a stochastic interest rate model to consider uncertainty of discount rates in the future. Since the optimal abatement paths depends on interest rates, we assume a stochastic abatement model.  We show that the optimal stochastic abatement path can increase the intergenerational inequality with respect to cost and risk.  If we consider additionally that abatement costs may be funded via loans for which interest has to be paid, it is optimal to achieve net-zero earlier.  Here we show, that introducing funding of abatement cost reduces the variation of future cash-flows, which occur at different
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#26032;&#30340;&#26234;&#33021;&#20445;&#30041;&#31995;&#32479;&#65292;&#20351;&#29992;&#38408;&#20540;&#27169;&#22411;&#20801;&#35768;&#29420;&#31435;&#30340;&#20248;&#20808;&#32423;&#25490;&#24207;&#21644;&#20219;&#24847;&#30340;&#21463;&#30410;&#20154;&#21644;&#36164;&#26684;&#38408;&#20540;&#65292;&#20197;&#23454;&#29616;&#20248;&#21270;&#20998;&#37197;&#21333;&#20803;&#25968;&#30340;&#20998;&#37197;&#12290;</title><link>http://arxiv.org/abs/2309.13766</link><description>&lt;p&gt;
&#38408;&#20540;&#20445;&#30041;&#21305;&#37197;
&lt;/p&gt;
&lt;p&gt;
Reserve Matching with Thresholds. (arXiv:2309.13766v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.13766
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#26032;&#30340;&#26234;&#33021;&#20445;&#30041;&#31995;&#32479;&#65292;&#20351;&#29992;&#38408;&#20540;&#27169;&#22411;&#20801;&#35768;&#29420;&#31435;&#30340;&#20248;&#20808;&#32423;&#25490;&#24207;&#21644;&#20219;&#24847;&#30340;&#21463;&#30410;&#20154;&#21644;&#36164;&#26684;&#38408;&#20540;&#65292;&#20197;&#23454;&#29616;&#20248;&#21270;&#20998;&#37197;&#21333;&#20803;&#25968;&#30340;&#20998;&#37197;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20445;&#30041;&#31995;&#32479;&#36890;&#36807;&#21019;&#24314;&#20248;&#20808;&#32771;&#34385;&#21508;&#33258;&#21463;&#30410;&#20154;&#30340;&#31867;&#21035;&#65292;&#20197;&#36866;&#24212;&#22810;&#20010;&#37325;&#35201;&#25110;&#20195;&#34920;&#24615;&#19981;&#36275;&#30340;&#32676;&#20307;&#26469;&#20998;&#37197;&#19981;&#21487;&#20998;&#21106;&#30340;&#31232;&#32570;&#36164;&#28304;&#12290;&#19968;&#20123;&#24212;&#29992;&#21253;&#25324;&#30123;&#33495;&#30340;&#26368;&#20248;&#20998;&#37197;&#65292;&#25110;&#23558;&#23569;&#25968;&#20154;&#20998;&#37197;&#21040;&#21360;&#24230;&#30340;&#31934;&#33521;&#23398;&#38498;&#12290;&#26234;&#33021;&#20998;&#37197;&#26159;&#25351;&#20248;&#21270;&#20998;&#37197;&#21333;&#20803;&#25968;&#30340;&#20998;&#37197;&#12290;&#20808;&#21069;&#30340;&#25991;&#29486;&#22823;&#22810;&#20551;&#23450;&#20102;&#22522;&#20934;&#20248;&#20808;&#32423;&#65292;&#36825;&#22312;&#19981;&#21516;&#31867;&#21035;&#30340;&#20248;&#20808;&#32423;&#25490;&#24207;&#20043;&#38388;&#20250;&#20135;&#29983;&#37325;&#35201;&#30340;&#30456;&#20114;&#20381;&#36182;&#12290;&#23427;&#36824;&#20551;&#23450;&#35201;&#20040;&#27599;&#20010;&#20154;&#37117;&#26377;&#36164;&#26684;&#20174;&#20219;&#20309;&#31867;&#21035;&#25509;&#25910;&#21333;&#20803;&#65292;&#35201;&#20040;&#21482;&#26377;&#21463;&#30410;&#20154;&#26377;&#36164;&#26684;&#12290;&#25105;&#20204;&#25552;&#20986;&#30340;&#20840;&#38754;&#38408;&#20540;&#27169;&#22411;&#20801;&#35768;&#22312;&#31867;&#21035;&#20043;&#38388;&#36827;&#34892;&#29420;&#31435;&#30340;&#20248;&#20808;&#32423;&#25490;&#24207;&#65292;&#24182;&#35774;&#32622;&#20219;&#24847;&#30340;&#21463;&#30410;&#20154;&#21644;&#36164;&#26684;&#38408;&#20540;&#65292;&#20351;&#20915;&#31574;&#32773;&#33021;&#22815;&#36991;&#20813;&#22312;&#24179;&#26435;&#34892;&#21160;&#31995;&#32479;&#20013;&#36827;&#34892;&#26080;&#27861;&#27604;&#36739;&#30340;&#27604;&#36739;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#26032;&#30340;&#26234;&#33021;&#20445;&#30041;&#31995;&#32479;&#65292;&#21487;&#20197;&#21516;&#26102;&#20248;&#21270;&#20004;&#20010;&#30446;&#26631;&#12290;
&lt;/p&gt;
&lt;p&gt;
Reserve systems are used to accommodate multiple essential or underrepresented groups in allocating indivisible scarce resources by creating categories that prioritize their respective beneficiaries. Some applications include the optimal allocation of vaccines, or assignment of minority students to elite colleges in India. An allocation is called smart if it optimizes the number of units distributed. Previous literature mostly assumed baseline priorities, which impose significant interdependencies between the priority ordering of different categories. It also assumes either everybody is eligible for receiving a unit from any category, or only the beneficiaries are eligible. The comprehensive Threshold Model we propose allows independent priority orderings among categories and arbitrary beneficiary and eligibility thresholds, enabling policymakers to avoid comparing incomparables in affirmative action systems. We present a new smart reserve system that optimizes two objectives simultane
&lt;/p&gt;</description></item><item><title>AI&#33258;&#21160;&#21270;&#30340;&#29190;&#28856;&#24615;&#22686;&#38271;&#26159;&#21487;&#33021;&#30340;&#65292;&#21487;&#33021;&#20250;&#21152;&#36895;&#20840;&#29699;&#32463;&#27982;&#22686;&#38271;&#65292;&#20294;&#30446;&#21069;&#23545;&#27492;&#30340;&#39640;&#24230;&#33258;&#20449;&#26159;&#19981;&#21512;&#36866;&#30340;&#12290;</title><link>http://arxiv.org/abs/2309.11690</link><description>&lt;p&gt;
AI&#33258;&#21160;&#21270;&#30340;&#29190;&#28856;&#24615;&#22686;&#38271;: &#35770;&#35777;&#32508;&#36848;
&lt;/p&gt;
&lt;p&gt;
Explosive growth from AI automation: A review of the arguments. (arXiv:2309.11690v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.11690
&lt;/p&gt;
&lt;p&gt;
AI&#33258;&#21160;&#21270;&#30340;&#29190;&#28856;&#24615;&#22686;&#38271;&#26159;&#21487;&#33021;&#30340;&#65292;&#21487;&#33021;&#20250;&#21152;&#36895;&#20840;&#29699;&#32463;&#27982;&#22686;&#38271;&#65292;&#20294;&#30446;&#21069;&#23545;&#27492;&#30340;&#39640;&#24230;&#33258;&#20449;&#26159;&#19981;&#21512;&#36866;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#22823;&#35268;&#27169;AI&#33258;&#21160;&#21270;&#26159;&#21542;&#33021;&#22815;&#20351;&#20840;&#29699;&#32463;&#27982;&#22686;&#38271;&#21152;&#36895;&#36798;&#21040;&#32422;&#19968;&#20010;&#25968;&#37327;&#32423;&#65292;&#31867;&#20284;&#20110;&#24037;&#19994;&#38761;&#21629;&#25152;&#24102;&#26469;&#30340;&#32463;&#27982;&#22686;&#38271;&#25928;&#24212;&#12290;&#25105;&#20204;&#30830;&#23450;&#20102;&#36825;&#31181;&#22686;&#38271;&#30340;&#19977;&#20010;&#20027;&#35201;&#39537;&#21160;&#22240;&#32032;&#65306;1&#65289;AI&#8220;&#21171;&#21160;&#21147;&#8221;&#30340;&#21487;&#25193;&#23637;&#24615;&#20351;&#24471;&#35268;&#27169;&#36882;&#22686;&#20877;&#29616;&#65292;2&#65289;AI&#21171;&#21160;&#21147;&#30340;&#24555;&#36895;&#25193;&#24352;&#65292;&#20197;&#21450;3&#65289;&#22312;&#30701;&#26102;&#38388;&#20869;&#36827;&#34892;&#30340;&#24555;&#36895;&#33258;&#21160;&#21270;&#24102;&#26469;&#30340;&#20135;&#20986;&#22823;&#24133;&#22686;&#21152;&#12290;&#22312;&#36825;&#20010;&#32972;&#26223;&#19979;&#65292;&#25105;&#20204;&#35780;&#20272;&#20102;&#20061;&#20010;&#21453;&#23545;&#35770;&#28857;&#65292;&#21253;&#25324;&#30417;&#31649;&#38556;&#30861;&#12289;&#20135;&#33021;&#29942;&#39048;&#12289;&#21305;&#37197;&#38382;&#39064;&#21644;&#33258;&#21160;&#21270;&#30340;&#36895;&#24230;&#12290;&#25105;&#20204;&#26242;&#26102;&#35780;&#20272;&#20102;&#36825;&#20123;&#35770;&#28857;&#65292;&#21457;&#29616;&#22823;&#22810;&#25968;&#37117;&#19981;&#22826;&#21487;&#33021;&#25104;&#20026;&#20915;&#23450;&#22240;&#32032;&#12290;&#25105;&#20204;&#24471;&#20986;&#32467;&#35770;&#35748;&#20026;&#65292;&#22914;&#26524;AI&#33021;&#22815;&#24191;&#27867;&#26367;&#20195;&#20154;&#21147;&#21171;&#21160;&#65292;&#29190;&#28856;&#24615;&#22686;&#38271;&#20284;&#20046;&#26159;&#26377;&#21487;&#33021;&#30340;&#65292;&#20294;&#30446;&#21069;&#23545;&#36825;&#19968;&#35828;&#27861;&#30340;&#39640;&#24230;&#33258;&#20449;&#20284;&#20046;&#26159;&#19981;&#21512;&#29702;&#30340;&#12290;&#20851;&#20110;AI&#30417;&#31649;&#21709;&#24212;&#30340;&#24378;&#24230;&#12289;&#29983;&#20135;&#20013;&#30340;&#29289;&#29702;&#29942;&#39048;&#21644;AI&#30340;&#32463;&#27982;&#20215;&#20540;&#65292;&#20173;&#28982;&#23384;&#22312;&#20851;&#38190;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;
We examine whether substantial AI automation could accelerate global economic growth by about an order of magnitude, akin to the economic growth effects of the Industrial Revolution. We identify three primary drivers for such growth: 1) the scalability of an AI ``labor force" restoring a regime of increasing returns to scale, 2) the rapid expansion of an AI labor force, and 3) a massive increase in output from rapid automation occurring over a brief period of time. Against this backdrop, we evaluate nine counterarguments, including regulatory hurdles, production bottlenecks, alignment issues, and the pace of automation. We tentatively assess these arguments, finding most are unlikely deciders. We conclude that explosive growth seems plausible with AI capable of broadly substituting for human labor, but high confidence in this claim seems currently unwarranted. Key questions remain about the intensity of regulatory responses to AI, physical bottlenecks in production, the economic value 
&lt;/p&gt;</description></item><item><title>&#36890;&#36807;&#20998;&#26512;&#26368;&#20339;&#21709;&#24212;&#22270;&#30340;&#36830;&#36890;&#29305;&#24615;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#20960;&#20046;&#27599;&#20010;&#20855;&#26377;&#32431;&#32435;&#20160;&#22343;&#34913;&#30340;&#8220;&#22823;&#22411;&#8221;&#36890;&#29992;&#28216;&#25103;&#37117;&#26159;&#36830;&#36890;&#30340;&#12290;&#36825;&#23545;&#20110;&#28216;&#25103;&#20013;&#30340;&#21160;&#24577;&#36807;&#31243;&#26377;&#30528;&#37325;&#35201;&#24847;&#20041;&#65292;&#22240;&#20026;&#35768;&#22810;&#33258;&#36866;&#24212;&#21160;&#24577;&#20250;&#23548;&#33268;&#22343;&#34913;&#12290;</title><link>http://arxiv.org/abs/2309.10609</link><description>&lt;p&gt;
&#28216;&#25103;&#36830;&#36890;&#24615;&#19982;&#33258;&#36866;&#24212;&#21160;&#24577;
&lt;/p&gt;
&lt;p&gt;
Game Connectivity and Adaptive Dynamics. (arXiv:2309.10609v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.10609
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#20998;&#26512;&#26368;&#20339;&#21709;&#24212;&#22270;&#30340;&#36830;&#36890;&#29305;&#24615;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#20960;&#20046;&#27599;&#20010;&#20855;&#26377;&#32431;&#32435;&#20160;&#22343;&#34913;&#30340;&#8220;&#22823;&#22411;&#8221;&#36890;&#29992;&#28216;&#25103;&#37117;&#26159;&#36830;&#36890;&#30340;&#12290;&#36825;&#23545;&#20110;&#28216;&#25103;&#20013;&#30340;&#21160;&#24577;&#36807;&#31243;&#26377;&#30528;&#37325;&#35201;&#24847;&#20041;&#65292;&#22240;&#20026;&#35768;&#22810;&#33258;&#36866;&#24212;&#21160;&#24577;&#20250;&#23548;&#33268;&#22343;&#34913;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#36890;&#36807;&#20998;&#26512;&#26368;&#20339;&#21709;&#24212;&#22270;&#30340;&#36830;&#36890;&#29305;&#24615;&#65292;&#20998;&#26512;&#20102;&#28216;&#25103;&#30340;&#20856;&#22411;&#32467;&#26500;&#12290;&#29305;&#21035;&#26159;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#20960;&#20046;&#27599;&#20010;&#20855;&#26377;&#32431;&#32435;&#20160;&#22343;&#34913;&#30340;&#8220;&#22823;&#22411;&#8221;&#36890;&#29992;&#28216;&#25103;&#37117;&#26159;&#36830;&#36890;&#30340;&#65292;&#36825;&#24847;&#21619;&#30528;&#27599;&#20010;&#38750;&#22343;&#34913;&#30340;&#34892;&#21160;&#37197;&#32622;&#37117;&#21487;&#20197;&#36890;&#36807;&#26368;&#20339;&#21709;&#24212;&#36335;&#24452;&#21040;&#36798;&#27599;&#20010;&#32431;&#32435;&#20160;&#22343;&#34913;&#12290;&#36825;&#23545;&#20110;&#28216;&#25103;&#20013;&#30340;&#21160;&#24577;&#36807;&#31243;&#26377;&#30528;&#37325;&#35201;&#24847;&#20041;&#65306;&#35768;&#22810;&#33258;&#36866;&#24212;&#21160;&#24577;&#65292;&#20363;&#22914;&#24102;&#26377;&#24815;&#24615;&#30340;&#26368;&#20339;&#21709;&#24212;&#21160;&#24577;&#65292;&#22312;&#36830;&#36890;&#30340;&#28216;&#25103;&#20013;&#20250;&#23548;&#33268;&#22343;&#34913;&#12290;&#22240;&#27492;&#65292;&#23384;&#22312;&#31616;&#21333;&#30340;&#12289;&#19981;&#32806;&#21512;&#30340;&#33258;&#36866;&#24212;&#21160;&#24577;&#65292;&#25353;&#21608;&#26399;&#28216;&#25103;&#23558;&#20960;&#20046;&#30830;&#23450;&#22320;&#25910;&#25947;&#21040;&#20855;&#26377;&#32431;&#32435;&#20160;&#22343;&#34913;&#30340;&#8220;&#22823;&#22411;&#8221;&#36890;&#29992;&#28216;&#25103;&#30340;&#24773;&#20917;&#19979;&#12290;
&lt;/p&gt;
&lt;p&gt;
We analyse the typical structure of games in terms of the connectivity properties of their best-response graphs. In particular, we show that almost every 'large' generic game that has a pure Nash equilibrium is connected, meaning that every non-equilibrium action profile can reach every pure Nash equilibrium via best-response paths. This has implications for dynamics in games: many adaptive dynamics, such as the best-response dynamic with inertia, lead to equilibrium in connected games. It follows that there are simple, uncoupled, adaptive dynamics for which period-by-period play converges almost surely to a pure Nash equilibrium in almost every 'large' generic game that has one. We build on recent results in probabilistic combinatorics for our characterisation of game connectivity.
&lt;/p&gt;</description></item><item><title>&#35813;&#30740;&#31350;&#20351;&#29992;&#33258;&#25105;&#20851;&#27880;&#27169;&#22359;&#30340;&#28145;&#24230;&#23398;&#20064;&#27169;&#22411;&#65292;&#26681;&#25454;FOMC&#20250;&#35758;&#30340;&#24322;&#35758;&#35760;&#24405;&#21644;&#20250;&#35758;&#35760;&#24405;&#65292;&#27979;&#37327;&#20102;&#27599;&#20301;&#25104;&#21592;&#22312;&#27599;&#20010;&#20250;&#35758;&#20013;&#30340;&#24322;&#35758;&#31243;&#24230;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#23613;&#31649;&#24322;&#35758;&#24456;&#23569;&#35265;&#65292;&#25104;&#21592;&#20204;&#32463;&#24120;&#23545;&#25919;&#31574;&#20915;&#31574;&#25345;&#20445;&#30041;&#24847;&#35265;&#12290;&#24322;&#35758;&#31243;&#24230;&#20027;&#35201;&#21463;&#21040;&#24403;&#21069;&#25110;&#39044;&#27979;&#30340;&#23439;&#35266;&#32463;&#27982;&#25968;&#25454;&#30340;&#24433;&#21709;&#65292;&#32780;&#25104;&#21592;&#30340;&#20010;&#20154;&#29305;&#24449;&#20960;&#20046;&#19981;&#36215;&#20316;&#29992;&#12290;&#27492;&#22806;&#65292;&#30740;&#31350;&#36824;&#21457;&#29616;&#20102;&#20250;&#35758;&#20043;&#38388;&#25104;&#21592;&#30340;&#28436;&#35762;&#19982;&#38543;&#21518;&#20250;&#35758;&#30340;&#24322;&#35758;&#31243;&#24230;&#20043;&#38388;&#23384;&#22312;&#24369;&#30456;&#20851;&#24615;&#12290;&#26368;&#21518;&#65292;&#30740;&#31350;&#21457;&#29616;&#65292;&#27599;&#24403;&#36135;&#24065;&#25919;&#31574;&#34892;&#21160;&#26356;&#21152;&#28608;&#36827;&#26102;&#65292;&#24322;&#35758;&#31243;&#24230;&#20250;&#22686;&#21152;&#12290;</title><link>http://arxiv.org/abs/2308.10131</link><description>&lt;p&gt;
&#25345;&#19981;&#21516;&#24847;&#35265;&#65306;&#27979;&#37327;FOMC&#20250;&#35758;&#20013;&#30340;&#38544;&#34255;&#24322;&#35758;
&lt;/p&gt;
&lt;p&gt;
Agree to Disagree: Measuring Hidden Dissents in FOMC Meetings. (arXiv:2308.10131v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.10131
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#20351;&#29992;&#33258;&#25105;&#20851;&#27880;&#27169;&#22359;&#30340;&#28145;&#24230;&#23398;&#20064;&#27169;&#22411;&#65292;&#26681;&#25454;FOMC&#20250;&#35758;&#30340;&#24322;&#35758;&#35760;&#24405;&#21644;&#20250;&#35758;&#35760;&#24405;&#65292;&#27979;&#37327;&#20102;&#27599;&#20301;&#25104;&#21592;&#22312;&#27599;&#20010;&#20250;&#35758;&#20013;&#30340;&#24322;&#35758;&#31243;&#24230;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#23613;&#31649;&#24322;&#35758;&#24456;&#23569;&#35265;&#65292;&#25104;&#21592;&#20204;&#32463;&#24120;&#23545;&#25919;&#31574;&#20915;&#31574;&#25345;&#20445;&#30041;&#24847;&#35265;&#12290;&#24322;&#35758;&#31243;&#24230;&#20027;&#35201;&#21463;&#21040;&#24403;&#21069;&#25110;&#39044;&#27979;&#30340;&#23439;&#35266;&#32463;&#27982;&#25968;&#25454;&#30340;&#24433;&#21709;&#65292;&#32780;&#25104;&#21592;&#30340;&#20010;&#20154;&#29305;&#24449;&#20960;&#20046;&#19981;&#36215;&#20316;&#29992;&#12290;&#27492;&#22806;&#65292;&#30740;&#31350;&#36824;&#21457;&#29616;&#20102;&#20250;&#35758;&#20043;&#38388;&#25104;&#21592;&#30340;&#28436;&#35762;&#19982;&#38543;&#21518;&#20250;&#35758;&#30340;&#24322;&#35758;&#31243;&#24230;&#20043;&#38388;&#23384;&#22312;&#24369;&#30456;&#20851;&#24615;&#12290;&#26368;&#21518;&#65292;&#30740;&#31350;&#21457;&#29616;&#65292;&#27599;&#24403;&#36135;&#24065;&#25919;&#31574;&#34892;&#21160;&#26356;&#21152;&#28608;&#36827;&#26102;&#65292;&#24322;&#35758;&#31243;&#24230;&#20250;&#22686;&#21152;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22522;&#20110;1976&#24180;&#33267;2017&#24180;&#30340;FOMC&#25237;&#31080;&#24322;&#35758;&#35760;&#24405;&#21644;&#20250;&#35758;&#35760;&#24405;&#65292;&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#20010;&#22522;&#20110;&#33258;&#25105;&#20851;&#27880;&#27169;&#22359;&#30340;&#28145;&#24230;&#23398;&#20064;&#27169;&#22411;&#65292;&#29992;&#20110;&#30830;&#23450;&#27599;&#20010;&#25104;&#21592;&#22312;&#27599;&#20010;&#20250;&#35758;&#20013;&#30340;&#24322;&#35758;&#31243;&#24230;&#12290;&#34429;&#28982;&#24322;&#35758;&#24456;&#23569;&#35265;&#65292;&#20294;&#25105;&#20204;&#21457;&#29616;&#25104;&#21592;&#20204;&#32463;&#24120;&#23545;&#25919;&#31574;&#20915;&#31574;&#25345;&#20445;&#30041;&#24847;&#35265;&#12290;&#24322;&#35758;&#31243;&#24230;&#20027;&#35201;&#30001;&#24403;&#21069;&#25110;&#39044;&#27979;&#30340;&#23439;&#35266;&#32463;&#27982;&#25968;&#25454;&#39537;&#21160;&#65292;&#25104;&#21592;&#30340;&#20010;&#20154;&#29305;&#24449;&#20960;&#20046;&#19981;&#36215;&#20316;&#29992;&#12290;&#25105;&#20204;&#36824;&#21033;&#29992;&#27169;&#22411;&#35780;&#20272;&#20250;&#35758;&#20043;&#38388;&#25104;&#21592;&#30340;&#28436;&#35762;&#65292;&#24182;&#21457;&#29616;&#23427;&#20204;&#25152;&#25581;&#31034;&#30340;&#24322;&#35758;&#31243;&#24230;&#19982;&#38543;&#21518;&#30340;&#20250;&#35758;&#24322;&#35758;&#31243;&#24230;&#20043;&#38388;&#23384;&#22312;&#24369;&#30456;&#20851;&#24615;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#21457;&#29616;&#27599;&#24403;&#36135;&#24065;&#25919;&#31574;&#34892;&#21160;&#26356;&#21152;&#28608;&#36827;&#26102;&#65292;&#24322;&#35758;&#31243;&#24230;&#20250;&#22686;&#21152;&#12290;
&lt;/p&gt;
&lt;p&gt;
Based on a record of dissents on FOMC votes and transcripts of the meetings from 1976 to 2017, we develop a deep learning model based on self-attention modules to create a measure of the level of disagreement for each member in each meeting. While dissents are rare, we find that members often have reservations with the policy decision. The level of disagreement is mostly driven by current or predicted macroeconomic data, and personal characteristics of the members play almost no role. We also use our model to evaluate speeches made by members between meetings, and we find a weak correlation between the level of disagreement revealed in them and that of the following meeting. Finally, we find that the level of disagreement increases whenever monetary policy action is more aggressive.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26725;&#25509;TSLS&#21644;JIVE&#30340;&#26032;&#26041;&#27861;TSJI&#26469;&#22788;&#29702;&#20869;&#29983;&#24615;&#65292;&#20855;&#26377;&#29992;&#25143;&#23450;&#20041;&#21442;&#25968;&#955;&#65292;&#21487;&#20197;&#36817;&#20284;&#26080;&#20559;&#65292;&#19988;&#22312;&#35768;&#22810;&#24037;&#20855;&#21464;&#37327;&#28176;&#36827;&#24773;&#20917;&#19979;&#26159;&#19968;&#33268;&#19988;&#28176;&#36827;&#27491;&#24120;&#30340;&#12290;</title><link>http://arxiv.org/abs/2305.17615</link><description>&lt;p&gt;
TSLS&#19982;JIVE&#30340;&#26725;&#25509;
&lt;/p&gt;
&lt;p&gt;
Bridging TSLS and JIVE. (arXiv:2305.17615v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.17615
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26725;&#25509;TSLS&#21644;JIVE&#30340;&#26032;&#26041;&#27861;TSJI&#26469;&#22788;&#29702;&#20869;&#29983;&#24615;&#65292;&#20855;&#26377;&#29992;&#25143;&#23450;&#20041;&#21442;&#25968;&#955;&#65292;&#21487;&#20197;&#36817;&#20284;&#26080;&#20559;&#65292;&#19988;&#22312;&#35768;&#22810;&#24037;&#20855;&#21464;&#37327;&#28176;&#36827;&#24773;&#20917;&#19979;&#26159;&#19968;&#33268;&#19988;&#28176;&#36827;&#27491;&#24120;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#22788;&#29702;&#20869;&#29983;&#24615;&#26102;&#65292;&#32463;&#27982;&#23398;&#23478;&#32463;&#24120;&#23454;&#26045;TSLS&#12290;&#24403;&#24037;&#20855;&#21464;&#37327;&#25968;&#37327;&#20247;&#22810;&#26102;&#65292;TSLS&#20559;&#20506;&#24456;&#20005;&#37325;&#12290;&#22240;&#27492;&#65292;JIVE&#34987;&#25552;&#20986;&#26469;&#20943;&#23569;&#36229;&#35782;&#21035;&#30340;TSLS&#20559;&#24046;&#12290;&#20294;&#26159;&#65292;&#36825;&#20004;&#31181;&#26041;&#27861;&#37117;&#26377;&#37325;&#22823;&#32570;&#38519;&#12290;&#24403;&#36229;&#35782;&#21035;&#24230;&#36739;&#39640;&#26102;&#65292;&#36229;&#23450;TSLS&#20559;&#24046;&#24456;&#22823;&#65292;&#32780;JIVE&#19981;&#31283;&#23450;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#23558;TSLS&#21644;JIVE&#30340;&#20248;&#21270;&#38382;&#39064;&#26725;&#25509;&#36215;&#26469;&#65292;&#35299;&#20915;&#20102;&#36830;&#25509;&#38382;&#39064;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#20272;&#35745;&#22120;TSJI&#12290;TSJI&#20855;&#26377;&#29992;&#25143;&#23450;&#20041;&#30340;&#21442;&#25968;&#955;&#12290;&#36890;&#36807;&#23558;TSJI&#20559;&#24046;&#36817;&#20284;&#21040;op&#65288;1/N&#65289;&#30340;&#26041;&#24335;&#65292;&#25105;&#25214;&#21040;&#20102;&#19968;&#20010;&#20135;&#29983;&#36817;&#20284;&#26080;&#20559;TSJI&#30340;&#955;&#20540;&#12290;&#36873;&#25321;&#20102;&#20855;&#26377;&#25152;&#36873;&#955;&#20540;&#30340;TSJI&#19981;&#20165;&#20855;&#26377;&#22312;&#31532;&#19968;&#38454;&#27573;&#21644;&#31532;&#20108;&#38454;&#27573;&#22238;&#24402;&#22120;&#25968;&#37327;&#22266;&#23450;&#26102;&#19982;TSLS&#30456;&#21516;&#30340;&#19968;&#38454;&#20998;&#24067;&#65292;&#32780;&#19988;&#22312;&#35768;&#22810;&#24037;&#20855;&#21464;&#37327;&#28176;&#36827;&#24773;&#20917;&#19979;&#26159;&#19968;&#33268;&#19988;&#28176;&#36827;&#27491;&#24120;&#30340;&#12290;&#22312;&#19977;&#31181;&#19981;&#21516;&#30340;&#27169;&#25311;&#35774;&#32622;&#19979;&#65292;&#25105;&#20351;&#29992;&#19981;&#21516;&#21147;&#24230;&#30340;&#24037;&#20855;&#27979;&#35797;&#20102;TSJI&#19982;TSLS&#21644;JIVE&#12290;
&lt;/p&gt;
&lt;p&gt;
Economists often implement TSLS to handle endogeneity. The bias of TSLS is severe when the number of instruments is large. Hence, JIVE has been proposed to reduce bias of over-identified TSLS. However, both methods have critical drawbacks. While over-identified TSLS has a large bias with a large degree of overidentification, JIVE is unstable. In this paper, I bridge the optimization problems of TSLS and JIVE, solve the connected problem and propose a new estimator TSJI. TSJI has a user-defined parameter $\lambda$. By approximating the bias of the TSJI up to op(1/N), I find a $\lambda$ value that produces approximately unbiased TSJI. TSJI with the selected $\lambda$ value not only has the same first order distribution as TSLS when the number of first-stage and second-stage regressors are fixed, but also is consistent and asymptotically normal under many-instrument asymptotics. Under three different simulation settings, I test TSJI against TSLS and JIVE with instruments of different stre
&lt;/p&gt;</description></item><item><title>&#22312;&#21487;&#26367;&#20195;&#20559;&#22909;&#30340;&#22810;&#23545;&#19968;&#21305;&#37197;&#24066;&#22330;&#20013;&#65292;&#20219;&#20309;&#31283;&#23450;&#35268;&#21017;&#37117;&#21487;&#20197;&#22312;&#32435;&#20160;&#22343;&#34913;&#20013;&#23454;&#29616;&#20010;&#20307;&#29702;&#24615;&#25110;&#31283;&#23450;&#21305;&#37197;&#12290;</title><link>http://arxiv.org/abs/2305.13956</link><description>&lt;p&gt;
&#22810;&#23545;&#19968;&#21305;&#37197;&#24066;&#22330;&#20013;&#30340;&#32435;&#20160;&#23454;&#29616;
&lt;/p&gt;
&lt;p&gt;
Nash implementation in a many-to-one matching market. (arXiv:2305.13956v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.13956
&lt;/p&gt;
&lt;p&gt;
&#22312;&#21487;&#26367;&#20195;&#20559;&#22909;&#30340;&#22810;&#23545;&#19968;&#21305;&#37197;&#24066;&#22330;&#20013;&#65292;&#20219;&#20309;&#31283;&#23450;&#35268;&#21017;&#37117;&#21487;&#20197;&#22312;&#32435;&#20160;&#22343;&#34913;&#20013;&#23454;&#29616;&#20010;&#20307;&#29702;&#24615;&#25110;&#31283;&#23450;&#21305;&#37197;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#20855;&#26377;&#21487;&#26367;&#20195;&#20559;&#22909;&#30340;&#22810;&#23545;&#19968;&#21305;&#37197;&#24066;&#22330;&#20013;&#65292;&#25105;&#20204;&#20998;&#26512;&#20102;&#31283;&#23450;&#35268;&#21017;&#24341;&#36215;&#30340;&#21338;&#24328;&#12290;&#24403;&#24066;&#22330;&#30340;&#21452;&#26041;&#37117;&#36827;&#34892;&#25112;&#30053;&#21338;&#24328;&#26102;&#65292;&#25105;&#20204;&#34920;&#26126;&#20219;&#20309;&#31283;&#23450;&#35268;&#21017;&#37117;&#21487;&#20197;&#22312;&#32435;&#20160;&#22343;&#34913;&#20013;&#23454;&#29616;&#20010;&#20307;&#29702;&#24615;&#21305;&#37197;&#12290;&#27492;&#22806;&#65292;&#24403;&#21482;&#26377;&#24037;&#20154;&#36827;&#34892;&#25112;&#30053;&#21338;&#24328;&#65292;&#24182;&#19988;&#20225;&#19994;&#30340;&#20559;&#22909;&#28385;&#36275;&#38656;&#27714;&#27719;&#24635;&#23450;&#24459;&#26102;&#65292;&#25105;&#20204;&#34920;&#26126;&#20219;&#20309;&#31283;&#23450;&#35268;&#21017;&#37117;&#21487;&#20197;&#22312;&#32435;&#20160;&#22343;&#34913;&#20013;&#23454;&#29616;&#31283;&#23450;&#21305;&#37197;&#12290;
&lt;/p&gt;
&lt;p&gt;
In a many-to-one matching market with substitutable preferences, we analyze the game induced by a stable rule. When both sides of the market play strategically, we show that any stable rule implements, in Nash equilibrium, the individually rational matchings. Also, when only workers play strategically and firms' preferences satisfy the law of aggregated demand, we show that any stable rule implements, in Nash equilibrium, the stable matchings.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#21033;&#29992;&#25193;&#23637;&#30340;&#20445;&#24207;&#26426;&#21046;&#65292;&#23558;&#20854;&#24212;&#29992;&#20110;&#25351;&#25968;&#26063;&#20998;&#24067;&#20197;&#25552;&#39640;&#21516;&#34892;&#35780;&#23457;&#30340;&#36136;&#37327;&#65292;&#24182;&#21457;&#29616;&#20316;&#32773;&#30340;&#21516;&#34892;&#35780;&#20998;&#21487;&#20197;&#36739;&#20934;&#30830;&#22320;&#22312;&#19981;&#38656;&#35201;&#30693;&#36947;&#20855;&#20307;&#20998;&#24067;&#24773;&#20917;&#19979;&#36827;&#34892;&#35843;&#25972;&#12290;</title><link>http://arxiv.org/abs/2304.11160</link><description>&lt;p&gt;
&#21033;&#29992;&#20445;&#24207;&#26426;&#21046;&#25552;&#39640;&#26426;&#22120;&#23398;&#20064;&#21644;&#20154;&#24037;&#26234;&#33021;&#20250;&#35758;&#30340;&#21516;&#34892;&#35780;&#23457;
&lt;/p&gt;
&lt;p&gt;
The Isotonic Mechanism for Exponential Family Estimation. (arXiv:2304.11160v1 [math.ST])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.11160
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#21033;&#29992;&#25193;&#23637;&#30340;&#20445;&#24207;&#26426;&#21046;&#65292;&#23558;&#20854;&#24212;&#29992;&#20110;&#25351;&#25968;&#26063;&#20998;&#24067;&#20197;&#25552;&#39640;&#21516;&#34892;&#35780;&#23457;&#30340;&#36136;&#37327;&#65292;&#24182;&#21457;&#29616;&#20316;&#32773;&#30340;&#21516;&#34892;&#35780;&#20998;&#21487;&#20197;&#36739;&#20934;&#30830;&#22320;&#22312;&#19981;&#38656;&#35201;&#30693;&#36947;&#20855;&#20307;&#20998;&#24067;&#24773;&#20917;&#19979;&#36827;&#34892;&#35843;&#25972;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#33268;&#21147;&#20110;&#25193;&#23637;&#20445;&#24207;&#26426;&#21046;&#65292;&#23558;&#20854;&#24212;&#29992;&#20110;&#25351;&#25968;&#26063;&#20998;&#24067;&#20197;&#25552;&#39640;&#21516;&#34892;&#35780;&#23457;&#30340;&#36136;&#37327;&#12290;&#35813;&#26426;&#21046;&#21487;&#29983;&#25104;&#19982;&#21407;&#22987;&#35780;&#20998;&#25509;&#36817;&#30340;&#35843;&#25972;&#20998;&#25968;&#65292;&#24182;&#31526;&#21512;&#20316;&#32773;&#25351;&#23450;&#30340;&#25490;&#21517;&#35201;&#27714;&#65292;&#24471;&#21040;&#24191;&#27867;&#30340;&#25351;&#25968;&#26063;&#20998;&#24067;&#24212;&#29992;&#65292;&#32780;&#19988;&#19981;&#38656;&#35201;&#30693;&#36947;&#20855;&#20307;&#30340;&#20998;&#24067;&#24418;&#24335;&#12290;&#30740;&#31350;&#34920;&#26126;&#65292;&#22312;&#19968;&#23450;&#30340;&#25351;&#25968;&#26063;&#20998;&#24067;&#19979;&#65292;&#22914;&#26524;&#20316;&#32773;&#30340;&#25928;&#29992;&#20989;&#25968;&#37319;&#29992;&#31616;&#21333;&#30340;&#20984;&#21487;&#21152;&#20989;&#25968;&#65292;&#21017;&#28608;&#21169;&#20316;&#32773;&#25552;&#20379;&#20934;&#30830;&#30340;&#25490;&#21517;&#24314;&#35758;&#12290;
&lt;/p&gt;
&lt;p&gt;
In 2023, the International Conference on Machine Learning (ICML) required authors with multiple submissions to rank their submissions based on perceived quality. In this paper, we aim to employ these author-specified rankings to enhance peer review in machine learning and artificial intelligence conferences by extending the Isotonic Mechanism (Su, 2021, 2022) to exponential family distributions. This mechanism generates adjusted scores closely align with the original scores while adhering to author-specified rankings. Despite its applicability to a broad spectrum of exponential family distributions, this mechanism's implementation does not necessitate knowledge of the specific distribution form. We demonstrate that an author is incentivized to provide accurate rankings when her utility takes the form of a convex additive function of the adjusted review scores. For a certain subclass of exponential family distributions, we prove that the author reports truthfully only if the question in
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20379;&#20102;&#19968;&#20010;&#22522;&#26412;&#29702;&#35770;&#65292;&#30740;&#31350;&#20102;&#24102;&#26377;&#39640;&#38454;&#20449;&#24687;&#30340;&#26399;&#26435;&#24066;&#22330;&#20013;&#20215;&#26684;&#30340;&#21457;&#29616;&#26426;&#21046;&#12290;&#19982;&#27492;&#21516;&#26102;&#65292;&#35813;&#30740;&#31350;&#36824;&#20197;&#20869;&#24149;&#20132;&#26131;&#30340;&#24418;&#24335;&#21576;&#29616;&#20102;&#20854;&#20013;&#30340;&#29305;&#20363;&#65292;&#32473;&#20986;&#20102;&#36890;&#36135;&#33192;&#32960;&#38656;&#27714;&#12289;&#20215;&#26684;&#20914;&#20987;&#21644;&#20449;&#24687;&#25928;&#29575;&#30340;&#38381;&#24335;&#35299;&#12290;</title><link>http://arxiv.org/abs/2302.13426</link><description>&lt;p&gt;
&#26399;&#26435;&#30340;&#20215;&#26684;&#21457;&#29616;
&lt;/p&gt;
&lt;p&gt;
Price Discovery for Derivatives. (arXiv:2302.13426v5 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2302.13426
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20379;&#20102;&#19968;&#20010;&#22522;&#26412;&#29702;&#35770;&#65292;&#30740;&#31350;&#20102;&#24102;&#26377;&#39640;&#38454;&#20449;&#24687;&#30340;&#26399;&#26435;&#24066;&#22330;&#20013;&#20215;&#26684;&#30340;&#21457;&#29616;&#26426;&#21046;&#12290;&#19982;&#27492;&#21516;&#26102;&#65292;&#35813;&#30740;&#31350;&#36824;&#20197;&#20869;&#24149;&#20132;&#26131;&#30340;&#24418;&#24335;&#21576;&#29616;&#20102;&#20854;&#20013;&#30340;&#29305;&#20363;&#65292;&#32473;&#20986;&#20102;&#36890;&#36135;&#33192;&#32960;&#38656;&#27714;&#12289;&#20215;&#26684;&#20914;&#20987;&#21644;&#20449;&#24687;&#25928;&#29575;&#30340;&#38381;&#24335;&#35299;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36890;&#36807;&#19968;&#20010;&#27169;&#22411;&#65292;&#32771;&#34385;&#20102;&#31169;&#26377;&#20449;&#24687;&#21644;&#39640;&#38454;&#20449;&#24687;&#23545;&#26399;&#26435;&#24066;&#22330;&#20215;&#26684;&#30340;&#24433;&#21709;&#12290;&#27169;&#22411;&#20801;&#35768;&#26377;&#31169;&#26377;&#20449;&#24687;&#30340;&#20132;&#26131;&#32773;&#22312;&#29366;&#24577;-&#32034;&#36180;&#38598;&#24066;&#22330;&#19978;&#20132;&#26131;&#12290;&#31561;&#20215;&#30340;&#26399;&#26435;&#24418;&#24335;&#19979;&#65292;&#25105;&#20204;&#32771;&#34385;&#20102;&#25317;&#26377;&#20851;&#20110;&#22522;&#30784;&#36164;&#20135;&#25910;&#30410;&#30340;&#20998;&#24067;&#30340;&#31169;&#26377;&#20449;&#24687;&#65292;&#24182;&#20801;&#35768;&#20132;&#26131;&#20219;&#24847;&#26399;&#26435;&#32452;&#21512;&#30340;&#25805;&#32437;&#32773;&#12290;&#25105;&#20204;&#24471;&#20986;&#20102;&#36890;&#36135;&#33192;&#32960;&#38656;&#27714;&#12289;&#20215;&#26684;&#20914;&#20987;&#21644;&#20449;&#24687;&#25928;&#29575;&#30340;&#38381;&#24335;&#35299;&#65292;&#36825;&#20123;&#35299;&#25552;&#20379;&#20102;&#20851;&#20110;&#20869;&#24149;&#20132;&#26131;&#30340;&#39640;&#38454;&#20449;&#24687;&#65292;&#22914;&#20219;&#20309;&#32473;&#23450;&#30340;&#26102;&#21051;&#20132;&#26131;&#26399;&#26435;&#31574;&#30053;&#65292;&#24182;&#23558;&#36825;&#20123;&#31574;&#30053;&#27867;&#21270;&#21040;&#20102;&#27874;&#21160;&#29575;&#20132;&#26131;&#31561;&#23454;&#36341;&#39046;&#22495;&#12290;
&lt;/p&gt;
&lt;p&gt;
We obtain a basic theory of price discovery across derivative markets with respect to higher-order information, using a model where an agent with general private information regarding state probabilities is allowed to trade arbitrary portfolios of state-contingent claims. In an equivalent options formulation, the informed agent has private information regarding arbitrary aspects of the payoff distribution of an underlying asset and is allowed to trade arbitrary option portfolios. We characterize, in closed form, the informed demand, price impact, and information efficiency of prices. Our results offer a theory of insider trading on higher moments of the underlying payoff as a special case. The informed demand formula prescribes option strategies for trading on any given moment and extends those used in practice for, e.g. volatility trading.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#35843;&#26597;&#20102;&#38738;&#23569;&#24180;&#26102;&#26399;&#19982;&#25104;&#24180;&#26399;&#25910;&#20837;&#20043;&#38388;&#30340;&#21451;&#35850;&#22238;&#25253;&#12290;&#36890;&#36807;&#37319;&#29992;&#19968;&#31181;&#26032;&#30340;&#26041;&#27861;&#65292;&#25991;&#20013;&#21457;&#29616;&#38738;&#23569;&#24180;&#26102;&#26399;&#22810;&#20132;&#19968;&#20010;&#26379;&#21451;&#21487;&#20197;&#20351;&#25910;&#20837;&#22686;&#21152;7%&#21040;14%&#12290;&#36825;&#20010;&#32467;&#26524;&#36828;&#22823;&#20110;&#20256;&#32479;&#26041;&#27861;&#30340;&#20272;&#35745;&#20540;&#65292;&#20256;&#32479;&#26041;&#27861;&#20250;&#22240;&#20026;&#27979;&#37327;&#35823;&#24046;&#21644;&#36951;&#28431;&#21464;&#37327;&#23548;&#33268;&#26174;&#33879;&#30340;&#21521;&#19979;&#20559;&#35823;&#12290;</title><link>http://arxiv.org/abs/2210.09426</link><description>&lt;p&gt;
&#24320;&#27966;&#23545;&#65306;&#38738;&#23569;&#24180;&#31038;&#20132;&#32593;&#32476;&#23545;&#21171;&#21160;&#21147;&#24066;&#22330;&#30340;&#22238;&#25253;
&lt;/p&gt;
&lt;p&gt;
Party On: The Labor Market Returns to Social Networks in Adolescence. (arXiv:2210.09426v3 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2210.09426
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#35843;&#26597;&#20102;&#38738;&#23569;&#24180;&#26102;&#26399;&#19982;&#25104;&#24180;&#26399;&#25910;&#20837;&#20043;&#38388;&#30340;&#21451;&#35850;&#22238;&#25253;&#12290;&#36890;&#36807;&#37319;&#29992;&#19968;&#31181;&#26032;&#30340;&#26041;&#27861;&#65292;&#25991;&#20013;&#21457;&#29616;&#38738;&#23569;&#24180;&#26102;&#26399;&#22810;&#20132;&#19968;&#20010;&#26379;&#21451;&#21487;&#20197;&#20351;&#25910;&#20837;&#22686;&#21152;7%&#21040;14%&#12290;&#36825;&#20010;&#32467;&#26524;&#36828;&#22823;&#20110;&#20256;&#32479;&#26041;&#27861;&#30340;&#20272;&#35745;&#20540;&#65292;&#20256;&#32479;&#26041;&#27861;&#20250;&#22240;&#20026;&#27979;&#37327;&#35823;&#24046;&#21644;&#36951;&#28431;&#21464;&#37327;&#23548;&#33268;&#26174;&#33879;&#30340;&#21521;&#19979;&#20559;&#35823;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#35843;&#26597;&#20102;&#38738;&#23569;&#24180;&#21451;&#35850;&#23545;&#25104;&#24180;&#26399;&#25910;&#20837;&#30340;&#22238;&#25253;&#12290;&#21033;&#29992;&#32654;&#22269;&#22269;&#23478;&#38738;&#23569;&#24180;&#21040;&#25104;&#20154;&#20581;&#24247;&#30340;&#38271;&#26399;&#30740;&#31350;&#25968;&#25454;&#65292;&#25105;&#20204;&#21457;&#29616;&#20010;&#20307;&#22312;&#38738;&#23569;&#24180;&#26102;&#26399;&#19981;&#20165;&#36827;&#34892;&#25945;&#32946;&#25237;&#36164;&#65292;&#36824;&#36827;&#34892;&#21451;&#35850;&#31215;&#32047;&#30340;&#25237;&#36164;&#12290;&#30001;&#20110;&#25945;&#32946;&#21644;&#21451;&#35850;&#22312;&#38738;&#23569;&#24180;&#26102;&#26399;&#26159;&#21516;&#26102;&#24418;&#25104;&#30340;&#65292;&#22240;&#27492;&#20351;&#29992;OLS&#26041;&#27861;&#20272;&#35745;&#23427;&#20204;&#30340;&#22238;&#25253;&#20250;&#26377;&#20559;&#24046;&#12290;&#20026;&#20102;&#20272;&#35745;&#21451;&#35850;&#30340;&#22240;&#26524;&#22238;&#25253;&#65292;&#25105;&#20204;&#37319;&#29992;&#20102;&#19968;&#31181;&#26032;&#26041;&#27861;&#65292;&#20551;&#35774;&#25945;&#32946;&#22238;&#25253;&#29575;&#22312;5%&#21040;15%&#20043;&#38388;&#65288;&#22914;&#24050;&#26377;&#25991;&#29486;&#25152;&#36848;&#65289;&#65292;&#24182;&#20351;&#29992;&#21516;&#20276;&#20043;&#38388;&#30340;&#30456;&#20284;&#24230;&#27979;&#37327;&#20316;&#20026;&#21451;&#35850;&#30340;&#24037;&#20855;&#26469;&#33719;&#24471;&#22238;&#25253;&#30340;&#19979;&#30028;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#22312;&#38738;&#23569;&#24180;&#26102;&#26399;&#22810;&#20132;&#19968;&#20010;&#26379;&#21451;&#21487;&#20197;&#20351;&#25910;&#20837;&#22686;&#38271;7%&#21040;14%&#65292;&#36825;&#36828;&#22823;&#20110;OLS&#20272;&#35745;&#20540;&#65306;&#27979;&#37327;&#35823;&#24046;&#21644;&#36951;&#28431;&#21464;&#37327;&#23548;&#33268;&#20102;&#26174;&#33879;&#30340;&#21521;&#19979;&#20559;&#35823;&#12290;
&lt;/p&gt;
&lt;p&gt;
We investigate the returns to adolescent friendships on earnings in adulthood. Using data from the National Longitudinal Study of Adolescent to Adult Health, we document that individuals make investments to accumulate friends in addition to educational investments. Because both education and friendships are jointly determined in adolescence, OLS estimates of their returns are biased. To estimate the causal returns to friendships, we implement a novel procedure that assumes the returns to schooling range from 5 to 15% (as the literature has documented), and instrument for friendships using homophily (similarity) measures among peers to obtain bounds on the returns to friendships. We find that having one more friend in adolescence increases earnings between 7 and 14%, which is substantially larger than the OLS estimates: measurement error and omitted variables lead to significant downward bias.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#36890;&#36807;&#20998;&#26512;&#29790;&#22763;&#23478;&#24237;&#38754;&#26495;&#25968;&#25454;&#21644;&#30417;&#31649;&#25968;&#25454;&#65292;&#21457;&#29616;&#22312;&#29790;&#22763;&#24378;&#21046;&#21307;&#30103;&#20445;&#38505;&#24066;&#22330;&#19978;&#23384;&#22312;&#36873;&#25321;&#24615;&#36947;&#24503;&#39118;&#38505;&#65292;&#39640;&#36947;&#24503;&#39118;&#38505;&#31867;&#22411;&#23545;&#39640;&#20445;&#38556;&#35745;&#21010;&#30340;&#21709;&#24212;&#27604;&#24179;&#22343;&#27700;&#24179;&#39640;25-35%&#12290;</title><link>http://arxiv.org/abs/2208.03815</link><description>&lt;p&gt;
&#29790;&#22763;&#24378;&#21046;&#21307;&#30103;&#20445;&#38505;&#24066;&#22330;&#19978;&#30340;&#36947;&#24503;&#39118;&#38505;&#36873;&#25321;&#65306;&#26469;&#33258;&#29790;&#22763;&#23478;&#24237;&#38754;&#26495;&#25968;&#25454;&#30340;&#32463;&#39564;&#35777;&#25454;&#12290;
&lt;/p&gt;
&lt;p&gt;
Selection on moral hazard in the Swiss market for mandatory health insurance: Empirical evidence from Swiss Household Panel data. (arXiv:2208.03815v2 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2208.03815
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#36890;&#36807;&#20998;&#26512;&#29790;&#22763;&#23478;&#24237;&#38754;&#26495;&#25968;&#25454;&#21644;&#30417;&#31649;&#25968;&#25454;&#65292;&#21457;&#29616;&#22312;&#29790;&#22763;&#24378;&#21046;&#21307;&#30103;&#20445;&#38505;&#24066;&#22330;&#19978;&#23384;&#22312;&#36873;&#25321;&#24615;&#36947;&#24503;&#39118;&#38505;&#65292;&#39640;&#36947;&#24503;&#39118;&#38505;&#31867;&#22411;&#23545;&#39640;&#20445;&#38556;&#35745;&#21010;&#30340;&#21709;&#24212;&#27604;&#24179;&#22343;&#27700;&#24179;&#39640;25-35%&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36947;&#24503;&#39118;&#38505;&#36873;&#25321;&#34920;&#31034;&#26681;&#25454;&#21033;&#29992;&#29575;&#8220;&#26012;&#29575;&#8221;&#30340;&#24322;&#36136;&#24615;&#36873;&#25321;&#29305;&#23450;&#30340;&#21307;&#30103;&#20445;&#38505;&#35206;&#30422;&#12290;&#26412;&#30740;&#31350;&#21033;&#29992;&#29790;&#22763;&#23478;&#24237;&#38754;&#26495;&#25968;&#25454;&#21644;&#20844;&#24320;&#21487;&#24471;&#30340;&#30417;&#31649;&#25968;&#25454;&#65292;&#25506;&#35752;&#20102;&#22312;&#29790;&#22763;&#30340;&#31454;&#20105;&#31649;&#29702;&#31995;&#32479;&#20013;&#36947;&#24503;&#39118;&#38505;&#36873;&#25321;&#30340;&#31243;&#24230;&#12290;&#20351;&#29992;&#32599;&#20234;&#31867;&#22411;&#27169;&#22411;&#20272;&#35745;&#26368;&#20302;&#21644;&#26368;&#39640;&#20813;&#36180;&#39069;&#30340;(&#23545;&#25968;)&#23601;&#21307;&#27425;&#25968;&#30340;&#21709;&#24212;&#65292;&#36890;&#36807;&#23616;&#37096;&#24037;&#20855;&#21464;&#37327;&#30830;&#23450;&#36793;&#38469;&#27835;&#30103;&#25928;&#24212;&#12290;&#39640;&#36947;&#24503;&#39118;&#38505;&#31867;&#22411;&#22312;&#39640;&#20445;&#38556;&#35745;&#21010;(&#21363;&#26368;&#20302;&#20813;&#36180;&#39069;&#35745;&#21010;)&#19978;&#30340;&#21709;&#24212;&#27604;&#24179;&#22343;&#27700;&#24179;&#39640;25-35%&#12290;
&lt;/p&gt;
&lt;p&gt;
Selection on moral hazard represents the tendency to select a specific health insurance coverage depending on the heterogeneity in utilisation ''slopes''. I use data from the Swiss Household Panel and from publicly available regulatory data to explore the extent of selection on slopes in the Swiss managed competition system. I estimate responses in terms of (log) doctor visits to lowest and highest deductible levels using Roy-type models, identifying marginal treatment effects with local instrumental variables. The response to high coverage plans (i.e. plans with the lowest deductible level) among high moral hazard types is 25-35 percent higher than average.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#24212;&#29992;LSTM&#24490;&#29615;&#31070;&#32463;&#32593;&#32476;&#27169;&#22411;&#65292;&#30740;&#31350;&#20102;&#39044;&#27979;&#36890;&#36135;&#33192;&#32960;&#30340;&#33021;&#21147;&#65292;&#24182;&#21457;&#29616;&#22312;&#38271;&#26399;&#39044;&#27979;&#21644;&#23439;&#35266;&#32463;&#27982;&#19981;&#30830;&#23450;&#24615;&#21152;&#21095;&#26399;&#38388;&#34920;&#29616;&#33391;&#22909;&#12290;&#26377;&#36259;&#30340;&#26159;&#65292;LSTM&#25152;&#28041;&#21450;&#30340;&#22240;&#32032;&#19982;&#21830;&#19994;&#21608;&#26399;&#25351;&#26631;&#39640;&#24230;&#30456;&#20851;&#65292;&#36825;&#35828;&#26126;&#36825;&#20123;&#20449;&#21495;&#20316;&#20026;&#36890;&#32960;&#39044;&#27979;&#22240;&#23376;&#30340;&#23454;&#29992;&#24615;&#12290;</title><link>http://arxiv.org/abs/2104.03757</link><description>&lt;p&gt;
&#29992;&#24490;&#29615;&#31070;&#32463;&#32593;&#32476;&#39044;&#27979;&#36890;&#36135;&#33192;&#32960;
&lt;/p&gt;
&lt;p&gt;
Predicting Inflation with Recurrent Neural Networks. (arXiv:2104.03757v2 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2104.03757
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#24212;&#29992;LSTM&#24490;&#29615;&#31070;&#32463;&#32593;&#32476;&#27169;&#22411;&#65292;&#30740;&#31350;&#20102;&#39044;&#27979;&#36890;&#36135;&#33192;&#32960;&#30340;&#33021;&#21147;&#65292;&#24182;&#21457;&#29616;&#22312;&#38271;&#26399;&#39044;&#27979;&#21644;&#23439;&#35266;&#32463;&#27982;&#19981;&#30830;&#23450;&#24615;&#21152;&#21095;&#26399;&#38388;&#34920;&#29616;&#33391;&#22909;&#12290;&#26377;&#36259;&#30340;&#26159;&#65292;LSTM&#25152;&#28041;&#21450;&#30340;&#22240;&#32032;&#19982;&#21830;&#19994;&#21608;&#26399;&#25351;&#26631;&#39640;&#24230;&#30456;&#20851;&#65292;&#36825;&#35828;&#26126;&#36825;&#20123;&#20449;&#21495;&#20316;&#20026;&#36890;&#32960;&#39044;&#27979;&#22240;&#23376;&#30340;&#23454;&#29992;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#24212;&#29992;&#20102;&#24490;&#29615;&#31070;&#32463;&#32593;&#32476;&#65288;LSTM&#65289;&#26469;&#39044;&#27979;&#36890;&#36135;&#33192;&#32960;&#12290;&#20316;&#20026;&#26102;&#38388;&#24207;&#21015;&#30340;&#19968;&#31181;&#21560;&#24341;&#20154;&#30340;&#27169;&#22411;&#65292;LSTM&#25353;&#29031;&#26102;&#38388;&#27493;&#39588;&#39034;&#24207;&#22788;&#29702;&#25968;&#25454;&#65292;&#24182;&#26126;&#30830;&#23398;&#20064;&#21160;&#24577;&#20381;&#36182;&#20851;&#31995;&#12290;&#26412;&#25991;&#36824;&#25506;&#35752;&#20102;&#35813;&#27169;&#22411;&#30340;&#38477;&#32500;&#33021;&#21147;&#65292;&#20197;&#25581;&#31034;&#21487;&#20197;&#35299;&#37322;&#36890;&#36135;&#33192;&#32960;&#36807;&#31243;&#30340;&#32463;&#27982;&#24847;&#20041;&#22240;&#32032;&#12290;&#23545;&#32654;&#22269;&#25968;&#25454;&#36827;&#34892;&#30340;&#23454;&#35777;&#32467;&#26524;&#34920;&#26126;&#65292;&#20272;&#35745;&#30340;&#31070;&#32463;&#32593;&#32476;&#22312;&#24120;&#35265;&#22522;&#20934;&#27169;&#22411;&#65288;&#21253;&#25324;&#20854;&#20182;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#65289;&#20013;&#34920;&#29616;&#20855;&#26377;&#31454;&#20105;&#21147;&#20294;&#24182;&#19981;&#31361;&#20986;&#12290;&#29305;&#21035;&#26159;LSTM&#22312;&#38271;&#26399;&#39044;&#27979;&#21644;&#23439;&#35266;&#32463;&#27982;&#19981;&#30830;&#23450;&#24615;&#21152;&#21095;&#26399;&#38388;&#34920;&#29616;&#33391;&#22909;&#12290;&#26377;&#36259;&#30340;&#26159;&#65292;LSTM&#25152;&#28041;&#21450;&#30340;&#22240;&#32032;&#19982;&#21830;&#19994;&#21608;&#26399;&#25351;&#26631;&#39640;&#24230;&#30456;&#20851;&#65292;&#36825;&#35828;&#26126;&#36825;&#20123;&#20449;&#21495;&#20316;&#20026;&#36890;&#32960;&#39044;&#27979;&#22240;&#23376;&#30340;&#23454;&#29992;&#24615;&#12290;&#26412;&#25991;&#36824;&#25581;&#31034;&#20102;&#32593;&#32476;&#21021;&#22987;&#21270;&#21644;&#26550;&#26500;&#23545;&#39044;&#27979;&#24615;&#33021;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper applies a recurrent neural network, the LSTM, to forecast inflation. This is an appealing model for time series as it processes each time step sequentially and explicitly learns dynamic dependencies. The paper also explores the dimension reduction capability of the model to uncover economically-meaningful factors that can explain the inflation process. Results from an exercise with US data indicate that the estimated neural nets present competitive, but not outstanding, performance against common benchmarks (including other machine learning models). The LSTM in particular is found to perform well at long horizons and during periods of heightened macroeconomic uncertainty. Interestingly, LSTM-implied factors present high correlation with business cycle indicators, informing on the usefulness of such signals as inflation predictors. The paper also sheds light on the impact of network initialization and architecture on forecast performance.
&lt;/p&gt;</description></item></channel></rss>