<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#23545;&#32047;&#31215;&#38543;&#26426;&#23454;&#29616;&#30340;&#23614;&#37096;&#27010;&#29575;&#21644;&#26399;&#26395;&#32447;&#24615;&#25439;&#22833;&#30340;&#26032;&#30340;&#26356;&#23574;&#38160;&#30028;&#38480;&#65292;&#36825;&#20123;&#30028;&#38480;&#22312;&#22522;&#30784;&#20998;&#24067;&#21322;&#21442;&#25968;&#30340;&#24773;&#20917;&#19979;&#19981;&#21463;&#38480;&#21046;&#65292;&#34917;&#20805;&#20102;&#24050;&#26377;&#30340;&#32467;&#26524;&#65292;&#24320;&#36767;&#20102;&#20016;&#23500;&#30340;&#23454;&#38469;&#24212;&#29992;&#12290;</title><link>https://arxiv.org/abs/2404.02400</link><description>&lt;p&gt;
&#20851;&#20110;&#32047;&#31215;&#38543;&#26426;&#23454;&#29616;&#30340;&#23614;&#37096;&#27010;&#29575;&#21644;&#26399;&#26395;&#25439;&#22833;&#30340;&#25913;&#36827;&#21322;&#21442;&#25968;&#30028;&#38480;
&lt;/p&gt;
&lt;p&gt;
On Improved Semi-parametric Bounds for Tail Probability and Expected Loss
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2404.02400
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#23545;&#32047;&#31215;&#38543;&#26426;&#23454;&#29616;&#30340;&#23614;&#37096;&#27010;&#29575;&#21644;&#26399;&#26395;&#32447;&#24615;&#25439;&#22833;&#30340;&#26032;&#30340;&#26356;&#23574;&#38160;&#30028;&#38480;&#65292;&#36825;&#20123;&#30028;&#38480;&#22312;&#22522;&#30784;&#20998;&#24067;&#21322;&#21442;&#25968;&#30340;&#24773;&#20917;&#19979;&#19981;&#21463;&#38480;&#21046;&#65292;&#34917;&#20805;&#20102;&#24050;&#26377;&#30340;&#32467;&#26524;&#65292;&#24320;&#36767;&#20102;&#20016;&#23500;&#30340;&#23454;&#38469;&#24212;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#37325;&#26032;&#23457;&#35270;&#20102;&#24403;&#20010;&#21035;&#23454;&#29616;&#26159;&#29420;&#31435;&#30340;&#26102;&#65292;&#32047;&#31215;&#38543;&#26426;&#23454;&#29616;&#30340;&#23614;&#37096;&#34892;&#20026;&#30340;&#22522;&#26412;&#38382;&#39064;&#65292;&#24182;&#22312;&#21322;&#21442;&#25968;&#30340;&#22522;&#30784;&#20998;&#24067;&#26410;&#21463;&#38480;&#21046;&#30340;&#24773;&#20917;&#19979;&#65292;&#24320;&#21457;&#20102;&#23545;&#23614;&#37096;&#27010;&#29575;&#21644;&#26399;&#26395;&#32447;&#24615;&#25439;&#22833;&#30340;&#26032;&#30340;&#26356;&#23574;&#38160;&#30340;&#30028;&#38480;&#12290;&#25105;&#20204;&#30340;&#23574;&#38160;&#30028;&#38480;&#24456;&#22909;&#22320;&#34917;&#20805;&#20102;&#25991;&#29486;&#20013;&#24050;&#32463;&#24314;&#31435;&#30340;&#32467;&#26524;&#65292;&#21253;&#25324;&#22522;&#20110;&#32858;&#21512;&#30340;&#26041;&#27861;&#65292;&#21518;&#32773;&#32463;&#24120;&#26410;&#33021;&#20805;&#20998;&#32771;&#34385;&#29420;&#31435;&#24615;&#24182;&#20351;&#29992;&#19981;&#22815;&#20248;&#38597;&#30340;&#35777;&#26126;&#12290;&#26032;&#30340;&#35265;&#35299;&#21253;&#25324;&#22312;&#38750;&#30456;&#21516;&#24773;&#20917;&#19979;&#30340;&#35777;&#26126;&#65292;&#36798;&#21040;&#30028;&#38480;&#30340;&#20998;&#24067;&#20855;&#26377;&#30456;&#31561;&#30340;&#33539;&#22260;&#23646;&#24615;&#65292;&#24182;&#19988;&#27599;&#20010;&#38543;&#26426;&#21464;&#37327;&#23545;&#24635;&#21644;&#30340;&#26399;&#26395;&#20540;&#30340;&#24433;&#21709;&#21487;&#20197;&#36890;&#36807;&#23545;Korkine&#24658;&#31561;&#24335;&#30340;&#25512;&#24191;&#26469;&#23396;&#31435;&#20986;&#26469;&#12290;&#25105;&#20204;&#34920;&#26126;&#65292;&#26032;&#30340;&#30028;&#38480;&#19981;&#20165;&#34917;&#20805;&#20102;&#29616;&#26377;&#32467;&#26524;&#65292;&#32780;&#19988;&#24320;&#25299;&#20102;&#22823;&#37327;&#30340;&#23454;&#38469;&#24212;&#29992;&#65292;&#21253;&#25324;&#25913;&#36827;&#23450;&#20215;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2404.02400v1 Announce Type: new  Abstract: We revisit the fundamental issue of tail behavior of accumulated random realizations when individual realizations are independent, and we develop new sharper bounds on the tail probability and expected linear loss. The underlying distribution is semi-parametric in the sense that it remains unrestricted other than the assumed mean and variance. Our sharp bounds complement well-established results in the literature, including those based on aggregation, which often fail to take full account of independence and use less elegant proofs. New insights include a proof that in the non-identical case, the distributions attaining the bounds have the equal range property, and that the impact of each random variable on the expected value of the sum can be isolated using an extension of the Korkine identity. We show that the new bounds not only complement the extant results but also open up abundant practical applications, including improved pricing 
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20379;&#19968;&#31181;&#32771;&#34385;&#20102;&#31574;&#30053;&#24615;&#35823;&#25253;&#30340;&#22240;&#26524;&#25928;&#24212;&#35782;&#21035;&#26041;&#27861;&#65292;&#21487;&#20197;&#23545;&#23398;&#26657;&#20998;&#37197;&#23545;&#26410;&#26469;&#32467;&#26524;&#20135;&#29983;&#30340;&#24433;&#21709;&#36827;&#34892;&#20934;&#30830;&#24230;&#37327;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#36866;&#29992;&#20110;&#21508;&#31181;&#26426;&#21046;&#65292;&#24182;&#33021;&#22815;&#24471;&#21040;&#23545;&#31574;&#30053;&#34892;&#20026;&#40065;&#26834;&#30340;&#22240;&#26524;&#25928;&#24212;&#30340;&#23574;&#38160;&#36793;&#30028;&#12290;</title><link>http://arxiv.org/abs/2307.14282</link><description>&lt;p&gt;
&#21305;&#37197;&#26426;&#21046;&#20013;&#30340;&#22240;&#26524;&#25928;&#24212;&#19982;&#31574;&#30053;&#24615;&#25253;&#21578;&#20559;&#22909;
&lt;/p&gt;
&lt;p&gt;
Causal Effects in Matching Mechanisms with Strategically Reported Preferences. (arXiv:2307.14282v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.14282
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20379;&#19968;&#31181;&#32771;&#34385;&#20102;&#31574;&#30053;&#24615;&#35823;&#25253;&#30340;&#22240;&#26524;&#25928;&#24212;&#35782;&#21035;&#26041;&#27861;&#65292;&#21487;&#20197;&#23545;&#23398;&#26657;&#20998;&#37197;&#23545;&#26410;&#26469;&#32467;&#26524;&#20135;&#29983;&#30340;&#24433;&#21709;&#36827;&#34892;&#20934;&#30830;&#24230;&#37327;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#36866;&#29992;&#20110;&#21508;&#31181;&#26426;&#21046;&#65292;&#24182;&#33021;&#22815;&#24471;&#21040;&#23545;&#31574;&#30053;&#34892;&#20026;&#40065;&#26834;&#30340;&#22240;&#26524;&#25928;&#24212;&#30340;&#23574;&#38160;&#36793;&#30028;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36234;&#26469;&#36234;&#22810;&#30340;&#20013;&#22830;&#26426;&#26500;&#20351;&#29992;&#20998;&#37197;&#26426;&#21046;&#23558;&#23398;&#29983;&#20998;&#37197;&#21040;&#23398;&#26657;&#65292;&#20197;&#21453;&#26144;&#23398;&#29983;&#30340;&#20559;&#22909;&#21644;&#23398;&#26657;&#30340;&#20248;&#20808;&#26435;&#12290;&#28982;&#32780;&#65292;&#22823;&#22810;&#25968;&#29616;&#23454;&#19990;&#30028;&#30340;&#26426;&#21046;&#20250;&#32473;&#23398;&#29983;&#25552;&#20379;&#19968;&#31181;&#31574;&#30053;&#24615;&#24182;&#35823;&#25253;&#20182;&#20204;&#30340;&#20559;&#22909;&#30340;&#28608;&#21169;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20379;&#20102;&#19968;&#31181;&#35782;&#21035;&#22240;&#26524;&#25928;&#24212;&#30340;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#32771;&#34385;&#20102;&#31574;&#30053;&#24615;&#30340;&#35823;&#25253;&#12290;&#35823;&#25253;&#21487;&#33021;&#20351;&#29616;&#26377;&#30340;&#28857;&#35782;&#21035;&#26041;&#27861;&#26080;&#25928;&#65292;&#25105;&#20204;&#25512;&#23548;&#20986;&#23545;&#31574;&#30053;&#34892;&#20026;&#40065;&#26834;&#30340;&#22240;&#26524;&#25928;&#24212;&#30340;&#23574;&#38160;&#36793;&#30028;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#36866;&#29992;&#20110;&#20219;&#20309;&#26426;&#21046;&#65292;&#21482;&#35201;&#23384;&#22312;&#25551;&#36848;&#35813;&#26426;&#21046;&#20998;&#37197;&#35268;&#21017;&#30340;&#37197;&#23545;&#20998;&#25968;&#21644;&#25130;&#28857;&#12290;&#25105;&#20204;&#20351;&#29992;&#26234;&#21033;&#19968;&#20010;&#24310;&#36831;&#25509;&#21463;&#26426;&#21046;&#30340;&#25968;&#25454;&#65292;&#35813;&#26426;&#21046;&#23558;&#23398;&#29983;&#20998;&#37197;&#21040;1000&#22810;&#20010;&#22823;&#23398;&#19987;&#19994;&#32452;&#21512;&#12290;&#23398;&#29983;&#20986;&#20110;&#31574;&#30053;&#32771;&#34385;&#32780;&#34892;&#21160;&#65292;&#22240;&#20026;&#26234;&#21033;&#30340;&#26426;&#21046;&#38480;&#21046;&#20102;&#23398;&#29983;&#22312;&#20559;&#22909;&#20013;&#25552;&#20132;&#30340;&#19987;&#19994;&#25968;&#37327;&#20026;&#20843;&#20010;&#12290;
&lt;/p&gt;
&lt;p&gt;
A growing number of central authorities use assignment mechanisms to allocate students to schools in a way that reflects student preferences and school priorities. However, most real-world mechanisms give students an incentive to be strategic and misreport their preferences. In this paper, we provide an identification approach for causal effects of school assignment on future outcomes that accounts for strategic misreporting. Misreporting may invalidate existing point-identification approaches, and we derive sharp bounds for causal effects that are robust to strategic behavior. Our approach applies to any mechanism as long as there exist placement scores and cutoffs that characterize that mechanism's allocation rule. We use data from a deferred acceptance mechanism that assigns students to more than 1,000 university-major combinations in Chile. Students behave strategically because the mechanism in Chile constrains the number of majors that students submit in their preferences to eight
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#20351;&#29992;&#36125;&#21494;&#26031;&#21464;&#28857;&#26816;&#27979;&#26041;&#27861;&#35782;&#21035;&#23454;&#26102;&#35746;&#21333;&#27969;&#21464;&#21270;&#30340;&#26041;&#27861;&#65292;&#24182;&#36890;&#36807;&#24320;&#21457;&#19968;&#31181;&#26032;&#30340;BOCPD&#26041;&#27861;&#65292;&#21487;&#20197;&#26356;&#20934;&#30830;&#22320;&#39044;&#27979;&#35746;&#21333;&#27969;&#21644;&#24066;&#22330;&#24433;&#21709;&#12290;&#23454;&#35777;&#32467;&#26524;&#34920;&#26126;&#65292;&#25105;&#20204;&#30340;&#27169;&#22411;&#22312;&#26679;&#26412;&#22806;&#39044;&#27979;&#24615;&#33021;&#19978;&#20248;&#20110;&#29616;&#26377;&#27169;&#22411;&#12290;</title><link>http://arxiv.org/abs/2307.02375</link><description>&lt;p&gt;
&#22312;&#32447;&#23398;&#20064;&#35746;&#21333;&#27969;&#19982;&#24066;&#22330;&#24433;&#21709;&#30340;&#36125;&#21494;&#26031;&#21464;&#28857;&#26816;&#27979;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Online Learning of Order Flow and Market Impact with Bayesian Change-Point Detection Methods. (arXiv:2307.02375v1 [q-fin.TR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.02375
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#20351;&#29992;&#36125;&#21494;&#26031;&#21464;&#28857;&#26816;&#27979;&#26041;&#27861;&#35782;&#21035;&#23454;&#26102;&#35746;&#21333;&#27969;&#21464;&#21270;&#30340;&#26041;&#27861;&#65292;&#24182;&#36890;&#36807;&#24320;&#21457;&#19968;&#31181;&#26032;&#30340;BOCPD&#26041;&#27861;&#65292;&#21487;&#20197;&#26356;&#20934;&#30830;&#22320;&#39044;&#27979;&#35746;&#21333;&#27969;&#21644;&#24066;&#22330;&#24433;&#21709;&#12290;&#23454;&#35777;&#32467;&#26524;&#34920;&#26126;&#65292;&#25105;&#20204;&#30340;&#27169;&#22411;&#22312;&#26679;&#26412;&#22806;&#39044;&#27979;&#24615;&#33021;&#19978;&#20248;&#20110;&#29616;&#26377;&#27169;&#22411;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#37329;&#34701;&#35746;&#21333;&#27969;&#34920;&#29616;&#20986;&#26126;&#26174;&#30340;&#25345;&#20037;&#24615;&#65292;&#20080;&#20837;&#65288;&#21334;&#20986;&#65289;&#20132;&#26131;&#24120;&#24120;&#20250;&#22312;&#19968;&#23450;&#26102;&#38388;&#27573;&#21518;&#36319;&#38543;&#30528;&#36827;&#19968;&#27493;&#30340;&#20080;&#20837;&#65288;&#21334;&#20986;&#65289;&#20132;&#26131;&#12290;&#36825;&#31181;&#25345;&#20037;&#24615;&#21487;&#20197;&#24402;&#22240;&#20110;&#22823;&#35746;&#21333;&#30340;&#21010;&#20998;&#21644;&#36880;&#27493;&#25191;&#34892;&#12290;&#22240;&#27492;&#65292;&#21487;&#33021;&#20250;&#20986;&#29616;&#19981;&#21516;&#30340;&#35746;&#21333;&#27969;&#27169;&#24335;&#65292;&#21487;&#20197;&#36890;&#36807;&#36866;&#29992;&#20110;&#24066;&#22330;&#25968;&#25454;&#30340;&#36866;&#24403;&#26102;&#38388;&#24207;&#21015;&#27169;&#22411;&#26469;&#35782;&#21035;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#20351;&#29992;&#36125;&#21494;&#26031;&#22312;&#32447;&#21464;&#28857;&#26816;&#27979;&#65288;BOCPD&#65289;&#26041;&#27861;&#26469;&#23454;&#26102;&#35782;&#21035;&#21046;&#24230;&#24615;&#36716;&#21464;&#65292;&#24182;&#23454;&#29616;&#35746;&#21333;&#27969;&#21644;&#24066;&#22330;&#24433;&#21709;&#30340;&#22312;&#32447;&#39044;&#27979;&#12290;&#20026;&#20102;&#25552;&#39640;&#25105;&#20204;&#26041;&#27861;&#30340;&#26377;&#25928;&#24615;&#65292;&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#31181;&#20351;&#29992;&#35780;&#20998;&#39537;&#21160;&#26041;&#27861;&#30340;&#26032;&#22411;BOCPD&#26041;&#27861;&#12290;&#35813;&#26041;&#27861;&#36866;&#24212;&#27599;&#20010;&#21046;&#24230;&#20869;&#30340;&#26102;&#38388;&#30456;&#20851;&#24615;&#21644;&#26102;&#38388;&#21464;&#21270;&#21442;&#25968;&#12290;&#36890;&#36807;&#23545;&#32435;&#26031;&#36798;&#20811;&#25968;&#25454;&#30340;&#23454;&#35777;&#24212;&#29992;&#65292;&#25105;&#20204;&#21457;&#29616;&#65306;&#65288;i&#65289;&#25105;&#20204;&#26032;&#25552;&#20986;&#30340;&#27169;&#22411;&#23637;&#31034;&#20986;&#20248;&#20110;&#29616;&#26377;&#20551;&#35774;&#29420;&#31435;&#21516;&#20998;&#24067;&#30340;&#27169;&#22411;&#30340;&#26679;&#26412;&#22806;&#39044;&#27979;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;
Financial order flow exhibits a remarkable level of persistence, wherein buy (sell) trades are often followed by subsequent buy (sell) trades over extended periods. This persistence can be attributed to the division and gradual execution of large orders. Consequently, distinct order flow regimes might emerge, which can be identified through suitable time series models applied to market data. In this paper, we propose the use of Bayesian online change-point detection (BOCPD) methods to identify regime shifts in real-time and enable online predictions of order flow and market impact. To enhance the effectiveness of our approach, we have developed a novel BOCPD method using a score-driven approach. This method accommodates temporal correlations and time-varying parameters within each regime. Through empirical application to NASDAQ data, we have found that: (i) Our newly proposed model demonstrates superior out-of-sample predictive performance compared to existing models that assume i.i.d.
&lt;/p&gt;</description></item></channel></rss>