<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#22312;&#23545;&#30456;&#20114;&#24178;&#25200;&#26045;&#21152;&#24369;&#38480;&#21046;&#26465;&#20214;&#26102;&#22240;&#26524;&#35299;&#37322;&#20272;&#35745;&#37327;&#30340;&#38382;&#39064;&#65292;&#24182;&#25552;&#20986;&#20102;&#29992;&#20110;&#22240;&#26524;&#21487;&#35299;&#37322;&#24615;&#30340;&#31526;&#21495;&#20445;&#30041;&#26631;&#20934;&#12290;</title><link>https://arxiv.org/abs/2403.08183</link><description>&lt;p&gt;
&#30001;&#26292;&#38706;&#26144;&#23556;&#23450;&#20041;&#30340;&#20272;&#35745;&#37327;&#30340;&#22240;&#26524;&#35299;&#37322;
&lt;/p&gt;
&lt;p&gt;
Causal Interpretation of Estimands Defined by Exposure Mappings
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.08183
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#22312;&#23545;&#30456;&#20114;&#24178;&#25200;&#26045;&#21152;&#24369;&#38480;&#21046;&#26465;&#20214;&#26102;&#22240;&#26524;&#35299;&#37322;&#20272;&#35745;&#37327;&#30340;&#38382;&#39064;&#65292;&#24182;&#25552;&#20986;&#20102;&#29992;&#20110;&#22240;&#26524;&#21487;&#35299;&#37322;&#24615;&#30340;&#31526;&#21495;&#20445;&#30041;&#26631;&#20934;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#23384;&#22312;&#30456;&#20114;&#24178;&#25200;&#30340;&#24773;&#20917;&#19979;&#65292;&#36890;&#24120;&#21033;&#29992;&#30001;&#26292;&#38706;&#26144;&#23556;&#23450;&#20041;&#30340;&#20272;&#35745;&#37327;&#26469;&#24635;&#32467;&#19982;&#20010;&#20307;&#30456;&#37051;&#30340;&#27835;&#30103;&#20998;&#37197;&#21464;&#21270;&#30340;&#24433;&#21709;&#12290;&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#23545;&#30456;&#20114;&#24178;&#25200;&#26045;&#21152;&#24369;&#38480;&#21046;&#26465;&#20214;&#26102;&#23427;&#20204;&#30340;&#22240;&#26524;&#35299;&#37322;&#12290;&#25105;&#20204;&#35777;&#26126;&#22312;&#20256;&#32479;&#30340;&#35782;&#21035;&#26465;&#20214;&#19979;&#65292;&#36825;&#20123;&#20272;&#35745;&#37327;&#21487;&#33021;&#20986;&#29616;&#19981;&#21487;&#21462;&#30340;&#31526;&#21495;&#21453;&#36716;&#12290;&#36825;&#20419;&#20351;&#25552;&#20986;&#29992;&#20110;&#22240;&#26524;&#21487;&#35299;&#37322;&#24615;&#30340;&#31526;&#21495;&#20445;&#30041;&#26631;&#20934;&#12290;&#20026;&#28385;&#36275;&#39318;&#36873;&#26631;&#20934;&#65292;&#26377;&#24517;&#35201;&#23545;&#30456;&#20114;&#24178;&#25200;&#26045;&#21152;&#32422;&#26463;&#65292;&#26080;&#35770;&#26159;&#22312;&#28508;&#22312;&#32467;&#26524;&#36824;&#26159;&#22312;&#27835;&#30103;&#36873;&#25321;&#20013;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#20805;&#20998;&#26465;&#20214;&#65292;&#24182;&#23637;&#31034;&#23427;&#20204;&#30001;&#19968;&#20010;&#20801;&#35768;&#22312;&#32467;&#26524;&#21644;&#36873;&#25321;&#38454;&#27573;&#20013;&#23384;&#22312;&#22797;&#26434;&#24178;&#25200;&#24418;&#24335;&#30340;&#38750;&#21442;&#25968;&#27169;&#22411;&#28385;&#36275;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.08183v1 Announce Type: new  Abstract: In settings with interference, it is common to utilize estimands defined by exposure mappings to summarize the impact of variation in treatment assignments local to the ego. This paper studies their causal interpretation under weak restrictions on interference. We demonstrate that the estimands can exhibit unpalatable sign reversals under conventional identification conditions. This motivates the formulation of sign preservation criteria for causal interpretability. To satisfy preferred criteria, it is necessary to impose restrictions on interference, either in potential outcomes or selection into treatment. We provide sufficient conditions and show that they are satisfied by a nonparametric model allowing for a complex form of interference in both the outcome and selection stages.
&lt;/p&gt;</description></item></channel></rss>