<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#20813;&#30123;&#20316;&#24330;&#30340;&#25293;&#21334;&#24418;&#24335;&#65292;&#21457;&#29616;&#33655;&#20848;&#24335;&#25293;&#21334;&#65288;&#35774;&#26377;&#36866;&#24403;&#20445;&#30041;&#20215;&#65289;&#26159;&#21807;&#19968;&#30340;&#26368;&#20248;&#19988;&#24378;&#20813;&#30123;&#20316;&#24330;&#30340;&#25293;&#21334;&#65292;&#21516;&#26102;&#33655;&#20848;&#24335;&#25293;&#21334;&#65288;&#27809;&#26377;&#20445;&#30041;&#20215;&#65289;&#26159;&#21807;&#19968;&#21516;&#26102;&#39640;&#25928;&#21644;&#24369;&#20813;&#30123;&#20316;&#24330;&#30340;&#20808;&#39564;&#29420;&#31435;&#25293;&#21334;&#12290;</title><link>https://arxiv.org/abs/2404.00475</link><description>&lt;p&gt;
&#20813;&#30123;&#20316;&#24330;&#25293;&#21334;
&lt;/p&gt;
&lt;p&gt;
Shill-Proof Auctions
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2404.00475
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#20813;&#30123;&#20316;&#24330;&#30340;&#25293;&#21334;&#24418;&#24335;&#65292;&#21457;&#29616;&#33655;&#20848;&#24335;&#25293;&#21334;&#65288;&#35774;&#26377;&#36866;&#24403;&#20445;&#30041;&#20215;&#65289;&#26159;&#21807;&#19968;&#30340;&#26368;&#20248;&#19988;&#24378;&#20813;&#30123;&#20316;&#24330;&#30340;&#25293;&#21334;&#65292;&#21516;&#26102;&#33655;&#20848;&#24335;&#25293;&#21334;&#65288;&#27809;&#26377;&#20445;&#30041;&#20215;&#65289;&#26159;&#21807;&#19968;&#21516;&#26102;&#39640;&#25928;&#21644;&#24369;&#20813;&#30123;&#20316;&#24330;&#30340;&#20808;&#39564;&#29420;&#31435;&#25293;&#21334;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#21333;&#21697;&#25293;&#21334;&#20013;&#65292;&#19968;&#20010;&#27450;&#35784;&#24615;&#30340;&#21334;&#23478;&#21487;&#33021;&#20250;&#20266;&#35013;&#25104;&#19968;&#20010;&#25110;&#22810;&#20010;&#31454;&#26631;&#32773;&#65292;&#20197;&#25805;&#32437;&#25104;&#20132;&#20215;&#26684;&#12290;&#26412;&#25991;&#23545;&#37027;&#20123;&#20813;&#30123;&#20316;&#24330;&#30340;&#25293;&#21334;&#26684;&#24335;&#36827;&#34892;&#20102;&#34920;&#24449;&#65306;&#19968;&#20010;&#21033;&#28070;&#26368;&#22823;&#21270;&#30340;&#21334;&#23478;&#27809;&#26377;&#20219;&#20309;&#21160;&#26426;&#25552;&#20132;&#20219;&#20309;&#34394;&#20551;&#25253;&#20215;&#12290;&#25105;&#20204;&#21306;&#20998;&#20102;&#24378;&#20813;&#30123;&#20316;&#24330;&#65292;&#21363;&#19968;&#20010;&#20102;&#35299;&#31454;&#26631;&#32773;&#20272;&#20540;&#30340;&#21334;&#23478;&#27704;&#36828;&#26080;&#27861;&#20174;&#20316;&#24330;&#20013;&#33719;&#21033;&#65292;&#21644;&#24369;&#20813;&#30123;&#20316;&#24330;&#65292;&#23427;&#20165;&#35201;&#27714;&#20174;&#20316;&#24330;&#20013;&#24471;&#21040;&#30340;&#24179;&#34913;&#39044;&#26399;&#21033;&#28070;&#20026;&#38750;&#27491;&#12290;&#33655;&#20848;&#24335;&#25293;&#21334;&#65288;&#35774;&#26377;&#36866;&#24403;&#20445;&#30041;&#20215;&#65289;&#26159;&#21807;&#19968;&#30340;&#26368;&#20248;&#21644;&#24378;&#20813;&#30123;&#20316;&#24330;&#25293;&#21334;&#12290;&#27492;&#22806;&#65292;&#33655;&#20848;&#24335;&#25293;&#21334;&#65288;&#27809;&#26377;&#20445;&#30041;&#20215;&#65289;&#26159;&#21807;&#19968;&#30340;&#20855;&#26377;&#20808;&#39564;&#29420;&#31435;&#24615;&#30340;&#25293;&#21334;&#65292;&#26082;&#39640;&#25928;&#21448;&#24369;&#20813;&#30123;&#20316;&#24330;&#12290;&#34429;&#28982;&#23384;&#22312;&#22810;&#31181;&#31574;&#30053;&#35777;&#26126;&#12289;&#24369;&#20813;&#30123;&#20316;&#24330;&#21644;&#26368;&#20248;&#25293;&#21334;&#65307;&#20219;&#20309;&#26368;&#20248;&#25293;&#21334;&#21482;&#33021;&#28385;&#36275;&#38598;&#21512; {&#38745;&#24577;&#12289;&#31574;&#30053;&#35777;&#26126;&#12289;&#24369;&#20813;&#30123;&#20316;&#24330;} &#20013;&#30340;&#20004;&#20010;&#24615;&#36136;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2404.00475v1 Announce Type: new  Abstract: In a single-item auction, a duplicitous seller may masquerade as one or more bidders in order to manipulate the clearing price. This paper characterizes auction formats that are shill-proof: a profit-maximizing seller has no incentive to submit any shill bids. We distinguish between strong shill-proofness, in which a seller with full knowledge of bidders' valuations can never profit from shilling, and weak shill-proofness, which requires only that the expected equilibrium profit from shilling is nonpositive. The Dutch auction (with suitable reserve) is the unique optimal and strongly shill-proof auction. Moreover, the Dutch auction (with no reserve) is the unique prior-independent auction that is both efficient and weakly shill-proof. While there are a multiplicity of strategy-proof, weakly shill-proof, and optimal auctions; any optimal auction can satisfy only two properties in the set {static, strategy-proof, weakly shill-proof}.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#21644;&#36716;&#25442;&#22120;&#30340;&#32463;&#39564;&#20139;&#20048;&#27169;&#22411;&#65292;&#33021;&#22815;&#22788;&#29702;&#22823;&#37327;&#26410;&#32467;&#26500;&#21270;&#30340;&#20135;&#21697;&#25968;&#25454;&#65292;&#20934;&#30830;&#22320;&#20272;&#35745;&#20135;&#21697;&#30340;&#20139;&#20048;&#20215;&#26684;&#21644;&#27966;&#29983;&#25351;&#25968;&#12290;</title><link>http://arxiv.org/abs/2305.00044</link><description>&lt;p&gt;
&#30001;&#20154;&#24037;&#26234;&#33021;&#39537;&#21160;&#30340;&#20139;&#20048;&#20215;&#26684;&#21644;&#36136;&#37327;&#35843;&#25972;&#20215;&#26684;&#25351;&#25968;
&lt;/p&gt;
&lt;p&gt;
Hedonic Prices and Quality Adjusted Price Indices Powered by AI. (arXiv:2305.00044v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.00044
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#21644;&#36716;&#25442;&#22120;&#30340;&#32463;&#39564;&#20139;&#20048;&#27169;&#22411;&#65292;&#33021;&#22815;&#22788;&#29702;&#22823;&#37327;&#26410;&#32467;&#26500;&#21270;&#30340;&#20135;&#21697;&#25968;&#25454;&#65292;&#20934;&#30830;&#22320;&#20272;&#35745;&#20135;&#21697;&#30340;&#20139;&#20048;&#20215;&#26684;&#21644;&#27966;&#29983;&#25351;&#25968;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#24403;&#20170;&#30340;&#32463;&#27982;&#29615;&#22659;&#19979;&#65292;&#20351;&#29992;&#30005;&#23376;&#35760;&#24405;&#20934;&#30830;&#22320;&#23454;&#26102;&#27979;&#37327;&#20215;&#26684;&#25351;&#25968;&#30340;&#21464;&#21270;&#23545;&#20110;&#36319;&#36394;&#36890;&#32960;&#21644;&#29983;&#20135;&#29575;&#33267;&#20851;&#37325;&#35201;&#12290;&#26412;&#25991;&#24320;&#21457;&#20102;&#32463;&#39564;&#20139;&#20048;&#27169;&#22411;&#65292;&#33021;&#22815;&#22788;&#29702;&#22823;&#37327;&#26410;&#32467;&#26500;&#21270;&#30340;&#20135;&#21697;&#25968;&#25454;&#65288;&#25991;&#26412;&#12289;&#22270;&#20687;&#12289;&#20215;&#26684;&#21644;&#25968;&#37327;&#65289;&#65292;&#24182;&#36755;&#20986;&#31934;&#30830;&#30340;&#20139;&#20048;&#20215;&#26684;&#20272;&#35745;&#21644;&#27966;&#29983;&#25351;&#25968;&#12290;&#20026;&#23454;&#29616;&#36825;&#19968;&#30446;&#26631;&#65292;&#25105;&#20204;&#20351;&#29992;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#20174;&#25991;&#26412;&#25551;&#36848;&#21644;&#22270;&#20687;&#20013;&#29983;&#25104;&#25277;&#35937;&#30340;&#20135;&#21697;&#23646;&#24615;&#25110;&#8221;&#29305;&#24449;&#8220;&#65292;&#28982;&#21518;&#20351;&#29992;&#36825;&#20123;&#23646;&#24615;&#26469;&#20272;&#31639;&#20139;&#20048;&#20215;&#26684;&#20989;&#25968;&#12290;&#20855;&#20307;&#22320;&#65292;&#25105;&#20204;&#20351;&#29992;&#22522;&#20110;transformers&#30340;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#23558;&#26377;&#20851;&#20135;&#21697;&#30340;&#25991;&#26412;&#20449;&#24687;&#36716;&#25442;&#20026;&#25968;&#23383;&#29305;&#24449;&#65292;&#20351;&#29992;&#35757;&#32451;&#25110;&#24494;&#35843;&#36807;&#30340;&#20135;&#21697;&#25551;&#36848;&#20449;&#24687;&#65292;&#20351;&#29992;&#27531;&#24046;&#32593;&#32476;&#27169;&#22411;&#23558;&#20135;&#21697;&#22270;&#20687;&#36716;&#25442;&#20026;&#25968;&#23383;&#29305;&#24449;&#12290;&#20026;&#20102;&#20135;&#29983;&#20272;&#35745;&#30340;&#20139;&#20048;&#20215;&#26684;&#20989;&#25968;&#65292;&#25105;&#20204;&#20877;&#27425;&#20351;&#29992;&#22810;&#20219;&#21153;&#31070;&#32463;&#32593;&#32476;&#65292;&#35757;&#32451;&#20197;&#22312;&#25152;&#26377;&#26102;&#38388;&#27573;&#21516;&#26102;&#39044;&#27979;&#20135;&#21697;&#30340;&#20215;&#26684;&#12290;
&lt;/p&gt;
&lt;p&gt;
Accurate, real-time measurements of price index changes using electronic records are essential for tracking inflation and productivity in today's economic environment. We develop empirical hedonic models that can process large amounts of unstructured product data (text, images, prices, quantities) and output accurate hedonic price estimates and derived indices. To accomplish this, we generate abstract product attributes, or ``features,'' from text descriptions and images using deep neural networks, and then use these attributes to estimate the hedonic price function. Specifically, we convert textual information about the product to numeric features using large language models based on transformers, trained or fine-tuned using product descriptions, and convert the product image to numeric features using a residual network model. To produce the estimated hedonic price function, we again use a multi-task neural network trained to predict a product's price in all time periods simultaneousl
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#23545;&#27495;&#35270;&#29702;&#35770;&#36827;&#34892;&#20102;&#32508;&#36848;&#24182;&#25552;&#20986;&#20102;&#26032;&#30340;&#30740;&#31350;&#25104;&#26524;&#65292;&#21253;&#25324;&#29305;&#23450;&#23398;&#20064;&#21644;&#20449;&#20196;&#29615;&#22659;&#19979;&#30340;&#24605;&#32771;&#65292;&#31639;&#27861;&#23398;&#20064;&#21644;&#20915;&#31574;&#21046;&#23450;&#65292;&#20197;&#21450;&#24341;&#20837;&#34892;&#20026;&#20559;&#24046;&#21644;&#35823;&#35774;&#20449;&#24565;&#30340;&#20195;&#29702;&#12290;&#27492;&#22806;&#65292;&#35813;&#25991;&#30830;&#23450;&#20102;&#19968;&#20010;&#30001;&#27495;&#35270;&#24615;&#31038;&#20250;&#35268;&#33539;&#21644;&#27495;&#35270;&#24615;&#21046;&#24230;&#35774;&#35745;&#29702;&#35770;&#32452;&#25104;&#30340;&#27495;&#35270;&#24615;&#26426;&#26500;&#27169;&#22411;&#31867;&#21035;&#65292;&#25506;&#35752;&#20102;&#20851;&#20110;&#27495;&#35270;&#27979;&#37327;&#21644;&#27495;&#35270;&#20998;&#31867;&#30340;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2205.05994</link><description>&lt;p&gt;
&#27495;&#35270;&#29702;&#35770;&#30340;&#36817;&#26399;&#36129;&#29486;
&lt;/p&gt;
&lt;p&gt;
Recent Contributions to Theories of Discrimination. (arXiv:2205.05994v3 [econ.TH] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2205.05994
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#23545;&#27495;&#35270;&#29702;&#35770;&#36827;&#34892;&#20102;&#32508;&#36848;&#24182;&#25552;&#20986;&#20102;&#26032;&#30340;&#30740;&#31350;&#25104;&#26524;&#65292;&#21253;&#25324;&#29305;&#23450;&#23398;&#20064;&#21644;&#20449;&#20196;&#29615;&#22659;&#19979;&#30340;&#24605;&#32771;&#65292;&#31639;&#27861;&#23398;&#20064;&#21644;&#20915;&#31574;&#21046;&#23450;&#65292;&#20197;&#21450;&#24341;&#20837;&#34892;&#20026;&#20559;&#24046;&#21644;&#35823;&#35774;&#20449;&#24565;&#30340;&#20195;&#29702;&#12290;&#27492;&#22806;&#65292;&#35813;&#25991;&#30830;&#23450;&#20102;&#19968;&#20010;&#30001;&#27495;&#35270;&#24615;&#31038;&#20250;&#35268;&#33539;&#21644;&#27495;&#35270;&#24615;&#21046;&#24230;&#35774;&#35745;&#29702;&#35770;&#32452;&#25104;&#30340;&#27495;&#35270;&#24615;&#26426;&#26500;&#27169;&#22411;&#31867;&#21035;&#65292;&#25506;&#35752;&#20102;&#20851;&#20110;&#27495;&#35270;&#27979;&#37327;&#21644;&#27495;&#35270;&#20998;&#31867;&#30340;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#32508;&#36848;&#20102;&#20851;&#20110;&#27495;&#35270;&#29702;&#35770;&#30340;&#25991;&#29486;&#65292;&#20027;&#35201;&#20851;&#27880;&#20110;&#26032;&#30340;&#30740;&#31350;&#25104;&#26524;&#12290;&#26368;&#36817;&#30340;&#29702;&#35770;&#25193;&#23637;&#20102;&#20256;&#32479;&#30340;&#22522;&#20110;&#21697;&#21619;&#21644;&#32479;&#35745;&#27495;&#35270;&#26694;&#26550;&#65292;&#36890;&#36807;&#32771;&#34385;&#23398;&#20064;&#21644;&#20449;&#21495;&#29615;&#22659;&#30340;&#29305;&#23450;&#29305;&#28857;&#65292;&#32463;&#24120;&#20351;&#29992;&#26032;&#30340;&#20449;&#24687;&#21644;&#26426;&#21046;&#35774;&#35745;&#35821;&#35328;&#65307;&#36890;&#36807;&#20998;&#26512;&#31639;&#27861;&#30340;&#23398;&#20064;&#21644;&#20915;&#31574;&#21046;&#23450;&#65307;&#24182;&#24341;&#20837;&#20855;&#26377;&#34892;&#20026;&#20559;&#24046;&#21644;&#35823;&#35774;&#20449;&#24565;&#30340;&#20195;&#29702;&#12290;&#35813;&#32508;&#36848;&#36824;&#23581;&#35797;&#32553;&#23567;&#32463;&#27982;&#23398;&#35282;&#24230;&#23545;&#8220;&#27495;&#35270;&#29702;&#35770;&#8221;&#30340;&#30475;&#27861;&#19982;&#31038;&#20250;&#31185;&#23398;&#25991;&#29486;&#20013;&#26356;&#24191;&#27867;&#30340;&#27495;&#35270;&#30740;&#31350;&#20043;&#38388;&#30340;&#24046;&#36317;&#12290;&#22312;&#36825;&#26041;&#38754;&#65292;&#25105;&#39318;&#20808;&#36890;&#36807;&#30830;&#23450;&#19968;&#20010;&#30001;&#27495;&#35270;&#24615;&#31038;&#20250;&#35268;&#33539;&#21644;&#27495;&#35270;&#24615;&#21046;&#24230;&#35774;&#35745;&#29702;&#35770;&#32452;&#25104;&#30340;&#27495;&#35270;&#24615;&#26426;&#26500;&#27169;&#22411;&#31867;&#21035;&#20570;&#20986;&#36129;&#29486;&#12290;&#20854;&#27425;&#65292;&#35752;&#35770;&#28041;&#21450;&#27495;&#35270;&#27979;&#37327;&#21644;&#23558;&#27495;&#35270;&#20998;&#31867;&#20026;&#20559;&#35265;&#25110;&#32479;&#35745;&#23398;&#65292;&#30452;&#25509;&#25110;&#31995;&#32479;&#24615;&#20197;&#21450;&#19990;&#30028;&#24615;&#31561;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper surveys the literature on theories of discrimination, focusing mainly on new contributions. Recent theories expand on the traditional taste-based and statistical discrimination frameworks by considering specific features of learning and signaling environments, often using novel informationand mechanism-design language; analyzing learning and decision making by algorithms; and introducing agents with behavioral biases and misspecified beliefs. This survey also attempts to narrow the gap between the economic perspective on ``theories of discrimination'' and the broader study of discrimination in the social science literature. In that respect, I first contribute by identifying a class of models of discriminatory institutions, made up of theories of discriminatory social norms and discriminatory institutional design. Second, I discuss issues relating to the measurement of discrimination, and the classification of discrimination as bias or statistical, direct or systemic, and a
&lt;/p&gt;</description></item></channel></rss>