<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#21160;&#24577;&#22240;&#23376;&#27169;&#22411;&#26159;&#29992;&#20110;&#20998;&#26512;&#21644;&#39044;&#27979;&#39640;&#32500;&#24230;&#26102;&#38388;&#24207;&#21015;&#30340;&#19968;&#31181;&#26041;&#27861;&#65292;&#32463;&#27982;&#23398;&#23478;&#36890;&#36807;&#37319;&#29992;&#22240;&#23376;&#27169;&#22411;&#30340;&#28176;&#36817;&#26041;&#27861;&#65292;&#22312;&#20004;&#20010;&#19990;&#32426;&#20869;&#21457;&#23637;&#20986;&#20102;&#19968;&#22871;&#24191;&#27867;&#32780;&#25104;&#21151;&#30340;&#25216;&#26415;&#20307;&#31995;&#65292;&#34987;&#24191;&#27867;&#24212;&#29992;&#20110;&#37329;&#34701;&#26426;&#26500;&#12289;&#32463;&#27982;&#21644;&#32479;&#35745;&#30740;&#31350;&#26426;&#26500;&#12290;</title><link>http://arxiv.org/abs/2310.17278</link><description>&lt;p&gt;
&#21160;&#24577;&#22240;&#23376;&#27169;&#22411;&#65306;&#19968;&#20010;&#23478;&#35889;
&lt;/p&gt;
&lt;p&gt;
Dynamic Factor Models: a Genealogy. (arXiv:2310.17278v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.17278
&lt;/p&gt;
&lt;p&gt;
&#21160;&#24577;&#22240;&#23376;&#27169;&#22411;&#26159;&#29992;&#20110;&#20998;&#26512;&#21644;&#39044;&#27979;&#39640;&#32500;&#24230;&#26102;&#38388;&#24207;&#21015;&#30340;&#19968;&#31181;&#26041;&#27861;&#65292;&#32463;&#27982;&#23398;&#23478;&#36890;&#36807;&#37319;&#29992;&#22240;&#23376;&#27169;&#22411;&#30340;&#28176;&#36817;&#26041;&#27861;&#65292;&#22312;&#20004;&#20010;&#19990;&#32426;&#20869;&#21457;&#23637;&#20986;&#20102;&#19968;&#22871;&#24191;&#27867;&#32780;&#25104;&#21151;&#30340;&#25216;&#26415;&#20307;&#31995;&#65292;&#34987;&#24191;&#27867;&#24212;&#29992;&#20110;&#37329;&#34701;&#26426;&#26500;&#12289;&#32463;&#27982;&#21644;&#32479;&#35745;&#30740;&#31350;&#26426;&#26500;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21160;&#24577;&#22240;&#23376;&#27169;&#22411;&#30340;&#21457;&#23637;&#28304;&#20110;&#23545;&#36234;&#26469;&#36234;&#39640;&#32500;&#24230;&#26102;&#38388;&#24207;&#21015;&#30340;&#20998;&#26512;&#21644;&#39044;&#27979;&#30340;&#38656;&#27714;&#12290;&#22312;&#38754;&#23545;&#39640;&#32500;&#35266;&#27979;&#31354;&#38388;&#30340;&#25512;&#26029;&#38382;&#39064;&#26102;&#65292;&#25968;&#29702;&#32479;&#35745;&#23398;&#23478;&#20851;&#27880;&#30340;&#26159;&#25152;&#35859;&#30340;&#23574;&#23792;&#27169;&#22411;&#28176;&#36817;&#24615;&#65292;&#32780;&#35745;&#37327;&#32463;&#27982;&#23398;&#23478;&#21017;&#37319;&#29992;&#20102;&#19968;&#31181;&#23436;&#20840;&#12289;&#30456;&#23545;&#26356;&#26377;&#25928;&#30340;&#28176;&#36817;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#28304;&#33258;&#20110;&#26368;&#21021;&#22312;&#24515;&#29702;&#27979;&#37327;&#23398;&#20013;&#32771;&#34385;&#30340;&#22240;&#23376;&#27169;&#22411;&#12290;&#25152;&#35859;&#30340;&#21160;&#24577;&#22240;&#23376;&#27169;&#22411;&#26041;&#27861;&#22312;&#20108;&#21313;&#24180;&#30340;&#26102;&#38388;&#37324;&#24050;&#32463;&#21457;&#23637;&#25104;&#20026;&#19968;&#20010;&#24191;&#27867;&#19988;&#25104;&#21151;&#30340;&#25216;&#26415;&#20307;&#31995;&#65292;&#34987;&#24191;&#27867;&#24212;&#29992;&#20110;&#22830;&#34892;&#12289;&#37329;&#34701;&#26426;&#26500;&#12289;&#32463;&#27982;&#21644;&#32479;&#35745;&#30740;&#31350;&#26426;&#26500;&#12290;&#26412;&#31456;&#30340;&#30446;&#26631;&#19981;&#26159;&#23545;&#35813;&#20027;&#39064;&#36827;&#34892;&#35814;&#23613;&#30340;&#35843;&#26597;&#65292;&#32780;&#26159;&#23545;&#20854;&#21382;&#21490;&#21457;&#23637;&#36827;&#34892;&#27010;&#36848;&#65292;&#37325;&#28857;&#20851;&#27880;&#21508;&#31181;&#20551;&#35774;&#21644;&#35299;&#37322;&#65292;&#24182;&#25552;&#20379;&#19968;&#20010;&#20854;&#20027;&#35201;&#21464;&#20307;&#30340;&#23478;&#35889;&#12290;
&lt;/p&gt;
&lt;p&gt;
Dynamic factor models have been developed out of the need of analyzing and forecasting time series in increasingly high dimensions. While mathematical statisticians faced with inference problems in high-dimensional observation spaces were focusing on the so-called spiked-model-asymptotics, econometricians adopted an entirely and considerably more effective asymptotic approach, rooted in the factor models originally considered in psychometrics. The so-called dynamic factor model methods, in two decades, has grown into a wide and successful body of techniques that are widely used in central banks, financial institutions, economic and statistical institutes. The objective of this chapter is not an extensive survey of the topic but a sketch of its historical growth, with emphasis on the various assumptions and interpretations, and a family tree of its main variants.
&lt;/p&gt;</description></item></channel></rss>