<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#26412;&#25991;&#23637;&#31034;&#20102;&#22914;&#20309;&#21033;&#29992;&#32452;&#32455;&#30340;&#36130;&#21153;&#25253;&#34920;&#26469;&#24320;&#21457;&#19968;&#20010;&#32508;&#21512;&#30340;&#30899;&#21644;&#29983;&#29289;&#22810;&#26679;&#24615;&#36275;&#36857;&#36134;&#25143;&#12290;&#36890;&#36807;&#21033;&#29992;&#31354;&#38388;&#26126;&#30830;&#30340;&#28508;&#22312;&#29289;&#31181;&#25439;&#22833;&#20316;&#20026;&#24230;&#37327;&#26631;&#20934;&#65292;&#25105;&#20204;&#25552;&#20379;&#20102;&#19968;&#20010;&#20840;&#29699;&#29983;&#29289;&#22810;&#26679;&#24615;&#36275;&#36857;&#25968;&#25454;&#24211;&#12290;</title><link>http://arxiv.org/abs/2309.14186</link><description>&lt;p&gt;
&#21487;&#36716;&#21270;&#30340;&#37329;&#34701;&#12289;&#30899;&#21644;&#29983;&#29289;&#22810;&#26679;&#24615;&#36275;&#36857;&#20250;&#35745;
&lt;/p&gt;
&lt;p&gt;
Value-transforming financial, carbon and biodiversity footprint accounting. (arXiv:2309.14186v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.14186
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#23637;&#31034;&#20102;&#22914;&#20309;&#21033;&#29992;&#32452;&#32455;&#30340;&#36130;&#21153;&#25253;&#34920;&#26469;&#24320;&#21457;&#19968;&#20010;&#32508;&#21512;&#30340;&#30899;&#21644;&#29983;&#29289;&#22810;&#26679;&#24615;&#36275;&#36857;&#36134;&#25143;&#12290;&#36890;&#36807;&#21033;&#29992;&#31354;&#38388;&#26126;&#30830;&#30340;&#28508;&#22312;&#29289;&#31181;&#25439;&#22833;&#20316;&#20026;&#24230;&#37327;&#26631;&#20934;&#65292;&#25105;&#20204;&#25552;&#20379;&#20102;&#19968;&#20010;&#20840;&#29699;&#29983;&#29289;&#22810;&#26679;&#24615;&#36275;&#36857;&#25968;&#25454;&#24211;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20026;&#20102;&#23454;&#29616;&#30899;&#20013;&#21644;&#12289;&#26080;&#20928;&#25439;&#22833;&#29983;&#29289;&#22810;&#26679;&#24615;&#21644;&#22320;&#29699;&#31119;&#31049;&#65292;&#38656;&#35201;&#23545;&#25105;&#20204;&#30340;&#29983;&#20135;&#21644;&#28040;&#36153;&#20064;&#24815;&#36827;&#34892;&#36716;&#22411;&#24615;&#21464;&#38761;&#12290;&#32452;&#32455;&#26159;&#25105;&#20204;&#20154;&#31867;&#32452;&#32455;&#26085;&#24120;&#29983;&#27963;&#30340;&#26041;&#24335;&#65292;&#25105;&#20204;&#30340;&#36127;&#38754;&#29615;&#22659;&#24433;&#21709;&#65292;&#20063;&#31216;&#20026;&#30899;&#21644;&#29983;&#29289;&#22810;&#26679;&#24615;&#36275;&#36857;&#65292;&#22823;&#37096;&#20998;&#26159;&#30001;&#32452;&#32455;&#24341;&#36215;&#30340;&#12290;&#26412;&#25991;&#23637;&#31034;&#20102;&#22914;&#20309;&#21033;&#29992;&#20219;&#20309;&#32452;&#32455;&#30340;&#36130;&#21153;&#25253;&#34920;&#26469;&#24320;&#21457;&#19968;&#20010;&#32508;&#21512;&#30340;&#30899;&#21644;&#29983;&#29289;&#22810;&#26679;&#24615;&#36275;&#36857;&#36134;&#25143;&#12290;&#20316;&#20026;&#24230;&#37327;&#26631;&#20934;&#65292;&#25105;&#20204;&#21033;&#29992;&#20102;&#31354;&#38388;&#26126;&#30830;&#30340;&#28508;&#22312;&#20840;&#29699;&#29289;&#31181;&#25439;&#22833;&#65292;&#25105;&#20204;&#35748;&#20026;&#36825;&#21487;&#20197;&#29702;&#35299;&#20026;&#29983;&#29289;&#22810;&#26679;&#24615;&#30340;&#31561;&#25928;&#25351;&#26631;&#65292;&#23545;&#20110;&#29983;&#29289;&#22810;&#26679;&#24615;&#26469;&#35828;&#65292;&#20854;&#25928;&#29992;&#31867;&#20284;&#20110;&#23545;&#27668;&#20505;&#26469;&#35828;&#30340;&#20108;&#27687;&#21270;&#30899;&#31561;&#25928;&#25351;&#26631;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#19968;&#20010;&#20840;&#29699;&#29983;&#29289;&#22810;&#26679;&#24615;&#36275;&#36857;&#25968;&#25454;&#24211;&#65292;&#32452;&#32455;&#12289;&#19987;&#23478;&#21644;&#30740;&#31350;&#20154;&#21592;&#21487;&#20197;&#20351;&#29992;&#35813;&#25968;&#25454;&#24211;&#26469;&#35780;&#20272;&#22522;&#20110;&#28040;&#36153;&#30340;&#29983;&#29289;&#22810;&#26679;&#24615;&#36275;&#36857;&#12290;&#25105;&#20204;&#36824;&#35748;&#20026;&#65292;&#24403;&#21069;&#36130;&#21153;&#21644;&#29615;&#22659;&#25351;&#26631;&#30340;&#25972;&#21512;&#26377;&#24453;&#36827;&#19968;&#27493;&#23436;&#21892;&#12290;
&lt;/p&gt;
&lt;p&gt;
Transformative changes in our production and consumption habits are needed to enable the sustainability transition towards carbon neutrality, no net loss of biodiversity, and planetary well-being. Organizations are the way we humans have organized our everyday life, and much of our negative environmental impacts, also called carbon and biodiversity footprints, are caused by organizations. Here we show how the financial accounts of any organization can be exploited to develop an integrated carbon and biodiversity footprint account. As a metric we utilize spatially explicit potential global loss of species which, we argue, can be understood as the biodiversity equivalent, the utility of which for biodiversity is similar to what carbon dioxide equivalent is for climate. We provide a global Biodiversity Footprint Database that organizations, experts and researchers can use to assess consumption-based biodiversity footprints. We also argue that the current integration of financial and envir
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#33655;&#20848;&#20013;&#23398;&#38454;&#27573;&#20998;&#29677;&#20915;&#31574;&#30340;&#36136;&#37327;&#65292;&#21457;&#29616;&#25945;&#24072;&#30340;&#21021;&#22987;&#20998;&#29677;&#20915;&#31574;&#23545;&#20110;&#22823;&#22810;&#25968;&#23398;&#29983;&#26469;&#35828;&#22826;&#20302;&#20102;&#12290;</title><link>http://arxiv.org/abs/2304.10636</link><description>&lt;p&gt;
&#25945;&#24072;&#20316;&#20986;&#23398;&#26657;&#20998;&#29677;&#20915;&#31574;&#30340;&#36136;&#37327;&#30740;&#31350;&#8212;&#8212;&#20197;&#33655;&#20848;&#20026;&#20363;
&lt;/p&gt;
&lt;p&gt;
The quality of school track assignment decisions by teachers. (arXiv:2304.10636v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.10636
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#33655;&#20848;&#20013;&#23398;&#38454;&#27573;&#20998;&#29677;&#20915;&#31574;&#30340;&#36136;&#37327;&#65292;&#21457;&#29616;&#25945;&#24072;&#30340;&#21021;&#22987;&#20998;&#29677;&#20915;&#31574;&#23545;&#20110;&#22823;&#22810;&#25968;&#23398;&#29983;&#26469;&#35828;&#22826;&#20302;&#20102;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20351;&#29992;&#22238;&#24402;&#19981;&#36830;&#32493;&#35774;&#35745;&#30740;&#31350;&#20102;&#33655;&#20848;&#20013;&#23398;&#38454;&#27573;&#20998;&#29677;&#20915;&#31574;&#30340;&#36136;&#37327;&#12290;&#22312;&#23567;&#23398;&#20845;&#24180;&#32423;&#65292;&#23567;&#23398;&#25945;&#24072;&#23558;&#27599;&#20010;&#23398;&#29983;&#20998;&#37197;&#21040;&#20013;&#23398;&#38454;&#27573;&#30340;&#19968;&#20010;&#23398;&#20064;&#36712;&#36857;&#19978;&#12290;&#22914;&#26524;&#23398;&#29983;&#22312;&#23567;&#23398;&#25945;&#32946;&#30340;&#26631;&#20934;&#21270;&#32467;&#26463;&#27979;&#35797;&#20013;&#30340;&#24471;&#20998;&#39640;&#20110;&#29305;&#23450;&#30340;&#36712;&#36857;&#20998;&#25968;&#32447;&#65292;&#25945;&#24072;&#21487;&#20197;&#21521;&#19978;&#20462;&#25913;&#36825;&#20010;&#20998;&#37197;&#20915;&#31574;&#12290;&#36890;&#36807;&#27604;&#36739;&#36825;&#20123;&#20998;&#25968;&#32447;&#20004;&#20391;&#30340;&#23398;&#29983;&#65292;&#21457;&#29616;&#22312;&#22235;&#24180;&#21518;&#65292;&#26377;50-90&#65285;&#30340;&#23398;&#29983;&#8220;&#34987;&#22256;&#22312;&#36712;&#36857;&#20013;&#8221;&#65292;&#24847;&#21619;&#30528;&#20182;&#20204;&#21482;&#26377;&#22312;&#31532;&#19968;&#24180;&#23601;&#24320;&#22987;&#22312;&#39640;&#36712;&#36857;&#19978;&#30340;&#24773;&#20917;&#19979;&#65292;&#25165;&#33021;&#22312;&#22235;&#24180;&#21518;&#22312;&#39640;&#36712;&#36857;&#19978;&#12290;&#20854;&#20182;&#65288;&#23569;&#25968;&#65289;&#23398;&#29983;&#21017;&#8220;&#22987;&#32456;&#22788;&#20110;&#20302;&#27700;&#24179;&#8221;&#65292;&#26080;&#35770;&#20182;&#20204;&#26368;&#21021;&#20301;&#20110;&#21738;&#20010;&#27700;&#24179;&#65292;&#22235;&#24180;&#21518;&#37117;&#20250;&#19968;&#30452;&#22312;&#20302;&#27700;&#24179;&#19978;&#12290;&#36825;&#20123;&#27604;&#20363;&#36866;&#29992;&#20110;&#22312;&#31532;&#19968;&#24180;&#36890;&#36807;&#24471;&#20998;&#36229;&#36807;&#20998;&#25968;&#32447;&#32780;&#20174;&#20302;&#36712;&#36857;&#36716;&#21040;&#39640;&#36712;&#36857;&#30340;&#25509;&#36817;&#20998;&#25968;&#32447;&#30340;&#23398;&#29983;&#12290;&#22240;&#27492;&#65292;&#23545;&#20110;&#22823;&#22810;&#25968;&#36825;&#20123;&#23398;&#29983;&#26469;&#35828;&#65292;&#26368;&#21021;&#65288;&#26410;&#20462;&#25913;&#30340;&#65289;&#20998;&#29677;&#20915;&#31574;&#22826;&#20302;&#20102;&#12290;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;&#25945;&#24072;&#20316;&#20986;&#30340;&#20998;&#29677;&#20915;&#31574;&#36136;&#37327;&#20540;&#24471;&#20851;&#27880;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study the quality of secondary school track assignment decisions in the Netherlands, using a regression discontinuity design. In 6th grade, primary school teachers assign each student to a secondary school track. If a student scores above a track-specific cutoff on the standardized end-of-primary education test, the teacher can upwardly revise this assignment. By comparing students just left and right of these cutoffs, we find that between 50-90% of the students are "trapped in track": these students are on the high track after four years, only if they started on the high track in first year. The remaining (minority of) students are "always low": they are always on the low track after four years, independently of where they started. These proportions hold for students near the cutoffs that shift from the low to the high track in first year by scoring above the cutoff. Hence, for a majority of these students the initial (unrevised) track assignment decision is too low. The results re
&lt;/p&gt;</description></item></channel></rss>