<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;&#20855;&#26377;&#39640;&#26114;&#25104;&#26412;&#30340;&#36125;&#21494;&#26031;&#35828;&#26381;&#27169;&#22411;&#65292;&#30740;&#31350;&#23545;&#35937;&#26159;&#19968;&#20301;&#31169;&#20154;&#19988;&#37096;&#20998;&#20449;&#24687;&#30693;&#24773;&#30340;&#21457;&#36865;&#32773;&#22312;&#36827;&#34892;&#20844;&#20849;&#23454;&#39564;&#12290;&#30740;&#31350;&#21457;&#29616;&#23454;&#39564;&#20013;&#22909;&#28040;&#24687;&#21644;&#22351;&#28040;&#24687;&#30340;&#25104;&#26412;&#24046;&#24322;&#23545;&#22343;&#34913;&#32467;&#26524;&#20855;&#26377;&#37325;&#35201;&#24433;&#21709;&#65292;&#22351;&#28040;&#24687;&#25104;&#26412;&#39640;&#26102;&#65292;&#23384;&#22312;&#21807;&#19968;&#30340;&#20998;&#31163;&#22343;&#34913;&#65292;&#25509;&#25910;&#32773;&#21463;&#30410;&#20110;&#21457;&#36865;&#32773;&#30340;&#31169;&#26377;&#20449;&#24687;&#65307;&#32780;&#22909;&#28040;&#24687;&#25104;&#26412;&#39640;&#26102;&#65292;&#22343;&#34913;&#24773;&#20917;&#21487;&#33021;&#20986;&#29616;&#27719;&#38598;&#21644;&#37096;&#20998;&#27719;&#38598;&#22343;&#34913;&#65292;&#25509;&#25910;&#32773;&#21487;&#33021;&#20250;&#22240;&#20026;&#21457;&#36865;&#32773;&#31169;&#26377;&#20449;&#24687;&#32780;&#21463;&#21040;&#25439;&#23475;&#12290;</title><link>http://arxiv.org/abs/2401.14087</link><description>&lt;p&gt;
&#39640;&#26114;&#30340;&#35828;&#26381;&#25104;&#26412;&#19982;&#37096;&#20998;&#20449;&#24687;&#30340;&#21457;&#36865;&#32773;
&lt;/p&gt;
&lt;p&gt;
Costly Persuasion by a Partially Informed Sender. (arXiv:2401.14087v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.14087
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;&#20855;&#26377;&#39640;&#26114;&#25104;&#26412;&#30340;&#36125;&#21494;&#26031;&#35828;&#26381;&#27169;&#22411;&#65292;&#30740;&#31350;&#23545;&#35937;&#26159;&#19968;&#20301;&#31169;&#20154;&#19988;&#37096;&#20998;&#20449;&#24687;&#30693;&#24773;&#30340;&#21457;&#36865;&#32773;&#22312;&#36827;&#34892;&#20844;&#20849;&#23454;&#39564;&#12290;&#30740;&#31350;&#21457;&#29616;&#23454;&#39564;&#20013;&#22909;&#28040;&#24687;&#21644;&#22351;&#28040;&#24687;&#30340;&#25104;&#26412;&#24046;&#24322;&#23545;&#22343;&#34913;&#32467;&#26524;&#20855;&#26377;&#37325;&#35201;&#24433;&#21709;&#65292;&#22351;&#28040;&#24687;&#25104;&#26412;&#39640;&#26102;&#65292;&#23384;&#22312;&#21807;&#19968;&#30340;&#20998;&#31163;&#22343;&#34913;&#65292;&#25509;&#25910;&#32773;&#21463;&#30410;&#20110;&#21457;&#36865;&#32773;&#30340;&#31169;&#26377;&#20449;&#24687;&#65307;&#32780;&#22909;&#28040;&#24687;&#25104;&#26412;&#39640;&#26102;&#65292;&#22343;&#34913;&#24773;&#20917;&#21487;&#33021;&#20986;&#29616;&#27719;&#38598;&#21644;&#37096;&#20998;&#27719;&#38598;&#22343;&#34913;&#65292;&#25509;&#25910;&#32773;&#21487;&#33021;&#20250;&#22240;&#20026;&#21457;&#36865;&#32773;&#31169;&#26377;&#20449;&#24687;&#32780;&#21463;&#21040;&#25439;&#23475;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#30001;&#19968;&#20010;&#25317;&#26377;&#31169;&#26377;&#19988;&#37096;&#20998;&#20449;&#24687;&#30340;&#21457;&#36865;&#32773;&#36827;&#34892;&#30340;&#26114;&#36149;&#30340;&#36125;&#21494;&#26031;&#35828;&#26381;&#27169;&#22411;&#65292;&#35813;&#21457;&#36865;&#32773;&#36827;&#34892;&#20102;&#19968;&#20010;&#20844;&#20849;&#23454;&#39564;&#12290;&#23454;&#39564;&#30340;&#25104;&#26412;&#26159;&#21457;&#36865;&#32773;&#20449;&#24565;&#30340;&#21152;&#26435;&#23545;&#25968;&#20284;&#28982;&#27604;&#20989;&#25968;&#30340;&#26399;&#26395;&#20943;&#23569;&#12290;&#36825;&#20010;&#27169;&#22411;&#36890;&#36807;&#19968;&#20010;&#27779;&#23572;&#24503;&#30340;&#39034;&#24207;&#25277;&#26679;&#38382;&#39064;&#24471;&#21040;&#24494;&#22522;&#30784;&#65292;&#20854;&#20013;&#22909;&#28040;&#24687;&#21644;&#22351;&#28040;&#24687;&#30340;&#25104;&#26412;&#19981;&#21516;&#12290;&#25105;&#20204;&#20851;&#27880;&#28385;&#36275;D1&#20934;&#21017;&#30340;&#22343;&#34913;&#12290;&#22343;&#34913;&#32467;&#26524;&#21462;&#20915;&#20110;&#23454;&#39564;&#20013;&#33719;&#24471;&#22909;&#28040;&#24687;&#21644;&#22351;&#28040;&#24687;&#30340;&#30456;&#23545;&#25104;&#26412;&#12290;&#22914;&#26524;&#22351;&#28040;&#24687;&#30340;&#25104;&#26412;&#26356;&#39640;&#65292;&#21017;&#23384;&#22312;&#21807;&#19968;&#30340;&#20998;&#31163;&#22343;&#34913;&#65292;&#24182;&#19988;&#25509;&#25910;&#32773;&#26126;&#30830;&#21463;&#30410;&#20110;&#21457;&#36865;&#32773;&#30340;&#31169;&#26377;&#20449;&#24687;&#12290;&#22914;&#26524;&#22909;&#28040;&#24687;&#30340;&#25104;&#26412;&#26356;&#39640;&#65292;&#21017;&#21333;&#28857;&#20132;&#21449;&#29305;&#24615;&#19981;&#25104;&#31435;&#12290;&#21487;&#33021;&#23384;&#22312;&#27719;&#38598;&#21644;&#37096;&#20998;&#27719;&#38598;&#22343;&#34913;&#65292;&#22312;&#26576;&#20123;&#22343;&#34913;&#20013;&#65292;&#25509;&#25910;&#32773;&#20250;&#26126;&#30830;&#21463;&#21040;&#21457;&#36865;&#32773;&#31169;&#26377;&#20449;&#24687;&#30340;&#20260;&#23475;&#12290;
&lt;/p&gt;
&lt;p&gt;
I study a model of costly Bayesian persuasion by a privately and partially informed sender who conducts a public experiment. The cost of running an experiment is the expected reduction of a weighted log-likelihood ratio function of the sender's belief. This is microfounded by a Wald's sequential sampling problem where good news and bad news cost differently. I focus on equilibria that satisfy the D1 criterion. The equilibrium outcome depends on the relative costs of drawing good and bad news in the experiment. If bad news is more costly, there exists a unique separating equilibrium, and the receiver unambiguously benefits from the sender's private information. If good news is more costly, the single-crossing property fails. There may exist pooling and partial pooling equilibria, and in some equilibria, the receiver strictly suffers from sender private information.
&lt;/p&gt;</description></item><item><title>&#35813;&#30740;&#31350;&#25552;&#20379;&#20102;&#24102;&#26435;&#21147;&#30340;&#30830;&#23450;&#24615;&#20844;&#27491;&#26426;&#21046;&#65292;&#36890;&#36807;&#24341;&#20837;&#26435;&#37325;&#65292;&#25913;&#36827;&#20102;&#20197;&#21069;&#26080;&#26435;&#37325;&#35774;&#32622;&#19979;&#30340;&#36924;&#36817;&#27604;&#29575;&#65292;&#24182;&#23637;&#31034;&#20102;&#35813;&#26426;&#21046;&#21487;&#20197;&#36866;&#29992;&#20110;&#20844;&#27491;&#20998;&#37197;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2310.14991</link><description>&lt;p&gt;
&#24102;&#26435;&#21147;&#30340;&#30830;&#23450;&#24615;&#20844;&#27491;&#36873;&#25321;
&lt;/p&gt;
&lt;p&gt;
Deterministic Impartial Selection with Weights. (arXiv:2310.14991v1 [cs.GT])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.14991
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#25552;&#20379;&#20102;&#24102;&#26435;&#21147;&#30340;&#30830;&#23450;&#24615;&#20844;&#27491;&#26426;&#21046;&#65292;&#36890;&#36807;&#24341;&#20837;&#26435;&#37325;&#65292;&#25913;&#36827;&#20102;&#20197;&#21069;&#26080;&#26435;&#37325;&#35774;&#32622;&#19979;&#30340;&#36924;&#36817;&#27604;&#29575;&#65292;&#24182;&#23637;&#31034;&#20102;&#35813;&#26426;&#21046;&#21487;&#20197;&#36866;&#29992;&#20110;&#20844;&#27491;&#20998;&#37197;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#20844;&#27491;&#36873;&#25321;&#38382;&#39064;&#20013;&#65292;&#22522;&#20110;&#20195;&#29702;&#20154;&#25237;&#31080;&#36873;&#21462;&#19968;&#20010;&#22266;&#23450;&#22823;&#23567;&#20026;$k$&#30340;&#20195;&#29702;&#20154;&#23376;&#38598;&#12290;&#22914;&#26524;&#27809;&#26377;&#20195;&#29702;&#20154;&#21487;&#20197;&#36890;&#36807;&#25913;&#21464;&#33258;&#24049;&#30340;&#25237;&#31080;&#26469;&#24433;&#21709;&#33258;&#24049;&#34987;&#36873;&#25321;&#30340;&#26426;&#20250;&#65292;&#21017;&#36873;&#25321;&#26426;&#21046;&#26159;&#20844;&#27491;&#30340;&#12290;&#22914;&#26524;&#23545;&#20110;&#27599;&#20010;&#23454;&#20363;&#65292;&#25152;&#36873;&#23376;&#38598;&#25152;&#25509;&#25910;&#30340;&#31080;&#25968;&#19982;&#33719;&#24471;&#26368;&#39640;&#31080;&#25968;&#30340;&#22823;&#23567;&#20026;$k$&#30340;&#23376;&#38598;&#25152;&#25509;&#25910;&#30340;&#31080;&#25968;&#30340;&#27604;&#29575;&#33267;&#23569;&#20026;$\alpha$&#30340;&#19968;&#37096;&#20998;&#65292;&#21017;&#35813;&#26426;&#21046;&#26159;$\alpha$-&#26368;&#20248;&#30340;&#12290;&#25105;&#20204;&#22312;&#19968;&#20010;&#26356;&#19968;&#33324;&#30340;&#35774;&#32622;&#20013;&#30740;&#31350;&#20102;&#24102;&#26435;&#21147;&#30340;&#30830;&#23450;&#24615;&#20844;&#27491;&#26426;&#21046;&#65292;&#24182;&#25552;&#20379;&#20102;&#39318;&#20010;&#36924;&#36817;&#20445;&#35777;&#65292;&#22823;&#32422;&#20026;$1/\lceil 2n/k\rceil$&#12290;&#24403;&#35201;&#36873;&#25321;&#30340;&#20195;&#29702;&#20154;&#25968;&#37327;&#30456;&#23545;&#20110;&#24635;&#20195;&#29702;&#20154;&#25968;&#37327;&#36275;&#22815;&#22823;&#26102;&#65292;&#36825;&#27604;&#20197;&#21069;&#24050;&#30693;&#30340;&#26080;&#26435;&#37325;&#35774;&#32622;&#30340;&#36924;&#36817;&#27604;&#29575;$1/k$&#26377;&#25152;&#25913;&#36827;&#12290;&#25105;&#20204;&#36827;&#19968;&#27493;&#35777;&#26126;&#20102;&#25105;&#20204;&#30340;&#26426;&#21046;&#21487;&#20197;&#36866;&#24212;&#20844;&#27491;&#20998;&#37197;&#38382;&#39064;&#65292;&#21363;&#22312;&#20854;&#20013;&#26377;&#22810;&#20010;&#38598;&#21512;&#38656;&#35201;&#36873;&#20986;&#20195;&#29702;&#20154;&#12290;
&lt;/p&gt;
&lt;p&gt;
In the impartial selection problem, a subset of agents up to a fixed size $k$ among a group of $n$ is to be chosen based on votes cast by the agents themselves. A selection mechanism is impartial if no agent can influence its own chance of being selected by changing its vote. It is $\alpha$-optimal if, for every instance, the ratio between the votes received by the selected subset is at least a fraction of $\alpha$ of the votes received by the subset of size $k$ with the highest number of votes. We study deterministic impartial mechanisms in a more general setting with arbitrarily weighted votes and provide the first approximation guarantee, roughly $1/\lceil 2n/k\rceil$. When the number of agents to select is large enough compared to the total number of agents, this yields an improvement on the previously best known approximation ratio of $1/k$ for the unweighted setting. We further show that our mechanism can be adapted to the impartial assignment problem, in which multiple sets of u
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#36890;&#32960;&#20851;&#27880;&#24230;&#19982;&#36890;&#32960;&#28608;&#22686;&#20043;&#38388;&#30340;&#20851;&#31995;&#65292;&#21457;&#29616;&#22312;&#36890;&#32960;&#29575;&#20302;&#31283;&#23450;&#26102;&#65292;&#20154;&#20204;&#20851;&#27880;&#24230;&#36739;&#20302;&#65292;&#20294;&#19968;&#26086;&#36890;&#32960;&#29575;&#36229;&#36807;4%&#65292;&#20851;&#27880;&#24230;&#20250;&#26126;&#26174;&#22686;&#21152;&#65292;&#39640;&#20851;&#27880;&#21306;&#22495;&#30340;&#20851;&#27880;&#24230;&#26159;&#20302;&#20851;&#27880;&#21306;&#22495;&#30340;&#20004;&#20493;&#12290;&#36825;&#31181;&#20851;&#27880;&#38408;&#20540;&#30340;&#23384;&#22312;&#23548;&#33268;&#20102;&#29366;&#24577;&#20381;&#36182;&#25928;&#24212;&#65292;&#21363;&#22312;&#23485;&#26494;&#36135;&#24065;&#25919;&#31574;&#26102;&#65292;&#25104;&#26412;&#25512;&#21160;&#20914;&#20987;&#23545;&#36890;&#32960;&#30340;&#24433;&#21709;&#26356;&#22823;&#12290;&#36825;&#20123;&#32467;&#35770;&#26377;&#21161;&#20110;&#29702;&#35299;&#26368;&#36817;&#32654;&#22269;&#30340;&#36890;&#32960;&#28608;&#22686;&#29616;&#35937;&#12290;</title><link>http://arxiv.org/abs/2308.09480</link><description>&lt;p&gt;
&#36890;&#32960;&#20851;&#27880;&#38408;&#20540;&#19982;&#36890;&#32960;&#28608;&#22686;
&lt;/p&gt;
&lt;p&gt;
The Inflation Attention Threshold and Inflation Surges. (arXiv:2308.09480v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.09480
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#36890;&#32960;&#20851;&#27880;&#24230;&#19982;&#36890;&#32960;&#28608;&#22686;&#20043;&#38388;&#30340;&#20851;&#31995;&#65292;&#21457;&#29616;&#22312;&#36890;&#32960;&#29575;&#20302;&#31283;&#23450;&#26102;&#65292;&#20154;&#20204;&#20851;&#27880;&#24230;&#36739;&#20302;&#65292;&#20294;&#19968;&#26086;&#36890;&#32960;&#29575;&#36229;&#36807;4%&#65292;&#20851;&#27880;&#24230;&#20250;&#26126;&#26174;&#22686;&#21152;&#65292;&#39640;&#20851;&#27880;&#21306;&#22495;&#30340;&#20851;&#27880;&#24230;&#26159;&#20302;&#20851;&#27880;&#21306;&#22495;&#30340;&#20004;&#20493;&#12290;&#36825;&#31181;&#20851;&#27880;&#38408;&#20540;&#30340;&#23384;&#22312;&#23548;&#33268;&#20102;&#29366;&#24577;&#20381;&#36182;&#25928;&#24212;&#65292;&#21363;&#22312;&#23485;&#26494;&#36135;&#24065;&#25919;&#31574;&#26102;&#65292;&#25104;&#26412;&#25512;&#21160;&#20914;&#20987;&#23545;&#36890;&#32960;&#30340;&#24433;&#21709;&#26356;&#22823;&#12290;&#36825;&#20123;&#32467;&#35770;&#26377;&#21161;&#20110;&#29702;&#35299;&#26368;&#36817;&#32654;&#22269;&#30340;&#36890;&#32960;&#28608;&#22686;&#29616;&#35937;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#26368;&#36817;&#36890;&#32960;&#28608;&#22686;&#29190;&#21457;&#26102;&#65292;&#20844;&#20247;&#23545;&#36890;&#32960;&#30340;&#20851;&#27880;&#24230;&#24456;&#20302;&#65292;&#20294;&#19968;&#26086;&#36890;&#32960;&#24320;&#22987;&#19978;&#21319;&#65292;&#20851;&#27880;&#24230;&#36805;&#36895;&#22686;&#21152;&#12290;&#26412;&#25991;&#26500;&#24314;&#20102;&#19968;&#20010;&#19968;&#33324;&#22343;&#34913;&#36135;&#24065;&#27169;&#22411;&#65292;&#35813;&#27169;&#22411;&#22312;&#36890;&#32960;&#20302;&#32780;&#31283;&#23450;&#26102;&#65292;&#26368;&#20248;&#21270;&#30340;&#31574;&#30053;&#26159;&#23545;&#36890;&#32960;&#20851;&#27880;&#36739;&#23569;&#65292;&#20294;&#19968;&#26086;&#36890;&#32960;&#36229;&#36807;&#26576;&#20010;&#38408;&#20540;&#65292;&#23601;&#20250;&#22686;&#21152;&#20851;&#27880;&#24230;&#12290;&#21033;&#29992;&#35843;&#26597;&#38382;&#21367;&#20013;&#30340;&#36890;&#32960;&#39044;&#26399;&#65292;&#25105;&#20272;&#35745;&#20851;&#27880;&#38408;&#20540;&#22312;4%&#36890;&#32960;&#29575;&#65292;&#39640;&#20851;&#27880;&#21306;&#22495;&#30340;&#20851;&#27880;&#24230;&#26159;&#20302;&#20851;&#27880;&#21306;&#22495;&#30340;&#20004;&#20493;&#12290;&#24403;&#26657;&#20934;&#21040;&#36825;&#20123;&#21457;&#29616;&#26102;&#65292;&#35813;&#27169;&#22411;&#20135;&#29983;&#19982;&#32654;&#22269;&#26368;&#36817;&#36890;&#32960;&#28608;&#22686;&#19968;&#33268;&#30340;&#36890;&#32960;&#21644;&#36890;&#32960;&#39044;&#26399;&#21160;&#24577;&#12290;&#20851;&#27880;&#38408;&#20540;&#23548;&#33268;&#29366;&#24577;&#20381;&#36182;&#24615;&#65306;&#25104;&#26412;&#25512;&#21160;&#20914;&#20987;&#22312;&#36135;&#24065;&#23485;&#26494;&#25919;&#31574;&#26102;&#26356;&#21152;&#36890;&#32960;&#12290;&#36825;&#20123;&#29366;&#24577;&#20381;&#36182;&#24615;&#25928;&#24212;&#22312;&#24658;&#23450;&#20851;&#27880;&#25110;&#29702;&#24615;&#39044;&#26399;&#27169;&#22411;&#20013;&#26159;&#19981;&#23384;&#22312;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
At the outbreak of the recent inflation surge, the public's attention to inflation was low but increased rapidly once inflation started to rise. In this paper, I develop a general equilibrium monetary model where it is optimal for agents to pay little attention to inflation when inflation is low and stable, but in which they increase their attention once inflation exceeds a certain threshold. Using survey inflation expectations, I estimate the attention threshold to be at an inflation rate of 4%, with attention in the high-attention regime being twice as high as in the low-attention regime. When calibrated to match these findings, the model generates inflation and inflation expectation dynamics consistent with the recent inflation surge in the US. The attention threshold induces a state dependency: cost-push shocks become more inflationary in times of loose monetary policy. These state-dependent effects are absent in the model with constant attention or under rational expectations. Fol
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#20010;&#20855;&#26377;&#22810;&#20010;&#20248;&#20808;&#32423;&#30340;&#23398;&#26657;&#36873;&#25321;&#27169;&#22411;&#65292;&#24341;&#20837;&#20102;&#19968;&#31181;&#21517;&#20026;M-fairness&#30340;&#20844;&#24179;&#24615;&#27010;&#24565;&#65292;&#24182;&#20171;&#32461;&#20102;&#19968;&#31181;&#21033;&#29992;&#25928;&#29575;&#35843;&#25972;&#24310;&#36831;&#25509;&#21463;&#31639;&#27861;&#30340;&#26426;&#21046;&#65292;&#35813;&#26426;&#21046;&#26159;&#23398;&#29983;&#26368;&#20248;M&#31283;&#23450;&#30340;&#65292;&#25913;&#36827;&#32676;&#20307;&#26368;&#20248;M&#31283;&#23450;&#30340;&#65292;&#24182;&#19988;&#23545;&#25913;&#36827;&#26159;&#26377;&#21709;&#24212;&#30340;&#12290;</title><link>http://arxiv.org/abs/2308.04780</link><description>&lt;p&gt;
&#20855;&#26377;&#22810;&#20010;&#20248;&#20808;&#32423;&#30340;&#23398;&#26657;&#36873;&#25321;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
School Choice with Multiple Priorities. (arXiv:2308.04780v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.04780
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#20010;&#20855;&#26377;&#22810;&#20010;&#20248;&#20808;&#32423;&#30340;&#23398;&#26657;&#36873;&#25321;&#27169;&#22411;&#65292;&#24341;&#20837;&#20102;&#19968;&#31181;&#21517;&#20026;M-fairness&#30340;&#20844;&#24179;&#24615;&#27010;&#24565;&#65292;&#24182;&#20171;&#32461;&#20102;&#19968;&#31181;&#21033;&#29992;&#25928;&#29575;&#35843;&#25972;&#24310;&#36831;&#25509;&#21463;&#31639;&#27861;&#30340;&#26426;&#21046;&#65292;&#35813;&#26426;&#21046;&#26159;&#23398;&#29983;&#26368;&#20248;M&#31283;&#23450;&#30340;&#65292;&#25913;&#36827;&#32676;&#20307;&#26368;&#20248;M&#31283;&#23450;&#30340;&#65292;&#24182;&#19988;&#23545;&#25913;&#36827;&#26159;&#26377;&#21709;&#24212;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#32771;&#34385;&#20102;&#19968;&#31181;&#27169;&#22411;&#65292;&#22312;&#36825;&#31181;&#27169;&#22411;&#20013;&#65292;&#23398;&#26657;&#21487;&#33021;&#23545;&#23398;&#29983;&#26377;&#22810;&#20010;&#20248;&#20808;&#32423;&#39034;&#24207;&#65292;&#36825;&#20123;&#39034;&#24207;&#21487;&#33021;&#30456;&#20114;&#30683;&#30462;&#12290;&#20363;&#22914;&#65292;&#22312;&#23398;&#26657;&#36873;&#25321;&#31995;&#32479;&#20013;&#65292;&#30001;&#20110;&#20804;&#24351;&#22992;&#22969;&#20248;&#20808;&#32423;&#21644;&#27493;&#34892;&#21306;&#22495;&#20248;&#20808;&#32423;&#24182;&#23384;&#65292;&#22522;&#20110;&#23427;&#20204;&#30340;&#20248;&#20808;&#32423;&#39034;&#24207;&#21487;&#33021;&#23384;&#22312;&#20914;&#31361;&#12290;&#22312;&#36825;&#31181;&#24773;&#20917;&#19979;&#65292;&#21487;&#33021;&#25214;&#19981;&#21040;&#28385;&#36275;&#25152;&#26377;&#20248;&#20808;&#32423;&#39034;&#24207;&#30340;&#21305;&#37197;&#12290;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#31181;&#21517;&#20026;M-fairness&#30340;&#26032;&#39062;&#20844;&#24179;&#24615;&#27010;&#24565;&#26469;&#30740;&#31350;&#36825;&#26679;&#30340;&#24066;&#22330;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#37325;&#28857;&#30740;&#31350;&#20102;&#19968;&#31181;&#26356;&#20855;&#20307;&#30340;&#24773;&#20917;&#65292;&#21363;&#25152;&#26377;&#23398;&#26657;&#37117;&#26377;&#20004;&#20010;&#20248;&#20808;&#32423;&#39034;&#24207;&#65292;&#24182;&#19988;&#23545;&#20110;&#26576;&#20010;&#23398;&#29983;&#32676;&#20307;&#65292;&#27599;&#25152;&#23398;&#26657;&#30340;&#19968;&#20010;&#20248;&#20808;&#32423;&#39034;&#24207;&#26159;&#21478;&#19968;&#20248;&#20808;&#32423;&#39034;&#24207;&#30340;&#25913;&#36827;&#12290;&#19968;&#20010;&#35828;&#26126;&#24615;&#20363;&#23376;&#26159;&#20855;&#26377;&#22522;&#20110;&#20248;&#20808;&#32423;&#30340;&#31215;&#26497;&#34892;&#21160;&#25919;&#31574;&#30340;&#23398;&#26657;&#36873;&#25321;&#21305;&#37197;&#24066;&#22330;&#12290;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#31181;&#21033;&#29992;&#25928;&#29575;&#35843;&#25972;&#24310;&#36831;&#25509;&#21463;&#31639;&#27861;&#30340;&#26426;&#21046;&#65292;&#24182;&#35777;&#26126;&#35813;&#26426;&#21046;&#26159;&#23398;&#29983;&#26368;&#20248;M&#31283;&#23450;&#30340;&#65292;&#25913;&#36827;&#32676;&#20307;&#26368;&#20248;M&#31283;&#23450;&#30340;&#65292;&#24182;&#19988;&#23545;&#25913;&#36827;&#26159;&#26377;&#21709;&#24212;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
This study considers a model where schools may have multiple priority orders on students, which may be inconsistent with each other. For example, in school choice systems, since the sibling priority and the walk zone priority coexist, the priority orders based on them would be conflicting. In that case, there may be no matching that respect to all priority orders. We introduce a novel fairness notion called M-fairness to examine such markets. Further, we focus on a more specific situation where all schools have two priority orders, and for a certain group of students, a priority order of each school is an improvement of the other priority order of the school. An illustrative example is the school choice matching market with a priority-based affirmative action policy. We introduce a mechanism that utilizes the efficiency adjusted deferred acceptance algorithm and show that the mechanism is student optimally M-stable, improved-group optimally M-stable and responsive to improvements.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#33258;&#36866;&#24212;&#20027;&#25104;&#20998;&#22238;&#24402;&#26041;&#27861;&#65292;&#24182;&#22312;&#38754;&#26495;&#25968;&#25454;&#20013;&#30340;&#24212;&#29992;&#20013;&#33719;&#24471;&#20102;&#22343;&#21248;&#26377;&#38480;&#26679;&#26412;&#20445;&#35777;&#12290;&#35813;&#26041;&#27861;&#21487;&#20197;&#29992;&#20110;&#38754;&#26495;&#25968;&#25454;&#20013;&#30340;&#23454;&#39564;&#35774;&#35745;&#65292;&#29305;&#21035;&#26159;&#24403;&#24178;&#39044;&#26041;&#26696;&#26159;&#33258;&#36866;&#24212;&#20998;&#37197;&#30340;&#24773;&#20917;&#12290;</title><link>http://arxiv.org/abs/2307.01357</link><description>&lt;p&gt;
&#33258;&#36866;&#24212;&#20027;&#25104;&#20998;&#22238;&#24402;&#22312;&#38754;&#26495;&#25968;&#25454;&#20013;&#30340;&#24212;&#29992;
&lt;/p&gt;
&lt;p&gt;
Adaptive Principal Component Regression with Applications to Panel Data. (arXiv:2307.01357v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.01357
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#33258;&#36866;&#24212;&#20027;&#25104;&#20998;&#22238;&#24402;&#26041;&#27861;&#65292;&#24182;&#22312;&#38754;&#26495;&#25968;&#25454;&#20013;&#30340;&#24212;&#29992;&#20013;&#33719;&#24471;&#20102;&#22343;&#21248;&#26377;&#38480;&#26679;&#26412;&#20445;&#35777;&#12290;&#35813;&#26041;&#27861;&#21487;&#20197;&#29992;&#20110;&#38754;&#26495;&#25968;&#25454;&#20013;&#30340;&#23454;&#39564;&#35774;&#35745;&#65292;&#29305;&#21035;&#26159;&#24403;&#24178;&#39044;&#26041;&#26696;&#26159;&#33258;&#36866;&#24212;&#20998;&#37197;&#30340;&#24773;&#20917;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20027;&#25104;&#20998;&#22238;&#24402;(PCR)&#26159;&#19968;&#31181;&#27969;&#34892;&#30340;&#22266;&#23450;&#35774;&#35745;&#35823;&#24046;&#21464;&#37327;&#22238;&#24402;&#25216;&#26415;&#65292;&#23427;&#26159;&#32447;&#24615;&#22238;&#24402;&#30340;&#25512;&#24191;&#65292;&#35266;&#27979;&#30340;&#21327;&#21464;&#37327;&#21463;&#21040;&#38543;&#26426;&#22122;&#22768;&#30340;&#27745;&#26579;&#12290;&#25105;&#20204;&#22312;&#25968;&#25454;&#25910;&#38598;&#26102;&#25552;&#20379;&#20102;&#22312;&#32447;&#65288;&#27491;&#21017;&#21270;&#65289;PCR&#30340;&#31532;&#19968;&#27425;&#22343;&#21248;&#26377;&#38480;&#26679;&#26412;&#20445;&#35777;&#12290;&#30001;&#20110;&#20998;&#26512;&#22266;&#23450;&#35774;&#35745;&#20013;PCR&#30340;&#35777;&#26126;&#25216;&#26415;&#26080;&#27861;&#24456;&#23481;&#26131;&#22320;&#25193;&#23637;&#21040;&#22312;&#32447;&#35774;&#32622;&#65292;&#25105;&#20204;&#30340;&#32467;&#26524;&#20381;&#36182;&#20110;&#23558;&#29616;&#20195;&#38789;&#27987;&#24230;&#30340;&#24037;&#20855;&#36866;&#24212;&#21040;&#35823;&#24046;&#21464;&#37327;&#35774;&#32622;&#20013;&#12290;&#20316;&#20026;&#25105;&#20204;&#30028;&#38480;&#30340;&#24212;&#29992;&#65292;&#25105;&#20204;&#22312;&#38754;&#26495;&#25968;&#25454;&#35774;&#32622;&#20013;&#25552;&#20379;&#20102;&#23454;&#39564;&#35774;&#35745;&#26694;&#26550;&#65292;&#24403;&#24178;&#39044;&#34987;&#33258;&#36866;&#24212;&#22320;&#20998;&#37197;&#26102;&#12290;&#25105;&#20204;&#30340;&#26694;&#26550;&#21487;&#20197;&#34987;&#35748;&#20026;&#26159;&#21512;&#25104;&#25511;&#21046;&#21644;&#21512;&#25104;&#24178;&#39044;&#26694;&#26550;&#30340;&#27867;&#21270;&#65292;&#20854;&#20013;&#25968;&#25454;&#26159;&#36890;&#36807;&#33258;&#36866;&#24212;&#24178;&#39044;&#20998;&#37197;&#31574;&#30053;&#25910;&#38598;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
Principal component regression (PCR) is a popular technique for fixed-design error-in-variables regression, a generalization of the linear regression setting in which the observed covariates are corrupted with random noise. We provide the first time-uniform finite sample guarantees for online (regularized) PCR whenever data is collected adaptively. Since the proof techniques for analyzing PCR in the fixed design setting do not readily extend to the online setting, our results rely on adapting tools from modern martingale concentration to the error-in-variables setting. As an application of our bounds, we provide a framework for experiment design in panel data settings when interventions are assigned adaptively. Our framework may be thought of as a generalization of the synthetic control and synthetic interventions frameworks, where data is collected via an adaptive intervention assignment policy.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#21305;&#37197;&#23545;&#31751;&#38543;&#26426;&#35797;&#39564;&#20013;&#36827;&#34892;&#32479;&#35745;&#25512;&#26029;&#30340;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#21152;&#26435;&#22343;&#20540;&#24046;&#20272;&#35745;&#37327;&#21644;&#26041;&#24046;&#20272;&#35745;&#37327;&#65292;&#24314;&#31435;&#20102;&#22522;&#20110;&#36825;&#20123;&#20272;&#35745;&#37327;&#30340;&#28176;&#36817;&#31934;&#30830;&#24615;&#65292;&#24182;&#25506;&#35752;&#20102;&#24120;&#29992;&#30340;&#20004;&#31181;&#27979;&#35797;&#31243;&#24207;&#30340;&#29305;&#24615;&#12290;</title><link>http://arxiv.org/abs/2211.14903</link><description>&lt;p&gt;
&#21305;&#37197;&#23545;&#31751;&#38543;&#26426;&#35797;&#39564;&#20013;&#30340;&#25512;&#26029;
&lt;/p&gt;
&lt;p&gt;
Inference in Cluster Randomized Trials with Matched Pairs. (arXiv:2211.14903v2 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2211.14903
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#21305;&#37197;&#23545;&#31751;&#38543;&#26426;&#35797;&#39564;&#20013;&#36827;&#34892;&#32479;&#35745;&#25512;&#26029;&#30340;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#21152;&#26435;&#22343;&#20540;&#24046;&#20272;&#35745;&#37327;&#21644;&#26041;&#24046;&#20272;&#35745;&#37327;&#65292;&#24314;&#31435;&#20102;&#22522;&#20110;&#36825;&#20123;&#20272;&#35745;&#37327;&#30340;&#28176;&#36817;&#31934;&#30830;&#24615;&#65292;&#24182;&#25506;&#35752;&#20102;&#24120;&#29992;&#30340;&#20004;&#31181;&#27979;&#35797;&#31243;&#24207;&#30340;&#29305;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#21305;&#37197;&#23545;&#31751;&#38543;&#26426;&#35797;&#39564;&#20013;&#36827;&#34892;&#25512;&#26029;&#30340;&#38382;&#39064;&#12290;&#21305;&#37197;&#23545;&#35774;&#35745;&#24847;&#21619;&#30528;&#26681;&#25454;&#22522;&#32447;&#31751;&#32423;&#21327;&#21464;&#37327;&#23545;&#19968;&#32452;&#31751;&#36827;&#34892;&#21305;&#37197;&#65292;&#28982;&#21518;&#22312;&#27599;&#23545;&#31751;&#20013;&#38543;&#26426;&#36873;&#25321;&#19968;&#20010;&#31751;&#36827;&#34892;&#22788;&#29702;&#12290;&#25105;&#20204;&#30740;&#31350;&#20102;&#21152;&#26435;&#22343;&#20540;&#24046;&#20272;&#35745;&#37327;&#30340;&#22823;&#26679;&#26412;&#34892;&#20026;&#65292;&#24182;&#26681;&#25454;&#21305;&#37197;&#36807;&#31243;&#26159;&#21542;&#21305;&#37197;&#31751;&#22823;&#23567;&#65292;&#23548;&#20986;&#20102;&#20004;&#32452;&#19981;&#21516;&#30340;&#32467;&#26524;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#26041;&#24046;&#20272;&#35745;&#37327;&#65292;&#26080;&#35770;&#21305;&#37197;&#36807;&#31243;&#26159;&#21305;&#37197;&#31751;&#22823;&#23567;&#36824;&#26159;&#19981;&#21305;&#37197;&#31751;&#22823;&#23567;&#65292;&#37117;&#26159;&#19968;&#33268;&#30340;&#12290;&#32467;&#21512;&#36825;&#20123;&#32467;&#26524;&#65292;&#24314;&#31435;&#20102;&#22522;&#20110;&#36825;&#20123;&#20272;&#35745;&#37327;&#30340;&#26816;&#39564;&#30340;&#28176;&#36817;&#31934;&#30830;&#24615;&#12290;&#25509;&#19979;&#26469;&#65292;&#25105;&#20204;&#32771;&#34385;&#20102;&#22522;&#20110;&#32447;&#24615;&#22238;&#24402;&#26500;&#36896;&#30340;$t$&#27979;&#35797;&#30340;&#20004;&#31181;&#24120;&#35265;&#27979;&#35797;&#31243;&#24207;&#30340;&#29305;&#24615;&#65292;&#24182;&#22768;&#31216;&#36825;&#20004;&#31181;&#31243;&#24207;&#36890;&#24120;&#26159;&#20445;&#23432;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper considers the problem of inference in cluster randomized trials where treatment status is determined according to a "matched pairs'' design. Here, by a cluster randomized experiment, we mean one in which treatment is assigned at the level of the cluster; by a "matched pairs'' design we mean that a sample of clusters is paired according to baseline, cluster-level covariates and, within each pair, one cluster is selected at random for treatment. We study the large sample behavior of a weighted difference-in-means estimator and derive two distinct sets of results depending on if the matching procedure does or does not match on cluster size. We then propose a variance estimator which is consistent in either case. Combining these results establishes the asymptotic exactness of tests based on these estimators. Next, we consider the properties of two common testing procedures based on $t$-tests constructed from linear regressions, and argue that both are generally conservative in o
&lt;/p&gt;</description></item></channel></rss>