<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#20110;&#23450;&#37327;&#31354;&#38388;&#27169;&#22411;&#20013;&#22788;&#29702;&#21453;&#20107;&#23454;&#19981;&#30830;&#23450;&#24615;&#30340;&#26041;&#27861;&#65292;&#21033;&#29992;&#32463;&#39564;&#36125;&#21494;&#26031;&#26041;&#27861;&#37327;&#21270;&#19981;&#30830;&#23450;&#24615;&#65292;&#24182;&#22312;&#20004;&#20010;&#24212;&#29992;&#31243;&#24207;&#20013;&#21457;&#29616;&#20102;&#26377;&#20851;&#21453;&#20107;&#23454;&#30340;&#38750;&#24179;&#20961;&#19981;&#30830;&#23450;&#24615;&#12290;</title><link>https://arxiv.org/abs/2311.14032</link><description>&lt;p&gt;
&#23450;&#37327;&#31354;&#38388;&#27169;&#22411;&#20013;&#30340;&#21453;&#20107;&#23454;&#25935;&#24863;&#24615;
&lt;/p&gt;
&lt;p&gt;
Counterfactual Sensitivity in Quantitative Spatial Models
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2311.14032
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#20110;&#23450;&#37327;&#31354;&#38388;&#27169;&#22411;&#20013;&#22788;&#29702;&#21453;&#20107;&#23454;&#19981;&#30830;&#23450;&#24615;&#30340;&#26041;&#27861;&#65292;&#21033;&#29992;&#32463;&#39564;&#36125;&#21494;&#26031;&#26041;&#27861;&#37327;&#21270;&#19981;&#30830;&#23450;&#24615;&#65292;&#24182;&#22312;&#20004;&#20010;&#24212;&#29992;&#31243;&#24207;&#20013;&#21457;&#29616;&#20102;&#26377;&#20851;&#21453;&#20107;&#23454;&#30340;&#38750;&#24179;&#20961;&#19981;&#30830;&#23450;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#23450;&#37327;&#31354;&#38388;&#27169;&#22411;&#20013;&#30340;&#21453;&#20107;&#23454;&#26159;&#24403;&#21069;&#19990;&#30028;&#29366;&#24577;&#21644;&#27169;&#22411;&#21442;&#25968;&#30340;&#20989;&#25968;&#12290;&#24403;&#21069;&#20570;&#27861;&#23558;&#24403;&#21069;&#19990;&#30028;&#29366;&#24577;&#35270;&#20026;&#23436;&#20840;&#21487;&#35266;&#27979;&#65292;&#20294;&#25105;&#20204;&#26377;&#20805;&#20998;&#29702;&#30001;&#30456;&#20449;&#23384;&#22312;&#27979;&#37327;&#35823;&#24046;&#12290;&#26412;&#25991;&#25552;&#20379;&#20102;&#19968;&#31181;&#24037;&#20855;&#65292;&#29992;&#20110;&#22312;&#24403;&#21069;&#19990;&#30028;&#29366;&#24577;&#23384;&#22312;&#27979;&#37327;&#35823;&#24046;&#26102;&#37327;&#21270;&#20851;&#20110;&#21453;&#20107;&#23454;&#30340;&#19981;&#30830;&#23450;&#24615;&#12290;&#25105;&#25512;&#33616;&#19968;&#31181;&#32463;&#39564;&#36125;&#21494;&#26031;&#26041;&#27861;&#29992;&#20110;&#19981;&#30830;&#23450;&#24615;&#37327;&#21270;&#65292;&#36825;&#26082;&#23454;&#29992;&#21448;&#22312;&#29702;&#35770;&#19978;&#34987;&#35777;&#26126;&#20102;&#12290;&#25105;&#23558;&#25152;&#25552;&#20986;&#30340;&#26041;&#27861;&#24212;&#29992;&#20110;Adao, Costinot&#21644;Donaldson (2017)&#20197;&#21450;Allen&#21644;Arkolakis (2022)&#30340;&#24212;&#29992;&#20013;&#65292;&#24182;&#21457;&#29616;&#26377;&#20851;&#21453;&#20107;&#23454;&#30340;&#38750;&#24179;&#20961;&#19981;&#30830;&#23450;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2311.14032v2 Announce Type: replace  Abstract: Counterfactuals in quantitative spatial models are functions of the current state of the world and the model parameters. Current practice treats the current state of the world as perfectly observed, but there is good reason to believe that it is measured with error. This paper provides tools for quantifying uncertainty about counterfactuals when the current state of the world is measured with error. I recommend an empirical Bayes approach to uncertainty quantification, which is both practical and theoretically justified. I apply the proposed method to the applications in Adao, Costinot, and Donaldson (2017) and Allen and Arkolakis (2022) and find non-trivial uncertainty about counterfactuals.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#22810;&#26234;&#33021;&#20307;&#28145;&#24230;&#24378;&#21270;&#23398;&#20064;&#30340;&#26041;&#27861;&#65292;&#24212;&#29992;&#20110;&#24555;&#36895;&#20805;&#30005;&#30005;&#21160;&#36710;&#20013;&#24515;&#30340;&#21160;&#24577;&#23450;&#20215;&#31454;&#20105;&#12290;&#36890;&#36807;&#39044;&#27979;&#24615;&#36141;&#20080;&#30005;&#21147;&#38656;&#27714;&#21644;&#35774;&#23450;&#31454;&#20105;&#24615;&#20215;&#26684;&#31574;&#30053;&#65292;&#20805;&#30005;&#31449;&#21487;&#20197;&#22312;&#31454;&#20105;&#20013;&#36827;&#34892;&#26377;&#25928;&#23450;&#20215;&#12290;</title><link>http://arxiv.org/abs/2401.15108</link><description>&lt;p&gt;
&#22810;&#26234;&#33021;&#20307;&#28145;&#24230;&#24378;&#21270;&#23398;&#20064;&#22312;&#31454;&#20105;&#20013;&#20026;&#24555;&#36895;&#20805;&#30005;&#30005;&#21160;&#36710;&#20013;&#24515;&#30340;&#21160;&#24577;&#23450;&#20215;&#20013;&#30340;&#24212;&#29992;
&lt;/p&gt;
&lt;p&gt;
Multi-agent Deep Reinforcement Learning for Dynamic Pricing by Fast-charging Electric Vehicle Hubs in ccompetition. (arXiv:2401.15108v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.15108
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#22810;&#26234;&#33021;&#20307;&#28145;&#24230;&#24378;&#21270;&#23398;&#20064;&#30340;&#26041;&#27861;&#65292;&#24212;&#29992;&#20110;&#24555;&#36895;&#20805;&#30005;&#30005;&#21160;&#36710;&#20013;&#24515;&#30340;&#21160;&#24577;&#23450;&#20215;&#31454;&#20105;&#12290;&#36890;&#36807;&#39044;&#27979;&#24615;&#36141;&#20080;&#30005;&#21147;&#38656;&#27714;&#21644;&#35774;&#23450;&#31454;&#20105;&#24615;&#20215;&#26684;&#31574;&#30053;&#65292;&#20805;&#30005;&#31449;&#21487;&#20197;&#22312;&#31454;&#20105;&#20013;&#36827;&#34892;&#26377;&#25928;&#23450;&#20215;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24555;&#36895;&#20805;&#30005;&#31449;&#23558;&#25104;&#20026;&#20840;&#29699;&#26032;&#24314;&#20132;&#36890;&#30005;&#27668;&#21270;&#22522;&#30784;&#35774;&#26045;&#30340;&#19968;&#37096;&#20998;&#12290;&#36825;&#20123;&#20805;&#30005;&#31449;&#23558;&#25215;&#36733;&#35768;&#22810;&#30452;&#27969;&#24555;&#36895;&#20805;&#30005;&#35774;&#22791;&#65292;&#20165;&#21487;&#20379;&#30005;&#21160;&#36710;&#36742;&#20805;&#30005;&#20351;&#29992;&#12290;&#31867;&#20284;&#20110;&#27773;&#27833;&#21152;&#27833;&#31449;&#65292;&#21516;&#19968;&#22320;&#21306;&#30340;&#24555;&#36895;&#20805;&#30005;&#31449;&#23558;&#26681;&#25454;&#31454;&#20105;&#35843;&#25972;&#20215;&#26684;&#20197;&#21560;&#24341;&#21516;&#19968;&#32676;&#30005;&#21160;&#36710;&#20027;&#12290;&#36825;&#20123;&#20805;&#30005;&#31449;&#23558;&#19982;&#30005;&#21147;&#32593;&#32476;&#36827;&#34892;&#20132;&#20114;&#65292;&#36890;&#36807;&#39044;&#27979;&#24615;&#36141;&#20080;&#22312;&#21069;&#19968;&#22825;&#30005;&#21147;&#24066;&#22330;&#19978;&#30340;&#30005;&#21147;&#38656;&#27714;&#65292;&#24182;&#22312;&#23454;&#26102;&#24066;&#22330;&#19978;&#28385;&#36275;&#24046;&#39069;&#38656;&#27714;&#12290;&#20805;&#30005;&#31449;&#21487;&#33021;&#37197;&#22791;&#34917;&#20805;&#30005;&#27744;&#20648;&#33021;&#31995;&#32479;&#29992;&#20110;&#22871;&#21033;&#12290;&#26412;&#25991;&#38024;&#23545;&#20805;&#30005;&#31449;&#31454;&#20105;&#20013;&#24320;&#21457;&#20102;&#19968;&#20010;&#20004;&#27493;&#25968;&#25454;&#39537;&#21160;&#30340;&#21160;&#24577;&#23450;&#20215;&#26041;&#27861;&#12290;&#39318;&#20808;&#36890;&#36807;&#27714;&#35299;&#38543;&#26426;&#30340;&#21069;&#19968;&#22825;&#30005;&#21147;&#38656;&#27714;&#27169;&#22411;&#24471;&#21040;&#32435;&#20837;&#25215;&#35834;&#65292;&#28982;&#21518;&#36890;&#36807;&#23558;&#28216;&#25103;&#24314;&#27169;&#20026;&#31454;&#20105;&#26469;&#24471;&#21040;&#20805;&#30005;&#31449;&#30340;&#20215;&#26684;&#31574;&#30053;&#12290;
&lt;/p&gt;
&lt;p&gt;
Fast-charging hubs for electric vehicles will soon become part of the newly built infrastructure for transportation electrification across the world. These hubs are expected to host many DC fast-charging stations and will admit EVs only for charging. Like the gasoline refueling stations, fast-charging hubs in a neighborhood will dynamically vary their prices to compete for the same pool of EV owners. These hubs will interact with the electric power network by making purchase commitments for a significant part of their power needs in the day-ahead (DA) electricity market and meeting the difference from the real-time (RT) market. Hubs may have supplemental battery storage systems (BSS), which they will use for arbitrage. In this paper, we develop a two-step data-driven dynamic pricing methodology for hubs in price competition. We first obtain the DA commitment by solving a stochastic DA commitment model. Thereafter we obtain the hub pricing strategies by modeling the game as a competitiv
&lt;/p&gt;</description></item></channel></rss>