<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#30740;&#31350;&#20102;&#21512;&#29702;&#24573;&#30053;&#19979;&#30340;&#28216;&#25103;&#31283;&#20581;&#39044;&#27979;&#65292;&#21457;&#29616;&#29702;&#24615;&#24573;&#30053;&#20250;&#38477;&#20302;&#31119;&#21033;&#24182;&#24341;&#20837;&#23545;&#34892;&#20026;&#30340;&#39069;&#22806;&#38480;&#21046;&#65292;&#20004;&#31181;&#30693;&#35782;&#26041;&#26696;&#22312;&#34892;&#20026;&#19978;&#27809;&#26377;&#21306;&#21035;&#65292;&#20294;&#20250;&#24433;&#21709;&#26368;&#20248;&#25919;&#31574;&#12290;</title><link>http://arxiv.org/abs/2306.09964</link><description>&lt;p&gt;
&#21512;&#29702;&#24573;&#30053;&#19979;&#30340;&#28216;&#25103;&#20013;&#30340;&#31283;&#20581;&#39044;&#27979;
&lt;/p&gt;
&lt;p&gt;
Robust Predictions in Games with Rational Inattention. (arXiv:2306.09964v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.09964
&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#20102;&#21512;&#29702;&#24573;&#30053;&#19979;&#30340;&#28216;&#25103;&#31283;&#20581;&#39044;&#27979;&#65292;&#21457;&#29616;&#29702;&#24615;&#24573;&#30053;&#20250;&#38477;&#20302;&#31119;&#21033;&#24182;&#24341;&#20837;&#23545;&#34892;&#20026;&#30340;&#39069;&#22806;&#38480;&#21046;&#65292;&#20004;&#31181;&#30693;&#35782;&#26041;&#26696;&#22312;&#34892;&#20026;&#19978;&#27809;&#26377;&#21306;&#21035;&#65292;&#20294;&#20250;&#24433;&#21709;&#26368;&#20248;&#25919;&#31574;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#28041;&#21450;&#28789;&#27963;&#20449;&#24687;&#33719;&#21462;&#30340;&#28216;&#25103;&#20013;&#30340;&#31283;&#20581;&#39044;&#27979;&#65292;&#20063;&#31216;&#20026;&#21512;&#29702;&#24573;&#30053;&#65288;Sims 2003&#65289;&#12290;&#36825;&#20123;&#39044;&#27979;&#22312;&#29609;&#23478;&#20351;&#29992;&#33719;&#21462;&#20449;&#24687;&#30340;&#20855;&#20307;&#26041;&#27861;&#26102;&#20173;&#28982;&#20445;&#25345;&#20934;&#30830;&#12290;&#19982;&#20449;&#24687;&#39044;&#23450;&#30340;&#24773;&#20917;&#30456;&#27604;&#65292;&#29702;&#24615;&#24573;&#30053;&#20250;&#38477;&#20302;&#31119;&#21033;&#24182;&#24341;&#20837;&#23545;&#34892;&#20026;&#30340;&#39069;&#22806;&#38480;&#21046;&#12290;&#25105;&#20204;&#35777;&#26126;&#36825;&#20123;&#38480;&#21046;&#19968;&#33324;&#19981;&#20250;&#34987;&#25191;&#34892;;&#22312;&#22823;&#22810;&#25968;&#29615;&#22659;&#20013;&#65292;&#36825;&#20004;&#20010;&#30693;&#35782;&#26041;&#26696;&#22312;&#34892;&#20026;&#19978;&#27809;&#26377;&#21306;&#21035;&#12290;&#28982;&#32780;&#65292;&#25105;&#20204;&#35777;&#26126;&#23427;&#20204;&#29983;&#25104;&#30340;&#31119;&#21033;&#24046;&#24322;&#26159;&#23454;&#36136;&#24615;&#30340;&#65306;&#26368;&#20248;&#25919;&#31574;&#21462;&#20915;&#20110;&#19968;&#20010;&#20154;&#26159;&#21542;&#35748;&#20026;&#20449;&#24687;&#26159;&#24050;&#30693;&#30340;&#25110;&#34987;&#33719;&#21462;&#30340;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#35813;&#32972;&#26223;&#19979;&#30340;&#25919;&#31574;&#20998;&#26512;&#24517;&#35201;&#24037;&#20855;&#12290;
&lt;/p&gt;
&lt;p&gt;
We derive robust predictions in games involving flexible information acquisition, also known as rational inattention (Sims 2003). These predictions remain accurate regardless of the specific methods players employ to gather information. Compared to scenarios where information is predetermined, rational inattention reduces welfare and introduces additional constraints on behavior. We show these constraints generically do not bind; the two knowledge regimes are behaviorally indistinguishable in most environments. Yet, we demonstrate the welfare difference they generate is substantial: optimal policy depends on whether one assumes information is given or acquired. We provide the necessary tools for policy analysis in this context.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22312;&#38754;&#26495;&#25968;&#25454;&#20013;&#26080;&#38656;&#25351;&#23450;&#32593;&#32476;&#32467;&#26500;&#26469;&#26816;&#39564;&#21516;&#34892;&#24433;&#21709;&#30340;&#26041;&#27861;&#65292;&#22686;&#21152;&#20102;&#24037;&#20855;&#21464;&#37327;&#25968;&#30446;&#65292;&#36890;&#36807;&#22810;IV&#29615;&#22659;&#24182;&#25193;&#23637;&#24050;&#26377;&#22810;IV&#28176;&#36817;&#32467;&#26524;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#35813;&#26041;&#27861;&#22312;&#23384;&#22312;&#20010;&#20307;&#21644;&#26102;&#38388;&#22266;&#23450;&#25928;&#24212;&#30340;&#24773;&#20917;&#19979;&#26159;&#26377;&#25928;&#30340;&#12290;</title><link>http://arxiv.org/abs/2306.09806</link><description>&lt;p&gt;
&#19981;&#38656;&#25351;&#23450;&#32593;&#32476;&#32467;&#26500;&#30340;&#21516;&#34892;&#24433;&#21709;&#27979;&#35797;
&lt;/p&gt;
&lt;p&gt;
Testing for Peer Effects without Specifying the Network Structure. (arXiv:2306.09806v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.09806
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22312;&#38754;&#26495;&#25968;&#25454;&#20013;&#26080;&#38656;&#25351;&#23450;&#32593;&#32476;&#32467;&#26500;&#26469;&#26816;&#39564;&#21516;&#34892;&#24433;&#21709;&#30340;&#26041;&#27861;&#65292;&#22686;&#21152;&#20102;&#24037;&#20855;&#21464;&#37327;&#25968;&#30446;&#65292;&#36890;&#36807;&#22810;IV&#29615;&#22659;&#24182;&#25193;&#23637;&#24050;&#26377;&#22810;IV&#28176;&#36817;&#32467;&#26524;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#35813;&#26041;&#27861;&#22312;&#23384;&#22312;&#20010;&#20307;&#21644;&#26102;&#38388;&#22266;&#23450;&#25928;&#24212;&#30340;&#24773;&#20917;&#19979;&#26159;&#26377;&#25928;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;Anderson-Rubin&#65288;AR&#65289;&#26816;&#39564;&#26041;&#27861;&#65292;&#29992;&#20110;&#22312;&#27809;&#26377;&#25351;&#23450;&#32593;&#32476;&#32467;&#26500;&#30340;&#38754;&#26495;&#25968;&#25454;&#20013;&#26816;&#39564;&#21516;&#34892;&#24433;&#21709;&#12290;&#25105;&#20204;&#30340;&#26080;&#38480;&#21046;&#27169;&#22411;&#26159;&#19968;&#20010;&#24102;&#26377;&#29305;&#23450;&#23545;&#31561;&#20307;&#21516;&#34892;&#24433;&#21709;&#30340;&#32447;&#24615;&#38754;&#26495;&#25968;&#25454;&#27169;&#22411;&#12290;&#25152;&#25552;&#20986;&#30340;AR&#26816;&#39564;&#35780;&#20272;&#21516;&#34892;&#25928;&#24212;&#31995;&#25968;&#26159;&#21542;&#20840;&#37096;&#20026;&#38646;&#12290;&#38543;&#30528;&#23545;&#31561;&#20307;&#25928;&#24212;&#31995;&#25968;&#30340;&#22686;&#21152;&#65292;&#20351;&#29992;&#30340;&#24037;&#20855;&#21464;&#37327;&#65288;IVs&#65289;&#25968;&#37327;&#38543;&#26679;&#26412;&#25968;&#37327;&#22686;&#21152;&#32780;&#22686;&#21152;&#65292;&#24418;&#25104;Bekker&#30340;&#22810;IV&#29615;&#22659;&#12290;&#36890;&#36807;&#23558;&#29616;&#26377;&#30340;&#22810;IV&#28176;&#36817;&#32467;&#26524;&#25193;&#23637;&#21040;&#38754;&#26495;&#25968;&#25454;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#25152;&#25552;&#20986;&#30340;AR&#27979;&#35797;&#22312;&#23384;&#22312;&#20010;&#20307;&#21644;&#26102;&#38388;&#22266;&#23450;&#25928;&#24212;&#30340;&#24773;&#20917;&#19979;&#26159;&#28176;&#36817;&#26377;&#25928;&#30340;&#12290;&#25105;&#20204;&#36827;&#34892;&#20102;&#33945;&#29305;&#21345;&#32599;&#27169;&#25311;&#26469;&#30740;&#31350;AR&#27979;&#35797;&#30340;&#26377;&#38480;&#26679;&#26412;&#24615;&#33021;&#65292;&#24182;&#25552;&#20379;&#20102;&#20004;&#20010;&#24212;&#29992;&#26469;&#35777;&#26126;&#20854;&#23454;&#35777;&#24847;&#20041;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper proposes an Anderson-Rubin (AR) test for the presence of peer effects in panel data without the need to specify the network structure. The unrestricted model of our test is a linear panel data model of social interactions with dyad-specific peer effects. The proposed AR test evaluates if the peer effect coefficients are all zero. As the number of peer effect coefficients increases with the sample size, so does the number of instrumental variables (IVs) employed to estimate the unrestricted model, rendering Bekker's many-IV environment. By extending existing many-IV asymptotic results to panel data, we show that the proposed AR test is asymptotically valid under the presence of both individual and time fixed effects. We conduct Monte Carlo simulations to investigate the finite sample performance of the AR test and provide two applications to demonstrate its empirical relevance.
&lt;/p&gt;</description></item><item><title>CSREU&#26159;&#19968;&#20221;&#27431;&#27954;&#20844;&#21496;&#32489;&#25928;&#25351;&#26631;&#21644;CSR&#25259;&#38706;&#35780;&#20998;&#30340;&#25968;&#25454;&#38598;&#65292;&#21021;&#27493;&#32467;&#26524;&#34920;&#26126;CSR&#25259;&#38706;&#23545;&#36130;&#21153;&#32489;&#25928;&#24433;&#21709;&#36739;&#24369;&#65292;&#38656;&#35201;&#26356;&#28145;&#20837;&#30340;&#30740;&#31350;&#12290;</title><link>http://arxiv.org/abs/2306.09798</link><description>&lt;p&gt;
CSREU&#65306;&#19968;&#20221;&#20851;&#20110;&#20844;&#21496;&#31038;&#20250;&#36131;&#20219;&#21644;&#32489;&#25928;&#25351;&#26631;&#30340;&#26032;&#25968;&#25454;&#38598;
&lt;/p&gt;
&lt;p&gt;
CSREU: A Novel Dataset about Corporate Social Responsibility and Performance Indicators. (arXiv:2306.09798v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.09798
&lt;/p&gt;
&lt;p&gt;
CSREU&#26159;&#19968;&#20221;&#27431;&#27954;&#20844;&#21496;&#32489;&#25928;&#25351;&#26631;&#21644;CSR&#25259;&#38706;&#35780;&#20998;&#30340;&#25968;&#25454;&#38598;&#65292;&#21021;&#27493;&#32467;&#26524;&#34920;&#26126;CSR&#25259;&#38706;&#23545;&#36130;&#21153;&#32489;&#25928;&#24433;&#21709;&#36739;&#24369;&#65292;&#38656;&#35201;&#26356;&#28145;&#20837;&#30340;&#30740;&#31350;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20225;&#19994;&#31038;&#20250;&#36131;&#20219;&#65288;CSR&#65289;&#24050;&#25104;&#20026;&#19968;&#20010;&#37325;&#35201;&#35805;&#39064;&#65292;&#21463;&#21040;&#23398;&#26415;&#30028;&#30340;&#24191;&#27867;&#20851;&#27880;&#12290;&#26412;&#30740;&#31350;&#20171;&#32461;&#20102;CSREU&#65292;&#19968;&#20010;&#21253;&#21547;115&#20010;&#27431;&#27954;&#20844;&#21496;&#23646;&#24615;&#30340;&#26032;&#25968;&#25454;&#38598;&#65292;&#20854;&#20013;&#21253;&#25324;&#25968;&#20010;&#32489;&#25928;&#25351;&#26631;&#21644;&#25353;&#29031;&#20840;&#29699;&#25253;&#21578;&#20513;&#35758;&#65288;GRI&#65289;&#26694;&#26550;&#35745;&#31639;&#30340;&#30456;&#24212;CSR&#25259;&#38706;&#35780;&#20998;&#12290;&#25105;&#20204;&#36824;&#30740;&#31350;&#20102;&#19968;&#20123;&#20844;&#21496;&#36130;&#21153;&#25351;&#26631;&#19982;CSR&#25259;&#38706;&#35780;&#20998;&#20043;&#38388;&#30340;&#30456;&#20851;&#24615;&#12290;&#26681;&#25454;&#25105;&#20204;&#30340;&#32467;&#26524;&#65292;&#36825;&#20123;&#30456;&#20851;&#24615;&#36739;&#24369;&#65292;&#38656;&#35201;&#36827;&#34892;&#26356;&#28145;&#20837;&#30340;&#20998;&#26512;&#25165;&#33021;&#24471;&#20986;&#20851;&#20110;CSR&#25259;&#38706;&#23545;&#36130;&#21153;&#32489;&#25928;&#30340;&#28508;&#22312;&#24433;&#21709;&#30340;&#20196;&#20154;&#20449;&#26381;&#30340;&#32467;&#35770;&#12290;&#25105;&#20204;&#24076;&#26395;&#26032;&#21019;&#24314;&#30340;&#25968;&#25454;&#21644;&#25105;&#20204;&#30340;&#21021;&#27493;&#32467;&#26524;&#33021;&#22815;&#24110;&#21161;&#21644;&#20419;&#36827;&#36825;&#19968;&#39046;&#22495;&#30340;&#30740;&#31350;&#12290;
&lt;/p&gt;
&lt;p&gt;
Corporate Social Responsibility (CSR) has become an important topic that is gaining academic interest. This research paper presents CSREU, a new dataset with attributes of 115 European companies, which includes several performance indicators and the respective CSR disclosure scores computed using the Global Reporting Initiative (GRI) framework. We also examine the correlations between some of the financial indicators and the CSR disclosure scores of the companies. According to our results, these correlations are weak and deeper analysis is required to draw convincing conclusions about the potential impact of CSR disclosure on financial performance. We hope that the newly created data and our preliminary results will help and foster research in this field.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#35843;&#26597;&#20102;&#35199;&#29305;&#20848;&#26031;&#36798;&#21162;&#27604;&#20122;&#22320;&#21306;&#21256;&#29273;&#21033;&#24212;&#29992;&#31185;&#23398;&#22823;&#23398;&#23398;&#29983;&#65292;&#26088;&#22312;&#30740;&#31350;&#21019;&#19994;&#24847;&#21521;&#21463;&#21040;&#22823;&#23398;&#25903;&#25345;&#21644;&#29615;&#22659;&#30340;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2306.09678</link><description>&lt;p&gt;
&#24863;&#30693;&#22823;&#23398;&#25903;&#25345;&#19982;&#29615;&#22659;&#20316;&#20026;&#21019;&#19994;&#24847;&#21521;&#22240;&#32032;&#65306;&#20197;&#35199;&#29305;&#20848;&#26031;&#36798;&#21162;&#27604;&#20122;&#22320;&#21306;&#20026;&#20363;
&lt;/p&gt;
&lt;p&gt;
Perceived university support and environment as a factor of entrepreneurial intention: Evidence from Western Transdanubia Region. (arXiv:2306.09678v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.09678
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#35843;&#26597;&#20102;&#35199;&#29305;&#20848;&#26031;&#36798;&#21162;&#27604;&#20122;&#22320;&#21306;&#21256;&#29273;&#21033;&#24212;&#29992;&#31185;&#23398;&#22823;&#23398;&#23398;&#29983;&#65292;&#26088;&#22312;&#30740;&#31350;&#21019;&#19994;&#24847;&#21521;&#21463;&#21040;&#22823;&#23398;&#25903;&#25345;&#21644;&#29615;&#22659;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36817;&#24180;&#26469;&#65292;&#25506;&#32034;&#21019;&#19994;&#24050;&#25104;&#20026;&#31185;&#23398;&#30740;&#31350;&#30340;&#37325;&#28857;&#12290;&#20102;&#35299;&#36825;&#19968;&#29616;&#35937;&#23545;&#20110;&#23558;&#21019;&#19994;&#36716;&#21270;&#20026;&#34892;&#21160;&#23588;&#20854;&#37325;&#35201;&#65292;&#36825;&#26159;&#26089;&#26399;&#21019;&#19994;&#27963;&#21160;&#30340;&#20851;&#38190;&#22240;&#32032;&#12290;&#36825;&#22312;&#22823;&#23398;&#29615;&#22659;&#20013;&#20855;&#26377;&#29305;&#27530;&#30340;&#37325;&#35201;&#24615;&#65292;&#38500;&#20102;&#20256;&#32479;&#30340;&#25945;&#23398;&#21644;&#30740;&#31350;&#21151;&#33021;&#22806;&#65292;&#22522;&#20110;&#24320;&#25918;&#21019;&#26032;&#30340;&#21019;&#19994;&#22823;&#23398;&#36816;&#33829;&#20197;&#21450;&#22686;&#24378;&#30740;&#31350;&#20154;&#21592;&#21644;&#23398;&#29983;&#30340;&#21019;&#19994;&#24577;&#24230;&#27491;&#22312;&#24471;&#21040;&#36234;&#26469;&#36234;&#22810;&#30340;&#20851;&#27880;&#12290;&#26412;&#30740;&#31350;&#22522;&#20110;&#22312;&#35199;&#29305;&#20848;&#26031;&#36798;&#21162;&#27604;&#20122;&#22320;&#21306;&#30340;&#19968;&#25152;&#21256;&#29273;&#21033;&#24212;&#29992;&#31185;&#23398;&#22823;&#23398;&#30340;&#23398;&#29983;&#20043;&#38388;&#36827;&#34892;&#30340;&#35843;&#26597;&#12290;&#36825;&#20123;&#23398;&#29983;&#36890;&#36807;&#21152;&#20837;&#22269;&#23478;&#21019;&#19994;&#22521;&#35757;&#21644;&#23413;&#21270;&#35745;&#21010;&#26469;&#34920;&#29616;&#20986;&#20182;&#20204;&#29616;&#26377;&#30340;&#21019;&#19994;&#25215;&#35834;&#12290;&#26412;&#30740;&#31350;&#30340;&#20027;&#35201;&#30740;&#31350;&#38382;&#39064;&#26159;&#65292;&#23398;&#29983;&#30340;&#21019;&#19994;&#24847;&#21521;&#22312;&#22810;&#22823;&#31243;&#24230;&#19978;&#21463;&#21040;&#21019;&#19994;&#29615;&#22659;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
The exploration of entrepreneurship has become a priority for scientific research in recent years. Understanding this phenomenon is particularly important for the transformation of entrepreneurship into action, which is a key factor in early-stage entrepreneurial activity. This gains particular relevance in the university environment, where, in addition to the conventional teaching and research functions, the entrepreneurial university operation based on open innovation, as well as the enhancement of entrepreneurial attitudes of researchers and students, are receiving increased attention. This study is based on a survey conducted among students attending a Hungarian university of applied science in Western Transdanubia Region who have demonstrated their existing entrepreneurial commitment by joining a national startup training and incubation programme. The main research question of the study is to what extent student entrepreneurship intention is influenced by the environment of the en
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#25151;&#23627;&#20132;&#25442;&#38382;&#39064;&#20013;&#20855;&#26377;&#23458;&#35266;&#19981;&#30830;&#23450;&#24615;&#30340;&#24773;&#20917;&#65292;&#24182;&#25552;&#20986;&#19968;&#31181;&#36816;&#34892;&#26102;&#38388;&#26356;&#30701;&#30340;&#31639;&#27861;&#26469;&#20135;&#29983;&#21807;&#19968;&#20005;&#26684;&#26680;&#20998;&#37197;&#12290;</title><link>http://arxiv.org/abs/2306.09529</link><description>&lt;p&gt;
&#20855;&#26377;&#23458;&#35266;&#19981;&#30830;&#23450;&#24615;&#30340;&#25151;&#23627;&#20132;&#25442;&#38382;&#39064;
&lt;/p&gt;
&lt;p&gt;
House-Swapping with Objective Indifferences. (arXiv:2306.09529v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.09529
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#25151;&#23627;&#20132;&#25442;&#38382;&#39064;&#20013;&#20855;&#26377;&#23458;&#35266;&#19981;&#30830;&#23450;&#24615;&#30340;&#24773;&#20917;&#65292;&#24182;&#25552;&#20986;&#19968;&#31181;&#36816;&#34892;&#26102;&#38388;&#26356;&#30701;&#30340;&#31639;&#27861;&#26469;&#20135;&#29983;&#21807;&#19968;&#20005;&#26684;&#26680;&#20998;&#37197;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#20195;&#29702;&#21487;&#33021;&#25317;&#26377;&#8220;&#23458;&#35266;&#8221;&#19981;&#30830;&#23450;&#24615;&#30340;&#24773;&#20917;&#19979;&#30340;&#32463;&#20856;&#25151;&#23627;&#20132;&#25442;&#38382;&#39064;&#12290;&#20063;&#23601;&#26159;&#35828;&#65292;&#22914;&#26524;&#20219;&#20309;&#19968;&#20010;&#20195;&#29702;&#23545;&#20004;&#25152;&#25151;&#23627;&#25345;&#20013;&#31435;&#24577;&#24230;&#65292;&#21017;&#25152;&#26377;&#20195;&#29702;&#23545;&#36825;&#20004;&#25152;&#25151;&#23627;&#37117;&#26159;&#20013;&#31435;&#24577;&#24230;&#12290;&#25105;&#20204;&#30340;&#35774;&#23450;&#26159;&#20855;&#26377;&#19968;&#33324;&#19981;&#30830;&#23450;&#24615;&#30340;&#25151;&#23627;&#20132;&#25442;&#38382;&#39064;&#30340;&#29305;&#20363;&#12290;&#25105;&#20204;&#25512;&#23548;&#20986;&#20102;&#19968;&#31181;&#31616;&#21333;&#26131;&#25026;&#30340;&#31639;&#27861;&#65292;&#22914;&#26524;&#23384;&#22312;&#23436;&#20840;&#26680;&#20998;&#37197;&#65292;&#21017;&#20135;&#29983;&#25151;&#23627;&#20132;&#25442;&#24066;&#22330;&#30340;&#21807;&#19968;&#20005;&#26684;&#26680;&#20998;&#37197;&#12290;&#25105;&#20204;&#30340;&#31639;&#27861;&#30340;&#36816;&#34892;&#26102;&#38388;&#20026;&#20108;&#27425;&#22810;&#39033;&#24335;&#26102;&#38388;&#65292;&#26159;&#36890;&#29992;&#38382;&#39064;&#30340;&#19977;&#27425;&#26102;&#38388;&#26041;&#27861;&#30340;&#23454;&#36136;&#24615;&#25913;&#36827;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study the classic house-swapping problem of Shapley and Scarf (1974) in a setting where agents may have "objective" indifferences, i.e., indifferences that are shared by all agents. In other words, if any one agent is indifferent between two houses, then all agents are indifferent between those two houses. The most direct interpretation is the presence of multiple copies of the same object. Our setting is a special case of the house-swapping problem with general indifferences. We derive a simple, easily interpretable algorithm that produces the unique strict core allocation of the house-swapping market, if it exists. Our algorithm runs in square polynomial time, a substantial improvement over the cubed time methods for the more general problem.
&lt;/p&gt;</description></item><item><title>&#36890;&#36807;&#20998;&#26512;40&#19975;&#27604;&#29305;&#24065;&#20132;&#26131;&#25968;&#25454;&#38598;&#65292;&#26412;&#25991;&#35782;&#21035;&#26263;&#32593;&#24066;&#22330;&#20013;&#20851;&#38190;&#21442;&#19982;&#32773;&#65292;&#24182;&#31361;&#20986;&#20102;&#22810;&#23478;&#24066;&#22330;&#36816;&#33829;&#32773;&#30340;&#37325;&#35201;&#24615;&#12290;&#22312;&#26263;&#32593;&#24066;&#22330;&#29983;&#24577;&#21463;&#21040;&#22806;&#37096;&#20914;&#20987;&#26102;&#65292;&#22810;&#23478;&#24066;&#22330;&#36816;&#33829;&#32773;&#19982;&#21334;&#23478;&#38388;&#30340;&#20132;&#20114;&#32593;&#32476;&#21487;&#20197;&#25581;&#31034;&#20854;&#23545;&#25239;&#22806;&#37096;&#20914;&#20987;&#30340;&#29305;&#28857;&#21644;&#25269;&#25239;&#21147;&#12290;</title><link>http://arxiv.org/abs/2306.09485</link><description>&lt;p&gt;
&#35782;&#21035;&#26263;&#32593;&#24066;&#22330;&#20013;&#30340;&#20851;&#38190;&#21442;&#19982;&#32773;
&lt;/p&gt;
&lt;p&gt;
Identifying key players in dark web marketplaces. (arXiv:2306.09485v1 [physics.soc-ph])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.09485
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#20998;&#26512;40&#19975;&#27604;&#29305;&#24065;&#20132;&#26131;&#25968;&#25454;&#38598;&#65292;&#26412;&#25991;&#35782;&#21035;&#26263;&#32593;&#24066;&#22330;&#20013;&#20851;&#38190;&#21442;&#19982;&#32773;&#65292;&#24182;&#31361;&#20986;&#20102;&#22810;&#23478;&#24066;&#22330;&#36816;&#33829;&#32773;&#30340;&#37325;&#35201;&#24615;&#12290;&#22312;&#26263;&#32593;&#24066;&#22330;&#29983;&#24577;&#21463;&#21040;&#22806;&#37096;&#20914;&#20987;&#26102;&#65292;&#22810;&#23478;&#24066;&#22330;&#36816;&#33829;&#32773;&#19982;&#21334;&#23478;&#38388;&#30340;&#20132;&#20114;&#32593;&#32476;&#21487;&#20197;&#25581;&#31034;&#20854;&#23545;&#25239;&#22806;&#37096;&#20914;&#20987;&#30340;&#29305;&#28857;&#21644;&#25269;&#25239;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26263;&#32593;&#24066;&#22330;&#19968;&#30452;&#26159;&#38750;&#27861;&#20132;&#26131;&#30340;&#37325;&#35201;&#20986;&#21475;&#65292;&#26381;&#21153;&#20110;&#20840;&#29699;&#25968;&#30334;&#19975;&#29992;&#25143;&#24050;&#26377;&#21313;&#20313;&#24180;&#12290;&#28982;&#32780;&#65292;&#24182;&#19981;&#26159;&#25152;&#26377;&#29992;&#25143;&#37117;&#26159;&#30456;&#21516;&#30340;&#12290;&#26412;&#25991;&#26088;&#22312;&#36890;&#36807;&#20998;&#26512;&#19968;&#20010;&#21253;&#25324;&#20102;31&#20010;&#24066;&#22330;&#22312;2011&#24180;&#21040;2021&#24180;&#26399;&#38388;&#30340;4,000&#19975;&#27604;&#29305;&#24065;&#20132;&#26131;&#25968;&#25454;&#38598;&#65292;&#35782;&#21035;&#19982;&#26263;&#24066;&#22330;&#30456;&#20851;&#30340;&#27604;&#29305;&#24065;&#20132;&#26131;&#32593;&#32476;&#20013;&#30340;&#20851;&#38190;&#21442;&#19982;&#32773;&#65292;&#35780;&#20272;&#20182;&#20204;&#30340;&#35282;&#33394;&#12290;&#39318;&#20808;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#31639;&#27861;&#23558;&#29992;&#25143;&#20998;&#31867;&#20026;&#20080;&#23478;&#25110;&#21334;&#23478;&#65292;&#34920;&#26126;&#20132;&#26131;&#37327;&#30340;&#24456;&#22823;&#19968;&#37096;&#20998;&#38598;&#20013;&#22312;&#23569;&#25968;&#31934;&#33521;&#24066;&#22330;&#21442;&#19982;&#32773;&#25163;&#20013;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#35843;&#26597;&#20102;&#24066;&#22330;&#26143;&#22270;&#21644;&#29992;&#25143;&#21040;&#29992;&#25143;&#32593;&#32476;&#65292;&#24182;&#31361;&#20986;&#20102;&#19968;&#20010;&#26032;&#31867;&#29992;&#25143;&#30340;&#37325;&#35201;&#24615;&#65292;&#21363;&#21516;&#26102;&#22312;&#22810;&#20010;&#24066;&#22330;&#19978;&#36816;&#33829;&#30340;multihomers&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;multihomers&#21644;&#21334;&#23478;&#21040;&#21334;&#23478;&#20043;&#38388;&#30340;&#20132;&#20114;&#32593;&#32476;&#21487;&#20197;&#25581;&#31034;&#26263;&#24066;&#22330;&#29983;&#24577;&#23545;&#22806;&#37096;&#20914;&#20987;&#30340;&#25269;&#25239;&#21147;&#12290;&#25105;&#20204;&#30340;&#21457;&#29616;&#34920;&#26126;&#65292;&#20102;&#35299;&#26263;&#32593;&#24066;&#22330;&#20013;&#20851;&#38190;&#21442;&#19982;&#32773;&#20043;&#38388;&#30340;&#20132;&#26131;&#23545;&#20110;&#35782;&#21035;&#21644;&#30772;&#22351;&#36825;&#20123;&#24179;&#21488;&#19978;&#30340;&#38750;&#27861;&#27963;&#21160;&#33267;&#20851;&#37325;&#35201;&#12290;
&lt;/p&gt;
&lt;p&gt;
Dark web marketplaces have been a significant outlet for illicit trade, serving millions of users worldwide for over a decade. However, not all users are the same. This paper aims to identify the key players in Bitcoin transaction networks linked to dark markets and assess their role by analysing a dataset of 40 million Bitcoin transactions involving 31 markets in the period 2011-2021. First, we propose an algorithm that categorizes users either as buyers or sellers and shows that a large fraction of the traded volume is concentrated in a small group of elite market participants. Then, we investigate both market star-graphs and user-to-user networks and highlight the importance of a new class of users, namely `multihomers' who operate on multiple marketplaces concurrently. Specifically, we show how the networks of multihomers and seller-to-seller interactions can shed light on the resilience of the dark market ecosystem against external shocks. Our findings suggest that understanding t
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#31639;&#27861;&#23398;&#20064;&#31454;&#26631;&#26102;&#19981;&#21516;&#25903;&#20184;&#35268;&#21017;&#23545;&#25928;&#29575;&#30340;&#24433;&#21709;&#65292;&#21457;&#29616;&#25903;&#20184;&#35268;&#21017;&#23545;&#31454;&#25293;&#25928;&#29575;&#33267;&#20851;&#37325;&#35201;&#12290;</title><link>http://arxiv.org/abs/2306.09437</link><description>&lt;p&gt;
&#24403;&#31639;&#27861;&#23398;&#20064;&#31454;&#26631;&#26102;&#30340;&#25293;&#21334;&#35774;&#35745;&#65306;&#25903;&#20184;&#35268;&#21017;&#30340;&#37325;&#35201;&#20316;&#29992;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Designing Auctions when Algorithms Learn to Bid: The critical role of Payment Rules. (arXiv:2306.09437v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.09437
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#31639;&#27861;&#23398;&#20064;&#31454;&#26631;&#26102;&#19981;&#21516;&#25903;&#20184;&#35268;&#21017;&#23545;&#25928;&#29575;&#30340;&#24433;&#21709;&#65292;&#21457;&#29616;&#25903;&#20184;&#35268;&#21017;&#23545;&#31454;&#25293;&#25928;&#29575;&#33267;&#20851;&#37325;&#35201;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#31639;&#27861;&#23398;&#20064;&#31454;&#26631;&#26102;&#19981;&#21516;&#25903;&#20184;&#35268;&#21017;&#23545;&#25928;&#29575;&#30340;&#24433;&#21709;&#12290;&#25105;&#20204;&#36827;&#34892;&#20102;&#19968;&#20010;&#23436;&#20840;&#38543;&#26426;&#23454;&#39564;&#65292;&#36827;&#34892;&#20102;427&#27425;&#35797;&#39564;&#65292;&#20854;&#20013;Q-learning&#30340;&#31454;&#26631;&#32773;&#21442;&#21152;&#20102;&#39640;&#36798;250,000&#27425;&#20851;&#20110;&#20849;&#21516;&#35780;&#20272;&#39033;&#30340;&#31454;&#25293;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#21457;&#29616;&#65292;&#31532;&#19968;&#20215;&#26684;&#25293;&#21334;&#65292;&#21363;&#32988;&#21033;&#32773;&#25903;&#20184;&#33719;&#32988;&#20986;&#20215;&#65292;&#23481;&#26131;&#21463;&#21040;&#21327;&#35843;&#31454;&#26631;&#21387;&#21046;&#65292;&#32988;&#20986;&#20986;&#20215;&#24179;&#22343;&#20302;&#20110;&#30495;&#23454;&#20215;&#20540;&#32422;20%&#12290;&#30456;&#27604;&#20043;&#19979;&#65292;&#31532;&#20108;&#20215;&#26684;&#25293;&#21334;&#65292;&#21363;&#32988;&#21033;&#32773;&#25903;&#20184;&#31532;&#20108;&#39640;&#20986;&#20215;&#65292;&#20351;&#33719;&#32988;&#20986;&#20215;&#19982;&#23454;&#38469;&#20215;&#20540;&#19968;&#33268;&#65292;&#20943;&#23569;&#23398;&#20064;&#26399;&#38388;&#30340;&#27874;&#21160;&#24182;&#21152;&#24555;&#25910;&#25947;&#36895;&#24230;&#12290;&#22238;&#24402;&#20998;&#26512;&#32771;&#34385;&#20102;&#35832;&#22914;&#25903;&#20184;&#35268;&#21017;&#12289;&#21442;&#19982;&#20154;&#25968;&#12289;&#25240;&#25187;&#21644;&#23398;&#20064;&#29575;&#31561;&#31639;&#27861;&#22240;&#32032;&#12289;&#24322;&#27493;/&#21516;&#27493;&#26356;&#26032;&#12289;&#21453;&#39304;&#21644;&#25506;&#32034;&#31574;&#30053;&#31561;&#35774;&#35745;&#22240;&#32032;&#65292;&#21457;&#29616;&#25903;&#20184;&#35268;&#21017;&#23545;&#25928;&#29575;&#33267;&#20851;&#37325;&#35201;&#12290;&#27492;&#22806;&#65292;&#26426;&#22120;&#23398;&#20064;&#20272;&#35745;&#22120;&#21457;&#29616;&#65292;&#25903;&#20184;&#35268;&#21017;&#29978;&#33267;&#27604;&#20854;&#20182;&#22240;&#32032;&#26356;&#21152;&#37325;&#35201;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper examines the impact of different payment rules on efficiency when algorithms learn to bid. We use a fully randomized experiment of 427 trials, where Q-learning bidders participate in up to 250,000 auctions for a commonly valued item. The findings reveal that the first price auction, where winners pay the winning bid, is susceptible to coordinated bid suppression, with winning bids averaging roughly 20% below the true values. In contrast, the second price auction, where winners pay the second highest bid, aligns winning bids with actual values, reduces the volatility during learning and speeds up convergence. Regression analysis, incorporating design elements such as payment rules, number of participants, algorithmic factors including the discount and learning rate, asynchronous/synchronous updating, feedback, and exploration strategies, discovers the critical role of payment rules on efficiency. Furthermore, machine learning estimators find that payment rules matter even mor
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21487;&#35745;&#31639;&#20010;&#20307;&#24322;&#36136;&#24615;&#26497;&#20540;&#20998;&#20301;&#25968;&#32622;&#20449;&#21306;&#38388;&#30340;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#36890;&#36807;&#26500;&#36896;&#26497;&#20540;&#23450;&#29702;&#21644;&#20013;&#38388;&#38454;&#23450;&#29702;&#65292;&#20197;&#21450;&#36866;&#24403;&#30340;&#36895;&#29575;&#21644;&#21160;&#37327;&#26465;&#20214;&#26469;&#35299;&#20915;&#21482;&#26377;&#24102;&#26377;&#22122;&#22768;&#30340;&#20272;&#35745;&#21487;&#29992;&#30340;&#24773;&#20917;&#19979;&#65292;&#25512;&#26029;&#20010;&#20307;&#24322;&#36136;&#24615;&#30340;&#26497;&#20540;&#20998;&#20301;&#25968;&#30340;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2210.08524</link><description>&lt;p&gt;
&#35770;&#20010;&#20307;&#24322;&#36136;&#24615;&#26497;&#20540;&#20998;&#20301;&#25968;&#25512;&#26029;
&lt;/p&gt;
&lt;p&gt;
Inference on Extreme Quantiles of Unobserved Individual Heterogeneity. (arXiv:2210.08524v2 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2210.08524
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21487;&#35745;&#31639;&#20010;&#20307;&#24322;&#36136;&#24615;&#26497;&#20540;&#20998;&#20301;&#25968;&#32622;&#20449;&#21306;&#38388;&#30340;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#36890;&#36807;&#26500;&#36896;&#26497;&#20540;&#23450;&#29702;&#21644;&#20013;&#38388;&#38454;&#23450;&#29702;&#65292;&#20197;&#21450;&#36866;&#24403;&#30340;&#36895;&#29575;&#21644;&#21160;&#37327;&#26465;&#20214;&#26469;&#35299;&#20915;&#21482;&#26377;&#24102;&#26377;&#22122;&#22768;&#30340;&#20272;&#35745;&#21487;&#29992;&#30340;&#24773;&#20917;&#19979;&#65292;&#25512;&#26029;&#20010;&#20307;&#24322;&#36136;&#24615;&#30340;&#26497;&#20540;&#20998;&#20301;&#25968;&#30340;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#38754;&#26495;&#25968;&#25454;&#25110;&#20803;&#20998;&#26512;&#35774;&#32622;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26041;&#27861;&#65292;&#29992;&#20110;&#25512;&#26029;&#20010;&#20307;&#24322;&#36136;&#24615;&#65288;&#24322;&#36136;&#24615;&#31995;&#25968;&#12289;&#24322;&#36136;&#24615;&#22788;&#29702;&#25928;&#24212;&#31561;&#65289;&#30340;&#26497;&#20540;&#20998;&#20301;&#25968;&#12290;&#22312;&#36825;&#26679;&#30340;&#35774;&#32622;&#20013;&#65292;&#25512;&#26029;&#26159;&#20855;&#26377;&#25361;&#25112;&#24615;&#30340;&#65306;&#21482;&#26377;&#20851;&#20110;&#26410;&#35266;&#27979;&#24322;&#36136;&#24615;&#30340;&#24102;&#26377;&#22122;&#22768;&#30340;&#20272;&#35745;&#21487;&#29992;&#65292;&#32780;&#22522;&#20110;&#20013;&#24515;&#26497;&#38480;&#23450;&#29702;&#30340;&#36924;&#36817;&#22312;&#26497;&#20540;&#20998;&#20301;&#25968;&#19978;&#25928;&#26524;&#19981;&#20339;&#12290;&#38024;&#23545;&#36825;&#31181;&#24773;&#20917;&#65292;&#25105;&#20204;&#22312;&#24369;&#20551;&#35774;&#19979;&#25512;&#23548;&#20986;&#22122;&#22768;&#20272;&#35745;&#30340;&#26497;&#20540;&#23450;&#29702;&#21644;&#20013;&#38388;&#38454;&#23450;&#29702;&#65292;&#20197;&#21450;&#36866;&#24403;&#30340;&#36895;&#29575;&#21644;&#21160;&#37327;&#26465;&#20214;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#20351;&#29992;&#36825;&#20004;&#20010;&#23450;&#29702;&#26500;&#36896;&#26497;&#20540;&#20998;&#20301;&#25968;&#30340;&#32622;&#20449;&#21306;&#38388;&#12290;&#36825;&#20123;&#21306;&#38388;&#26131;&#20110;&#26500;&#36896;&#65292;&#26080;&#38656;&#36827;&#34892;&#20248;&#21270;&#12290;&#22522;&#20110;&#20013;&#38388;&#38454;&#23450;&#29702;&#30340;&#25512;&#26029;&#28041;&#21450;&#19968;&#31181;&#26032;&#39062;&#30340;&#33258;&#26631;&#20934;&#21270;&#20013;&#38388;&#38454;&#23450;&#29702;&#12290;&#22312;&#27169;&#25311;&#20013;&#65292;&#25105;&#20204;&#30340;&#26497;&#20540;&#32622;&#20449;&#21306;&#38388;&#22312;&#23614;&#37096;&#20855;&#26377;&#33391;&#22909;&#30340;&#35206;&#30422;&#24615;&#36136;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#26159;&#36890;&#36807;&#20351;&#29992;&#26469;&#33258;1979&#24180;&#22269;&#23478;&#32437;&#21521;&#38738;&#24180;&#35843;&#26597;&#30340;&#25968;&#25454;&#65292;&#23545;&#25945;&#32946;&#22238;&#25253;&#29575;&#20998;&#24067;&#30340;&#20272;&#35745;&#36827;&#34892;&#28436;&#31034;&#12290;
&lt;/p&gt;
&lt;p&gt;
We develop a methodology for conducting inference on extreme quantiles of unobserved individual heterogeneity (heterogeneous coefficients, heterogeneous treatment effects, etc.) in a panel data or meta-analysis setting. Inference in such settings is challenging: only noisy estimates of unobserved heterogeneity are available, and approximations based on the central limit theorem work poorly for extreme quantiles. For this situation, under weak assumptions we derive an extreme value theorem and an intermediate order theorem for noisy estimates and appropriate rate and moment conditions. Both theorems are then used to construct confidence intervals for extremal quantiles. The intervals are simple to construct and require no optimization. Inference based on the intermediate order theorem involves a novel self-normalized intermediate order theorem. In simulations, our extremal confidence intervals have favorable coverage properties in the tail. Our methodology is illustrated with an applica
&lt;/p&gt;</description></item><item><title>&#20420;&#20044;&#20914;&#31361;&#22312;&#20840;&#29699;&#39135;&#21697;&#29983;&#20135;&#32593;&#32476;&#20013;&#24341;&#36215;&#30340;&#23616;&#37096;&#20914;&#20987;&#20256;&#25773;&#24433;&#21709;&#21040;&#22810;&#20010;&#22269;&#23478;&#21644;&#22320;&#21306;&#30340;&#31918;&#39135;&#20379;&#24212;&#65292;&#20044;&#20811;&#20848;&#23436;&#20840;&#22833;&#21435;&#20892;&#19994;&#29983;&#20135;&#20250;&#23545;&#20840;&#29699;&#29978;&#33267;&#26159;&#23478;&#31165;&#32905;&#31867;&#21644;&#33909;&#33457;&#31869;&#27833;&#30340;&#24066;&#22330;&#36896;&#25104;&#37325;&#22823;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2210.01846</link><description>&lt;p&gt;
&#20174;&#20420;&#20044;&#20914;&#31361;&#21040;&#20840;&#29699;&#31918;&#39135;&#20379;&#24212;&#30340;&#20914;&#20987;&#20256;&#25773;&#65306;&#22522;&#20110;&#22810;&#23618;&#27425;&#39135;&#21697;&#29983;&#20135;&#32593;&#32476;&#30340;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Shock propagation from the Russia-Ukraine conflict on international multilayer food production network determines global food availability. (arXiv:2210.01846v2 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2210.01846
&lt;/p&gt;
&lt;p&gt;
&#20420;&#20044;&#20914;&#31361;&#22312;&#20840;&#29699;&#39135;&#21697;&#29983;&#20135;&#32593;&#32476;&#20013;&#24341;&#36215;&#30340;&#23616;&#37096;&#20914;&#20987;&#20256;&#25773;&#24433;&#21709;&#21040;&#22810;&#20010;&#22269;&#23478;&#21644;&#22320;&#21306;&#30340;&#31918;&#39135;&#20379;&#24212;&#65292;&#20044;&#20811;&#20848;&#23436;&#20840;&#22833;&#21435;&#20892;&#19994;&#29983;&#20135;&#20250;&#23545;&#20840;&#29699;&#29978;&#33267;&#26159;&#23478;&#31165;&#32905;&#31867;&#21644;&#33909;&#33457;&#31869;&#27833;&#30340;&#24066;&#22330;&#36896;&#25104;&#37325;&#22823;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20840;&#29699;&#39135;&#21697;&#29983;&#20135;&#32593;&#32476;&#20013;&#30340;&#20381;&#36182;&#20851;&#31995;&#21487;&#33021;&#23548;&#33268;&#22810;&#20010;&#22320;&#21306;&#30340;&#30701;&#32570;&#65292;&#36825;&#22312;&#20420;&#20044;&#20914;&#31361;&#23545;&#20840;&#29699;&#31918;&#39135;&#20379;&#24212;&#30340;&#24433;&#21709;&#20013;&#24471;&#21040;&#20102;&#35777;&#23454;&#12290;&#26412;&#25991;&#20351;&#29992;&#19968;&#20010;&#22810;&#23618;&#27425;&#30340;&#36152;&#26131;(&#30452;&#25509;)&#21644;&#39135;&#21697;&#20135;&#21697;&#36716;&#21270;(&#38388;&#25509;)&#30340;&#32593;&#32476;&#27169;&#22411;&#65292;&#25581;&#31034;&#20102;&#22312;192&#20010;&#22269;&#23478;&#21644;&#22320;&#21306;&#30340;&#20892;&#19994;&#29983;&#20135;&#21457;&#29983;&#23616;&#37096;&#20914;&#20987;&#21518;125&#31181;&#39135;&#21697;&#20135;&#21697;&#30340;&#25439;&#22833;&#24773;&#20917;&#65292;&#20174;&#32780;&#37327;&#21270;&#20102;1&#20159;&#27425; &#20914;&#20987;&#20256;&#25773;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#22312;&#20044;&#20811;&#20848;&#20986;&#29616;&#23436;&#20840;&#20892;&#19994;&#29983;&#20135;&#25439;&#22833;&#30340;&#24773;&#20917;&#19979;&#65292;&#23545;&#20854;&#20182;&#22269;&#23478;&#36896;&#25104;&#30340;&#24433;&#21709;&#26159;&#24322;&#36136;&#30340;&#65292;&#36890;&#36807;&#30452;&#25509;&#25928;&#24212;&#65292;&#23548;&#33268;&#33909;&#33457;&#31869;&#27833;&#21644;&#29577;&#31859;&#30456;&#23545;&#25439;&#22833;&#39640;&#36798;89%&#21644;85%&#65292;&#36890;&#36807;&#38388;&#25509;&#24433;&#21709;&#65292;&#23478;&#31165;&#32905;&#31867;&#30340;&#25439;&#22833;&#39640;&#36798;25%&#12290;&#23613;&#31649;&#20808;&#21069;&#30340;&#30740;&#31350;&#36890;&#24120;&#23558;&#39135;&#21697;&#20135;&#21697;&#23396;&#31435;&#22320;&#22788;&#29702;&#65292;&#24182;&#27809;&#26377;&#32771;&#34385;&#29983;&#20135;&#36807;&#31243;&#20013;&#30340;&#20135;&#21697;&#36716;&#21270;&#65292;&#20294;&#25105;&#20204;&#30340;&#27169;&#22411;&#30740;&#31350;&#20102;&#24403;&#22320;&#20379;&#24212;&#20914;&#20987;&#30340;&#20840;&#29699;&#20256;&#25773;&#65292;&#27839;&#30528;&#29983;&#20135;&#21644;&#36152;&#26131;&#20851;&#31995;&#36827;&#34892;&#27604;&#36739;&#12290;
&lt;/p&gt;
&lt;p&gt;
Dependencies in the global food production network can lead to shortages in numerous regions, as demonstrated by the impacts of the Russia-Ukraine conflict on global food supplies. Here, we reveal the losses of $125$ food products after a localized shock to agricultural production in $192$ countries and territories using a multilayer network model of trade (direct) and conversion of food products (indirect), thereby quantifying $10^8$ shock transmissions. We find that a complete agricultural production loss in Ukraine has heterogeneous impacts on other countries, causing relative losses of up to $89\%$ in sunflower oil and $85\%$ in maize via direct effects, and up to $25\%$ in poultry meat via indirect impacts. Whilst previous studies often treated products in isolation and did not account for product conversion during production, our model studies the global propagation of local supply shocks along both production and trade relations, allowing comparison of different response strateg
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#25968;&#23383;&#31038;&#21306;&#36135;&#24065;Sarafu&#30340;&#20648;&#22791;&#21644;&#27969;&#36890;&#34892;&#20026;&#65292;&#21457;&#29616;&#27969;&#36890;&#21576;&#39640;&#24230;&#27169;&#22359;&#21270;&#21644;&#22320;&#29702;&#23616;&#38480;&#24615;&#24378;&#65292;&#24403;&#22320;&#30340;&#31038;&#21306;&#26426;&#26500;&#26159;&#20419;&#36827;&#27969;&#36890;&#30340;&#37325;&#35201;&#26469;&#28304;&#12290;</title><link>http://arxiv.org/abs/2207.08941</link><description>&lt;p&gt;
&#12298;&#25968;&#23383;&#31038;&#21306;&#36135;&#24065;&#30340;&#27969;&#36716;&#12299;
&lt;/p&gt;
&lt;p&gt;
Circulation of a digital community currency. (arXiv:2207.08941v2 [physics.soc-ph] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2207.08941
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#25968;&#23383;&#31038;&#21306;&#36135;&#24065;Sarafu&#30340;&#20648;&#22791;&#21644;&#27969;&#36890;&#34892;&#20026;&#65292;&#21457;&#29616;&#27969;&#36890;&#21576;&#39640;&#24230;&#27169;&#22359;&#21270;&#21644;&#22320;&#29702;&#23616;&#38480;&#24615;&#24378;&#65292;&#24403;&#22320;&#30340;&#31038;&#21306;&#26426;&#26500;&#26159;&#20419;&#36827;&#27969;&#36890;&#30340;&#37325;&#35201;&#26469;&#28304;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#27969;&#36890;&#26159;&#19968;&#20010;&#25104;&#21151;&#36135;&#24065;&#20307;&#31995;&#30340;&#29305;&#24449;&#65292;&#19981;&#35770;&#26159;&#31038;&#21306;&#36135;&#24065;&#12289;&#25968;&#23383;&#36135;&#24065;&#36824;&#26159;&#22269;&#23478;&#36135;&#24065;&#12290;&#26412;&#25991;&#25552;&#20986;&#19968;&#31181;&#36866;&#21512;&#20998;&#26512;&#25968;&#23383;&#20132;&#26131;&#35760;&#24405;&#26469;&#30740;&#31350;&#36135;&#24065;&#27969;&#36890;&#30340;&#32593;&#32476;&#20998;&#26512;&#26041;&#27861;&#12290;Sarafu&#26159;&#19968;&#31181;&#25968;&#23383;&#31038;&#21306;&#36135;&#24065;&#65292;&#26366;&#22312;&#32943;&#23612;&#20122;&#27969;&#36890;&#65292;&#26399;&#38388;&#22240;COVID-19&#30123;&#24773;&#23548;&#33268;&#32463;&#27982;&#21095;&#28872;&#21160;&#33633;&#12290;&#25105;&#20204;&#25226;Sarafu&#30340;&#27969;&#36890;&#34920;&#31034;&#20026;4&#19975;&#21517;&#29992;&#25143;&#20043;&#38388;&#36135;&#24065;&#27969;&#21160;&#30340;&#32593;&#32476;&#12290;&#32593;&#32476;&#27969;&#37327;&#20998;&#26512;&#26174;&#31034;Sarafu&#30340;&#27969;&#36890;&#39640;&#24230;&#27169;&#22359;&#21270;&#65292;&#22320;&#29702;&#23616;&#38480;&#24615;&#24378;&#65292;&#21442;&#19982;&#27969;&#36890;&#30340;&#20154;&#26469;&#33258;&#19981;&#21516;&#30340;&#32844;&#19994;&#32676;&#20307;&#12290;&#22312;&#26412;&#22320;&#21270;&#30340;&#23376;&#32676;&#20013;&#65292;&#32593;&#32476;&#24490;&#29615;&#20998;&#26512;&#25903;&#25345;&#27969;&#36890;&#38656;&#35201;&#24490;&#29615;&#30340;&#30452;&#35273;&#12290;&#27492;&#22806;&#65292;&#25903;&#25345;&#27969;&#36890;&#30340;&#23376;&#32593;&#32476;&#22987;&#32456;&#20855;&#26377;&#24230;&#30340;&#21453;&#21305;&#37197;&#24615;&#65292;&#25105;&#20204;&#36824;&#21457;&#29616;&#20102;&#35777;&#25454;&#34920;&#26126;&#29992;&#25143;&#24448;&#24448;&#20250;&#20559;&#21521;&#36873;&#25321;&#24615;&#30340;&#20114;&#30456;&#20132;&#26131;&#12290;&#22522;&#20110;&#31038;&#21306;&#30340;&#26426;&#26500;&#36890;&#24120;&#25198;&#28436;&#30528;&#24403;&#22320;&#26530;&#32445;&#30340;&#35282;&#33394;&#12290;
&lt;/p&gt;
&lt;p&gt;
Circulation is the characteristic feature of successful currency systems, from community currencies to cryptocurrencies to national currencies. In this paper, we propose a network analysis approach especially suited for studying circulation given a system's digital transaction records. Sarafu is a digital community currency that was active in Kenya over a period that saw considerable economic disruption due to the COVID-19 pandemic. We represent its circulation as a network of monetary flow among the 40,000 Sarafu users. Network flow analysis reveals that circulation was highly modular, geographically localized, and occurring among users with diverse livelihoods. Across localized sub-populations, network cycle analysis supports the intuitive notion that circulation requires cycles. Moreover, the sub-networks underlying circulation are consistently degree disassortative and we find evidence of preferential attachment. Community-based institutions often take on the role of local hubs, an
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#22312;&#21327;&#21464;&#37327;&#33258;&#36866;&#24212;&#38543;&#26426;&#21270;&#20013;&#22914;&#20309;&#20351;&#29992;&#22238;&#24402;&#35843;&#25972;&#25552;&#39640;&#25928;&#29575;&#65292;&#24182;&#25552;&#20986;&#20102;&#26368;&#20248;&#32447;&#24615;&#35843;&#25972;&#21644;&#38750;&#32447;&#24615;&#35843;&#25972;&#26041;&#27861;&#65292;&#36825;&#20123;&#26041;&#27861;&#27604;&#27809;&#26377;&#35843;&#25972;&#30340;&#26041;&#27861;&#20135;&#29983;&#26356;&#39640;&#25928;&#30340;&#20272;&#35745;&#20540;&#12290;</title><link>http://arxiv.org/abs/2201.13004</link><description>&lt;p&gt;
&#21033;&#29992;&#22238;&#24402;&#35843;&#25972;&#25552;&#39640;&#21327;&#21464;&#37327;&#33258;&#36866;&#24212;&#38543;&#26426;&#21270;&#20013;&#30340;&#20272;&#35745;&#25928;&#29575;&#65288;&#24102;&#26377;&#19981;&#23436;&#32654;&#36981;&#20174;&#24615;&#65289;
&lt;/p&gt;
&lt;p&gt;
Improving Estimation Efficiency via Regression-Adjustment in Covariate-Adaptive Randomizations with Imperfect Compliance. (arXiv:2201.13004v5 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2201.13004
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#22312;&#21327;&#21464;&#37327;&#33258;&#36866;&#24212;&#38543;&#26426;&#21270;&#20013;&#22914;&#20309;&#20351;&#29992;&#22238;&#24402;&#35843;&#25972;&#25552;&#39640;&#25928;&#29575;&#65292;&#24182;&#25552;&#20986;&#20102;&#26368;&#20248;&#32447;&#24615;&#35843;&#25972;&#21644;&#38750;&#32447;&#24615;&#35843;&#25972;&#26041;&#27861;&#65292;&#36825;&#20123;&#26041;&#27861;&#27604;&#27809;&#26377;&#35843;&#25972;&#30340;&#26041;&#27861;&#20135;&#29983;&#26356;&#39640;&#25928;&#30340;&#20272;&#35745;&#20540;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#22914;&#20309;&#22312;&#23384;&#22312;&#19981;&#23436;&#32654;&#21463;&#35797;&#32773;&#36981;&#20174;&#24615;&#30340;&#21327;&#21464;&#37327;&#33258;&#36866;&#24212;&#38543;&#26426;&#21270;&#65288;CAR&#65289;&#20013;&#65292;&#20351;&#29992;&#22238;&#24402;&#35843;&#25972;&#19982;&#21327;&#21464;&#37327;&#26469;&#25552;&#39640;&#25928;&#29575;&#12290;&#25105;&#20204;&#30340;&#22238;&#24402;&#35843;&#25972;&#20272;&#35745;&#37327;&#22522;&#20110;&#23616;&#37096;&#24179;&#22343;&#27835;&#30103;&#25928;&#24212;&#30340;&#21452;&#37325;&#31283;&#20581;&#30697;&#65292;&#21363;&#20351;&#22312;&#23384;&#22312;&#24322;&#36136;&#30340;&#20998;&#37197;&#27010;&#29575;&#21644;&#38169;&#35823;&#30340;&#22238;&#24402;&#35843;&#25972;&#24773;&#20917;&#19979;&#65292;&#20063;&#26159;&#19968;&#33268;&#19988;&#28176;&#36817;&#27491;&#24120;&#30340;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26368;&#20248;&#30340;&#32447;&#24615;&#35843;&#25972;&#26041;&#27861;&#65292;&#20294;&#21487;&#33021;&#23384;&#22312;&#22238;&#24402;&#27169;&#22411;&#38169;&#35823;&#65292;&#36890;&#36807;&#38750;&#32447;&#24615;&#35843;&#25972;&#36827;&#19968;&#27493;&#25552;&#39640;&#25928;&#29575;&#65292;&#36825;&#20004;&#31181;&#35843;&#25972;&#26041;&#27861;&#37117;&#27604;&#27809;&#26377;&#35843;&#25972;&#30340;&#26041;&#27861;&#20135;&#29983;&#26356;&#39640;&#25928;&#30340;&#20272;&#35745;&#20540;&#12290;&#25105;&#20204;&#36824;&#25552;&#20379;&#20102;&#38750;&#21442;&#25968;&#21644;&#27491;&#21017;&#21270;&#35843;&#25972;&#30340;&#26465;&#20214;&#65292;&#20197;&#22312;CARs&#19979;&#36798;&#21040;&#21322;&#21442;&#25968;&#25928;&#29575;&#30028;&#38480;&#12290;
&lt;/p&gt;
&lt;p&gt;
We investigate how to improve efficiency using regression adjustments with covariates in covariate-adaptive randomizations (CARs) with imperfect subject compliance. Our regression-adjusted estimators, which are based on the doubly robust moment for local average treatment effects, are consistent and asymptotically normal even with heterogeneous probability of assignment and misspecified regression adjustments. We propose an optimal but potentially misspecified linear adjustment and its further improvement via a nonlinear adjustment, both of which lead to more efficient estimators than the one without adjustments. We also provide conditions for nonparametric and regularized adjustments to achieve the semiparametric efficiency bound under CARs.
&lt;/p&gt;</description></item><item><title>&#20080;&#23478;&#21644;&#21334;&#23478;&#22312;&#35752;&#20215;&#36824;&#20215;&#36807;&#31243;&#20013;&#65292;&#22768;&#26395;&#28608;&#21169;&#21487;&#33021;&#23548;&#33268;&#20302;&#25928;&#25216;&#26415;&#37319;&#32435;&#21644;&#36798;&#25104;&#21327;&#35758;&#30340;&#26174;&#33879;&#24310;&#36831;&#12290;</title><link>http://arxiv.org/abs/2201.01827</link><description>&lt;p&gt;
&#22768;&#26395;&#21338;&#24328;&#19982;&#20302;&#25928;&#25216;&#26415;&#37319;&#32435;
&lt;/p&gt;
&lt;p&gt;
Reputational Bargaining and Inefficient Technology Adoption. (arXiv:2201.01827v2 [econ.TH] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2201.01827
&lt;/p&gt;
&lt;p&gt;
&#20080;&#23478;&#21644;&#21334;&#23478;&#22312;&#35752;&#20215;&#36824;&#20215;&#36807;&#31243;&#20013;&#65292;&#22768;&#26395;&#28608;&#21169;&#21487;&#33021;&#23548;&#33268;&#20302;&#25928;&#25216;&#26415;&#37319;&#32435;&#21644;&#36798;&#25104;&#21327;&#35758;&#30340;&#26174;&#33879;&#24310;&#36831;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#19968;&#20010;&#20080;&#23478;&#21644;&#19968;&#20010;&#21334;&#23478;&#23601;&#29289;&#21697;&#30340;&#20215;&#26684;&#36827;&#34892;&#35752;&#20215;&#36824;&#20215;&#12290;&#21452;&#26041;&#37117;&#21487;&#20197;&#36890;&#36807;&#19968;&#30452;&#25253;&#20986;&#30456;&#21516;&#30340;&#20215;&#26684;&#26469;&#24314;&#31435;&#19981;&#23624;&#19981;&#25376;&#30340;&#22768;&#26395;&#12290;&#22312;&#29609;&#23478;&#36827;&#34892;&#35752;&#20215;&#36824;&#20215;&#20043;&#21069;&#65292;&#21334;&#23478;&#20915;&#23450;&#26159;&#21542;&#37319;&#29992;&#19968;&#39033;&#21487;&#20197;&#38477;&#20302;&#20182;&#30340;&#29983;&#20135;&#25104;&#26412;&#30340;&#26032;&#25216;&#26415;&#65292;&#32780;&#20080;&#23478;&#26080;&#27861;&#35266;&#23519;&#21040;&#36825;&#20010;&#37319;&#32435;&#20915;&#31574;&#12290;&#25105;&#20204;&#34920;&#26126;&#65292;&#29609;&#23478;&#30340;&#22768;&#26395;&#28608;&#21169;&#21487;&#33021;&#23548;&#33268;&#20302;&#25928;&#30340;&#37319;&#32435;&#20197;&#21450;&#36798;&#25104;&#21327;&#35758;&#30340;&#26174;&#33879;&#24310;&#36831;&#65292;&#24182;&#19988;&#22914;&#26524;&#19988;&#20165;&#22914;&#26524;&#37319;&#32435;&#30340;&#31038;&#20250;&#25928;&#30410;&#36275;&#22815;&#22823;&#65292;&#37027;&#20040;&#36825;&#20123;&#20302;&#25928;&#29575;&#20250;&#22312;&#22343;&#34913;&#29366;&#24577;&#19979;&#20986;&#29616;&#12290;&#22240;&#27492;&#65292;&#37319;&#32435;&#30340;&#31038;&#20250;&#25928;&#30410;&#30340;&#22686;&#21152;&#21487;&#33021;&#23548;&#33268;&#37319;&#32435;&#27010;&#29575;&#38477;&#20302;&#65292;&#39044;&#26399;&#24310;&#36831;&#26102;&#38388;&#21464;&#38271;&#12290;
&lt;/p&gt;
&lt;p&gt;
A buyer and a seller bargain over the price of an object. Both players can build reputations for being obstinate by offering the same price over time. Before players bargain, the seller decides whether to adopt a new technology that can lower his production cost and the buyer cannot observe this adoption decision. We show that players' reputational incentives can lead to inefficient adoption and significant delays in reaching agreement, and that these inefficiencies arise in equilibrium if and only if the social benefit from adoption is large enough. As a result, an increase in the social benefit from adoption may lead to a lower adoption probability and a longer expected delay.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#40065;&#26834;&#20272;&#35745;&#26041;&#27861;&#26469;&#35299;&#20915;&#21160;&#24577;&#27835;&#30103;&#25928;&#24212;&#20272;&#35745;&#20013;&#30340;&#25361;&#25112;&#65292;&#25552;&#39640;&#20102;&#22312;&#27169;&#22411;&#38169;&#35823;&#19979;&#30340;&#39640;&#32500;&#29615;&#22659;&#20013;&#30340;&#20272;&#35745;&#40065;&#26834;&#24615;&#21644;&#21487;&#38752;&#24615;&#12290;</title><link>http://arxiv.org/abs/2111.06818</link><description>&lt;p&gt;
&#21160;&#24577;&#27835;&#30103;&#25928;&#24212;&#65306;&#27169;&#22411;&#38169;&#35823;&#19979;&#30340;&#39640;&#32500;&#25512;&#26029;
&lt;/p&gt;
&lt;p&gt;
Dynamic treatment effects: high-dimensional inference under model misspecification. (arXiv:2111.06818v2 [stat.ME] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2111.06818
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#40065;&#26834;&#20272;&#35745;&#26041;&#27861;&#26469;&#35299;&#20915;&#21160;&#24577;&#27835;&#30103;&#25928;&#24212;&#20272;&#35745;&#20013;&#30340;&#25361;&#25112;&#65292;&#25552;&#39640;&#20102;&#22312;&#27169;&#22411;&#38169;&#35823;&#19979;&#30340;&#39640;&#32500;&#29615;&#22659;&#20013;&#30340;&#20272;&#35745;&#40065;&#26834;&#24615;&#21644;&#21487;&#38752;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20272;&#35745;&#21160;&#24577;&#27835;&#30103;&#25928;&#24212;&#22312;&#21508;&#20010;&#23398;&#31185;&#20013;&#37117;&#26159;&#33267;&#20851;&#37325;&#35201;&#30340;&#65292;&#21487;&#20197;&#25552;&#20379;&#26377;&#20851;&#24178;&#39044;&#30340;&#26102;&#21464;&#22240;&#26524;&#24433;&#21709;&#30340;&#24494;&#22937;&#35265;&#35299;&#12290;&#28982;&#32780;&#65292;&#30001;&#20110;&#8220;&#32500;&#25968;&#28798;&#38590;&#8221;&#21644;&#26102;&#21464;&#28151;&#26434;&#30340;&#23384;&#22312;&#65292;&#36825;&#31181;&#20272;&#35745;&#23384;&#22312;&#30528;&#25361;&#25112;&#65292;&#21487;&#33021;&#23548;&#33268;&#20272;&#35745;&#20559;&#35823;&#12290;&#27492;&#22806;&#65292;&#27491;&#30830;&#22320;&#35268;&#23450;&#26085;&#30410;&#22686;&#22810;&#30340;&#27835;&#30103;&#20998;&#37197;&#21644;&#22810;&#37325;&#26292;&#38706;&#30340;&#32467;&#26524;&#27169;&#22411;&#20284;&#20046;&#36807;&#20110;&#22797;&#26434;&#12290;&#37492;&#20110;&#36825;&#20123;&#25361;&#25112;&#65292;&#21452;&#37325;&#40065;&#26834;&#24615;&#30340;&#27010;&#24565;&#65292;&#22312;&#20801;&#35768;&#27169;&#22411;&#38169;&#35823;&#30340;&#24773;&#20917;&#19979;&#65292;&#26159;&#38750;&#24120;&#26377;&#20215;&#20540;&#30340;&#65292;&#28982;&#32780;&#22312;&#23454;&#38469;&#24212;&#29992;&#20013;&#24182;&#27809;&#26377;&#23454;&#29616;&#12290;&#26412;&#25991;&#36890;&#36807;&#25552;&#20986;&#26032;&#30340;&#40065;&#26834;&#20272;&#35745;&#26041;&#27861;&#26469;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;&#21516;&#26102;&#23545;&#27835;&#30103;&#20998;&#37197;&#21644;&#32467;&#26524;&#27169;&#22411;&#36827;&#34892;&#40065;&#26834;&#20272;&#35745;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#8220;&#24207;&#21015;&#27169;&#22411;&#21452;&#37325;&#40065;&#26834;&#24615;&#8221;&#30340;&#35299;&#20915;&#26041;&#26696;&#65292;&#35777;&#26126;&#20102;&#24403;&#27599;&#20010;&#26102;&#38388;&#26292;&#38706;&#37117;&#26159;&#21452;&#37325;&#40065;&#26834;&#24615;&#30340;&#26102;&#65292;&#21487;&#20197;&#22312;&#22810;&#20010;&#26102;&#38388;&#28857;&#19978;&#23454;&#29616;&#21452;&#37325;&#40065;&#26834;&#24615;&#12290;&#36825;&#31181;&#26041;&#27861;&#25552;&#39640;&#20102;&#39640;&#32500;&#29615;&#22659;&#19979;&#21160;&#24577;&#27835;&#30103;&#25928;&#24212;&#20272;&#35745;&#30340;&#40065;&#26834;&#24615;&#21644;&#21487;&#38752;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Estimating dynamic treatment effects is essential across various disciplines, offering nuanced insights into the time-dependent causal impact of interventions. However, this estimation presents challenges due to the "curse of dimensionality" and time-varying confounding, which can lead to biased estimates. Additionally, correctly specifying the growing number of treatment assignments and outcome models with multiple exposures seems overly complex. Given these challenges, the concept of double robustness, where model misspecification is permitted, is extremely valuable, yet unachieved in practical applications. This paper introduces a new approach by proposing novel, robust estimators for both treatment assignments and outcome models. We present a "sequential model double robust" solution, demonstrating that double robustness over multiple time points can be achieved when each time exposure is doubly robust. This approach improves the robustness and reliability of dynamic treatment effe
&lt;/p&gt;</description></item></channel></rss>