<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#21435;&#20013;&#24515;&#21270;&#25215;&#35834;&#23545;&#27665;&#20027;&#20915;&#31574;&#30340;&#24433;&#21709;&#12290;&#22312;&#25237;&#31080;&#21069;&#65292;&#22996;&#21592;&#20250;&#25104;&#21592;&#21487;&#20197;&#36827;&#34892;&#21487;&#25191;&#34892;&#30340;&#25215;&#35834;&#12290;&#21487;&#33021;&#38656;&#35201;&#36328;&#36234;&#38453;&#33829;&#36827;&#34892;&#25215;&#35834;&#65292;&#20197;&#23454;&#29616;&#25913;&#38761;&#30340;&#23454;&#26045;&#65292;&#21516;&#26102;&#38656;&#35201;&#25490;&#38500;&#26368;&#19981;&#28909;&#34935;&#20110;&#25913;&#38761;&#30340;&#25903;&#25345;&#32773;&#34987;&#35825;&#23548;&#25512;&#32763;&#20915;&#23450;&#12290;</title><link>http://arxiv.org/abs/2304.08008</link><description>&lt;p&gt;
&#22522;&#20110;&#25237;&#31080;&#32467;&#26524;&#30340;&#21435;&#20013;&#24515;&#21270;&#25215;&#35834;&#23545;&#27665;&#20027;&#20915;&#31574;&#30340;&#24433;&#21709;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Democratic Policy Decisions with Decentralized Promises Contingent on Vote Outcome. (arXiv:2304.08008v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.08008
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#21435;&#20013;&#24515;&#21270;&#25215;&#35834;&#23545;&#27665;&#20027;&#20915;&#31574;&#30340;&#24433;&#21709;&#12290;&#22312;&#25237;&#31080;&#21069;&#65292;&#22996;&#21592;&#20250;&#25104;&#21592;&#21487;&#20197;&#36827;&#34892;&#21487;&#25191;&#34892;&#30340;&#25215;&#35834;&#12290;&#21487;&#33021;&#38656;&#35201;&#36328;&#36234;&#38453;&#33829;&#36827;&#34892;&#25215;&#35834;&#65292;&#20197;&#23454;&#29616;&#25913;&#38761;&#30340;&#23454;&#26045;&#65292;&#21516;&#26102;&#38656;&#35201;&#25490;&#38500;&#26368;&#19981;&#28909;&#34935;&#20110;&#25913;&#38761;&#30340;&#25903;&#25345;&#32773;&#34987;&#35825;&#23548;&#25512;&#32763;&#20915;&#23450;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25506;&#35752;&#20102;&#21435;&#20013;&#24515;&#21270;&#30340;&#25928;&#29992;&#36716;&#31227;&#25215;&#35834;&#22914;&#20309;&#24433;&#21709;&#25237;&#31080;&#26041;&#24335;&#30340;&#38598;&#20307;&#20915;&#31574;&#12290;&#22312;&#25237;&#31080;&#21069;&#65292;&#25903;&#25345;&#21644;&#21453;&#23545;&#39640;&#25928;&#25913;&#38761;&#30340;&#22996;&#21592;&#20250;&#25104;&#21592;&#21487;&#20197;&#36827;&#34892;&#21487;&#25191;&#34892;&#30340;&#25215;&#35834;&#12290;&#19968;&#20010;&#22343;&#34913;&#38656;&#35201;&#31283;&#23450;&#24615;&#21644;&#26368;&#23567;&#21270;&#30340;&#25215;&#35834;&#12290;&#24179;&#34913;&#25215;&#35834;&#26159;&#23384;&#22312;&#19988;&#19981;&#30830;&#23450;&#30340;&#65292;&#20294;&#20855;&#26377;&#35768;&#22810;&#20849;&#21516;&#30340;&#29305;&#24449;&#12290;&#38656;&#35201;&#39640;&#24378;&#24230;&#25104;&#21592;&#21521;&#20302;&#24378;&#24230;&#25104;&#21592;&#25552;&#20379;&#36716;&#31227;&#25215;&#35834;&#65292;&#24182;&#23548;&#33268;&#25913;&#38761;&#30340;&#23454;&#26045;&#12290;&#24403;&#25913;&#38761;&#25903;&#25345;&#32773;&#32570;&#20047;&#36275;&#22815;&#30340;&#25237;&#31080;&#26435;&#26102;&#65292;&#25215;&#35834;&#24517;&#39035;&#36328;&#36234;&#38453;&#33829;&#12290;&#21363;&#20351;&#25913;&#38761;&#25903;&#25345;&#32773;&#30340;&#32852;&#30431;&#26159;&#20915;&#23450;&#24615;&#30340;&#65292;&#25215;&#35834;&#20063;&#24517;&#39035;&#25490;&#38500;&#26368;&#19981;&#28909;&#34935;&#20110;&#25913;&#38761;&#30340;&#25903;&#25345;&#32773;&#34987;&#35825;&#23548;&#25512;&#32763;&#20915;&#23450;&#12290;&#22312;&#36825;&#31181;&#24773;&#20917;&#19979;&#65292;&#24179;&#34913;&#30340;&#25215;&#35834;&#19981;&#38656;&#35201;&#36328;&#36234;&#38453;&#33829;&#12290;&#25105;&#20204;&#36824;&#35752;&#35770;&#20102;&#19968;&#31995;&#21015;&#26377;&#38480;&#30340;&#25215;&#35834;&#65292;&#23454;&#29616;&#36798;&#21040;&#19968;&#20010;&#24179;&#34913;&#30340;&#29366;&#24577;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study how decentralized utility transfer promises affect collective decision-making by voting. Committee members with varying levels of support and opposition for an efficient reform can make enforceable promises before voting. An equilibrium requires stability and minimal promises. Equilibrium promises exist and are indeterminate, but do share several key characteristics. Equilibria require transfer promises from high to low intensity members and result in enacting the reform. When reform supporters lack sufficient voting power, promises must reach across the aisle. Even if the coalition of reform supporters is decisive, promises must preclude the least enthusiastic supporters of the reform from being enticed to overturn the decision. In that case, equilibrium promises do not need to reach across the aisle. We also discuss a finite sequence of promises that achieve an equilibrium.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#36793;&#32536;&#20998;&#24067;&#30340;&#31616;&#21333;&#32780;&#26377;&#25928;&#30340;&#38750;&#21442;&#25968;&#28040;&#36153;&#32773;&#36873;&#25321;&#24314;&#27169;&#26041;&#27861;&#65292;&#22312;&#20219;&#20309;&#36873;&#25321;&#38598;&#21512;&#20013;&#20250;&#25226;&#36873;&#25321;&#27010;&#29575;&#30340;&#38598;&#21512;&#19968;&#33268;&#22320;&#25551;&#36848;&#20986;&#26469;&#12290;</title><link>http://arxiv.org/abs/2208.06115</link><description>&lt;p&gt;
&#22522;&#20110;&#36793;&#32536;&#20998;&#24067;&#30340;&#38750;&#21442;&#25968;&#28040;&#36153;&#32773;&#36873;&#25321;&#24314;&#27169;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
A Nonparametric Approach with Marginals for Modeling Consumer Choice. (arXiv:2208.06115v2 [stat.ML] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2208.06115
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#36793;&#32536;&#20998;&#24067;&#30340;&#31616;&#21333;&#32780;&#26377;&#25928;&#30340;&#38750;&#21442;&#25968;&#28040;&#36153;&#32773;&#36873;&#25321;&#24314;&#27169;&#26041;&#27861;&#65292;&#22312;&#20219;&#20309;&#36873;&#25321;&#38598;&#21512;&#20013;&#20250;&#25226;&#36873;&#25321;&#27010;&#29575;&#30340;&#38598;&#21512;&#19968;&#33268;&#22320;&#25551;&#36848;&#20986;&#26469;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#37492;&#20110;&#28040;&#36153;&#32773;&#22312;&#19981;&#21516;&#36873;&#25321;&#38598;&#21512;&#20013;&#20316;&#20986;&#36873;&#25321;&#30340;&#25968;&#25454;&#65292;&#24320;&#21457;&#25551;&#36848;&#21644;&#39044;&#27979;&#28040;&#36153;&#32773;&#36873;&#25321;&#34892;&#20026;&#30340;&#31616;&#27905;&#27169;&#22411;&#26159;&#19968;&#20010;&#20027;&#35201;&#25361;&#25112;&#12290;&#20854;&#20013;&#19968;&#31181;&#36873;&#25321;&#27169;&#22411;&#26159;&#36793;&#32536;&#20998;&#24067;&#27169;&#22411;&#65292;&#35813;&#27169;&#22411;&#20165;&#38656;&#35201;&#35268;&#23450;&#38543;&#26426;&#25928;&#29992;&#30340;&#36793;&#32536;&#20998;&#24067;&#21363;&#21487;&#35299;&#37322;&#36873;&#39033;&#25968;&#25454;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#31181;&#31934;&#30830;&#30340;&#36873;&#25321;&#27010;&#29575;&#38598;&#21512;&#30340;&#29305;&#24449;&#21270;&#26041;&#27861;&#65292;&#35813;&#38598;&#21512;&#21487;&#20197;&#22312;&#20219;&#20309;&#38598;&#21512;&#20013;&#19968;&#33268;&#22320;&#36890;&#36807;&#36793;&#32536;&#20998;&#24067;&#27169;&#22411;&#26469;&#25551;&#36848;&#12290;&#20801;&#35768;&#26681;&#25454;&#20854;&#25928;&#29992;&#30340;&#36793;&#32536;&#20998;&#24067;&#23558;&#36873;&#25321;&#38598;&#21512;&#36827;&#34892;&#20998;&#32452;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;(a)&#39564;&#35777;&#36825;&#20010;&#27169;&#22411;&#19982;&#36873;&#25321;&#27010;&#29575;&#25968;&#25454;&#30340;&#19968;&#33268;&#24615;&#22312;&#22810;&#39033;&#24335;&#26102;&#38388;&#20869;&#26159;&#21487;&#33021;&#30340;&#65292;(b)&#26368;&#25509;&#36817;&#25311;&#21512;&#30340;&#26041;&#27861;&#21487;&#20197;&#31616;&#21270;&#20026;&#35299;&#20915;&#28151;&#21512;&#25972;&#25968;&#20984;&#35268;&#21010;&#38382;&#39064;&#12290;&#25105;&#20204;&#30340;&#32467;&#26524;&#34920;&#26126;&#65292;&#19982;&#22810;&#39033;&#24335;Logit&#27169;&#22411;&#21644;m&#30456;&#27604;&#65292;&#36793;&#32536;&#20998;&#24067;&#27169;&#22411;&#25552;&#20379;&#20102;&#26356;&#22909;&#30340;&#34920;&#29616;&#33021;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;
Given data on choices made by consumers for different assortments, a key challenge is to develop parsimonious models that describe and predict consumer choice behavior. One such choice model is the marginal distribution model which requires only the specification of the marginal distributions of the random utilities of the alternatives to explain choice data. In this paper, we develop an exact characterisation of the set of choice probabilities which are representable by the marginal distribution model consistently across any collection of assortments. Allowing for the possibility of alternatives to be grouped based on the marginal distribution of their utilities, we show (a) verifying consistency of choice probability data with this model is possible in polynomial time and (b) finding the closest fit reduces to solving a mixed integer convex program. Our results show that the marginal distribution model provides much better representational power as compared to multinomial logit and m
&lt;/p&gt;</description></item><item><title>&#20998;&#20301;&#25968;&#22238;&#24402;&#21487;&#20197;&#20272;&#35745;&#32676;&#20307;&#25919;&#31574;&#30340;&#24322;&#36136;&#24615;&#25928;&#24212;&#65292;&#23545;&#20998;&#24067;&#25919;&#31574;&#30340;&#24433;&#21709;&#36827;&#34892;&#20998;&#26512;&#65292;&#26412;&#25991;&#20351;&#29992;&#24046;&#24322;&#27861;&#23558;&#20854;&#24212;&#29992;&#20110;&#35780;&#20272;&#32654;&#22269;&#26368;&#20302;&#24037;&#36164;&#25919;&#31574;&#23545;&#25910;&#20837;&#19981;&#24179;&#31561;&#24615;&#30340;&#24433;&#21709;&#65292;&#32467;&#26524;&#21457;&#29616;&#26368;&#20302;&#24037;&#36164;&#25919;&#31574;&#23545;&#19981;&#24179;&#31561;&#24615;&#36896;&#25104;&#20102;&#26174;&#33879;&#30340;&#36127;&#38754;&#24433;&#21709;&#65292;&#20294;&#23545;&#20869;&#22312;&#19981;&#24179;&#31561;&#24615;&#30340;&#24433;&#21709;&#36739;&#23567;&#12290;</title><link>http://arxiv.org/abs/2208.03632</link><description>&lt;p&gt;
&#21033;&#29992;&#20132;&#20114;&#22266;&#23450;&#25928;&#24212;&#30340;&#20998;&#20301;&#25968;&#22238;&#24402;&#20272;&#35745;&#24322;&#36136;&#24615;&#22788;&#29702;&#25928;&#24212;
&lt;/p&gt;
&lt;p&gt;
Estimation of Heterogeneous Treatment Effects Using Quantile Regression with Interactive Fixed Effects. (arXiv:2208.03632v2 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2208.03632
&lt;/p&gt;
&lt;p&gt;
&#20998;&#20301;&#25968;&#22238;&#24402;&#21487;&#20197;&#20272;&#35745;&#32676;&#20307;&#25919;&#31574;&#30340;&#24322;&#36136;&#24615;&#25928;&#24212;&#65292;&#23545;&#20998;&#24067;&#25919;&#31574;&#30340;&#24433;&#21709;&#36827;&#34892;&#20998;&#26512;&#65292;&#26412;&#25991;&#20351;&#29992;&#24046;&#24322;&#27861;&#23558;&#20854;&#24212;&#29992;&#20110;&#35780;&#20272;&#32654;&#22269;&#26368;&#20302;&#24037;&#36164;&#25919;&#31574;&#23545;&#25910;&#20837;&#19981;&#24179;&#31561;&#24615;&#30340;&#24433;&#21709;&#65292;&#32467;&#26524;&#21457;&#29616;&#26368;&#20302;&#24037;&#36164;&#25919;&#31574;&#23545;&#19981;&#24179;&#31561;&#24615;&#36896;&#25104;&#20102;&#26174;&#33879;&#30340;&#36127;&#38754;&#24433;&#21709;&#65292;&#20294;&#23545;&#20869;&#22312;&#19981;&#24179;&#31561;&#24615;&#30340;&#24433;&#21709;&#36739;&#23567;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#20351;&#29992;&#20132;&#20114;&#22266;&#23450;&#25928;&#24212;&#30340;&#20998;&#20301;&#25968;&#22238;&#24402;&#26469;&#20272;&#35745;&#32676;&#20307;&#23618;&#38754;&#25919;&#31574;&#30340;&#24322;&#36136;&#24615;&#25928;&#24212;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#21487;&#20197;&#30830;&#23450;&#20998;&#24067;&#25919;&#31574;&#30340;&#25928;&#24212;&#65292;&#29305;&#21035;&#26159;&#23545;&#19981;&#24179;&#31561;&#24615;&#30340;&#24433;&#21709;&#65292;&#22522;&#20110;&#19968;&#31181;&#24046;&#24322;&#27861;&#30340;&#20551;&#35774;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#25105;&#20204;&#20272;&#35745;&#22120;&#30340;&#28176;&#36817;&#24615;&#36136;&#21644;&#19968;&#31181;&#25512;&#26029;&#26041;&#27861;&#12290;&#25105;&#20204;&#24212;&#29992;&#35813;&#27169;&#22411;&#26469;&#35780;&#20272;&#32654;&#22269;1967&#24180;&#33267;1980&#24180;&#20043;&#38388;&#26368;&#20302;&#24037;&#36164;&#25919;&#31574;&#23545;&#25910;&#20837;&#30340;&#24433;&#21709;&#12290;&#25105;&#20204;&#30340;&#32467;&#26524;&#34920;&#26126;&#65292;&#26368;&#20302;&#24037;&#36164;&#25919;&#31574;&#23545;&#19981;&#24179;&#31561;&#24615;&#36896;&#25104;&#20102;&#26174;&#33879;&#30340;&#36127;&#38754;&#24433;&#21709;&#65292;&#20294;&#23545;&#20869;&#22312;&#19981;&#24179;&#31561;&#24615;&#30340;&#24433;&#21709;&#36739;&#23567;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study the estimation of heterogeneous effects of group-level policies, using quantile regression with interactive fixed effects. Our approach can identify distributional policy effects, particularly effects on inequality, under a type of difference-in-differences assumption. We provide asymptotic properties of our estimators and an inferential method. We apply the model to evaluate the effect of the minimum wage policy on earnings between 1967 and 1980 in the United States. Our results suggest that the minimum wage policy has a significant negative impact on the between-inequality but little effect on the within-inequality.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#20462;&#27491;CD&#26816;&#39564;&#30340;&#26032;&#26041;&#27861;CD*&#65292;&#36866;&#29992;&#20110;&#32431;&#28508;&#22312;&#22240;&#32032;&#27169;&#22411;&#20197;&#21450;&#38754;&#26495;&#22238;&#24402;&#65292;&#20855;&#26377;&#28176;&#36817;&#27491;&#24577;&#24615;&#65292;&#30456;&#27604;&#20110;&#29616;&#26377;&#26041;&#27861;&#20855;&#26377;&#26356;&#22909;&#30340;&#24615;&#33021;&#12290;</title><link>http://arxiv.org/abs/2109.00408</link><description>&lt;p&gt;
&#20462;&#27491;&#28508;&#22312;&#22240;&#32032;&#38754;&#26495;&#25968;&#25454;&#27169;&#22411;&#20013;&#35823;&#24046;&#20132;&#21449;&#30456;&#20851;&#30340;CD&#26816;&#39564;
&lt;/p&gt;
&lt;p&gt;
A Bias-Corrected CD Test for Error Cross-Sectional Dependence in Panel Data Models with Latent Factors. (arXiv:2109.00408v3 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2109.00408
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#20462;&#27491;CD&#26816;&#39564;&#30340;&#26032;&#26041;&#27861;CD*&#65292;&#36866;&#29992;&#20110;&#32431;&#28508;&#22312;&#22240;&#32032;&#27169;&#22411;&#20197;&#21450;&#38754;&#26495;&#22238;&#24402;&#65292;&#20855;&#26377;&#28176;&#36817;&#27491;&#24577;&#24615;&#65292;&#30456;&#27604;&#20110;&#29616;&#26377;&#26041;&#27861;&#20855;&#26377;&#26356;&#22909;&#30340;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#38024;&#23545;&#28508;&#22312;&#22240;&#32032;&#38754;&#26495;&#25968;&#25454;&#27169;&#22411;&#20013;&#30340;&#35823;&#24046;&#20132;&#21449;&#30456;&#20851;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#31616;&#21333;&#30340;CD*&#26816;&#39564;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#26159;&#28176;&#36817;&#27491;&#24577;&#30340;&#65292;&#36866;&#29992;&#20110;&#32431;&#28508;&#22312;&#22240;&#32032;&#27169;&#22411;&#20197;&#21450;&#38754;&#26495;&#22238;&#24402;&#12290;&#36890;&#36807;Monte Carlo&#23454;&#39564;&#30740;&#31350;&#20102;CD*&#26816;&#39564;&#30340;&#23567;&#26679;&#26412;&#24615;&#36136;&#65292;&#32467;&#26524;&#34920;&#26126;&#35813;&#26816;&#39564;&#20855;&#26377;&#27491;&#30830;&#30340;&#22823;&#23567;&#21644;&#20196;&#20154;&#28385;&#24847;&#30340;&#21151;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;
In a recent paper Juodis and Reese (2021) (JR) show that the application of the CD test proposed by Pesaran (2004) to residuals from panels with latent factors results in over-rejection and propose a randomized test statistic to correct for over-rejection, and add a screening component to achieve power. This paper considers the same problem but from a different perspective and shows that the standard CD test remains valid if the latent factors are weak, and proposes a simple bias-corrected CD test, labelled CD*, which is shown to be asymptotically normal, irrespective of whether the latent factors are weak or strong. This result is shown to hold for pure latent factor models as well as for panel regressions with latent factors. Small sample properties of the CD* test are investigated by Monte Carlo experiments and are shown to have the correct size and satisfactory power for both Gaussian and non-Gaussian errors. In contrast, it is found that JR's test tends to over-reject in the case 
&lt;/p&gt;</description></item></channel></rss>