<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#26412;&#25991;&#37325;&#26032;&#20998;&#26512;&#20102;Khanna (2023)&#30340;&#30740;&#31350;&#65292;&#25351;&#20986;&#32570;&#22833;&#25968;&#25454;&#21450;&#32472;&#22270;&#36719;&#20214;&#31561;&#22240;&#32032;&#23545;&#32467;&#26524;&#36896;&#25104;&#20102;&#24178;&#25200;&#65292;&#34920;&#26126;&#20182;&#20204;&#20043;&#21069;&#30340;&#32467;&#35770;&#19981;&#33021;&#34987;&#26377;&#25928;&#25903;&#25345;&#12290;</title><link>http://arxiv.org/abs/2303.11956</link><description>&lt;p&gt;
&#22522;&#20110;&#19968;&#33324;&#22343;&#34913;&#30340;&#22823;&#35268;&#27169;&#25945;&#32946;&#25913;&#38761;&#65306;&#21360;&#24230;&#22238;&#24402;&#19981;&#36830;&#32493;&#35777;&#25454;&#30340;&#35780;&#35770;
&lt;/p&gt;
&lt;p&gt;
Large-Scale Education Reform in General Equilibrium: Regression Discontinuity Evidence from India: Comment. (arXiv:2303.11956v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.11956
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#37325;&#26032;&#20998;&#26512;&#20102;Khanna (2023)&#30340;&#30740;&#31350;&#65292;&#25351;&#20986;&#32570;&#22833;&#25968;&#25454;&#21450;&#32472;&#22270;&#36719;&#20214;&#31561;&#22240;&#32032;&#23545;&#32467;&#26524;&#36896;&#25104;&#20102;&#24178;&#25200;&#65292;&#34920;&#26126;&#20182;&#20204;&#20043;&#21069;&#30340;&#32467;&#35770;&#19981;&#33021;&#34987;&#26377;&#25928;&#25903;&#25345;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#37325;&#26032;&#20998;&#26512;&#20102; Khanna (2023) &#20013;&#36890;&#36807;&#22238;&#24402;&#19981;&#36830;&#32493;&#35774;&#35745;&#30740;&#31350;&#21360;&#24230;&#25945;&#32946;&#23545;&#21171;&#21160;&#21147;&#24066;&#22330;&#30340;&#24433;&#21709;&#30340;&#20869;&#23481;&#12290;&#22312;&#22270;&#24418;&#21021;&#27493;&#20998;&#26512;&#20013;&#65292;&#21453;&#36716;&#32472;&#22270;&#36719;&#20214;&#40664;&#35748;&#20540;&#30340;&#35206;&#30422;&#26497;&#22823;&#22320;&#20943;&#23569;&#20102;&#19981;&#36830;&#32493;&#24615;&#30340;&#20986;&#29616;&#12290;&#22312;&#25968;&#25454;&#20013;&#32570;&#23569;&#31163;&#19981;&#36830;&#32493;&#28857;&#22235;&#20010;&#34903;&#21306;&#65307;&#20462;&#22797;&#21518;&#21066;&#20943;&#20102;&#23545;&#23398;&#26657;&#21644;&#23545;&#25968;&#24037;&#36164;&#30340;&#31616;&#21270;&#24418;&#24335;&#24433;&#21709;&#20998;&#21035;&#20026;62&#65285;&#21644;75&#65285;&#12290;&#20351;&#29992;&#19968;&#33268;&#30340;&#26041;&#24046;&#20272;&#35745;&#22120;&#65292;&#24182;&#23558;&#20854;&#32858;&#31867;&#22788;&#29702;&#21040;&#22320;&#29702;&#27835;&#30103;&#21333;&#20803;&#65292;&#36827;&#19968;&#27493;&#21066;&#24369;&#20102;&#31215;&#26497;&#24433;&#21709;&#30340;&#25512;&#26029;&#12290;&#19968;&#33324;&#22343;&#34913;&#25928;&#24212;&#21644;&#26367;&#20195;&#24377;&#24615;&#30340;&#20272;&#35745;&#19981;&#26159;&#26080;&#20559;&#30340;&#65292;&#19988;&#26377;&#25928;&#26041;&#24046;&#20026;&#26080;&#38480;&#22823;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper reanalyzes Khanna (2023), which studies labor market effects of schooling in India through a regression discontinuity design. In graphical preliminaries, reversing overrides of the plotting software's defaults greatly reduces the appearance of discontinuities. Absent from the data are four districts close to the discontinuity; restoring them cuts the reduced-form impacts on schooling and log wages by 62% and 75%. Using a consistent variance estimator, and clustering it at the geographic unit of treatment, further weakens the inference of positive impact. The estimates of general equilibrium effects and elasticities of substitution are not unbiased and have effectively infinite variance.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#20010;&#32852;&#21512;&#20154;&#26426;&#20915;&#31574;&#30340;&#22996;&#25176;&#20195;&#29702;&#27169;&#22411;&#65292;&#25506;&#35752;&#20102;&#31639;&#27861;&#25512;&#33616;&#23545;&#36873;&#25321;&#30340;&#24433;&#21709;&#21644;&#35774;&#35745;&#65292;&#29305;&#21035;&#20851;&#27880;&#31639;&#27861;&#23545;&#20559;&#22909;&#30340;&#25913;&#21464;&#65292;&#20197;&#35299;&#20915;&#31639;&#27861;&#36741;&#21161;&#21487;&#33021;&#24102;&#26469;&#30340;&#24847;&#22806;&#21518;&#26524;&#12290;</title><link>http://arxiv.org/abs/2208.07626</link><description>&lt;p&gt;
&#31639;&#27861;&#36741;&#21161;&#19979;&#30340;&#25512;&#33616;&#30456;&#20851;&#20559;&#22909;
&lt;/p&gt;
&lt;p&gt;
Algorithmic Assistance with Recommendation-Dependent Preferences. (arXiv:2208.07626v3 [cs.LG] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2208.07626
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#20010;&#32852;&#21512;&#20154;&#26426;&#20915;&#31574;&#30340;&#22996;&#25176;&#20195;&#29702;&#27169;&#22411;&#65292;&#25506;&#35752;&#20102;&#31639;&#27861;&#25512;&#33616;&#23545;&#36873;&#25321;&#30340;&#24433;&#21709;&#21644;&#35774;&#35745;&#65292;&#29305;&#21035;&#20851;&#27880;&#31639;&#27861;&#23545;&#20559;&#22909;&#30340;&#25913;&#21464;&#65292;&#20197;&#35299;&#20915;&#31639;&#27861;&#36741;&#21161;&#21487;&#33021;&#24102;&#26469;&#30340;&#24847;&#22806;&#21518;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24403;&#31639;&#27861;&#25552;&#20379;&#39118;&#38505;&#35780;&#20272;&#26102;&#65292;&#25105;&#20204;&#36890;&#24120;&#23558;&#20854;&#35270;&#20026;&#23545;&#20154;&#31867;&#20915;&#31574;&#30340;&#26377;&#30410;&#36755;&#20837;&#65292;&#20363;&#22914;&#23558;&#39118;&#38505;&#35780;&#20998;&#21576;&#29616;&#32473;&#27861;&#23448;&#25110;&#21307;&#29983;&#12290;&#28982;&#32780;&#65292;&#20915;&#31574;&#32773;&#21487;&#33021;&#19981;&#20165;&#20165;&#21482;&#38024;&#23545;&#31639;&#27861;&#25552;&#20379;&#30340;&#20449;&#24687;&#20570;&#20986;&#21453;&#24212;&#12290;&#20915;&#31574;&#32773;&#36824;&#21487;&#33021;&#23558;&#31639;&#27861;&#25512;&#33616;&#35270;&#20026;&#40664;&#35748;&#25805;&#20316;&#65292;&#20351;&#20854;&#38590;&#20197;&#20559;&#31163;&#65292;&#20363;&#22914;&#27861;&#23448;&#22312;&#23545;&#34987;&#21578;&#36827;&#34892;&#39640;&#39118;&#38505;&#35780;&#20272;&#30340;&#26102;&#20505;&#19981;&#24895;&#24847;&#25512;&#32763;&#65292;&#25110;&#21307;&#29983;&#25285;&#24515;&#20559;&#31163;&#25512;&#33616;&#30340;&#31243;&#24207;&#20250;&#24102;&#26469;&#21518;&#26524;&#12290;&#20026;&#20102;&#35299;&#20915;&#31639;&#27861;&#36741;&#21161;&#30340;&#36825;&#31181;&#24847;&#22806;&#21518;&#26524;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#32852;&#21512;&#20154;&#26426;&#20915;&#31574;&#30340;&#22996;&#25176;&#20195;&#29702;&#27169;&#22411;&#12290;&#22312;&#35813;&#27169;&#22411;&#20013;&#65292;&#25105;&#20204;&#32771;&#34385;&#20102;&#31639;&#27861;&#25512;&#33616;&#23545;&#36873;&#25321;&#30340;&#24433;&#21709;&#21644;&#35774;&#35745;&#65292;&#36825;&#31181;&#24433;&#21709;&#19981;&#20165;&#20165;&#26159;&#36890;&#36807;&#25913;&#21464;&#20449;&#24565;&#65292;&#36824;&#36890;&#36807;&#25913;&#21464;&#20559;&#22909;&#12290;&#25105;&#20204;&#20174;&#21046;&#24230;&#22240;&#32032;&#21644;&#34892;&#20026;&#32463;&#27982;&#23398;&#20013;&#30340;&#24050;&#26377;&#27169;&#22411;&#31561;&#26041;&#38754;&#36827;&#34892;&#20102;&#36825;&#20010;&#20551;&#35774;&#30340;&#21160;&#26426;&#35770;&#35777;&#12290;
&lt;/p&gt;
&lt;p&gt;
When an algorithm provides risk assessments, we typically think of them as helpful inputs to human decisions, such as when risk scores are presented to judges or doctors. However, a decision-maker may not only react to the information provided by the algorithm. The decision-maker may also view the algorithmic recommendation as a default action, making it costly for them to deviate, such as when a judge is reluctant to overrule a high-risk assessment for a defendant or a doctor fears the consequences of deviating from recommended procedures. To address such unintended consequences of algorithmic assistance, we propose a principal-agent model of joint human-machine decision-making. Within this model, we consider the effect and design of algorithmic recommendations when they affect choices not just by shifting beliefs, but also by altering preferences. We motivate this assumption from institutional factors, such as a desire to avoid audits, as well as from well-established models in behav
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#26041;&#27861;&#20197;&#22312;&#19968;&#23450;&#26102;&#38388;&#27573;&#20869;&#36827;&#34892;&#25919;&#31574;&#36873;&#25321;&#65292;&#36890;&#36807;&#32463;&#39564;&#31119;&#21033;&#26368;&#22823;&#21270;&#26041;&#27861;&#26469;&#20272;&#35745;&#36825;&#19968;&#25919;&#31574;&#35268;&#21017;&#65292;&#26088;&#22312;&#36798;&#21040;&#26356;&#22909;&#30340;&#26465;&#20214;&#31119;&#21033;&#12290;&#25105;&#20204;&#34920;&#24449;&#20102;&#27492;&#26041;&#27861;&#21487;&#36798;&#21040;&#26368;&#20248;&#31574;&#30053;&#36873;&#25321;&#30340;&#26465;&#20214;&#65292;&#24182;&#29992;&#27169;&#25311;&#30740;&#31350;&#21644;&#23454;&#35777;&#24212;&#29992;&#26469;&#35777;&#26126;&#20854;&#21487;&#34892;&#24615;&#65292;&#22312;&#23439;&#35266;&#32463;&#27982;&#39046;&#22495;&#24212;&#29992;&#19978;&#20063;&#33021;&#22815;&#36215;&#21040;&#31215;&#26497;&#30340;&#20316;&#29992;&#12290;</title><link>http://arxiv.org/abs/2205.03970</link><description>&lt;p&gt;
&#22522;&#20110;&#32463;&#39564;&#31119;&#21033;&#26368;&#22823;&#21270;&#30340;&#26102;&#38388;&#24207;&#21015;&#25919;&#31574;&#36873;&#25321;&#26041;&#27861;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Policy Choice in Time Series by Empirical Welfare Maximization. (arXiv:2205.03970v3 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2205.03970
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#26041;&#27861;&#20197;&#22312;&#19968;&#23450;&#26102;&#38388;&#27573;&#20869;&#36827;&#34892;&#25919;&#31574;&#36873;&#25321;&#65292;&#36890;&#36807;&#32463;&#39564;&#31119;&#21033;&#26368;&#22823;&#21270;&#26041;&#27861;&#26469;&#20272;&#35745;&#36825;&#19968;&#25919;&#31574;&#35268;&#21017;&#65292;&#26088;&#22312;&#36798;&#21040;&#26356;&#22909;&#30340;&#26465;&#20214;&#31119;&#21033;&#12290;&#25105;&#20204;&#34920;&#24449;&#20102;&#27492;&#26041;&#27861;&#21487;&#36798;&#21040;&#26368;&#20248;&#31574;&#30053;&#36873;&#25321;&#30340;&#26465;&#20214;&#65292;&#24182;&#29992;&#27169;&#25311;&#30740;&#31350;&#21644;&#23454;&#35777;&#24212;&#29992;&#26469;&#35777;&#26126;&#20854;&#21487;&#34892;&#24615;&#65292;&#22312;&#23439;&#35266;&#32463;&#27982;&#39046;&#22495;&#24212;&#29992;&#19978;&#20063;&#33021;&#22815;&#36215;&#21040;&#31215;&#26497;&#30340;&#20316;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22312;&#22810;&#20803;&#26102;&#38388;&#24207;&#21015;&#26465;&#20214;&#19979;&#36827;&#34892;&#25919;&#31574;&#36873;&#25321;&#30340;&#26032;&#26041;&#27861;&#12290;&#24314;&#31435;&#22312;&#32479;&#35745;&#27835;&#30103;&#36873;&#25321;&#26694;&#26550;&#30340;&#22522;&#30784;&#19978;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#26102;&#38388;&#24207;&#21015;&#32463;&#39564;&#31119;&#21033;&#26368;&#22823;&#21270;&#65288;T-EWM&#65289;&#26041;&#27861;&#65292;&#36890;&#36807;&#26368;&#22823;&#21270;&#20351;&#29992;&#38750;&#21442;&#25968;&#28508;&#22312;&#32467;&#26524;&#26102;&#38388;&#24207;&#21015;&#26500;&#36896;&#30340;&#32463;&#39564;&#31119;&#21033;&#20934;&#21017;&#26469;&#20272;&#35745;&#24403;&#21069;&#25110;&#22810;&#20010;&#26102;&#26399;&#30340;&#26368;&#20248;&#25919;&#31574;&#35268;&#21017;&#12290;&#25105;&#20204;&#34920;&#24449;&#20102;T-EWM&#22312;&#20160;&#20040;&#26465;&#20214;&#19979;&#33021;&#22815;&#19968;&#33268;&#22320;&#23398;&#20064;&#21040;&#22312;&#26102;&#38388;&#24207;&#21015;&#21382;&#21490;&#32473;&#23450;&#26465;&#20214;&#31119;&#21033;&#19979;&#26368;&#20248;&#30340;&#25919;&#31574;&#36873;&#25321;&#12290;&#28982;&#21518;&#25512;&#23548;&#20986;&#20102;&#26465;&#20214;&#31119;&#21033;&#36951;&#25022;&#21450;&#20854;&#26497;&#23567;&#19979;&#30028;&#30340;&#38750;&#28176;&#36827;&#19978;&#38480;&#12290;&#20026;&#20102;&#35828;&#26126;T-EWM&#30340;&#23454;&#29616;&#21644;&#24212;&#29992;&#65292;&#25105;&#20204;&#36827;&#34892;&#20102;&#27169;&#25311;&#30740;&#31350;&#65292;&#24182;&#23558;&#35813;&#26041;&#27861;&#24212;&#29992;&#20110;&#20174;&#23439;&#35266;&#32463;&#27982;&#26102;&#38388;&#24207;&#21015;&#25968;&#25454;&#20013;&#20272;&#35745;&#26368;&#20248;&#36135;&#24065;&#25919;&#31574;&#35268;&#21017;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper develops a novel method for policy choice in a dynamic setting where the available data is a multivariate time series. Building on the statistical treatment choice framework, we propose Time-series Empirical Welfare Maximization (T-EWM) methods to estimate an optimal policy rule for the current period or over multiple periods by maximizing an empirical welfare criterion constructed using nonparametric potential outcome time-series. We characterize conditions under which T-EWM consistently learns a policy choice that is optimal in terms of conditional welfare given the time-series history. We then derive a nonasymptotic upper bound for conditional welfare regret and its minimax lower bound. To illustrate the implementation and uses of T-EWM, we perform simulation studies and apply the method to estimate optimal monetary policy rules from macroeconomic time-series data.
&lt;/p&gt;</description></item></channel></rss>