<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#20004;&#31181;&#20135;&#21697;&#21487;&#20197;&#25104;&#20026;&#28040;&#36153;&#32773;&#30340;&#20114;&#34917;&#21697;&#20294;&#23545;&#20013;&#38388;&#21830;&#26469;&#35828;&#26159;&#26367;&#20195;&#21697;&#65292;&#20174;&#32780;&#23548;&#33268;&#20215;&#26684;&#19978;&#28072;&#12290;</title><link>https://arxiv.org/abs/2402.12575</link><description>&lt;p&gt;
&#20849;&#21516;&#39038;&#23458;&#30340;&#36328;&#24066;&#22330;&#24182;&#36141;&#65306;&#20309;&#26102;&#65288;&#20197;&#21450;&#20026;&#20160;&#20040;&#65289;&#20250;&#22686;&#21152;&#35848;&#21028;&#20215;&#26684;&#65311;
&lt;/p&gt;
&lt;p&gt;
Cross-Market Mergers with Common Customers: When (and Why) Do They Increase Negotiated Prices?
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.12575
&lt;/p&gt;
&lt;p&gt;
&#20004;&#31181;&#20135;&#21697;&#21487;&#20197;&#25104;&#20026;&#28040;&#36153;&#32773;&#30340;&#20114;&#34917;&#21697;&#20294;&#23545;&#20013;&#38388;&#21830;&#26469;&#35828;&#26159;&#26367;&#20195;&#21697;&#65292;&#20174;&#32780;&#23548;&#33268;&#20215;&#26684;&#19978;&#28072;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#30740;&#31350;&#20102;&#20379;&#24212;&#21830;&#21040;&#20013;&#38388;&#21830;&#30340;&#36328;&#24066;&#22330;&#24182;&#36141;&#23545;&#20026;&#28040;&#36153;&#32773;&#25414;&#32465;&#20135;&#21697;&#30340;&#24433;&#21709;&#12290;&#36825;&#20123;&#24182;&#36141;&#22791;&#21463;&#20105;&#35758;&#12290;&#19968;&#20123;&#20154;&#35748;&#20026;&#20379;&#24212;&#21830;&#30340;&#20135;&#21697;&#20250;&#25104;&#20026;&#20013;&#38388;&#21830;&#30340;&#26367;&#20195;&#21697;&#65292;&#23613;&#31649;&#19981;&#26159;&#28040;&#36153;&#32773;&#30340;&#26367;&#20195;&#21697;&#12290;&#20854;&#20182;&#20154;&#35748;&#20026;&#65292;&#30001;&#20110;&#25414;&#32465;&#20351;&#20135;&#21697;&#25104;&#20026;&#28040;&#36153;&#32773;&#30340;&#20114;&#34917;&#20135;&#21697;&#65292;&#20135;&#21697;&#24517;&#39035;&#25104;&#20026;&#20013;&#38388;&#21830;&#30340;&#20114;&#34917;&#20135;&#21697;&#12290;&#25105;&#36890;&#36807;&#23637;&#31034;&#24403;&#20135;&#21697;&#22312;&#21560;&#24341;&#28040;&#36153;&#32773;&#36141;&#20080;&#25414;&#32465;&#21253;&#26102;&#21457;&#25381;&#31867;&#20284;&#20316;&#29992;&#26102;&#65292;&#20004;&#31181;&#20135;&#21697;&#21487;&#20197;&#25104;&#20026;&#28040;&#36153;&#32773;&#30340;&#20114;&#34917;&#21697;&#20294;&#23545;&#20013;&#38388;&#21830;&#26469;&#35828;&#26159;&#26367;&#20195;&#21697;&#65292;&#20026;&#36825;&#19968;&#36777;&#35770;&#20570;&#20986;&#20102;&#36129;&#29486;&#12290;&#36825;&#19968;&#32467;&#26524;&#24102;&#26469;&#20102;&#26032;&#30340;&#24314;&#35758;&#65292;&#24182;&#26377;&#21161;&#20110;&#35299;&#37322;&#20026;&#20160;&#20040;&#36328;&#24066;&#22330;&#21307;&#38498;&#24182;&#36141;&#20250;&#25552;&#39640;&#20215;&#26684;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.12575v1 Announce Type: new  Abstract: I examine the implications of cross-market mergers of suppliers to intermediaries that bundle products for consumers. These mergers are controversial. Some argue that suppliers' products will be substitutes for intermediaries, despite not being substitutes for consumers. Others contend that because bundling makes products complements for consumers, products must be complements for intermediaries. I contribute to this debate by showing that two products can be complements for consumers but substitutes for intermediaries when the products serve a similar role in attracting consumers to purchase the bundle. This result leads to new recommendations and helps explain why cross-market hospital mergers raise prices.
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#20171;&#32461;&#20102;&#31038;&#20250;&#30899;&#25104;&#26412;&#20272;&#35745;&#20803;&#20998;&#26512;&#25968;&#25454;&#24211;&#30340;&#26032;&#29256;&#26412;&#65292;&#26032;&#22686;&#20102;&#20851;&#20110;&#27668;&#20505;&#21464;&#21270;&#24433;&#21709;&#21644;&#31119;&#21033;&#20989;&#25968;&#24418;&#29366;&#30340;&#23383;&#27573;&#65292;&#24182;&#25193;&#23637;&#20102;&#21512;&#20316;&#32773;&#21644;&#24341;&#29992;&#32593;&#32476;&#12290;</title><link>https://arxiv.org/abs/2402.09125</link><description>&lt;p&gt;
&#31038;&#20250;&#30899;&#25104;&#26412;&#30340;&#20803;&#20998;&#26512;&#25968;&#25454;&#24211; (v2024.0)
&lt;/p&gt;
&lt;p&gt;
Database for the meta-analysis of the social cost of carbon (v2024.0)
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.09125
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#20171;&#32461;&#20102;&#31038;&#20250;&#30899;&#25104;&#26412;&#20272;&#35745;&#20803;&#20998;&#26512;&#25968;&#25454;&#24211;&#30340;&#26032;&#29256;&#26412;&#65292;&#26032;&#22686;&#20102;&#20851;&#20110;&#27668;&#20505;&#21464;&#21270;&#24433;&#21709;&#21644;&#31119;&#21033;&#20989;&#25968;&#24418;&#29366;&#30340;&#23383;&#27573;&#65292;&#24182;&#25193;&#23637;&#20102;&#21512;&#20316;&#32773;&#21644;&#24341;&#29992;&#32593;&#32476;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#31038;&#20250;&#30899;&#25104;&#26412;&#20272;&#35745;&#20803;&#20998;&#26512;&#25968;&#25454;&#24211;&#30340;&#26032;&#29256;&#26412;&#12290;&#26032;&#22686;&#20102;&#35760;&#24405;&#65292;&#24182;&#28155;&#21152;&#20102;&#20851;&#20110;&#27668;&#20505;&#21464;&#21270;&#24433;&#21709;&#21644;&#31119;&#21033;&#20989;&#25968;&#24418;&#29366;&#30340;&#26032;&#23383;&#27573;&#12290;&#35813;&#25968;&#25454;&#24211;&#36824;&#25193;&#23637;&#20102;&#21512;&#20316;&#32773;&#21644;&#24341;&#29992;&#32593;&#32476;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.09125v1 Announce Type: new Abstract: A new version of the database for the meta-analysis of estimates of the social cost of carbon is presented. New records were added, and new fields on the impact of climate change and the shape of the welfare function. The database was extended to co-author and citation networks.
&lt;/p&gt;</description></item><item><title>&#25552;&#20986;&#20102;&#29992;&#20110;&#39118;&#38505;&#20215;&#20540;&#65288;VaR&#65289;&#21644;CoVaR&#30340;&#32852;&#21512;&#21160;&#24577;&#39044;&#27979;&#27169;&#22411;&#65292;&#24341;&#20837;&#20102;&#19968;&#31181;&#26032;&#30340;&#21442;&#25968;&#20272;&#35745;&#26041;&#27861;&#65292;&#24182;&#22312;&#32654;&#22269;&#22823;&#22411;&#38134;&#34892;&#30340;&#23454;&#35777;&#20998;&#26512;&#20013;&#23637;&#31034;&#20102;&#20854;&#20248;&#36234;&#24615;&#12290;</title><link>https://arxiv.org/abs/2206.14275</link><description>&lt;p&gt;
&#21160;&#24577;CoVaR&#24314;&#27169;
&lt;/p&gt;
&lt;p&gt;
Dynamic CoVaR Modeling
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2206.14275
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#29992;&#20110;&#39118;&#38505;&#20215;&#20540;&#65288;VaR&#65289;&#21644;CoVaR&#30340;&#32852;&#21512;&#21160;&#24577;&#39044;&#27979;&#27169;&#22411;&#65292;&#24341;&#20837;&#20102;&#19968;&#31181;&#26032;&#30340;&#21442;&#25968;&#20272;&#35745;&#26041;&#27861;&#65292;&#24182;&#22312;&#32654;&#22269;&#22823;&#22411;&#38134;&#34892;&#30340;&#23454;&#35777;&#20998;&#26512;&#20013;&#23637;&#31034;&#20102;&#20854;&#20248;&#36234;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
CoVaR&#65288;&#26465;&#20214;&#39118;&#38505;&#20215;&#20540;&#65289;&#26159;&#19968;&#31181;&#27969;&#34892;&#30340;&#31995;&#32479;&#39118;&#38505;&#24230;&#37327;&#26041;&#27861;&#65292;&#22312;&#32463;&#27982;&#23398;&#21644;&#37329;&#34701;&#39046;&#22495;&#34987;&#24191;&#27867;&#20351;&#29992;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#29992;&#20110;&#39118;&#38505;&#20215;&#20540;&#65288;VaR&#65289;&#21644;CoVaR&#30340;&#32852;&#21512;&#21160;&#24577;&#39044;&#27979;&#27169;&#22411;&#12290;&#25105;&#20204;&#36824;&#20171;&#32461;&#20102;&#19968;&#31181;&#22522;&#20110;&#26368;&#36817;&#25552;&#20986;&#30340;VaR&#21644;CoVaR&#23545;&#30340;&#21452;&#21464;&#37327;&#35780;&#20998;&#20989;&#25968;&#30340;&#27169;&#22411;&#21442;&#25968;&#30340;&#20004;&#27493;M&#20272;&#35745;&#37327;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#21442;&#25968;&#20272;&#35745;&#37327;&#30340;&#19968;&#33268;&#24615;&#21644;&#28176;&#36817;&#27491;&#24577;&#24615;&#65292;&#24182;&#20998;&#26512;&#20102;&#23427;&#22312;&#27169;&#25311;&#20013;&#30340;&#26377;&#38480;&#26679;&#26412;&#24615;&#36136;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#23558;&#25105;&#20204;&#30340;&#21160;&#24577;&#39044;&#27979;&#27169;&#22411;&#30340;&#19968;&#20010;&#29305;&#23450;&#23376;&#31867;&#24212;&#29992;&#20110;&#32654;&#22269;&#22823;&#22411;&#38134;&#34892;&#30340;&#23545;&#25968;&#25910;&#30410;&#29575;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;&#25105;&#20204;&#30340;CoCAViaR&#27169;&#22411;&#20135;&#29983;&#30340;CoVaR&#39044;&#27979;&#20248;&#20110;&#24403;&#21069;&#22522;&#20934;&#27169;&#22411;&#21457;&#24067;&#30340;&#39044;&#27979;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2206.14275v3 Announce Type: replace  Abstract: The popular systemic risk measure CoVaR (conditional Value-at-Risk) is widely used in economics and finance. Formally, it is defined as a large quantile of one variable (e.g., losses in the financial system) conditional on some other variable (e.g., losses in a bank's shares) being in distress. In this article, we propose joint dynamic forecasting models for the Value-at-Risk (VaR) and CoVaR. We also introduce a two-step M-estimator for the model parameters drawing on recently proposed bivariate scoring functions for the pair (VaR, CoVaR). We prove consistency and asymptotic normality of our parameter estimator and analyze its finite-sample properties in simulations. Finally, we apply a specific subclass of our dynamic forecasting models, which we call CoCAViaR models, to log-returns of large US banks. It is shown that our CoCAViaR models generate CoVaR predictions that are superior to forecasts issued from current benchmark models.
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#40065;&#26834;&#30340;F&#32479;&#35745;&#37327;&#20316;&#20026;&#26816;&#39564;&#24369;&#24037;&#20855;&#30340;&#26041;&#27861;&#65292;&#24182;&#24212;&#29992;&#20110;&#32447;&#24615;&#24191;&#20041;&#30697;&#20272;&#35745;&#22120;&#12290;&#36825;&#19968;&#26041;&#27861;&#36890;&#36807;&#35745;&#31639;&#35823;&#24046;&#39033;&#30340;&#20559;&#24046;&#65292;&#31616;&#21270;&#20102;&#24369;&#24037;&#20855;&#30340;&#20020;&#30028;&#20540;&#35745;&#31639;&#12290;</title><link>http://arxiv.org/abs/2309.01637</link><description>&lt;p&gt;
&#20316;&#20026;&#24369;&#24037;&#20855;&#26816;&#39564;&#30340;&#40065;&#26834;F&#32479;&#35745;&#37327;
&lt;/p&gt;
&lt;p&gt;
The Robust F-Statistic as a Test for Weak Instruments. (arXiv:2309.01637v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.01637
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#40065;&#26834;&#30340;F&#32479;&#35745;&#37327;&#20316;&#20026;&#26816;&#39564;&#24369;&#24037;&#20855;&#30340;&#26041;&#27861;&#65292;&#24182;&#24212;&#29992;&#20110;&#32447;&#24615;&#24191;&#20041;&#30697;&#20272;&#35745;&#22120;&#12290;&#36825;&#19968;&#26041;&#27861;&#36890;&#36807;&#35745;&#31639;&#35823;&#24046;&#39033;&#30340;&#20559;&#24046;&#65292;&#31616;&#21270;&#20102;&#24369;&#24037;&#20855;&#30340;&#20020;&#30028;&#20540;&#35745;&#31639;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
Montiel Olea and Pflueger (2013)&#25552;&#20986;&#20102;&#19968;&#31181;&#26377;&#25928;&#30340;F&#32479;&#35745;&#37327;&#20316;&#20026;&#26816;&#39564;&#24369;&#24037;&#20855;&#30340;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#22522;&#20110;&#20004;&#38454;&#27573;&#26368;&#23567;&#20108;&#20056;&#20272;&#35745;&#22120;&#30456;&#23545;&#20110;&#26368;&#22351;&#24773;&#20917;&#19979;&#30340;&#22522;&#20934;&#20559;&#24046;&#12290;&#25105;&#20204;&#34920;&#26126;&#65292;&#20182;&#20204;&#30340;&#26041;&#27861;&#36866;&#29992;&#20110;&#19968;&#31867;&#32447;&#24615;&#24191;&#20041;&#30697;&#20272;&#35745;&#22120;&#65288;GMM&#65289;&#65292;&#20854;&#20013;&#21253;&#21547;&#20102;&#19968;&#31867;&#24191;&#20041;&#30340;&#26377;&#25928;F&#32479;&#35745;&#37327;&#12290;&#26631;&#20934;&#30340;&#38750;&#40784;&#27425;&#26041;&#24046;&#40065;&#26834;F&#32479;&#35745;&#37327;&#23646;&#20110;&#36825;&#19968;&#31867;&#21035;&#12290;&#30456;&#20851;&#30340;&#25193;&#23637;&#20272;&#35745;&#22120;GMMf&#65292;&#25193;&#23637;&#20026;&#31532;&#19968;&#38454;&#27573;&#65292;&#26159;&#19968;&#31181;&#26032;&#39062;&#32780;&#19981;&#23547;&#24120;&#30340;&#20272;&#35745;&#22120;&#65292;&#22240;&#20026;&#26435;&#37325;&#30697;&#38453;&#22522;&#20110;&#31532;&#19968;&#38454;&#27573;&#30340;&#27531;&#24046;&#12290;&#30001;&#20110;&#40065;&#26834;F&#32479;&#35745;&#37327;&#20063;&#21487;&#20197;&#29992;&#20316;&#35782;&#21035;&#19981;&#36275;&#30340;&#26816;&#39564;&#65292;&#36890;&#36807;&#35745;&#31639;GMMf&#20272;&#35745;&#22120;&#30456;&#23545;&#20110;&#22522;&#20934;&#30340;&#20559;&#24046;&#65292;&#21487;&#20197;&#31616;&#21270;&#24369;&#24037;&#20855;&#30340;&#20020;&#30028;&#20540;&#35745;&#31639;&#65292;&#26080;&#38656;&#20351;&#29992;&#27169;&#25311;&#26041;&#27861;&#25110;Patnaik (1949)&#30340;&#20998;&#24067;&#36817;&#20284;&#26041;&#27861;&#12290;&#22312;Andrews (2018)&#30340;&#20998;&#32452;&#25968;&#25454;IV &#35774;&#35745;&#20013;&#65292;...
&lt;/p&gt;
&lt;p&gt;
Montiel Olea and Pflueger (2013) proposed the effective F-statistic as a test for weak instruments in terms of the Nagar bias of the two-stage least squares (2SLS) estimator relative to a benchmark worst-case bias. We show that their methodology applies to a class of linear generalized method of moments (GMM) estimators with an associated class of generalized effective F-statistics. The standard nonhomoskedasticity robust F-statistic is a member of this class. The associated GMMf estimator, with the extension f for first-stage, is a novel and unusual estimator as the weight matrix is based on the first-stage residuals. As the robust F-statistic can also be used as a test for underidentification, expressions for the calculation of the weak-instruments critical values in terms of the Nagar bias of the GMMf estimator relative to the benchmark simplify and no simulation methods or Patnaik (1949) distributional approximations are needed. In the grouped-data IV designs of Andrews (2018), whe
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#31639;&#27861;&#23398;&#20064;&#31454;&#26631;&#26102;&#19981;&#21516;&#25903;&#20184;&#35268;&#21017;&#23545;&#25928;&#29575;&#30340;&#24433;&#21709;&#65292;&#21457;&#29616;&#25903;&#20184;&#35268;&#21017;&#23545;&#31454;&#25293;&#25928;&#29575;&#33267;&#20851;&#37325;&#35201;&#12290;</title><link>http://arxiv.org/abs/2306.09437</link><description>&lt;p&gt;
&#24403;&#31639;&#27861;&#23398;&#20064;&#31454;&#26631;&#26102;&#30340;&#25293;&#21334;&#35774;&#35745;&#65306;&#25903;&#20184;&#35268;&#21017;&#30340;&#37325;&#35201;&#20316;&#29992;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Designing Auctions when Algorithms Learn to Bid: The critical role of Payment Rules. (arXiv:2306.09437v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.09437
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#31639;&#27861;&#23398;&#20064;&#31454;&#26631;&#26102;&#19981;&#21516;&#25903;&#20184;&#35268;&#21017;&#23545;&#25928;&#29575;&#30340;&#24433;&#21709;&#65292;&#21457;&#29616;&#25903;&#20184;&#35268;&#21017;&#23545;&#31454;&#25293;&#25928;&#29575;&#33267;&#20851;&#37325;&#35201;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#31639;&#27861;&#23398;&#20064;&#31454;&#26631;&#26102;&#19981;&#21516;&#25903;&#20184;&#35268;&#21017;&#23545;&#25928;&#29575;&#30340;&#24433;&#21709;&#12290;&#25105;&#20204;&#36827;&#34892;&#20102;&#19968;&#20010;&#23436;&#20840;&#38543;&#26426;&#23454;&#39564;&#65292;&#36827;&#34892;&#20102;427&#27425;&#35797;&#39564;&#65292;&#20854;&#20013;Q-learning&#30340;&#31454;&#26631;&#32773;&#21442;&#21152;&#20102;&#39640;&#36798;250,000&#27425;&#20851;&#20110;&#20849;&#21516;&#35780;&#20272;&#39033;&#30340;&#31454;&#25293;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#21457;&#29616;&#65292;&#31532;&#19968;&#20215;&#26684;&#25293;&#21334;&#65292;&#21363;&#32988;&#21033;&#32773;&#25903;&#20184;&#33719;&#32988;&#20986;&#20215;&#65292;&#23481;&#26131;&#21463;&#21040;&#21327;&#35843;&#31454;&#26631;&#21387;&#21046;&#65292;&#32988;&#20986;&#20986;&#20215;&#24179;&#22343;&#20302;&#20110;&#30495;&#23454;&#20215;&#20540;&#32422;20%&#12290;&#30456;&#27604;&#20043;&#19979;&#65292;&#31532;&#20108;&#20215;&#26684;&#25293;&#21334;&#65292;&#21363;&#32988;&#21033;&#32773;&#25903;&#20184;&#31532;&#20108;&#39640;&#20986;&#20215;&#65292;&#20351;&#33719;&#32988;&#20986;&#20215;&#19982;&#23454;&#38469;&#20215;&#20540;&#19968;&#33268;&#65292;&#20943;&#23569;&#23398;&#20064;&#26399;&#38388;&#30340;&#27874;&#21160;&#24182;&#21152;&#24555;&#25910;&#25947;&#36895;&#24230;&#12290;&#22238;&#24402;&#20998;&#26512;&#32771;&#34385;&#20102;&#35832;&#22914;&#25903;&#20184;&#35268;&#21017;&#12289;&#21442;&#19982;&#20154;&#25968;&#12289;&#25240;&#25187;&#21644;&#23398;&#20064;&#29575;&#31561;&#31639;&#27861;&#22240;&#32032;&#12289;&#24322;&#27493;/&#21516;&#27493;&#26356;&#26032;&#12289;&#21453;&#39304;&#21644;&#25506;&#32034;&#31574;&#30053;&#31561;&#35774;&#35745;&#22240;&#32032;&#65292;&#21457;&#29616;&#25903;&#20184;&#35268;&#21017;&#23545;&#25928;&#29575;&#33267;&#20851;&#37325;&#35201;&#12290;&#27492;&#22806;&#65292;&#26426;&#22120;&#23398;&#20064;&#20272;&#35745;&#22120;&#21457;&#29616;&#65292;&#25903;&#20184;&#35268;&#21017;&#29978;&#33267;&#27604;&#20854;&#20182;&#22240;&#32032;&#26356;&#21152;&#37325;&#35201;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper examines the impact of different payment rules on efficiency when algorithms learn to bid. We use a fully randomized experiment of 427 trials, where Q-learning bidders participate in up to 250,000 auctions for a commonly valued item. The findings reveal that the first price auction, where winners pay the winning bid, is susceptible to coordinated bid suppression, with winning bids averaging roughly 20% below the true values. In contrast, the second price auction, where winners pay the second highest bid, aligns winning bids with actual values, reduces the volatility during learning and speeds up convergence. Regression analysis, incorporating design elements such as payment rules, number of participants, algorithmic factors including the discount and learning rate, asynchronous/synchronous updating, feedback, and exploration strategies, discovers the critical role of payment rules on efficiency. Furthermore, machine learning estimators find that payment rules matter even mor
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25506;&#35752;&#20102;&#36882;&#24402;&#25928;&#29992;&#27169;&#22411;&#20013;&#30340;&#30456;&#20851;&#21388;&#24694;&#34892;&#20026;&#29305;&#24449;&#65292;&#25552;&#20986;&#20102;&#23427;&#20204;&#23545;&#36164;&#20135;&#23450;&#20215;&#12289;&#27668;&#20505;&#25919;&#31574;&#21644;&#26368;&#20248;&#36130;&#25919;&#25919;&#31574;&#31561;&#39046;&#22495;&#30340;&#24212;&#29992;&#24847;&#20041;&#12290;</title><link>http://arxiv.org/abs/2304.04599</link><description>&lt;p&gt;
&#36882;&#24402;&#20559;&#22909;&#12289;&#30456;&#20851;&#21388;&#24694;&#21644;&#26102;&#38388;&#19981;&#30830;&#23450;&#24615;&#30340;&#35299;&#20915;&#26041;&#24335;
&lt;/p&gt;
&lt;p&gt;
Recursive Preferences, Correlation Aversion, and the Temporal Resolution of Uncertainty. (arXiv:2304.04599v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.04599
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25506;&#35752;&#20102;&#36882;&#24402;&#25928;&#29992;&#27169;&#22411;&#20013;&#30340;&#30456;&#20851;&#21388;&#24694;&#34892;&#20026;&#29305;&#24449;&#65292;&#25552;&#20986;&#20102;&#23427;&#20204;&#23545;&#36164;&#20135;&#23450;&#20215;&#12289;&#27668;&#20505;&#25919;&#31574;&#21644;&#26368;&#20248;&#36130;&#25919;&#25919;&#31574;&#31561;&#39046;&#22495;&#30340;&#24212;&#29992;&#24847;&#20041;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36882;&#24402;&#25928;&#29992;&#27169;&#22411;&#22312;&#35768;&#22810;&#32463;&#27982;&#24212;&#29992;&#31243;&#24207;&#20013;&#36215;&#30528;&#37325;&#35201;&#20316;&#29992;&#12290;&#26412;&#25991;&#30740;&#31350;&#20102;&#36825;&#20123;&#27169;&#22411;&#25152;&#34920;&#29616;&#30340;&#19968;&#31181;&#26032;&#30340;&#34892;&#20026;&#29305;&#24449;&#65306;&#23545;&#26102;&#38388;&#19978;&#21576;&#29616;&#25345;&#32493;&#24615;&#65288;&#27491;&#33258;&#30456;&#20851;&#65289;&#39118;&#38505;&#30340;&#21388;&#24694;&#65292;&#31216;&#20026;&#30456;&#20851;&#21388;&#24694;&#12290;&#25105;&#24341;&#20837;&#20102;&#36825;&#31181;&#23646;&#24615;&#30340;&#24418;&#24335;&#27010;&#24565;&#65292;&#24182;&#25552;&#20379;&#20102;&#19968;&#20010;&#22522;&#20110;&#39118;&#38505;&#24577;&#24230;&#30340;&#29305;&#24449;&#65292;&#21516;&#26102;&#36824;&#34920;&#26126;&#30456;&#20851;&#21388;&#24694;&#30340;&#20559;&#22909;&#20855;&#26377;&#29305;&#23450;&#30340;&#21464;&#20998;&#34920;&#31034;&#12290;&#25105;&#35752;&#35770;&#20102;&#36825;&#20123;&#21457;&#29616;&#22914;&#20309;&#35828;&#26126;&#23545;&#30456;&#20851;&#24615;&#30340;&#24577;&#24230;&#26159;&#25512;&#21160;&#36882;&#24402;&#25928;&#29992;&#22312;&#36164;&#20135;&#23450;&#20215;&#12289;&#27668;&#20505;&#25919;&#31574;&#21644;&#26368;&#20248;&#36130;&#25919;&#25919;&#31574;&#31561;&#39046;&#22495;&#24212;&#29992;&#30340;&#20851;&#38190;&#34892;&#20026;&#22240;&#32032;&#12290;
&lt;/p&gt;
&lt;p&gt;
Models of recursive utility are of central importance in many economic applications. This paper investigates a new behavioral feature exhibited by these models: aversion to risks that exhibit persistence (positive autocorrelation) through time, referred to as correlation aversion. I introduce a formal notion of such a property and provide a characterization based on risk attitudes, and show that correlation averse preferences admit a specific variational representation. I discuss how these findings imply that attitudes toward correlation are a crucial behavioral aspect driving the applications of recursive utility in fields such as asset pricing, climate policy, and optimal fiscal policy.
&lt;/p&gt;</description></item><item><title>XPER&#26041;&#27861;&#33021;&#34913;&#37327;&#36755;&#20837;&#29305;&#24449;&#23545;&#27169;&#22411;&#39044;&#27979;&#24615;&#33021;&#30340;&#20855;&#20307;&#36129;&#29486;&#65292;&#24182;&#21487;&#29992;&#20110;&#22788;&#29702;&#24322;&#36136;&#24615;&#38382;&#39064;&#65292;&#26500;&#24314;&#21516;&#36136;&#21270;&#20010;&#20307;&#32676;&#20307;&#65292;&#20174;&#32780;&#25552;&#39640;&#39044;&#27979;&#31934;&#24230;&#12290;</title><link>http://arxiv.org/abs/2212.05866</link><description>&lt;p&gt;
&#21487;&#35299;&#37322;&#30340;&#24615;&#33021;&#65306;&#34913;&#37327;&#39044;&#27979;&#24615;&#33021;&#30340;&#39537;&#21160;&#21147;
&lt;/p&gt;
&lt;p&gt;
Explainable Performance: Measuring the Driving Forces of Predictive Performance. (arXiv:2212.05866v2 [stat.ML] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2212.05866
&lt;/p&gt;
&lt;p&gt;
XPER&#26041;&#27861;&#33021;&#34913;&#37327;&#36755;&#20837;&#29305;&#24449;&#23545;&#27169;&#22411;&#39044;&#27979;&#24615;&#33021;&#30340;&#20855;&#20307;&#36129;&#29486;&#65292;&#24182;&#21487;&#29992;&#20110;&#22788;&#29702;&#24322;&#36136;&#24615;&#38382;&#39064;&#65292;&#26500;&#24314;&#21516;&#36136;&#21270;&#20010;&#20307;&#32676;&#20307;&#65292;&#20174;&#32780;&#25552;&#39640;&#39044;&#27979;&#31934;&#24230;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#24341;&#20837;&#20102;XPER&#65288;eXplainable PERformance&#65289;&#26041;&#27861;&#26469;&#34913;&#37327;&#36755;&#20837;&#29305;&#24449;&#23545;&#27169;&#22411;&#39044;&#27979;&#24615;&#33021;&#30340;&#20855;&#20307;&#36129;&#29486;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#22312;&#29702;&#35770;&#19978;&#22522;&#20110;Shapley&#20540;&#65292;&#26082;&#19981;&#20381;&#36182;&#20110;&#27169;&#22411;&#65292;&#20063;&#19981;&#20381;&#36182;&#20110;&#24615;&#33021;&#24230;&#37327;&#12290;&#27492;&#22806;&#65292;XPER&#21487;&#22312;&#27169;&#22411;&#32423;&#21035;&#25110;&#20010;&#20307;&#32423;&#21035;&#23454;&#29616;&#12290;&#25105;&#20204;&#35777;&#26126;XPER&#20855;&#26377;&#26631;&#20934;&#35299;&#37322;&#24615;&#26041;&#27861;&#65288;SHAP&#65289;&#30340;&#29305;&#27530;&#24773;&#20917;&#12290;&#22312;&#36151;&#27454;&#36829;&#32422;&#39044;&#27979;&#24212;&#29992;&#20013;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#22914;&#20309;&#21033;&#29992;XPER&#22788;&#29702;&#24322;&#36136;&#24615;&#38382;&#39064;&#65292;&#24182;&#26174;&#33879;&#25552;&#39640;&#26679;&#26412;&#22806;&#24615;&#33021;&#12290;&#20026;&#27492;&#65292;&#25105;&#20204;&#36890;&#36807;&#22522;&#20110;&#20010;&#20307;XPER&#20540;&#23545;&#20182;&#20204;&#36827;&#34892;&#32858;&#31867;&#26469;&#26500;&#24314;&#21516;&#36136;&#21270;&#30340;&#20010;&#20307;&#32676;&#20307;&#12290;&#25105;&#20204;&#21457;&#29616;&#20272;&#35745;&#32676;&#20307;&#29305;&#23450;&#30340;&#27169;&#22411;&#27604;&#19968;&#20010;&#27169;&#22411;&#36866;&#29992;&#20110;&#25152;&#26377;&#20010;&#20307;&#20855;&#26377;&#26356;&#39640;&#30340;&#39044;&#27979;&#31934;&#24230;&#12290;
&lt;/p&gt;
&lt;p&gt;
We introduce the XPER (eXplainable PERformance) methodology to measure the specific contribution of the input features to the predictive performance of a model. Our methodology is theoretically grounded on Shapley values and is both model-agnostic and performance metric-agnostic. Furthermore, XPER can be implemented either at the model level or at the individual level. We demonstrate that XPER has as a special case the standard explainability method in machine learning (SHAP). In a loan default forecasting application, we show how XPER can be used to deal with heterogeneity issues and significantly boost out-of-sample performance. To do so, we build homogeneous groups of individuals by clustering them based on their individual XPER values. We find that estimating group-specific models yields a much higher predictive accuracy than with a one-fits-all model.
&lt;/p&gt;</description></item></channel></rss>