<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#26412;&#30740;&#31350;&#36890;&#36807;&#20840;&#29699;&#20803;&#20998;&#26512;&#24471;&#20986;&#65292;&#29983;&#24577;&#31995;&#32479;&#26381;&#21153;&#30456;&#23545;&#20215;&#26684;&#27599;&#24180;&#32422;&#20026;2.2%&#65292;&#29992;&#20110;&#20844;&#20849;&#39033;&#30446;&#35780;&#20272;&#21644;&#29615;&#22659;&#32463;&#27982;&#20250;&#35745;&#20013;&#30340;&#35843;&#25972;&#12290;</title><link>http://arxiv.org/abs/2308.04400</link><description>&lt;p&gt;
&#26377;&#38480;&#30340;&#26367;&#20195;&#24615;&#12289;&#30456;&#23545;&#20215;&#26684;&#21464;&#21160;&#19982;&#20844;&#20849;&#33258;&#28982;&#36164;&#26412;&#20215;&#20540;&#30340;&#25552;&#21319;
&lt;/p&gt;
&lt;p&gt;
Limited substitutability, relative price changes and the uplifting of public natural capital values. (arXiv:2308.04400v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.04400
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#36890;&#36807;&#20840;&#29699;&#20803;&#20998;&#26512;&#24471;&#20986;&#65292;&#29983;&#24577;&#31995;&#32479;&#26381;&#21153;&#30456;&#23545;&#20215;&#26684;&#27599;&#24180;&#32422;&#20026;2.2%&#65292;&#29992;&#20110;&#20844;&#20849;&#39033;&#30446;&#35780;&#20272;&#21644;&#29615;&#22659;&#32463;&#27982;&#20250;&#35745;&#20013;&#30340;&#35843;&#25972;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38543;&#30528;&#20840;&#29699;&#32463;&#27982;&#30340;&#19981;&#26029;&#22686;&#38271;&#65292;&#29983;&#24577;&#31995;&#32479;&#26381;&#21153;&#24448;&#24448;&#20572;&#28382;&#25110;&#20943;&#23569;&#12290;&#32463;&#27982;&#23398;&#29702;&#35770;&#24050;&#32463;&#25581;&#31034;&#20102;&#22914;&#20309;&#23558;&#36825;&#31181;&#30456;&#23545;&#31232;&#32570;&#24615;&#30340;&#36716;&#21464;&#21453;&#26144;&#21040;&#20844;&#20849;&#39033;&#30446;&#35780;&#20272;&#21644;&#29615;&#22659;&#32463;&#27982;&#20250;&#35745;&#20013;&#65292;&#20294;&#32570;&#20047;&#23454;&#35777;&#35777;&#25454;&#26469;&#23558;&#29702;&#35770;&#20184;&#35832;&#23454;&#36341;&#12290;&#20026;&#20102;&#20272;&#35745;&#21487;&#29992;&#20110;&#36827;&#34892;&#27492;&#31867;&#35843;&#25972;&#30340;&#29983;&#24577;&#31995;&#32479;&#26381;&#21153;&#30456;&#23545;&#20215;&#26684;&#21464;&#21270;&#65292;&#25105;&#20204;&#23545;&#29615;&#22659;&#20215;&#20540;&#35780;&#20272;&#30740;&#31350;&#36827;&#34892;&#20102;&#20840;&#29699;&#20803;&#20998;&#26512;&#65292;&#20197;&#25512;&#23548;&#20986;&#24847;&#24895;&#25903;&#20184;&#25910;&#20837;&#24377;&#24615;&#20316;&#20026;&#26377;&#38480;&#26367;&#20195;&#24615;&#31243;&#24230;&#30340;&#20195;&#29702;&#12290;&#22522;&#20110;749&#20010;&#25910;&#20837;-&#24847;&#24895;&#25903;&#20184;&#23545;&#65292;&#25105;&#20204;&#20272;&#35745;&#24847;&#24895;&#25903;&#20184;&#25910;&#20837;&#24377;&#24615;&#32422;&#20026;0.78&#65288;95-CI&#65306;0.6&#33267;1.0&#65289;&#12290;&#23558;&#36825;&#20123;&#32467;&#26524;&#19982;&#29983;&#24577;&#31995;&#32479;&#26381;&#21153;&#30456;&#23545;&#31232;&#32570;&#24615;&#21464;&#21270;&#30340;&#20840;&#29699;&#25968;&#25454;&#38598;&#32467;&#21512;&#36215;&#26469;&#65292;&#25105;&#20204;&#20272;&#35745;&#29983;&#24577;&#31995;&#32479;&#26381;&#21153;&#30456;&#23545;&#20215;&#26684;&#27599;&#24180;&#32422;&#20026;2.2&#65285;&#12290;&#22312;&#23545;&#38750;&#26408;&#26448;&#26519;&#29983;&#24577;&#31995;&#32479;&#30340;&#33258;&#28982;&#36164;&#26412;&#20272;&#20540;&#20013;&#24212;&#29992;&#20102;&#36825;&#20123;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
As the global economy continues to grow, ecosystem services tend to stagnate or degrow. Economic theory has shown how such shifts in relative scarcities can be reflected in the appraisal of public projects and environmental-economic accounting, but empirical evidence has been lacking to put the theory into practice. To estimate the relative price change in ecosystem services that can be used to make such adjustments, we perform a global meta-analysis of environmental valuation studies to derive income elasticities of willingness to pay (WTP) for ecosystem services as a proxy for the degree of limited substitutability. Based on 749 income-WTP pairs, we estimate an income elasticity of WTP of around 0.78 (95-CI: 0.6 to 1.0). Combining these results with a global data set on shifts in the relative scarcity of ecosystem services, we estimate relative price change of ecosystem services of around 2.2 percent per year. In an application to natural capital valuation of non-timber forest ecosys
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#27169;&#22411;&#65292;&#25506;&#35752;&#20102;&#36890;&#29992;&#27169;&#22411;&#30340;&#24494;&#35843;&#36807;&#31243;&#20013;&#30340;&#21033;&#28070;&#20998;&#20139;&#38382;&#39064;&#65292;&#20026;&#19968;&#33324;&#31867;&#30340;&#25104;&#26412;&#21644;&#25910;&#20837;&#20989;&#25968;&#25551;&#36848;&#20102;&#35299;&#20915;&#26041;&#26696;&#30340;&#26465;&#20214;&#12290;</title><link>http://arxiv.org/abs/2308.04399</link><description>&lt;p&gt;
Fine-Tuning Games: Bargaining and Adaptation for General-Purpose Models
&lt;/p&gt;
&lt;p&gt;
Fine-Tuning Games: Bargaining and Adaptation for General-Purpose Models. (arXiv:2308.04399v1 [cs.GT])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.04399
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#27169;&#22411;&#65292;&#25506;&#35752;&#20102;&#36890;&#29992;&#27169;&#22411;&#30340;&#24494;&#35843;&#36807;&#31243;&#20013;&#30340;&#21033;&#28070;&#20998;&#20139;&#38382;&#39064;&#65292;&#20026;&#19968;&#33324;&#31867;&#30340;&#25104;&#26412;&#21644;&#25910;&#20837;&#20989;&#25968;&#25551;&#36848;&#20102;&#35299;&#20915;&#26041;&#26696;&#30340;&#26465;&#20214;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26426;&#22120;&#23398;&#20064;&#65288;ML&#65289;&#21644;&#20154;&#24037;&#26234;&#33021;&#65288;AI&#65289;&#26041;&#38754;&#30340;&#37325;&#22823;&#36827;&#23637;&#36234;&#26469;&#36234;&#22810;&#22320;&#37319;&#29992;&#24320;&#21457;&#21644;&#21457;&#24067;&#36890;&#29992;&#27169;&#22411;&#30340;&#24418;&#24335;&#12290;&#36825;&#20123;&#27169;&#22411;&#26088;&#22312;&#30001;&#20854;&#20182;&#20225;&#19994;&#21644;&#26426;&#26500;&#36827;&#34892;&#36866;&#24212;&#65292;&#20197;&#25191;&#34892;&#29305;&#23450;&#30340;&#39046;&#22495;&#19987;&#29992;&#21151;&#33021;&#12290;&#36825;&#20010;&#36807;&#31243;&#34987;&#31216;&#20026;&#36866;&#24212;&#25110;&#24494;&#35843;&#12290;&#26412;&#25991;&#25552;&#20379;&#20102;&#19968;&#20010;&#24494;&#35843;&#36807;&#31243;&#30340;&#27169;&#22411;&#65292;&#20854;&#20013;&#19968;&#20301;&#36890;&#29992;&#19987;&#23478;&#23558;&#25216;&#26415;&#20135;&#21697;&#65288;&#21363;ML&#27169;&#22411;&#65289;&#25552;&#21319;&#21040;&#19968;&#23450;&#30340;&#24615;&#33021;&#27700;&#24179;&#65292;&#24182;&#19988;&#19968;&#20301;&#25110;&#22810;&#20301;&#39046;&#22495;&#19987;&#23478;&#23558;&#20854;&#35843;&#25972;&#36866;&#29992;&#20110;&#29305;&#23450;&#39046;&#22495;&#12290;&#36825;&#20004;&#20010;&#23454;&#20307;&#37117;&#26159;&#36861;&#27714;&#21033;&#28070;&#30340;&#65292;&#24403;&#20182;&#20204;&#25237;&#36164;&#20110;&#25216;&#26415;&#26102;&#20250;&#20135;&#29983;&#25104;&#26412;&#65292;&#22312;&#25216;&#26415;&#36827;&#20837;&#24066;&#22330;&#21069;&#65292;&#20182;&#20204;&#24517;&#39035;&#23601;&#22914;&#20309;&#20998;&#20139;&#25910;&#20837;&#36798;&#25104;&#35848;&#21028;&#21327;&#35758;&#12290;&#23545;&#20110;&#30456;&#23545;&#19968;&#33324;&#30340;&#25104;&#26412;&#21644;&#25910;&#20837;&#20989;&#25968;&#31867;&#65292;&#25105;&#20204;&#21051;&#30011;&#20102;&#24494;&#35843;&#21338;&#24328;&#20135;&#29983;&#21033;&#28070;&#20998;&#20139;&#35299;&#20915;&#26041;&#26696;&#30340;&#26465;&#20214;&#12290;&#25105;&#20204;&#35266;&#23519;&#21040;&#65292;&#20219;&#20309;&#28508;&#22312;&#30340;&#39046;&#22495;&#19987;&#19994;&#21270;&#37117;&#20250;&#20135;&#29983;...
&lt;/p&gt;
&lt;p&gt;
Major advances in Machine Learning (ML) and Artificial Intelligence (AI) increasingly take the form of developing and releasing general-purpose models. These models are designed to be adapted by other businesses and agencies to perform a particular, domain-specific function. This process has become known as adaptation or fine-tuning. This paper offers a model of the fine-tuning process where a Generalist brings the technological product (here an ML model) to a certain level of performance, and one or more Domain-specialist(s) adapts it for use in a particular domain. Both entities are profit-seeking and incur costs when they invest in the technology, and they must reach a bargaining agreement on how to share the revenue for the technology to reach the market. For a relatively general class of cost and revenue functions, we characterize the conditions under which the fine-tuning game yields a profit-sharing solution. We observe that any potential domain-specialization will either contri
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#30740;&#31350;&#20102;&#22312;&#20869;&#29983;&#32593;&#32476;&#26465;&#20214;&#19979;&#32447;&#24615;&#31038;&#20132;&#20114;&#20316;&#29992;&#27169;&#22411;&#30340;&#22240;&#26524;&#35299;&#37322;&#65292;&#24182;&#25552;&#20986;&#20351;&#29992;&#28508;&#22312;&#21516;&#20276;&#22788;&#29702;&#20316;&#20026;&#24037;&#20855;&#21464;&#37327;&#65292;&#36890;&#36807;&#20004;&#20010;IV-based&#20272;&#35745;&#37327;&#23454;&#29616;&#20102;&#28322;&#20986;&#25928;&#24212;&#30340;&#22240;&#26524;&#35299;&#37322;&#12290;</title><link>http://arxiv.org/abs/2308.04276</link><description>&lt;p&gt;
&#22312;&#20869;&#29983;&#32593;&#32476;&#26465;&#20214;&#19979;&#23545;&#32447;&#24615;&#31038;&#20132;&#20114;&#20316;&#29992;&#27169;&#22411;&#36827;&#34892;&#22240;&#26524;&#35299;&#37322;
&lt;/p&gt;
&lt;p&gt;
Causal Interpretation of Linear Social Interaction Models with Endogenous Networks. (arXiv:2308.04276v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.04276
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#30740;&#31350;&#20102;&#22312;&#20869;&#29983;&#32593;&#32476;&#26465;&#20214;&#19979;&#32447;&#24615;&#31038;&#20132;&#20114;&#20316;&#29992;&#27169;&#22411;&#30340;&#22240;&#26524;&#35299;&#37322;&#65292;&#24182;&#25552;&#20986;&#20351;&#29992;&#28508;&#22312;&#21516;&#20276;&#22788;&#29702;&#20316;&#20026;&#24037;&#20855;&#21464;&#37327;&#65292;&#36890;&#36807;&#20004;&#20010;IV-based&#20272;&#35745;&#37327;&#23454;&#29616;&#20102;&#28322;&#20986;&#25928;&#24212;&#30340;&#22240;&#26524;&#35299;&#37322;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#22312;&#24322;&#36136;&#22788;&#29702;&#25928;&#24212;&#26694;&#26550;&#19979;&#65292;&#30740;&#31350;&#20102;&#22312;&#20869;&#29983;&#32593;&#32476;&#24418;&#25104;&#26465;&#20214;&#19979;&#32447;&#24615;&#31038;&#20132;&#20114;&#20316;&#29992;&#27169;&#22411;&#30340;&#22240;&#26524;&#35299;&#37322;&#12290;&#25105;&#20204;&#32771;&#34385;&#20102;&#19968;&#20010;&#23454;&#39564;&#35774;&#32622;&#65292;&#20854;&#20013;&#20010;&#20307;&#34987;&#38543;&#26426;&#20998;&#37197;&#21040;&#22788;&#29702;&#32452;&#65292;&#20294;&#23545;&#32593;&#32476;&#32467;&#26500;&#27809;&#26377;&#24178;&#39044;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#22312;&#20272;&#35745;&#24179;&#22343;&#30452;&#25509;&#22788;&#29702;&#25928;&#24212;&#26102;&#65292;&#24573;&#30053;&#32593;&#32476;&#20869;&#29983;&#24615;&#36827;&#34892;&#32447;&#24615;&#22238;&#24402;&#24182;&#27809;&#26377;&#38382;&#39064;&#12290;&#28982;&#32780;&#65292;&#23545;&#20110;&#20272;&#35745;&#24179;&#22343;&#28322;&#20986;&#25928;&#24212;&#65292;&#36825;&#31181;&#20570;&#27861;&#20250;&#23548;&#33268;&#26679;&#26412;&#36873;&#25321;&#20559;&#35823;&#21644;&#36127;&#26435;&#37325;&#38382;&#39064;&#12290;&#20026;&#20102;&#20811;&#26381;&#36825;&#20123;&#38382;&#39064;&#65292;&#25105;&#20204;&#25552;&#20986;&#20351;&#29992;&#28508;&#22312;&#21516;&#20276;&#22788;&#29702;&#20316;&#20026;&#24037;&#20855;&#21464;&#37327;&#65288;IV&#65289;&#65292;&#23427;&#33258;&#21160;&#25104;&#20026;&#23454;&#38469;&#28322;&#20986;&#26292;&#38706;&#30340;&#26377;&#25928;IV&#12290;&#21033;&#29992;&#36825;&#20010;IV&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#20004;&#20010;&#22522;&#20110;IV&#30340;&#20272;&#35745;&#37327;&#65292;&#24182;&#35777;&#26126;&#23427;&#20204;&#23545;&#20110;&#28322;&#20986;&#25928;&#24212;&#20855;&#26377;&#23616;&#37096;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#31867;&#22411;&#30340;&#22240;&#26524;&#35299;&#37322;&#12290;
&lt;/p&gt;
&lt;p&gt;
This study investigates the causal interpretation of linear social interaction models in the presence of endogeneity in network formation under a heterogeneous treatment effects framework. We consider an experimental setting in which individuals are randomly assigned to treatments while no interventions are made for the network structure. We show that running a linear regression ignoring network endogeneity is not problematic for estimating the average direct treatment effect. However, it leads to sample selection bias and negative-weights problem for the estimation of the average spillover effect. To overcome these problems, we propose using potential peer treatment as an instrumental variable (IV), which is automatically a valid IV for actual spillover exposure. Using this IV, we examine two IV-based estimands and demonstrate that they have a local average treatment-effect-type causal interpretation for the spillover effect.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#20171;&#32461;&#20102;&#22312;&#38754;&#26495;&#25968;&#25454;&#38408;&#20540;&#22238;&#24402;&#20013;&#24341;&#20837;&#20102;&#21333;&#20301;&#29305;&#23450;&#30340;&#24322;&#36136;&#24615;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#21442;&#25968;&#20272;&#35745;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#21487;&#20197;&#26356;&#24555;&#22320;&#25910;&#25947;&#12290;&#23545;&#36153;&#23572;&#26031;&#22374;-&#23453;&#37324;&#22885;&#21345;&#20043;&#35868;&#30340;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#8230;&#8230;</title><link>http://arxiv.org/abs/2308.04057</link><description>&lt;p&gt;
&#24322;&#36136;&#38754;&#26495;&#25968;&#25454;&#20013;&#30340;&#38408;&#20540;&#22238;&#24402;&#19982;&#20132;&#20114;&#22266;&#23450;&#25928;&#24212;
&lt;/p&gt;
&lt;p&gt;
Threshold Regression in Heterogeneous Panel Data with Interactive Fixed Effects. (arXiv:2308.04057v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.04057
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#22312;&#38754;&#26495;&#25968;&#25454;&#38408;&#20540;&#22238;&#24402;&#20013;&#24341;&#20837;&#20102;&#21333;&#20301;&#29305;&#23450;&#30340;&#24322;&#36136;&#24615;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#21442;&#25968;&#20272;&#35745;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#21487;&#20197;&#26356;&#24555;&#22320;&#25910;&#25947;&#12290;&#23545;&#36153;&#23572;&#26031;&#22374;-&#23453;&#37324;&#22885;&#21345;&#20043;&#35868;&#30340;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#8230;&#8230;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#22312;&#38754;&#26495;&#25968;&#25454;&#38408;&#20540;&#22238;&#24402;&#20013;&#24341;&#20837;&#20102;&#21333;&#20301;&#29305;&#23450;&#30340;&#24322;&#36136;&#24615;&#12290;&#26012;&#29575;&#31995;&#25968;&#21644;&#38408;&#20540;&#21442;&#25968;&#37117;&#20801;&#35768;&#22240;&#21333;&#20301;&#32780;&#24322;&#12290;&#24322;&#36136;&#38408;&#20540;&#21442;&#25968;&#36890;&#36807;&#21333;&#20301;&#19987;&#26377;&#30340;&#32463;&#39564;&#20998;&#20301;&#25968;&#36716;&#25442;&#26469;&#34920;&#31034;&#65292;&#35813;&#36716;&#25442;&#30001;&#25972;&#20010;&#38754;&#26495;&#25968;&#25454;&#39640;&#25928;&#20272;&#35745;&#24471;&#20986;&#12290;&#22312;&#35823;&#24046;&#39033;&#20013;&#65292;&#38754;&#26495;&#25968;&#25454;&#30340;&#26410;&#35266;&#27979;&#24322;&#36136;&#24615;&#37319;&#29992;&#20102;&#20132;&#20114;&#22266;&#23450;&#25928;&#24212;&#30340;&#19968;&#33324;&#24418;&#24335;&#12290;&#36825;&#31181;&#26032;&#24341;&#20837;&#30340;&#21442;&#25968;&#24322;&#36136;&#24615;&#23545;&#27169;&#22411;&#30340;&#35782;&#21035;&#12289;&#20272;&#35745;&#12289;&#35299;&#37322;&#21644;&#28176;&#36817;&#25512;&#26029;&#37117;&#26377;&#37325;&#35201;&#24433;&#21709;&#12290;&#20551;&#35774;&#38408;&#20540;&#24133;&#24230;&#25910;&#32553;&#65292;&#29616;&#22312;&#24847;&#21619;&#30528;&#24322;&#36136;&#24615;&#30340;&#25910;&#32553;&#65292;&#20351;&#24471;&#20272;&#35745;&#22120;&#30340;&#25910;&#25947;&#36895;&#24230;&#27604;&#20197;&#21069;&#26356;&#24555;&#12290;&#25105;&#20204;&#25512;&#23548;&#20102;&#25152;&#25552;&#20986;&#20272;&#35745;&#22120;&#30340;&#28176;&#36817;&#29702;&#35770;&#65292;&#33945;&#29305;&#21345;&#27931;&#27169;&#25311;&#32467;&#26524;&#34920;&#26126;&#20854;&#22312;&#23567;&#26679;&#26412;&#20013;&#30340;&#26377;&#25928;&#24615;&#12290;&#25105;&#20204;&#24212;&#29992;&#26032;&#27169;&#22411;&#23545;&#36153;&#23572;&#26031;&#22374;-&#23453;&#37324;&#22885;&#21345;&#20043;&#35868;&#36827;&#34892;&#20102;&#30740;&#31350;&#65292;&#21457;&#29616;&#8230;&#8230;
&lt;/p&gt;
&lt;p&gt;
This paper introduces unit-specific heterogeneity in panel data threshold regression. Both slope coefficients and threshold parameters are allowed to vary by unit. The heterogeneous threshold parameters manifest via a unit-specific empirical quantile transformation of a common underlying threshold parameter which is estimated efficiently from the whole panel. In the errors, the unobserved heterogeneity of the panel takes the general form of interactive fixed effects. The newly introduced parameter heterogeneity has implications for model identification, estimation, interpretation, and asymptotic inference. The assumption of a shrinking threshold magnitude now implies shrinking heterogeneity and leads to faster estimator rates of convergence than previously encountered. The asymptotic theory for the proposed estimators is derived and Monte Carlo simulations demonstrate its usefulness in small samples. The new model is employed to examine the Feldstein-Horioka puzzle and it is found that
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#36890;&#36807;&#25554;&#34917;&#26041;&#27861;&#26500;&#24314;&#39640;&#39057;&#32463;&#27982;&#25351;&#26631;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#21033;&#29992;&#24050;&#26377;&#30340;&#20302;&#39057;&#25193;&#25955;&#25351;&#25968;&#21644;&#20174;&#39640;&#39057;&#25968;&#25454;&#20272;&#35745;&#30340;&#22810;&#20010;&#22240;&#23376;&#26469;&#25554;&#34917;&#39640;&#39057;&#25968;&#25454;&#65292;&#32771;&#34385;&#24207;&#21015;&#30456;&#20851;&#24615;&#30340;&#21160;&#24577;&#36807;&#31243;&#21487;&#20197;&#24471;&#21040;&#26356;&#20934;&#30830;&#30340;&#25554;&#34917;&#20540;&#12290;</title><link>http://arxiv.org/abs/2303.01863</link><description>&lt;p&gt;
&#21033;&#29992;&#25554;&#34917;&#26041;&#27861;&#26500;&#24314;&#39640;&#39057;&#32463;&#27982;&#25351;&#26631;
&lt;/p&gt;
&lt;p&gt;
Constructing High Frequency Economic Indicators by Imputation. (arXiv:2303.01863v2 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.01863
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#36890;&#36807;&#25554;&#34917;&#26041;&#27861;&#26500;&#24314;&#39640;&#39057;&#32463;&#27982;&#25351;&#26631;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#21033;&#29992;&#24050;&#26377;&#30340;&#20302;&#39057;&#25193;&#25955;&#25351;&#25968;&#21644;&#20174;&#39640;&#39057;&#25968;&#25454;&#20272;&#35745;&#30340;&#22810;&#20010;&#22240;&#23376;&#26469;&#25554;&#34917;&#39640;&#39057;&#25968;&#25454;&#65292;&#32771;&#34385;&#24207;&#21015;&#30456;&#20851;&#24615;&#30340;&#21160;&#24577;&#36807;&#31243;&#21487;&#20197;&#24471;&#21040;&#26356;&#20934;&#30830;&#30340;&#25554;&#34917;&#20540;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36890;&#24120;&#23558;&#26376;&#24230;&#21644;&#21608;&#24230;&#32463;&#27982;&#25351;&#26631;&#35270;&#20026;&#20174;&#39640;&#39057;&#21644;&#20302;&#39057;&#25968;&#25454;&#20013;&#20272;&#35745;&#20986;&#30340;&#26368;&#22823;&#20844;&#22240;&#23376;&#65292;&#21487;&#20197;&#20998;&#21035;&#25110;&#32852;&#21512;&#20351;&#29992;&#12290;&#20026;&#20102;&#22312;&#19981;&#30452;&#25509;&#24314;&#27169;&#30340;&#24773;&#20917;&#19979;&#34701;&#21512;&#28151;&#21512;&#39057;&#29575;&#30340;&#20449;&#24687;&#65292;&#25105;&#20204;&#38024;&#23545;&#24050;&#26377;&#30340;&#20302;&#39057;&#25193;&#25955;&#25351;&#25968;&#65292;&#23558;&#39640;&#39057;&#20540;&#35270;&#20026;&#32570;&#22833;&#20540;&#36827;&#34892;&#25554;&#34917;&#12290;&#25105;&#20204;&#20351;&#29992;&#20174;&#39640;&#39057;&#25968;&#25454;&#20272;&#35745;&#20986;&#30340;&#22810;&#20010;&#22240;&#23376;&#26469;&#25554;&#34917;&#36825;&#20123;&#20540;&#12290;&#22312;&#32771;&#34385;&#30340;&#23454;&#35777;&#20363;&#23376;&#20013;&#65292;&#19981;&#32771;&#34385;&#29305;&#24322;&#35823;&#24046;&#30340;&#24207;&#21015;&#30456;&#20851;&#24615;&#30340;&#38745;&#24577;&#30697;&#38453;&#23436;&#25104;&#24471;&#21040;&#30340;&#32570;&#22833;&#20540;&#20272;&#35745;&#19981;&#31934;&#30830;&#65292;&#32780;&#26080;&#35770;&#22240;&#23376;&#26159;&#22914;&#20309;&#20272;&#35745;&#30340;&#12290;&#32771;&#34385;&#24207;&#21015;&#30456;&#20851;&#24615;&#30340;&#21333;&#26041;&#31243;&#21644;&#22522;&#20110;&#31995;&#32479;&#30340;&#21160;&#24577;&#36807;&#31243;&#24471;&#21040;&#30340;&#25554;&#34917;&#20540;&#26356;&#25509;&#36817;&#35266;&#27979;&#21040;&#30340;&#20302;&#39057;&#20540;&#12290;&#36825;&#22312;&#23558;&#28040;&#36153;&#32773;&#24773;&#32490;&#25351;&#26631;&#30340;&#26376;&#24230;&#20540;&#25554;&#34917;&#21040;1978&#24180;&#20043;&#21069;&#21482;&#26377;&#23395;&#24230;&#25968;&#25454;&#21457;&#24067;&#30340;&#21453;&#20107;&#23454;&#32451;&#20064;&#20013;&#20063;&#36866;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;
Monthly and weekly economic indicators are often taken to be the largest common factor estimated from high and low frequency data, either separately or jointly. To incorporate mixed frequency information without directly modeling them, we target a low frequency diffusion index that is already available, and treat high frequency values as missing. We impute these values using multiple factors estimated from the high frequency data. In the empirical examples considered, static matrix completion that does not account for serial correlation in the idiosyncratic errors yields imprecise estimates of the missing values irrespective of how the factors are estimated. Single equation and systems-based dynamic procedures that account for serial correlation yield imputed values that are closer to the observed low frequency ones. This is the case in the counterfactual exercise that imputes the monthly values of consumer sentiment series before 1978 when the data was released only on a quarterly bas
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#36890;&#36807;&#30740;&#31350;&#26368;&#20302;&#24037;&#36164;&#25919;&#31574;&#23545;&#36890;&#21220;&#36896;&#25104;&#30340;&#28322;&#20986;&#25928;&#24212;&#65292;&#21457;&#29616;&#24037;&#20316;&#22320;&#30340;&#26368;&#20302;&#24037;&#36164;&#22686;&#21152;&#20250;&#23548;&#33268;&#23621;&#20303;&#22320;&#31199;&#37329;&#19978;&#28072;&#65292;&#27599;10%&#30340;&#24037;&#20316;&#22320;&#26368;&#20302;&#24037;&#36164;&#22686;&#21152;&#23558;&#20351;&#23621;&#20303;&#22320;&#31199;&#37329;&#22686;&#21152;0.69%&#12290;</title><link>http://arxiv.org/abs/2208.01791</link><description>&lt;p&gt;
&#20174;&#24037;&#20316;&#22320;&#21040;&#23621;&#20303;&#22320;&#65306;&#26368;&#20302;&#24037;&#36164;&#25919;&#31574;&#23545;&#24403;&#22320;&#20303;&#25151;&#24066;&#22330;&#30340;&#28322;&#20986;&#25928;&#24212;
&lt;/p&gt;
&lt;p&gt;
From Workplace to Residence: The Spillover Effects of Minimum Wage Policies on Local Housing Markets. (arXiv:2208.01791v2 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2208.01791
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#36890;&#36807;&#30740;&#31350;&#26368;&#20302;&#24037;&#36164;&#25919;&#31574;&#23545;&#36890;&#21220;&#36896;&#25104;&#30340;&#28322;&#20986;&#25928;&#24212;&#65292;&#21457;&#29616;&#24037;&#20316;&#22320;&#30340;&#26368;&#20302;&#24037;&#36164;&#22686;&#21152;&#20250;&#23548;&#33268;&#23621;&#20303;&#22320;&#31199;&#37329;&#19978;&#28072;&#65292;&#27599;10%&#30340;&#24037;&#20316;&#22320;&#26368;&#20302;&#24037;&#36164;&#22686;&#21152;&#23558;&#20351;&#23621;&#20303;&#22320;&#31199;&#37329;&#22686;&#21152;0.69%&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#32654;&#22269;&#26368;&#36817;&#20986;&#29616;&#20102;&#21508;&#24030;&#39041;&#24067;&#22320;&#26041;&#26368;&#20302;&#24037;&#36164;&#25919;&#31574;&#65292;&#23548;&#33268;&#22478;&#24066;&#22320;&#21306;&#20869;&#30340;&#26368;&#20302;&#24037;&#36164;&#27700;&#24179;&#20986;&#29616;&#26174;&#33879;&#24046;&#24322;&#12290;&#26412;&#25991;&#36890;&#36807;&#36890;&#21220;&#30740;&#31350;&#36825;&#20123;&#25919;&#31574;&#23545;&#24403;&#22320;&#31199;&#25151;&#24066;&#22330;&#30340;&#28322;&#20986;&#25928;&#24212;&#12290;&#25105;&#20204;&#26681;&#25454;&#23621;&#27665;&#24037;&#20316;&#22320;&#28857;&#26500;&#24314;&#27599;&#20010;&#37038;&#25919;&#32534;&#30721;&#21306;&#22495;&#30340;&#8220;&#24037;&#20316;&#22320;&#8221;&#26368;&#20302;&#24037;&#36164;&#27700;&#24179;&#65292;&#24182;&#29992;&#23427;&#20272;&#35745;&#26368;&#20302;&#24037;&#36164;&#25919;&#31574;&#23545;&#31199;&#37329;&#30340;&#24433;&#21709;&#12290;&#25105;&#20204;&#37319;&#29992;&#20102;&#19968;&#31181;&#26032;&#30340;&#35782;&#21035;&#31574;&#30053;&#65292;&#21033;&#29992;&#20102;&#20849;&#20139;&#8220;&#23621;&#20303;&#22320;&#8221;&#26368;&#20302;&#24037;&#36164;&#27700;&#24179;&#65288;&#21363;&#30456;&#21516;&#22320;&#28857;&#30340;&#26368;&#20302;&#24037;&#36164;&#27700;&#24179;&#65289;&#30340;&#37038;&#25919;&#32534;&#30721;&#21306;&#22495;&#20043;&#38388;&#24037;&#20316;&#22320;&#26368;&#20302;&#24037;&#36164;&#21464;&#21270;&#30340;&#32454;&#33410;&#26102;&#26426;&#19981;&#21516;&#12290;&#25105;&#20204;&#30340;&#22522;&#20934;&#32467;&#26524;&#34920;&#26126;&#65292;&#24037;&#20316;&#22320;&#26368;&#20302;&#24037;&#36164;&#27700;&#24179;&#22686;&#21152;10%&#20250;&#23548;&#33268;&#23621;&#20303;&#22320;&#37038;&#25919;&#32534;&#30721;&#21306;&#22495;&#30340;&#31199;&#37329;&#22686;&#21152;0.69%&#12290;&#20026;&#20102;&#35828;&#26126;&#36890;&#21220;&#27169;&#24335;&#30340;&#37325;&#35201;&#24615;&#65292;&#25105;&#20204;&#20351;&#29992;&#20272;&#35745;&#32467;&#26524;&#21644;&#19968;&#20010;&#31616;&#21333;&#30340;&#27169;&#22411;&#26469;&#27169;&#25311;&#32852;&#37030;&#21644;&#22478;&#24066;&#34394;&#25311;&#26368;&#20302;&#24037;&#36164;&#25919;&#31574;&#30340;&#24433;&#21709;&#12290;&#27169;&#25311;&#32467;&#26524;&#34920;&#26126;&#65292;&#25151;&#19996;&#27599;&#25910;&#20837;1&#32654;&#20803;&#65292;&#22823;&#32422;&#20250;&#20837;&#34955;10&#32654;&#20998;&#12290;
&lt;/p&gt;
&lt;p&gt;
The recent rise of sub-national minimum wage (MW) policies in the US has resulted in significant dispersion of MW levels within urban areas. In this paper, we study the spillover effects of these policies on local rental markets through commuting. To do so, for each USPS ZIP code we construct a "workplace" MW measure based on the location of its resident's jobs, and use it to estimate the effect of MW policies on rents. We use a novel identification strategy that exploits the fine timing of differential changes in the workplace MW across ZIP codes that share the same "residence" MW, defined as the same location's MW. Our baseline results imply that a 10 percent increase in the workplace MW increases rents at residence ZIP codes by 0.69 percent. To illustrate the importance of commuting patterns, we use our estimates and a simple model to simulate the impact of federal and city counterfactual MW policies. The simulations suggest that landlords pocket approximately 10 cents of each dolla
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25506;&#35752;&#20102;&#27835;&#30103;&#25928;&#24212;&#35780;&#20272;&#26041;&#27861;DiD&#30340;&#20027;&#35201;&#35782;&#21035;&#20551;&#35774;&#8212;&#8212;&#24179;&#34892;&#36235;&#21183;&#19982;&#32463;&#27982;&#27169;&#22411;&#21160;&#24577;&#36873;&#25321;&#30340;&#32852;&#31995;&#65292; &#38416;&#26126;&#20102;&#20854;&#23545;&#20195;&#29702;&#34892;&#20026;&#30340;&#24433;&#21709;&#65292;&#24182;&#25351;&#20986;&#36825;&#20123;&#36873;&#25321;&#21160;&#26426;&#22914;&#20309;&#23548;&#33268;&#23545;&#24179;&#34892;&#36235;&#21183;&#30340;&#36829;&#21453;&#65292;&#26368;&#21518;&#25552;&#20986;&#20102;&#36866;&#24212;&#36825;&#20123;&#21160;&#24577;&#36873;&#25321;&#29305;&#24449;&#30340;&#20854;&#20182;&#20551;&#35774;&#19982;&#35782;&#21035;&#32467;&#26524;&#12290;</title><link>http://arxiv.org/abs/2207.06564</link><description>&lt;p&gt;
&#24179;&#34892;&#36235;&#21183;&#21644;&#21160;&#24577;&#36873;&#25321;
&lt;/p&gt;
&lt;p&gt;
Parallel Trends and Dynamic Choices. (arXiv:2207.06564v2 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2207.06564
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25506;&#35752;&#20102;&#27835;&#30103;&#25928;&#24212;&#35780;&#20272;&#26041;&#27861;DiD&#30340;&#20027;&#35201;&#35782;&#21035;&#20551;&#35774;&#8212;&#8212;&#24179;&#34892;&#36235;&#21183;&#19982;&#32463;&#27982;&#27169;&#22411;&#21160;&#24577;&#36873;&#25321;&#30340;&#32852;&#31995;&#65292; &#38416;&#26126;&#20102;&#20854;&#23545;&#20195;&#29702;&#34892;&#20026;&#30340;&#24433;&#21709;&#65292;&#24182;&#25351;&#20986;&#36825;&#20123;&#36873;&#25321;&#21160;&#26426;&#22914;&#20309;&#23548;&#33268;&#23545;&#24179;&#34892;&#36235;&#21183;&#30340;&#36829;&#21453;&#65292;&#26368;&#21518;&#25552;&#20986;&#20102;&#36866;&#24212;&#36825;&#20123;&#21160;&#24577;&#36873;&#25321;&#29305;&#24449;&#30340;&#20854;&#20182;&#20551;&#35774;&#19982;&#35782;&#21035;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
Difference-in-differences&#65288;DiD&#65289;&#26159;&#19968;&#31181;&#24120;&#29992;&#30340;&#20272;&#35745;&#27835;&#30103;&#25928;&#24212;&#30340;&#26041;&#27861;&#65292;&#24179;&#34892;&#36235;&#21183;&#26159;&#20854;&#26368;&#20027;&#35201;&#30340;&#35782;&#21035;&#20551;&#35774;&#65306;&#26410;&#32463;&#22788;&#29702;&#32467;&#26524;&#30340;&#24179;&#22343;&#36235;&#21183;&#24517;&#39035;&#19982;&#35266;&#23519;&#21040;&#30340;&#27835;&#30103;&#29366;&#24577;&#26080;&#20851;&#12290;&#22312;&#35266;&#23519;&#35774;&#32622;&#20013;&#65292;&#27835;&#30103;&#36890;&#24120;&#26159;&#30001;&#29702;&#24615;&#34892;&#20026;&#32773;&#65288;&#22914;&#25919;&#31574;&#21046;&#23450;&#32773;&#12289;&#20844;&#21496;&#25110;&#20010;&#20307;&#34892;&#20026;&#32773;&#65289;&#20570;&#20986;&#25110;&#24433;&#21709;&#30340;&#21160;&#24577;&#36873;&#25321;&#12290;&#26412;&#25991;&#23558;&#24179;&#34892;&#36235;&#21183;&#20551;&#35774;&#19982;&#21160;&#24577;&#36873;&#25321;&#30340;&#32463;&#27982;&#27169;&#22411;&#32852;&#31995;&#36215;&#26469;&#65292;&#36825;&#20123;&#27169;&#22411;&#20801;&#35768;&#21160;&#24577;&#36873;&#25321;&#21160;&#26426;&#65292;&#22914;&#23398;&#20064;&#25110;&#26368;&#20248;&#20572;&#27490;&#12290;&#22312;&#36825;&#20123;&#24773;&#20917;&#19979;&#65292;&#25105;&#20204;&#38416;&#26126;&#20102;&#24179;&#34892;&#36235;&#21183;&#23545;&#20195;&#29702;&#34892;&#20026;&#30340;&#24433;&#21709;&#65292;&#24182;&#23637;&#31034;&#20102;&#36825;&#20123;&#36873;&#25321;&#21160;&#26426;&#22914;&#20309;&#22312;&#31616;&#21333;&#30340;&#29615;&#22659;&#20013;&#23548;&#33268;&#23545;&#24179;&#34892;&#36235;&#21183;&#30340;&#36829;&#21453;&#65292;&#21363;&#20351;&#39044;&#26399;&#20851;&#27880;&#34987;&#25490;&#38500;&#22312;&#22806;&#25110;&#26410;&#32463;&#22788;&#29702;&#32467;&#26524;&#30340;&#24179;&#22343;&#20540;&#20445;&#25345;&#19981;&#21464;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#32771;&#34385;&#20102;&#19968;&#20123;&#20551;&#35774;&#19979;&#30340;&#35782;&#21035;&#32467;&#26524;&#65292;&#20197;&#36866;&#24212;&#36825;&#20123;&#21160;&#24577;&#36873;&#25321;&#30340;&#29305;&#24449;&#12290;
&lt;/p&gt;
&lt;p&gt;
Difference-in-differences (or DiD) is a commonly used method for estimating treatment effects, and parallel trends is its main identifying assumption: the trend in mean untreated outcomes must be independent of the observed treatment status. In observational settings, treatment is often a dynamic choice made or influenced by rational agents, such as policy-makers, firms, or individual agents. This paper relates the parallel trends assumption to economic models of dynamic choice, which allow for dynamic selection motives such as learning or optimal stopping. In these cases, we clarify the implications of parallel trends on agent behavior, and we show how these selection motives can lead to violations of parallel trends even in simple settings where anticipation concerns are ruled out or when mean untreated outcomes are stationary. Finally, we consider some identification results under alternative assumptions that accommodate these features of dynamic choice.
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#22522;&#20110;&#26333;&#20809;&#26144;&#23556;&#30340;&#26032;&#27010;&#24565;&#65292;&#20197;&#35299;&#20915;&#20010;&#20307;&#22312;&#31038;&#20132;&#32593;&#32476;&#20013;&#30456;&#20114;&#20316;&#29992;&#19988;&#21487;&#33021;&#19981;&#36981;&#20174;&#27835;&#30103;&#26041;&#26696;&#30340;&#24773;&#20917;&#19979;&#30340;&#22240;&#26524;&#25512;&#26029;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2108.07455</link><description>&lt;p&gt;
&#38750;&#36981;&#20174;&#21644;&#26410;&#30693;&#24178;&#25200;&#30340;&#22240;&#26524;&#25512;&#26029;
&lt;/p&gt;
&lt;p&gt;
Causal Inference with Noncompliance and Unknown Interference. (arXiv:2108.07455v3 [stat.ME] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2108.07455
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#22522;&#20110;&#26333;&#20809;&#26144;&#23556;&#30340;&#26032;&#27010;&#24565;&#65292;&#20197;&#35299;&#20915;&#20010;&#20307;&#22312;&#31038;&#20132;&#32593;&#32476;&#20013;&#30456;&#20114;&#20316;&#29992;&#19988;&#21487;&#33021;&#19981;&#36981;&#20174;&#27835;&#30103;&#26041;&#26696;&#30340;&#24773;&#20917;&#19979;&#30340;&#22240;&#26524;&#25512;&#26029;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#32771;&#34385;&#19968;&#20010;&#22240;&#26524;&#25512;&#26029;&#27169;&#22411;&#65292;&#20854;&#20013;&#20010;&#20307;&#22312;&#31038;&#20132;&#32593;&#32476;&#20013;&#30456;&#20114;&#20316;&#29992;&#65292;&#24182;&#19988;&#21487;&#33021;&#19981;&#36981;&#20174;&#34987;&#20998;&#37197;&#30340;&#27835;&#30103;&#26041;&#26696;&#12290;&#29305;&#21035;&#22320;&#65292;&#25105;&#20204;&#20551;&#35774;&#32593;&#32476;&#24178;&#25200;&#24418;&#24335;&#23545;&#30740;&#31350;&#20154;&#21592;&#26159;&#26410;&#30693;&#30340;&#12290;&#20026;&#20102;&#22312;&#36825;&#31181;&#24773;&#20917;&#19979;&#20272;&#35745;&#26377;&#24847;&#20041;&#30340;&#22240;&#26524;&#21442;&#25968;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#20010;&#26032;&#30340;&#26333;&#20809;&#26144;&#23556;&#27010;&#24565;&#65292;&#23558;&#28508;&#22312;&#22797;&#26434;&#30340;&#28322;&#20986;&#25928;&#24212;&#24635;&#32467;&#20026;&#22266;&#23450;&#32500;&#24230;&#30340;&#24037;&#20855;&#21464;&#37327;&#32479;&#35745;&#37327;&#12290;&#25105;&#20204;&#30740;&#31350;&#20102;&#24847;&#21521;&#27835;&#30103;&#25928;&#24212;&#21644;&#36981;&#20174;&#32773;&#30340;&#24179;&#22343;&#27835;&#30103;&#25928;&#24212;&#30340;&#35782;&#21035;&#26465;&#20214;&#65292;&#21516;&#26102;&#26126;&#30830;&#32771;&#34385;&#21040;&#26333;&#20809;&#26144;&#23556;&#38169;&#35823;&#35268;&#23450;&#30340;&#21487;&#33021;&#24615;&#12290;&#22522;&#20110;&#25105;&#20204;&#30340;&#35782;&#21035;&#32467;&#26524;&#65292;&#25105;&#20204;&#36890;&#36807;&#36870;&#27010;&#29575;&#21152;&#26435;&#24320;&#21457;&#20102;&#38750;&#21442;&#25968;&#20272;&#35745;&#36807;&#31243;&#12290;&#23427;&#20204;&#30340;&#28176;&#36817;&#24615;&#36136;&#65292;&#21253;&#25324;&#19968;&#31181;&#36817;&#20284;&#37051;&#22495;&#24178;&#25200;&#26694;&#26550;&#19979;&#30340;&#19968;&#33268;&#24615;&#21644;&#28176;&#36817;&#27491;&#24577;&#24615;&#12290;&#20026;&#20102;&#19968;&#20010;&#23454;&#35777;&#31034;&#20363;&#65292;&#25105;&#20204;&#23558;&#25105;&#20204;&#30340;&#26041;&#27861;&#24212;&#29992;&#20110;&#23454;&#39564;&#25968;&#25454;&#12290;
&lt;/p&gt;
&lt;p&gt;
We consider a causal inference model in which individuals interact in a social network and they may not comply with the assigned treatments. In particular, we suppose that the form of network interference is unknown to researchers. To estimate meaningful causal parameters in this situation, we introduce a new concept of exposure mapping, which summarizes potentially complicated spillover effects into a fixed dimensional statistic of instrumental variables. We investigate identification conditions for the intention-to-treat effects and the average treatment effects for compliers, while explicitly considering the possibility of misspecification of exposure mapping. Based on our identification results, we develop nonparametric estimation procedures via inverse probability weighting. Their asymptotic properties, including consistency and asymptotic normality, are investigated using an approximate neighborhood interference framework. For an empirical illustration, we apply our method to exp
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#36890;&#36807;&#20998;&#26512;Reddit&#30340;WallStreetBets&#35770;&#22363;&#19978;&#30340;&#20132;&#26131;&#32773;&#30340;&#20449;&#24565;&#21644;&#25345;&#20179;&#24773;&#20917;&#65292;&#30740;&#31350;&#20102;&#31038;&#20132;&#21147;&#37327;&#22914;&#20309;&#24433;&#21709;&#36164;&#20135;&#20215;&#26684;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#31038;&#20132;&#23186;&#20307;&#19978;&#34920;&#36798;&#30340;&#24773;&#32490;&#21644;&#36807;&#21435;&#36164;&#20135;&#22238;&#25253;&#24433;&#21709;&#20132;&#26131;&#32773;&#23545;&#36164;&#20135;&#26410;&#26469;&#34920;&#29616;&#30340;&#30475;&#28072;&#25110;&#30475;&#36300;&#30340;&#24773;&#32490;&#65292;&#38646;&#21806;&#20132;&#26131;&#32773;&#30340;&#38656;&#27714;&#21463;&#21040;&#35770;&#22363;&#35752;&#35770;&#30340;&#24433;&#21709;&#65292;&#29305;&#24322;&#24615;&#25237;&#36164;&#32773;&#24773;&#32490;&#30340;&#24066;&#22330;&#24433;&#21709;&#25193;&#22823;&#65292;&#24182;&#19988;&#28818;&#20316;&#25237;&#36164;&#32773;&#26356;&#23481;&#26131;&#21463;&#21040;&#24066;&#22330;&#27873;&#27819;&#30340;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2104.01847</link><description>&lt;p&gt;
&#31038;&#20250;&#20256;&#26579;&#21644;&#36164;&#20135;&#20215;&#26684;&#65306;Reddit&#30340;&#33258;&#32452;&#32455;&#29275;&#24066;&#36816;&#34892;
&lt;/p&gt;
&lt;p&gt;
Social contagion and asset prices: Reddit's self-organised bull runs. (arXiv:2104.01847v5 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2104.01847
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36890;&#36807;&#20998;&#26512;Reddit&#30340;WallStreetBets&#35770;&#22363;&#19978;&#30340;&#20132;&#26131;&#32773;&#30340;&#20449;&#24565;&#21644;&#25345;&#20179;&#24773;&#20917;&#65292;&#30740;&#31350;&#20102;&#31038;&#20132;&#21147;&#37327;&#22914;&#20309;&#24433;&#21709;&#36164;&#20135;&#20215;&#26684;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#31038;&#20132;&#23186;&#20307;&#19978;&#34920;&#36798;&#30340;&#24773;&#32490;&#21644;&#36807;&#21435;&#36164;&#20135;&#22238;&#25253;&#24433;&#21709;&#20132;&#26131;&#32773;&#23545;&#36164;&#20135;&#26410;&#26469;&#34920;&#29616;&#30340;&#30475;&#28072;&#25110;&#30475;&#36300;&#30340;&#24773;&#32490;&#65292;&#38646;&#21806;&#20132;&#26131;&#32773;&#30340;&#38656;&#27714;&#21463;&#21040;&#35770;&#22363;&#35752;&#35770;&#30340;&#24433;&#21709;&#65292;&#29305;&#24322;&#24615;&#25237;&#36164;&#32773;&#24773;&#32490;&#30340;&#24066;&#22330;&#24433;&#21709;&#25193;&#22823;&#65292;&#24182;&#19988;&#28818;&#20316;&#25237;&#36164;&#32773;&#26356;&#23481;&#26131;&#21463;&#21040;&#24066;&#22330;&#27873;&#27819;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#31038;&#20132;&#23186;&#20307;&#20013;&#30340;&#38750;&#32467;&#26500;&#21270;&#25991;&#26412;&#25968;&#25454;&#33021;&#21542;&#24110;&#21161;&#35299;&#37322;&#22823;&#22411;&#36164;&#20135;&#20215;&#26684;&#27874;&#21160;&#30340;&#39537;&#21160;&#22240;&#32032;&#65311;&#26412;&#25991;&#36890;&#36807;&#20351;&#29992;&#26426;&#22120;&#23398;&#20064;&#24037;&#20855;&#25552;&#21462;Reddit&#30340;WallStreetBets&#65288;WSB&#65289;&#35770;&#22363;&#19978;&#27963;&#36291;&#30340;&#8220;&#28818;&#20316;&#8221;&#20132;&#26131;&#32773;&#30340;&#20449;&#24565;&#21644;&#25345;&#20179;&#24773;&#20917;&#65292;&#30740;&#31350;&#31038;&#20250;&#21147;&#37327;&#22914;&#20309;&#24433;&#21709;&#36164;&#20135;&#20215;&#26684;&#12290;&#25105;&#20204;&#30340;&#31616;&#21270;&#27169;&#22411;&#26174;&#31034;&#65292;&#21516;&#20276;&#25928;&#24212;&#26377;&#21161;&#20110;&#35299;&#37322;&#22238;&#25253;&#21487;&#39044;&#27979;&#24615;&#21644;&#36870;&#36716;&#65292;&#20197;&#21450;&#27873;&#27819;&#21160;&#21147;&#23398;&#12290;&#25105;&#20204;&#32463;&#39564;&#24615;&#22320;&#35760;&#24405;&#19979;&#65292;WSB&#29992;&#25143;&#23545;&#36164;&#20135;&#26410;&#26469;&#34920;&#29616;&#65288;&#30475;&#28072;&#25110;&#30475;&#36300;&#65289;&#30340;&#24773;&#32490;&#37096;&#20998;&#28304;&#20110;&#20854;&#21516;&#20276;&#21644;&#36807;&#21435;&#30340;&#36164;&#20135;&#22238;&#25253;&#30340;&#24773;&#32490;&#12290;&#26412;&#25991;&#30452;&#25509;&#20272;&#35745;&#20102;WSB&#27963;&#21160;&#23545;&#36164;&#20135;&#20215;&#26684;&#30340;&#24433;&#21709;&#12290;&#25105;&#20204;&#35760;&#24405;&#19979;&#65306;&#38646;&#21806;&#20132;&#26131;&#32773;&#38656;&#27714;&#36890;&#36807;&#20351;&#29992;&#20132;&#26131;&#21644;&#34892;&#24773;&#65288;TAQ&#65289;&#25968;&#25454;&#36319;&#38543;WSB&#35752;&#35770;&#65292;&#38646;&#21806;&#20132;&#26131;&#32773;&#35328;&#35770;&#23545;&#20215;&#26684;&#30340;&#21487;&#39044;&#27979;&#24615;&#65292;&#22312;&#32447;&#30149;&#27602;&#20869;&#23481;&#24341;&#21457;&#30340;&#29305;&#24322;&#24615;&#25237;&#36164;&#32773;&#24773;&#32490;&#30340;&#24066;&#22330;&#24433;&#21709;&#25193;&#22823;&#65292;&#20197;&#21450;&#28818;&#20316;&#25237;&#36164;&#32773;&#23545;&#24066;&#22330;&#27873;&#27819;&#30340;&#26356;&#39640;&#26333;&#20809;&#24230;&#12290;
&lt;/p&gt;
&lt;p&gt;
Can unstructured text data from social media help explain the drivers of large asset price fluctuations? This paper investigates how social forces affect asset prices, by using machine learning tools to extract beliefs and positions of `hype' traders active on Reddit's WallStreetBets (WSB) forum. Our stylized model shows that peer effects help explain return predictability and reversals, as well as bubble dynamics. We empirically document that sentiments expressed by WSB users about assets' future performances (bullish or bearish) are in part due to sentiments of their peers and past asset returns. The paper directly estimates the effect of WSB activity on asset prices. We document: that retail trader demand follows WSB discussions through using Trade and Quote (TAQ) data, the predictability of prices from retail trader discourse, the amplified market impact of idiosyncratic investor sentiment from viral content online, and the greater exposure of hype investors to bubbles in the marke
&lt;/p&gt;</description></item><item><title>&#36825;&#39033;&#30740;&#31350;&#21457;&#29616;&#65292;&#26032;&#39062;&#24230;&#19981;&#19968;&#23450;&#24847;&#21619;&#30528;&#26356;&#22823;&#30340;&#25910;&#30410;&#65292;&#36890;&#36807;&#36229;&#21069;&#30740;&#31350;&#21487;&#20197;&#25913;&#21892;&#30693;&#35782;&#30340;&#28436;&#21270;&#12290;</title><link>http://arxiv.org/abs/2102.13434</link><description>&lt;p&gt;
&#30693;&#35782;&#25506;&#32034;
&lt;/p&gt;
&lt;p&gt;
A Quest for Knowledge. (arXiv:2102.13434v7 [econ.TH] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2102.13434
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#30740;&#31350;&#21457;&#29616;&#65292;&#26032;&#39062;&#24230;&#19981;&#19968;&#23450;&#24847;&#21619;&#30528;&#26356;&#22823;&#30340;&#25910;&#30410;&#65292;&#36890;&#36807;&#36229;&#21069;&#30740;&#31350;&#21487;&#20197;&#25913;&#21892;&#30693;&#35782;&#30340;&#28436;&#21270;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26356;&#22810;&#30340;&#26032;&#39062;&#30740;&#31350;&#24635;&#26159;&#35753;&#20154;&#21521;&#24448;&#30340;&#21527;&#65311;&#25105;&#20204;&#26500;&#24314;&#20102;&#19968;&#20010;&#27169;&#22411;&#65292;&#20854;&#20013;&#30693;&#35782;&#22609;&#36896;&#20102;&#31038;&#20250;&#30340;&#25919;&#31574;&#65292;&#24182;&#25351;&#23548;&#21457;&#29616;&#30340;&#25628;&#32034;&#12290;&#30740;&#31350;&#20154;&#21592;&#36873;&#25321;&#19968;&#20010;&#38382;&#39064;&#20197;&#21450;&#23545;&#20854;&#36827;&#34892;&#28145;&#20837;&#30740;&#31350;&#30340;&#31243;&#24230;&#12290;&#38382;&#39064;&#30340;&#26032;&#39062;&#24615;&#20915;&#23450;&#20102;&#21457;&#29616;&#31572;&#26696;&#30340;&#20215;&#20540;&#21644;&#38590;&#24230;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#21457;&#29616;&#30340;&#25910;&#30410;&#22312;&#26032;&#39062;&#24615;&#19978;&#26159;&#38750;&#21333;&#35843;&#30340;&#12290;&#30693;&#35782;&#22312;&#26102;&#38388;&#19978;&#36880;&#27493;&#20869;&#29983;&#22320;&#25193;&#23637;&#12290;&#36890;&#36807;&#19968;&#31181;&#21160;&#24577;&#22806;&#37096;&#24615;&#65292;&#36229;&#21069;&#30740;&#31350;-&#23545;&#27604;&#36828;&#36828;&#36229;&#36807;&#30524;&#21069;&#26368;&#20248;&#36873;&#25321;&#30340;&#38382;&#39064;&#36827;&#34892;&#30740;&#31350;-&#21487;&#20197;&#25913;&#21892;&#30693;&#35782;&#30340;&#28436;&#21270;&#12290;&#36229;&#21069;&#30740;&#31350;&#24341;&#21457;&#20102;&#30740;&#31350;&#21608;&#26399;&#65292;&#38543;&#21518;&#30340;&#30740;&#31350;&#20154;&#21592;&#23558;&#36229;&#21069;&#30740;&#31350;&#19982;&#20808;&#21069;&#30340;&#30693;&#35782;&#30456;&#36830;&#25509;&#12290;
&lt;/p&gt;
&lt;p&gt;
Is more novel research always desirable? We develop a model in which knowledge shapes society's policies and guides the search for discoveries. Researchers select a question and how intensely to study it. The novelty of a question determines both the value and difficulty of discovering its answer. We show that the benefits of discoveries are nonmonotone in novelty. Knowledge expands endogenously step-by-step over time. Through a dynamic externality, moonshots -- research on questions more novel than what is myopically optimal -- can improve the evolution of knowledge. Moonshots induce research cycles in which subsequent researchers connect the moonshot to previous knowledge.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#21033;&#29992;&#31532;&#20108;&#27425;&#19990;&#30028;&#22823;&#25112;&#26399;&#38388;&#30340;&#24615;&#21035;&#22833;&#34913;&#24773;&#20917;&#65292;&#30740;&#31350;&#20102;&#23545;&#26085;&#26412;&#23130;&#23035;&#24066;&#22330;&#21644;&#29983;&#32946;&#32467;&#26524;&#30340;&#24433;&#21709;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#30007;&#24615;&#22312;&#23130;&#23035;&#24066;&#22330;&#21644;&#29983;&#32946;&#20915;&#31574;&#20013;&#27604;&#22899;&#24615;&#20855;&#26377;&#26356;&#24378;&#30340;&#35758;&#20215;&#22320;&#20301;&#65292;&#22312;&#30456;&#23545;&#30007;&#24615;&#31232;&#32570;&#30340;&#24773;&#20917;&#19979;&#65292;&#20154;&#20204;&#26356;&#26377;&#21487;&#33021;&#32467;&#23130;&#21644;&#31163;&#23130;&#65292;&#20294;&#20007;&#20598;&#22919;&#22899;&#37325;&#26032;&#23130;&#23035;&#30340;&#21487;&#33021;&#24615;&#36739;&#20302;&#12290;&#27492;&#22806;&#65292;&#30740;&#31350;&#36824;&#21457;&#29616;&#65292;&#22899;&#24615;&#22312;&#23130;&#23035;&#24066;&#22330;&#19978;&#30340;&#35758;&#20215;&#22320;&#20301;&#21487;&#33021;&#24182;&#27809;&#26377;&#25913;&#21892;&#65292;&#32780;&#30456;&#23545;&#30007;&#24615;&#31232;&#32570;&#30340;&#22320;&#21306;&#30340;&#23130;&#20869;&#29983;&#32946;&#29575;&#21644;&#27515;&#32974;&#29575;&#22686;&#21152;&#12290;&#22240;&#27492;&#65292;&#36825;&#34920;&#26126;&#23478;&#24237;&#20869;&#37096;&#35758;&#20215;&#30340;&#29702;&#35770;&#39044;&#27979;&#20855;&#26377;&#31283;&#20581;&#24615;&#12290;</title><link>http://arxiv.org/abs/2102.00687</link><description>&lt;p&gt;
&#24615;&#21035;&#22833;&#34913;&#23545;&#26085;&#26412;&#23130;&#23035;&#21644;&#29983;&#32946;&#30340;&#24433;&#21709;&#65306;&#20197;&#31532;&#20108;&#27425;&#19990;&#30028;&#22823;&#25112;&#20026;&#20363;&#35777;
&lt;/p&gt;
&lt;p&gt;
The Impacts of the Gender Imbalance on Marriage and Birth: Evidence from World War II in Japan. (arXiv:2102.00687v2 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2102.00687
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#21033;&#29992;&#31532;&#20108;&#27425;&#19990;&#30028;&#22823;&#25112;&#26399;&#38388;&#30340;&#24615;&#21035;&#22833;&#34913;&#24773;&#20917;&#65292;&#30740;&#31350;&#20102;&#23545;&#26085;&#26412;&#23130;&#23035;&#24066;&#22330;&#21644;&#29983;&#32946;&#32467;&#26524;&#30340;&#24433;&#21709;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#30007;&#24615;&#22312;&#23130;&#23035;&#24066;&#22330;&#21644;&#29983;&#32946;&#20915;&#31574;&#20013;&#27604;&#22899;&#24615;&#20855;&#26377;&#26356;&#24378;&#30340;&#35758;&#20215;&#22320;&#20301;&#65292;&#22312;&#30456;&#23545;&#30007;&#24615;&#31232;&#32570;&#30340;&#24773;&#20917;&#19979;&#65292;&#20154;&#20204;&#26356;&#26377;&#21487;&#33021;&#32467;&#23130;&#21644;&#31163;&#23130;&#65292;&#20294;&#20007;&#20598;&#22919;&#22899;&#37325;&#26032;&#23130;&#23035;&#30340;&#21487;&#33021;&#24615;&#36739;&#20302;&#12290;&#27492;&#22806;&#65292;&#30740;&#31350;&#36824;&#21457;&#29616;&#65292;&#22899;&#24615;&#22312;&#23130;&#23035;&#24066;&#22330;&#19978;&#30340;&#35758;&#20215;&#22320;&#20301;&#21487;&#33021;&#24182;&#27809;&#26377;&#25913;&#21892;&#65292;&#32780;&#30456;&#23545;&#30007;&#24615;&#31232;&#32570;&#30340;&#22320;&#21306;&#30340;&#23130;&#20869;&#29983;&#32946;&#29575;&#21644;&#27515;&#32974;&#29575;&#22686;&#21152;&#12290;&#22240;&#27492;&#65292;&#36825;&#34920;&#26126;&#23478;&#24237;&#20869;&#37096;&#35758;&#20215;&#30340;&#29702;&#35770;&#39044;&#27979;&#20855;&#26377;&#31283;&#20581;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#21033;&#29992;&#31532;&#20108;&#27425;&#19990;&#30028;&#22823;&#25112;&#26399;&#38388;&#30007;&#24615;&#25439;&#22833;&#23548;&#33268;&#24615;&#21035;&#27604;&#20363;&#21069;&#25152;&#26410;&#26377;&#30340;&#21464;&#21270;&#65292;&#26469;&#30740;&#31350;&#24615;&#21035;&#22833;&#34913;&#23545;&#26085;&#26412;&#23130;&#23035;&#24066;&#22330;&#21644;&#29983;&#32946;&#32467;&#26524;&#30340;&#24433;&#21709;&#12290;&#21033;&#29992;&#26032;&#25968;&#23383;&#21270;&#30340;&#22522;&#20110;&#20154;&#21475;&#26222;&#26597;&#30340;&#21382;&#21490;&#32479;&#35745;&#25968;&#25454;&#65292;&#25105;&#20204;&#21457;&#29616;&#30007;&#24615;&#22312;&#23130;&#23035;&#24066;&#22330;&#21644;&#23478;&#24237;&#20869;&#37096;&#30340;&#29983;&#32946;&#20915;&#31574;&#20013;&#27604;&#22899;&#24615;&#20855;&#26377;&#26356;&#24378;&#30340;&#35758;&#20215;&#22320;&#20301;&#12290;&#22312;&#30456;&#23545;&#30007;&#24615;&#31232;&#32570;&#30340;&#24773;&#20917;&#19979;&#65292;&#23588;&#20854;&#26159;&#24180;&#36731;&#20154;&#26356;&#26377;&#21487;&#33021;&#32467;&#23130;&#21644;&#31163;&#23130;&#65292;&#20294;&#26159;&#20007;&#20598;&#22919;&#22899;&#37325;&#26032;&#23130;&#23035;&#30340;&#21487;&#33021;&#24615;&#27604;&#20007;&#20598;&#30007;&#24615;&#35201;&#20302;&#12290;&#25105;&#20204;&#36824;&#21457;&#29616;&#65292;&#22899;&#24615;&#22312;&#23130;&#23035;&#24066;&#22330;&#19978;&#30340;&#35758;&#20215;&#22320;&#20301;&#22312;1950&#24180;&#20195;&#21487;&#33021;&#24182;&#27809;&#26377;&#25913;&#21892;&#12290;&#22312;&#25112;&#21518;&#22549;&#32974;&#27861;&#24459;&#30340;&#21046;&#24230;&#21464;&#21270;&#19979;&#65292;&#30456;&#23545;&#30007;&#24615;&#31232;&#32570;&#30340;&#22320;&#21306;&#30340;&#23130;&#20869;&#29983;&#32946;&#29575;&#21644;&#27515;&#32974;&#29575;&#22686;&#21152;&#12290;&#25105;&#20204;&#20851;&#20110;&#38750;&#23130;&#29983;&#23376;&#22899;&#30340;&#32467;&#26524;&#34920;&#26126;&#65292;&#22312;&#23478;&#24237;&#20869;&#37096;&#35758;&#20215;&#30340;&#29702;&#35770;&#39044;&#27979;&#22312;&#32463;&#27982;&#20307;&#20013;&#26159;&#20855;&#26377;&#31283;&#20581;&#24615;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
This study uses the unprecedented changes in the sex ratio due to the losses of men during World War II to identify the impacts of the gender imbalance on marriage market and birth outcomes in Japan. Using newly digitized census-based historical statistics, we find evidence that men had a stronger bargaining position in the marriage market and intra-household fertility decisions than women. Under relative male scarcity, while people, especially younger people, were more likely to marry and divorce, widowed women were less likely to remarry than widowed men. We also find that women's bargaining position in the marriage market might not have improved throughout the 1950s. Given the institutional changes in the abortion law after the war, marital fertility and stillbirth rates increased in the areas that suffered relative male scarcity. Our result on out-of-wedlock births indicates that the theoretical prediction of intra-household bargaining is considered to be robust in an economy in wh
&lt;/p&gt;</description></item></channel></rss>