<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#26412;&#25991;&#32771;&#34385;&#20102;&#22312;&#27809;&#26377;&#23545;&#29031;&#32452;&#30340;&#24773;&#20917;&#19979;&#20272;&#35745;&#21644;&#25512;&#26029;&#25919;&#31574;&#25928;&#26524;&#30340;&#38382;&#39064;&#12290;&#25105;&#20204;&#21033;&#29992;&#30701;&#26399;&#27835;&#30103;&#21069;&#25968;&#25454;&#65292;&#22522;&#20110;&#39044;&#27979;&#21453;&#20107;&#23454;&#24773;&#20917;&#24471;&#21040;&#20102;&#20010;&#20307;&#27835;&#30103;&#25928;&#26524;&#30340;&#26080;&#20559;&#20272;&#35745;&#21644;&#24179;&#22343;&#27835;&#30103;&#25928;&#26524;&#30340;&#19968;&#33268;&#19988;&#28176;&#36817;&#27491;&#24577;&#30340;&#20272;&#35745;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#20851;&#27880;&#39044;&#27979;&#30340;&#26080;&#20559;&#24615;&#32780;&#19981;&#26159;&#20934;&#30830;&#24615;&#26159;&#24456;&#37325;&#35201;&#30340;&#65292;&#32780;&#39044;&#27979;&#27169;&#22411;&#30340;&#27491;&#30830;&#35268;&#33539;&#24182;&#19981;&#26159;&#24517;&#38656;&#30340;&#65292;&#31616;&#21333;&#30340;&#22522;&#30784;&#20989;&#25968;&#22238;&#24402;&#21487;&#20197;&#36798;&#21040;&#26080;&#20559;&#20272;&#35745;&#12290;&#22312;&#19968;&#23450;&#26465;&#20214;&#19979;&#65292;&#25105;&#20204;&#30340;&#26041;&#27861;&#20855;&#26377;&#19968;&#33268;&#24615;&#21644;&#28176;&#36817;&#27491;&#24577;&#24615;&#12290;</title><link>http://arxiv.org/abs/2309.05639</link><description>&lt;p&gt;
&#39044;&#27979;&#27835;&#30103;&#25928;&#26524;
&lt;/p&gt;
&lt;p&gt;
Forecasted Treatment Effects. (arXiv:2309.05639v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.05639
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#32771;&#34385;&#20102;&#22312;&#27809;&#26377;&#23545;&#29031;&#32452;&#30340;&#24773;&#20917;&#19979;&#20272;&#35745;&#21644;&#25512;&#26029;&#25919;&#31574;&#25928;&#26524;&#30340;&#38382;&#39064;&#12290;&#25105;&#20204;&#21033;&#29992;&#30701;&#26399;&#27835;&#30103;&#21069;&#25968;&#25454;&#65292;&#22522;&#20110;&#39044;&#27979;&#21453;&#20107;&#23454;&#24773;&#20917;&#24471;&#21040;&#20102;&#20010;&#20307;&#27835;&#30103;&#25928;&#26524;&#30340;&#26080;&#20559;&#20272;&#35745;&#21644;&#24179;&#22343;&#27835;&#30103;&#25928;&#26524;&#30340;&#19968;&#33268;&#19988;&#28176;&#36817;&#27491;&#24577;&#30340;&#20272;&#35745;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#20851;&#27880;&#39044;&#27979;&#30340;&#26080;&#20559;&#24615;&#32780;&#19981;&#26159;&#20934;&#30830;&#24615;&#26159;&#24456;&#37325;&#35201;&#30340;&#65292;&#32780;&#39044;&#27979;&#27169;&#22411;&#30340;&#27491;&#30830;&#35268;&#33539;&#24182;&#19981;&#26159;&#24517;&#38656;&#30340;&#65292;&#31616;&#21333;&#30340;&#22522;&#30784;&#20989;&#25968;&#22238;&#24402;&#21487;&#20197;&#36798;&#21040;&#26080;&#20559;&#20272;&#35745;&#12290;&#22312;&#19968;&#23450;&#26465;&#20214;&#19979;&#65292;&#25105;&#20204;&#30340;&#26041;&#27861;&#20855;&#26377;&#19968;&#33268;&#24615;&#21644;&#28176;&#36817;&#27491;&#24577;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#32771;&#34385;&#22312;&#27809;&#26377;&#23545;&#29031;&#32452;&#30340;&#24773;&#20917;&#19979;&#20272;&#35745;&#21644;&#25512;&#26029;&#25919;&#31574;&#25928;&#26524;&#12290;&#25105;&#20204;&#22522;&#20110;&#20351;&#29992;&#19968;&#27573;&#30701;&#26399;&#27835;&#30103;&#21069;&#25968;&#25454;&#39044;&#27979;&#21453;&#20107;&#23454;&#24773;&#20917;&#65292;&#24471;&#21040;&#20102;&#20010;&#20307;&#65288;&#24322;&#36136;&#65289;&#27835;&#30103;&#25928;&#26524;&#30340;&#26080;&#20559;&#20272;&#35745;&#21644;&#19968;&#33268;&#19988;&#28176;&#36817;&#27491;&#24577;&#30340;&#24179;&#22343;&#27835;&#30103;&#25928;&#26524;&#20272;&#35745;&#12290;&#25105;&#20204;&#34920;&#26126;&#65292;&#24212;&#35813;&#20851;&#27880;&#39044;&#27979;&#26080;&#20559;&#24615;&#32780;&#19981;&#26159;&#20934;&#30830;&#24615;&#12290;&#23545;&#39044;&#27979;&#27169;&#22411;&#30340;&#27491;&#30830;&#35268;&#33539;&#24182;&#19981;&#26159;&#33719;&#24471;&#20010;&#20307;&#27835;&#30103;&#25928;&#26524;&#30340;&#26080;&#20559;&#20272;&#35745;&#25152;&#24517;&#38656;&#30340;&#12290;&#30456;&#21453;&#65292;&#22312;&#24191;&#27867;&#30340;&#25968;&#25454;&#29983;&#25104;&#36807;&#31243;&#19979;&#65292;&#31616;&#21333;&#30340;&#22522;&#30784;&#20989;&#25968;&#65288;&#22914;&#22810;&#39033;&#24335;&#26102;&#38388;&#36235;&#21183;&#65289;&#22238;&#24402;&#21487;&#20197;&#25552;&#20379;&#26080;&#20559;&#24615;&#26469;&#20272;&#35745;&#20010;&#20307;&#21453;&#20107;&#23454;&#24773;&#20917;&#12290;&#22522;&#20110;&#27169;&#22411;&#30340;&#39044;&#27979;&#21487;&#33021;&#24341;&#20837;&#35268;&#33539;&#38169;&#35823;&#20559;&#24046;&#65292;&#24182;&#19988;&#21363;&#20351;&#22312;&#27491;&#30830;&#35268;&#33539;&#19979;&#20063;&#19981;&#19968;&#23450;&#33021;&#25552;&#39640;&#24615;&#33021;&#12290;&#25105;&#20204;&#30340;&#39044;&#27979;&#24179;&#22343;&#27835;&#30103;&#25928;&#26524;&#65288;FAT&#65289;&#20272;&#35745;&#22120;&#30340;&#19968;&#33268;&#24615;&#21644;&#28176;&#36817;&#27491;&#24577;&#24615;&#22312;&#19968;&#23450;&#26465;&#20214;&#19979;&#24471;&#21040;&#20445;&#35777;&#12290;
&lt;/p&gt;
&lt;p&gt;
We consider estimation and inference of the effects of a policy in the absence of a control group. We obtain unbiased estimators of individual (heterogeneous) treatment effects and a consistent and asymptotically normal estimator of the average treatment effects, based on forecasting counterfactuals using a short time series of pre-treatment data. We show that the focus should be on forecast unbiasedness rather than accuracy. Correct specification of the forecasting model is not necessary to obtain unbiased estimates of individual treatment effects. Instead, simple basis function (e.g., polynomial time trends) regressions deliver unbiasedness under a broad class of data-generating processes for the individual counterfactuals. Basing the forecasts on a model can introduce misspecification bias and does not necessarily improve performance even under correct specification. Consistency and asymptotic normality of our Forecasted Average Treatment effects (FAT) estimator are attained under a
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#32771;&#34385;&#20102;&#39044;&#27979;&#22238;&#24402;&#20013;&#31995;&#25968;&#38543;&#26426;&#24615;&#30340;&#26816;&#39564;&#65292;&#24182;&#21457;&#29616;&#22312;&#38543;&#26426;&#31995;&#25968;&#30340;&#25345;&#20037;&#24615;&#26041;&#38754;&#20250;&#24433;&#21709;&#21508;&#31181;&#26816;&#39564;&#30340;&#21151;&#25928;&#12290;&#25105;&#20204;&#24314;&#35758;&#22312;&#23454;&#38469;&#24212;&#29992;&#20013;&#26681;&#25454;&#28508;&#22312;&#38543;&#26426;&#31995;&#25968;&#30340;&#25345;&#20037;&#24615;&#36873;&#25321;&#26368;&#21512;&#36866;&#30340;&#26816;&#39564;&#26041;&#27861;&#12290;</title><link>http://arxiv.org/abs/2309.04926</link><description>&lt;p&gt;
&#39044;&#27979;&#22238;&#24402;&#20013;&#22266;&#23450;&#31995;&#25968;&#38543;&#26426;&#24615;&#30340;&#26816;&#39564;&#65306;&#31283;&#24577;&#19982;&#25345;&#20037;&#24615;&#31995;&#25968;&#30340;&#24433;&#21709;
&lt;/p&gt;
&lt;p&gt;
Testing for Stationary or Persistent Coefficient Randomness in Predictive Regressions. (arXiv:2309.04926v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.04926
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#32771;&#34385;&#20102;&#39044;&#27979;&#22238;&#24402;&#20013;&#31995;&#25968;&#38543;&#26426;&#24615;&#30340;&#26816;&#39564;&#65292;&#24182;&#21457;&#29616;&#22312;&#38543;&#26426;&#31995;&#25968;&#30340;&#25345;&#20037;&#24615;&#26041;&#38754;&#20250;&#24433;&#21709;&#21508;&#31181;&#26816;&#39564;&#30340;&#21151;&#25928;&#12290;&#25105;&#20204;&#24314;&#35758;&#22312;&#23454;&#38469;&#24212;&#29992;&#20013;&#26681;&#25454;&#28508;&#22312;&#38543;&#26426;&#31995;&#25968;&#30340;&#25345;&#20037;&#24615;&#36873;&#25321;&#26368;&#21512;&#36866;&#30340;&#26816;&#39564;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#32771;&#34385;&#20102;&#39044;&#27979;&#22238;&#24402;&#20013;&#31995;&#25968;&#38543;&#26426;&#24615;&#30340;&#26816;&#39564;&#12290;&#25105;&#20204;&#20851;&#27880;&#31995;&#25968;&#38543;&#26426;&#24615;&#26816;&#39564;&#22312;&#38543;&#26426;&#31995;&#25968;&#30340;&#25345;&#20037;&#24615;&#26041;&#38754;&#30340;&#24433;&#21709;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#24403;&#38543;&#26426;&#31995;&#25968;&#26159;&#31283;&#24577;&#30340;&#25110;I(0)&#26102;&#65292;Nyblom&#30340;LM&#26816;&#39564;&#22312;&#21151;&#25928;&#19978;&#19981;&#26159;&#26368;&#20248;&#30340;&#65292;&#36825;&#19968;&#28857;&#24050;&#32463;&#38024;&#23545;&#38598;&#25104;&#25110;I(1)&#38543;&#26426;&#31995;&#25968;&#30340;&#22791;&#25321;&#20551;&#35774;&#24471;&#21040;&#20102;&#35777;&#23454;&#12290;&#25105;&#20204;&#36890;&#36807;&#26500;&#24314;&#19968;&#20123;&#22312;&#38543;&#26426;&#31995;&#25968;&#20026;&#31283;&#24577;&#26102;&#20855;&#26377;&#26356;&#39640;&#21151;&#25928;&#30340;&#26816;&#39564;&#26469;&#35777;&#26126;&#36825;&#19968;&#28857;&#65292;&#23613;&#31649;&#22312;&#38543;&#26426;&#31995;&#25968;&#20026;&#38598;&#25104;&#26102;&#65292;&#36825;&#20123;&#26816;&#39564;&#22312;&#21151;&#25928;&#19978;&#34987;LM&#26816;&#39564;&#25152;&#25903;&#37197;&#12290;&#36825;&#24847;&#21619;&#30528;&#22312;&#19981;&#21516;&#30340;&#32972;&#26223;&#19979;&#65292;&#31995;&#25968;&#38543;&#26426;&#24615;&#30340;&#26368;&#20339;&#26816;&#39564;&#26159;&#19981;&#21516;&#30340;&#65292;&#20174;&#32780;&#23454;&#35777;&#30740;&#31350;&#32773;&#24212;&#35813;&#32771;&#34385;&#28508;&#22312;&#38543;&#26426;&#31995;&#25968;&#30340;&#25345;&#20037;&#24615;&#65292;&#24182;&#30456;&#24212;&#22320;&#36873;&#25321;&#22810;&#20010;&#26816;&#39564;&#12290;&#29305;&#21035;&#26159;&#65292;&#25105;&#20204;&#36890;&#36807;&#29702;&#35770;&#21644;&#25968;&#20540;&#30740;&#31350;&#34920;&#26126;&#65292;LM&#26816;&#39564;&#19982;&#19968;&#31181;Wald&#22411;&#26816;&#39564;&#30340;&#20056;&#31215;&#26159;&#19968;&#20010;&#36739;&#22909;&#30340;&#26816;&#39564;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
This study considers tests for coefficient randomness in predictive regressions. Our focus is on how tests for coefficient randomness are influenced by the persistence of random coefficient. We find that when the random coefficient is stationary, or I(0), Nyblom's (1989) LM test loses its optimality (in terms of power), which is established against the alternative of integrated, or I(1), random coefficient. We demonstrate this by constructing tests that are more powerful than the LM test when random coefficient is stationary, although these tests are dominated in terms of power by the LM test when random coefficient is integrated. This implies that the best test for coefficient randomness differs from context to context, and practitioners should take into account the persistence of potentially random coefficient and choose from several tests accordingly. In particular, we show through theoretical and numerical investigations that the product of the LM test and a Wald-type test proposed
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#36890;&#36807;&#31616;&#21333;&#35299;&#37322;&#20132;&#26131;&#32773;&#23545;&#26032;&#38395;&#30340;&#24577;&#24230;&#65292;&#35299;&#37322;&#20102;&#37329;&#34701;&#24066;&#22330;&#20013;&#30340;&#20004;&#20010;&#35268;&#24459;&#65306;&#23614;&#37325;&#20998;&#24067;&#21644;&#27874;&#21160;&#32858;&#31867;&#12290;</title><link>http://arxiv.org/abs/2309.04876</link><description>&lt;p&gt;
&#26032;&#38395;&#39537;&#21160;&#30340;&#26399;&#26395;&#19982;&#27874;&#21160;&#32858;&#31867;
&lt;/p&gt;
&lt;p&gt;
News-driven Expectations and Volatility Clustering. (arXiv:2309.04876v1 [q-fin.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.04876
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36890;&#36807;&#31616;&#21333;&#35299;&#37322;&#20132;&#26131;&#32773;&#23545;&#26032;&#38395;&#30340;&#24577;&#24230;&#65292;&#35299;&#37322;&#20102;&#37329;&#34701;&#24066;&#22330;&#20013;&#30340;&#20004;&#20010;&#35268;&#24459;&#65306;&#23614;&#37325;&#20998;&#24067;&#21644;&#27874;&#21160;&#32858;&#31867;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#37329;&#34701;&#27874;&#21160;&#36981;&#24490;&#20004;&#20010;&#24341;&#20154;&#27880;&#30446;&#30340;&#32463;&#39564;&#35268;&#24459;&#65292;&#36866;&#29992;&#20110;&#21508;&#31181;&#36164;&#20135;&#12289;&#21508;&#20010;&#24066;&#22330;&#21644;&#21508;&#20010;&#26102;&#38388;&#23610;&#24230;&#65306;&#23427;&#26159;&#23614;&#37325;&#30340;&#65288;&#26356;&#20934;&#30830;&#22320;&#35828;&#26159;&#31526;&#21512;&#24130;&#24459;&#20998;&#24067;&#65289;&#65292;&#24182;&#19988;&#22312;&#26102;&#38388;&#19978;&#20542;&#21521;&#20110;&#32858;&#31867;&#12290;&#35768;&#22810;&#26377;&#36259;&#30340;&#27169;&#22411;&#24050;&#34987;&#25552;&#20986;&#26469;&#35299;&#37322;&#36825;&#20123;&#35268;&#24459;&#65292;&#29305;&#21035;&#26159;&#22522;&#20110;&#20195;&#29702;&#20154;&#30340;&#27169;&#22411;&#65292;&#36890;&#36807;&#19968;&#31181;&#22797;&#26434;&#30340;&#38750;&#32447;&#24615;&#26426;&#21046;&#26469;&#27169;&#25311;&#36825;&#20004;&#20010;&#32463;&#39564;&#23450;&#24459;&#65292;&#20363;&#22914;&#20132;&#26131;&#32773;&#22312;&#39640;&#24230;&#38750;&#32447;&#24615;&#30340;&#26041;&#24335;&#19979;&#22312;&#20132;&#26131;&#31574;&#30053;&#20043;&#38388;&#30340;&#20999;&#25442;&#12290;&#26412;&#25991;&#31616;&#21333;&#22320;&#35299;&#37322;&#20102;&#36825;&#20004;&#20010;&#35268;&#24459;&#65292;&#21482;&#28041;&#21450;&#20132;&#26131;&#32773;&#23545;&#26032;&#38395;&#30340;&#24577;&#24230;&#65292;&#36825;&#31181;&#35299;&#37322;&#20960;&#20046;&#26159;&#26681;&#25454;&#37329;&#34701;&#24066;&#22330;&#21442;&#19982;&#32773;&#30340;&#20256;&#32479;&#20108;&#20998;&#27861;&#26469;&#23450;&#20041;&#30340;&#65292;&#25237;&#36164;&#32773;&#19982;&#25237;&#26426;&#32773;&#65292;&#20182;&#20204;&#30340;&#34892;&#20026;&#34987;&#31616;&#21270;&#20026;&#26368;&#31616;&#21333;&#30340;&#24418;&#24335;&#12290;&#20551;&#35774;&#38271;&#26399;&#25237;&#36164;&#32773;&#23545;&#36164;&#20135;&#30340;&#20272;&#20540;&#36981;&#24490;&#22522;&#20110;&#26032;&#38395;&#30340;&#38543;&#26426;&#28459;&#27493;&#65292;&#22240;&#27492;&#25429;&#25417;&#21040;&#20102;&#25237;&#36164;&#32773;&#23545;&#22522;&#26412;&#26032;&#38395;&#30340;&#25345;&#20037;&#12289;&#38271;&#26399;&#30340;&#35760;&#24518;&#12290;
&lt;/p&gt;
&lt;p&gt;
Financial volatility obeys two fascinating empirical regularities that apply to various assets, on various markets, and on various time scales: it is fat-tailed (more precisely power-law distributed) and it tends to be clustered in time. Many interesting models have been proposed to account for these regularities, notably agent-based models, which mimic the two empirical laws through a complex mix of nonlinear mechanisms such as traders' switching between trading strategies in highly nonlinear way. This paper explains the two regularities simply in terms of traders' attitudes towards news, an explanation that follows almost by definition of the traditional dichotomy of financial market participants, investors versus speculators, whose behaviors are reduced to their simplest forms. Long-run investors' valuations of an asset are assumed to follow a news-driven random walk, thus capturing the investors' persistent, long memory of fundamental news. Short-term speculators' anticipated retur
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#24341;&#20837;&#20102;&#38750;&#32447;&#24615;&#32500;&#24230;&#38477;&#20302;&#26041;&#27861;&#65292;&#22312;&#22240;&#23376;&#25193;&#23637;&#21521;&#37327;&#33258;&#22238;&#24402;&#20013;&#20998;&#26512;&#32463;&#27982;&#20914;&#20987;&#65292;&#35777;&#26126;&#20102;&#22312;&#32463;&#27982;&#21608;&#26399;&#21160;&#33633;&#21644;&#39640;&#24230;&#27874;&#21160;&#25968;&#25454;&#19979;&#65292;&#35813;&#26041;&#27861;&#20855;&#26377;&#33391;&#22909;&#30340;&#39044;&#27979;&#24615;&#33021;&#65292;&#24182;&#33021;&#22788;&#29702;COVID-19&#30123;&#24773;&#24341;&#36215;&#30340;&#31163;&#32676;&#20540;&#12290;</title><link>http://arxiv.org/abs/2309.04821</link><description>&lt;p&gt;
&#38750;&#32447;&#24615;&#32500;&#24230;&#38477;&#20302;&#22312;&#22240;&#23376;&#25193;&#23637;&#21521;&#37327;&#33258;&#22238;&#24402;&#20013;&#30340;&#24212;&#29992;
&lt;/p&gt;
&lt;p&gt;
Non-linear dimension reduction in factor-augmented vector autoregressions. (arXiv:2309.04821v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.04821
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#24341;&#20837;&#20102;&#38750;&#32447;&#24615;&#32500;&#24230;&#38477;&#20302;&#26041;&#27861;&#65292;&#22312;&#22240;&#23376;&#25193;&#23637;&#21521;&#37327;&#33258;&#22238;&#24402;&#20013;&#20998;&#26512;&#32463;&#27982;&#20914;&#20987;&#65292;&#35777;&#26126;&#20102;&#22312;&#32463;&#27982;&#21608;&#26399;&#21160;&#33633;&#21644;&#39640;&#24230;&#27874;&#21160;&#25968;&#25454;&#19979;&#65292;&#35813;&#26041;&#27861;&#20855;&#26377;&#33391;&#22909;&#30340;&#39044;&#27979;&#24615;&#33021;&#65292;&#24182;&#33021;&#22788;&#29702;COVID-19&#30123;&#24773;&#24341;&#36215;&#30340;&#31163;&#32676;&#20540;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#23558;&#38750;&#32447;&#24615;&#32500;&#24230;&#38477;&#20302;&#26041;&#27861;&#24341;&#20837;&#22240;&#23376;&#25193;&#23637;&#21521;&#37327;&#33258;&#22238;&#24402;&#27169;&#22411;&#65292;&#20998;&#26512;&#19981;&#21516;&#32463;&#27982;&#20914;&#20987;&#30340;&#24433;&#21709;&#12290;&#20316;&#32773;&#35748;&#20026;&#22312;&#32463;&#27982;&#21608;&#26399;&#21160;&#33633;&#26102;&#65292;&#25511;&#21046;&#22823;&#32500;&#24230;&#25968;&#25454;&#38598;&#19982;&#28508;&#22312;&#22240;&#23376;&#20043;&#38388;&#30340;&#38750;&#32447;&#24615;&#20851;&#31995;&#23588;&#20026;&#26377;&#29992;&#12290;&#36890;&#36807;&#27169;&#25311;&#23454;&#39564;&#35777;&#26126;&#65292;&#38750;&#32447;&#24615;&#32500;&#24230;&#38477;&#20302;&#25216;&#26415;&#22312;&#25968;&#25454;&#39640;&#24230;&#27874;&#21160;&#26102;&#20855;&#26377;&#33391;&#22909;&#30340;&#39044;&#27979;&#24615;&#33021;&#12290;&#22312;&#23454;&#35777;&#24212;&#29992;&#20013;&#65292;&#26412;&#25991;&#25490;&#38500;&#21644;&#21253;&#21547;COVID-19&#30123;&#24773;&#35266;&#27979;&#65292;&#30830;&#23450;&#20102;&#36135;&#24065;&#25919;&#31574;&#21644;&#19981;&#30830;&#23450;&#24615;&#20914;&#20987;&#12290;&#36825;&#20004;&#20010;&#24212;&#29992;&#34920;&#26126;&#38750;&#32447;&#24615;FAVAR&#26041;&#27861;&#33021;&#22815;&#22788;&#29702;COVID-19&#30123;&#24773;&#24341;&#36215;&#30340;&#26497;&#22823;&#31163;&#32676;&#20540;&#65292;&#24182;&#22312;&#20004;&#31181;&#24773;&#26223;&#19979;&#33719;&#24471;&#21487;&#38752;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper introduces non-linear dimension reduction in factor-augmented vector autoregressions to analyze the effects of different economic shocks. I argue that controlling for non-linearities between a large-dimensional dataset and the latent factors is particularly useful during turbulent times of the business cycle. In simulations, I show that non-linear dimension reduction techniques yield good forecasting performance, especially when data is highly volatile. In an empirical application, I identify a monetary policy as well as an uncertainty shock excluding and including observations of the COVID-19 pandemic. Those two applications suggest that the non-linear FAVAR approaches are capable of dealing with the large outliers caused by the COVID-19 pandemic and yield reliable results in both scenarios.
&lt;/p&gt;</description></item><item><title>&#22312;&#20449;&#24687;&#25552;&#20379;&#23454;&#39564;&#20013;&#65292;&#20351;&#29992;&#20449;&#24687;&#25552;&#20379;&#20316;&#20026;&#24037;&#20855;&#21464;&#37327;&#21487;&#33021;&#26080;&#27861;&#20135;&#29983;&#27491;&#21152;&#26435;&#30340;&#20449;&#24565;&#25928;&#24212;&#30340;&#24179;&#22343;&#20540;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#31227;&#21160;&#24037;&#20855;&#21464;&#37327;&#26694;&#26550;&#21644;&#20272;&#35745;&#22120;&#65292;&#36890;&#36807;&#21033;&#29992;&#20808;&#39564;&#21028;&#26029;&#20449;&#24565;&#26356;&#26032;&#30340;&#26041;&#21521;&#65292;&#21487;&#20197;&#33719;&#24471;&#27491;&#21152;&#26435;&#30340;&#20449;&#24565;&#25928;&#24212;&#30340;&#24179;&#22343;&#20540;&#12290;</title><link>http://arxiv.org/abs/2309.04793</link><description>&lt;p&gt;
&#22312;&#20449;&#24687;&#25552;&#20379;&#23454;&#39564;&#20013;&#35299;&#37322;IV&#20272;&#35745;&#22120;
&lt;/p&gt;
&lt;p&gt;
Interpreting IV Estimators in Information Provision Experiments. (arXiv:2309.04793v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.04793
&lt;/p&gt;
&lt;p&gt;
&#22312;&#20449;&#24687;&#25552;&#20379;&#23454;&#39564;&#20013;&#65292;&#20351;&#29992;&#20449;&#24687;&#25552;&#20379;&#20316;&#20026;&#24037;&#20855;&#21464;&#37327;&#21487;&#33021;&#26080;&#27861;&#20135;&#29983;&#27491;&#21152;&#26435;&#30340;&#20449;&#24565;&#25928;&#24212;&#30340;&#24179;&#22343;&#20540;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#31227;&#21160;&#24037;&#20855;&#21464;&#37327;&#26694;&#26550;&#21644;&#20272;&#35745;&#22120;&#65292;&#36890;&#36807;&#21033;&#29992;&#20808;&#39564;&#21028;&#26029;&#20449;&#24565;&#26356;&#26032;&#30340;&#26041;&#21521;&#65292;&#21487;&#20197;&#33719;&#24471;&#27491;&#21152;&#26435;&#30340;&#20449;&#24565;&#25928;&#24212;&#30340;&#24179;&#22343;&#20540;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36234;&#26469;&#36234;&#22810;&#30340;&#25991;&#29486;&#20351;&#29992;&#20449;&#24687;&#25552;&#20379;&#23454;&#39564;&#26469;&#34913;&#37327;&#8220;&#20449;&#24565;&#25928;&#24212;&#8221;&#8212;&#8212;&#21363;&#20449;&#24565;&#21464;&#21270;&#23545;&#34892;&#20026;&#30340;&#24433;&#21709;&#8212;&#8212;&#20854;&#20013;&#20449;&#24687;&#25552;&#20379;&#34987;&#29992;&#20316;&#20449;&#24565;&#30340;&#24037;&#20855;&#21464;&#37327;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#22312;&#20855;&#26377;&#24322;&#36136;&#20449;&#24565;&#25928;&#24212;&#30340;&#34987;&#21160;&#25511;&#21046;&#35774;&#35745;&#23454;&#39564;&#20013;&#65292;&#20351;&#29992;&#20449;&#24687;&#25552;&#20379;&#20316;&#20026;&#24037;&#20855;&#21464;&#37327;&#21487;&#33021;&#26080;&#27861;&#20135;&#29983;&#20449;&#24565;&#25928;&#24212;&#30340;&#27491;&#21152;&#26435;&#24179;&#22343;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#8220;&#31227;&#21160;&#24037;&#20855;&#21464;&#37327;&#8221;&#65288;MIV&#65289;&#26694;&#26550;&#21644;&#20272;&#35745;&#22120;&#65292;&#36890;&#36807;&#21033;&#29992;&#20808;&#39564;&#21028;&#26029;&#20449;&#24565;&#26356;&#26032;&#30340;&#26041;&#21521;&#65292;&#21487;&#20197;&#33719;&#24471;&#20449;&#24565;&#25928;&#24212;&#30340;&#27491;&#21152;&#26435;&#24179;&#22343;&#12290;&#19982;&#25991;&#29486;&#20013;&#24120;&#29992;&#30340;&#35268;&#33539;&#30456;&#27604;&#65292;&#25105;&#20204;&#30340;&#39318;&#36873;MIV&#21487;&#20197;&#36807;&#20998;&#21152;&#26435;&#20855;&#26377;&#36739;&#22823;&#20808;&#39564;&#35823;&#24046;&#30340;&#20010;&#20307;&#65307;&#27492;&#22806;&#65292;&#19968;&#20123;&#35268;&#33539;&#21487;&#33021;&#38656;&#35201;&#39069;&#22806;&#30340;&#20551;&#35774;&#25165;&#33021;&#20135;&#29983;&#27491;&#21152;&#26435;&#12290;
&lt;/p&gt;
&lt;p&gt;
A growing literature measures "belief effects" -- that is, the effect of a change in beliefs on one's actions -- using information provision experiments, where the provision of information is used as an instrument for beliefs. We show that in passive control design experiments with heterogeneous belief effects, using information provision as an instrument may not produce a positive weighted average of belief effects. We propose a "mover instrumental variables" (MIV) framework and estimator that attains a positive weighted average of belief effects by inferring the direction of belief updating using the prior. Relative to our preferred MIV, commonly used specifications in the literature produce a form of MIV that overweights individuals with larger prior errors; additionally, some specifications may require additional assumptions to generate positive weights.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#23558;&#33021;&#22815;&#38378;&#28865;&#30340;&#29983;&#24577;&#27169;&#22411;&#19982;&#20154;&#31867;&#36866;&#24212;&#27169;&#22411;&#30456;&#32467;&#21512;&#65292;&#20174;&#32780;&#25506;&#32034;&#38378;&#28865;&#23545;&#32852;&#21512;&#31038;&#20250;&#29615;&#22659;&#31995;&#32479;&#20013;&#20154;&#31867;&#31119;&#31049;&#30340;&#24433;&#21709;&#65292;&#24182;&#37325;&#28857;&#30740;&#31350;&#20102;&#38378;&#28865;&#23548;&#33268;&#31119;&#31049;&#19979;&#38477;&#30340;&#26465;&#20214;&#20197;&#21450;&#23545;&#36716;&#22411;&#21464;&#21270;&#30340;&#26368;&#20339;&#26102;&#26426;&#30340;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2309.04578</link><description>&lt;p&gt;
&#22312;&#31038;&#20250;&#29615;&#22659;&#31995;&#32479;&#21457;&#29983;&#30772;&#23616;&#36716;&#21464;&#26102;&#32500;&#31995;&#20154;&#31867;&#31119;&#31049;
&lt;/p&gt;
&lt;p&gt;
Maintaining human wellbeing as socio-environmental systems undergo regime shifts. (arXiv:2309.04578v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.04578
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#23558;&#33021;&#22815;&#38378;&#28865;&#30340;&#29983;&#24577;&#27169;&#22411;&#19982;&#20154;&#31867;&#36866;&#24212;&#27169;&#22411;&#30456;&#32467;&#21512;&#65292;&#20174;&#32780;&#25506;&#32034;&#38378;&#28865;&#23545;&#32852;&#21512;&#31038;&#20250;&#29615;&#22659;&#31995;&#32479;&#20013;&#20154;&#31867;&#31119;&#31049;&#30340;&#24433;&#21709;&#65292;&#24182;&#37325;&#28857;&#30740;&#31350;&#20102;&#38378;&#28865;&#23548;&#33268;&#31119;&#31049;&#19979;&#38477;&#30340;&#26465;&#20214;&#20197;&#21450;&#23545;&#36716;&#22411;&#21464;&#21270;&#30340;&#26368;&#20339;&#26102;&#26426;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20840;&#29699;&#29615;&#22659;&#21464;&#21270;&#27491;&#25512;&#21160;&#35768;&#22810;&#31038;&#20250;&#29615;&#22659;&#31995;&#32479;&#26397;&#30528;&#20020;&#30028;&#38408;&#20540;&#36808;&#36827;&#65292;&#22312;&#36825;&#20123;&#38408;&#20540;&#19978;&#65292;&#29983;&#24577;&#31995;&#32479;&#29366;&#24577;&#22788;&#20110;&#20020;&#30028;&#36716;&#25240;&#28857;, &#38656;&#35201;&#24178;&#39044;&#26469;&#24341;&#23548;&#25110;&#36991;&#20813;&#21363;&#23558;&#21457;&#29983;&#30340;&#36716;&#21464;&#12290;&#38378;&#28865;&#26159;&#25351;&#31995;&#32479;&#22312;&#19981;&#21516;&#31283;&#23450;&#29366;&#24577;&#20043;&#38388;&#25671;&#25670;&#30340;&#29616;&#35937;&#65292;&#34987;&#35748;&#20026;&#26159;&#23545;&#21521;&#19981;&#21487;&#21462;&#30340;&#29983;&#24577;&#21046;&#24230;&#36827;&#34892;&#26080;&#27861;&#36870;&#36716;&#30340;&#36716;&#21464;&#30340;&#26377;&#29992;&#39044;&#35686;&#20449;&#21495;&#12290;&#28982;&#32780;&#65292;&#23613;&#31649;&#38378;&#28865;&#21487;&#33021;&#39044;&#31034;&#19968;&#20010;&#29983;&#24577;&#36716;&#25240;&#28857;&#65292;&#36825;&#20123;&#21160;&#24577;&#20063;&#32473;&#20154;&#31867;&#30340;&#36866;&#24212;&#24102;&#26469;&#20102;&#29420;&#29305;&#30340;&#25361;&#25112;&#12290;&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#23558;&#33021;&#22815;&#38378;&#28865;&#30340;&#29983;&#24577;&#27169;&#22411;&#19982;&#19968;&#20010;&#27169;&#25311;&#20154;&#31867;&#23545;&#21464;&#21270;&#29615;&#22659;&#36866;&#24212;&#30340;&#27169;&#22411;&#32852;&#31995;&#36215;&#26469;&#12290;&#36825;&#20351;&#24471;&#25105;&#20204;&#33021;&#22815;&#25506;&#32034;&#38378;&#28865;&#23545;&#32852;&#21512;&#31038;&#20250;&#29615;&#22659;&#31995;&#32479;&#20013;&#33258;&#36866;&#24212;&#20027;&#20307;&#30340;&#25928;&#29992;&#30340;&#24433;&#21709;&#12290;&#25105;&#20204;&#37325;&#28857;&#30740;&#31350;&#20102;&#38378;&#28865;&#23548;&#33268;&#31119;&#31049;&#19981;&#25104;&#27604;&#20363;&#19979;&#38477;&#30340;&#26465;&#20214;&#65292;&#24182;&#25506;&#35752;&#20102;&#36825;&#20123;&#21160;&#24577;&#23545;&#36716;&#22411;&#21464;&#21270;&#30340;&#26368;&#20339;&#26102;&#26426;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
Global environmental change is pushing many socio-environmental systems towards critical thresholds, where ecological systems' states are on the precipice of tipping points and interventions are needed to navigate or avert impending transitions. Flickering, where a system vacillates between alternative stable states, is touted as a useful early warning signal of irreversible transitions to undesirable ecological regimes. However, while flickering may presage an ecological tipping point, these dynamics also pose unique challenges for human adaptation. In this work, we link an ecological model that can exhibit flickering to a model of human adaptation to a changing environment. This allows us to explore the impact of flickering on the utility of adaptive agents in a coupled socio-environmental system. We highlight the conditions under which flickering causes wellbeing to decline disproportionately, and explore how these dynamics impact the optimal timing of a transformational change that
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25253;&#21578;&#24182;&#30740;&#31350;&#20102;&#32988;&#29575;&#21644;&#25509;&#25910;&#22120;&#25805;&#20316;&#29305;&#24615;&#26354;&#32447;&#19979;&#38754;&#31215;&#30340;&#38271;&#26399;&#19981;&#21487;&#36716;&#31227;&#34892;&#20026;&#65292;&#39564;&#35777;&#20102;&#20256;&#32479;&#32479;&#35745;&#37327;&#21644;&#32988;&#29575;&#30340;&#24046;&#24322;&#65292;&#24182;&#24378;&#35843;&#20102;&#30740;&#31350;&#38543;&#26426;&#27604;&#36739;&#30340;&#30456;&#20851;&#24615;&#30340;&#37325;&#35201;&#24615;&#12290;</title><link>http://arxiv.org/abs/2309.01791</link><description>&lt;p&gt;
&#19981;&#21487;&#36716;&#31227;&#30340;&#32988;&#29575;&#21644;&#25509;&#25910;&#22120;&#25805;&#20316;&#29305;&#24615;&#26354;&#32447;&#19979;&#38754;&#31215; (AUC) &#65306;&#35780;&#20272;&#38543;&#26426;&#27604;&#36739;&#30340;&#30456;&#20851;&#24615; (arXiv:2309.01791v1 [stat.ME])
&lt;/p&gt;
&lt;p&gt;
Non-transitivity of the Win Ratio and Area Under the Receiver Operating Characteristics Curve (AUC): a case for evaluating the strength of stochastic comparisons. (arXiv:2309.01791v1 [stat.ME])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.01791
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25253;&#21578;&#24182;&#30740;&#31350;&#20102;&#32988;&#29575;&#21644;&#25509;&#25910;&#22120;&#25805;&#20316;&#29305;&#24615;&#26354;&#32447;&#19979;&#38754;&#31215;&#30340;&#38271;&#26399;&#19981;&#21487;&#36716;&#31227;&#34892;&#20026;&#65292;&#39564;&#35777;&#20102;&#20256;&#32479;&#32479;&#35745;&#37327;&#21644;&#32988;&#29575;&#30340;&#24046;&#24322;&#65292;&#24182;&#24378;&#35843;&#20102;&#30740;&#31350;&#38543;&#26426;&#27604;&#36739;&#30340;&#30456;&#20851;&#24615;&#30340;&#37325;&#35201;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#32988;&#29575; (WR) &#26159;&#38543;&#26426;&#23545;&#29031;&#35797;&#39564;&#20013;&#20351;&#29992;&#30340;&#19968;&#31181;&#26032;&#39062;&#32479;&#35745;&#37327;&#65292;&#21487;&#20197;&#32771;&#34385;&#20107;&#20214;&#32467;&#26524;&#20869;&#30340;&#23618;&#27425;&#20851;&#31995;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25253;&#21578;&#24182;&#30740;&#31350;&#20102;&#32988;&#29575;&#21644;&#32039;&#23494;&#30456;&#20851;&#30340;&#25509;&#25910;&#22120;&#25805;&#20316;&#29305;&#24615;&#26354;&#32447;&#19979;&#38754;&#31215; (AUC) &#30340;&#38271;&#26399;&#19981;&#21487;&#36716;&#31227;&#34892;&#20026;&#65292;&#24182;&#35748;&#20026;&#23427;&#20204;&#30340;&#21487;&#36716;&#31227;&#24615;&#19981;&#33021;&#34987;&#35270;&#20026;&#29702;&#25152;&#24403;&#28982;&#12290;&#20851;&#38190;&#26159;&#65292;&#20256;&#32479;&#30340;&#32452;&#20869;&#32479;&#35745;&#37327;&#65288;&#21363;&#24179;&#22343;&#20540;&#27604;&#36739;&#65289;&#22987;&#32456;&#26159;&#21487;&#36716;&#31227;&#30340;&#65292;&#32780;&#32988;&#29575;&#21487;&#20197;&#26816;&#27979;&#21040;&#19981;&#21487;&#36716;&#31227;&#24615;&#12290;&#19981;&#21487;&#36716;&#31227;&#24615;&#25552;&#20379;&#20102;&#20851;&#20110;&#20004;&#20010;&#27835;&#30103;&#32452;&#20043;&#38388;&#38543;&#26426;&#20851;&#31995;&#30340;&#26377;&#20215;&#20540;&#30340;&#20449;&#24687;&#65292;&#24212;&#35813;&#36827;&#34892;&#27979;&#35797;&#21644;&#25253;&#21578;&#12290;&#25105;&#20204;&#30830;&#23450;&#20102;&#21487;&#36716;&#31227;&#24615;&#30340;&#24517;&#35201;&#26465;&#20214;&#12289;&#19981;&#21487;&#36716;&#31227;&#24615;&#30340;&#20805;&#20998;&#26465;&#20214;&#65292;&#24182;&#22312;&#30495;&#23454;&#30340;&#22823;&#35268;&#27169;&#38543;&#26426;&#23545;&#29031;&#35797;&#39564;&#20013;&#23637;&#31034;&#20102;&#32988;&#29575;&#23545;&#27515;&#20129;&#26102;&#38388;&#30340;&#19981;&#21487;&#36716;&#31227;&#24615;&#12290;&#25105;&#20204;&#30340;&#32467;&#26524;&#21487;&#29992;&#20110;&#25490;&#38500;&#25110;&#35780;&#20272;&#19981;&#21487;&#36716;&#31227;&#24615;&#30340;&#21487;&#33021;&#24615;&#65292;&#24182;&#23637;&#31034;&#30740;&#31350;&#38543;&#26426;&#27604;&#36739;&#30340;&#30456;&#20851;&#24615;&#30340;&#37325;&#35201;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
The win ratio (WR) is a novel statistic used in randomized controlled trials that can account for hierarchies within event outcomes. In this paper we report and study the long-run non-transitive behavior of the win ratio and the closely related Area Under the Receiver Operating Characteristics Curve (AUC) and argue that their transitivity cannot be taken for granted. Crucially, traditional within-group statistics (i.e., comparison of means) are always transitive, while the WR can detect non-transitivity. Non-transitivity provides valuable information on the stochastic relationship between two treatment groups, which should be tested and reported. We specify the necessary conditions for transitivity, the sufficient conditions for non-transitivity and demonstrate non-transitivity in a real-life large randomized controlled trial for the WR of time-to-death. Our results can be used to rule out or evaluate possibility of non-transitivity and show the importance of studying the strength of s
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#23454;&#35777;&#26694;&#26550;&#65292;&#29992;&#20110;&#20272;&#31639;&#35777;&#25454;&#20915;&#31574;&#30340;&#20215;&#20540;&#21644;&#32479;&#35745;&#31934;&#24230;&#25237;&#36164;&#22238;&#25253;&#12290;</title><link>http://arxiv.org/abs/2306.13681</link><description>&lt;p&gt;
&#20272;&#31639;&#22522;&#20110;&#35777;&#25454;&#20915;&#31574;&#30340;&#20215;&#20540;
&lt;/p&gt;
&lt;p&gt;
Estimating the Value of Evidence-Based Decision Making. (arXiv:2306.13681v1 [stat.ME])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.13681
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#23454;&#35777;&#26694;&#26550;&#65292;&#29992;&#20110;&#20272;&#31639;&#35777;&#25454;&#20915;&#31574;&#30340;&#20215;&#20540;&#21644;&#32479;&#35745;&#31934;&#24230;&#25237;&#36164;&#22238;&#25253;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21830;&#19994;/&#25919;&#31574;&#20915;&#31574;&#36890;&#24120;&#22522;&#20110;&#38543;&#26426;&#23454;&#39564;&#21644;&#35266;&#23519;&#24615;&#30740;&#31350;&#30340;&#35777;&#25454;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#23454;&#35777;&#26694;&#26550;&#26469;&#20272;&#31639;&#22522;&#20110;&#35777;&#25454;&#30340;&#20915;&#31574;&#65288;EBDM&#65289;&#30340;&#20215;&#20540;&#21644;&#32479;&#35745;&#31934;&#24230;&#25237;&#36164;&#22238;&#25253;&#12290;
&lt;/p&gt;
&lt;p&gt;
Business/policy decisions are often based on evidence from randomized experiments and observational studies. In this article we propose an empirical framework to estimate the value of evidence-based decision making (EBDM) and the return on the investment in statistical precision.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20379;&#20102;&#19968;&#20010;&#22522;&#26412;&#29702;&#35770;&#65292;&#30740;&#31350;&#20102;&#24102;&#26377;&#39640;&#38454;&#20449;&#24687;&#30340;&#26399;&#26435;&#24066;&#22330;&#20013;&#20215;&#26684;&#30340;&#21457;&#29616;&#26426;&#21046;&#12290;&#19982;&#27492;&#21516;&#26102;&#65292;&#35813;&#30740;&#31350;&#36824;&#20197;&#20869;&#24149;&#20132;&#26131;&#30340;&#24418;&#24335;&#21576;&#29616;&#20102;&#20854;&#20013;&#30340;&#29305;&#20363;&#65292;&#32473;&#20986;&#20102;&#36890;&#36135;&#33192;&#32960;&#38656;&#27714;&#12289;&#20215;&#26684;&#20914;&#20987;&#21644;&#20449;&#24687;&#25928;&#29575;&#30340;&#38381;&#24335;&#35299;&#12290;</title><link>http://arxiv.org/abs/2302.13426</link><description>&lt;p&gt;
&#26399;&#26435;&#30340;&#20215;&#26684;&#21457;&#29616;
&lt;/p&gt;
&lt;p&gt;
Price Discovery for Derivatives. (arXiv:2302.13426v5 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2302.13426
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20379;&#20102;&#19968;&#20010;&#22522;&#26412;&#29702;&#35770;&#65292;&#30740;&#31350;&#20102;&#24102;&#26377;&#39640;&#38454;&#20449;&#24687;&#30340;&#26399;&#26435;&#24066;&#22330;&#20013;&#20215;&#26684;&#30340;&#21457;&#29616;&#26426;&#21046;&#12290;&#19982;&#27492;&#21516;&#26102;&#65292;&#35813;&#30740;&#31350;&#36824;&#20197;&#20869;&#24149;&#20132;&#26131;&#30340;&#24418;&#24335;&#21576;&#29616;&#20102;&#20854;&#20013;&#30340;&#29305;&#20363;&#65292;&#32473;&#20986;&#20102;&#36890;&#36135;&#33192;&#32960;&#38656;&#27714;&#12289;&#20215;&#26684;&#20914;&#20987;&#21644;&#20449;&#24687;&#25928;&#29575;&#30340;&#38381;&#24335;&#35299;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36890;&#36807;&#19968;&#20010;&#27169;&#22411;&#65292;&#32771;&#34385;&#20102;&#31169;&#26377;&#20449;&#24687;&#21644;&#39640;&#38454;&#20449;&#24687;&#23545;&#26399;&#26435;&#24066;&#22330;&#20215;&#26684;&#30340;&#24433;&#21709;&#12290;&#27169;&#22411;&#20801;&#35768;&#26377;&#31169;&#26377;&#20449;&#24687;&#30340;&#20132;&#26131;&#32773;&#22312;&#29366;&#24577;-&#32034;&#36180;&#38598;&#24066;&#22330;&#19978;&#20132;&#26131;&#12290;&#31561;&#20215;&#30340;&#26399;&#26435;&#24418;&#24335;&#19979;&#65292;&#25105;&#20204;&#32771;&#34385;&#20102;&#25317;&#26377;&#20851;&#20110;&#22522;&#30784;&#36164;&#20135;&#25910;&#30410;&#30340;&#20998;&#24067;&#30340;&#31169;&#26377;&#20449;&#24687;&#65292;&#24182;&#20801;&#35768;&#20132;&#26131;&#20219;&#24847;&#26399;&#26435;&#32452;&#21512;&#30340;&#25805;&#32437;&#32773;&#12290;&#25105;&#20204;&#24471;&#20986;&#20102;&#36890;&#36135;&#33192;&#32960;&#38656;&#27714;&#12289;&#20215;&#26684;&#20914;&#20987;&#21644;&#20449;&#24687;&#25928;&#29575;&#30340;&#38381;&#24335;&#35299;&#65292;&#36825;&#20123;&#35299;&#25552;&#20379;&#20102;&#20851;&#20110;&#20869;&#24149;&#20132;&#26131;&#30340;&#39640;&#38454;&#20449;&#24687;&#65292;&#22914;&#20219;&#20309;&#32473;&#23450;&#30340;&#26102;&#21051;&#20132;&#26131;&#26399;&#26435;&#31574;&#30053;&#65292;&#24182;&#23558;&#36825;&#20123;&#31574;&#30053;&#27867;&#21270;&#21040;&#20102;&#27874;&#21160;&#29575;&#20132;&#26131;&#31561;&#23454;&#36341;&#39046;&#22495;&#12290;
&lt;/p&gt;
&lt;p&gt;
We obtain a basic theory of price discovery across derivative markets with respect to higher-order information, using a model where an agent with general private information regarding state probabilities is allowed to trade arbitrary portfolios of state-contingent claims. In an equivalent options formulation, the informed agent has private information regarding arbitrary aspects of the payoff distribution of an underlying asset and is allowed to trade arbitrary option portfolios. We characterize, in closed form, the informed demand, price impact, and information efficiency of prices. Our results offer a theory of insider trading on higher moments of the underlying payoff as a special case. The informed demand formula prescribes option strategies for trading on any given moment and extends those used in practice for, e.g. volatility trading.
&lt;/p&gt;</description></item><item><title>&#36825;&#31687;&#35770;&#25991;&#30740;&#31350;&#20102;&#24403;&#19968;&#20010;&#25919;&#24220;&#20570;&#20986;&#22810;&#20010;&#25919;&#31574;&#20915;&#31574;&#26102;&#65292;&#28216;&#35828;&#21487;&#20197;&#34987;&#30475;&#20316;&#26159;&#25919;&#24220;&#21644;&#29305;&#27530;&#21033;&#30410;&#38598;&#22242;&#20043;&#38388;&#30340;&#31454;&#20105;&#65292;&#24182;&#21457;&#29616;&#25919;&#24220;&#20250;&#36890;&#36807;&#32473;&#20104;&#29305;&#23450;&#21033;&#30410;&#38598;&#22242;&#29305;&#27530;&#24453;&#36935;&#26469;&#24314;&#31435;&#33258;&#24049;&#30340;&#25919;&#27835;&#36164;&#26412;&#65292;&#20197;&#22312;&#19982;&#20854;&#20182;&#21033;&#30410;&#38598;&#22242;&#30340;&#26007;&#20105;&#20013;&#21462;&#24471;&#20248;&#21183;&#12290;</title><link>http://arxiv.org/abs/2207.00800</link><description>&lt;p&gt;
&#35199;&#32764;&#20869;&#24149;&#65306;&#28216;&#35828;&#20316;&#20026;&#19968;&#22330;&#31454;&#36187;
&lt;/p&gt;
&lt;p&gt;
Inside the West Wing: Lobbying as a contest. (arXiv:2207.00800v2 [econ.TH] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2207.00800
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#30740;&#31350;&#20102;&#24403;&#19968;&#20010;&#25919;&#24220;&#20570;&#20986;&#22810;&#20010;&#25919;&#31574;&#20915;&#31574;&#26102;&#65292;&#28216;&#35828;&#21487;&#20197;&#34987;&#30475;&#20316;&#26159;&#25919;&#24220;&#21644;&#29305;&#27530;&#21033;&#30410;&#38598;&#22242;&#20043;&#38388;&#30340;&#31454;&#20105;&#65292;&#24182;&#21457;&#29616;&#25919;&#24220;&#20250;&#36890;&#36807;&#32473;&#20104;&#29305;&#23450;&#21033;&#30410;&#38598;&#22242;&#29305;&#27530;&#24453;&#36935;&#26469;&#24314;&#31435;&#33258;&#24049;&#30340;&#25919;&#27835;&#36164;&#26412;&#65292;&#20197;&#22312;&#19982;&#20854;&#20182;&#21033;&#30410;&#38598;&#22242;&#30340;&#26007;&#20105;&#20013;&#21462;&#24471;&#20248;&#21183;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24403;&#25919;&#24220;&#20570;&#20986;&#35768;&#22810;&#19981;&#21516;&#30340;&#25919;&#31574;&#20915;&#31574;&#26102;&#65292;&#28216;&#35828;&#21487;&#20197;&#34987;&#35270;&#20026;&#25919;&#24220;&#21644;&#35768;&#22810;&#29305;&#27530;&#21033;&#30410;&#38598;&#22242;&#20043;&#38388;&#30340;&#31454;&#36187;&#12290;&#25919;&#24220;&#36890;&#36807;&#20854;&#33258;&#36523;&#30340;&#25919;&#27835;&#36164;&#26412;&#19982;&#21033;&#30410;&#38598;&#22242;&#36827;&#34892;&#26007;&#20105;&#12290;&#22312;&#36825;&#20010;&#19990;&#30028;&#20013;&#65292;&#25105;&#20204;&#21457;&#29616;&#25919;&#24220;&#24819;&#35201;&#8220;&#20986;&#21806;&#20445;&#25252;&#8221;&#65292;&#21363;&#22312;&#20132;&#25442;&#25424;&#27454;&#30340;&#21516;&#26102;&#32473;&#20104;&#29305;&#23450;&#21033;&#30410;&#38598;&#22242;&#26377;&#21033;&#24453;&#36935;&#12290;&#23427;&#36825;&#26679;&#20570;&#26159;&#20026;&#20102;&#24314;&#31435;&#33258;&#24049;&#30340;&#8220;&#25112;&#20105;&#22522;&#37329;&#8221;&#65292;&#25552;&#39640;&#22312;&#19982;&#20854;&#20182;&#21033;&#30410;&#38598;&#22242;&#20105;&#26007;&#20013;&#30340;&#22320;&#20301;&#12290;&#30452;&#21040;&#23427;&#33021;&#22815;&#30830;&#23450;&#22320;&#36194;&#24471;&#25152;&#26377;&#21097;&#20313;&#30340;&#31454;&#20105;&#12290;&#36825;&#19982;&#29616;&#26377;&#27169;&#22411;&#30340;&#35266;&#28857;&#24418;&#25104;&#40092;&#26126;&#23545;&#27604;&#65292;&#21518;&#32773;&#36890;&#24120;&#23558;&#28216;&#35828;&#35270;&#20026;&#20449;&#24687;&#25110;&#20195;&#29702;&#38382;&#39064;&#39537;&#21160;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
When a government makes many different policy decisions, lobbying can be viewed as a contest between the government and many different special interest groups. The government fights lobbying by interest groups with its own political capital. In this world, we find that a government wants to `sell protection' -- give favourable treatment in exchange for contributions -- to certain interest groups. It does this in order to build its own `war chest' of political capital, which improves its position in fights with other interest groups. And it does so until it wins all remaining contests with certainty. This stands in contrast to existing models that often view lobbying as driven by information or agency problems.
&lt;/p&gt;</description></item><item><title>&#25991;&#31456;&#20351;&#29992;&#32929;&#19996;&#22823;&#20250;&#26102;&#38388;&#24046;&#24322;&#30340;&#26041;&#27861;&#30740;&#31350;&#20102;&#32929;&#19996;&#20559;&#22909;&#21644;&#23545;&#20844;&#21496;&#21033;&#20182;&#20915;&#31574;&#30340;&#24433;&#21709;&#65292;&#21457;&#29616;&#36861;&#27714;&#65288;&#26576;&#20123;&#65289;&#32929;&#19996;&#30340;&#20215;&#20540;&#20855;&#26377;&#20998;&#37197;&#25104;&#26412;&#65292;&#20294;&#22823;&#32929;&#19996;&#30340;&#30417;&#25511;&#21487;&#20197;&#36991;&#20813;&#36825;&#31181;&#30001;&#20559;&#22909;&#24322;&#36136;&#24615;&#39537;&#21160;&#30340;&#25104;&#26412;&#12290;</title><link>http://arxiv.org/abs/2103.12138</link><description>&lt;p&gt;
&#36861;&#27714;&#32929;&#19996;&#20215;&#20540;&#30340;&#20849;&#21516;&#25104;&#26412;
&lt;/p&gt;
&lt;p&gt;
The Shared Cost of Pursuing Shareholder Value. (arXiv:2103.12138v9 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2103.12138
&lt;/p&gt;
&lt;p&gt;
&#25991;&#31456;&#20351;&#29992;&#32929;&#19996;&#22823;&#20250;&#26102;&#38388;&#24046;&#24322;&#30340;&#26041;&#27861;&#30740;&#31350;&#20102;&#32929;&#19996;&#20559;&#22909;&#21644;&#23545;&#20844;&#21496;&#21033;&#20182;&#20915;&#31574;&#30340;&#24433;&#21709;&#65292;&#21457;&#29616;&#36861;&#27714;&#65288;&#26576;&#20123;&#65289;&#32929;&#19996;&#30340;&#20215;&#20540;&#20855;&#26377;&#20998;&#37197;&#25104;&#26412;&#65292;&#20294;&#22823;&#32929;&#19996;&#30340;&#30417;&#25511;&#21487;&#20197;&#36991;&#20813;&#36825;&#31181;&#30001;&#20559;&#22909;&#24322;&#36136;&#24615;&#39537;&#21160;&#30340;&#25104;&#26412;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#37319;&#29992;&#20934;&#23454;&#39564;&#24615;&#30340;&#26041;&#27861;&#65292;&#26681;&#25454;&#20844;&#21496;&#32929;&#19996;&#22823;&#20250;&#65288;AGMs&#65289;&#30340;&#26102;&#38388;&#24046;&#24322;&#65292;&#25552;&#20986;&#20102;&#19968;&#20010;&#21487;&#31227;&#26893;&#30340;&#26694;&#26550;&#65292;&#25512;&#26029;&#32929;&#19996;&#30340;&#20559;&#22909;&#21644;&#23545;&#20844;&#21496;&#21033;&#20182;&#20915;&#31574;&#30340;&#24433;&#21709;&#65292;&#24182;&#23558;&#20854;&#24212;&#29992;&#20110;covid&#30456;&#20851;&#25424;&#36192;&#12289;&#26368;&#36817;&#38024;&#23545;&#20420;&#32599;&#26031;&#30340;&#31169;&#20154;&#21046;&#35009;&#20197;&#21450;&#20844;&#21496;2012-19&#24180;&#30340;&#21033;&#20182;&#31435;&#22330;&#12290;AGMs&#30340;&#23186;&#20307;&#26333;&#20809;&#24102;&#26469;&#30340;&#24418;&#35937;&#25910;&#30410;&#65292;&#20351;&#24471;&#19982;&#20844;&#21496;&#21516;&#20041;&#30340;&#32929;&#19996;&#65288;&#22914;&#23494;&#20999;&#30456;&#20851;&#30340;&#20010;&#20154;&#65289;&#25903;&#25345;&#26114;&#36149;&#30340;&#21033;&#20182;&#21464;&#38761;&#65292;&#32780;&#20854;&#20182;&#32929;&#19996;&#65288;&#22914;&#37329;&#34701;&#20844;&#21496;&#65289;&#21453;&#23545;&#36825;&#20123;&#21464;&#38761;&#12290;&#25903;&#25345;&#36825;&#20123;&#21464;&#38761;&#30340;&#24433;&#21709;&#20351;&#25910;&#30410;&#19979;&#38477;&#20102;30&#65285;&#65306;&#36861;&#27714;&#65288;&#26576;&#20123;&#65289;&#32929;&#19996;&#30340;&#20215;&#20540;&#20855;&#26377;&#20998;&#37197;&#25104;&#26412;&#65292;&#22823;&#32929;&#19996;&#30340;&#30417;&#25511;&#21487;&#20197;&#36991;&#20813;&#30001;&#20559;&#22909;&#24322;&#36136;&#24615;&#39537;&#21160;&#30340;&#25104;&#26412;&#12290;
&lt;/p&gt;
&lt;p&gt;
Using quasi-experimental variations from the timing of firms' Annual General Meetings (AGMs), we propose a portable framework to infer shareholders' preferences and influences on firms' prosocial decisions and apply it to covid-related donations, recent private sanctions on Russia, and firms' prosocial stances over 2012-19. Image gains from AGMs' media exposure drive shareholders synonymous with a firm, like closely-connected individuals, to support costly prosocial changes, while others, like financial corporations, oppose them. Influence supporting these changes lowers earnings by 30\%: pursuing the values of (some) shareholders has distributional costs, which the monitoring of large shareholders motivated by heterogeneous preferences could prevent.
&lt;/p&gt;</description></item></channel></rss>