<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#30740;&#31350;&#20102;&#22312;&#20004;&#31181;&#31867;&#21035;&#30340;&#20154;&#24037;&#36135;&#24065;&#25293;&#21334;&#20013;&#23398;&#20064;&#20986;&#20215;&#30340;&#38382;&#39064;&#65292;&#25506;&#35752;&#20102;&#29992;&#25143;&#22914;&#20309;&#23398;&#20064;&#23545;&#22312;&#25293;&#21334;&#20043;&#22806;&#27809;&#26377;&#20215;&#20540;&#30340;&#36135;&#24065;&#36827;&#34892;&#26368;&#20248;&#22320;&#33457;&#36153;&#12290;</title><link>https://arxiv.org/abs/2403.04057</link><description>&lt;p&gt;
&#22312;&#37325;&#22797;&#30340;Karma&#25293;&#21334;&#20013;&#33457;&#36153;&#36824;&#26159;&#33719;&#24471;&#65306;&#22312;&#32447;&#23398;&#20064;
&lt;/p&gt;
&lt;p&gt;
To Spend or to Gain: Online Learning in Repeated Karma Auctions
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.04057
&lt;/p&gt;
&lt;p&gt;
&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#30740;&#31350;&#20102;&#22312;&#20004;&#31181;&#31867;&#21035;&#30340;&#20154;&#24037;&#36135;&#24065;&#25293;&#21334;&#20013;&#23398;&#20064;&#20986;&#20215;&#30340;&#38382;&#39064;&#65292;&#25506;&#35752;&#20102;&#29992;&#25143;&#22914;&#20309;&#23398;&#20064;&#23545;&#22312;&#25293;&#21334;&#20043;&#22806;&#27809;&#26377;&#20215;&#20540;&#30340;&#36135;&#24065;&#36827;&#34892;&#26368;&#20248;&#22320;&#33457;&#36153;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36817;&#24180;&#26469;&#65292;&#22312;&#37027;&#20123;&#35748;&#20026;&#36135;&#24065;&#24037;&#20855;&#19981;&#20844;&#24179;&#25110;&#19981;&#24688;&#24403;&#30340;&#24773;&#22659;&#20013;&#20986;&#29616;&#20102;&#19968;&#22823;&#25209;&#22522;&#20110;&#20154;&#24037;&#36135;&#24065;&#30340;&#26426;&#21046;&#65292;&#20363;&#22914;&#65292;&#22312;&#23558;&#39135;&#29289;&#25424;&#36192;&#20998;&#37197;&#32473;&#39135;&#29289;&#38134;&#34892;&#12289;&#23558;&#35838;&#31243;&#24109;&#20301;&#20998;&#37197;&#32473;&#23398;&#29983;&#65292;&#29978;&#33267;&#26368;&#36817;&#29978;&#33267;&#29992;&#20110;&#20132;&#36890;&#25317;&#22581;&#31649;&#29702;&#12290;&#28982;&#32780;&#65292;&#36825;&#20123;&#26426;&#21046;&#22312;&#37325;&#22797;&#25293;&#21334;&#35774;&#32622;&#20013;&#30340;&#36866;&#29992;&#24615;&#20173;&#28982;&#26377;&#38480;&#65292;&#22240;&#20026;&#29992;&#25143;&#24456;&#38590;&#23398;&#20250;&#22914;&#20309;&#20986;&#20215;&#19968;&#31181;&#22312;&#25293;&#21334;&#20043;&#22806;&#27809;&#26377;&#20215;&#20540;&#30340;&#20154;&#24037;&#36135;&#24065;&#12290;&#20107;&#23454;&#19978;&#65292;&#29992;&#25143;&#24517;&#39035;&#20849;&#21516;&#23398;&#20064;&#36135;&#24065;&#30340;&#20215;&#20540;&#65292;&#20197;&#21450;&#22914;&#20309;&#26368;&#20248;&#21270;&#22320;&#33457;&#36153;&#23427;&#12290;&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#22312;&#20004;&#20010;&#33879;&#21517;&#31867;&#21035;&#30340;&#20154;&#24037;&#36135;&#24065;&#25293;&#21334;&#20013;&#23398;&#20064;&#20986;&#20215;&#30340;&#38382;&#39064;&#65306;&#19968;&#31181;&#26159;&#22312;&#26377;&#38480;&#26102;&#38388;&#27573;&#24320;&#22987;&#26102;&#20165;&#39041;&#21457;&#36135;&#24065;&#30340;&#25293;&#21334;&#65292;&#29992;&#25143;&#36890;&#36807;&#33457;&#36153;&#36135;&#24065;&#33719;&#24471;&#20844;&#20849;&#36164;&#28304;&#65307;&#21478;&#19968;&#31181;&#26159;&#38500;&#20102;&#21021;&#22987;&#36135;&#24065;&#36164;&#20135;&#22806;&#65292;&#22312;&#27599;&#20010;&#26102;&#38388;&#27493;&#23558;&#36135;&#24065;&#25903;&#20184;&#37325;&#26032;&#20998;&#37197;&#32473;&#29992;&#25143;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.04057v1 Announce Type: cross  Abstract: Recent years have seen a surge of artificial currency-based mechanisms in contexts where monetary instruments are deemed unfair or inappropriate, e.g., in allocating food donations to food banks, course seats to students, and, more recently, even for traffic congestion management. Yet the applicability of these mechanisms remains limited in repeated auction settings, as it is challenging for users to learn how to bid an artificial currency that has no value outside the auctions. Indeed, users must jointly learn the value of the currency in addition to how to spend it optimally. In this work, we study the problem of learning to bid in two prominent classes of artificial currency auctions: those in which currency, which users spend to obtain public resources, is only issued at the beginning of a finite period; and those where, in addition to the initial currency endowment, currency payments are redistributed to users at each time step. I
&lt;/p&gt;</description></item></channel></rss>