<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#22312;&#32447;&#24191;&#21578;&#24179;&#21488;&#19978;&#30340;&#24191;&#21578;&#21830;&#20043;&#38388;&#30340;&#25112;&#30053;&#39044;&#31639;&#36873;&#25321;&#38382;&#39064;&#12290;&#36890;&#36807;&#33258;&#21160;&#31454;&#20215;&#31639;&#27861;&#65292;&#24191;&#21578;&#21830;&#26681;&#25454;&#39044;&#31639;&#21644;&#32447;&#24615;&#20215;&#20540;&#26368;&#22823;&#21270;&#20854;&#24635;&#20215;&#20540;&#12290;&#23613;&#31649;&#24191;&#21578;&#21830;&#30340;&#30495;&#23454;&#20559;&#22909;&#19982;&#33258;&#21160;&#31454;&#20215;&#22120;&#30340;&#32422;&#26463;&#23384;&#22312;&#24046;&#36317;&#65292;&#20294;&#22312;&#22343;&#34913;&#29366;&#24577;&#19979;&#30340;&#20998;&#37197;&#26159;&#36817;&#20284;&#30340;&#12290;</title><link>http://arxiv.org/abs/2307.07374</link><description>&lt;p&gt;
&#31454;&#20105;&#24615;&#33258;&#21160;&#31454;&#20215;&#19990;&#30028;&#20013;&#30340;&#25112;&#30053;&#39044;&#31639;&#36873;&#25321;
&lt;/p&gt;
&lt;p&gt;
Strategic Budget Selection in a Competitive Autobidding World. (arXiv:2307.07374v1 [cs.GT])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.07374
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#22312;&#32447;&#24191;&#21578;&#24179;&#21488;&#19978;&#30340;&#24191;&#21578;&#21830;&#20043;&#38388;&#30340;&#25112;&#30053;&#39044;&#31639;&#36873;&#25321;&#38382;&#39064;&#12290;&#36890;&#36807;&#33258;&#21160;&#31454;&#20215;&#31639;&#27861;&#65292;&#24191;&#21578;&#21830;&#26681;&#25454;&#39044;&#31639;&#21644;&#32447;&#24615;&#20215;&#20540;&#26368;&#22823;&#21270;&#20854;&#24635;&#20215;&#20540;&#12290;&#23613;&#31649;&#24191;&#21578;&#21830;&#30340;&#30495;&#23454;&#20559;&#22909;&#19982;&#33258;&#21160;&#31454;&#20215;&#22120;&#30340;&#32422;&#26463;&#23384;&#22312;&#24046;&#36317;&#65292;&#20294;&#22312;&#22343;&#34913;&#29366;&#24577;&#19979;&#30340;&#20998;&#37197;&#26159;&#36817;&#20284;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#22312;&#32447;&#24191;&#21578;&#24179;&#21488;&#19978;&#24191;&#21578;&#21830;&#20043;&#38388;&#30340;&#19968;&#31181;&#28216;&#25103;&#12290;&#35813;&#24179;&#21488;&#36890;&#36807;&#19968;&#27425;&#20215;&#26684;&#25293;&#21334;&#38144;&#21806;&#24191;&#21578;&#23637;&#31034;&#65292;&#24182;&#25552;&#20379;&#20248;&#21270;&#24191;&#21578;&#21830;&#25237;&#26631;&#30340;&#33258;&#21160;&#31454;&#20215;&#31639;&#27861;&#12290;&#27599;&#20010;&#24191;&#21578;&#21830;&#37117;&#23545;&#20854;&#33258;&#21160;&#31454;&#20215;&#22120;&#22768;&#26126;&#39044;&#31639;&#32422;&#26463;&#65288;&#21487;&#33021;&#36824;&#26377;&#26368;&#22823;&#31454;&#20215;&#65289;&#12290;&#25152;&#36873;&#25321;&#30340;&#32422;&#26463;&#20026;&#33258;&#21160;&#31454;&#20215;&#22120;&#23450;&#20041;&#20102;&#19968;&#20010;&#8220;&#20869;&#37096;&#8221;&#39044;&#31639;&#25511;&#21046;&#28216;&#25103;&#65292;&#31454;&#20105;&#32773;&#22312;&#31454;&#20105;&#26465;&#20214;&#19979;&#26368;&#22823;&#21270;&#24635;&#20215;&#20540;&#12290;&#24191;&#21578;&#21830;&#22312;&#32422;&#26463;&#36873;&#25321;&#30340;&#8220;&#20803;&#28216;&#25103;&#8221;&#20013;&#30340;&#33719;&#21033;&#21462;&#20915;&#20110;&#33258;&#21160;&#31454;&#20215;&#22120;&#36798;&#21040;&#30340;&#22343;&#34913;&#29366;&#24577;&#12290;&#24191;&#21578;&#21830;&#21482;&#21521;&#20854;&#33258;&#21160;&#31454;&#20215;&#22120;&#25351;&#23450;&#39044;&#31639;&#21644;&#32447;&#24615;&#20215;&#20540;&#65292;&#20294;&#20854;&#30495;&#23454;&#20559;&#22909;&#21487;&#20197;&#26356;&#21152;&#19968;&#33324;&#21270;&#65306;&#25105;&#20204;&#20165;&#20551;&#35774;&#20182;&#20204;&#23545;&#28857;&#20987;&#20855;&#26377;&#36882;&#20943;&#36793;&#38469;&#20215;&#20540;&#24182;&#19988;&#23545;&#33457;&#36153;&#36164;&#37329;&#20855;&#26377;&#36882;&#22686;&#36793;&#38469;&#19981;&#20415;&#12290;&#25105;&#20204;&#30340;&#20027;&#35201;&#32467;&#26524;&#26159;&#65292;&#23613;&#31649;&#23384;&#22312;&#24191;&#21578;&#21830;&#19968;&#33324;&#20559;&#22909;&#21644;&#31616;&#21333;&#33258;&#21160;&#31454;&#20215;&#22120;&#32422;&#26463;&#20043;&#38388;&#30340;&#24046;&#36317;&#65292;&#20294;&#22312;&#22343;&#34913;&#29366;&#24577;&#19979;&#30340;&#20998;&#37197;&#26159;&#36817;&#20284;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study a game played between advertisers in an online ad platform. The platform sells ad impressions by first-price auction and provides autobidding algorithms that optimize bids on each advertiser's behalf. Each advertiser strategically declares a budget constraint (and possibly a maximum bid) to their autobidder. The chosen constraints define an "inner" budget-pacing game for the autobidders, who compete to maximize the total value received subject to the constraints. Advertiser payoffs in the constraint-choosing "metagame" are determined by the equilibrium reached by the autobidders.  Advertisers only specify budgets and linear values to their autobidders, but their true preferences can be more general: we assume only that they have weakly decreasing marginal value for clicks and weakly increasing marginal disutility for spending money. Our main result is that despite this gap between general preferences and simple autobidder constraints, the allocations at equilibrium are approxi
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#36873;&#25321;&#27169;&#22411;&#21644;&#32622;&#25442;&#19981;&#21464;&#24615;&#30340;&#22522;&#26412;&#29305;&#24449;&#21270;&#26041;&#27861;&#65292;&#24182;&#23637;&#31034;&#20102;&#22914;&#20309;&#36890;&#36807;&#38750;&#21442;&#25968;&#20272;&#35745;&#22120;&#36924;&#36817;&#36873;&#25321;&#20989;&#25968;&#65292;&#20197;&#21450;&#22312;&#23454;&#38469;&#24212;&#29992;&#20013;&#30340;&#28789;&#27963;&#24615;&#21644;&#20248;&#36234;&#24615;&#12290;</title><link>http://arxiv.org/abs/2307.07090</link><description>&lt;p&gt;
&#36873;&#25321;&#27169;&#22411;&#21644;&#32622;&#25442;&#19981;&#21464;&#24615;
&lt;/p&gt;
&lt;p&gt;
Choice Models and Permutation Invariance. (arXiv:2307.07090v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.07090
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#36873;&#25321;&#27169;&#22411;&#21644;&#32622;&#25442;&#19981;&#21464;&#24615;&#30340;&#22522;&#26412;&#29305;&#24449;&#21270;&#26041;&#27861;&#65292;&#24182;&#23637;&#31034;&#20102;&#22914;&#20309;&#36890;&#36807;&#38750;&#21442;&#25968;&#20272;&#35745;&#22120;&#36924;&#36817;&#36873;&#25321;&#20989;&#25968;&#65292;&#20197;&#21450;&#22312;&#23454;&#38469;&#24212;&#29992;&#20013;&#30340;&#28789;&#27963;&#24615;&#21644;&#20248;&#36234;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36873;&#25321;&#24314;&#27169;&#26159;&#35768;&#22810;&#32463;&#27982;&#23398;&#12289;&#36816;&#33829;&#21644;&#33829;&#38144;&#38382;&#39064;&#30340;&#26680;&#24515;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#23545;&#36873;&#25321;&#20989;&#25968;&#36827;&#34892;&#22522;&#26412;&#29305;&#24449;&#21270;&#30340;&#26041;&#27861;&#65292;&#28085;&#30422;&#20102;&#21508;&#31181;&#29616;&#26377;&#30340;&#36873;&#25321;&#27169;&#22411;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#38750;&#21442;&#25968;&#20272;&#35745;&#22120;&#22914;&#31070;&#32463;&#32593;&#32476;&#22914;&#20309;&#33021;&#22815;&#36731;&#26494;&#36924;&#36817;&#27492;&#31867;&#20989;&#25968;&#65292;&#24182;&#20811;&#26381;&#22312;&#38750;&#21442;&#25968;&#20272;&#35745;&#36873;&#25321;&#20989;&#25968;&#20013;&#22266;&#26377;&#30340;&#32500;&#25968;&#28798;&#38590;&#12290;&#36890;&#36807;&#22823;&#37327;&#27169;&#25311;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#25105;&#20204;&#25552;&#20986;&#30340;&#20989;&#25968;&#21487;&#20197;&#20197;&#23436;&#20840;&#25968;&#25454;&#39537;&#21160;&#30340;&#26041;&#24335;&#28789;&#27963;&#25429;&#25417;&#28508;&#22312;&#30340;&#28040;&#36153;&#32773;&#34892;&#20026;&#65292;&#24182;&#32988;&#36807;&#20256;&#32479;&#30340;&#21442;&#25968;&#27169;&#22411;&#12290;&#22240;&#20026;&#38656;&#27714;&#35774;&#32622;&#24120;&#24120;&#20855;&#26377;&#20869;&#29983;&#29305;&#24449;&#65292;&#25105;&#20204;&#23558;&#25105;&#20204;&#30340;&#26694;&#26550;&#25193;&#23637;&#21040;&#21253;&#25324;&#22312;&#20869;&#29983;&#29305;&#24449;&#19979;&#30340;&#20272;&#35745;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36824;&#25551;&#36848;&#20102;&#19968;&#20010;&#24418;&#24335;&#25512;&#29702;&#31243;&#24207;&#65292;&#20197;&#26500;&#24314;&#20851;&#20110;&#20215;&#26684;&#24377;&#24615;&#31561;&#24863;&#20852;&#36259;&#23545;&#35937;&#30340;&#26377;&#25928;&#32622;&#20449;&#21306;&#38388;&#12290;&#26368;&#21518;&#65292;&#20026;&#20102;&#35780;&#20272;&#25105;&#20204;&#20272;&#35745;&#22120;&#30340;&#23454;&#38469;&#36866;&#29992;&#24615;&#65292;&#25105;&#20204;&#21033;&#29992;&#20102;&#19968;&#20010;&#30495;&#23454;&#19990;&#30028;&#30340;&#23454;&#35777;&#25968;&#25454;&#38598;&#12290;
&lt;/p&gt;
&lt;p&gt;
Choice Modeling is at the core of many economics, operations, and marketing problems. In this paper, we propose a fundamental characterization of choice functions that encompasses a wide variety of extant choice models. We demonstrate how nonparametric estimators like neural nets can easily approximate such functionals and overcome the curse of dimensionality that is inherent in the non-parametric estimation of choice functions. We demonstrate through extensive simulations that our proposed functionals can flexibly capture underlying consumer behavior in a completely data-driven fashion and outperform traditional parametric models. As demand settings often exhibit endogenous features, we extend our framework to incorporate estimation under endogenous features. Further, we also describe a formal inference procedure to construct valid confidence intervals on objects of interest like price elasticity. Finally, to assess the practical applicability of our estimator, we utilize a real-world
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#36890;&#36807;&#38754;&#26495;&#25968;&#25454;&#20998;&#26512;&#20102;&#21560;&#24341;&#22806;&#22269;&#30452;&#25509;&#25237;&#36164;&#65288;FDI&#65289;&#27969;&#20837;&#30340;&#32463;&#27982;&#12289;&#21046;&#24230;&#21644;&#25919;&#27835;/&#25919;&#24220;&#22240;&#32032;&#23545;&#26032;&#20852;&#20122;&#27954;&#32463;&#27982;&#20307;&#30340;&#24433;&#21709;&#12290;&#32463;&#27982;&#22240;&#32032;&#23545;FDI&#27969;&#20837;&#26377;&#26174;&#33879;&#24433;&#21709;&#65292;&#32780;&#21046;&#24230;&#22240;&#32032;&#21644;&#25919;&#27835;&#22240;&#32032;&#30340;&#24433;&#21709;&#30456;&#23545;&#36739;&#23567;&#12290;</title><link>http://arxiv.org/abs/2307.07037</link><description>&lt;p&gt;
&#22806;&#22269;&#30452;&#25509;&#25237;&#36164;&#65288;FDI&#65289;&#23545;&#26032;&#20852;&#20122;&#27954;&#32463;&#27982;&#20307;&#30340;&#24433;&#21709;&#22240;&#32032;&#65306;&#38754;&#26495;&#25968;&#25454;&#20998;&#26512;
&lt;/p&gt;
&lt;p&gt;
The Determinants of Foreign Direct Investment (FDI) A Panel Data Analysis for the Emerging Asian Economies. (arXiv:2307.07037v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.07037
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#36890;&#36807;&#38754;&#26495;&#25968;&#25454;&#20998;&#26512;&#20102;&#21560;&#24341;&#22806;&#22269;&#30452;&#25509;&#25237;&#36164;&#65288;FDI&#65289;&#27969;&#20837;&#30340;&#32463;&#27982;&#12289;&#21046;&#24230;&#21644;&#25919;&#27835;/&#25919;&#24220;&#22240;&#32032;&#23545;&#26032;&#20852;&#20122;&#27954;&#32463;&#27982;&#20307;&#30340;&#24433;&#21709;&#12290;&#32463;&#27982;&#22240;&#32032;&#23545;FDI&#27969;&#20837;&#26377;&#26174;&#33879;&#24433;&#21709;&#65292;&#32780;&#21046;&#24230;&#22240;&#32032;&#21644;&#25919;&#27835;&#22240;&#32032;&#30340;&#24433;&#21709;&#30456;&#23545;&#36739;&#23567;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25506;&#35752;&#20102;&#22312;&#26032;&#20852;&#30340;&#20108;&#21313;&#22235;&#20010;&#20122;&#27954;&#32463;&#27982;&#20307;&#20013;&#65292;&#21560;&#24341;&#22806;&#22269;&#30452;&#25509;&#25237;&#36164;&#65288;FDI&#65289;&#27969;&#20837;&#30340;&#32463;&#27982;&#12289;&#21046;&#24230;&#21644;&#25919;&#27835;/&#25919;&#24220;&#22240;&#32032;&#12290;&#20026;&#20102;&#30740;&#31350;FDI&#30340;&#26174;&#33879;&#24433;&#21709;&#22240;&#32032;&#65292;&#35813;&#30740;&#31350;&#20351;&#29992;&#20102;&#20026;&#26399;17&#24180;&#65288;2002-2018&#24180;&#65289;&#30340;&#38754;&#26495;&#25968;&#25454;&#12290;&#38754;&#26495;&#26041;&#27861;&#20351;&#25105;&#20204;&#33021;&#22815;&#22788;&#29702;&#20869;&#29983;&#24615;&#21644;&#20854;&#20182;&#38382;&#39064;&#12290;&#23454;&#35777;&#30740;&#31350;&#37319;&#29992;&#22810;&#20803;&#22238;&#24402;&#27169;&#22411;&#36827;&#34892;&#12290;&#30740;&#31350;&#30528;&#37325;&#20110;&#25972;&#20307;&#24615;&#30340;&#26041;&#27861;&#65292;&#24182;&#32771;&#34385;&#20102;&#32463;&#27982;&#12289;&#21046;&#24230;&#21644;&#25919;&#27835;&#31561;&#19977;&#20010;&#24191;&#27867;&#39046;&#22495;&#19979;&#30340;&#19981;&#21516;&#21464;&#37327;&#12290;&#21464;&#37327;&#21253;&#25324;&#24066;&#22330;&#35268;&#27169;&#12289;&#36152;&#26131;&#24320;&#25918;&#31243;&#24230;&#12289;&#36890;&#36135;&#33192;&#32960;&#12289;&#33258;&#28982;&#36164;&#28304;&#12289;&#36151;&#27454;&#21033;&#29575;&#12289;&#36164;&#26412;&#24418;&#25104;&#20316;&#20026;&#32463;&#27982;&#22240;&#32032;&#65292;&#20197;&#21450;&#21830;&#19994;&#31649;&#21046;&#29615;&#22659;&#21644;&#21830;&#19994;&#25259;&#38706;&#25351;&#25968;&#20316;&#20026;&#21046;&#24230;&#22240;&#32032;&#65292;&#20197;&#21450;&#25919;&#27835;&#31283;&#23450;&#24615;&#12289;&#25919;&#24220;&#25928;&#33021;&#21644;&#27861;&#27835;&#20316;&#20026;&#25919;&#27835;&#22240;&#32032;&#12290;&#23454;&#35777;&#30740;&#31350;&#32467;&#26524;&#26174;&#31034;&#65292;&#22823;&#22810;&#25968;&#32463;&#27982;&#22240;&#32032;&#26174;&#33879;&#24433;&#21709;FDI&#27969;&#20837;&#65292;&#32780;&#21046;&#24230;&#22240;&#32032;&#21644;&#25919;&#27835;&#22240;&#32032;&#30340;&#24433;&#21709;&#36739;&#23567;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this paper, we explore the economic, institutional, and political/governmental factors in attracting Foreign Direct Investment (FDI) inflows in the emerging twenty-four Asian economies. To examine the significant determinants of FDI, the study uses panel data for a period of seventeen years (2002-2018). The panel methodology enables us to deal with endogeneity and other issues. Multiple regression models are done for empirical evidence. The study focuses on a holistic approach and considers different variables under three broad areas: economic, institutional, and political aspects. The variables include Market Size, Trade Openness, Inflation, Natural Resource, Lending Rate, Capital Formation as economic factors and Business Regulatory Environment and Business Disclosure Index as institutional factors and Political Stability, Government Effectiveness, and Rule of Law as political factors. The empirical findings show most of the economic factors significantly affect FDI inflows wherea
&lt;/p&gt;</description></item><item><title>&#24191;&#21578;&#21830;&#22312;&#30452;&#25509;&#24191;&#21578;&#24066;&#22330;&#20013;&#23398;&#20064;&#22914;&#20309;&#36873;&#25321;&#32593;&#31449;&#19978;&#30340;&#24191;&#21578;&#65292;&#35843;&#25972;&#20182;&#20204;&#30340;&#20808;&#39564;&#20449;&#24565;&#65292;&#24182;&#36890;&#36807;&#38598;&#21512;&#24191;&#21578;&#21830;&#20449;&#24687;&#26469;&#25552;&#39640;&#24191;&#21578;&#25928;&#26524;&#12290;</title><link>http://arxiv.org/abs/2307.07015</link><description>&lt;p&gt;
&#24191;&#21578;&#21830;&#22312;&#30452;&#25509;&#24191;&#21578;&#24066;&#22330;&#20013;&#30340;&#23398;&#20064;
&lt;/p&gt;
&lt;p&gt;
Advertiser Learning in Direct Advertising Markets. (arXiv:2307.07015v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.07015
&lt;/p&gt;
&lt;p&gt;
&#24191;&#21578;&#21830;&#22312;&#30452;&#25509;&#24191;&#21578;&#24066;&#22330;&#20013;&#23398;&#20064;&#22914;&#20309;&#36873;&#25321;&#32593;&#31449;&#19978;&#30340;&#24191;&#21578;&#65292;&#35843;&#25972;&#20182;&#20204;&#30340;&#20808;&#39564;&#20449;&#24565;&#65292;&#24182;&#36890;&#36807;&#38598;&#21512;&#24191;&#21578;&#21830;&#20449;&#24687;&#26469;&#25552;&#39640;&#24191;&#21578;&#25928;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#30452;&#25509;&#36141;&#20080;&#24191;&#21578;&#30340;&#24191;&#21578;&#21830;&#20197;&#22266;&#23450;&#20215;&#26684;&#20174;&#21457;&#24067;&#32773;&#21644;&#24191;&#21578;&#32593;&#32476;&#25163;&#20013;&#36141;&#20080;&#24191;&#21578;&#24211;&#23384;&#12290;&#36825;&#20123;&#24191;&#21578;&#21830;&#38754;&#20020;&#30528;&#22312;&#20247;&#22810;&#26032;&#30340;&#21457;&#24067;&#32773;&#32593;&#31449;&#20013;&#36873;&#25321;&#24191;&#21578;&#30340;&#22797;&#26434;&#20219;&#21153;&#12290;&#25105;&#20204;&#25552;&#20379;&#35777;&#25454;&#34920;&#26126;&#24191;&#21578;&#21830;&#22312;&#20570;&#20986;&#36825;&#20123;&#36873;&#25321;&#26102;&#24182;&#19981;&#20986;&#33394;&#12290;&#30456;&#21453;&#65292;&#20182;&#20204;&#20250;&#22312;&#36873;&#25321;&#19968;&#20010;&#20559;&#29233;&#30340;&#38598;&#21512;&#20043;&#21069;&#23581;&#35797;&#35768;&#22810;&#32593;&#31449;&#65292;&#19982;&#24191;&#21578;&#21830;&#23398;&#20064;&#30456;&#19968;&#33268;&#12290;&#38543;&#21518;&#65292;&#25105;&#20204;&#23545;&#24191;&#21578;&#21830;&#23545;&#21457;&#24067;&#32773;&#24211;&#23384;&#30340;&#38656;&#27714;&#36827;&#34892;&#24314;&#27169;&#65292;&#24191;&#21578;&#21830;&#21487;&#20197;&#22312;&#21457;&#24067;&#32773;&#30340;&#32593;&#31449;&#19978;&#20102;&#35299;&#24191;&#21578;&#25928;&#26524;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;&#24191;&#21578;&#21830;&#22312;&#20197;&#21518;&#25918;&#24323;&#30340;&#32593;&#31449;&#19978;&#33457;&#36153;&#20102;&#22823;&#37327;&#36164;&#28304;&#36827;&#34892;&#24191;&#21578;&#25237;&#25918;&#65292;&#37096;&#20998;&#21407;&#22240;&#26159;&#20182;&#20204;&#23545;&#36825;&#20123;&#32593;&#31449;&#30340;&#24191;&#21578;&#25928;&#26524;&#23384;&#22312;&#36807;&#20110;&#20048;&#35266;&#30340;&#20808;&#39564;&#20449;&#24565;&#12290;&#26032;&#32593;&#31449;&#19978;&#30340;&#24191;&#21578;&#21830;&#30340;&#39044;&#26399;&#28857;&#20987;&#29575;&#20013;&#20301;&#25968;&#20026;0.23%&#65292;&#27604;&#30495;&#23454;&#30340;&#20013;&#20301;&#25968;&#28857;&#20987;&#29575;0.045%&#39640;&#20116;&#20493;&#12290;&#25105;&#20204;&#32771;&#34385;&#20102;&#22914;&#20309;&#36890;&#36807;&#38598;&#21512;&#24191;&#21578;&#21830;&#20449;&#24687;&#26469;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#20855;&#26377;&#31867;&#20284;&#35270;&#35273;&#20803;&#32032;&#30340;&#24191;&#21578;&#21487;&#20197;&#33719;&#24471;&#31867;&#20284;&#30340;&#28857;&#20987;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;
Direct buy advertisers procure advertising inventory at fixed rates from publishers and ad networks. Such advertisers face the complex task of choosing ads amongst myriad new publisher sites. We offer evidence that advertisers do not excel at making these choices. Instead, they try many sites before settling on a favored set, consistent with advertiser learning. We subsequently model advertiser demand for publisher inventory wherein advertisers learn about advertising efficacy across publishers' sites. Results suggest that advertisers spend considerable resources advertising on sites they eventually abandon -- in part because their prior beliefs about advertising efficacy on those sites are too optimistic. The median advertiser's expected CTR at a new site is 0.23%, five times higher than the true median CTR of 0.045%.  We consider how pooling advertiser information remediates this problem. Specifically, we show that ads with similar visual elements garner similar CTRs, enabling advert
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#39532;&#23572;&#21487;&#22827;&#35828;&#26381;&#36807;&#31243;&#20013;&#30340;&#20869;&#29983;&#20195;&#29702;&#20449;&#24565;&#65292;&#24182;&#36890;&#36807;&#20998;&#26512;&#19981;&#21516;&#30340;&#20449;&#24687;&#27169;&#22411;&#26469;&#24314;&#27169;&#20195;&#29702;&#23545;&#21382;&#21490;&#20449;&#24687;&#30340;&#20102;&#35299;&#31243;&#24230;&#12290;</title><link>http://arxiv.org/abs/2307.03181</link><description>&lt;p&gt;
&#20855;&#26377;&#20869;&#29983;&#20195;&#29702;&#20449;&#24565;&#30340;&#39532;&#23572;&#21487;&#22827;&#35828;&#26381;&#36807;&#31243;
&lt;/p&gt;
&lt;p&gt;
Markov Persuasion Processes with Endogenous Agent Beliefs. (arXiv:2307.03181v1 [cs.GT])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.03181
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#39532;&#23572;&#21487;&#22827;&#35828;&#26381;&#36807;&#31243;&#20013;&#30340;&#20869;&#29983;&#20195;&#29702;&#20449;&#24565;&#65292;&#24182;&#36890;&#36807;&#20998;&#26512;&#19981;&#21516;&#30340;&#20449;&#24687;&#27169;&#22411;&#26469;&#24314;&#27169;&#20195;&#29702;&#23545;&#21382;&#21490;&#20449;&#24687;&#30340;&#20102;&#35299;&#31243;&#24230;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#32771;&#34385;&#19968;&#31181;&#21160;&#24577;&#36125;&#21494;&#26031;&#35828;&#26381;&#29615;&#22659;&#65292;&#22312;&#36825;&#31181;&#29615;&#22659;&#19979;&#65292;&#19968;&#20010;&#25345;&#20037;&#30340;&#21457;&#36865;&#32773;&#36890;&#36807;&#20849;&#20139;&#19982;&#25910;&#30410;&#30456;&#20851;&#30340;&#29366;&#24577;&#20449;&#24687;&#65292;&#35828;&#26381;&#19968;&#31995;&#21015;"&#30701;&#21629;"&#20195;&#29702;&#65288;&#25509;&#25910;&#32773;&#65289;&#12290;&#29366;&#24577;&#36716;&#31227;&#26159;&#39532;&#23572;&#21487;&#22827;&#30340;&#65292;&#21457;&#36865;&#32773;&#36890;&#36807;&#25215;&#35834;&#19968;&#20010;&#65288;&#21487;&#33021;&#26159;&#21382;&#21490;&#20381;&#36182;&#30340;&#65289;&#20449;&#21495;&#26426;&#21046;&#26469;&#26368;&#22823;&#21270;&#38271;&#26399;&#24179;&#22343;&#25910;&#30410;&#12290;&#34429;&#28982;&#22823;&#22810;&#25968;&#20808;&#21069;&#30340;&#39532;&#23572;&#21487;&#22827;&#35828;&#26381;&#30740;&#31350;&#32771;&#34385;&#30340;&#26159;&#19982;&#38142;&#29420;&#31435;&#30340;&#22806;&#29983;&#20195;&#29702;&#20449;&#24565;&#65292;&#20294;&#25105;&#20204;&#30740;&#31350;&#20102;&#19968;&#31181;&#26356;&#33258;&#28982;&#30340;&#21464;&#31181;&#65292;&#20854;&#20013;&#20195;&#29702;&#20449;&#24565;&#21462;&#20915;&#20110;&#38142;&#30340;&#23454;&#29616;&#21382;&#21490;&#12290;&#20998;&#26512;&#36825;&#31181;&#24773;&#20917;&#30340;&#19968;&#20010;&#20851;&#38190;&#25361;&#25112;&#26159;&#23545;&#20195;&#29702;&#23545;&#21382;&#21490;&#20449;&#24687;&#30340;&#23616;&#37096;&#20102;&#35299;&#36827;&#34892;&#24314;&#27169;&#12290;&#25105;&#20204;&#22312;&#21508;&#31181;&#20449;&#24687;&#27169;&#22411;&#19979;&#20998;&#26512;&#20102;&#19968;&#20010;&#39532;&#23572;&#21487;&#22827;&#35828;&#26381;&#36807;&#31243;&#65288;MPP&#65289;&#65292;&#36825;&#20123;&#20449;&#24687;&#27169;&#22411;&#22312;&#25509;&#25910;&#32773;&#23545;&#36807;&#31243;&#21382;&#21490;&#30340;&#20102;&#35299;&#31243;&#24230;&#19978;&#26377;&#25152;&#19981;&#21516;&#12290;&#20855;&#20307;&#26469;&#35828;&#65292;&#25105;&#20204;&#21046;&#23450;&#20102;&#19968;&#20010;&#36890;&#29992;&#30340;&#37096;&#20998;&#20449;&#24687;&#27169;&#22411;&#65292;&#20854;&#20013;&#27599;&#20010;&#25509;&#25910;&#32773;&#20197;$\ell$&#26399;&#28382;&#21518;&#35266;&#23519;&#21382;&#21490;&#20449;&#24687;&#12290;
&lt;/p&gt;
&lt;p&gt;
We consider a dynamic Bayesian persuasion setting where a single long-lived sender persuades a stream of ``short-lived'' agents (receivers) by sharing information about a payoff-relevant state. The state transitions are Markovian and the sender seeks to maximize the long-run average reward by committing to a (possibly history-dependent) signaling mechanism. While most previous studies of Markov persuasion consider exogenous agent beliefs that are independent of the chain, we study a more natural variant with endogenous agent beliefs that depend on the chain's realized history. A key challenge to analyze such settings is to model the agents' partial knowledge about the history information. We analyze a Markov persuasion process (MPP) under various information models that differ in the amount of information the receivers have about the history of the process. Specifically, we formulate a general partial-information model where each receiver observes the history with an $\ell$ period lag.
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#30005;&#21147;&#38656;&#27714;&#21709;&#24212;&#35745;&#21010;&#20013;&#30340;&#20449;&#24687;&#20256;&#36755;&#38382;&#39064;&#65292;&#21457;&#29616;&#22914;&#26524;&#30005;&#21147;&#20215;&#26684;&#23450;&#20026;&#20854;&#29983;&#20135;&#36793;&#38469;&#25104;&#26412;&#65292;&#21017;&#31995;&#32479;&#36816;&#33829;&#21830;&#27809;&#26377;&#27450;&#39575;&#30340;&#21160;&#26426;&#19988;&#24635;&#26159;&#35828;&#30495;&#35805;&#12290;</title><link>http://arxiv.org/abs/2302.12770</link><description>&lt;p&gt;
&#30005;&#21147;&#38656;&#27714;&#21709;&#24212;&#30340;&#20449;&#21495;&#20256;&#36755;&#65306;&#20309;&#26102;&#35828;&#23454;&#35805;&#26368;&#20248;&#65311;
&lt;/p&gt;
&lt;p&gt;
Signalling for Electricity Demand Response: When is Truth Telling Optimal?. (arXiv:2302.12770v2 [eess.SY] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2302.12770
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#30005;&#21147;&#38656;&#27714;&#21709;&#24212;&#35745;&#21010;&#20013;&#30340;&#20449;&#24687;&#20256;&#36755;&#38382;&#39064;&#65292;&#21457;&#29616;&#22914;&#26524;&#30005;&#21147;&#20215;&#26684;&#23450;&#20026;&#20854;&#29983;&#20135;&#36793;&#38469;&#25104;&#26412;&#65292;&#21017;&#31995;&#32479;&#36816;&#33829;&#21830;&#27809;&#26377;&#27450;&#39575;&#30340;&#21160;&#26426;&#19988;&#24635;&#26159;&#35828;&#30495;&#35805;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20840;&#29699;&#30340;&#20844;&#29992;&#20107;&#19994;&#21644;&#36755;&#30005;&#31995;&#32479;&#36816;&#33829;&#21830;&#23454;&#26045;&#38656;&#27714;&#21709;&#24212;&#35745;&#21010;&#65292;&#36890;&#36807;&#21521;&#26368;&#32456;&#29992;&#25143;&#21457;&#36865;&#20379;&#38656;&#29366;&#24577;&#20449;&#24687;&#26469;&#38477;&#20302;&#30005;&#21147;&#28040;&#32791;&#12290;&#25105;&#20204;&#26500;&#24314;&#20102;&#19968;&#20010;&#36125;&#21494;&#26031;&#35828;&#26381;&#27169;&#22411;&#26469;&#20998;&#26512;&#36825;&#31181;&#38656;&#27714;&#21709;&#24212;&#35745;&#21010;&#12290;&#20351;&#29992;&#19968;&#20010;&#31616;&#21333;&#30340;&#27169;&#22411;&#65292;&#21253;&#25324;&#20004;&#20010;&#26102;&#38388;&#27493;&#39588;&#29992;&#20110;&#21512;&#21516;&#31614;&#32626;&#21644;&#21796;&#37266;&#20197;&#21450;&#20004;&#20010;&#29366;&#24577;&#30340;&#21457;&#30005;&#29366;&#24577;&#65292;&#20998;&#26512;&#30005;&#21147;&#23450;&#20215;&#19982;TSO&#27498;&#26354;&#20449;&#24687;&#30340;&#30495;&#23454;&#29366;&#24577;&#20043;&#38388;&#30340;&#20851;&#31995;&#12290;&#25105;&#20204;&#34920;&#26126;&#65292;&#22914;&#26524;&#30005;&#21147;&#20215;&#26684;&#23450;&#20026;&#20854;&#29983;&#20135;&#36793;&#38469;&#25104;&#26412;&#65292;&#21017;TSO&#27809;&#26377;&#27450;&#39575;&#30340;&#21160;&#26426;&#19988;&#24635;&#26159;&#35828;&#30495;&#35805;&#12290;&#21478;&#19968;&#26041;&#38754;&#65292;&#25105;&#20204;&#25552;&#20379;&#20102;&#36807;&#39640;&#23450;&#20215;&#23548;&#33268;TSO&#21521;&#29992;&#25143;&#25552;&#20379;&#26080;&#20449;&#24687;&#30340;&#26465;&#20214;&#12290;
&lt;/p&gt;
&lt;p&gt;
Utilities and transmission system operators (TSO) around the world implement demand response programs for reducing electricity consumption by sending information on the state of balance between supply demand to end-use consumers. We construct a Bayesian persuasion model to analyse such demand response programs. Using a simple model consisting of two time steps for contract signing and invoking, and two states of the state of generation, we analyse the relation between the pricing of electricity and the incentives of the TSO to garble information about the true state of the generation. We show that if the electricity is priced at its marginal cost of production, the TSO has no incentive to lie and always tells the truth. On the other hand, we provide conditions where overpricing of electricity leads the TSO to provide no information to the consumer.
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#32452;&#21512;&#24335;&#28183;&#36879;&#27979;&#35797;&#31639;&#27861;&#65292;&#36890;&#36807;&#31867;&#27604;&#25293;&#21334;&#29702;&#35770;&#26694;&#26550;&#65292;&#21487;&#20197;&#23558;&#36817;&#20284;&#26368;&#20248;&#30340;&#24310;&#36831;&#25509;&#21463;&#26426;&#21046;&#36716;&#25442;&#20026;&#36817;&#20284;&#26368;&#20248;&#30340;&#28183;&#36879;&#27979;&#35797;&#31639;&#27861;&#65292;&#24182;&#19988;&#22312;&#36924;&#36817;&#31243;&#24230;&#19978;&#20445;&#35777;&#20102;&#39069;&#22806;&#24320;&#38144;&#30340;&#19978;&#38480;&#12290;</title><link>http://arxiv.org/abs/2301.12462</link><description>&lt;p&gt;
&#32452;&#21512;&#24335;&#28183;&#36879;&#27979;&#35797;&#65288;&#25110;&#32773;&#24310;&#36831;&#25509;&#21463;&#25293;&#21334;&#30340;&#28040;&#36153;&#32773;&#21097;&#20313;&#20540;&#65289;
&lt;/p&gt;
&lt;p&gt;
Combinatorial Pen Testing (or Consumer Surplus of Deferred-Acceptance Auctions). (arXiv:2301.12462v2 [cs.GT] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2301.12462
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#32452;&#21512;&#24335;&#28183;&#36879;&#27979;&#35797;&#31639;&#27861;&#65292;&#36890;&#36807;&#31867;&#27604;&#25293;&#21334;&#29702;&#35770;&#26694;&#26550;&#65292;&#21487;&#20197;&#23558;&#36817;&#20284;&#26368;&#20248;&#30340;&#24310;&#36831;&#25509;&#21463;&#26426;&#21046;&#36716;&#25442;&#20026;&#36817;&#20284;&#26368;&#20248;&#30340;&#28183;&#36879;&#27979;&#35797;&#31639;&#27861;&#65292;&#24182;&#19988;&#22312;&#36924;&#36817;&#31243;&#24230;&#19978;&#20445;&#35777;&#20102;&#39069;&#22806;&#24320;&#38144;&#30340;&#19978;&#38480;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#28183;&#36879;&#27979;&#35797;&#26159;&#24403;&#21482;&#33021;&#36890;&#36807;&#28040;&#32791;&#36164;&#28304;&#30340;&#33021;&#21147;&#26469;&#34913;&#37327;&#36164;&#28304;&#23481;&#37327;&#26102;&#65292;&#36873;&#25321;&#39640;&#23481;&#37327;&#36164;&#28304;&#30340;&#38382;&#39064;&#12290;&#25105;&#20204;&#26377;&#19968;&#32452;$n$&#21482;&#31508;&#65292;&#27599;&#21482;&#31508;&#37117;&#26377;&#26410;&#30693;&#30340;&#22696;&#27700;&#37327;&#65292;&#25105;&#20204;&#30340;&#30446;&#26631;&#26159;&#36873;&#25321;&#19968;&#20010;&#21487;&#34892;&#30340;&#31508;&#38598;&#21512;&#65292;&#20351;&#20854;&#20013;&#22696;&#27700;&#24635;&#37327;&#26368;&#22823;&#12290;&#25105;&#20204;&#21487;&#20197;&#36890;&#36807;&#20351;&#29992;&#23427;&#20204;&#26469;&#33719;&#24471;&#26356;&#22810;&#20449;&#24687;&#65292;&#20294;&#36825;&#23558;&#28040;&#32791;&#20808;&#21069;&#23384;&#22312;&#20110;&#31508;&#20013;&#30340;&#22696;&#27700;&#12290;&#31639;&#27861;&#23558;&#19982;&#26631;&#20934;&#22522;&#20934;&#65288;&#21363;&#26368;&#20248;&#30340;&#28183;&#36879;&#27979;&#35797;&#31639;&#27861;&#65289;&#21644;&#20840;&#30693;&#22522;&#20934;&#65288;&#21363;&#22914;&#26524;&#20102;&#35299;&#31508;&#20013;&#22696;&#27700;&#30340;&#25968;&#37327;&#65292;&#21017;&#26368;&#20248;&#30340;&#36873;&#25321;&#65289;&#36827;&#34892;&#35780;&#20272;&#12290;&#25105;&#20204;&#36890;&#36807;&#23558;&#24310;&#36831;&#25509;&#21463;&#25293;&#21334;&#21644;&#34394;&#25311;&#20215;&#20540;&#30340;&#25293;&#21334;&#29702;&#35770;&#26694;&#26550;&#31867;&#27604;&#65292;&#30830;&#23450;&#20102;&#26368;&#20248;&#21644;&#36817;&#20284;&#26368;&#20248;&#30340;&#28183;&#36879;&#27979;&#35797;&#31639;&#27861;&#12290;&#25105;&#20204;&#30340;&#26694;&#26550;&#20801;&#35768;&#23558;&#20219;&#20309;&#36817;&#20284;&#26368;&#20248;&#30340;&#24310;&#36831;&#25509;&#21463;&#26426;&#21046;&#36716;&#25442;&#20026;&#36817;&#20284;&#26368;&#20248;&#30340;&#28183;&#36879;&#27979;&#35797;&#31639;&#27861;&#12290;&#27492;&#22806;&#65292;&#36825;&#20123;&#31639;&#27861;&#20445;&#35777;&#22312;&#36924;&#36817;&#31243;&#24230;&#19978;&#23384;&#22312;&#39069;&#22806;&#24320;&#38144;&#33267;&#22810;$(1+o(1)) \ln n$&#12290;
&lt;/p&gt;
&lt;p&gt;
Pen testing is the problem of selecting high-capacity resources when the only way to measure the capacity of a resource expends its capacity. We have a set of $n$ pens with unknown amounts of ink and our goal is to select a feasible subset of pens maximizing the total ink in them. We are allowed to gather more information by writing with them, but this uses up ink that was previously in the pens. Algorithms are evaluated against the standard benchmark, i.e, the optimal pen testing algorithm, and the omniscient benchmark, i.e, the optimal selection if the quantity of ink in the pens are known.  We identify optimal and near optimal pen testing algorithms by drawing analogues to auction theoretic frameworks of deferred-acceptance auctions and virtual values. Our framework allows the conversion of any near optimal deferred-acceptance mechanism into a near optimal pen testing algorithm. Moreover, these algorithms guarantee an additional overhead of at most $(1+o(1)) \ln n$ in the approximat
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#21033;&#29992;&#20960;&#20309;&#26041;&#27861;&#35299;&#20915;&#20102;&#21457;&#36865;&#32773;&#19982;&#39118;&#38505;&#24847;&#35782;&#20195;&#29702;&#20154;&#20043;&#38388;&#30340;&#35828;&#26381;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#19968;&#20010;&#20984;&#20248;&#21270;&#26694;&#26550;&#26469;&#25214;&#21040;&#26368;&#20248;&#30340;&#35828;&#26381;&#26426;&#21046;&#65292;&#24182;&#25506;&#35752;&#20102;&#23436;&#20840;&#35828;&#26381;&#30340;&#23454;&#29616;&#26465;&#20214;&#12290;&#22312;&#20108;&#20803;&#35828;&#26381;&#38382;&#39064;&#20013;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#22312;&#20984;&#24615;&#20551;&#35774;&#19979;&#21487;&#20197;&#25214;&#21040;&#26368;&#20248;&#35299;&#12290;</title><link>http://arxiv.org/abs/2208.03758</link><description>&lt;p&gt;
&#35828;&#26381;&#39118;&#38505;&#24847;&#35782;&#20195;&#29702;&#20154;&#65306;&#20960;&#20309;&#26041;&#27861;&#30340;&#24212;&#29992;
&lt;/p&gt;
&lt;p&gt;
Persuading Risk-Conscious Agents: A Geometric Approach. (arXiv:2208.03758v3 [econ.TH] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2208.03758
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#21033;&#29992;&#20960;&#20309;&#26041;&#27861;&#35299;&#20915;&#20102;&#21457;&#36865;&#32773;&#19982;&#39118;&#38505;&#24847;&#35782;&#20195;&#29702;&#20154;&#20043;&#38388;&#30340;&#35828;&#26381;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#19968;&#20010;&#20984;&#20248;&#21270;&#26694;&#26550;&#26469;&#25214;&#21040;&#26368;&#20248;&#30340;&#35828;&#26381;&#26426;&#21046;&#65292;&#24182;&#25506;&#35752;&#20102;&#23436;&#20840;&#35828;&#26381;&#30340;&#23454;&#29616;&#26465;&#20214;&#12290;&#22312;&#20108;&#20803;&#35828;&#26381;&#38382;&#39064;&#20013;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#22312;&#20984;&#24615;&#20551;&#35774;&#19979;&#21487;&#20197;&#25214;&#21040;&#26368;&#20248;&#35299;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#32771;&#34385;&#20102;&#19968;&#20010;&#21457;&#36865;&#32773;&#19982;&#19968;&#20010;&#20854;&#25928;&#29992;&#21487;&#33021;&#38750;&#32447;&#24615;&#20110;&#20854;&#20449;&#24565;&#30340;&#25509;&#25910;&#32773;&#20043;&#38388;&#30340;&#35828;&#26381;&#38382;&#39064;&#65307;&#25105;&#20204;&#23558;&#36825;&#26679;&#30340;&#25509;&#25910;&#32773;&#31216;&#20026;&#39118;&#38505;&#24847;&#35782;&#20195;&#29702;&#20154;&#12290;&#36825;&#26679;&#30340;&#25928;&#29992;&#27169;&#22411;&#20986;&#29616;&#22312;&#25509;&#25910;&#32773;&#20559;&#31163;&#26399;&#26395;&#25928;&#29992;&#26368;&#22823;&#21270;&#30340;&#31995;&#32479;&#24615;&#20559;&#24046;&#26102;&#65292;&#27604;&#22914;&#19981;&#30830;&#23450;&#24230;&#21388;&#24694;&#65288;&#20363;&#22914;&#65292;&#23545;&#26381;&#21153;&#31561;&#24453;&#26102;&#38388;&#26041;&#24046;&#30340;&#25935;&#24863;&#24615;&#65289;&#12290;&#30001;&#20110;&#36825;&#31181;&#38750;&#32447;&#24615;&#65292;&#20351;&#29992;&#25581;&#31034;&#21407;&#29702;&#23547;&#25214;&#26368;&#20248;&#35828;&#26381;&#26426;&#21046;&#30340;&#26631;&#20934;&#26041;&#27861;&#22833;&#36133;&#20102;&#12290;&#20026;&#20102;&#20811;&#26381;&#36825;&#20010;&#22256;&#38590;&#65292;&#25105;&#20204;&#21033;&#29992;&#38382;&#39064;&#30340;&#24213;&#23618;&#20960;&#20309;&#24615;&#36136;&#65292;&#24320;&#21457;&#20102;&#19968;&#20010;&#20984;&#20248;&#21270;&#26694;&#26550;&#26469;&#25214;&#21040;&#26368;&#20248;&#30340;&#35828;&#26381;&#26426;&#21046;&#12290;&#25105;&#20204;&#23450;&#20041;&#20102;&#23436;&#20840;&#35828;&#26381;&#30340;&#27010;&#24565;&#65292;&#24182;&#20351;&#29992;&#25105;&#20204;&#30340;&#26694;&#26550;&#26469;&#21051;&#30011;&#23436;&#20840;&#35828;&#26381;&#21487;&#20197;&#23454;&#29616;&#30340;&#26465;&#20214;&#12290;&#25105;&#20204;&#29992;&#25105;&#20204;&#30340;&#26041;&#27861;&#30740;&#31350;&#20102;&#20108;&#20803;&#35828;&#26381;&#38382;&#39064;&#65292;&#20854;&#20013;&#25509;&#25910;&#32773;&#26377;&#20004;&#20010;&#34892;&#21160;&#65292;&#21457;&#36865;&#32773;&#22312;&#27599;&#20010;&#29366;&#24577;&#19979;&#37117;&#20005;&#26684;&#20559;&#22909;&#20854;&#20013;&#19968;&#20010;&#12290;&#22312;&#20984;&#24615;&#20551;&#35774;&#19979;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#20108;&#20803;&#35828;&#26381;&#38382;&#39064;&#30340;&#26465;&#20214;&#12290;
&lt;/p&gt;
&lt;p&gt;
We consider a persuasion problem between a sender and a receiver whose utility may be nonlinear in her belief; we call such receivers risk-conscious. Such utility models arise when the receiver exhibits systematic biases away from expected-utility-maximization, such as uncertainty aversion (e.g., from sensitivity to the variance of the waiting time for a service). Due to this nonlinearity, the standard approach to finding the optimal persuasion mechanism using revelation principle fails. To overcome this difficulty, we use the underlying geometry of the problem to develop a convex optimization framework to find the optimal persuasion mechanism. We define the notion of full persuasion and use our framework to characterize conditions under which full persuasion can be achieved. We use our approach to study binary persuasion, where the receiver has two actions and the sender strictly prefers one of them at every state. Under a convexity assumption, we show that the binary persuasion probl
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#21322;&#20840;&#29699;&#26694;&#26550;&#65292;&#29992;&#20110;&#25913;&#36827;&#36125;&#21494;&#26031;VAR&#27169;&#22411;&#30340;&#39044;&#27979;&#24615;&#33021;&#12290;&#35813;&#26694;&#26550;&#26367;&#20195;&#20102;&#20256;&#32479;&#30340;&#20840;&#23616;&#32553;&#20943;&#21442;&#25968;&#65292;&#20351;&#29992;&#32452;&#21035;&#29305;&#23450;&#30340;&#32553;&#20943;&#21442;&#25968;&#12290;&#36890;&#36807;&#24191;&#27867;&#30340;&#27169;&#25311;&#30740;&#31350;&#21644;&#23454;&#35777;&#24212;&#29992;&#65292;&#23637;&#31034;&#20102;&#35813;&#26694;&#26550;&#30340;&#20248;&#28857;&#12290;&#22312;&#31232;&#30095;/&#23494;&#38598;&#20808;&#39564;&#19979;&#65292;&#39044;&#27979;&#24615;&#33021;&#22240;&#35780;&#20272;&#30340;&#32463;&#27982;&#21464;&#37327;&#21644;&#26102;&#38388;&#26694;&#26550;&#32780;&#24322;&#65292;&#20294;&#21160;&#24577;&#27169;&#22411;&#24179;&#22343;&#27861;&#21487;&#20197;&#32531;&#35299;&#36825;&#20010;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2206.04902</link><description>&lt;p&gt;
&#29992;&#36125;&#21494;&#26031;VAR&#27169;&#22411;&#39044;&#27979;&#23439;&#35266;&#32463;&#27982;&#25968;&#25454;&#65306;&#31232;&#30095;&#36824;&#26159;&#23494;&#38598;&#65311;&#35201;&#30475;&#24773;&#20917;&#65281;
&lt;/p&gt;
&lt;p&gt;
Forecasting macroeconomic data with Bayesian VARs: Sparse or dense? It depends!. (arXiv:2206.04902v3 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2206.04902
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#21322;&#20840;&#29699;&#26694;&#26550;&#65292;&#29992;&#20110;&#25913;&#36827;&#36125;&#21494;&#26031;VAR&#27169;&#22411;&#30340;&#39044;&#27979;&#24615;&#33021;&#12290;&#35813;&#26694;&#26550;&#26367;&#20195;&#20102;&#20256;&#32479;&#30340;&#20840;&#23616;&#32553;&#20943;&#21442;&#25968;&#65292;&#20351;&#29992;&#32452;&#21035;&#29305;&#23450;&#30340;&#32553;&#20943;&#21442;&#25968;&#12290;&#36890;&#36807;&#24191;&#27867;&#30340;&#27169;&#25311;&#30740;&#31350;&#21644;&#23454;&#35777;&#24212;&#29992;&#65292;&#23637;&#31034;&#20102;&#35813;&#26694;&#26550;&#30340;&#20248;&#28857;&#12290;&#22312;&#31232;&#30095;/&#23494;&#38598;&#20808;&#39564;&#19979;&#65292;&#39044;&#27979;&#24615;&#33021;&#22240;&#35780;&#20272;&#30340;&#32463;&#27982;&#21464;&#37327;&#21644;&#26102;&#38388;&#26694;&#26550;&#32780;&#24322;&#65292;&#20294;&#21160;&#24577;&#27169;&#22411;&#24179;&#22343;&#27861;&#21487;&#20197;&#32531;&#35299;&#36825;&#20010;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#24314;&#27169;&#21644;&#39044;&#27979;&#23439;&#35266;&#32463;&#27982;&#21464;&#37327;&#26102;&#65292;&#21521;&#37327;&#33258;&#22238;&#24402;&#27169;&#22411;&#65288;VARs&#65289;&#34987;&#24191;&#27867;&#24212;&#29992;&#12290;&#28982;&#32780;&#65292;&#22312;&#39640;&#32500;&#24773;&#20917;&#19979;&#65292;&#23427;&#20204;&#23481;&#26131;&#20986;&#29616;&#36807;&#25311;&#21512;&#38382;&#39064;&#12290;&#36125;&#21494;&#26031;&#26041;&#27861;&#65292;&#20855;&#20307;&#32780;&#35328;&#26159;&#32553;&#20943;&#20808;&#39564;&#26041;&#27861;&#65292;&#24050;&#32463;&#26174;&#31034;&#20986;&#22312;&#25552;&#39640;&#39044;&#27979;&#24615;&#33021;&#26041;&#38754;&#21462;&#24471;&#20102;&#25104;&#21151;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#21322;&#20840;&#29699;&#26694;&#26550;&#65292;&#20854;&#20013;&#25105;&#20204;&#29992;&#29305;&#23450;&#32452;&#21035;&#30340;&#32553;&#20943;&#21442;&#25968;&#26367;&#20195;&#20102;&#20256;&#32479;&#30340;&#20840;&#23616;&#32553;&#20943;&#21442;&#25968;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#22914;&#20309;&#23558;&#27492;&#26694;&#26550;&#24212;&#29992;&#20110;&#21508;&#31181;&#32553;&#20943;&#20808;&#39564;&#65292;&#22914;&#20840;&#23616;-&#23616;&#37096;&#20808;&#39564;&#21644;&#38543;&#26426;&#25628;&#32034;&#21464;&#37327;&#36873;&#25321;&#20808;&#39564;&#12290;&#25105;&#20204;&#36890;&#36807;&#24191;&#27867;&#30340;&#27169;&#25311;&#30740;&#31350;&#21644;&#23545;&#32654;&#22269;&#32463;&#27982;&#25968;&#25454;&#36827;&#34892;&#30340;&#23454;&#35777;&#24212;&#29992;&#65292;&#23637;&#31034;&#20102;&#25152;&#25552;&#20986;&#30340;&#26694;&#26550;&#30340;&#20248;&#28857;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#23545;&#27491;&#22312;&#36827;&#34892;&#30340;"&#31232;&#30095;&#20551;&#35937;"&#36777;&#35770;&#36827;&#34892;&#20102;&#26356;&#28145;&#20837;&#30340;&#25506;&#35752;&#65292;&#21457;&#29616;&#22312;&#31232;&#30095;/&#23494;&#38598;&#20808;&#39564;&#19979;&#30340;&#39044;&#27979;&#24615;&#33021;&#22312;&#35780;&#20272;&#30340;&#32463;&#27982;&#21464;&#37327;&#21644;&#26102;&#38388;&#26694;&#26550;&#20013;&#21464;&#21270;&#24456;&#22823;&#12290;&#28982;&#32780;&#65292;&#21160;&#24577;&#27169;&#22411;&#24179;&#22343;&#27861;&#21487;&#20197;&#32531;&#35299;&#36825;&#20010;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;
Vectorautogressions (VARs) are widely applied when it comes to modeling and forecasting macroeconomic variables. In high dimensions, however, they are prone to overfitting. Bayesian methods, more concretely shrinking priors, have shown to be successful in improving prediction performance. In the present paper, we introduce the semi-global framework, in which we replace the traditional global shrinkage parameter with group-specific shrinkage parameters. We show how this framework can be applied to various shrinking priors, such as global-local priors and stochastic search variable selection priors. We demonstrate the virtues of the proposed framework in an extensive simulation study and in an empirical application forecasting data of the US economy. Further, we shed more light on the ongoing ``Illusion of Sparsity'' debate, finding that forecasting performances under sparse/dense priors vary across evaluated economic variables and across time frames. Dynamic model averaging, however, ca
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#22914;&#20309;&#22312;&#20195;&#29702;&#20351;&#29992;&#22797;&#26434;&#30340;&#8220;&#40657;&#30418;&#8221;&#39044;&#27979;&#20989;&#25968;&#36827;&#34892;&#20915;&#31574;&#30340;&#24773;&#20917;&#19979;&#65292;&#23545;&#31639;&#27861;&#20915;&#31574;&#36827;&#34892;&#26368;&#20248;&#35843;&#25511;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#38480;&#21046;&#20195;&#29702;&#20351;&#29992;&#36879;&#26126;&#24230;&#36275;&#22815;&#39640;&#30340;&#39044;&#27979;&#20989;&#25968;&#26159;&#20302;&#25928;&#30340;&#65292;&#32780;&#38024;&#23545;&#28608;&#21169;&#20559;&#24046;&#28304;&#22836;&#30340;&#30446;&#26631;&#21270;&#24037;&#20855;&#21487;&#20197;&#25552;&#20379;&#27425;&#20248;&#35299;&#20915;&#26041;&#26696;&#65292;&#20174;&#32780;&#25913;&#21892;&#31119;&#21033;&#12290;</title><link>http://arxiv.org/abs/2110.03443</link><description>&lt;p&gt;
&#25581;&#24320;&#40657;&#30418;&#23376;&#65306;&#35843;&#25511;&#31639;&#27861;&#20915;&#31574;
&lt;/p&gt;
&lt;p&gt;
Unpacking the Black Box: Regulating Algorithmic Decisions. (arXiv:2110.03443v2 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2110.03443
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#22914;&#20309;&#22312;&#20195;&#29702;&#20351;&#29992;&#22797;&#26434;&#30340;&#8220;&#40657;&#30418;&#8221;&#39044;&#27979;&#20989;&#25968;&#36827;&#34892;&#20915;&#31574;&#30340;&#24773;&#20917;&#19979;&#65292;&#23545;&#31639;&#27861;&#20915;&#31574;&#36827;&#34892;&#26368;&#20248;&#35843;&#25511;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#38480;&#21046;&#20195;&#29702;&#20351;&#29992;&#36879;&#26126;&#24230;&#36275;&#22815;&#39640;&#30340;&#39044;&#27979;&#20989;&#25968;&#26159;&#20302;&#25928;&#30340;&#65292;&#32780;&#38024;&#23545;&#28608;&#21169;&#20559;&#24046;&#28304;&#22836;&#30340;&#30446;&#26631;&#21270;&#24037;&#20855;&#21487;&#20197;&#25552;&#20379;&#27425;&#20248;&#35299;&#20915;&#26041;&#26696;&#65292;&#20174;&#32780;&#25913;&#21892;&#31119;&#21033;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#23637;&#31034;&#20102;&#22914;&#20309;&#22312;&#19968;&#20010;&#20195;&#29702;&#20351;&#29992;&#22797;&#26434;&#30340;&#8220;&#40657;&#30418;&#8221;&#39044;&#27979;&#20989;&#25968;&#36827;&#34892;&#20915;&#31574;&#65288;&#22914;&#36151;&#27454;&#12289;&#21307;&#30103;&#27979;&#35797;&#25110;&#25307;&#32856;&#65289;&#19988;&#22996;&#25176;&#20154;&#22312;&#20102;&#35299;&#20195;&#29702;&#30340;&#40657;&#30418;&#27169;&#22411;&#26041;&#38754;&#26377;&#38480;&#30340;&#24773;&#20917;&#19979;&#65292;&#26368;&#20248;&#22320;&#35843;&#25511;&#39044;&#27979;&#31639;&#27861;&#12290;&#25105;&#20204;&#35777;&#26126;&#65292;&#21482;&#35201;&#35825;&#23548;&#19981;&#36275;&#65292;&#19988;&#26368;&#20248;&#39044;&#27979;&#20989;&#25968;&#36275;&#22815;&#22797;&#26434;&#65292;&#23558;&#20195;&#29702;&#38480;&#21046;&#22312;&#36275;&#22815;&#36879;&#26126;&#30340;&#39044;&#27979;&#20989;&#25968;&#20013;&#26159;&#20302;&#25928;&#30340;&#12290;&#31639;&#27861;&#23457;&#35745;&#26377;&#21161;&#20110;&#25552;&#39640;&#31119;&#21033;&#65292;&#20294;&#20854;&#25910;&#30410;&#21462;&#20915;&#20110;&#23457;&#35745;&#24037;&#20855;&#30340;&#35774;&#35745;&#12290;&#35768;&#22810;&#35299;&#37322;&#24037;&#20855;&#20542;&#21521;&#20110;&#26368;&#23567;&#21270;&#25972;&#20307;&#20449;&#24687;&#25439;&#22833;&#65292;&#20294;&#36825;&#36890;&#24120;&#26159;&#20302;&#25928;&#30340;&#65292;&#22240;&#20026;&#23427;&#20204;&#38598;&#20013;&#20110;&#35299;&#37322;&#39044;&#27979;&#20989;&#25968;&#30340;&#24179;&#22343;&#34892;&#20026;&#12290;&#38024;&#23545;&#24615;&#30340;&#24037;&#20855;&#65292;&#22914;&#38024;&#23545;&#28608;&#21169;&#20559;&#24046;&#28304;&#22836;&#65288;&#22914;&#36807;&#22810;&#30340;&#20551;&#38451;&#24615;&#25110;&#31181;&#26063;&#24046;&#24322;&#65289;&#30340;&#24037;&#20855;&#65292;&#21487;&#20197;&#25552;&#20379;&#27425;&#20248;&#35299;&#20915;&#26041;&#26696;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#23545;&#25105;&#20204;&#29702;&#35770;&#30340;&#23454;&#35777;&#25903;&#25345;&#12290;
&lt;/p&gt;
&lt;p&gt;
We show how to optimally regulate prediction algorithms in a world where an agent uses complex 'black-box' prediction functions to make decisions such as lending, medical testing, or hiring, and where a principal is limited in how much she can learn about the agent's black-box model. We show that limiting agents to prediction functions that are simple enough to be fully transparent is inefficient as long as the misalignment is limited and first-best prediction functions are sufficiently complex. Algorithmic audits can improve welfare, but the gains depend on the design of the audit tools. Tools that focus on minimizing overall information loss, the focus of many explainer tools, will generally be inefficient since they focus on explaining the average behavior of the prediction function. Targeted tools that focus on the source of incentive misalignment, e.g., excess false positives or racial disparities, can provide second-best solutions. We provide empirical support for our theoretical
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#26356;&#31283;&#20581;&#30340;&#24037;&#20855;&#21464;&#37327;&#30456;&#20851;&#38543;&#26426;&#31995;&#25968;&#65288;IV-CRC&#65289;&#20272;&#35745;&#22120;&#65292;&#21487;&#26356;&#22909;&#22320;&#24212;&#23545;&#24322;&#36136;&#25928;&#24212;&#65292;&#37325;&#26032;&#23457;&#35270;&#20102;&#20013;&#32654;&#36827;&#21475;&#23545;&#32654;&#22269;&#21046;&#36896;&#19994;&#23601;&#19994;&#24433;&#21709;&#30340;&#30740;&#31350;&#65292;&#32467;&#26524;&#34920;&#26126;&#65292;&#22312;&#19981;&#20551;&#35774;&#25928;&#24212;&#24658;&#23450;&#30340;&#24773;&#20917;&#19979;&#65292;&#26080;&#27861;&#24471;&#20986;&#20013;&#22269;&#36827;&#21475;&#23545;&#32654;&#22269;&#21046;&#36896;&#19994;&#23601;&#19994;&#36127;&#38754;&#24433;&#21709;&#30340;&#32467;&#35770;&#12290;</title><link>http://arxiv.org/abs/2103.06437</link><description>&lt;p&gt;
&#38754;&#26495;Bartik&#35774;&#35745;&#30340;&#26356;&#31283;&#20581;&#30340;&#20272;&#35745;&#26041;&#27861;&#65292;&#21450;&#20854;&#22312;&#20013;&#32654;&#36827;&#21475;&#36152;&#26131;&#23545;&#32654;&#22269;&#23601;&#19994;&#24433;&#21709;&#20013;&#30340;&#24212;&#29992;
&lt;/p&gt;
&lt;p&gt;
More Robust Estimators for Panel Bartik Designs, With An Application to the Effect of Imports from China on US Employment. (arXiv:2103.06437v6 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2103.06437
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#26356;&#31283;&#20581;&#30340;&#24037;&#20855;&#21464;&#37327;&#30456;&#20851;&#38543;&#26426;&#31995;&#25968;&#65288;IV-CRC&#65289;&#20272;&#35745;&#22120;&#65292;&#21487;&#26356;&#22909;&#22320;&#24212;&#23545;&#24322;&#36136;&#25928;&#24212;&#65292;&#37325;&#26032;&#23457;&#35270;&#20102;&#20013;&#32654;&#36827;&#21475;&#23545;&#32654;&#22269;&#21046;&#36896;&#19994;&#23601;&#19994;&#24433;&#21709;&#30340;&#30740;&#31350;&#65292;&#32467;&#26524;&#34920;&#26126;&#65292;&#22312;&#19981;&#20551;&#35774;&#25928;&#24212;&#24658;&#23450;&#30340;&#24773;&#20917;&#19979;&#65292;&#26080;&#27861;&#24471;&#20986;&#20013;&#22269;&#36827;&#21475;&#23545;&#32654;&#22269;&#21046;&#36896;&#19994;&#23601;&#19994;&#36127;&#38754;&#24433;&#21709;&#30340;&#32467;&#35770;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#35777;&#26126;&#65292;&#38754;&#26495;Bartik&#22238;&#24402;&#21487;&#20197;&#30830;&#23450;&#20301;&#32622;&#21644;&#26102;&#38388;&#29305;&#23450;&#30340;&#27835;&#30103;&#25928;&#24212;&#30340;&#38750;&#20984;&#32452;&#21512;&#12290;&#22240;&#27492;&#65292;&#22312;&#23384;&#22312;&#24322;&#36136;&#25928;&#24212;&#30340;&#24773;&#20917;&#19979;&#65292;&#36825;&#20123;&#22238;&#24402;&#21487;&#33021;&#23384;&#22312;&#20559;&#24046;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26367;&#20195;&#30340;&#24037;&#20855;&#21464;&#37327;&#30456;&#20851;&#38543;&#26426;&#31995;&#25968;&#65288;IV-CRC&#65289;&#20272;&#35745;&#22120;&#65292;&#21487;&#26356;&#22909;&#22320;&#24212;&#23545;&#24322;&#36136;&#25928;&#24212;&#12290;&#25105;&#20204;&#37325;&#26032;&#23457;&#35270;&#20102;Autor&#31561;&#20154;&#65288;2013&#65289;&#30340;&#30740;&#31350;&#65292;&#20182;&#20204;&#20351;&#29992;&#38754;&#26495;Bartik&#22238;&#24402;&#20272;&#35745;&#20013;&#32654;&#36827;&#21475;&#23545;&#32654;&#22269;&#21046;&#36896;&#19994;&#23601;&#19994;&#30340;&#24433;&#21709;&#12290;&#20182;&#20204;&#30340;&#22238;&#24402;&#20272;&#35745;&#20102;&#39640;&#24230;&#38750;&#20984;&#30340;&#25928;&#24212;&#32452;&#21512;&#65292;&#25105;&#20204;&#30340;IV-CRC&#20272;&#35745;&#22120;&#24456;&#23567;&#19988;&#19981;&#26174;&#33879;&#65306;&#22312;&#19981;&#20551;&#35774;&#25928;&#24212;&#24658;&#23450;&#30340;&#24773;&#20917;&#19979;&#65292;&#26080;&#27861;&#24471;&#20986;&#20013;&#22269;&#36827;&#21475;&#23545;&#32654;&#22269;&#21046;&#36896;&#19994;&#23601;&#19994;&#36127;&#38754;&#24433;&#21709;&#30340;&#32467;&#35770;&#12290;
&lt;/p&gt;
&lt;p&gt;
We show that panel Bartik regressions identify non-convex combinations of location-and-period-specific treatment effects. Thus, those regressions could be biased in the presence of heterogeneous effects. We propose an alternative instrumental-variable correlated-random-coefficient (IV-CRC) estimator, that is more robust to heterogeneous effects. We revisit Autor et al. (2013), who use a panel Bartik regression to estimate the effect of imports from China on US manufacturing employment. Their regression estimates a highly non-convex combination of effects, and our IV-CRC estimator is small and insignificant: without assuming constant effects, one cannot conclude that imports from China negatively affected US manufacturing employment.
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#36890;&#36807;&#20351;&#29992;&#22810;&#33218;&#36172;&#21338;&#26426;&#27169;&#22411;&#20998;&#26512;&#25307;&#32856;&#24066;&#22330;&#20013;&#30340;&#32479;&#35745;&#27495;&#35270;&#65292;&#21457;&#29616;&#33258;&#30001;&#25918;&#20219;&#20250;&#23548;&#33268;&#23545;&#23569;&#25968;&#26063;&#35028;&#24037;&#20154;&#30340;&#25345;&#32493;&#20302;&#20272;&#38382;&#39064;&#12290;&#30740;&#31350;&#25552;&#20986;&#20102;&#20004;&#31181;&#25919;&#31574;&#35299;&#20915;&#26041;&#26696;&#65292;&#21363;&#28151;&#21512;&#26426;&#21046;&#21644;&#32599;&#23612;&#27861;&#21017;&#65292;&#34920;&#26126;&#20020;&#26102;&#32943;&#23450;&#34892;&#21160;&#21487;&#20197;&#26377;&#25928;&#32531;&#35299;&#30001;&#20110;&#25968;&#25454;&#19981;&#36275;&#24341;&#36215;&#30340;&#27495;&#35270;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2010.01079</link><description>&lt;p&gt;
&#23545;&#32479;&#35745;&#27495;&#35270;&#20316;&#20026;&#31038;&#20250;&#23398;&#20064;&#22833;&#36133;&#30340;&#30740;&#31350;&#65306;&#19968;&#20010;&#22810;&#33218;&#36172;&#21338;&#26426;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
On Statistical Discrimination as a Failure of Social Learning: A Multi-Armed Bandit Approach. (arXiv:2010.01079v6 [econ.TH] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2010.01079
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#36890;&#36807;&#20351;&#29992;&#22810;&#33218;&#36172;&#21338;&#26426;&#27169;&#22411;&#20998;&#26512;&#25307;&#32856;&#24066;&#22330;&#20013;&#30340;&#32479;&#35745;&#27495;&#35270;&#65292;&#21457;&#29616;&#33258;&#30001;&#25918;&#20219;&#20250;&#23548;&#33268;&#23545;&#23569;&#25968;&#26063;&#35028;&#24037;&#20154;&#30340;&#25345;&#32493;&#20302;&#20272;&#38382;&#39064;&#12290;&#30740;&#31350;&#25552;&#20986;&#20102;&#20004;&#31181;&#25919;&#31574;&#35299;&#20915;&#26041;&#26696;&#65292;&#21363;&#28151;&#21512;&#26426;&#21046;&#21644;&#32599;&#23612;&#27861;&#21017;&#65292;&#34920;&#26126;&#20020;&#26102;&#32943;&#23450;&#34892;&#21160;&#21487;&#20197;&#26377;&#25928;&#32531;&#35299;&#30001;&#20110;&#25968;&#25454;&#19981;&#36275;&#24341;&#36215;&#30340;&#27495;&#35270;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#20351;&#29992;&#19968;&#20010;&#22810;&#33218;&#36172;&#21338;&#26426;&#27169;&#22411;&#26469;&#20998;&#26512;&#25307;&#32856;&#24066;&#22330;&#20013;&#30340;&#32479;&#35745;&#27495;&#35270;&#12290;&#30446;&#20809;&#30701;&#27973;&#30340;&#20844;&#21496;&#38754;&#20020;&#30528;&#20855;&#26377;&#19981;&#21516;&#21487;&#35266;&#23519;&#29305;&#24449;&#30340;&#24037;&#20154;&#12290;&#24037;&#20154;&#30340;&#25216;&#33021;&#21644;&#29305;&#24449;&#20043;&#38388;&#30340;&#20851;&#32852;&#22312;&#20808;&#39564;&#26465;&#20214;&#19979;&#26159;&#26410;&#30693;&#30340;&#65292;&#22240;&#27492;&#20844;&#21496;&#38656;&#35201;&#23398;&#20064;&#12290;&#33258;&#30001;&#25918;&#20219;&#20250;&#23548;&#33268;&#25345;&#20037;&#24615;&#20302;&#20272;&#65306;&#23569;&#25968;&#26063;&#35028;&#24037;&#20154;&#24456;&#23569;&#34987;&#38599;&#20323;&#65292;&#22240;&#27492;&#20302;&#20272;&#24448;&#24448;&#25345;&#32493;&#23384;&#22312;&#12290;&#21363;&#20351;&#20154;&#21475;&#27604;&#20363;&#31245;&#24494;&#19981;&#24179;&#34913;&#65292;&#20063;&#32463;&#24120;&#23548;&#33268;&#25345;&#20037;&#24615;&#20302;&#20272;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#20004;&#31181;&#25919;&#31574;&#35299;&#20915;&#26041;&#26696;&#65306;&#19968;&#31181;&#26032;&#39062;&#30340;&#34917;&#36148;&#35268;&#21017;&#65288;&#28151;&#21512;&#26426;&#21046;&#65289;&#21644;&#32599;&#23612;&#27861;&#21017;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;&#20020;&#26102;&#32943;&#23450;&#34892;&#21160;&#21487;&#20197;&#26377;&#25928;&#32531;&#35299;&#30001;&#20110;&#25968;&#25454;&#19981;&#36275;&#32780;&#23548;&#33268;&#30340;&#27495;&#35270;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;
We analyze statistical discrimination in hiring markets using a multi-armed bandit model. Myopic firms face workers arriving with heterogeneous observable characteristics. The association between the worker's skill and characteristics is unknown ex ante; thus, firms need to learn it. Laissez-faire causes perpetual underestimation: minority workers are rarely hired, and therefore, the underestimation tends to persist. Even a marginal imbalance in the population ratio frequently results in perpetual underestimation. We propose two policy solutions: a novel subsidy rule (the hybrid mechanism) and the Rooney Rule. Our results indicate that temporary affirmative actions effectively alleviate discrimination stemming from insufficient data.
&lt;/p&gt;</description></item></channel></rss>