<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#21442;&#25968;&#26465;&#20214;&#20998;&#24067;&#25311;&#21512;&#20248;&#24230;&#26816;&#39564;&#26041;&#27861;&#65292;&#21033;&#29992;&#27531;&#24046;&#26631;&#35760;&#30340;&#32463;&#39564;&#36807;&#31243;&#21644;&#26465;&#20214;&#20027;&#25104;&#20998;&#20998;&#26512;&#65292;&#24320;&#21457;&#20102;&#22810;&#31181;&#31867;&#22411;&#30340;&#26032;&#27979;&#35797;&#65292;&#21253;&#25324;&#20840;&#33021;&#27979;&#35797;&#12289;&#22522;&#20110;&#20998;&#37327;&#30340;&#27979;&#35797;&#21644;&#27719;&#38598;&#22810;&#20010;&#20998;&#37327;&#30340;&#24179;&#28369;&#27979;&#35797;&#65292;&#21516;&#26102;&#24341;&#20837;&#20102;&#20998;&#37327;&#36873;&#25321;&#26041;&#27861;&#20197;&#25552;&#39640;&#27979;&#35797;&#25928;&#29575;&#12290;</title><link>https://arxiv.org/abs/2403.10352</link><description>&lt;p&gt;
&#22522;&#20110;&#20027;&#25104;&#20998;&#20998;&#26512;&#21644;&#20998;&#37327;&#36873;&#25321;&#30340;&#26465;&#20214;&#20998;&#24067;&#25311;&#21512;&#20248;&#24230;&#26816;&#39564;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Goodness-of-Fit for Conditional Distributions: An Approach Using Principal Component Analysis and Component Selection
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.10352
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#21442;&#25968;&#26465;&#20214;&#20998;&#24067;&#25311;&#21512;&#20248;&#24230;&#26816;&#39564;&#26041;&#27861;&#65292;&#21033;&#29992;&#27531;&#24046;&#26631;&#35760;&#30340;&#32463;&#39564;&#36807;&#31243;&#21644;&#26465;&#20214;&#20027;&#25104;&#20998;&#20998;&#26512;&#65292;&#24320;&#21457;&#20102;&#22810;&#31181;&#31867;&#22411;&#30340;&#26032;&#27979;&#35797;&#65292;&#21253;&#25324;&#20840;&#33021;&#27979;&#35797;&#12289;&#22522;&#20110;&#20998;&#37327;&#30340;&#27979;&#35797;&#21644;&#27719;&#38598;&#22810;&#20010;&#20998;&#37327;&#30340;&#24179;&#28369;&#27979;&#35797;&#65292;&#21516;&#26102;&#24341;&#20837;&#20102;&#20998;&#37327;&#36873;&#25321;&#26041;&#27861;&#20197;&#25552;&#39640;&#27979;&#35797;&#25928;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#29992;&#20110;&#21442;&#25968;&#26465;&#20214;&#20998;&#24067;&#30340;&#25311;&#21512;&#20248;&#24230;&#26816;&#39564;&#25216;&#26415;&#12290;&#25152;&#25552;&#20986;&#30340;&#26816;&#39564;&#22522;&#20110;&#27531;&#24046;&#26631;&#35760;&#30340;&#32463;&#39564;&#36807;&#31243;&#65292;&#25105;&#20204;&#20026;&#20854;&#24320;&#21457;&#20102;&#26465;&#20214;&#20027;&#25104;&#20998;&#20998;&#26512;&#12290;&#33719;&#24471;&#30340;&#20998;&#37327;&#20026;&#21508;&#31181;&#26032;&#22411;&#27979;&#35797;&#25552;&#20379;&#20102;&#22522;&#30784;&#65292;&#38500;&#20102;&#20840;&#33021;&#27979;&#35797;&#20043;&#22806;&#12290;&#22522;&#20110;&#27599;&#20010;&#20998;&#37327;&#30340;&#20998;&#37327;&#27979;&#35797;&#21487;&#20316;&#20026;&#22312;&#26816;&#27979;&#29305;&#23450;&#26041;&#21521;&#19978;&#30340;&#19987;&#23478;&#12290;&#27719;&#38598;&#20960;&#20010;&#20998;&#37327;&#30340;&#24179;&#28369;&#27979;&#35797;&#22312;&#23454;&#36341;&#20013;&#20063;&#38750;&#24120;&#26377;&#29992;&#12290;&#20026;&#20102;&#36827;&#19968;&#27493;&#25552;&#39640;&#27979;&#35797;&#25928;&#29575;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#31181;&#20998;&#37327;&#36873;&#25321;&#26041;&#27861;&#65292;&#26088;&#22312;&#30830;&#23450;&#26368;&#20855;&#36129;&#29486;&#30340;&#20998;&#37327;&#12290;&#25152;&#25552;&#20986;&#27979;&#35797;&#30340;&#26377;&#38480;&#26679;&#26412;&#24615;&#33021;&#36890;&#36807;&#33945;&#29305;&#21345;&#27931;&#23454;&#39564;&#36827;&#34892;&#23637;&#31034;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.10352v1 Announce Type: new  Abstract: This paper introduces a novel goodness-of-fit test technique for parametric conditional distributions. The proposed tests are based on a residual marked empirical process, for which we develop a conditional Principal Component Analysis. The obtained components provide a basis for various types of new tests in addition to the omnibus one. Component tests that based on each component serve as experts in detecting certain directions. Smooth tests that assemble a few components are also of great use in practice. To further improve testing efficiency, we introduce a component selection approach, aiming to identify the most contributory components. The finite sample performance of the proposed tests is illustrated through Monte Carlo experiments.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#25991;&#26412;&#25366;&#25496;&#21644;&#31038;&#20132;&#32593;&#32476;&#20998;&#26512;&#30340;&#26032;&#26041;&#27861;&#65292;&#36890;&#36807;&#20998;&#26512;&#36229;&#36807;167,000&#31687;&#22312;&#32447;&#26032;&#38395;&#25991;&#31456;&#65292;&#37327;&#21270;&#20102;&#24433;&#21709;&#38750;&#27954;&#20844;&#21496;&#22806;&#36164;&#30452;&#25509;&#25237;&#36164;&#25152;&#26377;&#26435;&#30340;&#21306;&#22495;&#32423;&#23646;&#24615;&#65292;&#32467;&#26524;&#34920;&#26126;&#27425;&#22269;&#23478;&#32423;&#30340;&#32467;&#26500;&#21644;&#21046;&#24230;&#29305;&#24449;&#22312;&#22806;&#36164;&#30452;&#25509;&#25237;&#36164;&#20013;&#25198;&#28436;&#30528;&#37325;&#35201;&#35282;&#33394;&#12290;</title><link>https://arxiv.org/abs/2403.10239</link><description>&lt;p&gt;
&#19968;&#31181;&#29702;&#35299;&#38750;&#27954;&#22806;&#36164;&#30452;&#25509;&#25237;&#36164;&#27425;&#22269;&#23478;&#20915;&#23450;&#22240;&#32032;&#30340;&#22823;&#25968;&#25454;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
A Big Data Approach to Understand Sub-national Determinants of FDI in Africa
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.10239
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#25991;&#26412;&#25366;&#25496;&#21644;&#31038;&#20132;&#32593;&#32476;&#20998;&#26512;&#30340;&#26032;&#26041;&#27861;&#65292;&#36890;&#36807;&#20998;&#26512;&#36229;&#36807;167,000&#31687;&#22312;&#32447;&#26032;&#38395;&#25991;&#31456;&#65292;&#37327;&#21270;&#20102;&#24433;&#21709;&#38750;&#27954;&#20844;&#21496;&#22806;&#36164;&#30452;&#25509;&#25237;&#36164;&#25152;&#26377;&#26435;&#30340;&#21306;&#22495;&#32423;&#23646;&#24615;&#65292;&#32467;&#26524;&#34920;&#26126;&#27425;&#22269;&#23478;&#32423;&#30340;&#32467;&#26500;&#21644;&#21046;&#24230;&#29305;&#24449;&#22312;&#22806;&#36164;&#30452;&#25509;&#25237;&#36164;&#20013;&#25198;&#28436;&#30528;&#37325;&#35201;&#35282;&#33394;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21508;&#31181;&#23439;&#35266;&#32463;&#27982;&#21644;&#21046;&#24230;&#22240;&#32032;&#38459;&#30861;&#20102;&#22806;&#36164;&#30452;&#25509;&#25237;&#36164;&#27969;&#20837;&#65292;&#21253;&#25324;&#33104;&#36133;&#12289;&#36152;&#26131;&#24320;&#25918;&#24615;&#12289;&#34701;&#36164;&#36884;&#24452;&#21644;&#25919;&#27835;&#19981;&#31283;&#23450;&#24615;&#12290;&#29616;&#26377;&#30740;&#31350;&#20027;&#35201;&#38598;&#20013;&#22312;&#22269;&#23478;&#23618;&#38754;&#25968;&#25454;&#65292;&#23545;&#20225;&#19994;&#23618;&#38754;&#25968;&#25454;&#30340;&#25506;&#32034;&#26377;&#38480;&#65292;&#23588;&#20854;&#22312;&#21457;&#23637;&#20013;&#22269;&#23478;&#12290;&#37492;&#20110;&#36825;&#19968;&#31354;&#30333;&#65292;&#26368;&#36817;&#23545;&#30740;&#31350;&#30340;&#21628;&#21505;&#24378;&#35843;&#20102;&#23545;&#23450;&#24615;&#25968;&#25454;&#20998;&#26512;&#30340;&#38656;&#27714;&#65292;&#29305;&#21035;&#26159;&#22312;&#21306;&#22495;&#23618;&#38754;&#28145;&#20837;&#25506;&#35752;&#22806;&#36164;&#30452;&#25509;&#25237;&#36164;&#20915;&#23450;&#22240;&#32032;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#26041;&#27861;&#65292;&#22522;&#20110;&#25991;&#26412;&#25366;&#25496;&#21644;&#31038;&#20132;&#32593;&#32476;&#20998;&#26512;&#65292;&#20174;&#36229;&#36807;167,000&#31687;&#22312;&#32447;&#26032;&#38395;&#25991;&#31456;&#33719;&#21462;&#20449;&#24687;&#65292;&#20197;&#37327;&#21270;&#24433;&#21709;&#38750;&#27954;&#20844;&#21496;&#22806;&#36164;&#30452;&#25509;&#25237;&#36164;&#25152;&#26377;&#26435;&#30340;&#21306;&#22495;&#32423;&#65288;&#27425;&#22269;&#23478;&#32423;&#65289;&#23646;&#24615;&#12290;&#25105;&#20204;&#30340;&#20998;&#26512;&#25193;&#23637;&#20102;&#19990;&#30028;&#38134;&#34892;&#20225;&#19994;&#35843;&#26597;&#25152;&#32472;&#21046;&#30340;&#24037;&#19994;&#21457;&#23637;&#38556;&#30861;&#20449;&#24687;&#12290;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;&#21306;&#22495;&#32423;&#65288;&#27425;&#22269;&#23478;&#32423;&#65289;&#30340;&#32467;&#26500;&#21644;&#21046;&#24230;&#29305;&#24449;&#22312;&#20915;&#23450;&#22806;&#36164;&#30452;&#25509;&#25237;&#36164;&#26041;&#38754;&#21487;&#20197;&#21457;&#25381;&#37325;&#35201;&#20316;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.10239v1 Announce Type: new  Abstract: Various macroeconomic and institutional factors hinder FDI inflows, including corruption, trade openness, access to finance, and political instability. Existing research mostly focuses on country-level data, with limited exploration of firm-level data, especially in developing countries. Recognizing this gap, recent calls for research emphasize the need for qualitative data analysis to delve into FDI determinants, particularly at the regional level. This paper proposes a novel methodology, based on text mining and social network analysis, to get information from more than 167,000 online news articles to quantify regional-level (sub-national) attributes affecting FDI ownership in African companies. Our analysis extends information on obstacles to industrial development as mapped by the World Bank Enterprise Surveys. Findings suggest that regional (sub-national) structural and institutional characteristics can play an important role in det
&lt;/p&gt;</description></item><item><title>&#29702;&#24615;&#20915;&#31574;&#32773;&#32676;&#20307;&#30340;&#36873;&#25321;&#21487;&#20197;&#34987;&#36275;&#22815;&#19981;&#30456;&#20851;&#30340;&#20559;&#22909;&#30340;&#38750;&#29702;&#24615;&#20915;&#31574;&#32773;&#32676;&#20307;&#25152;&#20195;&#34920;&#65292;&#21363;&#38750;&#29702;&#24615;RUM&#12290;&#20960;&#20046;&#25152;&#26377;&#30340;RUMs&#21487;&#20197;&#36890;&#36807;&#19968;&#37096;&#20998;&#20915;&#31574;&#32773;&#26159;&#38750;&#29702;&#24615;&#30340;&#32676;&#20307;&#26469;&#34920;&#31034;&#65292;&#24182;&#19988;&#22312;&#29305;&#23450;&#26465;&#20214;&#19979;&#20182;&#20204;&#30340;&#38750;&#29702;&#24615;&#34892;&#20026;&#26159;&#19981;&#21463;&#38480;&#21046;&#30340;&#12290;</title><link>https://arxiv.org/abs/2403.10208</link><description>&lt;p&gt;
&#38750;&#29702;&#24615;&#38543;&#26426;&#25928;&#29992;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
Irrational Random Utility Models
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.10208
&lt;/p&gt;
&lt;p&gt;
&#29702;&#24615;&#20915;&#31574;&#32773;&#32676;&#20307;&#30340;&#36873;&#25321;&#21487;&#20197;&#34987;&#36275;&#22815;&#19981;&#30456;&#20851;&#30340;&#20559;&#22909;&#30340;&#38750;&#29702;&#24615;&#20915;&#31574;&#32773;&#32676;&#20307;&#25152;&#20195;&#34920;&#65292;&#21363;&#38750;&#29702;&#24615;RUM&#12290;&#20960;&#20046;&#25152;&#26377;&#30340;RUMs&#21487;&#20197;&#36890;&#36807;&#19968;&#37096;&#20998;&#20915;&#31574;&#32773;&#26159;&#38750;&#29702;&#24615;&#30340;&#32676;&#20307;&#26469;&#34920;&#31034;&#65292;&#24182;&#19988;&#22312;&#29305;&#23450;&#26465;&#20214;&#19979;&#20182;&#20204;&#30340;&#38750;&#29702;&#24615;&#34892;&#20026;&#26159;&#19981;&#21463;&#38480;&#21046;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#23637;&#31034;&#20102;&#19968;&#20010;&#29702;&#24615;&#20915;&#31574;&#32773;&#32676;&#20307;&#30340;&#38598;&#21512;&#36873;&#25321; - &#38543;&#26426;&#25928;&#29992;&#27169;&#22411;&#65288;RUMs&#65289; - &#21482;&#26377;&#24403;&#20182;&#20204;&#30340;&#20559;&#22909;&#36275;&#22815;&#19981;&#30456;&#20851;&#26102;&#65292;&#21487;&#20197;&#36890;&#36807;&#19968;&#20010;&#38750;&#29702;&#24615;&#20915;&#31574;&#32773;&#32676;&#20307;&#26469;&#34920;&#31034;&#12290;&#25105;&#20204;&#31216;&#36825;&#31181;&#34920;&#31034;&#20026;&#65306;&#38750;&#29702;&#24615;RUM&#12290;&#28982;&#21518;&#25105;&#20204;&#23637;&#31034;&#20960;&#20046;&#25152;&#26377;&#30340;RUMs&#37117;&#21487;&#20197;&#36890;&#36807;&#33267;&#23569;&#19968;&#37096;&#20998;&#20915;&#31574;&#32773;&#26159;&#38750;&#29702;&#24615;&#20915;&#31574;&#32773;&#30340;&#32676;&#20307;&#26469;&#34920;&#31034;&#65292;&#24182;&#19988;&#22312;&#29305;&#23450;&#26465;&#20214;&#19979;&#20182;&#20204;&#30340;&#38750;&#29702;&#24615;&#34892;&#20026;&#26159;&#19981;&#21463;&#38480;&#21046;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.10208v1 Announce Type: new  Abstract: We show that the set of aggregate choices of a population of rational decision-makers - random utility models (RUMs) - can be represented by a population of irrational ones if, and only if, their preferences are sufficiently uncorrelated. We call this representation: Irrational RUM. We then show that almost all RUMs can be represented by a population in which at least some decision-makers are irrational and that under specific conditions their irrational behavior is unconstrained.
&lt;/p&gt;</description></item><item><title>&#29305;&#23450;&#25910;&#20837;&#36130;&#21153;&#27604;&#29575;&#21644;&#24180;&#22343;&#36890;&#32960;&#29575;&#34987;&#35777;&#26126;&#26159;&#25104;&#21151;&#39044;&#27979;&#38646;&#21806;&#36830;&#38145;&#26426;&#26500;&#30772;&#20135;&#30340;&#26174;&#33879;&#22240;&#32032;&#65292;&#25552;&#20986;&#30340;&#30772;&#20135;&#27169;&#22411;&#33267;&#23569;&#21487;&#20197;&#25552;&#21069;&#19968;&#24180;&#25552;&#20379;&#39044;&#35686;&#20449;&#21495;&#12290;</title><link>https://arxiv.org/abs/2403.09899</link><description>&lt;p&gt;
&#39044;&#27979;&#38646;&#21806;&#36830;&#38145;&#26426;&#26500;&#30772;&#20135;&#65306;&#36817;&#26399;&#32654;&#22269;&#38646;&#21806;&#22833;&#36133;&#26696;&#20363;
&lt;/p&gt;
&lt;p&gt;
Prediction of retail chain failure: examples of recent U.S. retail failures
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.09899
&lt;/p&gt;
&lt;p&gt;
&#29305;&#23450;&#25910;&#20837;&#36130;&#21153;&#27604;&#29575;&#21644;&#24180;&#22343;&#36890;&#32960;&#29575;&#34987;&#35777;&#26126;&#26159;&#25104;&#21151;&#39044;&#27979;&#38646;&#21806;&#36830;&#38145;&#26426;&#26500;&#30772;&#20135;&#30340;&#26174;&#33879;&#22240;&#32032;&#65292;&#25552;&#20986;&#30340;&#30772;&#20135;&#27169;&#22411;&#33267;&#23569;&#21487;&#20197;&#25552;&#21069;&#19968;&#24180;&#25552;&#20379;&#39044;&#35686;&#20449;&#21495;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36807;&#21435;&#20960;&#24180;&#65292;&#19968;&#20123;&#30693;&#21517;&#30340;&#23454;&#20307;&#38646;&#21806;&#36830;&#38145;&#26426;&#26500;&#30456;&#32487;&#20498;&#38381;&#65292;&#24341;&#21457;&#20102;&#20154;&#20204;&#23545;&#25152;&#35859;&#38646;&#21806;&#26411;&#26085;&#30340;&#25285;&#24551;&#12290;&#26412;&#25991;&#32771;&#23519;&#20102;&#32654;&#22269;&#33258;2013&#24180;&#33267;2022&#24180;&#38388;Bed Bath and Beyond&#12289;J.C. Penney&#12289;Rite Aid&#21644;Sears Holdings&#30340;&#22833;&#36133;&#26696;&#20363;&#12290;&#36890;&#36807;&#32771;&#34385;&#20869;&#37096;&#21644;&#22806;&#37096;&#20844;&#21496;&#22240;&#32032;&#65292;&#21033;&#29992;&#24180;&#24230;&#25253;&#21578;&#21644;&#23439;&#35266;&#32463;&#27982;&#25968;&#25454;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#38646;&#21806;&#30772;&#20135;&#27169;&#22411;&#12290;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;&#29305;&#23450;&#30340;&#22522;&#20110;&#25910;&#20837;&#30340;&#36130;&#21153;&#27604;&#29575;&#21644;&#24180;&#22343;&#32654;&#22269;&#36890;&#32960;&#29575;&#26159;&#30772;&#20135;&#30340;&#26174;&#33879;&#39044;&#27979;&#22240;&#23376;&#12290;&#27492;&#22806;&#65292;&#30772;&#20135;&#27169;&#22411;&#35777;&#26126;&#21487;&#20197;&#22312;&#33267;&#23569;&#30772;&#20135;&#21069;&#19968;&#24180;&#25552;&#20379;&#19968;&#31181;&#38750;&#24179;&#20961;&#30340;&#39044;&#35686;&#20449;&#21495;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.09899v1 Announce Type: new  Abstract: Over the last several years, several well-established and prominent brick-and-mortar retail chains have ceased operations, raising concerns for something that some have referred to as a retail apocalypse. While the demise of brick-and-mortar is far from certain, scholars have attempted to model the likelihood that a retailer is about to fail using different approaches. This paper examines the failures of Bed Bath and Beyond, J.C. Penney, Rite Aid, and Sears Holdings in the United States between 2013 and 2022. A model of retail failure is presented that considers internal and external firm factors using both annual report and macroeconomic data. The findings suggest that certain revenue-based financial ratios and the annual average U.S. inflation rates are statistically significant predictors of failure. Furthermore, the failure model demonstrated that it can provide a nontrivial early warning signal at least the year before failure. The 
&lt;/p&gt;</description></item><item><title>&#20840;&#29699;&#36896;&#33337;&#21378;&#23481;&#37327;&#38480;&#21046;&#20102;&#20840;&#29699;&#27682;&#22522;&#20132;&#36890;&#30340;&#25193;&#23637;&#65292;&#30740;&#31350;&#21457;&#29616;&#22914;&#26524;&#20165;&#20381;&#36182;&#28082;&#27682;&#21487;&#33021;&#20250;&#20986;&#29616;&#29942;&#39048;&#38382;&#39064;&#65292;&#21487;&#20197;&#36890;&#36807;&#22686;&#21152;&#26412;&#22320;&#27682;&#27668;&#29983;&#20135;&#12289;&#21033;&#29992;&#31649;&#36947;&#25110;&#20351;&#29992;&#28082;&#27688;&#35268;&#36991;&#36825;&#19968;&#38382;&#39064;</title><link>https://arxiv.org/abs/2403.09272</link><description>&lt;p&gt;
&#38480;&#21046;&#20840;&#29699;&#27682;&#22522;&#20132;&#36890;&#21457;&#23637;&#30340;&#20840;&#29699;&#36896;&#33337;&#21378;&#23481;&#37327;&#38382;&#39064;
&lt;/p&gt;
&lt;p&gt;
Global Shipyard Capacities Limiting the Ramp-Up of Global Hydrogen-based Transportation
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.09272
&lt;/p&gt;
&lt;p&gt;
&#20840;&#29699;&#36896;&#33337;&#21378;&#23481;&#37327;&#38480;&#21046;&#20102;&#20840;&#29699;&#27682;&#22522;&#20132;&#36890;&#30340;&#25193;&#23637;&#65292;&#30740;&#31350;&#21457;&#29616;&#22914;&#26524;&#20165;&#20381;&#36182;&#28082;&#27682;&#21487;&#33021;&#20250;&#20986;&#29616;&#29942;&#39048;&#38382;&#39064;&#65292;&#21487;&#20197;&#36890;&#36807;&#22686;&#21152;&#26412;&#22320;&#27682;&#27668;&#29983;&#20135;&#12289;&#21033;&#29992;&#31649;&#36947;&#25110;&#20351;&#29992;&#28082;&#27688;&#35268;&#36991;&#36825;&#19968;&#38382;&#39064;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35299;&#30899;&#20840;&#29699;&#33021;&#28304;&#31995;&#32479;&#38656;&#35201;&#22823;&#35268;&#27169;&#25193;&#23637;&#21487;&#20877;&#29983;&#33021;&#28304;&#25216;&#26415;&#12290;&#37492;&#20110;&#25104;&#26412;&#25928;&#30410;&#30340;&#21487;&#20877;&#29983;&#33021;&#28304;&#24182;&#19981;&#19968;&#23450;&#20301;&#20110;&#20840;&#29699;&#26368;&#22823;&#33021;&#28304;&#38656;&#27714;&#20013;&#24515;&#38468;&#36817;&#65292;&#22240;&#27492;&#38656;&#35201;&#36827;&#34892;&#20302;&#30899;&#33021;&#28304;&#25215;&#36816;&#30340;&#28023;&#27915;&#36816;&#36755;&#65292;&#22914;&#22522;&#20110;&#21487;&#20877;&#29983;&#33021;&#28304;&#30340;&#27682;&#27668;&#25110;&#27688;&#27668;&#12290;&#28982;&#32780;&#65292;&#29616;&#26377;&#36896;&#33337;&#21378;&#26159;&#21542;&#20855;&#22791;&#25552;&#20379;&#24517;&#35201;&#30340;&#20840;&#29699;&#33328;&#38431;&#25152;&#38656;&#23481;&#37327;&#23578;&#26410;&#24471;&#21040;&#35299;&#31572;&#12290;&#22240;&#27492;&#65292;&#26412;&#30740;&#31350;&#26681;&#25454;&#20840;&#29699;&#27682;&#27668;&#38656;&#27714;&#39044;&#27979;&#20272;&#31639;&#20840;&#29699;&#27833;&#36718;&#38656;&#27714;&#65292;&#21516;&#26102;&#23558;&#36825;&#20123;&#39044;&#27979;&#19982;&#21382;&#21490;&#36896;&#33337;&#21378;&#20135;&#37327;&#36827;&#34892;&#27604;&#36739;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#32467;&#26524;&#26174;&#31034;&#65292;&#22914;&#26524;&#20165;&#20165;&#20381;&#36182;&#28082;&#27682;&#65292;&#21487;&#33021;&#20986;&#29616;&#29942;&#39048;&#38382;&#39064;&#65292;&#38656;&#31561;&#24453;&#33267;2033-2039&#24180;&#35299;&#20915;&#12290;&#36825;&#19968;&#29942;&#39048;&#21487;&#20197;&#36890;&#36807;&#22686;&#21152;&#26412;&#22320;&#27682;&#27668;&#29983;&#20135;&#12289;&#21033;&#29992;&#31649;&#36947;&#25110;&#23558;&#28082;&#27688;&#20316;&#20026;&#27682;&#27668;&#30340;&#33021;&#28304;&#25215;&#36816;&#32773;&#26469;&#35268;&#36991;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.09272v1 Announce Type: new  Abstract: Decarbonizing the global energy system requires significant expansions of renewable energy technologies. Given that cost-effective renewable sources are not necessarily situated in proximity to the largest energy demand centers globally, the maritime transportation of low-carbon energy carriers, such as renewable-based hydrogen or ammonia, will be needed. However, whether existent shipyards possess the required capacity to provide the necessary global fleet has not yet been answered. Therefore, this study estimates global tanker demand based on projections for global hydrogen demand, while comparing these projections with historic shipyard production. Our findings reveal a potential bottleneck until 2033-2039 if relying on liquefied hydrogen exclusively. This bottleneck could be circumvented by increasing local hydrogen production, utilizing pipelines, or liquefied ammonia as an energy carrier for hydrogen. Furthermore, the regional conc
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#19968;&#31181;&#21033;&#29992;&#32467;&#26500;&#24615;&#20914;&#20987;&#26041;&#24046;&#30340;&#31361;&#21464;&#26469;&#35782;&#21035;SVAR&#30340;&#26041;&#27861;&#65292;&#25552;&#20986;&#20102;&#20914;&#28608;&#21709;&#24212;&#30340;&#24050;&#30830;&#23450;&#38598;&#65292;&#24182;&#23637;&#31034;&#20102;&#35745;&#31639;&#26041;&#27861;&#12290;</title><link>https://arxiv.org/abs/2403.06879</link><description>&lt;p&gt;
&#37096;&#20998;&#35782;&#21035;&#30340;&#24322;&#26041;&#24046;SVARs
&lt;/p&gt;
&lt;p&gt;
Partially identified heteroskedastic SVARs
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.06879
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#19968;&#31181;&#21033;&#29992;&#32467;&#26500;&#24615;&#20914;&#20987;&#26041;&#24046;&#30340;&#31361;&#21464;&#26469;&#35782;&#21035;SVAR&#30340;&#26041;&#27861;&#65292;&#25552;&#20986;&#20102;&#20914;&#28608;&#21709;&#24212;&#30340;&#24050;&#30830;&#23450;&#38598;&#65292;&#24182;&#23637;&#31034;&#20102;&#35745;&#31639;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#21033;&#29992;&#32467;&#26500;&#24615;&#20914;&#20987;&#26041;&#24046;&#30340;&#31361;&#21464;&#26469;&#35782;&#21035;&#32467;&#26500;&#21521;&#37327;&#33258;&#22238;&#24402;&#27169;&#22411;&#65288;SVARs&#65289;&#12290;&#23545;&#20110;&#36825;&#31867;&#27169;&#22411;&#30340;&#28857;&#35782;&#21035;&#20381;&#36182;&#20110;&#28041;&#21450;&#32422;&#20943;&#22411;&#35823;&#24046;&#30340;&#21327;&#26041;&#24046;&#30697;&#38453;&#30340;&#29305;&#24449;&#20540;&#20998;&#35299;&#65292;&#24182;&#35201;&#27714;&#25152;&#26377;&#29305;&#24449;&#20540;&#26159;&#19981;&#21516;&#30340;&#12290;&#28982;&#32780;&#65292;&#22312;&#23384;&#22312;&#22810;&#37325;&#29305;&#24449;&#20540;&#30340;&#24773;&#20917;&#19979;&#65292;&#36825;&#31181;&#28857;&#35782;&#21035;&#20250;&#22833;&#36133;&#12290;&#22312;&#19968;&#20010;&#23454;&#35777;&#30456;&#20851;&#30340;&#22330;&#26223;&#20013;&#20986;&#29616;&#36825;&#31181;&#24773;&#20917;&#65292;&#20363;&#22914;&#21482;&#26377;&#19968;&#20010;&#23376;&#38598;&#30340;&#32467;&#26500;&#24615;&#20914;&#20987;&#26377;&#20102;&#26041;&#24046;&#30340;&#31361;&#21464;&#65292;&#25110;&#32773;&#20854;&#20013;&#19968;&#32452;&#21464;&#37327;&#23637;&#31034;&#20102;&#30456;&#21516;&#24133;&#24230;&#30340;&#26041;&#24046;&#21464;&#21270;&#12290;&#32467;&#21512;&#23545;&#32467;&#26500;&#21442;&#25968;&#21644;&#20914;&#28608;&#21709;&#24212;&#30340;&#38646;&#25110;&#31526;&#21495;&#32422;&#26463;&#65292;&#25105;&#20204;&#24471;&#20986;&#20102;&#20914;&#28608;&#21709;&#24212;&#30340;&#24050;&#30830;&#23450;&#38598;&#65292;&#24182;&#23637;&#31034;&#20102;&#22914;&#20309;&#35745;&#31639;&#23427;&#20204;&#12290;&#25105;&#20204;&#22522;&#20110;&#20026;&#24050;&#30830;&#23450;&#38598;SVARs&#24320;&#21457;&#30340;&#31283;&#20581;&#36125;&#21494;&#26031;&#26041;&#27861;&#36827;&#34892;&#20102;&#20914;&#28608;&#21709;&#24212;&#20989;&#25968;&#30340;&#25512;&#35770;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.06879v1 Announce Type: new  Abstract: This paper studies the identification of Structural Vector Autoregressions (SVARs) exploiting a break in the variances of the structural shocks. Point-identification for this class of models relies on an eigen-decomposition involving the covariance matrices of reduced-form errors and requires that all the eigenvalues are distinct. This point-identification, however, fails in the presence of multiplicity of eigenvalues. This occurs in an empirically relevant scenario where, for instance, only a subset of structural shocks had the break in their variances, or where a group of variables shows a variance shift of the same amount. Together with zero or sign restrictions on the structural parameters and impulse responses, we derive the identified sets for impulse responses and show how to compute them. We perform inference on the impulse response functions, building on the robust Bayesian approach developed for set identified SVARs. To illustr
&lt;/p&gt;</description></item><item><title>&#36864;&#20241;&#32773;&#30340;&#19981;&#21516;&#39118;&#38505;&#20559;&#22909;&#23545;&#20854;&#22312;&#36864;&#20241;&#26102;&#30340;&#26368;&#20339;&#21435;&#32047;&#31215;&#31574;&#30053;&#36873;&#25321;&#20135;&#29983;&#26174;&#33879;&#24433;&#21709;&#12290;</title><link>https://arxiv.org/abs/2312.14355</link><description>&lt;p&gt;
&#36864;&#20241;&#20648;&#33988;&#21435;&#32047;&#31215;&#30340;&#26368;&#20339;&#31574;&#30053;&#22312;&#19981;&#21516;&#30340;&#27969;&#21160;&#24615;&#21644;&#25237;&#36164;&#39118;&#38505;&#20559;&#22909;&#19979;
&lt;/p&gt;
&lt;p&gt;
Optimal Strategies for the Decumulation of Retirement Savings under Differing Appetites for Liquidity and Investment Risks
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2312.14355
&lt;/p&gt;
&lt;p&gt;
&#36864;&#20241;&#32773;&#30340;&#19981;&#21516;&#39118;&#38505;&#20559;&#22909;&#23545;&#20854;&#22312;&#36864;&#20241;&#26102;&#30340;&#26368;&#20339;&#21435;&#32047;&#31215;&#31574;&#30053;&#36873;&#25321;&#20135;&#29983;&#26174;&#33879;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36864;&#20241;&#32773;&#23545;&#39118;&#38505;&#30340;&#20559;&#22909;&#26159;&#20256;&#32479;&#19978;&#29992;&#20110;&#23547;&#25214;&#36864;&#20241;&#20648;&#33988;&#21435;&#32047;&#31215;&#26368;&#20339;&#31574;&#30053;&#30340;&#32456;&#36523;&#25928;&#29992;&#27169;&#22411;&#30340;&#24120;&#35265;&#36755;&#20837;&#12290;&#26412;&#25991;&#32771;&#34385;&#20102;&#36864;&#20241;&#32773;&#23545;&#21435;&#32047;&#31215;&#30340;&#20851;&#38190;&#37329;&#34701;&#39118;&#38505;-&#27969;&#21160;&#24615;&#39118;&#38505;&#21644;&#25237;&#36164;&#39118;&#38505;&#21487;&#33021;&#26377;&#19981;&#21516;&#30340;&#20559;&#22909;&#12290;&#25105;&#20204;&#26088;&#22312;&#30830;&#23450;&#36825;&#20123;&#19981;&#21516;&#30340;&#39118;&#38505;&#20559;&#22909;&#26159;&#21542;&#20250;&#23545;&#36864;&#20241;&#32773;&#30340;&#26368;&#20339;&#21435;&#32047;&#31215;&#31574;&#30053;&#36873;&#25321;&#20135;&#29983;&#26174;&#33879;&#24433;&#21709;&#12290;&#20026;&#27492;&#65292;&#25105;&#20204;&#35774;&#35745;&#24182;&#23454;&#26045;&#19968;&#20010;&#26694;&#26550;&#65292;&#26681;&#25454;&#36864;&#20241;&#32773;&#30340;&#30446;&#26631;&#21644;&#23545;&#21435;&#32047;&#31215;&#30340;&#20851;&#38190;&#39118;&#38505;&#30340;&#19981;&#21516;&#20559;&#22909;&#65292;&#20174;&#19968;&#33324;&#30340;&#21487;&#20801;&#35768;&#31574;&#30053;&#38598;&#20013;&#36873;&#25321;&#26368;&#20339;&#30340;&#21435;&#32047;&#31215;&#31574;&#30053;&#12290;&#24635;&#20307;&#32780;&#35328;&#65292;&#25105;&#20204;&#21457;&#29616;&#26377;&#26174;&#33879;&#35777;&#25454;&#34920;&#26126;&#65292;&#36864;&#20241;&#32773;&#23545;&#19981;&#21516;&#21435;&#32047;&#31215;&#39118;&#38505;&#30340;&#19981;&#21516;&#20559;&#22909;&#23558;&#24433;&#21709;&#20182;&#20204;&#22312;&#36864;&#20241;&#26102;&#30340;&#26368;&#20339;&#31574;&#30053;&#36873;&#25321;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2312.14355v2 Announce Type: replace  Abstract: A retiree's appetite for risk is a common input into the lifetime utility models that are traditionally used to find optimal strategies for the decumulation of retirement savings.   In this work, we consider a retiree with potentially differing appetites for the key financial risks of decumulation: liquidity risk and investment risk. We set out to determine whether these differing risk appetites have a significant impact on the retiree's optimal choice of decumulation strategy. To do so, we design and implement a framework which selects the optimal decumulation strategy from a general set of admissible strategies in line with a retiree's goals, and under differing appetites for the key risks of decumulation.   Overall, we find significant evidence to suggest that a retiree's differing appetites for different decumulation risks will impact their optimal choice of strategy at retirement. Through an illustrative example calibrated to th
&lt;/p&gt;</description></item><item><title>&#20351;&#29992;&#32463;&#39564;&#36125;&#21494;&#26031;&#26041;&#27861;&#25366;&#25496;14&#19975;&#26465;&#22810;&#31354;&#31574;&#30053;&#25968;&#25454;&#65292;&#23454;&#29616;&#8220;&#39640;&#36890;&#37327;&#36164;&#20135;&#23450;&#20215;&#8221;&#65292;&#39044;&#27979;&#39640;&#25910;&#30410;&#38598;&#20013;&#22312;&#20250;&#35745;&#31574;&#30053;&#12289;&#23567;&#30424;&#32929;&#21644;&#26089;&#20110;2004&#24180;&#30340;&#26679;&#26412;&#20013;&#65292;&#20026;&#35760;&#24405;&#36164;&#20135;&#23450;&#20215;&#20107;&#23454;&#25552;&#20379;&#20102;&#20005;&#26684;&#12289;&#26080;&#20559;&#35265;&#30340;&#26041;&#27861;&#12290;</title><link>https://arxiv.org/abs/2311.10685</link><description>&lt;p&gt;
&#39640;&#36890;&#37327;&#36164;&#20135;&#23450;&#20215;
&lt;/p&gt;
&lt;p&gt;
High-Throughput Asset Pricing
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2311.10685
&lt;/p&gt;
&lt;p&gt;
&#20351;&#29992;&#32463;&#39564;&#36125;&#21494;&#26031;&#26041;&#27861;&#25366;&#25496;14&#19975;&#26465;&#22810;&#31354;&#31574;&#30053;&#25968;&#25454;&#65292;&#23454;&#29616;&#8220;&#39640;&#36890;&#37327;&#36164;&#20135;&#23450;&#20215;&#8221;&#65292;&#39044;&#27979;&#39640;&#25910;&#30410;&#38598;&#20013;&#22312;&#20250;&#35745;&#31574;&#30053;&#12289;&#23567;&#30424;&#32929;&#21644;&#26089;&#20110;2004&#24180;&#30340;&#26679;&#26412;&#20013;&#65292;&#20026;&#35760;&#24405;&#36164;&#20135;&#23450;&#20215;&#20107;&#23454;&#25552;&#20379;&#20102;&#20005;&#26684;&#12289;&#26080;&#20559;&#35265;&#30340;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#20351;&#29992;&#32463;&#39564;&#36125;&#21494;&#26031;&#65288;EB&#65289;&#25366;&#25496;&#20102;&#26469;&#33258;&#20250;&#35745;&#27604;&#29575;&#12289;&#36807;&#21435;&#25910;&#30410;&#21644;&#32929;&#31080;&#31526;&#21495;&#26500;&#24314;&#30340;14&#19975;&#26465;&#22810;&#31354;&#31574;&#30053;&#30340;&#25968;&#25454;&#12290;&#36825;&#31181;&#8220;&#39640;&#36890;&#37327;&#36164;&#20135;&#23450;&#20215;&#8221;&#20135;&#29983;&#30340;&#26679;&#26412;&#22806;&#32489;&#25928;&#19982;&#39030;&#32423;&#37329;&#34701;&#26399;&#21002;&#20013;&#30340;&#31574;&#30053;&#30456;&#24403;&#12290;&#19982;&#24050;&#21457;&#34920;&#30340;&#31574;&#30053;&#19981;&#21516;&#65292;&#25968;&#25454;&#25366;&#25496;&#30340;&#31574;&#30053;&#20813;&#21463;&#21069;&#30651;&#24615;&#20559;&#35265;&#12290;EB &#39044;&#27979;&#39640;&#25910;&#30410;&#38598;&#20013;&#22312;&#20250;&#35745;&#31574;&#30053;&#12289;&#23567;&#30424;&#32929;&#21644;2004&#24180;&#20043;&#21069;&#30340;&#26679;&#26412;&#20013;&#65292;&#19982;&#26377;&#38480;&#27880;&#24847;&#21147;&#29702;&#35770;&#19968;&#33268;&#12290;&#36890;&#36807;T&#32479;&#35745;&#37327;&#30340;&#27178;&#25130;&#38754;&#20998;&#24067;&#21487;&#20197;&#30475;&#20986;&#36825;&#31181;&#30452;&#35273;&#65292;&#23545;&#20110;&#31561;&#26435;&#37325;&#30340;&#20250;&#35745;&#31574;&#30053;&#65292;&#36825;&#20010;&#20998;&#24067;&#19982;&#38646;&#20551;&#35774;&#30456;&#21435;&#29978;&#36828;&#12290;&#39640;&#36890;&#37327;&#26041;&#27861;&#25552;&#20379;&#20102;&#19968;&#31181;&#20005;&#26684;&#12289;&#26080;&#20559;&#35265;&#30340;&#26041;&#24335;&#65292;&#29992;&#20110;&#35760;&#24405;&#36164;&#20135;&#23450;&#20215;&#20107;&#23454;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2311.10685v2 Announce Type: replace-cross  Abstract: We use empirical Bayes (EB) to mine data on 140,000 long-short strategies constructed from accounting ratios, past returns, and ticker symbols. This "high-throughput asset pricing" produces out-of-sample performance comparable to strategies in top finance journals. But unlike the published strategies, the data-mined strategies are free of look-ahead bias. EB predicts that high returns are concentrated in accounting strategies, small stocks, and pre-2004 samples, consistent with limited attention theories. The intuition is seen in the cross-sectional distribution of t-stats, which is far from the null for equal-weighted accounting strategies. High-throughput methods provide a rigorous, unbiased method for documenting asset pricing facts.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#36890;&#36807;Riesz&#22238;&#24402;&#23454;&#29616;&#33258;&#21160;&#21435;&#20559;&#30340;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#65292;&#20027;&#35201;&#21019;&#26032;&#22312;&#20110;&#25552;&#20379;&#20102;&#20381;&#36182;&#20110;&#24863;&#20852;&#36259;&#21442;&#25968;&#30340;Riesz&#22238;&#24402;&#20272;&#35745;&#22120;&#65292;&#20197;&#20943;&#23569;&#26426;&#22120;&#23398;&#20064;&#20272;&#35745;&#22120;&#21463;&#21040;&#27491;&#21017;&#21270;&#21644;&#27169;&#22411;&#36873;&#25321;&#20559;&#24046;&#30340;&#24433;&#21709;&#65292;&#21487;&#36866;&#29992;&#20110;&#21508;&#31181;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#12290;</title><link>https://arxiv.org/abs/2104.14737</link><description>&lt;p&gt;
&#36890;&#36807;Riesz&#22238;&#24402;&#23454;&#29616;&#33258;&#21160;&#21435;&#20559;&#30340;&#26426;&#22120;&#23398;&#20064;
&lt;/p&gt;
&lt;p&gt;
Automatic Debiased Machine Learning via Riesz Regression
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2104.14737
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#36890;&#36807;Riesz&#22238;&#24402;&#23454;&#29616;&#33258;&#21160;&#21435;&#20559;&#30340;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#65292;&#20027;&#35201;&#21019;&#26032;&#22312;&#20110;&#25552;&#20379;&#20102;&#20381;&#36182;&#20110;&#24863;&#20852;&#36259;&#21442;&#25968;&#30340;Riesz&#22238;&#24402;&#20272;&#35745;&#22120;&#65292;&#20197;&#20943;&#23569;&#26426;&#22120;&#23398;&#20064;&#20272;&#35745;&#22120;&#21463;&#21040;&#27491;&#21017;&#21270;&#21644;&#27169;&#22411;&#36873;&#25321;&#20559;&#24046;&#30340;&#24433;&#21709;&#65292;&#21487;&#36866;&#29992;&#20110;&#21508;&#31181;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#19968;&#20123;&#26377;&#36259;&#30340;&#21442;&#25968;&#21487;&#33021;&#20381;&#36182;&#20110;&#39640;&#32500;&#22238;&#24402;&#12290;&#26426;&#22120;&#23398;&#20064;&#21487;&#20197;&#29992;&#26469;&#20272;&#35745;&#36825;&#20123;&#21442;&#25968;&#12290;&#28982;&#32780;&#65292;&#22522;&#20110;&#26426;&#22120;&#23398;&#20064;&#30340;&#20272;&#35745;&#22120;&#21487;&#33021;&#21463;&#21040;&#27491;&#21017;&#21270;&#21644;/&#25110;&#27169;&#22411;&#36873;&#25321;&#30340;&#20005;&#37325;&#20559;&#24046;&#12290;&#21435;&#20559;&#30340;&#26426;&#22120;&#23398;&#20064;&#20351;&#29992;Neyman&#27491;&#20132;&#20272;&#35745;&#26041;&#31243;&#26469;&#20943;&#23569;&#36825;&#20123;&#20559;&#24046;&#12290;&#21435;&#20559;&#30340;&#26426;&#22120;&#23398;&#20064;&#36890;&#24120;&#38656;&#35201;&#20272;&#35745;&#26410;&#30693;&#30340;Riesz&#20195;&#34920;&#12290;&#26412;&#25991;&#30340;&#20027;&#35201;&#21019;&#26032;&#26159;&#25552;&#20379;&#20381;&#36182;&#20110;&#24863;&#20852;&#36259;&#21442;&#25968;&#30340;Riesz&#22238;&#24402;&#20272;&#35745;&#22120;&#65292;&#32780;&#19981;&#26159;&#26174;&#24335;&#20844;&#24335;&#65292;&#24182;&#19988;&#21487;&#20197;&#20351;&#29992;&#20219;&#20309;&#26426;&#22120;&#23398;&#20064;&#22120;&#65292;&#21253;&#25324;&#31070;&#32463;&#32593;&#32476;&#21644;&#38543;&#26426;&#26862;&#26519;&#12290;&#31471;&#21040;&#31471;&#31639;&#27861;&#28044;&#29616;&#20986;&#26469;&#65292;&#30740;&#31350;&#20154;&#21592;&#36873;&#25321;&#24863;&#20852;&#36259;&#30340;&#21442;&#25968;&#21644;&#26426;&#22120;&#23398;&#20064;&#22120;&#65292;&#21435;&#20559;&#25805;&#20316;&#38543;&#20043;&#33258;&#21160;&#36827;&#34892;&#12290;&#21478;&#19968;&#20010;&#21019;&#26032;&#26159;&#21442;&#25968;&#20381;&#36182;&#20110;&#24191;&#20041;&#22238;&#24402;&#30340;&#21435;&#20559;&#26426;&#22120;&#23398;&#20064;&#22120;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2104.14737v2 Announce Type: replace-cross  Abstract: A variety of interesting parameters may depend on high dimensional regressions. Machine learning can be used to estimate such parameters. However estimators based on machine learners can be severely biased by regularization and/or model selection. Debiased machine learning uses Neyman orthogonal estimating equations to reduce such biases. Debiased machine learning generally requires estimation of unknown Riesz representers. A primary innovation of this paper is to provide Riesz regression estimators of Riesz representers that depend on the parameter of interest, rather than explicit formulae, and that can employ any machine learner, including neural nets and random forests. End-to-end algorithms emerge where the researcher chooses the parameter of interest and the machine learner and the debiasing follows automatically. Another innovation here is debiased machine learners of parameters depending on generalized regressions, incl
&lt;/p&gt;</description></item><item><title>&#20855;&#26377;&#20108;&#20803;&#29366;&#24577;&#31354;&#38388;&#21644;&#29366;&#24577;&#26080;&#20851;&#20559;&#22909;&#30340;&#24265;&#20215;&#20132;&#27969;&#21338;&#24328;&#20013;&#65292;&#21457;&#36865;&#32773;&#26368;&#20248;&#22343;&#34913;&#23545;&#21457;&#36865;&#32773;&#20559;&#22909;&#30340;&#36731;&#24494;&#29366;&#24577;&#20381;&#36182;&#26159;&#31283;&#20581;&#30340;&#12290;</title><link>http://arxiv.org/abs/2309.04193</link><description>&lt;p&gt;
&#20855;&#26377;&#30456;&#23545;&#36879;&#26126;&#21160;&#26426;&#30340;&#24265;&#20215;&#20132;&#27969;&#21338;&#24328;&#20013;&#30340;&#31283;&#20581;&#22343;&#34913;
&lt;/p&gt;
&lt;p&gt;
Robust equilibria in cheap-talk games with fairly transparent motives. (arXiv:2309.04193v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.04193
&lt;/p&gt;
&lt;p&gt;
&#20855;&#26377;&#20108;&#20803;&#29366;&#24577;&#31354;&#38388;&#21644;&#29366;&#24577;&#26080;&#20851;&#20559;&#22909;&#30340;&#24265;&#20215;&#20132;&#27969;&#21338;&#24328;&#20013;&#65292;&#21457;&#36865;&#32773;&#26368;&#20248;&#22343;&#34913;&#23545;&#21457;&#36865;&#32773;&#20559;&#22909;&#30340;&#36731;&#24494;&#29366;&#24577;&#20381;&#36182;&#26159;&#31283;&#20581;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#35777;&#26126;&#65292;&#22312;&#20855;&#26377;&#20108;&#20803;&#29366;&#24577;&#31354;&#38388;&#21644;&#29366;&#24577;&#26080;&#20851;&#20559;&#22909;&#30340;&#24265;&#20215;&#20132;&#27969;&#21338;&#24328;&#20013;&#65292;&#21457;&#36865;&#32773;&#26368;&#20248;&#22343;&#34913;&#23545;&#21457;&#36865;&#32773;&#20559;&#22909;&#30340;&#25200;&#21160;&#26159;&#31283;&#20581;&#30340;&#65292;&#36825;&#20123;&#25200;&#21160;&#20801;&#35768;&#36731;&#24494;&#30340;&#29366;&#24577;&#20381;&#36182;&#12290;&#20854;&#20182;&#22343;&#34913;&#36890;&#24120;&#19981;&#20855;&#22791;&#31283;&#20581;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
We show that sender-optimal equilibria in cheap-talk games with a binary state space and state-independent preferences are robust to perturbations of the sender's preferences that allow for slight state-dependence. Other equilibria generally fail to be robust.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#26085;&#26412;&#32929;&#31080;&#24066;&#22330;&#20013;APT&#30340;&#26102;&#38388;&#19981;&#31283;&#23450;&#24615;&#65292;&#21457;&#29616;APT&#20316;&#20026;&#35299;&#37322;&#26085;&#26412;&#32929;&#31080;&#24066;&#22330;&#30340;&#36866;&#24403;&#27169;&#22411;&#30340;&#26377;&#25928;&#24615;&#38543;&#26102;&#38388;&#21464;&#21270;&#19981;&#31283;&#23450;&#65292;&#39118;&#38505;&#22240;&#32032;&#30340;&#21464;&#21270;&#12289;&#36135;&#24065;&#25919;&#31574;&#21644;&#21830;&#19994;&#21608;&#26399;&#31561;&#22240;&#32032;&#37117;&#21487;&#33021;&#24433;&#21709;&#20854;&#26377;&#25928;&#24615;&#12290;</title><link>http://arxiv.org/abs/2305.05998</link><description>&lt;p&gt;
&#20851;&#20110;APT&#30340;&#26102;&#21464;&#32467;&#26500;&#21450;&#20854;&#22312;&#26085;&#26412;&#32929;&#31080;&#24066;&#22330;&#30340;&#24212;&#29992;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
On the Time-Varying Structure of the Arbitrage Pricing Theory using the Japanese Sector Indices. (arXiv:2305.05998v1 [q-fin.ST])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.05998
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#26085;&#26412;&#32929;&#31080;&#24066;&#22330;&#20013;APT&#30340;&#26102;&#38388;&#19981;&#31283;&#23450;&#24615;&#65292;&#21457;&#29616;APT&#20316;&#20026;&#35299;&#37322;&#26085;&#26412;&#32929;&#31080;&#24066;&#22330;&#30340;&#36866;&#24403;&#27169;&#22411;&#30340;&#26377;&#25928;&#24615;&#38543;&#26102;&#38388;&#21464;&#21270;&#19981;&#31283;&#23450;&#65292;&#39118;&#38505;&#22240;&#32032;&#30340;&#21464;&#21270;&#12289;&#36135;&#24065;&#25919;&#31574;&#21644;&#21830;&#19994;&#21608;&#26399;&#31561;&#22240;&#32032;&#37117;&#21487;&#33021;&#24433;&#21709;&#20854;&#26377;&#25928;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#26159;&#31532;&#19968;&#31687;&#30740;&#31350;&#22312;&#26085;&#26412;&#32929;&#31080;&#24066;&#22330;&#20013;&#32771;&#23519;APT&#26102;&#38388;&#19981;&#31283;&#23450;&#24615;&#30340;&#35770;&#25991;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#25105;&#20204;&#37319;&#29992;Fama&#21644;MacBeth&#65288;1973&#65289;&#30340;&#20004;&#27493;&#22238;&#24402;&#21644;Kamstra&#21644;Shi&#65288;2023&#65289;&#30340;&#24191;&#20041;GRS&#27979;&#35797;&#26041;&#27861;&#65292;&#34913;&#37327;&#27599;&#20010;&#39118;&#38505;&#22240;&#23376;&#21464;&#21270;&#23545;&#32929;&#31080;&#39118;&#38505;&#28322;&#20215;&#30340;&#24433;&#21709;&#65292;&#20197;&#32771;&#23519;APT&#30340;&#26377;&#25928;&#24615;&#38543;&#26102;&#38388;&#30340;&#21464;&#21270;&#12290;&#25105;&#20204;&#24635;&#32467;&#25105;&#20204;&#30340;&#23454;&#35777;&#32467;&#26524;&#22914;&#19979;&#65306;&#65288;1&#65289;APT&#22312;&#25972;&#20010;&#26679;&#26412;&#26399;&#38388;&#24471;&#21040;&#25903;&#25345;&#65292;&#20294;&#24182;&#19981;&#24635;&#26159;&#26377;&#25928;&#30340;&#65307;&#65288;2&#65289;&#36135;&#24065;&#25919;&#31574;&#30340;&#21464;&#21270;&#22312;&#26085;&#26412;&#24433;&#21709;APT&#30340;&#26377;&#25928;&#24615;&#65307;&#65288;3&#65289;&#27599;&#20010;&#22240;&#23376;&#30340;&#39118;&#38505;&#28322;&#20215;&#30340;&#26102;&#21464;&#20272;&#35745;&#20063;&#19981;&#31283;&#23450;&#65292;&#21463;&#21040;&#21830;&#19994;&#21608;&#26399;&#21644;&#32463;&#27982;&#21361;&#26426;&#30340;&#24433;&#21709;&#12290;&#22240;&#27492;&#65292;&#25105;&#20204;&#24471;&#20986;&#32467;&#35770;&#65292;APT&#20316;&#20026;&#35299;&#37322;&#26085;&#26412;&#32929;&#31080;&#24066;&#22330;&#30340;&#36866;&#24403;&#27169;&#22411;&#30340;&#26377;&#25928;&#24615;&#38543;&#26102;&#38388;&#30340;&#21464;&#21270;&#24182;&#19981;&#31283;&#23450;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper is the first study to examine the time instability of the APT in the Japanese stock market. In particular, we measure how changes in each risk factor affect the stock risk premiums to investigate the validity of the APT over time, applying the rolling window method to Fama and MacBeth's (1973) two-step regression and Kamstra and Shi's (2023) generalized GRS test. We summarize our empirical results as follows: (1) the APT is supported over the entire sample period but not at all times, (2) the changes in monetary policy greatly affect the validity of the APT in Japan, and (3) the time-varying estimates of the risk premiums for each factor are also unstable over time, and they are affected by the business cycle and economic crises. Therefore, we conclude that the validity of the APT as an appropriate model to explain the Japanese sector index is not stable over time.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#24102;&#20840;&#20184;&#25293;&#21334;&#30340;&#39034;&#24207;&#28120;&#27760;&#27604;&#36187;&#65292;&#22312;&#35774;&#35745;&#32773;&#26080;&#27861;&#24471;&#30693;&#25152;&#26377;&#36873;&#25163;&#31867;&#22411;&#24773;&#20917;&#19979;&#65292;&#23545;&#20110;&#26377;&#38480;&#30340;&#36873;&#25163;&#25968;&#37327;&#65292;&#25105;&#20204;&#26126;&#30830;&#23450;&#20041;&#20102;&#22343;&#34913;&#31574;&#30053;&#21644;&#26399;&#26395;&#30340;&#26368;&#20248;&#26426;&#21046;&#65292;&#24182;&#20026;&#35774;&#35745;&#32773;&#25552;&#20379;&#20102;&#19968;&#20123;&#20247;&#21253;&#27604;&#36187;&#30340;&#35774;&#35745;&#21551;&#31034;&#12290;</title><link>http://arxiv.org/abs/2205.08104</link><description>&lt;p&gt;
&#24102;&#20840;&#20184;&#25293;&#21334;&#30340;&#39034;&#24207;&#28120;&#27760;&#27604;&#36187;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Sequential Elimination Contests with All-Pay Auctions. (arXiv:2205.08104v2 [cs.GT] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2205.08104
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#24102;&#20840;&#20184;&#25293;&#21334;&#30340;&#39034;&#24207;&#28120;&#27760;&#27604;&#36187;&#65292;&#22312;&#35774;&#35745;&#32773;&#26080;&#27861;&#24471;&#30693;&#25152;&#26377;&#36873;&#25163;&#31867;&#22411;&#24773;&#20917;&#19979;&#65292;&#23545;&#20110;&#26377;&#38480;&#30340;&#36873;&#25163;&#25968;&#37327;&#65292;&#25105;&#20204;&#26126;&#30830;&#23450;&#20041;&#20102;&#22343;&#34913;&#31574;&#30053;&#21644;&#26399;&#26395;&#30340;&#26368;&#20248;&#26426;&#21046;&#65292;&#24182;&#20026;&#35774;&#35745;&#32773;&#25552;&#20379;&#20102;&#19968;&#20123;&#20247;&#21253;&#27604;&#36187;&#30340;&#35774;&#35745;&#21551;&#31034;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#19968;&#31181;&#39034;&#24207;&#28120;&#27760;&#27604;&#36187;&#65292;&#27604;&#36187;&#21069;&#38656;&#35201;&#36807;&#28388;&#36873;&#25163;&#12290;&#36825;&#19968;&#27169;&#22411;&#30340;&#26500;&#24314;&#26159;&#22522;&#20110;&#35768;&#22810;&#20247;&#21253;&#27604;&#36187;&#21482;&#26377;&#26377;&#38480;&#30340;&#35780;&#23457;&#36164;&#28304;&#65292;&#38656;&#35201;&#25552;&#39640;&#25552;&#20132;&#29289;&#21697;&#30340;&#25972;&#20307;&#36136;&#37327;&#36825;&#19968;&#23454;&#36341;&#30340;&#32771;&#34385;&#12290;&#22312;&#31532;&#19968;&#31181;&#24773;&#20917;&#19979;&#65292;&#25105;&#20204;&#32771;&#34385;&#36873;&#25163;&#30340;&#33021;&#21147;&#25490;&#21517;&#30340;&#30693;&#24773;&#35774;&#35745;&#32773;&#65292;&#20801;&#35768; $2\leq n_2 \leq n_1$ &#30340;&#21069; $n_2$ &#21517;&#36873;&#25163;&#21442;&#21152;&#27604;&#36187;&#12290;&#36827;&#20837;&#27604;&#36187;&#30340;&#36873;&#25163;&#20250;&#26681;&#25454;&#33258;&#24049;&#30340;&#33021;&#21147;&#25490;&#21517;&#21487;&#20197;&#36827;&#20837;&#21069; $n_2$ &#21517;&#30340;&#20449;&#21495;&#26469;&#26356;&#26032;&#23545;&#23545;&#25163;&#33021;&#21147;&#30340;&#20449;&#24565;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#21363;&#20351;&#20855;&#26377;IID&#20808;&#39564;&#65292;&#20182;&#20204;&#30340;&#21518;&#39564;&#20449;&#24565;&#20173;&#28982;&#23384;&#22312;&#30456;&#20851;&#24615;&#65292;&#24182;&#19988;&#21462;&#20915;&#20110;&#36873;&#25163;&#30340;&#20010;&#20154;&#33021;&#21147;&#12290;&#25105;&#20204;&#26126;&#30830;&#22320;&#21051;&#30011;&#20102;&#23545;&#31216;&#30340;&#21644;&#21807;&#19968;&#30340;&#36125;&#21494;&#26031;&#22343;&#34913;&#31574;&#30053;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#27599;&#20010;&#34987;&#24405;&#21462;&#36873;&#25163;&#30340;&#22343;&#34913;&#20184;&#20986;&#38543; $n_2$ &#30340;&#22686;&#21152;&#32780;&#22686;&#21152;&#65292;&#24403; $n_2 \in [\lfloor{(n_1+1)/2}\rfloor+1,n_1]$ &#26102;&#65292;&#20294;&#22312; $n_2 \in [2, \lfloor{(n_1+1)/2}\rfloor]$ &#26102;&#19981;&#19968;&#23450;&#21333;&#35843;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#32771;&#34385;&#20102;&#26356;&#21152;&#29616;&#23454;&#30340;&#24773;&#20917;&#65292;&#35774;&#35745;&#32773;&#21482;&#20855;&#26377;&#26377;&#20851;&#36873;&#25163;&#31867;&#22411;&#30340;&#37096;&#20998;&#20449;&#24687;&#65292;&#36873;&#25163;&#31867;&#22411;&#22312; $[0,1]$ &#19978;&#29420;&#31435;&#22343;&#21248;&#20998;&#24067;&#12290;&#25105;&#20204;&#24471;&#21040;&#20102;&#20851;&#20110;&#25509;&#21463;&#36873;&#25163;&#30340;&#26399;&#26395;&#26368;&#20248;&#26426;&#21046;&#24615;&#33021;&#30340;&#23574;&#38160;&#30028;&#38480;&#65292;&#20197;&#21450;&#27599;&#20010;&#36827;&#20837;&#27604;&#36187;&#30340;&#36873;&#25163;&#22343;&#34913;&#20184;&#20986;&#30340;&#30028;&#38480;&#12290;&#25105;&#20204;&#30340;&#32467;&#26524;&#23545;&#20110;&#20247;&#21253;&#27604;&#36187;&#30340;&#35774;&#35745;&#20855;&#26377;&#37325;&#35201;&#24847;&#20041;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study a sequential elimination contest where players are filtered prior to the round of competing for prizes. This is motivated by the practice that many crowdsourcing contests have very limited resources of reviewers and want to improve the overall quality of the submissions. We first consider a setting where the designer knows the ranking of the abilities (types) of all $n_1$ registered players, and admit the top $n_2$ players with $2\leq n_2 \leq n_1$ into the contest. The players admitted into the contest update their beliefs about their opponents based on the signal that their abilities are among the top $n_2$. We find that their posterior beliefs, even with IID priors, are correlated and depend on players' private abilities.  We explicitly characterize the symmetric and unique Bayesian equilibrium strategy. We find that each admitted player's equilibrium effort is increasing in $n_2$ when $n_2 \in [\lfloor{(n_1+1)/2}\rfloor+1,n_1]$, but not monotone in general when $n_2 \in [2
&lt;/p&gt;</description></item></channel></rss>