<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#26412;&#25991;&#36890;&#36807;&#23558;&#26356;&#26032;&#30340;&#23458;&#25143;&#38656;&#27714;&#25972;&#21512;&#21040;&#28378;&#21160;&#35270;&#30028;&#35268;&#21010;&#21608;&#26399;&#20013;&#65292;&#20351;&#29992;&#22330;&#26223;-based&#30340;&#38543;&#26426;&#35268;&#21010;&#26469;&#35299;&#20915;&#26377;&#33021;&#21147;&#25209;&#37327;&#35268;&#27169;&#38382;&#39064;&#65292;&#22312;&#31163;&#25955;&#20107;&#20214;&#27169;&#25311;-&#20248;&#21270;&#26694;&#26550;&#20013;&#19981;&#26029;&#35843;&#25972;&#29983;&#20135;&#35745;&#21010;&#65292;&#25552;&#21319;&#20102;&#29983;&#20135;&#35745;&#21010;&#30340;&#28378;&#21160;&#35270;&#30028;&#12290;</title><link>https://arxiv.org/abs/2402.14506</link><description>&lt;p&gt;
&#36890;&#36807;&#27169;&#25311;&#35780;&#20272;&#30340;&#38543;&#26426;&#20248;&#21270;&#26469;&#22686;&#24378;&#28378;&#21160;&#35270;&#30028;&#29983;&#20135;&#35745;&#21010;
&lt;/p&gt;
&lt;p&gt;
Enhancing Rolling Horizon Production Planning Through Stochastic Optimization Evaluated by Means of Simulation
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.14506
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36890;&#36807;&#23558;&#26356;&#26032;&#30340;&#23458;&#25143;&#38656;&#27714;&#25972;&#21512;&#21040;&#28378;&#21160;&#35270;&#30028;&#35268;&#21010;&#21608;&#26399;&#20013;&#65292;&#20351;&#29992;&#22330;&#26223;-based&#30340;&#38543;&#26426;&#35268;&#21010;&#26469;&#35299;&#20915;&#26377;&#33021;&#21147;&#25209;&#37327;&#35268;&#27169;&#38382;&#39064;&#65292;&#22312;&#31163;&#25955;&#20107;&#20214;&#27169;&#25311;-&#20248;&#21270;&#26694;&#26550;&#20013;&#19981;&#26029;&#35843;&#25972;&#29983;&#20135;&#35745;&#21010;&#65292;&#25552;&#21319;&#20102;&#29983;&#20135;&#35745;&#21010;&#30340;&#28378;&#21160;&#35270;&#30028;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#29983;&#20135;&#35745;&#21010;&#24517;&#39035;&#32771;&#34385;&#21040;&#29983;&#20135;&#31995;&#32479;&#20013;&#30340;&#19981;&#30830;&#23450;&#24615;&#65292;&#28304;&#33258;&#38656;&#27714;&#39044;&#27979;&#30340;&#27874;&#21160;&#12290;&#22240;&#27492;&#65292;&#26412;&#25991;&#38598;&#20013;&#22312;&#23558;&#26356;&#26032;&#30340;&#23458;&#25143;&#38656;&#27714;&#25972;&#21512;&#21040;&#28378;&#21160;&#35270;&#30028;&#35268;&#21010;&#21608;&#26399;&#20013;&#12290;&#25105;&#20204;&#20351;&#29992;&#22522;&#20110;&#22330;&#26223;&#30340;&#38543;&#26426;&#35268;&#21010;&#26469;&#35299;&#20915;&#28378;&#21160;&#35270;&#30028;&#29615;&#22659;&#19979;&#30340;&#26377;&#33021;&#21147;&#25209;&#37327;&#35268;&#27169;&#38382;&#39064;&#12290;&#35813;&#29615;&#22659;&#36890;&#36807;&#31163;&#25955;&#20107;&#20214;&#27169;&#25311;&#20248;&#21270;&#26694;&#26550;&#22797;&#21046;&#65292;&#20854;&#20013;&#23545;&#23450;&#26399;&#35299;&#20915;&#30340;&#20248;&#21270;&#38382;&#39064;&#65292;&#21033;&#29992;&#26368;&#26032;&#30340;&#38656;&#27714;&#20449;&#24687;&#19981;&#26029;&#35843;&#25972;&#29983;&#20135;&#35745;&#21010;&#12290;&#25105;&#20204;&#35780;&#20272;&#20102;&#38543;&#26426;&#20248;&#21270;&#26041;&#27861;&#65292;&#24182;&#23558;&#20854;&#24615;&#33021;&#19982;&#20351;&#29992;&#39044;&#26399;&#38656;&#27714;&#25968;&#25454;&#20316;&#20026;&#36755;&#20837;&#35299;&#20915;&#30830;&#23450;&#24615;&#25209;&#37327;&#35268;&#27169;&#27169;&#22411;&#20197;&#21450;&#26631;&#20934;&#29289;&#26009;&#38656;&#27714;&#35745;&#21010;&#65288;MRP&#65289;&#36827;&#34892;&#20102;&#27604;&#36739;&#12290;&#22312;&#27169;&#25311;&#30740;&#31350;&#20013;&#65292;&#25105;&#20204;&#20998;&#26512;&#20102;&#19982;&#39044;&#27979;&#30456;&#20851;&#30340;&#19977;&#31181;&#19981;&#21516;&#23458;&#25143;&#34892;&#20026;&#65292;&#20197;&#21450;&#22235;&#20010;&#27700;&#24179;&#30340;&#38656;&#27714;&#27874;&#21160;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.14506v1 Announce Type: new  Abstract: Production planning must account for uncertainty in a production system, arising from fluctuating demand forecasts. Therefore, this article focuses on the integration of updated customer demand into the rolling horizon planning cycle. We use scenario-based stochastic programming to solve capacitated lot sizing problems under stochastic demand in a rolling horizon environment. This environment is replicated using a discrete event simulation-optimization framework, where the optimization problem is periodically solved, leveraging the latest demand information to continually adjust the production plan. We evaluate the stochastic optimization approach and compare its performance to solving a deterministic lot sizing model, using expected demand figures as input, as well as to standard Material Requirements Planning (MRP). In the simulation study, we analyze three different customer behaviors related to forecasting, along with four levels of 
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#23558;&#21452;&#26426;&#22120;&#23398;&#20064;&#21644;&#27169;&#22411;&#24179;&#22343;&#21270;&#30456;&#32467;&#21512;&#30340;&#26041;&#27861;&#65292;&#29992;&#20110;&#20272;&#35745;&#32467;&#26500;&#21442;&#25968;&#12290;&#30740;&#31350;&#34920;&#26126;&#65292;&#36825;&#31181;&#26041;&#27861;&#27604;&#36215;&#24120;&#35265;&#30340;&#22522;&#20110;&#21333;&#19968;&#23398;&#20064;&#22120;&#30340;&#26367;&#20195;&#26041;&#27861;&#26356;&#21152;&#40065;&#26834;&#65292;&#36866;&#29992;&#20110;&#22788;&#29702;&#37096;&#20998;&#26410;&#30693;&#30340;&#20989;&#25968;&#24418;&#24335;&#12290;</title><link>http://arxiv.org/abs/2401.01645</link><description>&lt;p&gt;
&#27169;&#22411;&#24179;&#22343;&#21270;&#21644;&#21452;&#26426;&#22120;&#23398;&#20064;
&lt;/p&gt;
&lt;p&gt;
Model Averaging and Double Machine Learning. (arXiv:2401.01645v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.01645
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#23558;&#21452;&#26426;&#22120;&#23398;&#20064;&#21644;&#27169;&#22411;&#24179;&#22343;&#21270;&#30456;&#32467;&#21512;&#30340;&#26041;&#27861;&#65292;&#29992;&#20110;&#20272;&#35745;&#32467;&#26500;&#21442;&#25968;&#12290;&#30740;&#31350;&#34920;&#26126;&#65292;&#36825;&#31181;&#26041;&#27861;&#27604;&#36215;&#24120;&#35265;&#30340;&#22522;&#20110;&#21333;&#19968;&#23398;&#20064;&#22120;&#30340;&#26367;&#20195;&#26041;&#27861;&#26356;&#21152;&#40065;&#26834;&#65292;&#36866;&#29992;&#20110;&#22788;&#29702;&#37096;&#20998;&#26410;&#30693;&#30340;&#20989;&#25968;&#24418;&#24335;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#35752;&#35770;&#20102;&#23558;&#21452;&#37325;/&#26080;&#20559;&#26426;&#22120;&#23398;&#20064;&#65288;DDML&#65289;&#19982;stacking&#65288;&#19968;&#31181;&#27169;&#22411;&#24179;&#22343;&#21270;&#26041;&#27861;&#65292;&#29992;&#20110;&#32467;&#21512;&#22810;&#20010;&#20505;&#36873;&#23398;&#20064;&#22120;&#65289;&#30456;&#32467;&#21512;&#65292;&#29992;&#20110;&#20272;&#35745;&#32467;&#26500;&#21442;&#25968;&#12290;&#25105;&#20204;&#24341;&#20837;&#20102;&#20004;&#31181;&#26032;&#30340;DDML stacking&#26041;&#27861;&#65306;&#30701;stacking&#21033;&#29992;DDML&#30340;&#20132;&#21449;&#25311;&#21512;&#27493;&#39588;&#22823;&#22823;&#20943;&#23569;&#20102;&#35745;&#31639;&#36127;&#25285;&#65292;&#32780;&#27719;&#24635;stacking&#21487;&#20197;&#22312;&#20132;&#21449;&#25311;&#21512;&#30340;&#25240;&#21472;&#19978;&#24378;&#21046;&#25191;&#34892;&#36890;&#29992; stacking&#26435;&#37325;&#12290;&#36890;&#36807;&#32463;&#36807;&#26657;&#20934;&#30340;&#27169;&#25311;&#30740;&#31350;&#21644;&#20004;&#20010;&#24212;&#29992;&#31243;&#24207;&#65292;&#21363;&#20272;&#35745;&#24341;&#29992;&#21644;&#24037;&#36164;&#20013;&#30340;&#24615;&#21035;&#24046;&#36317;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;DDML&#19982;stacking&#30456;&#27604;&#22522;&#20110;&#21333;&#20010;&#39044;&#36873;&#23398;&#20064;&#22120;&#30340;&#24120;&#35265;&#26367;&#20195;&#26041;&#27861;&#23545;&#20110;&#37096;&#20998;&#26410;&#30693;&#30340;&#20989;&#25968;&#24418;&#24335;&#26356;&#21152;&#40065;&#26834;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#23454;&#29616;&#25105;&#20204;&#26041;&#26696;&#30340;Stata&#21644;R&#36719;&#20214;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper discusses pairing double/debiased machine learning (DDML) with stacking, a model averaging method for combining multiple candidate learners, to estimate structural parameters. We introduce two new stacking approaches for DDML: short-stacking exploits the cross-fitting step of DDML to substantially reduce the computational burden and pooled stacking enforces common stacking weights over cross-fitting folds. Using calibrated simulation studies and two applications estimating gender gaps in citations and wages, we show that DDML with stacking is more robust to partially unknown functional forms than common alternative approaches based on single pre-selected learners. We provide Stata and R software implementing our proposals.
&lt;/p&gt;</description></item><item><title>&#36825;&#31687;&#35770;&#25991;&#30740;&#31350;&#20102;&#19968;&#20010;&#22996;&#25176;&#20154;&#36890;&#36807;&#38599;&#20323;&#20195;&#29702;&#20154;&#20197;&#21160;&#24577;&#26041;&#24335;&#33719;&#21462;&#20449;&#24687;&#30340;&#38382;&#39064;&#65292;&#22312;&#26465;&#20214;&#20801;&#35768;&#30340;&#24773;&#20917;&#19979;&#65292;&#22996;&#25176;&#20154;&#26080;&#27861;&#36890;&#36807;&#19968;&#27425;&#24615;&#25910;&#38598;&#25152;&#26377;&#20449;&#24687;&#20043;&#21518;&#20877;&#20174;&#20195;&#29702;&#20154;&#37027;&#37324;&#33719;&#21462;&#21333;&#20010;&#25253;&#21578;&#26469;&#33719;&#24471;&#26356;&#22909;&#30340;&#32467;&#26524;&#65292;&#24182;&#19988;&#22312;&#36739;&#24378;&#30340;&#26465;&#20214;&#36829;&#21453;&#19979;&#65292;&#38745;&#24577;&#21512;&#21516;&#26159;&#27425;&#20248;&#30340;&#12290;&#19982;&#27492;&#21516;&#26102;&#65292;&#35813;&#35770;&#25991;&#36824;&#23637;&#31034;&#20102;&#22312;&#21160;&#24577;&#29615;&#22659;&#20013;&#65292;&#21363;&#20351;&#20195;&#29702;&#20154;&#23545;&#29366;&#24577;&#39044;&#27979;&#38169;&#35823;&#65292;&#26368;&#20248;&#21512;&#21516;&#20063;&#21487;&#33021;&#20250;&#32473;&#20104;&#20195;&#29702;&#20154;&#20005;&#26684;&#27491;&#30340;&#22522;&#26412;&#22870;&#21169;&#12290;</title><link>http://arxiv.org/abs/2310.19147</link><description>&lt;p&gt;
&#21160;&#24577;&#20449;&#24687;&#33719;&#21462;&#30340;&#26368;&#20339;&#35780;&#20998;
&lt;/p&gt;
&lt;p&gt;
Optimal Scoring for Dynamic Information Acquisition. (arXiv:2310.19147v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.19147
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#30740;&#31350;&#20102;&#19968;&#20010;&#22996;&#25176;&#20154;&#36890;&#36807;&#38599;&#20323;&#20195;&#29702;&#20154;&#20197;&#21160;&#24577;&#26041;&#24335;&#33719;&#21462;&#20449;&#24687;&#30340;&#38382;&#39064;&#65292;&#22312;&#26465;&#20214;&#20801;&#35768;&#30340;&#24773;&#20917;&#19979;&#65292;&#22996;&#25176;&#20154;&#26080;&#27861;&#36890;&#36807;&#19968;&#27425;&#24615;&#25910;&#38598;&#25152;&#26377;&#20449;&#24687;&#20043;&#21518;&#20877;&#20174;&#20195;&#29702;&#20154;&#37027;&#37324;&#33719;&#21462;&#21333;&#20010;&#25253;&#21578;&#26469;&#33719;&#24471;&#26356;&#22909;&#30340;&#32467;&#26524;&#65292;&#24182;&#19988;&#22312;&#36739;&#24378;&#30340;&#26465;&#20214;&#36829;&#21453;&#19979;&#65292;&#38745;&#24577;&#21512;&#21516;&#26159;&#27425;&#20248;&#30340;&#12290;&#19982;&#27492;&#21516;&#26102;&#65292;&#35813;&#35770;&#25991;&#36824;&#23637;&#31034;&#20102;&#22312;&#21160;&#24577;&#29615;&#22659;&#20013;&#65292;&#21363;&#20351;&#20195;&#29702;&#20154;&#23545;&#29366;&#24577;&#39044;&#27979;&#38169;&#35823;&#65292;&#26368;&#20248;&#21512;&#21516;&#20063;&#21487;&#33021;&#20250;&#32473;&#20104;&#20195;&#29702;&#20154;&#20005;&#26684;&#27491;&#30340;&#22522;&#26412;&#22870;&#21169;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#19968;&#20010;&#22996;&#25176;&#20154;&#35797;&#22270;&#36890;&#36807;&#38599;&#20323;&#19968;&#20010;&#20195;&#29702;&#20154;&#26469;&#20351;&#29992;&#27850;&#26494;&#20449;&#24687;&#21040;&#36798;&#25216;&#26415;&#38543;&#30528;&#26102;&#38388;&#26469;&#33719;&#21462;&#20851;&#20110;&#20108;&#36827;&#21046;&#29366;&#24577;&#30340;&#20449;&#24687;&#12290;&#20195;&#29702;&#20154;&#20250;&#31169;&#19979;&#20102;&#35299;&#36825;&#20010;&#29366;&#24577;&#65292;&#32780;&#22996;&#25176;&#20154;&#26080;&#27861;&#35266;&#23519;&#21040;&#20195;&#29702;&#20154;&#30340;&#21162;&#21147;&#36873;&#25321;&#12290;&#22996;&#25176;&#20154;&#21487;&#20197;&#26681;&#25454;&#20195;&#29702;&#20154;&#30340;&#25253;&#21578;&#24207;&#21015;&#21644;&#23454;&#29616;&#30340;&#29366;&#24577;&#65292;&#20197;&#19968;&#20010;&#22266;&#23450;&#20215;&#20540;&#30340;&#22870;&#21697;&#26469;&#22870;&#21169;&#20195;&#29702;&#20154;&#12290;&#25105;&#20204;&#30830;&#23450;&#20102;&#19968;&#20123;&#26465;&#20214;&#65292;&#27599;&#20010;&#26465;&#20214;&#37117;&#30830;&#20445;&#22996;&#25176;&#20154;&#26080;&#27861;&#27604;&#22312;&#33719;&#21462;&#20102;&#25152;&#26377;&#20449;&#24687;&#21518;&#20174;&#20195;&#29702;&#20154;&#37027;&#37324;&#25552;&#21462;&#21333;&#20010;&#25253;&#21578;&#26356;&#22909;&#12290;&#25105;&#20204;&#36824;&#35777;&#26126;&#20102;&#22312;&#36825;&#20123;&#26465;&#20214;&#36275;&#22815;&#24378;&#28872;&#30340;&#36829;&#21453;&#19979;&#65292;&#36825;&#26679;&#30340;&#38745;&#24577;&#21512;&#21516;&#26159;&#27425;&#20248;&#30340;&#12290;&#25105;&#20204;&#23558;&#25105;&#20204;&#30340;&#35299;&#20915;&#26041;&#26696;&#19982;&#20195;&#29702;&#20154;&#19968;&#27425;&#24615;&#33719;&#21462;&#25152;&#26377;&#20449;&#24687;&#30340;&#24773;&#20917;&#36827;&#34892;&#23545;&#27604;&#65307;&#20540;&#24471;&#27880;&#24847;&#30340;&#26159;&#65292;&#22312;&#21160;&#24577;&#29615;&#22659;&#20013;&#65292;&#21363;&#20351;&#20195;&#29702;&#20154;&#23545;&#29366;&#24577;&#30340;&#39044;&#27979;&#26159;&#38169;&#35823;&#30340;&#65292;&#26368;&#20248;&#21512;&#21516;&#21487;&#33021;&#20250;&#21521;&#20195;&#29702;&#20154;&#25552;&#20379;&#20005;&#26684;&#27491;&#30340;&#22522;&#26412;&#22870;&#21169;&#12290;
&lt;/p&gt;
&lt;p&gt;
A principal seeks to learn about a binary state and can do so by enlisting an agent to acquire information over time using a Poisson information arrival technology. The agent learns about this state privately, and his effort choices are unobserved by the principal. The principal can reward the agent with a prize of fixed value as a function of the agent's sequence of reports and the realized state. We identify conditions that each individually ensure that the principal cannot do better than by eliciting a single report from the agent after all information has been acquired. We also show that such a static contract is suboptimal under sufficiently strong violations of these conditions. We contrast our solution to the case where the agent acquires information "all at once;" notably, the optimal contract in the dynamic environment may provide strictly positive base rewards to the agent even if his prediction about the state is incorrect.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#33268;&#21147;&#20110;&#23547;&#25214;&#31616;&#21333;&#30340;&#38144;&#21806;&#26426;&#21046;&#65292;&#20197;&#26377;&#25928;&#23545;&#20914;&#24066;&#22330;&#27169;&#31946;&#24615;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#21482;&#26377;&#26377;&#38480;&#25968;&#37327;&#30340;&#20215;&#26684;&#38543;&#26426;&#21270;&#30340;&#38144;&#21806;&#26426;&#21046;&#24050;&#32463;&#33021;&#22815;&#33719;&#24471;&#26080;&#38480;&#36873;&#39033;&#30340;&#26368;&#20248;&#31283;&#20581;&#26426;&#21046;&#25152;&#23454;&#29616;&#30340;&#26174;&#33879;&#25928;&#30410;&#12290;</title><link>http://arxiv.org/abs/2310.17392</link><description>&lt;p&gt;
&#31616;&#21333;&#33756;&#21333;&#22312;&#31283;&#20581;&#38144;&#21806;&#26426;&#21046;&#20013;&#30340;&#21147;&#37327;
&lt;/p&gt;
&lt;p&gt;
The Power of Simple Menus in Robust Selling Mechanisms. (arXiv:2310.17392v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.17392
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#33268;&#21147;&#20110;&#23547;&#25214;&#31616;&#21333;&#30340;&#38144;&#21806;&#26426;&#21046;&#65292;&#20197;&#26377;&#25928;&#23545;&#20914;&#24066;&#22330;&#27169;&#31946;&#24615;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#21482;&#26377;&#26377;&#38480;&#25968;&#37327;&#30340;&#20215;&#26684;&#38543;&#26426;&#21270;&#30340;&#38144;&#21806;&#26426;&#21046;&#24050;&#32463;&#33021;&#22815;&#33719;&#24471;&#26080;&#38480;&#36873;&#39033;&#30340;&#26368;&#20248;&#31283;&#20581;&#26426;&#21046;&#25152;&#23454;&#29616;&#30340;&#26174;&#33879;&#25928;&#30410;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#19968;&#20010;&#31283;&#20581;&#38144;&#21806;&#38382;&#39064;&#65292;&#20854;&#20013;&#21334;&#26041;&#35797;&#22270;&#23558;&#19968;&#20010;&#29289;&#21697;&#21334;&#32473;&#19968;&#20010;&#20080;&#26041;&#65292;&#20294;&#23545;&#20080;&#26041;&#30340;&#20272;&#20540;&#20998;&#24067;&#23384;&#22312;&#19981;&#30830;&#23450;&#24615;&#12290;&#29616;&#26377;&#25991;&#29486;&#34920;&#26126;&#65292;&#31283;&#20581;&#26426;&#21046;&#35774;&#35745;&#27604;&#31283;&#20581;&#30830;&#23450;&#24615;&#23450;&#20215;&#25552;&#20379;&#20102;&#26356;&#24378;&#30340;&#29702;&#35770;&#20445;&#35777;&#12290;&#21516;&#26102;&#65292;&#31283;&#20581;&#26426;&#21046;&#35774;&#35745;&#30340;&#21331;&#36234;&#24615;&#33021;&#20197;&#21334;&#26041;&#25552;&#20379;&#20855;&#26377;&#26080;&#38480;&#36873;&#39033;&#30340;&#33756;&#21333;&#65292;&#27599;&#20010;&#36873;&#39033;&#19982;&#25277;&#22870;&#21644;&#20080;&#26041;&#36873;&#25321;&#30340;&#20184;&#27454;&#26041;&#24335;&#30456;&#37197;&#12290;&#37492;&#20110;&#27492;&#65292;&#25105;&#20204;&#30340;&#30740;&#31350;&#30340;&#20027;&#35201;&#37325;&#28857;&#26159;&#23547;&#25214;&#21487;&#20197;&#26377;&#25928;&#23545;&#20914;&#24066;&#22330;&#27169;&#31946;&#24615;&#30340;&#31616;&#21333;&#38144;&#21806;&#26426;&#21046;&#12290;&#25105;&#20204;&#34920;&#26126;&#65292;&#19968;&#20010;&#20855;&#26377;&#23567;&#33756;&#21333;&#22823;&#23567;&#65288;&#25110;&#26377;&#38480;&#25968;&#37327;&#30340;&#20215;&#26684;&#38543;&#26426;&#21270;&#65289;&#30340;&#38144;&#21806;&#26426;&#21046;&#24050;&#32463;&#33021;&#22815;&#33719;&#24471;&#26080;&#38480;&#36873;&#39033;&#30340;&#26368;&#20248;&#31283;&#20581;&#26426;&#21046;&#25152;&#23454;&#29616;&#30340;&#26174;&#33879;&#25928;&#30410;&#12290;&#29305;&#21035;&#26159;&#65292;&#25105;&#20204;&#21457;&#23637;&#20102;&#19968;&#20010;&#36890;&#29992;&#26694;&#26550;&#26469;&#30740;&#31350;&#31283;&#20581;&#38144;&#21806;&#26426;&#21046;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study a robust selling problem where a seller attempts to sell one item to a buyer but is uncertain about the buyer's valuation distribution. Existing literature indicates that robust mechanism design provides a stronger theoretical guarantee than robust deterministic pricing. Meanwhile, the superior performance of robust mechanism design comes at the expense of implementation complexity given that the seller offers a menu with an infinite number of options, each coupled with a lottery and a payment for the buyer's selection. In view of this, the primary focus of our research is to find simple selling mechanisms that can effectively hedge against market ambiguity. We show that a selling mechanism with a small menu size (or limited randomization across a finite number of prices) is already capable of deriving significant benefits achieved by the optimal robust mechanism with infinite options. In particular, we develop a general framework to study the robust selling mechanism problem 
&lt;/p&gt;</description></item></channel></rss>