<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#35813;&#35770;&#25991;&#37319;&#29992;&#25919;&#31574;&#26641;&#35780;&#20272;&#22810;&#34892;&#21160;&#31574;&#30053;&#23398;&#20064;&#30340;&#30410;&#22788;&#65292;&#21033;&#29992;&#20010;&#24615;&#21270;&#27835;&#30103;&#20998;&#37197;&#30340;&#28508;&#21147;&#65292;&#22312;&#31227;&#27665;&#20837;&#31821;&#32972;&#26223;&#19979;&#23454;&#29616;&#26368;&#20248;&#27835;&#30103;&#25919;&#31574;&#30340;&#20998;&#37197;&#65292;&#25552;&#39640;&#31227;&#27665;&#20837;&#31821;&#29575;&#12290;</title><link>http://arxiv.org/abs/2305.00545</link><description>&lt;p&gt;
&#26368;&#20248;&#22810;&#34892;&#21160;&#27835;&#30103;&#20998;&#37197;&#65306;&#25552;&#39640;&#31227;&#27665;&#20837;&#31821;&#30340;&#21452;&#38454;&#27573;&#29616;&#22330;&#23454;&#39564;&#65288;arXiv&#65306;2305.00545v1 [econ.GN]&#65289;
&lt;/p&gt;
&lt;p&gt;
Optimal multi-action treatment allocation: A two-phase field experiment to boost immigrant naturalization. (arXiv:2305.00545v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.00545
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#37319;&#29992;&#25919;&#31574;&#26641;&#35780;&#20272;&#22810;&#34892;&#21160;&#31574;&#30053;&#23398;&#20064;&#30340;&#30410;&#22788;&#65292;&#21033;&#29992;&#20010;&#24615;&#21270;&#27835;&#30103;&#20998;&#37197;&#30340;&#28508;&#21147;&#65292;&#22312;&#31227;&#27665;&#20837;&#31821;&#32972;&#26223;&#19979;&#23454;&#29616;&#26368;&#20248;&#27835;&#30103;&#25919;&#31574;&#30340;&#20998;&#37197;&#65292;&#25552;&#39640;&#31227;&#27665;&#20837;&#31821;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#20844;&#20849;&#32463;&#27982;&#23398;&#20013;&#65292;&#20998;&#37197;&#26368;&#20248;&#27835;&#30103;&#25919;&#31574;&#30340;&#25361;&#25112;&#26159;&#26080;&#22788;&#19981;&#22312;&#30340;&#12290;&#23613;&#31649;&#22312;&#22788;&#29702;&#25928;&#24212;&#24322;&#36136;&#24615;&#30340;&#22240;&#26524;&#25928;&#24212;&#20272;&#35745;&#26041;&#38754;&#26377;&#24191;&#27867;&#30340;&#23454;&#35777;&#25991;&#29486;&#65292;&#20294;&#20010;&#24615;&#21270;&#27835;&#30103;&#20998;&#37197;&#30340;&#28508;&#21147;&#23578;&#26410;&#24471;&#21040;&#20805;&#20998;&#21033;&#29992;&#65292;&#23613;&#31649;&#25919;&#31574;&#23398;&#20064;&#39046;&#22495;&#26368;&#36817;&#21462;&#24471;&#20102;&#36827;&#23637;&#12290;&#25105;&#20204;&#22312;&#31227;&#27665;&#20837;&#31821;&#32972;&#26223;&#19979;&#20351;&#29992;&#25919;&#31574;&#26641;&#35780;&#20272;&#22810;&#34892;&#21160;&#31574;&#30053;&#23398;&#20064;&#30340;&#30410;&#22788;&#12290;&#25105;&#20204;&#20351;&#29992;&#23450;&#21046;&#30340;&#21452;&#38454;&#27573;&#38543;&#26426;&#23454;&#39564;&#26469;&#20272;&#35745;&#24182;&#23454;&#26045;&#19968;&#20010;&#20449;&#24687;&#23459;&#20256;&#25919;&#31574;&#35268;&#21017;&#65292;&#40723;&#21169;&#33487;&#40654;&#19990;&#24066;&#31526;&#21512;&#26465;&#20214;&#30340;&#31227;&#27665;&#30003;&#35831;&#29790;&#22763;&#20844;&#27665;&#36523;&#20221;&#12290;&#25919;&#31574;&#35268;&#21017;&#37319;&#29992;&#20915;&#31574;&#26641;&#30340;&#24418;&#24335;&#65292;&#26681;&#25454;&#38142;&#25509;&#30340;&#34892;&#25919;&#25968;&#25454;&#20013;&#30340;&#20010;&#20154;&#29305;&#24449;&#20998;&#37197;&#27835;&#30103;&#12290;&#22312;&#25506;&#32034;&#38454;&#27573;&#65292;&#25105;&#20204;&#23558;5,145&#21517;&#20855;&#26377;&#36164;&#26684;&#30340;&#20837;&#31821;&#31227;&#27665;&#26679;&#26412;&#30340;60&#65285;&#38543;&#26426;&#20998;&#37197;&#32473;&#19977;&#23553;&#19981;&#21516;&#20449;&#20214;&#20043;&#19968;&#12290;
&lt;/p&gt;
&lt;p&gt;
The challenge of assigning optimal treatment policies is ubiquitous in public economics. While a vast empirical literature is concerned with the estimation of causal effects under treatment effect heterogeneity, the potentials of individualized treatment assignments are under-explored, despite recent advances in the field of policy learning. We evaluate the benefits of multi-action policy learning using policy trees in the context of immigration naturalization. We use a tailored two-phase randomized field experiment to estimate and field a policy rule for an information campaign encouraging eligible immigrants in the City of Z\"urich to apply for Swiss citizenship. The policy rule takes the form of a decision tree assigning treatments based on individual-level characteristics drawn from linked administrative data. In the exploration phase, we randomly allocate 60% of our sample of 5,145 citizenship-eligible immigrants to receive one of three different letters addressing specific natura
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#36890;&#29992;&#22343;&#34913;&#27169;&#22411;&#20197;&#35299;&#20915;&#22810;&#20056;&#23458;&#25340;&#36710;&#31995;&#32479;&#30340;&#38382;&#39064;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#20010;&#24207;&#21015;-&#26641;&#31639;&#27861;&#29992;&#20110;&#27714;&#35299;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2303.16595</link><description>&lt;p&gt;
&#24102;&#31283;&#23450;&#21305;&#37197;&#30340;&#22810;&#20056;&#23458;&#25340;&#36710;&#31995;&#32479;&#30340;&#19968;&#33324;&#22343;&#34913;&#27169;&#22411;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
A general equilibrium model for multi-passenger ridesharing systems with stable matching. (arXiv:2303.16595v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.16595
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#36890;&#29992;&#22343;&#34913;&#27169;&#22411;&#20197;&#35299;&#20915;&#22810;&#20056;&#23458;&#25340;&#36710;&#31995;&#32479;&#30340;&#38382;&#39064;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#20010;&#24207;&#21015;-&#26641;&#31639;&#27861;&#29992;&#20110;&#27714;&#35299;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#36890;&#29992;&#22343;&#34913;&#27169;&#22411;&#65292;&#29992;&#20110;&#25429;&#25417;&#22810;&#20056;&#23458;&#25340;&#36710;&#31995;&#32479;&#20013;&#20056;&#23458;&#12289;&#21496;&#26426;&#12289;&#24179;&#21488;&#21644;&#20132;&#36890;&#32593;&#32476;&#20043;&#38388;&#30340;&#20869;&#29983;&#24615;&#20114;&#21160;&#12290;&#31283;&#23450;&#21305;&#37197;&#34987;&#24314;&#27169;&#20026;&#19968;&#20010;&#22343;&#34913;&#38382;&#39064;&#65292;&#20854;&#20013;&#27809;&#26377;&#25340;&#36710;&#21496;&#26426;&#25110;&#20056;&#23458;&#33021;&#22815;&#36890;&#36807;&#21333;&#26041;&#38754;&#20999;&#25442;&#21478;&#19968;&#20010;&#21305;&#37197;&#24207;&#21015;&#26469;&#38477;&#20302;&#25340;&#36710;&#30340;&#19981;&#28385;&#24847;&#31243;&#24230;&#12290;&#26412;&#25991;&#26159;&#39318;&#25209;&#23558;&#25340;&#36710;&#24179;&#21488;&#22810;&#20056;&#23458;&#21305;&#37197;&#38382;&#39064;&#26126;&#30830;&#34701;&#20837;&#27169;&#22411;&#30340;&#30740;&#31350;&#20043;&#19968;&#12290;&#36890;&#36807;&#23558;&#21305;&#37197;&#24207;&#21015;&#19982;&#36229;&#32593;&#32476;&#30456;&#32467;&#21512;&#65292;&#36991;&#20813;&#20102;&#22810;&#20056;&#23458;&#25340;&#36710;&#31995;&#32479;&#20013;&#30340;&#25340;&#36710;-&#20056;&#23458;&#36716;&#31227;&#12290;&#27492;&#22806;&#65292;&#26412;&#35770;&#25991;&#23558;&#25340;&#36710;&#21496;&#26426;&#21644;&#20056;&#23458;&#20043;&#38388;&#30340;&#21305;&#37197;&#31283;&#23450;&#24615;&#25193;&#23637;&#21040;&#20197;&#21305;&#37197;&#24207;&#21015;&#20026;&#22522;&#30784;&#30340;&#22810;OD&#22810;&#20056;&#23458;&#24773;&#20917;&#12290;&#26412;&#25991;&#25552;&#20379;&#20102;&#25152;&#25552;&#20986;&#19968;&#33324;&#22343;&#34913;&#27169;&#22411;&#30340;&#23384;&#22312;&#24615;&#35777;&#26126;&#12290;&#38024;&#23545;&#27714;&#35299;&#22810;&#20056;&#23458;&#25340;&#36710;&#38382;&#39064;&#65292;&#36824;&#25552;&#20986;&#20102;&#19968;&#20010;&#24207;&#21015;-&#26641;&#31639;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper proposes a general equilibrium model for multi-passenger ridesharing systems, in which interactions between ridesharing drivers, passengers, platforms, and transportation networks are endogenously captured. Stable matching is modeled as an equilibrium problem in which no ridesharing driver or passenger can reduce ridesharing disutility by unilaterally switching to another matching sequence. This paper is one of the first studies that explicitly integrates the ridesharing platform multi-passenger matching problem into the model. By integrating matching sequence with hyper-network, ridesharing-passenger transfers are avoided in a multi-passenger ridesharing system. Moreover, the matching stability between the ridesharing drivers and passengers is extended to address the multi-OD multi-passenger case in terms of matching sequence. The paper provides a proof for the existence of the proposed general equilibrium. A sequence-bush algorithm is developed for solving the multi-passen
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#20225;&#19994;&#32929;&#19996;&#25511;&#21046;&#26435;&#30340;&#20135;&#29983;&#26426;&#21046;&#65292;&#21457;&#29616;&#26368;&#39640;1&#21495;&#32929;&#19996;&#25317;&#26377;&#26368;&#20248;&#25511;&#21046;&#26435;&#30340;&#27010;&#29575;&#25353;&#26000;&#27874;&#37027;&#22865;&#25968;&#21015;&#30340;&#27169;&#24335;&#38543;&#26102;&#38388;&#28436;&#21464;&#65292;&#22312;12&#23567;&#26102;&#30340;&#26102;&#38388;&#21608;&#26399;&#20869;&#28014;&#21160;&#22312;1/2&#33267;2/3&#20043;&#38388;&#65292;&#30456;&#20851;&#25968;&#25454;&#25903;&#25345;&#20102;&#39044;&#27979;&#12290;</title><link>http://arxiv.org/abs/2106.01681</link><description>&lt;p&gt;
&#12298;&#20225;&#19994;&#25511;&#21046;&#26435;&#30340;&#36215;&#28304;&#12299;
&lt;/p&gt;
&lt;p&gt;
The Origin of Corporate Control Power. (arXiv:2106.01681v10 [econ.TH] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2106.01681
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#20225;&#19994;&#32929;&#19996;&#25511;&#21046;&#26435;&#30340;&#20135;&#29983;&#26426;&#21046;&#65292;&#21457;&#29616;&#26368;&#39640;1&#21495;&#32929;&#19996;&#25317;&#26377;&#26368;&#20248;&#25511;&#21046;&#26435;&#30340;&#27010;&#29575;&#25353;&#26000;&#27874;&#37027;&#22865;&#25968;&#21015;&#30340;&#27169;&#24335;&#38543;&#26102;&#38388;&#28436;&#21464;&#65292;&#22312;12&#23567;&#26102;&#30340;&#26102;&#38388;&#21608;&#26399;&#20869;&#28014;&#21160;&#22312;1/2&#33267;2/3&#20043;&#38388;&#65292;&#30456;&#20851;&#25968;&#25454;&#25903;&#25345;&#20102;&#39044;&#27979;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20225;&#19994;&#32929;&#19996;&#30340;&#25511;&#21046;&#26435;&#26159;&#22914;&#20309;&#20135;&#29983;&#30340;&#65311;&#22522;&#20110;&#32463;&#27982;&#23398;&#30340;&#22522;&#26412;&#21407;&#29702;&#65292;&#25105;&#20204;&#21457;&#29616;&#26368;&#39640;1&#21495;&#32929;&#19996;&#25317;&#26377;&#26368;&#20248;&#25511;&#21046;&#26435;&#30340;&#27010;&#29575;&#26159;&#20197;&#26000;&#27874;&#37027;&#22865;&#25968;&#21015;&#27169;&#24335;&#28436;&#21464;&#30340;&#65292;&#24182;&#22312;&#27599;12&#23567;&#26102;&#30340;&#26102;&#38388;&#21608;&#26399;&#20869;&#28014;&#21160;&#22312;1/2&#33267;2/3&#20043;&#38388;&#12290;&#36825;&#19968;&#26032;&#39062;&#29305;&#28857;&#34920;&#26126;&#20102;&#20225;&#19994;&#32929;&#19996;&#26435;&#21033;&#21644;&#26435;&#21147;&#20998;&#37197;&#30340;&#25928;&#29575;&#12290;&#20013;&#22269;&#32929;&#24066;&#30340;&#25968;&#25454;&#25903;&#25345;&#20102;&#36825;&#19968;&#39044;&#27979;&#12290;
&lt;/p&gt;
&lt;p&gt;
How does the control power of corporate shareholder arise? On the fundamental principles of economics, we discover that the probability of top1 shareholder possessing optimal control power evolves in Fibonacci series pattern and emerges as the wave between 1/2 and 2/3 along with time in period of 12h (h is the time distance between the state and state of the evolution). This novel feature suggests the efficiency of the allocation of corporate shareholders' right and power. Data on the Chinese stock market support this prediction.
&lt;/p&gt;</description></item></channel></rss>