<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#32447;&#24615;&#35268;&#21010;&#22312;&#36190;&#21161;&#21015;&#34920;&#25490;&#21517;&#20013;&#30340;&#24212;&#29992;&#20026;&#35299;&#20915;&#22312;&#32447;&#24066;&#22330;&#20013;&#30340;&#25490;&#21517;&#25361;&#25112;&#25552;&#20379;&#20102;&#26377;&#21147;&#24037;&#20855;</title><link>https://arxiv.org/abs/2403.14862</link><description>&lt;p&gt;
&#32447;&#24615;&#35268;&#21010;&#22312;&#36190;&#21161;&#21015;&#34920;&#25490;&#21517;&#20013;&#30340;&#23041;&#21147;&#65306;&#26469;&#33258;&#29616;&#22330;&#23454;&#39564;&#30340;&#35777;&#25454;
&lt;/p&gt;
&lt;p&gt;
The Power of Linear Programming in Sponsored Listings Ranking: Evidence from Field Experiments
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.14862
&lt;/p&gt;
&lt;p&gt;
&#32447;&#24615;&#35268;&#21010;&#22312;&#36190;&#21161;&#21015;&#34920;&#25490;&#21517;&#20013;&#30340;&#24212;&#29992;&#20026;&#35299;&#20915;&#22312;&#32447;&#24066;&#22330;&#20013;&#30340;&#25490;&#21517;&#25361;&#25112;&#25552;&#20379;&#20102;&#26377;&#21147;&#24037;&#20855;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36190;&#21161;&#21015;&#34920;&#26159;&#35768;&#22810;&#30693;&#21517;&#22312;&#32447;&#24066;&#22330;&#30340;&#20027;&#35201;&#25910;&#20837;&#26469;&#28304;&#20043;&#19968;&#65292;&#22914;&#20122;&#39532;&#36874;&#12289;&#27779;&#23572;&#29595;&#21644;&#38463;&#37324;&#24052;&#24052;&#12290;&#22312;&#32447;&#24066;&#22330;&#21487;&#33021;&#22312;&#23637;&#31034;&#29305;&#23450;&#21830;&#21697;&#30340;&#32593;&#39029;&#19978;&#38500;&#20102;&#35813;&#21830;&#21697;&#22806;&#65292;&#36824;&#20250;&#23637;&#31034;&#26469;&#33258;&#21508;&#31181;&#31532;&#19977;&#26041;&#21334;&#23478;&#30340;&#36190;&#21161;&#21830;&#21697;&#30340;&#25490;&#21517;&#21015;&#34920;&#12290;&#38024;&#23545;&#27599;&#27425;&#35775;&#38382;&#30830;&#23450;&#22914;&#20309;&#23545;&#36825;&#20123;&#36190;&#21161;&#21830;&#21697;&#36827;&#34892;&#25490;&#21517;&#26159;&#22312;&#32447;&#24066;&#22330;&#30340;&#19968;&#20010;&#20851;&#38190;&#25361;&#25112;&#65292;&#36825;&#20010;&#38382;&#39064;&#34987;&#31216;&#20026;&#36190;&#21161;&#21015;&#34920;&#25490;&#21517;&#65288;SLR&#65289;&#12290;SLR&#30340;&#20027;&#35201;&#22256;&#38590;&#22312;&#20110;&#24179;&#34913;&#26368;&#22823;&#21270;&#25972;&#20307;&#25910;&#20837;&#21644;&#25512;&#33616;&#39640;&#36136;&#37327;&#21644;&#30456;&#20851;&#25490;&#21517;&#21015;&#34920;&#20043;&#38388;&#30340;&#26435;&#34913;&#12290;&#34429;&#28982;&#26356;&#30456;&#20851;&#30340;&#25490;&#21517;&#21487;&#33021;&#23548;&#33268;&#26356;&#22810;&#30340;&#36141;&#20080;&#21644;&#28040;&#36153;&#32773;&#21442;&#19982;&#65292;&#20294;&#24066;&#22330;&#22312;&#21046;&#23450;&#25490;&#21517;&#20915;&#31574;&#26102;&#36824;&#38656;&#35201;&#32771;&#34385;&#28508;&#22312;&#25910;&#20837;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.14862v1 Announce Type: new  Abstract: Sponsored listing is one of the major revenue sources for many prominent online marketplaces, such as Amazon, Walmart, and Alibaba. When consumers visit a marketplace's webpage for a specific item, in addition to that item, the marketplace might also display a ranked listing of sponsored items from various third-party sellers. These sellers are charged an advertisement fee if a user purchases any of the sponsored items from this listing. Determining how to rank these sponsored items for each incoming visit is a crucial challenge for online marketplaces, a problem known as sponsored listings ranking (SLR). The major difficulty of SLR lies in balancing the trade-off between maximizing the overall revenue and recommending high-quality and relevant ranked listings. While a more relevant ranking may result in more purchases and consumer engagement, the marketplace also needs to take account of the potential revenue when making ranking decisio
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#38024;&#23545;&#20855;&#26377;&#21452;&#21521;&#22266;&#23450;&#25928;&#24212;&#30340;&#21160;&#24577;&#38750;&#32447;&#24615;&#27169;&#22411;&#30340;&#20998;&#26512;&#20559;&#24046;&#26657;&#27491;&#26041;&#27861;&#65292;&#36890;&#36807;&#26657;&#27491;&#21518;&#30340;&#20284;&#28982;&#20989;&#25968;&#24471;&#20986;&#30340;&#26816;&#39564;&#32479;&#35745;&#37327;&#21487;&#20197;&#24471;&#21040;&#26631;&#20934;&#28176;&#36817;&#20998;&#24067;&#65292;&#21516;&#26102;&#20063;&#21487;&#20197;&#24471;&#21040;&#32467;&#26500;&#21442;&#25968;&#30340;&#20559;&#24046;&#26657;&#27491;&#20272;&#35745;&#22120;&#12290;</title><link>http://arxiv.org/abs/2305.03134</link><description>&lt;p&gt;
&#20855;&#26377;&#21452;&#21521;&#22266;&#23450;&#25928;&#24212;&#30340;&#21160;&#24577;&#38750;&#32447;&#24615;&#27169;&#22411;&#30340;&#26080;&#20559;&#25512;&#26029;
&lt;/p&gt;
&lt;p&gt;
Debiased inference for dynamic nonlinear models with two-way fixed effects. (arXiv:2305.03134v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.03134
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#38024;&#23545;&#20855;&#26377;&#21452;&#21521;&#22266;&#23450;&#25928;&#24212;&#30340;&#21160;&#24577;&#38750;&#32447;&#24615;&#27169;&#22411;&#30340;&#20998;&#26512;&#20559;&#24046;&#26657;&#27491;&#26041;&#27861;&#65292;&#36890;&#36807;&#26657;&#27491;&#21518;&#30340;&#20284;&#28982;&#20989;&#25968;&#24471;&#20986;&#30340;&#26816;&#39564;&#32479;&#35745;&#37327;&#21487;&#20197;&#24471;&#21040;&#26631;&#20934;&#28176;&#36817;&#20998;&#24067;&#65292;&#21516;&#26102;&#20063;&#21487;&#20197;&#24471;&#21040;&#32467;&#26500;&#21442;&#25968;&#30340;&#20559;&#24046;&#26657;&#27491;&#20272;&#35745;&#22120;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38754;&#26495;&#25968;&#25454;&#27169;&#22411;&#36890;&#24120;&#20351;&#29992;&#22266;&#23450;&#25928;&#24212;&#26469;&#35299;&#37322;&#26410;&#35266;&#27979;&#21040;&#30340;&#24322;&#36136;&#24615;&#12290;&#36825;&#20123;&#22266;&#23450;&#25928;&#24212;&#36890;&#24120;&#26159;&#20598;&#28982;&#21442;&#25968;&#65292;&#23427;&#20204;&#30340;&#20272;&#35745;&#22120;&#30456;&#23545;&#20110;&#26679;&#26412;&#22823;&#23567;&#30340;&#24179;&#26041;&#26681;&#25910;&#25947;&#32531;&#24930;&#12290;&#22312;&#26368;&#22823;&#20284;&#28982;&#30340;&#19978;&#19979;&#25991;&#20013;&#65292;&#36825;&#20250;&#23548;&#33268;&#20284;&#28982;&#20989;&#25968;&#30340;&#28176;&#36817;&#20559;&#24046;&#12290;&#22240;&#27492;&#65292;&#20174;&#28176;&#36817;&#26377;&#20559;&#30340;&#20284;&#28982;&#20989;&#25968;&#24471;&#20986;&#30340;&#26816;&#39564;&#32479;&#35745;&#37327;&#19981;&#20877;&#36981;&#24490;&#20854;&#26631;&#20934;&#26497;&#38480;&#20998;&#24067;&#12290;&#36825;&#20250;&#23548;&#33268;&#26816;&#39564;&#22823;&#23567;&#30340;&#20005;&#37325;&#20559;&#24046;&#12290;&#25105;&#20204;&#32771;&#34385;&#19968;&#31867;&#20855;&#26377;&#21452;&#21521;&#22266;&#23450;&#25928;&#24212;&#30340;&#21160;&#24577;&#38750;&#32447;&#24615;&#27169;&#22411;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#20284;&#28982;&#20989;&#25968;&#30340;&#20998;&#26512;&#20559;&#24046;&#26657;&#27491;&#26041;&#27861;&#12290;&#25105;&#20204;&#27491;&#24335;&#35777;&#26126;&#20102;&#20174;&#26657;&#27491;&#21518;&#30340;&#20284;&#28982;&#20989;&#25968;&#24471;&#20986;&#30340;&#20284;&#28982;&#27604;&#12289;&#25289;&#26684;&#26391;&#26085;&#20056;&#25968;&#12289;&#21644; Wald &#26816;&#39564;&#32479;&#35745;&#37327;&#36981;&#24490;&#23427;&#20204;&#30340;&#26631;&#20934;&#28176;&#36817;&#20998;&#24067;&#12290;&#20316;&#20026;&#21103;&#20135;&#21697;&#65292;&#26657;&#27491;&#21518;&#30340;&#20284;&#28982;&#20989;&#25968;&#36824;&#21487;&#20197;&#24471;&#20986;&#32467;&#26500;&#21442;&#25968;&#30340;&#20559;&#24046;&#26657;&#27491;&#20272;&#35745;&#22120;&#12290;&#25105;&#20204;&#35780;&#20272;&#20102;&#35813;&#26041;&#27861;&#22312; Monte Carlo &#27169;&#25311;&#20013;&#30340;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;
Panel data models often use fixed effects to account for unobserved heterogeneities. These fixed effects are typically incidental parameters and their estimators converge slowly relative to the square root of the sample size. In the maximum likelihood context, this induces an asymptotic bias of the likelihood function. Test statistics derived from the asymptotically biased likelihood, therefore, no longer follow their standard limiting distributions. This causes severe distortions in test sizes. We consider a generic class of dynamic nonlinear models with two-way fixed effects and propose an analytical bias correction method for the likelihood function. We formally show that the likelihood ratio, the Lagrange-multiplier, and the Wald test statistics derived from the corrected likelihood follow their standard asymptotic distributions. As a by-product, a bias-corrected estimator of the structural parameter can also be derived from the corrected likelihood function. We evaluate the perfor
&lt;/p&gt;</description></item></channel></rss>