<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#20248;&#20808;&#20013;&#31435;&#21305;&#37197;&#26684;&#30340;&#30740;&#31350;&#34920;&#26126;&#20854;&#19981;&#20855;&#26377;&#20998;&#37197;&#24615;&#36136;&#65292;&#19982;&#31283;&#23450;&#21305;&#37197;&#26684;&#19981;&#21516;&#65292;&#23545;&#20110;&#23398;&#29983;&#19981;&#19968;&#23450;&#26159;&#24085;&#32047;&#25176;&#26368;&#20248;&#12290;</title><link>https://arxiv.org/abs/2404.02142</link><description>&lt;p&gt;
&#20248;&#20808;&#20013;&#31435;&#21305;&#37197;&#26684;&#19981;&#26159;&#20998;&#37197;&#30340;
&lt;/p&gt;
&lt;p&gt;
Priority-Neutral Matching Lattices Are Not Distributive
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2404.02142
&lt;/p&gt;
&lt;p&gt;
&#20248;&#20808;&#20013;&#31435;&#21305;&#37197;&#26684;&#30340;&#30740;&#31350;&#34920;&#26126;&#20854;&#19981;&#20855;&#26377;&#20998;&#37197;&#24615;&#36136;&#65292;&#19982;&#31283;&#23450;&#21305;&#37197;&#26684;&#19981;&#21516;&#65292;&#23545;&#20110;&#23398;&#29983;&#19981;&#19968;&#23450;&#26159;&#24085;&#32047;&#25176;&#26368;&#20248;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#31283;&#23450;&#21305;&#37197;&#26159;&#24066;&#22330;&#35774;&#35745;&#30340;&#22522;&#30707;&#65292;&#20855;&#26377;&#20016;&#23500;&#30340;&#29702;&#35770;&#32467;&#26500;&#25903;&#25345;&#20247;&#22810;&#23454;&#38469;&#37096;&#32626;&#12290;&#28982;&#32780;&#65292;&#22312;&#23398;&#26657;&#36873;&#25321;&#38382;&#39064;&#20013;&#65292;&#31283;&#23450;&#21305;&#37197;&#23545;&#23398;&#29983;&#24182;&#19981;&#26159;&#24085;&#32047;&#25176;&#26368;&#20248;&#12290;&#30001;Reny&#65288;&#32463;&#27982;&#23398;&#24180;&#25253;&#65292;2022&#24180;&#65289;&#24341;&#20837;&#30340;&#20248;&#20808;&#20013;&#31435;&#21305;&#37197;&#25193;&#23637;&#20102;&#31283;&#23450;&#21305;&#37197;&#38598;&#21512;&#65292;&#20801;&#35768;&#26576;&#20123;&#20248;&#20808;&#32423;&#36829;&#35268;&#65292;&#19988;&#24635;&#26377;&#19968;&#20010;&#24085;&#32047;&#25176;&#26368;&#20248;&#20248;&#20808;&#20013;&#31435;&#21305;&#37197;&#12290;&#27492;&#22806;&#65292;&#31867;&#20284;&#20110;&#31283;&#23450;&#21305;&#37197;&#65292;&#20248;&#20808;&#20013;&#31435;&#21305;&#37197;&#24418;&#25104;&#19968;&#20010;&#26684;&#12290;&#25105;&#20204;&#30740;&#31350;&#20102;&#20248;&#20808;&#20013;&#31435;&#26684;&#30340;&#32467;&#26500;&#12290;&#19981;&#24184;&#30340;&#26159;&#65292;&#25105;&#20204;&#34920;&#26126;&#20248;&#20808;&#20013;&#31435;&#26684;&#30340;&#31616;&#21333;&#24615;&#22312;&#24456;&#22823;&#31243;&#24230;&#19978;&#19981;&#36866;&#29992;&#20110;&#31283;&#23450;&#21305;&#37197;&#26684;&#12290;&#29305;&#21035;&#22320;&#65292;&#25105;&#20204;&#34920;&#26126;&#20248;&#20808;&#20013;&#31435;&#26684;&#19981;&#19968;&#23450;&#26159;&#20998;&#37197;&#30340;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#34920;&#26126;&#20248;&#20808;&#20013;&#31435;&#26684;&#20013;&#20004;&#20010;&#21305;&#37197;&#30340;&#26368;&#22823;&#19979;&#30028;&#19981;&#19968;&#23450;&#26159;&#23427;&#20204;&#30340;&#23398;&#29983;&#26368;&#23567;&#20540;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2404.02142v1 Announce Type: new  Abstract: Stable matchings are a cornerstone of market design, with numerous practical deployments backed by a rich, theoretically-tractable structure. However, in school-choice problems, stable matchings are not Pareto optimal for the students. Priority-neutral matchings, introduced by Reny (AER, 2022), generalizes the set of stable matchings by allowing for certain priority violations, and there is always a Pareto optimal priority-neutral matching. Moreover, like stable matchings, the set of priority-neutral matchings forms a lattice.   We study the structure of the priority-neutral lattice. Unfortunately, we show that much of the simplicity of the stable matching lattice does not hold for the priority-neutral lattice. In particular, we show that the priority-neutral lattice need not be distributive. Moreover, we show that the greatest lower bound of two matchings in the priority-neutral lattice need not be their student-by-student minimum, answ
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#29983;&#25104;&#20154;&#24037;&#26234;&#33021;&#23545;&#21019;&#24847;&#20135;&#19994;&#24102;&#26469;&#30340;&#29256;&#26435;&#38382;&#39064;&#65292;&#25506;&#35752;&#20102;&#20844;&#24179;&#20351;&#29992;&#26631;&#20934;&#21644;AI-&#29256;&#26435;&#24615;&#23545;AI&#21457;&#23637;&#21644;&#20844;&#21496;&#21033;&#28070;&#30340;&#24433;&#21709;</title><link>https://arxiv.org/abs/2402.17801</link><description>&lt;p&gt;
&#29983;&#25104;&#20154;&#24037;&#26234;&#33021;&#19982;&#29256;&#26435;&#65306;&#19968;&#20010;&#21160;&#24577;&#35270;&#35282;
&lt;/p&gt;
&lt;p&gt;
Generative AI and Copyright: A Dynamic Perspective
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.17801
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#29983;&#25104;&#20154;&#24037;&#26234;&#33021;&#23545;&#21019;&#24847;&#20135;&#19994;&#24102;&#26469;&#30340;&#29256;&#26435;&#38382;&#39064;&#65292;&#25506;&#35752;&#20102;&#20844;&#24179;&#20351;&#29992;&#26631;&#20934;&#21644;AI-&#29256;&#26435;&#24615;&#23545;AI&#21457;&#23637;&#21644;&#20844;&#21496;&#21033;&#28070;&#30340;&#24433;&#21709;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#29983;&#25104;&#20154;&#24037;&#26234;&#33021;&#30340;&#24555;&#36895;&#21457;&#23637;&#21363;&#23558;&#39072;&#35206;&#21019;&#24847;&#20135;&#19994;&#12290;&#22312;&#23545;&#36825;&#39033;&#26032;&#25216;&#26415;&#30340;&#24040;&#22823;&#20852;&#22859;&#20013;&#65292;&#20854;&#22312;&#21019;&#24847;&#20135;&#19994;&#20013;&#30340;&#26410;&#26469;&#21457;&#23637;&#21644;&#24212;&#29992;&#33267;&#20851;&#37325;&#35201;&#30340;&#20004;&#20010;&#29256;&#26435;&#38382;&#39064;&#26159;&#65306;1) &#34917;&#20607;&#37027;&#20123;&#29992;&#20110;&#35757;&#32451;&#29983;&#25104;&#20154;&#24037;&#26234;&#33021;&#27169;&#22411;&#30340;&#21019;&#20316;&#32773;&#65288;&#20844;&#24179;&#20351;&#29992;&#26631;&#20934;&#65289;&#65307;&#21644;2) AI&#29983;&#25104;&#30340;&#20869;&#23481;&#26159;&#21542;&#26377;&#36164;&#26684;&#33719;&#24471;&#29256;&#26435;&#20445;&#25252;&#65288;AI-&#29256;&#26435;&#24615;&#65289;&#12290;&#34429;&#28982;&#36825;&#20004;&#20010;&#38382;&#39064;&#24341;&#21457;&#20102;&#23398;&#26415;&#30028;&#21644;&#23454;&#36341;&#32773;&#20043;&#38388;&#28608;&#28872;&#30340;&#20105;&#35770;&#65292;&#20294;&#22823;&#22810;&#25968;&#20998;&#26512;&#37117;&#38598;&#20013;&#22312;&#23427;&#20204;&#23545;&#29616;&#26377;&#29256;&#26435;&#21407;&#21017;&#25152;&#24102;&#26469;&#30340;&#25361;&#25112;&#19978;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#26088;&#22312;&#26356;&#22909;&#22320;&#29702;&#35299;&#36825;&#20004;&#20010;&#30417;&#31649;&#38382;&#39064;&#21450;&#20854;&#20114;&#21160;&#23545;&#32463;&#27982;&#30340;&#24433;&#21709;&#12290;&#36890;&#36807;&#24314;&#31435;&#19968;&#20010;&#20855;&#26377;&#20869;&#29983;&#20869;&#23481;&#21019;&#20316;&#21644;AI&#27169;&#22411;&#21457;&#23637;&#30340;&#21160;&#24577;&#27169;&#22411;&#65292;&#25105;&#20204;&#25581;&#31034;&#20102;&#20844;&#24179;&#20351;&#29992;&#26631;&#20934;&#21644;AI-&#29256;&#26435;&#24615;&#23545;AI&#21457;&#23637;&#12289;AI&#20844;&#21496;&#21033;&#28070;&#12289;cr&#30340;&#24433;&#21709;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.17801v1 Announce Type: cross  Abstract: The rapid advancement of generative AI is poised to disrupt the creative industry. Amidst the immense excitement for this new technology, its future development and applications in the creative industry hinge crucially upon two copyright issues: 1) the compensation to creators whose content has been used to train generative AI models (the fair use standard); and 2) the eligibility of AI-generated content for copyright protection (AI-copyrightability). While both issues have ignited heated debates among academics and practitioners, most analysis has focused on their challenges posed to existing copyright doctrines. In this paper, we aim to better understand the economic implications of these two regulatory issues and their interactions. By constructing a dynamic model with endogenous content creation and AI model development, we unravel the impacts of the fair use standard and AI-copyrightability on AI development, AI company profit, cr
&lt;/p&gt;</description></item></channel></rss>