<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#36890;&#36807;&#26368;&#20248;&#36816;&#36755;&#29702;&#35770;&#65292;&#30740;&#31350;&#20102;&#20855;&#26377;&#19968;&#33268;&#20559;&#22909;&#30340;&#21305;&#37197;&#24066;&#22330;&#30340;&#31283;&#23450;&#24615;&#12289;&#25928;&#29575;&#21644;&#20844;&#24179;&#31561;&#35774;&#35745;&#30446;&#26631;&#65292;&#25581;&#31034;&#20102;&#21305;&#37197;&#32467;&#26500;&#29305;&#24615;&#21644;&#19981;&#21516;&#30446;&#26631;&#20043;&#38388;&#30340;&#26435;&#34913;&#20851;&#31995;&#12290;</title><link>https://arxiv.org/abs/2402.13378</link><description>&lt;p&gt;
&#31283;&#23450;&#21305;&#37197;&#20316;&#20026;&#36816;&#36755;&#38382;&#39064;
&lt;/p&gt;
&lt;p&gt;
Stable matching as transportation
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.13378
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#26368;&#20248;&#36816;&#36755;&#29702;&#35770;&#65292;&#30740;&#31350;&#20102;&#20855;&#26377;&#19968;&#33268;&#20559;&#22909;&#30340;&#21305;&#37197;&#24066;&#22330;&#30340;&#31283;&#23450;&#24615;&#12289;&#25928;&#29575;&#21644;&#20844;&#24179;&#31561;&#35774;&#35745;&#30446;&#26631;&#65292;&#25581;&#31034;&#20102;&#21305;&#37197;&#32467;&#26500;&#29305;&#24615;&#21644;&#19981;&#21516;&#30446;&#26631;&#20043;&#38388;&#30340;&#26435;&#34913;&#20851;&#31995;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#20855;&#26377;&#19968;&#33268;&#20559;&#22909;&#30340;&#21305;&#37197;&#24066;&#22330;&#65292;&#24182;&#24314;&#31435;&#20102;&#31283;&#23450;&#24615;&#12289;&#25928;&#29575;&#21644;&#20844;&#24179;&#31561;&#20849;&#21516;&#35774;&#35745;&#30446;&#26631;&#19982;&#26368;&#20248;&#36816;&#36755;&#29702;&#35770;&#20043;&#38388;&#30340;&#32852;&#31995;&#12290;&#26368;&#20248;&#36816;&#36755;&#20026;&#36861;&#27714;&#36825;&#20123;&#30446;&#26631;&#33719;&#24471;&#30340;&#21305;&#37197;&#30340;&#32467;&#26500;&#29305;&#24615;&#25552;&#20379;&#20102;&#26032;&#30340;&#35265;&#35299;&#65292;&#20197;&#21450;&#19981;&#21516;&#30446;&#26631;&#20043;&#38388;&#30340;&#26435;&#34913;&#12290;&#20855;&#26377;&#19968;&#33268;&#20559;&#22909;&#30340;&#21305;&#37197;&#24066;&#22330;&#25552;&#20379;&#20102;&#19968;&#20010;&#26131;&#22788;&#29702;&#30340;&#31616;&#21270;&#27169;&#22411;&#65292;&#25429;&#25417;&#20102;&#22312;&#21508;&#31181;&#24773;&#22659;&#20013;&#30340;&#20379;&#38656;&#19981;&#24179;&#34913;&#65292;&#27604;&#22914;&#20249;&#20276;&#20851;&#31995;&#24418;&#25104;&#12289;&#23398;&#26657;&#36873;&#25321;&#12289;&#22120;&#23448;&#25424;&#36192;&#20132;&#25442;&#65292;&#20197;&#21450;&#22312;&#21305;&#37197;&#24418;&#25104;&#21518;&#36827;&#34892;&#36716;&#31227;&#35848;&#21028;&#30340;&#21487;&#36716;&#35753;&#25928;&#29992;&#24066;&#22330;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.13378v1 Announce Type: new  Abstract: We study matching markets with aligned preferences and establish a connection between common design objectives -- stability, efficiency, and fairness -- and the theory of optimal transport. Optimal transport gives new insights into the structural properties of matchings obtained from pursuing these objectives, and into the trade-offs between different objectives. Matching markets with aligned preferences provide a tractable stylized model capturing supply-demand imbalances in a range of settings such as partnership formation, school choice, organ donor exchange, and markets with transferable utility where bargaining over transfers happens after a match is formed.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#21457;&#29616;&#65292;&#26426;&#22120;&#23398;&#20064;&#31639;&#27861;&#21487;&#20197;&#26356;&#20934;&#30830;&#22320;&#39044;&#27979;&#20844;&#21496;&#30408;&#21033;&#65292;&#20294;&#21516;&#26679;&#23384;&#22312;&#36807;&#24230;&#21453;&#24212;&#30340;&#38382;&#39064;&#65292;&#32780;&#20256;&#32479;&#22521;&#35757;&#30340;&#32929;&#24066;&#20998;&#26512;&#24072;&#21644;&#32463;&#36807;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#22521;&#35757;&#30340;&#20998;&#26512;&#24072;&#30456;&#27604;&#20250;&#20135;&#29983;&#36739;&#23569;&#30340;&#36807;&#24230;&#21453;&#24212;&#12290;</title><link>http://arxiv.org/abs/2303.16158</link><description>&lt;p&gt;
&#26426;&#22120;&#23398;&#20064;&#20934;&#30830;&#39044;&#27979;&#36130;&#25253;&#65292;&#20294;&#21516;&#26679;&#23384;&#22312;&#36807;&#24230;&#21453;&#24212;
&lt;/p&gt;
&lt;p&gt;
Behavioral Machine Learning? Computer Predictions of Corporate Earnings also Overreact. (arXiv:2303.16158v1 [q-fin.ST])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.16158
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#21457;&#29616;&#65292;&#26426;&#22120;&#23398;&#20064;&#31639;&#27861;&#21487;&#20197;&#26356;&#20934;&#30830;&#22320;&#39044;&#27979;&#20844;&#21496;&#30408;&#21033;&#65292;&#20294;&#21516;&#26679;&#23384;&#22312;&#36807;&#24230;&#21453;&#24212;&#30340;&#38382;&#39064;&#65292;&#32780;&#20256;&#32479;&#22521;&#35757;&#30340;&#32929;&#24066;&#20998;&#26512;&#24072;&#21644;&#32463;&#36807;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#22521;&#35757;&#30340;&#20998;&#26512;&#24072;&#30456;&#27604;&#20250;&#20135;&#29983;&#36739;&#23569;&#30340;&#36807;&#24230;&#21453;&#24212;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22823;&#37327;&#35777;&#25454;&#34920;&#26126;&#65292;&#22312;&#37329;&#34701;&#39046;&#22495;&#20013;&#65292;&#26426;&#22120;&#23398;&#20064;&#31639;&#27861;&#30340;&#39044;&#27979;&#33021;&#21147;&#27604;&#20154;&#31867;&#26356;&#20026;&#20934;&#30830;&#12290;&#20294;&#26159;&#65292;&#25991;&#29486;&#24182;&#26410;&#27979;&#35797;&#31639;&#27861;&#39044;&#27979;&#26159;&#21542;&#26356;&#20026;&#29702;&#24615;&#12290;&#26412;&#25991;&#30740;&#31350;&#20102;&#20960;&#20010;&#31639;&#27861;&#65288;&#21253;&#25324;&#32447;&#24615;&#22238;&#24402;&#21644;&#19968;&#31181;&#21517;&#20026;Gradient Boosted Regression Trees&#30340;&#27969;&#34892;&#31639;&#27861;&#65289;&#23545;&#20110;&#20844;&#21496;&#30408;&#21033;&#30340;&#39044;&#27979;&#32467;&#26524;&#12290;&#32467;&#26524;&#21457;&#29616;&#65292;GBRT&#24179;&#22343;&#32988;&#36807;&#32447;&#24615;&#22238;&#24402;&#21644;&#20154;&#31867;&#32929;&#24066;&#20998;&#26512;&#24072;&#65292;&#20294;&#20173;&#23384;&#22312;&#36807;&#24230;&#21453;&#24212;&#19988;&#26080;&#27861;&#28385;&#36275;&#29702;&#24615;&#39044;&#26399;&#26631;&#20934;&#12290;&#36890;&#36807;&#38477;&#20302;&#23398;&#20064;&#29575;&#65292;&#21487;&#26368;&#23567;&#31243;&#24230;&#19978;&#20943;&#23569;&#36807;&#24230;&#21453;&#24212;&#31243;&#24230;&#65292;&#20294;&#36825;&#20250;&#29306;&#29298;&#39044;&#27979;&#20934;&#30830;&#24615;&#12290;&#36890;&#36807;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#22521;&#35757;&#36807;&#30340;&#32929;&#24066;&#20998;&#26512;&#24072;&#27604;&#20256;&#32479;&#35757;&#32451;&#30340;&#20998;&#26512;&#24072;&#20135;&#29983;&#30340;&#36807;&#24230;&#21453;&#24212;&#36739;&#23569;&#12290;&#27492;&#22806;&#65292;&#32929;&#24066;&#20998;&#26512;&#24072;&#30340;&#39044;&#27979;&#21453;&#26144;&#20986;&#26426;&#22120;&#31639;&#27861;&#27809;&#26377;&#25429;&#25417;&#21040;&#30340;&#20449;&#24687;&#12290;
&lt;/p&gt;
&lt;p&gt;
There is considerable evidence that machine learning algorithms have better predictive abilities than humans in various financial settings. But, the literature has not tested whether these algorithmic predictions are more rational than human predictions. We study the predictions of corporate earnings from several algorithms, notably linear regressions and a popular algorithm called Gradient Boosted Regression Trees (GBRT). On average, GBRT outperformed both linear regressions and human stock analysts, but it still overreacted to news and did not satisfy rational expectation as normally defined. By reducing the learning rate, the magnitude of overreaction can be minimized, but it comes with the cost of poorer out-of-sample prediction accuracy. Human stock analysts who have been trained in machine learning methods overreact less than traditionally trained analysts. Additionally, stock analyst predictions reflect information not otherwise available to machine algorithms.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#20351;&#29992;&#27979;&#37327;&#26694;&#26550;&#65292;&#21457;&#29616;&#36328;&#23398;&#31185;&#22522;&#37329;&#25903;&#25345;&#30340;&#36328;&#23398;&#31185;&#35770;&#25991;&#19982;&#39640;&#24433;&#21709;&#21147;&#30456;&#20851;&#65292;&#20294;&#30456;&#36739;&#20110;&#23398;&#31185;&#22522;&#37329;&#65292;&#36328;&#23398;&#31185;&#22522;&#37329;&#20135;&#29983;&#30340;&#25903;&#25345;&#35770;&#25991;&#26356;&#23569;&#19988;&#24433;&#21709;&#21147;&#19979;&#38477;&#12290;</title><link>http://arxiv.org/abs/2303.14732</link><description>&lt;p&gt;
&#23398;&#31185;&#22522;&#37329;&#25903;&#25345;&#30340;&#36328;&#23398;&#31185;&#35770;&#25991;&#20855;&#26377;&#28145;&#36828;&#30340;&#31185;&#23398;&#24433;&#21709;&#21147;
&lt;/p&gt;
&lt;p&gt;
Interdisciplinary Papers Supported by Disciplinary Grants Garner Deep and Broad Scientific Impact. (arXiv:2303.14732v1 [cs.DL])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.14732
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#20351;&#29992;&#27979;&#37327;&#26694;&#26550;&#65292;&#21457;&#29616;&#36328;&#23398;&#31185;&#22522;&#37329;&#25903;&#25345;&#30340;&#36328;&#23398;&#31185;&#35770;&#25991;&#19982;&#39640;&#24433;&#21709;&#21147;&#30456;&#20851;&#65292;&#20294;&#30456;&#36739;&#20110;&#23398;&#31185;&#22522;&#37329;&#65292;&#36328;&#23398;&#31185;&#22522;&#37329;&#20135;&#29983;&#30340;&#25903;&#25345;&#35770;&#25991;&#26356;&#23569;&#19988;&#24433;&#21709;&#21147;&#19979;&#38477;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36328;&#23398;&#31185;&#30740;&#31350;&#24050;&#25104;&#20026;&#21019;&#26032;&#21644;&#21457;&#29616;&#30340;&#28201;&#24202;&#12290;&#22522;&#37329;&#25903;&#25345;&#30340;&#30740;&#31350;&#36234;&#26469;&#36234;&#21344;&#20027;&#23548;&#22320;&#20301;&#65292;&#19982;&#27492;&#21516;&#26102;&#65292;&#23545;&#36164;&#21161;&#36328;&#23398;&#31185;&#24037;&#20316;&#30340;&#20852;&#36259;&#26085;&#30410;&#22686;&#38271;&#65292;&#36825;&#24341;&#21457;&#20102;&#20851;&#20110;&#36328;&#23398;&#31185;&#25320;&#27454;&#22312;&#25903;&#25345;&#39640;&#24433;&#21709;&#36328;&#23398;&#31185;&#36827;&#23637;&#20013;&#30340;&#20316;&#29992;&#30340;&#26681;&#26412;&#38382;&#39064;&#12290;&#22312;&#36825;&#37324;&#65292;&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#20010;&#27979;&#37327;&#26694;&#26550;&#65292;&#26469;&#37327;&#21270;&#30740;&#31350;&#22522;&#37329;&#21644;&#20986;&#29256;&#29289;&#30340;&#36328;&#23398;&#31185;&#24615;&#65292;&#24182;&#23558;&#20854;&#24212;&#29992;&#20110;&#26469;&#33258;164&#20010;&#36164;&#21161;&#26426;&#26500;&#12289;26&#20010;&#22269;&#23478;&#30340;35&#19975;&#20010;&#25320;&#27454;&#21644;&#20174;1985&#24180;&#21040;2009&#24180;&#25215;&#35748;&#36825;&#20123;&#25320;&#27454;&#25903;&#25345;&#30340;130&#19975;&#31687;&#35770;&#25991;&#12290;&#25105;&#20204;&#30340;&#20998;&#26512;&#25581;&#31034;&#20102;&#20004;&#31181;&#30683;&#30462;&#30340;&#27169;&#24335;&#12290;&#19968;&#26041;&#38754;&#65292;&#36328;&#23398;&#31185;&#22522;&#37329;&#24448;&#24448;&#20250;&#20135;&#29983;&#36328;&#23398;&#31185;&#35770;&#25991;&#65292;&#32780;&#36328;&#23398;&#31185;&#35770;&#25991;&#19982;&#39640;&#24433;&#21709;&#21147;&#30456;&#20851;&#12290;&#21478;&#19968;&#26041;&#38754;&#65292;&#19982;&#23398;&#31185;&#22522;&#37329;&#30456;&#27604;&#65292;&#36328;&#23398;&#31185;&#22522;&#37329;&#20135;&#29983;&#30340;&#35770;&#25991;&#26356;&#23569;&#65292;&#32780;&#25903;&#25345;&#30340;&#36328;&#23398;&#31185;&#35770;&#25991;&#24433;&#21709;&#21147;&#20063;&#22823;&#22823;&#19979;&#38477;&#12290;&#25105;&#20204;&#34920;&#26126;
&lt;/p&gt;
&lt;p&gt;
Interdisciplinary research has emerged as a hotbed for innovation and discoveries. The increasing dominance of grant-supported research, combined with growing interest in funding interdisciplinary work, raises fundamental questions on the role of interdisciplinary grants in supporting high-impact interdisciplinary advances. Here we develop a measurement framework to quantify the interdisciplinarity of both research grants and publications and apply it to 350K grants from 164 funding agencies over 26 countries and 1.3M papers that acknowledged the support of these grants from 1985 to 2009. Our analysis uncovers two contradictory patterns. On the one hand, interdisciplinary grants tend to produce interdisciplinary papers and interdisciplinary papers are associated with high impact. On the other hand, compared to their disciplinary counterparts, interdisciplinary grants produce much fewer papers and interdisciplinary papers that they support have substantially reduced impact. We show that
&lt;/p&gt;</description></item></channel></rss>