<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#25105;&#20204;&#25552;&#20379;&#20102;&#19968;&#20010;&#25112;&#30053;&#27169;&#22411;&#26469;&#35299;&#37322;&#20135;&#19994;&#32593;&#32476;&#30340;&#24418;&#25104;&#65292;&#35813;&#27169;&#22411;&#32771;&#34385;&#20102;&#20225;&#19994;&#22312;&#29983;&#20135;&#32593;&#32476;&#20013;&#30340;&#20013;&#24515;&#24230;&#65292;&#24182;&#30740;&#31350;&#20102;&#22810;&#20010;&#32435;&#20160;&#22343;&#34913;&#30340;&#29305;&#24615;&#12289;&#31038;&#20250;&#25928;&#29575;&#20197;&#21450;&#32593;&#32476;&#32467;&#26500;&#23545;&#31038;&#20250;&#31119;&#21033;&#30340;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2401.08929</link><description>&lt;p&gt;
&#20135;&#19994;&#32593;&#32476;&#30340;&#25112;&#30053;&#24418;&#25104;
&lt;/p&gt;
&lt;p&gt;
Strategic formation of production networks. (arXiv:2401.08929v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.08929
&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20379;&#20102;&#19968;&#20010;&#25112;&#30053;&#27169;&#22411;&#26469;&#35299;&#37322;&#20135;&#19994;&#32593;&#32476;&#30340;&#24418;&#25104;&#65292;&#35813;&#27169;&#22411;&#32771;&#34385;&#20102;&#20225;&#19994;&#22312;&#29983;&#20135;&#32593;&#32476;&#20013;&#30340;&#20013;&#24515;&#24230;&#65292;&#24182;&#30740;&#31350;&#20102;&#22810;&#20010;&#32435;&#20160;&#22343;&#34913;&#30340;&#29305;&#24615;&#12289;&#31038;&#20250;&#25928;&#29575;&#20197;&#21450;&#32593;&#32476;&#32467;&#26500;&#23545;&#31038;&#20250;&#31119;&#21033;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20379;&#20102;&#19968;&#20010;&#25112;&#30053;&#27169;&#22411;&#26469;&#35299;&#37322;&#20135;&#19994;&#32593;&#32476;&#30340;&#24418;&#25104;&#65292;&#35813;&#27169;&#22411;&#21253;&#21547;&#20102;&#26631;&#20934;&#30340;&#19968;&#33324;&#22343;&#34913;&#26041;&#27861;&#12290;&#22312;&#25105;&#20204;&#30340;&#35774;&#32622;&#20013;&#65292;&#20225;&#19994;&#30340;&#30446;&#26631;&#26159;&#36873;&#25321;&#20182;&#20204;&#30340;&#20379;&#24212;&#20851;&#31995;&#20197;&#20415;&#22312;&#21457;&#23637;&#30340;&#19968;&#33324;&#22343;&#34913;&#20013;&#26368;&#22823;&#21270;&#21033;&#28070;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#36825;&#20010;&#30446;&#26631;&#31561;&#20215;&#20110;&#20225;&#19994;&#22312;&#29983;&#20135;&#32593;&#32476;&#20013;&#26368;&#22823;&#21270;&#20182;&#20204;&#30340;&#29305;&#24449;&#21521;&#37327;&#20013;&#24515;&#24230;&#12290;&#19982;&#22522;&#20110;&#20013;&#24515;&#24230;&#30340;&#32593;&#32476;&#24418;&#25104;&#21338;&#24328;&#20013;&#26222;&#36941;&#23384;&#22312;&#30340;&#24773;&#20917;&#19968;&#26679;&#65292;&#25105;&#20204;&#30340;&#35774;&#32622;&#20013;&#23384;&#22312;&#22810;&#20010;&#32435;&#20160;&#22343;&#34913;&#12290;&#25105;&#20204;&#22312;&#25105;&#20204;&#30340;&#27169;&#22411;&#30340;&#31616;&#21270;&#29256;&#26412;&#20013;&#30740;&#31350;&#20102;&#36825;&#20123;&#22343;&#34913;&#30340;&#29305;&#24615;&#21644;&#31038;&#20250;&#25928;&#29575;&#65292;&#36825;&#20010;&#31616;&#21270;&#29256;&#26412;&#20195;&#34920;&#22269;&#38469;&#36152;&#26131;&#32593;&#32476;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#32593;&#32476;&#32467;&#26500;&#23545;&#31038;&#20250;&#31119;&#21033;&#30340;&#24433;&#21709;&#39318;&#20808;&#30001;&#22686;&#21152;&#36807;&#31243;&#22797;&#26434;&#24615;&#30340;&#25104;&#26412;&#21644;&#36890;&#36807;&#36755;&#20837;&#32452;&#21512;&#22810;&#26679;&#21270;&#24341;&#36215;&#30340;&#29983;&#20135;&#29575;&#28322;&#20986;&#20043;&#38388;&#30340;&#26435;&#34913;&#26469;&#20915;&#23450;&#12290;&#25105;&#20204;&#36827;&#19968;&#27493;&#20998;&#26512;&#20102;&#25105;&#20204;&#27169;&#22411;&#30340;&#19968;&#20010;&#21464;&#20307;&#65292;&#32771;&#34385;&#21040;&#20013;&#26029;&#39118;&#38505;&#12290;
&lt;/p&gt;
&lt;p&gt;
We provide a strategic model of the formation of production networks that subsumes the standard general equilibrium approach. The objective of firms in our setting is to choose their supply relationships so as to maximize their profit at the general equilibrium that unfolds. We show that this objective is equivalent to the maximization by the firms of their eigenvector centrality in the production network. As is common in network formation games based on centrality, there are multiple Nash equilibria in our setting. We have investigated the characteristics and the social efficiency of these equilibria in a stylized version of our model representing international trade networks. We show that the impact of network structure on social welfare is firstly determined by a trade-off between costs of increasing process complexity and positive spillovers on productivity induced by the diversification of the input mix. We further analyze a variant of our model that accounts for the risks of disr
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20351;&#29992;&#21333;&#20010;&#22823;&#22411;&#32593;&#32476;&#30340;&#35266;&#27979;&#25968;&#25454;&#36827;&#34892;&#38750;&#21442;&#25968;&#20272;&#35745;&#65292;&#21033;&#29992;&#22270;&#31070;&#32463;&#32593;&#32476;&#20272;&#35745;&#39640;&#32500;&#28902;&#24700;&#20989;&#25968;&#65292;&#30740;&#31350;&#27835;&#30103;&#25928;&#24212;&#21644;&#28322;&#20986;&#25928;&#24212;&#12290;</title><link>http://arxiv.org/abs/2211.07823</link><description>&lt;p&gt;
&#20351;&#29992;&#32593;&#32476;&#24178;&#25200;&#36827;&#34892;&#26080;&#20559;&#24615;&#20272;&#35745;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Unconfoundedness with Network Interference. (arXiv:2211.07823v2 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2211.07823
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20351;&#29992;&#21333;&#20010;&#22823;&#22411;&#32593;&#32476;&#30340;&#35266;&#27979;&#25968;&#25454;&#36827;&#34892;&#38750;&#21442;&#25968;&#20272;&#35745;&#65292;&#21033;&#29992;&#22270;&#31070;&#32463;&#32593;&#32476;&#20272;&#35745;&#39640;&#32500;&#28902;&#24700;&#20989;&#25968;&#65292;&#30740;&#31350;&#27835;&#30103;&#25928;&#24212;&#21644;&#28322;&#20986;&#25928;&#24212;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20351;&#29992;&#26469;&#33258;&#21333;&#20010;&#22823;&#22411;&#32593;&#32476;&#30340;&#35266;&#27979;&#25968;&#25454;&#23545;&#27835;&#30103;&#25928;&#24212;&#21644;&#28322;&#20986;&#25928;&#24212;&#36827;&#34892;&#38750;&#21442;&#25968;&#20272;&#35745;&#12290;&#25105;&#20204;&#32771;&#34385;&#19968;&#20010;&#27169;&#22411;&#65292;&#20854;&#20013;&#24178;&#25200;&#38543;&#30528;&#32593;&#32476;&#36317;&#31163;&#30340;&#22686;&#21152;&#32780;&#34928;&#20943;&#65292;&#36825;&#20801;&#35768;&#23545;&#32467;&#26524;&#21644;&#27835;&#30103;&#36873;&#25321;&#30340;&#21516;&#20276;&#24433;&#21709;&#36827;&#34892;&#24314;&#27169;&#12290;&#22312;&#36825;&#20010;&#27169;&#22411;&#19979;&#65292;&#24635;&#32593;&#32476;&#21644;&#25152;&#26377;&#21333;&#20301;&#30340;&#21327;&#21464;&#37327;&#26500;&#25104;&#20102;&#28151;&#28102;&#30340;&#26469;&#28304;&#65292;&#19982;&#29616;&#26377;&#24037;&#20316;&#19981;&#21516;&#30340;&#26159;&#65292;&#29616;&#26377;&#24037;&#20316;&#20551;&#35774;&#28151;&#28102;&#21487;&#20197;&#30001;&#36825;&#20123;&#23545;&#35937;&#30340;&#24050;&#30693;&#20302;&#32500;&#20989;&#25968;&#24635;&#32467;&#12290;&#25105;&#20204;&#25552;&#20986;&#20351;&#29992;&#22270;&#31070;&#32463;&#32593;&#32476;&#26469;&#20272;&#35745;&#21452;&#37325;&#31283;&#20581;&#20272;&#35745;&#37327;&#30340;&#39640;&#32500;&#28902;&#24700;&#20989;&#25968;&#12290;&#25105;&#20204;&#24314;&#31435;&#20102;&#36817;&#20284;&#31232;&#30095;&#30340;&#32593;&#32476;&#31867;&#27604;&#65292;&#20197;&#35777;&#26126;&#20351;&#29992;&#27973;&#23618;&#32467;&#26500;&#30340;&#21512;&#29702;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper studies nonparametric estimation of treatment and spillover effects using observational data from a single large network. We consider a model in which interference decays with network distance, which allows for peer influence in both outcomes and selection into treatment. Under this model, the total network and covariates of all units constitute sources of confounding, in contrast to existing work that assumes confounding can be summarized by a known, low-dimensional function of these objects. We propose to use graph neural networks to estimate the high-dimensional nuisance functions of a doubly robust estimator. We establish a network analog of approximate sparsity to justify the use of shallow architectures.
&lt;/p&gt;</description></item></channel></rss>