<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#26412;&#25991;&#22312;&#26641;&#24418;&#32467;&#26500;&#20013;&#30740;&#31350;&#20102;&#21452;&#36793;&#19968;&#23545;&#19968;&#21305;&#37197;&#24066;&#22330;&#30340;&#31283;&#23450;&#24615;&#21644;&#31574;&#30053;&#26080;&#35851;&#24615;&#12290;&#24403;&#20195;&#29702;&#20154;&#23545;&#26641;&#24418;&#23545;&#35937;&#20855;&#26377;&#21333;&#23792;&#20559;&#22909;&#26102;&#65292;&#25152;&#26377;&#20016;&#23500;&#30340;&#21311;&#21517;&#30340;&#26641;&#24418;&#21333;&#23792;&#22495;&#20013;&#37117;&#23384;&#22312;&#31283;&#23450;&#21644;&#65288;&#24369;&#22242;&#20307;&#65289;&#31574;&#30053;&#26080;&#35851;&#21305;&#37197;&#35268;&#21017;&#12290;&#23545;&#20110;&#22823;&#23567;&#33267;&#23569;&#20026;&#20116;&#30340;&#24066;&#22330;&#65292;&#19981;&#23384;&#22312;&#20016;&#23500;&#30340;&#21311;&#21517;&#22495;&#65292;&#20854;&#20013;&#23384;&#22312;&#31283;&#23450;&#19988;&#38750;bossy&#21305;&#37197;&#35268;&#21017;&#12290;</title><link>http://arxiv.org/abs/2304.11494</link><description>&lt;p&gt;
&#26641;&#24418;&#32467;&#26500;&#20013;&#21333;&#23792;&#20559;&#22909;&#23545;&#31283;&#23450;&#24615;&#21644;&#25112;&#30053;&#26080;&#35851;&#30340;&#20860;&#23481;&#24615;
&lt;/p&gt;
&lt;p&gt;
Compatibility between stability and strategy-proofness with single-peaked preferences on trees. (arXiv:2304.11494v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.11494
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#22312;&#26641;&#24418;&#32467;&#26500;&#20013;&#30740;&#31350;&#20102;&#21452;&#36793;&#19968;&#23545;&#19968;&#21305;&#37197;&#24066;&#22330;&#30340;&#31283;&#23450;&#24615;&#21644;&#31574;&#30053;&#26080;&#35851;&#24615;&#12290;&#24403;&#20195;&#29702;&#20154;&#23545;&#26641;&#24418;&#23545;&#35937;&#20855;&#26377;&#21333;&#23792;&#20559;&#22909;&#26102;&#65292;&#25152;&#26377;&#20016;&#23500;&#30340;&#21311;&#21517;&#30340;&#26641;&#24418;&#21333;&#23792;&#22495;&#20013;&#37117;&#23384;&#22312;&#31283;&#23450;&#21644;&#65288;&#24369;&#22242;&#20307;&#65289;&#31574;&#30053;&#26080;&#35851;&#21305;&#37197;&#35268;&#21017;&#12290;&#23545;&#20110;&#22823;&#23567;&#33267;&#23569;&#20026;&#20116;&#30340;&#24066;&#22330;&#65292;&#19981;&#23384;&#22312;&#20016;&#23500;&#30340;&#21311;&#21517;&#22495;&#65292;&#20854;&#20013;&#23384;&#22312;&#31283;&#23450;&#19988;&#38750;bossy&#21305;&#37197;&#35268;&#21017;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#21452;&#36793;&#19968;&#23545;&#19968;&#21305;&#37197;&#24066;&#22330;&#30340;&#31283;&#23450;&#24615;&#21644;&#31574;&#30053;&#26080;&#35851;&#24615;&#12290;&#20195;&#29702;&#20154;&#23545;&#26641;&#24418;&#23545;&#35937;&#20855;&#26377;&#21333;&#23792;&#20559;&#22909;&#12290;&#22312;&#35813;&#35774;&#32622;&#20013;&#65292;&#25105;&#20204;&#34920;&#24449;&#20102;&#25152;&#26377;&#20016;&#23500;&#30340;&#21311;&#21517;&#30340;&#26641;&#24418;&#21333;&#23792;&#22495;&#65292;&#20854;&#20013;&#23384;&#22312;&#31283;&#23450;&#21644;&#65288;&#24369;&#22242;&#20307;&#65289;&#31574;&#30053;&#26080;&#35851;&#21305;&#37197;&#35268;&#21017;&#12290;&#25105;&#20204;&#36824;&#23637;&#31034;&#20102;&#27599;&#24403;&#23384;&#22312;&#19968;&#20010;&#31283;&#23450;&#19988;&#31574;&#30053;&#26080;&#35851;&#21305;&#37197;&#35268;&#21017;&#22312;&#19968;&#20010;&#20016;&#23500;&#30340;&#21311;&#21517;&#26641;&#24418;&#21333;&#23792;&#22495;&#19978;&#65292;&#19968;&#20010;&#25110;&#20004;&#20010;&#24310;&#36831;&#25509;&#21463;&#35268;&#21017;&#65288;Gale &#21644; Shapley&#65292;1962&#65289;&#37117;&#28385;&#36275;&#35813;&#22495;&#19978;&#30340;&#31283;&#23450;&#21644;&#24369;&#22242;&#20307;&#31574;&#30053;&#26080;&#35851;&#24615;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#34920;&#26126;&#23545;&#20110;&#22823;&#23567;&#33267;&#23569;&#20026;&#20116;&#30340;&#24066;&#22330;&#65292;&#19981;&#23384;&#22312;&#20016;&#23500;&#30340;&#21311;&#21517;&#22495;&#65292;&#20854;&#20013;&#23384;&#22312;&#31283;&#23450;&#19988;&#38750;bossy&#21305;&#37197;&#35268;&#21017;&#12290;&#20316;&#20026;&#25512;&#35770;&#65292;&#23545;&#20110;&#33267;&#23569;&#26377;&#20116;&#20010;&#24066;&#22330;&#30340;&#20016;&#23500;&#21311;&#21517;&#26641;&#24418;&#21333;&#23792;&#22495;&#65292;&#31283;&#23450;&#24615;&#21644;&#22242;&#20307;&#31574;&#30053;&#26080;&#35851;&#24615;&#20043;&#38388;&#19981;&#20860;&#23481;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper studies the stability and strategy-proofness aspect of the two-sided one-to-one matching market. Agents have single-peaked preferences on trees. In this setting, we characterize all rich anonymous tree-single-peaked domains where a stable and (weakly group) strategy-proof matching rule exists. We also show that whenever there exists a stable and strategy-proof matching rule on a rich anonymous tree-single-peaked domain, one or both of the deferred acceptance rules (Gale and Shapley, 1962) satisfy stability and weak group strategy-proofness on that domain. Finally, we show that for markets with a size of at least five, there is no rich anonymous domain where a stable and non-bossy matching rule exists. As a corollary, we show incompatibility between stability and group strategy-proofness on rich anonymous tree-single-peaked domains for markets with a size of at least five.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#22312;&#22823;&#35268;&#27169;&#31354;&#38388;&#38754;&#26495;&#32593;&#32476;&#19978;&#25552;&#20986;&#20102;&#19968;&#31181;&#22343;&#21248;&#25512;&#26029;&#29702;&#35770;&#65292;&#35813;&#29702;&#35770;&#33021;&#22815;&#23545;&#24863;&#20852;&#36259;&#30340;&#21442;&#25968;&#36827;&#34892;&#20551;&#35774;&#26816;&#39564;&#65292;&#21253;&#25324;&#32593;&#32476;&#32467;&#26500;&#20013;&#30340;&#38646;&#25110;&#38750;&#38646;&#20803;&#32032;&#12290;</title><link>http://arxiv.org/abs/2105.07424</link><description>&lt;p&gt;
&#39640;&#32500;&#31354;&#38388;&#38754;&#26495;&#32593;&#32476;&#19978;&#30340;&#22343;&#21248;&#25512;&#26029;
&lt;/p&gt;
&lt;p&gt;
Uniform Inference on High-dimensional Spatial Panel Networks. (arXiv:2105.07424v3 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2105.07424
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#22312;&#22823;&#35268;&#27169;&#31354;&#38388;&#38754;&#26495;&#32593;&#32476;&#19978;&#25552;&#20986;&#20102;&#19968;&#31181;&#22343;&#21248;&#25512;&#26029;&#29702;&#35770;&#65292;&#35813;&#29702;&#35770;&#33021;&#22815;&#23545;&#24863;&#20852;&#36259;&#30340;&#21442;&#25968;&#36827;&#34892;&#20551;&#35774;&#26816;&#39564;&#65292;&#21253;&#25324;&#32593;&#32476;&#32467;&#26500;&#20013;&#30340;&#38646;&#25110;&#38750;&#38646;&#20803;&#32032;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#20559;&#24046;-&#27491;&#21017;&#21270;&#30340;&#39640;&#32500;&#24191;&#20041;&#30697;&#26041;&#27861;&#65288;GMM&#65289;&#26694;&#26550;&#65292;&#29992;&#20110;&#23545;&#22823;&#35268;&#27169;&#31354;&#38388;&#38754;&#26495;&#32593;&#32476;&#36827;&#34892;&#25512;&#26029;&#12290;&#29305;&#21035;&#26159;&#65292;&#21033;&#29992;&#20559;&#24046;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#20272;&#35745;&#20855;&#26377;&#28789;&#27963;&#31232;&#30095;&#20559;&#24046;&#30340;&#32593;&#32476;&#32467;&#26500;&#65292;&#36825;&#21487;&#20197;&#34987;&#35270;&#20026;&#28508;&#22312;&#30340;&#25110;&#32773;&#19982;&#39044;&#23450;&#30340;&#37051;&#25509;&#30697;&#38453;&#19981;&#21305;&#37197;&#12290;&#29702;&#35770;&#20998;&#26512;&#30830;&#31435;&#20102;&#25105;&#20204;&#25552;&#20986;&#30340;&#20272;&#35745;&#22120;&#30340;&#19968;&#33268;&#24615;&#21644;&#28176;&#36817;&#27491;&#24577;&#24615;&#65292;&#32771;&#34385;&#20102;&#25968;&#25454;&#29983;&#25104;&#36807;&#31243;&#20013;&#30340;&#19968;&#33324;&#26102;&#38388;&#21644;&#31354;&#38388;&#20381;&#36182;&#24615;&#12290;&#35752;&#35770;&#20102;&#20381;&#36182;&#24615;&#23384;&#22312;&#26102;&#30340;&#32500;&#24230;&#20801;&#35768;&#24615;&#12290;&#25105;&#20204;&#30740;&#31350;&#30340;&#19968;&#20010;&#20027;&#35201;&#36129;&#29486;&#26159;&#24320;&#21457;&#20102;&#19968;&#31181;&#22343;&#21248;&#25512;&#26029;&#29702;&#35770;&#65292;&#33021;&#22815;&#23545;&#24863;&#20852;&#36259;&#30340;&#21442;&#25968;&#36827;&#34892;&#20551;&#35774;&#26816;&#39564;&#65292;&#21253;&#25324;&#32593;&#32476;&#32467;&#26500;&#20013;&#30340;&#38646;&#25110;&#38750;&#38646;&#20803;&#32032;&#12290;&#27492;&#22806;&#65292;&#23545;&#20272;&#35745;&#22120;&#30340;&#28176;&#36817;&#24615;&#36136;&#36827;&#34892;&#20102;&#32447;&#24615;&#21644;&#38750;&#32447;&#24615;&#26102;&#21051;&#30340;&#25512;&#23548;&#12290;&#27169;&#25311;&#23454;&#39564;&#35777;&#26126;&#20102;&#25152;&#25552;&#26041;&#27861;&#30340;&#26377;&#25928;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
We propose employing a debiased-regularized, high-dimensional generalized method of moments (GMM) framework to perform inference on large-scale spatial panel networks. In particular, network structure with a flexible sparse deviation, which can be regarded either as latent or as misspecified from a predetermined adjacency matrix, is estimated using debiased machine learning approach. The theoretical analysis establishes the consistency and asymptotic normality of our proposed estimator, taking into account general temporal and spatial dependency inherent in the data-generating processes. The dimensionality allowance in presence of dependency is discussed. A primary contribution of our study is the development of uniform inference theory that enables hypothesis testing on the parameters of interest, including zero or non-zero elements in the network structure. Additionally, the asymptotic properties for the estimator are derived for both linear and nonlinear moments. Simulations demonst
&lt;/p&gt;</description></item></channel></rss>