<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#24320;&#21457;&#32773;&#21644;&#36164;&#21161;&#32773;&#24212;&#36981;&#23432;&#30740;&#31350;&#20262;&#29702;&#21407;&#21017;&#65292;&#25552;&#35758;&#36879;&#26126;&#12289;&#21487;&#37325;&#29992;&#21644;&#21487;&#26356;&#26032;&#30340;&#35745;&#31639;&#21355;&#29983;&#32463;&#27982;&#27169;&#22411;&#36719;&#20214;&#65292;&#20197;&#25913;&#21892;&#31038;&#20250;&#25509;&#21463;&#24230;&#21644;&#20351;&#29992;&#25928;&#26524;&#12290;</title><link>https://arxiv.org/abs/2403.17798</link><description>&lt;p&gt;
&#35745;&#21010;&#12289;&#23454;&#26045;&#21644;&#21457;&#24067;&#21355;&#29983;&#32463;&#27982;&#27169;&#22411;&#36719;&#20214;&#26102;&#30340;&#36947;&#24503;&#32771;&#37327;&#65306;&#19968;&#20010;&#26032;&#25552;&#35758;
&lt;/p&gt;
&lt;p&gt;
Ethical considerations when planning, implementing and releasing health economic model software: a new proposal
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.17798
&lt;/p&gt;
&lt;p&gt;
&#24320;&#21457;&#32773;&#21644;&#36164;&#21161;&#32773;&#24212;&#36981;&#23432;&#30740;&#31350;&#20262;&#29702;&#21407;&#21017;&#65292;&#25552;&#35758;&#36879;&#26126;&#12289;&#21487;&#37325;&#29992;&#21644;&#21487;&#26356;&#26032;&#30340;&#35745;&#31639;&#21355;&#29983;&#32463;&#27982;&#27169;&#22411;&#36719;&#20214;&#65292;&#20197;&#25913;&#21892;&#31038;&#20250;&#25509;&#21463;&#24230;&#21644;&#20351;&#29992;&#25928;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22823;&#22810;&#25968;&#21355;&#29983;&#32463;&#27982;&#20998;&#26512;&#37117;&#26159;&#22312;&#35745;&#31639;&#26426;&#30340;&#24110;&#21161;&#19979;&#36827;&#34892;&#30340;&#12290;&#28982;&#32780;&#65292;&#23558;&#21355;&#29983;&#32463;&#27982;&#27169;&#22411;&#20316;&#20026;&#36719;&#20214;&#65288;&#25110;&#35745;&#31639;&#21355;&#29983;&#32463;&#27982;&#27169;&#22411;&#65288;CHEMs&#65289;&#65289;&#23454;&#26045;&#30340;&#30740;&#31350;&#20262;&#29702;&#36947;&#24503;&#23578;&#19981;&#26126;&#30830;&#12290;&#25105;&#20204;&#25552;&#35758;&#65292;CHEM&#30340;&#24320;&#21457;&#32773;&#21644;&#36164;&#21161;&#32773;&#24212;&#36981;&#23432;&#30740;&#31350;&#20262;&#29702;&#21407;&#21017;&#65292;&#24182;&#36861;&#27714;&#20197;&#19979;&#30446;&#26631;&#65306;&#65288;i&#65289;&#31038;&#20250;&#21487;&#25509;&#21463;&#30340;&#29992;&#25143;&#35201;&#27714;&#21644;&#35774;&#35745;&#35268;&#33539;&#65307;&#65288;ii&#65289;&#20999;&#21512;&#38656;&#27714;&#30340;&#23454;&#26045;&#65307;&#20197;&#21450;&#65288;iii&#65289;&#31038;&#20250;&#21463;&#30410;&#30340;&#21457;&#24067;&#21518;&#20351;&#29992;&#12290;&#25105;&#20204;&#36827;&#19968;&#27493;&#25552;&#35758;&#65292;&#36879;&#26126;&#65288;T&#65289;&#12289;&#21487;&#37325;&#29992;&#65288;R&#65289;&#21644;&#21487;&#26356;&#26032;&#65288;U&#65289;&#30340;CHEM&#34920;&#26126;&#39033;&#30446;&#22242;&#38431;&#22312;&#24456;&#22823;&#31243;&#24230;&#19978;&#24050;&#23454;&#29616;&#36825;&#20123;&#30446;&#26631;&#12290;&#25105;&#20204;&#25552;&#20986;&#20845;&#20010;&#35780;&#20272;TRU CHEMs&#30340;&#26631;&#20934;&#65306;&#65288;T1&#65289;&#36719;&#20214;&#25991;&#20214;&#26159;&#20844;&#24320;&#21487;&#29992;&#30340;&#65307;&#65288;T2&#65289;&#24320;&#21457;&#32773;&#23545;&#36866;&#24403;&#20351;&#29992;&#30340;&#36129;&#29486;&#21644;&#21028;&#26029;&#23481;&#26131;&#35782;&#21035;&#65307;&#65288;R1&#65289;&#32534;&#31243;&#23454;&#36341;&#26377;&#21033;&#20110;&#29420;&#31435;&#37325;&#29992;&#27169;&#22411;&#32452;&#20214;&#65307;&#65288;R2&#65289;&#35768;&#21487;&#35777;&#20801;&#35768;&#37325;&#29992;&#21644;&#34893;&#29983;&#20316;&#21697;&#65307;&#65288;U1&#65289;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.17798v1 Announce Type: new  Abstract: Most health economic analyses are undertaken with the aid of computers. However, the research ethics of implementing health economic models as software (or computational health economic models (CHEMs)) are poorly understood. We propose that developers and funders of CHEMs should adhere to research ethics principles and pursue the goals of: (i) socially acceptable user requirements and design specifications; (ii) fit for purpose implementations; and (iii) socially beneficial post-release use. We further propose that a transparent (T), reusable (R) and updatable (U) CHEM is suggestive of a project team that has largely met these goals. We propose six criteria for assessing TRU CHEMs: (T1) software files are publicly available; (T2) developer contributions and judgments on appropriate use are easily identified; (R1) programming practices facilitate independent reuse of model components; (R2) licenses permit reuse and derivative works; (U1) 
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#23637;&#31034;&#20102;&#19968;&#31181;&#20351;&#29992;&#37325;&#22797;&#27979;&#37327;&#30340;&#20004;&#20010;&#24207;&#32479;&#35745;&#37327;&#38750;&#21442;&#25968;&#30830;&#23450;&#32463;&#20856;&#27979;&#37327;&#35823;&#24046;&#27169;&#22411;&#30340;&#26041;&#27861;&#65292;&#25193;&#23637;&#20102;&#23545;&#21508;&#31181;&#23454;&#35777;&#35774;&#32622;&#30340;&#36866;&#29992;&#24615;&#12290;</title><link>https://arxiv.org/abs/2403.17777</link><description>&lt;p&gt;
&#20174;&#20004;&#20010;&#24207;&#32479;&#35745;&#37327;&#36824;&#21407;
&lt;/p&gt;
&lt;p&gt;
Deconvolution from two order statistics
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.17777
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#23637;&#31034;&#20102;&#19968;&#31181;&#20351;&#29992;&#37325;&#22797;&#27979;&#37327;&#30340;&#20004;&#20010;&#24207;&#32479;&#35745;&#37327;&#38750;&#21442;&#25968;&#30830;&#23450;&#32463;&#20856;&#27979;&#37327;&#35823;&#24046;&#27169;&#22411;&#30340;&#26041;&#27861;&#65292;&#25193;&#23637;&#20102;&#23545;&#21508;&#31181;&#23454;&#35777;&#35774;&#32622;&#30340;&#36866;&#29992;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#32463;&#27982;&#25968;&#25454;&#32463;&#24120;&#21463;&#21040;&#27979;&#37327;&#35823;&#24046;&#30340;&#27745;&#26579;&#65292;&#24182;&#21463;&#21040;&#25490;&#21517;&#30340;&#25130;&#26029;&#12290;&#26412;&#25991;&#23637;&#31034;&#20102;&#20165;&#20351;&#29992;&#37325;&#22797;&#27979;&#37327;&#30340;&#20004;&#20010;&#24207;&#32479;&#35745;&#37327;&#65292;&#23601;&#21487;&#20197;&#38750;&#21442;&#25968;&#22320;&#30830;&#23450;&#20855;&#26377;&#29420;&#31435;&#21644;&#21152;&#27861;&#27979;&#37327;&#35823;&#24046;&#30340;&#32463;&#20856;&#27979;&#37327;&#35823;&#24046;&#27169;&#22411;&#12290;&#35813;&#35782;&#21035;&#32467;&#26524;&#35777;&#23454;&#20102;Athey&#21644;Haile&#65288;2002&#65289;&#25552;&#20986;&#30340;&#20851;&#20110;&#20855;&#26377;&#26410;&#35266;&#27979;&#24322;&#36136;&#24615;&#30340;&#23545;&#31216;&#21319;&#20215;&#25293;&#21334;&#27169;&#22411;&#30340;&#20551;&#35774;&#12290;&#25193;&#23637;&#20801;&#35768;&#24322;&#36136;&#30340;&#27979;&#37327;&#35823;&#24046;&#65292;&#20174;&#32780;&#23558;&#36866;&#29992;&#24615;&#25193;&#23637;&#21040;&#20854;&#20182;&#32463;&#39564;&#35774;&#32622;&#65292;&#21253;&#25324;&#38750;&#23545;&#31216;&#25293;&#21334;&#21644;&#24037;&#36164;&#25253;&#20215;&#27169;&#22411;&#12290;&#25105;&#20204;&#25913;&#32534;&#20102;&#29616;&#26377;&#30340;&#27169;&#25311;&#31579;&#36873;&#20272;&#35745;&#37327;&#65292;&#24182;&#23637;&#31034;&#20102;&#20854;&#22312;&#26377;&#38480;&#26679;&#26412;&#20013;&#30340;&#34920;&#29616;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.17777v1 Announce Type: new  Abstract: Economic data are often contaminated by measurement errors and truncated by ranking. This paper shows that the classical measurement error model with independent and additive measurement errors is identified nonparametrically using only two order statistics of repeated measurements. The identification result confirms a hypothesis by Athey and Haile (2002) for a symmetric ascending auction model with unobserved heterogeneity. Extensions allow for heterogeneous measurement errors, broadening the applicability to additional empirical settings, including asymmetric auctions and wage offer models. We adapt an existing simulated sieve estimator and illustrate its performance in finite samples.
&lt;/p&gt;</description></item><item><title>&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#38024;&#23545;&#20215;&#20540;&#26080;&#27861;&#27604;&#36739;&#24615;&#30340;&#19968;&#33324;&#24615;&#35770;&#35777;&#65292;&#34920;&#26126;&#20215;&#20540;&#26080;&#27861;&#27604;&#36739;&#24615;&#20250;&#23548;&#33268;&#25490;&#21015;&#25277;&#31614;&#26102;&#20004;&#20010;&#21512;&#29702;&#21407;&#21017;&#30340;&#19981;&#30456;&#23481;&#24615;&#65292;&#24182;&#35752;&#35770;&#20102;&#25903;&#25345;&#32773;&#24212;&#35813;&#25298;&#32477;&#21738;&#20010;&#21407;&#21017;&#12290;</title><link>https://arxiv.org/abs/2403.17641</link><description>&lt;p&gt;
&#20998;&#20139;&#31958;&#26524;
&lt;/p&gt;
&lt;p&gt;
Share the Sugar
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.17641
&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#38024;&#23545;&#20215;&#20540;&#26080;&#27861;&#27604;&#36739;&#24615;&#30340;&#19968;&#33324;&#24615;&#35770;&#35777;&#65292;&#34920;&#26126;&#20215;&#20540;&#26080;&#27861;&#27604;&#36739;&#24615;&#20250;&#23548;&#33268;&#25490;&#21015;&#25277;&#31614;&#26102;&#20004;&#20010;&#21512;&#29702;&#21407;&#21017;&#30340;&#19981;&#30456;&#23481;&#24615;&#65292;&#24182;&#35752;&#35770;&#20102;&#25903;&#25345;&#32773;&#24212;&#35813;&#25298;&#32477;&#21738;&#20010;&#21407;&#21017;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#38024;&#23545;&#20215;&#20540;&#26080;&#27861;&#27604;&#36739;&#24615;&#30340;&#19968;&#33324;&#24615;&#35770;&#35777;&#65292;&#22522;&#20110;&#19968;&#31181;&#26032;&#22411;&#30340;&#19981;&#21487;&#33021;&#24615;&#32467;&#26524;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#25105;&#20204;&#34920;&#26126;&#65292;&#26681;&#25454;&#21512;&#29702;&#30340;&#32972;&#26223;&#20551;&#35774;&#65292;&#20215;&#20540;&#26080;&#27861;&#27604;&#36739;&#24615;&#22312;&#25490;&#21015;&#25277;&#31614;&#26102;&#20250;&#36896;&#25104;&#20004;&#20010;&#38750;&#24120;&#21512;&#29702;&#30340;&#21407;&#21017;&#20043;&#38388;&#30340;&#19981;&#30456;&#23481;&#24615;&#65306;&#19968;&#31181;&#24369;&#8220;&#36127;&#20248;&#21183;&#8221;&#21407;&#21017;&#65288;&#25351;&#21482;&#26377;&#24403;&#25277;&#31614;1&#30340;&#26576;&#31181;&#21487;&#33021;&#32467;&#26524;&#27604;&#25277;&#31614;2&#30340;&#26576;&#31181;&#21487;&#33021;&#32467;&#26524;&#26356;&#20248;&#26102;&#65292;&#25277;&#31614;1&#25165;&#21487;&#33021;&#27604;&#25277;&#31614;2&#26356;&#22909;&#65289;&#21644;&#19968;&#31181;&#24369;&#24418;&#24335;&#30340;&#21069;&#32622;&#26465;&#20214;Pareto&#21407;&#21017;&#65288;&#21363;&#22914;&#26524;&#25277;&#31614;1&#23545;&#26576;&#20123;&#20010;&#20307;&#25552;&#20379;&#27604;&#25277;&#31614;2&#26356;&#22909;&#30340;&#21069;&#26223;&#65292;&#24182;&#19988;&#23545;&#25152;&#26377;&#20854;&#20182;&#20154;&#25552;&#20379;&#21516;&#26679;&#22909;&#30340;&#21069;&#26223;&#65292;&#21017;&#25277;&#31614;1&#23601;&#27604;&#25277;&#31614;2&#26356;&#22909;&#65289;&#12290;&#22312;&#38416;&#36848;&#20102;&#25105;&#20204;&#30340;&#32467;&#26524;&#21450;&#22522;&#20110;&#36825;&#20123;&#32467;&#26524;&#30340;&#35770;&#35777;&#20043;&#21518;&#65292;&#25105;&#20204;&#32771;&#34385;&#20102;&#26080;&#27861;&#27604;&#36739;&#24615;&#30340;&#25903;&#25345;&#32773;&#24212;&#35813;&#25298;&#32477;&#21738;&#20010;&#21407;&#21017;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.17641v1 Announce Type: new  Abstract: We provide a general argument against value incomparability, based on a new style of impossibility result. In particular, we show that, against plausible background assumptions, value incomparability creates an incompatibility between two very plausible principles for ranking lotteries: a weak ``negative dominance'' principle (to the effect that Lottery 1 can be better than Lottery 2 only if some possible outcome of Lottery 1 is better than some possible outcome of Lottery 2) and a weak form of ex ante Pareto (to the effect that, if Lottery 1 gives an unambiguously better prospect to some individuals than Lottery 2, and equally good prospects to everyone else, then Lottery 1 is better than Lottery 2). After spelling out our results, and the arguments based on them, we consider which principle the proponent of incomparability ought to reject.
&lt;/p&gt;</description></item><item><title>&#36825;&#31181;&#26041;&#27861;&#26159;&#21512;&#25104;&#25511;&#21046;&#26041;&#27861;&#30340;&#25913;&#36827;&#29256;&#26412;&#65292;&#20801;&#35768;&#22312;&#25424;&#36192;&#32773;&#32452;&#20013;&#21253;&#21547;&#30452;&#25509;&#25110;&#38388;&#25509;&#21463;&#24178;&#39044;&#30340;&#21333;&#20301;&#65292;&#29305;&#21035;&#36866;&#29992;&#20110;&#20855;&#26377;&#22810;&#20010;&#22788;&#29702;&#21333;&#20803;&#25110;&#25424;&#36192;&#32773;&#27744;&#20013;&#37096;&#20998;&#21333;&#20301;&#21487;&#33021;&#21463;&#21040;&#28322;&#20986;&#25928;&#24212;&#24433;&#21709;&#30340;&#24212;&#29992;&#12290;</title><link>https://arxiv.org/abs/2403.17624</link><description>&lt;p&gt;
&#21253;&#23481;&#24615;&#21512;&#25104;&#25511;&#21046;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
The inclusive Synthetic Control Method
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.17624
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31181;&#26041;&#27861;&#26159;&#21512;&#25104;&#25511;&#21046;&#26041;&#27861;&#30340;&#25913;&#36827;&#29256;&#26412;&#65292;&#20801;&#35768;&#22312;&#25424;&#36192;&#32773;&#32452;&#20013;&#21253;&#21547;&#30452;&#25509;&#25110;&#38388;&#25509;&#21463;&#24178;&#39044;&#30340;&#21333;&#20301;&#65292;&#29305;&#21035;&#36866;&#29992;&#20110;&#20855;&#26377;&#22810;&#20010;&#22788;&#29702;&#21333;&#20803;&#25110;&#25424;&#36192;&#32773;&#27744;&#20013;&#37096;&#20998;&#21333;&#20301;&#21487;&#33021;&#21463;&#21040;&#28322;&#20986;&#25928;&#24212;&#24433;&#21709;&#30340;&#24212;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#20171;&#32461;&#20102;&#21253;&#23481;&#24615;&#21512;&#25104;&#25511;&#21046;&#26041;&#27861;&#65288;iSCM&#65289;&#65292;&#36825;&#26159;&#21512;&#25104;&#25511;&#21046;&#26041;&#27861;&#30340;&#19968;&#31181;&#25913;&#36827;&#65292;&#20801;&#35768;&#23558;&#30452;&#25509;&#25110;&#38388;&#25509;&#21463;&#24178;&#39044;&#30340;&#21333;&#20803;&#21253;&#21547;&#22312;&#25424;&#36192;&#32773;&#32452;&#20013;&#12290;&#36825;&#31181;&#26041;&#27861;&#38750;&#24120;&#36866;&#29992;&#20110;&#20855;&#26377;&#22810;&#20010;&#22788;&#29702;&#21333;&#20803;&#25110;&#22312;&#25424;&#36192;&#32773;&#27744;&#20013;&#30340;&#19968;&#20123;&#21333;&#20301;&#21487;&#33021;&#21463;&#21040;&#28322;&#20986;&#25928;&#24212;&#24433;&#21709;&#30340;&#24212;&#29992;&#12290;&#25105;&#20204;&#30340;iSCM&#38750;&#24120;&#23481;&#26131;&#20351;&#29992;&#65292;&#21487;&#20197;&#20351;&#29992;&#22823;&#22810;&#25968;&#21512;&#25104;&#25511;&#21046;&#20272;&#35745;&#26041;&#27861;&#23454;&#29616;&#12290;&#20316;&#20026;&#19968;&#20010;&#35828;&#26126;&#24615;&#23454;&#35777;&#31034;&#20363;&#65292;&#25105;&#20204;&#37325;&#26032;&#20272;&#35745;&#20102;&#24503;&#22269;&#32479;&#19968;&#23545;&#20154;&#22343;GDP&#30340;&#22240;&#26524;&#25928;&#24212;&#65292;&#24182;&#32771;&#34385;&#20102;&#20174;&#35199;&#24503;&#21040;&#22885;&#22320;&#21033;&#30340;&#28322;&#20986;&#25928;&#24212;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.17624v1 Announce Type: new  Abstract: We introduce the inclusive synthetic control method (iSCM), a modification of synthetic control type methods that allows the inclusion of units potentially affected directly or indirectly by an intervention in the donor pool. This method is well suited for applications with either multiple treated units or in which some of the units in the donor pool might be affected by spillover effects. Our iSCM is very easy to implement using most synthetic control type estimators. As an illustrative empirical example, we re-estimate the causal effect of German reunification on GDP per capita allowing for spillover effects from West Germany to Austria.
&lt;/p&gt;</description></item><item><title>Pettis&#65288;1938&#65289;&#31215;&#20998;&#27010;&#24565;&#22312;&#22823;&#35268;&#27169;&#20154;&#21475;&#21338;&#24328;&#30340;&#30740;&#31350;&#20013;&#23637;&#29616;&#20102;&#23454;&#29992;&#24615;&#65292;&#32473;&#20986;&#20102;&#20851;&#20110;Pettis&#31215;&#20998;&#30340;&#20960;&#20010;&#32467;&#26524;&#21644;Fubini-like&#20132;&#25442;&#20844;&#24335;&#65292;&#20026;&#36125;&#21494;&#26031;&#21338;&#24328;&#25552;&#20379;&#20102;&#22343;&#34913;&#21807;&#19968;&#24615;&#30340;&#20805;&#20998;&#26465;&#20214;&#21644;moment constraints&#30340;&#20851;&#38190;&#24847;&#20041;&#12290;</title><link>https://arxiv.org/abs/2403.17605</link><description>&lt;p&gt;
&#20851;&#20110;Pettis&#31215;&#20998;&#26041;&#27861;&#22312;&#22823;&#35268;&#27169;&#20154;&#21475;&#21338;&#24328;&#20013;&#30340;&#24212;&#29992;
&lt;/p&gt;
&lt;p&gt;
On the Pettis Integral Approach to Large Population Games
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.17605
&lt;/p&gt;
&lt;p&gt;
Pettis&#65288;1938&#65289;&#31215;&#20998;&#27010;&#24565;&#22312;&#22823;&#35268;&#27169;&#20154;&#21475;&#21338;&#24328;&#30340;&#30740;&#31350;&#20013;&#23637;&#29616;&#20102;&#23454;&#29992;&#24615;&#65292;&#32473;&#20986;&#20102;&#20851;&#20110;Pettis&#31215;&#20998;&#30340;&#20960;&#20010;&#32467;&#26524;&#21644;Fubini-like&#20132;&#25442;&#20844;&#24335;&#65292;&#20026;&#36125;&#21494;&#26031;&#21338;&#24328;&#25552;&#20379;&#20102;&#22343;&#34913;&#21807;&#19968;&#24615;&#30340;&#20805;&#20998;&#26465;&#20214;&#21644;moment constraints&#30340;&#20851;&#38190;&#24847;&#20041;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22823;&#35268;&#27169;&#19981;&#23436;&#20840;&#20449;&#24687;&#20154;&#21475;&#32463;&#27982;&#23398;&#30340;&#20998;&#26512;&#36890;&#24120;&#28041;&#21450;&#25972;&#21512;&#19968;&#20010;&#38543;&#26426;&#21464;&#37327;&#36830;&#32493;&#35889;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;Pettis&#65288;1938&#65289;&#31215;&#20998;&#27010;&#24565;&#22312;&#30740;&#31350;&#36825;&#31867;&#27169;&#22411;&#20013;&#30340;&#23454;&#29992;&#24615;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#20851;&#20110;Pettis&#31215;&#20998;&#30340;&#20960;&#20010;&#32467;&#26524;&#65292;&#21253;&#25324;Pettis&#21487;&#31215;&#24615;&#30340;&#26041;&#20415;&#20805;&#20998;&#26465;&#20214;&#21644;&#31867;&#20284;Fubini&#30340;&#21487;&#20132;&#25442;&#20844;&#24335;&#65292;&#36890;&#36807;&#19968;&#20010;&#36816;&#34892;&#31034;&#20363;&#36827;&#34892;&#20102;&#35828;&#26126;&#12290;&#22312;&#36825;&#20123;&#22522;&#30784;&#19978;&#65292;&#25105;&#20204;&#23545;&#25317;&#26377;&#20219;&#24847;&#25968;&#37327;&#24322;&#36136;&#20195;&#29702;&#30340;&#36125;&#21494;&#26031;&#21338;&#24328;&#36827;&#34892;&#20102;&#32479;&#19968;&#20998;&#26512;&#12290;&#25105;&#20204;&#32473;&#20986;&#20102;&#20851;&#20110;&#25910;&#30410;&#32467;&#26500;&#30340;&#19968;&#20010;&#20805;&#20998;&#26465;&#20214;&#65292;&#35813;&#26465;&#20214;&#20445;&#35777;&#20102;&#22312;&#25152;&#26377;&#20449;&#21495;&#32467;&#26500;&#19979;&#22343;&#20855;&#26377;&#22343;&#34913;&#21807;&#19968;&#24615;&#12290;&#25105;&#20204;&#30340;&#26465;&#20214;&#26159;&#31616;&#26126;&#30340;&#65292;&#24403;&#25112;&#30053;&#20114;&#21160;&#26159;&#26080;&#21521;&#30340;&#26102;&#65292;&#23427;&#21464;&#24471;&#24517;&#35201;&#12290;&#25105;&#20204;&#36827;&#19968;&#27493;&#30830;&#23450;&#20102;&#23545;&#22343;&#34913;&#34892;&#21160;&#29366;&#24577;&#32852;&#21512;&#20998;&#24067;&#21152;&#20197;&#30340;&#30636;&#26102;&#38480;&#21046;&#65292;&#36825;&#23545;&#20449;&#24687;&#35774;&#35745;&#32773;&#20855;&#26377;&#20851;&#38190;&#24847;&#20041;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.17605v1 Announce Type: new  Abstract: The analysis of large population economies with incomplete information often entails the integration of a continuum of random variables. We showcase the usefulness of the integral notion \`a la Pettis (1938) to study such models. We present several results on Pettis integrals, including convenient sufficient conditions for Pettis integrability and Fubini-like exchangeability formulae, illustrated through a running example. Building on these foundations, we conduct a unified analysis of Bayesian games with arbitrarily many heterogeneous agents. We provide a sufficient condition on payoff structures, under which the equilibrium uniqueness is guaranteed across all signal structures. Our condition is parsimonious, as it turns out necessary when strategic interactions are undirected. We further identify the moment restrictions, imposed on the equilibrium action-state joint distribution, which have crucial implications for information designer
&lt;/p&gt;</description></item><item><title>&#36890;&#36807;&#25991;&#26412;&#25366;&#25496;&#21644;&#31038;&#20132;&#32593;&#32476;&#20998;&#26512;&#65292;&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#21019;&#26032;&#26041;&#27861;&#65292;&#20197;&#35780;&#20272;OM&#21644;SCM&#19987;&#19994;&#20154;&#21592;&#29305;&#23450;&#24515;&#29702;&#29305;&#36136;&#30340;&#24066;&#22330;&#38656;&#27714;&#12290;</title><link>https://arxiv.org/abs/2403.17546</link><description>&lt;p&gt;
&#35299;&#35835;&#21331;&#36234;&#65306;&#36890;&#36807;&#25991;&#26412;&#25366;&#25496;&#25581;&#31034;&#36816;&#33829;&#21644;&#20379;&#24212;&#38142;&#19987;&#19994;&#20154;&#21592;&#24515;&#29702;&#29305;&#36136;&#30340;&#38656;&#27714;
&lt;/p&gt;
&lt;p&gt;
Decoding excellence: Mapping the demand for psychological traits of operations and supply chain professionals through text mining
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.17546
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#25991;&#26412;&#25366;&#25496;&#21644;&#31038;&#20132;&#32593;&#32476;&#20998;&#26512;&#65292;&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#21019;&#26032;&#26041;&#27861;&#65292;&#20197;&#35780;&#20272;OM&#21644;SCM&#19987;&#19994;&#20154;&#21592;&#29305;&#23450;&#24515;&#29702;&#29305;&#36136;&#30340;&#24066;&#22330;&#38656;&#27714;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#21019;&#26032;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#25991;&#26412;&#25366;&#25496;&#21644;&#31038;&#20132;&#32593;&#32476;&#20998;&#26512;&#65292;&#23545;&#36816;&#33829;&#31649;&#29702;&#65288;OM&#65289;&#21644;&#20379;&#24212;&#38142;&#31649;&#29702;&#65288;SCM&#65289;&#19987;&#19994;&#20154;&#21592;&#30340;&#24515;&#29702;&#29305;&#36136;&#36827;&#34892;&#25551;&#36848;&#20998;&#26512;&#12290;&#35813;&#26041;&#27861;&#26088;&#22312;&#36890;&#36807;&#32467;&#21512;&#30456;&#20851;&#24515;&#29702;&#26500;&#24314;&#12289;&#25991;&#26412;&#25366;&#25496;&#25216;&#26415;&#21644;&#21019;&#26032;&#24230;&#37327;&#26041;&#27861;&#65292;&#21363;&#35821;&#20041;&#21697;&#29260;&#20998;&#25968;&#65292;&#35780;&#20272;&#29305;&#23450;&#29305;&#36136;&#30340;&#24066;&#22330;&#38656;&#27714;&#12290;&#25105;&#20204;&#23558;&#35813;&#26041;&#27861;&#24212;&#29992;&#20110;&#19968;&#32452;OM&#21644;SCM&#19987;&#19994;&#20154;&#21592;&#30340;&#32844;&#20301;&#25551;&#36848;&#25968;&#25454;&#38598;&#65292;&#26088;&#22312;&#25552;&#20379;&#20182;&#20204;&#30456;&#20851;&#25152;&#38656;&#25216;&#33021;&#30340;&#25551;&#36848;&#20998;&#24067;&#22270;&#65292;&#21253;&#25324;&#24515;&#29702;&#29305;&#24449;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.17546v1 Announce Type: new  Abstract: The current study proposes an innovative methodology for the profiling of psychological traits of Operations Management (OM) and Supply Chain Management (SCM) professionals. We use innovative methods and tools of text mining and social network analysis to map the demand for relevant skills from a set of job descriptions, with a focus on psychological characteristics. The proposed approach aims to evaluate the market demand for specific traits by combining relevant psychological constructs, text mining techniques, and an innovative measure, namely, the Semantic Brand Score. We apply the proposed methodology to a dataset of job descriptions for OM and SCM professionals, with the objective of providing a mapping of their relevant required skills, including psychological characteristics. In addition, the analysis is then detailed by considering the region of the organization that issues the job description, its organizational size, and the s
&lt;/p&gt;</description></item><item><title>&#30740;&#31350;&#20102;&#22312;&#35757;&#32451;&#21644;&#25512;&#29702;&#26399;&#38388;&#30340;&#39044;&#27979;&#20998;&#20139;&#26041;&#38754;&#30340;&#26032;&#39062;&#20043;&#22788;&#65292;&#24182;&#20171;&#32461;&#21644;&#31361;&#20986;&#20102;&#19981;&#21516;&#31867;&#22411;&#30340;&#25968;&#25454;&#20849;&#20139;&#21512;&#21516;&#12290;</title><link>https://arxiv.org/abs/2403.17515</link><description>&lt;p&gt;
&#35757;&#32451;&#21644;&#25512;&#29702;&#26399;&#38388;&#30340;&#39044;&#27979;&#20998;&#20139;
&lt;/p&gt;
&lt;p&gt;
Prediction-sharing During Training and Inference
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.17515
&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#20102;&#22312;&#35757;&#32451;&#21644;&#25512;&#29702;&#26399;&#38388;&#30340;&#39044;&#27979;&#20998;&#20139;&#26041;&#38754;&#30340;&#26032;&#39062;&#20043;&#22788;&#65292;&#24182;&#20171;&#32461;&#21644;&#31361;&#20986;&#20102;&#19981;&#21516;&#31867;&#22411;&#30340;&#25968;&#25454;&#20849;&#20139;&#21512;&#21516;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20004;&#23478;&#20844;&#21496;&#21442;&#19982;&#31454;&#20105;&#24615;&#39044;&#27979;&#20219;&#21153;&#12290;&#27599;&#23478;&#20844;&#21496;&#26377;&#20004;&#20010;&#25968;&#25454;&#26469;&#28304; -- &#26377;&#26631;&#31614;&#30340;&#21382;&#21490;&#25968;&#25454;&#21644;&#26080;&#26631;&#31614;&#30340;&#25512;&#29702;&#26102;&#38388;&#25968;&#25454; -- &#24182;&#19988;&#20351;&#29992;&#21069;&#32773;&#21046;&#23450;&#39044;&#27979;&#27169;&#22411;&#65292;&#20351;&#29992;&#21518;&#32773;&#23545;&#26032;&#23454;&#20363;&#36827;&#34892;&#39044;&#27979;&#12290;&#25105;&#20204;&#30740;&#31350;&#20102;&#20844;&#21496;&#20043;&#38388;&#30340;&#25968;&#25454;&#20849;&#20139;&#21512;&#21516;&#12290;&#25105;&#20204;&#30740;&#31350;&#30340;&#26032;&#39062;&#20043;&#22788;&#22312;&#20110;&#20171;&#32461;&#21644;&#31361;&#20986;&#20165;&#20998;&#20139;&#39044;&#27979;&#27169;&#22411;&#30340;&#21512;&#21516;&#12289;&#20165;&#20998;&#20139;&#25512;&#29702;&#26102;&#38388;&#39044;&#27979;&#30340;&#21512;&#21516;&#20197;&#21450;&#20998;&#20139;&#20004;&#32773;&#30340;&#21512;&#21516;&#20043;&#38388;&#30340;&#21306;&#21035;&#12290;&#25105;&#20204;&#30340;&#20998;&#26512;&#20998;&#20026;&#19977;&#20010;&#23618;&#38754;&#12290;&#39318;&#20808;&#65292;&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#20010;&#20415;&#20110;&#36827;&#34892;&#30740;&#31350;&#30340;&#19968;&#33324;&#36125;&#21494;&#26031;&#26694;&#26550;&#12290;&#20854;&#27425;&#65292;&#25105;&#20204;&#23558;&#28966;&#28857;&#32553;&#23567;&#21040;&#36825;&#20010;&#26694;&#26550;&#20869;&#30340;&#20004;&#20010;&#33258;&#28982;&#35774;&#32622;&#65306;(i) &#27599;&#23478;&#20844;&#21496;&#30340;&#39044;&#27979;&#27169;&#22411;&#20934;&#30830;&#24230;&#26159;&#20849;&#30693;&#30340;&#65292;&#20294;&#21508;&#33258;&#27169;&#22411;&#20043;&#38388;&#30340;&#30456;&#20851;&#24615;&#26410;&#30693;&#65307;(ii) &#23384;&#22312;&#20004;&#20010;&#20851;&#20110;&#26368;&#20248;&#39044;&#27979;&#22120;&#30340;&#20551;&#35774;&#65292;&#20854;&#20013;&#19968;&#20010;&#26159;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.17515v1 Announce Type: cross  Abstract: Two firms are engaged in a competitive prediction task. Each firm has two sources of data -- labeled historical data and unlabeled inference-time data -- and uses the former to derive a prediction model, and the latter to make predictions on new instances. We study data-sharing contracts between the firms. The novelty of our study is to introduce and highlight the differences between contracts that share prediction models only, contracts to share inference-time predictions only, and contracts to share both. Our analysis proceeds on three levels. First, we develop a general Bayesian framework that facilitates our study. Second, we narrow our focus to two natural settings within this framework: (i) a setting in which the accuracy of each firm's prediction model is common knowledge, but the correlation between the respective models is unknown; and (ii) a setting in which two hypotheses exist regarding the optimal predictor, and one of the
&lt;/p&gt;</description></item><item><title>&#24503;&#22269;&#24341;&#20837;&#22269;&#23478;&#26368;&#20302;&#24037;&#36164;&#21518;&#65292;&#21457;&#29616;&#26368;&#20302;&#24037;&#36164;&#26174;&#33879;&#38477;&#20302;&#20102;&#24037;&#36164;&#30340;&#19981;&#24179;&#31561;&#24615;&#65292;&#23545;&#24037;&#20316;&#26102;&#38388;&#25972;&#20307;&#24433;&#21709;&#19981;&#22823;&#65292;&#20294;&#23545;&#36855;&#20320;&#24037;&#20316;&#20154;&#21592;&#30340;&#24037;&#20316;&#26102;&#38388;&#26377;&#26174;&#33879;&#20943;&#23569;&#65292;&#24182;&#23548;&#33268;&#36855;&#20320;&#24037;&#20316;&#23703;&#20301;&#26126;&#26174;&#20943;&#23569;&#65292;&#37096;&#20998;&#36716;&#21521;&#26222;&#36890;&#23601;&#19994;&#21644;&#38750;&#23601;&#19994;&#12290;</title><link>https://arxiv.org/abs/2403.17206</link><description>&lt;p&gt;
&#32454;&#33410;&#20915;&#23450;&#25104;&#36133;&#65306;&#24503;&#22269;&#26368;&#20302;&#24037;&#36164;&#23545;&#24037;&#20316;&#26102;&#38388;&#21644;&#36855;&#20320;&#24037;&#20316;&#30340;&#24322;&#36136;&#24433;&#21709;
&lt;/p&gt;
&lt;p&gt;
The Devil is in the Details: Heterogeneous Effects of the German Minimum Wage on Working Hours and Minijobs
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.17206
&lt;/p&gt;
&lt;p&gt;
&#24503;&#22269;&#24341;&#20837;&#22269;&#23478;&#26368;&#20302;&#24037;&#36164;&#21518;&#65292;&#21457;&#29616;&#26368;&#20302;&#24037;&#36164;&#26174;&#33879;&#38477;&#20302;&#20102;&#24037;&#36164;&#30340;&#19981;&#24179;&#31561;&#24615;&#65292;&#23545;&#24037;&#20316;&#26102;&#38388;&#25972;&#20307;&#24433;&#21709;&#19981;&#22823;&#65292;&#20294;&#23545;&#36855;&#20320;&#24037;&#20316;&#20154;&#21592;&#30340;&#24037;&#20316;&#26102;&#38388;&#26377;&#26174;&#33879;&#20943;&#23569;&#65292;&#24182;&#23548;&#33268;&#36855;&#20320;&#24037;&#20316;&#23703;&#20301;&#26126;&#26174;&#20943;&#23569;&#65292;&#37096;&#20998;&#36716;&#21521;&#26222;&#36890;&#23601;&#19994;&#21644;&#38750;&#23601;&#19994;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
2015&#24180;&#65292;&#24503;&#22269;&#24341;&#20837;&#20102;&#22269;&#23478;&#26368;&#20302;&#24037;&#36164;&#26631;&#20934;&#12290;&#34429;&#28982;&#25991;&#29486;&#26222;&#36941;&#35748;&#20026;&#23545;&#25972;&#20307;&#23601;&#19994;&#27700;&#24179;&#30340;&#36127;&#38754;&#24433;&#21709;&#33267;&#22810;&#24456;&#26377;&#38480;&#65292;&#20294;&#25105;&#20204;&#28145;&#20837;&#32454;&#33410;&#20998;&#26512;&#20102;&#23545;&#24037;&#20316;&#26102;&#38388;&#32500;&#24230;&#21644;&#36855;&#20320;&#24037;&#20316;&#23376;&#38598;&#30340;&#24433;&#21709;&#12290;&#21033;&#29992;2010&#24180;&#12289;2014&#24180;&#21644;2018&#24180;&#24503;&#22269;&#25910;&#20837;&#32467;&#26500;&#35843;&#26597;&#30340;&#25968;&#25454;&#65292;&#25105;&#20204;&#25214;&#21040;&#20102;&#23454;&#35777;&#35777;&#25454;&#34920;&#26126;&#26368;&#20302;&#24037;&#36164;&#26174;&#33879;&#38477;&#20302;&#20102;&#23567;&#26102;&#24037;&#36164;&#21644;&#26376;&#24037;&#36164;&#30340;&#19981;&#24179;&#31561;&#12290;&#34429;&#28982;&#21508;&#31181;&#29702;&#35770;&#26426;&#21046;&#24314;&#35758;&#24037;&#20316;&#26102;&#38388;&#20250;&#20943;&#23569;&#65292;&#20294;&#22312;&#24179;&#22343;&#27700;&#24179;&#19978;&#20173;&#28982;&#20445;&#25345;&#19981;&#21464;&#12290;&#28982;&#32780;&#65292;&#36855;&#20320;&#24037;&#20316;&#20154;&#21592;&#30340;&#24037;&#20316;&#26102;&#38388;&#26126;&#26174;&#20943;&#23569;&#65292;&#36825;&#21487;&#20197;&#19982;&#29305;&#23450;&#30340;&#21046;&#24230;&#26694;&#26550;&#32852;&#31995;&#36215;&#26469;&#12290;&#20851;&#20110;&#23601;&#19994;&#65292;&#32467;&#26524;&#34920;&#26126;&#26222;&#36890;&#24037;&#20316;&#27809;&#26377;&#24433;&#21709;&#65292;&#20294;&#36855;&#20320;&#24037;&#20316;&#26126;&#26174;&#20943;&#23569;&#65292;&#36825;&#26159;&#30001;&#20110;&#21521;&#26222;&#36890;&#23601;&#19994;&#21644;&#38750;&#23601;&#19994;&#30340;&#36716;&#21464;&#25152;&#39537;&#21160;&#30340;&#12290;&#38750;&#23601;&#19994;&#30340;&#36716;&#21464;&#24847;&#21619;&#30528;&#23601;&#19994;&#30340;&#24037;&#36164;&#24377;&#24615;&#20026;-0.1&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.17206v1 Announce Type: new  Abstract: In 2015, Germany introduced a national minimum wage. While the literature agrees on at most limited negative effects on the overall employment level, we go into detail and analyze the impact on the working hours dimension and on the subset of minijobs. Using data from the German Structure of Earnings Survey in 2010, 2014, and 2018, we find empirical evidence that the minimum wage significantly reduces inequality in hourly and monthly wages. While various theoretical mechanisms suggest a reduction in working hours, these remain unchanged on average. However, minijobbers experience a notable reduction in working hours which can be linked to the specific institutional framework. Regarding employment, the results show no effects for regular jobs, but there is a noteworthy decline in minijobs, driven by transitions to regular employment and non-employment. The transitions in non-employment imply a wage elasticity of employment of $-0.1$ for m
&lt;/p&gt;</description></item><item><title>&#25552;&#20986;&#20102;&#38024;&#23545;&#24037;&#19994;&#35774;&#26045;&#38598;&#32676;&#30340;CO2&#25429;&#38598;&#12289;&#36755;&#36865;&#21644;&#20648;&#23384;&#31995;&#32479;&#35774;&#35745;&#26041;&#27861;&#21644;&#35265;&#35299;&#65292;&#24212;&#29992;&#21040;&#36335;&#26131;&#26031;&#23433;&#37027;&#24030;&#20272;&#35745;&#26368;&#22810;&#21487;&#25429;&#38598; 50 &#30334;&#19975; tCO2/y &#30340;&#24037;&#19994;&#25490;&#25918;&#65292;&#24182;&#19988;&#25104;&#26412;&#19981;&#21040;&#27599;&#21544;100&#32654;&#20803;</title><link>https://arxiv.org/abs/2403.17162</link><description>&lt;p&gt;
&#24037;&#19994;CO2&#25429;&#38598;&#12289;&#36755;&#36865;&#21644;&#20648;&#23384;&#31995;&#32479;&#30340;&#35774;&#35745;&#35265;&#35299;
&lt;/p&gt;
&lt;p&gt;
Design Insights for Industrial CO2 Capture, Transport, and Storage Systems
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.17162
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#38024;&#23545;&#24037;&#19994;&#35774;&#26045;&#38598;&#32676;&#30340;CO2&#25429;&#38598;&#12289;&#36755;&#36865;&#21644;&#20648;&#23384;&#31995;&#32479;&#35774;&#35745;&#26041;&#27861;&#21644;&#35265;&#35299;&#65292;&#24212;&#29992;&#21040;&#36335;&#26131;&#26031;&#23433;&#37027;&#24030;&#20272;&#35745;&#26368;&#22810;&#21487;&#25429;&#38598; 50 &#30334;&#19975; tCO2/y &#30340;&#24037;&#19994;&#25490;&#25918;&#65292;&#24182;&#19988;&#25104;&#26412;&#19981;&#21040;&#27599;&#21544;100&#32654;&#20803;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#38024;&#23545;&#24037;&#19994;&#35774;&#26045;&#38598;&#32676;&#30340;CO2&#25429;&#38598;&#12289;&#36755;&#36865;&#21644;&#20648;&#23384;&#31995;&#32479;&#30340;&#35774;&#35745;&#26041;&#27861;&#21644;&#35265;&#35299;&#65292;&#20197;&#36335;&#26131;&#26031;&#23433;&#37027;&#24030;&#20026;&#26696;&#20363;&#30740;&#31350;&#37325;&#28857;&#12290;&#25105;&#20204;&#30340;&#20998;&#26512;&#26694;&#26550;&#21253;&#25324;&#65306;(1)&#35780;&#20272;&#21333;&#20010;&#35774;&#26045;&#21487;&#25429;&#38598;&#30340;CO2&#25490;&#25918;&#35268;&#27169;&#21644;&#27987;&#24230;&#65292;&#20197;&#20272;&#31639;CO2&#25429;&#38598;&#25913;&#36896;&#30340;&#25104;&#26412;&#65292;(2)&#31579;&#36873;&#26041;&#27861;&#29992;&#20110;&#30830;&#23450;&#28508;&#22312;&#30340;CO2&#20648;&#23384;&#22320;&#28857;&#24182;&#20272;&#31639;&#20854;&#20648;&#23384;&#33021;&#21147;&#12289;&#27880;&#20837;&#36895;&#24230;&#21644;&#25104;&#26412;&#65307;&#20197;&#21450;(3)&#19968;&#31181;&#20197;&#25104;&#26412;&#26368;&#23567;&#21270;&#20026;&#30446;&#26631;&#30340;&#31649;&#36947;&#22522;&#30784;&#35774;&#26045;&#35774;&#35745;&#26041;&#27861;&#65292;&#36830;&#25509;CO2&#25429;&#38598;&#24037;&#21378;&#21644;&#20648;&#23384;&#22320;&#28857;&#65292;&#32771;&#34385;&#22303;&#22320;&#21033;&#29992;&#27169;&#24335;&#12289;&#29616;&#26377;&#36890;&#34892;&#26435;&#12289;&#20154;&#21475;&#32479;&#35745;&#25968;&#25454;&#20197;&#21450;&#21508;&#31181;&#31038;&#20250;&#21644;&#29615;&#22659;&#20844;&#27491;&#22240;&#32032;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.17162v1 Announce Type: new  Abstract: We present design methods and insights for CO2 capture, transport, and storage systems for clusters of industrial facilities, with a case-study focus on the state of Louisiana. Our analytical framework includes: (1) evaluating the scale and concentration of capturable CO2 emissions at individual facilities for the purpose of estimating the cost of CO2 capture retrofits, (2) a screening method to identify potential CO2 storage sites and estimate their storage capacities, injectivities, and costs; and (3) an approach for cost-minimized design of pipeline infrastructure connecting CO2 capture plants with storage sites that considers land use patterns, existing rights-of-way, demographics, and a variety of social and environmental justice factors. In applying our framework to Louisiana, we estimate up to 50 million tCO2/y of industrial emissions (out of today's total emissions of 130 MtCO2/y) can be captured at under 100 USD/tCO2, and up to 
&lt;/p&gt;</description></item><item><title>PMUY&#23545;&#21360;&#24230;&#36139;&#22256;&#23478;&#24237;&#30340;LPG&#33719;&#21462;&#26377;&#30528;2.1&#20010;&#30334;&#20998;&#28857;&#30340;&#25552;&#21319;&#65292;&#21516;&#26102;&#22312;&#19981;&#21516;&#22320;&#21306;&#21644;&#31038;&#20250;&#32676;&#20307;&#20043;&#38388;&#23384;&#22312;&#24046;&#24322;&#24433;&#21709;&#65292;&#38656;&#35201;&#25919;&#31574;&#24378;&#35843;&#26377;&#38024;&#23545;&#24615;&#30340;&#24178;&#39044;&#25514;&#26045;&#12290;</title><link>https://arxiv.org/abs/2403.17112</link><description>&lt;p&gt;
&#21360;&#24230;&#23478;&#24237;&#26222;&#25289;&#24503;&#27721;&#26364;&#29305;&#37324;&#20044;&#36158;&#25289;&#35745;&#21010;&#30340;&#24433;&#21709;
&lt;/p&gt;
&lt;p&gt;
The Impact of Pradhan Mantri Ujjwala Yojana on Indian Households
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.17112
&lt;/p&gt;
&lt;p&gt;
PMUY&#23545;&#21360;&#24230;&#36139;&#22256;&#23478;&#24237;&#30340;LPG&#33719;&#21462;&#26377;&#30528;2.1&#20010;&#30334;&#20998;&#28857;&#30340;&#25552;&#21319;&#65292;&#21516;&#26102;&#22312;&#19981;&#21516;&#22320;&#21306;&#21644;&#31038;&#20250;&#32676;&#20307;&#20043;&#38388;&#23384;&#22312;&#24046;&#24322;&#24433;&#21709;&#65292;&#38656;&#35201;&#25919;&#31574;&#24378;&#35843;&#26377;&#38024;&#23545;&#24615;&#30340;&#24178;&#39044;&#25514;&#26045;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#30740;&#31350;&#23545;&#26222;&#25289;&#24503;&#27721;&#26364;&#29305;&#37324;&#20044;&#36158;&#25289;&#35745;&#21010;&#65288;PMUY&#65289;&#23545;&#21360;&#24230;&#36139;&#22256;&#23478;&#24237;LPG&#33719;&#21462;&#30340;&#24433;&#21709;&#36827;&#34892;&#20102;&#25209;&#21028;&#24615;&#35780;&#20272;&#12290;&#21033;&#29992;&#20542;&#21521;&#24471;&#20998;&#21305;&#37197;&#21644;&#21452;&#37325;&#24046;&#20998;&#20272;&#35745;&#22120;&#20197;&#21450;&#22269;&#23478;&#23478;&#24237;&#20581;&#24247;&#35843;&#26597;&#65288;NFHS&#65289;&#25968;&#25454;&#38598;&#65292;&#30740;&#31350;&#21457;&#29616;&#23454;&#26045;PMUY&#21518;&#65292;&#21463;&#35797;&#32773;&#30340;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#22312;LPG&#28040;&#36153;&#19978;&#22686;&#21152;&#20102;2.1&#20010;&#30334;&#20998;&#28857;&#65292;&#21516;&#26102;&#28779;&#26612;&#28040;&#36153;&#20943;&#23569;&#12290;&#21306;&#22495;&#20998;&#26512;&#26174;&#31034;&#19981;&#21516;&#30340;&#24433;&#21709;&#65292;&#21271;&#37096;&#12289;&#35199;&#37096;&#21644;&#21335;&#37096;&#21462;&#24471;&#20102;&#26174;&#33879;&#36827;&#23637;&#65292;&#20294;&#19996;&#37096;&#21644;&#19996;&#21271;&#37096;&#30340;&#24433;&#21709;&#19981;&#37027;&#20040;&#26126;&#26174;&#12290;&#30740;&#31350;&#36824;&#24378;&#35843;&#20102;&#19981;&#21516;&#31038;&#20250;&#32676;&#20307;&#20043;&#38388;&#30340;&#24046;&#24322;&#65292;&#34920;&#26126;&#26368;&#26174;&#33879;&#30340;&#22909;&#22788;&#26159;&#30001;&#31038;&#20250;&#38454;&#23618;&#23478;&#24237;&#33719;&#24471;&#30340;&#65292;&#32780;&#37096;&#33853;&#23478;&#24237;&#20960;&#20046;&#27809;&#26377;&#21463;&#21040;&#24433;&#21709;&#12290;&#23613;&#31649;PMUY&#22312;&#20419;&#36827;LPG&#33719;&#21462;&#26041;&#38754;&#21462;&#24471;&#20102;&#21021;&#27493;&#25104;&#21151;&#65292;&#20294;&#32500;&#25345;&#20854;&#20351;&#29992;&#20173;&#28982;&#20855;&#26377;&#25361;&#25112;&#24615;&#12290;&#25919;&#31574;&#24212;&#24378;&#35843;&#26377;&#38024;&#23545;&#24615;&#30340;&#24178;&#39044;&#25514;&#26045;&#65292;&#22686;&#21152;&#25910;&#20837;&#25903;&#25345;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.17112v1 Announce Type: new  Abstract: This study critically evaluates the impact of the Pradhan Mantri Ujjwala Yojana (PMUY) on LPG accessibility among poor households in India. Using Propensity Score Matching and Difference-in-Differences estimators and the National Family Health Survey (NFHS) dataset, the Average Treatment Effect on the interdedly Treated is a modest 2.1 percentage point increase in LPG consumption due to PMUY, with a parallel decrease in firewood consumption. Regional analysis reveals differential impacts, with significant progress in the North, West, and South but less pronounced effects in the East and North East. The study also underscores variance across social groups, with Schedule Caste households showing the most substantial benefits, while Scheduled Tribes households are hardly affected. Despite the PMUY's initial success in facilitating LPG access, sustaining its usage remains challenging. Policy should emphasise targeted interventions, income su
&lt;/p&gt;</description></item><item><title>&#36890;&#36807;&#27604;&#36739;&#27599;&#23478;&#20844;&#21496;&#30340;&#31995;&#32479;&#37325;&#35201;&#24615;&#21644;&#20108;&#27687;&#21270;&#30899;&#25490;&#25918;&#37327;&#65292;&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#26368;&#20248;&#30340;&#20943;&#25490;&#31574;&#30053;&#65292;&#20026;&#23454;&#29616;20%&#20943;&#25490;&#30446;&#26631;&#25552;&#20379;&#20102;&#20943;&#23569;&#23601;&#19994;&#21644;&#32463;&#27982;&#25439;&#22833;&#30340;&#35299;&#20915;&#26041;&#26696;&#12290;</title><link>https://arxiv.org/abs/2302.08987</link><description>&lt;p&gt;
&#20943;&#23569;&#33073;&#30899;&#22833;&#19994;&#21644;&#32463;&#27982;&#25439;&#22833;&#30340;&#20225;&#19994;&#32423;&#20379;&#24212;&#38142;
&lt;/p&gt;
&lt;p&gt;
Firm-level supply chains to minimize decarbonization unemployment and economic losses
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2302.08987
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#27604;&#36739;&#27599;&#23478;&#20844;&#21496;&#30340;&#31995;&#32479;&#37325;&#35201;&#24615;&#21644;&#20108;&#27687;&#21270;&#30899;&#25490;&#25918;&#37327;&#65292;&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#26368;&#20248;&#30340;&#20943;&#25490;&#31574;&#30053;&#65292;&#20026;&#23454;&#29616;20%&#20943;&#25490;&#30446;&#26631;&#25552;&#20379;&#20102;&#20943;&#23569;&#23601;&#19994;&#21644;&#32463;&#27982;&#25439;&#22833;&#30340;&#35299;&#20915;&#26041;&#26696;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24613;&#38656;&#20943;&#23569;&#30899;&#25490;&#25918;&#21487;&#33021;&#23548;&#33268;&#20005;&#26684;&#30340;&#21629;&#20196;&#19982;&#25511;&#21046;&#33073;&#30899;&#31574;&#30053;&#65292;&#21487;&#33021;&#24102;&#26469;&#36127;&#38754;&#32463;&#27982;&#21518;&#26524;&#12290;&#26412;&#25991;&#20998;&#26512;&#20102;&#27431;&#27954;&#32463;&#27982;&#30340;&#25972;&#20307;&#20225;&#19994;&#32423;&#29983;&#20135;&#32593;&#32476;&#65292;&#25506;&#35752;&#20102;&#22914;&#20309;&#36991;&#20813;&#36825;&#20123;&#26041;&#27861;&#30340;&#26368;&#22351;&#32467;&#26524;&#12290;&#25105;&#20204;&#27604;&#36739;&#20102;&#27599;&#23478;&#20844;&#21496;&#30340;&#31995;&#32479;&#37325;&#35201;&#24615;&#21644;&#20854;&#24180;&#20108;&#27687;&#21270;&#30899;&#25490;&#25918;&#37327;&#65292;&#20197;&#30830;&#23450;&#20855;&#26377;&#26368;&#23567;&#39069;&#22806;&#22833;&#19994;&#21644;&#32463;&#27982;&#25439;&#22833;&#30340;&#26368;&#20339;&#20943;&#25490;&#31574;&#30053;&#12290;&#25105;&#20204;&#35774;&#23450;&#20102;&#29305;&#23450;&#30340;&#20943;&#25490;&#30446;&#26631;&#65292;&#30740;&#31350;&#20102;&#21508;&#31181;&#33073;&#30899;&#24773;&#26223;&#24182;&#37327;&#21270;&#20102;&#23427;&#20204;&#30340;&#32463;&#27982;&#21518;&#26524;&#12290;&#25105;&#20204;&#34920;&#26126;&#65292;&#23545;&#20110;&#20943;&#25490;20&#65285;&#65292;&#26368;&#26377;&#25928;&#30340;&#31574;&#30053;&#23548;&#33268;&#32422;2&#65285;&#30340;&#23601;&#19994;&#23703;&#20301;&#25439;&#22833;&#21644;2&#65285;&#30340;&#32463;&#27982;&#20135;&#20986;&#25439;&#22833;&#12290;&#30456;&#27604;&#20043;&#19979;&#65292;&#38024;&#23545;&#26368;&#22823;&#25490;&#25918;&#20225;&#19994;&#30340;&#26420;&#32032;&#24773;&#26223;&#65292;&#30456;&#21516;&#30446;&#26631;&#20250;&#23548;&#33268;28&#65285;&#30340;&#22833;&#19994;&#29575;&#21644;33&#65285;&#30340;&#20135;&#20986;&#20943;&#23569;&#12290;&#36825;&#34920;&#26126;&#21487;&#20197;&#20351;&#29992;&#20225;&#19994;&#32423;&#29983;&#20135;&#26041;&#24335;&#26469;&#23454;&#29616;&#33073;&#30899;&#30446;&#26631;&#65292;&#32780;&#19981;&#20250;&#24102;&#26469;&#36807;&#24230;&#30340;&#32463;&#27982;&#25439;&#22833;&#21644;&#22833;&#19994;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2302.08987v2 Announce Type: replace  Abstract: Urgently needed carbon emission reductions might lead to strict command-and-control decarbonization strategies with potentially negative economic consequences. Analyzing the entire firm-level production network of a European economy, we explore how the worst outcomes of such approaches can be avoided. We compare the systemic relevance of every firm with its annual CO2 emissions to identify optimal emission-reducing strategies with a minimum of additional unemployment and economic losses. Setting specific reduction targets we study various decarbonization scenarios and quantify their economic consequences. We show that for an emission-reduction of 20% the most effective strategy leads to losses of about 2% of jobs and 2% of economic output. In contrast, a naive scenario targeting largest emitters first, results in 28% job losses and 33% output reduction for the same target. This demonstrates that it is possible to use firm-level produ
&lt;/p&gt;</description></item><item><title>&#25552;&#20986;&#23616;&#37096;&#38543;&#26426;&#21270;&#24605;&#24819;&#20316;&#20026;&#26367;&#20195;&#22238;&#24402;&#26029;&#28857;&#27010;&#24565;&#26694;&#26550;&#65292;&#24182;&#22312;&#22810;&#20010;&#26041;&#21521;&#19978;&#25299;&#23637;&#20102;&#26631;&#20934;&#30340;Sharp RD&#35774;&#35745;&#12290;</title><link>https://arxiv.org/abs/2301.08958</link><description>&lt;p&gt;
&#12298;&#22238;&#24402;&#26029;&#28857;&#35774;&#35745;&#23454;&#36341;&#23548;&#35770;&#65306;&#25299;&#23637;&#31687;&#12299;
&lt;/p&gt;
&lt;p&gt;
A Practical Introduction to Regression Discontinuity Designs: Extensions
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2301.08958
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#23616;&#37096;&#38543;&#26426;&#21270;&#24605;&#24819;&#20316;&#20026;&#26367;&#20195;&#22238;&#24402;&#26029;&#28857;&#27010;&#24565;&#26694;&#26550;&#65292;&#24182;&#22312;&#22810;&#20010;&#26041;&#21521;&#19978;&#25299;&#23637;&#20102;&#26631;&#20934;&#30340;Sharp RD&#35774;&#35745;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#19987;&#33879;&#36830;&#21516;&#20854;&#20276;&#38543;&#30340;&#31532;&#19968;&#37096;&#20998; Cattaneo, Idrobo &#21644; Titiunik (2020) &#27719;&#32534;&#21644;&#25193;&#23637;&#20102;&#25105;&#20204;&#20026; 2014 &#24180;&#33267; 2023 &#24180;&#38388;&#35762;&#25480;&#30340;50&#22810;&#20010;&#20851;&#20110;&#22238;&#24402;&#26029;&#28857;(RD)&#26041;&#27861;&#35770;&#30340;&#30701;&#26399;&#35838;&#31243;&#21644;&#24037;&#20316;&#22346;&#20934;&#22791;&#30340;&#25945;&#23398;&#26448;&#26009;&#12290;&#22312;&#26412;&#31532;&#20108;&#37096;&#19987;&#33879;&#20013;&#65292;&#25105;&#20204;&#35752;&#35770;&#20102;&#20960;&#20010;&#22312; RD &#26041;&#27861;&#35770;&#20013;&#24314;&#31435;&#22312;&#21644;&#25193;&#23637;&#33258; Cattaneo, Idrobo &#21644; Titiunik (2020) &#20013;&#24341;&#20837;&#30340; RD &#35774;&#35745;&#20998;&#26512;&#22522;&#30784;&#20043;&#19978;&#30340;&#20027;&#39064;&#12290;&#25105;&#20204;&#30340;&#31532;&#19968;&#20010;&#30446;&#26631;&#26159;&#25552;&#20986;&#19968;&#20010;&#22522;&#20110;&#23616;&#37096;&#38543;&#26426;&#21270;&#24605;&#24819;&#30340;&#26367;&#20195; RD &#27010;&#24565;&#26694;&#26550;&#12290;&#36825;&#31181;&#26041;&#27861;&#35770;&#26041;&#27861;&#23545;&#20110;&#20855;&#26377;&#31163;&#25955;&#20998;&#20540;&#24471;&#20998;&#30340; RD &#35774;&#35745;&#21487;&#33021;&#26377;&#29992;&#65292;&#24182;&#19988;&#22312;&#20854;&#20182;&#29615;&#22659;&#20013;&#20063;&#21487;&#20197;&#20316;&#20026;&#36830;&#32493;&#24615;&#26041;&#27861;&#30340;&#34917;&#20805;&#26356;&#24191;&#27867;&#22320;&#20351;&#29992;&#12290;&#28982;&#21518;&#65292;&#24212;&#29992;&#36830;&#32493;&#24615;&#21644;&#23616;&#37096;&#38543;&#26426;&#21270;&#26041;&#27861;&#65292;&#25105;&#20204;&#22312;&#22810;&#20010;&#26041;&#21521;&#19978;&#25299;&#23637;&#20102;&#26631;&#20934;&#30340; Sharp RD &#35774;&#35745;&#65306;&#27169;&#31946; RD &#35774;&#35745;&#65292;&#21547;&#31163;&#25955;&#20998;&#25968;&#30340; RD &#35774;&#35745;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2301.08958v2 Announce Type: replace-cross  Abstract: This monograph, together with its accompanying first part Cattaneo, Idrobo and Titiunik (2020), collects and expands the instructional materials we prepared for more than $50$ short courses and workshops on Regression Discontinuity (RD) methodology that we taught between 2014 and 2023. In this second monograph, we discuss several topics in RD methodology that build on and extend the analysis of RD designs introduced in Cattaneo, Idrobo and Titiunik (2020). Our first goal is to present an alternative RD conceptual framework based on local randomization ideas. This methodological approach can be useful in RD designs with discretely-valued scores, and can also be used more broadly as a complement to the continuity-based approach in other settings. Then, employing both continuity-based and local randomization approaches, we extend the canonical Sharp RD design in multiple directions: fuzzy RD designs, RD designs with discrete score
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#20174;&#29702;&#35770;&#19978;&#35780;&#20272;&#20102;&#23454;&#35777;&#37329;&#34701;&#21644;&#35745;&#37327;&#32463;&#27982;&#23398;&#30740;&#31350;&#20013;&#24120;&#29992;&#30340;&#31185;&#23398;&#28436;&#32462;&#21644;&#22240;&#26524;&#25512;&#26029;&#26041;&#27861;&#30340;&#23616;&#38480;&#24615;&#65292;&#25552;&#20986;&#20102;&#22312;&#36164;&#26412;&#24066;&#22330;&#31561;&#33258;&#25105;&#21442;&#29031;&#21644;&#24320;&#25918;&#31995;&#32479;&#20013;&#21333;&#21521;&#22240;&#26524;&#20851;&#31995;&#30340;&#35266;&#28857;&#21487;&#33021;&#23384;&#22312;&#30340;&#38382;&#39064;&#65292;&#24182;&#21628;&#21505;&#26356;&#20840;&#38754;&#22320;&#35748;&#35782;&#23454;&#35777;&#37329;&#34701;&#30740;&#31350;&#21450;&#20854;&#20013;&#30340;&#39118;&#38505;&#12290;</title><link>http://arxiv.org/abs/2311.16570</link><description>&lt;p&gt;
&#32463;&#39564;&#37329;&#34701;&#30340;&#35748;&#35782;&#35770;&#38480;&#21046;&#65306;&#22240;&#26524;&#38477;&#35299;&#35770;&#21644;&#33258;&#25105;&#21442;&#29031;
&lt;/p&gt;
&lt;p&gt;
Epistemic Limits of Empirical Finance: Causal Reductionism and Self-Reference. (arXiv:2311.16570v3 [q-fin.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2311.16570
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#20174;&#29702;&#35770;&#19978;&#35780;&#20272;&#20102;&#23454;&#35777;&#37329;&#34701;&#21644;&#35745;&#37327;&#32463;&#27982;&#23398;&#30740;&#31350;&#20013;&#24120;&#29992;&#30340;&#31185;&#23398;&#28436;&#32462;&#21644;&#22240;&#26524;&#25512;&#26029;&#26041;&#27861;&#30340;&#23616;&#38480;&#24615;&#65292;&#25552;&#20986;&#20102;&#22312;&#36164;&#26412;&#24066;&#22330;&#31561;&#33258;&#25105;&#21442;&#29031;&#21644;&#24320;&#25918;&#31995;&#32479;&#20013;&#21333;&#21521;&#22240;&#26524;&#20851;&#31995;&#30340;&#35266;&#28857;&#21487;&#33021;&#23384;&#22312;&#30340;&#38382;&#39064;&#65292;&#24182;&#21628;&#21505;&#26356;&#20840;&#38754;&#22320;&#35748;&#35782;&#23454;&#35777;&#37329;&#34701;&#30740;&#31350;&#21450;&#20854;&#20013;&#30340;&#39118;&#38505;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#36164;&#26412;&#24066;&#22330;&#31561;&#33258;&#25105;&#21442;&#29031;&#21644;&#24320;&#25918;&#31995;&#32479;&#20013;&#65292;&#23545;&#20110;&#22240;&#26524;&#38477;&#35299;&#22312;&#30740;&#31350;&#20013;&#30340;&#21628;&#22768;&#26085;&#30410;&#39640;&#28072;&#12290;&#28982;&#32780;&#65292;&#22312;&#36825;&#26679;&#30340;&#31995;&#32479;&#20013;&#65292;&#21333;&#21521;&#22240;&#26524;&#20851;&#31995;&#30340;&#27010;&#24565;&#22312;&#26368;&#22909;&#30340;&#24773;&#20917;&#19979;&#21487;&#33021;&#26159;&#26377;&#38480;&#21046;&#30340;&#65292;&#22312;&#26368;&#22351;&#30340;&#24773;&#20917;&#19979;&#21487;&#33021;&#26159;&#19981;&#31283;&#23450;&#25110;&#33618;&#35884;&#30340;&#12290;&#26412;&#30740;&#31350;&#20013;&#65292;&#25105;&#20204;&#25209;&#21028;&#24615;&#22320;&#35780;&#20272;&#20102;&#22312;&#23454;&#35777;&#37329;&#34701;&#21644;&#35745;&#37327;&#32463;&#27982;&#23398;&#30740;&#31350;&#20013;&#20351;&#29992;&#31185;&#23398;&#28436;&#32462;&#21644;&#22240;&#26524;&#25512;&#26029;&#30340;&#20570;&#27861;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#20351;&#29992;&#20174;&#29983;&#24577;&#39135;&#39285;&#20851;&#31995;&#20013;&#25913;&#32534;&#30340;&#29609;&#20855;&#27169;&#22411;&#26469;&#23637;&#31034;&#31454;&#20105;&#24615;&#22240;&#26524;&#38142;&#30340;&#35266;&#28857;&#12290;&#22522;&#20110;&#27492;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#21478;&#19968;&#31181;&#35266;&#28857;&#65292;&#21363;&#24403;&#25105;&#20204;&#25215;&#35748;&#25105;&#20204;&#24403;&#21069;&#30340;&#37327;&#21270;&#37329;&#34701;&#24037;&#20855;&#21487;&#33021;&#22312;&#27969;&#34892;&#20551;&#35774;&#19979;&#20165;&#38480;&#20110;&#20107;&#21518;&#22240;&#26524;&#25512;&#26029;&#26102;&#65292;&#25105;&#20204;&#21487;&#33021;&#26356;&#22909;&#22320;&#29702;&#35299;&#23454;&#35777;&#37329;&#34701;&#30740;&#31350;&#21450;&#20854;&#20013;&#25152;&#21253;&#21547;&#30340;&#39118;&#38505;&#12290;&#24403;&#36825;&#20123;&#20551;&#35774;&#21463;&#21040;&#25361;&#25112;&#26102;&#65292;&#20363;&#22914;&#22312;&#21487;&#35782;&#21035;&#30340;&#21453;&#36523;&#24615;&#32972;&#26223;&#19979;&#65292;&#21333;&#21521;&#22240;&#26524;&#20851;&#31995;&#30340;&#24314;&#35758;&#23601;&#26174;&#24471;&#38750;&#24120;&#26840;&#25163;&#12290;
&lt;/p&gt;
&lt;p&gt;
The clarion call for causal reduction in the study of capital markets is intensifying. However, in self-referencing and open systems such as capital markets, the idea of unidirectional causation (if applicable) may be limiting at best, and unstable or fallacious at worst. In this research, we critically assess the use of scientific deduction and causal inference within the study of empirical finance and econometrics. We then demonstrate the idea of competing causal chains using a toy model adapted from ecological predator/prey relationships. From this, we develop the alternative view that the study of empirical finance, and the risks contained therein, may be better appreciated once we admit that our current arsenal of quantitative finance tools may be limited to ex post causal inference under popular assumptions. Where these assumptions are challenged, for example in a recognizable reflexive context, the prescription of unidirectional causation proves deeply problematic.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#35299;&#20915;&#20102;&#20648;&#33021;&#25805;&#20316;&#21592;&#22914;&#20309;&#22312;&#25552;&#20379;&#35843;&#39057;&#21516;&#26102;&#26356;&#22909;&#22320;&#20132;&#26131;&#30005;&#21147;&#30340;&#38382;&#39064;&#12290;&#36890;&#36807;&#23558;&#20648;&#33021;&#32422;&#26463;&#22312;&#30446;&#26631;&#30005;&#37327;&#65292;&#26412;&#25991;&#25552;&#20986;&#20102;&#26085;&#21069;&#24066;&#22330;&#20132;&#26131;&#30005;&#37327;&#20316;&#20026;&#35843;&#39057;&#30005;&#37327;&#30340;&#38544;&#21547;&#20989;&#25968;&#65292;&#37327;&#21270;&#20102;&#33021;&#28304;&#25439;&#22833;&#25152;&#38656;&#36141;&#20080;&#30340;&#30005;&#37327;&#12290;</title><link>http://arxiv.org/abs/2306.02987</link><description>&lt;p&gt;
&#20648;&#33021;&#35843;&#39057;&#65306;&#25439;&#22833;&#19982;&#25910;&#30410;&#20998;&#26512;
&lt;/p&gt;
&lt;p&gt;
Frequency Regulation with Storage: On Losses and Profits. (arXiv:2306.02987v1 [math.OC])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.02987
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#35299;&#20915;&#20102;&#20648;&#33021;&#25805;&#20316;&#21592;&#22914;&#20309;&#22312;&#25552;&#20379;&#35843;&#39057;&#21516;&#26102;&#26356;&#22909;&#22320;&#20132;&#26131;&#30005;&#21147;&#30340;&#38382;&#39064;&#12290;&#36890;&#36807;&#23558;&#20648;&#33021;&#32422;&#26463;&#22312;&#30446;&#26631;&#30005;&#37327;&#65292;&#26412;&#25991;&#25552;&#20986;&#20102;&#26085;&#21069;&#24066;&#22330;&#20132;&#26131;&#30005;&#37327;&#20316;&#20026;&#35843;&#39057;&#30005;&#37327;&#30340;&#38544;&#21547;&#20989;&#25968;&#65292;&#37327;&#21270;&#20102;&#33021;&#28304;&#25439;&#22833;&#25152;&#38656;&#36141;&#20080;&#30340;&#30005;&#37327;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#20302;&#30899;&#31038;&#20250;&#65292;&#20026;&#20102;&#24179;&#34913;&#39118;&#33021;&#21644;&#22826;&#38451;&#33021;&#31561;&#38388;&#27463;&#24615;&#21457;&#30005;&#65292;&#38656;&#35201;&#23384;&#20648;&#22823;&#37327;&#30005;&#21147;&#65292;&#27604;&#22914;&#36890;&#36807;&#35843;&#39057;&#26469;&#23454;&#29616;&#12290;&#26412;&#25991;&#35299;&#20915;&#20102;&#20648;&#33021;&#25805;&#20316;&#21592;&#30340;&#20915;&#31574;&#38382;&#39064;&#65292;&#20182;&#20204;&#21521;&#30005;&#32593;&#25805;&#20316;&#21592;&#20986;&#21806;&#35843;&#39057;&#30005;&#21147;&#24182;&#22312;&#26085;&#21069;&#24066;&#22330;&#19978;&#20132;&#26131;&#30005;&#21147;&#12290;&#25968;&#23398;&#19978;&#65292;&#26412;&#25991;&#23558;&#26410;&#26469;&#30340;&#39057;&#20559;&#36712;&#36857;&#35270;&#20026;&#21453;&#22797;&#20986;&#29616;&#30340;&#20248;&#21270;&#38382;&#39064;&#20013;&#30340;&#20989;&#25968;&#19981;&#30830;&#23450;&#24615;&#12290;&#25105;&#20204;&#32422;&#26463;&#26399;&#26395;&#30340;&#32456;&#31471;&#30005;&#37327;&#20026;&#26576;&#20010;&#30446;&#26631;&#20540;&#65292;&#20197;&#20351;&#20648;&#33021;&#25805;&#20316;&#21592;&#19981;&#20165;&#20026;&#29616;&#22312;&#32780;&#20026;&#26410;&#26469;&#20570;&#20986;&#22909;&#30340;&#20915;&#31574;&#12290;&#30001;&#20110;&#36825;&#20010;&#32422;&#26463;&#65292;&#26085;&#21069;&#24066;&#22330;&#19978;&#20132;&#26131;&#30340;&#30005;&#21147;&#37327;&#26159;&#20986;&#21806;&#32473;&#30005;&#32593;&#25805;&#20316;&#21592;&#30340;&#35843;&#39057;&#30005;&#37327;&#30340;&#19968;&#20010;&#38544;&#21547;&#20989;&#25968;&#12290;&#36825;&#20010;&#38544;&#21547;&#20989;&#25968;&#37327;&#21270;&#20102;&#25552;&#20379;&#35843;&#39057;&#25152;&#23548;&#33268;&#30340;&#39044;&#26399;&#33021;&#37327;&#25439;&#22833;&#25152;&#38656;&#36141;&#20080;&#30340;&#30005;&#37327;&#12290;
&lt;/p&gt;
&lt;p&gt;
Low-carbon societies will need to store vast amounts of electricity to balance intermittent generation from wind and solar energy, for example, through frequency regulation. Here, we derive an analytical solution to the decision-making problem of storage operators who sell frequency regulation power to grid operators and trade electricity on day-ahead markets. Mathematically, we treat future frequency deviation trajectories as functional uncertainties in a receding horizon robust optimization problem. We constrain the expected terminal state-of-charge to be equal to some target to allow storage operators to make good decisions not only for the present but also the future. Thanks to this constraint, the amount of electricity traded on day-ahead markets is an implicit function of the regulation power sold to grid operators. The implicit function quantifies the amount of power that needs to be purchased to cover the expected energy loss that results from providing frequency regulation. We
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#20351;&#29992;&#36328;&#36234; 5 &#24180;&#30340; 500 &#31181;&#32654;&#22269;&#19978;&#24066;&#36164;&#20135;&#30340;&#27599;&#31186;&#25968;&#25454;&#65292;&#21457;&#29616;&#20215;&#26684;&#24418;&#25104;&#26159;&#22312;&#39640;&#24230;&#27969;&#21160;&#24615;&#36164;&#20135;&#20869;&#33258;&#21457;&#21457;&#29983;&#30340;&#65292;&#28982;&#21518;&#36825;&#20123;&#36164;&#20135;&#30340;&#20132;&#26131;&#20250;&#24433;&#21709;&#36739;&#19981;&#27969;&#21160;&#20294;&#30456;&#20851;&#30340;&#20135;&#21697;&#20215;&#26684;&#12290;&#35813;&#22810;&#32500;&#20215;&#26684;&#24418;&#25104;&#26426;&#21046;&#23545;&#21033;&#29575;&#24066;&#22330;&#26377;&#24433;&#21709;&#65292;&#19988;&#25361;&#25112;&#20102;&#36130;&#21153;&#32463;&#27982;&#23398;&#29702;&#35770;&#12290;</title><link>http://arxiv.org/abs/2305.16915</link><description>&lt;p&gt;
&#20132;&#21449;&#24433;&#21709;&#20309;&#26102;&#30456;&#20851;&#65311;
&lt;/p&gt;
&lt;p&gt;
When is cross impact relevant?. (arXiv:2305.16915v1 [q-fin.TR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.16915
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20351;&#29992;&#36328;&#36234; 5 &#24180;&#30340; 500 &#31181;&#32654;&#22269;&#19978;&#24066;&#36164;&#20135;&#30340;&#27599;&#31186;&#25968;&#25454;&#65292;&#21457;&#29616;&#20215;&#26684;&#24418;&#25104;&#26159;&#22312;&#39640;&#24230;&#27969;&#21160;&#24615;&#36164;&#20135;&#20869;&#33258;&#21457;&#21457;&#29983;&#30340;&#65292;&#28982;&#21518;&#36825;&#20123;&#36164;&#20135;&#30340;&#20132;&#26131;&#20250;&#24433;&#21709;&#36739;&#19981;&#27969;&#21160;&#20294;&#30456;&#20851;&#30340;&#20135;&#21697;&#20215;&#26684;&#12290;&#35813;&#22810;&#32500;&#20215;&#26684;&#24418;&#25104;&#26426;&#21046;&#23545;&#21033;&#29575;&#24066;&#22330;&#26377;&#24433;&#21709;&#65292;&#19988;&#25361;&#25112;&#20102;&#36130;&#21153;&#32463;&#27982;&#23398;&#29702;&#35770;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#19968;&#31181;&#36164;&#20135;&#30340;&#20132;&#26131;&#21387;&#21147;&#21487;&#33021;&#20250;&#24433;&#21709;&#21478;&#19968;&#31181;&#36164;&#20135;&#30340;&#20215;&#26684;&#65292;&#36825;&#31181;&#29616;&#35937;&#34987;&#31216;&#20026;&#20132;&#21449;&#24433;&#21709;&#12290;&#26412;&#25991;&#20351;&#29992;&#36328;&#36234; 5 &#24180;&#30340; 500 &#31181;&#32654;&#22269;&#19978;&#24066;&#36164;&#20135;&#30340;&#27599;&#31186;&#25968;&#25454;&#65292;&#35782;&#21035;&#20102;&#20351;&#20132;&#21449;&#24433;&#21709;&#30456;&#20851;&#30340;&#29305;&#24449;&#20197;&#35299;&#37322;&#20215;&#26684;&#22238;&#25253;&#26041;&#24046;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#20215;&#26684;&#24418;&#25104;&#26159;&#22312;&#39640;&#24230;&#27969;&#21160;&#24615;&#36164;&#20135;&#20869;&#33258;&#21457;&#21457;&#29983;&#30340;&#65292;&#28982;&#21518;&#36825;&#20123;&#36164;&#20135;&#30340;&#20132;&#26131;&#20250;&#24433;&#21709;&#36739;&#19981;&#27969;&#21160;&#20294;&#30456;&#20851;&#30340;&#20135;&#21697;&#20215;&#26684;&#65292;&#20854;&#24433;&#21709;&#36895;&#24230;&#21463;&#26368;&#20302;&#20132;&#26131;&#39057;&#29575;&#30340;&#38480;&#21046;&#12290;&#26412;&#25991;&#36824;&#25506;&#31350;&#20102;&#36825;&#31181;&#22810;&#32500;&#20215;&#26684;&#24418;&#25104;&#26426;&#21046;&#23545;&#21033;&#29575;&#24066;&#22330;&#30340;&#24433;&#21709;&#65292;&#21457;&#29616; 10 &#24180;&#26399;&#22269;&#20538;&#26399;&#36135;&#26159;&#20027;&#35201;&#30340;&#27969;&#21160;&#24615;&#20648;&#22791;&#65292;&#24433;&#21709;&#30528;&#21033;&#29575;&#26354;&#32447;&#20869;&#29616;&#38046;&#20538;&#21048;&#21644;&#26399;&#36135;&#21512;&#32422;&#30340;&#20215;&#26684;&#12290;&#36825;&#31181;&#34892;&#20026;&#25361;&#25112;&#20102;&#36130;&#21153;&#32463;&#27982;&#23398;&#29702;&#35770;&#65292;&#35813;&#29702;&#35770;&#35748;&#20026;&#38271;&#26399;&#21033;&#29575;&#26159;&#20195;&#29702;&#20154;&#23545;&#26410;&#26469;&#30701;&#26399;&#21033;&#29575;&#30340;&#39044;&#26399;&#12290;
&lt;/p&gt;
&lt;p&gt;
Trading pressure from one asset can move the price of another, a phenomenon referred to as cross impact. Using tick-by-tick data spanning 5 years for 500 assets listed in the United States, we identify the features that make cross-impact relevant to explain the variance of price returns. We show that price formation occurs endogenously within highly liquid assets. Then, trades in these assets influence the prices of less liquid correlated products, with an impact velocity constrained by their minimum trading frequency. We investigate the implications of such a multidimensional price formation mechanism on interest rate markets. We find that the 10-year bond future serves as the primary liquidity reservoir, influencing the prices of cash bonds and futures contracts within the interest rate curve. Such behaviour challenges the validity of the theory in Financial Economics that regards long-term rates as agents anticipations of future short term rates.
&lt;/p&gt;</description></item></channel></rss>