<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#26412;&#25991;&#24320;&#21457;&#20102;&#19968;&#20010;&#31867;&#20284;&#20110;&#23454;&#29289;&#26399;&#26435;&#30340;&#27169;&#22411;&#65292;&#20197;&#25429;&#25417;&#29615;&#22659;&#25919;&#31574;&#37319;&#29992;&#20013;&#30340;&#20004;&#23618;&#19981;&#30830;&#23450;&#24615;&#12290;&#20915;&#31574;&#32773;&#33021;&#22815;&#36890;&#36807;&#36319;&#36394;&#25104;&#26412;&#30340;&#23454;&#38469;&#28436;&#21464;&#26469;&#23398;&#20064;&#26410;&#30693;&#30340;&#28418;&#31227;&#65292;&#24182;&#24418;&#25104;&#21518;&#39564;&#21160;&#24577;&#20449;&#24565;&#20854;&#30495;&#27491;&#20215;&#20540;&#12290;</title><link>http://arxiv.org/abs/2304.10344</link><description>&lt;p&gt;
&#29615;&#22659;&#25919;&#31574;&#37319;&#29992;&#20013;&#30340;&#19981;&#30830;&#23450;&#24615;&#65306;&#23545;&#19981;&#21487;&#39044;&#27979;&#30340;&#31038;&#20250;&#32463;&#27982;&#25104;&#26412;&#30340;&#36125;&#21494;&#26031;&#23398;&#20064;(arXiv:2304.10344v1 [math.OC])
&lt;/p&gt;
&lt;p&gt;
Uncertainty over Uncertainty in Environmental Policy Adoption: Bayesian Learning of Unpredictable Socioeconomic Costs. (arXiv:2304.10344v1 [math.OC])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.10344
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#24320;&#21457;&#20102;&#19968;&#20010;&#31867;&#20284;&#20110;&#23454;&#29289;&#26399;&#26435;&#30340;&#27169;&#22411;&#65292;&#20197;&#25429;&#25417;&#29615;&#22659;&#25919;&#31574;&#37319;&#29992;&#20013;&#30340;&#20004;&#23618;&#19981;&#30830;&#23450;&#24615;&#12290;&#20915;&#31574;&#32773;&#33021;&#22815;&#36890;&#36807;&#36319;&#36394;&#25104;&#26412;&#30340;&#23454;&#38469;&#28436;&#21464;&#26469;&#23398;&#20064;&#26410;&#30693;&#30340;&#28418;&#31227;&#65292;&#24182;&#24418;&#25104;&#21518;&#39564;&#21160;&#24577;&#20449;&#24565;&#20854;&#30495;&#27491;&#20215;&#20540;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#27745;&#26579;&#30340;&#31038;&#20250;&#32463;&#27982;&#24433;&#21709;&#33258;&#28982;&#32780;&#28982;&#22320;&#20276;&#38543;&#30528;&#19981;&#30830;&#23450;&#24615;&#65292;&#20363;&#22914;&#65292;&#25490;&#25918;&#20943;&#23569;&#30340;&#26032;&#25216;&#26415;&#21457;&#23637;&#25110;&#20154;&#21475;&#21464;&#21270;&#12290;&#27492;&#22806;&#65292;&#29615;&#22659;&#30772;&#22351;&#26410;&#26469;&#25104;&#26412;&#30340;&#36235;&#21183;&#26159;&#26410;&#30693;&#30340;&#65306;&#20840;&#29699;&#21464;&#26262;&#26159;&#21542;&#21344;&#20027;&#23548;&#22320;&#20301;&#65292;&#36824;&#26159;&#25216;&#26415;&#36827;&#27493;&#20250;&#21344;&#25454;&#20027;&#23548;&#22320;&#20301;&#65311;&#20107;&#23454;&#19978;&#65292;&#25105;&#20204;&#19981;&#30693;&#36947;&#21738;&#31181;&#24773;&#20917;&#20250;&#23454;&#29616;&#65292;&#31185;&#23398;&#30028;&#30340;&#36777;&#35770;&#20173;&#28982;&#23384;&#22312;&#12290;&#26412;&#25991;&#36890;&#36807;&#24320;&#21457;&#19968;&#20010;&#31867;&#20284;&#20110;&#23454;&#29289;&#26399;&#26435;&#30340;&#27169;&#22411;&#65292;&#25429;&#25417;&#36825;&#20004;&#23618;&#19981;&#30830;&#23450;&#24615;&#12290;&#22312;&#35813;&#27169;&#22411;&#20013;&#65292;&#20915;&#31574;&#32773;&#30340;&#30446;&#26631;&#26159;&#22312;&#24403;&#21069;&#30340;&#25490;&#25918;&#29575;&#20013;&#37319;&#21462;&#19968;&#27425;&#24615;&#26114;&#36149;&#30340;&#20943;&#23569;&#65292;&#24403;&#27745;&#26579;&#30340;&#31038;&#20250;&#32463;&#27982;&#25104;&#26412;&#30340;&#38543;&#26426;&#21160;&#24577;&#21463;&#21040;&#24067;&#26391;&#36816;&#21160;&#30340;&#20914;&#20987;&#26102;&#65292;&#28418;&#31227;&#26159;&#19981;&#21487;&#35266;&#23519;&#30340;&#38543;&#26426;&#21464;&#37327;&#12290;&#36890;&#36807;&#36319;&#36394;&#25104;&#26412;&#30340;&#23454;&#38469;&#28436;&#21464;&#65292;&#20915;&#31574;&#32773;&#33021;&#22815;&#23398;&#20064;&#26410;&#30693;&#30340;&#28418;&#31227;&#65292;&#24182;&#24418;&#25104;&#21518;&#39564;&#21160;&#24577;&#20449;&#24565;&#20854;&#30495;&#27491;&#20215;&#20540;&#12290;&#30001;&#27492;&#20135;&#29983;&#30340;&#20915;&#31574;&#26102;&#26426;&#38382;&#39064;&#20844;&#21496;
&lt;/p&gt;
&lt;p&gt;
The socioeconomic impact of pollution naturally comes with uncertainty due to, e.g., current new technological developments in emissions' abatement or demographic changes. On top of that, the trend of the future costs of the environmental damage is unknown: Will global warming dominate or technological advancements prevail? The truth is that we do not know which scenario will be realised and the scientific debate is still open. This paper captures those two layers of uncertainty by developing a real-options-like model in which a decision maker aims at adopting a once-and-for-all costly reduction in the current emissions rate, when the stochastic dynamics of the socioeconomic costs of pollution are subject to Brownian shocks and the drift is an unobservable random variable. By keeping track of the actual evolution of the costs, the decision maker is able to learn the unknown drift and to form a posterior dynamic belief of its true value. The resulting decision maker's timing problem boi
&lt;/p&gt;</description></item><item><title>&#35813;&#30740;&#31350;&#20998;&#26512;&#20102;&#19996;&#21335;&#20122;&#20892;&#19994;&#19982;&#31038;&#20250;&#20914;&#31361;&#30340;&#20851;&#32852;&#24615;&#65292;&#21457;&#29616;&#22312;&#31291;&#35895;&#25910;&#33719;&#23395;&#33410;&#20013;&#65292;&#25919;&#27835;&#26292;&#21147;&#22686;&#21152;&#32780;&#31038;&#20250;&#21160;&#33633;&#20943;&#23569;&#12290;&#30740;&#31350;&#25581;&#31034;&#20102;&#25919;&#31574;&#21046;&#23450;&#32773;&#22312;&#20892;&#19994;&#32463;&#27982;&#20013;&#31649;&#29702;&#31038;&#20250;&#20914;&#31361;&#30340;&#24517;&#35201;&#24615;&#12290;</title><link>http://arxiv.org/abs/2304.10027</link><description>&lt;p&gt;
&#19996;&#21335;&#20122;&#20892;&#19994;&#20914;&#20987;&#19982;&#31038;&#20250;&#20914;&#31361;
&lt;/p&gt;
&lt;p&gt;
Agricultural Shocks and Social Conflict in Southeast Asia. (arXiv:2304.10027v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.10027
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#20998;&#26512;&#20102;&#19996;&#21335;&#20122;&#20892;&#19994;&#19982;&#31038;&#20250;&#20914;&#31361;&#30340;&#20851;&#32852;&#24615;&#65292;&#21457;&#29616;&#22312;&#31291;&#35895;&#25910;&#33719;&#23395;&#33410;&#20013;&#65292;&#25919;&#27835;&#26292;&#21147;&#22686;&#21152;&#32780;&#31038;&#20250;&#21160;&#33633;&#20943;&#23569;&#12290;&#30740;&#31350;&#25581;&#31034;&#20102;&#25919;&#31574;&#21046;&#23450;&#32773;&#22312;&#20892;&#19994;&#32463;&#27982;&#20013;&#31649;&#29702;&#31038;&#20250;&#20914;&#31361;&#30340;&#24517;&#35201;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#31038;&#20250;&#20914;&#31361;&#26159;&#19981;&#21487;&#36991;&#20813;&#30340;&#65292;&#20294;&#20854;&#21457;&#29983;&#21644;&#24378;&#24230;&#38543;&#26102;&#38388;&#21644;&#22320;&#28857;&#30340;&#19981;&#21516;&#32780;&#24322;&#12290;&#22312;&#20302;&#25910;&#20837;&#32463;&#27982;&#20307;&#20013;&#65292;&#20892;&#19994;&#23601;&#19994;&#21644;&#25910;&#20837;&#30340;&#37325;&#35201;&#24615;&#36739;&#22823;&#65292;&#25919;&#27835;&#26292;&#21147;&#21644;&#31038;&#20250;&#20914;&#31361;&#21487;&#33021;&#19982;&#35813;&#34892;&#19994;&#30456;&#20851;&#12290;&#25105;&#20204;&#20351;&#29992;&#28085;&#30422;&#19971;&#20010;&#19996;&#21335;&#20122;&#22269;&#23478;13&#24180;&#26399;&#38388;&#30340;&#20914;&#31361;&#25968;&#25454;&#26469;&#30740;&#31350;&#36825;&#31181;&#32852;&#31995;&#12290;&#25105;&#20204;&#37325;&#28857;&#20851;&#27880;&#31291;&#35895;&#25910;&#33719;&#23395;&#33410;&#20013;&#20914;&#31361;&#20107;&#20214;&#30340;&#21464;&#21270;&#65292;&#36825;&#26159;&#35813;&#22320;&#21306;&#29983;&#20135;&#21644;&#28040;&#36153;&#26368;&#22810;&#30340;&#35895;&#29289;&#20316;&#29289;&#12290;&#25105;&#20204;&#35266;&#23519;&#21040;&#22312;&#25910;&#33719;&#23395;&#33410;&#30340;&#31291;&#31859;&#29983;&#20135;&#22320;&#21306;&#65292;&#25919;&#27835;&#26292;&#21147;&#22686;&#21152;&#32780;&#31038;&#20250;&#21160;&#33633;&#20943;&#23569;&#12290;&#36890;&#36807;&#32771;&#34385;&#19982;&#31291;&#35895;&#20215;&#26684;&#21644;&#29983;&#38271;&#23395;&#33410;&#38477;&#38632;&#30456;&#20851;&#30340;&#20914;&#20987;&#65292;&#24182;&#27604;&#36739;&#20027;&#35201;&#26159;&#28748;&#28297;&#19982;&#20027;&#35201;&#26159;&#38632;&#20859;&#31291;&#29983;&#20135;&#23454;&#36341;&#30340;&#22320;&#21306;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#21487;&#33021;&#23548;&#33268;&#36825;&#31181;&#25928;&#26524;&#30340;&#19981;&#21516;&#26426;&#21046;&#12290;&#36825;&#20123;&#21457;&#29616;&#20026;&#25919;&#31574;&#21046;&#23450;&#32773;&#25552;&#20379;&#20102;&#37325;&#35201;&#30340;&#35265;&#35299;&#12290;
&lt;/p&gt;
&lt;p&gt;
Social conflicts are inevitable, but their occurrence and intensity have varied over time and across locations. In lower-income economies, where employment and income from agriculture are substantial, forms of political violence and social conflict may be linked with this sector. We investigate this linkage using granular conflict data covering a 13-year period across seven Southeast Asian countries. We focus on changes in conflict incidents during the rice harvest season, which is the most produced and consumed cereal crop in the region. We observe an increase in political violence but a decrease in social unrest in rice-producing areas during the harvest season. We investigate different plausible mechanisms that may lead to such effects, by incorporating shocks associated with rice prices and growing season rainfall, and by comparing regions with predominantly irrigated vs predominantly rainfed rice production practices. These findings offer important insights to policymakers as they
&lt;/p&gt;</description></item><item><title>&#35813;&#30740;&#31350;&#25552;&#20986;&#20102;&#22343;&#34913;&#21551;&#31034;&#30340;&#36317;&#31163;&#24230;&#37327;&#21644;&#26356;&#22909;&#21453;&#24212;&#24615;&#19981;&#21464;&#30340;&#36317;&#31163;&#24230;&#37327;&#65292;&#20026;&#27491;&#21017;&#24418;&#21338;&#24328;&#31354;&#38388;&#23450;&#20041;&#20102;&#23884;&#20837;&#65292;&#24182;&#30740;&#31350;&#20102; $2\times2$ &#28216;&#25103;&#30340;&#22343;&#34913;&#19981;&#21464;&#23884;&#20837;&#65292;&#20855;&#26377;&#39640;&#25928;&#30340;&#20108;&#20803;&#21442;&#25968;&#21270;&#12290;</title><link>http://arxiv.org/abs/2304.09978</link><description>&lt;p&gt;
&#22343;&#34913;&#19981;&#21464;&#23884;&#20837;&#12289;&#24230;&#37327;&#31354;&#38388;&#21644;$2\times2$&#27491;&#21017;&#22411;&#21338;&#24328;&#30340;&#22522;&#30784;&#38598;&#21512;
&lt;/p&gt;
&lt;p&gt;
Equilibrium-Invariant Embedding, Metric Space, and Fundamental Set of $2\times2$ Normal-Form Games. (arXiv:2304.09978v1 [cs.GT])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.09978
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#25552;&#20986;&#20102;&#22343;&#34913;&#21551;&#31034;&#30340;&#36317;&#31163;&#24230;&#37327;&#21644;&#26356;&#22909;&#21453;&#24212;&#24615;&#19981;&#21464;&#30340;&#36317;&#31163;&#24230;&#37327;&#65292;&#20026;&#27491;&#21017;&#24418;&#21338;&#24328;&#31354;&#38388;&#23450;&#20041;&#20102;&#23884;&#20837;&#65292;&#24182;&#30740;&#31350;&#20102; $2\times2$ &#28216;&#25103;&#30340;&#22343;&#34913;&#19981;&#21464;&#23884;&#20837;&#65292;&#20855;&#26377;&#39640;&#25928;&#30340;&#20108;&#20803;&#21442;&#25968;&#21270;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#27491;&#21017;&#24418;&#21338;&#24328;&#30340;&#22343;&#34913;&#35299;&#27010;&#24565;&#65292;&#22914;Nash&#22343;&#34913;&#12289;&#30456;&#20851;&#22343;&#34913;&#21644;&#31895;&#31961;&#30456;&#20851;&#22343;&#34913;&#65292;&#25551;&#36848;&#20102;&#20174;&#20013;&#27809;&#26377;&#20219;&#20309;&#19968;&#20301;&#29609;&#23478;&#26377;&#21160;&#26426;&#21333;&#26041;&#38754;&#32972;&#21467;&#30340;&#32852;&#21512;&#31574;&#30053;&#12290;&#23427;&#20204;&#22312;&#21338;&#24328;&#35770;&#12289;&#32463;&#27982;&#23398;&#21644;&#22810;&#20195;&#29702;&#31995;&#32479;&#20013;&#24191;&#27867;&#30740;&#31350;&#12290;&#22343;&#34913;&#27010;&#24565;&#22312;&#26576;&#20123;&#25910;&#30410;&#21464;&#25442;&#19979;&#26159;&#19981;&#21464;&#30340;&#12290;&#25105;&#20204;&#20026;&#25152;&#26377;&#27491;&#21017;&#24418;&#21338;&#24328;&#31354;&#38388;&#23450;&#20041;&#20102;&#19968;&#20010;&#22343;&#34913;&#21551;&#31034;&#30340;&#36317;&#31163;&#24230;&#37327;&#65292;&#25581;&#31034;&#20102;&#19968;&#20010;&#36317;&#31163;&#20445;&#25345;&#22343;&#34913;&#19981;&#21464;&#30340;&#23884;&#20837;&#26041;&#24335;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#39069;&#22806;&#30340;&#21464;&#25442;&#65292;&#23450;&#20041;&#20102;&#26356;&#22909;&#21453;&#24212;&#24615;&#19981;&#21464;&#30340;&#36317;&#31163;&#24230;&#37327;&#21644;&#23884;&#20837;&#12290;&#20026;&#20102;&#28436;&#31034;&#36825;&#20123;&#24230;&#37327;&#31354;&#38388;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;$2\times2$&#28216;&#25103;&#12290;$2\times2$ &#28216;&#25103;&#30340;&#22343;&#34913;&#19981;&#21464;&#23884;&#20837;&#20855;&#26377;&#39640;&#25928;&#30340;&#20108;&#20803;&#21442;&#25968;&#21270;&#65288;&#20174;&#20843;&#20010;&#65289;&#65292;&#27599;&#20010;&#21464;&#37327;&#22312;&#19968;&#20010;&#21333;&#20301;&#22278;&#30340;&#35282;&#24230;&#19978;&#20960;&#20309;&#22320;&#25551;&#36848;&#20102;&#19968;&#20010;&#35282;&#24230;&#12290;&#21487;&#20197;&#20174;&#23884;&#20837;&#20013;&#25512;&#26029;&#20986;&#26377;&#36259;&#30340;&#31354;&#38388;&#24615;&#36136;&#65292;&#21253;&#25324;&#65306;
&lt;/p&gt;
&lt;p&gt;
Equilibrium solution concepts of normal-form games, such as Nash equilibria, correlated equilibria, and coarse correlated equilibria, describe the joint strategy profiles from which no player has incentive to unilaterally deviate. They are widely studied in game theory, economics, and multiagent systems. Equilibrium concepts are invariant under certain transforms of the payoffs. We define an equilibrium-inspired distance metric for the space of all normal-form games and uncover a distance-preserving equilibrium-invariant embedding. Furthermore, we propose an additional transform which defines a better-response-invariant distance metric and embedding. To demonstrate these metric spaces we study $2\times2$ games. The equilibrium-invariant embedding of $2\times2$ games has an efficient two variable parameterization (a reduction from eight), where each variable geometrically describes an angle on a unit circle. Interesting properties can be spatially inferred from the embedding, including:
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;NM&#25928;&#29992;&#20989;&#25968;&#30340;&#23454;&#29992;&#20027;&#20041;&#23450;&#29702;&#21644;Alt&#25928;&#29992;&#20989;&#25968;&#30340;&#23454;&#29992;&#20027;&#20041;&#23450;&#29702;&#65292;&#21457;&#29616;&#20108;&#32773;&#21516;&#26102;&#25104;&#31435;&#26102;&#65292;NM&#25928;&#29992;&#20989;&#25968;&#19982;Alt&#25928;&#29992;&#20989;&#25968;&#37325;&#21512;&#65292;&#36825;&#19968;&#32467;&#26524;&#34920;&#26126;&#20854;&#20013;&#33267;&#23569;&#19968;&#20010;&#23454;&#29992;&#20027;&#20041;&#23450;&#29702;&#21253;&#21547;&#20102;&#19968;&#20010;&#24378;&#20551;&#35774;&#12290;</title><link>http://arxiv.org/abs/2304.09973</link><description>&lt;p&gt;
&#23454;&#29992;&#20027;&#20041;&#23450;&#29702;&#19982;&#25928;&#29992;&#29702;&#35770;&#30340;&#31561;&#20215;&#24615;
&lt;/p&gt;
&lt;p&gt;
Utilitarian Theorems and Equivalence of Utility Theories. (arXiv:2304.09973v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.09973
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;NM&#25928;&#29992;&#20989;&#25968;&#30340;&#23454;&#29992;&#20027;&#20041;&#23450;&#29702;&#21644;Alt&#25928;&#29992;&#20989;&#25968;&#30340;&#23454;&#29992;&#20027;&#20041;&#23450;&#29702;&#65292;&#21457;&#29616;&#20108;&#32773;&#21516;&#26102;&#25104;&#31435;&#26102;&#65292;NM&#25928;&#29992;&#20989;&#25968;&#19982;Alt&#25928;&#29992;&#20989;&#25968;&#37325;&#21512;&#65292;&#36825;&#19968;&#32467;&#26524;&#34920;&#26126;&#20854;&#20013;&#33267;&#23569;&#19968;&#20010;&#23454;&#29992;&#20027;&#20041;&#23450;&#29702;&#21253;&#21547;&#20102;&#19968;&#20010;&#24378;&#20551;&#35774;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#19968;&#20010;&#29615;&#22659;&#65292;&#22312;&#35813;&#29615;&#22659;&#19979;&#65292;Harsanyi&#25552;&#20986;&#30340;NM&#25928;&#29992;&#20989;&#25968;&#30340;&#23454;&#29992;&#20027;&#20041;&#23450;&#29702;&#19982;Harvey&#25552;&#20986;&#30340;Alt&#25928;&#29992;&#20989;&#25968;&#30340;&#23454;&#29992;&#20027;&#20041;&#23450;&#29702;&#21516;&#26102;&#25104;&#31435;&#65292;&#24182;&#35777;&#26126;&#20102;&#22312;&#36825;&#31181;&#24773;&#20917;&#19979;&#65292;NM&#25928;&#29992;&#20989;&#25968;&#19982;Alt&#25928;&#29992;&#20989;&#25968;&#37325;&#21512;&#12290;&#36825;&#19968;&#32467;&#26524;&#20855;&#26377;&#24726;&#35770;&#24615;&#65292;&#25105;&#20204;&#24517;&#39035;&#20551;&#23450;&#33267;&#23569;&#19968;&#20010;&#23454;&#29992;&#20027;&#20041;&#23450;&#29702;&#21253;&#21547;&#20102;&#19968;&#20010;&#24378;&#20551;&#35774;&#12290;&#25105;&#20204;&#36880;&#19968;&#26816;&#26597;&#21508;&#20010;&#20551;&#35774;&#65292;&#24182;&#24471;&#20986;&#32467;&#35770;&#65306;Harsanyi&#30340;&#20844;&#29702;&#20043;&#19968;&#26159;&#24378;&#20551;&#35774;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this paper, we consider an environment in which the utilitarian theorem for the NM utility function derived by Harsanyi and the utilitarian theorem for Alt's utility function derived by Harvey hold simultaneously, and prove that the NM utility function coincides with Alt's utility function under this setup. This result is so paradoxical that we must presume that at least one of the utilitarian theorems contains a strong assumption. We examine the assumptions one by one and conclude that one of Harsanyi's axioms is strong.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;&#22312;&#37329;&#34701;&#31995;&#32479;&#23384;&#22312;&#20043;&#21069;&#65292;&#33258;&#28982;&#36164;&#20135;&#22914;&#20309;&#20998;&#37197;&#30340;&#38382;&#39064;&#12290;&#36890;&#36807;&#30740;&#31350;&#20154;&#31867;&#23398;&#25968;&#25454;&#24182;&#24212;&#29992;&#32463;&#27982;&#29702;&#35770;&#65292;&#21457;&#29616;&#21490;&#21069;&#31038;&#20250;&#23545;&#38750;&#37329;&#34701;&#36130;&#23500;&#30340;&#22522;&#23612;&#31995;&#25968;&#26377;&#19968;&#20010;&#39318;&#36873;&#33539;&#22260;&#65292;&#38543;&#30528;&#20154;&#31867;&#31038;&#20250;&#30340;&#28436;&#21464;&#21644;&#21457;&#23637;&#26356;&#20026;&#22797;&#26434;&#30340;&#25919;&#27835;&#32467;&#26500;&#65292;&#36825;&#20010;&#33539;&#22260;&#21457;&#29983;&#20102;&#21464;&#21270;&#12290;</title><link>http://arxiv.org/abs/2304.09971</link><description>&lt;p&gt;
&#34507;&#31957;&#65306;&#20154;&#31867;&#36827;&#21270;&#22914;&#20309;&#20998;&#37197;&#38750;&#37329;&#34701;&#36130;&#23500;&#65311;
&lt;/p&gt;
&lt;p&gt;
The Pie: How Has Human Evolution Distributed Non-Financial Wealth?. (arXiv:2304.09971v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.09971
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;&#22312;&#37329;&#34701;&#31995;&#32479;&#23384;&#22312;&#20043;&#21069;&#65292;&#33258;&#28982;&#36164;&#20135;&#22914;&#20309;&#20998;&#37197;&#30340;&#38382;&#39064;&#12290;&#36890;&#36807;&#30740;&#31350;&#20154;&#31867;&#23398;&#25968;&#25454;&#24182;&#24212;&#29992;&#32463;&#27982;&#29702;&#35770;&#65292;&#21457;&#29616;&#21490;&#21069;&#31038;&#20250;&#23545;&#38750;&#37329;&#34701;&#36130;&#23500;&#30340;&#22522;&#23612;&#31995;&#25968;&#26377;&#19968;&#20010;&#39318;&#36873;&#33539;&#22260;&#65292;&#38543;&#30528;&#20154;&#31867;&#31038;&#20250;&#30340;&#28436;&#21464;&#21644;&#21457;&#23637;&#26356;&#20026;&#22797;&#26434;&#30340;&#25919;&#27835;&#32467;&#26500;&#65292;&#36825;&#20010;&#33539;&#22260;&#21457;&#29983;&#20102;&#21464;&#21270;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25910;&#20837;&#21644;&#36130;&#23500;&#20998;&#37197;&#26159;&#32463;&#27982;&#36816;&#20316;&#30340;&#22522;&#30784;&#32452;&#25104;&#37096;&#20998;&#12290;&#36825;&#20123;&#26159;&#22797;&#26434;&#30340;&#20998;&#24067;&#65292;&#20351;&#29992;&#24179;&#22343;&#20540;&#25110;&#20013;&#20301;&#25968;&#31561;&#31616;&#21270;&#26041;&#27861;&#24456;&#38590;&#30495;&#27491;&#24863;&#21463;&#21040;&#23427;&#20204;&#30340;&#21160;&#24577;&#12290;&#19968;&#20010;&#26356;&#22909;&#22320;&#25551;&#36848;&#35813;&#20998;&#24067;&#30340;&#25351;&#26631;&#26159;&#22522;&#23612;&#31995;&#25968;&#65292;&#22312;&#19968;&#20010;&#26497;&#31471;&#26159;0&#65292;&#19968;&#20010;&#23436;&#20840;&#20844;&#24179;&#30340;&#20998;&#24067;&#65292;&#22312;&#21478;&#19968;&#20010;&#26497;&#31471;&#26159;1&#65292;&#26368;&#19981;&#20844;&#24179;&#30340;&#26159;&#19968;&#20010;&#20154;&#25317;&#26377;&#25152;&#26377;&#36164;&#28304;&#12290;&#22823;&#22810;&#25968;&#19987;&#23478;&#35748;&#20026;&#65292;&#22312;&#20219;&#19968;&#26497;&#31471;&#37117;&#19981;&#23384;&#22312;&#21487;&#34892;&#30340;&#32463;&#27982;&#65292;&#20294;&#30830;&#23450;&#39318;&#36873;&#33539;&#22260;&#21382;&#26469;&#26159;&#26377;&#20105;&#35758;&#30340;&#25919;&#27835;&#21746;&#23398;&#21644;&#24773;&#24863;&#35785;&#27714;&#38382;&#39064;&#12290;&#26412;&#30740;&#31350;&#25506;&#35752;&#30340;&#26159;&#26159;&#21542;&#23384;&#22312;&#19968;&#20010;&#29702;&#35770;&#21644;&#23454;&#35777;&#22522;&#30784;&#25903;&#25345;&#19968;&#20010;&#39318;&#36873;&#22522;&#23612;&#31995;&#25968;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#25105;&#25506;&#35752;&#20102;&#19968;&#20010;&#31616;&#21333;&#30340;&#38382;&#39064;&#65306;&#22312;&#37329;&#34701;&#31995;&#32479;&#23384;&#22312;&#20043;&#21069;&#65292;&#33258;&#28982;&#36164;&#20135;&#22914;&#20309;&#20998;&#37197;&#65311;&#39640;&#24230;&#65292;&#21147;&#37327;&#21644;&#32654;&#20029;&#31561;&#20869;&#22312;&#20154;&#31867;&#23646;&#24615;&#26159;&#20154;&#31867;&#31038;&#20250;&#20114;&#21160;&#30340;&#21407;&#22987;&#20215;&#20540;&#34913;&#37327;&#26631;&#20934;&#12290;&#36890;&#36807;&#30740;&#31350;&#20154;&#31867;&#23398;&#25968;&#25454;&#24182;&#24212;&#29992;&#32463;&#27982;&#29702;&#35770;&#65292;&#25105;&#21457;&#29616;&#21490;&#21069;&#31038;&#20250;&#23545;&#38750;&#37329;&#34701;&#36130;&#23500;&#30340;&#22522;&#23612;&#31995;&#25968;&#26377;&#19968;&#20010;&#39318;&#36873;&#33539;&#22260;&#12290;&#38543;&#30528;&#20154;&#31867;&#31038;&#20250;&#30340;&#28436;&#21464;&#21644;&#21457;&#23637;&#26356;&#20026;&#22797;&#26434;&#30340;&#25919;&#27835;&#32467;&#26500;&#65292;&#36825;&#20010;&#33539;&#22260;&#21457;&#29983;&#20102;&#21464;&#21270;&#12290;&#20102;&#35299;&#36825;&#20010;&#33539;&#22260;&#23545;&#20110;&#22914;&#20309;&#22609;&#36896;&#29616;&#20195;&#32463;&#27982;&#31995;&#32479;&#20855;&#26377;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
Income and wealth allocation are foundational components of how economies operate. These are complex distributions, and it is hard to get a real sense for their dynamics using simplifications like average or median. One metric that characterizes such distributions better is the Gini Index, which on one extreme is 0, a completely equitable distribution, and on the other extreme is 1, the most inequitable, where a single individual has all the resources. Most experts agree that viable economies cannot exist at either extreme, but identifying a preferred range has historically been a matter of conflicting political philosophies and emotional appeals. This research explores instead whether there might be a theoretical and empirical basis for a preferred Gini Index. Specifically, I explore a simple question: Before financial systems existed, how were natural assets allocated? Intrinsic human attributes such as height, strength, &amp; beauty were the original measures of value in which human soc
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#36882;&#24402;&#20559;&#22909;&#21644;&#19981;&#30830;&#23450;&#24615;&#24577;&#24230;&#65292;&#24182;&#24471;&#20986;&#32467;&#35770;&#65292;&#22312;&#36328;&#26102;&#38388;&#28040;&#36153;&#36873;&#25321;&#38382;&#39064;&#20013;&#65292;&#36882;&#24402;&#20559;&#22909;&#24635;&#26159;&#24120;&#25968;&#32477;&#23545;&#27169;&#31946;&#35268;&#36991;&#65292;&#21516;&#26102;&#25552;&#20986;&#20102;&#24191;&#20041;&#38271;&#26041;&#24418;&#30340;&#20989;&#25968;&#26041;&#31243;&#12290;&#36882;&#24402;&#38480;&#21046;&#20102;&#25105;&#20204;&#21482;&#33021;&#37319;&#29992;&#36882;&#24402;&#21464;&#21270;&#20559;&#22909;&#12290;</title><link>http://arxiv.org/abs/2304.06830</link><description>&lt;p&gt;
&#36882;&#24402;&#20559;&#22909;&#19982;&#27169;&#31946;&#24577;&#24230;
&lt;/p&gt;
&lt;p&gt;
Recursive Preferences and Ambiguity Attitudes. (arXiv:2304.06830v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.06830
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#36882;&#24402;&#20559;&#22909;&#21644;&#19981;&#30830;&#23450;&#24615;&#24577;&#24230;&#65292;&#24182;&#24471;&#20986;&#32467;&#35770;&#65292;&#22312;&#36328;&#26102;&#38388;&#28040;&#36153;&#36873;&#25321;&#38382;&#39064;&#20013;&#65292;&#36882;&#24402;&#20559;&#22909;&#24635;&#26159;&#24120;&#25968;&#32477;&#23545;&#27169;&#31946;&#35268;&#36991;&#65292;&#21516;&#26102;&#25552;&#20986;&#20102;&#24191;&#20041;&#38271;&#26041;&#24418;&#30340;&#20989;&#25968;&#26041;&#31243;&#12290;&#36882;&#24402;&#38480;&#21046;&#20102;&#25105;&#20204;&#21482;&#33021;&#37319;&#29992;&#36882;&#24402;&#21464;&#21270;&#20559;&#22909;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#21160;&#24577;&#29615;&#22659;&#20013;&#36882;&#24402;&#30340;&#24378;&#24433;&#21709;&#65292;&#20197;&#21450;&#23545;&#19981;&#30830;&#23450;&#24615;&#24577;&#24230;&#30340;&#24433;&#21709;&#12290;&#22312;&#36328;&#26102;&#38388;&#28040;&#36153;&#36873;&#25321;&#38382;&#39064;&#20013;&#65292;&#36882;&#24402;&#20559;&#22909;&#24635;&#26159;&#24847;&#21619;&#30528;&#24120;&#25968;&#32477;&#23545;&#27169;&#31946;&#35268;&#36991;&#65292;&#21516;&#26102;&#20063;&#25552;&#20986;&#20102;&#19968;&#31181;&#31216;&#20026;&#8220;&#24191;&#20041;&#38271;&#26041;&#24418;&#8221;&#30340;&#20989;&#25968;&#26041;&#31243;&#65292;&#23427;&#23558;&#36882;&#24402;&#26368;&#23567;&#26368;&#22823;&#20559;&#22909;&#30340;&#26631;&#20934;&#27010;&#24565;&#25512;&#24191;&#21040;&#19968;&#33324;&#30340;&#30830;&#23450;&#24615;&#31561;&#20215;&#29289;&#12290;&#30740;&#31350;&#34920;&#26126;&#65292;&#22914;&#26524;&#27169;&#31946;&#35268;&#36991;&#34987;&#24314;&#27169;&#20026;&#20559;&#22909;&#30340;&#20984;&#24615;&#24418;&#24335;&#65292;&#21017;&#36882;&#24402;&#38480;&#21046;&#25105;&#20204;&#21482;&#33021;&#37319;&#29992;&#36882;&#24402;&#21464;&#21270;&#20559;&#22909;&#12290;
&lt;/p&gt;
&lt;p&gt;
We illustrate the strong implications of recursivity, a standard assumption in dynamic environments, on attitudes toward uncertainty. In intertemporal consumption choice problems, recursivity always implies constant absolute ambiguity aversion (CAAA) when applying the standard dynamic extension of monotonicity. Our analysis also yields a functional equation called "generalized rectangularity", as it generalizes the standard notion of rectangularity for recursive maxmin preferences to general certainty equivalents. Our results highlight that if uncertainty aversion is modeled as a form of convexity of preferences, recursivity limits us to only recursive variational preferences.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#31934;&#36873;&#32508;&#36848;&#20102;&#20351;&#29992;&#26426;&#22120;&#23398;&#20064;&#24037;&#20855;&#36827;&#34892;&#32463;&#27982;&#23398;&#30740;&#31350;&#21644;&#25919;&#31574;&#20998;&#26512;&#30340;&#25991;&#31456;&#65292;&#24378;&#35843;&#20102;&#26426;&#22120;&#23398;&#20064;&#22312;&#22788;&#29702;&#38750;&#20256;&#32479;&#21644;&#38750;&#32467;&#26500;&#21270;&#25968;&#25454;&#12289;&#25429;&#25417;&#24378;&#38750;&#32447;&#24615;&#24615;&#21644;&#25552;&#39640;&#39044;&#27979;&#20934;&#30830;&#24615;&#26041;&#38754;&#30340;&#24212;&#29992;&#20248;&#21183;&#65292;&#25104;&#20026;&#35745;&#37327;&#32463;&#27982;&#23398;&#23478;&#24037;&#20855;&#31665;&#20013;&#19981;&#21487;&#25110;&#32570;&#30340;&#19968;&#37096;&#20998;&#12290;</title><link>http://arxiv.org/abs/2304.00086</link><description>&lt;p&gt;
&#26426;&#22120;&#23398;&#20064;&#22312;&#32463;&#27982;&#30740;&#31350;&#20013;&#30340;&#24212;&#29992;&#65306;&#20309;&#26102;&#12289;&#20160;&#20040;&#21644;&#22914;&#20309;&#36816;&#29992;&#65311;
&lt;/p&gt;
&lt;p&gt;
Machine Learning for Economics Research: When What and How?. (arXiv:2304.00086v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.00086
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#31934;&#36873;&#32508;&#36848;&#20102;&#20351;&#29992;&#26426;&#22120;&#23398;&#20064;&#24037;&#20855;&#36827;&#34892;&#32463;&#27982;&#23398;&#30740;&#31350;&#21644;&#25919;&#31574;&#20998;&#26512;&#30340;&#25991;&#31456;&#65292;&#24378;&#35843;&#20102;&#26426;&#22120;&#23398;&#20064;&#22312;&#22788;&#29702;&#38750;&#20256;&#32479;&#21644;&#38750;&#32467;&#26500;&#21270;&#25968;&#25454;&#12289;&#25429;&#25417;&#24378;&#38750;&#32447;&#24615;&#24615;&#21644;&#25552;&#39640;&#39044;&#27979;&#20934;&#30830;&#24615;&#26041;&#38754;&#30340;&#24212;&#29992;&#20248;&#21183;&#65292;&#25104;&#20026;&#35745;&#37327;&#32463;&#27982;&#23398;&#23478;&#24037;&#20855;&#31665;&#20013;&#19981;&#21487;&#25110;&#32570;&#30340;&#19968;&#37096;&#20998;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#23545;&#20351;&#29992;&#26426;&#22120;&#23398;&#20064;&#24037;&#20855;&#36827;&#34892;&#32463;&#27982;&#23398;&#30740;&#31350;&#21644;&#25919;&#31574;&#20998;&#26512;&#30340;&#37325;&#35201;&#32463;&#27982;&#26399;&#21002;&#19978;&#21457;&#34920;&#30340;&#25991;&#31456;&#36827;&#34892;&#20102;&#31934;&#36873;&#32508;&#36848;&#12290;&#32508;&#36848;&#22238;&#31572;&#20102;&#19977;&#20010;&#20851;&#38190;&#38382;&#39064;&#65306;&#65288;1&#65289;&#20309;&#26102;&#22312;&#32463;&#27982;&#23398;&#20013;&#20351;&#29992;&#26426;&#22120;&#23398;&#20064;&#65292;&#65288;2&#65289;&#24120;&#29992;&#30340;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#26159;&#20160;&#20040;&#65292;&#20197;&#21450;&#65288;3&#65289;&#22914;&#20309;&#23558;&#23427;&#20204;&#29992;&#20110;&#32463;&#27982;&#24212;&#29992;&#12290;&#32508;&#36848;&#24378;&#35843;&#20102;&#26426;&#22120;&#23398;&#20064;&#29305;&#21035;&#36866;&#29992;&#20110;&#22788;&#29702;&#38750;&#20256;&#32479;&#21644;&#38750;&#32467;&#26500;&#21270;&#25968;&#25454;&#12289;&#25429;&#25417;&#24378;&#38750;&#32447;&#24615;&#24615;&#21644;&#25552;&#39640;&#39044;&#27979;&#20934;&#30830;&#24615;&#12290;&#28145;&#24230;&#23398;&#20064;&#27169;&#22411;&#36866;&#29992;&#20110;&#38750;&#20256;&#32479;&#25968;&#25454;&#65292;&#32780;&#38598;&#25104;&#23398;&#20064;&#27169;&#22411;&#36866;&#29992;&#20110;&#20256;&#32479;&#25968;&#25454;&#38598;&#12290;&#23613;&#31649;&#20256;&#32479;&#30340;&#35745;&#37327;&#32463;&#27982;&#23398;&#27169;&#22411;&#22312;&#20998;&#26512;&#20302;&#22797;&#26434;&#24615;&#25968;&#25454;&#26102;&#21487;&#33021;&#36275;&#22815;&#65292;&#20294;&#30001;&#20110;&#24555;&#36895;&#25968;&#23383;&#21270;&#21644;&#19981;&#26029;&#22686;&#38271;&#30340;&#25991;&#29486;&#65292;&#32463;&#27982;&#25968;&#25454;&#30340;&#22797;&#26434;&#24615;&#22686;&#21152;&#65292;&#26426;&#22120;&#23398;&#20064;&#27491;&#25104;&#20026;&#35745;&#37327;&#32463;&#27982;&#23398;&#23478;&#24037;&#20855;&#31665;&#20013;&#19981;&#21487;&#25110;&#32570;&#30340;&#19968;&#37096;&#20998;&#12290;
&lt;/p&gt;
&lt;p&gt;
This article provides a curated review of selected papers published in prominent economics journals that use machine learning (ML) tools for research and policy analysis. The review focuses on three key questions: (1) when ML is used in economics, (2) what ML models are commonly preferred, and (3) how they are used for economic applications. The review highlights that ML is particularly used in processing nontraditional and unstructured data, capturing strong nonlinearity, and improving prediction accuracy. Deep learning models are suitable for nontraditional data, whereas ensemble learning models are preferred for traditional datasets. While traditional econometric models may suffice for analyzing low-complexity data, the increasing complexity of economic data due to rapid digitalization and the growing literature suggest that ML is becoming an essential addition to the econometrician's toolbox.
&lt;/p&gt;</description></item><item><title>&#30740;&#31350;&#21457;&#29616;&#65292;&#30456;&#36739;&#20110;&#35088;&#33394;&#32929;&#31080;&#65292;&#32511;&#33394;&#32929;&#31080;&#22312;&#22823;&#22810;&#25968;&#32929;&#31080;&#22240;&#23376;&#19978;&#34920;&#29616;&#20986;&#36739;&#23569;&#30340;&#22240;&#23376;&#26292;&#38706;&#24322;&#36136;&#24615;&#65292;&#22240;&#27492;&#25237;&#36164;&#32463;&#29702;&#23558;&#25237;&#36164;&#20174;&#35088;&#33394;&#32929;&#31080;&#36716;&#21521;&#32511;&#33394;&#32929;&#31080;&#26102;&#65292;&#24046;&#24322;&#31354;&#38388;&#36739;&#23567;&#12290;&#27492;&#22806;&#65292;&#19982;&#36739;&#26089;&#26102;&#26399;&#30456;&#27604;&#65292;&#32511;&#33394;&#32929;&#31080;&#30340;&#22240;&#23376;&#26292;&#38706;&#24322;&#36136;&#24615;&#22686;&#21152;&#20102;&#12290;</title><link>http://arxiv.org/abs/2302.11729</link><description>&lt;p&gt;
&#32511;&#33394;&#32929;&#31080;&#21644;&#35088;&#33394;&#32929;&#31080;&#20013;&#30340;&#22240;&#23376;&#26292;&#38706;&#24322;&#36136;&#24615;
&lt;/p&gt;
&lt;p&gt;
Factor Exposure Heterogeneity in Green and Brown Stocks. (arXiv:2302.11729v2 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2302.11729
&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#21457;&#29616;&#65292;&#30456;&#36739;&#20110;&#35088;&#33394;&#32929;&#31080;&#65292;&#32511;&#33394;&#32929;&#31080;&#22312;&#22823;&#22810;&#25968;&#32929;&#31080;&#22240;&#23376;&#19978;&#34920;&#29616;&#20986;&#36739;&#23569;&#30340;&#22240;&#23376;&#26292;&#38706;&#24322;&#36136;&#24615;&#65292;&#22240;&#27492;&#25237;&#36164;&#32463;&#29702;&#23558;&#25237;&#36164;&#20174;&#35088;&#33394;&#32929;&#31080;&#36716;&#21521;&#32511;&#33394;&#32929;&#31080;&#26102;&#65292;&#24046;&#24322;&#31354;&#38388;&#36739;&#23567;&#12290;&#27492;&#22806;&#65292;&#19982;&#36739;&#26089;&#26102;&#26399;&#30456;&#27604;&#65292;&#32511;&#33394;&#32929;&#31080;&#30340;&#22240;&#23376;&#26292;&#38706;&#24322;&#36136;&#24615;&#22686;&#21152;&#20102;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20351;&#29992;&#21516;&#34892;&#26292;&#38706;&#27604;&#29575;&#65292;&#25506;&#35752;&#20102;&#32511;&#33394;&#32929;&#31080;&#21644;&#35088;&#33394;&#32929;&#31080;&#20013;&#30340;&#22240;&#23376;&#26292;&#38706;&#24322;&#36136;&#24615;&#12290;&#36890;&#36807;&#35266;&#23519;&#22522;&#20110;&#28201;&#23460;&#27668;&#20307;&#25490;&#25918;&#27700;&#24179;&#23545;S&amp;P 500&#25351;&#25968;&#20844;&#21496;&#30340;&#21516;&#34892;&#32676;&#20307;&#65292;&#25105;&#20204;&#21457;&#29616;&#65292;&#24179;&#22343;&#32780;&#35328;&#65292;&#32511;&#33394;&#32929;&#31080;&#22312;&#22823;&#22810;&#25968;&#20256;&#32479;&#32929;&#31080;&#22240;&#23376;&#65288;&#20215;&#20540;&#39118;&#26684;&#38500;&#22806;&#65289;&#19978;&#27604;&#35088;&#33394;&#32929;&#31080;&#34920;&#29616;&#20986;&#26356;&#23569;&#30340;&#22240;&#23376;&#26292;&#38706;&#24322;&#36136;&#24615;&#12290;&#22240;&#27492;&#65292;&#25237;&#36164;&#32463;&#29702;&#23558;&#25237;&#36164;&#20174;&#35088;&#33394;&#32929;&#31080;&#36716;&#20026;&#32511;&#33394;&#32929;&#31080;&#26102;&#65292;&#20851;&#20110;&#20182;&#20204;&#30340;&#22240;&#23376;&#26292;&#38706;&#65292;&#20182;&#20204;&#30340;&#24046;&#24322;&#31354;&#38388;&#36739;&#23567;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#21457;&#29616;&#65292;&#19982;&#36739;&#26089;&#26102;&#26399;&#30456;&#27604;&#65292;&#32511;&#33394;&#32929;&#31080;&#30340;&#22240;&#23376;&#26292;&#38706;&#24322;&#36136;&#24615;&#22686;&#21152;&#20102;&#12290;
&lt;/p&gt;
&lt;p&gt;
Using the peer-exposure ratio, we explore the factor exposure heterogeneity in green and brown stocks. By looking at peer groups of S&amp;P 500 index firms over 2014-2020 based on their greenhouse gas emission levels, we find that, on average, green stocks exhibit less factor exposure heterogeneity than brown stocks for most of the traditional equity factors but the value factor. Hence, investment managers shifting their investments from brown stocks to green stocks have less room to differentiate themselves regarding their factor exposures. Finally, we find that factor exposure heterogeneity has increased for green stocks compared to earlier periods.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#20855;&#26377;&#22810;&#20010;&#24369;&#24037;&#20855;&#21644;&#24322;&#26041;&#24046;&#24615;&#30340;IV&#22238;&#24402;&#25512;&#35770;&#30340;&#26465;&#20214;&#32447;&#24615;&#32452;&#21512;&#26816;&#39564;&#65292;&#24182;&#26681;&#25454;&#33258;&#36866;&#24212;&#21040;&#35782;&#21035;&#24378;&#24230;&#30340;&#20915;&#31574;&#29702;&#35770;&#35268;&#21017;&#36873;&#25321;&#20102;&#32447;&#24615;&#32452;&#21512;&#20013;&#30340;&#26435;&#37325;&#12290;&#35813;&#26041;&#27861;&#22312;&#24369;&#35782;&#21035;&#21644;&#24378;&#35782;&#21035;&#24773;&#20917;&#19979;&#22343;&#21487;&#26377;&#25928;&#25511;&#21046;&#28176;&#36817;&#35268;&#27169;&#65292;&#24182;&#19988;&#22312;&#26576;&#20123;&#27979;&#35797;&#31867;&#21035;&#20013;&#21487;&#25509;&#21463;&#12290;&#22312;&#24378;&#35782;&#21035;&#19979;&#65292;&#35813;&#26041;&#27861;&#20855;&#26377;&#26368;&#20339;&#21151;&#29575;&#12290;</title><link>http://arxiv.org/abs/2207.11137</link><description>&lt;p&gt;
&#22810;&#20010;&#24369;&#24037;&#20855;&#30340;&#26465;&#20214;&#32447;&#24615;&#32452;&#21512;&#26816;&#39564;
&lt;/p&gt;
&lt;p&gt;
A Conditional Linear Combination Test with Many Weak Instruments. (arXiv:2207.11137v3 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2207.11137
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#20855;&#26377;&#22810;&#20010;&#24369;&#24037;&#20855;&#21644;&#24322;&#26041;&#24046;&#24615;&#30340;IV&#22238;&#24402;&#25512;&#35770;&#30340;&#26465;&#20214;&#32447;&#24615;&#32452;&#21512;&#26816;&#39564;&#65292;&#24182;&#26681;&#25454;&#33258;&#36866;&#24212;&#21040;&#35782;&#21035;&#24378;&#24230;&#30340;&#20915;&#31574;&#29702;&#35770;&#35268;&#21017;&#36873;&#25321;&#20102;&#32447;&#24615;&#32452;&#21512;&#20013;&#30340;&#26435;&#37325;&#12290;&#35813;&#26041;&#27861;&#22312;&#24369;&#35782;&#21035;&#21644;&#24378;&#35782;&#21035;&#24773;&#20917;&#19979;&#22343;&#21487;&#26377;&#25928;&#25511;&#21046;&#28176;&#36817;&#35268;&#27169;&#65292;&#24182;&#19988;&#22312;&#26576;&#20123;&#27979;&#35797;&#31867;&#21035;&#20013;&#21487;&#25509;&#21463;&#12290;&#22312;&#24378;&#35782;&#21035;&#19979;&#65292;&#35813;&#26041;&#27861;&#20855;&#26377;&#26368;&#20339;&#21151;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25506;&#35752;&#20102;&#38024;&#23545;&#20855;&#26377;&#22810;&#20010;&#24369;&#24037;&#20855;&#21644;&#24322;&#26041;&#24046;&#24615;&#30340;IV&#22238;&#24402;&#25512;&#35770;&#30340;&#26480;&#20811;&#32435;&#23572;-&#23433;&#24503;&#26862;-&#40065;&#23486;&#65288;AR&#65289;&#12289;&#26480;&#20811;&#32435;&#23572;-&#25289;&#26684;&#26391;&#26085;&#20056;&#25968;&#65288;LM&#65289;&#21644;&#27491;&#20132;&#26480;&#20811;&#32435;&#23572;-LM&#27979;&#35797;&#30340;&#32447;&#24615;&#32452;&#21512;&#12290;&#25105;&#20204;&#26681;&#25454;&#33258;&#36866;&#24212;&#21040;&#35782;&#21035;&#24378;&#24230;&#30340;&#20915;&#31574;&#29702;&#35770;&#35268;&#21017;&#26469;&#36873;&#25321;&#32452;&#21512;&#20013;&#30340;&#26435;&#37325;&#12290;&#22312;&#24369;&#35782;&#21035;&#21644;&#24378;&#35782;&#21035;&#19979;&#65292;&#25152;&#25552;&#20986;&#30340;&#26816;&#39564;&#25511;&#21046;&#28176;&#36817;&#35268;&#27169;&#24182;&#19988;&#22312;&#26576;&#20123;&#27979;&#35797;&#31867;&#21035;&#20013;&#21487;&#25509;&#21463;&#12290;&#22312;&#24378;&#35782;&#21035;&#19979;&#65292;&#25105;&#20204;&#30340;&#32447;&#24615;&#32452;&#21512;&#26816;&#39564;&#22312;&#22522;&#20110;&#26480;&#20811;&#32435;&#23572;AR&#21644;LM&#27979;&#35797;&#26500;&#24314;&#30340;&#19981;&#21464;&#25110;&#26080;&#20559;&#27979;&#35797;&#31867;&#21035;&#20013;&#65292;&#23545;&#23616;&#37096;&#26367;&#20195;&#26041;&#26696;&#20855;&#26377;&#26368;&#20339;&#21151;&#29575;&#12290;&#27169;&#25311;&#21644;&#23545;Angrist&#21644;Krueger&#65288;1991&#65289;&#25968;&#25454;&#38598;&#30340;&#23454;&#35777;&#24212;&#29992;&#39564;&#35777;&#20102;&#25105;&#20204;&#30340;&#26816;&#39564;&#30340;&#33391;&#22909;&#21151;&#25928;&#12290;
&lt;/p&gt;
&lt;p&gt;
We consider a linear combination of jackknife Anderson-Rubin (AR), jackknife Lagrangian multiplier (LM), and orthogonalized jackknife LM tests for inference in IV regressions with many weak instruments and heteroskedasticity. Following I.Andrews (2016), we choose the weights in the linear combination based on a decision-theoretic rule that is adaptive to the identification strength. Under both weak and strong identifications, the proposed test controls asymptotic size and is admissible among certain class of tests. Under strong identification, our linear combination test has optimal power against local alternatives among the class of invariant or unbiased tests which are constructed based on jackknife AR and LM tests. Simulations and an empirical application to Angrist and Krueger's (1991) dataset confirm the good power properties of our test.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#20855;&#26377;&#26465;&#20214;&#24322;&#26041;&#24046;&#30340;&#39640;&#38454;&#38750;&#32447;&#24615;&#33258;&#22238;&#24402;&#65292;&#35777;&#26126;&#20102;&#22312;&#36866;&#24403;&#26465;&#20214;&#19979;&#23427;&#20204;&#26159;&#27425;&#20960;&#20309;&#36941;&#21382;&#30340;&#12290;&#36825;&#20010;&#32467;&#26524;&#26497;&#22823;&#22320;&#25193;&#23637;&#20102;&#20854;&#28508;&#22312;&#24212;&#29992;&#33539;&#22260;&#12290;</title><link>http://arxiv.org/abs/2205.11953</link><description>&lt;p&gt;
&#32771;&#34385;&#33258;&#22238;&#24402;&#26465;&#20214;&#24322;&#26041;&#24046;&#30340;&#27425;&#20960;&#20309;&#36941;&#21382;&#33258;&#22238;&#24402;
&lt;/p&gt;
&lt;p&gt;
Subgeometrically ergodic autoregressions with autoregressive conditional heteroskedasticity. (arXiv:2205.11953v2 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2205.11953
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#20855;&#26377;&#26465;&#20214;&#24322;&#26041;&#24046;&#30340;&#39640;&#38454;&#38750;&#32447;&#24615;&#33258;&#22238;&#24402;&#65292;&#35777;&#26126;&#20102;&#22312;&#36866;&#24403;&#26465;&#20214;&#19979;&#23427;&#20204;&#26159;&#27425;&#20960;&#20309;&#36941;&#21382;&#30340;&#12290;&#36825;&#20010;&#32467;&#26524;&#26497;&#22823;&#22320;&#25193;&#23637;&#20102;&#20854;&#28508;&#22312;&#24212;&#29992;&#33539;&#22260;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20855;&#26377;&#33258;&#22238;&#24402;&#26465;&#20214;&#24322;&#26041;&#24046;(ARCH)&#30340;&#38750;&#32447;&#24615;&#21333;&#21464;&#37327;&#33258;&#22238;&#24402;&#30340;&#27425;&#20960;&#20309;&#65288;&#20855;&#20307;&#32780;&#35328;&#26159;&#22810;&#39033;&#24335;&#20960;&#20309;&#65289;&#36941;&#21382;&#24615;&#12290;&#27425;&#20960;&#20309;&#36941;&#21382;&#24615;&#26159;1980&#24180;&#20195;&#22312;&#39532;&#23572;&#31185;&#22827;&#38142;&#25991;&#29486;&#20013;&#24341;&#20837;&#30340;&#27010;&#24565;&#65292;&#23427;&#24847;&#21619;&#30528;&#36716;&#31227;&#27010;&#29575;&#27979;&#24230;&#20197;&#27604;&#20960;&#20309;&#32423;&#25968;&#26356;&#24930;&#30340;&#36895;&#29575;&#25910;&#25947;&#20110;&#31283;&#24577;&#27979;&#24230;&#65307;&#32780;&#36825;&#20010;&#36895;&#29575;&#20063;&#19982;$\beta$&#28151;&#21512;&#31995;&#25968;&#30340;&#25910;&#25947;&#36895;&#29575;&#23494;&#20999;&#30456;&#20851;&#12290;&#29616;&#26377;&#27425;&#20960;&#20309;&#36941;&#21382;&#33258;&#22238;&#24402;&#25991;&#29486;&#20551;&#35774;&#35823;&#24046;&#39033;&#26159;&#21516;&#26041;&#24046;&#30340;&#65292;&#26412;&#25991;&#25552;&#20379;&#20102;&#19968;&#20010;&#25193;&#23637;&#65292;&#28085;&#30422;&#20102;&#26377;&#26465;&#20214;&#24322;&#26041;&#24046;ARCH&#31867;&#22411;&#35823;&#24046;&#30340;&#24773;&#20917;&#65292;&#20174;&#32780;&#26497;&#22823;&#22320;&#25193;&#23637;&#20102;&#28508;&#22312;&#24212;&#29992;&#30340;&#33539;&#22260;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#25105;&#20204;&#32771;&#34385;&#36866;&#24403;&#23450;&#20041;&#30340;&#39640;&#38454;&#38750;&#32447;&#24615;&#33258;&#22238;&#24402;&#65292;&#21487;&#33021;&#20855;&#26377;&#38750;&#32447;&#24615;&#30340;ARCH&#35823;&#24046;&#65292;&#24182;&#34920;&#26126;&#22312;&#36866;&#24403;&#26465;&#20214;&#19979;&#65292;&#23427;&#20204;&#26159;&#27425;&#20960;&#20309;&#36941;&#21382;&#30340;&#65292;&#19988;&#36895;&#29575;&#26159;&#22810;&#39033;&#24335;&#30340;&#12290;&#24182;&#19988;&#25105;&#20204;&#21033;&#29992;&#33021;&#28304;&#25968;&#25454;&#25552;&#20379;&#20102;&#19968;&#20010;&#23454;&#35777;&#20363;&#23376;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this paper, we consider subgeometric (specifically, polynomial) ergodicity of univariate nonlinear autoregressions with autoregressive conditional heteroskedasticity (ARCH). The notion of subgeometric ergodicity was introduced in the Markov chain literature in 1980s and it means that the transition probability measures converge to the stationary measure at a rate slower than geometric; this rate is also closely related to the convergence rate of $\beta$-mixing coefficients. While the existing literature on subgeometrically ergodic autoregressions assumes a homoskedastic error term, this paper provides an extension to the case of conditionally heteroskedastic ARCH-type errors, considerably widening the scope of potential applications. Specifically, we consider suitably defined higher-order nonlinear autoregressions with possibly nonlinear ARCH errors and show that they are, under appropriate conditions, subgeometrically ergodic at a polynomial rate. An empirical example using energy 
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#30740;&#31350;&#20102;&#22312;&#23384;&#22312;&#27835;&#30103;&#25928;&#24212;&#24322;&#36136;&#24615;&#30340;&#27169;&#22411;&#20013;&#65292;&#20108;&#38454;&#27573;&#26368;&#23567;&#20108;&#20056;&#27861;&#21487;&#20197;&#30830;&#23450;&#27599;&#31181;&#27835;&#30103;&#26041;&#26696;&#30340;&#20195;&#29702;&#20154;&#29305;&#23450;&#25928;&#24212;&#30340;&#27491;&#26435;&#37325;&#21644;&#30340;&#24517;&#35201;&#19988;&#20805;&#20998;&#26465;&#20214;&#65292;&#20854;&#36866;&#29992;&#20110;&#20219;&#24847;&#25968;&#37327;&#30340;&#27835;&#30103;&#26041;&#26696;&#12289;&#20219;&#24847;&#25968;&#37327;&#30340;&#36830;&#32493;&#25110;&#31163;&#25955;&#24037;&#20855;&#20197;&#21450;&#21253;&#25324;&#21327;&#21464;&#37327;&#22312;&#20869;&#30340;&#24773;&#20917;&#12290;</title><link>http://arxiv.org/abs/2205.07836</link><description>&lt;p&gt;
&#26377;&#22810;&#20010;&#27835;&#30103;&#26041;&#26696;&#30340;&#20108;&#38454;&#27573;&#26368;&#23567;&#20108;&#20056;&#27861;
&lt;/p&gt;
&lt;p&gt;
2SLS with Multiple Treatments. (arXiv:2205.07836v4 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2205.07836
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#30740;&#31350;&#20102;&#22312;&#23384;&#22312;&#27835;&#30103;&#25928;&#24212;&#24322;&#36136;&#24615;&#30340;&#27169;&#22411;&#20013;&#65292;&#20108;&#38454;&#27573;&#26368;&#23567;&#20108;&#20056;&#27861;&#21487;&#20197;&#30830;&#23450;&#27599;&#31181;&#27835;&#30103;&#26041;&#26696;&#30340;&#20195;&#29702;&#20154;&#29305;&#23450;&#25928;&#24212;&#30340;&#27491;&#26435;&#37325;&#21644;&#30340;&#24517;&#35201;&#19988;&#20805;&#20998;&#26465;&#20214;&#65292;&#20854;&#36866;&#29992;&#20110;&#20219;&#24847;&#25968;&#37327;&#30340;&#27835;&#30103;&#26041;&#26696;&#12289;&#20219;&#24847;&#25968;&#37327;&#30340;&#36830;&#32493;&#25110;&#31163;&#25955;&#24037;&#20855;&#20197;&#21450;&#21253;&#25324;&#21327;&#21464;&#37327;&#22312;&#20869;&#30340;&#24773;&#20917;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#22312;&#23384;&#22312;&#27835;&#30103;&#25928;&#24212;&#24322;&#36136;&#24615;&#30340;&#27169;&#22411;&#20013;&#65292;&#20108;&#38454;&#27573;&#26368;&#23567;&#20108;&#20056;&#27861; (2SLS) &#22312;&#22810;&#20010;&#27835;&#30103;&#26041;&#26696;&#20013;&#25152;&#33021;&#30830;&#23450;&#30340;&#20869;&#23481;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#20004;&#20010;&#24517;&#35201;&#19988;&#20805;&#20998;&#30340;&#26465;&#20214;&#65292;&#21363;&#24179;&#22343;&#26465;&#20214;&#21333;&#35843;&#24615;&#21644;&#26080;&#20132;&#21449;&#25928;&#24212;&#65292;&#21487;&#20197;&#30830;&#23450;&#27599;&#31181;&#27835;&#30103;&#26041;&#26696;&#30340;&#20195;&#29702;&#20154;&#29305;&#23450;&#25928;&#24212;&#30340;&#27491;&#26435;&#37325;&#21644;&#12290;&#25105;&#20204;&#30340;&#37492;&#23450;&#20998;&#26512;&#21487;&#20197;&#36866;&#29992;&#20110;&#20219;&#24847;&#25968;&#37327;&#30340;&#27835;&#30103;&#26041;&#26696;&#12289;&#20219;&#24847;&#25968;&#37327;&#30340;&#36830;&#32493;&#25110;&#31163;&#25955;&#24037;&#20855;&#20197;&#21450;&#21253;&#25324;&#21327;&#21464;&#37327;&#22312;&#20869;&#30340;&#24773;&#20917;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#30001;&#25105;&#20204;&#30340;&#37492;&#23450;&#26465;&#20214;&#25152;&#26263;&#31034;&#30340;&#36873;&#25321;&#34892;&#20026;&#30340;&#29305;&#24449;&#65292;&#24182;&#35752;&#35770;&#20102;&#36825;&#20123;&#26465;&#20214;&#22914;&#20309;&#22312;&#23454;&#35777;&#30740;&#31350;&#20013;&#36827;&#34892;&#27979;&#35797;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study what two-stage least squares (2SLS) identifies in models with multiple treatments under treatment effect heterogeneity. Two conditions are shown to be necessary and sufficient for the 2SLS to identify positively weighted sums of agent-specific effects of each treatment: average conditional monotonicity and no cross effects. Our identification analysis allows for any number of treatments, any number of continuous or discrete instruments, and the inclusion of covariates. We provide characterizations of choice behavior implied by our identification conditions and discuss how the conditions can be tested empirically.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#22269;&#23478;&#26377;&#32447;&#30005;&#35270;&#26032;&#38395;&#23545;&#32654;&#22269;&#26412;&#22303;&#25253;&#32440;&#30340;&#24433;&#21709;&#65292;&#21457;&#29616;&#24403;&#22320;&#25253;&#32440;&#30340;&#20869;&#23481;&#20250;&#22240;&#20026;&#24403;&#22320; FNC &#35266;&#20247;&#25968;&#37327;&#30340;&#22686;&#21152;&#32780;&#36235;&#21521;&#20110; FNC &#30340;&#20542;&#21521;&#65292;&#24182;&#19988;&#26377;&#32447;&#30005;&#35270;&#20542;&#21521;&#20250;&#26497;&#21270;&#22320;&#26041;&#26032;&#38395;&#20869;&#23481;&#12290;</title><link>http://arxiv.org/abs/2202.07269</link><description>&lt;p&gt;
&#23186;&#20307;&#20542;&#21521;&#26159;&#20855;&#26377;&#20256;&#26579;&#24615;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
Media Slant is Contagious. (arXiv:2202.07269v2 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2202.07269
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22269;&#23478;&#26377;&#32447;&#30005;&#35270;&#26032;&#38395;&#23545;&#32654;&#22269;&#26412;&#22303;&#25253;&#32440;&#30340;&#24433;&#21709;&#65292;&#21457;&#29616;&#24403;&#22320;&#25253;&#32440;&#30340;&#20869;&#23481;&#20250;&#22240;&#20026;&#24403;&#22320; FNC &#35266;&#20247;&#25968;&#37327;&#30340;&#22686;&#21152;&#32780;&#36235;&#21521;&#20110; FNC &#30340;&#20542;&#21521;&#65292;&#24182;&#19988;&#26377;&#32447;&#30005;&#35270;&#20542;&#21521;&#20250;&#26497;&#21270;&#22320;&#26041;&#26032;&#38395;&#20869;&#23481;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#32771;&#23519;&#20102;&#23186;&#20307;&#20542;&#21521;&#30340;&#20256;&#25773;&#65292;&#20855;&#20307;&#26469;&#35828;&#26159;&#22269;&#23478;&#26377;&#32447;&#30005;&#35270;&#26032;&#38395;&#23545;&#32654;&#22269;&#26412;&#22303;&#25253;&#32440;&#65288;2005-2008&#65289;&#30340;&#24433;&#21709;&#12290;&#25105;&#20204;&#20351;&#29992;&#19968;&#31181;&#22522;&#20110; Fox News Channel&#65288;FNC&#65289;&#12289;CNN &#21644; MSNBC &#20869;&#23481;&#30340;&#26377;&#32447;&#30005;&#35270;&#20542;&#21521;&#25991;&#26412;&#24230;&#37327;&#26041;&#27861;&#65292;&#20998;&#26512;&#22320;&#26041;&#25253;&#32440;&#22914;&#20309;&#37319;&#29992; FNC &#30340;&#20542;&#21521;&#32780;&#19981;&#26159; CNN/MSNBC &#30340;&#20542;&#21521;&#12290;&#30740;&#31350;&#32467;&#26524;&#26174;&#31034;&#65292;&#22320;&#26041;&#26032;&#38395;&#38543;&#30528;&#24403;&#22320; FNC &#35266;&#20247;&#20154;&#25968;&#30340;&#22806;&#37096;&#22686;&#38271;&#32780;&#21464;&#24471;&#26356;&#21152;&#31867;&#20284;&#20110; FNC &#30340;&#20869;&#23481;&#12290;&#36825;&#31181;&#36716;&#21464;&#19981;&#20165;&#38480;&#20110;&#20174;&#26377;&#32447;&#30005;&#35270;&#20511;&#37492;&#65292;&#32780;&#26159;&#22320;&#26041;&#25253;&#32440;&#33258;&#36523;&#20869;&#23481;&#30340;&#25913;&#21464;&#12290;&#27492;&#22806;&#65292;&#26377;&#32447;&#30005;&#35270;&#20542;&#21521;&#26497;&#21270;&#20102;&#22320;&#26041;&#26032;&#38395;&#20869;&#23481;&#12290;
&lt;/p&gt;
&lt;p&gt;
We examine the diffusion of media slant, specifically how partisan content from national cable news affects local newspapers in the U.S., 2005-2008. We use a text-based measure of cable news slant trained on content from Fox News Channel (FNC), CNN, and MSNBC to analyze how local newspapers adopt FNC's slant over CNN/MSNBC's. Our findings show that local news becomes more similar to FNC content in response to an exogenous increase in local FNC viewership. This shift is not limited to borrowing from cable news, but rather, local newspapers' own content changes. Further, cable TV slant polarizes local news content.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#22914;&#20309;&#22312;&#26377;&#38480;&#25968;&#37327;&#30340;&#22823;&#31751;&#20013;&#36827;&#34892;&#23454;&#39564;&#35774;&#35745;&#65292;&#20272;&#35745;&#21644;&#25512;&#26029;&#26368;&#22823;&#31119;&#21033;&#25919;&#31574;&#65292;&#24182;&#25552;&#20986;&#21333;&#27874;&#23454;&#39564;&#21644;&#22810;&#27874;&#23454;&#39564;&#30340;&#26041;&#27861;&#26469;&#35299;&#20915;&#28322;&#20986;&#25928;&#24212;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2011.08174</link><description>&lt;p&gt;
&#26410;&#30693;&#24178;&#25200;&#23454;&#39564;&#20013;&#30340;&#25919;&#31574;&#35774;&#35745;
&lt;/p&gt;
&lt;p&gt;
Policy design in experiments with unknown interference. (arXiv:2011.08174v7 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2011.08174
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22914;&#20309;&#22312;&#26377;&#38480;&#25968;&#37327;&#30340;&#22823;&#31751;&#20013;&#36827;&#34892;&#23454;&#39564;&#35774;&#35745;&#65292;&#20272;&#35745;&#21644;&#25512;&#26029;&#26368;&#22823;&#31119;&#21033;&#25919;&#31574;&#65292;&#24182;&#25552;&#20986;&#21333;&#27874;&#23454;&#39564;&#21644;&#22810;&#27874;&#23454;&#39564;&#30340;&#26041;&#27861;&#26469;&#35299;&#20915;&#28322;&#20986;&#25928;&#24212;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#28322;&#20986;&#25928;&#24212;&#23384;&#22312;&#30340;&#24773;&#20917;&#19979;&#20272;&#35745;&#21644;&#25512;&#26029;&#26368;&#22823;&#31119;&#21033;&#25919;&#31574;&#30340;&#23454;&#39564;&#35774;&#35745;&#12290;&#23558;&#21333;&#20803;&#32452;&#32455;&#25104;&#26377;&#38480;&#25968;&#37327;&#30340;&#22823;&#31751;&#65292;&#24182;&#22312;&#27599;&#20010;&#31751;&#20869;&#20197;&#26410;&#30693;&#30340;&#26041;&#24335;&#30456;&#20114;&#20316;&#29992;&#12290;&#20316;&#20026;&#31532;&#19968;&#39033;&#36129;&#29486;&#65292;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21333;&#27874;&#23454;&#39564;&#65292;&#36890;&#36807;&#22312;&#31751;&#23545;&#38388;&#20180;&#32454;&#21464;&#21270;&#38543;&#26426;&#21270;&#65292;&#32771;&#34385;&#28322;&#20986;&#25928;&#24212;&#20272;&#35745;&#27835;&#30103;&#27010;&#29575;&#21464;&#21270;&#30340;&#36793;&#38469;&#25928;&#24212;&#12290;&#21033;&#29992;&#36825;&#20010;&#36793;&#38469;&#25928;&#24212;&#65292;&#25991;&#31456;&#25552;&#20986;&#20102;&#19968;&#20010;&#26816;&#39564;&#25919;&#31574;&#26368;&#20248;&#24615;&#30340;&#27979;&#35797;&#12290;&#20316;&#20026;&#31532;&#20108;&#39033;&#36129;&#29486;&#65292;&#26412;&#25991;&#35774;&#35745;&#20102;&#19968;&#20010;&#22810;&#27874;&#23454;&#39564;&#65292;&#20272;&#35745;&#27835;&#30103;&#35268;&#21017;&#24182;&#26368;&#22823;&#21270;&#31119;&#21033;&#12290;&#26412;&#25991;&#23545;&#26368;&#22823;&#21487;&#36798;&#31119;&#21033;&#20110;&#25152;&#20272;&#35745;&#25919;&#31574;&#35780;&#20272;&#19979;&#31119;&#21033;&#20043;&#38388;&#30340;&#24046;&#24322;&#32473;&#20986;&#20102;&#24378;&#26377;&#21147;&#30340;&#23567;&#26679;&#26412;&#20445;&#35777;&#12290;&#20316;&#32773;&#22312;&#26681;&#25454;&#29616;&#26377;&#20851;&#20110;&#20449;&#24687;&#20256;&#25773;&#21644;&#29616;&#37329;&#36716;&#31227;&#35745;&#21010;&#30340;&#23454;&#39564;&#27169;&#25311;&#21644;&#22823;&#35268;&#27169;&#29616;&#22330;&#23454;&#39564;&#20013;&#25552;&#20379;&#20102;&#36825;&#31181;&#26041;&#27861;&#30340;&#29305;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper studies experimental designs for estimation and inference on welfare-maximizing policies in the presence of spillover effects. Units are organized into a finite number of large clusters and interact in unknown ways within each cluster. As a first contribution, I introduce a single-wave experiment that, by carefully varying the randomization across cluster pairs, estimates the marginal effect of a change in treatment probabilities, taking spillover effects into account. Using the marginal effect, I propose a test for policy optimality. As a second contribution, I design a multiple-wave experiment to estimate treatment rules and maximize welfare. I derive strong small-sample guarantees on the difference between the maximum attainable welfare and the welfare evaluated at the estimated policy. I illustrate the method's properties in simulations calibrated to existing experiments on information diffusion and cash-transfer programs, and in a large scale field experiment implemente
&lt;/p&gt;</description></item></channel></rss>