<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#24314;&#27169;&#38750;&#23395;&#33410;&#24615;&#35843;&#25972;&#30340;&#21407;&#22987;&#25968;&#25454;&#30340;&#21608;&#26399;&#24615;&#29305;&#24449;&#65292;&#23454;&#29616;&#20102;&#30452;&#25509;&#30340;&#32467;&#26500;&#25512;&#26029;&#65292;&#20174;&#32780;&#21487;&#20197;&#25429;&#25417;&#23395;&#33410;&#25928;&#24212;&#24182;&#33719;&#24471;&#26356;&#31934;&#32454;&#30340;&#32467;&#26524;&#12290;</title><link>http://arxiv.org/abs/2401.14545</link><description>&lt;p&gt;
&#32467;&#26500;&#24615;&#21608;&#26399;&#24615;&#21521;&#37327;&#33258;&#22238;&#24402;
&lt;/p&gt;
&lt;p&gt;
Structural Periodic Vector Autoregressions. (arXiv:2401.14545v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.14545
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#24314;&#27169;&#38750;&#23395;&#33410;&#24615;&#35843;&#25972;&#30340;&#21407;&#22987;&#25968;&#25454;&#30340;&#21608;&#26399;&#24615;&#29305;&#24449;&#65292;&#23454;&#29616;&#20102;&#30452;&#25509;&#30340;&#32467;&#26500;&#25512;&#26029;&#65292;&#20174;&#32780;&#21487;&#20197;&#25429;&#25417;&#23395;&#33410;&#25928;&#24212;&#24182;&#33719;&#24471;&#26356;&#31934;&#32454;&#30340;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#20351;&#29992;&#32467;&#26500;&#21464;&#37327;&#33258;&#22238;&#24402;&#65288;SVAR&#65289;&#22788;&#29702;&#32463;&#36807;&#23395;&#33410;&#35843;&#25972;&#30340;&#23439;&#35266;&#32463;&#27982;&#25968;&#25454;&#20043;&#21069;&#65292;&#36890;&#24120;&#38656;&#35201;&#36890;&#36807;&#23395;&#33410;&#35843;&#25972;&#25216;&#26415;&#21435;&#38500;&#21407;&#22987;&#25968;&#25454;&#20013;&#30340;&#23395;&#33410;&#24615;&#12290;&#28982;&#32780;&#65292;&#36825;&#31181;&#26041;&#27861;&#21487;&#33021;&#20250;&#25197;&#26354;&#25968;&#25454;&#20013;&#25152;&#21253;&#21547;&#30340;&#26377;&#20215;&#20540;&#20449;&#24687;&#12290;&#20316;&#20026;&#19968;&#31181;&#26367;&#20195;&#26041;&#27861;&#65292;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#30452;&#25509;&#24314;&#27169;&#38750;&#23395;&#33410;&#24615;&#35843;&#25972;&#30340;&#21407;&#22987;&#25968;&#25454;&#21608;&#26399;&#24615;&#29305;&#24449;&#30340;&#26041;&#27861;&#65292;&#21363;&#32467;&#26500;&#24615;&#21608;&#26399;&#24615;&#21521;&#37327;&#33258;&#22238;&#24402;&#65288;SPVAR&#65289;&#65292;&#20854;&#22522;&#20110;&#21608;&#26399;&#24615;&#21521;&#37327;&#33258;&#22238;&#24402;&#65288;PVAR&#65289;&#20316;&#20026;&#32422;&#21270;&#24418;&#24335;&#27169;&#22411;&#12290;&#19982;VAR&#30456;&#27604;&#65292;PVAR&#19981;&#20165;&#21487;&#20197;&#20801;&#35768;&#21608;&#26399;&#24615;&#21464;&#21270;&#30340;&#25130;&#36317;&#65292;&#36824;&#21487;&#20197;&#20801;&#35768;&#21608;&#26399;&#24615;&#33258;&#22238;&#24402;&#21442;&#25968;&#21644;&#21019;&#26032;&#26041;&#24046;&#12290;&#30001;&#20110;&#36825;&#31181;&#26356;&#22823;&#30340;&#28789;&#27963;&#24615;&#20063;&#23548;&#33268;&#21442;&#25968;&#25968;&#37327;&#22686;&#21152;&#65292;&#22240;&#27492;&#25105;&#20204;&#25552;&#20986;&#20102;&#32447;&#24615;&#32422;&#26463;&#20272;&#35745;&#25216;&#26415;&#12290;&#24635;&#20307;&#32780;&#35328;&#65292;SPVAR&#21487;&#20197;&#25429;&#25417;&#23395;&#33410;&#25928;&#24212;&#65292;&#24182;&#23454;&#29616;&#30452;&#25509;&#21644;&#26356;&#31934;&#32454;&#30340;&#32467;&#26500;&#25512;&#26029;&#12290;
&lt;/p&gt;
&lt;p&gt;
While seasonality inherent to raw macroeconomic data is commonly removed by seasonal adjustment techniques before it is used for structural inference, this approach might distort valuable information contained in the data. As an alternative method to commonly used structural vector autoregressions (SVAR) for seasonally adjusted macroeconomic data, this paper offers an approach in which the periodicity of not seasonally adjusted raw data is modeled directly by structural periodic vector autoregressions (SPVAR) that are based on periodic vector autoregressions (PVAR) as the reduced form model. In comparison to a VAR, the PVAR does allow not only for periodically time-varying intercepts, but also for periodic autoregressive parameters and innovations variances, respectively. As this larger flexibility leads also to an increased number of parameters, we propose linearly constrained estimation techniques. Overall, SPVARs allow to capture seasonal effects and enable a direct and more refined
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#20174;&#29702;&#35770;&#21644;&#27169;&#25311;&#30340;&#23618;&#38754;&#65292;&#30740;&#31350;&#20102;$p$-hacking&#30340;&#21487;&#33021;&#24418;&#24335;&#23545;$p-value$&#20998;&#24067;&#21644;&#29616;&#26377;&#26816;&#27979;&#26041;&#27861;&#30340;&#24433;&#21709;&#65292;&#35777;&#26126;&#20102;&#27979;&#35797;&#25581;&#31034;&#8220;p-hacking&#8221;&#30340;&#33021;&#21147;&#21487;&#33021;&#38750;&#24120;&#20302;&#65292;&#24182;&#19988;&#20851;&#38190;&#21462;&#20915;&#20110;&#20855;&#20307;&#30340;$p$-hacking&#31574;&#30053;&#21644;&#30740;&#31350;&#27979;&#35797;&#30340;&#23454;&#38469;&#25928;&#26524;&#30340;&#20998;&#24067;&#12290;</title><link>http://arxiv.org/abs/2205.07950</link><description>&lt;p&gt;
&#27979;&#35797;&#25581;&#31034;&#8220;p-hacking&#8221;&#30340;&#33021;&#21147;
&lt;/p&gt;
&lt;p&gt;
The Power of Tests for Detecting $p$-Hacking. (arXiv:2205.07950v2 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2205.07950
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20174;&#29702;&#35770;&#21644;&#27169;&#25311;&#30340;&#23618;&#38754;&#65292;&#30740;&#31350;&#20102;$p$-hacking&#30340;&#21487;&#33021;&#24418;&#24335;&#23545;$p-value$&#20998;&#24067;&#21644;&#29616;&#26377;&#26816;&#27979;&#26041;&#27861;&#30340;&#24433;&#21709;&#65292;&#35777;&#26126;&#20102;&#27979;&#35797;&#25581;&#31034;&#8220;p-hacking&#8221;&#30340;&#33021;&#21147;&#21487;&#33021;&#38750;&#24120;&#20302;&#65292;&#24182;&#19988;&#20851;&#38190;&#21462;&#20915;&#20110;&#20855;&#20307;&#30340;$p$-hacking&#31574;&#30053;&#21644;&#30740;&#31350;&#27979;&#35797;&#30340;&#23454;&#38469;&#25928;&#26524;&#30340;&#20998;&#24067;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
$p$-Hacking&#21487;&#33021;&#20250;&#21066;&#24369;&#32463;&#39564;&#30740;&#31350;&#30340;&#26377;&#25928;&#24615;&#12290;&#19968;&#31687;&#32321;&#33635;&#30340;&#32463;&#39564;&#25991;&#29486;&#35843;&#26597;&#20102;&#22522;&#20110;&#25253;&#21578;&#30340;$p$-value&#22312;&#30740;&#31350;&#20013;&#30340;&#20998;&#24067;&#30340;$p$-hacking&#30340;&#26222;&#36941;&#23384;&#22312;&#12290;&#35299;&#37322;&#36825;&#20010;&#25991;&#29486;&#20013;&#30340;&#32467;&#26524;&#38656;&#35201;&#20180;&#32454;&#29702;&#35299;&#29992;&#20110;&#26816;&#27979;&#19981;&#21516;&#31867;&#22411;$p$-hacking&#30340;&#26041;&#27861;&#30340;&#33021;&#21147;&#12290;&#25105;&#20204;&#20174;&#29702;&#35770;&#19978;&#30740;&#31350;&#20102;$p$-hacking&#30340;&#21487;&#33021;&#24418;&#24335;&#23545;&#25253;&#21578;&#30340;$p$-value&#20998;&#24067;&#21644;&#29616;&#26377;&#26816;&#27979;&#26041;&#27861;&#30340;&#33021;&#21147;&#30340;&#24433;&#21709;&#12290;&#33021;&#21147;&#21487;&#33021;&#38750;&#24120;&#20302;&#65292;&#20851;&#38190;&#21462;&#20915;&#20110;&#29305;&#23450;&#30340;$p$-hacking&#31574;&#30053;&#21644;&#30740;&#31350;&#27979;&#35797;&#30340;&#23454;&#38469;&#25928;&#26524;&#30340;&#20998;&#24067;&#12290;&#20986;&#29256;&#20559;&#24046;&#21487;&#20197;&#22686;&#24378;&#27979;&#35797;&#26080;$p$-hacking&#21644;&#26080;&#20986;&#29256;&#20559;&#24046;&#30340;&#32852;&#21512;&#38646;&#20551;&#35774;&#30340;&#33021;&#21147;&#12290;&#25105;&#20204;&#23558;&#27979;&#35797;&#30340;&#33021;&#21147;&#19982;$p$-hacking&#30340;&#25104;&#26412;&#30456;&#20851;&#32852;&#65292;&#24182;&#26174;&#31034;&#24403;$p$-hacking&#38750;&#24120;&#26114;&#36149;&#26102;&#65292;&#33021;&#21147;&#20542;&#21521;&#20110;&#26356;&#22823;&#12290;&#33945;&#29305;&#21345;&#32599;&#27169;&#25311;&#25903;&#25345;&#25105;&#20204;&#30340;&#29702;&#35770;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
$p$-Hacking can undermine the validity of empirical studies. A flourishing empirical literature investigates the prevalence of $p$-hacking based on the empirical distribution of reported $p$-values across studies. Interpreting results in this literature requires a careful understanding of the power of methods used to detect different types of $p$-hacking. We theoretically study the implications of likely forms of $p$-hacking on the distribution of reported $p$-values and the power of existing methods for detecting it. Power can be quite low, depending crucially on the particular $p$-hacking strategy and the distribution of actual effects tested by the studies. Publication bias can enhance the power for testing the joint null hypothesis of no $p$-hacking and no publication bias. We relate the power of the tests to the costs of $p$-hacking and show that power tends to be larger when $p$-hacking is very costly. Monte Carlo simulations support our theoretical results.
&lt;/p&gt;</description></item></channel></rss>