<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#30123;&#24773;&#26399;&#38388;&#65292;&#33889;&#33796;&#29273;&#23478;&#24237;&#30340;&#20648;&#33988;&#29575;&#21019;&#19979;&#21382;&#21490;&#26032;&#39640;&#65292;&#28982;&#32780;&#65292;&#30001;&#20110;&#20648;&#33988;&#23545;&#32463;&#27982;&#20135;&#29983;&#20102;&#36127;&#38754;&#24433;&#21709;&#65292;&#20250;&#23548;&#33268;&#38656;&#27714;&#19979;&#38477;&#12289;&#29983;&#20135;&#19979;&#38477;&#12289;&#25910;&#20837;&#19979;&#38477;&#31561;&#19968;&#31995;&#21015;&#36830;&#38145;&#21453;&#24212;&#12290;</title><link>http://arxiv.org/abs/2304.02573</link><description>&lt;p&gt;
&#30123;&#24773;&#26399;&#38388;&#33889;&#33796;&#29273;&#23478;&#24237;&#30340;&#20648;&#33988;: &#24212;&#23545;&#19981;&#26029;&#19978;&#28072;&#30340;&#36890;&#36135;&#33192;&#32960;&#30340;&#19968;&#31181;&#26041;&#24335;?
&lt;/p&gt;
&lt;p&gt;
Portuguese Households Savings in Times of Pandemic: A Way to Better Resist the Escalating Inflation?. (arXiv:2304.02573v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.02573
&lt;/p&gt;
&lt;p&gt;
&#30123;&#24773;&#26399;&#38388;&#65292;&#33889;&#33796;&#29273;&#23478;&#24237;&#30340;&#20648;&#33988;&#29575;&#21019;&#19979;&#21382;&#21490;&#26032;&#39640;&#65292;&#28982;&#32780;&#65292;&#30001;&#20110;&#20648;&#33988;&#23545;&#32463;&#27982;&#20135;&#29983;&#20102;&#36127;&#38754;&#24433;&#21709;&#65292;&#20250;&#23548;&#33268;&#38656;&#27714;&#19979;&#38477;&#12289;&#29983;&#20135;&#19979;&#38477;&#12289;&#25910;&#20837;&#19979;&#38477;&#31561;&#19968;&#31995;&#21015;&#36830;&#38145;&#21453;&#24212;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
2020&#24180;3&#26376;&#30340;&#23553;&#38145;&#20351;&#33889;&#33796;&#29273;&#30340;&#20648;&#33988;&#29575;&#36798;&#21040;&#21382;&#21490;&#26368;&#39640;&#27700;&#24179;&#65292;&#22312;2021&#24180;&#21021;&#36798;&#21040;&#21487;&#25903;&#37197;&#24635;&#25910;&#20837;&#30340;13.4%(INE,2023)&#12290;&#35201;&#25214;&#21040;&#31867;&#20284;&#30340;&#20648;&#33988;&#25968;&#25454;&#65292;&#25105;&#20204;&#38656;&#35201;&#22238;&#21040;1999&#24180;&#12290;&#30001;&#20110;&#27809;&#26377;&#20854;&#20182;&#28040;&#36153;&#36873;&#25321;&#65292;&#23478;&#24237;&#20943;&#23569;&#20102;&#25903;&#20986;&#12290;&#28040;&#36153;&#12289;&#20648;&#33988;&#21644;&#25910;&#20837;&#20043;&#38388;&#30340;&#20851;&#31995;&#22312;&#32463;&#27982;&#24605;&#24819;&#20013;&#21344;&#25454;&#20102;&#37325;&#35201;&#22320;&#20301; [(Keynes, 1936; 1937); (Friedman, 1957)]&#12290;&#20256;&#32479;&#19978;&#65292;&#39640;&#27700;&#24179;&#30340;&#20648;&#33988;&#19982;&#32463;&#27982;&#21463;&#30410;&#26377;&#20851;&#65292;&#22240;&#20026;&#34701;&#36164;&#33021;&#21147;&#24471;&#21040;&#25552;&#21319;(Singh,2010)&#12290;&#28982;&#32780;&#65292;&#36825;&#37324;&#30340;&#24433;&#21709;&#21487;&#33021;&#26159;&#20004;&#38754;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
March 2020 confinement has shot Portuguese savings to historic levels, reaching 13.4% of gross disposable income in early 2021 (INE, 2023). To find similar savings figures we need to go back to 1999. With consumption reduced to a bare minimum, the Portuguese were forced to save. Households reduced spending more because of a lack of alternatives to consumption than for any other reason. The relationship between consumption, savings, and income has occupied an important role in economic thought [(Keynes, 1936; 1937); (Friedman, 1957)]. Traditionally, high levels of savings have been associated with benefits to the economy, since financing capacity is enhanced (Singh, 2010). However, the effects here can be twofold. On the one hand, it seems that Portugal faced the so-called Savings Paradox (Keynes, 1936). If consumers decide to save a considerable part of their income, there will be less demand for the goods produced. Lower demand will lead to lower supply, production, income, and, parad
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#34892;&#20026;&#29702;&#35770;&#26469;&#21152;&#24378;Wardrop&#22343;&#34913;&#22522;&#30784;&#65292;&#35813;&#29702;&#35770;&#21487;&#20197;&#36890;&#36807;&#26377;&#38480;&#29702;&#24615;&#30340;&#26053;&#34892;&#32773;&#29609;&#30340;&#36335;&#24452;&#28216;&#25103;&#36798;&#21040;Wardrop&#22343;&#34913;&#21644;&#20840;&#23616;&#31283;&#23450;&#12290;</title><link>http://arxiv.org/abs/2304.02500</link><description>&lt;p&gt;
Wardrop&#22343;&#34913;&#21487;&#20197;&#34987;&#26377;&#38480;&#29702;&#24615;&#36827;&#34892;&#36793;&#30028;&#38480;&#21046;&#65306;&#36335;&#24452;&#36873;&#25321;&#30340;&#26032;&#34892;&#20026;&#29702;&#35770;&#12290;
&lt;/p&gt;
&lt;p&gt;
Wardrop Equilibrium Can Be Boundedly Rational: A New Behavioral Theory of Route Choice. (arXiv:2304.02500v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.02500
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#34892;&#20026;&#29702;&#35770;&#26469;&#21152;&#24378;Wardrop&#22343;&#34913;&#22522;&#30784;&#65292;&#35813;&#29702;&#35770;&#21487;&#20197;&#36890;&#36807;&#26377;&#38480;&#29702;&#24615;&#30340;&#26053;&#34892;&#32773;&#29609;&#30340;&#36335;&#24452;&#28216;&#25103;&#36798;&#21040;Wardrop&#22343;&#34913;&#21644;&#20840;&#23616;&#31283;&#23450;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20316;&#20026;&#20132;&#36890;&#31185;&#23398;&#20013;&#26368;&#22522;&#26412;&#30340;&#27010;&#24565;&#20043;&#19968;, Wardrop &#22343;&#34913;&#19968;&#30452;&#32570;&#20047;&#30456;&#23545;&#36739;&#24378;&#30340;&#34892;&#20026;&#23398;&#25903;&#25745;&#12290;&#20026;&#20102;&#21152;&#24378;&#36825;&#19968;&#22522;&#30784;&#65292;&#24517;&#39035;&#32771;&#34385;&#20154;&#31867;&#20915;&#31574;&#36807;&#31243;&#20013;&#30340;&#26377;&#38480;&#29702;&#24615;&#65292;&#22914;&#32570;&#20047;&#20934;&#30830;&#20449;&#24687;&#12289;&#26377;&#38480;&#30340;&#35745;&#31639;&#33021;&#21147;&#21644;&#27425;&#20248;&#36873;&#25321;&#12290;&#28982;&#32780;&#65292;&#25991;&#29486;&#20013;&#30340;&#36825;&#31181;&#23545;&#34892;&#20026;&#23436;&#32654;&#20027;&#20041;&#30340;&#25918;&#24323;&#36890;&#24120;&#20276;&#38543;&#30528;WE&#30340;&#27010;&#24565;&#20462;&#25913;&#12290;&#22312;&#36825;&#37324;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#25918;&#24323;&#23436;&#32654;&#29702;&#24615;&#19981;&#24517;&#23548;&#33268;WE&#30340;&#31163;&#24320;&#12290;&#30456;&#21453;&#65292;&#19968;&#31181;&#31216;&#20026;&#32047;&#31215;logit&#65288;CULO&#65289;&#30340;&#21160;&#24577;&#27169;&#22411;&#21487;&#20197;&#36890;&#36807;&#26377;&#38480;&#29702;&#24615;&#26053;&#34892;&#32773;&#29609;&#30340;&#36335;&#24452;&#28216;&#25103;&#36798;&#21040;WE&#21644;&#20840;&#23616;&#31283;&#23450;&#12290;&#25105;&#20204;&#36890;&#36807;&#24320;&#21457;&#19968;&#31181;&#31216;&#20026;&#27599;&#26085;&#65288;DTD&#65289;&#30340;&#21160;&#24577;&#27169;&#22411;&#36798;&#25104;&#20102;&#36825;&#20010;&#32467;&#26524;&#65292;&#35813;&#27169;&#22411;&#27169;&#25311;&#26053;&#23458;&#26681;&#25454;&#36807;&#21435;&#30340;&#32463;&#39564;&#36880;&#28176;&#35843;&#25972;&#20854;&#36335;&#24452;&#20215;&#20540;&#65292;&#20174;&#32780;&#24471;&#21040;&#20102;&#36873;&#25321;&#27010;&#29575;&#12290;&#25105;&#20204;&#30340;&#27169;&#22411;&#31867;&#20284;&#20110;&#32463;&#20856;&#30340;DTD&#27169;&#22411;&#65292;&#20294;&#21457;&#29983;&#20102;&#37325;&#22823;&#21464;&#21270;&#65306;&#32463;&#20856;&#27169;&#22411;&#20013;&#37319;&#21462;&#23454;&#25968;&#65292;&#32780;CULO&#27169;&#22411;&#20351;&#29992;&#31215;&#26497;&#30340;&#25972;&#25968;&#12290;
&lt;/p&gt;
&lt;p&gt;
As one of the most fundamental concepts in transportation science, Wardrop equilibrium (WE) has always had a relatively weak behavioral underpinning. To strengthen this foundation, one must reckon with bounded rationality in human decision-making processes, such as the lack of accurate information, limited computing power, and sub-optimal choices. This retreat from behavioral perfectionism in the literature, however, was typically accompanied by a conceptual modification of WE. Here we show that giving up perfect rationality need not force a departure from WE. On the contrary, WE can be reached with global stability in a routing game played by boundedly rational travelers. We achieve this result by developing a day-to-day (DTD) dynamical model that mimics how travelers gradually adjust their route valuations, hence choice probabilities, based on past experiences. Our model, called cumulative logit (CULO), resembles the classical DTD models but makes a crucial change: whereas the classi
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#21360;&#24230;&#21046;&#36896;&#19994;&#21644;&#24037;&#19994;&#24030;&#20869;&#30340;&#36328;&#21306;&#22495;&#20869;&#37096;&#34892;&#19994;&#24046;&#24322;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#20302;&#25928;&#29575;&#26159;&#30001;&#39640;&#25216;&#33021;&#21171;&#21160;&#21147;&#20379;&#24212;&#21644;&#21319;&#32423;&#25216;&#26415;&#19981;&#22343;&#21248;&#20998;&#24067;&#25152;&#39537;&#21160;&#30340;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20123;&#24046;&#24322;&#65292;&#26412;&#25991;&#24314;&#35758;&#25919;&#31574;&#21046;&#23450;&#32773;&#22312;&#20840;&#21360;&#24230;&#22320;&#21306;&#25512;&#24191;&#21171;&#21160;&#21147;&#22521;&#35757;&#21644;&#25216;&#26415;&#20419;&#36827;&#35745;&#21010;&#12290;</title><link>http://arxiv.org/abs/2304.02430</link><description>&lt;p&gt;
&#36328;&#21306;&#22495;&#20869;&#37096;&#34892;&#19994;&#24046;&#24322;&#27604;&#36739;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
A Comparative Study of Inter-Regional Intra-Industry Disparity. (arXiv:2304.02430v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.02430
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#21360;&#24230;&#21046;&#36896;&#19994;&#21644;&#24037;&#19994;&#24030;&#20869;&#30340;&#36328;&#21306;&#22495;&#20869;&#37096;&#34892;&#19994;&#24046;&#24322;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#20302;&#25928;&#29575;&#26159;&#30001;&#39640;&#25216;&#33021;&#21171;&#21160;&#21147;&#20379;&#24212;&#21644;&#21319;&#32423;&#25216;&#26415;&#19981;&#22343;&#21248;&#20998;&#24067;&#25152;&#39537;&#21160;&#30340;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20123;&#24046;&#24322;&#65292;&#26412;&#25991;&#24314;&#35758;&#25919;&#31574;&#21046;&#23450;&#32773;&#22312;&#20840;&#21360;&#24230;&#22320;&#21306;&#25512;&#24191;&#21171;&#21160;&#21147;&#22521;&#35757;&#21644;&#25216;&#26415;&#20419;&#36827;&#35745;&#21010;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#36873;&#23450;&#30340;&#21360;&#24230;&#21046;&#36896;&#19994;&#21644;&#24037;&#19994;&#24030;&#20869;&#30340;&#36328;&#21306;&#22495;&#20869;&#37096;&#34892;&#19994;&#24046;&#24322;&#12290;&#30740;&#31350;&#20351;&#29992;&#20102;&#19977;&#20010;&#34913;&#37327;&#26631;&#20934;&#8212;&#8212;&#20135;&#20986;&#36164;&#26412;&#27604;&#12289;&#36164;&#26412;&#21171;&#21160;&#27604;&#21644;&#36755;&#20986;&#21171;&#21160;&#27604;&#8212;&#8212;&#26469;&#35780;&#20272;&#24179;&#22343;&#25928;&#29575;&#20197;&#21450;&#36164;&#26412;&#23494;&#38598;&#24230;&#30340;&#24046;&#24322;&#27700;&#24179;&#12290;&#27492;&#22806;&#65292;&#26412;&#25991;&#36824;&#27604;&#36739;&#20102;&#20845;&#20010;&#20027;&#35201;&#24037;&#19994;&#24030;&#30340;&#20154;&#22343;&#25910;&#20837;&#24046;&#24322;&#29575;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#20302;&#25928;&#29575;&#26159;&#30001;&#39640;&#25216;&#33021;&#21171;&#21160;&#21147;&#20379;&#24212;&#21644;&#21319;&#32423;&#25216;&#26415;&#19981;&#22343;&#21248;&#20998;&#24067;&#25152;&#39537;&#21160;&#30340;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20123;&#24046;&#24322;&#65292;&#26412;&#25991;&#24314;&#35758;&#25919;&#31574;&#21046;&#23450;&#32773;&#22312;&#20840;&#21360;&#24230;&#22320;&#21306;&#25512;&#24191;&#21171;&#21160;&#21147;&#22521;&#35757;&#21644;&#25216;&#26415;&#20419;&#36827;&#35745;&#21010;&#12290;&#30740;&#31350;&#35748;&#20026;&#65292;&#36890;&#36807;&#36825;&#26679;&#20570;&#65292;&#35813;&#22269;&#21487;&#20197;&#20943;&#23569;&#22320;&#21306;&#19981;&#24179;&#31561;&#24182;&#25913;&#21892;&#25152;&#26377;&#20154;&#30340;&#32463;&#27982;&#25104;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper investigates the inter-regional intra-industry disparity within selected Indian manufacturing industries and industrial states. The study uses three measures - the Output-Capital Ratio, the Capital-Labor Ratio, and the Output-Labor Ratio - to critically evaluate the level of disparity in average efficiency of labor and capital, as well as capital intensity. Additionally, the paper compares the rate of disparity of per capita income between six major industrial states. The study finds that underutilization of capacity is driven by an unequal distribution of high-skilled labor supply and upgraded technologies. To address these disparities, the paper suggests that policymakers campaign for labor training and technology promotion schemes throughout all regions of India. By doing so, the study argues, the country can reduce regional inequality and improve economic outcomes for all.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#21512;&#25104;&#25511;&#21046;&#26041;&#27861;&#65292;&#21487;&#20197;&#35780;&#20272;&#19968;&#31181;&#27835;&#30103;&#23545;&#20110;&#22810;&#20010;&#32467;&#26524;&#21464;&#37327;&#30340;&#24433;&#21709;&#12290;&#22312;&#20351;&#29992;&#35813;&#26041;&#27861;&#20272;&#35745;&#29790;&#20856;&#22312;COVID-19&#22823;&#27969;&#34892;&#20013;&#38750;&#33647;&#29289;&#24178;&#39044;&#25514;&#26045;&#30340;&#25928;&#26524;&#26102;&#65292;&#25105;&#20204;&#24471;&#20986;&#32467;&#35770;&#65306;&#22914;&#26524;&#29790;&#20856;&#22312;3&#26376;&#20221;&#20687;&#27431;&#27954;&#20854;&#20182;&#22269;&#23478;&#19968;&#26679;&#23454;&#26045;&#20102;&#26356;&#20005;&#26684;&#30340;&#38750;&#33647;&#29289;&#24178;&#39044;&#25514;&#26045;&#65292;&#37027;&#20040;&#21040;7&#26376;&#20221;&#65292;COVID-19&#24863;&#26579;&#30149;&#20363;&#21644;&#27515;&#20129;&#20154;&#25968;&#23558;&#20943;&#23569;&#32422;70&#65285;&#65292;&#32780;&#22312;5&#26376;&#21021;&#25152;&#26377;&#21407;&#22240;&#30340;&#27515;&#20129;&#20154;&#25968;&#23558;&#20943;&#23569;&#32422;20&#65285;&#12290;</title><link>http://arxiv.org/abs/2304.02272</link><description>&lt;p&gt;
&#24102;&#22810;&#20010;&#32467;&#26524;&#30340;&#21512;&#25104;&#25511;&#21046;&#65306;COVID-19&#22823;&#27969;&#34892;&#20013;&#20272;&#35745;&#38750;&#33647;&#29289;&#24178;&#39044;&#25928;&#26524;
&lt;/p&gt;
&lt;p&gt;
Synthetic Controls with Multiple Outcomes: Estimating the Effects of Non-Pharmaceutical Interventions in the COVID-19 Pandemic. (arXiv:2304.02272v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.02272
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#21512;&#25104;&#25511;&#21046;&#26041;&#27861;&#65292;&#21487;&#20197;&#35780;&#20272;&#19968;&#31181;&#27835;&#30103;&#23545;&#20110;&#22810;&#20010;&#32467;&#26524;&#21464;&#37327;&#30340;&#24433;&#21709;&#12290;&#22312;&#20351;&#29992;&#35813;&#26041;&#27861;&#20272;&#35745;&#29790;&#20856;&#22312;COVID-19&#22823;&#27969;&#34892;&#20013;&#38750;&#33647;&#29289;&#24178;&#39044;&#25514;&#26045;&#30340;&#25928;&#26524;&#26102;&#65292;&#25105;&#20204;&#24471;&#20986;&#32467;&#35770;&#65306;&#22914;&#26524;&#29790;&#20856;&#22312;3&#26376;&#20221;&#20687;&#27431;&#27954;&#20854;&#20182;&#22269;&#23478;&#19968;&#26679;&#23454;&#26045;&#20102;&#26356;&#20005;&#26684;&#30340;&#38750;&#33647;&#29289;&#24178;&#39044;&#25514;&#26045;&#65292;&#37027;&#20040;&#21040;7&#26376;&#20221;&#65292;COVID-19&#24863;&#26579;&#30149;&#20363;&#21644;&#27515;&#20129;&#20154;&#25968;&#23558;&#20943;&#23569;&#32422;70&#65285;&#65292;&#32780;&#22312;5&#26376;&#21021;&#25152;&#26377;&#21407;&#22240;&#30340;&#27515;&#20129;&#20154;&#25968;&#23558;&#20943;&#23569;&#32422;20&#65285;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#23558;&#21512;&#25104;&#25511;&#21046;&#26041;&#27861;&#25512;&#24191;&#21040;&#22810;&#32467;&#26524;&#26694;&#26550;&#30340;&#31639;&#27861;&#65292;&#21487;&#20197;&#25552;&#39640;&#27835;&#30103;&#25928;&#26524;&#35780;&#20272;&#30340;&#21487;&#38752;&#24615;&#12290;&#36825;&#26159;&#36890;&#36807;&#22312;&#35745;&#31639;&#21512;&#25104;&#25511;&#21046;&#26435;&#37325;&#26102;&#65292;&#23558;&#20256;&#32479;&#30340;&#39044;&#22788;&#29702;&#26102;&#38388;&#32500;&#24230;&#19982;&#30456;&#20851;&#32467;&#26524;&#30340;&#39069;&#22806;&#32500;&#24230;&#36827;&#34892;&#34917;&#20805;&#26469;&#23454;&#29616;&#30340;&#12290;&#25105;&#20204;&#30340;&#25512;&#24191;&#23545;&#20110;&#35780;&#20272;&#19968;&#31181;&#27835;&#30103;&#23545;&#20110;&#22810;&#20010;&#32467;&#26524;&#21464;&#37327;&#30340;&#24433;&#21709;&#30340;&#30740;&#31350;&#23588;&#20854;&#26377;&#29992;&#12290;&#25105;&#20204;&#29992;&#29790;&#20856;&#22312;2020&#24180;&#21069;&#19977;&#20010;&#23395;&#24230;&#30340;&#25968;&#25454;&#26469;&#35828;&#26126;&#25105;&#20204;&#30340;&#26041;&#27861;&#65292;&#20272;&#35745;&#38750;&#33647;&#29289;&#24178;&#39044;&#25514;&#26045;&#23545;&#22810;&#20010;&#32467;&#26524;&#30340;&#24433;&#21709;&#12290;&#25105;&#20204;&#30340;&#32467;&#26524;&#34920;&#26126;&#65292;&#22914;&#26524;&#29790;&#20856;&#22312;3&#26376;&#20221;&#20687;&#27431;&#27954;&#20854;&#20182;&#22269;&#23478;&#19968;&#26679;&#23454;&#26045;&#20102;&#26356;&#20005;&#26684;&#30340;&#38750;&#33647;&#29289;&#24178;&#39044;&#25514;&#26045;&#65292;&#37027;&#20040;&#21040;7&#26376;&#20221;&#65292;COVID-19&#24863;&#26579;&#30149;&#20363;&#21644;&#27515;&#20129;&#20154;&#25968;&#23558;&#20943;&#23569;&#32422;70&#65285;&#65292;&#32780;&#22312;5&#26376;&#21021;&#25152;&#26377;&#21407;&#22240;&#30340;&#27515;&#20129;&#20154;&#25968;&#23558;&#20943;&#23569;&#32422;20&#65285;&#12290;&#32780;&#38750;&#33647;&#29289;&#24178;&#39044;&#25514;&#26045;&#23545;&#21171;&#21160;&#21147;&#24066;&#22330;&#21644;&#32463;&#27982;&#32467;&#26524;&#30340;&#24433;&#21709;&#30456;&#23545;&#36739;&#23567;&#12290;
&lt;/p&gt;
&lt;p&gt;
We propose a generalization of the synthetic control method to a multiple-outcome framework, which improves the reliability of treatment effect estimation. This is done by supplementing the conventional pre-treatment time dimension with the extra dimension of related outcomes in computing the synthetic control weights. Our generalization can be particularly useful for studies evaluating the effect of a treatment on multiple outcome variables. To illustrate our method, we estimate the effects of non-pharmaceutical interventions (NPIs) on various outcomes in Sweden in the first 3 quarters of 2020. Our results suggest that if Sweden had implemented stricter NPIs like the other European countries by March, then there would have been about 70% fewer cumulative COVID-19 infection cases and deaths by July, and 20% fewer deaths from all causes in early May, whereas the impacts of the NPIs were relatively mild on the labor market and economic outcomes.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21033;&#29992;&#25351;&#26631;&#20805;&#20998;&#24615;&#23454;&#29616;&#21160;&#24577;&#31163;&#25955;&#36873;&#25321;&#27169;&#22411;&#30340;&#24555;&#36895;&#20272;&#31639;&#22120;&#65292;&#36890;&#36807;&#38480;&#21046;&#21442;&#25968;&#31354;&#38388;&#24182;&#38477;&#20302;&#35745;&#31639;&#37327;&#65292;&#36798;&#21040;&#20102;&#24555;&#36895;&#20272;&#31639;&#30340;&#25928;&#26524;&#65292;&#20272;&#31639;&#32467;&#26524;&#19982;&#39640;&#35745;&#31639;&#37327;&#20272;&#31639;&#22120;&#30340;&#28176;&#36817;&#25928;&#26524;&#31561;&#20215;&#12290;&#22312;&#27169;&#22411;&#20013;&#65292;&#25105;&#20204;&#20351;&#29992;&#20102;&#31561;&#24335;&#32422;&#26463;&#65292;&#24182;&#25552;&#20379;&#20102;&#20851;&#20110;&#23376;&#31354;&#38388;&#32500;&#24230;&#30340;&#19968;&#31995;&#21015;&#32467;&#26524;&#12290;&#22312;&#33521;&#22269;&#24555;&#39184;&#24066;&#22330;&#30340;&#23454;&#35777;&#24212;&#29992;&#20013;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#35813;&#26041;&#27861;&#30340;&#20248;&#36234;&#24615;&#12290;</title><link>http://arxiv.org/abs/2304.02171</link><description>&lt;p&gt;
&#21033;&#29992;&#25351;&#26631;&#20805;&#20998;&#24615;&#23454;&#29616;&#21160;&#24577;&#31163;&#25955;&#36873;&#25321;&#27169;&#22411;&#30340;&#24555;&#36895;&#20272;&#31639;
&lt;/p&gt;
&lt;p&gt;
Faster estimation of dynamic discrete choice models using index sufficiency. (arXiv:2304.02171v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.02171
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21033;&#29992;&#25351;&#26631;&#20805;&#20998;&#24615;&#23454;&#29616;&#21160;&#24577;&#31163;&#25955;&#36873;&#25321;&#27169;&#22411;&#30340;&#24555;&#36895;&#20272;&#31639;&#22120;&#65292;&#36890;&#36807;&#38480;&#21046;&#21442;&#25968;&#31354;&#38388;&#24182;&#38477;&#20302;&#35745;&#31639;&#37327;&#65292;&#36798;&#21040;&#20102;&#24555;&#36895;&#20272;&#31639;&#30340;&#25928;&#26524;&#65292;&#20272;&#31639;&#32467;&#26524;&#19982;&#39640;&#35745;&#31639;&#37327;&#20272;&#31639;&#22120;&#30340;&#28176;&#36817;&#25928;&#26524;&#31561;&#20215;&#12290;&#22312;&#27169;&#22411;&#20013;&#65292;&#25105;&#20204;&#20351;&#29992;&#20102;&#31561;&#24335;&#32422;&#26463;&#65292;&#24182;&#25552;&#20379;&#20102;&#20851;&#20110;&#23376;&#31354;&#38388;&#32500;&#24230;&#30340;&#19968;&#31995;&#21015;&#32467;&#26524;&#12290;&#22312;&#33521;&#22269;&#24555;&#39184;&#24066;&#22330;&#30340;&#23454;&#35777;&#24212;&#29992;&#20013;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#35813;&#26041;&#27861;&#30340;&#20248;&#36234;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35768;&#22810;&#20855;&#26377;&#29702;&#24819;&#32479;&#35745;&#24615;&#36136;&#30340;&#21160;&#24577;&#31163;&#25955;&#36873;&#25321;&#27169;&#22411;&#20272;&#31639;&#22120;&#21487;&#33021;&#38656;&#35201;&#22823;&#37327;&#35745;&#31639;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26041;&#27861;&#65292;&#36890;&#36807;&#21033;&#29992;&#25351;&#26631;&#20805;&#20998;&#24615;&#65292;&#22312;&#38480;&#21046;&#21442;&#25968;&#31354;&#38388;&#24182;&#38477;&#20302;&#35745;&#31639;&#37327;&#30340;&#24773;&#20917;&#19979;&#65292;&#24555;&#36895;&#20272;&#31639;&#19968;&#31867;&#24191;&#27867;&#30340;&#21160;&#24577;&#31163;&#25955;&#36873;&#25321;&#38382;&#39064;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#20272;&#31639;&#22120;&#65292;&#35813;&#20272;&#31639;&#22120;&#20351;&#29992;&#31561;&#24335;&#32422;&#26463;&#65292;&#24182;&#26174;&#31034;&#23427;&#28176;&#36817;&#31561;&#25928;&#20110;&#26080;&#32422;&#26463;&#30340;&#39640;&#35745;&#31639;&#37327;&#20272;&#31639;&#22120;&#12290;&#30001;&#20110;&#25105;&#20204;&#25552;&#35758;&#20272;&#31639;&#22120;&#30340;&#35745;&#31639;&#25910;&#30410;&#26159;&#30001;&#38480;&#21046;&#21442;&#25968;&#31354;&#38388;&#33267;&#28385;&#36275;&#31561;&#24335;&#32422;&#26463;&#30340;&#23376;&#31354;&#38388;&#25152;&#33268;&#65292;&#22240;&#27492;&#25105;&#20204;&#25552;&#20379;&#20102;&#19968;&#31995;&#21015;&#20851;&#20110;&#36825;&#20010;&#23376;&#31354;&#38388;&#32500;&#24230;&#30340;&#32467;&#26524;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#36890;&#36807;&#20272;&#31639;&#33521;&#22269;&#24555;&#39184;&#24066;&#22330;&#30340;&#21160;&#24577;&#27169;&#22411;&#26469;&#23637;&#31034;&#25105;&#20204;&#26041;&#27861;&#30340;&#20248;&#21183;&#12290;
&lt;/p&gt;
&lt;p&gt;
Many estimators of dynamic discrete choice models with permanent unobserved heterogeneity have desirable statistical properties but may be computationally intensive. In this paper we propose a method to quicken estimation for a broad class of dynamic discrete choice problems by exploiting index sufficiency. Index sufficiency implies a set of equality constraints which restrict the structural parameter of interest to belong in a subspace of the parameter space. We propose an estimator that uses the equality constraints, and show it is asymptotically equivalent to the unconstrained, computationally heavy estimator. Since the computational gains of our proposed estimator are due to the restriction of the parameter space to the subspace satisfying the equality constraints, we provide a series of results on the dimension of this subspace. Finally, we demonstrate the advantages of our approach by estimating a dynamic model of the U.K. fast food market.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#20351;&#29992;&#19977;&#23618;&#29983;&#20135;&#20989;&#25968;&#27169;&#22411;&#30740;&#31350;&#20102;&#36164;&#26412;&#12289;&#21171;&#21160;&#21644;&#36164;&#26412;&#23494;&#38598;&#24230;&#30340;&#21453;&#24212;&#65292;&#20174;&#32780;&#25506;&#35752;&#20102;&#36807;&#21097;&#20135;&#33021;&#30340;&#36215;&#28304;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;&#25919;&#31574;&#21046;&#23450;&#32773;&#24212;&#36890;&#36807;&#28608;&#27963;&#37319;&#29992;&#20808;&#36827;&#26426;&#22120;&#35774;&#22791;&#25193;&#22823;&#21046;&#36896;&#21378;&#35268;&#27169;&#26469;&#35299;&#20915;&#36807;&#21097;&#20135;&#33021;&#30340;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2304.02137</link><description>&lt;p&gt;
&#8220;&#36807;&#21097;&#20135;&#33021;&#30340;&#21407;&#22240;&#8221;
&lt;/p&gt;
&lt;p&gt;
Causes of Excess Capacity. (arXiv:2304.02137v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.02137
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#20351;&#29992;&#19977;&#23618;&#29983;&#20135;&#20989;&#25968;&#27169;&#22411;&#30740;&#31350;&#20102;&#36164;&#26412;&#12289;&#21171;&#21160;&#21644;&#36164;&#26412;&#23494;&#38598;&#24230;&#30340;&#21453;&#24212;&#65292;&#20174;&#32780;&#25506;&#35752;&#20102;&#36807;&#21097;&#20135;&#33021;&#30340;&#36215;&#28304;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;&#25919;&#31574;&#21046;&#23450;&#32773;&#24212;&#36890;&#36807;&#28608;&#27963;&#37319;&#29992;&#20808;&#36827;&#26426;&#22120;&#35774;&#22791;&#25193;&#22823;&#21046;&#36896;&#21378;&#35268;&#27169;&#26469;&#35299;&#20915;&#36807;&#21097;&#20135;&#33021;&#30340;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#36890;&#36807;&#30740;&#31350;&#36164;&#26412;&#12289;&#21171;&#21160;&#21644;&#36164;&#26412;&#23494;&#38598;&#24230;&#30340;&#21453;&#24212;&#65292;&#25506;&#35752;&#20102;&#36807;&#21097;&#20135;&#33021;&#30340;&#36215;&#28304;&#12290;&#20026;&#20102;&#23454;&#29616;&#27492;&#30446;&#30340;&#65292;&#25105;&#20204;&#37319;&#29992;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#19977;&#23618;&#29983;&#20135;&#20989;&#25968;&#27169;&#22411;&#65292;&#20272;&#35745;&#20102;&#25152;&#26377;&#20135;&#19994;&#32452;&#20043;&#38388;&#36164;&#26412;&#21644;&#21171;&#21160;&#26367;&#20195;&#24377;&#24615;&#30340;&#23884;&#22871;&#23618;&#65292;&#21516;&#26102;&#32771;&#34385;&#20102;&#36164;&#26412;&#23494;&#38598;&#24230;&#12290;&#25105;&#20204;&#23545;&#20960;&#20010;&#20135;&#19994;&#32452;&#36827;&#34892;&#20102;&#36873;&#25321;&#24615;&#20998;&#26512;&#65292;&#20197;&#36827;&#34892;&#27604;&#36739;&#65292;&#32771;&#34385;&#21040;&#24403;&#21069;&#30340;&#25919;&#24220;&#25919;&#31574;&#21644;&#21046;&#36896;&#21378;&#30340;&#23454;&#38469;&#24773;&#20917;&#12290;&#26368;&#32456;&#65292;&#25105;&#20204;&#24314;&#35758;&#25919;&#31574;&#21046;&#23450;&#32773;&#36890;&#36807;&#28608;&#27963;&#37319;&#29992;&#20808;&#36827;&#26426;&#22120;&#35774;&#22791;&#25193;&#22823;&#21046;&#36896;&#21378;&#30340;&#35268;&#27169;&#26469;&#35299;&#20915;&#36807;&#21097;&#20135;&#33021;&#30340;&#38382;&#39064;&#12290;&#25105;&#20204;&#30340;&#21457;&#29616;&#21644;&#24314;&#35758;&#26088;&#22312;&#21560;&#24341;&#23398;&#32773;&#21644;&#25919;&#31574;&#21046;&#23450;&#32773;&#30340;&#20851;&#27880;&#12290;
&lt;/p&gt;
&lt;p&gt;
This study delves into the origins of excess capacity by examining the reactions of capital, labor, and capital intensity. To achieve this, we have employed a novel three-layered production function model, estimating the elasticity of substitution between capital and labor as a nested layer, alongside capital intensity, for all industry groups. We have then selectively analyzed a few industry groups for comparative purposes, taking into account the current government policies and manufacturing plant realities. Ultimately, we recommend that policymakers address the issue of excess capacity by stimulating the expansion of manufacturing plants with cutting-edge machinery. Our findings and recommendations are intended to appeal to academics and policymakers alike.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#20351;&#29992;&#31526;&#21495;&#35745;&#31639;&#24037;&#20855;&#23545;Kopel&#38750;&#23545;&#31216;&#22404;&#26029;&#27169;&#22411;&#36827;&#34892;&#20102;&#20998;&#26512;&#65292;&#25506;&#35752;&#20102;&#22810;&#20010;&#27491;&#24179;&#34913;&#28857;&#30340;&#23384;&#22312;&#21487;&#33021;&#24615;&#65292;&#24182;&#39318;&#27425;&#24314;&#31435;&#20102;&#19981;&#21516;&#25968;&#37327;&#27491;&#24179;&#34913;&#28857;&#23384;&#22312;&#30340;&#20005;&#26684;&#26465;&#20214;&#12290;&#36890;&#36807;&#25968;&#20540;&#27169;&#25311;&#25903;&#25345;&#27169;&#22411;&#20013;&#23384;&#22312;&#28151;&#27788;&#65292;&#20294;&#28151;&#27788;&#30340;&#23384;&#22312;&#24456;&#38590;&#34987;&#20005;&#26684;&#35777;&#26126;&#12290;</title><link>http://arxiv.org/abs/2304.02136</link><description>&lt;p&gt;
Kopel&#22404;&#26029;&#27169;&#22411;&#30340;&#31283;&#23450;&#24615;&#21644;&#28151;&#27788;&#65306;&#22522;&#20110;&#31526;&#21495;&#35745;&#31639;&#30340;&#30740;&#31350;&#12290;
&lt;/p&gt;
&lt;p&gt;
Stability and chaos of the duopoly model of Kopel: A study based on symbolic computations. (arXiv:2304.02136v1 [math.DS])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.02136
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20351;&#29992;&#31526;&#21495;&#35745;&#31639;&#24037;&#20855;&#23545;Kopel&#38750;&#23545;&#31216;&#22404;&#26029;&#27169;&#22411;&#36827;&#34892;&#20102;&#20998;&#26512;&#65292;&#25506;&#35752;&#20102;&#22810;&#20010;&#27491;&#24179;&#34913;&#28857;&#30340;&#23384;&#22312;&#21487;&#33021;&#24615;&#65292;&#24182;&#39318;&#27425;&#24314;&#31435;&#20102;&#19981;&#21516;&#25968;&#37327;&#27491;&#24179;&#34913;&#28857;&#23384;&#22312;&#30340;&#20005;&#26684;&#26465;&#20214;&#12290;&#36890;&#36807;&#25968;&#20540;&#27169;&#25311;&#25903;&#25345;&#27169;&#22411;&#20013;&#23384;&#22312;&#28151;&#27788;&#65292;&#20294;&#28151;&#27788;&#30340;&#23384;&#22312;&#24456;&#38590;&#34987;&#20005;&#26684;&#35777;&#26126;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
Kopel&#22404;&#26029;&#27169;&#22411;&#25552;&#20986;&#36817;30&#24180;&#26469;&#65292;&#23545;&#20110;&#38750;&#23545;&#31216;&#24773;&#20917;&#19979;&#30340;&#24179;&#34913;&#28857;&#21644;&#20854;&#31283;&#23450;&#24615;&#65292;&#20960;&#20046;&#27809;&#26377;&#20998;&#26512;&#32467;&#26524;&#12290;&#26412;&#25991;&#37319;&#29992;&#22810;&#31181;&#22522;&#20110;&#31526;&#21495;&#35745;&#31639;&#30340;&#24037;&#20855;&#65292;&#23545;Kopel&#30340;&#38750;&#23545;&#31216;&#22404;&#26029;&#27169;&#22411;&#36827;&#34892;&#20102;&#20998;&#26512;&#12290;&#25105;&#20204;&#35752;&#35770;&#20102;&#22810;&#20010;&#27491;&#24179;&#34913;&#28857;&#30340;&#23384;&#22312;&#21487;&#33021;&#24615;&#65292;&#24182;&#24314;&#31435;&#20102;&#23384;&#22312;&#32473;&#23450;&#25968;&#37327;&#27491;&#24179;&#34913;&#28857;&#30340;&#24517;&#35201;&#20805;&#20998;&#26465;&#20214;&#12290;&#21516;&#26102;&#65292;&#25506;&#35752;&#20102;Kopel&#27169;&#22411;&#20013;&#24179;&#34913;&#28857;&#30340;&#21487;&#33021;&#20301;&#32622;&#12290;&#27492;&#22806;&#65292;&#22914;&#26524;&#22404;&#26029;&#32773;&#37319;&#29992;&#26368;&#20339;&#21453;&#24212;&#31574;&#30053;&#25110;&#21516;&#36136;&#33258;&#36866;&#24212;&#39044;&#26399;&#65292;&#21017;&#25105;&#20204;&#39318;&#27425;&#24314;&#31435;&#20102;&#19981;&#21516;&#25968;&#37327;&#27491;&#24179;&#34913;&#28857;&#23384;&#22312;&#30340;&#20005;&#26684;&#26465;&#20214;&#12290;&#36890;&#36807;&#25968;&#20540;&#27169;&#25311;&#30340;&#35266;&#23519;&#25903;&#25345;Kopel&#27169;&#22411;&#23384;&#22312;&#28151;&#27788;&#65292;&#20294;&#36825;&#24456;&#38590;&#24471;&#21040;&#20005;&#26684;&#35777;&#26126;&#12290;&#26412;&#25991;&#30340;&#31532;&#20108;&#20010;&#30446;&#26631;&#26159;&#65292;&#24314;&#31435;&#21644;&#39564;&#35777;&#27169;&#22411;&#20013;&#23384;&#22312;&#28151;&#27788;&#30340;&#26465;&#20214;&#12290;
&lt;/p&gt;
&lt;p&gt;
Since Kopel's duopoly model was proposed about three decades ago, there are almost no analytical results on the equilibria and their stability in the asymmetric case. The first objective of our study is to fill this gap. This paper analyzes the asymmetric duopoly model of Kopel analytically by using several tools based on symbolic computations. We discuss the possibility of the existence of multiple positive equilibria and establish necessary and sufficient conditions for a given number of positive equilibria to exist. The possible positions of the equilibria in Kopel's model are also explored. Furthermore, if the duopolists adopt the best response reactions or homogeneous adaptive expectations, we establish rigorous conditions for the existence of distinct numbers of positive equilibria for the first time. The occurrence of chaos in Kopel's model seems to be supported by observations through numerical simulations, which, however, is challenging to prove rigorously. The second objectiv
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#36890;&#36807;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#20998;&#26512;&#26202;&#24180;&#23436;&#25104;&#23398;&#20301;&#19982;&#32463;&#27982;&#22238;&#25253;&#20043;&#38388;&#30340;&#22240;&#26524;&#25928;&#24212;&#65292;&#21457;&#29616;&#33719;&#24471;&#26032;&#36164;&#26684;&#23558;&#24102;&#26469;&#27599;&#24180;&#36229;&#36807;3000&#28595;&#20803;&#30340;&#32463;&#27982;&#22238;&#25253;&#12290;</title><link>http://arxiv.org/abs/2304.01490</link><description>&lt;p&gt;
&#21518;&#26399;&#33719;&#24471;&#26032;&#36164;&#26684;&#30340;&#32463;&#27982;&#25928;&#24212;
&lt;/p&gt;
&lt;p&gt;
The Economic Effect of Gaining a New Qualification Later in Life. (arXiv:2304.01490v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.01490
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#36890;&#36807;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#20998;&#26512;&#26202;&#24180;&#23436;&#25104;&#23398;&#20301;&#19982;&#32463;&#27982;&#22238;&#25253;&#20043;&#38388;&#30340;&#22240;&#26524;&#25928;&#24212;&#65292;&#21457;&#29616;&#33719;&#24471;&#26032;&#36164;&#26684;&#23558;&#24102;&#26469;&#27599;&#24180;&#36229;&#36807;3000&#28595;&#20803;&#30340;&#32463;&#27982;&#22238;&#25253;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;OECD&#22269;&#23478;&#20013;&#65292;&#36861;&#27714;&#26202;&#24180;&#25945;&#32946;&#36164;&#26684;&#26159;&#19968;&#20010;&#36234;&#26469;&#36234;&#26222;&#36941;&#30340;&#29616;&#35937;&#65292;&#22240;&#20026;&#25216;&#26415;&#21464;&#38761;&#21644;&#33258;&#21160;&#21270;&#32487;&#32493;&#25512;&#21160;&#35768;&#22810;&#32844;&#19994;&#25152;&#38656;&#30340;&#25216;&#33021;&#30340;&#28436;&#21464;&#12290;&#26412;&#25991;&#30528;&#37325;&#32771;&#34385;&#26202;&#24180;&#23436;&#25104;&#23398;&#20301;&#23545;&#32463;&#27982;&#22238;&#25253;&#30340;&#22240;&#26524;&#24433;&#21709;&#65292;&#20854;&#20013;&#33719;&#21462;&#39069;&#22806;&#25945;&#32946;&#30340;&#21160;&#26426;&#21644;&#33021;&#21147;&#21487;&#33021;&#19982;&#26089;&#24180;&#25945;&#32946;&#19981;&#21516;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#19982;&#37027;&#20123;&#27809;&#26377;&#23436;&#25104;&#39069;&#22806;&#23398;&#20064;&#30340;&#20154;&#30456;&#27604;&#65292;&#23436;&#25104;&#39069;&#22806;&#23398;&#20301;&#23558;&#24102;&#26469;&#27599;&#24180;&#36229;&#36807;3000&#28595;&#20803;&#65288;2019&#24180;&#65289;&#30340;&#32463;&#27982;&#22238;&#25253;&#12290;&#23545;&#20110;&#32467;&#26524;&#65292;&#25105;&#20204;&#20351;&#29992;&#12298;&#28595;&#22823;&#21033;&#20122;&#23478;&#24237;&#25910;&#20837;&#21644;&#21171;&#21160;&#21147;&#21160;&#24577;&#35843;&#26597;&#12299;&#30340;&#26497;&#20854;&#20016;&#23500;&#19988;&#20855;&#26377;&#20195;&#34920;&#24615;&#30340;&#32437;&#21521;&#25968;&#25454;&#12290;&#20026;&#20102;&#20805;&#20998;&#21033;&#29992;&#36825;&#20123;&#25968;&#25454;&#30340;&#22797;&#26434;&#24615;&#21644;&#20016;&#23500;&#24615;&#65292;&#25105;&#20204;&#20351;&#29992;&#22522;&#20110;&#26426;&#22120;&#23398;&#20064;&#65288;ML&#65289;&#30340;&#26041;&#27861;&#26469;&#20272;&#31639;&#22240;&#26524;&#25928;&#24212;&#12290;&#25105;&#20204;&#20063;&#33021;&#22815;&#20351;&#29992;ML&#26469;&#21457;&#29616;&#26202;&#24180;&#33719;&#24471;&#26032;&#36164;&#26684;&#23545;&#32463;&#27982;&#22238;&#25253;&#30340;&#24433;&#21709;&#26469;&#28304;&#30340;&#24322;&#36136;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Pursuing educational qualifications later in life is an increasingly common phenomenon within OECD countries since technological change and automation continues to drive the evolution of skills needed in many professions. We focus on the causal impacts to economic returns of degrees completed later in life, where motivations and capabilities to acquire additional education may be distinct from education in early years. We find that completing and additional degree leads to more than \$3000 (AUD, 2019) per year compared to those who do not complete additional study. For outcomes, treatment and controls we use the extremely rich and nationally representative longitudinal data from the Household Income and Labour Dynamics Australia survey is used for this work. To take full advantage of the complexity and richness of this data we use a Machine Learning (ML) based methodology to estimate the causal effect. We are also able to use ML to discover sources of heterogeneity in the effects of ga
&lt;/p&gt;</description></item><item><title>&#30740;&#31350;&#32773;&#21457;&#29616;&#65292;&#36890;&#24120;&#24773;&#20917;&#19979;&#26631;&#20934;&#30340;&#33258;&#21161;&#27861;&#24182;&#19981;&#36866;&#29992;&#20110;Chatterjee&#30340;&#25490;&#21517;&#30456;&#20851;&#24615;&#65292;&#26377;&#25928;&#30340;&#25512;&#26029;&#26041;&#27861;&#26159;Chatterjee&#30340;&#21407;&#22987;&#25552;&#20986;&#21644;Lin&#21644;Han&#30340;&#35299;&#26512;&#28176;&#36817;&#26041;&#24046;&#20272;&#35745;&#22120;&#12290;</title><link>http://arxiv.org/abs/2303.14088</link><description>&lt;p&gt;
&#20851;&#20110;Chatterjee&#25490;&#21517;&#30456;&#20851;&#24615;&#33258;&#21161;&#27861;&#22833;&#36133;&#30340;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
On the failure of the bootstrap for Chatterjee's rank correlation. (arXiv:2303.14088v1 [math.ST])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.14088
&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#32773;&#21457;&#29616;&#65292;&#36890;&#24120;&#24773;&#20917;&#19979;&#26631;&#20934;&#30340;&#33258;&#21161;&#27861;&#24182;&#19981;&#36866;&#29992;&#20110;Chatterjee&#30340;&#25490;&#21517;&#30456;&#20851;&#24615;&#65292;&#26377;&#25928;&#30340;&#25512;&#26029;&#26041;&#27861;&#26159;Chatterjee&#30340;&#21407;&#22987;&#25552;&#20986;&#21644;Lin&#21644;Han&#30340;&#35299;&#26512;&#28176;&#36817;&#26041;&#24046;&#20272;&#35745;&#22120;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#32773;&#36890;&#24120;&#20351;&#29992;&#33258;&#21161;&#27861;&#36827;&#34892;&#32479;&#35745;&#25512;&#26029;&#65292;&#20294;&#25105;&#20204;&#24847;&#35782;&#21040;&#65292;&#36890;&#24120;&#24773;&#20917;&#19979;&#26631;&#20934;&#30340;&#33258;&#21161;&#27861;&#24182;&#19981;&#36866;&#29992;&#20110;Chatterjee&#30340;&#25490;&#21517;&#30456;&#20851;&#24615;&#12290;&#26412;&#25991;&#22312;&#19968;&#20010;&#39069;&#22806;&#30340;&#29420;&#31435;&#24615;&#20551;&#35774;&#19979;&#35777;&#26126;&#20102;&#36825;&#20010;&#38382;&#39064;&#65292;&#24182;&#36890;&#36807;&#27169;&#25311;&#35777;&#25454;&#26469;&#34917;&#20805;&#25105;&#20204;&#30340;&#29702;&#35770;&#65292;&#36825;&#20351;&#24471;Chatterjee&#30340;&#25490;&#21517;&#30456;&#20851;&#24615;&#25104;&#20026;&#28176;&#36817;&#27491;&#24577;&#20294;&#33258;&#21161;&#27861;&#19981;&#19968;&#33268;&#30340;&#32479;&#35745;&#20013;&#30340;&#19968;&#31867;&#25968;&#25454;&#12290;&#22312;&#36825;&#31181;&#24773;&#20917;&#19979;&#65292;&#26377;&#25928;&#30340;&#25512;&#26029;&#26041;&#27861;&#26159;Chatterjee&#30340;&#21407;&#22987;&#25552;&#20986;&#65288;&#29992;&#20110;&#27979;&#35797;&#29420;&#31435;&#24615;&#65289;&#21644;Lin&#21644;Han&#65288;2022&#65289;&#30340;&#35299;&#26512;&#28176;&#36817;&#26041;&#24046;&#20272;&#35745;&#22120;&#65288;&#29992;&#20110;&#26356;&#24191;&#27867;&#30340;&#30446;&#30340;&#65289;&#12290;
&lt;/p&gt;
&lt;p&gt;
While researchers commonly use the bootstrap for statistical inference, many of us have realized that the standard bootstrap, in general, does not work for Chatterjee's rank correlation. In this paper, we provide proof of this issue under an additional independence assumption, and complement our theory with simulation evidence for general settings. Chatterjee's rank correlation thus falls into a category of statistics that are asymptotically normal but bootstrap inconsistent. Valid inferential methods in this case are Chatterjee's original proposal (for testing independence) and Lin and Han (2022)'s analytic asymptotic variance estimator (for more general purposes).
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#20449;&#20219;&#21830;&#21697;&#24066;&#22330;&#20013;&#19987;&#23478;&#38144;&#21806;&#32773;&#21644;&#23458;&#25143;&#20043;&#38388;&#30340;&#36890;&#35759;&#38382;&#39064;&#65292;&#25552;&#20379;&#20102;&#20960;&#20309;&#29305;&#24449;&#25551;&#36848;&#21644;&#24517;&#35201;&#26465;&#20214;&#65292;&#20197;&#21450;&#23545;&#20108;&#20803;&#24773;&#24418;&#19979;&#30340;&#25152;&#26377;&#22343;&#34913;&#36827;&#34892;&#20102;&#31119;&#21033;&#20998;&#26512;&#12290;</title><link>http://arxiv.org/abs/2303.13295</link><description>&lt;p&gt;
&#22404;&#26029;&#24615;&#20449;&#20219;&#21830;&#21697;&#24066;&#22330;&#20013;&#30340;&#20449;&#24687;&#20256;&#36882;
&lt;/p&gt;
&lt;p&gt;
Information transmission in monopolistic credence goods markets. (arXiv:2303.13295v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.13295
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#20449;&#20219;&#21830;&#21697;&#24066;&#22330;&#20013;&#19987;&#23478;&#38144;&#21806;&#32773;&#21644;&#23458;&#25143;&#20043;&#38388;&#30340;&#36890;&#35759;&#38382;&#39064;&#65292;&#25552;&#20379;&#20102;&#20960;&#20309;&#29305;&#24449;&#25551;&#36848;&#21644;&#24517;&#35201;&#26465;&#20214;&#65292;&#20197;&#21450;&#23545;&#20108;&#20803;&#24773;&#24418;&#19979;&#30340;&#25152;&#26377;&#22343;&#34913;&#36827;&#34892;&#20102;&#31119;&#21033;&#20998;&#26512;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#19968;&#20010;&#28085;&#30422; $N$ &#20010;&#38382;&#39064;&#31867;&#22411;&#21644; $N$ &#31181;&#27835;&#30103;&#26041;&#27861;&#30340;&#20449;&#20219;&#21830;&#21697;&#27169;&#22411;&#12290;&#19987;&#23478;&#38144;&#21806;&#32773;&#21644;&#23458;&#25143;&#20043;&#38388;&#30340;&#36890;&#35759;&#34987;&#24314;&#27169;&#20026;&#24265;&#20215;&#35848;&#21028;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#22312;&#27495;&#35270;&#24615;&#23450;&#20215;&#19979;&#65292;&#19987;&#23478;&#30340;&#22343;&#34913;&#22238;&#25253;&#20855;&#26377;&#20960;&#20309;&#29305;&#24449;&#25551;&#36848;&#65292;&#21363;&#19987;&#23478;&#20197;&#20449;&#24565;&#21033;&#28070;&#20989;&#25968;&#30340;&#25311;&#19979;&#20984;&#21253;&#20026;&#20195;&#20215;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#23458;&#25143;&#26368;&#24046;&#30340;&#22343;&#34913;&#23384;&#22312;&#24615;&#65292;&#24182;&#23558;&#36825;&#20010;&#20960;&#20309;&#29305;&#24449;&#24212;&#29992;&#20110;&#20043;&#21069;&#20851;&#20110;&#20449;&#20219;&#21830;&#21697;&#30340;&#30740;&#31350;&#20013;&#65292;&#24182;&#20026;&#36890;&#35759;&#20309;&#26102;&#26377;&#30410;&#20110;&#19987;&#23478;&#25552;&#20379;&#20102;&#20805;&#20998;&#24517;&#35201;&#26465;&#20214;&#12290;&#23545;&#20110;&#20108;&#20803;&#24773;&#24418;&#65292;&#25105;&#20204;&#27714;&#35299;&#20102;&#25152;&#26377;&#22343;&#34913;&#65292;&#24182;&#20998;&#26512;&#20102;&#23427;&#20204;&#30340;&#31119;&#21033;&#23646;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study a general credence goods model with $N$ problem types and $N$ treatments. Communication between the expert seller and the client is modeled as cheap talk. We find that the expert's equilibrium payoffs admit a geometric characterization, described by the quasiconcave envelope of his belief-based profits function under discriminatory pricing. We establish the existence of client-worst equilibria, apply the geometric characterization to previous research on credence goods, and provide a necessary and sufficient condition for when communication benefits the expert. For the binary case, we solve for all equilibria and analyze their welfare properties.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;MRBEE&#30340;&#26032;&#22411;&#22810;&#21464;&#37327;MR&#26041;&#27861;&#65292;&#21487;&#35299;&#20915;&#22810;&#20010;GWAS&#38431;&#21015;&#20043;&#38388;&#30340;&#26679;&#26412;&#37325;&#21472;&#38382;&#39064;&#65292;&#33021;&#22815;&#25512;&#26029;&#35768;&#22810;&#24369;&#24037;&#20855;&#21464;&#37327;&#30340;&#26080;&#20559;&#22240;&#26524;&#20851;&#31995;&#12290;</title><link>http://arxiv.org/abs/2301.05130</link><description>&lt;p&gt;
&#22810;&#21464;&#37327;&#38376;&#25463;&#21015;&#22827;&#38543;&#26426;&#21270;&#20013;&#30340;&#26080;&#20559;&#20272;&#35745;&#21644;&#28176;&#36817;&#26377;&#25928;&#25512;&#26029;&#19982;&#24369;&#24037;&#20855;&#21464;&#37327;
&lt;/p&gt;
&lt;p&gt;
Unbiased estimation and asymptotically valid inference in multivariable Mendelian randomization with many weak instrumental variables. (arXiv:2301.05130v3 [stat.ME] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2301.05130
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;MRBEE&#30340;&#26032;&#22411;&#22810;&#21464;&#37327;MR&#26041;&#27861;&#65292;&#21487;&#35299;&#20915;&#22810;&#20010;GWAS&#38431;&#21015;&#20043;&#38388;&#30340;&#26679;&#26412;&#37325;&#21472;&#38382;&#39064;&#65292;&#33021;&#22815;&#25512;&#26029;&#35768;&#22810;&#24369;&#24037;&#20855;&#21464;&#37327;&#30340;&#26080;&#20559;&#22240;&#26524;&#20851;&#31995;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38376;&#25463;&#21015;&#22827;&#38543;&#26426;&#21270;&#65288;MR&#65289;&#26159;&#19968;&#31181;&#21033;&#29992;&#22522;&#22240;&#32452;&#20851;&#32852;&#30740;&#31350;&#65288;GWAS&#65289;&#25688;&#35201;&#25968;&#25454;&#25512;&#26029;&#26333;&#38706;&#21644;&#32467;&#26524;&#20043;&#38388;&#22240;&#26524;&#20851;&#31995;&#30340;&#24037;&#20855;&#21464;&#37327;&#26041;&#27861;&#12290;&#28982;&#32780;&#65292;&#22810;&#21464;&#37327;&#21453;&#26041;&#24046;&#21152;&#26435;&#65288;IVW&#65289;&#26041;&#27861;&#20316;&#20026;&#22823;&#22810;&#25968;MR&#26041;&#27861;&#30340;&#22522;&#30784;&#65292;&#22312;&#23384;&#22312;&#35768;&#22810;&#24369;&#24037;&#20855;&#21464;&#37327;&#30340;&#24773;&#20917;&#19979;&#26080;&#27861;&#20135;&#29983;&#26080;&#20559;&#30340;&#22240;&#26524;&#25928;&#24212;&#20272;&#35745;&#12290;&#26412;&#25991;&#35777;&#26126;&#20102;&#22810;&#21464;&#37327;IVW&#20272;&#35745;&#30340;&#20559;&#24046;&#26159;&#24369;&#24037;&#20855;&#12289;&#20272;&#35745;&#35823;&#24046;&#20559;&#24046;&#30340;&#20056;&#31215;&#65292;&#21518;&#32773;&#19982;&#22810;&#20010;GWAS&#38431;&#21015;&#20043;&#38388;&#30340;&#26679;&#26412;&#37325;&#21472;&#23384;&#22312;&#26435;&#34913;&#20851;&#31995;&#65292;&#26159;&#30001;&#27979;&#37327;&#35823;&#24046;&#21644;&#28151;&#28102;&#21464;&#37327;&#24341;&#36215;&#30340;&#12290;&#20026;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#22810;&#21464;&#37327;MR&#26041;&#27861;&#65292;&#21363;&#20351;&#29992;&#26657;&#27491;&#20559;&#24046;&#20272;&#35745;&#26041;&#31243;&#30340;MR&#65288;MRBEE&#65289;&#65292;&#21487;&#20197;&#25512;&#26029;&#35768;&#22810;&#24369;&#24037;&#20855;&#21464;&#37327;&#30340;&#26080;&#20559;&#22240;&#26524;&#20851;&#31995;&#12290;&#22312;&#36866;&#24230;&#26465;&#20214;&#19979;&#30740;&#31350;&#20102;&#22810;&#21464;&#37327;IVW&#21644;MRBEE&#30340;&#28176;&#36817;&#34892;&#20026;&#65292;&#32467;&#26524;&#34920;&#26126;&#24403;&#24369;&#24037;&#20855;&#21464;&#37327;&#30340;&#25968;&#37327;&#24456;&#22823;&#26102;&#65292;MRBEE&#20248;&#20110;&#22810;&#21464;&#37327;IVW&#12290;
&lt;/p&gt;
&lt;p&gt;
Mendelian randomization (MR) is an instrumental variable (IV) approach to infer causal relationships between exposures and outcomes with genome-wide association studies (GWAS) summary data. However, the multivariable inverse-variance weighting (IVW) approach, which serves as the foundation for most MR approaches, cannot yield unbiased causal effect estimates in the presence of many weak IVs. In this paper, we prove that the bias of the multivariable IVW estimate is a product of weak instrument and estimation error biases, where the latter is linearly composed of measurement error and confounder biases with a trade-off due to sample overlap among multiple GWAS cohorts. To address this problem, we propose a novel multivariable MR approach, MR using Bias-corrected Estimating Equation (MRBEE), which can infer unbiased causal relationships with many weak IVs. Asymptotic behaviors of multivariable IVW and MRBEE are investigated under moderate conditions, showing that MRBEE outperforms multiv
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#35299;&#20915;&#22810;&#20010;&#24037;&#20855;&#30456;&#20851;&#24615;&#23548;&#33268;&#20559;&#24046;&#38382;&#39064;&#30340;&#26367;&#20195;&#20272;&#35745;&#22120;CSA2SLS&#65292;&#30740;&#21457;&#20102;&#30456;&#24212;&#30340;Stata&#21629;&#20196;&#24182;&#36890;&#36807;&#33945;&#29305;&#21345;&#32599;&#27169;&#25311;&#21644;&#23454;&#35777;&#24212;&#29992;&#36827;&#34892;&#20102;&#39564;&#35777;&#12290;</title><link>http://arxiv.org/abs/2207.01533</link><description>&lt;p&gt;
csa2sls&#65306;&#20351;&#29992;Stata&#30340;&#23436;&#25972;&#23376;&#38598;&#26041;&#27861;&#22788;&#29702;&#22810;&#20010;&#24037;&#20855;
&lt;/p&gt;
&lt;p&gt;
csa2sls: A complete subset approach for many instruments using Stata. (arXiv:2207.01533v2 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2207.01533
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#35299;&#20915;&#22810;&#20010;&#24037;&#20855;&#30456;&#20851;&#24615;&#23548;&#33268;&#20559;&#24046;&#38382;&#39064;&#30340;&#26367;&#20195;&#20272;&#35745;&#22120;CSA2SLS&#65292;&#30740;&#21457;&#20102;&#30456;&#24212;&#30340;Stata&#21629;&#20196;&#24182;&#36890;&#36807;&#33945;&#29305;&#21345;&#32599;&#27169;&#25311;&#21644;&#23454;&#35777;&#24212;&#29992;&#36827;&#34892;&#20102;&#39564;&#35777;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#20010;Stata&#21629;&#20196;$\texttt{csa2sls}$&#65292;&#23454;&#29616;&#20102;Lee&#21644;Shin&#65288;2021&#65289;&#20013;&#30340;&#23436;&#25972;&#23376;&#38598;&#24179;&#22343;&#20108;&#38454;&#27573;&#26368;&#23567;&#20108;&#20056;&#27861;&#65288;CSA2SLS&#65289;&#20272;&#35745;&#37327;&#12290;CSA2SLS&#20272;&#35745;&#22120;&#26159;&#35299;&#20915;&#30001;&#20110;&#35768;&#22810;&#30456;&#20851;&#24037;&#20855;&#23548;&#33268;&#30340;&#20559;&#24046;&#38382;&#39064;&#30340;&#26367;&#20195;&#20272;&#35745;&#22120;&#12290;&#25105;&#20204;&#36827;&#34892;&#20102;&#33945;&#29305;&#21345;&#32599;&#27169;&#25311;&#65292;&#24182;&#30830;&#35748;&#22312;&#24037;&#20855;&#30456;&#20851;&#26102;&#65292;CSA2SLS&#20272;&#35745;&#22120;&#26174;&#33879;&#38477;&#20302;&#20102;&#22343;&#26041;&#35823;&#24046;&#21644;&#20272;&#35745;&#20559;&#24046;&#12290;&#25105;&#20204;&#36890;&#36807;&#23454;&#35777;&#24212;&#29992;&#35828;&#26126;&#20102;$\texttt{csa2sls}$&#22312;Stata&#20013;&#30340;&#20351;&#29992;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
We develop a Stata command $\texttt{csa2sls}$ that implements the complete subset averaging two-stage least squares (CSA2SLS) estimator in Lee and Shin (2021). The CSA2SLS estimator is an alternative to the two-stage least squares estimator that remedies the bias issue caused by many correlated instruments. We conduct Monte Carlo simulations and confirm that the CSA2SLS estimator reduces both the mean squared error and the estimation bias substantially when instruments are correlated. We illustrate the usage of $\texttt{csa2sls}$ in Stata by an empirical application.
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#38024;&#23545;&#27835;&#30103;&#36873;&#25321;&#20013;&#30340;&#19981;&#30830;&#23450;&#24615;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#26368;&#23567;&#21270;&#38750;&#32447;&#24615;&#24724;&#24680;&#30340;&#26041;&#27861;&#65292;&#24182;&#23548;&#20986;&#20102;&#38381;&#21512;&#20998;&#25968;&#24418;&#24335;&#30340;&#26377;&#38480;&#26679;&#26412;&#36125;&#21494;&#26031;&#21644;&#26497;&#23567;&#21270;&#26368;&#20248;&#35268;&#21017;&#65292;&#21487;&#35270;&#20026;&#25903;&#25345;&#27835;&#30103;&#30340;&#35777;&#25454;&#24378;&#24230;&#12290;</title><link>http://arxiv.org/abs/2205.08586</link><description>&lt;p&gt;
&#38750;&#32447;&#24615;&#24724;&#24680;&#19979;&#30340;&#27835;&#30103;&#36873;&#25321;
&lt;/p&gt;
&lt;p&gt;
Treatment Choice with Nonlinear Regret. (arXiv:2205.08586v3 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2205.08586
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#38024;&#23545;&#27835;&#30103;&#36873;&#25321;&#20013;&#30340;&#19981;&#30830;&#23450;&#24615;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#26368;&#23567;&#21270;&#38750;&#32447;&#24615;&#24724;&#24680;&#30340;&#26041;&#27861;&#65292;&#24182;&#23548;&#20986;&#20102;&#38381;&#21512;&#20998;&#25968;&#24418;&#24335;&#30340;&#26377;&#38480;&#26679;&#26412;&#36125;&#21494;&#26031;&#21644;&#26497;&#23567;&#21270;&#26368;&#20248;&#35268;&#21017;&#65292;&#21487;&#35270;&#20026;&#25903;&#25345;&#27835;&#30103;&#30340;&#35777;&#25454;&#24378;&#24230;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25991;&#29486;&#19968;&#33324;&#20391;&#37325;&#20110;&#26368;&#23567;&#21270;&#31119;&#21033;&#24724;&#24680;&#30340;&#24179;&#22343;&#20540;&#65292;&#30001;&#20110;&#37319;&#26679;&#19981;&#30830;&#23450;&#24615;&#65292;&#36825;&#21487;&#33021;&#23548;&#33268;&#19981;&#33391;&#30340;&#27835;&#30103;&#36873;&#25321;&#12290;&#25105;&#20204;&#24314;&#35758;&#26368;&#23567;&#21270;&#38750;&#32447;&#24615;&#24724;&#24680;&#30340;&#24179;&#22343;&#20540;&#65292;&#24182;&#34920;&#26126;&#21487;&#25509;&#21463;&#30340;&#35268;&#21017;&#20026;&#38750;&#32447;&#24615;&#24724;&#24680;&#30340;&#20998;&#25968;&#35268;&#21017;&#12290;&#38024;&#23545;&#22343;&#26041;&#24724;&#24680;&#65292;&#25105;&#20204;&#25512;&#23548;&#20986;&#26377;&#38480;&#26679;&#26412;&#36125;&#21494;&#26031;&#21644;&#26497;&#23567;&#21270;&#26368;&#20248;&#35268;&#21017;&#30340;&#38381;&#21512;&#20998;&#25968;&#24418;&#24335;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#22522;&#20110;&#20915;&#31574;&#29702;&#35770;&#65292;&#25193;&#23637;&#21040;&#26497;&#38480;&#23454;&#39564;&#12290;&#27835;&#30103;&#20998;&#25968;&#21487;&#20197;&#30475;&#20316;&#26159;&#25903;&#25345;&#27835;&#30103;&#30340;&#35777;&#25454;&#24378;&#24230;&#12290;&#25105;&#20204;&#23558;&#25105;&#20204;&#30340;&#26694;&#26550;&#24212;&#29992;&#20110;&#27491;&#24120;&#22238;&#24402;&#27169;&#22411;&#21644;&#38543;&#26426;&#23454;&#39564;&#30340;&#26679;&#26412;&#37327;&#35745;&#31639;&#12290;
&lt;/p&gt;
&lt;p&gt;
The literature focuses on minimizing the mean of welfare regret, which can lead to undesirable treatment choice due to sampling uncertainty. We propose to minimize the mean of a nonlinear transformation of regret and show that admissible rules are fractional for nonlinear regret. Focusing on mean square regret, we derive closed-form fractions for finite-sample Bayes and minimax optimal rules. Our approach is grounded in decision theory and extends to limit experiments. The treatment fractions can be viewed as the strength of evidence favoring treatment. We apply our framework to a normal regression model and sample size calculations in randomized experiments.
&lt;/p&gt;</description></item><item><title>&#30740;&#31350;&#29983;&#20135;&#20989;&#25968;&#20013;&#30340;&#35268;&#27169;&#32463;&#27982;&#65307;&#20855;&#26377;&#22810;&#20010;&#32467;&#26524;&#30340;&#30740;&#31350;&#28608;&#21169;&#20351;&#29992;&#21333;&#20010;&#25351;&#26631;&#36827;&#34892;&#27979;&#35797;&#65307;&#26631;&#20934;&#31243;&#24207;&#36807;&#20110;&#20445;&#23432;&#12290;</title><link>http://arxiv.org/abs/2104.13367</link><description>&lt;p&gt;
&#20309;&#26102;&#24212;&#23545;&#22810;&#37325;&#20551;&#35774;&#26816;&#39564;&#36827;&#34892;&#25512;&#26029;&#35843;&#25972;&#65311;
&lt;/p&gt;
&lt;p&gt;
(When) should you adjust inferences for multiple hypothesis testing?. (arXiv:2104.13367v5 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2104.13367
&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#29983;&#20135;&#20989;&#25968;&#20013;&#30340;&#35268;&#27169;&#32463;&#27982;&#65307;&#20855;&#26377;&#22810;&#20010;&#32467;&#26524;&#30340;&#30740;&#31350;&#28608;&#21169;&#20351;&#29992;&#21333;&#20010;&#25351;&#26631;&#36827;&#34892;&#27979;&#35797;&#65307;&#26631;&#20934;&#31243;&#24207;&#36807;&#20110;&#20445;&#23432;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22810;&#37325;&#20551;&#35774;&#26816;&#39564;&#30340;&#23454;&#36341;&#23384;&#22312;&#24040;&#22823;&#24046;&#24322;&#65292;&#26080;&#27861;&#30830;&#23450;&#21738;&#31181;&#26041;&#27861;&#21512;&#36866;&#12290;&#25105;&#20204;&#20026;&#36825;&#20123;&#20570;&#27861;&#25552;&#20379;&#20102;&#32463;&#27982;&#22522;&#30784;&#12290;&#22312;&#30740;&#31350;&#22810;&#20010;&#24178;&#39044;&#25110;&#20122;&#32676;&#20307;&#26102;&#65292;&#26681;&#25454;&#30740;&#31350;&#29983;&#20135;&#20989;&#25968;&#30340;&#35268;&#27169;&#32463;&#27982;&#65292;&#21487;&#33021;&#38656;&#35201;&#36827;&#34892;&#35843;&#25972;&#65292;&#22312;&#26377;&#20123;&#24773;&#20917;&#19979;&#20250;&#25511;&#21046;&#22797;&#21512;&#35823;&#24046;&#30340;&#32463;&#20856;&#27010;&#24565;&#65292;&#20294;&#24182;&#38750;&#25152;&#26377;&#24773;&#20917;&#19979;&#37117;&#20250;&#20986;&#29616;&#12290;&#20855;&#26377;&#22810;&#20010;&#32467;&#26524;&#30340;&#30740;&#31350;&#28608;&#21169;&#20351;&#29992;&#21333;&#20010;&#25351;&#26631;&#36827;&#34892;&#27979;&#35797;&#65292;&#25110;&#32773;&#22312;&#38754;&#21521;&#24322;&#26500;&#21463;&#20247;&#26102;&#20351;&#29992;&#22810;&#20010;&#25351;&#26631;&#36827;&#34892;&#35843;&#25972;&#27979;&#35797;&#12290;&#20004;&#20010;&#24212;&#29992;&#31243;&#24207;&#20013;&#23454;&#38469;&#30740;&#31350;&#25104;&#26412;&#30340;&#25968;&#25454;&#34920;&#26126;&#65292;&#19968;&#20123;&#35843;&#25972;&#26159;&#26377;&#24517;&#35201;&#30340;&#65292;&#24182;&#19988;&#26631;&#20934;&#31243;&#24207;&#36807;&#20110;&#20445;&#23432;&#12290;
&lt;/p&gt;
&lt;p&gt;
Multiple hypothesis testing practices vary widely, without consensus on which are appropriate when. We provide an economic foundation for these practices. In studies of multiple interventions or sub-populations, adjustments may be appropriate depending on scale economies in the research production function, with control of classical notions of compound errors emerging in some but not all cases. Studies with multiple outcomes motivate testing using a single index, or adjusted tests of several indices when the intended audience is heterogeneous. Data on actual research costs in two applications suggest both that some adjustment is warranted and that standard procedures are overly conservative.
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#22312;&#30005;&#21147;&#24066;&#22330;&#20013;&#35299;&#20915;&#24066;&#22330;&#22404;&#26029;&#21644;&#29615;&#22659;&#22806;&#37096;&#24615;&#38382;&#39064;&#30340;&#23450;&#20215;&#26426;&#21046;&#65292;&#24182;&#25104;&#21151;&#20811;&#26381;&#20102;&#29616;&#26377;&#20215;&#26684;&#19978;&#38480;&#26426;&#21046;&#30340;&#32570;&#38519;&#12290;</title><link>http://arxiv.org/abs/2104.00578</link><description>&lt;p&gt;
&#30005;&#21147;&#24066;&#22330;&#20013;&#32852;&#21512;&#32531;&#35299;&#24066;&#22330;&#22404;&#26029;&#21644;&#29615;&#22659;&#22806;&#37096;&#24615;&#30340;&#23450;&#20215;&#26426;&#21046;
&lt;/p&gt;
&lt;p&gt;
A Pricing Mechanism to Jointly Mitigate Market Power and Environmental Externalities in Electricity Markets. (arXiv:2104.00578v2 [econ.TH] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2104.00578
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#22312;&#30005;&#21147;&#24066;&#22330;&#20013;&#35299;&#20915;&#24066;&#22330;&#22404;&#26029;&#21644;&#29615;&#22659;&#22806;&#37096;&#24615;&#38382;&#39064;&#30340;&#23450;&#20215;&#26426;&#21046;&#65292;&#24182;&#25104;&#21151;&#20811;&#26381;&#20102;&#29616;&#26377;&#20215;&#26684;&#19978;&#38480;&#26426;&#21046;&#30340;&#32570;&#38519;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#30005;&#21147;&#20135;&#19994;&#19968;&#30452;&#26159;&#39318;&#20808;&#38754;&#20020;&#21487;&#25345;&#32493;&#24615;&#38382;&#39064;&#30340;&#34892;&#19994;&#20043;&#19968;&#12290;&#24066;&#22330;&#35774;&#35745;&#30340;&#25928;&#29575;&#26041;&#38754;&#24448;&#24448;&#38598;&#20013;&#20110;&#24066;&#22330;&#22404;&#26029;&#38382;&#39064;&#65292;&#32780;&#26032;&#30340;&#25919;&#31574;&#25361;&#25112;&#21017;&#24378;&#35843;&#21487;&#25345;&#32493;&#24615;&#12290;&#25105;&#20204;&#35748;&#20026;&#65292;&#24066;&#22330;&#35774;&#35745;&#38656;&#35201;&#21457;&#23637;&#27835;&#29702;&#24066;&#22330;&#34892;&#20026;&#21644;&#29615;&#22659;&#22806;&#37096;&#24615;&#32852;&#31995;&#30340;&#25514;&#26045;&#12290;&#22240;&#27492;&#65292;&#25105;&#20204;&#21033;&#29992;&#20855;&#26377;&#20851;&#20110;&#21457;&#30005;&#25104;&#26412;&#19981;&#23436;&#20840;&#20449;&#24687;&#30340;&#30005;&#32593;&#34920;&#31034;&#24320;&#21457;&#20102;&#19968;&#31181;&#22522;&#20110;&#28608;&#21169;&#30340;&#24066;&#22330;&#28165;&#31639;&#26426;&#21046;&#12290;&#22312;&#36825;&#31181;&#24773;&#20917;&#19979;&#65292;&#25152;&#25552;&#20986;&#30340;&#26426;&#21046;&#20811;&#26381;&#20102;&#20215;&#26684;&#19978;&#38480;&#32531;&#35299;&#24066;&#22330;&#22404;&#26029;&#30340;&#32570;&#28857;&#12290;
&lt;/p&gt;
&lt;p&gt;
The electricity industry has been one of the first to face technological changes motivated by sustainability concerns. Whilst efficiency aspects of market design have tended to focus upon market power concerns, the new policy challenges emphasise sustainability. We argue that market designs need to develop remedies for market conduct integrated with regard to environmental externalities. Accordingly, we develop an incentive-based market clearing mechanism using a power network representation with a distinctive feature of incomplete information regarding generation costs. The shortcomings of price caps to mitigate market power, in this context, are overcome with the proposed mechanism.
&lt;/p&gt;</description></item><item><title>&#35770;&#25991;&#30740;&#31350;&#20102;&#24102;&#26377;&#25112;&#30053;&#20195;&#29702;&#30340;&#27835;&#30103;&#20998;&#37197;&#38382;&#39064;&#12290;&#30740;&#31350;&#34920;&#26126;&#65292;&#26368;&#20248;&#35268;&#21017;&#21487;&#20197;&#28041;&#21450;&#38543;&#26426;&#21270;&#65292;&#23545;&#37027;&#20123;&#24179;&#22343;&#19978;&#23545;&#27835;&#30103;&#26377;&#31215;&#26497;&#21453;&#24212;&#30340;&#20010;&#20307;&#20063;&#21487;&#20197;&#20998;&#37197;&#19981;&#21040;100%&#30340;&#27835;&#30103;&#26426;&#20250;&#12290;</title><link>http://arxiv.org/abs/2011.06528</link><description>&lt;p&gt;
&#20855;&#26377;&#25112;&#30053;&#20195;&#29702;&#30340;&#27835;&#30103;&#20998;&#37197;
&lt;/p&gt;
&lt;p&gt;
Treatment Allocation with Strategic Agents. (arXiv:2011.06528v5 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2011.06528
&lt;/p&gt;
&lt;p&gt;
&#35770;&#25991;&#30740;&#31350;&#20102;&#24102;&#26377;&#25112;&#30053;&#20195;&#29702;&#30340;&#27835;&#30103;&#20998;&#37197;&#38382;&#39064;&#12290;&#30740;&#31350;&#34920;&#26126;&#65292;&#26368;&#20248;&#35268;&#21017;&#21487;&#20197;&#28041;&#21450;&#38543;&#26426;&#21270;&#65292;&#23545;&#37027;&#20123;&#24179;&#22343;&#19978;&#23545;&#27835;&#30103;&#26377;&#31215;&#26497;&#21453;&#24212;&#30340;&#20010;&#20307;&#20063;&#21487;&#20197;&#20998;&#37197;&#19981;&#21040;100%&#30340;&#27835;&#30103;&#26426;&#20250;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36234;&#26469;&#36234;&#22810;&#30340;&#20154;&#23545;&#22522;&#20110;&#35266;&#23519;&#21040;&#30340;&#20010;&#20307;&#29305;&#24449;&#30340;&#27835;&#30103;&#20998;&#37197;&#20135;&#29983;&#20852;&#36259;&#65292;&#20363;&#22914;&#23450;&#21521;&#33829;&#38144;&#12289;&#20010;&#24615;&#21270;&#20449;&#29992;&#25253;&#20215;&#21644;&#24322;&#36136;&#24615;&#23450;&#20215;&#31561;&#12290;&#27835;&#30103;&#20010;&#24615;&#21270;&#24341;&#20837;&#20102;&#20010;&#20307;&#20462;&#25913;&#20854;&#34892;&#20026;&#20197;&#33719;&#24471;&#26356;&#22909;&#27835;&#30103;&#30340;&#28608;&#21169;&#12290;&#25112;&#30053;&#34892;&#20026;&#20250;&#25913;&#21464;&#20849;&#21464;&#37327;&#21644;&#28508;&#22312;&#32467;&#26524;&#30340;&#32852;&#21512;&#20998;&#24067;&#12290;&#22312;&#27809;&#26377;&#25112;&#30053;&#34892;&#20026;&#30340;&#24773;&#20917;&#19979;&#65292;&#26368;&#20339;&#35268;&#21017;&#23558;&#20998;&#37197;&#27835;&#30103;&#23545;&#20110;&#26377;&#31215;&#26497;&#26465;&#20214;&#24179;&#22343;&#27835;&#30103;&#25928;&#24212;&#30340;&#20010;&#20307;&#12290;&#32780;&#22312;&#23384;&#22312;&#25112;&#30053;&#34892;&#20026;&#26102;&#65292;&#25105;&#20204;&#21457;&#29616;&#26368;&#20339;&#35268;&#21017;&#21487;&#20197;&#28041;&#21450;&#38543;&#26426;&#21270;&#65292;&#21363;&#20351;&#26159;&#23545;&#37027;&#20123;&#24179;&#22343;&#19978;&#23545;&#27835;&#30103;&#26377;&#31215;&#26497;&#21453;&#24212;&#30340;&#20010;&#20307;&#65292;&#20063;&#21487;&#20197;&#20998;&#37197;&#19981;&#21040;100%&#30340;&#27835;&#30103;&#26426;&#20250;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#22522;&#20110;&#36125;&#21494;&#26031;&#20248;&#21270;&#30340;&#39034;&#24207;&#23454;&#39564;&#65292;&#23427;&#21487;&#20197;&#22312;&#27809;&#26377;&#20010;&#20307;&#25112;&#30053;&#34892;&#20026;&#21442;&#25968;&#20551;&#35774;&#19979;&#65292;&#25910;&#25947;&#21040;&#26368;&#20248;&#27835;&#30103;&#20998;&#37197;&#35268;&#21017;&#12290;
&lt;/p&gt;
&lt;p&gt;
There is increasing interest in allocating treatments based on observed individual characteristics: examples include targeted marketing, individualized credit offers, and heterogeneous pricing. Treatment personalization introduces incentives for individuals to modify their behavior to obtain a better treatment. Strategic behavior shifts the joint distribution of covariates and potential outcomes. The optimal rule without strategic behavior allocates treatments only to those with a positive Conditional Average Treatment Effect. With strategic behavior, we show that the optimal rule can involve randomization, allocating treatments with less than 100% probability even to those who respond positively on average to the treatment. We propose a sequential experiment based on Bayesian Optimization that converges to the optimal treatment rule without parametric assumptions on individual strategic behavior.
&lt;/p&gt;</description></item></channel></rss>