<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22312;&#27809;&#26377;&#24037;&#20855;&#21464;&#37327;&#30340;&#24773;&#20917;&#19979;&#23450;&#20041;&#12289;&#35782;&#21035;&#21644;&#20272;&#35745;&#36793;&#38469;&#27835;&#30103;&#25928;&#24212;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#26032;&#30340;&#23450;&#20041;&#21644;&#20805;&#20998;&#26465;&#20214;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#22312;&#27809;&#26377;&#24037;&#20855;&#21464;&#37327;&#30340;&#24773;&#20917;&#19979;&#36793;&#38469;&#27835;&#30103;&#25928;&#24212;&#19982;&#26631;&#20934;&#27835;&#30103;&#21442;&#25968;&#20043;&#38388;&#30340;&#20851;&#31995;&#25104;&#31435;&#12290;</title><link>https://arxiv.org/abs/2401.17595</link><description>&lt;p&gt;
&#22312;&#26080;&#24037;&#20855;&#21464;&#37327;&#30340;&#24773;&#20917;&#19979;&#36793;&#38469;&#27835;&#30103;&#25928;&#24212;
&lt;/p&gt;
&lt;p&gt;
Marginal treatment effects in the absence of instrumental variables
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2401.17595
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22312;&#27809;&#26377;&#24037;&#20855;&#21464;&#37327;&#30340;&#24773;&#20917;&#19979;&#23450;&#20041;&#12289;&#35782;&#21035;&#21644;&#20272;&#35745;&#36793;&#38469;&#27835;&#30103;&#25928;&#24212;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#26032;&#30340;&#23450;&#20041;&#21644;&#20805;&#20998;&#26465;&#20214;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#22312;&#27809;&#26377;&#24037;&#20855;&#21464;&#37327;&#30340;&#24773;&#20917;&#19979;&#36793;&#38469;&#27835;&#30103;&#25928;&#24212;&#19982;&#26631;&#20934;&#27835;&#30103;&#21442;&#25968;&#20043;&#38388;&#30340;&#20851;&#31995;&#25104;&#31435;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#22312;&#19981;&#26045;&#21152;&#29420;&#31435;&#24615;&#12289;&#25490;&#38500;&#24615;&#21644;&#21487;&#20998;&#31163;&#24615;&#65288;&#25110;&#21333;&#35843;&#24615;&#65289;&#24037;&#20855;&#21464;&#37327;&#65288;IV&#65289;&#20551;&#35774;&#30340;&#24773;&#20917;&#19979;&#23450;&#20041;&#12289;&#35782;&#21035;&#21644;&#20272;&#35745;&#36793;&#38469;&#27835;&#30103;&#25928;&#24212;&#65288;MTE&#65289;&#30340;&#26041;&#27861;&#12290;&#22312;&#22522;&#20110;&#19982;&#21327;&#21464;&#37327;&#32479;&#35745;&#29420;&#31435;&#30340;&#20943;&#23569;&#24418;&#24335;&#27835;&#30103;&#35823;&#24046;&#30340;&#26032;&#23450;&#20041;&#19979;&#65292;&#25105;&#20204;&#21457;&#29616;&#22312;&#27809;&#26377;&#24037;&#20855;&#21464;&#37327;&#30340;&#24773;&#20917;&#19979;MTE&#19982;&#26631;&#20934;&#27835;&#30103;&#21442;&#25968;&#20043;&#38388;&#30340;&#20851;&#31995;&#25104;&#31435;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#19968;&#32452;&#30830;&#20445;&#22312;&#37325;&#35201;&#24322;&#36136;&#24615;&#29615;&#22659;&#20013;&#35782;&#21035;&#23450;&#20041;&#22909;&#30340;MTE&#30340;&#20805;&#20998;&#26465;&#20214;&#12290;&#20851;&#38190;&#26465;&#20214;&#21253;&#25324;&#23545;&#28508;&#22312;&#32467;&#26524;&#22238;&#24402;&#20989;&#25968;&#30340;&#32447;&#24615;&#32422;&#26463;&#12289;&#20542;&#21521;&#24471;&#20998;&#30340;&#38750;&#32447;&#24615;&#32422;&#26463;&#20197;&#21450;&#23558;&#23548;&#33268;&#21152;&#27861;&#21487;&#20998;&#31163;&#24615;&#30340;&#26465;&#20214;&#22343;&#20540;&#29420;&#31435;&#32422;&#26463;&#12290;&#25105;&#20204;&#20351;&#29992;&#22522;&#20110;&#20989;&#25968;&#24418;&#24335;&#30340;&#21322;&#21442;&#25968;&#35782;&#21035;&#27010;&#24565;&#26469;&#35777;&#26126;&#36825;&#31181;&#35782;&#21035;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#19968;&#33268;&#30340;&#21322;&#21442;&#25968;&#20272;&#35745;&#31243;&#24207;&#65292;&#24182;&#25552;&#20379;&#20102;&#19968;&#32452;&#36880;&#27493;&#20248;&#21270;&#30340;&#20272;&#35745;&#31639;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
We propose a method for defining, identifying, and estimating the marginal treatment effect (MTE) without imposing the instrumental variable (IV) assumptions of independence, exclusion, and separability (or monotonicity). Under a new definition of the MTE based on reduced-form treatment error that is statistically independent of the covariates, we find that the relationship between the MTE and standard treatment parameters holds in the absence of IVs. We provide a set of sufficient conditions ensuring the identification of the defined MTE in an environment of essential heterogeneity. The key conditions include a linear restriction on potential outcome regression functions, a nonlinear restriction on the propensity score, and a conditional mean independence restriction that will lead to additive separability. We prove this identification using the notion of semiparametric identification based on functional form. We suggest consistent semiparametric estimation procedures, and provide an 
&lt;/p&gt;</description></item></channel></rss>