<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#30740;&#31350;&#20102;&#22312;&#23433;&#20840;&#28216;&#25103;&#20013;&#31616;&#21333;&#21270;&#25509;&#36817;&#26368;&#20248;&#35299;&#65292;&#35299;&#20915;&#20102;&#27450;&#35784;&#34892;&#20026;&#23545;&#29992;&#25143;&#21644;&#31649;&#29702;&#32773;&#21487;&#33021;&#36896;&#25104;&#30340;&#36127;&#38754;&#24433;&#21709;&#12290;</title><link>https://arxiv.org/abs/2402.11209</link><description>&lt;p&gt;
&#24403;&#31616;&#21333;&#21270;&#22312;&#23433;&#20840;&#28216;&#25103;&#20013;&#25509;&#36817;&#26368;&#20248;
&lt;/p&gt;
&lt;p&gt;
When Simple in Near-Optimal in Security Games
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.11209
&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#20102;&#22312;&#23433;&#20840;&#28216;&#25103;&#20013;&#31616;&#21333;&#21270;&#25509;&#36817;&#26368;&#20248;&#35299;&#65292;&#35299;&#20915;&#20102;&#27450;&#35784;&#34892;&#20026;&#23545;&#29992;&#25143;&#21644;&#31649;&#29702;&#32773;&#21487;&#33021;&#36896;&#25104;&#30340;&#36127;&#38754;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36328;&#24212;&#29992;&#31243;&#24207;&#20013;&#26222;&#36941;&#23384;&#22312;&#27450;&#35784;&#25110;&#38750;&#27861;&#27963;&#21160;&#65292;&#24182;&#28041;&#21450;&#29992;&#25143;&#32469;&#36807;&#27861;&#24459;&#65292;&#36890;&#24120;&#20197;&#33719;&#21462;&#19968;&#20123;&#22312;&#21512;&#27861;&#34892;&#20026;&#33539;&#22260;&#20869;&#26080;&#27861;&#33719;&#24471;&#30340;&#21033;&#30410;&#20026;&#25112;&#30053;&#30446;&#30340;&#12290;&#28982;&#32780;&#65292;&#29992;&#25143;&#27450;&#35784;&#20855;&#26377;&#36127;&#38754;&#24433;&#21709;&#65292;&#21487;&#33021;&#21361;&#23475;&#23433;&#20840;&#25110;&#23545;&#29305;&#23450;&#20154;&#32676;&#26045;&#21152;&#19981;&#25104;&#27604;&#20363;&#30340;&#36127;&#38754;&#22806;&#37096;&#24615;&#12290;&#20026;&#20943;&#36731;&#29992;&#25143;&#27450;&#35784;&#30340;&#28508;&#22312;&#21361;&#23475;&#65292;&#25105;&#20204;&#23558;&#27450;&#35784;&#34892;&#20026;&#30417;&#31649;&#38382;&#39064;&#35270;&#20026;&#31649;&#29702;&#21592;&#21644;&#29992;&#25143;&#20043;&#38388;&#30340;&#23433;&#20840;&#28216;&#25103;&#12290;&#22312;&#36825;&#20010;&#28216;&#25103;&#20013;&#65292;&#31649;&#29702;&#21592;&#36890;&#36807;$R$&#20010;&#23433;&#20840;&#36164;&#28304;&#65288;&#20363;&#22914;&#35686;&#23519;&#65289;&#22312;$L$&#20010;&#20301;&#32622;&#37096;&#32626;&#65292;&#24182;&#23545;&#22312;&#36825;&#20123;&#20301;&#32622;&#36827;&#34892;&#27450;&#35784;&#30340;&#29992;&#25143;&#24449;&#25910;&#32602;&#27454;&#12290;&#23545;&#20110;&#36825;&#20010;&#23433;&#20840;&#28216;&#25103;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#31649;&#29702;&#21592;&#30340;&#31119;&#21033;&#21644;&#25910;&#20837;&#26368;&#22823;&#21270;&#30446;&#26631;&#12290;&#22312;&#20004;&#31181;&#35774;&#32622;&#20013;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#35745;&#31639;&#26368;&#20248;&#31649;&#29702;&#21592;&#31574;&#30053;&#26159;NP&#38590;&#39064;&#65292;&#24182;&#20026;&#27492;&#24320;&#21457;&#20102;&#33258;&#28982;&#30340;&#36138;&#23146;&#31639;&#27861;&#21464;&#20307;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.11209v1 Announce Type: cross  Abstract: Fraudulent or illegal activities are ubiquitous across applications and involve users bypassing the rule of law, often with the strategic aim of obtaining some benefit that would otherwise be unattainable within the bounds of lawful conduct. However, user fraud is detrimental, as it may compromise safety or impose disproportionate negative externalities on particular population groups.   To mitigate the potential harms of user fraud, we study the problem of policing such fraud as a security game between an administrator and users. In this game, an administrator deploys $R$ security resources (e.g., police officers) across $L$ locations and levies fines against users engaging in fraud at those locations. For this security game, we study both welfare and revenue maximization administrator objectives. In both settings, we show that computing the optimal administrator strategy is NP-hard and develop natural greedy algorithm variants for th
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#36890;&#36807;&#30740;&#31350;&#32654;&#22269;&#12289;&#33521;&#22269;&#12289;&#29790;&#20856;&#12289;&#24847;&#22823;&#21033;&#12289;&#27874;&#20848;&#21644;&#20044;&#24178;&#36798;&#30340;&#26696;&#20363;&#65292;&#32467;&#21512;&#25512;&#21368;&#36131;&#20219;&#25991;&#29486;&#65292;&#21457;&#29616;&#25919;&#24220;&#21019;&#24314;&#20020;&#26102;&#31185;&#23398;&#21672;&#35810;&#26426;&#26500;&#30340;&#30446;&#30340;&#26159;&#20026;&#20102;&#20026;&#19981;&#21463;&#27426;&#36814;&#30340;&#25919;&#31574;&#24320;&#33073;&#36131;&#20219;&#65292;ahSABs&#25104;&#21592;&#36890;&#24120;&#20195;&#34920;&#20102;&#19968;&#20010;&#29421;&#31364;&#30340;&#35266;&#28857;&#33539;&#22260;&#12290;&#23545;&#20110;&#27809;&#26377;&#21019;&#24314;ahSABs&#30340;&#29790;&#20856;&#30340;&#24322;&#24120;&#26696;&#20363;&#65292;&#36827;&#19968;&#27493;&#35777;&#23454;&#20102;&#36825;&#19968;&#21407;&#21017;&#12290;&#25919;&#31574;&#25512;&#35770;&#26159;&#65292;&#24212;&#35813;&#36890;&#36807;&#31435;&#27861;&#26426;&#26500;&#23545;ahSABs&#25104;&#21592;&#36827;&#34892;&#23457;&#26680;&#65292;&#20197;&#30830;&#20445;&#24191;&#27867;&#30340;&#25104;&#21592;&#20195;&#34920;&#24615;&#12290;</title><link>http://arxiv.org/abs/2310.04312</link><description>&lt;p&gt;
&#23450;&#21046;&#26367;&#32618;&#32650;&#65306;&#31185;&#23398;&#21672;&#35810;&#26426;&#26500;&#19982;&#26032;&#20896;&#30123;&#24773;&#21450;&#20854;&#21518;&#32493;&#20013;&#30340;&#25512;&#21368;&#36131;&#20219;&#65288;arXiv:2310.04312v1 [econ.GN]&#65289;
&lt;/p&gt;
&lt;p&gt;
Bespoke scapegoats: Scientific advisory bodies and blame avoidance in the Covid-19 pandemic and beyond. (arXiv:2310.04312v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.04312
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36890;&#36807;&#30740;&#31350;&#32654;&#22269;&#12289;&#33521;&#22269;&#12289;&#29790;&#20856;&#12289;&#24847;&#22823;&#21033;&#12289;&#27874;&#20848;&#21644;&#20044;&#24178;&#36798;&#30340;&#26696;&#20363;&#65292;&#32467;&#21512;&#25512;&#21368;&#36131;&#20219;&#25991;&#29486;&#65292;&#21457;&#29616;&#25919;&#24220;&#21019;&#24314;&#20020;&#26102;&#31185;&#23398;&#21672;&#35810;&#26426;&#26500;&#30340;&#30446;&#30340;&#26159;&#20026;&#20102;&#20026;&#19981;&#21463;&#27426;&#36814;&#30340;&#25919;&#31574;&#24320;&#33073;&#36131;&#20219;&#65292;ahSABs&#25104;&#21592;&#36890;&#24120;&#20195;&#34920;&#20102;&#19968;&#20010;&#29421;&#31364;&#30340;&#35266;&#28857;&#33539;&#22260;&#12290;&#23545;&#20110;&#27809;&#26377;&#21019;&#24314;ahSABs&#30340;&#29790;&#20856;&#30340;&#24322;&#24120;&#26696;&#20363;&#65292;&#36827;&#19968;&#27493;&#35777;&#23454;&#20102;&#36825;&#19968;&#21407;&#21017;&#12290;&#25919;&#31574;&#25512;&#35770;&#26159;&#65292;&#24212;&#35813;&#36890;&#36807;&#31435;&#27861;&#26426;&#26500;&#23545;ahSABs&#25104;&#21592;&#36827;&#34892;&#23457;&#26680;&#65292;&#20197;&#30830;&#20445;&#24191;&#27867;&#30340;&#25104;&#21592;&#20195;&#34920;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#23398;&#32773;&#20204;&#27809;&#26377;&#25506;&#31350;&#20026;&#20160;&#20040;&#36825;&#20040;&#22810;&#25919;&#24220;&#22312;&#24212;&#23545;&#26032;&#20896;&#30123;&#24773;&#26102;&#21019;&#24314;&#20102;&#20020;&#26102;&#31185;&#23398;&#21672;&#35810;&#26426;&#26500;&#65288;ahSABs&#65289;&#32780;&#19981;&#20381;&#36182;&#29616;&#26377;&#30340;&#20844;&#20849;&#21355;&#29983;&#22522;&#30784;&#35774;&#26045;&#12290;&#25105;&#20204;&#36890;&#36807;&#23545;&#32654;&#22269;&#12289;&#33521;&#22269;&#12289;&#29790;&#20856;&#12289;&#24847;&#22823;&#21033;&#12289;&#27874;&#20848;&#21644;&#20044;&#24178;&#36798;&#30340;&#26696;&#20363;&#30740;&#31350;&#20197;&#21450;&#23545;&#25512;&#21368;&#36131;&#20219;&#25991;&#29486;&#30340;&#20511;&#37492;&#65292;&#22238;&#31572;&#20102;&#36825;&#20010;&#34987;&#24573;&#35270;&#30340;&#38382;&#39064;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;ahSABs&#30340;&#21019;&#24314;&#26159;&#20026;&#20102;&#20026;&#19981;&#21463;&#27426;&#36814;&#30340;&#25919;&#31574;&#24320;&#33073;&#36131;&#20219;&#65292;&#20107;&#24773;&#20986;&#38382;&#39064;&#26102;&#25104;&#20026;&#26367;&#32618;&#32650;&#12290;&#22240;&#27492;&#65292;ahSABs&#30340;&#25104;&#21592;&#36890;&#24120;&#20195;&#34920;&#20102;&#19968;&#20010;&#29421;&#31364;&#30340;&#35266;&#28857;&#33539;&#22260;&#12290;ahSABs&#26159;&#19968;&#20010;&#22909;&#30340;&#26367;&#32618;&#32650;&#65292;&#22240;&#20026;&#23427;&#23545;&#20943;&#23569;&#25919;&#24220;&#30340;&#33258;&#30001;&#35009;&#37327;&#26435;&#20960;&#20046;&#27809;&#26377;&#24110;&#21161;&#65292;&#24182;&#19988;&#22312;&#36716;&#23233;&#36131;&#20219;&#32473;&#25919;&#24220;&#26041;&#38754;&#33021;&#21147;&#26377;&#38480;&#12290;&#25105;&#20204;&#23545;&#29790;&#20856;&#27809;&#26377;&#21019;&#24314;ahSABs&#30340;&#24322;&#24120;&#26696;&#20363;&#30340;&#35299;&#37322;&#36827;&#19968;&#27493;&#35777;&#23454;&#20102;&#25105;&#20204;&#30340;&#19968;&#33324;&#21407;&#21017;&#12290;&#25105;&#20204;&#24471;&#20986;&#30340;&#25919;&#31574;&#25512;&#35770;&#26159;&#65292;&#24212;&#35813;&#36890;&#36807;&#31435;&#27861;&#26426;&#26500;&#23545;ahSABs&#25104;&#21592;&#36827;&#34892;&#23457;&#26680;&#65292;&#20197;&#30830;&#20445;&#24191;&#27867;&#30340;&#25104;&#21592;&#20195;&#34920;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Scholars have not asked why so many governments created ad hoc scientific advisory bodies (ahSABs) to address the Covid-19 pandemic instead of relying on existing public health infrastructure. We address this neglected question with an exploratory study of the US, UK, Sweden, Italy, Poland, and Uganda. Drawing on our case studies and the blame-avoidance literature, we find that ahSABs are created to excuse unpopular policies and take the blame should things go wrong. Thus, membership typically represents a narrow range of perspectives. An ahSAB is a good scapegoat because it does little to reduce government discretion and has limited ability to deflect blame back to government. Our explanation of our deviant case of Sweden, that did not create and ahSAB, reinforces our general principles. We draw the policy inference that ahSAB membership should be vetted by the legislature to ensure broad membership.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#26816;&#39564;&#21160;&#24577;&#31163;&#25955;&#21338;&#24328;&#20013;&#20851;&#38190;&#20551;&#23450;&#8220;&#21516;&#36136;&#24615;&#20551;&#35774;&#8221;&#30340;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#33021;&#36890;&#36807;&#38543;&#26426;&#21270;&#26816;&#39564;&#26469;&#39564;&#35777;&#35813;&#20551;&#35774;&#26159;&#21542;&#25104;&#31435;&#12290;</title><link>http://arxiv.org/abs/2010.02297</link><description>&lt;p&gt;
&#26377;&#38480;&#26679;&#26412;&#20013;&#21160;&#24577;&#31163;&#25955;&#21338;&#24328;&#30340;&#21516;&#36136;&#24615;&#26816;&#39564;
&lt;/p&gt;
&lt;p&gt;
Testing homogeneity in dynamic discrete games in finite samples. (arXiv:2010.02297v2 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2010.02297
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#26816;&#39564;&#21160;&#24577;&#31163;&#25955;&#21338;&#24328;&#20013;&#20851;&#38190;&#20551;&#23450;&#8220;&#21516;&#36136;&#24615;&#20551;&#35774;&#8221;&#30340;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#33021;&#36890;&#36807;&#38543;&#26426;&#21270;&#26816;&#39564;&#26469;&#39564;&#35777;&#35813;&#20551;&#35774;&#26159;&#21542;&#25104;&#31435;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21160;&#24577;&#31163;&#25955;&#21338;&#24328;&#30340;&#25991;&#29486;&#32463;&#24120;&#20551;&#23450;&#26465;&#20214;&#36873;&#25321;&#27010;&#29575;&#21644;&#29366;&#24577;&#36716;&#31227;&#27010;&#29575;&#22312;&#19981;&#21516;&#24066;&#22330;&#21644;&#26102;&#38388;&#19978;&#26159;&#21516;&#36136;&#30340;&#12290;&#25105;&#20204;&#31216;&#20043;&#20026;&#8220;&#21160;&#24577;&#31163;&#25955;&#21338;&#24328;&#20013;&#30340;&#21516;&#36136;&#24615;&#20551;&#35774;&#8221;&#12290;&#35813;&#20551;&#35774;&#20351;&#24471;&#32463;&#39564;&#30740;&#31350;&#21487;&#20197;&#36890;&#36807;&#27719;&#24635;&#22810;&#20010;&#24066;&#22330;&#21644;&#22810;&#20010;&#26102;&#38388;&#27573;&#30340;&#25968;&#25454;&#26469;&#20272;&#35745;&#28216;&#25103;&#30340;&#32467;&#26500;&#21442;&#25968;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#20551;&#35774;&#26816;&#39564;&#26469;&#35780;&#20272;&#25968;&#25454;&#26159;&#21542;&#31526;&#21512;&#21516;&#36136;&#24615;&#20551;&#35774;&#12290;&#25105;&#20204;&#30340;&#20551;&#35774;&#26816;&#39564;&#26159;&#36890;&#36807;&#39532;&#23572;&#21487;&#22827;&#38142;&#33945;&#29305;&#21345;&#32599;&#65288;MCMC&#65289;&#31639;&#27861;&#23454;&#29616;&#36817;&#20284;&#38543;&#26426;&#21270;&#26816;&#39564;&#30340;&#32467;&#26524;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#24403;&#65288;&#29992;&#25143;&#23450;&#20041;&#30340;&#65289;MCMC&#25277;&#26679;&#27425;&#25968;&#36235;&#20110;&#26080;&#31351;&#22823;&#26102;&#65292;&#25105;&#20204;&#30340;&#20551;&#35774;&#26816;&#39564;&#23601;&#26159;&#26377;&#25928;&#30340;&#65292;&#23545;&#20110;&#20219;&#20309;&#22266;&#23450;&#30340;&#24066;&#22330;&#12289;&#26102;&#38388;&#27573;&#21644;&#29609;&#23478;&#25968;&#37327;&#12290;&#25105;&#20204;&#23558;&#25105;&#20204;&#30340;&#26816;&#39564;&#24212;&#29992;&#20110;&#29790;&#23433;&#65288;2012&#65289;&#23545;&#32654;&#22269;&#27874;&#29305;&#20848;&#27700;&#27877;&#24037;&#19994;&#30340;&#32463;&#39564;&#30740;&#31350;&#20013;&#12290;
&lt;/p&gt;
&lt;p&gt;
The literature on dynamic discrete games often assumes that the conditional choice probabilities and the state transition probabilities are homogeneous across markets and over time. We refer to this as the "homogeneity assumption" in dynamic discrete games. This assumption enables empirical studies to estimate the game's structural parameters by pooling data from multiple markets and from many time periods. In this paper, we propose a hypothesis test to evaluate whether the homogeneity assumption holds in the data. Our hypothesis test is the result of an approximate randomization test, implemented via a Markov chain Monte Carlo (MCMC) algorithm. We show that our hypothesis test becomes valid as the (user-defined) number of MCMC draws diverges, for any fixed number of markets, time periods, and players. We apply our test to the empirical study of the U.S.\ Portland cement industry in Ryan (2012).
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#32463;&#39564;&#30740;&#31350;&#20013;&#32463;&#24120;&#34987;&#24573;&#30053;&#30340;&#37096;&#20998;&#35266;&#27979;&#21040;&#30340;&#32593;&#32476;&#20013;&#30340;&#35745;&#21010;&#25910;&#30410;&#28322;&#20986;&#38382;&#39064;&#65292;&#24182;&#25552;&#20986;&#20102;&#20004;&#31181;&#26041;&#27861;&#26469;&#35782;&#21035;&#22788;&#29702;&#21644;&#28322;&#20986;&#25928;&#24212;&#65292;&#36825;&#23545;&#20110;&#20943;&#23569;&#32570;&#22833;&#32593;&#32476;&#38142;&#25509;&#36896;&#25104;&#30340;&#20559;&#24046;&#24456;&#26377;&#25928;&#12290;</title><link>http://arxiv.org/abs/2009.09614</link><description>&lt;p&gt;
&#37096;&#20998;&#35266;&#27979;&#21040;&#30340;&#32593;&#32476;&#20013;&#30340;&#35745;&#21010;&#25910;&#30410;&#28322;&#20986;&#38382;&#39064;
&lt;/p&gt;
&lt;p&gt;
Spillovers of Program Benefits with Missing Network Links. (arXiv:2009.09614v2 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2009.09614
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#32463;&#39564;&#30740;&#31350;&#20013;&#32463;&#24120;&#34987;&#24573;&#30053;&#30340;&#37096;&#20998;&#35266;&#27979;&#21040;&#30340;&#32593;&#32476;&#20013;&#30340;&#35745;&#21010;&#25910;&#30410;&#28322;&#20986;&#38382;&#39064;&#65292;&#24182;&#25552;&#20986;&#20102;&#20004;&#31181;&#26041;&#27861;&#26469;&#35782;&#21035;&#22788;&#29702;&#21644;&#28322;&#20986;&#25928;&#24212;&#65292;&#36825;&#23545;&#20110;&#20943;&#23569;&#32570;&#22833;&#32593;&#32476;&#38142;&#25509;&#36896;&#25104;&#30340;&#20559;&#24046;&#24456;&#26377;&#25928;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#32463;&#39564;&#30740;&#31350;&#20013;&#65292;&#37096;&#20998;&#35266;&#23519;&#21040;&#30340;&#32593;&#32476;&#20013;&#32570;&#23569;&#32593;&#32476;&#38142;&#25509;&#30340;&#38382;&#39064;&#32463;&#24120;&#34987;&#24573;&#30053;&#12290;&#26412;&#25991;&#26088;&#22312;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;&#21516;&#26102;&#30740;&#31350;&#20102;&#32593;&#32476;&#30456;&#20114;&#20316;&#29992;&#19979;&#35745;&#21010;&#25910;&#30410;&#30340;&#28322;&#20986;&#12290;&#25105;&#20204;&#19987;&#27880;&#20110;&#19968;&#20010;&#20801;&#35768;&#28789;&#27963;&#30340;&#24322;&#36136;&#24615;&#24418;&#24335;&#30340;&#38750;&#21442;&#25968;&#32467;&#26524;&#27169;&#22411;&#65292;&#24182;&#25552;&#20986;&#20102;&#20004;&#31181;&#26041;&#27861;&#26469;&#35782;&#21035;&#36793;&#30028;&#32593;&#32476;&#24230;&#30340;&#22788;&#29702;&#21644;&#28322;&#20986;&#25928;&#24212;&#12290;&#24403;&#32593;&#32476;&#24230;&#26080;&#30028;&#26102;&#65292;&#36825;&#20123;&#26041;&#27861;&#21487;&#29992;&#20110;&#20943;&#36731;&#30001;&#20110;&#32570;&#22833;&#32593;&#32476;&#38142;&#25509;&#32780;&#36896;&#25104;&#30340;&#20559;&#24046;&#12290;&#31532;&#19968;&#31181;&#26041;&#27861;&#21033;&#29992;&#22522;&#20110;&#20256;&#20837;&#21644;&#20256;&#20986;&#38142;&#25509;&#30340;&#20004;&#20010;&#26131;&#20110;&#26500;&#24314;&#30340;&#32593;&#32476;&#27979;&#37327;&#12290;&#31532;&#20108;&#31181;&#26041;&#27861;&#20381;&#36182;&#20110;&#19968;&#20010;&#20855;&#26377;&#24050;&#30693;&#32570;&#22833;&#29575;&#30340;&#21333;&#20010;&#32593;&#32476;&#27979;&#37327;&#12290;&#25105;&#20204;&#20351;&#29992;&#33945;&#29305;&#21345;&#32599;&#23454;&#39564;&#21644;&#22522;&#20110;&#30495;&#23454;&#19990;&#30028;&#23398;&#26657;&#32593;&#32476;&#25968;&#25454;&#30340;&#33258;&#28982;&#27169;&#25311;&#28436;&#31034;&#20102;&#25105;&#20204;&#30340;&#26041;&#27861;&#25552;&#20379;&#30340;&#26377;&#25928;&#20559;&#24046;&#20943;&#23569;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#22312;&#32570;&#23569;&#32593;&#32476;&#38142;&#25509;&#30340;&#23398;&#26657;&#32593;&#32476;&#20013;&#37325;&#26032;&#30740;&#31350;&#20102;&#23478;&#24237;&#30005;&#33041;&#20351;&#29992;&#23545;&#20799;&#31461;&#23398;&#19994;&#25104;&#32489;&#30340;&#28322;&#20986;&#12290;
&lt;/p&gt;
&lt;p&gt;
The issue of missing network links in partially observed networks is frequently neglected in empirical studies. This paper aims to address this issue when investigating spillovers of program benefits in the presence of network interactions. We focus on a nonparametric outcome model that allows for flexible forms of heterogeneity, and we propose two methods to point identify the treatment and spillover effects in the case of bounded network degree. When the network degree is unbounded, these methods can be used to mitigate the bias caused by missing network links. The first method utilizes two easily-constructed network measures based on the incoming and outgoing links. The second method relies on a single network measure with a known rate of missing links. We demonstrate the effective bias reduction provided by our methods using Monte Carlo experiments and a naturalistic simulation on real-world school network data. Finally, we re-examine the spillovers of home computer use on children
&lt;/p&gt;</description></item></channel></rss>