<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#28608;&#21169;&#20860;&#23481;&#19988;&#20010;&#20307;&#29702;&#24615;&#30340;vertiport&#39044;&#35746;&#26426;&#21046;&#65292;&#26088;&#22312;&#21327;&#35843;&#22810;&#20010;&#36816;&#33829;&#21830;&#25805;&#20316;&#30340;&#30005;&#21160;&#22402;&#30452;&#36215;&#38477;&#65288;eVTOL&#65289;&#39134;&#34892;&#22120;&#22312;vertiports&#20043;&#38388;&#31227;&#21160;&#65292;&#26368;&#22823;&#21270;&#25152;&#26377;&#36816;&#33829;&#21830;&#30340;&#24635;&#20272;&#20540;&#21516;&#26102;&#26368;&#23567;&#21270;vertiports&#30340;&#25317;&#22581;&#12290;</title><link>https://arxiv.org/abs/2403.18166</link><description>&lt;p&gt;
&#20855;&#26377;&#28608;&#21169;&#20860;&#23481;&#24615;&#30340;&#20808;&#36827;&#31354;&#20013;&#31227;&#21160;&#20013;&#30340;Vertiport&#39044;&#35746;&#65306;&#22522;&#20110;&#25293;&#21334;&#30340;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Incentive-Compatible Vertiport Reservation in Advanced Air Mobility: An Auction-Based Approach
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.18166
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#28608;&#21169;&#20860;&#23481;&#19988;&#20010;&#20307;&#29702;&#24615;&#30340;vertiport&#39044;&#35746;&#26426;&#21046;&#65292;&#26088;&#22312;&#21327;&#35843;&#22810;&#20010;&#36816;&#33829;&#21830;&#25805;&#20316;&#30340;&#30005;&#21160;&#22402;&#30452;&#36215;&#38477;&#65288;eVTOL&#65289;&#39134;&#34892;&#22120;&#22312;vertiports&#20043;&#38388;&#31227;&#21160;&#65292;&#26368;&#22823;&#21270;&#25152;&#26377;&#36816;&#33829;&#21830;&#30340;&#24635;&#20272;&#20540;&#21516;&#26102;&#26368;&#23567;&#21270;vertiports&#30340;&#25317;&#22581;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#39044;&#35745;&#26410;&#26469;&#20808;&#36827;&#31354;&#20013;&#31227;&#21160;&#65288;AAM&#65289;&#30340;&#23835;&#36215;&#23558;&#25104;&#20026;&#19968;&#20010;&#25968;&#21313;&#20159;&#32654;&#20803;&#30340;&#20135;&#19994;&#12290;&#24066;&#22330;&#26426;&#21046;&#34987;&#35748;&#20026;&#26159;AAM&#36816;&#33829;&#30340;&#19968;&#20010;&#37325;&#35201;&#32452;&#25104;&#37096;&#20998;&#65292;&#20854;&#20013;&#21253;&#25324;&#20855;&#26377;&#31169;&#20154;&#20272;&#20540;&#30340;&#24322;&#26500;&#36816;&#33829;&#21830;&#12290;&#26412;&#25991;&#30740;&#31350;&#20102;&#35774;&#35745;&#19968;&#31181;&#26426;&#21046;&#26469;&#21327;&#35843;&#30001;&#22810;&#20010;&#20855;&#26377;&#19982;&#20854;&#26426;&#32676;&#20851;&#32852;&#30340;&#24322;&#26500;&#20272;&#20540;&#30340;&#36816;&#33829;&#21830;&#25805;&#20316;&#30340;&#30005;&#21160;&#22402;&#30452;&#36215;&#38477;&#65288;eVTOL&#65289;&#39134;&#34892;&#22120;&#22312;vertiports&#20043;&#38388;&#31227;&#21160;&#30340;&#38382;&#39064;&#65292;&#21516;&#26102;&#24378;&#21046;&#25191;&#34892;vertiports&#30340;&#21040;&#36798;&#12289;&#31163;&#24320;&#21644;&#20572;&#36710;&#32422;&#26463;&#12290;&#29305;&#21035;&#26159;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#28608;&#21169;&#20860;&#23481;&#19988;&#20010;&#20307;&#29702;&#24615;&#30340;vertiport&#39044;&#35746;&#26426;&#21046;&#65292;&#35813;&#26426;&#21046;&#26368;&#22823;&#21270;&#20102;&#19968;&#20010;&#31038;&#20250;&#31119;&#21033;&#24230;&#37327;&#26631;&#20934;&#65292;&#20174;&#32780;&#21253;&#25324;&#26368;&#22823;&#21270;&#25152;&#26377;&#36816;&#33829;&#21830;&#30340;&#24635;&#20272;&#20540;&#21516;&#26102;&#26368;&#23567;&#21270;vertiports&#30340;&#25317;&#22581;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#25552;&#39640;&#20102;&#35774;&#35745;&#36825;&#19968;&#26426;&#21046;&#30340;&#35745;&#31639;&#21487;&#22788;&#29702;&#24615;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.18166v1 Announce Type: cross  Abstract: The rise of advanced air mobility (AAM) is expected to become a multibillion-dollar industry in the near future. Market-based mechanisms are touted to be an integral part of AAM operations, which comprise heterogeneous operators with private valuations. In this work, we study the problem of designing a mechanism to coordinate the movement of electric vertical take-off and landing (eVTOL) aircraft, operated by multiple operators each having heterogeneous valuations associated with their fleet, between vertiports, while enforcing the arrival, departure, and parking constraints at vertiports. Particularly, we propose an incentive-compatible and individually rational vertiport reservation mechanism that maximizes a social welfare metric, which encapsulates the objective of maximizing the overall valuations of all operators while minimizing the congestion at vertiports. Additionally, we improve the computational tractability of designing th
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#38024;&#23545;&#30446;&#26631;&#33829;&#38144;&#30340;&#24378;&#30423;&#21033;&#28070;&#26368;&#22823;&#21270;&#38382;&#39064;&#65292;&#24182;&#25552;&#20986;&#20102;&#22312;&#25932;&#23545;&#24378;&#30423;&#24773;&#22659;&#19979;&#30340;&#36817;&#20046;&#26368;&#20248;&#31639;&#27861;&#12290;</title><link>https://arxiv.org/abs/2403.01361</link><description>&lt;p&gt;
&#38024;&#23545;&#30446;&#26631;&#33829;&#38144;&#30340;&#24378;&#30423;&#21033;&#28070;&#26368;&#22823;&#21270;
&lt;/p&gt;
&lt;p&gt;
Bandit Profit-maximization for Targeted Marketing
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.01361
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#38024;&#23545;&#30446;&#26631;&#33829;&#38144;&#30340;&#24378;&#30423;&#21033;&#28070;&#26368;&#22823;&#21270;&#38382;&#39064;&#65292;&#24182;&#25552;&#20986;&#20102;&#22312;&#25932;&#23545;&#24378;&#30423;&#24773;&#22659;&#19979;&#30340;&#36817;&#20046;&#26368;&#20248;&#31639;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#19968;&#20010;&#39034;&#24207;&#21033;&#28070;&#26368;&#22823;&#21270;&#38382;&#39064;&#65292;&#20248;&#21270;&#20215;&#26684;&#21644;&#20687;&#33829;&#38144;&#25903;&#20986;&#36825;&#26679;&#30340;&#36741;&#21161;&#21464;&#37327;&#12290;&#20855;&#20307;&#26469;&#35828;&#65292;&#25105;&#20204;&#26088;&#22312;&#22312;&#19968;&#20010;&#20219;&#24847;&#24207;&#21015;&#30340;&#22810;&#20010;&#38656;&#27714;&#26354;&#32447;&#19978;&#26368;&#22823;&#21270;&#21033;&#28070;&#65292;&#27599;&#20010;&#26354;&#32447;&#20381;&#36182;&#20110;&#19968;&#20010;&#19981;&#21516;&#30340;&#36741;&#21161;&#21464;&#37327;&#65292;&#20294;&#20849;&#20139;&#30456;&#21516;&#30340;&#20215;&#26684;&#12290;&#19968;&#20010;&#20856;&#22411;&#30340;&#20363;&#23376;&#26159;&#38024;&#23545;&#33829;&#38144;&#65292;&#20854;&#20013;&#19968;&#23478;&#20844;&#21496;&#65288;&#21334;&#26041;&#65289;&#24076;&#26395;&#22312;&#22810;&#20010;&#24066;&#22330;&#19978;&#38144;&#21806;&#20135;&#21697;&#12290;&#20844;&#21496;&#21487;&#20197;&#20026;&#19981;&#21516;&#24066;&#22330;&#25237;&#20837;&#19981;&#21516;&#30340;&#33829;&#38144;&#25903;&#20986;&#20197;&#20248;&#21270;&#23458;&#25143;&#33719;&#21462;&#65292;&#20294;&#24517;&#39035;&#22312;&#25152;&#26377;&#24066;&#22330;&#19978;&#20445;&#25345;&#30456;&#21516;&#30340;&#20215;&#26684;&#12290;&#27492;&#22806;&#65292;&#24066;&#22330;&#21487;&#33021;&#20855;&#26377;&#24322;&#36136;&#30340;&#38656;&#27714;&#26354;&#32447;&#65292;&#27599;&#20010;&#38656;&#27714;&#26354;&#32447;&#23545;&#20215;&#26684;&#21644;&#33829;&#38144;&#25903;&#20986;&#30340;&#21709;&#24212;&#26041;&#24335;&#19981;&#21516;&#12290;&#20844;&#21496;&#30340;&#30446;&#26631;&#26159;&#26368;&#22823;&#21270;&#27611;&#21033;&#28070;&#65292;&#21363;&#24635;&#25910;&#20837;&#20943;&#21435;&#33829;&#38144;&#25104;&#26412;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.01361v1 Announce Type: new  Abstract: We study a sequential profit-maximization problem, optimizing for both price and ancillary variables like marketing expenditures. Specifically, we aim to maximize profit over an arbitrary sequence of multiple demand curves, each dependent on a distinct ancillary variable, but sharing the same price. A prototypical example is targeted marketing, where a firm (seller) wishes to sell a product over multiple markets. The firm may invest different marketing expenditures for different markets to optimize customer acquisition, but must maintain the same price across all markets. Moreover, markets may have heterogeneous demand curves, each responding to prices and marketing expenditures differently. The firm's objective is to maximize its gross profit, the total revenue minus marketing costs.   Our results are near-optimal algorithms for this class of problems in an adversarial bandit setting, where demand curves are arbitrary non-adaptive seque
&lt;/p&gt;</description></item><item><title>&#23545;&#20110;&#27169;&#31946;&#20998;&#31867;&#38382;&#39064;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#28385;&#36275;&#24369;&#19968;&#33268;&#24615;&#26465;&#20214;&#30340;&#29420;&#31435;&#32858;&#21512;&#35268;&#21017;&#23646;&#20110;&#21152;&#26435;&#31639;&#26415;&#24179;&#22343;&#25968;&#30340;&#23478;&#26063;&#65292;&#24182;&#32473;&#20986;&#20102;$m= p= 2$&#30340;&#29305;&#24449;&#21270;&#32467;&#26524;&#12290;</title><link>https://arxiv.org/abs/2402.17620</link><description>&lt;p&gt;
&#27169;&#31946;&#20998;&#31867;&#32858;&#21512;
&lt;/p&gt;
&lt;p&gt;
Fuzzy Classification Aggregation
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.17620
&lt;/p&gt;
&lt;p&gt;
&#23545;&#20110;&#27169;&#31946;&#20998;&#31867;&#38382;&#39064;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#28385;&#36275;&#24369;&#19968;&#33268;&#24615;&#26465;&#20214;&#30340;&#29420;&#31435;&#32858;&#21512;&#35268;&#21017;&#23646;&#20110;&#21152;&#26435;&#31639;&#26415;&#24179;&#22343;&#25968;&#30340;&#23478;&#26063;&#65292;&#24182;&#32473;&#20986;&#20102;$m= p= 2$&#30340;&#29305;&#24449;&#21270;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#32771;&#34385;&#19968;&#20010;&#38382;&#39064;&#65292;&#21363;&#19968;&#32452;&#20010;&#20307;&#24517;&#39035;&#23558;$m$&#20010;&#23545;&#35937;&#20998;&#31867;&#21040;$p$&#20010;&#31867;&#21035;&#20013;&#65292;&#24182;&#36890;&#36807;&#32858;&#21512;&#20010;&#20307;&#20998;&#31867;&#26469;&#23454;&#29616;&#12290;&#25105;&#20204;&#35777;&#26126;&#65292;&#22914;&#26524;$m\geq 3$&#65292;$m\geq p\geq 2$&#65292;&#24182;&#19988;&#20998;&#31867;&#26159;&#27169;&#31946;&#30340;&#65292;&#20063;&#23601;&#26159;&#35828;&#65292;&#23545;&#35937;&#23646;&#20110;&#26576;&#19968;&#31867;&#21035;&#30340;&#31243;&#24230;&#19981;&#21516;&#65292;&#21017;&#28385;&#36275;&#24369;&#19968;&#33268;&#24615;&#26465;&#20214;&#30340;&#29420;&#31435;&#32858;&#21512;&#35268;&#21017;&#23646;&#20110;&#21152;&#26435;&#31639;&#26415;&#24179;&#22343;&#25968;&#30340;&#23478;&#26063;&#12290;&#25105;&#20204;&#36824;&#33719;&#24471;&#20102;$m= p= 2$&#30340;&#29305;&#24449;&#21270;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.17620v1 Announce Type: new  Abstract: We consider the problem where a set of individuals has to classify $m$ objects into $p$ categories and does so by aggregating the individual classifications. We show that if $m\geq 3$, $m\geq p\geq 2$, and classifications are fuzzy, that is, objects belong to a category to a certain degree, then an independent aggregator rule that satisfies a weak unanimity condition belongs to the family of Weighted Arithmetic Means. We also obtain characterization results for $m= p= 2$.
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#19968;&#31181;&#20844;&#24179;&#21010;&#20998;&#21487;&#21010;&#20998;&#24322;&#36136;&#36164;&#28304;&#30340;&#38382;&#39064;&#65292;&#21363;&#34507;&#31957;&#20999;&#20998;&#12290;&#35813;&#35770;&#25991;&#30830;&#23450;&#20102;&#23384;&#22312;&#19968;&#31181;&#36830;&#36890;&#30340;&#24378;&#27604;&#20363;&#20999;&#20998;&#26041;&#24335;&#65292;&#24182;&#25552;&#20379;&#20102;&#30456;&#24212;&#30340;&#31639;&#27861;&#21644;&#31616;&#21333;&#21051;&#30011;&#12290;</title><link>https://arxiv.org/abs/2312.15326</link><description>&lt;p&gt;
&#20851;&#20110;&#36830;&#36890;&#19988;&#24378;&#27604;&#20363;&#20999;&#34507;&#31957;&#30340;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
On Connected Strongly-Proportional Cake-Cutting
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2312.15326
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#19968;&#31181;&#20844;&#24179;&#21010;&#20998;&#21487;&#21010;&#20998;&#24322;&#36136;&#36164;&#28304;&#30340;&#38382;&#39064;&#65292;&#21363;&#34507;&#31957;&#20999;&#20998;&#12290;&#35813;&#35770;&#25991;&#30830;&#23450;&#20102;&#23384;&#22312;&#19968;&#31181;&#36830;&#36890;&#30340;&#24378;&#27604;&#20363;&#20999;&#20998;&#26041;&#24335;&#65292;&#24182;&#25552;&#20379;&#20102;&#30456;&#24212;&#30340;&#31639;&#27861;&#21644;&#31616;&#21333;&#21051;&#30011;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#22312;&#19968;&#32452;&#20195;&#29702;&#20154;&#20013;&#22914;&#20309;&#20844;&#24179;&#22320;&#20998;&#37197;&#21487;&#21010;&#20998;&#30340;&#24322;&#36136;&#36164;&#28304;&#65292;&#20063;&#31216;&#20026;&#34507;&#31957;&#12290;&#25105;&#20204;&#30830;&#23450;&#20102;&#23384;&#22312;&#30528;&#19968;&#31181;&#20998;&#37197;&#26041;&#24335;&#65292;&#27599;&#20010;&#20195;&#29702;&#20154;&#37117;&#20250;&#25910;&#21040;&#19968;&#20010;&#20215;&#20540;&#20005;&#26684;&#36229;&#36807;&#20182;&#20204;&#27604;&#20363;&#20221;&#39069;&#30340;&#36830;&#32493;&#37096;&#20998;&#65292;&#20063;&#31216;&#20026;*&#24378;&#27604;&#20363;&#20998;&#37197;*&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#31639;&#27861;&#65292;&#21487;&#20197;&#20351;&#29992;&#26368;&#22810;$n \cdot 2^{n-1}$&#20010;&#26597;&#35810;&#26469;&#30830;&#23450;&#26159;&#21542;&#23384;&#22312;&#19968;&#20010;&#36830;&#36890;&#30340;&#24378;&#27604;&#20363;&#20998;&#37197;&#12290;&#23545;&#20110;&#20855;&#26377;&#20005;&#26684;&#27491;&#20272;&#20540;&#30340;&#20195;&#29702;&#20154;&#65292;&#25105;&#20204;&#25552;&#20379;&#20102;&#19968;&#20010;&#26356;&#31616;&#21333;&#30340;&#21051;&#30011;&#65292;&#24182;&#19988;&#35777;&#26126;&#20102;&#30830;&#23450;&#26159;&#21542;&#23384;&#22312;&#19968;&#20010;&#36830;&#36890;&#30340;&#24378;&#27604;&#20363;&#20998;&#37197;&#25152;&#38656;&#30340;&#26597;&#35810;&#25968;&#37327;&#26159;$\Theta(n^2)$&#12290;&#25105;&#20204;&#30340;&#35777;&#26126;&#26159;&#26500;&#36896;&#24615;&#30340;&#65292;&#24182;&#19988;&#24403;&#23384;&#22312;&#26102;&#65292;&#32473;&#20986;&#20102;&#19968;&#20010;&#36830;&#36890;&#30340;&#24378;&#27604;&#20363;&#20998;&#37197;&#65292;&#20351;&#29992;&#20102;&#31867;&#20284;&#25968;&#37327;&#30340;&#26597;&#35810;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2312.15326v2 Announce Type: replace-cross Abstract: We investigate the problem of fairly dividing a divisible heterogeneous resource, also known as a cake, among a set of agents. We characterize the existence of an allocation in which every agent receives a contiguous piece worth strictly more than their proportional share, also known as a *strongly-proportional allocation*. The characterization is supplemented with an algorithm that determines the existence of a connected strongly-proportional allocation using at most $n \cdot 2^{n-1}$ queries. We provide a simpler characterization for agents with strictly positive valuations, and show that the number of queries required to determine the existence of a connected strongly-proportional allocation is in $\Theta(n^2)$. Our proofs are constructive and yield a connected strongly-proportional allocation, when it exists, using a similar number of queries.
&lt;/p&gt;</description></item><item><title>&#36825;&#31687;&#35770;&#25991;&#25552;&#20379;&#20102;&#19968;&#20010;&#26032;&#30340;&#39118;&#38505;&#21388;&#24694;&#22522;&#30784;&#65292;&#36890;&#36807;&#23637;&#31034;&#20805;&#20998;&#21033;&#29992;&#20445;&#38505;&#26426;&#20250;&#30340;&#20542;&#21521;&#26469;&#25551;&#36848;&#36825;&#31181;&#24577;&#24230;&#65292;&#24182;&#19988;&#25104;&#21151;&#22320;&#23558;&#39118;&#38505;&#21388;&#24694;&#19982;&#19981;&#21516;&#20445;&#38505;&#20542;&#21521;&#32852;&#31995;&#36215;&#26469;&#65292;&#20026;&#27604;&#36739;&#39118;&#38505;&#21388;&#24694;&#25552;&#20379;&#20102;&#19968;&#31181;&#26032;&#30340;&#35299;&#37322;&#12290;</title><link>http://arxiv.org/abs/2310.09173</link><description>&lt;p&gt;
&#39118;&#38505;&#21388;&#24694;&#21644;&#20445;&#38505;&#20542;&#21521;
&lt;/p&gt;
&lt;p&gt;
Risk Aversion and Insurance Propensity. (arXiv:2310.09173v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.09173
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#25552;&#20379;&#20102;&#19968;&#20010;&#26032;&#30340;&#39118;&#38505;&#21388;&#24694;&#22522;&#30784;&#65292;&#36890;&#36807;&#23637;&#31034;&#20805;&#20998;&#21033;&#29992;&#20445;&#38505;&#26426;&#20250;&#30340;&#20542;&#21521;&#26469;&#25551;&#36848;&#36825;&#31181;&#24577;&#24230;&#65292;&#24182;&#19988;&#25104;&#21151;&#22320;&#23558;&#39118;&#38505;&#21388;&#24694;&#19982;&#19981;&#21516;&#20445;&#38505;&#20542;&#21521;&#32852;&#31995;&#36215;&#26469;&#65292;&#20026;&#27604;&#36739;&#39118;&#38505;&#21388;&#24694;&#25552;&#20379;&#20102;&#19968;&#31181;&#26032;&#30340;&#35299;&#37322;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#36890;&#36807;&#23637;&#31034;&#20805;&#20998;&#21033;&#29992;&#20445;&#38505;&#26426;&#20250;&#30340;&#20542;&#21521;&#26469;&#25552;&#20379;&#19968;&#20010;&#26032;&#30340;&#39118;&#38505;&#21388;&#24694;&#22522;&#30784;&#65292;&#36825;&#20010;&#22522;&#30784;&#36866;&#29992;&#20110;&#20219;&#20309;&#27010;&#29575;&#30340;&#22797;&#26434;&#20559;&#22909;&#65292;&#19982;Arrow (1963)&#21644;Pratt (1964)&#30340;&#32463;&#20856;&#20316;&#21697;&#25152;&#25552;&#20379;&#30340;&#39118;&#38505;&#21388;&#24694;&#30340;&#35880;&#24910;&#35299;&#37322;&#30456;&#19968;&#33268;&#12290;&#22312;&#25105;&#20204;&#30340;&#20027;&#35201;&#32467;&#26524;&#20013;&#65292;&#25105;&#20204;&#39318;&#20808;&#20197;&#20805;&#20998;&#20445;&#38505;&#30340;&#20542;&#21521;&#34920;&#24449;&#20102;Arrow-Pratt&#30340;&#39118;&#38505;&#21388;&#24694;&#65292;&#20197;&#37096;&#20998;&#20445;&#38505;&#30340;&#20542;&#21521;&#34920;&#29616;&#20986;&#20102;Rothschild&#21644;Stiglitz(1970)&#30340;&#26356;&#24378;&#39118;&#38505;&#21388;&#24694;&#12290;&#28982;&#21518;&#25105;&#20204;&#23558;&#35813;&#20998;&#26512;&#25193;&#23637;&#21040;&#27604;&#36739;&#39118;&#38505;&#21388;&#24694;&#65292;&#36890;&#36807;&#23637;&#31034;Yaari(1969)&#30340;&#27010;&#24565;&#23545;&#24212;&#20110;&#23545;&#20805;&#20998;&#20445;&#38505;&#30340;&#27604;&#36739;&#20542;&#21521;&#65292;&#32780;Ross(1981)&#30340;&#26356;&#24378;&#27010;&#24565;&#23545;&#24212;&#20110;&#23545;&#37096;&#20998;&#20445;&#38505;&#30340;&#27604;&#36739;&#20542;&#21521;&#12290;
&lt;/p&gt;
&lt;p&gt;
We provide a new foundation of risk aversion by showing that the propension to exploit insurance opportunities fully describes this attitude. Our foundation, which applies to any probabilistically sophisticated preference, well accords with the commonly held prudential interpretation of risk aversion that dates back to the seminal works of Arrow (1963) and Pratt (1964).  In our main results, we first characterize the Arrow-Pratt risk aversion in terms of propension to full insurance and the stronger notion of risk aversion of Rothschild and Stiglitz (1970) in terms of propension to partial insurance. We then extend the analysis to comparative risk aversion by showing that the notion of Yaari (1969) corresponds to comparative propension to full insurance, while the stronger notion of Ross (1981) corresponds to comparative propension to partial insurance.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#24320;&#21457;&#20102;&#31532;&#19968;&#20010;&#25972;&#21512;&#20102;&#26426;&#22120;&#23398;&#20064;&#39044;&#27979;&#30340;&#26032;&#38395;&#32463;&#38144;&#21830;&#27169;&#22411;&#65292;&#21033;&#29992;&#39044;&#27979;&#26469;&#20248;&#21270;&#24211;&#23384;&#27700;&#24179;&#20197;&#36991;&#20813;&#19979;&#38480;&#21644;&#25552;&#39640;&#24615;&#33021;&#12290;</title><link>http://arxiv.org/abs/2305.07993</link><description>&lt;p&gt;
&#24102;&#26377;&#24314;&#35758;&#30340;&#26032;&#38395;&#32463;&#38144;&#21830;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
The Newsvendor with Advice. (arXiv:2305.07993v1 [math.OC])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.07993
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#24320;&#21457;&#20102;&#31532;&#19968;&#20010;&#25972;&#21512;&#20102;&#26426;&#22120;&#23398;&#20064;&#39044;&#27979;&#30340;&#26032;&#38395;&#32463;&#38144;&#21830;&#27169;&#22411;&#65292;&#21033;&#29992;&#39044;&#27979;&#26469;&#20248;&#21270;&#24211;&#23384;&#27700;&#24179;&#20197;&#36991;&#20813;&#19979;&#38480;&#21644;&#25552;&#39640;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26631;&#20934;&#30340;&#26032;&#38395;&#32463;&#38144;&#21830;&#27169;&#22411;&#20551;&#35774;&#38656;&#27714;&#26159;&#38543;&#26426;&#30340;&#65292;&#21516;&#26102;&#23545;&#20110;&#36229;&#39069;&#25110;&#19981;&#36275;&#30340;&#25104;&#26412;&#36827;&#34892;&#25104;&#26412;&#20998;&#26512;&#12290;&#20248;&#21270;&#23384;&#36135;&#27700;&#24179;&#21487;&#20197;&#21033;&#29992;&#33879;&#21517;&#30340;&#20851;&#38190;&#20998;&#20301;&#20844;&#24335;&#26469;&#30830;&#23450;&#12290;&#34429;&#28982;&#27169;&#22411;&#24050;&#32463;&#22312;&#35768;&#22810;&#24212;&#29992;&#31243;&#24207;&#20013;&#34987;&#21033;&#29992;&#65292;&#20294;&#22312;&#23454;&#36341;&#20013;&#65292;&#36890;&#24120;&#20102;&#35299;&#38382;&#39064;&#30340;&#26356;&#22810;&#29305;&#24449;&#21644;&#29305;&#28857;&#12290;&#21033;&#29992;&#36825;&#20123;&#29305;&#24449;&#65292;&#36890;&#24120;&#20250;&#20351;&#29992;&#26426;&#22120;&#23398;&#20064;&#26469;&#39044;&#27979;&#24211;&#23384;&#27700;&#24179;&#65292;&#32780;&#19981;&#26159;&#32463;&#20856;&#30340;&#26032;&#38395;&#32463;&#38144;&#21830;&#26041;&#27861;&#12290;&#19968;&#31995;&#21015;&#26032;&#20852;&#30340;&#30740;&#31350;&#24050;&#32463;&#23637;&#31034;&#20102;&#22914;&#20309;&#23558;&#26426;&#22120;&#23398;&#20064;&#39044;&#27979;&#32435;&#20837;&#27169;&#22411;&#20013;&#65292;&#20197;&#35268;&#36991;&#19979;&#38480;&#24182;&#25552;&#39640;&#24615;&#33021;&#12290;&#26412;&#25991;&#24320;&#21457;&#20102;&#31532;&#19968;&#20010;&#25972;&#21512;&#20102;&#26426;&#22120;&#23398;&#20064;&#39044;&#27979;&#30340;&#26032;&#38395;&#32463;&#38144;&#21830;&#27169;&#22411;&#12290;&#26412;&#25991;&#32771;&#34385;&#20102;&#19968;&#20010;&#37325;&#22797;&#30340;&#26032;&#38395;&#32463;&#38144;&#21830;&#35774;&#32622;&#65292;&#24182;&#20855;&#26377;&#38750;&#38745;&#27490;&#38656;&#27714;&#12290;&#27599;&#20010;&#21608;&#26399;&#37117;&#26377;&#19968;&#20010;&#39044;&#27979;&#38656;&#27714;&#65292;&#24182;&#19988;&#27491;&#22914;&#22312;&#26426;&#22120;&#23398;&#20064;&#20013;&#30340;&#24773;&#20917;&#65292;&#39044;&#27979;&#21487;&#33021;&#26159;&#26377;&#22122;&#22768;&#30340;&#12290;&#30446;&#26631;&#26159;&#20351;&#24211;&#23384;&#31649;&#29702;&#31639;&#27861;&#21033;&#29992;&#36825;&#20123;&#39044;&#27979;&#26469;&#20248;&#21270;&#24211;&#23384;&#27700;&#24179;&#12290;
&lt;/p&gt;
&lt;p&gt;
The standard newsvendor model assumes a stochastic demand distribution as well as costs for overages and underages. The celebrated critical fractile formula can be used to determine the optimal inventory levels. While the model has been leveraged in numerous applications, often in practice more characteristics and features of the problem are known. Using these features, it is common to employ machine learning to predict inventory levels over the classic newsvendor approach.  An emerging line of work has shown how to use incorporate machine learned predictions into models to circumvent lower bounds and give improved performance. This paper develops the first newsvendor model that incorporates machine learned predictions. The paper considers a repeated newsvendor setting with nonstationary demand. There is a prediction is for each period's demand and, as is the case in machine learning, the prediction can be noisy. The goal is for an inventory management algorithm to take advantage of th
&lt;/p&gt;</description></item></channel></rss>