<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#22522;&#20110;Stackelberg Mean Field Game&#30340;&#26041;&#27861;&#65292;&#21487;&#20197;&#26377;&#25928;&#22320;&#23398;&#20064;&#23439;&#35266;&#32463;&#27982;&#25919;&#31574;&#65292;&#24182;&#22312;&#27169;&#22411;&#39044;&#35757;&#32451;&#21644;&#26080;&#27169;&#22411;Stackelberg&#22343;&#22330;&#24378;&#21270;&#23398;&#20064;&#31639;&#27861;&#30340;&#22522;&#30784;&#19978;&#21462;&#24471;&#20102;&#23454;&#39564;&#32467;&#26524;&#34920;&#26126;&#20854;&#20248;&#36234;&#24615;&#12290;</title><link>https://arxiv.org/abs/2403.12093</link><description>&lt;p&gt;
&#22522;&#20110;&#24494;&#35266;&#22522;&#30784;&#30340;&#23439;&#35266;&#32463;&#27982;&#25919;&#31574;&#23398;&#20064;&#65306;&#19968;&#31181;&#26031;&#22612;&#20811;&#23572;&#36125;&#26684;&#22343;&#22330;&#21338;&#24328;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Learning Macroeconomic Policies based on Microfoundations: A Stackelberg Mean Field Game Approach
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.12093
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#22522;&#20110;Stackelberg Mean Field Game&#30340;&#26041;&#27861;&#65292;&#21487;&#20197;&#26377;&#25928;&#22320;&#23398;&#20064;&#23439;&#35266;&#32463;&#27982;&#25919;&#31574;&#65292;&#24182;&#22312;&#27169;&#22411;&#39044;&#35757;&#32451;&#21644;&#26080;&#27169;&#22411;Stackelberg&#22343;&#22330;&#24378;&#21270;&#23398;&#20064;&#31639;&#27861;&#30340;&#22522;&#30784;&#19978;&#21462;&#24471;&#20102;&#23454;&#39564;&#32467;&#26524;&#34920;&#26126;&#20854;&#20248;&#36234;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26377;&#25928;&#30340;&#23439;&#35266;&#32463;&#27982;&#25919;&#31574;&#22312;&#20419;&#36827;&#32463;&#27982;&#22686;&#38271;&#21644;&#31038;&#20250;&#31283;&#23450;&#26041;&#38754;&#36215;&#30528;&#33267;&#20851;&#37325;&#35201;&#30340;&#20316;&#29992;&#12290;&#26412;&#25991;&#22522;&#20110;Stackelberg Mean Field Game&#65288;SMFG&#65289;&#27169;&#22411;&#65292;&#23558;&#26368;&#20248;&#23439;&#35266;&#32463;&#27982;&#25919;&#31574;&#38382;&#39064;&#24314;&#27169;&#65292;&#20854;&#20013;&#25919;&#24220;&#20316;&#20026;&#25919;&#31574;&#21046;&#23450;&#30340;&#39046;&#23548;&#32773;&#65292;&#22823;&#35268;&#27169;&#23478;&#24237;&#21160;&#24577;&#21709;&#24212;&#20026;&#36861;&#38543;&#32773;&#12290;&#36825;&#31181;&#24314;&#27169;&#26041;&#27861;&#25429;&#25417;&#20102;&#25919;&#24220;&#21644;&#22823;&#35268;&#27169;&#23478;&#24237;&#20043;&#38388;&#30340;&#38750;&#23545;&#31216;&#21160;&#24577;&#21338;&#24328;&#65292;&#24182;&#21487;&#20197;&#35299;&#37322;&#22320;&#35780;&#20272;&#22522;&#20110;&#24494;&#35266;&#22522;&#30784;&#30340;&#23439;&#35266;&#32463;&#27982;&#25919;&#31574;&#25928;&#26524;&#65292;&#36825;&#26159;&#29616;&#26377;&#26041;&#27861;&#38590;&#20197;&#23454;&#29616;&#30340;&#12290;&#25105;&#20204;&#36824;&#25552;&#20986;&#20102;&#19968;&#31181;&#35299;&#20915;SMFG&#30340;&#26041;&#27861;&#65292;&#23558;&#30495;&#23454;&#25968;&#25454;&#36827;&#34892;&#39044;&#35757;&#32451;&#65292;&#24182;&#32467;&#21512;&#19968;&#31181;&#26080;&#27169;&#22411;&#30340;Stackelberg&#22343;&#22330;&#24378;&#21270;&#23398;&#20064;&#65288;SMFRL&#65289;&#31639;&#27861;&#65292;&#35813;&#31639;&#27861;&#21487;&#20197;&#29420;&#31435;&#20110;&#20808;&#21069;&#30340;&#29615;&#22659;&#30693;&#35782;&#21644;&#36716;&#21464;&#36816;&#34892;&#12290;&#25105;&#20204;&#30340;&#23454;&#39564;&#32467;&#26524;&#23637;&#31034;&#20102;SMFG&#26041;&#27861;&#22312;&#32463;&#27982;&#25919;&#31574;&#26041;&#38754;&#20248;&#20110;&#20854;&#20182;&#26041;&#27861;&#30340;&#20248;&#36234;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.12093v1 Announce Type: cross  Abstract: Effective macroeconomic policies play a crucial role in promoting economic growth and social stability. This paper models the optimal macroeconomic policy problem based on the \textit{Stackelberg Mean Field Game} (SMFG), where the government acts as the leader in policy-making, and large-scale households dynamically respond as followers. This modeling method captures the asymmetric dynamic game between the government and large-scale households, and interpretably evaluates the effects of macroeconomic policies based on microfoundations, which is difficult for existing methods to achieve. We also propose a solution for SMFGs, incorporating pre-training on real data and a model-free \textit{Stackelberg mean-field reinforcement learning }(SMFRL) algorithm, which operates independently of prior environmental knowledge and transitions. Our experimental results showcase the superiority of the SMFG method over other economic policies in terms 
&lt;/p&gt;</description></item><item><title>&#25552;&#20986;&#20102;&#19968;&#31181;&#31616;&#21333;&#30340;&#36845;&#20195;&#31243;&#24207;&#26469;&#20272;&#35745;&#20855;&#26377;&#36830;&#32493;&#20869;&#29983;&#21464;&#37327;&#21644;&#31163;&#25955;&#24037;&#20855;&#30340;&#38750;&#21442;&#25968;&#22238;&#24402;&#27169;&#22411;&#65292;&#24182;&#23637;&#31034;&#20102;&#19968;&#20123;&#28176;&#36817;&#24615;&#36136;&#12290;</title><link>https://arxiv.org/abs/1905.07812</link><description>&lt;p&gt;
&#36830;&#32493;&#20869;&#29983;&#21464;&#37327;&#21644;&#31163;&#25955;&#24037;&#20855;&#30340;&#38750;&#21442;&#25968;&#22238;&#24402;&#30340;&#36845;&#20195;&#20272;&#35745;
&lt;/p&gt;
&lt;p&gt;
Iterative Estimation of Nonparametric Regressions with Continuous Endogenous Variables and Discrete Instruments
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/1905.07812
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#31616;&#21333;&#30340;&#36845;&#20195;&#31243;&#24207;&#26469;&#20272;&#35745;&#20855;&#26377;&#36830;&#32493;&#20869;&#29983;&#21464;&#37327;&#21644;&#31163;&#25955;&#24037;&#20855;&#30340;&#38750;&#21442;&#25968;&#22238;&#24402;&#27169;&#22411;&#65292;&#24182;&#23637;&#31034;&#20102;&#19968;&#20123;&#28176;&#36817;&#24615;&#36136;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#32771;&#34385;&#20102;&#19968;&#20010;&#20855;&#26377;&#36830;&#32493;&#20869;&#29983;&#29420;&#31435;&#21464;&#37327;&#30340;&#38750;&#21442;&#25968;&#22238;&#24402;&#27169;&#22411;&#65292;&#24403;&#21482;&#26377;&#19982;&#35823;&#24046;&#39033;&#29420;&#31435;&#30340;&#31163;&#25955;&#24037;&#20855;&#21487;&#29992;&#26102;&#12290;&#34429;&#28982;&#36825;&#20010;&#26694;&#26550;&#22312;&#24212;&#29992;&#30740;&#31350;&#20013;&#38750;&#24120;&#30456;&#20851;&#65292;&#20294;&#20854;&#23454;&#29616;&#24456;&#40635;&#28902;&#65292;&#22240;&#20026;&#22238;&#24402;&#20989;&#25968;&#25104;&#20026;&#20102;&#38750;&#32447;&#24615;&#31215;&#20998;&#26041;&#31243;&#30340;&#35299;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#31616;&#21333;&#30340;&#36845;&#20195;&#36807;&#31243;&#26469;&#20272;&#35745;&#36825;&#26679;&#30340;&#27169;&#22411;&#65292;&#24182;&#23637;&#31034;&#20102;&#19968;&#20123;&#20854;&#28176;&#36817;&#24615;&#36136;&#12290;&#22312;&#19968;&#20010;&#27169;&#25311;&#23454;&#39564;&#20013;&#65292;&#25105;&#20204;&#35752;&#35770;&#20102;&#22312;&#24037;&#20855;&#21464;&#37327;&#20026;&#20108;&#36827;&#21046;&#26102;&#20854;&#23454;&#29616;&#32454;&#33410;&#12290;&#25105;&#20204;&#24635;&#32467;&#20102;&#19968;&#20010;&#23454;&#35777;&#24212;&#29992;&#65292;&#20854;&#20013;&#25105;&#20204;&#30740;&#31350;&#20102;&#32654;&#22269;&#20960;&#20010;&#21439;&#30340;&#25151;&#20215;&#23545;&#27745;&#26579;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:1905.07812v2 Announce Type: replace  Abstract: We consider a nonparametric regression model with continuous endogenous independent variables when only discrete instruments are available that are independent of the error term. While this framework is very relevant for applied research, its implementation is cumbersome, as the regression function becomes the solution to a nonlinear integral equation. We propose a simple iterative procedure to estimate such models and showcase some of its asymptotic properties. In a simulation experiment, we discuss the details of its implementation in the case when the instrumental variable is binary. We conclude with an empirical application in which we examine the effect of pollution on house prices in a short panel of U.S. counties.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#36890;&#36807;&#27719;&#29575;&#21464;&#21160;&#26469;&#35782;&#21035;&#26381;&#21153;&#36152;&#26131;&#30340;&#24377;&#24615;&#65292;&#35299;&#20915;&#20102;&#22240;&#20869;&#29983;&#24615;&#38382;&#39064;&#32780;&#26080;&#27861;&#25214;&#21040;&#24037;&#20855;&#21464;&#37327;&#30340;&#22256;&#22659;&#12290;&#36890;&#36807;&#24212;&#29992;&#20110;&#22810;&#31181;&#19981;&#21516;&#30340;&#26377;&#24418;&#21830;&#21697;&#65292;&#35780;&#20272;&#20102;&#35813;&#26041;&#27861;&#30340;&#24615;&#33021;&#12290;</title><link>http://arxiv.org/abs/2401.08594</link><description>&lt;p&gt;
&#22914;&#20309;&#27979;&#37327;&#26381;&#21153;&#36152;&#26131;&#24377;&#24615;&#65311;
&lt;/p&gt;
&lt;p&gt;
How do we measure trade elasticity for services?. (arXiv:2401.08594v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.08594
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#36890;&#36807;&#27719;&#29575;&#21464;&#21160;&#26469;&#35782;&#21035;&#26381;&#21153;&#36152;&#26131;&#30340;&#24377;&#24615;&#65292;&#35299;&#20915;&#20102;&#22240;&#20869;&#29983;&#24615;&#38382;&#39064;&#32780;&#26080;&#27861;&#25214;&#21040;&#24037;&#20855;&#21464;&#37327;&#30340;&#22256;&#22659;&#12290;&#36890;&#36807;&#24212;&#29992;&#20110;&#22810;&#31181;&#19981;&#21516;&#30340;&#26377;&#24418;&#21830;&#21697;&#65292;&#35780;&#20272;&#20102;&#35813;&#26041;&#27861;&#30340;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#35797;&#22270;&#36890;&#36807;&#27719;&#29575;&#21464;&#21160;&#26469;&#35782;&#21035;&#20986;&#36152;&#26131;&#24377;&#24615;&#65292;&#20197;&#24212;&#29992;&#20110;&#26381;&#21153;&#36152;&#26131;&#30340;&#24773;&#20917;&#65292;&#20854;&#20013;&#23454;&#38469;&#20132;&#26131;&#32479;&#35745;&#25968;&#25454;&#20013;&#30340;&#29289;&#29702;&#20132;&#26131;&#34987;&#25513;&#30422;&#12290;&#22238;&#24402;&#20998;&#26512;&#29992;&#20110;&#20272;&#35745;&#24377;&#24615;&#65292;&#28041;&#21450;&#21040;&#35299;&#37322;&#21464;&#37327;&#36890;&#36807;&#28508;&#22312;&#30340;&#20379;&#24212;&#26041;&#31243;&#27844;&#38706;&#21040;&#35823;&#24046;&#39033;&#20013;&#65292;&#23548;&#33268;&#20102;&#20869;&#29983;&#24615;&#38382;&#39064;&#65292;&#26080;&#27861;&#25214;&#21040;&#24037;&#20855;&#21464;&#37327;&#12290;&#25105;&#20204;&#30340;&#35782;&#21035;&#31574;&#30053;&#26159;&#21033;&#29992;&#24402;&#19968;&#21270;&#26465;&#20214;&#65292;&#20351;&#24471;&#20379;&#24212;&#21442;&#25968;&#33021;&#22815;&#34987;&#35782;&#21035;&#65292;&#20197;&#21450;&#38656;&#27714;&#21644;&#20379;&#24212;&#26041;&#31243;&#31995;&#32479;&#30340;&#32422;&#21270;&#24418;&#24335;&#26041;&#31243;&#12290;&#36890;&#36807;&#24212;&#29992;&#20110;&#20960;&#31181;&#19981;&#21516;&#30340;&#26377;&#24418;&#21830;&#21697;&#65292;&#25105;&#20204;&#35780;&#20272;&#20102;&#25152;&#25552;&#20986;&#30340;&#26041;&#27861;&#30340;&#24615;&#33021;&#65292;&#36825;&#20123;&#21830;&#21697;&#30340;&#22522;&#20934;&#36152;&#26131;&#24377;&#24615;&#21487;&#20197;&#36890;&#36807;&#21033;&#29992;&#20854;&#29289;&#29702;&#20132;&#26131;&#20449;&#24687;&#36827;&#34892;&#20272;&#35745;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper is about our attempt of identifying trade elasticities through the variations in the exchange rate, for possible applications to the case of services whose physical transactions are veiled in the trade statistics. The regression analysis to estimate the elasticity entails a situation where the explanatory variable is leaked into the error term through the latent supply equation, causing an endogeneity problem for which an instrumental variable cannot be found. Our identification strategy is to utilize the normalizing condition, which enables the supply parameter to be identified, along with the reduced-form equation of the system of demand and supply equations. We evaluate the performances of the method proposed by applying to several different tangible goods, whose benchmark trade elasticities are estimable by utilizing the information on their physical transactions.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#20010;&#20855;&#26377;&#22810;&#20010;&#20248;&#20808;&#32423;&#30340;&#23398;&#26657;&#36873;&#25321;&#27169;&#22411;&#65292;&#24341;&#20837;&#20102;&#19968;&#31181;&#21517;&#20026;M-fairness&#30340;&#20844;&#24179;&#24615;&#27010;&#24565;&#65292;&#24182;&#20171;&#32461;&#20102;&#19968;&#31181;&#21033;&#29992;&#25928;&#29575;&#35843;&#25972;&#24310;&#36831;&#25509;&#21463;&#31639;&#27861;&#30340;&#26426;&#21046;&#65292;&#35813;&#26426;&#21046;&#26159;&#23398;&#29983;&#26368;&#20248;M&#31283;&#23450;&#30340;&#65292;&#25913;&#36827;&#32676;&#20307;&#26368;&#20248;M&#31283;&#23450;&#30340;&#65292;&#24182;&#19988;&#23545;&#25913;&#36827;&#26159;&#26377;&#21709;&#24212;&#30340;&#12290;</title><link>http://arxiv.org/abs/2308.04780</link><description>&lt;p&gt;
&#20855;&#26377;&#22810;&#20010;&#20248;&#20808;&#32423;&#30340;&#23398;&#26657;&#36873;&#25321;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
School Choice with Multiple Priorities. (arXiv:2308.04780v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.04780
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#20010;&#20855;&#26377;&#22810;&#20010;&#20248;&#20808;&#32423;&#30340;&#23398;&#26657;&#36873;&#25321;&#27169;&#22411;&#65292;&#24341;&#20837;&#20102;&#19968;&#31181;&#21517;&#20026;M-fairness&#30340;&#20844;&#24179;&#24615;&#27010;&#24565;&#65292;&#24182;&#20171;&#32461;&#20102;&#19968;&#31181;&#21033;&#29992;&#25928;&#29575;&#35843;&#25972;&#24310;&#36831;&#25509;&#21463;&#31639;&#27861;&#30340;&#26426;&#21046;&#65292;&#35813;&#26426;&#21046;&#26159;&#23398;&#29983;&#26368;&#20248;M&#31283;&#23450;&#30340;&#65292;&#25913;&#36827;&#32676;&#20307;&#26368;&#20248;M&#31283;&#23450;&#30340;&#65292;&#24182;&#19988;&#23545;&#25913;&#36827;&#26159;&#26377;&#21709;&#24212;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#32771;&#34385;&#20102;&#19968;&#31181;&#27169;&#22411;&#65292;&#22312;&#36825;&#31181;&#27169;&#22411;&#20013;&#65292;&#23398;&#26657;&#21487;&#33021;&#23545;&#23398;&#29983;&#26377;&#22810;&#20010;&#20248;&#20808;&#32423;&#39034;&#24207;&#65292;&#36825;&#20123;&#39034;&#24207;&#21487;&#33021;&#30456;&#20114;&#30683;&#30462;&#12290;&#20363;&#22914;&#65292;&#22312;&#23398;&#26657;&#36873;&#25321;&#31995;&#32479;&#20013;&#65292;&#30001;&#20110;&#20804;&#24351;&#22992;&#22969;&#20248;&#20808;&#32423;&#21644;&#27493;&#34892;&#21306;&#22495;&#20248;&#20808;&#32423;&#24182;&#23384;&#65292;&#22522;&#20110;&#23427;&#20204;&#30340;&#20248;&#20808;&#32423;&#39034;&#24207;&#21487;&#33021;&#23384;&#22312;&#20914;&#31361;&#12290;&#22312;&#36825;&#31181;&#24773;&#20917;&#19979;&#65292;&#21487;&#33021;&#25214;&#19981;&#21040;&#28385;&#36275;&#25152;&#26377;&#20248;&#20808;&#32423;&#39034;&#24207;&#30340;&#21305;&#37197;&#12290;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#31181;&#21517;&#20026;M-fairness&#30340;&#26032;&#39062;&#20844;&#24179;&#24615;&#27010;&#24565;&#26469;&#30740;&#31350;&#36825;&#26679;&#30340;&#24066;&#22330;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#37325;&#28857;&#30740;&#31350;&#20102;&#19968;&#31181;&#26356;&#20855;&#20307;&#30340;&#24773;&#20917;&#65292;&#21363;&#25152;&#26377;&#23398;&#26657;&#37117;&#26377;&#20004;&#20010;&#20248;&#20808;&#32423;&#39034;&#24207;&#65292;&#24182;&#19988;&#23545;&#20110;&#26576;&#20010;&#23398;&#29983;&#32676;&#20307;&#65292;&#27599;&#25152;&#23398;&#26657;&#30340;&#19968;&#20010;&#20248;&#20808;&#32423;&#39034;&#24207;&#26159;&#21478;&#19968;&#20248;&#20808;&#32423;&#39034;&#24207;&#30340;&#25913;&#36827;&#12290;&#19968;&#20010;&#35828;&#26126;&#24615;&#20363;&#23376;&#26159;&#20855;&#26377;&#22522;&#20110;&#20248;&#20808;&#32423;&#30340;&#31215;&#26497;&#34892;&#21160;&#25919;&#31574;&#30340;&#23398;&#26657;&#36873;&#25321;&#21305;&#37197;&#24066;&#22330;&#12290;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#31181;&#21033;&#29992;&#25928;&#29575;&#35843;&#25972;&#24310;&#36831;&#25509;&#21463;&#31639;&#27861;&#30340;&#26426;&#21046;&#65292;&#24182;&#35777;&#26126;&#35813;&#26426;&#21046;&#26159;&#23398;&#29983;&#26368;&#20248;M&#31283;&#23450;&#30340;&#65292;&#25913;&#36827;&#32676;&#20307;&#26368;&#20248;M&#31283;&#23450;&#30340;&#65292;&#24182;&#19988;&#23545;&#25913;&#36827;&#26159;&#26377;&#21709;&#24212;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
This study considers a model where schools may have multiple priority orders on students, which may be inconsistent with each other. For example, in school choice systems, since the sibling priority and the walk zone priority coexist, the priority orders based on them would be conflicting. In that case, there may be no matching that respect to all priority orders. We introduce a novel fairness notion called M-fairness to examine such markets. Further, we focus on a more specific situation where all schools have two priority orders, and for a certain group of students, a priority order of each school is an improvement of the other priority order of the school. An illustrative example is the school choice matching market with a priority-based affirmative action policy. We introduce a mechanism that utilizes the efficiency adjusted deferred acceptance algorithm and show that the mechanism is student optimally M-stable, improved-group optimally M-stable and responsive to improvements.
&lt;/p&gt;</description></item><item><title>&#24378;&#22823;&#30340;&#26368;&#22823;&#29615;&#31639;&#27861;&#25552;&#20986;&#20102;&#19968;&#31181;&#38598;&#25104;&#20559;&#22909;&#25490;&#24207;&#30340;&#26032;&#26041;&#27861;&#65292;&#36890;&#36807;&#21024;&#38500;&#25237;&#31080;&#22270;&#20013;&#30340;&#26368;&#22823;&#29615;&#36335;&#65292;&#24471;&#20986;&#19982;&#25237;&#31080;&#32467;&#26524;&#19968;&#33268;&#30340;&#21807;&#19968;&#25490;&#24207;&#32467;&#26524;&#12290;</title><link>http://arxiv.org/abs/2307.15702</link><description>&lt;p&gt;
&#24378;&#22823;&#30340;&#26368;&#22823;&#29615;&#31639;&#27861;&#65306;&#19968;&#31181;&#38598;&#25104;&#20559;&#22909;&#25490;&#24207;&#30340;&#26032;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
The Strong Maximum Circulation Algorithm: A New Method for Aggregating Preference Rankings. (arXiv:2307.15702v1 [cs.SI])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.15702
&lt;/p&gt;
&lt;p&gt;
&#24378;&#22823;&#30340;&#26368;&#22823;&#29615;&#31639;&#27861;&#25552;&#20986;&#20102;&#19968;&#31181;&#38598;&#25104;&#20559;&#22909;&#25490;&#24207;&#30340;&#26032;&#26041;&#27861;&#65292;&#36890;&#36807;&#21024;&#38500;&#25237;&#31080;&#22270;&#20013;&#30340;&#26368;&#22823;&#29615;&#36335;&#65292;&#24471;&#20986;&#19982;&#25237;&#31080;&#32467;&#26524;&#19968;&#33268;&#30340;&#21807;&#19968;&#25490;&#24207;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#20248;&#21270;&#30340;&#26041;&#27861;&#65292;&#29992;&#20110;&#22312;&#27599;&#20010;&#20915;&#31574;&#32773;&#25110;&#36873;&#27665;&#23545;&#19968;&#23545;&#36873;&#25321;&#36827;&#34892;&#20559;&#22909;&#34920;&#36798;&#30340;&#24773;&#20917;&#19979;&#38598;&#25104;&#20559;&#22909;&#12290;&#25361;&#25112;&#22312;&#20110;&#22312;&#19968;&#20123;&#20914;&#31361;&#30340;&#25237;&#31080;&#24773;&#20917;&#19979;&#65292;&#23613;&#21487;&#33021;&#19982;&#25237;&#31080;&#32467;&#26524;&#19968;&#33268;&#22320;&#24471;&#20986;&#19968;&#20010;&#25490;&#24207;&#12290;&#21482;&#26377;&#19981;&#21253;&#21547;&#29615;&#36335;&#30340;&#25237;&#31080;&#38598;&#21512;&#25165;&#26159;&#38750;&#20914;&#31361;&#30340;&#65292;&#24182;&#19988;&#21487;&#20197;&#22312;&#36873;&#25321;&#20043;&#38388;&#24341;&#21457;&#19968;&#20010;&#37096;&#20998;&#39034;&#24207;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#26159;&#22522;&#20110;&#36825;&#26679;&#19968;&#20010;&#35266;&#23519;&#65306;&#26500;&#25104;&#19968;&#20010;&#29615;&#36335;&#30340;&#25237;&#31080;&#38598;&#21512;&#21487;&#20197;&#34987;&#35270;&#20026;&#24179;&#23616;&#12290;&#28982;&#21518;&#65292;&#26041;&#27861;&#26159;&#20174;&#25237;&#31080;&#22270;&#20013;&#21024;&#38500;&#29615;&#36335;&#30340;&#24182;&#38598;&#65292;&#24182;&#26681;&#25454;&#21097;&#20313;&#37096;&#20998;&#30830;&#23450;&#38598;&#25104;&#20559;&#22909;&#12290;&#25105;&#20204;&#24341;&#20837;&#20102;&#24378;&#22823;&#30340;&#26368;&#22823;&#29615;&#36335;&#65292;&#23427;&#30001;&#19968;&#32452;&#29615;&#36335;&#30340;&#24182;&#38598;&#24418;&#25104;&#65292;&#21024;&#38500;&#23427;&#21487;&#20197;&#20445;&#35777;&#22312;&#24341;&#21457;&#30340;&#37096;&#20998;&#39034;&#24207;&#20013;&#33719;&#24471;&#21807;&#19968;&#32467;&#26524;&#12290;&#27492;&#22806;&#65292;&#23427;&#36824;&#21253;&#21547;&#22312;&#28040;&#38500;&#20219;&#20309;&#26368;&#22823;&#29615;&#36335;&#21518;&#21097;&#19979;&#30340;&#25152;&#26377;&#38598;&#25104;&#20559;&#22909;&#12290;&#19982;&#20043;&#30456;&#21453;&#30340;&#26159;&#65292;wel
&lt;/p&gt;
&lt;p&gt;
We present a new optimization-based method for aggregating preferences in settings where each decision maker, or voter, expresses preferences over pairs of alternatives. The challenge is to come up with a ranking that agrees as much as possible with the votes cast in cases when some of the votes conflict. Only a collection of votes that contains no cycles is non-conflicting and can induce a partial order over alternatives. Our approach is motivated by the observation that a collection of votes that form a cycle can be treated as ties. The method is then to remove unions of cycles of votes, or circulations, from the vote graph and determine aggregate preferences from the remainder.  We introduce the strong maximum circulation which is formed by a union of cycles, the removal of which guarantees a unique outcome in terms of the induced partial order. Furthermore, it contains all the aggregate preferences remaining following the elimination of any maximum circulation. In contrast, the wel
&lt;/p&gt;</description></item><item><title>&#30740;&#31350;&#34920;&#26126;&#65292;&#21363;&#20351;&#39118;&#38505;&#21388;&#24694;&#30340;&#25237;&#36164;&#32773;&#36890;&#24120;&#37319;&#29992;&#30340;&#31574;&#30053;&#26159;&#22810;&#26679;&#21270;&#25237;&#36164;&#32452;&#21512;&#65292;&#20998;&#37197;&#25152;&#26377;&#36164;&#37329;&#21040;&#21333;&#19968;&#30340;&#36164;&#20135;&#25110;&#19990;&#30028;&#29366;&#24577;&#30340;&#26497;&#31471;&#25237;&#36164;&#32452;&#21512;&#20063;&#24456;&#24120;&#35265;&#12290;&#36825;&#31181;&#34892;&#20026;&#19982;&#39118;&#38505;&#21388;&#24694;&#30340;&#20027;&#35266;&#26399;&#26395;&#25928;&#29992;&#26368;&#22823;&#21270;&#30456;&#23481;&#12290;&#24403;&#26377;&#38480;&#20010;&#26497;&#31471;&#36164;&#20135;&#38656;&#27714;&#22312;&#27492;&#31181;&#20449;&#24565;&#19979;&#26159;&#21512;&#29702;&#21270;&#30340;&#26102;&#20505;&#65292;&#23427;&#20204;&#21487;&#20197;&#21516;&#26102;&#36890;&#36807;&#19968;&#20123;&#25928;&#29992;&#25351;&#25968;&#30340;&#26041;&#24335;&#21512;&#29702;&#21270;&#12290;</title><link>http://arxiv.org/abs/2304.08059</link><description>&lt;p&gt;
&#38750;&#22810;&#26679;&#21270;&#25237;&#36164;&#32452;&#21512;&#19982;&#20027;&#35266;&#26399;&#26395;&#25928;&#29992;
&lt;/p&gt;
&lt;p&gt;
Non-diversified portfolios with subjective expected utility. (arXiv:2304.08059v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.08059
&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#34920;&#26126;&#65292;&#21363;&#20351;&#39118;&#38505;&#21388;&#24694;&#30340;&#25237;&#36164;&#32773;&#36890;&#24120;&#37319;&#29992;&#30340;&#31574;&#30053;&#26159;&#22810;&#26679;&#21270;&#25237;&#36164;&#32452;&#21512;&#65292;&#20998;&#37197;&#25152;&#26377;&#36164;&#37329;&#21040;&#21333;&#19968;&#30340;&#36164;&#20135;&#25110;&#19990;&#30028;&#29366;&#24577;&#30340;&#26497;&#31471;&#25237;&#36164;&#32452;&#21512;&#20063;&#24456;&#24120;&#35265;&#12290;&#36825;&#31181;&#34892;&#20026;&#19982;&#39118;&#38505;&#21388;&#24694;&#30340;&#20027;&#35266;&#26399;&#26395;&#25928;&#29992;&#26368;&#22823;&#21270;&#30456;&#23481;&#12290;&#24403;&#26377;&#38480;&#20010;&#26497;&#31471;&#36164;&#20135;&#38656;&#27714;&#22312;&#27492;&#31181;&#20449;&#24565;&#19979;&#26159;&#21512;&#29702;&#21270;&#30340;&#26102;&#20505;&#65292;&#23427;&#20204;&#21487;&#20197;&#21516;&#26102;&#36890;&#36807;&#19968;&#20123;&#25928;&#29992;&#25351;&#25968;&#30340;&#26041;&#24335;&#21512;&#29702;&#21270;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#34429;&#28982;&#25237;&#36164;&#32452;&#21512;&#22810;&#26679;&#21270;&#26159;&#39118;&#38505;&#21388;&#24694;&#30340;&#25237;&#36164;&#32773;&#36890;&#24120;&#37319;&#29992;&#30340;&#31574;&#30053;&#65292;&#20294;&#20026;&#20102;&#21333;&#19968;&#36164;&#20135;/&#19990;&#30028;&#29366;&#24577;&#20998;&#37197;&#25152;&#26377;&#36164;&#37329;&#30340;&#26497;&#31471;&#25237;&#36164;&#32452;&#21512;&#20063;&#24456;&#24120;&#35265;&#12290;&#36825;&#31181;&#36164;&#20135;&#38656;&#27714;&#34892;&#20026;&#19982;&#39118;&#38505;&#21388;&#24694;&#30340;&#20027;&#35266;&#26399;&#26395;&#25928;&#29992;&#26368;&#22823;&#21270;&#30456;&#23481;&#65292;&#20551;&#35774;&#23558;&#27599;&#20010;&#29366;&#24577;&#20998;&#37197;&#19968;&#20010;&#20005;&#26684;&#27491;&#30340;&#27010;&#29575;&#12290;&#25105;&#20204;&#34920;&#26126;&#65292;&#21482;&#35201;&#26377;&#38480;&#20010;&#26497;&#31471;&#36164;&#20135;&#38656;&#27714;&#22312;&#27492;&#31181;&#20449;&#24565;&#19979;&#26159;&#21512;&#29702;&#21270;&#30340;&#65292;&#23427;&#20204;&#23601;&#21487;&#20197;&#21516;&#26102;&#22312;&#21516;&#26679;&#20449;&#24565;&#19979;&#36890;&#36807;&#65306;(i)&#32477;&#23545;&#39118;&#38505;&#21388;&#24694;&#30340;&#24120;&#25968;&#65307;&#36882;&#20943;&#30340;&#32477;&#23545;&#39118;&#38505;&#21388;&#24694;/&#36882;&#22686;&#30340;&#30456;&#23545;&#39118;&#38505;&#21388;&#24694;(DARA/IRRA)&#65307;&#39118;&#38505;&#20013;&#24615;&#65307;&#25152;&#26377;&#36130;&#23500;&#27700;&#24179;&#19979;&#30340;&#36861;&#27714;&#39118;&#38505;&#30340;&#25928;&#29992;&#25351;&#25968;&#65307;(ii)&#20110;&#26576;&#20010;&#20005;&#26684;&#27491;&#30340;&#22266;&#23450;&#21021;&#26399;&#36130;&#23500;&#27700;&#24179;&#19979;&#26126;&#26174;&#19981;&#21516;&#30340;DARA/IRRA&#25928;&#29992;&#25351;&#25968;&#31867;&#65307;&#21644;(iii)&#22312;&#26377;&#30028;&#36130;&#23500;&#19979;&#36882;&#20943;&#30340;&#30456;&#23545;&#39118;&#38505;&#21388;&#24694;&#25928;&#29992;&#25351;&#25968;&#12290;&#25105;&#20204;&#36824;&#34920;&#26126;&#65292;&#22312;&#36825;&#31181;&#24773;&#20917;&#19979;&#65292;&#21487;&#35266;&#23519;&#25968;&#25454;&#20801;&#35768;&#32473;&#20986;&#23574;&#38160;&#30340;&#38480;&#21046;&#12290;
&lt;/p&gt;
&lt;p&gt;
Although portfolio diversification is the typical strategy followed by risk-averse investors, extreme portfolios that allocate all funds to a single asset/state of the world are common too. Such asset-demand behavior is compatible with risk-averse subjective expected utility maximization under beliefs that assign a strictly positive probability to every state. We show that whenever finitely many extreme asset demands are rationalizable in this way under such beliefs, they are simultaneously rationalizable under the same beliefs by: (i) constant absolute risk aversion; decreasing absolute risk aversion/increasing relative risk aversion (DARA/IRRA); risk-neutral; and ris-kseeking utility indices at all wealth levels; (ii) a distinct class of DARA/IRRA utility indices at some strictly positive fixed initial wealth; and (iii) decreasing relative risk aversion utility indices under bounded wealth. We also show that, in such situations, the observable data allow for sharp bounds to be given 
&lt;/p&gt;</description></item><item><title>&#36890;&#36807;Morishima&#30340;&#24418;&#24335;&#20027;&#20041;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#20174;&#39532;&#20811;&#24605;&#30340;&#19981;&#21464;&#21407;&#21017;&#20986;&#21457;&#35299;&#20915;&#36716;&#22411;&#38382;&#39064;&#30340;&#24517;&#35201;&#24615;&#21644;&#20805;&#20998;&#24615;&#12290;</title><link>http://arxiv.org/abs/2303.11471</link><description>&lt;p&gt;
&#29992;&#20110;&#35299;&#20915;&#39532;&#20811;&#24605;&#20215;&#20540;&#27861;&#21017;&#19979;&#30340;&#36716;&#22411;&#38382;&#39064;&#30340;&#19981;&#21464;&#21407;&#29702;&#8212;&#8212;&#20174;&#26862;&#23707;&#27491;&#38596;&#24418;&#24335;&#20027;&#20041;&#20986;&#21457;
&lt;/p&gt;
&lt;p&gt;
Both invariant principles implied by Marx's law of value are necessary and sufficient to solve the transformation problem through Morishima's formalism. (arXiv:2303.11471v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.11471
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;Morishima&#30340;&#24418;&#24335;&#20027;&#20041;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#20174;&#39532;&#20811;&#24605;&#30340;&#19981;&#21464;&#21407;&#21017;&#20986;&#21457;&#35299;&#20915;&#36716;&#22411;&#38382;&#39064;&#30340;&#24517;&#35201;&#24615;&#21644;&#20805;&#20998;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
Michio Morishima&#30340;&#26041;&#27861;&#21487;&#20197;&#27491;&#30830;&#30830;&#23450;&#21830;&#21697;&#30340;&#21333;&#20301;&#20215;&#20540;&#65292;&#21363;&#23427;&#25152;&#21547;&#30340;&#21830;&#21697;&#20215;&#20540;&#65288;&#36755;&#20837;&#65289;&#21644;&#29983;&#20135;&#25152;&#38656;&#30340;&#21171;&#21160;&#37327;&#20043;&#21644;&#12290;&#20294;&#26159;&#65292;&#21482;&#26377;&#24403;&#21830;&#21697;&#28385;&#36275;&#28041;&#21450;&#25972;&#20010;&#32463;&#27982;&#20307;&#31995;&#21508;&#20010;&#20135;&#19994;&#37096;&#38376;&#20043;&#38388;&#20114;&#30456;&#20851;&#32852;&#30340;&#26377;&#20607;&#30340;&#31038;&#20250;&#38656;&#27714;&#26102;&#65292;&#23427;&#20204;&#25165;&#33021;&#20197;&#24066;&#22330;&#29983;&#20135;&#20215;&#26684;&#21806;&#20986;&#12290;&#36825;&#19968;&#26465;&#20214;&#20805;&#20998;&#20307;&#29616;&#20102;&#39532;&#20811;&#24605;&#30340;&#22522;&#26412;&#31561;&#24335;&#65292;&#36825;&#20123;&#31561;&#24335;&#28304;&#20110;&#20215;&#20540;&#27861;&#21017;&#65292;&#24182;&#26500;&#25104;&#36866;&#29992;&#20110;&#25972;&#20010;&#32463;&#27982;&#20307;&#31995;&#30340;&#19981;&#21464;&#37327;&#12290;&#36825;&#20123;&#31561;&#24335;&#26159;&#30830;&#23450;&#24066;&#22330;&#29983;&#20135;&#20215;&#26684;&#24517;&#38656;&#30340;&#12290;&#25105;&#20204;&#35777;&#26126;&#36825;&#20123;&#31561;&#24335;&#36824;&#33021;&#22815;&#29992;&#20110;&#35299;&#20915;&#19968;&#20010;&#27809;&#26377;&#22266;&#23450;&#36164;&#26412;&#30340;&#31616;&#21333;&#20877;&#29983;&#20135;&#31995;&#32479;&#30340;&#36716;&#22411;&#38382;&#39064;&#65292;&#20174;Morishima&#30340;&#24418;&#24335;&#20027;&#20041;&#20986;&#21457;&#24182;&#22238;&#24402;&#21040;&#26356;&#25509;&#36817;&#39532;&#20811;&#24605;&#25152;&#29992;&#24418;&#24335;&#20027;&#20041;&#12290;
&lt;/p&gt;
&lt;p&gt;
The unit value of a commodity that Michio Morishima's method and its variations enable to determine correctly, is the sum of the value of the commodities it contains (inputs) and the quantity of labor required for its production. However, goods are sold at their market production price only when they meet a solvent social need that involves the entire economy with its interconnections between the different industrial sectors. This condition gives full meaning to Marx's fundamental equalities, which derive from the law of value and constitute invariants that apply to the economy as a whole. These equalities are necessary to determine market production prices. We demonstrate that they also enable to solve the transformation problem for a simple reproduction system without fixed capital by starting from Morishima's formalism and returning to a formalism closer to that used by Marx.
&lt;/p&gt;</description></item></channel></rss>