<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#22312;&#20195;&#29702;SVARs&#20013;&#65292;&#24403;&#22806;&#37096;&#27704;&#20037;&#31361;&#30772;&#23548;&#33268;&#30446;&#26631;&#33033;&#20914;&#21709;&#24212;&#20989;&#25968;&#38543;&#27874;&#21160;&#29575;&#20307;&#21046;&#21464;&#21270;&#26102;&#65292;&#24517;&#39035;&#26126;&#30830;&#32435;&#20837;&#26080;&#26465;&#20214;&#27874;&#21160;&#30340;&#21464;&#21270;&#65292;&#20197;&#28857;&#36776;&#35782;&#30446;&#26631;&#32467;&#26500;&#24615;&#20914;&#20987;&#24182;&#24674;&#22797;&#19968;&#33268;&#24615;&#12290;</title><link>https://arxiv.org/abs/2403.08753</link><description>&lt;p&gt;
&#26080;&#25928;&#30340;&#20195;&#29702;&#21644;&#27874;&#21160;&#21464;&#21270;
&lt;/p&gt;
&lt;p&gt;
Invalid proxies and volatility changes
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.08753
&lt;/p&gt;
&lt;p&gt;
&#22312;&#20195;&#29702;SVARs&#20013;&#65292;&#24403;&#22806;&#37096;&#27704;&#20037;&#31361;&#30772;&#23548;&#33268;&#30446;&#26631;&#33033;&#20914;&#21709;&#24212;&#20989;&#25968;&#38543;&#27874;&#21160;&#29575;&#20307;&#21046;&#21464;&#21270;&#26102;&#65292;&#24517;&#39035;&#26126;&#30830;&#32435;&#20837;&#26080;&#26465;&#20214;&#27874;&#21160;&#30340;&#21464;&#21270;&#65292;&#20197;&#28857;&#36776;&#35782;&#30446;&#26631;&#32467;&#26500;&#24615;&#20914;&#20987;&#24182;&#24674;&#22797;&#19968;&#33268;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24403;&#22312;&#20195;&#29702;SVARs&#20013;&#65292;VAR&#25200;&#21160;&#30340;&#21327;&#26041;&#24046;&#30697;&#38453;&#21463;&#21040;&#22806;&#29983;&#12289;&#27704;&#20037;&#12289;&#38750;&#37325;&#22797;&#24615;&#31361;&#30772;&#30340;&#24433;&#21709;&#65292;&#20174;&#32780;&#20135;&#29983;&#38543;&#30528;&#27874;&#21160;&#29575;&#20307;&#21046;&#21464;&#21270;&#32780;&#21464;&#21270;&#30340;&#30446;&#26631;&#33033;&#20914;&#21709;&#24212;&#20989;&#25968;(IRFs)&#26102;&#65292;&#21363;&#20351;&#26159;&#24378;&#22823;&#30340;&#22806;&#29983;&#22806;&#37096;&#24037;&#20855;&#20063;&#21487;&#33021;&#23548;&#33268;&#23545;&#25152;&#24863;&#20852;&#36259;&#30340;&#21160;&#24577;&#22240;&#26524;&#25928;&#24212;&#30340;&#20272;&#35745;&#20540;&#19981;&#19968;&#33268;&#65292;&#22914;&#26524;&#19981;&#36866;&#24403;&#32771;&#34385;&#36825;&#20123;&#31361;&#30772;&#12290;&#22312;&#36825;&#31181;&#24773;&#20917;&#19979;&#65292;&#24517;&#39035;&#26126;&#30830;&#22320;&#23558;&#26080;&#26465;&#20214;&#27874;&#21160;&#30340;&#21464;&#21270;&#32435;&#20837;&#32771;&#34385;&#65292;&#20197;&#20415;&#28857;&#36776;&#35782;&#20986;&#30446;&#26631;&#32467;&#26500;&#20914;&#20987;&#24182;&#21487;&#33021;&#24674;&#22797;&#19968;&#33268;&#24615;&#12290;&#25105;&#20204;&#35777;&#26126;&#65292;&#22312;&#21033;&#29992;&#27874;&#21160;&#24615;&#21464;&#21270;&#25152;&#26263;&#31034;&#30340;&#30636;&#26102;&#26102;&#21051;&#30340;&#24517;&#35201;&#20805;&#20998;&#31209;&#26465;&#20214;&#19979;&#65292;&#30446;&#26631;IRFs&#21487;&#20197;&#34987;&#28857;&#36776;&#35782;&#24182;&#19968;&#33268;&#20272;&#35745;&#12290;&#37325;&#35201;&#30340;&#26159;&#65292;&#26631;&#20934;&#28176;&#36817;&#25512;&#26029;&#22312;&#36825;&#31181;&#24773;&#20917;&#19979;&#20173;&#28982;&#26159;&#26377;&#25928;&#30340;&#65292;&#23613;&#31649;(I)&#20195;&#29702;&#21644;&#34987;&#24037;&#20855;&#21270;&#30340;&#32467;&#26500;&#24615;&#20914;&#20987;&#20043;&#38388;&#30340;&#21327;&#26041;&#24046;&#26159;&#25509;&#36817;&#20110;&#38646;&#65292;&#23601;&#20687;Stai&#20013;&#30340;&#24773;&#20917;&#19968;&#26679;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.08753v1 Announce Type: new  Abstract: When in proxy-SVARs the covariance matrix of VAR disturbances is subject to exogenous, permanent, nonrecurring breaks that generate target impulse response functions (IRFs) that change across volatility regimes, even strong, exogenous external instruments can result in inconsistent estimates of the dynamic causal effects of interest if the breaks are not properly accounted for. In such cases, it is essential to explicitly incorporate the shifts in unconditional volatility in order to point-identify the target structural shocks and possibly restore consistency. We demonstrate that, under a necessary and sufficient rank condition that leverages moments implied by changes in volatility, the target IRFs can be point-identified and consistently estimated. Importantly, standard asymptotic inference remains valid in this context despite (i) the covariance between the proxies and the instrumented structural shocks being local-to-zero, as in Stai
&lt;/p&gt;</description></item><item><title>EV&#20215;&#26684;&#20027;&#35201;&#21463;&#21040;&#26631;&#20934;&#20986;&#21806;&#30340;&#38468;&#21152;&#21151;&#33021;&#12289;&#39069;&#22806;&#21151;&#33021;&#21644;&#32463;&#38144;&#21830;&#23433;&#35013;&#30340;&#37197;&#20214;&#25968;&#37327;&#30340;&#24433;&#21709;&#65292;&#20197;&#21450;EV&#39532;&#21147;&#30340;&#24433;&#21709;&#36739;&#23567;&#12290;</title><link>https://arxiv.org/abs/2403.00458</link><description>&lt;p&gt;
&#30005;&#21160;&#27773;&#36710;&#24066;&#22330;&#20013;&#30340;&#20215;&#26684;&#21644;&#20559;&#22909;
&lt;/p&gt;
&lt;p&gt;
Prices and preferences in the electric vehicle market
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.00458
&lt;/p&gt;
&lt;p&gt;
EV&#20215;&#26684;&#20027;&#35201;&#21463;&#21040;&#26631;&#20934;&#20986;&#21806;&#30340;&#38468;&#21152;&#21151;&#33021;&#12289;&#39069;&#22806;&#21151;&#33021;&#21644;&#32463;&#38144;&#21830;&#23433;&#35013;&#30340;&#37197;&#20214;&#25968;&#37327;&#30340;&#24433;&#21709;&#65292;&#20197;&#21450;EV&#39532;&#21147;&#30340;&#24433;&#21709;&#36739;&#23567;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#23613;&#31649;&#30005;&#21160;&#27773;&#36710;&#27604;&#27773;&#27833;&#27773;&#36710;&#26356;&#29615;&#20445;&#65292;&#20294;&#20854;&#37319;&#29992;&#21463;&#21040;&#36739;&#39640;&#30340;&#37319;&#36141;&#20215;&#26684;&#30340;&#25361;&#25112;&#12290;&#29616;&#26377;&#35752;&#35770;&#24378;&#35843;EV&#30005;&#27744;&#25104;&#26412;&#20027;&#35201;&#23548;&#33268;&#20215;&#26684;&#24046;&#24322;&#65292;&#24182;&#26222;&#36941;&#35748;&#20026;&#37319;&#29992;&#21462;&#20915;&#20110;&#30005;&#27744;&#25104;&#26412;&#19979;&#38477;&#12290;&#25105;&#20204;&#36890;&#36807;&#25910;&#38598;2011&#24180;&#33267;2023&#24180;&#20043;&#38388;&#30340;EV&#23646;&#24615;&#21644;&#24066;&#22330;&#26465;&#20214;&#25968;&#25454;&#26469;&#23457;&#26597;&#36825;&#31181;&#25512;&#29702;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#32467;&#26524;&#26377;&#22235;&#20010;&#26041;&#38754;&#12290;&#39318;&#20808;&#65292;EV&#20215;&#26684;&#20027;&#35201;&#21463;&#21040;&#26631;&#20934;&#20986;&#21806;&#30340;&#38468;&#21152;&#21151;&#33021;&#12289;&#39069;&#22806;&#21151;&#33021;&#21644;&#32463;&#38144;&#21830;&#23433;&#35013;&#30340;&#37197;&#20214;&#25968;&#37327;&#30340;&#24433;&#21709;&#65292;&#20197;&#21450;EV&#39532;&#21147;&#30340;&#24433;&#21709;&#36739;&#23567;&#12290;&#20854;&#27425;&#65292;EV&#32493;&#33322;&#37324;&#31243;&#19982;EV&#20215;&#26684;&#21576;&#36127;&#30456;&#20851;&#65292;&#36825;&#24847;&#21619;&#30528;&#32493;&#33322;&#28966;&#34385;&#21487;&#33021;&#27809;&#26377;&#29616;&#26377;&#35752;&#35770;&#25152;&#26263;&#31034;&#30340;&#37027;&#20040;&#37325;&#35201;&#12290;&#31532;&#19977;&#65292;&#30005;&#27744;&#23481;&#37327;&#19982;EV&#20215;&#26684;&#21576;&#27491;&#30456;&#20851;&#65292;&#22240;&#20026;&#26356;&#22823;&#23481;&#37327;&#24847;&#21619;&#30528;&#25552;&#20379;&#26356;&#22810;&#39532;&#21147;&#12290;&#24635;&#30340;&#26469;&#35828;&#65292;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.00458v1 Announce Type: new  Abstract: Although electric vehicles are less polluting than gasoline powered vehicles, adoption is challenged by higher procurement prices. Existing discourse emphasizes EV battery costs as being principally responsible for this price differential and widespread adoption is routinely conditioned upon battery costs declining. We scrutinize such reasoning by sourcing data on EV attributes and market conditions between 2011 and 2023. Our findings are fourfold. First, EV prices are influenced principally by the number of amenities, additional features, and dealer-installed accessories sold as standard on an EV, and to a lesser extent, by EV horsepower. Second, EV range is negatively correlated with EV price implying that range anxiety concerns may be less consequential than existing discourse suggests. Third, battery capacity is positively correlated with EV price, due to more capacity being synonymous with the delivery of more horsepower. Collective
&lt;/p&gt;</description></item></channel></rss>