<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#23398;&#20064;&#21033;&#29992;&#35266;&#27979;&#25968;&#25454;&#25552;&#20986;&#20102;&#19968;&#31181;&#36880;&#27493;&#21452;&#37325;&#24378;&#20581;&#26041;&#27861;&#65292;&#36890;&#36807;&#21521;&#21518;&#24402;&#32435;&#35299;&#20915;&#20102;&#26368;&#20339;&#21160;&#24577;&#27835;&#30103;&#26041;&#26696;&#30340;&#38382;&#39064;</title><link>https://arxiv.org/abs/2404.00221</link><description>&lt;p&gt;
&#21033;&#29992;&#35266;&#27979;&#25968;&#25454;&#36827;&#34892;&#24378;&#20581;&#23398;&#20064;&#20197;&#33719;&#24471;&#26368;&#20339;&#21160;&#24577;&#27835;&#30103;&#26041;&#26696;
&lt;/p&gt;
&lt;p&gt;
Robust Learning for Optimal Dynamic Treatment Regimes with Observational Data
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2404.00221
&lt;/p&gt;
&lt;p&gt;
&#23398;&#20064;&#21033;&#29992;&#35266;&#27979;&#25968;&#25454;&#25552;&#20986;&#20102;&#19968;&#31181;&#36880;&#27493;&#21452;&#37325;&#24378;&#20581;&#26041;&#27861;&#65292;&#36890;&#36807;&#21521;&#21518;&#24402;&#32435;&#35299;&#20915;&#20102;&#26368;&#20339;&#21160;&#24577;&#27835;&#30103;&#26041;&#26696;&#30340;&#38382;&#39064;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35768;&#22810;&#20844;&#20849;&#25919;&#31574;&#21644;&#21307;&#30103;&#24178;&#39044;&#28041;&#21450;&#20854;&#27835;&#30103;&#20998;&#37197;&#20013;&#30340;&#21160;&#24577;&#24615;&#65292;&#27835;&#30103;&#36890;&#24120;&#20381;&#25454;&#20808;&#21069;&#27835;&#30103;&#30340;&#21382;&#21490;&#21644;&#30456;&#20851;&#29305;&#24449;&#23545;&#27599;&#20010;&#38454;&#27573;&#30340;&#25928;&#26524;&#20855;&#26377;&#24322;&#36136;&#24615;&#12290;&#26412;&#25991;&#30740;&#31350;&#20102;&#32479;&#35745;&#23398;&#20064;&#26368;&#20339;&#21160;&#24577;&#27835;&#30103;&#26041;&#26696;(DTR)&#65292;&#26681;&#25454;&#20010;&#20307;&#30340;&#21382;&#21490;&#25351;&#23548;&#27599;&#20010;&#38454;&#27573;&#30340;&#26368;&#20339;&#27835;&#30103;&#20998;&#37197;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#35266;&#27979;&#25968;&#25454;&#30340;&#36880;&#27493;&#21452;&#37325;&#24378;&#20581;&#26041;&#27861;&#65292;&#22312;&#39034;&#24207;&#21487;&#24573;&#30053;&#24615;&#20551;&#35774;&#19979;&#23398;&#20064;&#26368;&#20339;DTR&#12290;&#35813;&#26041;&#27861;&#36890;&#36807;&#21521;&#21518;&#24402;&#32435;&#35299;&#20915;&#20102;&#39034;&#24207;&#27835;&#30103;&#20998;&#37197;&#38382;&#39064;&#65292;&#22312;&#27599;&#19968;&#27493;&#20013;&#65292;&#25105;&#20204;&#32467;&#21512;&#20542;&#21521;&#35780;&#20998;&#21644;&#34892;&#21160;&#20540;&#20989;&#25968;(Q&#20989;&#25968;)&#30340;&#20272;&#35745;&#37327;&#65292;&#26500;&#24314;&#20102;&#25919;&#31574;&#20215;&#20540;&#30340;&#22686;&#24378;&#21453;&#21521;&#27010;&#29575;&#21152;&#26435;&#20272;&#35745;&#37327;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2404.00221v1 Announce Type: cross  Abstract: Many public policies and medical interventions involve dynamics in their treatment assignments, where treatments are sequentially assigned to the same individuals across multiple stages, and the effect of treatment at each stage is usually heterogeneous with respect to the history of prior treatments and associated characteristics. We study statistical learning of optimal dynamic treatment regimes (DTRs) that guide the optimal treatment assignment for each individual at each stage based on the individual's history. We propose a step-wise doubly-robust approach to learn the optimal DTR using observational data under the assumption of sequential ignorability. The approach solves the sequential treatment assignment problem through backward induction, where, at each step, we combine estimators of propensity scores and action-value functions (Q-functions) to construct augmented inverse probability weighting estimators of values of policies 
&lt;/p&gt;</description></item><item><title>&#25552;&#20986;&#20102;&#19968;&#20010;&#21033;&#29992;&#20108;&#20803;&#24037;&#20855;&#30340;&#24037;&#20855;&#21464;&#37327;&#26694;&#26550;&#65292;&#29992;&#20110;&#35782;&#21035;&#21644;&#20272;&#35745;&#31163;&#25955;&#21644;&#36830;&#32493;&#22788;&#29702;&#30340;&#24179;&#22343;&#25928;&#24212;&#21644;&#20998;&#20301;&#25968;&#25928;&#24212;&#65292;&#22522;&#20110;Copula&#19981;&#21464;&#24615;&#30340;&#35782;&#21035;&#20551;&#35774;&#65292;&#26500;&#36896;&#24615;&#35782;&#21035;&#20102;&#25972;&#20010;&#20154;&#32676;&#21450;&#20854;&#20182;&#23376;&#20154;&#32676;&#30340;&#22788;&#29702;&#25928;&#24212;&#65292;&#24182;&#25552;&#20986;&#20102;&#22522;&#20110;&#20998;&#24067;&#22238;&#24402;&#30340;&#30452;&#25509;&#21322;&#21442;&#25968;&#20272;&#35745;&#36807;&#31243;&#12290;</title><link>https://arxiv.org/abs/2403.05850</link><description>&lt;p&gt;
&#29992;&#20108;&#20803;&#24037;&#20855;&#20272;&#35745;&#31163;&#25955;&#21644;&#36830;&#32493;&#22788;&#29702;&#30340;&#22240;&#26524;&#25928;&#24212;
&lt;/p&gt;
&lt;p&gt;
Estimating Causal Effects of Discrete and Continuous Treatments with Binary Instruments
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.05850
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#20010;&#21033;&#29992;&#20108;&#20803;&#24037;&#20855;&#30340;&#24037;&#20855;&#21464;&#37327;&#26694;&#26550;&#65292;&#29992;&#20110;&#35782;&#21035;&#21644;&#20272;&#35745;&#31163;&#25955;&#21644;&#36830;&#32493;&#22788;&#29702;&#30340;&#24179;&#22343;&#25928;&#24212;&#21644;&#20998;&#20301;&#25968;&#25928;&#24212;&#65292;&#22522;&#20110;Copula&#19981;&#21464;&#24615;&#30340;&#35782;&#21035;&#20551;&#35774;&#65292;&#26500;&#36896;&#24615;&#35782;&#21035;&#20102;&#25972;&#20010;&#20154;&#32676;&#21450;&#20854;&#20182;&#23376;&#20154;&#32676;&#30340;&#22788;&#29702;&#25928;&#24212;&#65292;&#24182;&#25552;&#20986;&#20102;&#22522;&#20110;&#20998;&#24067;&#22238;&#24402;&#30340;&#30452;&#25509;&#21322;&#21442;&#25968;&#20272;&#35745;&#36807;&#31243;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#21033;&#29992;&#20108;&#20803;&#24037;&#20855;&#30340;&#24037;&#20855;&#21464;&#37327;&#26694;&#26550;&#65292;&#29992;&#20110;&#35782;&#21035;&#21644;&#20272;&#35745;&#31163;&#25955;&#21644;&#36830;&#32493;&#22788;&#29702;&#30340;&#24179;&#22343;&#25928;&#24212;&#21644;&#20998;&#20301;&#25968;&#25928;&#24212;&#12290;&#25105;&#20204;&#26041;&#27861;&#30340;&#22522;&#30784;&#26159;&#28508;&#22312;&#32467;&#26524;&#21644;&#20915;&#23450;&#22788;&#29702;&#20998;&#37197;&#30340;&#19981;&#21487;&#35266;&#27979;&#21464;&#37327;&#30340;&#32852;&#21512;&#20998;&#24067;&#30340;&#23616;&#37096;Copula&#34920;&#31034;&#12290;&#36825;&#31181;&#34920;&#31034;&#20351;&#25105;&#20204;&#33021;&#22815;&#24341;&#20837;&#19968;&#20010;&#25152;&#35859;&#30340;Copula&#19981;&#21464;&#24615;&#30340;&#35782;&#21035;&#20551;&#35774;&#65292;&#35813;&#20551;&#35774;&#38480;&#21046;&#20102;Copula&#20851;&#20110;&#22788;&#29702;&#20542;&#21521;&#30340;&#23616;&#37096;&#20381;&#36182;&#12290;&#25105;&#20204;&#23637;&#31034;Copula&#19981;&#21464;&#24615;&#35782;&#21035;&#20102;&#25972;&#20010;&#20154;&#32676;&#20197;&#21450;&#20854;&#20182;&#20122;&#20154;&#32676;&#65288;&#22914;&#25509;&#21463;&#22788;&#29702;&#32773;&#65289;&#30340;&#22788;&#29702;&#25928;&#24212;&#12290;&#35782;&#21035;&#32467;&#26524;&#26159;&#26500;&#36896;&#24615;&#30340;&#65292;&#24182;&#23548;&#33268;&#22522;&#20110;&#20998;&#24067;&#22238;&#24402;&#30340;&#30452;&#25509;&#21322;&#21442;&#25968;&#20272;&#35745;&#36807;&#31243;&#12290;&#23545;&#30561;&#30496;&#23545;&#24184;&#31119;&#24863;&#30340;&#24433;&#21709;&#30340;&#24212;&#29992;&#25581;&#31034;&#20102;&#26377;&#36259;&#30340;&#24322;&#36136;&#24615;&#27169;&#24335;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.05850v1 Announce Type: new  Abstract: We propose an instrumental variable framework for identifying and estimating average and quantile effects of discrete and continuous treatments with binary instruments. The basis of our approach is a local copula representation of the joint distribution of the potential outcomes and unobservables determining treatment assignment. This representation allows us to introduce an identifying assumption, so-called copula invariance, that restricts the local dependence of the copula with respect to the treatment propensity. We show that copula invariance identifies treatment effects for the entire population and other subpopulations such as the treated. The identification results are constructive and lead to straightforward semiparametric estimation procedures based on distribution regression. An application to the effect of sleep on well-being uncovers interesting patterns of heterogeneity.
&lt;/p&gt;</description></item><item><title>&#20027;&#20307;&#19982;&#22810;&#20010;&#20195;&#29702;&#30340;&#21512;&#21516;&#35774;&#35745;&#20013;&#65292;&#21152;&#26435;&#21512;&#21516;&#26159;&#26368;&#20248;&#30340;&#36873;&#25321;&#65292;&#21487;&#20197;&#36890;&#36807;&#20026;&#20195;&#29702;&#20998;&#37197;&#27491;&#26435;&#37325;&#21644;&#20248;&#20808;&#32423;&#27700;&#24179;&#26469;&#23454;&#29616;&#26368;&#22823;&#21270;&#20195;&#29702;&#30340;&#25104;&#21151;&#27010;&#29575;&#12290;</title><link>https://arxiv.org/abs/2402.15890</link><description>&lt;p&gt;
&#24102;&#39044;&#31639;&#30340;&#22810;&#20195;&#29702;&#21512;&#21516;&#35774;&#35745;&#20013;&#21152;&#26435;&#21512;&#21516;&#30340;&#26368;&#20248;&#24615;
&lt;/p&gt;
&lt;p&gt;
Optimality of weighted contracts for multi-agent contract design with a budget
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.15890
&lt;/p&gt;
&lt;p&gt;
&#20027;&#20307;&#19982;&#22810;&#20010;&#20195;&#29702;&#30340;&#21512;&#21516;&#35774;&#35745;&#20013;&#65292;&#21152;&#26435;&#21512;&#21516;&#26159;&#26368;&#20248;&#30340;&#36873;&#25321;&#65292;&#21487;&#20197;&#36890;&#36807;&#20026;&#20195;&#29702;&#20998;&#37197;&#27491;&#26435;&#37325;&#21644;&#20248;&#20808;&#32423;&#27700;&#24179;&#26469;&#23454;&#29616;&#26368;&#22823;&#21270;&#20195;&#29702;&#30340;&#25104;&#21151;&#27010;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#19968;&#20010;&#20027;&#20307;&#19982;&#22810;&#20010;&#20195;&#29702;&#20043;&#38388;&#30340;&#21512;&#21516;&#35774;&#35745;&#38382;&#39064;&#12290;&#27599;&#20010;&#20195;&#29702;&#21442;&#19982;&#19968;&#20010;&#29420;&#31435;&#20219;&#21153;&#65292;&#32467;&#26524;&#20026;&#25104;&#21151;&#25110;&#22833;&#36133;&#65292;&#20195;&#29702;&#21487;&#20197;&#20184;&#20986;&#20195;&#20215;&#21162;&#21147;&#25552;&#39640;&#25104;&#21151;&#30340;&#27010;&#29575;&#65292;&#20027;&#20307;&#26377;&#22266;&#23450;&#39044;&#31639;&#65292;&#21487;&#20197;&#20026;&#20195;&#29702;&#25552;&#20379;&#19982;&#32467;&#26524;&#30456;&#20851;&#30340;&#22870;&#21169;&#12290;&#20851;&#38190;&#26159;&#65292;&#25105;&#20204;&#20551;&#35774;&#20027;&#20307;&#21482;&#20851;&#24515;&#26368;&#22823;&#21270;&#20195;&#29702;&#30340;&#25104;&#21151;&#27010;&#29575;&#65292;&#32780;&#19981;&#20851;&#24515;&#39044;&#31639;&#30340;&#25903;&#20986;&#37327;&#12290;&#25105;&#20204;&#39318;&#20808;&#35777;&#26126;&#20102;&#23545;&#20110;&#26576;&#20123;&#30446;&#26631;&#65292;&#21512;&#21516;&#21482;&#26377;&#24403;&#23427;&#26159;&#25104;&#21151;&#19968;&#20999;&#30340;&#21512;&#21516;&#25165;&#26159;&#26368;&#20248;&#30340;&#12290;&#36825;&#20010;&#32467;&#26524;&#30340;&#19968;&#20010;&#30452;&#25509;&#25512;&#35770;&#26159;&#65292;&#22312;&#36825;&#31181;&#35774;&#23450;&#19979;&#65292;&#35745;&#20214;&#21512;&#21516;&#21644;&#22870;&#37329;&#27744;&#21512;&#21516;&#20174;&#26469;&#19981;&#26159;&#26368;&#20248;&#30340;&#12290;&#28982;&#21518;&#25105;&#20204;&#35777;&#26126;&#65292;&#23545;&#20110;&#20219;&#20309;&#30446;&#26631;&#65292;&#23384;&#22312;&#19968;&#20010;&#26368;&#20248;&#30340;&#22522;&#20110;&#20248;&#20808;&#32423;&#21152;&#26435;&#30340;&#21512;&#21516;&#65292;&#36825;&#20010;&#21512;&#21516;&#20026;&#20195;&#29702;&#20998;&#37197;&#27491;&#26435;&#37325;&#21644;&#20248;&#20808;&#32423;&#27700;&#24179;&#65292;&#24182;&#23558;&#39044;&#31639;&#20998;&#37197;&#32473;&#26368;&#39640;&#20248;&#20808;&#32423;&#30340;&#25104;&#21151;&#20195;&#29702;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.15890v1 Announce Type: new  Abstract: We study a contract design problem between a principal and multiple agents. Each agent participates in an independent task with binary outcomes (success or failure), in which it may exert costly effort towards improving its probability of success, and the principal has a fixed budget which it can use to provide outcome-dependent rewards to the agents. Crucially, we assume the principal cares only about maximizing the agents' probabilities of success, not how much of the budget it expends. We first show that a contract is optimal for some objective if and only if it is a successful-get-everything contract. An immediate consequence of this result is that piece-rate contracts and bonus-pool contracts are never optimal in this setting. We then show that for any objective, there is an optimal priority-based weighted contract, which assigns positive weights and priority levels to the agents, and splits the budget among the highest-priority suc
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#22522;&#20110;&#24066;&#22330;&#30340;&#32929;&#31080;&#22238;&#25253;&#27010;&#29575;&#65292;&#21457;&#29616;&#24066;&#22330;&#25317;&#26377;&#32929;&#31080;&#22238;&#25253;&#30340;&#25152;&#26377;&#20449;&#24687;&#65292;&#24182;&#25506;&#35752;&#20102;&#22238;&#25253;&#30340;&#32479;&#35745;&#23398;&#29305;&#24449;&#19982;&#24403;&#21069;&#21644;&#36807;&#21435;&#20132;&#26131;&#20540;&#30340;&#32479;&#35745;&#23398;&#29305;&#24449;&#21644;&#30456;&#20851;&#24615;&#20043;&#38388;&#30340;&#20851;&#31995;&#12290;</title><link>https://arxiv.org/abs/2302.07935</link><description>&lt;p&gt;
&#22522;&#20110;&#24066;&#22330;&#30340;&#32929;&#31080;&#22238;&#25253;&#27010;&#29575;
&lt;/p&gt;
&lt;p&gt;
Market-Based Probability of Stock Returns
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2302.07935
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#22522;&#20110;&#24066;&#22330;&#30340;&#32929;&#31080;&#22238;&#25253;&#27010;&#29575;&#65292;&#21457;&#29616;&#24066;&#22330;&#25317;&#26377;&#32929;&#31080;&#22238;&#25253;&#30340;&#25152;&#26377;&#20449;&#24687;&#65292;&#24182;&#25506;&#35752;&#20102;&#22238;&#25253;&#30340;&#32479;&#35745;&#23398;&#29305;&#24449;&#19982;&#24403;&#21069;&#21644;&#36807;&#21435;&#20132;&#26131;&#20540;&#30340;&#32479;&#35745;&#23398;&#29305;&#24449;&#21644;&#30456;&#20851;&#24615;&#20043;&#38388;&#30340;&#20851;&#31995;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24066;&#22330;&#25317;&#26377;&#20851;&#20110;&#32929;&#31080;&#22238;&#25253;&#30340;&#25152;&#26377;&#21487;&#29992;&#20449;&#24687;&#12290;&#24066;&#22330;&#20132;&#26131;&#30340;&#38543;&#26426;&#24615;&#20915;&#23450;&#20102;&#32929;&#31080;&#22238;&#25253;&#30340;&#32479;&#35745;&#23398;&#29305;&#24449;&#12290;&#26412;&#25991;&#25551;&#36848;&#20102;&#32929;&#31080;&#22238;&#25253;&#30340;&#21069;&#22235;&#20010;&#22522;&#20110;&#24066;&#22330;&#30340;&#32479;&#35745;&#23398;&#29305;&#24449;&#19982;&#24403;&#21069;&#21644;&#36807;&#21435;&#20132;&#26131;&#20540;&#30340;&#32479;&#35745;&#23398;&#29305;&#24449;&#21644;&#30456;&#20851;&#24615;&#20043;&#38388;&#30340;&#20381;&#36182;&#20851;&#31995;&#12290;&#22312;&#21152;&#26435;&#24179;&#22343;&#26399;&#38388;&#36827;&#34892;&#20132;&#26131;&#30340;&#24179;&#22343;&#22238;&#25253;&#19982;&#39532;&#31185;&#23041;&#33576;&#23545;&#25237;&#36164;&#32452;&#21512;&#20215;&#20540;&#21152;&#26435;&#22238;&#25253;&#30340;&#23450;&#20041;&#30456;&#21563;&#21512;&#12290;&#25105;&#20204;&#25512;&#23548;&#20102;&#22522;&#20110;&#24066;&#22330;&#30340;&#22238;&#25253;&#27874;&#21160;&#29575;&#21644;&#22238;&#25253;-&#20215;&#20540;&#30456;&#20851;&#24615;&#12290;&#36890;&#36807;&#26377;&#38480;&#25968;&#37327;&#30340;&#22522;&#20110;&#24066;&#22330;&#30340;&#32479;&#35745;&#23398;&#29305;&#24449;&#30340;&#29305;&#24449;&#20989;&#25968;&#21644;&#27010;&#29575;&#24230;&#37327;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#23545;&#32929;&#31080;&#22238;&#25253;&#30340;&#36817;&#20284;&#39044;&#27979;&#26041;&#27861;&#12290;&#35201;&#39044;&#27979;&#22522;&#20110;&#24066;&#22330;&#30340;&#24179;&#22343;&#22238;&#25253;&#25110;&#22238;&#25253;&#27874;&#21160;&#29575;&#65292;&#24517;&#39035;&#21516;&#26102;&#39044;&#27979;&#24403;&#21069;&#21644;&#36807;&#21435;&#24066;&#22330;&#20132;&#26131;&#20540;&#30340;&#32479;&#35745;&#23398;&#29305;&#24449;&#21644;&#30456;&#20851;&#24615;&#65292;&#20197;&#30456;&#21516;&#30340;&#26102;&#38388;&#36328;&#24230;&#12290;
&lt;/p&gt;
&lt;p&gt;
Markets possess all available information on stock returns. The randomness of market trade determines the statistics of stock returns. This paper describes the dependence of the first four market-based statistical moments of stock returns on statistical moments and correlations of current and past trade values. The mean return of trades during the averaging period coincides with Markowitz's definition of portfolio value weighted return. We derive the market-based volatility of return and return-value correlations. We present approximations of the characteristic functions and probability measures of stock return by a finite number of market-based statistical moments. To forecast market-based average return or volatility of return, one should predict the statistical moments and correlations of current and past market trade values at the same time horizon.
&lt;/p&gt;</description></item><item><title>&#36825;&#31687;&#35770;&#25991;&#25506;&#35752;&#20102;&#24066;&#22330;&#20132;&#26131;&#20215;&#20540;&#21644;&#20132;&#26131;&#37327;&#30340;&#38543;&#26426;&#24615;&#22914;&#20309;&#24433;&#21709;&#36164;&#20135;&#20215;&#26684;&#30340;&#38543;&#26426;&#24615;&#65292;&#24182;&#36890;&#36807;&#24066;&#22330;&#22522;&#20110;&#20215;&#26684;&#30340;&#32479;&#35745;&#30697;&#26469;&#36817;&#20284;&#20215;&#26684;&#27010;&#29575;&#12290;&#30740;&#31350;&#21457;&#29616;&#20351;&#29992;&#20132;&#26131;&#37327;&#21152;&#26435;&#24179;&#22343;&#20215;&#26684;&#21487;&#20197;&#28040;&#38500;&#20215;&#26684;&#21644;&#20132;&#26131;&#37327;&#20043;&#38388;&#30340;&#30456;&#20851;&#24615;&#65292;&#24182;&#25512;&#23548;&#20986;&#20102;&#20854;&#20182;&#20215;&#26684;&#21644;&#20132;&#26131;&#37327;&#30456;&#20851;&#24615;&#12290;&#30740;&#31350;&#32467;&#26524;&#23545;&#36164;&#20135;&#23450;&#20215;&#27169;&#22411;&#21644;&#39118;&#38505;&#20215;&#20540;&#26377;&#37325;&#35201;&#24433;&#21709;&#12290;</title><link>https://arxiv.org/abs/2205.07256</link><description>&lt;p&gt;
&#22522;&#20110;&#24066;&#22330;&#30340;&#36164;&#20135;&#20215;&#26684;&#27010;&#29575;
&lt;/p&gt;
&lt;p&gt;
Market-Based Asset Price Probability
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2205.07256
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#25506;&#35752;&#20102;&#24066;&#22330;&#20132;&#26131;&#20215;&#20540;&#21644;&#20132;&#26131;&#37327;&#30340;&#38543;&#26426;&#24615;&#22914;&#20309;&#24433;&#21709;&#36164;&#20135;&#20215;&#26684;&#30340;&#38543;&#26426;&#24615;&#65292;&#24182;&#36890;&#36807;&#24066;&#22330;&#22522;&#20110;&#20215;&#26684;&#30340;&#32479;&#35745;&#30697;&#26469;&#36817;&#20284;&#20215;&#26684;&#27010;&#29575;&#12290;&#30740;&#31350;&#21457;&#29616;&#20351;&#29992;&#20132;&#26131;&#37327;&#21152;&#26435;&#24179;&#22343;&#20215;&#26684;&#21487;&#20197;&#28040;&#38500;&#20215;&#26684;&#21644;&#20132;&#26131;&#37327;&#20043;&#38388;&#30340;&#30456;&#20851;&#24615;&#65292;&#24182;&#25512;&#23548;&#20986;&#20102;&#20854;&#20182;&#20215;&#26684;&#21644;&#20132;&#26131;&#37327;&#30456;&#20851;&#24615;&#12290;&#30740;&#31350;&#32467;&#26524;&#23545;&#36164;&#20135;&#23450;&#20215;&#27169;&#22411;&#21644;&#39118;&#38505;&#20215;&#20540;&#26377;&#37325;&#35201;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#23558;&#24066;&#22330;&#20132;&#26131;&#20215;&#20540;&#21644;&#20132;&#26131;&#37327;&#30340;&#38543;&#26426;&#24615;&#35270;&#20026;&#36164;&#20135;&#20215;&#26684;&#38543;&#26426;&#24615;&#30340;&#36215;&#28304;&#12290;&#25105;&#20204;&#23450;&#20041;&#20102;&#20381;&#36182;&#20110;&#24066;&#22330;&#20132;&#26131;&#20215;&#20540;&#21644;&#20132;&#26131;&#37327;&#30340;&#32479;&#35745;&#30697;&#30340;&#21069;&#22235;&#20010;&#24066;&#22330;&#22522;&#20110;&#20215;&#26684;&#30340;&#32479;&#35745;&#30697;&#12290;&#22914;&#26524;&#22312;&#26102;&#38388;&#24179;&#22343;&#38388;&#38548;&#20869;&#25152;&#26377;&#20132;&#26131;&#37327;&#37117;&#20445;&#25345;&#24658;&#23450;&#65292;&#37027;&#20040;&#24066;&#22330;&#22522;&#20110;&#20215;&#26684;&#30340;&#32479;&#35745;&#30697;&#19982;&#20256;&#32479;&#22522;&#20110;&#39057;&#29575;&#30340;&#32479;&#35745;&#30697;&#30456;&#19968;&#33268;&#12290;&#25105;&#20204;&#36890;&#36807;&#26377;&#38480;&#25968;&#37327;&#30340;&#20215;&#26684;&#32479;&#35745;&#30697;&#26469;&#36817;&#20284;&#24066;&#22330;&#22522;&#20110;&#20215;&#26684;&#30340;&#27010;&#29575;&#12290;&#25105;&#20204;&#32771;&#34385;&#22522;&#20110;&#24066;&#22330;&#20215;&#26684;&#32479;&#35745;&#30697;&#22312;&#36164;&#20135;&#23450;&#20215;&#27169;&#22411;&#21644;&#39118;&#38505;&#20215;&#20540;&#26041;&#38754;&#30340;&#24433;&#21709;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#20351;&#29992;&#20132;&#26131;&#37327;&#21152;&#26435;&#24179;&#22343;&#20215;&#26684;&#20250;&#23548;&#33268;&#20215;&#26684;&#21644;&#20132;&#26131;&#37327;&#30340;&#30456;&#20851;&#24615;&#20026;&#38646;&#12290;&#25105;&#20204;&#25512;&#23548;&#20102;&#22522;&#20110;&#24066;&#22330;&#30340;&#20215;&#26684;&#21644;&#20132;&#26131;&#37327;&#24179;&#26041;&#20043;&#38388;&#30340;&#30456;&#20851;&#24615;&#20197;&#21450;&#20215;&#26684;&#24179;&#26041;&#21644;&#20132;&#26131;&#37327;&#20043;&#38388;&#30340;&#30456;&#20851;&#24615;&#12290;&#35201;&#39044;&#27979;&#26399;&#38480;&#20026;T&#30340;&#22522;&#20110;&#24066;&#22330;&#30340;&#20215;&#26684;&#27874;&#21160;&#24615;&#65292;&#38656;&#35201;&#39044;&#27979;&#24066;&#22330;&#20132;&#26131;&#20215;&#20540;&#21644;&#20132;&#26131;&#37327;&#30340;&#21069;&#20004;&#20010;&#32479;&#35745;&#30697;&#12290;
&lt;/p&gt;
&lt;p&gt;
We consider the randomness of market trade values and volumes as the origin of asset price stochasticity. We define the first four market-based price statistical moments that depend on statistical moments and correlations of market trade values and volumes. Market-based price statistical moments coincide with conventional frequency-based ones if all trade volumes are constant during the time averaging interval. We present approximations of market-based price probability by a finite number of price statistical moments. We consider the consequences of the use of market-based price statistical moments for asset-pricing models and Value-at-Risk. We show that the use of volume weighted average price results in zero price-volume correlations. We derive market-based correlations between price and squares of volume and between squares of price and volume. To forecast market-based price volatility at horizon T one should predict the first two statistical moments of market trade values and volum
&lt;/p&gt;</description></item><item><title>&#36825;&#39033;&#30740;&#31350;&#22635;&#34917;&#20102;&#20851;&#20110;&#30005;&#23376;&#21830;&#21153;&#24179;&#21488;&#25512;&#33616;&#31639;&#27861;&#22312;&#31639;&#27861;&#21246;&#32467;&#30740;&#31350;&#20013;&#34987;&#24573;&#35270;&#30340;&#31354;&#30333;&#65292;&#24182;&#21457;&#29616;&#25512;&#33616;&#31639;&#27861;&#21487;&#20197;&#20915;&#23450;&#22522;&#20110;AI&#30340;&#23450;&#20215;&#31639;&#27861;&#30340;&#31454;&#20105;&#25110;&#21246;&#32467;&#21160;&#24577;&#12290;</title><link>http://arxiv.org/abs/2309.14548</link><description>&lt;p&gt;
&#31639;&#27861;&#21246;&#32467;&#36824;&#26159;&#31454;&#20105;&#65306;&#24179;&#21488;&#25512;&#33616;&#31995;&#32479;&#30340;&#35282;&#33394;
&lt;/p&gt;
&lt;p&gt;
Algorithmic Collusion or Competition: the Role of Platforms' Recommender Systems. (arXiv:2309.14548v1 [cs.AI])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.14548
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#30740;&#31350;&#22635;&#34917;&#20102;&#20851;&#20110;&#30005;&#23376;&#21830;&#21153;&#24179;&#21488;&#25512;&#33616;&#31639;&#27861;&#22312;&#31639;&#27861;&#21246;&#32467;&#30740;&#31350;&#20013;&#34987;&#24573;&#35270;&#30340;&#31354;&#30333;&#65292;&#24182;&#21457;&#29616;&#25512;&#33616;&#31639;&#27861;&#21487;&#20197;&#20915;&#23450;&#22522;&#20110;AI&#30340;&#23450;&#20215;&#31639;&#27861;&#30340;&#31454;&#20105;&#25110;&#21246;&#32467;&#21160;&#24577;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26368;&#36817;&#30340;&#23398;&#26415;&#30740;&#31350;&#24191;&#27867;&#25506;&#35752;&#20102;&#22522;&#20110;&#20154;&#24037;&#26234;&#33021;(AI)&#30340;&#21160;&#24577;&#23450;&#20215;&#31639;&#27861;&#23548;&#33268;&#30340;&#31639;&#27861;&#21246;&#32467;&#12290;&#28982;&#32780;&#65292;&#30005;&#23376;&#21830;&#21153;&#24179;&#21488;&#20351;&#29992;&#25512;&#33616;&#31639;&#27861;&#26469;&#20998;&#37197;&#19981;&#21516;&#20135;&#21697;&#30340;&#26333;&#20809;&#65292;&#32780;&#36825;&#19968;&#37325;&#35201;&#26041;&#38754;&#22312;&#20808;&#21069;&#30340;&#31639;&#27861;&#21246;&#32467;&#30740;&#31350;&#20013;&#34987;&#22823;&#37096;&#20998;&#24573;&#35270;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#22635;&#34917;&#20102;&#25991;&#29486;&#20013;&#36825;&#19968;&#37325;&#35201;&#30340;&#31354;&#30333;&#65292;&#24182;&#26816;&#39564;&#20102;&#25512;&#33616;&#31639;&#27861;&#22914;&#20309;&#20915;&#23450;&#22522;&#20110;AI&#30340;&#23450;&#20215;&#31639;&#27861;&#30340;&#31454;&#20105;&#25110;&#21246;&#32467;&#21160;&#24577;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#20004;&#31181;&#24120;&#29992;&#30340;&#25512;&#33616;&#31639;&#27861;&#65306;(i)&#20197;&#26368;&#22823;&#21270;&#21334;&#23478;&#24635;&#21033;&#28070;&#20026;&#30446;&#26631;&#30340;&#25512;&#33616;&#31995;&#32479;&#21644;(ii)&#20197;&#26368;&#22823;&#21270;&#24179;&#21488;&#19978;&#20135;&#21697;&#38656;&#27714;&#20026;&#30446;&#26631;&#30340;&#25512;&#33616;&#31995;&#32479;&#12290;&#25105;&#20204;&#26500;&#24314;&#20102;&#19968;&#20010;&#37325;&#22797;&#21338;&#24328;&#26694;&#26550;&#65292;&#23558;&#21334;&#23478;&#30340;&#23450;&#20215;&#31639;&#27861;&#21644;&#24179;&#21488;&#30340;&#25512;&#33616;&#31639;&#27861;&#36827;&#34892;&#20102;&#25972;&#21512;&#12290;
&lt;/p&gt;
&lt;p&gt;
Recent academic research has extensively examined algorithmic collusion resulting from the utilization of artificial intelligence (AI)-based dynamic pricing algorithms. Nevertheless, e-commerce platforms employ recommendation algorithms to allocate exposure to various products, and this important aspect has been largely overlooked in previous studies on algorithmic collusion. Our study bridges this important gap in the literature and examines how recommendation algorithms can determine the competitive or collusive dynamics of AI-based pricing algorithms. Specifically, two commonly deployed recommendation algorithms are examined: (i) a recommender system that aims to maximize the sellers' total profit (profit-based recommender system) and (ii) a recommender system that aims to maximize the demand for products sold on the platform (demand-based recommender system). We construct a repeated game framework that incorporates both pricing algorithms adopted by sellers and the platform's recom
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#22240;&#26524;&#26694;&#26550;&#65292;&#36890;&#36807;&#19968;&#20010;&#20013;&#38388;&#22788;&#29702;&#21464;&#37327;&#23558;&#32452;&#24046;&#24322;&#20998;&#35299;&#25104;&#19981;&#21516;&#30340;&#32452;&#25104;&#37096;&#20998;&#65292;&#24182;&#25552;&#20379;&#20102;&#19968;&#20010;&#26032;&#30340;&#35299;&#37322;&#21644;&#25913;&#21892;&#24046;&#24322;&#30340;&#26426;&#21046;&#12290;&#35813;&#26694;&#26550;&#25913;&#36827;&#20102;&#32463;&#20856;&#30340;&#20998;&#35299;&#26041;&#27861;&#65292;&#24182;&#19988;&#21487;&#20197;&#25351;&#23548;&#25919;&#31574;&#24178;&#39044;&#12290;</title><link>http://arxiv.org/abs/2306.16591</link><description>&lt;p&gt;
&#38750;&#21442;&#25968;&#22240;&#26524;&#20998;&#35299;&#32452;&#24046;&#24322;
&lt;/p&gt;
&lt;p&gt;
Nonparametric Causal Decomposition of Group Disparities. (arXiv:2306.16591v1 [stat.ME])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.16591
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#22240;&#26524;&#26694;&#26550;&#65292;&#36890;&#36807;&#19968;&#20010;&#20013;&#38388;&#22788;&#29702;&#21464;&#37327;&#23558;&#32452;&#24046;&#24322;&#20998;&#35299;&#25104;&#19981;&#21516;&#30340;&#32452;&#25104;&#37096;&#20998;&#65292;&#24182;&#25552;&#20379;&#20102;&#19968;&#20010;&#26032;&#30340;&#35299;&#37322;&#21644;&#25913;&#21892;&#24046;&#24322;&#30340;&#26426;&#21046;&#12290;&#35813;&#26694;&#26550;&#25913;&#36827;&#20102;&#32463;&#20856;&#30340;&#20998;&#35299;&#26041;&#27861;&#65292;&#24182;&#19988;&#21487;&#20197;&#25351;&#23548;&#25919;&#31574;&#24178;&#39044;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#22240;&#26524;&#26694;&#26550;&#26469;&#23558;&#32467;&#26524;&#20013;&#30340;&#32452;&#24046;&#24322;&#20998;&#35299;&#20026;&#20013;&#38388;&#22788;&#29702;&#21464;&#37327;&#12290;&#25105;&#20204;&#30340;&#26694;&#26550;&#25429;&#25417;&#20102;&#22522;&#32447;&#28508;&#22312;&#32467;&#26524;&#12289;&#22788;&#29702;&#21069;&#27839;&#12289;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#21644;&#22788;&#29702;&#36873;&#25321;&#30340;&#32452;&#24046;&#24322;&#30340;&#36129;&#29486;&#12290;&#36825;&#20010;&#26694;&#26550;&#20197;&#21453;&#20107;&#23454;&#30340;&#26041;&#24335;&#36827;&#34892;&#20102;&#25968;&#23398;&#34920;&#36798;&#65292;&#24182;&#19988;&#33021;&#22815;&#26041;&#20415;&#22320;&#25351;&#23548;&#25919;&#31574;&#24178;&#39044;&#12290;&#29305;&#21035;&#26159;&#65292;&#38024;&#23545;&#19981;&#21516;&#30340;&#22788;&#29702;&#36873;&#25321;&#36827;&#34892;&#30340;&#20998;&#35299;&#37096;&#20998;&#26159;&#29305;&#21035;&#26032;&#39062;&#30340;&#65292;&#25581;&#31034;&#20102;&#19968;&#31181;&#35299;&#37322;&#21644;&#25913;&#21892;&#24046;&#24322;&#30340;&#26032;&#26426;&#21046;&#12290;&#36825;&#20010;&#26694;&#26550;&#20197;&#22240;&#26524;&#26415;&#35821;&#37325;&#26032;&#23450;&#20041;&#20102;&#32463;&#20856;&#30340;Kitagawa-Blinder-Oaxaca&#20998;&#35299;&#65292;&#36890;&#36807;&#35299;&#37322;&#32452;&#24046;&#24322;&#32780;&#19981;&#26159;&#32452;&#25928;&#24212;&#26469;&#34917;&#20805;&#20102;&#22240;&#26524;&#20013;&#20171;&#20998;&#26512;&#65292;&#24182;&#35299;&#20915;&#20102;&#36817;&#26399;&#38543;&#26426;&#31561;&#21270;&#20998;&#35299;&#30340;&#27010;&#24565;&#22256;&#38590;&#12290;&#25105;&#20204;&#36824;&#25552;&#20379;&#20102;&#19968;&#20010;&#26465;&#20214;&#20998;&#35299;&#65292;&#20801;&#35768;&#30740;&#31350;&#20154;&#21592;&#22312;&#23450;&#20041;&#35780;&#20272;&#21644;&#30456;&#24212;&#30340;&#24178;&#39044;&#25514;&#26045;&#26102;&#32435;&#20837;&#21327;&#21464;&#37327;&#12290;
&lt;/p&gt;
&lt;p&gt;
We propose a causal framework for decomposing a group disparity in an outcome in terms of an intermediate treatment variable. Our framework captures the contributions of group differences in baseline potential outcome, treatment prevalence, average treatment effect, and selection into treatment. This framework is counterfactually formulated and readily informs policy interventions. The decomposition component for differential selection into treatment is particularly novel, revealing a new mechanism for explaining and ameliorating disparities. This framework reformulates the classic Kitagawa-Blinder-Oaxaca decomposition in causal terms, supplements causal mediation analysis by explaining group disparities instead of group effects, and resolves conceptual difficulties of recent random equalization decompositions. We also provide a conditional decomposition that allows researchers to incorporate covariates in defining the estimands and corresponding interventions. We develop nonparametric
&lt;/p&gt;</description></item></channel></rss>