<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#36890;&#36807;&#30740;&#31350;&#25968;&#25454;&#30340;&#30697;&#25968;&#37327;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#39640;&#32500;&#39640;&#26031;&#36817;&#20284;&#30340;&#30456;&#21464;&#26465;&#20214;&#65292;&#21363;&#39640;&#26031;&#36817;&#20284;&#30340;&#26377;&#25928;&#24615;&#21462;&#20915;&#20110;&#32500;&#24230;&#21644;&#30697;&#25968;&#37327;&#30340;&#20851;&#31995;&#12290;</title><link>http://arxiv.org/abs/2310.12863</link><description>&lt;p&gt;
&#39640;&#32500;&#39640;&#26031;&#36817;&#20284;&#20013;&#30340;&#20381;&#36182;&#30697;&#30340;&#30456;&#21464;
&lt;/p&gt;
&lt;p&gt;
Moment-dependent phase transitions in high-dimensional Gaussian approximations. (arXiv:2310.12863v1 [math.ST])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.12863
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#30740;&#31350;&#25968;&#25454;&#30340;&#30697;&#25968;&#37327;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#39640;&#32500;&#39640;&#26031;&#36817;&#20284;&#30340;&#30456;&#21464;&#26465;&#20214;&#65292;&#21363;&#39640;&#26031;&#36817;&#20284;&#30340;&#26377;&#25928;&#24615;&#21462;&#20915;&#20110;&#32500;&#24230;&#21644;&#30697;&#25968;&#37327;&#30340;&#20851;&#31995;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#39640;&#32500;&#20013;&#24515;&#26497;&#38480;&#23450;&#29702;&#24050;&#32463;&#24471;&#21040;&#20102;&#24191;&#27867;&#30740;&#31350;&#65292;&#37325;&#28857;&#22823;&#22810;&#38598;&#20013;&#22312;&#25968;&#25454;&#26159;&#20122;&#39640;&#26031;&#25110;&#20122;&#25351;&#25968;&#20998;&#24067;&#30340;&#24773;&#20917;&#12290;&#28982;&#32780;&#65292;&#22312;&#23454;&#36341;&#20013;&#65292;&#26356;&#37325;&#30340;&#23614;&#24052;&#26159;&#26222;&#36941;&#23384;&#22312;&#30340;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#32500;&#24230; $d$ &#19979;&#30340;&#20020;&#30028;&#22686;&#38271;&#36895;&#29575;&#65292;&#36229;&#36807;&#36825;&#20010;&#36895;&#29575;&#39640;&#26031;&#36817;&#20284;&#23601;&#19981;&#20877;&#26377;&#25928;&#12290;&#25105;&#20204;&#29305;&#21035;&#20851;&#27880;&#35266;&#27979;&#37327;&#20855;&#26377;&#30340;&#30697;&#30340;&#25968;&#37327; $m$ &#23545;&#20110;&#36825;&#20123;&#38408;&#20540;&#30340;&#24433;&#21709;&#12290;&#23545;&#20110;&#27599;&#20010; $m\in(2,\infty)$&#65292;&#25105;&#20204;&#26500;&#36896;&#20102;&#22312; $\mathbb{R}^d$ &#20013;&#29420;&#31435;&#21516;&#20998;&#24067;&#30340;&#38543;&#26426;&#21521;&#37327; $\textbf{X}_1,...,\textbf{X}_n$&#65292;&#20854;&#20998;&#37327;&#26159;&#29420;&#31435;&#30340;&#65292;&#24182;&#20855;&#26377;&#19968;&#20010;&#19982; $n$ &#21644; $d$ &#26080;&#20851;&#30340;&#20998;&#24067;&#65292;&#19988;&#20855;&#26377;&#26377;&#38480;&#30340;&#31532; $m$ &#20010;&#32477;&#23545;&#30697;&#12290;&#23545;&#20110;&#36825;&#26679;&#30340;&#21521;&#37327;&#65292;&#22914;&#26524;&#23384;&#22312;&#19968;&#20010; $\varepsilon\in(0,\infty)$&#65292;&#20351;&#24471; $d/n^{m/2-1+\varepsilon}\not\to 0$&#65292;&#37027;&#20040;&#39640;&#26031;&#36817;&#20284;&#35823;&#24046; (Gaussian approximation error, GAE) &#28385;&#36275; $$  \limsup_{n\to\infty}\sup_{t\in\mathbb{R}}\left[\mathbb{P}\left(\max_{1\leq j\le
&lt;/p&gt;
&lt;p&gt;
High-dimensional central limit theorems have been intensively studied with most focus being on the case where the data is sub-Gaussian or sub-exponential. However, heavier tails are omnipresent in practice. In this article, we study the critical growth rates of dimension $d$ below which Gaussian approximations are asymptotically valid but beyond which they are not. We are particularly interested in how these thresholds depend on the number of moments $m$ that the observations possess. For every $m\in(2,\infty)$, we construct i.i.d. random vectors $\textbf{X}_1,...,\textbf{X}_n$ in $\mathbb{R}^d$, the entries of which are independent and have a common distribution (independent of $n$ and $d$) with finite $m$th absolute moment, and such that the following holds: if there exists an $\varepsilon\in(0,\infty)$ such that $d/n^{m/2-1+\varepsilon}\not\to 0$, then the Gaussian approximation error (GAE) satisfies $$  \limsup_{n\to\infty}\sup_{t\in\mathbb{R}}\left[\mathbb{P}\left(\max_{1\leq j\le
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#38750;&#21442;&#25968;&#22238;&#24402;&#19982;&#20108;&#21449;&#25968;&#25454;&#30340;&#35782;&#21035;&#21644;&#20272;&#35745;&#38382;&#39064;&#65292;&#24182;&#25552;&#20986;&#20102;&#36866;&#24403;&#30340;&#26631;&#20934;&#21270;&#26041;&#27861;&#21644;&#20272;&#35745;&#37327;&#30340;&#19968;&#33268;&#24615;&#21644;&#28176;&#36817;&#20998;&#24067;&#65292;&#36890;&#36807;&#33945;&#29305;&#21345;&#32599;&#27169;&#25311;&#35780;&#20272;&#20102;&#20854;&#26377;&#38480;&#26679;&#26412;&#24615;&#36136;&#12290;</title><link>http://arxiv.org/abs/2310.12825</link><description>&lt;p&gt;
&#38750;&#21442;&#25968;&#22238;&#24402;&#19982;&#20108;&#21449;&#25968;&#25454;
&lt;/p&gt;
&lt;p&gt;
Nonparametric Regression with Dyadic Data. (arXiv:2310.12825v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.12825
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#38750;&#21442;&#25968;&#22238;&#24402;&#19982;&#20108;&#21449;&#25968;&#25454;&#30340;&#35782;&#21035;&#21644;&#20272;&#35745;&#38382;&#39064;&#65292;&#24182;&#25552;&#20986;&#20102;&#36866;&#24403;&#30340;&#26631;&#20934;&#21270;&#26041;&#27861;&#21644;&#20272;&#35745;&#37327;&#30340;&#19968;&#33268;&#24615;&#21644;&#28176;&#36817;&#20998;&#24067;&#65292;&#36890;&#36807;&#33945;&#29305;&#21345;&#32599;&#27169;&#25311;&#35780;&#20272;&#20102;&#20854;&#26377;&#38480;&#26679;&#26412;&#24615;&#36136;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#19968;&#20010;&#38750;&#21442;&#25968;&#38750;&#21487;&#20998;&#20108;&#21449;&#27169;&#22411;&#30340;&#35782;&#21035;&#21644;&#20272;&#35745;&#38382;&#39064;&#65292;&#20854;&#20013;&#32467;&#26500;&#20989;&#25968;&#21644;&#19981;&#21487;&#35266;&#27979;&#38543;&#26426;&#39033;&#30340;&#20998;&#24067;&#34987;&#20551;&#35774;&#20026;&#26410;&#30693;&#12290;&#36824;&#25552;&#20986;&#20102;&#19981;&#21487;&#35266;&#27979;&#38543;&#26426;&#39033;&#20998;&#24067;&#30340;&#35782;&#21035;&#21644;&#20272;&#35745;&#26041;&#27861;&#12290;&#25105;&#20551;&#35774;&#32467;&#26500;&#20989;&#25968;&#22312;&#19981;&#21487;&#35266;&#27979;&#24322;&#36136;&#24615;&#19978;&#36830;&#32493;&#19988;&#20005;&#26684;&#36882;&#22686;&#12290;&#25105;&#25552;&#20986;&#20102;&#36866;&#24403;&#30340;&#26631;&#20934;&#21270;&#26041;&#27861;&#26469;&#23454;&#29616;&#35782;&#21035;&#65292;&#36890;&#36807;&#20801;&#35768;&#32467;&#26500;&#20989;&#25968;&#22312;&#19981;&#21487;&#35266;&#27979;&#38543;&#26426;&#39033;&#21450;&#20854;&#19968;&#20123;&#21487;&#35266;&#27979;&#39033;&#19978;&#20855;&#26377;&#19968;&#20123;&#29702;&#24819;&#24615;&#36136;&#65292;&#22914;&#19968;&#27425;&#40784;&#27425;&#24615;&#12290;&#36824;&#25552;&#20986;&#20102;&#20272;&#35745;&#37327;&#30340;&#19968;&#33268;&#24615;&#21644;&#28176;&#36817;&#20998;&#24067;&#12290;&#36890;&#36807;&#33945;&#29305;&#21345;&#32599;&#27169;&#25311;&#35780;&#20272;&#20102;&#25552;&#20986;&#30340;&#20272;&#35745;&#37327;&#30340;&#26377;&#38480;&#26679;&#26412;&#24615;&#36136;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper studies the identification and estimation of a nonparametric nonseparable dyadic model where the structural function and the distribution of the unobservable random terms are assumed to be unknown. The identification and the estimation of the distribution of the unobservable random term are also proposed. I assume that the structural function is continuous and strictly increasing in the unobservable heterogeneity. I propose suitable normalization for the identification by allowing the structural function to have some desirable properties such as homogeneity of degree one in the unobservable random term and some of its observables. The consistency and the asymptotic distribution of the estimators are proposed. The finite sample properties of the proposed estimators in a Monte-Carlo simulation are assessed.
&lt;/p&gt;</description></item><item><title>&#35813;&#30740;&#31350;&#23545;Hotelling&#27861;&#21017;&#36827;&#34892;&#20102;&#37325;&#26032;&#23457;&#35270;&#65292;&#21457;&#29616;&#20854;&#23384;&#22312;&#36923;&#36753;&#32570;&#38519;&#65307;&#36825;&#31181;&#32570;&#38519;&#24517;&#39035;&#22312;&#35299;&#37322;HR&#25552;&#20379;&#30340;&#20215;&#26684;&#39044;&#27979;&#21644;&#35266;&#23519;&#21040;&#30340;&#21382;&#21490;&#20215;&#26684;&#24046;&#24322;&#20043;&#21069;&#34987;&#32771;&#34385;&#21040;&#12290;</title><link>http://arxiv.org/abs/2310.12807</link><description>&lt;p&gt;
&#23545;Hotelling&#27861;&#21017;&#36923;&#36753;&#19981;&#19968;&#33268;&#24615;&#30340;&#27880;&#35299;&#65306;&#20174;&#31995;&#32479;&#20998;&#26512;&#30340;&#35282;&#24230;&#37325;&#26032;&#23457;&#35270;
&lt;/p&gt;
&lt;p&gt;
A note on the logical inconsistency of the Hotelling Rule: A Revisit from the System's Analysis Perspective. (arXiv:2310.12807v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.12807
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#23545;Hotelling&#27861;&#21017;&#36827;&#34892;&#20102;&#37325;&#26032;&#23457;&#35270;&#65292;&#21457;&#29616;&#20854;&#23384;&#22312;&#36923;&#36753;&#32570;&#38519;&#65307;&#36825;&#31181;&#32570;&#38519;&#24517;&#39035;&#22312;&#35299;&#37322;HR&#25552;&#20379;&#30340;&#20215;&#26684;&#39044;&#27979;&#21644;&#35266;&#23519;&#21040;&#30340;&#21382;&#21490;&#20215;&#26684;&#24046;&#24322;&#20043;&#21069;&#34987;&#32771;&#34385;&#21040;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#34987;&#31216;&#20026;&#8220;&#26543;&#31469;&#24615;&#36164;&#28304;&#32463;&#27982;&#30340;&#22522;&#26412;&#21407;&#21017;&#8221;&#30340;&#8220;Hotelling&#27861;&#21017;&#8221;&#23384;&#22312;&#30528;&#19968;&#20010;&#20174;&#26410;&#34987;&#20805;&#20998;&#20851;&#27880;&#30340;&#36923;&#36753;&#32570;&#38519;&#12290;&#22312;&#35797;&#22270;&#35299;&#37322;HR&#25552;&#20379;&#30340;&#20215;&#26684;&#39044;&#27979;&#19982;&#21382;&#21490;&#35266;&#23519;&#21040;&#30340;&#20215;&#26684;&#20043;&#38388;&#30340;&#24046;&#24322;&#20043;&#21069;&#65292;&#24212;&#35813;&#32771;&#34385;&#21040;&#36825;&#20010;&#32570;&#38519;&#12290;&#25105;&#20204;&#30340;&#20998;&#26512;&#38598;&#20013;&#22312;HR&#30340;&#21407;&#22987;&#24418;&#24335;&#19978;&#65292;&#25105;&#20204;&#19981;&#28041;&#21450;&#20854;&#20182;&#26041;&#38754;&#65292;&#22914;&#19981;&#21516;&#30340;&#24320;&#37319;&#25104;&#26412;&#21644;&#21319;&#32423;&#21407;&#22987;&#27169;&#22411;&#30340;&#20854;&#20182;&#26041;&#24335;&#12290;&#25105;&#20204;&#24471;&#20986;&#32467;&#35770;&#65292;HR&#19981;&#33021;&#20174;&#31616;&#21333;&#27169;&#22411;&#20013;&#25512;&#23548;&#20986;&#26469;&#65292;&#22240;&#27492;&#23427;&#24212;&#35813;&#34987;&#29702;&#35299;&#20026;&#33258;&#36523;&#30340;&#20551;&#35774;&#65292;&#32780;&#19981;&#26159;&#20174;&#20854;&#20182;&#26356;&#22522;&#26412;&#30340;&#20551;&#35774;&#20013;&#25512;&#23548;&#20986;&#26469;&#30340;&#35268;&#21017;&#12290;
&lt;/p&gt;
&lt;p&gt;
The "Hotelling rule" (HR) called to be "the fundamental principle of the economics of exhaustible resources" has a logical deficiency which was never paid a sufficient attention to. This deficiency should be taken into account before attempting to explain discrepancies between the price prediction provided by the HR and historically observed prices. Our analysis is focused on the HR in its original form, we do not touch upon other aspects such as varying extraction costs and other ways of upgrading the original model underlying the Hotelling rule. We conclude that HR can not be derived from the simple models as it was claimed, therefore it should be understood as an assumption on its own, and not as a rule derived from other more basic assumptions.
&lt;/p&gt;</description></item><item><title>&#30899;&#30340;&#31038;&#20250;&#25104;&#26412;&#26159;&#36890;&#36807;&#20943;&#23569;&#20108;&#27687;&#21270;&#30899;&#25490;&#25918;&#32780;&#36991;&#20813;&#30340;&#25439;&#23475;&#30340;&#24230;&#37327;&#65292;&#20272;&#35745;&#32422;&#20026;80&#32654;&#20803;/&#21544;&#20108;&#27687;&#21270;&#30899;&#12290;</title><link>http://arxiv.org/abs/2310.12760</link><description>&lt;p&gt;
&#30899;&#30340;&#31038;&#20250;&#25104;&#26412;
&lt;/p&gt;
&lt;p&gt;
The Social Cost of Carbon. (arXiv:2310.12760v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.12760
&lt;/p&gt;
&lt;p&gt;
&#30899;&#30340;&#31038;&#20250;&#25104;&#26412;&#26159;&#36890;&#36807;&#20943;&#23569;&#20108;&#27687;&#21270;&#30899;&#25490;&#25918;&#32780;&#36991;&#20813;&#30340;&#25439;&#23475;&#30340;&#24230;&#37327;&#65292;&#20272;&#35745;&#32422;&#20026;80&#32654;&#20803;/&#21544;&#20108;&#27687;&#21270;&#30899;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#30899;&#30340;&#31038;&#20250;&#25104;&#26412;&#26159;&#36890;&#36807;&#31245;&#24494;&#20943;&#23569;&#20108;&#27687;&#21270;&#30899;&#25490;&#25918;&#32780;&#36991;&#20813;&#30340;&#25439;&#23475;&#12290;&#23427;&#26159;&#34913;&#37327;&#27668;&#20505;&#25919;&#31574;&#26399;&#26395;&#24378;&#24230;&#30340;&#19968;&#20010;&#25351;&#26631;&#12290;&#30899;&#30340;&#31038;&#20250;&#25104;&#26412;&#22240;&#20026;&#38271;&#26399;&#21644;&#22797;&#26434;&#30340;&#22240;&#26524;&#38142;&#20197;&#21450;&#23545;&#24433;&#21709;&#36827;&#34892;&#37327;&#21270;&#21644;&#32858;&#21512;&#32780;&#39640;&#24230;&#19981;&#30830;&#23450;&#65292;&#24433;&#21709;&#30528;&#21487;&#33021;&#30340;&#26410;&#26469;&#33539;&#22260;&#20869;&#30340;&#25152;&#26377;&#20154;&#12290;&#26368;&#36817;&#30340;&#20272;&#35745;&#32422;&#20026;80&#32654;&#20803;/&#21544;&#20108;&#27687;&#21270;&#30899;&#12290;
&lt;/p&gt;
&lt;p&gt;
The social cost of carbon is the damage avoided by slightly reducing carbon dioxide emissions. It is a measure of the desired intensity of climate policy. The social cost of carbon is highly uncertain because of the long and complex cause-effect chain, and because it quantifies and aggregates impacts over a long period of time, affecting all people in a wide range of possible futures. Recent estimates are around $\$$80/tCO$_2$.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#21516;&#36136;&#21270;&#20135;&#21697;&#22312;&#19981;&#21516;&#22312;&#32447;&#24179;&#21488;&#19978;&#30340;&#26222;&#36941;&#20215;&#26684;&#20998;&#25955;&#29616;&#35937;&#65292;&#21457;&#29616;&#20215;&#26684;&#22312;&#19981;&#21516;&#39044;&#35746;&#32593;&#31449;&#20043;&#38388;&#23384;&#22312;&#36739;&#22823;&#24046;&#24322;&#65292;&#19988;&#20215;&#26684;&#20998;&#25955;&#22312;&#39044;&#35746;&#26085;&#26399;&#38752;&#36817;&#20837;&#20303;&#26085;&#26399;&#26102;&#20173;&#28982;&#23384;&#22312;&#12290;&#36890;&#36807;&#26500;&#24314;&#29702;&#35770;&#27169;&#22411;&#65292;&#25105;&#20204;&#35299;&#37322;&#20102;&#20215;&#26684;&#20998;&#25955;&#29616;&#35937;&#30340;&#21407;&#22240;&#65292;&#24182;&#25351;&#20986;&#22312;&#23384;&#22312;&#24635;&#38656;&#27714;&#19981;&#30830;&#23450;&#24615;&#21644;&#23481;&#37327;&#38480;&#21046;&#30340;&#24773;&#20917;&#19979;&#65292;&#20215;&#26684;&#20998;&#25955;&#20173;&#28982;&#21487;&#33021;&#23384;&#22312;&#12290;</title><link>http://arxiv.org/abs/2310.12341</link><description>&lt;p&gt;
&#22312;&#32447;&#24179;&#21488;&#19978;&#30340;&#20215;&#26684;&#20998;&#25955;&#65306;&#26469;&#33258;&#20262;&#25958;&#65288;&#33521;&#22269;&#65289;&#37202;&#24215;&#25151;&#20215;&#30340;&#35777;&#25454;
&lt;/p&gt;
&lt;p&gt;
Price dispersion across online platforms: Evidence from hotel room prices in London (UK). (arXiv:2310.12341v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.12341
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#21516;&#36136;&#21270;&#20135;&#21697;&#22312;&#19981;&#21516;&#22312;&#32447;&#24179;&#21488;&#19978;&#30340;&#26222;&#36941;&#20215;&#26684;&#20998;&#25955;&#29616;&#35937;&#65292;&#21457;&#29616;&#20215;&#26684;&#22312;&#19981;&#21516;&#39044;&#35746;&#32593;&#31449;&#20043;&#38388;&#23384;&#22312;&#36739;&#22823;&#24046;&#24322;&#65292;&#19988;&#20215;&#26684;&#20998;&#25955;&#22312;&#39044;&#35746;&#26085;&#26399;&#38752;&#36817;&#20837;&#20303;&#26085;&#26399;&#26102;&#20173;&#28982;&#23384;&#22312;&#12290;&#36890;&#36807;&#26500;&#24314;&#29702;&#35770;&#27169;&#22411;&#65292;&#25105;&#20204;&#35299;&#37322;&#20102;&#20215;&#26684;&#20998;&#25955;&#29616;&#35937;&#30340;&#21407;&#22240;&#65292;&#24182;&#25351;&#20986;&#22312;&#23384;&#22312;&#24635;&#38656;&#27714;&#19981;&#30830;&#23450;&#24615;&#21644;&#23481;&#37327;&#38480;&#21046;&#30340;&#24773;&#20917;&#19979;&#65292;&#20215;&#26684;&#20998;&#25955;&#20173;&#28982;&#21487;&#33021;&#23384;&#22312;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#21363;&#20351;&#28040;&#36153;&#32773;&#21487;&#20197;&#36731;&#26494;&#20174;&#27604;&#36739;&#32593;&#31449;&#33719;&#21462;&#20215;&#26684;&#20449;&#24687;&#65292;&#20294;&#21516;&#36136;&#21270;&#20135;&#21697;&#22312;&#19981;&#21516;&#22312;&#32447;&#24179;&#21488;&#19978;&#30340;&#26222;&#36941;&#20215;&#26684;&#20998;&#25955;&#29616;&#35937;&#12290;&#25105;&#20204;&#25910;&#38598;&#20102;&#20262;&#25958;&#24066;&#26368;&#21463;&#27426;&#36814;&#30340;200&#23478;&#37202;&#24215;&#30340;&#25968;&#25454;&#65292;&#24182;&#21457;&#29616;&#22312;&#39044;&#35746;&#37202;&#24215;&#25151;&#38388;&#26102;&#65292;&#20215;&#26684;&#22312;&#19981;&#21516;&#39044;&#35746;&#32593;&#31449;&#20043;&#38388;&#23384;&#22312;&#36739;&#22823;&#24046;&#24322;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#21457;&#29616;&#22312;&#39044;&#35746;&#26085;&#26399;&#38752;&#36817;&#20837;&#20303;&#26085;&#26399;&#26102;&#65292;&#19981;&#21516;&#24179;&#21488;&#19978;&#30340;&#20215;&#26684;&#36235;&#20110;&#19968;&#33268;&#12290;&#28982;&#32780;&#65292;&#20215;&#26684;&#20998;&#25955;&#20173;&#28982;&#23384;&#22312;&#30452;&#21040;&#20837;&#20303;&#26085;&#26399;&#65292;&#24847;&#21619;&#30528;&#8220;&#19968;&#20215;&#27861;&#21017;&#8221;&#19981;&#25104;&#31435;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#31616;&#21333;&#30340;&#29702;&#35770;&#27169;&#22411;&#26469;&#35299;&#37322;&#36825;&#19968;&#29616;&#35937;&#65292;&#24182;&#34920;&#26126;&#22312;&#23384;&#22312;&#24635;&#38656;&#27714;&#19981;&#30830;&#23450;&#24615;&#21644;&#23481;&#37327;&#38480;&#21046;&#30340;&#24773;&#20917;&#19979;&#65292;&#21363;&#20351;&#20135;&#21697;&#26159;&#21516;&#36136;&#21270;&#30340;&#65292;&#28040;&#36153;&#32773;&#26159;&#21516;&#36136;&#21270;&#30340;&#65292;&#25152;&#26377;&#21442;&#19982;&#32773;&#37117;&#23545;&#24066;&#22330;&#32467;&#26500;&#25317;&#26377;&#23436;&#32654;&#20449;&#24687;&#65292;&#28040;&#36153;&#32773;&#33719;&#24471;&#20135;&#21697;&#20449;&#24687;&#26080;&#38656;&#20184;&#20986;&#25104;&#26412;&#65292;&#20215;&#26684;&#20998;&#25955;&#20173;&#21487;&#33021;&#23384;&#22312;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper studies the widespread price dispersion of homogeneous products across different online platforms, even when consumers can easily access price information from comparison websites. We collect data for the 200 most popular hotels in London (UK) and document that prices vary widely across booking sites while making reservations for a hotel room. Additionally, we find that prices listed across different platforms tend to converge as the booking date gets closer to the date of stay. However, the price dispersion persists until the date of stay, implying that the "law of one price" does not hold. We present a simple theoretical model to explain this and show that in the presence of aggregate demand uncertainty and capacity constraints, price dispersion could exist even when products are homogeneous, consumers are homogeneous, all agents have perfect information about the market structure, and consumers face no search costs to acquire information about the products. Our theoretica
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#24320;&#21457;&#20102;&#19968;&#20010;&#31163;&#25955;&#36873;&#25321;&#27169;&#22411;&#65292;&#23558;&#21516;&#20276;&#24433;&#21709;&#32435;&#20837;&#20559;&#22909;&#21644;&#32771;&#34385;&#38598;&#65292;&#21033;&#29992;&#19981;&#21516;&#31867;&#22411;&#30340;&#21464;&#21270;&#21306;&#20998;&#21516;&#20276;&#24433;&#21709;&#65292;&#24182;&#24674;&#22797;&#32593;&#32476;&#20013;&#20195;&#29702;&#20043;&#38388;&#30340;&#36830;&#25509;&#38598;&#21512;&#21644;&#31867;&#22411;&#65292;&#38750;&#21442;&#25968;&#35782;&#21035;&#32467;&#26524;&#20801;&#35768;&#20195;&#29702;&#20154;&#20043;&#38388;&#30340;&#26080;&#38480;&#24322;&#36136;&#24615;&#65292;&#24182;&#24212;&#29992;&#20110;&#21654;&#21857;&#36830;&#38145;&#24215;&#30340;&#25193;&#24352;&#20915;&#31574;&#12290;</title><link>http://arxiv.org/abs/2310.12272</link><description>&lt;p&gt;
&#32771;&#34385;&#21644;&#20559;&#22909;&#20013;&#30340;&#21516;&#20276;&#24433;&#21709;
&lt;/p&gt;
&lt;p&gt;
Peer Effects in Consideration and Preferences. (arXiv:2310.12272v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.12272
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#24320;&#21457;&#20102;&#19968;&#20010;&#31163;&#25955;&#36873;&#25321;&#27169;&#22411;&#65292;&#23558;&#21516;&#20276;&#24433;&#21709;&#32435;&#20837;&#20559;&#22909;&#21644;&#32771;&#34385;&#38598;&#65292;&#21033;&#29992;&#19981;&#21516;&#31867;&#22411;&#30340;&#21464;&#21270;&#21306;&#20998;&#21516;&#20276;&#24433;&#21709;&#65292;&#24182;&#24674;&#22797;&#32593;&#32476;&#20013;&#20195;&#29702;&#20043;&#38388;&#30340;&#36830;&#25509;&#38598;&#21512;&#21644;&#31867;&#22411;&#65292;&#38750;&#21442;&#25968;&#35782;&#21035;&#32467;&#26524;&#20801;&#35768;&#20195;&#29702;&#20154;&#20043;&#38388;&#30340;&#26080;&#38480;&#24322;&#36136;&#24615;&#65292;&#24182;&#24212;&#29992;&#20110;&#21654;&#21857;&#36830;&#38145;&#24215;&#30340;&#25193;&#24352;&#20915;&#31574;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#20010;&#19968;&#33324;&#30340;&#31163;&#25955;&#36873;&#25321;&#27169;&#22411;&#65292;&#23558;&#21516;&#20276;&#24433;&#21709;&#32435;&#20837;&#20559;&#22909;&#21644;&#32771;&#34385;&#38598;&#20013;&#12290;&#25105;&#20204;&#23545;&#24179;&#34913;&#34892;&#20026;&#36827;&#34892;&#25551;&#36848;&#65292;&#24182;&#24314;&#31435;&#20102;&#19968;&#31995;&#21015;&#36873;&#25321;&#20013;&#33021;&#24674;&#22797;&#27169;&#22411;&#21508;&#20010;&#37096;&#20998;&#30340;&#26465;&#20214;&#12290;&#25105;&#20204;&#20801;&#35768;&#21516;&#20276;&#24433;&#21709;&#21482;&#20316;&#29992;&#20110;&#20559;&#22909;&#12289;&#21482;&#20316;&#29992;&#20110;&#32771;&#34385;&#65292;&#25110;&#32773;&#21516;&#26102;&#20316;&#29992;&#20110;&#20004;&#32773;&#12290;&#25105;&#20204;&#21033;&#29992;&#19981;&#21516;&#31867;&#22411;&#30340;&#21464;&#21270;&#26469;&#21306;&#20998;&#20559;&#22909;&#21644;&#32771;&#34385;&#38598;&#20013;&#30340;&#21516;&#20276;&#24433;&#21709;&#12290;&#36825;&#20351;&#25105;&#20204;&#33021;&#22815;&#24674;&#22797;&#32593;&#32476;&#20013;&#20195;&#29702;&#20043;&#38388;&#30340;&#36830;&#25509;&#38598;&#21512;&#65288;&#21644;&#31867;&#22411;&#65289;&#12290;&#28982;&#21518;&#25105;&#20204;&#21033;&#29992;&#36825;&#20123;&#20449;&#24687;&#26469;&#24674;&#22797;&#27599;&#20010;&#20195;&#29702;&#20154;&#30340;&#38543;&#26426;&#20559;&#22909;&#21644;&#27880;&#24847;&#26426;&#21046;&#12290;&#36825;&#20123;&#38750;&#21442;&#25968;&#35782;&#21035;&#32467;&#26524;&#20801;&#35768;&#20195;&#29702;&#20154;&#20043;&#38388;&#30340;&#26080;&#38480;&#24322;&#36136;&#24615;&#65292;&#24182;&#19981;&#20381;&#36182;&#20110;&#21327;&#21464;&#37327;&#25110;&#21487;&#29992;&#36873;&#39033;&#65288;&#25110;&#33756;&#21333;&#65289;&#30340;&#21464;&#21270;&#12290;&#25105;&#20204;&#23558;&#25105;&#20204;&#30340;&#32467;&#26524;&#24212;&#29992;&#20110;&#21654;&#21857;&#36830;&#38145;&#24215;&#30340;&#25193;&#24352;&#20915;&#31574;&#65292;&#24182;&#21457;&#29616;&#26377;&#38480;&#30340;&#32771;&#34385;&#35777;&#25454;&#12290;&#25105;&#20204;&#36827;&#34892;&#20102;&#21453;&#20107;&#23454;&#39044;&#27979;&#27169;&#25311;&#65292;&#24182;&#23637;&#31034;&#20102;&#26377;&#38480;&#30340;&#32771;&#34385;&#22914;&#20309;&#24433;&#21709;&#20915;&#31574;&#12290;
&lt;/p&gt;
&lt;p&gt;
We develop a general model of discrete choice that incorporates peer effects in preferences and consideration sets. We characterize the equilibrium behavior and establish conditions under which all parts of the model can be recovered from a sequence of choices. We allow peers to affect only preferences, only consideration, or both. We exploit different types of variations to separate the peer effects in preferences and consideration sets. This allows us to recover the set (and type) of connections between the agents in the network. We then use this information to recover the random preferences and the attention mechanisms of each agent. These nonparametric identification results allow unrestricted heterogeneity across agents and do not rely on the variation of either covariates or the set of available options (or menus). We apply our results to model expansion decisions by coffee chains and find evidence of limited consideration. We simulate counterfactual predictions and show how limi
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#36866;&#29992;&#20110;&#22810;&#20195;&#24065;&#30340;Walrasian&#25293;&#21334;&#38382;&#39064;&#30340;&#35299;&#20915;&#26041;&#26696;&#65292;&#35813;&#26041;&#26696;&#22522;&#20110;Brouwer&#30340;&#19981;&#21160;&#28857;&#23450;&#29702;&#65292;&#33021;&#22815;&#25191;&#34892;&#25152;&#26377;&#35746;&#21333;&#24182;&#36827;&#34892;&#26368;&#20248;&#30340;AMMs&#20132;&#25442;&#12290;</title><link>http://arxiv.org/abs/2310.12255</link><description>&lt;p&gt;
&#36866;&#29992;&#20110;&#22810;&#20195;&#24065;&#30340;Walrasian&#25293;&#21334;&#38382;&#39064;&#30340;&#35299;&#20915;&#26041;&#26696;&#19982;AMMs
&lt;/p&gt;
&lt;p&gt;
A solution to walrasian auctions for many tokens with AMMs available. (arXiv:2310.12255v1 [q-fin.MF])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.12255
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#36866;&#29992;&#20110;&#22810;&#20195;&#24065;&#30340;Walrasian&#25293;&#21334;&#38382;&#39064;&#30340;&#35299;&#20915;&#26041;&#26696;&#65292;&#35813;&#26041;&#26696;&#22522;&#20110;Brouwer&#30340;&#19981;&#21160;&#28857;&#23450;&#29702;&#65292;&#33021;&#22815;&#25191;&#34892;&#25152;&#26377;&#35746;&#21333;&#24182;&#36827;&#34892;&#26368;&#20248;&#30340;AMMs&#20132;&#25442;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#32771;&#34385;&#26576;&#19968;&#29366;&#24577;&#19979;&#26377;&#38480;&#25968;&#37327;&#30340;&#20132;&#26131;&#35746;&#21333;&#21644;&#33258;&#21160;&#24066;&#22330;&#21046;&#36896;&#21830;&#65288;AMMs&#65289;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#35299;&#20915;&#26041;&#26696;&#65292;&#29992;&#20110;&#25214;&#21040;&#19968;&#20010;&#22343;&#34913;&#20215;&#26684;&#21521;&#37327;&#65292;&#20197;&#20415;&#19982;&#30456;&#24212;&#30340;&#26368;&#20248;AMMs&#20132;&#25442;&#19968;&#36215;&#25191;&#34892;&#25152;&#26377;&#35746;&#21333;&#12290;&#35813;&#35299;&#20915;&#26041;&#26696;&#22522;&#20110;Brouwer&#30340;&#19981;&#21160;&#28857;&#23450;&#29702;&#12290;&#25105;&#20204;&#35752;&#35770;&#20102;&#19982;&#20844;&#20849;&#21306;&#22359;&#38142;&#27963;&#21160;&#20013;&#30340;&#23454;&#38469;&#24773;&#20917;&#30456;&#20851;&#30340;&#35745;&#31639;&#26041;&#38754;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;
Consider a finite set of trade orders and automated market makers (AMMs) at some state. We propose a solution to the problem of finding an equilibrium price vector to execute all the orders jointly with corresponding optimal AMMs swaps. The solution is based on Brouwer's fixed-point theorem. We discuss computational aspects relevant for realistic situations in public blockchain activity.
&lt;/p&gt;</description></item><item><title>DeepVol&#26159;&#19968;&#31181;&#29992;&#20110;&#36890;&#29992;&#36164;&#20135;&#27874;&#21160;&#24615;&#24314;&#27169;&#30340;&#28145;&#24230;&#36801;&#31227;&#23398;&#20064;&#26041;&#27861;&#65292;&#36890;&#36807;&#19968;&#20010;&#36890;&#29992;&#27169;&#22411;&#26377;&#25928;&#22320;&#25429;&#25417;&#21644;&#24314;&#27169;&#25152;&#26377;&#37329;&#34701;&#36164;&#20135;&#30340;&#27874;&#21160;&#24615;&#21160;&#24577;&#65292;&#21487;&#33021;&#25913;&#21464;&#23545;&#27874;&#21160;&#24615;&#30340;&#29702;&#35299;&#21644;&#39044;&#27979;&#26041;&#24335;&#12290;</title><link>http://arxiv.org/abs/2309.02072</link><description>&lt;p&gt;
DeepVol&#65306;&#19968;&#31181;&#29992;&#20110;&#36890;&#29992;&#36164;&#20135;&#27874;&#21160;&#24615;&#24314;&#27169;&#30340;&#28145;&#24230;&#36801;&#31227;&#23398;&#20064;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
DeepVol: A Deep Transfer Learning Approach for Universal Asset Volatility Modeling. (arXiv:2309.02072v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.02072
&lt;/p&gt;
&lt;p&gt;
DeepVol&#26159;&#19968;&#31181;&#29992;&#20110;&#36890;&#29992;&#36164;&#20135;&#27874;&#21160;&#24615;&#24314;&#27169;&#30340;&#28145;&#24230;&#36801;&#31227;&#23398;&#20064;&#26041;&#27861;&#65292;&#36890;&#36807;&#19968;&#20010;&#36890;&#29992;&#27169;&#22411;&#26377;&#25928;&#22320;&#25429;&#25417;&#21644;&#24314;&#27169;&#25152;&#26377;&#37329;&#34701;&#36164;&#20135;&#30340;&#27874;&#21160;&#24615;&#21160;&#24577;&#65292;&#21487;&#33021;&#25913;&#21464;&#23545;&#27874;&#21160;&#24615;&#30340;&#29702;&#35299;&#21644;&#39044;&#27979;&#26041;&#24335;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#26032;&#30340;&#28145;&#24230;&#23398;&#20064;&#27874;&#21160;&#24615;&#27169;&#22411;DeepVol&#65292;&#23427;&#22312;&#27169;&#22411;&#30340;&#24191;&#27867;&#24615;&#26041;&#38754;&#20248;&#20110;&#20256;&#32479;&#30340;&#35745;&#37327;&#32463;&#27982;&#27169;&#22411;&#12290;DeepVol&#21033;&#29992;&#36801;&#31227;&#23398;&#20064;&#30340;&#33021;&#21147;&#65292;&#36890;&#36807;&#19968;&#20010;&#36890;&#29992;&#27169;&#22411;&#26377;&#25928;&#22320;&#25429;&#25417;&#21644;&#24314;&#27169;&#25152;&#26377;&#37329;&#34701;&#36164;&#20135;&#30340;&#27874;&#21160;&#24615;&#21160;&#24577;&#65292;&#21253;&#25324;&#20197;&#21069;&#26410;&#35265;&#36807;&#30340;&#36164;&#20135;&#12290;&#36825;&#19982;&#35745;&#37327;&#32463;&#27982;&#23398;&#25991;&#29486;&#20013;&#30340;&#20027;&#27969;&#20570;&#27861;&#24418;&#25104;&#40092;&#26126;&#23545;&#27604;&#65292;&#21518;&#32773;&#38656;&#35201;&#20026;&#19981;&#21516;&#25968;&#25454;&#38598;&#35757;&#32451;&#21333;&#29420;&#30340;&#27169;&#22411;&#12290;&#24341;&#20837;DeepVol&#20026;&#37329;&#34701;&#34892;&#19994;&#30340;&#27874;&#21160;&#24615;&#24314;&#27169;&#21644;&#39044;&#27979;&#24320;&#36767;&#20102;&#26032;&#30340;&#36884;&#24452;&#65292;&#21487;&#33021;&#20250;&#25913;&#21464;&#23545;&#27874;&#21160;&#24615;&#30340;&#29702;&#35299;&#21644;&#39044;&#27979;&#26041;&#24335;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper introduces DeepVol, a promising new deep learning volatility model that outperforms traditional econometric models in terms of model generality. DeepVol leverages the power of transfer learning to effectively capture and model the volatility dynamics of all financial assets, including previously unseen ones, using a single universal model. This contrasts to the prevailing practice in econometrics literature, which necessitates training separate models for individual datasets. The introduction of DeepVol opens up new avenues for volatility modeling and forecasting in the finance industry, potentially transforming the way volatility is understood and predicted.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#20998;&#26512;&#20102;&#33487;&#26684;&#20848;1,079&#20010;&#22320;&#26041;&#25919;&#24220;STV&#36873;&#20030;&#65292;&#21457;&#29616;&#20854;&#20013;41&#27425;&#20986;&#29616;&#26576;&#31181;&#21333;&#35843;&#24615;&#24322;&#24120;&#65292;&#19988;&#36825;&#20123;&#24322;&#24120;&#29575;&#19982;&#20043;&#21069;&#30340;&#32463;&#39564;&#30740;&#31350;&#30456;&#20284;&#65292;&#36828;&#20302;&#20110;&#22823;&#22810;&#25968;&#29702;&#35770;&#30740;&#31350;&#21457;&#29616;&#30340;&#24322;&#24120;&#29575;&#12290;</title><link>http://arxiv.org/abs/2305.17741</link><description>&lt;p&gt;
&#33487;&#26684;&#20848;&#22320;&#26041;&#25919;&#24220;&#36873;&#20030;&#20013;&#30340;&#21333;&#35843;&#24615;&#24322;&#24120;&#29616;&#35937;
&lt;/p&gt;
&lt;p&gt;
Monotonicity Anomalies in Scottish Local Government Elections. (arXiv:2305.17741v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.17741
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#20998;&#26512;&#20102;&#33487;&#26684;&#20848;1,079&#20010;&#22320;&#26041;&#25919;&#24220;STV&#36873;&#20030;&#65292;&#21457;&#29616;&#20854;&#20013;41&#27425;&#20986;&#29616;&#26576;&#31181;&#21333;&#35843;&#24615;&#24322;&#24120;&#65292;&#19988;&#36825;&#20123;&#24322;&#24120;&#29575;&#19982;&#20043;&#21069;&#30340;&#32463;&#39564;&#30740;&#31350;&#30456;&#20284;&#65292;&#36828;&#20302;&#20110;&#22823;&#22810;&#25968;&#29702;&#35770;&#30740;&#31350;&#21457;&#29616;&#30340;&#24322;&#24120;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21333;&#19968;&#21487;&#36716;&#31227;&#36873;&#31080;&#65288;STV&#65289;&#25237;&#31080;&#26041;&#27861;&#29992;&#20110;&#36873;&#20030;&#25490;&#21517;&#36873;&#20030;&#20013;&#30340;&#22810;&#20010;&#20505;&#36873;&#20154;&#12290;STV&#30340;&#19968;&#20010;&#24369;&#28857;&#26159;&#23427;&#26410;&#33021;&#36890;&#36807;&#19982;&#21333;&#35843;&#24615;&#21644;&#26080;&#34920;&#20915;&#24726;&#35770;&#30456;&#20851;&#30340;&#22810;&#20010;&#20844;&#24179;&#26631;&#20934;&#12290;&#25105;&#20204;&#20998;&#26512;&#20102;&#33487;&#26684;&#20848;1,079&#20010;&#22320;&#26041;&#25919;&#24220;STV&#36873;&#20030;&#65292;&#20197;&#20272;&#35745;&#29616;&#23454;&#19990;&#30028;&#36873;&#20030;&#20013;&#27492;&#31867;&#21333;&#35843;&#24615;&#24322;&#24120;&#30340;&#39057;&#29575;&#65292;&#24182;&#23558;&#32467;&#26524;&#19982;&#20851;&#20110;&#27492;&#31867;&#24322;&#24120;&#20986;&#29616;&#29575;&#30340;&#20808;&#21069;&#32463;&#39564;&#21644;&#29702;&#35770;&#30740;&#31350;&#36827;&#34892;&#27604;&#36739;&#12290;&#22312;1079&#27425;&#36873;&#20030;&#20013;&#65292;&#25105;&#20204;&#21457;&#29616;41&#27425;&#20986;&#29616;&#26576;&#31181;&#21333;&#35843;&#24615;&#24322;&#24120;&#12290;&#25105;&#20204;&#36890;&#24120;&#21457;&#29616;&#24322;&#24120;&#29575;&#19982;&#20043;&#21069;&#30340;&#32463;&#39564;&#30740;&#31350;&#30456;&#20284;&#65292;&#36828;&#20302;&#20110;&#22823;&#22810;&#25968;&#29702;&#35770;&#30740;&#31350;&#21457;&#29616;&#30340;&#24322;&#24120;&#29575;&#12290;&#25105;&#20204;&#21457;&#29616;&#30340;&#22823;&#22810;&#25968;STV&#24322;&#24120;&#37117;&#26159;&#31532;&#19968;&#27425;&#22312;&#23454;&#38469;&#36873;&#20030;&#20013;&#35760;&#24405;&#21040;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
The single transferable vote (STV) voting method is used to elect multiple candidates in ranked-choice elections. One weakness of STV is that it fails multiple fairness criteria related to monotonicity and no-show paradoxes. We analyze 1,079 local government STV elections in Scotland to estimate the frequency of such monotonicity anomalies in real-world elections, and compare our results with prior empirical and theoretical research about the rates at which such anomalies occur. In 41 of the 1079 elections we found some kind of monotonicity anomaly. We generally find that the rates of anomalies are similar to prior empirical research and much lower than what most theoretical research has found. Most of the STV anomalies we find are the first of their kind to be documented in real-world elections.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#38024;&#23545;&#20855;&#26377;&#21452;&#21521;&#22266;&#23450;&#25928;&#24212;&#30340;&#21160;&#24577;&#38750;&#32447;&#24615;&#27169;&#22411;&#30340;&#20998;&#26512;&#20559;&#24046;&#26657;&#27491;&#26041;&#27861;&#65292;&#36890;&#36807;&#26657;&#27491;&#21518;&#30340;&#20284;&#28982;&#20989;&#25968;&#24471;&#20986;&#30340;&#26816;&#39564;&#32479;&#35745;&#37327;&#21487;&#20197;&#24471;&#21040;&#26631;&#20934;&#28176;&#36817;&#20998;&#24067;&#65292;&#21516;&#26102;&#20063;&#21487;&#20197;&#24471;&#21040;&#32467;&#26500;&#21442;&#25968;&#30340;&#20559;&#24046;&#26657;&#27491;&#20272;&#35745;&#22120;&#12290;</title><link>http://arxiv.org/abs/2305.03134</link><description>&lt;p&gt;
&#20855;&#26377;&#21452;&#21521;&#22266;&#23450;&#25928;&#24212;&#30340;&#21160;&#24577;&#38750;&#32447;&#24615;&#27169;&#22411;&#30340;&#26080;&#20559;&#25512;&#26029;
&lt;/p&gt;
&lt;p&gt;
Debiased inference for dynamic nonlinear models with two-way fixed effects. (arXiv:2305.03134v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.03134
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#38024;&#23545;&#20855;&#26377;&#21452;&#21521;&#22266;&#23450;&#25928;&#24212;&#30340;&#21160;&#24577;&#38750;&#32447;&#24615;&#27169;&#22411;&#30340;&#20998;&#26512;&#20559;&#24046;&#26657;&#27491;&#26041;&#27861;&#65292;&#36890;&#36807;&#26657;&#27491;&#21518;&#30340;&#20284;&#28982;&#20989;&#25968;&#24471;&#20986;&#30340;&#26816;&#39564;&#32479;&#35745;&#37327;&#21487;&#20197;&#24471;&#21040;&#26631;&#20934;&#28176;&#36817;&#20998;&#24067;&#65292;&#21516;&#26102;&#20063;&#21487;&#20197;&#24471;&#21040;&#32467;&#26500;&#21442;&#25968;&#30340;&#20559;&#24046;&#26657;&#27491;&#20272;&#35745;&#22120;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38754;&#26495;&#25968;&#25454;&#27169;&#22411;&#36890;&#24120;&#20351;&#29992;&#22266;&#23450;&#25928;&#24212;&#26469;&#35299;&#37322;&#26410;&#35266;&#27979;&#21040;&#30340;&#24322;&#36136;&#24615;&#12290;&#36825;&#20123;&#22266;&#23450;&#25928;&#24212;&#36890;&#24120;&#26159;&#20598;&#28982;&#21442;&#25968;&#65292;&#23427;&#20204;&#30340;&#20272;&#35745;&#22120;&#30456;&#23545;&#20110;&#26679;&#26412;&#22823;&#23567;&#30340;&#24179;&#26041;&#26681;&#25910;&#25947;&#32531;&#24930;&#12290;&#22312;&#26368;&#22823;&#20284;&#28982;&#30340;&#19978;&#19979;&#25991;&#20013;&#65292;&#36825;&#20250;&#23548;&#33268;&#20284;&#28982;&#20989;&#25968;&#30340;&#28176;&#36817;&#20559;&#24046;&#12290;&#22240;&#27492;&#65292;&#20174;&#28176;&#36817;&#26377;&#20559;&#30340;&#20284;&#28982;&#20989;&#25968;&#24471;&#20986;&#30340;&#26816;&#39564;&#32479;&#35745;&#37327;&#19981;&#20877;&#36981;&#24490;&#20854;&#26631;&#20934;&#26497;&#38480;&#20998;&#24067;&#12290;&#36825;&#20250;&#23548;&#33268;&#26816;&#39564;&#22823;&#23567;&#30340;&#20005;&#37325;&#20559;&#24046;&#12290;&#25105;&#20204;&#32771;&#34385;&#19968;&#31867;&#20855;&#26377;&#21452;&#21521;&#22266;&#23450;&#25928;&#24212;&#30340;&#21160;&#24577;&#38750;&#32447;&#24615;&#27169;&#22411;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#20284;&#28982;&#20989;&#25968;&#30340;&#20998;&#26512;&#20559;&#24046;&#26657;&#27491;&#26041;&#27861;&#12290;&#25105;&#20204;&#27491;&#24335;&#35777;&#26126;&#20102;&#20174;&#26657;&#27491;&#21518;&#30340;&#20284;&#28982;&#20989;&#25968;&#24471;&#20986;&#30340;&#20284;&#28982;&#27604;&#12289;&#25289;&#26684;&#26391;&#26085;&#20056;&#25968;&#12289;&#21644; Wald &#26816;&#39564;&#32479;&#35745;&#37327;&#36981;&#24490;&#23427;&#20204;&#30340;&#26631;&#20934;&#28176;&#36817;&#20998;&#24067;&#12290;&#20316;&#20026;&#21103;&#20135;&#21697;&#65292;&#26657;&#27491;&#21518;&#30340;&#20284;&#28982;&#20989;&#25968;&#36824;&#21487;&#20197;&#24471;&#20986;&#32467;&#26500;&#21442;&#25968;&#30340;&#20559;&#24046;&#26657;&#27491;&#20272;&#35745;&#22120;&#12290;&#25105;&#20204;&#35780;&#20272;&#20102;&#35813;&#26041;&#27861;&#22312; Monte Carlo &#27169;&#25311;&#20013;&#30340;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;
Panel data models often use fixed effects to account for unobserved heterogeneities. These fixed effects are typically incidental parameters and their estimators converge slowly relative to the square root of the sample size. In the maximum likelihood context, this induces an asymptotic bias of the likelihood function. Test statistics derived from the asymptotically biased likelihood, therefore, no longer follow their standard limiting distributions. This causes severe distortions in test sizes. We consider a generic class of dynamic nonlinear models with two-way fixed effects and propose an analytical bias correction method for the likelihood function. We formally show that the likelihood ratio, the Lagrange-multiplier, and the Wald test statistics derived from the corrected likelihood follow their standard asymptotic distributions. As a by-product, a bias-corrected estimator of the structural parameter can also be derived from the corrected likelihood function. We evaluate the perfor
&lt;/p&gt;</description></item><item><title>&#23384;&#22312;&#20854;&#20182;&#30340;&#26356;&#26032;&#35268;&#21017;&#21487;&#20197;&#20351;&#20449;&#24687;&#30340;&#20215;&#20540;&#21464;&#20026;&#27491;&#20540;&#65292;&#20316;&#32773;&#25214;&#21040;&#20102;&#25152;&#26377;&#36825;&#20123;&#35268;&#21017;&#12290;</title><link>http://arxiv.org/abs/2302.13956</link><description>&lt;p&gt;
Bayes = Blackwell, &#24046;&#19981;&#22810;&#12290;
&lt;/p&gt;
&lt;p&gt;
Bayes = Blackwell, Almost. (arXiv:2302.13956v3 [econ.TH] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2302.13956
&lt;/p&gt;
&lt;p&gt;
&#23384;&#22312;&#20854;&#20182;&#30340;&#26356;&#26032;&#35268;&#21017;&#21487;&#20197;&#20351;&#20449;&#24687;&#30340;&#20215;&#20540;&#21464;&#20026;&#27491;&#20540;&#65292;&#20316;&#32773;&#25214;&#21040;&#20102;&#25152;&#26377;&#36825;&#20123;&#35268;&#21017;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#23384;&#22312;&#30528;&#38500;&#20102;Bayes'&#23450;&#24459;&#20043;&#22806;&#30340;&#26356;&#26032;&#35268;&#21017;&#65292;&#21487;&#20197;&#20351;&#20449;&#24687;&#30340;&#20215;&#20540;&#21464;&#20026;&#27491;&#20540;&#12290;&#25105;&#25214;&#21040;&#20102;&#25152;&#26377;&#36825;&#20123;&#35268;&#21017;&#12290;
&lt;/p&gt;
&lt;p&gt;
There are updating rules other than Bayes' law that render the value of information positive. I find all of them.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20379;&#20102;&#19968;&#20010;&#22522;&#26412;&#29702;&#35770;&#65292;&#30740;&#31350;&#20102;&#24102;&#26377;&#39640;&#38454;&#20449;&#24687;&#30340;&#26399;&#26435;&#24066;&#22330;&#20013;&#20215;&#26684;&#30340;&#21457;&#29616;&#26426;&#21046;&#12290;&#19982;&#27492;&#21516;&#26102;&#65292;&#35813;&#30740;&#31350;&#36824;&#20197;&#20869;&#24149;&#20132;&#26131;&#30340;&#24418;&#24335;&#21576;&#29616;&#20102;&#20854;&#20013;&#30340;&#29305;&#20363;&#65292;&#32473;&#20986;&#20102;&#36890;&#36135;&#33192;&#32960;&#38656;&#27714;&#12289;&#20215;&#26684;&#20914;&#20987;&#21644;&#20449;&#24687;&#25928;&#29575;&#30340;&#38381;&#24335;&#35299;&#12290;</title><link>http://arxiv.org/abs/2302.13426</link><description>&lt;p&gt;
&#26399;&#26435;&#30340;&#20215;&#26684;&#21457;&#29616;
&lt;/p&gt;
&lt;p&gt;
Price Discovery for Derivatives. (arXiv:2302.13426v5 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2302.13426
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20379;&#20102;&#19968;&#20010;&#22522;&#26412;&#29702;&#35770;&#65292;&#30740;&#31350;&#20102;&#24102;&#26377;&#39640;&#38454;&#20449;&#24687;&#30340;&#26399;&#26435;&#24066;&#22330;&#20013;&#20215;&#26684;&#30340;&#21457;&#29616;&#26426;&#21046;&#12290;&#19982;&#27492;&#21516;&#26102;&#65292;&#35813;&#30740;&#31350;&#36824;&#20197;&#20869;&#24149;&#20132;&#26131;&#30340;&#24418;&#24335;&#21576;&#29616;&#20102;&#20854;&#20013;&#30340;&#29305;&#20363;&#65292;&#32473;&#20986;&#20102;&#36890;&#36135;&#33192;&#32960;&#38656;&#27714;&#12289;&#20215;&#26684;&#20914;&#20987;&#21644;&#20449;&#24687;&#25928;&#29575;&#30340;&#38381;&#24335;&#35299;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36890;&#36807;&#19968;&#20010;&#27169;&#22411;&#65292;&#32771;&#34385;&#20102;&#31169;&#26377;&#20449;&#24687;&#21644;&#39640;&#38454;&#20449;&#24687;&#23545;&#26399;&#26435;&#24066;&#22330;&#20215;&#26684;&#30340;&#24433;&#21709;&#12290;&#27169;&#22411;&#20801;&#35768;&#26377;&#31169;&#26377;&#20449;&#24687;&#30340;&#20132;&#26131;&#32773;&#22312;&#29366;&#24577;-&#32034;&#36180;&#38598;&#24066;&#22330;&#19978;&#20132;&#26131;&#12290;&#31561;&#20215;&#30340;&#26399;&#26435;&#24418;&#24335;&#19979;&#65292;&#25105;&#20204;&#32771;&#34385;&#20102;&#25317;&#26377;&#20851;&#20110;&#22522;&#30784;&#36164;&#20135;&#25910;&#30410;&#30340;&#20998;&#24067;&#30340;&#31169;&#26377;&#20449;&#24687;&#65292;&#24182;&#20801;&#35768;&#20132;&#26131;&#20219;&#24847;&#26399;&#26435;&#32452;&#21512;&#30340;&#25805;&#32437;&#32773;&#12290;&#25105;&#20204;&#24471;&#20986;&#20102;&#36890;&#36135;&#33192;&#32960;&#38656;&#27714;&#12289;&#20215;&#26684;&#20914;&#20987;&#21644;&#20449;&#24687;&#25928;&#29575;&#30340;&#38381;&#24335;&#35299;&#65292;&#36825;&#20123;&#35299;&#25552;&#20379;&#20102;&#20851;&#20110;&#20869;&#24149;&#20132;&#26131;&#30340;&#39640;&#38454;&#20449;&#24687;&#65292;&#22914;&#20219;&#20309;&#32473;&#23450;&#30340;&#26102;&#21051;&#20132;&#26131;&#26399;&#26435;&#31574;&#30053;&#65292;&#24182;&#23558;&#36825;&#20123;&#31574;&#30053;&#27867;&#21270;&#21040;&#20102;&#27874;&#21160;&#29575;&#20132;&#26131;&#31561;&#23454;&#36341;&#39046;&#22495;&#12290;
&lt;/p&gt;
&lt;p&gt;
We obtain a basic theory of price discovery across derivative markets with respect to higher-order information, using a model where an agent with general private information regarding state probabilities is allowed to trade arbitrary portfolios of state-contingent claims. In an equivalent options formulation, the informed agent has private information regarding arbitrary aspects of the payoff distribution of an underlying asset and is allowed to trade arbitrary option portfolios. We characterize, in closed form, the informed demand, price impact, and information efficiency of prices. Our results offer a theory of insider trading on higher moments of the underlying payoff as a special case. The informed demand formula prescribes option strategies for trading on any given moment and extends those used in practice for, e.g. volatility trading.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#21305;&#37197;&#23545;&#29031;&#23454;&#39564;&#20013;&#30340;&#21327;&#21464;&#37327;&#35843;&#25972;&#23545;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#30340;&#25512;&#26029;&#30340;&#24433;&#21709;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#20855;&#26377;&#26377;&#38480;&#32500;&#32447;&#24615;&#35843;&#25972;&#30340;&#20272;&#35745;&#22120;&#24182;&#19981;&#19968;&#23450;&#33021;&#25552;&#39640;&#31934;&#24230;&#30456;&#23545;&#20110;&#26410;&#35843;&#25972;&#30340;&#24046;&#24322;&#20272;&#35745;&#22120;&#12290;</title><link>http://arxiv.org/abs/2302.04380</link><description>&lt;p&gt;
&#22312;&#21305;&#37197;&#30340;&#23545;&#29031;&#23454;&#39564;&#20013;&#30340;&#21327;&#21464;&#37327;&#35843;&#25972;
&lt;/p&gt;
&lt;p&gt;
Covariate Adjustment in Experiments with Matched Pairs. (arXiv:2302.04380v3 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2302.04380
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#21305;&#37197;&#23545;&#29031;&#23454;&#39564;&#20013;&#30340;&#21327;&#21464;&#37327;&#35843;&#25972;&#23545;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#30340;&#25512;&#26029;&#30340;&#24433;&#21709;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#20855;&#26377;&#26377;&#38480;&#32500;&#32447;&#24615;&#35843;&#25972;&#30340;&#20272;&#35745;&#22120;&#24182;&#19981;&#19968;&#23450;&#33021;&#25552;&#39640;&#31934;&#24230;&#30456;&#23545;&#20110;&#26410;&#35843;&#25972;&#30340;&#24046;&#24322;&#20272;&#35745;&#22120;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#27835;&#30103;&#29366;&#24577;&#26681;&#25454;&#8220;&#21305;&#37197;&#23545;&#8221;&#30830;&#23450;&#30340;&#23454;&#39564;&#20013;&#65292;&#35843;&#25972;&#35266;&#23519;&#21040;&#30340;&#22522;&#32447;&#21327;&#21464;&#37327;&#26469;&#25552;&#39640;&#31934;&#24230;&#30340;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#30340;&#25512;&#26029;&#12290;&#36890;&#36807;&#8220;&#21305;&#37197;&#23545;&#8221;&#35774;&#35745;&#65292;&#25105;&#20204;&#25351;&#30340;&#26159;&#20174;&#24863;&#20852;&#36259;&#30340;&#24635;&#20307;&#20013;&#29420;&#31435;&#21516;&#20998;&#24067;&#22320;&#25277;&#21462;&#21333;&#20301;&#65292;&#26681;&#25454;&#35266;&#23519;&#21040;&#30340;&#22522;&#32447;&#21327;&#21464;&#37327;&#36827;&#34892;&#37197;&#23545;&#65292;&#28982;&#21518;&#22312;&#27599;&#23545;&#20013;&#38543;&#26426;&#36873;&#25321;&#19968;&#20010;&#21333;&#20301;&#36827;&#34892;&#22788;&#29702;&#12290;&#37325;&#35201;&#30340;&#26159;&#65292;&#25105;&#20204;&#20551;&#35774;&#24182;&#38750;&#25152;&#26377;&#35266;&#23519;&#21040;&#30340;&#22522;&#32447;&#21327;&#21464;&#37327;&#37117;&#29992;&#20110;&#30830;&#23450;&#27835;&#30103;&#20998;&#37197;&#12290;&#25105;&#20204;&#30740;&#31350;&#20102;&#19968;&#20010;&#22522;&#20110;&#8220;&#21452;&#37325;&#40065;&#26834;&#8221;&#30697;&#26465;&#20214;&#30340;&#24191;&#27867;&#31867;&#20272;&#35745;&#22120;&#65292;&#20801;&#35768;&#25105;&#20204;&#30740;&#31350;&#20855;&#26377;&#26377;&#38480;&#32500;&#21644;&#39640;&#32500;&#24418;&#24335;&#30340;&#21327;&#21464;&#37327;&#35843;&#25972;&#30340;&#20272;&#35745;&#22120;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#20855;&#26377;&#26377;&#38480;&#32500;&#32447;&#24615;&#35843;&#25972;&#30340;&#20272;&#35745;&#22120;&#19981;&#19968;&#23450;&#30456;&#23545;&#20110;&#26410;&#35843;&#25972;&#30340;&#22343;&#20540;&#24046;&#24322;&#20272;&#35745;&#22120;&#33021;&#25552;&#39640;&#31934;&#24230;&#12290;&#21363;&#20351;&#22312;&#35843;&#25972;&#20013;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper studies inference on the average treatment effect in experiments in which treatment status is determined according to "matched pairs" and it is additionally desired to adjust for observed, baseline covariates to gain further precision. By a "matched pairs" design, we mean that units are sampled i.i.d. from the population of interest, paired according to observed, baseline covariates and finally, within each pair, one unit is selected at random for treatment. Importantly, we presume that not all observed, baseline covariates are used in determining treatment assignment. We study a broad class of estimators based on a "doubly robust" moment condition that permits us to study estimators with both finite-dimensional and high-dimensional forms of covariate adjustment. We find that estimators with finite-dimensional, linear adjustments need not lead to improvements in precision relative to the unadjusted difference-in-means estimator. This phenomenon persists even if the adjustmen
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21322;&#21442;&#25968;&#26041;&#27861;&#26469;&#20272;&#35745;&#26080;&#26465;&#20214;&#20998;&#20301;&#25968;&#20559;&#25928;&#24212;&#65292;&#35813;&#26041;&#27861;&#22522;&#20110;&#35782;&#21035;&#32467;&#26524;&#65292;&#20351;&#29992;&#20998;&#20301;&#25968;&#22238;&#24402;&#31995;&#25968;&#20272;&#35745;&#21152;&#26435;&#24179;&#22343;&#30340;&#26465;&#20214;&#25928;&#24212;&#12290;&#25552;&#20986;&#20102;&#19968;&#20010;&#20855;&#26377;&#33391;&#22909;&#24615;&#33021;&#19988;&#31283;&#20581;&#30340;&#20004;&#27493;&#20272;&#35745;&#22120;&#24182;&#35777;&#26126;&#20102;&#20854;&#28176;&#36827;&#24615;&#36136;&#12290;&#30740;&#31350;&#20102; Engel &#26354;&#32447;&#30340;&#24212;&#29992;&#26469;&#35828;&#26126;&#26041;&#27861;&#30340;&#26377;&#25928;&#24615;&#12290;</title><link>http://arxiv.org/abs/2301.07241</link><description>&lt;p&gt;
&#26465;&#20214;&#20998;&#20301;&#25968;&#22238;&#24402;&#27714;&#35299;&#26080;&#26465;&#20214;&#20998;&#20301;&#25968;&#20559;&#25928;&#24212;
&lt;/p&gt;
&lt;p&gt;
Unconditional Quantile Partial Effects via Conditional Quantile Regression. (arXiv:2301.07241v2 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2301.07241
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21322;&#21442;&#25968;&#26041;&#27861;&#26469;&#20272;&#35745;&#26080;&#26465;&#20214;&#20998;&#20301;&#25968;&#20559;&#25928;&#24212;&#65292;&#35813;&#26041;&#27861;&#22522;&#20110;&#35782;&#21035;&#32467;&#26524;&#65292;&#20351;&#29992;&#20998;&#20301;&#25968;&#22238;&#24402;&#31995;&#25968;&#20272;&#35745;&#21152;&#26435;&#24179;&#22343;&#30340;&#26465;&#20214;&#25928;&#24212;&#12290;&#25552;&#20986;&#20102;&#19968;&#20010;&#20855;&#26377;&#33391;&#22909;&#24615;&#33021;&#19988;&#31283;&#20581;&#30340;&#20004;&#27493;&#20272;&#35745;&#22120;&#24182;&#35777;&#26126;&#20102;&#20854;&#28176;&#36827;&#24615;&#36136;&#12290;&#30740;&#31350;&#20102; Engel &#26354;&#32447;&#30340;&#24212;&#29992;&#26469;&#35828;&#26126;&#26041;&#27861;&#30340;&#26377;&#25928;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#20351;&#29992;&#20998;&#20301;&#25968;&#22238;&#24402;&#31995;&#25968;&#20272;&#35745;&#26080;&#26465;&#20214;&#20998;&#20301;&#25968;&#20559;&#25928;&#24212;&#30340;&#21322;&#21442;&#25968;&#26041;&#27861;&#12290;&#35813;&#20272;&#35745;&#22120;&#22522;&#20110;&#19968;&#20010;&#35782;&#21035;&#32467;&#26524;&#65292;&#21363;&#23545;&#20110;&#36830;&#32493;&#21327;&#21464;&#37327;&#65292;&#26080;&#26465;&#20214;&#20998;&#20301;&#25968;&#25928;&#24212;&#26159;&#22312;&#29305;&#23450;&#20998;&#20301;&#25968;&#27700;&#24179;&#22788;&#20381;&#36182;&#20110;&#21327;&#21464;&#37327;&#30340;&#26465;&#20214;&#25928;&#24212;&#30340;&#21152;&#26435;&#24179;&#22343;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#20004;&#27493;&#20272;&#35745;&#22120;&#26469;&#20272;&#35745;&#26080;&#26465;&#20214;&#25928;&#24212;&#65292;&#20854;&#20013;&#31532;&#19968;&#27493;&#20272;&#35745;&#32467;&#26500;&#21270;&#20998;&#20301;&#25968;&#22238;&#24402;&#27169;&#22411;&#65292;&#31532;&#20108;&#27493;&#24212;&#29992;&#38750;&#21442;&#25968;&#22238;&#24402;&#26041;&#27861;&#21040;&#31532;&#19968;&#27493;&#31995;&#25968;&#20013;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#20272;&#35745;&#22120;&#30340;&#28176;&#36827;&#24615;&#36136;&#65292;&#21253;&#25324;&#19968;&#33268;&#24615;&#21644;&#28176;&#36827;&#27491;&#24577;&#24615;&#12290;&#33945;&#29305;&#21345;&#27931;&#27169;&#25311;&#32467;&#26524;&#26174;&#31034;&#35813;&#20272;&#35745;&#22120;&#20855;&#26377;&#24456;&#22909;&#30340;&#26377;&#38480;&#26679;&#26412;&#24615;&#33021;&#65292;&#23545;&#20110;&#24102;&#23485;&#21644;&#26680;&#30340;&#36873;&#25321;&#20063;&#24456;&#31283;&#20581;&#12290;&#20026;&#20102;&#35828;&#26126;&#25152;&#25552;&#20986;&#30340;&#26041;&#27861;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102; Engel &#26354;&#32447;&#30340;&#20856;&#22411;&#24212;&#29992;&#65292;&#21363;&#23558;&#39135;&#21697;&#25903;&#20986;&#20316;&#20026;&#25910;&#20837;&#30340;&#19968;&#37096;&#20998;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper develops a semi-parametric procedure for estimation of unconditional quantile partial effects using quantile regression coefficients. The estimator is based on an identification result showing that, for continuous covariates, unconditional quantile effects are a weighted average of conditional ones at particular quantile levels that depend on the covariates. We propose a two-step estimator for the unconditional effects where in the first step one estimates a structural quantile regression model, and in the second step a nonparametric regression is applied to the first step coefficients. We establish the asymptotic properties of the estimator, say consistency and asymptotic normality. Monte Carlo simulations show numerical evidence that the estimator has very good finite sample performance and is robust to the selection of bandwidth and kernel. To illustrate the proposed method, we study the canonical application of the Engel's curve, i.e. food expenditures as a share of inco
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#38024;&#23545;&#20855;&#26377;&#24369;&#20195;&#29702;&#30340;&#20195;&#29702;-SVARs&#30340;&#35782;&#21035;&#21644;&#27979;&#35797;&#31574;&#30053;&#12290;&#36890;&#36807;&#20351;&#29992;&#24378;&#24037;&#20855;&#23545;&#38750;&#30446;&#26631;&#20914;&#20987;&#36827;&#34892;&#20195;&#29702;-SVAR&#30340;&#35782;&#21035;&#65292;&#21487;&#20197;&#36890;&#36807;&#26368;&#23567;&#36317;&#31163;&#20272;&#35745;&#21644;&#26631;&#20934;&#28176;&#36817;&#26041;&#27861;&#36827;&#34892;&#39057;&#29575;&#23398;&#27966;&#28176;&#36817;&#25512;&#26029;&#12290;&#35813;&#31574;&#30053;&#36890;&#36807;&#22522;&#20110;&#33258;&#21161;&#37325;&#37319;&#26679;&#30340;&#38646;&#20202;&#22120;&#30456;&#20851;&#24615;&#39044;&#26816;&#39564;&#65292;&#35299;&#20915;&#20102;&#20256;&#32479;&#26041;&#27861;&#20013;&#30340;&#39044;&#26816;&#39564;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2210.04523</link><description>&lt;p&gt;
&#19968;&#31181;&#38024;&#23545;&#20855;&#26377;&#24369;&#20195;&#29702;&#30340;&#20195;&#29702;-SVARs&#30340;&#35782;&#21035;&#21644;&#27979;&#35797;&#31574;&#30053;
&lt;/p&gt;
&lt;p&gt;
An identification and testing strategy for proxy-SVARs with weak proxies. (arXiv:2210.04523v3 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2210.04523
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#38024;&#23545;&#20855;&#26377;&#24369;&#20195;&#29702;&#30340;&#20195;&#29702;-SVARs&#30340;&#35782;&#21035;&#21644;&#27979;&#35797;&#31574;&#30053;&#12290;&#36890;&#36807;&#20351;&#29992;&#24378;&#24037;&#20855;&#23545;&#38750;&#30446;&#26631;&#20914;&#20987;&#36827;&#34892;&#20195;&#29702;-SVAR&#30340;&#35782;&#21035;&#65292;&#21487;&#20197;&#36890;&#36807;&#26368;&#23567;&#36317;&#31163;&#20272;&#35745;&#21644;&#26631;&#20934;&#28176;&#36817;&#26041;&#27861;&#36827;&#34892;&#39057;&#29575;&#23398;&#27966;&#28176;&#36817;&#25512;&#26029;&#12290;&#35813;&#31574;&#30053;&#36890;&#36807;&#22522;&#20110;&#33258;&#21161;&#37325;&#37319;&#26679;&#30340;&#38646;&#20202;&#22120;&#30456;&#20851;&#24615;&#39044;&#26816;&#39564;&#65292;&#35299;&#20915;&#20102;&#20256;&#32479;&#26041;&#27861;&#20013;&#30340;&#39044;&#26816;&#39564;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24403;&#29992;&#20110;&#35782;&#21035;&#30446;&#26631;&#32467;&#26500;&#20914;&#20987;&#30340;&#20195;&#29702;&#65288;&#22806;&#37096;&#24037;&#20855;&#65289;&#36739;&#24369;&#26102;&#65292;&#20195;&#29702;-SVARs&#65288;SVAR-IVs&#65289;&#20013;&#30340;&#25512;&#26029;&#26159;&#38750;&#26631;&#20934;&#30340;&#65292;&#24182;&#19988;&#20026;&#20102;&#26500;&#24314;&#24863;&#20852;&#36259;&#20914;&#20987;&#21709;&#24212;&#30340;&#28176;&#36817;&#26377;&#25928;&#32622;&#20449;&#21306;&#38388;&#65292;&#38656;&#35201;&#20351;&#29992;&#24369;&#24037;&#20855;&#40065;&#26834;&#26041;&#27861;&#12290;&#22312;&#23384;&#22312;&#22810;&#20010;&#30446;&#26631;&#20914;&#20987;&#30340;&#24773;&#20917;&#19979;&#65292;&#27979;&#35797;&#21453;&#28436;&#25216;&#26415;&#38656;&#35201;&#23545;&#20195;&#29702;-SVAR&#21442;&#25968;&#26045;&#21152;&#39069;&#22806;&#30340;&#38480;&#21046;&#65292;&#36825;&#20123;&#38480;&#21046;&#21487;&#33021;&#38590;&#20197;&#35299;&#37322;&#21644;&#27979;&#35797;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#22312;&#36825;&#20123;&#24773;&#20917;&#19979;&#21487;&#20197;&#36890;&#36807;&#26368;&#23567;&#36317;&#31163;&#20272;&#35745;&#21644;&#26631;&#20934;&#28176;&#36817;&#26041;&#27861;&#36827;&#34892;&#39057;&#29575;&#23398;&#27966;&#28176;&#36817;&#25512;&#26029;&#65292;&#21069;&#25552;&#26159;&#21487;&#20197;&#20351;&#29992;&#8220;&#24378;&#8221;&#24037;&#20855;&#23545;&#38750;&#30446;&#26631;&#20914;&#20987;&#65288;&#21363;&#20998;&#26512;&#20013;&#19981;&#24863;&#20852;&#36259;&#30340;&#20914;&#20987;&#65289;&#36827;&#34892;&#20195;&#29702;-SVAR&#30340;&#35782;&#21035;&#12290;&#24314;&#35758;&#30340;&#35782;&#21035;&#31574;&#30053;&#20381;&#36182;&#20110;&#19968;&#31181;&#22522;&#20110;&#33258;&#21161;&#37325;&#37319;&#26679;&#30340;&#38646;&#20202;&#22120;&#30456;&#20851;&#24615;&#39044;&#26816;&#39564;&#65292;&#35813;&#39044;&#26816;&#39564;&#19981;&#21463;&#39044;&#26816;&#39564;&#38382;&#39064;&#30340;&#24433;&#21709;&#65292;&#20174;&#32780;&#20445;&#35777;&#20102;&#20854;&#26377;&#25928;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
When proxies (external instruments) used to identify target structural shocks are weak, inference in proxy-SVARs (SVAR-IVs) is nonstandard and the construction of asymptotically valid confidence sets for the impulse responses of interest requires weak-instrument robust methods. In the presence of multiple target shocks, test inversion techniques require extra restrictions on the proxy-SVAR parameters other those implied by the proxies that may be difficult to interpret and test. We show that frequentist asymptotic inference in these situations can be conducted through Minimum Distance estimation and standard asymptotic methods if the proxy-SVAR can be identified by using `strong' instruments for the non-target shocks; i.e. the shocks which are not of primary interest in the analysis. The suggested identification strategy hinges on a novel pre-test for the null of instrument relevance based on bootstrap resampling which is not subject to pre-testing issues, in the sense that the validit
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#37325;&#26032;&#23457;&#35270;&#20102;&#22312;&#23384;&#22312;&#36864;&#22330;&#24773;&#20917;&#19979;&#20998;&#26512;&#21305;&#37197;&#23545;&#23454;&#39564;&#21644;&#20998;&#23618;&#23454;&#39564;&#35774;&#35745;&#30340;&#19968;&#20123;&#24120;&#35265;&#24314;&#35758;&#65292;&#21457;&#29616;&#26377;&#38480;&#35777;&#25454;&#25903;&#25345;&#20002;&#24323;&#23545;&#26377;&#21161;&#20110;&#24674;&#22797;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#30340;&#35266;&#28857;&#65292;&#20294;&#23427;&#21487;&#33021;&#26377;&#21161;&#20110;&#24674;&#22797;&#26465;&#20214;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#30340;&#20984;&#21152;&#26435;&#24179;&#22343;&#12290;</title><link>http://arxiv.org/abs/2209.11840</link><description>&lt;p&gt;
&#22312;&#23384;&#22312;&#36864;&#22330;&#24773;&#20917;&#19979;&#37325;&#26032;&#23457;&#35270;&#21305;&#37197;&#23545;&#23454;&#39564;&#21644;&#20998;&#23618;&#23454;&#39564;&#30340;&#20998;&#26512;
&lt;/p&gt;
&lt;p&gt;
Revisiting the Analysis of Matched-Pair and Stratified Experiments in the Presence of Attrition. (arXiv:2209.11840v5 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2209.11840
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#37325;&#26032;&#23457;&#35270;&#20102;&#22312;&#23384;&#22312;&#36864;&#22330;&#24773;&#20917;&#19979;&#20998;&#26512;&#21305;&#37197;&#23545;&#23454;&#39564;&#21644;&#20998;&#23618;&#23454;&#39564;&#35774;&#35745;&#30340;&#19968;&#20123;&#24120;&#35265;&#24314;&#35758;&#65292;&#21457;&#29616;&#26377;&#38480;&#35777;&#25454;&#25903;&#25345;&#20002;&#24323;&#23545;&#26377;&#21161;&#20110;&#24674;&#22797;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#30340;&#35266;&#28857;&#65292;&#20294;&#23427;&#21487;&#33021;&#26377;&#21161;&#20110;&#24674;&#22797;&#26465;&#20214;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#30340;&#20984;&#21152;&#26435;&#24179;&#22343;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#37325;&#26032;&#23457;&#35270;&#20102;&#22312;&#23384;&#22312;&#36864;&#22330;&#24773;&#20917;&#19979;&#20998;&#26512;&#21305;&#37197;&#23545;&#23454;&#39564;&#21644;&#20998;&#23618;&#23454;&#39564;&#35774;&#35745;&#30340;&#19968;&#20123;&#24120;&#35265;&#24314;&#35758;&#12290;&#25105;&#20204;&#30340;&#20027;&#35201;&#30446;&#26631;&#26159;&#28548;&#28165;&#20851;&#20110;&#22312;&#20998;&#26512;&#21305;&#37197;&#23545;&#35774;&#35745;&#26102;&#26159;&#21542;&#20002;&#24323;&#26377;&#20002;&#22833;&#21333;&#20301;&#30340;&#23545;&#26159;&#21542;&#26377;&#30410;&#25110;&#26377;&#23475;&#30340;&#19968;&#20123;&#33879;&#21517;&#35266;&#28857;&#12290;&#25991;&#29486;&#20013;&#23545;&#20110;&#26159;&#21542;&#20002;&#24323;&#23545;&#26377;&#30683;&#30462;&#30340;&#24314;&#35758;&#23384;&#22312;&#65292;&#21516;&#26102;&#23558;&#20998;&#23618;&#20026;&#36739;&#22823;&#32452;&#24050;&#34987;&#25512;&#33616;&#20026;&#35299;&#20915;&#35813;&#38382;&#39064;&#30340;&#26041;&#27861;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20123;&#35266;&#28857;&#65292;&#25105;&#20204;&#25512;&#23548;&#20102;&#21305;&#37197;&#23545;&#35774;&#35745;&#20013;&#24046;&#24322;-&#22343;&#20540;&#20272;&#35745;&#22120;&#24471;&#21040;&#30340;&#20272;&#35745;&#30446;&#26631;&#65292;&#26080;&#35770;&#26159;&#20445;&#30041;&#26377;&#20002;&#22833;&#21333;&#20301;&#30340;&#23545;&#36824;&#26159;&#20002;&#24323;&#23427;&#20204;&#12290;&#25105;&#20204;&#21457;&#29616;&#26377;&#38480;&#30340;&#35777;&#25454;&#25903;&#25345;&#20002;&#24323;&#23545;&#26377;&#21161;&#20110;&#24674;&#22797;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#30340;&#35266;&#28857;&#65292;&#20294;&#25105;&#20204;&#21457;&#29616;&#23427;&#21487;&#33021;&#26377;&#21161;&#20110;&#24674;&#22797;&#26465;&#20214;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#30340;&#20984;&#21152;&#26435;&#24179;&#22343;&#12290;&#25105;&#20204;&#25253;&#21578;&#20102;&#31867;&#20284;&#30340;&#21457;&#29616;&#26469;&#35777;&#23454;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this paper we revisit some common recommendations regarding the analysis of matched-pair and stratified experimental designs in the presence of attrition. Our main objective is to clarify a number of well-known claims about the practice of dropping pairs with an attrited unit when analyzing matched-pair designs. Contradictory advice appears in the literature about whether or not dropping pairs is beneficial or harmful, and stratifying into larger groups has been recommended as a resolution to the issue. To address these claims, we derive the estimands obtained from the difference-in-means estimator in a matched-pair design both when the observations from pairs with an attrited unit are retained and when they are dropped. We find limited evidence to support the claims that dropping pairs helps recover the average treatment effect, but we find that it may potentially help in recovering a convex weighted average of conditional average treatment effects. We report similar findings for s
&lt;/p&gt;</description></item><item><title>&#32654;&#22269;&#38646;&#21806;&#19994;&#38598;&#20013;&#24230;&#36817;&#24180;&#26469;&#21576;&#29616;&#22686;&#21152;&#36235;&#21183;&#65292;&#22823;&#37096;&#20998;&#30001;&#22810;&#24066;&#22330;&#20225;&#19994;&#36827;&#20837;&#26032;&#24066;&#22330;&#23548;&#33268;&#65292;&#26412;&#22320;&#24066;&#22330;&#20221;&#39069;&#22686;&#21152;&#20063;&#22312;1997&#24180;&#33267;2007&#24180;&#38388;&#21464;&#24471;&#26356;&#21152;&#37325;&#35201;&#12290;&#26412;&#22320;&#38598;&#20013;&#24230;&#30340;&#22686;&#21152;&#35299;&#37322;&#20102;&#25972;&#20307;&#38144;&#21806;&#22686;&#38271;&#30340;&#22235;&#20998;&#20043;&#19968;&#21040;&#19977;&#20998;&#20043;&#19968;&#12290;</title><link>http://arxiv.org/abs/2202.07609</link><description>&lt;p&gt;
&#32654;&#22269;&#38646;&#21806;&#19994;&#38598;&#20013;&#24230;&#30340;&#28436;&#21464;
&lt;/p&gt;
&lt;p&gt;
The Evolution of U.S. Retail Concentration. (arXiv:2202.07609v3 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2202.07609
&lt;/p&gt;
&lt;p&gt;
&#32654;&#22269;&#38646;&#21806;&#19994;&#38598;&#20013;&#24230;&#36817;&#24180;&#26469;&#21576;&#29616;&#22686;&#21152;&#36235;&#21183;&#65292;&#22823;&#37096;&#20998;&#30001;&#22810;&#24066;&#22330;&#20225;&#19994;&#36827;&#20837;&#26032;&#24066;&#22330;&#23548;&#33268;&#65292;&#26412;&#22320;&#24066;&#22330;&#20221;&#39069;&#22686;&#21152;&#20063;&#22312;1997&#24180;&#33267;2007&#24180;&#38388;&#21464;&#24471;&#26356;&#21152;&#37325;&#35201;&#12290;&#26412;&#22320;&#38598;&#20013;&#24230;&#30340;&#22686;&#21152;&#35299;&#37322;&#20102;&#25972;&#20307;&#38144;&#21806;&#22686;&#38271;&#30340;&#22235;&#20998;&#20043;&#19968;&#21040;&#19977;&#20998;&#20043;&#19968;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#32654;&#22269;&#30340;&#20135;&#19994;&#21160;&#24577;&#20013;&#65292;&#22269;&#23478;&#38598;&#20013;&#24230;&#30340;&#22686;&#21152;&#26159;&#19968;&#20010;&#26174;&#33879;&#29305;&#24449;&#65292;&#20063;&#24341;&#36215;&#20102;&#23545;&#24066;&#22330;&#21147;&#37327;&#22686;&#38271;&#30340;&#25285;&#24551;&#12290;&#28982;&#32780;&#65292;&#23545;&#20110;&#24066;&#22330;&#21147;&#37327;&#24773;&#20917;&#65292;&#26412;&#22320;&#36235;&#21183;&#21487;&#33021;&#26356;&#20855;&#20449;&#24687;&#37327;&#65292;&#29305;&#21035;&#26159;&#22312;&#38646;&#21806;&#37096;&#38376;&#65292;&#28040;&#36153;&#32773;&#36890;&#24120;&#22312;&#38468;&#36817;&#30340;&#21830;&#24215;&#36141;&#29289;&#12290;&#25105;&#20204;&#20351;&#29992;&#26032;&#22411;&#26222;&#26597;&#25968;&#25454;&#65292;&#35266;&#23519;&#20102;1992&#24180;&#33267;2012&#24180;&#38388;&#25152;&#26377;&#32654;&#22269;&#38646;&#21806;&#24215;&#20135;&#21697;&#32423;&#25910;&#20837;&#30340;&#26412;&#22320;&#38598;&#20013;&#24230;&#19982;&#22269;&#23478;&#38598;&#20013;&#24230;&#20960;&#20046;&#21516;&#27493;&#22686;&#21152;&#12290;&#38598;&#20013;&#24230;&#30340;&#22686;&#21152;&#24191;&#27867;&#24433;&#21709;&#22823;&#22810;&#25968;&#24066;&#22330;&#12289;&#20135;&#21697;&#21644;&#38646;&#21806;&#34892;&#19994;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#22810;&#24066;&#22330;&#20225;&#19994;&#36827;&#20837;&#26032;&#24066;&#22330;&#35299;&#37322;&#20102;&#22269;&#23478;&#38646;&#21806;&#38598;&#20013;&#24230;&#30340;&#22823;&#37096;&#20998;&#22686;&#38271;&#65292;&#32780;&#36890;&#36807;&#22686;&#21152;&#26412;&#22320;&#24066;&#22330;&#20221;&#39069;&#36827;&#34892;&#30340;&#25972;&#21512;&#22312;1997&#24180;&#33267;2007&#24180;&#38388;&#21464;&#24471;&#36234;&#26469;&#36234;&#37325;&#35201;&#65292;&#32780;&#21333;&#24066;&#22330;&#20225;&#19994;&#30340;&#20316;&#29992;&#24494;&#19981;&#36275;&#36947;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#21457;&#29616;&#26412;&#22320;&#38598;&#20013;&#24230;&#30340;&#22686;&#21152;&#21487;&#20197;&#35299;&#37322;&#25972;&#20307;&#38144;&#21806;&#22686;&#38271;&#30340;&#22235;&#20998;&#20043;&#19968;&#21040;&#19977;&#20998;&#20043;&#19968;&#12290;
&lt;/p&gt;
&lt;p&gt;
Increases in national concentration have been a salient feature of industry dynamics in the U.S. and have contributed to concerns about increasing market power. Yet, local trends may be more informative about market power, particularly in the retail sector where consumers have traditionally shopped at nearby stores. We find that local concentration has increased almost in parallel with national concentration using novel Census data on product-level revenue for all U.S. retail stores between 1992 and 2012. The increases in concentration are broad based, affecting most markets, products, and retail industries. We show that the expansion of multi-market firms into new markets explains most of the increase in national retail concentration, with consolidation via increases in local market shares increasing in importance between 1997 and 2007, and single-market firms playing a negligible role. Finally, we find that increases in local concentration can explain one-quarter to one-third of the 
&lt;/p&gt;</description></item><item><title>&#25991;&#31456;&#20351;&#29992;&#32929;&#19996;&#22823;&#20250;&#26102;&#38388;&#24046;&#24322;&#30340;&#26041;&#27861;&#30740;&#31350;&#20102;&#32929;&#19996;&#20559;&#22909;&#21644;&#23545;&#20844;&#21496;&#21033;&#20182;&#20915;&#31574;&#30340;&#24433;&#21709;&#65292;&#21457;&#29616;&#36861;&#27714;&#65288;&#26576;&#20123;&#65289;&#32929;&#19996;&#30340;&#20215;&#20540;&#20855;&#26377;&#20998;&#37197;&#25104;&#26412;&#65292;&#20294;&#22823;&#32929;&#19996;&#30340;&#30417;&#25511;&#21487;&#20197;&#36991;&#20813;&#36825;&#31181;&#30001;&#20559;&#22909;&#24322;&#36136;&#24615;&#39537;&#21160;&#30340;&#25104;&#26412;&#12290;</title><link>http://arxiv.org/abs/2103.12138</link><description>&lt;p&gt;
&#36861;&#27714;&#32929;&#19996;&#20215;&#20540;&#30340;&#20849;&#21516;&#25104;&#26412;
&lt;/p&gt;
&lt;p&gt;
The Shared Cost of Pursuing Shareholder Value. (arXiv:2103.12138v9 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2103.12138
&lt;/p&gt;
&lt;p&gt;
&#25991;&#31456;&#20351;&#29992;&#32929;&#19996;&#22823;&#20250;&#26102;&#38388;&#24046;&#24322;&#30340;&#26041;&#27861;&#30740;&#31350;&#20102;&#32929;&#19996;&#20559;&#22909;&#21644;&#23545;&#20844;&#21496;&#21033;&#20182;&#20915;&#31574;&#30340;&#24433;&#21709;&#65292;&#21457;&#29616;&#36861;&#27714;&#65288;&#26576;&#20123;&#65289;&#32929;&#19996;&#30340;&#20215;&#20540;&#20855;&#26377;&#20998;&#37197;&#25104;&#26412;&#65292;&#20294;&#22823;&#32929;&#19996;&#30340;&#30417;&#25511;&#21487;&#20197;&#36991;&#20813;&#36825;&#31181;&#30001;&#20559;&#22909;&#24322;&#36136;&#24615;&#39537;&#21160;&#30340;&#25104;&#26412;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#37319;&#29992;&#20934;&#23454;&#39564;&#24615;&#30340;&#26041;&#27861;&#65292;&#26681;&#25454;&#20844;&#21496;&#32929;&#19996;&#22823;&#20250;&#65288;AGMs&#65289;&#30340;&#26102;&#38388;&#24046;&#24322;&#65292;&#25552;&#20986;&#20102;&#19968;&#20010;&#21487;&#31227;&#26893;&#30340;&#26694;&#26550;&#65292;&#25512;&#26029;&#32929;&#19996;&#30340;&#20559;&#22909;&#21644;&#23545;&#20844;&#21496;&#21033;&#20182;&#20915;&#31574;&#30340;&#24433;&#21709;&#65292;&#24182;&#23558;&#20854;&#24212;&#29992;&#20110;covid&#30456;&#20851;&#25424;&#36192;&#12289;&#26368;&#36817;&#38024;&#23545;&#20420;&#32599;&#26031;&#30340;&#31169;&#20154;&#21046;&#35009;&#20197;&#21450;&#20844;&#21496;2012-19&#24180;&#30340;&#21033;&#20182;&#31435;&#22330;&#12290;AGMs&#30340;&#23186;&#20307;&#26333;&#20809;&#24102;&#26469;&#30340;&#24418;&#35937;&#25910;&#30410;&#65292;&#20351;&#24471;&#19982;&#20844;&#21496;&#21516;&#20041;&#30340;&#32929;&#19996;&#65288;&#22914;&#23494;&#20999;&#30456;&#20851;&#30340;&#20010;&#20154;&#65289;&#25903;&#25345;&#26114;&#36149;&#30340;&#21033;&#20182;&#21464;&#38761;&#65292;&#32780;&#20854;&#20182;&#32929;&#19996;&#65288;&#22914;&#37329;&#34701;&#20844;&#21496;&#65289;&#21453;&#23545;&#36825;&#20123;&#21464;&#38761;&#12290;&#25903;&#25345;&#36825;&#20123;&#21464;&#38761;&#30340;&#24433;&#21709;&#20351;&#25910;&#30410;&#19979;&#38477;&#20102;30&#65285;&#65306;&#36861;&#27714;&#65288;&#26576;&#20123;&#65289;&#32929;&#19996;&#30340;&#20215;&#20540;&#20855;&#26377;&#20998;&#37197;&#25104;&#26412;&#65292;&#22823;&#32929;&#19996;&#30340;&#30417;&#25511;&#21487;&#20197;&#36991;&#20813;&#30001;&#20559;&#22909;&#24322;&#36136;&#24615;&#39537;&#21160;&#30340;&#25104;&#26412;&#12290;
&lt;/p&gt;
&lt;p&gt;
Using quasi-experimental variations from the timing of firms' Annual General Meetings (AGMs), we propose a portable framework to infer shareholders' preferences and influences on firms' prosocial decisions and apply it to covid-related donations, recent private sanctions on Russia, and firms' prosocial stances over 2012-19. Image gains from AGMs' media exposure drive shareholders synonymous with a firm, like closely-connected individuals, to support costly prosocial changes, while others, like financial corporations, oppose them. Influence supporting these changes lowers earnings by 30\%: pursuing the values of (some) shareholders has distributional costs, which the monitoring of large shareholders motivated by heterogeneous preferences could prevent.
&lt;/p&gt;</description></item></channel></rss>