<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#19968;&#31687;&#35770;&#25991;&#30740;&#31350;&#20102;&#22312;&#31639;&#27861;&#36741;&#21161;&#20915;&#31574;&#20013;&#65292;&#22914;&#20309;&#35774;&#35745;&#26368;&#20248;&#30340;&#39044;&#27979;&#31639;&#27861;&#21644;&#22996;&#25176;&#35268;&#21017;&#12290;&#20851;&#38190;&#21457;&#29616;&#21253;&#25324;&#65306;&#22996;&#25176;&#30340;&#26368;&#20248;&#24615;&#19982;&#22996;&#25176;&#20154;&#26159;&#21542;&#20250;&#20570;&#20986;&#19982;&#20195;&#29702;&#20154;&#30456;&#21516;&#30340;&#20915;&#31574;&#26377;&#20851;&#12289;&#26368;&#20855;&#20449;&#24687;&#37327;&#30340;&#31639;&#27861;&#19981;&#19968;&#23450;&#26159;&#26368;&#20248;&#30340;&#12289;&#24120;&#35265;&#30340;&#31639;&#27861;&#38480;&#21046;&#20250;&#38477;&#20302;&#20915;&#31574;&#36136;&#37327;&#12290;</title><link>https://arxiv.org/abs/2402.09384</link><description>&lt;p&gt;
&#35828;&#26381;&#12289;&#22996;&#25176;&#21644;&#31169;&#26377;&#20449;&#24687;&#22312;&#31639;&#27861;&#36741;&#21161;&#20915;&#31574;&#20013;&#30340;&#24212;&#29992;
&lt;/p&gt;
&lt;p&gt;
Persuasion, Delegation, and Private Information in Algorithm-Assisted Decisions
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.09384
&lt;/p&gt;
&lt;p&gt;
&#19968;&#31687;&#35770;&#25991;&#30740;&#31350;&#20102;&#22312;&#31639;&#27861;&#36741;&#21161;&#20915;&#31574;&#20013;&#65292;&#22914;&#20309;&#35774;&#35745;&#26368;&#20248;&#30340;&#39044;&#27979;&#31639;&#27861;&#21644;&#22996;&#25176;&#35268;&#21017;&#12290;&#20851;&#38190;&#21457;&#29616;&#21253;&#25324;&#65306;&#22996;&#25176;&#30340;&#26368;&#20248;&#24615;&#19982;&#22996;&#25176;&#20154;&#26159;&#21542;&#20250;&#20570;&#20986;&#19982;&#20195;&#29702;&#20154;&#30456;&#21516;&#30340;&#20915;&#31574;&#26377;&#20851;&#12289;&#26368;&#20855;&#20449;&#24687;&#37327;&#30340;&#31639;&#27861;&#19981;&#19968;&#23450;&#26159;&#26368;&#20248;&#30340;&#12289;&#24120;&#35265;&#30340;&#31639;&#27861;&#38480;&#21046;&#20250;&#38477;&#20302;&#20915;&#31574;&#36136;&#37327;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#19968;&#20301;&#22996;&#25176;&#20154;&#35774;&#35745;&#20102;&#19968;&#20010;&#31639;&#27861;&#65292;&#35813;&#31639;&#27861;&#29983;&#25104;&#19968;&#20010;&#20844;&#24320;&#21487;&#35265;&#30340;&#20108;&#36827;&#21046;&#29366;&#24577;&#39044;&#27979;&#12290;&#22905;&#24517;&#39035;&#20915;&#23450;&#26159;&#26681;&#25454;&#39044;&#27979;&#30452;&#25509;&#34892;&#21160;&#36824;&#26159;&#23558;&#20915;&#31574;&#22996;&#25176;&#32473;&#19968;&#20010;&#20195;&#29702;&#20154;&#65292;&#35813;&#20195;&#29702;&#20154;&#20855;&#26377;&#31169;&#26377;&#20449;&#24687;&#20294;&#21487;&#33021;&#23384;&#22312;&#19981;&#23545;&#40784;&#38382;&#39064;&#12290;&#25105;&#20204;&#30740;&#31350;&#20102;&#22312;&#36825;&#31181;&#29615;&#22659;&#19979;&#39044;&#27979;&#31639;&#27861;&#21644;&#22996;&#25176;&#35268;&#21017;&#30340;&#26368;&#20248;&#35774;&#35745;&#12290;&#24471;&#20986;&#20102;&#19977;&#20010;&#20851;&#38190;&#21457;&#29616;&#65306;(1)&#21482;&#26377;&#24403;&#22996;&#25176;&#20154;&#22312;&#35266;&#23519;&#21040;&#20195;&#29702;&#20154;&#30340;&#20449;&#24687;&#26102;&#20250;&#20570;&#20986;&#19982;&#20195;&#29702;&#20154;&#30456;&#21516;&#30340;&#20108;&#36827;&#21046;&#20915;&#31574;&#26102;&#65292;&#22996;&#25176;&#25165;&#26159;&#26368;&#20248;&#30340;&#12290;(2)&#25552;&#20379;&#26368;&#20855;&#20449;&#24687;&#37327;&#30340;&#31639;&#27861;&#21487;&#33021;&#24182;&#19981;&#26159;&#26368;&#20248;&#30340;&#65292;&#21363;&#20351;&#22996;&#25176;&#20154;&#21487;&#20197;&#26681;&#25454;&#31639;&#27861;&#30340;&#39044;&#27979;&#26469;&#34892;&#21160;&#12290;&#30456;&#21453;&#65292;&#26368;&#20248;&#31639;&#27861;&#21487;&#33021;&#25552;&#20379;&#26356;&#22810;&#20851;&#20110;&#19968;&#20010;&#29366;&#24577;&#30340;&#20449;&#24687;&#65292;&#24182;&#38480;&#21046;&#20851;&#20110;&#21478;&#19968;&#20010;&#29366;&#24577;&#30340;&#20449;&#24687;&#12290;(3)&#22312;&#27809;&#26377;&#23436;&#32654;&#30340;&#39044;&#27979;&#20934;&#30830;&#24615;&#30340;&#24773;&#20917;&#19979;&#65292;&#24120;&#35265;&#30340;&#23545;&#31639;&#27861;&#30340;&#38480;&#21046;&#65292;&#22914;&#20445;&#25345;"&#20154;&#26426;&#21512;&#20316;"&#25110;&#35201;&#27714;&#26368;&#22823;&#39044;&#27979;&#31934;&#24230;&#65292;&#20250;&#20005;&#37325;&#38477;&#20302;&#20915;&#31574;&#36136;&#37327;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.09384v1 Announce Type: cross Abstract: A principal designs an algorithm that generates a publicly observable prediction of a binary state. She must decide whether to act directly based on the prediction or to delegate the decision to an agent with private information but potential misalignment. We study the optimal design of the prediction algorithm and the delegation rule in such environments. Three key findings emerge: (1) Delegation is optimal if and only if the principal would make the same binary decision as the agent had she observed the agent's information. (2) Providing the most informative algorithm may be suboptimal even if the principal can act on the algorithm's prediction. Instead, the optimal algorithm may provide more information about one state and restrict information about the other. (3) Common restrictions on algorithms, such as keeping a "human-in-the-loop" or requiring maximal prediction accuracy, strictly worsen decision quality in the absence of perfec
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#20132;&#26131;&#25163;&#32493;&#36153;&#26426;&#21046;&#35774;&#35745;&#20013;&#30340;&#38450;&#21246;&#32467;&#24615;&#38382;&#39064;&#65292;&#35752;&#35770;&#20102;&#22810;&#20010;&#35201;&#27714;&#21644;&#23646;&#24615;&#65292;&#24182;&#25351;&#20986;&#22312;&#23384;&#22312;&#20132;&#26131;&#31454;&#20105;&#26102;&#65292;&#20219;&#20309;TFM&#37117;&#26080;&#27861;&#21516;&#26102;&#28385;&#36275;&#25152;&#26377;&#35201;&#27714;&#21644;&#23646;&#24615;&#12290;</title><link>https://arxiv.org/abs/2402.09321</link><description>&lt;p&gt;
&#20132;&#26131;&#25163;&#32493;&#36153;&#26426;&#21046;&#35774;&#35745;&#20013;&#30340;&#38450;&#21246;&#32467;&#24615;
&lt;/p&gt;
&lt;p&gt;
Collusion-Resilience in Transaction Fee Mechanism Design
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.09321
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#20132;&#26131;&#25163;&#32493;&#36153;&#26426;&#21046;&#35774;&#35745;&#20013;&#30340;&#38450;&#21246;&#32467;&#24615;&#38382;&#39064;&#65292;&#35752;&#35770;&#20102;&#22810;&#20010;&#35201;&#27714;&#21644;&#23646;&#24615;&#65292;&#24182;&#25351;&#20986;&#22312;&#23384;&#22312;&#20132;&#26131;&#31454;&#20105;&#26102;&#65292;&#20219;&#20309;TFM&#37117;&#26080;&#27861;&#21516;&#26102;&#28385;&#36275;&#25152;&#26377;&#35201;&#27714;&#21644;&#23646;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#21306;&#22359;&#38142;&#21327;&#35758;&#20013;&#65292;&#29992;&#25143;&#36890;&#36807;&#20132;&#26131;&#25163;&#32493;&#36153;&#26426;&#21046;&#65288;TFM&#65289;&#36827;&#34892;&#31454;&#26631;&#65292;&#20197;&#20415;&#23558;&#20854;&#20132;&#26131;&#21253;&#21547;&#24182;&#33719;&#24471;&#30830;&#35748;&#12290;Roughgarden&#65288;EC'21&#65289;&#23545;TFM&#36827;&#34892;&#20102;&#27491;&#24335;&#30340;&#22788;&#29702;&#65292;&#24182;&#25552;&#20986;&#20102;&#19977;&#20010;&#35201;&#27714;&#65306;&#29992;&#25143;&#28608;&#21169;&#20860;&#23481;&#24615;&#65288;UIC&#65289;&#65292;&#30719;&#24037;&#28608;&#21169;&#20860;&#23481;&#24615;&#65288;MIC&#65289;&#20197;&#21450;&#19968;&#31181;&#31216;&#20026;OCA-proofness&#30340;&#38450;&#21246;&#32467;&#24615;&#24418;&#24335;&#12290;&#24403;&#27809;&#26377;&#20132;&#26131;&#20043;&#38388;&#30340;&#31454;&#20105;&#26102;&#65292;Ethereum&#30340;EIP-1559&#26426;&#21046;&#21516;&#26102;&#28385;&#36275;&#36825;&#19977;&#20010;&#23646;&#24615;&#65292;&#20294;&#24403;&#26377;&#36807;&#22810;&#30340;&#31526;&#21512;&#26465;&#20214;&#30340;&#20132;&#26131;&#26080;&#27861;&#25918;&#20837;&#21333;&#20010;&#21306;&#22359;&#26102;&#65292;&#22833;&#21435;&#20102;UIC&#23646;&#24615;&#12290;Chung&#21644;Shi&#65288;SODA'23&#65289;&#32771;&#34385;&#20102;&#19968;&#31181;&#26367;&#20195;&#30340;&#38450;&#21246;&#32467;&#24615;&#27010;&#24565;&#65292;&#31216;&#20026;c-side-construct-proofness(c-SCP)&#65292;&#24182;&#35777;&#26126;&#20102;&#24403;&#20132;&#26131;&#20043;&#38388;&#23384;&#22312;&#31454;&#20105;&#26102;&#65292;&#20219;&#20309;TFM&#37117;&#19981;&#33021;&#28385;&#36275;UIC&#12289;MIC&#21644;&#33267;&#23569;&#20026;1&#30340;&#20219;&#20309;c&#30340;c-SCP&#12290;OCA-proofness&#26029;&#35328;&#29992;&#25143;&#21644;&#30719;&#24037;&#19981;&#24212;&#35813;&#33021;&#22815;&#20174;&#21327;&#35758;&#20013;&#8220;&#20599;&#21462;&#8221;&#65292;&#24182;&#19988;&#22312;&#30452;&#35273;&#19978;&#27604;UIC&#12289;MIC&#26356;&#24369;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.09321v1 Announce Type: cross Abstract: Users bid in a transaction fee mechanism (TFM) to get their transactions included and confirmed by a blockchain protocol. Roughgarden (EC'21) initiated the formal treatment of TFMs and proposed three requirements: user incentive compatibility (UIC), miner incentive compatibility (MIC), and a form of collusion-resilience called OCA-proofness. Ethereum's EIP-1559 mechanism satisfies all three properties simultaneously when there is no contention between transactions, but loses the UIC property when there are too many eligible transactions to fit in a single block. Chung and Shi (SODA'23) considered an alternative notion of collusion-resilience, called c-side-constract-proofness (c-SCP), and showed that, when there is contention between transactions, no TFM can satisfy UIC, MIC, and c-SCP for any c at least 1. OCA-proofness asserts that the users and a miner should not be able to "steal from the protocol" and is intuitively weaker than the
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#22810;&#21830;&#21697;&#24066;&#22330;&#20013;&#65292;&#21253;&#25324;&#22797;&#26434;&#25414;&#32465;&#34892;&#20026;&#30340;&#24773;&#20917;&#19979;&#65292;&#25214;&#21040;&#26368;&#20248;&#30340;&#33258;&#21160;&#20570;&#24066;&#21830;&#30340;&#38382;&#39064;&#65292;&#21457;&#29616;&#35813;&#38382;&#39064;&#23545;&#20598;&#20110;&#19968;&#20010;&#26368;&#20248;&#36816;&#36755;&#38382;&#39064;&#65292;&#24182;&#19988;&#20855;&#26377;&#29305;&#23450;&#30340;&#20960;&#20309;&#32422;&#26463;&#26465;&#20214;&#12290;</title><link>https://arxiv.org/abs/2402.09129</link><description>&lt;p&gt;
&#26368;&#20248;&#33258;&#21160;&#20570;&#24066;&#21830;: &#21487;&#24494;&#32463;&#27982;&#23398;&#21644;&#24378;&#23545;&#20598;&#24615;
&lt;/p&gt;
&lt;p&gt;
Optimal Automated Market Makers: Differentiable Economics and Strong Duality
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.09129
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#22810;&#21830;&#21697;&#24066;&#22330;&#20013;&#65292;&#21253;&#25324;&#22797;&#26434;&#25414;&#32465;&#34892;&#20026;&#30340;&#24773;&#20917;&#19979;&#65292;&#25214;&#21040;&#26368;&#20248;&#30340;&#33258;&#21160;&#20570;&#24066;&#21830;&#30340;&#38382;&#39064;&#65292;&#21457;&#29616;&#35813;&#38382;&#39064;&#23545;&#20598;&#20110;&#19968;&#20010;&#26368;&#20248;&#36816;&#36755;&#38382;&#39064;&#65292;&#24182;&#19988;&#20855;&#26377;&#29305;&#23450;&#30340;&#20960;&#20309;&#32422;&#26463;&#26465;&#20214;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20570;&#24066;&#21830;&#30340;&#20316;&#29992;&#26159;&#21516;&#26102;&#20197;&#25351;&#23450;&#20215;&#26684;&#36141;&#20080;&#21644;&#20986;&#21806;&#21830;&#21697;&#25968;&#37327;&#65292;&#36890;&#24120;&#26159;&#37329;&#34701;&#36164;&#20135;&#22914;&#32929;&#31080;&#12290;&#33258;&#21160;&#20570;&#24066;&#21830;&#65288;AMM&#65289;&#26159;&#19968;&#31181;&#26681;&#25454;&#39044;&#23450;&#30340;&#26102;&#38388;&#34920;&#25552;&#20379;&#20132;&#26131;&#30340;&#26426;&#21046;&#65307;&#36873;&#25321;&#26368;&#20339;&#30340;&#26102;&#38388;&#34920;&#21462;&#20915;&#20110;&#20570;&#24066;&#21830;&#30340;&#30446;&#26631;&#12290;&#29616;&#26377;&#30740;&#31350;&#20027;&#35201;&#38598;&#20013;&#22312;&#39044;&#27979;&#24066;&#22330;&#19978;&#65292;&#30446;&#30340;&#26159;&#20449;&#24687;&#25910;&#38598;&#12290;&#36817;&#26399;&#30340;&#24037;&#20316;&#21017;&#20027;&#35201;&#20851;&#27880;&#21033;&#28070;&#26368;&#22823;&#21270;&#30340;&#30446;&#26631;&#65292;&#20294;&#20165;&#20165;&#32771;&#34385;&#20102;&#19968;&#31181;&#31867;&#22411;&#30340;&#21830;&#21697;&#65288;&#29992;&#34913;&#37327;&#36135;&#24065;&#36827;&#34892;&#20132;&#26131;&#65289;&#65292;&#21253;&#25324;&#36870;&#21521;&#36873;&#25321;&#30340;&#24773;&#20917;&#12290;&#20851;&#20110;&#23384;&#22312;&#22810;&#31181;&#21830;&#21697;&#20197;&#21450;&#21487;&#33021;&#20986;&#29616;&#22797;&#26434;&#25414;&#32465;&#34892;&#20026;&#30340;&#26368;&#20248;&#20570;&#24066;&#38382;&#39064;&#23578;&#19981;&#28165;&#26970;&#12290;&#26412;&#25991;&#34920;&#26126;&#65292;&#22312;&#22810;&#20010;&#21830;&#21697;&#23384;&#22312;&#19988;&#21487;&#33021;&#20986;&#29616;&#22797;&#26434;&#25414;&#32465;&#34892;&#20026;&#30340;&#24773;&#20917;&#19979;&#65292;&#25214;&#21040;&#19968;&#20010;&#26368;&#20248;&#30340;&#20570;&#24066;&#21830;&#26159;&#19968;&#20010;&#23545;&#20598;&#20110;&#26368;&#20248;&#36816;&#36755;&#38382;&#39064;&#30340;&#38382;&#39064;&#65292;&#24182;&#19988;&#20855;&#26377;&#29305;&#23450;&#30340;&#20960;&#20309;&#32422;&#26463;&#26465;&#20214;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.09129v1 Announce Type: cross Abstract: The role of a market maker is to simultaneously offer to buy and sell quantities of goods, often a financial asset such as a share, at specified prices. An automated market maker (AMM) is a mechanism that offers to trade according to some predetermined schedule; the best choice of this schedule depends on the market maker's goals. The literature on the design of AMMs has mainly focused on prediction markets with the goal of information elicitation. More recent work motivated by DeFi has focused instead on the goal of profit maximization, but considering only a single type of good (traded with a numeraire), including under adverse selection (Milionis et al. 2022). Optimal market making in the presence of multiple goods, including the possibility of complex bundling behavior, is not well understood. In this paper, we show that finding an optimal market maker is dual to an optimal transport problem, with specific geometric constraints on t
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#20171;&#32461;&#20102;&#31038;&#20250;&#30899;&#25104;&#26412;&#20272;&#35745;&#20803;&#20998;&#26512;&#25968;&#25454;&#24211;&#30340;&#26032;&#29256;&#26412;&#65292;&#26032;&#22686;&#20102;&#20851;&#20110;&#27668;&#20505;&#21464;&#21270;&#24433;&#21709;&#21644;&#31119;&#21033;&#20989;&#25968;&#24418;&#29366;&#30340;&#23383;&#27573;&#65292;&#24182;&#25193;&#23637;&#20102;&#21512;&#20316;&#32773;&#21644;&#24341;&#29992;&#32593;&#32476;&#12290;</title><link>https://arxiv.org/abs/2402.09125</link><description>&lt;p&gt;
&#31038;&#20250;&#30899;&#25104;&#26412;&#30340;&#20803;&#20998;&#26512;&#25968;&#25454;&#24211; (v2024.0)
&lt;/p&gt;
&lt;p&gt;
Database for the meta-analysis of the social cost of carbon (v2024.0)
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.09125
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#20171;&#32461;&#20102;&#31038;&#20250;&#30899;&#25104;&#26412;&#20272;&#35745;&#20803;&#20998;&#26512;&#25968;&#25454;&#24211;&#30340;&#26032;&#29256;&#26412;&#65292;&#26032;&#22686;&#20102;&#20851;&#20110;&#27668;&#20505;&#21464;&#21270;&#24433;&#21709;&#21644;&#31119;&#21033;&#20989;&#25968;&#24418;&#29366;&#30340;&#23383;&#27573;&#65292;&#24182;&#25193;&#23637;&#20102;&#21512;&#20316;&#32773;&#21644;&#24341;&#29992;&#32593;&#32476;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#31038;&#20250;&#30899;&#25104;&#26412;&#20272;&#35745;&#20803;&#20998;&#26512;&#25968;&#25454;&#24211;&#30340;&#26032;&#29256;&#26412;&#12290;&#26032;&#22686;&#20102;&#35760;&#24405;&#65292;&#24182;&#28155;&#21152;&#20102;&#20851;&#20110;&#27668;&#20505;&#21464;&#21270;&#24433;&#21709;&#21644;&#31119;&#21033;&#20989;&#25968;&#24418;&#29366;&#30340;&#26032;&#23383;&#27573;&#12290;&#35813;&#25968;&#25454;&#24211;&#36824;&#25193;&#23637;&#20102;&#21512;&#20316;&#32773;&#21644;&#24341;&#29992;&#32593;&#32476;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.09125v1 Announce Type: new Abstract: A new version of the database for the meta-analysis of estimates of the social cost of carbon is presented. New records were added, and new fields on the impact of climate change and the shape of the welfare function. The database was extended to co-author and citation networks.
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#20351;&#29992;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#22312;&#25968;&#23383;&#24179;&#21488;&#19978;&#36827;&#34892;&#36328;&#26102;&#39044;&#27979;&#21327;&#35843;&#30340;&#38750;&#32447;&#24615;&#20998;&#23618;&#39044;&#27979;&#21327;&#35843;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#33021;&#22815;&#30452;&#25509;&#19988;&#33258;&#21160;&#21270;&#22320;&#29983;&#25104;&#36328;&#26102;&#39044;&#27979;&#21327;&#35843;&#30340;&#39044;&#27979;&#65292;&#36890;&#36807;&#23545;&#26469;&#33258;&#25353;&#38656;&#20132;&#20184;&#24179;&#21488;&#30340;&#22823;&#35268;&#27169;&#27969;&#24335;&#25968;&#25454;&#38598;&#36827;&#34892;&#23454;&#35777;&#27979;&#35797;&#12290;</title><link>https://arxiv.org/abs/2402.09033</link><description>&lt;p&gt;
&#20351;&#29992;&#26426;&#22120;&#23398;&#20064;&#22312;&#25968;&#23383;&#24179;&#21488;&#19978;&#36827;&#34892;&#36328;&#26102;&#39044;&#27979;&#21327;&#35843;
&lt;/p&gt;
&lt;p&gt;
Cross-Temporal Forecast Reconciliation at Digital Platforms with Machine Learning
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.09033
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#20351;&#29992;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#22312;&#25968;&#23383;&#24179;&#21488;&#19978;&#36827;&#34892;&#36328;&#26102;&#39044;&#27979;&#21327;&#35843;&#30340;&#38750;&#32447;&#24615;&#20998;&#23618;&#39044;&#27979;&#21327;&#35843;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#33021;&#22815;&#30452;&#25509;&#19988;&#33258;&#21160;&#21270;&#22320;&#29983;&#25104;&#36328;&#26102;&#39044;&#27979;&#21327;&#35843;&#30340;&#39044;&#27979;&#65292;&#36890;&#36807;&#23545;&#26469;&#33258;&#25353;&#38656;&#20132;&#20184;&#24179;&#21488;&#30340;&#22823;&#35268;&#27169;&#27969;&#24335;&#25968;&#25454;&#38598;&#36827;&#34892;&#23454;&#35777;&#27979;&#35797;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24179;&#21488;&#19994;&#21153;&#22312;&#25968;&#23383;&#26680;&#24515;&#19978;&#36816;&#20316;&#65292;&#20854;&#20915;&#31574;&#38656;&#35201;&#19981;&#21516;&#23618;&#27425;&#65288;&#20363;&#22914;&#22320;&#29702;&#21306;&#22495;&#65289;&#21644;&#26102;&#38388;&#32858;&#21512;&#65288;&#20363;&#22914;&#20998;&#38047;&#21040;&#22825;&#65289;&#30340;&#39640;&#32500;&#20934;&#30830;&#39044;&#27979;&#27969;&#12290;&#20026;&#20102;&#30830;&#20445;&#19981;&#21516;&#35268;&#21010;&#21333;&#20803;&#65288;&#22914;&#23450;&#20215;&#12289;&#20135;&#21697;&#12289;&#25511;&#21046;&#21644;&#25112;&#30053;&#65289;&#20043;&#38388;&#30340;&#20915;&#31574;&#19968;&#33268;&#65292;&#20063;&#38656;&#35201;&#22312;&#23618;&#27425;&#32467;&#26500;&#30340;&#25152;&#26377;&#32423;&#21035;&#19978;&#36827;&#34892;&#21327;&#35843;&#39044;&#27979;&#12290;&#37492;&#20110;&#24179;&#21488;&#25968;&#25454;&#27969;&#20855;&#26377;&#22797;&#26434;&#30340;&#29305;&#24449;&#21644;&#30456;&#20114;&#20381;&#36182;&#20851;&#31995;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#31181;&#38750;&#32447;&#24615;&#20998;&#23618;&#39044;&#27979;&#21327;&#35843;&#26041;&#27861;&#65292;&#36890;&#36807;&#20351;&#29992;&#27969;&#34892;&#30340;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#65292;&#20197;&#30452;&#25509;&#21644;&#33258;&#21160;&#21270;&#30340;&#26041;&#24335;&#29983;&#25104;&#36328;&#26102;&#39044;&#27979;&#21327;&#35843;&#30340;&#39044;&#27979;&#12290;&#35813;&#26041;&#27861;&#36275;&#22815;&#24555;&#65292;&#21487;&#20197;&#28385;&#36275;&#24179;&#21488;&#25152;&#38656;&#30340;&#22522;&#20110;&#39044;&#27979;&#30340;&#39640;&#39057;&#20915;&#31574;&#12290;&#25105;&#20204;&#20351;&#29992;&#26469;&#33258;&#39046;&#20808;&#30340;&#25353;&#38656;&#20132;&#20184;&#24179;&#21488;&#30340;&#29420;&#29305;&#22823;&#35268;&#27169;&#27969;&#24335;&#25968;&#25454;&#38598;&#23545;&#25105;&#20204;&#30340;&#26694;&#26550;&#36827;&#34892;&#20102;&#23454;&#35777;&#27979;&#35797;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.09033v1 Announce Type: new Abstract: Platform businesses operate on a digital core and their decision making requires high-dimensional accurate forecast streams at different levels of cross-sectional (e.g., geographical regions) and temporal aggregation (e.g., minutes to days). It also necessitates coherent forecasts across all levels of the hierarchy to ensure aligned decision making across different planning units such as pricing, product, controlling and strategy. Given that platform data streams feature complex characteristics and interdependencies, we introduce a non-linear hierarchical forecast reconciliation method that produces cross-temporal reconciled forecasts in a direct and automated way through the use of popular machine learning methods. The method is sufficiently fast to allow forecast-based high-frequency decision making that platforms require. We empirically test our framework on a unique, large-scale streaming dataset from a leading on-demand delivery plat
&lt;/p&gt;</description></item><item><title>&#22312;&#22810;&#20803;&#22238;&#24402;&#19981;&#36830;&#32493;&#35774;&#35745;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#22810;&#20803;&#23616;&#37096;&#22810;&#39033;&#24335;&#20272;&#35745;&#26041;&#27861;&#65292;&#33021;&#22815;&#22788;&#29702;&#22810;&#20803;&#35774;&#35745;&#24182;&#25429;&#25417;&#36793;&#30028;&#22788;&#30340;&#24322;&#36136;&#27835;&#30103;&#25928;&#24212;&#12290;</title><link>https://arxiv.org/abs/2402.08941</link><description>&lt;p&gt;
&#22810;&#20803;&#22238;&#24402;&#19981;&#36830;&#32493;&#35774;&#35745;&#30340;&#23616;&#37096;&#22810;&#39033;&#24335;&#20272;&#35745;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Local-Polynomial Estimation for Multivariate Regression Discontinuity Designs
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.08941
&lt;/p&gt;
&lt;p&gt;
&#22312;&#22810;&#20803;&#22238;&#24402;&#19981;&#36830;&#32493;&#35774;&#35745;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#22810;&#20803;&#23616;&#37096;&#22810;&#39033;&#24335;&#20272;&#35745;&#26041;&#27861;&#65292;&#33021;&#22815;&#22788;&#29702;&#22810;&#20803;&#35774;&#35745;&#24182;&#25429;&#25417;&#36793;&#30028;&#22788;&#30340;&#24322;&#36136;&#27835;&#30103;&#25928;&#24212;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#20010;&#22810;&#20803;&#23616;&#37096;&#32447;&#24615;&#20272;&#35745;&#22120;&#65292;&#29992;&#20110;&#22788;&#29702;&#22810;&#20803;&#22238;&#24402;&#19981;&#36830;&#32493;&#35774;&#35745;&#20013;&#30340;&#27835;&#30103;&#20998;&#37197;&#38382;&#39064;&#12290;&#29616;&#26377;&#30340;&#26041;&#27861;&#20351;&#29992;&#20174;&#36793;&#30028;&#28857;&#21040;&#27431;&#27663;&#36317;&#31163;&#20316;&#20026;&#26631;&#37327;&#36816;&#34892;&#21464;&#37327;&#65292;&#22240;&#27492;&#22810;&#20803;&#35774;&#35745;&#34987;&#22788;&#29702;&#20026;&#21333;&#21464;&#37327;&#35774;&#35745;&#12290;&#28982;&#32780;&#65292;&#36317;&#31163;&#36816;&#34892;&#21464;&#37327;&#19982;&#28176;&#36817;&#26377;&#25928;&#24615;&#30340;&#20551;&#35774;&#19981;&#30456;&#23481;&#12290;&#25105;&#20204;&#23558;&#22810;&#20803;&#35774;&#35745;&#20316;&#20026;&#22810;&#20803;&#22788;&#29702;&#12290;&#22312;&#36825;&#39033;&#30740;&#31350;&#20013;&#65292;&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#31181;&#38024;&#23545;&#22810;&#20803;&#23616;&#37096;&#22810;&#39033;&#24335;&#20272;&#35745;&#22120;&#30340;&#26032;&#22411;&#28176;&#36817;&#27491;&#24120;&#24615;&#12290;&#25105;&#20204;&#30340;&#20272;&#35745;&#22120;&#26159;&#28176;&#36817;&#26377;&#25928;&#30340;&#65292;&#24182;&#33021;&#25429;&#25417;&#36793;&#30028;&#22788;&#30340;&#24322;&#36136;&#27835;&#30103;&#25928;&#24212;&#12290;&#36890;&#36807;&#25968;&#20540;&#27169;&#25311;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#25105;&#20204;&#20272;&#35745;&#22120;&#30340;&#26377;&#25928;&#24615;&#12290;&#25105;&#20204;&#22312;&#21733;&#20262;&#27604;&#20122;&#22870;&#23398;&#37329;&#30740;&#31350;&#20013;&#30340;&#23454;&#35777;&#35828;&#26126;&#25581;&#31034;&#20102;&#27835;&#30103;&#25928;&#24212;&#30340;&#26356;&#20016;&#23500;&#30340;&#24322;&#36136;&#24615;&#65288;&#21253;&#25324;&#20854;&#19981;&#23384;&#22312;&#65289;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.08941v1 Announce Type: new Abstract: We introduce a multivariate local-linear estimator for multivariate regression discontinuity designs in which treatment is assigned by crossing a boundary in the space of running variables. The dominant approach uses the Euclidean distance from a boundary point as the scalar running variable; hence, multivariate designs are handled as uni-variate designs. However, the distance running variable is incompatible with the assumption for asymptotic validity. We handle multivariate designs as multivariate. In this study, we develop a novel asymptotic normality for multivariate local-polynomial estimators. Our estimator is asymptotically valid and can capture heterogeneous treatment effects over the boundary. We demonstrate the effectiveness of our estimator through numerical simulations. Our empirical illustration of a Colombian scholarship study reveals a richer heterogeneity (including its absence) of the treatment effect that is hidden in th
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#36890;&#36807;&#23558;&#20010;&#20307;&#20043;&#38388;&#30340;&#20114;&#21160;&#19982;&#31038;&#20250;&#35268;&#33539;&#21442;&#32771;&#30456;&#36830;&#25509;&#65292;&#25581;&#31034;&#20102;&#26102;&#38388;&#20559;&#22909;&#23545;&#36130;&#23500;&#20998;&#37197;&#21644;&#19981;&#24179;&#31561;&#30340;&#24433;&#21709;&#12290;&#36890;&#36807;&#27169;&#22411;&#35745;&#31639;&#21644;&#23454;&#35777;&#20998;&#26512;&#65292;&#32467;&#26524;&#26174;&#31034;&#65292;&#20010;&#20307;&#20043;&#38388;&#30340;&#28040;&#36153;&#27604;&#36739;&#23545;&#36130;&#23500;&#19981;&#24179;&#31561;&#21644;&#25928;&#29992;&#20135;&#29983;&#26174;&#33879;&#24433;&#21709;&#12290;&#31038;&#20250;&#35268;&#33539;&#22312;&#19968;&#23450;&#31243;&#24230;&#19978;&#21487;&#20197;&#20943;&#32531;&#36825;&#31181;&#24433;&#21709;&#12290;&#36825;&#20010;&#26041;&#27861;&#25552;&#20379;&#20102;&#19968;&#20010;&#26032;&#30340;&#26694;&#26550;&#65292;&#29992;&#20110;&#29702;&#35299;&#26102;&#38388;&#20559;&#22909;&#22312;&#32463;&#27982;&#19981;&#24179;&#31561;&#20013;&#30340;&#20316;&#29992;&#12290;</title><link>https://arxiv.org/abs/2402.08905</link><description>&lt;p&gt;
&#26102;&#38388;&#20559;&#22909;&#12289;&#36130;&#23500;&#21644;&#25928;&#29992;&#19981;&#24179;&#31561;&#65306;&#19968;&#31181;&#24494;&#35266;&#32463;&#27982;&#20114;&#21160;&#21644;&#21160;&#24577;&#23439;&#35266;&#32463;&#27982;&#27169;&#22411;&#36830;&#25509;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Time preference, wealth and utility inequality: A microeconomic interaction and dynamic macroeconomic model connection approach
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.08905
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#36890;&#36807;&#23558;&#20010;&#20307;&#20043;&#38388;&#30340;&#20114;&#21160;&#19982;&#31038;&#20250;&#35268;&#33539;&#21442;&#32771;&#30456;&#36830;&#25509;&#65292;&#25581;&#31034;&#20102;&#26102;&#38388;&#20559;&#22909;&#23545;&#36130;&#23500;&#20998;&#37197;&#21644;&#19981;&#24179;&#31561;&#30340;&#24433;&#21709;&#12290;&#36890;&#36807;&#27169;&#22411;&#35745;&#31639;&#21644;&#23454;&#35777;&#20998;&#26512;&#65292;&#32467;&#26524;&#26174;&#31034;&#65292;&#20010;&#20307;&#20043;&#38388;&#30340;&#28040;&#36153;&#27604;&#36739;&#23545;&#36130;&#23500;&#19981;&#24179;&#31561;&#21644;&#25928;&#29992;&#20135;&#29983;&#26174;&#33879;&#24433;&#21709;&#12290;&#31038;&#20250;&#35268;&#33539;&#22312;&#19968;&#23450;&#31243;&#24230;&#19978;&#21487;&#20197;&#20943;&#32531;&#36825;&#31181;&#24433;&#21709;&#12290;&#36825;&#20010;&#26041;&#27861;&#25552;&#20379;&#20102;&#19968;&#20010;&#26032;&#30340;&#26694;&#26550;&#65292;&#29992;&#20110;&#29702;&#35299;&#26102;&#38388;&#20559;&#22909;&#22312;&#32463;&#27982;&#19981;&#24179;&#31561;&#20013;&#30340;&#20316;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22522;&#20110;&#20010;&#20307;&#19982;&#20182;&#20154;&#30340;&#20114;&#21160;&#19982;&#23545;&#31038;&#20250;&#35268;&#33539;&#30340;&#21442;&#32771;&#65292;&#26412;&#30740;&#31350;&#25581;&#31034;&#20102;&#26102;&#38388;&#20559;&#22909;&#30340;&#24322;&#36136;&#24615;&#23545;&#36130;&#23500;&#20998;&#37197;&#21644;&#19981;&#24179;&#31561;&#30340;&#24433;&#21709;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#26041;&#27861;&#65292;&#23558;&#20135;&#29983;&#24322;&#36136;&#24615;&#30340;&#24494;&#35266;&#32463;&#27982;&#20027;&#20307;&#20043;&#38388;&#30340;&#20114;&#21160;&#19982;&#23439;&#35266;&#32463;&#27982;&#27169;&#22411;&#20013;&#30340;&#36164;&#26412;&#21644;&#28040;&#36153;&#21160;&#24577;&#26041;&#31243;&#30456;&#36830;&#25509;&#12290;&#21033;&#29992;&#36825;&#31181;&#26041;&#27861;&#65292;&#25105;&#20204;&#20272;&#35745;&#20102;&#24494;&#35266;&#32463;&#27982;&#20114;&#21160;&#24341;&#36215;&#30340;&#25240;&#29616;&#29575;&#21464;&#21270;&#23545;&#36164;&#26412;&#12289;&#28040;&#36153;&#21644;&#25928;&#29992;&#20197;&#21450;&#19981;&#24179;&#31561;&#31243;&#24230;&#30340;&#24433;&#21709;&#12290;&#32467;&#26524;&#26174;&#31034;&#65292;&#19982;&#20182;&#20154;&#30340;&#28040;&#36153;&#27604;&#36739;&#26174;&#33879;&#24433;&#21709;&#36164;&#26412;&#65292;&#21363;&#36130;&#23500;&#19981;&#24179;&#31561;&#12290;&#27492;&#22806;&#65292;&#23545;&#25928;&#29992;&#30340;&#24433;&#21709;&#20174;&#26410;&#24494;&#23567;&#65292;&#24182;&#19988;&#31038;&#20250;&#35268;&#33539;&#21487;&#20197;&#20943;&#23569;&#36825;&#31181;&#24433;&#21709;&#12290;&#25105;&#20204;&#30340;&#25903;&#25345;&#35777;&#25454;&#26174;&#31034;&#65292;&#19981;&#24179;&#31561;&#35745;&#31639;&#30340;&#23450;&#37327;&#32467;&#26524;&#19982;&#38431;&#21015;&#21644;&#36328;&#25991;&#21270;&#30740;&#31350;&#30340;&#35843;&#26597;&#25968;&#25454;&#30456;&#31526;&#12290;&#26412;&#30740;&#31350;&#30340;&#24494;&#35266;-&#23439;&#35266;&#36830;&#25509;&#26041;&#27861;&#20026;&#29702;&#35299;&#26102;&#38388;&#20559;&#22909;&#23545;&#32463;&#27982;&#19981;&#24179;&#31561;&#30340;&#24433;&#21709;&#25552;&#20379;&#20102;&#26032;&#30340;&#26694;&#26550;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.08905v1 Announce Type: new Abstract: Based on interactions between individuals and others and references to social norms, this study reveals the impact of heterogeneity in time preference on wealth distribution and inequality. We present a novel approach that connects the interactions between microeconomic agents that generate heterogeneity to the dynamic equations for capital and consumption in macroeconomic models. Using this approach, we estimate the impact of changes in the discount rate due to microeconomic interactions on capital, consumption and utility and the degree of inequality. The results show that intercomparisons with others regarding consumption significantly affect capital, i.e. wealth inequality. Furthermore, the impact on utility is never small and social norms can reduce this impact. Our supporting evidence shows that the quantitative results of inequality calculations correspond to survey data from cohort and cross-cultural studies. This study's micro-ma
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20379;&#20102;&#19968;&#20010;&#31639;&#27861;&#20844;&#24179;&#24615;&#21644;&#20934;&#30830;&#24615;&#25512;&#29702;&#30340;&#26041;&#27861;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#19968;&#33268;&#30340;&#20272;&#35745;&#22120;&#65292;&#24182;&#36827;&#34892;&#20102;&#19968;&#20123;&#26816;&#39564;&#20551;&#35774;&#30340;&#25512;&#29702;&#12290;&#21516;&#26102;&#65292;&#25105;&#20204;&#36824;&#32473;&#20986;&#20102;&#19968;&#20010;&#20272;&#35745;&#22120;&#26469;&#35745;&#31639;&#19968;&#20010;&#32473;&#23450;&#31639;&#27861;&#19982;&#21069;&#27839;&#19978;&#26368;&#20844;&#24179;&#28857;&#20043;&#38388;&#30340;&#36317;&#31163;&#65292;&#24182;&#25551;&#36848;&#20102;&#23427;&#30340;&#28176;&#36817;&#24615;&#36136;&#12290;</title><link>https://arxiv.org/abs/2402.08879</link><description>&lt;p&gt;
&#19968;&#20010;&#31639;&#27861;&#20844;&#24179;&#24615;&#21644;&#20934;&#30830;&#24615;&#30340;&#25512;&#29702;
&lt;/p&gt;
&lt;p&gt;
Inference for an Algorithmic Fairness-Accuracy Frontier
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.08879
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20379;&#20102;&#19968;&#20010;&#31639;&#27861;&#20844;&#24179;&#24615;&#21644;&#20934;&#30830;&#24615;&#25512;&#29702;&#30340;&#26041;&#27861;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#19968;&#33268;&#30340;&#20272;&#35745;&#22120;&#65292;&#24182;&#36827;&#34892;&#20102;&#19968;&#20123;&#26816;&#39564;&#20551;&#35774;&#30340;&#25512;&#29702;&#12290;&#21516;&#26102;&#65292;&#25105;&#20204;&#36824;&#32473;&#20986;&#20102;&#19968;&#20010;&#20272;&#35745;&#22120;&#26469;&#35745;&#31639;&#19968;&#20010;&#32473;&#23450;&#31639;&#27861;&#19982;&#21069;&#27839;&#19978;&#26368;&#20844;&#24179;&#28857;&#20043;&#38388;&#30340;&#36317;&#31163;&#65292;&#24182;&#25551;&#36848;&#20102;&#23427;&#30340;&#28176;&#36817;&#24615;&#36136;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20915;&#31574;&#36807;&#31243;&#36234;&#26469;&#36234;&#20381;&#36182;&#20110;&#31639;&#27861;&#30340;&#20351;&#29992;&#12290;&#28982;&#32780;&#65292;&#31639;&#27861;&#30340;&#39044;&#27979;&#33021;&#21147;&#22312;&#20154;&#21475;&#30340;&#19981;&#21516;&#23376;&#32676;&#20307;&#20013;&#32463;&#24120;&#20986;&#29616;&#31995;&#32479;&#24615;&#21464;&#21270;&#12290;&#34429;&#28982;&#20844;&#24179;&#24615;&#21644;&#20934;&#30830;&#24615;&#37117;&#26159;&#31639;&#27861;&#30340;&#26399;&#26395;&#29305;&#24615;&#65292;&#20294;&#23427;&#20204;&#24120;&#24120;&#26159;&#30456;&#20114;&#29306;&#29298;&#30340;&#12290;&#37027;&#20040;&#65292;&#24403;&#38754;&#23545;&#26377;&#38480;&#30340;&#25968;&#25454;&#26102;&#65292;&#19968;&#20010;&#27880;&#37325;&#20844;&#24179;&#24615;&#30340;&#20915;&#31574;&#32773;&#24212;&#35813;&#24590;&#20040;&#20570;&#21602;?&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#20026;Liang&#65292;Lu&#21644;Mu&#65288;2023&#65289;&#25552;&#20986;&#30340;&#19968;&#20010;&#29702;&#35770;&#20844;&#24179;&#24615;-&#20934;&#30830;&#24615;&#21069;&#27839;&#25552;&#20379;&#20102;&#19968;&#33268;&#30340;&#20272;&#35745;&#22120;&#65292;&#24182;&#25552;&#20986;&#20102;&#26816;&#39564;&#20551;&#35774;&#30340;&#25512;&#29702;&#26041;&#27861;&#12290;&#36825;&#20123;&#20551;&#35774;&#22312;&#20844;&#24179;&#24615;&#25991;&#29486;&#20013;&#24341;&#36215;&#20102;&#24456;&#22810;&#20851;&#27880;&#65292;&#20363;&#22914;(i)&#20840;&#38754;&#25490;&#38500;&#22312;&#31639;&#27861;&#35757;&#32451;&#20013;&#20351;&#29992;&#19968;&#20010;&#21327;&#21464;&#37327;&#26159;&#21542;&#26159;&#26368;&#20248;&#30340;&#65292;(ii)&#26159;&#21542;&#23384;&#22312;&#23545;&#29616;&#26377;&#31639;&#27861;&#26356;&#23569;&#27495;&#35270;&#24615;&#30340;&#26367;&#20195;&#26041;&#26696;&#12290;&#25105;&#20204;&#36824;&#20026;&#32473;&#23450;&#31639;&#27861;&#19982;&#21069;&#27839;&#19978;&#26368;&#20844;&#24179;&#28857;&#20043;&#38388;&#30340;&#36317;&#31163;&#25552;&#20379;&#20102;&#19968;&#20010;&#20272;&#35745;&#22120;&#65292;&#24182;&#25551;&#36848;&#20102;&#23427;&#30340;&#28176;&#36817;&#24615;&#36136;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.08879v1 Announce Type: cross Abstract: Decision-making processes increasingly rely on the use of algorithms. Yet, algorithms' predictive ability frequently exhibit systematic variation across subgroups of the population. While both fairness and accuracy are desirable properties of an algorithm, they often come at the cost of one another. What should a fairness-minded policymaker do then, when confronted with finite data? In this paper, we provide a consistent estimator for a theoretical fairness-accuracy frontier put forward by Liang, Lu and Mu (2023) and propose inference methods to test hypotheses that have received much attention in the fairness literature, such as (i) whether fully excluding a covariate from use in training the algorithm is optimal and (ii) whether there are less discriminatory alternatives to an existing algorithm. We also provide an estimator for the distance between a given algorithm and the fairest point on the frontier, and characterize its asymptot
&lt;/p&gt;</description></item><item><title>&#36825;&#39033;&#30740;&#31350;&#25506;&#35752;&#20102;&#25919;&#24220;&#22312;&#32771;&#34385;&#20844;&#24179;&#24615;&#30340;&#24773;&#20917;&#19979;&#25552;&#20379;&#31119;&#21033;&#24182;&#36827;&#34892;&#31579;&#36873;&#30340;&#38382;&#39064;&#12290;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;&#34429;&#28982;&#25919;&#24220;&#26080;&#27861;&#36890;&#36807;&#21333;&#19968;&#24037;&#20855;&#36827;&#34892;&#20844;&#24179;&#31579;&#36873;&#65292;&#20294;&#36890;&#36807;&#32467;&#21512;&#22810;&#31181;&#24037;&#20855;&#65292;&#21487;&#20197;&#23454;&#29616;&#31579;&#36873;&#24182;&#20135;&#29983;&#20844;&#24179;&#30340;&#20998;&#37197;&#12290;</title><link>https://arxiv.org/abs/2402.08781</link><description>&lt;p&gt;
&#20844;&#24179;&#31579;&#36873;
&lt;/p&gt;
&lt;p&gt;
Equitable screening
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.08781
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#30740;&#31350;&#25506;&#35752;&#20102;&#25919;&#24220;&#22312;&#32771;&#34385;&#20844;&#24179;&#24615;&#30340;&#24773;&#20917;&#19979;&#25552;&#20379;&#31119;&#21033;&#24182;&#36827;&#34892;&#31579;&#36873;&#30340;&#38382;&#39064;&#12290;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;&#34429;&#28982;&#25919;&#24220;&#26080;&#27861;&#36890;&#36807;&#21333;&#19968;&#24037;&#20855;&#36827;&#34892;&#20844;&#24179;&#31579;&#36873;&#65292;&#20294;&#36890;&#36807;&#32467;&#21512;&#22810;&#31181;&#24037;&#20855;&#65292;&#21487;&#20197;&#23454;&#29616;&#31579;&#36873;&#24182;&#20135;&#29983;&#20844;&#24179;&#30340;&#20998;&#37197;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#30740;&#31350;&#20102;&#25919;&#24220;&#22312;&#32771;&#34385;&#32467;&#26524;&#20998;&#37197;&#30340;&#20844;&#24179;&#24615;&#26102;&#25552;&#20379;&#31119;&#21033;&#30340;&#38382;&#39064;&#12290;&#36825;&#20123;&#20851;&#27880;&#36890;&#36807;&#20844;&#24179;&#24615;&#38480;&#21046;&#26469;&#24314;&#27169;&#65292;&#35201;&#27714;&#24212;&#35813;&#24179;&#31561;&#22320;&#32473;&#20104;&#24179;&#31561;&#20540;&#24471;&#30340;&#20195;&#29702;&#20154;&#20998;&#37197;&#12290;&#25105;&#30740;&#31350;&#20102;&#21738;&#20123;&#31579;&#36873;&#24418;&#24335;&#19982;&#20844;&#24179;&#30456;&#23481;&#65292;&#24182;&#23637;&#31034;&#20102;&#34429;&#28982;&#25919;&#24220;&#26080;&#27861;&#36890;&#36807;&#21333;&#19968;&#24037;&#20855;&#65288;&#22914;&#25903;&#20184;&#25110;&#31561;&#24453;&#26102;&#38388;&#65289;&#36827;&#34892;&#20844;&#24179;&#31579;&#36873;&#65292;&#20294;&#23558;&#22810;&#20010;&#24037;&#20855;&#32467;&#21512;&#36215;&#26469;&#65292;&#36825;&#20123;&#24037;&#20855;&#26412;&#36523;&#23601;&#26377;&#21033;&#20110;&#19981;&#21516;&#30340;&#32676;&#20307;&#65292;&#21487;&#20197;&#23454;&#29616;&#31579;&#36873;&#21516;&#26102;&#20135;&#29983;&#20844;&#24179;&#30340;&#20998;&#37197;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.08781v1 Announce Type: new Abstract: I study the problem of a government providing benefits while considering the perceived equity of the resulting allocation. Such concerns are modeled through an equity constraint requiring that equally deserving agents receive equal allocations. I ask what forms of screening are compatible with equity and show that while the government cannot equitably screen with a single instrument (e.g. payments or wait times), combining multiple instruments, which on their own favor different groups, allows it to screen while still producing an equitable allocation.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25506;&#35752;&#20102;&#20351;&#29992;LLMs&#29983;&#25104;&#21512;&#25104;&#20154;&#31867;&#28436;&#31034;&#30340;&#26041;&#27861;&#65292;&#28982;&#21518;&#36890;&#36807;&#27169;&#20223;&#23398;&#20064;&#26469;&#23398;&#20064;&#20122;&#29702;&#24615;&#20195;&#29702;&#31574;&#30053;&#65292;&#20174;&#32780;&#27169;&#25311;&#20122;&#29702;&#24615;&#34892;&#20026;&#65292;&#24182;&#20026;&#25105;&#20204;&#29702;&#35299;&#20154;&#31867;&#34892;&#20026;&#25552;&#20379;&#20102;&#25913;&#36827;&#30340;&#21487;&#33021;&#24615;&#12290;</title><link>https://arxiv.org/abs/2402.08755</link><description>&lt;p&gt;
LLM&#39537;&#21160;&#30340;&#27169;&#25311;&#20122;&#29702;&#24615;&#34892;&#20026;&#65306;&#24187;&#35273;&#36824;&#26159;&#29616;&#23454;&#65311;
&lt;/p&gt;
&lt;p&gt;
LLM-driven Imitation of Subrational Behavior : Illusion or Reality?
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.08755
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25506;&#35752;&#20102;&#20351;&#29992;LLMs&#29983;&#25104;&#21512;&#25104;&#20154;&#31867;&#28436;&#31034;&#30340;&#26041;&#27861;&#65292;&#28982;&#21518;&#36890;&#36807;&#27169;&#20223;&#23398;&#20064;&#26469;&#23398;&#20064;&#20122;&#29702;&#24615;&#20195;&#29702;&#31574;&#30053;&#65292;&#20174;&#32780;&#27169;&#25311;&#20122;&#29702;&#24615;&#34892;&#20026;&#65292;&#24182;&#20026;&#25105;&#20204;&#29702;&#35299;&#20154;&#31867;&#34892;&#20026;&#25552;&#20379;&#20102;&#25913;&#36827;&#30340;&#21487;&#33021;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24314;&#27169;&#20122;&#29702;&#24615;&#20195;&#29702;&#65292;&#22914;&#20154;&#31867;&#25110;&#32463;&#27982;&#23478;&#24237;&#65292;&#30001;&#20110;&#26657;&#20934;&#24378;&#21270;&#23398;&#20064;&#27169;&#22411;&#30340;&#22256;&#38590;&#25110;&#25910;&#38598;&#28041;&#21450;&#20154;&#31867;&#20027;&#20307;&#30340;&#25968;&#25454;&#30340;&#38590;&#24230;&#32780;&#20855;&#26377;&#25361;&#25112;&#24615;&#12290;&#29616;&#26377;&#30740;&#31350;&#24378;&#35843;&#20102;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLMs&#65289;&#35299;&#20915;&#22797;&#26434;&#25512;&#29702;&#20219;&#21153;&#21644;&#27169;&#20223;&#20154;&#31867;&#20132;&#27969;&#30340;&#33021;&#21147;&#65292;&#32780;&#20351;&#29992;LLMs&#20316;&#20026;&#20195;&#29702;&#36827;&#34892;&#27169;&#25311;&#26174;&#31034;&#20986;&#20986;&#29616;&#30340;&#31038;&#20132;&#34892;&#20026;&#65292;&#21487;&#33021;&#25552;&#39640;&#25105;&#20204;&#23545;&#20154;&#31867;&#34892;&#20026;&#30340;&#29702;&#35299;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#35758;&#30740;&#31350;&#20351;&#29992;LLMs&#29983;&#25104;&#21512;&#25104;&#30340;&#20154;&#31867;&#28436;&#31034;&#65292;&#28982;&#21518;&#36890;&#36807;&#27169;&#20223;&#23398;&#20064;&#26469;&#23398;&#20064;&#20122;&#29702;&#24615;&#20195;&#29702;&#31574;&#30053;&#12290;&#25105;&#20204;&#20551;&#35774;LLMs&#21487;&#20197;&#29992;&#20316;&#20154;&#31867;&#30340;&#38544;&#24335;&#35745;&#31639;&#27169;&#22411;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#20010;&#26694;&#26550;&#65292;&#20351;&#29992;&#20174;LLMs&#27966;&#29983;&#30340;&#21512;&#25104;&#28436;&#31034;&#26469;&#24314;&#27169;&#20154;&#31867;&#29305;&#26377;&#30340;&#20122;&#29702;&#24615;&#34892;&#20026;&#65288;&#20363;&#22914;&#65292;&#30446;&#20809;&#30701;&#27973;&#30340;&#34892;&#20026;&#25110;&#23545;&#39118;&#38505;&#35268;&#36991;&#30340;&#20559;&#22909;&#65289;&#12290;&#25105;&#20204;&#36827;&#34892;&#20102;&#23454;&#39564;&#35777;&#26126;:
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.08755v1 Announce Type: new Abstract: Modeling subrational agents, such as humans or economic households, is inherently challenging due to the difficulty in calibrating reinforcement learning models or collecting data that involves human subjects. Existing work highlights the ability of Large Language Models (LLMs) to address complex reasoning tasks and mimic human communication, while simulation using LLMs as agents shows emergent social behaviors, potentially improving our comprehension of human conduct. In this paper, we propose to investigate the use of LLMs to generate synthetic human demonstrations, which are then used to learn subrational agent policies though Imitation Learning. We make an assumption that LLMs can be used as implicit computational models of humans, and propose a framework to use synthetic demonstrations derived from LLMs to model subrational behaviors that are characteristic of humans (e.g., myopic behavior or preference for risk aversion). We experim
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#20026;&#20102;&#35299;&#20915;&#21512;&#25104;&#23545;&#29031;&#26041;&#27861;&#20013;"&#37325;&#21472;"&#20551;&#35774;&#30340;&#38382;&#39064;&#30340;&#28608;&#21169;&#24863;&#30693;&#21512;&#25104;&#23545;&#29031;&#26041;&#27861;&#12290;&#35813;&#26041;&#27861;&#36890;&#36807;&#28608;&#21169;&#21333;&#20301;&#37319;&#21462;&#36890;&#24120;&#19981;&#20250;&#32771;&#34385;&#30340;&#24178;&#39044;&#25514;&#26045;&#65292;&#25552;&#20379;&#19982;&#28608;&#21169;&#30456;&#23481;&#30340;&#24178;&#39044;&#24314;&#35758;&#65292;&#20174;&#32780;&#23454;&#29616;&#22312;&#38754;&#26495;&#25968;&#25454;&#29615;&#22659;&#20013;&#20934;&#30830;&#20272;&#35745;&#21453;&#20107;&#23454;&#25928;&#26524;&#12290;</title><link>https://arxiv.org/abs/2312.16307</link><description>&lt;p&gt;
&#28608;&#21169;&#24863;&#30693;&#21512;&#25104;&#23545;&#29031;&#26041;&#27861;&#65306;&#36890;&#36807;&#28608;&#21169;&#25506;&#32034;&#36827;&#34892;&#20934;&#30830;&#30340;&#21453;&#20107;&#23454;&#20272;&#35745;
&lt;/p&gt;
&lt;p&gt;
Incentive-Aware Synthetic Control: Accurate Counterfactual Estimation via Incentivized Exploration
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2312.16307
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#20026;&#20102;&#35299;&#20915;&#21512;&#25104;&#23545;&#29031;&#26041;&#27861;&#20013;"&#37325;&#21472;"&#20551;&#35774;&#30340;&#38382;&#39064;&#30340;&#28608;&#21169;&#24863;&#30693;&#21512;&#25104;&#23545;&#29031;&#26041;&#27861;&#12290;&#35813;&#26041;&#27861;&#36890;&#36807;&#28608;&#21169;&#21333;&#20301;&#37319;&#21462;&#36890;&#24120;&#19981;&#20250;&#32771;&#34385;&#30340;&#24178;&#39044;&#25514;&#26045;&#65292;&#25552;&#20379;&#19982;&#28608;&#21169;&#30456;&#23481;&#30340;&#24178;&#39044;&#24314;&#35758;&#65292;&#20174;&#32780;&#23454;&#29616;&#22312;&#38754;&#26495;&#25968;&#25454;&#29615;&#22659;&#20013;&#20934;&#30830;&#20272;&#35745;&#21453;&#20107;&#23454;&#25928;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#32771;&#34385;&#21512;&#25104;&#23545;&#29031;&#26041;&#27861;&#65288;SCMs&#65289;&#30340;&#35774;&#23450;&#65292;&#36825;&#26159;&#19968;&#31181;&#22312;&#38754;&#26495;&#25968;&#25454;&#29615;&#22659;&#20013;&#20272;&#35745;&#34987;&#27835;&#30103;&#23545;&#35937;&#30340;&#27835;&#30103;&#25928;&#24212;&#30340;&#32463;&#20856;&#26041;&#27861;&#12290;&#25105;&#20204;&#25581;&#31034;&#20102;SCMs&#20013;&#32463;&#24120;&#34987;&#24573;&#35270;&#20294;&#26222;&#36941;&#23384;&#22312;&#30340;&#8220;&#37325;&#21472;&#8221;&#20551;&#35774;&#65306;&#19968;&#20010;&#34987;&#27835;&#30103;&#30340;&#21333;&#20301;&#21487;&#20197;&#34987;&#20889;&#25104;&#20445;&#25345;&#25511;&#21046;&#30340;&#21333;&#20301;&#30340;&#26576;&#31181;&#32452;&#21512;&#65288;&#36890;&#24120;&#26159;&#20984;&#25110;&#32447;&#24615;&#32452;&#21512;&#65289;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#22914;&#26524;&#21333;&#20301;&#36873;&#25321;&#33258;&#24049;&#30340;&#24178;&#39044;&#25514;&#26045;&#65292;&#24182;&#19988;&#21333;&#20301;&#20043;&#38388;&#30340;&#24322;&#36136;&#24615;&#36275;&#22815;&#22823;&#65292;&#20197;&#33267;&#20110;&#20182;&#20204;&#20559;&#22909;&#19981;&#21516;&#30340;&#24178;&#39044;&#25514;&#26045;&#65292;&#37325;&#21472;&#23558;&#19981;&#25104;&#31435;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#26694;&#26550;&#65292;&#36890;&#36807;&#28608;&#21169;&#20855;&#26377;&#19981;&#21516;&#20559;&#22909;&#30340;&#21333;&#20301;&#26469;&#37319;&#21462;&#20182;&#20204;&#36890;&#24120;&#19981;&#20250;&#32771;&#34385;&#30340;&#24178;&#39044;&#25514;&#26045;&#12290;&#20855;&#20307;&#26469;&#35828;&#65292;&#25105;&#20204;&#21033;&#29992;&#20449;&#24687;&#35774;&#35745;&#21644;&#22312;&#32447;&#23398;&#20064;&#30340;&#24037;&#20855;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;SCM&#65292;&#36890;&#36807;&#20026;&#21333;&#20301;&#25552;&#20379;&#19982;&#28608;&#21169;&#30456;&#23481;&#30340;&#24178;&#39044;&#24314;&#35758;&#65292;&#22312;&#38754;&#26495;&#25968;&#25454;&#29615;&#22659;&#20013;&#28608;&#21169;&#25506;&#32034;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2312.16307v2 Announce Type: replace-cross Abstract: We consider the setting of synthetic control methods (SCMs), a canonical approach used to estimate the treatment effect on the treated in a panel data setting. We shed light on a frequently overlooked but ubiquitous assumption made in SCMs of "overlap": a treated unit can be written as some combination -- typically, convex or linear combination -- of the units that remain under control. We show that if units select their own interventions, and there is sufficiently large heterogeneity between units that prefer different interventions, overlap will not hold. We address this issue by proposing a framework which incentivizes units with different preferences to take interventions they would not normally consider. Specifically, leveraging tools from information design and online learning, we propose a SCM that incentivizes exploration in panel data settings by providing incentive-compatible intervention recommendations to units. We e
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#19968;&#31181;&#20844;&#24179;&#21010;&#20998;&#21487;&#21010;&#20998;&#24322;&#36136;&#36164;&#28304;&#30340;&#38382;&#39064;&#65292;&#21363;&#34507;&#31957;&#20999;&#20998;&#12290;&#35813;&#35770;&#25991;&#30830;&#23450;&#20102;&#23384;&#22312;&#19968;&#31181;&#36830;&#36890;&#30340;&#24378;&#27604;&#20363;&#20999;&#20998;&#26041;&#24335;&#65292;&#24182;&#25552;&#20379;&#20102;&#30456;&#24212;&#30340;&#31639;&#27861;&#21644;&#31616;&#21333;&#21051;&#30011;&#12290;</title><link>https://arxiv.org/abs/2312.15326</link><description>&lt;p&gt;
&#20851;&#20110;&#36830;&#36890;&#19988;&#24378;&#27604;&#20363;&#20999;&#34507;&#31957;&#30340;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
On Connected Strongly-Proportional Cake-Cutting
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2312.15326
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#19968;&#31181;&#20844;&#24179;&#21010;&#20998;&#21487;&#21010;&#20998;&#24322;&#36136;&#36164;&#28304;&#30340;&#38382;&#39064;&#65292;&#21363;&#34507;&#31957;&#20999;&#20998;&#12290;&#35813;&#35770;&#25991;&#30830;&#23450;&#20102;&#23384;&#22312;&#19968;&#31181;&#36830;&#36890;&#30340;&#24378;&#27604;&#20363;&#20999;&#20998;&#26041;&#24335;&#65292;&#24182;&#25552;&#20379;&#20102;&#30456;&#24212;&#30340;&#31639;&#27861;&#21644;&#31616;&#21333;&#21051;&#30011;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#22312;&#19968;&#32452;&#20195;&#29702;&#20154;&#20013;&#22914;&#20309;&#20844;&#24179;&#22320;&#20998;&#37197;&#21487;&#21010;&#20998;&#30340;&#24322;&#36136;&#36164;&#28304;&#65292;&#20063;&#31216;&#20026;&#34507;&#31957;&#12290;&#25105;&#20204;&#30830;&#23450;&#20102;&#23384;&#22312;&#30528;&#19968;&#31181;&#20998;&#37197;&#26041;&#24335;&#65292;&#27599;&#20010;&#20195;&#29702;&#20154;&#37117;&#20250;&#25910;&#21040;&#19968;&#20010;&#20215;&#20540;&#20005;&#26684;&#36229;&#36807;&#20182;&#20204;&#27604;&#20363;&#20221;&#39069;&#30340;&#36830;&#32493;&#37096;&#20998;&#65292;&#20063;&#31216;&#20026;*&#24378;&#27604;&#20363;&#20998;&#37197;*&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#31639;&#27861;&#65292;&#21487;&#20197;&#20351;&#29992;&#26368;&#22810;$n \cdot 2^{n-1}$&#20010;&#26597;&#35810;&#26469;&#30830;&#23450;&#26159;&#21542;&#23384;&#22312;&#19968;&#20010;&#36830;&#36890;&#30340;&#24378;&#27604;&#20363;&#20998;&#37197;&#12290;&#23545;&#20110;&#20855;&#26377;&#20005;&#26684;&#27491;&#20272;&#20540;&#30340;&#20195;&#29702;&#20154;&#65292;&#25105;&#20204;&#25552;&#20379;&#20102;&#19968;&#20010;&#26356;&#31616;&#21333;&#30340;&#21051;&#30011;&#65292;&#24182;&#19988;&#35777;&#26126;&#20102;&#30830;&#23450;&#26159;&#21542;&#23384;&#22312;&#19968;&#20010;&#36830;&#36890;&#30340;&#24378;&#27604;&#20363;&#20998;&#37197;&#25152;&#38656;&#30340;&#26597;&#35810;&#25968;&#37327;&#26159;$\Theta(n^2)$&#12290;&#25105;&#20204;&#30340;&#35777;&#26126;&#26159;&#26500;&#36896;&#24615;&#30340;&#65292;&#24182;&#19988;&#24403;&#23384;&#22312;&#26102;&#65292;&#32473;&#20986;&#20102;&#19968;&#20010;&#36830;&#36890;&#30340;&#24378;&#27604;&#20363;&#20998;&#37197;&#65292;&#20351;&#29992;&#20102;&#31867;&#20284;&#25968;&#37327;&#30340;&#26597;&#35810;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2312.15326v2 Announce Type: replace-cross Abstract: We investigate the problem of fairly dividing a divisible heterogeneous resource, also known as a cake, among a set of agents. We characterize the existence of an allocation in which every agent receives a contiguous piece worth strictly more than their proportional share, also known as a *strongly-proportional allocation*. The characterization is supplemented with an algorithm that determines the existence of a connected strongly-proportional allocation using at most $n \cdot 2^{n-1}$ queries. We provide a simpler characterization for agents with strictly positive valuations, and show that the number of queries required to determine the existence of a connected strongly-proportional allocation is in $\Theta(n^2)$. Our proofs are constructive and yield a connected strongly-proportional allocation, when it exists, using a similar number of queries.
&lt;/p&gt;</description></item><item><title>&#36890;&#36807;&#27169;&#25311;&#25509;&#25910;&#32773;&#34892;&#20026;&#30340;&#36125;&#21494;&#26031;&#21149;&#23548;&#38382;&#39064;&#20013;&#65292;&#21457;&#36865;&#32773;&#35774;&#35745;&#20102;&#19968;&#20010;&#26368;&#20248;&#28040;&#24687;&#31574;&#30053;&#24182;&#35774;&#35745;&#20102;&#19968;&#20010;&#22810;&#39033;&#24335;&#26102;&#38388;&#26597;&#35810;&#31639;&#27861;&#65292;&#20197;&#20248;&#21270;&#20854;&#39044;&#26399;&#25928;&#29992;&#12290;</title><link>https://arxiv.org/abs/2311.18138</link><description>&lt;p&gt;
&#36890;&#36807;&#27169;&#25311;&#36827;&#34892;&#31639;&#27861;&#24615;&#21149;&#23548;
&lt;/p&gt;
&lt;p&gt;
Algorithmic Persuasion Through Simulation
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2311.18138
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#27169;&#25311;&#25509;&#25910;&#32773;&#34892;&#20026;&#30340;&#36125;&#21494;&#26031;&#21149;&#23548;&#38382;&#39064;&#20013;&#65292;&#21457;&#36865;&#32773;&#35774;&#35745;&#20102;&#19968;&#20010;&#26368;&#20248;&#28040;&#24687;&#31574;&#30053;&#24182;&#35774;&#35745;&#20102;&#19968;&#20010;&#22810;&#39033;&#24335;&#26102;&#38388;&#26597;&#35810;&#31639;&#27861;&#65292;&#20197;&#20248;&#21270;&#20854;&#39044;&#26399;&#25928;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#19968;&#20010;&#36125;&#21494;&#26031;&#21149;&#23548;&#38382;&#39064;&#65292;&#20854;&#20013;&#21457;&#36865;&#32773;&#24076;&#26395;&#35828;&#26381;&#25509;&#25910;&#32773;&#37319;&#21462;&#20108;&#20803;&#34892;&#20026;&#65292;&#20363;&#22914;&#36141;&#20080;&#20135;&#21697;&#12290;&#21457;&#36865;&#32773;&#20102;&#35299;&#19990;&#30028;&#30340;&#65288;&#20108;&#20803;&#65289;&#29366;&#24577;&#65292;&#27604;&#22914;&#20135;&#21697;&#36136;&#37327;&#26159;&#39640;&#36824;&#26159;&#20302;&#65292;&#20294;&#26159;&#23545;&#25509;&#25910;&#32773;&#30340;&#20449;&#24565;&#21644;&#25928;&#29992;&#21482;&#26377;&#26377;&#38480;&#30340;&#20449;&#24687;&#12290;&#21463;&#21040;&#23458;&#25143;&#35843;&#26597;&#12289;&#29992;&#25143;&#30740;&#31350;&#21644;&#29983;&#25104;&#24335;&#20154;&#24037;&#26234;&#33021;&#30340;&#26368;&#26032;&#36827;&#23637;&#30340;&#21551;&#21457;&#65292;&#25105;&#20204;&#20801;&#35768;&#21457;&#36865;&#32773;&#36890;&#36807;&#26597;&#35810;&#27169;&#25311;&#25509;&#25910;&#32773;&#30340;&#34892;&#20026;&#26469;&#20102;&#35299;&#26356;&#22810;&#20851;&#20110;&#25509;&#25910;&#32773;&#30340;&#20449;&#24687;&#12290;&#22312;&#22266;&#23450;&#25968;&#37327;&#30340;&#26597;&#35810;&#20043;&#21518;&#65292;&#21457;&#36865;&#32773;&#25215;&#35834;&#19968;&#20010;&#28040;&#24687;&#31574;&#30053;&#65292;&#25509;&#25910;&#32773;&#26681;&#25454;&#25910;&#21040;&#30340;&#28040;&#24687;&#26469;&#26368;&#22823;&#21270;&#22905;&#30340;&#39044;&#26399;&#25928;&#29992;&#26469;&#37319;&#21462;&#34892;&#21160;&#12290;&#25105;&#20204;&#23545;&#21457;&#36865;&#32773;&#22312;&#20219;&#20309;&#25509;&#25910;&#32773;&#31867;&#22411;&#20998;&#24067;&#19979;&#30340;&#26368;&#20248;&#28040;&#24687;&#31574;&#30053;&#36827;&#34892;&#20102;&#34920;&#24449;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#35774;&#35745;&#20102;&#19968;&#20010;&#22810;&#39033;&#24335;&#26102;&#38388;&#26597;&#35810;&#31639;&#27861;&#65292;&#20248;&#21270;&#20102;&#36825;&#20010;&#36125;&#21494;&#26031;&#21149;&#23548;&#28216;&#25103;&#20013;&#21457;&#36865;&#32773;&#30340;&#39044;&#26399;&#25928;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2311.18138v2 Announce Type: replace-cross Abstract: We study a Bayesian persuasion problem where a sender wants to persuade a receiver to take a binary action, such as purchasing a product. The sender is informed about the (binary) state of the world, such as whether the quality of the product is high or low, but only has limited information about the receiver's beliefs and utilities. Motivated by customer surveys, user studies, and recent advances in generative AI, we allow the sender to learn more about the receiver by querying an oracle that simulates the receiver's behavior. After a fixed number of queries, the sender commits to a messaging policy and the receiver takes the action that maximizes her expected utility given the message she receives. We characterize the sender's optimal messaging policy given any distribution over receiver types. We then design a polynomial-time querying algorithm that optimizes the sender's expected utility in this Bayesian persuasion game. We 
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#20855;&#26377;&#25506;&#32034;&#30340;&#40065;&#26834;&#21512;&#21516;&#38382;&#39064;&#65292;&#20998;&#26512;&#20102;&#22996;&#25176;&#20154;&#19982;&#20195;&#29702;&#20154;&#31614;&#35746;&#21512;&#21516;&#26102;&#30340;&#36947;&#24503;&#39118;&#38505;&#65292;&#24182;&#25214;&#21040;&#20102;&#22312;&#20855;&#26377;&#25506;&#32034;&#30340;&#21160;&#24577;&#29615;&#22659;&#20013;&#31283;&#20581;&#26368;&#20248;&#30340;&#32447;&#24615;&#21512;&#21516;&#12290;</title><link>https://arxiv.org/abs/2212.00157</link><description>&lt;p&gt;
&#20855;&#26377;&#25506;&#32034;&#30340;&#40065;&#26834;&#21512;&#21516;
&lt;/p&gt;
&lt;p&gt;
Robust Contracts with Exploration
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2212.00157
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#20855;&#26377;&#25506;&#32034;&#30340;&#40065;&#26834;&#21512;&#21516;&#38382;&#39064;&#65292;&#20998;&#26512;&#20102;&#22996;&#25176;&#20154;&#19982;&#20195;&#29702;&#20154;&#31614;&#35746;&#21512;&#21516;&#26102;&#30340;&#36947;&#24503;&#39118;&#38505;&#65292;&#24182;&#25214;&#21040;&#20102;&#22312;&#20855;&#26377;&#25506;&#32034;&#30340;&#21160;&#24577;&#29615;&#22659;&#20013;&#31283;&#20581;&#26368;&#20248;&#30340;&#32447;&#24615;&#21512;&#21516;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#19968;&#20010;&#20004;&#26399;&#30340;&#36947;&#24503;&#39118;&#38505;&#38382;&#39064;&#65307;&#26377;&#20004;&#20010;&#20195;&#29702;&#20154;&#65292;&#20854;&#34892;&#21160;&#38598;&#23545;&#20110;&#22996;&#25176;&#20154;&#26469;&#35828;&#26159;&#26410;&#30693;&#30340;&#12290;&#22996;&#25176;&#20154;&#20381;&#27425;&#19982;&#27599;&#20010;&#20195;&#29702;&#20154;&#31614;&#35746;&#21512;&#21516;&#65292;&#24182;&#23547;&#27714;&#26368;&#22823;&#21270;&#26368;&#22351;&#24773;&#20917;&#19979;&#30340;&#25240;&#29616;&#25910;&#30410;&#24635;&#21644;&#65292;&#26368;&#22351;&#24773;&#20917;&#26159;&#22312;&#21487;&#33021;&#30340;&#34892;&#21160;&#38598;&#19978;&#36827;&#34892;&#32771;&#34385;&#12290;&#22996;&#25176;&#20154;&#35266;&#23519;&#31532;&#19968;&#20010;&#20195;&#29702;&#20154;&#36873;&#25321;&#30340;&#34892;&#21160;&#65292;&#28982;&#21518;&#26681;&#25454;&#36825;&#20010;&#30693;&#35782;&#21521;&#31532;&#20108;&#20010;&#20195;&#29702;&#20154;&#25552;&#20379;&#19968;&#20010;&#26032;&#30340;&#21512;&#21516;&#65292;&#20174;&#32780;&#26377;&#26426;&#20250;&#22312;&#31532;&#19968;&#26399;&#36827;&#34892;&#25506;&#32034;&#12290;&#25105;&#20204;&#24341;&#20837;&#24182;&#27604;&#36739;&#20102;&#19977;&#31181;&#19981;&#21516;&#30340;&#21160;&#24577;&#26368;&#22351;&#24773;&#20917;&#32771;&#34385;&#26041;&#24335;&#12290;&#22312;&#27599;&#31181;&#35266;&#28857;&#20013;&#65292;&#25105;&#20204;&#23450;&#20041;&#20102;&#19968;&#31181;&#21512;&#36866;&#30340;&#26356;&#26032;&#35268;&#21017;&#65292;&#24182;&#25551;&#36848;&#20102;&#22996;&#25176;&#20154;&#30340;&#26368;&#20248;&#25910;&#30410;&#20445;&#35777;&#12290;&#25105;&#20204;&#21457;&#29616;&#32447;&#24615;&#21512;&#21516;&#19981;&#20165;&#22312;&#38745;&#24577;&#29615;&#22659;&#19979;&#26159;&#31283;&#20581;&#26368;&#20248;&#30340;&#65292;&#32780;&#19988;&#22312;&#20855;&#26377;&#25506;&#32034;&#30340;&#21160;&#24577;&#29615;&#22659;&#20013;&#20063;&#26159;&#31283;&#20581;&#26368;&#20248;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2212.00157v2 Announce Type: replace Abstract: We study a two-period moral hazard problem; there are two agents, with action sets that are unknown to the principal. The principal contracts with each agent sequentially, and seeks to maximize the worst-case discounted sum of payoffs, where the worst case is over the possible action sets. The principal observes the action chosen by the first agent, and then offers a new contract to the second agent based on this knowledge, thus having the opportunity to explore in the first period. We introduce and compare three different notions of dynamic worst-case considerations. Within each notion, we define a suitable rule of updating and characterize the principal's optimal payoff guarantee. We find that linear contracts are robustly optimal not only in static settings, but also in dynamic environments with exploration.
&lt;/p&gt;</description></item><item><title>&#36825;&#31687;&#35770;&#25991;&#23558;Myerson&#30340;&#22996;&#25176;&#20195;&#29702;&#38382;&#39064;&#25512;&#24191;&#21040;&#19968;&#20010;&#26356;&#19968;&#33324;&#30340;&#24773;&#26223;&#65292;&#32473;&#20986;&#20102;&#19968;&#31181;&#22810;&#39033;&#24335;&#26102;&#38388;&#31639;&#27861;&#26469;&#35745;&#31639;&#22996;&#25176;&#20154;&#30340;&#26368;&#20248;&#26426;&#21046;&#65292;&#20174;&#32780;&#21516;&#26102;&#35299;&#20915;&#20102;&#21512;&#21516;&#35774;&#35745;&#12289;&#20449;&#24687;&#35774;&#35745;&#21644;&#36125;&#21494;&#26031;Stackelberg&#21338;&#24328;&#31561;&#22810;&#20010;&#35774;&#35745;&#38382;&#39064;&#12290;</title><link>https://arxiv.org/abs/2209.01146</link><description>&lt;p&gt;
&#24191;&#20041;&#22996;&#25176;&#20195;&#29702;&#65306;&#21512;&#21516;&#12289;&#20449;&#24687;&#12289;&#21338;&#24328;&#21450;&#26356;&#22810;&#20869;&#23481;
&lt;/p&gt;
&lt;p&gt;
Generalized Principal-Agency: Contracts, Information, Games and Beyond
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2209.01146
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#23558;Myerson&#30340;&#22996;&#25176;&#20195;&#29702;&#38382;&#39064;&#25512;&#24191;&#21040;&#19968;&#20010;&#26356;&#19968;&#33324;&#30340;&#24773;&#26223;&#65292;&#32473;&#20986;&#20102;&#19968;&#31181;&#22810;&#39033;&#24335;&#26102;&#38388;&#31639;&#27861;&#26469;&#35745;&#31639;&#22996;&#25176;&#20154;&#30340;&#26368;&#20248;&#26426;&#21046;&#65292;&#20174;&#32780;&#21516;&#26102;&#35299;&#20915;&#20102;&#21512;&#21516;&#35774;&#35745;&#12289;&#20449;&#24687;&#35774;&#35745;&#21644;&#36125;&#21494;&#26031;Stackelberg&#21338;&#24328;&#31561;&#22810;&#20010;&#35774;&#35745;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;Myerson'82&#25552;&#20986;&#30340;&#22996;&#25176;&#20195;&#29702;&#38382;&#39064;&#20013;&#65292;&#20195;&#29702;&#20154;&#25317;&#26377;&#31169;&#20154;&#20449;&#24687;&#65288;&#31867;&#22411;&#65289;&#24182;&#20570;&#20986;&#31169;&#20154;&#20915;&#31574;&#65288;&#34892;&#21160;&#65289;&#65292;&#36825;&#20004;&#32773;&#23545;&#20110;&#22996;&#25176;&#20154;&#26469;&#35828;&#37117;&#26159;&#19981;&#21487;&#35266;&#23519;&#30340;&#12290;Myerson&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#21551;&#31034;&#21407;&#21017;&#30340;&#20248;&#38597;&#32447;&#24615;&#35268;&#21010;&#35299;&#20915;&#26041;&#26696;&#12290;&#26412;&#25991;&#23558;Myerson&#30340;&#32467;&#26524;&#25512;&#24191;&#21040;&#19968;&#20010;&#26356;&#19968;&#33324;&#30340;&#24773;&#26223;&#65292;&#20854;&#20013;&#22996;&#25176;&#20154;&#30340;&#34892;&#21160;&#31354;&#38388;&#21487;&#20197;&#26159;&#26080;&#38480;&#30340;&#65292;&#24182;&#21463;&#21040;&#39069;&#22806;&#30340;&#35774;&#35745;&#38480;&#21046;&#12290;&#25105;&#20204;&#30340;&#24191;&#20041;&#22996;&#25176;&#20195;&#29702;&#27169;&#22411;&#23558;&#21512;&#21516;&#35774;&#35745;&#12289;&#20449;&#24687;&#35774;&#35745;&#21644;&#36125;&#21494;&#26031;Stackelberg&#21338;&#24328;&#31561;&#20960;&#20010;&#37325;&#35201;&#35774;&#35745;&#38382;&#39064;&#32479;&#19968;&#36215;&#26469;&#65292;&#24182;&#23558;&#23427;&#20204;&#20316;&#20026;&#29305;&#27530;&#24773;&#20917;&#12290;&#25105;&#20204;&#39318;&#20808;&#23558;&#21551;&#31034;&#21407;&#21017;&#25193;&#23637;&#21040;&#36825;&#20010;&#24191;&#20041;&#27169;&#22411;&#19978;&#65292;&#28982;&#21518;&#22522;&#20110;&#27492;&#23548;&#20986;&#20102;&#29992;&#20110;&#35745;&#31639;&#22996;&#25176;&#20154;&#30340;&#26368;&#20248;&#26426;&#21046;&#30340;&#22810;&#39033;&#24335;&#26102;&#38388;&#31639;&#27861;&#12290;&#35813;&#31639;&#27861;&#19981;&#20165;&#21516;&#26102;&#20026;&#25152;&#26377;&#19978;&#36848;&#29305;&#27530;&#24773;&#20917;&#25552;&#20379;&#20102;&#26032;&#30340;&#39640;&#25928;&#35299;&#20915;&#26041;&#26696;&#65292;&#32780;&#19988;&#36824;...
&lt;/p&gt;
&lt;p&gt;
arXiv:2209.01146v2 Announce Type: replace-cross Abstract: In the principal-agent problem formulated by Myerson'82, agents have private information (type) and make private decisions (action), both of which are unobservable to the principal. Myerson pointed out an elegant linear programming solution that relies on the revelation principle. This paper extends Myerson's results to a more general setting where the principal's action space can be infinite and subject to additional design constraints.   Our generalized principal-agent model unifies several important design problems including contract design, information design, and Bayesian Stackelberg games, and encompasses them as special cases. We first extend the revelation principle to this general model, based on which a polynomial-time algorithm is then derived for computing the optimal mechanism for the principal. This algorithm not only implies new efficient solutions simultaneously for all the aforementioned special cases but also s
&lt;/p&gt;</description></item><item><title>&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#27604;&#36739;&#20915;&#31574;&#38382;&#39064;&#20013;&#34892;&#21160;&#30340;&#26041;&#27861;&#65292;&#21363;&#36890;&#36807;&#20915;&#31574;&#32773;&#30340;&#39118;&#38505;&#21388;&#24694;&#31243;&#24230;&#26469;&#30830;&#23450;&#21738;&#20010;&#34892;&#21160;&#26356;&#23433;&#20840;&#12290;&#25105;&#20204;&#23545;&#36825;&#31181;&#20851;&#31995;&#36827;&#34892;&#20102;&#23436;&#25972;&#30340;&#21051;&#30011;&#65292;&#24182;&#35752;&#35770;&#20102;&#20854;&#22312;&#40065;&#26834;&#20449;&#24565;&#24341;&#20986;&#12289;&#21512;&#32422;&#12289;&#36125;&#21494;&#26031;&#21338;&#24328;&#21644;&#25237;&#36164;&#23545;&#20914;&#31561;&#39046;&#22495;&#30340;&#24212;&#29992;&#12290;</title><link>http://arxiv.org/abs/2310.17517</link><description>&lt;p&gt;
&#25968;&#37327;&#20013;&#30340;&#23433;&#20840;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Safety, in Numbers. (arXiv:2310.17517v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.17517
&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#27604;&#36739;&#20915;&#31574;&#38382;&#39064;&#20013;&#34892;&#21160;&#30340;&#26041;&#27861;&#65292;&#21363;&#36890;&#36807;&#20915;&#31574;&#32773;&#30340;&#39118;&#38505;&#21388;&#24694;&#31243;&#24230;&#26469;&#30830;&#23450;&#21738;&#20010;&#34892;&#21160;&#26356;&#23433;&#20840;&#12290;&#25105;&#20204;&#23545;&#36825;&#31181;&#20851;&#31995;&#36827;&#34892;&#20102;&#23436;&#25972;&#30340;&#21051;&#30011;&#65292;&#24182;&#35752;&#35770;&#20102;&#20854;&#22312;&#40065;&#26834;&#20449;&#24565;&#24341;&#20986;&#12289;&#21512;&#32422;&#12289;&#36125;&#21494;&#26031;&#21338;&#24328;&#21644;&#25237;&#36164;&#23545;&#20914;&#31561;&#39046;&#22495;&#30340;&#24212;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#31181;&#27604;&#36739;&#20915;&#31574;&#38382;&#39064;&#20013;&#34892;&#21160;&#30340;&#26041;&#27861;&#12290;&#22914;&#26524;&#22312;&#20915;&#31574;&#32773;&#21464;&#24471;&#26356;&#21152;&#39118;&#38505;&#21388;&#24694;&#30340;&#24773;&#20917;&#19979;&#65292;&#20915;&#31574;&#32773;&#26356;&#21916;&#27426;&#26356;&#23433;&#20840;&#30340;&#34892;&#21160;&#30340;&#20449;&#24565;&#38598;&#22686;&#22823;&#65288;&#20197;&#38598;&#21512;&#21253;&#21547;&#20851;&#31995;&#20026;&#23450;&#20041;&#65289;&#65292;&#37027;&#20040;&#36825;&#20010;&#34892;&#21160;&#23601;&#27604;&#21478;&#19968;&#20010;&#34892;&#21160;&#26356;&#23433;&#20840;&#12290;&#25105;&#20204;&#23545;&#36825;&#31181;&#20851;&#31995;&#36827;&#34892;&#20102;&#23436;&#25972;&#30340;&#21051;&#30011;&#65292;&#24182;&#35752;&#35770;&#20102;&#22312;&#40065;&#26834;&#20449;&#24565;&#24341;&#20986;&#12289;&#21512;&#32422;&#12289;&#36125;&#21494;&#26031;&#21338;&#24328;&#12289;&#25237;&#36164;&#23545;&#20914;&#31561;&#26041;&#38754;&#30340;&#24212;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;
We introduce a way to compare actions in decision problems. An action is safer than another if the set of beliefs at which the decision-maker prefers the safer action increases in size (in the set inclusion sense) as the decision-maker becomes more risk averse. We provide a full characterization of this relation and discuss applications to robust belief elicitation, contracting, Bayesian persuasion, game theory, and investment hedging.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#21457;&#23637;&#20102;&#19968;&#20010;&#23478;&#24237;&#29983;&#21629;&#21608;&#26399;&#38598;&#20307;&#27169;&#22411;&#65292;&#30740;&#31350;&#20102;&#19977;&#31181;&#25215;&#35834;&#31867;&#22411;&#30340;&#23478;&#24237;&#34892;&#20026;&#65292;&#24182;&#36890;&#36807;&#27979;&#35797;&#26041;&#27861;&#30830;&#23450;&#20102;&#23478;&#24237;&#25215;&#35834;&#31243;&#24230;&#30340;&#24322;&#36136;&#24615;&#12290;&#20351;&#29992;&#26368;&#26032;&#25968;&#25454;&#65292;&#30740;&#31350;&#21457;&#29616;&#26377;&#38480;&#25215;&#35834;&#26159;&#26368;&#26222;&#36941;&#30340;&#31867;&#22411;&#12290;</title><link>http://arxiv.org/abs/2307.10983</link><description>&lt;p&gt;
&#25215;&#35834;&#19982;&#23478;&#24237;&#21171;&#21160;&#21147;&#20379;&#32473;&#30340;&#21160;&#24577;&#12290; (arXiv:2307.10983v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
Commitment and the Dynamics of Household Labor Supply. (arXiv:2307.10983v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.10983
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#21457;&#23637;&#20102;&#19968;&#20010;&#23478;&#24237;&#29983;&#21629;&#21608;&#26399;&#38598;&#20307;&#27169;&#22411;&#65292;&#30740;&#31350;&#20102;&#19977;&#31181;&#25215;&#35834;&#31867;&#22411;&#30340;&#23478;&#24237;&#34892;&#20026;&#65292;&#24182;&#36890;&#36807;&#27979;&#35797;&#26041;&#27861;&#30830;&#23450;&#20102;&#23478;&#24237;&#25215;&#35834;&#31243;&#24230;&#30340;&#24322;&#36136;&#24615;&#12290;&#20351;&#29992;&#26368;&#26032;&#25968;&#25454;&#65292;&#30740;&#31350;&#21457;&#29616;&#26377;&#38480;&#25215;&#35834;&#26159;&#26368;&#26222;&#36941;&#30340;&#31867;&#22411;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20010;&#20307;&#23545;&#20276;&#20387;&#30340;&#25215;&#35834;&#31243;&#24230;&#23545;&#31038;&#20250;&#26377;&#37325;&#35201;&#24433;&#21709;&#12290;&#26412;&#25991;&#36890;&#36807;&#21457;&#23637;&#19968;&#20010;&#23478;&#24237;&#30340;&#29983;&#21629;&#21608;&#26399;&#38598;&#20307;&#27169;&#22411;&#65292;&#25551;&#36848;&#20102;&#19977;&#31181;&#19981;&#21516;&#31867;&#22411;&#30340;&#25215;&#35834;&#65306;&#20840;&#38754;&#25215;&#35834;&#12289;&#26377;&#38480;&#25215;&#35834;&#21644;&#26080;&#25215;&#35834;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#27979;&#35797;&#26041;&#27861;&#65292;&#36890;&#36807;&#35266;&#23519;&#24403;&#19979;&#21644;&#21382;&#21490;&#28040;&#24687;&#23545;&#23478;&#24237;&#34892;&#20026;&#30340;&#24433;&#21709;&#26469;&#21306;&#20998;&#36825;&#19977;&#31181;&#31867;&#22411;&#12290;&#25105;&#20204;&#30340;&#27979;&#35797;&#20801;&#35768;&#23478;&#24237;&#20043;&#38388;&#25215;&#35834;&#31243;&#24230;&#30340;&#24322;&#36136;&#24615;&#12290;&#20351;&#29992;&#26368;&#36817;&#30340;&#8220;&#25910;&#20837;&#21160;&#24577;&#38754;&#26495;&#30740;&#31350;&#8221;&#25968;&#25454;&#65292;&#25105;&#20204;&#25298;&#32477;&#20102;&#20840;&#38754;&#25215;&#35834;&#21644;&#26080;&#25215;&#35834;&#65292;&#21516;&#26102;&#25214;&#21040;&#20102;&#26377;&#38480;&#25215;&#35834;&#30340;&#24378;&#26377;&#21147;&#35777;&#25454;&#12290;
&lt;/p&gt;
&lt;p&gt;
The extent to which individuals commit to their partner for life has important implications. This paper develops a lifecycle collective model of the household, through which it characterizes behavior in three prominent alternative types of commitment: full, limited, and no commitment. We propose a test that distinguishes between all three types based on how contemporaneous and historical news affect household behavior. Our test permits heterogeneity in the degree of commitment across households. Using recent data from the Panel Study of Income Dynamics, we reject full and no commitment, while we find strong evidence for limited commitment.
&lt;/p&gt;</description></item><item><title>&#25552;&#20986;&#20102;&#26377;&#38480;&#30693;&#35782;&#19979;n&#20154;&#21338;&#24328;&#30340;&#26694;&#26550;&#65292;&#24341;&#20837;&#20102;&#8220;&#28216;&#25103;&#26234;&#33021;&#8221;&#26426;&#21046;&#21644;&#8220;&#38450;&#20316;&#24330;&#24615;&#8221;&#27010;&#24565;&#65292;GI&#26426;&#21046;&#21487;&#20197;&#23454;&#38469;&#35780;&#20272;&#29609;&#23478;&#30340;&#26234;&#33021;&#65292;&#24212;&#29992;&#24191;&#27867;&#12290;</title><link>http://arxiv.org/abs/2302.13937</link><description>&lt;p&gt;
&#26377;&#38480;&#30693;&#35782;&#19979;n&#20154;&#21338;&#24328;&#30340;&#20154;&#31867;&#19982;&#26426;&#22120;&#26234;&#33021;
&lt;/p&gt;
&lt;p&gt;
Human and Machine Intelligence in n-Person Games with Partial Knowledge. (arXiv:2302.13937v2 [econ.TH] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2302.13937
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#26377;&#38480;&#30693;&#35782;&#19979;n&#20154;&#21338;&#24328;&#30340;&#26694;&#26550;&#65292;&#24341;&#20837;&#20102;&#8220;&#28216;&#25103;&#26234;&#33021;&#8221;&#26426;&#21046;&#21644;&#8220;&#38450;&#20316;&#24330;&#24615;&#8221;&#27010;&#24565;&#65292;GI&#26426;&#21046;&#21487;&#20197;&#23454;&#38469;&#35780;&#20272;&#29609;&#23478;&#30340;&#26234;&#33021;&#65292;&#24212;&#29992;&#24191;&#27867;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#26032;&#30340;&#26694;&#26550;&#8212;&#8212;&#26377;&#38480;&#30693;&#35782;&#19979;&#30340;n&#20154;&#21338;&#24328;&#65292;&#20854;&#20013;&#29609;&#23478;&#21482;&#23545;&#28216;&#25103;&#30340;&#26576;&#20123;&#26041;&#38754;&#65288;&#21253;&#25324;&#34892;&#21160;&#12289;&#32467;&#26524;&#21644;&#20854;&#20182;&#29609;&#23478;&#65289;&#26377;&#38480;&#30340;&#20102;&#35299;&#12290;&#20026;&#20102;&#20998;&#26512;&#36825;&#20123;&#28216;&#25103;&#65292;&#25105;&#20171;&#32461;&#20102;&#19968;&#32452;&#26032;&#30340;&#27010;&#24565;&#21644;&#26426;&#21046;&#65292;&#37325;&#28857;&#20851;&#27880;&#20154;&#31867;&#21644;&#26426;&#22120;&#20915;&#31574;&#20043;&#38388;&#30340;&#30456;&#20114;&#20316;&#29992;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#25105;&#24341;&#20837;&#20102;&#20004;&#20010;&#20027;&#35201;&#27010;&#24565;&#65306;&#31532;&#19968;&#20010;&#26159;&#8220;&#28216;&#25103;&#26234;&#33021;&#8221;&#65288;GI&#65289;&#26426;&#21046;&#65292;&#23427;&#36890;&#36807;&#32771;&#34385;&#21442;&#32771;&#26426;&#22120;&#26234;&#33021;&#19979;&#30340;&#8220;&#38169;&#35823;&#8221;&#65292;&#19981;&#20165;&#20165;&#26159;&#28216;&#25103;&#30340;&#32467;&#26524;&#65292;&#37327;&#21270;&#20102;&#29609;&#23478;&#22312;&#28216;&#25103;&#20013;&#23637;&#31034;&#20986;&#30340;&#26234;&#33021;&#12290;&#31532;&#20108;&#20010;&#26159;&#8220;&#38450;&#20316;&#24330;&#24615;&#8221;&#65292;&#36825;&#26159;&#19968;&#31181;&#23454;&#29992;&#30340;&#12289;&#21487;&#35745;&#31639;&#30340;&#31574;&#30053;&#26080;&#20851;&#24615;&#30340;&#27010;&#24565;&#12290;GI&#26426;&#21046;&#25552;&#20379;&#20102;&#19968;&#31181;&#23454;&#29992;&#30340;&#26041;&#27861;&#26469;&#35780;&#20272;&#29609;&#23478;&#65292;&#21487;&#20197;&#28508;&#22312;&#22320;&#24212;&#29992;&#20110;&#20174;&#22312;&#32447;&#28216;&#25103;&#21040;&#29616;&#23454;&#29983;&#27963;&#20915;&#31574;&#30340;&#21508;&#31181;&#28216;&#25103;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this note, I introduce a new framework called n-person games with partial knowledge, in which players have only limited knowledge about the aspects of the game -- including actions, outcomes, and other players. For example, playing an actual game of chess is a game of partial knowledge. To analyze these games, I introduce a set of new concepts and mechanisms for measuring the intelligence of players, with a focus on the interplay between human- and machine-based decision-making. Specifically, I introduce two main concepts: firstly, the Game Intelligence (GI) mechanism, which quantifies a player's demonstrated intelligence in a game by considering not only the game's outcome but also the "mistakes" made during the game according to the reference machine's intelligence. Secondly, I define gaming-proofness, a practical and computational concept of strategy-proofness. The GI mechanism provides a practicable way to assess players and can potentially be applied to a wide range of games, f
&lt;/p&gt;</description></item></channel></rss>