<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;Q&#38598;&#25104;&#30340;CATE&#27169;&#22411;&#36873;&#25321;&#26041;&#27861;&#65292;&#20854;&#36890;&#36807;&#20351;&#29992;&#21452;&#37325;&#40065;&#26834;&#25439;&#22833;&#23454;&#29616;&#20102;&#32479;&#35745;&#19978;&#30340;&#26368;&#20339;&#39044;&#27979;&#27169;&#22411;&#36873;&#25321;&#36951;&#25022;&#29575;</title><link>http://arxiv.org/abs/2310.16945</link><description>&lt;p&gt;
Causal Q-Aggregation for CATE Model Selection&#65288;CATE&#27169;&#22411;&#36873;&#25321;&#20013;&#30340;&#22240;&#26524;Q&#38598;&#25104;&#65289;
&lt;/p&gt;
&lt;p&gt;
Causal Q-Aggregation for CATE Model Selection. (arXiv:2310.16945v1 [stat.ML])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.16945
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;Q&#38598;&#25104;&#30340;CATE&#27169;&#22411;&#36873;&#25321;&#26041;&#27861;&#65292;&#20854;&#36890;&#36807;&#20351;&#29992;&#21452;&#37325;&#40065;&#26834;&#25439;&#22833;&#23454;&#29616;&#20102;&#32479;&#35745;&#19978;&#30340;&#26368;&#20339;&#39044;&#27979;&#27169;&#22411;&#36873;&#25321;&#36951;&#25022;&#29575;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20934;&#30830;&#20272;&#35745;&#26465;&#20214;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#65288;CATE&#65289;&#26159;&#20010;&#24615;&#21270;&#20915;&#31574;&#30340;&#26680;&#24515;&#12290;&#23613;&#31649;&#26377;&#22823;&#37327;&#29992;&#20110;CATE&#20272;&#35745;&#30340;&#27169;&#22411;&#65292;&#20294;&#30001;&#20110;&#22240;&#26524;&#25512;&#26029;&#30340;&#22522;&#26412;&#38382;&#39064;&#65292;&#27169;&#22411;&#36873;&#25321;&#26159;&#19968;&#39033;&#38750;&#24120;&#26840;&#25163;&#30340;&#20219;&#21153;&#12290;&#26368;&#36817;&#30340;&#23454;&#35777;&#24037;&#20316;&#25552;&#20379;&#20102;&#26377;&#21033;&#20110;&#20855;&#26377;&#21452;&#37325;&#40065;&#26834;&#24615;&#36136;&#30340;&#20195;&#29702;&#25439;&#22833;&#24230;&#37327;&#21644;&#27169;&#22411;&#38598;&#25104;&#30340;&#35777;&#25454;&#12290;&#28982;&#32780;&#65292;&#23545;&#20110;&#36825;&#20123;&#27169;&#22411;&#30340;&#29702;&#35770;&#29702;&#35299;&#36824;&#19981;&#22815;&#12290;&#30452;&#25509;&#24212;&#29992;&#20808;&#21069;&#30340;&#29702;&#35770;&#24037;&#20316;&#20250;&#30001;&#20110;&#27169;&#22411;&#36873;&#25321;&#38382;&#39064;&#30340;&#38750;&#20984;&#24615;&#32780;&#23548;&#33268;&#27425;&#20248;&#30340;&#39044;&#27979;&#27169;&#22411;&#36873;&#25321;&#29575;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#29616;&#26377;&#20027;&#35201;CATE&#38598;&#25104;&#26041;&#27861;&#30340;&#36951;&#25022;&#29575;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#21452;&#37325;&#40065;&#26834;&#25439;&#22833;&#30340;Q&#38598;&#25104;&#30340;&#26032;&#30340;CATE&#27169;&#22411;&#38598;&#25104;&#26041;&#27861;&#12290;&#25105;&#20204;&#30340;&#20027;&#35201;&#32467;&#26524;&#34920;&#26126;&#65292;&#22240;&#26524;Q&#38598;&#25104;&#22312;&#39044;&#27979;&#27169;&#22411;&#36873;&#25321;&#30340;&#36951;&#25022;&#29575;&#19978;&#36798;&#21040;&#20102;&#32479;&#35745;&#19978;&#30340;&#26368;&#20248;&#20540;&#20026;$\frac{\log(M)}{n}$&#65288;&#20854;&#20013;$M$&#20026;&#27169;&#22411;&#25968;&#65292;$n$&#20026;&#26679;&#26412;&#25968;&#65289;&#65292;&#21152;&#19978;&#39640;&#38454;&#20272;&#35745;&#35823;&#24046;&#39033;
&lt;/p&gt;
&lt;p&gt;
Accurate estimation of conditional average treatment effects (CATE) is at the core of personalized decision making. While there is a plethora of models for CATE estimation, model selection is a nontrivial task, due to the fundamental problem of causal inference. Recent empirical work provides evidence in favor of proxy loss metrics with double robust properties and in favor of model ensembling. However, theoretical understanding is lacking. Direct application of prior theoretical work leads to suboptimal oracle model selection rates due to the non-convexity of the model selection problem. We provide regret rates for the major existing CATE ensembling approaches and propose a new CATE model ensembling approach based on Q-aggregation using the doubly robust loss. Our main result shows that causal Q-aggregation achieves statistically optimal oracle model selection regret rates of $\frac{\log(M)}{n}$ (with $M$ models and $n$ samples), with the addition of higher-order estimation error term
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#26500;&#24314;&#20102;&#38598;&#35013;&#31665;&#33322;&#36816;&#34892;&#19994;1966&#24180;&#33267;2022&#24180;&#30340;&#32479;&#19968;&#21512;&#24182;&#28165;&#21333;&#65292;&#24182;&#36890;&#36807;&#32467;&#26500;&#21305;&#37197;&#27169;&#22411;&#30740;&#31350;&#20102;&#20844;&#21496;&#30340;&#24180;&#40836;&#12289;&#35268;&#27169;&#21644;&#22320;&#29702;&#37051;&#36817;&#24615;&#23545;&#21512;&#24182;&#20915;&#31574;&#30340;&#37325;&#35201;&#24615;&#30340;&#36716;&#21464;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#20844;&#21496;&#35268;&#27169;&#22312;1991&#24180;&#33267;2005&#24180;&#26399;&#38388;&#20316;&#20026;&#27491;&#21521;&#22240;&#32032;&#23545;&#21512;&#24182;&#28608;&#21169;&#26356;&#21152;&#37325;&#35201;&#65292;&#20294;&#22312;2006&#24180;&#33267;2022&#24180;&#26399;&#38388;&#20316;&#20026;&#36127;&#21521;&#22240;&#32032;&#36215;&#21040;&#25233;&#21046;&#20316;&#29992;&#12290;&#21516;&#26102;&#65292;&#20844;&#21496;&#20043;&#38388;&#30340;&#22320;&#29702;&#36317;&#31163;&#23545;&#21512;&#24182;&#20915;&#31574;&#20063;&#20135;&#29983;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2310.09938</link><description>&lt;p&gt;
&#12298;1966&#24180;&#20197;&#26469;&#38598;&#35013;&#31665;&#33322;&#36816;&#34892;&#19994;&#30340;&#32479;&#19968;&#21512;&#24182;&#28165;&#21333;&#65306;&#19968;&#23478;&#20844;&#21496;&#30340;&#24180;&#40836;&#12289;&#21544;&#20301;&#23481;&#37327;&#21644;&#22320;&#29702;&#37051;&#36817;&#24615;&#23545;&#21512;&#24182;&#20915;&#31574;&#30340;&#37325;&#35201;&#24615;&#30340;&#32467;&#26500;&#20272;&#35745;&#12299;&#30340;&#32763;&#35793;&#39064;&#30446;
&lt;/p&gt;
&lt;p&gt;
Unified Merger List in the Container Shipping Industry from 1966: A Structural Estimation of the Transition of Importance of a Firm's Age, Tonnage Capacity, and Geographical Proximity on Merger Decision. (arXiv:2310.09938v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.09938
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#26500;&#24314;&#20102;&#38598;&#35013;&#31665;&#33322;&#36816;&#34892;&#19994;1966&#24180;&#33267;2022&#24180;&#30340;&#32479;&#19968;&#21512;&#24182;&#28165;&#21333;&#65292;&#24182;&#36890;&#36807;&#32467;&#26500;&#21305;&#37197;&#27169;&#22411;&#30740;&#31350;&#20102;&#20844;&#21496;&#30340;&#24180;&#40836;&#12289;&#35268;&#27169;&#21644;&#22320;&#29702;&#37051;&#36817;&#24615;&#23545;&#21512;&#24182;&#20915;&#31574;&#30340;&#37325;&#35201;&#24615;&#30340;&#36716;&#21464;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#20844;&#21496;&#35268;&#27169;&#22312;1991&#24180;&#33267;2005&#24180;&#26399;&#38388;&#20316;&#20026;&#27491;&#21521;&#22240;&#32032;&#23545;&#21512;&#24182;&#28608;&#21169;&#26356;&#21152;&#37325;&#35201;&#65292;&#20294;&#22312;2006&#24180;&#33267;2022&#24180;&#26399;&#38388;&#20316;&#20026;&#36127;&#21521;&#22240;&#32032;&#36215;&#21040;&#25233;&#21046;&#20316;&#29992;&#12290;&#21516;&#26102;&#65292;&#20844;&#21496;&#20043;&#38388;&#30340;&#22320;&#29702;&#36317;&#31163;&#23545;&#21512;&#24182;&#20915;&#31574;&#20063;&#20135;&#29983;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#26500;&#24314;&#20102;&#19968;&#20010;&#26032;&#39062;&#30340;&#20840;&#29699;&#38598;&#35013;&#31665;&#33322;&#36816;&#34892;&#19994;1966&#24180;&#33267;2022&#24180;&#20043;&#38388;&#30340;&#32479;&#19968;&#21512;&#24182;&#28165;&#21333;&#12290;&#23558;&#35813;&#28165;&#21333;&#19982;&#19987;&#26377;&#25968;&#25454;&#32467;&#21512;&#65292;&#25105;&#20204;&#26500;&#24314;&#20102;&#19968;&#20010;&#32467;&#26500;&#21305;&#37197;&#27169;&#22411;&#65292;&#25551;&#36848;&#20102;&#20844;&#21496;&#30340;&#24180;&#40836;&#12289;&#35268;&#27169;&#21644;&#22320;&#29702;&#37051;&#36817;&#24615;&#22312;&#21512;&#24182;&#20915;&#31574;&#20013;&#30340;&#21382;&#21490;&#24615;&#36716;&#21464;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#22312;1991&#24180;&#33267;2005&#24180;&#26399;&#38388;&#65292;&#20316;&#20026;&#27491;&#38754;&#22240;&#32032;&#65292;&#19968;&#23478;&#20844;&#21496;&#30340;&#35268;&#27169;&#22312;&#21512;&#24182;&#28608;&#21169;&#20013;&#27604;&#20844;&#21496;&#30340;&#24180;&#40836;&#37325;&#35201;9.974&#20493;&#12290;&#28982;&#32780;&#65292;&#22312;2006&#24180;&#33267;2022&#24180;&#26399;&#38388;&#65292;&#20316;&#20026;&#36127;&#38754;&#22240;&#32032;&#65292;&#19968;&#23478;&#20844;&#21496;&#30340;&#35268;&#27169;&#22312;&#21512;&#24182;&#28608;&#21169;&#20013;&#27604;&#20844;&#21496;&#30340;&#24180;&#40836;&#37325;&#35201;0.026-0.630&#20493;&#65292;&#21363;&#20844;&#21496;&#30340;&#35268;&#27169;&#36215;&#21040;&#20102;&#25233;&#21046;&#20316;&#29992;&#12290;&#25105;&#20204;&#36824;&#21457;&#29616;&#65292;&#20080;&#26041;&#20844;&#21496;&#21644;&#21334;&#26041;&#20844;&#21496;&#20043;&#38388;&#30340;&#36317;&#31163;&#22312;&#25972;&#20010;&#26399;&#38388;&#37117;&#36215;&#21040;&#20102;&#25233;&#21046;&#20316;&#29992;&#65292;&#20294;&#22312;&#36817;&#24180;&#26469;&#30340;&#32463;&#27982;&#37325;&#35201;&#24615;&#24050;&#20943;&#24369;&#21040;&#24494;&#19981;&#36275;&#36947;&#30340;&#31243;&#24230;&#12290;&#22312;&#21453;&#20107;&#23454;&#27169;&#25311;&#20013;&#65292;&#25105;&#20204;&#35266;&#23519;&#21040;&#21516;&#19968;&#22269;&#23478;&#30340;&#20844;&#21496;&#20043;&#38388;&#21512;&#24182;&#30340;&#31105;&#27490;&#20250;&#24433;&#21709;&#21512;&#24182;&#37197;&#32622;&#12290;
&lt;/p&gt;
&lt;p&gt;
We construct a novel unified merger list in the global container shipping industry between 1966 (the beginning of the industry) and 2022. Combining the list with proprietary data, we construct a structural matching model to describe the historical transition of the importance of a firm's age, size, and geographical proximity on merger decisions. We find that, as a positive factor, a firm's size is more important than a firm's age by 9.974 times as a merger incentive between 1991 and 2005. However, between 2006 and 2022, as a negative factor, a firm's size is more important than a firm's age by 0.026-0.630 times, that is, a firm's size works as a disincentive. We also find that the distance between buyer and seller firms works as a disincentive for the whole period, but the importance has dwindled to economic insignificance in recent years. In counterfactual simulations, we observe that the prohibition of mergers between firms in the same country would affect the merger configuration of
&lt;/p&gt;</description></item><item><title>&#35813;&#30740;&#31350;&#35780;&#20272;&#20102;&#22343;&#36136;&#21830;&#21697;&#24066;&#22330;&#20013;&#34892;&#20026;&#21442;&#25968;&#26816;&#39564;&#30340;&#26377;&#38480;&#26679;&#26412;&#24615;&#33021;&#65292;&#21457;&#29616;&#21363;&#20351;&#22312;&#20013;&#31561;&#25968;&#37327;&#30340;&#24066;&#22330;&#21644;&#20116;&#23478;&#20844;&#21496;&#30340;&#24773;&#20917;&#19979;&#65292;&#25298;&#32477;&#23436;&#20840;&#31454;&#20105;&#30340;&#38646;&#20551;&#35774;&#20173;&#28982;&#20855;&#26377;&#25361;&#25112;&#24615;&#12290;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;&#26410;&#33021;&#25298;&#32477;&#23436;&#20840;&#31454;&#20105;&#30340;&#32463;&#39564;&#32467;&#26524;&#26159;&#24066;&#22330;&#25968;&#37327;&#26377;&#38480;&#36896;&#25104;&#30340;&#65292;&#32780;&#19981;&#26159;&#26041;&#27861;&#19978;&#30340;&#32570;&#38519;&#12290;</title><link>http://arxiv.org/abs/2310.04576</link><description>&lt;p&gt;
&#22343;&#36136;&#21830;&#21697;&#24066;&#22330;&#20013;&#34892;&#20026;&#21442;&#25968;&#26816;&#39564;&#30340;&#26377;&#38480;&#26679;&#26412;&#24615;&#33021;
&lt;/p&gt;
&lt;p&gt;
Finite Sample Performance of a Conduct Parameter Test in Homogenous Goods Markets. (arXiv:2310.04576v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.04576
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#35780;&#20272;&#20102;&#22343;&#36136;&#21830;&#21697;&#24066;&#22330;&#20013;&#34892;&#20026;&#21442;&#25968;&#26816;&#39564;&#30340;&#26377;&#38480;&#26679;&#26412;&#24615;&#33021;&#65292;&#21457;&#29616;&#21363;&#20351;&#22312;&#20013;&#31561;&#25968;&#37327;&#30340;&#24066;&#22330;&#21644;&#20116;&#23478;&#20844;&#21496;&#30340;&#24773;&#20917;&#19979;&#65292;&#25298;&#32477;&#23436;&#20840;&#31454;&#20105;&#30340;&#38646;&#20551;&#35774;&#20173;&#28982;&#20855;&#26377;&#25361;&#25112;&#24615;&#12290;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;&#26410;&#33021;&#25298;&#32477;&#23436;&#20840;&#31454;&#20105;&#30340;&#32463;&#39564;&#32467;&#26524;&#26159;&#24066;&#22330;&#25968;&#37327;&#26377;&#38480;&#36896;&#25104;&#30340;&#65292;&#32780;&#19981;&#26159;&#26041;&#27861;&#19978;&#30340;&#32570;&#38519;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#35780;&#20272;&#20102;&#22312;&#22343;&#36136;&#21830;&#21697;&#24066;&#22330;&#20013;&#34892;&#20026;&#21442;&#25968;&#26816;&#39564;&#30340;&#26377;&#38480;&#26679;&#26412;&#24615;&#33021;&#12290;&#32479;&#35745;&#21151;&#25928;&#38543;&#24066;&#22330;&#25968;&#37327;&#22686;&#21152;&#12289;&#34892;&#20026;&#21442;&#25968;&#22686;&#22823;&#21644;&#38656;&#27714;&#26059;&#36716;&#24037;&#20855;&#24378;&#24230;&#22686;&#24378;&#32780;&#25552;&#39640;&#12290;&#28982;&#32780;&#65292;&#21363;&#20351;&#22312;&#20013;&#31561;&#25968;&#37327;&#30340;&#24066;&#22330;&#21644;&#20116;&#23478;&#20844;&#21496;&#30340;&#24773;&#20917;&#19979;&#65292;&#26080;&#35770;&#24037;&#20855;&#24378;&#24230;&#21644;&#20351;&#29992;&#26368;&#20339;&#24037;&#20855;&#30340;&#24773;&#20917;&#19979;&#65292;&#25298;&#32477;&#23436;&#20840;&#31454;&#20105;&#30340;&#38646;&#20551;&#35774;&#20173;&#28982;&#20855;&#26377;&#25361;&#25112;&#24615;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;&#26410;&#33021;&#25298;&#32477;&#23436;&#20840;&#31454;&#20105;&#30340;&#32463;&#39564;&#32467;&#26524;&#26159;&#24066;&#22330;&#25968;&#37327;&#26377;&#38480;&#36896;&#25104;&#30340;&#65292;&#32780;&#19981;&#26159;&#26041;&#27861;&#19978;&#30340;&#32570;&#38519;&#12290;
&lt;/p&gt;
&lt;p&gt;
We assess the finite sample performance of the conduct parameter test in homogeneous goods markets. Statistical power rises with an increase in the number of markets, a larger conduct parameter, and a stronger demand rotation instrument. However, even with a moderate number of markets and five firms, regardless of instrument strength and the utilization of optimal instruments, rejecting the null hypothesis of perfect competition remains challenging. Our findings indicate that empirical results that fail to reject perfect competition are a consequence of the limited number of markets rather than methodological deficiencies.
&lt;/p&gt;</description></item><item><title>&#36825;&#31687;&#35770;&#25991;&#30740;&#31350;&#20102;&#38750;&#32447;&#24615;&#38431;&#21015;&#38754;&#26495;&#20013;&#30340;&#26368;&#23567;&#20108;&#20056;&#20272;&#35745;&#19982;&#32463;&#39564;&#23398;&#20064;&#65292;&#25506;&#35752;&#20102;&#20272;&#35745;&#21644;&#25512;&#26029;&#30340;&#25216;&#26415;&#65292;&#24182;&#39564;&#35777;&#20102;Malmendier&#21644;Nagel&#22312;2016&#24180;&#30340;&#32463;&#20856;&#35770;&#25991;&#20013;&#20351;&#29992;&#30340;&#20272;&#35745;&#22120;&#30340;&#24615;&#36136;&#21644;&#23454;&#29992;&#24615;&#12290;</title><link>http://arxiv.org/abs/2309.08982</link><description>&lt;p&gt;
&#38750;&#32447;&#24615;&#38431;&#21015;&#38754;&#26495;&#20013;&#30340;&#26368;&#23567;&#20108;&#20056;&#20272;&#35745;&#19982;&#32463;&#39564;&#23398;&#20064;
&lt;/p&gt;
&lt;p&gt;
Least squares estimation in nonlinear cohort panels with learning from experience. (arXiv:2309.08982v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.08982
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#30740;&#31350;&#20102;&#38750;&#32447;&#24615;&#38431;&#21015;&#38754;&#26495;&#20013;&#30340;&#26368;&#23567;&#20108;&#20056;&#20272;&#35745;&#19982;&#32463;&#39564;&#23398;&#20064;&#65292;&#25506;&#35752;&#20102;&#20272;&#35745;&#21644;&#25512;&#26029;&#30340;&#25216;&#26415;&#65292;&#24182;&#39564;&#35777;&#20102;Malmendier&#21644;Nagel&#22312;2016&#24180;&#30340;&#32463;&#20856;&#35770;&#25991;&#20013;&#20351;&#29992;&#30340;&#20272;&#35745;&#22120;&#30340;&#24615;&#36136;&#21644;&#23454;&#29992;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#35752;&#35770;&#20102;&#22312;&#38750;&#32447;&#24615;&#38431;&#21015;&#38754;&#26495;&#20013;&#36827;&#34892;&#20272;&#35745;&#21644;&#25512;&#26029;&#30340;&#25216;&#26415;&#65292;&#20854;&#20013;&#28041;&#21450;&#21040;&#20102;Malmendier&#21644;Nagel&#22312;2016&#24180;&#30340;&#32463;&#20856;&#35770;&#25991;&#20013;&#20351;&#29992;&#30340;&#38750;&#32447;&#24615;&#26368;&#23567;&#20108;&#20056;&#20272;&#35745;&#22120;&#30340;&#19968;&#33268;&#24615;&#21644;&#28176;&#36817;&#27491;&#24577;&#24615;&#12290;&#25105;&#20204;&#36824;&#37492;&#23450;&#20102;&#20551;&#35774;&#26816;&#39564;&#21487;&#33021;&#23384;&#22312;&#30340;&#28508;&#22312;&#38519;&#38449;&#65292;&#24182;&#25552;&#20986;&#20102;&#35299;&#20915;&#26041;&#26696;&#12290;&#33945;&#29305;&#21345;&#32599;&#27169;&#25311;&#39564;&#35777;&#20102;&#26377;&#38480;&#26679;&#26412;&#20013;&#20272;&#35745;&#22120;&#21644;&#30456;&#24212;&#30340;&#26816;&#39564;&#32479;&#35745;&#37327;&#30340;&#29305;&#24615;&#65292;&#32780;&#23545;&#19968;&#32452;&#35843;&#26597;&#39044;&#26399;&#30340;&#24212;&#29992;&#21017;&#35777;&#26126;&#20102;&#25152;&#24320;&#21457;&#29702;&#35770;&#30340;&#23454;&#29992;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
We discuss techniques of estimation and inference for nonlinear cohort panels with learning from experience, showing, inter alia, the consistency and asymptotic normality of the nonlinear least squares estimator employed in the seminal paper by Malmendier and Nagel (2016). Potential pitfalls for hypothesis testing are identified and solutions proposed. Monte Carlo simulations verify the properties of the estimator and corresponding test statistics in finite samples, while an application to a panel of survey expectations demonstrates the usefulness of the theory developed.
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#25919;&#27835;&#21160;&#33633;&#21644;&#20027;&#26435;&#39118;&#38505;&#23545;&#20110;&#22320;&#29702;&#36797;&#38420;&#30340;&#22269;&#23478;&#30340;&#24433;&#21709;&#65292;&#24182;&#21457;&#29616;&#22312;&#24093;&#22269;&#36793;&#30086;&#22320;&#21306;&#21457;&#29983;&#30340;&#21160;&#33633;&#26356;&#23481;&#26131;&#22686;&#21152;&#39118;&#38505;&#12290;&#30740;&#31350;&#32467;&#26524;&#23545;&#20110;&#25105;&#20204;&#29702;&#35299;&#24403;&#21069;&#20107;&#20214;&#26377;&#21551;&#31034;&#65292;&#20063;&#25552;&#37266;&#30528;&#25105;&#20204;&#22312;&#32500;&#25252;&#22269;&#23478;&#31283;&#23450;&#19982;&#21560;&#24341;&#22806;&#22269;&#25237;&#36164;&#26041;&#38754;&#25152;&#38754;&#20020;&#30340;&#25361;&#25112;&#12290;</title><link>http://arxiv.org/abs/2309.06885</link><description>&lt;p&gt;
&#24093;&#22269;&#30340;&#20195;&#20215;&#65306;&#27801;&#20420;&#21160;&#33633;&#22320;&#28857;&#19982;&#20027;&#26435;&#39118;&#38505;
&lt;/p&gt;
&lt;p&gt;
The Price of Empire: Unrest Location and Sovereign Risk in Tsarist Russia. (arXiv:2309.06885v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.06885
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#25919;&#27835;&#21160;&#33633;&#21644;&#20027;&#26435;&#39118;&#38505;&#23545;&#20110;&#22320;&#29702;&#36797;&#38420;&#30340;&#22269;&#23478;&#30340;&#24433;&#21709;&#65292;&#24182;&#21457;&#29616;&#22312;&#24093;&#22269;&#36793;&#30086;&#22320;&#21306;&#21457;&#29983;&#30340;&#21160;&#33633;&#26356;&#23481;&#26131;&#22686;&#21152;&#39118;&#38505;&#12290;&#30740;&#31350;&#32467;&#26524;&#23545;&#20110;&#25105;&#20204;&#29702;&#35299;&#24403;&#21069;&#20107;&#20214;&#26377;&#21551;&#31034;&#65292;&#20063;&#25552;&#37266;&#30528;&#25105;&#20204;&#22312;&#32500;&#25252;&#22269;&#23478;&#31283;&#23450;&#19982;&#21560;&#24341;&#22806;&#22269;&#25237;&#36164;&#26041;&#38754;&#25152;&#38754;&#20020;&#30340;&#25361;&#25112;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20851;&#20110;&#25919;&#27835;&#21160;&#33633;&#21644;&#20027;&#26435;&#39118;&#38505;&#30340;&#30740;&#31350;&#24573;&#35270;&#20102;&#21160;&#33633;&#22320;&#28857;&#23545;&#20110;&#22320;&#29702;&#36797;&#38420;&#30340;&#22269;&#23478;&#20027;&#26435;&#39118;&#38505;&#30340;&#24433;&#21709;&#21450;&#20854;&#26426;&#21046;&#12290;&#22312;&#30452;&#35266;&#19978;&#65292;&#39318;&#37117;&#25110;&#38468;&#36817;&#30340;&#25919;&#27835;&#26292;&#21147;&#20284;&#20046;&#30452;&#25509;&#23041;&#32961;&#21040;&#22269;&#23478;&#20607;&#36824;&#20538;&#21153;&#30340;&#33021;&#21147;&#12290;&#28982;&#32780;&#65292;&#36828;&#31163;&#26292;&#21147;&#22320;&#28857;&#21487;&#33021;&#20250;&#26356;&#21152;&#20005;&#37325;&#22320;&#24433;&#21709;&#25919;&#24220;&#65292;&#19982;&#25233;&#21046;&#21467;&#20081;&#25152;&#24102;&#26469;&#30340;&#38271;&#26399;&#25104;&#26412;&#26377;&#20851;&#12290;&#25105;&#20204;&#21033;&#29992;&#27801;&#20420;&#30340;&#26696;&#20363;&#26469;&#35780;&#20272;&#20420;&#32599;&#26031;&#22269;&#22303;&#20869;&#21457;&#29983;&#21160;&#33633;&#19982;&#24093;&#22269;&#36793;&#30086;&#22320;&#21306;&#21457;&#29983;&#21160;&#33633;&#26102;&#39118;&#38505;&#25928;&#24212;&#30340;&#24046;&#24322;&#12290;&#25105;&#20204;&#20998;&#26512;&#20102;1820&#24180;&#33267;1914&#24180;&#38388;&#27801;&#20420;&#24093;&#22269;&#21508;&#22320;&#30340;&#21160;&#33633;&#20107;&#20214;&#65292;&#21457;&#29616;&#21160;&#33633;&#23545;&#24093;&#22269;&#36793;&#30086;&#22320;&#21306;&#30340;&#39118;&#38505;&#24433;&#21709;&#26356;&#22823;&#12290;&#19982;&#24403;&#21069;&#20107;&#20214;&#30456;&#21628;&#24212;&#65292;&#25105;&#20204;&#21457;&#29616;&#20044;&#20811;&#20848;&#30340;&#21160;&#33633;&#20351;&#39118;&#38505;&#22686;&#21152;&#26368;&#22810;&#12290;&#24093;&#22269;&#30340;&#20195;&#20215;&#21253;&#25324;&#20102;&#21521;&#38215;&#21387;&#21160;&#33633;&#21644;&#33719;&#24471;&#22806;&#22269;&#25237;&#36164;&#32773;&#20449;&#20219;&#30340;&#21516;&#26102;&#32500;&#25345;&#21147;&#37327;&#25237;&#23556;&#30340;&#39640;&#39069;&#25104;&#26412;&#12290;
&lt;/p&gt;
&lt;p&gt;
Research on politically motivated unrest and sovereign risk overlooks whether and how unrest location matters for sovereign risk in geographically extensive states. Intuitively, political violence in the capital or nearby would seem to directly threaten the state's ability to pay its debts. However, it is possible that the effect on a government could be more pronounced the farther away the violence is, connected to the longer-term costs of suppressing rebellion. We use Tsarist Russia to assess these differences in risk effects when unrest occurs in Russian homeland territories versus more remote imperial territories. Our analysis of unrest events across the Russian imperium from 1820 to 1914 suggests that unrest increases risk more in imperial territories. Echoing current events, we find that unrest in Ukraine increases risk most. The price of empire included higher costs in projecting force to repress unrest and retain the confidence of the foreign investors financing those costs.
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#19968;&#20123;&#22269;&#23478;&#27861;&#24459;&#23545;&#39640;&#21033;&#24687;&#36151;&#27454;&#30340;&#38480;&#21046;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#25193;&#23637;&#38480;&#21046;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#35777;&#26126;&#36825;&#20010;&#25193;&#23637;&#19982;&#19968;&#32452;&#33258;&#28982;&#20844;&#29702;&#30456;&#19968;&#33268;&#12290;</title><link>http://arxiv.org/abs/2307.08861</link><description>&lt;p&gt;
&#19968;&#39033;&#25918;&#36151;&#27861;&#24459;&#65306;&#19968;&#20010;&#28548;&#28165;
&lt;/p&gt;
&lt;p&gt;
A usury law: a clarification. (arXiv:2307.08861v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.08861
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#19968;&#20123;&#22269;&#23478;&#27861;&#24459;&#23545;&#39640;&#21033;&#24687;&#36151;&#27454;&#30340;&#38480;&#21046;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#25193;&#23637;&#38480;&#21046;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#35777;&#26126;&#36825;&#20010;&#25193;&#23637;&#19982;&#19968;&#32452;&#33258;&#28982;&#20844;&#29702;&#30456;&#19968;&#33268;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#19968;&#20123;&#22269;&#23478;&#30340;&#22269;&#23478;&#27861;&#24459;&#31105;&#27490;&#20197;&#39640;&#21033;&#24687;&#36151;&#27454;&#12290;&#22823;&#22810;&#25968;&#22269;&#23478;&#38480;&#21046;&#26377;&#25928;&#21033;&#29575;&#65288;&#32780;&#19981;&#20165;&#20165;&#26159;&#21517;&#20041;&#21033;&#29575;&#65289;&#65292;&#20854;&#20013;&#21253;&#25324;&#25152;&#26377;&#21487;&#33021;&#19982;&#36151;&#27454;&#30456;&#20851;&#30340;&#20323;&#37329;&#21644;&#36153;&#29992;&#12290;&#22312;&#36825;&#31181;&#24773;&#20917;&#19979;&#65292;&#23545;&#20110;&#29616;&#37329;&#27969;&#27809;&#26377;&#20869;&#37096;&#22238;&#25253;&#29575;&#30340;&#36151;&#27454;&#65292;&#38480;&#21046;&#19981;&#26126;&#30830;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#22914;&#20309;&#23558;&#27492;&#38480;&#21046;&#25193;&#23637;&#21040;&#25152;&#26377;&#36151;&#27454;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#23384;&#22312;&#19968;&#20010;&#29420;&#29305;&#30340;&#25193;&#23637;&#65292;&#19982;&#19968;&#32452;&#33258;&#28982;&#20844;&#29702;&#19968;&#33268;&#12290;
&lt;/p&gt;
&lt;p&gt;
The national legislation of some countries prohibits lending money at a usurious interest rate. Most countries restrict the effective (rather than nominal) interest rate, which includes all commissions and fees that may come with a loan. In this case, the restriction is vague for loans whose cash flow steams have no internal rate of return. In this note, we show how to extend this restriction to all loans. We prove that there is a unique such extension consistent with a set of natural axioms.
&lt;/p&gt;</description></item><item><title>&#30740;&#31350;&#20998;&#26512;&#20102;&#22823;&#23398;&#27979;&#35797;&#33258;&#36873;&#25919;&#31574;&#30340;&#24433;&#21709;&#65292;&#35748;&#20026;&#20854;&#21463;&#21040;&#31038;&#20250;&#21387;&#21147;&#30340;&#25512;&#21160;&#65292;&#21487;&#20197;&#20943;&#23569;&#22823;&#23398;&#19982;&#31038;&#20250;&#30340;&#20998;&#27495;&#25104;&#26412;&#65292;&#20174;&#32780;&#26356;&#22909;&#22320;&#23454;&#29616;&#23545;&#23398;&#29983;&#20837;&#23398;&#30340;&#31649;&#25511;&#12290;</title><link>http://arxiv.org/abs/2304.07551</link><description>&lt;p&gt;
&#28040;&#38500;&#27979;&#35797;&#35201;&#27714;&#20837;&#23398;&#25919;&#31574;
&lt;/p&gt;
&lt;p&gt;
Test-Optional Admissions. (arXiv:2304.07551v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.07551
&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#20998;&#26512;&#20102;&#22823;&#23398;&#27979;&#35797;&#33258;&#36873;&#25919;&#31574;&#30340;&#24433;&#21709;&#65292;&#35748;&#20026;&#20854;&#21463;&#21040;&#31038;&#20250;&#21387;&#21147;&#30340;&#25512;&#21160;&#65292;&#21487;&#20197;&#20943;&#23569;&#22823;&#23398;&#19982;&#31038;&#20250;&#30340;&#20998;&#27495;&#25104;&#26412;&#65292;&#20174;&#32780;&#26356;&#22909;&#22320;&#23454;&#29616;&#23545;&#23398;&#29983;&#20837;&#23398;&#30340;&#31649;&#25511;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
Covid-19&#30123;&#24773;&#21152;&#36895;&#20102;&#35768;&#22810;&#22823;&#23398;&#36716;&#21521;&#27979;&#35797;&#33258;&#36873;&#25110;&#27979;&#35797;&#30450;&#36873;&#30340;&#36235;&#21183;&#12290;&#19968;&#31181;&#32463;&#24120;&#20986;&#29616;&#30340;&#35828;&#27861;&#26159;&#65292;&#36890;&#36807;&#19981;&#32771;&#34385;&#26631;&#20934;&#21270;&#32771;&#35797;&#20998;&#25968;&#65292;&#23398;&#38498;&#21487;&#20197;&#24405;&#21462;&#23427;&#26356;&#21916;&#27426;&#30340;&#23398;&#29983;&#32676;&#20307;&#65292;&#27604;&#22914;&#26356;&#22810;&#20803;&#21270;&#30340;&#23398;&#29983;&#32676;&#20307;&#12290;&#20294;&#26159;&#65292;&#35266;&#23519;&#26356;&#23569;&#30340;&#20449;&#24687;&#22914;&#20309;&#33021;&#35753;&#22823;&#23398;&#25552;&#39640;&#20854;&#20915;&#31574;&#33021;&#21147;&#21602;&#65311;&#25105;&#20204;&#35748;&#20026;&#65292;&#27979;&#35797;&#33258;&#36873;&#25919;&#31574;&#21487;&#33021;&#21463;&#21040;&#20102;&#23545;&#22823;&#23398;&#24405;&#21462;&#20915;&#31574;&#30340;&#31038;&#20250;&#21387;&#21147;&#30340;&#25512;&#21160;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#22823;&#23398;&#20837;&#23398;&#27169;&#22411;&#65292;&#20854;&#20013;&#22823;&#23398;&#22312;&#21738;&#20123;&#23398;&#29983;&#24212;&#35813;&#34987;&#24405;&#21462;&#26041;&#38754;&#19982;&#31038;&#20250;&#23384;&#22312;&#20998;&#27495;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#22823;&#23398;&#22914;&#20309;&#20351;&#29992;&#27979;&#35797;&#33258;&#36873;&#25919;&#31574;&#26469;&#20943;&#23569;&#20854;&#19982;&#31038;&#20250;&#30340;&#8220;&#20998;&#27495;&#25104;&#26412;&#8221;&#65292;&#32780;&#19981;&#35770;&#36825;&#26159;&#21542;&#23548;&#33268;&#20102;&#19968;&#20010;&#26356;&#21463;&#27426;&#36814;&#30340;&#23398;&#29983;&#38431;&#20237;&#12290;&#25105;&#20204;&#35752;&#35770;&#20102;&#21738;&#20123;&#23398;&#29983;&#21463;&#30410;&#20110;&#27979;&#35797;&#33258;&#36873;&#25919;&#31574;&#65292;&#21738;&#20123;&#23398;&#29983;&#20250;&#21463;&#21040;&#25439;&#23475;&#12290;&#22312;&#19968;&#39033;&#24212;&#29992;&#20013;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#31105;&#27490;&#22312;&#20837;&#23398;&#20013;&#20351;&#29992;&#31181;&#26063;&#22240;&#32032;&#21487;&#33021;&#20250;&#23548;&#33268;&#26356;&#22810;&#30340;&#23398;&#26657;&#36716;&#21521;&#27979;&#35797;&#33258;&#36873;&#25110;&#27979;&#35797;&#30450;&#36873;&#12290;
&lt;/p&gt;
&lt;p&gt;
The Covid-19 pandemic has accelerated the trend of many colleges moving to test-optional, and in some cases test-blind, admissions policies. A frequent claim is that by not seeing standardized test scores, a college is able to admit a student body that it prefers, such as one with more diversity. But how can observing less information allow a college to improve its decisions? We argue that test-optional policies may be driven by social pressure on colleges' admission decisions. We propose a model of college admissions in which a college disagrees with society on which students should be admitted. We show how the college can use a test-optional policy to reduce its "disagreement cost" with society, regardless of whether this results in a preferred student pool. We discuss which students either benefit from or are harmed by a test-optional policy. In an application, we study how a ban on using race in admissions may result in more colleges going test optional or test blind.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#36879;&#26126;&#21160;&#26426;&#19979;&#30340;&#36890;&#20449;&#21327;&#35758;&#65292;&#21457;&#29616;&#24403;&#29366;&#24577;&#26159;&#20108;&#36827;&#21046;&#26102;&#65292;&#35843;&#35299;&#20005;&#26684;&#20248;&#20110;&#24265;&#20215;&#35848;&#35805;&#65292;&#22914;&#26524;&#21457;&#36865;&#32773;&#19981;&#33021;&#36890;&#36807;&#22987;&#32456;&#20302;&#20272;&#25110;&#39640;&#20272;&#29366;&#24577;&#26469;&#36798;&#21040;&#27604;&#24265;&#20215;&#35848;&#35805;&#26356;&#22909;&#30340;&#25928;&#26524;&#65292;&#37027;&#20040;&#35843;&#35299;&#20005;&#26684;&#20248;&#20110;&#24265;&#20215;&#35848;&#35805;&#12290;</title><link>http://arxiv.org/abs/2303.06244</link><description>&lt;p&gt;
&#36879;&#26126;&#21160;&#26426;&#19979;&#30340;&#36890;&#20449;&#21327;&#35758;
&lt;/p&gt;
&lt;p&gt;
Communication Protocols under Transparent Motives. (arXiv:2303.06244v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.06244
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#36879;&#26126;&#21160;&#26426;&#19979;&#30340;&#36890;&#20449;&#21327;&#35758;&#65292;&#21457;&#29616;&#24403;&#29366;&#24577;&#26159;&#20108;&#36827;&#21046;&#26102;&#65292;&#35843;&#35299;&#20005;&#26684;&#20248;&#20110;&#24265;&#20215;&#35848;&#35805;&#65292;&#22914;&#26524;&#21457;&#36865;&#32773;&#19981;&#33021;&#36890;&#36807;&#22987;&#32456;&#20302;&#20272;&#25110;&#39640;&#20272;&#29366;&#24577;&#26469;&#36798;&#21040;&#27604;&#24265;&#20215;&#35848;&#35805;&#26356;&#22909;&#30340;&#25928;&#26524;&#65292;&#37027;&#20040;&#35843;&#35299;&#20005;&#26684;&#20248;&#20110;&#24265;&#20215;&#35848;&#35805;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper studies communication protocols under transparent motives and finds that mediation strictly improves on cheap talk when the state is binary, unless the sender can do better than under cheap talk by always under or over stating the state.
&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#21457;&#36865;&#32773;-&#25509;&#25910;&#32773;&#36890;&#20449;&#21338;&#24328;&#20013;&#30340;&#26368;&#20248;&#65288;&#20449;&#24687;&#65289;&#35843;&#35299;&#65292;&#20854;&#20013;&#21457;&#36865;&#32773;&#20855;&#26377;&#36879;&#26126;&#21160;&#26426;&#65306;&#22905;&#21482;&#20851;&#24515;&#25509;&#25910;&#32773;&#30340;&#34892;&#21160;&#21644;&#20449;&#24565;&#12290;&#25105;&#20204;&#21051;&#30011;&#20102;&#22312;&#35843;&#35299;&#19979;&#25509;&#25910;&#32773;&#20449;&#24565;&#30340;&#21487;&#34892;&#20998;&#24067;&#21644;&#35843;&#35299;&#30340;&#20215;&#20540;&#12290;&#22914;&#26524;&#21457;&#36865;&#32773;&#21487;&#20197;&#36890;&#36807;&#24265;&#20215;&#35848;&#35805;&#36798;&#21040;&#22905;&#30340;&#26368;&#20248;&#36125;&#21494;&#26031;&#35828;&#26381;&#20215;&#20540;&#65292;&#37027;&#20040;&#22905;&#36890;&#36807;&#35843;&#35299;&#23454;&#29616;&#20102;&#36825;&#20010;&#20215;&#20540;&#12290;&#24403;&#29366;&#24577;&#26159;&#20108;&#36827;&#21046;&#26102;&#65292;&#22914;&#26524;&#21457;&#36865;&#32773;&#19981;&#33021;&#36890;&#36807;&#22987;&#32456;&#20302;&#20272;&#25110;&#39640;&#20272;&#29366;&#24577;&#26469;&#36798;&#21040;&#27604;&#24265;&#20215;&#35848;&#35805;&#26356;&#22909;&#30340;&#25928;&#26524;&#65292;&#37027;&#20040;&#35843;&#35299;&#20005;&#26684;&#20248;&#20110;&#24265;&#20215;&#35848;&#35805;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study optimal (information) mediation in sender-receiver communication games where the sender has transparent motives: she only cares about the receiver's actions and beliefs. We characterize the feasible distributions over the receiver's beliefs under mediation and the value of mediation. The sender achieves her optimal Bayesian persuasion value by mediation if and only if this value is attained by cheap talk. When the state is binary, mediation strictly improves on cheap talk if and only if the sender cannot do better than under cheap talk by always under -- or over -- stating the state.
&lt;/p&gt;</description></item><item><title>&#22320;&#21306;&#33322;&#31354;&#20844;&#21496;&#30340;&#20849;&#21516;&#23376;&#25215;&#21253;&#19968;&#26041;&#38754;&#20250;&#23548;&#33268;&#26356;&#20302;&#30340;&#20215;&#26684;&#65292;&#21478;&#19968;&#26041;&#38754;&#20250;&#23548;&#33268;&#26356;&#39640;&#30340;&#20215;&#26684;&#65292;&#36825;&#34920;&#26126;&#22320;&#21306;&#33322;&#31354;&#20844;&#21496;&#30340;&#22686;&#38271;&#21487;&#33021;&#23545;&#33322;&#31354;&#19994;&#20135;&#29983;&#21453;&#31454;&#20105;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2301.05999</link><description>&lt;p&gt;
&#20849;&#21516;&#23376;&#25215;&#21253;&#21644;&#33322;&#31354;&#20215;&#26684;
&lt;/p&gt;
&lt;p&gt;
Common Subcontracting and Airline Prices. (arXiv:2301.05999v2 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2301.05999
&lt;/p&gt;
&lt;p&gt;
&#22320;&#21306;&#33322;&#31354;&#20844;&#21496;&#30340;&#20849;&#21516;&#23376;&#25215;&#21253;&#19968;&#26041;&#38754;&#20250;&#23548;&#33268;&#26356;&#20302;&#30340;&#20215;&#26684;&#65292;&#21478;&#19968;&#26041;&#38754;&#20250;&#23548;&#33268;&#26356;&#39640;&#30340;&#20215;&#26684;&#65292;&#36825;&#34920;&#26126;&#22320;&#21306;&#33322;&#31354;&#20844;&#21496;&#30340;&#22686;&#38271;&#21487;&#33021;&#23545;&#33322;&#31354;&#19994;&#20135;&#29983;&#21453;&#31454;&#20105;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#32654;&#22269;&#33322;&#31354;&#19994;&#20013;&#65292;&#29420;&#31435;&#30340;&#22320;&#21306;&#33322;&#31354;&#20844;&#21496;&#20195;&#34920;&#20960;&#23478;&#20840;&#22269;&#33322;&#31354;&#20844;&#21496;&#22312;&#19981;&#21516;&#30340;&#24066;&#22330;&#19978;&#20026;&#20056;&#23458;&#39134;&#34892;&#65292;&#36825;&#20135;&#29983;&#20102;&#8220;&#20849;&#21516;&#23376;&#25215;&#21253;&#8221;&#30340;&#24773;&#20917;&#12290;&#19968;&#26041;&#38754;&#65292;&#25105;&#20204;&#21457;&#29616;&#23376;&#25215;&#21253;&#19982;&#36739;&#20302;&#30340;&#20215;&#26684;&#26377;&#20851;&#65292;&#36825;&#31526;&#21512;&#22320;&#21306;&#33322;&#31354;&#20844;&#21496;&#27604;&#20027;&#35201;&#33322;&#31354;&#20844;&#21496;&#26356;&#20302;&#25104;&#26412;&#36816;&#36755;&#20056;&#23458;&#30340;&#24819;&#27861;&#12290;&#21478;&#19968;&#26041;&#38754;&#65292;&#25105;&#20204;&#21457;&#29616;&#8220;&#20849;&#21516;&#8221;&#23376;&#25215;&#21253;&#19982;&#26356;&#39640;&#30340;&#20215;&#26684;&#26377;&#20851;&#12290;&#36825;&#20004;&#31181;&#30456;&#20114;&#20914;&#31361;&#30340;&#25928;&#24212;&#34920;&#26126;&#65292;&#22320;&#21306;&#33322;&#31354;&#20844;&#21496;&#30340;&#22686;&#38271;&#21487;&#33021;&#23545;&#35813;&#34892;&#19994;&#20135;&#29983;&#21453;&#31454;&#20105;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
In the US airline industry, independent regional airlines fly passengers on behalf of several national airlines across different markets, giving rise to $\textit{common subcontracting}$. On the one hand, we find that subcontracting is associated with lower prices, consistent with the notion that regional airlines tend to fly passengers at lower costs than major airlines. On the other hand, we find that $\textit{common}$ subcontracting is associated with higher prices. These two countervailing effects suggest that the growth of regional airlines can have anticompetitive implications for the industry.
&lt;/p&gt;</description></item></channel></rss>