<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>Mobilit\"at.Leben&#30740;&#31350;&#35843;&#26597;&#20102;2022&#24180;&#24503;&#22269;&#30340;&#19968;&#20010;&#33258;&#28982;&#23454;&#39564;&#23545;&#20986;&#34892;&#34892;&#20026;&#30340;&#24433;&#21709;&#65292;&#30740;&#31350;&#21253;&#25324;&#20004;&#20010;&#26102;&#26399;&#21644;&#20004;&#20010;&#20803;&#32032;&#65292;&#36890;&#36807;&#38382;&#21367;&#35843;&#26597;&#21644;&#22522;&#20110;&#26234;&#33021;&#25163;&#26426;&#30340;&#34987;&#21160;&#33322;&#28857;&#36319;&#36394;&#65292;&#24182;&#20998;&#20139;&#20102;&#20851;&#20110;&#36827;&#34892;&#22823;&#35268;&#27169;&#38754;&#26495;&#30740;&#31350;&#30340;&#32463;&#39564;&#12290;</title><link>http://arxiv.org/abs/2308.04973</link><description>&lt;p&gt;
Mobilit\"at.Leben&#30740;&#31350;&#65306;&#19968;&#24180;&#30340;&#31227;&#21160;&#36861;&#36394;&#38754;&#26495;
&lt;/p&gt;
&lt;p&gt;
The Mobilit\"at.Leben Study: a Year-Long Mobility-Tracking Panel. (arXiv:2308.04973v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.04973
&lt;/p&gt;
&lt;p&gt;
Mobilit\"at.Leben&#30740;&#31350;&#35843;&#26597;&#20102;2022&#24180;&#24503;&#22269;&#30340;&#19968;&#20010;&#33258;&#28982;&#23454;&#39564;&#23545;&#20986;&#34892;&#34892;&#20026;&#30340;&#24433;&#21709;&#65292;&#30740;&#31350;&#21253;&#25324;&#20004;&#20010;&#26102;&#26399;&#21644;&#20004;&#20010;&#20803;&#32032;&#65292;&#36890;&#36807;&#38382;&#21367;&#35843;&#26597;&#21644;&#22522;&#20110;&#26234;&#33021;&#25163;&#26426;&#30340;&#34987;&#21160;&#33322;&#28857;&#36319;&#36394;&#65292;&#24182;&#20998;&#20139;&#20102;&#20851;&#20110;&#36827;&#34892;&#22823;&#35268;&#27169;&#38754;&#26495;&#30740;&#31350;&#30340;&#32463;&#39564;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
Mobilit\"at.Leben&#30740;&#31350;&#35843;&#26597;&#20102;&#24503;&#22269;&#19968;&#20010;&#33258;&#28982;&#23454;&#39564;&#23545;&#20986;&#34892;&#34892;&#20026;&#30340;&#24433;&#21709;&#12290;&#20026;&#24212;&#23545;2022&#24180;&#30340;&#29983;&#27963;&#25104;&#26412;&#21361;&#26426;&#65292;&#22312;2022&#24180;6&#26376;&#12289;7&#26376;&#21644;8&#26376;&#65292;&#24341;&#20837;&#20102;&#20004;&#39033;&#25919;&#31574;&#25514;&#26045;&#65292;&#20197;&#20943;&#23569;&#20154;&#21475;&#20986;&#34892;&#25104;&#26412;&#65306;&#29123;&#27833;&#28040;&#36153;&#31246;&#21066;&#20943;&#21644;&#20960;&#20046;&#20813;&#36153;&#30340;&#20844;&#20849;&#20132;&#36890;&#65292;&#31216;&#20026;9&#27431;&#31080;&#12290;&#24503;&#22269;&#31080;&#30340;&#32487;&#20219;&#32773;&#65292;&#25152;&#35859;&#30340;Deutschlandticket&#30340;&#20844;&#21578;&#65292;&#23548;&#33268;&#31435;&#21363;&#20915;&#23450;&#32487;&#32493;&#30740;&#31350;&#12290;Mobilit\"at.Leben&#30740;&#31350;&#26377;&#20004;&#20010;&#26102;&#26399;&#65292;9&#27431;&#31080;&#26102;&#26399;&#21644;Deutschlandticket&#26102;&#26399;&#65292;&#21253;&#25324;&#20960;&#20010;&#38382;&#21367;&#35843;&#26597;&#21644;&#22522;&#20110;&#26234;&#33021;&#25163;&#26426;&#30340;&#34987;&#21160;&#33322;&#28857;&#36319;&#36394;&#12290;&#25972;&#20010;&#30740;&#31350;&#25345;&#32493;&#26102;&#38388;&#20849;&#35745;&#21313;&#19977;&#20010;&#26376;&#12290;&#22312;&#26412;&#35770;&#25991;&#20013;&#65292;&#25105;&#20204;&#25253;&#21578;&#20102;&#30740;&#31350;&#35774;&#35745;&#12289;&#25307;&#21215;&#31574;&#30053;&#12289;&#35843;&#26597;&#21442;&#19982;&#24773;&#20917;&#20197;&#21450;&#36319;&#36394;&#37096;&#20998;&#65292;&#24182;&#20998;&#20139;&#20102;&#25105;&#20204;&#22312;&#36827;&#34892;&#22823;&#35268;&#27169;&#38754;&#26495;&#30740;&#31350;&#26041;&#38754;&#30340;&#32463;&#39564;&#12290;&#24635;&#20307;&#32780;&#35328;&#65292;3080&#20154;&#21442;&#21152;&#20102;&#36825;&#39033;&#30740;&#31350;&#12290;
&lt;/p&gt;
&lt;p&gt;
The Mobilit\"at.Leben study investigated travel behavior effects of a natural experiment in Germany. In response to the 2022 cost-of-living crisis, two policy measures to reduce travel costs for the population in June, July, and August 2022 were introduced: a fuel excise tax cut and almost fare-free public transport with the so-called 9-Euro-Ticket. The announcement of a successor ticket to the 9-Euro-Ticket, the so-called Deutschlandticket, led to the immediate decision to continue the study. The Mobilit\"at.Leben study has two periods, the 9-Euro-Ticket period and the Deutschlandticket period, and comprises two elements: several questionnaires and a smartphone-based passive waypoint tracking. The entire duration of the study was almost thirteen months.  In this paper, we report on the study design, the recruitment strategy, the study participation in the survey, and the tracking parts, and we share our experience in conducting such large-scale panel studies. Overall, 3,080 people reg
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20379;&#20102;&#19968;&#20010;&#22312;&#26679;&#26412;&#36873;&#25321;&#21644;&#32570;&#22833;&#25968;&#25454;&#19979;&#36827;&#34892;&#20914;&#20987;&#35780;&#20272;&#30340;&#25351;&#21335;&#65292;&#24182;&#36890;&#36807;&#23545;&#20025;&#40614;&#23398;&#26657;&#25945;&#24072;&#21161;&#29702;&#35797;&#39564;&#30340;&#20998;&#26512;&#65292;&#23637;&#31034;&#20102;&#22788;&#29702;&#32570;&#22833;&#25968;&#25454;&#23545;&#20110;&#24515;&#29702;&#20581;&#24247;&#24433;&#21709;&#32467;&#35770;&#30340;&#37325;&#35201;&#24615;&#12290;</title><link>http://arxiv.org/abs/2308.04963</link><description>&lt;p&gt;
&#19968;&#20010;&#22312;&#26679;&#26412;&#36873;&#25321;&#21644;&#32570;&#22833;&#25968;&#25454;&#19979;&#30340;&#20914;&#20987;&#35780;&#20272;&#25351;&#21335;&#65306;&#25945;&#24072;&#21161;&#29702;&#21644;&#38738;&#23569;&#24180;&#24515;&#29702;&#20581;&#24247;
&lt;/p&gt;
&lt;p&gt;
A Guide to Impact Evaluation under Sample Selection and Missing Data: Teacher's Aides and Adolescent Mental Health. (arXiv:2308.04963v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.04963
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20379;&#20102;&#19968;&#20010;&#22312;&#26679;&#26412;&#36873;&#25321;&#21644;&#32570;&#22833;&#25968;&#25454;&#19979;&#36827;&#34892;&#20914;&#20987;&#35780;&#20272;&#30340;&#25351;&#21335;&#65292;&#24182;&#36890;&#36807;&#23545;&#20025;&#40614;&#23398;&#26657;&#25945;&#24072;&#21161;&#29702;&#35797;&#39564;&#30340;&#20998;&#26512;&#65292;&#23637;&#31034;&#20102;&#22788;&#29702;&#32570;&#22833;&#25968;&#25454;&#23545;&#20110;&#24515;&#29702;&#20581;&#24247;&#24433;&#21709;&#32467;&#35770;&#30340;&#37325;&#35201;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20851;&#27880;&#22312;&#25968;&#25454;&#36873;&#25321;&#24615;&#21644;/&#25110;&#32570;&#22833;&#24773;&#20917;&#19979;&#65292;&#22240;&#26524;&#35780;&#20272;&#38382;&#39064;&#30340;&#36776;&#35748;&#12289;&#20272;&#35745;&#21644;&#35268;&#33539;&#21270;&#26816;&#39564;&#12290;&#25105;&#20204;&#21033;&#29992;&#22270;&#24418;&#26041;&#27861;&#25991;&#29486;&#20013;&#30340;&#26368;&#26032;&#36827;&#23637;&#65292;&#25552;&#20379;&#19968;&#20010;&#32479;&#19968;&#30340;&#26694;&#26550;&#26469;&#25351;&#23548;&#23454;&#35777;&#30740;&#31350;&#12290;&#36825;&#31181;&#26041;&#27861;&#25972;&#21512;&#24182;&#19982;&#22312;&#32570;&#22833;&#25968;&#25454;&#12289;&#22240;&#26524;&#26426;&#22120;&#23398;&#20064;&#12289;&#38754;&#26495;&#25968;&#25454;&#20998;&#26512;&#31561;&#39046;&#22495;&#20013;&#30340;&#33879;&#21517;&#36776;&#35748;&#21644;&#26816;&#39564;&#31574;&#30053;&#30456;&#36830;&#25509;&#12290;&#22312;&#26679;&#26412;&#36873;&#25321;&#27169;&#22411;&#21644;&#21463;&#25439;&#23454;&#39564;&#20013;&#30340;&#36776;&#35748;&#21644;&#35268;&#33539;&#21270;&#26816;&#39564;&#32972;&#26223;&#19979;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#20854;&#23454;&#29992;&#24615;&#12290;&#25105;&#20204;&#23545;&#20025;&#40614;&#23398;&#26657;&#20845;&#24180;&#32423;&#30340;&#22823;&#35268;&#27169;&#38598;&#32676;&#38543;&#26426;&#23545;&#29031;&#25945;&#24072;&#21161;&#29702;&#35797;&#39564;&#36827;&#34892;&#20102;&#26032;&#39062;&#30340;&#20998;&#26512;&#12290;&#21363;&#20351;&#26377;&#35814;&#32454;&#30340;&#34892;&#25919;&#25968;&#25454;&#65292;&#22788;&#29702;&#32570;&#22833;&#25968;&#25454;&#22312;&#20851;&#20110;&#24515;&#29702;&#20581;&#24247;&#24433;&#21709;&#30340;&#25972;&#20307;&#32467;&#35770;&#20013;&#36215;&#30528;&#33267;&#20851;&#37325;&#35201;&#30340;&#20316;&#29992;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;&#25945;&#23398;&#21161;&#29702;&#25552;&#20379;&#20102;&#19968;&#31181;&#25913;&#21892;&#20869;&#21270;&#34892;&#20026;&#30340;&#26377;&#25928;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper is concerned with identification, estimation, and specification testing in causal evaluation problems when data is selective and/or missing. We leverage recent advances in the literature on graphical methods to provide a unifying framework for guiding empirical practice. The approach integrates and connects to prominent identification and testing strategies in the literature on missing data, causal machine learning, panel data analysis, and more. We demonstrate its utility in the context of identification and specification testing in sample selection models and field experiments with attrition. We provide a novel analysis of a large-scale cluster-randomized controlled teacher's aide trial in Danish schools at grade 6. Even with detailed administrative data, the handling of missing data crucially affects broader conclusions about effects on mental health. Results suggest that teaching assistants provide an effective way of improving internalizing behavior for large parts of t
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#20010;&#20855;&#26377;&#22810;&#20010;&#20248;&#20808;&#32423;&#30340;&#23398;&#26657;&#36873;&#25321;&#27169;&#22411;&#65292;&#24341;&#20837;&#20102;&#19968;&#31181;&#21517;&#20026;M-fairness&#30340;&#20844;&#24179;&#24615;&#27010;&#24565;&#65292;&#24182;&#20171;&#32461;&#20102;&#19968;&#31181;&#21033;&#29992;&#25928;&#29575;&#35843;&#25972;&#24310;&#36831;&#25509;&#21463;&#31639;&#27861;&#30340;&#26426;&#21046;&#65292;&#35813;&#26426;&#21046;&#26159;&#23398;&#29983;&#26368;&#20248;M&#31283;&#23450;&#30340;&#65292;&#25913;&#36827;&#32676;&#20307;&#26368;&#20248;M&#31283;&#23450;&#30340;&#65292;&#24182;&#19988;&#23545;&#25913;&#36827;&#26159;&#26377;&#21709;&#24212;&#30340;&#12290;</title><link>http://arxiv.org/abs/2308.04780</link><description>&lt;p&gt;
&#20855;&#26377;&#22810;&#20010;&#20248;&#20808;&#32423;&#30340;&#23398;&#26657;&#36873;&#25321;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
School Choice with Multiple Priorities. (arXiv:2308.04780v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.04780
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#20010;&#20855;&#26377;&#22810;&#20010;&#20248;&#20808;&#32423;&#30340;&#23398;&#26657;&#36873;&#25321;&#27169;&#22411;&#65292;&#24341;&#20837;&#20102;&#19968;&#31181;&#21517;&#20026;M-fairness&#30340;&#20844;&#24179;&#24615;&#27010;&#24565;&#65292;&#24182;&#20171;&#32461;&#20102;&#19968;&#31181;&#21033;&#29992;&#25928;&#29575;&#35843;&#25972;&#24310;&#36831;&#25509;&#21463;&#31639;&#27861;&#30340;&#26426;&#21046;&#65292;&#35813;&#26426;&#21046;&#26159;&#23398;&#29983;&#26368;&#20248;M&#31283;&#23450;&#30340;&#65292;&#25913;&#36827;&#32676;&#20307;&#26368;&#20248;M&#31283;&#23450;&#30340;&#65292;&#24182;&#19988;&#23545;&#25913;&#36827;&#26159;&#26377;&#21709;&#24212;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#32771;&#34385;&#20102;&#19968;&#31181;&#27169;&#22411;&#65292;&#22312;&#36825;&#31181;&#27169;&#22411;&#20013;&#65292;&#23398;&#26657;&#21487;&#33021;&#23545;&#23398;&#29983;&#26377;&#22810;&#20010;&#20248;&#20808;&#32423;&#39034;&#24207;&#65292;&#36825;&#20123;&#39034;&#24207;&#21487;&#33021;&#30456;&#20114;&#30683;&#30462;&#12290;&#20363;&#22914;&#65292;&#22312;&#23398;&#26657;&#36873;&#25321;&#31995;&#32479;&#20013;&#65292;&#30001;&#20110;&#20804;&#24351;&#22992;&#22969;&#20248;&#20808;&#32423;&#21644;&#27493;&#34892;&#21306;&#22495;&#20248;&#20808;&#32423;&#24182;&#23384;&#65292;&#22522;&#20110;&#23427;&#20204;&#30340;&#20248;&#20808;&#32423;&#39034;&#24207;&#21487;&#33021;&#23384;&#22312;&#20914;&#31361;&#12290;&#22312;&#36825;&#31181;&#24773;&#20917;&#19979;&#65292;&#21487;&#33021;&#25214;&#19981;&#21040;&#28385;&#36275;&#25152;&#26377;&#20248;&#20808;&#32423;&#39034;&#24207;&#30340;&#21305;&#37197;&#12290;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#31181;&#21517;&#20026;M-fairness&#30340;&#26032;&#39062;&#20844;&#24179;&#24615;&#27010;&#24565;&#26469;&#30740;&#31350;&#36825;&#26679;&#30340;&#24066;&#22330;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#37325;&#28857;&#30740;&#31350;&#20102;&#19968;&#31181;&#26356;&#20855;&#20307;&#30340;&#24773;&#20917;&#65292;&#21363;&#25152;&#26377;&#23398;&#26657;&#37117;&#26377;&#20004;&#20010;&#20248;&#20808;&#32423;&#39034;&#24207;&#65292;&#24182;&#19988;&#23545;&#20110;&#26576;&#20010;&#23398;&#29983;&#32676;&#20307;&#65292;&#27599;&#25152;&#23398;&#26657;&#30340;&#19968;&#20010;&#20248;&#20808;&#32423;&#39034;&#24207;&#26159;&#21478;&#19968;&#20248;&#20808;&#32423;&#39034;&#24207;&#30340;&#25913;&#36827;&#12290;&#19968;&#20010;&#35828;&#26126;&#24615;&#20363;&#23376;&#26159;&#20855;&#26377;&#22522;&#20110;&#20248;&#20808;&#32423;&#30340;&#31215;&#26497;&#34892;&#21160;&#25919;&#31574;&#30340;&#23398;&#26657;&#36873;&#25321;&#21305;&#37197;&#24066;&#22330;&#12290;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#31181;&#21033;&#29992;&#25928;&#29575;&#35843;&#25972;&#24310;&#36831;&#25509;&#21463;&#31639;&#27861;&#30340;&#26426;&#21046;&#65292;&#24182;&#35777;&#26126;&#35813;&#26426;&#21046;&#26159;&#23398;&#29983;&#26368;&#20248;M&#31283;&#23450;&#30340;&#65292;&#25913;&#36827;&#32676;&#20307;&#26368;&#20248;M&#31283;&#23450;&#30340;&#65292;&#24182;&#19988;&#23545;&#25913;&#36827;&#26159;&#26377;&#21709;&#24212;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
This study considers a model where schools may have multiple priority orders on students, which may be inconsistent with each other. For example, in school choice systems, since the sibling priority and the walk zone priority coexist, the priority orders based on them would be conflicting. In that case, there may be no matching that respect to all priority orders. We introduce a novel fairness notion called M-fairness to examine such markets. Further, we focus on a more specific situation where all schools have two priority orders, and for a certain group of students, a priority order of each school is an improvement of the other priority order of the school. An illustrative example is the school choice matching market with a priority-based affirmative action policy. We introduce a mechanism that utilizes the efficiency adjusted deferred acceptance algorithm and show that the mechanism is student optimally M-stable, improved-group optimally M-stable and responsive to improvements.
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#24314;&#31435;&#20102;&#21333;&#35843;&#23545;&#24212;&#30340;&#27425;&#26799;&#24230;&#23450;&#29702;&#65292;&#20171;&#32461;&#20102;&#28508;&#21147;&#23450;&#29702;&#21644;&#23545;&#20598;&#23450;&#29702;&#65292;&#24182;&#21033;&#29992;&#36825;&#20123;&#32467;&#26524;&#37325;&#26032;&#35299;&#37322;&#21644;&#25193;&#23637;&#20102;&#20851;&#20110;&#20855;&#26377;&#19981;&#21487;&#20998;&#21106;&#29289;&#21697;&#30340;&#32463;&#27982;&#38656;&#27714;&#30340;&#34920;&#24449;&#65292;&#36824;&#24341;&#20837;&#20102;&#19968;&#20010;&#31616;&#21333;&#30340;&#27979;&#35797;&#26469;&#39564;&#35777;&#20934;&#32447;&#24615;&#32463;&#27982;&#20013;&#26159;&#21542;&#23384;&#22312;Walras&#22343;&#34913;&#12290;</title><link>http://arxiv.org/abs/2308.04593</link><description>&lt;p&gt;
&#28909;&#24102;&#20998;&#26512;&#65306;&#20197;&#19981;&#21487;&#20998;&#21106;&#29289;&#21697;&#20026;&#24212;&#29992;
&lt;/p&gt;
&lt;p&gt;
Tropical Analysis: With an Application to Indivisible Goods. (arXiv:2308.04593v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.04593
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#24314;&#31435;&#20102;&#21333;&#35843;&#23545;&#24212;&#30340;&#27425;&#26799;&#24230;&#23450;&#29702;&#65292;&#20171;&#32461;&#20102;&#28508;&#21147;&#23450;&#29702;&#21644;&#23545;&#20598;&#23450;&#29702;&#65292;&#24182;&#21033;&#29992;&#36825;&#20123;&#32467;&#26524;&#37325;&#26032;&#35299;&#37322;&#21644;&#25193;&#23637;&#20102;&#20851;&#20110;&#20855;&#26377;&#19981;&#21487;&#20998;&#21106;&#29289;&#21697;&#30340;&#32463;&#27982;&#38656;&#27714;&#30340;&#34920;&#24449;&#65292;&#36824;&#24341;&#20837;&#20102;&#19968;&#20010;&#31616;&#21333;&#30340;&#27979;&#35797;&#26469;&#39564;&#35777;&#20934;&#32447;&#24615;&#32463;&#27982;&#20013;&#26159;&#21542;&#23384;&#22312;Walras&#22343;&#34913;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#24314;&#31435;&#20102;&#21333;&#35843;&#23545;&#24212;&#30340;&#27425;&#26799;&#24230;&#23450;&#29702; - &#22914;&#26524;&#21333;&#35843;&#23545;&#24212;&#31561;&#20110;&#19968;&#20010;&#28508;&#21147;&#30340;&#27425;&#26799;&#24230;&#65292;&#37027;&#20040;&#23427;&#26159;&#20445;&#23432;&#30340;&#65292;&#21363;&#20351;&#36873;&#25321;&#36335;&#24452;&#19978;&#30340;&#23545;&#24212;&#29289;&#20063;&#26080;&#20851;&#32039;&#35201;&#65292;&#20854;&#27839;&#38381;&#21512;&#36335;&#24452;&#30340;&#31215;&#20998;&#28040;&#22833;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#20004;&#20010;&#30456;&#24212;&#30340;&#32467;&#26524;&#65306;&#28508;&#21147;&#23450;&#29702;&#65292;&#20854;&#20013;&#19968;&#20010;&#20445;&#23432;&#30340;&#21333;&#35843;&#23545;&#24212;&#21487;&#20197;&#34987;&#31215;&#20998;&#21040;&#28508;&#21147;&#20013;&#65292;&#20197;&#21450;&#23545;&#20598;&#23450;&#29702;&#65292;&#20854;&#20013;&#28508;&#21147;&#20855;&#26377;&#19968;&#20010; Fenchel &#23545;&#20598;&#65292;&#20854;&#27425;&#26799;&#24230;&#21448;&#26159;&#21478;&#19968;&#20010;&#20445;&#23432;&#30340;&#21333;&#35843;&#23545;&#24212;&#12290;&#25105;&#20204;&#21033;&#29992;&#36825;&#20123;&#32467;&#26524;&#37325;&#26032;&#35299;&#37322;&#21644;&#25193;&#23637;&#20102;Baldwin&#21644;Klemperer&#65288;2019&#24180;&#65289;&#20851;&#20110;&#20855;&#26377;&#19981;&#21487;&#20998;&#21106;&#29289;&#21697;&#30340;&#32463;&#27982;&#38656;&#27714;&#30340;&#34920;&#24449;&#12290;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#20010;&#22312;&#20934;&#32447;&#24615;&#32463;&#27982;&#20013;&#23384;&#22312;Walras&#22343;&#34913;&#30340;&#31616;&#21333;&#27979;&#35797;&#12290;Fenchel&#30340;&#23545;&#20598;&#23450;&#29702;&#34920;&#26126;&#65292;&#24403;&#24635;&#25928;&#29992;&#26159;&#20985;&#30340;&#26102;&#65292;&#27492;&#27979;&#35797;&#26159;&#21512;&#36866;&#30340;&#65292;&#21363;&#20351;&#25152;&#26377;&#28040;&#36153;&#32773;&#37117;&#20855;&#26377;&#20985;&#30340;&#25928;&#29992;&#65292;&#20294;&#22312;&#20855;&#26377;&#19981;&#21487;&#20998;&#21106;&#29289;&#21697;&#30340;&#24773;&#20917;&#19979;&#19981;&#19968;&#23450;&#25104;&#31435;&#12290;
&lt;/p&gt;
&lt;p&gt;
We establish the Subgradient Theorem for monotone correspondences -- a monotone correspondence is equal to the subdifferential of a potential if and only if it is conservative, i.e. its integral along a closed path vanishes irrespective of the selection from the correspondence along the path. We prove two attendant results: the Potential Theorem, whereby a conservative monotone correspondence can be integrated up to a potential, and the Duality Theorem, whereby the potential has a Fenchel dual whose subdifferential is another conservative monotone correspondence. We use these results to reinterpret and extend Baldwin and Klemperer's (2019) characterization of demand in economies with indivisible goods. We introduce a simple test for existence of Walrasian equilibrium in quasi-linear economies. Fenchel's Duality Theorem implies this test is met when the aggregate utility is concave, which is not necessarily the case with indivisible goods even if all consumers have concave utilities.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#26102;&#38388;&#24207;&#21015;&#22238;&#24402;&#27169;&#22411;&#30340;&#26497;&#38480;&#29702;&#35770;&#21644;&#23616;&#37096;&#21040;&#19968;&#33268;&#24615;&#21442;&#25968;&#21270;&#24314;&#27169;&#26102;&#38388;&#24207;&#21015;&#38750;&#24179;&#31283;&#24615;&#12290;&#21516;&#26102;&#65292;&#36824;&#25506;&#35752;&#20102;&#32771;&#34385;&#29305;&#24449;&#20540;&#30340;&#21327;&#26041;&#24046;&#30697;&#38453;&#21644;&#38750;&#24179;&#31283;&#33258;&#22238;&#24402;&#36807;&#31243;&#20013;&#21333;&#20301;&#26681;&#36866;&#24230;&#20559;&#24046;&#30340;&#38750;&#28176;&#36817;&#29702;&#35770;&#32467;&#26524;&#65292;&#24182;&#25552;&#20986;&#20102;&#38750;&#24179;&#31283;&#26102;&#38388;&#24207;&#21015;&#35745;&#37327;&#32463;&#27982;&#23398;&#21644;&#32593;&#32476;&#35745;&#37327;&#32463;&#27982;&#23398;&#20013;&#30340;&#24320;&#25918;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2308.01418</link><description>&lt;p&gt;
&#32593;&#32476;&#20381;&#36182;&#24615;&#21644;&#38750;&#24179;&#31283;&#24615;&#19979;&#30340;&#26497;&#38480;&#29702;&#35770;
&lt;/p&gt;
&lt;p&gt;
Limit Theory under Network Dependence and Nonstationarity. (arXiv:2308.01418v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.01418
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#26102;&#38388;&#24207;&#21015;&#22238;&#24402;&#27169;&#22411;&#30340;&#26497;&#38480;&#29702;&#35770;&#21644;&#23616;&#37096;&#21040;&#19968;&#33268;&#24615;&#21442;&#25968;&#21270;&#24314;&#27169;&#26102;&#38388;&#24207;&#21015;&#38750;&#24179;&#31283;&#24615;&#12290;&#21516;&#26102;&#65292;&#36824;&#25506;&#35752;&#20102;&#32771;&#34385;&#29305;&#24449;&#20540;&#30340;&#21327;&#26041;&#24046;&#30697;&#38453;&#21644;&#38750;&#24179;&#31283;&#33258;&#22238;&#24402;&#36807;&#31243;&#20013;&#21333;&#20301;&#26681;&#36866;&#24230;&#20559;&#24046;&#30340;&#38750;&#28176;&#36817;&#29702;&#35770;&#32467;&#26524;&#65292;&#24182;&#25552;&#20986;&#20102;&#38750;&#24179;&#31283;&#26102;&#38388;&#24207;&#21015;&#35745;&#37327;&#32463;&#27982;&#23398;&#21644;&#32593;&#32476;&#35745;&#37327;&#32463;&#27982;&#23398;&#20013;&#30340;&#24320;&#25918;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36825;&#20123;&#35762;&#24231;&#31508;&#35760;&#26159;&#19968;&#38376;&#20851;&#20110;&#26102;&#38388;&#24207;&#21015;&#35745;&#37327;&#32463;&#27982;&#23398;&#21644;&#32593;&#32476;&#35745;&#37327;&#32463;&#27982;&#23398;&#30340;&#30701;&#26399;&#35838;&#31243;&#30340;&#34917;&#20805;&#36164;&#26009;&#12290;&#25105;&#20204;&#24378;&#35843;&#26102;&#38388;&#24207;&#21015;&#22238;&#24402;&#27169;&#22411;&#30340;&#26497;&#38480;&#29702;&#35770;&#65292;&#20197;&#21450;&#22312;&#24314;&#27169;&#26102;&#38388;&#24207;&#21015;&#38750;&#24179;&#31283;&#24615;&#26102;&#20351;&#29992;&#30340;&#23616;&#37096;&#21040;&#19968;&#33268;&#24615;&#21442;&#25968;&#21270;&#26041;&#27861;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36824;&#20171;&#32461;&#20102;&#22312;&#32771;&#34385;&#21327;&#26041;&#24046;&#30697;&#38453;&#30340;&#29305;&#24449;&#20540;&#26102;&#30340;&#36866;&#24230;&#20559;&#24046;&#21407;&#21017;&#30340;&#21508;&#31181;&#38750;&#28176;&#36817;&#29702;&#35770;&#32467;&#26524;&#65292;&#20197;&#21450;&#38750;&#24179;&#31283;&#33258;&#22238;&#24402;&#36807;&#31243;&#20013;&#21333;&#20301;&#26681;&#36866;&#24230;&#20559;&#24046;&#30340;&#28176;&#36817;&#29702;&#35770;&#12290;&#34429;&#28982;&#24182;&#26410;&#28085;&#30422;&#25991;&#29486;&#20013;&#30340;&#25152;&#26377;&#24212;&#29992;&#65292;&#20294;&#25105;&#20204;&#36824;&#35752;&#35770;&#20102;&#38750;&#24179;&#31283;&#26102;&#38388;&#24207;&#21015;&#35745;&#37327;&#32463;&#27982;&#23398;&#21644;&#32593;&#32476;&#35745;&#37327;&#32463;&#27982;&#23398;&#20013;&#30340;&#19968;&#20123;&#24320;&#25918;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;
These lecture notes represent supplementary material for a short course on time series econometrics and network econometrics. We give emphasis on limit theory for time series regression models as well as the use of the local-to-unity parametrization when modeling time series nonstationarity. Moreover, we present various non-asymptotic theory results for moderate deviation principles when considering the eigenvalues of covariance matrices as well as asymptotics for unit root moderate deviations in nonstationary autoregressive processes. Although not all applications from the literature are covered we also discuss some open problems in nonstationary time series econometrics and network econometrics.
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#22823;&#35268;&#27169;&#19990;&#30028;&#20013;&#30340;&#35777;&#25454;&#21512;&#20316;&#65288;ECL&#65289;&#30340;&#38382;&#39064;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#20010;&#19981;&#23436;&#20840;&#20449;&#24687;&#30340;&#35848;&#21028;&#38382;&#39064;&#30340;&#21338;&#24328;&#35770;&#27169;&#22411;&#12290;&#36890;&#36807;&#27169;&#22411;&#65292;&#20316;&#32773;&#21457;&#29616;&#25152;&#26377;&#21512;&#20316;&#32773;&#24517;&#39035;&#26368;&#22823;&#21270;&#30456;&#21516;&#30340;&#21152;&#26435;&#25928;&#29992;&#20989;&#25968;&#20043;&#21644;&#25165;&#33021;&#36798;&#21040;&#24085;&#32047;&#25176;&#26368;&#20248;&#32467;&#26524;&#12290;</title><link>http://arxiv.org/abs/2307.04879</link><description>&lt;p&gt;
&#22312;&#22823;&#35268;&#27169;&#19990;&#30028;&#20013;&#24314;&#27169;&#35777;&#25454;&#21512;&#20316;
&lt;/p&gt;
&lt;p&gt;
Modeling evidential cooperation in large worlds. (arXiv:2307.04879v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.04879
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#22823;&#35268;&#27169;&#19990;&#30028;&#20013;&#30340;&#35777;&#25454;&#21512;&#20316;&#65288;ECL&#65289;&#30340;&#38382;&#39064;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#20010;&#19981;&#23436;&#20840;&#20449;&#24687;&#30340;&#35848;&#21028;&#38382;&#39064;&#30340;&#21338;&#24328;&#35770;&#27169;&#22411;&#12290;&#36890;&#36807;&#27169;&#22411;&#65292;&#20316;&#32773;&#21457;&#29616;&#25152;&#26377;&#21512;&#20316;&#32773;&#24517;&#39035;&#26368;&#22823;&#21270;&#30456;&#21516;&#30340;&#21152;&#26435;&#25928;&#29992;&#20989;&#25968;&#20043;&#21644;&#25165;&#33021;&#36798;&#21040;&#24085;&#32047;&#25176;&#26368;&#20248;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22823;&#35268;&#27169;&#19990;&#30028;&#20013;&#30340;&#35777;&#25454;&#21512;&#20316;&#65288;ECL&#65289;&#25351;&#30340;&#26159;&#20154;&#31867;&#21644;&#20854;&#20182;&#20195;&#29702;&#20154;&#21487;&#20197;&#36890;&#36807;&#19982;&#20855;&#26377;&#19981;&#21516;&#20215;&#20540;&#35266;&#30340;&#30456;&#20284;&#20195;&#29702;&#20154;&#22312;&#19968;&#20010;&#22823;&#23431;&#23449;&#20013;&#30340;&#22240;&#26524;&#26029;&#24320;&#37096;&#20998;&#21512;&#20316;&#32780;&#33719;&#30410;&#12290;&#21512;&#20316;&#20026;&#20195;&#29702;&#20154;&#25552;&#20379;&#20102;&#20854;&#20182;&#30456;&#20284;&#20195;&#29702;&#20154;&#21487;&#33021;&#20250;&#21512;&#20316;&#30340;&#35777;&#25454;&#65292;&#20174;&#32780;&#20351;&#25152;&#26377;&#20154;&#37117;&#20174;&#20132;&#26131;&#20013;&#33719;&#30410;&#12290;&#23545;&#20110;&#21033;&#20182;&#20027;&#20041;&#32773;&#26469;&#35828;&#65292;&#36825;&#21487;&#33021;&#26159;&#19968;&#20010;&#20851;&#38190;&#30340;&#32771;&#34385;&#22240;&#32032;&#12290;&#25105;&#23558;ECL&#21457;&#23637;&#20026;&#19968;&#20010;&#19981;&#23436;&#20840;&#20449;&#24687;&#30340;&#35848;&#21028;&#38382;&#39064;&#30340;&#21338;&#24328;&#35770;&#27169;&#22411;&#12290;&#35813;&#27169;&#22411;&#34701;&#20837;&#20102;&#23545;&#20182;&#20154;&#20215;&#20540;&#35266;&#21644;&#23454;&#35777;&#24773;&#20917;&#30340;&#19981;&#30830;&#23450;&#24615;&#65292;&#24182;&#35299;&#20915;&#20102;&#36873;&#25321;&#22949;&#21327;&#32467;&#26524;&#30340;&#38382;&#39064;&#12290;&#20351;&#29992;&#35813;&#27169;&#22411;&#65292;&#25105;&#35843;&#26597;&#20102;ECL&#23384;&#22312;&#30340;&#38382;&#39064;&#65292;&#24182;&#27010;&#36848;&#20102;&#24320;&#25918;&#30340;&#25216;&#26415;&#21644;&#21746;&#23398;&#38382;&#39064;&#12290;&#25105;&#23637;&#31034;&#20102;&#25152;&#26377;&#21512;&#20316;&#32773;&#24517;&#39035;&#26368;&#22823;&#21270;&#30456;&#21516;&#30340;&#21152;&#26435;&#25928;&#29992;&#20989;&#25968;&#20043;&#21644;&#25165;&#33021;&#36798;&#21040;&#24085;&#32047;&#25176;&#26368;&#20248;&#32467;&#26524;&#12290;&#28982;&#32780;&#65292;&#25105;&#21453;&#23545;&#36890;&#36807;&#23545;&#25928;&#29992;&#20989;&#25968;&#36827;&#34892;&#24402;&#19968;&#21270;&#26469;&#38544;&#24335;&#36873;&#25321;&#22949;&#21327;&#32467;&#26524;&#12290;&#25105;&#22238;&#39038;&#20102;&#35848;&#21028;&#29702;&#35770;&#21644;
&lt;/p&gt;
&lt;p&gt;
Evidential cooperation in large worlds (ECL) refers to the idea that humans and other agents can benefit by cooperating with similar agents with differing values in causally disconnected parts of a large universe. Cooperating provides agents with evidence that other similar agents are likely to cooperate too, resulting in gains from trade for all. This could be a crucial consideration for altruists.  I develop a game-theoretic model of ECL as an incomplete information bargaining problem. The model incorporates uncertainty about others' value systems and empirical situations, and addresses the problem of selecting a compromise outcome. Using the model, I investigate issues with ECL and outline open technical and philosophical questions.  I show that all cooperators must maximize the same weighted sum of utility functions to reach a Pareto optimal outcome. However, I argue against selecting a compromise outcome implicitly by normalizing utility functions. I review bargaining theory and a
&lt;/p&gt;</description></item><item><title>&#27874;&#20848;&#35760;&#24405;&#20102;&#27431;&#27954;&#26368;&#20302;&#30340;&#24615;&#21035;&#34218;&#36164;&#24046;&#36317;&#20043;&#19968;&#12290;&#36825;&#39033;&#30740;&#31350;&#21457;&#29616;&#65292;&#27597;&#20146;&#30340;&#25910;&#20837;&#22312;&#29983;&#32946;&#21518;&#20250;&#38477;&#20302;&#32422;20&#65285;&#65292;&#20294;&#22312;15&#24180;&#21518;&#19982;&#38750;&#27597;&#20146;&#30340;&#25910;&#20837;&#36235;&#20110;&#19968;&#33268;&#65292;&#32780;&#29238;&#20146;&#30340;&#25910;&#20837;&#22312;&#23401;&#23376;&#21040;&#26469;&#20043;&#21069;&#23601;&#24050;&#32463;&#39640;&#20110;&#38750;&#29238;&#20146;&#12290;</title><link>http://arxiv.org/abs/2306.12924</link><description>&lt;p&gt;
&#23401;&#23376;&#23545;&#27874;&#20848;&#22899;&#24615;&#21644;&#30007;&#24615;&#30340;&#21171;&#21160;&#21147;&#24066;&#22330;&#32467;&#26524;&#30340;&#24433;&#21709;
&lt;/p&gt;
&lt;p&gt;
The Impact of Parenthood on Labour Market Outcomes of Women and Men in Poland. (arXiv:2306.12924v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.12924
&lt;/p&gt;
&lt;p&gt;
&#27874;&#20848;&#35760;&#24405;&#20102;&#27431;&#27954;&#26368;&#20302;&#30340;&#24615;&#21035;&#34218;&#36164;&#24046;&#36317;&#20043;&#19968;&#12290;&#36825;&#39033;&#30740;&#31350;&#21457;&#29616;&#65292;&#27597;&#20146;&#30340;&#25910;&#20837;&#22312;&#29983;&#32946;&#21518;&#20250;&#38477;&#20302;&#32422;20&#65285;&#65292;&#20294;&#22312;15&#24180;&#21518;&#19982;&#38750;&#27597;&#20146;&#30340;&#25910;&#20837;&#36235;&#20110;&#19968;&#33268;&#65292;&#32780;&#29238;&#20146;&#30340;&#25910;&#20837;&#22312;&#23401;&#23376;&#21040;&#26469;&#20043;&#21069;&#23601;&#24050;&#32463;&#39640;&#20110;&#38750;&#29238;&#20146;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#27874;&#20848;&#26159;&#27431;&#27954;&#24615;&#21035;&#34218;&#37228;&#24046;&#36317;&#26368;&#23567;&#30340;&#22269;&#23478;&#20043;&#19968;&#12290;&#19982;&#27492;&#21516;&#26102;&#65292;&#23427;&#26159;&#19968;&#20010;&#20445;&#23432;&#30340;&#22269;&#23478;&#65292;&#22899;&#24615;&#30340;&#26435;&#21033;&#19968;&#30452;&#22312;&#19979;&#38477;&#12290;&#25105;&#20204;&#35748;&#20026;&#65292;&#22312;&#27874;&#20848;&#32972;&#26223;&#19979;&#65292;&#25910;&#20837;&#24046;&#36317;&#27604;&#23567;&#26102;&#24037;&#36164;&#24046;&#36317;&#26356;&#36866;&#21512;&#34913;&#37327;&#24615;&#21035;&#21171;&#21160;&#21147;&#24066;&#22330;&#32467;&#26524;&#12290;&#25105;&#20204;&#20351;&#29992;&#35843;&#25972;&#20026;&#20302;&#20998;&#36776;&#29575;&#30340;&#23433;&#24944;&#21058;&#20107;&#20214;&#21382;&#21490;&#26041;&#27861;&#21644;&#27874;&#20848;&#19990;&#20195;&#21644;&#24615;&#21035;&#35843;&#26597;&#30340;&#20004;&#20010;&#27874;&#27425;&#65288;2010&#24180;&#12289;2014&#24180;&#65289;&#20998;&#26512;&#20102;&#27874;&#20848;&#30340;&#25910;&#20837;&#24615;&#21035;&#24046;&#36317;&#19982;&#32946;&#20799;&#29366;&#24577;&#30340;&#20851;&#31995;&#12290;&#19982;&#22312;&#35199;&#27431;&#36827;&#34892;&#30340;&#31867;&#20284;&#30740;&#31350;&#30456;&#21453;&#65292;&#25105;&#20204;&#30340;&#20998;&#26512;&#25581;&#31034;&#20102;&#22899;&#24615;&#21644;&#30007;&#24615;&#26222;&#36941;&#23384;&#22312;&#30340;&#39044;&#26399;&#34892;&#20026;&#12290;&#25105;&#20204;&#23637;&#31034;&#65292;&#22312;&#29983;&#32946;&#21518;&#65292;&#27597;&#20146;&#30340;&#25910;&#20837;&#38477;&#20302;&#20102;&#32422;20&#65285;&#65292;&#20294;&#22312;15&#24180;&#21518;&#65292;&#19982;&#38750;&#27597;&#20146;&#30340;&#25910;&#20837;&#36712;&#36857;&#36235;&#20110;&#19968;&#33268;&#12290;&#30456;&#27604;&#20043;&#19979;&#65292;&#26410;&#26469;&#29238;&#20146;&#30340;&#25910;&#20837;&#39640;&#20110;&#38750;&#29238;&#20146;&#30340;&#25910;&#20837;&#65292;&#36825;&#34920;&#26126;&#29238;&#20146;&#28322;&#20215;&#22312;&#23401;&#23376;&#21040;&#26469;&#20043;&#21069;&#23601;&#23384;&#22312;&#12290;&#24635;&#30340;&#26469;&#35828;&#65292;&#25105;&#20204;&#30340;&#30740;&#31350;&#25581;&#31034;&#20102;&#19968;&#20010;&#20445;&#23432;&#30340;&#22269;&#23478;&#20013;&#24615;&#21035;&#21171;&#21160;&#21147;&#24066;&#22330;&#32467;&#26524;&#30340;&#22797;&#26434;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Poland records one of the lowest gender wage gaps in Europe. At the same time, it is a socially conservative country where women's rights have been on the decline. We argue that, in the Polish context, the gender gap in income is a more appropriate measure of gendered labour market outcomes than the gap in the hourly wage. We analyse the gender gap in income in Poland in relation to the parenthood status, using the placebo event history method, adjusted to low resolution data, and the two waves of the Polish Generations and Gender Survey (2010, 2014). Contrary to similar studies conducted in Western Europe, our analysis uncovers a large degree of anticipatory behaviour in both women and men who expect to become parents. We show that mothers' income decreases by about 20% after birth, but converges to the income trajectory of non-mothers after 15 years. In contrast, the income of eventual fathers is higher than that of non-fathers both before and after birth, suggesting that the fatherh
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;NM&#25928;&#29992;&#20989;&#25968;&#30340;&#23454;&#29992;&#20027;&#20041;&#23450;&#29702;&#21644;Alt&#25928;&#29992;&#20989;&#25968;&#30340;&#23454;&#29992;&#20027;&#20041;&#23450;&#29702;&#65292;&#21457;&#29616;&#20108;&#32773;&#21516;&#26102;&#25104;&#31435;&#26102;&#65292;NM&#25928;&#29992;&#20989;&#25968;&#19982;Alt&#25928;&#29992;&#20989;&#25968;&#37325;&#21512;&#65292;&#36825;&#19968;&#32467;&#26524;&#34920;&#26126;&#20854;&#20013;&#33267;&#23569;&#19968;&#20010;&#23454;&#29992;&#20027;&#20041;&#23450;&#29702;&#21253;&#21547;&#20102;&#19968;&#20010;&#24378;&#20551;&#35774;&#12290;</title><link>http://arxiv.org/abs/2304.09973</link><description>&lt;p&gt;
&#23454;&#29992;&#20027;&#20041;&#23450;&#29702;&#19982;&#25928;&#29992;&#29702;&#35770;&#30340;&#31561;&#20215;&#24615;
&lt;/p&gt;
&lt;p&gt;
Utilitarian Theorems and Equivalence of Utility Theories. (arXiv:2304.09973v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.09973
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;NM&#25928;&#29992;&#20989;&#25968;&#30340;&#23454;&#29992;&#20027;&#20041;&#23450;&#29702;&#21644;Alt&#25928;&#29992;&#20989;&#25968;&#30340;&#23454;&#29992;&#20027;&#20041;&#23450;&#29702;&#65292;&#21457;&#29616;&#20108;&#32773;&#21516;&#26102;&#25104;&#31435;&#26102;&#65292;NM&#25928;&#29992;&#20989;&#25968;&#19982;Alt&#25928;&#29992;&#20989;&#25968;&#37325;&#21512;&#65292;&#36825;&#19968;&#32467;&#26524;&#34920;&#26126;&#20854;&#20013;&#33267;&#23569;&#19968;&#20010;&#23454;&#29992;&#20027;&#20041;&#23450;&#29702;&#21253;&#21547;&#20102;&#19968;&#20010;&#24378;&#20551;&#35774;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#19968;&#20010;&#29615;&#22659;&#65292;&#22312;&#35813;&#29615;&#22659;&#19979;&#65292;Harsanyi&#25552;&#20986;&#30340;NM&#25928;&#29992;&#20989;&#25968;&#30340;&#23454;&#29992;&#20027;&#20041;&#23450;&#29702;&#19982;Harvey&#25552;&#20986;&#30340;Alt&#25928;&#29992;&#20989;&#25968;&#30340;&#23454;&#29992;&#20027;&#20041;&#23450;&#29702;&#21516;&#26102;&#25104;&#31435;&#65292;&#24182;&#35777;&#26126;&#20102;&#22312;&#36825;&#31181;&#24773;&#20917;&#19979;&#65292;NM&#25928;&#29992;&#20989;&#25968;&#19982;Alt&#25928;&#29992;&#20989;&#25968;&#37325;&#21512;&#12290;&#36825;&#19968;&#32467;&#26524;&#20855;&#26377;&#24726;&#35770;&#24615;&#65292;&#25105;&#20204;&#24517;&#39035;&#20551;&#23450;&#33267;&#23569;&#19968;&#20010;&#23454;&#29992;&#20027;&#20041;&#23450;&#29702;&#21253;&#21547;&#20102;&#19968;&#20010;&#24378;&#20551;&#35774;&#12290;&#25105;&#20204;&#36880;&#19968;&#26816;&#26597;&#21508;&#20010;&#20551;&#35774;&#65292;&#24182;&#24471;&#20986;&#32467;&#35770;&#65306;Harsanyi&#30340;&#20844;&#29702;&#20043;&#19968;&#26159;&#24378;&#20551;&#35774;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this paper, we consider an environment in which the utilitarian theorem for the NM utility function derived by Harsanyi and the utilitarian theorem for Alt's utility function derived by Harvey hold simultaneously, and prove that the NM utility function coincides with Alt's utility function under this setup. This result is so paradoxical that we must presume that at least one of the utilitarian theorems contains a strong assumption. We examine the assumptions one by one and conclude that one of Harsanyi's axioms is strong.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20379;&#20102;&#19968;&#20010;&#22522;&#26412;&#29702;&#35770;&#65292;&#30740;&#31350;&#20102;&#24102;&#26377;&#39640;&#38454;&#20449;&#24687;&#30340;&#26399;&#26435;&#24066;&#22330;&#20013;&#20215;&#26684;&#30340;&#21457;&#29616;&#26426;&#21046;&#12290;&#19982;&#27492;&#21516;&#26102;&#65292;&#35813;&#30740;&#31350;&#36824;&#20197;&#20869;&#24149;&#20132;&#26131;&#30340;&#24418;&#24335;&#21576;&#29616;&#20102;&#20854;&#20013;&#30340;&#29305;&#20363;&#65292;&#32473;&#20986;&#20102;&#36890;&#36135;&#33192;&#32960;&#38656;&#27714;&#12289;&#20215;&#26684;&#20914;&#20987;&#21644;&#20449;&#24687;&#25928;&#29575;&#30340;&#38381;&#24335;&#35299;&#12290;</title><link>http://arxiv.org/abs/2302.13426</link><description>&lt;p&gt;
&#26399;&#26435;&#30340;&#20215;&#26684;&#21457;&#29616;
&lt;/p&gt;
&lt;p&gt;
Price Discovery for Derivatives. (arXiv:2302.13426v5 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2302.13426
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20379;&#20102;&#19968;&#20010;&#22522;&#26412;&#29702;&#35770;&#65292;&#30740;&#31350;&#20102;&#24102;&#26377;&#39640;&#38454;&#20449;&#24687;&#30340;&#26399;&#26435;&#24066;&#22330;&#20013;&#20215;&#26684;&#30340;&#21457;&#29616;&#26426;&#21046;&#12290;&#19982;&#27492;&#21516;&#26102;&#65292;&#35813;&#30740;&#31350;&#36824;&#20197;&#20869;&#24149;&#20132;&#26131;&#30340;&#24418;&#24335;&#21576;&#29616;&#20102;&#20854;&#20013;&#30340;&#29305;&#20363;&#65292;&#32473;&#20986;&#20102;&#36890;&#36135;&#33192;&#32960;&#38656;&#27714;&#12289;&#20215;&#26684;&#20914;&#20987;&#21644;&#20449;&#24687;&#25928;&#29575;&#30340;&#38381;&#24335;&#35299;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36890;&#36807;&#19968;&#20010;&#27169;&#22411;&#65292;&#32771;&#34385;&#20102;&#31169;&#26377;&#20449;&#24687;&#21644;&#39640;&#38454;&#20449;&#24687;&#23545;&#26399;&#26435;&#24066;&#22330;&#20215;&#26684;&#30340;&#24433;&#21709;&#12290;&#27169;&#22411;&#20801;&#35768;&#26377;&#31169;&#26377;&#20449;&#24687;&#30340;&#20132;&#26131;&#32773;&#22312;&#29366;&#24577;-&#32034;&#36180;&#38598;&#24066;&#22330;&#19978;&#20132;&#26131;&#12290;&#31561;&#20215;&#30340;&#26399;&#26435;&#24418;&#24335;&#19979;&#65292;&#25105;&#20204;&#32771;&#34385;&#20102;&#25317;&#26377;&#20851;&#20110;&#22522;&#30784;&#36164;&#20135;&#25910;&#30410;&#30340;&#20998;&#24067;&#30340;&#31169;&#26377;&#20449;&#24687;&#65292;&#24182;&#20801;&#35768;&#20132;&#26131;&#20219;&#24847;&#26399;&#26435;&#32452;&#21512;&#30340;&#25805;&#32437;&#32773;&#12290;&#25105;&#20204;&#24471;&#20986;&#20102;&#36890;&#36135;&#33192;&#32960;&#38656;&#27714;&#12289;&#20215;&#26684;&#20914;&#20987;&#21644;&#20449;&#24687;&#25928;&#29575;&#30340;&#38381;&#24335;&#35299;&#65292;&#36825;&#20123;&#35299;&#25552;&#20379;&#20102;&#20851;&#20110;&#20869;&#24149;&#20132;&#26131;&#30340;&#39640;&#38454;&#20449;&#24687;&#65292;&#22914;&#20219;&#20309;&#32473;&#23450;&#30340;&#26102;&#21051;&#20132;&#26131;&#26399;&#26435;&#31574;&#30053;&#65292;&#24182;&#23558;&#36825;&#20123;&#31574;&#30053;&#27867;&#21270;&#21040;&#20102;&#27874;&#21160;&#29575;&#20132;&#26131;&#31561;&#23454;&#36341;&#39046;&#22495;&#12290;
&lt;/p&gt;
&lt;p&gt;
We obtain a basic theory of price discovery across derivative markets with respect to higher-order information, using a model where an agent with general private information regarding state probabilities is allowed to trade arbitrary portfolios of state-contingent claims. In an equivalent options formulation, the informed agent has private information regarding arbitrary aspects of the payoff distribution of an underlying asset and is allowed to trade arbitrary option portfolios. We characterize, in closed form, the informed demand, price impact, and information efficiency of prices. Our results offer a theory of insider trading on higher moments of the underlying payoff as a special case. The informed demand formula prescribes option strategies for trading on any given moment and extends those used in practice for, e.g. volatility trading.
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#28608;&#21169;&#20302;&#30899;&#33021;&#28304;&#25237;&#36164;&#30340;&#24066;&#22330;&#26426;&#21046;&#65292;&#24182;&#20445;&#25252;&#28040;&#36153;&#32773;&#20813;&#21463;&#20379;&#24212;&#30701;&#32570;&#36896;&#25104;&#30340;&#39640;&#20215;&#24433;&#21709;&#12290;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#24066;&#22330;&#26426;&#21046;&#65288;PIU&#65289;&#65292;&#36890;&#36807;&#32602;&#27454;&#25903;&#20184;&#12289;&#20379;&#24212;&#28608;&#21169;&#21644;&#33021;&#28304;&#20215;&#26684;&#25260;&#21319;&#26469;&#20943;&#23569;&#20379;&#24212;&#30701;&#32570;&#20215;&#26684;&#30340;&#24433;&#21709;&#12290;&#36890;&#36807;&#24314;&#31435;&#21338;&#24328;&#35770;&#26694;&#26550;&#65292;&#35777;&#26126;&#20102;&#22312;&#32602;&#27454;&#25903;&#20184;&#21644;&#20379;&#24212;&#28608;&#21169;&#30340;&#24773;&#20917;&#19979;&#23384;&#22312;&#19968;&#20010;&#32435;&#20160;&#22343;&#34913;&#28857;&#21487;&#20197;&#36798;&#21040;&#31038;&#20250;&#26368;&#20248;&#65292;&#20551;&#35774;&#20256;&#32479;&#33021;&#28304;&#36164;&#28304;&#30340;&#20379;&#24212;&#25104;&#26412;&#20026;&#20108;&#27425;&#20989;&#25968;&#12290;&#34429;&#28982;&#33021;&#28304;&#20215;&#26684;&#25260;&#21319;&#21487;&#20197;&#30830;&#20445;&#36275;&#22815;&#30340;&#25910;&#20837;&#65292;&#20294;&#25152;&#24471;&#30340;&#31995;&#32479;&#25104;&#26412;&#20559;&#31163;&#20102;&#31038;&#20250;&#26368;&#20248;&#65292;&#36825;&#20010;&#24046;&#36317;&#38543;&#30528;&#26356;&#22810;&#20256;&#32479;&#33021;&#28304;&#36164;&#28304;&#30340;&#36864;&#24441;&#32780;&#20943;&#23569;&#12290;</title><link>http://arxiv.org/abs/2212.06984</link><description>&lt;p&gt;
&#20302;&#30899;&#30005;&#21147;&#25237;&#36164;&#30340;&#24066;&#22330;&#26426;&#21046;&#65306;&#21338;&#24328;&#35770;&#20998;&#26512;
&lt;/p&gt;
&lt;p&gt;
Market Mechanisms for Low-Carbon Electricity Investments: A Game-Theoretical Analysis. (arXiv:2212.06984v2 [eess.SY] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2212.06984
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#28608;&#21169;&#20302;&#30899;&#33021;&#28304;&#25237;&#36164;&#30340;&#24066;&#22330;&#26426;&#21046;&#65292;&#24182;&#20445;&#25252;&#28040;&#36153;&#32773;&#20813;&#21463;&#20379;&#24212;&#30701;&#32570;&#36896;&#25104;&#30340;&#39640;&#20215;&#24433;&#21709;&#12290;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#24066;&#22330;&#26426;&#21046;&#65288;PIU&#65289;&#65292;&#36890;&#36807;&#32602;&#27454;&#25903;&#20184;&#12289;&#20379;&#24212;&#28608;&#21169;&#21644;&#33021;&#28304;&#20215;&#26684;&#25260;&#21319;&#26469;&#20943;&#23569;&#20379;&#24212;&#30701;&#32570;&#20215;&#26684;&#30340;&#24433;&#21709;&#12290;&#36890;&#36807;&#24314;&#31435;&#21338;&#24328;&#35770;&#26694;&#26550;&#65292;&#35777;&#26126;&#20102;&#22312;&#32602;&#27454;&#25903;&#20184;&#21644;&#20379;&#24212;&#28608;&#21169;&#30340;&#24773;&#20917;&#19979;&#23384;&#22312;&#19968;&#20010;&#32435;&#20160;&#22343;&#34913;&#28857;&#21487;&#20197;&#36798;&#21040;&#31038;&#20250;&#26368;&#20248;&#65292;&#20551;&#35774;&#20256;&#32479;&#33021;&#28304;&#36164;&#28304;&#30340;&#20379;&#24212;&#25104;&#26412;&#20026;&#20108;&#27425;&#20989;&#25968;&#12290;&#34429;&#28982;&#33021;&#28304;&#20215;&#26684;&#25260;&#21319;&#21487;&#20197;&#30830;&#20445;&#36275;&#22815;&#30340;&#25910;&#20837;&#65292;&#20294;&#25152;&#24471;&#30340;&#31995;&#32479;&#25104;&#26412;&#20559;&#31163;&#20102;&#31038;&#20250;&#26368;&#20248;&#65292;&#36825;&#20010;&#24046;&#36317;&#38543;&#30528;&#26356;&#22810;&#20256;&#32479;&#33021;&#28304;&#36164;&#28304;&#30340;&#36864;&#24441;&#32780;&#20943;&#23569;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#30005;&#21147;&#24066;&#22330;&#27491;&#20174;&#20256;&#32479;&#33021;&#28304;&#36164;&#28304;&#65288;&#22914;&#21270;&#30707;&#29123;&#26009;&#65289;&#30340;&#20027;&#23548;&#22320;&#20301;&#36716;&#21521;&#20302;&#30899;&#33021;&#28304;&#36164;&#28304;&#65288;&#22914;&#21487;&#20877;&#29983;&#33021;&#28304;&#21644;&#20648;&#33021;&#65289;&#12290;&#26412;&#30740;&#31350;&#30740;&#31350;&#20102;&#28608;&#21169;&#20302;&#30899;&#33021;&#28304;&#25237;&#36164;&#30340;&#24066;&#22330;&#26426;&#21046;&#65292;&#21516;&#26102;&#30830;&#20445;&#25237;&#36164;&#32773;&#33719;&#24471;&#36275;&#22815;&#30340;&#24066;&#22330;&#25910;&#20837;&#65292;&#24341;&#23548;&#25237;&#36164;&#32773;&#30340;&#25112;&#30053;&#25237;&#36164;&#36798;&#21040;&#31038;&#20250;&#26368;&#20248;&#65292;&#24182;&#20445;&#25252;&#28040;&#36153;&#32773;&#20813;&#21463;&#20379;&#24212;&#30701;&#32570;&#36896;&#25104;&#30340;&#39640;&#20215;&#24433;&#21709;&#12290;&#20026;&#20102;&#20943;&#23569;&#20379;&#24212;&#30701;&#32570;&#20215;&#26684;&#30340;&#24433;&#21709;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#24066;&#22330;&#26426;&#21046;&#65292;&#21253;&#25324;&#22833;&#25481;&#36127;&#33655;&#30340;&#32602;&#27454;&#25903;&#20184;&#12289;&#20379;&#24212;&#28608;&#21169;&#21644;&#33021;&#28304;&#20215;&#26684;&#25260;&#21319;&#65288;PIU&#65289;&#12290;&#25105;&#20204;&#24314;&#31435;&#20102;&#19968;&#20010;&#21338;&#24328;&#35770;&#26694;&#26550;&#26469;&#20998;&#26512;&#24066;&#22330;&#22343;&#34913;&#12290;&#25105;&#20204;&#35777;&#26126;&#65292;&#22312;&#32602;&#27454;&#25903;&#20184;&#21644;&#20379;&#24212;&#28608;&#21169;&#30340;&#24773;&#20917;&#19979;&#65292;&#23384;&#22312;&#19968;&#20010;&#32435;&#20160;&#22343;&#34913;&#28857;&#21487;&#20197;&#36798;&#21040;&#31038;&#20250;&#26368;&#20248;&#65292;&#20551;&#35774;&#20256;&#32479;&#33021;&#28304;&#36164;&#28304;&#30340;&#20379;&#24212;&#25104;&#26412;&#20026;&#20108;&#27425;&#20989;&#25968;&#12290;&#34429;&#28982;&#33021;&#28304;&#20215;&#26684;&#25260;&#21319;&#21487;&#20197;&#30830;&#20445;&#36275;&#22815;&#30340;&#25910;&#20837;&#65292;&#20294;&#25152;&#24471;&#30340;&#31995;&#32479;&#25104;&#26412;&#20559;&#31163;&#20102;&#31038;&#20250;&#26368;&#20248;&#65292;&#36825;&#20010;&#24046;&#36317;&#38543;&#30528;&#26356;&#22810;&#20256;&#32479;&#33021;&#28304;&#36164;&#28304;&#30340;&#36864;&#24441;&#32780;&#20943;&#23569;&#12290;
&lt;/p&gt;
&lt;p&gt;
Electricity markets are transforming from the dominance of conventional energy resources (CERs), e.g., fossil fuels, to low-carbon energy resources (LERs), e.g., renewables and energy storage. This work examines market mechanisms to incentivize LER investments, while ensuring adequate market revenues for investors, guiding investors' strategic investments towards social optimum, and protecting consumers from scarcity prices. To reduce the impact of excessive scarcity prices, we present a new market mechanism, which consists of a Penalty payment for lost load, a supply Incentive, and an energy price Uplift (PIU). We establish a game-theoretical framework to analyze market equilibrium. We prove that one Nash equilibrium under the penalty payment and supply incentive can reach the social optimum given quadratic supply costs of CERs. Although the price uplift can ensure adequate revenues, the resulting system cost deviates from the social optimum while the gap decreases as more CERs retire
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#36152;&#26131;&#32593;&#32476;&#30340;&#24418;&#25104;&#65292;&#22312;&#20010;&#20307;&#20915;&#31574;&#30340;&#22522;&#30784;&#19978;&#24314;&#31435;&#20102;&#19968;&#20010;&#26032;&#30340;&#27169;&#22411;&#65292;&#32771;&#34385;&#20102;&#27604;&#36739;&#20248;&#21183;&#12289;&#32463;&#27982;&#35268;&#27169;&#25928;&#24212;&#12289;&#20010;&#20307;&#24322;&#36136;&#24615;&#21644;&#36816;&#36755;&#25104;&#26412;&#31561;&#22240;&#32032;&#12290;&#36890;&#36807;&#25968;&#20540;&#27169;&#25311;&#21644;&#32479;&#35745;&#21147;&#23398;&#26041;&#27861;&#65292;&#25105;&#20204;&#25581;&#31034;&#20102;&#19977;&#31181;&#19981;&#21516;&#30340;&#36152;&#26131;&#32593;&#32476;&#32467;&#26500;&#12290;</title><link>http://arxiv.org/abs/2212.02841</link><description>&lt;p&gt;
&#35268;&#27169;&#32463;&#27982;&#21644;&#20135;&#21697;&#24046;&#24322;&#21270;&#24418;&#25104;&#30340;&#36152;&#26131;&#32593;&#32476;&#30340;&#26500;&#24314;
&lt;/p&gt;
&lt;p&gt;
Formation of trade networks by economies of scale and product differentiation. (arXiv:2212.02841v2 [physics.soc-ph] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2212.02841
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#36152;&#26131;&#32593;&#32476;&#30340;&#24418;&#25104;&#65292;&#22312;&#20010;&#20307;&#20915;&#31574;&#30340;&#22522;&#30784;&#19978;&#24314;&#31435;&#20102;&#19968;&#20010;&#26032;&#30340;&#27169;&#22411;&#65292;&#32771;&#34385;&#20102;&#27604;&#36739;&#20248;&#21183;&#12289;&#32463;&#27982;&#35268;&#27169;&#25928;&#24212;&#12289;&#20010;&#20307;&#24322;&#36136;&#24615;&#21644;&#36816;&#36755;&#25104;&#26412;&#31561;&#22240;&#32032;&#12290;&#36890;&#36807;&#25968;&#20540;&#27169;&#25311;&#21644;&#32479;&#35745;&#21147;&#23398;&#26041;&#27861;&#65292;&#25105;&#20204;&#25581;&#31034;&#20102;&#19977;&#31181;&#19981;&#21516;&#30340;&#36152;&#26131;&#32593;&#32476;&#32467;&#26500;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#29702;&#35299;&#32593;&#32476;&#30340;&#32467;&#26500;&#21644;&#24418;&#25104;&#26159;&#22797;&#26434;&#24615;&#31185;&#23398;&#30340;&#19968;&#20010;&#26680;&#24515;&#20027;&#39064;&#12290;&#32463;&#27982;&#32593;&#32476;&#26159;&#36890;&#36807;&#20010;&#20307;&#20915;&#31574;&#24418;&#25104;&#30340;&#65292;&#22240;&#27492;&#19981;&#33021;&#29992;&#20256;&#32479;&#30340;&#38543;&#26426;&#22270;&#27169;&#22411;&#26469;&#20934;&#30830;&#25551;&#36848;&#12290;&#26412;&#25991;&#24314;&#31435;&#20102;&#19968;&#20010;&#22522;&#20110;&#20010;&#20307;&#20915;&#31574;&#30340;&#36152;&#26131;&#32593;&#32476;&#24418;&#25104;&#27169;&#22411;&#12290;&#35813;&#27169;&#22411;&#21253;&#25324;&#36152;&#26131;&#24418;&#25104;&#30340;&#20851;&#38190;&#22240;&#32032;&#65306;&#27604;&#36739;&#20248;&#21183;&#21644;&#32463;&#27982;&#35268;&#27169;&#25928;&#24212;&#65292;&#21516;&#26102;&#36824;&#32771;&#34385;&#20102;&#20010;&#20307;&#30340;&#24322;&#36136;&#24615;&#21644;&#36816;&#36755;&#25110;&#20132;&#26131;&#25104;&#26412;&#12290;&#25968;&#20540;&#27169;&#25311;&#26174;&#31034;&#20986;&#24418;&#25104;&#30340;&#36152;&#26131;&#32593;&#32476;&#26377;&#19977;&#31181;&#23439;&#35266;&#19981;&#21516;&#30340;&#21046;&#24230;&#12290;&#26681;&#25454;&#20855;&#20307;&#30340;&#36816;&#36755;&#25104;&#26412;&#21644;&#20010;&#20307;&#20559;&#22909;&#30340;&#24322;&#36136;&#24615;&#65292;&#25105;&#20204;&#21457;&#29616;&#20013;&#22830;&#38598;&#20013;&#29983;&#20135;&#19982;&#26143;&#22411;&#36152;&#26131;&#32593;&#32476;&#12289;&#20998;&#25955;&#29983;&#20135;&#19982;&#20840;&#29699;&#36152;&#26131;&#12289;&#23616;&#37096;&#29983;&#20135;&#19982;&#26080;&#36152;&#26131;&#20043;&#38388;&#30340;&#36716;&#21464;&#12290;&#21033;&#29992;&#32479;&#35745;&#21147;&#23398;&#30340;&#26041;&#27861;&#65292;&#25105;&#20204;&#25552;&#20379;&#20102;&#20851;&#20110;&#36825;&#20123;&#36716;&#21464;&#30340;&#35299;&#26512;&#29702;&#35770;&#12290;
&lt;/p&gt;
&lt;p&gt;
Understanding the structure and formation of networks is a central topic in complexity science. Economic networks are formed by decisions of individual agents and thus not properly described by established random graph models. In this article, we establish a model for the emergence of trade networks that is based on rational decisions of individual agents. The model incorporates key drivers for the emergence of trade, comparative advantage and economic scale effects, but also the heterogeneity of agents and the transportation or transaction costs. Numerical simulations show three macroscopically different regimes of the emerging trade networks. Depending on the specific transportation costs and the heterogeneity of individual preferences, we find centralized production with a star-like trade network, distributed production with all-to-all trading or local production and no trade. Using methods from statistical mechanics, we provide an analytic theory of the transitions between these re
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#36125;&#21494;&#26031;&#24863;&#30693;&#27169;&#22411;&#22312;&#36830;&#36890;&#32593;&#32476;&#19978;&#30340;&#37325;&#22797;&#27807;&#36890;&#20013;&#30340;&#28176;&#36817;&#34892;&#20026;&#65292;&#21457;&#29616;&#23613;&#31649;&#20010;&#20307;&#20195;&#29702;&#20154;&#19981;&#26159;&#32463;&#20856;&#24847;&#20041;&#19978;&#30340;&#25928;&#29992;&#26368;&#22823;&#21270;&#32773;&#65292;&#26368;&#32456;&#20182;&#20204;&#20250;&#36798;&#25104;&#19968;&#33268;&#65292;&#24182;&#19988;&#26497;&#38480;&#21518;&#39564;&#20998;&#24067;&#26159;&#36125;&#21494;&#26031;&#26368;&#20248;&#30340;&#12290;</title><link>http://arxiv.org/abs/2205.11561</link><description>&lt;p&gt;
Bayesian&#24863;&#30693;&#27169;&#22411;&#20013;&#30340;&#19968;&#33268;&#24615;&#21644;&#32479;&#35745;&#25928;&#29575;
&lt;/p&gt;
&lt;p&gt;
Agreement and Statistical Efficiency in Bayesian Perception Models. (arXiv:2205.11561v2 [math.ST] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2205.11561
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#36125;&#21494;&#26031;&#24863;&#30693;&#27169;&#22411;&#22312;&#36830;&#36890;&#32593;&#32476;&#19978;&#30340;&#37325;&#22797;&#27807;&#36890;&#20013;&#30340;&#28176;&#36817;&#34892;&#20026;&#65292;&#21457;&#29616;&#23613;&#31649;&#20010;&#20307;&#20195;&#29702;&#20154;&#19981;&#26159;&#32463;&#20856;&#24847;&#20041;&#19978;&#30340;&#25928;&#29992;&#26368;&#22823;&#21270;&#32773;&#65292;&#26368;&#32456;&#20182;&#20204;&#20250;&#36798;&#25104;&#19968;&#33268;&#65292;&#24182;&#19988;&#26497;&#38480;&#21518;&#39564;&#20998;&#24067;&#26159;&#36125;&#21494;&#26031;&#26368;&#20248;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#33258;1970&#24180;&#20195;&#20197;&#26469;&#65292;&#32463;&#27982;&#23398;&#39046;&#22495;&#19968;&#30452;&#30740;&#31350;&#36125;&#21494;&#26031;&#32676;&#20307;&#23398;&#20064;&#27169;&#22411;&#65292;&#26368;&#36817;&#22312;&#35745;&#31639;&#35821;&#35328;&#23398;&#26041;&#38754;&#20063;&#36827;&#34892;&#20102;&#30740;&#31350;&#12290;&#32463;&#27982;&#23398;&#27169;&#22411;&#20551;&#35774;&#20195;&#29702;&#20154;&#22312;&#27807;&#36890;&#21644;&#34892;&#21160;&#20013;&#26368;&#22823;&#21270;&#25928;&#29992;&#12290;&#28982;&#32780;&#65292;&#36825;&#20123;&#32463;&#27982;&#23398;&#27169;&#22411;&#26080;&#27861;&#35299;&#37322;&#22312;&#35768;&#22810;&#23454;&#39564;&#30740;&#31350;&#20013;&#35266;&#23519;&#21040;&#30340; "&#27010;&#29575;&#21305;&#37197;" &#29616;&#35937;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20123;&#35266;&#23519;&#32467;&#26524;&#65292;&#24341;&#20837;&#20102;&#19968;&#20123;&#19981;&#23436;&#20840;&#31526;&#21512;&#32463;&#27982;&#23398;&#25928;&#29992;&#26368;&#22823;&#21270;&#26694;&#26550;&#30340;&#36125;&#21494;&#26031;&#27169;&#22411;&#12290;&#22312;&#36825;&#20123;&#27169;&#22411;&#20013;&#65292;&#20010;&#20307;&#22312;&#27807;&#36890;&#20013;&#20174;&#20854;&#21518;&#39564;&#20998;&#24067;&#20013;&#36827;&#34892;&#25277;&#26679;&#12290;&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;&#36825;&#31181;&#27169;&#22411;&#22312;&#36830;&#36890;&#32593;&#32476;&#19978;&#36827;&#34892;&#37325;&#22797;&#27807;&#36890;&#26102;&#30340;&#28176;&#36817;&#34892;&#20026;&#12290;&#20196;&#20154;&#24778;&#35766;&#30340;&#26159;&#65292;&#23613;&#31649;&#20010;&#20307;&#20195;&#29702;&#20154;&#22312;&#32463;&#20856;&#24847;&#20041;&#19978;&#24182;&#19981;&#26159;&#25928;&#29992;&#26368;&#22823;&#21270;&#32773;&#65292;&#20294;&#25105;&#20204;&#35777;&#26126;&#20182;&#20204;&#26368;&#32456;&#20250;&#36798;&#25104;&#19968;&#33268;&#65292;&#24182;&#19988;&#36827;&#19968;&#27493;&#35777;&#26126;&#26497;&#38480;&#21518;&#39564;&#20998;&#24067;&#26159;&#36125;&#21494;&#26031;&#26368;&#20248;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
Bayesian models of group learning are studied in Economics since the 1970s and more recently in computational linguistics. The models from Economics postulate that agents maximize utility in their communication and actions. The Economics models do not explain the ``probability matching" phenomena that are observed in many experimental studies. To address these observations, Bayesian models that do not formally fit into the economic utility maximization framework were introduced. In these models individuals sample from their posteriors in communication. In this work we study the asymptotic behavior of such models on connected networks with repeated communication. Perhaps surprisingly, despite the fact that individual agents are not utility maximizers in the classical sense, we establish that the individuals ultimately agree and furthermore show that the limiting posterior is Bayes optimal.
&lt;/p&gt;</description></item></channel></rss>