<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#35813;&#30740;&#31350;&#35843;&#26597;&#20102;GPT&#65288;&#22823;&#35821;&#35328;&#27169;&#22411;&#65289;&#21644;&#30456;&#20851;&#25216;&#26415;&#23545;&#32654;&#22269;&#21171;&#21160;&#21147;&#24066;&#22330;&#30340;&#28508;&#22312;&#24433;&#21709;&#65292;&#21457;&#29616;&#22823;&#32422;80%&#30340;&#32654;&#22269;&#21171;&#21160;&#21147;&#21487;&#33021;&#20250;&#21463;&#21040;10%&#30340;&#24037;&#20316;&#20219;&#21153;&#30340;&#24433;&#21709;&#65292;&#28085;&#30422;&#20102;&#25152;&#26377;&#24037;&#36164;&#27700;&#24179;&#21644;&#21508;&#34892;&#21508;&#19994;&#65292;&#39044;&#31034;&#30528;&#36825;&#20123;&#27169;&#22411;&#21487;&#33021;&#20855;&#26377;&#26174;&#33879;&#30340;&#32463;&#27982;&#12289;&#31038;&#20250;&#21644;&#25919;&#31574;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2303.10130</link><description>&lt;p&gt;
GPT&#26159;GPT&#65306;&#22823;&#35821;&#35328;&#27169;&#22411;&#23545;&#21171;&#21160;&#21147;&#24066;&#22330;&#24433;&#21709;&#30340;&#26089;&#26399;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
GPTs are GPTs: An Early Look at the Labor Market Impact Potential of Large Language Models. (arXiv:2303.10130v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.10130
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#35843;&#26597;&#20102;GPT&#65288;&#22823;&#35821;&#35328;&#27169;&#22411;&#65289;&#21644;&#30456;&#20851;&#25216;&#26415;&#23545;&#32654;&#22269;&#21171;&#21160;&#21147;&#24066;&#22330;&#30340;&#28508;&#22312;&#24433;&#21709;&#65292;&#21457;&#29616;&#22823;&#32422;80%&#30340;&#32654;&#22269;&#21171;&#21160;&#21147;&#21487;&#33021;&#20250;&#21463;&#21040;10%&#30340;&#24037;&#20316;&#20219;&#21153;&#30340;&#24433;&#21709;&#65292;&#28085;&#30422;&#20102;&#25152;&#26377;&#24037;&#36164;&#27700;&#24179;&#21644;&#21508;&#34892;&#21508;&#19994;&#65292;&#39044;&#31034;&#30528;&#36825;&#20123;&#27169;&#22411;&#21487;&#33021;&#20855;&#26377;&#26174;&#33879;&#30340;&#32463;&#27982;&#12289;&#31038;&#20250;&#21644;&#25919;&#31574;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#29983;&#25104;&#39044;&#35757;&#32451;&#21464;&#21387;&#22120;&#65288;GPT&#65289;&#27169;&#22411;&#21644;&#30456;&#20851;&#25216;&#26415;&#23545;&#32654;&#22269;&#21171;&#21160;&#21147;&#24066;&#22330;&#30340;&#28508;&#22312;&#24433;&#21709;&#12290;&#20351;&#29992;&#26032;&#30340;&#26631;&#20934;&#65292;&#25105;&#20204;&#35780;&#20272;&#32844;&#19994;&#19982;GPT&#33021;&#21147;&#30340;&#23545;&#24212;&#20851;&#31995;&#65292;&#32467;&#21512;&#20154;&#31867;&#19987;&#19994;&#30693;&#35782;&#21644;GPT-4&#30340;&#20998;&#31867;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;&#32422;80%&#30340;&#32654;&#22269;&#21171;&#21160;&#21147;&#21487;&#33021;&#20250;&#33267;&#23569;&#26377;10%&#30340;&#24037;&#20316;&#20219;&#21153;&#21463;&#21040;GPT&#24341;&#20837;&#30340;&#24433;&#21709;&#65292;&#32780;&#32422;19%&#30340;&#24037;&#20154;&#21487;&#33021;&#20250;&#30475;&#21040;&#33267;&#23569;50%&#30340;&#20219;&#21153;&#21463;&#21040;&#24433;&#21709;&#12290;&#24433;&#21709;&#33539;&#22260;&#28085;&#30422;&#20102;&#25152;&#26377;&#24037;&#36164;&#27700;&#24179;&#65292;&#39640;&#25910;&#20837;&#24037;&#20316;&#21487;&#33021;&#38754;&#20020;&#26356;&#22823;&#30340;&#39118;&#38505;&#12290;&#20540;&#24471;&#27880;&#24847;&#30340;&#26159;&#65292;&#24433;&#21709;&#24182;&#19981;&#23616;&#38480;&#20110;&#26368;&#36817;&#29983;&#20135;&#29575;&#22686;&#38271;&#36739;&#39640;&#30340;&#34892;&#19994;&#12290;&#25105;&#20204;&#24471;&#20986;&#32467;&#35770;&#65292;&#29983;&#25104;&#39044;&#35757;&#32451;&#21464;&#21387;&#22120;&#20855;&#26377;&#36890;&#29992;&#25216;&#26415;&#65288;GPT&#65289;&#30340;&#29305;&#24615;&#65292;&#34920;&#26126;&#36825;&#20123;&#27169;&#22411;&#21487;&#33021;&#20855;&#26377;&#26174;&#33879;&#30340;&#32463;&#27982;&#12289;&#31038;&#20250;&#21644;&#25919;&#31574;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
We investigate the potential implications of Generative Pre-trained Transformer (GPT) models and related technologies on the U.S. labor market. Using a new rubric, we assess occupations based on their correspondence with GPT capabilities, incorporating both human expertise and classifications from GPT-4. Our findings indicate that approximately 80% of the U.S. workforce could have at least 10% of their work tasks affected by the introduction of GPTs, while around 19% of workers may see at least 50% of their tasks impacted. The influence spans all wage levels, with higher-income jobs potentially facing greater exposure. Notably, the impact is not limited to industries with higher recent productivity growth. We conclude that Generative Pre-trained Transformers exhibit characteristics of general-purpose technologies (GPTs), suggesting that as these models could have notable economic, social, and policy implications.
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#38024;&#23545;&#22823;&#35268;&#27169;&#26102;&#38388;&#24207;&#21015;&#30340;&#26102;&#21464;&#32593;&#32476;&#21521;&#37327;&#33258;&#22238;&#24402;&#27169;&#22411;&#30340;&#32479;&#35745;&#25512;&#26029;&#26041;&#27861;&#65292;&#36890;&#36807;&#24341;&#20837;&#28508;&#22312;&#30340;&#32676;&#32452;&#32467;&#26500;&#26469;&#20943;&#23569;&#26410;&#30693;&#31995;&#25968;&#25968;&#37327;&#24182;&#25552;&#20986;&#20102;&#32676;&#32452;&#21518;&#23616;&#37096;&#32447;&#24615;&#24179;&#28369;&#26041;&#27861;&#26469;&#25552;&#39640;&#21021;&#27493;&#20272;&#35745;&#30340;&#25910;&#25947;&#36895;&#24230;&#65292;&#24182;&#36827;&#34892;&#20102;&#30456;&#24212;&#30340;&#21442;&#25968;&#27169;&#22411;&#26816;&#39564;&#12290;</title><link>http://arxiv.org/abs/2303.10117</link><description>&lt;p&gt;
&#20998;&#32452;&#26102;&#21464;&#32593;&#32476;&#21521;&#37327;&#33258;&#22238;&#24402;&#27169;&#22411;&#30340;&#25512;&#26029;
&lt;/p&gt;
&lt;p&gt;
Inference of Grouped Time-Varying Network Vector Autoregression Models. (arXiv:2303.10117v1 [stat.ME])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.10117
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#38024;&#23545;&#22823;&#35268;&#27169;&#26102;&#38388;&#24207;&#21015;&#30340;&#26102;&#21464;&#32593;&#32476;&#21521;&#37327;&#33258;&#22238;&#24402;&#27169;&#22411;&#30340;&#32479;&#35745;&#25512;&#26029;&#26041;&#27861;&#65292;&#36890;&#36807;&#24341;&#20837;&#28508;&#22312;&#30340;&#32676;&#32452;&#32467;&#26500;&#26469;&#20943;&#23569;&#26410;&#30693;&#31995;&#25968;&#25968;&#37327;&#24182;&#25552;&#20986;&#20102;&#32676;&#32452;&#21518;&#23616;&#37096;&#32447;&#24615;&#24179;&#28369;&#26041;&#27861;&#26469;&#25552;&#39640;&#21021;&#27493;&#20272;&#35745;&#30340;&#25910;&#25947;&#36895;&#24230;&#65292;&#24182;&#36827;&#34892;&#20102;&#30456;&#24212;&#30340;&#21442;&#25968;&#27169;&#22411;&#26816;&#39564;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#32771;&#34385;&#38024;&#23545;&#22823;&#35268;&#27169;&#26102;&#38388;&#24207;&#21015;&#30340;&#26102;&#21464;&#32593;&#32476;&#21521;&#37327;&#33258;&#22238;&#24402;&#27169;&#22411;&#30340;&#32479;&#35745;&#25512;&#26029;&#12290;&#22312;&#24322;&#26500;&#21644;&#33410;&#28857;&#29305;&#23450;&#30340;&#26102;&#21464;&#21160;&#37327;&#21644;&#32593;&#32476;&#28322;&#20986;&#25928;&#24212;&#20013;&#65292;&#24378;&#21152;&#19968;&#20010;&#28508;&#22312;&#30340;&#32676;&#32452;&#32467;&#26500;&#65292;&#20197;&#20415;&#21487;&#20197;&#22823;&#22823;&#20943;&#23569;&#38656;&#35201;&#20272;&#35745;&#30340;&#26410;&#30693;&#26102;&#21464;&#31995;&#25968;&#30340;&#25968;&#37327;&#12290;&#32463;&#36807;&#24402;&#19968;&#21270;&#36317;&#31163;&#30697;&#38453;&#30340;&#32463;&#20856;&#32858;&#31867;&#31639;&#27861;&#32467;&#21512;&#24191;&#20041;&#20449;&#24687;&#20934;&#21017;&#65292;&#26469;&#19968;&#33268;&#22320;&#20272;&#35745;&#28508;&#22312;&#30340;&#32676;&#32452;&#25968;&#37327;&#21644;&#32676;&#32452;&#25104;&#21592;&#12290;&#25552;&#20986;&#20102;&#19968;&#31181;&#32676;&#32452;&#21518;&#23616;&#37096;&#32447;&#24615;&#24179;&#28369;&#26041;&#27861;&#65292;&#29992;&#20110;&#20272;&#35745;&#32676;&#32452;&#29305;&#23450;&#30340;&#26102;&#21464;&#21160;&#37327;&#21644;&#32593;&#32476;&#25928;&#24212;&#65292;&#20174;&#32780;&#22823;&#22823;&#25552;&#39640;&#20102;&#24573;&#30053;&#28508;&#22312;&#32467;&#26500;&#30340;&#21021;&#27493;&#20272;&#35745;&#30340;&#25910;&#25947;&#36895;&#24230;&#12290;&#27492;&#22806;&#65292;&#36824;&#36827;&#34892;&#20102;&#32676;&#32452;&#21518;&#30340;&#35268;&#26684;&#21270;&#26816;&#39564;&#65292;&#20197;&#39564;&#35777;&#32676;&#32452;&#29305;&#23450;&#30340;&#26102;&#21464;&#31995;&#25968;&#20989;&#25968;&#30340;&#21442;&#25968;&#27169;&#22411;&#20551;&#35774;&#30340;&#26377;&#25928;&#24615;&#65292;&#24182;&#32473;&#20986;&#20102;&#28176;&#36827;&#29702;&#35770;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper considers statistical inference of time-varying network vector autoregression models for large-scale time series. A latent group structure is imposed on the heterogeneous and node-specific time-varying momentum and network spillover effects so that the number of unknown time-varying coefficients to be estimated can be reduced considerably. A classic agglomerative clustering algorithm with normalized distance matrix estimates is combined with a generalized information criterion to consistently estimate the latent group number and membership. A post-grouping local linear smoothing method is proposed to estimate the group-specific time-varying momentum and network effects, substantially improving the convergence rates of the preliminary estimates which ignore the latent structure. In addition, a post-grouping specification test is conducted to verify the validity of the parametric model assumption for group-specific time-varying coefficient functions, and the asymptotic theory 
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#19968;&#31181;&#26032;&#30340;&#22810;&#20803;&#27010;&#29575;CRPS&#23398;&#20064;&#26041;&#27861;&#65292;&#24212;&#29992;&#20110;&#26085;&#21069;&#30005;&#20215;&#39044;&#27979;&#20013;&#65292;&#30456;&#27604;&#20110;&#32479;&#19968;&#32452;&#21512;&#22312;CRPS&#26041;&#38754;&#21462;&#24471;&#20102;&#26174;&#33879;&#25913;&#36827;&#12290;</title><link>http://arxiv.org/abs/2303.10019</link><description>&lt;p&gt;
&#22810;&#20803;&#27010;&#29575;CRPS&#23398;&#20064;&#21450;&#20854;&#22312;&#26085;&#21069;&#30005;&#20215;&#39044;&#27979;&#20013;&#30340;&#24212;&#29992;
&lt;/p&gt;
&lt;p&gt;
Multivariate Probabilistic CRPS Learning with an Application to Day-Ahead Electricity Prices. (arXiv:2303.10019v1 [stat.ML])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.10019
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#19968;&#31181;&#26032;&#30340;&#22810;&#20803;&#27010;&#29575;CRPS&#23398;&#20064;&#26041;&#27861;&#65292;&#24212;&#29992;&#20110;&#26085;&#21069;&#30005;&#20215;&#39044;&#27979;&#20013;&#65292;&#30456;&#27604;&#20110;&#32479;&#19968;&#32452;&#21512;&#22312;CRPS&#26041;&#38754;&#21462;&#24471;&#20102;&#26174;&#33879;&#25913;&#36827;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#32771;&#34385;&#20998;&#20301;&#25968;&#21644;&#21327;&#21464;&#37327;&#20381;&#36182;&#20851;&#31995;&#30340;&#22810;&#20803;&#27010;&#29575;&#39044;&#27979;&#30340;&#32467;&#21512;&#26041;&#27861;&#65292;&#24182;&#36890;&#36807;&#24179;&#28369;&#36807;&#31243;&#20801;&#35768;&#22312;&#32447;&#23398;&#20064;&#12290;&#36890;&#36807;&#32500;&#25968;&#38477;&#20302;&#21644;&#32602;&#20989;&#25968;&#24179;&#28369;&#31561;&#20004;&#31181;&#24179;&#28369;&#26041;&#27861;&#26469;&#23558;&#26631;&#20934;CRPS&#23398;&#20064;&#26694;&#26550;&#25512;&#24191;&#21040;&#22810;&#20803;&#32500;&#24230;&#20013;&#12290;&#23558;&#35813;&#26041;&#27861;&#24212;&#29992;&#20110;&#39044;&#27979;&#26085;&#21069;&#30005;&#20215;&#65292;&#30456;&#27604;&#20110;&#32479;&#19968;&#32452;&#21512;&#65292;&#22312;CRPS&#26041;&#38754;&#21462;&#24471;&#20102;&#26174;&#33879;&#25913;&#36827;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper presents a new method for combining (or aggregating or ensembling) multivariate probabilistic forecasts, taking into account dependencies between quantiles and covariates through a smoothing procedure that allows for online learning. Two smoothing methods are discussed: dimensionality reduction using Basis matrices and penalized smoothing. The new online learning algorithm generalizes the standard CRPS learning framework into multivariate dimensions. It is based on Bernstein Online Aggregation (BOA) and yields optimal asymptotic learning properties. We provide an in-depth discussion on possible extensions of the algorithm and several nested cases related to the existing literature on online forecast combination. The methodology is applied to forecasting day-ahead electricity prices, which are 24-dimensional distributional forecasts. The proposed method yields significant improvements over uniform combination in terms of continuous ranked probability score (CRPS). We discuss 
&lt;/p&gt;</description></item><item><title>&#30740;&#31350;&#35777;&#26126;&#65292;&#30456;&#23545;&#20110;&#20256;&#32479;&#22810;&#25968;&#31080;&#25237;&#31080;&#65292;&#30636;&#26102;&#25490;&#21517;&#25237;&#31080;&#22312;&#23545;&#31216;&#20998;&#24067;&#30340;&#36873;&#27665;&#20559;&#22909;&#26465;&#20214;&#19979;&#20855;&#26377;&#20013;&#21644;&#25928;&#24212;&#65292;&#21487;&#20197;&#36991;&#20813;&#36873;&#20986;&#26497;&#31471;&#20505;&#36873;&#20154;&#12290;</title><link>http://arxiv.org/abs/2303.09734</link><description>&lt;p&gt;
&#30636;&#26102;&#25490;&#21517;&#25237;&#31080;&#20013;&#30340;&#20013;&#21644;&#24615;&#20998;&#26512;
&lt;/p&gt;
&lt;p&gt;
Moderation in instant runoff voting. (arXiv:2303.09734v1 [cs.MA])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.09734
&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#35777;&#26126;&#65292;&#30456;&#23545;&#20110;&#20256;&#32479;&#22810;&#25968;&#31080;&#25237;&#31080;&#65292;&#30636;&#26102;&#25490;&#21517;&#25237;&#31080;&#22312;&#23545;&#31216;&#20998;&#24067;&#30340;&#36873;&#27665;&#20559;&#22909;&#26465;&#20214;&#19979;&#20855;&#26377;&#20013;&#21644;&#25928;&#24212;&#65292;&#21487;&#20197;&#36991;&#20813;&#36873;&#20986;&#26497;&#31471;&#20505;&#36873;&#20154;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36817;&#24180;&#26469;&#65292;&#30636;&#26102;&#25490;&#21517;&#25237;&#31080;&#65288;IRV&#65289;&#20316;&#20026;&#20256;&#32479;&#22810;&#25968;&#31080;&#25237;&#31080;&#30340;&#19968;&#31181;&#26367;&#20195;&#26041;&#24335;&#22791;&#21463;&#27426;&#36814;&#12290;&#25903;&#25345;&#32773;&#22768;&#31216;IRV&#30456;&#23545;&#20110;&#22810;&#25968;&#31080;&#25237;&#31080;&#30340;&#22909;&#22788;&#20043;&#19968;&#26159;&#23427;&#20542;&#21521;&#20110;&#20013;&#38388;&#27966;&#65306;&#23427;&#20135;&#29983;&#27604;&#22810;&#25968;&#31080;&#26356;&#20026;&#28201;&#21644;&#30340;&#32988;&#32773;&#65292;&#22240;&#27492;&#21487;&#20197;&#25104;&#20026;&#35299;&#20915;&#26497;&#21270;&#38382;&#39064;&#30340;&#26377;&#29992;&#24037;&#20855;&#12290;&#28982;&#32780;&#65292;&#23545;&#20110;&#36825;&#31181;&#35828;&#27861;&#65292;&#24456;&#23569;&#26377;&#29702;&#35770;&#25903;&#25345;&#65292;&#29616;&#26377;&#30340;&#35777;&#25454;&#37117;&#26159;&#22522;&#20110;&#27169;&#25311;&#21644;&#26696;&#20363;&#30740;&#31350;&#30340;&#12290;&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#22312;&#19968;&#32500;&#27431;&#20960;&#37324;&#24471;&#27169;&#22411;&#20013;&#30340;&#36873;&#27665;&#20559;&#22909;&#26465;&#20214;&#19979;&#65292;&#35777;&#26126;&#20102;IRV&#30456;&#23545;&#20110;&#20256;&#32479;&#30340;&#22810;&#25968;&#31080;&#25237;&#31080;&#20855;&#26377;&#19968;&#23450;&#30340;&#20013;&#21644;&#25928;&#24212;&#12290;&#25105;&#20204;&#30340;&#32467;&#26524;&#34920;&#26126;&#65292;&#21482;&#35201;&#36873;&#27665;&#30340;&#20998;&#24067;&#26159;&#23545;&#31216;&#30340;&#65292;&#24182;&#19988;&#19981;&#22826;&#38598;&#20013;&#20110;&#26497;&#31471;&#65292;IRV&#23601;&#19981;&#20250;&#36873;&#20986;&#36229;&#36807;&#20998;&#24067;&#23614;&#37096;&#26576;&#20010;&#38408;&#20540;&#20043;&#22806;&#30340;&#20505;&#36873;&#20154;&#65292;&#32780;&#22810;&#25968;&#31080;&#21017;&#21487;&#33021;&#20250;&#12290;&#23545;&#20110;&#22343;&#21248;&#20998;&#24067;&#65292;&#25105;&#20204;&#25552;&#20379;&#20102;&#25512;&#23548;&#20986;&#22810;&#25968;&#31080;&#21644;IRV&#31934;&#30830;&#20998;&#24067;&#30340;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
Instant runoff voting (IRV) has gained popularity in recent years as an alternative to traditional plurality voting. Advocates of IRV claim that one of its benefits relative to plurality voting is its tendency toward moderation: that it produces more moderate winners than plurality and could therefore be a useful tool for addressing polarization. However, there is little theoretical backing for this claim, and existing evidence has focused on simulations and case studies. In this work, we prove that IRV has a moderating effect relative to traditional plurality voting in a specific sense, developed in a 1-dimensional Euclidean model of voter preferences. Our results show that as long as voters are symmetrically distributed and not too concentrated at the extremes, IRV will not elect a candidate that is beyond a certain threshold in the tails of the distribution, while plurality can. For the uniform distribution, we provide an approach for deriving the exact distributions of the pluralit
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#20010;&#21171;&#21160;&#21147;&#36801;&#31227;&#27169;&#22411;&#65292;&#36890;&#36807;&#27169;&#25311;&#21457;&#29616;&#27169;&#22411;&#21487;&#20197;&#20135;&#29983;&#32858;&#38598;&#34892;&#20026;&#65292;&#24182;&#23637;&#29616;&#20102;&#20004;&#20010;&#32463;&#39564;&#35268;&#24459;&#12290;&#26356;&#36827;&#19968;&#27493;&#65292;&#30740;&#31350;&#35777;&#26126;&#20102;&#32463;&#27982;&#24615;&#36235;&#21521;&#24615;&#65292;&#36825;&#26159;&#19968;&#31181;&#26032;&#22411;&#20154;&#31867;&#34892;&#20026;&#20013;&#24515;&#30340;&#36235;&#21521;&#24615;&#65292;&#21487;&#20197;&#35299;&#37322;&#22312;&#29616;&#23454;&#19990;&#30028;&#20013;&#30340;&#21171;&#21160;&#21147;&#32858;&#38598;&#29616;&#35937;&#65292;&#36825;&#19968;&#32467;&#35770;&#31361;&#26174;&#20102;&#22478;&#24066;&#21270;&#19982;&#25152;&#23548;&#20986;&#30340;PDE&#31995;&#32479;&#20013;&#30340;&#21561;&#36215;&#29616;&#35937;&#30340;&#30456;&#20851;&#24615;&#12290;</title><link>http://arxiv.org/abs/2303.09720</link><description>&lt;p&gt;
&#21171;&#21160;&#21147;&#36801;&#31227;&#27169;&#25311;&#20013;&#30340;&#32463;&#27982;&#24615;&#36235;&#21521;&#24615;
&lt;/p&gt;
&lt;p&gt;
Econotaxis in modeling urbanization by labor force migration. (arXiv:2303.09720v1 [nlin.AO])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.09720
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#20010;&#21171;&#21160;&#21147;&#36801;&#31227;&#27169;&#22411;&#65292;&#36890;&#36807;&#27169;&#25311;&#21457;&#29616;&#27169;&#22411;&#21487;&#20197;&#20135;&#29983;&#32858;&#38598;&#34892;&#20026;&#65292;&#24182;&#23637;&#29616;&#20102;&#20004;&#20010;&#32463;&#39564;&#35268;&#24459;&#12290;&#26356;&#36827;&#19968;&#27493;&#65292;&#30740;&#31350;&#35777;&#26126;&#20102;&#32463;&#27982;&#24615;&#36235;&#21521;&#24615;&#65292;&#36825;&#26159;&#19968;&#31181;&#26032;&#22411;&#20154;&#31867;&#34892;&#20026;&#20013;&#24515;&#30340;&#36235;&#21521;&#24615;&#65292;&#21487;&#20197;&#35299;&#37322;&#22312;&#29616;&#23454;&#19990;&#30028;&#20013;&#30340;&#21171;&#21160;&#21147;&#32858;&#38598;&#29616;&#35937;&#65292;&#36825;&#19968;&#32467;&#35770;&#31361;&#26174;&#20102;&#22478;&#24066;&#21270;&#19982;&#25152;&#23548;&#20986;&#30340;PDE&#31995;&#32479;&#20013;&#30340;&#21561;&#36215;&#29616;&#35937;&#30340;&#30456;&#20851;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#37319;&#29992;&#20027;&#21160;&#24067;&#26391;&#31890;&#23376;&#26694;&#26550;&#65292;&#25552;&#20986;&#20102;&#19968;&#20010;&#31616;&#21333;&#30340;&#21171;&#21160;&#21147;&#36801;&#31227;&#24494;&#35266;&#27169;&#22411;&#12290;&#36890;&#36807;&#22522;&#20110;&#20195;&#29702;&#30340;&#27169;&#25311;&#65292;&#25105;&#20204;&#21457;&#29616;&#25105;&#20204;&#30340;&#27169;&#22411;&#20135;&#29983;&#20102;&#20174;&#38543;&#26426;&#21021;&#22987;&#20998;&#24067;&#20013;&#32858;&#38598;&#21040;&#19968;&#36215;&#30340;&#19968;&#32676;&#20195;&#29702;&#12290;&#27492;&#22806;&#65292;&#22312;&#25105;&#20204;&#30340;&#27169;&#22411;&#20013;&#35266;&#23519;&#21040;&#20102;Zipf&#21644;Okun&#23450;&#24459;&#36825;&#20004;&#20010;&#32463;&#39564;&#35268;&#24459;&#12290;&#20026;&#20102;&#25581;&#31034;&#20135;&#29983;&#30340;&#32858;&#38598;&#29616;&#35937;&#32972;&#21518;&#30340;&#26426;&#21046;&#65292;&#25105;&#20204;&#20174;&#25105;&#20204;&#30340;&#24494;&#35266;&#27169;&#22411;&#20013;&#23548;&#20986;&#20102;&#19968;&#20010;&#25193;&#23637;&#30340;Keller-Segel&#31995;&#32479;&#12290;&#24471;&#21040;&#30340;&#23439;&#35266;&#31995;&#32479;&#34920;&#26126;&#20154;&#21147;&#36164;&#28304;&#22312;&#29616;&#23454;&#19990;&#30028;&#20013;&#30340;&#32858;&#38598;&#21487;&#20197;&#36890;&#36807;&#19968;&#31181;&#26032;&#22411;&#20154;&#31867;&#34892;&#20026;&#20013;&#24515;&#30340;&#36235;&#21521;&#24615;&#26469;&#35299;&#37322;&#65292;&#36825;&#31361;&#26174;&#20102;&#22478;&#24066;&#21270;&#19982;&#25152;&#23548;&#20986;&#30340;PDE&#31995;&#32479;&#20013;&#30340;&#21561;&#36215;&#29616;&#35937;&#30340;&#30456;&#20851;&#24615;&#12290;&#25105;&#20204;&#23558;&#20854;&#31216;&#20026;&#8220;&#32463;&#27982;&#24615;&#36235;&#21521;&#24615;&#8221;&#12290;
&lt;/p&gt;
&lt;p&gt;
Individual participants in human society collectively exhibit aggregation behavior. In this study, we present a simple microscopic model of labor force migration by employing the active Brownian particles framework. Through agent-based simulations, we find that our model produces clusters of agents from a random initial distribution. Furthermore, two empirical regularities called Zipf's and Okun's laws were observed in our model. To reveal the mechanism underlying the reproduced agglomeration phenomena, we derived an extended Keller-Segel system, a classic model that describes the aggregation behavior of biological organisms called "taxis," from our microscopic model. The obtained macroscopic system indicates that the agglomeration of the workforce in real world can be accounted for through a new type of taxis central to human behavior, which highlights the relevance of urbanization to blow-up phenomena in the derived PDE system. We term it "econotaxis."
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#22522;&#20110;SCAD&#24809;&#32602;&#20989;&#25968;&#30340;&#39640;&#32500;&#31232;&#30095;&#38750;&#32447;&#24615;&#27169;&#22411;&#12290;&#36890;&#36807;Bootstrap&#26041;&#27861;&#65292;&#25552;&#20986;&#20102;&#28176;&#36817;&#32454;&#21270;&#30340;&#35299;&#20915;&#26041;&#26696;&#65292;&#21487;&#22823;&#22823;&#20943;&#23569;&#35206;&#30422;&#27010;&#29575;&#35823;&#24046;&#12290;</title><link>http://arxiv.org/abs/2303.09680</link><description>&lt;p&gt;
&#22522;&#20110;Bootstrap&#30340;&#39640;&#32500;&#38750;&#32447;&#24615;&#27169;&#22411;&#28176;&#36817;&#32454;&#21270;
&lt;/p&gt;
&lt;p&gt;
Bootstrap based asymptotic refinements for high-dimensional nonlinear models. (arXiv:2303.09680v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.09680
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22522;&#20110;SCAD&#24809;&#32602;&#20989;&#25968;&#30340;&#39640;&#32500;&#31232;&#30095;&#38750;&#32447;&#24615;&#27169;&#22411;&#12290;&#36890;&#36807;Bootstrap&#26041;&#27861;&#65292;&#25552;&#20986;&#20102;&#28176;&#36817;&#32454;&#21270;&#30340;&#35299;&#20915;&#26041;&#26696;&#65292;&#21487;&#22823;&#22823;&#20943;&#23569;&#35206;&#30422;&#27010;&#29575;&#35823;&#24046;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#32771;&#34385;&#20102;&#19968;&#31181;&#39640;&#32500;&#21487;&#33021;&#38750;&#32447;&#24615;&#12289;&#31232;&#30095;&#30340;&#24809;&#32602;&#26497;&#20540;&#20272;&#35745;&#27169;&#22411;&#65292;&#20854;&#20013;&#22823;&#37096;&#20998;&#21442;&#25968;&#20026;&#38646;&#12290;&#20351;&#29992;SCAD&#24809;&#32602;&#20989;&#25968;&#65292;&#20854;&#22312;&#36866;&#24403;&#26465;&#20214;&#19979;&#25552;&#20379;&#20102;&#27169;&#22411;&#36873;&#25321;&#19968;&#33268;&#21644;oracle&#25928;&#29575;&#20272;&#35745;&#12290;&#28982;&#32780;&#65292;&#22312;&#35768;&#22810;&#24212;&#29992;&#20013;&#65292;&#22522;&#20110;oracle&#27169;&#22411;&#30340;&#28176;&#36817;&#36817;&#20284;&#21487;&#33021;&#20250;&#20986;&#29616;&#26679;&#26412;&#37327;&#19981;&#20934;&#30830;&#30340;&#24773;&#20917;&#12290;&#26412;&#25991;&#32473;&#20986;&#20102;&#26465;&#20214;&#65292;&#35777;&#26126;&#20102;&#22522;&#20110;SCAD&#24809;&#32602;&#38408;&#20540;&#20272;&#35745;&#30340;Bootstrap&#26041;&#27861;&#25552;&#20379;&#20102;&#23545;&#31216;&#20551;&#35774;&#26816;&#39564;&#65288;&#32622;&#20449;&#21306;&#38388;&#65289;&#20013;&#25298;&#32477;&#65288;&#35206;&#30422;&#65289;&#27010;&#29575;&#35823;&#24046;O&#65288;n^{-2}&#65289;&#21644;&#21333;&#20391;&#25110;&#21452;&#20391;&#26816;&#39564;&#65288;&#32622;&#20449;&#21306;&#38388;&#65289;&#20013;&#30340;&#25298;&#32477;&#65288;&#35206;&#30422;&#65289;&#27010;&#29575;&#35823;&#24046;O&#65288;n^{-1}&#65289;&#30340;&#28176;&#36817;&#32454;&#21270;&#12290;&#33945;&#29305;&#21345;&#32599;&#23454;&#39564;&#32467;&#26524;&#34920;&#26126;&#65292;Bootstrap&#21487;&#20197;&#22823;&#22823;&#20943;&#23569;&#35206;&#30422;&#27010;&#29575;&#35823;&#24046;&#12290;
&lt;/p&gt;
&lt;p&gt;
We consider penalized extremum estimation of a high-dimensional, possibly nonlinear model that is sparse in the sense that most of its parameters are zero but some are not. We use the SCAD penalty function, which provides model selection consistent and oracle efficient estimates under suitable conditions. However, asymptotic approximations based on the oracle model can be inaccurate with the sample sizes found in many applications. This paper gives conditions under which the bootstrap, based on estimates obtained through SCAD penalization with thresholding, provides asymptotic refinements of size \(O \left( n^{- 2} \right)\) for the error in the rejection (coverage) probability of a symmetric hypothesis test (confidence interval) and \(O \left( n^{- 1} \right)\) for the error in rejection (coverage) probability of a one-sided or equal tailed test (confidence interval). The results of Monte Carlo experiments show that the bootstrap can provide large reductions in errors in coverage prob
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#35299;&#20915;&#20102;&#38271;&#26399;&#20851;&#31995;&#19979;&#21457;&#20214;&#20154;&#19982;&#25910;&#20214;&#20154;&#38388;&#20449;&#24687;&#25552;&#20379;&#30340;&#26368;&#20248;&#31574;&#30053;&#65292;&#36825;&#19968;&#31574;&#30053;&#35090;&#22870;&#36807;&#21435;&#65292;&#24341;&#39046;&#26410;&#26469;&#12290;</title><link>http://arxiv.org/abs/2303.09675</link><description>&lt;p&gt;
&#21160;&#24577;&#20449;&#24687;&#25552;&#20379;&#65306;&#35090;&#22870;&#36807;&#21435;&#65292;&#24341;&#39046;&#26410;&#26469;
&lt;/p&gt;
&lt;p&gt;
Dynamic Information Provision: Rewarding the Past and Guiding the Future. (arXiv:2303.09675v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.09675
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#35299;&#20915;&#20102;&#38271;&#26399;&#20851;&#31995;&#19979;&#21457;&#20214;&#20154;&#19982;&#25910;&#20214;&#20154;&#38388;&#20449;&#24687;&#25552;&#20379;&#30340;&#26368;&#20248;&#31574;&#30053;&#65292;&#36825;&#19968;&#31574;&#30053;&#35090;&#22870;&#36807;&#21435;&#65292;&#24341;&#39046;&#26410;&#26469;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#19968;&#20010;&#20449;&#24687;&#38271;&#26399;&#20851;&#31995;&#20013;&#21457;&#20214;&#20154;&#21644;&#25910;&#20214;&#20154;&#20043;&#38388;&#30340;&#26368;&#20248;&#20449;&#24687;&#25552;&#20379;&#12290;&#21457;&#20214;&#20154;&#35266;&#23519;&#19968;&#20010;&#25345;&#20037;&#19988;&#19981;&#26029;&#21457;&#23637;&#30340;&#29366;&#24577;&#65292;&#24182;&#25215;&#35834;&#19982;&#26102;&#38388;&#25512;&#31227;&#32780;&#21457;&#36865;&#20449;&#21495;&#32473;&#25910;&#20214;&#20154;&#65292;&#21518;&#32773;&#39034;&#24207;&#36873;&#25321;&#24433;&#21709;&#20004;&#20010;&#29609;&#23478;&#31119;&#21033;&#30340;&#20844;&#20849;&#34892;&#21160;&#12290;&#25105;&#36890;&#36807;&#23553;&#38381;&#24418;&#24335;&#27714;&#35299;&#20102;&#21457;&#20214;&#20154;&#30340;&#26368;&#20248;&#25919;&#31574;&#65306;&#21457;&#20214;&#20154;&#29992;&#36880;&#28176;&#32553;&#23567;&#24182;&#26368;&#32456;&#28040;&#22833;&#30340;&#24310;&#36831;&#25253;&#21578;&#29366;&#24577;&#30340;&#20540;&#12290;&#21363;&#20351;&#25910;&#20214;&#20154;&#30693;&#36947;&#24403;&#21069;&#29366;&#24577;&#65292;&#21457;&#20214;&#20154;&#36890;&#36807;&#23041;&#32961;&#38544;&#30610;&#29366;&#24577;&#26410;&#26469;&#30340;&#28436;&#21464;&#26469;&#20445;&#25345;&#24433;&#21709;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;
I study the optimal provision of information in a long-term relationship between a sender and a receiver. The sender observes a persistent, evolving state and commits to send signals over time to the receiver, who sequentially chooses public actions that affect the welfare of both players. I solve for the sender's optimal policy in closed form: the sender reports the value of the state with a delay that shrinks over time and eventually vanishes. Even when the receiver knows the current state, the sender retains leverage by threatening to conceal the future evolution of the state.
&lt;/p&gt;</description></item><item><title>&#30740;&#31350;&#21457;&#29616;&#65292;&#36873;&#20030;&#21046;&#24230;&#20013;&#30340;&#27604;&#20363;&#20195;&#34920;&#26041;&#27861;&#21487;&#20197;&#26367;&#20195;&#32929;&#31080;&#20132;&#26131;&#25152;&#20013;&#30340;&#25353;&#27604;&#20363;&#20998;&#37197;&#39034;&#24207;&#30340;&#21305;&#37197;&#31639;&#27861;&#65292;&#25552;&#20379;&#26356;&#25509;&#36817;&#27604;&#20363;&#20998;&#37197;&#30340;&#35746;&#21333;&#20998;&#37197;&#12290;</title><link>http://arxiv.org/abs/2303.09652</link><description>&lt;p&gt;
&#20351;&#29992;&#27604;&#20363;&#20195;&#34920;&#21046;&#26041;&#27861;&#26367;&#20195;&#32929;&#31080;&#20132;&#26131;&#25152;&#20013;&#22522;&#20110;&#27604;&#20363;&#20998;&#37197;&#39034;&#24207;&#30340;&#21305;&#37197;&#31639;&#27861;&#30340;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
On Using Proportional Representation Methods as Alternatives to Pro-Rata Based Order Matching Algorithms in Stock Exchanges. (arXiv:2303.09652v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.09652
&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#21457;&#29616;&#65292;&#36873;&#20030;&#21046;&#24230;&#20013;&#30340;&#27604;&#20363;&#20195;&#34920;&#26041;&#27861;&#21487;&#20197;&#26367;&#20195;&#32929;&#31080;&#20132;&#26131;&#25152;&#20013;&#30340;&#25353;&#27604;&#20363;&#20998;&#37197;&#39034;&#24207;&#30340;&#21305;&#37197;&#31639;&#27861;&#65292;&#25552;&#20379;&#26356;&#25509;&#36817;&#27604;&#20363;&#20998;&#37197;&#30340;&#35746;&#21333;&#20998;&#37197;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30701;&#25991;&#30340;&#20027;&#35201;&#35266;&#23519;&#26159;&#65292;&#29992;&#20110;&#30830;&#23450;&#36873;&#20030;&#21046;&#24230;&#20013;&#27604;&#20363;&#20195;&#34920;&#30340;&#26041;&#27861;&#21487;&#20197;&#20316;&#20026;&#26367;&#20195;&#32929;&#31080;&#20132;&#26131;&#25152;&#20013;&#20351;&#29992;&#30340;&#25353;&#27604;&#20363;&#20998;&#37197;&#35746;&#21333;&#30340;&#21305;&#37197;&#31639;&#27861;&#30340;&#36873;&#25321;&#12290;&#25105;&#20204;&#30340;&#27169;&#25311;&#30740;&#31350;&#24378;&#26377;&#21147;&#22320;&#35777;&#26126;&#65292;&#26480;&#26000;&#36874;/&#24503;&#27721;&#29305;&#21644;&#38886;&#20271;&#26031;&#29305;/&#22307;&#25289;&#26684;&#27604;&#20363;&#20195;&#34920;&#26041;&#27861;&#25552;&#20379;&#30340;&#35746;&#21333;&#20998;&#37197;&#27604;&#25353;&#27604;&#20363;&#20998;&#37197;&#31639;&#27861;&#33719;&#24471;&#30340;&#35746;&#21333;&#20998;&#37197;&#26356;&#25509;&#36817;&#27604;&#20363;&#20998;&#37197;&#12290;
&lt;/p&gt;
&lt;p&gt;
The main observation of this short note is that methods for determining proportional representation in electoral systems may be suitable as alternatives to the pro-rata order matching algorithm used in stock exchanges. Our simulation studies provide strong evidence that the Jefferson/D'Hondt and the Webster/Saint-Lagu\"{e} proportional representation methods provide order allocations which are closer to proportionality than the order allocations obtained from the pro-rata algorithm.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#20195;&#29702;&#30340;&#23439;&#35266;&#32463;&#27982;&#27169;&#22411;&#65292;&#26088;&#22312;&#36981;&#24490;&#20975;&#24681;&#26031;&#30340;&#12298;&#22833;&#19994;&#12289;&#21033;&#29575;&#21644;&#36135;&#24065;&#30340;&#19968;&#33324;&#29702;&#35770;&#12299;&#65292;&#36890;&#36807;&#30830;&#23450;&#25910;&#20837;&#21644;&#23601;&#19994;&#27700;&#24179;&#26469;&#30830;&#23450;&#36164;&#26412;&#36793;&#38469;&#25928;&#30410;&#21644;&#20542;&#21521;&#20110;&#28040;&#36153;&#30340;&#36793;&#38469;&#20542;&#21521;&#12290;</title><link>http://arxiv.org/abs/2303.00889</link><description>&lt;p&gt;
Mr. Keynes&#21644;&#22797;&#26434;&#24615;&#65281;&#19968;&#31181;&#24314;&#35758;&#30340;&#22522;&#20110;&#20195;&#29702;&#30340;&#23601;&#19994;&#65292;&#21033;&#29575;&#21644;&#36135;&#24065;&#24635;&#35770;&#30340;&#29256;&#26412;&#12290;
&lt;/p&gt;
&lt;p&gt;
Mr.Keynes and the... Complexity! A suggested agent-based version of the General Theory of Employment, Interest and Money. (arXiv:2303.00889v2 [econ.TH] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.00889
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#20195;&#29702;&#30340;&#23439;&#35266;&#32463;&#27982;&#27169;&#22411;&#65292;&#26088;&#22312;&#36981;&#24490;&#20975;&#24681;&#26031;&#30340;&#12298;&#22833;&#19994;&#12289;&#21033;&#29575;&#21644;&#36135;&#24065;&#30340;&#19968;&#33324;&#29702;&#35770;&#12299;&#65292;&#36890;&#36807;&#30830;&#23450;&#25910;&#20837;&#21644;&#23601;&#19994;&#27700;&#24179;&#26469;&#30830;&#23450;&#36164;&#26412;&#36793;&#38469;&#25928;&#30410;&#21644;&#20542;&#21521;&#20110;&#28040;&#36153;&#30340;&#36793;&#38469;&#20542;&#21521;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#27169;&#22411;&#65292;&#26088;&#22312;&#23613;&#21487;&#33021;&#22320;&#36981;&#24490;J.M.&#20975;&#24681;&#26031;&#22312;&#20182;&#33879;&#21517;&#30340;&#12298;&#22833;&#19994;&#12289;&#21033;&#29575;&#21644;&#36135;&#24065;&#30340;&#19968;&#33324;&#29702;&#35770;&#12299;&#20013;&#25552;&#20986;&#30340;&#23439;&#35266;&#32463;&#27982;&#27169;&#22411;&#30340;&#22522;&#26412;&#21407;&#29702;&#65292;&#20197;&#25552;&#20379;&#19968;&#20010;&#21487;&#34892;&#30340;&#23439;&#35266;&#32463;&#27982;&#30740;&#31350;&#24037;&#20855;&#12290;&#23558;&#23637;&#31034;&#20975;&#24681;&#26031;&#30340;&#20027;&#35201;&#25104;&#26524;&#65292;&#21363;&#20174;&#36164;&#26412;&#36793;&#38469;&#25928;&#30410;&#21644;&#20542;&#21521;&#20110;&#28040;&#36153;&#30340;&#36793;&#38469;&#20542;&#21521;&#24320;&#22987;&#65292;&#22312;&#32473;&#23450;&#21033;&#29575;&#30340;&#24773;&#20917;&#19979;&#30830;&#23450;&#25910;&#20837;&#21644;&#23601;&#19994;&#27700;&#24179;&#12290;&#27169;&#22411;&#30340;&#35201;&#32032;&#23558;&#36890;&#36807;&#21442;&#32771;&#21407;&#22987;&#25991;&#26412;&#36827;&#34892;&#25551;&#36848;&#12290;&#27169;&#22411;&#25805;&#20316;&#20013;&#30340;&#39034;&#24207;&#24615;&#23558;&#35777;&#26126;&#22312;&#25551;&#36848;&#23439;&#35266;&#32463;&#27982;&#31995;&#32479;&#30340;&#22797;&#26434;&#24615;&#26102;&#24517;&#19981;&#21487;&#23569;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper presents a model with the aim to follow, as closely as possible, the rationale of the macroeconomic model advanced by J.M. Keynes in his famous "The General Theory of Unemployment, Interest and Money", in order to provide a viable tool for macroeconomic research. Keynes' main result will be shown, i.e., to determine the level of income and employment starting from the marginal efficiency of capital and the marginal propensity to consume, given the interest rate. Elements of the model will be described by referring to the original text. The sequentiality in model operation will prove quintessential in order to describe the complex nature of macroeconomic systems.
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#35752;&#35770;&#20102;&#33258;&#25105;&#28176;&#36827;&#36873;&#25321;&#29702;&#35770;&#21450;&#20854;&#19982;&#20195;&#25968;&#32467;&#26500;&#21644;&#36229;&#27169;&#20989;&#25968;&#30340;&#31561;&#20215;&#24615;&#65292;&#24182;&#23558;&#20998;&#26512;&#25193;&#23637;&#21040;&#26222;&#36941;&#33258;&#25105;&#28176;&#36827;&#30340;&#36873;&#25321;&#29702;&#35770;&#12290;</title><link>http://arxiv.org/abs/2212.13449</link><description>&lt;p&gt;
&#33258;&#25105;&#28176;&#36827;&#36873;&#25321;&#29702;&#35770;&#30340;&#22522;&#30784;
&lt;/p&gt;
&lt;p&gt;
Foundations of self-progressive choice theories. (arXiv:2212.13449v4 [econ.TH] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2212.13449
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#35752;&#35770;&#20102;&#33258;&#25105;&#28176;&#36827;&#36873;&#25321;&#29702;&#35770;&#21450;&#20854;&#19982;&#20195;&#25968;&#32467;&#26500;&#21644;&#36229;&#27169;&#20989;&#25968;&#30340;&#31561;&#20215;&#24615;&#65292;&#24182;&#23558;&#20998;&#26512;&#25193;&#23637;&#21040;&#26222;&#36941;&#33258;&#25105;&#28176;&#36827;&#30340;&#36873;&#25321;&#29702;&#35770;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#32771;&#34385;&#19968;&#20010;&#30001;&#35768;&#22810;&#20195;&#29702;&#20154;&#32452;&#25104;&#30340;&#32676;&#20307;&#65292;&#20182;&#20204;&#30340;&#36873;&#25321;&#34892;&#20026;&#21487;&#20197;&#26681;&#25454;&#32473;&#23450;&#30340;&#21407;&#22987;&#25490;&#24207;&#37096;&#20998;&#36827;&#34892;&#27604;&#36739;&#12290;&#22312;&#35813;&#32676;&#20307;&#20013;&#21487;&#25509;&#21463;&#30340;&#36873;&#25321;&#20989;&#25968;&#38598;&#21512;&#30830;&#23450;&#20102;&#19968;&#20010;&#36873;&#25321;&#29702;&#35770;&#12290;&#22914;&#26524;&#19982;&#29702;&#35770;&#19968;&#33268;&#30340;&#20219;&#20309;&#38598;&#20307;&#36873;&#25321;&#34892;&#20026;&#37117;&#21487;&#20197;&#34920;&#31034;&#20026;&#21487;&#27604;&#36739;&#30340;&#21487;&#25509;&#21463;&#36873;&#25321;&#20989;&#25968;&#19978;&#30340;&#27010;&#29575;&#20998;&#24067;&#65292;&#21017;&#35813;&#36873;&#25321;&#29702;&#35770;&#26159;&#33258;&#25105;&#28176;&#36827;&#30340;&#12290; &#25105;&#20204;&#35777;&#26126;&#20102;&#33258;&#25105;&#28176;&#36827;&#36873;&#25321;&#29702;&#35770;&#21644;&#65288;i&#65289;&#31216;&#20026;&#26684;&#30340;&#20247;&#25152;&#21608;&#30693;&#30340;&#20195;&#25968;&#32467;&#26500;&#65307;&#65288;ii&#65289;&#29305;&#23450;&#39046;&#22495;&#20869;&#30340;&#36229;&#27169;&#20989;&#25968;&#30340;&#26368;&#22823;&#21270;&#32773;&#20043;&#38388;&#30340;&#31561;&#20215;&#24615;&#12290;&#25105;&#20204;&#23558;&#20998;&#26512;&#25193;&#23637;&#21040;&#26222;&#36941;&#33258;&#25105;&#28176;&#36827;&#30340;&#36873;&#25321;&#29702;&#35770;&#65292;&#36825;&#20123;&#36873;&#25321;&#29702;&#35770;&#29420;&#31435;&#20110;&#21407;&#22987;&#25490;&#24207;&#32473;&#20986;&#20102;&#21807;&#19968;&#30340;&#26377;&#24207;&#20195;&#34920;&#12290;
&lt;/p&gt;
&lt;p&gt;
Consider a population of agents whose choice behaviors are partially comparable according to given primitive orderings. The set of choice functions admissible in the population specifies a choice theory. A choice theory is self-progressive if any aggregate choice behavior consistent with the theory is uniquely representable as a probability distribution over admissible choice functions that are comparable. We establish an equivalence between self-progressive choice theories and (i) well-known algebraic structures called lattices; (ii) the maximizers of supermodular functions over a specific domain of choice functions. We extend our analysis to universally self-progressive choice theories which render unique orderly representations independent of primitive orderings.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#19968;&#31181;&#26032;&#30340;&#21338;&#24328;&#22343;&#34913;&#27010;&#24565;&#8212;&#8212;&#21487;&#35266;&#27979;&#23436;&#32654;&#22343;&#34913;&#65292;&#22312;&#39034;&#24207;&#19981;&#23436;&#20840;&#20449;&#24687;&#21338;&#24328;&#20013;&#21487;&#20197;&#24110;&#21161;&#21019;&#24314;&#30495;&#27491;&#30340;&#31574;&#30053;&#20195;&#29702;&#12290;&#36825;&#31181;&#22343;&#34913;&#27010;&#24565;&#22312;&#20844;&#24320;&#35266;&#23519;&#30340;&#34892;&#21160;&#27010;&#29575;&#26041;&#38754;&#20855;&#26377;&#40065;&#26834;&#24615;&#12290;</title><link>http://arxiv.org/abs/2210.16506</link><description>&lt;p&gt;
&#21487;&#35266;&#27979;&#23436;&#32654;&#22343;&#34913; (Observable Perfect Equilibrium)
&lt;/p&gt;
&lt;p&gt;
Observable Perfect Equilibrium. (arXiv:2210.16506v5 [cs.GT] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2210.16506
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#19968;&#31181;&#26032;&#30340;&#21338;&#24328;&#22343;&#34913;&#27010;&#24565;&#8212;&#8212;&#21487;&#35266;&#27979;&#23436;&#32654;&#22343;&#34913;&#65292;&#22312;&#39034;&#24207;&#19981;&#23436;&#20840;&#20449;&#24687;&#21338;&#24328;&#20013;&#21487;&#20197;&#24110;&#21161;&#21019;&#24314;&#30495;&#27491;&#30340;&#31574;&#30053;&#20195;&#29702;&#12290;&#36825;&#31181;&#22343;&#34913;&#27010;&#24565;&#22312;&#20844;&#24320;&#35266;&#23519;&#30340;&#34892;&#21160;&#27010;&#29575;&#26041;&#38754;&#20855;&#26377;&#40065;&#26834;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#23613;&#31649;&#32435;&#20160;&#22343;&#34913;&#25104;&#20026;&#20102;&#21338;&#24328;&#35770;&#30340;&#26680;&#24515;&#35299;&#20915;&#26041;&#26696;&#27010;&#24565;&#65292;&#35768;&#22810;&#37325;&#35201;&#30340;&#21338;&#24328;&#21253;&#21547;&#22810;&#20010;&#32435;&#20160;&#22343;&#34913;&#65292;&#25105;&#20204;&#24517;&#39035;&#30830;&#23450;&#22914;&#20309;&#22312;&#20854;&#20013;&#36873;&#25321;&#65292;&#20197;&#21019;&#24314;&#30495;&#27491;&#30340;&#31574;&#30053;&#20195;&#29702;&#12290;&#20026;&#39034;&#24207;&#19981;&#23436;&#20840;&#20449;&#24687;&#21338;&#24328;&#25552;&#20986;&#20102;&#20960;&#20010;&#32435;&#20160;&#22343;&#34913;&#32454;&#21270;&#27010;&#24565;&#65292;&#20854;&#20013;&#26368;&#31361;&#20986;&#30340;&#26159;&#39076;&#25238;&#25163;&#23436;&#32654;&#22343;&#34913;&#12289;&#25311;&#23436;&#32654;&#22343;&#34913;&#21644;&#26368;&#36817;&#25552;&#20986;&#30340;&#21333;&#20391;&#25311;&#23436;&#32654;&#22343;&#34913;&#12290;&#36825;&#20123;&#27010;&#24565;&#23545;&#26576;&#20123;&#20219;&#24847;&#23567;&#30340;&#38169;&#35823;&#20855;&#26377;&#40065;&#26834;&#24615;&#65292;&#24182;&#20445;&#35777;&#22987;&#32456;&#23384;&#22312;&#12290;&#20294;&#25105;&#20204;&#35748;&#20026;&#65292;&#23545;&#20110;&#21457;&#23637;&#39034;&#24207;&#19981;&#23436;&#20840;&#20449;&#24687;&#21338;&#24328;&#20013;&#24378;&#22823;&#30340;&#20195;&#29702;&#20154;&#65292;&#36825;&#20123;&#27010;&#24565;&#37117;&#19981;&#27491;&#30830;&#12290;&#25105;&#20204;&#20026;&#28216;&#25103;&#26641;&#20013;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#22343;&#34913;&#27010;&#24565;&#8212;&#8212;&#21487;&#35266;&#27979;&#23436;&#32654;&#22343;&#34913;&#65292;&#22312;&#20854;&#20013;&#65292;&#35299;&#20915;&#26041;&#26696;&#22312;&#20844;&#24320;&#35266;&#23519;&#30340;&#34892;&#21160;&#27010;&#29575;&#26041;&#38754;&#20855;&#26377;&#40065;&#26834;&#24615;&#65288;&#24182;&#19981;&#19968;&#23450;&#38024;&#23545;&#25152;&#26377;&#21487;&#33021;&#19981;&#21487;&#35266;&#23519;&#30340;&#34892;&#21160;&#27010;&#29575;&#20855;&#26377;&#40065;&#26834;&#24615;&#65289;&#12290;
&lt;/p&gt;
&lt;p&gt;
While Nash equilibrium has emerged as the central game-theoretic solution concept, many important games contain several Nash equilibria and we must determine how to select between them in order to create real strategic agents. Several Nash equilibrium refinement concepts have been proposed and studied for sequential imperfect-information games, the most prominent being trembling-hand perfect equilibrium, quasi-perfect equilibrium, and recently one-sided quasi-perfect equilibrium. These concepts are robust to certain arbitrarily small mistakes, and are guaranteed to always exist; however, we argue that neither of these is the correct concept for developing strong agents in sequential games of imperfect information. We define a new equilibrium refinement concept for extensive-form games called observable perfect equilibrium in which the solution is robust over trembles in publicly-observable action probabilities (not necessarily over all action probabilities that may not be observable by
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#26045;&#23494;&#29305;&#25552;&#20986;&#30340;&#20108;&#20803;&#32852;&#31435;&#27169;&#22411;&#22312;&#21160;&#24577;&#38754;&#26495;&#25968;&#25454;&#29256;&#26412;&#19979;&#30340;&#24212;&#29992;&#65292;&#21457;&#29616;&#22827;&#22971;&#23601;&#19994;&#20851;&#31995;&#30340;&#20381;&#36182;&#31243;&#24230;&#22240;&#22827;&#22971;&#30340;&#26063;&#35028;&#26500;&#25104;&#32780;&#24322;&#12290;</title><link>http://arxiv.org/abs/2207.07343</link><description>&lt;p&gt;
&#20108;&#20803;&#32467;&#26524;&#27169;&#22411;&#20013;&#30340;&#21516;&#26102;&#24615;&#21450;&#20854;&#22312;&#22827;&#22971;&#23601;&#19994;&#20013;&#30340;&#24212;&#29992;
&lt;/p&gt;
&lt;p&gt;
Simultaneity in Binary Outcome Models with an Application to Employment for Couples. (arXiv:2207.07343v2 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2207.07343
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#26045;&#23494;&#29305;&#25552;&#20986;&#30340;&#20108;&#20803;&#32852;&#31435;&#27169;&#22411;&#22312;&#21160;&#24577;&#38754;&#26495;&#25968;&#25454;&#29256;&#26412;&#19979;&#30340;&#24212;&#29992;&#65292;&#21457;&#29616;&#22827;&#22971;&#23601;&#19994;&#20851;&#31995;&#30340;&#20381;&#36182;&#31243;&#24230;&#22240;&#22827;&#22971;&#30340;&#26063;&#35028;&#26500;&#25104;&#32780;&#24322;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24444;&#24471;&#183;&#26045;&#23494;&#29305;&#22312;&#35745;&#37327;&#32463;&#27982;&#23398;&#21457;&#23637;&#20013;&#20570;&#20986;&#20102;&#35768;&#22810;&#36129;&#29486;&#65292;&#20854;&#20013;&#21253;&#25324;&#24341;&#20837;&#32852;&#31435;logit&#27169;&#22411;&#20197;&#21450;&#30740;&#31350;&#30701;&#38754;&#26495;&#19979;&#21160;&#24577;&#32447;&#24615;&#22266;&#23450;&#25928;&#24212;&#38754;&#26495;&#25968;&#25454;&#27169;&#22411;&#30340;&#20272;&#35745;&#26041;&#27861;&#12290;&#26412;&#25991;&#30740;&#31350;&#20102;&#26045;&#23494;&#29305;&#21644;&#26031;&#29305;&#21171;&#26031;&#65288;1975&#65289;&#24341;&#20837;&#30340;&#20108;&#20803;&#27169;&#22411;&#30340;&#21160;&#24577;&#38754;&#26495;&#25968;&#25454;&#29256;&#26412;&#65292;&#35813;&#27169;&#22411;&#20801;&#35768;&#28382;&#21518;&#30340;&#22240;&#21464;&#37327;&#21644;&#22266;&#23450;&#25928;&#24212;&#65292;&#31867;&#20284;&#20110;&#23433;&#21644;&#26045;&#23494;&#29305;&#65288;1995&#65289;&#30340;&#27169;&#22411;&#12290;&#25105;&#20204;&#23558;&#26465;&#20214;&#20284;&#28982;&#26041;&#27861;&#19982;&#30697;&#20272;&#35745;&#26041;&#27861;&#30456;&#32467;&#21512;&#65292;&#24471;&#20986;&#20102;&#27169;&#22411;&#30340;&#20272;&#35745;&#31574;&#30053;&#12290;&#25105;&#20204;&#23558;&#36825;&#31181;&#20272;&#35745;&#31574;&#30053;&#24212;&#29992;&#20110;&#22827;&#22971;&#23601;&#19994;&#20851;&#31995;&#30340;&#31616;&#21333;&#27169;&#22411;&#20013;&#12290;&#25105;&#20204;&#30340;&#20027;&#35201;&#32467;&#35770;&#26159;&#65292;&#22312;&#32771;&#34385;&#26410;&#35266;&#27979;&#21040;&#30340;&#23478;&#24237;&#29305;&#23450;&#24322;&#36136;&#24615;&#30340;&#24773;&#20917;&#19979;&#65292;&#22827;&#22971;&#20043;&#38388;&#30340;&#23601;&#19994;&#20381;&#36182;&#20851;&#31995;&#22240;&#22827;&#22971;&#30340;&#26063;&#35028;&#26500;&#25104;&#32780;&#24322;&#12290;
&lt;/p&gt;
&lt;p&gt;
Two of Peter Schmidt's many contributions to econometrics have been to introduce a simultaneous logit model for bivariate binary outcomes and to study estimation of dynamic linear fixed effects panel data models using short panels. In this paper, we study a dynamic panel data version of the bivariate model introduced in Schmidt and Strauss (1975) that allows for lagged dependent variables and fixed effects as in Ahn and Schmidt (1995). We combine a conditional likelihood approach with a method of moments approach to obtain an estimation strategy for the resulting model. We apply this estimation strategy to a simple model for the intra-household relationship in employment. Our main conclusion is that the within-household dependence in employment differs significantly by the ethnicity composition of the couple even after one allows for unobserved household specific heterogeneity.
&lt;/p&gt;</description></item></channel></rss>