<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#24503;&#22269;&#30340;&#26368;&#20302;&#24037;&#36164;&#25919;&#31574;&#24341;&#20837;&#21450;&#20854;&#19978;&#28072;&#23545;&#23601;&#19994;&#26377;&#30528;&#23567;&#24133;&#36127;&#38754;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2310.15964</link><description>&lt;p&gt;
&#24503;&#22269;&#26368;&#20302;&#24037;&#36164;&#30340;&#38271;&#26399;&#23601;&#19994;&#24433;&#21709;&#65306;&#26032;&#30340;&#25968;&#25454;&#21644;&#20272;&#35745;
&lt;/p&gt;
&lt;p&gt;
Long-Term Employment Effects of the Minimum Wage in Germany: New Data and Estimators. (arXiv:2310.15964v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.15964
&lt;/p&gt;
&lt;p&gt;
&#24503;&#22269;&#30340;&#26368;&#20302;&#24037;&#36164;&#25919;&#31574;&#24341;&#20837;&#21450;&#20854;&#19978;&#28072;&#23545;&#23601;&#19994;&#26377;&#30528;&#23567;&#24133;&#36127;&#38754;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;2015&#24180;&#24503;&#22269;&#26368;&#20302;&#24037;&#36164;&#24341;&#20837;&#21450;&#20854;&#38543;&#21518;&#30340;&#22686;&#21152;&#23545;&#22320;&#21306;&#23601;&#19994;&#30340;&#38271;&#26399;&#24433;&#21709;&#12290;&#21033;&#29992;&#20004;&#36718;&#25910;&#20837;&#32467;&#26500;&#35843;&#26597;&#30340;&#25968;&#25454;&#65292;&#25105;&#20204;&#33021;&#22815;&#20272;&#35745;&#32771;&#34385;&#21040;&#26368;&#20302;&#24037;&#36164;&#22312;&#26102;&#38388;&#19978;&#21464;&#21270;&#30340;&#27169;&#22411;&#12290;&#23613;&#31649;&#24341;&#20837;&#20027;&#35201;&#24433;&#21709;&#20102;&#19996;&#24503;&#30340;&#21171;&#21160;&#24066;&#22330;&#65292;&#20294;&#36825;&#20123;&#19978;&#28072;&#20063;&#36234;&#26469;&#36234;&#24433;&#21709;&#35199;&#24503;&#30340;&#20302;&#24037;&#36164;&#22320;&#21306;&#65292;&#20197;&#33267;&#20110;&#32422;&#19977;&#20998;&#20043;&#19968;&#30340;&#22320;&#21306;&#22312;&#26102;&#38388;&#19978;&#25913;&#21464;&#20102;&#65288;&#20108;&#36827;&#21046;&#30340;&#65289;&#22788;&#29702;&#29366;&#24577;&#12290;&#25105;&#20204;&#24212;&#29992;&#20102;&#19981;&#21516;&#30340;&#35268;&#26684;&#21644;&#32463;&#20856;&#30340;&#24046;&#24322;&#27861;a&#21450;&#19968;&#20123;&#26032;&#30340;&#20272;&#35745;&#26041;&#27861;&#65292;&#21487;&#20197;&#36827;&#34892;&#24102;&#26377;&#20998;&#22359;&#22788;&#29702;&#37319;&#32435;&#21644;&#24322;&#36136;&#22788;&#29702;&#25928;&#24212;&#30340;&#26080;&#20559;&#25928;&#24212;&#20272;&#35745;&#12290;&#25105;&#20204;&#30340;&#32467;&#26524;&#34920;&#26126;&#65292;&#23545;&#20110;&#20381;&#36182;&#24615;&#23601;&#19994;&#26377;&#30528;&#23567;&#24133;&#30340;&#36127;&#38754;&#24433;&#21709;&#65288;0.5%&#65289;&#65292;&#23545;&#20110;&#21463;&#31038;&#20250;&#20445;&#38505;&#32564;&#32435;&#30340;&#23601;&#19994;&#27809;&#26377;&#26126;&#26174;&#24433;&#21709;&#65292;&#23545;&#20110;&#26368;&#20302;&#24037;&#36164;&#30340;&#36127;&#38754;&#24433;&#21709;&#32422;&#20026;2.4%&#12290;
&lt;/p&gt;
&lt;p&gt;
We study the long-term effects of the 2015 German minimum wage introduction and its subsequent increases on regional employment. Using data from two waves of the Structure of Earnings Survey allows us to estimate models that account for changes in the minimum wage bite over time. While the introduction mainly affected the labour market in East Germany, the raises are also increasingly affecting low-wage regions in West Germany, such that around one third of regions have changed their (binary) treatment status over time. We apply different specifications and extensions of the classic difference-in-differences approach as well as a set of new estimators that enables for unbiased effect estimation with a staggered treatment adoption and heterogeneous treatment effects. Our results indicate a small negative effect on dependent employment of 0.5 percent, no significant effect on employment subject to social security contributions, and a significant negative effect of about 2.4 percent on ma
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#26032;&#30340;&#27169;&#22411;&#26469;&#35780;&#20272;&#20010;&#20307;&#23567;&#35268;&#27169;&#28909;&#27893;&#21644;&#22823;&#35268;&#27169;&#30005;&#33021;&#36716;&#28909;&#31995;&#32479;&#30340;&#32593;&#26684;&#24863;&#30693;&#36816;&#34892;&#65292;&#24182;&#25506;&#35752;&#20102;&#24377;&#24615;&#20379;&#26262;&#31995;&#32479;&#23545;&#36755;&#30005;&#32593;&#25317;&#22622;&#31649;&#29702;&#30340;&#36129;&#29486;&#12290;&#30740;&#31350;&#32467;&#26524;&#26174;&#31034;&#65292;&#36890;&#36807;&#25972;&#21512;&#24377;&#24615;&#20379;&#26262;&#31995;&#32479;&#65292;&#21487;&#23454;&#29616;&#20943;&#23569;&#24120;&#35268;&#37325;&#35843;&#24230;&#37327;&#21644;&#21487;&#20877;&#29983;&#33021;&#28304;&#21066;&#20943;&#37327;&#65292;&#33410;&#30465;&#25104;&#26412;&#32422;6%&#12290;&#22823;&#35268;&#27169;PtH&#21333;&#20803;&#32467;&#21512;&#28909;&#33021;&#20648;&#23384;&#24212;&#29992;&#23545;&#20110;&#25317;&#22622;&#31649;&#29702;&#20855;&#26377;&#37325;&#35201;&#24847;&#20041;&#12290;</title><link>http://arxiv.org/abs/2310.15933</link><description>&lt;p&gt;
&#24377;&#24615;&#20379;&#26262;&#31995;&#32479;&#23545;&#36755;&#30005;&#32593;&#25317;&#22622;&#31649;&#29702;&#30340;&#24314;&#27169;&#19982;&#36129;&#29486;
&lt;/p&gt;
&lt;p&gt;
Modeling and Contribution of Flexible Heating Systems for Transmission Grid Congestion Management. (arXiv:2310.15933v1 [eess.SY])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.15933
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#26032;&#30340;&#27169;&#22411;&#26469;&#35780;&#20272;&#20010;&#20307;&#23567;&#35268;&#27169;&#28909;&#27893;&#21644;&#22823;&#35268;&#27169;&#30005;&#33021;&#36716;&#28909;&#31995;&#32479;&#30340;&#32593;&#26684;&#24863;&#30693;&#36816;&#34892;&#65292;&#24182;&#25506;&#35752;&#20102;&#24377;&#24615;&#20379;&#26262;&#31995;&#32479;&#23545;&#36755;&#30005;&#32593;&#25317;&#22622;&#31649;&#29702;&#30340;&#36129;&#29486;&#12290;&#30740;&#31350;&#32467;&#26524;&#26174;&#31034;&#65292;&#36890;&#36807;&#25972;&#21512;&#24377;&#24615;&#20379;&#26262;&#31995;&#32479;&#65292;&#21487;&#23454;&#29616;&#20943;&#23569;&#24120;&#35268;&#37325;&#35843;&#24230;&#37327;&#21644;&#21487;&#20877;&#29983;&#33021;&#28304;&#21066;&#20943;&#37327;&#65292;&#33410;&#30465;&#25104;&#26412;&#32422;6%&#12290;&#22823;&#35268;&#27169;PtH&#21333;&#20803;&#32467;&#21512;&#28909;&#33021;&#20648;&#23384;&#24212;&#29992;&#23545;&#20110;&#25317;&#22622;&#31649;&#29702;&#20855;&#26377;&#37325;&#35201;&#24847;&#20041;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#27431;&#27954;&#30005;&#21147;&#24066;&#22330;&#20013;&#22823;&#35268;&#27169;&#25972;&#21512;&#24377;&#24615;&#20379;&#26262;&#31995;&#32479;&#23548;&#33268;&#20102;&#23545;&#27431;&#27954;&#36755;&#30005;&#32593;&#30340;&#36816;&#36755;&#38656;&#27714;&#22823;&#24133;&#22686;&#21152;&#65292;&#30001;&#27492;&#24341;&#36215;&#20102;&#22823;&#38470;&#36755;&#30005;&#32593;&#30340;&#25317;&#22622;&#38382;&#39064;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#23545;&#20010;&#20307;&#23567;&#35268;&#27169;&#28909;&#27893;&#21644;&#20301;&#20110;&#21306;&#22495;&#20379;&#28909;&#32593;&#32476;&#20013;&#30340;&#22823;&#35268;&#27169;&#30005;&#33021;&#36716;&#28909;&#31995;&#32479;&#65288;PtH&#65289;&#21333;&#20803;&#36827;&#34892;&#32593;&#26684;&#24863;&#30693;&#36816;&#34892;&#30340;&#26032;&#27169;&#22411;&#12290;&#36890;&#36807;&#23545;&#24503;&#22269;&#36755;&#30005;&#32593;2035&#24180;&#30340;&#30446;&#26631;&#36827;&#34892;&#27169;&#25311;&#35780;&#20272;&#65292;&#25506;&#35752;&#20102;&#24377;&#24615;&#20379;&#26262;&#31995;&#32479;&#23545;&#36755;&#30005;&#32593;&#25317;&#22622;&#31649;&#29702;&#30340;&#21151;&#33021;&#21644;&#36129;&#29486;&#12290;&#30740;&#31350;&#32467;&#26524;&#26174;&#31034;&#65292;&#22312;&#32593;&#26684;&#25317;&#22622;&#31649;&#29702;&#26041;&#26696;&#20013;&#25972;&#21512;&#24377;&#24615;&#20379;&#26262;&#31995;&#32479;&#33021;&#22815;&#38477;&#20302;&#24180;&#24230;&#24120;&#35268;&#37325;&#35843;&#24230;&#37327;&#21644;&#21487;&#20877;&#29983;&#33021;&#28304;&#65288;RES&#65289;&#21066;&#20943;&#37327;&#65292;&#20174;&#32780;&#33410;&#30465;&#32422;6%&#30340;&#25104;&#26412;&#12290;&#20998;&#26512;&#34920;&#26126;&#65292;&#23588;&#20854;&#26159;&#22823;&#35268;&#27169;PtH&#21333;&#20803;&#32467;&#21512;&#28909;&#33021;&#20648;&#23384;&#30340;&#24212;&#29992;&#23545;&#20110;&#25317;&#22622;&#31649;&#29702;&#20855;&#26377;&#37325;&#35201;&#24847;&#20041;&#12290;
&lt;/p&gt;
&lt;p&gt;
The large-scale integration of flexible heating systems in the European electricity market leads to a substantial increase of transportation requirements and consecutively grid congestions in the continental transmission grid. Novel model formulations for the grid-aware operation of both individual small-scale heat pumps and large-scale power-to-heat (PtH) units located in district heating networks are presented. The functionality of the models and the contribution of flexible heating systems for transmission grid congestion management is evaluated by running simulations for the target year 2035 for the German transmission grid. The findings show a decrease in annual conventional redispatch volumes and renewable energy sources (RES) curtailment resulting in cost savings of approximately 6 % through the integration of flexible heating systems in the grid congestion management scheme. The analysis suggests that especially large-scale PtH units in combination with thermal energy storages 
&lt;/p&gt;</description></item><item><title>&#20026;&#20102;&#35299;&#20915;&#20026;&#20309;&#20010;&#20307;&#22312;&#22810;&#20010;&#34892;&#20026;&#35268;&#21017;&#20013;&#36873;&#25321;&#29305;&#23450;&#35268;&#21017;&#30340;&#38382;&#39064;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#20010;&#21160;&#24577;&#31038;&#20250;&#23398;&#20064;&#26694;&#26550;&#65292;&#20854;&#20013;&#20010;&#20307;&#22522;&#20110;&#19968;&#33324;&#30340;&#32463;&#39564;&#35268;&#21017;&#24182;&#27169;&#20223;&#25104;&#21151;&#21516;&#20276;&#30340;&#34892;&#20026;&#35268;&#21017;&#12290;&#25105;&#20204;&#21457;&#29616;&#31038;&#20250;&#23398;&#20064;&#32467;&#26524;&#19981;&#20381;&#36182;&#20110;&#21021;&#22987;&#35268;&#21017;&#20998;&#24067;&#65292;&#24403;&#19968;&#20010;&#20027;&#23548;&#35268;&#21017;&#20135;&#29983;&#20986;&#20248;&#36234;&#32467;&#26524;&#26102;&#65292;&#20960;&#20046;&#32943;&#23450;&#20250;&#34987;&#25152;&#26377;&#20010;&#20307;&#37319;&#32435;&#65307;&#21542;&#21017;&#65292;&#36739;&#22909;&#35268;&#21017;&#20250;&#25104;&#20026;&#20849;&#35782;&#35268;&#21017;&#12290;&#22240;&#27492;&#65292;&#31038;&#20250;&#23398;&#20064;&#36807;&#31243;&#20013;&#36873;&#21462;&#30340;&#34892;&#20026;&#35268;&#21017;&#19981;&#19968;&#23450;&#33021;&#26368;&#22823;&#21270;&#31038;&#20250;&#31119;&#21033;&#12290;</title><link>http://arxiv.org/abs/2310.15861</link><description>&lt;p&gt;
&#31038;&#20250;&#23398;&#20064;&#30340;&#19968;&#33324;&#35268;&#21017;
&lt;/p&gt;
&lt;p&gt;
Social Learning of General Rules. (arXiv:2310.15861v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.15861
&lt;/p&gt;
&lt;p&gt;
&#20026;&#20102;&#35299;&#20915;&#20026;&#20309;&#20010;&#20307;&#22312;&#22810;&#20010;&#34892;&#20026;&#35268;&#21017;&#20013;&#36873;&#25321;&#29305;&#23450;&#35268;&#21017;&#30340;&#38382;&#39064;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#20010;&#21160;&#24577;&#31038;&#20250;&#23398;&#20064;&#26694;&#26550;&#65292;&#20854;&#20013;&#20010;&#20307;&#22522;&#20110;&#19968;&#33324;&#30340;&#32463;&#39564;&#35268;&#21017;&#24182;&#27169;&#20223;&#25104;&#21151;&#21516;&#20276;&#30340;&#34892;&#20026;&#35268;&#21017;&#12290;&#25105;&#20204;&#21457;&#29616;&#31038;&#20250;&#23398;&#20064;&#32467;&#26524;&#19981;&#20381;&#36182;&#20110;&#21021;&#22987;&#35268;&#21017;&#20998;&#24067;&#65292;&#24403;&#19968;&#20010;&#20027;&#23548;&#35268;&#21017;&#20135;&#29983;&#20986;&#20248;&#36234;&#32467;&#26524;&#26102;&#65292;&#20960;&#20046;&#32943;&#23450;&#20250;&#34987;&#25152;&#26377;&#20010;&#20307;&#37319;&#32435;&#65307;&#21542;&#21017;&#65292;&#36739;&#22909;&#35268;&#21017;&#20250;&#25104;&#20026;&#20849;&#35782;&#35268;&#21017;&#12290;&#22240;&#27492;&#65292;&#31038;&#20250;&#23398;&#20064;&#36807;&#31243;&#20013;&#36873;&#21462;&#30340;&#34892;&#20026;&#35268;&#21017;&#19981;&#19968;&#23450;&#33021;&#26368;&#22823;&#21270;&#31038;&#20250;&#31119;&#21033;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20026;&#20160;&#20040;&#22312;&#21487;&#33021;&#30340;&#22810;&#20010;&#34892;&#20026;&#35268;&#21017;&#20013;&#65292;&#20010;&#20307;&#20250;&#36873;&#25321;&#29305;&#23450;&#30340;&#19968;&#33324;&#34892;&#20026;&#35268;&#21017;&#65311;&#20026;&#20102;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#20010;&#21160;&#24577;&#31038;&#20250;&#23398;&#20064;&#26694;&#26550;&#65292;&#22312;&#36825;&#20010;&#26694;&#26550;&#20013;&#65292;&#20010;&#20307;&#20381;&#36182;&#20110;&#19968;&#33324;&#30340;&#32463;&#39564;&#20043;&#35268;&#24182;&#27169;&#20223;&#25104;&#21151;&#30340;&#21516;&#20276;&#30340;&#34892;&#20026;&#35268;&#21017;&#12290;&#25105;&#20204;&#21457;&#29616;&#31038;&#20250;&#23398;&#20064;&#30340;&#32467;&#26524;&#21487;&#20197;&#29420;&#31435;&#20110;&#21021;&#22987;&#35268;&#21017;&#20998;&#24067;&#36827;&#34892;&#25551;&#36848;&#12290;&#24403;&#19968;&#20010;&#20027;&#23548;&#30340;&#19968;&#33324;&#35268;&#21017;&#22987;&#32456;&#20135;&#29983;&#20986;&#20248;&#36234;&#30340;&#38382;&#39064;&#29305;&#23450;&#32467;&#26524;&#26102;&#65292;&#31038;&#20250;&#23398;&#20064;&#20960;&#20046;&#32943;&#23450;&#20250;&#23548;&#33268;&#25152;&#26377;&#20010;&#20307;&#37319;&#32435;&#36825;&#20010;&#20027;&#23548;&#35268;&#21017;&#65307;&#21542;&#21017;&#65292;&#21482;&#35201;&#20154;&#21475;&#36275;&#22815;&#22823;&#65292;&#26356;&#39057;&#32321;&#38382;&#39064;&#30340;&#36739;&#22909;&#35268;&#21017;&#20250;&#20197;&#20219;&#24847;&#39640;&#30340;&#27010;&#29575;&#25104;&#20026;&#20849;&#35782;&#35268;&#21017;&#12290;&#22240;&#27492;&#65292;&#22312;&#31038;&#20250;&#23398;&#20064;&#36807;&#31243;&#20013;&#36873;&#25321;&#30340;&#34892;&#20026;&#35268;&#21017;&#19981;&#19968;&#23450;&#33021;&#26368;&#22823;&#21270;&#31038;&#20250;&#31119;&#21033;&#12290;&#25105;&#20204;&#36890;&#36807;&#22312;&#38543;&#26426;&#29983;&#20135;&#24066;&#22330;&#20013;&#24212;&#29992;&#24066;&#22330;&#24773;&#32490;&#36873;&#25321;&#26469;&#34917;&#20805;&#25105;&#20204;&#30340;&#29702;&#35770;&#20998;&#26512;&#12290;
&lt;/p&gt;
&lt;p&gt;
Why do agents adopt a particular general behavioral rule among a collection of possible alternatives? To address this question, we introduce a dynamic social learning framework, where agents rely on general rules of thumb and imitate the behavioral rules of successful peers. We find the social learning outcome can be characterized independent of the initial rule distribution. When one dominant general rule consistently yields superior problem-specific outcomes, social learning almost surely leads all agents to adopt this dominant rule; otherwise, provided the population is sufficiently large, the better rule for the more frequent problem becomes the consensus rule with arbitrarily high probability. As a result, the behavioral rule selected by the social learning process need not maximize social welfare. We complement our theoretical analysis with an application to the market sentiment selection in a stochastic production market.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#27979;&#35797;&#26041;&#27861;&#65292;&#26088;&#22312;&#35780;&#20272;Difference-in-Differences&#20272;&#35745;&#20013;&#8220;&#24179;&#34892;&#36235;&#21183;&#20551;&#35774;&#8221;&#30340;&#21512;&#29702;&#24615;&#65292;&#20174;&#32780;&#25552;&#39640;&#27835;&#30103;&#25928;&#26524;&#20272;&#35745;&#30340;&#21487;&#20449;&#24230;&#12290;</title><link>http://arxiv.org/abs/2310.15796</link><description>&lt;p&gt;
Difference-in-Differences&#20272;&#35745;&#20013;&#30340;&#21069;&#26399;&#36235;&#21183;&#31561;&#25928;&#24615;&#27979;&#35797;
&lt;/p&gt;
&lt;p&gt;
Testing for equivalence of pre-trends in Difference-in-Differences estimation. (arXiv:2310.15796v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.15796
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#27979;&#35797;&#26041;&#27861;&#65292;&#26088;&#22312;&#35780;&#20272;Difference-in-Differences&#20272;&#35745;&#20013;&#8220;&#24179;&#34892;&#36235;&#21183;&#20551;&#35774;&#8221;&#30340;&#21512;&#29702;&#24615;&#65292;&#20174;&#32780;&#25552;&#39640;&#27835;&#30103;&#25928;&#26524;&#20272;&#35745;&#30340;&#21487;&#20449;&#24230;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36890;&#24120;&#36890;&#36807;&#23545;&#21452;&#32452;&#24179;&#22343;&#32467;&#26524;&#30340;&#24046;&#24322;&#22312;&#27835;&#30103;&#21069;&#26102;&#38388;&#27573;&#20445;&#25345;&#24658;&#23450;&#30340;&#38646;&#20551;&#35774;&#36827;&#34892;&#27979;&#35797;&#26469;&#35780;&#20272;Difference-in-Differences&#20272;&#35745;&#20013;&#8220;&#24179;&#34892;&#36235;&#21183;&#20551;&#35774;&#8221;&#30340;&#21512;&#29702;&#24615;&#12290;&#28982;&#32780;&#65292;&#26410;&#33021;&#25298;&#32477;&#38646;&#20551;&#35774;&#24182;&#19981;&#24847;&#21619;&#30528;&#20004;&#32452;&#20043;&#38388;&#30340;&#26102;&#38388;&#36235;&#21183;&#27809;&#26377;&#24046;&#24322;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#31561;&#25928;&#24615;&#27979;&#35797;&#65292;&#20351;&#30740;&#31350;&#20154;&#21592;&#33021;&#22815;&#25214;&#21040;&#25903;&#25345;&#24179;&#34892;&#36235;&#21183;&#20551;&#35774;&#30340;&#35777;&#25454;&#65292;&#20174;&#32780;&#22686;&#21152;&#20182;&#20204;&#30340;&#27835;&#30103;&#25928;&#26524;&#20272;&#35745;&#30340;&#21487;&#20449;&#24230;&#12290;&#34429;&#28982;&#25105;&#20204;&#22312;&#26631;&#20934;&#30340;&#21452;&#21521;&#22266;&#23450;&#25928;&#24212;&#27169;&#22411;&#20013;&#23545;&#25105;&#20204;&#30340;&#27979;&#35797;&#36827;&#34892;&#20102;&#35299;&#37322;&#65292;&#20294;&#25105;&#20204;&#36824;&#35752;&#35770;&#20102;&#22312;&#26102;&#38388;&#20998;&#25955;&#30340;&#27835;&#30103;&#37319;&#29992;&#35774;&#32622;&#20013;&#30340;&#31616;&#21333;&#25193;&#23637;&#12290;
&lt;/p&gt;
&lt;p&gt;
The plausibility of the ``parallel trends assumption'' in Difference-in-Differences estimation is usually assessed by a test of the null hypothesis that the difference between the average outcomes of both groups is constant over time before the treatment. However, failure to reject the null hypothesis does not imply the absence of differences in time trends between both groups. We provide equivalence tests that allow researchers to find evidence in favor of the parallel trends assumption and thus increase the credibility of their treatment effect estimates. While we motivate our tests in the standard two-way fixed effects model, we discuss simple extensions to settings in which treatment adoption is staggered over time.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#19968;&#20010;&#26631;&#20934;&#30340;&#27809;&#26377;&#29983;&#20135;&#30340;&#37325;&#21472;&#19990;&#20195;&#27169;&#22411;&#20013;&#30340;&#32463;&#27982;&#21160;&#21147;&#23398;&#65292;&#21033;&#29992;&#25968;&#20540;&#26041;&#27861;&#24471;&#21040;&#20102;&#23384;&#22312;&#25299;&#25169;&#28151;&#27788;&#30340;&#20805;&#35201;&#26465;&#20214;&#65292;&#36825;&#26159;&#23545;&#26368;&#26032;&#32467;&#26524;&#30340;&#26032;&#24212;&#29992;&#12290;</title><link>http://arxiv.org/abs/2310.15755</link><description>&lt;p&gt;
&#19968;&#20010;&#37325;&#21472;&#19990;&#20195;&#27169;&#22411;&#20013;&#28151;&#27788;&#21160;&#21147;&#23398;&#23384;&#22312;&#30340;&#20805;&#35201;&#26465;&#20214;
&lt;/p&gt;
&lt;p&gt;
A necessary and sufficient condition for the existence of chaotic dynamics in an overlapping generations model. (arXiv:2310.15755v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.15755
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#19968;&#20010;&#26631;&#20934;&#30340;&#27809;&#26377;&#29983;&#20135;&#30340;&#37325;&#21472;&#19990;&#20195;&#27169;&#22411;&#20013;&#30340;&#32463;&#27982;&#21160;&#21147;&#23398;&#65292;&#21033;&#29992;&#25968;&#20540;&#26041;&#27861;&#24471;&#21040;&#20102;&#23384;&#22312;&#25299;&#25169;&#28151;&#27788;&#30340;&#20805;&#35201;&#26465;&#20214;&#65292;&#36825;&#26159;&#23545;&#26368;&#26032;&#32467;&#26524;&#30340;&#26032;&#24212;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#19968;&#20010;&#27809;&#26377;&#29983;&#20135;&#30340;&#26631;&#20934;&#37325;&#21472;&#19990;&#20195;&#27169;&#22411;&#20013;&#30340;&#32463;&#27982;&#21160;&#21147;&#23398;&#12290;&#29305;&#21035;&#22320;&#65292;&#21033;&#29992;&#25968;&#20540;&#26041;&#27861;&#65292;&#25105;&#20204;&#24471;&#21040;&#20102;&#23384;&#22312;&#25299;&#25169;&#28151;&#27788;&#30340;&#20805;&#35201;&#26465;&#20214;&#12290;&#36825;&#26159;&#23545;Deng&#12289;Khan&#12289;Mitra(2022)&#20851;&#20110;&#21333;&#23792;&#21306;&#38388;&#26144;&#23556;&#23384;&#22312;&#25299;&#25169;&#28151;&#27788;&#24615;&#36136;&#30340;&#26368;&#26032;&#32467;&#26524;&#30340;&#26032;&#24212;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this paper, we study economic dynamics in a standard overlapping generations model without production. In particular, using numerical methods, we obtain a necessary and sufficient condition for the existence of a topological chaos. This is a new application of a recent result characterising the existence of a topological chaos for a unimodal interval map by Deng, Khan, Mitra (2022).
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#27604;&#36739;&#20102;&#22312;&#20303;&#25151;&#25237;&#36164;&#19981;&#21487;&#36870;&#30340;&#24773;&#20917;&#19979;&#65292;&#30899;&#23450;&#20215;&#21644;&#34917;&#36148;&#25913;&#36896;&#20004;&#31181;&#20943;&#25490;&#25919;&#31574;&#30340;&#25928;&#26524;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#34429;&#28982;&#34917;&#36148;&#25913;&#36896;&#23545;&#23621;&#27665;&#23478;&#24237;&#26469;&#35828;&#30452;&#25509;&#25104;&#26412;&#26368;&#20302;&#65292;&#20294;&#26368;&#32456;&#23548;&#33268;&#30340;&#24635;&#25104;&#26412;&#26368;&#39640;&#65292;&#19988;&#26080;&#27861;&#26377;&#25928;&#38477;&#20302;&#30899;&#25490;&#25918;&#12290;&#30456;&#27604;&#20043;&#19979;&#65292;&#20998;&#38454;&#27573;&#30340;&#30899;&#23450;&#20215;&#34920;&#29616;&#26356;&#22909;&#12290;</title><link>http://arxiv.org/abs/2310.15687</link><description>&lt;p&gt;
&#20943;&#23569;&#23621;&#27665;&#25490;&#25918;: &#30899;&#23450;&#20215;VS&#34917;&#36148;&#25913;&#36896;
&lt;/p&gt;
&lt;p&gt;
Reducing residential emissions: carbon pricing vs. subsidizing retrofits. (arXiv:2310.15687v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.15687
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#27604;&#36739;&#20102;&#22312;&#20303;&#25151;&#25237;&#36164;&#19981;&#21487;&#36870;&#30340;&#24773;&#20917;&#19979;&#65292;&#30899;&#23450;&#20215;&#21644;&#34917;&#36148;&#25913;&#36896;&#20004;&#31181;&#20943;&#25490;&#25919;&#31574;&#30340;&#25928;&#26524;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#34429;&#28982;&#34917;&#36148;&#25913;&#36896;&#23545;&#23621;&#27665;&#23478;&#24237;&#26469;&#35828;&#30452;&#25509;&#25104;&#26412;&#26368;&#20302;&#65292;&#20294;&#26368;&#32456;&#23548;&#33268;&#30340;&#24635;&#25104;&#26412;&#26368;&#39640;&#65292;&#19988;&#26080;&#27861;&#26377;&#25928;&#38477;&#20302;&#30899;&#25490;&#25918;&#12290;&#30456;&#27604;&#20043;&#19979;&#65292;&#20998;&#38454;&#27573;&#30340;&#30899;&#23450;&#20215;&#34920;&#29616;&#26356;&#22909;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#27604;&#36739;&#20102;&#22312;&#20303;&#25151;&#25237;&#36164;&#19981;&#21487;&#36870;&#30340;&#24773;&#20917;&#19979;&#19981;&#21516;&#30340;&#20943;&#32531;&#25919;&#31574;&#12290;&#25105;&#20204;&#20351;&#29992;&#19968;&#20010;&#38750;&#21516;&#36136;&#21270;&#20559;&#22909;&#21644;&#35814;&#32454;&#35774;&#32622;&#30340;&#23621;&#27665;&#20303;&#25151;&#21644;&#33021;&#28304;&#29983;&#20135;&#37096;&#38376;&#30340;&#19968;&#33324;&#22343;&#34913;&#27169;&#22411;&#12290;&#22312;&#26368;&#20248;&#30899;&#31246;&#19981;&#21487;&#29992;&#26102;&#65292;&#33021;&#28304;&#38656;&#27714;&#30340;&#20316;&#29992;&#21482;&#26159;&#27425;&#35201;&#30340;&#12290;&#34429;&#28982;&#20026;&#25913;&#36896;&#25552;&#20379;&#34917;&#36148;&#23545;&#23478;&#24237;&#26469;&#35828;&#26159;&#26368;&#20302;&#30340;&#30452;&#25509;&#25104;&#26412;&#65292;&#20294;&#26368;&#32456;&#20250;&#23548;&#33268;&#26368;&#39640;&#30340;&#24635;&#25104;&#26412;&#65292;&#24182;&#19988;&#34987;&#35777;&#26126;&#26159;&#19968;&#31181;&#26080;&#25928;&#30340;&#20943;&#30899;&#32463;&#27982;&#26041;&#24335;&#12290;&#22312;&#31532;&#20108;&#26368;&#20339;&#26465;&#20214;&#19979;&#65292;&#20998;&#38454;&#27573;&#30340;&#30899;&#23450;&#20215;&#34920;&#29616;&#20248;&#20110;&#22522;&#20110;&#34917;&#36148;&#30340;&#36807;&#28193;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this paper, we compare different mitigation policies when housing investments are irreversible. We use a general equilibrium model with non-homothetic preferences and an elaborate setup of the residential housing and energy production sector. In the first-best transition, the energy demand plays only a secondary role. However, this changes when optimal carbon taxes are not available. While providing subsidies for retrofits results in the lowest direct costs for households, it ultimately leads to the highest aggregate costs and proves to be an ineffective way to decarbonize the economy. In the second-best context, a phased-in carbon price outperforms the subsidy-based transition.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#31561;&#32423;&#22238;&#24402;&#20013;&#24120;&#29992;&#30340;&#26041;&#24046;&#20272;&#35745;&#22120;&#22312;&#20272;&#35745;OLS&#20272;&#35745;&#22120;&#30340;&#28176;&#36827;&#26041;&#24046;&#26102;&#30340;&#19981;&#19968;&#33268;&#24615;&#38382;&#39064;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#19968;&#33268;&#20272;&#35745;&#22120;&#12290;&#24212;&#29992;&#26032;&#30340;&#25512;&#35770;&#26041;&#27861;&#22312;&#19977;&#20010;&#32463;&#39564;&#30740;&#31350;&#20013;&#21457;&#29616;&#65292;&#22522;&#20110;&#27491;&#30830;&#26041;&#24046;&#30340;&#20272;&#35745;&#22120;&#30340;&#32622;&#20449;&#21306;&#38388;&#21487;&#33021;&#27424;&#31934;&#30830;&#12290;</title><link>http://arxiv.org/abs/2310.15512</link><description>&lt;p&gt;
&#25512;&#35770;&#29992;&#20110;&#31561;&#32423;&#22238;&#24402;
&lt;/p&gt;
&lt;p&gt;
Inference for Rank-Rank Regressions. (arXiv:2310.15512v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.15512
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#31561;&#32423;&#22238;&#24402;&#20013;&#24120;&#29992;&#30340;&#26041;&#24046;&#20272;&#35745;&#22120;&#22312;&#20272;&#35745;OLS&#20272;&#35745;&#22120;&#30340;&#28176;&#36827;&#26041;&#24046;&#26102;&#30340;&#19981;&#19968;&#33268;&#24615;&#38382;&#39064;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#19968;&#33268;&#20272;&#35745;&#22120;&#12290;&#24212;&#29992;&#26032;&#30340;&#25512;&#35770;&#26041;&#27861;&#22312;&#19977;&#20010;&#32463;&#39564;&#30740;&#31350;&#20013;&#21457;&#29616;&#65292;&#22522;&#20110;&#27491;&#30830;&#26041;&#24046;&#30340;&#20272;&#35745;&#22120;&#30340;&#32622;&#20449;&#21306;&#38388;&#21487;&#33021;&#27424;&#31934;&#30830;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#31561;&#32423;&#22238;&#24402;&#20013;&#65292;&#26012;&#29575;&#31995;&#25968;&#26159;&#34913;&#37327;&#20195;&#38469;&#27969;&#21160;&#24615;&#30340;&#24120;&#29992;&#25351;&#26631;&#65292;&#20363;&#22914;&#22312;&#23376;&#22899;&#25910;&#20837;&#31561;&#32423;&#19982;&#29238;&#27597;&#25910;&#20837;&#31561;&#32423;&#22238;&#24402;&#20013;&#12290;&#26412;&#25991;&#39318;&#20808;&#25351;&#20986;&#65292;&#24120;&#29992;&#30340;&#26041;&#24046;&#20272;&#35745;&#22120;&#22914;&#21516;&#26041;&#24046;&#20272;&#35745;&#22120;&#25110;&#40065;&#26834;&#26041;&#24046;&#20272;&#35745;&#22120;&#26410;&#33021;&#19968;&#33268;&#20272;&#35745;OLS&#20272;&#35745;&#22120;&#22312;&#31561;&#32423;&#22238;&#24402;&#20013;&#30340;&#28176;&#36827;&#26041;&#24046;&#12290;&#25105;&#20204;&#34920;&#26126;&#65292;&#36825;&#20123;&#20272;&#35745;&#22120;&#30340;&#27010;&#29575;&#26497;&#38480;&#21487;&#33021;&#36807;&#22823;&#25110;&#36807;&#23567;&#65292;&#21462;&#20915;&#20110;&#23376;&#22899;&#25910;&#20837;&#21644;&#29238;&#27597;&#25910;&#20837;&#30340;&#32852;&#21512;&#20998;&#24067;&#20989;&#25968;&#30340;&#24418;&#29366;&#12290;&#20854;&#27425;&#65292;&#25105;&#20204;&#23548;&#20986;&#20102;&#31561;&#32423;&#22238;&#24402;&#30340;&#19968;&#33324;&#28176;&#36827;&#29702;&#35770;&#65292;&#24182;&#25552;&#20379;&#20102;OLS&#20272;&#35745;&#22120;&#28176;&#36827;&#26041;&#24046;&#30340;&#19968;&#33268;&#20272;&#35745;&#22120;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#23558;&#28176;&#36827;&#29702;&#35770;&#25193;&#23637;&#21040;&#20854;&#20182;&#32463;&#39564;&#24037;&#20316;&#20013;&#28041;&#21450;&#31561;&#32423;&#30340;&#22238;&#24402;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#23558;&#26032;&#30340;&#25512;&#35770;&#26041;&#27861;&#24212;&#29992;&#20110;&#19977;&#20010;&#32463;&#39564;&#30740;&#31350;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#22522;&#20110;&#27491;&#30830;&#26041;&#24046;&#30340;&#20272;&#35745;&#22120;&#30340;&#32622;&#20449;&#21306;&#38388;&#26377;&#26102;&#21487;&#33021;&#27424;&#31934;&#30830;&#12290;
&lt;/p&gt;
&lt;p&gt;
Slope coefficients in rank-rank regressions are popular measures of intergenerational mobility, for instance in regressions of a child's income rank on their parent's income rank. In this paper, we first point out that commonly used variance estimators such as the homoskedastic or robust variance estimators do not consistently estimate the asymptotic variance of the OLS estimator in a rank-rank regression. We show that the probability limits of these estimators may be too large or too small depending on the shape of the copula of child and parent incomes. Second, we derive a general asymptotic theory for rank-rank regressions and provide a consistent estimator of the OLS estimator's asymptotic variance. We then extend the asymptotic theory to other regressions involving ranks that have been used in empirical work. Finally, we apply our new inference methods to three empirical studies. We find that the confidence intervals based on estimators of the correct variance may sometimes be sub
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#20010;&#26694;&#26550;&#65292;&#29992;&#20110;&#30830;&#23450;&#21738;&#20123;&#38382;&#39064;&#20250;&#20174;&#37327;&#23376;&#35745;&#31639;&#20013;&#21463;&#30410;&#12290;&#20998;&#26512;&#26174;&#31034;&#65292;&#35268;&#27169;&#36739;&#23567;&#19988;&#23545;&#20110;&#20856;&#22411;&#20225;&#19994;&#24456;&#37325;&#35201;&#30340;&#38382;&#39064;&#23558;&#19981;&#20250;&#21463;&#30410;&#65292;&#32780;&#35268;&#27169;&#36739;&#22823;&#25110;&#20855;&#26377;&#36739;&#22823;&#31639;&#27861;&#25910;&#30410;&#30340;&#38382;&#39064;&#23558;&#21463;&#30410;&#12290;</title><link>http://arxiv.org/abs/2310.15505</link><description>&lt;p&gt;
&#37327;&#23376;&#40863;&#21644;&#32463;&#20856;&#20820;&#65306;&#19968;&#20010;&#31616;&#21333;&#30340;&#26694;&#26550;&#65292;&#20197;&#29702;&#35299;&#37327;&#23376;&#35745;&#31639;&#20250;&#21152;&#24555;&#21738;&#20123;&#38382;&#39064;&#65288;&#20197;&#21450;&#19981;&#20250;&#21152;&#24555;&#21738;&#20123;&#38382;&#39064;&#65289;
&lt;/p&gt;
&lt;p&gt;
The Quantum Tortoise and the Classical Hare: A simple framework for understanding which problems quantum computing will accelerate (and which it will not). (arXiv:2310.15505v1 [cs.DS])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.15505
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#20010;&#26694;&#26550;&#65292;&#29992;&#20110;&#30830;&#23450;&#21738;&#20123;&#38382;&#39064;&#20250;&#20174;&#37327;&#23376;&#35745;&#31639;&#20013;&#21463;&#30410;&#12290;&#20998;&#26512;&#26174;&#31034;&#65292;&#35268;&#27169;&#36739;&#23567;&#19988;&#23545;&#20110;&#20856;&#22411;&#20225;&#19994;&#24456;&#37325;&#35201;&#30340;&#38382;&#39064;&#23558;&#19981;&#20250;&#21463;&#30410;&#65292;&#32780;&#35268;&#27169;&#36739;&#22823;&#25110;&#20855;&#26377;&#36739;&#22823;&#31639;&#27861;&#25910;&#30410;&#30340;&#38382;&#39064;&#23558;&#21463;&#30410;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#37327;&#23376;&#35745;&#31639;&#22312;&#35299;&#20915;&#19968;&#20123;&#38382;&#39064;&#26102;&#26377;&#24040;&#22823;&#28508;&#21147;&#65292;&#20294;&#23545;&#20854;&#20182;&#38382;&#39064;&#20960;&#20046;&#27809;&#26377;&#20219;&#20309;&#24110;&#21161;&#12290;&#23545;&#20110;&#24076;&#26395;&#29616;&#22312;&#25110;&#23558;&#26469;&#20351;&#29992;&#37327;&#23376;&#35745;&#31639;&#26426;&#30340;&#20154;&#26469;&#35828;&#65292;&#20102;&#35299;&#21738;&#20123;&#38382;&#39064;&#23558;&#20250;&#21463;&#30410;&#24456;&#37325;&#35201;&#12290;&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#20010;&#30452;&#35266;&#21644;&#23450;&#37327;&#22238;&#31572;&#36825;&#20010;&#38382;&#39064;&#30340;&#26694;&#26550;&#12290;&#35813;&#26694;&#26550;&#30340;&#22522;&#26412;&#32467;&#26500;&#26159;&#37327;&#23376;&#35745;&#31639;&#26426;&#21644;&#32463;&#20856;&#35745;&#31639;&#26426;&#20043;&#38388;&#30340;&#27604;&#36187;&#65292;&#23427;&#20204;&#30340;&#30456;&#23545;&#20248;&#21183;&#20915;&#23450;&#20102;&#35841;&#20250;&#32988;&#20986;&#12290;&#34429;&#28982;&#32463;&#20856;&#35745;&#31639;&#26426;&#36816;&#34892;&#36895;&#24230;&#26356;&#24555;&#65292;&#20294;&#37327;&#23376;&#35745;&#31639;&#26426;&#26377;&#26102;&#21487;&#20197;&#36816;&#34892;&#26356;&#39640;&#25928;&#30340;&#31639;&#27861;&#12290;&#36895;&#24230;&#20248;&#21183;&#36824;&#26159;&#31639;&#27861;&#20248;&#21183;&#30340;&#21344;&#20027;&#23548;&#22320;&#20301;&#23558;&#20915;&#23450;&#19968;&#20010;&#38382;&#39064;&#26159;&#21542;&#20250;&#20174;&#37327;&#23376;&#35745;&#31639;&#20013;&#21463;&#30410;&#12290;&#25105;&#20204;&#30340;&#20998;&#26512;&#26174;&#31034;&#65292;&#35768;&#22810;&#38382;&#39064;&#65292;&#29305;&#21035;&#26159;&#37027;&#20123;&#35268;&#27169;&#36739;&#23567;&#20294;&#23545;&#20110;&#20856;&#22411;&#20225;&#19994;&#24456;&#37325;&#35201;&#30340;&#38382;&#39064;&#65292;&#23558;&#19981;&#20250;&#20174;&#37327;&#23376;&#35745;&#31639;&#20013;&#21463;&#30410;&#12290;&#30456;&#21453;&#65292;&#35268;&#27169;&#36739;&#22823;&#25110;&#20855;&#26377;&#29305;&#21035;&#22823;&#30340;&#31639;&#27861;&#25910;&#30410;&#30340;&#38382;&#39064;&#23558;&#20250;&#20174;&#37327;&#23376;&#35745;&#31639;&#20013;&#21463;&#30410;&#12290;
&lt;/p&gt;
&lt;p&gt;
Quantum computing promises transformational gains for solving some problems, but little to none for others. For anyone hoping to use quantum computers now or in the future, it is important to know which problems will benefit. In this paper, we introduce a framework for answering this question both intuitively and quantitatively. The underlying structure of the framework is a race between quantum and classical computers, where their relative strengths determine when each wins. While classical computers operate faster, quantum computers can sometimes run more efficient algorithms. Whether the speed advantage or the algorithmic advantage dominates determines whether a problem will benefit from quantum computing or not. Our analysis reveals that many problems, particularly those of small to moderate size that can be important for typical businesses, will not benefit from quantum computing. Conversely, larger problems or those with particularly big algorithmic gains will benefit from near-t
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#21452;&#37325;&#31283;&#20581;&#20272;&#35745;&#22120;&#65292;&#20197;&#24212;&#23545;&#37051;&#23621;&#24178;&#25200;&#23545;&#20110;&#8220;&#21306;&#21035;&#20110;&#24046;&#20998;&#8221;&#31867;&#22411;&#30340;&#20272;&#35745;&#22120;&#25928;&#26524;&#30340;&#24433;&#21709;&#12290;&#22312;&#26412;&#25991;&#25552;&#20986;&#30340;&#26377;&#38480;&#20154;&#21475;&#35270;&#35282;&#19979;&#65292;&#21487;&#20197;&#22788;&#29702;&#30452;&#25509;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#20197;&#21450;&#24179;&#22343;&#28322;&#20986;&#25928;&#24212;&#65292;&#20855;&#26377;&#19968;&#23450;&#30340;&#30740;&#31350;&#20215;&#20540;&#12290;</title><link>http://arxiv.org/abs/2306.12003</link><description>&lt;p&gt;
&#21306;&#21035;&#20110;&#24046;&#20998;&#30340;&#24178;&#25200;&#25928;&#24212;&#65306;&#26377;&#38480;&#20154;&#21475;&#35270;&#35282;&#19979;&#30340;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Difference-in-Differences with Interference: A Finite Population Perspective. (arXiv:2306.12003v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.12003
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#21452;&#37325;&#31283;&#20581;&#20272;&#35745;&#22120;&#65292;&#20197;&#24212;&#23545;&#37051;&#23621;&#24178;&#25200;&#23545;&#20110;&#8220;&#21306;&#21035;&#20110;&#24046;&#20998;&#8221;&#31867;&#22411;&#30340;&#20272;&#35745;&#22120;&#25928;&#26524;&#30340;&#24433;&#21709;&#12290;&#22312;&#26412;&#25991;&#25552;&#20986;&#30340;&#26377;&#38480;&#20154;&#21475;&#35270;&#35282;&#19979;&#65292;&#21487;&#20197;&#22788;&#29702;&#30452;&#25509;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#20197;&#21450;&#24179;&#22343;&#28322;&#20986;&#25928;&#24212;&#65292;&#20855;&#26377;&#19968;&#23450;&#30340;&#30740;&#31350;&#20215;&#20540;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#35768;&#22810;&#24773;&#20917;&#19979;&#65292;&#22914;&#23545;&#22522;&#20110;&#22320;&#28857;&#30340;&#25919;&#31574;&#36827;&#34892;&#35780;&#20272;&#26102;&#65292;&#28508;&#22312;&#32467;&#26524;&#19981;&#20165;&#21462;&#20915;&#20110;&#21333;&#20301;&#26412;&#36523;&#30340;&#22788;&#29702;&#65292;&#36824;&#21462;&#20915;&#20110;&#20854;&#37051;&#23621;&#30340;&#22788;&#29702;&#12290;&#23613;&#31649;&#22914;&#27492;&#65292;&#8220;&#21306;&#21035;&#20110;&#24046;&#20998;&#8221;&#65288;DID&#65289;&#31867;&#22411;&#30340;&#20272;&#35745;&#22120;&#36890;&#24120;&#24573;&#30053;&#37051;&#23621;&#20043;&#38388;&#30340;&#24178;&#25200;&#12290;&#26412;&#25991;&#25351;&#20986;&#65292;&#22312;&#37051;&#23621;&#24178;&#25200;&#23384;&#22312;&#30340;&#24773;&#20917;&#19979;&#65292;&#32463;&#20856;&#30340;DID&#20272;&#35745;&#22120;&#36890;&#24120;&#26080;&#27861;&#35782;&#21035;&#26377;&#36259;&#30340;&#22240;&#26524;&#25928;&#24212;&#12290;&#20026;&#20102;&#23558;&#24178;&#25200;&#32467;&#26500;&#24341;&#20837;DID&#20272;&#35745;&#20013;&#65292;&#31508;&#32773;&#25552;&#20986;&#20102;&#21452;&#37325;&#31283;&#20581;&#20272;&#35745;&#22120;&#65292;&#29992;&#20110;&#22788;&#29702;&#30452;&#25509;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#20197;&#21450;&#25913;&#36827;&#21518;&#30340;&#24179;&#34892;&#36235;&#21183;&#20551;&#35774;&#19979;&#30340;&#24179;&#22343;&#28322;&#20986;&#25928;&#24212;&#12290;&#24403;&#38656;&#35201;&#32771;&#34385;&#28322;&#20986;&#25928;&#24212;&#26102;&#65292;&#36890;&#24120;&#20250;&#23545;&#25972;&#20010;&#20154;&#21475;&#36827;&#34892;&#25277;&#26679;&#12290;&#22240;&#27492;&#65292;&#26412;&#25991;&#37319;&#29992;&#20102;&#26377;&#38480;&#20154;&#21475;&#35270;&#35282;&#65292;&#21363;&#23558;&#20272;&#35745;&#37327;&#23450;&#20041;&#20026;&#20154;&#21475;&#24179;&#22343;&#20540;&#65292;&#24182;&#19988;&#25512;&#26029;&#26159;&#26377;&#26465;&#20214;&#30340;&#65292;&#22522;&#20110;&#25152;&#26377;&#20154;&#21475;&#21333;&#20301;&#30340;&#23646;&#24615;&#12290;&#26412;&#25991;&#25552;&#20986;&#30340;&#19968;&#33324;&#21644;&#32479;&#19968;&#30340;&#26041;&#27861;&#23558;&#24178;&#25200;&#25928;&#24212;&#32435;&#20837;&#21040;DID&#20272;&#35745;&#20013;&#65292;&#20855;&#26377;&#19968;&#23450;&#30340;&#30740;&#31350;&#20215;&#20540;&#12290;
&lt;/p&gt;
&lt;p&gt;
In many scenarios, such as the evaluation of place-based policies, potential outcomes are not only dependent upon the unit's own treatment but also its neighbors' treatment. In spite of this, the "difference-in-differences" (DID) type estimators typically ignore such interference among neighbors. I show in this paper that the canonical DID estimators generally do not identify interesting causal effects in the presence of neighborhood interference. To incorporate interference structure into DID estimation, I propose doubly robust estimators for the direct average treatment effect on the treated as well as the average spillover effects under a modified parallel trends assumption. When spillover effects are of interest, we often sample the entire population. Thus, I adopt a finite population perspective in the sense that the estimands are defined as population averages and inference is conditional on the attributes of all population units. The general and unified approach in this paper re
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#36890;&#29992;&#30340;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#65292;&#29992;&#20110;&#22312;&#38543;&#26426;&#23454;&#39564;&#20013;&#20272;&#31639;&#21644;&#25512;&#26029;&#24322;&#36136;&#24615;&#22788;&#29702;&#25928;&#24212;&#30340;&#20851;&#38190;&#29305;&#24449;&#65292;&#24182;&#23558;&#20854;&#24212;&#29992;&#20110;&#21360;&#24230;&#20813;&#30123;&#35745;&#21010;&#30340;&#25968;&#25454;&#20013;&#65292;&#33719;&#24471;&#26377;&#25928;&#25512;&#26029;&#32467;&#26524;&#12290;</title><link>http://arxiv.org/abs/1712.04802</link><description>&lt;p&gt;
Fischer-Schultz &#35762;&#24231;&#65306;&#38543;&#26426;&#23454;&#39564;&#20013;&#24322;&#36136;&#24615;&#22788;&#29702;&#25928;&#24212;&#30340;&#36890;&#29992;&#26426;&#22120;&#23398;&#20064;&#25512;&#26029;&#65292;&#20197;&#21360;&#24230;&#20813;&#30123;&#20026;&#20363;
&lt;/p&gt;
&lt;p&gt;
Fischer-Schultz Lecture: Generic Machine Learning Inference on Heterogenous Treatment Effects in Randomized Experiments, with an Application to Immunization in India. (arXiv:1712.04802v7 [stat.ML] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/1712.04802
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#36890;&#29992;&#30340;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#65292;&#29992;&#20110;&#22312;&#38543;&#26426;&#23454;&#39564;&#20013;&#20272;&#31639;&#21644;&#25512;&#26029;&#24322;&#36136;&#24615;&#22788;&#29702;&#25928;&#24212;&#30340;&#20851;&#38190;&#29305;&#24449;&#65292;&#24182;&#23558;&#20854;&#24212;&#29992;&#20110;&#21360;&#24230;&#20813;&#30123;&#35745;&#21010;&#30340;&#25968;&#25454;&#20013;&#65292;&#33719;&#24471;&#26377;&#25928;&#25512;&#26029;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#31574;&#30053;&#65292;&#29992;&#20110;&#22312;&#38543;&#26426;&#23454;&#39564;&#20013;&#20272;&#31639;&#21644;&#25512;&#26029;&#24322;&#36136;&#24615;&#25928;&#24212;&#30340;&#20851;&#38190;&#29305;&#24449;&#12290;&#36825;&#20123;&#20851;&#38190;&#29305;&#24449;&#21253;&#25324;&#20351;&#29992;&#26426;&#22120;&#23398;&#20064;&#20195;&#29702;&#30340;&#25928;&#24212;&#30340;&#26368;&#20339;&#32447;&#24615;&#39044;&#27979;&#22120;&#65292;&#25353;&#24433;&#21709;&#32452;&#25490;&#24207;&#30340;&#24179;&#22343;&#25928;&#24212;&#20197;&#21450;&#26368;&#21463;&#24433;&#21709;&#21333;&#20301;&#30340;&#24179;&#22343;&#29305;&#24449;&#21644;&#26368;&#19981;&#21463;&#24433;&#21709;&#30340;&#21333;&#20301;&#12290;&#35813;&#26041;&#27861;&#22312;&#39640;&#32500;&#35774;&#32622;&#20013;&#26377;&#25928;&#65292;&#20854;&#20013;&#25928;&#24212;&#30001;&#39044;&#27979;&#21644;&#22240;&#26524;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#36827;&#34892;&#20195;&#29702;&#65288;&#20294;&#19981;&#19968;&#23450;&#26159;&#19968;&#33268;&#20272;&#35745;&#30340;&#65289;&#12290;&#25105;&#20204;&#23558;&#36825;&#20123;&#20195;&#29702;&#21518;&#22788;&#29702;&#25104;&#20851;&#38190;&#29305;&#24449;&#30340;&#20272;&#35745;&#20540;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#26159;&#36890;&#29992;&#30340;&#65292;&#21487;&#20197;&#19982;&#26377;&#24809;&#32602;&#30340;&#26041;&#27861;&#65292;&#31070;&#32463;&#32593;&#32476;&#65292;&#38543;&#26426;&#26862;&#26519;&#65292;&#25552;&#21319;&#26641;&#21644;&#38598;&#25104;&#26041;&#27861;&#19968;&#36215;&#20351;&#29992;&#65292;&#26082;&#21487;&#20197;&#36827;&#34892;&#39044;&#27979;&#20063;&#21487;&#20197;&#36827;&#34892;&#22240;&#26524;&#20998;&#26512;&#12290;&#20272;&#35745;&#21644;&#25512;&#26029;&#22522;&#20110;&#37325;&#22797;&#25968;&#25454;&#20998;&#21106;&#65292;&#20197;&#36991;&#20813;&#36807;&#24230;&#25311;&#21512;&#24182;&#23454;&#29616;&#26377;&#25928;&#24615;&#12290;&#25105;&#20204;&#20351;&#29992;&#32467;&#26524;&#30340;&#20998;&#20301;&#32858;&#21512;&#26469;&#33258;&#35768;&#22810;&#28508;&#22312;&#30340;&#20998;&#21106;&#65292;&#29305;&#21035;&#26159;&#21462;p&#20540;&#30340;&#20013;&#20301;&#25968;&#21644;&#32622;&#20449;&#21306;&#38388;&#30340;&#20013;&#20301;&#25968;&#21644;&#20854;&#20182;&#20998;&#20301;&#25968;&#12290;&#25105;&#20204;&#23558;&#35813;&#26041;&#27861;&#24212;&#29992;&#20110;&#21360;&#24230;&#19968;&#39033;&#22823;&#22411;&#20813;&#30123;&#35745;&#21010;&#30340;&#25968;&#25454;&#20013;&#65292;&#20272;&#35745;&#20813;&#30123;&#23545;&#20799;&#31461;&#21457;&#30149;&#29575;&#21644;&#27515;&#20129;&#29575;&#30340;&#24433;&#21709;&#12290;&#25105;&#20204;&#30340;&#32467;&#26524;&#34920;&#26126;&#65292;&#25105;&#20204;&#30340;&#26041;&#27861;&#22312;&#39640;&#32500;&#24230;&#65292;&#24322;&#36136;&#24615;&#22788;&#29702;&#35774;&#32622;&#20013;&#20135;&#29983;&#26377;&#25928;&#30340;&#25512;&#26029;&#12290;
&lt;/p&gt;
&lt;p&gt;
We propose strategies to estimate and make inference on key features of heterogeneous effects in randomized experiments. These key features include best linear predictors of the effects using machine learning proxies, average effects sorted by impact groups, and average characteristics of most and least impacted units. The approach is valid in high dimensional settings, where the effects are proxied (but not necessarily consistently estimated) by predictive and causal machine learning methods. We post-process these proxies into estimates of the key features. Our approach is generic, it can be used in conjunction with penalized methods, neural networks, random forests, boosted trees, and ensemble methods, both predictive and causal. Estimation and inference are based on repeated data splitting to avoid overfitting and achieve validity. We use quantile aggregation of the results across many potential splits, in particular taking medians of p-values and medians and other quantiles of conf
&lt;/p&gt;</description></item></channel></rss>