<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#36890;&#36807;&#25552;&#20986;&#20855;&#26377;&#28789;&#27963;&#29256;&#31246;&#25903;&#20184;&#26426;&#21046;&#30340;&#35774;&#35745;&#65292;&#25105;&#20204;&#35299;&#20915;&#20102;&#35768;&#21487;&#35777;&#25293;&#21334;&#20013;&#30340;&#26368;&#20248;&#25293;&#21334;&#38382;&#39064;&#65292;&#36194;&#23478;&#25903;&#20184;&#32447;&#24615;&#29256;&#31246;&#30452;&#33267;&#19978;&#38480;&#65292;&#24182;&#21487;&#33021;&#25509;&#21463;&#23457;&#35745;&#12290;</title><link>https://arxiv.org/abs/2403.19945</link><description>&lt;p&gt;
&#20855;&#26377;&#28789;&#27963;&#29256;&#31246;&#25903;&#20184;&#30340;&#26368;&#20248;&#25293;&#21334;&#35774;&#35745;
&lt;/p&gt;
&lt;p&gt;
Optimal Auction Design with Flexible Royalty Payments
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.19945
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#25552;&#20986;&#20855;&#26377;&#28789;&#27963;&#29256;&#31246;&#25903;&#20184;&#26426;&#21046;&#30340;&#35774;&#35745;&#65292;&#25105;&#20204;&#35299;&#20915;&#20102;&#35768;&#21487;&#35777;&#25293;&#21334;&#20013;&#30340;&#26368;&#20248;&#25293;&#21334;&#38382;&#39064;&#65292;&#36194;&#23478;&#25903;&#20184;&#32447;&#24615;&#29256;&#31246;&#30452;&#33267;&#19978;&#38480;&#65292;&#24182;&#21487;&#33021;&#25509;&#21463;&#23457;&#35745;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#19968;&#31181;&#35768;&#21487;&#35777;&#25293;&#21334;&#30340;&#35774;&#35745;&#12290;&#27599;&#20010;&#21442;&#19982;&#32773;&#23545;&#33258;&#24049;&#36194;&#24471;&#35768;&#21487;&#35777;&#21518;&#26410;&#26469;&#21033;&#28070;&#30340;&#20449;&#21495;&#12290;&#22914;&#26524;&#35768;&#21487;&#35777;&#34987;&#20998;&#37197;&#65292;&#36194;&#23478;&#21487;&#20197;&#26681;&#25454;&#20182;&#25253;&#21578;&#30340;&#21033;&#28070;&#25903;&#20184;&#28789;&#27963;&#30340;&#29256;&#31246;&#12290;&#22996;&#25176;&#20154;&#21487;&#20197;&#23545;&#36194;&#23478;&#36827;&#34892;&#23457;&#35745;&#65292;&#36825;&#20250;&#20135;&#29983;&#25104;&#26412;&#65292;&#24182;&#23545;&#20854;&#25910;&#21462;&#26377;&#38480;&#30340;&#22788;&#32602;&#12290;&#25105;&#20204;&#20026;&#26368;&#22823;&#21270;&#25910;&#20837;&#20928;&#23457;&#35745;&#25104;&#26412;&#30340;&#25293;&#21334;&#38382;&#39064;&#36827;&#34892;&#20102;&#27714;&#35299;&#12290;&#22312;&#36825;&#20010;&#25293;&#21334;&#20013;&#65292;&#36194;&#23478;&#25903;&#20184;&#32447;&#24615;&#29256;&#31246;&#30452;&#33267;&#19978;&#38480;&#65292;&#36229;&#36807;&#19978;&#38480;&#21017;&#19981;&#20877;&#23457;&#35745;&#12290;&#19968;&#20010;&#26356;&#20048;&#35266;&#30340;&#25237;&#26631;&#32773;&#20250;&#25552;&#21069;&#25903;&#20184;&#26356;&#22810;&#36153;&#29992;&#20197;&#25442;&#21462;&#36739;&#20302;&#30340;&#29256;&#31246;&#19978;&#38480;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.19945v1 Announce Type: new  Abstract: We study the design of an auction for a license. Each agent has a signal about his future profit from winning the license. If the license is allocated, the winner can be charged a flexible royalty based on the profits he reports. The principal can audit the winner, at a cost, and charge limited penalties. We solve for the auction that maximizes revenue, net auditing costs. In this auction, the winner pays linear royalties up to a cap, beyond which there is no auditing. A more optimistic bidder pays more upfront in exchange for a lower royalty cap.
&lt;/p&gt;</description></item></channel></rss>