<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#28608;&#21169;&#20860;&#23481;&#19988;&#20010;&#20307;&#29702;&#24615;&#30340;vertiport&#39044;&#35746;&#26426;&#21046;&#65292;&#26088;&#22312;&#21327;&#35843;&#22810;&#20010;&#36816;&#33829;&#21830;&#25805;&#20316;&#30340;&#30005;&#21160;&#22402;&#30452;&#36215;&#38477;&#65288;eVTOL&#65289;&#39134;&#34892;&#22120;&#22312;vertiports&#20043;&#38388;&#31227;&#21160;&#65292;&#26368;&#22823;&#21270;&#25152;&#26377;&#36816;&#33829;&#21830;&#30340;&#24635;&#20272;&#20540;&#21516;&#26102;&#26368;&#23567;&#21270;vertiports&#30340;&#25317;&#22581;&#12290;</title><link>https://arxiv.org/abs/2403.18166</link><description>&lt;p&gt;
&#20855;&#26377;&#28608;&#21169;&#20860;&#23481;&#24615;&#30340;&#20808;&#36827;&#31354;&#20013;&#31227;&#21160;&#20013;&#30340;Vertiport&#39044;&#35746;&#65306;&#22522;&#20110;&#25293;&#21334;&#30340;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Incentive-Compatible Vertiport Reservation in Advanced Air Mobility: An Auction-Based Approach
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.18166
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#28608;&#21169;&#20860;&#23481;&#19988;&#20010;&#20307;&#29702;&#24615;&#30340;vertiport&#39044;&#35746;&#26426;&#21046;&#65292;&#26088;&#22312;&#21327;&#35843;&#22810;&#20010;&#36816;&#33829;&#21830;&#25805;&#20316;&#30340;&#30005;&#21160;&#22402;&#30452;&#36215;&#38477;&#65288;eVTOL&#65289;&#39134;&#34892;&#22120;&#22312;vertiports&#20043;&#38388;&#31227;&#21160;&#65292;&#26368;&#22823;&#21270;&#25152;&#26377;&#36816;&#33829;&#21830;&#30340;&#24635;&#20272;&#20540;&#21516;&#26102;&#26368;&#23567;&#21270;vertiports&#30340;&#25317;&#22581;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#39044;&#35745;&#26410;&#26469;&#20808;&#36827;&#31354;&#20013;&#31227;&#21160;&#65288;AAM&#65289;&#30340;&#23835;&#36215;&#23558;&#25104;&#20026;&#19968;&#20010;&#25968;&#21313;&#20159;&#32654;&#20803;&#30340;&#20135;&#19994;&#12290;&#24066;&#22330;&#26426;&#21046;&#34987;&#35748;&#20026;&#26159;AAM&#36816;&#33829;&#30340;&#19968;&#20010;&#37325;&#35201;&#32452;&#25104;&#37096;&#20998;&#65292;&#20854;&#20013;&#21253;&#25324;&#20855;&#26377;&#31169;&#20154;&#20272;&#20540;&#30340;&#24322;&#26500;&#36816;&#33829;&#21830;&#12290;&#26412;&#25991;&#30740;&#31350;&#20102;&#35774;&#35745;&#19968;&#31181;&#26426;&#21046;&#26469;&#21327;&#35843;&#30001;&#22810;&#20010;&#20855;&#26377;&#19982;&#20854;&#26426;&#32676;&#20851;&#32852;&#30340;&#24322;&#26500;&#20272;&#20540;&#30340;&#36816;&#33829;&#21830;&#25805;&#20316;&#30340;&#30005;&#21160;&#22402;&#30452;&#36215;&#38477;&#65288;eVTOL&#65289;&#39134;&#34892;&#22120;&#22312;vertiports&#20043;&#38388;&#31227;&#21160;&#30340;&#38382;&#39064;&#65292;&#21516;&#26102;&#24378;&#21046;&#25191;&#34892;vertiports&#30340;&#21040;&#36798;&#12289;&#31163;&#24320;&#21644;&#20572;&#36710;&#32422;&#26463;&#12290;&#29305;&#21035;&#26159;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#28608;&#21169;&#20860;&#23481;&#19988;&#20010;&#20307;&#29702;&#24615;&#30340;vertiport&#39044;&#35746;&#26426;&#21046;&#65292;&#35813;&#26426;&#21046;&#26368;&#22823;&#21270;&#20102;&#19968;&#20010;&#31038;&#20250;&#31119;&#21033;&#24230;&#37327;&#26631;&#20934;&#65292;&#20174;&#32780;&#21253;&#25324;&#26368;&#22823;&#21270;&#25152;&#26377;&#36816;&#33829;&#21830;&#30340;&#24635;&#20272;&#20540;&#21516;&#26102;&#26368;&#23567;&#21270;vertiports&#30340;&#25317;&#22581;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#25552;&#39640;&#20102;&#35774;&#35745;&#36825;&#19968;&#26426;&#21046;&#30340;&#35745;&#31639;&#21487;&#22788;&#29702;&#24615;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.18166v1 Announce Type: cross  Abstract: The rise of advanced air mobility (AAM) is expected to become a multibillion-dollar industry in the near future. Market-based mechanisms are touted to be an integral part of AAM operations, which comprise heterogeneous operators with private valuations. In this work, we study the problem of designing a mechanism to coordinate the movement of electric vertical take-off and landing (eVTOL) aircraft, operated by multiple operators each having heterogeneous valuations associated with their fleet, between vertiports, while enforcing the arrival, departure, and parking constraints at vertiports. Particularly, we propose an incentive-compatible and individually rational vertiport reservation mechanism that maximizes a social welfare metric, which encapsulates the objective of maximizing the overall valuations of all operators while minimizing the congestion at vertiports. Additionally, we improve the computational tractability of designing th
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#24320;&#21457;&#20102;&#19968;&#31181;&#26032;&#30340;&#35782;&#21035;&#31574;&#30053;&#65292;&#36890;&#36807;&#23558;&#24635;&#22788;&#29702;&#25928;&#24212;&#36827;&#34892;&#20998;&#35299;&#65292;&#23558;&#22797;&#26434;&#30340;&#20013;&#20171;&#38382;&#39064;&#36716;&#21270;&#20026;&#31616;&#21333;&#30340;&#32447;&#24615;&#22238;&#24402;&#38382;&#39064;&#65292;&#23454;&#29616;&#20102;&#22240;&#26524;&#25928;&#24212;&#21644;&#20013;&#20171;&#25928;&#24212;&#30340;&#21516;&#26102;&#20272;&#35745;&#65292;&#24314;&#31435;&#20102;&#26032;&#30340;&#22240;&#26524;&#20013;&#20171;&#21644;&#22240;&#26524;&#35843;&#33410;&#20043;&#38388;&#30340;&#32852;&#31995;&#12290;</title><link>https://arxiv.org/abs/2403.04131</link><description>&lt;p&gt;
&#20174;&#24322;&#36136;&#25928;&#24212;&#20013;&#25552;&#21462;&#26426;&#21046;&#65306;&#20013;&#20171;&#20998;&#26512;&#30340;&#35782;&#21035;&#31574;&#30053;
&lt;/p&gt;
&lt;p&gt;
Extract Mechanisms from Heterogeneous Effects: Identification Strategy for Mediation Analysis
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.04131
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#24320;&#21457;&#20102;&#19968;&#31181;&#26032;&#30340;&#35782;&#21035;&#31574;&#30053;&#65292;&#36890;&#36807;&#23558;&#24635;&#22788;&#29702;&#25928;&#24212;&#36827;&#34892;&#20998;&#35299;&#65292;&#23558;&#22797;&#26434;&#30340;&#20013;&#20171;&#38382;&#39064;&#36716;&#21270;&#20026;&#31616;&#21333;&#30340;&#32447;&#24615;&#22238;&#24402;&#38382;&#39064;&#65292;&#23454;&#29616;&#20102;&#22240;&#26524;&#25928;&#24212;&#21644;&#20013;&#20171;&#25928;&#24212;&#30340;&#21516;&#26102;&#20272;&#35745;&#65292;&#24314;&#31435;&#20102;&#26032;&#30340;&#22240;&#26524;&#20013;&#20171;&#21644;&#22240;&#26524;&#35843;&#33410;&#20043;&#38388;&#30340;&#32852;&#31995;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#29702;&#35299;&#22240;&#26524;&#26426;&#21046;&#23545;&#20110;&#35299;&#37322;&#21644;&#27010;&#25324;&#32463;&#39564;&#29616;&#35937;&#33267;&#20851;&#37325;&#35201;&#12290;&#22240;&#26524;&#20013;&#20171;&#20998;&#26512;&#25552;&#20379;&#20102;&#37327;&#21270;&#20013;&#20171;&#25928;&#24212;&#30340;&#32479;&#35745;&#25216;&#26415;&#12290;&#28982;&#32780;&#65292;&#29616;&#26377;&#26041;&#27861;&#36890;&#24120;&#38656;&#35201;&#24378;&#22823;&#30340;&#35782;&#21035;&#20551;&#35774;&#25110;&#22797;&#26434;&#30340;&#30740;&#31350;&#35774;&#35745;&#12290;&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#31181;&#26032;&#30340;&#35782;&#21035;&#31574;&#30053;&#65292;&#31616;&#21270;&#20102;&#36825;&#20123;&#20551;&#35774;&#65292;&#23454;&#29616;&#20102;&#22240;&#26524;&#25928;&#24212;&#21644;&#20013;&#20171;&#25928;&#24212;&#30340;&#21516;&#26102;&#20272;&#35745;&#12290;&#35813;&#31574;&#30053;&#22522;&#20110;&#24635;&#22788;&#29702;&#25928;&#24212;&#30340;&#26032;&#22411;&#20998;&#35299;&#65292;&#23558;&#20855;&#26377;&#25361;&#25112;&#24615;&#30340;&#20013;&#20171;&#38382;&#39064;&#36716;&#21270;&#20026;&#31616;&#21333;&#30340;&#32447;&#24615;&#22238;&#24402;&#38382;&#39064;&#12290;&#26032;&#26041;&#27861;&#24314;&#31435;&#20102;&#22240;&#26524;&#20013;&#20171;&#21644;&#22240;&#26524;&#35843;&#33410;&#20043;&#38388;&#30340;&#26032;&#32852;&#31995;&#12290;&#25105;&#20204;&#35752;&#35770;&#20102;&#20960;&#31181;&#30740;&#31350;&#35774;&#35745;&#21644;&#20272;&#35745;&#22120;&#65292;&#20197;&#22686;&#21152;&#25105;&#20204;&#30340;&#35782;&#21035;&#31574;&#30053;&#22312;&#21508;&#31181;&#23454;&#35777;&#30740;&#31350;&#20013;&#30340;&#21487;&#29992;&#24615;&#12290;&#25105;&#20204;&#36890;&#36807;&#22312;&#23454;&#39564;&#20013;&#20272;&#35745;&#22240;&#26524;&#20013;&#20171;&#25928;&#24212;&#26469;&#28436;&#31034;&#25105;&#20204;&#26041;&#27861;&#30340;&#24212;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.04131v1 Announce Type: cross  Abstract: Understanding causal mechanisms is essential for explaining and generalizing empirical phenomena. Causal mediation analysis offers statistical techniques to quantify mediation effects. However, existing methods typically require strong identification assumptions or sophisticated research designs. We develop a new identification strategy that simplifies these assumptions, enabling the simultaneous estimation of causal and mediation effects. The strategy is based on a novel decomposition of total treatment effects, which transforms the challenging mediation problem into a simple linear regression problem. The new method establishes a new link between causal mediation and causal moderation. We discuss several research designs and estimators to increase the usability of our identification strategy for a variety of empirical studies. We demonstrate the application of our method by estimating the causal mediation effect in experiments concer
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20379;&#20102;&#20851;&#20110;&#27668;&#20505;&#20914;&#20987;&#23545;&#20914;&#31361;&#30340;&#26032;&#35777;&#25454;&#65292;&#34920;&#26126;El Ni&#241;o&#20107;&#20214;&#23545;&#20892;&#20316;&#29289;&#29983;&#38271;&#23395;&#21644;&#37319;&#25688;&#21518;&#26399;&#30340;&#20892;&#30000;&#20013;&#30340;&#25919;&#27835;&#26292;&#21147;&#20855;&#26377;&#36127;&#38754;&#24433;&#21709;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#20013;&#24378;&#24230;El Ni&#241;o&#20107;&#20214;&#23548;&#33268;&#30340;&#28023;&#38754;&#28201;&#24230;&#19978;&#21319;1&#176;C&#23558;&#33267;&#23569;&#20943;&#23569;&#19977;&#20010;&#30334;&#20998;&#28857;&#30340;&#25919;&#27835;&#26292;&#21147;&#19982;&#38024;&#23545;&#24179;&#27665;&#30340;&#20914;&#31361;&#12290;&#36825;&#19968;&#21457;&#29616;&#25903;&#25345;&#20102;&#20892;&#19994;&#20316;&#20026;&#36830;&#25509;&#27668;&#20505;&#20914;&#20987;&#21644;&#25919;&#27835;&#26292;&#21147;&#20043;&#38388;&#20851;&#38190;&#36884;&#24452;&#30340;&#35266;&#28857;&#12290;</title><link>http://arxiv.org/abs/2311.16370</link><description>&lt;p&gt;
&#27668;&#20505;&#12289;&#20892;&#20316;&#29289;&#19982;&#37319;&#25688;&#21518;&#20914;&#31361;
&lt;/p&gt;
&lt;p&gt;
Climate, Crops, and Postharvest Conflict. (arXiv:2311.16370v3 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2311.16370
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20379;&#20102;&#20851;&#20110;&#27668;&#20505;&#20914;&#20987;&#23545;&#20914;&#31361;&#30340;&#26032;&#35777;&#25454;&#65292;&#34920;&#26126;El Ni&#241;o&#20107;&#20214;&#23545;&#20892;&#20316;&#29289;&#29983;&#38271;&#23395;&#21644;&#37319;&#25688;&#21518;&#26399;&#30340;&#20892;&#30000;&#20013;&#30340;&#25919;&#27835;&#26292;&#21147;&#20855;&#26377;&#36127;&#38754;&#24433;&#21709;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#20013;&#24378;&#24230;El Ni&#241;o&#20107;&#20214;&#23548;&#33268;&#30340;&#28023;&#38754;&#28201;&#24230;&#19978;&#21319;1&#176;C&#23558;&#33267;&#23569;&#20943;&#23569;&#19977;&#20010;&#30334;&#20998;&#28857;&#30340;&#25919;&#27835;&#26292;&#21147;&#19982;&#38024;&#23545;&#24179;&#27665;&#30340;&#20914;&#31361;&#12290;&#36825;&#19968;&#21457;&#29616;&#25903;&#25345;&#20102;&#20892;&#19994;&#20316;&#20026;&#36830;&#25509;&#27668;&#20505;&#20914;&#20987;&#21644;&#25919;&#27835;&#26292;&#21147;&#20043;&#38388;&#20851;&#38190;&#36884;&#24452;&#30340;&#35266;&#28857;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#25552;&#20986;&#20102;&#27668;&#20505;&#20914;&#20987;&#23545;&#20914;&#31361;&#30340;&#24433;&#21709;&#30340;&#26032;&#35777;&#25454;&#12290;&#21033;&#29992;&#35206;&#30422;1997&#24180;&#33267;2023&#24180;&#25972;&#20010;&#38750;&#27954;&#22823;&#38470;&#30340;&#35814;&#32454;&#20914;&#31361;&#21644;&#22825;&#27668;&#25968;&#25454;&#65292;&#25105;&#21457;&#29616;&#22312;&#20892;&#20316;&#29289;&#29983;&#38271;&#23395;&#36973;&#21463;El Ni&#241;o&#20107;&#20214;&#23545;&#22799;&#23395;&#37319;&#25688;&#21518;&#26399;&#20892;&#30000;&#30340;&#25919;&#27835;&#26292;&#21147;&#20855;&#26377;&#36127;&#24046;&#24322;&#25928;&#24212;&#12290;&#30456;&#23545;&#20110;&#38271;&#26399;&#22343;&#20540;&#65292;&#28909;&#24102;&#22826;&#24179;&#27915;&#28023;&#38754;&#28201;&#24230;&#19978;&#21319;1&#176;C&#65288;&#20856;&#22411;&#30340;&#20013;&#24378;&#24230;El Ni&#241;o&#20107;&#20214;&#30340;&#20195;&#34920;&#65289;&#33267;&#23569;&#23548;&#33268;&#25919;&#27835;&#26292;&#21147;&#19982;&#38024;&#23545;&#24179;&#27665;&#30340;&#20914;&#31361;&#20943;&#23569;&#19977;&#20010;&#30334;&#20998;&#28857;&#12290;&#36825;&#19968;&#20027;&#35201;&#21457;&#29616;&#36890;&#36807;&#19968;&#31995;&#21015;&#31283;&#20581;&#24615;&#26816;&#39564;&#24471;&#21040;&#25903;&#25345;&#65292;&#25903;&#25345;&#20102;&#20892;&#19994;&#26159;&#36830;&#25509;&#27668;&#20505;&#20914;&#20987;&#19982;&#25919;&#27835;&#26292;&#21147;&#20043;&#38388;&#30340;&#20851;&#38190;&#36884;&#24452;&#65292;&#32780;&#36138;&#23146;&#26159;&#20851;&#38190;&#21160;&#26426;&#12290;&#20196;&#20154;&#25918;&#24515;&#30340;&#26159;&#65292;&#24403;&#25105;&#20351;&#29992;&#26356;&#36866;&#21512;&#25581;&#31034;&#25552;&#20986;&#30340;&#26426;&#21046;&#30340;&#25968;&#25454;&#23376;&#38598;&#26102;&#65292;&#20272;&#35745;&#25928;&#24212;&#30340;&#24133;&#24230;&#20960;&#20046;&#32763;&#20102;&#19968;&#30058;&#65292;&#32780;&#36825;&#31181;&#25928;&#24212;&#20165;&#20165;&#23384;&#22312;&#20110;&#20892;&#20316;&#29289;&#29983;&#38271;&#23395;&#21644;&#22799;&#23395;&#37319;&#25688;&#21518;&#26399;&#30340;&#20892;&#30000;&#20013;&#12290;
&lt;/p&gt;
&lt;p&gt;
I present new evidence of the effects of climate shocks on conflict. Using granular conflict and weather data covering the entire continent of Africa from 1997 to 2023, I find that exposure to El Ni\~no events during the crop-growing season has a negative differential effect on political violence against civilians in croplands during the early postharvest season. A 1{\deg}C warming of the sea surface temperature in the tropical Pacific Ocean relative to its long-run mean, a typical proxy for a moderate-strength El Ni\~no event, results in at least a three percent reduction in political violence with civilian targeting. This main finding, backed by a series of robustness checks, supports the idea that agriculture is the key channel and rapacity is the key motive connecting climatic shocks and political violence. Reassuringly, the magnitude of the estimated effect nearly doubles when I use subsets of data that are better suited to unveiling the proposed mechanism, and the effect only man
&lt;/p&gt;</description></item><item><title>&#21512;&#29702;&#24573;&#35270;&#30340;&#32479;&#35745;&#27495;&#35270;&#27169;&#22411;&#30740;&#31350;&#20102;&#20449;&#24687;&#33719;&#21462;&#25104;&#26412;&#23545;&#22996;&#25176;&#20154;&#23545;&#24453;&#22810;&#25968;&#26063;&#32676;&#21644;&#23569;&#25968;&#26063;&#32676;&#19981;&#24179;&#31561;&#30340;&#24433;&#21709;&#65292;&#21457;&#29616;&#22810;&#25968;&#26063;&#32676;&#38754;&#20020;&#25237;&#36164;&#21160;&#21147;&#32780;&#23569;&#25968;&#26063;&#32676;&#34987;&#38459;&#30861;&#25237;&#36164;&#12290;&#32467;&#26524;&#23545;&#24179;&#26435;&#34892;&#21160;&#12289;&#38544;&#24615;&#20559;&#35265;&#12289;&#32844;&#19994;&#24615;&#21035;&#38548;&#31163;&#21644;&#21051;&#26495;&#21360;&#35937;&#30340;&#35752;&#35770;&#20855;&#26377;&#37325;&#35201;&#24847;&#20041;&#12290;</title><link>http://arxiv.org/abs/2212.08219</link><description>&lt;p&gt;
&#21512;&#29702;&#24573;&#35270;&#30340;&#32479;&#35745;&#27495;&#35270;&#65306;&#38463;&#32599;&#36935;&#35265;&#33778;&#23572;&#26222;&#26031;
&lt;/p&gt;
&lt;p&gt;
Rationally Inattentive Statistical Discrimination: Arrow Meets Phelps. (arXiv:2212.08219v2 [econ.TH] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2212.08219
&lt;/p&gt;
&lt;p&gt;
&#21512;&#29702;&#24573;&#35270;&#30340;&#32479;&#35745;&#27495;&#35270;&#27169;&#22411;&#30740;&#31350;&#20102;&#20449;&#24687;&#33719;&#21462;&#25104;&#26412;&#23545;&#22996;&#25176;&#20154;&#23545;&#24453;&#22810;&#25968;&#26063;&#32676;&#21644;&#23569;&#25968;&#26063;&#32676;&#19981;&#24179;&#31561;&#30340;&#24433;&#21709;&#65292;&#21457;&#29616;&#22810;&#25968;&#26063;&#32676;&#38754;&#20020;&#25237;&#36164;&#21160;&#21147;&#32780;&#23569;&#25968;&#26063;&#32676;&#34987;&#38459;&#30861;&#25237;&#36164;&#12290;&#32467;&#26524;&#23545;&#24179;&#26435;&#34892;&#21160;&#12289;&#38544;&#24615;&#20559;&#35265;&#12289;&#32844;&#19994;&#24615;&#21035;&#38548;&#31163;&#21644;&#21051;&#26495;&#21360;&#35937;&#30340;&#35752;&#35770;&#20855;&#26377;&#37325;&#35201;&#24847;&#20041;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24403;&#20449;&#24687;&#33719;&#21462;&#25104;&#26412;&#39640;&#20294;&#28789;&#27963;&#26102;&#65292;&#22996;&#25176;&#20154;&#21487;&#33021;&#20250;&#21512;&#29702;&#22320;&#33719;&#21462;&#26377;&#21033;&#20110;&#8220;&#22810;&#25968;&#26063;&#32676;&#8221;&#32780;&#19981;&#21033;&#20110;&#8220;&#23569;&#25968;&#26063;&#32676;&#8221;&#30340;&#20449;&#24687;&#65292;&#38500;&#38750;&#21518;&#32773;&#20005;&#26684;&#27604;&#21069;&#32773;&#26356;&#20855;&#29983;&#20135;&#21147;&#12290;&#22240;&#27492;&#65292;&#22810;&#25968;&#26063;&#32676;&#38754;&#20020;&#25237;&#36164;&#25104;&#20026;&#29983;&#20135;&#21147;&#30340;&#21160;&#21147;&#65292;&#32780;&#23569;&#25968;&#26063;&#32676;&#21017;&#34987;&#38459;&#30861;&#20102;&#36825;&#26679;&#30340;&#25237;&#36164;&#12290;&#19982;&#27492;&#21516;&#26102;&#65292;&#22996;&#25176;&#20154;&#23558;&#26377;&#38480;&#30340;&#27880;&#24847;&#36164;&#28304;&#38598;&#20013;&#22312;&#22810;&#25968;&#26063;&#32676;&#19978;&#65292;&#22240;&#20026;&#20182;&#20204;&#24456;&#21487;&#33021;&#36827;&#34892;&#25237;&#36164;&#12290;&#25105;&#20204;&#32473;&#20986;&#20102;&#22312;&#25152;&#26377;&#32676;&#20307;&#22312;&#20107;&#21069;&#26159;&#30456;&#21516;&#30340;&#24773;&#20917;&#19979;&#65292;&#23548;&#33268;&#27495;&#35270;&#24615;&#24179;&#34913;&#26368;&#21463;&#22996;&#25176;&#20154;&#38738;&#30544;&#30340;&#26465;&#20214;&#12290;&#25105;&#20204;&#30340;&#32467;&#26524;&#22686;&#21152;&#20102;&#23545;&#24179;&#26435;&#34892;&#21160;&#12289;&#38544;&#24615;&#20559;&#35265;&#12289;&#32844;&#19994;&#24615;&#21035;&#38548;&#31163;&#21644;&#21051;&#26495;&#21360;&#35937;&#30340;&#35752;&#35770;&#12290;
&lt;/p&gt;
&lt;p&gt;
When information acquisition is costly but flexible, a principal may rationally acquire information that favors ``majorities'' over ``minorities'' unless the latter are strictly more productive than the former. Majorities therefore face incentives to invest in becoming productive, whereas minorities are discouraged from such investments. The principal, in turn, focuses scarce attentional resources on majorities precisely because they are likely to invest. We give conditions under which the resulting discriminatory equilibrium is most preferred by the principal, despite that all groups are ex-ante identical. Our results add to the discussions of affirmative action, implicit bias, and occupational segregation and stereotypes.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#32593;&#32476;&#32467;&#26500;&#19979;&#27178;&#21521;&#21160;&#21147;&#23398;&#30340;&#26694;&#26550;&#65292;&#21487;&#20197;&#29992;&#20110;&#20272;&#35745;&#21160;&#24577;&#32593;&#32476;&#25928;&#24212;&#21644;&#24314;&#27169;&#38477;&#32500;&#31561;&#24212;&#29992;&#12290;&#31532;&#19968;&#27425;&#24212;&#29992;&#35813;&#26694;&#26550;&#26102;&#65292;&#20316;&#32773;&#20272;&#35745;&#20102;&#37096;&#38376;&#29983;&#20135;&#21147;&#20914;&#20987;&#22914;&#20309;&#27839;&#30528;&#20379;&#24212;&#38142;&#20256;&#36755;&#24182;&#24433;&#21709;&#32654;&#22269;&#32463;&#27982;&#20013;&#37096;&#38376;&#20215;&#26684;&#30340;&#21160;&#24577;&#12290;&#20998;&#26512;&#34920;&#26126;&#65292;&#32593;&#32476;&#20301;&#32622;&#19981;&#20165;&#21487;&#20197;&#35299;&#37322;&#32463;&#27982;&#21464;&#21270;&#30340;&#24378;&#24230;&#65292;&#36824;&#21487;&#20197;&#35299;&#37322;&#20379;&#24212;&#38142;&#30340;&#20316;&#29992;&#12290;</title><link>http://arxiv.org/abs/2211.13610</link><description>&lt;p&gt;
&#32593;&#32476;&#32467;&#26500;&#19979;&#30340;&#27178;&#21521;&#21160;&#21147;&#23398;: &#29702;&#35770;&#21450;&#20854;&#23439;&#35266;&#32463;&#27982;&#23398;&#24212;&#29992;
&lt;/p&gt;
&lt;p&gt;
Cross-Sectional Dynamics Under Network Structure: Theory and Macroeconomic Applications. (arXiv:2211.13610v2 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2211.13610
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#32593;&#32476;&#32467;&#26500;&#19979;&#27178;&#21521;&#21160;&#21147;&#23398;&#30340;&#26694;&#26550;&#65292;&#21487;&#20197;&#29992;&#20110;&#20272;&#35745;&#21160;&#24577;&#32593;&#32476;&#25928;&#24212;&#21644;&#24314;&#27169;&#38477;&#32500;&#31561;&#24212;&#29992;&#12290;&#31532;&#19968;&#27425;&#24212;&#29992;&#35813;&#26694;&#26550;&#26102;&#65292;&#20316;&#32773;&#20272;&#35745;&#20102;&#37096;&#38376;&#29983;&#20135;&#21147;&#20914;&#20987;&#22914;&#20309;&#27839;&#30528;&#20379;&#24212;&#38142;&#20256;&#36755;&#24182;&#24433;&#21709;&#32654;&#22269;&#32463;&#27982;&#20013;&#37096;&#38376;&#20215;&#26684;&#30340;&#21160;&#24577;&#12290;&#20998;&#26512;&#34920;&#26126;&#65292;&#32593;&#32476;&#20301;&#32622;&#19981;&#20165;&#21487;&#20197;&#35299;&#37322;&#32463;&#27982;&#21464;&#21270;&#30340;&#24378;&#24230;&#65292;&#36824;&#21487;&#20197;&#35299;&#37322;&#20379;&#24212;&#38142;&#30340;&#20316;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35768;&#22810;&#32463;&#27982;&#23398;&#39046;&#22495;&#37117;&#28041;&#21450;&#36890;&#36807;&#21452;&#36793;&#32852;&#31995;&#32852;&#31995;&#22312;&#19968;&#36215;&#30340;&#21333;&#20301;&#27178;&#21521;&#20999;&#38754;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#30740;&#31350;&#21033;&#29992;&#36825;&#31181;&#32593;&#32476;&#32467;&#26500;&#30740;&#31350;&#27178;&#21521;&#21464;&#37327;&#21160;&#24577;&#30340;&#26694;&#26550;&#12290;&#23427;&#26159;&#19968;&#20010;&#30690;&#37327;&#33258;&#22238;&#24402;&#65292;&#20854;&#20013;&#21019;&#26032;&#20165;&#36890;&#36807;&#21452;&#36793;&#32852;&#31995;&#22312;&#27178;&#21521;&#20256;&#36755;&#65292;&#24182;&#19988;&#21487;&#20197;&#23481;&#32435;&#32593;&#32476;&#25928;&#24212;&#30340;&#39640;&#38454;&#22914;&#20309;&#38543;&#26102;&#38388;&#32047;&#31215;&#30340;&#20016;&#23500;&#27169;&#24335;&#12290;&#35813;&#27169;&#22411;&#21487;&#29992;&#20110;&#20272;&#35745;&#21160;&#24577;&#32593;&#32476;&#25928;&#24212;&#65292;&#20854;&#20013;&#32593;&#32476;&#30001;&#25968;&#25454;&#20013;&#30340;&#21160;&#24577;&#20132;&#21449;&#30456;&#20851;&#24615;&#30830;&#23450;&#25110;&#25512;&#26029;&#12290;&#23427;&#36824;&#25552;&#20379;&#20102;&#19968;&#31181;&#24314;&#27169;(new_word)&#30340;&#38477;&#32500;&#25216;&#26415;&#65292;&#22240;&#20026;&#32593;&#32476;&#33021;&#22815;&#36890;&#36807;&#30456;&#23545;&#36739;&#23569;&#30340;&#38750;&#38646;&#21452;&#36793;&#38142;&#25509;&#27719;&#24635;&#21333;&#20301;&#20043;&#38388;&#30340;&#22797;&#26434;&#20851;&#31995;&#12290;
&lt;/p&gt;
&lt;p&gt;
Many environments in economics feature a cross-section of units linked by bilateral ties. I develop a framework for studying dynamics of cross-sectional variables exploiting this network structure. It is a vector autoregression in which innovations transmit cross-sectionally only via bilateral links and which can accommodate rich patterns of how network effects of higher order accumulate over time. The model can be used to estimate dynamic network effects, with the network given or inferred from dynamic cross-correlations in the data. It also offers a dimensionality-reduction technique for modeling (cross-sectional) processes, owing to networks' ability to summarize complex relations among units by relatively few non-zero bilateral links. In a first application, I estimate how sectoral productivity shocks transmit along supply chain linkages and affect dynamics of sectoral prices in the US economy. The analysis suggests that network positions can rationalize not only the strength of a 
&lt;/p&gt;</description></item></channel></rss>