<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#24179;&#21488;&#65292;&#21033;&#29992;&#21516;&#34892;&#39044;&#27979;&#31639;&#27861;&#22870;&#21169;&#35780;&#23457;&#20154;&#21592;&#65292;&#26088;&#22312;&#25913;&#21892;&#26089;&#26399;&#30740;&#31350;&#30340;&#21516;&#34892;&#35780;&#23457;&#65292;&#35299;&#20915;&#30740;&#31350;&#38382;&#39064;&#19982;&#20986;&#29256;&#20559;&#35265;&#20043;&#38388;&#30340;&#19981;&#21305;&#37197;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2303.16855</link><description>&lt;p&gt;
&#21516;&#34892;&#35780;&#23457;&#30340;&#21516;&#34892;&#39044;&#27979;&#65306;&#35774;&#35745;&#19968;&#20010;&#24819;&#27861;&#24066;&#22330;
&lt;/p&gt;
&lt;p&gt;
Peer Prediction for Peer Review: Designing a Marketplace for Ideas. (arXiv:2303.16855v1 [cs.DL])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.16855
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#24179;&#21488;&#65292;&#21033;&#29992;&#21516;&#34892;&#39044;&#27979;&#31639;&#27861;&#22870;&#21169;&#35780;&#23457;&#20154;&#21592;&#65292;&#26088;&#22312;&#25913;&#21892;&#26089;&#26399;&#30740;&#31350;&#30340;&#21516;&#34892;&#35780;&#23457;&#65292;&#35299;&#20915;&#30740;&#31350;&#38382;&#39064;&#19982;&#20986;&#29256;&#20559;&#35265;&#20043;&#38388;&#30340;&#19981;&#21305;&#37197;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25551;&#36848;&#20102;&#19968;&#20010;&#28508;&#22312;&#30340;&#24179;&#21488;&#65292;&#26088;&#22312;&#20419;&#36827;&#26089;&#26399;&#30740;&#31350;&#30340;&#23398;&#26415;&#21516;&#34892;&#35780;&#23457;&#12290;&#35813;&#24179;&#21488;&#26088;&#22312;&#36890;&#36807;&#22522;&#20110;&#21516;&#34892;&#39044;&#27979;&#31639;&#27861;&#23545;&#35780;&#23457;&#20154;&#21592;&#36827;&#34892;&#22870;&#21169;&#65292;&#20351;&#21516;&#34892;&#35780;&#23457;&#26356;&#21152;&#20934;&#30830;&#21644;&#21450;&#26102;&#12290;&#35813;&#31639;&#27861;&#20351;&#29992;&#23545;&#20247;&#21253;&#36827;&#34892;&#30340;Peer Truth Serum&#30340;&#21464;&#20307;&#65288;Radanovic&#31561;&#20154;&#65292;2016&#65289;&#65292;&#20854;&#20013;&#20154;&#31867;&#35780;&#20998;&#32773;&#19982;&#26426;&#22120;&#23398;&#20064;&#22522;&#20934;&#31454;&#20105;&#12290;&#25105;&#20204;&#35299;&#37322;&#20102;&#25105;&#20204;&#30340;&#26041;&#27861;&#22914;&#20309;&#35299;&#20915;&#31185;&#23398;&#20013;&#30340;&#20004;&#20010;&#22823;&#30340;&#20302;&#25928;&#38382;&#39064;&#65306;&#30740;&#31350;&#38382;&#39064;&#19982;&#20986;&#29256;&#20559;&#35265;&#20043;&#38388;&#30340;&#19981;&#21305;&#37197;&#12290;&#26356;&#22909;&#30340;&#26089;&#26399;&#30740;&#31350;&#21516;&#34892;&#35780;&#23457;&#20026;&#20998;&#20139;&#30740;&#31350;&#25104;&#26524;&#21019;&#36896;&#20102;&#39069;&#22806;&#30340;&#28608;&#21169;&#65292;&#31616;&#21270;&#20102;&#23558;&#24819;&#27861;&#21305;&#37197;&#21040;&#22242;&#38431;&#65292;&#24182;&#20351;&#36127;&#38754;&#32467;&#26524;&#21644;p-hacking&#26356;&#21152;&#26126;&#26174;&#12290;
&lt;/p&gt;
&lt;p&gt;
The paper describes a potential platform to facilitate academic peer review with emphasis on early-stage research. This platform aims to make peer review more accurate and timely by rewarding reviewers on the basis of peer prediction algorithms. The algorithm uses a variation of Peer Truth Serum for Crowdsourcing (Radanovic et al., 2016) with human raters competing against a machine learning benchmark. We explain how our approach addresses two large productive inefficiencies in science: mismatch between research questions and publication bias. Better peer review for early research creates additional incentives for sharing it, which simplifies matching ideas to teams and makes negative results and p-hacking more visible.
&lt;/p&gt;</description></item><item><title>&#30740;&#31350;&#20102;&#30005;&#21160;&#20844;&#36335;&#31995;&#32479;&#21644;&#30005;&#27744;&#30005;&#21160;&#36710;&#30340;&#26367;&#20195;&#26041;&#26696;&#23545;&#20110;&#30005;&#21147;&#37096;&#38376;&#30340;&#24433;&#21709;&#65292;&#21457;&#29616;&#21487;&#28789;&#27963;&#20805;&#30005;&#30340;&#36710;&#36742;&#20849;&#20139;BEV&#30340;&#30005;&#21147;&#37096;&#38376;&#25104;&#26412;&#26368;&#20302;&#65292;&#32780;&#20351;&#29992;&#30005;&#21147;&#29123;&#26009;&#30340;&#37325;&#22411;&#36710;&#36742;&#30340;&#25104;&#26412;&#26368;&#39640;&#12290;</title><link>http://arxiv.org/abs/2303.16629</link><description>&lt;p&gt;
&#37325;&#22411;&#36710;&#36742;&#30005;&#27668;&#21270;&#30340;&#26367;&#20195;&#26041;&#26696;&#30340;&#30005;&#21147;&#37096;&#38376;&#24433;&#21709;:&#30005;&#27668;&#21270;&#21644;&#26234;&#33021;&#20805;&#30005;
&lt;/p&gt;
&lt;p&gt;
Power sector effects of alternative options for electrifying heavy-duty vehicles: go electric, and charge smartly. (arXiv:2303.16629v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.16629
&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#20102;&#30005;&#21160;&#20844;&#36335;&#31995;&#32479;&#21644;&#30005;&#27744;&#30005;&#21160;&#36710;&#30340;&#26367;&#20195;&#26041;&#26696;&#23545;&#20110;&#30005;&#21147;&#37096;&#38376;&#30340;&#24433;&#21709;&#65292;&#21457;&#29616;&#21487;&#28789;&#27963;&#20805;&#30005;&#30340;&#36710;&#36742;&#20849;&#20139;BEV&#30340;&#30005;&#21147;&#37096;&#38376;&#25104;&#26412;&#26368;&#20302;&#65292;&#32780;&#20351;&#29992;&#30005;&#21147;&#29123;&#26009;&#30340;&#37325;&#22411;&#36710;&#36742;&#30340;&#25104;&#26412;&#26368;&#39640;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#20056;&#29992;&#36710;&#39046;&#22495;&#65292;&#30005;&#27744;&#30005;&#21160;&#36710;(BEV)&#24050;&#25104;&#20026;&#21435;&#30899;&#21270;&#20132;&#36890;&#30340;&#26368;&#26377;&#21069;&#36884;&#30340;&#36873;&#25321;&#12290;&#23545;&#20110;&#37325;&#22411;&#36710;&#36742;(HDV)&#65292;&#25216;&#26415;&#39046;&#22495;&#20284;&#20046;&#26356;&#20026;&#24320;&#25918;&#12290;&#38500;&#20102;BEV&#22806;&#65292;&#36824;&#35752;&#35770;&#20102;&#29992;&#20110;&#21160;&#24577;&#20379;&#30005;&#30340;&#30005;&#21160;&#20844;&#36335;&#31995;&#32479;(ERS)&#65292;&#20197;&#21450;&#20351;&#29992;&#27682;&#29123;&#26009;&#30005;&#27744;&#25110;&#30005;&#21147;&#29123;&#26009;&#30340;&#21345;&#36710;&#38388;&#25509;&#30005;&#27668;&#21270;&#12290;&#22312;&#36825;&#37324;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#36825;&#20123;&#26367;&#20195;&#26041;&#26696;&#30340;&#30005;&#21147;&#37096;&#38376;&#24433;&#21709;&#12290;&#25105;&#20204;&#23558;&#22522;&#20110;&#26410;&#26469;&#24503;&#22269;&#39640;&#21487;&#20877;&#29983;&#33021;&#28304;&#20221;&#39069;&#30340;&#24773;&#26223;&#65292;&#24212;&#29992;&#19968;&#20010;&#24320;&#28304;&#30340;&#23481;&#37327;&#25193;&#23637;&#27169;&#22411;&#65292;&#21033;&#29992;&#35814;&#32454;&#30340;&#20197;&#36335;&#32447;&#20026;&#22522;&#30784;&#30340;&#21345;&#36710;&#20132;&#36890;&#25968;&#25454;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;&#21487;&#28789;&#27963;&#20805;&#30005;&#30340;&#36710;&#36742;&#20849;&#20139;BEV&#30340;&#30005;&#21147;&#37096;&#38376;&#25104;&#26412;&#26368;&#20302;&#65292;&#32780;&#20351;&#29992;&#30005;&#21147;&#29123;&#26009;&#30340;&#37325;&#22411;&#36710;&#36742;&#30340;&#25104;&#26412;&#26368;&#39640;&#12290;&#22914;&#26524;BEV&#21644;ERS-BEV&#27809;&#26377;&#20197;&#20248;&#21270;&#30340;&#26041;&#24335;&#20805;&#30005;&#65292;&#30005;&#21147;&#37096;&#38376;&#25104;&#26412;&#20250;&#22686;&#21152;&#65292;&#20294;&#20173;&#36828;&#20302;&#20110;&#20351;&#29992;&#27682;&#25110;&#30005;&#21147;&#29123;&#26009;&#30340;&#24773;&#26223;&#12290;&#36825;&#26159;&#30456;&#23545;&#36739;&#23567;&#30005;&#27744;&#12289;&#39640;&#24230;&#28789;&#27963;&#30340;BEV&#22312;&#30701;&#36884;&#21644;&#20013;&#36884;&#27493;&#39588;&#36716;&#31227;&#21644;&#36229;&#20986;&#36947;&#36335;&#24191;&#27867;&#20351;&#29992;&#30340;&#20248;&#21183;&#30340;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
In the passenger car segment, battery-electric vehicles (BEV) have emerged as the most promising option to decarbonize transportation. For heavy-duty vehicles (HDV), the technology space still appears to be more open. Aside from BEV, electric road systems (ERS) for dynamic power transfer are discussed, as well as indirect electrification with trucks that use hydrogen fuel cells or e-fuels. Here we investigate the power sector implications of these alternative options. We apply an open-source capacity expansion model to future scenarios of Germany with high renewable energy shares, drawing on detailed route-based truck traffic data. Results show that power sector costs are lowest for flexibly charged BEV that also carry out vehicle-to-grid operations, and highest for HDV using e-fuels. If BEV and ERS-BEV are not charged in an optimized way, power sector costs increase, but are still substantially lower than in scenarios with hydrogen or e-fuels. This is a consequence of the relatively p
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#36890;&#29992;&#22343;&#34913;&#27169;&#22411;&#20197;&#35299;&#20915;&#22810;&#20056;&#23458;&#25340;&#36710;&#31995;&#32479;&#30340;&#38382;&#39064;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#20010;&#24207;&#21015;-&#26641;&#31639;&#27861;&#29992;&#20110;&#27714;&#35299;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2303.16595</link><description>&lt;p&gt;
&#24102;&#31283;&#23450;&#21305;&#37197;&#30340;&#22810;&#20056;&#23458;&#25340;&#36710;&#31995;&#32479;&#30340;&#19968;&#33324;&#22343;&#34913;&#27169;&#22411;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
A general equilibrium model for multi-passenger ridesharing systems with stable matching. (arXiv:2303.16595v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.16595
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#36890;&#29992;&#22343;&#34913;&#27169;&#22411;&#20197;&#35299;&#20915;&#22810;&#20056;&#23458;&#25340;&#36710;&#31995;&#32479;&#30340;&#38382;&#39064;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#20010;&#24207;&#21015;-&#26641;&#31639;&#27861;&#29992;&#20110;&#27714;&#35299;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#36890;&#29992;&#22343;&#34913;&#27169;&#22411;&#65292;&#29992;&#20110;&#25429;&#25417;&#22810;&#20056;&#23458;&#25340;&#36710;&#31995;&#32479;&#20013;&#20056;&#23458;&#12289;&#21496;&#26426;&#12289;&#24179;&#21488;&#21644;&#20132;&#36890;&#32593;&#32476;&#20043;&#38388;&#30340;&#20869;&#29983;&#24615;&#20114;&#21160;&#12290;&#31283;&#23450;&#21305;&#37197;&#34987;&#24314;&#27169;&#20026;&#19968;&#20010;&#22343;&#34913;&#38382;&#39064;&#65292;&#20854;&#20013;&#27809;&#26377;&#25340;&#36710;&#21496;&#26426;&#25110;&#20056;&#23458;&#33021;&#22815;&#36890;&#36807;&#21333;&#26041;&#38754;&#20999;&#25442;&#21478;&#19968;&#20010;&#21305;&#37197;&#24207;&#21015;&#26469;&#38477;&#20302;&#25340;&#36710;&#30340;&#19981;&#28385;&#24847;&#31243;&#24230;&#12290;&#26412;&#25991;&#26159;&#39318;&#25209;&#23558;&#25340;&#36710;&#24179;&#21488;&#22810;&#20056;&#23458;&#21305;&#37197;&#38382;&#39064;&#26126;&#30830;&#34701;&#20837;&#27169;&#22411;&#30340;&#30740;&#31350;&#20043;&#19968;&#12290;&#36890;&#36807;&#23558;&#21305;&#37197;&#24207;&#21015;&#19982;&#36229;&#32593;&#32476;&#30456;&#32467;&#21512;&#65292;&#36991;&#20813;&#20102;&#22810;&#20056;&#23458;&#25340;&#36710;&#31995;&#32479;&#20013;&#30340;&#25340;&#36710;-&#20056;&#23458;&#36716;&#31227;&#12290;&#27492;&#22806;&#65292;&#26412;&#35770;&#25991;&#23558;&#25340;&#36710;&#21496;&#26426;&#21644;&#20056;&#23458;&#20043;&#38388;&#30340;&#21305;&#37197;&#31283;&#23450;&#24615;&#25193;&#23637;&#21040;&#20197;&#21305;&#37197;&#24207;&#21015;&#20026;&#22522;&#30784;&#30340;&#22810;OD&#22810;&#20056;&#23458;&#24773;&#20917;&#12290;&#26412;&#25991;&#25552;&#20379;&#20102;&#25152;&#25552;&#20986;&#19968;&#33324;&#22343;&#34913;&#27169;&#22411;&#30340;&#23384;&#22312;&#24615;&#35777;&#26126;&#12290;&#38024;&#23545;&#27714;&#35299;&#22810;&#20056;&#23458;&#25340;&#36710;&#38382;&#39064;&#65292;&#36824;&#25552;&#20986;&#20102;&#19968;&#20010;&#24207;&#21015;-&#26641;&#31639;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper proposes a general equilibrium model for multi-passenger ridesharing systems, in which interactions between ridesharing drivers, passengers, platforms, and transportation networks are endogenously captured. Stable matching is modeled as an equilibrium problem in which no ridesharing driver or passenger can reduce ridesharing disutility by unilaterally switching to another matching sequence. This paper is one of the first studies that explicitly integrates the ridesharing platform multi-passenger matching problem into the model. By integrating matching sequence with hyper-network, ridesharing-passenger transfers are avoided in a multi-passenger ridesharing system. Moreover, the matching stability between the ridesharing drivers and passengers is extended to address the multi-OD multi-passenger case in terms of matching sequence. The paper provides a proof for the existence of the proposed general equilibrium. A sequence-bush algorithm is developed for solving the multi-passen
&lt;/p&gt;</description></item><item><title>&#36890;&#36807;&#31038;&#20132;&#23186;&#20307;&#23454;&#39564;&#65292;&#30740;&#31350;&#20154;&#21592;&#21457;&#29616;&#19981;&#21516;&#30340;&#25968;&#23383;&#21465;&#20107;&#26684;&#24335;&#20250;&#24433;&#21709;&#20154;&#20204;&#30340;&#25209;&#21028;&#24615;&#24605;&#32500;&#65292;&#20013;&#31561;&#38271;&#24230;&#30340;&#35774;&#35745;&#26368;&#26377;&#25928;&#65292;&#38656;&#35201;&#35748;&#30693;&#31243;&#24230;&#39640;&#30340;&#20010;&#20307;&#24433;&#21709;&#26368;&#22823;&#12290;</title><link>http://arxiv.org/abs/2303.16422</link><description>&lt;p&gt;
&#36890;&#36807;&#35762;&#25925;&#20107;&#22521;&#20859;&#25209;&#21028;&#24615;&#24605;&#32500;&#65306;&#29702;&#35770;&#19982;&#31038;&#20132;&#23186;&#20307;&#23454;&#39564;
&lt;/p&gt;
&lt;p&gt;
Critical Thinking Via Storytelling: Theory and Social Media Experiment. (arXiv:2303.16422v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.16422
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#31038;&#20132;&#23186;&#20307;&#23454;&#39564;&#65292;&#30740;&#31350;&#20154;&#21592;&#21457;&#29616;&#19981;&#21516;&#30340;&#25968;&#23383;&#21465;&#20107;&#26684;&#24335;&#20250;&#24433;&#21709;&#20154;&#20204;&#30340;&#25209;&#21028;&#24615;&#24605;&#32500;&#65292;&#20013;&#31561;&#38271;&#24230;&#30340;&#35774;&#35745;&#26368;&#26377;&#25928;&#65292;&#38656;&#35201;&#35748;&#30693;&#31243;&#24230;&#39640;&#30340;&#20010;&#20307;&#24433;&#21709;&#26368;&#22823;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#19968;&#20010;&#31616;&#21270;&#30340;&#25237;&#31080;&#27169;&#22411;&#20013;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#22686;&#21152;&#20855;&#26377;&#24847;&#35782;&#21040;&#26576;&#19968;&#38382;&#39064;&#27169;&#26865;&#20004;&#21487;&#24615;&#36136;&#30340;&#25209;&#21028;&#24615;&#24605;&#32500;&#32773;&#30340;&#27604;&#20363;&#20250;&#25552;&#39640;&#35843;&#26597;&#65288;&#36873;&#20030;&#65289;&#30340;&#25928;&#29575;&#65292;&#20294;&#21487;&#33021;&#20250;&#22686;&#21152;&#35843;&#26597;&#30340;&#20559;&#35265;&#12290;&#22312;&#38024;&#23545;&#20195;&#34920;&#24615;&#32654;&#22269;&#20154;&#21475;&#30340;&#28608;&#21169;&#22312;&#32447;&#31038;&#20132;&#23186;&#20307;&#23454;&#39564;&#65288;N = 706&#65289;&#20013;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#19981;&#21516;&#30340;&#25968;&#23383;&#21465;&#20107;&#26684;&#24335; &#8211; &#19981;&#21516;&#30340;&#35774;&#35745;&#26469;&#21576;&#29616;&#21516;&#19968;&#32452;&#20107;&#23454; &#8211; &#24433;&#21709;&#20010;&#20307;&#25104;&#20026;&#25209;&#21028;&#24615;&#24605;&#32500;&#32773;&#30340;&#24378;&#24230;&#12290;&#20013;&#31561;&#38271;&#24230;&#30340;&#35774;&#35745;&#65288;Facebook&#24086;&#23376;&#65289;&#26368;&#26377;&#25928;&#22320;&#28608;&#21457;&#20010;&#20307;&#30340;&#25209;&#21028;&#24615;&#24605;&#32500;&#12290;&#38656;&#35201;&#35748;&#30693;&#30340;&#31243;&#24230;&#39640;&#30340;&#20010;&#20307;&#20027;&#35201;&#39537;&#21160;&#20102;&#27835;&#30103;&#25928;&#26524;&#30340;&#24046;&#24322;&#12290;
&lt;/p&gt;
&lt;p&gt;
In a stylized voting model, we establish that increasing the share of critical thinkers -- individuals who are aware of the ambivalent nature of a certain issue -- in the population increases the efficiency of surveys (elections) but might increase surveys' bias. In an incentivized online social media experiment on a representative US population (N = 706), we show that different digital storytelling formats -- different designs to present the same set of facts -- affect the intensity at which individuals become critical thinkers. Intermediate-length designs (Facebook posts) are most effective at triggering individuals into critical thinking. Individuals with a high need for cognition mostly drive the differential effects of the treatments.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;&#19968;&#31181;&#24120;&#35265;&#20449;&#24687;&#20998;&#24067;&#19979;&#19968;&#20215;&#25293;&#21334;&#20013;&#20851;&#20110;&#36125;&#21494;&#26031;&#32435;&#20160;&#22343;&#34913;&#30340;&#22797;&#26434;&#24615;&#65292;&#21457;&#29616;&#21363;&#20351;&#22312;&#19977;&#26041;&#24179;&#23616;&#35268;&#21017;&#19979;&#65292;&#35813;&#38382;&#39064;&#30340;&#22797;&#26434;&#24230;&#37117;&#26159;PPAD&#23436;&#20840;&#30340;&#12290;&#21516;&#26102;&#25552;&#20986;&#20102;&#22312;&#37319;&#29992;&#22343;&#21248;&#24179;&#23616;&#35268;&#21017;&#24773;&#20917;&#19979;&#30340;&#37096;&#20998;&#36817;&#20284;&#31639;&#27861;&#12290;</title><link>http://arxiv.org/abs/2303.16388</link><description>&lt;p&gt;
&#19968;&#33324;&#24615;&#24179;&#23616;&#35268;&#21017;&#19979;&#19968;&#20215;&#25293;&#21334;&#22343;&#34913;&#30340;&#22797;&#26434;&#24230;
&lt;/p&gt;
&lt;p&gt;
Complexity of Equilibria in First-Price Auctions under General Tie-Breaking Rules. (arXiv:2303.16388v1 [cs.GT])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.16388
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;&#19968;&#31181;&#24120;&#35265;&#20449;&#24687;&#20998;&#24067;&#19979;&#19968;&#20215;&#25293;&#21334;&#20013;&#20851;&#20110;&#36125;&#21494;&#26031;&#32435;&#20160;&#22343;&#34913;&#30340;&#22797;&#26434;&#24615;&#65292;&#21457;&#29616;&#21363;&#20351;&#22312;&#19977;&#26041;&#24179;&#23616;&#35268;&#21017;&#19979;&#65292;&#35813;&#38382;&#39064;&#30340;&#22797;&#26434;&#24230;&#37117;&#26159;PPAD&#23436;&#20840;&#30340;&#12290;&#21516;&#26102;&#25552;&#20986;&#20102;&#22312;&#37319;&#29992;&#22343;&#21248;&#24179;&#23616;&#35268;&#21017;&#24773;&#20917;&#19979;&#30340;&#37096;&#20998;&#36817;&#20284;&#31639;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;&#19968;&#31181;&#24120;&#35265;&#20449;&#24687;&#20998;&#24067;&#19979;&#19968;&#20215;&#25293;&#21334;&#20013;&#20851;&#20110;&#36125;&#21494;&#26031;&#32435;&#20160;&#22343;&#34913;&#30340;&#22797;&#26434;&#24615;&#65292;&#32771;&#34385;&#20102;&#24179;&#23616;&#35268;&#21017;&#20316;&#20026;&#36755;&#20837;&#30340;&#19968;&#37096;&#20998;&#12290;&#32467;&#26524;&#34920;&#26126;&#21363;&#20351;&#22312;&#19977;&#26041;&#24179;&#23616;&#35268;&#21017;&#65288;&#21363;&#34920;&#31034;&#24403;&#20986;&#29616;&#19981;&#36229;&#36807;&#19977;&#21517;&#31454;&#26631;&#20154;&#21592;&#24182;&#21015;&#31532;&#19968;&#26102;&#65292;&#23558;&#29289;&#21697;&#20998;&#37197;&#32473;&#36825;&#20123;&#20154;&#21592;&#65292;&#21542;&#21017;&#37319;&#29992;&#22343;&#21248;&#24179;&#23616;&#35268;&#21017;&#65289;&#30340;&#24773;&#20917;&#19979;&#65292;&#35813;&#38382;&#39064;&#30340;&#22797;&#26434;&#24230;&#20063;&#26159;PPAD&#23436;&#20840;&#30340;&#12290;&#36825;&#26159;&#20851;&#20110;&#24102;&#26377;&#24179;&#23616;&#35268;&#21017;&#19979;&#19968;&#20215;&#25293;&#21334;&#22343;&#34913;&#35745;&#31639;&#30340;&#39318;&#20010;&#22256;&#38590;&#32467;&#26524;&#12290;&#22312;&#31215;&#26497;&#26041;&#38754;&#65292;&#25105;&#20204;&#23545;&#20110;&#37319;&#29992;&#22343;&#21248;&#24179;&#23616;&#35268;&#21017;&#30340;&#38382;&#39064;&#25552;&#20986;&#20102;&#19968;&#31181;&#37096;&#20998;&#36817;&#20284;&#31639;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study the complexity of finding an approximate (pure) Bayesian Nash equilibrium in a first-price auction with common priors when the tie-breaking rule is part of the input. We show that the problem is PPAD-complete even when the tie-breaking rule is trilateral (i.e., it specifies item allocations when no more than three bidders are in tie, and adopts the uniform tie-breaking rule otherwise). This is the first hardness result for equilibrium computation in first-price auctions with common priors. On the positive side, we give a PTAS for the problem under the uniform tie-breaking rule.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#22522;&#20110;&#27880;&#24847;&#21147;&#26426;&#21046;&#21464;&#21387;&#22120;&#31070;&#32463;&#32593;&#32476;&#29992;&#20110;&#39044;&#27979;&#19981;&#21516;&#36890;&#36135;&#33192;&#32960;&#29575;&#30340;&#28508;&#21147;&#65292;&#32467;&#26524;&#34920;&#26126;&#20854;&#21487;&#20197;&#36229;&#36234;&#20256;&#32479;&#27169;&#22411;&#65292;&#25104;&#20026;&#37329;&#34701;&#20915;&#31574;&#20013;&#30340;&#26377;&#29992;&#24037;&#20855;&#12290;</title><link>http://arxiv.org/abs/2303.15364</link><description>&lt;p&gt;
&#22522;&#20110;&#27880;&#24847;&#21147;&#26426;&#21046;&#21464;&#21387;&#22120;&#31070;&#32463;&#32593;&#32476;&#30340;&#36890;&#32960;&#39044;&#27979;
&lt;/p&gt;
&lt;p&gt;
Inflation forecasting with attention based transformer neural networks. (arXiv:2303.15364v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.15364
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22522;&#20110;&#27880;&#24847;&#21147;&#26426;&#21046;&#21464;&#21387;&#22120;&#31070;&#32463;&#32593;&#32476;&#29992;&#20110;&#39044;&#27979;&#19981;&#21516;&#36890;&#36135;&#33192;&#32960;&#29575;&#30340;&#28508;&#21147;&#65292;&#32467;&#26524;&#34920;&#26126;&#20854;&#21487;&#20197;&#36229;&#36234;&#20256;&#32479;&#27169;&#22411;&#65292;&#25104;&#20026;&#37329;&#34701;&#20915;&#31574;&#20013;&#30340;&#26377;&#29992;&#24037;&#20855;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36890;&#32960;&#26159;&#36164;&#37329;&#37197;&#32622;&#20915;&#31574;&#30340;&#37325;&#35201;&#22240;&#32032;&#65292;&#20854;&#39044;&#27979;&#26159;&#25919;&#24220;&#21644;&#20013;&#22830;&#38134;&#34892;&#30340;&#22522;&#26412;&#30446;&#26631;&#12290;&#28982;&#32780;&#65292;&#30001;&#20110;&#20854;&#39044;&#27979;&#21462;&#20915;&#20110;&#20302;&#39057;&#39640;&#27874;&#21160;&#25968;&#25454;&#19988;&#32570;&#20047;&#28165;&#26224;&#30340;&#35299;&#37322;&#21464;&#37327;&#65292;&#22240;&#27492;&#39044;&#27979;&#36890;&#32960;&#24182;&#19981;&#26159;&#19968;&#39033;&#31616;&#21333;&#30340;&#20219;&#21153;&#12290;&#26368;&#36817;&#65292;&#65288;&#28145;&#24230;&#65289;&#31070;&#32463;&#32593;&#32476;&#22312;&#35768;&#22810;&#24212;&#29992;&#20013;&#24050;&#26174;&#31034;&#20986;&#24778;&#20154;&#30340;&#32467;&#26524;&#65292;&#36880;&#28176;&#25104;&#20026;&#26032;&#30340;&#25216;&#26415;&#27700;&#24179;&#26631;&#26438;&#12290;&#26412;&#25991;&#30740;&#31350;&#20102;&#21464;&#21387;&#22120;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#26550;&#26500;&#29992;&#20110;&#39044;&#27979;&#19981;&#21516;&#36890;&#32960;&#29575;&#30340;&#28508;&#21147;&#12290;&#32467;&#26524;&#19982;&#32463;&#20856;&#26102;&#38388;&#24207;&#21015;&#21644;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#36827;&#34892;&#20102;&#27604;&#36739;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#25105;&#20204;&#25913;&#36827;&#21518;&#30340;&#21464;&#21387;&#22120;&#27169;&#22411;&#22312;16&#20010;&#23454;&#39564;&#20013;&#24179;&#22343;&#36229;&#36807;&#22522;&#20934;&#27169;&#22411;6&#20010;&#23454;&#39564;&#65292;&#22312;&#30740;&#31350;&#30340;4&#20010;&#36890;&#36135;&#33192;&#32960;&#29575;&#20013;&#34920;&#29616;&#26368;&#20339;&#12290;&#25105;&#20204;&#30340;&#32467;&#26524;&#34920;&#26126;&#65292;&#22522;&#20110;&#21464;&#21387;&#22120;&#30340;&#36890;&#32960;&#39044;&#27979;&#27169;&#22411;&#26377;&#36229;&#36234;&#20256;&#32479;&#27169;&#22411;&#30340;&#28508;&#21147;&#65292;&#24182;&#21487;&#20197;&#25104;&#20026;&#37329;&#34701;&#20915;&#31574;&#20013;&#30340;&#26377;&#29992;&#24037;&#20855;&#12290;
&lt;/p&gt;
&lt;p&gt;
Inflation is a major determinant for allocation decisions and its forecast is a fundamental aim of governments and central banks. However, forecasting inflation is not a trivial task, as its prediction relies on low frequency, highly fluctuating data with unclear explanatory variables. While classical models show some possibility of predicting inflation, reliably beating the random walk benchmark remains difficult. Recently, (deep) neural networks have shown impressive results in a multitude of applications, increasingly setting the new state-of-the-art. This paper investigates the potential of the transformer deep neural network architecture to forecast different inflation rates. The results are compared to a study on classical time series and machine learning models. We show that our adapted transformer, on average, outperforms the baseline in 6 out of 16 experiments, showing best scores in two out of four investigated inflation rates. Our results demonstrate that a transformer based
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21463;&#38480;&#21046;&#30340;&#36125;&#21494;&#26031;&#20998;&#32452;&#20272;&#35745;&#22120;&#65292;&#36890;&#36807;&#21033;&#29992;&#30740;&#31350;&#20154;&#21592;&#23545;&#32452;&#30340;&#20808;&#39564;&#20449;&#24565;&#20197;&#20004;&#20004;&#32422;&#26463;&#30340;&#24418;&#24335;&#36827;&#34892;&#34920;&#36798;&#65292;&#23558;&#28508;&#22312;&#32452;&#32467;&#26500;&#30340;&#20808;&#39564;&#30693;&#35782;&#32435;&#20837;&#21040;&#38754;&#26495;&#25968;&#25454;&#27169;&#22411;&#20013;&#12290;&#33945;&#29305;&#21345;&#32599;&#23454;&#39564;&#26174;&#31034;&#65292;&#21152;&#20837;&#20808;&#39564;&#30693;&#35782;&#21487;&#20197;&#24471;&#21040;&#26356;&#20934;&#30830;&#30340;&#31995;&#25968;&#20272;&#35745;&#65292;&#24182;&#19988;&#27604;&#26367;&#20195;&#20272;&#35745;&#22120;&#33719;&#24471;&#26356;&#22810;&#30340;&#39044;&#27979;&#22686;&#30410;&#20998;&#25968;&#12290;&#25105;&#20204;&#24212;&#29992;&#20102;&#25105;&#20204;&#30340;&#26041;&#27861;&#21040;&#20004;&#20010;&#32463;&#39564;&#24212;&#29992;&#20013;&#12290;</title><link>http://arxiv.org/abs/2211.16714</link><description>&lt;p&gt;
&#23558;&#28508;&#22312;&#32452;&#32467;&#26500;&#30340;&#20808;&#39564;&#30693;&#35782;&#32435;&#20837;&#38754;&#26495;&#25968;&#25454;&#27169;&#22411;&#20013;
&lt;/p&gt;
&lt;p&gt;
Incorporating Prior Knowledge of Latent Group Structure in Panel Data Models. (arXiv:2211.16714v2 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2211.16714
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21463;&#38480;&#21046;&#30340;&#36125;&#21494;&#26031;&#20998;&#32452;&#20272;&#35745;&#22120;&#65292;&#36890;&#36807;&#21033;&#29992;&#30740;&#31350;&#20154;&#21592;&#23545;&#32452;&#30340;&#20808;&#39564;&#20449;&#24565;&#20197;&#20004;&#20004;&#32422;&#26463;&#30340;&#24418;&#24335;&#36827;&#34892;&#34920;&#36798;&#65292;&#23558;&#28508;&#22312;&#32452;&#32467;&#26500;&#30340;&#20808;&#39564;&#30693;&#35782;&#32435;&#20837;&#21040;&#38754;&#26495;&#25968;&#25454;&#27169;&#22411;&#20013;&#12290;&#33945;&#29305;&#21345;&#32599;&#23454;&#39564;&#26174;&#31034;&#65292;&#21152;&#20837;&#20808;&#39564;&#30693;&#35782;&#21487;&#20197;&#24471;&#21040;&#26356;&#20934;&#30830;&#30340;&#31995;&#25968;&#20272;&#35745;&#65292;&#24182;&#19988;&#27604;&#26367;&#20195;&#20272;&#35745;&#22120;&#33719;&#24471;&#26356;&#22810;&#30340;&#39044;&#27979;&#22686;&#30410;&#20998;&#25968;&#12290;&#25105;&#20204;&#24212;&#29992;&#20102;&#25105;&#20204;&#30340;&#26041;&#27861;&#21040;&#20004;&#20010;&#32463;&#39564;&#24212;&#29992;&#20013;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#32452;&#24322;&#36136;&#24615;&#20551;&#35774;&#24050;&#32463;&#25104;&#20026;&#38754;&#26495;&#25968;&#25454;&#27169;&#22411;&#20013;&#30340;&#30740;&#31350;&#28909;&#28857;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21463;&#38480;&#21046;&#30340;&#36125;&#21494;&#26031;&#20998;&#32452;&#20272;&#35745;&#22120;&#65292;&#21033;&#29992;&#30740;&#31350;&#20154;&#21592;&#23545;&#32452;&#30340;&#20808;&#39564;&#20449;&#24565;&#20197;&#20004;&#20004;&#32422;&#26463;&#30340;&#24418;&#24335;&#36827;&#34892;&#34920;&#36798;&#65292;&#34920;&#26126;&#19968;&#23545;&#21333;&#20301;&#26159;&#21542;&#21487;&#33021;&#23646;&#20110;&#21516;&#19968;&#32452;&#25110;&#19981;&#21516;&#32452;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#20808;&#39564;&#26041;&#27861;&#65292;&#29992;&#19981;&#21516;&#31243;&#24230;&#30340;&#32622;&#20449;&#24230;&#26469;&#32435;&#20837;&#20004;&#20004;&#32422;&#26463;&#12290;&#25972;&#20010;&#26694;&#26550;&#24314;&#31435;&#22312;&#38750;&#21442;&#25968;&#36125;&#21494;&#26031;&#26041;&#27861;&#19978;&#65292;&#38544;&#21547;&#22320;&#25351;&#23450;&#20102;&#23545;&#32452;&#20998;&#21306;&#30340;&#20998;&#24067;&#65292;&#22240;&#27492;&#21518;&#39564;&#20998;&#26512;&#32771;&#34385;&#20102;&#28508;&#22312;&#30340;&#32452;&#32467;&#26500;&#30340;&#19981;&#30830;&#23450;&#24615;&#12290;&#33945;&#29305;&#21345;&#32599;&#23454;&#39564;&#26174;&#31034;&#65292;&#21152;&#20837;&#20808;&#39564;&#30693;&#35782;&#21487;&#20197;&#24471;&#21040;&#26356;&#20934;&#30830;&#30340;&#31995;&#25968;&#20272;&#35745;&#65292;&#24182;&#19988;&#27604;&#26367;&#20195;&#20272;&#35745;&#22120;&#33719;&#24471;&#26356;&#22810;&#30340;&#39044;&#27979;&#22686;&#30410;&#20998;&#25968;&#12290;&#25105;&#20204;&#24212;&#29992;&#20102;&#25105;&#20204;&#30340;&#26041;&#27861;&#21040;&#20004;&#20010;&#32463;&#39564;&#24212;&#29992;&#20013;&#12290;&#22312;&#31532;&#19968;&#20010;&#39044;&#27979;&#32654;&#22269;CPI&#36890;&#36135;&#33192;&#32960;&#29575;&#30340;&#24212;&#29992;&#20013;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#32452;&#30340;&#20808;&#39564;&#30693;&#35782;&#21487;&#20197;&#22312;&#25968;&#25454;&#19981;&#20805;&#36275;&#26102;&#25552;&#39640;&#23494;&#24230;&#39044;&#27979;&#12290;
&lt;/p&gt;
&lt;p&gt;
The assumption of group heterogeneity has become popular in panel data models. We develop a constrained Bayesian grouped estimator that exploits researchers' prior beliefs on groups in a form of pairwise constraints, indicating whether a pair of units is likely to belong to a same group or different groups. We propose a prior to incorporate the pairwise constraints with varying degrees of confidence. The whole framework is built on the nonparametric Bayesian method, which implicitly specifies a distribution over the group partitions, and so the posterior analysis takes the uncertainty of the latent group structure into account. Monte Carlo experiments reveal that adding prior knowledge yields more accurate estimates of coefficient and scores predictive gains over alternative estimators. We apply our method to two empirical applications. In a first application to forecasting U.S. CPI inflation, we illustrate that prior knowledge of groups improves density forecasts when the data is not 
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#31232;&#30095;&#20998;&#20301;&#22238;&#24402;&#20272;&#35745;&#22120;&#65292;&#36890;&#36807;&#25351;&#25968;&#19981;&#31561;&#24335;&#24471;&#21040;&#20102;&#22343;&#26041;&#35823;&#24046;&#21644;&#22238;&#24402;&#20989;&#25968;&#20272;&#35745;&#35823;&#24046;&#30340;&#38750;&#28176;&#36817;&#19978;&#30028;&#65292;&#24182;&#20351;&#29992;&#28151;&#21512;&#25972;&#25968;&#32447;&#24615;&#35268;&#21010;&#21644;&#19968;&#38454;&#36817;&#20284;&#31639;&#27861;&#23454;&#29616;&#65292;&#33021;&#22312;&#23454;&#38469;&#25968;&#25454;&#24212;&#29992;&#20013;&#20351;&#29992;&#12290;</title><link>http://arxiv.org/abs/2006.11201</link><description>&lt;p&gt;
&#31232;&#30095;&#20998;&#20301;&#22238;&#24402;
&lt;/p&gt;
&lt;p&gt;
Sparse Quantile Regression. (arXiv:2006.11201v4 [stat.ME] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2006.11201
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#31232;&#30095;&#20998;&#20301;&#22238;&#24402;&#20272;&#35745;&#22120;&#65292;&#36890;&#36807;&#25351;&#25968;&#19981;&#31561;&#24335;&#24471;&#21040;&#20102;&#22343;&#26041;&#35823;&#24046;&#21644;&#22238;&#24402;&#20989;&#25968;&#20272;&#35745;&#35823;&#24046;&#30340;&#38750;&#28176;&#36817;&#19978;&#30028;&#65292;&#24182;&#20351;&#29992;&#28151;&#21512;&#25972;&#25968;&#32447;&#24615;&#35268;&#21010;&#21644;&#19968;&#38454;&#36817;&#20284;&#31639;&#27861;&#23454;&#29616;&#65292;&#33021;&#22312;&#23454;&#38469;&#25968;&#25454;&#24212;&#29992;&#20013;&#20351;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#32771;&#34385;&#20102;$\ell_0$&#24809;&#32602;&#21644;&#32422;&#26463;&#19979;&#30340;&#20998;&#20301;&#22238;&#24402;&#20272;&#35745;&#22120;&#12290;&#23545;&#20110;$\ell_0$&#24809;&#32602;&#30340;&#20272;&#35745;&#22120;&#65292;&#25105;&#20204;&#25512;&#23548;&#20986;&#36229;&#39069;&#20998;&#20301;&#39044;&#27979;&#39118;&#38505;&#23614;&#37096;&#27010;&#29575;&#30340;&#25351;&#25968;&#19981;&#31561;&#24335;&#65292;&#24182;&#23558;&#20854;&#24212;&#29992;&#20110;&#33719;&#24471;&#38750;&#28176;&#36817;&#19978;&#30028;&#30340;&#22343;&#26041;&#35823;&#24046;&#21644;&#22238;&#24402;&#20989;&#25968;&#20272;&#35745;&#35823;&#24046;&#12290;&#25105;&#20204;&#36824;&#20026;$\ell_0$&#32422;&#26463;&#30340;&#20272;&#35745;&#22120;&#25512;&#23548;&#20102;&#31867;&#20284;&#30340;&#32467;&#26524;&#12290;&#24471;&#21040;&#30340;&#25910;&#25947;&#36895;&#29575;&#20960;&#20046;&#26159;&#26497;&#23567;&#26368;&#20248;&#30340;&#65292;&#24182;&#19988;&#19982;$\ell_1$&#24809;&#32602;&#21644;&#38750;&#20984;&#24809;&#32602;&#20272;&#35745;&#22120;&#30340;&#36895;&#29575;&#30456;&#21516;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36824;&#34920;&#24449;&#20102;$\ell_0$&#24809;&#32602;&#20272;&#35745;&#22120;&#30340;&#26399;&#26395;&#27721;&#26126;&#25439;&#22833;&#12290;&#25105;&#20204;&#36890;&#36807;&#28151;&#21512;&#25972;&#25968;&#32447;&#24615;&#35268;&#21010;&#21644;&#19968;&#20010;&#26356;&#21487;&#25193;&#23637;&#30340;&#19968;&#38454;&#36817;&#20284;&#31639;&#27861;&#23454;&#29616;&#20102;&#25152;&#25552;&#20986;&#30340;&#36807;&#31243;&#12290;&#25105;&#20204;&#36890;&#36807;&#33945;&#29305;&#21345;&#32599;&#23454;&#39564;&#23637;&#31034;&#20102;&#25105;&#20204;&#26041;&#27861;&#22312;&#26377;&#38480;&#26679;&#26412;&#24773;&#20917;&#19979;&#30340;&#24615;&#33021;&#65292;&#24182;&#22312;&#28041;&#21450;&#23156;&#20799;&#20986;&#29983;&#20307;&#37325;&#30340;&#23454;&#38469;&#25968;&#25454;&#24212;&#29992;&#20013;&#23637;&#31034;&#20102;&#23427;&#30340;&#23454;&#29992;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
We consider both $\ell _{0}$-penalized and $\ell _{0}$-constrained quantile regression estimators. For the $\ell _{0}$-penalized estimator, we derive an exponential inequality on the tail probability of excess quantile prediction risk and apply it to obtain non-asymptotic upper bounds on the mean-square parameter and regression function estimation errors. We also derive analogous results for the $\ell _{0}$-constrained estimator. The resulting rates of convergence are nearly minimax-optimal and the same as those for $\ell _{1}$-penalized and non-convex penalized estimators. Further, we characterize expected Hamming loss for the $\ell _{0}$-penalized estimator. We implement the proposed procedure via mixed integer linear programming and also a more scalable first-order approximation algorithm. We illustrate the finite-sample performance of our approach in Monte Carlo experiments and its usefulness in a real data application concerning conformal prediction of infant birth weights (with $
&lt;/p&gt;</description></item></channel></rss>