<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#26412;&#25991;&#35774;&#35745;&#20102;&#22312;&#32593;&#32476;&#24178;&#25200;&#24773;&#20917;&#19979;&#36827;&#34892;&#24322;&#36136;&#22788;&#29702;&#25928;&#24212;&#38543;&#26426;&#21270;&#27979;&#35797;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#24341;&#20837;&#32593;&#32476;&#26333;&#20809;&#26144;&#23556;&#30340;&#27010;&#24565;&#21644;&#26465;&#20214;&#38543;&#26426;&#21270;&#25512;&#26029;&#26041;&#27861;&#65292;&#35299;&#20915;&#20102;&#24178;&#25200;&#21442;&#25968;&#21644;&#22810;&#37325;&#28508;&#22312;&#32467;&#26524;&#30340;&#38382;&#39064;&#65292;&#24471;&#21040;&#20102;&#28176;&#36817;&#26377;&#25928;&#30340;p&#20540;&#12290;</title><link>http://arxiv.org/abs/2308.00202</link><description>&lt;p&gt;
&#32593;&#32476;&#24178;&#25200;&#19979;&#24322;&#36136;&#22788;&#29702;&#25928;&#24212;&#30340;&#38543;&#26426;&#21270;&#25512;&#26029;
&lt;/p&gt;
&lt;p&gt;
Randomization Inference of Heterogeneous Treatment Effects under Network Interference. (arXiv:2308.00202v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.00202
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#35774;&#35745;&#20102;&#22312;&#32593;&#32476;&#24178;&#25200;&#24773;&#20917;&#19979;&#36827;&#34892;&#24322;&#36136;&#22788;&#29702;&#25928;&#24212;&#38543;&#26426;&#21270;&#27979;&#35797;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#24341;&#20837;&#32593;&#32476;&#26333;&#20809;&#26144;&#23556;&#30340;&#27010;&#24565;&#21644;&#26465;&#20214;&#38543;&#26426;&#21270;&#25512;&#26029;&#26041;&#27861;&#65292;&#35299;&#20915;&#20102;&#24178;&#25200;&#21442;&#25968;&#21644;&#22810;&#37325;&#28508;&#22312;&#32467;&#26524;&#30340;&#38382;&#39064;&#65292;&#24471;&#21040;&#20102;&#28176;&#36817;&#26377;&#25928;&#30340;p&#20540;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#35774;&#35745;&#20102;&#22312;&#21333;&#20301;&#20043;&#38388;&#23384;&#22312;&#32593;&#32476;&#24178;&#25200;&#26102;&#36827;&#34892;&#24322;&#36136;&#22788;&#29702;&#25928;&#24212;&#38543;&#26426;&#21270;&#27979;&#35797;&#30340;&#26041;&#27861;&#12290;&#25105;&#20204;&#30340;&#24314;&#27169;&#31574;&#30053;&#20351;&#29992;&#32593;&#32476;&#26333;&#20809;&#26144;&#23556;&#30340;&#27010;&#24565;&#23558;&#32593;&#32476;&#24178;&#25200;&#24341;&#20837;&#28508;&#22312;&#32467;&#26524;&#26694;&#26550;&#20013;&#12290;&#25105;&#20204;&#32771;&#34385;&#20102;&#19977;&#20010;&#38646;&#20551;&#35774;&#65292;&#20195;&#34920;&#20102;&#19981;&#21516;&#30340;&#22343;&#21248;&#22788;&#29702;&#25928;&#24212;&#30340;&#27010;&#24565;&#65292;&#20294;&#30001;&#20110;&#24178;&#25200;&#21442;&#25968;&#21644;&#28508;&#22312;&#32467;&#26524;&#30340;&#22810;&#26679;&#24615;&#65292;&#36825;&#20123;&#20551;&#35774;&#24182;&#19981;&#20934;&#30830;&#12290;&#20026;&#20102;&#35299;&#20915;&#22810;&#20010;&#28508;&#22312;&#32467;&#26524;&#30340;&#38382;&#39064;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#25193;&#23637;&#29616;&#26377;&#26041;&#27861;&#30340;&#26465;&#20214;&#38543;&#26426;&#21270;&#25512;&#26029;&#26041;&#27861;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36824;&#25552;&#20986;&#20102;&#20004;&#31181;&#20811;&#26381;&#24178;&#25200;&#21442;&#25968;&#38382;&#39064;&#30340;&#25216;&#26415;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#25105;&#20204;&#30340;&#26465;&#20214;&#38543;&#26426;&#21270;&#25512;&#26029;&#26041;&#27861;&#19982;&#22788;&#29702;&#24178;&#25200;&#21442;&#25968;&#30340;&#20004;&#31181;&#25216;&#26415;&#20043;&#19968;&#32467;&#21512;&#20351;&#29992;&#65292;&#21487;&#20197;&#20135;&#29983;&#28176;&#36817;&#26377;&#25928;&#30340;p&#20540;&#12290;&#25105;&#20204;&#22312;&#19968;&#20010;&#32593;&#32476;&#25968;&#25454;&#38598;&#19978;&#28436;&#31034;&#20102;&#27979;&#35797;&#36807;&#31243;&#65292;&#24182;&#23637;&#31034;&#20102;&#33945;&#29305;&#21345;&#27931;&#30740;&#31350;&#30340;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
We design randomization tests of heterogeneous treatment effects when units interact on a network. Our modeling strategy allows network interference into the potential outcomes framework using the concept of network exposure mapping. We consider three null hypotheses that represent different notions of homogeneous treatment effects, but due to nuisance parameters and the multiplicity of potential outcomes, the hypotheses are not sharp. To address the issue of multiple potential outcomes, we propose a conditional randomization inference method that expands on existing methods. Additionally, we propose two techniques that overcome the nuisance parameter issue. We show that our conditional randomization inference method, combined with either of the proposed techniques for handling nuisance parameters, produces asymptotically valid p-values. We illustrate the testing procedures on a network data set and the results of a Monte Carlo study are also presented.
&lt;/p&gt;</description></item></channel></rss>