<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#26412;&#25991;&#35777;&#26126;&#20102;&#22312;&#20855;&#26377;&#38750;&#20984;&#31574;&#30053;&#31354;&#38388;&#30340;&#28216;&#25103;&#31867;&#20013;&#23384;&#22312;&#32431;&#31574;&#30053;&#32435;&#20160;&#22343;&#34913;&#65292;&#24182;&#23637;&#31034;&#20102;&#22914;&#20309;&#36890;&#36807;&#36825;&#20010;&#32467;&#26524;&#35777;&#26126;&#20102;&#20195;&#25968;&#22522;&#26412;&#23450;&#29702;&#12290;</title><link>http://arxiv.org/abs/2308.11597</link><description>&lt;p&gt;
&#26080;&#20984;&#24615;&#24773;&#20917;&#19979;&#30340;&#32435;&#20160;&#22343;&#34913;&#23384;&#22312;&#24615;
&lt;/p&gt;
&lt;p&gt;
Nash Equilibrium Existence without Convexity. (arXiv:2308.11597v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.11597
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#35777;&#26126;&#20102;&#22312;&#20855;&#26377;&#38750;&#20984;&#31574;&#30053;&#31354;&#38388;&#30340;&#28216;&#25103;&#31867;&#20013;&#23384;&#22312;&#32431;&#31574;&#30053;&#32435;&#20160;&#22343;&#34913;&#65292;&#24182;&#23637;&#31034;&#20102;&#22914;&#20309;&#36890;&#36807;&#36825;&#20010;&#32467;&#26524;&#35777;&#26126;&#20102;&#20195;&#25968;&#22522;&#26412;&#23450;&#29702;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#35777;&#26126;&#20102;&#22312;&#20855;&#26377;&#38750;&#20984;&#31574;&#30053;&#31354;&#38388;&#30340;&#24191;&#27867;&#28216;&#25103;&#31867;&#20013;&#23384;&#22312;&#32431;&#31574;&#30053;&#32435;&#20160;&#22343;&#34913;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#22914;&#26524;&#27599;&#20010;&#29609;&#23478;&#30340;&#31574;&#30053;&#38598;&#24418;&#25104;&#19968;&#20010;&#32039;&#33268;&#12289;&#36830;&#36890;&#30340;&#27431;&#20960;&#37324;&#24471;&#37051;&#22495;&#22238;&#32553;&#65292;&#24182;&#19988;&#25152;&#26377;&#26368;&#20248;&#21709;&#24212;&#23545;&#24212;&#37117;&#26159;&#38646;&#21516;&#20262;&#30340;&#65292;&#21017;&#35813;&#28216;&#25103;&#20855;&#26377;&#19968;&#20010;&#32431;&#31574;&#30053;&#32435;&#20160;&#22343;&#34913;&#12290;&#20316;&#20026;&#19968;&#20010;&#24212;&#29992;&#65292;&#25105;&#23637;&#31034;&#20102;&#36825;&#20010;&#32467;&#26524;&#22914;&#20309;&#35777;&#26126;&#20102;&#20195;&#25968;&#22522;&#26412;&#23450;&#29702;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this paper, I prove the existence of a pure-strategy Nash equilibrium for a large class of games with nonconvex strategy spaces. Specifically, if each player's strategies form a compact, connected Euclidean neighborhood retract and if all best-response correspondences are null-homotopic, then the game has a pure-strategy Nash equilibrium. As an application, I show how this result can prove the fundamental theorem of algebra.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;ChatGPT&#23545;&#32534;&#30721;&#38382;&#39064;&#35299;&#20915;&#26041;&#24335;&#30340;&#24433;&#21709;&#65292;&#21457;&#29616;&#23427;&#26174;&#33879;&#20943;&#23569;&#20102;&#38382;&#39064;&#25968;&#37327;&#65292;&#25552;&#39640;&#20102;&#38382;&#39064;&#25991;&#26723;&#36136;&#37327;&#65292;&#20197;&#21450;&#21097;&#19979;&#30340;&#38382;&#39064;&#26356;&#21152;&#22797;&#26434;&#65292;&#26263;&#31034;&#30528;AI&#19981;&#20165;&#25552;&#21319;&#20102;&#29983;&#20135;&#21147;&#65292;&#36824;&#25913;&#21464;&#20102;&#24037;&#20316;&#26041;&#24335;&#12290;</title><link>http://arxiv.org/abs/2308.11302</link><description>&lt;p&gt;
&#20174;&#26085;&#24120;&#21040;&#26377;&#24847;&#20041;&#65306;AI&#23545;&#24037;&#20316;&#21160;&#24577;&#30340;&#24433;&#21709; - &#26469;&#33258;ChatGPT&#21644;Stack Overflow&#30340;&#35777;&#25454;
&lt;/p&gt;
&lt;p&gt;
From Mundane to Meaningful: AI's Influence on Work Dynamics -- evidence from ChatGPT and Stack Overflow. (arXiv:2308.11302v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.11302
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;ChatGPT&#23545;&#32534;&#30721;&#38382;&#39064;&#35299;&#20915;&#26041;&#24335;&#30340;&#24433;&#21709;&#65292;&#21457;&#29616;&#23427;&#26174;&#33879;&#20943;&#23569;&#20102;&#38382;&#39064;&#25968;&#37327;&#65292;&#25552;&#39640;&#20102;&#38382;&#39064;&#25991;&#26723;&#36136;&#37327;&#65292;&#20197;&#21450;&#21097;&#19979;&#30340;&#38382;&#39064;&#26356;&#21152;&#22797;&#26434;&#65292;&#26263;&#31034;&#30528;AI&#19981;&#20165;&#25552;&#21319;&#20102;&#29983;&#20135;&#21147;&#65292;&#36824;&#25913;&#21464;&#20102;&#24037;&#20316;&#26041;&#24335;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#38416;&#36848;&#20102;&#29983;&#25104;&#24335;AI&#22914;&#20309;&#20026;&#24040;&#22823;&#30340;&#29983;&#20135;&#21147;&#25552;&#21319;&#25552;&#20379;&#26426;&#20250;&#65292;&#21516;&#26102;&#20063;&#24341;&#21457;&#20102;&#20851;&#20110;&#36825;&#20123;&#26032;&#24378;&#22823;&#25216;&#26415;&#23545;&#25105;&#20204;&#24037;&#20316;&#21644;&#20849;&#20139;&#30693;&#35782;&#26041;&#24335;&#30340;&#24433;&#21709;&#30340;&#38382;&#39064;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#25105;&#20204;&#25506;&#35752;&#20102;ChatGPT&#22914;&#20309;&#25913;&#21464;&#20102;&#32534;&#30721;&#30340;&#19968;&#20010;&#22522;&#26412;&#26041;&#38754;&#65306;&#38382;&#39064;&#35299;&#20915;&#12290;&#20026;&#27492;&#65292;&#25105;&#20204;&#21033;&#29992;&#20102;ChatGPT&#22312;2022&#24180;11&#26376;30&#26085;&#31361;&#28982;&#21457;&#24067;&#23545;&#26368;&#22823;&#30340;&#22312;&#32447;&#32534;&#30721;&#31038;&#21306;Stack Overflow&#20351;&#29992;&#30340;&#24433;&#21709;&#12290;&#20351;&#29992;&#20934;&#23454;&#39564;&#26041;&#27861;&#65288;&#24046;&#20998;&#20934;&#24046;&#27861;&#65289;&#65292;&#25105;&#20204;&#21457;&#29616;&#38382;&#39064;&#25968;&#37327;&#26174;&#33879;&#19979;&#38477;&#12290;&#27492;&#22806;&#65292;&#22312;ChatGPT&#21457;&#24067;&#21518;&#65292;&#38382;&#39064;&#30340;&#25991;&#26723;&#26356;&#21152;&#23436;&#21892;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#21457;&#29616;&#21097;&#19979;&#30340;&#38382;&#39064;&#26356;&#21152;&#22797;&#26434;&#12290;&#36825;&#20123;&#21457;&#29616;&#19981;&#20165;&#34920;&#26126;&#20102;&#29983;&#20135;&#21147;&#30340;&#25552;&#21319;&#65292;&#32780;&#19988;&#36824;&#34920;&#26126;&#20102;&#25105;&#20204;&#24037;&#20316;&#26041;&#24335;&#30340;&#26681;&#26412;&#21464;&#21270;&#65292;&#20854;&#20013;AI&#35299;&#20915;&#20102;&#24120;&#35268;&#26597;&#35810;&#65292;&#20351;&#20154;&#20204;&#33021;&#22815;&#19987;&#27880;&#20110;&#26356;&#22797;&#26434;&#30340;&#20219;&#21153;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper illustrates how generative AI could give opportunities for big productivity gains but also opens up questions about the impact of these new powerful technologies on the way we work and share knowledge. More specifically, we explore how ChatGPT changed a fundamental aspect of coding: problem-solving. To do so, we exploit the effect of the sudden release of ChatGPT on the 30th of November 2022 on the usage of the largest online community for coders: Stack Overflow. Using quasi-experimental methods (Difference-in-Difference), we find a significant drop in the number of questions. In addition, the questions are better documented after the release of ChatGPT. Finally, we find evidence that the remaining questions are more complex. These findings suggest not only productivity gains but also a fundamental change in the way we work where routine inquiries are solved by AI allowing humans to focus on more complex tasks.
&lt;/p&gt;</description></item><item><title>&#25197;&#26354;&#26368;&#20248;&#20256;&#36755;&#26159;&#19968;&#31181;&#26032;&#30340;&#20256;&#36755;&#26041;&#27861;&#65292;&#36890;&#36807;&#26368;&#23567;&#21270;&#25197;&#26354;&#30340;&#39044;&#26399;&#25104;&#26412;&#26469;&#35299;&#20915;&#20855;&#20307;&#38382;&#39064;&#12290;&#19982;&#32463;&#20856;&#29702;&#35770;&#30456;&#27604;&#65292;&#23427;&#20855;&#26377;&#35768;&#22810;&#29420;&#29305;&#30340;&#29305;&#28857;&#65292;&#21487;&#20197;&#24212;&#29992;&#20110;&#20915;&#31574;&#29702;&#35770;&#12289;&#40065;&#26834;&#20248;&#21270;&#21644;&#39118;&#38505;&#31649;&#29702;&#20013;&#12290;&#20849;&#21333;&#35843;&#32806;&#21512;&#26159;&#22312;&#28385;&#36275;&#19968;&#23450;&#26465;&#20214;&#19979;&#30340;&#26368;&#20248;&#35299;&#12290;&#35813;&#26041;&#27861;&#36824;&#20855;&#26377;&#19968;&#20123;&#23545;&#20598;&#24615;&#21644;&#21807;&#19968;&#24615;&#32467;&#26524;&#12290;</title><link>http://arxiv.org/abs/2308.11238</link><description>&lt;p&gt;
&#25197;&#26354;&#30340;&#26368;&#20248;&#20256;&#36755;
&lt;/p&gt;
&lt;p&gt;
Distorted optimal transport. (arXiv:2308.11238v1 [math.OC])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.11238
&lt;/p&gt;
&lt;p&gt;
&#25197;&#26354;&#26368;&#20248;&#20256;&#36755;&#26159;&#19968;&#31181;&#26032;&#30340;&#20256;&#36755;&#26041;&#27861;&#65292;&#36890;&#36807;&#26368;&#23567;&#21270;&#25197;&#26354;&#30340;&#39044;&#26399;&#25104;&#26412;&#26469;&#35299;&#20915;&#20855;&#20307;&#38382;&#39064;&#12290;&#19982;&#32463;&#20856;&#29702;&#35770;&#30456;&#27604;&#65292;&#23427;&#20855;&#26377;&#35768;&#22810;&#29420;&#29305;&#30340;&#29305;&#28857;&#65292;&#21487;&#20197;&#24212;&#29992;&#20110;&#20915;&#31574;&#29702;&#35770;&#12289;&#40065;&#26834;&#20248;&#21270;&#21644;&#39118;&#38505;&#31649;&#29702;&#20013;&#12290;&#20849;&#21333;&#35843;&#32806;&#21512;&#26159;&#22312;&#28385;&#36275;&#19968;&#23450;&#26465;&#20214;&#19979;&#30340;&#26368;&#20248;&#35299;&#12290;&#35813;&#26041;&#27861;&#36824;&#20855;&#26377;&#19968;&#20123;&#23545;&#20598;&#24615;&#21644;&#21807;&#19968;&#24615;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#32463;&#20856;&#30340;&#26368;&#20248;&#20256;&#36755;&#29702;&#35770;&#26159;&#36890;&#36807;&#26368;&#23567;&#21270;&#20004;&#20010;&#32473;&#23450;&#20998;&#24067;&#20043;&#38388;&#30340;&#39044;&#26399;&#25104;&#26412;&#26469;&#24314;&#31435;&#30340;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#25197;&#26354;&#26368;&#20248;&#20256;&#36755;&#30340;&#26694;&#26550;&#65292;&#36890;&#36807;&#26368;&#23567;&#21270;&#25197;&#26354;&#30340;&#39044;&#26399;&#25104;&#26412;&#26469;&#23454;&#29616;&#12290;&#36825;&#20010;&#26032;&#30340;&#20844;&#24335;&#26159;&#22522;&#20110;&#20915;&#31574;&#29702;&#35770;&#12289;&#40065;&#26834;&#20248;&#21270;&#21644;&#39118;&#38505;&#31649;&#29702;&#20013;&#30340;&#20855;&#20307;&#38382;&#39064;&#32780;&#25552;&#20986;&#30340;&#65292;&#19982;&#32463;&#20856;&#29702;&#35770;&#30456;&#27604;&#20855;&#26377;&#24456;&#22810;&#19981;&#21516;&#30340;&#29305;&#28857;&#12290;&#25105;&#20204;&#36873;&#25321;&#20102;&#31616;&#21333;&#30340;&#25104;&#26412;&#20989;&#25968;&#65292;&#24182;&#30740;&#31350;&#20102;&#19981;&#21516;&#30340;&#25197;&#26354;&#20989;&#25968;&#21450;&#20854;&#23545;&#26368;&#20248;&#20256;&#36755;&#35745;&#21010;&#30340;&#24433;&#21709;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#22312;&#23454;&#32447;&#19978;&#65292;&#24403;&#25197;&#26354;&#20989;&#25968;&#26159;&#20984;&#20989;&#25968;&#19988;&#25104;&#26412;&#20989;&#25968;&#26159;&#27425;&#27169;&#20989;&#25968;&#21644;&#21333;&#35843;&#20989;&#25968;&#26102;&#65292;&#20849;&#21333;&#35843;&#32806;&#21512;&#26159;&#25197;&#26354;&#26368;&#20248;&#20256;&#36755;&#38382;&#39064;&#30340;&#26368;&#20248;&#35299;&#12290;&#25105;&#20204;&#36824;&#25552;&#20379;&#20102;&#19968;&#20123;&#23545;&#20598;&#24615;&#21644;&#21807;&#19968;&#24615;&#32467;&#26524;&#12290;&#23545;&#20110;&#36870;S&#24418;&#25197;&#26354;&#20989;&#25968;&#21644;&#32447;&#24615;&#25104;&#26412;&#65292;&#25105;&#20204;&#24471;&#21040;&#20102;&#25152;&#26377;&#36793;&#38469;&#20998;&#24067;&#30340;&#21807;&#19968;&#26368;&#20248;&#32806;&#21512;&#24418;&#24335;&#65292;&#36825;&#20010;&#24418;&#24335;&#30340;&#32806;&#21512;&#20855;&#26377;&#26377;&#36259;&#30340;&#8220;&#39318;&#20808;&#20849;&#21333;&#35843;&#65292;&#28982;&#21518;&#21453;&#21333;&#35843;&#8221;&#20381;&#36182;&#20851;&#31995;&#12290;
&lt;/p&gt;
&lt;p&gt;
Classic optimal transport theory is built on minimizing the expected cost between two given distributions. We propose the framework of distorted optimal transport by minimizing a distorted expected cost. This new formulation is motivated by concrete problems in decision theory, robust optimization, and risk management, and it has many distinct features compared to the classic theory. We choose simple cost functions and study different distortion functions and their implications on the optimal transport plan. We show that on the real line, the comonotonic coupling is optimal for the distorted optimal transport problem when the distortion function is convex and the cost function is submodular and monotone. Some forms of duality and uniqueness results are provided. For inverse-S-shaped distortion functions and linear cost, we obtain the unique form of optimal coupling for all marginal distributions, which turns out to have an interesting ``first comonotonic, then counter-monotonic" depend
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;&#36793;&#35206;&#30422;&#28216;&#25103;&#30340;&#36817;&#20284;&#26680;&#24515;&#20998;&#37197;&#65292;&#35777;&#26126;&#20102;3/4-&#26680;&#24515;&#22987;&#32456;&#38750;&#31354;&#24182;&#21487;&#20197;&#22312;&#22810;&#39033;&#24335;&#26102;&#38388;&#20869;&#35745;&#31639;&#65292;&#21516;&#26102;&#19982;&#24213;&#23618;&#22270;&#30340;&#26368;&#30701;&#22855;&#25968;&#29615;&#38271;&#24230;&#23545;&#24212;&#12290;</title><link>http://arxiv.org/abs/2308.11222</link><description>&lt;p&gt;
&#36817;&#20284;&#26680;&#24515;&#20998;&#37197;&#30340;&#36793;&#35206;&#30422;&#28216;&#25103;
&lt;/p&gt;
&lt;p&gt;
Approximate Core Allocations for Edge Cover Games. (arXiv:2308.11222v1 [math.CO])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.11222
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;&#36793;&#35206;&#30422;&#28216;&#25103;&#30340;&#36817;&#20284;&#26680;&#24515;&#20998;&#37197;&#65292;&#35777;&#26126;&#20102;3/4-&#26680;&#24515;&#22987;&#32456;&#38750;&#31354;&#24182;&#21487;&#20197;&#22312;&#22810;&#39033;&#24335;&#26102;&#38388;&#20869;&#35745;&#31639;&#65292;&#21516;&#26102;&#19982;&#24213;&#23618;&#22270;&#30340;&#26368;&#30701;&#22855;&#25968;&#29615;&#38271;&#24230;&#23545;&#24212;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#36817;&#20284;&#26680;&#24515;&#20998;&#37197;&#30340;&#36793;&#35206;&#30422;&#28216;&#25103;&#65292;&#36825;&#20123;&#28216;&#25103;&#28304;&#33258;&#36793;&#35206;&#30422;&#38382;&#39064;&#12290;&#22312;&#36825;&#20123;&#28216;&#25103;&#20013;&#65292;&#27599;&#20010;&#29609;&#23478;&#25511;&#21046;&#30528;&#32593;&#32476;G =&#65288;V&#65292;E&#65307;w&#65289;&#19978;&#30340;&#19968;&#20010;&#39030;&#28857;&#65292;&#32852;&#30431;S&#30340;&#25104;&#26412;&#31561;&#20110;&#30001;S&#35825;&#23548;&#30340;&#23376;&#22270;&#20013;&#30340;&#36793;&#35206;&#30422;&#30340;&#26368;&#23567;&#26435;&#37325;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#36793;&#35206;&#30422;&#28216;&#25103;&#30340;3/4-&#26680;&#24515;&#22987;&#32456;&#38750;&#31354;&#65292;&#24182;&#19988;&#21487;&#20197;&#36890;&#36807;&#20351;&#29992;&#32447;&#24615;&#35268;&#21010;&#23545;&#20598;&#26041;&#27861;&#22312;&#22810;&#39033;&#24335;&#26102;&#38388;&#20869;&#35745;&#31639;&#20986;&#26469;&#12290;&#36825;&#20010;&#27604;&#29575;&#26159;&#26368;&#22909;&#30340;&#65292;&#22240;&#20026;&#23427;&#34920;&#31034;&#20102;&#36793;&#35206;&#30422;&#38382;&#39064;&#30340;&#33258;&#28982;LP&#30340;&#25972;&#25968;&#24615;&#38388;&#38553;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#30340;&#20998;&#26512;&#34920;&#26126;&#65292;&#36817;&#20284;&#26680;&#24515;&#30340;&#27604;&#29575;&#19982;&#24213;&#23618;&#22270;&#30340;&#26368;&#30701;&#22855;&#25968;&#29615;&#30340;&#38271;&#24230;&#23545;&#24212;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study the approximate core for edge cover games, which are cooperative games stemming from edge cover problems. In these games, each player controls a vertex on a network $G = (V, E; w)$, and the cost of a coalition $S\subseteq V$ is equivalent to the minimum weight of edge covers in the subgraph induced by $S$. We prove that the 3/4-core of edge cover games is always non-empty and can be computed in polynomial time by using linear program duality approach. This ratio is the best possible, as it represents the integrality gap of the natural LP for edge cover problems. Moreover, our analysis reveals that the ratio of approximate core corresponds with the length of the shortest odd cycle of underlying graphs.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#20351;&#29992;&#32454;&#20998;&#39044;&#27979;&#21644;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#26469;&#39044;&#27979;&#36890;&#32960;&#30340;&#26377;&#25928;&#24615;&#65292;&#21457;&#29616;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#22312;&#39044;&#27979;&#20934;&#30830;&#24615;&#19978;&#20248;&#20110;&#20256;&#32479;&#30340;&#26102;&#38388;&#24207;&#21015;&#27169;&#22411;&#65292;&#29305;&#21035;&#22312;&#39044;&#27979;&#32454;&#20998;&#25968;&#25454;&#26041;&#38754;&#34920;&#29616;&#20986;&#33394;&#12290;</title><link>http://arxiv.org/abs/2308.11173</link><description>&lt;p&gt;
&#20351;&#29992;&#32454;&#20998;&#21644;&#26426;&#22120;&#23398;&#20064;&#39044;&#27979;&#36890;&#32960;
&lt;/p&gt;
&lt;p&gt;
Forecasting inflation using disaggregates and machine learning. (arXiv:2308.11173v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.11173
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#20351;&#29992;&#32454;&#20998;&#39044;&#27979;&#21644;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#26469;&#39044;&#27979;&#36890;&#32960;&#30340;&#26377;&#25928;&#24615;&#65292;&#21457;&#29616;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#22312;&#39044;&#27979;&#20934;&#30830;&#24615;&#19978;&#20248;&#20110;&#20256;&#32479;&#30340;&#26102;&#38388;&#24207;&#21015;&#27169;&#22411;&#65292;&#29305;&#21035;&#22312;&#39044;&#27979;&#32454;&#20998;&#25968;&#25454;&#26041;&#38754;&#34920;&#29616;&#20986;&#33394;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#19968;&#20123;&#39044;&#27979;&#36890;&#32960;&#30340;&#26041;&#27861;&#30340;&#26377;&#25928;&#24615;&#65292;&#37325;&#28857;&#20851;&#27880;&#32454;&#20998;&#39044;&#27979;-&#22312;&#25991;&#29486;&#20013;&#20063;&#34987;&#31216;&#20026;&#33258;&#19979;&#32780;&#19978;&#30340;&#26041;&#27861;&#12290;&#26412;&#25991;&#20197;&#24052;&#35199;&#20026;&#26696;&#20363;&#65292;&#32771;&#34385;&#20102;&#19981;&#21516;&#31243;&#24230;&#30340;&#36890;&#32960;&#32454;&#20998;&#65292;&#24182;&#37319;&#29992;&#20102;&#19968;&#31995;&#21015;&#20256;&#32479;&#30340;&#26102;&#38388;&#24207;&#21015;&#25216;&#26415;&#20197;&#21450;&#32447;&#24615;&#21644;&#38750;&#32447;&#24615;&#30340;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#26469;&#22788;&#29702;&#26356;&#22810;&#30340;&#39044;&#27979;&#22240;&#23376;&#12290;&#23545;&#20110;&#35768;&#22810;&#39044;&#27979;&#26102;&#38388;&#27573;&#65292;&#32454;&#20998;&#39044;&#27979;&#30340;&#32858;&#21512;&#25928;&#26524;&#19982;&#22522;&#20110;&#35843;&#26597;&#30340;&#39044;&#26399;&#21644;&#30452;&#25509;&#20351;&#29992;&#24635;&#20307;&#36827;&#34892;&#39044;&#27979;&#30340;&#27169;&#22411;&#19968;&#26679;&#22909;&#12290;&#24635;&#20307;&#32780;&#35328;&#65292;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#22312;&#39044;&#27979;&#20934;&#30830;&#24615;&#19978;&#20248;&#20110;&#20256;&#32479;&#30340;&#26102;&#38388;&#24207;&#21015;&#27169;&#22411;&#65292;&#22312;&#39044;&#27979;&#32454;&#20998;&#25968;&#25454;&#26041;&#38754;&#34920;&#29616;&#20986;&#33394;&#12290;&#25105;&#20204;&#30340;&#32467;&#26524;&#24378;&#35843;&#20102;&#22312;&#36890;&#32960;&#39044;&#27979;&#20013;&#21033;&#29992;&#25968;&#25454;&#20016;&#23500;&#30340;&#29615;&#22659;&#20013;&#30340;&#27169;&#22411;&#30340;&#22909;&#22788;&#65292;&#21253;&#25324;&#20174;&#26426;&#22120;&#23398;&#20064;&#25216;&#26415;&#20013;&#32858;&#21512;&#32454;&#20998;&#39044;&#27979;&#65292;&#23588;&#20854;&#26159;&#22312;&#27874;&#21160;&#26102;&#26399;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper examines the effectiveness of several forecasting methods for predicting inflation, focusing on aggregating disaggregated forecasts - also known in the literature as the bottom-up approach. Taking the Brazilian case as an application, we consider different disaggregation levels for inflation and employ a range of traditional time series techniques as well as linear and nonlinear machine learning (ML) models to deal with a larger number of predictors. For many forecast horizons, the aggregation of disaggregated forecasts performs just as well survey-based expectations and models that generate forecasts using the aggregate directly. Overall, ML methods outperform traditional time series models in predictive accuracy, with outstanding performance in forecasting disaggregates. Our results reinforce the benefits of using models in a data-rich environment for inflation forecasting, including aggregating disaggregated forecasts from ML techniques, mainly during volatile periods. St
&lt;/p&gt;</description></item><item><title>&#32463;&#27982;&#23398;&#23478;&#35748;&#20026;&#38463;&#32599;&#21644;&#24503;&#24067;&#40065;&#30340;&#24191;&#20041;&#22343;&#34913;&#27169;&#22411;&#19981;&#33021;&#20934;&#30830;&#25551;&#36848;&#19981;&#26029;&#21464;&#21270;&#30340;&#24066;&#22330;&#65292;&#32780;&#21476;&#20856;&#35266;&#28857;&#23545;&#24066;&#22330;&#26426;&#21046;&#25552;&#20379;&#20102;&#26356;&#22909;&#30340;&#35299;&#37322;&#12290;</title><link>http://arxiv.org/abs/2308.11069</link><description>&lt;p&gt;
&#21476;&#20856;&#32463;&#27982;&#23398;&#65306;&#36951;&#22833;&#19982;&#37325;&#25342;
&lt;/p&gt;
&lt;p&gt;
Classical Economics: Lost and Found. (arXiv:2308.11069v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.11069
&lt;/p&gt;
&lt;p&gt;
&#32463;&#27982;&#23398;&#23478;&#35748;&#20026;&#38463;&#32599;&#21644;&#24503;&#24067;&#40065;&#30340;&#24191;&#20041;&#22343;&#34913;&#27169;&#22411;&#19981;&#33021;&#20934;&#30830;&#25551;&#36848;&#19981;&#26029;&#21464;&#21270;&#30340;&#24066;&#22330;&#65292;&#32780;&#21476;&#20856;&#35266;&#28857;&#23545;&#24066;&#22330;&#26426;&#21046;&#25552;&#20379;&#20102;&#26356;&#22909;&#30340;&#35299;&#37322;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24403;&#32463;&#27982;&#23398;&#23478;&#23558;&#38463;&#32599;&#21644;&#24503;&#24067;&#40065;&#30340;&#24191;&#20041;&#22343;&#34913;&#27169;&#22411;&#35270;&#20026;&#20934;&#30830;&#25551;&#36848;&#23454;&#38469;&#19981;&#26029;&#21464;&#21270;&#30340;&#24066;&#22330;&#26102;&#65292;&#20182;&#20204;&#38169;&#36807;&#20102;&#30495;&#23454;&#19990;&#30028;&#20013;&#24066;&#22330;&#30340;&#26412;&#36136;&#12290;&#30456;&#27604;&#20043;&#19979;&#65292;&#21476;&#20856;&#35266;&#28857;&#23545;&#24066;&#22330;&#26426;&#21046;&#25552;&#20379;&#20102;&#19968;&#20010;&#26377;&#30410;&#30340;&#22522;&#30784;&#65292;&#21487;&#20197;&#34701;&#20837;&#29616;&#20195;&#30340;&#35265;&#35299;&#65292;&#35299;&#37322;&#24066;&#22330;&#22914;&#20309;&#21019;&#36896;&#21644;&#21327;&#35843;&#20449;&#24687;&#12290;
&lt;/p&gt;
&lt;p&gt;
"Economists miss the boat when they act as if Arrow and Debreu's general equilibrium model accurately describes markets in the real world of constant change. In contrast, the classical view on the market mechanism offers a helpful foundation on which to add modern insights about how markets create and coordinate information."
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#35843;&#26597;&#20102;&#26426;&#22120;&#23398;&#20064;&#22312;&#32463;&#27982;&#39044;&#27979;&#20013;&#30340;&#26368;&#26032;&#36827;&#23637;&#65292;&#21253;&#25324;&#21363;&#26102;&#39044;&#27979;&#12289;&#25991;&#26412;&#25968;&#25454;&#12289;&#38754;&#26495;&#21644;&#24352;&#37327;&#25968;&#25454;&#12289;Granger&#22240;&#26524;&#20851;&#31995;&#27979;&#35797;&#12289;&#26102;&#38388;&#24207;&#21015;&#20132;&#21449;&#39564;&#35777;&#21644;&#32463;&#27982;&#25439;&#22833;&#20998;&#31867;&#12290;</title><link>http://arxiv.org/abs/2308.10993</link><description>&lt;p&gt;
&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#22312;&#32463;&#27982;&#39044;&#27979;&#20013;&#30340;&#35745;&#37327;&#32463;&#27982;&#23398;
&lt;/p&gt;
&lt;p&gt;
Econometrics of Machine Learning Methods in Economic Forecasting. (arXiv:2308.10993v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.10993
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#35843;&#26597;&#20102;&#26426;&#22120;&#23398;&#20064;&#22312;&#32463;&#27982;&#39044;&#27979;&#20013;&#30340;&#26368;&#26032;&#36827;&#23637;&#65292;&#21253;&#25324;&#21363;&#26102;&#39044;&#27979;&#12289;&#25991;&#26412;&#25968;&#25454;&#12289;&#38754;&#26495;&#21644;&#24352;&#37327;&#25968;&#25454;&#12289;Granger&#22240;&#26524;&#20851;&#31995;&#27979;&#35797;&#12289;&#26102;&#38388;&#24207;&#21015;&#20132;&#21449;&#39564;&#35777;&#21644;&#32463;&#27982;&#25439;&#22833;&#20998;&#31867;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#27010;&#36848;&#20102;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#22312;&#32463;&#27982;&#39044;&#27979;&#20013;&#30340;&#26368;&#26032;&#36827;&#23637;&#12290;&#35813;&#35843;&#26597;&#28085;&#30422;&#20102;&#20197;&#19979;&#20027;&#39064;&#65306;&#21363;&#26102;&#39044;&#27979;&#12289;&#25991;&#26412;&#25968;&#25454;&#12289;&#38754;&#26495;&#21644;&#24352;&#37327;&#25968;&#25454;&#12289;&#39640;&#32500;Granger&#22240;&#26524;&#20851;&#31995;&#27979;&#35797;&#12289;&#26102;&#38388;&#24207;&#21015;&#20132;&#21449;&#39564;&#35777;&#12289;&#32463;&#27982;&#25439;&#22833;&#20998;&#31867;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper surveys the recent advances in machine learning method for economic forecasting. The survey covers the following topics: nowcasting, textual data, panel and tensor data, high-dimensional Granger causality tests, time series cross-validation, classification with economic losses.
&lt;/p&gt;</description></item><item><title>"&#24341;&#29992;GPT&#30340;&#8220;&#35930;&#40736;&#35797;&#39564;&#8221;&#26159;&#19968;&#31181;&#21019;&#26032;&#30340;&#26234;&#33021;&#20195;&#29702;&#24314;&#27169;&#26041;&#27861;&#65292;&#21033;&#29992;&#26234;&#33021;&#20195;&#29702;&#20195;&#34920;&#20225;&#19994;&#36827;&#34892;&#31454;&#20105;&#21644;&#21246;&#32467;&#30740;&#31350;&#12290;&#23427;&#27604;&#20351;&#29992;&#20154;&#31867;&#20027;&#20307;&#36827;&#34892;&#23454;&#39564;&#26356;&#20855;&#25104;&#26412;&#25928;&#30410;&#21644;&#28789;&#27963;&#24615;&#65292;&#24182;&#23637;&#29616;&#20986;&#36229;&#36234;&#20256;&#32479;&#20195;&#29702;&#24314;&#27169;&#26041;&#27861;&#30340;&#33021;&#21147;&#12290;"</title><link>http://arxiv.org/abs/2308.10974</link><description>&lt;p&gt;
"&#24341;&#29992;GPT&#30340;&#8220;&#35930;&#40736;&#35797;&#39564;&#8221;&#65306;&#19968;&#31181;&#30740;&#31350;&#20225;&#19994;&#31454;&#20105;&#21644;&#21246;&#32467;&#30340;&#21019;&#26032;&#26234;&#33021;&#20195;&#29702;&#24314;&#27169;&#26041;&#27861;"
&lt;/p&gt;
&lt;p&gt;
"Guinea Pig Trials" Utilizing GPT: A Novel Smart Agent-Based Modeling Approach for Studying Firm Competition and Collusion. (arXiv:2308.10974v1 [cs.AI])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.10974
&lt;/p&gt;
&lt;p&gt;
"&#24341;&#29992;GPT&#30340;&#8220;&#35930;&#40736;&#35797;&#39564;&#8221;&#26159;&#19968;&#31181;&#21019;&#26032;&#30340;&#26234;&#33021;&#20195;&#29702;&#24314;&#27169;&#26041;&#27861;&#65292;&#21033;&#29992;&#26234;&#33021;&#20195;&#29702;&#20195;&#34920;&#20225;&#19994;&#36827;&#34892;&#31454;&#20105;&#21644;&#21246;&#32467;&#30740;&#31350;&#12290;&#23427;&#27604;&#20351;&#29992;&#20154;&#31867;&#20027;&#20307;&#36827;&#34892;&#23454;&#39564;&#26356;&#20855;&#25104;&#26412;&#25928;&#30410;&#21644;&#28789;&#27963;&#24615;&#65292;&#24182;&#23637;&#29616;&#20986;&#36229;&#36234;&#20256;&#32479;&#20195;&#29702;&#24314;&#27169;&#26041;&#27861;&#30340;&#33021;&#21147;&#12290;"
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20225;&#19994;&#31454;&#20105;&#21644;&#21246;&#32467;&#28041;&#21450;&#22797;&#26434;&#30340;&#21160;&#24577;&#65292;&#23588;&#20854;&#26159;&#32771;&#34385;&#21040;&#20225;&#19994;&#20043;&#38388;&#30340;&#27807;&#36890;&#12290;&#36825;&#20123;&#38382;&#39064;&#21487;&#20197;&#34987;&#24314;&#27169;&#20026;&#22797;&#26434;&#31995;&#32479;&#30340;&#38382;&#39064;&#65292;&#20256;&#32479;&#19978;&#36890;&#36807;&#28041;&#21450;&#20154;&#31867;&#20027;&#20307;&#25110;&#22522;&#20110;&#20195;&#29702;&#30340;&#24314;&#27169;&#26041;&#27861;&#36827;&#34892;&#25506;&#31350;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#21019;&#26032;&#30340;&#26694;&#26550;&#65292;&#31216;&#20026;&#26234;&#33021;&#20195;&#29702;&#24314;&#27169;&#65288;SABM&#65289;&#65292;&#20854;&#20013;&#30001;GPT-4&#25216;&#26415;&#25903;&#25345;&#30340;&#26234;&#33021;&#20195;&#29702;&#20195;&#34920;&#20225;&#19994;&#24182;&#30456;&#20114;&#20132;&#20114;&#12290;&#25105;&#20204;&#36827;&#34892;&#20102;&#19968;&#39033;&#25511;&#21046;&#23454;&#39564;&#65292;&#30740;&#31350;&#20102;&#19981;&#21516;&#26465;&#20214;&#19979;&#20225;&#19994;&#20215;&#26684;&#31454;&#20105;&#21644;&#21246;&#32467;&#34892;&#20026;&#12290;&#19982;&#20351;&#29992;&#20154;&#31867;&#20027;&#20307;&#36827;&#34892;&#23454;&#39564;&#30456;&#27604;&#65292;SABM&#26356;&#20855;&#25104;&#26412;&#25928;&#30410;&#21644;&#28789;&#27963;&#24615;&#12290;&#26234;&#33021;&#20195;&#29702;&#25317;&#26377;&#20915;&#31574;&#30340;&#24191;&#27867;&#30693;&#35782;&#24211;&#65292;&#23637;&#29616;&#20986;&#31867;&#20284;&#20154;&#31867;&#30340;&#25112;&#30053;&#33021;&#21147;&#65292;&#36229;&#36234;&#20102;&#20256;&#32479;&#30340;&#22522;&#20110;&#20195;&#29702;&#30340;&#24314;&#27169;&#26041;&#27861;&#12290;&#27492;&#22806;&#65292;&#26234;&#33021;&#20195;&#29702;&#33021;&#22815;&#27169;&#25311;&#20154;&#31867;&#23545;&#35805;&#24182;&#20010;&#24615;&#21270;&#65292;&#20351;&#20854;&#25104;&#20026;&#30740;&#31350;&#28041;&#21450;&#27807;&#36890;&#30340;&#22797;&#26434;&#24773;&#20917;&#30340;&#29702;&#24819;&#36873;&#25321;&#12290;&#25105;&#20204;&#30340;&#32467;&#26524;&#34920;&#26126;...
&lt;/p&gt;
&lt;p&gt;
Firm competition and collusion involve complex dynamics, particularly when considering communication among firms. Such issues can be modeled as problems of complex systems, traditionally approached through experiments involving human subjects or agent-based modeling methods. We propose an innovative framework called Smart Agent-Based Modeling (SABM), wherein smart agents, supported by GPT-4 technologies, represent firms, and interact with one another. We conducted a controlled experiment to study firm price competition and collusion behaviors under various conditions. SABM is more cost-effective and flexible compared to conducting experiments with human subjects. Smart agents possess an extensive knowledge base for decision-making and exhibit human-like strategic abilities, surpassing traditional ABM agents. Furthermore, smart agents can simulate human conversation and be personalized, making them ideal for studying complex situations involving communication. Our results demonstrate th
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#37325;&#26032;&#25506;&#35752;&#20102;&#37327;&#21270;&#26102;&#38388;&#24207;&#21015;&#22238;&#24402;&#27169;&#22411;&#30340;&#26368;&#26032;&#21457;&#23637;&#65292;&#21253;&#25324;&#22312;&#24179;&#31283;&#21644;&#38750;&#24179;&#31283;&#32972;&#26223;&#19979;&#30340;&#24212;&#29992;&#12290;</title><link>http://arxiv.org/abs/2308.06617</link><description>&lt;p&gt;
&#37327;&#21270;&#26102;&#38388;&#24207;&#21015;&#22238;&#24402;&#27169;&#22411;&#30340;&#20877;&#25506;&#35752;
&lt;/p&gt;
&lt;p&gt;
Quantile Time Series Regression Models Revisited. (arXiv:2308.06617v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.06617
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#37325;&#26032;&#25506;&#35752;&#20102;&#37327;&#21270;&#26102;&#38388;&#24207;&#21015;&#22238;&#24402;&#27169;&#22411;&#30340;&#26368;&#26032;&#21457;&#23637;&#65292;&#21253;&#25324;&#22312;&#24179;&#31283;&#21644;&#38750;&#24179;&#31283;&#32972;&#26223;&#19979;&#30340;&#24212;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#35752;&#35770;&#20102;&#37327;&#21270;&#26102;&#38388;&#24207;&#21015;&#27169;&#22411;&#22312;&#24179;&#31283;&#21644;&#38750;&#24179;&#31283;&#32972;&#26223;&#19979;&#30340;&#26368;&#26032;&#21457;&#23637;&#12290;
&lt;/p&gt;
&lt;p&gt;
This article discusses recent developments in the literature of quantile time series models in the cases of stationary and nonstationary underline stochastic processes.
&lt;/p&gt;</description></item><item><title>&#25105;&#20204;&#30740;&#31350;&#20102;&#30899;&#31246;&#22312;&#20449;&#36151;&#32452;&#21512;&#20013;&#30340;&#20256;&#25773;&#65292;&#36890;&#36807;&#32771;&#34385;&#23439;&#35266;&#32463;&#27982;&#22240;&#32032;&#65292;&#25551;&#36848;&#20102;&#30899;&#31246;&#23545;&#20844;&#21496;&#20215;&#20540;&#21644;&#20449;&#36151;&#39118;&#38505;&#30340;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2307.12695</link><description>&lt;p&gt;
&#30899;&#31246;&#22312;&#20449;&#36151;&#32452;&#21512;&#20013;&#30340;&#20256;&#25773;&#36890;&#36807;&#23439;&#35266;&#32463;&#27982;&#22240;&#32032;
&lt;/p&gt;
&lt;p&gt;
Propagation of carbon tax in credit portfolio through macroeconomic factors. (arXiv:2307.12695v1 [q-fin.RM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.12695
&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#30899;&#31246;&#22312;&#20449;&#36151;&#32452;&#21512;&#20013;&#30340;&#20256;&#25773;&#65292;&#36890;&#36807;&#32771;&#34385;&#23439;&#35266;&#32463;&#27982;&#22240;&#32032;&#65292;&#25551;&#36848;&#20102;&#30899;&#31246;&#23545;&#20844;&#21496;&#20215;&#20540;&#21644;&#20449;&#36151;&#39118;&#38505;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#30899;&#31246;&#22312;&#23553;&#38381;&#32463;&#27982;&#20013;&#22914;&#20309;&#22312;&#20449;&#36151;&#32452;&#21512;&#20013;&#20256;&#25773;&#65292;&#24182;&#20934;&#30830;&#25551;&#36848;&#20102;&#30899;&#31246;&#21160;&#24577;&#22914;&#20309;&#24433;&#21709;&#20844;&#21496;&#20215;&#20540;&#21644;&#20449;&#36151;&#39118;&#38505;&#24230;&#37327;&#12290;&#25105;&#20204;&#37319;&#29992;&#38543;&#26426;&#22810;&#37096;&#38376;&#27169;&#22411;&#26469;&#32771;&#34385;&#30899;&#31246;&#23545;&#37096;&#38376;&#20844;&#21496;&#29983;&#20135;&#21644;&#23478;&#24237;&#28040;&#36153;&#30340;&#24433;&#21709;&#12290;&#31246;&#25910;&#26681;&#25454;NGFS&#24773;&#26223;&#25552;&#20379;&#30340;&#30899;&#20215;&#26684;&#36827;&#34892;&#26657;&#20934;&#65292;&#20197;&#21450;&#37096;&#38376;&#23478;&#24237;&#28040;&#36153;&#21644;&#20844;&#21496;&#29983;&#20135;&#20197;&#21450;&#20854;&#30456;&#20851;&#28201;&#23460;&#27668;&#20307;&#25490;&#25918;&#12290;&#23545;&#20110;&#27599;&#20010;&#37096;&#38376;&#65292;&#36825;&#20135;&#29983;&#20102;&#20844;&#21496;&#29983;&#20135;&#21644;&#23478;&#24237;&#28040;&#36153;&#23545;&#30899;&#31246;&#30340;&#25935;&#24863;&#24230;&#20197;&#21450;&#37096;&#38376;&#20043;&#38388;&#30340;&#20851;&#31995;&#12290;&#25105;&#20204;&#30340;&#27169;&#22411;&#20801;&#35768;&#25105;&#20204;&#20998;&#26512;&#30701;&#26399;&#30899;&#31246;&#30340;&#24433;&#21709;&#65292;&#19982;&#26631;&#20934;&#30340;&#25972;&#20307;&#35780;&#20272;&#27169;&#22411;&#30456;&#21453;&#65292;&#21518;&#32773;&#26082;&#26159;&#30830;&#23450;&#24615;&#30340;&#65292;&#21448;&#21482;&#33021;&#25429;&#25417;&#27668;&#20505;&#36807;&#28193;&#25919;&#31574;&#30340;&#38271;&#26399;&#36235;&#21183;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#20351;&#29992;&#25240;&#29616;&#29616;&#37329;&#27969;&#37327;&#27861;&#26469;&#35745;&#31639;&#20844;&#21496;&#30340;&#20215;&#20540;&#65292;&#28982;&#21518;&#29992;&#23427;&#26469;&#36827;&#34892;&#36164;&#20135;&#23450;&#20215;&#21644;&#20449;&#29992;&#39118;&#38505;&#35780;&#20272;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study how the introduction of carbon taxes in a closed economy propagate in a credit portfolio and precisely describe how carbon taxes dynamics affect the firm value and credit risk measures. We adapt a stochastic multisectoral model to take into account carbon taxes on both sectoral firms' production and household's consumption. Taxes are calibrated on carbon prices, provided by the NGFS scenarios, as well as on sectoral households' consumption and firms' production, together with their related greenhouse gases emissions. For each sector, this yields the sensitivity of firms' production and households' consumption to carbon taxes and the relationships between sectors. Our model allows us to analyze the short-term effects of carbon taxes as opposed to standard Integrated Assessment Models, which are not only deterministic but also only capture long-term trends of climate transition policy. Finally, we use a Discounted Cash Flows methodology to compute firms' values which we then use
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#36890;&#36807;&#19968;&#31181;&#37327;&#21270;&#29702;&#35770;&#26041;&#27861;&#20248;&#21270;&#19981;&#36830;&#32493;&#21464;&#37327;&#30340;&#35774;&#35745;&#65292;&#20197;&#24179;&#34913;&#25928;&#24212;&#22823;&#23567;&#30340;&#22686;&#30410;&#21644;&#25439;&#22833;&#65292;&#24182;&#24320;&#21457;&#20102;&#19968;&#31181;&#35745;&#31639;&#25928;&#29575;&#39640;&#30340;&#24378;&#21270;&#23398;&#20064;&#31639;&#27861;&#12290;</title><link>http://arxiv.org/abs/2305.08559</link><description>&lt;p&gt;
&#35774;&#35745;&#19981;&#36830;&#32493;&#24615;
&lt;/p&gt;
&lt;p&gt;
Designing Discontinuities. (arXiv:2305.08559v1 [cs.IT])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.08559
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36890;&#36807;&#19968;&#31181;&#37327;&#21270;&#29702;&#35770;&#26041;&#27861;&#20248;&#21270;&#19981;&#36830;&#32493;&#21464;&#37327;&#30340;&#35774;&#35745;&#65292;&#20197;&#24179;&#34913;&#25928;&#24212;&#22823;&#23567;&#30340;&#22686;&#30410;&#21644;&#25439;&#22833;&#65292;&#24182;&#24320;&#21457;&#20102;&#19968;&#31181;&#35745;&#31639;&#25928;&#29575;&#39640;&#30340;&#24378;&#21270;&#23398;&#20064;&#31639;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#19981;&#36830;&#32493;&#24615;&#21487;&#20197;&#26159;&#30456;&#24403;&#20219;&#24847;&#30340;&#65292;&#20294;&#20063;&#20250;&#22312;&#31038;&#20250;&#31995;&#32479;&#20013;&#20135;&#29983;&#37325;&#22823;&#24433;&#21709;&#12290;&#20107;&#23454;&#19978;&#65292;&#23427;&#20204;&#30340;&#20219;&#24847;&#24615;&#26159;&#20026;&#20160;&#20040;&#23427;&#20204;&#34987;&#29992;&#20110;&#25512;&#26029;&#22312;&#35768;&#22810;&#24773;&#20917;&#19979;&#21464;&#37327;&#20043;&#38388;&#30340;&#22240;&#26524;&#20851;&#31995;&#12290;&#35745;&#37327;&#32463;&#27982;&#23398;&#20013;&#30340;&#22238;&#24402;&#19981;&#36830;&#32493;&#24615;&#20551;&#23450;&#23384;&#22312;&#19968;&#20010;&#19981;&#36830;&#32493;&#30340;&#21464;&#37327;&#65292;&#23558;&#20154;&#21475;&#20998;&#25104;&#19981;&#21516;&#30340;&#37096;&#20998;&#65292;&#20197;&#20272;&#35745;&#32473;&#23450;&#29616;&#35937;&#30340;&#22240;&#26524;&#25928;&#24212;&#12290;&#22312;&#36825;&#37324;&#65292;&#25105;&#20204;&#32771;&#34385;&#20026;&#32473;&#23450;&#30340;&#19981;&#36830;&#32493;&#21464;&#37327;&#35774;&#35745;&#20998;&#21306;&#20197;&#20248;&#21270;&#20197;&#21069;&#20351;&#29992;&#22238;&#24402;&#19981;&#36830;&#32493;&#24615;&#30740;&#31350;&#36807;&#30340;&#26576;&#31181;&#25928;&#26524;&#12290;&#20026;&#27492;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#37327;&#21270;&#29702;&#35770;&#26041;&#27861;&#26469;&#20248;&#21270;&#24863;&#20852;&#36259;&#30340;&#25928;&#26524;&#65292;&#39318;&#20808;&#23398;&#20064;&#32473;&#23450;&#19981;&#36830;&#32493;&#21464;&#37327;&#30340;&#22240;&#26524;&#25928;&#24212;&#22823;&#23567;&#65292;&#28982;&#21518;&#24212;&#29992;&#21160;&#24577;&#35268;&#21010;&#26469;&#20248;&#21270;&#19981;&#36830;&#32493;&#24615;&#30340;&#37327;&#21270;&#35774;&#35745;&#65292;&#20197;&#24179;&#34913;&#22686;&#30410;&#21644;&#25439;&#22833;&#30340;&#25928;&#24212;&#22823;&#23567;&#12290;&#25105;&#20204;&#36824;&#24320;&#21457;&#20102;&#19968;&#31181;&#35745;&#31639;&#25928;&#29575;&#39640;&#30340;&#24378;&#21270;&#23398;&#20064;&#31639;&#27861;&#65292;&#29992;&#20110;&#24418;&#25104;&#21160;&#24577;&#35268;&#21010;&#20844;&#24335;&#12290;
&lt;/p&gt;
&lt;p&gt;
Discontinuities can be fairly arbitrary but also cause a significant impact on outcomes in social systems. Indeed, their arbitrariness is why they have been used to infer causal relationships among variables in numerous settings. Regression discontinuity from econometrics assumes the existence of a discontinuous variable that splits the population into distinct partitions to estimate the causal effects of a given phenomenon. Here we consider the design of partitions for a given discontinuous variable to optimize a certain effect previously studied using regression discontinuity. To do so, we propose a quantization-theoretic approach to optimize the effect of interest, first learning the causal effect size of a given discontinuous variable and then applying dynamic programming for optimal quantization design of discontinuities that balance the gain and loss in the effect size. We also develop a computationally-efficient reinforcement learning algorithm for the dynamic programming formul
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#32771;&#34385;&#20102;&#39640;&#24230;&#36807;&#21442;&#25968;&#21270;&#30340;&#22240;&#26524;&#25512;&#26029;&#27169;&#22411;&#65292;&#25506;&#35752;&#20102;&#22810;&#20010;&#25511;&#21046;&#21333;&#20803;&#30340;&#39640;&#32500;&#21512;&#25104;&#25511;&#21046;&#20272;&#35745;&#24615;&#33021;&#65292;&#21457;&#29616;&#22686;&#21152;&#25511;&#21046;&#21333;&#20803;&#21487;&#20197;&#24110;&#21161;&#25552;&#39640;&#22635;&#20805;&#24615;&#33021;&#65292;&#29978;&#33267;&#36229;&#36807;&#20102;&#39044;&#22788;&#29702;&#25311;&#21512;&#23436;&#32654;&#30340;&#28857;&#12290;</title><link>http://arxiv.org/abs/2305.00700</link><description>&lt;p&gt;
&#22240;&#26524;&#25512;&#26029;&#20013;&#30340;&#21452;&#37325;&#21644;&#21333;&#19968;&#19979;&#38477;&#29616;&#35937;&#65292;&#21450;&#20854;&#22312;&#39640;&#32500;&#21512;&#25104;&#25511;&#21046;&#20013;&#30340;&#24212;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;
Double and Single Descent in Causal Inference with an Application to High-Dimensional Synthetic Control. (arXiv:2305.00700v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.00700
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#32771;&#34385;&#20102;&#39640;&#24230;&#36807;&#21442;&#25968;&#21270;&#30340;&#22240;&#26524;&#25512;&#26029;&#27169;&#22411;&#65292;&#25506;&#35752;&#20102;&#22810;&#20010;&#25511;&#21046;&#21333;&#20803;&#30340;&#39640;&#32500;&#21512;&#25104;&#25511;&#21046;&#20272;&#35745;&#24615;&#33021;&#65292;&#21457;&#29616;&#22686;&#21152;&#25511;&#21046;&#21333;&#20803;&#21487;&#20197;&#24110;&#21161;&#25552;&#39640;&#22635;&#20805;&#24615;&#33021;&#65292;&#29978;&#33267;&#36229;&#36807;&#20102;&#39044;&#22788;&#29702;&#25311;&#21512;&#23436;&#32654;&#30340;&#28857;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#38024;&#23545;&#26426;&#22120;&#23398;&#20064;&#20013;&#30340;&#21452;&#37325;&#19979;&#38477;&#29616;&#35937;&#65292;&#32771;&#34385;&#20102;&#39640;&#24230;&#36807;&#21442;&#25968;&#21270;&#30340;&#22240;&#26524;&#25512;&#26029;&#27169;&#22411;&#65292;&#21253;&#25324;&#22810;&#20010;&#25511;&#21046;&#21333;&#20803;&#30340;&#21512;&#25104;&#25511;&#21046;&#12290;&#22312;&#36825;&#31181;&#27169;&#22411;&#20013;&#65292;&#21487;&#33021;&#23384;&#22312;&#22826;&#22810;&#30340;&#33258;&#30001;&#21442;&#25968;&#65292;&#20197;&#33267;&#20110;&#27169;&#22411;&#21487;&#20197;&#23436;&#32654;&#22320;&#25311;&#21512;&#35757;&#32451;&#25968;&#25454;&#12290;&#26412;&#25991;&#39318;&#20808;&#20197;&#39640;&#32500;&#32447;&#24615;&#22238;&#24402;&#27169;&#22411;&#20026;&#20363;&#65292;&#30740;&#31350;&#34218;&#36164;&#25968;&#25454;&#30340;&#22635;&#20805;&#65292;&#21457;&#29616;&#27604;&#31616;&#21333;&#27169;&#22411;&#26356;&#22810;&#30340;&#21327;&#21464;&#37327;&#23545;&#20110;&#27169;&#22411;&#24615;&#33021;&#30340;&#25552;&#21319;&#24456;&#26377;&#25928;&#12290;&#26412;&#25991;&#30340;&#20027;&#35201;&#36129;&#29486;&#22312;&#20110;&#25506;&#35752;&#20102;&#22810;&#20010;&#25511;&#21046;&#21333;&#20803;&#30340;&#39640;&#32500;&#21512;&#25104;&#25511;&#21046;&#20272;&#35745;&#24615;&#33021;&#65292;&#21457;&#29616;&#22686;&#21152;&#25511;&#21046;&#21333;&#20803;&#21487;&#20197;&#24110;&#21161;&#25552;&#39640;&#22635;&#20805;&#24615;&#33021;&#65292;&#29978;&#33267;&#36229;&#36807;&#20102;&#39044;&#22788;&#29702;&#25311;&#21512;&#23436;&#32654;&#30340;&#28857;&#12290;&#27492;&#22806;&#65292;&#26412;&#25991;&#25552;&#20986;&#19968;&#31181;&#32479;&#19968;&#30340;&#29702;&#35770;&#35270;&#35282;&#26469;&#35299;&#37322;&#36825;&#20123;&#39640;&#32500;&#27169;&#22411;&#30340;&#24615;&#33021;&#65292;&#21363;&#23558;&#26356;&#22797;&#26434;&#30340;&#27169;&#22411;&#35270;&#20026;&#23545;&#31616;&#21333;&#27169;&#22411;&#30340;&#27169;&#22411;&#24179;&#22343;&#20272;&#35745;&#12290;
&lt;/p&gt;
&lt;p&gt;
Motivated by a recent literature on the double-descent phenomenon in machine learning, we consider highly over-parametrized models in causal inference, including synthetic control with many control units. In such models, there may be so many free parameters that the model fits the training data perfectly. As a motivating example, we first investigate high-dimensional linear regression for imputing wage data, where we find that models with many more covariates than sample size can outperform simple ones. As our main contribution, we document the performance of high-dimensional synthetic control estimators with many control units. We find that adding control units can help improve imputation performance even beyond the point where the pre-treatment fit is perfect. We then provide a unified theoretical perspective on the performance of these high-dimensional models. Specifically, we show that more complex models can be interpreted as model-averaging estimators over simpler ones, which we 
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#21457;&#23637;&#20102;&#19968;&#20010;&#40065;&#26834;&#30340;&#24191;&#20041;DID&#26041;&#27861;&#65292;&#21487;&#20197;&#21033;&#29992;&#22810;&#20010;&#25968;&#25454;&#26469;&#28304;&#30340;&#20449;&#24687;&#26469;&#25512;&#26029;&#27835;&#30103;&#25928;&#26524;&#12290;&#36825;&#31181;&#26041;&#27861;&#36890;&#36807;&#36873;&#25321;&#20559;&#24046;&#30340;&#27010;&#24565;&#37325;&#26032;&#35299;&#37322;&#20102;&#24179;&#34892;&#36235;&#21183;&#20551;&#35774;&#65292;&#36866;&#29992;&#24615;&#26356;&#24191;&#27867;&#12290;</title><link>http://arxiv.org/abs/2211.06710</link><description>&lt;p&gt;
&#24191;&#20041;&#24046;&#24322;-in-&#24046;&#24322;&#27169;&#22411;&#65306;&#31283;&#20581;&#30340;&#30028;&#38480;
&lt;/p&gt;
&lt;p&gt;
Generalized Difference-in-differences Models: Robust Bounds. (arXiv:2211.06710v4 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2211.06710
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#21457;&#23637;&#20102;&#19968;&#20010;&#40065;&#26834;&#30340;&#24191;&#20041;DID&#26041;&#27861;&#65292;&#21487;&#20197;&#21033;&#29992;&#22810;&#20010;&#25968;&#25454;&#26469;&#28304;&#30340;&#20449;&#24687;&#26469;&#25512;&#26029;&#27835;&#30103;&#25928;&#26524;&#12290;&#36825;&#31181;&#26041;&#27861;&#36890;&#36807;&#36873;&#25321;&#20559;&#24046;&#30340;&#27010;&#24565;&#37325;&#26032;&#35299;&#37322;&#20102;&#24179;&#34892;&#36235;&#21183;&#20551;&#35774;&#65292;&#36866;&#29992;&#24615;&#26356;&#24191;&#27867;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24046;&#24322;-in-&#24046;&#24322;&#65288;DID&#65289;&#26041;&#27861;&#20027;&#35201;&#22522;&#20110;&#24179;&#34892;&#36235;&#21183;&#65288;PT&#65289;&#20551;&#35774;&#65292;&#30830;&#23450;&#20102;&#34987;&#27835;&#30103;&#23545;&#35937;&#30340;&#24179;&#22343;&#27835;&#30103;&#25928;&#26524;&#65288;ATT&#65289;&#12290;&#36890;&#24120;&#65292;&#39044;&#22788;&#29702;&#26399;&#26816;&#39564;&#26159;&#35777;&#26126;PT&#20551;&#35774;&#30340;&#26368;&#24120;&#29992;&#26041;&#27861;&#12290;&#22914;&#26524;&#39044;&#22788;&#29702;&#26399;&#20869;&#27835;&#30103;&#32452;&#21644;&#23545;&#29031;&#32452;&#30340;&#32467;&#26524;&#24179;&#22343;&#20540;&#36235;&#21183;&#20551;&#35774;&#34987;&#25298;&#32477;&#65292;&#30740;&#31350;&#20154;&#21592;&#21017;&#23545;PT&#21644;DID&#32467;&#26524;&#30340;&#21487;&#20449;&#31243;&#24230;&#38477;&#20302;&#12290;&#26412;&#25991;&#21457;&#23637;&#20102;&#19968;&#20010;&#40065;&#26834;&#30340;&#24191;&#20041;DID&#26041;&#27861;&#65292;&#21033;&#29992;&#25152;&#26377;&#21487;&#29992;&#30340;&#20449;&#24687;&#65292;&#19981;&#20165;&#21253;&#25324;&#26469;&#33258;&#39044;&#22788;&#29702;&#26399;&#30340;&#20449;&#24687;&#65292;&#36824;&#21253;&#25324;&#26469;&#33258;&#22810;&#20010;&#25968;&#25454;&#26469;&#28304;&#30340;&#20449;&#24687;&#12290;&#25105;&#20204;&#37319;&#29992;&#19968;&#31181;&#19981;&#21516;&#20110;&#24120;&#35268;DID&#26041;&#27861;&#30340;&#26041;&#27861;&#26469;&#35299;&#37322;PT&#65292;&#21033;&#29992;&#20102;&#36873;&#25321;&#20559;&#24046;&#30340;&#27010;&#24565;&#65292;&#20351;&#25105;&#20204;&#33021;&#22815;&#36890;&#36807;&#23450;&#20041;&#21487;&#33021;&#21253;&#21547;&#22810;&#20010;&#39044;&#22788;&#29702;&#26399;&#25110;&#20854;&#20182;&#22522;&#32447;&#21327;&#21464;&#37327;&#30340;&#20449;&#24687;&#38598;&#26469;&#25512;&#24191;&#26631;&#20934;DID&#20272;&#35745;&#37327;&#12290;&#25105;&#20204;&#30340;&#20027;&#35201;&#20551;&#35774;&#26159;&#65292;&#21518;&#22788;&#29702;&#26399;&#30340;&#36873;&#25321;&#20559;&#24046;&#22312;&#25152;&#26377;&#21487;&#33021;&#32467;&#26524;&#30340;&#20984;&#21253;&#20869;&#12290;
&lt;/p&gt;
&lt;p&gt;
The difference-in-differences (DID) method identifies the average treatment effects on the treated (ATT) under mainly the so-called parallel trends (PT) assumption. The most common and widely used approach to justify the PT assumption is the pre-treatment period examination. If a null hypothesis of the same trend in the outcome means for both treatment and control groups in the pre-treatment periods is rejected, researchers believe less in PT and the DID results. This paper develops a robust generalized DID method that utilizes all the information available not only from the pre-treatment periods but also from multiple data sources. Our approach interprets PT in a different way using a notion of selection bias, which enables us to generalize the standard DID estimand by defining an information set that may contain multiple pre-treatment periods or other baseline covariates. Our main assumption states that the selection bias in the post-treatment period lies within the convex hull of al
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#35843;&#26597;&#20102;&#38738;&#23569;&#24180;&#26102;&#26399;&#19982;&#25104;&#24180;&#26399;&#25910;&#20837;&#20043;&#38388;&#30340;&#21451;&#35850;&#22238;&#25253;&#12290;&#36890;&#36807;&#37319;&#29992;&#19968;&#31181;&#26032;&#30340;&#26041;&#27861;&#65292;&#25991;&#20013;&#21457;&#29616;&#38738;&#23569;&#24180;&#26102;&#26399;&#22810;&#20132;&#19968;&#20010;&#26379;&#21451;&#21487;&#20197;&#20351;&#25910;&#20837;&#22686;&#21152;7%&#21040;14%&#12290;&#36825;&#20010;&#32467;&#26524;&#36828;&#22823;&#20110;&#20256;&#32479;&#26041;&#27861;&#30340;&#20272;&#35745;&#20540;&#65292;&#20256;&#32479;&#26041;&#27861;&#20250;&#22240;&#20026;&#27979;&#37327;&#35823;&#24046;&#21644;&#36951;&#28431;&#21464;&#37327;&#23548;&#33268;&#26174;&#33879;&#30340;&#21521;&#19979;&#20559;&#35823;&#12290;</title><link>http://arxiv.org/abs/2210.09426</link><description>&lt;p&gt;
&#24320;&#27966;&#23545;&#65306;&#38738;&#23569;&#24180;&#31038;&#20132;&#32593;&#32476;&#23545;&#21171;&#21160;&#21147;&#24066;&#22330;&#30340;&#22238;&#25253;
&lt;/p&gt;
&lt;p&gt;
Party On: The Labor Market Returns to Social Networks in Adolescence. (arXiv:2210.09426v3 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2210.09426
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#35843;&#26597;&#20102;&#38738;&#23569;&#24180;&#26102;&#26399;&#19982;&#25104;&#24180;&#26399;&#25910;&#20837;&#20043;&#38388;&#30340;&#21451;&#35850;&#22238;&#25253;&#12290;&#36890;&#36807;&#37319;&#29992;&#19968;&#31181;&#26032;&#30340;&#26041;&#27861;&#65292;&#25991;&#20013;&#21457;&#29616;&#38738;&#23569;&#24180;&#26102;&#26399;&#22810;&#20132;&#19968;&#20010;&#26379;&#21451;&#21487;&#20197;&#20351;&#25910;&#20837;&#22686;&#21152;7%&#21040;14%&#12290;&#36825;&#20010;&#32467;&#26524;&#36828;&#22823;&#20110;&#20256;&#32479;&#26041;&#27861;&#30340;&#20272;&#35745;&#20540;&#65292;&#20256;&#32479;&#26041;&#27861;&#20250;&#22240;&#20026;&#27979;&#37327;&#35823;&#24046;&#21644;&#36951;&#28431;&#21464;&#37327;&#23548;&#33268;&#26174;&#33879;&#30340;&#21521;&#19979;&#20559;&#35823;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#35843;&#26597;&#20102;&#38738;&#23569;&#24180;&#21451;&#35850;&#23545;&#25104;&#24180;&#26399;&#25910;&#20837;&#30340;&#22238;&#25253;&#12290;&#21033;&#29992;&#32654;&#22269;&#22269;&#23478;&#38738;&#23569;&#24180;&#21040;&#25104;&#20154;&#20581;&#24247;&#30340;&#38271;&#26399;&#30740;&#31350;&#25968;&#25454;&#65292;&#25105;&#20204;&#21457;&#29616;&#20010;&#20307;&#22312;&#38738;&#23569;&#24180;&#26102;&#26399;&#19981;&#20165;&#36827;&#34892;&#25945;&#32946;&#25237;&#36164;&#65292;&#36824;&#36827;&#34892;&#21451;&#35850;&#31215;&#32047;&#30340;&#25237;&#36164;&#12290;&#30001;&#20110;&#25945;&#32946;&#21644;&#21451;&#35850;&#22312;&#38738;&#23569;&#24180;&#26102;&#26399;&#26159;&#21516;&#26102;&#24418;&#25104;&#30340;&#65292;&#22240;&#27492;&#20351;&#29992;OLS&#26041;&#27861;&#20272;&#35745;&#23427;&#20204;&#30340;&#22238;&#25253;&#20250;&#26377;&#20559;&#24046;&#12290;&#20026;&#20102;&#20272;&#35745;&#21451;&#35850;&#30340;&#22240;&#26524;&#22238;&#25253;&#65292;&#25105;&#20204;&#37319;&#29992;&#20102;&#19968;&#31181;&#26032;&#26041;&#27861;&#65292;&#20551;&#35774;&#25945;&#32946;&#22238;&#25253;&#29575;&#22312;5%&#21040;15%&#20043;&#38388;&#65288;&#22914;&#24050;&#26377;&#25991;&#29486;&#25152;&#36848;&#65289;&#65292;&#24182;&#20351;&#29992;&#21516;&#20276;&#20043;&#38388;&#30340;&#30456;&#20284;&#24230;&#27979;&#37327;&#20316;&#20026;&#21451;&#35850;&#30340;&#24037;&#20855;&#26469;&#33719;&#24471;&#22238;&#25253;&#30340;&#19979;&#30028;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#22312;&#38738;&#23569;&#24180;&#26102;&#26399;&#22810;&#20132;&#19968;&#20010;&#26379;&#21451;&#21487;&#20197;&#20351;&#25910;&#20837;&#22686;&#38271;7%&#21040;14%&#65292;&#36825;&#36828;&#22823;&#20110;OLS&#20272;&#35745;&#20540;&#65306;&#27979;&#37327;&#35823;&#24046;&#21644;&#36951;&#28431;&#21464;&#37327;&#23548;&#33268;&#20102;&#26174;&#33879;&#30340;&#21521;&#19979;&#20559;&#35823;&#12290;
&lt;/p&gt;
&lt;p&gt;
We investigate the returns to adolescent friendships on earnings in adulthood. Using data from the National Longitudinal Study of Adolescent to Adult Health, we document that individuals make investments to accumulate friends in addition to educational investments. Because both education and friendships are jointly determined in adolescence, OLS estimates of their returns are biased. To estimate the causal returns to friendships, we implement a novel procedure that assumes the returns to schooling range from 5 to 15% (as the literature has documented), and instrument for friendships using homophily (similarity) measures among peers to obtain bounds on the returns to friendships. We find that having one more friend in adolescence increases earnings between 7 and 14%, which is substantially larger than the OLS estimates: measurement error and omitted variables lead to significant downward bias.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#24555;&#36895;&#30340;&#20004;&#38454;&#27573;&#21464;&#20998;&#36125;&#21494;&#26031;&#31639;&#27861;&#65292;&#29992;&#20110;&#20272;&#35745;&#24102;&#26377;&#19981;&#21463;&#38480;&#21046;&#30340;&#38754;&#26495;&#31354;&#38388;&#33258;&#22238;&#24402;&#27169;&#22411;&#12290;&#36890;&#36807;&#20351;&#29992;&#29380;&#21033;&#20811;&#38647;-&#25289;&#26222;&#25289;&#26031;&#20808;&#39564;&#65292;&#25105;&#20204;&#33021;&#22815;&#25581;&#31034;&#27178;&#25130;&#38754;&#21333;&#20301;&#20043;&#38388;&#30340;&#31354;&#38388;&#20851;&#31995;&#65292;&#24182;&#39318;&#27425;&#22312;&#25991;&#29486;&#20013;&#24320;&#21457;&#20102;&#20272;&#35745;&#20855;&#26377;&#19981;&#21463;&#38480;&#21046;&#31232;&#30095;&#27169;&#24335;&#30340;&#22823;&#21327;&#26041;&#24046;&#30697;&#38453;&#30340;&#21464;&#20998;&#36125;&#21494;&#26031;&#26041;&#27861;&#12290;</title><link>http://arxiv.org/abs/2205.15420</link><description>&lt;p&gt;
&#24555;&#36895;&#20004;&#38454;&#27573;&#21464;&#20998;&#36125;&#21494;&#26031;&#26041;&#27861;&#29992;&#20110;&#20272;&#35745;&#24102;&#26377;&#19981;&#21463;&#38480;&#21046;&#30340;&#31354;&#38388;&#26435;&#37325;&#30697;&#38453;&#30340;&#38754;&#26495;&#31354;&#38388;&#33258;&#22238;&#24402;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
Fast Two-Stage Variational Bayesian Approach to Estimating Panel Spatial Autoregressive Models with Unrestricted Spatial Weights Matrices. (arXiv:2205.15420v3 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2205.15420
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#24555;&#36895;&#30340;&#20004;&#38454;&#27573;&#21464;&#20998;&#36125;&#21494;&#26031;&#31639;&#27861;&#65292;&#29992;&#20110;&#20272;&#35745;&#24102;&#26377;&#19981;&#21463;&#38480;&#21046;&#30340;&#38754;&#26495;&#31354;&#38388;&#33258;&#22238;&#24402;&#27169;&#22411;&#12290;&#36890;&#36807;&#20351;&#29992;&#29380;&#21033;&#20811;&#38647;-&#25289;&#26222;&#25289;&#26031;&#20808;&#39564;&#65292;&#25105;&#20204;&#33021;&#22815;&#25581;&#31034;&#27178;&#25130;&#38754;&#21333;&#20301;&#20043;&#38388;&#30340;&#31354;&#38388;&#20851;&#31995;&#65292;&#24182;&#39318;&#27425;&#22312;&#25991;&#29486;&#20013;&#24320;&#21457;&#20102;&#20272;&#35745;&#20855;&#26377;&#19981;&#21463;&#38480;&#21046;&#31232;&#30095;&#27169;&#24335;&#30340;&#22823;&#21327;&#26041;&#24046;&#30697;&#38453;&#30340;&#21464;&#20998;&#36125;&#21494;&#26031;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#24555;&#36895;&#30340;&#20004;&#38454;&#27573;&#21464;&#20998;&#36125;&#21494;&#26031;&#31639;&#27861;&#65292;&#29992;&#20110;&#20272;&#35745;&#24102;&#26377;&#19981;&#21463;&#38480;&#21046;&#30340;&#38754;&#26495;&#31354;&#38388;&#33258;&#22238;&#24402;&#27169;&#22411;&#12290;&#36890;&#36807;&#20351;&#29992;&#29380;&#21033;&#20811;&#38647;-&#25289;&#26222;&#25289;&#26031;&#20808;&#39564;&#65292;&#25105;&#20204;&#33021;&#22815;&#22312;&#19981;&#26045;&#21152;&#20219;&#20309;&#20808;&#39564;&#38480;&#21046;&#30340;&#24773;&#20917;&#19979;&#25581;&#31034;&#27178;&#25130;&#38754;&#21333;&#20301;&#20043;&#38388;&#30340;&#31354;&#38388;&#20851;&#31995;&#12290;&#33945;&#29305;&#21345;&#27931;&#23454;&#39564;&#34920;&#26126;&#65292;&#25105;&#20204;&#30340;&#26041;&#27861;&#23545;&#20110;&#38271;&#38754;&#26495;&#21644;&#30701;&#38754;&#26495;&#37117;&#26377;&#25928;&#12290;&#25105;&#20204;&#36824;&#26159;&#25991;&#29486;&#19978;&#31532;&#19968;&#20010;&#24320;&#21457;&#21464;&#20998;&#36125;&#21494;&#26031;&#26041;&#27861;&#26469;&#20272;&#35745;&#24102;&#26377;&#19981;&#21463;&#38480;&#21046;&#31232;&#30095;&#27169;&#24335;&#30340;&#22823;&#21327;&#26041;&#24046;&#30697;&#38453;&#65292;&#36825;&#23545;&#20110;&#24120;&#35265;&#30340;&#22823;&#25968;&#25454;&#27169;&#22411;&#22914;&#36125;&#21494;&#26031;&#21521;&#37327;&#33258;&#22238;&#24402;&#26159;&#38750;&#24120;&#26377;&#29992;&#30340;&#12290;&#22312;&#23454;&#35777;&#24212;&#29992;&#20013;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#27431;&#27954;&#21306;&#20027;&#26435;&#20538;&#21048;&#35780;&#32423;&#21644;&#21033;&#24046;&#20043;&#38388;&#30340;&#31354;&#38388;&#30456;&#20114;&#20381;&#36182;&#20851;&#31995;&#12290;&#25105;&#20204;&#21457;&#29616;&#21271;&#27431;&#22269;&#23478;&#21644;&#21335;&#27431;&#22269;&#23478;&#30340;&#28322;&#20986;&#34892;&#20026;&#23384;&#22312;&#26174;&#33879;&#24046;&#24322;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper proposes a fast two-stage variational Bayesian (VB) algorithm to estimate unrestricted panel spatial autoregressive models. Using Dirichlet-Laplace priors, we are able to uncover the spatial relationships between cross-sectional units without imposing any a priori restrictions. Monte Carlo experiments show that our approach works well for both long and short panels. We are also the first in the literature to develop VB methods to estimate large covariance matrices with unrestricted sparsity patterns, which are useful for popular large data models such as Bayesian vector autoregressions. In empirical applications, we examine the spatial interdependence between euro area sovereign bond ratings and spreads. We find marked differences between the spillover behaviours of the northern euro area countries and those of the south.
&lt;/p&gt;</description></item><item><title>&#22312;&#23454;&#35777;&#24494;&#35266;&#32463;&#27982;&#23398;&#20013;&#32463;&#24120;&#20986;&#29616;&#30340;&#25968;&#25454;&#32452;&#21512;&#38382;&#39064;&#20013;&#65292;&#25105;&#20204;&#20351;&#29992;&#26368;&#20248;&#20256;&#36755;&#29702;&#35770;&#30340;&#24037;&#20855;&#30740;&#31350;&#20102;&#37096;&#20998;&#32447;&#24615;&#27169;&#22411;&#12290;&#36890;&#36807;&#26500;&#36896;&#24615;&#25551;&#36848;&#23574;&#38160;&#35782;&#21035;&#38598;&#21512;&#65292;&#24182;&#21033;&#29992;&#20854;&#20960;&#20309;&#29305;&#24615;&#24320;&#21457;&#20102;&#19968;&#31181;&#26032;&#30340;&#25512;&#26029;&#26041;&#27861;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#22312;&#26377;&#38480;&#26679;&#26412;&#20013;&#34920;&#29616;&#33391;&#22909;&#65292;&#21516;&#26102;&#20801;&#35768;&#25918;&#23485;&#25490;&#38500;&#32422;&#26463;&#65292;&#24182;&#25552;&#20379;&#20449;&#24687;&#20016;&#23500;&#30340;&#32622;&#20449;&#21306;&#38388;&#12290;</title><link>http://arxiv.org/abs/2204.05175</link><description>&lt;p&gt;
&#25968;&#25454;&#32452;&#21512;&#19979;&#30340;&#37096;&#20998;&#32447;&#24615;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
Partially Linear Models under Data Combination. (arXiv:2204.05175v3 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2204.05175
&lt;/p&gt;
&lt;p&gt;
&#22312;&#23454;&#35777;&#24494;&#35266;&#32463;&#27982;&#23398;&#20013;&#32463;&#24120;&#20986;&#29616;&#30340;&#25968;&#25454;&#32452;&#21512;&#38382;&#39064;&#20013;&#65292;&#25105;&#20204;&#20351;&#29992;&#26368;&#20248;&#20256;&#36755;&#29702;&#35770;&#30340;&#24037;&#20855;&#30740;&#31350;&#20102;&#37096;&#20998;&#32447;&#24615;&#27169;&#22411;&#12290;&#36890;&#36807;&#26500;&#36896;&#24615;&#25551;&#36848;&#23574;&#38160;&#35782;&#21035;&#38598;&#21512;&#65292;&#24182;&#21033;&#29992;&#20854;&#20960;&#20309;&#29305;&#24615;&#24320;&#21457;&#20102;&#19968;&#31181;&#26032;&#30340;&#25512;&#26029;&#26041;&#27861;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#22312;&#26377;&#38480;&#26679;&#26412;&#20013;&#34920;&#29616;&#33391;&#22909;&#65292;&#21516;&#26102;&#20801;&#35768;&#25918;&#23485;&#25490;&#38500;&#32422;&#26463;&#65292;&#24182;&#25552;&#20379;&#20449;&#24687;&#20016;&#23500;&#30340;&#32622;&#20449;&#21306;&#38388;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#22312;&#35266;&#27979;&#21040;&#24863;&#20852;&#36259;&#30340;&#32467;&#26524;&#21644;&#19968;&#20123;&#21327;&#21464;&#37327;&#26469;&#33258;&#20110;&#19981;&#33021;&#38142;&#25509;&#30340;&#20004;&#20010;&#25968;&#25454;&#38598;&#30340;&#24773;&#20917;&#19979;&#65292;&#30740;&#31350;&#20102;&#37096;&#20998;&#32447;&#24615;&#27169;&#22411;&#12290;&#36825;&#31181;&#25968;&#25454;&#32452;&#21512;&#38382;&#39064;&#22312;&#23454;&#35777;&#24494;&#35266;&#32463;&#27982;&#23398;&#20013;&#32463;&#24120;&#20986;&#29616;&#12290;&#21033;&#29992;&#26368;&#20248;&#20256;&#36755;&#29702;&#35770;&#30340;&#26368;&#26032;&#24037;&#20855;&#65292;&#25105;&#20204;&#23545;&#23574;&#38160;&#35782;&#21035;&#38598;&#21512;&#36827;&#34892;&#20102;&#26500;&#36896;&#24615;&#30340;&#25551;&#36848;&#12290;&#28982;&#21518;&#65292;&#22522;&#20110;&#27492;&#32467;&#26524;&#65292;&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#31181;&#26032;&#30340;&#25512;&#26029;&#26041;&#27861;&#65292;&#21033;&#29992;&#20102;&#35782;&#21035;&#38598;&#21512;&#30340;&#29305;&#23450;&#20960;&#20309;&#29305;&#24615;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#22312;&#26377;&#38480;&#26679;&#26412;&#20013;&#34920;&#29616;&#33391;&#22909;&#65292;&#21516;&#26102;&#20445;&#25345;&#38750;&#24120;&#21487;&#34892;&#12290;&#25105;&#20204;&#24212;&#29992;&#35813;&#26041;&#27861;&#30740;&#31350;&#20102;1850&#24180;&#33267;1930&#24180;&#38388;&#22312;&#32654;&#22269;&#30340;&#20195;&#38469;&#25910;&#20837;&#27969;&#21160;&#24615;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#20801;&#35768;&#25918;&#23485;&#26089;&#26399;&#30740;&#31350;&#20013;&#20351;&#29992;&#30340;&#25490;&#38500;&#32422;&#26463;&#65292;&#24182;&#25552;&#20379;&#20449;&#24687;&#20016;&#23500;&#30340;&#32622;&#20449;&#21306;&#38388;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study partially linear models when the outcome of interest and some of the covariates are observed in two different datasets that cannot be linked. This type of data combination problem arises very frequently in empirical microeconomics. Using recent tools from optimal transport theory, we derive a constructive characterization of the sharp identified set. We then build on this result and develop a novel inference method that exploits the specific geometric properties of the identified set. Our method exhibits good performances in finite samples, while remaining very tractable. We apply our approach to study intergenerational income mobility over the period 1850-1930 in the United States. Our method allows us to relax the exclusion restrictions used in earlier work, while delivering confidence regions that are informative.
&lt;/p&gt;</description></item></channel></rss>