<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#36873;&#25321;&#36319;&#38543;&#31639;&#27861;&#26159;&#21542;&#20256;&#36798;&#26377;&#20851;&#20154;&#31867;&#33021;&#21147;&#30340;&#20449;&#24687;&#26159;&#23548;&#33268;&#31639;&#27861;&#21388;&#24694;&#29616;&#35937;&#30340;&#20851;&#38190;&#22240;&#32032;&#65292;&#36825;&#31181;&#29616;&#35937;&#34987;&#31216;&#20026;&#8220;&#31639;&#27861;&#21388;&#24694;&#8221;&#12290;</title><link>https://arxiv.org/abs/2402.15418</link><description>&lt;p&gt;
&#22768;&#35465;&#31639;&#27861;&#21388;&#24694;
&lt;/p&gt;
&lt;p&gt;
Reputational Algorithm Aversion
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.15418
&lt;/p&gt;
&lt;p&gt;
&#36873;&#25321;&#36319;&#38543;&#31639;&#27861;&#26159;&#21542;&#20256;&#36798;&#26377;&#20851;&#20154;&#31867;&#33021;&#21147;&#30340;&#20449;&#24687;&#26159;&#23548;&#33268;&#31639;&#27861;&#21388;&#24694;&#29616;&#35937;&#30340;&#20851;&#38190;&#22240;&#32032;&#65292;&#36825;&#31181;&#29616;&#35937;&#34987;&#31216;&#20026;&#8220;&#31639;&#27861;&#21388;&#24694;&#8221;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20154;&#20204;&#24120;&#24120;&#19981;&#24895;&#23558;&#31639;&#27861;&#20135;&#29983;&#30340;&#20449;&#24687;&#32435;&#20837;&#33258;&#24049;&#30340;&#20915;&#31574;&#20013;&#65292;&#36825;&#31181;&#29616;&#35937;&#34987;&#31216;&#20026;&#8220;&#31639;&#27861;&#21388;&#24694;&#8221;&#12290;&#26412;&#25991;&#23637;&#31034;&#20102;&#31639;&#27861;&#21388;&#24694;&#26159;&#22914;&#20309;&#20135;&#29983;&#30340;&#65292;&#24403;&#36873;&#25321;&#36319;&#38543;&#31639;&#27861;&#20256;&#36798;&#26377;&#20851;&#20154;&#31867;&#33021;&#21147;&#30340;&#20449;&#24687;&#26102;&#12290;&#25105;&#24314;&#31435;&#20102;&#19968;&#20010;&#27169;&#22411;&#65292;&#20854;&#20013;&#24037;&#20316;&#32773;&#26681;&#25454;&#33258;&#24049;&#30340;&#31169;&#20154;&#20449;&#24687;&#21644;&#31639;&#27861;&#30340;&#20449;&#21495;&#23545;&#38543;&#26426;&#32467;&#26524;&#36827;&#34892;&#39044;&#27979;&#12290;&#20302;&#25216;&#33021;&#24037;&#20316;&#32773;&#25509;&#25910;&#21040;&#27604;&#31639;&#27861;&#26356;&#24046;&#30340;&#20449;&#24687;&#65292;&#22240;&#27492;&#24212;&#22987;&#32456;&#36981;&#24490;&#31639;&#27861;&#30340;&#20449;&#21495;&#65292;&#32780;&#39640;&#25216;&#33021;&#24037;&#20316;&#32773;&#25509;&#25910;&#21040;&#27604;&#31639;&#27861;&#26356;&#22909;&#30340;&#20449;&#24687;&#65292;&#22240;&#27492;&#26377;&#26102;&#24212;&#35813;&#35206;&#30422;&#31639;&#27861;&#30340;&#20915;&#31574;&#12290;&#28982;&#32780;&#65292;&#30001;&#20110;&#22768;&#35465;&#19978;&#30340;&#32771;&#34385;&#65292;&#20302;&#25216;&#33021;&#24037;&#20316;&#32773;&#20250;&#19981;&#21512;&#29702;&#22320;&#35206;&#30422;&#31639;&#27861;&#65292;&#20197;&#22686;&#21152;&#34987;&#35270;&#20026;&#39640;&#25216;&#33021;&#30340;&#21487;&#33021;&#24615;&#12290;&#35813;&#27169;&#22411;&#20026;&#19982;AI&#31995;&#32479;&#21487;&#33021;&#20250;&#21462;&#20195;&#35768;&#22810;&#31867;&#22411;&#30340;&#24037;&#20316;&#32773;&#30340;&#24191;&#27867;&#20851;&#27880;&#25552;&#20379;&#20102;&#23436;&#20840;&#29702;&#24615;&#30340;&#24494;&#35266;&#22522;&#30784;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.15418v1 Announce Type: cross  Abstract: People are often reluctant to incorporate information produced by algorithms into their decisions, a phenomenon called "algorithm aversion". This paper shows how algorithm aversion arises when the choice to follow an algorithm conveys information about a human's ability. I develop a model in which workers make forecasts of a random outcome based on their own private information and an algorithm's signal. Low-skill workers receive worse information than the algorithm and hence should always follow the algorithm's signal, while high-skill workers receive better information than the algorithm and should sometimes override it. However, due to reputational concerns, low-skill workers inefficiently override the algorithm to increase the likelihood they are perceived as high-skill. The model provides a fully rational microfoundation for algorithm aversion that aligns with the broad concern that AI systems will displace many types of workers.
&lt;/p&gt;</description></item><item><title>&#26497;&#31471;&#39640;&#28201;&#20250;&#26174;&#30528;&#20943;&#23569;&#28595;&#22823;&#21033;&#20122;&#21171;&#21160;&#21147;&#30340;&#24037;&#20316;&#20986;&#21220;&#29575;&#21644;&#24037;&#20316;&#26102;&#38388;&#65292;&#23588;&#20854;&#26159;&#23545;&#37329;&#34701;&#19982;&#20445;&#38505;&#26381;&#21153;&#39046;&#22495;&#30340;&#24433;&#21709;&#26368;&#20026;&#26174;&#33879;&#12290;</title><link>https://arxiv.org/abs/2402.15072</link><description>&lt;p&gt;
&#26497;&#31471;&#39640;&#28201;&#23545;&#21171;&#21160;&#21147;&#21160;&#24577;&#30340;&#24433;&#21709;
&lt;/p&gt;
&lt;p&gt;
Impacts of Extreme Heat on Labor Force Dynamics
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.15072
&lt;/p&gt;
&lt;p&gt;
&#26497;&#31471;&#39640;&#28201;&#20250;&#26174;&#30528;&#20943;&#23569;&#28595;&#22823;&#21033;&#20122;&#21171;&#21160;&#21147;&#30340;&#24037;&#20316;&#20986;&#21220;&#29575;&#21644;&#24037;&#20316;&#26102;&#38388;&#65292;&#23588;&#20854;&#26159;&#23545;&#37329;&#34701;&#19982;&#20445;&#38505;&#26381;&#21153;&#39046;&#22495;&#30340;&#24433;&#21709;&#26368;&#20026;&#26174;&#33879;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#20351;&#29992;&#27599;&#26085;&#32437;&#21521;&#25968;&#25454;&#21644;&#19968;&#31181;&#22312;&#24037;&#20316;&#32773;&#20869;&#37096;&#36827;&#34892;&#36523;&#20221;&#35782;&#21035;&#30340;&#26041;&#27861;&#65292;&#30740;&#31350;&#20102;&#28909;&#28010;&#23545;&#28595;&#22823;&#21033;&#20122;&#21171;&#21160;&#21147;&#21160;&#24577;&#30340;&#24433;&#21709;&#12290;2001&#24180;&#33267;2019&#24180;&#30340;&#39640;&#28201;&#26174;&#30528;&#20943;&#23569;&#20102;&#24037;&#20316;&#20986;&#21220;&#29575;&#21644;&#24037;&#20316;&#26102;&#38388;&#65292;&#32780;&#36825;&#20123;&#24182;&#27809;&#26377;&#22312;&#38543;&#21518;&#30340;&#26085;&#23376;&#21644;&#21608;&#25968;&#20013;&#24471;&#21040;&#34917;&#20607;&#12290;&#26368;&#22823;&#30340;&#20943;&#23569;&#21457;&#29983;&#22312;&#36739;&#20937;&#29245;&#30340;&#22320;&#21306;&#21644;&#26368;&#36817;&#30340;&#24180;&#20221;&#65292;&#32780;&#19981;&#20165;&#20165;&#38598;&#20013;&#22312;&#25143;&#22806;&#24037;&#20316;&#32773;&#20013;&#12290;&#37329;&#34701;&#19982;&#20445;&#38505;&#26381;&#21153;&#26159;&#21463;&#24433;&#21709;&#26368;&#20005;&#37325;&#30340;&#34892;&#19994;&#65292;38&#25668;&#27663;&#24230;&#65288;100&#21326;&#27663;&#24230;&#65289;&#20197;&#19978;&#30340;&#28201;&#24230;&#20250;&#20351;&#26103;&#24037;&#29575;&#22686;&#21152;15&#65285;&#12290;&#24037;&#20316;&#36884;&#20013;&#21644;&#23460;&#22806;&#24037;&#20316;&#26102;&#38388;&#20013;&#30340;&#19981;&#21033;&#28909;&#25928;&#24212;&#34987;&#35777;&#23454;&#26159;&#20851;&#38190;&#26426;&#21046;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.15072v1 Announce Type: new  Abstract: We use daily longitudinal data and a within-worker identification approach to examine the impacts of heat on labor force dynamics in Australia. High temperatures during 2001-2019 significantly reduced work attendance and hours worked, which were not compensated for in subsequent days and weeks. The largest reductions occurred in cooler regions and recent years, and were not solely concentrated amongst outdoor-based workers. Financial and Insurance Services was the most strongly affected industry, with temperatures above 38{\deg}C (100{\deg}F) increasing absenteeism by 15 percent. Adverse heat effects during the work commute and during outdoor work hours are shown to be key mechanisms.
&lt;/p&gt;</description></item><item><title>&#36890;&#36807;&#22810;agent&#24433;&#21709;&#22270;&#26041;&#27861;&#20998;&#26512; Maker &#21327;&#35758;&#20013;&#30340;&#28216;&#25103;&#21160;&#24577;&#65292;&#24182;&#25552;&#20986;&#20102;&#20419;&#36827;&#21327;&#35843;&#21644;&#22686;&#24378;&#32463;&#27982;&#23433;&#20840;&#24615;&#30340;&#31574;&#30053;</title><link>https://arxiv.org/abs/2402.15037</link><description>&lt;p&gt;
&#22312; Maker &#21327;&#35758;&#20013;&#20998;&#26512;&#28216;&#25103;&#30340;&#31532;&#19968;&#37096;&#20998;&#65306;&#19968;&#31181;&#38754;&#21521;&#21327;&#35843;&#30340;&#22810;agent&#24433;&#21709;&#22270;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Analyzing Games in Maker Protocol Part One: A Multi-Agent Influence Diagram Approach Towards Coordination
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.15037
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#22810;agent&#24433;&#21709;&#22270;&#26041;&#27861;&#20998;&#26512; Maker &#21327;&#35758;&#20013;&#30340;&#28216;&#25103;&#21160;&#24577;&#65292;&#24182;&#25552;&#20986;&#20102;&#20419;&#36827;&#21327;&#35843;&#21644;&#22686;&#24378;&#32463;&#27982;&#23433;&#20840;&#24615;&#30340;&#31574;&#30053;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21435;&#20013;&#24515;&#21270;&#37329;&#34701;&#65288;DeFi&#65289;&#29983;&#24577;&#31995;&#32479;&#65292;&#20197; Maker &#21327;&#35758;&#20026;&#20363;&#65292;&#20381;&#36182;&#20110;&#22797;&#26434;&#30340;&#28216;&#25103;&#26469;&#32500;&#25345;&#31283;&#23450;&#24615;&#21644;&#23433;&#20840;&#24615;&#12290;&#20102;&#35299;&#36825;&#20123;&#28216;&#25103;&#30340;&#21160;&#24577;&#23545;&#20110;&#30830;&#20445;&#31995;&#32479;&#30340;&#31283;&#20581;&#24615;&#33267;&#20851;&#37325;&#35201;&#12290;&#26412;&#30740;&#31350;&#25552;&#20986;&#19968;&#31181;&#26032;&#39062;&#30340;&#26041;&#27861;&#65292;&#21033;&#29992;&#22810;agent&#24433;&#21709;&#22270;&#65288;MAID&#65289;&#65292;&#36825;&#26159;&#30001; Koller &#21644; Milch &#26368;&#21021;&#25552;&#20986;&#30340;&#65292;&#20197;&#35299;&#21078;&#21644;&#20998;&#26512; Maker &#31283;&#23450;&#24065;&#21327;&#35758;&#20013;&#30340;&#28216;&#25103;&#12290;&#36890;&#36807;&#23558; Maker &#21327;&#35758;&#30340;&#29992;&#25143;&#21644;&#27835;&#29702;&#34920;&#31034;&#20026;&#20195;&#29702;&#20154;&#65292;&#23558;&#23427;&#20204;&#30340;&#20114;&#21160;&#34920;&#31034;&#20026;&#22270;&#20013;&#30340;&#36793;&#65292;&#25105;&#20204;&#25429;&#25417;&#21040;&#25351;&#23548;&#20195;&#29702;&#20154;&#34892;&#20026;&#30340;&#22797;&#26434;&#24433;&#21709;&#32593;&#32476;&#12290;&#27492;&#22806;&#65292;&#22312;&#25509;&#19979;&#26469;&#30340;&#35770;&#25991;&#20013;&#65292;&#25105;&#20204;&#23558;&#23637;&#31034;&#19968;&#20010;&#32435;&#20160;&#22343;&#34913;&#27169;&#22411;&#65292;&#20197;&#38416;&#26126;&#20419;&#36827;&#21327;&#35843;&#21644;&#22686;&#24378;&#29983;&#24577;&#31995;&#32479;&#20869;&#32463;&#27982;&#23433;&#20840;&#24615;&#30340;&#31574;&#30053;&#12290;&#36890;&#36807;&#36825;&#31181;&#26041;&#27861;&#65292;&#25105;&#20204;&#26088;&#22312;&#25512;&#21160;&#21033;&#29992;&#36825;&#31181;&#26041;&#27861;&#24341;&#20837;&#19968;&#31181;&#26032;&#30340;&#24418;&#24335;&#39564;&#35777;&#26041;&#27861;&#65292;&#39564;&#35777;&#21338;&#24328;&#35770;&#23433;&#20840;&#24615;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.15037v1 Announce Type: cross  Abstract: Decentralized Finance (DeFi) ecosystems, exemplified by the Maker Protocol, rely on intricate games to maintain stability and security. Understanding the dynamics of these games is crucial for ensuring the robustness of the system. This motivating research proposes a novel methodology leveraging Multi-Agent Influence Diagrams (MAID), originally proposed by Koller and Milch, to dissect and analyze the games within the Maker stablecoin protocol. By representing users and governance of the Maker protocol as agents and their interactions as edges in a graph, we capture the complex network of influences governing agent behaviors. Furthermore in the upcoming papers, we will show a Nash Equilibrium model to elucidate strategies that promote coordination and enhance economic security within the ecosystem. Through this approach, we aim to motivate the use of this method to introduce a new method of formal verification of game theoretic security
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#35777;&#26126;&#20102;&#25152;&#26377;&#20005;&#26684;&#36229;&#28155;&#21152;&#20998;&#37197;&#20989;&#25968;&#24418;&#24335;&#28216;&#25103;&#22312;Nash&#22343;&#34913;&#21644;&#21512;&#29702;&#24615;&#19979;&#37117;&#26159;&#21487;&#23454;&#29616;&#30340;&#65307;&#25152;&#26377;&#24369;&#36229;&#28155;&#21152;&#29305;&#24449;&#20989;&#25968;&#24418;&#24335;&#28216;&#25103;&#22312;Nash&#22343;&#34913;&#19979;&#37117;&#26159;&#21487;&#23454;&#29616;&#30340;&#65307;&#20197;&#21450;&#25152;&#26377;&#24369;&#36229;&#28155;&#21152;&#20998;&#37197;&#20989;&#25968;&#24418;&#24335;&#28216;&#25103;&#22312;&#39076;&#25238;&#25163;&#23436;&#32654;&#22343;&#34913;&#19979;&#37117;&#26159;&#21487;&#23454;&#29616;&#30340;&#12290;</title><link>https://arxiv.org/abs/2402.14952</link><description>&lt;p&gt;
&#22312;&#38750;&#21512;&#20316;&#35299;&#27010;&#24565;&#19979;&#30340;&#21512;&#20316;&#21338;&#24328;&#30340;&#23454;&#29616;
&lt;/p&gt;
&lt;p&gt;
Implementations of Cooperative Games Under Non-Cooperative Solution Concepts
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.14952
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#35777;&#26126;&#20102;&#25152;&#26377;&#20005;&#26684;&#36229;&#28155;&#21152;&#20998;&#37197;&#20989;&#25968;&#24418;&#24335;&#28216;&#25103;&#22312;Nash&#22343;&#34913;&#21644;&#21512;&#29702;&#24615;&#19979;&#37117;&#26159;&#21487;&#23454;&#29616;&#30340;&#65307;&#25152;&#26377;&#24369;&#36229;&#28155;&#21152;&#29305;&#24449;&#20989;&#25968;&#24418;&#24335;&#28216;&#25103;&#22312;Nash&#22343;&#34913;&#19979;&#37117;&#26159;&#21487;&#23454;&#29616;&#30340;&#65307;&#20197;&#21450;&#25152;&#26377;&#24369;&#36229;&#28155;&#21152;&#20998;&#37197;&#20989;&#25968;&#24418;&#24335;&#28216;&#25103;&#22312;&#39076;&#25238;&#25163;&#23436;&#32654;&#22343;&#34913;&#19979;&#37117;&#26159;&#21487;&#23454;&#29616;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21512;&#20316;&#28216;&#25103;&#21487;&#20197;&#34987;&#21306;&#20998;&#20026;&#38750;&#21512;&#20316;&#28216;&#25103;&#65292;&#20854;&#20013;&#29609;&#23478;&#21487;&#20197;&#33258;&#30001;&#31614;&#32626;&#26377;&#32422;&#26463;&#21147;&#30340;&#21327;&#35758;&#20197;&#24418;&#25104;&#32852;&#30431;&#12290;&#36825;&#20123;&#32852;&#30431;&#32487;&#25215;&#19968;&#20010;&#32852;&#21512;&#31574;&#30053;&#38598;&#65292;&#24182;&#23547;&#27714;&#26368;&#22823;&#21270;&#38598;&#20307;&#22238;&#25253;&#12290;&#24403;&#26576;&#20123;&#38750;&#21512;&#20316;&#35299;&#27010;&#24565;&#19979;&#27599;&#20010;&#32852;&#30431;&#30340;&#22238;&#25253;&#19982;&#20182;&#20204;&#22312;&#21512;&#20316;&#28216;&#25103;&#20013;&#30340;&#20215;&#20540;&#19968;&#33268;&#26102;&#65292;&#35813;&#21512;&#20316;&#28216;&#25103;&#34987;&#31216;&#20026;&#21487;&#23454;&#29616;&#65292;&#38750;&#21512;&#20316;&#28216;&#25103;&#21017;&#26159;&#20854;&#23454;&#26045;&#12290;&#26412;&#25991;&#35777;&#26126;&#20102;&#25152;&#26377;&#20005;&#26684;&#36229;&#28155;&#21152;&#20998;&#37197;&#20989;&#25968;&#24418;&#24335;&#28216;&#25103;&#22312;Nash&#22343;&#34913;&#21644;&#21512;&#29702;&#24615;&#19979;&#37117;&#26159;&#21487;&#23454;&#29616;&#30340;&#65307;&#25152;&#26377;&#24369;&#36229;&#28155;&#21152;&#29305;&#24449;&#20989;&#25968;&#24418;&#24335;&#28216;&#25103;&#22312;Nash&#22343;&#34913;&#19979;&#37117;&#26159;&#21487;&#23454;&#29616;&#30340;&#65307;&#20197;&#21450;&#25152;&#26377;&#24369;&#36229;&#28155;&#21152;&#20998;&#37197;&#20989;&#25968;&#24418;&#24335;&#28216;&#25103;&#22312;&#39076;&#25238;&#25163;&#23436;&#32654;&#22343;&#34913;&#19979;&#37117;&#26159;&#21487;&#23454;&#29616;&#30340;&#12290;&#38543;&#21518;&#35752;&#35770;&#20102;&#23454;&#29616;&#20013;&#38750;&#21512;&#20316;&#35299;&#27010;&#24565;&#30340;&#36866;&#24403;&#36873;&#25321;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.14952v1 Announce Type: new  Abstract: Cooperative games can be distinguished as non-cooperative games in which players can freely sign binding agreements to form coalitions. These coalitions inherit a joint strategy set and seek to maximize collective payoffs. When the payoffs to each coalition under some non-cooperative solution concept coincide with their value in the cooperative game, the cooperative game is said to be implementable and the non-cooperative game its implementation. This paper proves that all strictly superadditive partition function form games are implementable under Nash equilibrium and rationalizability; that all weakly superadditive characteristic function form games are implementable under Nash equilibrium; and that all weakly superadditive partition function form games are implementable under trembling hand perfect equilibrium. Discussion then proceeds on the appropriate choice of non-cooperative solution concept for the implementation.
&lt;/p&gt;</description></item><item><title>&#35813;&#30740;&#31350;&#20351;&#29992; DEA &#26041;&#27861;&#35780;&#20272;&#20102;&#25705;&#27931;&#21733;&#20844;&#31435;&#21307;&#38498;&#32593;&#32476;&#30340;&#25216;&#26415;&#25928;&#29575;&#65292;&#32467;&#26524;&#34920;&#26126;&#20844;&#31435;&#21307;&#38498;&#32593;&#32476;&#30340;&#24179;&#22343;&#25216;&#26415;&#25928;&#29575;&#26377;&#25152;&#25913;&#21892;&#12290;</title><link>https://arxiv.org/abs/2402.14940</link><description>&lt;p&gt;
&#22312;&#25705;&#27931;&#21733;&#20844;&#31435;&#21307;&#38498;&#32593;&#32476;&#20013;&#30340;&#25216;&#26415;&#25928;&#29575;&#35780;&#20272;&#65306;&#20351;&#29992; DEA &#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Assessment of Technical Efficiency in the Moroccan Public Hospital Network: Using the DEA Method
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.14940
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#20351;&#29992; DEA &#26041;&#27861;&#35780;&#20272;&#20102;&#25705;&#27931;&#21733;&#20844;&#31435;&#21307;&#38498;&#32593;&#32476;&#30340;&#25216;&#26415;&#25928;&#29575;&#65292;&#32467;&#26524;&#34920;&#26126;&#20844;&#31435;&#21307;&#38498;&#32593;&#32476;&#30340;&#24179;&#22343;&#25216;&#26415;&#25928;&#29575;&#26377;&#25152;&#25913;&#21892;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
arXiv:2402.14940v1 &#21457;&#34920;&#31867;&#22411;&#65306;&#26032;&#30340; &#25688;&#35201;&#65306;&#32972;&#26223;&#65306;&#25705;&#27931;&#21733;&#20844;&#31435;&#21307;&#38498;&#32593;&#32476;&#22312;&#25552;&#20379;&#21307;&#30103;&#26381;&#21153;&#26041;&#38754;&#21457;&#25381;&#30528;&#20851;&#38190;&#20316;&#29992;&#12290;&#28982;&#32780;&#65292;&#35813;&#32593;&#32476;&#22312;&#21307;&#30103;&#31649;&#29702;&#30340;&#25216;&#26415;&#25928;&#29575;&#26041;&#38754;&#38754;&#20020;&#25361;&#25112;&#12290;&#30446;&#26631;&#65306;&#26412;&#30740;&#31350;&#26088;&#22312;&#35780;&#20272;&#25705;&#27931;&#21733;&#20844;&#31435;&#21307;&#38498;&#32593;&#32476;&#30340;&#25216;&#26415;&#25928;&#29575;&#12290;&#26041;&#27861;&#65306;&#26412;&#25991;&#27604;&#36739;&#20102;2017&#24180;&#33267;2020&#24180;&#38388;77&#23478;&#20844;&#31435;&#21307;&#38498;&#32593;&#32476;&#30340;&#25928;&#29575;&#12290;&#25968;&#25454;&#26469;&#28304;&#20110;&#25705;&#27931;&#21733;&#21355;&#29983;&#37096;&#35268;&#21010;&#21644;&#36130;&#21153;&#36164;&#28304;&#24635;&#23616;&#65288;DPFR&#65289;&#12290;&#37319;&#29992;&#25968;&#25454;&#21253;&#32476;&#20998;&#26512;&#65288;DEA&#65289;&#26041;&#27861;&#65292;&#20351;&#29992;&#19977;&#20010;&#36755;&#20837;&#65288;&#21307;&#38498;&#12289;&#21307;&#29983;&#21644;Paramedical&#65289;&#21644;&#22235;&#20010;&#36755;&#20986;&#65288;&#21151;&#33021;&#33021;&#21147;&#12289;&#20303;&#38498;&#22825;&#25968;&#21644;&#20837;&#38498;&#65289;&#12290;&#27492;&#22806;&#65292;&#36824;&#21033;&#29992; Malmquist &#25351;&#25968;&#65288;MI&#65289;&#26469;&#20998;&#26512;&#29983;&#20135;&#35201;&#32032;&#65292;&#37319;&#29992;&#21516;&#34892;&#24314;&#27169;&#26469;&#35299;&#20915;&#21307;&#38498;&#20302;&#25928;&#29575;&#38382;&#39064;&#12290;&#32467;&#26524;&#65306;&#20844;&#31435;&#21307;&#38498;&#32593;&#32476;&#30340;&#24179;&#22343;&#25216;&#26415;&#25928;&#29575;&#19981;&#26029;&#25552;&#39640;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.14940v1 Announce Type: new  Abstract: Background: The public hospital network in Morocco plays a crucial role in providing healthcare services. However, this network faces challenges in terms of technical efficiency in healthcare management. Objectives: This study aimed to assess the technical efficiency of the public hospital network in Morocco. Methods: This article compares the efficiency of 77 public hospital networks from 2017 to 2020. Data were collected from the Directorate of Planning and Financial Resources (DPFR) of the Health Ministry Marocco. The Data Envelopment Analysis (DEA) method was employed, using three inputs (Hospital, Physician and Paramedical) and four outputs (Functional capacity, Hospitalization days and Admission). Additionally, the Malmquist index (MI) is utilized to analyse the factors of production, and peer modelling is incorporated to address hospital inefficiency. Results: The average technical efficiency of public hospital networks under the 
&lt;/p&gt;</description></item><item><title>&#35813;&#30740;&#31350;&#35780;&#20272;&#20102;&#38750;&#27954;&#27597;&#23156;&#20581;&#24247;&#39046;&#22495;&#20013;&#36130;&#21153;&#22240;&#32032;&#23545;&#21307;&#30103;&#31995;&#32479;&#25928;&#29575;&#30340;&#24433;&#21709;&#65292;&#24182;&#21457;&#29616;&#21482;&#26377;&#23569;&#37096;&#20998;&#22269;&#23478;&#34920;&#29616;&#20986;&#39640;&#25928;&#29575;&#65292;&#25351;&#20986;&#36130;&#21153;&#20915;&#23450;&#22240;&#32032;&#23545;&#27492;&#20855;&#26377;&#37325;&#35201;&#24433;&#21709;&#12290;</title><link>https://arxiv.org/abs/2402.14939</link><description>&lt;p&gt;
&#35780;&#20272;&#24433;&#21709;&#38750;&#27954;&#27597;&#23156;&#20799;&#20581;&#24247;&#30340;&#36130;&#21153;&#22240;&#32032;
&lt;/p&gt;
&lt;p&gt;
Evaluating the Financial Factors Influencing Maternal, Newborn, and Child Health in Africa
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.14939
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#35780;&#20272;&#20102;&#38750;&#27954;&#27597;&#23156;&#20581;&#24247;&#39046;&#22495;&#20013;&#36130;&#21153;&#22240;&#32032;&#23545;&#21307;&#30103;&#31995;&#32479;&#25928;&#29575;&#30340;&#24433;&#21709;&#65292;&#24182;&#21457;&#29616;&#21482;&#26377;&#23569;&#37096;&#20998;&#22269;&#23478;&#34920;&#29616;&#20986;&#39640;&#25928;&#29575;&#65292;&#25351;&#20986;&#36130;&#21153;&#20915;&#23450;&#22240;&#32032;&#23545;&#27492;&#20855;&#26377;&#37325;&#35201;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#35843;&#26597;&#20102;&#21307;&#30103;&#31995;&#32479;&#25928;&#29575;&#23545;&#38750;&#27954;&#27597;&#23156;&#20799;&#26381;&#21153;&#25552;&#20379;&#30340;&#24433;&#21709;&#12290;&#20351;&#29992;&#25968;&#25454;&#21253;&#32476;&#20998;&#26512;&#21644;Tobit&#22238;&#24402;&#35780;&#20272;&#22823;&#38470;&#19978;46&#20010;&#21307;&#30103;&#31995;&#32479;&#30340;&#25928;&#29575;&#65292;&#21033;&#29992;&#21464;&#37327;&#35268;&#27169;&#22238;&#25253;&#27169;&#22411;&#21644;&#36755;&#20837;&#23548;&#21521;&#35780;&#20272;&#25216;&#26415;&#25928;&#29575;&#12290;Tobit&#26041;&#27861;&#29992;&#20110;&#25506;&#35752;&#23548;&#33268;&#20302;&#25928;&#30340;&#22240;&#32032;&#65292;&#36755;&#20837;&#21464;&#37327;&#21253;&#25324;&#21307;&#38498;&#12289;&#21307;&#29983;&#21644;&#21307;&#21153;&#20154;&#21592;&#65292;&#36755;&#20986;&#21464;&#37327;&#21253;&#25324;&#27597;&#23156;&#20799;&#20837;&#38498;&#12289;&#21078;&#23467;&#20135;&#25163;&#26415;&#12289;&#21151;&#33021;&#33021;&#21147;&#21644;&#20303;&#38498;&#22825;&#25968;&#12290;&#32467;&#26524;&#26174;&#31034;&#65292;&#21482;&#26377;26%&#30340;&#22269;&#23478;&#34920;&#29616;&#20986;&#39640;&#25928;&#29575;&#65292;&#32780;&#26377;74%&#30340;&#22269;&#23478;&#23384;&#22312;&#20302;&#25928;&#29575;&#12290;&#21457;&#29616;&#30340;&#36130;&#21153;&#20915;&#23450;&#22240;&#32032;&#21253;&#25324;&#30446;&#21069;&#30340;&#20581;&#24247;&#25903;&#20986;&#12289;&#32508;&#21512;&#35206;&#30422;&#25351;&#25968;&#21644;&#20154;&#22343;&#30446;&#21069;&#20581;&#24247;&#25903;&#20986;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.14939v1 Announce Type: new  Abstract: The study investigated the impact of healthcare system efficiency on the delivery of maternal, newborn, and child services in Africa. Data Envelopment Analysis and Tobit regression were employed to assess the efficiency of 46 healthcare systems across the continent, utilizing the Variable Returns to Scale model with Input orientation to evaluate technical efficiency. The Tobit method was utilized to explore factors contributing to inefficiency, with inputs variables including hospital, physician, and paramedical staff, and outputs variables encompassing maternal, newborn, and child admissions, cesarean interventions, functional competency, and hospitalization days. Results revealed that only 26% of countries exhibited efficiency, highlighting a significant proportion of 74% with inefficiencies. Financial determinants such as current health expenditures, comprehensive coverage index, and current health expenditure per capita were found to
&lt;/p&gt;</description></item><item><title>&#25552;&#20986;&#20102;&#29992;&#20110;&#39118;&#38505;&#20215;&#20540;&#65288;VaR&#65289;&#21644;CoVaR&#30340;&#32852;&#21512;&#21160;&#24577;&#39044;&#27979;&#27169;&#22411;&#65292;&#24341;&#20837;&#20102;&#19968;&#31181;&#26032;&#30340;&#21442;&#25968;&#20272;&#35745;&#26041;&#27861;&#65292;&#24182;&#22312;&#32654;&#22269;&#22823;&#22411;&#38134;&#34892;&#30340;&#23454;&#35777;&#20998;&#26512;&#20013;&#23637;&#31034;&#20102;&#20854;&#20248;&#36234;&#24615;&#12290;</title><link>https://arxiv.org/abs/2206.14275</link><description>&lt;p&gt;
&#21160;&#24577;CoVaR&#24314;&#27169;
&lt;/p&gt;
&lt;p&gt;
Dynamic CoVaR Modeling
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2206.14275
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#29992;&#20110;&#39118;&#38505;&#20215;&#20540;&#65288;VaR&#65289;&#21644;CoVaR&#30340;&#32852;&#21512;&#21160;&#24577;&#39044;&#27979;&#27169;&#22411;&#65292;&#24341;&#20837;&#20102;&#19968;&#31181;&#26032;&#30340;&#21442;&#25968;&#20272;&#35745;&#26041;&#27861;&#65292;&#24182;&#22312;&#32654;&#22269;&#22823;&#22411;&#38134;&#34892;&#30340;&#23454;&#35777;&#20998;&#26512;&#20013;&#23637;&#31034;&#20102;&#20854;&#20248;&#36234;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
CoVaR&#65288;&#26465;&#20214;&#39118;&#38505;&#20215;&#20540;&#65289;&#26159;&#19968;&#31181;&#27969;&#34892;&#30340;&#31995;&#32479;&#39118;&#38505;&#24230;&#37327;&#26041;&#27861;&#65292;&#22312;&#32463;&#27982;&#23398;&#21644;&#37329;&#34701;&#39046;&#22495;&#34987;&#24191;&#27867;&#20351;&#29992;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#29992;&#20110;&#39118;&#38505;&#20215;&#20540;&#65288;VaR&#65289;&#21644;CoVaR&#30340;&#32852;&#21512;&#21160;&#24577;&#39044;&#27979;&#27169;&#22411;&#12290;&#25105;&#20204;&#36824;&#20171;&#32461;&#20102;&#19968;&#31181;&#22522;&#20110;&#26368;&#36817;&#25552;&#20986;&#30340;VaR&#21644;CoVaR&#23545;&#30340;&#21452;&#21464;&#37327;&#35780;&#20998;&#20989;&#25968;&#30340;&#27169;&#22411;&#21442;&#25968;&#30340;&#20004;&#27493;M&#20272;&#35745;&#37327;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#21442;&#25968;&#20272;&#35745;&#37327;&#30340;&#19968;&#33268;&#24615;&#21644;&#28176;&#36817;&#27491;&#24577;&#24615;&#65292;&#24182;&#20998;&#26512;&#20102;&#23427;&#22312;&#27169;&#25311;&#20013;&#30340;&#26377;&#38480;&#26679;&#26412;&#24615;&#36136;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#23558;&#25105;&#20204;&#30340;&#21160;&#24577;&#39044;&#27979;&#27169;&#22411;&#30340;&#19968;&#20010;&#29305;&#23450;&#23376;&#31867;&#24212;&#29992;&#20110;&#32654;&#22269;&#22823;&#22411;&#38134;&#34892;&#30340;&#23545;&#25968;&#25910;&#30410;&#29575;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;&#25105;&#20204;&#30340;CoCAViaR&#27169;&#22411;&#20135;&#29983;&#30340;CoVaR&#39044;&#27979;&#20248;&#20110;&#24403;&#21069;&#22522;&#20934;&#27169;&#22411;&#21457;&#24067;&#30340;&#39044;&#27979;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2206.14275v3 Announce Type: replace  Abstract: The popular systemic risk measure CoVaR (conditional Value-at-Risk) is widely used in economics and finance. Formally, it is defined as a large quantile of one variable (e.g., losses in the financial system) conditional on some other variable (e.g., losses in a bank's shares) being in distress. In this article, we propose joint dynamic forecasting models for the Value-at-Risk (VaR) and CoVaR. We also introduce a two-step M-estimator for the model parameters drawing on recently proposed bivariate scoring functions for the pair (VaR, CoVaR). We prove consistency and asymptotic normality of our parameter estimator and analyze its finite-sample properties in simulations. Finally, we apply a specific subclass of our dynamic forecasting models, which we call CoCAViaR models, to log-returns of large US banks. It is shown that our CoCAViaR models generate CoVaR predictions that are superior to forecasts issued from current benchmark models.
&lt;/p&gt;</description></item><item><title>&#36825;&#39033;&#30740;&#31350;&#21033;&#29992;&#24191;&#20041;&#38543;&#26426;&#26862;&#26519;&#21644;&#29790;&#20856;&#34892;&#25919;&#25968;&#25454;&#21457;&#29616;&#65292;&#24037;&#20316;&#20007;&#22833;&#23545;&#19981;&#21516;&#24037;&#20154;&#12289;&#20225;&#19994;&#21644;&#24066;&#22330;&#30340;&#25910;&#20837;&#24433;&#21709;&#20855;&#26377;&#26497;&#22823;&#30340;&#24322;&#36136;&#24615;&#12290;&#23545;&#21463;&#24433;&#21709;&#31243;&#24230;&#26368;&#22823;&#30340;&#24037;&#20154;&#32780;&#35328;&#65292;&#22833;&#21435;&#30340;&#24037;&#20316;&#20351;&#20854;&#27599;&#24180;&#25910;&#20837;&#25439;&#22833;50%&#65292;&#21313;&#24180;&#26399;&#38388;&#32047;&#35745;&#25439;&#22833;&#36798;&#21040;250%&#12290;&#23545;&#21463;&#24433;&#21709;&#31243;&#24230;&#26368;&#23567;&#30340;&#24037;&#20154;&#32780;&#35328;&#65292;&#20165;&#36973;&#21463;&#36793;&#38469;&#25439;&#22833;&#19981;&#21040;6%&#12290;&#24635;&#20307;&#32780;&#35328;&#65292;&#36825;&#20123;&#24433;&#21709;&#22312;&#20225;&#19994;&#20869;&#37096;&#21644;&#19981;&#21516;&#20010;&#20307;&#29305;&#24449;&#20043;&#38388;&#37117;&#23384;&#22312;&#24046;&#24322;&#12290;</title><link>http://arxiv.org/abs/2307.06684</link><description>&lt;p&gt;
&#24037;&#20316;&#20007;&#22833;&#23545;&#19981;&#21516;&#24037;&#20154;&#12289;&#20225;&#19994;&#21644;&#24066;&#22330;&#30340;&#25910;&#20837;&#24433;&#21709;&#24322;&#36136;&#24615;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
The Heterogeneous Earnings Impact of Job Loss Across Workers, Establishments, and Markets. (arXiv:2307.06684v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.06684
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#30740;&#31350;&#21033;&#29992;&#24191;&#20041;&#38543;&#26426;&#26862;&#26519;&#21644;&#29790;&#20856;&#34892;&#25919;&#25968;&#25454;&#21457;&#29616;&#65292;&#24037;&#20316;&#20007;&#22833;&#23545;&#19981;&#21516;&#24037;&#20154;&#12289;&#20225;&#19994;&#21644;&#24066;&#22330;&#30340;&#25910;&#20837;&#24433;&#21709;&#20855;&#26377;&#26497;&#22823;&#30340;&#24322;&#36136;&#24615;&#12290;&#23545;&#21463;&#24433;&#21709;&#31243;&#24230;&#26368;&#22823;&#30340;&#24037;&#20154;&#32780;&#35328;&#65292;&#22833;&#21435;&#30340;&#24037;&#20316;&#20351;&#20854;&#27599;&#24180;&#25910;&#20837;&#25439;&#22833;50%&#65292;&#21313;&#24180;&#26399;&#38388;&#32047;&#35745;&#25439;&#22833;&#36798;&#21040;250%&#12290;&#23545;&#21463;&#24433;&#21709;&#31243;&#24230;&#26368;&#23567;&#30340;&#24037;&#20154;&#32780;&#35328;&#65292;&#20165;&#36973;&#21463;&#36793;&#38469;&#25439;&#22833;&#19981;&#21040;6%&#12290;&#24635;&#20307;&#32780;&#35328;&#65292;&#36825;&#20123;&#24433;&#21709;&#22312;&#20225;&#19994;&#20869;&#37096;&#21644;&#19981;&#21516;&#20010;&#20307;&#29305;&#24449;&#20043;&#38388;&#37117;&#23384;&#22312;&#24046;&#24322;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20351;&#29992;&#24191;&#20041;&#38543;&#26426;&#26862;&#26519;&#21644;&#20016;&#23500;&#30340;&#29790;&#20856;&#34892;&#25919;&#25968;&#25454;&#65292;&#25105;&#20204;&#21457;&#29616;&#30001;&#20110;&#20225;&#19994;&#20851;&#38381;&#32780;&#23548;&#33268;&#30340;&#24037;&#20316;&#22833;&#21435;&#30340;&#25910;&#20837;&#24433;&#21709;&#22312;&#24037;&#20154;&#12289;&#20225;&#19994;&#21644;&#24066;&#22330;&#20043;&#38388;&#23384;&#22312;&#26497;&#22823;&#30340;&#24322;&#36136;&#24615;&#12290;&#21463;&#24433;&#21709;&#31243;&#24230;&#26368;&#22823;&#30340;&#21313;&#20998;&#20301;&#24037;&#20154;&#22312;&#22833;&#19994;&#21518;&#30340;&#19968;&#24180;&#20869;&#20250;&#25439;&#22833;50%&#30340;&#24180;&#25910;&#20837;&#65292;&#24182;&#19988;&#22312;&#21313;&#24180;&#26399;&#38388;&#32047;&#35745;&#25439;&#22833;&#36798;&#21040;250%&#12290;&#30456;&#21453;&#65292;&#21463;&#24433;&#21709;&#31243;&#24230;&#26368;&#23567;&#30340;&#21313;&#20998;&#20301;&#24037;&#20154;&#22312;&#22833;&#19994;&#21518;&#30340;&#19968;&#24180;&#20869;&#21482;&#20250;&#36973;&#21463;&#19981;&#21040;6%&#30340;&#36793;&#38469;&#25439;&#22833;&#12290;&#21463;&#24433;&#21709;&#31243;&#24230;&#26368;&#22823;&#30340;&#21313;&#20998;&#20301;&#24037;&#20154;&#24448;&#24448;&#26159;&#20302;&#34218;&#24037;&#20154;&#19988;&#34218;&#36164;&#20986;&#29616;&#36127;&#22686;&#38271;&#36235;&#21183;&#12290;&#36825;&#24847;&#21619;&#30528;&#23545;&#20110;&#20302;&#25910;&#20837;&#24037;&#20154;&#32780;&#35328;&#65292;&#65288;&#22833;&#21435;&#30340;&#65289;&#23601;&#19994;&#30340;&#32463;&#27982;&#20215;&#20540;&#26159;&#26368;&#22823;&#30340;&#12290;&#21407;&#22240;&#26159;&#35768;&#22810;&#36825;&#20123;&#24037;&#20154;&#22312;&#22833;&#19994;&#21518;&#26410;&#33021;&#25214;&#21040;&#26032;&#30340;&#24037;&#20316;&#12290;&#24635;&#20307;&#32780;&#35328;&#65292;&#36825;&#20123;&#24433;&#21709;&#22312;&#20225;&#19994;&#20869;&#37096;&#21644;&#19981;&#21516;&#37325;&#35201;&#20010;&#20307;&#29305;&#24449;&#65288;&#22914;&#24180;&#40836;&#21644;&#21463;&#25945;&#32946;&#31243;&#24230;&#65289;&#20043;&#38388;&#37117;&#23384;&#22312;&#24322;&#36136;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Using generalized random forests and rich Swedish administrative data, we show that the earnings effects of job displacement due to establishment closures are extremely heterogeneous across workers, establishments, and markets. The decile of workers with the largest predicted effects lose 50 percent of annual earnings the year after displacement and accumulated losses amount to 250 percent during a decade. In contrast, workers in the least affected decile experience only marginal losses of less than 6 percent in the year after displacement. Workers in the most affected decile tend to be lower paid workers on negative earnings trajectories. This implies that the economic value of (lost) jobs is greatest for workers with low earnings. The reason is that many of these workers fail to find new employment after displacement. Overall, the effects are heterogeneous both within and across establishments and combinations of important individual characteristics such as age and schooling. Adverse
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#30740;&#31350;&#20102;&#19968;&#20010;&#20449;&#24687;&#33719;&#21462;&#21644;&#20256;&#36882;&#30340;&#27169;&#22411;&#65292;&#22312;&#35813;&#27169;&#22411;&#20013;&#65292;&#21457;&#36865;&#32773;&#36873;&#25321;&#26377;&#36873;&#25321;&#24615;&#22320;&#24573;&#35270;&#20449;&#24687;&#65292;&#32780;&#19981;&#26159;&#27450;&#39575;&#25509;&#25910;&#32773;&#12290;&#26412;&#25991;&#38416;&#26126;&#20102;&#27450;&#39575;&#21487;&#33021;&#24615;&#22914;&#20309;&#20915;&#23450;&#21457;&#36865;&#32773;&#36873;&#25321;&#33719;&#21462;&#21644;&#20256;&#36882;&#30340;&#20449;&#24687;&#65292;&#24182;&#30830;&#23450;&#20102;&#21457;&#36865;&#32773;&#21644;&#25509;&#25910;&#32773;&#26368;&#20248;&#30340;&#20266;&#36896;&#29615;&#22659;&#12290;</title><link>http://arxiv.org/abs/2304.02989</link><description>&lt;p&gt;
&#38544;&#31192;&#30340;&#23398;&#20064;&#21644;&#25259;&#38706;
&lt;/p&gt;
&lt;p&gt;
Covert learning and disclosure. (arXiv:2304.02989v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.02989
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#30740;&#31350;&#20102;&#19968;&#20010;&#20449;&#24687;&#33719;&#21462;&#21644;&#20256;&#36882;&#30340;&#27169;&#22411;&#65292;&#22312;&#35813;&#27169;&#22411;&#20013;&#65292;&#21457;&#36865;&#32773;&#36873;&#25321;&#26377;&#36873;&#25321;&#24615;&#22320;&#24573;&#35270;&#20449;&#24687;&#65292;&#32780;&#19981;&#26159;&#27450;&#39575;&#25509;&#25910;&#32773;&#12290;&#26412;&#25991;&#38416;&#26126;&#20102;&#27450;&#39575;&#21487;&#33021;&#24615;&#22914;&#20309;&#20915;&#23450;&#21457;&#36865;&#32773;&#36873;&#25321;&#33719;&#21462;&#21644;&#20256;&#36882;&#30340;&#20449;&#24687;&#65292;&#24182;&#30830;&#23450;&#20102;&#21457;&#36865;&#32773;&#21644;&#25509;&#25910;&#32773;&#26368;&#20248;&#30340;&#20266;&#36896;&#29615;&#22659;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#30740;&#31350;&#20102;&#19968;&#20010;&#20449;&#24687;&#33719;&#21462;&#21644;&#20256;&#36882;&#30340;&#27169;&#22411;&#65292;&#22312;&#35813;&#27169;&#22411;&#20013;&#65292;&#21457;&#36865;&#32773;&#35823;&#25253;&#20854;&#21457;&#29616;&#30340;&#33021;&#21147;&#21463;&#21040;&#38480;&#21046;&#12290;&#22312;&#22343;&#34913;&#29366;&#24577;&#19979;&#65292;&#21457;&#36865;&#32773;&#36873;&#25321;&#26377;&#36873;&#25321;&#24615;&#22320;&#24573;&#35270;&#20449;&#24687;&#65292;&#32780;&#19981;&#26159;&#27450;&#39575;&#25509;&#25910;&#32773;&#12290;&#34429;&#28982;&#19981;&#20250;&#20135;&#29983;&#27450;&#39575;&#65292;&#20294;&#25105;&#24378;&#35843;&#20102;&#27450;&#39575;&#21487;&#33021;&#24615;&#22914;&#20309;&#20915;&#23450;&#21457;&#36865;&#32773;&#36873;&#25321;&#33719;&#21462;&#21644;&#20256;&#36882;&#30340;&#20449;&#24687;&#12290;&#28982;&#21518;&#65292;&#26412;&#25991;&#36716;&#21521;&#27604;&#36739;&#38745;&#24577;&#20998;&#26512;&#65292;&#38416;&#26126;&#20102;&#21457;&#36865;&#32773;&#22914;&#20309;&#20174;&#20854;&#22768;&#26126;&#26356;&#21487;&#39564;&#35777;&#20013;&#21463;&#30410;&#65292;&#24182;&#34920;&#26126;&#36825;&#31867;&#20284;&#20110;&#22686;&#21152;&#20854;&#25215;&#35834;&#33021;&#21147;&#12290;&#26368;&#21518;&#65292;&#26412;&#25991;&#30830;&#23450;&#20102;&#21457;&#36865;&#32773;&#21644;&#25509;&#25910;&#32773;&#26368;&#20248;&#30340;&#20266;&#36896;&#29615;&#22659;&#12290;
&lt;/p&gt;
&lt;p&gt;
I study a model of information acquisition and transmission in which the sender's ability to misreport her findings is limited. In equilibrium, the sender only influences the receiver by choosing to remain selectively ignorant, rather than by deceiving her about the discoveries. Although deception does not occur, I highlight how deception possibilities determine what information the sender chooses to acquire and transmit. I then turn to comparative statics, characterizing in which sense the sender benefits from her claims being more verifiable, showing this is akin to increasing her commitment power. Finally, I characterize sender- and receiver-optimal falsification environments.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#38656;&#27714;&#24377;&#24615;&#30340;&#21160;&#24577;&#30005;&#20215;&#27169;&#22411;&#65292;&#22312;&#19981;&#30830;&#23450;&#24615;&#19979;&#32771;&#34385;&#20102;&#38646;&#21806;&#30005;&#21147;&#24066;&#22330;&#20013;&#30340;&#39046;&#23548;&#32773;&#21644;&#36861;&#38543;&#32773;&#20043;&#38388;&#30340;&#20851;&#31995;&#65292;&#24182;&#36890;&#36807;&#20998;&#23618;&#20915;&#31574;&#36807;&#31243;&#20248;&#21270;&#19981;&#21516;&#24066;&#22330;&#37197;&#32622;&#30340;&#36873;&#25321;&#12290;</title><link>http://arxiv.org/abs/2105.03405</link><description>&lt;p&gt;
&#19981;&#30830;&#23450;&#24615;&#19979;&#22522;&#20110;&#21160;&#24577;&#30005;&#20215;&#30340;&#38646;&#21806;&#30005;&#21147;&#24066;&#22330;&#38656;&#27714;&#21709;&#24212;
&lt;/p&gt;
&lt;p&gt;
Dynamic tariffs-based demand response in retail electricity market under uncertainty. (arXiv:2105.03405v3 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2105.03405
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#38656;&#27714;&#24377;&#24615;&#30340;&#21160;&#24577;&#30005;&#20215;&#27169;&#22411;&#65292;&#22312;&#19981;&#30830;&#23450;&#24615;&#19979;&#32771;&#34385;&#20102;&#38646;&#21806;&#30005;&#21147;&#24066;&#22330;&#20013;&#30340;&#39046;&#23548;&#32773;&#21644;&#36861;&#38543;&#32773;&#20043;&#38388;&#30340;&#20851;&#31995;&#65292;&#24182;&#36890;&#36807;&#20998;&#23618;&#20915;&#31574;&#36807;&#31243;&#20248;&#21270;&#19981;&#21516;&#24066;&#22330;&#37197;&#32622;&#30340;&#36873;&#25321;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#30005;&#21147;&#38656;&#27714;&#21709;&#24212;&#65288;DR&#65289;&#35745;&#21010;&#22312;&#30005;&#21147;&#24066;&#22330;&#37325;&#32452;&#21518;&#22791;&#21463;&#20851;&#27880;&#65292;&#24182;&#34987;&#29992;&#20110;&#20248;&#21270;&#24066;&#22330;&#21442;&#19982;&#32773;&#30340;&#20915;&#31574;&#12290;&#20182;&#20204;&#21487;&#20197;&#36890;&#36807;&#20462;&#25913;&#29992;&#30005;&#37327;&#25110;&#30005;&#21147;&#28040;&#36153;&#26102;&#38388;&#26469;&#25552;&#39640;&#31995;&#32479;&#30340;&#21487;&#38752;&#24615;&#21644;&#31649;&#29702;&#20215;&#26684;&#27874;&#21160;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#21338;&#24328;&#29702;&#35770;&#27169;&#22411;&#65292;&#22312;&#19981;&#30830;&#23450;&#30340;&#21160;&#24577;&#20215;&#26684;&#29615;&#22659;&#19979;&#32771;&#34385;&#20102;&#38646;&#21806;&#21830;&#65288;&#39046;&#23548;&#32773;&#65289;&#21644;&#28040;&#36153;&#32773;&#65288;&#36861;&#38543;&#32773;&#65289;&#20043;&#38388;&#30340;&#20851;&#31995;&#12290;&#35813;&#27169;&#22411;&#21033;&#29992;&#38656;&#27714;&#24377;&#24615;&#36827;&#34892;&#20998;&#23618;&#20915;&#31574;&#36807;&#31243;&#65292;&#20174;&#32780;&#22312;&#19981;&#21516;&#30340;&#19981;&#30830;&#23450;&#24615;&#26469;&#28304;&#19979;&#25552;&#20379;&#19981;&#21516;&#24066;&#22330;&#37197;&#32622;&#30340;&#36873;&#25321;&#65292;&#20174;&#32780;&#24102;&#26469;&#20248;&#36136;&#21644;&#32463;&#27982;&#25910;&#30410;&#12290;&#35813;&#27169;&#22411;&#22312;&#20004;&#20010;&#26694;&#26550;&#19979;&#27714;&#35299;&#65306;&#19968;&#26159;&#32771;&#34385;&#38646;&#21806;&#21830;&#30340;&#24066;&#22330;&#21147;&#37327;&#65292;&#21478;&#19968;&#20010;&#26159;&#22522;&#20110;&#23436;&#20840;&#31454;&#20105;&#28216;&#25103;&#30340;&#22343;&#34913;&#35774;&#32622;&#12290;&#36825;&#20123;&#27169;&#22411;&#21487;&#29992;&#19968;&#20010;&#25968;&#23398;&#35268;&#21010;&#27169;&#22411;&#26469;&#34920;&#36848;&#24182;&#27714;&#35299;&#20986;&#24179;&#34913;&#28857;&#12290;
&lt;/p&gt;
&lt;p&gt;
Demand response (DR) programs have gained much attention after the restructuring of the electricity markets and have been used to optimize the decisions of market participants. They can potentially enhance system reliability and manage price volatility by modifying the amount or time of electricity consumption. This paper proposes a novel game-theoretical model accounting for the relationship between retailers (leaders) and consumers (followers) in a dynamic price environment under uncertainty. The quality and economic gains brought by the proposed procedure essentially stem from the utilization of demand elasticity in a hierarchical decision process that renders the options of different market configurations under different sources of uncertainty. The model is solved under two frameworks: by considering the retailer's market power and by accounting for an equilibrium setting based on a perfect competitive game. These are formulated in terms of a mathematical program with equilibrium c
&lt;/p&gt;</description></item></channel></rss>