<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#25506;&#31350;&#20915;&#31574;&#32773;&#22914;&#20309;&#40723;&#21169;&#39640;&#24847;&#35782;&#19987;&#23478;&#25581;&#31034;&#26032;&#22855;&#24773;&#20917;&#24182;&#30830;&#20445;&#23436;&#20840;&#25581;&#31034;&#30340;&#25215;&#35834;&#27700;&#24179;&#65307;&#26368;&#20248;&#31574;&#30053;&#26159;&#37319;&#29992;&#36817;&#35270;&#26368;&#20248;&#21270;&#35797;&#39564;&#65292;&#21363;&#22312;&#20219;&#20309;&#20915;&#31574;&#28857;&#19978;&#65292;&#20915;&#31574;&#32773;&#37117;&#26377;&#21160;&#21147;&#25581;&#31034;&#26368;&#20855;&#20449;&#24687;&#37327;&#30340;&#26032;&#22855;&#24773;&#20917;&#12290;</title><link>http://arxiv.org/abs/2304.05142</link><description>&lt;p&gt;
&#25506;&#31350;&#20915;&#31574;&#32773;&#22914;&#20309;&#40723;&#21169;&#27604;&#20854;&#26356;&#20855;&#24847;&#35782;&#30340;&#19987;&#23478;&#25581;&#31034;&#26032;&#22855;&#24773;&#20917;
&lt;/p&gt;
&lt;p&gt;
Eliciting Awareness. (arXiv:2304.05142v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.05142
&lt;/p&gt;
&lt;p&gt;
&#25506;&#31350;&#20915;&#31574;&#32773;&#22914;&#20309;&#40723;&#21169;&#39640;&#24847;&#35782;&#19987;&#23478;&#25581;&#31034;&#26032;&#22855;&#24773;&#20917;&#24182;&#30830;&#20445;&#23436;&#20840;&#25581;&#31034;&#30340;&#25215;&#35834;&#27700;&#24179;&#65307;&#26368;&#20248;&#31574;&#30053;&#26159;&#37319;&#29992;&#36817;&#35270;&#26368;&#20248;&#21270;&#35797;&#39564;&#65292;&#21363;&#22312;&#20219;&#20309;&#20915;&#31574;&#28857;&#19978;&#65292;&#20915;&#31574;&#32773;&#37117;&#26377;&#21160;&#21147;&#25581;&#31034;&#26368;&#20855;&#20449;&#24687;&#37327;&#30340;&#26032;&#22855;&#24773;&#20917;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#19968;&#21517;&#20915;&#31574;&#32773;&#22914;&#20309;&#28608;&#21169;&#27604;&#20182;&#26356;&#20855;&#24847;&#35782;&#30340;&#19987;&#23478;&#25581;&#31034;&#26032;&#22855;&#24773;&#20917;&#12290;&#29305;&#21035;&#22320;&#65292;&#20915;&#31574;&#32773;&#23558;&#37319;&#21462;&#19968;&#20010;&#34892;&#21160;&#65292;&#20915;&#23450;&#19982;&#19981;&#30830;&#23450;&#24615;&#30340;&#35299;&#20915;&#19968;&#36215;&#65292;&#20026;&#20004;&#20010;&#29609;&#23478;&#25552;&#20379;&#22238;&#25253;&#12290;&#26412;&#25991;&#30830;&#23450;&#20102;&#30830;&#20445;&#23436;&#20840;&#25581;&#31034;&#25152;&#38656;&#30340;&#25215;&#35834;&#27700;&#24179;&#65306;&#20219;&#20309;&#23436;&#20840;&#25581;&#31034;&#30340;&#28608;&#21169;&#26041;&#26696;&#31561;&#25928;&#20110;&#19968;&#27454;&#21160;&#24577;&#28216;&#25103;&#65292;&#22312;&#27599;&#19968;&#36718;&#20013;&#65292;&#20915;&#31574;&#32773;&#25552;&#20986;&#19968;&#39033;&#34892;&#21160;&#35745;&#21010;&#65292;&#19987;&#23478;&#36873;&#25321;&#25581;&#31034;&#19968;&#20123;&#26032;&#22855;&#24773;&#20917;&#12290;&#24403;&#27809;&#26377;&#26032;&#22855;&#24773;&#20917;&#34987;&#25581;&#31034;&#24182;&#19988;&#19987;&#23478;&#36873;&#25321;&#23454;&#26045;&#21738;&#20010;&#25552;&#35758;&#30340;&#35745;&#21010;&#26102;&#65292;&#28216;&#25103;&#32467;&#26463;&#12290;&#20063;&#23601;&#26159;&#35828;&#65292;&#20915;&#31574;&#32773;&#24517;&#39035;&#33021;&#22815;&#25215;&#35834;&#65292;&#19968;&#26086;&#25552;&#20986;&#20102;&#34892;&#21160;&#35745;&#21010;&#65292;&#23601;&#19981;&#33021;&#25764;&#22238;&#12290;&#28982;&#21518;&#65292;&#25105;&#32771;&#34385;&#20102;&#24378;&#22823;&#31574;&#30053;&#30340;&#38598;&#21512;&#8212;&#8212;&#36825;&#20123;&#31574;&#30053;&#21487;&#20197;&#22312;&#19987;&#23478;&#30340;&#20219;&#20309;&#21487;&#33021;&#24847;&#35782;&#31867;&#22411;&#30340;&#24773;&#20917;&#19979;&#26368;&#22823;&#21270;&#26368;&#22351;&#24773;&#20917;&#19979;&#30340;&#32467;&#26524;&#65292;&#24182;&#35777;&#26126;&#23427;&#20204;&#30340;&#29305;&#24449;&#26159;&#19968;&#20010;&#20851;&#20110;&#36817;&#35270;&#26368;&#20248;&#21270;&#35797;&#39564;&#30340;&#21407;&#21017;&#65307;&#22312;&#20219;&#20309;&#32473;&#23450;&#30340;&#20915;&#31574;&#28857;&#19978;&#65292;&#20915;&#31574;&#32773;&#37117;&#26377;&#21160;&#21147;&#25581;&#31034;&#21487;&#33021;&#24773;&#20917;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper examines how a decision maker might incentive an expert, who is more aware than himself, to reveal novel contingencies. In particular, the decision maker will take an action that determines, along with the resolution of uncertainty, the payoffs to both players. I delineate the exact level of commitment needed to ensure full revelation: any fully revealing incentive scheme is equivalent to a dynamic game wherein each round the decision maker proposes a plan of action and the expert chooses to reveal some novel contingencies. The game ends when nothing novel is revealed and the expert chooses which of the proposed plans gets implemented. That is, the decision maker must be able to commit that once a plan of action is proposed, it cannot be taken off the table.  I then consider the set of robust strategies -- those strategies that maximize the worst case outcome across any possible awareness type of the expert -- and show they are characterized by a principle of myopic optimali
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#21457;&#23637;&#20102;&#19968;&#31181;&#23616;&#37096;&#22810;&#39033;&#24335;&#20272;&#35745;&#26102;&#38388;&#21464;&#21270;&#21442;&#25968;&#30340;&#26032;&#29702;&#35770;&#65292;&#24182;&#35777;&#26126;&#22312;&#24369;&#27491;&#21017;&#26465;&#20214;&#19979;&#65292;&#25152;&#25552;&#20986;&#30340;&#20272;&#35745;&#22120;&#26159;&#19968;&#33268;&#30340;&#65292;&#19988;&#26381;&#20174;&#27491;&#24577;&#20998;&#24067;&#12290;&#27492;&#22806;&#65292;&#35813;&#26041;&#27861;&#23545;&#20110;&#19981;&#21516;&#27169;&#22411;&#20855;&#26377;&#26222;&#36866;&#24615;&#65292;&#24182;&#33021;&#22815;&#22312;&#27850;&#26494;&#33258;&#22238;&#24402;&#27169;&#22411;&#20013;&#24471;&#21040;&#24212;&#29992;&#12290;</title><link>http://arxiv.org/abs/1904.05209</link><description>&lt;p&gt;
&#38750;&#32447;&#24615;&#27169;&#22411;&#20013;&#26102;&#38388;&#21464;&#21270;&#21442;&#25968;&#30340;&#23616;&#37096;&#22810;&#39033;&#24335;&#20272;&#35745;
&lt;/p&gt;
&lt;p&gt;
Local Polynomial Estimation of Time-Varying Parameters in Nonlinear Models. (arXiv:1904.05209v2 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/1904.05209
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#21457;&#23637;&#20102;&#19968;&#31181;&#23616;&#37096;&#22810;&#39033;&#24335;&#20272;&#35745;&#26102;&#38388;&#21464;&#21270;&#21442;&#25968;&#30340;&#26032;&#29702;&#35770;&#65292;&#24182;&#35777;&#26126;&#22312;&#24369;&#27491;&#21017;&#26465;&#20214;&#19979;&#65292;&#25152;&#25552;&#20986;&#30340;&#20272;&#35745;&#22120;&#26159;&#19968;&#33268;&#30340;&#65292;&#19988;&#26381;&#20174;&#27491;&#24577;&#20998;&#24067;&#12290;&#27492;&#22806;&#65292;&#35813;&#26041;&#27861;&#23545;&#20110;&#19981;&#21516;&#27169;&#22411;&#20855;&#26377;&#26222;&#36866;&#24615;&#65292;&#24182;&#33021;&#22815;&#22312;&#27850;&#26494;&#33258;&#22238;&#24402;&#27169;&#22411;&#20013;&#24471;&#21040;&#24212;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#22312;&#24191;&#27867;&#31867;&#21035;&#30340;&#38750;&#32447;&#24615;&#26102;&#38388;&#24207;&#21015;&#27169;&#22411;&#20013;&#21457;&#23637;&#20102;&#19968;&#31181;&#26032;&#30340;&#28176;&#36817;&#29702;&#35770;&#26469;&#20272;&#35745;&#26102;&#38388;&#21464;&#21270;&#21442;&#25968;&#30340;&#23616;&#37096;&#22810;&#39033;&#24335;&#65288;&#20934;&#65289;&#26368;&#22823;&#20284;&#28982;&#20272;&#35745;&#22120;&#12290;&#22312;&#24369;&#27491;&#21017;&#26465;&#20214;&#19979;&#65292;&#25105;&#20204;&#35777;&#26126;&#25152;&#25552;&#20986;&#30340;&#20272;&#35745;&#22120;&#22312;&#22823;&#26679;&#26412;&#19979;&#26159;&#19968;&#33268;&#30340;&#65292;&#24182;&#19988;&#26381;&#20174;&#27491;&#24577;&#20998;&#24067;&#12290;&#19982;&#29616;&#26377;&#29702;&#35770;&#30456;&#27604;&#65292;&#25105;&#20204;&#30340;&#26465;&#20214;&#23545;&#20110;&#25968;&#25454;&#29983;&#25104;&#36807;&#31243;&#21450;&#20854;&#20284;&#28982;&#20989;&#25968;&#30340;&#20809;&#28369;&#24615;&#21644;&#30697;&#26465;&#20214;&#35201;&#27714;&#36739;&#20302;&#12290;&#27492;&#22806;&#65292;&#20272;&#35745;&#22120;&#30340;&#20559;&#24046;&#39033;&#20855;&#26377;&#26356;&#31616;&#21333;&#30340;&#24418;&#24335;&#12290;&#25105;&#20204;&#36890;&#36807;&#23558;&#29702;&#35770;&#24212;&#29992;&#20110;&#23616;&#37096;&#20934;&#26368;&#22823;&#20284;&#28982;&#20272;&#35745;&#30340;&#26102;&#38388;&#21464;&#21270;VAR&#12289;ARCH&#21644;GARCH&#20197;&#21450;&#27850;&#26494;&#33258;&#22238;&#24402;&#27169;&#22411;&#65292;&#23637;&#31034;&#20102;&#25105;&#20204;&#26222;&#36866;&#32467;&#26524;&#30340;&#26377;&#30410;&#24615;&#12290;&#23545;&#20110;&#21069;&#19977;&#20010;&#27169;&#22411;&#65292;&#25105;&#20204;&#33021;&#22815;&#22823;&#22823;&#20943;&#24369;&#29616;&#26377;&#25991;&#29486;&#20013;&#30340;&#26465;&#20214;&#35201;&#27714;&#12290;&#23545;&#20110;&#27850;&#26494;&#33258;&#22238;&#24402;&#27169;&#22411;&#65292;&#29616;&#26377;&#29702;&#35770;&#19981;&#33021;&#24212;&#29992;&#65292;&#32780;&#25105;&#20204;&#30340;&#26032;&#26041;&#27861;&#20351;&#25105;&#20204;&#33021;&#22815;&#20998;&#26512;&#23427;&#12290;
&lt;/p&gt;
&lt;p&gt;
We develop a novel asymptotic theory for local polynomial (quasi-) maximum-likelihood estimators of time-varying parameters in a broad class of nonlinear time series models. Under weak regularity conditions, we show the proposed estimators are consistent and follow normal distributions in large samples. Our conditions impose weaker smoothness and moment conditions on the data-generating process and its likelihood compared to existing theories. Furthermore, the bias terms of the estimators take a simpler form. We demonstrate the usefulness of our general results by applying our theory to local (quasi-)maximum-likelihood estimators of a time-varying VAR's, ARCH and GARCH, and Poisson autogressions. For the first three models, we are able to substantially weaken the conditions found in the existing literature. For the Poisson autogression, existing theories cannot be be applied while our novel approach allows us to analyze it.
&lt;/p&gt;</description></item></channel></rss>