<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#22312;&#22823;&#24066;&#22330;&#20013;&#65292;&#24403;&#23398;&#38498;&#26681;&#25454;&#29420;&#31435;&#25277;&#21462;&#30340;&#20272;&#35745;&#20215;&#20540;&#23545;&#23398;&#29983;&#36827;&#34892;&#25490;&#21517;&#26102;&#65292;&#22914;&#20309;&#21305;&#37197;&#23398;&#29983;&#24471;&#21040;&#30340;&#22122;&#22768;&#31243;&#24230;&#21462;&#20915;&#20110;&#35813;&#20272;&#35745;&#20215;&#20540;&#30340;&#20998;&#24067;&#23614;&#37096;&#29305;&#24615;&#65306;&#23614;&#37096;&#36731;&#26102;&#21482;&#26377;&#26368;&#39640;&#20215;&#20540;&#23398;&#29983;&#34987;&#21305;&#37197;&#65292;&#23614;&#37096;&#38271;&#26102;&#25152;&#26377;&#23398;&#29983;&#20250;&#20197;&#22343;&#21248;&#38543;&#26426;&#30340;&#26041;&#24335;&#34987;&#21305;&#37197;&#12290;</title><link>https://arxiv.org/abs/2402.16771</link><description>&lt;p&gt;
&#22024;&#26434;&#21305;&#37197;&#24066;&#22330;&#30340;&#26234;&#24935;&#19982;&#24858;&#34850;
&lt;/p&gt;
&lt;p&gt;
Wisdom and Foolishness of Noisy Matching Markets
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.16771
&lt;/p&gt;
&lt;p&gt;
&#22312;&#22823;&#24066;&#22330;&#20013;&#65292;&#24403;&#23398;&#38498;&#26681;&#25454;&#29420;&#31435;&#25277;&#21462;&#30340;&#20272;&#35745;&#20215;&#20540;&#23545;&#23398;&#29983;&#36827;&#34892;&#25490;&#21517;&#26102;&#65292;&#22914;&#20309;&#21305;&#37197;&#23398;&#29983;&#24471;&#21040;&#30340;&#22122;&#22768;&#31243;&#24230;&#21462;&#20915;&#20110;&#35813;&#20272;&#35745;&#20215;&#20540;&#30340;&#20998;&#24067;&#23614;&#37096;&#29305;&#24615;&#65306;&#23614;&#37096;&#36731;&#26102;&#21482;&#26377;&#26368;&#39640;&#20215;&#20540;&#23398;&#29983;&#34987;&#21305;&#37197;&#65292;&#23614;&#37096;&#38271;&#26102;&#25152;&#26377;&#23398;&#29983;&#20250;&#20197;&#22343;&#21248;&#38543;&#26426;&#30340;&#26041;&#24335;&#34987;&#21305;&#37197;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#32771;&#34385;&#19968;&#20010;&#22810;&#23545;&#19968;&#30340;&#21305;&#37197;&#24066;&#22330;&#65292;&#23398;&#38498;&#23545;&#23398;&#29983;&#30340;&#30495;&#23454;&#20559;&#22909;&#36827;&#34892;&#20849;&#20139;&#65292;&#20294;&#21482;&#20351;&#29992;&#29420;&#31435;&#30340;&#22024;&#26434;&#25490;&#21517;&#26469;&#20570;&#20986;&#20915;&#31574;&#12290;&#27599;&#20010;&#23398;&#29983;&#26377;&#19968;&#20010;&#30495;&#23454;&#20215;&#20540;$v$&#65292;&#20294;&#27599;&#20010;&#23398;&#38498;$c$&#26681;&#25454;&#29420;&#31435;&#25277;&#21462;&#30340;&#20272;&#35745;&#20215;&#20540;$v + X_c$&#23545;&#23398;&#29983;&#36827;&#34892;&#25490;&#21517;&#65292;&#20854;&#20013;$X_c\sim \mathcal{D}.$ &#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#20851;&#20110;&#26368;&#32456;&#31283;&#23450;&#21305;&#37197;&#20013;&#21305;&#37197;&#23398;&#29983;&#30340;&#22122;&#22768;&#31243;&#24230;&#30340;&#22522;&#26412;&#38382;&#39064;&#65306;&#21305;&#37197;&#23398;&#29983;&#26102;&#26377;&#22810;&#22024;&#26434;&#65311;&#22312;&#22823;&#24066;&#22330;&#65288;&#21363;&#23398;&#29983;&#20154;&#25968;&#36830;&#32493;&#19988;&#23398;&#38498;&#25968;&#37327;&#20247;&#22810;&#65289;&#20013;&#21487;&#33021;&#20986;&#29616;&#20004;&#20010;&#24341;&#20154;&#27880;&#30446;&#30340;&#25928;&#24212;&#12290;&#24403;$\mathcal{D}$&#30340;&#23614;&#37096;&#36731;&#26102;&#65292;&#22122;&#22768;&#34987;&#23436;&#20840;&#34928;&#20943;&#65306;&#21482;&#26377;&#20215;&#20540;&#26368;&#39640;&#30340;&#23398;&#29983;&#20250;&#34987;&#21305;&#37197;&#12290;&#24403;$\mathcal{D}$&#30340;&#23614;&#37096;&#38271;&#26102;&#65292;&#22122;&#22768;&#34987;&#23436;&#20840;&#25918;&#22823;&#65306;&#23398;&#29983;&#23558;&#20197;&#22343;&#21248;&#38543;&#26426;&#30340;&#26041;&#24335;&#34987;&#21305;&#37197;&#12290;&#36825;&#20123;&#32467;&#26524;&#36866;&#29992;&#20110;&#20219;&#20309;&#23398;&#29983;&#20559;&#22909;&#20998;&#24067;&#30340;&#20998;&#24067;&#65292;&#21516;&#26102;&#20063;&#36866;&#29992;&#20110;&#21482;&#26377;&#23398;&#38498;&#23376;&#38598;&#21516;&#24847;&#30495;&#23454;&#23398;&#29983;&#20272;&#20540;&#32780;&#38750;&#25972;&#20010;&#24066;&#22330;&#30340;&#24773;&#20917;&#12290;&#26356;&#24191;&#27867;&#22320;&#35828;&#65292;&#25105;&#20204;&#30340;&#30740;&#31350;&#25299;&#23637;&#20102;&#26377;&#20851;&#21305;&#37197;&#24066;&#22330;&#30340;&#20256;&#32479;&#23545;&#31283;&#23450;&#24615;&#30340;&#25506;&#35752;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.16771v1 Announce Type: new  Abstract: We consider a many-to-one matching market where colleges share true preferences over students but make decisions using only independent noisy rankings. Each student has a true value $v$, but each college $c$ ranks the student according to an independently drawn estimated value $v + X_c$ for $X_c\sim \mathcal{D}.$ We ask a basic question about the resulting stable matching: How noisy is the set of matched students? Two striking effects can occur in large markets (i.e., with a continuum of students and a large number of colleges). When $\mathcal{D}$ is light-tailed, noise is fully attenuated: only the highest-value students are matched. When $\mathcal{D}$ is long-tailed, noise is fully amplified: students are matched uniformly at random. These results hold for any distribution of student preferences over colleges, and extend to when only subsets of colleges agree on true student valuations instead of the entire market. More broadly, our fr
&lt;/p&gt;</description></item><item><title>&#25552;&#20986;&#20102;&#38024;&#23545;&#20855;&#26377;&#36873;&#25321;&#24615;&#30340;&#20998;&#20301;&#25968;&#22238;&#24402;&#65288;QRS&#65289;&#20272;&#35745;&#30340;&#31616;&#21270;&#31639;&#27861;&#65292;&#36890;&#36807;&#39044;&#22788;&#29702;&#25216;&#26415;&#21644;&#20998;&#20301;&#26684;&#32593;&#20943;&#23569;&#35745;&#31639;&#26102;&#38388;&#65292;&#20248;&#21270;&#20272;&#35745;&#31934;&#24230;&#12290;</title><link>https://arxiv.org/abs/2402.16693</link><description>&lt;p&gt;
&#20855;&#26377;&#36873;&#25321;&#30340;&#20998;&#20301;&#25968;&#22238;&#24402;&#30340;&#24555;&#36895;&#31639;&#27861;
&lt;/p&gt;
&lt;p&gt;
Fast Algorithms for Quantile Regression with Selection
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.16693
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#38024;&#23545;&#20855;&#26377;&#36873;&#25321;&#24615;&#30340;&#20998;&#20301;&#25968;&#22238;&#24402;&#65288;QRS&#65289;&#20272;&#35745;&#30340;&#31616;&#21270;&#31639;&#27861;&#65292;&#36890;&#36807;&#39044;&#22788;&#29702;&#25216;&#26415;&#21644;&#20998;&#20301;&#26684;&#32593;&#20943;&#23569;&#35745;&#31639;&#26102;&#38388;&#65292;&#20248;&#21270;&#20272;&#35745;&#31934;&#24230;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#35299;&#20915;&#20102;&#20272;&#35745;&#20855;&#26377;&#36873;&#25321;&#24615;&#30340;&#20998;&#20301;&#25968;&#22238;&#24402;&#65288;QRS&#65289;&#20013;&#30340;&#35745;&#31639;&#25361;&#25112;&#12290;&#27169;&#22411;&#33258;&#36873;&#25321;&#30340;&#21442;&#25968;&#20272;&#35745;&#38656;&#35201;&#22810;&#27425;&#20272;&#35745;&#25972;&#20010;&#20998;&#20301;&#25968;&#36807;&#31243;&#12290;&#27492;&#22806;&#65292;&#28176;&#36817;&#26041;&#24046;&#30340;&#38381;&#21512;&#24418;&#24335;&#34920;&#36798;&#36807;&#20110;&#32321;&#29712;&#65292;&#20351;&#24471;&#20351;&#29992;&#33258;&#20030;&#27861;&#26356;&#26041;&#20415;&#36827;&#34892;&#25512;&#26029;&#12290;&#21033;&#29992;&#20998;&#20301;&#25968;&#22238;&#24402;&#20272;&#35745;&#30340;&#26368;&#26032;&#36827;&#23637;&#65292;&#20197;&#21450;QRS&#20272;&#35745;&#38382;&#39064;&#30340;&#19968;&#20123;&#29305;&#23450;&#29305;&#24449;&#65292;&#25105;&#25552;&#20986;&#20102;&#29992;&#20110;QRS&#20272;&#35745;&#22120;&#30340;&#31616;&#21270;&#31639;&#27861;&#12290;&#36825;&#20123;&#31639;&#27861;&#36890;&#36807;&#39044;&#22788;&#29702;&#25216;&#26415;&#21644;&#20943;&#23569;&#20998;&#20301;&#26684;&#32593;&#26469;&#26174;&#30528;&#20943;&#23569;&#35745;&#31639;&#26102;&#38388;&#65292;&#29992;&#20110;&#20272;&#35745;&#32852;&#21512;&#20998;&#24067;&#21644;&#26012;&#29575;&#21442;&#25968;&#12290;&#25105;&#23637;&#31034;&#20102;&#19968;&#20123;&#27169;&#25311;&#20013;&#30340;&#20248;&#21270;&#22686;&#24378;&#12290;&#26368;&#21518;&#65292;&#25105;&#23637;&#31034;&#20102;&#39044;&#22788;&#29702;&#26041;&#27861;&#22914;&#20309;&#25552;&#39640;&#20272;&#35745;&#30340;&#31934;&#24230;&#32780;&#19981;&#29306;&#29298;&#35745;&#31639;&#25928;&#29575;&#12290;&#22240;&#27492;&#65292;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.16693v1 Announce Type: new  Abstract: This paper addresses computational challenges in estimating Quantile Regression with Selection (QRS). The estimation of the parameters that model self-selection requires the estimation of the entire quantile process several times. Moreover, closed-form expressions of the asymptotic variance are too cumbersome, making the bootstrap more convenient to perform inference. Taking advantage of recent advancements in the estimation of quantile regression, along with some specific characteristics of the QRS estimation problem, I propose streamlined algorithms for the QRS estimator. These algorithms significantly reduce computation time through preprocessing techniques and quantile grid reduction for the estimation of the copula and slope parameters. I show the optimization enhancements with some simulations. Lastly, I show how preprocessing methods can improve the precision of the estimates without sacrificing computational efficiency. Hence, th
&lt;/p&gt;</description></item><item><title>&#35813;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#26041;&#27861;&#65292;&#22312;&#20272;&#35745;&#33258;&#22238;&#24402;&#27169;&#22411;&#26102;&#24341;&#20837;&#28508;&#22312;&#38750;&#24179;&#31283;&#22238;&#24402;&#21464;&#37327;&#30340;&#26435;&#37325;&#65292;&#33719;&#24471;&#20102;&#29702;&#35770;&#21644;&#23454;&#35777;&#32467;&#26524;&#26174;&#31034;&#36825;&#31181;&#26041;&#27861;&#22312;&#26816;&#27979;&#24179;&#31283;&#24615;&#26041;&#38754;&#30340;&#20248;&#21183;&#12290;</title><link>https://arxiv.org/abs/2402.16580</link><description>&lt;p&gt;
&#20351;&#29992;&#33258;&#36866;&#24212;Lasso&#36873;&#25321;&#24179;&#31283;&#21644;&#38750;&#24179;&#31283;&#33258;&#22238;&#24402;&#27169;&#22411;&#30340;&#20449;&#24687;&#22686;&#24378;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Information-Enriched Selection of Stationary and Non-Stationary Autoregressions using the Adaptive Lasso
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.16580
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#26041;&#27861;&#65292;&#22312;&#20272;&#35745;&#33258;&#22238;&#24402;&#27169;&#22411;&#26102;&#24341;&#20837;&#28508;&#22312;&#38750;&#24179;&#31283;&#22238;&#24402;&#21464;&#37327;&#30340;&#26435;&#37325;&#65292;&#33719;&#24471;&#20102;&#29702;&#35770;&#21644;&#23454;&#35777;&#32467;&#26524;&#26174;&#31034;&#36825;&#31181;&#26041;&#27861;&#22312;&#26816;&#27979;&#24179;&#31283;&#24615;&#26041;&#38754;&#30340;&#20248;&#21183;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#26041;&#27861;&#65292;&#36890;&#36807;&#20351;&#29992;&#33258;&#36866;&#24212;Lasso&#65292;&#22312;&#19968;&#33268;&#21644;&#22885;&#25289;&#20811;&#23572;&#25928;&#29575;&#20272;&#35745;&#33258;&#22238;&#24402;&#27169;&#22411;&#26102;&#24341;&#20837;&#19968;&#20010;&#28508;&#22312;&#38750;&#24179;&#31283;&#22238;&#24402;&#21464;&#37327;&#30340;&#26435;&#37325;&#12290;&#22686;&#24378;&#30340;&#26435;&#37325;&#24314;&#31435;&#22312;&#19968;&#20010;&#32479;&#35745;&#37327;&#19978;&#65292;&#35813;&#32479;&#35745;&#37327;&#21033;&#29992;OLS&#20272;&#35745;&#22120;&#22312;&#26102;&#38388;&#24207;&#21015;&#22238;&#24402;&#20013;&#30340;&#27010;&#29575;&#39034;&#24207;&#19981;&#21516;&#30340;&#29305;&#28857;&#65292;&#24403;&#31215;&#20998;&#31243;&#24230;&#19981;&#21516;&#26102;&#12290;&#25105;&#20204;&#22312;&#36873;&#25321;$\ell_1$&#24809;&#32602;&#21442;&#25968;&#26102;&#25552;&#20379;&#20102;&#29702;&#35770;&#32467;&#26524;&#65292;&#35777;&#26126;&#20102;&#25105;&#20204;&#30340;&#26041;&#27861;&#22312;&#26816;&#27979;&#24179;&#31283;&#24615;&#26041;&#38754;&#30340;&#20248;&#21183;&#12290;&#33945;&#29305;&#21345;&#27931;&#35777;&#25454;&#34920;&#26126;&#65292;&#25105;&#20204;&#30340;&#25552;&#35758;&#20248;&#20110;&#20351;&#29992;OLS&#22522;&#30784;&#26435;&#37325;&#65292;&#27491;&#22914;Kock&#24314;&#35758;&#30340;&#37027;&#26679;&#12290;&#25105;&#20204;&#23558;&#20462;&#25913;&#21518;&#30340;&#20272;&#35745;&#22120;&#24212;&#29992;&#20110;&#27431;&#20803;&#25512;&#20986;&#21518;&#24503;&#22269;&#36890;&#36135;&#33192;&#32960;&#29575;&#30340;&#27169;&#22411;&#36873;&#25321;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;&#33021;&#28304;&#21830;&#21697;&#20215;&#26684;&#36890;&#36135;&#33192;&#32960;&#21644;&#25972;&#20307;&#36890;&#36135;&#33192;&#32960;&#26368;&#22909;&#30001;&#24179;&#31283;&#33258;&#22238;&#24402;&#27169;&#22411;&#25551;&#36848;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.16580v1 Announce Type: cross  Abstract: We propose a novel approach to elicit the weight of a potentially non-stationary regressor in the consistent and oracle-efficient estimation of autoregressive models using the adaptive Lasso. The enhanced weight builds on a statistic that exploits distinct orders in probability of the OLS estimator in time series regressions when the degree of integration differs. We provide theoretical results on the benefit of our approach for detecting stationarity when a tuning criterion selects the $\ell_1$ penalty parameter. Monte Carlo evidence shows that our proposal is superior to using OLS-based weights, as suggested by Kock [Econom. Theory, 32, 2016, 243-259]. We apply the modified estimator to model selection for German inflation rates after the introduction of the Euro. The results indicate that energy commodity price inflation and headline inflation are best described by stationary autoregressions.
&lt;/p&gt;</description></item><item><title>&#35813;&#30740;&#31350;&#25506;&#35752;&#20102;&#22312;&#37325;&#22797;&#30456;&#21516;&#20915;&#31574;&#36807;&#31243;&#20013;&#65292;&#21442;&#19982;&#32773;&#26159;&#21542;&#20250;&#26356;&#20542;&#21521;&#20110;&#36981;&#24490;&#24207;&#25968;&#21644;&#26399;&#26395;&#25928;&#29992;&#29702;&#35770;&#30340;&#39044;&#27979;&#34892;&#20026;&#65292;&#24182;&#21457;&#29616;&#22312;&#26368;&#21518;&#19968;&#32452;&#20915;&#31574;&#20013;&#26377;&#26356;&#22810;&#20010;&#20307;&#34920;&#29616;&#20026;&#24207;&#25968;&#21644;&#26399;&#26395;&#25928;&#29992;&#26368;&#22823;&#21270;&#32773;&#12290;</title><link>https://arxiv.org/abs/2402.16538</link><description>&lt;p&gt;
&#23398;&#20064;&#26368;&#22823;&#21270;&#65288;&#39044;&#26399;&#65289;&#25928;&#29992;
&lt;/p&gt;
&lt;p&gt;
Learning to Maximize (Expected) Utility
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.16538
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#25506;&#35752;&#20102;&#22312;&#37325;&#22797;&#30456;&#21516;&#20915;&#31574;&#36807;&#31243;&#20013;&#65292;&#21442;&#19982;&#32773;&#26159;&#21542;&#20250;&#26356;&#20542;&#21521;&#20110;&#36981;&#24490;&#24207;&#25968;&#21644;&#26399;&#26395;&#25928;&#29992;&#29702;&#35770;&#30340;&#39044;&#27979;&#34892;&#20026;&#65292;&#24182;&#21457;&#29616;&#22312;&#26368;&#21518;&#19968;&#32452;&#20915;&#31574;&#20013;&#26377;&#26356;&#22810;&#20010;&#20307;&#34920;&#29616;&#20026;&#24207;&#25968;&#21644;&#26399;&#26395;&#25928;&#29992;&#26368;&#22823;&#21270;&#32773;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#22312;&#36873;&#25321;&#23454;&#39564;&#20013;&#65292;&#21442;&#19982;&#32773;&#26159;&#21542;&#20250;&#22312;&#37325;&#22797;&#20174;&#30456;&#21516;&#33756;&#21333;&#20013;&#20570;&#20986;&#20915;&#31574;&#19988;&#27809;&#26377;&#25509;&#25910;&#20219;&#20309;&#21453;&#39304;&#30340;&#24773;&#20917;&#19979;&#65292;&#23398;&#20250;&#34920;&#29616;&#20986;&#19982;&#24207;&#25968;&#21644;&#26399;&#26395;&#25928;&#29992;&#29702;&#35770;&#39044;&#27979;&#26356;&#21152;&#25509;&#36817;&#30340;&#34892;&#20026;&#12290;&#25105;&#20204;&#35774;&#35745;&#24182;&#23454;&#26045;&#20102;&#19968;&#39033;&#38750;&#24378;&#21046;&#36873;&#25321;&#30340;&#23454;&#39564;&#23460;&#23454;&#39564;&#65292;&#20351;&#29992;&#20102;&#37329;&#38065;&#24425;&#31080;&#65292;&#24182;&#27599;&#20010;&#33756;&#21333;&#37325;&#22797;&#20116;&#27425;&#65292;&#26088;&#22312;&#20174;&#22810;&#20010;&#34892;&#20026;&#35282;&#24230;&#27979;&#35797;&#36825;&#19968;&#20551;&#35774;&#12290;&#22312;&#25105;&#20204;&#20174;&#33521;&#22269;&#21644;&#24503;&#22269;&#30340;308&#21517;&#21463;&#35797;&#32773;&#20013;&#30340;&#25968;&#25454;&#20013;&#65292;&#26174;&#33879;&#26356;&#22810;&#30340;&#20010;&#20307;&#22312;&#20182;&#20204;&#26368;&#21518;15&#20010;&#30456;&#21516;&#20915;&#31574;&#38382;&#39064;&#20013;&#26159;&#24207;&#25968;&#25928;&#29992;&#21644;&#26399;&#26395;&#25928;&#29992;&#30340;&#26368;&#22823;&#21270;&#32773;&#65292;&#32780;&#19981;&#26159;&#22312;&#31532;&#19968;&#20010;15&#20010;&#20013;&#12290;&#27492;&#22806;&#65292;&#22823;&#32422;&#22235;&#20998;&#20043;&#19968;&#21644;&#20116;&#20998;&#20043;&#19968;&#30340;&#25152;&#26377;&#21463;&#35797;&#32773;&#65292;&#22312;&#23454;&#39564;&#20013;&#37117;&#20197;&#36825;&#20123;&#27169;&#24335;&#20570;&#20915;&#31574;&#65292;&#20960;&#20046;&#19968;&#21322;&#26174;&#31034;&#20986;&#38750;&#24179;&#20961;&#30340;&#19981;&#21516;&#12290;&#22312;&#37027;&#20123;&#22987;&#32456;&#29702;&#24615;&#30340;&#20010;&#20307;&#19982;&#28385;&#36275;&#38543;&#26426;&#25928;&#29992;&#29702;&#35770;&#26680;&#24515;&#21407;&#21017;&#30340;&#20010;&#20307;&#20043;&#38388;&#23384;&#22312;&#26126;&#26174;&#30340;&#37325;&#21472;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.16538v1 Announce Type: new  Abstract: We study if participants in a choice experiment learn to behave in ways that are closer to the predictions of ordinal and expected utility theory as they make decisions from the same menus repeatedly and without receiving feedback of any kind. We designed and implemented a non-forced-choice lab experiment with money lotteries and five repetitions per menu that aimed to test this hypothesis from many behavioural angles. In our data from 308 subjects in the UK and Germany, significantly more individuals were ordinal- and expected-utility maximizers in their last 15 than in their first 15 identical decision problems. Furthermore, around a quarter and a fifth of all subjects, respectively, decided in those modes throughout the experiment, with nearly half revealing non-trivial indifferences. A considerable overlap was found between those consistently rational individuals and the ones who satisfied core principles of random utility theory. Fi
&lt;/p&gt;</description></item><item><title>&#35813;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#20010;&#31454;&#20105;&#20135;&#19994;&#30340;&#38745;&#24577;&#22343;&#34913;&#27169;&#22411;&#65292;&#36890;&#36807;&#20869;&#29983;&#30830;&#23450;&#30899;&#20215;&#26684;&#20197;&#23454;&#29616;&#29305;&#23450;&#25490;&#25918;&#30446;&#26631;&#65292;&#25506;&#35752;&#20102;&#30899;&#20215;&#26684;&#23545;&#27745;&#26579;&#20225;&#19994;&#30340;&#24433;&#21709;&#65292;&#24182;&#36890;&#36807;&#24067;&#26391;&#25216;&#26415;&#20914;&#20987;&#30340;&#26696;&#20363;&#30740;&#31350;&#35752;&#35770;&#20102;&#27169;&#22411;&#30340;&#19968;&#20123;&#24433;&#21709;&#12290;</title><link>https://arxiv.org/abs/2402.16401</link><description>&lt;p&gt;
&#19968;&#20010;&#20855;&#26377;&#20869;&#29983;&#30899;&#20215;&#26684;&#30340;&#32511;&#33394;&#25216;&#26415;&#37319;&#32435;&#38745;&#24577;&#22343;&#34913;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
A Stationary Equilibrium Model of Green Technology Adoption with Endogenous Carbon Price
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.16401
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#20010;&#31454;&#20105;&#20135;&#19994;&#30340;&#38745;&#24577;&#22343;&#34913;&#27169;&#22411;&#65292;&#36890;&#36807;&#20869;&#29983;&#30830;&#23450;&#30899;&#20215;&#26684;&#20197;&#23454;&#29616;&#29305;&#23450;&#25490;&#25918;&#30446;&#26631;&#65292;&#25506;&#35752;&#20102;&#30899;&#20215;&#26684;&#23545;&#27745;&#26579;&#20225;&#19994;&#30340;&#24433;&#21709;&#65292;&#24182;&#36890;&#36807;&#24067;&#26391;&#25216;&#26415;&#20914;&#20987;&#30340;&#26696;&#20363;&#30740;&#31350;&#35752;&#35770;&#20102;&#27169;&#22411;&#30340;&#19968;&#20123;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#24182;&#20998;&#26512;&#20102;&#19968;&#20010;&#31454;&#20105;&#20135;&#19994;&#30340;&#38745;&#24577;&#22343;&#34913;&#27169;&#22411;&#65292;&#35813;&#27169;&#22411;&#20869;&#29983;&#30830;&#23450;&#20102;&#23454;&#29616;&#32473;&#23450;&#25490;&#25918;&#30446;&#26631;&#25152;&#38656;&#30340;&#30899;&#20215;&#26684;&#12290;&#22312;&#27169;&#22411;&#20013;&#65292;&#20225;&#19994;&#26681;&#25454;&#20854;&#25216;&#26415;&#27700;&#24179;&#36827;&#34892;&#35782;&#21035;&#65292;&#24182;&#20570;&#20986;&#29983;&#20135;&#12289;&#36827;&#20837;&#21644;&#20943;&#25490;&#20915;&#31574;&#12290;&#27745;&#26579;&#20225;&#19994;&#38656;&#25903;&#20184;&#30899;&#20215;&#26684;&#65292;&#20943;&#25490;&#34987;&#26500;&#24314;&#20026;&#19968;&#39033;&#19981;&#21487;&#36870;&#25237;&#36164;&#65292;&#20854;&#20013;&#21253;&#25324;&#22266;&#23450;&#25104;&#26412;&#65292;&#24182;&#23548;&#33268;&#20225;&#19994;&#36716;&#21521;&#30899;&#20013;&#24615;&#25216;&#26415;&#12290;&#22312;&#22343;&#34913;&#29366;&#24577;&#19979;&#65292;&#25105;&#20204;&#30830;&#23450;&#20102;&#19968;&#20010;&#30899;&#20215;&#26684;&#21644;&#29616;&#26377;&#27745;&#26579;&#20225;&#19994;&#30340;&#38745;&#24577;&#20998;&#24067;&#65292;&#20197;&#30830;&#20445;&#31526;&#21512;&#29305;&#23450;&#30340;&#25490;&#25918;&#30446;&#26631;&#12290;&#25105;&#20204;&#30340;&#19968;&#33324;&#29702;&#35770;&#26694;&#26550;&#19982;&#24067;&#26391;&#25216;&#26415;&#20914;&#20987;&#30340;&#26696;&#20363;&#30740;&#31350;&#30456;&#20114;&#34917;&#20805;&#65292;&#20854;&#20013;&#25105;&#20204;&#35752;&#35770;&#20102;&#27169;&#22411;&#30340;&#19968;&#20123;&#24433;&#21709;&#12290;&#25105;&#20204;&#35266;&#23519;&#21040;&#65292;&#30899;&#23450;&#20215;&#31995;&#32479;&#36830;&#21516;&#23433;&#35013;&#34917;&#36148;&#21644;&#23545;&#32511;&#33394;&#20225;&#19994;&#30340;&#31246;&#25910;&#20248;&#24800;&#21487;&#20197;&#20419;&#36827;&#36739;&#26089;&#30340;&#25237;&#36164;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.16401v1 Announce Type: cross  Abstract: This paper proposes and analyzes a stationary equilibrium model for a competitive industry which endogenously determines the carbon price necessary to achieve a given emission target. In the model, firms are identified by their level of technology and make production, entry, and abatement decisions. Polluting firms are subject to a carbon price and abatement is formulated as an irreversible investment, which entails a sunk cost and results in the firms switching to a carbon neutral technology. In equilibrium, we identify a carbon price and a stationary distribution of incumbent, polluting firms, that guarantee the compliance with a certain emission target. Our general theoretical framework is complemented with a case study with Brownian technology shocks, in which we discuss some implications of our model. We observe that a carbon pricing system alongside installation subsidies and tax benefits for green firms trigger earlier investmen
&lt;/p&gt;</description></item><item><title>&#32771;&#34385;&#21327;&#21464;&#37327;&#30340;&#24773;&#20917;&#19979;&#25552;&#20986;&#20102;&#19968;&#20010;&#21487;&#35745;&#31639;&#30340;&#20004;&#27493;&#36807;&#31243;&#26469;&#20272;&#35745;&#38543;&#26426;&#22359;&#27169;&#22411;&#20013;&#30340;&#26465;&#20214;&#36793;&#32536;&#27010;&#29575;&#21644;&#31038;&#21306;&#20998;&#37197;&#27010;&#29575;&#65292;&#24182;&#30740;&#31350;&#20102;&#36825;&#20123;&#20272;&#35745;&#37327;&#30340;&#32479;&#35745;&#29305;&#24615;</title><link>https://arxiv.org/abs/2402.16322</link><description>&lt;p&gt;
&#22312;&#32771;&#34385;&#21327;&#21464;&#37327;&#30340;&#24773;&#20917;&#19979;&#20272;&#35745;&#38543;&#26426;&#22359;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
Estimating Stochastic Block Models in the Presence of Covariates
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.16322
&lt;/p&gt;
&lt;p&gt;
&#32771;&#34385;&#21327;&#21464;&#37327;&#30340;&#24773;&#20917;&#19979;&#25552;&#20986;&#20102;&#19968;&#20010;&#21487;&#35745;&#31639;&#30340;&#20004;&#27493;&#36807;&#31243;&#26469;&#20272;&#35745;&#38543;&#26426;&#22359;&#27169;&#22411;&#20013;&#30340;&#26465;&#20214;&#36793;&#32536;&#27010;&#29575;&#21644;&#31038;&#21306;&#20998;&#37197;&#27010;&#29575;&#65292;&#24182;&#30740;&#31350;&#20102;&#36825;&#20123;&#20272;&#35745;&#37327;&#30340;&#32479;&#35745;&#29305;&#24615;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#32593;&#32476;&#30340;&#26631;&#20934;&#38543;&#26426;&#22359;&#27169;&#22411;&#20013;&#65292;&#20004;&#20010;&#33410;&#28857;&#20043;&#38388;&#30340;&#36830;&#25509;&#27010;&#29575;&#65288;&#36890;&#24120;&#31216;&#20026;&#36793;&#32536;&#27010;&#29575;&#65289;&#21462;&#20915;&#20110;&#36825;&#20123;&#33410;&#28857;&#25152;&#23646;&#30340;&#26410;&#35266;&#23519;&#21040;&#30340;&#31038;&#21306;&#12290;&#25105;&#20204;&#32771;&#34385;&#20102;&#19968;&#20010;&#28789;&#27963;&#30340;&#26694;&#26550;&#65292;&#20854;&#20013;&#27599;&#20010;&#36793;&#32536;&#27010;&#29575;&#20197;&#21450;&#31038;&#21306;&#20998;&#37197;&#27010;&#29575;&#36824;&#21463;&#21040;&#35266;&#27979;&#21040;&#30340;&#21327;&#21464;&#37327;&#30340;&#24433;&#21709;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#21487;&#35745;&#31639;&#30340;&#20004;&#27493;&#36807;&#31243;&#65292;&#29992;&#20110;&#20272;&#35745;&#26465;&#20214;&#36793;&#32536;&#27010;&#29575;&#20197;&#21450;&#31038;&#21306;&#20998;&#37197;&#27010;&#29575;&#12290;&#31532;&#19968;&#27493;&#20381;&#36182;&#20110;&#24212;&#29992;&#20110;&#32593;&#32476;&#30340;&#23616;&#37096;&#37051;&#25509;&#30697;&#38453;&#30340;&#35889;&#32858;&#31867;&#31639;&#27861;&#12290;&#22312;&#31532;&#20108;&#27493;&#20013;&#65292;&#23545;&#25552;&#21462;&#30340;&#31038;&#21306;&#36827;&#34892;k&#26368;&#36817;&#37051;&#22238;&#24402;&#20272;&#35745;&#12290;&#25105;&#20204;&#36890;&#36807;&#25552;&#20379;&#38750;&#28176;&#36817;&#30028;&#38480;&#26469;&#30740;&#31350;&#36825;&#20123;&#20272;&#35745;&#37327;&#30340;&#32479;&#35745;&#29305;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.16322v1 Announce Type: new  Abstract: In the standard stochastic block model for networks, the probability of a connection between two nodes, often referred to as the edge probability, depends on the unobserved communities each of these nodes belongs to. We consider a flexible framework in which each edge probability, together with the probability of community assignment, are also impacted by observed covariates. We propose a computationally tractable two-step procedure to estimate the conditional edge probabilities as well as the community assignment probabilities. The first step relies on a spectral clustering algorithm applied to a localized adjacency matrix of the network. In the second step, k-nearest neighbor regression estimates are computed on the extracted communities. We study the statistical properties of these estimators by providing non-asymptotic bounds.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;&#38598;&#20307;&#35780;&#20272;&#20989;&#25968;&#30340;&#23646;&#24615;&#65292;&#24182;&#30830;&#23450;&#20102;&#30830;&#20445;&#28385;&#36275;&#22235;&#31181;&#19981;&#21516;&#32452;&#21512;&#23646;&#24615;&#30340;&#38598;&#20307;&#35780;&#20272;&#20989;&#25968;&#23384;&#22312;&#30340;&#35780;&#20272;&#33021;&#21147;&#37197;&#32622;&#25991;&#20214;&#30340;&#24517;&#35201;&#21644;&#20805;&#20998;&#26465;&#20214;&#12290;</title><link>https://arxiv.org/abs/2402.16309</link><description>&lt;p&gt;
&#38598;&#20307;&#35780;&#20272;&#38382;&#39064;
&lt;/p&gt;
&lt;p&gt;
Collective Evaluation Problem
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.16309
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;&#38598;&#20307;&#35780;&#20272;&#20989;&#25968;&#30340;&#23646;&#24615;&#65292;&#24182;&#30830;&#23450;&#20102;&#30830;&#20445;&#28385;&#36275;&#22235;&#31181;&#19981;&#21516;&#32452;&#21512;&#23646;&#24615;&#30340;&#38598;&#20307;&#35780;&#20272;&#20989;&#25968;&#23384;&#22312;&#30340;&#35780;&#20272;&#33021;&#21147;&#37197;&#32622;&#25991;&#20214;&#30340;&#24517;&#35201;&#21644;&#20805;&#20998;&#26465;&#20214;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#30740;&#31350;&#32858;&#28966;&#20110;&#36890;&#36807;&#25910;&#38598;&#26469;&#33258;&#22810;&#20010;&#20010;&#20307;&#30340;&#35780;&#20272;&#26469;&#35780;&#20272;&#26377;&#38480;&#30340;&#26367;&#20195;&#26041;&#26696;&#30340;&#24773;&#20917;&#65292;&#20854;&#20013;&#19968;&#20123;&#20010;&#20307;&#21487;&#33021;&#19981;&#35780;&#20272;&#29305;&#23450;&#30340;&#26367;&#20195;&#26041;&#26696;&#12290;&#20010;&#20307;&#65288;&#21487;&#65289;&#35780;&#20272;&#30340;&#26367;&#20195;&#26041;&#26696;&#23376;&#38598;&#30340;&#38598;&#21512;&#34987;&#31216;&#20026;&#35780;&#20272;&#33021;&#21147;&#37197;&#32622;&#25991;&#20214;&#12290;&#38024;&#23545;&#32473;&#23450;&#30340;&#35780;&#20272;&#33021;&#21147;&#37197;&#32622;&#25991;&#20214;&#65292;&#25105;&#20204;&#23450;&#20041;&#20102;&#19968;&#20010;&#38598;&#20307;&#35780;&#20272;&#20989;&#25968;&#65292;&#20854;&#36755;&#20837;&#26159;&#20010;&#20307;&#23545;&#20182;&#20204;&#35780;&#20272;&#30340;&#26367;&#20195;&#26041;&#26696;&#23376;&#38598;&#30340;&#35780;&#20272;&#39034;&#24207;&#12290;&#25105;&#20204;&#30740;&#31350;&#20102;&#38598;&#20307;&#35780;&#20272;&#20989;&#25968;&#30340;&#29305;&#24615;&#65292;&#36825;&#20123;&#29305;&#24615;&#26159;&#23545;&#20808;&#21069;&#30740;&#31350;&#20013;&#24341;&#20837;&#30340;&#29305;&#24615;&#30340;&#20462;&#25913;&#12290;&#25105;&#20204;&#30830;&#23450;&#20102;&#20851;&#20110;&#35780;&#20272;&#33021;&#21147;&#37197;&#32622;&#25991;&#20214;&#30340;&#20805;&#20998;&#24517;&#35201;&#26465;&#20214;&#65292;&#20197;&#30830;&#20445;&#23384;&#22312;&#28385;&#36275;&#36825;&#20123;&#29305;&#24615;&#20013;&#22235;&#31181;&#19981;&#21516;&#32452;&#21512;&#30340;&#38598;&#20307;&#35780;&#20272;&#20989;&#25968;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.16309v1 Announce Type: new  Abstract: This study focuses on situations where a finite set of alternatives is evaluated by collecting evaluations from several individuals, some of whom may not evaluate specific alternatives. The collection of subsets of alternatives that individuals (can) evaluate is referred to as an evaluability profile. For a given evaluability profile, we define a collective evaluation function whose inputs are the evaluation orders of individuals on the subsets of alternatives that they evaluate. We investigate the properties of collective evaluation functions, which are modifications of those introduced in previous studies. We identify the necessary and sufficient conditions on the evaluability profile that ensure the existence of collective evaluation functions satisfying four different combinations of these properties.
&lt;/p&gt;</description></item><item><title>&#36890;&#36807;&#25972;&#21512;&#23884;&#20837;&#24335;&#25216;&#26415;&#21644;&#34433;&#32676;&#31639;&#27861;&#65292;&#26412;&#30740;&#31350;&#24320;&#21457;&#20102;&#19968;&#20010;&#20808;&#36827;&#30340;&#29289;&#27969;&#36319;&#36394;&#31995;&#32479;&#65292;&#20197;&#20248;&#21270;&#29289;&#27969;&#21253;&#35065;&#20998;&#21457;&#36335;&#32447;&#65292;&#26174;&#33879;&#25913;&#36827;&#20102;&#24179;&#22343;&#20132;&#36135;&#26102;&#38388;&#12290;</title><link>https://arxiv.org/abs/2402.15965</link><description>&lt;p&gt;
&#19981;&#26029;&#36827;&#21270;&#30340;&#30005;&#23376;&#21830;&#21153;&#29289;&#27969;&#35268;&#21010; - &#25972;&#21512;&#23884;&#20837;&#24335;&#25216;&#26415;&#21644;&#34433;&#32676;&#31639;&#27861;&#20197;&#25552;&#39640;&#25928;&#29575;
&lt;/p&gt;
&lt;p&gt;
Evolving E-commerce Logistics Planning- Integrating Embedded Technology and Ant Colony Algorithm for Enhanced Efficiency
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.15965
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#25972;&#21512;&#23884;&#20837;&#24335;&#25216;&#26415;&#21644;&#34433;&#32676;&#31639;&#27861;&#65292;&#26412;&#30740;&#31350;&#24320;&#21457;&#20102;&#19968;&#20010;&#20808;&#36827;&#30340;&#29289;&#27969;&#36319;&#36394;&#31995;&#32479;&#65292;&#20197;&#20248;&#21270;&#29289;&#27969;&#21253;&#35065;&#20998;&#21457;&#36335;&#32447;&#65292;&#26174;&#33879;&#25913;&#36827;&#20102;&#24179;&#22343;&#20132;&#36135;&#26102;&#38388;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#32593;&#32476;&#26102;&#20195;&#30340;&#32972;&#26223;&#19979;&#65292;&#30005;&#23376;&#21830;&#21153;&#34892;&#19994;&#32463;&#21382;&#20102;&#26174;&#33879;&#25193;&#24352;&#65292;&#29305;&#21035;&#26159;&#36817;&#24180;&#26469;&#36328;&#22659;&#30005;&#23376;&#21830;&#21153;&#65288;CBEC&#65289;&#30340;&#20986;&#29616;&#12290;&#36825;&#31181;&#22686;&#38271;&#36235;&#21183;&#25345;&#32493;&#23384;&#22312;&#65292;&#38656;&#35201;&#20581;&#22766;&#30340;&#29289;&#27969;&#26694;&#26550;&#26469;&#21487;&#25345;&#32493;&#25903;&#25345;&#36816;&#33829;&#12290;&#28982;&#32780;&#65292;&#24403;&#21069;&#30340;&#30005;&#23376;&#21830;&#21153;&#29289;&#27969;&#33539;&#24335;&#38754;&#20020;&#30528;&#28385;&#36275;&#19981;&#26029;&#21457;&#23637;&#30340;&#29992;&#25143;&#38656;&#27714;&#30340;&#25361;&#25112;&#65292;&#20419;&#20351;&#20154;&#20204;&#23547;&#27714;&#21019;&#26032;&#35299;&#20915;&#26041;&#26696;&#12290;&#26412;&#30740;&#31350;&#36890;&#36807;&#23545;CBEC&#29289;&#27969;&#27169;&#22411;&#36827;&#34892;&#20840;&#38754;&#20998;&#26512;&#65292;&#24182;&#23558;&#23884;&#20837;&#24335;&#25216;&#26415;&#25972;&#21512;&#21040;&#29289;&#27969;&#26694;&#26550;&#20013;&#65292;&#24320;&#21457;&#20102;&#19968;&#20010;&#39640;&#32423;&#29289;&#27969;&#36319;&#36394;&#31995;&#32479;&#65292;&#20197;&#35299;&#20915;&#36825;&#20123;&#22797;&#26434;&#24615;&#12290;&#27492;&#22806;&#65292;&#37319;&#29992;&#34433;&#32676;&#31639;&#27861;&#65292;&#30740;&#31350;&#23545;&#29289;&#27969;&#21253;&#35065;&#20998;&#21457;&#36335;&#32447;&#36827;&#34892;&#20248;&#21270;&#35268;&#21010;&#23454;&#39564;&#12290;&#22312;&#20851;&#38190;&#25351;&#26631;&#22914;&#24179;&#22343;&#20132;&#36135;&#26102;&#38388;&#26041;&#38754;&#35266;&#23519;&#21040;&#20102;&#26174;&#33879;&#30340;&#25913;&#36827;&#65292;&#34920;&#26126;&#20102;&#36825;&#31181;&#26041;&#27861;&#30340;&#25928;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.15965v1 Announce Type: new  Abstract: Amidst the era of networking, the e-commerce sector has undergone notable expansion, notably with the advent of Cross-border E-commerce (CBEC) in recent times. This growth trend persists, necessitating robust logistical frameworks to sustainably support operations. However, the current e-commerce logistics paradigm faces challenges in meeting evolving user demands, prompting a quest for innovative solutions. This research endeavors to address these complexities by undertaking a comprehensive analysis of CBEC logistics models and integrating embedded technology into logistical frameworks, resulting in the development of an advanced logistics tracking system. Moreover, employing the ant colony algorithm, the study conducts experimental investigations into optimizing logistics package distribution route planning. Noteworthy enhancements are observed in key metrics such as average delivery time, signaling the efficacy of this approach. In es
&lt;/p&gt;</description></item><item><title>&#35770;&#25991;&#30740;&#31350;&#20102;&#20855;&#26377;&#21333;&#23792;&#20559;&#22909;&#30340;&#26368;&#20248;&#39044;&#31639;&#32858;&#21512;&#38382;&#39064;&#65292;&#24182;&#22312;&#22810;&#32500;&#27867;&#21270;&#30340;&#26143;&#24418;&#25928;&#29992;&#20989;&#25968;&#31867;&#21035;&#20013;&#25506;&#35752;&#19981;&#21516;&#27169;&#22411;&#12290;&#23545;&#20110;&#20004;&#31181;&#22791;&#36873;&#26041;&#26696;&#65292;&#35777;&#26126;&#20102;&#32479;&#19968;&#24187;&#24433;&#26426;&#21046;&#26159;&#21807;&#19968;&#28385;&#36275;&#27604;&#20363;&#24615;&#30340;&#31574;&#30053;&#35777;&#26126;&#26426;&#21046;&#12290;&#28982;&#21518;&#65292;&#23545;&#20110;&#36229;&#36807;&#20004;&#31181;&#22791;&#36873;&#26041;&#26696;&#30340;&#24773;&#20917;&#65292;&#35770;&#25991;&#34920;&#26126;&#19981;&#23384;&#22312;&#21516;&#26102;&#28385;&#36275;&#25928;&#29575;&#12289;&#31574;&#30053;&#24615;&#21644;&#27604;&#20363;&#24615;&#30340;&#26426;&#21046;&#12290;</title><link>https://arxiv.org/abs/2402.15904</link><description>&lt;p&gt;
&#20855;&#26377;&#21333;&#23792;&#20559;&#22909;&#30340;&#26368;&#20248;&#39044;&#31639;&#32858;&#21512;
&lt;/p&gt;
&lt;p&gt;
Optimal Budget Aggregation with Single-Peaked Preferences
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.15904
&lt;/p&gt;
&lt;p&gt;
&#35770;&#25991;&#30740;&#31350;&#20102;&#20855;&#26377;&#21333;&#23792;&#20559;&#22909;&#30340;&#26368;&#20248;&#39044;&#31639;&#32858;&#21512;&#38382;&#39064;&#65292;&#24182;&#22312;&#22810;&#32500;&#27867;&#21270;&#30340;&#26143;&#24418;&#25928;&#29992;&#20989;&#25968;&#31867;&#21035;&#20013;&#25506;&#35752;&#19981;&#21516;&#27169;&#22411;&#12290;&#23545;&#20110;&#20004;&#31181;&#22791;&#36873;&#26041;&#26696;&#65292;&#35777;&#26126;&#20102;&#32479;&#19968;&#24187;&#24433;&#26426;&#21046;&#26159;&#21807;&#19968;&#28385;&#36275;&#27604;&#20363;&#24615;&#30340;&#31574;&#30053;&#35777;&#26126;&#26426;&#21046;&#12290;&#28982;&#21518;&#65292;&#23545;&#20110;&#36229;&#36807;&#20004;&#31181;&#22791;&#36873;&#26041;&#26696;&#30340;&#24773;&#20917;&#65292;&#35770;&#25991;&#34920;&#26126;&#19981;&#23384;&#22312;&#21516;&#26102;&#28385;&#36275;&#25928;&#29575;&#12289;&#31574;&#30053;&#24615;&#21644;&#27604;&#20363;&#24615;&#30340;&#26426;&#21046;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#23558;&#20998;&#24067;&#65288;&#22914;&#39044;&#31639;&#25552;&#26696;&#65289;&#32858;&#21512;&#25104;&#38598;&#20307;&#20998;&#24067;&#30340;&#38382;&#39064;&#12290;&#29702;&#24819;&#30340;&#32858;&#21512;&#26426;&#21046;&#24212;&#35813;&#26159;&#24085;&#32047;&#25176;&#26377;&#25928;&#12289;&#31574;&#30053;&#35777;&#26126;&#21644;&#20844;&#24179;&#30340;&#12290;&#22823;&#22810;&#25968;&#20808;&#21069;&#30340;&#24037;&#20316;&#20551;&#35774;&#20195;&#29702;&#26681;&#25454;&#20854;&#29702;&#24819;&#39044;&#31639;&#19982;$\ell_1$&#36317;&#31163;&#26469;&#35780;&#20272;&#39044;&#31639;&#12290;&#25105;&#20204;&#30740;&#31350;&#24182;&#27604;&#36739;&#20102;&#26469;&#33258;&#26143;&#24418;&#25928;&#29992;&#20989;&#25968;&#26356;&#22823;&#31867;&#21035;&#30340;&#19981;&#21516;&#27169;&#22411;&#65292;&#36825;&#26159;&#21333;&#23792;&#20559;&#22909;&#30340;&#22810;&#32500;&#27867;&#21270;&#12290;&#23545;&#20110;&#20004;&#31181;&#22791;&#36873;&#26041;&#26696;&#30340;&#24773;&#20917;&#65292;&#25105;&#20204;&#36890;&#36807;&#35777;&#26126;&#22312;&#38750;&#24120;&#19968;&#33324;&#30340;&#20551;&#35774;&#19979;&#65292;&#32479;&#19968;&#24187;&#24433;&#26426;&#21046;&#26159;&#21807;&#19968;&#28385;&#36275;&#27604;&#20363;&#24615;&#30340;&#31574;&#30053;&#35777;&#26126;&#26426;&#21046;&#65292;&#20174;&#32780;&#25193;&#23637;&#20102;&#29616;&#26377;&#32467;&#26524;&#12290;&#23545;&#20110;&#36229;&#36807;&#20004;&#31181;&#22791;&#36873;&#26041;&#26696;&#30340;&#24773;&#20917;&#65292;&#25105;&#20204;&#23545;$\ell_1$&#21644;$\ell_\infty$&#30340;&#19981;&#28385;&#24847;&#24615;&#24314;&#31435;&#20102;&#20840;&#38754;&#30340;&#19981;&#21487;&#33021;&#24615;&#65306;&#27809;&#26377;&#26426;&#21046;&#33021;&#22815;&#21516;&#26102;&#28385;&#36275;&#25928;&#29575;&#12289;&#31574;&#30053;&#24615;&#21644;&#27604;&#20363;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.15904v1 Announce Type: new  Abstract: We study the problem of aggregating distributions, such as budget proposals, into a collective distribution. An ideal aggregation mechanism would be Pareto efficient, strategyproof, and fair. Most previous work assumes that agents evaluate budgets according to the $\ell_1$ distance to their ideal budget. We investigate and compare different models from the larger class of star-shaped utility functions - a multi-dimensional generalization of single-peaked preferences. For the case of two alternatives, we extend existing results by proving that under very general assumptions, the uniform phantom mechanism is the only strategyproof mechanism that satisfies proportionality - a minimal notion of fairness introduced by Freeman et al. (2021). Moving to the case of more than two alternatives, we establish sweeping impossibilities for $\ell_1$ and $\ell_\infty$ disutilities: no mechanism satisfies efficiency, strategyproofness, and proportionalit
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#23558;Bayesian&#32479;&#35745;&#23884;&#20837;&#21040;&#26356;&#24191;&#27867;&#30340;&#20915;&#31574;&#26694;&#26550;&#20013;&#65292;&#25552;&#20986;&#20102;&#32479;&#35745;&#28216;&#25103;&#20316;&#20026;&#32479;&#19968;&#26694;&#26550;&#65292;&#28085;&#30422;&#20102;&#39057;&#29575;&#27966;&#21644;&#36125;&#21494;&#26031;&#32479;&#35745;&#65292;&#24182;&#25552;&#20986;&#20102;&#26368;&#23567;&#21518;&#24724;&#20934;&#21017;&#20316;&#20026;&#20915;&#31574;&#30340;&#19968;&#33324;&#26041;&#27861;&#12290;</title><link>https://arxiv.org/abs/2402.15892</link><description>&lt;p&gt;
&#32479;&#35745;&#28216;&#25103;
&lt;/p&gt;
&lt;p&gt;
Statistical Games
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.15892
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#23558;Bayesian&#32479;&#35745;&#23884;&#20837;&#21040;&#26356;&#24191;&#27867;&#30340;&#20915;&#31574;&#26694;&#26550;&#20013;&#65292;&#25552;&#20986;&#20102;&#32479;&#35745;&#28216;&#25103;&#20316;&#20026;&#32479;&#19968;&#26694;&#26550;&#65292;&#28085;&#30422;&#20102;&#39057;&#29575;&#27966;&#21644;&#36125;&#21494;&#26031;&#32479;&#35745;&#65292;&#24182;&#25552;&#20986;&#20102;&#26368;&#23567;&#21518;&#24724;&#20934;&#21017;&#20316;&#20026;&#20915;&#31574;&#30340;&#19968;&#33324;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#24037;&#20316;&#23545;&#20960;&#31181;&#20856;&#22411;&#30340;&#28216;&#25103;&#36827;&#34892;&#20102;&#25968;&#23398;&#25506;&#32034;&#65292;&#20854;&#20013;&#33258;&#28982;&#28044;&#29616;&#20102;&#32479;&#35745;&#23398;&#21644;&#27010;&#29575;&#35770;&#30340;&#26680;&#24515;&#27010;&#24565;&#12290;&#36825;&#20123;&#28216;&#25103;&#21253;&#25324;&#36153;&#33293;&#23572;&#28216;&#25103;&#21644;&#36125;&#21494;&#26031;&#28216;&#25103;&#65292;&#23427;&#20204;&#20998;&#21035;&#19982;&#39057;&#29575;&#27966;&#32479;&#35745;&#23398;&#21644;&#36125;&#21494;&#26031;&#32479;&#35745;&#23398;&#30456;&#20851;&#12290;&#38543;&#21518;&#24341;&#20837;&#20102;&#19968;&#20010;&#26356;&#19968;&#33324;&#31867;&#22411;&#30340;&#28216;&#25103;&#65292;&#31216;&#20026;&#32479;&#35745;&#28216;&#25103;&#65292;&#22312;&#20854;&#20013;&#21487;&#20197;&#35774;&#32622;&#19968;&#20010;&#36827;&#19968;&#27493;&#30340;&#21442;&#25968;&#65292;&#21363;&#29609;&#23478;&#30340;&#30456;&#23545;&#39118;&#38505;&#21388;&#24694;&#12290;&#26412;&#30740;&#31350;&#34920;&#26126;&#65292;&#36153;&#33293;&#23572;&#28216;&#25103;&#21644;&#36125;&#21494;&#26031;&#28216;&#25103;&#21487;&#20197;&#34987;&#35270;&#20026;&#32479;&#35745;&#28216;&#25103;&#30340;&#26497;&#38480;&#24773;&#20917;&#12290;&#22240;&#27492;&#65292;&#32479;&#35745;&#28216;&#25103;&#21487;&#20197;&#34987;&#35270;&#20026;&#19968;&#20010;&#32479;&#19968;&#30340;&#26694;&#26550;&#65292;&#34701;&#21512;&#20102;&#39057;&#29575;&#27966;&#21644;&#36125;&#21494;&#26031;&#32479;&#35745;&#12290;&#27492;&#22806;&#65292;&#36824;&#25552;&#20986;&#20102;&#19968;&#31181;&#21746;&#23398;&#26694;&#26550;&#65292;&#36890;&#24120;&#34987;&#31216;&#20026;&#26368;&#23567;&#21518;&#24724;&#20934;&#21017;&#65292;&#20316;&#20026;&#20915;&#31574;&#30340;&#19968;&#33324;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.15892v1 Announce Type: cross  Abstract: This work contains the mathematical exploration of a few prototypical games in which central concepts from statistics and probability theory naturally emerge. The first two kinds of games are termed Fisher and Bayesian games, which are connected to Frequentist and Bayesian statistics, respectively. Later, a more general type of game is introduced, termed Statistical game, in which a further parameter, the players' relative risk aversion, can be set. In this work, we show that Fisher and Bayesian games can be viewed as limiting cases of Statistical games. Therefore, Statistical games can be viewed as a unified framework, incorporating both Frequentist and Bayesian statistics. Furthermore, a philosophical framework is (re-)presented -- often referred to as minimax regret criterion -- as a general approach to decision making.   The main motivation for this work was to embed Bayesian statistics into a broader decision-making framework, whe
&lt;/p&gt;</description></item><item><title>&#20027;&#20307;&#19982;&#22810;&#20010;&#20195;&#29702;&#30340;&#21512;&#21516;&#35774;&#35745;&#20013;&#65292;&#21152;&#26435;&#21512;&#21516;&#26159;&#26368;&#20248;&#30340;&#36873;&#25321;&#65292;&#21487;&#20197;&#36890;&#36807;&#20026;&#20195;&#29702;&#20998;&#37197;&#27491;&#26435;&#37325;&#21644;&#20248;&#20808;&#32423;&#27700;&#24179;&#26469;&#23454;&#29616;&#26368;&#22823;&#21270;&#20195;&#29702;&#30340;&#25104;&#21151;&#27010;&#29575;&#12290;</title><link>https://arxiv.org/abs/2402.15890</link><description>&lt;p&gt;
&#24102;&#39044;&#31639;&#30340;&#22810;&#20195;&#29702;&#21512;&#21516;&#35774;&#35745;&#20013;&#21152;&#26435;&#21512;&#21516;&#30340;&#26368;&#20248;&#24615;
&lt;/p&gt;
&lt;p&gt;
Optimality of weighted contracts for multi-agent contract design with a budget
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.15890
&lt;/p&gt;
&lt;p&gt;
&#20027;&#20307;&#19982;&#22810;&#20010;&#20195;&#29702;&#30340;&#21512;&#21516;&#35774;&#35745;&#20013;&#65292;&#21152;&#26435;&#21512;&#21516;&#26159;&#26368;&#20248;&#30340;&#36873;&#25321;&#65292;&#21487;&#20197;&#36890;&#36807;&#20026;&#20195;&#29702;&#20998;&#37197;&#27491;&#26435;&#37325;&#21644;&#20248;&#20808;&#32423;&#27700;&#24179;&#26469;&#23454;&#29616;&#26368;&#22823;&#21270;&#20195;&#29702;&#30340;&#25104;&#21151;&#27010;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#19968;&#20010;&#20027;&#20307;&#19982;&#22810;&#20010;&#20195;&#29702;&#20043;&#38388;&#30340;&#21512;&#21516;&#35774;&#35745;&#38382;&#39064;&#12290;&#27599;&#20010;&#20195;&#29702;&#21442;&#19982;&#19968;&#20010;&#29420;&#31435;&#20219;&#21153;&#65292;&#32467;&#26524;&#20026;&#25104;&#21151;&#25110;&#22833;&#36133;&#65292;&#20195;&#29702;&#21487;&#20197;&#20184;&#20986;&#20195;&#20215;&#21162;&#21147;&#25552;&#39640;&#25104;&#21151;&#30340;&#27010;&#29575;&#65292;&#20027;&#20307;&#26377;&#22266;&#23450;&#39044;&#31639;&#65292;&#21487;&#20197;&#20026;&#20195;&#29702;&#25552;&#20379;&#19982;&#32467;&#26524;&#30456;&#20851;&#30340;&#22870;&#21169;&#12290;&#20851;&#38190;&#26159;&#65292;&#25105;&#20204;&#20551;&#35774;&#20027;&#20307;&#21482;&#20851;&#24515;&#26368;&#22823;&#21270;&#20195;&#29702;&#30340;&#25104;&#21151;&#27010;&#29575;&#65292;&#32780;&#19981;&#20851;&#24515;&#39044;&#31639;&#30340;&#25903;&#20986;&#37327;&#12290;&#25105;&#20204;&#39318;&#20808;&#35777;&#26126;&#20102;&#23545;&#20110;&#26576;&#20123;&#30446;&#26631;&#65292;&#21512;&#21516;&#21482;&#26377;&#24403;&#23427;&#26159;&#25104;&#21151;&#19968;&#20999;&#30340;&#21512;&#21516;&#25165;&#26159;&#26368;&#20248;&#30340;&#12290;&#36825;&#20010;&#32467;&#26524;&#30340;&#19968;&#20010;&#30452;&#25509;&#25512;&#35770;&#26159;&#65292;&#22312;&#36825;&#31181;&#35774;&#23450;&#19979;&#65292;&#35745;&#20214;&#21512;&#21516;&#21644;&#22870;&#37329;&#27744;&#21512;&#21516;&#20174;&#26469;&#19981;&#26159;&#26368;&#20248;&#30340;&#12290;&#28982;&#21518;&#25105;&#20204;&#35777;&#26126;&#65292;&#23545;&#20110;&#20219;&#20309;&#30446;&#26631;&#65292;&#23384;&#22312;&#19968;&#20010;&#26368;&#20248;&#30340;&#22522;&#20110;&#20248;&#20808;&#32423;&#21152;&#26435;&#30340;&#21512;&#21516;&#65292;&#36825;&#20010;&#21512;&#21516;&#20026;&#20195;&#29702;&#20998;&#37197;&#27491;&#26435;&#37325;&#21644;&#20248;&#20808;&#32423;&#27700;&#24179;&#65292;&#24182;&#23558;&#39044;&#31639;&#20998;&#37197;&#32473;&#26368;&#39640;&#20248;&#20808;&#32423;&#30340;&#25104;&#21151;&#20195;&#29702;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.15890v1 Announce Type: new  Abstract: We study a contract design problem between a principal and multiple agents. Each agent participates in an independent task with binary outcomes (success or failure), in which it may exert costly effort towards improving its probability of success, and the principal has a fixed budget which it can use to provide outcome-dependent rewards to the agents. Crucially, we assume the principal cares only about maximizing the agents' probabilities of success, not how much of the budget it expends. We first show that a contract is optimal for some objective if and only if it is a successful-get-everything contract. An immediate consequence of this result is that piece-rate contracts and bonus-pool contracts are never optimal in this setting. We then show that for any objective, there is an optimal priority-based weighted contract, which assigns positive weights and priority levels to the agents, and splits the budget among the highest-priority suc
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#21160;&#24577;&#26426;&#21046;&#65292;&#36890;&#36807;&#26356;&#26032;&#26368;&#22823;&#21487;&#25552;&#21462;&#20215;&#20540;&#65288;MEV&#65289;&#25552;&#21462;&#29575;&#65292;&#20197;&#22312;&#30719;&#24037;&#21644;&#29992;&#25143;&#20043;&#38388;&#32500;&#25345;&#20581;&#24247;&#24179;&#34913;&#12290;</title><link>https://arxiv.org/abs/2402.15849</link><description>&lt;p&gt;
&#20851;&#20110;&#26368;&#22823;&#21487;&#25552;&#21462;&#20215;&#20540;&#20877;&#20998;&#37197;&#30340;&#21160;&#24577;&#26426;&#21046;
&lt;/p&gt;
&lt;p&gt;
On the Redistribution of Maximal Extractable Value: A Dynamic Mechanism
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.15849
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#21160;&#24577;&#26426;&#21046;&#65292;&#36890;&#36807;&#26356;&#26032;&#26368;&#22823;&#21487;&#25552;&#21462;&#20215;&#20540;&#65288;MEV&#65289;&#25552;&#21462;&#29575;&#65292;&#20197;&#22312;&#30719;&#24037;&#21644;&#29992;&#25143;&#20043;&#38388;&#32500;&#25345;&#20581;&#24247;&#24179;&#34913;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26368;&#22823;&#21487;&#25552;&#21462;&#20215;&#20540;&#65288;MEV&#65289;&#24050;&#32463;&#25104;&#20026;&#21306;&#22359;&#38142;&#31995;&#32479;&#35774;&#35745;&#39046;&#22495;&#30340;&#19968;&#20010;&#26032;&#21069;&#27839;&#12290;&#21435;&#20013;&#24515;&#21270;&#21644;&#37329;&#34701;&#30340;&#32467;&#21512;&#36171;&#20104;&#20102;&#21306;&#22359;&#29983;&#20135;&#32773;&#65288;&#21363;&#30719;&#24037;&#65289;&#19981;&#20165;&#36873;&#25321;&#21644;&#28155;&#21152;&#20132;&#26131;&#21040;&#21306;&#22359;&#38142;&#30340;&#26435;&#21147;&#65292;&#26356;&#37325;&#35201;&#30340;&#26159;&#65292;&#36824;&#21487;&#20197;&#23545;&#20854;&#36827;&#34892;&#25490;&#24207;&#65292;&#20197;&#23613;&#21487;&#33021;&#22810;&#22320;&#20174;&#20013;&#33719;&#21033;&#12290;&#34429;&#28982;&#36825;&#31181;&#20215;&#26684;&#23545;&#20110;&#21306;&#22359;&#29983;&#20135;&#32773;&#25552;&#20379;&#30340;&#26381;&#21153;&#26469;&#35828;&#21487;&#33021;&#26159;&#19981;&#21487;&#36991;&#20813;&#30340;&#65292;&#20294;&#38142;&#19978;&#29992;&#25143;&#20174;&#38271;&#36828;&#26469;&#30475;&#21487;&#33021;&#26356;&#24895;&#24847;&#20351;&#29992;&#19981;&#37027;&#20040;&#25504;&#22842;&#24615;&#30340;&#31995;&#32479;&#12290;&#26412;&#25991;&#25552;&#20986;&#23558;MEV&#25552;&#21462;&#29575;&#32435;&#20837;&#21327;&#35758;&#35774;&#35745;&#31354;&#38388;&#20013;&#12290;&#25105;&#20204;&#30340;&#30446;&#26631;&#26159;&#21033;&#29992;&#27492;&#21442;&#25968;&#26469;&#32500;&#25345;&#30719;&#24037;&#65288;&#38656;&#35201;&#24471;&#21040;&#34917;&#20607;&#65289;&#21644;&#29992;&#25143;&#65288;&#38656;&#35201;&#24863;&#21040;&#34987;&#40723;&#21169;&#36827;&#34892;&#20132;&#26131;&#65289;&#20043;&#38388;&#30340;&#20581;&#24247;&#24179;&#34913;&#12290;&#21463;EIP-1559&#24341;&#20837;&#30340;&#20132;&#26131;&#36153;&#21407;&#21017;&#30340;&#21551;&#21457;&#65292;&#25105;&#20204;&#35774;&#35745;&#20102;&#19968;&#20010;&#21160;&#24577;&#26426;&#21046;&#65292;&#26088;&#22312;&#36890;&#36807;&#26356;&#26032;MEV&#25552;&#21462;&#29575;&#26469;&#36798;&#21040;&#31283;&#23450;&#30446;&#26631;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.15849v1 Announce Type: cross  Abstract: Maximal Extractable Value (MEV) has emerged as a new frontier in the design of blockchain systems. The marriage between decentralization and finance gives the power to block producers (a.k.a., miners) not only to select and add transactions to the blockchain but, crucially, also to order them so as to extract as much financial gain as possible for themselves. Whilst this price may be unavoidable for the service provided by block producers, users of the chain may in the long run prefer to use less predatory systems. In this paper, we propose to make the MEV extraction rate part of the protocol design space. Our aim is to leverage this parameter to maintain a healthy balance between miners (who need to be compensated) and users (who need to feel encouraged to transact). Inspired by the principles introduced by EIP-1559 for transaction fees, we design a dynamic mechanism which updates the MEV extraction rate with the goal of stabilizing i
&lt;/p&gt;</description></item><item><title>&#20351;&#29992;&#25237;&#20837;&#20135;&#20986;&#34920;&#26500;&#24314;&#32593;&#32476;&#20998;&#26512;&#20102;&#20013;&#22269;&#21644;&#26085;&#26412;&#20043;&#38388;&#30340;&#37096;&#38376;&#32467;&#26500;&#24046;&#24322;&#65292;&#26174;&#31034;&#20986;&#21046;&#36896;&#19994;&#26159;&#20013;&#22269;&#30340;&#20013;&#24515;&#37096;&#38376;&#65292;&#32780;&#26085;&#26412;&#26356;&#38738;&#30544;&#26381;&#21153;&#19994;&#12290;</title><link>https://arxiv.org/abs/2402.15620</link><description>&lt;p&gt;
&#20013;&#22269;&#21644;&#26085;&#26412;&#37096;&#38376;&#32467;&#26500;&#30340;&#27604;&#36739;&#65306;&#32593;&#32476;&#35270;&#35282;
&lt;/p&gt;
&lt;p&gt;
Comparison of sectoral structures between China and Japan: A network perspective
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.15620
&lt;/p&gt;
&lt;p&gt;
&#20351;&#29992;&#25237;&#20837;&#20135;&#20986;&#34920;&#26500;&#24314;&#32593;&#32476;&#20998;&#26512;&#20102;&#20013;&#22269;&#21644;&#26085;&#26412;&#20043;&#38388;&#30340;&#37096;&#38376;&#32467;&#26500;&#24046;&#24322;&#65292;&#26174;&#31034;&#20986;&#21046;&#36896;&#19994;&#26159;&#20013;&#22269;&#30340;&#20013;&#24515;&#37096;&#38376;&#65292;&#32780;&#26085;&#26412;&#26356;&#38738;&#30544;&#26381;&#21153;&#19994;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20013;&#22269;&#21644;&#26085;&#26412;&#20043;&#38388;&#30340;&#32463;&#27982;&#32467;&#26500;&#27604;&#36739;&#38271;&#26399;&#20197;&#26469;&#19968;&#30452;&#21560;&#24341;&#30528;&#21457;&#23637;&#32463;&#27982;&#23398;&#23478;&#30340;&#20851;&#27880;&#12290;&#20026;&#20102;&#26356;&#28145;&#20837;&#22320;&#30740;&#31350;&#20004;&#22269;&#20174;1995&#24180;&#21040;2018&#24180;&#30340;&#37096;&#38376;&#24046;&#24322;&#65292;&#25105;&#20204;&#20351;&#29992;&#20102;&#20004;&#22269;&#24180;&#24230;&#25237;&#20837;&#20135;&#20986;&#34920;(IOTs)&#26469;&#26500;&#24314;&#21152;&#26435;&#21644;&#23450;&#21521;&#30340;&#25237;&#20837;&#20135;&#20986;&#32593;&#32476;(IONs)&#12290;&#36825;&#26377;&#21161;&#20110;&#36827;&#34892;&#26356;&#28145;&#20837;&#30340;&#32593;&#32476;&#20998;&#26512;&#12290;&#24378;&#24230;&#20998;&#24067;&#31361;&#26174;&#20102;&#37096;&#38376;&#38388;&#32463;&#27982;&#20114;&#21160;&#30340;&#24046;&#24322;&#12290;&#21152;&#26435;&#12289;&#23450;&#21521;&#30340;&#21516;&#37197;&#31995;&#25968;&#27010;&#25324;&#20102;&#30456;&#36830;&#37096;&#38376;&#29305;&#24449;&#20043;&#38388;&#30340;&#21516;&#36136;&#24615;&#12290;&#36890;&#36807;&#35843;&#25972;PageRank&#20013;&#24515;&#24615;&#30340;&#37325;&#28857;&#65292;&#30830;&#23450;&#20102;&#20851;&#38190;&#37096;&#38376;&#12290;&#31038;&#21306;&#26816;&#27979;&#25581;&#31034;&#20102;&#23427;&#20204;&#22312;&#37096;&#38376;&#20043;&#38388;&#30340;&#32858;&#31867;&#20542;&#21521;&#12290;&#22914;&#39044;&#26399;&#30340;&#37027;&#26679;&#65292;&#20998;&#26512;&#25351;&#20986;&#20102;&#21046;&#36896;&#19994;&#26159;&#20013;&#22269;&#30340;&#20013;&#24515;&#37096;&#38376;&#65292;&#32780;&#26085;&#26412;&#26356;&#38738;&#30544;&#26381;&#21153;&#19994;&#12290;&#28982;&#32780;&#65292;&#22312;&#26356;&#20855;&#20307;&#30340;&#37096;&#38376;&#23618;&#38754;&#19978;&#65292;&#20004;&#22269;&#37117;&#21576;&#29616;&#20986;&#19981;&#21516;&#30340;&#32467;&#26500;&#28436;&#21464;&#12290;&#22312;&#20013;&#22269;&#21644;&#26085;&#26412;&#30340;&#37096;&#38376;&#31038;&#21306;&#26041;&#38754;&#65292;&#23384;&#22312;&#30528;&#19981;&#21516;&#30340;&#24773;&#20917;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.15620v1 Announce Type: cross  Abstract: Economic structure comparisons between China and Japan have long captivated development economists. To delve deeper into their sectoral differences from 1995 to 2018, we used the annual input-output tables (IOTs) of both nations to construct weighted and directed input-output networks (IONs). This facilitated deeper network analyses. Strength distributions underscored variations in inter-sector economic interactions. Weighted, directed assortativity coefficients encapsulated the homophily among connecting sectors' features. By adjusting emphasis in PageRank centrality, key sectors were identified. Community detection revealed their clustering tendencies among the sectors. As anticipated, the analysis pinpointed manufacturing as China's central sector, while Japan favored services. Yet, at a finer level of the specific sectors, both nations exhibited varied structural evolutions. Contrastingly, sectoral communities in both China and Jap
&lt;/p&gt;</description></item><item><title>&#25552;&#20986;&#20102;&#19968;&#31181;&#20351;&#29992;&#32852;&#21512;&#19978;&#28216;&#21644;&#19979;&#28216;&#27169;&#22411;&#36827;&#34892;&#26377;&#25928;&#25512;&#26029;&#30340;&#19968;&#27493;&#31574;&#30053;&#65292;&#26174;&#33879;&#20943;&#23569;&#20102;&#20559;&#35823;&#65292;&#22312;CEO&#26102;&#38388;&#21033;&#29992;&#25968;&#25454;&#30340;&#24212;&#29992;&#20013;&#20135;&#29983;&#20102;&#37325;&#35201;&#25928;&#26524;&#65292;&#36866;&#21512;&#24212;&#29992;&#30740;&#31350;&#20154;&#21592;&#12290;</title><link>https://arxiv.org/abs/2402.15585</link><description>&lt;p&gt;
&#20351;&#29992;&#26469;&#33258;&#38750;&#32467;&#26500;&#21270;&#25968;&#25454;&#29983;&#25104;&#30340;&#21464;&#37327;&#36827;&#34892;&#22238;&#24402;&#30340;&#25512;&#26029;
&lt;/p&gt;
&lt;p&gt;
Inference for Regression with Variables Generated from Unstructured Data
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.15585
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#20351;&#29992;&#32852;&#21512;&#19978;&#28216;&#21644;&#19979;&#28216;&#27169;&#22411;&#36827;&#34892;&#26377;&#25928;&#25512;&#26029;&#30340;&#19968;&#27493;&#31574;&#30053;&#65292;&#26174;&#33879;&#20943;&#23569;&#20102;&#20559;&#35823;&#65292;&#22312;CEO&#26102;&#38388;&#21033;&#29992;&#25968;&#25454;&#30340;&#24212;&#29992;&#20013;&#20135;&#29983;&#20102;&#37325;&#35201;&#25928;&#26524;&#65292;&#36866;&#21512;&#24212;&#29992;&#30740;&#31350;&#20154;&#21592;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20998;&#26512;&#38750;&#32467;&#26500;&#21270;&#25968;&#25454;&#30340;&#20027;&#35201;&#31574;&#30053;&#21253;&#25324;&#20004;&#20010;&#27493;&#39588;&#12290;&#39318;&#20808;&#65292;&#20351;&#29992;&#19978;&#28216;&#20449;&#24687;&#26816;&#32034;&#27169;&#22411;&#20272;&#35745;&#24863;&#20852;&#36259;&#30340;&#28508;&#22312;&#32463;&#27982;&#21464;&#37327;&#12290;&#20854;&#27425;&#65292;&#23558;&#20272;&#35745;&#20540;&#35270;&#20026;&#19979;&#28216;&#35745;&#37327;&#32463;&#27982;&#27169;&#22411;&#20013;&#30340;&#8220;&#25968;&#25454;&#8221;&#12290;&#25105;&#20204;&#24314;&#31435;&#20102;&#29702;&#35770;&#35770;&#28857;&#65292;&#35299;&#37322;&#20026;&#20160;&#20040;&#22312;&#23454;&#35777;&#21512;&#29702;&#30340;&#35774;&#32622;&#20013;&#65292;&#36825;&#31181;&#20004;&#27493;&#31574;&#30053;&#20250;&#23548;&#33268;&#20559;&#35823;&#30340;&#25512;&#26029;&#12290;&#26356;&#20855;&#24314;&#35774;&#24615;&#30340;&#26159;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#26377;&#25928;&#25512;&#26029;&#30340;&#19968;&#27493;&#31574;&#30053;&#65292;&#35813;&#31574;&#30053;&#21516;&#26102;&#20351;&#29992;&#19978;&#28216;&#21644;&#19979;&#28216;&#27169;&#22411;&#12290;&#22312;&#27169;&#25311;&#20013;&#65292;&#36825;&#19968;&#27493;&#31574;&#30053;(i) &#26174;&#33879;&#20943;&#23569;&#20102;&#20559;&#35823;&#65307;(ii) &#22312;&#20351;&#29992;CEO&#26102;&#38388;&#21033;&#29992;&#25968;&#25454;&#30340;&#20027;&#35201;&#24212;&#29992;&#20013;&#20135;&#29983;&#20102;&#23450;&#37327;&#37325;&#35201;&#30340;&#25928;&#26524;&#65307;(iii) &#21487;&#20197;&#24456;&#23481;&#26131;&#22320;&#34987;&#24212;&#29992;&#30740;&#31350;&#20154;&#21592;&#37319;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.15585v1 Announce Type: new  Abstract: The leading strategy for analyzing unstructured data uses two steps. First, latent variables of economic interest are estimated with an upstream information retrieval model. Second, the estimates are treated as "data" in a downstream econometric model. We establish theoretical arguments for why this two-step strategy leads to biased inference in empirically plausible settings. More constructively, we propose a one-step strategy for valid inference that uses the upstream and downstream models jointly. The one-step strategy (i) substantially reduces bias in simulations; (ii) has quantitatively important effects in a leading application using CEO time-use data; and (iii) can be readily adapted by applied researchers.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#22312;&#32463;&#27982;&#23398;&#39046;&#22495;&#37325;&#26032;&#24341;&#20837;&#20256;&#32479;&#25511;&#21046;&#26041;&#27861;&#65292;&#24320;&#21457;&#24182;&#23454;&#26045;&#20102;&#25511;&#21046;&#23631;&#38556;&#20989;&#25968;&#65288;CBFs&#65289;&#65292;&#24182;&#36890;&#36807;&#25968;&#20540;&#27169;&#25311;&#23637;&#31034;&#20102;&#22312;&#35299;&#20915;&#26368;&#20248;&#24191;&#21578;&#21644;&#25237;&#36164;&#32452;&#21512;&#20248;&#21270;&#31561;&#38382;&#39064;&#26102;&#21033;&#29992;&#20256;&#32479;&#25511;&#21046;&#35299;&#20915;&#26041;&#26696;&#19982;CBFs&#30340;&#26377;&#25928;&#24615;&#12290;</title><link>https://arxiv.org/abs/2312.12612</link><description>&lt;p&gt;
&#38024;&#23545;&#32463;&#27982;&#30340;&#38543;&#26426;&#25511;&#21046;&#23631;&#38556;&#20989;&#25968;
&lt;/p&gt;
&lt;p&gt;
Stochastic Control Barrier Functions for Economics
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2312.12612
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#22312;&#32463;&#27982;&#23398;&#39046;&#22495;&#37325;&#26032;&#24341;&#20837;&#20256;&#32479;&#25511;&#21046;&#26041;&#27861;&#65292;&#24320;&#21457;&#24182;&#23454;&#26045;&#20102;&#25511;&#21046;&#23631;&#38556;&#20989;&#25968;&#65288;CBFs&#65289;&#65292;&#24182;&#36890;&#36807;&#25968;&#20540;&#27169;&#25311;&#23637;&#31034;&#20102;&#22312;&#35299;&#20915;&#26368;&#20248;&#24191;&#21578;&#21644;&#25237;&#36164;&#32452;&#21512;&#20248;&#21270;&#31561;&#38382;&#39064;&#26102;&#21033;&#29992;&#20256;&#32479;&#25511;&#21046;&#35299;&#20915;&#26041;&#26696;&#19982;CBFs&#30340;&#26377;&#25928;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25511;&#21046;&#23631;&#38556;&#20989;&#25968;&#65288;CBFs&#65289;&#21644;&#23433;&#20840;&#20851;&#38190;&#25511;&#21046;&#36817;&#24180;&#26469;&#22312;&#33322;&#31354;&#33322;&#22825;&#12289;&#26426;&#22120;&#20154;&#23398;&#21644;&#31070;&#32463;&#32593;&#32476;&#25511;&#21046;&#31995;&#32479;&#39046;&#22495;&#24471;&#21040;&#20102;&#24555;&#36895;&#22686;&#38271;&#30340;&#24212;&#29992;&#65292;CBFs&#21487;&#20197;&#25552;&#20379;&#19968;&#31181;&#35745;&#31639;&#39640;&#25928;&#30340;&#26041;&#27861;&#65292;&#30417;&#27979;&#20219;&#24847;&#20027;&#25511;&#21046;&#22120;&#24182;&#23454;&#26045;&#29366;&#24577;&#32422;&#26463;&#20197;&#30830;&#20445;&#25972;&#20307;&#31995;&#32479;&#23433;&#20840;&#12290;&#26412;&#25991;&#37325;&#26032;&#20171;&#32461;&#20102;&#20256;&#32479;&#25511;&#21046;&#22312;&#32463;&#27982;&#23398;&#20013;&#30340;&#19977;&#20010;&#24212;&#29992;&#65292;&#24182;&#20026;&#27492;&#31867;&#38382;&#39064;&#24320;&#21457;&#20102;CBFs&#12290;&#25991;&#31456;&#32771;&#34385;&#20102;&#30830;&#23450;&#24615;&#21644;&#38543;&#26426;&#24773;&#20917;&#19979;&#30340;&#26368;&#20248;&#24191;&#21578;&#38382;&#39064;&#20197;&#21450;&#40664;&#39039;&#30340;&#25237;&#36164;&#32452;&#21512;&#20248;&#21270;&#38382;&#39064;&#12290;&#25968;&#20540;&#27169;&#25311;&#29992;&#20110;&#23637;&#31034;&#22312;&#24212;&#29992;&#20256;&#32479;&#25511;&#21046;&#35299;&#20915;&#26041;&#26696;&#19982;CBFs&#21644;&#38543;&#26426;CBFs&#30456;&#32467;&#21512;&#19979;&#35299;&#20915;&#27492;&#31867;&#38382;&#39064;&#30340;&#26377;&#25928;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2312.12612v2 Announce Type: replace  Abstract: Control barrier functions (CBFs) and safety-critical control have seen a rapid increase in popularity in recent years, predominantly applied to systems in aerospace, robotics and neural network controllers. Control barrier functions can provide a computationally efficient method to monitor arbitrary primary controllers and enforce state constraints to ensure overall system safety. One area that has yet to take advantage of the benefits offered by CBFs is the field of finance and economics. This manuscript re-introduces three applications of traditional control to economics, and develops and implements CBFs for such problems. We consider the problem of optimal advertising for the deterministic and stochastic case and Merton's portfolio optimization problem. Numerical simulations are used to demonstrate the effectiveness of using traditional control solutions in tandem with CBFs and stochastic CBFs to solve such problems in the presenc
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25506;&#35752;&#20102;&#22522;&#20110;&#24066;&#22330;&#30340;&#20215;&#26684;&#33258;&#30456;&#20851;&#24615;&#65292;&#21457;&#29616;&#24066;&#22330;&#20132;&#26131;&#20215;&#20540;&#21644;&#25104;&#20132;&#37327;&#30340;&#38543;&#26426;&#24615;&#23545;&#20215;&#26684;&#30340;&#32479;&#35745;&#26102;&#21051;&#21644;&#33258;&#30456;&#20851;&#24615;&#26377;&#24433;&#21709;&#65292;&#24182;&#25552;&#20986;&#20102;&#26032;&#30340;&#35780;&#20272;&#26041;&#27861;&#12290;</title><link>https://arxiv.org/abs/2202.09323</link><description>&lt;p&gt;
&#22522;&#20110;&#24066;&#22330;&#30340;&#20215;&#26684;&#33258;&#30456;&#20851;&#24615;
&lt;/p&gt;
&lt;p&gt;
Market-Based Price Autocorrelation
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2202.09323
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25506;&#35752;&#20102;&#22522;&#20110;&#24066;&#22330;&#30340;&#20215;&#26684;&#33258;&#30456;&#20851;&#24615;&#65292;&#21457;&#29616;&#24066;&#22330;&#20132;&#26131;&#20215;&#20540;&#21644;&#25104;&#20132;&#37327;&#30340;&#38543;&#26426;&#24615;&#23545;&#20215;&#26684;&#30340;&#32479;&#35745;&#26102;&#21051;&#21644;&#33258;&#30456;&#20851;&#24615;&#26377;&#24433;&#21709;&#65292;&#24182;&#25552;&#20986;&#20102;&#26032;&#30340;&#35780;&#20272;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20551;&#35774;&#24066;&#22330;&#20132;&#26131;&#20215;&#20540;&#21644;&#25104;&#20132;&#37327;&#30340;&#38543;&#26426;&#24615;&#20915;&#23450;&#20102;&#38543;&#26426;&#24066;&#22330;&#20215;&#26684;&#30340;&#23646;&#24615;&#12290;&#25105;&#20204;&#25512;&#23548;&#20102;&#31532;&#19968;&#21644;&#31532;&#20108;&#20215;&#26684;&#32479;&#35745;&#26102;&#21051;&#20197;&#21450;&#20215;&#26684;&#27874;&#21160;&#29575;&#23545;&#24066;&#22330;&#20132;&#26131;&#20215;&#20540;&#21644;&#25104;&#20132;&#37327;&#30340;&#32479;&#35745;&#26102;&#21051;&#12289;&#27874;&#21160;&#29575;&#20197;&#21450;&#30456;&#20851;&#24615;&#30340;&#30452;&#25509;&#20381;&#36182;&#20851;&#31995;&#12290;&#36825;&#26377;&#21161;&#20110;&#25551;&#36848;&#22522;&#20110;&#24066;&#22330;&#30340;&#20215;&#26684;&#22312;t&#26102;&#21051;&#21644;t-{\tau}&#26102;&#21051;&#20043;&#38388;&#30340;&#33258;&#30456;&#20851;&#24615;&#20381;&#36182;&#20110;&#20132;&#26131;&#20215;&#20540;&#21644;&#25104;&#20132;&#37327;&#20043;&#38388;&#30340;&#32479;&#35745;&#26102;&#21051;&#21644;&#30456;&#20851;&#24615;&#12290;&#36825;&#31361;&#26174;&#20102;&#24066;&#22330;&#20132;&#26131;&#35268;&#27169;&#30340;&#38543;&#26426;&#24615;&#23545;&#20215;&#26684;&#32479;&#35745;&#26102;&#21051;&#21644;&#33258;&#30456;&#20851;&#24615;&#30340;&#24433;&#21709;&#12290;&#24066;&#22330;&#20132;&#26131;&#20215;&#20540;&#21644;&#25104;&#20132;&#37327;&#30340;&#32479;&#35745;&#26102;&#21051;&#21644;&#30456;&#20851;&#24615;&#26159;&#36890;&#36807;&#20256;&#32479;&#22522;&#20110;&#39057;&#29575;&#30340;&#27010;&#29575;&#35780;&#20272;&#30340;&#12290;&#22522;&#20110;&#24066;&#22330;&#30340;&#20215;&#26684;&#33258;&#30456;&#20851;&#24615;&#21644;&#36890;&#36807;&#20215;&#26684;&#26102;&#38388;&#24207;&#21015;&#30340;&#22522;&#20110;&#39057;&#29575;&#27010;&#29575;&#20998;&#26512;&#35780;&#20272;&#30340;&#33258;&#30456;&#20851;&#24615;&#20043;&#38388;&#30340;&#21306;&#21035;&#25581;&#31034;&#20102;&#23545;&#24066;&#22330;&#33258;&#30456;&#20851;&#24615;&#30340;&#19981;&#21516;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2202.09323v2 Announce Type: replace  Abstract: This paper assumes that the randomness of market trade values and volumes determines the properties of stochastic market prices. We derive the direct dependence of the first two price statistical moments and price volatility on statistical moments, volatilities, and correlations of market trade values and volumes. That helps describe the dependence of market-based price autocorrelation between times t and t-{\tau} on statistical moments and correlations between trade values and volumes. That highlights the impact of the randomness of the size of market deals on price statistical moments and autocorrelation. Statistical moments and correlations of market trade values and volumes are assessed by conventional frequency-based probabilities. The distinctions between market-based price autocorrelation and autocorrelation that are assessed by the frequency-based probability analysis of price time series reveal the different approaches to th
&lt;/p&gt;</description></item><item><title>&#36890;&#36807;&#22312;&#22266;&#23450;&#32622;&#20449;&#24230;&#19979;&#21033;&#29992;&#19978;&#19979;&#25991;&#20449;&#24687;&#65292;&#22312;&#35782;&#21035;&#26368;&#20339;&#33218;&#26102;&#25552;&#20986;&#20102;&#19968;&#31181;&#19978;&#19979;&#25991;&#24863;&#30693;&#30340;&#8220;&#36319;&#36394;&#20572;&#27490;&#8221;&#31574;&#30053;&#65292;&#23454;&#29616;&#20102;&#27604;&#20043;&#21069;&#26041;&#27861;&#26356;&#39640;&#25928;&#30340;&#25928;&#26524;&#12290;</title><link>https://arxiv.org/abs/2106.14077</link><description>&lt;p&gt;
&#22312;&#26368;&#20339;&#33218;&#35782;&#21035;&#20013;&#19978;&#19979;&#25991;&#20449;&#24687;&#30340;&#20316;&#29992;
&lt;/p&gt;
&lt;p&gt;
The Role of Contextual Information in Best Arm Identification
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2106.14077
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#22312;&#22266;&#23450;&#32622;&#20449;&#24230;&#19979;&#21033;&#29992;&#19978;&#19979;&#25991;&#20449;&#24687;&#65292;&#22312;&#35782;&#21035;&#26368;&#20339;&#33218;&#26102;&#25552;&#20986;&#20102;&#19968;&#31181;&#19978;&#19979;&#25991;&#24863;&#30693;&#30340;&#8220;&#36319;&#36394;&#20572;&#27490;&#8221;&#31574;&#30053;&#65292;&#23454;&#29616;&#20102;&#27604;&#20043;&#21069;&#26041;&#27861;&#26356;&#39640;&#25928;&#30340;&#25928;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#22312;&#38543;&#26426;&#36172;&#21338;&#26426;&#20013;&#24403;&#26377;&#19978;&#19979;&#25991;&#65288;&#21327;&#21464;&#37327;&#65289;&#20449;&#24687;&#21487;&#29992;&#26102;&#30340;&#22266;&#23450;&#32622;&#20449;&#24230;&#19979;&#30340;&#26368;&#20339;&#33218;&#35782;&#21035;&#38382;&#39064;&#12290;&#34429;&#28982;&#25105;&#20204;&#21487;&#20197;&#22312;&#27599;&#19968;&#36718;&#20013;&#20351;&#29992;&#19978;&#19979;&#25991;&#20449;&#24687;&#65292;&#20294;&#25105;&#20204;&#23545;&#19978;&#19979;&#25991;&#20998;&#24067;&#30340;&#36793;&#38469;&#21270;&#22343;&#20540;&#37325;&#35270;&#12290;&#25105;&#20204;&#30340;&#30446;&#26631;&#26159;&#22312;&#32473;&#23450;&#38169;&#35823;&#29575;&#20540;&#30340;&#24773;&#20917;&#19979;&#20197;&#26368;&#23567;&#25968;&#37327;&#30340;&#25277;&#26679;&#35782;&#21035;&#26368;&#20339;&#33218;&#12290;&#25105;&#20204;&#20026;&#35813;&#38382;&#39064;&#23637;&#31034;&#20102;&#29305;&#23450;&#23454;&#20363;&#30340;&#26679;&#26412;&#22797;&#26434;&#24615;&#19979;&#30028;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#8220;&#36319;&#36394;&#20572;&#27490;&#8221;&#31574;&#30053;&#30340;&#19978;&#19979;&#25991;&#24863;&#30693;&#29256;&#26412;&#65292;&#20854;&#20013;&#33218;&#25277;&#21462;&#30340;&#27604;&#20363;&#36319;&#36394;&#26368;&#20248;&#20998;&#37197;&#38598;&#65292;&#24182;&#35777;&#26126;&#20102;&#39044;&#26399;&#30340;&#33218;&#25277;&#21462;&#27425;&#25968;&#28176;&#36817;&#22320;&#19982;&#19979;&#30028;&#21305;&#37197;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#30456;&#23545;&#20110;Garivier &amp; Kaufmann&#65288;2016&#65289;&#30340;&#32467;&#26524;&#65292;&#19978;&#19979;&#25991;&#20449;&#24687;&#21487;&#20197;&#29992;&#26469;&#25913;&#21892;&#23545;&#26368;&#20339;&#36793;&#38469;&#21270;&#22343;&#20540;&#22870;&#21169;&#30340;&#35782;&#21035;&#25928;&#29575;&#12290;&#25105;&#20204;&#23454;&#39564;&#35777;&#23454;&#20102; cont
&lt;/p&gt;
&lt;p&gt;
arXiv:2106.14077v3 Announce Type: replace  Abstract: We study the best-arm identification problem with fixed confidence when contextual (covariate) information is available in stochastic bandits. Although we can use contextual information in each round, we are interested in the marginalized mean reward over the contextual distribution. Our goal is to identify the best arm with a minimal number of samplings under a given value of the error rate. We show the instance-specific sample complexity lower bounds for the problem. Then, we propose a context-aware version of the "Track-and-Stop" strategy, wherein the proportion of the arm draws tracks the set of optimal allocations and prove that the expected number of arm draws matches the lower bound asymptotically. We demonstrate that contextual information can be used to improve the efficiency of the identification of the best marginalized mean reward compared with the results of Garivier &amp; Kaufmann (2016). We experimentally confirm that cont
&lt;/p&gt;</description></item><item><title>&#25552;&#20986;&#20102;&#19968;&#31181;&#31070;&#32463;&#39057;&#29575;-&#20005;&#37325;&#24615;&#27169;&#22411;&#65292;&#33021;&#22815;&#25429;&#25417;&#35299;&#37322;&#21464;&#37327;&#30340;&#38750;&#32447;&#24615;&#20851;&#31995;&#65292;&#24182;&#25104;&#21151;&#24212;&#29992;&#20110;&#20445;&#38505;&#29702;&#36180;&#39046;&#22495;&#12290;</title><link>https://arxiv.org/abs/2106.10770</link><description>&lt;p&gt;
&#19968;&#20010;&#31070;&#32463;&#39057;&#29575;-&#20005;&#37325;&#24615;&#27169;&#22411;&#21450;&#20854;&#22312;&#20445;&#38505;&#29702;&#36180;&#20013;&#30340;&#24212;&#29992;
&lt;/p&gt;
&lt;p&gt;
A Neural Frequency-Severity Model and Its Application to Insurance Claims
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2106.10770
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#31070;&#32463;&#39057;&#29575;-&#20005;&#37325;&#24615;&#27169;&#22411;&#65292;&#33021;&#22815;&#25429;&#25417;&#35299;&#37322;&#21464;&#37327;&#30340;&#38750;&#32447;&#24615;&#20851;&#31995;&#65292;&#24182;&#25104;&#21151;&#24212;&#29992;&#20110;&#20445;&#38505;&#29702;&#36180;&#39046;&#22495;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#28789;&#27963;&#19988;&#26131;&#20110;&#20998;&#26512;&#30340;&#39057;&#29575;&#21644;&#20005;&#37325;&#24615;&#27169;&#22411;&#31867;&#65292;&#29992;&#20110;&#39044;&#27979;&#20445;&#38505;&#29702;&#36180;&#12290;&#25152;&#25552;&#20986;&#30340;&#27169;&#22411;&#21487;&#20197;&#36890;&#36807;&#23558;&#39057;&#29575;&#21644;&#20005;&#37325;&#24615;&#20998;&#24067;&#30340;&#23545;&#25968;&#22343;&#20540;&#20989;&#25968;&#25551;&#36848;&#20026;&#31070;&#32463;&#32593;&#32476;&#26469;&#25429;&#25417;&#35299;&#37322;&#21464;&#37327;&#30340;&#38750;&#32447;&#24615;&#20851;&#31995;&#12290;&#27492;&#22806;&#65292;&#29702;&#36180;&#39057;&#29575;&#21644;&#20005;&#37325;&#24615;&#20043;&#38388;&#30340;&#28508;&#22312;&#20381;&#36182;&#20851;&#31995;&#21487;&#20197;&#34987;&#32435;&#20837;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#26412;&#25991;&#25552;&#20379;&#20102;&#24635;&#29702;&#36180;&#36153;&#29992;&#30340;&#22343;&#20540;&#21644;&#26041;&#24046;&#30340;&#35299;&#26512;&#20844;&#24335;&#65292;&#20351;&#24471;&#25105;&#20204;&#30340;&#27169;&#22411;&#38750;&#24120;&#36866;&#21512;&#35768;&#22810;&#24212;&#29992;&#65292;&#22914;&#23450;&#20215;&#20445;&#38505;&#21512;&#21516;&#21644;&#32431;&#20445;&#36153;&#12290;&#27169;&#25311;&#30740;&#31350;&#34920;&#26126;&#65292;&#25105;&#20204;&#30340;&#26041;&#27861;&#25104;&#21151;&#24674;&#22797;&#20102;&#35299;&#37322;&#21464;&#37327;&#30340;&#38750;&#32447;&#24615;&#29305;&#24449;&#20197;&#21450;&#39057;&#29575;&#21644;&#20005;&#37325;&#24615;&#20043;&#38388;&#30340;&#20381;&#36182;&#20851;&#31995;&#12290;&#28982;&#21518;&#65292;&#26412;&#25991;&#20351;&#29992;&#20102;&#27861;&#22269;&#27773;&#36710;&#20445;&#38505;&#29702;&#36180;&#25968;&#25454;&#38598;&#65292;&#35777;&#26126;&#25152;&#25552;&#20986;&#30340;&#27169;&#22411;&#22312;&#25311;&#21512;&#21644;&#39044;&#27979;&#33021;&#21147;&#19978;&#20248;&#20110;&#29616;&#26377;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2106.10770v2 Announce Type: replace  Abstract: This paper proposes a flexible and analytically tractable class of frequency and severity models for predicting insurance claims. The proposed model is able to capture nonlinear relationships in explanatory variables by characterizing the logarithmic mean functions of frequency and severity distributions as neural networks. Moreover, a potential dependence between the claim frequency and severity can be incorporated. In particular, the paper provides analytic formulas for mean and variance of the total claim cost, making our model ideal for many applications such as pricing insurance contracts and the pure premium. A simulation study demonstrates that our method successfully recovers nonlinear features of explanatory variables as well as the dependency between frequency and severity. Then, this paper uses a French auto insurance claim dataset to illustrate that the proposed model is superior to the existing methods in fitting and pre
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#22312;&#32447;&#22240;&#26524;&#25512;&#26029;&#26041;&#27861;&#65292;&#21033;&#29992;&#19968;&#20215;&#21644;&#20108;&#20215;&#25293;&#21334;&#30340;&#32463;&#27982;&#32467;&#26500;&#65292;&#36890;&#36807;&#24341;&#20837;&#25913;&#36827;&#30340;&#27748;&#26222;&#26862;&#25277;&#26679;&#31639;&#27861;&#26469;&#26377;&#25928;&#35782;&#21035;&#23454;&#26102;&#31454;&#20215;&#24191;&#21578;&#30340;&#25928;&#26524;&#65292;&#26368;&#23567;&#21270;&#23454;&#39564;&#25104;&#26412;&#65292;&#24182;&#33719;&#24471;&#20102;&#39034;&#24207;&#26368;&#20248;&#30340;&#36951;&#25022;&#19978;&#30028;&#12290;</title><link>https://arxiv.org/abs/1908.08600</link><description>&lt;p&gt;
&#23454;&#26102;&#31454;&#20215;&#24191;&#21578;&#20013;&#30340;&#22312;&#32447;&#22240;&#26524;&#25512;&#26029;
&lt;/p&gt;
&lt;p&gt;
Online Causal Inference for Advertising in Real-Time Bidding Auctions
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/1908.08600
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#22312;&#32447;&#22240;&#26524;&#25512;&#26029;&#26041;&#27861;&#65292;&#21033;&#29992;&#19968;&#20215;&#21644;&#20108;&#20215;&#25293;&#21334;&#30340;&#32463;&#27982;&#32467;&#26500;&#65292;&#36890;&#36807;&#24341;&#20837;&#25913;&#36827;&#30340;&#27748;&#26222;&#26862;&#25277;&#26679;&#31639;&#27861;&#26469;&#26377;&#25928;&#35782;&#21035;&#23454;&#26102;&#31454;&#20215;&#24191;&#21578;&#30340;&#25928;&#26524;&#65292;&#26368;&#23567;&#21270;&#23454;&#39564;&#25104;&#26412;&#65292;&#24182;&#33719;&#24471;&#20102;&#39034;&#24207;&#26368;&#20248;&#30340;&#36951;&#25022;&#19978;&#30028;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#23454;&#26102;&#31454;&#20215;&#65288;RTB&#65289;&#31995;&#32479;&#36890;&#36807;&#25293;&#21334;&#23558;&#29992;&#25143;&#26333;&#20809;&#20998;&#37197;&#32473;&#31454;&#20105;&#23545;&#25163;&#30340;&#24191;&#21578;&#21830;&#65292;&#32487;&#32493;&#22312;&#25968;&#23383;&#24191;&#21578;&#39046;&#22495;&#21462;&#24471;&#25104;&#21151;&#12290;&#35780;&#20272;&#36825;&#31181;&#24191;&#21578;&#30340;&#26377;&#25928;&#24615;&#22312;&#30740;&#31350;&#21644;&#23454;&#36341;&#20013;&#20173;&#28982;&#26159;&#19968;&#20010;&#25361;&#25112;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#26041;&#27861;&#26469;&#23545;&#36890;&#36807;&#36825;&#31181;&#26426;&#21046;&#36141;&#20080;&#30340;&#24191;&#21578;&#36827;&#34892;&#22240;&#26524;&#25512;&#26029;&#12290;&#21033;&#29992;&#19968;&#20215;&#21644;&#20108;&#20215;&#25293;&#21334;&#30340;&#32463;&#27982;&#32467;&#26500;&#65292;&#25105;&#20204;&#39318;&#20808;&#23637;&#31034;&#20102;&#24191;&#21578;&#25928;&#26524;&#30001;&#26368;&#20339;&#20986;&#20215;&#30830;&#23450;&#12290;&#22240;&#27492;&#65292;&#30001;&#20110;&#36825;&#20123;&#26368;&#20339;&#20986;&#20215;&#26159;&#21807;&#19968;&#38656;&#35201;&#24674;&#22797;&#30340;&#23545;&#35937;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#31181;&#25913;&#36827;&#30340;&#27748;&#26222;&#26862;&#25277;&#26679;&#65288;TS&#65289;&#31639;&#27861;&#65292;&#26469;&#35299;&#20915;&#19968;&#20010;&#22810;&#33218;&#32769;&#34382;&#26426;&#38382;&#39064;&#65292;&#25104;&#21151;&#24674;&#22797;&#36825;&#20123;&#20986;&#20215;&#21644;&#22240;&#27492;&#24191;&#21578;&#25928;&#26524;&#65292;&#21516;&#26102;&#26368;&#23567;&#21270;&#23454;&#39564;&#25104;&#26412;&#12290;&#25105;&#20204;&#25512;&#23548;&#20102;&#31639;&#27861;&#30340;&#36951;&#25022;&#19978;&#30028;&#65292;&#35813;&#19978;&#30028;&#26159;&#39034;&#24207;&#26368;&#20248;&#30340;&#65292;&#24182;&#21033;&#29992;RTB&#25293;&#21334;&#25968;&#25454;&#23637;&#31034;&#20102;&#23427;&#30340;&#24615;&#33021;&#34920;&#29616;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:1908.08600v4 Announce Type: replace  Abstract: Real-time bidding (RTB) systems, which utilize auctions to allocate user impressions to competing advertisers, continue to enjoy success in digital advertising. Assessing the effectiveness of such advertising remains a challenge in research and practice. This paper proposes a new approach to perform causal inference on advertising bought through such mechanisms. Leveraging the economic structure of first- and second-price auctions, we first show that the effects of advertising are identified by the optimal bids. Hence, since these optimal bids are the only objects that need to be recovered, we introduce an adapted Thompson sampling (TS) algorithm to solve a multi-armed bandit problem that succeeds in recovering such bids and, consequently, the effects of advertising while minimizing the costs of experimentation. We derive a regret bound for our algorithm which is order optimal and use data from RTB auctions to show that it outperform
&lt;/p&gt;</description></item><item><title>&#30740;&#31350;&#20102;&#21333;&#20132;&#21449;&#20248;&#21183;&#30340;&#26684;&#32467;&#26500;&#65292;&#24182;&#25512;&#23548;&#20986;&#20102;&#26032;&#30340;&#27604;&#36739;&#38745;&#24577;&#23450;&#29702;&#65292;&#24212;&#29992;&#20110;&#38598;&#20307;&#36873;&#25321;&#12289;&#20998;&#26512;&#32773;&#19981;&#30830;&#23450;&#24615;&#19979;&#65292;&#24182;&#23545;&#19981;&#30830;&#23450;&#24615;&#21388;&#24694;&#20559;&#22909;&#21644;&#31038;&#20250;&#36873;&#25321;&#20013;&#30340;&#24352;&#21147;&#36827;&#34892;&#20102;&#20998;&#31867;&#12290;</title><link>https://arxiv.org/abs/1902.07260</link><description>&lt;p&gt;
&#20559;&#22909;&#26684;
&lt;/p&gt;
&lt;p&gt;
The preference lattice
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/1902.07260
&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#20102;&#21333;&#20132;&#21449;&#20248;&#21183;&#30340;&#26684;&#32467;&#26500;&#65292;&#24182;&#25512;&#23548;&#20986;&#20102;&#26032;&#30340;&#27604;&#36739;&#38745;&#24577;&#23450;&#29702;&#65292;&#24212;&#29992;&#20110;&#38598;&#20307;&#36873;&#25321;&#12289;&#20998;&#26512;&#32773;&#19981;&#30830;&#23450;&#24615;&#19979;&#65292;&#24182;&#23545;&#19981;&#30830;&#23450;&#24615;&#21388;&#24694;&#20559;&#22909;&#21644;&#31038;&#20250;&#36873;&#25321;&#20013;&#30340;&#24352;&#21147;&#36827;&#34892;&#20102;&#20998;&#31867;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22823;&#22810;&#25968;&#20559;&#22909;&#27604;&#36739;&#26159;&#21333;&#20132;&#21449;&#20248;&#21183;&#30340;&#23454;&#20363;&#12290;&#25105;&#20204;&#30740;&#31350;&#20102;&#21333;&#20132;&#21449;&#20248;&#21183;&#30340;&#26684;&#32467;&#26500;&#65292;&#35777;&#26126;&#20102;&#20219;&#24847;&#20559;&#22909;&#38598;&#30340;&#26368;&#23567;&#19978;&#30028;&#30340;&#34920;&#24449;&#12289;&#23384;&#22312;&#24615;&#21644;&#21807;&#19968;&#24615;&#32467;&#26524;&#12290;&#25105;&#20204;&#23558;&#36825;&#20123;&#23450;&#29702;&#24212;&#29992;&#20110;&#25512;&#23548;&#38598;&#20307;&#36873;&#25321;&#21644;&#20998;&#26512;&#32773;&#19981;&#30830;&#23450;&#24615;&#19979;&#30340;&#26032;&#30340;&#27604;&#36739;&#38745;&#24577;&#23450;&#29702;&#65292;&#20197;&#21051;&#30011;&#23545;Savage&#34892;&#20026;&#30340;&#19981;&#30830;&#23450;&#24615;&#21388;&#24694;&#20559;&#22909;&#30340;&#19968;&#33324;&#8220;maxmin&#8221;&#31867;&#65292;&#24182;&#37325;&#26032;&#23457;&#35270;&#31038;&#20250;&#36873;&#25321;&#20013;&#33258;&#30001;&#20027;&#20041;&#21644;&#24085;&#32047;&#25176;&#25928;&#29575;&#20043;&#38388;&#30340;&#24352;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:1902.07260v5 Announce Type: replace  Abstract: Most comparisons of preferences are instances of single-crossing dominance. We examine the lattice structure of single-crossing dominance, proving characterisation, existence and uniqueness results for minimum upper bounds of arbitrary sets of preferences. We apply these theorems to derive new comparative statics theorems for collective choice and under analyst uncertainty, to characterise a general 'maxmin' class of uncertainty-averse preferences over Savage acts, and to revisit the tension between liberalism and Pareto-efficiency in social choice.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#26032;&#30340;&#26631;&#20934;&#32447;&#24615;&#22238;&#24402;&#27169;&#22411;&#30340;&#20272;&#35745;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#36890;&#36807;&#31616;&#21333;&#21152;&#26435;&#24179;&#22343;&#35266;&#27979;&#23545;&#26012;&#29575;&#26469;&#20272;&#35745;&#65292;&#24182;&#19988;&#36890;&#36807;&#31934;&#24515;&#36873;&#25321;&#26435;&#37325;&#26469;&#20445;&#35777;&#19968;&#33268;&#24615;&#12290;&#30456;&#27604;&#20256;&#32479;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#30340;&#20272;&#35745;&#27531;&#24046;&#19981;&#19982;&#35299;&#37322;&#21464;&#37327;&#27491;&#20132;&#65292;&#22240;&#27492;&#33021;&#22815;&#22312;&#22810;&#20010;&#23454;&#38469;&#24212;&#29992;&#20013;&#20351;&#29992;&#65292;&#22914;&#27979;&#35797;&#20869;&#29983;&#24615;&#31561;&#12290;</title><link>http://arxiv.org/abs/2401.11229</link><description>&lt;p&gt;
&#22522;&#20110;&#25104;&#23545;&#35266;&#27979;&#30340;&#20272;&#35745;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Estimation with Pairwise Observations. (arXiv:2401.11229v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.11229
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#26032;&#30340;&#26631;&#20934;&#32447;&#24615;&#22238;&#24402;&#27169;&#22411;&#30340;&#20272;&#35745;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#36890;&#36807;&#31616;&#21333;&#21152;&#26435;&#24179;&#22343;&#35266;&#27979;&#23545;&#26012;&#29575;&#26469;&#20272;&#35745;&#65292;&#24182;&#19988;&#36890;&#36807;&#31934;&#24515;&#36873;&#25321;&#26435;&#37325;&#26469;&#20445;&#35777;&#19968;&#33268;&#24615;&#12290;&#30456;&#27604;&#20256;&#32479;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#30340;&#20272;&#35745;&#27531;&#24046;&#19981;&#19982;&#35299;&#37322;&#21464;&#37327;&#27491;&#20132;&#65292;&#22240;&#27492;&#33021;&#22815;&#22312;&#22810;&#20010;&#23454;&#38469;&#24212;&#29992;&#20013;&#20351;&#29992;&#65292;&#22914;&#27979;&#35797;&#20869;&#29983;&#24615;&#31561;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#26032;&#30340;&#26631;&#20934;&#32447;&#24615;&#22238;&#24402;&#27169;&#22411;&#30340;&#20272;&#35745;&#26041;&#27861;&#12290;&#35813;&#26041;&#27861;&#27809;&#26377;&#20248;&#21270;&#20219;&#20309;&#30446;&#26631;&#20989;&#25968;&#65292;&#32780;&#26159;&#35266;&#27979;&#23545;&#26012;&#29575;&#30340;&#31616;&#21333;&#21152;&#26435;&#24179;&#22343;&#12290;&#30740;&#31350;&#34920;&#26126;&#65292;&#36890;&#36807;&#31934;&#24515;&#36873;&#25321;&#26435;&#37325;&#65292;&#36825;&#26679;&#30340;&#20272;&#35745;&#37327;&#26159;&#19968;&#33268;&#30340;&#12290;&#20026;&#20102;&#26041;&#20415;&#36827;&#34892;&#26377;&#25928;&#30340;&#32479;&#35745;&#25512;&#26029;&#65292;&#36824;&#25512;&#23548;&#20102;&#28176;&#36817;&#20998;&#24067;&#31561;&#20854;&#20182;&#23646;&#24615;&#12290;&#19982;&#20256;&#32479;&#30340;&#26368;&#23567;&#20108;&#20056;&#27861;&#21644;&#26368;&#22823;&#20284;&#28982;&#27861;&#31561;&#26041;&#27861;&#19981;&#21516;&#65292;&#35813;&#20272;&#35745;&#22120;&#30340;&#20272;&#35745;&#27531;&#24046;&#22312;&#26500;&#36896;&#26102;&#19981;&#19982;&#27169;&#22411;&#30340;&#35299;&#37322;&#21464;&#37327;&#27491;&#20132;&#12290;&#36825;&#19968;&#29305;&#24615;&#20801;&#35768;&#24191;&#27867;&#30340;&#23454;&#38469;&#24212;&#29992;&#65292;&#20363;&#22914;&#26816;&#39564;&#20869;&#29983;&#24615;&#65292;&#21363;&#35299;&#37322;&#21464;&#37327;&#19982;&#24178;&#25200;&#39033;&#20043;&#38388;&#30340;&#30456;&#20851;&#24615;&#65292;&#20197;&#21450;&#20854;&#20182;&#21487;&#33021;&#30340;&#24212;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;
The paper introduces a new estimation method for the standard linear regression model. The procedure is not driven by the optimisation of any objective function rather, it is a simple weighted average of slopes from observation pairs. The paper shows that such estimator is consistent for carefully selected weights. Other properties, such as asymptotic distributions, have also been derived to facilitate valid statistical inference. Unlike traditional methods, such as Least Squares and Maximum Likelihood, among others, the estimated residual of this estimator is not by construction orthogonal to the explanatory variables of the model. This property allows a wide range of practical applications, such as the testing of endogeneity, i.e.,the correlation between the explanatory variables and the disturbance terms, and potentially several others.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#20855;&#26377;&#24207;&#20559;&#22909;&#30340;&#31038;&#20250;&#36873;&#25321;&#29702;&#35770;&#20013;&#30340;&#21487;&#38450;&#24481;&#38598;&#21512;&#65292;&#35777;&#26126;&#20102;&#28385;&#36275;&#27491;&#21442;&#19982;&#24230;&#21644;&#24247;&#22810;&#22622;&#33719;&#32988;&#32773;&#20934;&#21017;&#30340;&#25237;&#31080;&#26041;&#27861;&#20250;&#23436;&#21892;&#35813;&#38598;&#21512;&#65292;&#28982;&#21518;&#36890;&#36807;&#24341;&#29702;&#35777;&#26126;&#20102;&#19968;&#20010;&#19981;&#21487;&#33021;&#23450;&#29702;&#65292;&#21363;&#27809;&#26377;&#19968;&#31181;&#25237;&#31080;&#26041;&#27861;&#33021;&#21516;&#26102;&#28385;&#36275;&#24247;&#22810;&#22622;&#36755;&#25481;&#32773;&#20934;&#21017;&#12289;&#21487;&#35299;&#24615;&#21644;&#24247;&#22810;&#22622;&#26041;&#27861;&#30340;&#26222;&#36941;&#19981;&#21464;&#24615;&#23646;&#24615;&#12290;</title><link>http://arxiv.org/abs/2401.05657</link><description>&lt;p&gt;
&#25237;&#31080;&#20013;&#30340;&#21487;&#38450;&#24481;&#38598;&#21512;&#21644;&#19968;&#20010;&#26032;&#30340;&#19981;&#21487;&#33021;&#23450;&#29702;
&lt;/p&gt;
&lt;p&gt;
The defensible set and a new impossibility theorem in voting. (arXiv:2401.05657v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.05657
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#20855;&#26377;&#24207;&#20559;&#22909;&#30340;&#31038;&#20250;&#36873;&#25321;&#29702;&#35770;&#20013;&#30340;&#21487;&#38450;&#24481;&#38598;&#21512;&#65292;&#35777;&#26126;&#20102;&#28385;&#36275;&#27491;&#21442;&#19982;&#24230;&#21644;&#24247;&#22810;&#22622;&#33719;&#32988;&#32773;&#20934;&#21017;&#30340;&#25237;&#31080;&#26041;&#27861;&#20250;&#23436;&#21892;&#35813;&#38598;&#21512;&#65292;&#28982;&#21518;&#36890;&#36807;&#24341;&#29702;&#35777;&#26126;&#20102;&#19968;&#20010;&#19981;&#21487;&#33021;&#23450;&#29702;&#65292;&#21363;&#27809;&#26377;&#19968;&#31181;&#25237;&#31080;&#26041;&#27861;&#33021;&#21516;&#26102;&#28385;&#36275;&#24247;&#22810;&#22622;&#36755;&#25481;&#32773;&#20934;&#21017;&#12289;&#21487;&#35299;&#24615;&#21644;&#24247;&#22810;&#22622;&#26041;&#27861;&#30340;&#26222;&#36941;&#19981;&#21464;&#24615;&#23646;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#20855;&#26377;&#24207;&#20559;&#22909;&#30340;&#31038;&#20250;&#36873;&#25321;&#29702;&#35770;&#32972;&#26223;&#19979;&#65292;&#25105;&#20204;&#31216;&#21487;&#38450;&#24481;&#38598;&#21512;&#20026;&#37027;&#20123;&#23545;&#20110;&#20219;&#20309;&#26367;&#20195;&#26041;&#26696;$x$&#65292;&#22914;&#26524;$y$&#22312;&#20004;&#20004;&#23545;&#27604;&#20013;&#20987;&#36133;$x$&#65292;&#21017;&#23384;&#22312;&#19968;&#20010;&#26367;&#20195;&#26041;&#26696;$z$&#65292;&#23427;&#22312;&#20004;&#20004;&#23545;&#27604;&#20013;&#20197;&#33267;&#23569;&#19982;$y$&#20987;&#36133;$x$&#30340;&#38388;&#38548;&#19968;&#26679;&#22823;&#30340;&#38388;&#38548;&#20987;&#36133;$y$&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#28385;&#36275;&#20004;&#20010;&#24050;&#30693;&#20844;&#29702;&#65288;&#27491;&#21442;&#19982;&#24230;&#21644;&#24247;&#22810;&#22622;&#33719;&#32988;&#32773;&#20934;&#21017;&#65289;&#30340;&#24207;&#27425;&#25237;&#31080;&#26041;&#27861;&#20250;&#23436;&#21892;&#21487;&#38450;&#24481;&#38598;&#21512;&#12290;&#21033;&#29992;&#36825;&#20010;&#24341;&#29702;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#19968;&#20010;&#19981;&#21487;&#33021;&#23450;&#29702;&#65306;&#27809;&#26377;&#19968;&#31181;&#21516;&#26102;&#36824;&#28385;&#36275;&#24247;&#22810;&#22622;&#36755;&#25481;&#32773;&#20934;&#21017;&#12289;&#21487;&#35299;&#24615;&#21644;&#24247;&#22810;&#22622;&#26041;&#27861;&#30340;&#26222;&#36941;&#19981;&#21464;&#24615;&#23646;&#24615;&#65292;&#21363;&#20915;&#32988;&#32773;&#30340;&#36873;&#25321;&#21482;&#21462;&#20915;&#20110;&#22810;&#25968;&#36793;&#38469;&#30340;&#30456;&#23545;&#22823;&#23567;&#30340;&#25237;&#31080;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
In the context of social choice theory with ordinal preferences, we say that the defensible set is the set of alternatives $x$ such that for any alternative $y$, if $y$ beats $x$ in a head-to-head majority comparison, then there is an alternative $z$ that beats $y$ in a head-to-head majority comparison by a margin at least as large as the margin by which $y$ beat $x$. We show that any ordinal voting method satisfying two well-known axioms from voting theory--positive involvement and the Condorcet winner criterion--refines the defensible set. Using this lemma, we prove an impossibility theorem: there is no such voting method that also satisfies the Condorcet loser criterion, resolvability, and a common invariance property for Condorcet methods, namely that the choice of winners depends only on the relative sizes of majority margins.
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#22914;&#20309;&#36890;&#36807;&#25968;&#25454;&#25913;&#21892;&#40065;&#26834;&#20915;&#31574;&#65292;&#24182;&#24320;&#21457;&#20102;&#31616;&#21333;&#26131;&#23454;&#29616;&#30340;&#25512;&#29702;&#26041;&#27861;&#20197;&#20445;&#35777;&#25913;&#21892;&#12290;</title><link>http://arxiv.org/abs/2310.16281</link><description>&lt;p&gt;
&#36890;&#36807;&#25968;&#25454;&#25913;&#21892;&#40065;&#26834;&#20915;&#31574;
&lt;/p&gt;
&lt;p&gt;
Improving Robust Decisions with Data. (arXiv:2310.16281v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.16281
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#22914;&#20309;&#36890;&#36807;&#25968;&#25454;&#25913;&#21892;&#40065;&#26834;&#20915;&#31574;&#65292;&#24182;&#24320;&#21457;&#20102;&#31616;&#21333;&#26131;&#23454;&#29616;&#30340;&#25512;&#29702;&#26041;&#27861;&#20197;&#20445;&#35777;&#25913;&#21892;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20915;&#31574;&#32773;&#38754;&#20020;&#30001;&#25968;&#25454;&#29983;&#25104;&#36807;&#31243;(DGP)&#25511;&#21046;&#30340;&#19981;&#30830;&#23450;&#24615;&#65292;&#36825;&#20123;&#36807;&#31243;&#21487;&#33021;&#21482;&#23646;&#20110;&#19968;&#32452;&#29420;&#31435;&#20294;&#21487;&#33021;&#38750;&#30456;&#21516;&#20998;&#24067;&#30340;&#24207;&#21015;&#12290;&#40065;&#26834;&#20915;&#31574;&#22312;&#36825;&#20010;&#38598;&#21512;&#20013;&#26368;&#22823;&#21270;&#20915;&#31574;&#32773;&#23545;&#26368;&#22351;&#24773;&#20917;DGP&#30340;&#39044;&#26399;&#25910;&#30410;&#12290;&#26412;&#25991;&#30740;&#31350;&#20102;&#22914;&#20309;&#36890;&#36807;&#25968;&#25454;&#25913;&#21892;&#36825;&#20123;&#40065;&#26834;&#20915;&#31574;&#65292;&#20854;&#20013;&#25913;&#21892;&#36890;&#36807;&#30495;&#23454;DGP&#19979;&#30340;&#39044;&#26399;&#25910;&#30410;&#26469;&#34913;&#37327;&#12290;&#26412;&#25991;&#23436;&#20840;&#25551;&#36848;&#20102;&#22312;&#25152;&#26377;&#21487;&#33021;&#30340;DGP&#19979;&#20445;&#35777;&#36825;&#31181;&#25913;&#21892;&#30340;&#26102;&#38388;&#21644;&#26041;&#24335;&#65292;&#24182;&#24320;&#21457;&#20102;&#25512;&#29702;&#26041;&#27861;&#26469;&#23454;&#29616;&#23427;&#12290;&#36825;&#20123;&#25512;&#29702;&#26041;&#27861;&#26159;&#24517;&#38656;&#30340;&#65292;&#22240;&#20026;&#26412;&#25991;&#34920;&#26126;&#65292;&#24120;&#35265;&#30340;&#25512;&#29702;&#26041;&#27861;&#65288;&#22914;&#26368;&#22823;&#20284;&#28982;&#25110;&#36125;&#21494;&#26031;&#65289;&#36890;&#24120;&#26080;&#27861;&#23454;&#29616;&#36825;&#31181;&#25913;&#21892;&#12290;&#37325;&#35201;&#30340;&#26159;&#65292;&#24320;&#21457;&#30340;&#25512;&#29702;&#26041;&#27861;&#26159;&#36890;&#36807;&#23545;&#26631;&#20934;&#25512;&#29702;&#31243;&#24207;&#36827;&#34892;&#31616;&#21333;&#25193;&#23637;&#33719;&#24471;&#30340;&#65292;&#22240;&#27492;&#22312;&#23454;&#36341;&#20013;&#24456;&#23481;&#26131;&#23454;&#29616;&#12290;
&lt;/p&gt;
&lt;p&gt;
A decision-maker (DM) faces uncertainty governed by a data-generating process (DGP), which is only known to belong to a set of sequences of independent but possibly non-identical distributions. A robust decision maximizes the DM's expected payoff against the worst possible DGP in this set. This paper studies how such robust decisions can be improved with data, where improvement is measured by expected payoff under the true DGP. In this paper, I fully characterize when and how such an improvement can be guaranteed under all possible DGPs and develop inference methods to achieve it. These inference methods are needed because, as this paper shows, common inference methods (e.g., maximum likelihood or Bayesian) often fail to deliver such an improvement. Importantly, the developed inference methods are given by simple augmentations to standard inference procedures, and are thus easy to implement in practice.
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#22240;&#26524;&#26694;&#26550;&#65292;&#36890;&#36807;&#19968;&#20010;&#20013;&#38388;&#22788;&#29702;&#21464;&#37327;&#23558;&#32452;&#24046;&#24322;&#20998;&#35299;&#25104;&#19981;&#21516;&#30340;&#32452;&#25104;&#37096;&#20998;&#65292;&#24182;&#25552;&#20379;&#20102;&#19968;&#20010;&#26032;&#30340;&#35299;&#37322;&#21644;&#25913;&#21892;&#24046;&#24322;&#30340;&#26426;&#21046;&#12290;&#35813;&#26694;&#26550;&#25913;&#36827;&#20102;&#32463;&#20856;&#30340;&#20998;&#35299;&#26041;&#27861;&#65292;&#24182;&#19988;&#21487;&#20197;&#25351;&#23548;&#25919;&#31574;&#24178;&#39044;&#12290;</title><link>http://arxiv.org/abs/2306.16591</link><description>&lt;p&gt;
&#38750;&#21442;&#25968;&#22240;&#26524;&#20998;&#35299;&#32452;&#24046;&#24322;
&lt;/p&gt;
&lt;p&gt;
Nonparametric Causal Decomposition of Group Disparities. (arXiv:2306.16591v1 [stat.ME])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.16591
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#22240;&#26524;&#26694;&#26550;&#65292;&#36890;&#36807;&#19968;&#20010;&#20013;&#38388;&#22788;&#29702;&#21464;&#37327;&#23558;&#32452;&#24046;&#24322;&#20998;&#35299;&#25104;&#19981;&#21516;&#30340;&#32452;&#25104;&#37096;&#20998;&#65292;&#24182;&#25552;&#20379;&#20102;&#19968;&#20010;&#26032;&#30340;&#35299;&#37322;&#21644;&#25913;&#21892;&#24046;&#24322;&#30340;&#26426;&#21046;&#12290;&#35813;&#26694;&#26550;&#25913;&#36827;&#20102;&#32463;&#20856;&#30340;&#20998;&#35299;&#26041;&#27861;&#65292;&#24182;&#19988;&#21487;&#20197;&#25351;&#23548;&#25919;&#31574;&#24178;&#39044;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#22240;&#26524;&#26694;&#26550;&#26469;&#23558;&#32467;&#26524;&#20013;&#30340;&#32452;&#24046;&#24322;&#20998;&#35299;&#20026;&#20013;&#38388;&#22788;&#29702;&#21464;&#37327;&#12290;&#25105;&#20204;&#30340;&#26694;&#26550;&#25429;&#25417;&#20102;&#22522;&#32447;&#28508;&#22312;&#32467;&#26524;&#12289;&#22788;&#29702;&#21069;&#27839;&#12289;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#21644;&#22788;&#29702;&#36873;&#25321;&#30340;&#32452;&#24046;&#24322;&#30340;&#36129;&#29486;&#12290;&#36825;&#20010;&#26694;&#26550;&#20197;&#21453;&#20107;&#23454;&#30340;&#26041;&#24335;&#36827;&#34892;&#20102;&#25968;&#23398;&#34920;&#36798;&#65292;&#24182;&#19988;&#33021;&#22815;&#26041;&#20415;&#22320;&#25351;&#23548;&#25919;&#31574;&#24178;&#39044;&#12290;&#29305;&#21035;&#26159;&#65292;&#38024;&#23545;&#19981;&#21516;&#30340;&#22788;&#29702;&#36873;&#25321;&#36827;&#34892;&#30340;&#20998;&#35299;&#37096;&#20998;&#26159;&#29305;&#21035;&#26032;&#39062;&#30340;&#65292;&#25581;&#31034;&#20102;&#19968;&#31181;&#35299;&#37322;&#21644;&#25913;&#21892;&#24046;&#24322;&#30340;&#26032;&#26426;&#21046;&#12290;&#36825;&#20010;&#26694;&#26550;&#20197;&#22240;&#26524;&#26415;&#35821;&#37325;&#26032;&#23450;&#20041;&#20102;&#32463;&#20856;&#30340;Kitagawa-Blinder-Oaxaca&#20998;&#35299;&#65292;&#36890;&#36807;&#35299;&#37322;&#32452;&#24046;&#24322;&#32780;&#19981;&#26159;&#32452;&#25928;&#24212;&#26469;&#34917;&#20805;&#20102;&#22240;&#26524;&#20013;&#20171;&#20998;&#26512;&#65292;&#24182;&#35299;&#20915;&#20102;&#36817;&#26399;&#38543;&#26426;&#31561;&#21270;&#20998;&#35299;&#30340;&#27010;&#24565;&#22256;&#38590;&#12290;&#25105;&#20204;&#36824;&#25552;&#20379;&#20102;&#19968;&#20010;&#26465;&#20214;&#20998;&#35299;&#65292;&#20801;&#35768;&#30740;&#31350;&#20154;&#21592;&#22312;&#23450;&#20041;&#35780;&#20272;&#21644;&#30456;&#24212;&#30340;&#24178;&#39044;&#25514;&#26045;&#26102;&#32435;&#20837;&#21327;&#21464;&#37327;&#12290;
&lt;/p&gt;
&lt;p&gt;
We propose a causal framework for decomposing a group disparity in an outcome in terms of an intermediate treatment variable. Our framework captures the contributions of group differences in baseline potential outcome, treatment prevalence, average treatment effect, and selection into treatment. This framework is counterfactually formulated and readily informs policy interventions. The decomposition component for differential selection into treatment is particularly novel, revealing a new mechanism for explaining and ameliorating disparities. This framework reformulates the classic Kitagawa-Blinder-Oaxaca decomposition in causal terms, supplements causal mediation analysis by explaining group disparities instead of group effects, and resolves conceptual difficulties of recent random equalization decompositions. We also provide a conditional decomposition that allows researchers to incorporate covariates in defining the estimands and corresponding interventions. We develop nonparametric
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#22823;&#20869;&#24149;&#20132;&#26131;&#32773;&#19982;&#33021;&#22815;&#39044;&#27979;&#20854;&#35746;&#21333;&#30340;&#39640;&#39057;&#20132;&#26131;&#32773;&#20043;&#38388;&#30340;&#20114;&#21160;&#65292;&#21457;&#29616;&#39640;&#39057;&#20132;&#26131;&#32773;&#30340;&#31574;&#30053;&#19982;&#24211;&#23384;&#21388;&#24694;&#12289;&#39044;&#27979;&#20934;&#30830;&#24615;&#21644;&#24066;&#22330;&#27963;&#36291;&#24230;&#26377;&#20851;&#65292;&#32780;&#20854;&#34892;&#20026;&#23545;&#22823;&#20132;&#26131;&#32773;&#26377;&#19981;&#21516;&#30340;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2304.13985</link><description>&lt;p&gt;
&#39640;&#39057;&#39044;&#27979;&#20132;&#26131;&#21450;&#20854;&#24433;&#21709;&#65306;&#23567;&#20869;&#24149;&#20132;&#26131;&#32773;&#23545;&#21387;&#36724;&#32773;&#30340;&#24433;&#21709;
&lt;/p&gt;
&lt;p&gt;
High-frequency Anticipatory Trading and Its Influences: Small Informed Trader vs. Front-runner. (arXiv:2304.13985v1 [q-fin.TR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.13985
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22823;&#20869;&#24149;&#20132;&#26131;&#32773;&#19982;&#33021;&#22815;&#39044;&#27979;&#20854;&#35746;&#21333;&#30340;&#39640;&#39057;&#20132;&#26131;&#32773;&#20043;&#38388;&#30340;&#20114;&#21160;&#65292;&#21457;&#29616;&#39640;&#39057;&#20132;&#26131;&#32773;&#30340;&#31574;&#30053;&#19982;&#24211;&#23384;&#21388;&#24694;&#12289;&#39044;&#27979;&#20934;&#30830;&#24615;&#21644;&#24066;&#22330;&#27963;&#36291;&#24230;&#26377;&#20851;&#65292;&#32780;&#20854;&#34892;&#20026;&#23545;&#22823;&#20132;&#26131;&#32773;&#26377;&#19981;&#21516;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22823;&#20869;&#24149;&#20132;&#26131;&#32773;(IT)&#19982;&#33021;&#22815;&#39044;&#27979;&#21069;&#32773;&#21363;&#23558;&#21040;&#26469;&#35746;&#21333;&#30340;&#39640;&#39057;&#20132;&#26131;&#32773;(HFT)&#22312;&#25193;&#23637;&#30340;Kyle(1985)&#27169;&#22411;&#19979;&#30340;&#20114;&#21160;&#12290;&#35752;&#35770;&#20102;&#19981;&#21516;&#24773;&#20917;&#19979;&#30340;&#22343;&#34913;&#12290;&#20381;&#38752;&#36895;&#24230;&#20248;&#21183;&#65292;HFT&#24635;&#26159;&#25552;&#21069;&#21644;&#22823;&#21333;&#20132;&#26131;&#21516;&#21521;&#12290;&#28982;&#32780;&#65292;&#22905;&#26159;&#21542;&#25552;&#20379;&#27969;&#21160;&#24615;&#21462;&#20915;&#20110;&#22905;&#30340;&#24211;&#23384;&#21388;&#24694;&#12289;&#39044;&#27979;&#20934;&#30830;&#24615;&#21644;&#24066;&#22330;&#27963;&#36291;&#24230;&#12290;&#22905;&#21487;&#33021;&#20250;&#22238;&#39304;&#27969;&#21160;&#24615;(&#20805;&#24403;&#21387;&#36724;&#32773;)&#25110;&#32487;&#32493;&#24102;&#36208;&#27969;&#21160;&#24615;(&#27492;&#26102;&#25105;&#20204;&#31216;&#22905;&#20026;&#23567;IT)&#12290;&#23567;IT&#24635;&#26159;&#20260;&#23475;&#22823;&#20132;&#26131;&#32773;&#65292;&#32780;&#21387;&#36724;&#32773;&#21487;&#33021;&#20351;&#22905;&#21463;&#30410;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#24778;&#22855;&#22320;&#21457;&#29616;(1)&#22686;&#21152;HFT&#20449;&#21495;&#20013;&#30340;&#22122;&#22768;&#23454;&#38469;&#19978;&#21487;&#33021;&#20250;&#38477;&#20302;IT&#30340;&#21033;&#28070;;(2)&#23613;&#31649;&#25552;&#20379;&#27969;&#21160;&#24615;&#65292;&#21387;&#36724;&#32773;&#21487;&#33021;&#27604;&#23567;&#20869;&#24149;&#20132;&#26131;&#32773;&#26356;&#21152;&#20260;&#23475;IT&#12290;
&lt;/p&gt;
&lt;p&gt;
In this paper, the interactions between a large informed trader (IT, for short) and a high-frequency trader (HFT, for short) who can anticipate the former's incoming order are studied in an extended Kyle's (1985) model. Equilibria under various specific situations are discussed. Relying on the speed advantage, HFT always trades in the same direction as the large order in advance. However, whether or not she provides liquidity depends on her inventory aversion, the prediction accuracy, and the market activeness. She may supply liquidity back (act as a front-runner) or continue to take it away (in this case we call her a small IT). Small IT always harms the large trader while front-runner may benefit her. Besides, we find surprisingly that (1) increasing the noise in HFT's signal may in fact decrease IT's profit; (2) although providing liquidity, a front-runner may harm IT more than a small IT.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#35752;&#35770;&#20102;&#20855;&#26377;&#36873;&#27665;&#36164;&#26684;&#30340;&#31038;&#20250;&#31119;&#21033;&#20989;&#25968;&#65292;&#35777;&#26126;&#20102;&#22312;&#28385;&#36275;&#29305;&#23450;&#26465;&#20214;&#19979;&#30340;&#19977;&#20010;&#19981;&#21487;&#33021;&#24615;&#32467;&#26524;&#12290;</title><link>http://arxiv.org/abs/2304.06961</link><description>&lt;p&gt;
&#20855;&#26377;&#36873;&#27665;&#36164;&#26684;&#30340;&#31038;&#20250;&#31119;&#21033;&#20989;&#25968;&#65306;&#19981;&#21487;&#33021;&#24615;&#32467;&#26524;
&lt;/p&gt;
&lt;p&gt;
Social Welfare Functions with Voters Qualifications: Impossibility Results. (arXiv:2304.06961v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.06961
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#35752;&#35770;&#20102;&#20855;&#26377;&#36873;&#27665;&#36164;&#26684;&#30340;&#31038;&#20250;&#31119;&#21033;&#20989;&#25968;&#65292;&#35777;&#26126;&#20102;&#22312;&#28385;&#36275;&#29305;&#23450;&#26465;&#20214;&#19979;&#30340;&#19977;&#20010;&#19981;&#21487;&#33021;&#24615;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#32771;&#34385;&#38463;&#32599;&#31038;&#20250;&#31119;&#21033;&#20989;&#25968;&#65292;&#20854;&#20013;&#19968;&#20123;&#36873;&#27665;&#27809;&#26377;&#36164;&#26684;&#35780;&#20272;&#26576;&#20123;&#22791;&#36873;&#26041;&#26696;&#12290;&#22240;&#27492;&#65292;&#31038;&#20250;&#31119;&#21033;&#20989;&#25968;&#30340;&#36755;&#20837;&#26159;&#36873;&#27665;&#23545;&#20182;&#20204;&#26377;&#36164;&#26684;&#35780;&#20272;&#30340;&#22791;&#36873;&#26041;&#26696;&#30340;&#20559;&#22909;&#12290;&#25105;&#20204;&#30340;&#27169;&#22411;&#26159;&#23545;&#31561;&#35780;&#32423;&#27169;&#22411;&#30340;&#19968;&#33324;&#21270;&#65292;&#20854;&#20013;&#27599;&#20010;&#36873;&#27665;&#35780;&#20272;&#20854;&#20182;&#36873;&#27665;&#65288;&#38500;&#20102;&#20182;/&#22905;&#33258;&#24049;&#65289;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#20197;&#19979;&#19977;&#20010;&#19981;&#21487;&#33021;&#24615;&#32467;&#26524;&#12290;&#39318;&#20808;&#65292;&#22914;&#26524;&#19968;&#20010;&#20256;&#36882;&#24615;&#30340;&#31038;&#20250;&#31119;&#21033;&#20989;&#25968;&#28385;&#36275;&#19981;&#30456;&#20851;&#36873;&#25321;&#21644;&#24085;&#32047;&#25176;&#21407;&#21017;&#65292;&#21017;&#23384;&#22312;&#19968;&#20010;&#26377;&#36164;&#26684;&#35780;&#20272;&#25152;&#26377;&#22791;&#36873;&#26041;&#26696;&#30340;&#29420;&#35009;&#32773;&#12290;&#20854;&#27425;&#65292;&#22914;&#26524;&#33267;&#23569;&#26377;&#19968;&#20010;&#36873;&#27665;&#26377;&#36164;&#26684;&#35780;&#20272;&#25152;&#26377;&#22791;&#36873;&#26041;&#26696;&#65292;&#21017;&#23384;&#22312;&#19968;&#20010;&#28385;&#36275;&#24085;&#32047;&#25176;&#21407;&#21017;&#30340;&#20256;&#36882;&#20215;&#20540;&#20989;&#25968;&#12290;&#26368;&#21518;&#65292;&#22914;&#26524;&#27809;&#26377;&#36873;&#27665;&#26377;&#36164;&#26684;&#35780;&#20272;&#25152;&#26377;&#22791;&#36873;&#26041;&#26696;&#65292;&#21017;&#22312;&#28385;&#36275;&#24369;&#24085;&#32047;&#25176;&#21407;&#21017;&#21644;&#19981;&#30456;&#20851;&#36873;&#25321;&#30340;&#20256;&#36882;&#20215;&#20540;&#31038;&#20250;&#31119;&#21033;&#20989;&#25968;&#19979;&#65292;
&lt;/p&gt;
&lt;p&gt;
We consider the social welfare function a la Arrow, where some voters are not qualified to evaluate some alternatives. Thus, the inputs of the social welfare function are the preferences of voters on the alternatives that they are qualified to evaluate only. Our model is a generalization of the peer rating model, where each voter evaluates the other voters (except for himself/herself). We demonstrate the following three impossibility results. First, if a transitive valued social welfare function satisfies independence of irrelevant alternatives and the Pareto principle, then a dictator who is qualified to evaluate all alternatives exists. Second, a transitive valued function satisfying the Pareto principle exists if and only if at least one voter is qualified to evaluate all alternatives. Finally, if no voter is qualified to evaluate all alternatives, then under a transitive valued social welfare function satisfying the weak Pareto principle and independence of irrelevant alternatives,
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22240;&#23376;&#32593;&#32476;&#33258;&#22238;&#24402;&#65288;FNAR&#65289;&#27169;&#22411;&#65292;&#36890;&#36807;&#26032;&#39062;&#30340;&#20027;&#25104;&#20998;&#26041;&#27861;&#23558;&#32463;&#27982;&#20027;&#20307;&#20043;&#38388;&#30340;&#22810;&#31181;&#36830;&#25509;&#24635;&#32467;&#20026;&#36739;&#23569;&#30340;&#32593;&#32476;&#22240;&#23376;&#65292;&#21487;&#20197;&#24212;&#29992;&#20110;&#22797;&#26434;&#32593;&#32476;&#32467;&#26500;&#30340;&#26102;&#38388;&#24207;&#21015;&#12290;&#23454;&#35777;&#24212;&#29992;&#20013;&#20351;&#29992;FNAR&#27169;&#22411;&#30740;&#31350;&#20102;&#22269;&#23478;&#38388;GDP&#22686;&#38271;&#29575;&#30340;&#30456;&#20114;&#20381;&#36182;&#20851;&#31995;&#65292;&#24182;&#25552;&#20379;&#20102;&#23545;&#23439;&#35266;&#32463;&#27982;&#32593;&#32476;&#25928;&#24212;&#30340;&#20016;&#23500;&#25551;&#36848;&#12290;</title><link>http://arxiv.org/abs/2208.02925</link><description>&lt;p&gt;
&#22240;&#23376;&#32593;&#32476;&#33258;&#22238;&#24402;&#27169;&#22411;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Factor Network Autoregressions. (arXiv:2208.02925v3 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2208.02925
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22240;&#23376;&#32593;&#32476;&#33258;&#22238;&#24402;&#65288;FNAR&#65289;&#27169;&#22411;&#65292;&#36890;&#36807;&#26032;&#39062;&#30340;&#20027;&#25104;&#20998;&#26041;&#27861;&#23558;&#32463;&#27982;&#20027;&#20307;&#20043;&#38388;&#30340;&#22810;&#31181;&#36830;&#25509;&#24635;&#32467;&#20026;&#36739;&#23569;&#30340;&#32593;&#32476;&#22240;&#23376;&#65292;&#21487;&#20197;&#24212;&#29992;&#20110;&#22797;&#26434;&#32593;&#32476;&#32467;&#26500;&#30340;&#26102;&#38388;&#24207;&#21015;&#12290;&#23454;&#35777;&#24212;&#29992;&#20013;&#20351;&#29992;FNAR&#27169;&#22411;&#30740;&#31350;&#20102;&#22269;&#23478;&#38388;GDP&#22686;&#38271;&#29575;&#30340;&#30456;&#20114;&#20381;&#36182;&#20851;&#31995;&#65292;&#24182;&#25552;&#20379;&#20102;&#23545;&#23439;&#35266;&#32463;&#27982;&#32593;&#32476;&#25928;&#24212;&#30340;&#20016;&#23500;&#25551;&#36848;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#36866;&#29992;&#20110;&#20855;&#26377;&#22797;&#26434;&#32593;&#32476;&#32467;&#26500;&#30340;&#26102;&#38388;&#24207;&#21015;&#30340;&#22240;&#23376;&#32593;&#32476;&#33258;&#22238;&#24402;&#65288;FNAR&#65289;&#27169;&#22411;&#12290;&#35813;&#27169;&#22411;&#30340;&#31995;&#25968;&#21453;&#26144;&#20102;&#32463;&#27982;&#20027;&#20307;&#20043;&#38388;&#22810;&#31181;&#19981;&#21516;&#31867;&#22411;&#30340;&#36830;&#25509;&#65288;&#22810;&#23618;&#32593;&#32476;&#65289;&#65292;&#36890;&#36807;&#19968;&#31181;&#26032;&#39062;&#30340;&#22522;&#20110;&#24352;&#37327;&#30340;&#20027;&#25104;&#20998;&#26041;&#27861;&#65292;&#23558;&#36825;&#20123;&#36830;&#25509;&#24635;&#32467;&#20026;&#26356;&#23569;&#30340;&#32593;&#32476;&#30697;&#38453;&#65288;&#32593;&#32476;&#22240;&#23376;&#65289;&#12290;&#25105;&#20204;&#32473;&#20986;&#20102;&#20272;&#35745;&#22240;&#23376;&#21644;FNAR&#31995;&#25968;&#30340;&#19968;&#33268;&#24615;&#21644;&#28176;&#36817;&#27491;&#24577;&#24615;&#32467;&#26524;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#32467;&#21512;&#20102;&#20004;&#31181;&#19981;&#21516;&#30340;&#38477;&#32500;&#25216;&#26415;&#65292;&#24182;&#21487;&#24212;&#29992;&#20110;&#36229;&#39640;&#32500;&#25968;&#25454;&#38598;&#12290;&#22312;&#23454;&#35777;&#24212;&#29992;&#20013;&#65292;&#25105;&#20204;&#20351;&#29992;FNAR&#27169;&#22411;&#22522;&#20110;&#22810;&#31181;&#22269;&#38469;&#36152;&#26131;&#21644;&#37329;&#34701;&#32852;&#31995;&#26469;&#30740;&#31350;&#22269;&#23478;&#38388;GDP&#22686;&#38271;&#29575;&#30340;&#30456;&#20114;&#20381;&#36182;&#20851;&#31995;&#12290;&#35813;&#27169;&#22411;&#25552;&#20379;&#20102;&#23439;&#35266;&#32463;&#27982;&#32593;&#32476;&#25928;&#24212;&#30340;&#20016;&#23500;&#25551;&#36848;&#12290;
&lt;/p&gt;
&lt;p&gt;
We propose a factor network autoregressive (FNAR) model for time series with complex network structures. The coefficients of the model reflect many different types of connections between economic agents (multilayer network), which are summarized into a smaller number of network matrices (network factors) through a novel tensor-based principal component approach. We provide consistency and asymptotic normality results for the estimation of the factors and the coefficients of the FNAR. Our approach combines two different dimension-reduction techniques and can be applied to ultra-high-dimensional datasets. In an empirical application, we use the FNAR to investigate the cross-country interdependence of GDP growth rates based on a variety of international trade and financial linkages. The model provides a rich characterization of macroeconomic network effects.
&lt;/p&gt;</description></item></channel></rss>