<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#31561;&#32423;&#22238;&#24402;&#20013;&#24120;&#29992;&#30340;&#26041;&#24046;&#20272;&#35745;&#22120;&#22312;&#20272;&#35745;OLS&#20272;&#35745;&#22120;&#30340;&#28176;&#36827;&#26041;&#24046;&#26102;&#30340;&#19981;&#19968;&#33268;&#24615;&#38382;&#39064;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#19968;&#33268;&#20272;&#35745;&#22120;&#12290;&#24212;&#29992;&#26032;&#30340;&#25512;&#35770;&#26041;&#27861;&#22312;&#19977;&#20010;&#32463;&#39564;&#30740;&#31350;&#20013;&#21457;&#29616;&#65292;&#22522;&#20110;&#27491;&#30830;&#26041;&#24046;&#30340;&#20272;&#35745;&#22120;&#30340;&#32622;&#20449;&#21306;&#38388;&#21487;&#33021;&#27424;&#31934;&#30830;&#12290;</title><link>http://arxiv.org/abs/2310.15512</link><description>&lt;p&gt;
&#25512;&#35770;&#29992;&#20110;&#31561;&#32423;&#22238;&#24402;
&lt;/p&gt;
&lt;p&gt;
Inference for Rank-Rank Regressions. (arXiv:2310.15512v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.15512
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#31561;&#32423;&#22238;&#24402;&#20013;&#24120;&#29992;&#30340;&#26041;&#24046;&#20272;&#35745;&#22120;&#22312;&#20272;&#35745;OLS&#20272;&#35745;&#22120;&#30340;&#28176;&#36827;&#26041;&#24046;&#26102;&#30340;&#19981;&#19968;&#33268;&#24615;&#38382;&#39064;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#19968;&#33268;&#20272;&#35745;&#22120;&#12290;&#24212;&#29992;&#26032;&#30340;&#25512;&#35770;&#26041;&#27861;&#22312;&#19977;&#20010;&#32463;&#39564;&#30740;&#31350;&#20013;&#21457;&#29616;&#65292;&#22522;&#20110;&#27491;&#30830;&#26041;&#24046;&#30340;&#20272;&#35745;&#22120;&#30340;&#32622;&#20449;&#21306;&#38388;&#21487;&#33021;&#27424;&#31934;&#30830;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#31561;&#32423;&#22238;&#24402;&#20013;&#65292;&#26012;&#29575;&#31995;&#25968;&#26159;&#34913;&#37327;&#20195;&#38469;&#27969;&#21160;&#24615;&#30340;&#24120;&#29992;&#25351;&#26631;&#65292;&#20363;&#22914;&#22312;&#23376;&#22899;&#25910;&#20837;&#31561;&#32423;&#19982;&#29238;&#27597;&#25910;&#20837;&#31561;&#32423;&#22238;&#24402;&#20013;&#12290;&#26412;&#25991;&#39318;&#20808;&#25351;&#20986;&#65292;&#24120;&#29992;&#30340;&#26041;&#24046;&#20272;&#35745;&#22120;&#22914;&#21516;&#26041;&#24046;&#20272;&#35745;&#22120;&#25110;&#40065;&#26834;&#26041;&#24046;&#20272;&#35745;&#22120;&#26410;&#33021;&#19968;&#33268;&#20272;&#35745;OLS&#20272;&#35745;&#22120;&#22312;&#31561;&#32423;&#22238;&#24402;&#20013;&#30340;&#28176;&#36827;&#26041;&#24046;&#12290;&#25105;&#20204;&#34920;&#26126;&#65292;&#36825;&#20123;&#20272;&#35745;&#22120;&#30340;&#27010;&#29575;&#26497;&#38480;&#21487;&#33021;&#36807;&#22823;&#25110;&#36807;&#23567;&#65292;&#21462;&#20915;&#20110;&#23376;&#22899;&#25910;&#20837;&#21644;&#29238;&#27597;&#25910;&#20837;&#30340;&#32852;&#21512;&#20998;&#24067;&#20989;&#25968;&#30340;&#24418;&#29366;&#12290;&#20854;&#27425;&#65292;&#25105;&#20204;&#23548;&#20986;&#20102;&#31561;&#32423;&#22238;&#24402;&#30340;&#19968;&#33324;&#28176;&#36827;&#29702;&#35770;&#65292;&#24182;&#25552;&#20379;&#20102;OLS&#20272;&#35745;&#22120;&#28176;&#36827;&#26041;&#24046;&#30340;&#19968;&#33268;&#20272;&#35745;&#22120;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#23558;&#28176;&#36827;&#29702;&#35770;&#25193;&#23637;&#21040;&#20854;&#20182;&#32463;&#39564;&#24037;&#20316;&#20013;&#28041;&#21450;&#31561;&#32423;&#30340;&#22238;&#24402;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#23558;&#26032;&#30340;&#25512;&#35770;&#26041;&#27861;&#24212;&#29992;&#20110;&#19977;&#20010;&#32463;&#39564;&#30740;&#31350;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#22522;&#20110;&#27491;&#30830;&#26041;&#24046;&#30340;&#20272;&#35745;&#22120;&#30340;&#32622;&#20449;&#21306;&#38388;&#26377;&#26102;&#21487;&#33021;&#27424;&#31934;&#30830;&#12290;
&lt;/p&gt;
&lt;p&gt;
Slope coefficients in rank-rank regressions are popular measures of intergenerational mobility, for instance in regressions of a child's income rank on their parent's income rank. In this paper, we first point out that commonly used variance estimators such as the homoskedastic or robust variance estimators do not consistently estimate the asymptotic variance of the OLS estimator in a rank-rank regression. We show that the probability limits of these estimators may be too large or too small depending on the shape of the copula of child and parent incomes. Second, we derive a general asymptotic theory for rank-rank regressions and provide a consistent estimator of the OLS estimator's asymptotic variance. We then extend the asymptotic theory to other regressions involving ranks that have been used in empirical work. Finally, we apply our new inference methods to three empirical studies. We find that the confidence intervals based on estimators of the correct variance may sometimes be sub
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#38024;&#23545;&#24179;&#28369;&#38382;&#39064;&#65292;&#20351;&#29992;&#20840;&#23616;&#31209;&#26465;&#20214;&#19979;&#30340;&#29305;&#23450;&#31639;&#27861;&#35777;&#26126;&#20102;&#38750;&#20984;&#32467;&#26500;&#19979;&#30340;&#36890;&#29992;&#30697;&#20272;&#35745;&#21644;&#27169;&#25311;&#30697;&#20272;&#35745;&#26159;&#20840;&#23616;&#25910;&#25947;&#30340;&#12290;</title><link>http://arxiv.org/abs/2304.14386</link><description>&lt;p&gt;
&#26080;&#38656;&#20984;&#24615;&#65306;&#24179;&#28369;&#26102;&#21051;&#26465;&#20214;&#27169;&#22411;&#30340;&#20272;&#35745;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Convexity Not Required: Estimation of Smooth Moment Condition Models. (arXiv:2304.14386v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.14386
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#38024;&#23545;&#24179;&#28369;&#38382;&#39064;&#65292;&#20351;&#29992;&#20840;&#23616;&#31209;&#26465;&#20214;&#19979;&#30340;&#29305;&#23450;&#31639;&#27861;&#35777;&#26126;&#20102;&#38750;&#20984;&#32467;&#26500;&#19979;&#30340;&#36890;&#29992;&#30697;&#20272;&#35745;&#21644;&#27169;&#25311;&#30697;&#20272;&#35745;&#26159;&#20840;&#23616;&#25910;&#25947;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24191;&#20041;&#30697;&#21450;&#27169;&#25311;&#30697;&#27861;&#24120;&#29992;&#20110;&#20272;&#35745;&#32467;&#26500;&#24615;&#32463;&#27982;&#27169;&#22411;&#12290;&#28982;&#32780;&#65292;&#30001;&#20110;&#30456;&#24212;&#30340;&#30446;&#26631;&#20989;&#25968;&#38750;&#20984;&#65292;&#20248;&#21270;&#24448;&#24448;&#20855;&#26377;&#25361;&#25112;&#24615;&#12290;&#26412;&#25991;&#38024;&#23545;&#24179;&#28369;&#38382;&#39064;&#65292;&#35777;&#26126;&#20102;&#19981;&#38656;&#35201;&#20984;&#24615;&#65306;&#22312;&#28041;&#21450;&#26679;&#26412;&#30697;&#38453;&#38597;&#21487;&#27604;&#30340;&#20840;&#23616;&#31209;&#26465;&#20214;&#19979;&#65292;&#26576;&#20123;&#31639;&#27861;&#26159;&#20840;&#23616;&#25910;&#25947;&#30340;&#12290;&#36825;&#20123;&#31639;&#27861;&#21253;&#25324;&#26799;&#24230;&#19979;&#38477;&#21644;&#39640;&#26031;&#29275;&#39039;&#31639;&#27861;&#21450;&#38656;&#35201;&#36866;&#24403;&#36873;&#25321;&#35843;&#25972;&#21442;&#25968;&#12290;&#35813;&#32467;&#26524;&#20855;&#26377;&#40065;&#26834;&#24615;&#65292;&#23545;&#38750;&#20984;&#24615;&#12289;&#21333;&#19968;&#38750;&#32447;&#24615;&#20877;&#21442;&#25968;&#21270;&#20197;&#21450;&#36866;&#24230;&#30340;&#38169;&#35823;&#24314;&#27169;&#20855;&#26377;&#40065;&#26834;&#24615;&#12290;&#30456;&#27604;&#20043;&#19979;&#65292;&#30001;&#20110;&#38750;&#20984;&#24615;&#65292;&#29275;&#39039;-&#25289;&#22827;&#26862;&#21644;&#25311;&#29275;&#39039;&#26041;&#27861;&#21487;&#33021;&#26080;&#27861;&#25910;&#25947;&#12290;&#31616;&#21333;&#30340;&#20363;&#23376;&#35828;&#26126;&#20102;&#19968;&#20010;&#28385;&#36275;&#21069;&#36848;&#31209;&#26465;&#20214;&#30340;&#38750;&#20984; GMM &#20272;&#35745;&#38382;&#39064;&#12290;&#23545;&#38543;&#26426;&#31995;&#25968;&#38656;&#27714;&#20272;&#35745;&#21644;&#33033;&#20914;&#21709;&#24212;&#21305;&#37197;&#30340;&#23454;&#35777;&#24212;&#29992;&#36827;&#19968;&#27493;&#35828;&#26126;&#20102;&#26412;&#25991;&#30340;&#30740;&#31350;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
Generalized and Simulated Method of Moments are often used to estimate structural Economic models. Yet, it is commonly reported that optimization is challenging because the corresponding objective function is non-convex. For smooth problems, this paper shows that convexity is not required: under a global rank condition involving the Jacobian of the sample moments, certain algorithms are globally convergent. These include a gradient-descent and a Gauss-Newton algorithm with appropriate choice of tuning parameters. The results are robust to 1) non-convexity, 2) one-to-one non-linear reparameterizations, and 3) moderate misspecification. In contrast, Newton-Raphson and quasi-Newton methods can fail to converge for the same estimation because of non-convexity. A simple example illustrates a non-convex GMM estimation problem that satisfies the aforementioned rank condition. Empirical applications to random coefficient demand estimation and impulse response matching further illustrate the re
&lt;/p&gt;</description></item></channel></rss>