<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#21306;&#22359;&#38142;&#24314;&#35774;&#20013;&#30340;&#38598;&#20013;&#21270;&#38382;&#39064;&#20197;&#21450;&#25552;&#26696;&#32773;-&#24314;&#35774;&#32773;&#20998;&#31163;&#23545;&#21435;&#20013;&#24515;&#21270;&#30340;&#24433;&#21709;&#65292;&#21457;&#23637;&#20102;&#25968;&#23398;&#27169;&#22411;&#21644;&#32467;&#26524;&#26469;&#22238;&#31572;&#36825;&#20123;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2401.12120</link><description>&lt;p&gt;
&#21306;&#22359;&#38142;&#24314;&#35774;&#20013;&#30340;&#38598;&#20013;&#21270;&#21644;&#25552;&#26696;&#32773;-&#24314;&#35774;&#32773;&#20998;&#31163;
&lt;/p&gt;
&lt;p&gt;
Centralization in Block Building and Proposer-Builder Separation. (arXiv:2401.12120v1 [cs.GT])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.12120
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#21306;&#22359;&#38142;&#24314;&#35774;&#20013;&#30340;&#38598;&#20013;&#21270;&#38382;&#39064;&#20197;&#21450;&#25552;&#26696;&#32773;-&#24314;&#35774;&#32773;&#20998;&#31163;&#23545;&#21435;&#20013;&#24515;&#21270;&#30340;&#24433;&#21709;&#65292;&#21457;&#23637;&#20102;&#25968;&#23398;&#27169;&#22411;&#21644;&#32467;&#26524;&#26469;&#22238;&#31572;&#36825;&#20123;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#26088;&#22312;&#20005;&#26684;&#23457;&#35270;&#20851;&#20110;&#21306;&#22359;&#38142;&#24314;&#35774;&#20013;&#30340;&#38598;&#20013;&#21270;&#65288;&#20363;&#22914;&#65292;MEV&#21644;&#31169;&#23494;&#35746;&#21333;&#27969;&#65289;&#20197;&#21450;&#39564;&#35777;&#32773;&#23558;&#24314;&#35774;&#22359;&#22806;&#21253;&#32473;&#19987;&#23478;&#65288;&#21363;&#25552;&#26696;&#32773;-&#24314;&#35774;&#32773;&#20998;&#31163;&#65289;&#30340;&#24120;&#35268;&#35266;&#28857;&#65306;1.&#25216;&#33021;&#21644;&#30693;&#35782;&#30340;&#24322;&#36136;&#24615;&#26159;&#21542;&#19981;&#21487;&#36991;&#20813;&#22320;&#23548;&#33268;&#38598;&#20013;&#21270;&#65311;2.&#25552;&#26696;&#32773;-&#24314;&#35774;&#32773;&#20998;&#31163;&#26159;&#21542;&#28040;&#38500;&#20102;&#24322;&#36136;&#24615;&#24182;&#20445;&#25345;&#20102;&#25552;&#26696;&#32773;&#30340;&#21435;&#20013;&#24515;&#21270;&#65311;&#26412;&#25991;&#24320;&#21457;&#20102;&#25968;&#23398;&#27169;&#22411;&#21644;&#32467;&#26524;&#65292;&#20026;&#36825;&#20123;&#38382;&#39064;&#25552;&#20379;&#20102;&#31572;&#26696;&#65306;1.&#22312;&#20855;&#26377;&#20869;&#29983;&#36136;&#25276;&#12289;&#24322;&#36136;&#24615;&#21306;&#22359;&#29983;&#20135;&#32773;&#22870;&#21169;&#21644;&#36136;&#25276;&#25104;&#26412;&#30340;&#21338;&#24328;&#29702;&#35770;&#27169;&#22411;&#20013;&#65292;&#25105;&#20204;&#37327;&#21270;&#20102;&#24322;&#36136;&#24615;&#22870;&#21169;&#23548;&#33268;&#22343;&#34913;&#36136;&#25276;&#20998;&#24067;&#38598;&#20013;&#31243;&#24230;&#30340;&#31243;&#24230;&#12290;2.&#22312;&#19968;&#20010;&#38543;&#26426;&#27169;&#22411;&#20013;&#65292;&#24322;&#36136;&#24615;&#21306;&#22359;&#29983;&#20135;&#32773;&#21453;&#22797;&#23558;&#22870;&#21169;&#25237;&#36164;&#21040;&#36136;&#25276;&#20013;&#65292;&#25105;&#20204;&#37327;&#21270;&#20102;&#36136;&#25276;&#38598;&#20013;&#31243;&#24230;&#19982;&#21306;&#22359;&#29983;&#20135;&#32773;&#24322;&#36136;&#24615;&#20043;&#38388;&#30340;&#20851;&#31995;&#12290;
&lt;/p&gt;
&lt;p&gt;
The goal of this paper is to rigorously interrogate conventional wisdom about centralization in block-building (due to, e.g., MEV and private order flow) and the outsourcing of block-building by validators to specialists (i.e., proposer-builder separation):  1. Does heterogeneity in skills and knowledge across block producers inevitably lead to centralization?  2. Does proposer-builder separation eliminate heterogeneity and preserve decentralization among proposers?  This paper develops mathematical models and results that offer answers to these questions:  1. In a game-theoretic model with endogenous staking, heterogeneous block producer rewards, and staking costs, we quantify the extent to which heterogeneous rewards lead to concentration in the equilibrium staking distribution.  2. In a stochastic model in which heterogeneous block producers repeatedly reinvest rewards into staking, we quantify, as a function of the block producer heterogeneity, the rate at which stake concentrates 
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25581;&#31034;&#20102;&#32654;&#22269;&#32463;&#27982;&#20013;&#36164;&#26412;&#32593;&#32476;&#30340;&#37325;&#35201;&#25351;&#26631;&#65292;&#21457;&#29616;&#35813;&#32593;&#32476;&#20855;&#26377;&#24130;&#24459;&#20998;&#24067;&#30340;&#20837;&#31449;&#21644;&#20986;&#31449;&#38142;&#25509;&#65292;&#23545;&#20110;&#23376;&#32593;&#32476;&#12289;&#20027;&#36830;&#25509;&#32452;&#20214;&#21644;&#29305;&#23450;&#34892;&#19994;&#30456;&#20851;&#30340;&#36793;&#32536;&#23376;&#32593;&#32476;&#37117;&#36866;&#29992;&#65292;&#19988;&#25972;&#20307;&#19978;&#38598;&#20013;&#31995;&#25968;&#20272;&#35745;&#31283;&#23450;&#12290;&#19982;&#20854;&#20182;&#20855;&#26377;&#24130;&#24459;&#20998;&#24067;&#38142;&#25509;&#23494;&#24230;&#30340;&#32593;&#32476;&#19981;&#21516;&#65292;&#35813;&#32593;&#32476;&#20027;&#35201;&#26159;&#19968;&#26869;&#26641;&#65292;&#24182;&#19988;&#30452;&#24452;&#30456;&#24046;&#19968;&#20010;&#25968;&#37327;&#32423;&#12290;</title><link>http://arxiv.org/abs/2401.12118</link><description>&lt;p&gt;
&#32654;&#22269;&#32463;&#27982;&#30340;&#36164;&#26412;&#32593;&#32476;&#25351;&#26631;
&lt;/p&gt;
&lt;p&gt;
Measures of the Capital Network of the U.S. Economy. (arXiv:2401.12118v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.12118
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25581;&#31034;&#20102;&#32654;&#22269;&#32463;&#27982;&#20013;&#36164;&#26412;&#32593;&#32476;&#30340;&#37325;&#35201;&#25351;&#26631;&#65292;&#21457;&#29616;&#35813;&#32593;&#32476;&#20855;&#26377;&#24130;&#24459;&#20998;&#24067;&#30340;&#20837;&#31449;&#21644;&#20986;&#31449;&#38142;&#25509;&#65292;&#23545;&#20110;&#23376;&#32593;&#32476;&#12289;&#20027;&#36830;&#25509;&#32452;&#20214;&#21644;&#29305;&#23450;&#34892;&#19994;&#30456;&#20851;&#30340;&#36793;&#32536;&#23376;&#32593;&#32476;&#37117;&#36866;&#29992;&#65292;&#19988;&#25972;&#20307;&#19978;&#38598;&#20013;&#31995;&#25968;&#20272;&#35745;&#31283;&#23450;&#12290;&#19982;&#20854;&#20182;&#20855;&#26377;&#24130;&#24459;&#20998;&#24067;&#38142;&#25509;&#23494;&#24230;&#30340;&#32593;&#32476;&#19981;&#21516;&#65292;&#35813;&#32593;&#32476;&#20027;&#35201;&#26159;&#19968;&#26869;&#26641;&#65292;&#24182;&#19988;&#30452;&#24452;&#30456;&#24046;&#19968;&#20010;&#25968;&#37327;&#32423;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22823;&#32422;&#26377;&#20004;&#30334;&#19975;&#23478;&#32654;&#22269;&#20225;&#19994;&#21644;&#21512;&#20249;&#20225;&#19994;&#19982;&#24444;&#27492;&#21644;&#20154;&#31867;&#25237;&#36164;&#32773;&#20043;&#38388;&#36890;&#36807;&#32422;1500&#19975;&#20010;&#25152;&#26377;-&#23376;&#20844;&#21496;&#38142;&#25509;&#30456;&#20114;&#36830;&#25509;&#12290;&#31867;&#20284;&#30340;&#31038;&#20132;&#32593;&#32476;&#65292;&#22914;&#20844;&#21496;&#33891;&#20107;&#20250;&#30340;&#25104;&#21592;&#21644;&#31038;&#20132;&#26500;&#24314;&#30340;&#31995;&#32479;&#65292;&#22914;&#20114;&#32852;&#32593;&#38142;&#25509;&#32593;&#32476;&#65292;&#37117;&#26159;&#8220;&#23567;&#19990;&#30028;&#8221;&#65292;&#36825;&#24847;&#21619;&#30528;&#32593;&#32476;&#30452;&#24452;&#36739;&#23567;&#65292;&#38142;&#25509;&#23494;&#24230;&#21576;&#24130;&#24459;&#20998;&#24067;&#65292;&#20294;&#36825;&#20123;&#23646;&#24615;&#23578;&#26410;&#34987;&#29992;&#20110;&#34913;&#37327;&#20844;&#21496;&#23454;&#20307;&#32593;&#32476;&#12290;&#26412;&#25991;&#34920;&#26126;&#65292;&#26080;&#35770;&#26159;&#20837;&#31449;&#38142;&#25509;&#36824;&#26159;&#20986;&#31449;&#38142;&#25509;&#65292;&#37117;&#26174;&#31034;&#20986;&#24130;&#24459;&#20998;&#24067;&#65292;&#24182;&#19988;&#20855;&#26377;&#21487;&#20272;&#35745;&#30340;&#38598;&#20013;&#31995;&#25968;&#65292;&#25972;&#20307;&#32780;&#35328;&#65292;&#23545;&#20110;&#20165;&#21253;&#25324;&#21830;&#21153;&#23454;&#20307;&#30340;&#23376;&#32593;&#32476;&#65292;&#20165;&#23545;&#20110;&#32593;&#32476;&#30340;&#20027;&#36830;&#25509;&#32452;&#20214;&#65292;&#20197;&#21450;&#23545;&#20110;&#19982;&#29305;&#23450;&#34892;&#19994;&#30456;&#20851;&#30340;&#36793;&#32536;&#23376;&#32593;&#32476;&#65292;&#25152;&#26377;&#24180;&#20221;2009-2021&#37117;&#36866;&#29992;&#20110;&#36890;&#24120;&#36739;&#31364;&#30340;&#32622;&#20449;&#21306;&#38388;&#12290;&#19982;&#20854;&#20182;&#20855;&#26377;&#24130;&#24459;&#20998;&#24067;&#38142;&#25509;&#23494;&#24230;&#30340;&#32593;&#32476;&#30456;&#27604;&#65292;&#35813;&#32593;&#32476;&#20027;&#35201;&#26159;&#19968;&#26869;&#26641;&#65292;&#24182;&#19988;&#30452;&#24452;&#30456;&#24046;&#19968;&#20010;&#25968;&#37327;&#32423;&#12290;
&lt;/p&gt;
&lt;p&gt;
About two million U.S. corporations and partnerships are linked to each other and human investors by about 15 million owner-subsidiary links. Comparable social networks such as corporate board memberships and socially-built systems such as the network of Internet links are "small worlds," meaning a network with a small diameter and link densities with a power-law distribution, but these properties had not yet been measured for the business entity network. This article shows that both inbound links and outbound links display a power-law distribution with a coefficient of concentration estimable to within a generally narrow confidence interval, overall, for subnetworks including only business entities, only for the great connected component of the network, and in subnetworks with edges associated with certain industries, for all years 2009-2021. In contrast to other networks with power-law distributed link densities, the network is mostly a tree, and has a diameter an order of magnitude 
&lt;/p&gt;</description></item><item><title>Ward&#31561;&#20154;&#22312;&#12298;Plos-One 2016&#12299;&#24180;&#35770;&#25991;&#20013;&#21457;&#29616;&#20102;GDP&#22686;&#38271;&#19982;&#29615;&#22659;&#24433;&#21709;&#20043;&#38388;&#21482;&#23384;&#22312;&#30456;&#23545;&#35299;&#32806;&#29616;&#35937;&#65292;&#24182;&#25351;&#20986;&#26410;&#26469;&#30340;&#32477;&#23545;&#35299;&#32806;&#26159;&#19981;&#21487;&#33021;&#30340;&#12290;&#28982;&#32780;&#65292;&#20182;&#20204;&#22312;&#25968;&#25454;&#25910;&#38598;&#36807;&#31243;&#20013;&#23384;&#22312;&#20851;&#38190;&#38169;&#35823;&#65292;&#24433;&#21709;&#20102;&#32467;&#26524;&#30340;&#20934;&#30830;&#24615;&#12290;</title><link>http://arxiv.org/abs/2401.12100</link><description>&lt;p&gt;
&#20851;&#20110;Ward et al Plos-One 2016&#24180;&#35770;&#25991;&#12298;&#33021;&#21542;&#23558;GDP&#22686;&#38271;&#19982;&#29615;&#22659;&#24433;&#21709;&#35299;&#32806;&#12299;&#30340;&#24230;&#37327;&#38382;&#39064;&#65306;&#19968;&#20221;&#27491;&#24335;&#35780;&#35770;
&lt;/p&gt;
&lt;p&gt;
Metrics matter, a Formal comment on Ward et al Plos-One 2016 paper : Is decoupling GDP growth from environmental impact possible?. (arXiv:2401.12100v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.12100
&lt;/p&gt;
&lt;p&gt;
Ward&#31561;&#20154;&#22312;&#12298;Plos-One 2016&#12299;&#24180;&#35770;&#25991;&#20013;&#21457;&#29616;&#20102;GDP&#22686;&#38271;&#19982;&#29615;&#22659;&#24433;&#21709;&#20043;&#38388;&#21482;&#23384;&#22312;&#30456;&#23545;&#35299;&#32806;&#29616;&#35937;&#65292;&#24182;&#25351;&#20986;&#26410;&#26469;&#30340;&#32477;&#23545;&#35299;&#32806;&#26159;&#19981;&#21487;&#33021;&#30340;&#12290;&#28982;&#32780;&#65292;&#20182;&#20204;&#22312;&#25968;&#25454;&#25910;&#38598;&#36807;&#31243;&#20013;&#23384;&#22312;&#20851;&#38190;&#38169;&#35823;&#65292;&#24433;&#21709;&#20102;&#32467;&#26524;&#30340;&#20934;&#30830;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
Ward et al. (2016) Plos-One&#35770;&#25991;&#26159;&#35299;&#32806;&#25991;&#29486;&#20013;&#19968;&#31687;&#37325;&#35201;&#19988;&#34987;&#24191;&#27867;&#24341;&#29992;&#30340;&#35770;&#25991;&#12290;&#20316;&#32773;&#22312;&#19990;&#30028;&#33539;&#22260;&#20869;&#20197;&#21450;&#36873;&#23450;&#22269;&#23478;&#30340;1990-2015&#24180;&#38388;&#65292;&#25552;&#20379;&#20102;&#26448;&#26009;&#21644;&#33021;&#28304;&#28040;&#32791;&#19982;GDP&#22686;&#38271;&#30340;&#35777;&#25454;&#12290;&#20182;&#20204;&#21457;&#29616;&#21482;&#23384;&#22312;&#30456;&#23545;&#35299;&#32806;&#29616;&#35937;&#65292;&#23548;&#33268;&#20182;&#20204;&#30340;&#26680;&#24515;&#35266;&#28857;&#26159;&#26410;&#26469;&#30340;&#32477;&#23545;&#35299;&#32806;&#26159;&#19981;&#21487;&#33021;&#30340;&#12290;&#28982;&#32780;&#65292;&#20316;&#32773;&#22312;&#25910;&#38598;&#25968;&#25454;&#36807;&#31243;&#20013;&#23384;&#22312;&#20004;&#20010;&#20851;&#38190;&#38169;&#35823;&#65306;GDP&#25968;&#25454;&#20351;&#29992;&#30340;&#26159;&#24403;&#21069;&#20215;&#26684;&#65292;&#21253;&#25324;&#36890;&#36135;&#33192;&#32960;&#65292;&#24182;&#19988;&#20182;&#20204;&#30340;&#20840;&#29699;&#26448;&#26009;&#20351;&#29992;&#25968;&#25454;&#26159;&#21270;&#30707;&#33021;&#28304;&#26448;&#26009;&#30340;&#24635;&#36136;&#37327;&#12290;&#20005;&#26684;&#26469;&#35828;&#65292;GDP&#25968;&#25454;&#24212;&#35813;&#20351;&#29992;&#24658;&#23450;&#20215;&#26684;&#20197;&#20415;&#22312;&#19981;&#21516;&#26102;&#26399;&#36827;&#34892;&#27604;&#36739;&#65292;&#24182;&#19988;&#32463;&#27982;&#20307;&#30340;&#29289;&#36136;&#25237;&#20837;&#24212;&#35813;&#26159;&#30719;&#20135;&#21407;&#26448;&#26009;&#30340;&#24635;&#21644;&#12290;&#20462;&#27491;&#36825;&#20123;&#38169;&#35823;&#21518;&#65292;&#25105;&#20204;&#21457;&#29616;&#33021;&#28304;-GDP&#30456;&#23545;&#35299;&#32806;&#30340;&#27700;&#24179;&#35201;&#23567;&#24471;&#22810;&#65292;&#24182;&#19988;&#22312;&#20840;&#29699;&#33539;&#22260;&#20869;&#27809;&#26377;&#20219;&#20309;&#26448;&#26009;-GDP&#35299;&#32806;&#12290;&#25105;&#20204;&#36890;&#36807;&#21521;1900-1990&#24180;&#28155;&#21152;&#25968;&#25454;&#26469;&#39564;&#35777;&#36825;&#20123;&#26032;&#32467;&#26524;&#65292;&#20174;&#32780;&#25552;&#20379;&#20102;&#19968;&#20010;&#26356;&#38271;&#30340;&#26102;&#38388;&#24207;&#21015;&#65292;&#24182;&#19988;&#33719;&#24471;&#20102;&#19968;&#33268;&#30340;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
The Ward et al. (2016) Plos-One paper is an important, heavily-cited paper in the decoupling literature. The authors present evidence of 1990-2015 growth in material and energy consumption and GDP at a world level, and for selected countries. They find only relative decoupling has occurred, leading to their central claim that future absolute decoupling is implausible. However, the authors have made two key errors in their collected data: GDP data is in current prices which includes inflation, and their global material use data is the total mass of fossil energy materials. Strictly, GDP data should be in constant prices to allow for its comparison over time, and material inputs to an economy should be the sum of mineral raw materials. Amending for these errors, we find much smaller levels of energy-GDP relative decoupling, and no materials-GDP decoupling at all at a global level. We check these new results by adding data for 1900-1990 to provide a longer time series, and find consistent
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#22312;&#39640;&#39057;&#25968;&#25454;&#24773;&#20917;&#19979;&#20351;&#29992;&#21512;&#25104;&#25511;&#21046;&#26041;&#27861;&#30340;&#25361;&#25112;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#32858;&#21512;&#25968;&#25454;&#30340;&#26041;&#27861;&#26469;&#32531;&#35299;&#36825;&#20123;&#38382;&#39064;&#65292;&#24182;&#32473;&#20986;&#20102;&#26435;&#37325;&#30340;&#26465;&#20214;&#20197;&#24179;&#34913;&#32454;&#20998;&#21644;&#32858;&#21512;&#24207;&#21015;&#12290;</title><link>http://arxiv.org/abs/2401.12084</link><description>&lt;p&gt;
&#29992;&#20110;&#21512;&#25104;&#25511;&#21046;&#26041;&#27861;&#30340;&#26102;&#38388;&#32858;&#21512;
&lt;/p&gt;
&lt;p&gt;
Temporal Aggregation for the Synthetic Control Method. (arXiv:2401.12084v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.12084
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#22312;&#39640;&#39057;&#25968;&#25454;&#24773;&#20917;&#19979;&#20351;&#29992;&#21512;&#25104;&#25511;&#21046;&#26041;&#27861;&#30340;&#25361;&#25112;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#32858;&#21512;&#25968;&#25454;&#30340;&#26041;&#27861;&#26469;&#32531;&#35299;&#36825;&#20123;&#38382;&#39064;&#65292;&#24182;&#32473;&#20986;&#20102;&#26435;&#37325;&#30340;&#26465;&#20214;&#20197;&#24179;&#34913;&#32454;&#20998;&#21644;&#32858;&#21512;&#24207;&#21015;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21512;&#25104;&#25511;&#21046;&#26041;&#27861;&#65288;SCM&#65289;&#26159;&#19968;&#31181;&#22312;&#38754;&#26495;&#25968;&#25454;&#20013;&#20272;&#35745;&#27835;&#30103;&#23545;&#21333;&#20010;&#21333;&#20301;&#24433;&#21709;&#30340;&#27969;&#34892;&#26041;&#27861;&#12290;&#39640;&#39057;&#25968;&#25454;&#65288;&#20363;&#22914;&#27599;&#26376;&#19982;&#27599;&#24180;&#65289;&#20250;&#24102;&#26469;&#20004;&#20010;&#25361;&#25112;&#65306;&#65288;1&#65289;&#36890;&#24120;&#26356;&#38590;&#23454;&#29616;&#33391;&#22909;&#30340;&#27835;&#30103;&#21069;&#36866;&#37197;&#65307;&#65288;2&#65289;&#26356;&#23481;&#26131;&#36807;&#25311;&#21512;&#22122;&#22768;&#12290;&#23558;&#25968;&#25454;&#22312;&#26102;&#38388;&#19978;&#36827;&#34892;&#32858;&#21512;&#21487;&#20197;&#32531;&#35299;&#36825;&#20123;&#38382;&#39064;&#65292;&#20294;&#20063;&#21487;&#33021;&#30772;&#22351;&#37325;&#35201;&#30340;&#20449;&#21495;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#38480;&#23450;&#20102;SCM&#20351;&#29992;&#32454;&#20998;&#21644;&#32858;&#21512;&#32467;&#26524;&#26102;&#30340;&#20559;&#24046;&#65292;&#24182;&#32473;&#20986;&#32858;&#21512;&#25910;&#32039;&#38480;&#21046;&#30340;&#26465;&#20214;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#25214;&#21040;&#24179;&#34913;&#32454;&#20998;&#21644;&#32858;&#21512;&#24207;&#21015;&#30340;&#26435;&#37325;&#30340;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
The synthetic control method (SCM) is a popular approach for estimating the impact of a treatment on a single unit with panel data. Two challenges arise with higher frequency data (e.g., monthly versus yearly): (1) achieving excellent pre-treatment fit is typically more challenging; and (2) overfitting to noise is more likely. Aggregating data over time can mitigate these problems but can also destroy important signal. In this paper, we bound the bias for SCM with disaggregated and aggregated outcomes and give conditions under which aggregating tightens the bounds. We then propose finding weights that balance both disaggregated and aggregated series.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#36890;&#36807;&#35266;&#23519;NFT&#24904;&#21892;&#31609;&#27454;&#27963;&#21160;&#20013;&#25424;&#21161;&#20154;&#36141;&#20080;NFT&#23545;&#20854;&#21518;&#32493;&#24066;&#22330;&#32467;&#26524;&#30340;&#24433;&#21709;&#65292;&#25506;&#35752;&#20102;&#30495;&#35802;&#19982;&#31574;&#30053;&#24615;&#24951;&#24936;&#34892;&#20026;&#23545;&#24066;&#22330;&#30340;&#22238;&#24212;&#65292;&#24182;&#21457;&#29616;&#20102;&#26126;&#30830;&#30340;&#24322;&#36136;&#27169;&#24335;&#12290;</title><link>http://arxiv.org/abs/2401.12064</link><description>&lt;p&gt;
&#30495;&#35802;&#19982;&#31574;&#30053;&#24615;&#24951;&#24936;&#34892;&#20026;&#23545;&#24066;&#22330;&#30340;&#22238;&#24212;&#65306;&#23545;NFT&#24904;&#21892;&#31609;&#27454;&#30340;&#23454;&#35777;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Market Responses to Genuine Versus Strategic Generosity: An Empirical Examination of NFT Charity Fundraisers. (arXiv:2401.12064v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.12064
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36890;&#36807;&#35266;&#23519;NFT&#24904;&#21892;&#31609;&#27454;&#27963;&#21160;&#20013;&#25424;&#21161;&#20154;&#36141;&#20080;NFT&#23545;&#20854;&#21518;&#32493;&#24066;&#22330;&#32467;&#26524;&#30340;&#24433;&#21709;&#65292;&#25506;&#35752;&#20102;&#30495;&#35802;&#19982;&#31574;&#30053;&#24615;&#24951;&#24936;&#34892;&#20026;&#23545;&#24066;&#22330;&#30340;&#22238;&#24212;&#65292;&#24182;&#21457;&#29616;&#20102;&#26126;&#30830;&#30340;&#24322;&#36136;&#27169;&#24335;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21152;&#23494;&#36135;&#24065;&#25424;&#36192;&#29616;&#22312;&#21344;&#25454;&#20840;&#29699;&#24904;&#21892;&#25424;&#36192;&#30340;&#37325;&#35201;&#20221;&#39069;&#12290;&#38750;&#21516;&#36136;&#21270;&#20195;&#24065;&#65288;NFT&#65289;&#24904;&#21892;&#31609;&#27454;&#20316;&#20026;&#19968;&#31181;&#26032;&#30340;&#21457;&#23637;&#26041;&#24335;&#65292;&#22312;&#36825;&#20010;&#39046;&#22495;&#20013;&#20986;&#29616;&#20102;&#12290;NFT&#24904;&#21892;&#31609;&#27454;&#30340;&#19968;&#20010;&#29420;&#29305;&#20043;&#22788;&#22312;&#20110;&#25424;&#21161;&#20154;&#26377;&#21487;&#33021;&#20174;&#25152;&#36141;&#20080;&#30340;NFT&#19978;&#21319;&#20540;&#20013;&#33719;&#24471;&#32463;&#27982;&#21033;&#30410;&#12290;&#23545;&#20110;&#36825;&#20123;&#24904;&#21892;&#31609;&#27454;&#30340;&#25424;&#21161;&#20154;&#21160;&#26426;&#21487;&#33021;&#20250;&#20135;&#29983;&#36127;&#38754;&#30340;&#31038;&#20250;&#24418;&#35937;&#12290;&#22240;&#27492;&#65292;NFT&#24904;&#21892;&#31609;&#27454;&#25552;&#20379;&#20102;&#19968;&#20010;&#20102;&#35299;&#25424;&#21161;&#20154;&#31038;&#20250;&#24418;&#35937;&#32463;&#27982;&#21518;&#26524;&#30340;&#29420;&#29305;&#26426;&#20250;&#12290;&#25105;&#20204;&#36890;&#36807;&#21033;&#29992;&#21306;&#22359;&#38142;&#19978;&#20132;&#26131;&#22788;&#29702;&#26102;&#38388;&#30340;&#38543;&#26426;&#21464;&#21160;&#65292;&#30740;&#31350;&#20102;&#19968;&#20010;&#22823;&#22411;NFT&#24904;&#21892;&#31609;&#27454;&#27963;&#21160;&#20013;&#36141;&#20080;NFT&#23545;&#25424;&#21161;&#20154;&#21518;&#32493;&#24066;&#22330;&#32467;&#26524;&#30340;&#22240;&#26524;&#25928;&#24212;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#26126;&#30830;&#30340;&#24322;&#36136;&#27169;&#24335;&#12290;
&lt;/p&gt;
&lt;p&gt;
Crypto donations now represent a significant fraction of charitable giving worldwide. Nonfungible token (NFT) charity fundraisers, which involve the sale of NFTs of artistic works with the proceeds donated to philanthropic causes, have emerged as a novel development in this space. A unique aspect of NFT charity fundraisers is the significant potential for donors to reap financial gains from the rising value of purchased NFTs. Questions may arise about the motivations of donors in these charity fundraisers, resulting in a negative social image. NFT charity fundraisers thus offer a unique opportunity to understand the economic consequences of a donor's social image. We investigate these effects in the context of a large NFT charity fundraiser. We identify the causal effect of purchasing an NFT within the charity fundraiser on a donor's later market outcomes by leveraging random variation in transaction processing times on the blockchain. Further, we demonstrate a clear pattern of heterog
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#25324;&#21495;&#20851;&#31995;&#26041;&#27861;&#65292;&#22312;&#32467;&#21512;&#23454;&#39564;&#21644;&#35266;&#27979;&#25968;&#25454;&#36827;&#34892;&#38271;&#26399;&#25919;&#31574;&#35780;&#20272;&#26102;&#65292;&#26681;&#25454;&#28508;&#22312;&#26080;&#20559;&#24615;&#21644;&#22343;&#34913;&#28151;&#28102;&#20559;&#24046;&#20004;&#20010;&#20551;&#35774;&#30340;&#19979;&#30028;&#21644;&#19978;&#30028;&#36827;&#34892;&#20272;&#35745;&#65292;&#24182;&#21457;&#29616;&#22522;&#20110;&#28508;&#22312;&#26080;&#20559;&#24615;&#30340;&#20445;&#23432;&#19979;&#30028;&#19982;&#23454;&#39564;&#22806;&#20272;&#35745;&#25509;&#36817;&#12290;</title><link>http://arxiv.org/abs/2401.12050</link><description>&lt;p&gt;
&#32467;&#21512;&#23454;&#39564;&#21644;&#35266;&#27979;&#25968;&#25454;&#30340;&#38271;&#26399;&#25919;&#31574;&#35780;&#20272;&#30340;&#25324;&#21495;&#20851;&#31995;
&lt;/p&gt;
&lt;p&gt;
A Bracketing Relationship for Long-Term Policy Evaluation with Combined Experimental and Observational Data. (arXiv:2401.12050v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.12050
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#25324;&#21495;&#20851;&#31995;&#26041;&#27861;&#65292;&#22312;&#32467;&#21512;&#23454;&#39564;&#21644;&#35266;&#27979;&#25968;&#25454;&#36827;&#34892;&#38271;&#26399;&#25919;&#31574;&#35780;&#20272;&#26102;&#65292;&#26681;&#25454;&#28508;&#22312;&#26080;&#20559;&#24615;&#21644;&#22343;&#34913;&#28151;&#28102;&#20559;&#24046;&#20004;&#20010;&#20551;&#35774;&#30340;&#19979;&#30028;&#21644;&#19978;&#30028;&#36827;&#34892;&#20272;&#35745;&#65292;&#24182;&#21457;&#29616;&#22522;&#20110;&#28508;&#22312;&#26080;&#20559;&#24615;&#30340;&#20445;&#23432;&#19979;&#30028;&#19982;&#23454;&#39564;&#22806;&#20272;&#35745;&#25509;&#36817;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#23558;&#30701;&#26399;&#23454;&#39564;&#25968;&#25454;&#19982;&#35266;&#27979;&#25968;&#25454;&#32467;&#21512;&#36215;&#26469;&#65292;&#21487;&#20197;&#36827;&#34892;&#21487;&#20449;&#30340;&#38271;&#26399;&#25919;&#31574;&#35780;&#20272;&#12290;&#25991;&#29486;&#25552;&#20379;&#20102;&#20004;&#20010;&#20851;&#38190;&#20294;&#38750;&#23884;&#22871;&#30340;&#20551;&#35774;&#65292;&#21363;&#28508;&#22312;&#26080;&#20559;&#24615;&#65288;LU&#65289;&#21644;&#22343;&#34913;&#28151;&#28102;&#20559;&#24046;&#65288;ECB&#65289;&#65292;&#29992;&#20110;&#20462;&#27491;&#35266;&#27979;&#36873;&#25321;&#12290;&#36873;&#25321;&#38169;&#35823;&#30340;&#20551;&#35774;&#20250;&#23548;&#33268;&#20272;&#35745;&#20559;&#35823;&#12290;&#20026;&#20102;&#20943;&#36731;&#36825;&#31181;&#39118;&#38505;&#65292;&#25105;&#20204;&#25552;&#20379;&#20102;&#19968;&#31181;&#26032;&#30340;&#25324;&#21495;&#20851;&#31995;&#65292;&#29992;&#20110;&#25968;&#25454;&#32452;&#21512;&#30340;&#24773;&#20917;&#65306;&#22522;&#20110;LU&#30340;&#20272;&#35745;&#25351;&#26631;&#21644;&#22522;&#20110;ECB&#30340;&#20272;&#35745;&#25351;&#26631;&#20998;&#21035;&#20316;&#20026;&#19979;&#30028;&#21644;&#19978;&#30028;&#65292;&#22914;&#26524;&#20219;&#19968;&#20551;&#35774;&#25104;&#31435;&#65292;&#21017;&#30495;&#23454;&#22240;&#26524;&#25928;&#24212;&#20171;&#20110;&#20004;&#32773;&#20043;&#38388;&#12290;&#23545;&#20110;&#36827;&#19968;&#27493;&#23547;&#27714;&#28857;&#20272;&#35745;&#30340;&#30740;&#31350;&#20154;&#21592;&#65292;&#25105;&#20204;&#30340;Lalonde&#39118;&#26684;&#30340;&#23454;&#39564;&#34920;&#26126;&#65292;&#22522;&#20110;LU&#30340;&#20445;&#23432;&#26356;&#20581;&#22766;&#30340;&#19979;&#30028;&#19982;&#25945;&#32946;&#25919;&#31574;&#35780;&#20272;&#20013;&#30340;&#23454;&#39564;&#22806;&#20272;&#35745;&#25509;&#36817;&#12290;&#25105;&#20204;&#30740;&#31350;&#20102;&#36825;&#20123;&#32467;&#26524;&#30340;&#32463;&#27982;&#23454;&#36136;&#24615;
&lt;/p&gt;
&lt;p&gt;
Combining short-term experimental data with observational data enables credible long-term policy evaluation. The literature offers two key but non-nested assumptions, namely the latent unconfoundedness (LU; Athey et al., 2020) and equi-confounding bias (ECB; Ghassami et al., 2022) conditions, to correct observational selection. Committing to the wrong assumption leads to biased estimation. To mitigate such risks, we provide a novel bracketing relationship (cf. Angrist and Pischke, 2009) repurposed for the setting with data combination: the LU-based estimand and the ECB-based estimand serve as the lower and upper bounds, respectively, with the true causal effect lying in between if either assumption holds. For researchers further seeking point estimates, our Lalonde-style exercise suggests the conservatively more robust LU-based lower bounds align closely with the hold-out experimental estimates for educational policy evaluation. We investigate the economic substantives of these finding
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#20171;&#32461;&#20102;&#34913;&#37327;&#20559;&#22909;&#22810;&#26679;&#24615;&#30340;&#19968;&#31181;&#26032;&#26041;&#27861;&#65292;&#22312;Condorcet&#22495;&#19978;&#36827;&#34892;&#20102;&#35814;&#32454;&#30740;&#31350;&#65292;&#35777;&#26126;&#20102;&#22312;&#22823;&#22411;&#22791;&#36873;&#38598;&#22495;&#20013;&#30340;&#26412;&#22320;&#22810;&#26679;&#24615;&#26377;&#19968;&#20010;&#19978;&#38480;&#65292;&#24182;&#21457;&#29616;Black&#30340;&#21333;&#23792;&#22495;&#26159;&#26368;&#20248;&#30340;&#12290;</title><link>http://arxiv.org/abs/2401.11912</link><description>&lt;p&gt;
Condorcet&#22495;&#30340;&#26412;&#22320;&#22810;&#26679;&#24615;
&lt;/p&gt;
&lt;p&gt;
Local Diversity of Condorcet Domains. (arXiv:2401.11912v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.11912
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#34913;&#37327;&#20559;&#22909;&#22810;&#26679;&#24615;&#30340;&#19968;&#31181;&#26032;&#26041;&#27861;&#65292;&#22312;Condorcet&#22495;&#19978;&#36827;&#34892;&#20102;&#35814;&#32454;&#30740;&#31350;&#65292;&#35777;&#26126;&#20102;&#22312;&#22823;&#22411;&#22791;&#36873;&#38598;&#22495;&#20013;&#30340;&#26412;&#22320;&#22810;&#26679;&#24615;&#26377;&#19968;&#20010;&#19978;&#38480;&#65292;&#24182;&#21457;&#29616;Black&#30340;&#21333;&#23792;&#22495;&#26159;&#26368;&#20248;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#31038;&#20250;&#36873;&#25321;&#29702;&#35770;&#20013;&#30340;&#19968;&#20123;&#32463;&#20856;&#32467;&#26524;&#34920;&#26126;&#65292;&#20026;&#20102;&#20351;&#35768;&#22810;&#25237;&#31080;&#31995;&#32479;&#20855;&#26377;&#33391;&#22909;&#30340;&#34892;&#20026;&#65292;&#20010;&#20307;&#20559;&#22909;&#30340;&#22495;&#38598;&#24517;&#39035;&#28385;&#36275;&#26576;&#31181;&#38480;&#21046;&#65292;&#27604;&#22914;&#22312;&#25919;&#27835;&#36724;&#19978;&#26159;&#21333;&#23792;&#30340;&#12290;&#22240;&#27492;&#65292;&#34913;&#37327;&#33391;&#22909;&#34892;&#20026;&#22495;&#20013;&#20559;&#22909;&#30340;&#22810;&#26679;&#24615;&#21464;&#24471;&#26377;&#36259;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#31181;&#24179;&#31561;&#30340;&#26041;&#27861;&#26469;&#34913;&#37327;&#20559;&#22909;&#30340;&#22810;&#26679;&#24615;&#65292;&#37325;&#28857;&#26159;&#20505;&#36873;&#39033;&#23376;&#38598;&#20013;&#19981;&#21516;&#23376;&#24207;&#21015;&#30340;&#20016;&#23500;&#31243;&#24230;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#24191;&#27867;&#20351;&#29992;&#30340;&#20016;&#28385;&#24615;&#21644;&#20805;&#36275;&#24615;&#27010;&#24565;&#30340;&#24120;&#35265;&#27010;&#25324;&#12290;&#25105;&#20204;&#23545;Condorcet&#22495;&#30340;&#20016;&#24230;&#36827;&#34892;&#20102;&#35814;&#32454;&#30740;&#31350;&#12290;&#25105;&#20204;&#30340;&#23450;&#29702;&#34920;&#26126;&#65292;&#22312;&#22823;&#22411;&#22791;&#36873;&#38598;&#22495;&#20013;&#30340;&#26412;&#22320;&#22810;&#26679;&#24615;&#26377;&#19968;&#20010;&#19978;&#38480;&#65292;&#36825;&#34920;&#26126;&#22312;&#36825;&#20010;&#24230;&#37327;&#20013;&#65292;Black&#30340;&#21333;&#23792;&#22495;&#23454;&#38469;&#19978;&#26159;&#26368;&#20248;&#30340;&#12290;&#25105;&#20204;&#36824;&#35777;&#26126;&#20102;&#23545;&#20110;&#26576;&#20123;&#22791;&#36873;&#39033;&#25968;&#37327;&#65292;&#23384;&#22312;&#20855;&#26377;&#26368;&#22823;&#26412;&#22320;&#22810;&#26679;&#24615;&#30340;Condorcet&#22495;&#12290;
&lt;/p&gt;
&lt;p&gt;
Several of the classical results in social choice theory demonstrate that in order for many voting systems to be well-behaved the set domain of individual preferences must satisfy some kind of restriction, such as being single-peaked on a political axis. As a consequence it becomes interesting to measure how diverse the preferences in a well-behaved domain can be.  In this paper we introduce an egalitarian approach to measuring preference diversity, focusing on the abundance of distinct suborders one subsets of the alternative. We provide a common generalisation of the frequently used concepts of ampleness and copiousness.  We give a detailed investigation of the abundance for Condorcet domains. Our theorems imply a ceiling for the local diversity in domains on large sets of alternatives, which show that in this measure Black's single-peaked domain is in fact optimal. We also demonstrate that for some numbers of alternatives, there are Condorcet domains which have largest local diversi
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#36890;&#36807;&#25277;&#31614;&#20998;&#37197;&#19981;&#21487;&#20998;&#21106;&#21830;&#21697;&#30340;&#39034;&#24207;&#35268;&#21017;&#65292;&#24182;&#23450;&#20041;&#20102;&#19968;&#31181;&#26032;&#30340;&#25928;&#29575;&#27010;&#24565;&#12290;&#23613;&#31649;&#39034;&#24207;&#24615;&#21644;&#25928;&#29575;&#22312;&#19968;&#36215;&#19982;&#20844;&#24179;&#27010;&#24565;&#19981;&#20860;&#23481;&#65292;&#20294;&#23427;&#20204;&#20801;&#35768;&#23384;&#22312;&#19968;&#31867;&#20016;&#23500;&#30340;&#35268;&#21017;&#12290;</title><link>http://arxiv.org/abs/2401.11899</link><description>&lt;p&gt;
&#38543;&#26426;&#20998;&#37197;&#20013;&#30340;&#39034;&#24207;&#35268;&#21017;&#25928;&#29575;
&lt;/p&gt;
&lt;p&gt;
Efficiency in random allocation with ordinal rules. (arXiv:2401.11899v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.11899
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#36890;&#36807;&#25277;&#31614;&#20998;&#37197;&#19981;&#21487;&#20998;&#21106;&#21830;&#21697;&#30340;&#39034;&#24207;&#35268;&#21017;&#65292;&#24182;&#23450;&#20041;&#20102;&#19968;&#31181;&#26032;&#30340;&#25928;&#29575;&#27010;&#24565;&#12290;&#23613;&#31649;&#39034;&#24207;&#24615;&#21644;&#25928;&#29575;&#22312;&#19968;&#36215;&#19982;&#20844;&#24179;&#27010;&#24565;&#19981;&#20860;&#23481;&#65292;&#20294;&#23427;&#20204;&#20801;&#35768;&#23384;&#22312;&#19968;&#31867;&#20016;&#23500;&#30340;&#35268;&#21017;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#36890;&#36807;&#25277;&#31614;&#20998;&#37197;&#19981;&#21487;&#20998;&#21106;&#21830;&#21697;&#30340;&#39034;&#24207;&#35268;&#21017;&#12290;&#39034;&#24207;&#24615;&#35201;&#27714;&#35268;&#21017;&#20165;&#32771;&#34385;&#20195;&#29702;&#20154;&#23545;&#38750;&#20961;&#25277;&#31614;&#30340;&#25490;&#24207;&#26041;&#24335;&#65292;&#24182;&#19988;&#21487;&#33021;&#21463;&#35748;&#30693;&#12289;&#20449;&#24687;&#25110;&#32773;&#25105;&#20204;&#23637;&#31034;&#30340;&#28608;&#21169;&#32422;&#26463;&#30340;&#38480;&#21046;&#12290;&#39034;&#24207;&#35268;&#21017;&#23545;&#20195;&#29702;&#20154;&#20559;&#22909;&#30340;&#26377;&#38480;&#21709;&#24212;&#24615;&#24847;&#21619;&#30528;&#23427;&#20204;&#21482;&#33021;&#28385;&#36275;&#22522;&#20110;&#19968;&#38454;&#38543;&#26426;&#20248;&#21183;&#30340;&#31119;&#21033;&#24615;&#36136;&#65292;&#36825;&#26159;&#19981;&#23436;&#25972;&#30340;&#12290;&#25105;&#20204;&#20026;&#39034;&#24207;&#35268;&#21017;&#23450;&#20041;&#20102;&#19968;&#31181;&#26032;&#30340;&#25928;&#29575;&#27010;&#24565;&#12290;&#23613;&#31649;&#39034;&#24207;&#24615;&#21644;&#25928;&#29575;&#22312;&#19968;&#36215;&#19982;&#36890;&#24120;&#30340;&#20844;&#24179;&#27010;&#24565;&#19981;&#20860;&#23481;&#65292;&#24182;&#19988;&#22312;&#19968;&#23450;&#31243;&#24230;&#19978;&#38480;&#21046;&#20102;&#38543;&#26426;&#21270;&#65292;&#23427;&#20204;&#20173;&#20026;&#19968;&#31867;&#20016;&#23500;&#30340;&#35268;&#21017;&#30041;&#19979;&#20102;&#31354;&#38388;&#12290;&#36890;&#36807;&#23545;&#25152;&#26377;&#39034;&#24207;&#12289;&#25928;&#29575;&#12289;&#31574;&#30053;&#21487;&#35777;&#26126;&#12289;&#38750;&#38712;&#21344;&#12289;&#26377;&#30028;&#19981;&#21464;&#21644;&#20013;&#31435;&#35268;&#21017;&#30340;&#21051;&#30011;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#36825;&#19968;&#28857;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study ordinal rules for allocating indivisible goods via lottery. Ordinality requires a rule to consider only how agents rank degenerate lotteries and may be necessitated by cognitive, informational, or as we show, incentive constraints. The limited responsiveness of ordinal rules to agents' preferences means that they can only satisfy welfare properties based on first order stochastic dominance, which is incomplete.  We define a new efficiency concept for ordinal rules. While ordinality and efficiency together are incompatible with the usual notions of fairness and somewhat limit randomization, they does leave room for a rich class of rules. We demonstrate this through a characterization of all ordinal, efficient, strategy-proof, non-bossy, boundedly invariant, and neutral rules.
&lt;/p&gt;</description></item><item><title>&#37329;&#34701;&#21253;&#23481;&#23545;&#23391;&#21152;&#25289;&#22269;&#32463;&#27982;&#22686;&#38271;&#26377;&#31215;&#26497;&#24433;&#21709;&#65292;&#20915;&#31574;&#32773;&#21644;&#23391;&#21152;&#25289;&#22269;&#20013;&#22830;&#38134;&#34892;&#24212;&#25512;&#21160;&#37329;&#34701;&#21253;&#23481;&#27963;&#21160;&#20197;&#23454;&#29616;&#21487;&#25345;&#32493;&#30340;&#32463;&#27982;&#22686;&#38271;&#12290;</title><link>http://arxiv.org/abs/2401.11585</link><description>&lt;p&gt;
&#20998;&#26512;&#37329;&#34701;&#21253;&#23481;&#23545;&#23391;&#21152;&#25289;&#22269;&#32463;&#27982;&#22686;&#38271;&#30340;&#24433;&#21709;
&lt;/p&gt;
&lt;p&gt;
Analyzing the Impact of Financial Inclusion on Economic Growth in Bangladesh. (arXiv:2401.11585v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.11585
&lt;/p&gt;
&lt;p&gt;
&#37329;&#34701;&#21253;&#23481;&#23545;&#23391;&#21152;&#25289;&#22269;&#32463;&#27982;&#22686;&#38271;&#26377;&#31215;&#26497;&#24433;&#21709;&#65292;&#20915;&#31574;&#32773;&#21644;&#23391;&#21152;&#25289;&#22269;&#20013;&#22830;&#38134;&#34892;&#24212;&#25512;&#21160;&#37329;&#34701;&#21253;&#23481;&#27963;&#21160;&#20197;&#23454;&#29616;&#21487;&#25345;&#32493;&#30340;&#32463;&#27982;&#22686;&#38271;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#37329;&#34701;&#21253;&#23481;&#34987;&#35748;&#20026;&#26159;&#32463;&#27982;&#22686;&#38271;&#30340;&#20027;&#35201;&#25512;&#21160;&#22240;&#32032;&#20043;&#19968;&#12290;&#35813;&#30740;&#31350;&#26088;&#22312;&#25506;&#35752;&#37329;&#34701;&#21253;&#23481;&#23545;&#23391;&#21152;&#25289;&#22269;&#32463;&#27982;&#22686;&#38271;&#30340;&#24433;&#21709;&#12290;&#26412;&#30740;&#31350;&#20197;&#36151;&#27454;&#36134;&#25143;&#25968;&#37327;&#20316;&#20026;&#37329;&#34701;&#21253;&#23481;&#30340;&#20195;&#29702;&#21464;&#37327;&#65292;&#20351;&#29992;2004&#24180;&#33267;2021&#24180;&#30340;&#26102;&#38388;&#24207;&#21015;&#25968;&#25454;&#65292;&#21457;&#29616;&#23391;&#21152;&#25289;&#22269;&#30340;GDP&#12289;&#37329;&#34701;&#21253;&#23481;&#21644;&#20854;&#20182;&#23439;&#35266;&#32463;&#27982;&#21464;&#37327;&#20043;&#38388;&#23384;&#22312;&#38271;&#26399;&#20851;&#31995;&#12290;&#30740;&#31350;&#36824;&#21457;&#29616;&#65292;&#22312;&#30740;&#31350;&#26399;&#38388;&#65292;&#37329;&#34701;&#21253;&#23481;&#23545;&#23391;&#21152;&#25289;&#22269;&#30340;&#32463;&#27982;&#22686;&#38271;&#20135;&#29983;&#20102;&#31215;&#26497;&#24433;&#21709;&#12290;&#22240;&#27492;&#65292;&#20915;&#31574;&#32773;&#21644;&#23391;&#21152;&#25289;&#22269;&#20316;&#20026;&#37329;&#34701;&#20307;&#31995;&#26368;&#39640;&#26435;&#23041;&#30340;&#20013;&#22830;&#38134;&#34892;&#24212;&#35813;&#25512;&#21160;&#37329;&#34701;&#21253;&#23481;&#27963;&#21160;&#65292;&#23454;&#29616;&#21487;&#25345;&#32493;&#30340;&#32463;&#27982;&#22686;&#38271;&#12290;
&lt;/p&gt;
&lt;p&gt;
Financial inclusion is touted one of the principal drivers for economic growth for an economy. The study aims to explore the impact of financial inclusion on economic growth in Bangladesh. In my study, I used the number of loan accounts as the proxy for financial inclusion. Using time series data from spans from 2004-2021, the study revealed that there exists a long-run relationship between GDP, financial inclusion, and other macroeconomic variables in Bangladesh. The study also found that financial inclusion had a positive impact on economic growth of Bangladesh during the study period. Therefore, the policymakers and the central bank of Bangladesh as the apex authority of financial system should promote financial inclusion activities to achieve sustainable economic growth.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#35299;&#20915;&#20102;&#39564;&#35777;&#21333;&#35843;&#39532;&#23572;&#21487;&#22827;&#38142;&#20998;&#35010;&#26465;&#20214;&#30340;&#25361;&#25112;&#65292;&#24341;&#20837;&#20102;&#31616;&#21333;&#21487;&#34892;&#30340;&#26465;&#20214;&#26469;&#20445;&#35777;&#20840;&#23616;&#31283;&#23450;&#24615;&#12290;</title><link>http://arxiv.org/abs/2401.11568</link><description>&lt;p&gt;
&#20851;&#20110;&#21333;&#35843;&#39532;&#23572;&#21487;&#22827;&#38142;&#31283;&#23450;&#24615;&#30340;&#27880;&#35299;
&lt;/p&gt;
&lt;p&gt;
A note on the stability of Monotone Markov Chains. (arXiv:2401.11568v1 [math.PR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.11568
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#35299;&#20915;&#20102;&#39564;&#35777;&#21333;&#35843;&#39532;&#23572;&#21487;&#22827;&#38142;&#20998;&#35010;&#26465;&#20214;&#30340;&#25361;&#25112;&#65292;&#24341;&#20837;&#20102;&#31616;&#21333;&#21487;&#34892;&#30340;&#26465;&#20214;&#26469;&#20445;&#35777;&#20840;&#23616;&#31283;&#23450;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#21333;&#35843;&#39532;&#23572;&#21487;&#22827;&#38142;&#65292;&#36825;&#26159;&#39532;&#23572;&#21487;&#22827;&#38142;&#30340;&#19968;&#20010;&#23376;&#31867;&#65292;&#24191;&#27867;&#24212;&#29992;&#20110;&#36816;&#31609;&#23398;&#21644;&#32463;&#27982;&#23398;&#39046;&#22495;&#12290;&#34429;&#28982;&#20445;&#35777;&#36825;&#20123;&#38142;&#30340;&#20840;&#23616;&#31283;&#23450;&#24615;&#30340;&#23646;&#24615;&#24050;&#32463;&#26377;&#20102;&#24456;&#22909;&#30340;&#30740;&#31350;&#65292;&#20294;&#20854;&#24314;&#31435;&#24448;&#24448;&#20381;&#36182;&#20110;&#28385;&#36275;&#26576;&#31181;&#20998;&#35010;&#26465;&#20214;&#12290;&#25105;&#20204;&#36890;&#36807;&#24341;&#20837;&#31616;&#21333;&#19988;&#36866;&#29992;&#30340;&#26465;&#20214;&#26469;&#35299;&#20915;&#39564;&#35777;&#20998;&#35010;&#26465;&#20214;&#30340;&#25361;&#25112;&#65292;&#36825;&#20123;&#26465;&#20214;&#21487;&#20197;&#20445;&#35777;&#20840;&#23616;&#31283;&#23450;&#24615;&#12290;&#36890;&#36807;&#21253;&#25324;&#33258;&#22238;&#24402;&#36807;&#31243;&#21644;&#25237;&#36164;&#32452;&#21512;&#20998;&#37197;&#38382;&#39064;&#22312;&#20869;&#30340;&#21508;&#31181;&#31034;&#20363;&#65292;&#35777;&#26126;&#20102;&#36825;&#20123;&#26465;&#20214;&#30340;&#31616;&#21333;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
This note studies monotone Markov chains a subclass of Markov chains with extensive applications in operations research and economics. While the properties that ensure the global stability of these chains are well studied, their establishment often relies on the fulfillment of a certain splitting condition. We address the challenges of verifying the splitting condition, by introducing simple, applicable conditions that ensure global stability. The simplicity of these conditions is demonstrated through various examples including autoregressive processes and portfolio allocation problems.
&lt;/p&gt;</description></item><item><title>&#25552;&#20986;&#20102;&#22522;&#20110;&#26368;&#20248;&#36755;&#36816;&#30340;&#22810;&#20803;&#20998;&#20301;&#25968;&#22238;&#24402;&#27169;&#22411;&#65292;&#32771;&#34385;&#32467;&#26524;&#21464;&#37327;&#20013;&#26465;&#30446;&#20043;&#38388;&#30340;&#30456;&#20851;&#24615;&#65292;&#24182;&#25552;&#20379;&#20102;&#23616;&#37096;&#35782;&#21035;&#32467;&#26524;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;&#25152;&#38656;&#30340;&#20202;&#22120;&#21464;&#37327;&#65288;IV&#65289;&#30340;&#25903;&#25345;&#22823;&#23567;&#19982;&#32467;&#26524;&#21521;&#37327;&#30340;&#32500;&#24230;&#26080;&#20851;&#65292;&#21482;&#38656;IV&#36275;&#22815;&#20449;&#24687;&#37327;&#12290;</title><link>http://arxiv.org/abs/2401.11422</link><description>&lt;p&gt;
&#20202;&#22120;&#21464;&#37327;&#22810;&#20803;&#20998;&#20301;&#25968;&#22238;&#24402;&#27169;&#22411;&#20013;&#30340;&#23616;&#37096;&#35782;&#21035;
&lt;/p&gt;
&lt;p&gt;
Local Identification in the Instrumental Variable Multivariate Quantile Regression Model. (arXiv:2401.11422v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.11422
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#22522;&#20110;&#26368;&#20248;&#36755;&#36816;&#30340;&#22810;&#20803;&#20998;&#20301;&#25968;&#22238;&#24402;&#27169;&#22411;&#65292;&#32771;&#34385;&#32467;&#26524;&#21464;&#37327;&#20013;&#26465;&#30446;&#20043;&#38388;&#30340;&#30456;&#20851;&#24615;&#65292;&#24182;&#25552;&#20379;&#20102;&#23616;&#37096;&#35782;&#21035;&#32467;&#26524;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;&#25152;&#38656;&#30340;&#20202;&#22120;&#21464;&#37327;&#65288;IV&#65289;&#30340;&#25903;&#25345;&#22823;&#23567;&#19982;&#32467;&#26524;&#21521;&#37327;&#30340;&#32500;&#24230;&#26080;&#20851;&#65292;&#21482;&#38656;IV&#36275;&#22815;&#20449;&#24687;&#37327;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
Chernozhukov&#21644;Hansen&#65288;2005&#65289;&#24341;&#20837;&#30340;&#20202;&#22120;&#21464;&#37327;&#65288;IV&#65289;&#20998;&#20301;&#25968;&#22238;&#24402;&#27169;&#22411;&#26159;&#20998;&#26512;&#20869;&#29983;&#24615;&#24773;&#20917;&#19979;&#20998;&#20301;&#25968;&#22788;&#29702;&#25928;&#24212;&#30340;&#26377;&#29992;&#24037;&#20855;&#65292;&#20294;&#24403;&#32467;&#26524;&#21464;&#37327;&#26159;&#22810;&#32500;&#30340;&#26102;&#65292;&#23427;&#23545;&#27599;&#20010;&#21464;&#37327;&#19981;&#21516;&#32500;&#24230;&#30340;&#32852;&#21512;&#20998;&#24067;&#20445;&#25345;&#27785;&#40664;&#12290;&#20026;&#20102;&#20811;&#26381;&#36825;&#20010;&#38480;&#21046;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#22522;&#20110;&#26368;&#20248;&#36755;&#36816;&#30340;&#32771;&#34385;&#32467;&#26524;&#21464;&#37327;&#20013;&#26465;&#30446;&#20043;&#38388;&#30456;&#20851;&#24615;&#30340;&#22810;&#20803;&#20998;&#20301;&#25968;&#22238;&#24402;&#27169;&#22411;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#20026;&#27169;&#22411;&#25552;&#20379;&#20102;&#19968;&#20010;&#23616;&#37096;&#35782;&#21035;&#32467;&#26524;&#12290;&#20196;&#20154;&#24778;&#35766;&#30340;&#26159;&#65292;&#25105;&#20204;&#21457;&#29616;&#65292;&#25152;&#38656;&#30340;&#29992;&#20110;&#35782;&#21035;&#30340;IV&#30340;&#25903;&#25345;&#22823;&#23567;&#19982;&#32467;&#26524;&#21521;&#37327;&#30340;&#32500;&#24230;&#26080;&#20851;&#65292;&#21482;&#35201;IV&#36275;&#22815;&#20449;&#24687;&#37327;&#12290;&#25105;&#20204;&#30340;&#32467;&#26524;&#26469;&#33258;&#25105;&#20204;&#24314;&#31435;&#30340;&#19968;&#20010;&#20855;&#26377;&#29420;&#31435;&#29702;&#35770;&#24847;&#20041;&#30340;&#19968;&#33324;&#35782;&#21035;&#23450;&#29702;&#12290;
&lt;/p&gt;
&lt;p&gt;
The instrumental variable (IV) quantile regression model introduced by Chernozhukov and Hansen (2005) is a useful tool for analyzing quantile treatment effects in the presence of endogeneity, but when outcome variables are multidimensional, it is silent on the joint distribution of different dimensions of each variable. To overcome this limitation, we propose an IV model built on the optimal-transport-based multivariate quantile that takes into account the correlation between the entries of the outcome variable. We then provide a local identification result for the model. Surprisingly, we find that the support size of the IV required for the identification is independent of the dimension of the outcome vector, as long as the IV is sufficiently informative. Our result follows from a general identification theorem that we establish, which has independent theoretical significance.
&lt;/p&gt;</description></item><item><title>&#35813;&#30740;&#31350;&#35843;&#26597;&#20102;&#20154;&#24037;&#26234;&#33021;&#65288;AI&#65289;&#32534;&#20889;&#30340;&#34394;&#20551;&#22312;&#32447;&#35780;&#35770;&#23545;&#28040;&#36153;&#32773;&#20915;&#31574;&#30340;&#24433;&#21709;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#34394;&#20551;&#35780;&#35770;&#26816;&#27979;&#27169;&#22411;&#20316;&#20026;&#35299;&#20915;&#26041;&#26696;&#12290;</title><link>http://arxiv.org/abs/2401.11345</link><description>&lt;p&gt;
&#20266;&#36896;&#30340;&#35895;&#27468;&#39184;&#21381;&#35780;&#35770;&#23545;&#28040;&#36153;&#32773;&#21644;&#39184;&#21381;&#30340;&#24433;&#21709;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Fake Google restaurant reviews and the implications for consumers and restaurants. (arXiv:2401.11345v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.11345
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#35843;&#26597;&#20102;&#20154;&#24037;&#26234;&#33021;&#65288;AI&#65289;&#32534;&#20889;&#30340;&#34394;&#20551;&#22312;&#32447;&#35780;&#35770;&#23545;&#28040;&#36153;&#32773;&#20915;&#31574;&#30340;&#24433;&#21709;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#34394;&#20551;&#35780;&#35770;&#26816;&#27979;&#27169;&#22411;&#20316;&#20026;&#35299;&#20915;&#26041;&#26696;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#28040;&#36153;&#32773;&#20013;&#65292;&#20351;&#29992;&#22312;&#32447;&#35780;&#35770;&#26469;&#36741;&#21161;&#36141;&#20080;&#20915;&#31574;&#26159;&#27969;&#34892;&#30340;&#65292;&#22240;&#20026;&#23427;&#26159;&#19968;&#31181;&#31616;&#21333;&#30340;&#21551;&#21457;&#24335;&#24037;&#20855;&#65292;&#22522;&#20110;&#20854;&#20182;&#28040;&#36153;&#32773;&#30340;&#25253;&#21578;&#32463;&#39564;&#12290;&#28982;&#32780;&#65292;&#24182;&#19981;&#26159;&#25152;&#26377;&#30340;&#22312;&#32447;&#35780;&#35770;&#37117;&#26159;&#30495;&#23454;&#28040;&#36153;&#32773;&#20889;&#30340;&#25110;&#21453;&#26144;&#30495;&#23454;&#32463;&#21382;&#30340;&#65292;&#36825;&#23545;&#28040;&#36153;&#32773;&#21644;&#20225;&#19994;&#37117;&#24102;&#26469;&#20102;&#24433;&#21709;&#12290;&#26412;&#30740;&#31350;&#35843;&#26597;&#20102;&#20154;&#24037;&#26234;&#33021;&#65288;AI&#65289;&#32534;&#20889;&#30340;&#34394;&#20551;&#22312;&#32447;&#35780;&#35770;&#23545;&#28040;&#36153;&#32773;&#20915;&#31574;&#30340;&#24433;&#21709;&#12290;&#35843;&#26597;&#23545;&#35937;&#36890;&#36807;&#22312;&#32447;&#38382;&#21367;&#65288;n=351&#65289;&#22238;&#31572;&#20102;&#20851;&#20110;&#20182;&#20204;&#22312;&#22312;&#32447;&#35780;&#35770;&#26041;&#38754;&#30340;&#24577;&#24230;&#21644;&#20064;&#24815;&#65292;&#24182;&#21442;&#19982;&#20102;&#19968;&#39033;&#39184;&#21381;&#36873;&#25321;&#23454;&#39564;&#65292;&#20854;&#20013;&#20351;&#29992;&#20102;&#19981;&#21516;&#27604;&#20363;&#30340;&#34394;&#20551;&#21644;&#30495;&#23454;&#35780;&#35770;&#12290;&#30740;&#31350;&#32467;&#26524;&#35777;&#23454;&#20102;&#20197;&#21069;&#30340;&#30740;&#31350;&#65292;&#21516;&#26102;&#36824;&#33719;&#24471;&#20102;&#20851;&#20110;&#24403;&#20154;&#20204;&#30456;&#20449;AI&#32534;&#20889;&#30340;&#35780;&#35770;&#32780;&#19981;&#26159;&#30495;&#23454;&#35780;&#35770;&#26102;&#30340;&#28040;&#36153;&#32773;&#22256;&#24785;&#21644;&#20225;&#19994;&#21518;&#26524;&#30340;&#26032;&#35265;&#35299;&#12290;&#35813;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#34394;&#20551;&#35780;&#35770;&#26816;&#27979;&#27169;&#22411;&#65292;&#20351;&#29992;&#36923;&#36753;&#22238;&#24402;&#24314;&#27169;&#26469;&#23545;&#35780;&#35770;&#36827;&#34892;&#35780;&#20998;&#21644;&#26631;&#35760;&#65292;&#20316;&#20026;&#35299;&#20915;&#26041;&#26696;&#12290;
&lt;/p&gt;
&lt;p&gt;
The use of online reviews to aid with purchase decisions is popular among consumers as it is a simple heuristic tool based on the reported experiences of other consumers. However, not all online reviews are written by real consumers or reflect actual experiences, and present implications for consumers and businesses. This study examines the effects of fake online reviews written by artificial intelligence (AI) on consumer decision making. Respondents were surveyed about their attitudes and habits concerning online reviews using an online questionnaire (n=351), and participated in a restaurant choice experiment using varying proportions of fake and real reviews. While the findings confirm prior studies, new insights are gained about the confusion for consumers and consequences for businesses when reviews written by AI are believed rather than real reviews. The study presents a fake review detection model using logistic regression modeling to score and flag reviews as a solution.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#22522;&#20110;&#25910;&#20837;&#30340;&#27169;&#22411;&#65292;&#30740;&#31350;&#20102;&#22810;&#20262;&#22810;&#25151;&#22320;&#20135;&#24066;&#22330;&#30340;&#20303;&#25151;&#21644;&#39550;&#39542;&#25104;&#26412;&#21464;&#21270;&#23545;&#27773;&#36710;&#36890;&#21220;&#36317;&#31163;&#30340;&#24433;&#21709;&#12290;&#27169;&#22411;&#36890;&#36807;&#32771;&#34385;&#25910;&#20837;&#20998;&#37197;&#21644;&#39550;&#36710;&#36317;&#31163;&#31561;&#21464;&#37327;&#65292;&#21487;&#20197;&#39044;&#27979;&#19981;&#21516;&#22240;&#32032;&#23545;&#36890;&#21220;&#36317;&#31163;&#30340;&#24433;&#21709;&#65292;&#24182;&#35299;&#37322;&#20102;&#36229;&#20986;&#26085;&#24120;&#36890;&#21220;&#33539;&#22260;&#30340;&#24773;&#20917;&#12290;&#30740;&#31350;&#32467;&#26524;&#26174;&#31034;&#65292;&#22810;&#20262;&#22810;&#25151;&#22320;&#20135;&#24066;&#22330;&#30340;&#20303;&#25151;&#25104;&#26412;&#22686;&#21152;&#20250;&#23548;&#33268;&#27773;&#36710;&#36890;&#21220;&#36317;&#31163;&#30340;&#22686;&#21152;&#12290;</title><link>http://arxiv.org/abs/2401.11343</link><description>&lt;p&gt;
&#19968;&#20010;&#22522;&#20110;&#25910;&#20837;&#30340;&#27169;&#22411;&#26469;&#35266;&#23519;&#22810;&#20262;&#22810;&#22320;&#21306;&#36890;&#21220;&#36317;&#31163;
&lt;/p&gt;
&lt;p&gt;
An income-based approach to modeling commuting distance in the Toronto area. (arXiv:2401.11343v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.11343
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#22522;&#20110;&#25910;&#20837;&#30340;&#27169;&#22411;&#65292;&#30740;&#31350;&#20102;&#22810;&#20262;&#22810;&#25151;&#22320;&#20135;&#24066;&#22330;&#30340;&#20303;&#25151;&#21644;&#39550;&#39542;&#25104;&#26412;&#21464;&#21270;&#23545;&#27773;&#36710;&#36890;&#21220;&#36317;&#31163;&#30340;&#24433;&#21709;&#12290;&#27169;&#22411;&#36890;&#36807;&#32771;&#34385;&#25910;&#20837;&#20998;&#37197;&#21644;&#39550;&#36710;&#36317;&#31163;&#31561;&#21464;&#37327;&#65292;&#21487;&#20197;&#39044;&#27979;&#19981;&#21516;&#22240;&#32032;&#23545;&#36890;&#21220;&#36317;&#31163;&#30340;&#24433;&#21709;&#65292;&#24182;&#35299;&#37322;&#20102;&#36229;&#20986;&#26085;&#24120;&#36890;&#21220;&#33539;&#22260;&#30340;&#24773;&#20917;&#12290;&#30740;&#31350;&#32467;&#26524;&#26174;&#31034;&#65292;&#22810;&#20262;&#22810;&#25151;&#22320;&#20135;&#24066;&#22330;&#30340;&#20303;&#25151;&#25104;&#26412;&#22686;&#21152;&#20250;&#23548;&#33268;&#27773;&#36710;&#36890;&#21220;&#36317;&#31163;&#30340;&#22686;&#21152;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30340;&#30446;&#30340;&#26159;&#25552;&#20986;&#19968;&#20010;&#26032;&#39062;&#30340;&#27169;&#22411;&#65292;&#29992;&#20110;&#30740;&#31350;2011&#24180;&#33267;2016&#24180;&#38388;&#22810;&#20262;&#22810;&#25151;&#22320;&#20135;&#24066;&#22330;&#30340;&#20303;&#25151;&#21644;&#39550;&#39542;&#25104;&#26412;&#21464;&#21270;&#23545;&#27773;&#36710;&#36890;&#21220;&#36317;&#31163;&#30340;&#24433;&#21709;&#12290;&#35813;&#27169;&#22411;&#32467;&#21512;&#20102;&#24494;&#35266;&#32463;&#27982;&#23398;&#21644;&#22478;&#24066;&#22320;&#29702;&#23398;&#30340;&#29702;&#35770;&#27010;&#24565;&#26469;&#30740;&#31350;&#22810;&#20262;&#22810;&#25151;&#22320;&#20135;&#24066;&#22330;&#12290;&#36890;&#36807;&#20351;&#29992;2011&#24180;&#21644;2016&#24180;&#20154;&#21475;&#26222;&#26597;&#25968;&#25454;&#20197;&#21450;&#35745;&#31639;&#30340;&#39550;&#36710;&#25104;&#26412;&#65292;&#35813;&#27169;&#22411;&#22522;&#20110;&#26376;&#25910;&#20837;&#20998;&#37197;&#32473;&#26376;&#20303;&#25151;&#36153;&#29992;&#21644;&#39550;&#36710;&#36153;&#29992;&#65292;&#24182;&#32771;&#34385;&#21040;&#27773;&#36710;&#39550;&#39542;&#36317;&#31163;&#22810;&#20262;&#22810;&#30340;&#21464;&#37327;&#26469;&#39044;&#27979;&#27773;&#36710;&#36890;&#21220;&#36317;&#31163;&#30340;&#24433;&#21709;&#12290;&#35813;&#27169;&#22411;&#36824;&#35299;&#37322;&#20102;&#22810;&#20262;&#22810;&#36710;&#36742;&#36890;&#21220;&#32773;&#36229;&#20986;&#26085;&#24120;&#36890;&#21220;&#21322;&#24452;&#30340;&#31038;&#21306;&#24773;&#20917;&#12290;&#35813;&#27169;&#22411;&#35777;&#23454;&#65292;&#22810;&#20262;&#22810;&#25151;&#22320;&#20135;&#24066;&#22330;&#30340;&#20303;&#25151;&#25104;&#26412;&#22686;&#21152;&#20250;&#23548;&#33268;&#27773;&#36710;&#36890;&#21220;&#36317;&#31163;&#30340;&#22686;&#21152;&#12290;
&lt;/p&gt;
&lt;p&gt;
The purpose of this article is to propose a novel model of the effects of changes in shelter and driving costs on car commuting distances in the overheated Toronto housing market from 2011 to 2016. The model borrows from theoretical concepts of microeconomics and urban geography to examine the Toronto housing market. Using 2011 and 2016 Census data for census metropolitan areas (CMAs) and census agglomerations (CAs) in Southern Ontario and computed driving costs, the model of car commuting distance is based on variables of allocation of monthly household income to monthly shelter costs and driving costs as a function of the car driving distance to Toronto. Using this model, we can predict the effect on car commuting distance due to changes in any of the variables. The model also offers an explanation for communities of Toronto car commuters beyond a driving radius that we might expect for daily commuting. The model confirms that increases in shelter costs in the Toronto housing market 
&lt;/p&gt;</description></item><item><title>&#35813;&#30740;&#31350;&#24314;&#31435;&#20102;&#19968;&#20010;&#32806;&#21512;&#30340;&#20154;-&#29615;&#22659;&#31995;&#32479;&#27169;&#22411;&#65292;&#30740;&#31350;&#20102;&#20849;&#20139;&#36164;&#28304;&#27835;&#29702;&#20013;&#36164;&#28304;&#21644;&#31574;&#30053;&#30340;&#20849;&#21516;&#36827;&#21270;&#12290;&#30740;&#31350;&#21457;&#29616;&#19981;&#21516;&#30340;&#28436;&#21270;&#36807;&#31243;&#20250;&#23548;&#33268;&#19981;&#21516;&#30340;&#22343;&#34913;&#35299;&#21644;&#36164;&#28304;&#27700;&#24179;&#65292;&#26576;&#20123;&#36807;&#31243;&#36824;&#21487;&#20197;&#22686;&#24378;&#36164;&#28304;&#30340;&#21487;&#25345;&#32493;&#24615;&#12290;</title><link>http://arxiv.org/abs/2401.11269</link><description>&lt;p&gt;
&#20849;&#20139;&#36164;&#28304;&#22256;&#22659;&#20013;&#36164;&#28304;&#21644;&#31574;&#30053;&#30340;&#20849;&#21516;&#36827;&#21270;&#65306;&#19968;&#20010;&#32806;&#21512;&#30340;&#20154;-&#29615;&#22659;&#31995;&#32479;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
Coevolution of Resource and Strategies in Common-Pool Resource Dilemmas: A Coupled Human-Environmental System Model. (arXiv:2401.11269v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.11269
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#24314;&#31435;&#20102;&#19968;&#20010;&#32806;&#21512;&#30340;&#20154;-&#29615;&#22659;&#31995;&#32479;&#27169;&#22411;&#65292;&#30740;&#31350;&#20102;&#20849;&#20139;&#36164;&#28304;&#27835;&#29702;&#20013;&#36164;&#28304;&#21644;&#31574;&#30053;&#30340;&#20849;&#21516;&#36827;&#21270;&#12290;&#30740;&#31350;&#21457;&#29616;&#19981;&#21516;&#30340;&#28436;&#21270;&#36807;&#31243;&#20250;&#23548;&#33268;&#19981;&#21516;&#30340;&#22343;&#34913;&#35299;&#21644;&#36164;&#28304;&#27700;&#24179;&#65292;&#26576;&#20123;&#36807;&#31243;&#36824;&#21487;&#20197;&#22686;&#24378;&#36164;&#28304;&#30340;&#21487;&#25345;&#32493;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20849;&#20139;&#36164;&#28304;&#30340;&#27835;&#29702;&#38656;&#35201;&#29992;&#25143;&#21512;&#20316;&#65292;&#24182;&#36991;&#20813;&#36807;&#24230;&#21033;&#29992;&#65292;&#20294;&#26159;&#21467;&#36867;&#21644;&#25645;&#20415;&#36710;&#32463;&#24120;&#30772;&#22351;&#21512;&#20316;&#12290;&#25105;&#20204;&#24314;&#27169;&#20102;&#19968;&#20010;&#20154;-&#29615;&#22659;&#31995;&#32479;&#65292;&#25972;&#21512;&#20102;&#36164;&#28304;&#21644;&#29992;&#25143;&#31574;&#30053;&#30340;&#21160;&#24577;&#12290;&#36164;&#28304;&#36981;&#24490;&#19968;&#20010;&#20381;&#36182;&#20110;&#33258;&#28982;&#22686;&#38271;&#29575;&#12289;&#25215;&#36733;&#33021;&#21147;&#21644;&#21512;&#20316;&#32773;&#21644;&#21467;&#36867;&#32773;&#30340;&#24320;&#37319;&#29575;&#30340;&#36923;&#36753;&#20989;&#25968;&#12290;&#29992;&#25143;&#30340;&#31574;&#30053;&#26681;&#25454;&#19981;&#21516;&#30340;&#36807;&#31243;&#28436;&#21270;&#65292;&#25429;&#25417;&#21040;&#20102;&#22238;&#25253;&#12289;&#36164;&#28304;&#21644;&#22122;&#22768;&#30340;&#24433;&#21709;&#12290;&#25105;&#20204;&#20998;&#26512;&#20102;&#36164;&#28304;&#21487;&#29992;&#24615;&#21644;&#31574;&#30053;&#36866;&#24212;&#20043;&#38388;&#30340;&#21453;&#39304;&#65292;&#24182;&#25506;&#35752;&#20102;&#21512;&#20316;&#30340;&#20986;&#29616;&#19982;&#32500;&#25345;&#30340;&#26465;&#20214;&#12290;&#25105;&#20204;&#21457;&#29616;&#19981;&#21516;&#30340;&#36807;&#31243;&#23548;&#33268;&#19981;&#21516;&#30340;&#22343;&#34913;&#35299;&#21644;&#36164;&#28304;&#27700;&#24179;&#30340;&#29366;&#24577;&#65292;&#36825;&#21462;&#20915;&#20110;&#21442;&#25968;&#37197;&#32622;&#21644;&#21021;&#22987;&#26465;&#20214;&#12290;&#25105;&#20204;&#36824;&#26174;&#31034;&#20986;&#19968;&#20123;&#36807;&#31243;&#21487;&#20197;&#36890;&#36807;&#20351;&#29992;&#25143;&#23545;&#36164;&#28304;&#30340;&#31232;&#32570;&#24615;&#26356;&#21152;&#25935;&#24863;&#26469;&#22686;&#24378;&#36164;&#28304;&#30340;&#21487;&#25345;&#32493;&#24615;&#12290;&#35813;&#35770;&#25991;&#25512;&#36827;&#20102;&#23545;&#20849;&#20139;&#36164;&#28304;&#27835;&#29702;&#30340;&#29702;&#35299;&#21644;&#25506;&#35752;&#65292;&#25552;&#20986;&#20102;&#19968;&#20010;&#32806;&#21512;&#30340;&#20154;-&#29615;&#22659;&#31995;&#32479;&#27169;&#22411;&#12290;
&lt;/p&gt;
&lt;p&gt;
Common-pool resource governance requires users to cooperate and avoid overexploitation, but defection and free-riding often undermine cooperation. We model a human-environmental system that integrates dynamics of resource and users' strategies. The resource follows a logistic function that depends on natural growth rate, carrying capacity, and extraction rates of cooperators and defectors. The users' strategies evolve according to different processes that capture effects of payoff, resource, and noise. We analyze the feedback between resource availability and strategic adaptation, and explores the conditions for the emergence and maintenance of cooperation. We find different processes lead to different regimes of equilibrium solutions and resource levels depending on the parameter configuration and initial conditions. We also show that some processes can enhance the sustainability of the resource by making the users more responsive to the resource scarcity. The paper advances the under
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#26032;&#30340;&#26631;&#20934;&#32447;&#24615;&#22238;&#24402;&#27169;&#22411;&#30340;&#20272;&#35745;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#36890;&#36807;&#31616;&#21333;&#21152;&#26435;&#24179;&#22343;&#35266;&#27979;&#23545;&#26012;&#29575;&#26469;&#20272;&#35745;&#65292;&#24182;&#19988;&#36890;&#36807;&#31934;&#24515;&#36873;&#25321;&#26435;&#37325;&#26469;&#20445;&#35777;&#19968;&#33268;&#24615;&#12290;&#30456;&#27604;&#20256;&#32479;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#30340;&#20272;&#35745;&#27531;&#24046;&#19981;&#19982;&#35299;&#37322;&#21464;&#37327;&#27491;&#20132;&#65292;&#22240;&#27492;&#33021;&#22815;&#22312;&#22810;&#20010;&#23454;&#38469;&#24212;&#29992;&#20013;&#20351;&#29992;&#65292;&#22914;&#27979;&#35797;&#20869;&#29983;&#24615;&#31561;&#12290;</title><link>http://arxiv.org/abs/2401.11229</link><description>&lt;p&gt;
&#22522;&#20110;&#25104;&#23545;&#35266;&#27979;&#30340;&#20272;&#35745;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Estimation with Pairwise Observations. (arXiv:2401.11229v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.11229
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#26032;&#30340;&#26631;&#20934;&#32447;&#24615;&#22238;&#24402;&#27169;&#22411;&#30340;&#20272;&#35745;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#36890;&#36807;&#31616;&#21333;&#21152;&#26435;&#24179;&#22343;&#35266;&#27979;&#23545;&#26012;&#29575;&#26469;&#20272;&#35745;&#65292;&#24182;&#19988;&#36890;&#36807;&#31934;&#24515;&#36873;&#25321;&#26435;&#37325;&#26469;&#20445;&#35777;&#19968;&#33268;&#24615;&#12290;&#30456;&#27604;&#20256;&#32479;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#30340;&#20272;&#35745;&#27531;&#24046;&#19981;&#19982;&#35299;&#37322;&#21464;&#37327;&#27491;&#20132;&#65292;&#22240;&#27492;&#33021;&#22815;&#22312;&#22810;&#20010;&#23454;&#38469;&#24212;&#29992;&#20013;&#20351;&#29992;&#65292;&#22914;&#27979;&#35797;&#20869;&#29983;&#24615;&#31561;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#26032;&#30340;&#26631;&#20934;&#32447;&#24615;&#22238;&#24402;&#27169;&#22411;&#30340;&#20272;&#35745;&#26041;&#27861;&#12290;&#35813;&#26041;&#27861;&#27809;&#26377;&#20248;&#21270;&#20219;&#20309;&#30446;&#26631;&#20989;&#25968;&#65292;&#32780;&#26159;&#35266;&#27979;&#23545;&#26012;&#29575;&#30340;&#31616;&#21333;&#21152;&#26435;&#24179;&#22343;&#12290;&#30740;&#31350;&#34920;&#26126;&#65292;&#36890;&#36807;&#31934;&#24515;&#36873;&#25321;&#26435;&#37325;&#65292;&#36825;&#26679;&#30340;&#20272;&#35745;&#37327;&#26159;&#19968;&#33268;&#30340;&#12290;&#20026;&#20102;&#26041;&#20415;&#36827;&#34892;&#26377;&#25928;&#30340;&#32479;&#35745;&#25512;&#26029;&#65292;&#36824;&#25512;&#23548;&#20102;&#28176;&#36817;&#20998;&#24067;&#31561;&#20854;&#20182;&#23646;&#24615;&#12290;&#19982;&#20256;&#32479;&#30340;&#26368;&#23567;&#20108;&#20056;&#27861;&#21644;&#26368;&#22823;&#20284;&#28982;&#27861;&#31561;&#26041;&#27861;&#19981;&#21516;&#65292;&#35813;&#20272;&#35745;&#22120;&#30340;&#20272;&#35745;&#27531;&#24046;&#22312;&#26500;&#36896;&#26102;&#19981;&#19982;&#27169;&#22411;&#30340;&#35299;&#37322;&#21464;&#37327;&#27491;&#20132;&#12290;&#36825;&#19968;&#29305;&#24615;&#20801;&#35768;&#24191;&#27867;&#30340;&#23454;&#38469;&#24212;&#29992;&#65292;&#20363;&#22914;&#26816;&#39564;&#20869;&#29983;&#24615;&#65292;&#21363;&#35299;&#37322;&#21464;&#37327;&#19982;&#24178;&#25200;&#39033;&#20043;&#38388;&#30340;&#30456;&#20851;&#24615;&#65292;&#20197;&#21450;&#20854;&#20182;&#21487;&#33021;&#30340;&#24212;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;
The paper introduces a new estimation method for the standard linear regression model. The procedure is not driven by the optimisation of any objective function rather, it is a simple weighted average of slopes from observation pairs. The paper shows that such estimator is consistent for carefully selected weights. Other properties, such as asymptotic distributions, have also been derived to facilitate valid statistical inference. Unlike traditional methods, such as Least Squares and Maximum Likelihood, among others, the estimated residual of this estimator is not by construction orthogonal to the explanatory variables of the model. This property allows a wide range of practical applications, such as the testing of endogeneity, i.e.,the correlation between the explanatory variables and the disturbance terms, and potentially several others.
&lt;/p&gt;</description></item><item><title>Summan, Nandi, and Bloom&#21457;&#29616;&#65292;&#21360;&#24230;&#36890;&#29992;&#20813;&#30123;&#35745;&#21010;&#23545;&#23156;&#20799;&#30340;&#20813;&#30123;&#26292;&#38706;&#23545;&#20854;&#25104;&#24180;&#21518;&#30340;&#21608;&#34218;&#21644;&#20154;&#22343;&#23478;&#24237;&#28040;&#36153;&#26377;&#27491;&#21521;&#24433;&#21709;&#12290;&#28982;&#32780;&#65292;&#20182;&#20204;&#30340;&#30740;&#31350;&#32467;&#26524;&#21487;&#33021;&#21463;&#21040;&#24180;&#40836;&#21644;&#20986;&#29983;&#24180;&#20221;&#36825;&#20004;&#20010;&#30456;&#20851;&#21464;&#37327;&#30340;&#24433;&#21709;&#65292;&#19988;&#21487;&#33021;&#19982;&#35843;&#26597;&#26399;&#38388;&#30340;&#36235;&#21183;&#30456;&#20851;&#12290;</title><link>http://arxiv.org/abs/2401.11100</link><description>&lt;p&gt;
&#21360;&#24230;&#20799;&#31461;&#20813;&#30123;&#35745;&#21010;&#23545;&#25910;&#20837;&#21644;&#28040;&#36153;&#25903;&#20986;&#30340;&#38271;&#26399;&#24433;&#21709;&#65306;&#35780;&#36848;
&lt;/p&gt;
&lt;p&gt;
Long-term Effects of India's Childhood Immunization Program on Earnings and Consumption Expenditure: Comment. (arXiv:2401.11100v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.11100
&lt;/p&gt;
&lt;p&gt;
Summan, Nandi, and Bloom&#21457;&#29616;&#65292;&#21360;&#24230;&#36890;&#29992;&#20813;&#30123;&#35745;&#21010;&#23545;&#23156;&#20799;&#30340;&#20813;&#30123;&#26292;&#38706;&#23545;&#20854;&#25104;&#24180;&#21518;&#30340;&#21608;&#34218;&#21644;&#20154;&#22343;&#23478;&#24237;&#28040;&#36153;&#26377;&#27491;&#21521;&#24433;&#21709;&#12290;&#28982;&#32780;&#65292;&#20182;&#20204;&#30340;&#30740;&#31350;&#32467;&#26524;&#21487;&#33021;&#21463;&#21040;&#24180;&#40836;&#21644;&#20986;&#29983;&#24180;&#20221;&#36825;&#20004;&#20010;&#30456;&#20851;&#21464;&#37327;&#30340;&#24433;&#21709;&#65292;&#19988;&#21487;&#33021;&#19982;&#35843;&#26597;&#26399;&#38388;&#30340;&#36235;&#21183;&#30456;&#20851;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
Summan&#12289;Nandi&#21644;Bloom&#65288;2023&#65307;SNB&#65289;&#21457;&#29616;&#65292;&#26202;&#26399;&#20843;&#21313;&#24180;&#20195;&#21360;&#24230;&#23156;&#20799;&#25509;&#21463;&#21360;&#24230;&#36890;&#29992;&#20813;&#30123;&#35745;&#21010;&#65288;UIP&#65289;&#30340;&#26292;&#38706;&#20351;&#20854;&#26089;&#26399;&#25104;&#24180;&#26102;&#30340;&#21608;&#34218;&#22686;&#21152;&#20102;0.138&#20010;&#23545;&#25968;&#28857;&#65292;&#20154;&#22343;&#23478;&#24237;&#28040;&#36153;&#22686;&#21152;&#20102;0.028&#20010;&#28857;&#12290;&#20294;&#36825;&#20123;&#32467;&#26524;&#26159;&#36890;&#36807;&#22238;&#24402;&#24180;&#40836;&#21644;&#20986;&#29983;&#24180;&#20221;&#36825;&#20004;&#20010;&#21464;&#37327;&#24471;&#20986;&#30340;&#65292;&#32780;&#36825;&#20004;&#20010;&#21464;&#37327;&#26500;&#36896;&#26102;&#20960;&#20046;&#26159;&#20849;&#32447;&#30340;&#12290;&#22240;&#27492;&#65292;&#36825;&#20123;&#32467;&#26524;&#21487;&#20197;&#24402;&#22240;&#20110;&#19968;&#24180;&#35843;&#26597;&#26399;&#38388;&#30340;&#36235;&#21183;&#65292;&#22914;&#36890;&#36135;&#33192;&#32960;&#12290;&#38543;&#26426;&#21270;&#23454;&#39564;&#34920;&#26126;&#65292;&#24403;&#30495;&#23454;&#24433;&#21709;&#20026;&#38646;&#26102;&#65292;SNB&#20272;&#35745;&#22120;&#30340;&#24179;&#22343;&#20540;&#20026;0.088&#20010;&#28857;&#65288;&#24037;&#36164;&#65289;&#21644;0.039&#20010;&#28857;&#65288;&#28040;&#36153;&#65289;&#12290;
&lt;/p&gt;
&lt;p&gt;
Summan, Nandi, and Bloom (2023; SNB) finds that exposure of babies to India's Universal Immunization Programme (UIP) in the late 1980s increased their weekly wages in early adulthood by 0.138 log points and per-capita household consumption 0.028 points. But the results are attained by regressing on age, in years, while controlling for year of birth--two variables that, as constructed, are nearly collinear. The results are therefore attributable to trends during the one-year survey period, such as inflation. A randomization exercise shows that when the true impacts are zero, the SNB estimator averages 0.088 points for wages and 0.039 points for consumption.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#22522;&#20110;&#20449;&#24687;&#30340;&#25512;&#26029;&#26041;&#27861;&#65292;&#29992;&#20110;&#22788;&#29702;&#20855;&#26377;&#38598;&#21512;&#20540;&#39044;&#27979;&#21644;&#38169;&#35823;&#35268;&#33539;&#21270;&#30340;&#27169;&#22411;&#20013;&#30340;&#37096;&#20998;&#35782;&#21035;&#21442;&#25968;&#65292;&#35813;&#26041;&#27861;&#21487;&#20197;&#22312;&#27169;&#22411;&#35268;&#33539;&#27491;&#30830;&#21644;&#38169;&#35823;&#26102;&#26377;&#25928;&#22320;&#36827;&#34892;&#25512;&#26029;&#12290;</title><link>http://arxiv.org/abs/2401.11046</link><description>&lt;p&gt;
&#20855;&#26377;&#38598;&#21512;&#20540;&#39044;&#27979;&#21644;&#38169;&#35823;&#35268;&#33539;&#21270;&#30340;&#27169;&#22411;&#20013;&#30340;&#22522;&#20110;&#20449;&#24687;&#30340;&#25512;&#26029;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Information Based Inference in Models with Set-Valued Predictions and Misspecification. (arXiv:2401.11046v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.11046
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#22522;&#20110;&#20449;&#24687;&#30340;&#25512;&#26029;&#26041;&#27861;&#65292;&#29992;&#20110;&#22788;&#29702;&#20855;&#26377;&#38598;&#21512;&#20540;&#39044;&#27979;&#21644;&#38169;&#35823;&#35268;&#33539;&#21270;&#30340;&#27169;&#22411;&#20013;&#30340;&#37096;&#20998;&#35782;&#21035;&#21442;&#25968;&#65292;&#35813;&#26041;&#27861;&#21487;&#20197;&#22312;&#27169;&#22411;&#35268;&#33539;&#27491;&#30830;&#21644;&#38169;&#35823;&#26102;&#26377;&#25928;&#22320;&#36827;&#34892;&#25512;&#26029;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#20449;&#24687;&#30340;&#25512;&#26029;&#26041;&#27861;&#65292;&#29992;&#20110;&#19981;&#23436;&#25972;&#27169;&#22411;&#20013;&#37096;&#20998;&#35782;&#21035;&#30340;&#21442;&#25968;&#65292;&#35813;&#26041;&#27861;&#22312;&#27169;&#22411;&#35268;&#33539;&#27491;&#30830;&#21644;&#38169;&#35823;&#26102;&#22343;&#26377;&#25928;&#12290;&#35813;&#26041;&#27861;&#30340;&#20851;&#38190;&#29305;&#28857;&#26159;&#65306;&#65288;i&#65289;&#22522;&#20110;&#26368;&#23567;&#21270;&#36866;&#24403;&#23450;&#20041;&#30340;Kullback-Leibler&#20449;&#24687;&#20934;&#21017;&#65292;&#32771;&#34385;&#27169;&#22411;&#30340;&#19981;&#23436;&#25972;&#24615;&#65292;&#24182;&#25552;&#20379;&#38750;&#31354;&#20266;&#30495;&#38598;&#65307;&#65288;ii&#65289;&#35745;&#31639;&#21487;&#34892;&#65307;&#65288;iii&#65289;&#26080;&#35770;&#27169;&#22411;&#35268;&#33539;&#27491;&#30830;&#19982;&#21542;&#65292;&#23454;&#29616;&#26041;&#27861;&#30456;&#21516;&#65307;&#65288;iv&#65289;&#21033;&#29992;&#31163;&#25955;&#21644;&#36830;&#32493;&#21327;&#21464;&#37327;&#30340;&#21464;&#24322;&#25552;&#20379;&#30340;&#25152;&#26377;&#20449;&#24687;&#65307;&#65288;v&#65289;&#20381;&#36182;&#20110;Rao&#30340;&#35780;&#20998;&#32479;&#35745;&#37327;&#65292;&#35813;&#32479;&#35745;&#37327;&#34987;&#35777;&#26126;&#26159;&#28176;&#36817;&#22522;&#26412;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper proposes an information-based inference method for partially identified parameters in incomplete models that is valid both when the model is correctly specified and when it is misspecified. Key features of the method are: (i) it is based on minimizing a suitably defined Kullback-Leibler information criterion that accounts for incompleteness of the model and delivers a non-empty pseudo-true set; (ii) it is computationally tractable; (iii) its implementation is the same for both correctly and incorrectly specified models; (iv) it exploits all information provided by variation in discrete and continuous covariates; (v) it relies on Rao's score statistic, which is shown to be asymptotically pivotal.
&lt;/p&gt;</description></item><item><title>&#22312;&#32771;&#34385;-&#28982;&#21518;-&#36873;&#25321;&#30340;&#25490;&#21517;&#27169;&#22411;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26041;&#27861;&#26469;&#30830;&#23450;&#32771;&#34385;&#27010;&#29575;&#30340;&#30028;&#38480;&#12290;&#23613;&#31649;&#19981;&#33021;&#20934;&#30830;&#30830;&#23450;&#32771;&#34385;&#27010;&#29575;&#65292;&#20294;&#22312;&#24050;&#30693;&#22791;&#36873;&#26041;&#26696;&#25928;&#29992;&#30340;&#24773;&#20917;&#19979;&#65292;&#25105;&#20204;&#21487;&#20197;&#25512;&#26029;&#20986;&#22791;&#36873;&#27010;&#29575;&#30340;&#30456;&#23545;&#22823;&#23567;&#30340;&#30028;&#38480;&#12290;</title><link>http://arxiv.org/abs/2401.11016</link><description>&lt;p&gt;
&#22312;&#32771;&#34385;-&#28982;&#21518;-&#36873;&#25321;&#25490;&#21517;&#27169;&#22411;&#20013;&#30830;&#23450;&#32771;&#34385;&#27010;&#29575;&#30340;&#30028;&#38480;
&lt;/p&gt;
&lt;p&gt;
Bounding Consideration Probabilities in Consider-Then-Choose Ranking Models. (arXiv:2401.11016v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.11016
&lt;/p&gt;
&lt;p&gt;
&#22312;&#32771;&#34385;-&#28982;&#21518;-&#36873;&#25321;&#30340;&#25490;&#21517;&#27169;&#22411;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26041;&#27861;&#26469;&#30830;&#23450;&#32771;&#34385;&#27010;&#29575;&#30340;&#30028;&#38480;&#12290;&#23613;&#31649;&#19981;&#33021;&#20934;&#30830;&#30830;&#23450;&#32771;&#34385;&#27010;&#29575;&#65292;&#20294;&#22312;&#24050;&#30693;&#22791;&#36873;&#26041;&#26696;&#25928;&#29992;&#30340;&#24773;&#20917;&#19979;&#65292;&#25105;&#20204;&#21487;&#20197;&#25512;&#26029;&#20986;&#22791;&#36873;&#27010;&#29575;&#30340;&#30456;&#23545;&#22823;&#23567;&#30340;&#30028;&#38480;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36873;&#25321;&#29702;&#35770;&#20013;&#19968;&#31181;&#24120;&#35265;&#30340;&#35266;&#28857;&#35748;&#20026;&#65292;&#20010;&#20307;&#22312;&#20570;&#20986;&#36873;&#25321;&#20043;&#21069;&#65292;&#20250;&#20808;&#36827;&#34892;&#20004;&#27493;&#30340;&#36807;&#31243;&#65292;&#39318;&#20808;&#36873;&#25321;&#19968;&#20123;&#22791;&#36873;&#26041;&#26696;&#36827;&#34892;&#32771;&#34385;&#65292;&#28982;&#21518;&#20174;&#25152;&#24471;&#30340;&#32771;&#34385;&#38598;&#21512;&#20013;&#36827;&#34892;&#36873;&#25321;&#12290;&#28982;&#32780;&#65292;&#22312;&#36825;&#31181;&#8220;&#32771;&#34385;&#28982;&#21518;&#36873;&#25321;&#8221;&#30340;&#24773;&#26223;&#19979;&#25512;&#26029;&#26410;&#35266;&#23519;&#21040;&#30340;&#32771;&#34385;&#38598;&#21512;&#65288;&#25110;&#32773;&#22791;&#36873;&#26041;&#26696;&#30340;&#32771;&#34385;&#27010;&#29575;&#65289;&#38754;&#20020;&#30528;&#37325;&#22823;&#25361;&#25112;&#65292;&#22240;&#20026;&#21363;&#20351;&#26159;&#23545;&#20110;&#20855;&#26377;&#24378;&#29420;&#31435;&#24615;&#20551;&#35774;&#30340;&#31616;&#21333;&#32771;&#34385;&#27169;&#22411;&#65292;&#22312;&#24050;&#30693;&#22791;&#36873;&#26041;&#26696;&#25928;&#29992;&#30340;&#24773;&#20917;&#19979;&#20063;&#26080;&#27861;&#30830;&#23450;&#36523;&#20221;&#12290;&#25105;&#20204;&#32771;&#34385;&#23558;&#32771;&#34385;-&#28982;&#21518;-&#36873;&#25321;&#27169;&#22411;&#33258;&#28982;&#22320;&#25193;&#23637;&#21040;top-k&#25490;&#21517;&#30340;&#24773;&#26223;&#65292;&#20551;&#35774;&#25490;&#21517;&#26159;&#26681;&#25454;Plackett-Luce&#27169;&#22411;&#22312;&#37319;&#26679;&#20102;&#32771;&#34385;&#38598;&#21512;&#21518;&#26500;&#24314;&#30340;&#12290;&#23613;&#31649;&#22312;&#36825;&#31181;&#24773;&#26223;&#19979;&#22791;&#36873;&#26041;&#26696;&#30340;&#32771;&#34385;&#27010;&#29575;&#20173;&#26087;&#19981;&#33021;&#30830;&#23450;&#65292;&#20294;&#25105;&#20204;&#35777;&#26126;&#20102;&#22312;&#33719;&#24471;&#22791;&#36873;&#26041;&#26696;&#25928;&#29992;&#30340;&#30693;&#35782;&#30340;&#24773;&#20917;&#19979;&#65292;&#25105;&#20204;&#21487;&#20197;&#25512;&#26029;&#20986;&#22791;&#36873;&#27010;&#29575;&#30456;&#23545;&#22823;&#23567;&#30340;&#30028;&#38480;&#12290;&#27492;&#22806;&#65292;&#36890;&#36807;&#23545;&#26399;&#26395;&#32771;&#34385;&#38598;&#21512;&#22823;&#23567;&#30340;&#26465;&#20214;&#36827;&#34892;&#25512;&#23548;&#65292;&#25105;&#20204;&#24471;&#21040;&#32477;&#23545;&#30028;&#38480;&#12290;
&lt;/p&gt;
&lt;p&gt;
A common theory of choice posits that individuals make choices in a two-step process, first selecting some subset of the alternatives to consider before making a selection from the resulting consideration set. However, inferring unobserved consideration sets (or item consideration probabilities) in this "consider then choose" setting poses significant challenges, because even simple models of consideration with strong independence assumptions are not identifiable, even if item utilities are known. We consider a natural extension of consider-then-choose models to a top-$k$ ranking setting, where we assume rankings are constructed according to a Plackett-Luce model after sampling a consideration set. While item consideration probabilities remain non-identified in this setting, we prove that knowledge of item utilities allows us to infer bounds on the relative sizes of consideration probabilities. Additionally, given a condition on the expected consideration set size, we derive absolute u
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#36890;&#36807;&#35266;&#23519;&#20915;&#31574;&#32773;&#23545;&#24178;&#39044;&#34892;&#20026;&#30340;&#20559;&#22909;&#65292;&#23637;&#31034;&#20102;&#29702;&#35299;&#21644;&#35782;&#21035;&#20915;&#31574;&#32773;&#20027;&#35266;&#22240;&#26524;&#21028;&#26029;&#30340;&#21487;&#33021;&#24615;&#65292;&#20026;&#27169;&#22411;&#27979;&#35797;&#20915;&#31574;&#32773;&#20559;&#22909;&#19968;&#33268;&#24615;&#25552;&#20379;&#20102;&#26041;&#27861;&#12290;</title><link>http://arxiv.org/abs/2401.10937</link><description>&lt;p&gt;
&#20027;&#35266;&#22240;&#26524;&#20851;&#31995;
&lt;/p&gt;
&lt;p&gt;
Subjective Causality. (arXiv:2401.10937v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.10937
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#36890;&#36807;&#35266;&#23519;&#20915;&#31574;&#32773;&#23545;&#24178;&#39044;&#34892;&#20026;&#30340;&#20559;&#22909;&#65292;&#23637;&#31034;&#20102;&#29702;&#35299;&#21644;&#35782;&#21035;&#20915;&#31574;&#32773;&#20027;&#35266;&#22240;&#26524;&#21028;&#26029;&#30340;&#21487;&#33021;&#24615;&#65292;&#20026;&#27169;&#22411;&#27979;&#35797;&#20915;&#31574;&#32773;&#20559;&#22909;&#19968;&#33268;&#24615;&#25552;&#20379;&#20102;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#36890;&#36807;&#35266;&#23519;&#20915;&#31574;&#32773;&#23545;&#24178;&#39044;&#34892;&#20026;&#30340;&#20559;&#22909;&#65292;&#23637;&#31034;&#20102;&#29702;&#35299;&#21644;&#35782;&#21035;&#20915;&#31574;&#32773;&#20027;&#35266;&#22240;&#26524;&#21028;&#26029;&#30340;&#21487;&#33021;&#24615;&#12290;&#26681;&#25454;Pearl [2000]&#30340;&#26041;&#27861;&#65292;&#25105;&#20204;&#20351;&#29992;&#22240;&#26524;&#27169;&#22411;&#65288;&#20063;&#31216;&#20026;&#32467;&#26500;&#26041;&#31243;&#27169;&#22411;&#65289;&#26469;&#34920;&#31034;&#22240;&#26524;&#20851;&#31995;&#65292;&#20854;&#20013;&#19990;&#30028;&#30001;&#19968;&#32452;&#21464;&#37327;&#32452;&#25104;&#65292;&#36825;&#20123;&#21464;&#37327;&#20043;&#38388;&#36890;&#36807;&#26041;&#31243;&#30456;&#20851;&#32852;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#22914;&#26524;&#24178;&#39044;&#34892;&#20026;&#30340;&#20559;&#22909;&#20851;&#31995;&#28385;&#36275;&#26576;&#20123;&#20844;&#29702;&#65288;&#19982;&#21453;&#20107;&#23454;&#30456;&#20851;&#30340;&#26631;&#20934;&#20844;&#29702;&#65289;&#65292;&#37027;&#20040;&#25105;&#20204;&#21487;&#20197;&#23450;&#20041;&#65288;i&#65289;&#19968;&#20010;&#22240;&#26524;&#27169;&#22411;&#65292;&#65288;ii&#65289;&#21453;&#26144;&#20915;&#31574;&#32773;&#23545;&#22806;&#37096;&#22240;&#32032;&#19981;&#30830;&#23450;&#24615;&#30340;&#27010;&#29575;&#65292;&#20197;&#21450;&#65288;iii&#65289;&#19982;&#27599;&#20010;&#24178;&#39044;&#34892;&#20026;&#30456;&#20851;&#32852;&#30340;&#25928;&#29992;&#65292;&#27599;&#20010;&#24178;&#39044;&#34892;&#20026;&#37117;&#26377;&#19968;&#20010;&#39044;&#26399;&#25928;&#29992;&#65292;&#24182;&#19988;&#24178;&#39044;&#34892;&#20026;A&#20248;&#20110;B&#24403;&#19988;&#20165;&#24403;A&#30340;&#39044;&#26399;&#25928;&#29992;&#22823;&#20110;B&#30340;&#39044;&#26399;&#25928;&#29992;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36824;&#23545;&#22240;&#26524;&#27169;&#22411;&#30340;&#21807;&#19968;&#24615;&#36827;&#34892;&#20102;&#21051;&#30011;&#12290;&#22240;&#27492;&#65292;&#25105;&#20204;&#30340;&#32467;&#26524;&#20801;&#35768;&#24314;&#27169;&#32773;&#27979;&#35797;&#19968;&#20010;&#20551;&#35774;&#65292;&#21363;&#20915;&#31574;&#32773;&#30340;&#20559;&#22909;&#26159;&#21542;&#19968;&#33268;&#12290;
&lt;/p&gt;
&lt;p&gt;
We show that it is possible to understand and identify a decision maker's subjective causal judgements by observing her preferences over interventions. Following Pearl [2000], we represent causality using causal models (also called structural equations models), where the world is described by a collection of variables, related by equations. We show that if a preference relation over interventions satisfies certain axioms (related to standard axioms regarding counterfactuals), then we can define (i) a causal model, (ii) a probability capturing the decision-maker's uncertainty regarding the external factors in the world and (iii) a utility on outcomes such that each intervention is associated with an expected utility and such that intervention $A$ is preferred to $B$ iff the expected utility of $A$ is greater than that of $B$. In addition, we characterize when the causal model is unique. Thus, our results allow a modeler to test the hypothesis that a decision maker's preferences are cons
&lt;/p&gt;</description></item><item><title>&#20154;&#24037;&#26234;&#33021;&#30340;&#26368;&#26032;&#36827;&#23637;&#20026;&#20154;&#20204;&#25552;&#20379;&#20102;&#26426;&#22120;&#23398;&#20064;&#12289;&#36866;&#24212;&#21644;&#25191;&#34892;&#20219;&#21153;&#30340;&#26426;&#20250;&#65292;&#20419;&#36827;&#20102;&#32463;&#27982;&#36716;&#22411;&#21644;&#20849;&#21516;&#32321;&#33635;&#12290;&#25105;&#20204;&#38656;&#35201;&#20511;&#37492;&#31185;&#25216;&#21644;&#21019;&#26032;&#30340;&#21382;&#21490;&#32463;&#39564;&#65292;&#20197;&#23454;&#29616;&#20154;&#24037;&#26234;&#33021;&#30340;&#32463;&#27982;&#28508;&#21147;&#65292;&#24182;&#20026;&#31038;&#20250;&#24102;&#26469;&#26356;&#22810;&#30340;&#21033;&#30410;&#12290;</title><link>http://arxiv.org/abs/2401.09718</link><description>&lt;p&gt;
&#20154;&#24037;&#26234;&#33021;&#19982;&#20849;&#21516;&#32321;&#33635;&#30340;&#26426;&#36935;&#65306;&#20174;&#31185;&#25216;&#21644;&#32463;&#27982;&#21382;&#21490;&#20013;&#27762;&#21462;&#30340;&#25945;&#35757;
&lt;/p&gt;
&lt;p&gt;
AI and the Opportunity for Shared Prosperity: Lessons from the History of Technology and the Economy. (arXiv:2401.09718v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.09718
&lt;/p&gt;
&lt;p&gt;
&#20154;&#24037;&#26234;&#33021;&#30340;&#26368;&#26032;&#36827;&#23637;&#20026;&#20154;&#20204;&#25552;&#20379;&#20102;&#26426;&#22120;&#23398;&#20064;&#12289;&#36866;&#24212;&#21644;&#25191;&#34892;&#20219;&#21153;&#30340;&#26426;&#20250;&#65292;&#20419;&#36827;&#20102;&#32463;&#27982;&#36716;&#22411;&#21644;&#20849;&#21516;&#32321;&#33635;&#12290;&#25105;&#20204;&#38656;&#35201;&#20511;&#37492;&#31185;&#25216;&#21644;&#21019;&#26032;&#30340;&#21382;&#21490;&#32463;&#39564;&#65292;&#20197;&#23454;&#29616;&#20154;&#24037;&#26234;&#33021;&#30340;&#32463;&#27982;&#28508;&#21147;&#65292;&#24182;&#20026;&#31038;&#20250;&#24102;&#26469;&#26356;&#22810;&#30340;&#21033;&#30410;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20154;&#24037;&#26234;&#33021;&#30340;&#26368;&#26032;&#36827;&#23637;&#26631;&#24535;&#30528;&#20154;&#31867;&#21382;&#21490;&#19978;&#30340;&#19968;&#20010;&#20851;&#38190;&#26102;&#21051;&#12290;&#23427;&#25552;&#20379;&#20102;&#26426;&#22120;&#23398;&#20064;&#12289;&#36866;&#24212;&#21644;&#25191;&#34892;&#20219;&#21153;&#30340;&#26426;&#20250;&#65292;&#36825;&#20123;&#20219;&#21153;&#26377;&#28508;&#21147;&#24110;&#21161;&#20154;&#20204;&#20174;&#26085;&#24120;&#27963;&#21160;&#21040;&#26368;&#20855;&#21019;&#36896;&#24615;&#21644;&#38596;&#24515;&#21187;&#21187;&#30340;&#39033;&#30446;&#12290;&#23427;&#36824;&#21487;&#20197;&#24110;&#21161;&#20225;&#19994;&#21644;&#32452;&#32455;&#21033;&#29992;&#30693;&#35782;&#65292;&#25552;&#39640;&#29983;&#20135;&#21147;&#65292;&#21019;&#26032;&#65292;&#36716;&#22411;&#65292;&#24182;&#20026;&#20849;&#21516;&#32321;&#33635;&#25552;&#20379;&#21160;&#21147;&#12290;&#36825;&#20010;&#24040;&#22823;&#30340;&#28508;&#21147;&#24341;&#21457;&#20102;&#20004;&#20010;&#22522;&#26412;&#38382;&#39064;&#65306;&#65288;1&#65289;&#20154;&#24037;&#26234;&#33021;&#26159;&#21542;&#30495;&#30340;&#33021;&#22815;&#25512;&#21160;&#22269;&#23478;&#21644;&#20840;&#29699;&#32463;&#27982;&#36716;&#22411;&#65292;&#20351;&#31038;&#20250;&#21463;&#30410;&#65311;&#65288;2&#65289;&#25105;&#20204;&#24517;&#39035;&#35299;&#20915;&#21738;&#20123;&#38382;&#39064;&#65292;&#25165;&#33021;&#20805;&#20998;&#23454;&#29616;&#20154;&#24037;&#26234;&#33021;&#30340;&#32463;&#27982;&#20215;&#20540;&#65292;&#25193;&#22823;&#32321;&#33635;&#65292;&#25913;&#21892;&#19990;&#30028;&#21508;&#22320;&#30340;&#29983;&#27963;&#65311;&#25105;&#20204;&#36890;&#36807;&#32771;&#34385;&#31185;&#25216;&#21644;&#21019;&#26032;&#30340;&#26368;&#36817;&#21382;&#21490;&#20316;&#20026;&#25351;&#23548;&#65292;&#25506;&#35752;&#20102;&#36825;&#20123;&#38382;&#39064;&#12290;&#34429;&#28982;&#25105;&#20204;&#24182;&#19981;&#35748;&#20026;&#26410;&#26469;&#20250;&#23436;&#20840;&#19982;&#36807;&#21435;&#30456;&#21516;&#65292;&#20294;&#25105;&#20204;&#23558;&#35752;&#35770;&#19968;&#20123;&#21407;&#22240;&#12290;
&lt;/p&gt;
&lt;p&gt;
Recent progress in artificial intelligence (AI) marks a pivotal moment in human history. It presents the opportunity for machines to learn, adapt, and perform tasks that have the potential to assist people, from everyday activities to their most creative and ambitious projects. It could also help businesses and organizations harness knowledge, increase productivity, innovate, transform, and power shared prosperity. This tremendous potential raises two fundamental questions: (1) Will AI actually advance national and global economic transformation to benefit society at large? and (2) What issues must we get right to fully realize AI's economic value, expand prosperity and improve lives everywhere? We explore these questions by considering the recent history of technology and innovation as a guide for the likely impact of AI and what we must do to realize its economic potential to benefit society. While we do not presume the future will be entirely like that past, for reasons we will disc
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25506;&#35752;&#20102;&#26234;&#33021;&#20307;&#21464;&#24471;&#26234;&#33021;&#30340;&#22240;&#32032;&#65292;&#24378;&#35843;&#20102;&#25484;&#25569;&#29305;&#24449;&#21644;&#25511;&#21046;&#22810;&#20010;&#20445;&#23432;&#30456;&#20114;&#20316;&#29992;&#30340;&#23376;&#31995;&#32479;&#30340;&#33021;&#21147;&#12290;&#26234;&#33021;&#30340;&#26680;&#24515;&#26159;&#8220;&#38598;&#20307;&#22914;&#19968;&#20307;&#8221;&#21644;&#8220;&#20102;&#35299;&#23616;&#37096;&#34892;&#21160;&#30340;&#25972;&#20307;&#32467;&#26524;&#8221;&#12290;&#25991;&#31456;&#25552;&#20986;&#20102;&#19968;&#31181;&#23545;&#38598;&#20307;&#20445;&#23432;&#31995;&#32479;&#36827;&#34892;&#25511;&#21046;&#30340;&#26367;&#20195;&#26041;&#27861;&#12290;</title><link>http://arxiv.org/abs/2401.04846</link><description>&lt;p&gt;
&#21463;&#36807;&#33391;&#22909;&#25945;&#32946;&#30340;&#26234;&#33021;&#30340;&#20869;&#22312;&#21892;&#33391;
&lt;/p&gt;
&lt;p&gt;
The inherent goodness of well educated intelligence. (arXiv:2401.04846v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.04846
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25506;&#35752;&#20102;&#26234;&#33021;&#20307;&#21464;&#24471;&#26234;&#33021;&#30340;&#22240;&#32032;&#65292;&#24378;&#35843;&#20102;&#25484;&#25569;&#29305;&#24449;&#21644;&#25511;&#21046;&#22810;&#20010;&#20445;&#23432;&#30456;&#20114;&#20316;&#29992;&#30340;&#23376;&#31995;&#32479;&#30340;&#33021;&#21147;&#12290;&#26234;&#33021;&#30340;&#26680;&#24515;&#26159;&#8220;&#38598;&#20307;&#22914;&#19968;&#20307;&#8221;&#21644;&#8220;&#20102;&#35299;&#23616;&#37096;&#34892;&#21160;&#30340;&#25972;&#20307;&#32467;&#26524;&#8221;&#12290;&#25991;&#31456;&#25552;&#20986;&#20102;&#19968;&#31181;&#23545;&#38598;&#20307;&#20445;&#23432;&#31995;&#32479;&#36827;&#34892;&#25511;&#21046;&#30340;&#26367;&#20195;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#23558;&#25506;&#35752;&#20351;&#19968;&#20010;&#26234;&#33021;&#20307;&#21464;&#24471;&#26234;&#33021;&#30340;&#22240;&#32032;&#65292;&#26080;&#35770;&#26159;&#29983;&#29289;&#20307;&#36824;&#26159;&#35745;&#31639;&#26426;&#19978;&#30340;&#20154;&#24037;&#26234;&#33021;&#12290;&#29305;&#21035;&#20851;&#27880;&#30340;&#26159;&#33021;&#22815;&#34920;&#24449;&#21644;&#25511;&#21046;&#22810;&#20010;&#20445;&#23432;&#30456;&#20114;&#20316;&#29992;&#30340;&#30456;&#21516;&#23376;&#31995;&#32479;&#30340;&#33021;&#21147;&#12290;&#26234;&#33021;&#30340;&#26412;&#36136;&#23558;&#34987;&#21457;&#29616;&#26159;&#40644;&#37329;&#27861;&#21017;&#8212;&#8212;&#8220;&#38598;&#20307;&#34892;&#21160;&#22914;&#19968;&#20307;&#8221;&#25110;&#8220;&#20102;&#35299;&#23616;&#37096;&#34892;&#21160;&#30340;&#25972;&#20307;&#32467;&#26524;&#8221;&#12290;&#38598;&#20307;&#30340;&#27969;&#21160;&#26159;&#30001;&#25484;&#25511;&#30528;&#23569;&#37327;&#23383;&#31526;&#20018;&#30340;&#25805;&#32437;&#32773;&#20915;&#23450;&#30340;&#65292;&#26681;&#25454;&#23545;&#31216;&#24615;&#30830;&#23450;&#30340;&#26368;&#23567;&#20316;&#29992;&#36335;&#24452;&#30340;&#27979;&#22320;&#32447;&#36816;&#21160;&#12290;&#25511;&#21046;&#38598;&#20307;&#20445;&#23432;&#31995;&#32479;&#26159;&#22256;&#38590;&#30340;&#65292;&#21382;&#21490;&#19978;&#19968;&#30452;&#36890;&#36807;&#20026;&#31995;&#32479;&#28155;&#21152;&#26174;&#33879;&#40655;&#24615;&#26469;&#31283;&#23450;&#26399;&#26395;&#30340;&#26368;&#22823;&#24615;&#33021;&#30340;&#20122;&#31283;&#24179;&#34913;&#29366;&#24577;&#65292;&#20294;&#36825;&#20250;&#22312;&#36807;&#31243;&#20013;&#38477;&#20302;&#25110;&#30772;&#22351;&#23427;&#20204;&#12290;&#26377;&#19968;&#31181;&#26367;&#20195;&#26041;&#26696;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper will examine what makes a being intelligent, whether that be a biological being or an artificial silicon being on a computer. Special attention will be paid to the being having the ability to characterize and control a collective system of many identical conservative sub-systems conservatively interacting. The essence of intelligence will be found to be the golden rule -- "the collective acts as one" or "knowing the global consequences of local actions". The flow of the collective is a small set of twinkling textures, that are governed by a puppeteer who is pulling a small number of strings according to a geodesic motion of least action, determined by the symmetries. Controlling collective conservative systems is difficult and has historically been done by adding significant viscosity to the system to stabilize the desirable meta stable equilibriums of maximum performance, but it degrades or destroys them in the process. There is an alternative. Once the optimum twinkling te
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#21452;&#36793;&#24066;&#22330;&#20013;&#21305;&#37197;&#29992;&#25143;&#21644;&#21019;&#20316;&#32773;&#30340;&#27169;&#22411;&#65292;&#24182;&#23637;&#31034;&#20102;&#19968;&#20010;&#20197;&#29992;&#25143;&#20026;&#20013;&#24515;&#30340;&#36138;&#24515;&#31639;&#27861;&#21487;&#33021;&#23548;&#33268;&#25972;&#20307;&#21442;&#19982;&#24230;&#19979;&#38477;&#30340;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2401.00313</link><description>&lt;p&gt;
&#22312;&#21452;&#36793;&#24066;&#22330;&#20013;&#21305;&#37197;&#29992;&#25143;&#21644;&#21019;&#20316;&#32773;&#30340;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Matching of Users and Creators in Two-Sided Markets with Departures. (arXiv:2401.00313v2 [cs.GT] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.00313
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#21452;&#36793;&#24066;&#22330;&#20013;&#21305;&#37197;&#29992;&#25143;&#21644;&#21019;&#20316;&#32773;&#30340;&#27169;&#22411;&#65292;&#24182;&#23637;&#31034;&#20102;&#19968;&#20010;&#20197;&#29992;&#25143;&#20026;&#20013;&#24515;&#30340;&#36138;&#24515;&#31639;&#27861;&#21487;&#33021;&#23548;&#33268;&#25972;&#20307;&#21442;&#19982;&#24230;&#19979;&#38477;&#30340;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#29616;&#20170;&#35768;&#22810;&#22312;&#32447;&#24179;&#21488;&#65292;&#21253;&#25324;&#31038;&#20132;&#23186;&#20307;&#32593;&#31449;&#65292;&#37117;&#26159;&#26725;&#25509;&#20869;&#23481;&#21019;&#20316;&#32773;&#19982;&#29992;&#25143;&#30340;&#21452;&#36793;&#24066;&#22330;&#12290;&#29616;&#26377;&#30340;&#20851;&#20110;&#24179;&#21488;&#25512;&#33616;&#31639;&#27861;&#30340;&#25991;&#29486;&#20027;&#35201;&#38598;&#20013;&#22312;&#29992;&#25143;&#20559;&#22909;&#21644;&#20915;&#31574;&#19978;&#65292;&#24182;&#27809;&#26377;&#21516;&#26102;&#32771;&#34385;&#21040;&#21019;&#20316;&#32773;&#30340;&#21160;&#26426;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#20869;&#23481;&#25512;&#33616;&#27169;&#22411;&#65292;&#26126;&#30830;&#20851;&#27880;&#29992;&#25143;-&#20869;&#23481;&#21305;&#37197;&#30340;&#21160;&#24577;&#36807;&#31243;&#65292;&#20854;&#26032;&#39062;&#20043;&#22788;&#22312;&#20110;&#22914;&#26524;&#29992;&#25143;&#21644;&#21019;&#20316;&#32773;&#27809;&#26377;&#36275;&#22815;&#30340;&#21442;&#19982;&#24863;&#65292;&#20182;&#20204;&#37117;&#21487;&#33021;&#27704;&#20037;&#31163;&#24320;&#24179;&#21488;&#12290;&#22312;&#25105;&#20204;&#30340;&#27169;&#22411;&#20013;&#65292;&#27599;&#20010;&#21442;&#19982;&#32773;&#26681;&#25454;&#24403;&#21069;&#21305;&#37197;&#30340;&#23454;&#29992;&#24615;&#20915;&#23450;&#26159;&#21542;&#22312;&#27599;&#20010;&#26102;&#38388;&#27493;&#21442;&#19982;&#65306;&#29992;&#25143;&#22522;&#20110;&#25512;&#33616;&#20869;&#23481;&#19982;&#20854;&#20559;&#22909;&#30340;&#19968;&#33268;&#24615;&#65292;&#32780;&#21019;&#20316;&#32773;&#21017;&#22522;&#20110;&#20854;&#21463;&#20247;&#35268;&#27169;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#19968;&#31181;&#20197;&#29992;&#25143;&#20026;&#20013;&#24515;&#30340;&#36138;&#24515;&#31639;&#27861;&#65292;&#22914;&#26524;&#19981;&#32771;&#34385;&#21019;&#20316;&#32773;&#30340;&#31163;&#24320;&#65292;&#21487;&#33021;&#23548;&#33268;&#25972;&#20307;&#21442;&#19982;&#24230;&#20219;&#24847;&#19979;&#38477;&#65292;&#30456;&#23545;&#20110;&#32771;&#34385;&#21040;&#21452;&#26041;&#21033;&#30410;&#26368;&#22823;&#21270;&#25972;&#20307;&#21442;&#19982;&#24230;&#30340;&#31639;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
Many online platforms of today, including social media sites, are two-sided markets bridging content creators and users. Most of the existing literature on platform recommendation algorithms largely focuses on user preferences and decisions, and does not simultaneously address creator incentives. We propose a model of content recommendation that explicitly focuses on the dynamics of user-content matching, with the novel property that both users and creators may leave the platform permanently if they do not experience sufficient engagement. In our model, each player decides to participate at each time step based on utilities derived from the current match: users based on alignment of the recommended content with their preferences, and creators based on their audience size. We show that a user-centric greedy algorithm that does not consider creator departures can result in arbitrarily poor total engagement, relative to an algorithm that maximizes total engagement while accounting for two
&lt;/p&gt;</description></item><item><title>&#20154;&#24037;&#26234;&#33021;&#30340;&#30693;&#35782;&#23545;&#24037;&#20316;&#32452;&#32455;&#26377;&#30528;&#24040;&#22823;&#30340;&#24433;&#21709;&#65292;&#24403;&#20854;&#30693;&#35782;&#19982;&#20043;&#21069;&#30340;&#24037;&#20154;&#30456;&#21516;&#26102;&#65292;&#23427;&#23558;&#23548;&#33268;&#20154;&#31867;&#20174;&#24120;&#35268;&#24037;&#20316;&#36716;&#31227;&#21040;&#31649;&#29702;&#24037;&#20316;&#65292;&#20943;&#23567;&#20225;&#19994;&#35268;&#27169;&#21644;&#29983;&#20135;&#29575;&#65292;&#21516;&#26102;&#20063;&#38477;&#20302;&#21592;&#24037;&#21644;&#31649;&#29702;&#32773;&#30340;&#29983;&#20135;&#21147;&#12290;&#24403;&#20854;&#30693;&#35782;&#19982;&#20043;&#21069;&#30340;&#31649;&#29702;&#32773;&#30456;&#21516;&#26102;&#65292;&#23427;&#20250;&#22686;&#21152;&#31649;&#29702;&#32773;&#30340;&#25511;&#21046;&#33539;&#22260;&#65292;&#20294;&#38477;&#20302;&#24037;&#20154;&#30340;&#29983;&#20135;&#21147;&#12290;&#20154;&#24037;&#26234;&#33021;&#22312;&#30693;&#35782;&#32463;&#27982;&#20013;&#24341;&#21457;&#20102;&#36755;&#36194;&#23616;&#38754;&#12290;</title><link>http://arxiv.org/abs/2312.05481</link><description>&lt;p&gt;
&#30693;&#35782;&#32463;&#27982;&#20013;&#30340;&#20154;&#24037;&#26234;&#33021;
&lt;/p&gt;
&lt;p&gt;
Artificial Intelligence in the Knowledge Economy. (arXiv:2312.05481v2 [econ.TH] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2312.05481
&lt;/p&gt;
&lt;p&gt;
&#20154;&#24037;&#26234;&#33021;&#30340;&#30693;&#35782;&#23545;&#24037;&#20316;&#32452;&#32455;&#26377;&#30528;&#24040;&#22823;&#30340;&#24433;&#21709;&#65292;&#24403;&#20854;&#30693;&#35782;&#19982;&#20043;&#21069;&#30340;&#24037;&#20154;&#30456;&#21516;&#26102;&#65292;&#23427;&#23558;&#23548;&#33268;&#20154;&#31867;&#20174;&#24120;&#35268;&#24037;&#20316;&#36716;&#31227;&#21040;&#31649;&#29702;&#24037;&#20316;&#65292;&#20943;&#23567;&#20225;&#19994;&#35268;&#27169;&#21644;&#29983;&#20135;&#29575;&#65292;&#21516;&#26102;&#20063;&#38477;&#20302;&#21592;&#24037;&#21644;&#31649;&#29702;&#32773;&#30340;&#29983;&#20135;&#21147;&#12290;&#24403;&#20854;&#30693;&#35782;&#19982;&#20043;&#21069;&#30340;&#31649;&#29702;&#32773;&#30456;&#21516;&#26102;&#65292;&#23427;&#20250;&#22686;&#21152;&#31649;&#29702;&#32773;&#30340;&#25511;&#21046;&#33539;&#22260;&#65292;&#20294;&#38477;&#20302;&#24037;&#20154;&#30340;&#29983;&#20135;&#21147;&#12290;&#20154;&#24037;&#26234;&#33021;&#22312;&#30693;&#35782;&#32463;&#27982;&#20013;&#24341;&#21457;&#20102;&#36755;&#36194;&#23616;&#38754;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20154;&#24037;&#26234;&#33021;&#22914;&#20309;&#24433;&#21709;&#24037;&#20316;&#32452;&#32455;&#65311;&#25105;&#20204;&#22312;&#19968;&#20010;&#27169;&#22411;&#20013;&#30740;&#31350;&#36825;&#20010;&#38382;&#39064;&#65292;&#35813;&#27169;&#22411;&#20013;&#23384;&#22312;&#24322;&#36136;&#20195;&#29702;&#20154;&#8212;&#8212;&#20154;&#31867;&#21644;&#26426;&#22120;&#20154;&#8212;&#8212;&#33258;&#21457;&#22320;&#20998;&#37197;&#21040;&#31561;&#32423;&#21046;&#24230;&#30340;&#20225;&#19994;&#20013;&#65306;&#30693;&#35782;&#36739;&#20302;&#30340;&#20195;&#29702;&#20154;&#25104;&#20026;&#8220;&#24037;&#20154;&#8221;&#65288;&#25191;&#34892;&#24120;&#35268;&#20219;&#21153;&#65289;&#65292;&#32780;&#30693;&#35782;&#36739;&#39640;&#30340;&#20195;&#29702;&#20154;&#21017;&#25104;&#20026;&#8220;&#31649;&#29702;&#32773;&#8221;&#65288;&#19987;&#27880;&#20110;&#38382;&#39064;&#35299;&#20915;&#65289;&#12290;&#24403;&#20154;&#24037;&#26234;&#33021;&#30340;&#30693;&#35782;&#19982;&#20154;&#24037;&#26234;&#33021;&#20043;&#21069;&#30340;&#24037;&#20154;&#30456;&#21516;&#26102;&#65292;&#20154;&#24037;&#26234;&#33021;(i)&#23558;&#20154;&#31867;&#20174;&#24120;&#35268;&#24037;&#20316;&#36716;&#31227;&#21040;&#31649;&#29702;&#24037;&#20316;&#65292;(ii)&#20943;&#23567;&#26368;&#22823;&#20225;&#19994;&#30340;&#35268;&#27169;&#21644;&#26368;&#20302;&#29983;&#20135;&#29575;&#20225;&#19994;&#30340;&#29983;&#20135;&#29575;&#65292;(iii)&#22686;&#21152;&#38500;&#26368;&#20855;&#30693;&#35782;&#30340;&#31649;&#29702;&#32773;&#20043;&#22806;&#30340;&#25152;&#26377;&#31649;&#29702;&#32773;&#30340;&#25511;&#21046;&#33539;&#22260;&#65292;&#20197;&#21450;(iv)&#38477;&#20302;&#25152;&#26377;&#24037;&#20154;&#30340;&#29983;&#20135;&#21147;&#65292;&#22240;&#20026;&#23427;&#24694;&#21270;&#20102;&#20182;&#20204;&#30340;&#31649;&#29702;&#32773;&#30340;&#36136;&#37327;&#12290;&#24403;&#20154;&#24037;&#26234;&#33021;&#20855;&#26377;&#20154;&#24037;&#26234;&#33021;&#20043;&#21069;&#30340;&#31649;&#29702;&#32773;&#30340;&#30693;&#35782;&#26102;&#65292;&#21069;&#20004;&#20010;&#32467;&#26524;&#23558;&#34987;&#39072;&#20498;&#65292;&#20294;&#21518;&#20004;&#20010;&#32467;&#26524;&#19981;&#20250;&#39072;&#20498;&#65306;&#22312;&#36825;&#31181;&#24773;&#20917;&#19979;&#65292;&#20154;&#24037;&#26234;&#33021;&#22686;&#21152;&#20102;&#25152;&#26377;&#31649;&#29702;&#32773;&#30340;&#25511;&#21046;&#33539;&#22260;&#65292;&#38477;&#20302;&#20102;&#38500;&#26368;&#19981;&#30693;&#35782;&#28170;&#21338;&#30340;&#24037;&#20154;&#20043;&#22806;&#30340;&#25152;&#26377;&#24037;&#20154;&#30340;&#29983;&#20135;&#21147;&#12290;&#20154;&#24037;&#26234;&#33021;&#21019;&#36896;&#20102;&#20248;&#32988;&#32773;&#12290;
&lt;/p&gt;
&lt;p&gt;
How does Artificial Intelligence (AI) affect the organization of work? We study this question in a model where heterogeneous agents--humans and bots--endogenously sort into hierarchical firms: Less knowledgeable agents become "workers" (i.e., execute routine tasks), while more knowledgeable agents becomes "managers" (i.e., specialize in problem solving). When AI's knowledge is that of a pre-AI worker, AI (i) displaces humans from routine to managerial work, (ii) decreases both the size of the largest firms and the productivity of the least productive firms, (iii) increases the span of control of all but the most knowledgeable managers, and (iv) decreases the productivity of all workers, as it worsens the quality of their managers. The first two results are reversed when AI has the knowledge of a pre-AI manager, but not the last two: In that case, AI increases the span of control of all managers and decreases the productivity of all but the least knowledgeable workers. AI creates winner
&lt;/p&gt;</description></item><item><title>&#19987;&#21046;&#25919;&#26435;&#20013;&#30340;&#20449;&#24687;&#27969;&#25197;&#26354;&#21450;&#20854;&#21518;&#26524;&#30340;&#27169;&#22411;&#34920;&#26126;&#65292;&#22312;&#30701;&#26399;&#21487;&#20197;&#24102;&#26469;&#25913;&#21892;&#65292;&#20294;&#38543;&#21518;&#20250;&#23548;&#33268;&#22269;&#23478;&#36880;&#28176;&#24694;&#21270;&#12290;&#39038;&#38382;&#30340;&#27450;&#39575;&#31243;&#24230;&#19982;&#22256;&#38590;&#31243;&#24230;&#25104;&#27491;&#27604;&#12290;</title><link>http://arxiv.org/abs/2310.01666</link><description>&lt;p&gt;
&#29420;&#35009;&#32773;&#26041;&#31243;&#65306;&#19987;&#21046;&#25919;&#26435;&#20013;&#20449;&#24687;&#27969;&#30340;&#25197;&#26354;&#21450;&#20854;&#21518;&#26524;
&lt;/p&gt;
&lt;p&gt;
The Dictator Equation: The Distortion of Information Flow in Autocratic Regimes and Its Consequences. (arXiv:2310.01666v1 [nlin.AO])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.01666
&lt;/p&gt;
&lt;p&gt;
&#19987;&#21046;&#25919;&#26435;&#20013;&#30340;&#20449;&#24687;&#27969;&#25197;&#26354;&#21450;&#20854;&#21518;&#26524;&#30340;&#27169;&#22411;&#34920;&#26126;&#65292;&#22312;&#30701;&#26399;&#21487;&#20197;&#24102;&#26469;&#25913;&#21892;&#65292;&#20294;&#38543;&#21518;&#20250;&#23548;&#33268;&#22269;&#23478;&#36880;&#28176;&#24694;&#21270;&#12290;&#39038;&#38382;&#30340;&#27450;&#39575;&#31243;&#24230;&#19982;&#22256;&#38590;&#31243;&#24230;&#25104;&#27491;&#27604;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20154;&#20204;&#23545;&#19987;&#21046;&#19982;&#27665;&#20027;&#25919;&#26435;&#30340;&#21033;&#24330;&#20105;&#35770;&#24050;&#26377;&#25968;&#21315;&#24180;&#20043;&#20037;&#12290;&#20363;&#22914;&#65292;&#12298;&#29702;&#24819;&#22269;&#12299;&#20013;&#30340;&#26575;&#25289;&#22270;&#26356;&#38738;&#30544;&#20110;&#31934;&#33521;&#19987;&#21046;&#25919;&#26435;&#65292;&#35748;&#20026;&#36825;&#26159;&#21551;&#33945;&#30340;&#25919;&#26435;&#24418;&#24335;&#65292;&#32780;&#38750;&#27665;&#20027;&#20307;&#21046;&#12290;&#29616;&#20195;&#29420;&#35009;&#32773;&#36890;&#24120;&#22312;&#19978;&#21488;&#26102;&#25215;&#35834;&#24555;&#36895;&#35299;&#20915;&#31038;&#20250;&#38382;&#39064;&#21644;&#38271;&#26399;&#31283;&#23450;&#12290;&#25105;&#25552;&#20986;&#20102;&#19968;&#20010;&#20197;&#22269;&#23478;&#26368;&#20339;&#21033;&#30410;&#20026;&#20986;&#21457;&#28857;&#30340;&#29420;&#35009;&#27169;&#22411;&#12290;&#35813;&#27169;&#22411;&#22522;&#20110;&#20197;&#19979;&#21069;&#25552;&#65306;a) &#29420;&#35009;&#32773;&#21482;&#20381;&#36182;&#39038;&#38382;&#30340;&#20449;&#24687;&#26469;&#20915;&#23450;&#22269;&#23478;&#21457;&#23637;&#30340;&#26041;&#21521;&#65307;b) &#39038;&#38382;&#30340;&#27450;&#39575;&#19981;&#20250;&#38543;&#26102;&#38388;&#20943;&#23569;&#65307;c) &#39038;&#38382;&#30340;&#27450;&#39575;&#31243;&#24230;&#20250;&#38543;&#22269;&#23478;&#25152;&#36935;&#21040;&#30340;&#22256;&#38590;&#32780;&#22686;&#21152;&#12290;&#35813;&#27169;&#22411;&#23637;&#31034;&#20102;&#30701;&#26399;&#25913;&#21892;&#65288;&#20960;&#20010;&#26376;&#21040;&#19968;&#24180;&#65289;&#65292;&#38543;&#21518;&#20986;&#29616;&#19981;&#31283;&#23450;&#24773;&#20917;&#65292;&#23548;&#33268;&#22269;&#23478;&#36880;&#28176;&#24694;&#21270;&#22810;&#24180;&#12290;&#25105;&#25512;&#23548;&#20986;&#20102;&#19968;&#20123;&#36866;&#29992;&#20110;&#25152;&#26377;&#29420;&#35009;&#32773;&#30340;&#26222;&#36941;&#21442;&#25968;&#65292;&#24182;&#35777;&#26126;&#20102;&#39038;&#38382;&#30340;&#27450;&#39575;&#31243;&#24230;&#19982;&#22256;&#38590;&#31243;&#24230;&#25104;&#27491;&#27604;&#12290;
&lt;/p&gt;
&lt;p&gt;
Humans have been arguing about the benefits of dictatorial versus democratic regimes for millennia. For example, Plato, in The Republic, favored Aristocracy,, the enlightened autocratic regime, to democracy. Modern dictators typically come to power promising quick solutions to societal problems and long-term stability}. I present a model of a dictatorship with the country's best interests in mind. The model is based on the following premises: a) the dictator forces the country to follow the desired trajectory of development only from the information from the advisors; b) the deception from the advisors cannot decrease in time; and c) the deception increases based on the difficulties the country encounters. The model shows an improvement in the short term (a few months to a year), followed by instability leading to the country's gradual deterioration over many years. I derive some universal parameters applicable to all dictators and show that advisors' deception increases in parallel wi
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#21160;&#24577;&#22240;&#23376;&#24207;&#21015;&#21644;&#38745;&#24577;&#22240;&#23376;&#24207;&#21015;&#20043;&#38388;&#30340;&#21306;&#21035;&#65292;&#24378;&#35843;&#20102;&#24573;&#30053;&#24369;&#20849;&#21516;&#25104;&#20998;&#23545;&#20110;&#22240;&#23376;&#27169;&#22411;&#22312;&#32467;&#26500;&#20998;&#26512;&#21644;&#39044;&#27979;&#20013;&#30340;&#24212;&#29992;&#21487;&#33021;&#20135;&#29983;&#30340;&#37325;&#22823;&#24433;&#21709;&#65292;&#21516;&#26102;&#25351;&#20986;&#21160;&#24577;&#20849;&#21516;&#25104;&#20998;&#25165;&#33021;&#34987;&#35299;&#37322;&#20026;&#28508;&#22312;&#32463;&#27982;&#21464;&#37327;&#12290;</title><link>http://arxiv.org/abs/2307.10067</link><description>&lt;p&gt;
&#35843;&#21644;&#22240;&#23376;&#24207;&#21015;&#29702;&#35770;
&lt;/p&gt;
&lt;p&gt;
Reconciling the Theory of Factor Sequences. (arXiv:2307.10067v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.10067
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#21160;&#24577;&#22240;&#23376;&#24207;&#21015;&#21644;&#38745;&#24577;&#22240;&#23376;&#24207;&#21015;&#20043;&#38388;&#30340;&#21306;&#21035;&#65292;&#24378;&#35843;&#20102;&#24573;&#30053;&#24369;&#20849;&#21516;&#25104;&#20998;&#23545;&#20110;&#22240;&#23376;&#27169;&#22411;&#22312;&#32467;&#26500;&#20998;&#26512;&#21644;&#39044;&#27979;&#20013;&#30340;&#24212;&#29992;&#21487;&#33021;&#20135;&#29983;&#30340;&#37325;&#22823;&#24433;&#21709;&#65292;&#21516;&#26102;&#25351;&#20986;&#21160;&#24577;&#20849;&#21516;&#25104;&#20998;&#25165;&#33021;&#34987;&#35299;&#37322;&#20026;&#28508;&#22312;&#32463;&#27982;&#21464;&#37327;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22240;&#23376;&#24207;&#21015;&#26159;&#38543;&#26426;&#30340;&#21452;&#24207;&#21015;$(y_{it}: i \in \mathbb N, t \in \mathbb Z)$&#65292;&#20197;&#26102;&#38388;&#21644;&#27178;&#25130;&#38754;&#20026;&#32034;&#24341;&#65292;&#20855;&#26377;&#25152;&#35859;&#30340;&#22240;&#23376;&#32467;&#26500;&#12290;&#35813;&#21517;&#35789;&#30001;Forni&#31561;&#20154;&#20110;2001&#24180;&#25552;&#20986;&#65292;&#24341;&#20837;&#20102;&#21160;&#24577;&#22240;&#23376;&#24207;&#21015;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#21160;&#24577;&#22240;&#23376;&#24207;&#21015;&#21644;&#38745;&#24577;&#22240;&#23376;&#24207;&#21015;&#20043;&#38388;&#30340;&#21306;&#21035;&#65292;&#38745;&#24577;&#22240;&#23376;&#24207;&#21015;&#26159;&#35745;&#37327;&#32463;&#27982;&#23398;&#22240;&#23376;&#20998;&#26512;&#20013;&#26368;&#24120;&#35265;&#30340;&#24037;&#20316;&#27169;&#22411;&#65292;&#22522;&#20110;Chamberlain&#21644;Rothschild &#65288;1983&#65289;&#65292;Stock&#21644;Watson&#65288;2002&#65289;&#21644;Bai&#21644;Ng&#65288;2002&#65289;&#12290;&#21306;&#21035;&#22312;&#20110;&#25105;&#20204;&#25152;&#31216;&#30340;&#24369;&#20849;&#21516;&#25104;&#20998;&#65292;&#35813;&#25104;&#20998;&#30001;&#28508;&#22312;&#26080;&#38480;&#22810;&#20010;&#24369;&#22240;&#23376;&#25152;&#26500;&#25104;&#12290;&#24573;&#30053;&#24369;&#20849;&#21516;&#25104;&#20998;&#21487;&#33021;&#23545;&#32467;&#26500;&#20998;&#26512;&#21644;&#39044;&#27979;&#20013;&#22240;&#23376;&#27169;&#22411;&#30340;&#24212;&#29992;&#20135;&#29983;&#37325;&#22823;&#24433;&#21709;&#12290;&#25105;&#20204;&#36824;&#23637;&#31034;&#20102;&#21160;&#24577;&#22240;&#23376;&#24207;&#21015;&#30340;&#21160;&#24577;&#20849;&#21516;&#25104;&#20998;&#22312;&#19968;&#33324;&#26465;&#20214;&#19979;&#26159;&#22240;&#26524;&#20174;&#23646;&#20110;&#36755;&#20986;&#30340;&#12290;&#22240;&#27492;&#65292;&#21482;&#26377;&#21160;&#24577;&#20849;&#21516;&#25104;&#20998;&#25165;&#33021;&#20316;&#20026;&#28508;&#22312;&#32463;&#27982;&#21464;&#37327;&#30340;&#35299;&#37322;&#12290;
&lt;/p&gt;
&lt;p&gt;
Factor Sequences are stochastic double sequences $(y_{it}: i \in \mathbb N, t \in \mathbb Z)$ indexed in time and cross-section which have a so called factor structure. The name was coined by Forni et al. 2001, who introduced dynamic factor sequences. We show the difference between dynamic factor sequences and static factor sequences which are the most common workhorse model of econometric factor analysis building on Chamberlain and Rothschild (1983), Stock and Watson (2002) and Bai and Ng (2002). The difference consists in what we call the weak common component which is spanned by a potentially infinite number of weak factors. Ignoring the weak common component can have substantial consequences for applications of factor models in structural analysis and forecasting. We also show that the dynamic common component of a dynamic factor sequence is causally subordinated to the output under general conditions. As a consequence only the dynamic common component can be interpreted as the pro
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#36890;&#36807;&#26368;&#22823;&#21270;&#19968;&#31995;&#21015;&#24402;&#19968;&#21270;&#30697;&#26469;&#20351;&#29992;&#23376;&#39640;&#26031;&#20869;&#22312;&#30697;&#33539;&#23454;&#29616;&#32039;&#20945;&#30340;&#38750;&#28176;&#36827;&#25512;&#26029;&#30340;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#21487;&#20197;&#23548;&#33268;&#26356;&#32039;&#30340;Hoeffding&#23376;&#39640;&#26031;&#27987;&#24230;&#19981;&#31561;&#24335;&#65292;&#24182;&#19988;&#21487;&#20197;&#36890;&#36807;&#23376;&#39640;&#26031;&#22270;&#26816;&#26597;&#20855;&#26377;&#26377;&#38480;&#26679;&#26412;&#22823;&#23567;&#30340;&#23376;&#39640;&#26031;&#25968;&#25454;&#12290;</title><link>http://arxiv.org/abs/2303.07287</link><description>&lt;p&gt;
&#36890;&#36807;&#23376;&#39640;&#26031;&#20869;&#22312;&#30697;&#33539;&#23454;&#29616;&#32039;&#20945;&#30340;&#38750;&#28176;&#36827;&#25512;&#26029;
&lt;/p&gt;
&lt;p&gt;
Tight Non-asymptotic Inference via Sub-Gaussian Intrinsic Moment Norm. (arXiv:2303.07287v1 [stat.ML])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.07287
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#36890;&#36807;&#26368;&#22823;&#21270;&#19968;&#31995;&#21015;&#24402;&#19968;&#21270;&#30697;&#26469;&#20351;&#29992;&#23376;&#39640;&#26031;&#20869;&#22312;&#30697;&#33539;&#23454;&#29616;&#32039;&#20945;&#30340;&#38750;&#28176;&#36827;&#25512;&#26029;&#30340;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#21487;&#20197;&#23548;&#33268;&#26356;&#32039;&#30340;Hoeffding&#23376;&#39640;&#26031;&#27987;&#24230;&#19981;&#31561;&#24335;&#65292;&#24182;&#19988;&#21487;&#20197;&#36890;&#36807;&#23376;&#39640;&#26031;&#22270;&#26816;&#26597;&#20855;&#26377;&#26377;&#38480;&#26679;&#26412;&#22823;&#23567;&#30340;&#23376;&#39640;&#26031;&#25968;&#25454;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper proposes a method of achieving tight non-asymptotic inference by using sub-Gaussian intrinsic moment norm through maximizing a series of normalized moments, which can lead to tighter Hoeffding's sub-Gaussian concentration inequalities and can be checked with sub-Gaussian plot for sub-Gaussian data with a finite sample size.
&lt;/p&gt;
&lt;p&gt;
&#22312;&#38750;&#28176;&#36827;&#32479;&#35745;&#25512;&#26029;&#20013;&#65292;&#23376;&#39640;&#26031;&#20998;&#24067;&#30340;&#26041;&#24046;&#31867;&#22411;&#21442;&#25968;&#36215;&#30528;&#33267;&#20851;&#37325;&#35201;&#30340;&#20316;&#29992;&#12290;&#28982;&#32780;&#65292;&#22522;&#20110;&#32463;&#39564;&#30697;&#29983;&#25104;&#20989;&#25968;&#65288;MGF&#65289;&#30340;&#30452;&#25509;&#20272;&#35745;&#36825;&#20123;&#21442;&#25968;&#26159;&#19981;&#21487;&#34892;&#30340;&#12290;&#20026;&#27492;&#65292;&#25105;&#20204;&#24314;&#35758;&#36890;&#36807;&#26368;&#22823;&#21270;&#19968;&#31995;&#21015;&#24402;&#19968;&#21270;&#30697;&#26469;&#20351;&#29992;&#23376;&#39640;&#26031;&#20869;&#22312;&#30697;&#33539;[Buldygin&#21644;Kozachenko&#65288;2000&#65289;&#65292;&#23450;&#29702;1.3]&#12290;&#37325;&#35201;&#30340;&#26159;&#65292;&#25512;&#33616;&#30340;&#33539;&#25968;&#19981;&#20165;&#21487;&#20197;&#24674;&#22797;&#30456;&#24212;MGF&#30340;&#25351;&#25968;&#30697;&#30028;&#38480;&#65292;&#32780;&#19988;&#36824;&#21487;&#20197;&#23548;&#33268;&#26356;&#32039;&#30340;Hoeffding&#23376;&#39640;&#26031;&#27987;&#24230;&#19981;&#31561;&#24335;&#12290;&#22312;&#23454;&#36341;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#30452;&#35266;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#23376;&#39640;&#26031;&#22270;&#26816;&#26597;&#20855;&#26377;&#26377;&#38480;&#26679;&#26412;&#22823;&#23567;&#30340;&#23376;&#39640;&#26031;&#25968;&#25454;&#12290;&#21487;&#20197;&#36890;&#36807;&#31616;&#21333;&#30340;&#25554;&#20837;&#26041;&#27861;&#40065;&#26834;&#22320;&#20272;&#35745;&#20869;&#22312;&#30697;&#33539;&#25968;&#12290;&#25105;&#20204;&#30340;&#29702;&#35770;&#32467;&#26524;&#24212;&#29992;&#20110;&#38750;&#28176;&#36827;&#20998;&#26512;&#65292;&#21253;&#25324;&#22810;&#33218;&#36172;&#21338;&#26426;&#12290;
&lt;/p&gt;
&lt;p&gt;
In non-asymptotic statistical inferences, variance-type parameters of sub-Gaussian distributions play a crucial role. However, direct estimation of these parameters based on the empirical moment generating function (MGF) is infeasible. To this end, we recommend using a sub-Gaussian intrinsic moment norm [Buldygin and Kozachenko (2000), Theorem 1.3] through maximizing a series of normalized moments. Importantly, the recommended norm can not only recover the exponential moment bounds for the corresponding MGFs, but also lead to tighter Hoeffding's sub-Gaussian concentration inequalities. In practice, {\color{black} we propose an intuitive way of checking sub-Gaussian data with a finite sample size by the sub-Gaussian plot}. Intrinsic moment norm can be robustly estimated via a simple plug-in approach. Our theoretical results are applied to non-asymptotic analysis, including the multi-armed bandit.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#23567;&#23398;&#26102;&#23398;&#29983;&#30340;&#29677;&#32423;&#25490;&#21517;&#21644;&#29677;&#32423;&#36136;&#37327;&#23545;&#21518;&#32493;&#23398;&#19994;&#25104;&#26524;&#30340;&#24433;&#21709;&#65292;&#32467;&#26524;&#34920;&#26126;&#65292;&#25490;&#21517;&#23545;&#23398;&#29983;&#25104;&#32489;&#30340;&#24433;&#21709;&#24456;&#22823;&#65307;&#19982;&#29677;&#32423;&#36136;&#37327;&#30456;&#27604;&#65292;&#29677;&#32423;&#25490;&#21517;&#30340;&#24433;&#21709;&#36739;&#23567;&#12290;</title><link>http://arxiv.org/abs/2302.10026</link><description>&lt;p&gt;
&#22312;&#26449;&#37324;&#24403;&#31532;&#19968;&#36824;&#26159;&#22312;&#32599;&#39532;&#24403;&#31532;&#20108;&#65311;&#23567;&#23398;&#26102;&#23398;&#29983;&#30340;&#29677;&#32423;&#25490;&#21517;&#23545;&#21518;&#26469;&#30340;&#23398;&#19994;&#25104;&#23601;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
Rather First in a Village than Second in Rome? The Effect of Students' Class Rank in Primary School on Subsequent Academic Achievements. (arXiv:2302.10026v2 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2302.10026
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#23567;&#23398;&#26102;&#23398;&#29983;&#30340;&#29677;&#32423;&#25490;&#21517;&#21644;&#29677;&#32423;&#36136;&#37327;&#23545;&#21518;&#32493;&#23398;&#19994;&#25104;&#26524;&#30340;&#24433;&#21709;&#65292;&#32467;&#26524;&#34920;&#26126;&#65292;&#25490;&#21517;&#23545;&#23398;&#29983;&#25104;&#32489;&#30340;&#24433;&#21709;&#24456;&#22823;&#65307;&#19982;&#29677;&#32423;&#36136;&#37327;&#30456;&#27604;&#65292;&#29677;&#32423;&#25490;&#21517;&#30340;&#24433;&#21709;&#36739;&#23567;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#21033;&#29992;2013&#24180;&#33267;2019&#24180;&#38388;&#24847;&#22823;&#21033;&#23398;&#29983;&#30340;&#38754;&#26495;&#25968;&#25454;&#65292;&#27604;&#36739;&#20102;&#23567;&#23398;&#38454;&#27573;&#23398;&#29983;&#30340;&#29677;&#32423;&#25490;&#21517;&#19982;&#29677;&#32423;&#36136;&#37327;&#23545;&#21518;&#32493;&#23398;&#19994;&#25104;&#26524;&#30340;&#24433;&#21709;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#31574;&#30053;&#26469;&#30830;&#23450;&#25490;&#21517;&#30340;&#24433;&#21709;&#65292;&#21516;&#26102;&#25511;&#21046;&#21516;&#20276;&#24433;&#21709;&#65292;&#21363;&#21033;&#29992;&#29677;&#32423;&#32771;&#35797;&#30340;&#25104;&#32489;&#26500;&#24314;&#25490;&#21517;&#65292;&#24182;&#21033;&#29992;&#20840;&#22269;&#26631;&#20934;&#21270;&#32771;&#35797;&#30340;&#25104;&#32489;&#26469;&#25511;&#21046;&#23398;&#29983;&#30340;&#33021;&#21147;&#12290;&#22312;&#23567;&#23398;&#26102;&#25490;&#21517;&#31532;&#19968;&#19982;&#26368;&#21518;&#30456;&#27604;&#65292;&#20250;&#20351;&#20013;&#23398;&#30340;&#20840;&#22269;&#26631;&#20934;&#21270;&#32771;&#35797;&#25104;&#32489;&#20998;&#24067;&#25552;&#39640;8.1&#20010;&#30334;&#20998;&#28857;&#65292;&#39640;&#20013;&#25552;&#39640;7.6&#20010;&#30334;&#20998;&#28857;&#12290;&#23613;&#31649;&#25490;&#21517;&#30340;&#24433;&#21709;&#24456;&#22823;&#65292;&#20294;&#25105;&#20204;&#30340;&#20998;&#26512;&#36824;&#24378;&#35843;&#20102;&#65292;&#29677;&#32423;&#36136;&#37327;&#19968;&#20010;&#26631;&#20934;&#24046;&#30340;&#25552;&#39640;&#23545;&#23398;&#19994;&#30340;&#24433;&#21709;&#26159;&#25490;&#21517;&#30340;&#20116;&#20493;&#12290;&#26368;&#21518;&#65292;&#36890;&#36807;&#19968;&#39033;&#24191;&#27867;&#30340;&#23398;&#29983;&#35843;&#26597;&#65292;&#25105;&#20204;&#30830;&#23450;&#20102;&#25490;&#21517;&#30340;&#24433;&#21709;&#26159;&#36890;&#36807;&#36827;&#20837;&#26356;&#22909;&#30340;&#39640;&#20013;&#21644;&#24515;&#29702;&#26426;&#21046;&#26469;&#21457;&#25381;&#20316;&#29992;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
Using panel data on Italian students from 2013 to 2019, we compare the effect of a student's class rank to the effect of class quality in primary school on subsequent academic outcomes. We propose a new strategy to identify the impact of rank while controlling for peer effects, by leveraging grades on class exams to construct the rank, and grades on national standardized tests to control for students' ability. Ranking first in primary school compared to last results in an improvement of 8.1 percentiles in the national standardized test grade distribution in middle school and 7.6 percentiles in high school. Despite the sizable impact of rank, our analysis highlights that a one standard deviation increase in class quality is five-fold greater than a similar increase in rank. Finally, using an extensive student survey, we establish that the rank effect is channeled through sorting into better high schools and psychological mechanisms.
&lt;/p&gt;</description></item><item><title>&#30740;&#31350;&#25581;&#31034;&#20102;&#35843;&#26597;&#20154;&#31867;&#24863;&#21463;&#21644;&#24847;&#35265;&#26102;&#30340;&#19968;&#20010;&#22522;&#26412;&#38382;&#39064;&#65292;&#21363;&#20010;&#20307;&#24448;&#24448;&#20542;&#21521;&#20110;&#31616;&#21270;&#22238;&#31572;&#23610;&#24230;&#65292;&#22312;&#20998;&#26512;&#36825;&#31867;&#25968;&#25454;&#26102;&#24517;&#39035;&#32771;&#34385;&#36825;&#31181;&#24433;&#21709;&#12290;&#26412;&#30740;&#31350;&#36890;&#36807;&#25551;&#36848;&#24615;&#26041;&#27861;&#21644;&#22810;&#39033;Logit&#27169;&#22411;&#21457;&#29616;&#65292;&#25945;&#32946;&#31243;&#24230;&#21644;&#25910;&#20837;&#27700;&#24179;&#26159;&#36825;&#31181;&#24433;&#21709;&#30340;&#39044;&#27979;&#22240;&#32032;&#12290;&#21516;&#26102;&#32771;&#34385;&#24213;&#23618;&#31119;&#31049;&#21644;FVR&#31243;&#24230;&#30340;&#27169;&#22411;&#33021;&#22815;&#20272;&#35745;&#28508;&#22312;&#30340;&#20027;&#35266;&#24184;&#31119;&#24863;&#12290;</title><link>http://arxiv.org/abs/1807.11835</link><description>&lt;p&gt;
&#24184;&#31119;&#30340;&#35745;&#37327;&#32463;&#27982;&#23398;&#65306;&#25105;&#20204;&#20302;&#20272;&#20102;&#25945;&#32946;&#21644;&#25910;&#20837;&#30340;&#22238;&#25253;&#21527;&#65311;
&lt;/p&gt;
&lt;p&gt;
The econometrics of happiness: Are we underestimating the returns to education and income?. (arXiv:1807.11835v3 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/1807.11835
&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#25581;&#31034;&#20102;&#35843;&#26597;&#20154;&#31867;&#24863;&#21463;&#21644;&#24847;&#35265;&#26102;&#30340;&#19968;&#20010;&#22522;&#26412;&#38382;&#39064;&#65292;&#21363;&#20010;&#20307;&#24448;&#24448;&#20542;&#21521;&#20110;&#31616;&#21270;&#22238;&#31572;&#23610;&#24230;&#65292;&#22312;&#20998;&#26512;&#36825;&#31867;&#25968;&#25454;&#26102;&#24517;&#39035;&#32771;&#34385;&#36825;&#31181;&#24433;&#21709;&#12290;&#26412;&#30740;&#31350;&#36890;&#36807;&#25551;&#36848;&#24615;&#26041;&#27861;&#21644;&#22810;&#39033;Logit&#27169;&#22411;&#21457;&#29616;&#65292;&#25945;&#32946;&#31243;&#24230;&#21644;&#25910;&#20837;&#27700;&#24179;&#26159;&#36825;&#31181;&#24433;&#21709;&#30340;&#39044;&#27979;&#22240;&#32032;&#12290;&#21516;&#26102;&#32771;&#34385;&#24213;&#23618;&#31119;&#31049;&#21644;FVR&#31243;&#24230;&#30340;&#27169;&#22411;&#33021;&#22815;&#20272;&#35745;&#28508;&#22312;&#30340;&#20027;&#35266;&#24184;&#31119;&#24863;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25551;&#36848;&#20102;&#19968;&#31181;&#22312;&#35843;&#26597;&#20154;&#31867;&#24863;&#21463;&#21644;&#24847;&#35265;&#26102;&#26222;&#36941;&#23384;&#22312;&#30340;&#22522;&#26412;&#38382;&#39064;&#65292;&#21363;&#22312;&#25968;&#20540;&#23610;&#24230;&#19978;&#24341;&#23548;&#20027;&#35266;&#22238;&#31572;&#12290;&#26412;&#25991;&#36824;&#25552;&#20986;&#20102;&#19968;&#20010;&#35299;&#20915;&#26041;&#26696;&#12290;&#38382;&#39064;&#26159;&#19968;&#20123;&#20010;&#20307;&#65288;&#23588;&#20854;&#26159;&#21463;&#25945;&#32946;&#27700;&#24179;&#36739;&#20302;&#30340;&#20010;&#20307;&#65289;&#20542;&#21521;&#20110;&#31616;&#21270;&#22238;&#31572;&#23610;&#24230;&#65292;&#21482;&#32771;&#34385;&#19968;&#37096;&#20998;&#21487;&#33021;&#30340;&#22238;&#31572;&#36873;&#39033;&#65292;&#20363;&#22914;&#26368;&#20302;&#12289;&#20013;&#38388;&#21644;&#26368;&#39640;&#36873;&#39033;&#12290;&#22312;&#21407;&#21017;&#19978;&#65292;&#36825;&#31181;&#8220;&#28966;&#28857;&#20540;&#33293;&#20837;&#8221;&#65288;FVR&#65289;&#34892;&#20026;&#21363;&#20351;&#22312;&#36825;&#31867;&#25968;&#25454;&#20998;&#26512;&#20013;&#36890;&#24120;&#20351;&#29992;&#30340;&#24369;&#24207;&#20551;&#35774;&#19979;&#65292;&#20063;&#20351;&#20854;&#26080;&#25928;&#12290;&#20197;&#8220;&#24184;&#31119;&#8221;&#25110;&#29983;&#27963;&#28385;&#24847;&#24230;&#25968;&#25454;&#20026;&#20363;&#65292;&#25551;&#36848;&#24615;&#26041;&#27861;&#21644;&#22810;&#39033;Logit&#27169;&#22411;&#37117;&#34920;&#26126;&#65292;&#36825;&#31181;&#24433;&#21709;&#26159;&#26174;&#33879;&#30340;&#65292;&#24182;&#19988;&#25945;&#32946;&#31243;&#24230;&#65292;&#20197;&#21450;&#22312;&#36739;&#23567;&#31243;&#24230;&#19978;&#30340;&#25910;&#20837;&#27700;&#24179;&#26159;FVR&#34892;&#20026;&#30340;&#39044;&#27979;&#22240;&#32032;&#12290;&#19968;&#20010;&#21516;&#26102;&#32771;&#34385;&#21040;&#24213;&#23618;&#31119;&#31049;&#21644;FVR&#31243;&#24230;&#30340;&#27169;&#22411;&#33021;&#22815;&#20272;&#35745;&#28508;&#22312;&#30340;&#20027;&#35266;&#24184;&#31119;&#24863;&#65292;&#21363;&#21453;&#20107;&#23454;&#30340;&#23436;&#20840;&#24184;&#31119;&#24863;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper describes a fundamental and empirically conspicuous problem inherent to surveys of human feelings and opinions in which subjective responses are elicited on numerical scales. The paper also proposes a solution. The problem is a tendency by some individuals -- particularly those with low levels of education -- to simplify the response scale by considering only a subset of possible responses such as the lowest, middle, and highest. In principle, this ``focal value rounding'' (FVR) behavior renders invalid even the weak ordinality assumption often used in analysis of such data. With ``happiness'' or life satisfaction data as an example, descriptive methods and a multinomial logit model both show that the effect is large and that education and, to a lesser extent, income level are predictors of FVR behavior.  A model simultaneously accounting for the underlying wellbeing and for the degree of FVR is able to estimate the latent subjective wellbeing, i.e.~the counterfactual full-s
&lt;/p&gt;</description></item></channel></rss>