<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#36825;&#39033;&#30740;&#31350;&#25506;&#35752;&#20102;&#25551;&#36848;&#20004;&#20010;&#20915;&#31574;&#32773;&#34892;&#20026;&#30340;&#32852;&#21512;&#27010;&#29575;&#36873;&#25321;&#35268;&#21017;&#65292;&#21457;&#29616;&#23384;&#22312;&#21487;&#20197;&#28385;&#36275;&#21487;&#20998;&#31163;&#38480;&#21046;&#20294;&#19981;&#21487;&#20998;&#31163;&#30340;&#32416;&#32544;&#36873;&#25321;&#35268;&#21017;&#65292;&#36825;&#19968;&#32467;&#26524;&#23545;&#35268;&#21017;&#30340;&#38480;&#21046;&#24615;&#36136;&#36827;&#34892;&#20102;&#28145;&#20837;&#25506;&#35752;&#12290;</title><link>https://arxiv.org/abs/2403.09045</link><description>&lt;p&gt;
&#32416;&#32544;vs.&#21487;&#20998;&#31163;&#36873;&#25321;
&lt;/p&gt;
&lt;p&gt;
Entangled vs. Separable Choice
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.09045
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#30740;&#31350;&#25506;&#35752;&#20102;&#25551;&#36848;&#20004;&#20010;&#20915;&#31574;&#32773;&#34892;&#20026;&#30340;&#32852;&#21512;&#27010;&#29575;&#36873;&#25321;&#35268;&#21017;&#65292;&#21457;&#29616;&#23384;&#22312;&#21487;&#20197;&#28385;&#36275;&#21487;&#20998;&#31163;&#38480;&#21046;&#20294;&#19981;&#21487;&#20998;&#31163;&#30340;&#32416;&#32544;&#36873;&#25321;&#35268;&#21017;&#65292;&#36825;&#19968;&#32467;&#26524;&#23545;&#35268;&#21017;&#30340;&#38480;&#21046;&#24615;&#36136;&#36827;&#34892;&#20102;&#28145;&#20837;&#25506;&#35752;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#25551;&#36848;&#20004;&#20010;&#20915;&#31574;&#32773;&#34892;&#20026;&#30340;&#32852;&#21512;&#27010;&#29575;&#36873;&#25321;&#35268;&#21017;&#65292;&#27599;&#20010;&#20915;&#31574;&#32773;&#38754;&#20020;&#21487;&#33021;&#19981;&#21516;&#30340;&#33756;&#21333;&#12290;&#24403;&#36825;&#20123;&#36873;&#25321;&#35268;&#21017;&#21487;&#20197;&#20998;&#35299;&#20026;&#27599;&#20010;&#20010;&#20307;&#30340;&#33258;&#20027;&#36873;&#25321;&#65292;&#20165;&#36890;&#36807;&#23427;&#20204;&#30340;&#20010;&#20307;&#27010;&#29575;&#36873;&#25321;&#35268;&#21017;&#30456;&#20851;&#32852;&#26102;&#65292;&#23427;&#20204;&#26159;&#21487;&#20998;&#31163;&#30340;&#12290;&#23613;&#31649;&#26368;&#36817;&#23545;&#30740;&#31350;&#36825;&#31181;&#35268;&#21017;&#24456;&#24863;&#20852;&#36259;&#65292;&#20294;&#23545;&#23427;&#20204;&#30340;&#38480;&#21046;&#30340;&#23436;&#25972;&#21051;&#30011;&#20173;&#28982;&#26159;&#19968;&#20010;&#26410;&#35299;&#30340;&#38382;&#39064;&#12290;&#19968;&#20010;&#21512;&#29702;&#30340;&#29468;&#24819;&#26159;&#65292;&#36825;&#31181;&#23545;&#21487;&#20998;&#31163;&#32852;&#21512;&#36873;&#25321;&#30340;&#38480;&#21046;&#21487;&#20197;&#20998;&#35299;&#25104;&#20010;&#20154;&#36873;&#25321;&#30340;&#38480;&#21046;&#12290;&#25105;&#20204;&#23558;&#36825;&#20123;&#38480;&#21046;&#21629;&#21517;&#20026;&#21487;&#20998;&#31163;&#30340;&#65292;&#24182;&#19988;&#35777;&#26126;&#20102;&#22914;&#26524;&#33267;&#23569;&#19968;&#20010;&#20915;&#31574;&#32773;&#30340;&#27010;&#29575;&#36873;&#25321;&#35268;&#21017;&#21807;&#19968;&#22320;&#30830;&#23450;&#20102;&#23545;&#30830;&#23450;&#24615;&#36873;&#25321;&#35268;&#21017;&#30340;&#20998;&#24067;&#65292;&#21017;&#35813;&#29468;&#24819;&#25104;&#31435;&#12290;&#21542;&#21017;&#65292;&#23384;&#22312;&#28385;&#36275;&#21487;&#20998;&#31163;&#38480;&#21046;&#20294;&#19981;&#21487;&#20998;&#31163;&#30340;&#32416;&#32544;&#36873;&#25321;&#35268;&#21017;&#12290;&#32416;&#32544;&#36873;&#25321;&#30340;&#21487;&#33021;&#24615;&#20351;&#24471;&#20854;&#29305;&#24449;&#21270;&#21464;&#24471;&#22797;&#26434;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.09045v1 Announce Type: new  Abstract: We study joint probabilistic choice rules that describe the behavior of two decision makers, each facing a possibly different menu. These choice rules are separable when they can be factored into autonomous choices from each individual solely correlated through their individual probabilistic choice rules. Despite recent interest in studying such rules, a complete characterization of the restrictions on them remains an open question. A reasonable conjecture is that such restrictions on separable joint choice can be factored into individual choice restrictions. We name these restrictions separable and show that this conjecture is true if and only if the probabilistic choice rule of at least one decision maker uniquely identifies the distribution over deterministic choice rules. Otherwise, entangled choice rules exist that satisfy separable restrictions yet are not separable. The possibility of entangled choice complicates the characterizat
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;HD DCC-HEAVY&#31867;&#23618;&#27425;&#22240;&#23376;&#27169;&#22411;&#65292;&#29992;&#20110;&#39640;&#32500;&#25910;&#30410;&#30340;&#26465;&#20214;&#21327;&#26041;&#24046;&#30697;&#38453;&#65292;&#20855;&#26377;&#22797;&#26434;&#30340;&#21327;&#26041;&#24046;&#38750;&#23545;&#31216;&#21160;&#21147;&#23398;&#24182;&#29420;&#31435;&#20110;&#36164;&#20135;&#30340;&#27178;&#25130;&#38754;&#32500;&#24230;&#12290;&#23454;&#35777;&#32467;&#26524;&#26174;&#31034;&#35813;&#27169;&#22411;&#30456;&#36739;&#20110;&#26631;&#20934;&#22522;&#20934;&#21644;&#24050;&#26377;&#30340;&#23618;&#27425;&#22240;&#23376;&#27169;&#22411;&#20855;&#26377;&#26356;&#22909;&#30340;&#20869;&#26679;&#25311;&#21512;&#21644;&#32479;&#35745;&#32463;&#27982;&#24847;&#20041;&#19978;&#26174;&#33879;&#30340;&#22806;&#26679;&#22686;&#30410;&#12290;</title><link>http://arxiv.org/abs/2305.08488</link><description>&lt;p&gt;
&#39640;&#32500;&#21327;&#26041;&#24046;&#30697;&#38453;&#30340;&#20998;&#23618;DCC-HEAVY&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
Hierarchical DCC-HEAVY Model for High-Dimensional Covariance Matrices. (arXiv:2305.08488v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.08488
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;HD DCC-HEAVY&#31867;&#23618;&#27425;&#22240;&#23376;&#27169;&#22411;&#65292;&#29992;&#20110;&#39640;&#32500;&#25910;&#30410;&#30340;&#26465;&#20214;&#21327;&#26041;&#24046;&#30697;&#38453;&#65292;&#20855;&#26377;&#22797;&#26434;&#30340;&#21327;&#26041;&#24046;&#38750;&#23545;&#31216;&#21160;&#21147;&#23398;&#24182;&#29420;&#31435;&#20110;&#36164;&#20135;&#30340;&#27178;&#25130;&#38754;&#32500;&#24230;&#12290;&#23454;&#35777;&#32467;&#26524;&#26174;&#31034;&#35813;&#27169;&#22411;&#30456;&#36739;&#20110;&#26631;&#20934;&#22522;&#20934;&#21644;&#24050;&#26377;&#30340;&#23618;&#27425;&#22240;&#23376;&#27169;&#22411;&#20855;&#26377;&#26356;&#22909;&#30340;&#20869;&#26679;&#25311;&#21512;&#21644;&#32479;&#35745;&#32463;&#27982;&#24847;&#20041;&#19978;&#26174;&#33879;&#30340;&#22806;&#26679;&#22686;&#30410;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#31181;&#26032;&#30340;HD DCC-HEAVY&#31867;&#23618;&#27425;&#22240;&#23376;&#27169;&#22411;&#65292;&#29992;&#20110;&#39640;&#32500;&#25910;&#30410;&#30340;&#26465;&#20214;&#21327;&#26041;&#24046;&#30697;&#38453;&#65292;&#37319;&#29992;&#30456;&#24212;&#30340;&#26469;&#33258;&#26356;&#39640;&#39057;&#25968;&#25454;&#30340;&#23454;&#29616;&#24230;&#37327;&#12290;&#35813;&#24314;&#27169;&#26041;&#27861;&#20855;&#26377;&#22797;&#26434;&#30340;&#21327;&#26041;&#24046;&#38750;&#23545;&#31216;&#21160;&#21147;&#23398;&#20197;&#21450;&#31616;&#21333;&#30340;&#20272;&#35745;&#21644;&#39044;&#27979;&#26041;&#26696;&#65292;&#29420;&#31435;&#20110;&#25152;&#32771;&#34385;&#30340;&#36164;&#20135;&#30340;&#27178;&#25130;&#38754;&#32500;&#24230;&#12290;&#23454;&#35777;&#20998;&#26512;&#34920;&#26126;&#65292;HD DCC-HEAVY&#27169;&#22411;&#20855;&#26377;&#26356;&#22909;&#30340;&#20869;&#26679;&#25311;&#21512;&#65292;&#24182;&#30456;&#23545;&#20110;&#26631;&#20934;&#22522;&#20934;&#21644;&#29616;&#26377;&#30340;&#23618;&#27425;&#22240;&#23376;&#27169;&#22411;&#25552;&#20379;&#20102;&#32479;&#35745;&#21644;&#32463;&#27982;&#24847;&#20041;&#19978;&#26174;&#33879;&#30340;&#22806;&#26679;&#22686;&#30410;&#12290;&#22312;&#19981;&#21516;&#24066;&#22330;&#26465;&#20214;&#19979;&#65292;&#32467;&#26524;&#26159;&#31283;&#20581;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
We introduce a new HD DCC-HEAVY class of hierarchical-type factor models for conditional covariance matrices of high-dimensional returns, employing the corresponding realized measures built from higher-frequency data. The modelling approach features sophisticated asymmetric dynamics in covariances coupled with straightforward estimation and forecasting schemes, independent of the cross-sectional dimension of the assets under consideration. Empirical analyses suggest the HD DCC-HEAVY models have a better in-sample fit, and deliver statistically and economically significant out-of-sample gains relative to the standard benchmarks and existing hierarchical factor models. The results are robust under different market conditions.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#22522;&#20110;Hodge&#20998;&#35299;&#30340;&#25277;&#35937;&#21338;&#24328;&#26032;&#35299;&#20915;&#26041;&#26696;HPC&#65292;&#36890;&#36807;&#20351;&#29992;&#24494;&#20998;&#24418;&#24335;&#21644;Hodge&#20998;&#35299;&#31561;&#20960;&#20309;&#24037;&#20855;&#65292;&#20811;&#26381;&#20102;&#20256;&#32479;&#35299;&#20915;&#26041;&#26696;&#30340;&#24369;&#28857;&#65292;&#24182;&#20855;&#22791;&#20102;&#20013;&#31435;&#24615;&#12289;&#24378;&#21333;&#35843;&#24615;&#12289;&#20248;&#21183;&#24490;&#29615;&#36870;&#29420;&#31435;&#24615;&#21644;&#23545;&#20114;&#30456;&#20248;&#21183;&#30340;&#25935;&#24863;&#24615;&#31561;&#29305;&#24615;&#12290;</title><link>http://arxiv.org/abs/2109.14539</link><description>&lt;p&gt;
&#22522;&#20110;Hodge&#20998;&#35299;&#30340;&#25277;&#35937;&#21338;&#24328;&#26032;&#35299;&#20915;&#26041;&#26696;
&lt;/p&gt;
&lt;p&gt;
New Solution based on Hodge Decomposition for Abstract Games. (arXiv:2109.14539v4 [econ.TH] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2109.14539
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#22522;&#20110;Hodge&#20998;&#35299;&#30340;&#25277;&#35937;&#21338;&#24328;&#26032;&#35299;&#20915;&#26041;&#26696;HPC&#65292;&#36890;&#36807;&#20351;&#29992;&#24494;&#20998;&#24418;&#24335;&#21644;Hodge&#20998;&#35299;&#31561;&#20960;&#20309;&#24037;&#20855;&#65292;&#20811;&#26381;&#20102;&#20256;&#32479;&#35299;&#20915;&#26041;&#26696;&#30340;&#24369;&#28857;&#65292;&#24182;&#20855;&#22791;&#20102;&#20013;&#31435;&#24615;&#12289;&#24378;&#21333;&#35843;&#24615;&#12289;&#20248;&#21183;&#24490;&#29615;&#36870;&#29420;&#31435;&#24615;&#21644;&#23545;&#20114;&#30456;&#20248;&#21183;&#30340;&#25935;&#24863;&#24615;&#31561;&#29305;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;Hodge&#28508;&#21147;&#36873;&#25321;&#65288;HPC&#65289;&#65292;&#19968;&#31181;&#38024;&#23545;&#20855;&#26377;&#38750;&#33258;&#21453;&#20248;&#21183;&#20851;&#31995;&#30340;&#25277;&#35937;&#21338;&#24328;&#30340;&#26032;&#35299;&#20915;&#26041;&#26696;&#12290;&#35813;&#35299;&#20915;&#26041;&#26696;&#21033;&#29992;&#24494;&#20998;&#24418;&#24335;&#21644;Hodge&#20998;&#35299;&#31561;&#20960;&#20309;&#24037;&#20855;&#23545;&#25277;&#35937;&#21338;&#24328;&#36827;&#34892;&#20102;&#24314;&#27169;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#19968;&#20010;&#21487;&#34892;&#30340;&#31639;&#27861;&#65292;&#20197;&#21450;&#19968;&#31181;&#26032;&#30340;&#25277;&#35937;&#21338;&#24328;&#25968;&#25454;&#32467;&#26500;&#12290;&#20174;&#21338;&#24328;&#30340;&#35282;&#24230;&#26469;&#30475;&#65292;HPC&#20811;&#26381;&#20102;&#20256;&#32479;&#35299;&#20915;&#26041;&#26696;&#30340;&#19968;&#20123;&#24369;&#28857;&#12290;&#22312;&#23436;&#20840;&#24773;&#20917;&#19979;&#65292;HPC&#19982;Copeland&#36873;&#25321;&#19968;&#33268;&#65292;&#24182;&#19988;&#21487;&#20197;&#25193;&#23637;&#21040;&#35299;&#20915;&#20855;&#26377;&#36793;&#38469;&#20248;&#21183;&#30340;&#21338;&#24328;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;Hodge&#28508;&#21147;&#36873;&#25321;&#20855;&#22791;&#20013;&#31435;&#24615;&#12289;&#24378;&#21333;&#35843;&#24615;&#12289;&#20248;&#21183;&#24490;&#29615;&#36870;&#29420;&#31435;&#24615;&#21644;&#23545;&#20114;&#30456;&#20248;&#21183;&#30340;&#25935;&#24863;&#24615;&#31561;&#19977;&#20010;&#26222;&#36941;&#30340;&#20844;&#29702;&#29305;&#24615;&#12290;&#20026;&#20102;&#23558;HPC&#19982;Copeland&#36873;&#25321;&#22312;&#22823;&#26679;&#26412;&#30340;&#21338;&#24328;&#20013;&#36827;&#34892;&#27604;&#36739;&#65292;&#25105;&#20204;&#35774;&#35745;&#20102;&#20351;&#29992;&#19981;&#21516;&#35268;&#27169;&#21644;&#23436;&#25972;&#24615;&#30340;&#38543;&#26426;&#29983;&#25104;&#30340;&#25277;&#35937;&#21338;&#24328;&#30340;&#25968;&#20540;&#23454;&#39564;&#12290;&#23454;&#39564;&#32467;&#26524;&#23637;&#31034;&#20102;HPC&#22312;&#32479;&#35745;&#26041;&#38754;&#30340;&#20248;&#21183;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper proposes Hodge Potential Choice (HPC), a new solution for abstract games with irreflexive dominance relations. This solution is formulated by involving geometric tools like differential forms and Hodge decomposition onto abstract games. We provide a workable algorithm for the proposed solution with a new data structure of abstract games. From the view of gaming, HPC overcomes several weaknesses of conventional solutions. HPC coincides with Copeland Choice in complete cases and can be extended to slove games with marginal strengths. It will be proven that the Hodge potential choice possesses three prevalent axiomatic properties: neutrality, strong monotonicity, dominance cycle s reversing independence, and sensitivity to mutual dominance. To compare the HPC with Copeland Choice in large samples of games, we design digital experiments with randomly generated abstract games with different sizes and completeness. The experimental results present the advantage of HPC in the stati
&lt;/p&gt;</description></item></channel></rss>