<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#22312;&#22810;&#20010;&#23398;&#21306;&#30340;&#29615;&#22659;&#20013;&#65292;&#23398;&#29983;&#30340;&#30495;&#35802;&#25110;&#32769;&#32451;&#20197;&#21450;&#21463;&#38480;&#21046;&#31243;&#24230;&#30340;&#36873;&#25321;&#20250;&#24433;&#21709;&#20182;&#20204;&#30340;&#36873;&#25321;&#20559;&#22909;&#65292;&#30740;&#31350;&#21457;&#29616;&#19968;&#20123;&#20851;&#38190;&#32467;&#26524;&#20986;&#29616;&#39072;&#20498;&#65292;&#23398;&#29983;&#20043;&#38388;&#30340;&#20114;&#21160;&#20250;&#23548;&#33268;&#23398;&#21306;&#36873;&#25321;&#26426;&#21046;&#30340;&#19981;&#21516;&#20559;&#22909;&#12290;</title><link>https://arxiv.org/abs/2403.04530</link><description>&lt;p&gt;
&#22810;&#21306;&#22495;&#23398;&#26657;&#36873;&#25321;&#65306;&#22312;&#20960;&#20010;&#39046;&#22495;&#20013;&#36827;&#34892;&#28216;&#25103;
&lt;/p&gt;
&lt;p&gt;
Multi-District School Choice: Playing on Several Fields
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.04530
&lt;/p&gt;
&lt;p&gt;
&#22312;&#22810;&#20010;&#23398;&#21306;&#30340;&#29615;&#22659;&#20013;&#65292;&#23398;&#29983;&#30340;&#30495;&#35802;&#25110;&#32769;&#32451;&#20197;&#21450;&#21463;&#38480;&#21046;&#31243;&#24230;&#30340;&#36873;&#25321;&#20250;&#24433;&#21709;&#20182;&#20204;&#30340;&#36873;&#25321;&#20559;&#22909;&#65292;&#30740;&#31350;&#21457;&#29616;&#19968;&#20123;&#20851;&#38190;&#32467;&#26524;&#20986;&#29616;&#39072;&#20498;&#65292;&#23398;&#29983;&#20043;&#38388;&#30340;&#20114;&#21160;&#20250;&#23548;&#33268;&#23398;&#21306;&#36873;&#25321;&#26426;&#21046;&#30340;&#19981;&#21516;&#20559;&#22909;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#23558;Pathak&#21644;S\"onmez (2008)&#30340;&#24320;&#21019;&#24615;&#27169;&#22411;&#25193;&#23637;&#21040;&#19968;&#20010;&#20855;&#26377;&#22810;&#20010;&#23398;&#21306;&#30340;&#29615;&#22659;&#20013;&#65292;&#27599;&#20010;&#23398;&#21306;&#37117;&#36816;&#34892;&#20854;&#33258;&#24049;&#30340;&#29420;&#31435;&#20013;&#24515;&#21270;&#21305;&#37197;&#65292;&#37325;&#28857;&#20851;&#27880;&#20004;&#20010;&#23398;&#21306;&#30340;&#24773;&#20917;&#12290;&#22312;&#25105;&#20204;&#30340;&#35774;&#32622;&#20013;&#65292;&#38500;&#20102;&#27599;&#20010;&#23398;&#29983;&#26159;&#30495;&#35802;&#36824;&#26159;&#32769;&#32451;&#20043;&#22806;&#65292;&#22905;&#36824;&#21487;&#20197;&#26159;&#21463;&#38480;&#21046;&#30340; - &#21482;&#33021;&#30003;&#35831;&#33258;&#24049;&#23621;&#20303;&#23398;&#21306;&#20869;&#30340;&#23398;&#26657; - &#25110;&#19981;&#21463;&#38480;&#21046;&#30340; - &#33021;&#22815;&#36873;&#25321;&#20219;&#20309;&#19968;&#20010;&#23398;&#21306;&#36827;&#34892;&#30003;&#35831;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102; Pathak&#21644;S\"onmez (2008) &#20013;&#30340;&#20960;&#20010;&#20851;&#38190;&#32467;&#26524;&#22312;&#24615;&#36136;&#19978;&#21457;&#29983;&#20102;&#21464;&#21270;&#65306; &#19968;&#20010;&#32769;&#32451;&#30340;&#23398;&#29983;&#21487;&#33021;&#24076;&#26395;&#19968;&#20010;&#30495;&#35802;&#30340;&#23398;&#29983;&#21464;&#24471;&#32769;&#32451;&#65292;&#19968;&#20010;&#32769;&#32451;&#30340;&#23398;&#29983;&#21487;&#33021;&#26356;&#21916;&#27426;&#33258;&#24049;&#25152;&#22312;&#23398;&#21306;&#20351;&#29992;&#24310;&#36831;&#25509;&#21463;&#32780;&#19981;&#26159;&#27874;&#22763;&#39039;&#26426;&#21046;&#65292;&#32780;&#19981;&#32771;&#34385;&#20854;&#20182;&#23398;&#21306;&#20351;&#29992;&#30340;&#26426;&#21046;&#12290;&#25105;&#20204;&#36827;&#19968;&#27493;&#30740;&#31350;&#20102;&#23398;&#29983;&#23545;&#20854;&#20182;&#23398;&#29983;&#21463;&#38480;&#27700;&#24179;&#30340;&#20559;&#22909;&#12290;&#20854;&#20013;&#35768;&#22810;&#29616;&#35937;&#22823;&#37327;&#20986;&#29616;&#22312;&#22823;&#35268;&#27169;&#30340;&#38543;&#26426;&#20013;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.04530v1 Announce Type: cross  Abstract: We extend the seminal model of Pathak and S\"onmez (2008) to a setting with multiple school districts, each running its own separate centralized match, and focus on the case of two districts. In our setting, in addition to each student being either sincere or sophisticated, she is also either constrained - able to apply only to schools within her own district of residence - or unconstrained - able to choose any single district within which to apply. We show that several key results from Pathak and S\"onmez (2008) qualitatively flip: A sophisticated student may prefer for a sincere student to become sophisticated, and a sophisticated student may prefer for her own district to use Deferred Acceptance over the Boston Mechanism, irrespective of the mechanism used by the other district. We furthermore investigate the preferences of students over the constraint levels of other students. Many of these phenomena appear abundantly in large rand
&lt;/p&gt;</description></item><item><title>&#36825;&#31687;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#21338;&#24328;&#35770;&#27169;&#22411;&#65292;&#30740;&#31350;&#20102;&#22312;&#38750;&#36229;&#32423;&#22823;&#22269;&#20855;&#26377;&#24322;&#36136;&#20559;&#22909;&#21644;&#36164;&#28304;&#20998;&#37197;&#30340;&#24773;&#20917;&#19979;&#65292;&#23427;&#20204;&#22914;&#20309;&#36890;&#36807;&#32852;&#30431;&#30340;&#24418;&#25104;&#26469;&#24433;&#21709;&#36229;&#32423;&#22823;&#22269;&#30340;&#31454;&#20105;&#65292;&#24182;&#25581;&#31034;&#20102;&#38750;&#36229;&#32423;&#22823;&#22269;&#23545;&#36229;&#32423;&#22823;&#22269;&#20855;&#26377;&#19968;&#23450;&#30340;&#24433;&#21709;&#21147;&#12290;</title><link>http://arxiv.org/abs/2209.10206</link><description>&lt;p&gt;
&#38750;&#36229;&#32423;&#22823;&#22269;&#30340;&#21147;&#37327;
&lt;/p&gt;
&lt;p&gt;
The Power of Non-Superpowers. (arXiv:2209.10206v3 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2209.10206
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#21338;&#24328;&#35770;&#27169;&#22411;&#65292;&#30740;&#31350;&#20102;&#22312;&#38750;&#36229;&#32423;&#22823;&#22269;&#20855;&#26377;&#24322;&#36136;&#20559;&#22909;&#21644;&#36164;&#28304;&#20998;&#37197;&#30340;&#24773;&#20917;&#19979;&#65292;&#23427;&#20204;&#22914;&#20309;&#36890;&#36807;&#32852;&#30431;&#30340;&#24418;&#25104;&#26469;&#24433;&#21709;&#36229;&#32423;&#22823;&#22269;&#30340;&#31454;&#20105;&#65292;&#24182;&#25581;&#31034;&#20102;&#38750;&#36229;&#32423;&#22823;&#22269;&#23545;&#36229;&#32423;&#22823;&#22269;&#20855;&#26377;&#19968;&#23450;&#30340;&#24433;&#21709;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#21338;&#24328;&#35770;&#27169;&#22411;&#65292;&#30740;&#31350;&#38750;&#36229;&#32423;&#22823;&#22269;&#22312;&#20855;&#26377;&#24322;&#36136;&#20559;&#22909;&#21644;&#36164;&#28304;&#20998;&#37197;&#30340;&#24773;&#20917;&#19979;&#22914;&#20309;&#22609;&#36896;&#36229;&#32423;&#22823;&#22269;&#22312;&#21183;&#21147;&#33539;&#22260;&#20869;&#30340;&#31454;&#20105;&#12290;&#20004;&#20010;&#36229;&#32423;&#22823;&#22269;&#36827;&#34892;&#25552;&#20379;&#20465;&#20048;&#37096;&#20844;&#20849;&#21697;&#30340;&#26031;&#22612;&#20811;&#23572;&#20271;&#26684;&#21338;&#24328;&#65292;&#32780;&#38750;&#36229;&#32423;&#22823;&#22269;&#21017;&#36890;&#36807;&#24418;&#25104;&#32852;&#30431;&#26469;&#21152;&#20837;&#20465;&#20048;&#37096;&#24182;&#32771;&#34385;&#22806;&#37096;&#24615;&#30340;&#23384;&#22312;&#12290;&#32852;&#30431;&#30340;&#24418;&#25104;&#21462;&#20915;&#20110;&#38750;&#36229;&#32423;&#22823;&#22269;&#30340;&#29305;&#24449;&#65292;&#24433;&#21709;&#30528;&#36229;&#32423;&#22823;&#22269;&#30340;&#34892;&#20026;&#65292;&#20174;&#32780;&#24433;&#21709;&#20465;&#20048;&#37096;&#30340;&#35268;&#27169;&#12290;&#20174;&#36825;&#20010;&#24847;&#20041;&#19978;&#35828;&#65292;&#38750;&#36229;&#32423;&#22823;&#22269;&#23545;&#36229;&#32423;&#22823;&#22269;&#25317;&#26377;&#19968;&#23450;&#30340;&#24433;&#21709;&#21147;&#12290;&#25105;&#20204;&#30740;&#31350;&#20102;&#23376;&#21338;&#24328;&#23436;&#32654;&#32435;&#20160;&#22343;&#34913;&#65292;&#24182;&#27169;&#25311;&#20102;&#28216;&#25103;&#65292;&#20197;&#25551;&#32472;&#32654;&#22269;&#21644;&#20013;&#22269;&#22914;&#20309;&#26681;&#25454;&#20854;&#20182;&#22269;&#23478;&#26469;&#24418;&#25104;&#20182;&#20204;&#30340;&#20465;&#20048;&#37096;&#12290;
&lt;/p&gt;
&lt;p&gt;
We propose a game-theoretic model to investigate how non-superpowers with heterogenous preferences and endowments shape the superpower competition for a sphere of influence. Two superpowers play a Stackelberg game of providing club goods while non-superpowers form coalitions to join a club in the presence of externalities. The coalition formation, which depends on the characteristics of non-superpowers, influences the behavior of superpowers and thus the club size. In this sense, non-superpowers have a power over superpowers. We study the subgame perfect Nash equilibrium and simulate the game to characterize how the US and China form their clubs depending on other countries.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#19968;&#31181;&#20351;&#29992;&#26480;&#20811;&#20992;&#31243;&#24207;&#20462;&#27491;&#24102;&#26377;&#20010;&#20307;&#22266;&#23450;&#25928;&#24212;&#30340;&#38750;&#32447;&#24615;&#32593;&#32476;&#25968;&#25454;&#27169;&#22411;&#20559;&#24046;&#30340;&#26032;&#26041;&#27861;&#65292;&#21487;&#36866;&#29992;&#20110;&#26377;&#21521;&#21644;&#26080;&#21521;&#32593;&#32476;&#65292;&#23545;&#38750;&#20108;&#20803;&#32467;&#26524;&#21464;&#37327;&#36827;&#34892;&#20272;&#35745;&#65292;&#24182;&#21487;&#29992;&#20110;&#20462;&#27491;&#24179;&#22343;&#25928;&#24212;&#21644;&#21453;&#20107;&#23454;&#32467;&#23616;&#30340;&#20272;&#31639;&#12290;</title><link>http://arxiv.org/abs/2203.15603</link><description>&lt;p&gt;
&#20462;&#27491;&#24102;&#26377;&#22266;&#23450;&#25928;&#24212;&#30340;&#38750;&#32447;&#24615;&#32593;&#32476;&#25968;&#25454;&#27169;&#22411;&#30340;&#20272;&#35745;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Estimating Nonlinear Network Data Models with Fixed Effects. (arXiv:2203.15603v2 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2203.15603
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#19968;&#31181;&#20351;&#29992;&#26480;&#20811;&#20992;&#31243;&#24207;&#20462;&#27491;&#24102;&#26377;&#20010;&#20307;&#22266;&#23450;&#25928;&#24212;&#30340;&#38750;&#32447;&#24615;&#32593;&#32476;&#25968;&#25454;&#27169;&#22411;&#20559;&#24046;&#30340;&#26032;&#26041;&#27861;&#65292;&#21487;&#36866;&#29992;&#20110;&#26377;&#21521;&#21644;&#26080;&#21521;&#32593;&#32476;&#65292;&#23545;&#38750;&#20108;&#20803;&#32467;&#26524;&#21464;&#37327;&#36827;&#34892;&#20272;&#35745;&#65292;&#24182;&#21487;&#29992;&#20110;&#20462;&#27491;&#24179;&#22343;&#25928;&#24212;&#21644;&#21453;&#20107;&#23454;&#32467;&#23616;&#30340;&#20272;&#31639;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#19968;&#31181;&#26032;&#30340;&#26041;&#27861;&#26469;&#20462;&#27491;&#24102;&#26377;&#29305;&#23450;&#20010;&#20307;&#30340;&#22266;&#23450;&#29305;&#24449;&#30340;&#20108;&#20803;&#27169;&#22411;&#8212;&#8212;&#20854;&#20013;&#21253;&#25324;&#21516;&#36136;&#24615;&#21644;&#24230;&#24322;&#36136;&#24615;&#30340;&#20108;&#20803;&#38142;&#25509;&#24418;&#25104;&#27169;&#22411;&#30340;&#20559;&#24046;&#12290;&#25152;&#25552;&#20986;&#30340;&#26041;&#27861;&#20351;&#29992;&#20102;&#26480;&#20811;&#20992;&#65288;jackknife&#65289;&#31243;&#24207;&#26469;&#22788;&#29702;&#20851;&#20110;&#20598;&#28982;&#21442;&#25968;&#30340;&#38382;&#39064;&#12290;&#35813;&#26041;&#27861;&#21487;&#24212;&#29992;&#20110;&#26377;&#21521;&#21644;&#26080;&#21521;&#32593;&#32476;&#65292;&#24182;&#19988;&#20801;&#35768;&#20351;&#29992;&#38750;&#20108;&#20803;&#32467;&#26524;&#21464;&#37327;&#65292;&#24182;&#21487;&#29992;&#20110;&#20462;&#27491;&#24179;&#22343;&#25928;&#24212;&#21644;&#21453;&#20107;&#23454;&#32467;&#23616;&#30340;&#20272;&#35745;&#12290;&#20316;&#32773;&#36824;&#23637;&#31034;&#20102;&#22914;&#20309;&#20351;&#29992;&#26480;&#20811;&#20992;&#26469;&#32416;&#27491;&#23545;&#22810;&#20010;&#33410;&#28857;&#30340;&#22266;&#23450;&#25928;&#24212;&#24179;&#22343;&#20540;&#30340;&#20559;&#24046;&#65292;&#20363;&#22914;&#19977;&#20803;&#32452;&#25110;&#22235;&#20803;&#32452;&#12290;&#26368;&#21518;&#65292;&#20316;&#32773;&#22312;&#19968;&#20010;&#20851;&#20110;&#36328;&#22269;&#36827;&#20986;&#21475;&#20851;&#31995;&#30340;&#24341;&#21147;&#27169;&#22411;&#30340;&#24212;&#29992;&#20013;&#23637;&#31034;&#20102;&#35813;&#20272;&#35745;&#22120;&#30340;&#23454;&#29992;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
I introduce a new method for bias correction of dyadic models with agent-specific fixed-effects, including the dyadic link formation model with homophily and degree heterogeneity. The proposed approach uses a jackknife procedure to deal with the incidental parameters problem. The method can be applied to both directed and undirected networks, allows for non-binary outcome variables, and can be used to bias correct estimates of average effects and counterfactual outcomes. I also show how the jackknife can be used to bias-correct fixed effect averages over functions that depend on multiple nodes, e.g. triads or tetrads in the network. As an example, I implement specification tests for dependence across dyads, such as reciprocity or transitivity. Finally, I demonstrate the usefulness of the estimator in an application to a gravity model for import/export relationships across countries.
&lt;/p&gt;</description></item></channel></rss>