<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#26412;&#25991;&#21033;&#29992;&#25193;&#23637;&#30340;&#20445;&#24207;&#26426;&#21046;&#65292;&#23558;&#20854;&#24212;&#29992;&#20110;&#25351;&#25968;&#26063;&#20998;&#24067;&#20197;&#25552;&#39640;&#21516;&#34892;&#35780;&#23457;&#30340;&#36136;&#37327;&#65292;&#24182;&#21457;&#29616;&#20316;&#32773;&#30340;&#21516;&#34892;&#35780;&#20998;&#21487;&#20197;&#36739;&#20934;&#30830;&#22320;&#22312;&#19981;&#38656;&#35201;&#30693;&#36947;&#20855;&#20307;&#20998;&#24067;&#24773;&#20917;&#19979;&#36827;&#34892;&#35843;&#25972;&#12290;</title><link>http://arxiv.org/abs/2304.11160</link><description>&lt;p&gt;
&#21033;&#29992;&#20445;&#24207;&#26426;&#21046;&#25552;&#39640;&#26426;&#22120;&#23398;&#20064;&#21644;&#20154;&#24037;&#26234;&#33021;&#20250;&#35758;&#30340;&#21516;&#34892;&#35780;&#23457;
&lt;/p&gt;
&lt;p&gt;
The Isotonic Mechanism for Exponential Family Estimation. (arXiv:2304.11160v1 [math.ST])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.11160
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#21033;&#29992;&#25193;&#23637;&#30340;&#20445;&#24207;&#26426;&#21046;&#65292;&#23558;&#20854;&#24212;&#29992;&#20110;&#25351;&#25968;&#26063;&#20998;&#24067;&#20197;&#25552;&#39640;&#21516;&#34892;&#35780;&#23457;&#30340;&#36136;&#37327;&#65292;&#24182;&#21457;&#29616;&#20316;&#32773;&#30340;&#21516;&#34892;&#35780;&#20998;&#21487;&#20197;&#36739;&#20934;&#30830;&#22320;&#22312;&#19981;&#38656;&#35201;&#30693;&#36947;&#20855;&#20307;&#20998;&#24067;&#24773;&#20917;&#19979;&#36827;&#34892;&#35843;&#25972;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#33268;&#21147;&#20110;&#25193;&#23637;&#20445;&#24207;&#26426;&#21046;&#65292;&#23558;&#20854;&#24212;&#29992;&#20110;&#25351;&#25968;&#26063;&#20998;&#24067;&#20197;&#25552;&#39640;&#21516;&#34892;&#35780;&#23457;&#30340;&#36136;&#37327;&#12290;&#35813;&#26426;&#21046;&#21487;&#29983;&#25104;&#19982;&#21407;&#22987;&#35780;&#20998;&#25509;&#36817;&#30340;&#35843;&#25972;&#20998;&#25968;&#65292;&#24182;&#31526;&#21512;&#20316;&#32773;&#25351;&#23450;&#30340;&#25490;&#21517;&#35201;&#27714;&#65292;&#24471;&#21040;&#24191;&#27867;&#30340;&#25351;&#25968;&#26063;&#20998;&#24067;&#24212;&#29992;&#65292;&#32780;&#19988;&#19981;&#38656;&#35201;&#30693;&#36947;&#20855;&#20307;&#30340;&#20998;&#24067;&#24418;&#24335;&#12290;&#30740;&#31350;&#34920;&#26126;&#65292;&#22312;&#19968;&#23450;&#30340;&#25351;&#25968;&#26063;&#20998;&#24067;&#19979;&#65292;&#22914;&#26524;&#20316;&#32773;&#30340;&#25928;&#29992;&#20989;&#25968;&#37319;&#29992;&#31616;&#21333;&#30340;&#20984;&#21487;&#21152;&#20989;&#25968;&#65292;&#21017;&#28608;&#21169;&#20316;&#32773;&#25552;&#20379;&#20934;&#30830;&#30340;&#25490;&#21517;&#24314;&#35758;&#12290;
&lt;/p&gt;
&lt;p&gt;
In 2023, the International Conference on Machine Learning (ICML) required authors with multiple submissions to rank their submissions based on perceived quality. In this paper, we aim to employ these author-specified rankings to enhance peer review in machine learning and artificial intelligence conferences by extending the Isotonic Mechanism (Su, 2021, 2022) to exponential family distributions. This mechanism generates adjusted scores closely align with the original scores while adhering to author-specified rankings. Despite its applicability to a broad spectrum of exponential family distributions, this mechanism's implementation does not necessitate knowledge of the specific distribution form. We demonstrate that an author is incentivized to provide accurate rankings when her utility takes the form of a convex additive function of the adjusted review scores. For a certain subclass of exponential family distributions, we prove that the author reports truthfully only if the question in
&lt;/p&gt;</description></item><item><title>&#8220;&#19968;&#20992;&#20999;&#8221;&#30340;&#20844;&#20849;&#24037;&#31243;&#25215;&#21253;&#31574;&#30053;&#24182;&#19981;&#33021;&#21462;&#24471;&#24456;&#22909;&#30340;&#25928;&#26524;&#65292;&#32780;&#36873;&#25321;&#8220;&#35774;&#35745;&#21644;&#24314;&#36896;&#21512;&#21516;&#8221;&#21017;&#33021;&#22815;&#26174;&#33879;&#25552;&#39640;&#20844;&#20849;&#24037;&#31243;&#25191;&#34892;&#30340;&#32489;&#25928;&#24182;&#38477;&#20302;&#20132;&#26131;&#25104;&#26412;&#65292;&#36825;&#23545;&#25919;&#31574;&#26377;&#24456;&#22823;&#30340;&#21551;&#31034;&#12290;</title><link>http://arxiv.org/abs/2304.10776</link><description>&lt;p&gt;
&#8220;&#19968;&#20992;&#20999;&#8221;&#30340;&#20844;&#20849;&#24037;&#31243;&#25215;&#21253;&#26159;&#22914;&#20309;&#20570;&#21040;&#26356;&#22909;&#30340;&#65311;&#24847;&#22823;&#21033;&#22522;&#30784;&#35774;&#26045;&#20379;&#24212;&#30340;&#35780;&#20272;&#12290;
&lt;/p&gt;
&lt;p&gt;
How 'one-size-fits-all' public works contract does it better? An assessment of infrastructure provision in Italy. (arXiv:2304.10776v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.10776
&lt;/p&gt;
&lt;p&gt;
&#8220;&#19968;&#20992;&#20999;&#8221;&#30340;&#20844;&#20849;&#24037;&#31243;&#25215;&#21253;&#31574;&#30053;&#24182;&#19981;&#33021;&#21462;&#24471;&#24456;&#22909;&#30340;&#25928;&#26524;&#65292;&#32780;&#36873;&#25321;&#8220;&#35774;&#35745;&#21644;&#24314;&#36896;&#21512;&#21516;&#8221;&#21017;&#33021;&#22815;&#26174;&#33879;&#25552;&#39640;&#20844;&#20849;&#24037;&#31243;&#25191;&#34892;&#30340;&#32489;&#25928;&#24182;&#38477;&#20302;&#20132;&#26131;&#25104;&#26412;&#65292;&#36825;&#23545;&#25919;&#31574;&#26377;&#24456;&#22823;&#30340;&#21551;&#31034;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20844;&#20849;&#22522;&#30784;&#35774;&#26045;&#37319;&#36141;&#26159;&#20844;&#20849;&#21644;&#31169;&#20154;&#25237;&#36164;&#20197;&#21450;&#32463;&#27982;&#21644;&#31038;&#20250;&#36164;&#26412;&#22686;&#38271;&#30340;&#20808;&#20915;&#26465;&#20214;&#12290;&#28982;&#32780;&#65292;&#25191;&#34892;&#20302;&#25928;&#20005;&#37325;&#38459;&#30861;&#20102;&#22522;&#30784;&#35774;&#26045;&#25552;&#20379;&#21644;&#21033;&#30410;&#20132;&#20184;&#12290;&#20844;&#20849;&#22522;&#30784;&#35774;&#26045;&#37319;&#36141;&#26368;&#25935;&#24863;&#30340;&#38454;&#27573;&#20043;&#19968;&#26159;&#35774;&#35745;&#65292;&#22240;&#20026;&#23427;&#28508;&#22312;&#22320;&#22312;&#25191;&#34892;&#38454;&#27573;&#21019;&#24314;&#37319;&#36141;&#20154;&#21644;&#25215;&#21253;&#21830;&#20043;&#38388;&#30340;&#25112;&#30053;&#20851;&#31995;&#65292;&#24433;&#21709;&#21512;&#21516;&#30340;&#25104;&#26412;&#21644;&#25345;&#32493;&#26102;&#38388;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#21033;&#29992;&#38750;&#21442;&#25968;&#21069;&#27839;&#21644;&#20542;&#21521;&#24615;&#24471;&#20998;&#21305;&#37197;&#30340;&#26368;&#26032;&#21457;&#23637;&#65292;&#25105;&#20204;&#35780;&#20272;&#20102;&#24847;&#22823;&#21033;&#20844;&#20849;&#24037;&#31243;&#25191;&#34892;&#30340;&#34920;&#29616;&#12290;&#20998;&#26512;&#25552;&#20379;&#20102;&#26377;&#21147;&#30340;&#35777;&#25454;&#65292;&#34920;&#26126;&#37319;&#36141;&#20154;&#36873;&#25321;&#35774;&#35745;&#21644;&#24314;&#36896;&#21512;&#21516;&#21487;&#20197;&#26174;&#33879;&#25552;&#39640;&#25191;&#34892;&#32489;&#25928;&#65292;&#20174;&#32780;&#38477;&#20302;&#20132;&#26131;&#25104;&#26412;&#65292;&#20351;&#25215;&#21253;&#21830;&#21487;&#20197;&#26356;&#22909;&#22320;&#36866;&#24212;&#39033;&#30446;&#30340;&#25191;&#34892;&#12290;&#25105;&#20204;&#30340;&#21457;&#29616;&#20855;&#26377;&#30456;&#24403;&#22823;&#30340;&#25919;&#31574;&#21547;&#20041;&#12290;
&lt;/p&gt;
&lt;p&gt;
Public infrastructure procurement is crucial as a prerequisite for public and private investments and for economic and social capital growth. However, low performance in execution severely hinders infrastructure provision and benefits delivery. One of the most sensitive phases in public infrastructure procurement is the design because of the strategic relationship that it potentially creates between procurers and contractors in the execution stage, affecting the costs and the duration of the contract. In this paper, using recent developments in non-parametric frontiers and propensity score matching, we evaluate the performance in the execution of public works in Italy. The analysis provides robust evidence of significant improvement of performance where procurers opt for a design and build contracts, which lead to lower transaction costs, allowing contractors to better accommodate the project in the execution. Our findings bear considerable policy implications.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#20855;&#26377;&#20005;&#26684;&#27491;&#20540;&#20215;&#20540;&#30340;&#38598;&#20307;&#21338;&#24328;&#65292;&#22312;&#35813;&#21338;&#24328;&#20013;&#65292;&#36890;&#36807;&#23558;&#31283;&#23450;&#35299;&#36716;&#21270;&#20026;&#20998;&#25968;&#27169;&#24335;&#65292;&#24471;&#20986;&#20102;&#19968;&#31181;&#21487;&#25490;&#24207;&#30340;&#8220;&#21521;&#24515;&#24615;&#8221;&#65292;&#24182;&#25581;&#31034;&#20986;&#20102;&#39118;&#38505;&#21388;&#24694;&#19982;&#21512;&#20316;&#20043;&#38388;&#30340;&#20851;&#31995;&#12290;</title><link>http://arxiv.org/abs/2304.10652</link><description>&lt;p&gt;
&#20005;&#26684;&#27491;&#20540;&#38598;&#21512;&#21338;&#24328;&#30340;&#20559;&#24207;&#21450;&#20174;&#39118;&#38505;&#21388;&#24694;&#21040;&#21512;&#20316;&#30340;&#32852;&#31995;
&lt;/p&gt;
&lt;p&gt;
A Partial Order for Strictly Positive Coalitional Games and a Link from Risk Aversion to Cooperation. (arXiv:2304.10652v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.10652
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#20855;&#26377;&#20005;&#26684;&#27491;&#20540;&#20215;&#20540;&#30340;&#38598;&#20307;&#21338;&#24328;&#65292;&#22312;&#35813;&#21338;&#24328;&#20013;&#65292;&#36890;&#36807;&#23558;&#31283;&#23450;&#35299;&#36716;&#21270;&#20026;&#20998;&#25968;&#27169;&#24335;&#65292;&#24471;&#20986;&#20102;&#19968;&#31181;&#21487;&#25490;&#24207;&#30340;&#8220;&#21521;&#24515;&#24615;&#8221;&#65292;&#24182;&#25581;&#31034;&#20986;&#20102;&#39118;&#38505;&#21388;&#24694;&#19982;&#21512;&#20316;&#20043;&#38388;&#30340;&#20851;&#31995;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25506;&#35752;&#20102;&#20855;&#26377;&#20005;&#26684;&#27491;&#20540;&#20215;&#20540;&#30340;&#38598;&#20307;&#21338;&#24328;&#12290;&#36825;&#31181;&#21338;&#24328;&#30340;&#20010;&#20154;&#29702;&#24615;&#20998;&#37197;&#26377;&#28165;&#26224;&#30340;&#20998;&#25968;&#35299;&#37322;&#12290;&#35768;&#22810;&#27010;&#24565;&#65292;&#21253;&#25324;&#38271;&#26399;&#23384;&#22312;&#30340;&#26680;&#24515;&#20197;&#21450;&#26368;&#36817;&#30001;Yang&#25552;&#20986;&#30340;&#20854;&#20182;&#31283;&#23450;&#27010;&#24565;&#65292;&#37117;&#21487;&#20197;&#22312;&#36825;&#31181;&#20998;&#25968;&#27169;&#24335;&#19979;&#37325;&#26032;&#34920;&#36848;&#12290;&#21518;&#19968;&#31181;&#27169;&#24335;&#20801;&#35768;&#22312;&#28216;&#25103;&#20043;&#38388;&#36827;&#34892;&#26576;&#31181;&#25490;&#24207;&#65292;&#25105;&#20204;&#35748;&#20026;&#36825;&#26159;&#8220;&#21521;&#24515;&#24615;&#8221;&#30340;&#24847;&#20041;&#65292;&#21487;&#20197;&#25512;&#23548;&#20986;&#28216;&#25103;&#31283;&#23450;&#35299;&#30340;&#26126;&#26174;&#21487;&#25551;&#36848;&#30340;&#20559;&#31227;&#12290;&#24403;&#38598;&#21512;&#30340;&#20215;&#20540;&#26082;&#24314;&#31435;&#22312;&#38543;&#26426;&#32467;&#26524;&#19978;&#65292;&#21448;&#24314;&#31435;&#22312;&#19968;&#20010;&#34920;&#31034;&#29609;&#23478;&#20139;&#21463;&#20854;&#20221;&#39069;&#30340;&#20849;&#21516;&#27491;&#40784;&#27425;&#22870;&#21169;&#20989;&#25968;&#19978;&#26102;&#65292;&#19978;&#36848;&#32852;&#31995;&#21487;&#20197;&#24110;&#21161;&#35299;&#37322;&#20026;&#20160;&#20040;&#23545;&#39118;&#38505;&#30340;&#21388;&#24694;&#32463;&#24120;&#20419;&#36827;&#21512;&#20316;&#12290;
&lt;/p&gt;
&lt;p&gt;
We deal with coalitional games possessing strictly positive values. Individually rational allocations of such a game has clear fractional interpretations. Many concepts, including the long-existing core and other stability notions more recently proposed by Yang \cite{Y22}, can all be re-cast in this fractional mode. The latter allows a certain ranking between games, which we deem as in the sense of ``centripetality'', to imply a clearly describable shift in the games' stable solutions. %These trends would be preserved after the imposition of the restriction that fractions be positive as well. When coalitions' values are built on both random outcomes and a common positively homogeneous reward function characterizing players' enjoyments from their shares, the above link could help explain why aversion to risk often promotes cooperation.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#20998;&#21306;&#20998;&#37197;&#23545;&#19979;&#30340;&#32852;&#30431;&#21338;&#24328;&#65292;&#25552;&#20986;&#20102;&#24378;&#12289;&#20013;&#31561;&#21644;&#24369;&#31283;&#23450;&#27010;&#24565;&#65292;&#24182;&#35777;&#26126;&#20102;&#24378;&#31283;&#23450;&#27010;&#24565;&#19982;&#20256;&#32479;&#26680;&#24515;&#30456;&#23481;&#65292;&#20013;&#31561;&#21644;&#24369;&#31283;&#23450;&#27010;&#24565;&#25353;&#29031;&#39044;&#26399;&#24378;&#24230;&#25490;&#24207;&#12290;</title><link>http://arxiv.org/abs/2304.10651</link><description>&lt;p&gt;
&#20998;&#21306;&#31283;&#23450;&#30340;&#32852;&#30431;&#21338;&#24328;
&lt;/p&gt;
&lt;p&gt;
Partition-based Stability of Coalitional Games. (arXiv:2304.10651v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.10651
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#20998;&#21306;&#20998;&#37197;&#23545;&#19979;&#30340;&#32852;&#30431;&#21338;&#24328;&#65292;&#25552;&#20986;&#20102;&#24378;&#12289;&#20013;&#31561;&#21644;&#24369;&#31283;&#23450;&#27010;&#24565;&#65292;&#24182;&#35777;&#26126;&#20102;&#24378;&#31283;&#23450;&#27010;&#24565;&#19982;&#20256;&#32479;&#26680;&#24515;&#30456;&#23481;&#65292;&#20013;&#31561;&#21644;&#24369;&#31283;&#23450;&#27010;&#24565;&#25353;&#29031;&#39044;&#26399;&#24378;&#24230;&#25490;&#24207;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20851;&#27880;&#20110;&#32852;&#30431;&#21338;&#24328;&#30340;&#31283;&#23450;&#24615;&#65292;&#21363;&#21487;&#36716;&#31227;&#25928;&#29992;&#30340;&#21512;&#20316;&#21338;&#24328;&#12290;&#39318;&#20808;&#65292;&#26680;&#24515;&#27010;&#24565;&#21487;&#20197;&#34987;&#24369;&#21270;&#65292;&#20197;&#20415;&#20165;&#38480;&#20110;&#20855;&#26377;&#22810;&#36793;&#32972;&#20070;&#30340;&#21464;&#21270;&#12290;&#36825;&#19968;&#20849;&#35782;&#24615;&#38459;&#27490;&#21407;&#21017;&#20197;&#21450;&#20256;&#32479;&#30340;&#21333;&#26041;&#38754;&#38459;&#27490;&#21644;&#20854;&#38388;&#30340;&#36328;&#36234;&#38459;&#27490;&#21407;&#21017;&#37117;&#21487;&#20197;&#24212;&#29992;&#20110;&#20998;&#21306;&#20998;&#37197;&#23545;&#12290;&#27599;&#20010;&#36825;&#26679;&#30340;&#23545;&#30001;&#22823;&#32852;&#30431;&#30340;&#19968;&#20010;&#20998;&#21306;&#21644;&#30456;&#24212;&#30340;&#20998;&#37197;&#21521;&#37327;&#32452;&#25104;&#65292;&#20854;&#32452;&#25104;&#37096;&#20998;&#23545;&#20110;&#32473;&#23450;&#20998;&#21306;&#30340;&#21508;&#20010;&#32452;&#21512;&#32852;&#30431;&#26469;&#35828;&#37117;&#26159;&#21512;&#29702;&#30340;&#21644;&#26377;&#25928;&#30340;&#12290;&#23545;&#20110;&#25152;&#24471;&#21040;&#30340;&#24378;&#31283;&#23450;&#27010;&#24565;&#12289;&#20013;&#31561;&#31283;&#23450;&#27010;&#24565;&#21644;&#24369;&#31283;&#23450;&#27010;&#24565;&#65292;&#31532;&#19968;&#20010;&#19982;&#20256;&#32479;&#26680;&#24515;&#30456;&#23481;&#65292;&#22240;&#20026;&#20256;&#32479;&#26680;&#24515;&#30830;&#20999;&#22320;&#21253;&#21547;&#20102;&#37027;&#20123;&#36890;&#36807;&#35813;&#24378;&#31283;&#23450;&#27010;&#24565;&#19982;&#20165;&#21253;&#25324;&#22823;&#32852;&#30431;&#30340;&#25152;&#26377;&#21512;&#24182;&#20998;&#21306;&#30456;&#20851;&#32852;&#30340;&#20998;&#37197;&#12290;&#21487;&#33021;&#26356;&#37325;&#35201;&#30340;&#26159;&#65292;&#22312;&#36825;&#31181;&#24773;&#20917;&#19979;&#65292;&#21518;&#19968;&#31181;&#20013;&#31561;&#21644;&#24369;&#31283;&#23450;&#27010;&#24565;&#30340;&#34892;&#20026;&#23601;&#22914;&#20154;&#20204;&#25152;&#39044;&#26399;&#30340;&#19968;&#26679;&#65306;&#21069;&#32773;&#24378;&#20110;&#21518;&#32773;&#12290;
&lt;/p&gt;
&lt;p&gt;
We are concerned with the stability of a coalitional game, i.e., a transferable-utility (TU) cooperative game. First, the concept of core can be weakened so that the blocking of changes is limited to only those with multilateral backings. This principle of consensual blocking, as well as the traditional core-defining principle of unilateral blocking and one straddling in between, can all be applied to partition-allocation pairs. Each such pair is made up of a partition of the grand coalition and a corresponding allocation vector whose components are individually rational and efficient for the various constituent coalitions of the given partition. For the resulting strong, medium, and weak stability concepts, the first is core-compatible in that the traditional core exactly contains those allocations that are associated through this strong stability concept with the all-consolidated partition consisting of only the grand coalition. Probably more importantly, the latter medium and weak s
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#33655;&#20848;&#20013;&#23398;&#38454;&#27573;&#20998;&#29677;&#20915;&#31574;&#30340;&#36136;&#37327;&#65292;&#21457;&#29616;&#25945;&#24072;&#30340;&#21021;&#22987;&#20998;&#29677;&#20915;&#31574;&#23545;&#20110;&#22823;&#22810;&#25968;&#23398;&#29983;&#26469;&#35828;&#22826;&#20302;&#20102;&#12290;</title><link>http://arxiv.org/abs/2304.10636</link><description>&lt;p&gt;
&#25945;&#24072;&#20316;&#20986;&#23398;&#26657;&#20998;&#29677;&#20915;&#31574;&#30340;&#36136;&#37327;&#30740;&#31350;&#8212;&#8212;&#20197;&#33655;&#20848;&#20026;&#20363;
&lt;/p&gt;
&lt;p&gt;
The quality of school track assignment decisions by teachers. (arXiv:2304.10636v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.10636
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#33655;&#20848;&#20013;&#23398;&#38454;&#27573;&#20998;&#29677;&#20915;&#31574;&#30340;&#36136;&#37327;&#65292;&#21457;&#29616;&#25945;&#24072;&#30340;&#21021;&#22987;&#20998;&#29677;&#20915;&#31574;&#23545;&#20110;&#22823;&#22810;&#25968;&#23398;&#29983;&#26469;&#35828;&#22826;&#20302;&#20102;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20351;&#29992;&#22238;&#24402;&#19981;&#36830;&#32493;&#35774;&#35745;&#30740;&#31350;&#20102;&#33655;&#20848;&#20013;&#23398;&#38454;&#27573;&#20998;&#29677;&#20915;&#31574;&#30340;&#36136;&#37327;&#12290;&#22312;&#23567;&#23398;&#20845;&#24180;&#32423;&#65292;&#23567;&#23398;&#25945;&#24072;&#23558;&#27599;&#20010;&#23398;&#29983;&#20998;&#37197;&#21040;&#20013;&#23398;&#38454;&#27573;&#30340;&#19968;&#20010;&#23398;&#20064;&#36712;&#36857;&#19978;&#12290;&#22914;&#26524;&#23398;&#29983;&#22312;&#23567;&#23398;&#25945;&#32946;&#30340;&#26631;&#20934;&#21270;&#32467;&#26463;&#27979;&#35797;&#20013;&#30340;&#24471;&#20998;&#39640;&#20110;&#29305;&#23450;&#30340;&#36712;&#36857;&#20998;&#25968;&#32447;&#65292;&#25945;&#24072;&#21487;&#20197;&#21521;&#19978;&#20462;&#25913;&#36825;&#20010;&#20998;&#37197;&#20915;&#31574;&#12290;&#36890;&#36807;&#27604;&#36739;&#36825;&#20123;&#20998;&#25968;&#32447;&#20004;&#20391;&#30340;&#23398;&#29983;&#65292;&#21457;&#29616;&#22312;&#22235;&#24180;&#21518;&#65292;&#26377;50-90&#65285;&#30340;&#23398;&#29983;&#8220;&#34987;&#22256;&#22312;&#36712;&#36857;&#20013;&#8221;&#65292;&#24847;&#21619;&#30528;&#20182;&#20204;&#21482;&#26377;&#22312;&#31532;&#19968;&#24180;&#23601;&#24320;&#22987;&#22312;&#39640;&#36712;&#36857;&#19978;&#30340;&#24773;&#20917;&#19979;&#65292;&#25165;&#33021;&#22312;&#22235;&#24180;&#21518;&#22312;&#39640;&#36712;&#36857;&#19978;&#12290;&#20854;&#20182;&#65288;&#23569;&#25968;&#65289;&#23398;&#29983;&#21017;&#8220;&#22987;&#32456;&#22788;&#20110;&#20302;&#27700;&#24179;&#8221;&#65292;&#26080;&#35770;&#20182;&#20204;&#26368;&#21021;&#20301;&#20110;&#21738;&#20010;&#27700;&#24179;&#65292;&#22235;&#24180;&#21518;&#37117;&#20250;&#19968;&#30452;&#22312;&#20302;&#27700;&#24179;&#19978;&#12290;&#36825;&#20123;&#27604;&#20363;&#36866;&#29992;&#20110;&#22312;&#31532;&#19968;&#24180;&#36890;&#36807;&#24471;&#20998;&#36229;&#36807;&#20998;&#25968;&#32447;&#32780;&#20174;&#20302;&#36712;&#36857;&#36716;&#21040;&#39640;&#36712;&#36857;&#30340;&#25509;&#36817;&#20998;&#25968;&#32447;&#30340;&#23398;&#29983;&#12290;&#22240;&#27492;&#65292;&#23545;&#20110;&#22823;&#22810;&#25968;&#36825;&#20123;&#23398;&#29983;&#26469;&#35828;&#65292;&#26368;&#21021;&#65288;&#26410;&#20462;&#25913;&#30340;&#65289;&#20998;&#29677;&#20915;&#31574;&#22826;&#20302;&#20102;&#12290;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;&#25945;&#24072;&#20316;&#20986;&#30340;&#20998;&#29677;&#20915;&#31574;&#36136;&#37327;&#20540;&#24471;&#20851;&#27880;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study the quality of secondary school track assignment decisions in the Netherlands, using a regression discontinuity design. In 6th grade, primary school teachers assign each student to a secondary school track. If a student scores above a track-specific cutoff on the standardized end-of-primary education test, the teacher can upwardly revise this assignment. By comparing students just left and right of these cutoffs, we find that between 50-90% of the students are "trapped in track": these students are on the high track after four years, only if they started on the high track in first year. The remaining (minority of) students are "always low": they are always on the low track after four years, independently of where they started. These proportions hold for students near the cutoffs that shift from the low to the high track in first year by scoring above the cutoff. Hence, for a majority of these students the initial (unrevised) track assignment decision is too low. The results re
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#19981;&#24179;&#31561;&#35775;&#38382;&#25945;&#32946;&#36164;&#28304;&#30340;&#23454;&#35777;&#27169;&#24335;&#21644;&#40657;&#30333;&#20154;&#20043;&#38388;&#30340;&#36827;&#38454;&#20837;&#23398;&#24046;&#36317;&#65292;&#21457;&#29616;&#30333;&#20154;&#23398;&#29983;&#30340;&#23384;&#22312;&#21487;&#20197;&#24433;&#21709;&#40657;&#30333;&#20154;&#20043;&#38388;&#30340;&#36827;&#38454;&#20837;&#23398;&#24046;&#36317;&#65292;&#24182;&#21487;&#33021;&#26159;&#36825;&#19968;&#23439;&#35266;&#27169;&#24335;&#30340;&#21478;&#19968;&#20010;&#35299;&#37322;&#12290;</title><link>http://arxiv.org/abs/2304.04849</link><description>&lt;p&gt;
&#30333;&#20154;&#23398;&#29983;&#30340;&#23384;&#22312;&#19982;&#40657;&#30333;&#20154;&#20869;&#26657;&#19981;&#24179;&#31561;&#30340;&#20986;&#29616;&#65306;&#20004;&#20010;&#22522;&#20110;&#20114;&#21160;&#30340;&#26426;&#21046;
&lt;/p&gt;
&lt;p&gt;
The presence of White students and the emergence of Black-White within-school inequalities: two interaction-based mechanisms. (arXiv:2304.04849v1 [physics.soc-ph])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.04849
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#19981;&#24179;&#31561;&#35775;&#38382;&#25945;&#32946;&#36164;&#28304;&#30340;&#23454;&#35777;&#27169;&#24335;&#21644;&#40657;&#30333;&#20154;&#20043;&#38388;&#30340;&#36827;&#38454;&#20837;&#23398;&#24046;&#36317;&#65292;&#21457;&#29616;&#30333;&#20154;&#23398;&#29983;&#30340;&#23384;&#22312;&#21487;&#20197;&#24433;&#21709;&#40657;&#30333;&#20154;&#20043;&#38388;&#30340;&#36827;&#38454;&#20837;&#23398;&#24046;&#36317;&#65292;&#24182;&#21487;&#33021;&#26159;&#36825;&#19968;&#23439;&#35266;&#27169;&#24335;&#30340;&#21478;&#19968;&#20010;&#35299;&#37322;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25506;&#35752;&#20102;&#25945;&#32946;&#31038;&#20250;&#23398;&#20013;&#19968;&#20010;&#20247;&#25152;&#21608;&#30693;&#30340;&#23454;&#35777;&#27169;&#24335;&#30340;&#26426;&#21046;&#35299;&#37322;&#65292;&#21363;&#40657;&#30333;&#20154;&#22312;&#36827;&#38454;&#35838;&#31243;&#31561;&#23398;&#26657;&#36164;&#28304;&#33719;&#21462;&#19978;&#30340;&#19981;&#24179;&#31561;&#22312;&#31181;&#26063;&#22810;&#26679;&#21644;&#20197;&#30333;&#20154;&#20026;&#20027;&#30340;&#23398;&#26657;&#20013;&#26368;&#20026;&#26126;&#26174;&#12290;&#36890;&#36807;&#19968;&#20010;&#32463;&#39564;&#24615;&#30340;&#26657;&#20934;&#21644;&#39564;&#35777;&#20195;&#29702;&#27169;&#22411;&#65292;&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;&#20004;&#31181;&#23450;&#24615;&#20915;&#31574;&#26426;&#21046;&#30340;&#21160;&#24577;&#65292;&#26174;&#31034;(1)&#25105;&#20204;&#26377;&#29702;&#30001;&#30456;&#20449;&#30333;&#20154;&#23398;&#29983;&#30340;&#23384;&#22312;&#23545;&#40657;&#30333;&#20154;&#30340;&#36827;&#38454;&#35838;&#31243;&#25307;&#29983;&#24046;&#24322;&#30340;&#20986;&#29616;&#26377;&#24433;&#21709;&#65307;(2)&#36825;&#31181;&#24433;&#21709;&#21487;&#33021;&#20195;&#34920;&#20102;&#26377;&#20851;&#23439;&#35266;&#27169;&#24335;&#30340;&#21478;&#19968;&#20010;&#21487;&#33021;&#30340;&#35299;&#37322;&#12290;&#32467;&#26524;&#26377;&#21161;&#20110;&#30446;&#21069;&#26377;&#20851;&#20869;&#26657;&#19981;&#24179;&#31561;&#30340;&#23398;&#26415;&#30740;&#31350;&#65292;&#20026;&#25919;&#31574;&#25112;&#30053;&#25552;&#20379;&#25351;&#23548;&#65292;&#20197;&#25552;&#39640;&#40657;&#20154;&#23398;&#29983;&#22312;&#31181;&#26063;&#20132;&#34701;&#30340;&#29615;&#22659;&#20013;&#30340;&#25945;&#32946;&#20307;&#39564;&#12290;
&lt;/p&gt;
&lt;p&gt;
This article investigates mechanism-based explanations for a well-known empirical pattern in sociology of education, namely, that Black-White unequal access to school resources -- defined as advanced coursework -- is the highest in racially diverse and majority-White schools. Through an empirically calibrated and validated agent-based model, this study explores the dynamics of two qualitatively informed mechanisms, showing (1) that we have reason to believe that the presence of White students in school can influence the emergence of Black-White advanced enrollment disparities and (2) that such influence can represent another possible explanation for the macro-level pattern of interest. Results contribute to current scholarly accounts of within-school inequalities, shedding light into policy strategies to improve the educational experiences of Black students in racially integrated settings.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#36890;&#36807;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#20998;&#26512;&#26202;&#24180;&#23436;&#25104;&#23398;&#20301;&#19982;&#32463;&#27982;&#22238;&#25253;&#20043;&#38388;&#30340;&#22240;&#26524;&#25928;&#24212;&#65292;&#21457;&#29616;&#33719;&#24471;&#26032;&#36164;&#26684;&#23558;&#24102;&#26469;&#27599;&#24180;&#36229;&#36807;3000&#28595;&#20803;&#30340;&#32463;&#27982;&#22238;&#25253;&#12290;</title><link>http://arxiv.org/abs/2304.01490</link><description>&lt;p&gt;
&#21518;&#26399;&#33719;&#24471;&#26032;&#36164;&#26684;&#30340;&#32463;&#27982;&#25928;&#24212;
&lt;/p&gt;
&lt;p&gt;
The Economic Effect of Gaining a New Qualification Later in Life. (arXiv:2304.01490v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.01490
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#36890;&#36807;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#20998;&#26512;&#26202;&#24180;&#23436;&#25104;&#23398;&#20301;&#19982;&#32463;&#27982;&#22238;&#25253;&#20043;&#38388;&#30340;&#22240;&#26524;&#25928;&#24212;&#65292;&#21457;&#29616;&#33719;&#24471;&#26032;&#36164;&#26684;&#23558;&#24102;&#26469;&#27599;&#24180;&#36229;&#36807;3000&#28595;&#20803;&#30340;&#32463;&#27982;&#22238;&#25253;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;OECD&#22269;&#23478;&#20013;&#65292;&#36861;&#27714;&#26202;&#24180;&#25945;&#32946;&#36164;&#26684;&#26159;&#19968;&#20010;&#36234;&#26469;&#36234;&#26222;&#36941;&#30340;&#29616;&#35937;&#65292;&#22240;&#20026;&#25216;&#26415;&#21464;&#38761;&#21644;&#33258;&#21160;&#21270;&#32487;&#32493;&#25512;&#21160;&#35768;&#22810;&#32844;&#19994;&#25152;&#38656;&#30340;&#25216;&#33021;&#30340;&#28436;&#21464;&#12290;&#26412;&#25991;&#30528;&#37325;&#32771;&#34385;&#26202;&#24180;&#23436;&#25104;&#23398;&#20301;&#23545;&#32463;&#27982;&#22238;&#25253;&#30340;&#22240;&#26524;&#24433;&#21709;&#65292;&#20854;&#20013;&#33719;&#21462;&#39069;&#22806;&#25945;&#32946;&#30340;&#21160;&#26426;&#21644;&#33021;&#21147;&#21487;&#33021;&#19982;&#26089;&#24180;&#25945;&#32946;&#19981;&#21516;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#19982;&#37027;&#20123;&#27809;&#26377;&#23436;&#25104;&#39069;&#22806;&#23398;&#20064;&#30340;&#20154;&#30456;&#27604;&#65292;&#23436;&#25104;&#39069;&#22806;&#23398;&#20301;&#23558;&#24102;&#26469;&#27599;&#24180;&#36229;&#36807;3000&#28595;&#20803;&#65288;2019&#24180;&#65289;&#30340;&#32463;&#27982;&#22238;&#25253;&#12290;&#23545;&#20110;&#32467;&#26524;&#65292;&#25105;&#20204;&#20351;&#29992;&#12298;&#28595;&#22823;&#21033;&#20122;&#23478;&#24237;&#25910;&#20837;&#21644;&#21171;&#21160;&#21147;&#21160;&#24577;&#35843;&#26597;&#12299;&#30340;&#26497;&#20854;&#20016;&#23500;&#19988;&#20855;&#26377;&#20195;&#34920;&#24615;&#30340;&#32437;&#21521;&#25968;&#25454;&#12290;&#20026;&#20102;&#20805;&#20998;&#21033;&#29992;&#36825;&#20123;&#25968;&#25454;&#30340;&#22797;&#26434;&#24615;&#21644;&#20016;&#23500;&#24615;&#65292;&#25105;&#20204;&#20351;&#29992;&#22522;&#20110;&#26426;&#22120;&#23398;&#20064;&#65288;ML&#65289;&#30340;&#26041;&#27861;&#26469;&#20272;&#31639;&#22240;&#26524;&#25928;&#24212;&#12290;&#25105;&#20204;&#20063;&#33021;&#22815;&#20351;&#29992;ML&#26469;&#21457;&#29616;&#26202;&#24180;&#33719;&#24471;&#26032;&#36164;&#26684;&#23545;&#32463;&#27982;&#22238;&#25253;&#30340;&#24433;&#21709;&#26469;&#28304;&#30340;&#24322;&#36136;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Pursuing educational qualifications later in life is an increasingly common phenomenon within OECD countries since technological change and automation continues to drive the evolution of skills needed in many professions. We focus on the causal impacts to economic returns of degrees completed later in life, where motivations and capabilities to acquire additional education may be distinct from education in early years. We find that completing and additional degree leads to more than \$3000 (AUD, 2019) per year compared to those who do not complete additional study. For outcomes, treatment and controls we use the extremely rich and nationally representative longitudinal data from the Household Income and Labour Dynamics Australia survey is used for this work. To take full advantage of the complexity and richness of this data we use a Machine Learning (ML) based methodology to estimate the causal effect. We are also able to use ML to discover sources of heterogeneity in the effects of ga
&lt;/p&gt;</description></item><item><title>&#35770;&#25991;&#30740;&#31350;&#32467;&#21512;&#36152;&#26131;&#25968;&#25454;&#12289;&#19987;&#21033;&#30003;&#35831;&#21644;&#30740;&#31350;&#20986;&#29256;&#29289;&#30340;&#25968;&#25454;&#65292;&#24314;&#31435;&#20102;&#33021;&#22815;&#35299;&#37322;&#22269;&#38469;&#21253;&#23481;&#24615;&#32511;&#33394;&#22686;&#38271;&#24046;&#24322;&#30340;&#32463;&#27982;&#22797;&#26434;&#24230;&#27169;&#22411;&#65292;&#24182;&#21457;&#29616;&#39640;&#32508;&#21512;&#35780;&#20998;&#22269;&#23478;&#26356;&#23481;&#26131;&#23454;&#29616;&#20302;&#25490;&#25918;&#24378;&#24230;&#30340;&#32511;&#33394;&#22686;&#38271;&#12290;</title><link>http://arxiv.org/abs/2209.08382</link><description>&lt;p&gt;
&#22810;&#32500;&#32463;&#27982;&#22797;&#26434;&#24230;&#19982;&#21253;&#23481;&#24615;&#32511;&#33394;&#22686;&#38271;
&lt;/p&gt;
&lt;p&gt;
Multidimensional Economic Complexity and Inclusive Green Growth. (arXiv:2209.08382v2 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2209.08382
&lt;/p&gt;
&lt;p&gt;
&#35770;&#25991;&#30740;&#31350;&#32467;&#21512;&#36152;&#26131;&#25968;&#25454;&#12289;&#19987;&#21033;&#30003;&#35831;&#21644;&#30740;&#31350;&#20986;&#29256;&#29289;&#30340;&#25968;&#25454;&#65292;&#24314;&#31435;&#20102;&#33021;&#22815;&#35299;&#37322;&#22269;&#38469;&#21253;&#23481;&#24615;&#32511;&#33394;&#22686;&#38271;&#24046;&#24322;&#30340;&#32463;&#27982;&#22797;&#26434;&#24230;&#27169;&#22411;&#65292;&#24182;&#21457;&#29616;&#39640;&#32508;&#21512;&#35780;&#20998;&#22269;&#23478;&#26356;&#23481;&#26131;&#23454;&#29616;&#20302;&#25490;&#25918;&#24378;&#24230;&#30340;&#32511;&#33394;&#22686;&#38271;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35201;&#23454;&#29616;&#21253;&#23481;&#24615;&#30340;&#32511;&#33394;&#22686;&#38271;&#65292;&#22269;&#23478;&#38656;&#35201;&#32771;&#34385;&#22810;&#31181;&#32463;&#27982;&#12289;&#31038;&#20250;&#21644;&#29615;&#22659;&#22240;&#32032;&#12290;&#36825;&#20123;&#22240;&#32032;&#36890;&#24120;&#30001;&#20174;&#36152;&#26131;&#22320;&#29702;&#20013;&#23548;&#20986;&#30340;&#32463;&#27982;&#22797;&#26434;&#24230;&#30340;&#24230;&#37327;&#25152;&#25429;&#25417;&#65292;&#22240;&#27492;&#32570;&#23569;&#21019;&#26032;&#27963;&#21160;&#30340;&#20851;&#38190;&#20449;&#24687;&#12290;&#20026;&#22635;&#34917;&#36825;&#19968;&#24046;&#36317;&#65292;&#25105;&#20204;&#23558;&#36152;&#26131;&#25968;&#25454;&#19982;&#19987;&#21033;&#30003;&#35831;&#21644;&#30740;&#31350;&#20986;&#29256;&#29289;&#30340;&#25968;&#25454;&#30456;&#32467;&#21512;&#65292;&#24314;&#31435;&#27169;&#22411;&#65292;&#26174;&#33879;&#19988;&#31283;&#20581;&#22320;&#25913;&#21892;&#20102;&#32463;&#27982;&#22797;&#26434;&#24230;&#24230;&#37327;&#35299;&#37322;&#22269;&#38469;&#21253;&#23481;&#24615;&#32511;&#33394;&#22686;&#38271;&#24046;&#24322;&#30340;&#33021;&#21147;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#22522;&#20110;&#36152;&#26131;&#21644;&#19987;&#21033;&#25968;&#25454;&#24314;&#31435;&#30340;&#22797;&#26434;&#24230;&#24230;&#37327;&#32467;&#21512;&#22312;&#19968;&#36215;&#33021;&#22815;&#35299;&#37322;&#26410;&#26469;&#30340;&#32463;&#27982;&#22686;&#38271;&#21644;&#25910;&#20837;&#19981;&#24179;&#31561;&#24615;&#65292;&#24182;&#19988;&#22312;&#25152;&#26377;&#19977;&#20010;&#25351;&#26631;&#24471;&#20998;&#39640;&#30340;&#22269;&#23478;&#24448;&#24448;&#34920;&#29616;&#20986;&#26356;&#20302;&#30340;&#25490;&#25918;&#24378;&#24230;&#12290;&#36825;&#20123;&#21457;&#29616;&#35828;&#26126;&#20102;&#36152;&#26131;&#12289;&#25216;&#26415;&#21644;&#30740;&#31350;&#30340;&#22320;&#29702;&#20301;&#32622;&#22914;&#20309;&#32467;&#21512;&#36215;&#26469;&#35299;&#37322;&#21253;&#23481;&#24615;&#32511;&#33394;&#22686;&#38271;&#12290;
&lt;/p&gt;
&lt;p&gt;
To achieve inclusive green growth, countries need to consider a multiplicity of economic, social, and environmental factors. These are often captured by metrics of economic complexity derived from the geography of trade, thus missing key information on innovative activities. To bridge this gap, we combine trade data with data on patent applications and research publications to build models that significantly and robustly improve the ability of economic complexity metrics to explain international variations in inclusive green growth. We show that measures of complexity built on trade and patent data combine to explain future economic growth and income inequality and that countries that score high in all three metrics tend to exhibit lower emission intensities. These findings illustrate how the geography of trade, technology, and research combine to explain inclusive green growth.
&lt;/p&gt;</description></item><item><title>&#20020;&#24202;&#35797;&#39564;&#30340;&#38590;&#28857;&#22312;&#20110;&#25307;&#21215;&#24739;&#32773;&#65292;&#22240;&#20026;&#20020;&#24202;&#35797;&#39564;&#38656;&#35201;&#22343;&#21248;&#25506;&#32034;&#32780;&#24739;&#32773;&#26356;&#20542;&#21521;&#20110;&#26368;&#20339;&#27835;&#30103;&#65292;&#26412;&#30740;&#31350;&#25552;&#20379;&#20102;&#21033;&#29992;&#20449;&#24687;&#19981;&#23545;&#31216;&#28608;&#21169;&#21442;&#19982;&#30340;&#35299;&#20915;&#26041;&#26696;&#12290;</title><link>http://arxiv.org/abs/2202.06191</link><description>&lt;p&gt;
&#28608;&#21169;&#21442;&#19982;&#20020;&#24202;&#35797;&#39564;
&lt;/p&gt;
&lt;p&gt;
Incentivizing Participation in Clinical Trials. (arXiv:2202.06191v4 [cs.GT] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2202.06191
&lt;/p&gt;
&lt;p&gt;
&#20020;&#24202;&#35797;&#39564;&#30340;&#38590;&#28857;&#22312;&#20110;&#25307;&#21215;&#24739;&#32773;&#65292;&#22240;&#20026;&#20020;&#24202;&#35797;&#39564;&#38656;&#35201;&#22343;&#21248;&#25506;&#32034;&#32780;&#24739;&#32773;&#26356;&#20542;&#21521;&#20110;&#26368;&#20339;&#27835;&#30103;&#65292;&#26412;&#30740;&#31350;&#25552;&#20379;&#20102;&#21033;&#29992;&#20449;&#24687;&#19981;&#23545;&#31216;&#28608;&#21169;&#21442;&#19982;&#30340;&#35299;&#20915;&#26041;&#26696;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25307;&#21215;&#24739;&#32773;&#30340;&#38590;&#24230;&#26159;&#20020;&#24202;&#35797;&#39564;&#20013;&#19968;&#20010;&#20247;&#25152;&#21608;&#30693;&#30340;&#38382;&#39064;&#65292;&#36825;&#22312;&#23454;&#36341;&#20013;&#25233;&#21046;&#25110;&#26377;&#26102;&#29978;&#33267;&#20351;&#20854;&#19981;&#21487;&#33021;&#12290;&#25105;&#20204;&#23558;&#36825;&#20010;&#38382;&#39064;&#35299;&#37322;&#20026;&#25506;&#32034;-&#24320;&#21457;&#26435;&#34913;&#30340;&#19968;&#20010;&#38750;&#26631;&#20934;&#29256;&#26412;&#65306;&#22312;&#36825;&#37324;&#65292;&#20020;&#24202;&#35797;&#39564;&#24076;&#26395;&#23613;&#21487;&#33021;&#22343;&#21248;&#22320;&#36827;&#34892;&#25506;&#32034;&#65292;&#32780;&#27599;&#20010;&#24739;&#32773;&#37117;&#26356;&#21916;&#27426;&#8220;&#24320;&#21457;&#8221;&#65292;&#21363;&#30475;&#36215;&#26469;&#26368;&#22909;&#30340;&#27835;&#30103;&#26041;&#27861;&#12290;&#25105;&#20204;&#30740;&#31350;&#22914;&#20309;&#36890;&#36807;&#21033;&#29992;&#35797;&#39564;&#21644;&#24739;&#32773;&#20043;&#38388;&#30340;&#20449;&#24687;&#19981;&#23545;&#31216;&#26469;&#28608;&#21169;&#21442;&#19982;&#12290;&#25105;&#20204;&#36890;&#36807;&#23545;&#25239;&#29983;&#25104;&#30340;&#32467;&#26524;&#19979;&#30340;&#26368;&#22351;&#20272;&#35745;&#35823;&#24046;&#26469;&#34913;&#37327;&#32479;&#35745;&#24615;&#33021;&#65292;&#36825;&#26159;&#20020;&#24202;&#35797;&#39564;&#30340;&#26631;&#20934;&#30446;&#26631;&#12290;&#25105;&#20204;&#33719;&#24471;&#20102;&#19968;&#20010;&#22312;&#36825;&#20010;&#30446;&#26631;&#24847;&#20041;&#19979;&#36817;&#20046;&#26368;&#20248;&#30340;&#35299;&#20915;&#26041;&#26696;&#12290;&#20063;&#23601;&#26159;&#35828;&#65292;&#25105;&#20204;&#25552;&#20379;&#20102;&#19968;&#20010;&#29305;&#23450;&#20445;&#35777;&#30340;&#28608;&#21169;&#20860;&#23481;&#26426;&#21046;&#65292;&#24182;&#19988;&#20960;&#20046;&#21305;&#37197;&#20219;&#20309;&#28608;&#21169;&#20860;&#23481;&#26426;&#21046;&#30340;&#19981;&#21487;&#33021;&#32467;&#26524;&#12290;&#25105;&#20204;&#30340;&#32467;&#26524;&#25193;&#23637;&#21040;&#20855;&#26377;&#24322;&#36136;&#20844;&#20849;&#21644;&#31169;&#26377;&#31867;&#22411;&#30340;&#20195;&#29702;&#12290;
&lt;/p&gt;
&lt;p&gt;
The difficulty of recruiting patients is a well-known issue in clinical trials which inhibits or sometimes precludes them in practice. We interpret this issue as a non-standard version of exploration-exploitation tradeoff: here, the clinical trial would like to explore as uniformly as possible, whereas each patient prefers ``exploitation", i.e. treatments that seem best. We study how to incentivize participation by leveraging information asymmetry between the trial and the patients. We measure statistical performance via worst-case estimation error under adversarially generated outcomes, a standard objective for clinical trials. We obtain a near-optimal solution in terms of this objective. Namely, we provide an incentive-compatible mechanism with a particular guarantee, and a nearly matching impossibility result for any incentive-compatible mechanism. Our results extend to agents with heterogeneous public and private types.
&lt;/p&gt;</description></item></channel></rss>