<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#36825;&#39033;&#30740;&#31350;&#22312;&#22238;&#24402;&#19981;&#36830;&#32493;&#35774;&#35745;&#19979;&#32771;&#34385;&#20102;&#31574;&#30053;&#23398;&#20064;&#65292;&#24182;&#24320;&#21457;&#20102;&#19968;&#31181;&#40065;&#26834;&#20248;&#21270;&#26041;&#27861;&#26469;&#25214;&#21040;&#26368;&#20248;&#27835;&#30103;&#25130;&#28857;&#65292;&#20197;&#25552;&#39640;&#27835;&#30103;&#25928;&#26524;&#12290;</title><link>http://arxiv.org/abs/2208.13323</link><description>&lt;p&gt;
&#22312;&#20855;&#26377;&#22810;&#20010;&#25130;&#28857;&#30340;&#22238;&#24402;&#19981;&#36830;&#32493;&#35774;&#35745;&#19979;&#30340;&#23433;&#20840;&#31574;&#30053;&#23398;&#20064;
&lt;/p&gt;
&lt;p&gt;
Safe Policy Learning under Regression Discontinuity Designs with Multiple Cutoffs. (arXiv:2208.13323v3 [stat.ME] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2208.13323
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#30740;&#31350;&#22312;&#22238;&#24402;&#19981;&#36830;&#32493;&#35774;&#35745;&#19979;&#32771;&#34385;&#20102;&#31574;&#30053;&#23398;&#20064;&#65292;&#24182;&#24320;&#21457;&#20102;&#19968;&#31181;&#40065;&#26834;&#20248;&#21270;&#26041;&#27861;&#26469;&#25214;&#21040;&#26368;&#20248;&#27835;&#30103;&#25130;&#28857;&#65292;&#20197;&#25552;&#39640;&#27835;&#30103;&#25928;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22238;&#24402;&#19981;&#36830;&#32493;&#35774;&#35745;&#24191;&#27867;&#29992;&#20110;&#35266;&#27979;&#25968;&#25454;&#30340;&#31243;&#24207;&#35780;&#20272;&#12290;&#29616;&#26377;&#25991;&#29486;&#20027;&#35201;&#20851;&#27880;&#22312;&#29616;&#26377;&#30340;&#27835;&#30103;&#25130;&#28857;&#19978;&#20272;&#35745;&#23616;&#37096;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#12290;&#30456;&#27604;&#20043;&#19979;&#65292;&#25105;&#20204;&#32771;&#34385;&#22312;&#22238;&#24402;&#19981;&#36830;&#32493;&#35774;&#35745;&#19979;&#30340;&#31574;&#30053;&#23398;&#20064;&#12290;&#30001;&#20110;&#27835;&#30103;&#20998;&#37197;&#26426;&#21046;&#26159;&#30830;&#23450;&#24615;&#30340;&#65292;&#23398;&#20064;&#26356;&#22909;&#30340;&#27835;&#30103;&#25130;&#28857;&#38656;&#35201;&#22806;&#25512;&#12290;&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#31181;&#40065;&#26834;&#20248;&#21270;&#26041;&#27861;&#65292;&#29992;&#20110;&#25214;&#21040;&#25913;&#36827;&#29616;&#26377;&#25130;&#28857;&#30340;&#26368;&#20248;&#27835;&#30103;&#25130;&#28857;&#12290;&#25105;&#20204;&#39318;&#20808;&#23558;&#39044;&#26399;&#25928;&#29992;&#20998;&#35299;&#20026;&#21487;&#28857;&#37492;&#21035;&#21644;&#19981;&#21487;&#37492;&#21035;&#30340;&#32452;&#25104;&#37096;&#20998;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#39640;&#25928;&#30340;&#21452;&#37325;&#40065;&#26834;&#20272;&#35745;&#22120;&#26469;&#20272;&#35745;&#21487;&#37492;&#21035;&#37096;&#20998;&#12290;&#20026;&#20102;&#32771;&#34385;&#19981;&#21487;&#37492;&#21035;&#30340;&#25104;&#20998;&#65292;&#25105;&#20204;&#21033;&#29992;&#20102;&#22312;&#22238;&#24402;&#19981;&#36830;&#32493;&#35774;&#35745;&#19979;&#20849;&#21516;&#23384;&#22312;&#30340;&#22810;&#20010;&#25130;&#28857;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#25105;&#20204;&#20551;&#35774;&#19981;&#21516;&#32452;&#21035;&#28508;&#22312;&#32467;&#26524;&#30340;&#26465;&#20214;&#26399;&#26395;&#30340;&#24322;&#36136;&#24615;&#22312;&#36816;&#34892;&#21518;&#27839;&#30528;&#26576;&#19968;&#26041;&#21521;&#24179;&#28369;&#21464;&#21270;&#12290;
&lt;/p&gt;
&lt;p&gt;
The regression discontinuity (RD) design is widely used for program evaluation with observational data. The primary focus of the existing literature has been the estimation of the local average treatment effect at the existing treatment cutoff. In contrast, we consider policy learning under the RD design. Because the treatment assignment mechanism is deterministic, learning better treatment cutoffs requires extrapolation. We develop a robust optimization approach to finding optimal treatment cutoffs that improve upon the existing ones. We first decompose the expected utility into point-identifiable and unidentifiable components. We then propose an efficient doubly-robust estimator for the identifiable parts. To account for the unidentifiable components, we leverage the existence of multiple cutoffs that are common under the RD design. Specifically, we assume that the heterogeneity in the conditional expectations of potential outcomes across different groups vary smoothly along the runn
&lt;/p&gt;</description></item></channel></rss>