<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#36825;&#31687;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#20811;&#26381;&#20272;&#35745;&#22810;&#39033;&#24335;&#21709;&#24212;&#27169;&#22411;&#20013;&#25351;&#25968;&#32423;&#25903;&#25345;&#38382;&#39064;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#20351;&#29992;&#22522;&#20110;&#21015;&#32852;&#34920;&#27010;&#29575;&#20998;&#24067;&#30340;&#32771;&#34385;&#38598;&#27010;&#29575;&#27169;&#22411;&#12290;</title><link>http://arxiv.org/abs/2308.12470</link><description>&lt;p&gt;
&#21487;&#20280;&#32553;&#20272;&#35745;&#20855;&#26377;&#19981;&#30830;&#23450;&#30340;&#36873;&#39033;&#38598;&#30340;&#22810;&#39033;&#24335;&#21709;&#24212;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
Scalable Estimation of Multinomial Response Models with Uncertain Consideration Sets. (arXiv:2308.12470v1 [stat.ME])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.12470
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#20811;&#26381;&#20272;&#35745;&#22810;&#39033;&#24335;&#21709;&#24212;&#27169;&#22411;&#20013;&#25351;&#25968;&#32423;&#25903;&#25345;&#38382;&#39064;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#20351;&#29992;&#22522;&#20110;&#21015;&#32852;&#34920;&#27010;&#29575;&#20998;&#24067;&#30340;&#32771;&#34385;&#38598;&#27010;&#29575;&#27169;&#22411;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#20132;&#21449;&#25110;&#32437;&#21521;&#25968;&#25454;&#30340;&#26080;&#24207;&#22810;&#39033;&#24335;&#21709;&#24212;&#27169;&#22411;&#25311;&#21512;&#20013;&#30340;&#19968;&#20010;&#26631;&#20934;&#20551;&#35774;&#26159;&#65292;&#21709;&#24212;&#26469;&#33258;&#20110;&#30456;&#21516;&#30340;J&#20010;&#31867;&#21035;&#38598;&#21512;&#12290;&#28982;&#32780;&#65292;&#24403;&#21709;&#24212;&#24230;&#37327;&#20027;&#20307;&#20570;&#20986;&#30340;&#36873;&#25321;&#26102;&#65292;&#26356;&#36866;&#21512;&#20551;&#35774;&#22810;&#39033;&#24335;&#21709;&#24212;&#30340;&#20998;&#24067;&#26159;&#22312;&#20027;&#20307;&#29305;&#23450;&#30340;&#32771;&#34385;&#38598;&#26465;&#20214;&#19979;&#65292;&#20854;&#20013;&#36825;&#20010;&#32771;&#34385;&#38598;&#26159;&#20174;{1,2, ..., J}&#30340;&#24130;&#38598;&#20013;&#25277;&#21462;&#30340;&#12290;&#30001;&#20110;&#36825;&#20010;&#24130;&#38598;&#30340;&#22522;&#25968;&#22312;J&#20013;&#26159;&#25351;&#25968;&#32423;&#30340;&#65292;&#19968;&#33324;&#26469;&#35828;&#20272;&#35745;&#26159;&#26080;&#27861;&#23454;&#29616;&#30340;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20379;&#20102;&#19968;&#31181;&#20811;&#26381;&#36825;&#20010;&#38382;&#39064;&#30340;&#26041;&#27861;&#12290;&#36825;&#31181;&#26041;&#27861;&#20013;&#30340;&#19968;&#20010;&#20851;&#38190;&#27493;&#39588;&#26159;&#22522;&#20110;&#22312;&#21015;&#32852;&#34920;&#19978;&#30340;&#27010;&#29575;&#20998;&#24067;&#30340;&#19968;&#33324;&#34920;&#31034;&#30340;&#32771;&#34385;&#38598;&#30340;&#27010;&#29575;&#27169;&#22411;&#12290;&#23613;&#31649;&#36825;&#20010;&#20998;&#24067;&#30340;&#25903;&#25345;&#26159;&#25351;&#25968;&#32423;&#22823;&#30340;&#65292;&#20294;&#32473;&#23450;&#21442;&#25968;&#30340;&#32771;&#34385;&#38598;&#30340;&#21518;&#39564;&#20998;&#24067;&#36890;&#24120;&#26159;&#31232;&#30095;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
A standard assumption in the fitting of unordered multinomial response models for J mutually exclusive nominal categories, on cross-sectional or longitudinal data, is that the responses arise from the same set of J categories between subjects. However, when responses measure a choice made by the subject, it is more appropriate to assume that the distribution of multinomial responses is conditioned on a subject-specific consideration set, where this consideration set is drawn from the power set of {1,2,...,J}. Because the cardinality of this power set is exponential in J, estimation is infeasible in general. In this paper, we provide an approach to overcoming this problem. A key step in the approach is a probability model over consideration sets, based on a general representation of probability distributions on contingency tables. Although the support of this distribution is exponentially large, the posterior distribution over consideration sets given parameters is typically sparse, and
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25506;&#35752;&#20102;&#36328;&#22269;&#20225;&#19994;&#25152;&#26377;&#26435;&#38142;&#22312;&#36328;&#36234;&#22269;&#23478;&#36793;&#30028;&#30340;&#25511;&#21046;&#20013;&#25152;&#25198;&#28436;&#30340;&#35282;&#33394;&#65292;&#21457;&#29616;&#22823;&#22810;&#25968;&#22806;&#22269;&#23376;&#20844;&#21496;&#37117;&#26159;&#36890;&#36807;&#25152;&#26377;&#26435;&#38142;&#34987;&#27597;&#20844;&#21496;&#25511;&#21046;&#30340;&#65292;&#35770;&#25991;&#25552;&#20986;&#20102;&#19982;&#27492;&#30456;&#20851;&#30340;&#29702;&#35770;&#27169;&#22411;&#26469;&#35299;&#37322;&#36825;&#19968;&#29616;&#35937;&#12290;</title><link>http://arxiv.org/abs/2305.12857</link><description>&lt;p&gt;
&#36328;&#22269;&#20225;&#19994;&#20013;&#30340;&#25152;&#26377;&#26435;&#38142;
&lt;/p&gt;
&lt;p&gt;
Ownership Chains in Multinational Enterprises. (arXiv:2305.12857v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.12857
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25506;&#35752;&#20102;&#36328;&#22269;&#20225;&#19994;&#25152;&#26377;&#26435;&#38142;&#22312;&#36328;&#36234;&#22269;&#23478;&#36793;&#30028;&#30340;&#25511;&#21046;&#20013;&#25152;&#25198;&#28436;&#30340;&#35282;&#33394;&#65292;&#21457;&#29616;&#22823;&#22810;&#25968;&#22806;&#22269;&#23376;&#20844;&#21496;&#37117;&#26159;&#36890;&#36807;&#25152;&#26377;&#26435;&#38142;&#34987;&#27597;&#20844;&#21496;&#25511;&#21046;&#30340;&#65292;&#35770;&#25991;&#25552;&#20986;&#20102;&#19982;&#27492;&#30456;&#20851;&#30340;&#29702;&#35770;&#27169;&#22411;&#26469;&#35299;&#37322;&#36825;&#19968;&#29616;&#35937;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#36328;&#36234;&#19981;&#21516;&#22269;&#23478;&#36793;&#30028;&#30340;&#36328;&#22269;&#20225;&#19994;&#25152;&#21457;&#23637;&#30340;&#25152;&#26377;&#26435;&#38142;&#30340;&#20316;&#29992;&#12290;&#39318;&#20808;&#65292;&#25105;&#20204;&#35777;&#26126;&#27597;&#20844;&#21496;&#36890;&#36807;&#28041;&#21450;&#33267;&#23569;&#20004;&#20010;&#22269;&#23478;&#27839;&#25152;&#26377;&#26435;&#38142;&#30340;&#38388;&#25509;&#25511;&#21046;&#20851;&#31995;&#25511;&#21046;&#20102;&#22823;&#22810;&#25968;&#65288;58%&#65289;&#30340;&#22806;&#22269;&#23376;&#20844;&#21496;&#12290;&#22240;&#27492;&#65292;&#25105;&#20204;&#20551;&#35774;&#25152;&#26377;&#26435;&#38142;&#19978;&#30340;&#20301;&#32622;&#21463;&#21040;&#20256;&#36755;&#31649;&#29702;&#20915;&#31574;&#25152;&#38656;&#30340;&#27807;&#36890;&#25104;&#26412;&#30340;&#24433;&#21709;&#12290;&#19982;&#25903;&#25345;&#30340;&#35777;&#25454;&#19968;&#33268;&#65292;&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#20010;&#26377;&#20851;&#20844;&#21496;&#25511;&#21046;&#31454;&#20105;&#30340;&#29702;&#35770;&#27169;&#22411;&#65292;&#32771;&#34385;&#21040;&#21407;&#22987;&#22269;&#23478;&#30340;&#27597;&#20844;&#21496;&#21487;&#20197;&#23558;&#20854;&#23545;&#26368;&#32456;&#23376;&#20844;&#21496;&#30340;&#30417;&#35270;&#27963;&#21160;&#22996;&#25176;&#32473;&#20301;&#20110;&#20013;&#38388;&#21496;&#27861;&#31649;&#36758;&#21306;&#30340;&#20013;&#38388;&#20844;&#21496;&#23376;&#20844;&#21496;&#30340;&#21487;&#33021;&#24615;&#12290;&#25105;&#20204;&#30340;&#27169;&#22411;&#25552;&#20379;&#20102;&#19968;&#20010;&#20004;&#27493;&#23454;&#35777;&#31574;&#30053;&#65292;&#21253;&#25324;&#20004;&#20010;&#37325;&#21147;&#26041;&#31243;&#65306;i) &#19968;&#20010;&#19977;&#35282;&#24418;&#30340;&#37325;&#21147;&#26041;&#31243;&#65292;&#29992;&#20110;&#30830;&#23450;&#27597;&#20844;&#21496;&#30340;&#20013;&#38388;&#20844;&#21496;&#65292;&#22312;&#30830;&#23450;&#26368;&#32456;&#25237;&#36164;&#20301;&#32622;&#30340;&#26465;&#20214;&#19979;&#65307;ii) &#32463;&#20856;&#30340;&#37325;&#21147;&#26041;&#31243;&#65292;&#29992;&#20110;&#30830;&#23450;&#26368;&#32456;&#23376;&#20844;&#21496;&#25152;&#22312;&#30340;&#30446;&#26631;&#22269;&#23478;&#65292;&#32771;&#34385;&#21040;&#20013;&#38388;&#20844;&#21496;&#30340;&#22320;&#29702;&#20301;&#32622;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this contribution, we investigate the role of ownership chains developed by multinational enterprises across different national borders. First, we document that parent companies control a majority (58%) of foreign subsidiaries through indirect control relationships involving at least two countries along an ownership chain. Therefore, we hypothesize that locations along ownership chains are driven by the existence of communication costs to transmit management decisions. In line with motivating evidence, we develop a theoretical model for competition on corporate control that considers the possibility that parent companies in the origin countries can delegate their monitoring activities in final subsidiaries to middlemen subsidiaries that are located in intermediate jurisdictions. Our model returns us a two-step empirical strategy with two gravity equations: i) a triangular gravity for establishing a middleman by the parent, conditional on final investments' locations; ii) a classical
&lt;/p&gt;</description></item></channel></rss>