<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#20351;&#29992;&#32479;&#35745;&#20915;&#31574;&#29702;&#35770;&#65288;SDT&#65289;&#36827;&#34892;&#20840;&#38754;&#30340;&#26679;&#26412;&#22806;&#65288;OOS&#65289;&#35780;&#20272;&#65292;&#21462;&#20195;&#24403;&#21069;&#26426;&#22120;&#23398;&#20064;&#65288;ML&#65289;&#30740;&#31350;&#20013;&#24120;&#35265;&#30340;K-fold&#21644;&#20844;&#20849;&#20219;&#21153;&#26694;&#26550;&#39564;&#35777;&#26041;&#27861;&#12290;</title><link>https://arxiv.org/abs/2403.11016</link><description>&lt;p&gt;
&#39044;&#27979;&#31639;&#27861;&#30340;&#20840;&#38754;OOS&#35780;&#20272;&#19982;&#32479;&#35745;&#20915;&#31574;&#29702;&#35770;
&lt;/p&gt;
&lt;p&gt;
Comprehensive OOS Evaluation of Predictive Algorithms with Statistical Decision Theory
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.11016
&lt;/p&gt;
&lt;p&gt;
&#20351;&#29992;&#32479;&#35745;&#20915;&#31574;&#29702;&#35770;&#65288;SDT&#65289;&#36827;&#34892;&#20840;&#38754;&#30340;&#26679;&#26412;&#22806;&#65288;OOS&#65289;&#35780;&#20272;&#65292;&#21462;&#20195;&#24403;&#21069;&#26426;&#22120;&#23398;&#20064;&#65288;ML&#65289;&#30740;&#31350;&#20013;&#24120;&#35265;&#30340;K-fold&#21644;&#20844;&#20849;&#20219;&#21153;&#26694;&#26550;&#39564;&#35777;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#35748;&#20026;&#65292;&#24212;&#24403;&#20351;&#29992;&#32479;&#35745;&#20915;&#31574;&#29702;&#35770;&#65288;SDT&#65289;&#36827;&#34892;&#20840;&#38754;&#30340;&#26679;&#26412;&#22806;&#65288;OOS&#65289;&#35780;&#20272;&#65292;&#21462;&#20195;&#26426;&#22120;&#23398;&#20064;&#65288;ML&#65289;&#30740;&#31350;&#20013;&#24403;&#21069;&#30340;K-fold&#21644;&#20844;&#20849;&#20219;&#21153;&#26694;&#26550;&#39564;&#35777;&#30340;&#20570;&#27861;&#12290;SDT&#20026;&#22312;&#25152;&#26377;&#21487;&#33021;&#30340;&#65288;1&#65289;&#35757;&#32451;&#26679;&#26412;&#12289;&#65288;2&#65289;&#21487;&#33021;&#29983;&#25104;&#35757;&#32451;&#25968;&#25454;&#30340;&#20154;&#32676;&#21644;&#65288;3&#65289;&#39044;&#27979;&#21033;&#30410;&#20154;&#32676;&#20043;&#38388;&#36827;&#34892;&#20840;&#38754;&#30340;OOS&#35780;&#20272;&#25552;&#20379;&#20102;&#19968;&#20010;&#24418;&#24335;&#21270;&#26694;&#26550;&#12290;&#20851;&#20110;&#29305;&#24449;&#65288;3&#65289;&#65292;&#25105;&#20204;&#24378;&#35843;SDT&#35201;&#27714;&#20174;&#19994;&#32773;&#30452;&#25509;&#38754;&#23545;&#26410;&#26469;&#21487;&#33021;&#19981;&#21516;&#20110;&#36807;&#21435;&#30340;&#21487;&#33021;&#24615;&#65292;&#24182;&#22312;&#26500;&#24314;&#39044;&#27979;&#31639;&#27861;&#26102;&#32771;&#34385;&#20174;&#19968;&#20010;&#20154;&#32676;&#25512;&#26029;&#21040;&#21478;&#19968;&#20010;&#20154;&#32676;&#30340;&#21487;&#33021;&#38656;&#35201;&#12290;SDT&#22312;&#25277;&#35937;&#19978;&#26159;&#31616;&#21333;&#30340;&#65292;&#20294;&#22312;&#23454;&#26045;&#26102;&#24448;&#24448;&#38656;&#35201;&#22823;&#37327;&#35745;&#31639;&#12290;&#25105;&#20204;&#35752;&#35770;&#20102;&#24403;&#39044;&#27979;&#20934;&#30830;&#24615;&#36890;&#36807;&#22343;&#26041;&#35823;&#24046;&#25110;&#35823;&#20998;&#31867;&#29575;&#34913;&#37327;&#26102;&#65292;SDT&#30340;&#21487;&#34892;&#23454;&#26045;&#36827;&#23637;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.11016v1 Announce Type: new  Abstract: We argue that comprehensive out-of-sample (OOS) evaluation using statistical decision theory (SDT) should replace the current practice of K-fold and Common Task Framework validation in machine learning (ML) research. SDT provides a formal framework for performing comprehensive OOS evaluation across all possible (1) training samples, (2) populations that may generate training data, and (3) populations of prediction interest. Regarding feature (3), we emphasize that SDT requires the practitioner to directly confront the possibility that the future may not look like the past and to account for a possible need to extrapolate from one population to another when building a predictive algorithm. SDT is simple in abstraction, but it is often computationally demanding to implement. We discuss progress in tractable implementation of SDT when prediction accuracy is measured by mean square error or by misclassification rate. We summarize research st
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#26032;&#30340;&#35745;&#37327;&#32463;&#27982;&#23398;&#24037;&#20855;&#26469;&#35299;&#26512;&#36731;&#32618;&#29359;&#30340;&#21009;&#32602;&#23545;&#20877;&#29359;&#26102;&#38388;&#30340;&#24322;&#36136;&#25928;&#24212;&#12290;&#30740;&#31350;&#32467;&#26524;&#21457;&#29616;&#65292;&#23545;&#20110;&#32477;&#22823;&#22810;&#25968;&#27861;&#23448;&#20250;&#24809;&#32602;&#30340;&#20154;&#32780;&#35328;&#65292;&#21009;&#32602;&#20250;&#24310;&#38271;&#20877;&#29359;&#26102;&#38388;&#65292;&#32780;&#21482;&#26377;&#20005;&#21385;&#30340;&#27861;&#23448;&#25165;&#20250;&#23545;&#20877;&#29359;&#29575;&#20135;&#29983;&#24433;&#21709;&#12290;</title><link>https://arxiv.org/abs/2311.13969</link><description>&lt;p&gt;
&#23545;&#24052;&#35199;&#20877;&#29359;&#26102;&#38388;&#30340;&#26367;&#20195;&#21009;&#32602;&#25928;&#26524;&#24322;&#36136;&#24615;&#30340;&#21400;&#28165;&#65292;&#38597;&#24343;&#23572;&#29305;&#30340;&#24576;&#30097;&#26159;&#21542;&#21512;&#29702;&#65311;
&lt;/p&gt;
&lt;p&gt;
Was Javert right to be suspicious? Unpacking treatment effect heterogeneity of alternative sentences on time-to-recidivism in Brazil
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2311.13969
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#26032;&#30340;&#35745;&#37327;&#32463;&#27982;&#23398;&#24037;&#20855;&#26469;&#35299;&#26512;&#36731;&#32618;&#29359;&#30340;&#21009;&#32602;&#23545;&#20877;&#29359;&#26102;&#38388;&#30340;&#24322;&#36136;&#25928;&#24212;&#12290;&#30740;&#31350;&#32467;&#26524;&#21457;&#29616;&#65292;&#23545;&#20110;&#32477;&#22823;&#22810;&#25968;&#27861;&#23448;&#20250;&#24809;&#32602;&#30340;&#20154;&#32780;&#35328;&#65292;&#21009;&#32602;&#20250;&#24310;&#38271;&#20877;&#29359;&#26102;&#38388;&#65292;&#32780;&#21482;&#26377;&#20005;&#21385;&#30340;&#27861;&#23448;&#25165;&#20250;&#23545;&#20877;&#29359;&#29575;&#20135;&#29983;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#26032;&#30340;&#35745;&#37327;&#32463;&#27982;&#23398;&#24037;&#20855;&#65292;&#20197;&#35299;&#26512;&#24809;&#32602;&#36731;&#32618;&#29359;&#23545;&#20877;&#29359;&#26102;&#38388;&#30340;&#24322;&#36136;&#27835;&#30103;&#25928;&#24212;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#22914;&#20309;&#22312;&#27835;&#30103;&#36873;&#25321;&#26159;&#20869;&#29983;&#30340;&#24773;&#20917;&#19979;&#65292;&#23545;&#32463;&#24120;&#26159;&#22312;&#21491;&#20391;&#25130;&#26029;&#30340;&#25345;&#32493;&#21464;&#37327;&#31561;&#24863;&#20852;&#36259;&#30340;&#32467;&#26524;&#36827;&#34892;&#20998;&#24067;&#12289;&#20998;&#20301;&#25968;&#21644;&#24179;&#22343;&#36793;&#38469;&#27835;&#30103;&#25928;&#24212;&#30340;&#35782;&#21035;&#12289;&#20272;&#35745;&#21644;&#25512;&#26029;&#12290;&#21033;&#29992;&#22312;&#24052;&#35199;&#22307;&#20445;&#32599;&#24030;2010&#24180;&#33267;2019&#24180;&#27861;&#23448;&#23545;&#26696;&#20214;&#30340;&#20223;&#25311;&#38543;&#26426;&#20998;&#37197;&#65292;&#25105;&#20204;&#25506;&#32034;&#20102;&#25105;&#20204;&#25552;&#20986;&#30340;&#35745;&#37327;&#32463;&#27982;&#23398;&#26041;&#27861;&#26469;&#35780;&#20272;&#32602;&#27454;&#21644;&#31038;&#21306;&#26381;&#21153;&#21477;&#20316;&#20026;&#19968;&#31181;&#24809;&#32602;&#24418;&#24335;&#23545;&#20877;&#29359;&#26102;&#38388;&#30340;&#24433;&#21709;&#12290;&#25105;&#20204;&#30340;&#32467;&#26524;&#31361;&#26174;&#20102;&#20854;&#20182;&#24037;&#20855;&#26080;&#27861;&#25429;&#25417;&#21040;&#30340;&#26174;&#33879;&#27835;&#30103;&#25928;&#24212;&#24322;&#36136;&#24615;&#12290;&#20363;&#22914;&#65292;&#25105;&#20204;&#21457;&#29616;&#22823;&#22810;&#25968;&#27861;&#23448;&#20250;&#24809;&#32602;&#30340;&#20154;&#30001;&#20110;&#22788;&#32602;&#32780;&#20877;&#29359;&#30340;&#26102;&#38388;&#26356;&#38271;&#65292;&#32780;&#21482;&#26377;&#20005;&#21385;&#30340;&#27861;&#23448;&#20250;&#24809;&#32602;&#30340;&#20154;&#20877;&#29359;&#29575;&#36739;&#39640;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper presents new econometric tools to unpack the treatment effect heterogeneity of punishing misdemeanor offenses on time-to-recidivism. We show how one can identify, estimate, and make inferences on the distributional, quantile, and average marginal treatment effects in setups where the treatment selection is endogenous and the outcome of interest, usually a duration variable, is potentially right-censored. We explore our proposed econometric methodology to evaluate the effect of fines and community service sentences as a form of punishment on time-to-recidivism in the State of S\~ao Paulo, Brazil, between 2010 and 2019, leveraging the as-if random assignment of judges to cases. Our results highlight substantial treatment effect heterogeneity that other tools are not meant to capture. For instance, we find that people whom most judges would punish take longer to recidivate as a consequence of the punishment, while people who would be punished only by strict judges recidivate at
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#20462;&#27491;CD&#26816;&#39564;&#30340;&#26032;&#26041;&#27861;CD*&#65292;&#36866;&#29992;&#20110;&#32431;&#28508;&#22312;&#22240;&#32032;&#27169;&#22411;&#20197;&#21450;&#38754;&#26495;&#22238;&#24402;&#65292;&#20855;&#26377;&#28176;&#36817;&#27491;&#24577;&#24615;&#65292;&#30456;&#27604;&#20110;&#29616;&#26377;&#26041;&#27861;&#20855;&#26377;&#26356;&#22909;&#30340;&#24615;&#33021;&#12290;</title><link>http://arxiv.org/abs/2109.00408</link><description>&lt;p&gt;
&#20462;&#27491;&#28508;&#22312;&#22240;&#32032;&#38754;&#26495;&#25968;&#25454;&#27169;&#22411;&#20013;&#35823;&#24046;&#20132;&#21449;&#30456;&#20851;&#30340;CD&#26816;&#39564;
&lt;/p&gt;
&lt;p&gt;
A Bias-Corrected CD Test for Error Cross-Sectional Dependence in Panel Data Models with Latent Factors. (arXiv:2109.00408v3 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2109.00408
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#20462;&#27491;CD&#26816;&#39564;&#30340;&#26032;&#26041;&#27861;CD*&#65292;&#36866;&#29992;&#20110;&#32431;&#28508;&#22312;&#22240;&#32032;&#27169;&#22411;&#20197;&#21450;&#38754;&#26495;&#22238;&#24402;&#65292;&#20855;&#26377;&#28176;&#36817;&#27491;&#24577;&#24615;&#65292;&#30456;&#27604;&#20110;&#29616;&#26377;&#26041;&#27861;&#20855;&#26377;&#26356;&#22909;&#30340;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#38024;&#23545;&#28508;&#22312;&#22240;&#32032;&#38754;&#26495;&#25968;&#25454;&#27169;&#22411;&#20013;&#30340;&#35823;&#24046;&#20132;&#21449;&#30456;&#20851;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#31616;&#21333;&#30340;CD*&#26816;&#39564;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#26159;&#28176;&#36817;&#27491;&#24577;&#30340;&#65292;&#36866;&#29992;&#20110;&#32431;&#28508;&#22312;&#22240;&#32032;&#27169;&#22411;&#20197;&#21450;&#38754;&#26495;&#22238;&#24402;&#12290;&#36890;&#36807;Monte Carlo&#23454;&#39564;&#30740;&#31350;&#20102;CD*&#26816;&#39564;&#30340;&#23567;&#26679;&#26412;&#24615;&#36136;&#65292;&#32467;&#26524;&#34920;&#26126;&#35813;&#26816;&#39564;&#20855;&#26377;&#27491;&#30830;&#30340;&#22823;&#23567;&#21644;&#20196;&#20154;&#28385;&#24847;&#30340;&#21151;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;
In a recent paper Juodis and Reese (2021) (JR) show that the application of the CD test proposed by Pesaran (2004) to residuals from panels with latent factors results in over-rejection and propose a randomized test statistic to correct for over-rejection, and add a screening component to achieve power. This paper considers the same problem but from a different perspective and shows that the standard CD test remains valid if the latent factors are weak, and proposes a simple bias-corrected CD test, labelled CD*, which is shown to be asymptotically normal, irrespective of whether the latent factors are weak or strong. This result is shown to hold for pure latent factor models as well as for panel regressions with latent factors. Small sample properties of the CD* test are investigated by Monte Carlo experiments and are shown to have the correct size and satisfactory power for both Gaussian and non-Gaussian errors. In contrast, it is found that JR's test tends to over-reject in the case 
&lt;/p&gt;</description></item></channel></rss>