<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#25552;&#20986;&#20102;&#19968;&#31181;&#40065;&#26834;&#30340;&#12289;&#39640;&#25928;&#30340;&#27169;&#25311;&#20248;&#21270;&#27169;&#22411;&#65292;&#29992;&#20110;&#35299;&#20915;&#21457;&#23637;&#20013;&#22269;&#23478;&#30005;&#21160;&#36710;&#20805;&#30005;&#31449;&#30340;&#30005;&#21147;&#19981;&#30830;&#23450;&#24615;&#38382;&#39064;&#12290;&#36890;&#36807;&#20272;&#35745;&#20505;&#36873;&#31449;&#28857;&#30340;&#26381;&#21153;&#21487;&#38752;&#24615;&#65292;&#24182;&#36816;&#29992;&#25511;&#21046;&#21464;&#37327;&#25216;&#26415;&#65292;&#25105;&#20204;&#25552;&#20379;&#20102;&#19968;&#20010;&#39640;&#24230;&#40065;&#26834;&#30340;&#35299;&#20915;&#26041;&#26696;&#65292;&#26377;&#25928;&#24212;&#23545;&#30005;&#21147;&#20013;&#26029;&#30340;&#19981;&#30830;&#23450;&#24615;&#12290;</title><link>http://arxiv.org/abs/2307.05470</link><description>&lt;p&gt;
&#21457;&#23637;&#20013;&#22269;&#23478;&#30005;&#21160;&#36710;&#20805;&#30005;&#31449;&#30340;&#40065;&#26834;&#39640;&#25928;&#20248;&#21270;&#27169;&#22411;&#8212;&#8212;&#22522;&#20110;&#30005;&#21147;&#19981;&#30830;&#23450;&#24615;&#30340;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
A Robust and Efficient Optimization Model for Electric Vehicle Charging Stations in Developing Countries under Electricity Uncertainty. (arXiv:2307.05470v1 [math.OC])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.05470
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#40065;&#26834;&#30340;&#12289;&#39640;&#25928;&#30340;&#27169;&#25311;&#20248;&#21270;&#27169;&#22411;&#65292;&#29992;&#20110;&#35299;&#20915;&#21457;&#23637;&#20013;&#22269;&#23478;&#30005;&#21160;&#36710;&#20805;&#30005;&#31449;&#30340;&#30005;&#21147;&#19981;&#30830;&#23450;&#24615;&#38382;&#39064;&#12290;&#36890;&#36807;&#20272;&#35745;&#20505;&#36873;&#31449;&#28857;&#30340;&#26381;&#21153;&#21487;&#38752;&#24615;&#65292;&#24182;&#36816;&#29992;&#25511;&#21046;&#21464;&#37327;&#25216;&#26415;&#65292;&#25105;&#20204;&#25552;&#20379;&#20102;&#19968;&#20010;&#39640;&#24230;&#40065;&#26834;&#30340;&#35299;&#20915;&#26041;&#26696;&#65292;&#26377;&#25928;&#24212;&#23545;&#30005;&#21147;&#20013;&#26029;&#30340;&#19981;&#30830;&#23450;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20840;&#29699;&#30005;&#21160;&#36710;&#65288;EV&#65289;&#30340;&#38656;&#27714;&#26085;&#30410;&#22686;&#38271;&#65292;&#36825;&#38656;&#35201;&#21457;&#23637;&#40065;&#26834;&#19988;&#21487;&#35775;&#38382;&#30340;&#20805;&#30005;&#22522;&#30784;&#35774;&#26045;&#65292;&#23588;&#20854;&#26159;&#22312;&#30005;&#21147;&#19981;&#31283;&#23450;&#30340;&#21457;&#23637;&#20013;&#22269;&#23478;&#12290;&#26089;&#26399;&#30340;&#20805;&#30005;&#22522;&#30784;&#35774;&#26045;&#20248;&#21270;&#30740;&#31350;&#26410;&#33021;&#20005;&#26684;&#32771;&#34385;&#27492;&#31867;&#26381;&#21153;&#20013;&#26029;&#29305;&#24449;&#65292;&#23548;&#33268;&#22522;&#30784;&#35774;&#26045;&#35774;&#35745;&#19981;&#20339;&#12290;&#20026;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#39640;&#25928;&#30340;&#22522;&#20110;&#27169;&#25311;&#30340;&#20248;&#21270;&#27169;&#22411;&#65292;&#35813;&#27169;&#22411;&#20272;&#35745;&#20505;&#36873;&#31449;&#28857;&#30340;&#26381;&#21153;&#21487;&#38752;&#24615;&#65292;&#24182;&#23558;&#20854;&#32435;&#20837;&#30446;&#26631;&#20989;&#25968;&#21644;&#32422;&#26463;&#20013;&#12290;&#25105;&#20204;&#37319;&#29992;&#20102;&#25511;&#21046;&#21464;&#37327;&#65288;CV&#65289;&#26041;&#24046;&#20943;&#23567;&#25216;&#26415;&#26469;&#25552;&#39640;&#27169;&#25311;&#25928;&#29575;&#12290;&#25105;&#20204;&#30340;&#27169;&#22411;&#25552;&#20379;&#20102;&#19968;&#20010;&#39640;&#24230;&#40065;&#26834;&#30340;&#35299;&#20915;&#26041;&#26696;&#65292;&#21363;&#20351;&#22312;&#20505;&#36873;&#31449;&#28857;&#26381;&#21153;&#21487;&#38752;&#24615;&#34987;&#20302;&#20272;&#25110;&#39640;&#20272;&#30340;&#24773;&#20917;&#19979;&#65292;&#20063;&#33021;&#32531;&#20914;&#19981;&#30830;&#23450;&#30340;&#30005;&#21147;&#20013;&#26029;&#12290;&#20351;&#29992;&#21360;&#24230;&#23612;&#35199;&#20122;&#33487;&#25289;&#24052;&#20122;&#30340;&#25968;&#25454;&#38598;&#65292;&#25105;&#20204;&#30340;&#25968;&#20540;&#23454;&#39564;&#35777;&#26126;&#20102;&#25152;&#25552;&#20986;&#27169;&#22411;&#30340;&#26377;&#25928;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
The rising demand for electric vehicles (EVs) worldwide necessitates the development of robust and accessible charging infrastructure, particularly in developing countries where electricity disruptions pose a significant challenge. Earlier charging infrastructure optimization studies do not rigorously address such service disruption characteristics, resulting in suboptimal infrastructure designs. To address this issue, we propose an efficient simulation-based optimization model that estimates candidate stations' service reliability and incorporates it into the objective function and constraints. We employ the control variates (CV) variance reduction technique to enhance simulation efficiency. Our model provides a highly robust solution that buffers against uncertain electricity disruptions, even when candidate station service reliability is subject to underestimation or overestimation. Using a dataset from Surabaya, Indonesia, our numerical experiment demonstrates that the proposed mod
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#26032;&#30340;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#65292;&#36890;&#36807;&#23558;&#27874;&#21160;&#24615;&#20316;&#20026;&#27169;&#22411;&#26435;&#37325;&#65292;&#20934;&#30830;&#39044;&#27979;&#22269;&#20869;&#29983;&#20135;&#24635;&#20540;&#65288;GDP&#65289;&#12290;&#35813;&#26041;&#27861;&#32771;&#34385;&#20102;&#24847;&#22806;&#20914;&#20987;&#21644;&#20107;&#20214;&#23545;&#32463;&#27982;&#30340;&#24433;&#21709;&#65292;&#36890;&#36807;&#27979;&#35797;&#21644;&#27604;&#36739;&#34920;&#26126;&#65292;&#27874;&#21160;&#24615;&#21152;&#26435;&#30340;Lasso&#26041;&#27861;&#22312;&#20934;&#30830;&#24615;&#21644;&#40065;&#26834;&#24615;&#26041;&#38754;&#20248;&#20110;&#20854;&#20182;&#26041;&#27861;&#65292;&#20026;&#20915;&#31574;&#32773;&#25552;&#20379;&#20102;&#26377;&#20215;&#20540;&#30340;&#20915;&#31574;&#24037;&#20855;&#12290;</title><link>http://arxiv.org/abs/2307.05391</link><description>&lt;p&gt;
&#21457;&#25381;&#27874;&#21160;&#24615;&#28508;&#21147;&#65306;&#25512;&#36827;&#22269;&#20869;&#29983;&#20135;&#24635;&#20540;&#39044;&#27979;
&lt;/p&gt;
&lt;p&gt;
Harnessing the Potential of Volatility: Advancing GDP Prediction. (arXiv:2307.05391v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.05391
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#26032;&#30340;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#65292;&#36890;&#36807;&#23558;&#27874;&#21160;&#24615;&#20316;&#20026;&#27169;&#22411;&#26435;&#37325;&#65292;&#20934;&#30830;&#39044;&#27979;&#22269;&#20869;&#29983;&#20135;&#24635;&#20540;&#65288;GDP&#65289;&#12290;&#35813;&#26041;&#27861;&#32771;&#34385;&#20102;&#24847;&#22806;&#20914;&#20987;&#21644;&#20107;&#20214;&#23545;&#32463;&#27982;&#30340;&#24433;&#21709;&#65292;&#36890;&#36807;&#27979;&#35797;&#21644;&#27604;&#36739;&#34920;&#26126;&#65292;&#27874;&#21160;&#24615;&#21152;&#26435;&#30340;Lasso&#26041;&#27861;&#22312;&#20934;&#30830;&#24615;&#21644;&#40065;&#26834;&#24615;&#26041;&#38754;&#20248;&#20110;&#20854;&#20182;&#26041;&#27861;&#65292;&#20026;&#20915;&#31574;&#32773;&#25552;&#20379;&#20102;&#26377;&#20215;&#20540;&#30340;&#20915;&#31574;&#24037;&#20855;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#65292;&#23558;&#27874;&#21160;&#24615;&#20316;&#20026;&#27169;&#22411;&#26435;&#37325;&#24341;&#20837;&#22269;&#20869;&#29983;&#20135;&#24635;&#20540;&#65288;GDP&#65289;&#39044;&#27979;&#20013;&#12290;&#35813;&#26041;&#27861;&#19987;&#38376;&#35774;&#35745;&#29992;&#20110;&#20934;&#30830;&#39044;&#27979;GDP&#65292;&#21516;&#26102;&#32771;&#34385;&#21040;&#21487;&#33021;&#24433;&#21709;&#32463;&#27982;&#30340;&#24847;&#22806;&#20914;&#20987;&#25110;&#20107;&#20214;&#12290;&#36890;&#36807;&#23545;&#23454;&#38469;&#25968;&#25454;&#36827;&#34892;&#27979;&#35797;&#65292;&#24182;&#19982;&#20197;&#24448;&#29992;&#20110;GDP&#39044;&#27979;&#30340;&#25216;&#26415;&#65288;&#22914;Lasso&#21644;&#33258;&#36866;&#24212;Lasso&#65289;&#36827;&#34892;&#27604;&#36739;&#65292;&#34920;&#26126;&#27874;&#21160;&#24615;&#21152;&#26435;Lasso&#26041;&#27861;&#22312;&#20934;&#30830;&#24615;&#21644;&#40065;&#26834;&#24615;&#26041;&#38754;&#20248;&#20110;&#20854;&#20182;&#26041;&#27861;&#65292;&#20026;&#20915;&#31574;&#32773;&#21644;&#20998;&#26512;&#24072;&#22312;&#24555;&#36895;&#21464;&#21270;&#30340;&#32463;&#27982;&#29615;&#22659;&#20013;&#25552;&#20379;&#20102;&#26377;&#20215;&#20540;&#30340;&#20915;&#31574;&#24037;&#20855;&#12290;&#26412;&#30740;&#31350;&#23637;&#31034;&#20102;&#25968;&#25454;&#39537;&#21160;&#26041;&#27861;&#22914;&#20309;&#24110;&#21161;&#25105;&#20204;&#26356;&#22909;&#22320;&#29702;&#35299;&#32463;&#27982;&#27874;&#21160;&#65292;&#24182;&#25903;&#25345;&#26356;&#26377;&#25928;&#30340;&#32463;&#27982;&#25919;&#31574;&#21046;&#23450;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper presents a novel machine learning approach to GDP prediction that incorporates volatility as a model weight. The proposed method is specifically designed to identify and select the most relevant macroeconomic variables for accurate GDP prediction, while taking into account unexpected shocks or events that may impact the economy. The proposed method's effectiveness is tested on real-world data and compared to previous techniques used for GDP forecasting, such as Lasso and Adaptive Lasso. The findings show that the Volatility-weighted Lasso method outperforms other methods in terms of accuracy and robustness, providing policymakers and analysts with a valuable tool for making informed decisions in a rapidly changing economic environment. This study demonstrates how data-driven approaches can help us better understand economic fluctuations and support more effective economic policymaking.  Keywords: GDP prediction, Lasso, Volatility, Regularization, Macroeconomics Variable Sele
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#20351;&#29992;&#8220;&#28304;&#8221;&#22320;&#21306;&#25968;&#25454;&#36827;&#34892;&#30446;&#26631;&#22320;&#21306;&#25919;&#31574;&#39044;&#27979;&#30340;&#26041;&#27861;&#12290;&#36890;&#36807;&#21046;&#23450;&#21487;&#36716;&#31227;&#26465;&#20214;&#24182;&#26500;&#24314;&#21512;&#25104;&#30340;&#32467;&#26524;-&#25919;&#31574;&#20851;&#31995;&#26469;&#28385;&#36275;&#26465;&#20214;&#12290;&#25105;&#20204;&#24320;&#21457;&#20102;&#36890;&#29992;&#36807;&#31243;&#26469;&#26500;&#24314;&#21453;&#20107;&#23454;&#39044;&#27979;&#30340;&#32622;&#20449;&#21306;&#38388;&#65292;&#24182;&#35777;&#26126;&#20854;&#26377;&#25928;&#24615;&#12290;&#26412;&#30740;&#31350;&#24212;&#29992;&#35813;&#26041;&#27861;&#39044;&#27979;&#20102;&#24503;&#20811;&#33832;&#26031;&#24030;&#38738;&#23569;&#24180;&#23601;&#19994;&#29575;&#12290;</title><link>http://arxiv.org/abs/2307.05122</link><description>&lt;p&gt;
&#27169;&#25311;&#20998;&#35299;&#36827;&#34892;&#21453;&#20107;&#23454;&#39044;&#27979;
&lt;/p&gt;
&lt;p&gt;
Synthetic Decomposition for Counterfactual Predictions. (arXiv:2307.05122v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.05122
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#20351;&#29992;&#8220;&#28304;&#8221;&#22320;&#21306;&#25968;&#25454;&#36827;&#34892;&#30446;&#26631;&#22320;&#21306;&#25919;&#31574;&#39044;&#27979;&#30340;&#26041;&#27861;&#12290;&#36890;&#36807;&#21046;&#23450;&#21487;&#36716;&#31227;&#26465;&#20214;&#24182;&#26500;&#24314;&#21512;&#25104;&#30340;&#32467;&#26524;-&#25919;&#31574;&#20851;&#31995;&#26469;&#28385;&#36275;&#26465;&#20214;&#12290;&#25105;&#20204;&#24320;&#21457;&#20102;&#36890;&#29992;&#36807;&#31243;&#26469;&#26500;&#24314;&#21453;&#20107;&#23454;&#39044;&#27979;&#30340;&#32622;&#20449;&#21306;&#38388;&#65292;&#24182;&#35777;&#26126;&#20854;&#26377;&#25928;&#24615;&#12290;&#26412;&#30740;&#31350;&#24212;&#29992;&#35813;&#26041;&#27861;&#39044;&#27979;&#20102;&#24503;&#20811;&#33832;&#26031;&#24030;&#38738;&#23569;&#24180;&#23601;&#19994;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24403;&#25919;&#31574;&#21464;&#37327;&#36229;&#20986;&#20808;&#21069;&#25919;&#31574;&#25903;&#25345;&#33539;&#22260;&#26102;&#65292;&#21453;&#20107;&#23454;&#39044;&#27979;&#26159;&#20855;&#26377;&#25361;&#25112;&#24615;&#30340;&#12290;&#28982;&#32780;&#65292;&#22312;&#35768;&#22810;&#24773;&#20917;&#19979;&#65292;&#20851;&#20110;&#24863;&#20852;&#36259;&#25919;&#31574;&#30340;&#20449;&#24687;&#21487;&#20197;&#20174;&#19981;&#21516;&#30340;&#8220;&#28304;&#8221;&#22320;&#21306;&#24471;&#21040;&#65292;&#36825;&#20123;&#22320;&#21306;&#24050;&#32463;&#23454;&#26045;&#20102;&#31867;&#20284;&#30340;&#25919;&#31574;&#12290;&#22312;&#26412;&#35770;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#26041;&#27861;&#65292;&#21033;&#29992;&#26469;&#33258;&#28304;&#22320;&#21306;&#30340;&#25968;&#25454;&#26469;&#39044;&#27979;&#30446;&#26631;&#22320;&#21306;&#30340;&#26032;&#25919;&#31574;&#12290;&#25105;&#20204;&#19981;&#20381;&#36182;&#20110;&#20351;&#29992;&#21442;&#25968;&#21270;&#35268;&#33539;&#30340;&#32467;&#26500;&#20851;&#31995;&#30340;&#22806;&#25512;&#65292;&#32780;&#26159;&#21046;&#23450;&#19968;&#20010;&#21487;&#36716;&#31227;&#26465;&#20214;&#65292;&#24182;&#26500;&#24314;&#19968;&#20010;&#21512;&#25104;&#30340;&#32467;&#26524;-&#25919;&#31574;&#20851;&#31995;&#65292;&#20351;&#20854;&#23613;&#21487;&#33021;&#25509;&#36817;&#28385;&#36275;&#26465;&#20214;&#12290;&#21512;&#25104;&#20851;&#31995;&#32771;&#34385;&#20102;&#21487;&#35266;&#27979;&#25968;&#25454;&#21644;&#32467;&#26500;&#20851;&#31995;&#30340;&#30456;&#20284;&#24615;&#12290;&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#20010;&#36890;&#29992;&#36807;&#31243;&#26469;&#26500;&#24314;&#21453;&#20107;&#23454;&#39044;&#27979;&#30340;&#28176;&#36827;&#32622;&#20449;&#21306;&#38388;&#65292;&#24182;&#35777;&#26126;&#20102;&#20854;&#28176;&#36827;&#26377;&#25928;&#24615;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#23558;&#25105;&#20204;&#30340;&#25552;&#35758;&#24212;&#29992;&#20110;&#39044;&#27979;&#24503;&#20811;&#33832;&#26031;&#24030;&#38738;&#23569;&#24180;&#23601;&#19994;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;
Counterfactual predictions are challenging when the policy variable goes beyond its pre-policy support. However, in many cases, information about the policy of interest is available from different ("source") regions where a similar policy has already been implemented. In this paper, we propose a novel method of using such data from source regions to predict a new policy in a target region. Instead of relying on extrapolation of a structural relationship using a parametric specification, we formulate a transferability condition and construct a synthetic outcome-policy relationship such that it is as close as possible to meeting the condition. The synthetic relationship weighs both the similarity in distributions of observables and in structural relationships. We develop a general procedure to construct asymptotic confidence intervals for counterfactual predictions and prove its asymptotic validity. We then apply our proposal to predict average teenage employment in Texas following a cou
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;&#21521;&#31454;&#20105;&#23545;&#25163;&#20986;&#21806;&#25968;&#25454;&#30340;&#25104;&#26412;&#19982;&#25928;&#30410;&#65292;&#24182;&#30830;&#23450;&#20102;&#21033;&#28070;&#26368;&#22823;&#21270;&#21644;&#24085;&#32047;&#25176;&#25913;&#36827;&#26426;&#21046;&#12290;&#32467;&#26524;&#26174;&#31034;&#65292;&#21033;&#28070;&#26368;&#22823;&#21270;&#26426;&#21046;&#23545;&#28040;&#36153;&#32773;&#19981;&#21033;&#65292;&#32780;&#24085;&#32047;&#25176;&#25913;&#36827;&#26426;&#21046;&#33021;&#25552;&#39640;&#28040;&#36153;&#32773;&#31119;&#21033;&#21644;&#20844;&#21496;&#21033;&#28070;&#12290;</title><link>http://arxiv.org/abs/2307.05078</link><description>&lt;p&gt;
&#21521;&#31454;&#20105;&#23545;&#25163;&#20986;&#21806;&#25968;&#25454;&#30340;&#25104;&#26412;&#19982;&#25928;&#30410;&#30340;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Selling Data to a Competitor (Extended Abstract). (arXiv:2307.05078v1 [cs.GT])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.05078
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;&#21521;&#31454;&#20105;&#23545;&#25163;&#20986;&#21806;&#25968;&#25454;&#30340;&#25104;&#26412;&#19982;&#25928;&#30410;&#65292;&#24182;&#30830;&#23450;&#20102;&#21033;&#28070;&#26368;&#22823;&#21270;&#21644;&#24085;&#32047;&#25176;&#25913;&#36827;&#26426;&#21046;&#12290;&#32467;&#26524;&#26174;&#31034;&#65292;&#21033;&#28070;&#26368;&#22823;&#21270;&#26426;&#21046;&#23545;&#28040;&#36153;&#32773;&#19981;&#21033;&#65292;&#32780;&#24085;&#32047;&#25176;&#25913;&#36827;&#26426;&#21046;&#33021;&#25552;&#39640;&#28040;&#36153;&#32773;&#31119;&#21033;&#21644;&#20844;&#21496;&#21033;&#28070;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#21521;&#31454;&#20105;&#23545;&#25163;&#20986;&#21806;&#25968;&#25454;&#30340;&#25104;&#26412;&#19982;&#25928;&#30410;&#12290;&#23613;&#31649;&#20986;&#21806;&#25152;&#26377;&#28040;&#36153;&#32773;&#30340;&#25968;&#25454;&#21487;&#33021;&#20250;&#38477;&#20302;&#20844;&#21496;&#30340;&#24635;&#21033;&#28070;&#65292;&#20294;&#23384;&#22312;&#20854;&#20182;&#20986;&#21806;&#26426;&#21046;&#8212;&#8212;&#21482;&#38144;&#21806;&#37096;&#20998;&#28040;&#36153;&#32773;&#30340;&#25968;&#25454;&#8212;&#8212;&#20351;&#24471;&#20004;&#23478;&#20844;&#21496;&#37117;&#21463;&#30410;&#12290;&#25105;&#20204;&#30830;&#23450;&#20102;&#21033;&#28070;&#26368;&#22823;&#21270;&#30340;&#26426;&#21046;&#65292;&#24182;&#35777;&#26126;&#20102;&#20844;&#21496;&#30340;&#21463;&#30410;&#26159;&#20197;&#28040;&#36153;&#32773;&#30340;&#25104;&#26412;&#20026;&#20195;&#20215;&#30340;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#26500;&#24314;&#20102;&#24085;&#32047;&#25176;&#25913;&#36827;&#26426;&#21046;&#65292;&#20854;&#20013;&#27599;&#20010;&#28040;&#36153;&#32773;&#30340;&#31119;&#21033;&#20197;&#21450;&#20004;&#23478;&#20844;&#21496;&#30340;&#21033;&#28070;&#22343;&#22686;&#21152;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#35777;&#26126;&#28040;&#36153;&#32773;&#36873;&#25321;&#21152;&#20837;&#21487;&#20197;&#20316;&#20026;&#19968;&#31181;&#25163;&#27573;&#65292;&#20419;&#20351;&#20844;&#21496;&#36873;&#25321;&#24085;&#32047;&#25176;&#25913;&#36827;&#26426;&#21046;&#32780;&#19981;&#26159;&#21033;&#28070;&#26368;&#22823;&#21270;&#26426;&#21046;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study the costs and benefits of selling data to a competitor. Although selling all consumers' data may decrease total firm profits, there exist other selling mechanisms -- in which only some consumers' data is sold -- that render both firms better off. We identify the profit-maximizing mechanism, and show that the benefit to firms comes at a cost to consumers. We then construct Pareto-improving mechanisms, in which each consumers' welfare, as well as both firms' profits, increase. Finally, we show that consumer opt-in can serve as an instrument to induce firms to choose a Pareto-improving mechanism over a profit-maximizing one.
&lt;/p&gt;</description></item><item><title>&#36825;&#31687;&#35770;&#25991;&#30740;&#31350;&#20102;&#22312;&#20449;&#24687;&#32858;&#21512;&#28216;&#25103;&#20013;&#65292;&#36890;&#36807;&#19968;&#20010;&#20013;&#20171;&#23558;&#22810;&#20010;&#21457;&#36865;&#32773;&#30340;&#20449;&#24687;&#32858;&#21512;&#24182;&#21521;&#25509;&#25910;&#32773;&#25512;&#33616;&#34892;&#21160;&#30340;&#38382;&#39064;&#12290;&#30740;&#31350;&#30446;&#26631;&#26159;&#25214;&#21040;&#19968;&#20010;&#26368;&#20248;&#30340;&#20013;&#20171;/&#24179;&#21488;&#65292;&#20197;&#22312;&#36873;&#25321;&#34892;&#21160;&#26102;&#26368;&#22823;&#21270;&#29992;&#25143;&#30340;&#31119;&#21033;&#65292;&#24182;&#19988;&#35201;&#27714;&#35813;&#20013;&#20171;&#20855;&#26377;&#28608;&#21169;&#20860;&#23481;&#24615;&#21644;&#24377;&#24615;&#12290;</title><link>http://arxiv.org/abs/2307.05054</link><description>&lt;p&gt;
&#24377;&#24615;&#20449;&#24687;&#32858;&#21512;
&lt;/p&gt;
&lt;p&gt;
Resilient Information Aggregation. (arXiv:2307.05054v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.05054
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#30740;&#31350;&#20102;&#22312;&#20449;&#24687;&#32858;&#21512;&#28216;&#25103;&#20013;&#65292;&#36890;&#36807;&#19968;&#20010;&#20013;&#20171;&#23558;&#22810;&#20010;&#21457;&#36865;&#32773;&#30340;&#20449;&#24687;&#32858;&#21512;&#24182;&#21521;&#25509;&#25910;&#32773;&#25512;&#33616;&#34892;&#21160;&#30340;&#38382;&#39064;&#12290;&#30740;&#31350;&#30446;&#26631;&#26159;&#25214;&#21040;&#19968;&#20010;&#26368;&#20248;&#30340;&#20013;&#20171;/&#24179;&#21488;&#65292;&#20197;&#22312;&#36873;&#25321;&#34892;&#21160;&#26102;&#26368;&#22823;&#21270;&#29992;&#25143;&#30340;&#31119;&#21033;&#65292;&#24182;&#19988;&#35201;&#27714;&#35813;&#20013;&#20171;&#20855;&#26377;&#28608;&#21169;&#20860;&#23481;&#24615;&#21644;&#24377;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#20449;&#24687;&#32858;&#21512;&#28216;&#25103;&#20013;&#65292;&#19968;&#32452;&#21457;&#36865;&#32773;&#36890;&#36807;&#19968;&#20010;&#20013;&#20171;&#19982;&#25509;&#25910;&#32773;&#36827;&#34892;&#20114;&#21160;&#12290;&#27599;&#20010;&#21457;&#36865;&#32773;&#35266;&#23519;&#21040;&#19990;&#30028;&#30340;&#29366;&#24577;&#65292;&#24182;&#21521;&#20013;&#20171;&#20256;&#36798;&#19968;&#20010;&#20449;&#24687;&#65292;&#20013;&#20171;&#26681;&#25454;&#25509;&#25910;&#21040;&#30340;&#20449;&#24687;&#21521;&#25509;&#25910;&#32773;&#25512;&#33616;&#19968;&#20010;&#34892;&#21160;&#12290;&#21457;&#36865;&#32773;&#21644;&#25509;&#25910;&#32773;&#30340;&#22238;&#25253;&#21462;&#20915;&#20110;&#19990;&#30028;&#30340;&#29366;&#24577;&#21644;&#25509;&#25910;&#32773;&#36873;&#25321;&#30340;&#34892;&#21160;&#12290;&#36825;&#20010;&#35774;&#32622;&#22312;&#20004;&#20010;&#26041;&#38754;&#25193;&#23637;&#20102;&#33879;&#21517;&#30340;&#24265;&#20215;&#20132;&#35848;&#27169;&#22411;&#65306;&#26377;&#24456;&#22810;&#21457;&#36865;&#32773;&#65288;&#32780;&#19981;&#26159;&#21482;&#26377;&#19968;&#20010;&#65289;&#21644;&#19968;&#20010;&#20013;&#20171;&#12290;&#20174;&#23454;&#36341;&#35282;&#24230;&#26469;&#30475;&#65292;&#36825;&#20010;&#35774;&#32622;&#25429;&#25417;&#21040;&#20102;&#23558;&#25112;&#30053;&#19987;&#23478;&#30340;&#24314;&#35758;&#22312;&#26381;&#21153;&#34892;&#21160;&#25512;&#33616;&#32473;&#29992;&#25143;&#26102;&#36827;&#34892;&#32858;&#21512;&#30340;&#24179;&#21488;&#12290;&#25105;&#20204;&#30340;&#30446;&#26631;&#26159;&#25214;&#21040;&#19968;&#20010;&#26368;&#20248;&#30340;&#20013;&#20171;/&#24179;&#21488;&#65292;&#20197;&#22312;&#36873;&#25321;&#22343;&#34913;&#26102;&#26368;&#22823;&#21270;&#29992;&#25143;&#30340;&#31119;&#21033;&#65292;&#24182;&#19988;&#23545;&#20110;&#25509;&#25910;&#32773;/&#29992;&#25143;&#22312;&#36873;&#25321;&#25512;&#33616;&#34892;&#21160;&#26102;&#20445;&#25345;&#39640;&#24230;&#30340;&#28608;&#21169;&#20860;&#23481;&#24615;&#35201;&#27714;&#65292;&#24182;&#19988;&#23545;&#20110;&#34987;&#25512;&#33616;&#30340;&#34892;&#21160;&#36873;&#25321;&#20063;&#20855;&#26377;&#24377;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
In an information aggregation game, a set of senders interact with a receiver through a mediator. Each sender observes the state of the world and communicates a message to the mediator, who recommends an action to the receiver based on the messages received. The payoff of the senders and of the receiver depend on both the state of the world and the action selected by the receiver. This setting extends the celebrated cheap talk model in two aspects: there are many senders (as opposed to just one) and there is a mediator. From a practical perspective, this setting captures platforms in which strategic experts advice is aggregated in service of action recommendations to the user. We aim at finding an optimal mediator/platform that maximizes the users' welfare given highly resilient incentive compatibility requirements on the equilibrium selected: we want the platform to be incentive compatible for the receiver/user when selecting the recommended action, and we want it to be resilient agai
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#21033;&#29992;&#29983;&#25104;&#22411;&#26234;&#33021;&#20307;&#22312;&#27969;&#34892;&#30149;&#27169;&#22411;&#20013;&#27169;&#25311;&#20102;&#20154;&#31867;&#34892;&#20026;&#65292;&#36890;&#36807;&#27169;&#25311;&#23454;&#39564;&#23637;&#31034;&#20102;&#26234;&#33021;&#20307;&#30340;&#34892;&#20026;&#19982;&#30495;&#23454;&#19990;&#30028;&#30456;&#20284;&#65292;&#24182;&#25104;&#21151;&#23454;&#29616;&#20102;&#27969;&#34892;&#30149;&#26354;&#32447;&#30340;&#24179;&#22374;&#21270;&#12290;&#35813;&#30740;&#31350;&#21019;&#36896;&#20102;&#25913;&#36827;&#21160;&#24577;&#31995;&#32479;&#24314;&#27169;&#30340;&#28508;&#21147;&#65292;&#20026;&#34920;&#31034;&#20154;&#31867;&#24605;&#32500;&#12289;&#25512;&#29702;&#21644;&#20915;&#31574;&#25552;&#20379;&#20102;&#19968;&#31181;&#36884;&#24452;&#12290;</title><link>http://arxiv.org/abs/2307.04986</link><description>&lt;p&gt;
&#29992;&#29983;&#25104;&#22411;&#26234;&#33021;&#20307;&#36827;&#34892;&#27969;&#34892;&#30149;&#24314;&#27169;
&lt;/p&gt;
&lt;p&gt;
Epidemic Modeling with Generative Agents. (arXiv:2307.04986v1 [cs.AI])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.04986
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#21033;&#29992;&#29983;&#25104;&#22411;&#26234;&#33021;&#20307;&#22312;&#27969;&#34892;&#30149;&#27169;&#22411;&#20013;&#27169;&#25311;&#20102;&#20154;&#31867;&#34892;&#20026;&#65292;&#36890;&#36807;&#27169;&#25311;&#23454;&#39564;&#23637;&#31034;&#20102;&#26234;&#33021;&#20307;&#30340;&#34892;&#20026;&#19982;&#30495;&#23454;&#19990;&#30028;&#30456;&#20284;&#65292;&#24182;&#25104;&#21151;&#23454;&#29616;&#20102;&#27969;&#34892;&#30149;&#26354;&#32447;&#30340;&#24179;&#22374;&#21270;&#12290;&#35813;&#30740;&#31350;&#21019;&#36896;&#20102;&#25913;&#36827;&#21160;&#24577;&#31995;&#32479;&#24314;&#27169;&#30340;&#28508;&#21147;&#65292;&#20026;&#34920;&#31034;&#20154;&#31867;&#24605;&#32500;&#12289;&#25512;&#29702;&#21644;&#20915;&#31574;&#25552;&#20379;&#20102;&#19968;&#31181;&#36884;&#24452;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20379;&#20102;&#19968;&#31181;&#26032;&#30340;&#20010;&#20307;&#23618;&#38754;&#24314;&#27169;&#33539;&#24335;&#65292;&#20197;&#35299;&#20915;&#23558;&#20154;&#31867;&#34892;&#20026;&#32435;&#20837;&#27969;&#34892;&#30149;&#27169;&#22411;&#30340;&#37325;&#22823;&#25361;&#25112;&#12290;&#36890;&#36807;&#22312;&#22522;&#20110;&#26234;&#33021;&#20307;&#30340;&#27969;&#34892;&#30149;&#27169;&#22411;&#20013;&#21033;&#29992;&#29983;&#25104;&#22411;&#20154;&#24037;&#26234;&#33021;&#65292;&#27599;&#20010;&#26234;&#33021;&#20307;&#37117;&#33021;&#22815;&#36890;&#36807;&#36830;&#25509;&#21040;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;&#22914;ChatGPT&#65289;&#36827;&#34892;&#33258;&#20027;&#25512;&#29702;&#21644;&#20915;&#31574;&#12290;&#36890;&#36807;&#21508;&#31181;&#27169;&#25311;&#23454;&#39564;&#65292;&#25105;&#20204;&#21576;&#29616;&#20102;&#20196;&#20154;&#20449;&#26381;&#30340;&#35777;&#25454;&#65292;&#34920;&#26126;&#29983;&#25104;&#22411;&#26234;&#33021;&#20307;&#27169;&#20223;&#20102;&#29616;&#23454;&#19990;&#30028;&#30340;&#34892;&#20026;&#65292;&#22914;&#29983;&#30149;&#26102;&#36827;&#34892;&#38548;&#31163;&#65292;&#30149;&#20363;&#22686;&#21152;&#26102;&#36827;&#34892;&#33258;&#25105;&#38548;&#31163;&#12290;&#24635;&#20307;&#32780;&#35328;&#65292;&#26234;&#33021;&#20307;&#23637;&#31034;&#20102;&#31867;&#20284;&#20110;&#36817;&#26399;&#27969;&#34892;&#30149;&#35266;&#23519;&#21040;&#30340;&#22810;&#27425;&#27874;&#21160;&#65292;&#28982;&#21518;&#26159;&#19968;&#27573;&#27969;&#34892;&#26399;&#12290;&#27492;&#22806;&#65292;&#26234;&#33021;&#20307;&#25104;&#21151;&#22320;&#20351;&#27969;&#34892;&#30149;&#26354;&#32447;&#24179;&#22374;&#21270;&#12290;&#35813;&#30740;&#31350;&#25552;&#20379;&#20102;&#19968;&#31181;&#25913;&#36827;&#21160;&#24577;&#31995;&#32479;&#24314;&#27169;&#30340;&#28508;&#21147;&#65292;&#36890;&#36807;&#25552;&#20379;&#19968;&#31181;&#34920;&#31034;&#20154;&#31867;&#22823;&#33041;&#12289;&#25512;&#29702;&#21644;&#20915;&#31574;&#30340;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
This study offers a new paradigm of individual-level modeling to address the grand challenge of incorporating human behavior in epidemic models. Using generative artificial intelligence in an agent-based epidemic model, each agent is empowered to make its own reasonings and decisions via connecting to a large language model such as ChatGPT. Through various simulation experiments, we present compelling evidence that generative agents mimic real-world behaviors such as quarantining when sick and self-isolation when cases rise. Collectively, the agents demonstrate patterns akin to multiple waves observed in recent pandemics followed by an endemic period. Moreover, the agents successfully flatten the epidemic curve. This study creates potential to improve dynamic system modeling by offering a way to represent human brain, reasoning, and decision making.
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#22823;&#35268;&#27169;&#19990;&#30028;&#20013;&#30340;&#35777;&#25454;&#21512;&#20316;&#65288;ECL&#65289;&#30340;&#38382;&#39064;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#20010;&#19981;&#23436;&#20840;&#20449;&#24687;&#30340;&#35848;&#21028;&#38382;&#39064;&#30340;&#21338;&#24328;&#35770;&#27169;&#22411;&#12290;&#36890;&#36807;&#27169;&#22411;&#65292;&#20316;&#32773;&#21457;&#29616;&#25152;&#26377;&#21512;&#20316;&#32773;&#24517;&#39035;&#26368;&#22823;&#21270;&#30456;&#21516;&#30340;&#21152;&#26435;&#25928;&#29992;&#20989;&#25968;&#20043;&#21644;&#25165;&#33021;&#36798;&#21040;&#24085;&#32047;&#25176;&#26368;&#20248;&#32467;&#26524;&#12290;</title><link>http://arxiv.org/abs/2307.04879</link><description>&lt;p&gt;
&#22312;&#22823;&#35268;&#27169;&#19990;&#30028;&#20013;&#24314;&#27169;&#35777;&#25454;&#21512;&#20316;
&lt;/p&gt;
&lt;p&gt;
Modeling evidential cooperation in large worlds. (arXiv:2307.04879v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.04879
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#22823;&#35268;&#27169;&#19990;&#30028;&#20013;&#30340;&#35777;&#25454;&#21512;&#20316;&#65288;ECL&#65289;&#30340;&#38382;&#39064;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#20010;&#19981;&#23436;&#20840;&#20449;&#24687;&#30340;&#35848;&#21028;&#38382;&#39064;&#30340;&#21338;&#24328;&#35770;&#27169;&#22411;&#12290;&#36890;&#36807;&#27169;&#22411;&#65292;&#20316;&#32773;&#21457;&#29616;&#25152;&#26377;&#21512;&#20316;&#32773;&#24517;&#39035;&#26368;&#22823;&#21270;&#30456;&#21516;&#30340;&#21152;&#26435;&#25928;&#29992;&#20989;&#25968;&#20043;&#21644;&#25165;&#33021;&#36798;&#21040;&#24085;&#32047;&#25176;&#26368;&#20248;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22823;&#35268;&#27169;&#19990;&#30028;&#20013;&#30340;&#35777;&#25454;&#21512;&#20316;&#65288;ECL&#65289;&#25351;&#30340;&#26159;&#20154;&#31867;&#21644;&#20854;&#20182;&#20195;&#29702;&#20154;&#21487;&#20197;&#36890;&#36807;&#19982;&#20855;&#26377;&#19981;&#21516;&#20215;&#20540;&#35266;&#30340;&#30456;&#20284;&#20195;&#29702;&#20154;&#22312;&#19968;&#20010;&#22823;&#23431;&#23449;&#20013;&#30340;&#22240;&#26524;&#26029;&#24320;&#37096;&#20998;&#21512;&#20316;&#32780;&#33719;&#30410;&#12290;&#21512;&#20316;&#20026;&#20195;&#29702;&#20154;&#25552;&#20379;&#20102;&#20854;&#20182;&#30456;&#20284;&#20195;&#29702;&#20154;&#21487;&#33021;&#20250;&#21512;&#20316;&#30340;&#35777;&#25454;&#65292;&#20174;&#32780;&#20351;&#25152;&#26377;&#20154;&#37117;&#20174;&#20132;&#26131;&#20013;&#33719;&#30410;&#12290;&#23545;&#20110;&#21033;&#20182;&#20027;&#20041;&#32773;&#26469;&#35828;&#65292;&#36825;&#21487;&#33021;&#26159;&#19968;&#20010;&#20851;&#38190;&#30340;&#32771;&#34385;&#22240;&#32032;&#12290;&#25105;&#23558;ECL&#21457;&#23637;&#20026;&#19968;&#20010;&#19981;&#23436;&#20840;&#20449;&#24687;&#30340;&#35848;&#21028;&#38382;&#39064;&#30340;&#21338;&#24328;&#35770;&#27169;&#22411;&#12290;&#35813;&#27169;&#22411;&#34701;&#20837;&#20102;&#23545;&#20182;&#20154;&#20215;&#20540;&#35266;&#21644;&#23454;&#35777;&#24773;&#20917;&#30340;&#19981;&#30830;&#23450;&#24615;&#65292;&#24182;&#35299;&#20915;&#20102;&#36873;&#25321;&#22949;&#21327;&#32467;&#26524;&#30340;&#38382;&#39064;&#12290;&#20351;&#29992;&#35813;&#27169;&#22411;&#65292;&#25105;&#35843;&#26597;&#20102;ECL&#23384;&#22312;&#30340;&#38382;&#39064;&#65292;&#24182;&#27010;&#36848;&#20102;&#24320;&#25918;&#30340;&#25216;&#26415;&#21644;&#21746;&#23398;&#38382;&#39064;&#12290;&#25105;&#23637;&#31034;&#20102;&#25152;&#26377;&#21512;&#20316;&#32773;&#24517;&#39035;&#26368;&#22823;&#21270;&#30456;&#21516;&#30340;&#21152;&#26435;&#25928;&#29992;&#20989;&#25968;&#20043;&#21644;&#25165;&#33021;&#36798;&#21040;&#24085;&#32047;&#25176;&#26368;&#20248;&#32467;&#26524;&#12290;&#28982;&#32780;&#65292;&#25105;&#21453;&#23545;&#36890;&#36807;&#23545;&#25928;&#29992;&#20989;&#25968;&#36827;&#34892;&#24402;&#19968;&#21270;&#26469;&#38544;&#24335;&#36873;&#25321;&#22949;&#21327;&#32467;&#26524;&#12290;&#25105;&#22238;&#39038;&#20102;&#35848;&#21028;&#29702;&#35770;&#21644;
&lt;/p&gt;
&lt;p&gt;
Evidential cooperation in large worlds (ECL) refers to the idea that humans and other agents can benefit by cooperating with similar agents with differing values in causally disconnected parts of a large universe. Cooperating provides agents with evidence that other similar agents are likely to cooperate too, resulting in gains from trade for all. This could be a crucial consideration for altruists.  I develop a game-theoretic model of ECL as an incomplete information bargaining problem. The model incorporates uncertainty about others' value systems and empirical situations, and addresses the problem of selecting a compromise outcome. Using the model, I investigate issues with ECL and outline open technical and philosophical questions.  I show that all cooperators must maximize the same weighted sum of utility functions to reach a Pareto optimal outcome. However, I argue against selecting a compromise outcome implicitly by normalizing utility functions. I review bargaining theory and a
&lt;/p&gt;</description></item><item><title>&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#33258;&#36866;&#24212;&#25910;&#32553;&#20272;&#35745;&#37327;&#65292;&#36890;&#36807;&#26368;&#23567;&#21270;&#26368;&#22351;&#39118;&#38505;&#30456;&#23545;&#20110;&#24050;&#30693;&#20559;&#24046;&#19978;&#38480;&#30340;&#29702;&#35770;&#26368;&#20248;&#20272;&#35745;&#37327;&#30340;&#26368;&#22823;&#39118;&#38505;&#30340;&#30334;&#20998;&#27604;&#22686;&#21152;&#12290;&#30740;&#31350;&#23581;&#35797;&#35299;&#20915;&#32463;&#39564;&#30740;&#31350;&#20013;&#30340;&#40065;&#26834;&#24615;&#21644;&#25928;&#29575;&#20043;&#38388;&#30340;&#26435;&#34913;&#38382;&#39064;&#65292;&#36991;&#20813;&#20102;&#27169;&#22411;&#26816;&#39564;&#30340;&#22797;&#26434;&#24615;&#12290;</title><link>http://arxiv.org/abs/2305.14265</link><description>&lt;p&gt;
&#36866;&#24212;&#27169;&#22411;&#38169;&#35823;&#30340;&#20272;&#35745;
&lt;/p&gt;
&lt;p&gt;
Adapting to Misspecification. (arXiv:2305.14265v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.14265
&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#33258;&#36866;&#24212;&#25910;&#32553;&#20272;&#35745;&#37327;&#65292;&#36890;&#36807;&#26368;&#23567;&#21270;&#26368;&#22351;&#39118;&#38505;&#30456;&#23545;&#20110;&#24050;&#30693;&#20559;&#24046;&#19978;&#38480;&#30340;&#29702;&#35770;&#26368;&#20248;&#20272;&#35745;&#37327;&#30340;&#26368;&#22823;&#39118;&#38505;&#30340;&#30334;&#20998;&#27604;&#22686;&#21152;&#12290;&#30740;&#31350;&#23581;&#35797;&#35299;&#20915;&#32463;&#39564;&#30740;&#31350;&#20013;&#30340;&#40065;&#26834;&#24615;&#21644;&#25928;&#29575;&#20043;&#38388;&#30340;&#26435;&#34913;&#38382;&#39064;&#65292;&#36991;&#20813;&#20102;&#27169;&#22411;&#26816;&#39564;&#30340;&#22797;&#26434;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#32463;&#39564;&#30740;&#31350;&#36890;&#24120;&#28041;&#21450;&#21040;&#40065;&#26834;&#24615;&#21644;&#25928;&#29575;&#20043;&#38388;&#30340;&#26435;&#34913;&#12290;&#30740;&#31350;&#20154;&#21592;&#24819;&#35201;&#20272;&#35745;&#19968;&#20010;&#26631;&#37327;&#21442;&#25968;&#65292;&#21487;&#20197;&#20351;&#29992;&#24378;&#20551;&#35774;&#26469;&#35774;&#35745;&#19968;&#20010;&#31934;&#20934;&#20294;&#21487;&#33021;&#23384;&#22312;&#20005;&#37325;&#20559;&#24046;&#30340;&#23616;&#38480;&#20272;&#35745;&#37327;&#65292;&#20063;&#21487;&#20197;&#25918;&#26494;&#19968;&#20123;&#20551;&#35774;&#24182;&#35774;&#35745;&#19968;&#20010;&#26356;&#21152;&#40065;&#26834;&#20294;&#21464;&#37327;&#36739;&#22823;&#30340;&#20272;&#35745;&#37327;&#12290;&#24403;&#23616;&#38480;&#20272;&#35745;&#37327;&#30340;&#20559;&#24046;&#19978;&#38480;&#24050;&#30693;&#26102;&#65292;&#23558;&#26080;&#38480;&#21046;&#20272;&#35745;&#37327;&#25910;&#32553;&#21040;&#23616;&#38480;&#20272;&#35745;&#37327;&#26159;&#26368;&#20248;&#30340;&#12290;&#23545;&#20110;&#23616;&#38480;&#20272;&#35745;&#37327;&#20559;&#24046;&#19978;&#38480;&#26410;&#30693;&#30340;&#24773;&#20917;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#33258;&#36866;&#24212;&#25910;&#32553;&#20272;&#35745;&#37327;&#65292;&#35813;&#20272;&#35745;&#37327;&#26368;&#23567;&#21270;&#26368;&#22351;&#39118;&#38505;&#30456;&#23545;&#20110;&#24050;&#30693;&#20559;&#24046;&#19978;&#38480;&#30340;&#29702;&#35770;&#26368;&#20248;&#20272;&#35745;&#37327;&#30340;&#26368;&#22823;&#39118;&#38505;&#30340;&#30334;&#20998;&#27604;&#22686;&#21152;&#12290;&#25105;&#20204;&#35777;&#26126;&#33258;&#36866;&#24212;&#20272;&#35745;&#37327;&#26159;&#19968;&#20010;&#21152;&#26435;&#20984;&#26368;&#23567;&#21270;&#26368;&#22823;&#38382;&#39064;&#65292;&#24182;&#25552;&#20379;&#26597;&#25214;&#34920;&#20197;&#20415;&#20110;&#24555;&#36895;&#35745;&#31639;&#12290;&#37325;&#26032;&#23457;&#35270;&#20102;&#20116;&#39033;&#23384;&#22312;&#27169;&#22411;&#35268;&#33539;&#38382;&#39064;&#30340;&#32463;&#39564;&#30740;&#31350;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#36866;&#24212;&#38169;&#35823;&#30340;&#27169;&#22411;&#30340;&#20248;&#21183;&#32780;&#19981;&#26159;&#26816;&#39564;&#12290;
&lt;/p&gt;
&lt;p&gt;
Empirical research typically involves a robustness-efficiency tradeoff. A researcher seeking to estimate a scalar parameter can invoke strong assumptions to motivate a restricted estimator that is precise but may be heavily biased, or they can relax some of these assumptions to motivate a more robust, but variable, unrestricted estimator. When a bound on the bias of the restricted estimator is available, it is optimal to shrink the unrestricted estimator towards the restricted estimator. For settings where a bound on the bias of the restricted estimator is unknown, we propose adaptive shrinkage estimators that minimize the percentage increase in worst case risk relative to an oracle that knows the bound. We show that adaptive estimators solve a weighted convex minimax problem and provide lookup tables facilitating their rapid computation. Revisiting five empirical studies where questions of model specification arise, we examine the advantages of adapting to -- rather than testing for -
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21033;&#29992;&#21322;&#24037;&#20855;&#21464;&#37327;&#23454;&#29616;&#31163;&#25955;&#20869;&#29983;&#21464;&#37327;&#27169;&#22411;&#35782;&#21035;&#30340;&#26041;&#27861;&#65292;&#23545;&#21171;&#21160;&#12289;&#20581;&#24247;&#12289;&#25945;&#32946;&#31561;&#39046;&#22495;&#20855;&#26377;&#28508;&#22312;&#24212;&#29992;&#20215;&#20540;&#12290;</title><link>http://arxiv.org/abs/2303.12667</link><description>&lt;p&gt;
&#19981;&#35201;&#23436;&#20840;&#25490;&#38500;&#25105;&#65292;&#36825;&#26159;&#19981;&#24517;&#35201;&#30340;! &#21322;&#24037;&#20855;&#21464;&#37327;&#30340;&#35782;&#21035;
&lt;/p&gt;
&lt;p&gt;
Don't (fully) exclude me, it's not necessary! Identification with semi-IVs. (arXiv:2303.12667v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.12667
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21033;&#29992;&#21322;&#24037;&#20855;&#21464;&#37327;&#23454;&#29616;&#31163;&#25955;&#20869;&#29983;&#21464;&#37327;&#27169;&#22411;&#35782;&#21035;&#30340;&#26041;&#27861;&#65292;&#23545;&#21171;&#21160;&#12289;&#20581;&#24247;&#12289;&#25945;&#32946;&#31561;&#39046;&#22495;&#20855;&#26377;&#28508;&#22312;&#24212;&#29992;&#20215;&#20540;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#35782;&#21035;&#31163;&#25955;&#20869;&#29983;&#21464;&#37327;&#27169;&#22411;&#30340;&#26032;&#26041;&#27861;&#65292;&#23558;&#20854;&#24212;&#29992;&#20110;&#36830;&#32493;&#28508;&#22312;&#32467;&#26524;&#30340;&#19981;&#21487;&#20998;&#31163;&#27169;&#22411;&#30340;&#19968;&#33324;&#24773;&#20917;&#19979;&#36827;&#34892;&#30740;&#31350;&#12290;&#25105;&#20204;&#37319;&#29992;&#21322;&#24037;&#20855;&#21464;&#37327;&#65288;semi-IVs) &#26469;&#23454;&#29616;&#28508;&#22312;&#32467;&#26524;&#30340;&#38750;&#21442;&#25968;&#35782;&#21035;&#20197;&#21450;&#36873;&#25321;&#26041;&#31243;&#24335;&#30340;&#35782;&#21035;&#65292;&#22240;&#27492;&#20063;&#33021;&#22815;&#35782;&#21035;&#20010;&#20307;&#27835;&#30103;&#25928;&#24212;&#12290;&#19982;&#26631;&#20934;&#24037;&#20855;&#21464;&#37327; &#65288;IVs&#65289;&#38656;&#35201;&#24378;&#21046;&#24615;&#23436;&#20840;&#25490;&#38500;&#19981;&#21516;&#65292;&#21322;&#24037;&#20855;&#21464;&#37327;&#20165;&#22312;&#19968;&#20123;&#28508;&#22312;&#32467;&#26524;&#26041;&#31243;&#24335;&#20013;&#37096;&#20998;&#25490;&#38500;&#65292;&#32780;&#19981;&#26159;&#20840;&#37096;&#25490;&#38500;&#12290;&#23454;&#36341;&#20013;&#65292;&#38656;&#35201;&#22312;&#24378;&#21270;&#25490;&#38500;&#32422;&#26463;&#21644;&#25214;&#21040;&#25903;&#25345;&#33539;&#22260;&#26356;&#24191;&#12289;&#30456;&#20851;&#24615;&#20551;&#35774;&#26356;&#24378;&#30340;&#21322;&#24037;&#20855;&#21464;&#37327;&#20043;&#38388;&#26435;&#34913;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#20026;&#35782;&#21035;&#12289;&#20272;&#35745;&#21644;&#21453;&#20107;&#23454;&#39044;&#27979;&#24320;&#36767;&#20102;&#26032;&#30340;&#36884;&#24452;&#65292;&#24182;&#22312;&#35768;&#22810;&#39046;&#22495;&#65292;&#22914;&#21171;&#21160;&#65292;&#20581;&#24247;&#21644;&#25945;&#32946;&#31561;&#26041;&#38754;&#20855;&#26377;&#28508;&#22312;&#24212;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper proposes a novel approach to identify models with a discrete endogenous variable, that I study in the general context of nonseparable models with continuous potential outcomes. I show that nonparametric identification of the potential outcome and selection equations, and thus of the individual treatment effects, can be obtained with semi-instrumental variables (semi-IVs), which are relevant but only partially excluded from the potential outcomes, i.e., excluded from one or more potential outcome equations, but not necessarily all. This contrasts with the full exclusion restriction imposed on standard instrumental variables (IVs), which is stronger than necessary for identification: IVs are only a special case of valid semi-IVs. In practice, there is a trade-off between imposing stronger exclusion restrictions, and finding semi-IVs with a larger support and stronger relevance assumptions. Since, in empirical work, the main obstacle for finding a valid IV is often the full exc
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#32771;&#34385;&#20102;&#22522;&#20110;DSL&#31574;&#30053;&#30340;&#20195;&#29702;&#20154;&#20248;&#21270;&#26426;&#21046;&#35774;&#35745;&#65292;&#24182;&#22312;&#32452;&#21512;&#25293;&#21334;&#20013;&#30340;Sybil&#25915;&#20987;&#26696;&#20363;&#20013;&#36827;&#34892;&#20102;&#30740;&#31350;&#12290;&#25105;&#20204;&#24341;&#20837;&#20102;DSL&#21644;Leximin&#27010;&#24565;&#65292;&#25506;&#35752;&#20102;&#23427;&#20204;&#19982;&#20854;&#20182;&#40065;&#26834;&#27010;&#24565;&#30340;&#20851;&#31995;&#65292;&#24182;&#23637;&#31034;&#20102;&#23427;&#20204;&#22312;&#25293;&#21334;&#21644;&#20854;&#20182;&#22330;&#26223;&#20013;&#30340;&#24212;&#29992;&#32467;&#26524;&#12290;</title><link>http://arxiv.org/abs/2210.15181</link><description>&lt;p&gt;
&#22522;&#20110;DSL&#31574;&#30053;&#30340;&#20195;&#29702;&#20154;&#20248;&#21270;&#26426;&#21046;&#35774;&#35745;&#65306;&#32452;&#21512;&#25293;&#21334;&#20013;&#30340;Sybil&#25915;&#20987;&#26696;&#20363;
&lt;/p&gt;
&lt;p&gt;
Optimal Mechanism Design for Agents with DSL Strategies: The Case of Sybil Attacks in Combinatorial Auctions. (arXiv:2210.15181v3 [econ.TH] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2210.15181
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#32771;&#34385;&#20102;&#22522;&#20110;DSL&#31574;&#30053;&#30340;&#20195;&#29702;&#20154;&#20248;&#21270;&#26426;&#21046;&#35774;&#35745;&#65292;&#24182;&#22312;&#32452;&#21512;&#25293;&#21334;&#20013;&#30340;Sybil&#25915;&#20987;&#26696;&#20363;&#20013;&#36827;&#34892;&#20102;&#30740;&#31350;&#12290;&#25105;&#20204;&#24341;&#20837;&#20102;DSL&#21644;Leximin&#27010;&#24565;&#65292;&#25506;&#35752;&#20102;&#23427;&#20204;&#19982;&#20854;&#20182;&#40065;&#26834;&#27010;&#24565;&#30340;&#20851;&#31995;&#65292;&#24182;&#23637;&#31034;&#20102;&#23427;&#20204;&#22312;&#25293;&#21334;&#21644;&#20854;&#20182;&#22330;&#26223;&#20013;&#30340;&#24212;&#29992;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#19981;&#30830;&#23450;&#24615;&#19979;&#30340;&#40065;&#26834;&#20915;&#31574;&#20013;&#65292;&#19968;&#20010;&#33258;&#28982;&#30340;&#36873;&#25321;&#26159;&#37319;&#29992;&#23433;&#20840;&#65288;&#25110;&#31216;&#20026;&#23433;&#20840;&#24615;&#65289;&#32423;&#21035;&#30340;&#31574;&#30053;&#12290;&#28982;&#32780;&#65292;&#22312;&#35768;&#22810;&#37325;&#35201;&#24773;&#20917;&#19979;&#65292;&#29305;&#21035;&#26159;&#25293;&#21334;&#20013;&#65292;&#23384;&#22312;&#22823;&#37327;&#30340;&#23433;&#20840;&#32423;&#21035;&#31574;&#30053;&#65292;&#22240;&#27492;&#36873;&#25321;&#21464;&#24471;&#19981;&#26126;&#30830;&#12290;&#25105;&#20204;&#32771;&#34385;&#20102;&#20004;&#20010;&#32454;&#21270;&#30340;&#27010;&#24565;&#65306;&#65288;i&#65289;&#25105;&#20204;&#31216;&#20043;&#20026;DSL&#65288;&#21487;&#21306;&#20998;&#23433;&#20840;&#32423;&#21035;&#65289;&#65292;&#23427;&#22522;&#20110;&#8220;&#21306;&#20998;&#8221;&#27010;&#24565;&#65292;&#20351;&#29992;&#19968;&#23545;&#19968;&#27604;&#36739;&#26469;&#21435;&#38500;&#24179;&#20961;&#30340;&#31561;&#20215;&#24615;&#12290;&#36825;&#25429;&#25417;&#21040;&#20102;&#24403;&#27604;&#36739;&#20004;&#31181;&#34892;&#20026;&#26102;&#65292;&#20195;&#29702;&#20154;&#19981;&#24212;&#20851;&#24515;&#23548;&#33268;&#30456;&#21516;&#22238;&#25253;&#30340;&#24773;&#20917;&#19979;&#30340;&#22238;&#25253;&#24773;&#20917;&#12290;&#65288;ii&#65289;&#31038;&#20250;&#36873;&#25321;&#29702;&#35770;&#20013;&#20247;&#25152;&#21608;&#30693;&#30340;Leximin&#27010;&#24565;&#65292;&#25105;&#20204;&#23558;&#20854;&#24212;&#29992;&#20110;&#40065;&#26834;&#20915;&#31574;&#12290;&#29305;&#21035;&#26159;&#65292;leximin&#24635;&#26159;DSL&#65292;&#20294;&#21453;&#20043;&#19981;&#25104;&#31435;&#12290;&#25105;&#20204;&#30740;&#31350;&#20102;&#36825;&#20123;&#27010;&#24565;&#19982;&#20854;&#20182;&#40065;&#26834;&#27010;&#24565;&#30340;&#20851;&#31995;&#65292;&#24182;&#23637;&#31034;&#20102;&#23427;&#20204;&#22312;&#25293;&#21334;&#21644;&#20854;&#20182;&#22330;&#26223;&#20013;&#30340;&#24212;&#29992;&#32467;&#26524;&#12290;&#32463;&#27982;&#35774;&#35745;&#26088;&#22312;&#22312;&#38754;&#23545;&#33258;&#25105;&#28608;&#21169;&#30340;&#24773;&#20917;&#19979;&#26368;&#22823;&#21270;&#31038;&#20250;&#31119;&#21033;&#12290;
&lt;/p&gt;
&lt;p&gt;
In robust decision making under uncertainty, a natural choice is to go with safety (aka security) level strategies. However, in many important cases, most notably auctions, there is a large multitude of safety level strategies, thus making the choice unclear. We consider two refined notions:  (i) a term we call DSL (distinguishable safety level), and is based on the notion of ``discrimin'', which uses a pairwise comparison of actions while removing trivial equivalencies. This captures the fact that when comparing two actions an agent should not care about payoffs in situations where they lead to identical payoffs.  (ii) The well-known Leximin notion from social choice theory, which we apply for robust decision-making. In particular, the leximin is always DSL but not vice-versa.  We study the relations of these notions to other robust notions, and illustrate the results of their use in auctions and other settings. Economic design aims to maximize social welfare when facing self-motivate
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#20026;&#21306;&#22359;&#38142;&#21435;&#20013;&#24515;&#21270;&#39046;&#22495;&#30340;&#30693;&#35782;&#31995;&#32479;&#21270;&#65292;&#25552;&#20986;&#20102;&#20998;&#31867;&#27861;&#24182;&#24314;&#35758;&#20351;&#29992;&#25351;&#25968;&#26469;&#34913;&#37327;&#21644;&#37327;&#21270;&#21306;&#22359;&#38142;&#30340;&#21435;&#20013;&#24515;&#21270;&#27700;&#24179;&#12290;&#38500;&#20102;&#20849;&#35782;&#21435;&#20013;&#24515;&#21270;&#22806;&#65292;&#20854;&#20182;&#26041;&#38754;&#30340;&#30740;&#31350;&#30456;&#23545;&#36739;&#23569;&#12290;&#36825;&#39033;&#24037;&#20316;&#20026;&#26410;&#26469;&#30340;&#30740;&#31350;&#25552;&#20379;&#20102;&#22522;&#20934;&#21644;&#25351;&#23548;&#12290;</title><link>http://arxiv.org/abs/2205.04256</link><description>&lt;p&gt;
SoK&#65306;&#21306;&#22359;&#38142;&#21435;&#20013;&#24515;&#21270;
&lt;/p&gt;
&lt;p&gt;
SoK: Blockchain Decentralization. (arXiv:2205.04256v4 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2205.04256
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#20026;&#21306;&#22359;&#38142;&#21435;&#20013;&#24515;&#21270;&#39046;&#22495;&#30340;&#30693;&#35782;&#31995;&#32479;&#21270;&#65292;&#25552;&#20986;&#20102;&#20998;&#31867;&#27861;&#24182;&#24314;&#35758;&#20351;&#29992;&#25351;&#25968;&#26469;&#34913;&#37327;&#21644;&#37327;&#21270;&#21306;&#22359;&#38142;&#30340;&#21435;&#20013;&#24515;&#21270;&#27700;&#24179;&#12290;&#38500;&#20102;&#20849;&#35782;&#21435;&#20013;&#24515;&#21270;&#22806;&#65292;&#20854;&#20182;&#26041;&#38754;&#30340;&#30740;&#31350;&#30456;&#23545;&#36739;&#23569;&#12290;&#36825;&#39033;&#24037;&#20316;&#20026;&#26410;&#26469;&#30340;&#30740;&#31350;&#25552;&#20379;&#20102;&#22522;&#20934;&#21644;&#25351;&#23548;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21306;&#22359;&#38142;&#36890;&#36807;&#22312;&#28857;&#23545;&#28857;&#32593;&#32476;&#20013;&#23454;&#29616;&#20998;&#24067;&#24335;&#20449;&#20219;&#65292;&#20026;&#21435;&#20013;&#24515;&#21270;&#32463;&#27982;&#25552;&#20379;&#20102;&#25903;&#25345;&#12290;&#28982;&#32780;&#65292;&#20196;&#20154;&#24778;&#35766;&#30340;&#26159;&#65292;&#30446;&#21069;&#36824;&#32570;&#20047;&#24191;&#27867;&#25509;&#21463;&#30340;&#21435;&#20013;&#24515;&#21270;&#23450;&#20041;&#25110;&#24230;&#37327;&#26631;&#20934;&#12290;&#25105;&#20204;&#36890;&#36807;&#20840;&#38754;&#20998;&#26512;&#29616;&#26377;&#30740;&#31350;&#65292;&#25506;&#32034;&#20102;&#21306;&#22359;&#38142;&#21435;&#20013;&#24515;&#21270;&#30340;&#30693;&#35782;&#31995;&#32479;&#21270;&#65288;SoK&#65289;&#12290;&#39318;&#20808;&#65292;&#25105;&#20204;&#36890;&#36807;&#23545;&#29616;&#26377;&#30740;&#31350;&#30340;&#23450;&#24615;&#20998;&#26512;&#65292;&#22312;&#20849;&#35782;&#12289;&#32593;&#32476;&#12289;&#27835;&#29702;&#12289;&#36130;&#23500;&#21644;&#20132;&#26131;&#31561;&#20116;&#20010;&#26041;&#38754;&#24314;&#31435;&#20102;&#29992;&#20110;&#20998;&#26512;&#21306;&#22359;&#38142;&#21435;&#20013;&#24515;&#21270;&#30340;&#20998;&#31867;&#27861;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#38500;&#20102;&#20849;&#35782;&#21435;&#20013;&#24515;&#21270;&#20197;&#22806;&#65292;&#20854;&#20182;&#26041;&#38754;&#30340;&#30740;&#31350;&#30456;&#23545;&#36739;&#23569;&#12290;&#20854;&#27425;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#25351;&#25968;&#65292;&#36890;&#36807;&#36716;&#25442;&#39321;&#20892;&#29109;&#26469;&#34913;&#37327;&#21644;&#37327;&#21270;&#21306;&#22359;&#38142;&#22312;&#19981;&#21516;&#26041;&#38754;&#30340;&#21435;&#20013;&#24515;&#21270;&#27700;&#24179;&#12290;&#25105;&#20204;&#36890;&#36807;&#27604;&#36739;&#38745;&#24577;&#27169;&#25311;&#39564;&#35777;&#20102;&#35813;&#25351;&#25968;&#30340;&#21487;&#35299;&#37322;&#24615;&#12290;&#25105;&#20204;&#36824;&#25552;&#20379;&#20102;&#20854;&#20182;&#25351;&#25968;&#30340;&#23450;&#20041;&#21644;&#35752;&#35770;&#65292;&#21253;&#25324;&#22522;&#23612;&#31995;&#25968;&#12289;&#20013;&#26412;&#32874;&#31995;&#25968;&#21644;&#36203;&#23572;&#26364;-&#36203;&#23572;&#19996;&#25351;&#25968;&#31561;&#12290;&#25105;&#20204;&#30340;&#24037;&#20316;&#27010;&#36848;&#20102;&#24403;&#21069;&#21306;&#22359;&#38142;&#21435;&#20013;&#24515;&#21270;&#30340;&#26223;&#35937;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#20010;&#37327;&#21270;&#30340;&#24230;&#37327;&#26631;&#20934;&#65292;&#20026;&#26410;&#26469;&#30340;&#30740;&#31350;&#25552;&#20379;&#22522;&#20934;&#12290;
&lt;/p&gt;
&lt;p&gt;
Blockchain empowers a decentralized economy by enabling distributed trust in a peer-to-peer network. However, surprisingly, a widely accepted definition or measurement of decentralization is still lacking. We explore a systematization of knowledge (SoK) on blockchain decentralization by comprehensively analyzing existing studies in various aspects. First, we establish a taxonomy for analyzing blockchain decentralization in the five facets of consensus, network, governance, wealth, and transaction bu qualitative analysis of existing research. We find relatively little research on aspects other than consensus decentralization. Second, we propose an index that measures and quantifies the decentralization level of blockchain across different facets by transforming Shannon entropy. We verify the explainability of the index via comparative static simulations. We also provide the definition and discussion of alternative indices including the Gini Coefficient, Nakamoto Coefficient, and Herfind
&lt;/p&gt;</description></item></channel></rss>