<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#20855;&#26377;&#26102;&#38388;&#19981;&#19968;&#33268;&#20559;&#22909;&#30340;&#26368;&#20248;&#20572;&#27490;&#38382;&#39064;&#65292;&#36890;&#36807;&#23545;&#26102;&#38388;&#19981;&#19968;&#33268;&#24615;&#27700;&#24179;&#30340;&#34913;&#37327;&#65292;&#21457;&#29616;&#20102;&#27010;&#29575;&#22833;&#30495;&#23548;&#33268;&#26102;&#38388;&#19981;&#19968;&#33268;&#24615;&#30340;&#31243;&#24230;&#19982;&#36716;&#21464;&#20026;&#22797;&#26434;&#31574;&#30053;&#25152;&#38656;&#30340;&#26102;&#38388;&#20043;&#38388;&#30340;&#20851;&#31995;&#12290;</title><link>https://arxiv.org/abs/2404.02498</link><description>&lt;p&gt;
&#20174;&#26102;&#38388;&#19981;&#19968;&#33268;&#21040;&#26102;&#38388;&#19968;&#33268;&#30340;&#26368;&#20248;&#20572;&#27490;&#38382;&#39064;
&lt;/p&gt;
&lt;p&gt;
From Time-inconsistency to Time-consistency for Optimal Stopping Problems
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2404.02498
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#20855;&#26377;&#26102;&#38388;&#19981;&#19968;&#33268;&#20559;&#22909;&#30340;&#26368;&#20248;&#20572;&#27490;&#38382;&#39064;&#65292;&#36890;&#36807;&#23545;&#26102;&#38388;&#19981;&#19968;&#33268;&#24615;&#27700;&#24179;&#30340;&#34913;&#37327;&#65292;&#21457;&#29616;&#20102;&#27010;&#29575;&#22833;&#30495;&#23548;&#33268;&#26102;&#38388;&#19981;&#19968;&#33268;&#24615;&#30340;&#31243;&#24230;&#19982;&#36716;&#21464;&#20026;&#22797;&#26434;&#31574;&#30053;&#25152;&#38656;&#30340;&#26102;&#38388;&#20043;&#38388;&#30340;&#20851;&#31995;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#23545;&#20110;&#20855;&#26377;&#26102;&#38388;&#19981;&#19968;&#33268;&#20559;&#22909;&#30340;&#26368;&#20248;&#20572;&#27490;&#38382;&#39064;&#65292;&#25105;&#20204;&#36890;&#36807;&#23558;&#20174;&#22825;&#30495;&#31574;&#30053;&#36716;&#21464;&#20026;&#22797;&#26434;&#31574;&#30053;&#25152;&#38656;&#30340;&#26102;&#38388;&#26469;&#34913;&#37327;&#26102;&#38388;&#19981;&#19968;&#33268;&#30340;&#22266;&#26377;&#27700;&#24179;&#12290;&#29305;&#21035;&#26159;&#65292;&#22312;&#37325;&#22797;&#23454;&#39564;&#20013;&#65292;&#24403;&#22825;&#30495;&#20195;&#29702;&#21487;&#20197;&#35266;&#23519;&#21040;&#22905;&#30340;&#23454;&#38469;&#34892;&#21160;&#24207;&#21015;&#19982;&#26368;&#21021;&#35745;&#21010;&#19981;&#19968;&#33268;&#26102;&#65292;&#22905;&#20250;&#26681;&#25454;&#21518;&#32493;&#23454;&#38469;&#34892;&#20026;&#30340;&#35266;&#23519;&#36873;&#25321;&#31435;&#21363;&#34892;&#21160;&#12290;&#35813;&#36807;&#31243;&#37325;&#22797;&#36827;&#34892;&#65292;&#30452;&#21040;&#22905;&#30340;&#23454;&#38469;&#34892;&#21160;&#24207;&#21015;&#22312;&#20219;&#20309;&#26102;&#38388;&#28857;&#37117;&#19982;&#22905;&#30340;&#35745;&#21010;&#19968;&#33268;&#12290;&#25105;&#20204;&#34920;&#26126;&#65292;&#23545;&#20110;&#32047;&#31215;&#27010;&#29575;&#29702;&#35770;&#30340;&#20559;&#22909;&#20540;&#65292;&#20854;&#20013;&#26102;&#38388;&#19981;&#19968;&#33268;&#30001;&#20110;&#27010;&#29575;&#22833;&#30495;&#23548;&#33268;&#65292;&#27010;&#29575;&#22833;&#30495;&#31243;&#24230;&#36234;&#39640;&#65292;&#26102;&#38388;&#19981;&#19968;&#33268;&#31243;&#24230;&#23601;&#36234;&#20005;&#37325;&#65292;&#38656;&#35201;&#30340;&#26102;&#38388;&#36716;&#21464;&#20174;&#22825;&#30495;&#31574;&#30053;&#21040;&#22797;&#26434;&#31574;&#30053;&#20063;&#26356;&#22810;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2404.02498v1 Announce Type: new  Abstract: For optimal stopping problems with time-inconsistent preference, we measure the inherent level of time-inconsistency by taking the time needed to turn the naive strategies into the sophisticated ones. In particular, when in a repeated experiment the naive agent can observe her actual sequence of actions which are inconsistent with what she has planned at the initial time, she then chooses her immediate action based on the observations on her later actual behavior. The procedure is repeated until her actual sequence of actions are consistent with her plan at any time. We show that for the preference value of cumulative prospect theory, in which the time-inconsistency is due to the probability distortion, the higher the degree of probability distortion, the more severe the level of time-inconsistency, and the more time required to turn the naive strategies into the sophisticated ones.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26725;&#25509;TSLS&#21644;JIVE&#30340;&#26032;&#26041;&#27861;TSJI&#26469;&#22788;&#29702;&#20869;&#29983;&#24615;&#65292;&#20855;&#26377;&#29992;&#25143;&#23450;&#20041;&#21442;&#25968;&#955;&#65292;&#21487;&#20197;&#36817;&#20284;&#26080;&#20559;&#65292;&#19988;&#22312;&#35768;&#22810;&#24037;&#20855;&#21464;&#37327;&#28176;&#36827;&#24773;&#20917;&#19979;&#26159;&#19968;&#33268;&#19988;&#28176;&#36827;&#27491;&#24120;&#30340;&#12290;</title><link>http://arxiv.org/abs/2305.17615</link><description>&lt;p&gt;
TSLS&#19982;JIVE&#30340;&#26725;&#25509;
&lt;/p&gt;
&lt;p&gt;
Bridging TSLS and JIVE. (arXiv:2305.17615v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.17615
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26725;&#25509;TSLS&#21644;JIVE&#30340;&#26032;&#26041;&#27861;TSJI&#26469;&#22788;&#29702;&#20869;&#29983;&#24615;&#65292;&#20855;&#26377;&#29992;&#25143;&#23450;&#20041;&#21442;&#25968;&#955;&#65292;&#21487;&#20197;&#36817;&#20284;&#26080;&#20559;&#65292;&#19988;&#22312;&#35768;&#22810;&#24037;&#20855;&#21464;&#37327;&#28176;&#36827;&#24773;&#20917;&#19979;&#26159;&#19968;&#33268;&#19988;&#28176;&#36827;&#27491;&#24120;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#22788;&#29702;&#20869;&#29983;&#24615;&#26102;&#65292;&#32463;&#27982;&#23398;&#23478;&#32463;&#24120;&#23454;&#26045;TSLS&#12290;&#24403;&#24037;&#20855;&#21464;&#37327;&#25968;&#37327;&#20247;&#22810;&#26102;&#65292;TSLS&#20559;&#20506;&#24456;&#20005;&#37325;&#12290;&#22240;&#27492;&#65292;JIVE&#34987;&#25552;&#20986;&#26469;&#20943;&#23569;&#36229;&#35782;&#21035;&#30340;TSLS&#20559;&#24046;&#12290;&#20294;&#26159;&#65292;&#36825;&#20004;&#31181;&#26041;&#27861;&#37117;&#26377;&#37325;&#22823;&#32570;&#38519;&#12290;&#24403;&#36229;&#35782;&#21035;&#24230;&#36739;&#39640;&#26102;&#65292;&#36229;&#23450;TSLS&#20559;&#24046;&#24456;&#22823;&#65292;&#32780;JIVE&#19981;&#31283;&#23450;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#23558;TSLS&#21644;JIVE&#30340;&#20248;&#21270;&#38382;&#39064;&#26725;&#25509;&#36215;&#26469;&#65292;&#35299;&#20915;&#20102;&#36830;&#25509;&#38382;&#39064;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#20272;&#35745;&#22120;TSJI&#12290;TSJI&#20855;&#26377;&#29992;&#25143;&#23450;&#20041;&#30340;&#21442;&#25968;&#955;&#12290;&#36890;&#36807;&#23558;TSJI&#20559;&#24046;&#36817;&#20284;&#21040;op&#65288;1/N&#65289;&#30340;&#26041;&#24335;&#65292;&#25105;&#25214;&#21040;&#20102;&#19968;&#20010;&#20135;&#29983;&#36817;&#20284;&#26080;&#20559;TSJI&#30340;&#955;&#20540;&#12290;&#36873;&#25321;&#20102;&#20855;&#26377;&#25152;&#36873;&#955;&#20540;&#30340;TSJI&#19981;&#20165;&#20855;&#26377;&#22312;&#31532;&#19968;&#38454;&#27573;&#21644;&#31532;&#20108;&#38454;&#27573;&#22238;&#24402;&#22120;&#25968;&#37327;&#22266;&#23450;&#26102;&#19982;TSLS&#30456;&#21516;&#30340;&#19968;&#38454;&#20998;&#24067;&#65292;&#32780;&#19988;&#22312;&#35768;&#22810;&#24037;&#20855;&#21464;&#37327;&#28176;&#36827;&#24773;&#20917;&#19979;&#26159;&#19968;&#33268;&#19988;&#28176;&#36827;&#27491;&#24120;&#30340;&#12290;&#22312;&#19977;&#31181;&#19981;&#21516;&#30340;&#27169;&#25311;&#35774;&#32622;&#19979;&#65292;&#25105;&#20351;&#29992;&#19981;&#21516;&#21147;&#24230;&#30340;&#24037;&#20855;&#27979;&#35797;&#20102;TSJI&#19982;TSLS&#21644;JIVE&#12290;
&lt;/p&gt;
&lt;p&gt;
Economists often implement TSLS to handle endogeneity. The bias of TSLS is severe when the number of instruments is large. Hence, JIVE has been proposed to reduce bias of over-identified TSLS. However, both methods have critical drawbacks. While over-identified TSLS has a large bias with a large degree of overidentification, JIVE is unstable. In this paper, I bridge the optimization problems of TSLS and JIVE, solve the connected problem and propose a new estimator TSJI. TSJI has a user-defined parameter $\lambda$. By approximating the bias of the TSJI up to op(1/N), I find a $\lambda$ value that produces approximately unbiased TSJI. TSJI with the selected $\lambda$ value not only has the same first order distribution as TSLS when the number of first-stage and second-stage regressors are fixed, but also is consistent and asymptotically normal under many-instrument asymptotics. Under three different simulation settings, I test TSJI against TSLS and JIVE with instruments of different stre
&lt;/p&gt;</description></item></channel></rss>