<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#26412;&#30740;&#31350;&#20998;&#26512;&#20102;&#21516;&#36136;&#24615;&#23545;&#30123;&#24773;&#20256;&#25773;&#30340;&#24433;&#21709;&#65292;&#21457;&#29616;&#21516;&#36136;&#24615;&#23545;&#24863;&#26579;&#29575;&#21644;&#29190;&#21457;&#26399;&#38388;&#24863;&#26579;&#20154;&#25968;&#21576;&#29616;&#19981;&#21516;&#26354;&#32447;&#24418;&#29366;&#30340;&#24433;&#21709;&#65292;&#24182;&#19988;&#32467;&#26524;&#21463;&#21040;&#25509;&#31181;&#29575;&#12289;&#25509;&#31181;&#21160;&#26426;&#31561;&#22240;&#32032;&#30340;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2304.11934</link><description>&lt;p&gt;
&#21516;&#36136;&#24615;&#21644;&#24863;&#26579;&#65306;&#38745;&#24577;&#21644;&#21160;&#24577;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
Homophily and infections: static and dynamic effects. (arXiv:2304.11934v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.11934
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#20998;&#26512;&#20102;&#21516;&#36136;&#24615;&#23545;&#30123;&#24773;&#20256;&#25773;&#30340;&#24433;&#21709;&#65292;&#21457;&#29616;&#21516;&#36136;&#24615;&#23545;&#24863;&#26579;&#29575;&#21644;&#29190;&#21457;&#26399;&#38388;&#24863;&#26579;&#20154;&#25968;&#21576;&#29616;&#19981;&#21516;&#26354;&#32447;&#24418;&#29366;&#30340;&#24433;&#21709;&#65292;&#24182;&#19988;&#32467;&#26524;&#21463;&#21040;&#25509;&#31181;&#29575;&#12289;&#25509;&#31181;&#21160;&#26426;&#31561;&#22240;&#32032;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#20998;&#26512;&#20102;&#21516;&#36136;&#24615;&#22312;&#20004;&#32452;&#20195;&#29702;&#20043;&#38388;&#30340;&#30123;&#24773;&#27969;&#34892;&#20013;&#30340;&#24433;&#21709;&#65292;&#36825;&#20004;&#32452;&#20195;&#29702;&#22312;&#30123;&#33495;&#25509;&#31181;&#29575;&#65288;&#25509;&#31181;&#32773;&#21644;&#21453;&#30123;&#33495;&#32773;&#65289;&#19978;&#26377;&#25152;&#19981;&#21516;&#12290;&#22312;&#21516;&#36136;&#24615;&#26041;&#38754;&#65292;&#31283;&#24577;&#24863;&#26579;&#29575;&#21576;&#29616;&#39548;&#23792;&#24418;&#29366;&#65292;&#32780;&#22312;&#29190;&#21457;&#26399;&#38388;&#24863;&#26579;&#30340;&#20195;&#29702;&#20154;&#25968;&#21017;&#21576;&#29616;U&#24418;&#12290;&#22914;&#26524;&#25509;&#31181;&#29575;&#26159;&#20869;&#29983;&#30340;&#65292;&#21017;&#21516;&#36136;&#24615;&#23545;&#20004;&#32452;&#30340;&#24433;&#21709;&#30456;&#21453;&#65292;&#20294;&#26159;&#24635;&#20307;&#30340;&#23450;&#24615;&#34892;&#20026;&#19981;&#20250;&#21457;&#29983;&#25913;&#21464;&#12290;&#28982;&#32780;&#65292;&#22914;&#26524;&#25509;&#31181;&#26159;&#30001;&#24863;&#26579;&#39118;&#38505;&#25110;&#21516;&#20276;&#21387;&#21147;&#39537;&#21160;&#30340;&#65292;&#21017;&#32676;&#20307;&#23618;&#38754;&#30340;&#24433;&#21709;&#27491;&#30456;&#21453;&#12290;&#22914;&#26524;&#21160;&#26426;&#26159;&#29305;&#23450;&#20110;&#32676;&#20307;&#30340;&#65292;&#21017;&#21516;&#36136;&#24615;&#23545;&#20004;&#32452;&#37117;&#21487;&#33021;&#26377;&#23475;&#12290;
&lt;/p&gt;
&lt;p&gt;
We analyze the effect of homophily in an epidemics between two groups of agents that differ in vaccination (rates vaxxers and anti--vaxxers). The steady state infection rate is hump-shaped in homophily, whereas the cumulative number of agents infected during an outbreak is u-shaped. If vaccination rates are endogenous, homophily has the opposite impact on the two groups, but the qualitative behavior of the aggregate is unchanged. However, the sign of the group-level impact is the opposite if vaccination is motivated by infection risk or by peer pressure. If motivations are group-specific, homophily can be harmful for both groups.
&lt;/p&gt;</description></item></channel></rss>