<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#40065;&#26834;&#30340;&#31532;&#19977;&#24230;&#20215;&#26684;&#27495;&#35270;&#27169;&#22411;&#65292;&#22312;&#20080;&#26041;&#20272;&#20540;&#26410;&#30693;&#30340;&#24773;&#20917;&#19979;&#65292;&#36890;&#36807;&#21521;&#21334;&#26041;&#36879;&#38706;&#20449;&#24687;&#26469;&#26368;&#22823;&#21270;&#20080;&#26041;&#21097;&#20313;&#65292;&#24182;&#24471;&#21040;&#20102;&#20851;&#20110;&#36951;&#25022;&#24230;&#30340;&#30028;&#38480;&#12290;</title><link>http://arxiv.org/abs/2401.16942</link><description>&lt;p&gt;
&#40065;&#26834;&#30340;&#20215;&#26684;&#27495;&#35270;
&lt;/p&gt;
&lt;p&gt;
Robust Price Discrimination. (arXiv:2401.16942v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.16942
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#40065;&#26834;&#30340;&#31532;&#19977;&#24230;&#20215;&#26684;&#27495;&#35270;&#27169;&#22411;&#65292;&#22312;&#20080;&#26041;&#20272;&#20540;&#26410;&#30693;&#30340;&#24773;&#20917;&#19979;&#65292;&#36890;&#36807;&#21521;&#21334;&#26041;&#36879;&#38706;&#20449;&#24687;&#26469;&#26368;&#22823;&#21270;&#20080;&#26041;&#21097;&#20313;&#65292;&#24182;&#24471;&#21040;&#20102;&#20851;&#20110;&#36951;&#25022;&#24230;&#30340;&#30028;&#38480;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#32771;&#34385;&#20102;&#19968;&#20010;&#31532;&#19977;&#24230;&#20215;&#26684;&#27495;&#35270;&#30340;&#27169;&#22411;&#65292;&#20854;&#20013;&#21334;&#26041;&#23545;&#20135;&#21697;&#30340;&#20272;&#20540;&#26410;&#30693;&#20110;&#24066;&#22330;&#35774;&#35745;&#32773;&#65292;&#21518;&#32773;&#36890;&#36807;&#21521;&#21334;&#26041;&#36879;&#38706;&#20080;&#26041;&#20272;&#20540;&#30340;&#20449;&#24687;&#26469;&#26368;&#22823;&#21270;&#20080;&#26041;&#21097;&#20313;&#12290;&#25105;&#20204;&#30340;&#20027;&#35201;&#32467;&#26524;&#34920;&#26126;&#65292;&#36951;&#25022;&#24230;&#38480;&#21046;&#20026;$U^*(0)/e$&#65292;&#20854;&#20013; $U^*(0)$&#26159;&#22312;&#21334;&#26041;&#23545;&#20135;&#21697;&#27809;&#26377;&#20272;&#20540;&#30340;&#24773;&#20917;&#19979;&#30340;&#26368;&#20248;&#20080;&#26041;&#21097;&#20313;&#12290;&#35813;&#38480;&#21046;&#36890;&#36807;&#38543;&#26426;&#25277;&#21462;&#21334;&#26041;&#20272;&#20540;&#24182;&#24212;&#29992;Bergemann&#31561;&#20154;&#65288;2015&#65289;&#23545;&#20110;&#25277;&#21462;&#20272;&#20540;&#30340;&#20998;&#21106;&#26041;&#27861;&#24471;&#21040;&#12290;&#25105;&#20204;&#36824;&#35777;&#26126;&#20102;&#22312;&#20108;&#20998;&#31867;&#20080;&#26041;&#20272;&#20540;&#30340;&#24773;&#20917;&#19979;&#65292;$U^*(0)/e$&#38480;&#21046;&#26159;&#32039;&#23494;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
We consider a model of third-degree price discrimination, in which the seller has a valuation for the product which is unknown to the market designer, who aims to maximize the buyers' surplus by revealing information regarding the buyer's valuation to the seller. Our main result shows that the regret is bounded by $U^*(0)/e$, where $U^*(0)$ is the optimal buyer surplus in the case where the seller has zero valuation for the product. This bound is attained by randomly drawing a seller valuation and applying the segmentation of Bergemann et al. (2015) with respect to the drawn valuation. We show that the $U^*(0)/e$ bound is tight in the case of binary buyer valuation.
&lt;/p&gt;</description></item><item><title>&#30740;&#31350;&#21457;&#29616;&#29983;&#25104;&#24335; AI &#24037;&#20855; ChatGPT &#21487;&#20197;&#26356;&#26377;&#25928;&#22320;&#23637;&#31034;&#32929;&#31080;&#24066;&#22330;&#30456;&#20851;&#20449;&#24687;&#65292;&#25552;&#20986;&#20102;&#20449;&#24687;&#33192;&#32960;&#25351;&#26631;&#24182;&#35777;&#26126;&#20854;&#19982;&#36127;&#38754;&#30340;&#36164;&#26412;&#24066;&#22330;&#21518;&#26524;&#30456;&#20851;&#65292;&#21516;&#26102;&#23637;&#31034;&#20854;&#22312;&#26500;&#24314;&#38024;&#23545;&#24615;&#24635;&#32467;&#26041;&#38754;&#30340;&#25928;&#26524;&#12290;</title><link>http://arxiv.org/abs/2306.10224</link><description>&lt;p&gt;
&#33192;&#32960;&#30340;&#25259;&#38706;&#65306;ChatGPT&#26159;&#21542;&#33021;&#24110;&#21161;&#25237;&#36164;&#32773;&#22788;&#29702;&#36130;&#21153;&#20449;&#24687;&#65311;
&lt;/p&gt;
&lt;p&gt;
Bloated Disclosures: Can ChatGPT Help Investors Process Financial Information?. (arXiv:2306.10224v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.10224
&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#21457;&#29616;&#29983;&#25104;&#24335; AI &#24037;&#20855; ChatGPT &#21487;&#20197;&#26356;&#26377;&#25928;&#22320;&#23637;&#31034;&#32929;&#31080;&#24066;&#22330;&#30456;&#20851;&#20449;&#24687;&#65292;&#25552;&#20986;&#20102;&#20449;&#24687;&#33192;&#32960;&#25351;&#26631;&#24182;&#35777;&#26126;&#20854;&#19982;&#36127;&#38754;&#30340;&#36164;&#26412;&#24066;&#22330;&#21518;&#26524;&#30456;&#20851;&#65292;&#21516;&#26102;&#23637;&#31034;&#20854;&#22312;&#26500;&#24314;&#38024;&#23545;&#24615;&#24635;&#32467;&#26041;&#38754;&#30340;&#25928;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#29983;&#25104;&#24335; AI &#24037;&#20855;&#65288;&#22914; ChatGPT&#65289;&#21487;&#20197;&#20174;&#26681;&#26412;&#19978;&#25913;&#21464;&#25237;&#36164;&#32773;&#22788;&#29702;&#20449;&#24687;&#30340;&#26041;&#24335;&#12290;&#25105;&#20204;&#20351;&#29992;&#32929;&#31080;&#24066;&#22330;&#20316;&#20026;&#23454;&#39564;&#23460;&#65292;&#25506;&#31350;&#36825;&#20123;&#24037;&#20855;&#22312;&#24635;&#32467;&#22797;&#26434;&#30340;&#20844;&#21496;&#25259;&#38706;&#20449;&#24687;&#26102;&#30340;&#32463;&#27982;&#25928;&#29992;&#12290;&#24635;&#32467;&#25688;&#35201;&#26126;&#26174;&#26356;&#30701;&#65292;&#36890;&#24120;&#27604;&#21407;&#22987;&#25991;&#26412;&#32553;&#30701;&#36229;&#36807; 70%&#65292;&#32780;&#20449;&#24687;&#20869;&#23481;&#24471;&#21040;&#22686;&#24378;&#12290;&#24403;&#19968;&#20221;&#25991;&#20214;&#20855;&#26377;&#31215;&#26497;&#65288;&#28040;&#26497;&#65289;&#24773;&#24863;&#26102;&#65292;&#20854;&#24635;&#32467;&#21464;&#24471;&#26356;&#31215;&#26497;&#65288;&#28040;&#26497;&#65289;&#12290;&#26356;&#37325;&#35201;&#30340;&#26159;&#65292;&#24635;&#32467;&#23545;&#35299;&#37322;&#32929;&#24066;&#23545;&#25259;&#38706;&#20449;&#24687;&#30340;&#21453;&#24212;&#26356;&#26377;&#25928;&#12290;&#22522;&#20110;&#36825;&#20123;&#21457;&#29616;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#20449;&#24687;&#8220;&#33192;&#32960;&#8221;&#25351;&#26631;&#12290;&#25105;&#20204;&#26174;&#31034;&#65292;&#33192;&#32960;&#30340;&#25259;&#38706;&#19982;&#36127;&#38754;&#30340;&#36164;&#26412;&#24066;&#22330;&#21518;&#26524;&#30456;&#20851;&#65292;&#20363;&#22914;&#26356;&#20302;&#30340;&#20215;&#26684;&#26377;&#25928;&#24615;&#21644;&#26356;&#39640;&#30340;&#20449;&#24687;&#19981;&#23545;&#31216;&#24615;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#36825;&#20010;&#27169;&#22411;&#22312;&#26500;&#24314;&#38024;&#23545;&#24615;&#24635;&#32467;&#26041;&#38754;&#30340;&#26377;&#25928;&#24615;&#65292;&#20197;&#30830;&#23450;&#20844;&#21496;&#30340;&#65288;&#38750;&#65289;&#36130;&#21153;&#34920;&#29616;&#21644;&#39118;&#38505;&#12290;&#24635;&#20043;&#65292;&#25105;&#20204;&#30340;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;&#20687; ChatGPT &#36825;&#26679;&#30340;&#29983;&#25104;&#24335; AI &#24037;&#20855;&#21487;&#20197;&#26377;&#25928;&#22320;&#24110;&#21161;&#25237;&#36164;&#32773;&#26356;&#39640;&#25928;&#22320;&#22788;&#29702;&#36130;&#21153;&#20449;&#24687;&#12290;
&lt;/p&gt;
&lt;p&gt;
Generative AI tools such as ChatGPT can fundamentally change the way investors process information. We probe the economic usefulness of these tools in summarizing complex corporate disclosures using the stock market as a laboratory. The unconstrained summaries are dramatically shorter, often by more than 70% compared to the originals, whereas their information content is amplified. When a document has a positive (negative) sentiment, its summary becomes more positive (negative). More importantly, the summaries are more effective at explaining stock market reactions to the disclosed information. Motivated by these findings, we propose a measure of information "bloat." We show that bloated disclosure is associated with adverse capital markets consequences, such as lower price efficiency and higher information asymmetry. Finally, we show that the model is effective at constructing targeted summaries that identify firms' (non-)financial performance and risks. Collectively, our results indi
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#20351;&#29992;&#19981;&#21464;&#30697;&#26465;&#20214;&#36827;&#34892;&#22810;&#24037;&#20855;&#40065;&#26834;&#24615;&#25512;&#26029;&#21450;&#35782;&#21035;&#30340;&#26041;&#27861;&#65292;&#24182;&#30830;&#23450;&#20102;&#35768;&#22810;&#24037;&#20855;&#24207;&#21015;&#19979;&#20256;&#32479;&#27979;&#35797;&#32479;&#35745;&#37327;&#30340;&#28176;&#36827;&#27491;&#24120;&#24615;&#12290;</title><link>http://arxiv.org/abs/2303.07822</link><description>&lt;p&gt;
&#36890;&#36807;&#19981;&#21464;&#30697;&#26465;&#20214;&#36827;&#34892;&#22810;&#24037;&#20855;&#40065;&#26834;&#24615;&#25512;&#26029;&#21450;&#35782;&#21035;
&lt;/p&gt;
&lt;p&gt;
Identification- and many instrument-robust inference via invariant moment conditions. (arXiv:2303.07822v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.07822
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#20351;&#29992;&#19981;&#21464;&#30697;&#26465;&#20214;&#36827;&#34892;&#22810;&#24037;&#20855;&#40065;&#26834;&#24615;&#25512;&#26029;&#21450;&#35782;&#21035;&#30340;&#26041;&#27861;&#65292;&#24182;&#30830;&#23450;&#20102;&#35768;&#22810;&#24037;&#20855;&#24207;&#21015;&#19979;&#20256;&#32479;&#27979;&#35797;&#32479;&#35745;&#37327;&#30340;&#28176;&#36827;&#27491;&#24120;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35782;&#21035;&#40065;&#26834;&#24615;&#20551;&#35774;&#26816;&#39564;&#36890;&#24120;&#22522;&#20110;&#36830;&#32493;&#26356;&#26032;&#30446;&#26631;&#20989;&#25968;&#25110;&#20854;&#20998;&#25968;&#12290;&#24403;&#30697;&#26465;&#20214;&#30340;&#25968;&#37327;&#19982;&#26679;&#26412;&#37327;&#25104;&#27604;&#20363;&#22686;&#38271;&#26102;&#65292;&#22823;&#32500;&#30340;&#21152;&#26435;&#30697;&#38453;&#38459;&#27490;&#20102;&#20351;&#29992;&#20256;&#32479;&#30340;&#28176;&#36817;&#36924;&#36817;&#26041;&#27861;&#65292;&#36825;&#20123;&#27979;&#35797;&#30340;&#34892;&#20026;&#20173;&#28982;&#26410;&#30693;&#12290;&#25105;&#20204;&#34920;&#26126;&#65292;&#24403;&#22312;&#38646;&#20551;&#35774;&#19979;&#65292;&#30697;&#26465;&#20214;&#30340;&#20998;&#24067;&#26159;&#21453;&#23556;&#19981;&#21464;&#30340;&#26102;&#65292;&#21152;&#26435;&#30697;&#38453;&#30340;&#32467;&#26500;&#24320;&#36767;&#20102;&#21478;&#19968;&#26465;&#28176;&#36817;&#32467;&#26524;&#30340;&#36335;&#32447;&#12290;&#22312;&#24322;&#26041;&#24046;&#32447;&#24615;&#24037;&#20855;&#21464;&#37327;&#27169;&#22411;&#20013;&#65292;&#25105;&#20204;&#30830;&#23450;&#20102;&#35768;&#22810;&#24037;&#20855;&#24207;&#21015;&#19979;&#20256;&#32479;&#27979;&#35797;&#32479;&#35745;&#37327;&#30340;&#28176;&#36827;&#27491;&#24120;&#24615;&#12290;&#19968;&#20010;&#20851;&#38190;&#32467;&#26524;&#26159;&#26041;&#24046;&#20013;&#20986;&#29616;&#30340;&#38468;&#21152;&#39033;&#20026;&#36127;&#12290;&#37325;&#26032;&#23457;&#35270;&#20102;&#20851;&#20110;&#31227;&#27665;&#21644;&#26412;&#22320;&#24037;&#20154;&#20043;&#38388;&#26367;&#20195;&#24377;&#24615;&#30340;&#19968;&#39033;&#30740;&#31350;&#65292;&#24037;&#20855;&#30340;&#25968;&#37327;&#36229;&#36807;&#20102;&#26679;&#26412;&#22823;&#23567;&#30340;&#22235;&#20998;&#20043;&#19968;&#65292;&#35768;&#22810;&#24037;&#20855;&#40065;&#26834;&#30340;&#36817;&#20284;&#20540;&#12290;
&lt;/p&gt;
&lt;p&gt;
Identification-robust hypothesis tests are commonly based on the continuous updating objective function or its score. When the number of moment conditions grows proportionally with the sample size, the large-dimensional weighting matrix prohibits the use of conventional asymptotic approximations and the behavior of these tests remains unknown. We show that the structure of the weighting matrix opens up an alternative route to asymptotic results when, under the null hypothesis, the distribution of the moment conditions is reflection invariant. In a heteroskedastic linear instrumental variables model, we then establish asymptotic normality of conventional tests statistics under many instrument sequences. A key result is that the additional terms that appear in the variance are negative. Revisiting a study on the elasticity of substitution between immigrant and native workers where the number of instruments is over a quarter of the sample size, the many instrument-robust approximation ind
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#33756;&#21333;&#25551;&#36848;&#22312;&#23637;&#31034;&#26426;&#21046;&#31574;&#30053;&#26080;&#25032;&#21487;&#20987;&#24615;&#26041;&#38754;&#30340;&#20316;&#29992;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#31616;&#21333;&#33756;&#21333;&#25551;&#36848;&#30340;&#24310;&#36831;&#25509;&#21463;&#26426;&#21046;&#65292;&#24182;&#36890;&#36807;&#23454;&#39564;&#39564;&#35777;&#20102;&#33756;&#21333;&#25551;&#36848;&#30340;&#20248;&#21183;&#21644;&#25361;&#25112;&#12290;</title><link>http://arxiv.org/abs/2209.13148</link><description>&lt;p&gt;
&#20855;&#26377;&#31574;&#30053;&#26080;&#25032;&#21487;&#20987;&#24615;&#30340;&#26292;&#38706;&#26426;&#21046;&#25551;&#36848;
&lt;/p&gt;
&lt;p&gt;
Strategyproofness-Exposing Mechanism Descriptions. (arXiv:2209.13148v2 [econ.TH] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2209.13148
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#33756;&#21333;&#25551;&#36848;&#22312;&#23637;&#31034;&#26426;&#21046;&#31574;&#30053;&#26080;&#25032;&#21487;&#20987;&#24615;&#26041;&#38754;&#30340;&#20316;&#29992;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#31616;&#21333;&#33756;&#21333;&#25551;&#36848;&#30340;&#24310;&#36831;&#25509;&#21463;&#26426;&#21046;&#65292;&#24182;&#36890;&#36807;&#23454;&#39564;&#39564;&#35777;&#20102;&#33756;&#21333;&#25551;&#36848;&#30340;&#20248;&#21183;&#21644;&#25361;&#25112;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#33756;&#21333;&#25551;&#36848;&#20197;&#20004;&#20010;&#27493;&#39588;&#21521;&#29609;&#23478;i&#23637;&#31034;&#26426;&#21046;&#12290;&#31532;&#19968;&#27493;&#20351;&#29992;&#20854;&#20182;&#29609;&#23478;&#30340;&#25253;&#21578;&#25551;&#36848;i&#30340;&#33756;&#21333;&#65306;&#21363;i&#30340;&#28508;&#22312;&#32467;&#26524;&#38598;&#21512;&#12290;&#31532;&#20108;&#27493;&#20351;&#29992;i&#30340;&#25253;&#21578;&#20174;&#22905;&#30340;&#33756;&#21333;&#20013;&#36873;&#25321;i&#26368;&#21916;&#27426;&#30340;&#32467;&#26524;&#12290;&#33756;&#21333;&#25551;&#36848;&#33021;&#26356;&#22909;&#22320;&#26292;&#38706;&#31574;&#30053;&#26080;&#25032;&#21487;&#20987;&#24615;&#21527;&#65292;&#32780;&#19981;&#20250;&#29306;&#29298;&#31616;&#21333;&#24615;&#65311;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#26032;&#30340;&#31616;&#21333;&#33756;&#21333;&#25551;&#36848;&#30340;&#24310;&#36831;&#25509;&#21463;&#26426;&#21046;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#65292;&#19982;&#20854;&#20182;&#24120;&#35265;&#30340;&#21305;&#37197;&#26426;&#21046;&#30456;&#27604;&#65292;&#36825;&#31181;&#33756;&#21333;&#25551;&#36848;&#24517;&#39035;&#19982;&#30456;&#24212;&#30340;&#20256;&#32479;&#25551;&#36848;&#26377;&#30528;&#23454;&#36136;&#24615;&#30340;&#19981;&#21516;&#12290;&#25105;&#20204;&#36890;&#36807;&#23545;&#20004;&#31181;&#22522;&#26412;&#26426;&#21046;&#30340;&#23454;&#39564;&#23460;&#23454;&#39564;&#35777;&#26126;&#20102;&#33756;&#21333;&#25551;&#36848;&#30340;&#20248;&#21183;&#21644;&#25361;&#25112;&#12290;
&lt;/p&gt;
&lt;p&gt;
A menu description presents a mechanism to player $i$ in two steps. Step (1) uses the reports of other players to describe $i$'s menu: the set of $i$'s potential outcomes. Step (2) uses $i$'s report to select $i$'s favorite outcome from her menu. Can menu descriptions better expose strategyproofness, without sacrificing simplicity? We propose a new, simple menu description of Deferred Acceptance. We prove that -- in contrast with other common matching mechanisms -- this menu description must differ substantially from the corresponding traditional description. We demonstrate, with a lab experiment on two elementary mechanisms, the promise and challenges of menu descriptions.
&lt;/p&gt;</description></item></channel></rss>