<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#36825;&#39033;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#20989;&#25968;&#21487;&#24494;&#26041;&#27861;&#26469;&#35299;&#20915;&#32479;&#35745;&#26368;&#20248;&#20998;&#37197;&#38382;&#39064;&#65292;&#36890;&#36807;&#23545;&#25490;&#24207;&#36816;&#31639;&#31526;&#30340;&#19968;&#33324;&#23646;&#24615;&#36827;&#34892;&#35814;&#32454;&#20998;&#26512;&#65292;&#25512;&#23548;&#20986;&#20540;&#20989;&#25968;&#30340;Hadamard&#21487;&#24494;&#24615;&#65292;&#24182;&#23637;&#31034;&#20102;&#22914;&#20309;&#21033;&#29992;&#20989;&#25968;&#20559;&#24494;&#20998;&#27861;&#30452;&#25509;&#25512;&#23548;&#20986;&#20540;&#20989;&#25968;&#36807;&#31243;&#30340;&#28176;&#36817;&#24615;&#36136;&#12290;</title><link>https://arxiv.org/abs/2403.18248</link><description>&lt;p&gt;
&#32479;&#35745;&#25512;&#26029;&#20013;&#30340;&#26368;&#20248;&#20998;&#37197;I&#65306;&#35268;&#24459;&#24615;&#21450;&#20854;&#24433;&#21709;
&lt;/p&gt;
&lt;p&gt;
Statistical Inference of Optimal Allocations I: Regularities and their Implications
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.18248
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#20989;&#25968;&#21487;&#24494;&#26041;&#27861;&#26469;&#35299;&#20915;&#32479;&#35745;&#26368;&#20248;&#20998;&#37197;&#38382;&#39064;&#65292;&#36890;&#36807;&#23545;&#25490;&#24207;&#36816;&#31639;&#31526;&#30340;&#19968;&#33324;&#23646;&#24615;&#36827;&#34892;&#35814;&#32454;&#20998;&#26512;&#65292;&#25512;&#23548;&#20986;&#20540;&#20989;&#25968;&#30340;Hadamard&#21487;&#24494;&#24615;&#65292;&#24182;&#23637;&#31034;&#20102;&#22914;&#20309;&#21033;&#29992;&#20989;&#25968;&#20559;&#24494;&#20998;&#27861;&#30452;&#25509;&#25512;&#23548;&#20986;&#20540;&#20989;&#25968;&#36807;&#31243;&#30340;&#28176;&#36817;&#24615;&#36136;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#36825;&#31687;&#35770;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#20110;&#35299;&#20915;&#32479;&#35745;&#26368;&#20248;&#20998;&#37197;&#38382;&#39064;&#30340;&#20989;&#25968;&#21487;&#24494;&#26041;&#27861;&#12290;&#36890;&#36807;&#23545;&#25490;&#24207;&#36816;&#31639;&#31526;&#30340;&#19968;&#33324;&#23646;&#24615;&#36827;&#34892;&#35814;&#32454;&#20998;&#26512;&#65292;&#25105;&#20204;&#39318;&#20808;&#25512;&#23548;&#20986;&#20102;&#20540;&#20989;&#25968;&#30340;Hadamard&#21487;&#24494;&#24615;&#12290;&#22312;&#25105;&#20204;&#30340;&#26694;&#26550;&#20013;&#65292;Hausdorff&#27979;&#24230;&#30340;&#27010;&#24565;&#20197;&#21450;&#20960;&#20309;&#27979;&#24230;&#35770;&#20013;&#30340;&#38754;&#31215;&#21644;&#20849;&#38754;&#31215;&#31215;&#20998;&#20844;&#24335;&#26159;&#26680;&#24515;&#12290;&#22522;&#20110;&#25105;&#20204;&#30340;Hadamard&#21487;&#24494;&#24615;&#32467;&#26524;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#22914;&#20309;&#21033;&#29992;&#20989;&#25968;&#20559;&#24494;&#20998;&#27861;&#30452;&#25509;&#25512;&#23548;&#20986;&#20108;&#20803;&#32422;&#26463;&#26368;&#20248;&#20998;&#37197;&#38382;&#39064;&#30340;&#20540;&#20989;&#25968;&#36807;&#31243;&#20197;&#21450;&#20004;&#27493;ROC&#26354;&#32447;&#20272;&#35745;&#37327;&#30340;&#28176;&#36817;&#24615;&#36136;&#12290;&#27492;&#22806;&#65292;&#21033;&#29992;&#23545;&#20984;&#21644;&#23616;&#37096;Lipschitz&#27867;&#20989;&#30340;&#28145;&#21051;&#35265;&#35299;&#65292;&#25105;&#20204;&#24471;&#21040;&#20102;&#26368;&#20248;&#20998;&#37197;&#38382;&#39064;&#30340;&#20540;&#20989;&#25968;&#30340;&#39069;&#22806;&#19968;&#33324;Frechet&#21487;&#24494;&#24615;&#32467;&#26524;&#12290;&#36825;&#20123;&#24341;&#20154;&#20837;&#32988;&#30340;&#21457;&#29616;&#28608;&#21169;&#20102;&#25105;&#20204;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.18248v1 Announce Type: new  Abstract: In this paper, we develp a functional differentiability approach for solving statistical optimal allocation problems. We first derive Hadamard differentiability of the value function through a detailed analysis of the general properties of the sorting operator. Central to our framework are the concept of Hausdorff measure and the area and coarea integration formulas from geometric measure theory. Building on our Hadamard differentiability results, we demonstrate how the functional delta method can be used to directly derive the asymptotic properties of the value function process for binary constrained optimal allocation problems, as well as the two-step ROC curve estimator. Moreover, leveraging profound insights from geometric functional analysis on convex and local Lipschitz functionals, we obtain additional generic Fr\'echet differentiability results for the value functions of optimal allocation problems. These compelling findings moti
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#22522;&#20110;&#24066;&#22330;&#30340;&#32929;&#31080;&#22238;&#25253;&#27010;&#29575;&#65292;&#21457;&#29616;&#24066;&#22330;&#25317;&#26377;&#32929;&#31080;&#22238;&#25253;&#30340;&#25152;&#26377;&#20449;&#24687;&#65292;&#24182;&#25506;&#35752;&#20102;&#22238;&#25253;&#30340;&#32479;&#35745;&#23398;&#29305;&#24449;&#19982;&#24403;&#21069;&#21644;&#36807;&#21435;&#20132;&#26131;&#20540;&#30340;&#32479;&#35745;&#23398;&#29305;&#24449;&#21644;&#30456;&#20851;&#24615;&#20043;&#38388;&#30340;&#20851;&#31995;&#12290;</title><link>https://arxiv.org/abs/2302.07935</link><description>&lt;p&gt;
&#22522;&#20110;&#24066;&#22330;&#30340;&#32929;&#31080;&#22238;&#25253;&#27010;&#29575;
&lt;/p&gt;
&lt;p&gt;
Market-Based Probability of Stock Returns
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2302.07935
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#22522;&#20110;&#24066;&#22330;&#30340;&#32929;&#31080;&#22238;&#25253;&#27010;&#29575;&#65292;&#21457;&#29616;&#24066;&#22330;&#25317;&#26377;&#32929;&#31080;&#22238;&#25253;&#30340;&#25152;&#26377;&#20449;&#24687;&#65292;&#24182;&#25506;&#35752;&#20102;&#22238;&#25253;&#30340;&#32479;&#35745;&#23398;&#29305;&#24449;&#19982;&#24403;&#21069;&#21644;&#36807;&#21435;&#20132;&#26131;&#20540;&#30340;&#32479;&#35745;&#23398;&#29305;&#24449;&#21644;&#30456;&#20851;&#24615;&#20043;&#38388;&#30340;&#20851;&#31995;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24066;&#22330;&#25317;&#26377;&#20851;&#20110;&#32929;&#31080;&#22238;&#25253;&#30340;&#25152;&#26377;&#21487;&#29992;&#20449;&#24687;&#12290;&#24066;&#22330;&#20132;&#26131;&#30340;&#38543;&#26426;&#24615;&#20915;&#23450;&#20102;&#32929;&#31080;&#22238;&#25253;&#30340;&#32479;&#35745;&#23398;&#29305;&#24449;&#12290;&#26412;&#25991;&#25551;&#36848;&#20102;&#32929;&#31080;&#22238;&#25253;&#30340;&#21069;&#22235;&#20010;&#22522;&#20110;&#24066;&#22330;&#30340;&#32479;&#35745;&#23398;&#29305;&#24449;&#19982;&#24403;&#21069;&#21644;&#36807;&#21435;&#20132;&#26131;&#20540;&#30340;&#32479;&#35745;&#23398;&#29305;&#24449;&#21644;&#30456;&#20851;&#24615;&#20043;&#38388;&#30340;&#20381;&#36182;&#20851;&#31995;&#12290;&#22312;&#21152;&#26435;&#24179;&#22343;&#26399;&#38388;&#36827;&#34892;&#20132;&#26131;&#30340;&#24179;&#22343;&#22238;&#25253;&#19982;&#39532;&#31185;&#23041;&#33576;&#23545;&#25237;&#36164;&#32452;&#21512;&#20215;&#20540;&#21152;&#26435;&#22238;&#25253;&#30340;&#23450;&#20041;&#30456;&#21563;&#21512;&#12290;&#25105;&#20204;&#25512;&#23548;&#20102;&#22522;&#20110;&#24066;&#22330;&#30340;&#22238;&#25253;&#27874;&#21160;&#29575;&#21644;&#22238;&#25253;-&#20215;&#20540;&#30456;&#20851;&#24615;&#12290;&#36890;&#36807;&#26377;&#38480;&#25968;&#37327;&#30340;&#22522;&#20110;&#24066;&#22330;&#30340;&#32479;&#35745;&#23398;&#29305;&#24449;&#30340;&#29305;&#24449;&#20989;&#25968;&#21644;&#27010;&#29575;&#24230;&#37327;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#23545;&#32929;&#31080;&#22238;&#25253;&#30340;&#36817;&#20284;&#39044;&#27979;&#26041;&#27861;&#12290;&#35201;&#39044;&#27979;&#22522;&#20110;&#24066;&#22330;&#30340;&#24179;&#22343;&#22238;&#25253;&#25110;&#22238;&#25253;&#27874;&#21160;&#29575;&#65292;&#24517;&#39035;&#21516;&#26102;&#39044;&#27979;&#24403;&#21069;&#21644;&#36807;&#21435;&#24066;&#22330;&#20132;&#26131;&#20540;&#30340;&#32479;&#35745;&#23398;&#29305;&#24449;&#21644;&#30456;&#20851;&#24615;&#65292;&#20197;&#30456;&#21516;&#30340;&#26102;&#38388;&#36328;&#24230;&#12290;
&lt;/p&gt;
&lt;p&gt;
Markets possess all available information on stock returns. The randomness of market trade determines the statistics of stock returns. This paper describes the dependence of the first four market-based statistical moments of stock returns on statistical moments and correlations of current and past trade values. The mean return of trades during the averaging period coincides with Markowitz's definition of portfolio value weighted return. We derive the market-based volatility of return and return-value correlations. We present approximations of the characteristic functions and probability measures of stock return by a finite number of market-based statistical moments. To forecast market-based average return or volatility of return, one should predict the statistical moments and correlations of current and past market trade values at the same time horizon.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#20351;&#29992;&#36923;&#36753;&#30340;&#35777;&#26126;&#28436;&#31639;&#25552;&#20986;&#20102;&#23545;&#19981;&#21487;&#33021;&#24615;&#23450;&#29702;&#30340;&#35777;&#26126;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#20445;&#35777;&#20102;&#23545;&#25152;&#26377;&#21487;&#33021;&#31038;&#20250;&#31119;&#21033;&#20989;&#25968;&#30340;&#25152;&#26377;&#37197;&#32622;&#36827;&#34892;&#20102;&#26816;&#39564;&#65292;&#20174;&#32780;&#35777;&#26126;&#20102;&#35813;&#23450;&#29702;&#12290;</title><link>http://arxiv.org/abs/2309.06753</link><description>&lt;p&gt;
&#37325;&#26032;&#23457;&#35270;&#19981;&#21487;&#33021;&#24615;&#23450;&#29702;&#30340;&#35777;&#26126;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
A Reexamination of Proof Approaches for the Impossibility Theorem. (arXiv:2309.06753v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.06753
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#20351;&#29992;&#36923;&#36753;&#30340;&#35777;&#26126;&#28436;&#31639;&#25552;&#20986;&#20102;&#23545;&#19981;&#21487;&#33021;&#24615;&#23450;&#29702;&#30340;&#35777;&#26126;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#20445;&#35777;&#20102;&#23545;&#25152;&#26377;&#21487;&#33021;&#31038;&#20250;&#31119;&#21033;&#20989;&#25968;&#30340;&#25152;&#26377;&#37197;&#32622;&#36827;&#34892;&#20102;&#26816;&#39564;&#65292;&#20174;&#32780;&#35777;&#26126;&#20102;&#35813;&#23450;&#29702;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20915;&#23450;&#24615;&#38598;&#21512;&#21644;&#20851;&#38190;&#36873;&#27665;&#26041;&#27861;&#24050;&#34987;&#29992;&#20110;&#35777;&#26126;&#38463;&#32599;&#19981;&#21487;&#33021;&#24615;&#23450;&#29702;&#12290;&#36825;&#20123;&#26041;&#27861;&#30340;&#35777;&#26126;&#20165;&#32771;&#34385;&#20102;&#25152;&#26377;&#21487;&#33021;&#31038;&#20250;&#31119;&#21033;&#20989;&#25968;&#30340;&#23376;&#38598;&#65292;&#24182;&#23457;&#26597;&#20102;&#36825;&#20123;&#20989;&#25968;&#22495;&#30340;&#37096;&#20998;&#12290;&#22240;&#27492;&#65292;&#36825;&#20004;&#20010;&#24605;&#36335;&#37117;&#19981;&#33021;&#26377;&#25928;&#35777;&#26126;&#35813;&#23450;&#29702;&#12290;&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#36923;&#36753;&#30340;&#35777;&#26126;&#28436;&#31639;&#12290;&#22312;&#21069;&#25552;&#12289;&#20844;&#29702;&#21644;&#23450;&#29702;&#30340;&#26465;&#20214;&#20043;&#38388;&#36827;&#34892;&#26377;&#25928;&#30340;&#28436;&#32462;&#25512;&#29702;&#65292;&#24182;&#24471;&#20986;&#29420;&#35009;&#30340;&#32467;&#35770;&#65292;&#20445;&#35777;&#20102;&#23545;&#25152;&#26377;&#21487;&#33021;&#31038;&#20250;&#31119;&#21033;&#20989;&#25968;&#30340;&#25152;&#26377;&#37197;&#32622;&#36827;&#34892;&#20102;&#26816;&#39564;&#65292;&#20174;&#32780;&#35777;&#26126;&#20102;&#35813;&#23450;&#29702;&#12290;
&lt;/p&gt;
&lt;p&gt;
The decisive-set and pivotal-voter approaches have been used for proving Arrow's impossibility theorem. Proofs by these approaches consider only subsets of all possible social welfare functions and examine parts of the domain of these functions. Hence, both ideas are not effective to prove the theorem. This study presents a proof using a proof calculus in logic. A valid deductive inference between the premises, the axioms and conditions of the theorem, and the conclusion, dictatorship, guarantees that every profile of all possible social welfare functions is examined, thereby the theorem is established.
&lt;/p&gt;</description></item></channel></rss>