<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;CLIPPINGS&#30340;&#22810;&#27169;&#24577;&#26694;&#26550;&#65292;&#29992;&#20110;&#35760;&#24405;&#38142;&#25509;&#12290;&#35813;&#26694;&#26550;&#21033;&#29992;&#28145;&#24230;&#23398;&#20064;&#21644;&#23545;&#27604;&#23398;&#20064;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#31471;&#21040;&#31471;&#35757;&#32451;&#23545;&#31216;&#30340;&#35270;&#35273;&#21644;&#35821;&#35328;&#32534;&#30721;&#22120;&#65292;&#22312;&#24230;&#37327;&#31354;&#38388;&#20013;&#23398;&#20064;&#30456;&#36817;&#25110;&#19981;&#21516;&#31867;&#21035;&#30340;&#34920;&#31034;&#26041;&#27861;&#65292;&#29992;&#20110;&#22810;&#20010;&#24212;&#29992;&#22330;&#26223;&#65292;&#22914;&#26500;&#24314;&#20840;&#38754;&#30340;&#34917;&#20805;&#19987;&#21033;&#27880;&#20876;&#34920;&#21644;&#35782;&#21035;&#19981;&#21516;&#31038;&#20132;&#23186;&#20307;&#24179;&#21488;&#19978;&#30340;&#20010;&#20154;&#12290;</title><link>http://arxiv.org/abs/2304.03464</link><description>&lt;p&gt;
&#29992;&#22810;&#27169;&#24577;&#23545;&#27604;&#23398;&#20064;&#36830;&#25509;&#34920;&#31034;
&lt;/p&gt;
&lt;p&gt;
Linking Representations with Multimodal Contrastive Learning. (arXiv:2304.03464v1 [cs.CV])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.03464
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;CLIPPINGS&#30340;&#22810;&#27169;&#24577;&#26694;&#26550;&#65292;&#29992;&#20110;&#35760;&#24405;&#38142;&#25509;&#12290;&#35813;&#26694;&#26550;&#21033;&#29992;&#28145;&#24230;&#23398;&#20064;&#21644;&#23545;&#27604;&#23398;&#20064;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#31471;&#21040;&#31471;&#35757;&#32451;&#23545;&#31216;&#30340;&#35270;&#35273;&#21644;&#35821;&#35328;&#32534;&#30721;&#22120;&#65292;&#22312;&#24230;&#37327;&#31354;&#38388;&#20013;&#23398;&#20064;&#30456;&#36817;&#25110;&#19981;&#21516;&#31867;&#21035;&#30340;&#34920;&#31034;&#26041;&#27861;&#65292;&#29992;&#20110;&#22810;&#20010;&#24212;&#29992;&#22330;&#26223;&#65292;&#22914;&#26500;&#24314;&#20840;&#38754;&#30340;&#34917;&#20805;&#19987;&#21033;&#27880;&#20876;&#34920;&#21644;&#35782;&#21035;&#19981;&#21516;&#31038;&#20132;&#23186;&#20307;&#24179;&#21488;&#19978;&#30340;&#20010;&#20154;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35768;&#22810;&#24212;&#29992;&#38656;&#35201;&#23558;&#21253;&#21547;&#22312;&#21508;&#31181;&#25991;&#26723;&#25968;&#25454;&#38598;&#20013;&#30340;&#23454;&#20363;&#20998;&#32452;&#25104;&#31867;&#12290;&#26368;&#24191;&#27867;&#20351;&#29992;&#30340;&#26041;&#27861;&#19981;&#20351;&#29992;&#28145;&#24230;&#23398;&#20064;&#65292;&#20063;&#19981;&#21033;&#29992;&#25991;&#26723;&#22266;&#26377;&#30340;&#22810;&#27169;&#24577;&#24615;&#36136;&#12290;&#20540;&#24471;&#27880;&#24847;&#30340;&#26159;&#65292;&#35760;&#24405;&#38142;&#25509;&#36890;&#24120;&#34987;&#27010;&#24565;&#21270;&#20026;&#23383;&#31526;&#20018;&#21305;&#37197;&#38382;&#39064;&#12290;&#26412;&#30740;&#31350;&#24320;&#21457;&#20102; CLIPPINGS&#65292;&#19968;&#31181;&#29992;&#20110;&#35760;&#24405;&#38142;&#25509;&#30340;&#22810;&#27169;&#24577;&#26694;&#26550;&#12290;CLIPPINGS &#37319;&#29992;&#31471;&#21040;&#31471;&#35757;&#32451;&#23545;&#31216;&#30340;&#35270;&#35273;&#21644;&#35821;&#35328;&#21452;&#32534;&#30721;&#22120;&#65292;&#36890;&#36807;&#23545;&#27604;&#35821;&#35328;-&#22270;&#20687;&#39044;&#35757;&#32451;&#36827;&#34892;&#23545;&#40784;&#65292;&#23398;&#20064;&#19968;&#20010;&#24230;&#37327;&#31354;&#38388;&#65292;&#20854;&#20013;&#32473;&#23450;&#23454;&#20363;&#30340;&#27719;&#24635;&#22270;&#20687;-&#25991;&#26412;&#34920;&#31034;&#38752;&#36817;&#21516;&#19968;&#31867;&#20013;&#30340;&#34920;&#31034;&#65292;&#24182;&#36828;&#31163;&#19981;&#21516;&#31867;&#20013;&#30340;&#34920;&#31034;&#12290;&#22312;&#25512;&#29702;&#26102;&#65292;&#21487;&#20197;&#36890;&#36807;&#20174;&#31163;&#32447;&#31034;&#20363;&#23884;&#20837;&#32034;&#24341;&#20013;&#26816;&#32034;&#23427;&#20204;&#26368;&#36817;&#30340;&#37051;&#23621;&#25110;&#32858;&#31867;&#23427;&#20204;&#30340;&#34920;&#31034;&#26469;&#38142;&#25509;&#23454;&#20363;&#12290;&#26412;&#30740;&#31350;&#30740;&#31350;&#20102;&#20004;&#20010;&#20855;&#26377;&#25361;&#25112;&#24615;&#30340;&#24212;&#29992;&#65306;&#36890;&#36807;&#23558;&#19987;&#21033;&#19982;&#20854;&#23545;&#24212;&#30340;&#30417;&#31649;&#25991;&#20214;&#38142;&#25509;&#26469;&#26500;&#24314;&#20840;&#38754;&#30340;&#34917;&#20805;&#19987;&#21033;&#27880;&#20876;&#34920;&#65292;&#20197;&#21450;&#22312;&#19981;&#21516;&#30340;&#31038;&#20132;&#23186;&#20307;&#24179;&#21488;&#19978;&#35782;&#21035;&#20010;&#20154;&#12290;
&lt;/p&gt;
&lt;p&gt;
Many applications require grouping instances contained in diverse document datasets into classes. Most widely used methods do not employ deep learning and do not exploit the inherently multimodal nature of documents. Notably, record linkage is typically conceptualized as a string-matching problem. This study develops CLIPPINGS, (Contrastively Linking Pooled Pre-trained Embeddings), a multimodal framework for record linkage. CLIPPINGS employs end-to-end training of symmetric vision and language bi-encoders, aligned through contrastive language-image pre-training, to learn a metric space where the pooled image-text representation for a given instance is close to representations in the same class and distant from representations in different classes. At inference time, instances can be linked by retrieving their nearest neighbor from an offline exemplar embedding index or by clustering their representations. The study examines two challenging applications: constructing comprehensive suppl
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#38543;&#26426;&#20934;&#32447;&#24615;&#25928;&#29992;&#20989;&#25968;&#30340;&#20010;&#20307;&#31119;&#21033;&#20998;&#26512;&#26694;&#26550;&#65292;&#36890;&#36807;&#26032;&#30340;&#32622;&#20449;&#21306;&#38388;&#32422;&#26463;&#27714;&#35299;&#20219;&#24847;&#32622;&#20449;&#27700;&#24179;&#19979;&#30340;&#20010;&#20154;&#28040;&#36153;&#32773;&#31119;&#21033;&#25439;&#22833;&#19979;&#38480;&#65292;&#35813;&#27714;&#35299;&#26041;&#27861;&#31616;&#21333;&#39640;&#25928;&#65292;&#19988;&#36866;&#29992;&#33539;&#22260;&#24191;&#27867;&#65292;&#20855;&#26377;&#24456;&#24378;&#30340;&#23454;&#38469;&#24212;&#29992;&#20215;&#20540;&#12290;</title><link>http://arxiv.org/abs/2304.01921</link><description>&lt;p&gt;
&#20010;&#20307;&#31119;&#21033;&#20998;&#26512;&#65306;&#38543;&#26426;&#20934;&#32447;&#24615;&#25928;&#29992;&#12289;&#29420;&#31435;&#24615;&#21644;&#32622;&#20449;&#21306;&#38388;
&lt;/p&gt;
&lt;p&gt;
Individual Welfare Analysis: Random Quasilinear Utility, Independence, and Confidence Bounds. (arXiv:2304.01921v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.01921
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#38543;&#26426;&#20934;&#32447;&#24615;&#25928;&#29992;&#20989;&#25968;&#30340;&#20010;&#20307;&#31119;&#21033;&#20998;&#26512;&#26694;&#26550;&#65292;&#36890;&#36807;&#26032;&#30340;&#32622;&#20449;&#21306;&#38388;&#32422;&#26463;&#27714;&#35299;&#20219;&#24847;&#32622;&#20449;&#27700;&#24179;&#19979;&#30340;&#20010;&#20154;&#28040;&#36153;&#32773;&#31119;&#21033;&#25439;&#22833;&#19979;&#38480;&#65292;&#35813;&#27714;&#35299;&#26041;&#27861;&#31616;&#21333;&#39640;&#25928;&#65292;&#19988;&#36866;&#29992;&#33539;&#22260;&#24191;&#27867;&#65292;&#20855;&#26377;&#24456;&#24378;&#30340;&#23454;&#38469;&#24212;&#29992;&#20215;&#20540;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#20171;&#32461;&#20102;&#19968;&#31181;&#26032;&#30340;&#20010;&#20307;&#27700;&#24179;&#31119;&#21033;&#20998;&#26512;&#26694;&#26550;&#12290;&#23427;&#24314;&#31435;&#22312;&#19968;&#20010;&#20855;&#26377;&#20934;&#32447;&#24615;&#25928;&#29992;&#20989;&#25968;&#30340;&#36830;&#32493;&#38656;&#27714;&#21442;&#25968;&#27169;&#22411;&#19978;&#65292;&#20801;&#35768;&#23384;&#22312;&#26410;&#35266;&#27979;&#21040;&#30340;&#20010;&#20307;-&#20135;&#21697;&#27700;&#24179;&#30340;&#20559;&#22909;&#20914;&#20987;&#12290;&#25105;&#20204;&#24471;&#20986;&#20102;&#30001;&#20110;&#20551;&#24819;&#20215;&#26684;&#19978;&#28072;&#23548;&#33268;&#30340;&#20010;&#20154;&#32423;&#21035;&#28040;&#36153;&#32773;&#31119;&#21033;&#25439;&#22833;&#30340;&#20219;&#20309;&#32622;&#20449;&#27700;&#24179;&#30340;&#19979;&#38480;&#65292;&#24182;&#22312;&#29420;&#31435;&#24615;&#38480;&#21046;&#19979;&#21463;&#26032;&#30340;&#32622;&#20449;&#21306;&#38388;&#32422;&#26463;&#30340;&#21487;&#25193;&#23637;&#20248;&#21270;&#38382;&#39064;&#20013;&#27714;&#35299;&#12290;&#36825;&#20010;&#32622;&#20449;&#21306;&#38388;&#38750;&#24120;&#31616;&#21333;&#65292;&#40065;&#26834;&#24615;&#24378;&#65292;&#23545;&#20110;&#24369;&#24037;&#20855;&#21644;&#38750;&#32447;&#24615;&#27169;&#22411;&#25935;&#24863;&#24230;&#37117;&#24456;&#20302;&#65292;&#24182;&#19988;&#21487;&#33021;&#36866;&#29992;&#20110;&#31119;&#21033;&#20998;&#26512;&#20043;&#22806;&#30340;&#20854;&#20182;&#39046;&#22495;&#12290;Monte Carlo&#27169;&#25311;&#21644;&#20004;&#20010;&#20851;&#20110;&#27773;&#27833;&#21644;&#39135;&#21697;&#38656;&#27714;&#30340;&#23454;&#35777;&#24212;&#29992;&#35777;&#26126;&#20102;&#25105;&#20204;&#30340;&#26041;&#27861;&#30340;&#23454;&#25928;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
We introduce a novel framework for individual-level welfare analysis. It builds on a parametric model for continuous demand with a quasilinear utility function, allowing for unobserved individual-product-level preference shocks. We obtain bounds on the individual-level consumer welfare loss at any confidence level due to a hypothetical price increase, solving a scalable optimization problem constrained by a new confidence set under an independence restriction. This confidence set is computationally simple, robust to weak instruments and nonlinearity, and may have applications beyond welfare analysis. Monte Carlo simulations and two empirical applications on gasoline and food demand demonstrate the effectiveness of our method.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#26377;&#26102;&#38388;&#21464;&#37327;&#30340;&#24322;&#36136;&#24615;&#23545;&#27604;&#20013;&#30340;&#24179;&#34892;&#36235;&#21183;&#20551;&#35774;&#30340;&#35782;&#21035;&#21644;&#20272;&#35745;&#31574;&#30053;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#21033;&#29992;&#23616;&#37096;&#25237;&#24433;&#24471;&#21040;&#30340;&#39640;&#32500;&#27531;&#24046;&#20043;&#38388;&#30340;&#24046;&#24322;&#30340;&#26032;&#30340;&#35782;&#21035;&#21644;&#20272;&#35745;&#31574;&#30053;&#65292;&#33021;&#22815;&#22312;&#26356;&#22810;&#24773;&#20917;&#19979;&#20855;&#26377;&#40065;&#26834;&#24615;&#21644;&#39640;&#25928;&#24615;&#65292;&#21487;&#29992;&#20110;&#20272;&#35745;&#23384;&#22312;&#24322;&#36136;&#24615;&#27835;&#30103;&#25928;&#24212;&#21644;/&#25110;&#24178;&#25200;&#30340;&#29615;&#22659;&#20013;&#30340;&#22240;&#26524;&#25928;&#24212;&#12290;</title><link>http://arxiv.org/abs/2202.02903</link><description>&lt;p&gt;
&#26377;&#26102;&#38388;&#21464;&#37327;&#30340;&#24322;&#36136;&#24615;&#23545;&#27604;&#20013;&#30340;&#24179;&#34892;&#36235;&#21183;&#20551;&#35774;&#38382;&#39064;
&lt;/p&gt;
&lt;p&gt;
Difference-in-Differences with Time-Varying Covariates in the Parallel Trends Assumption. (arXiv:2202.02903v2 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2202.02903
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#26377;&#26102;&#38388;&#21464;&#37327;&#30340;&#24322;&#36136;&#24615;&#23545;&#27604;&#20013;&#30340;&#24179;&#34892;&#36235;&#21183;&#20551;&#35774;&#30340;&#35782;&#21035;&#21644;&#20272;&#35745;&#31574;&#30053;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#21033;&#29992;&#23616;&#37096;&#25237;&#24433;&#24471;&#21040;&#30340;&#39640;&#32500;&#27531;&#24046;&#20043;&#38388;&#30340;&#24046;&#24322;&#30340;&#26032;&#30340;&#35782;&#21035;&#21644;&#20272;&#35745;&#31574;&#30053;&#65292;&#33021;&#22815;&#22312;&#26356;&#22810;&#24773;&#20917;&#19979;&#20855;&#26377;&#40065;&#26834;&#24615;&#21644;&#39640;&#25928;&#24615;&#65292;&#21487;&#29992;&#20110;&#20272;&#35745;&#23384;&#22312;&#24322;&#36136;&#24615;&#27835;&#30103;&#25928;&#24212;&#21644;/&#25110;&#24178;&#25200;&#30340;&#29615;&#22659;&#20013;&#30340;&#22240;&#26524;&#25928;&#24212;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#24322;&#36136;&#24615;&#23545;&#27604;&#30340;&#35782;&#21035;&#21644;&#20272;&#35745;&#31574;&#30053;&#65292;&#20854;&#20013;&#24179;&#34892;&#36235;&#21183;&#20551;&#35774;&#26159;&#22312;&#23545;&#26102;&#38388;&#21464;&#37327;&#21644;/&#25110;&#26102;&#38388;&#19981;&#21464;&#21327;&#21464;&#37327;&#36827;&#34892;&#26465;&#20214;&#21270;&#21518;&#25104;&#31435;&#30340;&#12290;&#25105;&#20204;&#30340;&#31532;&#19968;&#20010;&#20027;&#35201;&#36129;&#29486;&#26159;&#25351;&#20986;&#20102;&#24120;&#29992;&#30340;&#21452;&#21521;&#22266;&#23450;&#25928;&#24212;&#65288;TWFE&#65289;&#22238;&#24402;&#22312;&#36825;&#31181;&#24773;&#20917;&#19979;&#23384;&#22312;&#19968;&#20123;&#24369;&#28857;&#12290;&#38500;&#20102;&#25991;&#29486;&#20013;&#24378;&#35843;&#30340;&#28041;&#21450;&#22810;&#20010;&#26102;&#26399;&#21644;&#27835;&#30103;&#26102;&#26426;&#21464;&#21270;&#30340;&#38382;&#39064;&#20043;&#22806;&#65292;&#25105;&#20204;&#36824;&#34920;&#26126;&#65292;&#21363;&#20351;&#22312;&#21482;&#26377;&#20004;&#20010;&#26102;&#38388;&#27573;&#30340;&#24773;&#20917;&#19979;&#65292;TWFE&#22238;&#24402;&#20063;&#19981;&#19968;&#23450;&#33021;&#22815;&#25269;&#24481;&#65288;i&#65289;&#26410;&#25509;&#21463;&#22788;&#29702;&#30340;&#28508;&#22312;&#32467;&#26524;&#36335;&#24452;&#21462;&#20915;&#20110;&#26102;&#38388;&#21464;&#37327;&#30340;&#27700;&#24179;&#65288;&#32780;&#19981;&#20165;&#20165;&#26159;&#26102;&#38388;&#20869;&#21464;&#37327;&#30340;&#21464;&#21270;&#65289;&#65292;&#65288;ii&#65289;&#26410;&#25509;&#21463;&#22788;&#29702;&#30340;&#28508;&#22312;&#32467;&#26524;&#36335;&#24452;&#21462;&#20915;&#20110;&#26102;&#38388;&#19981;&#21464;&#30340;&#21327;&#21464;&#37327;&#65292;&#20197;&#21450;&#65288;iii&#65289;&#32467;&#26524;&#38543;&#26102;&#38388;&#21644;/&#25110;&#20542;&#21521;&#24471;&#20998;&#30340;&#32447;&#24615;&#26465;&#20214;&#36829;&#21453;&#30340;&#24773;&#20917;&#12290;&#21363;&#20351;&#22312;&#21069;&#19977;&#20010;&#38382;&#39064;&#37117;&#19981;&#25104;&#31435;&#30340;&#24773;&#20917;&#19979;&#65292;&#25105;&#20204;&#36824;&#26159;&#34920;&#26126;&#65292;TWFE&#22238;&#24402;&#21487;&#33021;&#20250;&#21463;&#21040;&#26174;&#33879;&#30340;&#25928;&#29575;&#25439;&#22833;&#12290;&#25105;&#20204;&#30340;&#31532;&#20108;&#20010;&#20027;&#35201;&#36129;&#29486;&#26159;&#25552;&#20986;&#20102;&#19968;&#31181;&#21033;&#29992;&#23616;&#37096;&#25237;&#24433;&#24471;&#21040;&#30340;&#39640;&#32500;&#27531;&#24046;&#20043;&#38388;&#30340;&#24046;&#24322;&#30340;&#26032;&#30340;&#35782;&#21035;&#21644;&#20272;&#35745;&#31574;&#30053;&#12290;&#30001;&#20110;&#26500;&#36896;&#26041;&#24335;&#65292;&#36825;&#31181;&#26032;&#31574;&#30053;&#36890;&#24120;&#23545;&#19978;&#36848;&#25152;&#26377;&#38382;&#39064;&#37117;&#20855;&#26377;&#40065;&#26834;&#24615;&#65292;&#21253;&#25324;&#32467;&#26524;&#25110;&#27835;&#30103;&#20998;&#37197;&#35268;&#21017;&#20013;&#30340;&#28508;&#22312;&#38750;&#32447;&#24615;&#12290;&#37325;&#35201;&#30340;&#26159;&#65292;&#25105;&#20204;&#30340;&#26041;&#27861;&#21487;&#20197;&#29992;&#29616;&#25104;&#30340;&#36719;&#20214;&#21253;&#23454;&#29616;&#65292;&#20063;&#21487;&#20197;&#29992;&#20110;&#20272;&#35745;&#23384;&#22312;&#24322;&#36136;&#24615;&#27835;&#30103;&#25928;&#24212;&#21644;/&#25110;&#24178;&#25200;&#30340;&#29615;&#22659;&#20013;&#30340;&#22240;&#26524;&#25928;&#24212;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this paper, we study difference-in-differences identification and estimation strategies where the parallel trends assumption holds after conditioning on time-varying covariates and/or time-invariant covariates. Our first main contribution is to point out a number of weaknesses of commonly used two-way fixed effects (TWFE) regressions in this context. In addition to issues related to multiple periods and variation in treatment timing that have been emphasized in the literature, we show that, even in the case with only two time periods, TWFE regressions are not generally robust to (i) paths of untreated potential outcomes depending on the level of time-varying covariates (as opposed to only the change in the covariates over time), (ii) paths of untreated potential outcomes depending on time-invariant covariates, and (iii) violations of linearity conditions for outcomes over time and/or the propensity score. Even in cases where none of the previous three issues hold, we show that TWFE 
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;&#23545;N&#20154;&#21338;&#24328;&#24212;&#29992;&#30340;&#28216;&#25103;&#21464;&#25442;&#20013;&#65292;&#21738;&#20123;&#21464;&#25442;&#21487;&#20197;&#20445;&#25345;&#26368;&#20339;&#21453;&#24212;&#38598;&#25110;&#32435;&#20160;&#22343;&#34913;&#38598;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#27491;&#20223;&#23556;&#21464;&#25442;&#21487;&#20197;&#20445;&#25345;&#26368;&#20339;&#21453;&#24212;&#38598;&#12290;&#36825;&#20010;&#30740;&#31350;&#25552;&#20379;&#20102;&#19968;&#20010;&#26126;&#30830;&#30340;&#25551;&#36848;&#65292;&#35828;&#26126;&#21738;&#20123;&#28216;&#25103;&#21464;&#25442;&#21487;&#20197;&#20445;&#25345;&#26368;&#20339;&#21453;&#24212;&#38598;&#25110;&#32435;&#20160;&#22343;&#34913;&#38598;&#12290;</title><link>http://arxiv.org/abs/2111.00076</link><description>&lt;p&gt;
&#20445;&#25345;&#32435;&#20160;&#22343;&#34913;&#25110;&#26368;&#20339;&#21453;&#24212;&#38598;&#30340;&#28216;&#25103;&#21464;&#25442;
&lt;/p&gt;
&lt;p&gt;
Game Transformations That Preserve Nash Equilibria or Best Response Sets. (arXiv:2111.00076v2 [cs.GT] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2111.00076
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;&#23545;N&#20154;&#21338;&#24328;&#24212;&#29992;&#30340;&#28216;&#25103;&#21464;&#25442;&#20013;&#65292;&#21738;&#20123;&#21464;&#25442;&#21487;&#20197;&#20445;&#25345;&#26368;&#20339;&#21453;&#24212;&#38598;&#25110;&#32435;&#20160;&#22343;&#34913;&#38598;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#27491;&#20223;&#23556;&#21464;&#25442;&#21487;&#20197;&#20445;&#25345;&#26368;&#20339;&#21453;&#24212;&#38598;&#12290;&#36825;&#20010;&#30740;&#31350;&#25552;&#20379;&#20102;&#19968;&#20010;&#26126;&#30830;&#30340;&#25551;&#36848;&#65292;&#35828;&#26126;&#21738;&#20123;&#28216;&#25103;&#21464;&#25442;&#21487;&#20197;&#20445;&#25345;&#26368;&#20339;&#21453;&#24212;&#38598;&#25110;&#32435;&#20160;&#22343;&#34913;&#38598;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#21516;&#26102;&#38750;&#21512;&#20316;&#21338;&#24328;&#30340;&#25991;&#29486;&#20013;&#65292;&#24191;&#27867;&#20351;&#29992;&#30340;&#20107;&#23454;&#26159;&#65292;&#25928;&#29992;&#25910;&#30410;&#30340;&#27491;&#20223;&#23556;&#65288;&#32447;&#24615;&#65289;&#21464;&#25442;&#26082;&#19981;&#25913;&#21464;&#26368;&#20339;&#21453;&#24212;&#38598;&#65292;&#20063;&#19981;&#25913;&#21464;&#32435;&#20160;&#22343;&#34913;&#38598;&#12290;&#25105;&#20204;&#30740;&#31350;&#20102;&#21738;&#20123;&#20854;&#20182;&#28216;&#25103;&#21464;&#25442;&#22312;&#24212;&#29992;&#20110;&#20219;&#24847;N&#20154;&#28216;&#25103;&#65288;N&#8805;2&#65289;&#26102;&#20063;&#20855;&#26377;&#36825;&#20004;&#31181;&#23646;&#24615;&#20043;&#19968;&#65306;&#65288;i&#65289;&#32435;&#20160;&#22343;&#34913;&#38598;&#20445;&#25345;&#19981;&#21464;&#65307;&#65288;ii&#65289;&#26368;&#20339;&#21453;&#24212;&#38598;&#20445;&#25345;&#19981;&#21464;&#12290;&#23545;&#20110;&#20197;&#29609;&#23478;&#21644;&#31574;&#30053;&#20026;&#22522;&#30784;&#30340;&#28216;&#25103;&#21464;&#25442;&#65292;&#25105;&#20204;&#35777;&#26126;&#65288;i&#65289;&#24847;&#21619;&#30528;&#65288;ii&#65289;&#65292;&#20855;&#26377;&#23646;&#24615;&#65288;ii&#65289;&#30340;&#21464;&#25442;&#24517;&#39035;&#26159;&#27491;&#20223;&#23556;&#30340;&#12290;&#24471;&#21040;&#30340;&#31561;&#20215;&#38142;&#26126;&#30830;&#25551;&#36848;&#20102;&#37027;&#20123;&#24635;&#26159;&#20445;&#25345;&#32435;&#20160;&#22343;&#34913;&#38598;&#65288;&#25110;&#26368;&#20339;&#21453;&#24212;&#38598;&#65289;&#30340;&#28216;&#25103;&#21464;&#25442;&#12290;&#21516;&#26102;&#65292;&#25105;&#20204;&#33719;&#24471;&#20102;&#27491;&#20223;&#23556;&#21464;&#25442;&#31867;&#30340;&#20004;&#20010;&#26032;&#29305;&#24449;&#25551;&#36848;&#12290;
&lt;/p&gt;
&lt;p&gt;
In the literature on simultaneous non-cooperative games, it is a widely used fact that a positive affine (linear) transformation of the utility payoffs neither changes the best response sets nor the Nash equilibrium set. We investigate which other game transformations also possess one of these two properties when being applied to an arbitrary N-player game (N &gt;= 2):  (i) The Nash equilibrium set stays the same.  (ii) The best response sets stay the same.  For game transformations that operate player-wise and strategy-wise, we prove that (i) implies (ii) and that transformations with property (ii) must be positive affine. The resulting equivalence chain gives an explicit description of all those game transformations that always preserve the Nash equilibrium set (or, respectively, the best response sets). Simultaneously, we obtain two new characterizations of the class of positive affine transformations.
&lt;/p&gt;</description></item></channel></rss>