<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#35813;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#36890;&#36807;&#31163;&#25955;&#21270;&#26041;&#27861;&#26469;&#23454;&#29616;&#22238;&#24402;&#21442;&#25968;&#28857;&#26631;&#35782;&#30340;&#27169;&#22411;&#65292;&#21516;&#26102;&#20445;&#25252;&#25968;&#25454;&#26426;&#23494;&#24615;&#65292;&#36866;&#29992;&#20110;&#35299;&#20915;&#38754;&#26495;&#25968;&#25454;&#20013;&#22810;&#20803;&#32447;&#24615;&#22238;&#24402;&#21442;&#25968;&#20272;&#35745;&#30340;&#26041;&#27861;&#12290;</title><link>https://arxiv.org/abs/2403.15220</link><description>&lt;p&gt;
&#20351;&#29992;&#31163;&#25955;&#21464;&#37327;&#24314;&#27169;
&lt;/p&gt;
&lt;p&gt;
Modelling with Discretized Variables
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.15220
&lt;/p&gt;
&lt;p&gt;
&#35813;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#36890;&#36807;&#31163;&#25955;&#21270;&#26041;&#27861;&#26469;&#23454;&#29616;&#22238;&#24402;&#21442;&#25968;&#28857;&#26631;&#35782;&#30340;&#27169;&#22411;&#65292;&#21516;&#26102;&#20445;&#25252;&#25968;&#25454;&#26426;&#23494;&#24615;&#65292;&#36866;&#29992;&#20110;&#35299;&#20915;&#38754;&#26495;&#25968;&#25454;&#20013;&#22810;&#20803;&#32447;&#24615;&#22238;&#24402;&#21442;&#25968;&#20272;&#35745;&#30340;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#35752;&#35770;&#20102;&#22312;&#35745;&#37327;&#32463;&#27982;&#27169;&#22411;&#20013;&#65292;&#22240;&#21464;&#37327;&#12289;&#19968;&#20123;&#35299;&#37322;&#21464;&#37327;&#25110;&#20004;&#32773;&#22343;&#20197;&#34987;&#25130;&#26029;&#30340;&#21306;&#38388;&#25968;&#25454;&#30340;&#24418;&#24335;&#35266;&#27979;&#21040;&#30340;&#24773;&#20917;&#12290;&#36825;&#31181;&#31163;&#25955;&#21270;&#36890;&#24120;&#26159;&#30001;&#20110;&#25935;&#24863;&#21464;&#37327;&#22914;&#25910;&#20837;&#30340;&#20445;&#23494;&#24615;&#36896;&#25104;&#30340;&#12290;&#20351;&#29992;&#36825;&#20123;&#21464;&#37327;&#30340;&#27169;&#22411;&#26080;&#27861;&#23545;&#22238;&#24402;&#21442;&#25968;&#36827;&#34892;&#28857;&#35782;&#21035;&#65292;&#22240;&#20026;&#26465;&#20214;&#30697;&#26410;&#30693;&#65292;&#36825;&#23548;&#33268;&#25991;&#29486;&#20351;&#29992;&#21306;&#38388;&#20272;&#35745;&#12290;&#22312;&#36825;&#37324;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#31163;&#25955;&#21270;&#26041;&#27861;&#65292;&#36890;&#36807;&#35813;&#26041;&#27861;&#21487;&#20197;&#28857;&#35782;&#21035;&#22238;&#24402;&#21442;&#25968;&#65292;&#21516;&#26102;&#20445;&#25252;&#25968;&#25454;&#30340;&#26426;&#23494;&#24615;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;OLS&#20272;&#35745;&#22120;&#22312;&#38754;&#26495;&#25968;&#25454;&#30340;&#22810;&#20803;&#32447;&#24615;&#22238;&#24402;&#20013;&#30340;&#28176;&#36817;&#24615;&#36136;&#12290;&#29702;&#35770;&#21457;&#29616;&#24471;&#21040;&#33945;&#29305;&#21345;&#27931;&#23454;&#39564;&#30340;&#25903;&#25345;&#65292;&#24182;&#36890;&#36807;&#24212;&#29992;&#21040;&#28595;&#22823;&#21033;&#20122;&#24615;&#21035;&#24037;&#36164;&#24046;&#36317;&#19978;&#36827;&#34892;&#20102;&#35828;&#26126;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.15220v1 Announce Type: new  Abstract: This paper deals with econometric models in which the dependent variable, some explanatory variables, or both are observed as censored interval data. This discretization often happens due to confidentiality of sensitive variables like income. Models using these variables cannot point identify regression parameters as the conditional moments are unknown, which led the literature to use interval estimates. Here, we propose a discretization method through which the regression parameters can be point identified while preserving data confidentiality. We demonstrate the asymptotic properties of the OLS estimator for the parameters in multivariate linear regressions for cross-sectional data. The theoretical findings are supported by Monte Carlo experiments and illustrated with an application to the Australian gender wage gap.
&lt;/p&gt;</description></item></channel></rss>