<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#36825;&#31687;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#21160;&#24577;&#31995;&#32479;&#26041;&#27861;&#26469;&#21033;&#29992;&#31038;&#20250;&#36716;&#25240;&#30340;&#28508;&#21147;&#65292;&#20197;&#23454;&#29616;&#20928;&#38646;&#28201;&#23460;&#27668;&#20307;&#25490;&#25918;&#30446;&#26631;&#12290;&#35813;&#26041;&#27861;&#21253;&#25324;&#31995;&#32479;&#35266;&#12289;&#23450;&#21521;&#25968;&#25454;&#25910;&#38598;&#21644;&#20840;&#29699;&#32508;&#21512;&#27169;&#22411;&#31561;&#22810;&#23618;&#38754;&#32771;&#34385;&#12290;</title><link>http://arxiv.org/abs/2309.14964</link><description>&lt;p&gt;
&#21160;&#24577;&#31995;&#32479;&#26041;&#27861;&#26469;&#21033;&#29992;&#31038;&#20250;&#36716;&#25240;&#30340;&#28508;&#21147;
&lt;/p&gt;
&lt;p&gt;
A dynamic systems approach to harness the potential of social tipping. (arXiv:2309.14964v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.14964
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#21160;&#24577;&#31995;&#32479;&#26041;&#27861;&#26469;&#21033;&#29992;&#31038;&#20250;&#36716;&#25240;&#30340;&#28508;&#21147;&#65292;&#20197;&#23454;&#29616;&#20928;&#38646;&#28201;&#23460;&#27668;&#20307;&#25490;&#25918;&#30446;&#26631;&#12290;&#35813;&#26041;&#27861;&#21253;&#25324;&#31995;&#32479;&#35266;&#12289;&#23450;&#21521;&#25968;&#25454;&#25910;&#38598;&#21644;&#20840;&#29699;&#32508;&#21512;&#27169;&#22411;&#31561;&#22810;&#23618;&#38754;&#32771;&#34385;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#31038;&#20250;&#36716;&#25240;&#28857;&#26159;&#23454;&#29616;&#20928;&#38646;&#28201;&#23460;&#27668;&#20307;&#25490;&#25918;&#30446;&#26631;&#30340;&#26377;&#24076;&#26395;&#30340;&#25163;&#27573;&#12290;&#22914;&#26524;&#35302;&#21457;&#32423;&#32852;&#30340;&#27491;&#21453;&#39304;&#26426;&#21046;&#65292;&#23427;&#20204;&#25551;&#36848;&#20102;&#31038;&#20250;&#12289;&#25919;&#27835;&#12289;&#32463;&#27982;&#25110;&#25216;&#26415;&#31995;&#32479;&#22914;&#20309;&#36805;&#36895;&#36716;&#20837;&#26032;&#29366;&#24577;&#12290;&#20998;&#26512;&#31038;&#20250;&#36716;&#25240;&#23545;&#24555;&#36895;&#33073;&#30899;&#30340;&#28508;&#21147;&#38656;&#35201;&#32771;&#34385;&#31038;&#20250;&#31995;&#32479;&#22266;&#26377;&#30340;&#22797;&#26434;&#24615;&#12290;&#22312;&#36825;&#37324;&#65292;&#25105;&#20204;&#25351;&#20986;&#29616;&#26377;&#30340;&#31185;&#23398;&#25991;&#29486;&#20542;&#21521;&#20110;&#22522;&#20110;&#21465;&#20107;&#30340;&#31038;&#20250;&#36716;&#25240;&#35760;&#36848;&#65292;&#32570;&#20047;&#24191;&#27867;&#30340;&#23454;&#35777;&#26694;&#26550;&#21644;&#22810;&#31995;&#32479;&#35270;&#35282;&#12290;&#38543;&#21518;&#65292;&#25105;&#20204;&#27010;&#36848;&#20102;&#19968;&#20010;&#21160;&#24577;&#31995;&#32479;&#26041;&#27861;&#65292;&#21253;&#25324;&#65288;i&#65289;&#28041;&#21450;&#30456;&#20114;&#20851;&#32852;&#30340;&#21453;&#39304;&#26426;&#21046;&#30340;&#31995;&#32479;&#35266;&#65307;
&lt;/p&gt;
&lt;p&gt;
Social tipping points are promising levers to achieve net-zero greenhouse gas emission targets. They describe how social, political, economic or technological systems can move rapidly into a new state if cascading positive feedback mechanisms are triggered. Analysing the potential of social tipping for rapid decarbonization requires considering the inherent complexity of social systems. Here, we identify that existing scientific literature is inclined to a narrative-based account of social tipping, lacks a broad empirical framework and a multi-systems view. We subsequently outline a dynamic systems approach that entails (i) a systems outlook involving interconnected feedback mechanisms alongside cross-system and cross-scale interactions, and including a socioeconomic and environmental injustice perspective (ii) directed data collection efforts to provide empirical evidence for and monitor social tipping dynamics, (iii) global, integrated, descriptive modelling to project future dynamic
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#36890;&#36807;&#32593;&#32476;&#24314;&#27169;&#26041;&#27861;&#35843;&#26597;&#20102;&#27874;&#20848;&#31038;&#20250;&#23545;&#33021;&#28304;&#30340;&#24577;&#24230;&#65292;&#21457;&#29616;&#25919;&#27835;&#24847;&#35782;&#24418;&#24577;&#12289;&#29615;&#22659;&#24577;&#24230;&#12289;&#39118;&#38505;&#24863;&#30693;&#12289;&#23433;&#20840;&#39038;&#34385;&#21644;&#32463;&#27982;&#21464;&#37327;&#31561;&#22240;&#32032;&#23545;&#33021;&#28304;&#25509;&#21463;&#24230;&#36215;&#37325;&#35201;&#20316;&#29992;&#12290;&#30740;&#31350;&#32467;&#26524;&#20026;&#25913;&#21892;&#27874;&#20848;&#33021;&#28304;&#25919;&#31574;&#25552;&#20379;&#20102;&#22522;&#30784;&#65292;&#24378;&#35843;&#20102;&#19982;&#27874;&#20848;&#20154;&#21475;&#30340;&#22810;&#26679;&#21270;&#20215;&#20540;&#35266;&#12289;&#20449;&#20208;&#21644;&#20559;&#22909;&#30456; resonating &#30340;&#25919;&#31574;&#30340;&#37325;&#35201;&#24615;&#12290;</title><link>http://arxiv.org/abs/2309.14869</link><description>&lt;p&gt;
&#27874;&#20848;&#30340;&#26680;&#33021;&#25509;&#21463;&#24230;&#65306;&#20174;&#31038;&#20250;&#24577;&#24230;&#21040;&#26377;&#25928;&#25919;&#31574;&#31574;&#30053;--&#32593;&#32476;&#24314;&#27169;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Nuclear Energy Acceptance in Poland: From Societal Attitudes to Effective Policy Strategies -- Network Modeling Approach. (arXiv:2309.14869v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.14869
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#36890;&#36807;&#32593;&#32476;&#24314;&#27169;&#26041;&#27861;&#35843;&#26597;&#20102;&#27874;&#20848;&#31038;&#20250;&#23545;&#33021;&#28304;&#30340;&#24577;&#24230;&#65292;&#21457;&#29616;&#25919;&#27835;&#24847;&#35782;&#24418;&#24577;&#12289;&#29615;&#22659;&#24577;&#24230;&#12289;&#39118;&#38505;&#24863;&#30693;&#12289;&#23433;&#20840;&#39038;&#34385;&#21644;&#32463;&#27982;&#21464;&#37327;&#31561;&#22240;&#32032;&#23545;&#33021;&#28304;&#25509;&#21463;&#24230;&#36215;&#37325;&#35201;&#20316;&#29992;&#12290;&#30740;&#31350;&#32467;&#26524;&#20026;&#25913;&#21892;&#27874;&#20848;&#33021;&#28304;&#25919;&#31574;&#25552;&#20379;&#20102;&#22522;&#30784;&#65292;&#24378;&#35843;&#20102;&#19982;&#27874;&#20848;&#20154;&#21475;&#30340;&#22810;&#26679;&#21270;&#20215;&#20540;&#35266;&#12289;&#20449;&#20208;&#21644;&#20559;&#22909;&#30456; resonating &#30340;&#25919;&#31574;&#30340;&#37325;&#35201;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#27874;&#20848;&#33021;&#28304;&#37096;&#38376;&#30446;&#21069;&#27491;&#32463;&#21382;&#37325;&#22823;&#36716;&#22411;&#65292;&#36194;&#24471;&#20844;&#20247;&#25903;&#25345;&#23545;&#20854;&#33021;&#28304;&#25919;&#31574;&#30340;&#25104;&#21151;&#33267;&#20851;&#37325;&#35201;&#12290;&#25105;&#20204;&#36890;&#36807;&#19982;338&#21517;&#27874;&#20848;&#21442;&#19982;&#32773;&#36827;&#34892;&#30740;&#31350;&#65292;&#35843;&#26597;&#20102;&#31038;&#20250;&#23545;&#21508;&#31181;&#33021;&#28304;&#26469;&#28304;&#30340;&#24577;&#24230;&#65292;&#21253;&#25324;&#26680;&#33021;&#21644;&#21487;&#20877;&#29983;&#33021;&#28304;&#12290;&#24212;&#29992;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#32593;&#32476;&#26041;&#27861;&#65292;&#25105;&#20204;&#30830;&#23450;&#20102;&#24433;&#21709;&#33021;&#28304;&#25509;&#21463;&#24230;&#30340;&#22810;&#31181;&#22240;&#32032;&#12290;&#25919;&#27835;&#24847;&#35782;&#24418;&#24577;&#26159;&#22609;&#36896;&#20844;&#20247;&#25509;&#21463;&#24230;&#30340;&#26680;&#24515;&#22240;&#32032;&#65292;&#28982;&#32780;&#25105;&#20204;&#36824;&#21457;&#29616;&#29615;&#22659;&#24577;&#24230;&#12289;&#39118;&#38505;&#24863;&#30693;&#12289;&#23433;&#20840;&#39038;&#34385;&#21644;&#32463;&#27982;&#21464;&#37327;&#20063;&#36215;&#30528;&#37325;&#35201;&#20316;&#29992;&#12290;&#37492;&#20110;&#26680;&#33021;&#30340;&#38271;&#26399;&#25215;&#35834;&#21644;&#20854;&#22312;&#27874;&#20848;&#33021;&#28304;&#36716;&#22411;&#20013;&#30340;&#35282;&#33394;&#65292;&#25105;&#20204;&#30340;&#30740;&#31350;&#20026;&#25913;&#21892;&#27874;&#20848;&#30340;&#33021;&#28304;&#25919;&#31574;&#25552;&#20379;&#20102;&#22522;&#30784;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#24378;&#35843;&#20102;&#19982;&#20154;&#21475;&#30340;&#22810;&#26679;&#21270;&#20215;&#20540;&#35266;&#12289;&#20449;&#20208;&#21644;&#20559;&#22909;&#30456; resonating &#30340;&#25919;&#31574;&#30340;&#37325;&#35201;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Poland is currently undergoing substantial transformation in its energy sector, and gaining public support is pivotal for the success of its energy policies. We conducted a study with 338 Polish participants to investigate societal attitudes towards various energy sources, including nuclear energy and renewables. Applying a novel network approach, we identified a multitude of factors influencing energy acceptance. Political ideology is the central factor in shaping public acceptance, however we also found that environmental attitudes, risk perception, safety concerns, and economic variables play substantial roles. Considering the long-term commitment associated with nuclear energy and its role in Poland's energy transformation, our findings provide a foundation for improving energy policy in Poland. Our research underscores the importance of policies that resonate with the diverse values, beliefs, and preferences of the population. While the risk-risk trade-off and technology-focused s
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#38750;&#21442;&#25968;&#26041;&#27861;&#26469;&#20272;&#35745;&#20114;&#32852;&#32593;&#23553;&#38145;&#23545;&#32463;&#27982;&#27963;&#21160;&#30340;&#24433;&#21709;&#65292;&#24182;&#21457;&#29616;&#21360;&#24230;&#30340;Internet&#23553;&#38145;&#23548;&#33268;&#32463;&#27982;&#27963;&#21160;&#20943;&#23569;&#36229;&#36807;50&#65285;&#65292;&#23545;&#20840;&#29699;&#25968;&#23383;&#32463;&#27982;&#30340;&#23553;&#38145;&#30495;&#23454;&#25104;&#26412;&#20135;&#29983;&#20102;&#26032;&#30340;&#35265;&#35299;&#12290;</title><link>http://arxiv.org/abs/2309.14630</link><description>&lt;p&gt;
&#33258;&#30001;&#19981;&#36830;&#32493;&#35774;&#35745;&#65306;&#24212;&#29992;&#20110;&#20114;&#32852;&#32593;&#23553;&#38145;&#30340;&#32463;&#27982;&#24433;&#21709;
&lt;/p&gt;
&lt;p&gt;
Free Discontinuity Design: With an Application to the Economic Effects of Internet Shutdowns. (arXiv:2309.14630v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.14630
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#38750;&#21442;&#25968;&#26041;&#27861;&#26469;&#20272;&#35745;&#20114;&#32852;&#32593;&#23553;&#38145;&#23545;&#32463;&#27982;&#27963;&#21160;&#30340;&#24433;&#21709;&#65292;&#24182;&#21457;&#29616;&#21360;&#24230;&#30340;Internet&#23553;&#38145;&#23548;&#33268;&#32463;&#27982;&#27963;&#21160;&#20943;&#23569;&#36229;&#36807;50&#65285;&#65292;&#23545;&#20840;&#29699;&#25968;&#23383;&#32463;&#27982;&#30340;&#23553;&#38145;&#30495;&#23454;&#25104;&#26412;&#20135;&#29983;&#20102;&#26032;&#30340;&#35265;&#35299;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#27835;&#30103;&#20998;&#37197;&#20013;&#30340;&#38408;&#20540;&#21487;&#20197;&#20135;&#29983;&#32467;&#26524;&#30340;&#19981;&#36830;&#32493;&#24615;&#65292;&#20174;&#32780;&#25581;&#31034;&#22240;&#26524;&#27934;&#23519;&#21147;&#12290;&#22312;&#35768;&#22810;&#24773;&#22659;&#20013;&#65292;&#22914;&#22320;&#29702;&#29615;&#22659;&#65292;&#36825;&#20123;&#38408;&#20540;&#26159;&#26410;&#30693;&#21644;&#22810;&#21464;&#37327;&#30340;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#38750;&#21442;&#25968;&#26041;&#27861;&#26469;&#20272;&#35745;&#30001;&#27492;&#20135;&#29983;&#30340;&#19981;&#36830;&#32493;&#24615;&#65292;&#36890;&#36807;&#23558;&#22238;&#24402;&#26354;&#38754;&#20998;&#21106;&#25104;&#24179;&#28369;&#21644;&#19981;&#36830;&#32493;&#37096;&#20998;&#12290;&#35813;&#20272;&#35745;&#22120;&#20351;&#29992;&#20102;Mumford-Shah&#20989;&#25968;&#30340;&#20984;&#26494;&#24347;&#65292;&#25105;&#20204;&#24314;&#31435;&#20102;&#20854;&#35782;&#21035;&#21644;&#25910;&#25947;&#24615;&#12290;&#20351;&#29992;&#25105;&#20204;&#30340;&#26041;&#27861;&#65292;&#25105;&#20204;&#20272;&#35745;&#21360;&#24230;&#30340;Internet&#23553;&#38145;&#23548;&#33268;&#32463;&#27982;&#27963;&#21160;&#20943;&#23569;&#36229;&#36807;50&#65285;&#65292;&#36828;&#36828;&#36229;&#36807;&#20197;&#21069;&#30340;&#20272;&#35745;&#65292;&#24182;&#23545;&#20840;&#29699;&#25968;&#23383;&#32463;&#27982;&#30340;&#27492;&#31867;&#23553;&#38145;&#30340;&#30495;&#23454;&#25104;&#26412;&#20135;&#29983;&#20102;&#26032;&#30340;&#35265;&#35299;&#12290;
&lt;/p&gt;
&lt;p&gt;
Thresholds in treatment assignments can produce discontinuities in outcomes, revealing causal insights. In many contexts, like geographic settings, these thresholds are unknown and multivariate. We propose a non-parametric method to estimate the resulting discontinuities by segmenting the regression surface into smooth and discontinuous parts. This estimator uses a convex relaxation of the Mumford-Shah functional, for which we establish identification and convergence. Using our method, we estimate that an internet shutdown in India resulted in a reduction of economic activity by over 50%, greatly surpassing previous estimates and shedding new light on the true cost of such shutdowns for digital economies globally.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#35780;&#20272;&#20102;&#24046;&#20998;&#38544;&#31169;&#22312;RCT&#20013;&#30340;&#23454;&#29992;&#24615;&#65292;&#36890;&#36807;&#23454;&#35777;&#35780;&#20272;&#24378;&#38544;&#31169;&#20445;&#25252;&#26041;&#27861;&#23545;&#24050;&#21457;&#34920;&#30340;RCT&#20998;&#26512;&#30340;&#24433;&#21709;&#65292;&#24182;&#21457;&#29616;&#30456;&#23545;&#31616;&#21333;&#30340;&#22522;&#20110;&#24046;&#20998;&#38544;&#31169;&#30340;&#26041;&#27861;&#21487;&#20197;&#23454;&#29616;&#36825;&#19968;&#30446;&#26631;&#12290;</title><link>http://arxiv.org/abs/2309.14581</link><description>&lt;p&gt;
&#35780;&#20272;&#24046;&#20998;&#38544;&#31169;&#22312;RCT&#20013;&#30340;&#23454;&#29992;&#24615;
&lt;/p&gt;
&lt;p&gt;
Assessing Utility of Differential Privacy for RCTs. (arXiv:2309.14581v1 [stat.AP])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.14581
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#35780;&#20272;&#20102;&#24046;&#20998;&#38544;&#31169;&#22312;RCT&#20013;&#30340;&#23454;&#29992;&#24615;&#65292;&#36890;&#36807;&#23454;&#35777;&#35780;&#20272;&#24378;&#38544;&#31169;&#20445;&#25252;&#26041;&#27861;&#23545;&#24050;&#21457;&#34920;&#30340;RCT&#20998;&#26512;&#30340;&#24433;&#21709;&#65292;&#24182;&#21457;&#29616;&#30456;&#23545;&#31616;&#21333;&#30340;&#22522;&#20110;&#24046;&#20998;&#38544;&#31169;&#30340;&#26041;&#27861;&#21487;&#20197;&#23454;&#29616;&#36825;&#19968;&#30446;&#26631;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38543;&#26426;&#23545;&#29031;&#35797;&#39564;&#65288;RCT&#65289;&#24050;&#25104;&#20026;&#35780;&#20272;&#24178;&#39044;&#25514;&#26045;&#21644;&#25919;&#31574;&#22312;&#35768;&#22810;&#39046;&#22495;&#20013;&#24433;&#21709;&#30340;&#24378;&#22823;&#24037;&#20855;&#12290;&#23427;&#20204;&#34987;&#35748;&#20026;&#26159;&#29983;&#29289;&#21307;&#23398;&#39046;&#22495;&#21644;&#35768;&#22810;&#31038;&#20250;&#31185;&#23398;&#39046;&#22495;&#25512;&#26029;&#30340;&#40644;&#37329;&#26631;&#20934;&#12290;&#30740;&#31350;&#20154;&#21592;&#24050;&#32463;&#21457;&#34920;&#20102;&#36234;&#26469;&#36234;&#22810;&#20381;&#36182;RCT&#36827;&#34892;&#25512;&#26029;&#30340;&#30740;&#31350;&#65292;&#36825;&#20123;&#30740;&#31350;&#36890;&#24120;&#21253;&#25324;&#32463;&#36807;&#21435;&#26631;&#35782;&#21270;&#21644;&#26377;&#26102;&#36890;&#36807;&#20256;&#32479;&#30340;&#25968;&#25454;&#25259;&#38706;&#38480;&#21046;&#26041;&#27861;&#20445;&#25252;&#30340;&#21709;&#24212;&#25968;&#25454;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#36890;&#36807;&#21033;&#29992;&#32463;&#27982;&#23398;&#21644;&#25919;&#31574;&#20998;&#26512;&#20013;&#30340;&#22797;&#21046;&#21253;&#65288;&#30740;&#31350;&#32508;&#36848;&#65289;&#26469;&#23454;&#35777;&#35780;&#20272;&#24378;&#38544;&#31169;&#20445;&#25252;&#26041;&#27861;&#65288;&#20855;&#26377;&#24046;&#20998;&#38544;&#31169;&#20445;&#35777;&#65289;&#23545;&#24050;&#21457;&#34920;&#30340;RCT&#20998;&#26512;&#30340;&#24433;&#21709;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#27169;&#25311;&#30740;&#31350;&#65292;&#24182;&#23637;&#31034;&#20102;&#22914;&#20309;&#22312;&#21508;&#31181;&#21442;&#25968;&#21270;&#26465;&#20214;&#19979;&#22797;&#21046;&#23545;&#38544;&#31169;&#20445;&#25252;&#25968;&#25454;&#30340;&#24050;&#21457;&#24067;&#32463;&#27982;&#23398;&#25991;&#31456;&#30340;&#20998;&#26512;&#12290;&#25105;&#20204;&#21457;&#29616;&#30456;&#23545;&#31616;&#21333;&#30340;&#22522;&#20110;&#24046;&#20998;&#38544;&#31169;&#30340;&#26041;&#27861;&#21487;&#20197;&#23454;&#29616;&#36825;&#19968;&#30446;&#26631;&#12290;
&lt;/p&gt;
&lt;p&gt;
Randomized control trials, RCTs, have become a powerful tool for assessing the impact of interventions and policies in many contexts. They are considered the gold-standard for inference in the biomedical fields and in many social sciences. Researchers have published an increasing number of studies that rely on RCTs for at least part of the inference, and these studies typically include the response data collected, de-identified and sometimes protected through traditional disclosure limitation methods. In this paper, we empirically assess the impact of strong privacy-preservation methodology (with \ac{DP} guarantees), on published analyses from RCTs, leveraging the availability of replication packages (research compendia) in economics and policy analysis. We provide simulations studies and demonstrate how we can replicate the analysis in a published economics article on privacy-protected data under various parametrizations. We find that relatively straightforward DP-based methods allow 
&lt;/p&gt;</description></item><item><title>&#22810;&#32500;&#27169;&#22411;&#20013;&#30340;&#26368;&#20248;&#20572;&#27490;&#38382;&#39064;&#19982;&#19968;&#32500;&#27169;&#22411;&#26377;&#26126;&#26174;&#21306;&#21035;&#65292;&#21253;&#25324;&#31454;&#20105;&#27604;&#30340;&#30456;&#21464;&#29616;&#35937;&#21644;&#38543;&#26426;&#39034;&#24207;&#19982;&#26368;&#22351;&#24773;&#20917;&#38382;&#39064;&#19978;&#30340;&#25913;&#36827;</title><link>http://arxiv.org/abs/2309.14555</link><description>&lt;p&gt;
&#20855;&#26377;&#22810;&#32500;&#27604;&#36739;&#25439;&#22833;&#21388;&#24694;&#30340;&#26368;&#20248;&#20572;&#27490;
&lt;/p&gt;
&lt;p&gt;
Optimal Stopping with Multi-Dimensional Comparative Loss Aversion. (arXiv:2309.14555v1 [cs.GT])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.14555
&lt;/p&gt;
&lt;p&gt;
&#22810;&#32500;&#27169;&#22411;&#20013;&#30340;&#26368;&#20248;&#20572;&#27490;&#38382;&#39064;&#19982;&#19968;&#32500;&#27169;&#22411;&#26377;&#26126;&#26174;&#21306;&#21035;&#65292;&#21253;&#25324;&#31454;&#20105;&#27604;&#30340;&#30456;&#21464;&#29616;&#35937;&#21644;&#38543;&#26426;&#39034;&#24207;&#19982;&#26368;&#22351;&#24773;&#20917;&#38382;&#39064;&#19978;&#30340;&#25913;&#36827;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#23613;&#31649;&#20855;&#26377;&#30456;&#21516;&#22522;&#26412;&#39044;&#35328;&#23478;&#19981;&#31561;&#24335;&#35774;&#32622;&#21644;&#25439;&#22833;&#21388;&#24694;&#27169;&#22411;&#65292;&#25105;&#20204;&#30340;&#22810;&#32500;&#27169;&#22411;&#30340;&#32467;&#35770;&#19982;Kleinberg&#31561;&#20154;&#30340;&#19968;&#32500;&#27169;&#22411;&#26377;&#24456;&#22823;&#21306;&#21035;&#12290;&#20363;&#22914;&#65292;Kleinberg&#31561;&#20154;&#32473;&#20986;&#20102;&#22312;&#32447;&#20915;&#31574;&#32773;&#21487;&#20197;&#36798;&#21040;&#30340;&#31454;&#20105;&#27604;&#30340;&#32039;&#23494;&#38381;&#21512;&#24418;&#24335;&#65292;&#20316;&#20026;$\lambda$&#30340;&#20989;&#25968;&#65292;&#23545;&#20110;&#20219;&#20309;$\lambda\geq 0$&#12290;&#22312;&#25105;&#20204;&#30340;&#22810;&#32500;&#27169;&#22411;&#20013;&#65292;&#23384;&#22312;&#19968;&#20010;&#26126;&#26174;&#30340;&#30456;&#21464;&#65306;&#22914;&#26524;$k$&#34920;&#31034;&#32500;&#24230;&#30340;&#25968;&#37327;&#65292;&#21017;&#24403;$\lambda\cdot (k-1)\geq 1$&#26102;&#65292;&#19981;&#21487;&#33021;&#26377;&#38750;&#24179;&#20961;&#30340;&#31454;&#20105;&#27604;&#12290;&#21478;&#19968;&#26041;&#38754;&#65292;&#24403;$\lambda\cdot (k-1) &lt; 1$&#26102;&#65292;&#25105;&#20204;&#32473;&#20986;&#20102;&#21487;&#36798;&#21040;&#30340;&#31454;&#20105;&#27604;&#30340;&#32039;&#23494;&#30028;&#38480;&#65288;&#31867;&#20284;&#20110;Kleinberg&#31561;&#20154;&#65289;&#12290;&#20316;&#20026;&#21478;&#19968;&#20010;&#20363;&#23376;&#65292;Kleinberg&#31561;&#20154;&#25581;&#31034;&#20102;&#38543;&#26426;&#39034;&#24207;&#19982;&#26368;&#22351;&#24773;&#20917;&#39044;&#35328;&#23478;&#19981;&#31561;&#24335;&#38382;&#39064;&#30340;&#31454;&#20105;&#27604;&#30340;&#25351;&#25968;&#25913;&#36827;&#12290;&#22312;&#25105;&#20204;&#30340;$k\geq 2$&#32500;&#27169;&#22411;&#20013;&#65292;&#24046;&#36317;&#26368;&#22810;&#20026;&#19968;&#20010;&#24120;&#25968;&#22240;&#23376;&#12290;&#25105;&#20204;&#25581;&#31034;&#20102;&#20960;&#20010;&#20854;&#20182;&#20851;&#38190;&#30340;&#24046;&#24322;&#12290;
&lt;/p&gt;
&lt;p&gt;
Despite having the same basic prophet inequality setup and model of loss aversion, conclusions in our multi-dimensional model differs considerably from the one-dimensional model of Kleinberg et al. For example, Kleinberg et al. gives a tight closed-form on the competitive ratio that an online decision-maker can achieve as a function of $\lambda$, for any $\lambda \geq 0$. In our multi-dimensional model, there is a sharp phase transition: if $k$ denotes the number of dimensions, then when $\lambda \cdot (k-1) \geq 1$, no non-trivial competitive ratio is possible. On the other hand, when $\lambda \cdot (k-1) &lt; 1$, we give a tight bound on the achievable competitive ratio (similar to Kleinberg et al.). As another example, Kleinberg et al. uncovers an exponential improvement in their competitive ratio for the random-order vs. worst-case prophet inequality problem. In our model with $k\geq 2$ dimensions, the gap is at most a constant-factor. We uncover several additional key differences in 
&lt;/p&gt;</description></item><item><title>&#36825;&#39033;&#30740;&#31350;&#22635;&#34917;&#20102;&#20851;&#20110;&#30005;&#23376;&#21830;&#21153;&#24179;&#21488;&#25512;&#33616;&#31639;&#27861;&#22312;&#31639;&#27861;&#21246;&#32467;&#30740;&#31350;&#20013;&#34987;&#24573;&#35270;&#30340;&#31354;&#30333;&#65292;&#24182;&#21457;&#29616;&#25512;&#33616;&#31639;&#27861;&#21487;&#20197;&#20915;&#23450;&#22522;&#20110;AI&#30340;&#23450;&#20215;&#31639;&#27861;&#30340;&#31454;&#20105;&#25110;&#21246;&#32467;&#21160;&#24577;&#12290;</title><link>http://arxiv.org/abs/2309.14548</link><description>&lt;p&gt;
&#31639;&#27861;&#21246;&#32467;&#36824;&#26159;&#31454;&#20105;&#65306;&#24179;&#21488;&#25512;&#33616;&#31995;&#32479;&#30340;&#35282;&#33394;
&lt;/p&gt;
&lt;p&gt;
Algorithmic Collusion or Competition: the Role of Platforms' Recommender Systems. (arXiv:2309.14548v1 [cs.AI])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.14548
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#30740;&#31350;&#22635;&#34917;&#20102;&#20851;&#20110;&#30005;&#23376;&#21830;&#21153;&#24179;&#21488;&#25512;&#33616;&#31639;&#27861;&#22312;&#31639;&#27861;&#21246;&#32467;&#30740;&#31350;&#20013;&#34987;&#24573;&#35270;&#30340;&#31354;&#30333;&#65292;&#24182;&#21457;&#29616;&#25512;&#33616;&#31639;&#27861;&#21487;&#20197;&#20915;&#23450;&#22522;&#20110;AI&#30340;&#23450;&#20215;&#31639;&#27861;&#30340;&#31454;&#20105;&#25110;&#21246;&#32467;&#21160;&#24577;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26368;&#36817;&#30340;&#23398;&#26415;&#30740;&#31350;&#24191;&#27867;&#25506;&#35752;&#20102;&#22522;&#20110;&#20154;&#24037;&#26234;&#33021;(AI)&#30340;&#21160;&#24577;&#23450;&#20215;&#31639;&#27861;&#23548;&#33268;&#30340;&#31639;&#27861;&#21246;&#32467;&#12290;&#28982;&#32780;&#65292;&#30005;&#23376;&#21830;&#21153;&#24179;&#21488;&#20351;&#29992;&#25512;&#33616;&#31639;&#27861;&#26469;&#20998;&#37197;&#19981;&#21516;&#20135;&#21697;&#30340;&#26333;&#20809;&#65292;&#32780;&#36825;&#19968;&#37325;&#35201;&#26041;&#38754;&#22312;&#20808;&#21069;&#30340;&#31639;&#27861;&#21246;&#32467;&#30740;&#31350;&#20013;&#34987;&#22823;&#37096;&#20998;&#24573;&#35270;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#22635;&#34917;&#20102;&#25991;&#29486;&#20013;&#36825;&#19968;&#37325;&#35201;&#30340;&#31354;&#30333;&#65292;&#24182;&#26816;&#39564;&#20102;&#25512;&#33616;&#31639;&#27861;&#22914;&#20309;&#20915;&#23450;&#22522;&#20110;AI&#30340;&#23450;&#20215;&#31639;&#27861;&#30340;&#31454;&#20105;&#25110;&#21246;&#32467;&#21160;&#24577;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#20004;&#31181;&#24120;&#29992;&#30340;&#25512;&#33616;&#31639;&#27861;&#65306;(i)&#20197;&#26368;&#22823;&#21270;&#21334;&#23478;&#24635;&#21033;&#28070;&#20026;&#30446;&#26631;&#30340;&#25512;&#33616;&#31995;&#32479;&#21644;(ii)&#20197;&#26368;&#22823;&#21270;&#24179;&#21488;&#19978;&#20135;&#21697;&#38656;&#27714;&#20026;&#30446;&#26631;&#30340;&#25512;&#33616;&#31995;&#32479;&#12290;&#25105;&#20204;&#26500;&#24314;&#20102;&#19968;&#20010;&#37325;&#22797;&#21338;&#24328;&#26694;&#26550;&#65292;&#23558;&#21334;&#23478;&#30340;&#23450;&#20215;&#31639;&#27861;&#21644;&#24179;&#21488;&#30340;&#25512;&#33616;&#31639;&#27861;&#36827;&#34892;&#20102;&#25972;&#21512;&#12290;
&lt;/p&gt;
&lt;p&gt;
Recent academic research has extensively examined algorithmic collusion resulting from the utilization of artificial intelligence (AI)-based dynamic pricing algorithms. Nevertheless, e-commerce platforms employ recommendation algorithms to allocate exposure to various products, and this important aspect has been largely overlooked in previous studies on algorithmic collusion. Our study bridges this important gap in the literature and examines how recommendation algorithms can determine the competitive or collusive dynamics of AI-based pricing algorithms. Specifically, two commonly deployed recommendation algorithms are examined: (i) a recommender system that aims to maximize the sellers' total profit (profit-based recommender system) and (ii) a recommender system that aims to maximize the demand for products sold on the platform (demand-based recommender system). We construct a repeated game framework that incorporates both pricing algorithms adopted by sellers and the platform's recom
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#36890;&#36807;&#20998;&#26512;iTunes&#38899;&#20048;&#21830;&#24215;&#20013;&#27468;&#26354;&#25688;&#24405;&#30340;&#20934;&#23454;&#39564;&#21464;&#21270;&#65292;&#21457;&#29616;&#24310;&#38271;&#25688;&#24405;&#26102;&#38388;&#21487;&#20197;&#26174;&#33879;&#22686;&#21152;&#27468;&#26354;&#30340;&#29420;&#31435;&#27599;&#26376;&#21548;&#20247;&#65292;&#29305;&#21035;&#26159;&#23545;&#20110;&#38476;&#29983;&#27468;&#26354;&#21644;&#38476;&#29983;&#33402;&#26415;&#23478;&#30340;&#25928;&#26524;&#26356;&#20026;&#26174;&#33879;&#12290;&#27492;&#22806;&#65292;&#25688;&#24405;&#30340;&#37325;&#22797;&#24615;&#21644;&#21487;&#39044;&#27979;&#24615;&#23545;&#38656;&#27714;&#30340;&#22686;&#24378;&#25928;&#26524;&#26377;&#19968;&#23450;&#30340;&#21387;&#21046;&#20316;&#29992;&#12290;&#22240;&#27492;&#65292;&#35813;&#30740;&#31350;&#25903;&#25345;&#24179;&#21488;&#37319;&#29992;&#26356;&#38271;&#30340;&#25688;&#24405;&#26102;&#38388;&#26469;&#25913;&#21892;&#20869;&#23481;&#21457;&#29616;&#12290;</title><link>http://arxiv.org/abs/2309.14475</link><description>&lt;p&gt;
&#35774;&#35745;&#26377;&#25928;&#30340;&#38899;&#20048;&#25688;&#24405;
&lt;/p&gt;
&lt;p&gt;
Designing Effective Music Excerpts. (arXiv:2309.14475v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.14475
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#36890;&#36807;&#20998;&#26512;iTunes&#38899;&#20048;&#21830;&#24215;&#20013;&#27468;&#26354;&#25688;&#24405;&#30340;&#20934;&#23454;&#39564;&#21464;&#21270;&#65292;&#21457;&#29616;&#24310;&#38271;&#25688;&#24405;&#26102;&#38388;&#21487;&#20197;&#26174;&#33879;&#22686;&#21152;&#27468;&#26354;&#30340;&#29420;&#31435;&#27599;&#26376;&#21548;&#20247;&#65292;&#29305;&#21035;&#26159;&#23545;&#20110;&#38476;&#29983;&#27468;&#26354;&#21644;&#38476;&#29983;&#33402;&#26415;&#23478;&#30340;&#25928;&#26524;&#26356;&#20026;&#26174;&#33879;&#12290;&#27492;&#22806;&#65292;&#25688;&#24405;&#30340;&#37325;&#22797;&#24615;&#21644;&#21487;&#39044;&#27979;&#24615;&#23545;&#38656;&#27714;&#30340;&#22686;&#24378;&#25928;&#26524;&#26377;&#19968;&#23450;&#30340;&#21387;&#21046;&#20316;&#29992;&#12290;&#22240;&#27492;&#65292;&#35813;&#30740;&#31350;&#25903;&#25345;&#24179;&#21488;&#37319;&#29992;&#26356;&#38271;&#30340;&#25688;&#24405;&#26102;&#38388;&#26469;&#25913;&#21892;&#20869;&#23481;&#21457;&#29616;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38899;&#20048;&#25688;&#24405;&#34987;&#24191;&#27867;&#29992;&#20110;&#39044;&#35272;&#21644;&#25512;&#24191;&#38899;&#20048;&#20316;&#21697;&#12290;&#26377;&#25928;&#30340;&#25688;&#24405;&#21487;&#20197;&#20419;&#20351;&#28304;&#38899;&#20048;&#20316;&#21697;&#30340;&#28040;&#36153;&#65292;&#20174;&#32780;&#20135;&#29983;&#25910;&#20837;&#12290;&#28982;&#32780;&#65292;&#20160;&#20040;&#20351;&#24471;&#25688;&#24405;&#26377;&#25928;&#20173;&#28982;&#26410;&#34987;&#25506;&#32034;&#12290;&#25105;&#20204;&#21033;&#29992;&#33529;&#26524;&#30340;&#19968;&#39033;&#25919;&#31574;&#21464;&#21270;&#65292;&#36890;&#36807;iTunes&#38899;&#20048;&#21830;&#24215;&#20013;&#27468;&#26354;&#25688;&#24405;&#30340;&#20934;&#23454;&#39564;&#21464;&#21270;&#65292;&#20272;&#35745;&#25688;&#24405;&#26102;&#38388;&#24310;&#38271;60&#31186;&#21487;&#20197;&#24179;&#22343;&#22686;&#21152;&#27468;&#26354;&#30340;&#29420;&#31435;&#27599;&#26376;&#21548;&#20247;5.4&#65285;&#65292;&#38476;&#29983;&#27468;&#26354;&#22686;&#21152;9.7&#65285;&#65292;&#38476;&#29983;&#33402;&#26415;&#23478;&#22686;&#21152;11.1&#65285;&#12290;&#36825;&#30456;&#24403;&#20110;&#34987;&#25910;&#24405;&#22312;Spotify&#20840;&#29699;Top 50&#25773;&#25918;&#21015;&#34920;&#20013;&#30340;&#24433;&#21709;&#12290;&#25105;&#20204;&#24320;&#21457;&#20102;&#38899;&#20048;&#37325;&#22797;&#24615;&#21644;&#19981;&#21487;&#39044;&#27979;&#24615;&#30340;&#34913;&#37327;&#25351;&#26631;&#65292;&#20197;&#32771;&#23519;&#20449;&#24687;&#25552;&#20379;&#20316;&#20026;&#19968;&#31181;&#26426;&#21046;&#65292;&#24182;&#21457;&#29616;&#24403;&#25688;&#24405;&#36807;&#20110;&#37325;&#22797;&#12289;&#36807;&#20110;&#21487;&#39044;&#27979;&#25110;&#36807;&#20110;&#19981;&#21487;&#39044;&#27979;&#26102;&#65292;&#24310;&#38271;&#25688;&#24405;&#26102;&#38388;&#23545;&#38656;&#27714;&#30340;&#22686;&#24378;&#25928;&#26524;&#20250;&#34987;&#21387;&#21046;&#12290;&#25105;&#20204;&#30340;&#21457;&#29616;&#25903;&#25345;&#24179;&#21488;&#37319;&#29992;&#26356;&#38271;&#30340;&#25688;&#24405;&#26469;&#25913;&#21892;&#20869;&#23481;&#21457;&#29616;&#65292;&#32780;&#25105;&#20204;&#30340;&#34913;&#37327;&#25351;&#26631;&#21487;&#20197;&#24110;&#21161;&#25552;&#20379;&#25688;&#24405;&#36873;&#25321;&#30340;&#20449;&#24687;&#12290;
&lt;/p&gt;
&lt;p&gt;
Excerpts are widely used to preview and promote musical works. Effective excerpts induce consumption of the source musical work and thus generate revenue. Yet, what makes an excerpt effective remains unexplored. We leverage a policy change by Apple that generates quasi-exogenous variation in the excerpts of songs in the iTunes Music Store to estimate that having a 60 second longer excerpt increases songs' unique monthly listeners by 5.4% on average, by 9.7% for lesser known songs, and by 11.1% for lesser known artists. This is comparable to the impact of being featured on the Spotify Global Top 50 playlist. We develop measures of musical repetition and unpredictability to examine information provision as a mechanism, and find that the demand-enhancing effect of longer excerpts is suppressed when they are repetitive, too predictable, or too unpredictable. Our findings support platforms' adoption of longer excerpts to improve content discovery and our measures can help inform excerpt sel
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#32771;&#34385;&#20102;&#22312;&#27809;&#26377;&#23545;&#29031;&#32452;&#30340;&#24773;&#20917;&#19979;&#20272;&#35745;&#21644;&#25512;&#26029;&#25919;&#31574;&#25928;&#26524;&#30340;&#38382;&#39064;&#12290;&#25105;&#20204;&#21033;&#29992;&#30701;&#26399;&#27835;&#30103;&#21069;&#25968;&#25454;&#65292;&#22522;&#20110;&#39044;&#27979;&#21453;&#20107;&#23454;&#24773;&#20917;&#24471;&#21040;&#20102;&#20010;&#20307;&#27835;&#30103;&#25928;&#26524;&#30340;&#26080;&#20559;&#20272;&#35745;&#21644;&#24179;&#22343;&#27835;&#30103;&#25928;&#26524;&#30340;&#19968;&#33268;&#19988;&#28176;&#36817;&#27491;&#24577;&#30340;&#20272;&#35745;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#20851;&#27880;&#39044;&#27979;&#30340;&#26080;&#20559;&#24615;&#32780;&#19981;&#26159;&#20934;&#30830;&#24615;&#26159;&#24456;&#37325;&#35201;&#30340;&#65292;&#32780;&#39044;&#27979;&#27169;&#22411;&#30340;&#27491;&#30830;&#35268;&#33539;&#24182;&#19981;&#26159;&#24517;&#38656;&#30340;&#65292;&#31616;&#21333;&#30340;&#22522;&#30784;&#20989;&#25968;&#22238;&#24402;&#21487;&#20197;&#36798;&#21040;&#26080;&#20559;&#20272;&#35745;&#12290;&#22312;&#19968;&#23450;&#26465;&#20214;&#19979;&#65292;&#25105;&#20204;&#30340;&#26041;&#27861;&#20855;&#26377;&#19968;&#33268;&#24615;&#21644;&#28176;&#36817;&#27491;&#24577;&#24615;&#12290;</title><link>http://arxiv.org/abs/2309.05639</link><description>&lt;p&gt;
&#39044;&#27979;&#27835;&#30103;&#25928;&#26524;
&lt;/p&gt;
&lt;p&gt;
Forecasted Treatment Effects. (arXiv:2309.05639v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.05639
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#32771;&#34385;&#20102;&#22312;&#27809;&#26377;&#23545;&#29031;&#32452;&#30340;&#24773;&#20917;&#19979;&#20272;&#35745;&#21644;&#25512;&#26029;&#25919;&#31574;&#25928;&#26524;&#30340;&#38382;&#39064;&#12290;&#25105;&#20204;&#21033;&#29992;&#30701;&#26399;&#27835;&#30103;&#21069;&#25968;&#25454;&#65292;&#22522;&#20110;&#39044;&#27979;&#21453;&#20107;&#23454;&#24773;&#20917;&#24471;&#21040;&#20102;&#20010;&#20307;&#27835;&#30103;&#25928;&#26524;&#30340;&#26080;&#20559;&#20272;&#35745;&#21644;&#24179;&#22343;&#27835;&#30103;&#25928;&#26524;&#30340;&#19968;&#33268;&#19988;&#28176;&#36817;&#27491;&#24577;&#30340;&#20272;&#35745;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#20851;&#27880;&#39044;&#27979;&#30340;&#26080;&#20559;&#24615;&#32780;&#19981;&#26159;&#20934;&#30830;&#24615;&#26159;&#24456;&#37325;&#35201;&#30340;&#65292;&#32780;&#39044;&#27979;&#27169;&#22411;&#30340;&#27491;&#30830;&#35268;&#33539;&#24182;&#19981;&#26159;&#24517;&#38656;&#30340;&#65292;&#31616;&#21333;&#30340;&#22522;&#30784;&#20989;&#25968;&#22238;&#24402;&#21487;&#20197;&#36798;&#21040;&#26080;&#20559;&#20272;&#35745;&#12290;&#22312;&#19968;&#23450;&#26465;&#20214;&#19979;&#65292;&#25105;&#20204;&#30340;&#26041;&#27861;&#20855;&#26377;&#19968;&#33268;&#24615;&#21644;&#28176;&#36817;&#27491;&#24577;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#32771;&#34385;&#22312;&#27809;&#26377;&#23545;&#29031;&#32452;&#30340;&#24773;&#20917;&#19979;&#20272;&#35745;&#21644;&#25512;&#26029;&#25919;&#31574;&#25928;&#26524;&#12290;&#25105;&#20204;&#22522;&#20110;&#20351;&#29992;&#19968;&#27573;&#30701;&#26399;&#27835;&#30103;&#21069;&#25968;&#25454;&#39044;&#27979;&#21453;&#20107;&#23454;&#24773;&#20917;&#65292;&#24471;&#21040;&#20102;&#20010;&#20307;&#65288;&#24322;&#36136;&#65289;&#27835;&#30103;&#25928;&#26524;&#30340;&#26080;&#20559;&#20272;&#35745;&#21644;&#19968;&#33268;&#19988;&#28176;&#36817;&#27491;&#24577;&#30340;&#24179;&#22343;&#27835;&#30103;&#25928;&#26524;&#20272;&#35745;&#12290;&#25105;&#20204;&#34920;&#26126;&#65292;&#24212;&#35813;&#20851;&#27880;&#39044;&#27979;&#26080;&#20559;&#24615;&#32780;&#19981;&#26159;&#20934;&#30830;&#24615;&#12290;&#23545;&#39044;&#27979;&#27169;&#22411;&#30340;&#27491;&#30830;&#35268;&#33539;&#24182;&#19981;&#26159;&#33719;&#24471;&#20010;&#20307;&#27835;&#30103;&#25928;&#26524;&#30340;&#26080;&#20559;&#20272;&#35745;&#25152;&#24517;&#38656;&#30340;&#12290;&#30456;&#21453;&#65292;&#22312;&#24191;&#27867;&#30340;&#25968;&#25454;&#29983;&#25104;&#36807;&#31243;&#19979;&#65292;&#31616;&#21333;&#30340;&#22522;&#30784;&#20989;&#25968;&#65288;&#22914;&#22810;&#39033;&#24335;&#26102;&#38388;&#36235;&#21183;&#65289;&#22238;&#24402;&#21487;&#20197;&#25552;&#20379;&#26080;&#20559;&#24615;&#26469;&#20272;&#35745;&#20010;&#20307;&#21453;&#20107;&#23454;&#24773;&#20917;&#12290;&#22522;&#20110;&#27169;&#22411;&#30340;&#39044;&#27979;&#21487;&#33021;&#24341;&#20837;&#35268;&#33539;&#38169;&#35823;&#20559;&#24046;&#65292;&#24182;&#19988;&#21363;&#20351;&#22312;&#27491;&#30830;&#35268;&#33539;&#19979;&#20063;&#19981;&#19968;&#23450;&#33021;&#25552;&#39640;&#24615;&#33021;&#12290;&#25105;&#20204;&#30340;&#39044;&#27979;&#24179;&#22343;&#27835;&#30103;&#25928;&#26524;&#65288;FAT&#65289;&#20272;&#35745;&#22120;&#30340;&#19968;&#33268;&#24615;&#21644;&#28176;&#36817;&#27491;&#24577;&#24615;&#22312;&#19968;&#23450;&#26465;&#20214;&#19979;&#24471;&#21040;&#20445;&#35777;&#12290;
&lt;/p&gt;
&lt;p&gt;
We consider estimation and inference of the effects of a policy in the absence of a control group. We obtain unbiased estimators of individual (heterogeneous) treatment effects and a consistent and asymptotically normal estimator of the average treatment effects, based on forecasting counterfactuals using a short time series of pre-treatment data. We show that the focus should be on forecast unbiasedness rather than accuracy. Correct specification of the forecasting model is not necessary to obtain unbiased estimates of individual treatment effects. Instead, simple basis function (e.g., polynomial time trends) regressions deliver unbiasedness under a broad class of data-generating processes for the individual counterfactuals. Basing the forecasts on a model can introduce misspecification bias and does not necessarily improve performance even under correct specification. Consistency and asymptotic normality of our Forecasted Average Treatment effects (FAT) estimator are attained under a
&lt;/p&gt;</description></item><item><title>ddml&#26159;Stata&#20013;&#30340;&#21452;&#37325;/&#26080;&#20559;&#26426;&#22120;&#23398;&#20064;&#21253;&#65292;&#25903;&#25345;&#20116;&#31181;&#19981;&#21516;&#35745;&#37327;&#27169;&#22411;&#30340;&#22240;&#26524;&#21442;&#25968;&#20272;&#35745;&#65292;&#21487;&#20197;&#28789;&#27963;&#20272;&#35745;&#20869;&#29983;&#21464;&#37327;&#30340;&#22240;&#26524;&#25928;&#24212;&#65292;&#22312;&#35768;&#22810;&#29616;&#26377;&#30417;&#30563;&#26426;&#22120;&#23398;&#20064;&#31243;&#24207;&#20013;&#20860;&#23481;&#12290;&#25512;&#33616;&#19982;&#22534;&#21472;&#20272;&#35745;&#32467;&#21512;&#20351;&#29992;&#65292;&#25552;&#20379;&#20102;&#33945;&#29305;&#21345;&#27931;&#35777;&#25454;&#25903;&#25345;&#12290;</title><link>http://arxiv.org/abs/2301.09397</link><description>&lt;p&gt;
ddml: Stata&#20013;&#30340;&#21452;&#37325;/&#26080;&#20559;&#26426;&#22120;&#23398;&#20064;
&lt;/p&gt;
&lt;p&gt;
ddml: Double/debiased machine learning in Stata. (arXiv:2301.09397v2 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2301.09397
&lt;/p&gt;
&lt;p&gt;
ddml&#26159;Stata&#20013;&#30340;&#21452;&#37325;/&#26080;&#20559;&#26426;&#22120;&#23398;&#20064;&#21253;&#65292;&#25903;&#25345;&#20116;&#31181;&#19981;&#21516;&#35745;&#37327;&#27169;&#22411;&#30340;&#22240;&#26524;&#21442;&#25968;&#20272;&#35745;&#65292;&#21487;&#20197;&#28789;&#27963;&#20272;&#35745;&#20869;&#29983;&#21464;&#37327;&#30340;&#22240;&#26524;&#25928;&#24212;&#65292;&#22312;&#35768;&#22810;&#29616;&#26377;&#30417;&#30563;&#26426;&#22120;&#23398;&#20064;&#31243;&#24207;&#20013;&#20860;&#23481;&#12290;&#25512;&#33616;&#19982;&#22534;&#21472;&#20272;&#35745;&#32467;&#21512;&#20351;&#29992;&#65292;&#25552;&#20379;&#20102;&#33945;&#29305;&#21345;&#27931;&#35777;&#25454;&#25903;&#25345;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#22312;Stata&#20013;&#24341;&#20837;&#20102;&#19968;&#20010;&#21517;&#20026;ddml&#30340;&#21253;&#65292;&#29992;&#20110;&#21452;&#37325;/&#26080;&#20559;&#26426;&#22120;&#23398;&#20064;&#65288;DDML&#65289;&#12290;&#25903;&#25345;&#20116;&#31181;&#19981;&#21516;&#35745;&#37327;&#27169;&#22411;&#30340;&#22240;&#26524;&#21442;&#25968;&#20272;&#35745;&#65292;&#20801;&#35768;&#22312;&#26410;&#30693;&#20989;&#25968;&#24418;&#24335;&#21644;/&#25110;&#35768;&#22810;&#22806;&#29983;&#21464;&#37327;&#30340;&#35774;&#32622;&#20013;&#28789;&#27963;&#20272;&#35745;&#20869;&#29983;&#21464;&#37327;&#30340;&#22240;&#26524;&#25928;&#24212;&#12290;ddml&#19982;Stata&#20013;&#30340;&#35768;&#22810;&#29616;&#26377;&#30417;&#30563;&#26426;&#22120;&#23398;&#20064;&#31243;&#24207;&#20860;&#23481;&#12290;&#25105;&#20204;&#25512;&#33616;&#23558;DDML&#19982;&#22534;&#21472;&#20272;&#35745;&#32467;&#21512;&#20351;&#29992;&#65292;&#23558;&#22810;&#20010;&#26426;&#22120;&#23398;&#20064;&#22120;&#32452;&#21512;&#25104;&#26368;&#32456;&#39044;&#27979;&#22120;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#33945;&#29305;&#21345;&#27931;&#35777;&#25454;&#26469;&#25903;&#25345;&#25105;&#20204;&#30340;&#24314;&#35758;&#12290;
&lt;/p&gt;
&lt;p&gt;
We introduce the package ddml for Double/Debiased Machine Learning (DDML) in Stata. Estimators of causal parameters for five different econometric models are supported, allowing for flexible estimation of causal effects of endogenous variables in settings with unknown functional forms and/or many exogenous variables. ddml is compatible with many existing supervised machine learning programs in Stata. We recommend using DDML in combination with stacking estimation which combines multiple machine learners into a final predictor. We provide Monte Carlo evidence to support our recommendation.
&lt;/p&gt;</description></item><item><title>&#22320;&#21306;&#33322;&#31354;&#20844;&#21496;&#30340;&#20849;&#21516;&#23376;&#25215;&#21253;&#19968;&#26041;&#38754;&#20250;&#23548;&#33268;&#26356;&#20302;&#30340;&#20215;&#26684;&#65292;&#21478;&#19968;&#26041;&#38754;&#20250;&#23548;&#33268;&#26356;&#39640;&#30340;&#20215;&#26684;&#65292;&#36825;&#34920;&#26126;&#22320;&#21306;&#33322;&#31354;&#20844;&#21496;&#30340;&#22686;&#38271;&#21487;&#33021;&#23545;&#33322;&#31354;&#19994;&#20135;&#29983;&#21453;&#31454;&#20105;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2301.05999</link><description>&lt;p&gt;
&#20849;&#21516;&#23376;&#25215;&#21253;&#21644;&#33322;&#31354;&#20215;&#26684;
&lt;/p&gt;
&lt;p&gt;
Common Subcontracting and Airline Prices. (arXiv:2301.05999v2 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2301.05999
&lt;/p&gt;
&lt;p&gt;
&#22320;&#21306;&#33322;&#31354;&#20844;&#21496;&#30340;&#20849;&#21516;&#23376;&#25215;&#21253;&#19968;&#26041;&#38754;&#20250;&#23548;&#33268;&#26356;&#20302;&#30340;&#20215;&#26684;&#65292;&#21478;&#19968;&#26041;&#38754;&#20250;&#23548;&#33268;&#26356;&#39640;&#30340;&#20215;&#26684;&#65292;&#36825;&#34920;&#26126;&#22320;&#21306;&#33322;&#31354;&#20844;&#21496;&#30340;&#22686;&#38271;&#21487;&#33021;&#23545;&#33322;&#31354;&#19994;&#20135;&#29983;&#21453;&#31454;&#20105;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#32654;&#22269;&#33322;&#31354;&#19994;&#20013;&#65292;&#29420;&#31435;&#30340;&#22320;&#21306;&#33322;&#31354;&#20844;&#21496;&#20195;&#34920;&#20960;&#23478;&#20840;&#22269;&#33322;&#31354;&#20844;&#21496;&#22312;&#19981;&#21516;&#30340;&#24066;&#22330;&#19978;&#20026;&#20056;&#23458;&#39134;&#34892;&#65292;&#36825;&#20135;&#29983;&#20102;&#8220;&#20849;&#21516;&#23376;&#25215;&#21253;&#8221;&#30340;&#24773;&#20917;&#12290;&#19968;&#26041;&#38754;&#65292;&#25105;&#20204;&#21457;&#29616;&#23376;&#25215;&#21253;&#19982;&#36739;&#20302;&#30340;&#20215;&#26684;&#26377;&#20851;&#65292;&#36825;&#31526;&#21512;&#22320;&#21306;&#33322;&#31354;&#20844;&#21496;&#27604;&#20027;&#35201;&#33322;&#31354;&#20844;&#21496;&#26356;&#20302;&#25104;&#26412;&#36816;&#36755;&#20056;&#23458;&#30340;&#24819;&#27861;&#12290;&#21478;&#19968;&#26041;&#38754;&#65292;&#25105;&#20204;&#21457;&#29616;&#8220;&#20849;&#21516;&#8221;&#23376;&#25215;&#21253;&#19982;&#26356;&#39640;&#30340;&#20215;&#26684;&#26377;&#20851;&#12290;&#36825;&#20004;&#31181;&#30456;&#20114;&#20914;&#31361;&#30340;&#25928;&#24212;&#34920;&#26126;&#65292;&#22320;&#21306;&#33322;&#31354;&#20844;&#21496;&#30340;&#22686;&#38271;&#21487;&#33021;&#23545;&#35813;&#34892;&#19994;&#20135;&#29983;&#21453;&#31454;&#20105;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
In the US airline industry, independent regional airlines fly passengers on behalf of several national airlines across different markets, giving rise to $\textit{common subcontracting}$. On the one hand, we find that subcontracting is associated with lower prices, consistent with the notion that regional airlines tend to fly passengers at lower costs than major airlines. On the other hand, we find that $\textit{common}$ subcontracting is associated with higher prices. These two countervailing effects suggest that the growth of regional airlines can have anticompetitive implications for the industry.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#34920;&#26126;&#65292;&#25216;&#33021;&#30340;&#20215;&#20540;&#24456;&#22823;&#31243;&#24230;&#19978;&#30001;&#20114;&#34917;&#24615;&#20915;&#23450;&#65292;&#22823;&#22810;&#25968;&#25216;&#33021;&#22312;&#19982;&#19981;&#21516;&#31867;&#22411;&#30340;&#25216;&#33021;&#32452;&#21512;&#20351;&#29992;&#26102;&#20215;&#20540;&#26368;&#39640;&#12290;&#20154;&#24037;&#26234;&#33021;&#25216;&#33021;&#30001;&#20110;&#20854;&#24378;&#22823;&#30340;&#20114;&#34917;&#24615;&#21644;&#36817;&#24180;&#26469;&#19981;&#26029;&#22686;&#38271;&#30340;&#38656;&#27714;&#65292;&#20854;&#20215;&#20540;&#23588;&#20026;&#31361;&#20986;&#65292;&#24179;&#22343;&#25552;&#39640;&#24037;&#20154;&#24037;&#36164;21&#65285;&#12290;</title><link>http://arxiv.org/abs/2210.01535</link><description>&lt;p&gt;
&#25216;&#33021;&#30340;&#20215;&#26684;&#26159;&#22810;&#23569;&#65311;&#20114;&#34917;&#24615;&#30340;&#20215;&#20540;
&lt;/p&gt;
&lt;p&gt;
What is the Price of a Skill? The Value of Complementarity. (arXiv:2210.01535v3 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2210.01535
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#34920;&#26126;&#65292;&#25216;&#33021;&#30340;&#20215;&#20540;&#24456;&#22823;&#31243;&#24230;&#19978;&#30001;&#20114;&#34917;&#24615;&#20915;&#23450;&#65292;&#22823;&#22810;&#25968;&#25216;&#33021;&#22312;&#19982;&#19981;&#21516;&#31867;&#22411;&#30340;&#25216;&#33021;&#32452;&#21512;&#20351;&#29992;&#26102;&#20215;&#20540;&#26368;&#39640;&#12290;&#20154;&#24037;&#26234;&#33021;&#25216;&#33021;&#30001;&#20110;&#20854;&#24378;&#22823;&#30340;&#20114;&#34917;&#24615;&#21644;&#36817;&#24180;&#26469;&#19981;&#26029;&#22686;&#38271;&#30340;&#38656;&#27714;&#65292;&#20854;&#20215;&#20540;&#23588;&#20026;&#31361;&#20986;&#65292;&#24179;&#22343;&#25552;&#39640;&#24037;&#20154;&#24037;&#36164;21&#65285;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20840;&#29699;&#21171;&#21160;&#21147;&#34987;&#25958;&#20419;&#19981;&#26029;&#25552;&#21319;&#33258;&#24049;&#30340;&#25216;&#33021;&#65292;&#22240;&#20026;&#25216;&#26415;&#21464;&#38761;&#20559;&#22909;&#26576;&#20123;&#26032;&#25216;&#33021;&#65292;&#21516;&#26102;&#20351;&#20854;&#20182;&#25216;&#33021;&#21464;&#24471;&#22810;&#20313;&#12290;&#20294;&#26159;&#23545;&#20110;&#24037;&#20154;&#21644;&#20844;&#21496;&#26469;&#35828;&#65292;&#21738;&#20123;&#25216;&#33021;&#26159;&#19968;&#20010;&#22909;&#30340;&#25237;&#36164;&#21602;&#65311;&#30001;&#20110;&#25216;&#33021;&#24456;&#23569;&#26159;&#23396;&#31435;&#24212;&#29992;&#30340;&#65292;&#25105;&#20204;&#25552;&#20986;&#20114;&#34917;&#24615;&#24378;&#28872;&#20915;&#23450;&#20102;&#25216;&#33021;&#30340;&#32463;&#27982;&#20215;&#20540;&#12290;&#25105;&#20204;&#23545;962&#31181;&#25216;&#33021;&#36827;&#34892;&#20102;&#30740;&#31350;&#65292;&#35777;&#26126;&#20102;&#23427;&#20204;&#30340;&#20215;&#20540;&#22312;&#24456;&#22823;&#31243;&#24230;&#19978;&#30001;&#20114;&#34917;&#24615;&#20915;&#23450;-&#21363;&#19968;&#20010;&#33021;&#21147;&#21487;&#20197;&#19982;&#22810;&#23569;&#19981;&#21516;&#30340;&#25216;&#33021;&#29702;&#24819;&#24773;&#20917;&#19979;&#32467;&#21512;&#65292;&#36825;&#20123;&#25216;&#33021;&#20855;&#26377;&#24456;&#39640;&#30340;&#20215;&#20540;&#12290;&#25105;&#20204;&#26174;&#31034;&#65292;&#25216;&#33021;&#30340;&#20215;&#20540;&#26159;&#30456;&#23545;&#30340;&#65292;&#22240;&#20026;&#23427;&#21462;&#20915;&#20110;&#24037;&#20154;&#30340;&#25216;&#33021;&#32972;&#26223;&#12290;&#23545;&#20110;&#22823;&#22810;&#25968;&#25216;&#33021;&#26469;&#35828;&#65292;&#24403;&#19982;&#19981;&#21516;&#31867;&#22411;&#30340;&#25216;&#33021;&#32452;&#21512;&#20351;&#29992;&#26102;&#65292;&#23427;&#20204;&#30340;&#20215;&#20540;&#26368;&#39640;&#12290;&#25105;&#20204;&#29992;&#19982;&#20154;&#24037;&#26234;&#33021;&#65288;AI&#65289;&#30456;&#20851;&#30340;&#25216;&#33021;&#38598;&#23545;&#25105;&#20204;&#30340;&#27169;&#22411;&#36827;&#34892;&#20102;&#27979;&#35797;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#20154;&#24037;&#26234;&#33021;&#25216;&#33021;&#23588;&#20854;&#26377;&#20215;&#20540;-&#24179;&#22343;&#25552;&#39640;&#24037;&#20154;&#24037;&#36164;21&#65285;-&#36825;&#26159;&#22240;&#20026;&#23427;&#20204;&#30340;&#20114;&#34917;&#24615;&#24378;&#22823;&#65292;&#24182;&#19988;&#36817;&#24180;&#26469;&#38656;&#27714;&#19981;&#26029;&#22686;&#21152;&#12290;&#27169;&#22411;&#21644;&#25351;&#26631;
&lt;/p&gt;
&lt;p&gt;
The global workforce is urged to constantly reskill, as technological change favours particular new skills while making others redundant. But which skills are a good investment for workers and firms? As skills are seldomly applied in isolation, we propose that complementarity strongly determines a skill's economic value. For 962 skills, we demonstrate that their value is strongly determined by complementarity - that is, how many different skills, ideally of high value, a competency can be combined with. We show that the value of a skill is relative, as it depends on the skill background of the worker. For most skills, their value is highest when used in combination with skills of a different type. We put our model to the test with a set of skills related to Artificial Intelligence (AI). We find that AI skills are particularly valuable - increasing worker wages by 21% on average - because of their strong complementarities and their rising demand in recent years. The model and metrics of
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#22238;&#24402;&#26029;&#28857;&#35774;&#35745;&#65288;RDD&#65289;&#20998;&#26512;&#20013;&#21487;&#33021;&#23384;&#22312;&#39640;&#32500;&#21327;&#21464;&#37327;&#30340;&#24773;&#20917;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#31283;&#23450;&#30340;&#20272;&#35745;&#21644;&#25512;&#26029;&#26041;&#27861;&#65292;&#21033;&#29992;&#26680;&#26435;&#37325;&#21644;$\ell_{1}$&#24809;&#32602;&#26469;&#22788;&#29702;&#39640;&#32500;&#21327;&#21464;&#37327;&#12290;&#23454;&#39564;&#32467;&#26524;&#34920;&#26126;&#35813;&#26041;&#27861;&#22312;&#21327;&#21464;&#37327;&#25968;&#37327;&#30340;&#21464;&#21270;&#19979;&#34920;&#29616;&#40065;&#26834;&#24615;&#65292;&#30456;&#23545;&#20110;&#20256;&#32479;&#30340;&#21327;&#21464;&#37327;&#35843;&#25972;&#20272;&#35745;&#22120;&#22312;&#26576;&#20123;&#24773;&#20917;&#19979;&#26356;&#26377;&#25928;&#12290;</title><link>http://arxiv.org/abs/2109.08351</link><description>&lt;p&gt;
&#21487;&#33021;&#26377;&#22810;&#20010;&#21327;&#21464;&#37327;&#30340;&#22238;&#24402;&#26029;&#28857;&#35774;&#35745;
&lt;/p&gt;
&lt;p&gt;
Regression Discontinuity Design with Potentially Many Covariates. (arXiv:2109.08351v3 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2109.08351
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22238;&#24402;&#26029;&#28857;&#35774;&#35745;&#65288;RDD&#65289;&#20998;&#26512;&#20013;&#21487;&#33021;&#23384;&#22312;&#39640;&#32500;&#21327;&#21464;&#37327;&#30340;&#24773;&#20917;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#31283;&#23450;&#30340;&#20272;&#35745;&#21644;&#25512;&#26029;&#26041;&#27861;&#65292;&#21033;&#29992;&#26680;&#26435;&#37325;&#21644;$\ell_{1}$&#24809;&#32602;&#26469;&#22788;&#29702;&#39640;&#32500;&#21327;&#21464;&#37327;&#12290;&#23454;&#39564;&#32467;&#26524;&#34920;&#26126;&#35813;&#26041;&#27861;&#22312;&#21327;&#21464;&#37327;&#25968;&#37327;&#30340;&#21464;&#21270;&#19979;&#34920;&#29616;&#40065;&#26834;&#24615;&#65292;&#30456;&#23545;&#20110;&#20256;&#32479;&#30340;&#21327;&#21464;&#37327;&#35843;&#25972;&#20272;&#35745;&#22120;&#22312;&#26576;&#20123;&#24773;&#20917;&#19979;&#26356;&#26377;&#25928;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22238;&#24402;&#26029;&#28857;&#35774;&#35745;&#65288;RDD&#65289;&#20998;&#26512;&#20013;&#21487;&#33021;&#23384;&#22312;&#39640;&#32500;&#21327;&#21464;&#37327;&#30340;&#24773;&#20917;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#22312;&#21327;&#21464;&#37327;&#36873;&#25321;&#26102;&#36827;&#34892;&#20272;&#35745;&#21644;&#25512;&#26029;&#30340;RDD&#27169;&#22411;&#30340;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#22312;&#21327;&#21464;&#37327;&#25968;&#37327;&#19981;&#35770;&#22914;&#20309;&#37117;&#33021;&#31283;&#23450;&#22320;&#36827;&#34892;&#12290;&#25152;&#25552;&#20986;&#30340;&#26041;&#27861;&#23558;&#20351;&#29992;&#26680;&#26435;&#37325;&#30340;&#23616;&#37096;&#26041;&#27861;&#19982;$\ell_{1}$&#24809;&#32602;&#30456;&#32467;&#21512;&#65292;&#20197;&#22788;&#29702;&#39640;&#32500;&#21327;&#21464;&#37327;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#29702;&#35770;&#21644;&#25968;&#20540;&#32467;&#26524;&#65292;&#20197;&#35828;&#26126;&#25152;&#25552;&#20986;&#26041;&#27861;&#30340;&#26377;&#29992;&#24615;&#12290;&#20174;&#29702;&#35770;&#19978;&#35762;&#65292;&#25105;&#20204;&#20998;&#21035;&#20026;&#28857;&#20272;&#35745;&#21644;&#25512;&#26029;&#26041;&#27861;&#25552;&#20379;&#20102;&#39118;&#38505;&#21644;&#35206;&#30422;&#29575;&#29305;&#24615;&#12290;&#22312;&#26576;&#20123;&#29305;&#27530;&#24773;&#20917;&#19979;&#65292;&#25152;&#25552;&#20986;&#30340;&#20272;&#35745;&#22120;&#22312;&#28385;&#36275;&#39069;&#22806;&#30340;&#31232;&#30095;&#26465;&#20214;&#30340;&#20195;&#20215;&#19979;&#27604;&#20256;&#32479;&#30340;&#21327;&#21464;&#37327;&#35843;&#25972;&#20272;&#35745;&#22120;&#26356;&#26377;&#25928;&#12290;&#20174;&#25968;&#20540;&#19978;&#30475;&#65292;&#25105;&#20204;&#30340;&#27169;&#25311;&#23454;&#39564;&#21644;&#23454;&#35777;&#20363;&#23376;&#34920;&#26126;&#20102;&#25152;&#25552;&#20986;&#26041;&#27861;&#23545;&#20110;&#21327;&#21464;&#37327;&#25968;&#37327;&#22312;&#20559;&#24046;&#21644;&#26041;&#24046;&#26041;&#38754;&#30340;&#31283;&#20581;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper studies the case of possibly high-dimensional covariates in the regression discontinuity design (RDD) analysis. In particular, we propose estimation and inference methods for the RDD models with covariate selection which perform stably regardless of the number of covariates. The proposed methods combine the local approach using kernel weights with $\ell_{1}$-penalization to handle high-dimensional covariates. We provide theoretical and numerical results which illustrate the usefulness of the proposed methods. Theoretically, we present risk and coverage properties for our point estimation and inference methods, respectively. Under certain special case, the proposed estimator becomes more efficient than the conventional covariate adjusted estimator at the cost of an additional sparsity condition. Numerically, our simulation experiments and empirical example show the robust behaviors of the proposed methods to the number of covariates in terms of bias and variance for point est
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#36890;&#29992;&#20844;&#24335;&#65292;&#31216;&#20026;&#28145;&#24230;&#29983;&#23384;&#21058;&#37327;&#21453;&#24212;&#20989;&#25968;&#65288;DeepSDRF&#65289;&#65292;&#29992;&#20110;&#35299;&#20915;&#20020;&#24202;&#29983;&#23384;&#25968;&#25454;&#20013;&#30340;&#36830;&#32493;&#27835;&#30103;&#25512;&#33616;&#38382;&#39064;&#12290;&#36890;&#36807;&#26657;&#27491;&#36873;&#25321;&#20559;&#24046;&#65292;DeepSDRF&#20272;&#35745;&#30340;&#27835;&#30103;&#25928;&#26524;&#21487;&#20197;&#29992;&#20110;&#24320;&#21457;&#25512;&#33616;&#31639;&#27861;&#12290;&#22312;&#27169;&#25311;&#30740;&#31350;&#21644;&#23454;&#38469;&#21307;&#23398;&#25968;&#25454;&#24211;&#19978;&#30340;&#27979;&#35797;&#20013;&#65292;DeepSDRF&#34920;&#29616;&#20986;&#33391;&#22909;&#30340;&#24615;&#33021;&#12290;</title><link>http://arxiv.org/abs/2108.10453</link><description>&lt;p&gt;
&#28145;&#24230;&#29983;&#23384;&#21058;&#37327;&#21453;&#24212;&#20989;&#25968;&#30340;&#36830;&#32493;&#27835;&#30103;&#25512;&#33616;
&lt;/p&gt;
&lt;p&gt;
Continuous Treatment Recommendation with Deep Survival Dose Response Function. (arXiv:2108.10453v5 [stat.ML] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2108.10453
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#36890;&#29992;&#20844;&#24335;&#65292;&#31216;&#20026;&#28145;&#24230;&#29983;&#23384;&#21058;&#37327;&#21453;&#24212;&#20989;&#25968;&#65288;DeepSDRF&#65289;&#65292;&#29992;&#20110;&#35299;&#20915;&#20020;&#24202;&#29983;&#23384;&#25968;&#25454;&#20013;&#30340;&#36830;&#32493;&#27835;&#30103;&#25512;&#33616;&#38382;&#39064;&#12290;&#36890;&#36807;&#26657;&#27491;&#36873;&#25321;&#20559;&#24046;&#65292;DeepSDRF&#20272;&#35745;&#30340;&#27835;&#30103;&#25928;&#26524;&#21487;&#20197;&#29992;&#20110;&#24320;&#21457;&#25512;&#33616;&#31639;&#27861;&#12290;&#22312;&#27169;&#25311;&#30740;&#31350;&#21644;&#23454;&#38469;&#21307;&#23398;&#25968;&#25454;&#24211;&#19978;&#30340;&#27979;&#35797;&#20013;&#65292;DeepSDRF&#34920;&#29616;&#20986;&#33391;&#22909;&#30340;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#22312;&#20020;&#24202;&#29983;&#23384;&#25968;&#25454;&#35774;&#32622;&#20013;&#30340;&#36830;&#32493;&#27835;&#30103;&#25512;&#33616;&#38382;&#39064;&#30340;&#36890;&#29992;&#20844;&#24335;&#65292;&#31216;&#20026;&#28145;&#24230;&#29983;&#23384;&#21058;&#37327;&#21453;&#24212;&#20989;&#25968;&#65288;DeepSDRF&#65289;&#12290;&#20063;&#23601;&#26159;&#35828;&#65292;&#25105;&#20204;&#32771;&#34385;&#20174;&#21382;&#21490;&#25968;&#25454;&#20013;&#20165;&#20165;&#36890;&#36807;&#35266;&#23519;&#21040;&#30340;&#22240;&#32032;&#65288;&#28151;&#26434;&#22240;&#23376;&#65289;&#23545;&#35266;&#23519;&#21040;&#30340;&#27835;&#30103;&#21644;&#20107;&#20214;&#21457;&#29983;&#26102;&#38388;&#32467;&#26524;&#37117;&#26377;&#24433;&#21709;&#30340;&#26465;&#20214;&#24179;&#22343;&#21058;&#37327;&#21453;&#24212;&#65288;CADR&#65289;&#20989;&#25968;&#30340;&#23398;&#20064;&#38382;&#39064;&#12290;&#20174;DeepSDRF&#20013;&#20272;&#35745;&#30340;&#27835;&#30103;&#25928;&#26524;&#20351;&#25105;&#20204;&#33021;&#22815;&#24320;&#21457;&#20855;&#26377;&#36873;&#25321;&#20559;&#24046;&#26657;&#27491;&#30340;&#25512;&#33616;&#31639;&#27861;&#12290;&#25105;&#20204;&#27604;&#36739;&#20102;&#22522;&#20110;&#38543;&#26426;&#25628;&#32034;&#21644;&#24378;&#21270;&#23398;&#20064;&#30340;&#20004;&#31181;&#25512;&#33616;&#26041;&#27861;&#65292;&#24182;&#21457;&#29616;&#22312;&#24739;&#32773;&#32467;&#26524;&#26041;&#38754;&#34920;&#29616;&#30456;&#20284;&#12290;&#25105;&#20204;&#22312;&#22823;&#37327;&#30340;&#27169;&#25311;&#30740;&#31350;&#21644;eICU&#30740;&#31350;&#26426;&#26500;&#65288;eRI&#65289;&#25968;&#25454;&#24211;&#19978;&#27979;&#35797;&#20102;DeepSDRF&#21644;&#30456;&#24212;&#30340;&#25512;&#33616;&#22120;&#12290;&#25454;&#25105;&#20204;&#25152;&#30693;&#65292;&#36825;&#26159;&#39318;&#27425;&#22312;&#21307;&#23398;&#32972;&#26223;&#19979;&#20351;&#29992;&#22240;&#26524;&#27169;&#22411;&#26469;&#35299;&#20915;&#35266;&#23519;&#25968;&#25454;&#20013;&#30340;&#36830;&#32493;&#27835;&#30103;&#25928;&#24212;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;
We propose a general formulation for continuous treatment recommendation problems in settings with clinical survival data, which we call the Deep Survival Dose Response Function (DeepSDRF). That is, we consider the problem of learning the conditional average dose response (CADR) function solely from historical data in which observed factors (confounders) affect both observed treatment and time-to-event outcomes. The estimated treatment effect from DeepSDRF enables us to develop recommender algorithms with the correction for selection bias. We compared two recommender approaches based on random search and reinforcement learning and found similar performance in terms of patient outcome. We tested the DeepSDRF and the corresponding recommender on extensive simulation studies and the eICU Research Institute (eRI) database. To the best of our knowledge, this is the first time that causal models are used to address the continuous treatment effect with observational data in a medical context.
&lt;/p&gt;</description></item><item><title>&#25991;&#31456;&#20351;&#29992;&#32929;&#19996;&#22823;&#20250;&#26102;&#38388;&#24046;&#24322;&#30340;&#26041;&#27861;&#30740;&#31350;&#20102;&#32929;&#19996;&#20559;&#22909;&#21644;&#23545;&#20844;&#21496;&#21033;&#20182;&#20915;&#31574;&#30340;&#24433;&#21709;&#65292;&#21457;&#29616;&#36861;&#27714;&#65288;&#26576;&#20123;&#65289;&#32929;&#19996;&#30340;&#20215;&#20540;&#20855;&#26377;&#20998;&#37197;&#25104;&#26412;&#65292;&#20294;&#22823;&#32929;&#19996;&#30340;&#30417;&#25511;&#21487;&#20197;&#36991;&#20813;&#36825;&#31181;&#30001;&#20559;&#22909;&#24322;&#36136;&#24615;&#39537;&#21160;&#30340;&#25104;&#26412;&#12290;</title><link>http://arxiv.org/abs/2103.12138</link><description>&lt;p&gt;
&#36861;&#27714;&#32929;&#19996;&#20215;&#20540;&#30340;&#20849;&#21516;&#25104;&#26412;
&lt;/p&gt;
&lt;p&gt;
The Shared Cost of Pursuing Shareholder Value. (arXiv:2103.12138v9 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2103.12138
&lt;/p&gt;
&lt;p&gt;
&#25991;&#31456;&#20351;&#29992;&#32929;&#19996;&#22823;&#20250;&#26102;&#38388;&#24046;&#24322;&#30340;&#26041;&#27861;&#30740;&#31350;&#20102;&#32929;&#19996;&#20559;&#22909;&#21644;&#23545;&#20844;&#21496;&#21033;&#20182;&#20915;&#31574;&#30340;&#24433;&#21709;&#65292;&#21457;&#29616;&#36861;&#27714;&#65288;&#26576;&#20123;&#65289;&#32929;&#19996;&#30340;&#20215;&#20540;&#20855;&#26377;&#20998;&#37197;&#25104;&#26412;&#65292;&#20294;&#22823;&#32929;&#19996;&#30340;&#30417;&#25511;&#21487;&#20197;&#36991;&#20813;&#36825;&#31181;&#30001;&#20559;&#22909;&#24322;&#36136;&#24615;&#39537;&#21160;&#30340;&#25104;&#26412;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#37319;&#29992;&#20934;&#23454;&#39564;&#24615;&#30340;&#26041;&#27861;&#65292;&#26681;&#25454;&#20844;&#21496;&#32929;&#19996;&#22823;&#20250;&#65288;AGMs&#65289;&#30340;&#26102;&#38388;&#24046;&#24322;&#65292;&#25552;&#20986;&#20102;&#19968;&#20010;&#21487;&#31227;&#26893;&#30340;&#26694;&#26550;&#65292;&#25512;&#26029;&#32929;&#19996;&#30340;&#20559;&#22909;&#21644;&#23545;&#20844;&#21496;&#21033;&#20182;&#20915;&#31574;&#30340;&#24433;&#21709;&#65292;&#24182;&#23558;&#20854;&#24212;&#29992;&#20110;covid&#30456;&#20851;&#25424;&#36192;&#12289;&#26368;&#36817;&#38024;&#23545;&#20420;&#32599;&#26031;&#30340;&#31169;&#20154;&#21046;&#35009;&#20197;&#21450;&#20844;&#21496;2012-19&#24180;&#30340;&#21033;&#20182;&#31435;&#22330;&#12290;AGMs&#30340;&#23186;&#20307;&#26333;&#20809;&#24102;&#26469;&#30340;&#24418;&#35937;&#25910;&#30410;&#65292;&#20351;&#24471;&#19982;&#20844;&#21496;&#21516;&#20041;&#30340;&#32929;&#19996;&#65288;&#22914;&#23494;&#20999;&#30456;&#20851;&#30340;&#20010;&#20154;&#65289;&#25903;&#25345;&#26114;&#36149;&#30340;&#21033;&#20182;&#21464;&#38761;&#65292;&#32780;&#20854;&#20182;&#32929;&#19996;&#65288;&#22914;&#37329;&#34701;&#20844;&#21496;&#65289;&#21453;&#23545;&#36825;&#20123;&#21464;&#38761;&#12290;&#25903;&#25345;&#36825;&#20123;&#21464;&#38761;&#30340;&#24433;&#21709;&#20351;&#25910;&#30410;&#19979;&#38477;&#20102;30&#65285;&#65306;&#36861;&#27714;&#65288;&#26576;&#20123;&#65289;&#32929;&#19996;&#30340;&#20215;&#20540;&#20855;&#26377;&#20998;&#37197;&#25104;&#26412;&#65292;&#22823;&#32929;&#19996;&#30340;&#30417;&#25511;&#21487;&#20197;&#36991;&#20813;&#30001;&#20559;&#22909;&#24322;&#36136;&#24615;&#39537;&#21160;&#30340;&#25104;&#26412;&#12290;
&lt;/p&gt;
&lt;p&gt;
Using quasi-experimental variations from the timing of firms' Annual General Meetings (AGMs), we propose a portable framework to infer shareholders' preferences and influences on firms' prosocial decisions and apply it to covid-related donations, recent private sanctions on Russia, and firms' prosocial stances over 2012-19. Image gains from AGMs' media exposure drive shareholders synonymous with a firm, like closely-connected individuals, to support costly prosocial changes, while others, like financial corporations, oppose them. Influence supporting these changes lowers earnings by 30\%: pursuing the values of (some) shareholders has distributional costs, which the monitoring of large shareholders motivated by heterogeneous preferences could prevent.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#38548;&#24320;&#24335;&#35797;&#39564;&#30340;&#26368;&#20248;&#35774;&#35745;&#38382;&#39064;&#12290;&#23545;&#20110;&#38750;&#33258;&#36866;&#24212;&#23454;&#39564;&#65292;&#25552;&#20986;&#20102;&#19968;&#20010;&#36817;&#20284;&#26368;&#20248;&#35299;&#65307;&#23545;&#20110;&#33258;&#36866;&#24212;&#23454;&#39564;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#31639;&#27861;&#8212;&#8212;&#31934;&#24230;&#23548;&#21521;&#30340;&#33258;&#36866;&#24212;&#23454;&#39564;&#65288;PGAE&#65289;&#31639;&#27861;&#65292;&#23427;&#20351;&#29992;&#36125;&#21494;&#26031;&#20915;&#31574;&#29702;&#35770;&#26469;&#26368;&#22823;&#21270;&#20272;&#35745;&#27835;&#30103;&#25928;&#26524;&#30340;&#39044;&#26399;&#31934;&#24230;&#12290;</title><link>http://arxiv.org/abs/1911.03764</link><description>&lt;p&gt;
&#38548;&#24320;&#24335;&#35797;&#39564;&#30340;&#26368;&#20248;&#35774;&#35745;
&lt;/p&gt;
&lt;p&gt;
Optimal Experimental Design for Staggered Rollouts. (arXiv:1911.03764v5 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/1911.03764
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#38548;&#24320;&#24335;&#35797;&#39564;&#30340;&#26368;&#20248;&#35774;&#35745;&#38382;&#39064;&#12290;&#23545;&#20110;&#38750;&#33258;&#36866;&#24212;&#23454;&#39564;&#65292;&#25552;&#20986;&#20102;&#19968;&#20010;&#36817;&#20284;&#26368;&#20248;&#35299;&#65307;&#23545;&#20110;&#33258;&#36866;&#24212;&#23454;&#39564;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#31639;&#27861;&#8212;&#8212;&#31934;&#24230;&#23548;&#21521;&#30340;&#33258;&#36866;&#24212;&#23454;&#39564;&#65288;PGAE&#65289;&#31639;&#27861;&#65292;&#23427;&#20351;&#29992;&#36125;&#21494;&#26031;&#20915;&#31574;&#29702;&#35770;&#26469;&#26368;&#22823;&#21270;&#20272;&#35745;&#27835;&#30103;&#25928;&#26524;&#30340;&#39044;&#26399;&#31934;&#24230;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#19981;&#21516;&#26102;&#26399;&#20869;&#26576;&#32452;&#25968;&#25454;&#21333;&#20803;&#30340;&#27835;&#30103;&#24320;&#22987;&#26102;&#38388;&#23384;&#22312;&#24046;&#24322;&#26102;&#65292;&#23545;&#23454;&#39564;&#36827;&#34892;&#35774;&#35745;&#21644;&#20998;&#26512;&#30340;&#38382;&#39064;&#12290;&#35774;&#35745;&#38382;&#39064;&#28041;&#21450;&#36873;&#25321;&#27599;&#20010;&#25968;&#25454;&#21333;&#20803;&#30340;&#21021;&#22987;&#27835;&#30103;&#26102;&#38388;&#20197;&#20415;&#26368;&#31934;&#30830;&#22320;&#20272;&#35745;&#27835;&#30103;&#30340;&#30636;&#26102;&#25928;&#24212;&#21644;&#32047;&#31215;&#25928;&#24212;&#12290;&#25105;&#20204;&#39318;&#20808;&#32771;&#34385;&#38750;&#33258;&#36866;&#24212;&#23454;&#39564;&#65292;&#20854;&#20013;&#25152;&#26377;&#30340;&#27835;&#30103;&#20998;&#37197;&#20915;&#31574;&#37117;&#22312;&#23454;&#39564;&#24320;&#22987;&#20043;&#21069;&#20570;&#20986;&#12290;&#38024;&#23545;&#36825;&#31181;&#24773;&#20917;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#20248;&#21270;&#38382;&#39064;&#36890;&#24120;&#26159;NP&#38590;&#30340;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#36817;&#20284;&#26368;&#20248;&#35299;&#12290;&#22312;&#35813;&#35299;&#20915;&#26041;&#26696;&#19979;&#65292;&#27599;&#20010;&#26102;&#26399;&#36827;&#20837;&#27835;&#30103;&#30340;&#20998;&#25968;&#26368;&#21021;&#36739;&#20302;&#65292;&#28982;&#21518;&#21464;&#39640;&#65292;&#26368;&#21518;&#20877;&#27425;&#38477;&#20302;&#12290;&#25509;&#19979;&#26469;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#33258;&#36866;&#24212;&#23454;&#39564;&#35774;&#35745;&#38382;&#39064;&#65292;&#20854;&#20013;&#22312;&#25910;&#38598;&#27599;&#20010;&#26102;&#26399;&#30340;&#25968;&#25454;&#21518;&#26356;&#26032;&#32487;&#32493;&#23454;&#39564;&#21644;&#27835;&#30103;&#20998;&#37197;&#20915;&#31574;&#12290;&#23545;&#20110;&#33258;&#36866;&#24212;&#24773;&#20917;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#31639;&#27861;&#8212;&#8212;&#31934;&#24230;&#23548;&#21521;&#30340;&#33258;&#36866;&#24212;&#23454;&#39564;&#65288;PGAE&#65289;&#31639;&#27861;&#65292;&#23427;&#20351;&#29992;&#36125;&#21494;&#26031;&#20915;&#31574;&#29702;&#35770;&#26469;&#26368;&#22823;&#21270;&#20272;&#35745;&#27835;&#30103;&#25928;&#26524;&#30340;&#39044;&#26399;&#31934;&#24230;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;PGAE&#31639;&#27861;&#36798;&#21040;&#20102;&#24724;&#24680;&#30340;&#19979;&#38480;&#65292;&#24724;&#24680;&#23450;&#20041;&#20026;&#26399;&#26395;&#32047;&#35745;&#24179;&#26041;&#26631;&#20934;&#35823;&#24046;&#21644;&#20219;&#24847;&#27835;&#30103;&#20998;&#37197;&#31574;&#30053;&#25152;&#33021;&#23454;&#29616;&#30340;&#26368;&#20339;&#35823;&#24046;&#20043;&#38388;&#30340;&#24046;&#24322;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this paper, we study the design and analysis of experiments conducted on a set of units over multiple time periods where the starting time of the treatment may vary by unit. The design problem involves selecting an initial treatment time for each unit in order to most precisely estimate both the instantaneous and cumulative effects of the treatment. We first consider non-adaptive experiments, where all treatment assignment decisions are made prior to the start of the experiment. For this case, we show that the optimization problem is generally NP-hard, and we propose a near-optimal solution. Under this solution, the fraction entering treatment each period is initially low, then high, and finally low again. Next, we study an adaptive experimental design problem, where both the decision to continue the experiment and treatment assignment decisions are updated after each period's data is collected. For the adaptive case, we propose a new algorithm, the Precision-Guided Adaptive Experim
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#24341;&#20837;&#20102;&#19968;&#20010;&#32479;&#19968;&#30340;&#26694;&#26550;&#65292;&#31216;&#20026;&#21512;&#20316;&#24191;&#20041;&#24418;&#24335;&#21338;&#24328;&#65292;&#35299;&#20915;&#20102;&#32852;&#30431;&#24418;&#25104;&#21160;&#21147;&#23398;&#30340;&#22797;&#26434;&#38382;&#39064;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#35299;&#20915;&#26041;&#26696;&#27010;&#24565;&#65292;&#21512;&#20316;&#22343;&#34913;&#31995;&#32479;(CES)&#12290;&#27599;&#20010;&#21512;&#20316;&#24191;&#20041;&#24418;&#24335;&#21338;&#24328;&#37117;&#23384;&#22312;&#19968;&#20010;CES&#65292;&#23545;&#20110;&#23436;&#20840;&#20449;&#24687;&#30340;&#28216;&#25103;&#65292;&#35777;&#26126;&#26159;&#26500;&#36896;&#24615;&#30340;&#12290;</title><link>http://arxiv.org/abs/1808.06750</link><description>&lt;p&gt;
&#20914;&#31361;&#19982;&#21512;&#20316;&#30340;&#31574;&#30053;
&lt;/p&gt;
&lt;p&gt;
The strategy of conflict and cooperation. (arXiv:1808.06750v7 [econ.TH] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/1808.06750
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#24341;&#20837;&#20102;&#19968;&#20010;&#32479;&#19968;&#30340;&#26694;&#26550;&#65292;&#31216;&#20026;&#21512;&#20316;&#24191;&#20041;&#24418;&#24335;&#21338;&#24328;&#65292;&#35299;&#20915;&#20102;&#32852;&#30431;&#24418;&#25104;&#21160;&#21147;&#23398;&#30340;&#22797;&#26434;&#38382;&#39064;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#35299;&#20915;&#26041;&#26696;&#27010;&#24565;&#65292;&#21512;&#20316;&#22343;&#34913;&#31995;&#32479;(CES)&#12290;&#27599;&#20010;&#21512;&#20316;&#24191;&#20041;&#24418;&#24335;&#21338;&#24328;&#37117;&#23384;&#22312;&#19968;&#20010;CES&#65292;&#23545;&#20110;&#23436;&#20840;&#20449;&#24687;&#30340;&#28216;&#25103;&#65292;&#35777;&#26126;&#26159;&#26500;&#36896;&#24615;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#24341;&#20837;&#20102;&#19968;&#20010;&#32479;&#19968;&#30340;&#26694;&#26550;&#65292;&#31216;&#20026;&#21512;&#20316;&#24191;&#20041;&#24418;&#24335;&#21338;&#24328;&#65292;&#23427;&#26082;&#27010;&#25324;&#20102;&#26631;&#20934;&#30340;&#38750;&#21512;&#20316;&#21338;&#24328;&#65292;&#21448;&#20801;&#35768;&#27604;&#20043;&#21069;&#30340;&#27010;&#24565;&#22914;&#32852;&#30431;&#31283;&#23450;&#32435;&#20160;&#22343;&#34913;&#26356;&#22797;&#26434;&#30340;&#32852;&#30431;&#24418;&#25104;&#21160;&#21147;&#23398;&#12290;&#35813;&#26694;&#26550;&#30340;&#26680;&#24515;&#26159;&#19968;&#31181;&#26032;&#39062;&#30340;&#35299;&#20915;&#26041;&#26696;&#27010;&#24565;&#65292;&#31216;&#20026;&#21512;&#20316;&#22343;&#34913;&#31995;&#32479;(CES)&#12290;CES&#22312;&#20004;&#20010;&#37325;&#35201;&#26041;&#38754;&#19982;&#32435;&#20160;&#22343;&#34913;&#19981;&#21516;&#12290;&#39318;&#20808;&#65292;CES&#23545;&#20110;&#21333;&#26041;&#21644;&#22810;&#26041;&#30340;&#8220;&#21487;&#20449;&#8221;&#30340;&#20559;&#31163;&#37117;&#26159;&#20813;&#30123;&#30340;&#12290;&#20854;&#27425;&#65292;&#19982;&#32435;&#20160;&#22343;&#34913;&#19981;&#21516;&#65292;&#20854;&#31283;&#23450;&#24615;&#20381;&#36182;&#20110;&#20551;&#35774;&#38750;&#20559;&#31163;&#29609;&#23478;&#30340;&#31574;&#30053;&#20445;&#25345;&#19981;&#21464;&#65292;CES&#20801;&#35768;&#29609;&#23478;&#21487;&#33021;&#37325;&#26032;&#32452;&#21512;&#21644;&#35843;&#25972;&#31574;&#30053;&#20197;&#24212;&#23545;&#20559;&#31163;&#12290;&#20027;&#35201;&#32467;&#26524;&#34920;&#26126;&#65292;&#27599;&#20010;&#21512;&#20316;&#24191;&#20041;&#24418;&#24335;&#21338;&#24328;&#65292;&#21487;&#33021;&#20855;&#26377;&#19981;&#23436;&#20840;&#20449;&#24687;&#65292;&#37117;&#23384;&#22312;&#19968;&#20010;CES&#12290;&#23545;&#20110;&#23436;&#20840;&#20449;&#24687;&#30340;&#28216;&#25103;&#65292;&#35777;&#26126;&#26159;&#26500;&#36896;&#24615;&#30340;&#12290;&#36825;&#20010;&#26694;&#26550;&#22312;&#23521;&#22836;&#31561;&#21508;&#31181;&#32972;&#26223;&#19979;&#37117;&#26159;&#24191;&#27867;&#36866;&#29992;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper introduces a unified framework called cooperative extensive form games, which (i) generalizes standard non-cooperative games, and (ii) allows for more complex coalition formation dynamics than previous concepts like coalition-proof Nash equilibrium. Central to this framework is a novel solution concept called cooperative equilibrium system (CES). CES differs from Nash equilibrium in two important respects. First, a CES is immune to both unilateral and multilateral `credible' deviations. Second, unlike Nash equilibrium, whose stability relies on the assumption that the strategies of non-deviating players are held fixed, CES allows for the possibility that players may regroup and adjust their strategies in response to a deviation. The main result establishes that every cooperative extensive form game, possibly with imperfect information, possesses a CES. For games with perfect information, the proof is constructive. This framework is broadly applicable in contexts such as olig
&lt;/p&gt;</description></item></channel></rss>