<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#26412;&#30740;&#31350;&#21033;&#29992;&#20013;&#22269;30&#20010;&#30465;&#20221;&#30340;&#38754;&#26495;&#25968;&#25454;&#65292;&#25581;&#31034;&#20102;&#25919;&#24220;&#29615;&#20445;&#20851;&#27880;&#23545;&#30899;&#25490;&#25918;&#30340;&#24433;&#21709;&#20197;&#21450;&#25919;&#24220;&#29615;&#20445;&#20851;&#27880;&#21644;&#20449;&#24687;&#21270;&#27700;&#24179;&#20043;&#38388;&#30340;&#21327;&#21516;&#26426;&#21046;&#12290;&#32467;&#26524;&#34920;&#26126;&#25919;&#24220;&#30340;&#29615;&#20445;&#20851;&#27880;&#21487;&#20197;&#20419;&#36827;&#30899;&#20943;&#25490;&#65292;&#22312;&#35199;&#37096;&#22320;&#21306;&#25928;&#26524;&#26356;&#26174;&#33879;&#12290;</title><link>http://arxiv.org/abs/2306.13436</link><description>&lt;p&gt;
&#25919;&#24220;&#30340;&#29615;&#20445;&#20851;&#27880;&#26159;&#21542;&#20250;&#20419;&#36827;&#30899;&#20943;&#25490;&#65311;
&lt;/p&gt;
&lt;p&gt;
Does Environmental Attention by Governments Promote Carbon Reductions. (arXiv:2306.13436v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.13436
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#21033;&#29992;&#20013;&#22269;30&#20010;&#30465;&#20221;&#30340;&#38754;&#26495;&#25968;&#25454;&#65292;&#25581;&#31034;&#20102;&#25919;&#24220;&#29615;&#20445;&#20851;&#27880;&#23545;&#30899;&#25490;&#25918;&#30340;&#24433;&#21709;&#20197;&#21450;&#25919;&#24220;&#29615;&#20445;&#20851;&#27880;&#21644;&#20449;&#24687;&#21270;&#27700;&#24179;&#20043;&#38388;&#30340;&#21327;&#21516;&#26426;&#21046;&#12290;&#32467;&#26524;&#34920;&#26126;&#25919;&#24220;&#30340;&#29615;&#20445;&#20851;&#27880;&#21487;&#20197;&#20419;&#36827;&#30899;&#20943;&#25490;&#65292;&#22312;&#35199;&#37096;&#22320;&#21306;&#25928;&#26524;&#26356;&#26174;&#33879;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20851;&#27880;&#24230;&#23545;&#20110;&#20943;&#23569;&#30899;&#25490;&#25918;&#30340;&#25928;&#26524;&#27604;&#29289;&#36136;&#36164;&#28304;&#26356;&#20026;&#31232;&#32570;&#65292;&#32780;&#24403;&#25919;&#24220;&#23558;&#20851;&#27880;&#21147;&#38598;&#20013;&#22312;&#29615;&#22659;&#26041;&#38754;&#26102;&#65292;&#36164;&#28304;&#23558;&#20250;&#34987;&#20998;&#37197;&#21040;&#26377;&#21161;&#20110;&#20943;&#23569;&#30899;&#25490;&#25918;&#30340;&#26041;&#21521;&#12290;&#26412;&#30740;&#31350;&#20351;&#29992;2007&#24180;&#33267;2019&#24180;&#20013;&#22269;30&#20010;&#30465;&#20221;&#30340;&#38754;&#26495;&#25968;&#25454;&#25581;&#31034;&#20102;&#25919;&#24220;&#29615;&#20445;&#20851;&#27880;&#23545;&#30899;&#25490;&#25918;&#30340;&#24433;&#21709;&#20197;&#21450;&#25919;&#24220;&#29615;&#20445;&#20851;&#27880;&#19982;&#20449;&#24687;&#21270;&#27700;&#24179;&#20043;&#38388;&#30340;&#21327;&#21516;&#26426;&#21046;&#12290;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65306;&#65288;1&#65289;&#20013;&#22269;&#22320;&#26041;&#25919;&#24220;&#30340;&#29615;&#20445;&#20851;&#27880;&#25351;&#25968;&#21576;&#24635;&#20307;&#19978;&#21319;&#36235;&#21183;&#65307;&#65288;2&#65289;&#25919;&#24220;&#30340;&#29615;&#20445;&#20851;&#27880;&#23545;&#20943;&#23569;&#30899;&#25490;&#25918;&#20855;&#26377;&#20316;&#29992;&#65307;&#65288;3&#65289;&#25919;&#24220;&#30340;&#29615;&#20445;&#20851;&#27880;&#20943;&#25490;&#25928;&#26524;&#22312;&#35199;&#37096;&#22320;&#21306;&#26356;&#20026;&#26174;&#33879;&#65292;&#20294;&#22312;&#20013;&#37096;&#21644;&#19996;&#37096;&#22320;&#21306;&#19981;&#26126;&#26174;&#65307;&#65288;4&#65289;&#20449;&#24687;&#21270;&#27700;&#24179;&#22312;&#25919;&#24220;&#29615;&#20445;&#20851;&#27880;&#21644;&#30899;&#20943;&#25490;&#20043;&#38388;&#30340;&#20851;&#31995;&#20013;&#36215;&#21040;&#20102;&#31215;&#26497;&#30340;&#35843;&#33410;&#20316;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;
The carbon-reducing effect of attention is scarcer than that of material resources, and when the government focuses its attention on the environment, resources will be allocated in a direction that is conducive to reducing carbon. Using panel data from 30 Chinese provinces from 2007 to 2019, this study revealed the impact of governments' environmental attention on carbon emissions and the synergistic mechanism between governments' environmental attention and informatization level. The findings suggested that (1)the environmental attention index of local governments in China showed an overall fluctuating upward trend; (2)governments' environmental atten-tion had the effect of reducing carbon emissions; (3)the emission-reducing effect of governments' environmental attention is more significant in the western region but not in the central and eastern regions; (4)informatization level plays a positive moderating role in the relationship between governments' environmental attention and carb
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#20351;&#29992;copulas&#27169;&#22411;&#26469;&#24314;&#27169;&#39640;&#32500;&#26085;&#20869;&#30005;&#21147;&#24066;&#22330;&#20215;&#26684;&#22238;&#25253;&#21521;&#37327;&#30340;&#30456;&#20851;&#32467;&#26500;&#65292;&#29992;&#20197;&#39044;&#27979;&#20215;&#26684;&#12290;&#37319;&#29992;&#38646;&#33192;&#32960;Johnson&#30340;S_U&#20998;&#24067;&#26469;&#24314;&#27169;&#36793;&#38469;&#20998;&#24067;&#65292;&#37319;&#29992;&#28508;&#22312;&#36125;&#22612;&#22238;&#24402;&#26469;&#24314;&#27169;&#20381;&#36182;&#32467;&#26500;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;&#35813;&#26041;&#27861;&#21487;&#20197;&#26174;&#33879;&#25552;&#39640;&#39044;&#27979;&#31934;&#24230;&#12290;</title><link>http://arxiv.org/abs/2306.13419</link><description>&lt;p&gt;
&#22522;&#20110;&#22810;&#20803;&#27169;&#25311;&#30340;&#36328;&#21697;&#31181;&#30005;&#21147;&#24066;&#22330;&#20215;&#26684;&#24433;&#21709;&#24314;&#27169;&#30340;&#39044;&#27979;
&lt;/p&gt;
&lt;p&gt;
Multivariate Simulation-based Forecasting for Intraday Power Markets: Modelling Cross-Product Price Effects. (arXiv:2306.13419v1 [q-fin.ST])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.13419
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20351;&#29992;copulas&#27169;&#22411;&#26469;&#24314;&#27169;&#39640;&#32500;&#26085;&#20869;&#30005;&#21147;&#24066;&#22330;&#20215;&#26684;&#22238;&#25253;&#21521;&#37327;&#30340;&#30456;&#20851;&#32467;&#26500;&#65292;&#29992;&#20197;&#39044;&#27979;&#20215;&#26684;&#12290;&#37319;&#29992;&#38646;&#33192;&#32960;Johnson&#30340;S_U&#20998;&#24067;&#26469;&#24314;&#27169;&#36793;&#38469;&#20998;&#24067;&#65292;&#37319;&#29992;&#28508;&#22312;&#36125;&#22612;&#22238;&#24402;&#26469;&#24314;&#27169;&#20381;&#36182;&#32467;&#26500;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;&#35813;&#26041;&#27861;&#21487;&#20197;&#26174;&#33879;&#25552;&#39640;&#39044;&#27979;&#31934;&#24230;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38543;&#30528;&#21487;&#20877;&#29983;&#33021;&#28304;&#36164;&#28304;&#30340;&#38388;&#27463;&#24615;&#21457;&#30005;&#30340;&#22686;&#21152;&#65292;&#26085;&#20869;&#30005;&#21147;&#24066;&#22330;&#22312;&#24179;&#34913;&#33021;&#28304;&#20379;&#38656;&#26041;&#38754;&#36215;&#30528;&#36234;&#26469;&#36234;&#37325;&#35201;&#30340;&#20316;&#29992;&#65292;&#36825;&#23601;&#38656;&#35201;&#20934;&#30830;&#30340;&#27010;&#29575;&#20215;&#26684;&#39044;&#27979;&#12290;&#28982;&#32780;&#65292;&#36804;&#20170;&#20026;&#27490;&#30340;&#30740;&#31350;&#37117;&#38598;&#20013;&#22312;&#21333;&#21464;&#37327;&#26041;&#27861;&#19978;&#65292;&#32780;&#22312;&#35768;&#22810;&#27431;&#27954;&#26085;&#20869;&#30005;&#21147;&#24066;&#22330;&#20013;&#65292;&#25152;&#26377;&#20132;&#21106;&#26399;&#37117;&#21516;&#26102;&#20132;&#26131;&#12290;&#22240;&#27492;&#65292;&#19981;&#21516;&#20132;&#26131;&#20135;&#21697;&#20043;&#38388;&#30340;&#20381;&#36182;&#32467;&#26500;&#21644;&#30456;&#24212;&#30340;&#20132;&#21449;&#20135;&#21697;&#24433;&#21709;&#26159;&#19981;&#33021;&#24573;&#35270;&#30340;&#12290;&#26412;&#25991;&#37319;&#29992;copulas&#27169;&#22411;&#26469;&#24314;&#27169;&#39640;&#32500;&#26085;&#20869;&#20215;&#26684;&#22238;&#25253;&#21521;&#37327;&#30340;&#30456;&#20851;&#32467;&#26500;&#12290;&#25105;&#20204;&#23558;&#36793;&#38469;&#20998;&#24067;&#24314;&#27169;&#20026;&#38646;&#33192;&#32960;Johnson&#30340;S_U&#20998;&#24067;&#65292;&#20854;&#20301;&#32622;&#12289;&#23610;&#24230;&#21644;&#24418;&#29366;&#21442;&#25968;&#21462;&#20915;&#20110;&#24066;&#22330;&#21644;&#22522;&#26412;&#25968;&#25454;&#12290;&#37319;&#29992;&#28508;&#22312;&#36125;&#22612;&#22238;&#24402;&#26469;&#24314;&#27169;&#20381;&#36182;&#32467;&#26500;&#65292;&#20197;&#35299;&#20915;&#26085;&#20869;&#30005;&#21147;&#24066;&#22330;&#30340;&#29305;&#23450;&#24066;&#22330;&#32467;&#26500;&#38382;&#39064;&#65292;&#20363;&#22914;&#19981;&#21516;&#20132;&#21106;&#26399;&#30340;&#20132;&#26131;&#20250;&#26377;&#37325;&#21472;&#20294;&#29420;&#31435;&#30340;&#20132;&#26131;&#20250;&#35805;&#12290;&#25105;&#20204;&#30340;&#32467;&#26524;&#34920;&#26126;&#65292;&#19982;&#25991;&#29486;&#20013;&#24120;&#29992;&#30340;&#21333;&#21464;&#37327;&#26041;&#27861;&#30456;&#27604;&#65292;&#25105;&#20204;&#22522;&#20110;&#22810;&#20803;copula&#30340;&#26041;&#27861;&#21487;&#20197;&#26174;&#33879;&#25552;&#39640;&#26085;&#20869;&#20215;&#26684;&#39044;&#27979;&#31934;&#24230;&#12290;
&lt;/p&gt;
&lt;p&gt;
Intraday electricity markets play an increasingly important role in balancing the intermittent generation of renewable energy resources, which creates a need for accurate probabilistic price forecasts. However, research to date has focused on univariate approaches, while in many European intraday electricity markets all delivery periods are traded in parallel. Thus, the dependency structure between different traded products and the corresponding cross-product effects cannot be ignored. We aim to fill this gap in the literature by using copulas to model the high-dimensional intraday price return vector. We model the marginal distribution as a zero-inflated Johnson's $S_U$ distribution with location, scale and shape parameters that depend on market and fundamental data. The dependence structure is modelled using latent beta regression to account for the particular market structure of the intraday electricity market, such as overlapping but independent trading sessions for different deliv
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#32479;&#19968;&#30340;&#26694;&#26550;&#65292;&#36890;&#36807;&#26368;&#22823;&#21270;&#32435;&#20160;&#20056;&#31215;&#12289;&#26368;&#23567;&#36873;&#25321;&#27010;&#29575;&#25110;&#38543;&#26426;&#20018;&#34892;&#29420;&#35009;&#31561;&#31639;&#27861;&#65292;&#22312;&#20108;&#20803;&#20559;&#22909;&#26465;&#20214;&#19979;&#65292;&#20844;&#24179;&#22320;&#36873;&#25321;&#26368;&#20248;&#35299;&#65292;&#35299;&#20915;&#20102;&#20351;&#29992;&#25972;&#25968;&#32447;&#24615;&#35268;&#21010;&#20570;&#20986;&#30495;&#27491;&#20844;&#24179;&#20915;&#31574;&#30340;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2306.13383</link><description>&lt;p&gt;
&#20108;&#20803;&#20559;&#22909;&#26465;&#20214;&#19979;&#20844;&#24179;&#25972;&#25968;&#35268;&#21010;
&lt;/p&gt;
&lt;p&gt;
Fair integer programming under dichotomous preferences. (arXiv:2306.13383v1 [cs.GT])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.13383
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#32479;&#19968;&#30340;&#26694;&#26550;&#65292;&#36890;&#36807;&#26368;&#22823;&#21270;&#32435;&#20160;&#20056;&#31215;&#12289;&#26368;&#23567;&#36873;&#25321;&#27010;&#29575;&#25110;&#38543;&#26426;&#20018;&#34892;&#29420;&#35009;&#31561;&#31639;&#27861;&#65292;&#22312;&#20108;&#20803;&#20559;&#22909;&#26465;&#20214;&#19979;&#65292;&#20844;&#24179;&#22320;&#36873;&#25321;&#26368;&#20248;&#35299;&#65292;&#35299;&#20915;&#20102;&#20351;&#29992;&#25972;&#25968;&#32447;&#24615;&#35268;&#21010;&#20570;&#20986;&#30495;&#27491;&#20844;&#24179;&#20915;&#31574;&#30340;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38500;&#38750;&#25511;&#21046;&#25152;&#36873;&#26368;&#20248;&#35299;&#30340;&#36873;&#25321;&#27010;&#29575;&#65292;&#21542;&#21017;&#20351;&#29992;&#25972;&#25968;&#32447;&#24615;&#35268;&#21010;&#26080;&#27861;&#20570;&#20986;&#30495;&#27491;&#20844;&#24179;&#30340;&#20915;&#31574;&#12290;&#20026;&#27492;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#32479;&#19968;&#30340;&#26694;&#26550;&#65292;&#24403;&#20108;&#20803;&#20915;&#31574;&#21464;&#37327;&#20195;&#34920;&#20855;&#26377;&#20108;&#20803;&#20559;&#22909;&#30340;&#20195;&#29702;&#26102;&#65292;&#20182;&#20204;&#21482;&#20851;&#24515;&#26159;&#21542;&#22312;&#26368;&#32456;&#35299;&#20013;&#34987;&#36873;&#20013;&#12290;&#25105;&#20204;&#24320;&#21457;&#20102;&#20960;&#31181;&#36890;&#29992;&#30340;&#31639;&#27861;&#26469;&#20844;&#24179;&#22320;&#36873;&#25321;&#26368;&#20248;&#35299;&#65292;&#20363;&#22914;&#36890;&#36807;&#26368;&#22823;&#21270;&#32435;&#20160;&#20056;&#31215;&#25110;&#26368;&#23567;&#36873;&#25321;&#27010;&#29575;&#65292;&#25110;&#20351;&#29992;&#20195;&#29702;&#20154;&#30340;&#38543;&#26426;&#25490;&#24207;&#20316;&#20026;&#36873;&#25321;&#26631;&#20934;&#65288;&#38543;&#26426;&#20018;&#34892;&#29420;&#35009;&#65289;&#12290;&#22240;&#27492;&#65292;&#25105;&#20204;&#23558;&#35299;&#20915;&#25972;&#25968;&#32447;&#24615;&#35268;&#21010;&#30340;&#40657;&#30418;&#23376;&#31243;&#24207;&#23884;&#20837;&#20102;&#19968;&#20010;&#20174;&#22836;&#21040;&#23614;&#37117;&#21487;&#20197;&#35299;&#37322;&#30340;&#26694;&#26550;&#20013;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#23558;&#25105;&#20204;&#30340;&#26694;&#26550;&#23884;&#20837;&#21040;&#21512;&#20316;&#35848;&#21028;&#21644;&#27010;&#29575;&#31038;&#20250;&#36873;&#25321;&#30340;&#20016;&#23500;&#25991;&#29486;&#20013;&#26469;&#30740;&#31350;&#25152;&#25552;&#20986;&#30340;&#26041;&#27861;&#30340;&#20844;&#29702;&#29305;&#24615;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#23545;&#29305;&#23450;&#24212;&#29992;&#20013;&#30340;&#25552;&#20986;&#30340;&#26041;&#27861;&#36827;&#34892;&#20102;&#35780;&#20272;&#12290;
&lt;/p&gt;
&lt;p&gt;
One cannot make truly fair decisions using integer linear programs unless one controls the selection probabilities of the (possibly many) optimal solutions. For this purpose, we propose a unified framework when binary decision variables represent agents with dichotomous preferences, who only care about whether they are selected in the final solution. We develop several general-purpose algorithms to fairly select optimal solutions, for example, by maximizing the Nash product or the minimum selection probability, or by using a random ordering of the agents as a selection criterion (Random Serial Dictatorship). As such, we embed the black-box procedure of solving an integer linear program into a framework that is explainable from start to finish. Moreover, we study the axiomatic properties of the proposed methods by embedding our framework into the rich literature of cooperative bargaining and probabilistic social choice. Lastly, we evaluate the proposed methods on a specific application,
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22240;&#23376;&#22686;&#24378;&#30340;&#31232;&#30095;MIDAS&#22238;&#24402;&#27169;&#22411;&#30340;&#20272;&#35745;&#22120;&#65292;&#36825;&#31181;&#26041;&#27861;&#33021;&#22815;&#22312;COVID-19&#22823;&#27969;&#34892;&#26399;&#38388;&#25552;&#39640;&#23545;&#32654;&#22269;GDP&#22686;&#38271;&#29575;&#30340;&#39044;&#27979;&#31934;&#24230;&#65292;&#24182;&#25552;&#20379;&#20102;&#19968;&#31181;&#36879;&#26126;&#21644;&#21487;&#35299;&#37322;&#30340;&#26041;&#27861;&#26469;&#30830;&#23450;&#20851;&#38190;&#39044;&#27979;&#22240;&#23376;&#12290;</title><link>http://arxiv.org/abs/2306.13362</link><description>&lt;p&gt;
&#22240;&#23376;&#22686;&#24378;&#30340;&#31232;&#30095;MIDAS&#22238;&#24402;&#22312;&#29616;&#22312;&#39044;&#27979;&#26041;&#38754;&#30340;&#24212;&#29992;
&lt;/p&gt;
&lt;p&gt;
Factor-augmented sparse MIDAS regression for nowcasting. (arXiv:2306.13362v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.13362
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22240;&#23376;&#22686;&#24378;&#30340;&#31232;&#30095;MIDAS&#22238;&#24402;&#27169;&#22411;&#30340;&#20272;&#35745;&#22120;&#65292;&#36825;&#31181;&#26041;&#27861;&#33021;&#22815;&#22312;COVID-19&#22823;&#27969;&#34892;&#26399;&#38388;&#25552;&#39640;&#23545;&#32654;&#22269;GDP&#22686;&#38271;&#29575;&#30340;&#39044;&#27979;&#31934;&#24230;&#65292;&#24182;&#25552;&#20379;&#20102;&#19968;&#31181;&#36879;&#26126;&#21644;&#21487;&#35299;&#37322;&#30340;&#26041;&#27861;&#26469;&#30830;&#23450;&#20851;&#38190;&#39044;&#27979;&#22240;&#23376;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#26088;&#22312;&#35843;&#26597;&#26159;&#21542;&#36890;&#36807;&#23558;&#65288;&#20272;&#35745;&#30340;&#65289;&#22240;&#23376;&#28155;&#21152;&#21040;&#31232;&#30095;&#22238;&#24402;&#20013;&#21487;&#20197;&#25913;&#21892;&#29616;&#22312;&#39044;&#27979;&#36136;&#37327;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#22240;&#23376;&#22686;&#24378;&#30340;&#31232;&#30095;MIDAS&#22238;&#24402;&#27169;&#22411;&#30340;&#20272;&#35745;&#22120;&#65292;&#24182;&#22312;&#26102;&#38388;&#24207;&#21015;&#24773;&#20917;&#19979;&#25512;&#23548;&#20102;&#20272;&#35745;&#22120;&#30340;&#25910;&#25947;&#29575;&#65292;&#32771;&#34385;&#20102;$\tau$&#28151;&#21512;&#36807;&#31243;&#21644;&#37325;&#23614;&#20998;&#24067;&#12290;&#35813;&#26032;&#25216;&#26415;&#24212;&#29992;&#20110;&#39044;&#27979;&#32654;&#22269;&#22269;&#20869;&#29983;&#20135;&#24635;&#20540;&#22686;&#38271;&#29575;&#65292;&#25581;&#31034;&#20102;&#19968;&#20123;&#37325;&#35201;&#21457;&#29616;&#12290;&#25105;&#20204;&#30340;&#26032;&#25216;&#26415;&#22312;2008&#24180;Q1&#21040;2022&#24180;Q2&#30340;&#29305;&#23450;&#26102;&#26399;&#20869;&#26174;&#33879;&#25552;&#39640;&#20102;&#29616;&#22312;&#39044;&#27979;&#30340;&#36136;&#37327;&#65292;&#30456;&#23545;&#20110;&#31232;&#30095;&#22238;&#24402;&#21644;&#26080;&#22240;&#23376;&#22686;&#24378;&#22238;&#24402;&#22522;&#20934;&#12290;&#36825;&#31181;&#25552;&#39640;&#22312;COVID&#27969;&#34892;&#26399;&#38388;&#23588;&#20854;&#26126;&#26174;&#65292;&#34920;&#26126;&#35813;&#27169;&#22411;&#33021;&#22815;&#25429;&#25417;&#21040;&#30123;&#24773;&#24341;&#20837;&#30340;&#29305;&#23450;&#21160;&#24577;&#12290;&#26377;&#36259;&#30340;&#26159;&#65292;&#20272;&#35745;&#30340;&#31232;&#30095;&#22240;&#23376;&#25552;&#20379;&#20102;&#19968;&#31181;&#31616;&#27905;&#32780;&#26377;&#25928;&#30340;&#26041;&#24335;&#26469;&#24635;&#32467;&#39640;&#32500;&#20449;&#24687;&#20197;&#36827;&#34892;&#29616;&#22312;&#39044;&#27979;&#65292;&#32780;&#31232;&#30095;&#31995;&#25968;&#25552;&#20379;&#20102;&#19968;&#31181;&#36879;&#26126;&#19988;&#21487;&#35299;&#37322;&#30340;&#26041;&#27861;&#26469;&#30830;&#23450;&#25512;&#21160;&#29616;&#22312;&#39044;&#27979;&#30340;&#20851;&#38190;&#39044;&#27979;&#22240;&#23376;&#12290;
&lt;/p&gt;
&lt;p&gt;
GDP nowcasting commonly employs either sparse regression or a dense approach based on factor models, which differ in the way they extract information from high-dimensional datasets. This paper aims to investigate whether augmenting sparse regression with (estimated) factors can improve nowcasts. We propose an estimator for a factor-augmented sparse MIDAS regression model. The rates of convergence of the estimator are derived in a time series context, accounting for $\tau$-mixing processes and fat-tailed distributions.  The application of this new technique to nowcast US GDP growth reveals several key findings. Firstly, our novel technique significantly improves the quality of nowcasts compared to both sparse regression and plain factor-augmented regression benchmarks over a period period from 2008 Q1 to 2022 Q2. This improvement is particularly pronounced during the COVID pandemic, indicating the model's ability to capture the specific dynamics introduced by the pandemic. Interestingly
&lt;/p&gt;</description></item><item><title>&#35813;&#30740;&#31350;&#27979;&#37327;&#20102;&#25910;&#20837;&#20914;&#20987;&#23545;&#28040;&#36153;&#20445;&#38505;&#30340;&#24433;&#21709;&#31243;&#24230;&#65292;&#35777;&#23454;&#23614;&#37096;&#25910;&#20837;&#39118;&#38505;&#23545;&#28040;&#36153;&#20855;&#26377;&#37325;&#35201;&#24433;&#21709;&#65292;&#25910;&#20837;&#36127;&#38754;&#20914;&#20987;&#23545;&#28040;&#36153;&#30340;&#20256;&#23548;&#29575;&#22823;&#20110;&#27491;&#38754;&#20914;&#20987;&#12290;</title><link>http://arxiv.org/abs/2306.13208</link><description>&lt;p&gt;
&#22312;&#23614;&#37096;&#25910;&#20837;&#39118;&#38505;&#30340;&#23384;&#22312;&#19979;&#65292;&#28040;&#36153;&#37096;&#20998;&#20445;&#38505;
&lt;/p&gt;
&lt;p&gt;
Consumption Partial Insurance in the Presence of Tail Income Risk. (arXiv:2306.13208v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.13208
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#27979;&#37327;&#20102;&#25910;&#20837;&#20914;&#20987;&#23545;&#28040;&#36153;&#20445;&#38505;&#30340;&#24433;&#21709;&#31243;&#24230;&#65292;&#35777;&#23454;&#23614;&#37096;&#25910;&#20837;&#39118;&#38505;&#23545;&#28040;&#36153;&#20855;&#26377;&#37325;&#35201;&#24433;&#21709;&#65292;&#25910;&#20837;&#36127;&#38754;&#20914;&#20987;&#23545;&#28040;&#36153;&#30340;&#20256;&#23548;&#29575;&#22823;&#20110;&#27491;&#38754;&#20914;&#20987;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#36890;&#36807;&#32771;&#34385;&#25910;&#20837;&#20998;&#24067;&#39640;&#38454;&#30697;&#30340;&#24433;&#21709;&#65292;&#34913;&#37327;&#20102;&#25910;&#20837;&#20914;&#20987;&#23545;&#28040;&#36153;&#20445;&#38505;&#30340;&#24433;&#21709;&#31243;&#24230;&#12290;&#25105;&#20204;&#23548;&#20986;&#20102;&#19968;&#20010;&#38750;&#32447;&#24615;&#28040;&#36153;&#20989;&#25968;&#65292;&#20854;&#20013;&#20445;&#38505;&#31243;&#24230;&#38543;&#30528;&#25910;&#20837;&#20914;&#20987;&#30340;&#31526;&#21495;&#21644;&#22823;&#23567;&#32780;&#21464;&#21270;&#12290;&#21033;&#29992;PSID&#25968;&#25454;&#65292;&#25105;&#20204;&#20272;&#35745;&#20102;&#22351;&#30340;&#30456;&#23545;&#20110;&#22909;&#30340;&#27704;&#20037;&#24615;&#20914;&#20987;&#30340;&#38750;&#23545;&#31216;&#20256;&#23548;&#29575;-- 3 sigma&#36127;&#20914;&#20987;&#30340;&#30340;17%&#20256;&#23548;&#21040;&#28040;&#36153;&#65292;&#32780;&#30456;&#21516;&#22823;&#23567;&#30340;&#27491;&#20914;&#20987;&#21482;&#26377;9%&#20256;&#23548;&#21040;&#28040;&#36153;-- &#38543;&#30528;&#20914;&#20987;&#24694;&#21270;&#65292;&#20256;&#23548;&#29575;&#22686;&#21152;&#12290;&#25105;&#20204;&#30340;&#32467;&#26524;&#19982;&#23545;&#20551;&#24819;&#20107;&#20214;&#28040;&#36153;&#21453;&#24212;&#30340;&#35843;&#26597;&#19968;&#33268;&#65292;&#24182;&#34920;&#26126;&#23614;&#37096;&#25910;&#20837;&#39118;&#38505;&#23545;&#28040;&#36153;&#20855;&#26377;&#37325;&#35201;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
We measure the extent of consumption insurance to income shocks accounting for high-order moments of the income distribution. We derive a nonlinear consumption function, in which the extent of insurance varies with the sign and magnitude of income shocks. Using PSID data, we estimate an asymmetric pass-through of bad versus good permanent shocks -- 17% of a 3 sigma negative shock transmits to consumption compared to 9% of an equal-sized positive shock -- and the pass-through increases as the shock worsens. Our results are consistent with surveys of consumption responses to hypothetical events and suggest that tail income risk matters substantially for consumption.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#30417;&#31649;&#20844;&#21496;&#35775;&#38382;&#28040;&#36153;&#32773;&#25968;&#25454;&#20197;&#29992;&#20110;&#20215;&#26684;&#27495;&#35270;&#30340;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#21487;&#20197;&#26368;&#22823;&#21270;&#26368;&#21155;&#28040;&#36153;&#32773;&#21097;&#20313;&#20215;&#20540;&#30340;&#25152;&#26377;&#25919;&#31574;&#65292;&#21363;&#22914;&#26524;&#25968;&#25454;&#24211;&#19981;&#34920;&#26126;&#26576;&#19968;&#28040;&#36153;&#32676;&#20307;&#65292;&#21017;&#30417;&#31649;&#26426;&#26500;&#20801;&#35768;&#22404;&#26029;&#32773;&#35775;&#38382;&#25968;&#25454;&#12290;</title><link>http://arxiv.org/abs/2305.05822</link><description>&lt;p&gt;
&#24378;&#20581;&#30340;&#25968;&#25454;&#30417;&#31649;
&lt;/p&gt;
&lt;p&gt;
Robust Data Regulation. (arXiv:2305.05822v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.05822
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#30417;&#31649;&#20844;&#21496;&#35775;&#38382;&#28040;&#36153;&#32773;&#25968;&#25454;&#20197;&#29992;&#20110;&#20215;&#26684;&#27495;&#35270;&#30340;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#21487;&#20197;&#26368;&#22823;&#21270;&#26368;&#21155;&#28040;&#36153;&#32773;&#21097;&#20313;&#20215;&#20540;&#30340;&#25152;&#26377;&#25919;&#31574;&#65292;&#21363;&#22914;&#26524;&#25968;&#25454;&#24211;&#19981;&#34920;&#26126;&#26576;&#19968;&#28040;&#36153;&#32676;&#20307;&#65292;&#21017;&#30417;&#31649;&#26426;&#26500;&#20801;&#35768;&#22404;&#26029;&#32773;&#35775;&#38382;&#25968;&#25454;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#20851;&#20110;&#30417;&#31649;&#20844;&#21496;&#35775;&#38382;&#28040;&#36153;&#32773;&#25968;&#25454;&#20197;&#29992;&#20110;&#20215;&#26684;&#27495;&#35270;&#30340;&#38382;&#39064;&#65292;&#29305;&#21035;&#26159;&#24403;&#30417;&#31649;&#26426;&#26500;&#23545;&#25968;&#25454;&#21644;&#25903;&#20184;&#24847;&#24895;&#20043;&#38388;&#30340;&#30456;&#20851;&#32467;&#26500;&#23384;&#22312;&#38750;&#36125;&#21494;&#26031;&#19981;&#30830;&#23450;&#24615;&#26102;&#12290;&#22240;&#27492;&#65292;&#22404;&#26029;&#32773;&#22914;&#20309;&#32454;&#20998;&#24066;&#22330;&#36824;&#19981;&#28165;&#26970;&#12290;&#26412;&#25991;&#25551;&#36848;&#20102;&#21487;&#20197;&#26368;&#22823;&#21270;&#26368;&#21155;&#28040;&#36153;&#32773;&#21097;&#20313;&#20215;&#20540;&#30340;&#25152;&#26377;&#25919;&#31574;&#65306;&#22914;&#26524;&#25968;&#25454;&#24211;&#19981;&#34920;&#26126;&#26576;&#19968;&#28040;&#36153;&#32676;&#20307;&#65292;&#21017;&#30417;&#31649;&#26426;&#26500;&#20801;&#35768;&#22404;&#26029;&#32773;&#35775;&#38382;&#25968;&#25454;&#12290;
&lt;/p&gt;
&lt;p&gt;
I study how to regulate firms' access to consumer data when it is used for price discrimination and the regulator possesses non-Bayesian uncertainty about the correlation structure between data and willingness to pay. Therefore, it is unclear how the monopolist will segment the market. I characterize all policies that maximize worst-case consumer surplus: the regulator allows the monopolist to access data, if the database does not reveal a minority group of consumers.
&lt;/p&gt;</description></item><item><title>&#36825;&#31687;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#26032;&#30340;&#25209;&#37327;&#24378;&#21270;&#23398;&#20064;&#31639;&#27861;STEEL&#65292;&#22312;&#20855;&#26377;&#36830;&#32493;&#29366;&#24577;&#21644;&#34892;&#21160;&#30340;&#26080;&#38480;&#26102;&#39532;&#23572;&#21487;&#22827;&#20915;&#31574;&#36807;&#31243;&#20013;&#65292;&#19981;&#20381;&#36182;&#20110;&#32477;&#23545;&#36830;&#32493;&#20551;&#35774;&#65292;&#36890;&#36807;&#26368;&#22823;&#22343;&#20540;&#20559;&#24046;&#21644;&#20998;&#24067;&#40065;&#26834;&#20248;&#21270;&#30830;&#20445;&#24322;&#24120;&#24773;&#20917;&#19979;&#30340;&#24615;&#33021;&#12290;</title><link>http://arxiv.org/abs/2301.13152</link><description>&lt;p&gt;
STEEL: &#22855;&#24322;&#24615;&#24863;&#30693;&#30340;&#24378;&#21270;&#23398;&#20064;
&lt;/p&gt;
&lt;p&gt;
STEEL: Singularity-aware Reinforcement Learning. (arXiv:2301.13152v3 [stat.ML] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2301.13152
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#26032;&#30340;&#25209;&#37327;&#24378;&#21270;&#23398;&#20064;&#31639;&#27861;STEEL&#65292;&#22312;&#20855;&#26377;&#36830;&#32493;&#29366;&#24577;&#21644;&#34892;&#21160;&#30340;&#26080;&#38480;&#26102;&#39532;&#23572;&#21487;&#22827;&#20915;&#31574;&#36807;&#31243;&#20013;&#65292;&#19981;&#20381;&#36182;&#20110;&#32477;&#23545;&#36830;&#32493;&#20551;&#35774;&#65292;&#36890;&#36807;&#26368;&#22823;&#22343;&#20540;&#20559;&#24046;&#21644;&#20998;&#24067;&#40065;&#26834;&#20248;&#21270;&#30830;&#20445;&#24322;&#24120;&#24773;&#20917;&#19979;&#30340;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25209;&#37327;&#24378;&#21270;&#23398;&#20064;&#26088;&#22312;&#21033;&#29992;&#39044;&#20808;&#25910;&#38598;&#30340;&#25968;&#25454;&#65292;&#22312;&#21160;&#24577;&#29615;&#22659;&#20013;&#25214;&#21040;&#26368;&#20248;&#31574;&#30053;&#65292;&#20197;&#26368;&#22823;&#21270;&#26399;&#26395;&#24635;&#22238;&#25253;&#12290;&#28982;&#32780;&#65292;&#20960;&#20046;&#25152;&#26377;&#29616;&#26377;&#31639;&#27861;&#37117;&#20381;&#36182;&#20110;&#30446;&#26631;&#31574;&#30053;&#35825;&#23548;&#30340;&#20998;&#24067;&#32477;&#23545;&#36830;&#32493;&#20551;&#35774;&#65292;&#20197;&#20415;&#36890;&#36807;&#21464;&#25442;&#27979;&#24230;&#20351;&#29992;&#25209;&#37327;&#25968;&#25454;&#26469;&#26657;&#20934;&#30446;&#26631;&#31574;&#30053;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#25209;&#37327;&#24378;&#21270;&#23398;&#20064;&#31639;&#27861;&#65292;&#19981;&#38656;&#35201;&#22312;&#20855;&#26377;&#36830;&#32493;&#29366;&#24577;&#21644;&#34892;&#21160;&#30340;&#26080;&#38480;&#26102;&#39532;&#23572;&#21487;&#22827;&#20915;&#31574;&#36807;&#31243;&#20013;&#32477;&#23545;&#36830;&#32493;&#24615;&#20551;&#35774;&#12290;&#25105;&#20204;&#31216;&#36825;&#20010;&#31639;&#27861;&#20026;STEEL&#65306;SingulariTy-awarE rEinforcement Learning&#12290;&#25105;&#20204;&#30340;&#31639;&#27861;&#21463;&#21040;&#20851;&#20110;&#31163;&#32447;&#35780;&#20272;&#30340;&#26032;&#35823;&#24046;&#20998;&#26512;&#30340;&#21551;&#21457;&#65292;&#20854;&#20013;&#25105;&#20204;&#20351;&#29992;&#20102;&#26368;&#22823;&#22343;&#20540;&#20559;&#24046;&#65292;&#20197;&#21450;&#24102;&#26377;&#20998;&#24067;&#40065;&#26834;&#20248;&#21270;&#30340;&#31574;&#30053;&#23450;&#21521;&#35823;&#24046;&#35780;&#20272;&#26041;&#27861;&#65292;&#20197;&#30830;&#20445;&#24322;&#24120;&#24773;&#20917;&#19979;&#30340;&#24615;&#33021;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#20110;&#22788;&#29702;&#22855;&#24322;&#24773;&#20917;&#30340;&#23450;&#21521;&#31639;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
Batch reinforcement learning (RL) aims at leveraging pre-collected data to find an optimal policy that maximizes the expected total rewards in a dynamic environment. Nearly all existing algorithms rely on the absolutely continuous assumption on the distribution induced by target policies with respect to the data distribution, so that the batch data can be used to calibrate target policies via the change of measure. However, the absolute continuity assumption could be violated in practice (e.g., no-overlap support), especially when the state-action space is large or continuous. In this paper, we propose a new batch RL algorithm without requiring absolute continuity in the setting of an infinite-horizon Markov decision process with continuous states and actions. We call our algorithm STEEL: SingulariTy-awarE rEinforcement Learning. Our algorithm is motivated by a new error analysis on off-policy evaluation, where we use maximum mean discrepancy, together with distributionally robust opti
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#21033;&#29992;&#20840;&#29699;&#20844;&#21496;&#29615;&#22659;&#23454;&#36341;&#30340;&#25968;&#25454;&#24471;&#20986;&#32467;&#35770;&#65306;&#20844;&#21496;&#30340;&#29615;&#22659;&#24433;&#21709;&#19982;&#20854;&#35268;&#27169;&#25104;&#31616;&#21333;&#30340;&#24130;&#24459;&#20851;&#31995;&#65292;&#21487;&#20197;&#26500;&#24314;&#19968;&#20010;&#29305;&#23450;&#20110;&#34892;&#19994;&#12289;&#22823;&#23567;&#30456;&#20851;&#30340;&#22522;&#20934;&#26469;&#35780;&#20272;&#20844;&#21496;&#30340;&#29615;&#22659;&#32489;&#25928;&#65292;&#24182;&#23454;&#26045;&#36825;&#26679;&#30340;&#22522;&#20934;&#21487;&#33021;&#20250;&#23548;&#33268;15%&#30340;&#25490;&#25918;&#20943;&#23569;&#12290;</title><link>http://arxiv.org/abs/2206.03148</link><description>&lt;p&gt;
&#20197;&#20840;&#29699;&#20844;&#21496;&#20026;&#22522;&#20934;&#30340;&#35268;&#27169;&#23450;&#24459;&#20316;&#20026;&#35780;&#20272;&#29615;&#22659;&#32489;&#25928;&#30340;&#22522;&#30784;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Scaling laws in global corporations as a benchmarking approach to assess environmental performance. (arXiv:2206.03148v3 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2206.03148
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#21033;&#29992;&#20840;&#29699;&#20844;&#21496;&#29615;&#22659;&#23454;&#36341;&#30340;&#25968;&#25454;&#24471;&#20986;&#32467;&#35770;&#65306;&#20844;&#21496;&#30340;&#29615;&#22659;&#24433;&#21709;&#19982;&#20854;&#35268;&#27169;&#25104;&#31616;&#21333;&#30340;&#24130;&#24459;&#20851;&#31995;&#65292;&#21487;&#20197;&#26500;&#24314;&#19968;&#20010;&#29305;&#23450;&#20110;&#34892;&#19994;&#12289;&#22823;&#23567;&#30456;&#20851;&#30340;&#22522;&#20934;&#26469;&#35780;&#20272;&#20844;&#21496;&#30340;&#29615;&#22659;&#32489;&#25928;&#65292;&#24182;&#23454;&#26045;&#36825;&#26679;&#30340;&#22522;&#20934;&#21487;&#33021;&#20250;&#23548;&#33268;15%&#30340;&#25490;&#25918;&#20943;&#23569;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20840;&#29699;&#26368;&#22823;&#30340;6,529&#23478;&#36328;&#22269;&#20844;&#21496;&#36127;&#36131;&#20102;&#36817;30%&#30340;&#20840;&#29699;CO2e&#25490;&#25918;&#37327;&#12290;&#36234;&#26469;&#36234;&#22810;&#30340;&#32929;&#19996;&#21644;&#21033;&#30410;&#30456;&#20851;&#32773;&#24847;&#35782;&#21040;&#20225;&#19994;&#22312;&#21487;&#25345;&#32493;&#21457;&#23637;&#36947;&#36335;&#19978;&#30340;&#20316;&#29992;&#65292;&#22240;&#27492;&#20182;&#20204;&#36861;&#27714;&#36234;&#26469;&#36234;&#20005;&#26684;&#21644;&#38596;&#24515;&#21187;&#21187;&#30340;&#29615;&#22659;&#30446;&#26631;&#12290;&#20294;&#26159;&#65292;&#22914;&#20309;&#23458;&#35266;&#39640;&#25928;&#22320;&#35780;&#20272;&#20225;&#19994;&#30340;&#29615;&#22659;&#32489;&#25928;&#20173;&#28982;&#26159;&#19968;&#20010;&#24748;&#32780;&#26410;&#20915;&#30340;&#38382;&#39064;&#12290;&#26412;&#30740;&#31350;&#25581;&#31034;&#20102;&#21487;&#20197;&#29992;&#26469;&#26500;&#24314;&#20844;&#21496;&#29615;&#22659;&#24433;&#21709;&#30340;&#23450;&#37327;&#32479;&#19968;&#22270;&#29255;&#30340;&#22522;&#26412;&#21160;&#24577;&#21644;&#32467;&#26500;&#12290;&#26412;&#30740;&#31350;&#34920;&#26126;&#65292;&#20844;&#21496;&#30340;&#29615;&#22659;&#24433;&#21709;&#65288;&#26032;&#38472;&#20195;&#35874;&#65289;CO2e&#33021;&#28304;&#20351;&#29992;&#65292;&#27700;&#21462;&#27700;&#21644;&#24223;&#21697;&#29983;&#20135;&#30340;&#35268;&#27169;&#19982;&#20854;&#35268;&#27169;&#25104;&#31616;&#21333;&#30340;&#24130;&#24459;&#20851;&#31995;&#65292;&#36825;&#24448;&#24448;&#26159;&#27425;&#32447;&#24615;&#30340;&#65292;&#24182;&#19988;&#21487;&#20197;&#29992;&#26469;&#25512;&#23548;&#20986;&#19968;&#20010;&#29305;&#23450;&#20110;&#34892;&#19994;&#65292;&#22823;&#23567;&#30456;&#20851;&#30340;&#22522;&#20934;&#26469;&#26126;&#30830;&#35780;&#20272;&#20844;&#21496;&#30340;&#29615;&#22659;&#32489;&#25928;&#12290;&#23454;&#26045;&#36825;&#26679;&#30340;&#22522;&#20934;&#21487;&#33021;&#20250;&#23548;&#33268;15%&#30340;&#25490;&#25918;&#20943;&#23569;&#12290;
&lt;/p&gt;
&lt;p&gt;
The largest 6,529 international corporations are accountable for almost 30% of global CO2e emissions. A growing awareness of the role of the corporate world in the path toward sustainability has led many shareholders and stakeholders to pursue increasingly stringent and ambitious environmental goals. However, how to assess the corporate environmental performance objectively and efficiently remains an open question. This study reveals underlying dynamics and structures that can be used to construct a unified quantitative picture of the environmental impact of companies. This study shows that the environmental impact (metabolism) of companies CO2e energy used, water withdrawal and waste production, scales with their size according to a simple power law which is often sublinear, and can be used to derive a sector-specific, size-dependent benchmark to asses unambiguously a company's environmental performance. Enforcing such a benchmark would potentially result in a 15% emissions reduction,
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#30740;&#31350;&#20102;&#22312;&#23384;&#22312;&#27835;&#30103;&#25928;&#24212;&#24322;&#36136;&#24615;&#30340;&#27169;&#22411;&#20013;&#65292;&#20108;&#38454;&#27573;&#26368;&#23567;&#20108;&#20056;&#27861;&#21487;&#20197;&#30830;&#23450;&#27599;&#31181;&#27835;&#30103;&#26041;&#26696;&#30340;&#20195;&#29702;&#20154;&#29305;&#23450;&#25928;&#24212;&#30340;&#27491;&#26435;&#37325;&#21644;&#30340;&#24517;&#35201;&#19988;&#20805;&#20998;&#26465;&#20214;&#65292;&#20854;&#36866;&#29992;&#20110;&#20219;&#24847;&#25968;&#37327;&#30340;&#27835;&#30103;&#26041;&#26696;&#12289;&#20219;&#24847;&#25968;&#37327;&#30340;&#36830;&#32493;&#25110;&#31163;&#25955;&#24037;&#20855;&#20197;&#21450;&#21253;&#25324;&#21327;&#21464;&#37327;&#22312;&#20869;&#30340;&#24773;&#20917;&#12290;</title><link>http://arxiv.org/abs/2205.07836</link><description>&lt;p&gt;
&#26377;&#22810;&#20010;&#27835;&#30103;&#26041;&#26696;&#30340;&#20108;&#38454;&#27573;&#26368;&#23567;&#20108;&#20056;&#27861;
&lt;/p&gt;
&lt;p&gt;
2SLS with Multiple Treatments. (arXiv:2205.07836v4 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2205.07836
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#30740;&#31350;&#20102;&#22312;&#23384;&#22312;&#27835;&#30103;&#25928;&#24212;&#24322;&#36136;&#24615;&#30340;&#27169;&#22411;&#20013;&#65292;&#20108;&#38454;&#27573;&#26368;&#23567;&#20108;&#20056;&#27861;&#21487;&#20197;&#30830;&#23450;&#27599;&#31181;&#27835;&#30103;&#26041;&#26696;&#30340;&#20195;&#29702;&#20154;&#29305;&#23450;&#25928;&#24212;&#30340;&#27491;&#26435;&#37325;&#21644;&#30340;&#24517;&#35201;&#19988;&#20805;&#20998;&#26465;&#20214;&#65292;&#20854;&#36866;&#29992;&#20110;&#20219;&#24847;&#25968;&#37327;&#30340;&#27835;&#30103;&#26041;&#26696;&#12289;&#20219;&#24847;&#25968;&#37327;&#30340;&#36830;&#32493;&#25110;&#31163;&#25955;&#24037;&#20855;&#20197;&#21450;&#21253;&#25324;&#21327;&#21464;&#37327;&#22312;&#20869;&#30340;&#24773;&#20917;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#22312;&#23384;&#22312;&#27835;&#30103;&#25928;&#24212;&#24322;&#36136;&#24615;&#30340;&#27169;&#22411;&#20013;&#65292;&#20108;&#38454;&#27573;&#26368;&#23567;&#20108;&#20056;&#27861; (2SLS) &#22312;&#22810;&#20010;&#27835;&#30103;&#26041;&#26696;&#20013;&#25152;&#33021;&#30830;&#23450;&#30340;&#20869;&#23481;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#20004;&#20010;&#24517;&#35201;&#19988;&#20805;&#20998;&#30340;&#26465;&#20214;&#65292;&#21363;&#24179;&#22343;&#26465;&#20214;&#21333;&#35843;&#24615;&#21644;&#26080;&#20132;&#21449;&#25928;&#24212;&#65292;&#21487;&#20197;&#30830;&#23450;&#27599;&#31181;&#27835;&#30103;&#26041;&#26696;&#30340;&#20195;&#29702;&#20154;&#29305;&#23450;&#25928;&#24212;&#30340;&#27491;&#26435;&#37325;&#21644;&#12290;&#25105;&#20204;&#30340;&#37492;&#23450;&#20998;&#26512;&#21487;&#20197;&#36866;&#29992;&#20110;&#20219;&#24847;&#25968;&#37327;&#30340;&#27835;&#30103;&#26041;&#26696;&#12289;&#20219;&#24847;&#25968;&#37327;&#30340;&#36830;&#32493;&#25110;&#31163;&#25955;&#24037;&#20855;&#20197;&#21450;&#21253;&#25324;&#21327;&#21464;&#37327;&#22312;&#20869;&#30340;&#24773;&#20917;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#30001;&#25105;&#20204;&#30340;&#37492;&#23450;&#26465;&#20214;&#25152;&#26263;&#31034;&#30340;&#36873;&#25321;&#34892;&#20026;&#30340;&#29305;&#24449;&#65292;&#24182;&#35752;&#35770;&#20102;&#36825;&#20123;&#26465;&#20214;&#22914;&#20309;&#22312;&#23454;&#35777;&#30740;&#31350;&#20013;&#36827;&#34892;&#27979;&#35797;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study what two-stage least squares (2SLS) identifies in models with multiple treatments under treatment effect heterogeneity. Two conditions are shown to be necessary and sufficient for the 2SLS to identify positively weighted sums of agent-specific effects of each treatment: average conditional monotonicity and no cross effects. Our identification analysis allows for any number of treatments, any number of continuous or discrete instruments, and the inclusion of covariates. We provide characterizations of choice behavior implied by our identification conditions and discuss how the conditions can be tested empirically.
&lt;/p&gt;</description></item></channel></rss>