<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#24066;&#22330;&#21305;&#37197;&#20013;&#65292;&#25509;&#25910;&#32773;&#19982;&#21457;&#36865;&#32773;&#20043;&#38388;&#30340;&#20449;&#21495;&#20256;&#36882;&#21644;&#22996;&#25176;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#26368;&#20248;&#21306;&#38388;&#22996;&#25176;&#30340;&#35299;&#20915;&#26041;&#26696;&#65292;&#24182;&#38024;&#23545;&#25509;&#25910;&#32773;&#31867;&#22411;&#21644;&#21457;&#20449;&#20154;&#20449;&#21495;&#30340;&#29983;&#20135;&#21147;&#36827;&#34892;&#20102;&#35299;&#26512;&#65292;&#25214;&#21040;&#26368;&#20248;&#22996;&#25176;&#26041;&#27861;&#65292;&#26469;&#20445;&#35777;&#21305;&#37197;&#25928;&#29575;&#21644;&#20449;&#21495;&#25104;&#26412;&#20043;&#38388;&#30340;&#24179;&#34913;&#12290;</title><link>http://arxiv.org/abs/2303.09415</link><description>&lt;p&gt;
&#24102;&#20449;&#21495;&#30340;&#21305;&#37197;&#24066;&#22330;&#20013;&#30340;&#26368;&#20248;&#22996;&#25176;&#38382;&#39064;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Optimal Delegation in Markets for Matching with Signaling. (arXiv:2303.09415v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.09415
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#24066;&#22330;&#21305;&#37197;&#20013;&#65292;&#25509;&#25910;&#32773;&#19982;&#21457;&#36865;&#32773;&#20043;&#38388;&#30340;&#20449;&#21495;&#20256;&#36882;&#21644;&#22996;&#25176;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#26368;&#20248;&#21306;&#38388;&#22996;&#25176;&#30340;&#35299;&#20915;&#26041;&#26696;&#65292;&#24182;&#38024;&#23545;&#25509;&#25910;&#32773;&#31867;&#22411;&#21644;&#21457;&#20449;&#20154;&#20449;&#21495;&#30340;&#29983;&#20135;&#21147;&#36827;&#34892;&#20102;&#35299;&#26512;&#65292;&#25214;&#21040;&#26368;&#20248;&#22996;&#25176;&#26041;&#27861;&#65292;&#26469;&#20445;&#35777;&#21305;&#37197;&#25928;&#29575;&#21644;&#20449;&#21495;&#25104;&#26412;&#20043;&#38388;&#30340;&#24179;&#34913;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#20449;&#21495;&#20256;&#36882;&#26041;&#38754;&#65292;&#35268;&#21046;&#25509;&#25910;&#32773;&#21453;&#24212;&#36873;&#25321;&#30340;&#20195;&#34920;&#38754;&#20020;&#30340;&#22996;&#25176;&#38382;&#39064;&#12290;&#26412;&#25991;&#25552;&#20379;&#20102;&#35745;&#31639;&#35268;&#21046;&#32773;&#24895;&#24847;&#22996;&#25176;&#30340;&#26032;&#35266;&#28857;&#65292;&#24182;&#35774;&#35745;&#20102;&#26368;&#20248;&#65288;&#21453;&#24212;&#65289;&#21306;&#38388;&#22996;&#25176;&#20316;&#20026;&#35268;&#21010;&#32773;&#19968;&#33324;&#26426;&#21046;&#35774;&#35745;&#38382;&#39064;&#30340;&#35299;&#20915;&#26041;&#26696;&#12290;&#25509;&#25910;&#32773;&#31867;&#22411;&#30340;&#30456;&#23545;&#24322;&#36136;&#24615;&#21644;&#21457;&#20214;&#20154;&#20449;&#21495;&#30340;&#29983;&#20135;&#21147;&#23545;&#26368;&#20248;&#21306;&#38388;&#22996;&#25176;&#30340;&#30830;&#23450;&#36215;&#30528;&#33267;&#20851;&#37325;&#35201;&#30340;&#20316;&#29992;&#65292;&#22240;&#20026;&#38656;&#35201;&#22312;&#21305;&#37197;&#25928;&#29575;&#21644;&#20449;&#21495;&#25104;&#26412;&#20043;&#38388;&#20570;&#20986;&#26435;&#34913;&#20915;&#31574;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper studies a delegation problem faced by the planner who wants to regulate receivers' reaction choices in markets for matching between receivers and senders with signaling. We provide a noble insight into the planner's willingness to delegate and the design of optimal (reaction) interval delegation as a solution to the planner's general mechanism design problem. The relative heterogeneity of receiver types and the productivity of the sender' signal are crucial in deriving optimal interval delegation in the presence of the trade-off between matching efficiency and signaling costs.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25506;&#35752;&#20102;&#26159;&#21542;&#26377;&#26356;&#22909;&#30340;&#20010;&#20154;&#21644;&#20844;&#21496;&#25152;&#24471;&#31246;&#25910;&#20837;&#30340;&#39044;&#27979;&#27169;&#22411;&#26159;&#23481;&#26131;&#23454;&#26045;&#30340;&#24182;&#19988;&#20248;&#20110;&#30446;&#21069;&#27491;&#22312;&#20351;&#29992;&#30340;&#27169;&#22411;&#12290;</title><link>http://arxiv.org/abs/2303.09405</link><description>&lt;p&gt;
&#31616;&#21270;&#19982;&#25913;&#36827;&#65306;&#37325;&#35775;&#20445;&#21152;&#21033;&#20122;&#30340;&#25910;&#20837;&#39044;&#27979;&#27169;&#22411;&#12290;
&lt;/p&gt;
&lt;p&gt;
Simplifying and Improving: Revisiting Bulgaria's Revenue Forecasting Models. (arXiv:2303.09405v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.09405
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25506;&#35752;&#20102;&#26159;&#21542;&#26377;&#26356;&#22909;&#30340;&#20010;&#20154;&#21644;&#20844;&#21496;&#25152;&#24471;&#31246;&#25910;&#20837;&#30340;&#39044;&#27979;&#27169;&#22411;&#26159;&#23481;&#26131;&#23454;&#26045;&#30340;&#24182;&#19988;&#20248;&#20110;&#30446;&#21069;&#27491;&#22312;&#20351;&#29992;&#30340;&#27169;&#22411;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#33258;&#30495;&#27491;&#31038;&#20250;&#20027;&#20041;&#32467;&#26463;&#19977;&#21313;&#24180;&#26469;&#65292;&#20445;&#21152;&#21033;&#20122;&#30340;&#31246;&#25910;&#21046;&#24230;&#24050;&#32463;&#20174;&#30456;&#24403;&#28608;&#36827;&#30340;&#8220;&#19981;&#21516;&#8221;&#21046;&#24230;&#36716;&#21464;&#20026;&#37319;&#29992;&#36739;&#20302;&#30340;&#31246;&#29575;&#65292;&#20844;&#21496;&#25152;&#24471;&#31246;&#21644;&#20010;&#20154;&#25152;&#24471;&#31246;&#30340;&#36793;&#38469;&#31246;&#29575;&#20174;40&#65285;&#38477;&#33267;10&#65285;&#12290;&#37325;&#35201;&#30340;&#26159;&#65292;&#22312;&#20445;&#21152;&#21033;&#20122;&#36130;&#25919;&#37096;&#20351;&#29992;&#30340;&#35745;&#37327;&#32463;&#27982;&#23398;&#39044;&#27979;&#27169;&#22411;&#20013;&#65292;&#26263;&#31034;&#30528;&#19982;&#25152;&#35859;&#30340;&#8220;&#25289;&#24343;&#26354;&#32447;&#8221;&#30456;&#23481;&#30340;&#31246;&#25910;&#22686;&#21152;&#12290;&#21516;&#26679;&#65292;&#35768;&#22810;&#32463;&#27982;&#23398;&#23478;&#35748;&#20026;&#65292;&#25910;&#20837;&#20250;&#22686;&#21152;&#12290;&#28982;&#32780;&#65292;&#29616;&#23454;&#24182;&#26410;&#36798;&#21040;&#22522;&#20110;&#39044;&#27979;&#27169;&#22411;&#21644;&#26681;&#26893;&#20110;&#20027;&#27969;&#32463;&#27982;&#29702;&#35770;&#30340;&#26399;&#26395;&#12290;&#22240;&#27492;&#65292;&#26412;&#25991;&#25506;&#35752;&#26159;&#21542;&#26377;&#26356;&#22909;&#30340;&#20010;&#20154;&#21644;&#20844;&#21496;&#25152;&#24471;&#31246;&#25910;&#20837;&#30340;&#39044;&#27979;&#27169;&#22411;&#26159;&#23481;&#26131;&#23454;&#26045;&#30340;&#24182;&#19988;&#20248;&#20110;&#30446;&#21069;&#27491;&#22312;&#20351;&#29992;&#30340;&#27169;&#22411;&#12290;&#22312;&#25552;&#20986;&#23545;&#30446;&#21069;&#39044;&#27979;&#27169;&#22411;&#30340;&#24314;&#35774;&#24615;&#25209;&#35780;&#20043;&#21518;&#65292;&#26412;&#25991;&#25552;&#20379;&#20102;&#23481;&#26131;&#23454;&#29616;&#65292;&#36879;&#26126;&#30340;&#26367;&#20195;&#26041;&#26696;&#12290;
&lt;/p&gt;
&lt;p&gt;
In the thirty years since the end of real socialism, Bulgaria's went from having a rather radically 'different' tax system to adopting flat-rate taxation with marginal tax rates that fell from figures as high as 40% to 10% for both the corporate-income tax and the personal-income tax. Crucially, the econometric forecasting models in use at the Bulgarian Ministry of Finance hinted at an increase in tax revenue compatible with the so-called 'Laffer curve'. Similarly, many economists held the view that revenues would have increased. However, reality fell short of those expectations based on forecasting models and rooted in mainstream economic theory. Thus, this paper asks whether there are betterperforming forecasting models for personal-and corporate-income tax-revenues in Bulgaria that are readily implementable and overperform the ones currently in use. After articulating a constructive critique of the current forecasting models, the paper offers readily implementable, transparent alter
&lt;/p&gt;</description></item><item><title>&#26412;&#20070;&#25552;&#20379;&#20102;&#19968;&#20010;&#22522;&#20110;&#29983;&#20135;&#27700;&#24179;&#19978;&#30340;&#31561;&#20215;&#20851;&#31995;&#30340;&#19968;&#33268;&#30340;&#20215;&#20540;&#29702;&#35770;&#65292;&#24182;&#37325;&#26032;&#23450;&#20041;&#29983;&#20135;&#30340;&#30495;&#27491;&#21547;&#20041;&#21450;&#31038;&#20250;&#36164;&#26412;&#30340;&#20877;&#29983;&#20135;&#29702;&#35770;&#12290;&#20854;&#21033;&#28070;&#29702;&#35770;&#34920;&#26126;&#21033;&#28070;&#23545;&#24212;&#20110;&#29289;&#29702;&#21487;&#27979;&#37327;&#30340;&#37327;&#12290;</title><link>http://arxiv.org/abs/2303.09399</link><description>&lt;p&gt;
&#25919;&#27835;&#32463;&#27982;&#23398;&#30340;&#20027;&#35201;&#27010;&#24565;&#19982;&#21407;&#21017;&#8212;&#8212;&#29983;&#20135;&#19982;&#20215;&#20540;&#12289;&#20998;&#37197;&#19982;&#20215;&#26684;&#12289;&#20877;&#29983;&#20135;&#19982;&#21033;&#28070;
&lt;/p&gt;
&lt;p&gt;
Main Concepts and Principles of Political Economy -- Production and Values, Distribution and Prices, Reproduction and Profits. (arXiv:2303.09399v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.09399
&lt;/p&gt;
&lt;p&gt;
&#26412;&#20070;&#25552;&#20379;&#20102;&#19968;&#20010;&#22522;&#20110;&#29983;&#20135;&#27700;&#24179;&#19978;&#30340;&#31561;&#20215;&#20851;&#31995;&#30340;&#19968;&#33268;&#30340;&#20215;&#20540;&#29702;&#35770;&#65292;&#24182;&#37325;&#26032;&#23450;&#20041;&#29983;&#20135;&#30340;&#30495;&#27491;&#21547;&#20041;&#21450;&#31038;&#20250;&#36164;&#26412;&#30340;&#20877;&#29983;&#20135;&#29702;&#35770;&#12290;&#20854;&#21033;&#28070;&#29702;&#35770;&#34920;&#26126;&#21033;&#28070;&#23545;&#24212;&#20110;&#29289;&#29702;&#21487;&#27979;&#37327;&#30340;&#37327;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#20070;&#26088;&#22312;&#20174;&#32463;&#27982;&#29702;&#35770;&#30340;&#22880;&#22522;&#32773;&#20122;&#24403;&#183;&#26031;&#23494;&#12289;&#25140;&#32500;&#183;&#26446;&#22025;&#22270;&#21644;&#21345;&#23572;&#183;&#39532;&#20811;&#24605;&#25552;&#20986;&#30340;&#22522;&#26412;&#38382;&#39064;&#20837;&#25163;&#65292;&#25506;&#31350;&#21830;&#21697;&#30340;&#20215;&#20540;&#26159;&#30001;&#20160;&#20040;&#26500;&#25104;&#30340;&#65292;&#29983;&#20135;&#12289;&#20132;&#25442;&#12289;&#36135;&#24065;&#21644;&#25910;&#20837;&#65288;&#22914;&#21033;&#28070;&#12289;&#24037;&#36164;&#21644;&#31199;&#37329;&#65289;&#26159;&#20160;&#20040;&#26679;&#30340;&#12290;&#36825;&#20123;&#32463;&#27982;&#23398;&#23478;&#25552;&#20379;&#30340;&#31572;&#26696;&#22823;&#22810;&#26159;&#38169;&#35823;&#30340;&#65292;&#23588;&#20854;&#26159;&#22312;&#23558;&#21830;&#21697;&#30340;&#31561;&#20215;&#23450;&#20041;&#20026;&#20132;&#25442;&#30340;&#27700;&#24179;&#19978;&#65292;&#20294;&#20063;&#30001;&#20110;&#23558;&#20215;&#20540;&#19982;&#20215;&#26684;&#28151;&#28102;&#65292;&#24182;&#38169;&#35823;&#22320;&#30475;&#24453;&#29983;&#20135;&#30340;&#30495;&#27491;&#21547;&#20041;&#21450;&#22266;&#23450;&#36164;&#26412;&#30340;&#20316;&#29992;&#12290;&#26412;&#20070;&#36816;&#29992;&#24230;&#37327;&#30340;&#25968;&#23398;&#29702;&#35770;&#21644;&#32500;&#24230;&#20998;&#26512;&#30340;&#29289;&#29702;&#29702;&#35770;&#65292;&#22522;&#20110;&#19968;&#20010;&#19981;&#26159;&#22312;&#20132;&#25442;&#27700;&#24179;&#32780;&#26159;&#22312;&#29983;&#20135;&#27700;&#24179;&#19978;&#30340;&#31561;&#20215;&#20851;&#31995;&#65292;&#25552;&#20379;&#20102;&#19968;&#20010;&#19968;&#33268;&#30340;&#20215;&#20540;&#29702;&#35770;&#12290;&#26412;&#20070;&#25298;&#32477;&#23558;&#29983;&#20135;&#35270;&#20026;&#23558;&#25237;&#20837;&#36716;&#21270;&#20026;&#20135;&#20986;&#30340;&#36807;&#31243;&#65292;&#24182;&#20174;&#29289;&#36136;&#12289;&#33021;&#37327;&#21644;&#20154;&#31867;&#19982;&#33258;&#28982;&#12289;&#26426;&#22120;&#21644;&#20854;&#20182;&#20154;&#31867;&#36827;&#34892;&#20132;&#20114;&#30340;&#26234;&#21147;&#27963;&#21160;&#30340;&#29289;&#29702;&#35282;&#24230;&#23545;&#20854;&#36827;&#34892;&#37325;&#26032;&#23450;&#20041;&#12290;&#31038;&#20250;&#36164;&#26412;&#30340;&#20877;&#29983;&#20135;&#29702;&#35770;&#26159;&#22522;&#20110;&#24658;&#23450;&#36164;&#26412;&#12289;&#21487;&#21464;&#36164;&#26412;&#21644;&#21097;&#20313;&#20215;&#20540;&#30340;&#19977;&#20998;&#27861;&#65292;&#24182;&#30830;&#31435;&#20215;&#20540;&#23432;&#24658;&#23450;&#24459;&#20316;&#20026;&#20998;&#37197;&#19982;&#20215;&#26684;&#29702;&#35770;&#30340;&#22522;&#30707;&#12290;&#21033;&#28070;&#29702;&#35770;&#34920;&#26126;&#65292;&#21033;&#28070;&#23545;&#24212;&#20110;&#29289;&#29702;&#21487;&#27979;&#37327;&#30340;&#37327;&#65292;&#22240;&#20026;&#22312;&#19981;&#30830;&#23450;&#24615;&#21644;&#39118;&#38505;&#30340;&#26465;&#20214;&#19979;&#65292;&#23427;&#26159;&#29983;&#20135;&#36807;&#31243;&#30340;&#29289;&#29702;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
This book starts from the basic questions that had been raised by the founders of Economic theory, Smith, Ricardo, and Marx: what makes the value of commodities, what are production, exchange, money and incomes like profits, wages and rents. The answers that these economists had provided were mostly wrong, above all by defining the equivalence of commodities at the level of exchange, but also because of a confusion made between values and prices, and wrong views of what production really is and the role of fixed capital. Using the mathematical theory of measurement and the physical theory of dimensional analysis, this book provides a coherent theory of value based on an equivalence relation not at the level of exchange, but of production. Indeed exchange is considered here as an equivalence relation between money and a monetary price, and not between commodities, modern monetary theory having demonstrated that money is not a commodity. The book rejects the conception of production as a
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25581;&#31034;&#20986;&#33437;&#21152;&#21733;&#23398;&#27966;&#30340;&#21338;&#24328;&#35770;&#27169;&#22411;&#30340;&#19968;&#20010;&#22522;&#26412;&#20551;&#35774;&#34987;&#35777;&#26126;&#26159;&#38169;&#35823;&#30340;&#65292;&#36825;&#21487;&#20197;&#23545;&#20854;&#20551;&#35774;&#20154;&#31867;&#34892;&#20026;&#26082;&#29702;&#24615;&#21448;&#33258;&#31169;&#30340;&#23398;&#35828;&#25552;&#20986;&#25361;&#25112;&#12290;</title><link>http://arxiv.org/abs/2303.09321</link><description>&lt;p&gt;
&#29289;&#29702;&#23398;&#31361;&#30772;&#35777;&#26126;&#33437;&#21152;&#21733;&#23398;&#27966;&#30340;&#22522;&#26412;&#20551;&#35774;&#26159;&#38169;&#35823;&#30340;
&lt;/p&gt;
&lt;p&gt;
Physics Breakthrough Disproves Fundamental Assumptions of the Chicago School. (arXiv:2303.09321v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.09321
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25581;&#31034;&#20986;&#33437;&#21152;&#21733;&#23398;&#27966;&#30340;&#21338;&#24328;&#35770;&#27169;&#22411;&#30340;&#19968;&#20010;&#22522;&#26412;&#20551;&#35774;&#34987;&#35777;&#26126;&#26159;&#38169;&#35823;&#30340;&#65292;&#36825;&#21487;&#20197;&#23545;&#20854;&#20551;&#35774;&#20154;&#31867;&#34892;&#20026;&#26082;&#29702;&#24615;&#21448;&#33258;&#31169;&#30340;&#23398;&#35828;&#25552;&#20986;&#25361;&#25112;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21476;&#20856;&#30340;&#27861;&#24459;&#32463;&#27982;&#23398;&#26159;&#32654;&#22269;&#27861;&#24459;&#21046;&#24230;&#30340;&#22522;&#30784;&#12290;&#33437;&#21152;&#21733;&#22823;&#23398;&#26159;&#20854;&#26680;&#24515;&#65292;&#20854;&#20013;&#26368;&#37325;&#35201;&#30340;&#20551;&#35774;&#26159;&#20154;&#31867;&#34892;&#20026;&#26082;&#29702;&#24615;&#21448;&#33258;&#31169;&#65292;&#36825;&#31181;&#20551;&#35774;&#24433;&#21709;&#20102;&#31435;&#27861;&#26426;&#26500;&#12289;&#27861;&#23448;&#21644;&#25919;&#24220;&#24459;&#24072;&#30340;&#24605;&#32500;&#26041;&#24335;&#65292;&#24182;&#22609;&#36896;&#20102;&#21830;&#19994;&#20132;&#26131;&#26041;&#26041;&#38754;&#38754;&#12290;&#20294;&#26159;&#65292;&#22914;&#26524;&#33437;&#21152;&#21733;&#23398;&#27966;&#26159;&#38169;&#35823;&#30340;&#21602;&#65311;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#20840;&#26032;&#30340;&#21407;&#22240;&#65292;&#21363;&#20854;&#21338;&#24328;&#35770;&#27169;&#22411;&#30340;&#19968;&#20010;&#22522;&#26412;&#20551;&#35774;&#24050;&#34987;&#35777;&#26126;&#26159;&#38169;&#35823;&#30340;&#12290;&#26412;&#25991;&#25581;&#31034;&#20102;2012&#24180;&#29289;&#29702;&#23398;&#23478;Freeman Dyson&#30340;&#31361;&#30772;&#24615;&#21457;&#29616;&#38663;&#24778;&#20102;&#21338;&#24328;&#35770;&#30028;&#12290;&#26412;&#25991;&#34920;&#26126;&#33437;&#21152;&#21733;&#23398;&#27966;&#30340;&#21338;&#24328;&#35770;&#23398;&#32773;&#26159;&#38169;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
Classical law and economics is foundational to the American legal system. Centered at the University of Chicago, its assumptions, most especially that humans act both rationally and selfishly, informs the thinking of legislatures, judges, and government lawyers, and has shaped nearly every aspect of the way commercial transactions are conducted. But what if the Chicago School, as I refer to this line of thinking, is wrong? Alternative approaches such as behavioral law and economics or law and political economy contend that human decisionmaking is based on emotions or should not be regulated as a social geometry of bargains. This Article proposes a different and wholly novel reason that the Chicago School is wrong: a fundamental assumption central to many of its game theory models has been disproven. This Article shows that a 2012 breakthrough from world famous physicist Freeman Dyson shocked the world of game theory. This Article shows that Chicago School game theorists are wrong on th
&lt;/p&gt;</description></item><item><title>&#35813;&#25991;&#20171;&#32461;&#20102;&#38480;&#21046;&#22312;&#32447;&#36861;&#36394;&#29992;&#25143;&#30340;&#26102;&#38388;&#65292;&#38024;&#23545;&#20986;&#29256;&#21830;&#21487;&#33021;&#20135;&#29983;&#30340;&#32463;&#27982;&#24433;&#21709;&#20570;&#20102;&#19968;&#20010;&#25104;&#26412;&#25928;&#30410;&#20998;&#26512;&#65292;&#30740;&#31350;&#21457;&#29616;Cookie&#23551;&#21629;&#38480;&#21046;&#22312;&#19968;&#24180;&#65288;&#20004;&#24180;&#65289;&#20250;&#20351;&#20854;&#20215;&#20540;&#38477;&#20302;25&#65285;&#65288;19&#65285;&#65289;&#65292;&#36825;&#34920;&#31034;&#25152;&#26377;Cookie&#20215;&#20540;&#20943;&#23569;&#20102;9&#65285;&#65288;5&#65285;&#65289;&#12290;</title><link>http://arxiv.org/abs/2303.09147</link><description>&lt;p&gt;
&#22312;&#32447;&#36861;&#36394;&#38480;&#21046;&#30340;&#32463;&#27982;&#21518;&#26524;
&lt;/p&gt;
&lt;p&gt;
Economic Consequences of Online Tracking Restrictions. (arXiv:2303.09147v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.09147
&lt;/p&gt;
&lt;p&gt;
&#35813;&#25991;&#20171;&#32461;&#20102;&#38480;&#21046;&#22312;&#32447;&#36861;&#36394;&#29992;&#25143;&#30340;&#26102;&#38388;&#65292;&#38024;&#23545;&#20986;&#29256;&#21830;&#21487;&#33021;&#20135;&#29983;&#30340;&#32463;&#27982;&#24433;&#21709;&#20570;&#20102;&#19968;&#20010;&#25104;&#26412;&#25928;&#30410;&#20998;&#26512;&#65292;&#30740;&#31350;&#21457;&#29616;Cookie&#23551;&#21629;&#38480;&#21046;&#22312;&#19968;&#24180;&#65288;&#20004;&#24180;&#65289;&#20250;&#20351;&#20854;&#20215;&#20540;&#38477;&#20302;25&#65285;&#65288;19&#65285;&#65289;&#65292;&#36825;&#34920;&#31034;&#25152;&#26377;Cookie&#20215;&#20540;&#20943;&#23569;&#20102;9&#65285;&#65288;5&#65285;&#65289;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36817;&#24180;&#26469;&#65292;&#27431;&#27954;&#30417;&#31649;&#26426;&#26500;&#19968;&#30452;&#22312;&#23601;&#38480;&#21046;&#22312;&#32447;&#36861;&#36394;&#29992;&#25143;&#30340;&#26102;&#38388;&#20197;&#26356;&#22909;&#22320;&#20445;&#25252;&#28040;&#36153;&#32773;&#38544;&#31169;&#38382;&#39064;&#23637;&#24320;&#36777;&#35770;&#12290;&#23613;&#31649;&#36825;&#20123;&#36777;&#35770;&#20855;&#26377;&#37325;&#35201;&#24847;&#20041;&#65292;&#20294;&#26174;&#28982;&#32570;&#20047;&#20219;&#20309;&#32508;&#21512;&#30340;&#25104;&#26412;&#25928;&#30410;&#20998;&#26512;&#12290;&#26412;&#25991;&#20174;&#25104;&#26412;&#26041;&#38754;&#25552;&#20986;&#20102;&#19968;&#31181;&#26041;&#27861;&#65292;&#26088;&#22312;&#20272;&#35745;&#38480;&#21046;Cookie&#23551;&#21629;&#23545;&#20986;&#29256;&#21830;&#30340;&#32463;&#27982;&#24433;&#21709;&#12290;&#23545;&#22312;2.5&#24180;&#20869;&#25910;&#21040;1.28&#20159;&#24191;&#21578;&#23637;&#31034;&#30340;54,127&#20010;&#29992;&#25143;&#30340;Cookie&#36827;&#34892;&#30340;&#23454;&#35777;&#30740;&#31350;&#24471;&#20986;&#20102;&#24179;&#22343;Cookie&#23551;&#21629;&#20026;279&#22825;&#65292;&#24179;&#22343;&#20215;&#20540;&#20026;2.52&#27431;&#20803;/&#20010;&#12290;&#21482;&#26377;13%&#30340;cookie&#20250;&#38543;&#26102;&#38388;&#22686;&#20540;&#65292;&#20294;&#23427;&#20204;&#30340;&#24179;&#22343;&#20215;&#20540;&#32422;&#20026;&#25152;&#26377;cookie&#24179;&#22343;&#20215;&#20540;&#30340;&#22235;&#20493;&#12290;&#23558;Cookie&#23551;&#21629;&#38480;&#21046;&#22312;&#19968;&#24180;&#65288;&#20004;&#24180;&#65289;&#20250;&#20351;&#20854;&#23551;&#21629;&#20215;&#20540;&#38477;&#20302;25&#65285;&#65288;19&#65285;&#65289;&#65292;&#36825;&#34920;&#31034;&#25152;&#26377;Cookie&#20215;&#20540;&#20943;&#23569;&#20102;9&#65285;&#65288;5&#65285;&#65289;&#12290;&#37492;&#20110;106&#20159;&#27431;&#20803;&#30340;&#22522;&#20110;Cookie&#30340;&#23637;&#31034;&#24191;&#21578;&#25910;&#20837;&#65292;Cookie&#38480;&#21046;&#21487;&#33021;&#23545;&#20986;&#29256;&#21830;&#20135;&#29983;&#26174;&#30528;&#30340;&#32463;&#27982;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
In recent years, European regulators have debated restricting the time an online tracker can track a user to protect consumer privacy better. Despite the significance of these debates, there has been a noticeable absence of any comprehensive cost-benefit analysis. This article fills this gap on the cost side by suggesting an approach to estimate the economic consequences of lifetime restrictions on cookies for publishers. The empirical study on cookies of 54,127 users who received 128 million ad impressions over 2.5 years yields an average cookie lifetime of 279 days, with an average value of EUR 2.52 per cookie. Only 13% of all cookies increase their daily value over time, but their average value is about four times larger than the average value of all cookies. Restricting cookies lifetime to one year (two years) decreases their lifetime value by 25% (19%), which represents a decrease in the value of all cookies of 9% (5%). In light of the EUR 10.60 billion cookie-based display ad rev
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#36890;&#36807;&#20998;&#26512;&#36816;&#29992;&#22826;&#31354;&#32463;&#27982;&#23398;&#26694;&#26550;&#23545;&#26376;&#29699;&#25512;&#36827;&#21058;&#29983;&#20135;&#30340;&#38271;&#26399;&#25104;&#26412;&#36827;&#34892;&#24314;&#27169;&#65292;&#30740;&#31350;&#23545;&#27604;&#20174;&#22320;&#29699;&#21457;&#23556;&#30340;&#25512;&#36827;&#21058;&#26159;&#21542;&#20855;&#26377;&#21830;&#19994;&#31454;&#20105;&#21147;&#65292;&#32467;&#26524;&#21457;&#29616;&#36816;&#36755;&#25104;&#26412;&#27604;&#21644;&#36164;&#26412;&#20135;&#37327;&#27604;&#26159;&#20915;&#23450;&#31454;&#20105;&#21147;&#30340;&#37325;&#35201;&#22240;&#32032;&#65292;&#32780;&#20043;&#21069;&#20998;&#26512;&#32467;&#26524;&#30340;&#20998;&#27495;&#26159;&#30001;&#20110;&#36873;&#25321;&#39640;&#25104;&#26412;&#27604;&#20363;&#30340;&#36816;&#36755;&#26550;&#26500;&#21644;&#24573;&#30053;&#25552;&#39640;&#36164;&#26412;&#20135;&#37327;&#27604;&#30340;&#20851;&#38190;&#22240;&#32032;&#36896;&#25104;&#30340;&#12290;</title><link>http://arxiv.org/abs/2303.09011</link><description>&lt;p&gt;
&#22826;&#31354;&#32463;&#27982;&#23398;&#21644;&#26376;&#29699;&#34893;&#29983;&#25512;&#36827;&#21058;&#31454;&#20105;&#21147;
&lt;/p&gt;
&lt;p&gt;
Economics of In-Space Industry and Competitiveness of Lunar-Derived Rocket Propellant. (arXiv:2303.09011v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.09011
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36890;&#36807;&#20998;&#26512;&#36816;&#29992;&#22826;&#31354;&#32463;&#27982;&#23398;&#26694;&#26550;&#23545;&#26376;&#29699;&#25512;&#36827;&#21058;&#29983;&#20135;&#30340;&#38271;&#26399;&#25104;&#26412;&#36827;&#34892;&#24314;&#27169;&#65292;&#30740;&#31350;&#23545;&#27604;&#20174;&#22320;&#29699;&#21457;&#23556;&#30340;&#25512;&#36827;&#21058;&#26159;&#21542;&#20855;&#26377;&#21830;&#19994;&#31454;&#20105;&#21147;&#65292;&#32467;&#26524;&#21457;&#29616;&#36816;&#36755;&#25104;&#26412;&#27604;&#21644;&#36164;&#26412;&#20135;&#37327;&#27604;&#26159;&#20915;&#23450;&#31454;&#20105;&#21147;&#30340;&#37325;&#35201;&#22240;&#32032;&#65292;&#32780;&#20043;&#21069;&#20998;&#26512;&#32467;&#26524;&#30340;&#20998;&#27495;&#26159;&#30001;&#20110;&#36873;&#25321;&#39640;&#25104;&#26412;&#27604;&#20363;&#30340;&#36816;&#36755;&#26550;&#26500;&#21644;&#24573;&#30053;&#25552;&#39640;&#36164;&#26412;&#20135;&#37327;&#27604;&#30340;&#20851;&#38190;&#22240;&#32032;&#36896;&#25104;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20998;&#26512;&#20102;&#19968;&#31181;&#22312;&#20004;&#20010;&#26143;&#29699;&#38388;&#36827;&#34892;&#30340;&#22826;&#31354;&#20135;&#19994;&#30340;&#32463;&#27982;&#21442;&#25968;&#65292;&#36164;&#26412;&#22312;&#31532;&#19968;&#20010;&#26143;&#29699;&#19978;&#21046;&#36896;&#65292;&#36816;&#24448;&#31532;&#20108;&#20010;&#26143;&#29699;&#19978;&#36827;&#34892;&#36828;&#31243;&#25805;&#20316;&#65292;&#20135;&#21697;&#20877;&#34987;&#36816;&#36755;&#31163;&#24320;&#31532;&#20108;&#20010;&#26143;&#29699;&#36827;&#34892;&#28040;&#36153;&#12290;&#36816;&#29992;&#36825;&#19968;&#26694;&#26550;&#65292;&#23545;&#26376;&#29699;&#25512;&#36827;&#21058;&#29983;&#20135;&#30340;&#38271;&#26399;&#25104;&#26412;&#36827;&#34892;&#24314;&#27169;&#65292;&#20197;&#22238;&#31572;&#23427;&#26159;&#21542;&#19982;&#20174;&#22320;&#29699;&#21457;&#23556;&#30340;&#25512;&#36827;&#21058;&#20855;&#26377;&#21830;&#19994;&#31454;&#20105;&#21147;&#12290;&#20043;&#21069;&#30340;&#25216;&#26415;&#32463;&#27982;&#20998;&#26512;&#22312;&#36825;&#19968;&#38382;&#39064;&#19978;&#23384;&#22312;&#20998;&#27495;&#12290;&#36164;&#26412;&#36816;&#36755;&#30340;&#25104;&#26412;&#27604;&#20363;&#21644;&#36164;&#26412;&#29983;&#20135;&#30340;&#20135;&#37327;&#27604;&#34987;&#30830;&#23450;&#20026;&#20915;&#23450;&#31454;&#20105;&#21147;&#30340;&#26368;&#37325;&#35201;&#22240;&#32032;&#12290;&#20998;&#26512;&#20102;&#20043;&#21069;&#30340;&#25216;&#26415;&#32463;&#27982;&#20998;&#26512;&#22914;&#20309;&#22788;&#29702;&#36825;&#20004;&#20010;&#25351;&#26631;&#12290;&#25351;&#20986;&#20102;&#19968;&#20123;&#25216;&#26415;&#32463;&#27982;&#20998;&#26512;&#20013;&#30340;&#20851;&#38190;&#38169;&#35823;&#65306;&#36873;&#25321;&#20855;&#26377;&#39640;&#25104;&#26412;&#27604;&#20363;&#30340;&#36816;&#36755;&#26550;&#26500;&#65292;&#24182;&#24573;&#30053;&#20102;&#21487;&#20197;&#23454;&#29616;&#36275;&#22815;&#20135;&#37327;&#27604;&#30340;&#36164;&#26412;&#36873;&#25321;&#12290;&#24080;&#31735;&#21319;&#21326;&#25216;&#26415;&#30340;&#20135;&#37327;&#27604;&#20540;&#25509;&#36817;1&#12290;
&lt;/p&gt;
&lt;p&gt;
Economic parameters are identified for an in-space industry where the capital is made on one planet, it is transported to and teleoperated on a second planet, and the product is transported off the second planet for consumption. This framework is used to model the long-run cost of lunar propellant production to help answer whether it is commercially competitive against propellant launched from Earth. The prior techno-economic analyses (TEAs) of lunar propellant production had disagreed over this. The "gear ratio on cost" for capital transport, G, and the production mass ratio of the capital, phi, are identified as the most important factors determining competitiveness. The prior TEAs are examined for how they handled these two metrics. This identifies crucial mistakes in some of the TEAs: choosing transportation architectures with high G, and neglecting to make choices for the capital that could achieve adequate phi. The tent sublimation technology has a value of phi that is an order o
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#30005;&#21147;&#38656;&#27714;&#21709;&#24212;&#35745;&#21010;&#20013;&#30340;&#20449;&#24687;&#20256;&#36755;&#38382;&#39064;&#65292;&#21457;&#29616;&#22914;&#26524;&#30005;&#21147;&#20215;&#26684;&#23450;&#20026;&#20854;&#29983;&#20135;&#36793;&#38469;&#25104;&#26412;&#65292;&#21017;&#31995;&#32479;&#36816;&#33829;&#21830;&#27809;&#26377;&#27450;&#39575;&#30340;&#21160;&#26426;&#19988;&#24635;&#26159;&#35828;&#30495;&#35805;&#12290;</title><link>http://arxiv.org/abs/2302.12770</link><description>&lt;p&gt;
&#30005;&#21147;&#38656;&#27714;&#21709;&#24212;&#30340;&#20449;&#21495;&#20256;&#36755;&#65306;&#20309;&#26102;&#35828;&#23454;&#35805;&#26368;&#20248;&#65311;
&lt;/p&gt;
&lt;p&gt;
Signalling for Electricity Demand Response: When is Truth Telling Optimal?. (arXiv:2302.12770v2 [eess.SY] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2302.12770
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#30005;&#21147;&#38656;&#27714;&#21709;&#24212;&#35745;&#21010;&#20013;&#30340;&#20449;&#24687;&#20256;&#36755;&#38382;&#39064;&#65292;&#21457;&#29616;&#22914;&#26524;&#30005;&#21147;&#20215;&#26684;&#23450;&#20026;&#20854;&#29983;&#20135;&#36793;&#38469;&#25104;&#26412;&#65292;&#21017;&#31995;&#32479;&#36816;&#33829;&#21830;&#27809;&#26377;&#27450;&#39575;&#30340;&#21160;&#26426;&#19988;&#24635;&#26159;&#35828;&#30495;&#35805;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20840;&#29699;&#30340;&#20844;&#29992;&#20107;&#19994;&#21644;&#36755;&#30005;&#31995;&#32479;&#36816;&#33829;&#21830;&#23454;&#26045;&#38656;&#27714;&#21709;&#24212;&#35745;&#21010;&#65292;&#36890;&#36807;&#21521;&#26368;&#32456;&#29992;&#25143;&#21457;&#36865;&#20379;&#38656;&#29366;&#24577;&#20449;&#24687;&#26469;&#38477;&#20302;&#30005;&#21147;&#28040;&#32791;&#12290;&#25105;&#20204;&#26500;&#24314;&#20102;&#19968;&#20010;&#36125;&#21494;&#26031;&#35828;&#26381;&#27169;&#22411;&#26469;&#20998;&#26512;&#36825;&#31181;&#38656;&#27714;&#21709;&#24212;&#35745;&#21010;&#12290;&#20351;&#29992;&#19968;&#20010;&#31616;&#21333;&#30340;&#27169;&#22411;&#65292;&#21253;&#25324;&#20004;&#20010;&#26102;&#38388;&#27493;&#39588;&#29992;&#20110;&#21512;&#21516;&#31614;&#32626;&#21644;&#21796;&#37266;&#20197;&#21450;&#20004;&#20010;&#29366;&#24577;&#30340;&#21457;&#30005;&#29366;&#24577;&#65292;&#20998;&#26512;&#30005;&#21147;&#23450;&#20215;&#19982;TSO&#27498;&#26354;&#20449;&#24687;&#30340;&#30495;&#23454;&#29366;&#24577;&#20043;&#38388;&#30340;&#20851;&#31995;&#12290;&#25105;&#20204;&#34920;&#26126;&#65292;&#22914;&#26524;&#30005;&#21147;&#20215;&#26684;&#23450;&#20026;&#20854;&#29983;&#20135;&#36793;&#38469;&#25104;&#26412;&#65292;&#21017;TSO&#27809;&#26377;&#27450;&#39575;&#30340;&#21160;&#26426;&#19988;&#24635;&#26159;&#35828;&#30495;&#35805;&#12290;&#21478;&#19968;&#26041;&#38754;&#65292;&#25105;&#20204;&#25552;&#20379;&#20102;&#36807;&#39640;&#23450;&#20215;&#23548;&#33268;TSO&#21521;&#29992;&#25143;&#25552;&#20379;&#26080;&#20449;&#24687;&#30340;&#26465;&#20214;&#12290;
&lt;/p&gt;
&lt;p&gt;
Utilities and transmission system operators (TSO) around the world implement demand response programs for reducing electricity consumption by sending information on the state of balance between supply demand to end-use consumers. We construct a Bayesian persuasion model to analyse such demand response programs. Using a simple model consisting of two time steps for contract signing and invoking, and two states of the state of generation, we analyse the relation between the pricing of electricity and the incentives of the TSO to garble information about the true state of the generation. We show that if the electricity is priced at its marginal cost of production, the TSO has no incentive to lie and always tells the truth. On the other hand, we provide conditions where overpricing of electricity leads the TSO to provide no information to the consumer.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#26356;&#24378;&#30340;&#21333;&#35843;&#20449;&#21495;&#24179;&#34913;&#65292;&#25552;&#20986;&#20102;&#38024;&#23545;&#31283;&#23450;&#21305;&#37197;&#30340;&#31454;&#20105;&#24615;&#20449;&#21495;&#22343;&#34913;&#27010;&#24565;&#65292;&#24182;&#32473;&#20986;&#20102;&#28385;&#36275; D1 &#20934;&#21017;&#30340;&#26465;&#20214;&#12290;&#22312;&#20855;&#26377;&#20934;&#32447;&#24615;&#25928;&#29992;&#20989;&#25968;&#30340;&#21333;&#19968;&#21305;&#37197;&#24066;&#22330;&#19978;&#24314;&#31435;&#20102;&#21807;&#19968;&#30340;&#26356;&#24378;&#21333;&#35843;&#24179;&#34913;&#12290;</title><link>http://arxiv.org/abs/2109.03370</link><description>&lt;p&gt;
&#26356;&#24378;&#30340;&#21333;&#35843;&#20449;&#21495;&#24179;&#34913;
&lt;/p&gt;
&lt;p&gt;
Stronger Monotone Signaling Equilibrium. (arXiv:2109.03370v3 [econ.TH] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2109.03370
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#26356;&#24378;&#30340;&#21333;&#35843;&#20449;&#21495;&#24179;&#34913;&#65292;&#25552;&#20986;&#20102;&#38024;&#23545;&#31283;&#23450;&#21305;&#37197;&#30340;&#31454;&#20105;&#24615;&#20449;&#21495;&#22343;&#34913;&#27010;&#24565;&#65292;&#24182;&#32473;&#20986;&#20102;&#28385;&#36275; D1 &#20934;&#21017;&#30340;&#26465;&#20214;&#12290;&#22312;&#20855;&#26377;&#20934;&#32447;&#24615;&#25928;&#29992;&#20989;&#25968;&#30340;&#21333;&#19968;&#21305;&#37197;&#24066;&#22330;&#19978;&#24314;&#31435;&#20102;&#21807;&#19968;&#30340;&#26356;&#24378;&#21333;&#35843;&#24179;&#34913;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#21333;&#35843;&#20449;&#21495;&#24179;&#34913;&#65292;&#20854;&#20013;&#24179;&#34913;&#32467;&#26524;&#8212;&#8212;&#34892;&#21160;&#12289;&#21453;&#24212;&#12289;&#20449;&#24565;&#65288;&#21305;&#37197;&#27169;&#22411;&#20013;&#30340;&#21305;&#37197;&#65289;&#8212;&#8212;&#22343;&#22312;&#26356;&#24378;&#30340;&#38598;&#21512;&#24207;&#21015;&#20013;&#26159;&#21333;&#35843;&#30340;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#22914;&#26524;&#21457;&#36865;&#32773;&#30340;&#25928;&#29992;&#26159;&#21333;&#35843;&#36229;&#27169;&#22411;&#30340;&#65292;&#21017;&#23545;&#20110;&#19968;&#23545;&#21457;&#36865;&#32773;&#21644;&#25509;&#25910;&#32773;&#30340;&#21338;&#24328;&#65292;&#22914;&#26524;&#36890;&#36807; D1 &#20934;&#21017;&#65288;Cho &#21644; Kreps&#65288;1987&#65289;&#12289;Banks &#21644; Sobel(1987)&#65289;&#21017;&#32431;&#31574;&#30053;&#23436;&#32654;&#36125;&#21494;&#26031;&#22343;&#34913;&#26356;&#24378;&#21333;&#35843;&#12290;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#31181;&#22522;&#20110;&#31283;&#23450;&#21305;&#37197;&#30340;&#21333;&#19968;&#21305;&#37197;&#24066;&#22330;&#19978;&#30340;&#31454;&#20105;&#24615;&#20449;&#21495;&#22343;&#34913;&#65288;CSE&#65289;&#27010;&#24565;&#65292;&#20854;&#20013;&#21457;&#36865;&#32773;&#21644;&#25509;&#25910;&#32773;&#37117;&#26159;&#24322;&#26500;&#30340;&#36830;&#32493;&#21464;&#37327;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#22914;&#26524;&#21457;&#36865;&#32773;&#25928;&#29992;&#26159;&#21333;&#35843;&#36229;&#27169;&#22411;&#30340;&#35805;&#65292;&#22914;&#26524;&#25509;&#25910;&#32773;&#25928;&#29992;&#26159;&#24369;&#21333;&#35843;&#36229;&#27169;&#22411;&#65292;&#37027;&#20040; CSE &#26356;&#24378;&#21333;&#35843;&#65292;&#24403;&#19988;&#20165;&#24403;&#23427;&#36890;&#36807; D1 &#20934;&#21017;&#12290;&#26368;&#21518;&#65292;&#22312;&#20855;&#26377;&#20934;&#32447;&#24615;&#25928;&#29992;&#20989;&#25968;&#30340;&#21333;&#19968;&#21305;&#37197;&#24066;&#22330;&#19978;&#65292;&#22312;&#25509;&#25910;&#32773;&#21487;&#20197;&#37319;&#21462;&#20219;&#20309;&#21487;&#34892;&#21453;&#24212;&#30340;&#21306;&#38388;&#20869;&#65292;&#24314;&#31435;&#20102;&#19968;&#20010;&#21807;&#19968;&#30340;&#26356;&#24378;&#21333;&#35843;&#24179;&#34913;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study monotone signaling equilibrium where equilibrium outcomes - actions, reactions, beliefs (and matching in a matching model) - are all monotone in the stronger set order. We show that if the sender's utility is monotone-supermodular, a pure-strategy perfect Bayesian equilibrium of games with one sender and one receiver is stronger monotone if and only if it passes Criterion D1 (Cho and Kreps (1987), Banks and Sobel (1987)). We introduce a notion of competitive signaling equilibrium (CSE) in one-to-one matching markets with a continuum of heterogeneous senders and receivers, based on the notion of stable matching. We show that if the sender utility is monotone-supermodular and the receiver's utility is weakly monotone-supermodular, a CSE is stronger monotone if and only if it passes Criterion D1. Finally, in one-to-one matching markets with quasilinear utilities, a unique stronger monotone equilibrium is established given any interval of feasible reactions that receivers can take
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;Bayesian&#20572;&#26102;&#38382;&#39064;&#30340;&#36870;&#24378;&#21270;&#23398;&#20064;&#26694;&#26550;&#65292;&#32467;&#21512;&#24494;&#35266;&#32463;&#27982;&#23398;&#20013;&#30340;Bayesian&#25581;&#31034;&#20559;&#22909;&#24605;&#36335;&#65292;&#36890;&#36807;&#35266;&#23519;Bayesian&#20915;&#31574;&#32773;&#30340;&#34892;&#21160;&#65292;&#30830;&#23450;&#20854;&#30340;&#26368;&#20248;&#24615;&#12290;&#24182;&#19988;&#36890;&#36807;&#20004;&#20010;&#20572;&#26102;&#38382;&#39064;&#31034;&#20363;&#24471;&#21040;&#20102;&#39564;&#35777;&#65292;&#24182;&#19988;&#24050;&#22312;&#19968;&#20010;&#30495;&#23454;&#30340;&#20363;&#23376;&#20013;&#24471;&#21040;&#20102;&#39640;&#31934;&#24230;&#22320;&#39044;&#27979;&#29992;&#25143;&#21442;&#19982;&#24230;&#12290;</title><link>http://arxiv.org/abs/2007.03481</link><description>&lt;p&gt;
&#12298;Bayesian&#20572;&#26102;&#38382;&#39064;&#30340;&#36870;&#24378;&#21270;&#23398;&#20064;&#30340;&#20805;&#20998;&#24517;&#35201;&#26465;&#20214;&#12299;
&lt;/p&gt;
&lt;p&gt;
Necessary and Sufficient Conditions for Inverse Reinforcement Learning of Bayesian Stopping Time Problems. (arXiv:2007.03481v6 [cs.LG] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2007.03481
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;Bayesian&#20572;&#26102;&#38382;&#39064;&#30340;&#36870;&#24378;&#21270;&#23398;&#20064;&#26694;&#26550;&#65292;&#32467;&#21512;&#24494;&#35266;&#32463;&#27982;&#23398;&#20013;&#30340;Bayesian&#25581;&#31034;&#20559;&#22909;&#24605;&#36335;&#65292;&#36890;&#36807;&#35266;&#23519;Bayesian&#20915;&#31574;&#32773;&#30340;&#34892;&#21160;&#65292;&#30830;&#23450;&#20854;&#30340;&#26368;&#20248;&#24615;&#12290;&#24182;&#19988;&#36890;&#36807;&#20004;&#20010;&#20572;&#26102;&#38382;&#39064;&#31034;&#20363;&#24471;&#21040;&#20102;&#39564;&#35777;&#65292;&#24182;&#19988;&#24050;&#22312;&#19968;&#20010;&#30495;&#23454;&#30340;&#20363;&#23376;&#20013;&#24471;&#21040;&#20102;&#39640;&#31934;&#24230;&#22320;&#39044;&#27979;&#29992;&#25143;&#21442;&#19982;&#24230;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;Bayesian&#20572;&#26102;&#38382;&#39064;&#30340;&#36870;&#24378;&#21270;&#23398;&#20064;&#65288;IRL&#65289;&#26694;&#26550;&#12290;&#36890;&#36807;&#35266;&#23519;Bayesian&#20915;&#31574;&#32773;&#30340;&#34892;&#21160;&#65292;&#25105;&#20204;&#25552;&#20379;&#20102;&#19968;&#31181;&#24517;&#35201;&#19988;&#20805;&#20998;&#30340;&#26465;&#20214;&#26469;&#30830;&#23450;&#36825;&#20123;&#34892;&#21160;&#26159;&#21542;&#19982;&#20248;&#21270;&#25104;&#26412;&#20989;&#25968;&#19968;&#33268;&#12290;&#22312;Bayesian&#65288;&#37096;&#20998;&#35266;&#23519;&#65289;&#24773;&#20917;&#19979;&#65292;&#36870;&#21521;&#23398;&#20064;&#32773;&#33021;&#22815;&#26368;&#22909;&#22320;&#30830;&#23450;&#38024;&#23545;&#35266;&#23519;&#21040;&#30340;&#31574;&#30053;&#30340;&#26368;&#20248;&#24615;&#12290;&#25105;&#20204;&#30340;IRL&#31639;&#27861;&#30830;&#23450;&#26368;&#20248;&#24615;&#65292;&#28982;&#21518;&#26500;&#24314;&#25104;&#26412;&#20989;&#25968;&#30340;&#20272;&#35745;&#20540;&#65292;&#26159;&#19968;&#20010;&#38598;&#21512;&#20540;&#12290;&#20026;&#20102;&#23454;&#29616;&#36825;&#26679;&#19968;&#20010;IRL&#30446;&#26631;&#65292;&#25105;&#20204;&#20351;&#29992;&#20102;&#26469;&#33258;&#24494;&#35266;&#32463;&#27982;&#23398;&#30340;Bayesian&#25581;&#31034;&#20559;&#22909;&#30340;&#26032;&#24605;&#36335;&#12290;&#25105;&#20204;&#36890;&#36807;&#20004;&#20010;&#37325;&#35201;&#30340;&#20572;&#26102;&#38382;&#39064;&#31034;&#20363;&#65292;&#21363;&#65292;&#39034;&#24207;&#20551;&#35774;&#26816;&#39564;&#21644;Bayesian&#25628;&#32034;&#65292;&#35828;&#26126;&#20102;&#25152;&#25552;&#35758;&#30340;IRL&#26041;&#26696;&#12290;&#20316;&#20026;&#19968;&#20010;&#30495;&#23454;&#19990;&#30028;&#30340;&#20363;&#23376;&#65292;&#25105;&#20204;&#20351;&#29992;&#26469;&#33258;190000&#20010;&#35270;&#39057;&#30340;&#20803;&#25968;&#25454;&#30340;YouTube&#25968;&#25454;&#38598;&#35828;&#26126;&#20102;&#25152;&#25552;&#35758;&#30340;IRL&#26041;&#27861;&#22914;&#20309;&#39640;&#31934;&#24230;&#22320;&#39044;&#27979;&#22312;&#32447;&#22810;&#23186;&#20307;&#24179;&#21488;&#20013;&#29992;&#25143;&#30340;&#21442;&#19982;&#24230;&#12290;&#26368;&#21518;&#65292;&#23545;&#20110;&#35813;&#31639;&#27861;&#30340;&#26410;&#26469;&#30740;&#31350;&#26041;&#21521;&#20570;&#20102;&#26368;&#21518;&#35752;&#35770;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper presents an inverse reinforcement learning~(IRL) framework for Bayesian stopping time problems. By observing the actions of a Bayesian decision maker, we provide a necessary and sufficient condition to identify if these actions are consistent with optimizing a cost function. In a Bayesian (partially observed) setting, the inverse learner can at best identify optimality wrt the observed strategies. Our IRL algorithm identifies optimality and then constructs set-valued estimates of the cost function.To achieve this IRL objective, we use novel ideas from Bayesian revealed preferences stemming from microeconomics. We illustrate the proposed IRL scheme using two important examples of stopping time problems, namely, sequential hypothesis testing and Bayesian search. As a real-world example, we illustrate using a YouTube dataset comprising metadata from 190000 videos how the proposed IRL method predicts user engagement in online multimedia platforms with high accuracy. Finally, for
&lt;/p&gt;</description></item></channel></rss>