<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#19968;&#31181;&#21033;&#29992;&#32467;&#26500;&#24615;&#20914;&#20987;&#26041;&#24046;&#30340;&#31361;&#21464;&#26469;&#35782;&#21035;SVAR&#30340;&#26041;&#27861;&#65292;&#25552;&#20986;&#20102;&#20914;&#28608;&#21709;&#24212;&#30340;&#24050;&#30830;&#23450;&#38598;&#65292;&#24182;&#23637;&#31034;&#20102;&#35745;&#31639;&#26041;&#27861;&#12290;</title><link>https://arxiv.org/abs/2403.06879</link><description>&lt;p&gt;
&#37096;&#20998;&#35782;&#21035;&#30340;&#24322;&#26041;&#24046;SVARs
&lt;/p&gt;
&lt;p&gt;
Partially identified heteroskedastic SVARs
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.06879
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#19968;&#31181;&#21033;&#29992;&#32467;&#26500;&#24615;&#20914;&#20987;&#26041;&#24046;&#30340;&#31361;&#21464;&#26469;&#35782;&#21035;SVAR&#30340;&#26041;&#27861;&#65292;&#25552;&#20986;&#20102;&#20914;&#28608;&#21709;&#24212;&#30340;&#24050;&#30830;&#23450;&#38598;&#65292;&#24182;&#23637;&#31034;&#20102;&#35745;&#31639;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#21033;&#29992;&#32467;&#26500;&#24615;&#20914;&#20987;&#26041;&#24046;&#30340;&#31361;&#21464;&#26469;&#35782;&#21035;&#32467;&#26500;&#21521;&#37327;&#33258;&#22238;&#24402;&#27169;&#22411;&#65288;SVARs&#65289;&#12290;&#23545;&#20110;&#36825;&#31867;&#27169;&#22411;&#30340;&#28857;&#35782;&#21035;&#20381;&#36182;&#20110;&#28041;&#21450;&#32422;&#20943;&#22411;&#35823;&#24046;&#30340;&#21327;&#26041;&#24046;&#30697;&#38453;&#30340;&#29305;&#24449;&#20540;&#20998;&#35299;&#65292;&#24182;&#35201;&#27714;&#25152;&#26377;&#29305;&#24449;&#20540;&#26159;&#19981;&#21516;&#30340;&#12290;&#28982;&#32780;&#65292;&#22312;&#23384;&#22312;&#22810;&#37325;&#29305;&#24449;&#20540;&#30340;&#24773;&#20917;&#19979;&#65292;&#36825;&#31181;&#28857;&#35782;&#21035;&#20250;&#22833;&#36133;&#12290;&#22312;&#19968;&#20010;&#23454;&#35777;&#30456;&#20851;&#30340;&#22330;&#26223;&#20013;&#20986;&#29616;&#36825;&#31181;&#24773;&#20917;&#65292;&#20363;&#22914;&#21482;&#26377;&#19968;&#20010;&#23376;&#38598;&#30340;&#32467;&#26500;&#24615;&#20914;&#20987;&#26377;&#20102;&#26041;&#24046;&#30340;&#31361;&#21464;&#65292;&#25110;&#32773;&#20854;&#20013;&#19968;&#32452;&#21464;&#37327;&#23637;&#31034;&#20102;&#30456;&#21516;&#24133;&#24230;&#30340;&#26041;&#24046;&#21464;&#21270;&#12290;&#32467;&#21512;&#23545;&#32467;&#26500;&#21442;&#25968;&#21644;&#20914;&#28608;&#21709;&#24212;&#30340;&#38646;&#25110;&#31526;&#21495;&#32422;&#26463;&#65292;&#25105;&#20204;&#24471;&#20986;&#20102;&#20914;&#28608;&#21709;&#24212;&#30340;&#24050;&#30830;&#23450;&#38598;&#65292;&#24182;&#23637;&#31034;&#20102;&#22914;&#20309;&#35745;&#31639;&#23427;&#20204;&#12290;&#25105;&#20204;&#22522;&#20110;&#20026;&#24050;&#30830;&#23450;&#38598;SVARs&#24320;&#21457;&#30340;&#31283;&#20581;&#36125;&#21494;&#26031;&#26041;&#27861;&#36827;&#34892;&#20102;&#20914;&#28608;&#21709;&#24212;&#20989;&#25968;&#30340;&#25512;&#35770;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.06879v1 Announce Type: new  Abstract: This paper studies the identification of Structural Vector Autoregressions (SVARs) exploiting a break in the variances of the structural shocks. Point-identification for this class of models relies on an eigen-decomposition involving the covariance matrices of reduced-form errors and requires that all the eigenvalues are distinct. This point-identification, however, fails in the presence of multiplicity of eigenvalues. This occurs in an empirically relevant scenario where, for instance, only a subset of structural shocks had the break in their variances, or where a group of variables shows a variance shift of the same amount. Together with zero or sign restrictions on the structural parameters and impulse responses, we derive the identified sets for impulse responses and show how to compute them. We perform inference on the impulse response functions, building on the robust Bayesian approach developed for set identified SVARs. To illustr
&lt;/p&gt;</description></item><item><title>&#36890;&#36807;&#25552;&#20986;&#19968;&#31181;&#22522;&#20110;&#25968;&#25454;&#39537;&#21160;&#30340;&#21152;&#26435;Lasso&#20272;&#35745;&#22120;&#65292;&#35299;&#20915;&#39640;&#32500;&#21521;&#37327;&#33258;&#22238;&#24402;&#27169;&#22411;&#20013;&#35843;&#21442;&#36873;&#25321;&#38382;&#39064;&#12290;</title><link>https://arxiv.org/abs/2403.06657</link><description>&lt;p&gt;
&#22522;&#20110;&#25968;&#25454;&#39537;&#21160;&#30340;&#39640;&#32500;&#21521;&#37327;&#33258;&#22238;&#24402;&#35843;&#21442;&#36873;&#25321;
&lt;/p&gt;
&lt;p&gt;
Data-Driven Tuning Parameter Selection for High-Dimensional Vector Autoregressions
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.06657
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#25552;&#20986;&#19968;&#31181;&#22522;&#20110;&#25968;&#25454;&#39537;&#21160;&#30340;&#21152;&#26435;Lasso&#20272;&#35745;&#22120;&#65292;&#35299;&#20915;&#39640;&#32500;&#21521;&#37327;&#33258;&#22238;&#24402;&#27169;&#22411;&#20013;&#35843;&#21442;&#36873;&#25321;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
Lasso&#31867;&#22411;&#30340;&#20272;&#35745;&#22120;&#36890;&#24120;&#29992;&#20110;&#20272;&#35745;&#39640;&#32500;&#26102;&#38388;&#24207;&#21015;&#27169;&#22411;&#12290;Lasso&#30340;&#29702;&#35770;&#20445;&#35777;&#36890;&#24120;&#35201;&#27714;&#36873;&#25321;&#21512;&#36866;&#30340;&#24809;&#32602;&#27700;&#24179;&#65292;&#36825;&#36890;&#24120;&#21462;&#20915;&#20110;&#26410;&#30693;&#30340;&#24635;&#20307;&#25968;&#37327;&#12290;&#28982;&#32780;&#65292;&#24471;&#21040;&#30340;&#20272;&#35745;&#20540;&#21644;&#27169;&#22411;&#20013;&#20445;&#30041;&#30340;&#21464;&#37327;&#25968;&#37327;&#20851;&#38190;&#21462;&#20915;&#20110;&#25152;&#36873;&#25321;&#30340;&#24809;&#32602;&#27700;&#24179;&#12290;&#30446;&#21069;&#65292;&#22312;&#39640;&#32500;&#26102;&#38388;&#24207;&#21015;&#30340;&#24773;&#20917;&#19979;&#27809;&#26377;&#29702;&#35770;&#19978;&#30340;&#25351;&#23548;&#26469;&#20570;&#36825;&#20010;&#36873;&#25321;&#12290;&#25105;&#20204;&#36890;&#36807;&#32771;&#34385;&#20063;&#35768;&#26159;&#26368;&#24120;&#29992;&#30340;&#22810;&#20803;&#26102;&#38388;&#24207;&#21015;&#27169;&#22411;&#20043;&#19968;&#65292;&#32447;&#24615;&#21521;&#37327;&#33258;&#22238;&#24402;&#65288;VAR&#65289;&#27169;&#22411;&#30340;&#20272;&#35745;&#26469;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#20010;&#20197;&#23436;&#20840;&#25968;&#25454;&#39537;&#21160;&#26041;&#24335;&#36873;&#25321;&#24809;&#32602;&#30340;&#21152;&#26435;Lasso&#20272;&#35745;&#37327;&#12290;&#25105;&#20204;&#20026;&#36825;&#19968;&#26041;&#27861;&#24314;&#31435;&#30340;&#29702;&#35770;&#20445;&#35777;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.06657v1 Announce Type: new  Abstract: Lasso-type estimators are routinely used to estimate high-dimensional time series models. The theoretical guarantees established for Lasso typically require the penalty level to be chosen in a suitable fashion often depending on unknown population quantities. Furthermore, the resulting estimates and the number of variables retained in the model depend crucially on the chosen penalty level. However, there is currently no theoretically founded guidance for this choice in the context of high-dimensional time series. Instead one resorts to selecting the penalty level in an ad hoc manner using, e.g., information criteria or cross-validation. We resolve this problem by considering estimation of the perhaps most commonly employed multivariate time series model, the linear vector autoregressive (VAR) model, and propose a weighted Lasso estimator with penalization chosen in a fully data-driven way. The theoretical guarantees that we establish for
&lt;/p&gt;</description></item><item><title>&#25552;&#20986;&#20102;&#19968;&#31181;&#21033;&#29992;&#39640;&#39057;&#25968;&#25454;&#27979;&#35797;&#20581;&#24247;&#21644;&#23601;&#19994;&#39046;&#22495;&#35777;&#26126;&#20559;&#35265;&#30340;&#26032;&#26041;&#27861;&#65292;&#32467;&#26524;&#34920;&#26126;&#65292;&#36864;&#20241;&#21518;&#20986;&#29616;&#30340;&#33258;&#25105;&#35780;&#20272;&#20581;&#24247;&#24613;&#21095;&#19979;&#38477;&#30340;&#24773;&#20917;&#21487;&#33021;&#26159;&#30001;&#20110;&#20559;&#35265;&#23548;&#33268;&#65292;&#20294;&#38543;&#30528;&#26102;&#38388;&#38388;&#38548;&#32553;&#30701;&#65292;&#20559;&#35265;&#30340;&#35777;&#25454;&#36880;&#28176;&#20943;&#23569;&#12290;</title><link>https://arxiv.org/abs/2403.06368</link><description>&lt;p&gt;
&#21033;&#29992;&#20581;&#24247;&#21644;&#23601;&#19994;&#30340;&#39640;&#39057;&#25968;&#25454;&#23545;&#35777;&#26126;&#20559;&#35265;&#36827;&#34892;&#26032;&#30340;&#27979;&#35797;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
A New Testing Method for Justification Bias Using High-Frequency Data of Health and Employment
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.06368
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#21033;&#29992;&#39640;&#39057;&#25968;&#25454;&#27979;&#35797;&#20581;&#24247;&#21644;&#23601;&#19994;&#39046;&#22495;&#35777;&#26126;&#20559;&#35265;&#30340;&#26032;&#26041;&#27861;&#65292;&#32467;&#26524;&#34920;&#26126;&#65292;&#36864;&#20241;&#21518;&#20986;&#29616;&#30340;&#33258;&#25105;&#35780;&#20272;&#20581;&#24247;&#24613;&#21095;&#19979;&#38477;&#30340;&#24773;&#20917;&#21487;&#33021;&#26159;&#30001;&#20110;&#20559;&#35265;&#23548;&#33268;&#65292;&#20294;&#38543;&#30528;&#26102;&#38388;&#38388;&#38548;&#32553;&#30701;&#65292;&#20559;&#35265;&#30340;&#35777;&#25454;&#36880;&#28176;&#20943;&#23569;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
Justification bias&#65292;&#21363;&#36864;&#20241;&#32773;&#21487;&#33021;&#20250;&#25253;&#21578;&#20581;&#24247;&#29366;&#20917;&#19979;&#38477;&#20197;&#21512;&#29702;&#21270;&#20854;&#36864;&#20241;&#65292;&#23545;&#20110;&#36864;&#20241;&#30740;&#31350;&#20013;&#24191;&#27867;&#20351;&#29992;&#30340;&#33258;&#35780;&#20581;&#24247;&#27979;&#37327;&#25552;&#20986;&#20102;&#37325;&#22823;&#20851;&#27880;&#12290;&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#26041;&#27861;&#26469;&#27979;&#35797;&#36825;&#31181;&#20559;&#35265;&#30340;&#23384;&#22312;&#65292;&#31867;&#20284;&#20110;&#22238;&#24402;&#19981;&#36830;&#32493;&#24615;&#30340;&#31934;&#31070;&#12290;&#22522;&#26412;&#24605;&#24819;&#26159;&#65292;&#22312;&#36864;&#20241;&#21518;&#31435;&#21363;&#20986;&#29616;&#30340;&#33258;&#25105;&#35780;&#20272;&#20581;&#24247;&#30340;&#31361;&#28982;&#21464;&#21270;&#26356;&#21487;&#33021;&#26159;&#30001;&#20559;&#35265;&#24341;&#36215;&#30340;&#12290;&#25105;&#20204;&#30340;&#31574;&#30053;&#24471;&#30410;&#20110;&#25552;&#20379;&#27599;&#26376;&#20449;&#24687;&#30340;&#29420;&#29305;&#39640;&#39057;&#25968;&#25454;&#65292;&#30456;&#27604;&#20043;&#19979;&#65292;&#36825;&#20123;&#25968;&#25454;&#25552;&#20379;&#27604;&#20856;&#22411;&#30340;&#20004;&#24180;&#19968;&#27425;&#26356;&#39057;&#32321;&#30340;&#23601;&#19994;&#12289;&#33258;&#25105;&#35780;&#20272;&#20581;&#24247;&#21644;&#23458;&#35266;&#20581;&#24247;&#29366;&#20917;&#30340;&#20449;&#24687;&#12290;&#22312;&#26356;&#24191;&#27867;&#30340;&#36864;&#20241;&#21518;&#26102;&#38388;&#33539;&#22260;&#20869;&#65292;&#25105;&#20204;&#35266;&#23519;&#21040;&#33258;&#25105;&#35780;&#20272;&#30340;&#20581;&#24247;&#29366;&#20917;&#19979;&#38477;&#65292;&#21487;&#33021;&#28304;&#20110;&#35777;&#26126;&#20559;&#35265;&#21644;&#23454;&#38469;&#20581;&#24247;&#29366;&#20917;&#30340;&#21464;&#21270;&#12290;&#28982;&#32780;&#65292;&#36825;&#31181;&#19981;&#21033;&#24433;&#21709;&#22312;&#26102;&#38388;&#38388;&#38548;&#36739;&#30701;&#26102;&#20943;&#23567;&#65292;&#34920;&#26126;&#27809;&#26377;&#36825;&#31181;&#20559;&#35265;&#30340;&#35777;&#25454;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#36824;&#39564;&#35777;&#20102;...
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.06368v1 Announce Type: new  Abstract: Justification bias, wherein retirees may report poorer health to rationalize their retirement, poses a major concern to the widely-used measure of self-assessed health in retirement studies. This paper introduces a novel method for testing the presence of this bias in the spirit of regression discontinuity. The underlying idea is that any sudden shift in self-assessed health immediately following retirement is more likely attributable to the bias. Our strategy is facilitated by a unique high-frequency data that offers monthly, in contrast to the typical biennial, information on employment, self-assessed health, and objective health conditions. Across a wider post-retirement time frame, we observe a decline in self-assessed health, potentially stemming from both justification bias and changes in actual health. However, this adverse effect diminishes with shorter intervals, indicating no evidence of such bias. Our method also validates a w
&lt;/p&gt;</description></item><item><title>&#30740;&#31350;&#21457;&#29616;&#65292;&#23545;&#20110;&#19968;&#20010;agent&#30340;&#20915;&#31574;&#38382;&#39064;&#65292;&#36890;&#36807;&#19968;&#23450;&#25968;&#37327;&#30340;&#25490;&#24207;&#25968;&#25454;&#21487;&#20197;&#35782;&#21035;&#20854;&#26080;&#25903;&#37197;&#34892;&#21160;&#38598;&#21644;&#20351;&#27599;&#20010;&#34892;&#21160;&#26368;&#20248;&#30340;&#20449;&#24565;&#65292;&#32780;&#36890;&#36807;&#23569;&#37327;&#22522;&#25968;&#25968;&#25454;&#21487;&#20197;&#30830;&#23450;&#20854;&#25928;&#29992;&#20989;&#25968;&#12290;</title><link>https://arxiv.org/abs/2403.06344</link><description>&lt;p&gt;
&#33021;&#21542;&#36890;&#36807;&#22768;&#38899;&#20102;&#35299;&#19968;&#20010;&#20915;&#31574;&#38382;&#39064;&#30340;&#24418;&#29366;
&lt;/p&gt;
&lt;p&gt;
Can One Hear the Shape of a Decision Problem?
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.06344
&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#21457;&#29616;&#65292;&#23545;&#20110;&#19968;&#20010;agent&#30340;&#20915;&#31574;&#38382;&#39064;&#65292;&#36890;&#36807;&#19968;&#23450;&#25968;&#37327;&#30340;&#25490;&#24207;&#25968;&#25454;&#21487;&#20197;&#35782;&#21035;&#20854;&#26080;&#25903;&#37197;&#34892;&#21160;&#38598;&#21644;&#20351;&#27599;&#20010;&#34892;&#21160;&#26368;&#20248;&#30340;&#20449;&#24565;&#65292;&#32780;&#36890;&#36807;&#23569;&#37327;&#22522;&#25968;&#25968;&#25454;&#21487;&#20197;&#30830;&#23450;&#20854;&#25928;&#29992;&#20989;&#25968;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25506;&#35752;&#20102;&#19968;&#20010;agent&#30340;&#20915;&#31574;&#38382;&#39064;&#19982;&#22905;&#23545;&#20449;&#24687;&#32467;&#26500;&#30340;&#25490;&#21517;&#20043;&#38388;&#30340;&#32852;&#31995;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#26377;&#38480;&#25968;&#37327;&#30340;agent&#23545;&#23454;&#39564;&#25490;&#24207;&#30340;&#24207;&#25968;&#25968;&#25454;&#36275;&#20197;&#30830;&#23450;&#22905;&#30340;&#65288;&#26377;&#38480;&#65289;&#26080;&#25903;&#37197;&#34892;&#21160;&#38598;&#65288;&#36890;&#36807;&#37325;&#26032;&#26631;&#35760;&#21644;&#22797;&#21046;&#65289;&#20197;&#21450;&#20351;&#27599;&#20010;&#36825;&#26679;&#30340;&#34892;&#21160;&#26368;&#20248;&#30340;&#20449;&#24565;&#12290;&#39069;&#22806;&#30340;&#23569;&#37327;&#22522;&#25968;&#25968;&#25454;&#65292;&#23558;&#30456;&#23545;&#22320;&#35780;&#20272;agent&#23545;&#26377;&#38480;&#23545;&#23454;&#39564;&#30340;&#25968;&#23545;&#30340;&#20215;&#20540;&#65292;&#21487;&#20197;&#30830;&#23450;&#22905;&#30340;&#25928;&#29992;&#20989;&#25968;&#65292;&#30452;&#21040;&#19981;&#21463;&#34892;&#21160;&#29420;&#31435;&#30340;&#25903;&#20184;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.06344v1 Announce Type: new  Abstract: We explore the connection between an agent's decision problem and her ranking of information structures. We find that a finite amount of ordinal data on the agent's ranking of experiments is enough to identify her (finite) set of undominated actions (up to relabeling and duplication) and the beliefs rendering each such action optimal. An additional smattering of cardinal data, comparing the relative value to the agent of finitely many pairs of experiments, identifies her utility function up to an action-independent payoff.
&lt;/p&gt;</description></item><item><title>&#25552;&#20986;&#20102;&#19968;&#31181;&#20174;&#22122;&#22768;&#21644;&#24322;&#27493;&#39640;&#39057;&#25968;&#25454;&#20013;&#20272;&#31639;&#29616;&#36135;&#27874;&#21160;&#29575;&#30697;&#38453;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#26680;&#21152;&#26435;&#30340;&#39044;&#24179;&#22343;&#26041;&#27861;&#22788;&#29702;&#24494;&#35266;&#32467;&#26500;&#22122;&#22768;&#21644;&#19981;&#21516;&#27493;&#24615;&#38382;&#39064;&#65292;&#36890;&#36807;&#36830;&#32493;&#26102;&#38388;&#22240;&#23376;&#27169;&#22411;&#20272;&#35745;&#20844;&#20849;&#22240;&#23376;&#21644;&#36733;&#33655;&#65292;&#24182;&#32467;&#21512;POET&#21644;&#26680;&#24179;&#28369;&#25216;&#26415;&#26469;&#23454;&#29616;&#20272;&#35745;&#12290;</title><link>https://arxiv.org/abs/2403.06246</link><description>&lt;p&gt;
&#20174;&#22122;&#22768;&#21644;&#24322;&#27493;&#39640;&#39057;&#25968;&#25454;&#20013;&#20272;&#31639;&#22522;&#20110;&#22240;&#23376;&#30340;&#29616;&#36135;&#27874;&#21160;&#29575;&#30697;&#38453;
&lt;/p&gt;
&lt;p&gt;
Estimating Factor-Based Spot Volatility Matrices with Noisy and Asynchronous High-Frequency Data
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.06246
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#20174;&#22122;&#22768;&#21644;&#24322;&#27493;&#39640;&#39057;&#25968;&#25454;&#20013;&#20272;&#31639;&#29616;&#36135;&#27874;&#21160;&#29575;&#30697;&#38453;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#26680;&#21152;&#26435;&#30340;&#39044;&#24179;&#22343;&#26041;&#27861;&#22788;&#29702;&#24494;&#35266;&#32467;&#26500;&#22122;&#22768;&#21644;&#19981;&#21516;&#27493;&#24615;&#38382;&#39064;&#65292;&#36890;&#36807;&#36830;&#32493;&#26102;&#38388;&#22240;&#23376;&#27169;&#22411;&#20272;&#35745;&#20844;&#20849;&#22240;&#23376;&#21644;&#36733;&#33655;&#65292;&#24182;&#32467;&#21512;POET&#21644;&#26680;&#24179;&#28369;&#25216;&#26415;&#26469;&#23454;&#29616;&#20272;&#35745;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#20272;&#31639;&#26041;&#27861;&#65292;&#29992;&#20110;&#20174;&#22122;&#22768;&#21644;&#24322;&#27493;&#39640;&#39057;&#25968;&#25454;&#20013;&#25910;&#38598;&#30340;&#22823;&#37327;&#36164;&#20135;&#30340;&#29616;&#36135;&#27874;&#21160;&#29575;&#30697;&#38453;&#65292;&#35813;&#26041;&#27861;&#28385;&#36275;&#20302;&#31209;&#21152;&#31232;&#30095;&#32467;&#26500;&#12290;&#25105;&#20204;&#20801;&#35768;&#22122;&#22768;&#36807;&#31243;&#22312;&#26102;&#38388;&#19978;&#30456;&#20851;&#65292;&#24322;&#26041;&#24046;&#65292;&#28176;&#36817;&#28040;&#22833;&#65292;&#24182;&#20381;&#36182;&#20110;&#26377;&#25928;&#20215;&#26684;&#12290;&#25105;&#20204;&#23450;&#20041;&#20102;&#19968;&#31181;&#26680;&#21152;&#26435;&#30340;&#39044;&#24179;&#22343;&#26041;&#27861;&#65292;&#21516;&#26102;&#22788;&#29702;&#24494;&#35266;&#32467;&#26500;&#22122;&#22768;&#21644;&#19981;&#21516;&#27493;&#24615;&#38382;&#39064;&#65292;&#24182;&#19988;&#23545;&#28508;&#22312;&#20215;&#26684;&#33719;&#24471;&#20102;&#19968;&#33268;&#20272;&#35745;&#12290;&#25105;&#20204;&#23545;&#20215;&#26684;&#36807;&#31243;&#26045;&#21152;&#20102;&#19968;&#20010;&#20855;&#26377;&#26102;&#38388;&#21464;&#21270;&#22240;&#23376;&#36733;&#33655;&#30340;&#36830;&#32493;&#26102;&#38388;&#22240;&#23376;&#27169;&#22411;&#65292;&#24182;&#36890;&#36807;&#23616;&#37096;&#20027;&#25104;&#20998;&#20998;&#26512;&#20272;&#35745;&#20102;&#20844;&#20849;&#22240;&#23376;&#21644;&#36733;&#33655;&#12290;&#20551;&#35774;&#23545;&#29305;&#36136;&#27874;&#21160;&#29575;&#32467;&#26500;&#26377;&#19968;&#20010;&#22343;&#21248;&#30340;&#31232;&#30095;&#26465;&#20214;&#65292;&#25105;&#20204;&#23558;POET&#21644;&#26680;&#24179;&#28369;&#25216;&#26415;&#30456;&#32467;&#21512;&#65292;&#20272;&#35745;&#28508;&#22312;&#20215;&#26684;&#21644;&#29305;&#36136;&#35823;&#24046;&#30340;&#29616;&#36135;&#27874;&#21160;&#29575;&#30697;&#38453;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.06246v1 Announce Type: new  Abstract: We propose a new estimator of high-dimensional spot volatility matrices satisfying a low-rank plus sparse structure from noisy and asynchronous high-frequency data collected for an ultra-large number of assets. The noise processes are allowed to be temporally correlated, heteroskedastic, asymptotically vanishing and dependent on the efficient prices. We define a kernel-weighted pre-averaging method to jointly tackle the microstructure noise and asynchronicity issues, and we obtain uniformly consistent estimates for latent prices. We impose a continuous-time factor model with time-varying factor loadings on the price processes, and estimate the common factors and loadings via a local principal component analysis. Assuming a uniform sparsity condition on the idiosyncratic volatility structure, we combine the POET and kernel-smoothing techniques to estimate the spot volatility matrices for both the latent prices and idiosyncratic errors. Un
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#36890;&#36807;&#27169;&#25311;&#30740;&#31350;&#25506;&#35752;&#20102;&#31639;&#27861;&#24615;&#26263;&#20013;&#21246;&#32467;&#21644;&#20215;&#26684;&#27495;&#35270;&#20043;&#38388;&#30340;&#30456;&#20114;&#20316;&#29992;&#65292;&#21457;&#29616;&#20102;&#23548;&#33268;&#20849;&#35851;&#32467;&#26524;&#30340;&#20004;&#31181;&#26032;&#26426;&#21046;&#12290;</title><link>https://arxiv.org/abs/2403.06150</link><description>&lt;p&gt;
&#31639;&#27861;&#20849;&#35851;&#19982;&#20215;&#26684;&#27495;&#35270;&#65306;&#25968;&#25454;&#36807;&#24230;&#20351;&#29992;
&lt;/p&gt;
&lt;p&gt;
Algorithmic Collusion and Price Discrimination: The Over-Usage of Data
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.06150
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36890;&#36807;&#27169;&#25311;&#30740;&#31350;&#25506;&#35752;&#20102;&#31639;&#27861;&#24615;&#26263;&#20013;&#21246;&#32467;&#21644;&#20215;&#26684;&#27495;&#35270;&#20043;&#38388;&#30340;&#30456;&#20114;&#20316;&#29992;&#65292;&#21457;&#29616;&#20102;&#23548;&#33268;&#20849;&#35851;&#32467;&#26524;&#30340;&#20004;&#31181;&#26032;&#26426;&#21046;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38543;&#30528;&#20225;&#19994;&#23450;&#20215;&#31574;&#30053;&#36234;&#26469;&#36234;&#20381;&#36182;&#31639;&#27861;&#65292;&#20004;&#20010;&#38382;&#39064;&#24341;&#36215;&#20102;&#20154;&#20204;&#30340;&#20851;&#27880;&#65306;&#31639;&#27861;&#24615;&#26263;&#20013;&#21246;&#32467;&#21644;&#20215;&#26684;&#27495;&#35270;&#12290;&#26412;&#25991;&#36890;&#36807;&#27169;&#25311;&#30740;&#31350;&#20102;&#36825;&#20004;&#20010;&#38382;&#39064;&#20043;&#38388;&#30340;&#20114;&#21160;&#12290;&#27599;&#20010;&#26102;&#26399;&#65292;&#19968;&#20010;&#26032;&#30340;&#20080;&#23478;&#24102;&#30528;&#29420;&#31435;&#21516;&#20998;&#24067;&#30340;&#25903;&#20184;&#24847;&#24895;&#21040;&#26469;&#65292;&#27599;&#23478;&#20844;&#21496;&#35266;&#23519;&#21040;&#20851;&#20110;&#25903;&#20184;&#24847;&#24895;&#30340;&#31169;&#20154;&#20449;&#21495;&#65292;&#37319;&#29992;Q&#23398;&#20064;&#31639;&#27861;&#26469;&#35774;&#23450;&#20215;&#26684;&#12290;&#25105;&#20204;&#35760;&#24405;&#19979;&#20004;&#31181;&#23548;&#33268;&#20849;&#35851;&#32467;&#26524;&#30340;&#26032;&#26426;&#21046;&#12290;&#22312;&#20449;&#24687;&#19981;&#23545;&#31216;&#30340;&#24773;&#20917;&#19979;&#65292;&#20855;&#26377;&#20449;&#24687;&#20248;&#21183;&#30340;&#31639;&#27861;&#37319;&#21462;&#20102;&#8220;&#35825;&#39285;&#21644;&#38480;&#21046;-&#21033;&#29992;&#8221;&#31574;&#30053;&#65292;&#36890;&#36807;&#35774;&#32622;&#26356;&#39640;&#30340;&#20215;&#26684;&#29306;&#29298;&#20102;&#19968;&#20123;&#20449;&#21495;&#19978;&#30340;&#21033;&#28070;&#65292;&#21516;&#26102;&#36890;&#36807;&#35774;&#32622;&#26356;&#20302;&#30340;&#20215;&#26684;&#22312;&#20854;&#20313;&#20449;&#21495;&#19978;&#21033;&#29992;&#26377;&#38480;&#30340;&#21033;&#28070;&#12290;&#22312;&#23545;&#31216;&#20449;&#24687;&#32467;&#26500;&#19979;&#65292;&#23545;&#19968;&#20123;&#20449;&#21495;&#30340;&#31454;&#20105;&#20419;&#36827;&#20102;&#23545;&#20854;&#20313;&#20449;&#21495;&#19978;&#30340;&#36229;&#31454;&#20105;&#20215;&#26684;&#30340;&#25910;&#25947;&#12290;&#31639;&#27861;&#24448;&#24448;&#20250;&#23548;&#33268;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.06150v1 Announce Type: new  Abstract: As firms' pricing strategies increasingly rely on algorithms, two concerns have received much attention: algorithmic tacit collusion and price discrimination. This paper investigates the interaction between these two issues through simulations. In each period, a new buyer arrives with independently and identically distributed willingness to pay (WTP), and each firm, observing private signals about WTP, adopts Q-learning algorithms to set prices. We document two novel mechanisms that lead to collusive outcomes. Under asymmetric information, the algorithm with information advantage adopts a Bait-and-Restrained-Exploit strategy, surrendering profits on some signals by setting higher prices, while exploiting limited profits on the remaining signals by setting much lower prices. Under a symmetric information structure, competition on some signals facilitates convergence to supra-competitive prices on the remaining signals. Algorithms tend to 
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#35752;&#35770;&#20102;&#22312;&#21487;&#33021;&#26159;&#38750;&#27491;&#35268;&#30340;&#21322;&#21442;&#25968;&#27169;&#22411;&#20013;&#30340;&#20551;&#35774;&#26816;&#39564;&#65292;&#23637;&#31034;&#20102;C($\alpha$)&#39118;&#26684;&#30340;&#26816;&#39564;&#22312;&#23616;&#37096;&#27491;&#21017;&#24773;&#20917;&#19979;&#30340;&#24615;&#36136;&#65292;&#24182;&#25512;&#24191;&#20102;&#32463;&#20856;&#21151;&#29575;&#36793;&#30028;&#21040;&#36825;&#31181;&#24773;&#20917;&#19979;&#12290;</title><link>https://arxiv.org/abs/2403.05999</link><description>&lt;p&gt;
&#38750;&#27491;&#21017;&#21322;&#21442;&#25968;&#27169;&#22411;&#20013;&#30340;&#23616;&#37096;&#27491;&#21017;&#21644;&#39640;&#25928;&#26816;&#39564;
&lt;/p&gt;
&lt;p&gt;
Locally Regular and Efficient Tests in Non-Regular Semiparametric Models
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.05999
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#35752;&#35770;&#20102;&#22312;&#21487;&#33021;&#26159;&#38750;&#27491;&#35268;&#30340;&#21322;&#21442;&#25968;&#27169;&#22411;&#20013;&#30340;&#20551;&#35774;&#26816;&#39564;&#65292;&#23637;&#31034;&#20102;C($\alpha$)&#39118;&#26684;&#30340;&#26816;&#39564;&#22312;&#23616;&#37096;&#27491;&#21017;&#24773;&#20917;&#19979;&#30340;&#24615;&#36136;&#65292;&#24182;&#25512;&#24191;&#20102;&#32463;&#20856;&#21151;&#29575;&#36793;&#30028;&#21040;&#36825;&#31181;&#24773;&#20917;&#19979;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#32771;&#34385;&#20102;&#21322;&#21442;&#25968;&#27169;&#22411;&#20013;&#30340;&#20551;&#35774;&#26816;&#39564;&#65292;&#35813;&#27169;&#22411;&#21487;&#33021;&#26159;&#38750;&#27491;&#21017;&#30340;&#12290;&#22312;&#28201;&#21644;&#30340;&#26465;&#20214;&#19979;&#65292;&#25105;&#34920;&#26126;&#20102;C($\alpha$)&#39118;&#26684;&#30340;&#26816;&#39564;&#22312;&#23616;&#37096;&#27491;&#21017;&#24773;&#20917;&#19979;&#65292;&#21253;&#25324;&#37027;&#20123;&#23616;&#37096;&#27491;&#21017;&#20272;&#35745;&#22120;&#19981;&#23384;&#22312;&#30340;&#24773;&#20917;&#65292;&#22914;&#65288;&#21322;&#21442;&#25968;&#65289;&#24369;&#35782;&#21035;&#30340;&#27169;&#22411;&#12290;&#25105;&#25551;&#36848;&#20102;&#36866;&#24403;&#30340;&#26497;&#38480;&#23454;&#39564;&#65292;&#29992;&#20110;&#30740;&#31350;&#38750;&#27491;&#35268;&#24773;&#20917;&#19979;&#26816;&#39564;&#30340;&#26412;&#22320;&#65288;&#28176;&#36817;&#65289;&#26368;&#20248;&#24615;&#65292;&#20174;&#32780;&#23558;&#32463;&#20856;&#21151;&#29575;&#36793;&#30028;&#25512;&#24191;&#21040;&#36825;&#31181;&#24773;&#20917;&#12290;&#25105;&#32473;&#20986;&#20102;&#36825;&#20123;&#21151;&#29575;&#36793;&#30028;&#34987;&#25552;&#20986;&#30340;C($\alpha$)&#39118;&#26684;&#30340;&#26816;&#39564;&#36798;&#21040;&#30340;&#26465;&#20214;&#12290;&#23558;&#29702;&#35770;&#24212;&#29992;&#20110;&#21333;&#25351;&#25968;&#27169;&#22411;&#21644;&#24037;&#20855;&#21464;&#37327;&#27169;&#22411;&#65292;&#24182;&#36827;&#34892;&#20102;&#35814;&#32454;&#30340;&#35752;&#35770;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.05999v1 Announce Type: new  Abstract: This paper considers hypothesis testing in semiparametric models which may be non-regular. I show that C($\alpha$) style tests are locally regular under mild conditions, including in cases where locally regular estimators do not exist, such as models which are (semi-parametrically) weakly identified. I characterise the appropriate limit experiment in which to study local (asymptotic) optimality of tests in the non-regular case, permitting the generalisation of classical power bounds to this case. I give conditions under which these power bounds are attained by the proposed C($\alpha$) style tests. The application of the theory to a single index model and an instrumental variables model is worked out in detail.
&lt;/p&gt;</description></item><item><title>&#20010;&#20307;&#22312;&#32447;&#24615;&#20108;&#27425;&#21338;&#24328;&#20013;&#30340;&#32593;&#32476;&#24418;&#25104;&#20013;&#25552;&#20379;&#36807;&#22810;&#30340;&#21162;&#21147;&#65292;&#20294;&#26159;&#20182;&#20204;&#30340;&#22238;&#25253;&#21364;&#20302;&#20110;&#22343;&#34913;&#22238;&#25253;&#65292;&#22240;&#20026;&#20182;&#20204;&#24314;&#31435;&#30340;&#36830;&#25509;&#19981;&#36275;&#20197;&#23454;&#29616;&#26368;&#20339;&#21162;&#21147;&#30340;&#26377;&#30410;&#28322;&#20986;&#12290;</title><link>https://arxiv.org/abs/2403.05913</link><description>&lt;p&gt;
&#32447;&#24615;&#20108;&#27425;&#21338;&#24328;&#20013;&#30340;&#32593;&#32476;&#24418;&#25104;&#21644;&#25928;&#29575;&#65306;&#19968;&#20010;&#23454;&#39564;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Network formation and efficiency in linear-quadratic games: An experimental study
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.05913
&lt;/p&gt;
&lt;p&gt;
&#20010;&#20307;&#22312;&#32447;&#24615;&#20108;&#27425;&#21338;&#24328;&#20013;&#30340;&#32593;&#32476;&#24418;&#25104;&#20013;&#25552;&#20379;&#36807;&#22810;&#30340;&#21162;&#21147;&#65292;&#20294;&#26159;&#20182;&#20204;&#30340;&#22238;&#25253;&#21364;&#20302;&#20110;&#22343;&#34913;&#22238;&#25253;&#65292;&#22240;&#20026;&#20182;&#20204;&#24314;&#31435;&#30340;&#36830;&#25509;&#19981;&#36275;&#20197;&#23454;&#29616;&#26368;&#20339;&#21162;&#21147;&#30340;&#26377;&#30410;&#28322;&#20986;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#36890;&#36807;&#23454;&#39564;&#30740;&#31350;&#20102;&#32447;&#24615;&#20108;&#27425;&#21338;&#24328;&#20013;&#30340;&#21162;&#21147;&#25552;&#20379;&#21644;&#32593;&#32476;&#24418;&#25104;&#65292;&#35813;&#21338;&#24328;&#20197;&#27491;&#22806;&#37096;&#24615;&#21644;&#32593;&#32476;&#37051;&#23621;&#20043;&#38388;&#21162;&#21147;&#36873;&#25321;&#30340;&#20114;&#34917;&#24615;&#20026;&#29305;&#24449;&#12290;&#25105;&#20204;&#23558;&#23454;&#39564;&#32467;&#26524;&#19982;&#22343;&#34913;&#21644;&#26377;&#25928;&#20998;&#37197;&#36827;&#34892;&#27604;&#36739;&#65292;&#24182;&#30740;&#31350;&#22242;&#20307;&#35268;&#27169;&#21644;&#36830;&#25509;&#25104;&#26412;&#30340;&#24433;&#21709;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#30456;&#23545;&#20110;&#20182;&#20204;&#24418;&#25104;&#30340;&#32593;&#32476;&#19978;&#30340;&#22343;&#34913;&#27700;&#24179;&#65292;&#20010;&#20307;&#25552;&#20379;&#30340;&#21162;&#21147;&#36807;&#22810;&#12290;&#28982;&#32780;&#65292;&#20182;&#20204;&#30340;&#22238;&#25253;&#20302;&#20110;&#22343;&#34913;&#22238;&#25253;&#65292;&#22240;&#20026;&#20182;&#20204;&#24314;&#31435;&#30340;&#38142;&#25509;&#27604;&#26368;&#20248;&#27700;&#24179;&#23569;&#65292;&#38480;&#21046;&#20102;&#21162;&#21147;&#25552;&#20379;&#30340;&#26377;&#30410;&#28322;&#20986;&#12290;&#20943;&#23569;&#36830;&#25509;&#25104;&#26412;&#24182;&#19981;&#26174;&#33879;&#22686;&#21152;&#32593;&#32476;&#30340;&#32852;&#31995;&#24615;&#65292;&#31119;&#21033;&#25439;&#22833;&#22312;&#36739;&#22823;&#30340;&#22242;&#20307;&#20013;&#26356;&#22823;&#12290;&#20010;&#20154;&#36830;&#25509;&#21040;&#22242;&#20307;&#20013;&#21162;&#21147;&#25552;&#20379;&#32773;&#20013;&#25552;&#20379;&#26368;&#39640;&#21162;&#21147;&#30340;&#20154;&#65292;&#24182;&#24573;&#35270;&#30456;&#23545;&#21162;&#21147;&#36739;&#20302;&#30340;&#25552;&#20379;&#32773;&#30340;&#38142;&#25509;&#65292;&#21363;&#20351;&#36825;&#20123;&#38142;&#25509;&#26159;&#26377;&#30410;&#30340;&#12290;&#36825;&#31181;&#25928;&#24212;&#35299;&#37322;&#20102;&#32593;&#32476;&#20013;&#32570;&#20047;&#38142;&#25509;&#30340;&#29616;&#35937;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.05913v1 Announce Type: new  Abstract: We experimentally study effort provision and network formation in the linear-quadratic game characterized by positive externality and complementarity of effort choices among network neighbors. We compare experimental outcomes to the equilibrium and efficient allocations and study the impact of group size and linking costs. We find that individuals overprovide effort relative to the equilibrium level on the network they form. However, their payoffs are lower than the equilibrium payoffs because they create fewer links than it is optimal which limits the beneficial spillovers of effort provision. Reducing the linking costs does not significantly increase the connectedness of the network and the welfare loss is higher in larger groups. Individuals connect to the highest effort providers in the group and ignore links to relative low effort providers, even if those links would be beneficial to form. This effect explains the lack of links in t
&lt;/p&gt;</description></item><item><title>&#25552;&#20986;&#20102;&#19968;&#20010;&#21033;&#29992;&#20108;&#20803;&#24037;&#20855;&#30340;&#24037;&#20855;&#21464;&#37327;&#26694;&#26550;&#65292;&#29992;&#20110;&#35782;&#21035;&#21644;&#20272;&#35745;&#31163;&#25955;&#21644;&#36830;&#32493;&#22788;&#29702;&#30340;&#24179;&#22343;&#25928;&#24212;&#21644;&#20998;&#20301;&#25968;&#25928;&#24212;&#65292;&#22522;&#20110;Copula&#19981;&#21464;&#24615;&#30340;&#35782;&#21035;&#20551;&#35774;&#65292;&#26500;&#36896;&#24615;&#35782;&#21035;&#20102;&#25972;&#20010;&#20154;&#32676;&#21450;&#20854;&#20182;&#23376;&#20154;&#32676;&#30340;&#22788;&#29702;&#25928;&#24212;&#65292;&#24182;&#25552;&#20986;&#20102;&#22522;&#20110;&#20998;&#24067;&#22238;&#24402;&#30340;&#30452;&#25509;&#21322;&#21442;&#25968;&#20272;&#35745;&#36807;&#31243;&#12290;</title><link>https://arxiv.org/abs/2403.05850</link><description>&lt;p&gt;
&#29992;&#20108;&#20803;&#24037;&#20855;&#20272;&#35745;&#31163;&#25955;&#21644;&#36830;&#32493;&#22788;&#29702;&#30340;&#22240;&#26524;&#25928;&#24212;
&lt;/p&gt;
&lt;p&gt;
Estimating Causal Effects of Discrete and Continuous Treatments with Binary Instruments
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.05850
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#20010;&#21033;&#29992;&#20108;&#20803;&#24037;&#20855;&#30340;&#24037;&#20855;&#21464;&#37327;&#26694;&#26550;&#65292;&#29992;&#20110;&#35782;&#21035;&#21644;&#20272;&#35745;&#31163;&#25955;&#21644;&#36830;&#32493;&#22788;&#29702;&#30340;&#24179;&#22343;&#25928;&#24212;&#21644;&#20998;&#20301;&#25968;&#25928;&#24212;&#65292;&#22522;&#20110;Copula&#19981;&#21464;&#24615;&#30340;&#35782;&#21035;&#20551;&#35774;&#65292;&#26500;&#36896;&#24615;&#35782;&#21035;&#20102;&#25972;&#20010;&#20154;&#32676;&#21450;&#20854;&#20182;&#23376;&#20154;&#32676;&#30340;&#22788;&#29702;&#25928;&#24212;&#65292;&#24182;&#25552;&#20986;&#20102;&#22522;&#20110;&#20998;&#24067;&#22238;&#24402;&#30340;&#30452;&#25509;&#21322;&#21442;&#25968;&#20272;&#35745;&#36807;&#31243;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#21033;&#29992;&#20108;&#20803;&#24037;&#20855;&#30340;&#24037;&#20855;&#21464;&#37327;&#26694;&#26550;&#65292;&#29992;&#20110;&#35782;&#21035;&#21644;&#20272;&#35745;&#31163;&#25955;&#21644;&#36830;&#32493;&#22788;&#29702;&#30340;&#24179;&#22343;&#25928;&#24212;&#21644;&#20998;&#20301;&#25968;&#25928;&#24212;&#12290;&#25105;&#20204;&#26041;&#27861;&#30340;&#22522;&#30784;&#26159;&#28508;&#22312;&#32467;&#26524;&#21644;&#20915;&#23450;&#22788;&#29702;&#20998;&#37197;&#30340;&#19981;&#21487;&#35266;&#27979;&#21464;&#37327;&#30340;&#32852;&#21512;&#20998;&#24067;&#30340;&#23616;&#37096;Copula&#34920;&#31034;&#12290;&#36825;&#31181;&#34920;&#31034;&#20351;&#25105;&#20204;&#33021;&#22815;&#24341;&#20837;&#19968;&#20010;&#25152;&#35859;&#30340;Copula&#19981;&#21464;&#24615;&#30340;&#35782;&#21035;&#20551;&#35774;&#65292;&#35813;&#20551;&#35774;&#38480;&#21046;&#20102;Copula&#20851;&#20110;&#22788;&#29702;&#20542;&#21521;&#30340;&#23616;&#37096;&#20381;&#36182;&#12290;&#25105;&#20204;&#23637;&#31034;Copula&#19981;&#21464;&#24615;&#35782;&#21035;&#20102;&#25972;&#20010;&#20154;&#32676;&#20197;&#21450;&#20854;&#20182;&#20122;&#20154;&#32676;&#65288;&#22914;&#25509;&#21463;&#22788;&#29702;&#32773;&#65289;&#30340;&#22788;&#29702;&#25928;&#24212;&#12290;&#35782;&#21035;&#32467;&#26524;&#26159;&#26500;&#36896;&#24615;&#30340;&#65292;&#24182;&#23548;&#33268;&#22522;&#20110;&#20998;&#24067;&#22238;&#24402;&#30340;&#30452;&#25509;&#21322;&#21442;&#25968;&#20272;&#35745;&#36807;&#31243;&#12290;&#23545;&#30561;&#30496;&#23545;&#24184;&#31119;&#24863;&#30340;&#24433;&#21709;&#30340;&#24212;&#29992;&#25581;&#31034;&#20102;&#26377;&#36259;&#30340;&#24322;&#36136;&#24615;&#27169;&#24335;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.05850v1 Announce Type: new  Abstract: We propose an instrumental variable framework for identifying and estimating average and quantile effects of discrete and continuous treatments with binary instruments. The basis of our approach is a local copula representation of the joint distribution of the potential outcomes and unobservables determining treatment assignment. This representation allows us to introduce an identifying assumption, so-called copula invariance, that restricts the local dependence of the copula with respect to the treatment propensity. We show that copula invariance identifies treatment effects for the entire population and other subpopulations such as the treated. The identification results are constructive and lead to straightforward semiparametric estimation procedures based on distribution regression. An application to the effect of sleep on well-being uncovers interesting patterns of heterogeneity.
&lt;/p&gt;</description></item><item><title>&#31038;&#20250;&#22320;&#20301;&#31454;&#20105;&#40723;&#21169;&#20102;&#26356;&#39640;&#30340;&#21162;&#21147;&#25552;&#20379;&#21644;&#24378;&#21270;&#20102;&#21327;&#20316;&#20851;&#31995;&#65292;&#20294;&#25490;&#21517;&#20449;&#24687;&#23548;&#33268;&#20102;&#36739;&#20302;&#30340;&#21162;&#21147;&#25552;&#20379;&#12290;&#31038;&#20250;&#22320;&#20301;&#23545;&#32467;&#26524;&#24433;&#21709;&#19981;&#26174;&#33879;&#12290;</title><link>https://arxiv.org/abs/2403.05830</link><description>&lt;p&gt;
&#31038;&#20250;&#22320;&#20301;&#23545;&#21327;&#20316;&#20851;&#31995;&#21644;&#21162;&#21147;&#25552;&#20379;&#24418;&#25104;&#30340;&#24433;&#21709;&#65306;&#19968;&#39033;&#23454;&#39564;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
The impact of social status on the formation of collaborative ties and effort provision: An experimental study
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.05830
&lt;/p&gt;
&lt;p&gt;
&#31038;&#20250;&#22320;&#20301;&#31454;&#20105;&#40723;&#21169;&#20102;&#26356;&#39640;&#30340;&#21162;&#21147;&#25552;&#20379;&#21644;&#24378;&#21270;&#20102;&#21327;&#20316;&#20851;&#31995;&#65292;&#20294;&#25490;&#21517;&#20449;&#24687;&#23548;&#33268;&#20102;&#36739;&#20302;&#30340;&#21162;&#21147;&#25552;&#20379;&#12290;&#31038;&#20250;&#22320;&#20301;&#23545;&#32467;&#26524;&#24433;&#21709;&#19981;&#26174;&#33879;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#31038;&#20250;&#22320;&#20301;&#31454;&#20105;&#26159;&#21542;&#20250;&#20419;&#20351;&#22312;&#20010;&#20307;&#19982;&#20182;&#20204;&#30340;&#32593;&#32476;&#37051;&#23621;&#21327;&#20316;&#26102;&#25552;&#20379;&#26356;&#39640;&#30340;&#21162;&#21147;&#21644;&#25928;&#29575;&#12290;&#25105;&#20204;&#32771;&#34385;&#20102;&#19968;&#20010;&#23454;&#39564;&#23460;&#23454;&#39564;&#65292;&#22312;&#35813;&#23454;&#39564;&#20013;&#65292;&#20010;&#20307;&#36873;&#25321;&#20102;&#19968;&#39033;&#26114;&#36149;&#30340;&#21512;&#20316;&#21162;&#21147;&#20197;&#21450;&#20182;&#20204;&#30340;&#32593;&#32476;&#37051;&#23621;&#12290;&#20182;&#20204;&#20174;&#37051;&#23621;&#30340;&#21162;&#21147;&#20013;&#33719;&#30410;&#65292;&#32780;&#30452;&#25509;&#37051;&#23621;&#30340;&#21162;&#21147;&#36873;&#25321;&#26159;&#25112;&#30053;&#20114;&#34917;&#30340;&#12290;&#25105;&#20204;&#22312;2x2&#30340;&#22240;&#23376;&#35774;&#35745;&#20013;&#24341;&#20837;&#20102;&#20004;&#31181;&#31038;&#20250;&#22320;&#20301;&#31867;&#22411;&#65306;1) &#20010;&#20307;&#22240;&#20026;&#20837;&#38142;&#32780;&#33719;&#24471;&#36135;&#24065;&#21033;&#30410;&#65292;&#20195;&#34920;&#21463;&#27426;&#36814;&#31243;&#24230;&#65307;2) &#20182;&#20204;&#25509;&#25910;&#26377;&#20851;&#20182;&#20204;&#22312;&#32676;&#20307;&#20013;&#30456;&#23545;&#25910;&#30410;&#25490;&#21517;&#30340;&#21453;&#39304;&#24847;&#35265;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#38142;&#36335;&#21033;&#30410;&#20250;&#22686;&#21152;&#21162;&#21147;&#25552;&#20379;&#24182;&#21152;&#24378;&#21327;&#20316;&#20851;&#31995;&#65292;&#30456;&#23545;&#20110;&#26080;&#31038;&#20250;&#22320;&#20301;&#30340;&#22522;&#32447;&#22788;&#29702;&#12290;&#30456;&#21453;&#65292;&#25490;&#21517;&#20449;&#24687;&#20250;&#38477;&#20302;&#21162;&#21147;&#65292;&#22240;&#20026;&#20010;&#20307;&#24320;&#22987;&#20026;&#26356;&#39640;&#25490;&#21517;&#32780;&#31454;&#20105;&#12290;&#24635;&#20307;&#32780;&#35328;&#65292;&#25105;&#20204;&#21457;&#29616;&#31038;&#20250;&#22320;&#20301;&#23545;&#32467;&#26524;&#24182;&#27809;&#26377;&#26126;&#26174;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.05830v1 Announce Type: new  Abstract: We study whether competition for social status induces higher effort provision and efficiency when individuals collaborate with their network neighbors. We consider a laboratory experiment in which individuals choose a costly collaborative effort and their network neighbors. They benefit from their neighbors' effort and effort choices of direct neighbors are strategic complements. We introduce two types of social status in a 2x2 factorial design: 1) individuals receive monetary benefits for incoming links representing popularity; 2) they receive feedback on their relative payoff ranking within the group. We find that link benefits induce higher effort provision and strengthen the collaborative ties relative to the Baseline treatment without social status. In contrast, the ranking information induces lower effort as individuals start competing for higher ranking. Overall, we find that social status has no significant impact on the number 
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#20110;&#22312;&#22238;&#24402;&#26029;&#28857;&#35774;&#35745;&#20013;&#20272;&#35745;&#27835;&#30103;&#25928;&#24212;&#30340;&#21322;&#21442;&#25968;&#26041;&#27861;&#65292;&#36890;&#36807;&#23558;RDDs&#20013;&#30340;&#27835;&#30103;&#25928;&#24212;&#35782;&#21035;&#27010;&#24565;&#21270;&#20026;&#37096;&#20998;&#32447;&#24615;&#24314;&#27169;&#38382;&#39064;&#65292;&#24182;&#21033;&#29992;P-&#26679;&#26465;&#26041;&#27861;&#36924;&#36817;&#38750;&#21442;&#25968;&#20989;&#25968;&#65292;&#24320;&#21457;&#20102;&#25512;&#26029;&#27835;&#30103;&#25928;&#24212;&#30340;&#31243;&#24207;&#12290;</title><link>https://arxiv.org/abs/2403.05803</link><description>&lt;p&gt;
&#22238;&#24402;&#26029;&#28857;&#35774;&#35745;&#30340;&#21322;&#21442;&#25968;&#25512;&#26029;
&lt;/p&gt;
&lt;p&gt;
Semiparametric Inference for Regression-Discontinuity Designs
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.05803
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#20110;&#22312;&#22238;&#24402;&#26029;&#28857;&#35774;&#35745;&#20013;&#20272;&#35745;&#27835;&#30103;&#25928;&#24212;&#30340;&#21322;&#21442;&#25968;&#26041;&#27861;&#65292;&#36890;&#36807;&#23558;RDDs&#20013;&#30340;&#27835;&#30103;&#25928;&#24212;&#35782;&#21035;&#27010;&#24565;&#21270;&#20026;&#37096;&#20998;&#32447;&#24615;&#24314;&#27169;&#38382;&#39064;&#65292;&#24182;&#21033;&#29992;P-&#26679;&#26465;&#26041;&#27861;&#36924;&#36817;&#38750;&#21442;&#25968;&#20989;&#25968;&#65292;&#24320;&#21457;&#20102;&#25512;&#26029;&#27835;&#30103;&#25928;&#24212;&#30340;&#31243;&#24207;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#22238;&#24402;&#26029;&#28857;&#35774;&#35745;&#65288;RDDs&#65289;&#20013;&#65292;&#27835;&#30103;&#25928;&#24212;&#36890;&#24120;&#20351;&#29992;&#23616;&#37096;&#22238;&#24402;&#26041;&#27861;&#36827;&#34892;&#20272;&#35745;&#12290;&#28982;&#32780;&#65292;&#20840;&#23616;&#36817;&#20284;&#26041;&#27861;&#36890;&#24120;&#34987;&#35748;&#20026;&#25928;&#29575;&#20302;&#19979;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#19987;&#38376;&#29992;&#20110;&#22312;RDDs&#20013;&#20272;&#35745;&#27835;&#30103;&#25928;&#24212;&#30340;&#21322;&#21442;&#25968;&#26694;&#26550;&#12290;&#25105;&#20204;&#30340;&#20840;&#23616;&#26041;&#27861;&#23558;RDDs&#20013;&#30340;&#27835;&#30103;&#25928;&#24212;&#35782;&#21035;&#27010;&#24565;&#21270;&#20026;&#37096;&#20998;&#32447;&#24615;&#24314;&#27169;&#38382;&#39064;&#65292;&#20854;&#20013;&#32447;&#24615;&#37096;&#20998;&#25429;&#25417;&#27835;&#30103;&#25928;&#24212;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#21033;&#29992;P-&#26679;&#26465;&#26041;&#27861;&#26469;&#36924;&#36817;&#38750;&#21442;&#25968;&#20989;&#25968;&#65292;&#24182;&#24320;&#21457;&#20102;&#25512;&#26029;&#22312;&#36825;&#20010;&#26694;&#26550;&#20869;&#30340;&#27835;&#30103;&#25928;&#24212;&#30340;&#31243;&#24207;&#12290;&#25105;&#20204;&#36890;&#36807;&#33945;&#29305;&#21345;&#27931;&#27169;&#25311;&#34920;&#26126;&#65292;&#25152;&#25552;&#20986;&#30340;&#26041;&#27861;&#22312;&#21508;&#31181;&#22330;&#26223;&#19979;&#34920;&#29616;&#33391;&#22909;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36890;&#36807;&#30495;&#23454;&#25968;&#25454;&#38598;&#30340;&#20363;&#35777;&#65292;&#35828;&#26126;&#25105;&#20204;&#30340;&#20840;&#23616;&#26041;&#27861;&#21487;&#33021;&#23548;&#33268;&#26356;&#21487;&#38752;&#30340;&#25512;&#26029;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.05803v1 Announce Type: new  Abstract: Treatment effects in regression discontinuity designs (RDDs) are often estimated using local regression methods. However, global approximation methods are generally deemed inefficient. In this paper, we propose a semiparametric framework tailored for estimating treatment effects in RDDs. Our global approach conceptualizes the identification of treatment effects within RDDs as a partially linear modeling problem, with the linear component capturing the treatment effect. Furthermore, we utilize the P-spline method to approximate the nonparametric function and develop procedures for inferring treatment effects within this framework. We demonstrate through Monte Carlo simulations that the proposed method performs well across various scenarios. Furthermore, we illustrate using real-world datasets that our global approach may result in more reliable inference.
&lt;/p&gt;</description></item><item><title>&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;Wiener-Kallianpur&#21019;&#26032;&#34920;&#31034;&#30340;&#29983;&#25104;&#24335;&#27010;&#29575;&#39044;&#27979;&#26041;&#27861;&#65292;&#21253;&#25324;&#33258;&#32534;&#30721;&#22120;&#21644;&#26032;&#39062;&#30340;&#28145;&#24230;&#23398;&#20064;&#31639;&#27861;&#65292;&#20855;&#26377;&#28176;&#36817;&#26368;&#20248;&#24615;&#21644;&#32467;&#26500;&#25910;&#25947;&#24615;&#36136;&#65292;&#36866;&#29992;&#20110;&#23454;&#26102;&#24066;&#22330;&#36816;&#33829;&#20013;&#30340;&#39640;&#21160;&#24577;&#21644;&#27874;&#21160;&#26102;&#38388;&#24207;&#21015;&#12290;</title><link>https://arxiv.org/abs/2403.05743</link><description>&lt;p&gt;
&#20855;&#26377;&#24066;&#22330;&#36816;&#33829;&#24212;&#29992;&#30340;&#29983;&#25104;&#24335;&#27010;&#29575;&#39044;&#27979;
&lt;/p&gt;
&lt;p&gt;
Generative Probabilistic Forecasting with Applications in Market Operations
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.05743
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;Wiener-Kallianpur&#21019;&#26032;&#34920;&#31034;&#30340;&#29983;&#25104;&#24335;&#27010;&#29575;&#39044;&#27979;&#26041;&#27861;&#65292;&#21253;&#25324;&#33258;&#32534;&#30721;&#22120;&#21644;&#26032;&#39062;&#30340;&#28145;&#24230;&#23398;&#20064;&#31639;&#27861;&#65292;&#20855;&#26377;&#28176;&#36817;&#26368;&#20248;&#24615;&#21644;&#32467;&#26500;&#25910;&#25947;&#24615;&#36136;&#65292;&#36866;&#29992;&#20110;&#23454;&#26102;&#24066;&#22330;&#36816;&#33829;&#20013;&#30340;&#39640;&#21160;&#24577;&#21644;&#27874;&#21160;&#26102;&#38388;&#24207;&#21015;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#29983;&#25104;&#24335;&#27010;&#29575;&#39044;&#27979;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#28304;&#33258;&#20110;&#38750;&#21442;&#25968;&#26102;&#38388;&#24207;&#21015;&#30340;Wiener-Kallianpur&#21019;&#26032;&#34920;&#31034;&#12290;&#22312;&#29983;&#25104;&#20154;&#24037;&#26234;&#33021;&#30340;&#33539;&#24335;&#19979;&#65292;&#25152;&#25552;&#20986;&#30340;&#39044;&#27979;&#26550;&#26500;&#21253;&#25324;&#19968;&#20010;&#33258;&#32534;&#30721;&#22120;&#65292;&#23558;&#38750;&#21442;&#25968;&#22810;&#21464;&#37327;&#38543;&#26426;&#36807;&#31243;&#36716;&#21270;&#20026;&#35268;&#33539;&#30340;&#21019;&#26032;&#24207;&#21015;&#65292;&#20174;&#20013;&#26681;&#25454;&#36807;&#21435;&#26679;&#26412;&#29983;&#25104;&#26410;&#26469;&#26102;&#38388;&#24207;&#21015;&#26679;&#26412;&#65292;&#26465;&#20214;&#26159;&#23427;&#20204;&#30340;&#27010;&#29575;&#20998;&#24067;&#21462;&#20915;&#20110;&#36807;&#21435;&#26679;&#26412;&#12290;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#28145;&#24230;&#23398;&#20064;&#31639;&#27861;&#65292;&#23558;&#28508;&#22312;&#36807;&#31243;&#38480;&#21046;&#20026;&#20855;&#26377;&#21305;&#37197;&#33258;&#32534;&#30721;&#22120;&#36755;&#20837;-&#36755;&#20986;&#26465;&#20214;&#27010;&#29575;&#20998;&#24067;&#30340;&#29420;&#31435;&#21516;&#20998;&#24067;&#24207;&#21015;&#12290;&#24314;&#31435;&#20102;&#25152;&#25552;&#20986;&#30340;&#29983;&#25104;&#24335;&#39044;&#27979;&#26041;&#27861;&#30340;&#28176;&#36817;&#26368;&#20248;&#24615;&#21644;&#32467;&#26500;&#25910;&#25947;&#24615;&#36136;&#12290;&#35813;&#26041;&#27861;&#22312;&#23454;&#26102;&#24066;&#22330;&#36816;&#33829;&#20013;&#28041;&#21450;&#39640;&#24230;&#21160;&#24577;&#21644;&#27874;&#21160;&#26102;&#38388;&#24207;&#21015;&#30340;&#19977;&#20010;&#24212;&#29992;&#26041;&#38754;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.05743v1 Announce Type: cross  Abstract: This paper presents a novel generative probabilistic forecasting approach derived from the Wiener-Kallianpur innovation representation of nonparametric time series. Under the paradigm of generative artificial intelligence, the proposed forecasting architecture includes an autoencoder that transforms nonparametric multivariate random processes into canonical innovation sequences, from which future time series samples are generated according to their probability distributions conditioned on past samples. A novel deep-learning algorithm is proposed that constrains the latent process to be an independent and identically distributed sequence with matching autoencoder input-output conditional probability distributions. Asymptotic optimality and structural convergence properties of the proposed generative forecasting approach are established. Three applications involving highly dynamic and volatile time series in real-time market operations a
&lt;/p&gt;</description></item><item><title>&#27979;&#37327;&#35823;&#24046;&#23545;&#32593;&#32476;&#25193;&#25955;&#20272;&#35745;&#20135;&#29983;&#20102;&#20005;&#37325;&#30340;&#38750;&#40065;&#26834;&#24615;&#65292;&#21363;&#20351;&#35823;&#24046;&#24456;&#23567;&#65292;&#20063;&#20250;&#23548;&#33268;&#25193;&#25955;&#31243;&#24230;&#34987;&#20302;&#20272;&#65292;&#24182;&#19988;&#21021;&#22987;&#31181;&#23376;&#30340;&#24494;&#23567;&#35823;&#24046;&#20250;&#22823;&#22823;&#25913;&#21464;&#39044;&#26399;&#25193;&#25955;&#36335;&#24452;&#12290;</title><link>https://arxiv.org/abs/2403.05704</link><description>&lt;p&gt;
&#27979;&#37327;&#35823;&#24046;&#23545;&#32593;&#32476;&#25193;&#25955;&#20272;&#35745;&#30340;&#38750;&#40065;&#26834;&#24615;
&lt;/p&gt;
&lt;p&gt;
Non-robustness of diffusion estimates on networks with measurement error
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.05704
&lt;/p&gt;
&lt;p&gt;
&#27979;&#37327;&#35823;&#24046;&#23545;&#32593;&#32476;&#25193;&#25955;&#20272;&#35745;&#20135;&#29983;&#20102;&#20005;&#37325;&#30340;&#38750;&#40065;&#26834;&#24615;&#65292;&#21363;&#20351;&#35823;&#24046;&#24456;&#23567;&#65292;&#20063;&#20250;&#23548;&#33268;&#25193;&#25955;&#31243;&#24230;&#34987;&#20302;&#20272;&#65292;&#24182;&#19988;&#21021;&#22987;&#31181;&#23376;&#30340;&#24494;&#23567;&#35823;&#24046;&#20250;&#22823;&#22823;&#25913;&#21464;&#39044;&#26399;&#25193;&#25955;&#36335;&#24452;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#32593;&#32476;&#25193;&#25955;&#27169;&#22411;&#34987;&#29992;&#20110;&#30740;&#31350;&#30142;&#30149;&#20256;&#25773;&#12289;&#20449;&#24687;&#20256;&#25773;&#21644;&#25216;&#26415;&#37319;&#29992;&#31561;&#38382;&#39064;&#12290;&#28982;&#32780;&#65292;&#26500;&#24314;&#36825;&#20123;&#27169;&#22411;&#30340;&#32593;&#32476;&#20013;&#26497;&#26377;&#21487;&#33021;&#23384;&#22312;&#23569;&#37327;&#27979;&#37327;&#35823;&#24046;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#25193;&#25955;&#20272;&#35745;&#23545;&#36825;&#31181;&#27979;&#37327;&#35823;&#24046;&#30340;&#38750;&#24120;&#38750;&#40065;&#26834;&#24615;&#12290;&#39318;&#20808;&#65292;&#25105;&#20204;&#23637;&#31034;&#21363;&#20351;&#27979;&#37327;&#35823;&#24046;&#20960;&#20046;&#21487;&#20197;&#24573;&#30053;&#19981;&#35745;&#65292;&#38169;&#36807;&#38142;&#25509;&#30340;&#27604;&#20363;&#25509;&#36817;&#20110;&#38646;&#65292;&#20851;&#20110;&#25193;&#25955;&#31243;&#24230;&#30340;&#39044;&#27979;&#20063;&#20250;&#22823;&#22823;&#20302;&#20272;&#30495;&#23454;&#24773;&#20917;&#12290;&#20854;&#27425;&#65292;&#21021;&#22987;&#31181;&#23376;&#36523;&#20221;&#30340;&#24494;&#23567;&#27979;&#37327;&#35823;&#24046;&#20250;&#23548;&#33268;&#39044;&#26399;&#25193;&#25955;&#36335;&#24452;&#30340;&#20301;&#32622;&#21457;&#29983;&#24456;&#22823;&#20559;&#31227;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#21363;&#20351;&#24494;&#23567;&#30340;&#27979;&#37327;&#35823;&#24046;&#21482;&#26159;&#23616;&#37096;&#24615;&#36136;&#65292;&#36825;&#20004;&#39033;&#32467;&#26524;&#20173;&#28982;&#25104;&#31435;&#12290;&#21363;&#20351;&#22312;&#22522;&#30784;&#20256;&#25773;&#25968;&#21487;&#25345;&#32493;&#20272;&#35745;&#30340;&#26465;&#20214;&#19979;&#65292;&#39044;&#27979;&#20013;&#23384;&#22312;&#36825;&#31181;&#38750;&#40065;&#26834;&#24615;&#12290;&#21487;&#33021;&#30340;&#35299;&#20915;&#26041;&#26696;&#65292;&#27604;&#22914;&#20272;&#35745;&#27979;&#37327;&#35823;&#24046;&#30340;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.05704v1 Announce Type: new  Abstract: Network diffusion models are used to study things like disease transmission, information spread, and technology adoption. However, small amounts of mismeasurement are extremely likely in the networks constructed to operationalize these models. We show that estimates of diffusions are highly non-robust to this measurement error. First, we show that even when measurement error is vanishingly small, such that the share of missed links is close to zero, forecasts about the extent of diffusion will greatly underestimate the truth. Second, a small mismeasurement in the identity of the initial seed generates a large shift in the locations of expected diffusion path. We show that both of these results still hold when the vanishing measurement error is only local in nature. Such non-robustness in forecasting exists even under conditions where the basic reproductive number is consistently estimable. Possible solutions, such as estimating the measu
&lt;/p&gt;</description></item><item><title>&#30740;&#31350;&#32773;&#27169;&#25311;&#20102;&#20004;&#20010;&#20998;&#23618;&#27700;&#24211;&#30340;&#28909;&#32467;&#26500;&#20197;&#25506;&#35752;&#27946;&#27700;&#26102;&#27700;&#36136;&#30340;&#21464;&#21270;&#65292;&#21457;&#29616;&#27946;&#27700;&#26399;&#38388;&#27969;&#37327;&#22686;&#21152;&#21487;&#33021;&#36896;&#25104;&#27700;&#36136;&#24694;&#21270;&#21644;&#28342;&#35299;&#27687;&#21547;&#37327;&#19979;&#38477;&#12290;</title><link>https://arxiv.org/abs/2403.05671</link><description>&lt;p&gt;
&#22522;&#20110;&#27946;&#27700;&#21644;&#20837;&#27969;&#27874;&#21160;&#30340;&#27700;&#24211;&#27700;&#36136;&#21464;&#21270;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Investigating Changes of Water Quality in Reservoirs based on Flood and Inflow Fluctuations
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.05671
&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#32773;&#27169;&#25311;&#20102;&#20004;&#20010;&#20998;&#23618;&#27700;&#24211;&#30340;&#28909;&#32467;&#26500;&#20197;&#25506;&#35752;&#27946;&#27700;&#26102;&#27700;&#36136;&#30340;&#21464;&#21270;&#65292;&#21457;&#29616;&#27946;&#27700;&#26399;&#38388;&#27969;&#37327;&#22686;&#21152;&#21487;&#33021;&#36896;&#25104;&#27700;&#36136;&#24694;&#21270;&#21644;&#28342;&#35299;&#27687;&#21547;&#37327;&#19979;&#38477;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#27700;&#28201;&#21644;&#28342;&#35299;&#27687;&#26159;&#27700;&#36136;&#21644;&#29983;&#24577;&#31995;&#32479;&#21487;&#25345;&#32493;&#24615;&#30340;&#37325;&#35201;&#25351;&#26631;&#12290;&#36817;&#24180;&#26469;&#65292;&#39057;&#32321;&#19988;&#24378;&#28872;&#30340;&#26292;&#38632;&#39057;&#32321;&#21457;&#29983;&#65292;&#36890;&#36807;&#24613;&#21095;&#22686;&#21152;&#31216;&#20026;&#26292;&#27946;&#30340;&#20837;&#27969;&#37327;&#65292;&#23545;&#27700;&#20307;&#30340;&#28909;&#32467;&#26500;&#21644;&#28151;&#21512;&#23618;&#28145;&#24230;&#20135;&#29983;&#24433;&#21709;&#12290;&#26292;&#27946;&#21487;&#20197;&#30001;&#31361;&#21457;&#30340;&#24378;&#38477;&#27700;&#20107;&#20214;&#22312;&#20960;&#20998;&#38047;&#25110;&#20960;&#23567;&#26102;&#20869;&#21457;&#23637;&#32780;&#25104;&#12290;&#30001;&#20110;&#22823;&#37327;&#26434;&#29289;&#21644;&#24555;&#36895;&#27969;&#21160;&#30340;&#27700;&#20307;&#65292;&#36825;&#31181;&#29616;&#35937;&#23545;&#27700;&#36136;&#26377;&#26174;&#30528;&#24433;&#21709;&#12290;&#27946;&#27700;&#26399;&#38388;&#27969;&#37327;&#36739;&#22823;&#21487;&#33021;&#20250;&#24694;&#21270;&#28909;&#23618;&#20998;&#23618;&#65288;&#20855;&#26377;&#19981;&#21516;&#23494;&#24230;&#23618;&#65289;&#30340;&#27700;&#20307;&#36136;&#37327;&#65292;&#24182;&#38477;&#20302;&#28342;&#35299;&#27687;&#21547;&#37327;&#12290;&#28982;&#32780;&#65292;&#30446;&#21069;&#23578;&#19981;&#28165;&#26970;&#36825;&#20123;&#21442;&#25968;&#33021;&#22810;&#22909;&#22320;&#20195;&#34920;&#28246;&#27850;&#23545;&#20307;&#37327;&#25490;&#25918;&#21464;&#21270;&#30340;&#21709;&#24212;&#12290;&#20026;&#35299;&#20915;&#36825;&#19968;&#38382;&#39064;&#65292;&#30740;&#31350;&#20154;&#21592;&#27169;&#25311;&#20102;&#32771;&#34385;&#25289;&#36158;&#28085;&#20859;&#24211;&#20026;&#20195;&#34920;&#30340;&#20004;&#20010;&#20998;&#23618;&#27700;&#24211;&#30340;&#28909;&#32467;&#26500;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.05671v1 Announce Type: new  Abstract: Water temperature and dissolved oxygen are essential indicators of water quality and ecosystem sustainability. Lately, heavy rainfalls are happening frequently and forcefully affecting the thermal structure and mixing layers in depth by sharply increasing the volume of inflow entitled flash flood. It can occur by sudden intense precipitation and develop within minutes or hours. Because of heavy debris load and speedy water, this phenomenon has remarkable effects on water quality. A higher flow during floods may worsens water quality at lakes and reservoirs that are thermally stratified (with separate density layers) and decrease dissolved oxygen content. However, it is unclear how well these parameters represent the response of lakes to changes in volume discharge. To address this question, researchers simulate the thermal structure in two stratified reservoirs, considering the Rajae reservoir as a representative reservoir in the north o
&lt;/p&gt;</description></item><item><title>&#30740;&#31350;&#20102;&#20855;&#26377;&#36164;&#28304;&#32422;&#26463;&#30340;&#22810;&#32500;&#20449;&#21495;&#20256;&#36882;&#38382;&#39064;&#65292;&#24314;&#31435;&#20102;&#21807;&#19968;&#30340;&#21333;&#35843;D1&#22343;&#34913;&#65292;&#21457;&#29616;&#20102;&#20449;&#21495;&#19982;&#21457;&#20449;&#32773;&#31867;&#22411;&#20043;&#38388;&#30340;&#20851;&#31995;&#65292;&#24182;&#30830;&#23450;&#20102;&#20004;&#20010;&#21457;&#20449;&#32773;&#31867;&#22411;&#30340;&#38408;&#20540;&#12290;</title><link>https://arxiv.org/abs/2402.14003</link><description>&lt;p&gt;
&#20855;&#26377;&#36164;&#28304;&#32422;&#26463;&#30340;&#22810;&#32500;&#20449;&#21495;&#20256;&#36882;
&lt;/p&gt;
&lt;p&gt;
Multidimensional Signaling with a Resource Constraint
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.14003
&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#20102;&#20855;&#26377;&#36164;&#28304;&#32422;&#26463;&#30340;&#22810;&#32500;&#20449;&#21495;&#20256;&#36882;&#38382;&#39064;&#65292;&#24314;&#31435;&#20102;&#21807;&#19968;&#30340;&#21333;&#35843;D1&#22343;&#34913;&#65292;&#21457;&#29616;&#20102;&#20449;&#21495;&#19982;&#21457;&#20449;&#32773;&#31867;&#22411;&#20043;&#38388;&#30340;&#20851;&#31995;&#65292;&#24182;&#30830;&#23450;&#20102;&#20004;&#20010;&#21457;&#20449;&#32773;&#31867;&#22411;&#30340;&#38408;&#20540;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#22810;&#32500;&#20449;&#21495;&#20256;&#36882;&#65288;&#35748;&#30693;/&#38750;&#35748;&#30693;&#65289;&#20316;&#20026;&#21457;&#20449;&#32773;&#30340;&#19968;&#31181;&#36164;&#28304;&#32422;&#26463;&#19979;&#30340;&#25237;&#36164;&#36873;&#25321;&#12290;&#25105;&#20204;&#30830;&#23450;&#20102;&#21807;&#19968;&#30340;&#21333;&#35843;D1&#22343;&#34913;&#23384;&#22312;&#65292;&#20854;&#20013;&#35748;&#30693;&#65288;&#38750;&#35748;&#30693;&#65289;&#20449;&#21495;&#38543;&#32773;&#21457;&#20449;&#32773;&#31867;&#22411;&#30340;&#25552;&#39640;&#32780;&#22686;&#21152;&#65288;&#38477;&#20302;&#65289;&#65292;&#20004;&#32773;&#20043;&#21644;&#38543;&#32773;&#21457;&#20449;&#32773;&#31867;&#22411;&#30340;&#25552;&#39640;&#32780;&#22686;&#21152;&#12290;&#22343;&#34913;&#30001;&#20004;&#20010;&#21457;&#20449;&#32773;&#31867;&#22411;&#30340;&#38408;&#20540;&#26469;&#25551;&#36848;&#12290;&#20302;&#38408;&#20540;&#26159;&#21457;&#29983;&#20449;&#21495;&#20256;&#36882;&#36716;&#25240;&#30340;&#28857;&#12290;&#32422;&#26463;&#20165;&#20250;&#32422;&#26463;&#39640;&#20110;&#35813;&#38408;&#20540;&#30340;&#21457;&#20449;&#32773;&#31867;&#22411;&#12290;&#39640;&#38408;&#20540;&#26159;&#21478;&#19968;&#20010;&#38408;&#20540;&#65292;&#39640;&#20110;&#35813;&#38408;&#20540;&#25152;&#26377;&#31867;&#22411;&#23558;&#22312;&#35748;&#30693;&#20449;&#21495;&#19978;&#33457;&#36153;&#20840;&#37096;&#36164;&#28304;&#65292;&#20351;&#20449;&#21495;&#20256;&#36882;&#22312;&#26368;&#39640;&#28857;&#20135;&#29983;&#19981;&#36830;&#32493;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.14003v1 Announce Type: new  Abstract: We study multidimensional signaling (cognitive/non-cognitive) as a sender's portfolio choice with a resource constraint. We establish the existence of a unique monotone D1 equilibrium where the cognitive (non-cognitive) signal increases (decreases) in sender type and the sum of the two increases in sender type. The equilibrium is characterized by two threshold sender types. The low threshold is one where a kink occurs in signaling. The constraint is binding only for sender types above it. The high threshold is the other one, above which all types spend all the resources in cognitive signal with pooling and discontinuity on the top.
&lt;/p&gt;</description></item><item><title>&#22522;&#20110;&#21333;&#35843;&#27604;&#36739;&#38745;&#24577;&#20998;&#26512;&#65292;&#35777;&#26126;&#20102;&#21202;&#22799;&#29305;&#21015;&#21407;&#29702;&#65292;&#21363;&#22312;&#24207;&#34917;&#23436;&#24615;&#20551;&#35774;&#19979;&#65292;&#22914;&#26524;&#30701;&#26399;&#35843;&#25972;&#21463;&#21040;&#21333;&#35843;&#25104;&#26412;&#24433;&#21709;&#65292;&#21017;&#38271;&#26399;&#23545;&#20914;&#20987;&#30340;&#21709;&#24212;&#22823;&#20110;&#30701;&#26399;&#21709;&#24212;&#12290;</title><link>https://arxiv.org/abs/2206.00347</link><description>&lt;p&gt;
&#24102;&#35843;&#25972;&#25104;&#26412;&#21644;&#21202;&#22799;&#29305;&#21015;&#21407;&#29702;&#30340;&#27604;&#36739;&#38745;&#24577;&#20998;&#26512;
&lt;/p&gt;
&lt;p&gt;
Comparative statics with adjustment costs and the le Chatelier principle
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2206.00347
&lt;/p&gt;
&lt;p&gt;
&#22522;&#20110;&#21333;&#35843;&#27604;&#36739;&#38745;&#24577;&#20998;&#26512;&#65292;&#35777;&#26126;&#20102;&#21202;&#22799;&#29305;&#21015;&#21407;&#29702;&#65292;&#21363;&#22312;&#24207;&#34917;&#23436;&#24615;&#20551;&#35774;&#19979;&#65292;&#22914;&#26524;&#30701;&#26399;&#35843;&#25972;&#21463;&#21040;&#21333;&#35843;&#25104;&#26412;&#24433;&#21709;&#65292;&#21017;&#38271;&#26399;&#23545;&#20914;&#20987;&#30340;&#21709;&#24212;&#22823;&#20110;&#30701;&#26399;&#21709;&#24212;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#21457;&#23637;&#20102;&#19968;&#20010;&#20851;&#20110;&#24102;&#26377;&#35843;&#25972;&#25104;&#26412;&#27169;&#22411;&#30340;&#21333;&#35843;&#27604;&#36739;&#38745;&#24577;&#20998;&#26512;&#29702;&#35770;&#12290;&#25105;&#20204;&#34920;&#26126;&#65292;&#22312;&#23545;&#30446;&#26631;&#20989;&#25968;&#30340;&#36890;&#24120;&#24207;&#34917;&#23436;&#24615;&#20551;&#35774;&#19979;&#65292;&#21487;&#20197;&#24471;&#20986;&#27604;&#36739;&#38745;&#24577;&#30340;&#32467;&#35770;&#65292;&#21482;&#38656;&#35201;&#23545;&#25104;&#26412;&#20570;&#20986;&#24456;&#23569;&#30340;&#20551;&#35774;&#65306;&#21482;&#38656;&#35201;&#19968;&#20010;&#28201;&#21644;&#30340;&#21333;&#35843;&#24615;&#26465;&#20214;&#12290;&#25105;&#20204;&#21033;&#29992;&#36825;&#19968;&#35265;&#35299;&#26469;&#35777;&#26126;&#19968;&#20010;&#19968;&#33324;&#30340;&#21202;&#22799;&#29305;&#21015;&#21407;&#29702;&#65306;&#22312;&#24207;&#34917;&#23436;&#24615;&#20551;&#35774;&#19979;&#65292;&#22914;&#26524;&#30701;&#26399;&#35843;&#25972;&#21463;&#21040;&#21333;&#35843;&#25104;&#26412;&#30340;&#24433;&#21709;&#65292;&#37027;&#20040;&#23545;&#20914;&#20987;&#30340;&#38271;&#26399;&#21709;&#24212;&#23558;&#22823;&#20110;&#30701;&#26399;&#21709;&#24212;&#12290;&#25105;&#20204;&#23558;&#36825;&#20123;&#32467;&#26524;&#25193;&#23637;&#21040;&#19968;&#20010;&#23436;&#20840;&#21160;&#24577;&#30340;&#38543;&#26102;&#38388;&#35843;&#25972;&#27169;&#22411;&#65306;&#21202;&#22799;&#29305;&#21015;&#21407;&#29702;&#20173;&#28982;&#25104;&#31435;&#65292;&#24182;&#19988;&#22312;&#26356;&#24378;&#30340;&#20551;&#35774;&#19979;&#65292;&#26368;&#20248;&#35843;&#25972;&#36981;&#24490;&#21333;&#35843;&#36335;&#24452;&#12290;&#25105;&#20204;&#23558;&#25105;&#20204;&#30340;&#32467;&#26524;&#24212;&#29992;&#20110;&#20648;&#33988;&#12289;&#29983;&#20135;&#12289;&#23450;&#20215;&#12289;&#21171;&#21160;&#20379;&#32473;&#21644;&#25237;&#36164;&#27169;&#22411;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2206.00347v3 Announce Type: replace  Abstract: We develop a theory of monotone comparative statics for models with adjustment costs. We show that comparative-statics conclusions may be drawn under the usual ordinal complementarity assumptions on the objective function, assuming very little about costs: only a mild monotonicity condition is required. We use this insight to prove a general le Chatelier principle: under the ordinal complementarity assumptions, if short-run adjustment is subject to a monotone cost, then the long-run response to a shock is greater than the short-run response. We extend these results to a fully dynamic model of adjustment over time: the le Chatelier principle remains valid, and under slightly stronger assumptions, optimal adjustment follows a monotone path. We apply our results to models of saving, production, pricing, labor supply and investment.
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#23884;&#22871;&#38750;&#21442;&#25968;&#24037;&#20855;&#21464;&#37327;&#22238;&#24402;&#30340;&#23545;&#25239;&#20272;&#35745;&#22120;&#65292;&#24182;&#25552;&#20379;&#20102;&#23545;&#22240;&#26524;&#21442;&#25968;&#36827;&#34892;&#26377;&#25928;&#25512;&#26029;&#30340;&#20805;&#20998;&#26465;&#20214;&#65292;&#20855;&#26377;&#38480;&#21046;&#30149;&#24577;&#24615;&#22797;&#21512;&#25216;&#26415;&#12289;&#22810;&#31181;&#36866;&#24212;&#27169;&#22411;&#21644;&#25193;&#23637;&#21040;&#22240;&#26524;&#20989;&#25968;&#31561;&#29305;&#24449;&#12290;</title><link>https://arxiv.org/abs/2112.14249</link><description>&lt;p&gt;
&#23884;&#22871;&#38750;&#21442;&#25968;&#24037;&#20855;&#21464;&#37327;&#22238;&#24402;&#65306;&#38271;&#26399;&#12289;&#20013;&#20171;&#21644;&#26102;&#21464;&#27835;&#30103;&#25928;&#24212;
&lt;/p&gt;
&lt;p&gt;
Nested Nonparametric Instrumental Variable Regression: Long Term, Mediated, and Time Varying Treatment Effects
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2112.14249
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#23884;&#22871;&#38750;&#21442;&#25968;&#24037;&#20855;&#21464;&#37327;&#22238;&#24402;&#30340;&#23545;&#25239;&#20272;&#35745;&#22120;&#65292;&#24182;&#25552;&#20379;&#20102;&#23545;&#22240;&#26524;&#21442;&#25968;&#36827;&#34892;&#26377;&#25928;&#25512;&#26029;&#30340;&#20805;&#20998;&#26465;&#20214;&#65292;&#20855;&#26377;&#38480;&#21046;&#30149;&#24577;&#24615;&#22797;&#21512;&#25216;&#26415;&#12289;&#22810;&#31181;&#36866;&#24212;&#27169;&#22411;&#21644;&#25193;&#23637;&#21040;&#22240;&#26524;&#20989;&#25968;&#31561;&#29305;&#24449;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#30701;&#38754;&#26495;&#25968;&#25454;&#27169;&#22411;&#20013;&#30340;&#20960;&#20010;&#22240;&#26524;&#21442;&#25968;&#26159;&#31216;&#20026;&#23884;&#22871;&#38750;&#21442;&#25968;&#24037;&#20855;&#21464;&#37327;&#22238;&#24402;&#65288;nested NPIV&#65289;&#30340;&#20989;&#25968;&#30340;&#26631;&#37327;&#24635;&#32467;&#12290;&#20363;&#22914;&#65292;&#20351;&#29992;&#20195;&#29702;&#21464;&#37327;&#35782;&#21035;&#20986;&#38271;&#26399;&#12289;&#20013;&#20171;&#21644;&#26102;&#21464;&#27835;&#30103;&#25928;&#24212;&#12290;&#28982;&#32780;&#65292;&#20284;&#20046;&#19981;&#23384;&#22312;&#20851;&#20110;&#23884;&#22871;NPIV&#30340;&#20808;&#21069;&#20272;&#35745;&#37327;&#25110;&#20445;&#35777;&#65292;&#36825;&#26679;&#23601;&#26080;&#27861;&#28789;&#27963;&#22320;&#20272;&#35745;&#21644;&#25512;&#26029;&#36825;&#20123;&#22240;&#26524;&#21442;&#25968;&#12290;&#19968;&#20010;&#20027;&#35201;&#25361;&#25112;&#26159;&#30001;&#20110;&#23884;&#22871;&#36870;&#38382;&#39064;&#32780;&#23548;&#33268;&#30340;&#22797;&#21512;&#30149;&#24577;&#24615;&#12290;&#25105;&#20204;&#20998;&#26512;&#20102;&#23884;&#22871;NPIV&#30340;&#23545;&#25239;&#20272;&#35745;&#22120;&#65292;&#24182;&#25552;&#20379;&#20102;&#23545;&#22240;&#26524;&#21442;&#25968;&#36827;&#34892;&#26377;&#25928;&#25512;&#26029;&#30340;&#20805;&#20998;&#26465;&#20214;&#12290;&#25105;&#20204;&#30340;&#38750;&#28176;&#36817;&#20998;&#26512;&#20855;&#26377;&#19977;&#20010;&#26174;&#33879;&#29305;&#24449;&#65306;&#65288;i&#65289;&#24341;&#20837;&#38480;&#21046;&#30149;&#24577;&#24615;&#22797;&#21512;&#30340;&#25216;&#26415;&#65307;&#65288;ii&#65289;&#36866;&#24212;&#31070;&#32463;&#32593;&#32476;&#12289;&#38543;&#26426;&#26862;&#26519;&#21644;&#20877;&#29983;&#26680;&#24076;&#23572;&#20271;&#29305;&#31354;&#38388;&#65307;&#65288;iii&#65289;&#25193;&#23637;&#21040;&#22240;&#26524;&#20989;&#25968;&#65292;&#20363;&#22914;&#38271;&#26399;&#24322;&#36136;&#27835;&#30103;&#25928;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2112.14249v3 Announce Type: replace-cross  Abstract: Several causal parameters in short panel data models are scalar summaries of a function called a nested nonparametric instrumental variable regression (nested NPIV). Examples include long term, mediated, and time varying treatment effects identified using proxy variables. However, it appears that no prior estimators or guarantees for nested NPIV exist, preventing flexible estimation and inference for these causal parameters. A major challenge is compounding ill posedness due to the nested inverse problems. We analyze adversarial estimators of nested NPIV, and provide sufficient conditions for efficient inference on the causal parameter. Our nonasymptotic analysis has three salient features: (i) introducing techniques that limit how ill posedness compounds; (ii) accommodating neural networks, random forests, and reproducing kernel Hilbert spaces; and (iii) extending to causal functions, e.g. long term heterogeneous treatment eff
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#36890;&#29992;&#26041;&#27861;&#65292;&#21487;&#20197;&#26681;&#25454;&#22810;&#20010;&#20262;&#29702;&#21407;&#21017;&#35745;&#31639;&#32676;&#20307;&#20915;&#31574;&#20013;&#30340;&#20849;&#35782;&#12290;&#35813;&#26041;&#27861;&#36890;&#36807;&#26368;&#23567;&#21270;&#22810;&#20010;p&#24230;&#37327;&#36317;&#31163;&#20989;&#25968;&#26469;&#35299;&#20915;&#38382;&#39064;&#65292;&#20174;&#32780;&#25512;&#24191;&#20102;&#29616;&#26377;&#30340;&#26041;&#27861;&#24182;&#22312;&#23454;&#39564;&#20013;&#24471;&#21040;&#39564;&#35777;&#12290;</title><link>http://arxiv.org/abs/2401.07818</link><description>&lt;p&gt;
&#35745;&#31639;&#38598;&#20307;&#20915;&#31574;&#20013;&#32508;&#21512;&#22810;&#20010;&#20262;&#29702;&#21407;&#21017;&#30340;&#20849;&#35782;&#30340;&#19968;&#33324;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
A General Approach for Computing a Consensus in Group Decision Making That Integrates Multiple Ethical Principles. (arXiv:2401.07818v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.07818
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#36890;&#29992;&#26041;&#27861;&#65292;&#21487;&#20197;&#26681;&#25454;&#22810;&#20010;&#20262;&#29702;&#21407;&#21017;&#35745;&#31639;&#32676;&#20307;&#20915;&#31574;&#20013;&#30340;&#20849;&#35782;&#12290;&#35813;&#26041;&#27861;&#36890;&#36807;&#26368;&#23567;&#21270;&#22810;&#20010;p&#24230;&#37327;&#36317;&#31163;&#20989;&#25968;&#26469;&#35299;&#20915;&#38382;&#39064;&#65292;&#20174;&#32780;&#25512;&#24191;&#20102;&#29616;&#26377;&#30340;&#26041;&#27861;&#24182;&#22312;&#23454;&#39564;&#20013;&#24471;&#21040;&#39564;&#35777;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#35299;&#20915;&#20102;&#22312;&#32676;&#20307;&#20915;&#31574;&#30340;&#32972;&#26223;&#19979;&#65292;&#26681;&#25454;&#22810;&#20010;&#20262;&#29702;&#21407;&#21017;&#65288;&#20363;&#22914;&#65292;&#19982;&#26412;&#22612;&#22982;&#23398;&#35828;&#30456;&#20851;&#30340;&#26368;&#22823;&#33258;&#30001;&#21407;&#21017;&#21644;&#19982;&#27931;&#23572;&#26031;&#21407;&#21017;&#30456;&#20851;&#30340;&#26368;&#22823;&#20844;&#24179;&#21407;&#21017;&#65289;&#35745;&#31639;&#20849;&#35782;&#30340;&#38382;&#39064;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#22522;&#20110;&#22810;&#35268;&#33539;&#36924;&#36817;&#38382;&#39064;&#30340;&#21019;&#26032;&#24418;&#24335;&#21270;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#26088;&#22312;&#26368;&#23567;&#21270;&#22810;&#20010;p&#24230;&#37327;&#36317;&#31163;&#20989;&#25968;&#65292;&#20854;&#20013;&#27599;&#20010;&#21442;&#25968;p&#20195;&#34920;&#19968;&#20010;&#32473;&#23450;&#30340;&#20262;&#29702;&#21407;&#21017;&#12290;&#25105;&#20204;&#30340;&#36129;&#29486;&#22312;&#31038;&#20250;&#36873;&#25321;&#30340;&#35282;&#24230;&#20855;&#26377;&#26126;&#26174;&#30340;&#22909;&#22788;&#12290;&#39318;&#20808;&#65292;&#25105;&#20204;&#30340;&#26041;&#27861;&#26174;&#30528;&#25512;&#24191;&#20102;&#20165;&#38024;&#23545;&#20004;&#20010;&#20262;&#29702;&#21407;&#21017;&#65288;p&#35774;&#32622;&#20026;1&#65292;&#29992;&#20110;&#26368;&#22823;&#33258;&#30001;&#65307;p&#35774;&#32622;&#20026;&#26080;&#31351;&#22823;&#65292;&#29992;&#20110;&#26368;&#22823;&#20844;&#24179;&#65289;&#30340;&#26368;&#26032;&#26041;&#27861;&#12290;&#20854;&#27425;&#65292;&#25105;&#20204;&#30340;&#23454;&#39564;&#32467;&#26524;&#32771;&#34385;&#20102;&#19968;&#20010;&#24050;&#24314;&#31435;&#30340;&#27979;&#35797;&#26696;&#20363;&#65292;&#35777;&#26126;&#20102;&#25105;&#20204;&#30340;&#26041;&#27861;&#30340;&#26377;&#25928;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
We tackle the problem of computing a consensus according to multiple ethical principles -- which can include, for example, the principle of maximum freedom associated with the Benthamite doctrine and the principle of maximum fairness associated with the Rawlsian principles -- among the preferences of different individuals in the context of Group-Decision-Making. More formally, we put forward a novel formalisation of the above-mentioned problem based on a multinorm approximation problem that aims at minimising multiple p-metric distance functions, where each parameter p represents a given ethical principle. Our contribution incurs obvious benefits from a social-choice perspective. Firstly, our approach significantly generalises state-of-the-art approaches that were limited to only two ethical principles (p set to one, for maximum freedom, and p set to infinity, for maximum fairness). Secondly, our experimental results considering an established test case demonstrate that our approach is
&lt;/p&gt;</description></item><item><title>&#35813;&#30740;&#31350;&#35299;&#20915;&#20102;&#35782;&#21035;&#20855;&#26377;&#26368;&#39640;&#39044;&#26399;&#25928;&#26524;&#30340;&#27835;&#30103;&#26041;&#26696;&#30340;&#38382;&#39064;&#65292;&#24182;&#25552;&#20986;&#20102;&#20855;&#26377;&#22266;&#23450;&#39044;&#31639;&#30340;&#23616;&#37096;&#26368;&#20248;&#31639;&#27861;&#26469;&#38477;&#20302;&#38169;&#35823;&#35782;&#21035;&#30340;&#27010;&#29575;&#12290;</title><link>http://arxiv.org/abs/2310.19788</link><description>&lt;p&gt;
&#20855;&#26377;&#22266;&#23450;&#39044;&#31639;&#30340;&#23616;&#37096;&#26368;&#20248;&#26368;&#20339;&#33218;&#35782;&#21035;&#31639;&#27861;
&lt;/p&gt;
&lt;p&gt;
Locally Optimal Best Arm Identification with a Fixed Budget. (arXiv:2310.19788v1 [math.ST])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.19788
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#35299;&#20915;&#20102;&#35782;&#21035;&#20855;&#26377;&#26368;&#39640;&#39044;&#26399;&#25928;&#26524;&#30340;&#27835;&#30103;&#26041;&#26696;&#30340;&#38382;&#39064;&#65292;&#24182;&#25552;&#20986;&#20102;&#20855;&#26377;&#22266;&#23450;&#39044;&#31639;&#30340;&#23616;&#37096;&#26368;&#20248;&#31639;&#27861;&#26469;&#38477;&#20302;&#38169;&#35823;&#35782;&#21035;&#30340;&#27010;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;&#35782;&#21035;&#26368;&#20339;&#27835;&#30103;&#26041;&#26696;&#30340;&#38382;&#39064;&#65292;&#21363;&#20855;&#26377;&#26368;&#39640;&#39044;&#26399;&#25928;&#26524;&#30340;&#27835;&#30103;&#26041;&#26696;&#12290;&#25105;&#20204;&#26088;&#22312;&#36890;&#36807;&#38477;&#20302;&#38169;&#35823;&#35782;&#21035;&#30340;&#27010;&#29575;&#26469;&#30830;&#23450;&#26368;&#20339;&#27835;&#30103;&#26041;&#26696;&#65292;&#36825;&#19968;&#38382;&#39064;&#22312;&#35768;&#22810;&#30740;&#31350;&#39046;&#22495;&#20013;&#24050;&#34987;&#25506;&#32034;&#65292;&#21253;&#25324;&#26368;&#20339;&#33218;&#35782;&#21035;&#65288;Best Arm Identification&#65292;BAI&#65289;&#21644;&#24207;&#21015;&#20248;&#21270;&#12290;&#22312;&#25105;&#20204;&#30340;&#23454;&#39564;&#20013;&#65292;&#27835;&#30103;&#20998;&#37197;&#30340;&#36718;&#25968;&#26159;&#22266;&#23450;&#30340;&#12290;&#22312;&#27599;&#19968;&#36718;&#20013;&#65292;&#20915;&#31574;&#32773;&#23558;&#19968;&#31181;&#27835;&#30103;&#26041;&#26696;&#20998;&#37197;&#32473;&#19968;&#20010;&#23454;&#39564;&#21333;&#20803;&#65292;&#24182;&#35266;&#23519;&#30456;&#24212;&#30340;&#32467;&#26524;&#65292;&#35813;&#32467;&#26524;&#36981;&#24490;&#19981;&#21516;&#27835;&#30103;&#26041;&#26696;&#20043;&#38388;&#26041;&#24046;&#19981;&#21516;&#30340;&#39640;&#26031;&#20998;&#24067;&#12290;&#22312;&#23454;&#39564;&#32467;&#26463;&#26102;&#65292;&#25105;&#20204;&#26681;&#25454;&#35266;&#23519;&#32467;&#26524;&#25512;&#33616;&#19968;&#31181;&#27835;&#30103;&#26041;&#26696;&#20316;&#20026;&#26368;&#20339;&#27835;&#30103;&#26041;&#26696;&#30340;&#20272;&#35745;&#20540;&#12290;&#20915;&#31574;&#32773;&#30340;&#30446;&#26631;&#26159;&#35774;&#35745;&#19968;&#20010;&#23454;&#39564;&#65292;&#20351;&#38169;&#35823;&#35782;&#21035;&#26368;&#20339;&#27835;&#30103;&#26041;&#26696;&#30340;&#27010;&#29575;&#26368;&#23567;&#21270;&#12290;&#22522;&#20110;&#36825;&#19968;&#30446;&#26631;&#65292;&#25105;&#20204;&#24320;&#21457;&#20102;&#35823;&#35782;&#21035;&#27010;&#29575;&#30340;&#19979;&#30028;&#12290;
&lt;/p&gt;
&lt;p&gt;
This study investigates the problem of identifying the best treatment arm, a treatment arm with the highest expected outcome. We aim to identify the best treatment arm with a lower probability of misidentification, which has been explored under various names across numerous research fields, including \emph{best arm identification} (BAI) and ordinal optimization. In our experiments, the number of treatment-allocation rounds is fixed. In each round, a decision-maker allocates a treatment arm to an experimental unit and observes a corresponding outcome, which follows a Gaussian distribution with a variance different among treatment arms. At the end of the experiment, we recommend one of the treatment arms as an estimate of the best treatment arm based on the observations. The objective of the decision-maker is to design an experiment that minimizes the probability of misidentifying the best treatment arm. With this objective in mind, we develop lower bounds for the probability of misident
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#23545;&#22823;&#22411;&#32858;&#31867;&#38598;&#32676;&#20855;&#26377;&#40065;&#26834;&#24615;&#30340;&#32858;&#31867;&#40065;&#26834;&#25512;&#26029;&#26041;&#27861;&#65292;&#26080;&#38656;&#23614;&#25351;&#25968;&#20272;&#35745;&#19988;&#22312;&#23614;&#20998;&#24067;&#24773;&#20917;&#19979;&#20063;&#26377;&#25928;&#12290;</title><link>http://arxiv.org/abs/2308.10138</link><description>&lt;p&gt;
&#23545;&#22823;&#22411;&#32858;&#31867;&#38598;&#32676;&#20855;&#26377;&#40065;&#26834;&#24615;&#30340;&#32858;&#31867;&#40065;&#26834;&#25512;&#26029;
&lt;/p&gt;
&lt;p&gt;
Cluster-Robust Inference Robust to Large Clusters. (arXiv:2308.10138v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.10138
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#23545;&#22823;&#22411;&#32858;&#31867;&#38598;&#32676;&#20855;&#26377;&#40065;&#26834;&#24615;&#30340;&#32858;&#31867;&#40065;&#26834;&#25512;&#26029;&#26041;&#27861;&#65292;&#26080;&#38656;&#23614;&#25351;&#25968;&#20272;&#35745;&#19988;&#22312;&#23614;&#20998;&#24067;&#24773;&#20917;&#19979;&#20063;&#26377;&#25928;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26368;&#36817;&#25991;&#29486;Sasaki&#21644;Wang (2022)&#25351;&#20986;&#65292;&#22312;&#23384;&#22312;&#22823;&#22411;&#32858;&#31867;&#38598;&#32676;&#30340;&#24773;&#20917;&#19979;&#65292;&#20256;&#32479;&#30340;&#32858;&#31867;&#40065;&#26834;&#26631;&#20934;&#35823;&#24046;&#22833;&#25928;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#32858;&#31867;&#40065;&#26834;&#25512;&#26029;&#26041;&#27861;&#65292;&#21363;&#20351;&#22312;&#23384;&#22312;&#22823;&#22411;&#32858;&#31867;&#38598;&#32676;&#30340;&#24773;&#20917;&#19979;&#20063;&#26159;&#26377;&#25928;&#30340;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#24403;&#32858;&#31867;&#22823;&#23567;&#30340;&#20998;&#24067;&#21576;&#24130;&#24459;&#19988;&#25351;&#25968;&#23567;&#20110;2&#26102;&#65292;&#25105;&#20204;&#25512;&#23548;&#20102;&#22522;&#20110;&#24120;&#35265;&#32858;&#31867;&#40065;&#26834;&#26041;&#24046;&#20272;&#35745;&#20540;&#30340;t&#32479;&#35745;&#37327;&#30340;&#28176;&#36817;&#20998;&#24067;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#23376;&#25277;&#26679;&#30340;&#25512;&#26029;&#36807;&#31243;&#65292;&#24182;&#35777;&#26126;&#20102;&#20854;&#26377;&#25928;&#24615;&#12290;&#25105;&#20204;&#25552;&#20986;&#30340;&#26041;&#27861;&#19981;&#38656;&#35201;&#23614;&#25351;&#25968;&#20272;&#35745;&#65292;&#24182;&#19988;&#22312;&#36890;&#24120;&#30340;&#23614;&#20998;&#24067;&#24773;&#20917;&#19979;&#20063;&#20445;&#25345;&#26377;&#25928;&#12290;
&lt;/p&gt;
&lt;p&gt;
The recent literature Sasaki and Wang (2022) points out that the conventional cluster-robust standard errors fail in the presence of large clusters. We propose a novel method of cluster-robust inference that is valid even in the presence of large clusters. Specifically, we derive the asymptotic distribution for the t-statistics based on the common cluster-robust variance estimators when the distribution of cluster sizes follows a power law with an exponent less than two. We then propose an inference procedure based on subsampling and show its validity. Our proposed method does not require tail index estimation and remains valid under the usual thin-tailed scenarios as well.
&lt;/p&gt;</description></item><item><title>&#32463;&#27982;&#22797;&#26434;&#24615;&#26041;&#27861;&#22312;&#30740;&#31350;&#32463;&#27982;&#36716;&#22411;&#21644;&#21487;&#25345;&#32493;&#21457;&#23637;&#26041;&#38754;&#20855;&#26377;&#24040;&#22823;&#28508;&#21147;&#12290;&#26412;&#25991;&#22238;&#39038;&#21644;&#24635;&#32467;&#20102;&#20174;&#32463;&#27982;&#22797;&#26434;&#24615;&#30340;&#35282;&#24230;&#30740;&#31350;&#21487;&#25345;&#32493;&#21457;&#23637;&#36716;&#22411;&#30340;&#30456;&#20851;&#25968;&#25454;&#12289;&#26041;&#27861;&#21644;&#25991;&#29486;&#12290;&#23398;&#32773;&#20204;&#25552;&#20986;&#20102;&#35782;&#21035;&#32511;&#33394;&#20135;&#21697;&#29305;&#24449;&#21644;&#35780;&#20272;&#20135;&#19994;&#20934;&#22791;&#24773;&#20917;&#30340;&#24314;&#35758;&#65292;&#24182;&#23545;&#32463;&#27982;&#22797;&#26434;&#24615;&#25351;&#26631;&#19982;&#29615;&#22659;&#21487;&#25345;&#32493;&#24615;&#30456;&#20851;&#25351;&#26631;&#20043;&#38388;&#30340;&#20851;&#31995;&#36827;&#34892;&#20102;&#35843;&#26597;&#12290;</title><link>http://arxiv.org/abs/2308.07172</link><description>&lt;p&gt;
&#32463;&#27982;&#22797;&#26434;&#24615;&#19982;&#21487;&#25345;&#32493;&#21457;&#23637;&#36716;&#22411;&#65306;&#25968;&#25454;&#12289;&#26041;&#27861;&#21644;&#25991;&#29486;&#32508;&#36848;
&lt;/p&gt;
&lt;p&gt;
Economic complexity and the sustainability transition: A review of data, methods, and literature. (arXiv:2308.07172v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.07172
&lt;/p&gt;
&lt;p&gt;
&#32463;&#27982;&#22797;&#26434;&#24615;&#26041;&#27861;&#22312;&#30740;&#31350;&#32463;&#27982;&#36716;&#22411;&#21644;&#21487;&#25345;&#32493;&#21457;&#23637;&#26041;&#38754;&#20855;&#26377;&#24040;&#22823;&#28508;&#21147;&#12290;&#26412;&#25991;&#22238;&#39038;&#21644;&#24635;&#32467;&#20102;&#20174;&#32463;&#27982;&#22797;&#26434;&#24615;&#30340;&#35282;&#24230;&#30740;&#31350;&#21487;&#25345;&#32493;&#21457;&#23637;&#36716;&#22411;&#30340;&#30456;&#20851;&#25968;&#25454;&#12289;&#26041;&#27861;&#21644;&#25991;&#29486;&#12290;&#23398;&#32773;&#20204;&#25552;&#20986;&#20102;&#35782;&#21035;&#32511;&#33394;&#20135;&#21697;&#29305;&#24449;&#21644;&#35780;&#20272;&#20135;&#19994;&#20934;&#22791;&#24773;&#20917;&#30340;&#24314;&#35758;&#65292;&#24182;&#23545;&#32463;&#27982;&#22797;&#26434;&#24615;&#25351;&#26631;&#19982;&#29615;&#22659;&#21487;&#25345;&#32493;&#24615;&#30456;&#20851;&#25351;&#26631;&#20043;&#38388;&#30340;&#20851;&#31995;&#36827;&#34892;&#20102;&#35843;&#26597;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#32463;&#27982;&#22797;&#26434;&#24615;&#26041;&#27861;&#22312;&#21508;&#39046;&#22495;&#21644;&#23398;&#31185;&#20013;&#36234;&#26469;&#36234;&#21463;&#27426;&#36814;&#12290;&#23588;&#20854;&#26159;&#22312;&#30740;&#31350;&#21521;&#26356;&#21152;&#32511;&#33394;&#30340;&#32463;&#27982;&#36716;&#22411;&#31561;&#22797;&#26434;&#19988;&#30456;&#20114;&#20851;&#32852;&#29616;&#35937;&#26041;&#38754;&#65292;&#32463;&#27982;&#22797;&#26434;&#24615;&#24037;&#20855;&#31665;&#26174;&#31034;&#20986;&#20102;&#24040;&#22823;&#30340;&#28508;&#21147;&#12290;&#21033;&#29992;&#32463;&#27982;&#22797;&#26434;&#24615;&#26041;&#27861;&#65292;&#23398;&#32773;&#20204;&#19968;&#30452;&#22312;&#30740;&#31350;&#32463;&#27982;&#22797;&#26434;&#24615;&#19982;&#21487;&#25345;&#32493;&#21457;&#23637;&#20043;&#38388;&#30340;&#20851;&#31995;&#65292;&#25552;&#20986;&#20102;&#35782;&#21035;&#32511;&#33394;&#20135;&#21697;&#30340;&#29305;&#24449;&#21644;&#35780;&#20272;&#29983;&#20135;&#21644;&#25216;&#26415;&#32467;&#26500;&#23545;&#21487;&#25345;&#32493;&#21457;&#23637;&#36716;&#22411;&#30340;&#20934;&#22791;&#24773;&#20917;&#30340;&#24314;&#35758;&#12290;&#26412;&#25991;&#25311;&#20174;&#32463;&#27982;&#22797;&#26434;&#24615;&#30340;&#35282;&#24230;&#32508;&#36848;&#21644;&#24635;&#32467;&#19982;&#21487;&#25345;&#32493;&#21457;&#23637;&#36716;&#22411;&#30740;&#31350;&#30456;&#20851;&#30340;&#25968;&#25454;&#12289;&#26041;&#27861;&#21644;&#32463;&#39564;&#25991;&#29486;&#12290;&#25105;&#20204;&#23545;&#32463;&#27982;&#22797;&#26434;&#24615;&#21644;&#29615;&#22659;&#21487;&#25345;&#32493;&#24615;&#30740;&#31350;&#30340;&#19977;&#20010;&#19981;&#21516;&#20294;&#30456;&#20851;&#30340;&#25991;&#29486;&#22359;&#36827;&#34892;&#32508;&#36848;&#12290;&#39318;&#20808;&#65292;&#25105;&#20204;&#35843;&#26597;&#20102;&#32463;&#27982;&#22797;&#26434;&#24615;&#25351;&#26631;&#19982;&#29615;&#22659;&#21487;&#25345;&#32493;&#24615;&#30456;&#20851;&#25351;&#26631;&#20043;&#38388;&#30340;&#20851;&#32852;&#35777;&#25454;&#12290;&#20854;&#27425;&#65292;&#25105;&#20204;&#22238;&#39038;&#20102;&#21162;&#21147;&#35780;&#20272;&#32511;&#33394;&#31454;&#20105;&#21147;&#21644;&#20225;&#19994;&#21019;&#26032;&#33021;&#21147;&#30340;&#25991;&#31456;&#12290;
&lt;/p&gt;
&lt;p&gt;
Economic Complexity (EC) methods have gained increasing popularity across fields and disciplines. In particular, the EC toolbox has proved particularly promising in the study of complex and interrelated phenomena, such as the transition towards a greener economy. Using the EC approach, scholars have been investigating the relationship between EC and sustainability, proposing to identify the distinguishing characteristics of green products and to assess the readiness of productive and technological structures for the sustainability transition. This article proposes to review and summarize the data, methods, and empirical literature that are relevant to the study of the sustainability transition from an EC perspective. We review three distinct but connected blocks of literature on EC and environmental sustainability. First, we survey the evidence linking measures of EC to indicators related to environmental sustainability. Second, we review articles that strive to assess the green compet
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22312;&#38754;&#26495;&#25968;&#25454;&#20013;&#26080;&#38656;&#25351;&#23450;&#32593;&#32476;&#32467;&#26500;&#26469;&#26816;&#39564;&#21516;&#34892;&#24433;&#21709;&#30340;&#26041;&#27861;&#65292;&#22686;&#21152;&#20102;&#24037;&#20855;&#21464;&#37327;&#25968;&#30446;&#65292;&#36890;&#36807;&#22810;IV&#29615;&#22659;&#24182;&#25193;&#23637;&#24050;&#26377;&#22810;IV&#28176;&#36817;&#32467;&#26524;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#35813;&#26041;&#27861;&#22312;&#23384;&#22312;&#20010;&#20307;&#21644;&#26102;&#38388;&#22266;&#23450;&#25928;&#24212;&#30340;&#24773;&#20917;&#19979;&#26159;&#26377;&#25928;&#30340;&#12290;</title><link>http://arxiv.org/abs/2306.09806</link><description>&lt;p&gt;
&#19981;&#38656;&#25351;&#23450;&#32593;&#32476;&#32467;&#26500;&#30340;&#21516;&#34892;&#24433;&#21709;&#27979;&#35797;
&lt;/p&gt;
&lt;p&gt;
Testing for Peer Effects without Specifying the Network Structure. (arXiv:2306.09806v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.09806
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22312;&#38754;&#26495;&#25968;&#25454;&#20013;&#26080;&#38656;&#25351;&#23450;&#32593;&#32476;&#32467;&#26500;&#26469;&#26816;&#39564;&#21516;&#34892;&#24433;&#21709;&#30340;&#26041;&#27861;&#65292;&#22686;&#21152;&#20102;&#24037;&#20855;&#21464;&#37327;&#25968;&#30446;&#65292;&#36890;&#36807;&#22810;IV&#29615;&#22659;&#24182;&#25193;&#23637;&#24050;&#26377;&#22810;IV&#28176;&#36817;&#32467;&#26524;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#35813;&#26041;&#27861;&#22312;&#23384;&#22312;&#20010;&#20307;&#21644;&#26102;&#38388;&#22266;&#23450;&#25928;&#24212;&#30340;&#24773;&#20917;&#19979;&#26159;&#26377;&#25928;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;Anderson-Rubin&#65288;AR&#65289;&#26816;&#39564;&#26041;&#27861;&#65292;&#29992;&#20110;&#22312;&#27809;&#26377;&#25351;&#23450;&#32593;&#32476;&#32467;&#26500;&#30340;&#38754;&#26495;&#25968;&#25454;&#20013;&#26816;&#39564;&#21516;&#34892;&#24433;&#21709;&#12290;&#25105;&#20204;&#30340;&#26080;&#38480;&#21046;&#27169;&#22411;&#26159;&#19968;&#20010;&#24102;&#26377;&#29305;&#23450;&#23545;&#31561;&#20307;&#21516;&#34892;&#24433;&#21709;&#30340;&#32447;&#24615;&#38754;&#26495;&#25968;&#25454;&#27169;&#22411;&#12290;&#25152;&#25552;&#20986;&#30340;AR&#26816;&#39564;&#35780;&#20272;&#21516;&#34892;&#25928;&#24212;&#31995;&#25968;&#26159;&#21542;&#20840;&#37096;&#20026;&#38646;&#12290;&#38543;&#30528;&#23545;&#31561;&#20307;&#25928;&#24212;&#31995;&#25968;&#30340;&#22686;&#21152;&#65292;&#20351;&#29992;&#30340;&#24037;&#20855;&#21464;&#37327;&#65288;IVs&#65289;&#25968;&#37327;&#38543;&#26679;&#26412;&#25968;&#37327;&#22686;&#21152;&#32780;&#22686;&#21152;&#65292;&#24418;&#25104;Bekker&#30340;&#22810;IV&#29615;&#22659;&#12290;&#36890;&#36807;&#23558;&#29616;&#26377;&#30340;&#22810;IV&#28176;&#36817;&#32467;&#26524;&#25193;&#23637;&#21040;&#38754;&#26495;&#25968;&#25454;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#25152;&#25552;&#20986;&#30340;AR&#27979;&#35797;&#22312;&#23384;&#22312;&#20010;&#20307;&#21644;&#26102;&#38388;&#22266;&#23450;&#25928;&#24212;&#30340;&#24773;&#20917;&#19979;&#26159;&#28176;&#36817;&#26377;&#25928;&#30340;&#12290;&#25105;&#20204;&#36827;&#34892;&#20102;&#33945;&#29305;&#21345;&#32599;&#27169;&#25311;&#26469;&#30740;&#31350;AR&#27979;&#35797;&#30340;&#26377;&#38480;&#26679;&#26412;&#24615;&#33021;&#65292;&#24182;&#25552;&#20379;&#20102;&#20004;&#20010;&#24212;&#29992;&#26469;&#35777;&#26126;&#20854;&#23454;&#35777;&#24847;&#20041;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper proposes an Anderson-Rubin (AR) test for the presence of peer effects in panel data without the need to specify the network structure. The unrestricted model of our test is a linear panel data model of social interactions with dyad-specific peer effects. The proposed AR test evaluates if the peer effect coefficients are all zero. As the number of peer effect coefficients increases with the sample size, so does the number of instrumental variables (IVs) employed to estimate the unrestricted model, rendering Bekker's many-IV environment. By extending existing many-IV asymptotic results to panel data, we show that the proposed AR test is asymptotically valid under the presence of both individual and time fixed effects. We conduct Monte Carlo simulations to investigate the finite sample performance of the AR test and provide two applications to demonstrate its empirical relevance.
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#38024;&#23545;&#22823;&#35268;&#27169;&#26102;&#38388;&#24207;&#21015;&#30340;&#26102;&#21464;&#32593;&#32476;&#21521;&#37327;&#33258;&#22238;&#24402;&#27169;&#22411;&#30340;&#32479;&#35745;&#25512;&#26029;&#26041;&#27861;&#65292;&#36890;&#36807;&#24341;&#20837;&#28508;&#22312;&#30340;&#32676;&#32452;&#32467;&#26500;&#26469;&#20943;&#23569;&#26410;&#30693;&#31995;&#25968;&#25968;&#37327;&#24182;&#25552;&#20986;&#20102;&#32676;&#32452;&#21518;&#23616;&#37096;&#32447;&#24615;&#24179;&#28369;&#26041;&#27861;&#26469;&#25552;&#39640;&#21021;&#27493;&#20272;&#35745;&#30340;&#25910;&#25947;&#36895;&#24230;&#65292;&#24182;&#36827;&#34892;&#20102;&#30456;&#24212;&#30340;&#21442;&#25968;&#27169;&#22411;&#26816;&#39564;&#12290;</title><link>http://arxiv.org/abs/2303.10117</link><description>&lt;p&gt;
&#20998;&#32452;&#26102;&#21464;&#32593;&#32476;&#21521;&#37327;&#33258;&#22238;&#24402;&#27169;&#22411;&#30340;&#25512;&#26029;
&lt;/p&gt;
&lt;p&gt;
Inference of Grouped Time-Varying Network Vector Autoregression Models. (arXiv:2303.10117v1 [stat.ME])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.10117
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#38024;&#23545;&#22823;&#35268;&#27169;&#26102;&#38388;&#24207;&#21015;&#30340;&#26102;&#21464;&#32593;&#32476;&#21521;&#37327;&#33258;&#22238;&#24402;&#27169;&#22411;&#30340;&#32479;&#35745;&#25512;&#26029;&#26041;&#27861;&#65292;&#36890;&#36807;&#24341;&#20837;&#28508;&#22312;&#30340;&#32676;&#32452;&#32467;&#26500;&#26469;&#20943;&#23569;&#26410;&#30693;&#31995;&#25968;&#25968;&#37327;&#24182;&#25552;&#20986;&#20102;&#32676;&#32452;&#21518;&#23616;&#37096;&#32447;&#24615;&#24179;&#28369;&#26041;&#27861;&#26469;&#25552;&#39640;&#21021;&#27493;&#20272;&#35745;&#30340;&#25910;&#25947;&#36895;&#24230;&#65292;&#24182;&#36827;&#34892;&#20102;&#30456;&#24212;&#30340;&#21442;&#25968;&#27169;&#22411;&#26816;&#39564;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#32771;&#34385;&#38024;&#23545;&#22823;&#35268;&#27169;&#26102;&#38388;&#24207;&#21015;&#30340;&#26102;&#21464;&#32593;&#32476;&#21521;&#37327;&#33258;&#22238;&#24402;&#27169;&#22411;&#30340;&#32479;&#35745;&#25512;&#26029;&#12290;&#22312;&#24322;&#26500;&#21644;&#33410;&#28857;&#29305;&#23450;&#30340;&#26102;&#21464;&#21160;&#37327;&#21644;&#32593;&#32476;&#28322;&#20986;&#25928;&#24212;&#20013;&#65292;&#24378;&#21152;&#19968;&#20010;&#28508;&#22312;&#30340;&#32676;&#32452;&#32467;&#26500;&#65292;&#20197;&#20415;&#21487;&#20197;&#22823;&#22823;&#20943;&#23569;&#38656;&#35201;&#20272;&#35745;&#30340;&#26410;&#30693;&#26102;&#21464;&#31995;&#25968;&#30340;&#25968;&#37327;&#12290;&#32463;&#36807;&#24402;&#19968;&#21270;&#36317;&#31163;&#30697;&#38453;&#30340;&#32463;&#20856;&#32858;&#31867;&#31639;&#27861;&#32467;&#21512;&#24191;&#20041;&#20449;&#24687;&#20934;&#21017;&#65292;&#26469;&#19968;&#33268;&#22320;&#20272;&#35745;&#28508;&#22312;&#30340;&#32676;&#32452;&#25968;&#37327;&#21644;&#32676;&#32452;&#25104;&#21592;&#12290;&#25552;&#20986;&#20102;&#19968;&#31181;&#32676;&#32452;&#21518;&#23616;&#37096;&#32447;&#24615;&#24179;&#28369;&#26041;&#27861;&#65292;&#29992;&#20110;&#20272;&#35745;&#32676;&#32452;&#29305;&#23450;&#30340;&#26102;&#21464;&#21160;&#37327;&#21644;&#32593;&#32476;&#25928;&#24212;&#65292;&#20174;&#32780;&#22823;&#22823;&#25552;&#39640;&#20102;&#24573;&#30053;&#28508;&#22312;&#32467;&#26500;&#30340;&#21021;&#27493;&#20272;&#35745;&#30340;&#25910;&#25947;&#36895;&#24230;&#12290;&#27492;&#22806;&#65292;&#36824;&#36827;&#34892;&#20102;&#32676;&#32452;&#21518;&#30340;&#35268;&#26684;&#21270;&#26816;&#39564;&#65292;&#20197;&#39564;&#35777;&#32676;&#32452;&#29305;&#23450;&#30340;&#26102;&#21464;&#31995;&#25968;&#20989;&#25968;&#30340;&#21442;&#25968;&#27169;&#22411;&#20551;&#35774;&#30340;&#26377;&#25928;&#24615;&#65292;&#24182;&#32473;&#20986;&#20102;&#28176;&#36827;&#29702;&#35770;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper considers statistical inference of time-varying network vector autoregression models for large-scale time series. A latent group structure is imposed on the heterogeneous and node-specific time-varying momentum and network spillover effects so that the number of unknown time-varying coefficients to be estimated can be reduced considerably. A classic agglomerative clustering algorithm with normalized distance matrix estimates is combined with a generalized information criterion to consistently estimate the latent group number and membership. A post-grouping local linear smoothing method is proposed to estimate the group-specific time-varying momentum and network effects, substantially improving the convergence rates of the preliminary estimates which ignore the latent structure. In addition, a post-grouping specification test is conducted to verify the validity of the parametric model assumption for group-specific time-varying coefficient functions, and the asymptotic theory 
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#35782;&#21035;&#31574;&#30053;&#26469;&#35299;&#20915;&#20855;&#26377;&#28382;&#21518;&#20381;&#36182;&#21464;&#37327;&#12289;&#22806;&#29983;&#21327;&#21464;&#37327;&#21644;&#23454;&#20307;&#22266;&#23450;&#25928;&#24212;&#30340;&#38754;&#26495;&#25968;&#25454;&#20108;&#20803;&#36873;&#25321;&#27169;&#22411;&#30340;&#35782;&#21035;&#21644;&#20272;&#35745;&#38382;&#39064;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#20801;&#35768;&#20219;&#20309;&#24418;&#24335;&#30340;&#26102;&#38388;&#36235;&#21183;&#65292;&#19981;&#20250;&#21463;&#21040;&#8220;&#32500;&#24230;&#28798;&#38590;&#8221;&#30340;&#24433;&#21709;&#12290;&#22312;&#26377;&#38480;&#26679;&#26412;&#20013;&#34920;&#29616;&#33391;&#22909;&#12290;</title><link>http://arxiv.org/abs/2301.09379</link><description>&lt;p&gt;
&#37325;&#35775;&#20855;&#26377;&#28382;&#21518;&#20381;&#36182;&#21464;&#37327;&#30340;&#38754;&#26495;&#25968;&#25454;&#31163;&#25955;&#36873;&#25321;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
Revisiting Panel Data Discrete Choice Models with Lagged Dependent Variables. (arXiv:2301.09379v2 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2301.09379
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#35782;&#21035;&#31574;&#30053;&#26469;&#35299;&#20915;&#20855;&#26377;&#28382;&#21518;&#20381;&#36182;&#21464;&#37327;&#12289;&#22806;&#29983;&#21327;&#21464;&#37327;&#21644;&#23454;&#20307;&#22266;&#23450;&#25928;&#24212;&#30340;&#38754;&#26495;&#25968;&#25454;&#20108;&#20803;&#36873;&#25321;&#27169;&#22411;&#30340;&#35782;&#21035;&#21644;&#20272;&#35745;&#38382;&#39064;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#20801;&#35768;&#20219;&#20309;&#24418;&#24335;&#30340;&#26102;&#38388;&#36235;&#21183;&#65292;&#19981;&#20250;&#21463;&#21040;&#8220;&#32500;&#24230;&#28798;&#38590;&#8221;&#30340;&#24433;&#21709;&#12290;&#22312;&#26377;&#38480;&#26679;&#26412;&#20013;&#34920;&#29616;&#33391;&#22909;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#37325;&#35775;&#20102;&#20855;&#26377;&#28382;&#21518;&#20381;&#36182;&#21464;&#37327;&#12289;&#22806;&#29983;&#21327;&#21464;&#37327;&#21644;&#23454;&#20307;&#22266;&#23450;&#25928;&#24212;&#30340;&#21322;&#21442;&#25968;&#65288;&#20998;&#24067;&#33258;&#30001;&#65289;&#38754;&#26495;&#25968;&#25454;&#20108;&#20803;&#36873;&#25321;&#27169;&#22411;&#30340;&#35782;&#21035;&#21644;&#20272;&#35745;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#35782;&#21035;&#31574;&#30053;&#65292;&#20351;&#29992;&#20102;&#8220;&#35782;&#21035;&#30340;&#26080;&#38480;&#24615;&#8221;&#35770;&#35777;&#12290;&#19982;&#33879;&#21517;&#30340;Honore&#21644;Kyriazidou&#65288;2000&#65289;&#19981;&#21516;&#65292;&#25105;&#20204;&#30340;&#26041;&#27861;&#20801;&#35768;&#20219;&#20309;&#24418;&#24335;&#30340;&#26102;&#38388;&#36235;&#21183;&#65292;&#32780;&#19988;&#19981;&#20250;&#21463;&#21040;&#8220;&#32500;&#24230;&#28798;&#38590;&#8221;&#30340;&#24433;&#21709;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#26131;&#20110;&#23454;&#26045;&#30340;&#26465;&#20214;&#26368;&#22823;&#24471;&#20998;&#20272;&#35745;&#22120;&#12290;&#25152;&#25552;&#20986;&#20272;&#35745;&#22120;&#30340;&#28176;&#36817;&#24615;&#36136;&#24471;&#21040;&#20102;&#20805;&#20998;&#30340;&#34920;&#24449;&#12290;&#19968;&#39033;&#23567;&#35268;&#27169;&#33945;&#29305;&#21345;&#32599;&#30740;&#31350;&#34920;&#26126;&#65292;&#25105;&#20204;&#30340;&#26041;&#27861;&#22312;&#26377;&#38480;&#26679;&#26412;&#20013;&#34920;&#29616;&#20196;&#20154;&#28385;&#24847;&#12290;&#25105;&#20204;&#36890;&#36807;&#20351;&#29992;&#28595;&#22823;&#21033;&#20122;&#23478;&#24237;&#25910;&#20837;&#21644;&#21171;&#21160;&#21147;&#21160;&#24577;&#35843;&#26597;&#65288;HILDA&#65289;&#25968;&#25454;&#65292;&#25552;&#20986;&#20102;&#19968;&#20010;&#20851;&#20110;&#31169;&#20154;&#21307;&#38498;&#20445;&#38505;&#30331;&#35760;&#30340;&#23454;&#35777;&#24212;&#29992;&#26469;&#35828;&#26126;&#25105;&#20204;&#26041;&#27861;&#30340;&#26377;&#29992;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper revisits the identification and estimation of a class of semiparametric (distribution-free) panel data binary choice models with lagged dependent variables, exogenous covariates, and entity fixed effects. We provide a novel identification strategy, using an "identification at infinity" argument. In contrast with the celebrated Honore and Kyriazidou (2000), our method permits time trends of any form and does not suffer from the "curse of dimensionality". We propose an easily implementable conditional maximum score estimator. The asymptotic properties of the proposed estimator are fully characterized. A small-scale Monte Carlo study demonstrates that our approach performs satisfactorily in finite samples. We illustrate the usefulness of our method by presenting an empirical application to enrollment in private hospital insurance using the Household, Income and Labour Dynamics in Australia (HILDA) Survey data.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#38750;&#21442;&#25968;&#39034;&#24207;&#26816;&#39564;&#21644;&#32622;&#20449;&#21306;&#38388;&#65292;&#22312;&#19968;&#33324;&#38750;&#21442;&#25968;&#25968;&#25454;&#29983;&#25104;&#36807;&#31243;&#19979;&#25552;&#20379;&#20102;&#31867;&#22411;I&#38169;&#35823;&#21644;&#26399;&#26395;&#25298;&#32477;&#26102;&#38388;&#20445;&#35777;&#65292;&#25552;&#39640;&#20102;&#20854;&#28789;&#27963;&#24615;&#21644;&#24615;&#33021;&#12290;</title><link>http://arxiv.org/abs/2212.14411</link><description>&lt;p&gt;
&#36817;&#20284;&#26368;&#20248;&#30340;&#38750;&#21442;&#25968;&#39034;&#24207;&#26816;&#39564;&#21644;&#20855;&#26377;&#21487;&#33021;&#30456;&#20851;&#35266;&#27979;&#30340;&#32622;&#20449;&#21306;&#38388;
&lt;/p&gt;
&lt;p&gt;
Near-Optimal Non-Parametric Sequential Tests and Confidence Sequences with Possibly Dependent Observations. (arXiv:2212.14411v2 [stat.ME] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2212.14411
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#38750;&#21442;&#25968;&#39034;&#24207;&#26816;&#39564;&#21644;&#32622;&#20449;&#21306;&#38388;&#65292;&#22312;&#19968;&#33324;&#38750;&#21442;&#25968;&#25968;&#25454;&#29983;&#25104;&#36807;&#31243;&#19979;&#25552;&#20379;&#20102;&#31867;&#22411;I&#38169;&#35823;&#21644;&#26399;&#26395;&#25298;&#32477;&#26102;&#38388;&#20445;&#35777;&#65292;&#25552;&#39640;&#20102;&#20854;&#28789;&#27963;&#24615;&#21644;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#39034;&#24207;&#26816;&#39564;&#21644;&#20854;&#38544;&#21547;&#30340;&#32622;&#20449;&#21306;&#38388;&#22312;&#20219;&#24847;&#20572;&#27490;&#26102;&#38388;&#19979;&#37117;&#33021;&#25552;&#20379;&#28789;&#27963;&#30340;&#32479;&#35745;&#25512;&#26029;&#21644;&#21363;&#26102;&#20915;&#31574;&#12290;&#28982;&#32780;&#65292;&#24378;&#26377;&#21147;&#30340;&#20445;&#35777;&#20165;&#36866;&#29992;&#20110;&#22312;&#23454;&#36341;&#20013;&#20302;&#20272;&#25110;&#27987;&#24230;&#30028;&#38480;&#20026;&#22522;&#30784;&#30340;&#39034;&#24207;&#24207;&#21015;&#65292;&#32780;&#36825;&#20123;&#24207;&#21015;&#20855;&#26377;&#27425;&#20248;&#30340;&#25298;&#32477;&#26102;&#38388;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#32771;&#34385;&#32599;&#23486;&#26031;&#65288;Robbins&#65289;1970&#24180;&#30340;&#24310;&#36831;&#21551;&#21160;&#27491;&#24577;&#28151;&#21512;&#39034;&#24207;&#27010;&#29575;&#27604;&#26816;&#39564;&#65292;&#24182;&#22312;&#19968;&#33324;&#38750;&#21442;&#25968;&#25968;&#25454;&#29983;&#25104;&#36807;&#31243;&#19979;&#25552;&#20379;&#20102;&#39318;&#20010;&#28176;&#36817;&#31867;&#22411;I&#38169;&#35823;&#21644;&#26399;&#26395;&#25298;&#32477;&#26102;&#38388;&#20445;&#35777;&#65292;&#20854;&#20013;&#28176;&#36817;&#24615;&#36136;&#30001;&#27979;&#35797;&#30340;&#28903;&#20837;&#26102;&#38388;&#30830;&#23450;&#12290;&#31867;&#22411;I&#38169;&#35823;&#30340;&#32467;&#26524;&#20027;&#35201;&#20381;&#36182;&#20110;&#38789;&#24378;&#19981;&#21464;&#21407;&#29702;&#65292;&#24182;&#35777;&#26126;&#36825;&#20123;&#26816;&#39564;&#65288;&#21450;&#20854;&#38544;&#21547;&#30340;&#32622;&#20449;&#21306;&#38388;&#65289;&#20855;&#26377;&#25509;&#36817;&#25152;&#38656;&#945;&#27700;&#24179;&#30340;&#31867;&#22411;I&#38169;&#35823;&#29575;&#12290;&#26399;&#26395;&#25298;&#32477;&#26102;&#38388;&#30340;&#32467;&#26524;&#20027;&#35201;&#21033;&#29992;&#20102;&#19968;&#31181;&#21463;&#20234;&#34276;&#24341;&#29702;&#21551;&#21457;&#30340;&#24658;&#31561;&#24335;&#12290;
&lt;/p&gt;
&lt;p&gt;
Sequential tests and their implied confidence sequences, which are valid at arbitrary stopping times, promise flexible statistical inference and on-the-fly decision making. However, strong guarantees are limited to parametric sequential tests that under-cover in practice or concentration-bound-based sequences that over-cover and have suboptimal rejection times. In this work, we consider \cite{robbins1970boundary}'s delayed-start normal-mixture sequential probability ratio tests, and we provide the first asymptotic type-I-error and expected-rejection-time guarantees under general non-parametric data generating processes, where the asymptotics are indexed by the test's burn-in time. The type-I-error results primarily leverage a martingale strong invariance principle and establish that these tests (and their implied confidence sequences) have type-I error rates approaching a desired $\alpha$-level. The expected-rejection-time results primarily leverage an identity inspired by It\^o's lemm
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#28789;&#27963;&#30340;&#20840;&#29699;&#39044;&#27979;&#32452;&#21512;&#26694;&#26550;&#65292;&#33021;&#22815;&#22312;&#32771;&#34385;&#20219;&#21153;&#30456;&#20851;&#24615;&#30340;&#22522;&#30784;&#19978;&#32858;&#21512;&#22810;&#20010;&#19987;&#23478;&#25110;&#27169;&#22411;&#30340;&#39044;&#27979;&#12290;&#36890;&#36807;&#21512;&#25104;&#21644;&#30495;&#23454;&#25968;&#25454;&#30340;&#27604;&#36739;&#65292;&#35777;&#26126;&#20102;&#36825;&#20123;&#20840;&#29699;&#39044;&#27979;&#32452;&#21512;&#30340;&#26377;&#25928;&#24615;&#12290;</title><link>http://arxiv.org/abs/2207.07318</link><description>&lt;p&gt;
&#28789;&#27963;&#30340;&#20840;&#29699;&#39044;&#27979;&#32452;&#21512;
&lt;/p&gt;
&lt;p&gt;
Flexible global forecast combinations. (arXiv:2207.07318v2 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2207.07318
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#28789;&#27963;&#30340;&#20840;&#29699;&#39044;&#27979;&#32452;&#21512;&#26694;&#26550;&#65292;&#33021;&#22815;&#22312;&#32771;&#34385;&#20219;&#21153;&#30456;&#20851;&#24615;&#30340;&#22522;&#30784;&#19978;&#32858;&#21512;&#22810;&#20010;&#19987;&#23478;&#25110;&#27169;&#22411;&#30340;&#39044;&#27979;&#12290;&#36890;&#36807;&#21512;&#25104;&#21644;&#30495;&#23454;&#25968;&#25454;&#30340;&#27604;&#36739;&#65292;&#35777;&#26126;&#20102;&#36825;&#20123;&#20840;&#29699;&#39044;&#27979;&#32452;&#21512;&#30340;&#26377;&#25928;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#39044;&#27979;&#32452;&#21512;&#8212;&#8212;&#23558;&#22810;&#20010;&#19987;&#23478;&#25110;&#27169;&#22411;&#30340;&#20010;&#21035;&#39044;&#27979;&#32858;&#21512;&#36215;&#26469;&#8212;&#8212;&#26159;&#19968;&#31181;&#32463;&#36807;&#39564;&#35777;&#30340;&#32463;&#27982;&#39044;&#27979;&#26041;&#27861;&#12290;&#36804;&#20170;&#20026;&#27490;&#65292;&#32463;&#27982;&#39044;&#27979;&#30740;&#31350;&#38598;&#20013;&#22312;&#23616;&#37096;&#32452;&#21512;&#26041;&#27861;&#19978;&#65292;&#36825;&#20123;&#26041;&#27861;&#22788;&#29702;&#21333;&#29420;&#20294;&#30456;&#20851;&#30340;&#39044;&#27979;&#20219;&#21153;&#12290;&#28982;&#32780;&#65292;&#26426;&#22120;&#23398;&#20064;&#31038;&#21306;&#26089;&#22312;20&#22810;&#24180;&#21069;&#23601;&#24050;&#32463;&#30693;&#36947;&#65292;&#21033;&#29992;&#20219;&#21153;&#30456;&#20851;&#24615;&#30340;&#20840;&#23616;&#26041;&#27861;&#21487;&#20197;&#25913;&#21892;&#24573;&#30053;&#30456;&#20851;&#24615;&#30340;&#23616;&#37096;&#26041;&#27861;&#12290;&#21463;&#21040;&#25913;&#36827;&#21487;&#33021;&#24615;&#30340;&#21551;&#21457;&#65292;&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#20010;&#28789;&#27963;&#30340;&#26694;&#26550;&#65292;&#29992;&#20110;&#22312;&#32771;&#34385;&#20219;&#21153;&#30456;&#20851;&#24615;&#30340;&#22522;&#30784;&#19978;&#20840;&#23616;&#32452;&#21512;&#39044;&#27979;&#12290;&#36890;&#36807;&#25105;&#20204;&#30340;&#26694;&#26550;&#65292;&#25105;&#20204;&#24320;&#21457;&#20102;&#20960;&#31181;&#29616;&#26377;&#39044;&#27979;&#32452;&#21512;&#30340;&#20840;&#23616;&#29256;&#26412;&#12290;&#20026;&#20102;&#35780;&#20272;&#36825;&#20123;&#26032;&#30340;&#20840;&#29699;&#39044;&#27979;&#32452;&#21512;&#30340;&#21151;&#25928;&#65292;&#25105;&#20204;&#20351;&#29992;&#21512;&#25104;&#21644;&#30495;&#23454;&#25968;&#25454;&#36827;&#34892;&#20102;&#24191;&#27867;&#30340;&#27604;&#36739;&#12290;&#25105;&#20204;&#30340;&#30495;&#23454;&#25968;&#25454;&#27604;&#36739;&#28041;&#21450;&#21040;&#27431;&#20803;&#21306;&#26680;&#24515;&#32463;&#27982;&#25351;&#26631;&#30340;&#39044;&#27979;&#65292;&#25552;&#20379;&#20102;&#32463;&#39564;&#35777;&#25454;&#35777;&#26126;&#36825;&#20123;&#20840;&#29699;&#39044;&#27979;&#32452;&#21512;&#30340;&#26377;&#25928;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Forecast combination -- the aggregation of individual forecasts from multiple experts or models -- is a proven approach to economic forecasting. To date, research on economic forecasting has concentrated on local combination methods, which handle separate but related forecasting tasks in isolation. Yet, it has been known for over two decades in the machine learning community that global methods, which exploit task-relatedness, can improve on local methods that ignore it. Motivated by the possibility for improvement, this paper introduces a framework for globally combining forecasts while being flexible to the level of task-relatedness. Through our framework, we develop global versions of several existing forecast combinations. To evaluate the efficacy of these new global forecast combinations, we conduct extensive comparisons using synthetic and real data. Our real data comparisons, which involve forecasts of core economic indicators in the Eurozone, provide empirical evidence that the
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#36890;&#36807;&#35774;&#35745;&#23454;&#39564;&#21644;&#27979;&#35797;&#21457;&#29616;&#65292;&#22312;&#19968;&#20010;&#20915;&#31574;&#38382;&#39064;&#20013;&#65292;&#26377;40-43%&#30340;&#20154;&#37319;&#29992;&#29421;&#20041;&#20998;&#32452;&#26041;&#24335;&#36827;&#34892;&#36873;&#25321;&#65292;&#32780;0-15%&#30340;&#20154;&#37319;&#29992;&#24191;&#20041;&#20998;&#32452;&#26041;&#24335;&#12290;&#26681;&#25454;&#39044;&#27979;&#31934;&#24230;&#35843;&#25972;&#21518;&#65292;74%&#30340;&#21463;&#35797;&#32773;&#26368;&#36866;&#21512;&#29992;&#29421;&#20041;&#20998;&#32452;&#26469;&#25551;&#36848;&#65292;13%&#36866;&#21512;&#29992;&#24191;&#20041;&#20998;&#32452;&#26469;&#25551;&#36848;&#65292;6%&#36866;&#21512;&#29992;&#20013;&#38388;&#24773;&#20917;&#26469;&#25551;&#36848;&#12290;</title><link>http://arxiv.org/abs/2006.14869</link><description>&lt;p&gt;
&#25581;&#31034;&#36873;&#25321;&#20998;&#32452;
&lt;/p&gt;
&lt;p&gt;
Revealing Choice Bracketing. (arXiv:2006.14869v3 [econ.TH] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2006.14869
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#36890;&#36807;&#35774;&#35745;&#23454;&#39564;&#21644;&#27979;&#35797;&#21457;&#29616;&#65292;&#22312;&#19968;&#20010;&#20915;&#31574;&#38382;&#39064;&#20013;&#65292;&#26377;40-43%&#30340;&#20154;&#37319;&#29992;&#29421;&#20041;&#20998;&#32452;&#26041;&#24335;&#36827;&#34892;&#36873;&#25321;&#65292;&#32780;0-15%&#30340;&#20154;&#37319;&#29992;&#24191;&#20041;&#20998;&#32452;&#26041;&#24335;&#12290;&#26681;&#25454;&#39044;&#27979;&#31934;&#24230;&#35843;&#25972;&#21518;&#65292;74%&#30340;&#21463;&#35797;&#32773;&#26368;&#36866;&#21512;&#29992;&#29421;&#20041;&#20998;&#32452;&#26469;&#25551;&#36848;&#65292;13%&#36866;&#21512;&#29992;&#24191;&#20041;&#20998;&#32452;&#26469;&#25551;&#36848;&#65292;6%&#36866;&#21512;&#29992;&#20013;&#38388;&#24773;&#20917;&#26469;&#25551;&#36848;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#19968;&#20010;&#30001;&#22810;&#20010;&#36873;&#25321;&#32452;&#25104;&#30340;&#20915;&#31574;&#38382;&#39064;&#20013;&#65292;&#19968;&#20010;&#20154;&#21487;&#33021;&#27809;&#26377;&#32771;&#34385;&#21040;&#20182;&#20204;&#36873;&#25321;&#20043;&#38388;&#30340;&#30456;&#20114;&#20381;&#36182;&#20851;&#31995;&#12290;&#20026;&#20102;&#20102;&#35299;&#20154;&#20204;&#22312;&#36825;&#31181;&#38382;&#39064;&#20013;&#20570;&#20986;&#20915;&#31574;&#30340;&#26041;&#24335;&#65292;&#25105;&#20204;&#35774;&#35745;&#20102;&#19968;&#39033;&#26032;&#39062;&#30340;&#23454;&#39564;&#35777;&#26126;&#21644;&#25581;&#31034;&#20559;&#22909;&#27979;&#35797;&#65292;&#26469;&#30830;&#23450;&#27599;&#20010;&#21463;&#35797;&#32773;&#22914;&#20309;&#23545;&#20182;&#20204;&#30340;&#36873;&#25321;&#36827;&#34892;&#20998;&#32452;&#12290;&#22312;&#29420;&#31435;&#30340;&#39118;&#38505;&#19979;&#30340;&#25237;&#36164;&#32452;&#21512;&#20998;&#37197;&#12289;&#31038;&#20250;&#20998;&#37197;&#21644;&#24341;&#23548;&#20215;&#20540;&#20989;&#25968;&#36141;&#29289;&#23454;&#39564;&#20013;&#65292;&#25105;&#20204;&#21457;&#29616;&#25105;&#20204;&#30340;&#21463;&#35797;&#32773;&#20013;&#26377;40-43%&#19982;&#29421;&#20041;&#20998;&#32452;&#19968;&#33268;&#65292;0-15%&#19982;&#24191;&#20041;&#20998;&#32452;&#19968;&#33268;&#12290;&#26681;&#25454;&#27599;&#20010;&#27169;&#22411;&#30340;&#39044;&#27979;&#31934;&#24230;&#36827;&#34892;&#35843;&#25972;&#65292;74%&#30340;&#21463;&#35797;&#32773;&#26368;&#22909;&#29992;&#29421;&#20041;&#20998;&#32452;&#26469;&#25551;&#36848;&#65292;13%&#29992;&#24191;&#20041;&#20998;&#32452;&#26469;&#25551;&#36848;&#65292;6%&#29992;&#20013;&#38388;&#24773;&#20917;&#26469;&#25551;&#36848;&#12290;
&lt;/p&gt;
&lt;p&gt;
In a decision problem comprised of multiple choices, a person may fail to take into account the interdependencies between their choices. To understand how people make decisions in such problems, we design a novel experiment and revealed preference tests that determine how each subject brackets their choices. In separate portfolio allocation under risk, social allocation, and induced-value function shopping experiments, we find that 40-43% of our subjects are consistent with narrow bracketing while 0-15% are consistent with broad bracketing. Adjusting for each model's predictive precision, 74% of subjects are best described by narrow bracketing, 13% by broad bracketing, and 6% by intermediate cases.
&lt;/p&gt;</description></item></channel></rss>