<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#26412;&#25991;&#37325;&#26032;&#23457;&#35270;&#20102;&#20351;&#29992;&#21453;&#24212;&#26102;&#38388;&#26469;&#25512;&#26029;&#38382;&#39064;&#22797;&#26434;&#24615;&#30340;&#26377;&#25928;&#24615;&#65292;&#25552;&#20986;&#20102;&#19968;&#20010;&#26032;&#26041;&#27861;&#26469;&#27491;&#30830;&#25512;&#26029;&#38382;&#39064;&#30340;&#22797;&#26434;&#24615;&#65292;&#24378;&#35843;&#20102;&#22312;&#31616;&#21333;&#21644;&#22797;&#26434;&#38382;&#39064;&#20013;&#20915;&#31574;&#36895;&#24230;&#37117;&#24456;&#24555;&#30340;&#29305;&#28857;&#65292;&#24182;&#25506;&#35752;&#20102;&#21453;&#24212;&#26102;&#38388;&#19982;&#33021;&#21147;&#20043;&#38388;&#30340;&#38750;&#21333;&#35843;&#20851;&#31995;&#12290;</title><link>https://arxiv.org/abs/2403.11240</link><description>&lt;p&gt;
&#36895;&#24230;&#12289;&#20934;&#30830;&#24615;&#21644;&#22797;&#26434;&#24615;
&lt;/p&gt;
&lt;p&gt;
Speed, Accuracy, and Complexity
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.11240
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#37325;&#26032;&#23457;&#35270;&#20102;&#20351;&#29992;&#21453;&#24212;&#26102;&#38388;&#26469;&#25512;&#26029;&#38382;&#39064;&#22797;&#26434;&#24615;&#30340;&#26377;&#25928;&#24615;&#65292;&#25552;&#20986;&#20102;&#19968;&#20010;&#26032;&#26041;&#27861;&#26469;&#27491;&#30830;&#25512;&#26029;&#38382;&#39064;&#30340;&#22797;&#26434;&#24615;&#65292;&#24378;&#35843;&#20102;&#22312;&#31616;&#21333;&#21644;&#22797;&#26434;&#38382;&#39064;&#20013;&#20915;&#31574;&#36895;&#24230;&#37117;&#24456;&#24555;&#30340;&#29305;&#28857;&#65292;&#24182;&#25506;&#35752;&#20102;&#21453;&#24212;&#26102;&#38388;&#19982;&#33021;&#21147;&#20043;&#38388;&#30340;&#38750;&#21333;&#35843;&#20851;&#31995;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#37325;&#26032;&#23457;&#35270;&#20102;&#20351;&#29992;&#21453;&#24212;&#26102;&#38388;&#26469;&#25512;&#26029;&#38382;&#39064;&#22797;&#26434;&#24615;&#30340;&#26377;&#25928;&#24615;&#12290;&#37325;&#26032;&#23457;&#35270;&#20102;&#19968;&#20010;&#32463;&#20856;&#30340;Wald&#27169;&#22411;&#65292;&#23558;&#20449;&#22122;&#27604;&#20316;&#20026;&#38382;&#39064;&#22797;&#26434;&#24615;&#30340;&#24230;&#37327;&#12290;&#34429;&#28982;&#22312;&#38382;&#39064;&#22797;&#26434;&#24615;&#19978;&#65292;&#36873;&#25321;&#36136;&#37327;&#26159;&#21333;&#35843;&#30340;&#65292;&#20294;&#26399;&#26395;&#30340;&#20572;&#27490;&#26102;&#38388;&#26159;&#20498;U&#24418;&#30340;&#12290;&#20107;&#23454;&#19978;&#65292;&#20915;&#31574;&#22312;&#38750;&#24120;&#31616;&#21333;&#21644;&#38750;&#24120;&#22797;&#26434;&#30340;&#38382;&#39064;&#20013;&#37117;&#24456;&#24555;&#65306;&#22312;&#31616;&#21333;&#38382;&#39064;&#20013;&#24456;&#24555;&#23601;&#33021;&#29702;&#35299;&#21738;&#20010;&#36873;&#25321;&#26159;&#26368;&#22909;&#30340;&#65292;&#32780;&#22312;&#22797;&#26434;&#38382;&#39064;&#20013;&#23558;&#20250;&#25104;&#26412;&#36807;&#39640;--&#36825;&#19968;&#27934;&#23519;&#21147;&#20063;&#36866;&#29992;&#20110;&#19968;&#33324;&#30340;&#26114;&#36149;&#20449;&#24687;&#33719;&#21462;&#27169;&#22411;&#12290;&#36825;&#31181;&#38750;&#21333;&#35843;&#24615;&#20063;&#26500;&#25104;&#20102;&#21453;&#24212;&#26102;&#38388;&#19982;&#33021;&#21147;&#20043;&#38388;&#27169;&#31946;&#20851;&#31995;&#30340;&#22522;&#30784;&#65292;&#21363;&#26356;&#39640;&#30340;&#33021;&#21147;&#24847;&#21619;&#30528;&#22312;&#38750;&#24120;&#22797;&#26434;&#30340;&#38382;&#39064;&#20013;&#20915;&#31574;&#26356;&#24930;&#65292;&#20294;&#22312;&#31616;&#21333;&#38382;&#39064;&#20013;&#20915;&#31574;&#26356;&#24555;&#12290;&#26368;&#21518;&#65292;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#26041;&#27861;&#65292;&#26681;&#25454;&#36873;&#25321;&#23545;&#28608;&#21169;&#21464;&#21270;&#30340;&#21453;&#24212;&#26356;&#22810;&#26469;&#27491;&#30830;&#25512;&#26029;&#38382;&#39064;&#30340;&#22797;&#26434;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.11240v1 Announce Type: new  Abstract: This paper re-examines the validity of using response time to infer problem complexity. It revisits a canonical Wald model of optimal stopping, taking signal-to-noise ratio as a measure of problem complexity. While choice quality is monotone in problem complexity, expected stopping time is inverse $U$-shaped. Indeed decisions are fast in both very simple and very complex problems: in simple problems it is quick to understand which alternative is best, while in complex problems it would be too costly -- an insight which extends to general costly information acquisition models. This non-monotonicity also underlies an ambiguous relationship between response time and ability, whereby higher ability entails slower decisions in very complex problems, but faster decisions in simple problems. Finally, this paper proposes a new method to correctly infer problem complexity based on the finding that choices react more to changes in incentives in mo
&lt;/p&gt;</description></item><item><title>&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#38750;&#21442;&#25968;&#29305;&#24449;&#26041;&#27861;&#65292;&#26500;&#24314;&#20102;&#19968;&#20010;&#30697;&#38453;&#26469;&#25581;&#31034;&#38543;&#26426;&#25928;&#29992;&#27169;&#22411;&#20013;&#30340;&#20559;&#22909;&#20851;&#31995;&#32467;&#26500;&#65292;&#25552;&#20379;&#20102;&#20851;&#20110;&#24490;&#29615;&#36873;&#25321;&#27010;&#29575;&#21644;&#26368;&#22823;&#29702;&#24615;&#36873;&#25321;&#27169;&#24335;&#26435;&#37325;&#30340;&#20449;&#24687;&#12290;</title><link>https://arxiv.org/abs/2403.04328</link><description>&lt;p&gt;
&#38543;&#26426;&#25928;&#29992;&#27169;&#22411;&#30340;&#38750;&#21442;&#25968;&#29305;&#24449;&#30340;&#21452;&#37325;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
A dual approach to nonparametric characterization for random utility models
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.04328
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#38750;&#21442;&#25968;&#29305;&#24449;&#26041;&#27861;&#65292;&#26500;&#24314;&#20102;&#19968;&#20010;&#30697;&#38453;&#26469;&#25581;&#31034;&#38543;&#26426;&#25928;&#29992;&#27169;&#22411;&#20013;&#30340;&#20559;&#22909;&#20851;&#31995;&#32467;&#26500;&#65292;&#25552;&#20379;&#20102;&#20851;&#20110;&#24490;&#29615;&#36873;&#25321;&#27010;&#29575;&#21644;&#26368;&#22823;&#29702;&#24615;&#36873;&#25321;&#27169;&#24335;&#26435;&#37325;&#30340;&#20449;&#24687;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#38543;&#26426;&#25928;&#29992;&#27169;&#22411;&#65288;RUM&#65289;&#29305;&#24449;&#65292;&#36825;&#31181;&#29305;&#24449;&#20107;&#23454;&#19978;&#26159;&#23545;Kitamura&#21644;Stoye&#65288;2018&#65292;ECMA&#65289;&#30340;&#29305;&#24449;&#30340;&#23545;&#20598;&#34920;&#31034;&#12290;&#23545;&#20110;&#32473;&#23450;&#30340;&#39044;&#31639;&#23478;&#24237;&#21450;&#20854;&#8220;&#34917;&#19969;&#8221;&#34920;&#31034;&#65292;&#25105;&#20204;&#26500;&#24314;&#19968;&#20010;&#30697;&#38453;&#926;&#65292;&#20854;&#20013;&#27599;&#20010;&#34892;&#21521;&#37327;&#34920;&#26126;&#27599;&#20010;&#39044;&#31639;&#23376;&#23478;&#24237;&#20013;&#21487;&#33021;&#30340;&#26174;&#24335;&#20559;&#22909;&#20851;&#31995;&#30340;&#32467;&#26500;&#12290;&#28982;&#21518;&#65292;&#35777;&#26126;&#20102;&#22312;&#39044;&#31639;&#32447;&#30340;&#8220;&#34917;&#19969;&#8221;&#19978;&#30340;&#38543;&#26426;&#38656;&#27714;&#31995;&#32479;&#65292;&#35760;&#20026;&#960;&#65292;&#19982;RUM&#19968;&#33268;&#24403;&#19988;&#20165;&#24403;&#926;&#960;&#8805;1&#12290;&#38500;&#20102;&#25552;&#20379;&#31616;&#27905;&#30340;&#23553;&#38381;&#24418;&#24335;&#29305;&#24449;&#20043;&#22806;&#65292;&#29305;&#21035;&#26159;&#24403;&#960;&#19982;RUM&#19981;&#19968;&#33268;&#26102;&#65292;&#21521;&#37327;&#926;&#960;&#36824;&#21253;&#21547;&#20851;&#20110;&#65288;1&#65289;&#24517;&#39035;&#20197;&#27491;&#27010;&#29575;&#21457;&#29983;&#24490;&#29615;&#36873;&#25321;&#30340;&#39044;&#31639;&#23376;&#23478;&#24237;&#65292;&#20197;&#21450;&#65288;2&#65289;&#20154;&#21475;&#20013;&#29702;&#24615;&#36873;&#25321;&#27169;&#24335;&#30340;&#26368;&#22823;&#21487;&#33021;&#26435;&#37325;&#30340;&#20449;&#24687;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.04328v1 Announce Type: new  Abstract: This paper develops a novel characterization for random utility models (RUM), which turns out to be a dual representation of the characterization by Kitamura and Stoye (2018, ECMA). For a given family of budgets and its "patch" representation \'a la Kitamura and Stoye, we construct a matrix $\Xi$ of which each row vector indicates the structure of possible revealed preference relations in each subfamily of budgets. Then, it is shown that a stochastic demand system on the patches of budget lines, say $\pi$, is consistent with a RUM, if and only if $\Xi\pi \geq \mathbb{1}$. In addition to providing a concise closed form characterization, especially when $\pi$ is inconsistent with RUMs, the vector $\Xi\pi$ also contains information concerning (1) sub-families of budgets in which cyclical choices must occur with positive probabilities, and (2) the maximal possible weights on rational choice patterns in a population. The notion of Chv\'atal r
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#20110;&#39640;&#32500;&#21327;&#21464;&#37327;&#30340;&#38750;&#32447;&#24615;&#20869;&#29983;&#22788;&#29702;&#25928;&#24212;&#30340;&#19968;&#33268;&#25512;&#26029;&#26041;&#27861;&#65292;&#20027;&#35201;&#21019;&#26032;&#26159;&#22312;&#39640;&#32500;&#24230;&#19979;&#23545;&#38750;&#21442;&#25968;&#24037;&#20855;&#21464;&#37327;&#27169;&#22411;&#36827;&#34892;&#21452;&#20559;&#24046;&#26657;&#27491;&#65292;&#24182;&#25552;&#20379;&#20102;&#36793;&#38469;&#25928;&#24212;&#20989;&#25968;&#30340;&#22343;&#21248;&#32622;&#20449;&#24102;&#12290;</title><link>http://arxiv.org/abs/2310.08063</link><description>&lt;p&gt;
&#24102;&#26377;&#39640;&#32500;&#21327;&#21464;&#37327;&#30340;&#38750;&#32447;&#24615;&#20869;&#29983;&#22788;&#29702;&#25928;&#24212;&#30340;&#19968;&#33268;&#25512;&#26029;
&lt;/p&gt;
&lt;p&gt;
Uniform Inference for Nonlinear Endogenous Treatment Effects with High-Dimensional Covariates. (arXiv:2310.08063v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.08063
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#20110;&#39640;&#32500;&#21327;&#21464;&#37327;&#30340;&#38750;&#32447;&#24615;&#20869;&#29983;&#22788;&#29702;&#25928;&#24212;&#30340;&#19968;&#33268;&#25512;&#26029;&#26041;&#27861;&#65292;&#20027;&#35201;&#21019;&#26032;&#26159;&#22312;&#39640;&#32500;&#24230;&#19979;&#23545;&#38750;&#21442;&#25968;&#24037;&#20855;&#21464;&#37327;&#27169;&#22411;&#36827;&#34892;&#21452;&#20559;&#24046;&#26657;&#27491;&#65292;&#24182;&#25552;&#20379;&#20102;&#36793;&#38469;&#25928;&#24212;&#20989;&#25968;&#30340;&#22343;&#21248;&#32622;&#20449;&#24102;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38750;&#32447;&#24615;&#21644;&#20869;&#29983;&#24615;&#22312;&#35266;&#27979;&#25968;&#25454;&#30340;&#22240;&#26524;&#25928;&#24212;&#30740;&#31350;&#20013;&#24456;&#24120;&#35265;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#20272;&#35745;&#21644;&#25512;&#26029;&#26041;&#27861;&#65292;&#29992;&#20110;&#20855;&#26377;&#20869;&#29983;&#24615;&#21644;&#28508;&#22312;&#39640;&#32500;&#21327;&#21464;&#37327;&#30340;&#38750;&#21442;&#25968;&#22788;&#29702;&#25928;&#24212;&#20989;&#25968;&#12290;&#26412;&#25991;&#30340;&#20027;&#35201;&#21019;&#26032;&#26159;&#22312;&#39640;&#32500;&#24230;&#19979;&#23545;&#38750;&#21442;&#25968;&#24037;&#20855;&#21464;&#37327;&#65288;NPIV&#65289;&#27169;&#22411;&#36827;&#34892;&#21452;&#20559;&#24046;&#26657;&#27491;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#19968;&#20010;&#26377;&#29992;&#30340;&#36793;&#38469;&#25928;&#24212;&#20989;&#25968;&#22343;&#21248;&#32622;&#20449;&#24102;&#65292;&#20854;&#23450;&#20041;&#20026;&#38750;&#21442;&#25968;&#22788;&#29702;&#20989;&#25968;&#30340;&#23548;&#25968;&#12290;&#29702;&#35770;&#19978;&#39564;&#35777;&#20102;&#32622;&#20449;&#24102;&#30340;&#28176;&#36817;&#35802;&#23454;&#24615;&#12290;&#36890;&#36807;&#27169;&#25311;&#21644;&#23545;&#31354;&#27668;&#27745;&#26579;&#21644;&#36801;&#31227;&#30340;&#23454;&#35777;&#30740;&#31350;&#65292;&#35777;&#26126;&#20102;&#25105;&#20204;&#30340;&#26041;&#27861;&#30340;&#26377;&#25928;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Nonlinearity and endogeneity are common in causal effect studies with observational data. In this paper, we propose new estimation and inference procedures for nonparametric treatment effect functions with endogeneity and potentially high-dimensional covariates. The main innovation of this paper is the double bias correction procedure for the nonparametric instrumental variable (NPIV) model under high dimensions. We provide a useful uniform confidence band of the marginal effect function, defined as the derivative of the nonparametric treatment function. The asymptotic honesty of the confidence band is verified in theory. Simulations and an empirical study of air pollution and migration demonstrate the validity of our procedures.
&lt;/p&gt;</description></item><item><title>&#30740;&#31350;&#25506;&#35752;&#20102;&#20195;&#29702;&#20154;&#36890;&#36807;&#21305;&#37197;&#26426;&#21046;&#33719;&#24471;&#23545;&#35937;&#30340;&#20559;&#22909;&#26159;&#21542;&#21463;&#21040;&#20854;&#22312;&#25490;&#21517;&#21015;&#34920;&#20013;&#25490;&#21517;&#30340;&#24433;&#21709;&#65292;&#32467;&#26524;&#21457;&#29616;&#26356;&#39640;&#30340;&#25490;&#21517;&#21487;&#20197;&#24102;&#26469;&#26356;&#22823;&#30340;&#25928;&#29992;&#12290;&#30740;&#31350;&#21457;&#29616;&#30495;&#23454;&#20559;&#22909;&#20132;&#25442;&#26426;&#21046;&#21487;&#33021;&#19981;&#26159;&#19968;&#31181;&#21344;&#20248;&#31574;&#30053;&#65292;&#19988;&#33021;&#22815;&#25552;&#20379;&#32473;&#26356;&#22810;&#30340;&#20195;&#29702;&#20154;&#25253;&#21578;&#20026;&#26356;&#39640;&#25490;&#21517;&#30340;&#23545;&#35937;&#30340;&#38750;&#21344;&#20248;&#26426;&#21046;&#21487;&#33021;&#20250;&#22686;&#21152;&#24066;&#22330;&#31119;&#21033;&#12290;</title><link>http://arxiv.org/abs/2305.03644</link><description>&lt;p&gt;
&#25490;&#24207;&#20381;&#36182;&#20559;&#22909;&#65306;&#19968;&#39033;&#30495;&#23454;&#36135;&#29289;&#21305;&#37197;&#23454;&#39564;
&lt;/p&gt;
&lt;p&gt;
Rankings-Dependent Preferences: A Real Goods Matching Experiment. (arXiv:2305.03644v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.03644
&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#25506;&#35752;&#20102;&#20195;&#29702;&#20154;&#36890;&#36807;&#21305;&#37197;&#26426;&#21046;&#33719;&#24471;&#23545;&#35937;&#30340;&#20559;&#22909;&#26159;&#21542;&#21463;&#21040;&#20854;&#22312;&#25490;&#21517;&#21015;&#34920;&#20013;&#25490;&#21517;&#30340;&#24433;&#21709;&#65292;&#32467;&#26524;&#21457;&#29616;&#26356;&#39640;&#30340;&#25490;&#21517;&#21487;&#20197;&#24102;&#26469;&#26356;&#22823;&#30340;&#25928;&#29992;&#12290;&#30740;&#31350;&#21457;&#29616;&#30495;&#23454;&#20559;&#22909;&#20132;&#25442;&#26426;&#21046;&#21487;&#33021;&#19981;&#26159;&#19968;&#31181;&#21344;&#20248;&#31574;&#30053;&#65292;&#19988;&#33021;&#22815;&#25552;&#20379;&#32473;&#26356;&#22810;&#30340;&#20195;&#29702;&#20154;&#25253;&#21578;&#20026;&#26356;&#39640;&#25490;&#21517;&#30340;&#23545;&#35937;&#30340;&#38750;&#21344;&#20248;&#26426;&#21046;&#21487;&#33021;&#20250;&#22686;&#21152;&#24066;&#22330;&#31119;&#21033;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25506;&#35752;&#36890;&#36807;&#21305;&#37197;&#26426;&#21046;&#33719;&#24471;&#23545;&#35937;&#30340;&#20559;&#22909;&#26159;&#21542;&#21463;&#21040;&#20195;&#29702;&#20154;&#22312;&#20854;&#25253;&#21578;&#30340;&#25490;&#21517;&#21015;&#34920;&#20013;&#23545;&#20854;&#25490;&#21517;&#30340;&#24433;&#21709;&#12290;&#25105;&#20204;&#20551;&#35774;&#20854;&#20182;&#26465;&#20214;&#30456;&#21516;&#65292;&#20195;&#29702;&#20154;&#23545;&#21516;&#19968;&#23545;&#35937;&#22312;&#20854;&#25490;&#21517;&#26356;&#39640;&#26102;&#20250;&#33719;&#24471;&#26356;&#22823;&#30340;&#25928;&#29992;&#12290;&#25490;&#24207;&#20381;&#36182;&#30340;&#25928;&#29992;&#30340;&#24341;&#20837;&#24847;&#21619;&#30528;&#21521;&#30495;&#23454;&#20559;&#22909;&#20132;&#25442;&#26426;&#21046;&#25552;&#20132;&#30495;&#23454;&#20559;&#22909;&#21487;&#33021;&#19981;&#26159;&#19968;&#31181;&#21344;&#20248;&#31574;&#30053;&#65292;&#24182;&#19988;&#33021;&#22815;&#25552;&#20379;&#32473;&#26356;&#22810;&#30340;&#20195;&#29702;&#20154;&#25253;&#21578;&#20026;&#26356;&#39640;&#25490;&#21517;&#30340;&#23545;&#35937;&#30340;&#38750;&#21344;&#20248;&#26426;&#21046;&#21487;&#33021;&#20250;&#22686;&#21152;&#24066;&#22330;&#31119;&#21033;&#12290;&#25105;&#20204;&#36890;&#36807;&#22312;&#19968;&#20010;&#21344;&#20248;&#31574;&#30053;&#26426;&#21046;&#8212;&#8212;&#38543;&#26426;&#20018;&#34892;&#29420;&#35009;&#8212;&#8212;&#21644;&#19968;&#20010;&#38750;&#21344;&#20248;&#26426;&#21046;&#8212;&#8212;&#27874;&#22763;&#39039;&#26426;&#21046;&#20013;&#36827;&#34892;&#21305;&#37197;&#23454;&#39564;&#26469;&#27979;&#35797;&#36825;&#20123;&#20551;&#35774;&#12290;&#25105;&#20204;&#23454;&#39564;&#35774;&#35745;&#30340;&#19968;&#20010;&#26032;&#29305;&#28857;&#26159;&#22312;&#21305;&#37197;&#24066;&#22330;&#20998;&#37197;&#30340;&#23545;&#35937;&#26159;&#30495;&#23454;&#29289;&#21697;&#65292;&#36825;&#20351;&#25105;&#20204;&#33021;&#22815;&#36890;&#36807;&#24449;&#38598;&#20869;&#22806;&#26426;&#21046;&#20013;&#29289;&#21697;&#30340;&#20215;&#20540;&#26469;&#30452;&#25509;&#27979;&#37327;&#25490;&#24207;&#20381;&#36182;&#24615;&#12290;&#25105;&#20204;&#30340;&#23454;&#39564;&#32467;&#26524;&#35777;&#23454;&#20102;&#25105;&#20204;&#30340;&#20551;&#35774;&#12290;
&lt;/p&gt;
&lt;p&gt;
We investigate whether preferences for objects received via a matching mechanism are influenced by how highly agents rank them in their reported rank order list. We hypothesize that all else equal, agents receive greater utility for the same object when they rank it higher. The addition of rankings-dependent utility implies that it may not be a dominant strategy to submit truthful preferences to a strategyproof mechanism, and that non-strategyproof mechanisms that give more agents objects they report as higher ranked may increase market welfare. We test these hypotheses with a matching experiment in a strategyproof mechanism, the random serial dictatorship, and a non-strategyproof mechanism, the Boston mechanism. A novel feature of our experimental design is that the objects allocated in the matching markets are real goods, which allows us to directly measure rankings-dependence by eliciting values for goods both inside and outside of the mechanism. Our experimental results confirm tha
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#38024;&#23545;&#26657;&#20934;&#21442;&#25968;&#30340;&#20445;&#23432;&#26631;&#20934;&#35823;&#24046;&#21644;&#32622;&#20449;&#21306;&#38388;&#30340;&#26041;&#27861;&#65292;&#20351;&#29992;&#20165;&#20010;&#21035;&#32463;&#39564;&#30697;&#30340;&#26041;&#24046;&#36827;&#34892;&#20272;&#35745;&#65292;&#26377;&#25928;&#24212;&#23545;&#26368;&#22351;&#30340;&#30456;&#20851;&#32467;&#26500;&#24773;&#20917;&#12290;&#21516;&#26102;&#25552;&#20379;&#20102;&#36229;&#23450;&#25110;&#21442;&#25968;&#38480;&#21046;&#30340;&#26816;&#39564;&#26041;&#27861;&#65292;&#24182;&#22312;&#23454;&#35777;&#24212;&#29992;&#20013;&#23637;&#31034;&#20102;&#35813;&#26041;&#27861;&#30340;&#26377;&#25928;&#24615;&#12290;</title><link>http://arxiv.org/abs/2109.08109</link><description>&lt;p&gt;
&#26657;&#20934;&#21442;&#25968;&#30340;&#26631;&#20934;&#35823;&#24046;
&lt;/p&gt;
&lt;p&gt;
Standard Errors for Calibrated Parameters. (arXiv:2109.08109v2 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2109.08109
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#38024;&#23545;&#26657;&#20934;&#21442;&#25968;&#30340;&#20445;&#23432;&#26631;&#20934;&#35823;&#24046;&#21644;&#32622;&#20449;&#21306;&#38388;&#30340;&#26041;&#27861;&#65292;&#20351;&#29992;&#20165;&#20010;&#21035;&#32463;&#39564;&#30697;&#30340;&#26041;&#24046;&#36827;&#34892;&#20272;&#35745;&#65292;&#26377;&#25928;&#24212;&#23545;&#26368;&#22351;&#30340;&#30456;&#20851;&#32467;&#26500;&#24773;&#20917;&#12290;&#21516;&#26102;&#25552;&#20379;&#20102;&#36229;&#23450;&#25110;&#21442;&#25968;&#38480;&#21046;&#30340;&#26816;&#39564;&#26041;&#27861;&#65292;&#24182;&#22312;&#23454;&#35777;&#24212;&#29992;&#20013;&#23637;&#31034;&#20102;&#35813;&#26041;&#27861;&#30340;&#26377;&#25928;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26657;&#20934;&#26159;&#36873;&#25321;&#32467;&#26500;&#27169;&#22411;&#21442;&#25968;&#20197;&#21305;&#37197;&#26576;&#20123;&#32463;&#39564;&#30697;&#30340;&#23454;&#36341;&#65292;&#21487;&#20197;&#30475;&#20316;&#26159;&#26368;&#23567;&#36317;&#31163;&#20272;&#35745;&#12290;&#29616;&#26377;&#30340;&#36825;&#31867;&#20272;&#35745;&#37327;&#30340;&#26631;&#20934;&#35823;&#24046;&#20844;&#24335;&#35201;&#27714;&#23545;&#32463;&#39564;&#30697;&#30340;&#30456;&#20851;&#32467;&#26500;&#36827;&#34892;&#19968;&#33268;&#20272;&#35745;&#65292;&#20294;&#36825;&#22312;&#23454;&#36341;&#20013;&#36890;&#24120;&#19981;&#21487;&#24471;&#12290;&#30456;&#21453;&#65292;&#20010;&#21035;&#32463;&#39564;&#30697;&#30340;&#26041;&#24046;&#36890;&#24120;&#26159;&#21487;&#20197;&#20272;&#35745;&#30340;&#12290;&#25105;&#20204;&#20165;&#20351;&#29992;&#36825;&#20123;&#26041;&#24046;&#65292;&#20026;&#32467;&#26500;&#21442;&#25968;&#23548;&#20986;&#20445;&#23432;&#30340;&#26631;&#20934;&#35823;&#24046;&#21644;&#32622;&#20449;&#21306;&#38388;&#65292;&#21363;&#20351;&#22312;&#26368;&#22351;&#30340;&#30456;&#20851;&#32467;&#26500;&#19979;&#20063;&#26159;&#26377;&#25928;&#30340;&#12290;&#22312;&#36229;&#23450;&#24773;&#20917;&#19979;&#65292;&#25105;&#20204;&#35777;&#26126;&#20351;&#26368;&#22351;&#20272;&#35745;&#26041;&#24046;&#26368;&#23567;&#30340;&#30697;&#26435;&#37325;&#26041;&#26696;&#31561;&#21516;&#20110;&#19968;&#20010;&#31616;&#21333;&#35299;&#20915;&#26041;&#26696;&#30340;&#30697;&#36873;&#25321;&#38382;&#39064;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#24320;&#21457;&#20102;&#36229;&#23450;&#25110;&#21442;&#25968;&#38480;&#21046;&#30340;&#26816;&#39564;&#26041;&#27861;&#12290;&#25105;&#20204;&#22312;&#19968;&#20010;&#22810;&#20135;&#21697;&#20844;&#21496;&#30340;&#33756;&#21333;&#25104;&#26412;&#23450;&#20215;&#27169;&#22411;&#21644;&#19968;&#20010;&#24322;&#36136;&#20195;&#29702;&#26032;&#20975;&#24681;&#26031;&#27169;&#22411;&#19978;&#23454;&#35777;&#24212;&#29992;&#20102;&#25105;&#20204;&#30340;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
Calibration, the practice of choosing the parameters of a structural model to match certain empirical moments, can be viewed as minimum distance estimation. Existing standard error formulas for such estimators require a consistent estimate of the correlation structure of the empirical moments, which is often unavailable in practice. Instead, the variances of the individual empirical moments are usually readily estimable. Using only these variances, we derive conservative standard errors and confidence intervals for the structural parameters that are valid even under the worst-case correlation structure. In the over-identified case, we show that the moment weighting scheme that minimizes the worst-case estimator variance amounts to a moment selection problem with a simple solution. Finally, we develop tests of over-identifying or parameter restrictions. We apply our methods empirically to a model of menu cost pricing for multi-product firms and to a heterogeneous agent New Keynesian mod
&lt;/p&gt;</description></item></channel></rss>