<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#25552;&#20986;&#20102;&#22522;&#20110;&#26368;&#20248;&#36755;&#36816;&#30340;&#22810;&#20803;&#20998;&#20301;&#25968;&#22238;&#24402;&#27169;&#22411;&#65292;&#32771;&#34385;&#32467;&#26524;&#21464;&#37327;&#20013;&#26465;&#30446;&#20043;&#38388;&#30340;&#30456;&#20851;&#24615;&#65292;&#24182;&#25552;&#20379;&#20102;&#23616;&#37096;&#35782;&#21035;&#32467;&#26524;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;&#25152;&#38656;&#30340;&#20202;&#22120;&#21464;&#37327;&#65288;IV&#65289;&#30340;&#25903;&#25345;&#22823;&#23567;&#19982;&#32467;&#26524;&#21521;&#37327;&#30340;&#32500;&#24230;&#26080;&#20851;&#65292;&#21482;&#38656;IV&#36275;&#22815;&#20449;&#24687;&#37327;&#12290;</title><link>http://arxiv.org/abs/2401.11422</link><description>&lt;p&gt;
&#20202;&#22120;&#21464;&#37327;&#22810;&#20803;&#20998;&#20301;&#25968;&#22238;&#24402;&#27169;&#22411;&#20013;&#30340;&#23616;&#37096;&#35782;&#21035;
&lt;/p&gt;
&lt;p&gt;
Local Identification in the Instrumental Variable Multivariate Quantile Regression Model. (arXiv:2401.11422v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.11422
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#22522;&#20110;&#26368;&#20248;&#36755;&#36816;&#30340;&#22810;&#20803;&#20998;&#20301;&#25968;&#22238;&#24402;&#27169;&#22411;&#65292;&#32771;&#34385;&#32467;&#26524;&#21464;&#37327;&#20013;&#26465;&#30446;&#20043;&#38388;&#30340;&#30456;&#20851;&#24615;&#65292;&#24182;&#25552;&#20379;&#20102;&#23616;&#37096;&#35782;&#21035;&#32467;&#26524;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;&#25152;&#38656;&#30340;&#20202;&#22120;&#21464;&#37327;&#65288;IV&#65289;&#30340;&#25903;&#25345;&#22823;&#23567;&#19982;&#32467;&#26524;&#21521;&#37327;&#30340;&#32500;&#24230;&#26080;&#20851;&#65292;&#21482;&#38656;IV&#36275;&#22815;&#20449;&#24687;&#37327;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
Chernozhukov&#21644;Hansen&#65288;2005&#65289;&#24341;&#20837;&#30340;&#20202;&#22120;&#21464;&#37327;&#65288;IV&#65289;&#20998;&#20301;&#25968;&#22238;&#24402;&#27169;&#22411;&#26159;&#20998;&#26512;&#20869;&#29983;&#24615;&#24773;&#20917;&#19979;&#20998;&#20301;&#25968;&#22788;&#29702;&#25928;&#24212;&#30340;&#26377;&#29992;&#24037;&#20855;&#65292;&#20294;&#24403;&#32467;&#26524;&#21464;&#37327;&#26159;&#22810;&#32500;&#30340;&#26102;&#65292;&#23427;&#23545;&#27599;&#20010;&#21464;&#37327;&#19981;&#21516;&#32500;&#24230;&#30340;&#32852;&#21512;&#20998;&#24067;&#20445;&#25345;&#27785;&#40664;&#12290;&#20026;&#20102;&#20811;&#26381;&#36825;&#20010;&#38480;&#21046;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#22522;&#20110;&#26368;&#20248;&#36755;&#36816;&#30340;&#32771;&#34385;&#32467;&#26524;&#21464;&#37327;&#20013;&#26465;&#30446;&#20043;&#38388;&#30456;&#20851;&#24615;&#30340;&#22810;&#20803;&#20998;&#20301;&#25968;&#22238;&#24402;&#27169;&#22411;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#20026;&#27169;&#22411;&#25552;&#20379;&#20102;&#19968;&#20010;&#23616;&#37096;&#35782;&#21035;&#32467;&#26524;&#12290;&#20196;&#20154;&#24778;&#35766;&#30340;&#26159;&#65292;&#25105;&#20204;&#21457;&#29616;&#65292;&#25152;&#38656;&#30340;&#29992;&#20110;&#35782;&#21035;&#30340;IV&#30340;&#25903;&#25345;&#22823;&#23567;&#19982;&#32467;&#26524;&#21521;&#37327;&#30340;&#32500;&#24230;&#26080;&#20851;&#65292;&#21482;&#35201;IV&#36275;&#22815;&#20449;&#24687;&#37327;&#12290;&#25105;&#20204;&#30340;&#32467;&#26524;&#26469;&#33258;&#25105;&#20204;&#24314;&#31435;&#30340;&#19968;&#20010;&#20855;&#26377;&#29420;&#31435;&#29702;&#35770;&#24847;&#20041;&#30340;&#19968;&#33324;&#35782;&#21035;&#23450;&#29702;&#12290;
&lt;/p&gt;
&lt;p&gt;
The instrumental variable (IV) quantile regression model introduced by Chernozhukov and Hansen (2005) is a useful tool for analyzing quantile treatment effects in the presence of endogeneity, but when outcome variables are multidimensional, it is silent on the joint distribution of different dimensions of each variable. To overcome this limitation, we propose an IV model built on the optimal-transport-based multivariate quantile that takes into account the correlation between the entries of the outcome variable. We then provide a local identification result for the model. Surprisingly, we find that the support size of the IV required for the identification is independent of the dimension of the outcome vector, as long as the IV is sufficiently informative. Our result follows from a general identification theorem that we establish, which has independent theoretical significance.
&lt;/p&gt;</description></item><item><title>&#25552;&#20986;&#20102;&#26377;&#38480;&#30693;&#35782;&#19979;n&#20154;&#21338;&#24328;&#30340;&#26694;&#26550;&#65292;&#24341;&#20837;&#20102;&#8220;&#28216;&#25103;&#26234;&#33021;&#8221;&#26426;&#21046;&#21644;&#8220;&#38450;&#20316;&#24330;&#24615;&#8221;&#27010;&#24565;&#65292;GI&#26426;&#21046;&#21487;&#20197;&#23454;&#38469;&#35780;&#20272;&#29609;&#23478;&#30340;&#26234;&#33021;&#65292;&#24212;&#29992;&#24191;&#27867;&#12290;</title><link>http://arxiv.org/abs/2302.13937</link><description>&lt;p&gt;
&#26377;&#38480;&#30693;&#35782;&#19979;n&#20154;&#21338;&#24328;&#30340;&#20154;&#31867;&#19982;&#26426;&#22120;&#26234;&#33021;
&lt;/p&gt;
&lt;p&gt;
Human and Machine Intelligence in n-Person Games with Partial Knowledge. (arXiv:2302.13937v2 [econ.TH] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2302.13937
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#26377;&#38480;&#30693;&#35782;&#19979;n&#20154;&#21338;&#24328;&#30340;&#26694;&#26550;&#65292;&#24341;&#20837;&#20102;&#8220;&#28216;&#25103;&#26234;&#33021;&#8221;&#26426;&#21046;&#21644;&#8220;&#38450;&#20316;&#24330;&#24615;&#8221;&#27010;&#24565;&#65292;GI&#26426;&#21046;&#21487;&#20197;&#23454;&#38469;&#35780;&#20272;&#29609;&#23478;&#30340;&#26234;&#33021;&#65292;&#24212;&#29992;&#24191;&#27867;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#26032;&#30340;&#26694;&#26550;&#8212;&#8212;&#26377;&#38480;&#30693;&#35782;&#19979;&#30340;n&#20154;&#21338;&#24328;&#65292;&#20854;&#20013;&#29609;&#23478;&#21482;&#23545;&#28216;&#25103;&#30340;&#26576;&#20123;&#26041;&#38754;&#65288;&#21253;&#25324;&#34892;&#21160;&#12289;&#32467;&#26524;&#21644;&#20854;&#20182;&#29609;&#23478;&#65289;&#26377;&#38480;&#30340;&#20102;&#35299;&#12290;&#20026;&#20102;&#20998;&#26512;&#36825;&#20123;&#28216;&#25103;&#65292;&#25105;&#20171;&#32461;&#20102;&#19968;&#32452;&#26032;&#30340;&#27010;&#24565;&#21644;&#26426;&#21046;&#65292;&#37325;&#28857;&#20851;&#27880;&#20154;&#31867;&#21644;&#26426;&#22120;&#20915;&#31574;&#20043;&#38388;&#30340;&#30456;&#20114;&#20316;&#29992;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#25105;&#24341;&#20837;&#20102;&#20004;&#20010;&#20027;&#35201;&#27010;&#24565;&#65306;&#31532;&#19968;&#20010;&#26159;&#8220;&#28216;&#25103;&#26234;&#33021;&#8221;&#65288;GI&#65289;&#26426;&#21046;&#65292;&#23427;&#36890;&#36807;&#32771;&#34385;&#21442;&#32771;&#26426;&#22120;&#26234;&#33021;&#19979;&#30340;&#8220;&#38169;&#35823;&#8221;&#65292;&#19981;&#20165;&#20165;&#26159;&#28216;&#25103;&#30340;&#32467;&#26524;&#65292;&#37327;&#21270;&#20102;&#29609;&#23478;&#22312;&#28216;&#25103;&#20013;&#23637;&#31034;&#20986;&#30340;&#26234;&#33021;&#12290;&#31532;&#20108;&#20010;&#26159;&#8220;&#38450;&#20316;&#24330;&#24615;&#8221;&#65292;&#36825;&#26159;&#19968;&#31181;&#23454;&#29992;&#30340;&#12289;&#21487;&#35745;&#31639;&#30340;&#31574;&#30053;&#26080;&#20851;&#24615;&#30340;&#27010;&#24565;&#12290;GI&#26426;&#21046;&#25552;&#20379;&#20102;&#19968;&#31181;&#23454;&#29992;&#30340;&#26041;&#27861;&#26469;&#35780;&#20272;&#29609;&#23478;&#65292;&#21487;&#20197;&#28508;&#22312;&#22320;&#24212;&#29992;&#20110;&#20174;&#22312;&#32447;&#28216;&#25103;&#21040;&#29616;&#23454;&#29983;&#27963;&#20915;&#31574;&#30340;&#21508;&#31181;&#28216;&#25103;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this note, I introduce a new framework called n-person games with partial knowledge, in which players have only limited knowledge about the aspects of the game -- including actions, outcomes, and other players. For example, playing an actual game of chess is a game of partial knowledge. To analyze these games, I introduce a set of new concepts and mechanisms for measuring the intelligence of players, with a focus on the interplay between human- and machine-based decision-making. Specifically, I introduce two main concepts: firstly, the Game Intelligence (GI) mechanism, which quantifies a player's demonstrated intelligence in a game by considering not only the game's outcome but also the "mistakes" made during the game according to the reference machine's intelligence. Secondly, I define gaming-proofness, a practical and computational concept of strategy-proofness. The GI mechanism provides a practicable way to assess players and can potentially be applied to a wide range of games, f
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#20110;&#20272;&#35745;&#25910;&#20837;&#30340;&#23545;&#25968;&#27491;&#24577;&#20998;&#24067;&#28151;&#21512;&#27169;&#22411;&#21442;&#25968;&#30340;&#36125;&#21494;&#26031;&#20998;&#26512;&#26041;&#27861;&#65292;&#24182;&#36890;&#36807;&#27169;&#25311;&#21644;&#23454;&#35777;&#25968;&#25454;&#30340;&#39564;&#35777;&#34920;&#26126;&#20102;&#20854;&#20934;&#30830;&#24615;&#21644;&#36866;&#29992;&#24615;&#12290;</title><link>http://arxiv.org/abs/2210.05115</link><description>&lt;p&gt;
&#26410;&#30693;&#32452;&#20214;&#25968;&#30340;&#23545;&#25968;&#27491;&#24577;&#20998;&#24067;&#28151;&#21512;&#27169;&#22411;&#30340;&#36125;&#21494;&#26031;&#20998;&#26512;&#21644;&#32452;&#21512;&#25968;&#25454;&#30340;&#39532;&#23572;&#21487;&#22827;&#38142;&#33945;&#29305;&#21345;&#27931;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Bayesian analysis of mixtures of lognormal distribution with an unknown number of components from grouped data. (arXiv:2210.05115v3 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2210.05115
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#20110;&#20272;&#35745;&#25910;&#20837;&#30340;&#23545;&#25968;&#27491;&#24577;&#20998;&#24067;&#28151;&#21512;&#27169;&#22411;&#21442;&#25968;&#30340;&#36125;&#21494;&#26031;&#20998;&#26512;&#26041;&#27861;&#65292;&#24182;&#36890;&#36807;&#27169;&#25311;&#21644;&#23454;&#35777;&#25968;&#25454;&#30340;&#39564;&#35777;&#34920;&#26126;&#20102;&#20854;&#20934;&#30830;&#24615;&#21644;&#36866;&#29992;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#21487;&#36870;&#36339;&#36291;&#39532;&#23572;&#21487;&#22827;&#38142;&#33945;&#29305;&#21345;&#27931;&#26041;&#27861;&#65292;&#29992;&#20110;&#20272;&#35745;&#25910;&#20837;&#30340;&#23545;&#25968;&#27491;&#24577;&#20998;&#24067;&#28151;&#21512;&#27169;&#22411;&#30340;&#21442;&#25968;&#12290;&#36890;&#36807;&#20351;&#29992;&#27169;&#25311;&#25968;&#25454;&#31034;&#20363;&#65292;&#25105;&#20204;&#26816;&#39564;&#20102;&#25152;&#25552;&#31639;&#27861;&#30340;&#24615;&#33021;&#20197;&#21450;&#22522;&#23612;&#31995;&#25968;&#30340;&#21518;&#39564;&#20998;&#24067;&#30340;&#20934;&#30830;&#24615;&#12290;&#32467;&#26524;&#34920;&#26126;&#21442;&#25968;&#20272;&#35745;&#20934;&#30830;&#65292;&#21363;&#20351;&#32771;&#34385;&#20102;&#19981;&#21516;&#30340;&#25968;&#25454;&#29983;&#25104;&#36807;&#31243;&#65292;&#21518;&#39564;&#20998;&#24067;&#20173;&#25509;&#36817;&#30495;&#23454;&#20998;&#24067;&#12290;&#27492;&#22806;&#65292;&#22522;&#20110;&#26356;&#20855;&#21560;&#24341;&#21147;&#30340;&#22522;&#23612;&#31995;&#25968;&#30340;&#32467;&#26524;&#65292;&#25105;&#20204;&#36824;&#23558;&#35813;&#26041;&#27861;&#24212;&#29992;&#20110;&#26469;&#33258;&#26085;&#26412;&#30340;&#23454;&#38469;&#25968;&#25454;&#12290;&#23454;&#35777;&#26696;&#20363;&#34920;&#26126;&#26085;&#26412;&#22312;2020&#24180;&#23384;&#22312;&#20004;&#20010;&#23376;&#32676;&#65292;&#24182;&#19988;&#22522;&#23612;&#31995;&#25968;&#30340;&#23436;&#25972;&#24615;&#24471;&#21040;&#20102;&#39564;&#35777;&#12290;
&lt;/p&gt;
&lt;p&gt;
This study proposes a reversible jump Markov chain Monte Carlo method for estimating parameters of lognormal distribution mixtures for income. Using simulated data examples, we examined the proposed algorithm's performance and the accuracy of posterior distributions of the Gini coefficients. Results suggest that the parameters were estimated accurately. Therefore, the posterior distributions are close to the true distributions even when the different data generating process is accounted for. Moreover, promising results for Gini coefficients encouraged us to apply our method to real data from Japan. The empirical examples indicate two subgroups in Japan (2020) and the Gini coefficients' integrity.
&lt;/p&gt;</description></item></channel></rss>