<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#21033;&#29992;&#26426;&#22120;&#23398;&#20064;&#12289;&#28151;&#21512;&#36923;&#36753;&#21644;&#38750;&#32447;&#24615;&#35268;&#21010;&#20248;&#21270;B2B&#20135;&#21697;&#25253;&#20215;&#30340;&#24314;&#27169;&#26041;&#27861;&#65292;&#36890;&#36807;&#20998;&#26512;&#23458;&#25143;&#25968;&#25454;&#21644;&#34701;&#21512;&#32463;&#27982;&#29702;&#35770;&#65292;&#21487;&#20197;&#39044;&#27979;&#23458;&#25143;&#23545;&#19981;&#21516;&#38144;&#21806;&#25253;&#20215;&#30340;&#24863;&#30693;&#20215;&#20540;&#21644;&#21453;&#24212;&#65292;&#24182;&#20026;&#22522;&#20110;&#20215;&#20540;&#30340;&#23450;&#20215;&#21644;&#38144;&#21806;&#24037;&#20316;&#25552;&#20379;&#25903;&#25345;&#12290;</title><link>http://arxiv.org/abs/2308.07830</link><description>&lt;p&gt;
&#36890;&#36807;&#26426;&#22120;&#23398;&#20064;&#12289;&#28151;&#21512;&#36923;&#36753;&#21644;&#38750;&#32447;&#24615;&#35268;&#21010;&#20248;&#21270;B2B&#20135;&#21697;&#25253;&#20215;
&lt;/p&gt;
&lt;p&gt;
Optimizing B2B Product Offers with Machine Learning, Mixed Logit, and Nonlinear Programming. (arXiv:2308.07830v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.07830
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#21033;&#29992;&#26426;&#22120;&#23398;&#20064;&#12289;&#28151;&#21512;&#36923;&#36753;&#21644;&#38750;&#32447;&#24615;&#35268;&#21010;&#20248;&#21270;B2B&#20135;&#21697;&#25253;&#20215;&#30340;&#24314;&#27169;&#26041;&#27861;&#65292;&#36890;&#36807;&#20998;&#26512;&#23458;&#25143;&#25968;&#25454;&#21644;&#34701;&#21512;&#32463;&#27982;&#29702;&#35770;&#65292;&#21487;&#20197;&#39044;&#27979;&#23458;&#25143;&#23545;&#19981;&#21516;&#38144;&#21806;&#25253;&#20215;&#30340;&#24863;&#30693;&#20215;&#20540;&#21644;&#21453;&#24212;&#65292;&#24182;&#20026;&#22522;&#20110;&#20215;&#20540;&#30340;&#23450;&#20215;&#21644;&#38144;&#21806;&#24037;&#20316;&#25552;&#20379;&#25903;&#25345;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;B2B&#24066;&#22330;&#20013;&#65292;&#22522;&#20110;&#20215;&#20540;&#30340;&#23450;&#20215;&#21644;&#38144;&#21806;&#24050;&#25104;&#20026;&#23545;&#25240;&#25187;&#30340;&#37325;&#35201;&#26367;&#20195;&#26041;&#24335;&#12290;&#26412;&#30740;&#31350;&#27010;&#36848;&#20102;&#19968;&#31181;&#24314;&#27169;&#26041;&#27861;&#65292;&#21033;&#29992;&#23458;&#25143;&#25968;&#25454;&#65288;&#21521;&#27599;&#20010;&#24403;&#21069;&#25110;&#28508;&#22312;&#23458;&#25143;&#25552;&#20379;&#30340;&#20135;&#21697;&#25253;&#20215;&#12289;&#29305;&#24449;&#12289;&#25240;&#25187;&#21644;&#23458;&#25143;&#36141;&#20080;&#20915;&#31574;&#65289;&#26469;&#20272;&#35745;&#28151;&#21512;&#36923;&#36753;&#36873;&#25321;&#27169;&#22411;&#12290;&#35813;&#27169;&#22411;&#36890;&#36807;&#20998;&#23618;&#36125;&#21494;&#26031;&#21644;&#26426;&#22120;&#23398;&#20064;&#36827;&#34892;&#20272;&#35745;&#65292;&#25552;&#20379;&#20102;&#23458;&#25143;&#32423;&#21035;&#30340;&#21442;&#25968;&#20272;&#35745;&#12290;&#23458;&#25143;&#32423;&#21035;&#30340;&#20272;&#35745;&#32467;&#26524;&#36755;&#20837;&#21040;&#38750;&#32447;&#24615;&#35268;&#21010;&#30340;&#19979;&#19968;&#27493;&#26368;&#20248;&#29305;&#24449;&#21644;&#25240;&#25187;&#36873;&#25321;&#38382;&#39064;&#20013;&#65292;&#20197;&#36873;&#25321;&#38024;&#23545;&#23458;&#25143;&#32454;&#20998;&#36827;&#34892;&#20248;&#21270;&#30340;&#29305;&#24449;&#21644;&#25240;&#25187;&#27700;&#24179;&#65292;&#32780;&#23458;&#25143;&#32454;&#20998;&#26159;&#22522;&#20110;&#24544;&#35802;&#24230;&#21644;&#25240;&#25187;&#24377;&#24615;&#12290;&#28151;&#21512;&#36923;&#36753;&#27169;&#22411;&#19982;&#32463;&#27982;&#29702;&#35770;&#65288;&#38543;&#26426;&#25928;&#29992;&#27169;&#22411;&#65289;&#30456;&#32467;&#21512;&#65292;&#21487;&#20197;&#39044;&#27979;&#23458;&#25143;&#23545;&#26410;&#26469;&#38144;&#21806;&#25253;&#20215;&#30340;&#24863;&#30693;&#20215;&#20540;&#21644;&#21453;&#24212;&#12290;&#35813;&#26041;&#27861;&#21487;&#20197;&#24212;&#29992;&#20110;&#25903;&#25345;&#22522;&#20110;&#20215;&#20540;&#30340;&#23450;&#20215;&#21644;&#38144;&#21806;&#24037;&#20316;&#12290;&#23545;&#25991;&#29486;&#30340;&#36129;&#29486;&#21253;&#25324;&#65306;&#65288;a&#65289;&#20351;&#29992;&#23458;&#25143;&#32423;&#21035;&#30340;&#25968;&#25454;
&lt;/p&gt;
&lt;p&gt;
In B2B markets, value-based pricing and selling has become an important alternative to discounting. This study outlines a modeling method that uses customer data (product offers made to each current or potential customer, features, discounts, and customer purchase decisions) to estimate a mixed logit choice model. The model is estimated via hierarchical Bayes and machine learning, delivering customer-level parameter estimates. Customer-level estimates are input into a nonlinear programming next-offer maximization problem to select optimal features and discount level for customer segments, where segments are based on loyalty and discount elasticity. The mixed logit model is integrated with economic theory (the random utility model), and it predicts both customer perceived value for and response to alternative future sales offers. The methodology can be implemented to support value-based pricing and selling efforts.  Contributions to the literature include: (a) the use of customer-level 
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#21457;&#23637;&#20102;&#19968;&#20010;&#32479;&#19968;&#30340;&#29702;&#35770;&#26469;&#30740;&#31350;&#21033;&#29575;&#23545;&#21830;&#21697;&#20215;&#26684;&#30340;&#24433;&#21709;&#65292;&#24182;&#25193;&#23637;&#20102;&#31454;&#20105;&#20648;&#23384;&#27169;&#22411;&#20197;&#36866;&#24212;&#38543;&#26426;&#28436;&#21270;&#30340;&#21033;&#29575;&#12290;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;&#23454;&#38469;&#21033;&#29575;&#23545;&#21830;&#21697;&#20215;&#26684;&#20855;&#26377;&#37325;&#35201;&#32780;&#25345;&#32493;&#30340;&#36127;&#38754;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2308.07577</link><description>&lt;p&gt;
&#21033;&#29575;&#21160;&#24577;&#21644;&#21830;&#21697;&#20215;&#26684;
&lt;/p&gt;
&lt;p&gt;
Interest Rate Dynamics and Commodity Prices. (arXiv:2308.07577v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.07577
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#21457;&#23637;&#20102;&#19968;&#20010;&#32479;&#19968;&#30340;&#29702;&#35770;&#26469;&#30740;&#31350;&#21033;&#29575;&#23545;&#21830;&#21697;&#20215;&#26684;&#30340;&#24433;&#21709;&#65292;&#24182;&#25193;&#23637;&#20102;&#31454;&#20105;&#20648;&#23384;&#27169;&#22411;&#20197;&#36866;&#24212;&#38543;&#26426;&#28436;&#21270;&#30340;&#21033;&#29575;&#12290;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;&#23454;&#38469;&#21033;&#29575;&#23545;&#21830;&#21697;&#20215;&#26684;&#20855;&#26377;&#37325;&#35201;&#32780;&#25345;&#32493;&#30340;&#36127;&#38754;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36135;&#24065;&#26465;&#20214;&#32463;&#24120;&#34987;&#35748;&#20026;&#26159;&#24433;&#21709;&#21830;&#21697;&#20215;&#26684;&#27874;&#21160;&#30340;&#37325;&#35201;&#22240;&#32032;&#12290;&#28982;&#32780;&#65292;&#20256;&#36755;&#26426;&#21046;&#30340;&#20855;&#20307;&#28192;&#36947;&#36824;&#27809;&#26377;&#34987;&#26126;&#30830;&#23450;&#20041;&#12290;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#21457;&#23637;&#20102;&#19968;&#20010;&#32479;&#19968;&#30340;&#29702;&#35770;&#26469;&#30740;&#31350;&#21033;&#29575;&#23545;&#21830;&#21697;&#20215;&#26684;&#21450;&#20854;&#22522;&#26412;&#26426;&#21046;&#30340;&#24433;&#21709;&#12290;&#20026;&#27492;&#65292;&#25105;&#20204;&#25193;&#23637;&#20102;&#31454;&#20105;&#20648;&#23384;&#27169;&#22411;&#20197;&#36866;&#24212;&#38543;&#26426;&#28436;&#21270;&#30340;&#21033;&#29575;&#65292;&#24182;&#30830;&#23450;&#20102;&#26222;&#36941;&#26465;&#20214;&#65292;&#21363;(i)&#23384;&#22312;&#21807;&#19968;&#30340;&#29702;&#24615;&#39044;&#26399;&#22343;&#34913;&#24182;&#33021;&#26377;&#25928;&#35745;&#31639;&#65292;&#20197;&#21450;(ii)&#21033;&#29575;&#19982;&#21830;&#21697;&#20215;&#26684;&#21576;&#36127;&#30456;&#20851;&#12290;&#20316;&#20026;&#24212;&#29992;&#65292;&#25105;&#20204;&#36890;&#36807;&#25237;&#26426;&#28192;&#36947;&#37327;&#21270;&#20102;&#21033;&#29575;&#23545;&#21830;&#21697;&#20215;&#26684;&#30340;&#24433;&#21709;&#65292;&#21363;&#29289;&#29702;&#24066;&#22330;&#19978;&#25345;&#26377;&#24211;&#23384;&#30340;&#25237;&#26426;&#32773;&#30340;&#28608;&#21169;&#21463;&#21033;&#29575;&#21464;&#21160;&#30340;&#24433;&#21709;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#21457;&#29616;&#65292;&#23454;&#38469;&#21033;&#29575;&#23545;&#21830;&#21697;&#20215;&#26684;&#20855;&#26377;&#37325;&#35201;&#32780;&#25345;&#32493;&#30340;&#36127;&#38754;&#24433;&#21709;&#65292;&#19988;&#35813;&#24433;&#21709;&#24182;&#19981;&#24179;&#20961;&#12290;
&lt;/p&gt;
&lt;p&gt;
Monetary conditions are frequently cited as a significant factor influencing fluctuations in commodity prices. However, the precise channels of transmission are less well identified. In this paper, we develop a unified theory to study the impact of interest rates on commodity prices and the underlying mechanisms. To that end, we extend the competitive storage model to accommodate stochastically evolving interest rates, and establish general conditions under which (i) a unique rational expectations equilibrium exists and can be efficiently computed, and (ii) interest rates are negatively correlated with commodity prices. As an application, we quantify the impact of interest rates on commodity prices through the speculative channel, namely, the role of speculators in the physical market whose incentive to hold inventories is influenced by interest rate movements. Our findings demonstrate that real interest rates have nontrivial and persistent negative effect on commodity prices, and the 
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#36890;&#36807;&#30740;&#31350;&#31185;&#23398;&#20013;&#30340;&#20598;&#28982;&#24615;&#65292;&#25506;&#35752;&#20102;&#20598;&#28982;&#24615;&#22312;&#31185;&#23398;&#21457;&#29616;&#20013;&#30340;&#20316;&#29992;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#25317;&#26377;&#24320;&#25918;&#24515;&#24577;&#21644;&#28145;&#20837;&#30340;&#20808;&#39564;&#32463;&#39564;&#30340;&#31185;&#23398;&#23478;&#26356;&#26377;&#21487;&#33021;&#20174;&#20598;&#28982;&#30456;&#36935;&#20013;&#21463;&#30410;&#12290;&#36890;&#36807;&#23545;&#22823;&#35268;&#27169;&#25968;&#25454;&#30340;&#20998;&#26512;&#65292;&#26412;&#30740;&#31350;&#25552;&#20379;&#20102;&#35777;&#25454;&#25903;&#25345;&#36825;&#19968;&#35266;&#28857;&#12290;</title><link>http://arxiv.org/abs/2308.07519</link><description>&lt;p&gt;
&#31185;&#23398;&#20013;&#30340;&#20598;&#28982;&#24615;
&lt;/p&gt;
&lt;p&gt;
Serendipity in Science. (arXiv:2308.07519v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.07519
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36890;&#36807;&#30740;&#31350;&#31185;&#23398;&#20013;&#30340;&#20598;&#28982;&#24615;&#65292;&#25506;&#35752;&#20102;&#20598;&#28982;&#24615;&#22312;&#31185;&#23398;&#21457;&#29616;&#20013;&#30340;&#20316;&#29992;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#25317;&#26377;&#24320;&#25918;&#24515;&#24577;&#21644;&#28145;&#20837;&#30340;&#20808;&#39564;&#32463;&#39564;&#30340;&#31185;&#23398;&#23478;&#26356;&#26377;&#21487;&#33021;&#20174;&#20598;&#28982;&#30456;&#36935;&#20013;&#21463;&#30410;&#12290;&#36890;&#36807;&#23545;&#22823;&#35268;&#27169;&#25968;&#25454;&#30340;&#20998;&#26512;&#65292;&#26412;&#30740;&#31350;&#25552;&#20379;&#20102;&#35777;&#25454;&#25903;&#25345;&#36825;&#19968;&#35266;&#28857;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20598;&#28982;&#24615;&#22312;&#31185;&#23398;&#21457;&#29616;&#20013;&#36215;&#30528;&#37325;&#35201;&#20316;&#29992;&#12290;&#20107;&#23454;&#19978;&#65292;&#20174;&#38738;&#38665;&#32032;&#21040;&#30005;&#27744;&#65292;&#35768;&#22810;&#37325;&#35201;&#31361;&#30772;&#37117;&#26159;&#30001;&#20110;&#31185;&#23398;&#23478;&#20598;&#28982;&#25509;&#35302;&#21040;&#26410;&#34987;&#23547;&#27714;&#20294;&#26377;&#29992;&#30340;&#20449;&#24687;&#32780;&#23454;&#29616;&#30340;&#12290;&#28982;&#32780;&#65292;&#24182;&#19981;&#26159;&#25152;&#26377;&#31185;&#23398;&#23478;&#37117;&#21516;&#26679;&#26377;&#21487;&#33021;&#21463;&#30410;&#20110;&#36825;&#31181;&#20598;&#28982;&#30340;&#26333;&#20809;&#12290;&#23613;&#31649;&#23398;&#32773;&#20204;&#26222;&#36941;&#35748;&#20026;&#25317;&#26377;&#19968;&#20010;&#39044;&#20808;&#20934;&#22791;&#22909;&#30340;&#22836;&#33041;&#30340;&#31185;&#23398;&#23478;&#26368;&#26377;&#21487;&#33021;&#20174;&#20598;&#28982;&#30340;&#30456;&#36935;&#20013;&#21463;&#30410;&#65292;&#20294;&#23545;&#20110;&#20160;&#20040;&#26500;&#25104;&#39044;&#20808;&#20934;&#22791;&#22909;&#30340;&#22836;&#33041;&#30340;&#23450;&#20041;&#65292;&#36824;&#27809;&#26377;&#22826;&#22810;&#20849;&#35782;&#65292;&#19968;&#20123;&#30740;&#31350;&#34920;&#26126;&#24320;&#25918;&#24515;&#24577;&#30340;&#37325;&#35201;&#24615;&#65292;&#32780;&#20854;&#20182;&#20154;&#21017;&#24378;&#35843;&#22312;&#29305;&#23450;&#39046;&#22495;&#38656;&#35201;&#28145;&#20837;&#30340;&#20808;&#39564;&#32463;&#39564;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#36890;&#36807;&#21033;&#29992;&#19968;&#20010;&#25919;&#31574;&#21464;&#21270;&#65292;&#23558;&#22823;&#23398;&#22270;&#20070;&#39302;&#30340;&#26434;&#24535;&#23384;&#25918;&#20301;&#32622;&#36827;&#34892;&#22806;&#22312;&#24615;&#30340;&#31227;&#21160;&#65292;&#24182;&#38543;&#20043;&#20351;&#31185;&#23398;&#23478;&#25509;&#35302;&#21040;&#26410;&#34987;&#23547;&#27714;&#30340;&#31185;&#23398;&#20449;&#24687;&#65292;&#25105;&#20204;&#23545;&#31185;&#23398;&#20013;&#20598;&#28982;&#24615;&#30340;&#20316;&#29992;&#36827;&#34892;&#20102;&#32463;&#39564;&#30740;&#31350;&#12290;&#25105;&#20204;&#20351;&#29992;&#21253;&#21547;240&#19975;&#31687;&#35770;&#25991;&#30340;&#22823;&#35268;&#27169;&#25968;&#25454;&#36827;&#34892;&#30740;&#31350;&#12290;
&lt;/p&gt;
&lt;p&gt;
Serendipity plays an important role in scientific discovery. Indeed, many of the most important breakthroughs, ranging from penicillin to the electric battery, have been made by scientists who were stimulated by a chance exposure to unsought but useful information. However, not all scientists are equally likely to benefit from such serendipitous exposure. Although scholars generally agree that scientists with a prepared mind are most likely to benefit from serendipitous encounters, there is much less consensus over what precisely constitutes a prepared mind, with some research suggesting the importance of openness and others emphasizing the need for deep prior experience in a particular domain. In this paper, we empirically investigate the role of serendipity in science by leveraging a policy change that exogenously shifted the shelving location of journals in university libraries and subsequently exposed scientists to unsought scientific information. Using large-scale data on 2.4 mill
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#35780;&#20272;&#20102;COVID-19&#23545;&#20013;&#22269;&#22320;&#26041;&#25919;&#24220;&#20844;&#20849;&#36130;&#25919;&#30340;&#24433;&#21709;&#65292;&#21457;&#29616;&#23553;&#38145;&#25514;&#26045;&#23545;&#21021;&#21019;&#20225;&#19994;&#36896;&#25104;&#20102;&#36127;&#38754;&#24433;&#21709;&#12290;&#25919;&#31574;&#21046;&#23450;&#32773;&#24212;&#32771;&#34385;&#23454;&#26045;&#26356;&#22810;&#38024;&#23545;&#21021;&#21019;&#20225;&#19994;&#30340;&#20248;&#24800;&#25919;&#31574;&#65292;&#20197;&#30830;&#20445;&#23427;&#20204;&#30340;&#29983;&#23384;&#21644;&#21457;&#23637;&#12290;</title><link>http://arxiv.org/abs/2308.07437</link><description>&lt;p&gt;
COVID-19&#23553;&#38145;&#25514;&#26045;&#23545;&#20013;&#22269;&#21021;&#21019;&#20225;&#19994;&#21644;&#22320;&#26041;&#25919;&#24220;&#20844;&#20849;&#36130;&#25919;&#30340;&#24433;&#21709;&#65306;&#25361;&#25112;&#21644;&#25919;&#31574;&#21551;&#31034;
&lt;/p&gt;
&lt;p&gt;
Impact of COVID-19 Lockdown Measures on Chinese Startups and Local Government Public Finance: Challenges and Policy Implications. (arXiv:2308.07437v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.07437
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#35780;&#20272;&#20102;COVID-19&#23545;&#20013;&#22269;&#22320;&#26041;&#25919;&#24220;&#20844;&#20849;&#36130;&#25919;&#30340;&#24433;&#21709;&#65292;&#21457;&#29616;&#23553;&#38145;&#25514;&#26045;&#23545;&#21021;&#21019;&#20225;&#19994;&#36896;&#25104;&#20102;&#36127;&#38754;&#24433;&#21709;&#12290;&#25919;&#31574;&#21046;&#23450;&#32773;&#24212;&#32771;&#34385;&#23454;&#26045;&#26356;&#22810;&#38024;&#23545;&#21021;&#21019;&#20225;&#19994;&#30340;&#20248;&#24800;&#25919;&#31574;&#65292;&#20197;&#30830;&#20445;&#23427;&#20204;&#30340;&#29983;&#23384;&#21644;&#21457;&#23637;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#26088;&#22312;&#35780;&#20272;COVID-19&#23545;&#20013;&#22269;&#22320;&#26041;&#25919;&#24220;&#20844;&#20849;&#36130;&#25919;&#30340;&#24433;&#21709;&#65292;&#29305;&#21035;&#20851;&#27880;&#23553;&#38145;&#25514;&#26045;&#23545;&#30123;&#24773;&#26399;&#38388;&#21021;&#21019;&#20225;&#19994;&#30340;&#24433;&#21709;&#12290;&#30123;&#24773;&#29190;&#21457;&#32473;&#22320;&#26041;&#25919;&#24220;&#24102;&#26469;&#20102;&#37325;&#22823;&#30340;&#36130;&#25919;&#21387;&#21147;&#65292;&#23553;&#38145;&#25514;&#26045;&#23548;&#33268;&#25910;&#20837;&#19979;&#38477;&#21644;&#19982;&#20844;&#20849;&#21355;&#29983;&#21644;&#31038;&#20250;&#31119;&#21033;&#30456;&#20851;&#30340;&#25903;&#20986;&#22686;&#21152;&#12290;&#19982;&#27492;&#21516;&#26102;&#65292;&#21021;&#21019;&#20225;&#19994;&#38754;&#20020;&#30528;&#35832;&#22810;&#25361;&#25112;&#65292;&#21253;&#25324;&#34701;&#36164;&#20943;&#23569;&#21644;&#30408;&#21033;&#33021;&#21147;&#38477;&#20302;&#65292;&#36825;&#26159;&#23553;&#38145;&#25514;&#26045;&#23545;&#21019;&#19994;&#30340;&#36127;&#38754;&#24433;&#21709;&#25152;&#33268;&#12290;&#27492;&#22806;&#65292;&#30123;&#24773;&#24341;&#21457;&#20102;&#30701;&#26399;&#21644;&#38271;&#26399;&#30340;&#32463;&#27982;&#20914;&#20987;&#65292;&#24433;&#21709;&#23601;&#19994;&#21644;&#32463;&#27982;&#22797;&#33487;&#12290;&#20026;&#24212;&#23545;&#36825;&#20123;&#25361;&#25112;&#65292;&#25919;&#31574;&#21046;&#23450;&#32773;&#38656;&#22312;&#20581;&#24247;&#20851;&#20999;&#21644;&#32463;&#27982;&#21457;&#23637;&#20043;&#38388;&#21462;&#24471;&#24179;&#34913;&#12290;&#22312;&#36825;&#26041;&#38754;&#65292;&#25919;&#24220;&#24212;&#32771;&#34385;&#23454;&#26045;&#26356;&#22810;&#38024;&#23545;&#21021;&#21019;&#20225;&#19994;&#30340;&#20248;&#24800;&#25919;&#31574;&#65292;&#20197;&#30830;&#20445;&#23427;&#20204;&#30340;&#29983;&#23384;&#21644;&#21457;&#23637;&#12290;&#36825;&#20123;&#25919;&#31574;&#21487;&#33021;&#21253;&#25324;&#36130;&#21153;&#25903;&#25588;&#12289;&#31246;&#25910;&#28608;&#21169;&#21644;&#20943;&#20813;&#31561;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper aims to assess the impact of COVID-19 on the public finance of Chinese local governments, with a particular focus on the effect of lockdown measures on startups during the pandemic. The outbreak has placed significant fiscal pressure on local governments, as containment measures have led to declines in revenue and increased expenses related to public health and social welfare. In tandem, startups have faced substantial challenges, including reduced funding and profitability, due to the negative impact of lockdown measures on entrepreneurship. Moreover, the pandemic has generated short- and long-term economic shocks, affecting both employment and economic recovery. To address these challenges, policymakers must balance health concerns with economic development. In this regard, the government should consider implementing more preferential policies that focus on startups to ensure their survival and growth. Such policies may include financial assistance, tax incentives, and reg
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#26088;&#22312;&#30740;&#31350;&#20928;&#38646;&#33021;&#37327;&#20303;&#23429;&#65292;&#24182;&#25552;&#20986;&#20102;&#38754;&#21521;&#35813;&#39046;&#22495;&#30340;&#38543;&#26426;&#26368;&#20248;&#25237;&#36164;&#31574;&#30053;&#12290;&#35813;&#31574;&#30053;&#32771;&#34385;&#20102;&#29992;&#25143;&#20043;&#38388;&#30340;&#30005;&#21147;&#20998;&#20139;&#21644;&#20648;&#33021;&#35774;&#22791;&#30340;&#20351;&#29992;&#26041;&#24335;&#65292;&#36890;&#36807;&#38543;&#26426;&#20984;&#20248;&#21270;&#21644;&#21512;&#20316;&#21338;&#24328;&#30340;&#24314;&#27169;&#26041;&#27861;&#26469;&#35299;&#20915;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2308.07334</link><description>&lt;p&gt;
&#38754;&#21521;&#20928;&#38646;&#33021;&#37327;&#20303;&#23429;&#30340;&#38543;&#26426;&#26368;&#20248;&#25237;&#36164;&#31574;&#30053;
&lt;/p&gt;
&lt;p&gt;
Stochastic Optimal Investment Strategy for Net-Zero Energy Houses. (arXiv:2308.07334v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.07334
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#26088;&#22312;&#30740;&#31350;&#20928;&#38646;&#33021;&#37327;&#20303;&#23429;&#65292;&#24182;&#25552;&#20986;&#20102;&#38754;&#21521;&#35813;&#39046;&#22495;&#30340;&#38543;&#26426;&#26368;&#20248;&#25237;&#36164;&#31574;&#30053;&#12290;&#35813;&#31574;&#30053;&#32771;&#34385;&#20102;&#29992;&#25143;&#20043;&#38388;&#30340;&#30005;&#21147;&#20998;&#20139;&#21644;&#20648;&#33021;&#35774;&#22791;&#30340;&#20351;&#29992;&#26041;&#24335;&#65292;&#36890;&#36807;&#38543;&#26426;&#20984;&#20248;&#21270;&#21644;&#21512;&#20316;&#21338;&#24328;&#30340;&#24314;&#27169;&#26041;&#27861;&#26469;&#35299;&#20915;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#36825;&#39033;&#30740;&#31350;&#20013;&#65292;&#25105;&#20204;&#35843;&#26597;&#20102;&#20928;&#38646;&#33021;&#37327;&#20303;&#23429;&#65288;ZEH&#65289;&#65292;&#36890;&#36807;&#23558;&#24403;&#22320;&#20135;&#30005;&#30340;&#20809;&#20239;&#65288;PV&#65289;&#38754;&#26495;&#21644;&#29123;&#26009;&#30005;&#27744;&#38598;&#25104;&#21040;&#26412;&#22320;&#30005;&#21147;&#31995;&#32479;&#20013;&#65292;&#23454;&#29616;&#30899;&#20013;&#21644;&#30340;&#30446;&#26631;&#12290;&#26412;&#25991;&#32771;&#23519;&#20102;&#36890;&#36807;&#38598;&#25104;PV&#38754;&#26495;&#21644;&#30005;&#27744;&#20648;&#23384;&#35774;&#22791;&#26469;&#23454;&#29616;ZEH&#29366;&#24577;&#30340;&#29992;&#25143;&#20043;&#38388;&#30340;&#30005;&#21147;&#20998;&#20139;&#23545;&#24212;&#30340;&#24433;&#21709;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#20004;&#31181;&#28508;&#22312;&#30340;&#24773;&#26223;&#65306;&#31532;&#19968;&#31181;&#20551;&#35774;&#25152;&#26377;&#29992;&#25143;&#37117;&#21333;&#29420;&#25237;&#36164;&#20110;&#20648;&#33021;&#35774;&#22791;&#65292;&#20197;&#22312;&#24403;&#22320;&#27700;&#24179;&#19978;&#26368;&#23567;&#21270;&#25104;&#26412;&#32780;&#19981;&#36827;&#34892;&#33021;&#37327;&#20998;&#20139;&#65307;&#31532;&#20108;&#31181;&#35774;&#24819;&#36890;&#36807;&#38598;&#20307;&#20351;&#29992;&#30001;&#20013;&#22830;&#31649;&#29702;&#22120;&#31649;&#29702;&#30340;&#20849;&#20139;&#20648;&#33021;&#35774;&#22791;&#26469;&#23454;&#29616;&#25104;&#26412;&#26368;&#23567;&#21270;&#12290;&#36825;&#20004;&#31181;&#24773;&#26223;&#20998;&#21035;&#34987;&#24314;&#27169;&#20026;&#38543;&#26426;&#20984;&#20248;&#21270;&#38382;&#39064;&#21644;&#21512;&#20316;&#21338;&#24328;&#12290;&#20026;&#20102;&#35299;&#20915;&#30001;&#22810;&#20010;&#38543;&#26426;&#21464;&#37327;&#24341;&#36215;&#30340;&#38543;&#26426;&#25361;&#25112;&#65292;&#25105;&#20204;&#23558;&#33945;&#29305;&#21345;&#32599;&#26679;&#26412;&#24179;&#22343;&#36924;&#36817;&#65288;SAA&#65289;&#24212;&#29992;&#20110;&#36825;&#20123;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this research, we investigate Net-Zero Energy Houses (ZEH), which harness regionally produced electricity from photovoltaic(PV) panels and fuel cells, integrating them into a local power system in pursuit of achieving carbon neutrality. This paper examines the impact of electricity sharing among users who are working towards attaining ZEH status through the integration of PV panels and battery storage devices. We propose two potential scenarios: the first assumes that all users individually invest in storage devices, hence minimizing their costs on a local level without energy sharing; the second envisions cost minimization through the collective use of a shared storage device, managed by a central manager. These two scenarios are formulated as a stochastic convex optimization and a cooperative game, respectively. To tackle the stochastic challenges posed by multiple random variables, we apply the Monte Carlo sample average approximation (SAA) to the problems. To demonstrate the pra
&lt;/p&gt;</description></item><item><title>&#35813;&#30740;&#31350;&#36890;&#36807;PM-Gati Shakti&#20513;&#35758;&#20013;&#30340;&#20845;&#20010;&#20851;&#38190;&#25903;&#26609;&#65292;&#20197;&#24503;&#37324;&#26368;&#22823;&#38656;&#27714;&#39044;&#27979;&#20026;&#26696;&#20363;&#65292;&#25506;&#35752;&#20102;&#22914;&#20309;&#25552;&#39640;&#21360;&#24230;&#33021;&#28304;&#26410;&#26469;&#30340;&#36830;&#36890;&#24615;&#21644;&#31454;&#20105;&#21147;&#12290;&#39044;&#27979;&#22312;&#30005;&#21147;&#20379;&#24212;&#21644;&#36127;&#33655;&#38656;&#27714;&#24179;&#34913;&#12289;&#36130;&#21153;&#35268;&#21010;&#21644;&#35843;&#24230;&#31561;&#26041;&#38754;&#21457;&#25381;&#30528;&#37325;&#35201;&#20316;&#29992;&#65292;&#23588;&#20854;&#23545;&#21360;&#24230;&#20892;&#26449;&#22320;&#21306;&#21644;&#19996;&#21271;&#22320;&#21306;&#38750;&#24120;&#37325;&#35201;&#12290;</title><link>http://arxiv.org/abs/2308.07320</link><description>&lt;p&gt;
PM-Gati Shakti&#65306;&#36890;&#36807;&#38656;&#27714;&#39044;&#27979;&#25512;&#21160;&#21360;&#24230;&#33021;&#28304;&#26410;&#26469;&#30340;&#30740;&#31350; -- &#20197;&#24503;&#37324;&#26368;&#22823;&#38656;&#27714;&#39044;&#27979;&#26696;&#20363;&#30740;&#31350;&#20026;&#20363;
&lt;/p&gt;
&lt;p&gt;
PM-Gati Shakti: Advancing India's Energy Future through Demand Forecasting -- A Case Study. (arXiv:2308.07320v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.07320
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#36890;&#36807;PM-Gati Shakti&#20513;&#35758;&#20013;&#30340;&#20845;&#20010;&#20851;&#38190;&#25903;&#26609;&#65292;&#20197;&#24503;&#37324;&#26368;&#22823;&#38656;&#27714;&#39044;&#27979;&#20026;&#26696;&#20363;&#65292;&#25506;&#35752;&#20102;&#22914;&#20309;&#25552;&#39640;&#21360;&#24230;&#33021;&#28304;&#26410;&#26469;&#30340;&#36830;&#36890;&#24615;&#21644;&#31454;&#20105;&#21147;&#12290;&#39044;&#27979;&#22312;&#30005;&#21147;&#20379;&#24212;&#21644;&#36127;&#33655;&#38656;&#27714;&#24179;&#34913;&#12289;&#36130;&#21153;&#35268;&#21010;&#21644;&#35843;&#24230;&#31561;&#26041;&#38754;&#21457;&#25381;&#30528;&#37325;&#35201;&#20316;&#29992;&#65292;&#23588;&#20854;&#23545;&#21360;&#24230;&#20892;&#26449;&#22320;&#21306;&#21644;&#19996;&#21271;&#22320;&#21306;&#38750;&#24120;&#37325;&#35201;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
PM-Gati-Shakti&#20513;&#35758;&#25972;&#21512;&#20102;&#21253;&#25324;&#38081;&#36335;&#12289;&#28207;&#21475;&#12289;&#27700;&#36335;&#12289;&#29289;&#27969;&#22522;&#30784;&#35774;&#26045;&#12289;&#22823;&#20247;&#20132;&#36890;&#12289;&#26426;&#22330;&#21644;&#36947;&#36335;&#22312;&#20869;&#30340;&#22810;&#20010;&#37096;&#38376;&#12290;&#35813;&#20513;&#35758;&#26088;&#22312;&#25552;&#39640;&#36830;&#36890;&#24615;&#65292;&#22686;&#24378;&#21360;&#24230;&#20225;&#19994;&#30340;&#31454;&#20105;&#21147;&#65292;&#37325;&#28857;&#20851;&#27880;&#20845;&#20010;&#20851;&#38190;&#25903;&#26609;&#65292;&#21363;&#8220;&#25552;&#39640;&#29983;&#20135;&#21147;&#30340;&#36830;&#36890;&#24615;&#8221;&#65306;&#20840;&#38754;&#24615;&#12289;&#20248;&#20808;&#32423;&#12289;&#20248;&#21270;&#12289;&#21516;&#27493;&#24615;&#12289;&#20998;&#26512;&#24615;&#21644;&#21160;&#24577;&#24615;&#12290;&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;&#23558;&#36825;&#20123;&#25903;&#26609;&#24212;&#29992;&#20110;&#35299;&#20915;&#8220;&#24503;&#37324;&#26368;&#22823;&#38656;&#27714;&#39044;&#27979;&#8221;&#38382;&#39064;&#30340;&#26696;&#20363;&#12290;&#30005;&#21147;&#39044;&#27979;&#22312;&#30005;&#32593;&#20013;&#36215;&#30528;&#38750;&#24120;&#37325;&#35201;&#30340;&#20316;&#29992;&#65292;&#22240;&#20026;&#23427;&#38656;&#35201;&#22312;&#20219;&#20309;&#26102;&#20505;&#20445;&#25345;&#20379;&#24212;&#21644;&#36127;&#33655;&#38656;&#27714;&#20043;&#38388;&#30340;&#24179;&#34913;&#65292;&#20197;&#25552;&#20379;&#20248;&#36136;&#30340;&#30005;&#21147;&#20379;&#24212;&#65292;&#29992;&#20110;&#36130;&#21153;&#35268;&#21010;&#12289;&#21457;&#30005;&#20648;&#22791;&#31561;&#12290;&#39044;&#27979;&#19981;&#20165;&#26377;&#21161;&#20110;&#29983;&#20135;&#35745;&#21010;&#65292;&#36824;&#26377;&#21161;&#20110;&#36827;&#21475;/&#20986;&#21475;&#31561;&#35843;&#24230;&#65292;&#36825;&#22312;&#21360;&#24230;&#38750;&#24120;&#24120;&#35265;&#65292;&#20063;&#26159;&#21360;&#24230;&#20892;&#26449;&#22320;&#21306;&#21644;&#19996;&#21271;&#22320;&#21306;&#24120;&#24120;&#38656;&#35201;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
PM-Gati-Shakti Initiative, integration of ministries, including railways, ports, waterways, logistic infrastructure, mass transport, airports, and roads. Aimed at enhancing connectivity and bolstering the competitiveness of Indian businesses, the initiative focuses on six pivotal pillars known as "Connectivity for Productivity": comprehensiveness, prioritization, optimization, synchronization, analytical, and dynamic. In this study, we explore the application of these pillars to address the problem of "Maximum Demand Forecasting in Delhi." Electricity forecasting plays a very significant role in the power grid as it is required to maintain a balance between supply and load demand at all times, to provide a quality electricity supply, for Financial planning, generation reserve, and many more. Forecasting helps not only in Production Planning but also in Scheduling like Import / Export which is very often in India and mostly required by the rural areas and North Eastern Regions of India.
&lt;/p&gt;</description></item><item><title>&#36890;&#36807;&#30740;&#31350;&#19968;&#20010;&#31616;&#21333;&#30340;&#37325;&#22797;&#21338;&#24328;&#27169;&#22411;&#65292;&#25105;&#20204;&#21457;&#29616;&#19981;&#21516;&#35266;&#28857;&#23545;&#32676;&#20307;&#29983;&#20135;&#32489;&#25928;&#26377;&#30528;&#19981;&#21516;&#30340;&#24433;&#21709;&#12290;&#19981;&#21516;&#30340;&#35266;&#28857;&#20250;&#23548;&#33268;&#19981;&#21516;&#30340;&#25216;&#26415;&#21644;&#21162;&#21147;&#36873;&#25321;&#65292;&#32780;&#35266;&#28857;&#20043;&#38388;&#30340;&#20998;&#27495;&#22312;&#19968;&#23450;&#31243;&#24230;&#19978;&#21487;&#20197;&#28608;&#21169;&#20048;&#35266;&#20027;&#20041;&#32773;&#26356;&#21162;&#21147;&#22320;&#24037;&#20316;&#65292;&#20294;&#20063;&#21487;&#33021;&#38477;&#20302;&#24576;&#30097;&#20027;&#20041;&#32773;&#30340;&#21162;&#21147;&#12290;&#22312;&#23384;&#22312;&#36275;&#22815;&#24378;&#30340;&#22806;&#37096;&#24615;&#19979;&#65292;&#19968;&#20010;&#20855;&#26377;&#20998;&#27495;&#35266;&#28857;&#30340;&#22242;&#38431;&#21487;&#20197;&#22312;&#39044;&#26399;&#20135;&#20986;&#26041;&#38754;&#36229;&#36807;&#19968;&#20010;&#26377;&#31867;&#20284;&#35266;&#28857;&#30340;&#22242;&#38431;&#12290;</title><link>http://arxiv.org/abs/2308.06607</link><description>&lt;p&gt;
&#19981;&#21516;&#35266;&#28857;&#22914;&#20309;&#24433;&#21709;&#19968;&#20010;&#32676;&#20307;&#30340;&#29983;&#20135;&#32489;&#25928;&#65306;&#19968;&#20010;&#31616;&#21333;&#30340;&#37325;&#22797;&#21338;&#24328;&#27169;&#22411;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
The Disagreement Dividend. (arXiv:2308.06607v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.06607
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#30740;&#31350;&#19968;&#20010;&#31616;&#21333;&#30340;&#37325;&#22797;&#21338;&#24328;&#27169;&#22411;&#65292;&#25105;&#20204;&#21457;&#29616;&#19981;&#21516;&#35266;&#28857;&#23545;&#32676;&#20307;&#29983;&#20135;&#32489;&#25928;&#26377;&#30528;&#19981;&#21516;&#30340;&#24433;&#21709;&#12290;&#19981;&#21516;&#30340;&#35266;&#28857;&#20250;&#23548;&#33268;&#19981;&#21516;&#30340;&#25216;&#26415;&#21644;&#21162;&#21147;&#36873;&#25321;&#65292;&#32780;&#35266;&#28857;&#20043;&#38388;&#30340;&#20998;&#27495;&#22312;&#19968;&#23450;&#31243;&#24230;&#19978;&#21487;&#20197;&#28608;&#21169;&#20048;&#35266;&#20027;&#20041;&#32773;&#26356;&#21162;&#21147;&#22320;&#24037;&#20316;&#65292;&#20294;&#20063;&#21487;&#33021;&#38477;&#20302;&#24576;&#30097;&#20027;&#20041;&#32773;&#30340;&#21162;&#21147;&#12290;&#22312;&#23384;&#22312;&#36275;&#22815;&#24378;&#30340;&#22806;&#37096;&#24615;&#19979;&#65292;&#19968;&#20010;&#20855;&#26377;&#20998;&#27495;&#35266;&#28857;&#30340;&#22242;&#38431;&#21487;&#20197;&#22312;&#39044;&#26399;&#20135;&#20986;&#26041;&#38754;&#36229;&#36807;&#19968;&#20010;&#26377;&#31867;&#20284;&#35266;&#28857;&#30340;&#22242;&#38431;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#22312;&#19968;&#20010;&#24102;&#26377;&#26367;&#20195;&#29983;&#20135;&#25216;&#26415;&#21644;&#27491;&#22806;&#37096;&#24615;&#30340;&#31616;&#21333;&#37325;&#22797;&#21338;&#24328;&#20013;&#65292;&#35266;&#28857;&#19981;&#21516;&#22914;&#20309;&#24433;&#21709;&#32676;&#20307;&#30340;&#29983;&#20135;&#32489;&#25928;&#12290;&#21442;&#19982;&#32773;&#21487;&#20197;&#25345;&#26377;&#19981;&#21516;&#30340;&#35266;&#28857;&#65292;&#21363;&#23545;&#25216;&#26415;&#30340;&#29305;&#24615;&#21644;&#36136;&#37327;&#25345;&#26377;&#19981;&#21516;&#30340;&#30475;&#27861;&#12290;&#36825;&#31181;&#20998;&#27495;&#26377;&#20004;&#20010;&#20027;&#35201;&#29305;&#28857;&#12290;&#39318;&#20808;&#65292;&#19981;&#21516;&#30340;&#35266;&#28857;&#20250;&#23548;&#33268;&#19981;&#21516;&#30340;&#25216;&#26415;&#21644;&#21162;&#21147;&#36873;&#25321;--&#8220;&#20048;&#35266;&#8221;&#30340;&#35266;&#28857;&#20250;&#23548;&#33268;&#27604;&#8220;&#24576;&#30097;&#8221;&#30340;&#35266;&#28857;&#26356;&#39640;&#30340;&#21162;&#21147;&#31243;&#24230;&#12290;&#20854;&#27425;&#65292;&#35266;&#28857;&#26159;&#26377;&#38887;&#24615;&#30340;--&#21482;&#26377;&#22312;&#20986;&#20046;&#24847;&#26009;&#30340;&#35777;&#25454;&#35777;&#26126;&#20854;&#20026;&#38169;&#35823;&#26102;&#25165;&#20250;&#21457;&#29983;&#21464;&#21270;&#12290;&#24403;&#21482;&#26377;&#19968;&#31181;&#29983;&#20135;&#25216;&#26415;&#21487;&#29992;&#26102;&#65292;&#23545;&#20854;&#29983;&#20135;&#21147;&#30340;&#20998;&#27495;(i)&#28608;&#21169;&#20048;&#35266;&#20027;&#20041;&#32773;&#27604;&#19982;&#26377;&#31867;&#20284;&#35266;&#28857;&#30340;&#29609;&#23478;&#21305;&#37197;&#26102;&#26356;&#21162;&#21147;&#22320;&#24037;&#20316;&#65307;(ii)&#21487;&#20197;&#38477;&#20302;&#24576;&#30097;&#20027;&#20041;&#32773;&#30340;&#21162;&#21147;&#12290;&#31532;&#19968;&#20010;&#21147;&#37327;&#26500;&#25104;&#20102;&#25105;&#20204;&#25152;&#35859;&#30340;&#8220;&#20998;&#27495;&#32418;&#21033;&#8221;&#30340;&#26680;&#24515;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#22914;&#26524;&#22806;&#37096;&#24615;&#36275;&#22815;&#24378;&#65292;&#19968;&#20010;&#26377;&#31867;&#20284;&#35266;&#28857;&#30340;&#20048;&#35266;&#20027;&#20041;&#32773;&#22242;&#38431;&#22312;&#39044;&#26399;&#20135;&#20986;&#26041;&#38754;&#20250;&#34987;&#19968;&#20010;&#20855;&#26377;&#20998;&#27495;&#35266;&#28857;&#30340;&#22242;&#38431;&#22312;&#34920;&#29616;&#19978;&#36229;&#36807;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study how disagreement influences the productive performance of a group in a simple repeated game with alternative production technologies and positive externalities. Players can disagree, i.e. hold different views about the characteristics and quality of the technologies. This disagreement has two main characteristics. First, different views lead to different technology and effort choices -- "optimistic" views justify higher effort than "skeptical" views. Second, views are resilient -- changed only if falsified by surprising evidence. When only one production technology is available, disagreement over its productivity (i) incentivizes the optimistic agent to work harder than when matched with a like-minded player; (ii) can reduce the effort of the skeptic agent. The first force lies at the core of what we call the "disagreement dividend." We show that if externalities are sufficiently strong, a team of like-minded optimists is outperformed -- in terms of expected output -- by a dis
&lt;/p&gt;</description></item><item><title>&#25552;&#20986;&#20102;&#19968;&#31181;&#27531;&#24046;&#33258;&#21161;&#27861;&#29992;&#20110;&#26465;&#20214;&#39118;&#38505;&#20215;&#20540;&#30340;&#20272;&#35745;&#65292;&#35777;&#26126;&#20102;&#20854;&#22312;&#27874;&#21160;&#29575;&#27169;&#22411;&#20013;&#30340;&#19968;&#33268;&#24615;&#65292;&#24182;&#27604;&#36739;&#20102;&#19981;&#21516;&#30340;&#33258;&#21161;&#27861;&#12290;&#23454;&#35777;&#32467;&#26524;&#26174;&#31034;&#65292;&#22266;&#23450;&#35774;&#35745;&#33258;&#21161;&#27861;&#22312;&#35206;&#30422;&#29575;&#19978;&#34920;&#29616;&#33391;&#22909;&#19988;&#21306;&#38388;&#36739;&#30701;&#12290;</title><link>http://arxiv.org/abs/1808.09125</link><description>&lt;p&gt;
&#26465;&#20214;&#39118;&#38505;&#20215;&#20540;&#30340;&#27531;&#24046;&#33258;&#21161;&#27861;
&lt;/p&gt;
&lt;p&gt;
A Residual Bootstrap for Conditional Value-at-Risk. (arXiv:1808.09125v4 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/1808.09125
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#27531;&#24046;&#33258;&#21161;&#27861;&#29992;&#20110;&#26465;&#20214;&#39118;&#38505;&#20215;&#20540;&#30340;&#20272;&#35745;&#65292;&#35777;&#26126;&#20102;&#20854;&#22312;&#27874;&#21160;&#29575;&#27169;&#22411;&#20013;&#30340;&#19968;&#33268;&#24615;&#65292;&#24182;&#27604;&#36739;&#20102;&#19981;&#21516;&#30340;&#33258;&#21161;&#27861;&#12290;&#23454;&#35777;&#32467;&#26524;&#26174;&#31034;&#65292;&#22266;&#23450;&#35774;&#35745;&#33258;&#21161;&#27861;&#22312;&#35206;&#30422;&#29575;&#19978;&#34920;&#29616;&#33391;&#22909;&#19988;&#21306;&#38388;&#36739;&#30701;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#38024;&#23545;&#26465;&#20214;&#39118;&#38505;&#20215;&#20540;&#30340;&#20004;&#27493;&#20272;&#35745;&#27861;&#65288;Francq&#21644;Zako\"ian&#65292;2015&#65289;&#30340;&#22266;&#23450;&#35774;&#35745;&#27531;&#24046;&#33258;&#21161;&#27861;&#12290;&#35777;&#26126;&#20102;&#35813;&#33258;&#21161;&#27861;&#22312;&#19968;&#33324;&#31867;&#21035;&#30340;&#27874;&#21160;&#29575;&#27169;&#22411;&#20013;&#30340;&#19968;&#33268;&#24615;&#65292;&#24182;&#26500;&#24314;&#20102;&#26465;&#20214;&#39118;&#38505;&#20215;&#20540;&#30340;&#21306;&#38388;&#12290;&#27169;&#25311;&#30740;&#31350;&#21457;&#29616;&#65292;&#31561;&#23614;&#30334;&#20998;&#20301;&#33258;&#21161;&#27861;&#30340;&#21306;&#38388;&#20542;&#21521;&#20110;&#20302;&#20110;&#20854;&#21517;&#20041;&#20540;&#12290;&#30456;&#27604;&#20043;&#19979;&#65292;&#21453;&#21521;&#23614;&#33258;&#21161;&#27861;&#30340;&#21306;&#38388;&#20855;&#26377;&#20934;&#30830;&#30340;&#35206;&#30422;&#29575;&#12290;&#25105;&#20204;&#36824;&#23558;&#29702;&#35770;&#20998;&#26512;&#30340;&#22266;&#23450;&#35774;&#35745;&#33258;&#21161;&#27861;&#19982;&#36882;&#24402;&#35774;&#35745;&#33258;&#21161;&#27861;&#36827;&#34892;&#20102;&#27604;&#36739;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;&#22312;&#24179;&#22343;&#35206;&#30422;&#29575;&#26041;&#38754;&#65292;&#22266;&#23450;&#35774;&#35745;&#33258;&#21161;&#27861;&#34920;&#29616;&#21516;&#26679;&#33391;&#22909;&#65292;&#20294;&#22312;&#36739;&#23567;&#26679;&#26412;&#20013;&#65292;&#20854;&#21306;&#38388;&#24179;&#22343;&#36739;&#30701;&#12290;&#23454;&#35777;&#24212;&#29992;&#35828;&#26126;&#20102;&#21306;&#38388;&#20272;&#35745;&#30340;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
A fixed-design residual bootstrap method is proposed for the two-step estimator of Francq and Zako\"ian (2015) associated with the conditional Value-at-Risk. The bootstrap's consistency is proven for a general class of volatility models and intervals are constructed for the conditional Value-at-Risk. A simulation study reveals that the equal-tailed percentile bootstrap interval tends to fall short of its nominal value. In contrast, the reversed-tails bootstrap interval yields accurate coverage. We also compare the theoretically analyzed fixed-design bootstrap with the recursive-design bootstrap. It turns out that the fixed-design bootstrap performs equally well in terms of average coverage, yet leads on average to shorter intervals in smaller samples. An empirical application illustrates the interval estimation.
&lt;/p&gt;</description></item></channel></rss>