<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#35813;&#35770;&#25991;&#25552;&#20379;&#20102;&#22522;&#20110;&#22270;&#35770;&#24037;&#20855;&#30340;&#38543;&#26426;&#36873;&#25321;&#27010;&#29575;&#29305;&#24449;&#25551;&#36848;&#65292;&#24182;&#22312;&#19981;&#23436;&#25972;&#39046;&#22495;&#20013;&#25552;&#20379;&#20102;&#38543;&#26426;&#29702;&#24615;&#30340;&#26032;&#21051;&#30011;&#12290;</title><link>http://arxiv.org/abs/2303.14249</link><description>&lt;p&gt;
&#20851;&#20110;&#38543;&#26426;&#36873;&#25321;&#20013;&#30340;&#22270;&#24418;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
On Graphical Methods in Stochastic Choice. (arXiv:2303.14249v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.14249
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20379;&#20102;&#22522;&#20110;&#22270;&#35770;&#24037;&#20855;&#30340;&#38543;&#26426;&#36873;&#25321;&#27010;&#29575;&#29305;&#24449;&#25551;&#36848;&#65292;&#24182;&#22312;&#19981;&#23436;&#25972;&#39046;&#22495;&#20013;&#25552;&#20379;&#20102;&#38543;&#26426;&#29702;&#24615;&#30340;&#26032;&#21051;&#30011;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36817;&#24180;&#26469;&#65292;&#26377;&#22823;&#37327;&#35770;&#25991;&#20351;&#29992;&#22270;&#35770;&#24037;&#20855;&#30740;&#31350;&#38543;&#26426;&#36873;&#25321;&#12290;Fiornini (2004)&#30340;&#30740;&#31350;&#25104;&#26524;&#20026;&#35813;&#39046;&#22495;&#25552;&#20379;&#20102;&#22522;&#30784;&#65292;&#36890;&#36807;&#25552;&#20379;&#36873;&#25321;&#27010;&#29575;&#30340;&#22270;&#24418;&#34920;&#31034;&#65292;&#24182;&#26174;&#31034;&#35813;&#22270;&#30340;&#27599;&#20010;&#20869;&#37096;&#33410;&#28857;&#24517;&#39035;&#28385;&#36275;&#27969;&#20837;&#31561;&#20110;&#27969;&#20986;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#36825;&#31181;&#27969;&#20837;&#31561;&#20110;&#27969;&#20986;&#29305;&#24615;&#20960;&#20046;&#26159;&#36873;&#25321;&#27010;&#29575;&#30340;&#29305;&#24449;&#12290;&#36890;&#36807;&#36825;&#31181;&#26041;&#24335;&#65292;&#25105;&#20204;&#20351;&#29992;&#22270;&#35770;&#24037;&#20855;&#23545;&#36873;&#25321;&#27010;&#29575;&#36827;&#34892;&#29305;&#24449;&#25551;&#36848;&#12290;&#20316;&#20026;&#35813;&#32467;&#26524;&#30340;&#19968;&#20010;&#24212;&#29992;&#65292;&#25105;&#20204;&#25552;&#20379;&#20102;&#19981;&#23436;&#25972;&#39046;&#22495;&#20013;&#38543;&#26426;&#29702;&#24615;&#30340;&#26032;&#21051;&#30011;&#12290;
&lt;/p&gt;
&lt;p&gt;
In recent years there has been an influx of papers which use graph theoretic tools to study stochastic choice. Fiorini (2004) serves as a base for this literature by providing a graphical representation of choice probabilities and showing that every interior node of this graph must satisfy inflow equals outflow. We show that this inflow equals outflow property is almost characteristic of choice probabilities. In doing so, we characterize choice probabilities through graph theoretic tools. As an application of this result, we provide a novel characterization of stochastic rationality on an incomplete domain.
&lt;/p&gt;</description></item></channel></rss>