<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#25552;&#20986;&#20102;&#19968;&#31181;&#21452;&#37325;&#31283;&#20581;&#30340;&#20272;&#35745;&#37327;&#26694;&#26550;&#65292;&#21487;&#20197;&#22312;&#29616;&#20195;&#25968;&#25454;&#20016;&#23500;&#30340;&#29615;&#22659;&#20013;&#20272;&#35745;&#23384;&#22312;&#26410;&#35266;&#23519;&#28151;&#26434;&#22240;&#32032;&#19979;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#65292;&#20855;&#26377;&#33391;&#22909;&#30340;&#26377;&#38480;&#26679;&#26412;&#21644;&#28176;&#36817;&#24615;&#36136;&#65292;&#24182;&#22312;&#21442;&#25968;&#36895;&#29575;&#19979;&#23558;&#20854;&#35823;&#24046;&#25910;&#25947;&#20026;&#38646;&#22343;&#20540;&#39640;&#26031;&#20998;&#24067;&#12290;</title><link>https://arxiv.org/abs/2402.11652</link><description>&lt;p&gt;
&#22240;&#26524;&#28508;&#22312;&#22240;&#23376;&#27169;&#22411;&#20013;&#30340;&#21452;&#37325;&#31283;&#20581;&#25512;&#26029;
&lt;/p&gt;
&lt;p&gt;
Doubly Robust Inference in Causal Latent Factor Models
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.11652
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#21452;&#37325;&#31283;&#20581;&#30340;&#20272;&#35745;&#37327;&#26694;&#26550;&#65292;&#21487;&#20197;&#22312;&#29616;&#20195;&#25968;&#25454;&#20016;&#23500;&#30340;&#29615;&#22659;&#20013;&#20272;&#35745;&#23384;&#22312;&#26410;&#35266;&#23519;&#28151;&#26434;&#22240;&#32032;&#19979;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#65292;&#20855;&#26377;&#33391;&#22909;&#30340;&#26377;&#38480;&#26679;&#26412;&#21644;&#28176;&#36817;&#24615;&#36136;&#65292;&#24182;&#22312;&#21442;&#25968;&#36895;&#29575;&#19979;&#23558;&#20854;&#35823;&#24046;&#25910;&#25947;&#20026;&#38646;&#22343;&#20540;&#39640;&#26031;&#20998;&#24067;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#22312;&#29616;&#20195;&#25968;&#25454;&#20016;&#23500;&#29615;&#22659;&#20013;&#20272;&#35745;&#23384;&#22312;&#26410;&#35266;&#23519;&#28151;&#26434;&#22240;&#32032;&#19979;&#30340;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#30340;&#26032;&#26694;&#26550;&#65292;&#35813;&#29615;&#22659;&#20855;&#26377;&#22823;&#37327;&#21333;&#20301;&#21644;&#32467;&#26524;&#12290;&#25152;&#25552;&#20986;&#30340;&#20272;&#35745;&#37327;&#26159;&#21452;&#37325;&#31283;&#20581;&#30340;&#65292;&#32467;&#21512;&#20102;&#32467;&#26524;&#22635;&#34917;&#12289;&#20498;&#25968;&#27010;&#29575;&#21152;&#26435;&#20197;&#21450;&#19968;&#31181;&#29992;&#20110;&#30697;&#38453;&#34917;&#20840;&#30340;&#26032;&#22411;&#20132;&#21449;&#37197;&#23545;&#31243;&#24207;&#12290;&#25105;&#20204;&#25512;&#23548;&#20102;&#26377;&#38480;&#26679;&#26412;&#21644;&#28176;&#36817;&#20445;&#35777;&#65292;&#24182;&#23637;&#31034;&#20102;&#26032;&#20272;&#35745;&#37327;&#30340;&#35823;&#24046;&#25910;&#25947;&#21040;&#21442;&#25968;&#36895;&#29575;&#19979;&#30340;&#38646;&#22343;&#20540;&#39640;&#26031;&#20998;&#24067;&#12290;&#27169;&#25311;&#32467;&#26524;&#23637;&#31034;&#20102;&#26412;&#25991;&#20998;&#26512;&#30340;&#20272;&#35745;&#37327;&#30340;&#24418;&#24335;&#29305;&#24615;&#30340;&#23454;&#38469;&#30456;&#20851;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.11652v1 Announce Type: cross  Abstract: This article introduces a new framework for estimating average treatment effects under unobserved confounding in modern data-rich environments featuring large numbers of units and outcomes. The proposed estimator is doubly robust, combining outcome imputation, inverse probability weighting, and a novel cross-fitting procedure for matrix completion. We derive finite-sample and asymptotic guarantees, and show that the error of the new estimator converges to a mean-zero Gaussian distribution at a parametric rate. Simulation results demonstrate the practical relevance of the formal properties of the estimators analyzed in this article.
&lt;/p&gt;</description></item><item><title>&#30740;&#31350;&#20102;&#19968;&#31181;&#20197;&#21253;&#35013;&#25104;&#26412;&#20026;&#20195;&#20215;&#30340;&#22810;&#20010;&#20114;&#34917;&#21697;&#30340;&#38144;&#21806;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#31038;&#20250;&#31119;&#21033;&#26368;&#22823;&#21270;&#30340;&#23494;&#23553;&#24335;&#31454;&#26631;&#25293;&#21334;&#65292;&#20445;&#35777;&#20844;&#24179;&#36879;&#26126;&#30340;&#23450;&#20215;&#24182;&#20855;&#26377;&#23545;&#24066;&#22330;&#38598;&#20013;&#30340;&#20559;&#22909;&#12290;</title><link>http://arxiv.org/abs/2306.14247</link><description>&lt;p&gt;
&#20197;&#21253;&#35013;&#25104;&#26412;&#20026;&#20195;&#20215;&#30340;&#22810;&#20010;&#20114;&#34917;&#21697;&#30340;&#38144;&#21806;
&lt;/p&gt;
&lt;p&gt;
Selling Multiple Complements with Packaging Costs. (arXiv:2306.14247v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.14247
&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#20102;&#19968;&#31181;&#20197;&#21253;&#35013;&#25104;&#26412;&#20026;&#20195;&#20215;&#30340;&#22810;&#20010;&#20114;&#34917;&#21697;&#30340;&#38144;&#21806;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#31038;&#20250;&#31119;&#21033;&#26368;&#22823;&#21270;&#30340;&#23494;&#23553;&#24335;&#31454;&#26631;&#25293;&#21334;&#65292;&#20445;&#35777;&#20844;&#24179;&#36879;&#26126;&#30340;&#23450;&#20215;&#24182;&#20855;&#26377;&#23545;&#24066;&#22330;&#38598;&#20013;&#30340;&#20559;&#22909;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#19968;&#31181;&#21253;&#35013;&#20998;&#37197;&#38382;&#39064;&#65292;&#20854;&#20013;&#22810;&#20010;&#19981;&#21487;&#20998;&#21106;&#29289;&#21697;&#20998;&#37197;&#32473;&#20010;&#20154;&#12290;&#21334;&#26041;&#23558;&#20998;&#37197;&#20559;&#22909;&#35268;&#23450;&#20026;&#21253;&#35013;&#19978;&#30340;&#25104;&#26412;&#33410;&#30465;&#12290;&#20316;&#32773;&#25552;&#20986;&#20102;&#19968;&#20010;&#31038;&#20250;&#31119;&#21033;&#26368;&#22823;&#21270;&#30340;&#23494;&#23553;&#24335;&#31454;&#26631;&#25293;&#21334;&#65292;&#20351;&#29992;&#26032;&#39062;&#30340;&#25104;&#26412;&#20989;&#25968;&#22270;&#34920;&#36798;&#21334;&#26041;&#20559;&#22909;&#65292;&#20419;&#36827;&#20351;&#29992;&#32447;&#24615;&#35268;&#21010;&#25214;&#21040;&#21311;&#21517;&#12289;&#26377;&#31454;&#20105;&#24615;&#12289;&#21253;&#32447;&#24615;&#20215;&#26684;&#12290;&#22914;&#26524;&#20195;&#29702;&#25353;&#23454;&#24773;&#31454;&#26631;&#65292;&#36825;&#20123;&#20215;&#26684;&#25903;&#25345;&#29926;&#23572;&#25289;&#26031;&#22343;&#34913;&#12290;&#20316;&#32773;&#25552;&#20379;&#20102;&#29926;&#23572;&#25289;&#26031;&#22343;&#34913;&#30340;&#24517;&#35201;&#26465;&#20214;&#21644;&#20805;&#20998;&#26465;&#20214;&#65292;&#24182;&#19988;&#25293;&#21334;&#20445;&#35777;&#20844;&#24179;&#36879;&#26126;&#30340;&#23450;&#20215;&#24182;&#20855;&#26377;&#23545;&#24066;&#22330;&#38598;&#20013;&#30340;&#20559;&#22909;&#12290;
&lt;/p&gt;
&lt;p&gt;
I consider a package assignment problem where multiple units of indivisible items are allocated among individuals. The seller specifies allocation preferences as cost savings on packages. I propose a social welfare maximising, sealed-bid auction with a novel cost function graph to express seller preferences. It facilitates the use of linear programming to find anonymous, competitive, package-linear prices. If agents bid truthfully, these prices support a Walrasian equilibrium. I provide necessary and sufficient conditions, and additional sufficient conditions, for the existence of Walrasian equilibria. The auction guarantees fair and transparent pricing and admits preferences over the market concentration.
&lt;/p&gt;</description></item></channel></rss>