<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#36825;&#31687;&#35770;&#25991;&#30740;&#31350;&#20102;&#19968;&#31181;&#26032;&#30340;&#20998;&#37197;&#38382;&#39064;&#65292;&#32771;&#34385;&#20102;&#20195;&#29702;&#30340;&#24207;&#25968;&#24378;&#24230;&#65292;&#25552;&#20986;&#20102;&#22522;&#20110;&#25490;&#21517;&#30340;&#20934;&#21017;&#65292;&#23450;&#20041;&#20102;&#24378;&#24230;&#39640;&#25928;&#30340;&#20998;&#37197;&#12290;&#35770;&#25991;&#21021;&#27493;&#35752;&#35770;&#20102;&#36825;&#31181;&#20998;&#37197;&#30340;&#23384;&#22312;&#24615;&#21644;&#38750;&#23384;&#22312;&#24615;&#12290;</title><link>https://arxiv.org/abs/2011.04306</link><description>&lt;p&gt;
&#24207;&#25968;&#24378;&#24230;&#39640;&#25928;&#20998;&#37197;
&lt;/p&gt;
&lt;p&gt;
Ordinal Intensity-Efficient Allocations
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2011.04306
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#30740;&#31350;&#20102;&#19968;&#31181;&#26032;&#30340;&#20998;&#37197;&#38382;&#39064;&#65292;&#32771;&#34385;&#20102;&#20195;&#29702;&#30340;&#24207;&#25968;&#24378;&#24230;&#65292;&#25552;&#20986;&#20102;&#22522;&#20110;&#25490;&#21517;&#30340;&#20934;&#21017;&#65292;&#23450;&#20041;&#20102;&#24378;&#24230;&#39640;&#25928;&#30340;&#20998;&#37197;&#12290;&#35770;&#25991;&#21021;&#27493;&#35752;&#35770;&#20102;&#36825;&#31181;&#20998;&#37197;&#30340;&#23384;&#22312;&#24615;&#21644;&#38750;&#23384;&#22312;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#20998;&#37197;&#38382;&#39064;&#65292;&#20854;&#20013;&#20195;&#29702;&#38500;&#20102;&#20855;&#26377;&#24207;&#25968;&#20559;&#22909;&#22806;&#65292;&#36824;&#20855;&#26377;"&#24207;&#25968;&#24378;&#24230;"&#65306;&#20182;&#20204;&#21487;&#20197;&#36827;&#34892;&#31616;&#21333;&#21644;&#20869;&#37096;&#19968;&#33268;&#30340;&#27604;&#36739;&#65292;&#20363;&#22914;&#8220;&#25105;&#26356;&#21916;&#27426;$a$&#32780;&#19981;&#26159;$b$&#65292;&#27604;&#25105;&#26356;&#21916;&#27426;$c$&#32780;&#19981;&#26159;$d$&#8221;&#65292;&#32780;&#19981;&#19968;&#23450;&#33021;&#22815;&#37327;&#21270;&#23427;&#20204;&#12290;&#22312;&#36825;&#31181;&#26032;&#30340;&#20449;&#24687;&#31038;&#20250;&#36873;&#25321;&#29615;&#22659;&#20013;&#65292;&#25105;&#20204;&#39318;&#20808;&#24341;&#20837;&#20102;&#19968;&#20010;&#22522;&#20110;&#25490;&#21517;&#30340;&#20934;&#21017;&#65292;&#20351;&#24471;&#21487;&#20197;&#36827;&#34892;&#36825;&#20123;&#24207;&#25968;&#24378;&#24230;&#30340;&#36328;&#20010;&#20154;&#27604;&#36739;&#12290;&#22522;&#20110;&#36825;&#20010;&#20934;&#21017;&#65292;&#25105;&#20204;&#23450;&#20041;&#20102;&#19968;&#31181;&#20998;&#37197;&#20026;&#8220;&#24378;&#24230;&#39640;&#25928;&#8221;&#65292;&#22914;&#26524;&#23427;&#22312;&#20195;&#29702;&#30340;&#24378;&#24230;&#24341;&#21457;&#30340;&#20559;&#22909;&#26041;&#38754;&#26159;&#24085;&#32047;&#25176;&#26377;&#25928;&#30340;&#65292;&#24182;&#19988;&#24403;&#21478;&#19968;&#31181;&#20998;&#37197;&#20197;&#30456;&#21516;&#30340;&#26041;&#24335;&#23558;&#30456;&#21516;&#30340;&#29289;&#21697;&#23545;&#20998;&#37197;&#32473;&#30456;&#21516;&#30340;&#20195;&#29702;&#23545;&#26102;&#65292;&#21069;&#19968;&#31181;&#20998;&#37197;&#23558;&#27599;&#23545;&#20013;&#26222;&#36941;&#26356;&#21463;&#20559;&#22909;&#30340;&#29289;&#21697;&#20998;&#37197;&#32473;&#26356;&#21916;&#27426;&#23427;&#30340;&#20195;&#29702;&#12290;&#25105;&#20204;&#22312;&#19981;&#23545;&#20559;&#22909;&#26045;&#21152;&#38480;&#21046;&#30340;&#24773;&#20917;&#19979;&#25552;&#20986;&#20102;&#20851;&#20110;&#36825;&#31181;&#20998;&#37197;&#30340;&#19968;&#20123;&#21021;&#27493;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study the assignment problem in situations where, in addition to having ordinal preferences, agents also have *ordinal intensities*: they can make simple and internally consistent comparisons such as "I prefer $a$ to $b$ more than I prefer $c$ to $d$" without necessarily being able to quantify them. In this new informational social-choice environment we first introduce a rank-based criterion that enables interpersonal comparability of such ordinal intensities. Building on this criterion, we define an allocation to be *"intensity-efficient"* if it is Pareto efficient with respect to the preferences induced by the agents' intensities and also such that, when another allocation assigns the same pairs of items to the same pairs of agents but in a "flipped" way, the former allocation assigns the commonly preferred item in every such pair to the agent who prefers it more. We present some first results on the (non-)existence of such allocations without imposing restrictions on preferences 
&lt;/p&gt;</description></item></channel></rss>