<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#24102;&#26377;&#38543;&#26426;&#20559;&#26012;&#30340;&#27874;&#21160;&#27169;&#22411;&#26469;&#27169;&#25311;&#21644;&#39044;&#27979;&#23439;&#35266;&#32463;&#27982;&#23614;&#37096;&#39118;&#38505;&#65292;&#24182;&#35777;&#26126;&#20102;&#36825;&#26159;&#19968;&#31181;&#26377;&#31454;&#20105;&#21147;&#30340;&#37327;&#21270;&#22238;&#24402;&#26367;&#20195;&#26041;&#27861;&#12290;&#30740;&#31350;&#36824;&#34920;&#26126;&#65292;&#26102;&#21464;&#20559;&#24230;&#26159;&#23439;&#35266;&#32463;&#27982;&#21644;&#37329;&#34701;&#20914;&#20987;&#30340;&#19968;&#20010;&#30456;&#20851;&#29305;&#24449;&#12290;</title><link>http://arxiv.org/abs/2306.09287</link><description>&lt;p&gt;
&#24102;&#26377;&#26102;&#21464;&#20559;&#24230;&#38543;&#26426;&#27874;&#21160;&#27169;&#22411;&#30340;&#23439;&#35266;&#32463;&#27982;&#39118;&#38505;&#24314;&#27169;&#21644;&#39044;&#27979;
&lt;/p&gt;
&lt;p&gt;
Modelling and Forecasting Macroeconomic Risk with Time Varying Skewness Stochastic Volatility Models. (arXiv:2306.09287v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.09287
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#24102;&#26377;&#38543;&#26426;&#20559;&#26012;&#30340;&#27874;&#21160;&#27169;&#22411;&#26469;&#27169;&#25311;&#21644;&#39044;&#27979;&#23439;&#35266;&#32463;&#27982;&#23614;&#37096;&#39118;&#38505;&#65292;&#24182;&#35777;&#26126;&#20102;&#36825;&#26159;&#19968;&#31181;&#26377;&#31454;&#20105;&#21147;&#30340;&#37327;&#21270;&#22238;&#24402;&#26367;&#20195;&#26041;&#27861;&#12290;&#30740;&#31350;&#36824;&#34920;&#26126;&#65292;&#26102;&#21464;&#20559;&#24230;&#26159;&#23439;&#35266;&#32463;&#27982;&#21644;&#37329;&#34701;&#20914;&#20987;&#30340;&#19968;&#20010;&#30456;&#20851;&#29305;&#24449;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#24102;&#26377;&#38543;&#26426;&#20559;&#24230;&#30340;&#20559;&#27491;&#24120;&#21644;&#20559;&#26012;t&#38663;&#33633;&#30340;&#38543;&#26426;&#27874;&#21160;&#27169;&#22411;&#30340;&#21442;&#25968;&#21270;&#26694;&#26550;&#65292;&#29992;&#20110;&#24314;&#27169;&#21644;&#39044;&#27979;&#23439;&#35266;&#32463;&#27982;&#23614;&#37096;&#39118;&#38505;&#12290;&#26412;&#25991;&#20026;&#36825;&#31181;&#31867;&#22411;&#30340;&#21333;&#21464;&#37327;&#21644;VAR&#27169;&#22411;&#24320;&#21457;&#20102;&#36125;&#21494;&#26031;&#20272;&#35745;&#30340;&#21518;&#39564;&#27169;&#25311;&#25277;&#26679;&#22120;&#12290;&#22312;&#19968;&#20010;&#24212;&#29992;&#20013;&#65292;&#25105;&#20351;&#29992;&#36825;&#20123;&#27169;&#22411;&#26469;&#39044;&#27979;GDP&#22686;&#38271;&#30340;&#19979;&#34892;&#39118;&#38505;&#65292;&#24182;&#35777;&#26126;&#36825;&#31181;&#26041;&#27861;&#26159;&#37327;&#21270;&#22238;&#24402;&#30340;&#19968;&#20010;&#26377;&#31454;&#20105;&#21147;&#30340;&#26367;&#20195;&#26041;&#27861;&#12290;&#26368;&#21518;&#65292;&#22312;&#32654;&#22269;&#25968;&#25454;&#19978;&#20272;&#35745;&#19968;&#20010;&#20013;&#31561;&#35268;&#27169;&#30340;VAR&#27169;&#22411;&#65292;&#25105;&#35777;&#26126;&#26102;&#21464;&#20559;&#24230;&#26159;&#23439;&#35266;&#32463;&#27982;&#21644;&#37329;&#34701;&#20914;&#20987;&#30340;&#19968;&#20010;&#30456;&#20851;&#29305;&#24449;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this paper I propose a parametric framework for modelling and forecasting macroeconomic tail risk based on stochastic volatility models with Skew-Normal and Skew-t shocks featuring stochastic skewness. The paper develops posterior simulation samplers for Bayesian estimation of both univariate and VAR models of this type. In an application, I use the models to predict downside risk to GDP growth and I show that this approach represents a competitive alternative to quantile regression. Finally, estimating a medium scale VAR on US data I show that time varying skewness is a relevant feature of macroeconomic and financial shocks.
&lt;/p&gt;</description></item><item><title>&#35813;&#30740;&#31350;&#24314;&#31435;&#20102;&#31227;&#27665;&#21171;&#24037;&#21450;&#20854;&#38599;&#20027;&#30340;&#20248;&#21270;&#26426;&#21046;&#27169;&#22411;&#65292;&#21457;&#29616;&#23487;&#20027;&#22269;&#30340;&#25216;&#33021;&#30456;&#20851;&#24615;&#21644;&#24037;&#36164;&#24046;&#24322;&#21576;&#27491;&#30456;&#20851;&#65292;&#31227;&#27665;&#22269;&#30340;&#25216;&#33021;&#30456;&#20851;&#24615;&#21644;&#24037;&#36164;&#24046;&#24322;&#21576;&#36127;&#30456;&#20851;&#12290;&#36825;&#20026;&#25506;&#32034;&#31227;&#27665;&#21171;&#21160;&#21147;&#24066;&#22330;&#25552;&#20379;&#20102;&#37325;&#35201;&#30340;&#21442;&#32771;&#12290;</title><link>http://arxiv.org/abs/2306.08829</link><description>&lt;p&gt;
&#23601;&#19994;&#35768;&#21487;&#21046;&#24230;&#65288;EPS&#65289;&#19979;&#31227;&#27665;&#21171;&#24037;&#30340;&#20248;&#21270;&#26426;&#21046;&#65306;&#24341;&#20837;&#21644;&#20998;&#26512;&#8220;&#25216;&#33021;&#30456;&#20851;&#24615;&#33258;&#25105;&#36873;&#25321;&#8221;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
Migrant Laborer's Optimization Mechanism Under Employment Permit System(EPS): Introducing and Analyzing 'Skill-Relevance-Self Selection' Model. (arXiv:2306.08829v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.08829
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#24314;&#31435;&#20102;&#31227;&#27665;&#21171;&#24037;&#21450;&#20854;&#38599;&#20027;&#30340;&#20248;&#21270;&#26426;&#21046;&#27169;&#22411;&#65292;&#21457;&#29616;&#23487;&#20027;&#22269;&#30340;&#25216;&#33021;&#30456;&#20851;&#24615;&#21644;&#24037;&#36164;&#24046;&#24322;&#21576;&#27491;&#30456;&#20851;&#65292;&#31227;&#27665;&#22269;&#30340;&#25216;&#33021;&#30456;&#20851;&#24615;&#21644;&#24037;&#36164;&#24046;&#24322;&#21576;&#36127;&#30456;&#20851;&#12290;&#36825;&#20026;&#25506;&#32034;&#31227;&#27665;&#21171;&#21160;&#21147;&#24066;&#22330;&#25552;&#20379;&#20102;&#37325;&#35201;&#30340;&#21442;&#32771;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21463;&#38889;&#22269;&#23601;&#19994;&#35768;&#21487;&#21046;&#24230; (EPS) &#32422;&#26463;&#30340;&#31227;&#27665;&#21171;&#24037;&#24517;&#39035;&#22312;&#32771;&#34385;&#8220;&#31227;&#27665;&#24102;&#26469;&#30340;&#25216;&#33021;&#30456;&#20851;&#24615;&#36140;&#20540;&#8221;&#21644;&#8220;&#31227;&#27665;&#25104;&#26412;&#8221;&#30340;&#21516;&#26102;&#65292;&#22312;&#23487;&#20027;&#22269;&#30340;&#39640;&#24037;&#36164;&#19982;&#20043;&#38388;&#21462;&#24471;&#24179;&#34913;&#12290;&#26412;&#30740;&#31350;&#24314;&#31435;&#20102;&#31227;&#27665;&#21171;&#24037;&#21450;&#38599;&#20323;&#20182;&#20204;&#30340;&#20844;&#21496;&#30340;&#20248;&#21270;&#26426;&#21046;&#27169;&#22411;&#65292;&#24182;&#21033;&#29992;&#21338;&#24328;&#35770;&#30340;&#8220;&#21453;&#21521;&#24402;&#32435;&#8221;&#26041;&#27861;&#24471;&#21040;&#20102;&#27169;&#22411;&#30340;&#35299;&#65292;&#21363;&#36798;&#21040;&#8220;&#23376;&#21338;&#24328;&#23436;&#32654;&#32435;&#20160;&#22343;&#34913; (SPNE)&#8221;&#12290;&#36890;&#36807;&#20998;&#26512; SPNE &#29366;&#24577;&#19979;&#21464;&#37327;&#20043;&#38388;&#30340;&#21160;&#24577;&#20851;&#31995;&#65292;&#24471;&#20986;&#20102;&#20197;&#19979;&#26679;&#24335;&#21270;&#20107;&#23454;&#65306;[1]&#23487;&#20027;&#22269;&#30340;&#25216;&#33021;&#30456;&#20851;&#24615;&#21644;&#24037;&#36164;&#24046;&#24322;&#21576;&#27491;&#30456;&#20851;&#65307;[2]&#31227;&#27665;&#22269;&#30340;&#25216;&#33021;&#30456;&#20851;&#24615;&#21644;&#24037;&#36164;&#24046;&#24322;&#21576;&#36127;&#30456;&#20851;&#12290;&#36825;&#20004;&#20010;&#26679;&#24335;&#21270;&#20107;&#23454;&#8212;&#8212;[1&#12289;2]&#8212;&#8212;&#20998;&#21035;&#34987;&#25805;&#20316;&#21270;&#20026;&#8220;&#23487;&#20027;&#22269;&#25216;&#33021;&#30456;&#20851;&#24615;&#20551;&#35828; (H1)&#8221;&#21644;&#8220;&#31227;&#27665;&#22269;&#25216;&#33021;&#30456;&#20851;&#24615;&#20551;&#35828; (H2)&#8221;&#65292;&#24182;&#36890;&#36807;OLS&#32447;&#24615;&#22238;&#24402;&#20998;&#26512;&#36827;&#34892;&#20102;&#24443;&#24213;&#30340;&#26816;&#39564;&#12290;
&lt;/p&gt;
&lt;p&gt;
Migrant laborers subject to ROK's Employment Permit System(EPS) must strike a balance between host country's high wage and 'Depreciation of skill-relevance entailed by immigration', whilst taking account of the 'migration costs'. This study modelizes the optimization mechanism of migrant workers and the firms hiring them -- then induces the solution of the very model, namely, 'Subgame Perfect Nash Equilibrium(SPNE)', by utilizing game theory's 'backward induction' method. Analyzing the dynamics between variables at SPNE state, the attained stylized facts are what as follows; [1]Host nation's skill-relevance and wage differential have positive correlation. [2]Emigrating nation's skill-relevance and wage differential have negative correlation. Both stylized facts -- [1,2] -- are operationalized into 'Host nation skill-relevance hypothesis(H1)' and 'Emigrating nation skill-relevance hypothesis(H2)', respectively; of which are thoroughly tested by OLS linear regression analysis. In all sex
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#38024;&#23545;&#24052;&#35199;&#65292;&#21033;&#29992;2003&#24180;&#33267;2017&#24180;&#26399;&#38388;&#30340;&#38599;&#20027;-&#21592;&#24037;&#35760;&#24405;&#21644;&#20225;&#19994;&#31246;&#21153;&#20449;&#24687;&#30740;&#31350;&#20102;&#24182;&#36141;&#23545;&#21171;&#21160;&#24066;&#22330;&#30340;&#24433;&#21709;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#24182;&#36141;&#20250;&#23548;&#33268;&#24066;&#22330;&#35268;&#27169;&#19979;&#38477;&#65292;&#38599;&#20323;&#35843;&#25972;&#38598;&#20013;&#22312;&#21512;&#24182;&#20225;&#19994;&#20013;&#65292;&#32780;&#19981;&#28041;&#21450;&#24182;&#36141;&#30340;&#20225;&#19994;&#24037;&#20154;&#25910;&#20837;&#19979;&#38477;&#65292;&#35268;&#27169;&#22686;&#38271;&#12290;&#22823;&#22810;&#25968;&#24182;&#36141;&#23545;&#20110;&#24066;&#22330;&#21344;&#26377;&#24230;&#30340;&#21464;&#21270;&#27809;&#26377;&#39044;&#27979;&#24433;&#21709;&#12290;&#22312;&#24052;&#35199;&#21171;&#21160;&#24066;&#22330;&#27809;&#26377;&#21457;&#29616;&#23521;&#22836;&#22404;&#26029;&#34892;&#20026;&#30340;&#35777;&#25454;&#12290;</title><link>http://arxiv.org/abs/2306.08797</link><description>&lt;p&gt;
&#21457;&#23637;&#20013;&#22269;&#23478;&#20013;&#24182;&#36141;&#23545;&#26412;&#22320;&#21171;&#21160;&#24066;&#22330;&#30340;&#24433;&#21709;&#65306;&#20197;&#24052;&#35199;&#20026;&#20363;
&lt;/p&gt;
&lt;p&gt;
Local Labor Market Effects of Mergers and Acquisitions in Developing Countries: Evidence from Brazil. (arXiv:2306.08797v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.08797
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#38024;&#23545;&#24052;&#35199;&#65292;&#21033;&#29992;2003&#24180;&#33267;2017&#24180;&#26399;&#38388;&#30340;&#38599;&#20027;-&#21592;&#24037;&#35760;&#24405;&#21644;&#20225;&#19994;&#31246;&#21153;&#20449;&#24687;&#30740;&#31350;&#20102;&#24182;&#36141;&#23545;&#21171;&#21160;&#24066;&#22330;&#30340;&#24433;&#21709;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#24182;&#36141;&#20250;&#23548;&#33268;&#24066;&#22330;&#35268;&#27169;&#19979;&#38477;&#65292;&#38599;&#20323;&#35843;&#25972;&#38598;&#20013;&#22312;&#21512;&#24182;&#20225;&#19994;&#20013;&#65292;&#32780;&#19981;&#28041;&#21450;&#24182;&#36141;&#30340;&#20225;&#19994;&#24037;&#20154;&#25910;&#20837;&#19979;&#38477;&#65292;&#35268;&#27169;&#22686;&#38271;&#12290;&#22823;&#22810;&#25968;&#24182;&#36141;&#23545;&#20110;&#24066;&#22330;&#21344;&#26377;&#24230;&#30340;&#21464;&#21270;&#27809;&#26377;&#39044;&#27979;&#24433;&#21709;&#12290;&#22312;&#24052;&#35199;&#21171;&#21160;&#24066;&#22330;&#27809;&#26377;&#21457;&#29616;&#23521;&#22836;&#22404;&#26029;&#34892;&#20026;&#30340;&#35777;&#25454;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#21033;&#29992;2003&#24180;&#33267;2017&#24180;&#26399;&#38388;&#21305;&#37197;&#30340;&#38599;&#20027;-&#21592;&#24037;&#35760;&#24405;&#21644;&#20225;&#19994;&#31246;&#21153;&#20449;&#24687;&#65292;&#20272;&#35745;&#20102;&#24052;&#35199;&#24182;&#36141;&#23545;&#25972;&#20010;&#21171;&#21160;&#24066;&#22330;&#30340;&#24433;&#21709;&#12290;&#23558;&#21171;&#21160;&#24066;&#22330;&#23450;&#20041;&#20026;&#36890;&#21220;&#21306;&#21644;&#34892;&#19994;&#37096;&#38376;&#30340;&#32452;&#21512;&#12290;&#24182;&#36141;&#30340;&#19979;&#19968;&#24180;&#65292;&#24066;&#22330;&#35268;&#27169;&#19979;&#38477;&#20102;10.8%&#12290;&#38599;&#20323;&#35843;&#25972;&#38598;&#20013;&#22312;&#21512;&#24182;&#20225;&#19994;&#20013;&#12290;&#23545;&#20110;&#26410;&#28041;&#21450;&#24182;&#36141;&#30340;&#20225;&#19994;&#65292;&#25105;&#20272;&#35745;&#24037;&#20154;&#25910;&#20837;&#19979;&#38477;&#20102;1.07&#65285;&#65292;&#20294;&#35268;&#27169;&#21576;&#27491;&#22686;&#38271;&#36235;&#21183;&#65292;&#23613;&#31649;&#27809;&#26377;&#26174;&#33879;&#22686;&#38271;&#12290;&#22823;&#22810;&#25968;&#24182;&#36141;&#23545;&#20110;&#24066;&#22330;&#21344;&#26377;&#24230;&#30340;&#21464;&#21270;&#27809;&#26377;&#39044;&#27979;&#24433;&#21709;&#65292;&#20197;&#21704;&#22827;&#26364;-&#36203;&#24076;&#26364;&#25351;&#25968;&#65288;HHI&#65289;&#20026;&#34913;&#37327;&#26631;&#20934;&#12290;&#23545;&#20110;&#38468;&#24102;&#25928;&#24212;&#30340;&#20225;&#19994;&#26469;&#35828;&#65292;&#19982;HHI&#21464;&#21270;&#26174;&#33879;&#24615;&#30456;&#27604;&#65292;&#25910;&#20837;&#19979;&#38477;&#24773;&#20917;&#30456;&#20284;&#12290;&#19982;&#21457;&#36798;&#32463;&#27982;&#20307;&#24066;&#22330;&#21344;&#26377;&#24230;&#26368;&#36817;&#30340;&#25991;&#29486;&#30456;&#21453;&#65292;&#22312;&#24052;&#35199;&#21171;&#21160;&#24066;&#22330;&#27809;&#26377;&#23521;&#22836;&#22404;&#26029;&#34892;&#20026;&#30340;&#35777;&#25454;&#12290;
&lt;/p&gt;
&lt;p&gt;
I use matched employer-employee records merged with corporate tax information from 2003 to 2017 to estimate labor market-wide effects of mergers and acquisitions in Brazil. Labor markets are defined by pairs of commuting zone and industry sector. In the following year of a merger, market size falls by 10.8%. The employment adjustment is concentrated in merging firms. For the firms not involved in M&amp;As, I estimate a 1.07% decline in workers earnings and a positive, although not significant, increase in their size. Most mergers have a predicted impact of zero points in concentration, measured by the Herfindahl-Hirschman Index (HHI). I spillover firms, earnings decline similarly for mergers with high and low predicted changes in HHI. Contrary to the recent literature on market concentration in developed economies, I find no evidence of oligopsonistic behavior in Brazilian labor markets.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#23545;&#23450;&#37327;&#34913;&#37327;&#21516;&#36136;&#20135;&#19994;&#20869;&#36164;&#28304;&#38169;&#37197;&#30340;&#24120;&#35268;&#26041;&#27861;&#36827;&#34892;&#20102;&#37325;&#26032;&#35780;&#20272;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#24050;&#35782;&#21035;&#30340;&#25919;&#31574;&#21464;&#21270;&#30340;&#27604;&#36739;&#20998;&#26512;&#31574;&#30053;&#12290;&#30740;&#31350;&#34920;&#26126;&#65292;&#37329;&#34701;&#21361;&#26426;&#23545;&#29983;&#20135;&#35201;&#32032;&#30340;&#24433;&#21709;&#23548;&#33268;&#36164;&#28304;&#37197;&#32622;&#20005;&#37325;&#22833;&#35843;&#65292;&#32780;&#25919;&#31574;&#24178;&#39044;&#21487;&#33021;&#20250;&#25439;&#23475;&#25972;&#20307;&#32463;&#27982;&#25928;&#29575;&#12290;</title><link>http://arxiv.org/abs/2306.08760</link><description>&lt;p&gt;
&#29983;&#20135;&#29575;&#12289;&#35201;&#32032;&#38169;&#37197;&#19982;&#37329;&#34701;&#21361;&#26426;
&lt;/p&gt;
&lt;p&gt;
Productivity, Inputs Misallocation, and the Financial Crisis. (arXiv:2306.08760v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.08760
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#23545;&#23450;&#37327;&#34913;&#37327;&#21516;&#36136;&#20135;&#19994;&#20869;&#36164;&#28304;&#38169;&#37197;&#30340;&#24120;&#35268;&#26041;&#27861;&#36827;&#34892;&#20102;&#37325;&#26032;&#35780;&#20272;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#24050;&#35782;&#21035;&#30340;&#25919;&#31574;&#21464;&#21270;&#30340;&#27604;&#36739;&#20998;&#26512;&#31574;&#30053;&#12290;&#30740;&#31350;&#34920;&#26126;&#65292;&#37329;&#34701;&#21361;&#26426;&#23545;&#29983;&#20135;&#35201;&#32032;&#30340;&#24433;&#21709;&#23548;&#33268;&#36164;&#28304;&#37197;&#32622;&#20005;&#37325;&#22833;&#35843;&#65292;&#32780;&#25919;&#31574;&#24178;&#39044;&#21487;&#33021;&#20250;&#25439;&#23475;&#25972;&#20307;&#32463;&#27982;&#25928;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#37325;&#26032;&#35780;&#20272;&#20102;&#23450;&#37327;&#34913;&#37327;&#21516;&#36136;&#20135;&#19994;&#20869;&#36164;&#28304;&#38169;&#37197;&#30340;&#24120;&#35268;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#36890;&#24120;&#20351;&#29992;&#19968;&#20010;&#36755;&#20837;&#36793;&#38469;&#20135;&#21697;&#30340;&#31163;&#25955;&#24230;&#26469;&#34913;&#37327;&#12290;&#25105;&#30340;&#30740;&#31350;&#21457;&#29616;&#65292;&#36825;&#19968;&#32479;&#35745;&#37327;&#21253;&#25324;&#22266;&#26377;&#30340;&#29983;&#20135;&#29575;&#24322;&#36136;&#24615;&#21644;&#29305;&#26377;&#30340;&#29983;&#20135;&#29575;&#20914;&#20987;&#65292;&#32780;&#19981;&#32771;&#34385;&#25152;&#30740;&#31350;&#30340;&#36755;&#20837;&#12290;&#21033;&#29992;&#32654;&#22269;&#21644;&#27431;&#27954;&#21046;&#36896;&#19994;&#20844;&#21496;&#30340;&#36164;&#20135;&#36127;&#20538;&#34920;&#25968;&#25454;&#65292;&#25105;&#21457;&#29616;&#24635;&#29983;&#20135;&#35201;&#32032;&#29983;&#20135;&#29575;&#27874;&#21160;&#20540;&#21344;&#36164;&#26412;&#36793;&#38469;&#20135;&#21697;&#30340;&#26041;&#24046;&#30340;7&#65285;&#65292;&#21171;&#21160;&#21147;&#20026;9&#65285;&#65292;&#26448;&#26009;&#36755;&#20837;&#20026;10&#65285;&#12290;&#22240;&#27492;&#65292;&#36825;&#20010;&#25351;&#25968;&#20197;&#34920;&#38754;&#20215;&#20540;&#34920;&#31034;&#26102;&#65292;&#26080;&#27861;&#35782;&#21035;&#20986;&#20219;&#20309;&#29983;&#20135;&#35201;&#32032;&#30340;&#25919;&#31574;&#24341;&#21457;&#30340;&#38169;&#37197;&#12290;&#20026;&#20102;&#20811;&#26381;&#36825;&#19968;&#23616;&#38480;&#24615;&#65292;&#25105;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#24050;&#35782;&#21035;&#30340;&#25919;&#31574;&#21464;&#21270;&#30340;&#27604;&#36739;&#20998;&#26512;&#31574;&#30053;&#12290;&#36825;&#31181;&#26041;&#27861;&#20801;&#35768;&#30740;&#31350;&#20154;&#21592;&#22312;&#30456;&#23545;&#30340;&#26465;&#20214;&#19979;&#35780;&#20272;&#35825;&#23548;&#22833;&#37197;&#65292;&#21516;&#26102;&#25511;&#21046;TFP&#27874;&#21160;&#24615;&#30340;&#24046;&#24322;&#12290;&#25105;&#21457;&#29616;&#37329;&#34701;&#21361;&#26426;&#23545;&#29983;&#20135;&#35201;&#32032;&#30340;&#24433;&#21709;&#26159;&#19981;&#22343;&#34913;&#30340;&#65292;&#23548;&#33268;&#36164;&#28304;&#37197;&#32622;&#20005;&#37325;&#22833;&#35843;&#12290;&#36890;&#36807;&#27604;&#36739;&#19981;&#21516;&#22320;&#21306;&#21644;&#34892;&#19994;&#30340;&#37329;&#34701;&#21361;&#26426;&#21069;&#21644;&#37329;&#34701;&#21361;&#26426;&#26399;&#38388;&#65292;&#32463;&#27982;&#37329;&#34701;&#29615;&#22659;&#31283;&#23450;&#30340;&#24773;&#20917;&#65292;&#25105;&#21457;&#29616;&#37329;&#34701;&#21361;&#26426;&#23545;&#21046;&#36896;&#19994;&#30340;&#36127;&#38754;&#24433;&#21709;&#27604;&#26381;&#21153;&#19994;&#26356;&#20026;&#26126;&#26174;&#65292;&#23545;&#27431;&#27954;&#19994;&#21153;&#26356;&#20026;&#20005;&#37325;&#65292;&#32780;&#19988;&#36825;&#31181;&#22833;&#35843;&#26159;&#30001;&#20110;&#37329;&#34701;&#32039;&#32553;&#25919;&#31574;&#24341;&#36215;&#30340;&#12290;&#36825;&#19968;&#30740;&#31350;&#34920;&#26126;&#65292;&#25919;&#31574;&#24178;&#39044;&#21487;&#33021;&#20250;&#23548;&#33268;&#36164;&#28304;&#37197;&#32622;&#22833;&#35843;&#65292;&#25439;&#23475;&#25972;&#20307;&#32463;&#27982;&#25928;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper reevaluates the conventional approach to quantifying within-industry resource misallocation, typically measured by the dispersion of an input marginal product. My findings suggest that this statistic incorporates inherent productivity heterogeneity and idiosyncratic productivity shocks, irrespective of the input under scrutiny. Using balance sheet data from American and European manufacturing firms, I show that total factor productivity (TFP) volatility accounts for 7% of the variance in the marginal product of capital, 9% for labor, and 10% for material inputs. Consequently, this index, taken at face value, fails to identify policy-induced misallocation for any production input. To overcome this limitation, I propose a comparative analysis strategy driven by an identified policy variation. This approach allows the researcher to assess induced misallocation in relative terms whilst controlling for differences in TFP volatility. I show that the financial crisis had an uneven 
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#36890;&#36807;&#23545;&#38889;&#22269;&#21830;&#19994;&#38598;&#22242;&#30340;&#25991;&#29486;&#35745;&#37327;&#20998;&#26512;&#65292;&#25506;&#35752;&#20102;&#36130;&#38400;&#23545;&#38889;&#22269;&#32463;&#27982;&#30340;&#24433;&#21709;&#65292;&#22635;&#34917;&#20102;&#35813;&#39046;&#22495;&#30340;&#30693;&#35782;&#31354;&#30333;&#12290;</title><link>http://arxiv.org/abs/2306.08743</link><description>&lt;p&gt;
&#38889;&#22269;&#36130;&#38400;&#30340;&#23835;&#36215;&#65306;&#23545;&#21830;&#19994;&#38598;&#22242;&#30340;&#25991;&#29486;&#35745;&#37327;&#20998;&#26512;
&lt;/p&gt;
&lt;p&gt;
The rise of the chaebol: A bibliometric analysis of business groups in South Korea. (arXiv:2306.08743v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.08743
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36890;&#36807;&#23545;&#38889;&#22269;&#21830;&#19994;&#38598;&#22242;&#30340;&#25991;&#29486;&#35745;&#37327;&#20998;&#26512;&#65292;&#25506;&#35752;&#20102;&#36130;&#38400;&#23545;&#38889;&#22269;&#32463;&#27982;&#30340;&#24433;&#21709;&#65292;&#22635;&#34917;&#20102;&#35813;&#39046;&#22495;&#30340;&#30693;&#35782;&#31354;&#30333;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38889;&#22269;&#24050;&#25104;&#20026;&#20122;&#27954;&#26368;&#37325;&#35201;&#30340;&#32463;&#27982;&#20307;&#20043;&#19968;&#12290;&#26368;&#22823;&#30340;&#38889;&#22269;&#36328;&#22269;&#20844;&#21496;&#19982;&#23500;&#26377;&#24433;&#21709;&#21147;&#30340;&#23478;&#26063;&#20225;&#19994;&#38598;&#22242;&#8212;&#8212;&#36130;&#38400;&#26377;&#25152;&#20851;&#32852;&#12290;&#23613;&#31649;&#36130;&#38400;&#30340;&#23398;&#26415;&#30740;&#31350;&#36234;&#26469;&#36234;&#21463;&#27426;&#36814;&#65292;&#20294;&#22312;&#23545;&#38889;&#22269;&#21830;&#19994;&#38598;&#22242;&#30340;&#25991;&#29486;&#35745;&#37327;&#20998;&#26512;&#20013;&#20173;&#23384;&#22312;&#30456;&#24403;&#22823;&#30340;&#30693;&#35782;&#31354;&#32570;&#12290;&#20026;&#20102;&#22635;&#34917;&#36825;&#19968;&#31354;&#32570;&#65292;&#26412;&#25991;&#26088;&#22312;&#23545;&#36130;&#38400;&#36827;&#34892;&#31995;&#32479;&#22238;&#39038;&#65292;&#24182;&#20998;&#26512;&#21830;&#19994;&#38598;&#22242;&#22312;&#38889;&#22269;&#32463;&#27982;&#20013;&#25198;&#28436;&#30340;&#35282;&#33394;&#12290;&#37319;&#29992;&#20102;&#19977;&#31181;&#19981;&#21516;&#30340;&#25991;&#29486;&#35745;&#37327;&#32593;&#32476;&#20998;&#26512;&#26041;&#27861;&#65292;&#21363;&#31185;&#23398;&#21512;&#20316;&#32593;&#32476;&#20998;&#26512;&#65292;&#25991;&#29486;&#32806;&#21512;&#32593;&#32476;&#20998;&#26512;&#21644;&#20851;&#38190;&#35789;&#20849;&#29616;&#32593;&#32476;&#20998;&#26512;&#12290;
&lt;/p&gt;
&lt;p&gt;
South Korea has become one of the most important economies in Asia. The largest Korean multinational firms are affiliated with influential family-owned business groups known as the chaebol. Despite the surging academic popularity of the chaebol, there is a considerable knowledge gap in the bibliometric analysis of business groups in Korea. In an attempt to fill this gap, the article aims to provide a systematic review of the chaebol and the role that business groups have played in the economy of Korea. Three distinct bibliometric networks are analyzed, namely the scientific collaboration network, bibliographic coupling network, and keyword co-occurrence network.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#20004;&#31181;&#36866;&#29992;&#20110;&#32858;&#31867;&#25968;&#25454;&#30340;&#24037;&#20855;&#21464;&#37327;&#27169;&#22411;&#30340;&#40065;&#26834;&#26816;&#39564;&#65292;&#32858;&#31867;&#27178;&#20999;&#23433;&#24503;&#26862;-&#40065;&#23486;&#35797;&#39564;&#21644;&#32858;&#31867;&#22810;&#24037;&#20855;&#23433;&#24503;&#26862;-&#40065;&#23486;&#35797;&#39564;&#12290;&#36825;&#20123;&#27979;&#35797;&#33021;&#22815;&#22788;&#29702;&#32858;&#31867;&#20381;&#36182;&#12289;&#22810;&#24037;&#20855;&#21644;&#24369;&#35782;&#21035;&#24773;&#20917;&#19979;&#30340;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2306.08559</link><description>&lt;p&gt;
&#32858;&#31867;&#20381;&#36182;&#12289;&#22810;&#24037;&#20855;&#21644;&#24369;&#35782;&#21035;&#19979;&#30340;&#24037;&#20855;&#21464;&#37327;&#27169;&#22411;&#25512;&#26029;
&lt;/p&gt;
&lt;p&gt;
Inference in IV models with clustered dependence, many instruments and weak identification. (arXiv:2306.08559v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.08559
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#20004;&#31181;&#36866;&#29992;&#20110;&#32858;&#31867;&#25968;&#25454;&#30340;&#24037;&#20855;&#21464;&#37327;&#27169;&#22411;&#30340;&#40065;&#26834;&#26816;&#39564;&#65292;&#32858;&#31867;&#27178;&#20999;&#23433;&#24503;&#26862;-&#40065;&#23486;&#35797;&#39564;&#21644;&#32858;&#31867;&#22810;&#24037;&#20855;&#23433;&#24503;&#26862;-&#40065;&#23486;&#35797;&#39564;&#12290;&#36825;&#20123;&#27979;&#35797;&#33021;&#22815;&#22788;&#29702;&#32858;&#31867;&#20381;&#36182;&#12289;&#22810;&#24037;&#20855;&#21644;&#24369;&#35782;&#21035;&#24773;&#20917;&#19979;&#30340;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25968;&#25454;&#32858;&#31867;&#20250;&#38477;&#20302;&#26377;&#25928;&#26679;&#26412;&#37327;&#65292;&#20351;&#24471;&#24037;&#20855;&#21464;&#37327;&#27169;&#22411;&#30340;&#25512;&#26029;&#26356;&#20005;&#26684;&#65292;&#24037;&#20855;&#25968;&#37327;&#19982;&#26377;&#25928;&#26679;&#26412;&#37327;&#30340;&#27604;&#20540;&#26356;&#24555;&#22320;&#38750;&#24120;&#25509;&#36817;&#12290;&#32858;&#31867;&#25968;&#25454;&#22240;&#27492;&#22686;&#21152;&#20102;&#23545;&#35768;&#22810;&#21644;&#24369;&#24037;&#20855;&#40065;&#26834;&#27979;&#35797;&#30340;&#38656;&#27714;&#12290;&#28982;&#32780;&#65292;&#20043;&#21069;&#24320;&#21457;&#30340;&#25152;&#26377;&#35768;&#22810;&#21644;&#24369;&#24037;&#20855;&#40065;&#26834;&#27979;&#35797;&#37117;&#19981;&#33021;&#24212;&#29992;&#20110;&#36825;&#31181;&#25968;&#25454;&#65292;&#22240;&#20026;&#23427;&#20204;&#25152;&#26377;&#37117;&#38656;&#35201;&#29420;&#31435;&#35266;&#27979;&#20540;&#12290;&#22240;&#27492;&#65292;&#26412;&#25991;&#38024;&#23545;&#32858;&#31867;&#25968;&#25454;&#36866;&#24212;&#20102;&#20004;&#20010;&#36825;&#26679;&#30340;&#27979;&#35797;&#12290;&#31532;&#19968;&#65292;&#36890;&#36807;&#20174;&#23433;&#24503;&#26862;-&#40065;&#23486;&#32479;&#35745;&#37327;&#20013;&#21024;&#38500;&#32858;&#31867;&#32780;&#19981;&#26159;&#20010;&#20307;&#35266;&#27979;&#20540;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#32858;&#31867;&#21315;&#20992;&#19975;&#21072;&#30340;&#23433;&#24503;&#26862;-&#40065;&#23486;&#26816;&#39564;&#12290;&#31532;&#20108;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#32858;&#31867;&#22810;&#24037;&#20855;&#23433;&#24503;&#26862;-&#40065;&#23486;&#26816;&#39564;&#65292;&#36890;&#36807;&#20351;&#29992;&#26356;&#20248;&#20294;&#26356;&#22797;&#26434;&#30340;&#21152;&#26435;&#30697;&#38453;&#26469;&#25913;&#21892;&#31532;&#19968;&#20010;&#27979;&#35797;&#12290;&#25105;&#35777;&#26126;&#20102;&#65292;&#22914;&#26524;&#32858;&#31867;&#28385;&#36275;&#19981;&#21464;&#24615;&#20551;&#35774;&#65292;&#21017;&#36825;&#20123;&#27979;&#35797;&#30340;&#32622;&#20449;&#21306;&#38388;&#26159;&#26377;&#25928;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
Data clustering reduces the effective sample size down from the number of observations towards the number of clusters. For instrumental variable models this implies more restrictive requirements on the strength of the instruments and makes the number of instruments more quickly non-negligible compared to the effective sample size. Clustered data therefore increases the need for many and weak instrument robust tests. However, none of the previously developed many and weak instrument robust tests can be applied to this type of data as they all require independent observations. I therefore adapt two of such tests to clustered data. First, I derive a cluster jackknife Anderson-Rubin test by removing clusters rather than individual observations from the Anderson-Rubin statistic. Second, I propose a cluster many instrument Anderson-Rubin test which improves on the first test by using a more optimal, but more complex, weighting matrix. I show that if the clusters satisfy an invariance assumpt
&lt;/p&gt;</description></item><item><title>2022&#24180;&#22799;&#23395;&#65292;&#24503;&#22269;&#25919;&#24220;&#24320;&#23637;&#20102;&#19968;&#39033;&#23454;&#39564;&#65292;&#40723;&#21169;&#23621;&#27665;&#22312;&#19977;&#20010;&#26376;&#20869;&#36873;&#25321;&#25903;&#20184;&#27599;&#26376;9&#27431;&#20803;&#30340;&#20840;&#22269;&#20844;&#20849;&#20132;&#36890;&#31080;&#65292;&#20197;&#32531;&#35299;&#23478;&#24237;&#36130;&#21153;&#21387;&#21147;&#12290;&#36825;&#26159;&#19968;&#39033;&#20132;&#36890;&#25919;&#31574;&#30740;&#31350;&#20013;&#21069;&#25152;&#26410;&#26377;&#30340;&#22823;&#35268;&#27169;&#34892;&#20026;&#23454;&#39564;&#65292;&#26088;&#22312;&#30740;&#31350;&#20132;&#36890;&#20986;&#34892;&#26041;&#24335;&#21644;&#24037;&#20855;&#30340;&#26377;&#25928;&#24615;&#12290;</title><link>http://arxiv.org/abs/2306.08297</link><description>&lt;p&gt;
2022&#24180;&#24503;&#22269;&#20840;&#22269;&#24615;&#30340;&#26053;&#34892;&#23454;&#39564;&#65306;&#27599;&#26376;9&#27431;&#20803;&#30340;&#20844;&#20849;&#20132;&#36890;&#8212;&#8212;&#20851;&#20110;&#19968;&#39033;&#23454;&#35777;&#30740;&#31350;&#30340;&#39318;&#27425;&#21457;&#29616;
&lt;/p&gt;
&lt;p&gt;
Germany's nationwide travel experiment in 2022: public transport for 9 Euro per month -- First findings of an empirical study. (arXiv:2306.08297v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.08297
&lt;/p&gt;
&lt;p&gt;
2022&#24180;&#22799;&#23395;&#65292;&#24503;&#22269;&#25919;&#24220;&#24320;&#23637;&#20102;&#19968;&#39033;&#23454;&#39564;&#65292;&#40723;&#21169;&#23621;&#27665;&#22312;&#19977;&#20010;&#26376;&#20869;&#36873;&#25321;&#25903;&#20184;&#27599;&#26376;9&#27431;&#20803;&#30340;&#20840;&#22269;&#20844;&#20849;&#20132;&#36890;&#31080;&#65292;&#20197;&#32531;&#35299;&#23478;&#24237;&#36130;&#21153;&#21387;&#21147;&#12290;&#36825;&#26159;&#19968;&#39033;&#20132;&#36890;&#25919;&#31574;&#30740;&#31350;&#20013;&#21069;&#25152;&#26410;&#26377;&#30340;&#22823;&#35268;&#27169;&#34892;&#20026;&#23454;&#39564;&#65292;&#26088;&#22312;&#30740;&#31350;&#20132;&#36890;&#20986;&#34892;&#26041;&#24335;&#21644;&#24037;&#20855;&#30340;&#26377;&#25928;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
2022&#24180;&#26149;&#23395;&#65292;&#24503;&#22269;&#32852;&#37030;&#25919;&#24220;&#21516;&#24847;&#20102;&#19968;&#31995;&#21015;&#26088;&#22312;&#20943;&#36731;&#23478;&#24237;&#36130;&#21153;&#36127;&#25285;&#30340;&#25919;&#31574;&#25514;&#26045;&#65292;&#23588;&#20854;&#26159;&#38024;&#23545;&#36817;&#26399;&#33021;&#28304;&#21644;&#20132;&#36890;&#20215;&#26684;&#19978;&#28072;&#30340;&#38382;&#39064;&#12290;&#20854;&#20013;&#20043;&#19968;&#26159;&#22312;2022&#24180;6&#26376;&#12289;7&#26376;&#21644;8&#26376;&#19977;&#20010;&#26376;&#26399;&#38388;&#20026;&#27599;&#26376;9&#27431;&#20803;&#25552;&#20379;&#20840;&#22269;&#24615;&#20844;&#20849;&#20132;&#36890;&#31080;&#12290;&#36825;&#26159;&#20132;&#36890;&#25919;&#31574;&#30740;&#31350;&#20013;&#20960;&#20046;&#21069;&#25152;&#26410;&#26377;&#30340;&#34892;&#20026;&#23454;&#39564;&#12290;&#36825;&#19981;&#20165;&#20801;&#35768;&#25105;&#20204;&#30740;&#31350;&#20986;&#34892;&#26041;&#24335;&#30340;&#34892;&#20026;&#21709;&#24212;&#21644;&#35825;&#23548;&#38656;&#27714;&#65292;&#36824;&#21487;&#20197;&#35780;&#20272;&#36825;&#20123;&#24037;&#20855;&#30340;&#26377;&#25928;&#24615;&#12290;&#25105;&#20204;&#20351;&#29992;&#19977;&#27874;&#35843;&#26597;&#21644;&#22522;&#20110;&#26234;&#33021;&#25163;&#26426;&#30340;&#34892;&#31243;&#26085;&#35760;&#65292;&#24182;&#23545;&#24917;&#23612;&#40657;&#22823;&#37117;&#20250;&#21306;&#30340;2,261&#21517;&#21442;&#19982;&#32773;&#36827;&#34892;&#37325;&#28857;&#35266;&#27979;&#12290;&#36873;&#25321;&#35813;&#22320;&#21306;&#26159;&#22240;&#20026;&#23427;&#25552;&#20379;&#20102;&#21508;&#31181;&#20986;&#34892;&#26041;&#24335;&#65292;&#25317;&#26377;&#23494;&#38598;&#21644;&#24191;&#27867;&#30340;&#20844;&#20849;&#20132;&#36890;&#32593;&#32476;&#65292;&#29978;&#33267;&#21487;&#20197;&#25552;&#20379;&#33391;&#22909;&#30340;&#21040;&#36798;&#35768;&#22810;&#20241;&#38386;&#30446;&#30340;&#22320;&#30340;&#26041;&#24335;&#12290;&#35813;&#24212;&#29992;&#31243;&#24207;&#25552;&#20379;&#20102;756&#20010;&#23454;&#38469;&#21442;&#19982;&#32773;&#30340;&#25968;&#25454;&#12290;
&lt;/p&gt;
&lt;p&gt;
In spring 2022, the German federal government agreed on a set of policy measures that aimed at reducing households' financial burden resulting from a recent price increase, especially in energy and mobility. These included among others, a nationwide public transport ticket for 9~Euro per month for three months in June, July, and August 2022. In transport policy research this is an almost unprecedented behavioral experiment. It allows us to study not only behavioral responses in mode choice and induced demand but also to assess the effectiveness of these instruments. We observe this natural experiment with a three-wave survey and a smartphone-based travel diary with passive tracking on an initial sample of 2,261 participants with a focus on the Munich metropolitan region. This area is chosen as it offers a variety of mode options with a dense and far-reaching public transport network that even provides good access to many leisure destinations. The app has been providing data from 756 pa
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#22522;&#20110;&#8220;&#25216;&#33021;&#30456;&#20851;&#24615;&#33258;&#25105;&#36873;&#25321;&#8221;&#27169;&#22411;&#65292;&#25552;&#20379;&#20102;&#35777;&#25454;&#39564;&#35777;&#38543;&#30528;&#22269;&#20869;&#25216;&#33021;&#30456;&#20851;&#24615;&#38477;&#20302;&#65292;&#22269;&#38469;&#21171;&#21160;&#31227;&#27665;&#30340;&#24037;&#36164;&#24046;&#24322;&#20250;&#20943;&#23569;&#12290;&#21516;&#26102;&#65292;&#30830;&#35748;&#20102;&#20197;&#21069;&#34987;&#24573;&#35270;&#30340;&#8220;&#25216;&#33021;&#30456;&#20851;&#24615;&#25240;&#25187;&#8221;&#22240;&#32032;&#20316;&#20026;&#19968;&#20010;&#29420;&#31435;&#21442;&#25968;&#12290;</title><link>http://arxiv.org/abs/2306.08295</link><description>&lt;p&gt;
&#31227;&#27665;&#33258;&#25105;&#36873;&#25321;&#20013;&#30340;&#22269;&#20869;&#25216;&#33021;&#30456;&#20851;&#24615;&#27169;&#22411;&#65306;&#26469;&#33258;E-9&#23601;&#19994;&#35768;&#21487;&#35777;&#31995;&#32479;&#30340;&#36827;&#19968;&#27493;&#35777;&#25454;
&lt;/p&gt;
&lt;p&gt;
Intranational Skill-relevance Model of the Immigrant's Self-selection: Further Evidence of the Stylized Fact from the E-9 Employment Permit System (EPS). (arXiv:2306.08295v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.08295
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#22522;&#20110;&#8220;&#25216;&#33021;&#30456;&#20851;&#24615;&#33258;&#25105;&#36873;&#25321;&#8221;&#27169;&#22411;&#65292;&#25552;&#20379;&#20102;&#35777;&#25454;&#39564;&#35777;&#38543;&#30528;&#22269;&#20869;&#25216;&#33021;&#30456;&#20851;&#24615;&#38477;&#20302;&#65292;&#22269;&#38469;&#21171;&#21160;&#31227;&#27665;&#30340;&#24037;&#36164;&#24046;&#24322;&#20250;&#20943;&#23569;&#12290;&#21516;&#26102;&#65292;&#30830;&#35748;&#20102;&#20197;&#21069;&#34987;&#24573;&#35270;&#30340;&#8220;&#25216;&#33021;&#30456;&#20851;&#24615;&#25240;&#25187;&#8221;&#22240;&#32032;&#20316;&#20026;&#19968;&#20010;&#29420;&#31435;&#21442;&#25968;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#22522;&#20110;&#25105;&#20204;&#20808;&#21069;&#30340;&#30740;&#31350;(&#26446;&#65292;&#26519;&#21644;&#21331;&#65292;2022)&#24341;&#20837;&#30340;&#8220;&#25216;&#33021;&#30456;&#20851;&#24615;&#33258;&#25105;&#36873;&#25321;&#8221;&#27169;&#22411;&#65292;&#25193;&#23637;&#20102;&#21171;&#21160;&#31227;&#27665;&#30340;&#27169;&#22411;&#22522;&#30784;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#25105;&#20204;&#36890;&#36807;&#25552;&#20379;&#23454;&#35777;&#35777;&#25454;&#26469;&#39564;&#35777;&#35813;&#27169;&#22411;&#30340;&#19968;&#20010;&#20294;&#23578;&#26410;&#34987;&#27979;&#35797;&#30340;&#38081;&#21017;&#65306;&#8220;&#38543;&#30528;&#22269;&#20869;&#25216;&#33021;&#30456;&#20851;&#24615;&#38477;&#20302;&#65292;&#22269;&#38469;&#21171;&#21160;&#31227;&#27665;&#30340;&#24037;&#36164;&#24046;&#24322;&#20250;&#20943;&#23569;&#8221;&#12290;&#21033;&#29992;&#23601;&#19994;&#35768;&#21487;&#35777;&#31995;&#32479;(EPS)&#21644;&#20027;&#26426;&#22269;&#30340;&#20998;&#31867;&#32771;&#34385;&#65292;&#31934;&#24515;&#21046;&#23450;&#21644;&#36873;&#25321;&#30340;&#20551;&#35774;&#21644;&#25968;&#25454;&#65292;OLS&#32447;&#24615;&#22238;&#24402;&#32467;&#26524;&#21512;&#29702;&#22320;&#25903;&#25345;&#25152;&#26377;&#20551;&#35774;&#30340;&#32479;&#35745;&#26174;&#33879;&#24615;&#65292;&#20174;&#32780;&#24402;&#32435;&#35777;&#23454;&#20102;&#25105;&#20204;&#26500;&#24314;&#30340;&#27169;&#22411;&#12290;&#36825;&#31687;&#35770;&#25991;&#22312;&#20197;&#19979;&#19977;&#20010;&#26041;&#38754;&#20026;&#29616;&#26377;&#30340;&#21171;&#21160;&#31227;&#27665;&#32463;&#27982;&#23398;&#25991;&#29486;&#20570;&#20986;&#36129;&#29486;&#65306;(1)&#23558;&#20197;&#21069;&#34987;&#24573;&#35270;&#30340;&#8220;&#25216;&#33021;&#30456;&#20851;&#24615;&#25240;&#25187;&#8221;&#22240;&#32032;&#20316;&#20026;&#19968;&#20010;&#29420;&#31435;&#21442;&#25968;&#36827;&#34892;&#30830;&#35748;&#12290;
&lt;/p&gt;
&lt;p&gt;
This study expands upon the foundation of 'Skill-Relevance-Self Selection' model on labor immigration, introduced by our previous study (Lee, Lim, &amp; Cho, 2022). In detail, we seek an empirical confirmation of the model by providing evidence of the attained -- however, yet to be tested -- stylized fact: 'as the discount of intranational skill-relevance by immigration is intensified, the wage differential of international labor immigration is diminished'. Utilizing the hypothesis and data meticulously formulated and selected in consideration of Employment Permit System (EPS) and the typology of host nations, OLS linear regression results reasonably support all hypotheses with statistical significance, thereby inductively substantiating our constructed model. This paper contributes to existing labor immigration economics literature in three following aspects: (1) Acknowledge the previously overlooked factor of 'skill relevance discount' in labor immigration as an independent parameter, se
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;COVID-19&#25919;&#31574;&#19981;&#30830;&#23450;&#24615;&#23545;&#29305;&#23450;&#32676;&#20307;&#20445;&#38505;&#28040;&#36153;&#30340;&#24433;&#21709;&#65292;&#32467;&#26524;&#21457;&#29616;&#25935;&#24863;&#32676;&#20307;&#30340;&#24895;&#24847;&#25903;&#20184;(WTP)&#27604;&#22522;&#20934;&#39640;12.2&#65285;&#12290;</title><link>http://arxiv.org/abs/2306.08214</link><description>&lt;p&gt;
&#38754;&#23545;&#20844;&#20849;&#21355;&#29983;&#25919;&#31574;&#19981;&#30830;&#23450;&#24615;&#30340;&#24212;&#23545;&#19982;&#20445;&#38505;&#20915;&#31574;
&lt;/p&gt;
&lt;p&gt;
Response toward Public Health Policy Ambiguity and Insurance Decisions. (arXiv:2306.08214v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.08214
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;COVID-19&#25919;&#31574;&#19981;&#30830;&#23450;&#24615;&#23545;&#29305;&#23450;&#32676;&#20307;&#20445;&#38505;&#28040;&#36153;&#30340;&#24433;&#21709;&#65292;&#32467;&#26524;&#21457;&#29616;&#25935;&#24863;&#32676;&#20307;&#30340;&#24895;&#24847;&#25903;&#20184;(WTP)&#27604;&#22522;&#20934;&#39640;12.2&#65285;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20844;&#20849;&#21355;&#29983;&#25919;&#31574;&#30340;&#35843;&#25972;&#24456;&#24120;&#35265;&#12290;&#26412;&#25991;&#30740;&#31350;&#20102;COVID-19&#25919;&#31574;&#19981;&#30830;&#23450;&#24615;&#23545;&#29305;&#23450;&#32676;&#20307;&#20445;&#38505;&#28040;&#36153;&#30340;&#24433;&#21709;&#12290;&#32467;&#26524;&#26174;&#31034;&#65292;&#25935;&#24863;&#32676;&#20307;&#23545;&#20445;&#38505;&#30340;&#24895;&#24847;&#25903;&#20184;(WTP)&#27604;&#22522;&#20934;&#39640;12.2&#65285;&#12290;&#37027;&#20123;&#32463;&#21382;&#25910;&#20837;&#20013;&#26029;&#30340;&#32676;&#20307;&#26356;&#23481;&#26131;&#21463;&#21040;&#24433;&#21709;&#12290;&#26412;&#25991;&#25552;&#20379;&#20102;&#20851;&#20110;&#27969;&#34892;&#30149;&#25511;&#21046;&#36716;&#21464;&#24433;&#21709;&#30340;&#26032;&#35270;&#35282;&#12290;
&lt;/p&gt;
&lt;p&gt;
Adjustments to public health policy are common. This paper investigates the impact of COVID-19 policy ambiguity on specific groups' insurance consumption. The results show that sensitive groups' willingness to pay (WTP) for insurance is 12.2% above the benchmark. Groups that have experienced income disruptions are more likely to suffer this. This paper offers fresh perspectives on the effects of pandemic control shifts.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#26426;&#22120;&#23398;&#20064;&#25216;&#26415;&#26469;&#39044;&#27979;&#20725;&#23608;&#20225;&#19994;&#12290;&#20316;&#32773;&#20351;&#29992;Gradient Boosting&#31639;&#27861;(XGBoost)&#35299;&#26512;&#26410;&#20844;&#24320;&#30340;&#36130;&#21153;&#20449;&#24687;&#21644;&#32570;&#22833;&#25968;&#25454;&#65292;&#24182;&#29992;&#27492;&#26469;&#34913;&#37327;&#20225;&#19994;&#30340;&#30772;&#20135;&#39118;&#38505;&#65292;&#26368;&#32456;&#24471;&#20986;&#20102;&#20725;&#23608;&#20225;&#19994;&#30340;&#23450;&#20041;&#21644;&#20854;&#20135;&#29983;&#30340;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2306.08165</link><description>&lt;p&gt;
&#26426;&#22120;&#23398;&#20064;&#29992;&#20110;&#29454;&#26432;&#20725;&#23608;&#20225;&#19994;&#65306;&#20174;&#20225;&#19994;&#36134;&#25143;&#21644;&#20002;&#22833;&#25968;&#25454;&#39044;&#27979;&#22256;&#22659;
&lt;/p&gt;
&lt;p&gt;
Machine Learning for Zombie Hunting: Predicting Distress from Firms' Accounts and Missing Values. (arXiv:2306.08165v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.08165
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#26426;&#22120;&#23398;&#20064;&#25216;&#26415;&#26469;&#39044;&#27979;&#20725;&#23608;&#20225;&#19994;&#12290;&#20316;&#32773;&#20351;&#29992;Gradient Boosting&#31639;&#27861;(XGBoost)&#35299;&#26512;&#26410;&#20844;&#24320;&#30340;&#36130;&#21153;&#20449;&#24687;&#21644;&#32570;&#22833;&#25968;&#25454;&#65292;&#24182;&#29992;&#27492;&#26469;&#34913;&#37327;&#20225;&#19994;&#30340;&#30772;&#20135;&#39118;&#38505;&#65292;&#26368;&#32456;&#24471;&#20986;&#20102;&#20725;&#23608;&#20225;&#19994;&#30340;&#23450;&#20041;&#21644;&#20854;&#20135;&#29983;&#30340;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#24212;&#29992;&#26426;&#22120;&#23398;&#20064;&#25216;&#26415;&#39044;&#27979;&#20725;&#23608;&#20225;&#19994;&#30340;&#26041;&#27861;&#12290;&#25105;&#20204;&#36890;&#36807;&#23545;&#24847;&#22823;&#21033;2008&#24180;&#21040;2017&#24180;304906&#23478;&#20844;&#21496;&#30340;&#20844;&#24320;&#36130;&#21153;&#20449;&#24687;&#21644;&#38750;&#38543;&#26426;&#32570;&#22833;&#25968;&#25454;&#35757;&#32451;&#21644;&#27979;&#35797;&#31639;&#27861;&#26469;&#24471;&#20986;&#39118;&#38505;&#20998;&#26512;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#26681;&#25454;&#39044;&#27979;&#32467;&#26524;&#20013;&#39640;&#20110;&#26576;&#20010;&#38408;&#20540;&#30340;&#26368;&#39640;&#32463;&#27982;&#22256;&#38590;&#65292;&#26368;&#23567;&#21270;&#35823;&#25253;&#29575;&#21644;&#28431;&#25253;&#29575;&#30340;&#32452;&#21512;&#12290;&#25105;&#20204;&#23558;&#22312;&#33267;&#23569;&#36830;&#32493;&#19977;&#24180;&#20013;&#65292;&#33853;&#20837;&#39640;&#39118;&#38505;&#20998;&#31867;&#20013;&#30340;&#20225;&#19994;&#35270;&#20316;&#8220;&#20725;&#23608;&#20225;&#19994;&#8221;&#65292;&#21363;&#22788;&#20110;&#36130;&#21153;&#22256;&#22659;&#30340;&#20225;&#19994;&#12290;&#20026;&#27492;&#65292;&#25105;&#20204;&#23454;&#29616;&#20102;&#19968;&#31181;&#26799;&#24230;&#25552;&#21319;&#31639;&#27861;(XGBoost)&#65292;&#21033;&#29992;&#20102;&#20002;&#22833;&#25968;&#25454;&#30340;&#20449;&#24687;&#12290;&#23558;&#32570;&#22833;&#25968;&#25454;&#21253;&#21547;&#22312;&#39044;&#27979;&#27169;&#22411;&#20013;&#26159;&#33267;&#20851;&#37325;&#35201;&#30340;&#65292;&#22240;&#20026;&#26410;&#25259;&#38706;&#36134;&#25143;&#30340;&#27169;&#24335;&#19982;&#20844;&#21496;&#30772;&#20135;&#30456;&#20851;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#36890;&#36807;&#23637;&#31034;&#20725;&#23608;&#20225;&#19994;&#22312;&#38271;&#26399;&#20869;&#34920;&#29616;&#20986;&#20302;&#21033;&#28070;&#29575;&#12289;&#20302;&#29983;&#20135;&#29575;&#21644;&#20302;&#25237;&#36164;&#27700;&#24179;&#26469;&#39564;&#35777;&#25105;&#20204;&#30340;&#26041;&#27861;&#65292;&#36825;&#34920;&#26126;&#25105;&#20204;&#30340;&#21457;&#29616;&#23545;&#32463;&#27982;&#25919;&#31574;&#20855;&#26377;&#37325;&#35201;&#24847;&#20041;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this contribution, we propose machine learning techniques to predict zombie firms. First, we derive the risk of failure by training and testing our algorithms on disclosed financial information and non-random missing values of 304,906 firms active in Italy from 2008 to 2017. Then, we spot the highest financial distress conditional on predictions that lies above a threshold for which a combination of false positive rate (false prediction of firm failure) and false negative rate (false prediction of active firms) is minimized. Therefore, we identify zombies as firms that persist in a state of financial distress, i.e., their forecasts fall into the risk category above the threshold for at least three consecutive years. For our purpose, we implement a gradient boosting algorithm (XGBoost) that exploits information about missing values. The inclusion of missing values in our predictive model is crucial because patterns of undisclosed accounts are correlated with firm failure. Finally, we
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#20998;&#26512;&#20102;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#22312;&#19981;&#21516;&#35821;&#35328;&#25552;&#31034;&#19979;&#30340;&#22870;&#21169;&#26102;&#38388;&#20559;&#22909;&#65292;&#24182;&#21457;&#29616;GPT&#22312;&#20855;&#26377;&#36739;&#24369;&#26410;&#26469;&#26102;&#24577;&#30340;&#35821;&#35328;&#19979;&#34920;&#29616;&#20986;&#26356;&#22823;&#30340;&#32784;&#24515;&#65292;&#36825;&#19982;&#20351;&#29992;&#35813;&#35821;&#35328;&#30340;&#20154;&#31867;&#30340;&#20559;&#22909;&#30456;&#20284;&#12290;</title><link>http://arxiv.org/abs/2305.02531</link><description>&lt;p&gt;
&#35821;&#35328;&#12289;&#26102;&#38388;&#20559;&#22909;&#21644;&#28040;&#36153;&#34892;&#20026;&#65306;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#30340;&#35777;&#25454;
&lt;/p&gt;
&lt;p&gt;
Language, Time Preferences, and Consumer Behavior: Evidence from Large Language Models. (arXiv:2305.02531v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.02531
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#20998;&#26512;&#20102;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#22312;&#19981;&#21516;&#35821;&#35328;&#25552;&#31034;&#19979;&#30340;&#22870;&#21169;&#26102;&#38388;&#20559;&#22909;&#65292;&#24182;&#21457;&#29616;GPT&#22312;&#20855;&#26377;&#36739;&#24369;&#26410;&#26469;&#26102;&#24577;&#30340;&#35821;&#35328;&#19979;&#34920;&#29616;&#20986;&#26356;&#22823;&#30340;&#32784;&#24515;&#65292;&#36825;&#19982;&#20351;&#29992;&#35813;&#35821;&#35328;&#30340;&#20154;&#31867;&#30340;&#20559;&#22909;&#30456;&#20284;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35821;&#35328;&#23545;&#25105;&#20204;&#23545;&#26102;&#38388;&#21644;&#22870;&#21169;&#30340;&#24863;&#30693;&#26377;&#24456;&#22823;&#30340;&#24433;&#21709;&#12290;&#36825;&#24341;&#21457;&#20102;&#19968;&#20010;&#38382;&#39064;&#65292;&#21363;&#24403;&#20197;&#19981;&#21516;&#30340;&#35821;&#35328;&#35810;&#38382;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#26102;&#65292;&#23427;&#20204;&#26159;&#21542;&#26174;&#31034;&#20986;&#19981;&#21516;&#30340;&#22870;&#21169;&#26102;&#38388;&#20559;&#22909;&#65292;&#24182;&#19988;&#23427;&#20204;&#30340;&#36873;&#25321;&#26159;&#21542;&#31867;&#20284;&#20110;&#20154;&#31867;&#30340;&#36873;&#25321;&#12290;&#26412;&#30740;&#31350;&#20998;&#26512;&#20102;GPT-3.5&#65288;&#20197;&#19979;&#31616;&#31216;GPT&#65289;&#22312;&#22810;&#31181;&#35821;&#35328;&#25552;&#31034;&#19979;&#30340;&#21709;&#24212;&#65292;&#25506;&#32034;&#20102;&#36739;&#23567;&#12289;&#36739;&#26089;&#30340;&#22870;&#21169;&#21644;&#36739;&#22823;&#12289;&#36739;&#26202;&#30340;&#22870;&#21169;&#20043;&#38388;&#30340;&#20559;&#22909;&#12290;&#25105;&#20204;&#30340;&#32467;&#26524;&#26174;&#31034;&#65292;&#24403;&#20197;&#35821;&#20041;&#21547;&#20041;&#36739;&#24369;&#30340;&#26410;&#26469;&#26102;&#24577;&#21442;&#32771;&#65288;FTR&#65289;&#65292;&#22914;&#24503;&#35821;&#21644;&#27721;&#35821;&#65292;&#20026;&#25552;&#31034;&#35821;&#26102;&#65292;GPT&#34920;&#29616;&#20986;&#26356;&#22823;&#30340;&#32784;&#24515;&#65292;&#30456;&#27604;&#33521;&#35821;&#21644;&#27861;&#35821;&#31561;&#20855;&#26377;&#24378;&#22823;FTR&#30340;&#35821;&#35328;&#12290;&#36825;&#20123;&#21457;&#29616;&#19982;&#29616;&#26377;&#25991;&#29486;&#19968;&#33268;&#65292;&#24182;&#34920;&#26126;&#20102;GPT&#30340;&#36873;&#25321;&#19982;&#36825;&#20123;&#35821;&#35328;&#30340;&#20351;&#29992;&#32773;&#30340;&#20559;&#22909;&#20043;&#38388;&#30340;&#20851;&#32852;&#12290;&#28982;&#32780;&#65292;&#36827;&#19968;&#27493;&#30340;&#20998;&#26512;&#25581;&#31034;&#20102;&#36739;&#26089;&#25110;&#36739;&#26202;&#22870;&#21169;&#30340;&#20559;&#22909;&#24182;&#27809;&#26377;&#38543;&#30528;&#22870;&#21169;&#24046;&#24322;&#31995;&#32479;&#22320;&#25913;&#21464;&#65292;&#36825;&#34920;&#26126;&#20102;&#19968;&#31181;&#35789;&#20856;&#24207;&#20248;&#20808;&#30340;&#36873;&#25321;&#12290;
&lt;/p&gt;
&lt;p&gt;
Language has a strong influence on our perceptions of time and rewards. This raises the question of whether large language models, when asked in different languages, show different preferences for rewards over time and if their choices are similar to those of humans. In this study, we analyze the responses of GPT-3.5 (hereafter referred to as GPT) to prompts in multiple languages, exploring preferences between smaller, sooner rewards and larger, later rewards. Our results show that GPT displays greater patience when prompted in languages with weak future tense references (FTR), such as German and Mandarin, compared to languages with strong FTR, like English and French. These findings are consistent with existing literature and suggest a correlation between GPT's choices and the preferences of speakers of these languages. However, further analysis reveals that the preference for earlier or later rewards does not systematically change with reward gaps, indicating a lexicographic preferen
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#20998;&#26512;&#21453;&#20107;&#23454;&#25919;&#31574;&#23545;&#32467;&#26524;&#21464;&#37327;&#26080;&#26465;&#20214;&#20998;&#20301;&#25968;&#25928;&#24212;&#30340;&#26694;&#26550;&#65292;&#36890;&#36807;&#20998;&#20301;&#25968;&#20998;&#35299;&#36793;&#30028;&#36827;&#34892;&#25935;&#24863;&#24615;&#20998;&#26512;&#12290;</title><link>http://arxiv.org/abs/2303.14298</link><description>&lt;p&gt;
&#26080;&#26465;&#20214;&#20998;&#20301;&#25968;&#25928;&#24212;&#30340;&#25935;&#24863;&#24615;&#20998;&#26512;
&lt;/p&gt;
&lt;p&gt;
Sensitivity Analysis in Unconditional Quantile Effects. (arXiv:2303.14298v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.14298
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#20998;&#26512;&#21453;&#20107;&#23454;&#25919;&#31574;&#23545;&#32467;&#26524;&#21464;&#37327;&#26080;&#26465;&#20214;&#20998;&#20301;&#25968;&#25928;&#24212;&#30340;&#26694;&#26550;&#65292;&#36890;&#36807;&#20998;&#20301;&#25968;&#20998;&#35299;&#36793;&#30028;&#36827;&#34892;&#25935;&#24863;&#24615;&#20998;&#26512;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#20998;&#26512;&#21453;&#20107;&#23454;&#25919;&#31574;&#23545;&#32467;&#26524;&#21464;&#37327;&#26080;&#26465;&#20214;&#20998;&#20301;&#25968;&#25928;&#24212;&#30340;&#26694;&#26550;&#12290;&#23545;&#20110;&#32473;&#23450;&#30340;&#21453;&#20107;&#23454;&#25919;&#31574;&#65292;&#25105;&#20204;&#24471;&#21040;&#20102;&#36793;&#38469;&#21644;&#20840;&#23616;&#21464;&#21270;&#24433;&#21709;&#30340;&#25928;&#24212;&#21487;&#35782;&#21035;&#38598;&#12290;&#20026;&#20102;&#36827;&#34892;&#25935;&#24863;&#24615;&#20998;&#26512;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#20998;&#20301;&#25968;&#20998;&#35299;&#36793;&#30028;&#65292;&#19968;&#26465;&#26354;&#32447;&#65292;&#23427;&#65288;i&#65289;&#25351;&#31034;&#26159;&#21542;&#26377;&#21487;&#33021;&#36827;&#34892;&#25935;&#24863;&#24615;&#20998;&#26512;&#65292;&#65288;ii&#65289;&#24403;&#23384;&#22312;&#25935;&#24863;&#24615;&#20998;&#26512;&#26102;&#65292;&#23427;&#37327;&#21270;&#20102;&#22312;&#19981;&#21516;&#20998;&#20301;&#25968;&#19978;&#19982;&#24863;&#20852;&#36259;&#30340;&#32467;&#35770;&#19968;&#33268;&#30340;&#36873;&#25321;&#20559;&#24046;&#37327;&#12290;&#20026;&#20102;&#35828;&#26126;&#25105;&#20204;&#30340;&#26041;&#27861;&#65292;&#25105;&#20204;&#23545;&#32452;&#32455;&#20302;&#25910;&#20837;&#24037;&#20154;&#30340;&#25928;&#24212;&#22312;&#24037;&#36164;&#65288;&#23545;&#25968;&#65289;&#30340;&#20998;&#24067;&#30340;&#19981;&#21516;&#20998;&#20301;&#25968;&#19978;&#36827;&#34892;&#20102;&#25935;&#24863;&#24615;&#20998;&#26512;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper proposes a framework to analyze the effects of counterfactual policies on the unconditional quantiles of an outcome variable. For a given counterfactual policy, we obtain identified sets for the effect of both marginal and global changes in the proportion of treated individuals. To conduct a sensitivity analysis, we introduce the quantile breakdown frontier, a curve that (i) indicates whether a sensitivity analysis if possible or not, and (ii) when a sensitivity analysis is possible, quantifies the amount of selection bias consistent with a given conclusion of interest across different quantiles. To illustrate our method, we perform a sensitivity analysis on the effect of unionizing low income workers on the quantiles of the distribution of (log) wages.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22312;&#26102;&#38388;&#26399;&#25968;&#36739;&#23569;&#19988;&#24179;&#34892;&#36235;&#21183;&#26465;&#20214;&#28385;&#36275;&#30340;&#24773;&#20917;&#19979;&#26377;&#25928;&#30340;&#27835;&#30103;&#25928;&#24212;&#20272;&#35745;&#37327;&#65292;&#21487;&#25903;&#25345;&#25511;&#21046;&#21464;&#37327;&#21463;&#21040;&#22788;&#29702;&#24433;&#21709;&#30340;&#24773;&#20917;&#65292;&#24182;&#20801;&#35768;&#23545;&#32467;&#26524;&#21464;&#37327;&#30340;&#38388;&#25509;&#24433;&#21709;&#36827;&#34892;&#20272;&#35745;&#12290;</title><link>http://arxiv.org/abs/2301.11358</link><description>&lt;p&gt;
&#22266;&#23450;T&#38754;&#26495;&#25968;&#25454;&#20013;&#31616;&#21333;&#24046;&#24322;&#27861;&#27835;&#30103;&#25928;&#24212;&#20272;&#35745;
&lt;/p&gt;
&lt;p&gt;
Simple Difference-in-Differences Estimation in Fixed-T Panels. (arXiv:2301.11358v2 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2301.11358
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22312;&#26102;&#38388;&#26399;&#25968;&#36739;&#23569;&#19988;&#24179;&#34892;&#36235;&#21183;&#26465;&#20214;&#28385;&#36275;&#30340;&#24773;&#20917;&#19979;&#26377;&#25928;&#30340;&#27835;&#30103;&#25928;&#24212;&#20272;&#35745;&#37327;&#65292;&#21487;&#25903;&#25345;&#25511;&#21046;&#21464;&#37327;&#21463;&#21040;&#22788;&#29702;&#24433;&#21709;&#30340;&#24773;&#20917;&#65292;&#24182;&#20801;&#35768;&#23545;&#32467;&#26524;&#21464;&#37327;&#30340;&#38388;&#25509;&#24433;&#21709;&#36827;&#34892;&#20272;&#35745;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#27835;&#30103;&#25928;&#24212;&#20272;&#35745;&#37327;&#65292;&#24403;&#26102;&#38388;&#26399;&#25968;&#36739;&#23569;&#19988;&#24179;&#34892;&#36235;&#21183;&#26465;&#20214;&#28385;&#36275;&#26102;&#65292;&#35813;&#20272;&#35745;&#37327;&#26159;&#26377;&#25928;&#30340;&#65292;&#26465;&#20214;&#26159;&#21327;&#21464;&#37327;&#21644;&#20132;&#20114;&#22266;&#23450;&#25928;&#24212;&#30340;&#26410;&#35266;&#27979;&#24322;&#36136;&#24615;&#12290;&#35813;&#20272;&#35745;&#37327;&#36824;&#20801;&#35768;&#25511;&#21046;&#21464;&#37327;&#21463;&#21040;&#22788;&#29702;&#30340;&#24433;&#21709;&#65292;&#24182;&#20351;&#24471;&#33021;&#22815;&#23545;&#32467;&#26524;&#21464;&#37327;&#30340;&#38388;&#25509;&#24433;&#21709;&#36827;&#34892;&#20272;&#35745;&#12290;&#26412;&#25991;&#24314;&#31435;&#20102;&#20272;&#35745;&#37327;&#30340;&#28176;&#36817;&#24615;&#36136;&#65292;&#24182;&#20351;&#29992;&#33945;&#29305;&#21345;&#32599;&#27169;&#25311;&#30740;&#31350;&#20102;&#20854;&#22312;&#23567;&#26679;&#26412;&#20013;&#30340;&#31934;&#24230;&#12290;&#35813;&#20272;&#35745;&#37327;&#30340;&#23454;&#35777;&#20215;&#20540;&#20351;&#29992;&#20013;&#22269;&#22686;&#21152;&#30340;&#36152;&#26131;&#31454;&#20105;&#23545;&#20844;&#21496;&#21152;&#20215;&#30340;&#24433;&#21709;&#20316;&#20026;&#20363;&#23376;&#20104;&#20197;&#35828;&#26126;&#12290;
&lt;/p&gt;
&lt;p&gt;
The present paper proposes a new treatment effects estimator that is valid when the number of time periods is small, and the parallel trends condition holds conditional on covariates and unobserved heterogeneity in the form of interactive fixed effects. The estimator also allow the control variables to be affected by treatment and it enables estimation of the resulting indirect effect on the outcome variable. The asymptotic properties of the estimator are established and their accuracy in small samples is investigated using Monte Carlo simulations. The empirical usefulness of the estimator is illustrated using as an example the effect of increased trade competition on firm markups in China.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;MRBEE&#30340;&#26032;&#22411;&#22810;&#21464;&#37327;MR&#26041;&#27861;&#65292;&#21487;&#35299;&#20915;&#22810;&#20010;GWAS&#38431;&#21015;&#20043;&#38388;&#30340;&#26679;&#26412;&#37325;&#21472;&#38382;&#39064;&#65292;&#33021;&#22815;&#25512;&#26029;&#35768;&#22810;&#24369;&#24037;&#20855;&#21464;&#37327;&#30340;&#26080;&#20559;&#22240;&#26524;&#20851;&#31995;&#12290;</title><link>http://arxiv.org/abs/2301.05130</link><description>&lt;p&gt;
&#22810;&#21464;&#37327;&#38376;&#25463;&#21015;&#22827;&#38543;&#26426;&#21270;&#20013;&#30340;&#26080;&#20559;&#20272;&#35745;&#21644;&#28176;&#36817;&#26377;&#25928;&#25512;&#26029;&#19982;&#24369;&#24037;&#20855;&#21464;&#37327;
&lt;/p&gt;
&lt;p&gt;
Unbiased estimation and asymptotically valid inference in multivariable Mendelian randomization with many weak instrumental variables. (arXiv:2301.05130v3 [stat.ME] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2301.05130
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;MRBEE&#30340;&#26032;&#22411;&#22810;&#21464;&#37327;MR&#26041;&#27861;&#65292;&#21487;&#35299;&#20915;&#22810;&#20010;GWAS&#38431;&#21015;&#20043;&#38388;&#30340;&#26679;&#26412;&#37325;&#21472;&#38382;&#39064;&#65292;&#33021;&#22815;&#25512;&#26029;&#35768;&#22810;&#24369;&#24037;&#20855;&#21464;&#37327;&#30340;&#26080;&#20559;&#22240;&#26524;&#20851;&#31995;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38376;&#25463;&#21015;&#22827;&#38543;&#26426;&#21270;&#65288;MR&#65289;&#26159;&#19968;&#31181;&#21033;&#29992;&#22522;&#22240;&#32452;&#20851;&#32852;&#30740;&#31350;&#65288;GWAS&#65289;&#25688;&#35201;&#25968;&#25454;&#25512;&#26029;&#26333;&#38706;&#21644;&#32467;&#26524;&#20043;&#38388;&#22240;&#26524;&#20851;&#31995;&#30340;&#24037;&#20855;&#21464;&#37327;&#26041;&#27861;&#12290;&#28982;&#32780;&#65292;&#22810;&#21464;&#37327;&#21453;&#26041;&#24046;&#21152;&#26435;&#65288;IVW&#65289;&#26041;&#27861;&#20316;&#20026;&#22823;&#22810;&#25968;MR&#26041;&#27861;&#30340;&#22522;&#30784;&#65292;&#22312;&#23384;&#22312;&#35768;&#22810;&#24369;&#24037;&#20855;&#21464;&#37327;&#30340;&#24773;&#20917;&#19979;&#26080;&#27861;&#20135;&#29983;&#26080;&#20559;&#30340;&#22240;&#26524;&#25928;&#24212;&#20272;&#35745;&#12290;&#26412;&#25991;&#35777;&#26126;&#20102;&#22810;&#21464;&#37327;IVW&#20272;&#35745;&#30340;&#20559;&#24046;&#26159;&#24369;&#24037;&#20855;&#12289;&#20272;&#35745;&#35823;&#24046;&#20559;&#24046;&#30340;&#20056;&#31215;&#65292;&#21518;&#32773;&#19982;&#22810;&#20010;GWAS&#38431;&#21015;&#20043;&#38388;&#30340;&#26679;&#26412;&#37325;&#21472;&#23384;&#22312;&#26435;&#34913;&#20851;&#31995;&#65292;&#26159;&#30001;&#27979;&#37327;&#35823;&#24046;&#21644;&#28151;&#28102;&#21464;&#37327;&#24341;&#36215;&#30340;&#12290;&#20026;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#22810;&#21464;&#37327;MR&#26041;&#27861;&#65292;&#21363;&#20351;&#29992;&#26657;&#27491;&#20559;&#24046;&#20272;&#35745;&#26041;&#31243;&#30340;MR&#65288;MRBEE&#65289;&#65292;&#21487;&#20197;&#25512;&#26029;&#35768;&#22810;&#24369;&#24037;&#20855;&#21464;&#37327;&#30340;&#26080;&#20559;&#22240;&#26524;&#20851;&#31995;&#12290;&#22312;&#36866;&#24230;&#26465;&#20214;&#19979;&#30740;&#31350;&#20102;&#22810;&#21464;&#37327;IVW&#21644;MRBEE&#30340;&#28176;&#36817;&#34892;&#20026;&#65292;&#32467;&#26524;&#34920;&#26126;&#24403;&#24369;&#24037;&#20855;&#21464;&#37327;&#30340;&#25968;&#37327;&#24456;&#22823;&#26102;&#65292;MRBEE&#20248;&#20110;&#22810;&#21464;&#37327;IVW&#12290;
&lt;/p&gt;
&lt;p&gt;
Mendelian randomization (MR) is an instrumental variable (IV) approach to infer causal relationships between exposures and outcomes with genome-wide association studies (GWAS) summary data. However, the multivariable inverse-variance weighting (IVW) approach, which serves as the foundation for most MR approaches, cannot yield unbiased causal effect estimates in the presence of many weak IVs. In this paper, we prove that the bias of the multivariable IVW estimate is a product of weak instrument and estimation error biases, where the latter is linearly composed of measurement error and confounder biases with a trade-off due to sample overlap among multiple GWAS cohorts. To address this problem, we propose a novel multivariable MR approach, MR using Bias-corrected Estimating Equation (MRBEE), which can infer unbiased causal relationships with many weak IVs. Asymptotic behaviors of multivariable IVW and MRBEE are investigated under moderate conditions, showing that MRBEE outperforms multiv
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#22312;&#26377;&#38480;&#25968;&#37327;&#21644;&#24322;&#36136;&#24615;&#32858;&#31867;&#30340;&#24773;&#20917;&#19979;&#25512;&#26029;&#25972;&#20010;&#20998;&#20301;&#25968;&#21644;&#22238;&#24402;&#20998;&#20301;&#25968;&#36807;&#31243;&#30340;&#36890;&#29992;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#21487;&#20197;&#36890;&#36807;&#38543;&#26426;&#21270;&#27979;&#35797;&#23454;&#29616;&#65292;&#32780;&#19981;&#38656;&#35201;&#20808;&#21069;&#21305;&#37197;&#32858;&#31867;&#25110;&#29992;&#25143;&#36873;&#25321;&#30340;&#21442;&#25968;&#12290;</title><link>http://arxiv.org/abs/2301.04687</link><description>&lt;p&gt;
&#22312;&#26377;&#38480;&#25968;&#37327;&#30340;&#32858;&#31867;&#20013;&#23545;&#20998;&#20301;&#25968;&#36807;&#31243;&#36827;&#34892;&#25512;&#26029;
&lt;/p&gt;
&lt;p&gt;
Inference on quantile processes with a finite number of clusters. (arXiv:2301.04687v2 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2301.04687
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#22312;&#26377;&#38480;&#25968;&#37327;&#21644;&#24322;&#36136;&#24615;&#32858;&#31867;&#30340;&#24773;&#20917;&#19979;&#25512;&#26029;&#25972;&#20010;&#20998;&#20301;&#25968;&#21644;&#22238;&#24402;&#20998;&#20301;&#25968;&#36807;&#31243;&#30340;&#36890;&#29992;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#21487;&#20197;&#36890;&#36807;&#38543;&#26426;&#21270;&#27979;&#35797;&#23454;&#29616;&#65292;&#32780;&#19981;&#38656;&#35201;&#20808;&#21069;&#21305;&#37197;&#32858;&#31867;&#25110;&#29992;&#25143;&#36873;&#25321;&#30340;&#21442;&#25968;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20171;&#32461;&#20102;&#19968;&#31181;&#36890;&#29992;&#26041;&#27861;&#65292;&#29992;&#20110;&#22312;&#23384;&#22312;&#26377;&#38480;&#25968;&#37327;&#30340;&#22823;&#22411;&#19988;&#20219;&#24847;&#24322;&#26500;&#30340;&#32858;&#31867;&#30340;&#24773;&#20917;&#19979;&#23545;&#25972;&#20010;&#20998;&#20301;&#25968;&#21644;&#22238;&#24402;&#20998;&#20301;&#25968;&#36807;&#31243;&#36827;&#34892;&#25512;&#26029;&#12290;&#35813;&#26041;&#27861;&#36890;&#36807;&#29983;&#25104;&#20855;&#26377;&#36275;&#22815;&#20998;&#24067;&#23545;&#31216;&#24615;&#30340;&#32479;&#35745;&#37327;&#26469;&#28176;&#36817;&#25511;&#21046;&#22823;&#23567;&#65292;&#20174;&#32780;&#21487;&#20197;&#24212;&#29992;&#38543;&#26426;&#21270;&#27979;&#35797;&#12290;&#38543;&#26426;&#21270;&#27979;&#35797;&#19981;&#38656;&#35201;&#32858;&#31867;&#30340;&#20808;&#21069;&#21305;&#37197;&#65292;&#27809;&#26377;&#29992;&#25143;&#36873;&#25321;&#30340;&#21442;&#25968;&#65292;&#24182;&#19988;&#22312;&#20165;&#26377;&#20116;&#20010;&#32858;&#31867;&#30340;&#24773;&#20917;&#19979;&#22312;&#20256;&#32479;&#30340;&#26174;&#33879;&#24615;&#27700;&#24179;&#19978;&#34920;&#29616;&#33391;&#22909;&#12290;&#35813;&#26041;&#27861;&#27979;&#35797;&#26631;&#20934;&#65288;&#38750;&#23574;&#38160;&#65289;&#20551;&#35774;&#65292;&#29978;&#33267;&#21487;&#20197;&#22312;&#23454;&#35777;&#19978;&#30456;&#20851;&#30340;&#24773;&#20917;&#19979;&#28176;&#36817;&#31867;&#20284;&#12290;&#26412;&#25991;&#30340;&#37325;&#28857;&#26159;&#23545;&#20998;&#20301;&#25968;&#22788;&#29702;&#25928;&#24212;&#30340;&#25512;&#26029;&#65292;&#20294;&#35813;&#26041;&#27861;&#36866;&#29992;&#20110;&#26356;&#24191;&#27867;&#30340;&#24773;&#20917;&#12290;&#25552;&#20379;&#20102;&#25968;&#20540;&#21644;&#23454;&#35777;&#20363;&#23376;&#12290;
&lt;/p&gt;
&lt;p&gt;
I introduce a generic method for inference on entire quantile and regression quantile processes in the presence of a finite number of large and arbitrarily heterogeneous clusters. The method asymptotically controls size by generating statistics that exhibit enough distributional symmetry such that randomization tests can be applied. The randomization test does not require ex-ante matching of clusters, is free of user-chosen parameters, and performs well at conventional significance levels with as few as five clusters. The method tests standard (non-sharp) hypotheses and can even be asymptotically similar in empirically relevant situations. The main focus of the paper is inference on quantile treatment effects but the method applies more broadly. Numerical and empirical examples are provided.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#22522;&#20110;&#26399;&#26395;&#30340;&#25439;&#22833;&#21388;&#24694;&#20080;&#23478;&#19979;&#30340;&#20445;&#30041;&#20215;&#26684;&#38382;&#39064;&#65292;&#21457;&#29616;&#26368;&#20248;&#30340;&#20844;&#20849;&#20445;&#30041;&#20215;&#26684;&#25490;&#38500;&#30340;&#31454;&#26631;&#32773;&#31867;&#22411;&#27604;&#39118;&#38505;&#20013;&#24615;&#24773;&#20917;&#19979;&#23569;&#65292;&#24182;&#25552;&#20986;&#26356;&#22909;&#22320;&#21033;&#29992;&#8220;&#20381;&#24651;&#25928;&#24212;&#8221;&#30340;&#26426;&#21046;&#21487;&#20197;&#33719;&#24471;&#26356;&#39640;&#30340;&#25910;&#30410;&#12290;</title><link>http://arxiv.org/abs/2210.10938</link><description>&lt;p&gt;
&#20915;&#19981;&#35328;&#36133;&#65306;&#38024;&#23545;&#22522;&#20110;&#26399;&#26395;&#30340;&#25439;&#22833;&#21388;&#24694;&#20080;&#23478;&#30340;&#26368;&#20248;&#25490;&#38500;&#21644;&#20445;&#30041;&#20215;&#26684;
&lt;/p&gt;
&lt;p&gt;
Never Say Never: Optimal Exclusion and Reserve Prices with Expectations-Based Loss-Averse Buyers. (arXiv:2210.10938v2 [econ.TH] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2210.10938
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22522;&#20110;&#26399;&#26395;&#30340;&#25439;&#22833;&#21388;&#24694;&#20080;&#23478;&#19979;&#30340;&#20445;&#30041;&#20215;&#26684;&#38382;&#39064;&#65292;&#21457;&#29616;&#26368;&#20248;&#30340;&#20844;&#20849;&#20445;&#30041;&#20215;&#26684;&#25490;&#38500;&#30340;&#31454;&#26631;&#32773;&#31867;&#22411;&#27604;&#39118;&#38505;&#20013;&#24615;&#24773;&#20917;&#19979;&#23569;&#65292;&#24182;&#25552;&#20986;&#26356;&#22909;&#22320;&#21033;&#29992;&#8220;&#20381;&#24651;&#25928;&#24212;&#8221;&#30340;&#26426;&#21046;&#21487;&#20197;&#33719;&#24471;&#26356;&#39640;&#30340;&#25910;&#30410;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#29420;&#31435;&#31169;&#26377;&#20215;&#20540;&#25293;&#21334;&#20013;&#65292;&#31454;&#26631;&#32773;&#22522;&#20110;&#26399;&#26395;&#30340;&#25439;&#22833;&#21388;&#24694;&#26102;&#30340;&#20445;&#30041;&#20215;&#26684;&#12290;&#25105;&#20204;&#21457;&#29616;&#26368;&#20248;&#30340;&#20844;&#20849;&#20445;&#30041;&#20215;&#26684;&#25490;&#38500;&#30340;&#31454;&#26631;&#32773;&#31867;&#22411;&#27604;&#39118;&#38505;&#20013;&#24615;&#24773;&#20917;&#19979;&#23569;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#34920;&#26126;&#20844;&#20849;&#20445;&#30041;&#20215;&#26684;&#24182;&#19981;&#26159;&#26368;&#20248;&#30340;&#65292;&#21334;&#23478;&#21487;&#20197;&#36890;&#36807;&#26356;&#22909;&#22320;&#21033;&#29992;&#8220;&#20381;&#24651;&#25928;&#24212;&#8221;&#30340;&#26426;&#21046;&#26469;&#33719;&#24471;&#26356;&#39640;&#30340;&#25910;&#30410;&#12290;&#25105;&#20204;&#35752;&#35770;&#20102;&#20004;&#31181;&#36825;&#26679;&#30340;&#26426;&#21046;&#65306;i)&#20855;&#26377;&#31192;&#23494;&#21644;&#38543;&#26426;&#20445;&#30041;&#20215;&#26684;&#30340;&#25293;&#21334;&#65292;&#21644;ii&#65289;&#22914;&#26524;&#26410;&#33021;&#36798;&#21040;&#20445;&#30041;&#20215;&#26684;&#65292;&#21017;&#21518;&#32493;&#36827;&#34892;&#21327;&#21830;&#30340;&#20004;&#38454;&#27573;&#26426;&#21046;&#12290;&#36825;&#20123;&#26426;&#21046;&#37117;&#20351;&#26356;&#22810;&#30340;&#31454;&#26631;&#32773;&#26292;&#38706;&#20110;&#20381;&#24651;&#25928;&#24212;&#20043;&#19979;&#65292;&#20174;&#32780;&#22686;&#21152;&#25237;&#26631;&#24182;&#26368;&#32456;&#22686;&#21152;&#25910;&#30410;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study reserve prices in auctions with independent private values when bidders are expectations-based loss averse. We find that the optimal public reserve price excludes fewer bidder types than under risk neutrality. Moreover, we show that public reserve prices are not optimal as the seller can earn a higher revenue with mechanisms that better leverage the ``attachment effect''. We discuss two such mechanisms: i) an auction with a secrete and random reserve price, and ii) a two-stage mechanism where an auction with a public reserve price is followed by a negotiation if the reserve price is not met. Both of these mechanisms expose more bidders to the attachment effect, thereby increasing bids and ultimately revenue.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#36890;&#36807;&#23558;&#38468;&#36817;&#30340;&#25910;&#30410;&#32858;&#31867;&#22312;&#19968;&#36215;&#26469;&#31895;&#30053;&#21270;&#33258;&#24049;&#30340;&#25928;&#29992;&#65292;&#20174;&#32780;&#33719;&#24471;&#25112;&#30053;&#20248;&#21183;&#12290;CUE&#30340;&#35299;&#20915;&#26041;&#26696;&#35201;&#27714;&#27599;&#20010;&#29609;&#23478;&#26368;&#22823;&#21270;&#20182;&#30340;&#31895;&#30053;&#25928;&#29992;&#65292;&#24418;&#25104;&#30456;&#20114;&#26368;&#20339;&#24212;&#31572;&#12290;&#19981;&#21516;&#31867;&#22411;&#30340;CUE&#20043;&#38388;&#23384;&#22312;&#23450;&#24615;&#24046;&#24322;&#65292;&#21518;&#32773;&#22312;&#20855;&#26377;&#21333;&#35843;&#22806;&#37096;&#24615;&#30340;&#22823;&#31867;&#28216;&#25103;&#20013;&#20351;&#24471;&#29609;&#23478;&#23545;&#24453;&#20849;&#21516;&#29609;&#23478;&#26356;&#22909;&#22320;&#36229;&#36807;Nash&#22343;&#34913;&#12290;</title><link>http://arxiv.org/abs/2201.10141</link><description>&lt;p&gt;
&#31895;&#30053;&#20559;&#22909;&#30340;&#20248;&#21183;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
The Benefits of Coarse Preferences. (arXiv:2201.10141v5 [econ.TH] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2201.10141
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#36890;&#36807;&#23558;&#38468;&#36817;&#30340;&#25910;&#30410;&#32858;&#31867;&#22312;&#19968;&#36215;&#26469;&#31895;&#30053;&#21270;&#33258;&#24049;&#30340;&#25928;&#29992;&#65292;&#20174;&#32780;&#33719;&#24471;&#25112;&#30053;&#20248;&#21183;&#12290;CUE&#30340;&#35299;&#20915;&#26041;&#26696;&#35201;&#27714;&#27599;&#20010;&#29609;&#23478;&#26368;&#22823;&#21270;&#20182;&#30340;&#31895;&#30053;&#25928;&#29992;&#65292;&#24418;&#25104;&#30456;&#20114;&#26368;&#20339;&#24212;&#31572;&#12290;&#19981;&#21516;&#31867;&#22411;&#30340;CUE&#20043;&#38388;&#23384;&#22312;&#23450;&#24615;&#24046;&#24322;&#65292;&#21518;&#32773;&#22312;&#20855;&#26377;&#21333;&#35843;&#22806;&#37096;&#24615;&#30340;&#22823;&#31867;&#28216;&#25103;&#20013;&#20351;&#24471;&#29609;&#23478;&#23545;&#24453;&#20849;&#21516;&#29609;&#23478;&#26356;&#22909;&#22320;&#36229;&#36807;Nash&#22343;&#34913;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#36890;&#36807;&#23558;&#38468;&#36817;&#30340;&#25910;&#30410;&#32858;&#31867;&#22312;&#19968;&#36215;&#65288;&#21363;&#20197;&#30456;&#21516;&#26041;&#24335;&#36827;&#34892;&#20998;&#31867;&#65289;&#26469;&#31895;&#30053;&#21270;&#33258;&#24049;&#30340;&#25928;&#29992;&#65292;&#20174;&#32780;&#33719;&#24471;&#30340;&#25112;&#30053;&#20248;&#21183;&#12290;&#25105;&#20204;&#30340;&#35299;&#20915;&#26041;&#26696;&#27010;&#24565;&#65292;&#31895;&#30053;&#25928;&#29992;&#22343;&#34913;&#65288;CUE&#65289;&#35201;&#27714;&#65288;1&#65289;&#27599;&#20010;&#29609;&#23478;&#22312;&#23545;&#25163;&#30340;&#31574;&#30053;&#19979;&#26368;&#22823;&#21270;&#20182;&#30340;&#31895;&#30053;&#25928;&#29992;&#65292;&#65288;2&#65289;&#20998;&#31867;&#24418;&#25104;&#30456;&#20114;&#26368;&#20339;&#24212;&#31572;&#12290;&#25105;&#20204;&#29305;&#24449;&#21270;&#20102;&#21508;&#31181;&#28216;&#25103;&#20013;&#30340;CUE&#12290;&#29305;&#21035;&#22320;&#65292;&#22312;&#20855;&#26377;&#21333;&#35843;&#22806;&#37096;&#24615;&#30340;&#22823;&#31867;&#28216;&#25103;&#20013;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#21482;&#26377;&#19968;&#20010;&#29609;&#23478;&#32858;&#31867;&#25910;&#30410;&#30340;CUE&#19982;&#25152;&#26377;&#29609;&#23478;&#32858;&#31867;&#25910;&#30410;&#30340;CUE&#20043;&#38388;&#23384;&#22312;&#23450;&#24615;&#24046;&#24322;&#65292;&#21518;&#32773;&#35825;&#23548;&#29609;&#23478;&#23545;&#24453;&#20849;&#21516;&#29609;&#23478;&#26356;&#22909;&#22320;&#36229;&#36807;Nash&#22343;&#34913;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study the strategic advantages of coarsening one's utility by clustering nearby payoffs together (i.e., classifying them the same way). Our solution concept, coarse-utility equilibrium (CUE) requires that (1) each player maximizes her coarse utility, given the opponent's strategy, and (2) the classifications form best replies to one another. We characterize CUEs in various games. In particular, we show that there is a qualitative difference between CUEs in which only one of the players clusters payoffs, and those in which all players cluster their payoffs, and that the latter type induce players to treat co-players better than in Nash equilibria in the large class of games with monotone externalities.
&lt;/p&gt;</description></item></channel></rss>