<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#25552;&#20379;&#20102;&#19968;&#20010;&#23454;&#29992;&#24037;&#20855;&#21253;&#65292;&#29992;&#20110;&#20998;&#26512;&#20107;&#20214;&#30740;&#31350;&#20013;&#30340;&#25928;&#24212;&#24322;&#36136;&#24615;&#65292;&#24378;&#35843;&#20102;&#20010;&#20307;&#32423;&#21035;&#25928;&#24212;&#30340;&#37325;&#35201;&#24615;&#65292;&#24182;&#25581;&#31034;&#20102;&#32447;&#24615;&#27835;&#30103;&#25928;&#24212;&#30340;&#25361;&#25112;&#12290;</title><link>https://arxiv.org/abs/2403.19563</link><description>&lt;p&gt;
&#20107;&#20214;&#30740;&#31350;&#20013;&#20010;&#20307;&#24322;&#36136;&#24615;&#30340;&#28789;&#27963;&#20998;&#26512;&#65306;&#20197;&#23376;&#22899;&#24809;&#32602;&#20026;&#20363;
&lt;/p&gt;
&lt;p&gt;
Flexible Analysis of Individual Heterogeneity in Event Studies: Application to the Child Penalty
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.19563
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20379;&#20102;&#19968;&#20010;&#23454;&#29992;&#24037;&#20855;&#21253;&#65292;&#29992;&#20110;&#20998;&#26512;&#20107;&#20214;&#30740;&#31350;&#20013;&#30340;&#25928;&#24212;&#24322;&#36136;&#24615;&#65292;&#24378;&#35843;&#20102;&#20010;&#20307;&#32423;&#21035;&#25928;&#24212;&#30340;&#37325;&#35201;&#24615;&#65292;&#24182;&#25581;&#31034;&#20102;&#32447;&#24615;&#27835;&#30103;&#25928;&#24212;&#30340;&#25361;&#25112;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20379;&#20102;&#19968;&#20010;&#23454;&#29992;&#24037;&#20855;&#21253;&#65292;&#29992;&#20110;&#20998;&#26512;&#20107;&#20214;&#30740;&#31350;&#20013;&#30340;&#25928;&#24212;&#24322;&#36136;&#24615;&#12290;&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#20010;&#20272;&#35745;&#31639;&#27861;&#65292;&#24182;&#35843;&#25972;&#29616;&#26377;&#30340;&#35745;&#37327;&#32463;&#27982;&#32467;&#26524;&#65292;&#25552;&#20379;&#20854;&#29702;&#35770;&#22522;&#30784;&#12290;&#25105;&#20204;&#23558;&#36825;&#20123;&#24037;&#20855;&#24212;&#29992;&#20110;&#33655;&#20848;&#34892;&#25919;&#25968;&#25454;&#65292;&#20197;&#19977;&#31181;&#26041;&#24335;&#30740;&#31350;&#23376;&#22899;&#24809;&#32602;&#65288;CP&#65289;&#32972;&#26223;&#19979;&#30340;&#20010;&#20307;&#24322;&#36136;&#24615;&#12290;&#39318;&#20808;&#65292;&#25105;&#20204;&#35760;&#24405;&#20102;&#20010;&#20307;&#32423;&#21035;CP&#36712;&#36857;&#30340;&#26174;&#33879;&#24322;&#36136;&#24615;&#65292;&#24378;&#35843;&#36229;&#36234;&#24179;&#22343;CP&#30340;&#37325;&#35201;&#24615;&#12290;&#20854;&#27425;&#65292;&#25105;&#20204;&#20351;&#29992;&#20010;&#20307;&#32423;&#21035;&#20272;&#35745;&#26469;&#26816;&#39564;&#25176;&#20799;&#26381;&#21153;&#20379;&#32473;&#25193;&#23637;&#25919;&#31574;&#30340;&#24433;&#21709;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#25581;&#31034;&#20102;&#38750;&#32447;&#24615;&#27835;&#30103;&#25928;&#24212;&#65292;&#25361;&#25112;&#20102;&#21463;&#38480;&#20110;&#36739;&#23569;&#28789;&#27963;&#35268;&#33539;&#30340;&#20256;&#32479;&#25919;&#31574;&#35780;&#20272;&#26041;&#27861;&#12290;&#31532;&#19977;&#65292;&#25105;&#20204;&#20351;&#29992;&#20010;&#20307;&#32423;&#21035;&#20272;&#35745;&#20316;&#20026;&#22238;&#24402;&#21464;&#37327;&#26469;&#30740;&#31350;&#27597;&#22899;&#20043;&#38388;CP&#30340;&#20195;&#38469;&#24377;&#24615;&#12290;&#22312;&#35843;&#25972;&#27979;&#37327;&#35823;&#24046;&#20559;&#24046;&#20043;&#21518;&#65292;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.19563v1 Announce Type: new  Abstract: We provide a practical toolkit for analyzing effect heterogeneity in event studies. We develop an estimation algorithm and adapt existing econometric results to provide its theoretical justification. We apply these tools to Dutch administrative data to study individual heterogeneity in the child-penalty (CP) context in three ways. First, we document significant heterogeneity in the individual-level CP trajectories, emphasizing the importance of going beyond the average CP. Second, we use individual-level estimates to examine the impact of childcare supply expansion policies. Our approach uncovers nonlinear treatment effects, challenging the conventional policy evaluation methods constrained to less flexible specifications. Third, we use the individual-level estimates as a regressor on the right-hand side to study the intergenerational elasticity of the CP between mothers and daughters. After adjusting for the measurement error bias, we f
&lt;/p&gt;</description></item><item><title>&#35813;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#25311;&#36125;&#21494;&#26031;&#26041;&#27861;&#65292;&#32467;&#21512;&#20102;&#31532;&#19968;&#38454;&#27573;&#30340;&#39057;&#29575;&#20027;&#20041;&#20272;&#35745;&#21644;&#31532;&#20108;&#38454;&#27573;&#30340;&#36125;&#21494;&#26031;&#20272;&#35745;/&#25512;&#26029;&#26041;&#27861;&#65292;&#36866;&#29992;&#20110;&#32467;&#26500;&#31163;&#25955;&#36873;&#25321;&#27169;&#22411;&#20013;&#30340;&#20869;&#29983;&#24615;&#20559;&#35823;&#20462;&#27491;&#65292;&#20854;&#20013;&#25311;&#36125;&#21494;&#26031;&#28857;&#20272;&#35745;&#20445;&#25345;&#19968;&#33268;&#65292;&#24182;&#28176;&#36817;&#22320;&#31561;&#20215;&#20110;&#39057;&#29575;&#20027;&#20041;&#20004;&#38454;&#27573;&#20272;&#35745;&#37327;&#12290;</title><link>https://arxiv.org/abs/2402.17374</link><description>&lt;p&gt;
&#20855;&#26377;&#25511;&#21046;&#20989;&#25968;&#30340;&#25311;&#36125;&#21494;&#26031;&#20272;&#35745;&#19982;&#25512;&#26029;
&lt;/p&gt;
&lt;p&gt;
Quasi-Bayesian Estimation and Inference with Control Functions
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.17374
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#25311;&#36125;&#21494;&#26031;&#26041;&#27861;&#65292;&#32467;&#21512;&#20102;&#31532;&#19968;&#38454;&#27573;&#30340;&#39057;&#29575;&#20027;&#20041;&#20272;&#35745;&#21644;&#31532;&#20108;&#38454;&#27573;&#30340;&#36125;&#21494;&#26031;&#20272;&#35745;/&#25512;&#26029;&#26041;&#27861;&#65292;&#36866;&#29992;&#20110;&#32467;&#26500;&#31163;&#25955;&#36873;&#25321;&#27169;&#22411;&#20013;&#30340;&#20869;&#29983;&#24615;&#20559;&#35823;&#20462;&#27491;&#65292;&#20854;&#20013;&#25311;&#36125;&#21494;&#26031;&#28857;&#20272;&#35745;&#20445;&#25345;&#19968;&#33268;&#65292;&#24182;&#28176;&#36817;&#22320;&#31561;&#20215;&#20110;&#39057;&#29575;&#20027;&#20041;&#20004;&#38454;&#27573;&#20272;&#35745;&#37327;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#32771;&#34385;&#19968;&#31181;&#25311;&#36125;&#21494;&#26031;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#22312;&#31532;&#19968;&#38454;&#27573;&#32467;&#21512;&#20102;&#39057;&#29575;&#20027;&#20041;&#20272;&#35745;&#21644;&#31532;&#20108;&#38454;&#27573;&#30340;&#36125;&#21494;&#26031;&#20272;&#35745;/&#25512;&#26029;&#26041;&#27861;&#12290;&#36825;&#39033;&#30740;&#31350;&#21463;&#21040;&#20102;&#20351;&#29992;&#25511;&#21046;&#20989;&#25968;&#26041;&#27861;&#32416;&#27491;&#20869;&#29983;&#24615;&#20559;&#35823;&#30340;&#32467;&#26500;&#31163;&#25955;&#36873;&#25321;&#27169;&#22411;&#30340;&#21551;&#21457;&#12290;&#22312;&#36825;&#31181;&#24773;&#20917;&#19979;&#65292;&#31532;&#19968;&#38454;&#27573;&#20351;&#29992;&#19968;&#20123;&#39057;&#29575;&#20027;&#20041;&#21442;&#25968;&#21270;&#25110;&#38750;&#21442;&#25968;&#21270;&#26041;&#27861;&#26469;&#20272;&#35745;&#25511;&#21046;&#20989;&#25968;&#12290;&#19982;&#19968;&#20123;&#22797;&#26434;&#30340;&#20284;&#28982;&#20989;&#25968;&#30456;&#20851;&#30340;&#32467;&#26500;&#26041;&#31243;&#21487;&#20197;&#26356;&#26041;&#20415;&#22320;&#20351;&#29992;&#36125;&#21494;&#26031;&#26041;&#27861;&#36827;&#34892;&#22788;&#29702;&#12290;&#26412;&#25991;&#30740;&#31350;&#20102;&#20174;&#31532;&#20108;&#38454;&#27573;&#33719;&#24471;&#30340;&#25311;&#21518;&#39564;&#20998;&#24067;&#30340;&#28176;&#36817;&#29305;&#24615;&#12290;&#25105;&#20204;&#35777;&#26126;&#65292;&#30456;&#24212;&#30340;&#25311;&#36125;&#21494;&#26031;&#21487;&#20449;&#38598;&#22312;&#22823;&#26679;&#26412;&#20013;&#19981;&#20855;&#26377;&#25152;&#38656;&#30340;&#35206;&#30422;&#29575;&#12290;&#23613;&#31649;&#22914;&#27492;&#65292;&#25311;&#36125;&#21494;&#26031;&#28857;&#20272;&#35745;&#20445;&#25345;&#19968;&#33268;&#65292;&#24182;&#19988;&#28176;&#36817;&#22320;&#31561;&#20215;&#20110;&#39057;&#29575;&#20027;&#20041;&#20004;&#38454;&#27573;&#20272;&#35745;&#37327;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.17374v1 Announce Type: new  Abstract: We consider a quasi-Bayesian method that combines a frequentist estimation in the first stage and a Bayesian estimation/inference approach in the second stage. The study is motivated by structural discrete choice models that use the control function methodology to correct for endogeneity bias. In this scenario, the first stage estimates the control function using some frequentist parametric or nonparametric approach. The structural equation in the second stage, associated with certain complicated likelihood functions, can be more conveniently dealt with using a Bayesian approach. This paper studies the asymptotic properties of the quasi-posterior distributions obtained from the second stage. We prove that the corresponding quasi-Bayesian credible set does not have the desired coverage in large samples. Nonetheless, the quasi-Bayesian point estimator remains consistent and is asymptotically equivalent to a frequentist two-stage estimator.
&lt;/p&gt;</description></item><item><title>&#25197;&#26354;&#26368;&#20248;&#20256;&#36755;&#26159;&#19968;&#31181;&#26032;&#30340;&#20256;&#36755;&#26041;&#27861;&#65292;&#36890;&#36807;&#26368;&#23567;&#21270;&#25197;&#26354;&#30340;&#39044;&#26399;&#25104;&#26412;&#26469;&#35299;&#20915;&#20855;&#20307;&#38382;&#39064;&#12290;&#19982;&#32463;&#20856;&#29702;&#35770;&#30456;&#27604;&#65292;&#23427;&#20855;&#26377;&#35768;&#22810;&#29420;&#29305;&#30340;&#29305;&#28857;&#65292;&#21487;&#20197;&#24212;&#29992;&#20110;&#20915;&#31574;&#29702;&#35770;&#12289;&#40065;&#26834;&#20248;&#21270;&#21644;&#39118;&#38505;&#31649;&#29702;&#20013;&#12290;&#20849;&#21333;&#35843;&#32806;&#21512;&#26159;&#22312;&#28385;&#36275;&#19968;&#23450;&#26465;&#20214;&#19979;&#30340;&#26368;&#20248;&#35299;&#12290;&#35813;&#26041;&#27861;&#36824;&#20855;&#26377;&#19968;&#20123;&#23545;&#20598;&#24615;&#21644;&#21807;&#19968;&#24615;&#32467;&#26524;&#12290;</title><link>http://arxiv.org/abs/2308.11238</link><description>&lt;p&gt;
&#25197;&#26354;&#30340;&#26368;&#20248;&#20256;&#36755;
&lt;/p&gt;
&lt;p&gt;
Distorted optimal transport. (arXiv:2308.11238v1 [math.OC])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.11238
&lt;/p&gt;
&lt;p&gt;
&#25197;&#26354;&#26368;&#20248;&#20256;&#36755;&#26159;&#19968;&#31181;&#26032;&#30340;&#20256;&#36755;&#26041;&#27861;&#65292;&#36890;&#36807;&#26368;&#23567;&#21270;&#25197;&#26354;&#30340;&#39044;&#26399;&#25104;&#26412;&#26469;&#35299;&#20915;&#20855;&#20307;&#38382;&#39064;&#12290;&#19982;&#32463;&#20856;&#29702;&#35770;&#30456;&#27604;&#65292;&#23427;&#20855;&#26377;&#35768;&#22810;&#29420;&#29305;&#30340;&#29305;&#28857;&#65292;&#21487;&#20197;&#24212;&#29992;&#20110;&#20915;&#31574;&#29702;&#35770;&#12289;&#40065;&#26834;&#20248;&#21270;&#21644;&#39118;&#38505;&#31649;&#29702;&#20013;&#12290;&#20849;&#21333;&#35843;&#32806;&#21512;&#26159;&#22312;&#28385;&#36275;&#19968;&#23450;&#26465;&#20214;&#19979;&#30340;&#26368;&#20248;&#35299;&#12290;&#35813;&#26041;&#27861;&#36824;&#20855;&#26377;&#19968;&#20123;&#23545;&#20598;&#24615;&#21644;&#21807;&#19968;&#24615;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#32463;&#20856;&#30340;&#26368;&#20248;&#20256;&#36755;&#29702;&#35770;&#26159;&#36890;&#36807;&#26368;&#23567;&#21270;&#20004;&#20010;&#32473;&#23450;&#20998;&#24067;&#20043;&#38388;&#30340;&#39044;&#26399;&#25104;&#26412;&#26469;&#24314;&#31435;&#30340;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#25197;&#26354;&#26368;&#20248;&#20256;&#36755;&#30340;&#26694;&#26550;&#65292;&#36890;&#36807;&#26368;&#23567;&#21270;&#25197;&#26354;&#30340;&#39044;&#26399;&#25104;&#26412;&#26469;&#23454;&#29616;&#12290;&#36825;&#20010;&#26032;&#30340;&#20844;&#24335;&#26159;&#22522;&#20110;&#20915;&#31574;&#29702;&#35770;&#12289;&#40065;&#26834;&#20248;&#21270;&#21644;&#39118;&#38505;&#31649;&#29702;&#20013;&#30340;&#20855;&#20307;&#38382;&#39064;&#32780;&#25552;&#20986;&#30340;&#65292;&#19982;&#32463;&#20856;&#29702;&#35770;&#30456;&#27604;&#20855;&#26377;&#24456;&#22810;&#19981;&#21516;&#30340;&#29305;&#28857;&#12290;&#25105;&#20204;&#36873;&#25321;&#20102;&#31616;&#21333;&#30340;&#25104;&#26412;&#20989;&#25968;&#65292;&#24182;&#30740;&#31350;&#20102;&#19981;&#21516;&#30340;&#25197;&#26354;&#20989;&#25968;&#21450;&#20854;&#23545;&#26368;&#20248;&#20256;&#36755;&#35745;&#21010;&#30340;&#24433;&#21709;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#22312;&#23454;&#32447;&#19978;&#65292;&#24403;&#25197;&#26354;&#20989;&#25968;&#26159;&#20984;&#20989;&#25968;&#19988;&#25104;&#26412;&#20989;&#25968;&#26159;&#27425;&#27169;&#20989;&#25968;&#21644;&#21333;&#35843;&#20989;&#25968;&#26102;&#65292;&#20849;&#21333;&#35843;&#32806;&#21512;&#26159;&#25197;&#26354;&#26368;&#20248;&#20256;&#36755;&#38382;&#39064;&#30340;&#26368;&#20248;&#35299;&#12290;&#25105;&#20204;&#36824;&#25552;&#20379;&#20102;&#19968;&#20123;&#23545;&#20598;&#24615;&#21644;&#21807;&#19968;&#24615;&#32467;&#26524;&#12290;&#23545;&#20110;&#36870;S&#24418;&#25197;&#26354;&#20989;&#25968;&#21644;&#32447;&#24615;&#25104;&#26412;&#65292;&#25105;&#20204;&#24471;&#21040;&#20102;&#25152;&#26377;&#36793;&#38469;&#20998;&#24067;&#30340;&#21807;&#19968;&#26368;&#20248;&#32806;&#21512;&#24418;&#24335;&#65292;&#36825;&#20010;&#24418;&#24335;&#30340;&#32806;&#21512;&#20855;&#26377;&#26377;&#36259;&#30340;&#8220;&#39318;&#20808;&#20849;&#21333;&#35843;&#65292;&#28982;&#21518;&#21453;&#21333;&#35843;&#8221;&#20381;&#36182;&#20851;&#31995;&#12290;
&lt;/p&gt;
&lt;p&gt;
Classic optimal transport theory is built on minimizing the expected cost between two given distributions. We propose the framework of distorted optimal transport by minimizing a distorted expected cost. This new formulation is motivated by concrete problems in decision theory, robust optimization, and risk management, and it has many distinct features compared to the classic theory. We choose simple cost functions and study different distortion functions and their implications on the optimal transport plan. We show that on the real line, the comonotonic coupling is optimal for the distorted optimal transport problem when the distortion function is convex and the cost function is submodular and monotone. Some forms of duality and uniqueness results are provided. For inverse-S-shaped distortion functions and linear cost, we obtain the unique form of optimal coupling for all marginal distributions, which turns out to have an interesting ``first comonotonic, then counter-monotonic" depend
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#20351;&#29992;&#19968;&#31181;&#22522;&#20110;&#26234;&#33021;&#20307;&#27169;&#22411;&#30340;&#26032;&#26041;&#27861;&#65292;&#30740;&#31350;&#20102;&#30123;&#21518;&#36890;&#32960;&#19982;&#36135;&#24065;&#25919;&#31574;&#30340;&#22256;&#22659;&#65292;&#36890;&#36807;&#30740;&#31350;&#19977;&#31181;&#22806;&#37096;&#20914;&#20987;&#30340;&#24433;&#21709;&#65292;&#25506;&#31350;&#30417;&#31649;&#25919;&#31574;&#23545;&#36890;&#32960;&#21160;&#24577;&#30340;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2306.01284</link><description>&lt;p&gt;
&#30123;&#21518;&#36890;&#32960;&#19982;&#36135;&#24065;&#25919;&#31574;&#22256;&#22659;&#65306;&#19968;&#39033;&#22522;&#20110;&#26234;&#33021;&#20307;&#22330;&#26223;&#20998;&#26512;&#30340;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Post-COVID Inflation &amp; the Monetary Policy Dilemma: An Agent-Based Scenario Analysis. (arXiv:2306.01284v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.01284
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20351;&#29992;&#19968;&#31181;&#22522;&#20110;&#26234;&#33021;&#20307;&#27169;&#22411;&#30340;&#26032;&#26041;&#27861;&#65292;&#30740;&#31350;&#20102;&#30123;&#21518;&#36890;&#32960;&#19982;&#36135;&#24065;&#25919;&#31574;&#30340;&#22256;&#22659;&#65292;&#36890;&#36807;&#30740;&#31350;&#19977;&#31181;&#22806;&#37096;&#20914;&#20987;&#30340;&#24433;&#21709;&#65292;&#25506;&#31350;&#30417;&#31649;&#25919;&#31574;&#23545;&#36890;&#32960;&#21160;&#24577;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
COVID-19&#24102;&#26469;&#30340;&#32463;&#27982;&#20914;&#20987;&#20984;&#26174;&#20102;&#25551;&#36848;&#21644;&#39044;&#27979;&#36890;&#32960;&#21160;&#24577;&#30340;&#22256;&#38590;&#65292;&#26412;&#25991;&#25552;&#20379;&#20102;&#19968;&#31181;&#26367;&#20195;&#24314;&#27169;&#26041;&#27861;&#12290;&#25105;&#20204;&#20351;&#29992;&#32463;&#36807;&#33391;&#22909;&#30740;&#31350;&#30340;Mark-0&#26234;&#33021;&#20307;&#27169;&#22411;&#65292;&#30740;&#31350;2020-2023&#24180;&#30340;&#24773;&#20917;&#65292;&#24182;&#21253;&#25324;&#19968;&#31181;&#26426;&#21046;&#65292;&#20351;&#32463;&#27982;&#20027;&#20307;&#23545;&#20013;&#22830;&#38134;&#34892;&#30340;&#20449;&#20219;&#21487;&#20197;&#35299;&#38500;&#12290;&#25105;&#20204;&#30740;&#31350;&#20102;&#30417;&#31649;&#25919;&#31574;&#23545;&#30001;COVID-19&#24341;&#21457;&#30340;&#19977;&#31181;&#22806;&#37096;&#20914;&#20987;&#25152;&#23548;&#33268;&#30340;&#36890;&#32960;&#21160;&#24577;&#30340;&#24433;&#21709;&#65306;&#30001;COVID&#30456;&#20851;&#23553;&#38145;&#24341;&#36215;&#30340;&#29983;&#20135;/&#28040;&#36153;&#20914;&#20987;&#12289;&#20379;&#24212;&#38142;&#20914;&#20987;&#20197;&#21450;&#20420;&#32599;&#26031;&#20837;&#20405;&#20044;&#20811;&#20848;&#21152;&#21095;&#30340;&#33021;&#28304;&#20215;&#26684;&#20914;&#20987;&#12290;&#36890;&#36807;&#22312;&#19981;&#21516;&#30340;&#36135;&#24065;&#25919;&#31574;&#25928;&#21147;&#21644;&#20256;&#23548;&#28192;&#36947;&#30340;&#20551;&#35774;&#19979;&#25506;&#31350;&#36825;&#20123;&#20914;&#20987;&#30340;&#24433;&#21709;&#65292;&#25105;&#20204;&#22238;&#39038;&#20102;&#21508;&#31181;&#35299;&#37322;&#12290;
&lt;/p&gt;
&lt;p&gt;
The economic shocks that followed the COVID-19 pandemic have brought to light the difficulty, both for academics and policy makers, of describing and predicting the dynamics of inflation. This paper offers an alternative modelling approach. We study the 2020-2023 period within the well-studied Mark-0 Agent-Based Model, in which economic agents act and react according to plausible behavioural rules. We include in particular a mechanism through which trust of economic agents in the Central Bank can de-anchor. We investigate the influence of regulatory policies on inflationary dynamics resulting from three exogenous shocks, calibrated on those that followed the COVID-19 pandemic: a production/consumption shock due to COVID-related lockdowns, a supply-chain shock, and an energy price shock exacerbated by the Russian invasion of Ukraine. By exploring the impact of these shocks under different assumptions about monetary policy efficacy and transmission channels, we review various explanation
&lt;/p&gt;</description></item></channel></rss>