<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#24503;&#22269;&#24341;&#20837;&#22269;&#23478;&#26368;&#20302;&#24037;&#36164;&#21518;&#65292;&#21457;&#29616;&#26368;&#20302;&#24037;&#36164;&#26174;&#33879;&#38477;&#20302;&#20102;&#24037;&#36164;&#30340;&#19981;&#24179;&#31561;&#24615;&#65292;&#23545;&#24037;&#20316;&#26102;&#38388;&#25972;&#20307;&#24433;&#21709;&#19981;&#22823;&#65292;&#20294;&#23545;&#36855;&#20320;&#24037;&#20316;&#20154;&#21592;&#30340;&#24037;&#20316;&#26102;&#38388;&#26377;&#26174;&#33879;&#20943;&#23569;&#65292;&#24182;&#23548;&#33268;&#36855;&#20320;&#24037;&#20316;&#23703;&#20301;&#26126;&#26174;&#20943;&#23569;&#65292;&#37096;&#20998;&#36716;&#21521;&#26222;&#36890;&#23601;&#19994;&#21644;&#38750;&#23601;&#19994;&#12290;</title><link>https://arxiv.org/abs/2403.17206</link><description>&lt;p&gt;
&#32454;&#33410;&#20915;&#23450;&#25104;&#36133;&#65306;&#24503;&#22269;&#26368;&#20302;&#24037;&#36164;&#23545;&#24037;&#20316;&#26102;&#38388;&#21644;&#36855;&#20320;&#24037;&#20316;&#30340;&#24322;&#36136;&#24433;&#21709;
&lt;/p&gt;
&lt;p&gt;
The Devil is in the Details: Heterogeneous Effects of the German Minimum Wage on Working Hours and Minijobs
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.17206
&lt;/p&gt;
&lt;p&gt;
&#24503;&#22269;&#24341;&#20837;&#22269;&#23478;&#26368;&#20302;&#24037;&#36164;&#21518;&#65292;&#21457;&#29616;&#26368;&#20302;&#24037;&#36164;&#26174;&#33879;&#38477;&#20302;&#20102;&#24037;&#36164;&#30340;&#19981;&#24179;&#31561;&#24615;&#65292;&#23545;&#24037;&#20316;&#26102;&#38388;&#25972;&#20307;&#24433;&#21709;&#19981;&#22823;&#65292;&#20294;&#23545;&#36855;&#20320;&#24037;&#20316;&#20154;&#21592;&#30340;&#24037;&#20316;&#26102;&#38388;&#26377;&#26174;&#33879;&#20943;&#23569;&#65292;&#24182;&#23548;&#33268;&#36855;&#20320;&#24037;&#20316;&#23703;&#20301;&#26126;&#26174;&#20943;&#23569;&#65292;&#37096;&#20998;&#36716;&#21521;&#26222;&#36890;&#23601;&#19994;&#21644;&#38750;&#23601;&#19994;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
2015&#24180;&#65292;&#24503;&#22269;&#24341;&#20837;&#20102;&#22269;&#23478;&#26368;&#20302;&#24037;&#36164;&#26631;&#20934;&#12290;&#34429;&#28982;&#25991;&#29486;&#26222;&#36941;&#35748;&#20026;&#23545;&#25972;&#20307;&#23601;&#19994;&#27700;&#24179;&#30340;&#36127;&#38754;&#24433;&#21709;&#33267;&#22810;&#24456;&#26377;&#38480;&#65292;&#20294;&#25105;&#20204;&#28145;&#20837;&#32454;&#33410;&#20998;&#26512;&#20102;&#23545;&#24037;&#20316;&#26102;&#38388;&#32500;&#24230;&#21644;&#36855;&#20320;&#24037;&#20316;&#23376;&#38598;&#30340;&#24433;&#21709;&#12290;&#21033;&#29992;2010&#24180;&#12289;2014&#24180;&#21644;2018&#24180;&#24503;&#22269;&#25910;&#20837;&#32467;&#26500;&#35843;&#26597;&#30340;&#25968;&#25454;&#65292;&#25105;&#20204;&#25214;&#21040;&#20102;&#23454;&#35777;&#35777;&#25454;&#34920;&#26126;&#26368;&#20302;&#24037;&#36164;&#26174;&#33879;&#38477;&#20302;&#20102;&#23567;&#26102;&#24037;&#36164;&#21644;&#26376;&#24037;&#36164;&#30340;&#19981;&#24179;&#31561;&#12290;&#34429;&#28982;&#21508;&#31181;&#29702;&#35770;&#26426;&#21046;&#24314;&#35758;&#24037;&#20316;&#26102;&#38388;&#20250;&#20943;&#23569;&#65292;&#20294;&#22312;&#24179;&#22343;&#27700;&#24179;&#19978;&#20173;&#28982;&#20445;&#25345;&#19981;&#21464;&#12290;&#28982;&#32780;&#65292;&#36855;&#20320;&#24037;&#20316;&#20154;&#21592;&#30340;&#24037;&#20316;&#26102;&#38388;&#26126;&#26174;&#20943;&#23569;&#65292;&#36825;&#21487;&#20197;&#19982;&#29305;&#23450;&#30340;&#21046;&#24230;&#26694;&#26550;&#32852;&#31995;&#36215;&#26469;&#12290;&#20851;&#20110;&#23601;&#19994;&#65292;&#32467;&#26524;&#34920;&#26126;&#26222;&#36890;&#24037;&#20316;&#27809;&#26377;&#24433;&#21709;&#65292;&#20294;&#36855;&#20320;&#24037;&#20316;&#26126;&#26174;&#20943;&#23569;&#65292;&#36825;&#26159;&#30001;&#20110;&#21521;&#26222;&#36890;&#23601;&#19994;&#21644;&#38750;&#23601;&#19994;&#30340;&#36716;&#21464;&#25152;&#39537;&#21160;&#30340;&#12290;&#38750;&#23601;&#19994;&#30340;&#36716;&#21464;&#24847;&#21619;&#30528;&#23601;&#19994;&#30340;&#24037;&#36164;&#24377;&#24615;&#20026;-0.1&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.17206v1 Announce Type: new  Abstract: In 2015, Germany introduced a national minimum wage. While the literature agrees on at most limited negative effects on the overall employment level, we go into detail and analyze the impact on the working hours dimension and on the subset of minijobs. Using data from the German Structure of Earnings Survey in 2010, 2014, and 2018, we find empirical evidence that the minimum wage significantly reduces inequality in hourly and monthly wages. While various theoretical mechanisms suggest a reduction in working hours, these remain unchanged on average. However, minijobbers experience a notable reduction in working hours which can be linked to the specific institutional framework. Regarding employment, the results show no effects for regular jobs, but there is a noteworthy decline in minijobs, driven by transitions to regular employment and non-employment. The transitions in non-employment imply a wage elasticity of employment of $-0.1$ for m
&lt;/p&gt;</description></item></channel></rss>