<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#36825;&#31687;&#35770;&#25991;&#25552;&#20379;&#20102;&#19968;&#20010;&#26032;&#30340;&#39118;&#38505;&#21388;&#24694;&#22522;&#30784;&#65292;&#36890;&#36807;&#23637;&#31034;&#20805;&#20998;&#21033;&#29992;&#20445;&#38505;&#26426;&#20250;&#30340;&#20542;&#21521;&#26469;&#25551;&#36848;&#36825;&#31181;&#24577;&#24230;&#65292;&#24182;&#19988;&#25104;&#21151;&#22320;&#23558;&#39118;&#38505;&#21388;&#24694;&#19982;&#19981;&#21516;&#20445;&#38505;&#20542;&#21521;&#32852;&#31995;&#36215;&#26469;&#65292;&#20026;&#27604;&#36739;&#39118;&#38505;&#21388;&#24694;&#25552;&#20379;&#20102;&#19968;&#31181;&#26032;&#30340;&#35299;&#37322;&#12290;</title><link>http://arxiv.org/abs/2310.09173</link><description>&lt;p&gt;
&#39118;&#38505;&#21388;&#24694;&#21644;&#20445;&#38505;&#20542;&#21521;
&lt;/p&gt;
&lt;p&gt;
Risk Aversion and Insurance Propensity. (arXiv:2310.09173v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.09173
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#25552;&#20379;&#20102;&#19968;&#20010;&#26032;&#30340;&#39118;&#38505;&#21388;&#24694;&#22522;&#30784;&#65292;&#36890;&#36807;&#23637;&#31034;&#20805;&#20998;&#21033;&#29992;&#20445;&#38505;&#26426;&#20250;&#30340;&#20542;&#21521;&#26469;&#25551;&#36848;&#36825;&#31181;&#24577;&#24230;&#65292;&#24182;&#19988;&#25104;&#21151;&#22320;&#23558;&#39118;&#38505;&#21388;&#24694;&#19982;&#19981;&#21516;&#20445;&#38505;&#20542;&#21521;&#32852;&#31995;&#36215;&#26469;&#65292;&#20026;&#27604;&#36739;&#39118;&#38505;&#21388;&#24694;&#25552;&#20379;&#20102;&#19968;&#31181;&#26032;&#30340;&#35299;&#37322;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#36890;&#36807;&#23637;&#31034;&#20805;&#20998;&#21033;&#29992;&#20445;&#38505;&#26426;&#20250;&#30340;&#20542;&#21521;&#26469;&#25552;&#20379;&#19968;&#20010;&#26032;&#30340;&#39118;&#38505;&#21388;&#24694;&#22522;&#30784;&#65292;&#36825;&#20010;&#22522;&#30784;&#36866;&#29992;&#20110;&#20219;&#20309;&#27010;&#29575;&#30340;&#22797;&#26434;&#20559;&#22909;&#65292;&#19982;Arrow (1963)&#21644;Pratt (1964)&#30340;&#32463;&#20856;&#20316;&#21697;&#25152;&#25552;&#20379;&#30340;&#39118;&#38505;&#21388;&#24694;&#30340;&#35880;&#24910;&#35299;&#37322;&#30456;&#19968;&#33268;&#12290;&#22312;&#25105;&#20204;&#30340;&#20027;&#35201;&#32467;&#26524;&#20013;&#65292;&#25105;&#20204;&#39318;&#20808;&#20197;&#20805;&#20998;&#20445;&#38505;&#30340;&#20542;&#21521;&#34920;&#24449;&#20102;Arrow-Pratt&#30340;&#39118;&#38505;&#21388;&#24694;&#65292;&#20197;&#37096;&#20998;&#20445;&#38505;&#30340;&#20542;&#21521;&#34920;&#29616;&#20986;&#20102;Rothschild&#21644;Stiglitz(1970)&#30340;&#26356;&#24378;&#39118;&#38505;&#21388;&#24694;&#12290;&#28982;&#21518;&#25105;&#20204;&#23558;&#35813;&#20998;&#26512;&#25193;&#23637;&#21040;&#27604;&#36739;&#39118;&#38505;&#21388;&#24694;&#65292;&#36890;&#36807;&#23637;&#31034;Yaari(1969)&#30340;&#27010;&#24565;&#23545;&#24212;&#20110;&#23545;&#20805;&#20998;&#20445;&#38505;&#30340;&#27604;&#36739;&#20542;&#21521;&#65292;&#32780;Ross(1981)&#30340;&#26356;&#24378;&#27010;&#24565;&#23545;&#24212;&#20110;&#23545;&#37096;&#20998;&#20445;&#38505;&#30340;&#27604;&#36739;&#20542;&#21521;&#12290;
&lt;/p&gt;
&lt;p&gt;
We provide a new foundation of risk aversion by showing that the propension to exploit insurance opportunities fully describes this attitude. Our foundation, which applies to any probabilistically sophisticated preference, well accords with the commonly held prudential interpretation of risk aversion that dates back to the seminal works of Arrow (1963) and Pratt (1964).  In our main results, we first characterize the Arrow-Pratt risk aversion in terms of propension to full insurance and the stronger notion of risk aversion of Rothschild and Stiglitz (1970) in terms of propension to partial insurance. We then extend the analysis to comparative risk aversion by showing that the notion of Yaari (1969) corresponds to comparative propension to full insurance, while the stronger notion of Ross (1981) corresponds to comparative propension to partial insurance.
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#22238;&#24402;&#30340;&#26041;&#27861;&#65292;&#29992;&#20110;&#20272;&#35745;&#20010;&#20307;&#23545;&#23545;&#31435;&#24773;&#20917;&#30340;&#21453;&#24212;&#12290;&#36890;&#36807;&#24212;&#29992;&#35813;&#26041;&#27861;&#20110;&#24847;&#22823;&#21033;&#30340;&#35843;&#26597;&#25968;&#25454;&#65292;&#30740;&#31350;&#21457;&#29616;&#32771;&#34385;&#20010;&#20307;&#30340;&#20449;&#24565;&#23545;&#31246;&#25910;&#25919;&#31574;&#23545;&#28040;&#36153;&#20915;&#31574;&#30340;&#24433;&#21709;&#24456;&#37325;&#35201;&#12290;</title><link>http://arxiv.org/abs/2310.09105</link><description>&lt;p&gt;
&#20272;&#35745;&#26126;&#22825;&#37325;&#35201;&#26102;&#30340;&#20010;&#20307;&#21453;&#24212;
&lt;/p&gt;
&lt;p&gt;
Estimating Individual Responses when Tomorrow Matters. (arXiv:2310.09105v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.09105
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#22238;&#24402;&#30340;&#26041;&#27861;&#65292;&#29992;&#20110;&#20272;&#35745;&#20010;&#20307;&#23545;&#23545;&#31435;&#24773;&#20917;&#30340;&#21453;&#24212;&#12290;&#36890;&#36807;&#24212;&#29992;&#35813;&#26041;&#27861;&#20110;&#24847;&#22823;&#21033;&#30340;&#35843;&#26597;&#25968;&#25454;&#65292;&#30740;&#31350;&#21457;&#29616;&#32771;&#34385;&#20010;&#20307;&#30340;&#20449;&#24565;&#23545;&#31246;&#25910;&#25919;&#31574;&#23545;&#28040;&#36153;&#20915;&#31574;&#30340;&#24433;&#21709;&#24456;&#37325;&#35201;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#22238;&#24402;&#30340;&#26041;&#27861;&#65292;&#29992;&#20110;&#20272;&#35745;&#20010;&#20307;&#30340;&#26399;&#26395;&#22914;&#20309;&#24433;&#21709;&#20182;&#20204;&#23545;&#23545;&#31435;&#24773;&#20917;&#30340;&#21453;&#24212;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#22522;&#20110;&#22238;&#24402;&#20272;&#35745;&#30340;&#24179;&#22343;&#20559;&#25928;&#24212;&#24674;&#22797;&#32467;&#26500;&#25928;&#24212;&#30340;&#26465;&#20214;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#20381;&#36182;&#20110;&#20027;&#35266;&#20449;&#24565;&#25968;&#25454;&#30340;&#23454;&#29992;&#30340;&#19977;&#27493;&#20272;&#35745;&#26041;&#27861;&#12290;&#25105;&#20204;&#22312;&#19968;&#20010;&#28040;&#36153;&#21644;&#20648;&#33988;&#27169;&#22411;&#20013;&#35828;&#26126;&#20102;&#25105;&#20204;&#30340;&#26041;&#27861;&#65292;&#37325;&#28857;&#20851;&#27880;&#19981;&#20165;&#25913;&#21464;&#24403;&#21069;&#25910;&#20837;&#32780;&#19988;&#24433;&#21709;&#23545;&#26410;&#26469;&#25910;&#20837;&#30340;&#20449;&#24565;&#30340;&#25152;&#24471;&#31246;&#30340;&#24433;&#21709;&#12290;&#36890;&#36807;&#23558;&#25105;&#20204;&#30340;&#26041;&#27861;&#24212;&#29992;&#20110;&#24847;&#22823;&#21033;&#30340;&#35843;&#26597;&#25968;&#25454;&#65292;&#25105;&#20204;&#21457;&#29616;&#32771;&#34385;&#20010;&#20307;&#30340;&#20449;&#24565;&#23545;&#35780;&#20272;&#31246;&#25910;&#25919;&#31574;&#23545;&#28040;&#36153;&#20915;&#31574;&#30340;&#24433;&#21709;&#24456;&#37325;&#35201;&#12290;
&lt;/p&gt;
&lt;p&gt;
We propose a regression-based approach to estimate how individuals' expectations influence their responses to a counterfactual change. We provide conditions under which average partial effects based on regression estimates recover structural effects. We propose a practical three-step estimation method that relies on subjective beliefs data. We illustrate our approach in a model of consumption and saving, focusing on the impact of an income tax that not only changes current income but also affects beliefs about future income. By applying our approach to survey data from Italy, we find that considering individuals' beliefs matter for evaluating the impact of tax policies on consumption decisions.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#24179;&#28369;&#30340;&#24037;&#20855;&#21464;&#37327;&#20998;&#20301;&#25968;&#22238;&#24402;&#27169;&#22411;&#20272;&#35745;&#26041;&#27861;&#65292;&#25913;&#36827;&#20102;&#35745;&#31639;&#26102;&#38388;&#21644;&#32479;&#35745;&#31934;&#24230;&#12290;&#35813;&#26041;&#27861;&#21487;&#20197;&#29992;&#20110;&#22788;&#29702;IV&#20998;&#20301;&#25968;&#22238;&#24402;&#27169;&#22411;&#65292;&#24182;&#19982;&#20854;&#20182;&#26041;&#27861;&#36827;&#34892;&#20102;&#27604;&#36739;&#12290;</title><link>http://arxiv.org/abs/2310.09013</link><description>&lt;p&gt;
&#24179;&#28369;&#30340;&#24037;&#20855;&#21464;&#37327;&#20998;&#20301;&#25968;&#22238;&#24402;
&lt;/p&gt;
&lt;p&gt;
Smoothed instrumental variables quantile regression. (arXiv:2310.09013v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.09013
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#24179;&#28369;&#30340;&#24037;&#20855;&#21464;&#37327;&#20998;&#20301;&#25968;&#22238;&#24402;&#27169;&#22411;&#20272;&#35745;&#26041;&#27861;&#65292;&#25913;&#36827;&#20102;&#35745;&#31639;&#26102;&#38388;&#21644;&#32479;&#35745;&#31934;&#24230;&#12290;&#35813;&#26041;&#27861;&#21487;&#20197;&#29992;&#20110;&#22788;&#29702;IV&#20998;&#20301;&#25968;&#22238;&#24402;&#27169;&#22411;&#65292;&#24182;&#19982;&#20854;&#20182;&#26041;&#27861;&#36827;&#34892;&#20102;&#27604;&#36739;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;sivqr&#21629;&#20196;&#65292;&#35813;&#21629;&#20196;&#29992;&#20110;&#20272;&#35745;&#30001;Chernozhukov&#21644;Hansen (2005)&#24341;&#20837;&#30340;&#24037;&#20855;&#21464;&#37327;(IV)&#20998;&#20301;&#25968;&#22238;&#24402;&#27169;&#22411;&#30340;&#31995;&#25968;&#12290;&#19982;&#29616;&#26377;&#30340;ivqreg&#21644;ivqreg2&#21629;&#20196;&#30456;&#27604;&#65292;sivqr&#21629;&#20196;&#22312;&#20272;&#35745;&#35813;IV&#20998;&#20301;&#25968;&#22238;&#24402;&#27169;&#22411;&#26041;&#38754;&#20855;&#26377;&#20960;&#20010;&#20248;&#21183;&#12290;&#22312;&#35745;&#31639;&#26041;&#38754;&#65292;sivqr&#23454;&#29616;&#20102;Kaplan&#21644;Sun (2017)&#30340;&#24179;&#28369;&#20272;&#35745;&#22120;&#65292;&#20182;&#20204;&#35777;&#26126;&#24179;&#28369;&#33021;&#22815;&#25552;&#39640;&#35745;&#31639;&#26102;&#38388;&#21644;&#32479;&#35745;&#31934;&#24230;&#12290;&#26631;&#20934;&#35823;&#24046;&#36890;&#36807;&#35299;&#26512;&#26041;&#27861;&#25110;&#36125;&#21494;&#26031;bootstrap&#35745;&#31639;&#65307;&#23545;&#20110;&#38750;&#29420;&#31435;&#21516;&#20998;&#24067;&#37319;&#26679;&#65292;sivqr&#19982;bootstrap&#20860;&#23481;&#12290;&#25991;&#31456;&#35752;&#35770;&#20102;&#35821;&#27861;&#21644;&#22522;&#26412;&#26041;&#27861;&#65292;&#24182;&#22312;&#19968;&#20010;&#20363;&#23376;&#20013;&#23558;sivqr&#19982;&#20854;&#20182;&#21629;&#20196;&#36827;&#34892;&#20102;&#27604;&#36739;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this article, I introduce the sivqr command, which estimates the coefficients of the instrumental variables (IV) quantile regression model introduced by Chernozhukov and Hansen (2005). The sivqr command offers several advantages over the existing ivqreg and ivqreg2 commands for estimating this IV quantile regression model, which complements the alternative "triangular model" behind cqiv and the "local quantile treatment effect" model of ivqte. Computationally, sivqr implements the smoothed estimator of Kaplan and Sun (2017), who show that smoothing improves both computation time and statistical accuracy. Standard errors are computed analytically or by Bayesian bootstrap; for non-iid sampling, sivqr is compatible with bootstrap. I discuss syntax and the underlying methodology, and I compare sivqr with other commands in an example.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#36890;&#36807;&#19968;&#20010;AI-Powered&#22260;&#26827;&#31243;&#24207;&#65288;APG&#65289;&#30340;&#24341;&#20837;&#65292;&#21457;&#29616;&#20154;&#31867;&#20174;&#20154;&#24037;&#26234;&#33021;&#20013;&#23398;&#20064;&#21487;&#20197;&#26174;&#33879;&#25552;&#39640;&#30528;&#27861;&#36136;&#37327;&#65292;&#24182;&#20943;&#23569;&#38169;&#35823;&#25968;&#37327;&#21644;&#22823;&#23567;&#12290;&#24180;&#36731;&#36873;&#25163;&#21644;&#25509;&#35302;&#36807;&#20154;&#24037;&#26234;&#33021;&#30340;&#22269;&#23478;&#30340;&#36873;&#25163;&#33719;&#24471;&#20102;&#26356;&#22823;&#30340;&#25913;&#36827;&#65292;&#25216;&#26415;&#36739;&#24046;&#30340;&#36873;&#25163;&#33719;&#24471;&#20102;&#26356;&#39640;&#30340;&#36793;&#38469;&#25928;&#30410;&#12290;</title><link>http://arxiv.org/abs/2310.08704</link><description>&lt;p&gt;
&#20154;&#24037;&#26234;&#33021;&#22914;&#20309;&#25552;&#21319;&#20154;&#31867;&#20915;&#31574;&#33021;&#21147;&#65311;&#26469;&#33258;AI-Powered&#22260;&#26827;&#31243;&#24207;&#30340;&#35777;&#25454;&#12290;
&lt;/p&gt;
&lt;p&gt;
How Does Artificial Intelligence Improve Human Decision-Making? Evidence from the AI-Powered Go Program. (arXiv:2310.08704v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.08704
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#36890;&#36807;&#19968;&#20010;AI-Powered&#22260;&#26827;&#31243;&#24207;&#65288;APG&#65289;&#30340;&#24341;&#20837;&#65292;&#21457;&#29616;&#20154;&#31867;&#20174;&#20154;&#24037;&#26234;&#33021;&#20013;&#23398;&#20064;&#21487;&#20197;&#26174;&#33879;&#25552;&#39640;&#30528;&#27861;&#36136;&#37327;&#65292;&#24182;&#20943;&#23569;&#38169;&#35823;&#25968;&#37327;&#21644;&#22823;&#23567;&#12290;&#24180;&#36731;&#36873;&#25163;&#21644;&#25509;&#35302;&#36807;&#20154;&#24037;&#26234;&#33021;&#30340;&#22269;&#23478;&#30340;&#36873;&#25163;&#33719;&#24471;&#20102;&#26356;&#22823;&#30340;&#25913;&#36827;&#65292;&#25216;&#26415;&#36739;&#24046;&#30340;&#36873;&#25163;&#33719;&#24471;&#20102;&#26356;&#39640;&#30340;&#36793;&#38469;&#25928;&#30410;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#20154;&#31867;&#22914;&#20309;&#20174;&#20154;&#24037;&#26234;&#33021;&#20013;&#23398;&#20064;&#65292;&#21033;&#29992;&#20102;&#19968;&#20010;&#31361;&#28982;&#20987;&#36133;&#26368;&#22909;&#30340;&#32844;&#19994;&#36873;&#25163;&#30340;AI-Powered&#22260;&#26827;&#31243;&#24207;&#65288;APG&#65289;&#30340;&#24341;&#20837;&#12290;&#25105;&#20204;&#27604;&#36739;&#20102;&#32844;&#19994;&#36873;&#25163;&#30340;&#30528;&#27861;&#36136;&#37327;&#21644;APG&#22312;&#20854;&#20844;&#24320;&#21457;&#24067;&#21069;&#21518;&#30340;&#21331;&#36234;&#35299;&#20915;&#26041;&#26696;&#30340;&#30528;&#27861;&#36136;&#37327;&#12290;&#25105;&#20204;&#20998;&#26512;&#20102;749,190&#20010;&#30528;&#27861;&#65292;&#21457;&#29616;&#20102;&#29609;&#23478;&#30528;&#27861;&#36136;&#37327;&#30340;&#26174;&#33879;&#25552;&#21319;&#65292;&#21516;&#26102;&#38169;&#35823;&#25968;&#37327;&#21644;&#22823;&#23567;&#30340;&#20943;&#23569;&#12290;&#36825;&#31181;&#25928;&#26524;&#22312;&#27604;&#36187;&#30340;&#21021;&#26399;&#38454;&#27573;&#23588;&#20026;&#26174;&#33879;&#65292;&#22240;&#20026;&#27492;&#26102;&#19981;&#30830;&#23450;&#24615;&#26368;&#22823;&#12290;&#27492;&#22806;&#65292;&#24180;&#36731;&#36873;&#25163;&#21644;&#37027;&#20123;&#22788;&#20110;&#25509;&#35302;&#36807;&#20154;&#24037;&#26234;&#33021;&#30340;&#22269;&#23478;&#30340;&#36873;&#25163;&#33719;&#24471;&#20102;&#26356;&#22823;&#30340;&#25913;&#36827;&#65292;&#36825;&#34920;&#26126;&#20102;&#20174;&#20154;&#24037;&#26234;&#33021;&#20013;&#23398;&#20064;&#21487;&#33021;&#23384;&#22312;&#30340;&#19981;&#24179;&#31561;&#38382;&#39064;&#12290;&#27492;&#22806;&#65292;&#34429;&#28982;&#21508;&#20010;&#27700;&#24179;&#30340;&#36873;&#25163;&#37117;&#33021;&#23398;&#20064;&#65292;&#20294;&#25216;&#26415;&#36739;&#24046;&#30340;&#36873;&#25163;&#33719;&#24471;&#20102;&#26356;&#39640;&#30340;&#36793;&#38469;&#25928;&#30410;&#12290;&#36825;&#20123;&#21457;&#29616;&#23545;&#20110;&#23547;&#27714;&#22312;&#32452;&#32455;&#20013;&#26377;&#25928;&#37319;&#29992;&#21644;&#21033;&#29992;&#20154;&#24037;&#26234;&#33021;&#30340;&#31649;&#29702;&#32773;&#20855;&#26377;&#37325;&#35201;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study how humans learn from AI, exploiting an introduction of an AI-powered Go program (APG) that unexpectedly outperformed the best professional player. We compare the move quality of professional players to that of APG's superior solutions around its public release. Our analysis of 749,190 moves demonstrates significant improvements in players' move quality, accompanied by decreased number and magnitude of errors. The effect is pronounced in the early stages of the game where uncertainty is highest. In addition, younger players and those in AI-exposed countries experience greater improvement, suggesting potential inequality in learning from AI. Further, while players of all levels learn, less skilled players derive higher marginal benefits. These findings have implications for managers seeking to adopt and utilize AI effectively within their organizations.
&lt;/p&gt;</description></item><item><title>&#36890;&#36807;&#23545;&#23398;&#29983;&#36827;&#34892;&#22240;&#26524;&#19982;&#39044;&#27979;&#24615;&#23450;&#20301;&#30340;&#27604;&#36739;&#65292;&#30740;&#31350;&#25506;&#35752;&#20102;&#22312;&#23398;&#29983;&#21161;&#23398;&#37329;&#32493;&#31614;&#39046;&#22495;&#23454;&#39564;&#20013;&#40723;&#21169;&#23545;&#35937;&#36873;&#25321;&#30340;&#20215;&#20540;&#12290;&#36825;&#39033;&#22823;&#35268;&#27169;&#23454;&#22320;&#23454;&#39564;&#25581;&#31034;&#20102;&#23450;&#20301;&#24178;&#39044;&#23545;&#20110;&#19981;&#21516;&#23398;&#29983;&#30340;&#25928;&#26524;&#65292;&#20026;&#24178;&#39044;&#31574;&#30053;&#30340;&#20248;&#21270;&#25552;&#20379;&#20102;&#21442;&#32771;&#12290;</title><link>http://arxiv.org/abs/2310.08672</link><description>&lt;p&gt;
&#26426;&#22120;&#23398;&#20064;&#20013;&#30340;&#40723;&#21169;&#23545;&#35937;&#36873;&#25321;&#65306;&#22312;&#23398;&#29983;&#21161;&#23398;&#37329;&#32493;&#31614;&#39046;&#22495;&#23454;&#39564;&#20013;&#30340;&#22240;&#26524;&#19982;&#39044;&#27979;&#24615;&#30446;&#26631;&#23450;&#20301;
&lt;/p&gt;
&lt;p&gt;
Machine Learning Who to Nudge: Causal vs Predictive Targeting in a Field Experiment on Student Financial Aid Renewal. (arXiv:2310.08672v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.08672
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#23545;&#23398;&#29983;&#36827;&#34892;&#22240;&#26524;&#19982;&#39044;&#27979;&#24615;&#23450;&#20301;&#30340;&#27604;&#36739;&#65292;&#30740;&#31350;&#25506;&#35752;&#20102;&#22312;&#23398;&#29983;&#21161;&#23398;&#37329;&#32493;&#31614;&#39046;&#22495;&#23454;&#39564;&#20013;&#40723;&#21169;&#23545;&#35937;&#36873;&#25321;&#30340;&#20215;&#20540;&#12290;&#36825;&#39033;&#22823;&#35268;&#27169;&#23454;&#22320;&#23454;&#39564;&#25581;&#31034;&#20102;&#23450;&#20301;&#24178;&#39044;&#23545;&#20110;&#19981;&#21516;&#23398;&#29983;&#30340;&#25928;&#26524;&#65292;&#20026;&#24178;&#39044;&#31574;&#30053;&#30340;&#20248;&#21270;&#25552;&#20379;&#20102;&#21442;&#32771;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#35768;&#22810;&#24773;&#22659;&#19979;&#65292;&#24178;&#39044;&#21487;&#33021;&#23545;&#26576;&#20123;&#20154;&#27604;&#20854;&#20182;&#20154;&#26356;&#26377;&#25928;&#65292;&#22240;&#27492;&#23450;&#20301;&#24178;&#39044;&#21487;&#33021;&#26159;&#26377;&#30410;&#30340;&#12290;&#25105;&#20204;&#36890;&#36807;&#19968;&#20010;&#35268;&#27169;&#24222;&#22823;&#30340;&#23454;&#22320;&#23454;&#39564;&#65288;&#36229;&#36807;53,000&#21517;&#22823;&#23398;&#29983;&#65289;&#26469;&#20998;&#26512;&#22312;&#23398;&#29983;&#21161;&#23398;&#37329;&#32493;&#31614;&#21069;&#20351;&#29992;&#8220;&#40723;&#21169;&#8221;&#31574;&#30053;&#30340;&#20215;&#20540;&#12290;&#25105;&#20204;&#39318;&#20808;&#20351;&#29992;&#22522;&#32447;&#26041;&#27861;&#36827;&#34892;&#23450;&#20301;&#12290;&#39318;&#20808;&#65292;&#25105;&#20204;&#22522;&#20110;&#19968;&#20010;&#20272;&#35745;&#24322;&#36136;&#22788;&#29702;&#25928;&#24212;&#30340;&#22240;&#26524;&#26862;&#26519;&#36827;&#34892;&#23450;&#20301;&#65292;&#24182;&#26681;&#25454;&#20272;&#35745;&#20986;&#30340;&#25317;&#26377;&#26368;&#39640;&#22788;&#29702;&#25928;&#24212;&#30340;&#23398;&#29983;&#26469;&#36827;&#34892;&#22788;&#29702;&#12290;&#25509;&#19979;&#26469;&#65292;&#25105;&#20204;&#35780;&#20272;&#20004;&#31181;&#26367;&#20195;&#30340;&#23450;&#20301;&#31574;&#30053;&#65292;&#19968;&#31181;&#26159;&#38024;&#23545;&#22312;&#27809;&#26377;&#24178;&#39044;&#30340;&#24773;&#20917;&#19979;&#39044;&#27979;&#21040;&#20302;&#21161;&#23398;&#37329;&#32493;&#31614;&#27010;&#29575;&#30340;&#23398;&#29983;&#65292;&#21478;&#19968;&#31181;&#26159;&#38024;&#23545;&#39044;&#27979;&#21040;&#39640;&#27010;&#29575;&#30340;&#23398;&#29983;&#12290;&#39044;&#27979;&#30340;&#22522;&#32447;&#32467;&#26524;&#24182;&#19981;&#26159;&#23450;&#20301;&#30340;&#29702;&#24819;&#26631;&#20934;&#65292;&#32780;&#19988;&#22312;&#20808;&#39564;&#19978;&#20063;&#19981;&#28165;&#26970;&#26159;&#20248;&#20808;&#32771;&#34385;&#20302;&#12289;&#39640;&#36824;&#26159;&#20013;&#38388;&#30340;&#39044;&#27979;&#12290;
&lt;/p&gt;
&lt;p&gt;
In many settings, interventions may be more effective for some individuals than others, so that targeting interventions may be beneficial. We analyze the value of targeting in the context of a large-scale field experiment with over 53,000 college students, where the goal was to use "nudges" to encourage students to renew their financial-aid applications before a non-binding deadline. We begin with baseline approaches to targeting. First, we target based on a causal forest that estimates heterogeneous treatment effects and then assigns students to treatment according to those estimated to have the highest treatment effects. Next, we evaluate two alternative targeting policies, one targeting students with low predicted probability of renewing financial aid in the absence of the treatment, the other targeting those with high probability. The predicted baseline outcome is not the ideal criterion for targeting, nor is it a priori clear whether to prioritize low, high, or intermediate predic
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#30740;&#31350;&#20102;&#20154;&#24037;&#26234;&#33021;&#19982;&#20154;&#31867;&#20114;&#21160;&#20013;&#38754;&#20020;&#30340;&#21516;&#36136;&#21270;&#21644;&#20559;&#35265;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#25913;&#21892;&#20154;&#24037;&#26234;&#33021;&#19982;&#20154;&#31867;&#20114;&#21160;&#30340;&#35299;&#20915;&#21150;&#27861;&#65292;&#23454;&#29616;&#20010;&#24615;&#21270;&#36755;&#20986;&#32780;&#19981;&#29306;&#29298;&#29983;&#20135;&#21147;&#12290;</title><link>http://arxiv.org/abs/2309.10448</link><description>&lt;p&gt;
&#20154;&#24037;&#26234;&#33021;&#19982;&#20154;&#31867;&#20114;&#21160;&#20197;&#21450;&#31038;&#20250;&#38519;&#38449;
&lt;/p&gt;
&lt;p&gt;
Human-AI Interactions and Societal Pitfalls. (arXiv:2309.10448v1 [cs.AI])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.10448
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#30740;&#31350;&#20102;&#20154;&#24037;&#26234;&#33021;&#19982;&#20154;&#31867;&#20114;&#21160;&#20013;&#38754;&#20020;&#30340;&#21516;&#36136;&#21270;&#21644;&#20559;&#35265;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#25913;&#21892;&#20154;&#24037;&#26234;&#33021;&#19982;&#20154;&#31867;&#20114;&#21160;&#30340;&#35299;&#20915;&#21150;&#27861;&#65292;&#23454;&#29616;&#20010;&#24615;&#21270;&#36755;&#20986;&#32780;&#19981;&#29306;&#29298;&#29983;&#20135;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24403;&#19982;&#29983;&#25104;&#24335;&#20154;&#24037;&#26234;&#33021;&#65288;AI&#65289;&#21512;&#20316;&#26102;&#65292;&#29992;&#25143;&#21487;&#33021;&#20250;&#30475;&#21040;&#29983;&#20135;&#21147;&#30340;&#25552;&#21319;&#65292;&#20294;AI&#29983;&#25104;&#30340;&#20869;&#23481;&#21487;&#33021;&#19981;&#23436;&#20840;&#31526;&#21512;&#20182;&#20204;&#30340;&#20559;&#22909;&#12290;&#20026;&#20102;&#30740;&#31350;&#36825;&#31181;&#24433;&#21709;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#20010;&#36125;&#21494;&#26031;&#26694;&#26550;&#65292;&#20854;&#20013;&#24322;&#36136;&#29992;&#25143;&#36873;&#25321;&#19982;AI&#20849;&#20139;&#22810;&#23569;&#20449;&#24687;&#65292;&#38754;&#20020;&#36755;&#20986;&#20445;&#30495;&#24230;&#21644;&#36890;&#20449;&#25104;&#26412;&#20043;&#38388;&#30340;&#26435;&#34913;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#36825;&#20123;&#20010;&#20307;&#20915;&#31574;&#19982;AI&#35757;&#32451;&#20043;&#38388;&#30340;&#30456;&#20114;&#20316;&#29992;&#21487;&#33021;&#23548;&#33268;&#31038;&#20250;&#25361;&#25112;&#12290;&#36755;&#20986;&#21487;&#33021;&#21464;&#24471;&#26356;&#21152;&#21516;&#36136;&#21270;&#65292;&#29305;&#21035;&#26159;&#24403;AI&#22312;AI&#29983;&#25104;&#30340;&#20869;&#23481;&#19978;&#36827;&#34892;&#35757;&#32451;&#26102;&#12290;&#32780;&#20219;&#20309;AI&#30340;&#20559;&#35265;&#21487;&#33021;&#25104;&#20026;&#31038;&#20250;&#20559;&#35265;&#12290;&#35299;&#20915;&#21516;&#36136;&#21270;&#21644;&#20559;&#35265;&#38382;&#39064;&#30340;&#21150;&#27861;&#26159;&#25913;&#36827;&#20154;&#24037;&#26234;&#33021;&#19982;&#20154;&#31867;&#30340;&#20114;&#21160;&#65292;&#23454;&#29616;&#20010;&#24615;&#21270;&#36755;&#20986;&#32780;&#19981;&#29306;&#29298;&#29983;&#20135;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;
When working with generative artificial intelligence (AI), users may see productivity gains, but the AI-generated content may not match their preferences exactly. To study this effect, we introduce a Bayesian framework in which heterogeneous users choose how much information to share with the AI, facing a trade-off between output fidelity and communication cost. We show that the interplay between these individual-level decisions and AI training may lead to societal challenges. Outputs may become more homogenized, especially when the AI is trained on AI-generated content. And any AI bias may become societal bias. A solution to the homogenization and bias issues is to improve human-AI interactions, enabling personalized outputs without sacrificing productivity.
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#21019;&#19994;&#20844;&#21496;&#25910;&#36141;&#27169;&#22411;&#65292;&#25351;&#20986;&#25910;&#36141;&#20250;&#23548;&#33268;&#20302;&#25928;&#30340; "&#20154;&#25165;&#22244;&#31215;"&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#21363;&#20351;&#27809;&#26377;&#31454;&#20105;&#25928;&#24212;&#65292;&#25910;&#36141;&#20063;&#21487;&#33021;&#26159;&#22404;&#26029;&#34892;&#20026;&#30340;&#32467;&#26524;&#65292;&#23548;&#33268;&#20154;&#25165;&#20998;&#37197;&#20302;&#25928;&#65292;&#24182;&#23545;&#28040;&#36153;&#32773;&#21097;&#20313;&#21644;&#34987;&#25910;&#36141;&#21592;&#24037;&#30340;&#24037;&#20316;&#31283;&#23450;&#24615;&#20135;&#29983;&#36127;&#38754;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2308.10046</link><description>&lt;p&gt;
&#21019;&#19994;&#20844;&#21496;&#25910;&#36141;&#65306;&#20154;&#25165;&#25250;&#36141;&#21644;&#20154;&#25165;&#22244;&#31215;
&lt;/p&gt;
&lt;p&gt;
Startup Acquisitions: Acquihires and Talent Hoarding. (arXiv:2308.10046v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.10046
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#21019;&#19994;&#20844;&#21496;&#25910;&#36141;&#27169;&#22411;&#65292;&#25351;&#20986;&#25910;&#36141;&#20250;&#23548;&#33268;&#20302;&#25928;&#30340; "&#20154;&#25165;&#22244;&#31215;"&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#21363;&#20351;&#27809;&#26377;&#31454;&#20105;&#25928;&#24212;&#65292;&#25910;&#36141;&#20063;&#21487;&#33021;&#26159;&#22404;&#26029;&#34892;&#20026;&#30340;&#32467;&#26524;&#65292;&#23548;&#33268;&#20154;&#25165;&#20998;&#37197;&#20302;&#25928;&#65292;&#24182;&#23545;&#28040;&#36153;&#32773;&#21097;&#20313;&#21644;&#34987;&#25910;&#36141;&#21592;&#24037;&#30340;&#24037;&#20316;&#31283;&#23450;&#24615;&#20135;&#29983;&#36127;&#38754;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#21019;&#19994;&#20844;&#21496;&#25910;&#36141;&#27169;&#22411;&#65292;&#21487;&#33021;&#23548;&#33268;&#20302;&#25928;&#30340; "&#20154;&#25165;&#22244;&#31215;"&#12290;&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#20010;&#26377;&#20004;&#20010;&#31454;&#20105;&#20844;&#21496;&#30340;&#27169;&#22411;&#65292;&#36825;&#20123;&#20844;&#21496;&#21487;&#20197;&#25910;&#36141;&#21644;&#25972;&#21512;&#19968;&#20010;&#22312;&#19981;&#21516;&#39046;&#22495;&#36816;&#33829;&#30340;&#21019;&#19994;&#20844;&#21496;&#65292;&#36825;&#31181;&#25910;&#36141;&#25913;&#21892;&#20102;&#25910;&#36141;&#20844;&#21496;&#30340;&#31454;&#20105;&#21147;&#12290;&#25105;&#20204;&#34920;&#26126;&#65292;&#21363;&#20351;&#27809;&#26377;&#32463;&#20856;&#30340;&#31454;&#20105;&#25928;&#24212;&#65292;&#36825;&#31181;&#25910;&#36141;&#20063;&#21487;&#33021;&#19981;&#26159;&#33391;&#24615;&#30340;&#65292;&#32780;&#26159;&#22404;&#26029;&#34892;&#20026;&#30340;&#32467;&#26524;&#65292;&#23548;&#33268;&#20154;&#25165;&#20998;&#37197;&#20302;&#25928;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36824;&#34920;&#26126;&#65292;&#36825;&#31181;&#20154;&#25165;&#22244;&#31215;&#21487;&#33021;&#20250;&#38477;&#20302;&#28040;&#36153;&#32773;&#21097;&#20313;&#65292;&#24182;&#23548;&#33268;&#34987;&#25910;&#36141;&#21592;&#24037;&#30340;&#24037;&#20316;&#19981;&#31283;&#23450;&#24615;&#22686;&#21152;&#12290;
&lt;/p&gt;
&lt;p&gt;
We present a model of startup acquisitions, which may give rise to inefficient "talent hoarding." We develop a model with two competing firms that can acquire and integrate (or "acquihire") a startup operating in an orthogonal market. Such an acquihire improves the competitiveness of the acquiring firm. We show that even absent the classical competition effects, acquihires need not be benign but can be the result of oligopolistic behavior, leading to an inefficient allocation of talent. Further, we show that such talent hoarding may reduce consumer surplus and lead to more job volatility for acquihired employees.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#24403;&#20132;&#26131;&#36890;&#36807;&#35746;&#21333;&#27969;&#25293;&#21334;&#31169;&#19979;&#38144;&#21806;&#32780;&#38750;&#30452;&#25509;&#36716;&#21457;&#21040;&#20844;&#20849;&#8220;mempool&#8221;&#26102;&#65292;&#24314;&#35758;&#32773;-&#24314;&#36896;&#32773;&#20998;&#31163;&#22343;&#34913;&#23558;&#21457;&#29983;&#20309;&#31181;&#21464;&#21270;&#12290;&#30740;&#31350;&#34920;&#26126;&#65292;&#23545;&#20110;&#38598;&#25104;&#30340;&#24314;&#36896;&#32773;&#25628;&#32034;&#32773;&#32780;&#35328;&#65292;&#31169;&#20154;&#35746;&#21333;&#27969;&#22312;PBS&#25293;&#21334;&#20013;&#20855;&#26377;&#37325;&#35201;&#30340;&#25112;&#30053;&#20215;&#20540;&#12290;</title><link>http://arxiv.org/abs/2305.19150</link><description>&lt;p&gt;
&#31169;&#20154;&#35746;&#21333;&#27969;&#23545;&#24314;&#35758;&#32773;-&#24314;&#36896;&#32773;&#38388;&#20998;&#31163;&#30340;&#38598;&#20013;&#25928;&#24212;
&lt;/p&gt;
&lt;p&gt;
The centralizing effects of private order flow on proposer-builder separation. (arXiv:2305.19150v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.19150
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#24403;&#20132;&#26131;&#36890;&#36807;&#35746;&#21333;&#27969;&#25293;&#21334;&#31169;&#19979;&#38144;&#21806;&#32780;&#38750;&#30452;&#25509;&#36716;&#21457;&#21040;&#20844;&#20849;&#8220;mempool&#8221;&#26102;&#65292;&#24314;&#35758;&#32773;-&#24314;&#36896;&#32773;&#20998;&#31163;&#22343;&#34913;&#23558;&#21457;&#29983;&#20309;&#31181;&#21464;&#21270;&#12290;&#30740;&#31350;&#34920;&#26126;&#65292;&#23545;&#20110;&#38598;&#25104;&#30340;&#24314;&#36896;&#32773;&#25628;&#32034;&#32773;&#32780;&#35328;&#65292;&#31169;&#20154;&#35746;&#21333;&#27969;&#22312;PBS&#25293;&#21334;&#20013;&#20855;&#26377;&#37325;&#35201;&#30340;&#25112;&#30053;&#20215;&#20540;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24403;&#20132;&#26131;&#36890;&#36807;&#35746;&#21333;&#27969;&#25293;&#21334;&#65288;OFA&#65289;&#31169;&#19979;&#38144;&#21806;&#32780;&#38750;&#30452;&#25509;&#36716;&#21457;&#21040;&#20844;&#20849;&#8220;mempool&#8221;&#26102;&#65292;&#24403;&#21069;&#30340;&#24314;&#35758;&#32773;-&#24314;&#36896;&#32773;&#38388;&#20998;&#31163;&#65288;PBS&#65289;&#22343;&#34913;&#23558;&#21457;&#29983;&#20309;&#31181;&#21464;&#21270;&#65311;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#26032;&#39062;&#30340;&#27169;&#22411;&#65292;&#31361;&#20986;&#20102;&#23545;&#38598;&#25104;&#24314;&#36896;&#32773;&#25628;&#32034;&#30340;&#31169;&#20154;&#35746;&#21333;&#27969;&#30340;&#22686;&#20540;&#20316;&#29992;&#12290;&#25105;&#20204;&#34920;&#26126;&#65292;&#31169;&#20154;&#35746;&#21333;&#27969;&#23545;&#20110;&#19978;&#26041;&#21306;&#22359;&#26426;&#20250;&#26159;&#20114;&#34917;&#65292;&#22240;&#27492;&#38598;&#25104;&#30340;&#24314;&#36896;&#32773;&#25628;&#32034;&#32773;&#26356;&#21487;&#33021;&#21442;&#19982;OFA&#65292;&#24182;&#20987;&#36133;&#38750;&#38598;&#25104;&#30340;&#24314;&#36896;&#32773;&#12290;&#20182;&#20204;&#23558;&#21033;&#29992;&#23545;&#36825;&#20123;&#31169;&#20154;&#20132;&#26131;&#30340;&#35775;&#38382;&#65292;&#22312;PBS&#25293;&#21334;&#20013;&#33719;&#24471;&#20248;&#21183;&#65292;&#27604;&#38750;&#38598;&#25104;&#30340;&#24314;&#36896;&#32773;&#26356;&#21152;&#39057;&#32321;&#22320;&#36194;&#24471;&#21306;&#22359;&#24182;&#25552;&#21462;&#26356;&#39640;&#30340;&#21033;&#28070;&#12290;&#20026;&#20102;&#39564;&#35777;&#25105;&#20204;&#30340;&#20027;&#35201;&#20551;&#35774;&#65292;&#25105;&#20204;&#26500;&#24314;&#20102;&#19968;&#20010;&#26032;&#30340;&#25968;&#25454;&#38598;&#65292;&#23558;PBS&#32467;&#26524;&#19982;&#19968;&#23478;&#39046;&#20808;&#30340;CEX&#65288;Binance&#65289;&#23454;&#29616;&#30340;12&#31186;&#27874;&#21160;&#24615;&#21305;&#37197;&#12290;&#25105;&#20204;&#30340;&#32467;&#26524;&#34920;&#26126;&#65292;&#36890;&#36807;&#25112;&#30053;&#24615;&#22320;&#21033;&#29992;&#31169;&#20154;&#35746;&#21333;&#27969;&#65292;&#38598;&#25104;&#30340;&#24314;&#36896;&#32773;&#25628;&#32034;&#32773;&#22312;PBS&#25293;&#21334;&#20013;&#33719;&#24471;&#20102;&#26174;&#33879;&#30340;&#20248;&#21183;&#12290;
&lt;/p&gt;
&lt;p&gt;
The current Proposer Builder Separation (PBS) equilibrium has several builders with different backgrounds winning blocks consistently. This paper considers how this equilibrium will shift when transactions are sold privately via order flow auctions (OFAs) rather than forwarded directly to the public mempool. We discuss a novel model that highlights the augmented value of private order flow for integrated builder searchers. We show that private order flow is complementary to top-of-block opportunities, and therefore integrated builder-searchers are more likely to participate in OFAs and outbid non integrated builders. They will then parlay access to these private transactions into an advantage in the PBS auction, winning blocks more often and extracting higher profits than non-integrated builders. To validate our main assumptions, we construct a novel dataset pairing post-merge PBS outcomes with realized 12-second volatility on a leading CEX (Binance). Our results show that integrated b
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#32771;&#34385;&#20102;&#39640;&#24230;&#36807;&#21442;&#25968;&#21270;&#30340;&#22240;&#26524;&#25512;&#26029;&#27169;&#22411;&#65292;&#25506;&#35752;&#20102;&#22810;&#20010;&#25511;&#21046;&#21333;&#20803;&#30340;&#39640;&#32500;&#21512;&#25104;&#25511;&#21046;&#20272;&#35745;&#24615;&#33021;&#65292;&#21457;&#29616;&#22686;&#21152;&#25511;&#21046;&#21333;&#20803;&#21487;&#20197;&#24110;&#21161;&#25552;&#39640;&#22635;&#20805;&#24615;&#33021;&#65292;&#29978;&#33267;&#36229;&#36807;&#20102;&#39044;&#22788;&#29702;&#25311;&#21512;&#23436;&#32654;&#30340;&#28857;&#12290;</title><link>http://arxiv.org/abs/2305.00700</link><description>&lt;p&gt;
&#22240;&#26524;&#25512;&#26029;&#20013;&#30340;&#21452;&#37325;&#21644;&#21333;&#19968;&#19979;&#38477;&#29616;&#35937;&#65292;&#21450;&#20854;&#22312;&#39640;&#32500;&#21512;&#25104;&#25511;&#21046;&#20013;&#30340;&#24212;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;
Double and Single Descent in Causal Inference with an Application to High-Dimensional Synthetic Control. (arXiv:2305.00700v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.00700
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#32771;&#34385;&#20102;&#39640;&#24230;&#36807;&#21442;&#25968;&#21270;&#30340;&#22240;&#26524;&#25512;&#26029;&#27169;&#22411;&#65292;&#25506;&#35752;&#20102;&#22810;&#20010;&#25511;&#21046;&#21333;&#20803;&#30340;&#39640;&#32500;&#21512;&#25104;&#25511;&#21046;&#20272;&#35745;&#24615;&#33021;&#65292;&#21457;&#29616;&#22686;&#21152;&#25511;&#21046;&#21333;&#20803;&#21487;&#20197;&#24110;&#21161;&#25552;&#39640;&#22635;&#20805;&#24615;&#33021;&#65292;&#29978;&#33267;&#36229;&#36807;&#20102;&#39044;&#22788;&#29702;&#25311;&#21512;&#23436;&#32654;&#30340;&#28857;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#38024;&#23545;&#26426;&#22120;&#23398;&#20064;&#20013;&#30340;&#21452;&#37325;&#19979;&#38477;&#29616;&#35937;&#65292;&#32771;&#34385;&#20102;&#39640;&#24230;&#36807;&#21442;&#25968;&#21270;&#30340;&#22240;&#26524;&#25512;&#26029;&#27169;&#22411;&#65292;&#21253;&#25324;&#22810;&#20010;&#25511;&#21046;&#21333;&#20803;&#30340;&#21512;&#25104;&#25511;&#21046;&#12290;&#22312;&#36825;&#31181;&#27169;&#22411;&#20013;&#65292;&#21487;&#33021;&#23384;&#22312;&#22826;&#22810;&#30340;&#33258;&#30001;&#21442;&#25968;&#65292;&#20197;&#33267;&#20110;&#27169;&#22411;&#21487;&#20197;&#23436;&#32654;&#22320;&#25311;&#21512;&#35757;&#32451;&#25968;&#25454;&#12290;&#26412;&#25991;&#39318;&#20808;&#20197;&#39640;&#32500;&#32447;&#24615;&#22238;&#24402;&#27169;&#22411;&#20026;&#20363;&#65292;&#30740;&#31350;&#34218;&#36164;&#25968;&#25454;&#30340;&#22635;&#20805;&#65292;&#21457;&#29616;&#27604;&#31616;&#21333;&#27169;&#22411;&#26356;&#22810;&#30340;&#21327;&#21464;&#37327;&#23545;&#20110;&#27169;&#22411;&#24615;&#33021;&#30340;&#25552;&#21319;&#24456;&#26377;&#25928;&#12290;&#26412;&#25991;&#30340;&#20027;&#35201;&#36129;&#29486;&#22312;&#20110;&#25506;&#35752;&#20102;&#22810;&#20010;&#25511;&#21046;&#21333;&#20803;&#30340;&#39640;&#32500;&#21512;&#25104;&#25511;&#21046;&#20272;&#35745;&#24615;&#33021;&#65292;&#21457;&#29616;&#22686;&#21152;&#25511;&#21046;&#21333;&#20803;&#21487;&#20197;&#24110;&#21161;&#25552;&#39640;&#22635;&#20805;&#24615;&#33021;&#65292;&#29978;&#33267;&#36229;&#36807;&#20102;&#39044;&#22788;&#29702;&#25311;&#21512;&#23436;&#32654;&#30340;&#28857;&#12290;&#27492;&#22806;&#65292;&#26412;&#25991;&#25552;&#20986;&#19968;&#31181;&#32479;&#19968;&#30340;&#29702;&#35770;&#35270;&#35282;&#26469;&#35299;&#37322;&#36825;&#20123;&#39640;&#32500;&#27169;&#22411;&#30340;&#24615;&#33021;&#65292;&#21363;&#23558;&#26356;&#22797;&#26434;&#30340;&#27169;&#22411;&#35270;&#20026;&#23545;&#31616;&#21333;&#27169;&#22411;&#30340;&#27169;&#22411;&#24179;&#22343;&#20272;&#35745;&#12290;
&lt;/p&gt;
&lt;p&gt;
Motivated by a recent literature on the double-descent phenomenon in machine learning, we consider highly over-parametrized models in causal inference, including synthetic control with many control units. In such models, there may be so many free parameters that the model fits the training data perfectly. As a motivating example, we first investigate high-dimensional linear regression for imputing wage data, where we find that models with many more covariates than sample size can outperform simple ones. As our main contribution, we document the performance of high-dimensional synthetic control estimators with many control units. We find that adding control units can help improve imputation performance even beyond the point where the pre-treatment fit is perfect. We then provide a unified theoretical perspective on the performance of these high-dimensional models. Specifically, we show that more complex models can be interpreted as model-averaging estimators over simpler ones, which we 
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#38024;&#23545;&#20998;&#20301;&#25968;&#39044;&#27979;&#30340;&#20248;&#21270;&#24615;&#27979;&#35797;&#26041;&#27861;&#65292;&#21487;&#20197;&#22312;&#22810;&#20010;&#39044;&#27979;&#26102;&#27573;&#21644;/&#25110;&#20998;&#20301;&#25968;&#19979;&#35780;&#20272;&#39044;&#27979;&#30340;&#20248;&#21270;&#24615;&#12290;&#27979;&#35797;&#22522;&#20110;&#22810;&#20010;Mincer-Zarnowitz&#20998;&#20301;&#25968;&#22238;&#24402;&#65292;&#24182;&#21033;&#29992;&#30697;&#31561;&#24335;&#26694;&#26550;&#12290;&#27169;&#25311;&#30740;&#31350;&#21644;&#23454;&#35777;&#24212;&#29992;&#36827;&#19968;&#27493;&#39564;&#35777;&#20102;&#35813;&#26041;&#27861;&#30340;&#26377;&#25928;&#24615;&#12290;</title><link>http://arxiv.org/abs/2302.02747</link><description>&lt;p&gt;
&#27979;&#35797;&#20998;&#20301;&#25968;&#39044;&#27979;&#30340;&#20248;&#21270;&#24615;
&lt;/p&gt;
&lt;p&gt;
Testing Quantile Forecast Optimality. (arXiv:2302.02747v2 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2302.02747
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#38024;&#23545;&#20998;&#20301;&#25968;&#39044;&#27979;&#30340;&#20248;&#21270;&#24615;&#27979;&#35797;&#26041;&#27861;&#65292;&#21487;&#20197;&#22312;&#22810;&#20010;&#39044;&#27979;&#26102;&#27573;&#21644;/&#25110;&#20998;&#20301;&#25968;&#19979;&#35780;&#20272;&#39044;&#27979;&#30340;&#20248;&#21270;&#24615;&#12290;&#27979;&#35797;&#22522;&#20110;&#22810;&#20010;Mincer-Zarnowitz&#20998;&#20301;&#25968;&#22238;&#24402;&#65292;&#24182;&#21033;&#29992;&#30697;&#31561;&#24335;&#26694;&#26550;&#12290;&#27169;&#25311;&#30740;&#31350;&#21644;&#23454;&#35777;&#24212;&#29992;&#36827;&#19968;&#27493;&#39564;&#35777;&#20102;&#35813;&#26041;&#27861;&#30340;&#26377;&#25928;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#35768;&#22810;&#37329;&#34701;&#26426;&#26500;&#12289;&#20013;&#22830;&#38134;&#34892;&#21644;&#22269;&#38469;&#32452;&#32455;&#20013;&#65292;&#36328;&#22810;&#20010;&#39044;&#27979;&#26102;&#27573;&#30340;&#20998;&#20301;&#25968;&#39044;&#27979;&#24050;&#25104;&#20026;&#37325;&#35201;&#30340;&#36755;&#20986;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#38024;&#23545;&#36825;&#31181;&#20998;&#20301;&#25968;&#39044;&#27979;&#30340;&#38169;&#35823;&#35268;&#33539;&#26816;&#39564;&#65292;&#35813;&#26816;&#39564;&#35780;&#20272;&#22810;&#20010;&#39044;&#27979;&#26102;&#27573;&#21644;/&#25110;&#20998;&#20301;&#25968;&#19979;&#30340;&#20248;&#21270;&#24615;&#12290;&#35813;&#26816;&#39564;&#24314;&#31435;&#22312;&#22810;&#20010;Mincer-Zarnowitz&#20998;&#20301;&#25968;&#22238;&#24402;&#22522;&#30784;&#19978;&#65292;&#37319;&#29992;&#30697;&#31561;&#24335;&#26694;&#26550;&#12290;&#25105;&#20204;&#30340;&#20027;&#35201;&#26816;&#39564;&#26159;&#38024;&#23545;&#33258;&#21160;&#26657;&#20934;&#30340;&#38646;&#20551;&#35774;&#65292;&#36825;&#19968;&#27010;&#24565;&#35780;&#20272;&#20102;&#39044;&#27979;&#26412;&#36523;&#25152;&#21253;&#21547;&#30340;&#20449;&#24687;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#19968;&#31181;&#25193;&#23637;&#65292;&#21487;&#20197;&#27979;&#35797;&#30456;&#23545;&#36739;&#22823;&#30340;&#20449;&#24687;&#38598;&#21644;&#22810;&#20803;&#25193;&#23637;&#30340;&#20248;&#21270;&#24615;&#12290;&#37325;&#35201;&#30340;&#26159;&#65292;&#25105;&#20204;&#30340;&#27979;&#35797;&#19981;&#20165;&#21487;&#20197;&#25552;&#20379;&#26377;&#20851;&#20248;&#21270;&#24615;&#30340;&#19968;&#33324;&#36829;&#21453;&#24773;&#20917;&#30340;&#20449;&#24687;&#65292;&#36824;&#21487;&#20197;&#25552;&#20379;&#26377;&#20851;&#29305;&#23450;&#24418;&#24335;&#30340;&#27425;&#20248;&#24615;&#30340;&#26377;&#29992;&#27934;&#35265;&#12290;&#27169;&#25311;&#30740;&#31350;&#35843;&#26597;&#20102;&#25105;&#20204;&#30340;&#27979;&#35797;&#30340;&#26377;&#38480;&#26679;&#26412;&#24615;&#33021;&#65292;&#20197;&#21450;&#20004;&#20010;&#23545;&#37329;&#34701;&#25910;&#30410;&#30340;&#23454;&#35777;&#24212;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;
Quantile forecasts made across multiple horizons have become an important output of many financial institutions, central banks and international organisations. This paper proposes misspecification tests for such quantile forecasts that assess optimality over a set of multiple forecast horizons and/or quantiles. The tests build on multiple Mincer-Zarnowitz quantile regressions cast in a moment equality framework. Our main test is for the null hypothesis of autocalibration, a concept which assesses optimality with respect to the information contained in the forecasts themselves. We provide an extension that allows to test for optimality with respect to larger information sets and a multivariate extension. Importantly, our tests do not just inform about general violations of optimality, but may also provide useful insights into specific forms of sub-optimality. A simulation study investigates the finite sample performance of our tests, and two empirical applications to financial returns a
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#32463;&#27982;&#22266;&#23450;&#20107;&#20214;&#39044;&#27979;&#30340;&#39044;&#27979;&#21306;&#38388;&#65292;&#25552;&#20986;&#20102;&#22522;&#20110;&#38382;&#39064;&#21160;&#26426;&#30340;&#22238;&#24402;&#26041;&#27861;&#65292;&#29992;&#20110;&#26500;&#24314;&#24503;&#22269;&#21644;&#32654;&#22269;&#22269;&#20869;&#29983;&#20135;&#24635;&#20540;&#65288;GDP&#65289;&#22686;&#38271;&#30340;&#39044;&#27979;&#21306;&#38388;&#12290;</title><link>http://arxiv.org/abs/2210.13562</link><description>&lt;p&gt;
&#32463;&#27982;&#22266;&#23450;&#20107;&#20214;&#39044;&#27979;&#30340;&#39044;&#27979;&#21306;&#38388;
&lt;/p&gt;
&lt;p&gt;
Prediction intervals for economic fixed-event forecasts. (arXiv:2210.13562v2 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2210.13562
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#32463;&#27982;&#22266;&#23450;&#20107;&#20214;&#39044;&#27979;&#30340;&#39044;&#27979;&#21306;&#38388;&#65292;&#25552;&#20986;&#20102;&#22522;&#20110;&#38382;&#39064;&#21160;&#26426;&#30340;&#22238;&#24402;&#26041;&#27861;&#65292;&#29992;&#20110;&#26500;&#24314;&#24503;&#22269;&#21644;&#32654;&#22269;&#22269;&#20869;&#29983;&#20135;&#24635;&#20540;&#65288;GDP&#65289;&#22686;&#38271;&#30340;&#39044;&#27979;&#21306;&#38388;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22266;&#23450;&#20107;&#20214;&#39044;&#27979;&#35774;&#32622;&#22312;&#32463;&#27982;&#25919;&#31574;&#20013;&#24456;&#24120;&#35265;&#12290;&#23427;&#28041;&#21450;&#21040;&#23545;&#21516;&#19968;&#20010;&#8220;&#22266;&#23450;&#8221;&#30340;&#39044;&#27979;&#23545;&#35937;&#36827;&#34892;&#19968;&#31995;&#21015;&#30340;&#39044;&#27979;&#65292;&#22240;&#27492;&#38543;&#30528;&#26102;&#38388;&#30340;&#25512;&#31227;&#65292;&#39044;&#27979;&#38382;&#39064;&#30340;&#38590;&#24230;&#36880;&#28176;&#38477;&#20302;&#12290;&#22266;&#23450;&#20107;&#20214;&#30340;&#28857;&#39044;&#27979;&#36890;&#24120;&#27809;&#26377;&#23450;&#37327;&#30340;&#19981;&#30830;&#23450;&#24615;&#24230;&#37327;&#12290;&#20026;&#20102;&#26500;&#24314;&#36825;&#26679;&#30340;&#24230;&#37327;&#65292;&#25105;&#20204;&#32771;&#34385;&#20102;&#36866;&#29992;&#20110;&#22266;&#23450;&#20107;&#20214;&#24773;&#20917;&#30340;&#39044;&#27979;&#21518;&#22788;&#29702;&#25216;&#26415;&#12290;&#25105;&#20204;&#24320;&#21457;&#20102;&#22522;&#20110;&#38382;&#39064;&#21160;&#26426;&#30340;&#22238;&#24402;&#26041;&#27861;&#65292;&#24182;&#20351;&#29992;&#36825;&#20123;&#26041;&#27861;&#26500;&#24314;&#20102;&#24503;&#22269;&#21644;&#32654;&#22269;&#22269;&#20869;&#29983;&#20135;&#24635;&#20540;&#65288;GDP&#65289;&#22686;&#38271;&#30340;&#39044;&#27979;&#21306;&#38388;&#12290;
&lt;/p&gt;
&lt;p&gt;
The fixed-event forecasting setup is common in economic policy. It involves a sequence of forecasts of the same (`fixed') predictand, so that the difficulty of the forecasting problem decreases over time. Fixed-event point forecasts are typically published without a quantitative measure of uncertainty. To construct such a measure, we consider forecast postprocessing techniques tailored to the fixed-event case. We develop regression methods that impose constraints motivated by the problem at hand, and use these methods to construct prediction intervals for gross domestic product (GDP) growth in Germany and the US.
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#22823;&#32500;&#36817;&#20284;&#22240;&#23376;&#27169;&#22411;&#65292;&#22312;&#21152;&#36733;&#22240;&#23376;&#20013;&#24341;&#20837;&#20102;&#30001;&#28508;&#22312;&#39532;&#23572;&#21487;&#22827;&#36807;&#31243;&#39537;&#21160;&#30340;&#21046;&#24230;&#21464;&#21270;&#65292;&#36890;&#36807;&#22312;&#27169;&#22411;&#20013;&#21033;&#29992;&#31561;&#25928;&#32447;&#24615;&#34920;&#31034;&#65292;&#36890;&#36807;&#20027;&#25104;&#20998;&#20998;&#26512;&#24674;&#22797;&#20102;&#28508;&#22312;&#22240;&#23376;&#65292;&#28982;&#21518;&#20351;&#29992;&#22522;&#20110;&#25913;&#36827;&#28388;&#27874;&#22120;&#21644;&#24179;&#28369;&#22120;&#30340;EM&#31639;&#27861;&#65292;&#20272;&#35745;&#21152;&#36733;&#22240;&#23376;&#21644;&#36716;&#25442;&#27010;&#29575;&#12290;&#36825;&#31181;&#26041;&#27861;&#30340;&#21560;&#24341;&#21147;&#22312;&#20110;&#25552;&#20379;&#20102;&#25152;&#26377;&#20272;&#35745;&#37327;&#30340;&#38381;&#24335;&#34920;&#36798;&#24335;&#65292;&#24182;&#19988;&#19981;&#38656;&#35201;&#30693;&#36947;&#30495;&#23454;&#22240;&#23376;&#30340;&#25968;&#37327;&#12290;&#36890;&#36807;&#19968;&#31995;&#21015;&#33945;&#29305;&#21345;&#27931;&#23454;&#39564;&#23637;&#31034;&#20102;&#35813;&#26041;&#27861;&#30340;&#33391;&#22909;&#26377;&#38480;&#26679;&#26412;&#24615;&#33021;&#65292;&#24182;&#36890;&#36807;&#23545;&#22823;&#22411;&#32929;&#31080;&#32452;&#21512;&#30340;&#24212;&#29992;&#39564;&#35777;&#20102;&#26041;&#27861;&#30340;&#23454;&#35777;&#25928;&#29992;&#12290;</title><link>http://arxiv.org/abs/2210.09828</link><description>&lt;p&gt;
&#20351;&#29992;&#39532;&#23572;&#21487;&#22827;&#36716;&#25442;&#22240;&#23376;&#27169;&#22411;&#23545;&#22823;&#32500;&#25968;&#25454;&#38598;&#36827;&#34892;&#24314;&#27169;
&lt;/p&gt;
&lt;p&gt;
Modelling Large Dimensional Datasets with Markov Switching Factor Models. (arXiv:2210.09828v2 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2210.09828
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#22823;&#32500;&#36817;&#20284;&#22240;&#23376;&#27169;&#22411;&#65292;&#22312;&#21152;&#36733;&#22240;&#23376;&#20013;&#24341;&#20837;&#20102;&#30001;&#28508;&#22312;&#39532;&#23572;&#21487;&#22827;&#36807;&#31243;&#39537;&#21160;&#30340;&#21046;&#24230;&#21464;&#21270;&#65292;&#36890;&#36807;&#22312;&#27169;&#22411;&#20013;&#21033;&#29992;&#31561;&#25928;&#32447;&#24615;&#34920;&#31034;&#65292;&#36890;&#36807;&#20027;&#25104;&#20998;&#20998;&#26512;&#24674;&#22797;&#20102;&#28508;&#22312;&#22240;&#23376;&#65292;&#28982;&#21518;&#20351;&#29992;&#22522;&#20110;&#25913;&#36827;&#28388;&#27874;&#22120;&#21644;&#24179;&#28369;&#22120;&#30340;EM&#31639;&#27861;&#65292;&#20272;&#35745;&#21152;&#36733;&#22240;&#23376;&#21644;&#36716;&#25442;&#27010;&#29575;&#12290;&#36825;&#31181;&#26041;&#27861;&#30340;&#21560;&#24341;&#21147;&#22312;&#20110;&#25552;&#20379;&#20102;&#25152;&#26377;&#20272;&#35745;&#37327;&#30340;&#38381;&#24335;&#34920;&#36798;&#24335;&#65292;&#24182;&#19988;&#19981;&#38656;&#35201;&#30693;&#36947;&#30495;&#23454;&#22240;&#23376;&#30340;&#25968;&#37327;&#12290;&#36890;&#36807;&#19968;&#31995;&#21015;&#33945;&#29305;&#21345;&#27931;&#23454;&#39564;&#23637;&#31034;&#20102;&#35813;&#26041;&#27861;&#30340;&#33391;&#22909;&#26377;&#38480;&#26679;&#26412;&#24615;&#33021;&#65292;&#24182;&#36890;&#36807;&#23545;&#22823;&#22411;&#32929;&#31080;&#32452;&#21512;&#30340;&#24212;&#29992;&#39564;&#35777;&#20102;&#26041;&#27861;&#30340;&#23454;&#35777;&#25928;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#19968;&#20010;&#26032;&#22411;&#30340;&#22823;&#32500;&#36817;&#20284;&#22240;&#23376;&#27169;&#22411;&#65292;&#20854;&#20013;&#21152;&#36733;&#22240;&#23376;&#30001;&#28508;&#22312;&#30340;&#19968;&#38454;&#39532;&#23572;&#21487;&#22827;&#36807;&#31243;&#39537;&#21160;&#12290;&#36890;&#36807;&#21033;&#29992;&#27169;&#22411;&#30340;&#31561;&#20215;&#32447;&#24615;&#34920;&#31034;&#65292;&#25105;&#20204;&#39318;&#20808;&#36890;&#36807;&#20027;&#25104;&#20998;&#20998;&#26512;&#24674;&#22797;&#28508;&#22312;&#22240;&#23376;&#12290;&#28982;&#21518;&#25105;&#20204;&#23558;&#27169;&#22411;&#36716;&#21270;&#20026;&#29366;&#24577;&#31354;&#38388;&#24418;&#24335;&#65292;&#24182;&#36890;&#36807;&#22522;&#20110;&#25913;&#36827;&#29256;&#26412;&#30340;Baum-Lindgren-Hamilton-Kim&#28388;&#27874;&#22120;&#21644;&#24179;&#28369;&#22120;&#30340;EM&#31639;&#27861;&#65292;&#21033;&#29992;&#20808;&#21069;&#20272;&#35745;&#24471;&#21040;&#30340;&#22240;&#23376;&#26469;&#20272;&#35745;&#21152;&#36733;&#22240;&#23376;&#21644;&#36716;&#25442;&#27010;&#29575;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#20855;&#26377;&#21560;&#24341;&#21147;&#65292;&#22240;&#20026;&#23427;&#20026;&#25152;&#26377;&#20272;&#35745;&#37327;&#25552;&#20379;&#20102;&#38381;&#24335;&#34920;&#36798;&#24335;&#12290;&#26356;&#37325;&#35201;&#30340;&#26159;&#65292;&#23427;&#19981;&#38656;&#35201;&#30693;&#36947;&#30495;&#23454;&#22240;&#23376;&#30340;&#25968;&#37327;&#12290;&#25105;&#20204;&#25512;&#23548;&#20102;&#25152;&#25552;&#20272;&#35745;&#36807;&#31243;&#30340;&#29702;&#35770;&#24615;&#36136;&#65292;&#24182;&#36890;&#36807;&#19968;&#22871;&#20840;&#38754;&#30340;&#33945;&#29305;&#21345;&#27931;&#23454;&#39564;&#23637;&#31034;&#20102;&#23427;&#20204;&#30340;&#33391;&#22909;&#26377;&#38480;&#26679;&#26412;&#24615;&#33021;&#12290;&#36890;&#36807;&#23545;&#19968;&#20010;&#22823;&#22411;&#32929;&#31080;&#25237;&#36164;&#32452;&#21512;&#30340;&#24212;&#29992;&#65292;&#25105;&#20204;&#35828;&#26126;&#20102;&#25105;&#20204;&#26041;&#27861;&#30340;&#23454;&#35777;&#25928;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study a novel large dimensional approximate factor model with regime changes in the loadings driven by a latent first order Markov process. By exploiting the equivalent linear representation of the model, we first recover the latent factors by means of Principal Component Analysis. We then cast the model in state-space form, and we estimate loadings and transition probabilities through an EM algorithm based on a modified version of the Baum-Lindgren-Hamilton-Kim filter and smoother that makes use of the factors previously estimated. Our approach is appealing as it provides closed form expressions for all estimators. More importantly, it does not require knowledge of the true number of factors. We derive the theoretical properties of the proposed estimation procedure, and we show their good finite sample performance through a comprehensive set of Monte Carlo experiments. The empirical usefulness of our approach is illustrated through an application to a large portfolio of stocks.
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#26377;&#38480;&#27880;&#24847;&#21147;&#26465;&#20214;&#19979;&#30340;&#25581;&#31034;&#24615;&#20559;&#22909;&#20998;&#26512;&#12290;&#36890;&#36807;&#24341;&#20837;&#27880;&#24847;&#21147;&#24213;&#32447;&#65292;&#25552;&#20986;&#20102;&#19968;&#31995;&#21015;&#27169;&#22411;&#26469;&#35299;&#20915;&#26631;&#20934;&#27169;&#22411;&#30340;&#19981;&#36275;&#12290;&#23454;&#39564;&#25968;&#25454;&#34920;&#26126;&#65292;&#22312;&#25551;&#36848;&#34892;&#20026;&#26041;&#38754;&#65292;&#20551;&#35774;&#34987;&#35797;&#22312;&#20915;&#31574;&#21069;&#33267;&#23569;&#36827;&#34892;&#19968;&#27425;&#27604;&#36739;&#20960;&#20046;&#27809;&#26377;&#25104;&#26412;&#65292;&#32780;&#22312;&#25581;&#31034;&#24615;&#20559;&#22909;&#26041;&#38754;&#65292;&#20462;&#27491;&#21518;&#30340;&#27169;&#22411;&#26356;&#22909;&#22320;&#24674;&#22797;&#20102;&#20559;&#22909;&#12290;</title><link>http://arxiv.org/abs/2208.07659</link><description>&lt;p&gt;
&#26377;&#38480;&#27880;&#24847;&#21147;&#26465;&#20214;&#19979;&#30340;&#25581;&#31034;&#24615;&#20559;&#22909;&#20998;&#26512;
&lt;/p&gt;
&lt;p&gt;
Revealed Preference Analysis Under Limited Attention. (arXiv:2208.07659v3 [econ.TH] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2208.07659
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#26377;&#38480;&#27880;&#24847;&#21147;&#26465;&#20214;&#19979;&#30340;&#25581;&#31034;&#24615;&#20559;&#22909;&#20998;&#26512;&#12290;&#36890;&#36807;&#24341;&#20837;&#27880;&#24847;&#21147;&#24213;&#32447;&#65292;&#25552;&#20986;&#20102;&#19968;&#31995;&#21015;&#27169;&#22411;&#26469;&#35299;&#20915;&#26631;&#20934;&#27169;&#22411;&#30340;&#19981;&#36275;&#12290;&#23454;&#39564;&#25968;&#25454;&#34920;&#26126;&#65292;&#22312;&#25551;&#36848;&#34892;&#20026;&#26041;&#38754;&#65292;&#20551;&#35774;&#34987;&#35797;&#22312;&#20915;&#31574;&#21069;&#33267;&#23569;&#36827;&#34892;&#19968;&#27425;&#27604;&#36739;&#20960;&#20046;&#27809;&#26377;&#25104;&#26412;&#65292;&#32780;&#22312;&#25581;&#31034;&#24615;&#20559;&#22909;&#26041;&#38754;&#65292;&#20462;&#27491;&#21518;&#30340;&#27169;&#22411;&#26356;&#22909;&#22320;&#24674;&#22797;&#20102;&#20559;&#22909;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35266;&#23519;&#32773;&#24076;&#26395;&#20174;&#20915;&#31574;&#32773;&#30340;&#36873;&#25321;&#20013;&#20102;&#35299;&#20854;&#31119;&#31049;&#12290;&#22905;&#35748;&#20026;&#20915;&#31574;&#26159;&#22312;&#26377;&#38480;&#27880;&#24847;&#21147;&#19979;&#20570;&#20986;&#30340;&#12290;&#25105;&#20204;&#35748;&#20026;&#26377;&#38480;&#27880;&#24847;&#21147;&#30340;&#26631;&#20934;&#27169;&#22411;&#19981;&#33021;&#22815;&#24456;&#22909;&#22320;&#24110;&#21161;&#35266;&#23519;&#32773;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#19968;&#31867;&#22312;&#26377;&#38480;&#27880;&#24847;&#21147;&#19979;&#30340;&#36873;&#25321;&#27169;&#22411;&#65292;&#36890;&#36807;&#22312;&#20915;&#31574;&#36807;&#31243;&#20013;&#24341;&#20837;&#19968;&#20010;&#27880;&#24847;&#21147;&#24213;&#32447;&#12290;&#25105;&#20204;&#26500;&#24314;&#20102;&#19968;&#20010;&#31639;&#27861;&#65292;&#22312;&#36825;&#20123;&#27169;&#22411;&#20013;&#32473;&#23450;&#19968;&#20010;&#19981;&#23436;&#25972;&#30340;&#25968;&#25454;&#38598;&#21512;&#65292;&#26469;&#24674;&#22797;&#20986;&#25581;&#31034;&#24615;&#20559;&#22909;&#20851;&#31995;&#12290;&#25509;&#19979;&#26469;&#65292;&#25105;&#20204;&#23558;&#36825;&#20123;&#27169;&#22411;&#24212;&#29992;&#21040;&#23454;&#39564;&#25968;&#25454;&#20013;&#12290;&#39318;&#20808;&#65292;&#25105;&#20204;&#34920;&#26126;&#20551;&#35774;&#34987;&#35797;&#22312;&#26368;&#32456;&#20915;&#31574;&#20043;&#21069;&#33267;&#23569;&#36827;&#34892;&#19968;&#27425;&#27604;&#36739;&#65288;&#20063;&#23601;&#26159;&#27880;&#24847;&#21147;&#24213;&#32447;&#20026;2&#65289;&#22312;&#25551;&#36848;&#34892;&#20026;&#26041;&#38754;&#20960;&#20046;&#27809;&#26377;&#25104;&#26412;&#65292;&#19982;&#26377;&#38480;&#27880;&#24847;&#21147;&#30340;&#26631;&#20934;&#27169;&#22411;&#30456;&#27604;&#12290;&#28982;&#32780;&#65292;&#22312;&#25581;&#31034;&#24615;&#20559;&#22909;&#26041;&#38754;&#65292;&#20462;&#25913;&#21518;&#30340;&#27169;&#22411;&#34920;&#29616;&#26356;&#22909;&#12290;&#22312;&#26631;&#20934;&#27169;&#22411;&#20013;&#65292;&#25105;&#20204;&#19981;&#33021;&#24674;&#22797;63%&#30340;&#34987;&#35797;&#30340;&#20559;&#22909;&#65292;&#32780;&#20462;&#27491;&#21518;&#30340;&#27169;&#22411;&#21487;&#20197;&#24674;&#22797;&#20986;&#26356;&#22810;&#30340;&#20559;&#22909;&#12290;
&lt;/p&gt;
&lt;p&gt;
An observer wants to understand a decision-maker's welfare from her choice. She believes that decisions are made under limited attention. We argue that the standard model of limited attention cannot help the observer greatly. To address this issue, we study a family of models of choice under limited attention by imposing an attention floor in the decision process. We construct an algorithm that recovers the revealed preference relation given an incomplete data set in these models. Next, we take these models to the experimental data. We first show that assuming that subjects make at least one comparison before finalizing decisions (that is, an attention floor of 2) is almost costless in terms of describing the behavior when compared to the standard model of limited attention. In terms of revealed preferences, on the other hand, the amended model does significantly better. We can not recover any preferences for 63% of the subjects in the standard model, while the amended model reveals so
&lt;/p&gt;</description></item><item><title>&#22312;&#27665;&#20027;&#36873;&#20030;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#20845;&#20010;&#20851;&#20110;&#36133;&#36873;&#30340;&#20844;&#29702;&#65292;&#20854;&#20013;&#20116;&#20010;&#20844;&#29702;&#34987;&#24050;&#30693;&#30340;&#25237;&#31080;&#31243;&#24207;&#24191;&#27867;&#28385;&#36275;&#65292;&#31532;&#20845;&#20010;&#20844;&#29702;&#26159;&#32943;&#23612;&#26031;&#183;&#33406;&#32599;&#33879;&#21517;&#30340;&#26080;&#20851;&#26367;&#20195;&#21697;&#29420;&#31435;&#26465;&#20214;&#30340;&#19968;&#20010;&#24369;&#21270;&#29256;&#26412;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#36825;&#20123;&#20844;&#29702;&#19982;&#19968;&#31181;&#21483;&#20570;&#20998;&#35010;&#21608;&#26399;&#30340;&#26041;&#27861;&#30456;&#32467;&#21512;&#65292;&#21487;&#20197;&#25552;&#20379;&#26368;&#26524;&#26029;&#30340;&#36133;&#36873;&#23450;&#20041;&#65292;&#24182;&#19988;&#20998;&#26512;&#20102;&#35813;&#26041;&#27861;&#22914;&#20309;&#36867;&#33073;&#20102;&#33406;&#32599;&#30340;&#19981;&#21487;&#33021;&#23450;&#29702;&#21644;&#30456;&#20851;&#30340;&#19981;&#21487;&#33021;&#24615;&#32467;&#26524;&#12290;</title><link>http://arxiv.org/abs/2008.08451</link><description>&lt;p&gt;
&#27665;&#20027;&#36873;&#20030;&#20013;&#30340;&#36133;&#36873;&#20844;&#29702;
&lt;/p&gt;
&lt;p&gt;
Axioms for Defeat in Democratic Elections. (arXiv:2008.08451v4 [econ.TH] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2008.08451
&lt;/p&gt;
&lt;p&gt;
&#22312;&#27665;&#20027;&#36873;&#20030;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#20845;&#20010;&#20851;&#20110;&#36133;&#36873;&#30340;&#20844;&#29702;&#65292;&#20854;&#20013;&#20116;&#20010;&#20844;&#29702;&#34987;&#24050;&#30693;&#30340;&#25237;&#31080;&#31243;&#24207;&#24191;&#27867;&#28385;&#36275;&#65292;&#31532;&#20845;&#20010;&#20844;&#29702;&#26159;&#32943;&#23612;&#26031;&#183;&#33406;&#32599;&#33879;&#21517;&#30340;&#26080;&#20851;&#26367;&#20195;&#21697;&#29420;&#31435;&#26465;&#20214;&#30340;&#19968;&#20010;&#24369;&#21270;&#29256;&#26412;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#36825;&#20123;&#20844;&#29702;&#19982;&#19968;&#31181;&#21483;&#20570;&#20998;&#35010;&#21608;&#26399;&#30340;&#26041;&#27861;&#30456;&#32467;&#21512;&#65292;&#21487;&#20197;&#25552;&#20379;&#26368;&#26524;&#26029;&#30340;&#36133;&#36873;&#23450;&#20041;&#65292;&#24182;&#19988;&#20998;&#26512;&#20102;&#35813;&#26041;&#27861;&#22914;&#20309;&#36867;&#33073;&#20102;&#33406;&#32599;&#30340;&#19981;&#21487;&#33021;&#23450;&#29702;&#21644;&#30456;&#20851;&#30340;&#19981;&#21487;&#33021;&#24615;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#20845;&#20010;&#20851;&#20110;&#22312;&#28041;&#21450;&#20004;&#20010;&#25110;&#26356;&#22810;&#20505;&#36873;&#20154;&#30340;&#27665;&#20027;&#36873;&#20030;&#20013;&#65292;&#19968;&#20010;&#20505;&#36873;&#20154;&#20309;&#26102;&#24212;&#35813;&#20987;&#36133;&#21478;&#19968;&#20010;&#20505;&#36873;&#20154;&#30340;&#20844;&#29702;&#12290;&#20854;&#20013;&#20116;&#20010;&#20844;&#29702;&#26159;&#24050;&#30693;&#25237;&#31080;&#31243;&#24207;&#24191;&#27867;&#28385;&#36275;&#30340;&#12290;&#31532;&#20845;&#20010;&#20844;&#29702;&#26159;&#32943;&#23612;&#26031;&#183;&#33406;&#32599;&#65288;Kenneth Arrow&#65289;&#33879;&#21517;&#30340;&#26080;&#20851;&#26367;&#20195;&#21697;&#29420;&#31435;&#26465;&#20214;&#65288;IIA&#65289;&#30340;&#19968;&#20010;&#24369;&#21270;&#29256;&#26412;&#12290;&#25105;&#20204;&#31216;&#36825;&#20010;&#24369;&#21270;&#29256;&#26412;&#20026;&#19968;&#33268;&#30340;IIA&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#36825;&#20116;&#20010;&#20844;&#29702;&#21152;&#19978;&#19968;&#33268;&#30340;IIA&#23558;&#21333;&#29420;&#30830;&#23450;&#20102;&#25105;&#20204;&#26368;&#36817;&#30740;&#31350;&#20013;&#30740;&#31350;&#30340;&#20915;&#23450;&#36133;&#36873;&#30340;&#26041;&#27861;&#65306;&#20998;&#35010;&#21608;&#26399;&#12290;&#29305;&#21035;&#22320;&#65292;&#20998;&#35010;&#21608;&#26399;&#25552;&#20379;&#20102;&#22312;&#28385;&#36275;&#20845;&#20010;&#27665;&#20027;&#36133;&#36873;&#20844;&#29702;&#30340;&#20219;&#20309;&#26041;&#27861;&#20013;&#26368;&#26524;&#26029;&#30340;&#36133;&#36873;&#23450;&#20041;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#20998;&#26512;&#20102;&#20998;&#35010;&#21608;&#26399;&#22914;&#20309;&#36867;&#33073;&#20102;&#33406;&#32599;&#30340;&#19981;&#21487;&#33021;&#23450;&#29702;&#21644;&#30456;&#20851;&#30340;&#19981;&#21487;&#33021;&#24615;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
We propose six axioms concerning when one candidate should defeat another in a democratic election involving two or more candidates. Five of the axioms are widely satisfied by known voting procedures. The sixth axiom is a weakening of Kenneth Arrow's famous condition of the Independence of Irrelevant Alternatives (IIA). We call this weakening Coherent IIA. We prove that the five axioms plus Coherent IIA single out a method of determining defeats studied in our recent work: Split Cycle. In particular, Split Cycle provides the most resolute definition of defeat among any satisfying the six axioms for democratic defeat. In addition, we analyze how Split Cycle escapes Arrow's Impossibility Theorem and related impossibility results.
&lt;/p&gt;</description></item></channel></rss>