<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#23545;&#20110;&#27169;&#31946;&#20998;&#31867;&#38382;&#39064;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#28385;&#36275;&#24369;&#19968;&#33268;&#24615;&#26465;&#20214;&#30340;&#29420;&#31435;&#32858;&#21512;&#35268;&#21017;&#23646;&#20110;&#21152;&#26435;&#31639;&#26415;&#24179;&#22343;&#25968;&#30340;&#23478;&#26063;&#65292;&#24182;&#32473;&#20986;&#20102;$m= p= 2$&#30340;&#29305;&#24449;&#21270;&#32467;&#26524;&#12290;</title><link>https://arxiv.org/abs/2402.17620</link><description>&lt;p&gt;
&#27169;&#31946;&#20998;&#31867;&#32858;&#21512;
&lt;/p&gt;
&lt;p&gt;
Fuzzy Classification Aggregation
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.17620
&lt;/p&gt;
&lt;p&gt;
&#23545;&#20110;&#27169;&#31946;&#20998;&#31867;&#38382;&#39064;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#28385;&#36275;&#24369;&#19968;&#33268;&#24615;&#26465;&#20214;&#30340;&#29420;&#31435;&#32858;&#21512;&#35268;&#21017;&#23646;&#20110;&#21152;&#26435;&#31639;&#26415;&#24179;&#22343;&#25968;&#30340;&#23478;&#26063;&#65292;&#24182;&#32473;&#20986;&#20102;$m= p= 2$&#30340;&#29305;&#24449;&#21270;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#32771;&#34385;&#19968;&#20010;&#38382;&#39064;&#65292;&#21363;&#19968;&#32452;&#20010;&#20307;&#24517;&#39035;&#23558;$m$&#20010;&#23545;&#35937;&#20998;&#31867;&#21040;$p$&#20010;&#31867;&#21035;&#20013;&#65292;&#24182;&#36890;&#36807;&#32858;&#21512;&#20010;&#20307;&#20998;&#31867;&#26469;&#23454;&#29616;&#12290;&#25105;&#20204;&#35777;&#26126;&#65292;&#22914;&#26524;$m\geq 3$&#65292;$m\geq p\geq 2$&#65292;&#24182;&#19988;&#20998;&#31867;&#26159;&#27169;&#31946;&#30340;&#65292;&#20063;&#23601;&#26159;&#35828;&#65292;&#23545;&#35937;&#23646;&#20110;&#26576;&#19968;&#31867;&#21035;&#30340;&#31243;&#24230;&#19981;&#21516;&#65292;&#21017;&#28385;&#36275;&#24369;&#19968;&#33268;&#24615;&#26465;&#20214;&#30340;&#29420;&#31435;&#32858;&#21512;&#35268;&#21017;&#23646;&#20110;&#21152;&#26435;&#31639;&#26415;&#24179;&#22343;&#25968;&#30340;&#23478;&#26063;&#12290;&#25105;&#20204;&#36824;&#33719;&#24471;&#20102;$m= p= 2$&#30340;&#29305;&#24449;&#21270;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.17620v1 Announce Type: new  Abstract: We consider the problem where a set of individuals has to classify $m$ objects into $p$ categories and does so by aggregating the individual classifications. We show that if $m\geq 3$, $m\geq p\geq 2$, and classifications are fuzzy, that is, objects belong to a category to a certain degree, then an independent aggregator rule that satisfies a weak unanimity condition belongs to the family of Weighted Arithmetic Means. We also obtain characterization results for $m= p= 2$.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#19968;&#20010;&#23545;&#21452;&#21521;&#32858;&#31867;&#20381;&#36182;&#20855;&#26377;&#30456;&#20851;&#20849;&#21516;&#26102;&#38388;&#25928;&#24212;&#30340;&#38754;&#26495;&#27169;&#22411;&#30340;&#26041;&#24046;&#20272;&#35745;&#26041;&#27861;&#65292;&#24182;&#25552;&#20986;&#20102;&#20004;&#20010;&#20559;&#24046;&#26657;&#27491;&#30340;&#26041;&#24046;&#20272;&#35745;&#22120;&#12290;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;&#35813;&#26041;&#24046;&#20272;&#35745;&#26041;&#27861;&#30340;&#22266;&#23450;b&#28176;&#36817;&#29702;&#35770;&#19982;&#25991;&#29486;&#20013;&#30340;&#28176;&#36817;&#27491;&#24577;&#32467;&#26524;&#30456;&#21563;&#21512;&#12290;</title><link>http://arxiv.org/abs/2309.08707</link><description>&lt;p&gt;
&#24102;&#26377;&#21452;&#21521;&#32858;&#31867;&#30340;&#38754;&#26495;&#27169;&#22411;&#30340;&#22266;&#23450;b&#28176;&#36817;&#29702;&#35770;
&lt;/p&gt;
&lt;p&gt;
Fixed-b Asymptotics for Panel Models with Two-Way Clustering. (arXiv:2309.08707v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.08707
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#19968;&#20010;&#23545;&#21452;&#21521;&#32858;&#31867;&#20381;&#36182;&#20855;&#26377;&#30456;&#20851;&#20849;&#21516;&#26102;&#38388;&#25928;&#24212;&#30340;&#38754;&#26495;&#27169;&#22411;&#30340;&#26041;&#24046;&#20272;&#35745;&#26041;&#27861;&#65292;&#24182;&#25552;&#20986;&#20102;&#20004;&#20010;&#20559;&#24046;&#26657;&#27491;&#30340;&#26041;&#24046;&#20272;&#35745;&#22120;&#12290;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;&#35813;&#26041;&#24046;&#20272;&#35745;&#26041;&#27861;&#30340;&#22266;&#23450;b&#28176;&#36817;&#29702;&#35770;&#19982;&#25991;&#29486;&#20013;&#30340;&#28176;&#36817;&#27491;&#24577;&#32467;&#26524;&#30456;&#21563;&#21512;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#30001;Chiang, Hansen&#21644;Sasaki (2022)&#25552;&#20986;&#30340;&#19968;&#31181;&#23545;&#38754;&#26495;&#25968;&#25454;&#20013;&#20855;&#26377;&#30456;&#20851;&#20849;&#21516;&#26102;&#38388;&#25928;&#24212;&#30340;&#21452;&#21521;&#32858;&#31867;&#20381;&#36182;&#30340;&#26041;&#24046;&#20272;&#35745;&#26041;&#27861;&#12290;&#39318;&#20808;&#65292;&#25105;&#20204;&#36890;&#36807;&#20195;&#25968;&#26041;&#27861;&#35777;&#26126;&#20102;&#35813;&#26041;&#24046;&#20272;&#35745;&#26041;&#27861;&#65288;&#20197;&#19979;&#31616;&#31216;CHS&#20272;&#35745;&#22120;&#65289;&#26159;&#19977;&#31181;&#24120;&#35265;&#26041;&#24046;&#20272;&#35745;&#26041;&#27861;&#30340;&#32447;&#24615;&#32452;&#21512;&#65306;Arellano (1987)&#30340;&#32858;&#31867;&#20272;&#35745;&#22120;&#12289;Driscoll&#21644;Kraay (1998)&#30340;&#8220;&#24179;&#22343;&#30340;HAC&#8221;&#20272;&#35745;&#22120;&#65292;&#20197;&#21450;Newey&#21644;West (1987)&#12289;Vogelsang (2012)&#30340;&#8220;HAC&#30340;&#24179;&#22343;&#8221;&#20272;&#35745;&#22120;&#12290;&#22522;&#20110;&#36825;&#19968;&#21457;&#29616;&#65292;&#25105;&#20204;&#24471;&#21040;&#20102;CHS&#20272;&#35745;&#22120;&#21450;&#20854;&#23545;&#24212;&#30340;&#26816;&#39564;&#32479;&#35745;&#37327;&#30340;&#22266;&#23450;b&#28176;&#36817;&#32467;&#26524;&#65292;&#21363;&#22312;&#27178;&#25130;&#38754;&#21644;&#26102;&#38388;&#26679;&#26412;&#23481;&#37327;&#20849;&#21516;&#36235;&#21521;&#26080;&#31351;&#22823;&#26102;&#30340;&#32467;&#26524;&#12290;&#24403;&#24102;&#23485;&#19982;&#26102;&#38388;&#26679;&#26412;&#23481;&#37327;&#20043;&#27604;&#36235;&#21521;&#20110;&#38646;&#26102;&#65292;&#22266;&#23450;b&#28176;&#36817;&#32467;&#26524;&#19982;Chiang&#31561;&#20154;(2022)&#30340;&#28176;&#36817;&#27491;&#24577;&#32467;&#26524;&#30456;&#21563;&#21512;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#20004;&#31181;&#26367;&#20195;&#24615;&#30340;&#20559;&#24046;&#26657;&#27491;&#26041;&#24046;&#20272;&#35745;&#22120;&#65292;&#24182;&#25512;&#23548;&#20986;&#30456;&#24212;&#30340;&#22266;&#23450;b&#28176;&#36817;&#38480;&#21046;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper studies a variance estimator proposed by Chiang, Hansen and Sasaki (2022) that is robust to two-way clustering dependence with correlated common time effects in panels. First, we show algebraically that this variance estimator (CHS estimator, hereafter) is a linear combination of three common variance estimators: the cluster estimator by Arellano (1987), the "HAC of averages" estimator by Driscoll and Kraay (1998), and the "average of HACs" estimator (Newey and West (1987) and Vogelsang (2012)). Based on this finding, we obtain a fixed-b asymptotic result for the CHS estimator and corresponding test statistics as the cross-section and time sample sizes jointly go to infinity. As the ratio of the bandwidth to the time sample size goes to zero, the fixed-b asymptotic results match the asymptotic normality result in Chiang et al. (2022). Furthermore, we propose two alternative bias-corrected variance estimators and derive fixed-b asymptotics limits. While the test statistics ar
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;Probit&#21644;Tobit&#27169;&#22411;&#20013;&#30340;&#31471;&#28857;&#25928;&#24212;&#19982;&#20869;&#29983;&#24615;&#65292;&#35777;&#26126;&#20102;&#26410;&#21306;&#20998;&#20004;&#31181;&#20869;&#29983;&#24615;&#20250;&#23548;&#33268;&#23545;&#20559;&#25928;&#24212;&#30340;&#20302;&#20272;&#25110;&#39640;&#20272;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#31616;&#21333;&#30340;&#20559;&#25928;&#24212;&#33539;&#22260;&#20272;&#35745;&#22120;&#24182;&#25552;&#20379;&#26131;&#20110;&#23454;&#29616;&#30340;&#32622;&#20449;&#21306;&#38388;&#12290;</title><link>http://arxiv.org/abs/2306.14862</link><description>&lt;p&gt;
Probit&#21644;Tobit&#27169;&#22411;&#20013;&#30340;&#31471;&#28857;&#25928;&#24212;&#19982;&#20869;&#29983;&#24615;
&lt;/p&gt;
&lt;p&gt;
Marginal Effects for Probit and Tobit with Endogeneity. (arXiv:2306.14862v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.14862
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;Probit&#21644;Tobit&#27169;&#22411;&#20013;&#30340;&#31471;&#28857;&#25928;&#24212;&#19982;&#20869;&#29983;&#24615;&#65292;&#35777;&#26126;&#20102;&#26410;&#21306;&#20998;&#20004;&#31181;&#20869;&#29983;&#24615;&#20250;&#23548;&#33268;&#23545;&#20559;&#25928;&#24212;&#30340;&#20302;&#20272;&#25110;&#39640;&#20272;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#31616;&#21333;&#30340;&#20559;&#25928;&#24212;&#33539;&#22260;&#20272;&#35745;&#22120;&#24182;&#25552;&#20379;&#26131;&#20110;&#23454;&#29616;&#30340;&#32622;&#20449;&#21306;&#38388;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#35780;&#20272;&#20559;&#25928;&#24212;&#26102;&#65292;&#21306;&#20998;&#32467;&#26500;&#24615;&#20869;&#29983;&#24615;&#21644;&#27979;&#37327;&#35823;&#24046;&#38750;&#24120;&#37325;&#35201;&#12290;&#19982;&#32447;&#24615;&#27169;&#22411;&#19981;&#21516;&#65292;&#36825;&#20004;&#31181;&#20869;&#29983;&#24615;&#26469;&#28304;&#22312;&#38750;&#32447;&#24615;&#27169;&#22411;&#20013;&#23545;&#20559;&#25928;&#24212;&#30340;&#24433;&#21709;&#19981;&#21516;&#12290;&#26412;&#25991;&#20197;&#24037;&#20855;&#21464;&#37327;&#65288;IV&#65289;Probit&#21644;Tobit&#27169;&#22411;&#20026;&#37325;&#28857;&#30740;&#31350;&#20102;&#36825;&#20010;&#38382;&#39064;&#12290;&#25105;&#20204;&#34920;&#26126;&#65292;&#21363;&#20351;&#23384;&#22312;&#26377;&#25928;&#30340;IV&#65292;&#26410;&#33021;&#21306;&#20998;&#36825;&#20004;&#31181;&#20869;&#29983;&#24615;&#31867;&#22411;&#20063;&#21487;&#33021;&#23548;&#33268;&#20559;&#25928;&#24212;&#34987;&#20302;&#20272;&#25110;&#39640;&#20272;&#12290;&#25105;&#20204;&#24320;&#21457;&#20102;&#31616;&#21333;&#30340;&#20559;&#25928;&#24212;&#33539;&#22260;&#20272;&#35745;&#22120;&#65292;&#24182;&#25552;&#20379;&#26131;&#20110;&#23454;&#29616;&#30340;&#32622;&#20449;&#21306;&#38388;&#65292;&#35813;&#21306;&#38388;&#27491;&#30830;&#22320;&#32771;&#34385;&#20102;&#20004;&#31181;&#31867;&#22411;&#30340;&#20869;&#29983;&#24615;&#12290;&#25105;&#20204;&#22312;Monte Carlo&#27169;&#25311;&#21644;&#23454;&#35777;&#24212;&#29992;&#20013;&#35828;&#26126;&#20102;&#36825;&#20123;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
When evaluating partial effects, it is important to distinguish between structural endogeneity and measurement errors. In contrast to linear models, these two sources of endogeneity affect partial effects differently in nonlinear models. We study this issue focusing on the Instrumental Variable (IV) Probit and Tobit models. We show that even when a valid IV is available, failing to differentiate between the two types of endogeneity can lead to either under- or over-estimation of the partial effects. We develop simple estimators of the bounds on the partial effects and provide easy to implement confidence intervals that correctly account for both types of endogeneity. We illustrate the methods in a Monte Carlo simulation and an empirical application.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#35782;&#21035;&#31574;&#30053;&#26469;&#35299;&#20915;&#20855;&#26377;&#28382;&#21518;&#20381;&#36182;&#21464;&#37327;&#12289;&#22806;&#29983;&#21327;&#21464;&#37327;&#21644;&#23454;&#20307;&#22266;&#23450;&#25928;&#24212;&#30340;&#38754;&#26495;&#25968;&#25454;&#20108;&#20803;&#36873;&#25321;&#27169;&#22411;&#30340;&#35782;&#21035;&#21644;&#20272;&#35745;&#38382;&#39064;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#20801;&#35768;&#20219;&#20309;&#24418;&#24335;&#30340;&#26102;&#38388;&#36235;&#21183;&#65292;&#19981;&#20250;&#21463;&#21040;&#8220;&#32500;&#24230;&#28798;&#38590;&#8221;&#30340;&#24433;&#21709;&#12290;&#22312;&#26377;&#38480;&#26679;&#26412;&#20013;&#34920;&#29616;&#33391;&#22909;&#12290;</title><link>http://arxiv.org/abs/2301.09379</link><description>&lt;p&gt;
&#37325;&#35775;&#20855;&#26377;&#28382;&#21518;&#20381;&#36182;&#21464;&#37327;&#30340;&#38754;&#26495;&#25968;&#25454;&#31163;&#25955;&#36873;&#25321;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
Revisiting Panel Data Discrete Choice Models with Lagged Dependent Variables. (arXiv:2301.09379v2 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2301.09379
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#35782;&#21035;&#31574;&#30053;&#26469;&#35299;&#20915;&#20855;&#26377;&#28382;&#21518;&#20381;&#36182;&#21464;&#37327;&#12289;&#22806;&#29983;&#21327;&#21464;&#37327;&#21644;&#23454;&#20307;&#22266;&#23450;&#25928;&#24212;&#30340;&#38754;&#26495;&#25968;&#25454;&#20108;&#20803;&#36873;&#25321;&#27169;&#22411;&#30340;&#35782;&#21035;&#21644;&#20272;&#35745;&#38382;&#39064;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#20801;&#35768;&#20219;&#20309;&#24418;&#24335;&#30340;&#26102;&#38388;&#36235;&#21183;&#65292;&#19981;&#20250;&#21463;&#21040;&#8220;&#32500;&#24230;&#28798;&#38590;&#8221;&#30340;&#24433;&#21709;&#12290;&#22312;&#26377;&#38480;&#26679;&#26412;&#20013;&#34920;&#29616;&#33391;&#22909;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#37325;&#35775;&#20102;&#20855;&#26377;&#28382;&#21518;&#20381;&#36182;&#21464;&#37327;&#12289;&#22806;&#29983;&#21327;&#21464;&#37327;&#21644;&#23454;&#20307;&#22266;&#23450;&#25928;&#24212;&#30340;&#21322;&#21442;&#25968;&#65288;&#20998;&#24067;&#33258;&#30001;&#65289;&#38754;&#26495;&#25968;&#25454;&#20108;&#20803;&#36873;&#25321;&#27169;&#22411;&#30340;&#35782;&#21035;&#21644;&#20272;&#35745;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#35782;&#21035;&#31574;&#30053;&#65292;&#20351;&#29992;&#20102;&#8220;&#35782;&#21035;&#30340;&#26080;&#38480;&#24615;&#8221;&#35770;&#35777;&#12290;&#19982;&#33879;&#21517;&#30340;Honore&#21644;Kyriazidou&#65288;2000&#65289;&#19981;&#21516;&#65292;&#25105;&#20204;&#30340;&#26041;&#27861;&#20801;&#35768;&#20219;&#20309;&#24418;&#24335;&#30340;&#26102;&#38388;&#36235;&#21183;&#65292;&#32780;&#19988;&#19981;&#20250;&#21463;&#21040;&#8220;&#32500;&#24230;&#28798;&#38590;&#8221;&#30340;&#24433;&#21709;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#26131;&#20110;&#23454;&#26045;&#30340;&#26465;&#20214;&#26368;&#22823;&#24471;&#20998;&#20272;&#35745;&#22120;&#12290;&#25152;&#25552;&#20986;&#20272;&#35745;&#22120;&#30340;&#28176;&#36817;&#24615;&#36136;&#24471;&#21040;&#20102;&#20805;&#20998;&#30340;&#34920;&#24449;&#12290;&#19968;&#39033;&#23567;&#35268;&#27169;&#33945;&#29305;&#21345;&#32599;&#30740;&#31350;&#34920;&#26126;&#65292;&#25105;&#20204;&#30340;&#26041;&#27861;&#22312;&#26377;&#38480;&#26679;&#26412;&#20013;&#34920;&#29616;&#20196;&#20154;&#28385;&#24847;&#12290;&#25105;&#20204;&#36890;&#36807;&#20351;&#29992;&#28595;&#22823;&#21033;&#20122;&#23478;&#24237;&#25910;&#20837;&#21644;&#21171;&#21160;&#21147;&#21160;&#24577;&#35843;&#26597;&#65288;HILDA&#65289;&#25968;&#25454;&#65292;&#25552;&#20986;&#20102;&#19968;&#20010;&#20851;&#20110;&#31169;&#20154;&#21307;&#38498;&#20445;&#38505;&#30331;&#35760;&#30340;&#23454;&#35777;&#24212;&#29992;&#26469;&#35828;&#26126;&#25105;&#20204;&#26041;&#27861;&#30340;&#26377;&#29992;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper revisits the identification and estimation of a class of semiparametric (distribution-free) panel data binary choice models with lagged dependent variables, exogenous covariates, and entity fixed effects. We provide a novel identification strategy, using an "identification at infinity" argument. In contrast with the celebrated Honore and Kyriazidou (2000), our method permits time trends of any form and does not suffer from the "curse of dimensionality". We propose an easily implementable conditional maximum score estimator. The asymptotic properties of the proposed estimator are fully characterized. A small-scale Monte Carlo study demonstrates that our approach performs satisfactorily in finite samples. We illustrate the usefulness of our method by presenting an empirical application to enrollment in private hospital insurance using the Household, Income and Labour Dynamics in Australia (HILDA) Survey data.
&lt;/p&gt;</description></item></channel></rss>