<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#26412;&#25991;&#20351;&#29992;P-GMM&#30697;&#36873;&#25321;&#36807;&#31243;&#26469;&#20272;&#35745;&#21644;&#27979;&#35797;&#39044;&#27979;&#30340;&#21512;&#29702;&#24615;&#65292;&#32467;&#26524;&#34920;&#26126;&#35813;&#26041;&#27861;&#22312;&#22823;&#32500;&#24230;&#21644;&#23454;&#38469;&#25968;&#25454;&#20998;&#26512;&#20013;&#37117;&#21462;&#24471;&#20102;&#33391;&#22909;&#30340;&#25928;&#26524;&#12290;</title><link>http://arxiv.org/abs/2309.09481</link><description>&lt;p&gt;
Estimation and Testing of Forecast Rationality with Many Moments. (arXiv:2309.09481v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
Estimation and Testing of Forecast Rationality with Many Moments. (arXiv:2309.09481v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.09481
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20351;&#29992;P-GMM&#30697;&#36873;&#25321;&#36807;&#31243;&#26469;&#20272;&#35745;&#21644;&#27979;&#35797;&#39044;&#27979;&#30340;&#21512;&#29702;&#24615;&#65292;&#32467;&#26524;&#34920;&#26126;&#35813;&#26041;&#27861;&#22312;&#22823;&#32500;&#24230;&#21644;&#23454;&#38469;&#25968;&#25454;&#20998;&#26512;&#20013;&#37117;&#21462;&#24471;&#20102;&#33391;&#22909;&#30340;&#25928;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#21033;&#29992;P-GMM&#65288;Cheng&#21644;Liao&#65292;2015&#65289;&#30340;&#30697;&#36873;&#25321;&#36807;&#31243;&#65292;&#22312;&#30001;Elliott&#31561;&#20154;&#25552;&#20986;&#30340;&#28789;&#27963;&#25439;&#22833;&#19979;&#36873;&#25321;&#26377;&#25928;&#21644;&#30456;&#20851;&#30340;&#30697;&#26469;&#20272;&#35745;&#21644;&#27979;&#35797;&#39044;&#27979;&#30340;&#21512;&#29702;&#24615;&#12290;&#25105;&#20204;&#22312;&#22823;&#32500;&#24230;&#30340;&#26694;&#26550;&#20013;&#38416;&#36848;&#20102;&#30697;&#36873;&#25321;&#30340;&#21160;&#26426;&#65292;&#35299;&#37322;&#20102;P-GMM&#30697;&#36873;&#25321;&#36807;&#31243;&#30340;&#22522;&#26412;&#26426;&#21046;&#65292;&#24182;&#35828;&#26126;&#20102;&#22914;&#20309;&#22312;&#20801;&#35768;&#23384;&#22312;&#21487;&#33021;&#26080;&#25928;&#30697;&#26465;&#20214;&#30340;&#39044;&#27979;&#21512;&#29702;&#24615;&#32972;&#26223;&#19979;&#23454;&#26045;&#23427;&#12290;&#25105;&#20204;&#36827;&#34892;&#20102;&#19968;&#31995;&#21015;&#33945;&#29305;&#21345;&#32599;&#27169;&#25311;&#26469;&#26816;&#39564;P-GMM&#20272;&#35745;&#22312;&#23558;&#20202;&#22120;&#20013;&#21487;&#29992;&#30340;&#20449;&#24687;&#25972;&#21512;&#21040;&#20272;&#35745;&#21644;&#27979;&#35797;&#20013;&#30340;&#26377;&#38480;&#26679;&#26412;&#24615;&#33021;&#65292;&#24182;&#20351;&#29992;&#30001;&#36153;&#22478;&#32852;&#37030;&#20648;&#22791;&#38134;&#34892;&#21457;&#24067;&#30340;&#19987;&#19994;&#39044;&#27979;&#32773;&#35843;&#26597;&#25968;&#25454;&#36827;&#34892;&#23454;&#38469;&#25968;&#25454;&#20998;&#26512;&#65292;&#36827;&#19968;&#27493;&#35828;&#26126;&#20102;&#25152;&#25552;&#20986;&#26041;&#27861;&#30340;&#23454;&#38469;&#20215;&#20540;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;&#39044;&#27979;&#32773;&#24577;&#24230;&#30340;P-GMM&#21518;&#36873;&#25321;&#20272;&#35745;&#22120;&#30340;&#25928;&#26524;&#24456;&#22909;&#12290;
&lt;/p&gt;
&lt;p&gt;
We in this paper utilize P-GMM (Cheng and Liao, 2015) moment selection procedure to select valid and relevant moments for estimating and testing forecast rationality under the flexible loss proposed by Elliott et al. (2005). We motivate the moment selection in a large dimensional setting, explain the fundamental mechanism of P-GMM moment selection procedure, and elucidate how to implement it in the context of forecast rationality by allowing the existence of potentially invalid moment conditions. A set of Monte Carlo simulations is conducted to examine the finite sample performance of P-GMM estimation in integrating the information available in instruments into both the estimation and testing, and a real data analysis using data from the Survey of Professional Forecasters issued by the Federal Reserve Bank of Philadelphia is presented to further illustrate the practical value of the suggested methodology. The results indicate that the P-GMM post-selection estimator of forecaster's atti
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22312;&#31163;&#25955;&#36873;&#25321;&#38754;&#26495;&#25968;&#25454;&#27169;&#22411;&#20013;&#23545;&#24179;&#22343;&#25928;&#24212;&#36827;&#34892;&#22806;&#30028;&#38480;&#20272;&#35745;&#30340;&#26041;&#27861;&#65292;&#26080;&#35770;&#21327;&#21464;&#37327;&#26159;&#31163;&#25955;&#36824;&#26159;&#36830;&#32493;&#65292;&#37117;&#21487;&#20197;&#22312;&#30456;&#23545;&#36739;&#22823;&#30340;&#26679;&#26412;&#20013;&#36731;&#26494;&#33719;&#24471;&#65292;&#24182;&#25552;&#20379;&#20102;&#23545;&#35782;&#21035;&#38598;&#30340;&#28176;&#36817;&#26377;&#25928;&#32622;&#20449;&#21306;&#38388;&#12290;</title><link>http://arxiv.org/abs/2309.09299</link><description>&lt;p&gt;
&#31163;&#25955;&#36873;&#25321;&#38754;&#26495;&#25968;&#25454;&#27169;&#22411;&#20013;&#24179;&#22343;&#25928;&#24212;&#30340;&#30028;&#38480;
&lt;/p&gt;
&lt;p&gt;
Bounds on Average Effects in Discrete Choice Panel Data Models. (arXiv:2309.09299v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.09299
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22312;&#31163;&#25955;&#36873;&#25321;&#38754;&#26495;&#25968;&#25454;&#27169;&#22411;&#20013;&#23545;&#24179;&#22343;&#25928;&#24212;&#36827;&#34892;&#22806;&#30028;&#38480;&#20272;&#35745;&#30340;&#26041;&#27861;&#65292;&#26080;&#35770;&#21327;&#21464;&#37327;&#26159;&#31163;&#25955;&#36824;&#26159;&#36830;&#32493;&#65292;&#37117;&#21487;&#20197;&#22312;&#30456;&#23545;&#36739;&#22823;&#30340;&#26679;&#26412;&#20013;&#36731;&#26494;&#33719;&#24471;&#65292;&#24182;&#25552;&#20379;&#20102;&#23545;&#35782;&#21035;&#38598;&#30340;&#28176;&#36817;&#26377;&#25928;&#32622;&#20449;&#21306;&#38388;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#20855;&#26377;&#20010;&#20307;&#29305;&#23450;&#22266;&#23450;&#25928;&#24212;&#30340;&#31163;&#25955;&#36873;&#25321;&#38754;&#26495;&#25968;&#25454;&#27169;&#22411;&#20013;&#65292;&#24179;&#22343;&#25928;&#24212;&#36890;&#24120;&#21482;&#22312;&#30701;&#26399;&#38754;&#26495;&#20013;&#37096;&#20998;&#35782;&#21035;&#12290;&#23613;&#31649;&#21487;&#20197;&#23545;&#35782;&#21035;&#38598;&#36827;&#34892;&#19968;&#33268;&#20272;&#35745;&#65292;&#20294;&#36890;&#24120;&#38656;&#35201;&#38750;&#24120;&#22823;&#30340;&#26679;&#26412;&#37327;&#65292;&#29305;&#21035;&#26159;&#24403;&#35266;&#27979;&#21327;&#21464;&#37327;&#30340;&#25903;&#25345;&#28857;&#25968;&#37327;&#24456;&#22823;&#26102;&#65292;&#20363;&#22914;&#21327;&#21464;&#37327;&#26159;&#36830;&#32493;&#30340;&#24773;&#20917;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#23545;&#24179;&#22343;&#25928;&#24212;&#30340;&#35782;&#21035;&#38598;&#36827;&#34892;&#22806;&#30028;&#38480;&#20272;&#35745;&#30340;&#26041;&#27861;&#12290;&#25105;&#20204;&#30340;&#30028;&#38480;&#26131;&#20110;&#26500;&#24314;&#65292;&#25910;&#25947;&#36895;&#24230;&#20026;&#21442;&#25968;&#36895;&#24230;&#65292;&#24182;&#19988;&#22312;&#26679;&#26412;&#30456;&#23545;&#36739;&#22823;&#30340;&#24773;&#20917;&#19979;&#65292;&#26080;&#35770;&#21327;&#21464;&#37327;&#26159;&#31163;&#25955;&#36824;&#26159;&#36830;&#32493;&#65292;&#37117;&#24456;&#23481;&#26131;&#33719;&#21462;&#12290;&#25105;&#20204;&#36824;&#25552;&#20379;&#20102;&#23545;&#35782;&#21035;&#38598;&#30340;&#28176;&#36817;&#26377;&#25928;&#32622;&#20449;&#21306;&#38388;&#12290;&#27169;&#25311;&#30740;&#31350;&#35777;&#23454;&#25105;&#20204;&#30340;&#26041;&#27861;&#22312;&#26377;&#38480;&#26679;&#26412;&#20013;&#34920;&#29616;&#33391;&#22909;&#19988;&#20855;&#26377;&#20449;&#24687;&#20215;&#20540;&#12290;&#25105;&#20204;&#36824;&#32771;&#34385;&#20102;&#21171;&#21160;&#21147;&#21442;&#19982;&#30340;&#24212;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;
Average effects in discrete choice panel data models with individual-specific fixed effects are generally only partially identified in short panels. While consistent estimation of the identified set is possible, it generally requires very large sample sizes, especially when the number of support points of the observed covariates is large, such as when the covariates are continuous. In this paper, we propose estimating outer bounds on the identified set of average effects. Our bounds are easy to construct, converge at the parametric rate, and are computationally simple to obtain even in moderately large samples, independent of whether the covariates are discrete or continuous. We also provide asymptotically valid confidence intervals on the identified set. Simulation studies confirm that our approach works well and is informative in finite samples. We also consider an application to labor force participation.
&lt;/p&gt;</description></item><item><title>&#31185;&#23398;&#24515;&#29702;&#23398;&#20316;&#20026;&#31185;&#23398;&#25919;&#31574;&#30340;&#19968;&#37096;&#20998;&#65292;&#23545;&#36164;&#28304;&#20998;&#37197;&#38382;&#39064;&#25552;&#20379;&#20102;&#26032;&#30340;&#24515;&#29702;&#23398;&#27010;&#24565;&#65292;&#21516;&#26102;&#20513;&#23548;&#31185;&#23398;&#25919;&#31574;&#20013;&#23545;&#31185;&#23398;&#30340;&#26356;&#21152;&#29616;&#23454;&#30340;&#35748;&#35782;&#12290;</title><link>http://arxiv.org/abs/2309.09202</link><description>&lt;p&gt;
&#32771;&#23519;&#31185;&#23398;&#24515;&#29702;&#23398;&#20316;&#20026;&#31185;&#23398;&#25919;&#31574;&#30340;&#28508;&#22312;&#36129;&#29486;&#32773;
&lt;/p&gt;
&lt;p&gt;
Examining psychology of science as a potential contributor to science policy. (arXiv:2309.09202v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.09202
&lt;/p&gt;
&lt;p&gt;
&#31185;&#23398;&#24515;&#29702;&#23398;&#20316;&#20026;&#31185;&#23398;&#25919;&#31574;&#30340;&#19968;&#37096;&#20998;&#65292;&#23545;&#36164;&#28304;&#20998;&#37197;&#38382;&#39064;&#25552;&#20379;&#20102;&#26032;&#30340;&#24515;&#29702;&#23398;&#27010;&#24565;&#65292;&#21516;&#26102;&#20513;&#23548;&#31185;&#23398;&#25919;&#31574;&#20013;&#23545;&#31185;&#23398;&#30340;&#26356;&#21152;&#29616;&#23454;&#30340;&#35748;&#35782;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#31185;&#23398;&#24515;&#29702;&#23398;&#26159;&#31185;&#23398;&#30740;&#31350;&#23478;&#26063;&#20013;&#26368;&#19981;&#21457;&#36798;&#30340;&#25104;&#21592;&#12290;&#28982;&#32780;&#65292;&#23427;&#27491;&#22312;&#19981;&#26029;&#21457;&#23637;&#25104;&#20026;&#19968;&#20010;&#26377;&#21069;&#26223;&#30340;&#23398;&#31185;&#12290;&#22312;&#23545;&#36825;&#20010;&#26032;&#20852;&#30340;&#24515;&#29702;&#23398;&#23376;&#39046;&#22495;&#36827;&#34892;&#31616;&#35201;&#22238;&#39038;&#21518;&#65292;&#25105;&#20204;&#21628;&#21505;&#23558;&#20854;&#32435;&#20837;&#26500;&#25104;&#31185;&#23398;&#25919;&#31574;&#36328;&#23398;&#31185;&#39046;&#22495;&#30340;&#31038;&#20250;&#31185;&#23398;&#38598;&#21512;&#20043;&#20013;&#12290;&#26412;&#25991;&#35752;&#35770;&#36164;&#28304;&#20998;&#37197;&#30340;&#32463;&#20856;&#38382;&#39064;&#65292;&#35797;&#22270;&#25351;&#20986;&#19968;&#31181;&#23545;&#36825;&#20010;&#38382;&#39064;&#30340;&#26032;&#24515;&#29702;&#23398;&#27010;&#24565;&#20250;&#26377;&#22810;&#20040;&#22810;&#20135;&#12290;&#27492;&#22806;&#65292;&#20174;&#24515;&#29702;&#23398;&#30340;&#35282;&#24230;&#20986;&#21457;&#65292;&#26412;&#30740;&#31350;&#23558;&#35770;&#36848;&#20026;&#31185;&#23398;&#25919;&#31574;&#20013;&#29616;&#26377;&#35266;&#24565;&#25552;&#20379;&#19968;&#20010;&#26356;&#21152;&#29616;&#23454;&#30340;&#34917;&#20805;&#12290;
&lt;/p&gt;
&lt;p&gt;
The psychology of science is the least developed member of the family of science studies. It is growing, however, increasingly into a promising discipline. After a very brief review of this emerging sub-field of psychology, we call for it to be invited into the collection of social sciences that constitute the interdisciplinary field of science policy. Discussing the classic issue of resource allocation, this paper tries to indicate how prolific a new psychological conceptualization of this problem would be. Further, from a psychological perspective, this research will argue in favor of a more realistic conception of science which would be a complement to the existing one in science policy.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#36890;&#36807;&#23545;&#21360;&#24230;&#20892;&#26449;&#36827;&#34892;&#35843;&#30740;&#21457;&#29616;&#65292;&#30005;&#21147;&#21487;&#38752;&#24615;&#30340;&#25552;&#39640;&#23545;&#20020;&#26102;&#20892;&#19994;&#21171;&#21160;&#21147;&#24037;&#36164;&#30340;&#22686;&#38271;&#20135;&#29983;&#20102;&#36127;&#38754;&#24433;&#21709;&#65292;&#23588;&#20854;&#26159;&#23545;&#30007;&#24615;&#24037;&#36164;&#30340;&#24433;&#21709;&#26356;&#22823;&#65292;&#23548;&#33268;&#20102;&#24615;&#21035;&#24037;&#36164;&#24046;&#36317;&#30340;&#32553;&#23567;&#12290;&#28982;&#32780;&#65292;&#26356;&#22909;&#30340;&#30005;&#21147;&#21487;&#38752;&#24615;&#20943;&#23569;&#20102;&#22919;&#22899;&#20174;&#20107;&#29123;&#26009;&#25910;&#38598;&#30340;&#26102;&#38388;&#65292;&#20174;&#32780;&#22686;&#21152;&#20102;&#21171;&#21160;&#21147;&#20379;&#24212;&#12290;&#24403;&#28982;&#65292;&#21171;&#21160;&#21147;&#38656;&#27714;&#27809;&#26377;&#21463;&#21040;&#24433;&#21709;&#65292;&#21487;&#33021;&#23548;&#33268;&#21171;&#21160;&#21147;&#20379;&#24212;&#36807;&#21097;&#65292;&#24037;&#36164;&#20572;&#28382;&#12290;&#22240;&#27492;&#65292;&#25919;&#24220;&#21487;&#20197;&#36890;&#36807;&#25552;&#39640;&#30005;&#21160;&#27893;&#30340;&#37319;&#29992;&#29575;&#21644;&#25913;&#21892;&#30005;&#21147;&#36136;&#37327;&#26469;&#21560;&#32435;&#20892;&#19994;&#39046;&#22495;&#30340;&#23500;&#20313;&#21171;&#21160;&#21147;&#12290;</title><link>http://arxiv.org/abs/2309.09178</link><description>&lt;p&gt;
&#21487;&#38752;&#30005;&#21147;&#26159;&#21542;&#24847;&#21619;&#30528;&#20892;&#19994;&#21171;&#21160;&#21147;&#24037;&#36164;&#30340;&#38477;&#20302;&#65311;&#26469;&#33258;&#21360;&#24230;&#20892;&#26449;&#30340;&#35777;&#25454;
&lt;/p&gt;
&lt;p&gt;
Does Reliable Electricity Mean Lesser Agricultural Labor Wages? Evidence from Indian Villages. (arXiv:2309.09178v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.09178
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#36890;&#36807;&#23545;&#21360;&#24230;&#20892;&#26449;&#36827;&#34892;&#35843;&#30740;&#21457;&#29616;&#65292;&#30005;&#21147;&#21487;&#38752;&#24615;&#30340;&#25552;&#39640;&#23545;&#20020;&#26102;&#20892;&#19994;&#21171;&#21160;&#21147;&#24037;&#36164;&#30340;&#22686;&#38271;&#20135;&#29983;&#20102;&#36127;&#38754;&#24433;&#21709;&#65292;&#23588;&#20854;&#26159;&#23545;&#30007;&#24615;&#24037;&#36164;&#30340;&#24433;&#21709;&#26356;&#22823;&#65292;&#23548;&#33268;&#20102;&#24615;&#21035;&#24037;&#36164;&#24046;&#36317;&#30340;&#32553;&#23567;&#12290;&#28982;&#32780;&#65292;&#26356;&#22909;&#30340;&#30005;&#21147;&#21487;&#38752;&#24615;&#20943;&#23569;&#20102;&#22919;&#22899;&#20174;&#20107;&#29123;&#26009;&#25910;&#38598;&#30340;&#26102;&#38388;&#65292;&#20174;&#32780;&#22686;&#21152;&#20102;&#21171;&#21160;&#21147;&#20379;&#24212;&#12290;&#24403;&#28982;&#65292;&#21171;&#21160;&#21147;&#38656;&#27714;&#27809;&#26377;&#21463;&#21040;&#24433;&#21709;&#65292;&#21487;&#33021;&#23548;&#33268;&#21171;&#21160;&#21147;&#20379;&#24212;&#36807;&#21097;&#65292;&#24037;&#36164;&#20572;&#28382;&#12290;&#22240;&#27492;&#65292;&#25919;&#24220;&#21487;&#20197;&#36890;&#36807;&#25552;&#39640;&#30005;&#21160;&#27893;&#30340;&#37319;&#29992;&#29575;&#21644;&#25913;&#21892;&#30005;&#21147;&#36136;&#37327;&#26469;&#21560;&#32435;&#20892;&#19994;&#39046;&#22495;&#30340;&#23500;&#20313;&#21171;&#21160;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20351;&#29992;&#21360;&#24230;&#20154;&#31867;&#21457;&#23637;&#35843;&#26597;&#20013;&#30340;1,171&#20010;&#20892;&#26449;&#30340;&#38754;&#26495;&#25968;&#25454;&#36827;&#34892;&#21306;&#21035;&#20110;&#24046;&#24322;&#20998;&#26512;&#65292;&#21457;&#29616;&#30005;&#21147;&#21487;&#38752;&#24615;&#30340;&#25552;&#39640;&#23545;&#20020;&#26102;&#20892;&#19994;&#21171;&#21160;&#21147;&#24037;&#36164;&#30340;&#22686;&#38271;&#20135;&#29983;&#20102;&#36127;&#38754;&#24433;&#21709;&#12290;&#30007;&#24615;&#24037;&#36164;&#30340;&#21464;&#21270;&#21463;&#21040;&#30340;&#24433;&#21709;&#26356;&#20026;&#19981;&#21033;&#65292;&#23548;&#33268;&#20102;&#24615;&#21035;&#24037;&#36164;&#24046;&#36317;&#30340;&#32553;&#23567;&#12290;&#25105;&#21457;&#29616;&#65292;&#26356;&#22909;&#30340;&#30005;&#21147;&#21487;&#38752;&#24615;&#22823;&#22823;&#20943;&#23569;&#20102;&#22919;&#22899;&#22312;&#29123;&#26009;&#25910;&#38598;&#19978;&#30340;&#26102;&#38388;&#65292;&#36825;&#21487;&#33021;&#22686;&#21152;&#21171;&#21160;&#21147;&#20379;&#24212;&#12290;&#21171;&#21160;&#21147;&#38656;&#27714;&#19981;&#21463;&#30005;&#21147;&#21487;&#38752;&#24615;&#30340;&#24433;&#21709;&#65292;&#36825;&#21487;&#33021;&#23548;&#33268;&#21171;&#21160;&#21147;&#20379;&#24212;&#36807;&#21097;&#65292;&#20174;&#32780;&#23548;&#33268;&#24037;&#36164;&#20572;&#28382;&#12290;&#28982;&#32780;&#65292;&#25105;&#26174;&#31034;&#65292;&#22320;&#19979;&#27700;&#27893;&#31561;&#30005;&#22120;&#35774;&#22791;&#26174;&#33879;&#25552;&#39640;&#20102;&#21171;&#21160;&#21147;&#38656;&#27714;&#65292;&#34920;&#26126;&#25919;&#24220;&#21487;&#20197;&#36890;&#36807;&#25552;&#39640;&#30005;&#21160;&#27893;&#30340;&#37319;&#29992;&#29575;&#21644;&#25913;&#21892;&#30005;&#21147;&#36136;&#37327;&#26469;&#21560;&#32435;&#20892;&#19994;&#39046;&#22495;&#30340;&#23500;&#20313;&#21171;&#21160;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;
Using a panel of 1,171 villages in rural India that were surveyed in the India Human Development Surveys, I perform a difference-in-differences analysis to find that improvements in electricity reliability have a negative effect on the increase in casual agricultural labor wage rates. Changes in men's wage rates are found to be affected more adversely than women's, resulting in a smaller widening of the gender wage gap. I find that better electricity reliability reduces the time spent by women in fuel collection substantially which could potentially increase labor supply. The demand for labor remains unaffected by reliability, which could lead the surplus in labor supply to cause wage rates to stunt. However, I show that electrical appliances such as groundwater pumps considerably increase labor demand indicating that governments could target increasing the adoption of electric pumps along with bettering the quality of electricity to absorb the surplus labor into agriculture.
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#19968;&#20010;&#26631;&#20934;&#30340;&#20132;&#25442;&#32463;&#27982;&#27169;&#22411;&#65292;&#32473;&#20986;&#20102;&#22312;Walras-Samuelson&#20215;&#26684;&#35843;&#25972;&#36807;&#31243;&#20013;&#23384;&#22312;&#28151;&#27788;&#20215;&#26684;&#21160;&#24577;&#30340;&#24517;&#35201;&#21644;&#20805;&#20998;&#26465;&#20214;&#65292;&#24182;&#24212;&#29992;&#20102;&#26368;&#36817;&#30340;&#30740;&#31350;&#32467;&#26524;&#36827;&#34892;&#20102;&#25299;&#25169;&#28151;&#27788;&#23384;&#22312;&#24615;&#30340;&#20998;&#26512;&#12290;</title><link>http://arxiv.org/abs/2309.09176</link><description>&lt;p&gt;
&#19968;&#20010;&#20132;&#25442;&#32463;&#27982;&#20013;&#28151;&#27788;&#20215;&#26684;&#21160;&#24577;&#23384;&#22312;&#30340;&#24517;&#35201;&#21644;&#20805;&#20998;&#26465;&#20214;
&lt;/p&gt;
&lt;p&gt;
A necessary and sufficient condition for the existence of chaotic price dynamics in an exchange economy. (arXiv:2309.09176v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.09176
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#19968;&#20010;&#26631;&#20934;&#30340;&#20132;&#25442;&#32463;&#27982;&#27169;&#22411;&#65292;&#32473;&#20986;&#20102;&#22312;Walras-Samuelson&#20215;&#26684;&#35843;&#25972;&#36807;&#31243;&#20013;&#23384;&#22312;&#28151;&#27788;&#20215;&#26684;&#21160;&#24577;&#30340;&#24517;&#35201;&#21644;&#20805;&#20998;&#26465;&#20214;&#65292;&#24182;&#24212;&#29992;&#20102;&#26368;&#36817;&#30340;&#30740;&#31350;&#32467;&#26524;&#36827;&#34892;&#20102;&#25299;&#25169;&#28151;&#27788;&#23384;&#22312;&#24615;&#30340;&#20998;&#26512;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#36825;&#20010;&#30740;&#31350;&#20013;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#19968;&#20010;&#26631;&#20934;&#30340;&#20132;&#25442;&#32463;&#27982;&#27169;&#22411;&#65292;&#20854;&#20013;&#21253;&#25324;Cobb-Douglas&#31867;&#22411;&#30340;&#28040;&#36153;&#32773;&#65292;&#24182;&#32473;&#20986;&#20102;Walras-Samuelson&#65288;tatonnement&#65289;&#20215;&#26684;&#35843;&#25972;&#36807;&#31243;&#20013;&#23384;&#22312;&#25299;&#25169;&#28151;&#27788;&#30340;&#24517;&#35201;&#21644;&#20805;&#20998;&#26465;&#20214;&#12290;&#36825;&#26159;&#23545;Deng&#12289;Khan&#12289;Mitra&#65288;2022&#65289;&#26368;&#36817;&#30340;&#30740;&#31350;&#32467;&#26524;&#22312;&#19968;&#20010;&#21333;&#23792;&#21306;&#38388;&#26144;&#23556;&#30340;&#25299;&#25169;&#28151;&#27788;&#23384;&#22312;&#24615;&#36827;&#34892;&#30340;&#26032;&#24212;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this note, we study a standard exchange economy model with Cobb-Douglas type consumers and give a necessary and sufficient condition for the existence of a topological chaos in the Walras-Samuelson (tatonnement) price adjustment process. This is a new application of a recent result characterising the existence of a topological chaos for a unimodal interval map by Deng, Khan, Mitra (2022).
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#21322;&#21442;&#25968;&#23494;&#24230;&#27604;&#27169;&#22411;&#22312;&#22788;&#29702;&#20855;&#26377;&#20849;&#21516;&#28508;&#22312;&#32467;&#26500;&#30340;&#25968;&#25454;&#26102;&#30340;&#25928;&#29575;&#25913;&#21892;&#26497;&#38480;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#22312;&#19968;&#20010;&#20154;&#32676;&#30340;&#26679;&#26412;&#37327;&#26174;&#33879;&#36229;&#36807;&#20854;&#20182;&#20154;&#32676;&#30340;&#24773;&#20917;&#19979;&#65292;&#22522;&#20110;&#21322;&#21442;&#25968;&#23494;&#24230;&#27604;&#27169;&#22411;&#30340;&#25512;&#26029;&#33021;&#36798;&#21040;&#26368;&#39640;&#30340;&#32479;&#35745;&#25928;&#29575;&#12290;</title><link>http://arxiv.org/abs/2309.09103</link><description>&lt;p&gt;
&#21322;&#21442;&#25968;&#23494;&#24230;&#27604;&#27169;&#22411;&#19979;&#30340;&#26368;&#20248;&#20272;&#35745;
&lt;/p&gt;
&lt;p&gt;
Optimal Estimation under a Semiparametric Density Ratio Model. (arXiv:2309.09103v1 [stat.ME])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.09103
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#21322;&#21442;&#25968;&#23494;&#24230;&#27604;&#27169;&#22411;&#22312;&#22788;&#29702;&#20855;&#26377;&#20849;&#21516;&#28508;&#22312;&#32467;&#26500;&#30340;&#25968;&#25454;&#26102;&#30340;&#25928;&#29575;&#25913;&#21892;&#26497;&#38480;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#22312;&#19968;&#20010;&#20154;&#32676;&#30340;&#26679;&#26412;&#37327;&#26174;&#33879;&#36229;&#36807;&#20854;&#20182;&#20154;&#32676;&#30340;&#24773;&#20917;&#19979;&#65292;&#22522;&#20110;&#21322;&#21442;&#25968;&#23494;&#24230;&#27604;&#27169;&#22411;&#30340;&#25512;&#26029;&#33021;&#36798;&#21040;&#26368;&#39640;&#30340;&#32479;&#35745;&#25928;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#35768;&#22810;&#32479;&#35745;&#21644;&#35745;&#37327;&#24212;&#29992;&#20013;&#65292;&#25105;&#20204;&#20174;&#21508;&#31181;&#30456;&#20114;&#20851;&#32852;&#30340;&#20154;&#32676;&#20013;&#33719;&#24471;&#29420;&#31435;&#26679;&#26412;&#65292;&#36825;&#20123;&#20154;&#32676;&#26080;&#30097;&#23637;&#29616;&#20986;&#20849;&#21516;&#30340;&#28508;&#22312;&#32467;&#26500;&#12290;&#21033;&#29992;&#21253;&#21547;&#36825;&#20123;&#28508;&#22312;&#32467;&#26500;&#30340;&#27169;&#22411;&#26469;&#22788;&#29702;&#36825;&#26679;&#30340;&#25968;&#25454;&#33021;&#22686;&#24378;&#25512;&#26029;&#30340;&#25928;&#29575;&#12290;&#26368;&#36817;&#65292;&#35768;&#22810;&#30740;&#31350;&#20154;&#21592;&#37319;&#29992;&#20102;&#21322;&#21442;&#25968;&#23494;&#24230;&#27604;&#27169;&#22411; (DRM) &#26469;&#22788;&#29702;&#28508;&#22312;&#32467;&#26500;&#30340;&#23384;&#22312;&#12290;DRM &#21487;&#20197;&#21033;&#29992;&#21512;&#24182;&#30340;&#25968;&#25454;&#20272;&#35745;&#27599;&#20010;&#20154;&#32676;&#30340;&#20998;&#24067;&#65292;&#19982;&#38750;&#21442;&#25968;&#26041;&#27861;&#20998;&#26512;&#27599;&#20010;&#26679;&#26412;&#29420;&#31435;&#30340;&#26041;&#27861;&#30456;&#27604;&#65292;&#36825;&#31181;&#26041;&#27861;&#33021;&#36798;&#21040;&#26356;&#39640;&#30340;&#32479;&#35745;&#25928;&#29575;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#36890;&#36807; DRM &#21487;&#20197;&#36798;&#21040;&#30340;&#25928;&#29575;&#25913;&#21892;&#30340;&#26497;&#38480;&#12290;&#25105;&#20204;&#37325;&#28857;&#20851;&#27880;&#19968;&#20010;&#20154;&#32676;&#30340;&#26679;&#26412;&#37327;&#26174;&#33879;&#36229;&#36807;&#20854;&#20182;&#20154;&#32676;&#30340;&#24773;&#20917;&#12290;&#22312;&#36825;&#31181;&#24773;&#20917;&#19979;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#22522;&#20110; DRM &#30340;&#23545;&#20110;&#26679;&#26412;&#37327;&#36739;&#23567;&#30340;&#20154;&#32676;&#30340;&#25512;&#26029;&#21487;&#20197;&#36798;&#21040;&#26368;&#39640;&#30340;&#28176;&#36817;&#25928;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;
In many statistical and econometric applications, we gather individual samples from various interconnected populations that undeniably exhibit common latent structures. Utilizing a model that incorporates these latent structures for such data enhances the efficiency of inferences. Recently, many researchers have been adopting the semiparametric density ratio model (DRM) to address the presence of latent structures. The DRM enables estimation of each population distribution using pooled data, resulting in statistically more efficient estimations in contrast to nonparametric methods that analyze each sample in isolation. In this article, we investigate the limit of the efficiency improvement attainable through the DRM. We focus on situations where one population's sample size significantly exceeds those of the other populations. In such scenarios, we demonstrate that the DRM-based inferences for populations with smaller sample sizes achieve the highest attainable asymptotic efficiency as
&lt;/p&gt;</description></item><item><title>&#36825;&#31687;&#35770;&#25991;&#30740;&#31350;&#20102;&#38750;&#32447;&#24615;&#38431;&#21015;&#38754;&#26495;&#20013;&#30340;&#26368;&#23567;&#20108;&#20056;&#20272;&#35745;&#19982;&#32463;&#39564;&#23398;&#20064;&#65292;&#25506;&#35752;&#20102;&#20272;&#35745;&#21644;&#25512;&#26029;&#30340;&#25216;&#26415;&#65292;&#24182;&#39564;&#35777;&#20102;Malmendier&#21644;Nagel&#22312;2016&#24180;&#30340;&#32463;&#20856;&#35770;&#25991;&#20013;&#20351;&#29992;&#30340;&#20272;&#35745;&#22120;&#30340;&#24615;&#36136;&#21644;&#23454;&#29992;&#24615;&#12290;</title><link>http://arxiv.org/abs/2309.08982</link><description>&lt;p&gt;
&#38750;&#32447;&#24615;&#38431;&#21015;&#38754;&#26495;&#20013;&#30340;&#26368;&#23567;&#20108;&#20056;&#20272;&#35745;&#19982;&#32463;&#39564;&#23398;&#20064;
&lt;/p&gt;
&lt;p&gt;
Least squares estimation in nonlinear cohort panels with learning from experience. (arXiv:2309.08982v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.08982
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#30740;&#31350;&#20102;&#38750;&#32447;&#24615;&#38431;&#21015;&#38754;&#26495;&#20013;&#30340;&#26368;&#23567;&#20108;&#20056;&#20272;&#35745;&#19982;&#32463;&#39564;&#23398;&#20064;&#65292;&#25506;&#35752;&#20102;&#20272;&#35745;&#21644;&#25512;&#26029;&#30340;&#25216;&#26415;&#65292;&#24182;&#39564;&#35777;&#20102;Malmendier&#21644;Nagel&#22312;2016&#24180;&#30340;&#32463;&#20856;&#35770;&#25991;&#20013;&#20351;&#29992;&#30340;&#20272;&#35745;&#22120;&#30340;&#24615;&#36136;&#21644;&#23454;&#29992;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#35752;&#35770;&#20102;&#22312;&#38750;&#32447;&#24615;&#38431;&#21015;&#38754;&#26495;&#20013;&#36827;&#34892;&#20272;&#35745;&#21644;&#25512;&#26029;&#30340;&#25216;&#26415;&#65292;&#20854;&#20013;&#28041;&#21450;&#21040;&#20102;Malmendier&#21644;Nagel&#22312;2016&#24180;&#30340;&#32463;&#20856;&#35770;&#25991;&#20013;&#20351;&#29992;&#30340;&#38750;&#32447;&#24615;&#26368;&#23567;&#20108;&#20056;&#20272;&#35745;&#22120;&#30340;&#19968;&#33268;&#24615;&#21644;&#28176;&#36817;&#27491;&#24577;&#24615;&#12290;&#25105;&#20204;&#36824;&#37492;&#23450;&#20102;&#20551;&#35774;&#26816;&#39564;&#21487;&#33021;&#23384;&#22312;&#30340;&#28508;&#22312;&#38519;&#38449;&#65292;&#24182;&#25552;&#20986;&#20102;&#35299;&#20915;&#26041;&#26696;&#12290;&#33945;&#29305;&#21345;&#32599;&#27169;&#25311;&#39564;&#35777;&#20102;&#26377;&#38480;&#26679;&#26412;&#20013;&#20272;&#35745;&#22120;&#21644;&#30456;&#24212;&#30340;&#26816;&#39564;&#32479;&#35745;&#37327;&#30340;&#29305;&#24615;&#65292;&#32780;&#23545;&#19968;&#32452;&#35843;&#26597;&#39044;&#26399;&#30340;&#24212;&#29992;&#21017;&#35777;&#26126;&#20102;&#25152;&#24320;&#21457;&#29702;&#35770;&#30340;&#23454;&#29992;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
We discuss techniques of estimation and inference for nonlinear cohort panels with learning from experience, showing, inter alia, the consistency and asymptotic normality of the nonlinear least squares estimator employed in the seminal paper by Malmendier and Nagel (2016). Potential pitfalls for hypothesis testing are identified and solutions proposed. Monte Carlo simulations verify the properties of the estimator and corresponding test statistics in finite samples, while an application to a panel of survey expectations demonstrates the usefulness of the theory developed.
&lt;/p&gt;</description></item><item><title>&#24635;&#25928;&#24212;&#26816;&#39564;&#21487;&#33021;&#38169;&#35823;&#22320;&#25298;&#32477;&#21482;&#38388;&#25509;&#20013;&#20171;&#65288;&#20063;&#31216;&#8220;&#23436;&#20840;&#20013;&#20171;&#8221;&#65289;&#65292;&#36825;&#23545;&#20110;&#24314;&#31435;&#20013;&#20171;&#20851;&#31995;&#26469;&#35828;&#26159;&#22810;&#20313;&#30340;&#12290;</title><link>http://arxiv.org/abs/2309.08910</link><description>&lt;p&gt;
&#24635;&#25928;&#24212;&#26816;&#39564;&#21487;&#33021;&#38169;&#35823;&#22320;&#25298;&#32477;&#25152;&#35859;&#30340;&#8220;&#23436;&#20840;&#20013;&#20171;&#8221;&#25110;&#8220;&#23436;&#20840;&#20013;&#20171;&#8221;
&lt;/p&gt;
&lt;p&gt;
Total-effect Test May Erroneously Reject So-called "Full" or "Complete" Mediation. (arXiv:2309.08910v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.08910
&lt;/p&gt;
&lt;p&gt;
&#24635;&#25928;&#24212;&#26816;&#39564;&#21487;&#33021;&#38169;&#35823;&#22320;&#25298;&#32477;&#21482;&#38388;&#25509;&#20013;&#20171;&#65288;&#20063;&#31216;&#8220;&#23436;&#20840;&#20013;&#20171;&#8221;&#65289;&#65292;&#36825;&#23545;&#20110;&#24314;&#31435;&#20013;&#20171;&#20851;&#31995;&#26469;&#35828;&#26159;&#22810;&#20313;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24314;&#31435;&#20013;&#20171;&#20851;&#31995;&#30340;&#31243;&#24207;&#65292;&#21363;&#30830;&#23450;&#29420;&#31435;&#21464;&#37327;X&#36890;&#36807;&#26576;&#20010;&#20013;&#20171;M&#24433;&#21709;&#20381;&#36182;&#21464;&#37327;Y&#65292;&#19968;&#30452;&#23384;&#22312;&#20105;&#35758;&#12290;&#32463;&#20856;&#22240;&#26524;&#27493;&#39588;&#35201;&#27714;&#8220;&#24635;&#25928;&#24212;&#8221;&#26174;&#33879;&#65292;&#29616;&#22312;&#20063;&#34987;&#31216;&#20026;&#32479;&#35745;&#25215;&#35748;&#12290;&#24050;&#32463;&#35777;&#26126;&#65292;&#24635;&#25928;&#24212;&#26816;&#39564;&#21487;&#33021;&#38169;&#35823;&#22320;&#25298;&#32477;&#31454;&#20105;&#24615;&#20013;&#20171;&#65292;&#23545;&#20110;&#24314;&#31435;&#34917;&#20805;&#24615;&#20013;&#20171;&#26159;&#22810;&#20313;&#30340;&#12290;&#23545;&#20110;&#26368;&#21518;&#19968;&#31181;&#31867;&#22411;&#65292;&#21363;&#21482;&#38388;&#25509;&#20013;&#20171;&#65292;&#20063;&#34987;&#31216;&#20026;&#8220;&#23436;&#20840;&#20013;&#20171;&#8221;&#65292;&#22312;&#35813;&#31867;&#22411;&#20013;&#65292;&#38388;&#25509;&#36335;&#24452;&#65288;ab&#65289;&#36890;&#36807;&#32479;&#35745;&#20998;&#21306;&#26816;&#39564;&#65292;&#32780;&#30452;&#25509;&#21450;&#21097;&#20313;&#36335;&#24452;&#65288;d&#65289;&#26410;&#36890;&#36807;&#12290;&#35813;&#30740;&#31350;1) &#25552;&#20379;&#20102;&#35777;&#26126;&#65292;&#24635;&#25928;&#24212;&#26816;&#39564;&#21487;&#33021;&#38169;&#35823;&#22320;&#25298;&#32477;&#21482;&#38388;&#25509;&#20013;&#20171;&#65292;&#21253;&#25324;&#20004;&#20010;&#23376;&#31867;&#22411;&#65292;&#20551;&#35774;&#26368;&#23567;&#20108;&#20056;&#20272;&#35745;&#65288;LSE&#65289;F&#26816;&#39564;&#25110;Sobel&#26816;&#39564;&#65307;2) &#25552;&#20379;&#20102;&#19968;&#20010;&#27169;&#25311;&#26469;&#22797;&#21046;&#25968;&#23398;&#35777;&#26126;&#65292;&#24182;&#23558;&#32467;&#35770;&#25512;&#24191;&#21040;LAD-Z&#26816;&#39564;&#65307;3) &#25552;&#20379;&#20102;&#20004;&#20010;&#30495;&#23454;&#25968;&#25454;&#31034;&#20363;&#65292;&#20854;&#20013;&#19968;&#20010;&#26159; ...
&lt;/p&gt;
&lt;p&gt;
The procedure for establishing mediation, i.e., determining that an independent variable $X$ affects a dependent variable $Y$ through some mediator M, has been under debate. The classic causal steps require that a ``total effect'' be significant, now also known as statistically acknowledged. It has been shown that the total-effect test can erroneously reject competitive mediation and is superfluous for establishing complementary mediation. Little is known about the last type, indirect-only mediation, aka ``full" or ``complete" mediation, in which the indirect (ab) path passes the statistical partition test while the direct-and-remainder (d) path fails. This study 1) provides proof that the total-effect test can erroneously reject indirect-only mediation, including both sub-types, assuming least square estimation (LSE) F-test or Sobel test; 2) provides a simulation to duplicate the mathematical proofs and extend the conclusion to LAD-Z test; 3) provides two real-data examples, one for e
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#23545;&#25289;&#19969;&#32654;&#27954;&#20013;&#20302;&#25910;&#20837;&#22269;&#23478;&#36827;&#34892;&#20102;&#19968;&#39033;&#23454;&#35777;&#30740;&#31350;&#65292;&#21457;&#29616;&#27719;&#27454;&#19982;&#37329;&#34701;&#21457;&#23637;&#21576;&#27491;&#30456;&#20851;&#65292;&#22806;&#22269;&#30452;&#25509;&#25237;&#36164;&#21644;&#36890;&#36135;&#33192;&#32960;&#19982;&#37329;&#34701;&#21457;&#23637;&#21576;&#27491;&#30456;&#20851;&#65292;&#32780;&#36152;&#26131;&#24320;&#25918;&#19982;&#37329;&#34701;&#21457;&#23637;&#21576;&#36127;&#30456;&#20851;&#12290;&#22522;&#20110;&#30740;&#31350;&#32467;&#26524;&#65292;&#24314;&#35758;&#36825;&#20123;&#22269;&#23478;&#30340;&#20915;&#31574;&#32773;&#21046;&#23450;&#25919;&#31574;&#20197;&#22686;&#21152;&#31227;&#27665;&#24037;&#20154;&#36890;&#36807;&#27491;&#35268;&#28192;&#36947;&#21457;&#36865;&#36164;&#37329;&#30340;&#21160;&#21147;&#65292;&#20174;&#32780;&#22686;&#21152;&#27719;&#27454;&#23545;&#25509;&#25910;&#22269;&#23478;&#30340;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2309.08855</link><description>&lt;p&gt;
&#25289;&#19969;&#32654;&#27954;&#22269;&#23478;&#27719;&#27454;&#19982;&#37329;&#34701;&#21457;&#23637;&#30340;&#23454;&#35777;&#20998;&#26512;
&lt;/p&gt;
&lt;p&gt;
An Empirical Analysis on Remittances and Financial Development in Latin American Countries. (arXiv:2309.08855v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.08855
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#23545;&#25289;&#19969;&#32654;&#27954;&#20013;&#20302;&#25910;&#20837;&#22269;&#23478;&#36827;&#34892;&#20102;&#19968;&#39033;&#23454;&#35777;&#30740;&#31350;&#65292;&#21457;&#29616;&#27719;&#27454;&#19982;&#37329;&#34701;&#21457;&#23637;&#21576;&#27491;&#30456;&#20851;&#65292;&#22806;&#22269;&#30452;&#25509;&#25237;&#36164;&#21644;&#36890;&#36135;&#33192;&#32960;&#19982;&#37329;&#34701;&#21457;&#23637;&#21576;&#27491;&#30456;&#20851;&#65292;&#32780;&#36152;&#26131;&#24320;&#25918;&#19982;&#37329;&#34701;&#21457;&#23637;&#21576;&#36127;&#30456;&#20851;&#12290;&#22522;&#20110;&#30740;&#31350;&#32467;&#26524;&#65292;&#24314;&#35758;&#36825;&#20123;&#22269;&#23478;&#30340;&#20915;&#31574;&#32773;&#21046;&#23450;&#25919;&#31574;&#20197;&#22686;&#21152;&#31227;&#27665;&#24037;&#20154;&#36890;&#36807;&#27491;&#35268;&#28192;&#36947;&#21457;&#36865;&#36164;&#37329;&#30340;&#21160;&#21147;&#65292;&#20174;&#32780;&#22686;&#21152;&#27719;&#27454;&#23545;&#25509;&#25910;&#22269;&#23478;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#27719;&#27454;&#24050;&#25104;&#20026;&#19990;&#30028;&#21508;&#22269;&#29305;&#21035;&#26159;&#20013;&#20302;&#25910;&#20837;&#22269;&#23478;&#21457;&#23637;&#30340;&#25512;&#21160;&#21147;&#20043;&#19968;&#12290;&#26412;&#25991;&#23454;&#35777;&#30740;&#31350;&#20102;&#25289;&#19969;&#32654;&#27954;&#22235;&#20010;&#20013;&#20302;&#25910;&#20837;&#22269;&#23478;&#27719;&#27454;&#27969;&#21160;&#19982;&#37329;&#34701;&#21457;&#23637;&#20043;&#38388;&#30340;&#20851;&#31995;&#12290;&#36890;&#36807;&#20351;&#29992;1996&#24180;&#33267;2019&#24180;&#30340;&#38754;&#26495;&#25968;&#25454;&#38598;&#65292;&#30740;&#31350;&#21457;&#29616;&#36825;&#20123;&#22269;&#23478;&#30340;&#27719;&#27454;&#21644;&#37329;&#34701;&#21457;&#23637;&#21576;&#27491;&#30456;&#20851;&#12290;&#30740;&#31350;&#36824;&#21457;&#29616;&#22806;&#22269;&#30452;&#25509;&#25237;&#36164;&#21644;&#36890;&#36135;&#33192;&#32960;&#19982;&#37329;&#34701;&#21457;&#23637;&#21576;&#27491;&#30456;&#20851;&#65292;&#32780;&#36152;&#26131;&#24320;&#25918;&#19982;&#37329;&#34701;&#21457;&#23637;&#21576;&#36127;&#30456;&#20851;&#12290;&#22240;&#27492;&#65292;&#36825;&#20123;&#22269;&#23478;&#30340;&#20915;&#31574;&#32773;&#24212;&#21046;&#23450;&#30456;&#24212;&#25919;&#31574;&#65292;&#20351;&#31227;&#27665;&#24037;&#20154;&#26377;&#21160;&#21147;&#36890;&#36807;&#27491;&#35268;&#28192;&#36947;&#21457;&#36865;&#36164;&#37329;&#65292;&#20174;&#32780;&#22686;&#21152;&#27719;&#27454;&#23545;&#25509;&#25910;&#22269;&#23478;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
Remittances have become one of the driving forces of development for countries all over the world, especially in lower-middle-income nations. This paper empirically investigates the association between remittance flows and financial development in 4 lower-middle-income countries of Latin America. By using a panel data set from 1996 to 2019, the study revealed that remittances and financial development are positively associated in these countries. The study also discovered that foreign direct investment and inflation were positively correlated with financial development while trade openness had a negative association with financial development. Therefore, policymakers of these countries should implement and formulate such policies so that migrant workers would have the incentives to send money through formal channels, which will augment the effect of remittances on the recipient country.
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#33258;&#36866;&#24212;&#30340;Neyman&#20998;&#37197;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#33021;&#22815;&#26681;&#25454;&#19981;&#21516;&#38454;&#27573;&#30340;&#35266;&#27979;&#26469;&#20272;&#35745;&#26631;&#20934;&#24046;&#65292;&#20174;&#32780;&#25351;&#23548;&#21518;&#32493;&#38454;&#27573;&#30340;&#20998;&#32452;&#20915;&#31574;&#12290;</title><link>http://arxiv.org/abs/2309.08808</link><description>&lt;p&gt;
&#33258;&#36866;&#24212;&#30340;Neyman&#20998;&#37197;
&lt;/p&gt;
&lt;p&gt;
Adaptive Neyman Allocation. (arXiv:2309.08808v1 [stat.ME])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.08808
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#33258;&#36866;&#24212;&#30340;Neyman&#20998;&#37197;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#33021;&#22815;&#26681;&#25454;&#19981;&#21516;&#38454;&#27573;&#30340;&#35266;&#27979;&#26469;&#20272;&#35745;&#26631;&#20934;&#24046;&#65292;&#20174;&#32780;&#25351;&#23548;&#21518;&#32493;&#38454;&#27573;&#30340;&#20998;&#32452;&#20915;&#31574;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#23454;&#39564;&#35774;&#35745;&#20013;&#65292;Neyman&#20998;&#37197;&#26159;&#25351;&#23558;&#21463;&#35797;&#32773;&#20998;&#37197;&#21040;&#22788;&#29702;&#32452;&#21644;&#23545;&#29031;&#32452;&#30340;&#20570;&#27861;&#65292;&#21487;&#33021;&#25353;&#29031;&#23427;&#20204;&#21508;&#33258;&#30340;&#26631;&#20934;&#24046;&#25104;&#27604;&#20363;&#22320;&#20998;&#37197;&#65292;&#20854;&#30446;&#26631;&#26159;&#26368;&#23567;&#21270;&#27835;&#30103;&#25928;&#24212;&#20272;&#35745;&#22120;&#30340;&#26041;&#24046;&#12290;&#36825;&#31181;&#24191;&#27867;&#35748;&#21487;&#30340;&#26041;&#27861;&#22312;&#22788;&#29702;&#32452;&#21644;&#23545;&#29031;&#32452;&#20855;&#26377;&#19981;&#21516;&#26631;&#20934;&#24046;&#30340;&#24773;&#20917;&#19979;&#22686;&#21152;&#20102;&#32479;&#35745;&#25928;&#21147;&#65292;&#36825;&#22312;&#31038;&#20250;&#23454;&#39564;&#12289;&#20020;&#24202;&#35797;&#39564;&#12289;&#24066;&#22330;&#30740;&#31350;&#21644;&#22312;&#32447;A/B&#27979;&#35797;&#20013;&#32463;&#24120;&#21457;&#29983;&#12290;&#28982;&#32780;&#65292;&#38500;&#38750;&#25552;&#21069;&#30693;&#36947;&#26631;&#20934;&#24046;&#65292;&#21542;&#21017;&#26080;&#27861;&#23454;&#26045;Neyman&#20998;&#37197;&#12290;&#24184;&#36816;&#30340;&#26159;&#65292;&#19978;&#36848;&#24212;&#29992;&#30340;&#22810;&#38454;&#27573;&#24615;&#36136;&#20351;&#24471;&#21487;&#20197;&#20351;&#29992;&#36739;&#26089;&#38454;&#27573;&#30340;&#35266;&#27979;&#26469;&#20272;&#35745;&#26631;&#20934;&#24046;&#65292;&#36827;&#19968;&#27493;&#25351;&#23548;&#21518;&#32493;&#38454;&#27573;&#30340;&#20998;&#37197;&#20915;&#31574;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#20010;&#31454;&#20105;&#20998;&#26512;&#26694;&#26550;&#26469;&#30740;&#31350;&#36825;&#20010;&#22810;&#38454;&#27573;&#23454;&#39564;&#35774;&#35745;&#38382;&#39064;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#31616;&#21333;&#30340;&#33258;&#36866;&#24212;Neyman&#20998;&#37197;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
In experimental design, Neyman allocation refers to the practice of allocating subjects into treated and control groups, potentially in unequal numbers proportional to their respective standard deviations, with the objective of minimizing the variance of the treatment effect estimator. This widely recognized approach increases statistical power in scenarios where the treated and control groups have different standard deviations, as is often the case in social experiments, clinical trials, marketing research, and online A/B testing. However, Neyman allocation cannot be implemented unless the standard deviations are known in advance. Fortunately, the multi-stage nature of the aforementioned applications allows the use of earlier stage observations to estimate the standard deviations, which further guide allocation decisions in later stages. In this paper, we introduce a competitive analysis framework to study this multi-stage experimental design problem. We propose a simple adaptive Neym
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#20272;&#35745;&#22120;&#8212;&#8212;&#26377;&#24207;&#30456;&#20851;&#26862;&#26519;&#65292;&#21487;&#20197;&#33258;&#28982;&#22320;&#22788;&#29702;&#20855;&#26377;&#20869;&#22312;&#25490;&#24207;&#30340;&#20998;&#31867;&#32467;&#26524;&#65292;&#32780;&#26080;&#38656;&#20551;&#35774;&#29305;&#23450;&#30340;&#35823;&#24046;&#39033;&#20998;&#24067;&#65292;&#24182;&#19988;&#33021;&#22312;&#38750;&#32447;&#24615;&#25968;&#25454;&#20013;&#25552;&#20379;&#19968;&#33268;&#19988;&#28176;&#36817;&#27491;&#24120;&#30340;&#39044;&#27979;&#12290;</title><link>http://arxiv.org/abs/2309.08755</link><description>&lt;p&gt;
&#26377;&#24207;&#30456;&#20851;&#26862;&#26519;
&lt;/p&gt;
&lt;p&gt;
Ordered Correlation Forest. (arXiv:2309.08755v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.08755
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#20272;&#35745;&#22120;&#8212;&#8212;&#26377;&#24207;&#30456;&#20851;&#26862;&#26519;&#65292;&#21487;&#20197;&#33258;&#28982;&#22320;&#22788;&#29702;&#20855;&#26377;&#20869;&#22312;&#25490;&#24207;&#30340;&#20998;&#31867;&#32467;&#26524;&#65292;&#32780;&#26080;&#38656;&#20551;&#35774;&#29305;&#23450;&#30340;&#35823;&#24046;&#39033;&#20998;&#24067;&#65292;&#24182;&#19988;&#33021;&#22312;&#38750;&#32447;&#24615;&#25968;&#25454;&#20013;&#25552;&#20379;&#19968;&#33268;&#19988;&#28176;&#36817;&#27491;&#24120;&#30340;&#39044;&#27979;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#21508;&#31181;&#31038;&#20250;&#31185;&#23398;&#30340;&#23454;&#35777;&#30740;&#31350;&#20013;&#65292;&#24120;&#24120;&#28041;&#21450;&#21040;&#20855;&#26377;&#20869;&#22312;&#25490;&#24207;&#30340;&#20998;&#31867;&#32467;&#26524;&#65292;&#27604;&#22914;&#20027;&#35266;&#24184;&#31119;&#24863;&#30340;&#33258;&#25105;&#35780;&#20272;&#21644;&#20581;&#24247;&#39046;&#22495;&#30340;&#33258;&#25105;&#35780;&#20272;&#12290;&#23613;&#31649;&#26377;&#24207;&#36873;&#25321;&#27169;&#22411;&#65288;&#22914;&#26377;&#24207;logit&#21644;&#26377;&#24207;probit&#65289;&#26159;&#20998;&#26512;&#36825;&#20123;&#32467;&#26524;&#30340;&#24120;&#29992;&#24037;&#20855;&#65292;&#20294;&#23427;&#20204;&#21487;&#33021;&#20250;&#24378;&#21152;&#21442;&#25968;&#38480;&#21046;&#21644;&#20998;&#24067;&#20551;&#35774;&#12290;&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#26032;&#30340;&#20272;&#35745;&#22120;&#8212;&#8212;&#26377;&#24207;&#30456;&#20851;&#26862;&#26519;&#65292;&#23427;&#21487;&#20197;&#33258;&#28982;&#22320;&#22788;&#29702;&#25968;&#25454;&#20013;&#30340;&#38750;&#32447;&#24615;&#65292;&#24182;&#19988;&#19981;&#20551;&#35774;&#29305;&#23450;&#30340;&#35823;&#24046;&#39033;&#20998;&#24067;&#12290;&#25552;&#20986;&#30340;&#20272;&#35745;&#22120;&#20462;&#25913;&#20102;&#26631;&#20934;&#38543;&#26426;&#26862;&#26519;&#30340;&#20998;&#35010;&#20934;&#21017;&#65292;&#26500;&#24314;&#20102;&#19968;&#32452;&#26862;&#26519;&#65292;&#27599;&#20010;&#26862;&#26519;&#20272;&#35745;&#19968;&#20010;&#21333;&#19968;&#31867;&#21035;&#30340;&#26465;&#20214;&#27010;&#29575;&#12290;&#22312;&#8220;&#35802;&#23454;&#8221;&#26465;&#20214;&#19979;&#65292;&#39044;&#27979;&#26159;&#19968;&#33268;&#30340;&#24182;&#19988;&#28176;&#36817;&#27491;&#24120;&#30340;&#12290;&#30001;&#27599;&#20010;&#26862;&#26519;&#24341;&#21457;&#30340;&#26435;&#37325;&#34987;&#29992;&#26469;&#33719;&#21462;&#39044;&#27979;&#27010;&#29575;&#21644;&#21327;&#21464;&#37327;&#36793;&#38469;&#25928;&#24212;&#30340;&#26631;&#20934;&#35823;&#12290;&#26469;&#33258;&#21512;&#25104;&#25968;&#25454;&#30340;&#35777;&#25454;&#35777;&#26126;&#20102;&#26377;&#24207;&#30456;&#20851;&#26862;&#26519;&#30340;&#25928;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
Empirical studies in various social sciences often involve categorical outcomes with inherent ordering, such as self-evaluations of subjective well-being and self-assessments in health domains. While ordered choice models, such as the ordered logit and ordered probit, are popular tools for analyzing these outcomes, they may impose restrictive parametric and distributional assumptions. This paper introduces a novel estimator, the ordered correlation forest, that can naturally handle non-linearities in the data and does not assume a specific error term distribution. The proposed estimator modifies a standard random forest splitting criterion to build a collection of forests, each estimating the conditional probability of a single class. Under an "honesty" condition, predictions are consistent and asymptotically normal. The weights induced by each forest are used to obtain standard errors for the predicted probabilities and the covariates' marginal effects. Evidence from synthetic data sh
&lt;/p&gt;</description></item><item><title>&#36825;&#31687;&#35770;&#25991;&#30740;&#31350;&#20102;&#20915;&#31574;&#32773;&#23398;&#20064;&#20851;&#20110;&#38476;&#29983;&#26032;&#38395;&#26469;&#28304;&#20559;&#35265;&#30340;&#36807;&#31243;&#12290;&#24403;&#20915;&#31574;&#32773;&#23545;&#24050;&#30693;&#26469;&#28304;&#30340;&#20559;&#35265;&#26377;&#38169;&#35823;&#30340;&#20449;&#24565;&#26102;&#65292;&#23398;&#20064;&#36807;&#31243;&#20250;&#22833;&#36133;&#65292;&#23548;&#33268;&#25197;&#26354;&#12290;&#35813;&#27169;&#22411;&#20135;&#29983;&#20102;&#25932;&#23545;&#23186;&#20307;&#25928;&#24212;&#21644;&#34394;&#20551;&#26497;&#21270;&#65292;&#23545;&#20107;&#23454;&#26680;&#26597;&#21644;&#38169;&#35823;&#35266;&#24565;&#26657;&#20934;&#20135;&#29983;&#20102;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2309.08740</link><description>&lt;p&gt;
&#23398;&#20064;&#26032;&#38395;&#20559;&#35265;&#65306;&#38169;&#35823;&#35268;&#33539;&#21644;&#21518;&#26524;
&lt;/p&gt;
&lt;p&gt;
Learning News Bias: Misspecifications and Consequences. (arXiv:2309.08740v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.08740
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#30740;&#31350;&#20102;&#20915;&#31574;&#32773;&#23398;&#20064;&#20851;&#20110;&#38476;&#29983;&#26032;&#38395;&#26469;&#28304;&#20559;&#35265;&#30340;&#36807;&#31243;&#12290;&#24403;&#20915;&#31574;&#32773;&#23545;&#24050;&#30693;&#26469;&#28304;&#30340;&#20559;&#35265;&#26377;&#38169;&#35823;&#30340;&#20449;&#24565;&#26102;&#65292;&#23398;&#20064;&#36807;&#31243;&#20250;&#22833;&#36133;&#65292;&#23548;&#33268;&#25197;&#26354;&#12290;&#35813;&#27169;&#22411;&#20135;&#29983;&#20102;&#25932;&#23545;&#23186;&#20307;&#25928;&#24212;&#21644;&#34394;&#20551;&#26497;&#21270;&#65292;&#23545;&#20107;&#23454;&#26680;&#26597;&#21644;&#38169;&#35823;&#35266;&#24565;&#26657;&#20934;&#20135;&#29983;&#20102;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#20915;&#31574;&#32773;&#65288;DM&#65289;&#22914;&#20309;&#23398;&#20064;&#20851;&#20110;&#38476;&#29983;&#26032;&#38395;&#26469;&#28304;&#30340;&#20559;&#35265;&#12290;&#22312;&#27809;&#26377;&#20219;&#20309;&#25705;&#25830;&#30340;&#24773;&#20917;&#19979;&#65292;&#29702;&#24615;&#30340;DM&#20351;&#29992;&#24050;&#30693;&#26469;&#28304;&#20316;&#20026;&#26631;&#20934;&#26469;&#36776;&#21035;&#19968;&#20010;&#26469;&#28304;&#30340;&#30495;&#23454;&#20559;&#35265;&#12290;&#22914;&#26524;DM&#26377;&#38169;&#35823;&#30340;&#20449;&#24565;&#65292;&#36825;&#20010;&#36807;&#31243;&#23601;&#20250;&#22833;&#36133;&#12290;&#25105;&#20204;&#25512;&#23548;&#20986;&#24403;DM&#23545;&#24050;&#30693;&#26469;&#28304;&#30340;&#20559;&#35265;&#26377;&#25945;&#26465;&#12289;&#38169;&#35823;&#30340;&#20449;&#24565;&#26102;&#30340;&#38271;&#26399;&#20449;&#24565;&#12289;&#34892;&#20026;&#12289;&#31119;&#21033;&#21644;&#30456;&#24212;&#30340;&#27604;&#36739;&#38745;&#24577;&#12290;&#30001;&#20110;&#38169;&#35823;&#30340;&#23398;&#20064;&#23548;&#33268;&#30340;&#25197;&#26354;&#21487;&#20197;&#36890;&#36807;&#25105;&#20204;&#24341;&#20837;&#30340;&#21333;&#32500;&#24230;&#24230;&#37327;&#20934;&#30830;&#22320;&#25429;&#25417;&#21040;&#12290;&#25105;&#20204;&#30340;&#27169;&#22411;&#20135;&#29983;&#20102;&#25932;&#23545;&#23186;&#20307;&#25928;&#24212;&#21644;&#34394;&#20551;&#26497;&#21270;&#65292;&#24182;&#23545;&#20107;&#23454;&#26680;&#26597;&#21644;&#38169;&#35823;&#35266;&#24565;&#26657;&#20934;&#20135;&#29983;&#20102;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study how a decision maker (DM) learns about the bias of unfamiliar news sources. Absent any frictions, a rational DM uses known sources as a yardstick to discern the true bias of a source. If a DM has misspecified beliefs, this process fails. We derive long-run beliefs, behavior, welfare, and corresponding comparative statics, when the DM has dogmatic, incorrect beliefs about the bias of known sources. The distortion due to misspecified learning is succinctly captured by a single-dimensional metric we introduce. Our model generates the hostile media effect and false polarization, and has implications for fact-checking and misperception recalibration.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#19968;&#20010;&#23545;&#21452;&#21521;&#32858;&#31867;&#20381;&#36182;&#20855;&#26377;&#30456;&#20851;&#20849;&#21516;&#26102;&#38388;&#25928;&#24212;&#30340;&#38754;&#26495;&#27169;&#22411;&#30340;&#26041;&#24046;&#20272;&#35745;&#26041;&#27861;&#65292;&#24182;&#25552;&#20986;&#20102;&#20004;&#20010;&#20559;&#24046;&#26657;&#27491;&#30340;&#26041;&#24046;&#20272;&#35745;&#22120;&#12290;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;&#35813;&#26041;&#24046;&#20272;&#35745;&#26041;&#27861;&#30340;&#22266;&#23450;b&#28176;&#36817;&#29702;&#35770;&#19982;&#25991;&#29486;&#20013;&#30340;&#28176;&#36817;&#27491;&#24577;&#32467;&#26524;&#30456;&#21563;&#21512;&#12290;</title><link>http://arxiv.org/abs/2309.08707</link><description>&lt;p&gt;
&#24102;&#26377;&#21452;&#21521;&#32858;&#31867;&#30340;&#38754;&#26495;&#27169;&#22411;&#30340;&#22266;&#23450;b&#28176;&#36817;&#29702;&#35770;
&lt;/p&gt;
&lt;p&gt;
Fixed-b Asymptotics for Panel Models with Two-Way Clustering. (arXiv:2309.08707v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.08707
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#19968;&#20010;&#23545;&#21452;&#21521;&#32858;&#31867;&#20381;&#36182;&#20855;&#26377;&#30456;&#20851;&#20849;&#21516;&#26102;&#38388;&#25928;&#24212;&#30340;&#38754;&#26495;&#27169;&#22411;&#30340;&#26041;&#24046;&#20272;&#35745;&#26041;&#27861;&#65292;&#24182;&#25552;&#20986;&#20102;&#20004;&#20010;&#20559;&#24046;&#26657;&#27491;&#30340;&#26041;&#24046;&#20272;&#35745;&#22120;&#12290;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;&#35813;&#26041;&#24046;&#20272;&#35745;&#26041;&#27861;&#30340;&#22266;&#23450;b&#28176;&#36817;&#29702;&#35770;&#19982;&#25991;&#29486;&#20013;&#30340;&#28176;&#36817;&#27491;&#24577;&#32467;&#26524;&#30456;&#21563;&#21512;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#30001;Chiang, Hansen&#21644;Sasaki (2022)&#25552;&#20986;&#30340;&#19968;&#31181;&#23545;&#38754;&#26495;&#25968;&#25454;&#20013;&#20855;&#26377;&#30456;&#20851;&#20849;&#21516;&#26102;&#38388;&#25928;&#24212;&#30340;&#21452;&#21521;&#32858;&#31867;&#20381;&#36182;&#30340;&#26041;&#24046;&#20272;&#35745;&#26041;&#27861;&#12290;&#39318;&#20808;&#65292;&#25105;&#20204;&#36890;&#36807;&#20195;&#25968;&#26041;&#27861;&#35777;&#26126;&#20102;&#35813;&#26041;&#24046;&#20272;&#35745;&#26041;&#27861;&#65288;&#20197;&#19979;&#31616;&#31216;CHS&#20272;&#35745;&#22120;&#65289;&#26159;&#19977;&#31181;&#24120;&#35265;&#26041;&#24046;&#20272;&#35745;&#26041;&#27861;&#30340;&#32447;&#24615;&#32452;&#21512;&#65306;Arellano (1987)&#30340;&#32858;&#31867;&#20272;&#35745;&#22120;&#12289;Driscoll&#21644;Kraay (1998)&#30340;&#8220;&#24179;&#22343;&#30340;HAC&#8221;&#20272;&#35745;&#22120;&#65292;&#20197;&#21450;Newey&#21644;West (1987)&#12289;Vogelsang (2012)&#30340;&#8220;HAC&#30340;&#24179;&#22343;&#8221;&#20272;&#35745;&#22120;&#12290;&#22522;&#20110;&#36825;&#19968;&#21457;&#29616;&#65292;&#25105;&#20204;&#24471;&#21040;&#20102;CHS&#20272;&#35745;&#22120;&#21450;&#20854;&#23545;&#24212;&#30340;&#26816;&#39564;&#32479;&#35745;&#37327;&#30340;&#22266;&#23450;b&#28176;&#36817;&#32467;&#26524;&#65292;&#21363;&#22312;&#27178;&#25130;&#38754;&#21644;&#26102;&#38388;&#26679;&#26412;&#23481;&#37327;&#20849;&#21516;&#36235;&#21521;&#26080;&#31351;&#22823;&#26102;&#30340;&#32467;&#26524;&#12290;&#24403;&#24102;&#23485;&#19982;&#26102;&#38388;&#26679;&#26412;&#23481;&#37327;&#20043;&#27604;&#36235;&#21521;&#20110;&#38646;&#26102;&#65292;&#22266;&#23450;b&#28176;&#36817;&#32467;&#26524;&#19982;Chiang&#31561;&#20154;(2022)&#30340;&#28176;&#36817;&#27491;&#24577;&#32467;&#26524;&#30456;&#21563;&#21512;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#20004;&#31181;&#26367;&#20195;&#24615;&#30340;&#20559;&#24046;&#26657;&#27491;&#26041;&#24046;&#20272;&#35745;&#22120;&#65292;&#24182;&#25512;&#23548;&#20986;&#30456;&#24212;&#30340;&#22266;&#23450;b&#28176;&#36817;&#38480;&#21046;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper studies a variance estimator proposed by Chiang, Hansen and Sasaki (2022) that is robust to two-way clustering dependence with correlated common time effects in panels. First, we show algebraically that this variance estimator (CHS estimator, hereafter) is a linear combination of three common variance estimators: the cluster estimator by Arellano (1987), the "HAC of averages" estimator by Driscoll and Kraay (1998), and the "average of HACs" estimator (Newey and West (1987) and Vogelsang (2012)). Based on this finding, we obtain a fixed-b asymptotic result for the CHS estimator and corresponding test statistics as the cross-section and time sample sizes jointly go to infinity. As the ratio of the bandwidth to the time sample size goes to zero, the fixed-b asymptotic results match the asymptotic normality result in Chiang et al. (2022). Furthermore, we propose two alternative bias-corrected variance estimators and derive fixed-b asymptotics limits. While the test statistics ar
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#32467;&#26500;&#35745;&#37327;&#26041;&#27861;&#26469;&#20272;&#35745;COVID-19&#30340;&#22522;&#26412;&#20256;&#26579;&#29575;$\mathcal{R}_{0}$&#65292;&#32467;&#26524;&#26174;&#31034;&#24179;&#22343;&#20540;&#20026;4.5&#65292;&#32780;&#19988;&#24403;&#26410;&#36866;&#24403;&#32771;&#34385;&#20943;&#36731;&#22240;&#32032;&#26102;&#65292;$\mathcal{R}_{0}$&#20272;&#35745;&#20250;&#26126;&#26174;&#20302;&#20272;&#12290;</title><link>http://arxiv.org/abs/2309.08619</link><description>&lt;p&gt;
&#32467;&#26500;&#35745;&#37327;&#26041;&#27861;&#20272;&#35745;&#32654;&#22269;&#21508;&#24030;&#21644;&#36873;&#23450;&#22269;&#23478;COVID-19&#22522;&#26412;&#20256;&#26579;&#29575;
&lt;/p&gt;
&lt;p&gt;
Structural Econometric Estimation of the Basic Reproduction Number for Covid-19 Across U.S. States and Selected Countries. (arXiv:2309.08619v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.08619
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#32467;&#26500;&#35745;&#37327;&#26041;&#27861;&#26469;&#20272;&#35745;COVID-19&#30340;&#22522;&#26412;&#20256;&#26579;&#29575;$\mathcal{R}_{0}$&#65292;&#32467;&#26524;&#26174;&#31034;&#24179;&#22343;&#20540;&#20026;4.5&#65292;&#32780;&#19988;&#24403;&#26410;&#36866;&#24403;&#32771;&#34385;&#20943;&#36731;&#22240;&#32032;&#26102;&#65292;$\mathcal{R}_{0}$&#20272;&#35745;&#20250;&#26126;&#26174;&#20302;&#20272;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#32467;&#26500;&#35745;&#37327;&#26041;&#27861;&#26469;&#20272;&#35745;COVID-19&#30340;&#22522;&#26412;&#20256;&#26579;&#29575;$\mathcal{R}_{0}$&#12290;&#35813;&#26041;&#27861;&#36890;&#36807;&#20174;&#20256;&#26579;&#30149;&#20256;&#25773;&#30340;&#20943;&#36731;&#22240;&#32032;&#20013;&#28388;&#38500;&#25928;&#24212;&#65292;&#22312;&#38754;&#26495;&#22238;&#24402;&#27169;&#22411;&#20013;&#30830;&#23450;&#20102;$\mathcal{R}_{0}$&#65292;&#23454;&#26045;&#31616;&#21333;&#12290;&#25105;&#20204;&#23558;&#35813;&#26041;&#27861;&#24212;&#29992;&#20110;48&#20010;&#36830;&#32493;&#30340;&#32654;&#22269;&#24030;&#21644;&#22810;&#26679;&#21270;&#30340;&#22269;&#23478;&#30340;&#25968;&#25454;&#12290;&#25105;&#20204;&#30340;&#32467;&#26524;&#26174;&#31034;&#65292;$\mathcal{R}_{0}$&#20272;&#35745;&#21576;&#29616;&#26174;&#33879;&#38598;&#20013;&#65292;&#24179;&#22343;&#20540;&#20026;4.5&#12290;&#36890;&#36807;&#23545;&#29031;&#20998;&#26512;&#65292;&#25105;&#20204;&#31361;&#20986;&#20102;&#22312;&#26410;&#36866;&#24403;&#32771;&#34385;&#20943;&#36731;&#22240;&#32032;&#26102;&#23545;$\mathcal{R}_{0}$&#30340;&#26126;&#26174;&#20302;&#20272;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper proposes a structural econometric approach to estimating the basic reproduction number ($\mathcal{R}_{0}$) of Covid-19. This approach identifies $\mathcal{R}_{0}$ in a panel regression model by filtering out the effects of mitigating factors on disease diffusion and is easy to implement. We apply the method to data from 48 contiguous U.S. states and a diverse set of countries. Our results reveal a notable concentration of $\mathcal{R}_{0}$ estimates with an average value of 4.5. Through a counterfactual analysis, we highlight a significant underestimation of the $\mathcal{R}_{0}$ when mitigating factors are not appropriately accounted for.
&lt;/p&gt;</description></item><item><title>&#25552;&#20986;&#20102;&#19968;&#20010;&#26032;&#30340;&#32447;&#24615;&#20272;&#35745;&#30340;&#25935;&#24863;&#24615;&#20998;&#26512;&#26694;&#26550;&#65292;&#21487;&#20197;&#22788;&#29702;&#37492;&#21035;&#22833;&#36133;&#21644;&#20551;&#35774;&#36829;&#21453;&#30340;&#38382;&#39064;&#65292;&#24182;&#32473;&#20986;&#20102;&#30456;&#24212;&#30340;&#23574;&#38160;&#36793;&#30028;&#29305;&#24449;&#12290;</title><link>http://arxiv.org/abs/2309.06305</link><description>&lt;p&gt;
&#32447;&#24615;&#20272;&#35745;&#30340;&#25935;&#24863;&#24615;&#20998;&#26512;
&lt;/p&gt;
&lt;p&gt;
Sensitivity Analysis for Linear Estimands. (arXiv:2309.06305v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.06305
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#20010;&#26032;&#30340;&#32447;&#24615;&#20272;&#35745;&#30340;&#25935;&#24863;&#24615;&#20998;&#26512;&#26694;&#26550;&#65292;&#21487;&#20197;&#22788;&#29702;&#37492;&#21035;&#22833;&#36133;&#21644;&#20551;&#35774;&#36829;&#21453;&#30340;&#38382;&#39064;&#65292;&#24182;&#32473;&#20986;&#20102;&#30456;&#24212;&#30340;&#23574;&#38160;&#36793;&#30028;&#29305;&#24449;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#26032;&#30340;&#32447;&#24615;&#20272;&#35745;&#30340;&#25935;&#24863;&#24615;&#20998;&#26512;&#26694;&#26550;&#65292;&#24403;&#37492;&#21035;&#22833;&#36133;&#21487;&#20197;&#34987;&#30475;&#20316;&#26159;&#30475;&#21040;&#20102;&#38169;&#35823;&#30340;&#32467;&#26524;&#20998;&#24067;&#26102;&#12290;&#25105;&#20204;&#30340;&#20551;&#35774;&#26063;&#38480;&#23450;&#20102;&#35266;&#23519;&#21040;&#30340;&#21644;&#30495;&#23454;&#26465;&#20214;&#32467;&#26524;&#20998;&#24067;&#20043;&#38388;&#30340;&#23494;&#24230;&#27604;&#12290;&#36825;&#20010;&#26694;&#26550;&#33258;&#28982;&#22320;&#19982;&#36873;&#25321;&#27169;&#22411;&#30456;&#20851;&#32852;&#65292;&#25512;&#24191;&#20102;&#22238;&#24402;&#19981;&#36830;&#32493;&#24615;&#65288;RD&#65289;&#21644;&#20498;&#25968;&#27010;&#29575;&#21152;&#26435;&#24230;&#37327;&#65288;IPW&#65289;&#30340;&#29616;&#26377;&#20551;&#35774;&#65292;&#24182;&#38024;&#23545;&#26222;&#36890;&#26368;&#23567;&#20108;&#20056;&#27861;&#65288;OLS&#65289;&#30340;&#37492;&#21035;&#20551;&#35774;&#36829;&#21453;&#25552;&#20379;&#20102;&#19968;&#31181;&#26032;&#30340;&#38750;&#21442;&#25968;&#35270;&#35282;&#12290;&#25105;&#20204;&#30340;&#23574;&#38160;&#37096;&#20998;&#37492;&#21035;&#32467;&#26524;&#23558;&#29616;&#26377;&#30340;IPW&#32467;&#26524;&#25512;&#24191;&#21040;&#20854;&#20182;&#20272;&#35745;&#21644;&#20801;&#35768;&#26080;&#30028;&#20284;&#28982;&#27604;&#30340;&#20551;&#35774;&#65292;&#20174;&#32780;&#22312;&#20687;Masten&#21644;Poirier&#65288;2018&#24180;&#65289;&#30340;c&#20381;&#36182;&#24615;&#20551;&#35774;&#19979;&#25552;&#20379;&#20102;&#31616;&#21333;&#32780;&#32479;&#19968;&#30340;&#36793;&#30028;&#29305;&#24449;&#12290;&#23574;&#38160;&#36793;&#30028;&#21487;&#20197;&#20889;&#25104;&#25968;&#25454;&#30340;&#31616;&#21333;&#38381;&#21512;&#24418;&#24335;&#30697;&#12289;&#22312;&#20027;&#35201;&#20998;&#26512;&#20013;&#20272;&#35745;&#30340;&#26080;&#20851;&#20989;&#25968;&#21644;&#26465;&#20214;&#20989;&#25968;&#30340;&#20056;&#31215;&#12290;
&lt;/p&gt;
&lt;p&gt;
We propose a novel sensitivity analysis framework for linear estimands when identification failure can be viewed as seeing the wrong distribution of outcomes. Our family of assumptions bounds the density ratio between the observed and true conditional outcome distribution. This framework links naturally to selection models, generalizes existing assumptions for the Regression Discontinuity (RD) and Inverse Propensity Weighting (IPW) estimand, and provides a novel nonparametric perspective on violations of identification assumptions for ordinary least squares (OLS). Our sharp partial identification results extend existing results for IPW to cover other estimands and assumptions that allow even unbounded likelihood ratios, yielding a simple and unified characterization of bounds under assumptions like c-dependence of Masten and Poirier (2018). The sharp bounds can be written as a simple closed form moment of the data, the nuisance functions estimated in the primary analysis, and the condi
&lt;/p&gt;</description></item><item><title>&#22312;&#20449;&#24687;&#25552;&#20379;&#23454;&#39564;&#20013;&#65292;&#20351;&#29992;&#20449;&#24687;&#25552;&#20379;&#20316;&#20026;&#24037;&#20855;&#21464;&#37327;&#21487;&#33021;&#26080;&#27861;&#20135;&#29983;&#27491;&#21152;&#26435;&#30340;&#20449;&#24565;&#25928;&#24212;&#30340;&#24179;&#22343;&#20540;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#31227;&#21160;&#24037;&#20855;&#21464;&#37327;&#26694;&#26550;&#21644;&#20272;&#35745;&#22120;&#65292;&#36890;&#36807;&#21033;&#29992;&#20808;&#39564;&#21028;&#26029;&#20449;&#24565;&#26356;&#26032;&#30340;&#26041;&#21521;&#65292;&#21487;&#20197;&#33719;&#24471;&#27491;&#21152;&#26435;&#30340;&#20449;&#24565;&#25928;&#24212;&#30340;&#24179;&#22343;&#20540;&#12290;</title><link>http://arxiv.org/abs/2309.04793</link><description>&lt;p&gt;
&#22312;&#20449;&#24687;&#25552;&#20379;&#23454;&#39564;&#20013;&#35299;&#37322;IV&#20272;&#35745;&#22120;
&lt;/p&gt;
&lt;p&gt;
Interpreting IV Estimators in Information Provision Experiments. (arXiv:2309.04793v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.04793
&lt;/p&gt;
&lt;p&gt;
&#22312;&#20449;&#24687;&#25552;&#20379;&#23454;&#39564;&#20013;&#65292;&#20351;&#29992;&#20449;&#24687;&#25552;&#20379;&#20316;&#20026;&#24037;&#20855;&#21464;&#37327;&#21487;&#33021;&#26080;&#27861;&#20135;&#29983;&#27491;&#21152;&#26435;&#30340;&#20449;&#24565;&#25928;&#24212;&#30340;&#24179;&#22343;&#20540;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#31227;&#21160;&#24037;&#20855;&#21464;&#37327;&#26694;&#26550;&#21644;&#20272;&#35745;&#22120;&#65292;&#36890;&#36807;&#21033;&#29992;&#20808;&#39564;&#21028;&#26029;&#20449;&#24565;&#26356;&#26032;&#30340;&#26041;&#21521;&#65292;&#21487;&#20197;&#33719;&#24471;&#27491;&#21152;&#26435;&#30340;&#20449;&#24565;&#25928;&#24212;&#30340;&#24179;&#22343;&#20540;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36234;&#26469;&#36234;&#22810;&#30340;&#25991;&#29486;&#20351;&#29992;&#20449;&#24687;&#25552;&#20379;&#23454;&#39564;&#26469;&#34913;&#37327;&#8220;&#20449;&#24565;&#25928;&#24212;&#8221;&#8212;&#8212;&#21363;&#20449;&#24565;&#21464;&#21270;&#23545;&#34892;&#20026;&#30340;&#24433;&#21709;&#8212;&#8212;&#20854;&#20013;&#20449;&#24687;&#25552;&#20379;&#34987;&#29992;&#20316;&#20449;&#24565;&#30340;&#24037;&#20855;&#21464;&#37327;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#22312;&#20855;&#26377;&#24322;&#36136;&#20449;&#24565;&#25928;&#24212;&#30340;&#34987;&#21160;&#25511;&#21046;&#35774;&#35745;&#23454;&#39564;&#20013;&#65292;&#20351;&#29992;&#20449;&#24687;&#25552;&#20379;&#20316;&#20026;&#24037;&#20855;&#21464;&#37327;&#21487;&#33021;&#26080;&#27861;&#20135;&#29983;&#20449;&#24565;&#25928;&#24212;&#30340;&#27491;&#21152;&#26435;&#24179;&#22343;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#8220;&#31227;&#21160;&#24037;&#20855;&#21464;&#37327;&#8221;&#65288;MIV&#65289;&#26694;&#26550;&#21644;&#20272;&#35745;&#22120;&#65292;&#36890;&#36807;&#21033;&#29992;&#20808;&#39564;&#21028;&#26029;&#20449;&#24565;&#26356;&#26032;&#30340;&#26041;&#21521;&#65292;&#21487;&#20197;&#33719;&#24471;&#20449;&#24565;&#25928;&#24212;&#30340;&#27491;&#21152;&#26435;&#24179;&#22343;&#12290;&#19982;&#25991;&#29486;&#20013;&#24120;&#29992;&#30340;&#35268;&#33539;&#30456;&#27604;&#65292;&#25105;&#20204;&#30340;&#39318;&#36873;MIV&#21487;&#20197;&#36807;&#20998;&#21152;&#26435;&#20855;&#26377;&#36739;&#22823;&#20808;&#39564;&#35823;&#24046;&#30340;&#20010;&#20307;&#65307;&#27492;&#22806;&#65292;&#19968;&#20123;&#35268;&#33539;&#21487;&#33021;&#38656;&#35201;&#39069;&#22806;&#30340;&#20551;&#35774;&#25165;&#33021;&#20135;&#29983;&#27491;&#21152;&#26435;&#12290;
&lt;/p&gt;
&lt;p&gt;
A growing literature measures "belief effects" -- that is, the effect of a change in beliefs on one's actions -- using information provision experiments, where the provision of information is used as an instrument for beliefs. We show that in passive control design experiments with heterogeneous belief effects, using information provision as an instrument may not produce a positive weighted average of belief effects. We propose a "mover instrumental variables" (MIV) framework and estimator that attains a positive weighted average of belief effects by inferring the direction of belief updating using the prior. Relative to our preferred MIV, commonly used specifications in the literature produce a form of MIV that overweights individuals with larger prior errors; additionally, some specifications may require additional assumptions to generate positive weights.
&lt;/p&gt;</description></item><item><title>&#25968;&#23383;&#39072;&#35206;&#26159;&#23548;&#33268;&#19981;&#24179;&#31561;&#30340;&#21407;&#22240;&#65292;&#29616;&#26377;&#35299;&#20915;&#26041;&#27861;&#22914;&#31246;&#25910;&#30340;&#25928;&#26524;&#26377;&#38480;&#12290;&#30740;&#31350;&#21457;&#29616;&#32593;&#32476;&#20114;&#32852;&#21644;&#38598;&#32676;&#20043;&#38388;&#30340;&#26725;&#26753;&#20851;&#31995;&#26159;&#20851;&#38190;&#22240;&#32032;&#12290;&#27880;&#20837;&#23567;&#25209;&#21019;&#19994;&#32773;&#22242;&#38431;&#21487;&#20197;&#21152;&#36895;&#25216;&#26415;&#30340;&#25512;&#24191;&#12290;</title><link>http://arxiv.org/abs/2309.03532</link><description>&lt;p&gt;
&#25968;&#23383;&#39072;&#35206;&#19982;&#19981;&#24179;&#31561;
&lt;/p&gt;
&lt;p&gt;
Digital Disruptions &amp; Inequality. (arXiv:2309.03532v1 [cs.SI])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.03532
&lt;/p&gt;
&lt;p&gt;
&#25968;&#23383;&#39072;&#35206;&#26159;&#23548;&#33268;&#19981;&#24179;&#31561;&#30340;&#21407;&#22240;&#65292;&#29616;&#26377;&#35299;&#20915;&#26041;&#27861;&#22914;&#31246;&#25910;&#30340;&#25928;&#26524;&#26377;&#38480;&#12290;&#30740;&#31350;&#21457;&#29616;&#32593;&#32476;&#20114;&#32852;&#21644;&#38598;&#32676;&#20043;&#38388;&#30340;&#26725;&#26753;&#20851;&#31995;&#26159;&#20851;&#38190;&#22240;&#32032;&#12290;&#27880;&#20837;&#23567;&#25209;&#21019;&#19994;&#32773;&#22242;&#38431;&#21487;&#20197;&#21152;&#36895;&#25216;&#26415;&#30340;&#25512;&#24191;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36807;&#21435;&#20960;&#21313;&#24180;&#26469;&#65292;&#19981;&#24179;&#31561;&#38382;&#39064;&#24050;&#32463;&#25104;&#20026;&#20840;&#29699;&#33539;&#22260;&#20869;&#29616;&#20195;&#31038;&#20250;&#30340;&#19968;&#20010;&#37325;&#35201;&#20851;&#27880;&#28857;&#12290;&#28982;&#32780;&#65292;&#25968;&#23383;&#39072;&#35206;&#20316;&#20026;&#19981;&#24179;&#31561;&#30340;&#21407;&#22240;&#20197;&#21450;&#29616;&#26377;&#35299;&#20915;&#26041;&#27861;&#65288;&#20363;&#22914;&#31246;&#25910;&#65289;&#30340;&#26377;&#25928;&#24615;&#65292;&#30446;&#21069;&#23578;&#26410;&#24471;&#21040;&#28145;&#20837;&#29702;&#35299;&#12290;&#26412;&#30740;&#31350;&#26088;&#22312;&#25581;&#31034;&#25968;&#23383;&#39072;&#35206;&#23545;&#19981;&#24179;&#31561;&#30340;&#24433;&#21709;&#20197;&#21450;&#20840;&#29699;&#21270;&#32972;&#26223;&#19979;&#30340;&#30456;&#20851;&#38382;&#39064;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#21457;&#29616;&#65292;&#32593;&#32476;&#20114;&#32852;&#21644;&#38598;&#32676;&#20043;&#38388;&#30340;&#24191;&#27867;&#26725;&#26753;&#26159;&#20851;&#38190;&#22240;&#32032;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36824;&#21457;&#29616;&#31246;&#25910;&#22312;&#23545;&#25239;&#19981;&#24179;&#31561;&#26041;&#38754;&#30340;&#25928;&#29992;&#26377;&#38480;&#12290;&#26377;&#36259;&#30340;&#26159;&#65292;&#30740;&#31350;&#34920;&#26126;&#65292;&#27880;&#20837;&#23567;&#25209;&#21019;&#19994;&#32773;&#22242;&#38431;&#21487;&#20197;&#21152;&#36895;&#25216;&#26415;&#30340;&#25512;&#24191;&#12290;
&lt;/p&gt;
&lt;p&gt;
Rising inequality is a critical concern for contemporary societies globally, to the extent that emerging high-growth economies such as China have identified common prosperity as a central goal. Yet, the role and mechanisms of digital disruptions as a cause of inequality and the effectiveness of existing remedies such as taxation, are poorly understood. Particularly the implications of the complex process of technological adoption that requires extensive social validation beyond weak ties. Similarly, the implications of globalization in the hyperconnected landscape of the 21st century remains unexplored.  This study aims to shed light in these multifaceted issues. Our findings indicate that network connectivity and the presence of wide bridges between clusters are pivotal factors. We also show the limited utility of taxation as a countermeasure against inequality. Interestingly, the research reveals that the strategic injection of small cohorts of entrepreneurs can expedite technology a
&lt;/p&gt;</description></item><item><title>&#35813;&#30740;&#31350;&#23558;&#21171;&#21160;&#20221;&#39069;&#30340;&#19979;&#38477;&#19982;&#35748;&#30693;&#34928;&#32769;&#32852;&#31995;&#36215;&#26469;&#65292;&#25552;&#20986;&#20102;&#19968;&#20010;&#26032;&#39062;&#30340;&#23439;&#35266;&#32463;&#27982;&#27169;&#22411;&#12290;&#27169;&#22411;&#34920;&#26126;&#65292;&#24037;&#19994;&#21270;&#23548;&#33268;&#20154;&#21475;&#32769;&#40836;&#21270;&#65292;&#32769;&#40836;&#28040;&#36153;&#32773;&#35748;&#30693;&#33021;&#21147;&#30340;&#19979;&#38477;&#20943;&#23569;&#20102;&#23545;&#26032;&#20135;&#20986;&#21464;&#20307;&#30340;&#38656;&#27714;&#65292;&#20174;&#32780;&#23548;&#33268;&#21171;&#21160;&#20221;&#39069;&#30340;&#19979;&#38477;&#12290;</title><link>http://arxiv.org/abs/2308.14982</link><description>&lt;p&gt;
&#35748;&#30693;&#34928;&#32769;&#19982;&#21171;&#21160;&#20221;&#39069;
&lt;/p&gt;
&lt;p&gt;
Cognitive Aging and Labor Share. (arXiv:2308.14982v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.14982
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#23558;&#21171;&#21160;&#20221;&#39069;&#30340;&#19979;&#38477;&#19982;&#35748;&#30693;&#34928;&#32769;&#32852;&#31995;&#36215;&#26469;&#65292;&#25552;&#20986;&#20102;&#19968;&#20010;&#26032;&#39062;&#30340;&#23439;&#35266;&#32463;&#27982;&#27169;&#22411;&#12290;&#27169;&#22411;&#34920;&#26126;&#65292;&#24037;&#19994;&#21270;&#23548;&#33268;&#20154;&#21475;&#32769;&#40836;&#21270;&#65292;&#32769;&#40836;&#28040;&#36153;&#32773;&#35748;&#30693;&#33021;&#21147;&#30340;&#19979;&#38477;&#20943;&#23569;&#20102;&#23545;&#26032;&#20135;&#20986;&#21464;&#20307;&#30340;&#38656;&#27714;&#65292;&#20174;&#32780;&#23548;&#33268;&#21171;&#21160;&#20221;&#39069;&#30340;&#19979;&#38477;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21171;&#21160;&#20221;&#39069;&#65292;&#21363;&#32463;&#27982;&#20135;&#20986;&#30340;&#24037;&#36164;&#27604;&#20363;&#65292;&#22312;&#24037;&#19994;&#21270;&#22269;&#23478;&#20013;&#19981;&#21487;&#29702;&#35299;&#22320;&#22312;&#19979;&#38477;&#12290;&#34429;&#28982;&#35768;&#22810;&#20043;&#21069;&#30340;&#30740;&#31350;&#35797;&#22270;&#36890;&#36807;&#32463;&#27982;&#22240;&#32032;&#26469;&#35299;&#37322;&#36825;&#31181;&#19979;&#38477;&#65292;&#20294;&#25105;&#20204;&#30340;&#26032;&#39062;&#26041;&#27861;&#23558;&#36825;&#31181;&#19979;&#38477;&#19982;&#29983;&#29289;&#22240;&#32032;&#32852;&#31995;&#36215;&#26469;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#29702;&#35770;&#23439;&#35266;&#32463;&#27982;&#27169;&#22411;&#65292;&#21171;&#21160;&#20221;&#39069;&#21453;&#26144;&#20102;&#21171;&#21160;&#21147;&#33258;&#21160;&#21270;&#29616;&#26377;&#20135;&#20986;&#21644;&#28040;&#36153;&#32773;&#38656;&#27714;&#26032;&#30340;&#20381;&#36182;&#20154;&#21147;&#21171;&#21160;&#30340;&#20135;&#20986;&#21464;&#20307;&#20043;&#38388;&#30340;&#21160;&#24577;&#24179;&#34913;&#12290;&#24037;&#19994;&#21270;&#23548;&#33268;&#20154;&#21475;&#32769;&#40836;&#21270;&#65292;&#34429;&#28982;&#22312;&#24037;&#20316;&#24180;&#38480;&#20869;&#35748;&#30693;&#34920;&#29616;&#31283;&#23450;&#65292;&#20294;&#20043;&#21518;&#24613;&#21095;&#19979;&#38477;&#12290;&#22240;&#27492;&#65292;&#32769;&#40836;&#28040;&#36153;&#32773;&#35748;&#30693;&#33021;&#21147;&#30340;&#19979;&#38477;&#20943;&#23569;&#20102;&#23545;&#26032;&#30340;&#20135;&#20986;&#21464;&#20307;&#30340;&#38656;&#27714;&#65292;&#23548;&#33268;&#21171;&#21160;&#20221;&#39069;&#19979;&#38477;&#12290;&#25105;&#20204;&#30340;&#27169;&#22411;&#23558;&#21171;&#21160;&#20221;&#39069;&#34920;&#36798;&#20026;&#20013;&#20301;&#25968;&#24180;&#40836;&#30340;&#20195;&#25968;&#20989;&#25968;&#65292;&#24182;&#36890;&#36807;&#38750;&#32447;&#24615;&#38543;&#26426;&#22238;&#24402;&#22312;&#24037;&#19994;&#21270;&#32463;&#27982;&#20307;&#30340;&#21382;&#21490;&#25968;&#25454;&#19978;&#20197;&#24778;&#20154;&#30340;&#20934;&#30830;&#24615;&#36827;&#34892;&#20102;&#39564;&#35777;&#12290;
&lt;/p&gt;
&lt;p&gt;
Labor share, the fraction of economic output accrued as wages, is inexplicably declining in industrialized countries. Whilst numerous prior works attempt to explain the decline via economic factors, our novel approach links the decline to biological factors. Specifically, we propose a theoretical macroeconomic model where labor share reflects a dynamic equilibrium between the workforce automating existing outputs, and consumers demanding new output variants that require human labor. Industrialization leads to an aging population, and while cognitive performance is stable in the working years it drops sharply thereafter. Consequently, the declining cognitive performance of aging consumers reduces the demand for new output variants, leading to a decline in labor share. Our model expresses labor share as an algebraic function of median age, and is validated with surprising accuracy on historical data across industrialized economies via non-linear stochastic regression.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#20110;&#20108;&#20803;&#32467;&#26524;&#30340;&#27835;&#30103;&#36873;&#25321;&#38382;&#39064;&#30340;&#24102;&#23485;&#36873;&#25321;&#26041;&#27861;&#65292;&#36890;&#36807;&#20248;&#21270;&#20004;&#20010;&#21442;&#25968;&#65292;&#21487;&#20197;&#35745;&#31639;&#20986;&#26368;&#22823;&#36951;&#25022;&#65292;&#24182;&#36827;&#34892;&#20102;&#21644;&#27491;&#24577;&#20998;&#24067;&#32467;&#26524;&#30340;&#27604;&#36739;&#20998;&#26512;&#12290;</title><link>http://arxiv.org/abs/2308.14375</link><description>&lt;p&gt;
&#20108;&#20803;&#32467;&#26524;&#30340;&#27835;&#30103;&#36873;&#25321;&#20013;&#30340;&#24102;&#23485;&#36873;&#25321;
&lt;/p&gt;
&lt;p&gt;
Bandwidth Selection for Treatment Choice with Binary Outcomes. (arXiv:2308.14375v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.14375
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#20110;&#20108;&#20803;&#32467;&#26524;&#30340;&#27835;&#30103;&#36873;&#25321;&#38382;&#39064;&#30340;&#24102;&#23485;&#36873;&#25321;&#26041;&#27861;&#65292;&#36890;&#36807;&#20248;&#21270;&#20004;&#20010;&#21442;&#25968;&#65292;&#21487;&#20197;&#35745;&#31639;&#20986;&#26368;&#22823;&#36951;&#25022;&#65292;&#24182;&#36827;&#34892;&#20102;&#21644;&#27491;&#24577;&#20998;&#24067;&#32467;&#26524;&#30340;&#27604;&#36739;&#20998;&#26512;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#32771;&#34385;&#20102;&#32467;&#26524;&#21464;&#37327;&#20026;&#20108;&#20803;&#26102;&#30340;&#27835;&#30103;&#36873;&#25321;&#38382;&#39064;&#12290;&#25105;&#20204;&#19987;&#27880;&#20110;&#22522;&#20110;&#38750;&#21442;&#25968;&#26680;&#22238;&#24402;&#30340;&#32479;&#35745;&#27835;&#30103;&#35268;&#21017;&#65292;&#35777;&#26126;&#20102;&#20248;&#21270;&#20004;&#20010;&#21442;&#25968;&#21487;&#20197;&#35745;&#31639;&#20986;&#26368;&#22823;&#36951;&#25022;&#12290;&#26681;&#25454;&#36825;&#20010;&#32467;&#26524;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#26368;&#23567;&#26368;&#22823;&#36951;&#25022;&#20934;&#21017;&#30340;&#26032;&#39062;&#24102;&#23485;&#36873;&#25321;&#26041;&#27861;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#36827;&#34892;&#20102;&#25968;&#20540;&#20998;&#26512;&#65292;&#27604;&#36739;&#20102;&#20108;&#20803;&#21644;&#27491;&#24577;&#20998;&#24067;&#32467;&#26524;&#30340;&#26368;&#20248;&#24102;&#23485;&#36873;&#25321;&#12290;
&lt;/p&gt;
&lt;p&gt;
This study considers the treatment choice problem when outcome variables are binary. We focus on statistical treatment rules that plug in fitted values based on nonparametric kernel regression and show that optimizing two parameters enables the calculation of the maximum regret. Using this result, we propose a novel bandwidth selection method based on the minimax regret criterion. Finally, we perform a numerical analysis to compare the optimal bandwidth choices for the binary and normally distributed outcomes.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;Structured-POET&#30340;&#26041;&#27861;&#65292;&#23427;&#21487;&#20197;&#21512;&#24182;&#20840;&#29699;&#21644;&#22269;&#23478;&#22240;&#23376;&#27169;&#22411;&#30340;&#32467;&#26500;&#20449;&#24687;&#12290;&#35813;&#26041;&#27861;&#21487;&#20197;&#29992;&#20110;&#20272;&#35745;&#22823;&#27874;&#21160;&#30697;&#38453;&#65292;&#24182;&#24212;&#29992;&#20110;&#22269;&#38469;&#32929;&#31080;&#24066;&#22330;&#25968;&#25454;&#30340;&#26679;&#26412;&#22806;&#32452;&#21512;&#20998;&#37197;&#30340;&#30740;&#31350;&#12290;</title><link>http://arxiv.org/abs/2305.01464</link><description>&lt;p&gt;
&#22522;&#20110;&#32467;&#26500;&#20449;&#24687;&#30340;&#22823;&#35268;&#27169;&#20840;&#23616;&#27874;&#21160;&#30697;&#38453;&#20998;&#26512;
&lt;/p&gt;
&lt;p&gt;
Large Global Volatility Matrix Analysis Based on Structural Information. (arXiv:2305.01464v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.01464
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;Structured-POET&#30340;&#26041;&#27861;&#65292;&#23427;&#21487;&#20197;&#21512;&#24182;&#20840;&#29699;&#21644;&#22269;&#23478;&#22240;&#23376;&#27169;&#22411;&#30340;&#32467;&#26500;&#20449;&#24687;&#12290;&#35813;&#26041;&#27861;&#21487;&#20197;&#29992;&#20110;&#20272;&#35745;&#22823;&#27874;&#21160;&#30697;&#38453;&#65292;&#24182;&#24212;&#29992;&#20110;&#22269;&#38469;&#32929;&#31080;&#24066;&#22330;&#25968;&#25454;&#30340;&#26679;&#26412;&#22806;&#32452;&#21512;&#20998;&#37197;&#30340;&#30740;&#31350;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#38024;&#23545;&#20840;&#29699;&#37329;&#34701;&#24066;&#22330;&#24320;&#21457;&#20102;&#19968;&#31181;&#26032;&#30340;&#22823;&#27874;&#21160;&#30697;&#38453;&#20272;&#35745;&#31243;&#24207;&#12290;&#23454;&#36341;&#35777;&#26126;&#65292;&#20174;&#27599;&#21608;&#25110;&#27599;&#26376;&#30340;&#22238;&#25253;&#31561;&#36739;&#20302;&#39057;&#30340;&#25968;&#25454;&#20837;&#25163;&#26159;&#35299;&#20915;&#22269;&#38469;&#37329;&#34701;&#24066;&#22330;&#20132;&#26131;&#26102;&#38388;&#24046;&#24322;&#38382;&#39064;&#30340;&#19968;&#31181;&#26041;&#27861;&#65292;&#20294;&#36825;&#31181;&#26041;&#27861;&#20250;&#30001;&#20110;&#20449;&#24687;&#25439;&#22833;&#23548;&#33268;&#20302;&#25928;&#12290;&#20026;&#20102;&#32531;&#35299;&#36825;&#20010;&#38382;&#39064;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;&#32467;&#26500;&#20027;&#27491;&#20132;&#34917;&#38408;&#20540;(Structured-POET)&#30340;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#21487;&#20197;&#21512;&#24182;&#20840;&#29699;&#21644;&#22269;&#23478;&#22240;&#23376;&#27169;&#22411;&#30340;&#32467;&#26500;&#20449;&#24687;&#12290;&#25105;&#20204;&#24314;&#31435;&#20102;Structured-POET&#20272;&#35745;&#30340;&#28176;&#36817;&#24615;&#36136;&#65292;&#24182;&#35777;&#26126;&#20102;&#22312;&#20351;&#29992;&#20302;&#39057;&#25968;&#25454;&#26102;&#20256;&#32479;&#21327;&#26041;&#24046;&#30697;&#38453;&#20272;&#35745;&#31243;&#24207;&#30340;&#32570;&#28857;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#24212;&#29992;Structured-POET&#20272;&#35745;&#22120;&#21040;&#19968;&#20010;&#20351;&#29992;&#22269;&#38469;&#32929;&#31080;&#24066;&#22330;&#25968;&#25454;&#30340;&#26679;&#26412;&#22806;&#32452;&#21512;&#37197;&#32622;&#30740;&#31350;&#20013;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this paper, we develop a novel large volatility matrix estimation procedure for analyzing global financial markets. Practitioners often use lower-frequency data, such as weekly or monthly returns, to address the issue of different trading hours in the international financial market. However, this approach can lead to inefficiency due to information loss. To mitigate this problem, our proposed method, called Structured Principal Orthogonal complEment Thresholding (Structured-POET), incorporates structural information for both global and national factor models. We establish the asymptotic properties of the Structured-POET estimator, and also demonstrate the drawbacks of conventional covariance matrix estimation procedures when using lower-frequency data. Finally, we apply the Structured-POET estimator to an out-of-sample portfolio allocation study using international stock market data.
&lt;/p&gt;</description></item><item><title>&#35813;&#30740;&#31350;&#20998;&#26512;&#20102;&#19996;&#21335;&#20122;&#20892;&#19994;&#19982;&#31038;&#20250;&#20914;&#31361;&#30340;&#20851;&#32852;&#24615;&#65292;&#21457;&#29616;&#22312;&#31291;&#35895;&#25910;&#33719;&#23395;&#33410;&#20013;&#65292;&#25919;&#27835;&#26292;&#21147;&#22686;&#21152;&#32780;&#31038;&#20250;&#21160;&#33633;&#20943;&#23569;&#12290;&#30740;&#31350;&#25581;&#31034;&#20102;&#25919;&#31574;&#21046;&#23450;&#32773;&#22312;&#20892;&#19994;&#32463;&#27982;&#20013;&#31649;&#29702;&#31038;&#20250;&#20914;&#31361;&#30340;&#24517;&#35201;&#24615;&#12290;</title><link>http://arxiv.org/abs/2304.10027</link><description>&lt;p&gt;
&#19996;&#21335;&#20122;&#20892;&#19994;&#20914;&#20987;&#19982;&#31038;&#20250;&#20914;&#31361;
&lt;/p&gt;
&lt;p&gt;
Agricultural Shocks and Social Conflict in Southeast Asia. (arXiv:2304.10027v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.10027
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#20998;&#26512;&#20102;&#19996;&#21335;&#20122;&#20892;&#19994;&#19982;&#31038;&#20250;&#20914;&#31361;&#30340;&#20851;&#32852;&#24615;&#65292;&#21457;&#29616;&#22312;&#31291;&#35895;&#25910;&#33719;&#23395;&#33410;&#20013;&#65292;&#25919;&#27835;&#26292;&#21147;&#22686;&#21152;&#32780;&#31038;&#20250;&#21160;&#33633;&#20943;&#23569;&#12290;&#30740;&#31350;&#25581;&#31034;&#20102;&#25919;&#31574;&#21046;&#23450;&#32773;&#22312;&#20892;&#19994;&#32463;&#27982;&#20013;&#31649;&#29702;&#31038;&#20250;&#20914;&#31361;&#30340;&#24517;&#35201;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#31038;&#20250;&#20914;&#31361;&#26159;&#19981;&#21487;&#36991;&#20813;&#30340;&#65292;&#20294;&#20854;&#21457;&#29983;&#21644;&#24378;&#24230;&#38543;&#26102;&#38388;&#21644;&#22320;&#28857;&#30340;&#19981;&#21516;&#32780;&#24322;&#12290;&#22312;&#20302;&#25910;&#20837;&#32463;&#27982;&#20307;&#20013;&#65292;&#20892;&#19994;&#23601;&#19994;&#21644;&#25910;&#20837;&#30340;&#37325;&#35201;&#24615;&#36739;&#22823;&#65292;&#25919;&#27835;&#26292;&#21147;&#21644;&#31038;&#20250;&#20914;&#31361;&#21487;&#33021;&#19982;&#35813;&#34892;&#19994;&#30456;&#20851;&#12290;&#25105;&#20204;&#20351;&#29992;&#28085;&#30422;&#19971;&#20010;&#19996;&#21335;&#20122;&#22269;&#23478;13&#24180;&#26399;&#38388;&#30340;&#20914;&#31361;&#25968;&#25454;&#26469;&#30740;&#31350;&#36825;&#31181;&#32852;&#31995;&#12290;&#25105;&#20204;&#37325;&#28857;&#20851;&#27880;&#31291;&#35895;&#25910;&#33719;&#23395;&#33410;&#20013;&#20914;&#31361;&#20107;&#20214;&#30340;&#21464;&#21270;&#65292;&#36825;&#26159;&#35813;&#22320;&#21306;&#29983;&#20135;&#21644;&#28040;&#36153;&#26368;&#22810;&#30340;&#35895;&#29289;&#20316;&#29289;&#12290;&#25105;&#20204;&#35266;&#23519;&#21040;&#22312;&#25910;&#33719;&#23395;&#33410;&#30340;&#31291;&#31859;&#29983;&#20135;&#22320;&#21306;&#65292;&#25919;&#27835;&#26292;&#21147;&#22686;&#21152;&#32780;&#31038;&#20250;&#21160;&#33633;&#20943;&#23569;&#12290;&#36890;&#36807;&#32771;&#34385;&#19982;&#31291;&#35895;&#20215;&#26684;&#21644;&#29983;&#38271;&#23395;&#33410;&#38477;&#38632;&#30456;&#20851;&#30340;&#20914;&#20987;&#65292;&#24182;&#27604;&#36739;&#20027;&#35201;&#26159;&#28748;&#28297;&#19982;&#20027;&#35201;&#26159;&#38632;&#20859;&#31291;&#29983;&#20135;&#23454;&#36341;&#30340;&#22320;&#21306;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#21487;&#33021;&#23548;&#33268;&#36825;&#31181;&#25928;&#26524;&#30340;&#19981;&#21516;&#26426;&#21046;&#12290;&#36825;&#20123;&#21457;&#29616;&#20026;&#25919;&#31574;&#21046;&#23450;&#32773;&#25552;&#20379;&#20102;&#37325;&#35201;&#30340;&#35265;&#35299;&#12290;
&lt;/p&gt;
&lt;p&gt;
Social conflicts are inevitable, but their occurrence and intensity have varied over time and across locations. In lower-income economies, where employment and income from agriculture are substantial, forms of political violence and social conflict may be linked with this sector. We investigate this linkage using granular conflict data covering a 13-year period across seven Southeast Asian countries. We focus on changes in conflict incidents during the rice harvest season, which is the most produced and consumed cereal crop in the region. We observe an increase in political violence but a decrease in social unrest in rice-producing areas during the harvest season. We investigate different plausible mechanisms that may lead to such effects, by incorporating shocks associated with rice prices and growing season rainfall, and by comparing regions with predominantly irrigated vs predominantly rainfed rice production practices. These findings offer important insights to policymakers as they
&lt;/p&gt;</description></item><item><title>&#32654;&#22269;&#20844;&#31435;&#23398;&#26657;&#24341;&#20837;&#30340;&#39044;&#27979;&#31639;&#27861;&#65288;EWS&#65289;&#26410;&#33021;&#25552;&#39640;&#27605;&#19994;&#29575;&#65292;EWS&#20934;&#30830;&#24615;&#39640;&#65292;&#20294;&#29615;&#22659;&#22240;&#32032;&#24433;&#21709;&#26356;&#22823;&#12290;</title><link>http://arxiv.org/abs/2304.06205</link><description>&lt;p&gt;
&#23041;&#26031;&#24247;&#26143;&#20844;&#31435;&#23398;&#26657;&#31038;&#20132;&#39044;&#27979;&#30340;&#22256;&#38590;&#25945;&#35757;
&lt;/p&gt;
&lt;p&gt;
Difficult Lessons on Social Prediction from Wisconsin Public Schools. (arXiv:2304.06205v1 [cs.CY])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.06205
&lt;/p&gt;
&lt;p&gt;
&#32654;&#22269;&#20844;&#31435;&#23398;&#26657;&#24341;&#20837;&#30340;&#39044;&#27979;&#31639;&#27861;&#65288;EWS&#65289;&#26410;&#33021;&#25552;&#39640;&#27605;&#19994;&#29575;&#65292;EWS&#20934;&#30830;&#24615;&#39640;&#65292;&#20294;&#29615;&#22659;&#22240;&#32032;&#24433;&#21709;&#26356;&#22823;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#32654;&#22269;&#20844;&#31435;&#23398;&#26657;&#36817;&#26399;&#24341;&#20837;&#20102;&#39044;&#27979;&#31639;&#27861;&#65288;EWS&#65289;&#26469;&#25552;&#39640;&#27605;&#19994;&#29575;&#12290;&#36825;&#20123;&#31995;&#32479;&#36890;&#36807;&#39044;&#27979;&#21738;&#20123;&#23398;&#29983;&#21487;&#33021;&#36864;&#23398;&#65292;&#24110;&#21161;&#23545;&#20010;&#20307;&#23398;&#29983;&#36827;&#34892;&#24178;&#39044;&#12290;&#34429;&#28982;&#25237;&#36164;&#24040;&#22823;&#65292;&#24471;&#21040;&#24191;&#27867;&#24212;&#29992;&#65292;&#20294;&#23545;EWS&#26377;&#25928;&#24615;&#30340;&#29702;&#35299;&#20173;&#28982;&#23384;&#22312;&#37325;&#22823;&#24046;&#36317;&#12290;&#26412;&#30740;&#31350;&#21033;&#29992;&#23041;&#26031;&#24247;&#26143;&#20840;&#21306;&#30340;&#36817;&#21313;&#24180;&#25968;&#25454;&#65292;&#39318;&#27425;&#23545;EWS&#23545;&#27605;&#19994;&#29575;&#30340;&#38271;&#26399;&#24433;&#21709;&#36827;&#34892;&#22823;&#35268;&#27169;&#35780;&#20272;&#12290;&#25105;&#20204;&#25552;&#20379;&#35777;&#25454;&#34920;&#26126;&#39044;&#27979;&#31995;&#32479;&#25152;&#20570;&#30340;&#39118;&#38505;&#35780;&#20272;&#38750;&#24120;&#20934;&#30830;&#65292;&#29305;&#21035;&#26159;&#23545;&#20110;&#26469;&#33258;&#36793;&#32536;&#21270;&#32972;&#26223;&#30340;&#23398;&#29983;&#12290;&#23613;&#31649;&#35813;&#31995;&#32479;&#20934;&#30830;&#24615;&#39640;&#24182;&#19988;&#24471;&#21040;&#24191;&#27867;&#24212;&#29992;&#65292;&#20294;&#25105;&#20204;&#21457;&#29616;&#27809;&#26377;&#35777;&#25454;&#34920;&#26126;&#23427;&#20250;&#23548;&#33268;&#27605;&#19994;&#29575;&#30340;&#25552;&#39640;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#19968;&#20010;&#24378;&#22823;&#30340;&#32479;&#35745;&#27169;&#24335;&#65292;&#21487;&#20197;&#35299;&#37322;&#20026;&#20160;&#20040;&#36825;&#20123;&#30475;&#20284;&#30683;&#30462;&#30340;&#35265;&#35299;&#23384;&#22312;&#65292;&#21363;&#29615;&#22659;&#22240;&#32032;&#65292;&#20363;&#22914;&#23398;&#29983;&#25152;&#22312;&#23398;&#26657;&#25110;&#31038;&#21306;&#30340;&#36136;&#37327;&#65292;&#28153;&#27809;&#20102;EWS&#23545;&#27605;&#19994;&#29575;&#21487;&#33021;&#20135;&#29983;&#30340;&#20219;&#20309;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
Early warning systems (EWS) are prediction algorithms that have recently taken a central role in efforts to improve graduation rates in public schools across the US. These systems assist in targeting interventions at individual students by predicting which students are at risk of dropping out. Despite significant investments and adoption, there remain significant gaps in our understanding of the efficacy of EWS. In this work, we draw on nearly a decade's worth of data from a system used throughout Wisconsin to provide the first large-scale evaluation of the long-term impact of EWS on graduation outcomes.  We present evidence that risk assessments made by the prediction system are highly accurate, including for students from marginalized backgrounds. Despite the system's accuracy and widespread use, we find no evidence that it has led to improved graduation rates. We surface a robust statistical pattern that can explain why these seemingly contradictory insights hold. Namely, environmen
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21033;&#29992;&#25351;&#26631;&#20805;&#20998;&#24615;&#23454;&#29616;&#21160;&#24577;&#31163;&#25955;&#36873;&#25321;&#27169;&#22411;&#30340;&#24555;&#36895;&#20272;&#31639;&#22120;&#65292;&#36890;&#36807;&#38480;&#21046;&#21442;&#25968;&#31354;&#38388;&#24182;&#38477;&#20302;&#35745;&#31639;&#37327;&#65292;&#36798;&#21040;&#20102;&#24555;&#36895;&#20272;&#31639;&#30340;&#25928;&#26524;&#65292;&#20272;&#31639;&#32467;&#26524;&#19982;&#39640;&#35745;&#31639;&#37327;&#20272;&#31639;&#22120;&#30340;&#28176;&#36817;&#25928;&#26524;&#31561;&#20215;&#12290;&#22312;&#27169;&#22411;&#20013;&#65292;&#25105;&#20204;&#20351;&#29992;&#20102;&#31561;&#24335;&#32422;&#26463;&#65292;&#24182;&#25552;&#20379;&#20102;&#20851;&#20110;&#23376;&#31354;&#38388;&#32500;&#24230;&#30340;&#19968;&#31995;&#21015;&#32467;&#26524;&#12290;&#22312;&#33521;&#22269;&#24555;&#39184;&#24066;&#22330;&#30340;&#23454;&#35777;&#24212;&#29992;&#20013;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#35813;&#26041;&#27861;&#30340;&#20248;&#36234;&#24615;&#12290;</title><link>http://arxiv.org/abs/2304.02171</link><description>&lt;p&gt;
&#21033;&#29992;&#25351;&#26631;&#20805;&#20998;&#24615;&#23454;&#29616;&#21160;&#24577;&#31163;&#25955;&#36873;&#25321;&#27169;&#22411;&#30340;&#24555;&#36895;&#20272;&#31639;
&lt;/p&gt;
&lt;p&gt;
Faster estimation of dynamic discrete choice models using index sufficiency. (arXiv:2304.02171v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.02171
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21033;&#29992;&#25351;&#26631;&#20805;&#20998;&#24615;&#23454;&#29616;&#21160;&#24577;&#31163;&#25955;&#36873;&#25321;&#27169;&#22411;&#30340;&#24555;&#36895;&#20272;&#31639;&#22120;&#65292;&#36890;&#36807;&#38480;&#21046;&#21442;&#25968;&#31354;&#38388;&#24182;&#38477;&#20302;&#35745;&#31639;&#37327;&#65292;&#36798;&#21040;&#20102;&#24555;&#36895;&#20272;&#31639;&#30340;&#25928;&#26524;&#65292;&#20272;&#31639;&#32467;&#26524;&#19982;&#39640;&#35745;&#31639;&#37327;&#20272;&#31639;&#22120;&#30340;&#28176;&#36817;&#25928;&#26524;&#31561;&#20215;&#12290;&#22312;&#27169;&#22411;&#20013;&#65292;&#25105;&#20204;&#20351;&#29992;&#20102;&#31561;&#24335;&#32422;&#26463;&#65292;&#24182;&#25552;&#20379;&#20102;&#20851;&#20110;&#23376;&#31354;&#38388;&#32500;&#24230;&#30340;&#19968;&#31995;&#21015;&#32467;&#26524;&#12290;&#22312;&#33521;&#22269;&#24555;&#39184;&#24066;&#22330;&#30340;&#23454;&#35777;&#24212;&#29992;&#20013;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#35813;&#26041;&#27861;&#30340;&#20248;&#36234;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35768;&#22810;&#20855;&#26377;&#29702;&#24819;&#32479;&#35745;&#24615;&#36136;&#30340;&#21160;&#24577;&#31163;&#25955;&#36873;&#25321;&#27169;&#22411;&#20272;&#31639;&#22120;&#21487;&#33021;&#38656;&#35201;&#22823;&#37327;&#35745;&#31639;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26041;&#27861;&#65292;&#36890;&#36807;&#21033;&#29992;&#25351;&#26631;&#20805;&#20998;&#24615;&#65292;&#22312;&#38480;&#21046;&#21442;&#25968;&#31354;&#38388;&#24182;&#38477;&#20302;&#35745;&#31639;&#37327;&#30340;&#24773;&#20917;&#19979;&#65292;&#24555;&#36895;&#20272;&#31639;&#19968;&#31867;&#24191;&#27867;&#30340;&#21160;&#24577;&#31163;&#25955;&#36873;&#25321;&#38382;&#39064;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#20272;&#31639;&#22120;&#65292;&#35813;&#20272;&#31639;&#22120;&#20351;&#29992;&#31561;&#24335;&#32422;&#26463;&#65292;&#24182;&#26174;&#31034;&#23427;&#28176;&#36817;&#31561;&#25928;&#20110;&#26080;&#32422;&#26463;&#30340;&#39640;&#35745;&#31639;&#37327;&#20272;&#31639;&#22120;&#12290;&#30001;&#20110;&#25105;&#20204;&#25552;&#35758;&#20272;&#31639;&#22120;&#30340;&#35745;&#31639;&#25910;&#30410;&#26159;&#30001;&#38480;&#21046;&#21442;&#25968;&#31354;&#38388;&#33267;&#28385;&#36275;&#31561;&#24335;&#32422;&#26463;&#30340;&#23376;&#31354;&#38388;&#25152;&#33268;&#65292;&#22240;&#27492;&#25105;&#20204;&#25552;&#20379;&#20102;&#19968;&#31995;&#21015;&#20851;&#20110;&#36825;&#20010;&#23376;&#31354;&#38388;&#32500;&#24230;&#30340;&#32467;&#26524;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#36890;&#36807;&#20272;&#31639;&#33521;&#22269;&#24555;&#39184;&#24066;&#22330;&#30340;&#21160;&#24577;&#27169;&#22411;&#26469;&#23637;&#31034;&#25105;&#20204;&#26041;&#27861;&#30340;&#20248;&#21183;&#12290;
&lt;/p&gt;
&lt;p&gt;
Many estimators of dynamic discrete choice models with permanent unobserved heterogeneity have desirable statistical properties but may be computationally intensive. In this paper we propose a method to quicken estimation for a broad class of dynamic discrete choice problems by exploiting index sufficiency. Index sufficiency implies a set of equality constraints which restrict the structural parameter of interest to belong in a subspace of the parameter space. We propose an estimator that uses the equality constraints, and show it is asymptotically equivalent to the unconstrained, computationally heavy estimator. Since the computational gains of our proposed estimator are due to the restriction of the parameter space to the subspace satisfying the equality constraints, we provide a series of results on the dimension of this subspace. Finally, we demonstrate the advantages of our approach by estimating a dynamic model of the U.K. fast food market.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20379;&#20102;&#19968;&#20010;&#22522;&#26412;&#29702;&#35770;&#65292;&#30740;&#31350;&#20102;&#24102;&#26377;&#39640;&#38454;&#20449;&#24687;&#30340;&#26399;&#26435;&#24066;&#22330;&#20013;&#20215;&#26684;&#30340;&#21457;&#29616;&#26426;&#21046;&#12290;&#19982;&#27492;&#21516;&#26102;&#65292;&#35813;&#30740;&#31350;&#36824;&#20197;&#20869;&#24149;&#20132;&#26131;&#30340;&#24418;&#24335;&#21576;&#29616;&#20102;&#20854;&#20013;&#30340;&#29305;&#20363;&#65292;&#32473;&#20986;&#20102;&#36890;&#36135;&#33192;&#32960;&#38656;&#27714;&#12289;&#20215;&#26684;&#20914;&#20987;&#21644;&#20449;&#24687;&#25928;&#29575;&#30340;&#38381;&#24335;&#35299;&#12290;</title><link>http://arxiv.org/abs/2302.13426</link><description>&lt;p&gt;
&#26399;&#26435;&#30340;&#20215;&#26684;&#21457;&#29616;
&lt;/p&gt;
&lt;p&gt;
Price Discovery for Derivatives. (arXiv:2302.13426v5 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2302.13426
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20379;&#20102;&#19968;&#20010;&#22522;&#26412;&#29702;&#35770;&#65292;&#30740;&#31350;&#20102;&#24102;&#26377;&#39640;&#38454;&#20449;&#24687;&#30340;&#26399;&#26435;&#24066;&#22330;&#20013;&#20215;&#26684;&#30340;&#21457;&#29616;&#26426;&#21046;&#12290;&#19982;&#27492;&#21516;&#26102;&#65292;&#35813;&#30740;&#31350;&#36824;&#20197;&#20869;&#24149;&#20132;&#26131;&#30340;&#24418;&#24335;&#21576;&#29616;&#20102;&#20854;&#20013;&#30340;&#29305;&#20363;&#65292;&#32473;&#20986;&#20102;&#36890;&#36135;&#33192;&#32960;&#38656;&#27714;&#12289;&#20215;&#26684;&#20914;&#20987;&#21644;&#20449;&#24687;&#25928;&#29575;&#30340;&#38381;&#24335;&#35299;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36890;&#36807;&#19968;&#20010;&#27169;&#22411;&#65292;&#32771;&#34385;&#20102;&#31169;&#26377;&#20449;&#24687;&#21644;&#39640;&#38454;&#20449;&#24687;&#23545;&#26399;&#26435;&#24066;&#22330;&#20215;&#26684;&#30340;&#24433;&#21709;&#12290;&#27169;&#22411;&#20801;&#35768;&#26377;&#31169;&#26377;&#20449;&#24687;&#30340;&#20132;&#26131;&#32773;&#22312;&#29366;&#24577;-&#32034;&#36180;&#38598;&#24066;&#22330;&#19978;&#20132;&#26131;&#12290;&#31561;&#20215;&#30340;&#26399;&#26435;&#24418;&#24335;&#19979;&#65292;&#25105;&#20204;&#32771;&#34385;&#20102;&#25317;&#26377;&#20851;&#20110;&#22522;&#30784;&#36164;&#20135;&#25910;&#30410;&#30340;&#20998;&#24067;&#30340;&#31169;&#26377;&#20449;&#24687;&#65292;&#24182;&#20801;&#35768;&#20132;&#26131;&#20219;&#24847;&#26399;&#26435;&#32452;&#21512;&#30340;&#25805;&#32437;&#32773;&#12290;&#25105;&#20204;&#24471;&#20986;&#20102;&#36890;&#36135;&#33192;&#32960;&#38656;&#27714;&#12289;&#20215;&#26684;&#20914;&#20987;&#21644;&#20449;&#24687;&#25928;&#29575;&#30340;&#38381;&#24335;&#35299;&#65292;&#36825;&#20123;&#35299;&#25552;&#20379;&#20102;&#20851;&#20110;&#20869;&#24149;&#20132;&#26131;&#30340;&#39640;&#38454;&#20449;&#24687;&#65292;&#22914;&#20219;&#20309;&#32473;&#23450;&#30340;&#26102;&#21051;&#20132;&#26131;&#26399;&#26435;&#31574;&#30053;&#65292;&#24182;&#23558;&#36825;&#20123;&#31574;&#30053;&#27867;&#21270;&#21040;&#20102;&#27874;&#21160;&#29575;&#20132;&#26131;&#31561;&#23454;&#36341;&#39046;&#22495;&#12290;
&lt;/p&gt;
&lt;p&gt;
We obtain a basic theory of price discovery across derivative markets with respect to higher-order information, using a model where an agent with general private information regarding state probabilities is allowed to trade arbitrary portfolios of state-contingent claims. In an equivalent options formulation, the informed agent has private information regarding arbitrary aspects of the payoff distribution of an underlying asset and is allowed to trade arbitrary option portfolios. We characterize, in closed form, the informed demand, price impact, and information efficiency of prices. Our results offer a theory of insider trading on higher moments of the underlying payoff as a special case. The informed demand formula prescribes option strategies for trading on any given moment and extends those used in practice for, e.g. volatility trading.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#38543;&#26426;&#25928;&#29992;&#27169;&#22411;&#21644;&#37325;&#22797;&#36873;&#25321;&#27169;&#22411;&#20013;&#30340;&#28040;&#36153;&#20381;&#36182;&#24615;&#65292;&#25552;&#20986;&#20102;&#20004;&#31181;&#31526;&#21512;&#38543;&#26426;&#25928;&#29992;&#30340;&#39532;&#23572;&#31185;&#22827;&#28040;&#36153;&#20381;&#36182;&#24615;&#29305;&#24449;&#65292;&#24182;&#23545;&#20004;&#26399;&#38543;&#26426;&#36873;&#25321;&#27169;&#22411;&#20013;&#30340;&#28040;&#36153;&#20381;&#36182;&#24615;&#36827;&#34892;&#20102;&#34892;&#20026;&#20869;&#23481;&#30340;&#29305;&#24449;&#21270;&#12290;</title><link>http://arxiv.org/abs/2302.05806</link><description>&lt;p&gt;
&#38543;&#26426;&#25928;&#29992;&#12289;&#37325;&#22797;&#36873;&#25321;&#21644;&#28040;&#36153;&#20381;&#36182;&#24615;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Random Utility, Repeated Choice, and Consumption Dependence. (arXiv:2302.05806v3 [econ.TH] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2302.05806
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#38543;&#26426;&#25928;&#29992;&#27169;&#22411;&#21644;&#37325;&#22797;&#36873;&#25321;&#27169;&#22411;&#20013;&#30340;&#28040;&#36153;&#20381;&#36182;&#24615;&#65292;&#25552;&#20986;&#20102;&#20004;&#31181;&#31526;&#21512;&#38543;&#26426;&#25928;&#29992;&#30340;&#39532;&#23572;&#31185;&#22827;&#28040;&#36153;&#20381;&#36182;&#24615;&#29305;&#24449;&#65292;&#24182;&#23545;&#20004;&#26399;&#38543;&#26426;&#36873;&#25321;&#27169;&#22411;&#20013;&#30340;&#28040;&#36153;&#20381;&#36182;&#24615;&#36827;&#34892;&#20102;&#34892;&#20026;&#20869;&#23481;&#30340;&#29305;&#24449;&#21270;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;&#38543;&#26426;&#36873;&#25321;&#30340;&#37325;&#22797;&#36873;&#25321;&#35299;&#37322;&#21644;&#38543;&#26426;&#25928;&#29992;&#27169;&#22411;&#30340;&#20010;&#20307;&#35299;&#37322;&#12290;&#25105;&#20204;&#32771;&#34385;&#20102;&#19968;&#20010;&#30446;&#20809;&#30701;&#27973;&#30340;&#20195;&#29702;&#20154;&#65292;&#20182;&#20204;&#26126;&#22825;&#30340;&#20559;&#22909;&#20998;&#24067;&#21487;&#33021;&#21462;&#20915;&#20110;&#20170;&#22825;&#30340;&#28040;&#36153;&#21644;&#20559;&#22909;&#12290;&#21363;&#20351;&#20195;&#29702;&#20154;&#22312;&#27599;&#20010;&#38745;&#24577;&#20915;&#31574;&#20013;&#37117;&#26159;&#32463;&#20856;&#30340;&#29702;&#24615;&#65292;&#20063;&#23384;&#22312;&#19968;&#20123;&#19982;&#38543;&#26426;&#25928;&#29992;&#20316;&#20026;&#36328;&#26102;&#38388;&#32858;&#21512;&#27169;&#22411;&#19981;&#19968;&#33268;&#30340;&#28040;&#36153;&#20381;&#36182;&#24418;&#24335;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#20004;&#20010;&#39532;&#23572;&#31185;&#22827;&#28040;&#36153;&#20381;&#36182;&#24615;&#30340;&#29305;&#24449;&#65292;&#36825;&#20123;&#29305;&#24449;&#19982;&#38543;&#26426;&#25928;&#29992;&#26159;&#19968;&#33268;&#30340;&#12290;&#36827;&#19968;&#27493;&#22320;&#65292;&#25105;&#20204;&#23545;&#20004;&#26399;&#38543;&#26426;&#36873;&#25321;&#27169;&#22411;&#20013;&#30340;&#28040;&#36153;&#20381;&#36182;&#24615;&#36827;&#34892;&#20102;&#34892;&#20026;&#20869;&#23481;&#30340;&#29305;&#24449;&#21270;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study the repeated choice interpretation of stochastic choice and the individual interpretation of the random utility model. We consider a myopic agent whose distribution over preferences tomorrow potentially depends on their consumption and preference today. Even when the agent is classically rational in each of their static decisions, there are forms of consumption dependence which are inconsistent with random utility as a model of intertemporal aggregation. We offer two characterizations of Markovian consumption dependence which are consistent with random utility. Further, we characterize the behavioral content of consumption dependence in a two period stochastic choice model.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#30740;&#31350;&#20102;&#22312;&#20165;&#23545;&#37096;&#20998;&#20154;&#21592;&#36827;&#34892;&#22788;&#29702;&#30340;&#23454;&#39564;&#20013;&#20272;&#35745;&#22788;&#29702;&#20840;&#20307;&#25104;&#21592;&#24179;&#22343;&#25928;&#24212;&#30340;&#38382;&#39064;&#65292;&#24182;&#25552;&#20379;&#20102;&#19968;&#31181;&#21487;&#23454;&#29616;&#26368;&#20248;&#25910;&#25947;&#29575;&#30340;&#35774;&#35745;&#12290;</title><link>http://arxiv.org/abs/2209.14181</link><description>&lt;p&gt;
&#32447;&#24615;&#20272;&#35745;&#20840;&#23616;&#24179;&#22343;&#25928;&#24212;
&lt;/p&gt;
&lt;p&gt;
Linear estimation of average global effects. (arXiv:2209.14181v4 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2209.14181
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#30740;&#31350;&#20102;&#22312;&#20165;&#23545;&#37096;&#20998;&#20154;&#21592;&#36827;&#34892;&#22788;&#29702;&#30340;&#23454;&#39564;&#20013;&#20272;&#35745;&#22788;&#29702;&#20840;&#20307;&#25104;&#21592;&#24179;&#22343;&#25928;&#24212;&#30340;&#38382;&#39064;&#65292;&#24182;&#25552;&#20379;&#20102;&#19968;&#31181;&#21487;&#23454;&#29616;&#26368;&#20248;&#25910;&#25947;&#29575;&#30340;&#35774;&#35745;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#22312;&#20165;&#23545;&#20854;&#20013;&#19968;&#37096;&#20998;&#25104;&#21592;&#36827;&#34892;&#22788;&#29702;&#30340;&#23454;&#39564;&#20013;&#20272;&#35745;&#20840;&#20307;&#25104;&#21592;&#24179;&#22343;&#22240;&#26524;&#25928;&#24212;&#30340;&#38382;&#39064;&#12290;&#36825;&#26159;&#22312;&#26681;&#25454;RCT&#30340;&#32467;&#26524;&#20915;&#23450;&#26159;&#21542;&#25193;&#22823;&#24178;&#39044;&#25514;&#26045;&#26102;&#19982;&#25919;&#31574;&#30456;&#20851;&#30340;&#20272;&#35745;&#37327;&#65292;&#20294;&#22312;&#23384;&#22312;&#28322;&#20986;&#25928;&#24212;&#26102;&#19982;&#36890;&#24120;&#30340;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#26377;&#25152;&#19981;&#21516;&#12290;&#25105;&#20204;&#32771;&#34385;&#20102;&#22312;&#28322;&#20986;&#25928;&#24212;&#19982;&#21333;&#20301;&#20043;&#38388;``&#36317;&#31163;''&#34928;&#20943;&#30340;&#36895;&#29575;&#34987;&#19968;&#20010;&#21442;&#25968;&#21270;&#30340;&#30028;&#38480;&#65288;&#30001;$\eta &gt; 0$&#21442;&#25968;&#21270;&#65289;&#32473;&#20986;&#30340;&#24773;&#20917;&#19979;&#30340;&#20272;&#35745;&#21644;&#23454;&#39564;&#35774;&#35745;&#65292;&#36825;&#20010;&#36317;&#31163;&#20197;&#24191;&#20041;&#26041;&#24335;&#23450;&#20041;&#65292;&#21253;&#25324;&#31354;&#38388;&#21644;&#20934;&#31354;&#38388;&#30340;&#35774;&#32622;&#65292;&#20363;&#22914;&#65292;&#22312;&#32463;&#27982;&#30456;&#20851;&#30340;&#36317;&#31163;&#27010;&#24565;&#26159;&#19968;&#20010;&#37325;&#21147;&#26041;&#31243;&#30340;&#24773;&#20917;&#19979;&#12290;&#22312;&#25152;&#26377;&#20197;&#32467;&#26524;&#20026;&#32447;&#24615;&#20272;&#35745;&#37327;&#21644;&#25152;&#26377;&#38598;&#32676;&#38543;&#26426;&#21270;&#35774;&#35745;&#20013;&#65292;&#26368;&#20248;&#20960;&#20309;&#25910;&#25947;&#29575;&#26159;$n^{-\frac{1}{2+\frac{1}{\eta}}}$&#65292;&#24182;&#19988;&#21487;&#20197;&#20351;&#29992;&#25105;&#20204;&#25552;&#20379;&#30340;&#24191;&#20041;``Scaling Clusters''&#35774;&#35745;&#26469;&#23454;&#29616;&#36825;&#20010;&#25910;&#25947;&#29575;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#39069;&#22806;&#30340;&#20551;&#35774;...
&lt;/p&gt;
&lt;p&gt;
We study the problem of estimating the average causal effect of treating every member of a population, as opposed to none, using an experiment that treats only some. This is the policy-relevant estimand when deciding whether to scale up an intervention based on the results of an RCT, for example, but differs from the usual average treatment effect in the presence of spillovers. We consider both estimation and experimental design given a bound (parametrized by $\eta &gt; 0$) on the rate at which spillovers decay with the ``distance'' between units, defined in a generalized way to encompass spatial and quasi-spatial settings, e.g. where the economically relevant concept of distance is a gravity equation. Over all estimators linear in the outcomes and all cluster-randomized designs the optimal geometric rate of convergence is $n^{-\frac{1}{2+\frac{1}{\eta}}}$, and this rate can be achieved using a generalized ``Scaling Clusters'' design that we provide. We then introduce the additional assum
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#24191;&#20041;&#39030;&#28857;&#30528;&#33394;&#28216;&#25103;&#65288;G-VCGs&#65289;&#20013;&#30340;&#25928;&#29992;&#26368;&#22823;&#21270;&#31119;&#21033;&#20248;&#21270;&#38382;&#39064;&#65292;&#25506;&#35752;&#20102;&#30456;&#21516;&#20559;&#22909;&#30340;VCGs&#24773;&#20917;&#19979;&#30340;&#25910;&#25947;&#24615;&#21644;&#25928;&#29575;&#65292;&#20197;&#21450;&#37319;&#29992;&#36138;&#23146;&#24335;&#30340;&#25193;&#23637;&#21327;&#35758;&#20248;&#21270;&#27169;&#22411;&#30340;&#25910;&#25947;&#24615;&#21644;&#25928;&#29575;&#12290;</title><link>http://arxiv.org/abs/2206.09153</link><description>&lt;p&gt;
&#24191;&#20041;&#39030;&#28857;&#30528;&#33394;&#28216;&#25103;&#20013;&#30340;&#25928;&#29992;&#26368;&#22823;&#21270;&#31119;&#21033;&#20248;&#21270;&#65306;&#23545;&#27963;&#21160;&#35268;&#21010;&#20013;&#22330;&#22320;&#36873;&#25321;&#30340;&#24847;&#20041;
&lt;/p&gt;
&lt;p&gt;
Utilitarian Welfare Optimization in the Generalized Vertex Coloring Games: An Implication to Venue Selection in Events Planning. (arXiv:2206.09153v4 [cs.DM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2206.09153
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#24191;&#20041;&#39030;&#28857;&#30528;&#33394;&#28216;&#25103;&#65288;G-VCGs&#65289;&#20013;&#30340;&#25928;&#29992;&#26368;&#22823;&#21270;&#31119;&#21033;&#20248;&#21270;&#38382;&#39064;&#65292;&#25506;&#35752;&#20102;&#30456;&#21516;&#20559;&#22909;&#30340;VCGs&#24773;&#20917;&#19979;&#30340;&#25910;&#25947;&#24615;&#21644;&#25928;&#29575;&#65292;&#20197;&#21450;&#37319;&#29992;&#36138;&#23146;&#24335;&#30340;&#25193;&#23637;&#21327;&#35758;&#20248;&#21270;&#27169;&#22411;&#30340;&#25910;&#25947;&#24615;&#21644;&#25928;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#32771;&#34385;&#32593;&#32476;&#20013;&#19968;&#31867;&#22810;&#26234;&#33021;&#20307;&#28216;&#25103;&#65292;&#21363;&#24191;&#20041;&#39030;&#28857;&#30528;&#33394;&#28216;&#25103;&#65288;G-VCGs&#65289;&#65292;&#21463;&#21040;&#27963;&#21160;&#35268;&#21010;&#20013;&#22330;&#22320;&#36873;&#25321;&#38382;&#39064;&#30340;&#23454;&#38469;&#24212;&#29992;&#30340;&#21551;&#21457;&#12290;&#27599;&#20010;&#26234;&#33021;&#20307;&#22312;&#26576;&#31181;&#29305;&#23450;&#26426;&#21046;&#19979;&#23545;&#24403;&#21069;&#30340;&#30528;&#33394;&#20998;&#37197;&#20250;&#25910;&#21040;&#19968;&#23450;&#25928;&#29992;&#65292;&#20182;&#20204;&#22312;&#36873;&#25321;&#21478;&#19968;&#31181;&#39068;&#33394;&#26102;&#21463;&#38480;&#20110;&#23616;&#37096;&#20449;&#24687;&#65292;&#22240;&#27492;&#22312;&#36861;&#27714;&#33258;&#36523;&#25928;&#29992;&#26368;&#22823;&#21270;&#30340;&#21516;&#26102;&#36827;&#34892;&#33258;&#32452;&#32455;&#12290;&#25105;&#20204;&#30340;&#37325;&#28857;&#26159;&#20197;&#20998;&#25955;&#30340;&#26041;&#24335;&#26368;&#22823;&#21270;&#32593;&#32476;&#20013;&#32047;&#31215;&#25928;&#29992;&#30340;&#26576;&#31181;&#25928;&#29992;&#26368;&#20248;&#21270;&#30446;&#26631;&#20989;&#25968;&#12290;&#39318;&#20808;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;G-VCGs&#30340;&#19968;&#31867;&#29305;&#27530;&#24773;&#20917;&#65292;&#21363;&#30456;&#21516;&#20559;&#22909;&#30340;VCGs&#65288;IP-VCGs&#65289;&#65292;&#35813;&#24773;&#20917;&#19979;&#24674;&#22797;&#20102;\cite{chaudhuri2008network}&#30340;&#22522;&#30784;&#24037;&#20316;&#12290;&#25105;&#20204;&#25581;&#31034;&#20102;&#20854;&#22312;&#23436;&#20840;&#36138;&#23146;&#31574;&#30053;&#21644;&#23436;&#20840;&#21516;&#27493;&#35774;&#32622;&#19979;&#30340;&#25910;&#25947;&#24615;&#65292;&#24182;&#25552;&#20379;&#20102;&#19968;&#20010;&#25910;&#25947;&#36895;&#29575;&#30340;&#38543;&#26426;&#30028;&#38480;&#12290;&#20854;&#27425;&#65292;&#23545;&#20110;&#19968;&#33324;&#30340;G-VCGs&#65292;&#37319;&#29992;&#36138;&#23146;&#24335;&#30340;&#25193;&#23637;&#21327;&#35758;&#65292;&#25105;&#20204;&#25506;&#35752;&#20102;&#30456;&#24212;&#30340;&#25928;&#29992;&#20248;&#21270;&#27169;&#22411;&#26694;&#26550;&#30340;&#25910;&#25947;&#24615;&#21644;&#25928;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;
We consider a general class of multi-agent games in networks, namely the generalized vertex coloring games (G-VCGs), inspired by real-life applications of the venue selection problem in events planning. Certain utility responding to the contemporary coloring assignment will be received by each agent under some particular mechanism, who, striving to maximize his own utility, is restricted to local information thus self-organizing when choosing another color. Our focus is on maximizing some utilitarian-looking welfare objective function concerning the cumulative utilities across the network in a decentralized fashion. Firstly, we investigate on a special class of the G-VCGs, namely Identical Preference VCGs (IP-VCGs) which recovers the rudimentary work by \cite{chaudhuri2008network}. We reveal its convergence even under a completely greedy policy and completely synchronous settings, with a stochastic bound on the converging rate provided. Secondly, regarding the general G-VCGs, a greedin
&lt;/p&gt;</description></item><item><title>&#35770;&#25991;&#30740;&#31350;&#20102;&#22870;&#21169;&#21644;&#31454;&#20105;&#23545;&#31454;&#36187;&#21162;&#21147;&#30340;&#24433;&#21709;&#65292;&#26681;&#25454;&#20154;&#21475;&#20013;&#33021;&#21147;&#20998;&#24067;&#30340;&#20004;&#20010;&#33258;&#28982;&#20805;&#20998;&#26465;&#20214;&#65292;&#21457;&#29616;&#21162;&#21147;&#26377;&#26102;&#20250;&#21463;&#21040;&#40723;&#21169;&#65292;&#26377;&#26102;&#20250;&#21463;&#21040;&#20943;&#23569;&#65292;&#36824;&#35752;&#35770;&#20102;&#19977;&#31181;&#19981;&#21516;&#29615;&#22659;&#19979;&#20248;&#21270;&#31454;&#36187;&#35774;&#35745;&#30340;&#24212;&#29992;&#12290;</title><link>http://arxiv.org/abs/2205.05207</link><description>&lt;p&gt;
&#24102;&#26377;&#31169;&#26377;&#20449;&#24687;&#21442;&#36187;&#32773;&#30340;&#31454;&#36187;&#20013;&#30340;&#22870;&#21169;&#21644;&#21162;&#21147;
&lt;/p&gt;
&lt;p&gt;
Prizes and effort in contests with private information. (arXiv:2205.05207v4 [cs.GT] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2205.05207
&lt;/p&gt;
&lt;p&gt;
&#35770;&#25991;&#30740;&#31350;&#20102;&#22870;&#21169;&#21644;&#31454;&#20105;&#23545;&#31454;&#36187;&#21162;&#21147;&#30340;&#24433;&#21709;&#65292;&#26681;&#25454;&#20154;&#21475;&#20013;&#33021;&#21147;&#20998;&#24067;&#30340;&#20004;&#20010;&#33258;&#28982;&#20805;&#20998;&#26465;&#20214;&#65292;&#21457;&#29616;&#21162;&#21147;&#26377;&#26102;&#20250;&#21463;&#21040;&#40723;&#21169;&#65292;&#26377;&#26102;&#20250;&#21463;&#21040;&#20943;&#23569;&#65292;&#36824;&#35752;&#35770;&#20102;&#19977;&#31181;&#19981;&#21516;&#29615;&#22659;&#19979;&#20248;&#21270;&#31454;&#36187;&#35774;&#35745;&#30340;&#24212;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#32771;&#34385;&#31454;&#36187;&#65292;&#21442;&#36187;&#32773;&#25317;&#26377;&#20851;&#20110;&#33258;&#24049;&#33021;&#21147;&#30340;&#31169;&#20154;&#20449;&#24687;&#65292;&#31454;&#36187;&#35774;&#35745;&#32773;&#21487;&#20197;&#25805;&#32437;&#19981;&#21516;&#22870;&#21169;&#30340;&#20215;&#20540;&#26469;&#24433;&#21709;&#21162;&#21147;&#12290;&#25105;&#20204;&#30740;&#31350;&#20102;&#20004;&#31181;&#19981;&#21516;&#24178;&#39044;&#25514;&#26045;&#23545;&#21162;&#21147;&#30340;&#24433;&#21709;&#65306;&#25552;&#39640;&#22870;&#21169;&#20215;&#20540;&#21644;&#22686;&#21152;&#31454;&#20105;&#65288;&#23558;&#20215;&#20540;&#20174;&#36739;&#24046;&#30340;&#22870;&#39033;&#36716;&#31227;&#21040;&#36739;&#22909;&#30340;&#22870;&#39033;&#65289;&#12290;&#25105;&#20204;&#30830;&#23450;&#20102;&#20154;&#21475;&#20013;&#33021;&#21147;&#20998;&#24067;&#30340;&#20004;&#20010;&#33258;&#28982;&#20805;&#20998;&#26465;&#20214;&#65292;&#36825;&#20004;&#20010;&#26465;&#20214;&#20351;&#24471;&#20004;&#31181;&#24178;&#39044;&#25514;&#26045;&#23545;&#21162;&#21147;&#20135;&#29983;&#30456;&#21453;&#30340;&#24433;&#21709;&#12290;&#26356;&#20855;&#20307;&#22320;&#65292;&#25105;&#20204;&#21457;&#29616;&#65292;&#22914;&#26524;&#20195;&#29702;&#21830;&#30340;&#23494;&#24230;&#38543;&#30528;&#33021;&#21147;&#30340;&#38477;&#20302;&#32780;&#20943;&#23567;&#65292;&#22240;&#27492;&#38750;&#29983;&#20135;&#24615;&#20195;&#29702;&#21830;&#27604;&#29983;&#20135;&#24615;&#20195;&#29702;&#21830;&#26356;&#26377;&#21487;&#33021;&#65292;&#37027;&#20040;&#36825;&#20004;&#31181;&#24178;&#39044;&#25514;&#26045;&#23558;&#40723;&#21169;&#21162;&#21147;&#12290;&#32780;&#22914;&#26524;&#36825;&#20010;&#23494;&#24230;&#26159;&#33021;&#21147;&#21333;&#35843;&#22686;&#21152;&#30340;&#65292;&#36825;&#20004;&#31181;&#24178;&#39044;&#25514;&#26045;&#20250;&#20943;&#23569;&#21162;&#21147;&#12290;&#25105;&#20204;&#36824;&#35752;&#35770;&#20102;&#19977;&#31181;&#19981;&#21516;&#29615;&#22659;&#19979;&#20248;&#21270;&#31454;&#36187;&#35774;&#35745;&#30340;&#24212;&#29992;&#65292;&#21253;&#25324;&#35780;&#20998;&#31454;&#36187;&#30340;&#35774;&#35745;&#12290;&#25105;&#20204;&#20551;&#35774;&#19968;&#20010;&#31561;&#32423;&#30340;&#20215;&#20540;&#26159;&#36890;&#36807;&#20449;&#24687;&#26469;&#30830;&#23450;&#30340;&#65292;&#35813;&#20449;&#24687;&#25581;&#31034;&#20102;&#26377;&#20851;&#20195;&#29702;&#21830;&#33021;&#21147;&#30340;&#20449;&#24687;&#12290;
&lt;/p&gt;
&lt;p&gt;
We consider contests where participants have private information about their ability and the contest designer can manipulate the values of different prizes to influence effort. We study the effect on effort of two different interventions: increase in the value of prizes and increase in competition (transfer of value from worse to better prizes). We identify two natural sufficient conditions on the distribution of abilities in the population under which both interventions have opposite effects on effort. More precisely, we find that if the density of agents is decreasing in ability so that unproductive agents are more likely than productive agents, the two interventions encourage effort. And if this density is monotone increasing in ability, the interventions discourage effort. We discuss applications to the design of optimal contests in three different environments, including the design of grading contests. Assuming the value of a grade is determined by the information it reveals about
&lt;/p&gt;</description></item><item><title>&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#20351;&#29992;&#21327;&#21464;&#37327;&#27979;&#35797;&#20202;&#22120;&#26377;&#25928;&#24615;&#30340;&#26032;&#26041;&#27861;&#65292;&#24182;&#24212;&#29992;&#20110;&#24322;&#36136;&#22788;&#29702;&#25928;&#24212;&#27169;&#22411;&#12290;&#36890;&#36807;&#32852;&#21512;&#27979;&#35797;&#32422;&#26463;&#21644;&#20351;&#29992;&#20462;&#21098;&#26679;&#26412;&#26469;&#25552;&#39640;&#21151;&#25928;&#65292;&#25105;&#20204;&#21457;&#29616;&#20102;&#21487;&#34892;&#30340;&#37096;&#20998;&#27531;&#24046;&#23376;&#23494;&#24230;&#20043;&#38388;&#30340;&#31561;&#24335;&#21644;&#19981;&#31561;&#24335;&#32422;&#26463;&#65292;&#24182;&#23545;&#19968;&#20010;&#20551;&#35774;&#30340;&#20202;&#22120;&#36827;&#34892;&#20102;&#25298;&#32477;&#12290;</title><link>http://arxiv.org/abs/2112.08092</link><description>&lt;p&gt;
&#20351;&#29992;&#21327;&#21464;&#37327;&#27979;&#35797;&#20202;&#22120;&#26377;&#25928;&#24615;
&lt;/p&gt;
&lt;p&gt;
Testing Instrument Validity with Covariates. (arXiv:2112.08092v2 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2112.08092
&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#20351;&#29992;&#21327;&#21464;&#37327;&#27979;&#35797;&#20202;&#22120;&#26377;&#25928;&#24615;&#30340;&#26032;&#26041;&#27861;&#65292;&#24182;&#24212;&#29992;&#20110;&#24322;&#36136;&#22788;&#29702;&#25928;&#24212;&#27169;&#22411;&#12290;&#36890;&#36807;&#32852;&#21512;&#27979;&#35797;&#32422;&#26463;&#21644;&#20351;&#29992;&#20462;&#21098;&#26679;&#26412;&#26469;&#25552;&#39640;&#21151;&#25928;&#65292;&#25105;&#20204;&#21457;&#29616;&#20102;&#21487;&#34892;&#30340;&#37096;&#20998;&#27531;&#24046;&#23376;&#23494;&#24230;&#20043;&#38388;&#30340;&#31561;&#24335;&#21644;&#19981;&#31561;&#24335;&#32422;&#26463;&#65292;&#24182;&#23545;&#19968;&#20010;&#20551;&#35774;&#30340;&#20202;&#22120;&#36827;&#34892;&#20102;&#25298;&#32477;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#27979;&#35797;&#26041;&#27861;&#65292;&#29992;&#20110;&#20855;&#26377;&#26465;&#20214;&#21327;&#21464;&#37327;&#30340;&#24322;&#36136;&#22788;&#29702;&#25928;&#24212;&#27169;&#22411;&#30340;&#20202;&#22120;&#21464;&#37327;&#35782;&#21035;&#20551;&#35774;&#12290;&#25105;&#20204;&#20551;&#35774;&#28508;&#22312;&#32467;&#26524;&#19982;&#26465;&#20214;&#21327;&#21464;&#37327;&#20043;&#38388;&#23384;&#22312;&#21322;&#21442;&#25968;&#20381;&#36182;&#20851;&#31995;&#12290;&#36825;&#20351;&#24471;&#25105;&#20204;&#33021;&#22815;&#33719;&#24471;&#21487;&#20272;&#35745;&#37096;&#20998;&#27531;&#24046;&#30340;&#23376;&#23494;&#24230;&#20043;&#38388;&#30340;&#21487;&#27979;&#35797;&#30340;&#31561;&#24335;&#21644;&#19981;&#31561;&#24335;&#32422;&#26463;&#12290;&#25105;&#20204;&#24314;&#35758;&#32852;&#21512;&#27979;&#35797;&#36825;&#20123;&#32422;&#26463;&#12290;&#20026;&#20102;&#25552;&#39640;&#21151;&#25928;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#8220;&#25552;&#21462;&#27861;&#8221;&#65292;&#21363;&#20351;&#29992;&#20462;&#21098;&#26679;&#26412;&#26469;&#27979;&#35797;&#19981;&#31561;&#24335;&#32422;&#26463;&#12290;&#22312;&#33945;&#29305;&#21345;&#32599;&#23454;&#39564;&#20013;&#65292;&#25105;&#20204;&#21457;&#29616;&#32852;&#21512;&#27979;&#35797;&#32422;&#26463;&#21644;&#25552;&#21462;&#27861;&#33021;&#22815;&#25552;&#39640;&#26377;&#38480;&#26679;&#26412;&#21151;&#25928;&#12290;&#25105;&#20204;&#23558;&#25105;&#20204;&#30340;&#27979;&#35797;&#31243;&#24207;&#24212;&#29992;&#20110;&#19977;&#20010;&#20202;&#22120;&#65292;&#24182;&#25298;&#32477;&#20102;&#19968;&#20010;&#20551;&#35774;&#30340;&#38646;&#20551;&#35774;&#12290;
&lt;/p&gt;
&lt;p&gt;
We develop a novel test of the instrumental variable identifying assumptions for heterogeneous treatment effect models with conditioning covariates. We assume semiparametric dependence between potential outcomes and conditioning covariates. This allows us to obtain testable equality and inequality restrictions among the subdensities of estimable partial residuals. We propose jointly testing these restrictions. To improve power, we introduce distillation, where a trimmed sample is used to test the inequality restrictions. In Monte Carlo exercises we find gains in finite sample power from testing restrictions jointly and distillation. We apply our test procedure to three instruments and reject the null for one.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#23545;&#20107;&#20214;&#30740;&#31350;&#35774;&#35745;&#25552;&#20986;&#20102;&#31283;&#20581;&#19988;&#39640;&#25928;&#30340;&#20272;&#35745;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#36866;&#29992;&#20110;&#26102;&#38388;&#21464;&#21270;&#30340;&#25511;&#21046;&#21464;&#37327;&#12289;&#19977;&#37325;&#24046;&#24322;&#35774;&#35745;&#21644;&#26576;&#20123;&#38750;&#20108;&#36827;&#21046;&#27835;&#30103;&#12290;&#22312;&#24212;&#29992;&#30740;&#31350;&#20013;&#65292;&#30740;&#31350;&#32654;&#22269;&#31246;&#21153;&#22238;&#25187;&#23545;&#28040;&#36153;&#21453;&#24212;&#26102;&#65292;&#21457;&#29616;&#21517;&#20041;&#28040;&#36153;&#20542;&#21521;&#36793;&#38469;&#32422;&#20026;&#25991;&#29486;&#20013;&#20272;&#35745;&#20540;&#30340;&#19968;&#21322;&#12290;</title><link>http://arxiv.org/abs/2108.12419</link><description>&lt;p&gt;
&#37325;&#26032;&#23457;&#35270;&#20107;&#20214;&#30740;&#31350;&#35774;&#35745;&#65306;&#31283;&#20581;&#19988;&#39640;&#25928;&#30340;&#20272;&#35745;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Revisiting Event Study Designs: Robust and Efficient Estimation. (arXiv:2108.12419v3 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2108.12419
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#23545;&#20107;&#20214;&#30740;&#31350;&#35774;&#35745;&#25552;&#20986;&#20102;&#31283;&#20581;&#19988;&#39640;&#25928;&#30340;&#20272;&#35745;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#36866;&#29992;&#20110;&#26102;&#38388;&#21464;&#21270;&#30340;&#25511;&#21046;&#21464;&#37327;&#12289;&#19977;&#37325;&#24046;&#24322;&#35774;&#35745;&#21644;&#26576;&#20123;&#38750;&#20108;&#36827;&#21046;&#27835;&#30103;&#12290;&#22312;&#24212;&#29992;&#30740;&#31350;&#20013;&#65292;&#30740;&#31350;&#32654;&#22269;&#31246;&#21153;&#22238;&#25187;&#23545;&#28040;&#36153;&#21453;&#24212;&#26102;&#65292;&#21457;&#29616;&#21517;&#20041;&#28040;&#36153;&#20542;&#21521;&#36793;&#38469;&#32422;&#20026;&#25991;&#29486;&#20013;&#20272;&#35745;&#20540;&#30340;&#19968;&#21322;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#31181;&#24046;&#24322;&#27861;&#21644;&#38169;&#33853;&#25910;&#27835;&#37319;&#29992;&#30340;&#35774;&#35745;&#26694;&#26550;&#65292;&#32771;&#34385;&#21040;&#24322;&#36136;&#24615;&#22240;&#26524;&#25928;&#24212;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#20256;&#32479;&#30340;&#22522;&#20110;&#22238;&#24402;&#30340;&#20272;&#35745;&#26041;&#27861;&#22312;&#27809;&#26377;&#24378;&#21046;&#35201;&#27714;&#27835;&#30103;&#25928;&#24212;&#21516;&#36136;&#24615;&#26102;&#26080;&#27861;&#25552;&#20379;&#30456;&#20851;&#20272;&#35745;&#30340;&#26080;&#20559;&#20272;&#35745;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#25512;&#23548;&#20102;&#19968;&#31181;&#35299;&#20915;&#36825;&#19968;&#25361;&#25112;&#30340;&#26377;&#25928;&#20272;&#35745;&#26041;&#27861;&#65292;&#24403;&#27835;&#30103;&#25928;&#24212;&#30340;&#24322;&#36136;&#24615;&#26410;&#21463;&#38480;&#21046;&#26102;&#65292;&#35813;&#26041;&#27861;&#20855;&#26377;&#30452;&#35266;&#30340;&#8220;&#25554;&#34917;&#8221;&#24418;&#24335;&#12290;&#25105;&#20204;&#34920;&#24449;&#20102;&#35813;&#20272;&#35745;&#22120;&#30340;&#28176;&#36817;&#34892;&#20026;&#65292;&#25552;&#20986;&#20102;&#25512;&#26029;&#24037;&#20855;&#65292;&#24182;&#24320;&#23637;&#20102;&#29992;&#20110;&#35782;&#21035;&#20551;&#35774;&#30340;&#27979;&#35797;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#36866;&#29992;&#20110;&#26377;&#26102;&#38388;&#21464;&#21270;&#30340;&#25511;&#21046;&#21464;&#37327;&#12289;&#19977;&#37325;&#24046;&#24322;&#35774;&#35745;&#21644;&#26576;&#20123;&#38750;&#20108;&#36827;&#21046;&#27835;&#30103;&#12290;&#36890;&#36807;&#27169;&#25311;&#30740;&#31350;&#21644;&#19968;&#20010;&#24212;&#29992;&#30740;&#31350;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#25105;&#20204;&#32467;&#26524;&#30340;&#23454;&#38469;&#30456;&#20851;&#24615;&#12290;&#22312;&#30740;&#31350;&#32654;&#22269;&#31246;&#21153;&#22238;&#25187;&#23545;&#28040;&#36153;&#21453;&#24212;&#26102;&#65292;&#25105;&#20204;&#21457;&#29616;&#65292;&#22312;&#31532;&#19968;&#23395;&#24230;&#65292;&#21517;&#20041;&#28040;&#36153;&#20542;&#21521;&#36793;&#38469;&#22312;8%&#21040;11%&#20043;&#38388;&#65292;&#22823;&#32422;&#26159;&#25991;&#29486;&#20013;&#20272;&#35745;&#20540;&#30340;&#19968;&#21322;&#12290;
&lt;/p&gt;
&lt;p&gt;
We develop a framework for difference-in-differences designs with staggered treatment adoption and heterogeneous causal effects. We show that conventional regression-based estimators fail to provide unbiased estimates of relevant estimands absent strong restrictions on treatment-effect homogeneity. We then derive the efficient estimator addressing this challenge, which takes an intuitive "imputation" form when treatment-effect heterogeneity is unrestricted. We characterize the asymptotic behavior of the estimator, propose tools for inference, and develop tests for identifying assumptions. Our method applies with time-varying controls, in triple-difference designs, and with certain non-binary treatments. We show the practical relevance of our results in a simulation study and an application. Studying the consumption response to tax rebates in the United States, we find that the notional marginal propensity to consume is between 8 and 11 percent in the first quarter - about half as large
&lt;/p&gt;</description></item></channel></rss>