<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#25552;&#20986;&#20102;&#19968;&#31181;&#38544;&#31169;&#20445;&#25252;&#30340;&#31354;&#38388;&#33258;&#22238;&#24402;&#27169;&#22411;&#65292;&#24341;&#20837;&#20102;&#22122;&#22768;&#21709;&#24212;&#21644;&#21327;&#21464;&#37327;&#20197;&#28385;&#36275;&#38544;&#31169;&#20445;&#25252;&#35201;&#27714;&#65292;&#24182;&#24320;&#21457;&#20102;&#32416;&#27491;&#30001;&#22122;&#22768;&#24341;&#20837;&#30340;&#20559;&#24046;&#30340;&#25216;&#26415;&#12290;</title><link>https://arxiv.org/abs/2403.16773</link><description>&lt;p&gt;
&#38544;&#31169;&#20445;&#25252;&#30340;&#31354;&#38388;&#33258;&#22238;&#24402;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
Privacy-Protected Spatial Autoregressive Model
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.16773
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#38544;&#31169;&#20445;&#25252;&#30340;&#31354;&#38388;&#33258;&#22238;&#24402;&#27169;&#22411;&#65292;&#24341;&#20837;&#20102;&#22122;&#22768;&#21709;&#24212;&#21644;&#21327;&#21464;&#37327;&#20197;&#28385;&#36275;&#38544;&#31169;&#20445;&#25252;&#35201;&#27714;&#65292;&#24182;&#24320;&#21457;&#20102;&#32416;&#27491;&#30001;&#22122;&#22768;&#24341;&#20837;&#30340;&#20559;&#24046;&#30340;&#25216;&#26415;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#31354;&#38388;&#33258;&#22238;&#24402;&#65288;SAR&#65289;&#27169;&#22411;&#26159;&#30740;&#31350;&#32593;&#32476;&#25928;&#24212;&#30340;&#37325;&#35201;&#24037;&#20855;&#12290;&#28982;&#32780;&#65292;&#38543;&#30528;&#23545;&#25968;&#25454;&#38544;&#31169;&#30340;&#37325;&#35270;&#22686;&#21152;&#65292;&#25968;&#25454;&#25552;&#20379;&#32773;&#32463;&#24120;&#23454;&#26045;&#38544;&#31169;&#20445;&#25252;&#25514;&#26045;&#65292;&#20351;&#20256;&#32479;&#30340;SAR&#27169;&#22411;&#21464;&#24471;&#19981;&#36866;&#29992;&#12290;&#22312;&#26412;&#30740;&#31350;&#20013;&#65292;&#25105;&#20204;&#20171;&#32461;&#20102;&#19968;&#31181;&#24102;&#26377;&#28155;&#21152;&#22122;&#22768;&#21709;&#24212;&#21644;&#21327;&#21464;&#37327;&#30340;&#38544;&#31169;&#20445;&#25252;&#30340;SAR&#27169;&#22411;&#65292;&#20197;&#28385;&#36275;&#38544;&#31169;&#20445;&#25252;&#35201;&#27714;&#12290;&#28982;&#32780;&#65292;&#22312;&#36825;&#31181;&#24773;&#20917;&#19979;&#65292;&#30001;&#20110;&#26080;&#27861;&#24314;&#31435;&#20284;&#28982;&#20989;&#25968;&#65292;&#20256;&#32479;&#30340;&#25311;&#26368;&#22823;&#20284;&#28982;&#20272;&#35745;&#21464;&#24471;&#19981;&#21487;&#34892;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;&#25105;&#20204;&#39318;&#20808;&#32771;&#34385;&#20102;&#21482;&#26377;&#22122;&#22768;&#28155;&#21152;&#21709;&#24212;&#30340;&#20284;&#28982;&#20989;&#25968;&#30340;&#26174;&#24335;&#34920;&#36798;&#12290;&#28982;&#32780;&#65292;&#30001;&#20110;&#21327;&#21464;&#37327;&#20013;&#30340;&#22122;&#22768;&#65292;&#23548;&#25968;&#26159;&#26377;&#20559;&#30340;&#12290;&#22240;&#27492;&#65292;&#25105;&#20204;&#24320;&#21457;&#20102;&#21487;&#20197;&#32416;&#27491;&#22122;&#22768;&#24341;&#20837;&#30340;&#20559;&#24046;&#30340;&#25216;&#26415;&#12290;&#30456;&#24212;&#22320;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#31867;&#20284;&#29275;&#39039;-&#25289;&#24343;&#26862;&#30340;&#31639;&#27861;&#26469;&#33719;&#24471;&#20272;&#35745;&#37327;&#65292;&#20174;&#32780;&#23548;&#33268;&#19968;&#20010;&#20462;&#27491;&#30340;&#20284;&#28982;&#20272;&#35745;&#37327;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.16773v1 Announce Type: cross  Abstract: Spatial autoregressive (SAR) models are important tools for studying network effects. However, with an increasing emphasis on data privacy, data providers often implement privacy protection measures that make classical SAR models inapplicable. In this study, we introduce a privacy-protected SAR model with noise-added response and covariates to meet privacy-protection requirements. However, in this scenario, the traditional quasi-maximum likelihood estimator becomes infeasible because the likelihood function cannot be formulated. To address this issue, we first consider an explicit expression for the likelihood function with only noise-added responses. However, the derivatives are biased owing to the noise in the covariates. Therefore, we develop techniques that can correct the biases introduced by noise. Correspondingly, a Newton-Raphson-type algorithm is proposed to obtain the estimator, leading to a corrected likelihood estimator. To
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#33268;&#21147;&#20110;&#23547;&#25214;&#31616;&#21333;&#30340;&#38144;&#21806;&#26426;&#21046;&#65292;&#20197;&#26377;&#25928;&#23545;&#20914;&#24066;&#22330;&#27169;&#31946;&#24615;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#21482;&#26377;&#26377;&#38480;&#25968;&#37327;&#30340;&#20215;&#26684;&#38543;&#26426;&#21270;&#30340;&#38144;&#21806;&#26426;&#21046;&#24050;&#32463;&#33021;&#22815;&#33719;&#24471;&#26080;&#38480;&#36873;&#39033;&#30340;&#26368;&#20248;&#31283;&#20581;&#26426;&#21046;&#25152;&#23454;&#29616;&#30340;&#26174;&#33879;&#25928;&#30410;&#12290;</title><link>http://arxiv.org/abs/2310.17392</link><description>&lt;p&gt;
&#31616;&#21333;&#33756;&#21333;&#22312;&#31283;&#20581;&#38144;&#21806;&#26426;&#21046;&#20013;&#30340;&#21147;&#37327;
&lt;/p&gt;
&lt;p&gt;
The Power of Simple Menus in Robust Selling Mechanisms. (arXiv:2310.17392v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.17392
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#33268;&#21147;&#20110;&#23547;&#25214;&#31616;&#21333;&#30340;&#38144;&#21806;&#26426;&#21046;&#65292;&#20197;&#26377;&#25928;&#23545;&#20914;&#24066;&#22330;&#27169;&#31946;&#24615;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#21482;&#26377;&#26377;&#38480;&#25968;&#37327;&#30340;&#20215;&#26684;&#38543;&#26426;&#21270;&#30340;&#38144;&#21806;&#26426;&#21046;&#24050;&#32463;&#33021;&#22815;&#33719;&#24471;&#26080;&#38480;&#36873;&#39033;&#30340;&#26368;&#20248;&#31283;&#20581;&#26426;&#21046;&#25152;&#23454;&#29616;&#30340;&#26174;&#33879;&#25928;&#30410;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#19968;&#20010;&#31283;&#20581;&#38144;&#21806;&#38382;&#39064;&#65292;&#20854;&#20013;&#21334;&#26041;&#35797;&#22270;&#23558;&#19968;&#20010;&#29289;&#21697;&#21334;&#32473;&#19968;&#20010;&#20080;&#26041;&#65292;&#20294;&#23545;&#20080;&#26041;&#30340;&#20272;&#20540;&#20998;&#24067;&#23384;&#22312;&#19981;&#30830;&#23450;&#24615;&#12290;&#29616;&#26377;&#25991;&#29486;&#34920;&#26126;&#65292;&#31283;&#20581;&#26426;&#21046;&#35774;&#35745;&#27604;&#31283;&#20581;&#30830;&#23450;&#24615;&#23450;&#20215;&#25552;&#20379;&#20102;&#26356;&#24378;&#30340;&#29702;&#35770;&#20445;&#35777;&#12290;&#21516;&#26102;&#65292;&#31283;&#20581;&#26426;&#21046;&#35774;&#35745;&#30340;&#21331;&#36234;&#24615;&#33021;&#20197;&#21334;&#26041;&#25552;&#20379;&#20855;&#26377;&#26080;&#38480;&#36873;&#39033;&#30340;&#33756;&#21333;&#65292;&#27599;&#20010;&#36873;&#39033;&#19982;&#25277;&#22870;&#21644;&#20080;&#26041;&#36873;&#25321;&#30340;&#20184;&#27454;&#26041;&#24335;&#30456;&#37197;&#12290;&#37492;&#20110;&#27492;&#65292;&#25105;&#20204;&#30340;&#30740;&#31350;&#30340;&#20027;&#35201;&#37325;&#28857;&#26159;&#23547;&#25214;&#21487;&#20197;&#26377;&#25928;&#23545;&#20914;&#24066;&#22330;&#27169;&#31946;&#24615;&#30340;&#31616;&#21333;&#38144;&#21806;&#26426;&#21046;&#12290;&#25105;&#20204;&#34920;&#26126;&#65292;&#19968;&#20010;&#20855;&#26377;&#23567;&#33756;&#21333;&#22823;&#23567;&#65288;&#25110;&#26377;&#38480;&#25968;&#37327;&#30340;&#20215;&#26684;&#38543;&#26426;&#21270;&#65289;&#30340;&#38144;&#21806;&#26426;&#21046;&#24050;&#32463;&#33021;&#22815;&#33719;&#24471;&#26080;&#38480;&#36873;&#39033;&#30340;&#26368;&#20248;&#31283;&#20581;&#26426;&#21046;&#25152;&#23454;&#29616;&#30340;&#26174;&#33879;&#25928;&#30410;&#12290;&#29305;&#21035;&#26159;&#65292;&#25105;&#20204;&#21457;&#23637;&#20102;&#19968;&#20010;&#36890;&#29992;&#26694;&#26550;&#26469;&#30740;&#31350;&#31283;&#20581;&#38144;&#21806;&#26426;&#21046;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study a robust selling problem where a seller attempts to sell one item to a buyer but is uncertain about the buyer's valuation distribution. Existing literature indicates that robust mechanism design provides a stronger theoretical guarantee than robust deterministic pricing. Meanwhile, the superior performance of robust mechanism design comes at the expense of implementation complexity given that the seller offers a menu with an infinite number of options, each coupled with a lottery and a payment for the buyer's selection. In view of this, the primary focus of our research is to find simple selling mechanisms that can effectively hedge against market ambiguity. We show that a selling mechanism with a small menu size (or limited randomization across a finite number of prices) is already capable of deriving significant benefits achieved by the optimal robust mechanism with infinite options. In particular, we develop a general framework to study the robust selling mechanism problem 
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#22914;&#20309;&#36890;&#36807;&#25968;&#25454;&#25913;&#21892;&#40065;&#26834;&#20915;&#31574;&#65292;&#24182;&#24320;&#21457;&#20102;&#31616;&#21333;&#26131;&#23454;&#29616;&#30340;&#25512;&#29702;&#26041;&#27861;&#20197;&#20445;&#35777;&#25913;&#21892;&#12290;</title><link>http://arxiv.org/abs/2310.16281</link><description>&lt;p&gt;
&#36890;&#36807;&#25968;&#25454;&#25913;&#21892;&#40065;&#26834;&#20915;&#31574;
&lt;/p&gt;
&lt;p&gt;
Improving Robust Decisions with Data. (arXiv:2310.16281v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.16281
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#22914;&#20309;&#36890;&#36807;&#25968;&#25454;&#25913;&#21892;&#40065;&#26834;&#20915;&#31574;&#65292;&#24182;&#24320;&#21457;&#20102;&#31616;&#21333;&#26131;&#23454;&#29616;&#30340;&#25512;&#29702;&#26041;&#27861;&#20197;&#20445;&#35777;&#25913;&#21892;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20915;&#31574;&#32773;&#38754;&#20020;&#30001;&#25968;&#25454;&#29983;&#25104;&#36807;&#31243;(DGP)&#25511;&#21046;&#30340;&#19981;&#30830;&#23450;&#24615;&#65292;&#36825;&#20123;&#36807;&#31243;&#21487;&#33021;&#21482;&#23646;&#20110;&#19968;&#32452;&#29420;&#31435;&#20294;&#21487;&#33021;&#38750;&#30456;&#21516;&#20998;&#24067;&#30340;&#24207;&#21015;&#12290;&#40065;&#26834;&#20915;&#31574;&#22312;&#36825;&#20010;&#38598;&#21512;&#20013;&#26368;&#22823;&#21270;&#20915;&#31574;&#32773;&#23545;&#26368;&#22351;&#24773;&#20917;DGP&#30340;&#39044;&#26399;&#25910;&#30410;&#12290;&#26412;&#25991;&#30740;&#31350;&#20102;&#22914;&#20309;&#36890;&#36807;&#25968;&#25454;&#25913;&#21892;&#36825;&#20123;&#40065;&#26834;&#20915;&#31574;&#65292;&#20854;&#20013;&#25913;&#21892;&#36890;&#36807;&#30495;&#23454;DGP&#19979;&#30340;&#39044;&#26399;&#25910;&#30410;&#26469;&#34913;&#37327;&#12290;&#26412;&#25991;&#23436;&#20840;&#25551;&#36848;&#20102;&#22312;&#25152;&#26377;&#21487;&#33021;&#30340;DGP&#19979;&#20445;&#35777;&#36825;&#31181;&#25913;&#21892;&#30340;&#26102;&#38388;&#21644;&#26041;&#24335;&#65292;&#24182;&#24320;&#21457;&#20102;&#25512;&#29702;&#26041;&#27861;&#26469;&#23454;&#29616;&#23427;&#12290;&#36825;&#20123;&#25512;&#29702;&#26041;&#27861;&#26159;&#24517;&#38656;&#30340;&#65292;&#22240;&#20026;&#26412;&#25991;&#34920;&#26126;&#65292;&#24120;&#35265;&#30340;&#25512;&#29702;&#26041;&#27861;&#65288;&#22914;&#26368;&#22823;&#20284;&#28982;&#25110;&#36125;&#21494;&#26031;&#65289;&#36890;&#24120;&#26080;&#27861;&#23454;&#29616;&#36825;&#31181;&#25913;&#21892;&#12290;&#37325;&#35201;&#30340;&#26159;&#65292;&#24320;&#21457;&#30340;&#25512;&#29702;&#26041;&#27861;&#26159;&#36890;&#36807;&#23545;&#26631;&#20934;&#25512;&#29702;&#31243;&#24207;&#36827;&#34892;&#31616;&#21333;&#25193;&#23637;&#33719;&#24471;&#30340;&#65292;&#22240;&#27492;&#22312;&#23454;&#36341;&#20013;&#24456;&#23481;&#26131;&#23454;&#29616;&#12290;
&lt;/p&gt;
&lt;p&gt;
A decision-maker (DM) faces uncertainty governed by a data-generating process (DGP), which is only known to belong to a set of sequences of independent but possibly non-identical distributions. A robust decision maximizes the DM's expected payoff against the worst possible DGP in this set. This paper studies how such robust decisions can be improved with data, where improvement is measured by expected payoff under the true DGP. In this paper, I fully characterize when and how such an improvement can be guaranteed under all possible DGPs and develop inference methods to achieve it. These inference methods are needed because, as this paper shows, common inference methods (e.g., maximum likelihood or Bayesian) often fail to deliver such an improvement. Importantly, the developed inference methods are given by simple augmentations to standard inference procedures, and are thus easy to implement in practice.
&lt;/p&gt;</description></item><item><title>&#35770;&#25991;&#30740;&#31350;&#20102;&#36890;&#36807;&#36866;&#24212;&#24615;&#31574;&#30053;&#36873;&#25321;&#26368;&#22823;&#21270;&#31038;&#20250;&#31119;&#21033;&#30340;&#38382;&#39064;&#65292;&#24182;&#25552;&#20379;&#20102;&#20851;&#20110;&#36951;&#25022;&#30340;&#19979;&#30028;&#21644;&#31639;&#27861;&#30340;&#21305;&#37197;&#19978;&#30028;&#12290;&#30740;&#31350;&#21457;&#29616;&#31119;&#21033;&#26368;&#22823;&#21270;&#27604;&#22810;&#33218;&#32769;&#34382;&#26426;&#38382;&#39064;&#26356;&#22256;&#38590;&#65292;&#20294;&#35813;&#31639;&#27861;&#36798;&#21040;&#20102;&#26368;&#20248;&#22686;&#38271;&#36895;&#29575;&#12290;</title><link>http://arxiv.org/abs/2310.09597</link><description>&lt;p&gt;
&#33258;&#36866;&#24212;&#26368;&#22823;&#21270;&#31038;&#20250;&#31119;&#21033;
&lt;/p&gt;
&lt;p&gt;
Adaptive maximization of social welfare. (arXiv:2310.09597v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.09597
&lt;/p&gt;
&lt;p&gt;
&#35770;&#25991;&#30740;&#31350;&#20102;&#36890;&#36807;&#36866;&#24212;&#24615;&#31574;&#30053;&#36873;&#25321;&#26368;&#22823;&#21270;&#31038;&#20250;&#31119;&#21033;&#30340;&#38382;&#39064;&#65292;&#24182;&#25552;&#20379;&#20102;&#20851;&#20110;&#36951;&#25022;&#30340;&#19979;&#30028;&#21644;&#31639;&#27861;&#30340;&#21305;&#37197;&#19978;&#30028;&#12290;&#30740;&#31350;&#21457;&#29616;&#31119;&#21033;&#26368;&#22823;&#21270;&#27604;&#22810;&#33218;&#32769;&#34382;&#26426;&#38382;&#39064;&#26356;&#22256;&#38590;&#65292;&#20294;&#35813;&#31639;&#27861;&#36798;&#21040;&#20102;&#26368;&#20248;&#22686;&#38271;&#36895;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#32771;&#34385;&#20102;&#37325;&#22797;&#36873;&#25321;&#25919;&#31574;&#20197;&#26368;&#22823;&#21270;&#31038;&#20250;&#31119;&#21033;&#30340;&#38382;&#39064;&#12290;&#31119;&#21033;&#26159;&#20010;&#20154;&#25928;&#29992;&#21644;&#20844;&#20849;&#25910;&#20837;&#30340;&#21152;&#26435;&#21644;&#12290;&#26089;&#26399;&#30340;&#32467;&#26524;&#24433;&#21709;&#21518;&#32493;&#30340;&#25919;&#31574;&#36873;&#25321;&#12290;&#25928;&#29992;&#19981;&#21487;&#35266;&#27979;&#65292;&#20294;&#21487;&#20197;&#38388;&#25509;&#25512;&#26029;&#12290;&#21709;&#24212;&#20989;&#25968;&#36890;&#36807;&#23454;&#39564;&#23398;&#20064;&#33719;&#24471;&#12290;&#25105;&#20204;&#25512;&#23548;&#20986;&#20102;&#19968;&#20010;&#20851;&#20110;&#36951;&#25022;&#30340;&#19979;&#30028;&#65292;&#24182;&#19988;&#23545;&#20110;&#19968;&#31181;Exp3&#31639;&#27861;&#30340;&#21305;&#37197;&#23545;&#31574;&#23545;&#31435;&#19978;&#30028;&#12290;&#32047;&#31215;&#36951;&#25022;&#20197;$T^{2/3}$&#30340;&#36895;&#29575;&#22686;&#38271;&#12290;&#36825;&#24847;&#21619;&#30528;(i)&#31119;&#21033;&#26368;&#22823;&#21270;&#27604;&#22810;&#33218;&#32769;&#34382;&#26426;&#38382;&#39064;&#26356;&#22256;&#38590;&#65288;&#23545;&#20110;&#26377;&#38480;&#30340;&#25919;&#31574;&#38598;&#26469;&#35828;&#65292;&#22686;&#38271;&#36895;&#29575;&#20026;$T^{1/2}$&#65289;&#65292;&#21644;(ii)&#25105;&#20204;&#30340;&#31639;&#27861;&#23454;&#29616;&#20102;&#26368;&#20248;&#22686;&#38271;&#36895;&#29575;&#12290;&#23545;&#20110;&#38543;&#26426;&#35774;&#32622;&#65292;&#22914;&#26524;&#31038;&#20250;&#31119;&#21033;&#26159;&#20985;&#30340;&#65292;&#25105;&#20204;&#21487;&#20197;&#20351;&#29992;&#20108;&#20998;&#25628;&#32034;&#31639;&#27861;&#22312;&#36830;&#32493;&#25919;&#31574;&#38598;&#19978;&#23454;&#29616;$T^{1/2}$&#30340;&#36895;&#29575;&#12290;&#25105;&#20204;&#20998;&#26512;&#20102;&#38750;&#32447;&#24615;&#25910;&#20837;&#31246;&#25193;&#23637;&#65292;&#24182;&#27010;&#36848;&#20102;&#21830;&#21697;&#31246;&#25193;&#23637;&#12290;&#25105;&#20204;&#23558;&#25105;&#20204;&#30340;&#35774;&#32622;&#19982;&#22404;&#26029;&#23450;&#20215;&#65288;&#26356;&#23481;&#26131;&#65289;&#21644;&#21452;&#36793;&#20132;&#26131;&#30340;&#23450;&#20215;&#36827;&#34892;&#20102;&#27604;&#36739;&#12290;
&lt;/p&gt;
&lt;p&gt;
We consider the problem of repeatedly choosing policies to maximize social welfare. Welfare is a weighted sum of private utility and public revenue. Earlier outcomes inform later policies. Utility is not observed, but indirectly inferred. Response functions are learned through experimentation.  We derive a lower bound on regret, and a matching adversarial upper bound for a variant of the Exp3 algorithm. Cumulative regret grows at a rate of $T^{2/3}$. This implies that (i) welfare maximization is harder than the multi-armed bandit problem (with a rate of $T^{1/2}$ for finite policy sets), and (ii) our algorithm achieves the optimal rate. For the stochastic setting, if social welfare is concave, we can achieve a rate of $T^{1/2}$ (for continuous policy sets), using a dyadic search algorithm.  We analyze an extension to nonlinear income taxation, and sketch an extension to commodity taxation. We compare our setting to monopoly pricing (which is easier), and price setting for bilateral tra
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#22240;&#26524;&#26694;&#26550;&#65292;&#36890;&#36807;&#19968;&#20010;&#20013;&#38388;&#22788;&#29702;&#21464;&#37327;&#23558;&#32452;&#24046;&#24322;&#20998;&#35299;&#25104;&#19981;&#21516;&#30340;&#32452;&#25104;&#37096;&#20998;&#65292;&#24182;&#25552;&#20379;&#20102;&#19968;&#20010;&#26032;&#30340;&#35299;&#37322;&#21644;&#25913;&#21892;&#24046;&#24322;&#30340;&#26426;&#21046;&#12290;&#35813;&#26694;&#26550;&#25913;&#36827;&#20102;&#32463;&#20856;&#30340;&#20998;&#35299;&#26041;&#27861;&#65292;&#24182;&#19988;&#21487;&#20197;&#25351;&#23548;&#25919;&#31574;&#24178;&#39044;&#12290;</title><link>http://arxiv.org/abs/2306.16591</link><description>&lt;p&gt;
&#38750;&#21442;&#25968;&#22240;&#26524;&#20998;&#35299;&#32452;&#24046;&#24322;
&lt;/p&gt;
&lt;p&gt;
Nonparametric Causal Decomposition of Group Disparities. (arXiv:2306.16591v1 [stat.ME])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.16591
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#22240;&#26524;&#26694;&#26550;&#65292;&#36890;&#36807;&#19968;&#20010;&#20013;&#38388;&#22788;&#29702;&#21464;&#37327;&#23558;&#32452;&#24046;&#24322;&#20998;&#35299;&#25104;&#19981;&#21516;&#30340;&#32452;&#25104;&#37096;&#20998;&#65292;&#24182;&#25552;&#20379;&#20102;&#19968;&#20010;&#26032;&#30340;&#35299;&#37322;&#21644;&#25913;&#21892;&#24046;&#24322;&#30340;&#26426;&#21046;&#12290;&#35813;&#26694;&#26550;&#25913;&#36827;&#20102;&#32463;&#20856;&#30340;&#20998;&#35299;&#26041;&#27861;&#65292;&#24182;&#19988;&#21487;&#20197;&#25351;&#23548;&#25919;&#31574;&#24178;&#39044;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#22240;&#26524;&#26694;&#26550;&#26469;&#23558;&#32467;&#26524;&#20013;&#30340;&#32452;&#24046;&#24322;&#20998;&#35299;&#20026;&#20013;&#38388;&#22788;&#29702;&#21464;&#37327;&#12290;&#25105;&#20204;&#30340;&#26694;&#26550;&#25429;&#25417;&#20102;&#22522;&#32447;&#28508;&#22312;&#32467;&#26524;&#12289;&#22788;&#29702;&#21069;&#27839;&#12289;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#21644;&#22788;&#29702;&#36873;&#25321;&#30340;&#32452;&#24046;&#24322;&#30340;&#36129;&#29486;&#12290;&#36825;&#20010;&#26694;&#26550;&#20197;&#21453;&#20107;&#23454;&#30340;&#26041;&#24335;&#36827;&#34892;&#20102;&#25968;&#23398;&#34920;&#36798;&#65292;&#24182;&#19988;&#33021;&#22815;&#26041;&#20415;&#22320;&#25351;&#23548;&#25919;&#31574;&#24178;&#39044;&#12290;&#29305;&#21035;&#26159;&#65292;&#38024;&#23545;&#19981;&#21516;&#30340;&#22788;&#29702;&#36873;&#25321;&#36827;&#34892;&#30340;&#20998;&#35299;&#37096;&#20998;&#26159;&#29305;&#21035;&#26032;&#39062;&#30340;&#65292;&#25581;&#31034;&#20102;&#19968;&#31181;&#35299;&#37322;&#21644;&#25913;&#21892;&#24046;&#24322;&#30340;&#26032;&#26426;&#21046;&#12290;&#36825;&#20010;&#26694;&#26550;&#20197;&#22240;&#26524;&#26415;&#35821;&#37325;&#26032;&#23450;&#20041;&#20102;&#32463;&#20856;&#30340;Kitagawa-Blinder-Oaxaca&#20998;&#35299;&#65292;&#36890;&#36807;&#35299;&#37322;&#32452;&#24046;&#24322;&#32780;&#19981;&#26159;&#32452;&#25928;&#24212;&#26469;&#34917;&#20805;&#20102;&#22240;&#26524;&#20013;&#20171;&#20998;&#26512;&#65292;&#24182;&#35299;&#20915;&#20102;&#36817;&#26399;&#38543;&#26426;&#31561;&#21270;&#20998;&#35299;&#30340;&#27010;&#24565;&#22256;&#38590;&#12290;&#25105;&#20204;&#36824;&#25552;&#20379;&#20102;&#19968;&#20010;&#26465;&#20214;&#20998;&#35299;&#65292;&#20801;&#35768;&#30740;&#31350;&#20154;&#21592;&#22312;&#23450;&#20041;&#35780;&#20272;&#21644;&#30456;&#24212;&#30340;&#24178;&#39044;&#25514;&#26045;&#26102;&#32435;&#20837;&#21327;&#21464;&#37327;&#12290;
&lt;/p&gt;
&lt;p&gt;
We propose a causal framework for decomposing a group disparity in an outcome in terms of an intermediate treatment variable. Our framework captures the contributions of group differences in baseline potential outcome, treatment prevalence, average treatment effect, and selection into treatment. This framework is counterfactually formulated and readily informs policy interventions. The decomposition component for differential selection into treatment is particularly novel, revealing a new mechanism for explaining and ameliorating disparities. This framework reformulates the classic Kitagawa-Blinder-Oaxaca decomposition in causal terms, supplements causal mediation analysis by explaining group disparities instead of group effects, and resolves conceptual difficulties of recent random equalization decompositions. We also provide a conditional decomposition that allows researchers to incorporate covariates in defining the estimands and corresponding interventions. We develop nonparametric
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#38024;&#23545;&#22810;&#20154;&#19981;&#23436;&#20840;&#20449;&#24687;&#21338;&#24328;&#30340;&#36125;&#21494;&#26031;&#23545;&#25163;&#24314;&#27169;&#26041;&#27861;&#65292;&#22312;&#19977;&#20154; Kuhn poker &#20013;&#24212;&#29992;&#36825;&#31181;&#26041;&#27861;&#21487;&#20197;&#26126;&#26174;&#36229;&#36807;&#25152;&#26377;&#30340;&#20195;&#29702;&#21830;&#65292;&#21253;&#25324;&#20934;&#30830;&#30340;&#32435;&#20160;&#22343;&#34913;&#31574;&#30053;&#12290;</title><link>http://arxiv.org/abs/2212.06027</link><description>&lt;p&gt;
&#22810;&#20154;&#19981;&#23436;&#20840;&#20449;&#24687;&#21338;&#24328;&#20013;&#30340;&#36125;&#21494;&#26031;&#23545;&#25163;&#24314;&#27169;
&lt;/p&gt;
&lt;p&gt;
Bayesian Opponent Modeling in Multiplayer Imperfect-Information Games. (arXiv:2212.06027v2 [cs.GT] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2212.06027
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#38024;&#23545;&#22810;&#20154;&#19981;&#23436;&#20840;&#20449;&#24687;&#21338;&#24328;&#30340;&#36125;&#21494;&#26031;&#23545;&#25163;&#24314;&#27169;&#26041;&#27861;&#65292;&#22312;&#19977;&#20154; Kuhn poker &#20013;&#24212;&#29992;&#36825;&#31181;&#26041;&#27861;&#21487;&#20197;&#26126;&#26174;&#36229;&#36807;&#25152;&#26377;&#30340;&#20195;&#29702;&#21830;&#65292;&#21253;&#25324;&#20934;&#30830;&#30340;&#32435;&#20160;&#22343;&#34913;&#31574;&#30053;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#35768;&#22810;&#29616;&#23454;&#19990;&#30028;&#30340;&#24773;&#22659;&#20013;&#65292;&#20195;&#29702;&#21830;&#19982;&#22810;&#20010;&#23545;&#31435;&#20195;&#29702;&#21830;&#36827;&#34892;&#25112;&#30053;&#20114;&#21160;&#65292;&#23545;&#25163;&#21487;&#33021;&#37319;&#29992;&#21508;&#31181;&#31574;&#30053;&#12290;&#23545;&#20110;&#36825;&#26679;&#30340;&#24773;&#22659;&#65292;&#35774;&#35745;&#20195;&#29702;&#30340;&#26631;&#20934;&#26041;&#27861;&#26159;&#35745;&#31639;&#25110;&#36924;&#36817;&#30456;&#20851;&#30340;&#21338;&#24328;&#29702;&#35770;&#35299;&#65292;&#22914;&#32435;&#20160;&#22343;&#34913;&#65292;&#28982;&#21518;&#36981;&#24490;&#35268;&#23450;&#30340;&#31574;&#30053;&#12290;&#28982;&#32780;&#65292;&#36825;&#26679;&#30340;&#31574;&#30053;&#24573;&#30053;&#20102;&#23545;&#25163;&#29609;&#28216;&#25103;&#30340;&#20219;&#20309;&#35266;&#23519;&#65292;&#36825;&#20123;&#35266;&#23519;&#21487;&#33021;&#34920;&#26126;&#21487;&#20197;&#21033;&#29992;&#30340;&#32570;&#28857;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#22810;&#20154;&#19981;&#23436;&#20840;&#20449;&#24687;&#21338;&#24328;&#20013;&#30340;&#23545;&#25163;&#24314;&#27169;&#26041;&#27861;&#65292;&#36890;&#36807;&#37325;&#22797;&#20132;&#20114;&#25910;&#38598;&#23545;&#25163;&#29609;&#28216;&#25103;&#30340;&#35266;&#23519;&#12290;&#25105;&#20204;&#23545;&#19977;&#20154; Kuhn &#25169;&#20811;&#23637;&#24320;&#20102;&#23545;&#35768;&#22810;&#30495;&#23454;&#23545;&#25163;&#21644;&#20934;&#30830;&#30340;&#32435;&#20160;&#22343;&#34913;&#31574;&#30053;&#30340;&#23454;&#39564;&#65292;&#32467;&#26524;&#34920;&#26126;&#25105;&#20204;&#30340;&#31639;&#27861;&#26126;&#26174;&#20248;&#20110;&#25152;&#26377;&#30340;&#20195;&#29702;&#21830;&#65292;&#21253;&#25324;&#20934;&#30830;&#30340;&#32435;&#20160;&#22343;&#34913;&#31574;&#30053;&#12290;
&lt;/p&gt;
&lt;p&gt;
In many real-world settings agents engage in strategic interactions with multiple opposing agents who can employ a wide variety of strategies. The standard approach for designing agents for such settings is to compute or approximate a relevant game-theoretic solution concept such as Nash equilibrium and then follow the prescribed strategy. However, such a strategy ignores any observations of opponents' play, which may indicate shortcomings that can be exploited. We present an approach for opponent modeling in multiplayer imperfect-information games where we collect observations of opponents' play through repeated interactions. We run experiments against a wide variety of real opponents and exact Nash equilibrium strategies in three-player Kuhn poker and show that our algorithm significantly outperforms all of the agents, including the exact Nash equilibrium strategies.
&lt;/p&gt;</description></item><item><title>SPAC&#20013;&#30340;&#20248;&#36136;&#25237;&#36164;&#32773;&#21442;&#19982;&#21487;&#20197;&#21019;&#36896;&#20215;&#20540;&#65292;&#38750;&#20248;&#36136;&#25237;&#36164;&#32773;&#21017;&#20165;&#21442;&#19982;&#20132;&#25442;&#26465;&#20214;&#23433;&#25490;&#65292;&#36825;&#19981;&#20165;&#20165;&#26159;&#20195;&#29702;&#25104;&#26412;&#36824;&#33021;&#20351;&#26356;&#22810;&#20844;&#21496;&#19978;&#24066;&#12290;</title><link>http://arxiv.org/abs/2211.16643</link><description>&lt;p&gt;
SPAC&#30340;&#21457;&#34892;&#12289;&#26426;&#26500;&#25237;&#36164;&#32773;&#21644;&#20132;&#25442;&#26465;&#20214;&#65306;&#27934;&#23519;&#21147;
&lt;/p&gt;
&lt;p&gt;
Security Issuance, Institutional Investors and Quid Pro Quo: Insights from SPACs. (arXiv:2211.16643v3 [q-fin.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2211.16643
&lt;/p&gt;
&lt;p&gt;
SPAC&#20013;&#30340;&#20248;&#36136;&#25237;&#36164;&#32773;&#21442;&#19982;&#21487;&#20197;&#21019;&#36896;&#20215;&#20540;&#65292;&#38750;&#20248;&#36136;&#25237;&#36164;&#32773;&#21017;&#20165;&#21442;&#19982;&#20132;&#25442;&#26465;&#20214;&#23433;&#25490;&#65292;&#36825;&#19981;&#20165;&#20165;&#26159;&#20195;&#29702;&#25104;&#26412;&#36824;&#33021;&#20351;&#26356;&#22810;&#20844;&#21496;&#19978;&#24066;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35777;&#21048;&#21457;&#34892;&#21463;&#20449;&#24687;&#21644;&#20195;&#29702;&#25104;&#26412;&#30340;&#24433;&#21709;&#12290;&#28982;&#32780;&#65292;&#24456;&#38590;&#23558;&#23427;&#20204;&#20998;&#24320;&#32771;&#34385;&#12290;&#25105;&#20204;&#32771;&#34385;SPAC&#24182;&#20998;&#21035;&#35780;&#20272;&#36825;&#20123;&#24433;&#21709;&#12290;&#20026;&#27492;&#65292;&#25105;&#20204;&#30830;&#23450;&#20135;&#29983;&#20215;&#20540;&#30456;&#20851;&#20449;&#24687;&#30340;&#20248;&#36136;&#25237;&#36164;&#32773;&#65306;&#20182;&#20204;&#30340;&#21442;&#19982;&#19982;&#26356;&#39640;&#30340;SPAC&#25104;&#21151;&#21644;&#20844;&#21578;&#26085;&#22238;&#25253;&#30456;&#20851;&#12290;&#28982;&#32780;&#65292;&#38750;&#20248;&#36136;&#25237;&#36164;&#32773;&#20165;&#21442;&#19982;&#20132;&#25442;&#26465;&#20214;&#23433;&#25490;&#12290;&#20182;&#20204;&#20170;&#22825;&#20174;&#21457;&#34892;&#20154;&#65288;&#20248;&#24800;&#65289;&#33719;&#24471;&#39640;&#22238;&#25253;&#65292;&#36825;&#24847;&#21619;&#30528;&#20182;&#20204;&#26356;&#26377;&#21487;&#33021;&#21442;&#19982;&#30001;&#36825;&#20123;&#21457;&#34892;&#20154;&#21457;&#36215;&#30340;&#20302;&#22238;&#25253;&#26410;&#26469;&#20132;&#26131;&#65288;&#26465;&#20214;&#65289;&#12290;&#22240;&#27492;&#65292;&#20132;&#25442;&#26465;&#20214;&#19981;&#26159;&#32431;&#20195;&#29702;&#25104;&#26412;&#65292;&#32780;&#26159;&#37096;&#20998;&#20351;&#26356;&#22810;&#30340;&#20844;&#21496;&#19978;&#24066;&#30340;&#36716;&#31227;&#12290;
&lt;/p&gt;
&lt;p&gt;
Security issuance is subject to informational and agency-related frictions. However, it is difficult to separate their effects. We consider SPACs and assess those effects separately. To this end, we identify premium investors who produce value-relevant information: their participation is associated with higher SPAC success and announcement-day returns. Non-premium investors, however, engage only in quid pro quo arrangements. Their high returns today from issuers (quid) mean they are more likely to participate in low-returns future deals initiated by those issuers (quo). Thus quid pro quo is not pure agency cost but partly a transfer that enables more firms to go public.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#20010;&#22996;&#25176;-&#20195;&#29702;&#27169;&#22411;&#26469;&#35299;&#20915;&#20808;&#20998;&#26512;&#35745;&#21010;&#30340;&#35774;&#35745;&#38382;&#39064;&#65292;&#36890;&#36807;&#23454;&#26045;&#20855;&#26377;&#21487;&#34892;&#24615;&#30340;&#32479;&#35745;&#20915;&#31574;&#35268;&#21017;&#65292;&#21457;&#29616;&#20808;&#20998;&#26512;&#35745;&#21010;&#22312;&#23454;&#26045;&#20013;&#36215;&#30528;&#37325;&#35201;&#20316;&#29992;&#65292;&#29305;&#21035;&#26159;&#23545;&#20110;&#20551;&#35774;&#26816;&#39564;&#26469;&#35828;&#65292;&#26368;&#20248;&#25298;&#32477;&#35268;&#21017;&#38656;&#35201;&#39044;&#20808;&#27880;&#20876;&#26377;&#25928;&#30340;&#26816;&#39564;&#24182;&#23545;&#26410;&#25253;&#21578;&#30340;&#25968;&#25454;&#20570;&#26368;&#22351;&#24773;&#20917;&#20551;&#35774;&#12290;</title><link>http://arxiv.org/abs/2208.09638</link><description>&lt;p&gt;
&#26368;&#20248;&#20808;&#20998;&#26512;&#35745;&#21010;&#65306;&#21463;&#38480;&#20110;&#21487;&#23454;&#26045;&#24615;&#30340;&#32479;&#35745;&#20915;&#31574;
&lt;/p&gt;
&lt;p&gt;
Optimal Pre-Analysis Plans: Statistical Decisions Subject to Implementability. (arXiv:2208.09638v2 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2208.09638
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#20010;&#22996;&#25176;-&#20195;&#29702;&#27169;&#22411;&#26469;&#35299;&#20915;&#20808;&#20998;&#26512;&#35745;&#21010;&#30340;&#35774;&#35745;&#38382;&#39064;&#65292;&#36890;&#36807;&#23454;&#26045;&#20855;&#26377;&#21487;&#34892;&#24615;&#30340;&#32479;&#35745;&#20915;&#31574;&#35268;&#21017;&#65292;&#21457;&#29616;&#20808;&#20998;&#26512;&#35745;&#21010;&#22312;&#23454;&#26045;&#20013;&#36215;&#30528;&#37325;&#35201;&#20316;&#29992;&#65292;&#29305;&#21035;&#26159;&#23545;&#20110;&#20551;&#35774;&#26816;&#39564;&#26469;&#35828;&#65292;&#26368;&#20248;&#25298;&#32477;&#35268;&#21017;&#38656;&#35201;&#39044;&#20808;&#27880;&#20876;&#26377;&#25928;&#30340;&#26816;&#39564;&#24182;&#23545;&#26410;&#25253;&#21578;&#30340;&#25968;&#25454;&#20570;&#26368;&#22351;&#24773;&#20917;&#20551;&#35774;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20160;&#20040;&#26159;&#20808;&#20998;&#26512;&#35745;&#21010;&#30340;&#30446;&#30340;&#65292;&#24212;&#35813;&#22914;&#20309;&#35774;&#35745;&#65311;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#22996;&#25176;-&#20195;&#29702;&#27169;&#22411;&#65292;&#20854;&#20013;&#20915;&#31574;&#32773;&#20381;&#36182;&#20110;&#20998;&#26512;&#24072;&#36873;&#25321;&#24615;&#20294;&#30495;&#23454;&#30340;&#25253;&#21578;&#12290;&#20998;&#26512;&#24072;&#20855;&#26377;&#25968;&#25454;&#35775;&#38382;&#26435;&#65292;&#19988;&#30446;&#26631;&#19981;&#19968;&#33268;&#12290;&#22312;&#36825;&#20010;&#27169;&#22411;&#20013;&#65292;&#23454;&#26045;&#32479;&#35745;&#20915;&#31574;&#35268;&#21017;&#65288;&#26816;&#39564;&#12289;&#20272;&#35745;&#37327;&#65289;&#38656;&#35201;&#19968;&#20010;&#28608;&#21169;&#20860;&#23481;&#26426;&#21046;&#12290;&#25105;&#20204;&#39318;&#20808;&#25551;&#36848;&#20102;&#21738;&#20123;&#20915;&#31574;&#35268;&#21017;&#21487;&#20197;&#34987;&#23454;&#26045;&#12290;&#28982;&#21518;&#25551;&#36848;&#20102;&#21463;&#38480;&#20110;&#21487;&#23454;&#26045;&#24615;&#30340;&#26368;&#20248;&#32479;&#35745;&#20915;&#31574;&#35268;&#21017;&#12290;&#25105;&#20204;&#34920;&#26126;&#23454;&#26045;&#38656;&#35201;&#20808;&#20998;&#26512;&#35745;&#21010;&#12290;&#37325;&#28857;&#25918;&#22312;&#20551;&#35774;&#26816;&#39564;&#19978;&#65292;&#25105;&#20204;&#34920;&#26126;&#26368;&#20248;&#25298;&#32477;&#35268;&#21017;&#39044;&#20808;&#27880;&#20876;&#20102;&#19968;&#20010;&#23545;&#20110;&#25152;&#26377;&#25968;&#25454;&#25253;&#21578;&#30340;&#26377;&#25928;&#26816;&#39564;&#65292;&#24182;&#23545;&#26410;&#25253;&#21578;&#30340;&#25968;&#25454;&#20570;&#26368;&#22351;&#24773;&#20917;&#20551;&#35774;&#12290;&#26368;&#20248;&#26816;&#39564;&#21487;&#20197;&#36890;&#36807;&#32447;&#24615;&#35268;&#21010;&#38382;&#39064;&#30340;&#35299;&#26469;&#25214;&#21040;&#12290;
&lt;/p&gt;
&lt;p&gt;
What is the purpose of pre-analysis plans, and how should they be designed? We propose a principal-agent model where a decision-maker relies on selective but truthful reports by an analyst. The analyst has data access, and non-aligned objectives. In this model, the implementation of statistical decision rules (tests, estimators) requires an incentive-compatible mechanism. We first characterize which decision rules can be implemented. We then characterize optimal statistical decision rules subject to implementability. We show that implementation requires pre-analysis plans. Focussing specifically on hypothesis tests, we show that optimal rejection rules pre-register a valid test for the case when all data is reported, and make worst-case assumptions about unreported data. Optimal tests can be found as a solution to a linear-programming problem.
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#25552;&#20379;&#20102;&#19968;&#20010;&#26131;&#20110;&#22788;&#29702;&#30340;&#8220;&#36328;&#39046;&#22495;&#8221;&#39044;&#27979;&#38382;&#39064;&#65292;&#24182;&#26681;&#25454;&#27169;&#22411;&#22312;&#26032;&#39046;&#22495;&#20013;&#30340;&#34920;&#29616;&#23450;&#20041;&#20102;&#27169;&#22411;&#30340;&#36801;&#31227;&#35823;&#24046;&#12290;&#35813;&#35770;&#25991;&#27604;&#36739;&#20102;&#32463;&#27982;&#27169;&#22411;&#21644;&#40657;&#30418;&#31639;&#27861;&#22312;&#39044;&#27979;&#30830;&#23450;&#31561;&#20215;&#20540;&#26041;&#38754;&#30340;&#36801;&#31227;&#33021;&#21147;&#65292;&#21457;&#29616;&#32463;&#27982;&#27169;&#22411;&#22312;&#36328;&#39046;&#22495;&#19978;&#30340;&#27867;&#21270;&#33021;&#21147;&#26356;&#24378;&#12290;</title><link>http://arxiv.org/abs/2202.04796</link><description>&lt;p&gt;
&#32463;&#27982;&#27169;&#22411;&#30340;&#36801;&#31227;&#34920;&#29616;
&lt;/p&gt;
&lt;p&gt;
The Transfer Performance of Economic Models. (arXiv:2202.04796v3 [econ.TH] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2202.04796
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20379;&#20102;&#19968;&#20010;&#26131;&#20110;&#22788;&#29702;&#30340;&#8220;&#36328;&#39046;&#22495;&#8221;&#39044;&#27979;&#38382;&#39064;&#65292;&#24182;&#26681;&#25454;&#27169;&#22411;&#22312;&#26032;&#39046;&#22495;&#20013;&#30340;&#34920;&#29616;&#23450;&#20041;&#20102;&#27169;&#22411;&#30340;&#36801;&#31227;&#35823;&#24046;&#12290;&#35813;&#35770;&#25991;&#27604;&#36739;&#20102;&#32463;&#27982;&#27169;&#22411;&#21644;&#40657;&#30418;&#31639;&#27861;&#22312;&#39044;&#27979;&#30830;&#23450;&#31561;&#20215;&#20540;&#26041;&#38754;&#30340;&#36801;&#31227;&#33021;&#21147;&#65292;&#21457;&#29616;&#32463;&#27982;&#27169;&#22411;&#22312;&#36328;&#39046;&#22495;&#19978;&#30340;&#27867;&#21270;&#33021;&#21147;&#26356;&#24378;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#32463;&#27982;&#23398;&#23478;&#32463;&#24120;&#20351;&#29992;&#29305;&#23450;&#39046;&#22495;&#30340;&#25968;&#25454;&#26469;&#20272;&#35745;&#27169;&#22411;&#65292;&#20363;&#22914;&#22312;&#29305;&#23450;&#23545;&#35937;&#32452;&#20013;&#20272;&#35745;&#39118;&#38505;&#20559;&#22909;&#25110;&#29305;&#23450;&#24425;&#31080;&#31867;&#21035;&#19978;&#20272;&#35745;&#39118;&#38505;&#20559;&#22909;&#12290;&#27169;&#22411;&#39044;&#27979;&#26159;&#21542;&#36328;&#39046;&#22495;&#36866;&#29992;&#21462;&#20915;&#20110;&#20272;&#35745;&#27169;&#22411;&#26159;&#21542;&#25429;&#25417;&#21040;&#21487;&#25512;&#24191;&#32467;&#26500;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#19968;&#20010;&#26131;&#20110;&#22788;&#29702;&#30340;&#8220;&#36328;&#39046;&#22495;&#8221;&#39044;&#27979;&#38382;&#39064;&#65292;&#24182;&#26681;&#25454;&#27169;&#22411;&#22312;&#26032;&#39046;&#22495;&#20013;&#30340;&#34920;&#29616;&#23450;&#20041;&#20102;&#27169;&#22411;&#30340;&#36801;&#31227;&#35823;&#24046;&#12290;&#25105;&#20204;&#25512;&#23548;&#20986;&#26377;&#38480;&#26679;&#26412;&#39044;&#27979;&#21306;&#38388;&#65292;&#24403;&#39046;&#22495;&#29420;&#31435;&#21516;&#20998;&#24067;&#26102;&#65292;&#20445;&#35777;&#20197;&#29992;&#25143;&#36873;&#25321;&#30340;&#27010;&#29575;&#21253;&#21547;&#23454;&#29616;&#30340;&#36801;&#31227;&#35823;&#24046;&#65292;&#24182;&#20351;&#29992;&#36825;&#20123;&#21306;&#38388;&#27604;&#36739;&#32463;&#27982;&#27169;&#22411;&#21644;&#40657;&#30418;&#31639;&#27861;&#22312;&#39044;&#27979;&#30830;&#23450;&#31561;&#20215;&#20540;&#26041;&#38754;&#30340;&#36801;&#31227;&#33021;&#21147;&#12290;&#25105;&#20204;&#21457;&#29616;&#22312;&#36825;&#20010;&#24212;&#29992;&#31243;&#24207;&#20013;&#65292;&#25105;&#20204;&#32771;&#34385;&#30340;&#40657;&#30418;&#31639;&#27861;&#22312;&#30456;&#21516;&#39046;&#22495;&#30340;&#25968;&#25454;&#19978;&#20272;&#35745;&#21644;&#27979;&#35797;&#26102;&#20248;&#20110;&#26631;&#20934;&#32463;&#27982;&#27169;&#22411;&#65292;&#20294;&#32463;&#27982;&#27169;&#22411;&#22312;&#36328;&#39046;&#22495;&#19978;&#30340;&#27867;&#21270;&#33021;&#21147;&#26356;&#24378;&#12290;
&lt;/p&gt;
&lt;p&gt;
Economists often estimate models using data from a particular domain, e.g. estimating risk preferences in a particular subject pool or for a specific class of lotteries. Whether a model's predictions extrapolate well across domains depends on whether the estimated model has captured generalizable structure. We provide a tractable formulation for this "out-of-domain" prediction problem and define the transfer error of a model based on how well it performs on data from a new domain. We derive finite-sample forecast intervals that are guaranteed to cover realized transfer errors with a user-selected probability when domains are iid, and use these intervals to compare the transferability of economic models and black box algorithms for predicting certainty equivalents. We find that in this application, the black box algorithms we consider outperform standard economic models when estimated and tested on data from the same domain, but the economic models generalize across domains better than 
&lt;/p&gt;</description></item></channel></rss>