<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#26412;&#25991;&#25552;&#20379;&#20102;&#20851;&#20110;&#26080;&#27835;&#30103;&#25928;&#24212;&#24322;&#36136;&#24615;&#38646;&#20551;&#35774;&#30340;&#28176;&#36817;&#26377;&#25928;&#27979;&#35797;, &#24182;&#19988;&#38024;&#23545;&#29420;&#29305;&#24322;&#36136;&#24615;&#20351;&#29992;&#20102;&#32463;&#39564;&#29305;&#24449;&#20989;&#25968;&#36991;&#20813;&#20102;&#25200;&#21160;&#21442;&#25968;&#38382;&#39064;, &#36825;&#20010;&#26041;&#27861;&#22312;&#27874;&#26031;&#23612;&#20122;&#21644;&#40657;&#22622;&#21733;&#32500;&#37027;&#30340;&#23567;&#39069;&#20449;&#36151;&#23454;&#39564;&#20013;&#35777;&#26126;&#20102;&#26041;&#27861;&#30340;&#23454;&#29992;&#24615;&#12290;</title><link>http://arxiv.org/abs/2304.01141</link><description>&lt;p&gt;
&#27979;&#35797;&#24322;&#36136;&#21270;&#27835;&#30103;&#25928;&#24212;&#30340;&#29420;&#29305;&#24615;
&lt;/p&gt;
&lt;p&gt;
Testing for idiosyncratic Treatment Effect Heterogeneity. (arXiv:2304.01141v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.01141
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20379;&#20102;&#20851;&#20110;&#26080;&#27835;&#30103;&#25928;&#24212;&#24322;&#36136;&#24615;&#38646;&#20551;&#35774;&#30340;&#28176;&#36817;&#26377;&#25928;&#27979;&#35797;, &#24182;&#19988;&#38024;&#23545;&#29420;&#29305;&#24322;&#36136;&#24615;&#20351;&#29992;&#20102;&#32463;&#39564;&#29305;&#24449;&#20989;&#25968;&#36991;&#20813;&#20102;&#25200;&#21160;&#21442;&#25968;&#38382;&#39064;, &#36825;&#20010;&#26041;&#27861;&#22312;&#27874;&#26031;&#23612;&#20122;&#21644;&#40657;&#22622;&#21733;&#32500;&#37027;&#30340;&#23567;&#39069;&#20449;&#36151;&#23454;&#39564;&#20013;&#35777;&#26126;&#20102;&#26041;&#27861;&#30340;&#23454;&#29992;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20379;&#20102;&#20851;&#20110;&#26080;&#27835;&#30103;&#25928;&#24212;&#24322;&#36136;&#24615;&#38646;&#20551;&#35774;&#30340;&#28176;&#36817;&#26377;&#25928;&#27979;&#35797;&#12290;&#37325;&#35201;&#30340;&#26159;&#65292;&#20316;&#32773;&#32771;&#34385;&#21040;&#24322;&#36136;&#24615;&#30340;&#23384;&#22312;&#65292;&#23427;&#26159;&#30001;&#26410;&#34987;&#35266;&#23519;&#21040;&#30340;&#29305;&#24449;&#25110;&#25152;&#35859;&#30340;&#29420;&#29305;&#24322;&#36136;&#24615;&#24341;&#36215;&#30340;&#12290;&#22312;&#26816;&#26597;&#36825;&#31181;&#24322;&#36136;&#24615;&#26102;&#65292;&#24120;&#35265;&#30340;&#32479;&#35745;&#27979;&#35797;&#23384;&#22312;&#19968;&#20010;&#22312;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#20013;&#30340;&#25200;&#21160;&#21442;&#25968;&#38382;&#39064;&#65292;&#22240;&#27492;&#65292;&#28176;&#36817;&#20998;&#24067;&#20381;&#36182;&#20110;&#35813;&#21442;&#25968;&#30340;&#20272;&#35745;&#12290;&#20316;&#32773;&#25552;&#20986;&#20102;&#19968;&#31181;&#36890;&#36807;&#20351;&#29992;&#32463;&#39564;&#29305;&#24449;&#20989;&#25968;&#36991;&#24320;&#20272;&#35745;&#35813;&#21442;&#25968;&#30340;&#28176;&#36817;&#26377;&#25928;&#27979;&#35797;&#12290;&#36890;&#36807;&#27169;&#25311;&#30740;&#31350;&#65292;&#19981;&#20165;&#35828;&#26126;&#20102;&#36825;&#20010;&#27979;&#35797;&#30340;&#26377;&#25928;&#24615;&#65292;&#32780;&#19988;&#19982;&#30446;&#21069;&#30340;&#27979;&#35797;&#30456;&#27604;&#65292;&#22312;&#25298;&#32477;&#38169;&#35823;&#30340;&#38646;&#20551;&#35774;&#26041;&#38754;&#20855;&#26377;&#26356;&#39640;&#30340;&#21151;&#29575;&#12290;&#27492;&#22806;&#65292;&#20316;&#32773;&#36890;&#36807;&#23558;&#35813;&#26041;&#27861;&#24212;&#29992;&#20110;&#27874;&#26031;&#23612;&#20122;&#21644;&#40657;&#22622;&#21733;&#32500;&#37027;&#30340;&#19968;&#39033;&#23567;&#39069;&#20449;&#36151;&#23454;&#39564;&#26469;&#23637;&#31034;&#35813;&#26041;&#27861;&#30340;&#23454;&#29992;&#24615;&#12290;&#22312;&#36825;&#39033;&#23454;&#39564;&#20013;&#65292;&#38024;&#23545;&#19982;&#36151;&#27454;&#30003;&#35831;&#21644;&#33258;&#38599;&#26377;&#20851;&#30340;&#32467;&#26524;&#65292;&#27979;&#35797;&#34920;&#26126;&#27835;&#30103;&#25928;&#24212;&#23384;&#22312;&#24322;&#36136;&#21270;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper provides asymptotically valid tests for the null hypothesis of no treatment effect heterogeneity. Importantly, I consider the presence of heterogeneity that is not explained by observed characteristics, or so-called idiosyncratic heterogeneity. When examining this heterogeneity, common statistical tests encounter a nuisance parameter problem in the average treatment effect which renders the asymptotic distribution of the test statistic dependent on that parameter. I propose an asymptotically valid test that circumvents the estimation of that parameter using the empirical characteristic function. A simulation study illustrates not only the test's validity but its higher power in rejecting a false null as compared to current tests. Furthermore, I show the method's usefulness through its application to a microfinance experiment in Bosnia and Herzegovina. In this experiment and for outcomes related to loan take-up and self-employment, the tests suggest that treatment effect hete
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31867;&#22522;&#20110;&#20154;&#24037;&#31070;&#32463;&#32593;&#32476;&#21709;&#24212;&#20989;&#25968;&#30340;&#38750;&#32447;&#24615;INGARCH&#27169;&#22411;&#65292;&#33021;&#22815;&#26356;&#22909;&#22320;&#20998;&#26512;&#35745;&#25968;&#26102;&#38388;&#24207;&#21015;&#65292;&#24182;&#22312;&#23454;&#35777;&#20998;&#26512;&#20013;&#24471;&#21040;&#39564;&#35777;&#12290;</title><link>http://arxiv.org/abs/2304.01025</link><description>&lt;p&gt;
&#20154;&#24037;&#31070;&#32463;&#32593;&#32476;&#19982;&#35745;&#25968;&#26102;&#38388;&#24207;&#21015;&#65306;&#19968;&#31867;&#38750;&#32447;&#24615;INGARCH&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
Artificial neural networks and time series of counts: A class of nonlinear INGARCH models. (arXiv:2304.01025v1 [stat.ME])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.01025
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31867;&#22522;&#20110;&#20154;&#24037;&#31070;&#32463;&#32593;&#32476;&#21709;&#24212;&#20989;&#25968;&#30340;&#38750;&#32447;&#24615;INGARCH&#27169;&#22411;&#65292;&#33021;&#22815;&#26356;&#22909;&#22320;&#20998;&#26512;&#35745;&#25968;&#26102;&#38388;&#24207;&#21015;&#65292;&#24182;&#22312;&#23454;&#35777;&#20998;&#26512;&#20013;&#24471;&#21040;&#39564;&#35777;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35745;&#25968;&#26102;&#38388;&#24207;&#21015;&#32463;&#24120;&#20351;&#29992;&#20855;&#26377;&#26465;&#20214;&#24322;&#26041;&#24046;&#24615;&#65288;INGARCH&#65289;&#30340;&#24191;&#20041;&#25972;&#25968;&#20540;&#33258;&#22238;&#24402;&#27169;&#22411;&#36827;&#34892;&#20998;&#26512;&#12290;&#36825;&#20123;&#27169;&#22411;&#20351;&#29992;&#21709;&#24212;&#20989;&#25968;&#23558;&#36807;&#21435;&#35266;&#27979;&#21521;&#37327;&#21644;&#36807;&#21435;&#26465;&#20214;&#26399;&#26395;&#26144;&#23556;&#21040;&#29616;&#22312;&#35266;&#27979;&#30340;&#26465;&#20214;&#26399;&#26395;&#12290;&#26412;&#25991;&#23637;&#31034;&#20102;&#22914;&#20309;&#23558;INGARCH&#27169;&#22411;&#19982;&#20154;&#24037;&#31070;&#32463;&#32593;&#32476;&#65288;ANN&#65289;&#21709;&#24212;&#20989;&#25968;&#30456;&#32467;&#21512;&#65292;&#20197;&#33719;&#24471;&#19968;&#31867;&#38750;&#32447;&#24615;INGARCH&#27169;&#22411;&#12290;ANN&#26694;&#26550;&#20801;&#35768;&#23558;&#35768;&#22810;&#29616;&#26377;&#30340;INGARCH&#27169;&#22411;&#35299;&#37322;&#20026;&#30456;&#24212;&#31070;&#32463;&#27169;&#22411;&#30340;&#36864;&#21270;&#29256;&#26412;&#12290;&#32473;&#20986;&#20102;&#26368;&#22823;&#20284;&#28982;&#20272;&#35745;&#12289;&#36793;&#38469;&#25928;&#24212;&#21644;&#32622;&#20449;&#21306;&#38388;&#30340;&#35814;&#32454;&#20449;&#24687;&#12290;&#35745;&#25968;&#26102;&#38388;&#24207;&#21015;&#30340;&#23454;&#35777;&#20998;&#26512;&#34920;&#26126;&#65292;&#31070;&#32463;INGARCH&#27169;&#22411;&#33021;&#22815;&#22312;&#20449;&#24687;&#25439;&#22833;&#26041;&#38754;&#32988;&#36807;&#21512;&#29702;&#30340;&#36864;&#21270;&#31454;&#20105;&#27169;&#22411;&#12290;
&lt;/p&gt;
&lt;p&gt;
Time series of counts are frequently analyzed using generalized integer-valued autoregressive models with conditional heteroskedasticity (INGARCH). These models employ response functions to map a vector of past observations and past conditional expectations to the conditional expectation of the present observation. In this paper, it is shown how INGARCH models can be combined with artificial neural network (ANN) response functions to obtain a class of nonlinear INGARCH models. The ANN framework allows for the interpretation of many existing INGARCH models as a degenerate version of a corresponding neural model. Details on maximum likelihood estimation, marginal effects and confidence intervals are given. The empirical analysis of time series of bounded and unbounded counts reveals that the neural INGARCH models are able to outperform reasonable degenerate competitor models in terms of the information loss.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25506;&#35752;&#20351;&#29992;&#32463;&#27982;&#20915;&#31574;&#21046;&#23450;&#30340;&#8220;&#39118;&#38505;&#25293;&#25171;&#8221;&#31574;&#30053;&#21487;&#25112;&#32988;&#20165;&#20973;&#24555;&#36895;&#21453;&#24212;&#30340;&#31574;&#30053;&#65292;&#24182;&#24212;&#29992;&#35745;&#31639;&#21338;&#24328;&#35770;&#26500;&#24314;&#20102;ERS&#28216;&#25103;&#30340;&#27169;&#25311;&#22120;&#65292;&#35777;&#26126;&#35813;&#31574;&#30053;&#22312;85%&#30340;&#28216;&#25103;&#20013;&#26377;&#25928;&#12290;</title><link>http://arxiv.org/abs/2304.01007</link><description>&lt;p&gt;
&#29992;&#35745;&#31639;&#21338;&#24328;&#35770;&#25506;&#31350;&#22467;&#21450;&#32769;&#40736;&#22841;&#32440;&#29260;&#28216;&#25103;&#30340;&#20027;&#23548;&#31574;&#30053;
&lt;/p&gt;
&lt;p&gt;
Egyptian Ratscrew: Discovering Dominant Strategies with Computational Game Theory. (arXiv:2304.01007v1 [cs.GT])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.01007
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25506;&#35752;&#20351;&#29992;&#32463;&#27982;&#20915;&#31574;&#21046;&#23450;&#30340;&#8220;&#39118;&#38505;&#25293;&#25171;&#8221;&#31574;&#30053;&#21487;&#25112;&#32988;&#20165;&#20973;&#24555;&#36895;&#21453;&#24212;&#30340;&#31574;&#30053;&#65292;&#24182;&#24212;&#29992;&#35745;&#31639;&#21338;&#24328;&#35770;&#26500;&#24314;&#20102;ERS&#28216;&#25103;&#30340;&#27169;&#25311;&#22120;&#65292;&#35777;&#26126;&#35813;&#31574;&#30053;&#22312;85%&#30340;&#28216;&#25103;&#20013;&#26377;&#25928;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22467;&#21450;&#32769;&#40736;&#22841;&#32440;&#29260;&#28216;&#25103;&#26159;&#19968;&#31181;&#29616;&#20195;&#30340;&#32654;&#22269;&#32440;&#29260;&#28216;&#25103;&#65292;&#34987;&#20840;&#29699;&#25968;&#30334;&#19975;&#29609;&#23478;&#21916;&#29233;&#12290;&#35813;&#28216;&#25103;&#30340;&#30446;&#30340;&#26159;&#25910;&#38598;&#25972;&#21103;&#29260;&#20013;&#25152;&#26377;&#30340;&#29260;&#12290;&#36890;&#24120;&#24773;&#20917;&#19979;&#65292;&#26368;&#24555;&#30340;&#21453;&#24212;&#36895;&#24230;&#26159;&#33719;&#32988;&#30340;&#20851;&#38190;&#65292;&#22240;&#20026;&#25910;&#38598;&#29260;&#30340;&#26368;&#24120;&#35265;&#31574;&#30053;&#26159;&#25104;&#20026;&#31532;&#19968;&#20010;&#22312;&#20013;&#24515;&#22534;&#20013;&#21512;&#27861;&#30340;&#29260;&#32452;&#21512;&#25918;&#19979;&#26102;&#25293;&#25171;&#22534;&#30340;&#29609;&#23478;&#12290;&#22823;&#22810;&#25968;&#29609;&#23478;&#35748;&#20026;&#65292;&#20027;&#23548;&#31574;&#30053;&#26159;&#21457;&#23637;&#27604;&#23545;&#25163;&#26356;&#24555;&#30340;&#21453;&#24212;&#26102;&#38388;&#65292;&#32780;&#35813;&#20551;&#35774;&#24182;&#26410;&#21463;&#21040;&#23398;&#26415;&#30740;&#31350;&#30340;&#25361;&#25112;&#12290;&#36825;&#31687;&#35770;&#25991;&#25506;&#35752;&#20102;&#19968;&#20010;&#8220;&#39118;&#38505;&#25293;&#25171;&#8221;&#31574;&#30053;&#23478;&#30340;&#20551;&#35774;&#65292;&#20182;&#20381;&#36182;&#23454;&#38469;&#30340;&#32463;&#27982;&#20915;&#31574;&#26469;&#25112;&#32988;&#37027;&#20123;&#21482;&#20381;&#36182;&#24555;&#36895;&#21453;&#24212;&#30340;&#29609;&#23478;&#65292;&#20174;&#32780;&#22312;&#28216;&#25103;&#20013;&#33719;&#24471;&#21387;&#20498;&#24615;&#30340;&#32988;&#21033;&#12290;&#29702;&#35770;&#19978;&#65292;&#36825;&#21487;&#20197;&#36890;&#36807;&#21033;&#29992;&#8220;&#28903;&#29260;&#35268;&#21017;&#8221;&#26469;&#23454;&#29616;&#65292;&#36825;&#26159;&#19968;&#31181;&#32602;&#27454;&#35268;&#21017;&#65292;&#36807;&#20110;&#20302;&#24265;&#65292;&#26080;&#27861;&#26377;&#25928;&#22320;&#38459;&#27490;&#29609;&#23478;&#38750;&#27861;&#22320;&#25293;&#25171;&#29260;&#22534;&#32780;&#33719;&#30410;&#12290;&#25105;&#20204;&#20351;&#29992;Ruby&#32534;&#31243;&#35821;&#35328;&#26500;&#24314;&#20102;&#19968;&#27454;ERS&#27169;&#25311;&#22120;&#65292;&#20854;&#20013;&#8220;&#39118;&#38505;&#25293;&#25171;&#8221;&#31574;&#30053;&#22312;&#32422;85%&#30340;&#28216;&#25103;&#20013;&#20987;&#36133;&#20102;&#24555;&#36895;&#21453;&#24212;&#31574;&#30053;&#12290;&#36825;&#25903;&#25345;&#20102;&#23454;&#36341;&#35777;&#26126;&#65292;&#32463;&#27982;&#20915;&#31574;&#21046;&#23450;&#21487;&#20197;&#25104;&#20026;ERS&#20013;&#19968;&#31181;&#26377;&#25928;&#30340;&#31574;&#30053;&#65292;&#21338;&#24328;&#35770;&#21487;&#25104;&#20026;&#20102;&#35299;&#21644;&#25913;&#36827;&#28216;&#25103;&#29609;&#27861;&#30340;&#26377;&#20215;&#20540;&#24037;&#20855;&#12290;
&lt;/p&gt;
&lt;p&gt;
"Egyptian Ratscrew" (ERS) is a modern American card game enjoyed by millions of players worldwide. A game of ERS is won by collecting all of the cards in the deck. Typically this game is won by the player with the fastest reflexes, since the most common strategy for collecting cards is being the first to slap the pile in the center whenever legal combinations of cards are placed down. Most players assume that the dominant strategy is to develop a faster reaction time than your opponents, and no academic inquiry has been levied against this assumption. This thesis investigates the hypothesis that a "risk slapping" strategist who relies on practical economic decision making will win an overwhelming majority of games against players who rely on quick reflexes alone. It is theorized that this can be done by exploiting the "burn rule," a penalty that is too low-cost to effectively dissuade players from slapping illegally when it benefits them. Using the Ruby programming language, we constru
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#38754;&#26495;&#22810;&#39033;&#24335;&#36873;&#25321;&#27169;&#22411;&#65292;&#36890;&#36807;&#35266;&#27979;&#21040;&#30340;&#29305;&#24449;&#20801;&#35768;&#20004;&#31181;&#21830;&#21697;&#30340;&#26367;&#20195;&#21644;&#20114;&#34917;&#65292;&#24182;&#25552;&#20379;&#20102;&#21830;&#21697;&#20043;&#38388;&#20114;&#34917;&#20851;&#31995;&#30340;&#21487;&#26816;&#39564;&#25512;&#35770;&#21644;&#28857;&#35782;&#21035;&#30340;&#20805;&#20998;&#26465;&#20214;&#12290;</title><link>http://arxiv.org/abs/2304.00678</link><description>&lt;p&gt;
&#26816;&#27979;&#21644;&#30830;&#35748;&#26367;&#20195;&#19982;&#20114;&#34917;&#27169;&#24335;
&lt;/p&gt;
&lt;p&gt;
Testing and Identifying Substitution and Complementarity Patterns. (arXiv:2304.00678v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.00678
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#38754;&#26495;&#22810;&#39033;&#24335;&#36873;&#25321;&#27169;&#22411;&#65292;&#36890;&#36807;&#35266;&#27979;&#21040;&#30340;&#29305;&#24449;&#20801;&#35768;&#20004;&#31181;&#21830;&#21697;&#30340;&#26367;&#20195;&#21644;&#20114;&#34917;&#65292;&#24182;&#25552;&#20379;&#20102;&#21830;&#21697;&#20043;&#38388;&#20114;&#34917;&#20851;&#31995;&#30340;&#21487;&#26816;&#39564;&#25512;&#35770;&#21644;&#28857;&#35782;&#21035;&#30340;&#20805;&#20998;&#26465;&#20214;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#20351;&#29992;&#21253;&#21547;&#21830;&#21697;&#32452;&#21512;&#30340;&#38754;&#26495;&#22810;&#39033;&#24335;&#36873;&#25321;&#27169;&#22411;&#23545;&#20004;&#31181;&#21830;&#21697;&#20043;&#38388;&#30340;&#26367;&#20195;&#21644;&#20114;&#34917;&#27169;&#24335;&#36827;&#34892;&#21322;&#21442;&#25968;&#35782;&#21035;&#12290;&#35813;&#27169;&#22411;&#20801;&#35768;&#20004;&#31181;&#21830;&#21697;&#26159;&#26367;&#20195;&#21697;&#25110;&#20114;&#34917;&#21697;&#65292;&#24182;&#36890;&#36807;&#35266;&#27979;&#21040;&#30340;&#29305;&#24449;&#20801;&#35768;&#24322;&#36136;&#20114;&#34917;&#12290;&#25105;&#39318;&#20808;&#25552;&#20379;&#20102;&#21830;&#21697;&#20043;&#38388;&#20114;&#34917;&#20851;&#31995;&#30340;&#21487;&#26816;&#39564;&#25512;&#35770;&#12290;&#28982;&#21518;&#65292;&#25105;&#25551;&#36848;&#20102;&#35813;&#27169;&#22411;&#21442;&#25968;&#30340;&#23574;&#38160;&#35782;&#21035;&#38598;&#24182;&#25552;&#20379;&#20102;&#28857;&#35782;&#21035;&#30340;&#20805;&#20998;&#26465;&#20214;&#12290;&#35813;&#35782;&#21035;&#20998;&#26512;&#36866;&#24212;&#20102;&#20869;&#29983;&#21327;&#21464;&#37327;&#65292;&#24182;&#36890;&#36807;&#35266;&#27979;&#29305;&#24449;&#21644;&#22266;&#23450;&#25928;&#24212;&#20043;&#38388;&#30340;&#26580;&#24615;&#20381;&#36182;&#32467;&#26500;&#25918;&#24323;&#23545;&#26410;&#35266;&#27979;&#21040;&#30340;&#20559;&#22909;&#38663;&#33633;&#30340;&#20998;&#24067;&#20551;&#35774;&#12290;&#36890;&#36807;&#33945;&#29305;&#21345;&#32599;&#27169;&#25311;&#65292;&#25105;&#30340;&#26041;&#27861;&#34987;&#35777;&#26126;&#27604;&#21442;&#25968;&#26041;&#27861;&#26356;&#21152;&#31283;&#20581;&#12290;&#25193;&#23637;&#20013;&#65292;&#25105;&#20801;&#35768;&#20114;&#34917;&#20013;&#23384;&#22312;&#26410;&#35266;&#27979;&#21040;&#30340;&#24322;&#36136;&#24615;&#65292;&#30740;&#31350;&#28041;&#21450;&#20004;&#20010;&#20197;&#19978;&#21830;&#21697;&#30340;&#24773;&#20917;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper studies semiparametric identification of substitution and complementarity patterns between two goods using a panel multinomial choice model with bundles. The model allows the two goods to be either substitutes or complements and admits heterogeneous complementarity through observed characteristics. I first provide testable implications for the complementarity relationship between goods. I then characterize the sharp identified set for the model parameters and provide sufficient conditions for point identification. The identification analysis accommodates endogenous covariates through flexible dependence structures between observed characteristics and fixed effects while placing no distributional assumptions on unobserved preference shocks. My method is shown to perform more robustly than the parametric method through Monte Carlo simulations. As an extension, I allow for unobserved heterogeneity in the complementarity, investigate scenarios involving more than two goods, and 
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#30740;&#31350;&#21457;&#29616;&#65292;&#29983;&#27963;&#22312;&#20849;&#20135;&#20027;&#20041;&#21046;&#24230;&#19979;&#30340;&#26397;&#40092;&#38590;&#27665;&#23545;&#36164;&#26412;&#20027;&#20041;&#31038;&#20250;&#23384;&#22312;&#38544;&#24615;&#20559;&#35265;&#65292;&#36825;&#31181;&#20559;&#35265;&#21487;&#20197;&#39044;&#27979;&#20854;&#22312;&#24066;&#22330;&#32463;&#27982;&#20013;&#30340;&#20302;&#32463;&#27982;&#34920;&#29616;&#12290;</title><link>http://arxiv.org/abs/2304.00651</link><description>&lt;p&gt;
&#38024;&#23545;&#36164;&#26412;&#20027;&#20041;&#31038;&#20250;&#30340;&#38544;&#24615;&#20559;&#35265;&#39044;&#27979;&#24066;&#22330;&#25910;&#30410;
&lt;/p&gt;
&lt;p&gt;
Implicit Bias against a Capitalistic Society Predicts Market Earnings. (arXiv:2304.00651v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.00651
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#30740;&#31350;&#21457;&#29616;&#65292;&#29983;&#27963;&#22312;&#20849;&#20135;&#20027;&#20041;&#21046;&#24230;&#19979;&#30340;&#26397;&#40092;&#38590;&#27665;&#23545;&#36164;&#26412;&#20027;&#20041;&#31038;&#20250;&#23384;&#22312;&#38544;&#24615;&#20559;&#35265;&#65292;&#36825;&#31181;&#20559;&#35265;&#21487;&#20197;&#39044;&#27979;&#20854;&#22312;&#24066;&#22330;&#32463;&#27982;&#20013;&#30340;&#20302;&#32463;&#27982;&#34920;&#29616;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25506;&#35752;&#20102;&#29983;&#27963;&#22312;&#20849;&#20135;&#20027;&#20041;&#21046;&#24230;&#19979;&#30340;&#24847;&#35782;&#24418;&#24577;&#28748;&#36755;&#26159;&#21542;&#19982;&#24066;&#22330;&#32463;&#27982;&#20013;&#30340;&#20302;&#32463;&#27982;&#34920;&#29616;&#30456;&#20851;&#32852;&#12290;&#25105;&#20204;&#25307;&#21215;&#20102;&#26397;&#40092;&#38590;&#27665;&#65292;&#24182;&#20351;&#29992;&#38544;&#24615;&#32852;&#24819;&#27979;&#35797;&#26469;&#34913;&#37327;&#20182;&#20204;&#23545;&#38889;&#22269;&#30340;&#38544;&#24615;&#20559;&#35265;&#12290;&#36890;&#36807;&#36827;&#34892;&#21452;&#21521;&#25293;&#21334;&#21644;&#21452;&#36793;&#35848;&#21028;&#24066;&#22330;&#23454;&#39564;&#65292;&#25105;&#20204;&#21457;&#29616;&#23545;&#36164;&#26412;&#20027;&#20041;&#31038;&#20250;&#26377;&#26356;&#22823;&#20559;&#35265;&#30340;&#26397;&#40092;&#38590;&#27665;&#20854;&#23545;&#33258;&#24049;&#25910;&#30410;&#28508;&#21147;&#30340;&#26399;&#26395;&#26356;&#20302;&#65292;&#23637;&#29616;&#20986;&#26356;&#20302;&#30446;&#26631;&#21033;&#28070;&#30340;&#20132;&#26131;&#34892;&#20026;&#65292;&#24182;&#33719;&#24471;&#26356;&#23569;&#30340;&#21033;&#28070;&#12290;&#36825;&#20123;&#20851;&#32852;&#32467;&#26524;&#22312;&#32771;&#34385;&#20559;&#22909;&#12289;&#20154;&#21147;&#36164;&#26412;&#21644;&#21516;&#21270;&#20307;&#39564;&#30340;&#30456;&#20851;&#22240;&#32032;&#21518;&#20173;&#28982;&#31283;&#20581;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper investigates whether ideological indoctrination by living in a communist regime relates to low economic performance in a market economy. We recruit North Korean refugees and measure their implicit bias against South Korea by using the Implicit Association Test. Conducting double auction and bilateral bargaining market experiments, we find that North Korean refugees with a larger bias against the capitalistic society have lower expectations about their earning potential, exhibit trading behavior with lower target profits, and earn less profits. These associations are robust to conditioning on correlates of preferences, human capital, and assimilation experiences.
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#20004;&#31181;&#21322;&#21442;&#25968;&#20272;&#35745;&#22120;&#21644;&#19968;&#31181;&#22522;&#20110;&#31163;&#25955;&#21270;&#30340;&#20272;&#35745;&#22120;&#65292;&#21487;&#20197;&#22312;&#19981;&#38656;&#35201;&#25490;&#38500;&#24037;&#20855;&#21464;&#37327;&#30340;&#24773;&#20917;&#19979;&#37492;&#21035;&#20869;&#29983;&#32447;&#24615;&#22238;&#24402;&#27169;&#22411;&#65292;&#24182;&#19988;&#36825;&#20123;&#20272;&#35745;&#26041;&#27861;&#22312;&#26377;&#38480;&#26679;&#26412;&#20013;&#34920;&#29616;&#33391;&#22909;&#12290;</title><link>http://arxiv.org/abs/2304.00626</link><description>&lt;p&gt;
&#21253;&#21547;&#24037;&#20855;&#21464;&#37327;&#30340;&#20869;&#29983;&#32447;&#24615;&#22238;&#24402;
&lt;/p&gt;
&lt;p&gt;
Endogenous Linear Regressions with Included Instrumental Variables. (arXiv:2304.00626v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.00626
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#20004;&#31181;&#21322;&#21442;&#25968;&#20272;&#35745;&#22120;&#21644;&#19968;&#31181;&#22522;&#20110;&#31163;&#25955;&#21270;&#30340;&#20272;&#35745;&#22120;&#65292;&#21487;&#20197;&#22312;&#19981;&#38656;&#35201;&#25490;&#38500;&#24037;&#20855;&#21464;&#37327;&#30340;&#24773;&#20917;&#19979;&#37492;&#21035;&#20869;&#29983;&#32447;&#24615;&#22238;&#24402;&#27169;&#22411;&#65292;&#24182;&#19988;&#36825;&#20123;&#20272;&#35745;&#26041;&#27861;&#22312;&#26377;&#38480;&#26679;&#26412;&#20013;&#34920;&#29616;&#33391;&#22909;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#23637;&#31034;&#20102;&#22312;&#26631;&#20934;&#22343;&#20540;&#29420;&#31435;&#26465;&#20214;&#21644;&#32473;&#23450;&#21253;&#21547;&#22806;&#29983;&#21327;&#21464;&#37327;&#30340;&#26465;&#20214;&#19979;&#20869;&#29983;&#32447;&#24615;&#22238;&#24402;&#27169;&#22411;&#21487;&#20197;&#22312;&#19981;&#38656;&#35201;&#25490;&#38500;&#24037;&#20855;&#21464;&#37327;&#30340;&#24773;&#20917;&#19979;&#34987;&#37492;&#21035;&#12290;&#22522;&#20110;&#37492;&#21035;&#32467;&#26524;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#20004;&#20010;&#21322;&#21442;&#25968;&#20272;&#35745;&#22120;&#65292;&#20197;&#21450;&#19968;&#31181;&#19981;&#38656;&#35201;&#38750;&#21442;&#25968;&#22238;&#24402;&#30340;&#22522;&#20110;&#31163;&#25955;&#21270;&#30340;&#20272;&#35745;&#22120;&#12290;&#25105;&#20204;&#24314;&#31435;&#20102;&#23427;&#20204;&#30340;&#28176;&#36827;&#27491;&#24577;&#24615;&#65292;&#25552;&#20379;&#20102;&#30456;&#24212;&#30340;&#26041;&#24046;&#20272;&#35745;&#22120;&#65292;&#24182;&#36890;&#36807;&#27169;&#25311;&#28436;&#31034;&#20102;&#25105;&#20204;&#25552;&#20986;&#30340;&#20272;&#35745;&#21644;&#25512;&#26029;&#31243;&#24207;&#30340;&#33391;&#22909;&#26377;&#38480;&#26679;&#26412;&#34920;&#29616;&#12290;&#29305;&#21035;&#22320;&#65292;&#25105;&#20204;&#21457;&#29616;&#22522;&#20110;&#31163;&#25955;&#21270;&#30340;&#20272;&#35745;&#22120;&#22312;&#26377;&#38480;&#26679;&#26412;&#20013;&#34920;&#29616;&#38750;&#24120;&#22909;&#65292;&#21516;&#26102;&#35745;&#31639;&#38750;&#24120;&#31616;&#21333;&#21644;&#24555;&#36895;&#12290;
&lt;/p&gt;
&lt;p&gt;
We show that endogenous linear regression models can be identified without excluded instrumental variables, based on the standard mean independence condition and a no-multicollinearity condition on the conditional expectations of endogenous covariates given the included exogenous covariates. Based on the identification results, we propose two semiparametric estimators as well as a discretization-based estimator that does not require any nonparametric regressions. We establish their asymptotic normality, provide corresponding variance estimators, and demonstrate via simulations the good finite-sample performances of our proposed estimation and inference procedures. In particular, we find that the discretization-based estimator performs remarkably well in finite samples, while being very simple and fast to compute.
&lt;/p&gt;</description></item><item><title>&#26412;&#25253;&#21578;&#22522;&#20110;Rapa Nui&#23707;&#21644;&#22235;&#20010;&#22478;&#24066;&#30340;&#26696;&#20363;&#65292;&#21033;&#29992;&#36719;&#29289;&#36136;&#31185;&#23398;&#24037;&#20855;&#27979;&#35797;&#20102;&#20154;&#21475;&#21464;&#21270;&#27169;&#24335;&#65292;&#24182;&#25581;&#31034;&#20102;&#21463;&#21382;&#21490;&#21644;&#31038;&#20250;&#32463;&#27982;&#32972;&#26223;&#20197;&#21450;&#20154;&#21475;&#21464;&#21270;&#30340;&#38271;&#26399;&#20915;&#23450;&#20027;&#20041;&#24433;&#21709;&#30340;&#20154;&#21475;&#21464;&#21270;&#30340;&#32553;&#25918;&#27169;&#24335;&#12290;</title><link>http://arxiv.org/abs/2304.00566</link><description>&lt;p&gt;
&#19968;&#20010;&#23707;&#23679;&#21644;&#22235;&#20010;&#22478;&#24066;&#30340;&#25925;&#20107;&#12290;&#22522;&#20110;&#31038;&#20250;&#32463;&#27982;&#36719;&#29289;&#36136;&#27169;&#22411;&#30340;&#25253;&#21578;&#12290;
&lt;/p&gt;
&lt;p&gt;
The Story about One Island and Four Cities. The Socio-Economic Soft Matter Model - Based Report. (arXiv:2304.00566v1 [physics.soc-ph])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.00566
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25253;&#21578;&#22522;&#20110;Rapa Nui&#23707;&#21644;&#22235;&#20010;&#22478;&#24066;&#30340;&#26696;&#20363;&#65292;&#21033;&#29992;&#36719;&#29289;&#36136;&#31185;&#23398;&#24037;&#20855;&#27979;&#35797;&#20102;&#20154;&#21475;&#21464;&#21270;&#27169;&#24335;&#65292;&#24182;&#25581;&#31034;&#20102;&#21463;&#21382;&#21490;&#21644;&#31038;&#20250;&#32463;&#27982;&#32972;&#26223;&#20197;&#21450;&#20154;&#21475;&#21464;&#21270;&#30340;&#38271;&#26399;&#20915;&#23450;&#20027;&#20041;&#24433;&#21709;&#30340;&#20154;&#21475;&#21464;&#21270;&#30340;&#32553;&#25918;&#27169;&#24335;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25253;&#21578;&#35752;&#35770;&#20102;&#31038;&#20250;&#32463;&#27982;&#36719;&#29289;&#36136;(SE-SM)&#30340;&#20986;&#29616;&#65292;&#23427;&#26159;&#29289;&#29702;&#23398;&#21644;&#32463;&#27982;&#23398;&#30456;&#20114;&#20316;&#29992;&#30340;&#32467;&#26524;&#12290;&#39318;&#20808;&#65292;&#20351;&#29992;&#36719;&#29289;&#36136;&#31185;&#23398;&#24037;&#20855;&#27979;&#35797;&#33258;&#24037;&#19994;&#38761;&#21629;&#20197;&#26469;&#30340;&#20154;&#21475;&#21464;&#21270;&#65292;&#25903;&#25345;&#21019;&#26032;&#30340;&#22522;&#20110;&#34893;&#29983;&#21697;&#21644;&#22833;&#30495;&#25935;&#24863;&#20998;&#26512;&#24037;&#20855;&#12290;&#32467;&#26524;&#26174;&#31034;&#21576;Weibull&#31867;&#22411;&#30340;&#24130;&#27425;&#25351;&#25968;&#22686;&#38271;&#65292;&#33258;1970&#24180;&#20195;&#20197;&#26469;&#19978;&#21319;&#36895;&#24230;&#26174;&#33879;&#38477;&#20302;&#12290;&#38543;&#21518;&#65292;&#23545;Rapa Nui&#65288;&#22797;&#27963;&#23707;&#65289;&#27169;&#22411;&#26696;&#20363;&#21644;&#22235;&#20010;&#22823;&#22411;&#8220;&#26631;&#24535;&#24615;&#22478;&#24066;&#8221;&#36827;&#34892;&#20102;&#20154;&#21475;&#27169;&#24335;&#27979;&#35797;&#65292;&#20854;&#20013;&#21253;&#25324;&#32654;&#22269;&#30340;&#24213;&#29305;&#24459;&#21644;&#20811;&#21033;&#22827;&#20848;&#20197;&#21450;&#27874;&#20848;&#30340;&#27931;&#33576;&#65288;&#21069;&#32442;&#32455;&#24037;&#19994;&#20013;&#24515;&#65289;&#21644;&#27604;&#25176;&#22982;&#65288;&#21069;&#29028;&#28845;&#37319;&#30719;&#20013;&#24515;&#65289;&#12290;&#20998;&#26512;&#26126;&#30830;&#25581;&#31034;&#20102;&#21463;&#21382;&#21490;&#21644;&#31038;&#20250;&#32463;&#27982;&#32972;&#26223;&#20197;&#21450;&#20154;&#21475;&#21464;&#21270;&#30340;&#38271;&#26399;&#20915;&#23450;&#20027;&#20041;&#24433;&#21709;&#30340;&#20154;&#21475;&#21464;&#21270;&#30340;&#32553;&#25918;&#27169;&#24335;&#12290;&#36890;&#29992;&#24615;&#30340;&#25968;&#25454;&#34920;&#26126;&#65306;&#20154;&#31867;&#27963;&#21160;&#20986;&#29616;&#35268;&#27169;&#25928;&#24212;&#12290;
&lt;/p&gt;
&lt;p&gt;
The report discusses the emergence of the Socio-Economic Soft Matter (SE-SM) as the result of interactions between physics and economy. First, demographic changes since the Industrial Revolution onset are tested using Soft Matter science tools. Notable in the support of innovative derivative-based and distortions-sensitive analytic tools. It revealed the Weibull type powered exponential increase, with a notably lesser rising rate since the crossover detected near the year 1970. Subsequently, demographic (SE-SM) patterns are tested for Rapa Nui (Easter) Island model case and for four large 'hallmark cities' where the rise and decay phases have occurred. They are Detroit and Cleveland in the USA and Lodz (former textile industry center) and Bytom (former coal mining center) in Poland. The analysis explicitly revealed scaling patterns for demographic changes, influenced by the historical and socio-economic backgrounds and the long-lasting determinism in population changes. Universalistic 
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#32844;&#19994;&#27969;&#21160;&#24615;&#21608;&#26399;&#24615;&#31243;&#24230;&#23545;&#24635;&#22833;&#19994;&#29575;&#21450;&#20854;&#25345;&#32493;&#26102;&#38388;&#20998;&#24067;&#30340;&#24433;&#21709;&#65292;&#24182;&#24320;&#21457;&#20102;&#19968;&#20010;&#22810;&#37096;&#38376;&#21830;&#19994;&#21608;&#26399;&#27169;&#22411;&#65292;&#24471;&#20986;&#20102;&#30001;&#20110;&#24037;&#20154;&#32844;&#19994;&#21069;&#26223;&#21464;&#21270;&#24341;&#36215;&#30340;&#22833;&#19994;&#25345;&#32493;&#26102;&#38388;&#20998;&#24067;&#21644;&#24635;&#22833;&#19994;&#29575;&#27874;&#21160;&#30340;&#32467;&#35770;&#12290;</title><link>http://arxiv.org/abs/2304.00544</link><description>&lt;p&gt;
&#21830;&#19994;&#21608;&#26399;&#20013;&#30340;&#22833;&#19994;&#29575;&#21644;&#20869;&#29983;&#35843;&#25972;
&lt;/p&gt;
&lt;p&gt;
Unemployment and Endogenous Reallocation over the Business Cycle. (arXiv:2304.00544v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.00544
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#32844;&#19994;&#27969;&#21160;&#24615;&#21608;&#26399;&#24615;&#31243;&#24230;&#23545;&#24635;&#22833;&#19994;&#29575;&#21450;&#20854;&#25345;&#32493;&#26102;&#38388;&#20998;&#24067;&#30340;&#24433;&#21709;&#65292;&#24182;&#24320;&#21457;&#20102;&#19968;&#20010;&#22810;&#37096;&#38376;&#21830;&#19994;&#21608;&#26399;&#27169;&#22411;&#65292;&#24471;&#20986;&#20102;&#30001;&#20110;&#24037;&#20154;&#32844;&#19994;&#21069;&#26223;&#21464;&#21270;&#24341;&#36215;&#30340;&#22833;&#19994;&#25345;&#32493;&#26102;&#38388;&#20998;&#24067;&#21644;&#24635;&#22833;&#19994;&#29575;&#27874;&#21160;&#30340;&#32467;&#35770;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#32844;&#19994;&#27969;&#21160;&#24615;&#21608;&#26399;&#24615;&#31243;&#24230;&#23545;&#24635;&#22833;&#19994;&#29575;&#21450;&#20854;&#25345;&#32493;&#26102;&#38388;&#20998;&#24067;&#30340;&#24433;&#21709;&#12290;&#25105;&#20204;&#35760;&#24405;&#20102;&#24037;&#20154;&#32844;&#19994;&#27969;&#21160;&#24615;&#19982;&#22833;&#19994;&#25345;&#32493;&#26102;&#38388;&#22312;&#38271;&#26399;&#21644;&#21830;&#19994;&#21608;&#26399;&#19978;&#30340;&#20851;&#31995;&#12290;&#20026;&#20102;&#35299;&#37322;&#36825;&#19968;&#35777;&#25454;&#65292;&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#20010;&#20855;&#26377;&#24322;&#36136;&#24615;&#20195;&#29702;&#21830;&#30340;&#22810;&#37096;&#38376;&#21830;&#19994;&#21608;&#26399;&#27169;&#22411;&#12290;&#35813;&#27169;&#22411;&#19982;&#32654;&#22269;&#21171;&#21160;&#21147;&#24066;&#22330;&#30340;&#20960;&#20010;&#37325;&#35201;&#29305;&#24449;&#22312;&#25968;&#37327;&#19978;&#20445;&#25345;&#19968;&#33268;&#65306;&#27611;&#21608;&#26399;&#24615;&#30340;&#20928;&#32844;&#19994;&#27969;&#21160;&#21644;&#21453;&#21608;&#26399;&#24615;&#30340;&#20928;&#32844;&#19994;&#27969;&#21160;&#65292;&#22833;&#19994;&#29575;&#30340;&#22823;&#27874;&#21160;&#20197;&#21450;&#22833;&#19994;&#25345;&#32493;&#26102;&#38388;&#20998;&#24067;&#30340;&#21608;&#26399;&#29305;&#24615;&#31561;&#12290;&#25105;&#20204;&#30340;&#20998;&#26512;&#26174;&#31034;&#65292;&#30001;&#20110;&#24037;&#20154;&#32844;&#19994;&#21069;&#26223;&#30340;&#21464;&#21270;&#65292;&#32780;&#19981;&#26159;&#25972;&#20010;&#32844;&#19994;&#30340;&#24046;&#24322;&#65292;&#19982;&#24635;&#20307;&#32463;&#27982;&#29615;&#22659;&#20114;&#21160;&#65292;&#25512;&#21160;&#20102;&#22833;&#19994;&#25345;&#32493;&#26102;&#38388;&#20998;&#24067;&#21644;&#24635;&#22833;&#19994;&#29575;&#30340;&#27874;&#21160;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper studies the extent to which the cyclicality of occupational mobility shapes that of aggregate unemployment and its duration distribution. We document the relation between workers' occupational mobility and unemployment duration over the long run and business cycle. To interpret this evidence, we develop a multi-sector business cycle model with heterogenous agents. The model is quantitatively consistent with several important features of the US labor market: procyclical gross and countercyclical net occupational mobility, the large volatility of unemployment and the cyclical properties of the unemployment duration distribution, among many others. Our analysis shows that occupational mobility due to workers; changing career prospects, and not occupation-wide differences, interacts with aggregate conditions to drive the fluctuations of the unemployment duration distribution and the aggregate unemployment rate.
&lt;/p&gt;</description></item><item><title>&#30740;&#31350;&#21457;&#29616;&#65292;&#20044;&#25289;&#22317;&#22919;&#22899;&#22312;&#19981;&#21516;&#29983;&#27542;&#38454;&#27573;&#30340;&#29983;&#32946;&#29575;&#21463;&#21040;&#32463;&#27982;&#34920;&#29616;&#12289;&#25945;&#32946;&#21644;&#23156;&#20799;&#27515;&#20129;&#29575;&#30340;&#24433;&#21709;&#12290;20&#23681;&#33267;29&#23681;&#22899;&#24615;&#30340;&#25910;&#20837;&#19982;&#29983;&#32946;&#29575;&#21576;&#36127;&#30456;&#20851;&#65307;&#25945;&#32946;&#19982;&#38738;&#23569;&#24180;&#29983;&#32946;&#29575;&#21576;&#36127;&#30456;&#20851;&#12290;&#38656;&#35201;&#21046;&#23450;&#30456;&#24212;&#30340;&#20844;&#20849;&#25919;&#31574;&#12290;</title><link>http://arxiv.org/abs/2304.00539</link><description>&lt;p&gt;
&#20044;&#25289;&#22317;&#29983;&#32946;&#29575;&#30340;&#30701;&#26399;&#21644;&#38271;&#26399;&#20915;&#23450;&#22240;&#32032;
&lt;/p&gt;
&lt;p&gt;
The short- and long-term determinants of fertility in Uruguay. (arXiv:2304.00539v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.00539
&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#21457;&#29616;&#65292;&#20044;&#25289;&#22317;&#22919;&#22899;&#22312;&#19981;&#21516;&#29983;&#27542;&#38454;&#27573;&#30340;&#29983;&#32946;&#29575;&#21463;&#21040;&#32463;&#27982;&#34920;&#29616;&#12289;&#25945;&#32946;&#21644;&#23156;&#20799;&#27515;&#20129;&#29575;&#30340;&#24433;&#21709;&#12290;20&#23681;&#33267;29&#23681;&#22899;&#24615;&#30340;&#25910;&#20837;&#19982;&#29983;&#32946;&#29575;&#21576;&#36127;&#30456;&#20851;&#65307;&#25945;&#32946;&#19982;&#38738;&#23569;&#24180;&#29983;&#32946;&#29575;&#21576;&#36127;&#30456;&#20851;&#12290;&#38656;&#35201;&#21046;&#23450;&#30456;&#24212;&#30340;&#20844;&#20849;&#25919;&#31574;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25506;&#35752;&#20102;&#20044;&#25289;&#22317;&#19981;&#21516;&#29983;&#32946;&#38454;&#27573;&#22919;&#22899;&#29983;&#32946;&#29575;&#30340;&#20915;&#23450;&#22240;&#32032;&#12290;&#20026;&#27492;&#65292;&#25105;&#20204;&#36816;&#29992;&#26102;&#38388;&#24207;&#21015;&#20998;&#26512;&#26041;&#27861;&#65292;&#22522;&#20110;1968&#24180;&#33267;2021&#24180;&#30340;&#25968;&#25454;&#21644;&#22522;&#20110;1984&#24180;&#33267;2019&#24180;&#30340;&#37096;&#38376;&#32423;&#32479;&#35745;&#20449;&#24687;&#30340;&#38754;&#26495;&#25968;&#25454;&#25216;&#26415;&#12290;&#25105;&#20204;&#30340;&#31532;&#19968;&#27425;&#35745;&#37327;&#32463;&#27982;&#23398;&#23454;&#39564;&#32467;&#26524;&#26174;&#31034;&#20102;&#29983;&#32946;&#29575;&#19982;&#32463;&#27982;&#34920;&#29616;&#12289;&#25945;&#32946;&#21644;&#23156;&#20799;&#27515;&#20129;&#29575;&#20043;&#38388;&#30340;&#21327;&#25972;&#20851;&#31995;&#65292;&#19981;&#21516;&#30340;&#29983;&#27542;&#38454;&#27573;&#35266;&#23519;&#21040;&#24046;&#24322;&#12290;&#25105;&#20204;&#21457;&#29616;&#23545;&#20110;20&#23681;&#33267;29&#23681;&#30340;&#22899;&#24615;&#65292;&#25910;&#20837;&#19982;&#29983;&#32946;&#29575;&#21576;&#36127;&#30456;&#20851;&#65292;&#36825;&#20010;&#32467;&#26524;&#22312;30&#23681;&#20197;&#19978;&#30340;&#22899;&#24615;&#20013;&#20173;&#28982;&#23384;&#22312;&#12290;&#36825;&#20010;&#32467;&#26524;&#34920;&#26126;&#65292;&#23545;&#20110;&#36825;&#20010;&#24180;&#40836;&#32452;&#30340;&#22899;&#24615;&#26469;&#35828;&#65292;&#29983;&#23401;&#23376;&#34987;&#30475;&#20316;&#26159;&#19968;&#31181;&#26426;&#20250;&#25104;&#26412;&#12290;&#25105;&#20204;&#20063;&#35266;&#23519;&#21040;&#25945;&#32946;&#19982;&#38738;&#23569;&#24180;&#29983;&#32946;&#29575;&#20043;&#38388;&#23384;&#22312;&#36127;&#30456;&#20851;&#20851;&#31995;&#65292;&#36825;&#23545;&#20844;&#20849;&#25919;&#31574;&#30340;&#35774;&#35745;&#26377;&#30528;&#37325;&#35201;&#24847;&#20041;&#12290;&#36890;&#36807;&#35745;&#37327;&#32463;&#27982;&#23398;&#25216;&#26415;&#25511;&#21046;&#26410;&#35266;&#23519;&#21040;&#30340;&#24322;&#36136;&#24615;&#30340;&#38754;&#26495;&#25968;&#25454;&#20998;&#26512;&#65292;&#35777;&#23454;&#20102;&#25105;&#20040;&#30340;&#31532;&#19968;&#27425;&#23454;&#39564;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper examines the determinants of fertility among women at different stages of their reproductive lives in Uruguay. To this end, we employ time series analysis methods based on data from 1968 to 2021 and panel data techniques based on department-level statistical information from 1984 to 2019. The results of our first econometric exercise indicate a cointegration relationship between fertility and economic performance, education and infant mortality, with differences observed by reproductive stage. We find a negative relationship between income and fertility for women aged 20-29 that persists for women aged 30 and over. This result suggests that having children is perceived as an opportunity cost for women in this age group. We also observe a negative relationship between education and adolescent fertility, which has implications for the design of public policies. A panel data analysis with econometric techniques allowing us to control for unobserved heterogeneity confirms that i
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#36807;&#21435;20&#24180;&#25216;&#26415;&#21644;&#38750;&#25216;&#26415;&#34892;&#19994;&#30340;&#20849;&#21516;&#21464;&#21270;&#65292;&#21457;&#29616;&#20174;2015&#24180;&#24320;&#22987;&#23384;&#22312;&#25216;&#26415;&#37096;&#38376;&#19982;&#38750;&#25216;&#26415;&#37096;&#38376;&#30340;&#20998;&#31163;&#29616;&#35937;&#65292;&#24182;&#35777;&#26126;&#25216;&#26415;&#37096;&#38376;&#26159;&#20854;&#20182;&#32463;&#27982;&#39046;&#22495;&#22686;&#38271;&#30340;&#39046;&#20808;&#25351;&#26631;&#12290;</title><link>http://arxiv.org/abs/2304.00510</link><description>&lt;p&gt;
&#25216;&#26415;&#20998;&#31163;&#29616;&#35937;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
The Tech Decoupling. (arXiv:2304.00510v1 [q-fin.ST])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.00510
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#36807;&#21435;20&#24180;&#25216;&#26415;&#21644;&#38750;&#25216;&#26415;&#34892;&#19994;&#30340;&#20849;&#21516;&#21464;&#21270;&#65292;&#21457;&#29616;&#20174;2015&#24180;&#24320;&#22987;&#23384;&#22312;&#25216;&#26415;&#37096;&#38376;&#19982;&#38750;&#25216;&#26415;&#37096;&#38376;&#30340;&#20998;&#31163;&#29616;&#35937;&#65292;&#24182;&#35777;&#26126;&#25216;&#26415;&#37096;&#38376;&#26159;&#20854;&#20182;&#32463;&#27982;&#39046;&#22495;&#22686;&#38271;&#30340;&#39046;&#20808;&#25351;&#26631;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#37329;&#34701;&#24066;&#22330;&#27874;&#21160;&#23545;&#25237;&#36164;&#35745;&#21010;&#12289;&#26399;&#26435;&#23450;&#20215;&#21644;&#37329;&#34701;&#24066;&#22330;&#30417;&#31649;&#33267;&#20851;&#37325;&#35201;&#65292;&#32780;&#25216;&#26415;&#34987;&#24191;&#27867;&#35748;&#20026;&#26159;&#32463;&#27982;&#22686;&#38271;&#30340;&#20851;&#38190;&#39537;&#21160;&#22240;&#32032;&#12290;&#22312;&#36825;&#20010;&#39033;&#30446;&#20013;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#36807;&#21435;&#20108;&#21313;&#24180;&#25216;&#26415;&#21644;&#38750;&#25216;&#26415;&#34892;&#19994;&#30340;&#20849;&#21516;&#21464;&#21270;&#12290;&#25105;&#20204;&#21457;&#29616;&#33258;2015&#24180;&#20197;&#26469;&#65292;&#36825;&#20004;&#20010;&#34892;&#19994;&#30340;&#27700;&#24179;&#21644;&#27874;&#21160;&#24615;&#23384;&#22312;&#20998;&#31163;&#29616;&#35937;&#65292;&#36825;&#19981;&#33021;&#24402;&#22240;&#20110;COVID-19&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#25216;&#26415;&#37096;&#38376;&#26159;&#20854;&#20182;&#32463;&#27982;&#39046;&#22495;&#22686;&#38271;&#30340;&#39046;&#20808;&#25351;&#26631;&#12290;&#25105;&#20204;&#36816;&#29992;ARIMA&#27169;&#22411;&#21644;&#24179;&#31283;&#24615;&#27979;&#35797;&#22788;&#29702;&#26102;&#38388;&#24207;&#21015;&#25968;&#25454;&#20197;&#27979;&#35797;&#25105;&#20204;&#30340;&#20551;&#35774;&#65292;&#21457;&#29616;&#25216;&#26415;&#37096;&#38376;&#36981;&#24490;ARIMA&#65288;3,1,3&#65289;&#27169;&#22411;&#65292;&#32780;&#38750;&#25216;&#26415;&#37096;&#38376;&#36981;&#24490;ARIMA&#65288;2,1,4&#65289;&#27169;&#22411;&#12290;&#25105;&#20204;&#30340;&#20998;&#26512;&#28041;&#21450;&#25968;&#25454;&#22788;&#29702;&#65292;&#21069;&#26399;&#39044;&#22788;&#29702;&#65292;&#32570;&#22833;&#20540;&#22788;&#29702;&#21644;&#25506;&#32034;&#24615;&#25968;&#25454;&#20998;&#26512;&#65292;&#24182;&#35752;&#35770;&#20102;&#25105;&#20204;&#24037;&#20316;&#30340;&#20248;&#28857;&#21644;&#32570;&#28857;&#12290;
&lt;/p&gt;
&lt;p&gt;
Financial market volatility is a crucial factor for investment planning, option pricing, and financial market regulation, and technology is widely recognized as a key driver of economic growth. In this project, we investigate the co-movement of technology and non-technology sectors over the last two decades. We identify a decoupling phenomenon in the levels and volatility of the two sectors after 2015 and argue that this cannot be attributed to the COVID-19 shock. Furthermore, we demonstrate that the technology sector serves as a leading indicator of growth for the rest of the economy. Using ARIMA modeling and stationarity tests, we process time series data to test our hypotheses, finding that the technology sector follows an ARIMA(3,1,3) model, while the non-technology sector follows an ARIMA(2,1,4) model. Our analysis encompasses data wrangling, pre-processing, missing value treatment, and exploratory data analysis, and we discuss the merits and shortcomings of our work to aid in the
&lt;/p&gt;</description></item><item><title>&#30740;&#31350;&#32467;&#26524;&#26174;&#31034;&#65292;&#22312;&#21046;&#36896;&#19994;&#20013;&#65292;&#36164;&#26412;&#25237;&#36164;&#21487;&#20197;&#24110;&#21161;&#25552;&#39640;&#21171;&#21160;&#29983;&#20135;&#29575;&#20197;&#20248;&#21270;&#20135;&#33021;&#21033;&#29992;&#24182;&#20943;&#23569;&#36807;&#21097;&#20135;&#33021;&#12290;</title><link>http://arxiv.org/abs/2304.00489</link><description>&lt;p&gt;
&#36164;&#26412;&#23494;&#38598;&#24230;&#23545;&#20135;&#33021;&#36807;&#21097;&#30340;&#21453;&#24212;&#20943;&#23569;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Reduction of Excess Capacity with Response of Capital Intensity. (arXiv:2304.00489v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.00489
&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#32467;&#26524;&#26174;&#31034;&#65292;&#22312;&#21046;&#36896;&#19994;&#20013;&#65292;&#36164;&#26412;&#25237;&#36164;&#21487;&#20197;&#24110;&#21161;&#25552;&#39640;&#21171;&#21160;&#29983;&#20135;&#29575;&#20197;&#20248;&#21270;&#20135;&#33021;&#21033;&#29992;&#24182;&#20943;&#23569;&#36807;&#21097;&#20135;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#26088;&#22312;&#23637;&#31034;&#22312;&#21046;&#36896;&#19994;&#20013;&#65292;&#21171;&#21160;&#29983;&#20135;&#29575;&#22686;&#38271;&#29575;&#23545;&#36164;&#26412;&#23494;&#24230;&#28508;&#22312;&#38477;&#20302;&#20135;&#33021;&#36807;&#21097;&#30340;&#21453;&#24212;&#12290;&#35813;&#30740;&#31350;&#37319;&#29992;&#20102;&#20462;&#25913;&#21518;&#30340;VES&#65288;&#21487;&#21464;&#24377;&#24615;&#26367;&#20195;&#65289;&#20272;&#35745;&#27169;&#22411;&#65292;&#24182;&#22312;&#21360;&#24230;&#20845;&#20010;&#20027;&#35201;&#24037;&#19994;&#24030;&#30340;55&#20010;&#21046;&#36896;&#19994;&#38598;&#22242;&#20013;&#36827;&#34892;&#20102;&#35843;&#26597;&#12290;&#32467;&#26524;&#21457;&#29616;&#65292;&#22312;&#25152;&#26377;&#34892;&#19994;&#32452;&#20013;&#38468;&#21152;&#30340;&#36164;&#26412;&#23494;&#24230;&#21442;&#25968;&#65288;mu&#65289;&#22343;&#22823;&#20110;&#38646;&#65292;&#36825;&#24847;&#21619;&#30528;&#36890;&#36807;&#22686;&#21152;&#27599;&#20301;&#24037;&#20154;&#30340;&#36164;&#26412;&#65292;&#21487;&#20197;&#33719;&#24471;&#26356;&#39640;&#30340;&#20135;&#37327;&#12290;&#22240;&#27492;&#65292;&#22312;&#21046;&#36896;&#19994;&#20013;&#65292;&#38656;&#35201;&#36827;&#34892;&#36164;&#26412;&#25237;&#36164;&#20197;&#25552;&#39640;&#21171;&#21160;&#29983;&#20135;&#29575;&#65292;&#20174;&#32780;&#20248;&#21270;&#21097;&#20313;&#20135;&#33021;&#21033;&#29992;&#65292;&#23454;&#29616;&#26356;&#39640;&#30340;&#29983;&#20135;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;
Purpose: The objective of this research was to show the response of the potential reduction of excess capacity in terms of capital intensity to the growth rate of labor productivity in the manufacturing industrial sector. Design/Methodology/Approach: The research was carried out in 2019 in 55 groups of Indian manufacturing industry within six major Indian industrial states. Mainly, the research used the modified VES (Variable Elasticity Substitution) estimation model. The research focused on the value of the additional substitution parameter of capital intensity (mu &gt; 0). Findings: Almost all selected industry groups with in six states need capital-intensive production. The results found additional parameter of capital intensity (mu) is greater than zero for all industry groups. It means that a higher product per man can be obtained by increasing the capital per worker. Practical Implications: Research shows that an increasingly need for capital investment in need for higher labor prod
&lt;/p&gt;</description></item><item><title>&#35813;&#30740;&#31350;&#26088;&#22312;&#20026;&#29616;&#26377;&#30340;&#20013;&#23618;&#24314;&#31569;&#25913;&#24314;&#25552;&#20379;&#36335;&#32447;&#22270;&#65292;&#20197;&#20102;&#35299;&#21152;&#25343;&#22823;&#20013;&#23618;&#20303;&#23429;&#24314;&#31569;&#25152;&#38656;&#30340;&#36164;&#26412;&#25237;&#36164;&#12289;&#33410;&#33021;&#12289;&#33410;&#33021;&#25104;&#26412;&#21644;&#30899;&#36275;&#36857;&#12290;&#36890;&#36807;&#33021;&#28304;&#27169;&#25311;&#36719;&#20214;&#21644;&#25104;&#26412;&#25490;&#25918;&#25968;&#25454;&#30340;&#32467;&#21512;&#65292;&#35780;&#20272;&#20102;11&#31181;&#33410;&#33021;&#25913;&#24314;&#25514;&#26045;&#30340;&#32463;&#27982;&#21644;&#29615;&#22659;&#24615;&#33021;&#12290;</title><link>http://arxiv.org/abs/2304.00456</link><description>&lt;p&gt;
&#28145;&#24230;&#33410;&#33021;&#25913;&#36896;&#30340;&#23551;&#21629;&#21608;&#26399;&#25104;&#26412;&#20998;&#26512;&#65292;&#20197;&#29702;&#35299;&#33021;&#28304;&#20445;&#25252;&#25514;&#26045;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
Life cycle costing analysis of deep energy retrofits of a mid-rise building to understand the impact of energy conservation measures. (arXiv:2304.00456v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.00456
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#26088;&#22312;&#20026;&#29616;&#26377;&#30340;&#20013;&#23618;&#24314;&#31569;&#25913;&#24314;&#25552;&#20379;&#36335;&#32447;&#22270;&#65292;&#20197;&#20102;&#35299;&#21152;&#25343;&#22823;&#20013;&#23618;&#20303;&#23429;&#24314;&#31569;&#25152;&#38656;&#30340;&#36164;&#26412;&#25237;&#36164;&#12289;&#33410;&#33021;&#12289;&#33410;&#33021;&#25104;&#26412;&#21644;&#30899;&#36275;&#36857;&#12290;&#36890;&#36807;&#33021;&#28304;&#27169;&#25311;&#36719;&#20214;&#21644;&#25104;&#26412;&#25490;&#25918;&#25968;&#25454;&#30340;&#32467;&#21512;&#65292;&#35780;&#20272;&#20102;11&#31181;&#33410;&#33021;&#25913;&#24314;&#25514;&#26045;&#30340;&#32463;&#27982;&#21644;&#29615;&#22659;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24314;&#31569;&#33021;&#28304;&#25913;&#24314;&#34987;&#35270;&#20026;&#23454;&#29616;&#21152;&#25343;&#22823;&#27668;&#20505;&#20943;&#32531;&#30446;&#26631;&#30340;&#20851;&#38190;&#12290;&#35813;&#30740;&#31350;&#26088;&#22312;&#20026;&#29616;&#26377;&#30340;&#20013;&#23618;&#24314;&#31569;&#25913;&#24314;&#25552;&#20379;&#36335;&#32447;&#22270;&#65292;&#20197;&#20102;&#35299;&#21152;&#25343;&#22823;&#20013;&#23618;&#20303;&#23429;&#24314;&#31569;&#25152;&#38656;&#30340;&#36164;&#26412;&#25237;&#36164;&#12289;&#33410;&#33021;&#12289;&#33410;&#33021;&#25104;&#26412;&#21644;&#30899;&#36275;&#36857;&#12290;&#35813;&#30740;&#31350;&#37319;&#29992;EnergyPlus&#23545;&#19981;&#21015;&#39072;&#21733;&#20262;&#27604;&#20122;&#30465;&#28201;&#21733;&#21326;&#22823;&#37117;&#20250;&#22320;&#21306;&#30340;&#19968;&#24231;&#22810;&#21333;&#20803;&#20303;&#23429;&#24314;&#31569;&#36827;&#34892;&#20102;11&#31181;&#33410;&#33021;&#25913;&#24314;&#25514;&#26045;&#30340;&#33021;&#37327;&#24615;&#33021;&#35780;&#20272;&#12290;&#20316;&#32773;&#20351;&#29992;EnergyPlus&#33021;&#28304;&#27169;&#25311;&#36719;&#20214;&#26469;&#35780;&#20272;&#25152;&#36873;MURB&#30340;&#25913;&#24314;&#21069;&#21644;&#25913;&#24314;&#21518;&#25805;&#20316;&#33021;&#28304;&#24615;&#33021;&#65292;&#36890;&#36807;&#32467;&#21512;&#25104;&#26412;&#21644;&#25490;&#25918;&#24433;&#21709;&#25968;&#25454;&#35780;&#20272;&#20102;&#25152;&#36873;&#33410;&#33021;&#25913;&#24314;&#25514;&#26045;&#30340;&#32463;&#27982;&#21644;&#29615;&#22659;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;
Building energy retrofits have been identified as key to realizing climate mitigation goals in Canada. This study aims to provide a roadmap for existing mid-rise building retrofits in order to understand the required capital investment, energy savings, energy cost savings, and carbon footprint for mid-rise residential buildings in Canada. This study employed EnergyPlus to examine the energy performance of 11 energy retrofit measures for a typical multi-unit residential building (MURB) in Metro Vancouver, British Columbia, Canada. The author employed the energy simulation software (EnergyPlus) to evaluate the pre-and post-retrofit operational energy performance of the selected MURB. Two base building models powered by natural gas (NG-building) and electricity (E-building) were created by SketchUP. The energy simulation results were combined with cost and emission impact data to evaluate the economic and environmental performance of the selected energy retrofit measures. The results indi
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#28966;&#28857;&#37327;&#21270;&#21709;&#24212;&#22343;&#34913;&#65288;Focal QRE&#65289;&#20316;&#20026;&#37327;&#21270;&#21709;&#24212;&#22343;&#34913;&#65288;QRE&#65289;&#30340;&#19968;&#31181;&#24191;&#20041;&#24418;&#24335;&#65292;&#23427;&#33021;&#22815;&#31995;&#32479;&#22320;&#32771;&#34385;&#29609;&#23478;&#26377;&#38480;&#29702;&#24615;&#30340;&#19981;&#21516;&#24418;&#24335;&#65292;&#24182;&#20197;&#21518;&#24724;&#20026;&#22522;&#30784;&#65292;&#30456;&#23545;&#20934;&#30830;&#22320;&#39044;&#27979;&#31574;&#30053;&#20309;&#26102;&#20250;&#34987;&#26356;&#39057;&#32321;&#22320;&#36873;&#25321;&#12290;</title><link>http://arxiv.org/abs/2304.00438</link><description>&lt;p&gt;
&#28966;&#28857;&#37327;&#21270;&#21709;&#24212;&#22343;&#34913;
&lt;/p&gt;
&lt;p&gt;
The Focal Quantal Response Equilibrium. (arXiv:2304.00438v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.00438
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#28966;&#28857;&#37327;&#21270;&#21709;&#24212;&#22343;&#34913;&#65288;Focal QRE&#65289;&#20316;&#20026;&#37327;&#21270;&#21709;&#24212;&#22343;&#34913;&#65288;QRE&#65289;&#30340;&#19968;&#31181;&#24191;&#20041;&#24418;&#24335;&#65292;&#23427;&#33021;&#22815;&#31995;&#32479;&#22320;&#32771;&#34385;&#29609;&#23478;&#26377;&#38480;&#29702;&#24615;&#30340;&#19981;&#21516;&#24418;&#24335;&#65292;&#24182;&#20197;&#21518;&#24724;&#20026;&#22522;&#30784;&#65292;&#30456;&#23545;&#20934;&#30830;&#22320;&#39044;&#27979;&#31574;&#30053;&#20309;&#26102;&#20250;&#34987;&#26356;&#39057;&#32321;&#22320;&#36873;&#25321;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#37327;&#21270;&#21709;&#24212;&#22343;&#34913;&#65288;QRE&#65289;&#30340;&#19968;&#31181;&#24191;&#20041;&#24418;&#24335;&#65292;&#35813;&#27169;&#22411;&#24314;&#31435;&#22312;&#19968;&#20010;&#31616;&#21333;&#30340;&#21069;&#25552;&#19978;&#65306;&#26377;&#20123;&#34892;&#20026;&#27604;&#20854;&#20182;&#34892;&#20026;&#26356;&#20855;&#28966;&#28857;&#24615;&#12290;&#22312;&#25105;&#20204;&#30340;&#27169;&#22411;&#20013;&#65292;&#25105;&#20204;&#31216;&#20043;&#20026;&#28966;&#28857;&#37327;&#21270;&#21709;&#24212;&#22343;&#34913;&#65288;Focal QRE&#65289;&#65292;&#27599;&#20010;&#29609;&#23478;&#37117;&#20197;QRE&#20013;&#30340;&#38543;&#26426;&#32435;&#20160;&#22343;&#34913;&#31574;&#30053;&#36827;&#34892;&#28216;&#25103;&#65292;&#20294;&#26159;&#19968;&#20123;&#31574;&#30053;&#26159;&#28966;&#28857;&#31574;&#30053;&#65292;&#22240;&#27492;&#22312;&#32771;&#34385;&#26399;&#26395;&#25928;&#29992;&#21518;&#65292;&#30456;&#23545;&#36739;&#39057;&#32321;&#22320;&#34987;&#36873;&#25321;&#12290; Focal QRE&#33021;&#22815;&#31995;&#32479;&#22320;&#32771;&#34385;&#29609;&#23478;&#30340;&#21508;&#31181;&#26377;&#38480;&#29702;&#24615;&#24418;&#24335;&#65292;&#23588;&#20854;&#26159;&#21518;&#24724;-&#35268;&#36991;&#65292;&#26174;&#33879;&#24615;&#25110;&#26377;&#38480;&#32771;&#34385;&#12290; Focal QRE&#36824;&#26377;&#21161;&#20110;&#35299;&#37322;&#22312;&#19981;&#21516;&#28216;&#25103;&#20013;&#29609;&#23478;&#30340;&#26377;&#38480;&#29702;&#24615;&#35266;&#23519;&#21040;&#30340;&#24322;&#36136;&#24615;&#12290; &#25105;&#20204;&#23637;&#31034;&#20102;&#22522;&#20110;&#21518;&#24724;&#30340;&#28966;&#28857;&#38598;&#30456;&#23545;&#20110;&#20854;&#39044;&#26399;&#25928;&#29992;&#26356;&#33021;&#20934;&#30830;&#22320;&#39044;&#27979;&#31574;&#30053;&#20309;&#26102;&#34987;&#26356;&#39057;&#32321;&#22320;&#36873;&#25321;&#12290;
&lt;/p&gt;
&lt;p&gt;
We propose a generalization of Quantal Response Equilibrium (QRE) built on a simple premise: some actions are more focal than others. In our model, which we call the Focal Quantal Response Equilibrium (Focal QRE), each player plays a stochastic version of Nash equilibrium as in the QRE, but some strategies are focal and thus are chosen relatively more frequently than other strategies after accounting for expected utilities. The Focal QRE is able to systemically account for various forms of bounded rationality of players, especially regret-aversion, salience, or limited consideration. The Focal QRE is also useful to explain observed heterogeneity of bounded rationality of players across different games. We show that regret-based focal sets perform relatively well at predicting strategies that are chosen more frequently relative to their expected utilities.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#28608;&#21169;&#23545;&#25112;&#30053;&#28216;&#25103;&#20013;&#36873;&#25321;&#21644;&#20449;&#24565;&#30340;&#24433;&#21709;&#65292;&#36890;&#36807;&#23454;&#39564;&#35777;&#26126;&#22312;&#25903;&#37197;&#21487;&#35299;&#28216;&#25103;&#20013;&#65292;&#26356;&#39640;&#30340;&#28608;&#21169;&#27700;&#24179;&#21487;&#20197;&#25552;&#39640;&#34892;&#21160;&#30340;&#22797;&#26434;&#24615;&#21644;&#26368;&#20339;&#21709;&#24212;&#29575;&#65292;&#24182;&#20943;&#23569;&#38169;&#35823;&#20542;&#21521;&#65307;&#32780;&#22312;&#31616;&#21333;&#28216;&#25103;&#20013;&#65292;&#26356;&#39640;&#33258;&#36523;&#28608;&#21169;&#20250;&#20351;&#20449;&#24565;&#26356;&#21152;&#20934;&#30830;&#12290;&#20294;&#26159;&#65292;&#20855;&#26377;&#26356;&#39640;&#28608;&#21169;&#27700;&#24179;&#30340;&#23545;&#25163;&#26356;&#38590;&#39044;&#27979;&#19988;&#20449;&#24565;&#20063;&#26356;&#21152;&#26377;&#20559;&#35265;&#12290;&#30740;&#31350;&#36824;&#21457;&#29616;&#65292;&#28608;&#21169;&#21487;&#20197;&#24433;&#21709;&#35748;&#30693;&#21162;&#21147;&#21644;&#34920;&#29616;&#65292;&#20854;&#19982;&#36873;&#25321;&#21644;&#20449;&#24565;&#22797;&#26434;&#24615;&#30456;&#20851;&#12290;</title><link>http://arxiv.org/abs/2304.00412</link><description>&lt;p&gt;
&#28608;&#21169;&#23545;&#28216;&#25103;&#20013;&#36873;&#25321;&#21644;&#20449;&#24565;&#30340;&#24433;&#21709;&#65306;&#19968;&#20010;&#23454;&#39564;
&lt;/p&gt;
&lt;p&gt;
The Effects of Incentives on Choices and Beliefs in Games: An Experiment. (arXiv:2304.00412v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.00412
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#28608;&#21169;&#23545;&#25112;&#30053;&#28216;&#25103;&#20013;&#36873;&#25321;&#21644;&#20449;&#24565;&#30340;&#24433;&#21709;&#65292;&#36890;&#36807;&#23454;&#39564;&#35777;&#26126;&#22312;&#25903;&#37197;&#21487;&#35299;&#28216;&#25103;&#20013;&#65292;&#26356;&#39640;&#30340;&#28608;&#21169;&#27700;&#24179;&#21487;&#20197;&#25552;&#39640;&#34892;&#21160;&#30340;&#22797;&#26434;&#24615;&#21644;&#26368;&#20339;&#21709;&#24212;&#29575;&#65292;&#24182;&#20943;&#23569;&#38169;&#35823;&#20542;&#21521;&#65307;&#32780;&#22312;&#31616;&#21333;&#28216;&#25103;&#20013;&#65292;&#26356;&#39640;&#33258;&#36523;&#28608;&#21169;&#20250;&#20351;&#20449;&#24565;&#26356;&#21152;&#20934;&#30830;&#12290;&#20294;&#26159;&#65292;&#20855;&#26377;&#26356;&#39640;&#28608;&#21169;&#27700;&#24179;&#30340;&#23545;&#25163;&#26356;&#38590;&#39044;&#27979;&#19988;&#20449;&#24565;&#20063;&#26356;&#21152;&#26377;&#20559;&#35265;&#12290;&#30740;&#31350;&#36824;&#21457;&#29616;&#65292;&#28608;&#21169;&#21487;&#20197;&#24433;&#21709;&#35748;&#30693;&#21162;&#21147;&#21644;&#34920;&#29616;&#65292;&#20854;&#19982;&#36873;&#25321;&#21644;&#20449;&#24565;&#22797;&#26434;&#24615;&#30456;&#20851;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#19968;&#20010;&#23454;&#39564;&#65292;&#20197;&#30830;&#23450;&#28608;&#21169;&#27700;&#24179;&#23545;&#25112;&#30053;&#35774;&#32622;&#19979;&#36873;&#25321;&#21644;&#20449;&#24565;&#30340;&#22240;&#26524;&#25928;&#24212;&#65292;&#20854;&#20013;&#23545;&#25163;&#30340;&#34892;&#20026;&#34987;&#22266;&#23450;&#12290;&#22312;&#25903;&#37197;&#21487;&#35299;&#30340;&#28216;&#25103;&#20013;&#65292;&#26356;&#39640;&#30340;&#28608;&#21169;&#27700;&#24179;&#22686;&#21152;&#20102;&#34892;&#21160;&#30340;&#22797;&#26434;&#24615;&#21644;&#26368;&#20339;&#21709;&#24212;&#29575;&#65292;&#24182;&#20943;&#23569;&#20102;&#38169;&#35823;&#20542;&#21521;&#12290;&#22312;&#31616;&#21333;&#28216;&#25103;&#20013;&#65292;&#26356;&#39640;&#33258;&#36523;&#28608;&#21169;&#24448;&#24448;&#20351;&#24471;&#20449;&#24565;&#26356;&#21152;&#20934;&#30830;&#12290;&#28982;&#32780;&#65292;&#20855;&#26377;&#26356;&#39640;&#28608;&#21169;&#27700;&#24179;&#30340;&#23545;&#25163;&#26356;&#38590;&#39044;&#27979;&#65306;&#24403;&#23545;&#25163;&#20855;&#26377;&#26356;&#39640;&#28608;&#21169;&#27700;&#24179;&#26102;&#65292;&#20449;&#24565;&#20250;&#36319;&#36394;&#23545;&#25163;&#30340;&#34892;&#20026;&#65292;&#20294;&#23545;&#23545;&#25163;&#30340;&#20449;&#24565;&#20063;&#20250;&#21464;&#24471;&#26356;&#21152;&#26377;&#20559;&#35265;&#12290;&#25105;&#20204;&#25552;&#20379;&#35777;&#25454;&#34920;&#26126;&#28608;&#21169;&#24433;&#21709;&#20102;&#35748;&#30693;&#21162;&#21147;&#65292;&#24182;&#19988;&#26356;&#22823;&#30340;&#21162;&#21147;&#25552;&#39640;&#20102;&#34920;&#29616;&#65292;&#24182;&#19988;&#39044;&#27979;&#20102;&#36873;&#25321;&#21644;&#20449;&#24565;&#30340;&#22797;&#26434;&#24615;&#12290;&#24635;&#30340;&#26469;&#35828;&#65292;&#25968;&#25454;&#25903;&#25345;&#23558;&#20381;&#36182;&#20110;&#22238;&#25253;&#30340;&#38169;&#35823;&#19982;&#26114;&#36149;&#30340;&#25512;&#29702;&#30456;&#32467;&#21512;&#12290;
&lt;/p&gt;
&lt;p&gt;
How and why do incentive levels affect strategic behavior? This paper examines an experiment designed to identify the causal effect of scaling up incentives on choices and beliefs in strategic settings by holding fixed opponents' actions. In dominance-solvable games, higher incentives increase action sophistication and best-response rates and decrease mistake propensity. Beliefs tend to become more accurate with higher own incentives in simple games. However, opponents with higher incentive levels are harder to predict: while beliefs track opponents' behavior when they have higher incentive levels, beliefs about opponents also become more biased. We provide evidence that incentives affect cognitive effort and that greater effort increases performance and predicts choice and belief sophistication. Overall, the data lends support to combining both payoff-dependent mistakes and costly reasoning.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#22522;&#20110;&#26368;&#22823;&#21152;&#27861;&#21516;&#27493;&#30340;&#21435;&#20013;&#24515;&#21270;&#26426;&#21046;&#65292;&#29992;&#20110;&#20132;&#26131;&#25104;&#26412;&#32422;&#26463;&#30340;&#26367;&#20195;&#21697;&#23450;&#20215;&#21644;&#20132;&#25442;&#65292;&#23558;&#28041;&#21450;&#30340;&#28909;&#26041;&#31243;&#30340;&#26102;&#19981;&#21464;&#35299;&#23450;&#20041;&#20026;&#36817;&#20284;&#22343;&#34913;&#29366;&#24577;&#65292;&#24182;&#30740;&#31350;&#35299;&#38598;&#30340;&#20195;&#25968;&#24615;&#36136;&#21644;&#21160;&#24577;&#31995;&#32479;&#30340;&#25910;&#25947;&#34892;&#20026;&#12290;&#25991;&#20013;&#30340;RRAggU&#31639;&#27861;&#22312;&#25968;&#20540;&#27169;&#25311;&#20013;&#35777;&#26126;&#20102;&#29702;&#35770;&#30340;&#27491;&#30830;&#24615;&#12290;</title><link>http://arxiv.org/abs/2304.00210</link><description>&lt;p&gt;
&#22522;&#20110;&#26368;&#22823;&#21152;&#27861;&#21516;&#27493;&#30340;&#20998;&#25955;&#20132;&#26131;&#31995;&#32479;
&lt;/p&gt;
&lt;p&gt;
Max-Plus Synchronization in Decentralized Trading Systems. (arXiv:2304.00210v1 [cs.GT])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.00210
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#22522;&#20110;&#26368;&#22823;&#21152;&#27861;&#21516;&#27493;&#30340;&#21435;&#20013;&#24515;&#21270;&#26426;&#21046;&#65292;&#29992;&#20110;&#20132;&#26131;&#25104;&#26412;&#32422;&#26463;&#30340;&#26367;&#20195;&#21697;&#23450;&#20215;&#21644;&#20132;&#25442;&#65292;&#23558;&#28041;&#21450;&#30340;&#28909;&#26041;&#31243;&#30340;&#26102;&#19981;&#21464;&#35299;&#23450;&#20041;&#20026;&#36817;&#20284;&#22343;&#34913;&#29366;&#24577;&#65292;&#24182;&#30740;&#31350;&#35299;&#38598;&#30340;&#20195;&#25968;&#24615;&#36136;&#21644;&#21160;&#24577;&#31995;&#32479;&#30340;&#25910;&#25947;&#34892;&#20026;&#12290;&#25991;&#20013;&#30340;RRAggU&#31639;&#27861;&#22312;&#25968;&#20540;&#27169;&#25311;&#20013;&#35777;&#26126;&#20102;&#29702;&#35770;&#30340;&#27491;&#30830;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#31181;&#21435;&#20013;&#24515;&#21270;&#26426;&#21046;&#65292;&#29992;&#20110;&#23450;&#20215;&#21644;&#20132;&#25442;&#21463;&#20132;&#26131;&#25104;&#26412;&#32422;&#26463;&#30340;&#26367;&#20195;&#21697;&#12290;&#25105;&#20204;&#23558;&#19968;&#20010;(&#21152;&#26435;)&#22612;&#26031;&#22522;&#25289;&#26222;&#25289;&#26031;&#31639;&#23376;&#28041;&#21450;&#30340;&#28909;&#26041;&#31243;&#30340;&#26102;&#19981;&#21464;&#35299;&#65292;&#23450;&#20041;&#20026;&#26368;&#22823;&#21152;&#27861;&#30697;&#38453;&#21152;&#26435;&#22270;&#30340;&#36817;&#20284;&#22343;&#34913;&#29366;&#24577;&#65292;&#24182;&#30740;&#31350;&#35299;&#38598;&#30340;&#20195;&#25968;&#24615;&#36136;&#21644;&#21160;&#24577;&#31995;&#32479;&#30340;&#25910;&#25947;&#34892;&#20026;&#12290;&#25105;&#20204;&#23558;&#36825;&#20123;&#24037;&#20855;&#24212;&#29992;&#20110;&#23558;&#31232;&#32570;&#36164;&#28304;&#20998;&#37197;&#32473;&#31454;&#20105;&#29992;&#36884;&#30340;&#8220;&#32463;&#27982;&#38382;&#39064;&#8221;&#12290;&#25105;&#20204;&#30340;&#29702;&#35770;&#34920;&#26126;&#65292;&#31454;&#20105;&#22343;&#34913;&#12289;&#35848;&#21028;&#25110;&#25104;&#26412;&#25928;&#30410;&#20998;&#26512;&#22312;&#19981;&#21516;&#24773;&#22659;&#20013;&#30340;&#24046;&#24322;&#65292;&#24456;&#22823;&#31243;&#24230;&#19978;&#21462;&#20915;&#20110;&#20132;&#26131;&#25104;&#26412;&#22312;&#20915;&#31574;&#36807;&#31243;&#20013;&#30340;&#24046;&#24322;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#21516;&#27493;&#31639;&#27861;(RRAggU)&#30340;&#25968;&#20540;&#27169;&#25311;&#65292;&#35777;&#26126;&#20102;&#25105;&#20204;&#29702;&#35770;&#19978;&#30340;&#21457;&#29616;&#12290;
&lt;/p&gt;
&lt;p&gt;
We introduce a decentralized mechanism for pricing and exchanging alternatives constrained by transaction costs. We characterize the time-invariant solutions of a heat equation involving a (weighted) Tarski Laplacian operator, defined for max-plus matrix-weighted graphs, as approximate equilibria of the trading system. We study algebraic properties of the solution sets as well as convergence behavior of the dynamical system. We apply these tools to the ``economic problem'' of allocating scarce resources among competing uses. Our theory suggests differences in competitive equilibrium, bargaining, or cost-benefit analysis, depending on the context, are largely due to differences in the way that transaction costs are incorporated into the decision-making process. We present numerical simulations of the synchronization algorithm (RRAggU), demonstrating our theoretical findings.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#31934;&#36873;&#32508;&#36848;&#20102;&#20351;&#29992;&#26426;&#22120;&#23398;&#20064;&#24037;&#20855;&#36827;&#34892;&#32463;&#27982;&#23398;&#30740;&#31350;&#21644;&#25919;&#31574;&#20998;&#26512;&#30340;&#25991;&#31456;&#65292;&#24378;&#35843;&#20102;&#26426;&#22120;&#23398;&#20064;&#22312;&#22788;&#29702;&#38750;&#20256;&#32479;&#21644;&#38750;&#32467;&#26500;&#21270;&#25968;&#25454;&#12289;&#25429;&#25417;&#24378;&#38750;&#32447;&#24615;&#24615;&#21644;&#25552;&#39640;&#39044;&#27979;&#20934;&#30830;&#24615;&#26041;&#38754;&#30340;&#24212;&#29992;&#20248;&#21183;&#65292;&#25104;&#20026;&#35745;&#37327;&#32463;&#27982;&#23398;&#23478;&#24037;&#20855;&#31665;&#20013;&#19981;&#21487;&#25110;&#32570;&#30340;&#19968;&#37096;&#20998;&#12290;</title><link>http://arxiv.org/abs/2304.00086</link><description>&lt;p&gt;
&#26426;&#22120;&#23398;&#20064;&#22312;&#32463;&#27982;&#30740;&#31350;&#20013;&#30340;&#24212;&#29992;&#65306;&#20309;&#26102;&#12289;&#20160;&#20040;&#21644;&#22914;&#20309;&#36816;&#29992;&#65311;
&lt;/p&gt;
&lt;p&gt;
Machine Learning for Economics Research: When What and How?. (arXiv:2304.00086v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.00086
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#31934;&#36873;&#32508;&#36848;&#20102;&#20351;&#29992;&#26426;&#22120;&#23398;&#20064;&#24037;&#20855;&#36827;&#34892;&#32463;&#27982;&#23398;&#30740;&#31350;&#21644;&#25919;&#31574;&#20998;&#26512;&#30340;&#25991;&#31456;&#65292;&#24378;&#35843;&#20102;&#26426;&#22120;&#23398;&#20064;&#22312;&#22788;&#29702;&#38750;&#20256;&#32479;&#21644;&#38750;&#32467;&#26500;&#21270;&#25968;&#25454;&#12289;&#25429;&#25417;&#24378;&#38750;&#32447;&#24615;&#24615;&#21644;&#25552;&#39640;&#39044;&#27979;&#20934;&#30830;&#24615;&#26041;&#38754;&#30340;&#24212;&#29992;&#20248;&#21183;&#65292;&#25104;&#20026;&#35745;&#37327;&#32463;&#27982;&#23398;&#23478;&#24037;&#20855;&#31665;&#20013;&#19981;&#21487;&#25110;&#32570;&#30340;&#19968;&#37096;&#20998;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#23545;&#20351;&#29992;&#26426;&#22120;&#23398;&#20064;&#24037;&#20855;&#36827;&#34892;&#32463;&#27982;&#23398;&#30740;&#31350;&#21644;&#25919;&#31574;&#20998;&#26512;&#30340;&#37325;&#35201;&#32463;&#27982;&#26399;&#21002;&#19978;&#21457;&#34920;&#30340;&#25991;&#31456;&#36827;&#34892;&#20102;&#31934;&#36873;&#32508;&#36848;&#12290;&#32508;&#36848;&#22238;&#31572;&#20102;&#19977;&#20010;&#20851;&#38190;&#38382;&#39064;&#65306;&#65288;1&#65289;&#20309;&#26102;&#22312;&#32463;&#27982;&#23398;&#20013;&#20351;&#29992;&#26426;&#22120;&#23398;&#20064;&#65292;&#65288;2&#65289;&#24120;&#29992;&#30340;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#26159;&#20160;&#20040;&#65292;&#20197;&#21450;&#65288;3&#65289;&#22914;&#20309;&#23558;&#23427;&#20204;&#29992;&#20110;&#32463;&#27982;&#24212;&#29992;&#12290;&#32508;&#36848;&#24378;&#35843;&#20102;&#26426;&#22120;&#23398;&#20064;&#29305;&#21035;&#36866;&#29992;&#20110;&#22788;&#29702;&#38750;&#20256;&#32479;&#21644;&#38750;&#32467;&#26500;&#21270;&#25968;&#25454;&#12289;&#25429;&#25417;&#24378;&#38750;&#32447;&#24615;&#24615;&#21644;&#25552;&#39640;&#39044;&#27979;&#20934;&#30830;&#24615;&#12290;&#28145;&#24230;&#23398;&#20064;&#27169;&#22411;&#36866;&#29992;&#20110;&#38750;&#20256;&#32479;&#25968;&#25454;&#65292;&#32780;&#38598;&#25104;&#23398;&#20064;&#27169;&#22411;&#36866;&#29992;&#20110;&#20256;&#32479;&#25968;&#25454;&#38598;&#12290;&#23613;&#31649;&#20256;&#32479;&#30340;&#35745;&#37327;&#32463;&#27982;&#23398;&#27169;&#22411;&#22312;&#20998;&#26512;&#20302;&#22797;&#26434;&#24615;&#25968;&#25454;&#26102;&#21487;&#33021;&#36275;&#22815;&#65292;&#20294;&#30001;&#20110;&#24555;&#36895;&#25968;&#23383;&#21270;&#21644;&#19981;&#26029;&#22686;&#38271;&#30340;&#25991;&#29486;&#65292;&#32463;&#27982;&#25968;&#25454;&#30340;&#22797;&#26434;&#24615;&#22686;&#21152;&#65292;&#26426;&#22120;&#23398;&#20064;&#27491;&#25104;&#20026;&#35745;&#37327;&#32463;&#27982;&#23398;&#23478;&#24037;&#20855;&#31665;&#20013;&#19981;&#21487;&#25110;&#32570;&#30340;&#19968;&#37096;&#20998;&#12290;
&lt;/p&gt;
&lt;p&gt;
This article provides a curated review of selected papers published in prominent economics journals that use machine learning (ML) tools for research and policy analysis. The review focuses on three key questions: (1) when ML is used in economics, (2) what ML models are commonly preferred, and (3) how they are used for economic applications. The review highlights that ML is particularly used in processing nontraditional and unstructured data, capturing strong nonlinearity, and improving prediction accuracy. Deep learning models are suitable for nontraditional data, whereas ensemble learning models are preferred for traditional datasets. While traditional econometric models may suffice for analyzing low-complexity data, the increasing complexity of economic data due to rapid digitalization and the growing literature suggest that ML is becoming an essential addition to the econometrician's toolbox.
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#35752;&#35770;&#20102;&#28431;&#27934;&#36175;&#37329;&#35745;&#21010;&#30340;&#31454;&#36187;&#27169;&#22411;&#21644;&#30456;&#20851;&#31574;&#30053;&#65292;&#21253;&#25324;&#22914;&#20309;&#21152;&#20837;&#26377;&#20607;&#20195;&#29702;&#20197;&#25552;&#39640;&#35745;&#21010;&#25928;&#29575;&#12289;&#22914;&#20309;&#25351;&#23450;&#24050;&#30693;&#28431;&#27934;&#30340;&#28155;&#21152;&#27010;&#29575;&#20197;&#38480;&#21046;&#22870;&#21169;&#25903;&#20184;&#12289;&#20197;&#21450;&#20026;&#20160;&#20040;&#36992;&#35831;&#26080;&#38480;&#25968;&#37327;&#30340;&#20154;&#19981;&#33021;&#20445;&#35777;&#25214;&#21040;&#28431;&#27934;&#12290;</title><link>http://arxiv.org/abs/2304.00077</link><description>&lt;p&gt;
&#21435;&#20013;&#24515;&#21270;&#25915;&#20987;&#25628;&#32034;&#21644;&#28431;&#27934;&#36175;&#37329;&#35745;&#21010;&#30340;&#35774;&#35745;
&lt;/p&gt;
&lt;p&gt;
Decentralized Attack Search and the Design of Bug Bounty Schemes. (arXiv:2304.00077v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.00077
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#35752;&#35770;&#20102;&#28431;&#27934;&#36175;&#37329;&#35745;&#21010;&#30340;&#31454;&#36187;&#27169;&#22411;&#21644;&#30456;&#20851;&#31574;&#30053;&#65292;&#21253;&#25324;&#22914;&#20309;&#21152;&#20837;&#26377;&#20607;&#20195;&#29702;&#20197;&#25552;&#39640;&#35745;&#21010;&#25928;&#29575;&#12289;&#22914;&#20309;&#25351;&#23450;&#24050;&#30693;&#28431;&#27934;&#30340;&#28155;&#21152;&#27010;&#29575;&#20197;&#38480;&#21046;&#22870;&#21169;&#25903;&#20184;&#12289;&#20197;&#21450;&#20026;&#20160;&#20040;&#36992;&#35831;&#26080;&#38480;&#25968;&#37327;&#30340;&#20154;&#19981;&#33021;&#20445;&#35777;&#25214;&#21040;&#28431;&#27934;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#31995;&#32479;&#21644;&#21306;&#22359;&#38142;&#24448;&#24448;&#23384;&#22312;&#23433;&#20840;&#28431;&#27934;&#65292;&#21487;&#33021;&#20250;&#34987;&#25915;&#20987;&#32773;&#25915;&#20987;&#65292;&#20135;&#29983;&#37325;&#22823;&#36127;&#38754;&#24433;&#21709;&#12290;&#22240;&#27492;&#65292;&#32452;&#32455;&#21644;&#21306;&#22359;&#38142;&#22522;&#30784;&#35774;&#26045;&#25552;&#20379;&#32773;&#36234;&#26469;&#36234;&#20381;&#36182;&#28431;&#27934;&#36175;&#37329;&#35745;&#21010;&#65292;&#22806;&#37096;&#20010;&#20154;&#25506;&#26597;&#31995;&#32479;&#24182;&#25253;&#21578;&#20219;&#20309;&#28431;&#27934;&#65288;&#32570;&#38519;&#65289;&#65292;&#20197;&#25442;&#21462;&#36135;&#24065;&#22870;&#21169;&#65288;&#36175;&#37329;&#65289;&#12290;&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#20010;&#36866;&#29992;&#20110;&#28431;&#27934;&#36175;&#37329;&#35745;&#21010;&#30340;&#31454;&#36187;&#27169;&#22411;&#65292;&#20854;&#20013;&#26377;&#20219;&#24847;&#25968;&#37327;&#30340;&#20195;&#29702;&#20915;&#23450;&#26159;&#21542;&#36827;&#34892;&#32791;&#36153;&#39640;&#26114;&#30340;&#28431;&#27934;&#25628;&#32034;&#12290;&#25628;&#32034;&#25104;&#26412;&#26159;&#31169;&#20154;&#20449;&#24687;&#12290;&#38500;&#20102;&#34920;&#24449;&#21457;&#29983;&#30340;&#22343;&#34913;&#22806;&#65292;&#25105;&#20204;&#36824;&#34920;&#26126;&#65292;&#21363;&#20351;&#36992;&#35831;&#19968;&#20010;&#26080;&#38480;&#25968;&#37327;&#30340;&#20154;&#65292;&#20063;&#19981;&#33021;&#20445;&#35777;&#25214;&#21040;&#28431;&#27934;&#12290;&#28155;&#21152;&#26377;&#20607;&#20195;&#29702;&#21487;&#20197;&#25552;&#39640;&#28431;&#27934;&#36175;&#37329;&#35745;&#21010;&#30340;&#25928;&#29575;&#65292;&#23613;&#31649;&#21560;&#24341;&#30340;&#20154;&#25968;&#21464;&#23569;&#12290;&#26368;&#21518;&#65292;&#28155;&#21152;&#65288;&#24050;&#30693;&#30340;&#65289;&#28431;&#27934;&#21487;&#20197;&#22686;&#21152;&#21457;&#29616;&#26410;&#30693;&#28431;&#27934;&#30340;&#21487;&#33021;&#24615;&#65292;&#20294;&#20986;&#20110;&#38480;&#21046;&#22870;&#21169;&#25903;&#20184;&#30340;&#30446;&#30340;&#65292;&#26368;&#22909;&#21482;&#20197;&#26576;&#31181;&#27010;&#29575;&#28155;&#21152;&#23427;&#20204;&#12290;
&lt;/p&gt;
&lt;p&gt;
Systems and blockchains often have security vulnerabilities and can be attacked by adversaries, with potentially significant negative consequences. Therefore, organizations and blockchain infrastructure providers increasingly rely on bug bounty programs, where external individuals probe the system and report any vulnerabilities (bugs) in exchange for monetary rewards (bounty). We develop a contest model for bug bounty programs with an arbitrary number of agents who decide whether to undertake a costly search for bugs or not. Search costs are private information. Besides characterizing the ensuing equilibria, we show that even inviting an unlimited crowd does not guarantee that bugs are found. Adding paid agents can increase the efficiency of the bug bounty scheme although the crowd that is attracted becomes smaller. Finally, adding (known) bugs increases the likelihood that unknown bugs are found, but to limit reward payments it may be optimal to add them only with some probability.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#21487;&#34892;&#30340;&#21551;&#21457;&#24335;&#20915;&#31574;&#21046;&#23450;&#26041;&#26696;&#65292;&#29992;&#20110;&#39537;&#21160;&#36829;&#32422;&#20844;&#21496;&#32593;&#32476;&#24674;&#22797;&#24037;&#20316;&#65292;&#22312;&#20004;&#20010;&#30495;&#23454;&#30340;DCN&#26696;&#20363;&#20013;&#36827;&#34892;&#20102;&#23454;&#39564;&#39564;&#35777;&#65292;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#21551;&#21457;&#24335;&#20915;&#31574;&#21046;&#23450;&#26041;&#26696;&#30340;&#23454;&#29992;&#24615;&#21644;&#24615;&#33021;&#12290;</title><link>http://arxiv.org/abs/2303.15863</link><description>&lt;p&gt;
&#23545;&#36829;&#32422;&#20844;&#21496;&#32593;&#32476;&#24674;&#22797;&#30340;&#39118;&#38505;&#30693;&#24773;&#21551;&#21457;&#24335;&#20915;&#31574;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Study on the risk-informed heuristic of decision-making on the restoration of defaulted corporation networks. (arXiv:2303.15863v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.15863
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#21487;&#34892;&#30340;&#21551;&#21457;&#24335;&#20915;&#31574;&#21046;&#23450;&#26041;&#26696;&#65292;&#29992;&#20110;&#39537;&#21160;&#36829;&#32422;&#20844;&#21496;&#32593;&#32476;&#24674;&#22797;&#24037;&#20316;&#65292;&#22312;&#20004;&#20010;&#30495;&#23454;&#30340;DCN&#26696;&#20363;&#20013;&#36827;&#34892;&#20102;&#23454;&#39564;&#39564;&#35777;&#65292;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#21551;&#21457;&#24335;&#20915;&#31574;&#21046;&#23450;&#26041;&#26696;&#30340;&#23454;&#29992;&#24615;&#21644;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#30001;&#25919;&#24220;&#20027;&#23548;&#30340;&#24674;&#22797;&#24050;&#25104;&#20026;&#20943;&#36731;&#22240;&#20844;&#21496;&#20449;&#29992;&#36829;&#32422;&#24341;&#21457;&#30340;&#37329;&#34701;&#39118;&#38505;&#30340;&#24120;&#35265;&#19988;&#26377;&#25928;&#26041;&#27861;&#12290;&#28982;&#32780;&#65292;&#22312;&#23454;&#36341;&#20013;&#65292;&#30001;&#20110;&#36829;&#32422;&#20844;&#21496;&#32593;&#32476;&#65288;DCNs&#65289;&#20013;&#23384;&#22312;&#22823;&#37327;&#25628;&#32034;&#31354;&#38388;&#20197;&#21450;&#20010;&#20307;&#20844;&#21496;&#38388;&#30340;&#21160;&#24577;&#21644;&#24490;&#29615;&#30456;&#20114;&#20381;&#36182;&#20851;&#31995;&#65292;&#24448;&#24448;&#38590;&#20197;&#25552;&#20986;&#26368;&#20248;&#26041;&#26696;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#19968;&#25361;&#25112;&#65292;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31995;&#21015;&#21487;&#34892;&#30340;&#20915;&#31574;&#21551;&#21457;&#24335;&#65292;&#39537;&#21160;&#36825;&#20123;&#24674;&#22797;&#24037;&#20316;&#30340;&#20915;&#31574;&#21046;&#23450;&#12290;&#20026;&#20102;&#26816;&#26597;&#20854;&#36866;&#29992;&#24615;&#21644;&#27979;&#37327;&#20854;&#24615;&#33021;&#65292;&#23558;&#36825;&#20123;&#21551;&#21457;&#24335;&#24212;&#29992;&#20110;&#30001;100&#23478;&#19978;&#24066;&#20013;&#22269;A&#32929;&#20844;&#21496;&#32452;&#25104;&#30340;&#20004;&#20010;&#30495;&#23454;DCN&#65292;&#24182;&#22522;&#20110;2021&#24180;&#36130;&#21153;&#25968;&#25454;&#65292;&#27169;&#25311;&#38543;&#26426;&#29983;&#25104;&#30340;&#36829;&#32422;&#24773;&#20917;&#19979;&#30340;&#24674;&#22797;&#12290;&#30456;&#24212;&#30340;&#26696;&#20363;&#30740;&#31350;&#27169;&#25311;&#32467;&#26524;&#34920;&#26126;&#65292;DCN&#30340;&#24674;&#22797;&#23558;&#20250;&#26159;...
&lt;/p&gt;
&lt;p&gt;
Government-run (Government-led) restoration has become a common and effective approach to the mitigation of financial risks triggered by corporation credit defaults. However, in practice, it is often challenging to come up with the optimal plan of those restorations, due to the massive search space associated with defaulted corporation networks (DCNs), as well as the dynamic and looped interdependence among the recovery of those individual corporations. To address such a challenge, this paper proposes an array of viable heuristics of the decision-making that drives those restoration campaigns. To examine their applicability and measure their performance, those heuristics have been applied to two real-work DCNs that consists of 100 listed Chinese A-share companies, whose restoration has been modelled based on the 2021 financial data, in the wake of randomly generated default scenarios. The corresponding simulation outcome of the case-study shows that the restoration of the DCNs would be
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20379;&#20102;&#19968;&#20010;&#22522;&#26412;&#29702;&#35770;&#65292;&#30740;&#31350;&#20102;&#24102;&#26377;&#39640;&#38454;&#20449;&#24687;&#30340;&#26399;&#26435;&#24066;&#22330;&#20013;&#20215;&#26684;&#30340;&#21457;&#29616;&#26426;&#21046;&#12290;&#19982;&#27492;&#21516;&#26102;&#65292;&#35813;&#30740;&#31350;&#36824;&#20197;&#20869;&#24149;&#20132;&#26131;&#30340;&#24418;&#24335;&#21576;&#29616;&#20102;&#20854;&#20013;&#30340;&#29305;&#20363;&#65292;&#32473;&#20986;&#20102;&#36890;&#36135;&#33192;&#32960;&#38656;&#27714;&#12289;&#20215;&#26684;&#20914;&#20987;&#21644;&#20449;&#24687;&#25928;&#29575;&#30340;&#38381;&#24335;&#35299;&#12290;</title><link>http://arxiv.org/abs/2302.13426</link><description>&lt;p&gt;
&#26399;&#26435;&#30340;&#20215;&#26684;&#21457;&#29616;
&lt;/p&gt;
&lt;p&gt;
Price Discovery for Derivatives. (arXiv:2302.13426v5 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2302.13426
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20379;&#20102;&#19968;&#20010;&#22522;&#26412;&#29702;&#35770;&#65292;&#30740;&#31350;&#20102;&#24102;&#26377;&#39640;&#38454;&#20449;&#24687;&#30340;&#26399;&#26435;&#24066;&#22330;&#20013;&#20215;&#26684;&#30340;&#21457;&#29616;&#26426;&#21046;&#12290;&#19982;&#27492;&#21516;&#26102;&#65292;&#35813;&#30740;&#31350;&#36824;&#20197;&#20869;&#24149;&#20132;&#26131;&#30340;&#24418;&#24335;&#21576;&#29616;&#20102;&#20854;&#20013;&#30340;&#29305;&#20363;&#65292;&#32473;&#20986;&#20102;&#36890;&#36135;&#33192;&#32960;&#38656;&#27714;&#12289;&#20215;&#26684;&#20914;&#20987;&#21644;&#20449;&#24687;&#25928;&#29575;&#30340;&#38381;&#24335;&#35299;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36890;&#36807;&#19968;&#20010;&#27169;&#22411;&#65292;&#32771;&#34385;&#20102;&#31169;&#26377;&#20449;&#24687;&#21644;&#39640;&#38454;&#20449;&#24687;&#23545;&#26399;&#26435;&#24066;&#22330;&#20215;&#26684;&#30340;&#24433;&#21709;&#12290;&#27169;&#22411;&#20801;&#35768;&#26377;&#31169;&#26377;&#20449;&#24687;&#30340;&#20132;&#26131;&#32773;&#22312;&#29366;&#24577;-&#32034;&#36180;&#38598;&#24066;&#22330;&#19978;&#20132;&#26131;&#12290;&#31561;&#20215;&#30340;&#26399;&#26435;&#24418;&#24335;&#19979;&#65292;&#25105;&#20204;&#32771;&#34385;&#20102;&#25317;&#26377;&#20851;&#20110;&#22522;&#30784;&#36164;&#20135;&#25910;&#30410;&#30340;&#20998;&#24067;&#30340;&#31169;&#26377;&#20449;&#24687;&#65292;&#24182;&#20801;&#35768;&#20132;&#26131;&#20219;&#24847;&#26399;&#26435;&#32452;&#21512;&#30340;&#25805;&#32437;&#32773;&#12290;&#25105;&#20204;&#24471;&#20986;&#20102;&#36890;&#36135;&#33192;&#32960;&#38656;&#27714;&#12289;&#20215;&#26684;&#20914;&#20987;&#21644;&#20449;&#24687;&#25928;&#29575;&#30340;&#38381;&#24335;&#35299;&#65292;&#36825;&#20123;&#35299;&#25552;&#20379;&#20102;&#20851;&#20110;&#20869;&#24149;&#20132;&#26131;&#30340;&#39640;&#38454;&#20449;&#24687;&#65292;&#22914;&#20219;&#20309;&#32473;&#23450;&#30340;&#26102;&#21051;&#20132;&#26131;&#26399;&#26435;&#31574;&#30053;&#65292;&#24182;&#23558;&#36825;&#20123;&#31574;&#30053;&#27867;&#21270;&#21040;&#20102;&#27874;&#21160;&#29575;&#20132;&#26131;&#31561;&#23454;&#36341;&#39046;&#22495;&#12290;
&lt;/p&gt;
&lt;p&gt;
We obtain a basic theory of price discovery across derivative markets with respect to higher-order information, using a model where an agent with general private information regarding state probabilities is allowed to trade arbitrary portfolios of state-contingent claims. In an equivalent options formulation, the informed agent has private information regarding arbitrary aspects of the payoff distribution of an underlying asset and is allowed to trade arbitrary option portfolios. We characterize, in closed form, the informed demand, price impact, and information efficiency of prices. Our results offer a theory of insider trading on higher moments of the underlying payoff as a special case. The informed demand formula prescribes option strategies for trading on any given moment and extends those used in practice for, e.g. volatility trading.
&lt;/p&gt;</description></item><item><title>&#35774;&#35745;&#20102;&#19968;&#31181;&#26426;&#21046;"&#24102;&#26377;&#38543;&#26426;&#26816;&#26597;&#30340;&#22810;&#25968;&#31080;&#26426;&#21046;"&#65292;&#21487;&#23454;&#29616;&#20108;&#20803;&#31038;&#20250;&#20915;&#31574;&#30340;&#22810;&#25968;&#21407;&#21017;&#65292;&#19988;&#36866;&#29992;&#20110;&#23436;&#25972;&#21644;&#19981;&#23436;&#25972;&#20449;&#24687;&#12290;&#21516;&#26102;&#36824;&#21487;&#36890;&#36807;&#20462;&#25913;&#23454;&#29616;&#20219;&#20309;&#36229;&#32423;&#22810;&#25968;&#35268;&#21017;&#65292;&#25110;&#22522;&#20110;&#32593;&#32476;&#24418;&#25104;&#27010;&#24565;&#36827;&#34892;&#23454;&#29616;&#12290;</title><link>http://arxiv.org/abs/2302.09548</link><description>&lt;p&gt;
&#35774;&#35745;&#20108;&#20803;&#31038;&#20250;&#20915;&#31574;&#26426;&#21046;
&lt;/p&gt;
&lt;p&gt;
Designing binary social decisions. (arXiv:2302.09548v2 [econ.TH] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2302.09548
&lt;/p&gt;
&lt;p&gt;
&#35774;&#35745;&#20102;&#19968;&#31181;&#26426;&#21046;"&#24102;&#26377;&#38543;&#26426;&#26816;&#26597;&#30340;&#22810;&#25968;&#31080;&#26426;&#21046;"&#65292;&#21487;&#23454;&#29616;&#20108;&#20803;&#31038;&#20250;&#20915;&#31574;&#30340;&#22810;&#25968;&#21407;&#21017;&#65292;&#19988;&#36866;&#29992;&#20110;&#23436;&#25972;&#21644;&#19981;&#23436;&#25972;&#20449;&#24687;&#12290;&#21516;&#26102;&#36824;&#21487;&#36890;&#36807;&#20462;&#25913;&#23454;&#29616;&#20219;&#20309;&#36229;&#32423;&#22810;&#25968;&#35268;&#21017;&#65292;&#25110;&#22522;&#20110;&#32593;&#32476;&#24418;&#25104;&#27010;&#24565;&#36827;&#34892;&#23454;&#29616;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#35774;&#35745;&#20102;&#19968;&#31181;&#26426;&#21046;&#65292;&#21363;&#24102;&#26377;&#38543;&#26426;&#26816;&#26597;&#30340;&#22810;&#25968;&#31080;&#26426;&#21046;&#65288;RC &#26426;&#21046;&#65289;&#65292;&#23436;&#20840;&#23454;&#29616;&#20102;&#20108;&#20803;&#31038;&#20250;&#20915;&#31574;&#30340;&#22810;&#25968;&#21407;&#21017;&#12290;&#22312;&#20004;&#20010;&#36873;&#39033;&#30340;&#21516;&#26102;&#25237;&#31080;&#21518;&#65292;&#36827;&#34892;&#19968;&#31995;&#21015;&#26816;&#26597;&#65292;&#20854;&#20013;&#27599;&#20010;&#20195;&#29702;&#65288;&#38543;&#26426;&#25277;&#26679;&#20043;&#19968;&#65289;&#21487;&#20197;&#25509;&#21463;&#25110;&#25298;&#32477;&#25237;&#31080;&#30340;&#33719;&#32988;&#32773;&#12290;&#22914;&#26524;&#26679;&#26412;&#20013;&#30340;&#26576;&#20010;&#20195;&#29702;&#25509;&#21463;&#65292;&#21017;&#23454;&#29616;&#33719;&#32988;&#32773;&#12290;&#22914;&#26524;&#25152;&#26377;&#20195;&#29702;&#37117;&#25298;&#32477;&#33719;&#32988;&#32773;&#65292;&#21017;&#38543;&#26426;&#36873;&#25321;&#19968;&#20010;&#20195;&#29702;&#65292;&#20854;&#26368;&#21021;&#25237;&#31080;&#30340;&#36873;&#39033;&#33719;&#32988;&#12290;&#22810;&#25968;&#35268;&#21017;&#30340;&#23454;&#26045;&#22312;&#23436;&#25972;&#21644;&#19981;&#23436;&#25972;&#20449;&#24687;&#19979;&#22343;&#20445;&#25345;&#19981;&#21464;&#12290;&#25105;&#20204;&#36824;&#25193;&#23637;&#20102; RC &#26426;&#21046;&#20197;&#36866;&#24212;&#24323;&#26435;&#65292;&#24182;&#34920;&#26126;&#21487;&#20197;&#36890;&#36807;&#20462;&#25913; RC &#26426;&#21046;&#26469;&#23454;&#29616;&#20219;&#20309;&#36229;&#32423;&#22810;&#25968;&#35268;&#21017;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#20171;&#32461;&#20102;&#22522;&#20110;&#32593;&#32476;&#24418;&#25104;&#27010;&#24565;&#30340;&#20854;&#20182;&#23454;&#29616;&#26426;&#21046;&#12290;
&lt;/p&gt;
&lt;p&gt;
We design a mechanism, Majority voting with random checks (RC mechanism), that fully implements the majority rule for binary social decisions. A simultaneous vote over the two options is followed by a sequence of checks, where each agent (out of a random sample) can accept or reject the winner of the vote. If some agent in the sample accepts, the winner is implemented. If all agents reject the winner, one of the agents is selected randomly and the option she voted for initially wins. The implementation of the majority rule holds under both complete and incomplete information. We also extend the RC mechanism to accommodate for abstention and show that any supermajority rule is implementable via a modification of the RC mechanism. Finally, we introduce additional implementation mechanisms based on the concept of network formation.
&lt;/p&gt;</description></item><item><title>&#35770;&#25991;&#25506;&#35752;&#20102;&#22914;&#20309;&#22312;&#20225;&#19994;&#25317;&#26377;&#25104;&#26412;&#31169;&#26377;&#20449;&#24687;&#30340;&#24773;&#20917;&#19979;&#65292;&#36890;&#36807;&#24449;&#27714;&#20215;&#26684;&#12289;&#25910;&#21462;&#31246;&#27454;&#25110;&#32473;&#20104;&#34917;&#36148;&#20197;&#21450;&#23545;&#27599;&#20010;&#20225;&#19994;&#23454;&#26045;&#8220;&#30721;&#22836;&#20215;&#8221;&#20215;&#26684;&#19978;&#38480;&#26469;&#35268;&#33539;&#22404;&#26029;&#24066;&#22330;&#12290;</title><link>http://arxiv.org/abs/2302.03185</link><description>&lt;p&gt;
&#25511;&#21046;&#23521;&#22836;&#22404;&#26029;&#31454;&#20105;
&lt;/p&gt;
&lt;p&gt;
Regulating Oligopolistic Competition. (arXiv:2302.03185v2 [econ.TH] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2302.03185
&lt;/p&gt;
&lt;p&gt;
&#35770;&#25991;&#25506;&#35752;&#20102;&#22914;&#20309;&#22312;&#20225;&#19994;&#25317;&#26377;&#25104;&#26412;&#31169;&#26377;&#20449;&#24687;&#30340;&#24773;&#20917;&#19979;&#65292;&#36890;&#36807;&#24449;&#27714;&#20215;&#26684;&#12289;&#25910;&#21462;&#31246;&#27454;&#25110;&#32473;&#20104;&#34917;&#36148;&#20197;&#21450;&#23545;&#27599;&#20010;&#20225;&#19994;&#23454;&#26045;&#8220;&#30721;&#22836;&#20215;&#8221;&#20215;&#26684;&#19978;&#38480;&#26469;&#35268;&#33539;&#22404;&#26029;&#24066;&#22330;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#32771;&#34385;&#30340;&#38382;&#39064;&#26159;&#22312;&#20225;&#19994;&#25317;&#26377;&#20854;&#25104;&#26412;&#31169;&#26377;&#20449;&#24687;&#30340;&#24773;&#20917;&#19979;&#65292;&#22914;&#20309;&#35268;&#33539;&#22404;&#26029;&#24066;&#22330;&#12290;&#22312;&#26412;&#29615;&#22659;&#20013;&#65292;&#28040;&#36153;&#32773;&#23545;&#21830;&#21697;&#36827;&#34892;&#31163;&#25955;&#36873;&#25321;&#65292;&#19988;&#23545;&#20225;&#19994;&#31454;&#20105;&#26041;&#24335;&#30340;&#32467;&#26500;&#27809;&#26377;&#20219;&#20309;&#38480;&#21046;&#12290;&#22312;&#26368;&#20339;&#30417;&#31649;&#25919;&#31574;&#20013;&#65292;&#30417;&#31649;&#26426;&#26500;&#21482;&#38656;&#21521;&#20225;&#19994;&#24449;&#27714;&#20215;&#26684;&#65292;&#28982;&#21518;&#26681;&#25454;&#36825;&#20123;&#20215;&#26684;&#25910;&#21462;&#31246;&#27454;&#25110;&#25552;&#20379;&#34917;&#36148;&#65292;&#24182;&#23545;&#27599;&#20010;&#20225;&#19994;&#23454;&#26045;&#8220;&#30721;&#22836;&#20215;&#8221;&#20215;&#26684;&#19978;&#38480;&#65292;&#35813;&#19978;&#38480;&#21462;&#20915;&#20110;&#31454;&#20105;&#20225;&#19994;&#20844;&#24067;&#30340;&#20215;&#26684;&#12290;
&lt;/p&gt;
&lt;p&gt;
We consider the problem of how to regulate an oligopoly when firms have private information about their costs. In the environment, consumers make discrete choices over goods, and minimal structure is placed on the manner in which firms compete. In the optimal regulatory policy, the regulator need only solicit prices from firms, and based on those prices, charge them taxes or give them subsidies, and impose on each firm a ``yardstick'' price cap that depends on the posted prices of competing firms.
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#30340;&#22686;&#24378;&#36125;&#21494;&#26031;&#31070;&#32463;&#32593;&#32476;&#33021;&#22815;&#27169;&#25311;&#22823;&#37327;&#23439;&#35266;&#32463;&#27982;&#21644;&#37329;&#34701;&#21464;&#37327;&#30340;&#36890;&#29992;&#38750;&#32447;&#24615;&#21644;&#26102;&#38388;&#21464;&#21270;&#65292;&#20855;&#26377;&#28508;&#22312;&#30340;&#25919;&#31574;&#20915;&#31574;&#24212;&#29992;&#20215;&#20540;&#12290;</title><link>http://arxiv.org/abs/2211.04752</link><description>&lt;p&gt;
&#22686;&#24378;&#36125;&#21494;&#26031;&#31070;&#32463;&#32593;&#32476;&#22312;&#23439;&#35266;&#32463;&#27982;&#21644;&#37329;&#34701;&#39046;&#22495;&#30340;&#24212;&#29992;
&lt;/p&gt;
&lt;p&gt;
Enhanced Bayesian Neural Networks for Macroeconomics and Finance. (arXiv:2211.04752v3 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2211.04752
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#30340;&#22686;&#24378;&#36125;&#21494;&#26031;&#31070;&#32463;&#32593;&#32476;&#33021;&#22815;&#27169;&#25311;&#22823;&#37327;&#23439;&#35266;&#32463;&#27982;&#21644;&#37329;&#34701;&#21464;&#37327;&#30340;&#36890;&#29992;&#38750;&#32447;&#24615;&#21644;&#26102;&#38388;&#21464;&#21270;&#65292;&#20855;&#26377;&#28508;&#22312;&#30340;&#25919;&#31574;&#20915;&#31574;&#24212;&#29992;&#20215;&#20540;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#24320;&#21457;&#20102;&#36125;&#21494;&#26031;&#31070;&#32463;&#32593;&#32476; (BNNs)&#65292;&#23427;&#20204;&#33021;&#22815;&#27169;&#25311;&#21487;&#33021;&#21253;&#21547;&#22823;&#37327;&#23439;&#35266;&#32463;&#27982;&#21644;&#37329;&#34701;&#21464;&#37327;&#30340;&#36890;&#29992;&#38750;&#32447;&#24615;&#21644;&#26102;&#38388;&#21464;&#21270;&#12290;&#20174;&#26041;&#27861;&#35770;&#19978;&#35762;&#65292;&#25105;&#20204;&#20801;&#35768;&#23545;&#32593;&#32476;&#36827;&#34892;&#19968;&#33324;&#35268;&#26684;&#30340;&#35828;&#26126;&#65292;&#21487;&#20197;&#24212;&#29992;&#20110;&#23494;&#38598;&#25110;&#31232;&#30095;&#25968;&#25454;&#38598;&#65292;&#24182;&#32467;&#21512;&#21508;&#31181;&#28608;&#27963;&#21151;&#33021;&#12289;&#21487;&#33021;&#38750;&#24120;&#22810;&#30340;&#31070;&#32463;&#20803;&#21644;&#35823;&#24046;&#39033;&#30340;&#38543;&#26426;&#27874;&#21160;&#12290;&#20174;&#35745;&#31639;&#30340;&#35282;&#24230;&#26469;&#30475;&#65292;&#25105;&#20204;&#20026;&#24341;&#20837;&#30340;&#36890;&#29992;BNNs&#24320;&#21457;&#20102;&#24555;&#36895;&#39640;&#25928;&#30340;&#20272;&#35745;&#31639;&#27861;&#12290;&#20174;&#23454;&#35777;&#30340;&#35282;&#24230;&#26469;&#30475;&#65292;&#25105;&#20204;&#29992;&#27169;&#25311;&#25968;&#25454;&#21644;&#19968;&#32452;&#24120;&#35265;&#30340;&#23439;&#35266;&#37329;&#34701;&#24212;&#29992;&#26469;&#23637;&#31034;&#25105;&#20204;&#30340;BNNs&#21487;&#20197;&#23454;&#38469;&#20351;&#29992;&#65292;&#29305;&#21035;&#26159;&#23545;&#20110;&#35266;&#27979;&#30446;&#26631;&#21464;&#37327;&#30340;&#27178;&#25130;&#38754;&#25110;&#26102;&#38388;&#24207;&#21015;&#20998;&#24067;&#30340;&#23614;&#37096;&#65292;&#35813;&#26041;&#27861;&#29305;&#21035;&#36866;&#29992;&#20110;&#22312;&#19981;&#23547;&#24120;&#30340;&#26102;&#38388;&#20570;&#20986;&#20915;&#31574;&#26041;&#38754;&#20855;&#26377;&#20449;&#24687;&#37327;&#12290;
&lt;/p&gt;
&lt;p&gt;
We develop Bayesian neural networks (BNNs) that permit to model generic nonlinearities and time variation for (possibly large sets of) macroeconomic and financial variables. From a methodological point of view, we allow for a general specification of networks that can be applied to either dense or sparse datasets, and combines various activation functions, a possibly very large number of neurons, and stochastic volatility (SV) for the error term. From a computational point of view, we develop fast and efficient estimation algorithms for the general BNNs we introduce. From an empirical point of view, we show both with simulated data and with a set of common macro and financial applications that our BNNs can be of practical use, particularly so for observations in the tails of the cross-sectional or time series distributions of the target variables, which makes the method particularly informative for policy making in uncommon times.
&lt;/p&gt;</description></item><item><title>&#22312;&#30740;&#31350;&#19968;&#20010;&#22522;&#20110;&#29609;&#23478;&#36190;&#21161;&#30340;&#25972;&#25968;&#20043;&#38388;&#30340;&#28216;&#25103;&#20013;&#65292;&#21457;&#29616;&#20102;&#19968;&#20010;&#26377;&#36259;&#30340;&#32467;&#26524;&#65292;&#23545;&#20110;&#19968;&#31867;&#33258;&#28982;&#30340;&#31574;&#30053;&#65292;&#32435;&#20160;&#22343;&#34913;&#23384;&#22312;&#30340;&#26465;&#20214;&#26159;x&#22312;&#955;&#21644;&#955;^-1&#20043;&#38388;&#65292;&#20854;&#20013;&#955;&#26159;&#19968;&#20010;&#20540;&#38750;&#24120;&#25509;&#36817;&#20110;0&#21644;1&#30340;&#26377;&#29702;&#25968;&#12290;</title><link>http://arxiv.org/abs/2209.07451</link><description>&lt;p&gt;
&#22833;&#33853;&#30340;&#19968;&#20998;&#38065;&#65306;&#22522;&#20110;&#29609;&#23478;&#36190;&#21161;&#30340;&#25972;&#25968;&#28216;&#25103;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
On the Trail of Lost Pennies: player-funded tug-of-war on the integers. (arXiv:2209.07451v2 [math.PR] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2209.07451
&lt;/p&gt;
&lt;p&gt;
&#22312;&#30740;&#31350;&#19968;&#20010;&#22522;&#20110;&#29609;&#23478;&#36190;&#21161;&#30340;&#25972;&#25968;&#20043;&#38388;&#30340;&#28216;&#25103;&#20013;&#65292;&#21457;&#29616;&#20102;&#19968;&#20010;&#26377;&#36259;&#30340;&#32467;&#26524;&#65292;&#23545;&#20110;&#19968;&#31867;&#33258;&#28982;&#30340;&#31574;&#30053;&#65292;&#32435;&#20160;&#22343;&#34913;&#23384;&#22312;&#30340;&#26465;&#20214;&#26159;x&#22312;&#955;&#21644;&#955;^-1&#20043;&#38388;&#65292;&#20854;&#20013;&#955;&#26159;&#19968;&#20010;&#20540;&#38750;&#24120;&#25509;&#36817;&#20110;0&#21644;1&#30340;&#26377;&#29702;&#25968;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#19968;&#31867;&#38543;&#26426;&#36718;&#27969;&#20998;&#37197;&#36164;&#28304;&#30340;&#28216;&#25103;&#65292;&#31216;&#20026;&#8220;&#22833;&#33853;&#30340;&#19968;&#20998;&#38065;&#8221;&#65292;&#35813;&#28216;&#25103;&#22312;&#25972;&#25968;&#38598;&#21512;&#19978;&#36827;&#34892;&#12290;&#22312;&#27599;&#22238;&#21512;&#20013;&#65292;Maxine&#25237;&#19979;a&#65288;a&#8712;[0&#65292;&#8734;)&#65289;&#65292;&#32780;Mina &#25237;&#19979;b&#65288;b&#8712;[0,&#8734;)&#65289;&#12290;&#28982;&#21518;&#65292;&#35745;&#25968;&#22120;X&#21521;&#21491;&#31227;&#21160;&#65292;&#31227;&#21160;&#36317;&#31163;&#20026;1&#65292;&#27010;&#29575;&#20026;a/(a+b)&#12290;&#22914;&#26524;&#22312;&#36825;&#20010;&#26080;&#31351;&#22238;&#21512;&#28216;&#25103;&#20013;Xi&#8594;&#8722;&#8734;&#65292;&#37027;&#20040;Mina&#33719;&#24471;&#19968;&#20010;&#21333;&#20301;&#65292;&#32780;Maxine&#33719;&#24471;&#38646;&#21333;&#20301;;&#22914;&#26524;Xi&#8594;&#8734;&#65292;&#21017;&#36825;&#20123;&#25910;&#25454;&#20026;&#38646;&#21644;x&#12290;&#22240;&#27492;&#65292;&#23545;&#20110;&#27599;&#20010;&#29609;&#23478;&#26469;&#35828;&#65292;&#20928;&#25910;&#20837;&#26159;-A+B&#65292;&#20854;&#20013;A&#26159;&#22905;&#30340;&#24635;&#25237;&#27880;&#65292;B&#26159;&#22905;&#30340;&#26368;&#32456;&#25910;&#20837;&#12290;&#36825;&#20010;&#28216;&#25103;&#30340;&#28789;&#24863;&#26469;&#28304;&#20110;2009&#24180;&#30340;&#20844;&#27491;&#25300;&#27827;&#27604;&#36187;&#65292;&#20294;&#23454;&#38469;&#19978;&#38750;&#24120;&#31867;&#20284;&#20110;&#21407;&#22987;&#29256;&#26412;&#30340;&#25300;&#27827;&#27604;&#36187;&#65292;&#21363;1987&#24180;&#22312;&#32463;&#27982;&#23398;&#25991;&#29486;&#20013;&#20171;&#32461;&#30340;&#37027;&#31181;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#36825;&#20010;&#28216;&#25103;&#26377;&#19968;&#20123;&#20196;&#20154;&#24778;&#35766;&#30340;&#29305;&#28857;&#12290;&#23545;&#20110;&#19968;&#31867;&#33258;&#28982;&#30340;&#31574;&#30053;&#65292;&#24403;&#19988;&#20165;&#24403;x&#22312;[&#955;&#65292;&#955;^&#65288;-1&#65289;]&#26102;&#65292;&#32435;&#20160;&#22343;&#34913;&#23384;&#22312;&#65292;&#20854;&#20013;&#955;&#8712;&#65288;0&#65292;1&#65289;&#30340;&#19968;&#23450;&#20540;&#12290;&#25105;&#20204;&#25351;&#20986;&#65292;&#955;&#38750;&#24120;&#25509;&#36817;&#8230;&#8230;
&lt;/p&gt;
&lt;p&gt;
We study a class of  random-turn resource-allocation games. In the Trail of Lost Pennies, a counter moves on $\mathbb{Z}$. At each turn, Maxine stakes $a \in [0,\infty)$ and Mina $b \in [0,\infty)$. The counter $X$ then moves adjacently, to the right with probability $\tfrac{a}{a+b}$. If $X_i \to -\infty$ in this infinte-turn game, Mina receives one unit, and Maxine zero; if $X_i \to \infty$, then these receipts are zero and~$x$. Thus the net receipt to a given player is $-A+B$, where $A$ is the sum of her stakes, and $B$ is her terminal receipt. The game was inspired by unbiased tug-of-war in~\cite{PSSW09} from 2009 but in fact closely resembles the original version of tug-of-war, introduced~\cite{HarrisVickers87} in the economics literature in 1987. We show that the game has surprising features. For a natural class of strategies, Nash equilibria exist precisely when $x$ lies in $[\lambda,\lambda^{-1}]$, for a certain $\lambda \in (0,1)$. We indicate that $\lambda$ is remarkably close
&lt;/p&gt;</description></item><item><title>&#20998;&#20301;&#25968;&#22238;&#24402;&#21487;&#20197;&#20272;&#35745;&#32676;&#20307;&#25919;&#31574;&#30340;&#24322;&#36136;&#24615;&#25928;&#24212;&#65292;&#23545;&#20998;&#24067;&#25919;&#31574;&#30340;&#24433;&#21709;&#36827;&#34892;&#20998;&#26512;&#65292;&#26412;&#25991;&#20351;&#29992;&#24046;&#24322;&#27861;&#23558;&#20854;&#24212;&#29992;&#20110;&#35780;&#20272;&#32654;&#22269;&#26368;&#20302;&#24037;&#36164;&#25919;&#31574;&#23545;&#25910;&#20837;&#19981;&#24179;&#31561;&#24615;&#30340;&#24433;&#21709;&#65292;&#32467;&#26524;&#21457;&#29616;&#26368;&#20302;&#24037;&#36164;&#25919;&#31574;&#23545;&#19981;&#24179;&#31561;&#24615;&#36896;&#25104;&#20102;&#26174;&#33879;&#30340;&#36127;&#38754;&#24433;&#21709;&#65292;&#20294;&#23545;&#20869;&#22312;&#19981;&#24179;&#31561;&#24615;&#30340;&#24433;&#21709;&#36739;&#23567;&#12290;</title><link>http://arxiv.org/abs/2208.03632</link><description>&lt;p&gt;
&#21033;&#29992;&#20132;&#20114;&#22266;&#23450;&#25928;&#24212;&#30340;&#20998;&#20301;&#25968;&#22238;&#24402;&#20272;&#35745;&#24322;&#36136;&#24615;&#22788;&#29702;&#25928;&#24212;
&lt;/p&gt;
&lt;p&gt;
Estimation of Heterogeneous Treatment Effects Using Quantile Regression with Interactive Fixed Effects. (arXiv:2208.03632v2 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2208.03632
&lt;/p&gt;
&lt;p&gt;
&#20998;&#20301;&#25968;&#22238;&#24402;&#21487;&#20197;&#20272;&#35745;&#32676;&#20307;&#25919;&#31574;&#30340;&#24322;&#36136;&#24615;&#25928;&#24212;&#65292;&#23545;&#20998;&#24067;&#25919;&#31574;&#30340;&#24433;&#21709;&#36827;&#34892;&#20998;&#26512;&#65292;&#26412;&#25991;&#20351;&#29992;&#24046;&#24322;&#27861;&#23558;&#20854;&#24212;&#29992;&#20110;&#35780;&#20272;&#32654;&#22269;&#26368;&#20302;&#24037;&#36164;&#25919;&#31574;&#23545;&#25910;&#20837;&#19981;&#24179;&#31561;&#24615;&#30340;&#24433;&#21709;&#65292;&#32467;&#26524;&#21457;&#29616;&#26368;&#20302;&#24037;&#36164;&#25919;&#31574;&#23545;&#19981;&#24179;&#31561;&#24615;&#36896;&#25104;&#20102;&#26174;&#33879;&#30340;&#36127;&#38754;&#24433;&#21709;&#65292;&#20294;&#23545;&#20869;&#22312;&#19981;&#24179;&#31561;&#24615;&#30340;&#24433;&#21709;&#36739;&#23567;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#20351;&#29992;&#20132;&#20114;&#22266;&#23450;&#25928;&#24212;&#30340;&#20998;&#20301;&#25968;&#22238;&#24402;&#26469;&#20272;&#35745;&#32676;&#20307;&#23618;&#38754;&#25919;&#31574;&#30340;&#24322;&#36136;&#24615;&#25928;&#24212;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#21487;&#20197;&#30830;&#23450;&#20998;&#24067;&#25919;&#31574;&#30340;&#25928;&#24212;&#65292;&#29305;&#21035;&#26159;&#23545;&#19981;&#24179;&#31561;&#24615;&#30340;&#24433;&#21709;&#65292;&#22522;&#20110;&#19968;&#31181;&#24046;&#24322;&#27861;&#30340;&#20551;&#35774;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#25105;&#20204;&#20272;&#35745;&#22120;&#30340;&#28176;&#36817;&#24615;&#36136;&#21644;&#19968;&#31181;&#25512;&#26029;&#26041;&#27861;&#12290;&#25105;&#20204;&#24212;&#29992;&#35813;&#27169;&#22411;&#26469;&#35780;&#20272;&#32654;&#22269;1967&#24180;&#33267;1980&#24180;&#20043;&#38388;&#26368;&#20302;&#24037;&#36164;&#25919;&#31574;&#23545;&#25910;&#20837;&#30340;&#24433;&#21709;&#12290;&#25105;&#20204;&#30340;&#32467;&#26524;&#34920;&#26126;&#65292;&#26368;&#20302;&#24037;&#36164;&#25919;&#31574;&#23545;&#19981;&#24179;&#31561;&#24615;&#36896;&#25104;&#20102;&#26174;&#33879;&#30340;&#36127;&#38754;&#24433;&#21709;&#65292;&#20294;&#23545;&#20869;&#22312;&#19981;&#24179;&#31561;&#24615;&#30340;&#24433;&#21709;&#36739;&#23567;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study the estimation of heterogeneous effects of group-level policies, using quantile regression with interactive fixed effects. Our approach can identify distributional policy effects, particularly effects on inequality, under a type of difference-in-differences assumption. We provide asymptotic properties of our estimators and an inferential method. We apply the model to evaluate the effect of the minimum wage policy on earnings between 1967 and 1980 in the United States. Our results suggest that the minimum wage policy has a significant negative impact on the between-inequality but little effect on the within-inequality.
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#23545;&#31216;&#29615;&#22659;&#19979;&#30340;&#25237;&#31080;&#27169;&#22411;&#65292;&#21457;&#29616;&#27599;&#20010;&#20013;&#26399;&#20998;&#37197;&#27010;&#29575;&#37117;&#21487;&#20197;&#36890;&#36807;&#21512;&#26684;&#22810;&#25968;&#21644;&#21512;&#26684;&#21453;&#22810;&#25968;&#20004;&#32452;&#20915;&#31574;&#25237;&#31080;&#35268;&#21017;&#30340;&#20984;&#32452;&#21512;&#26469;&#23454;&#29616;&#12290;</title><link>http://arxiv.org/abs/2207.09253</link><description>&lt;p&gt;
&#23545;&#31216;&#21270;&#31616;&#24418;&#24335;&#25237;&#31080;
&lt;/p&gt;
&lt;p&gt;
Symmetric reduced form voting. (arXiv:2207.09253v4 [econ.TH] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2207.09253
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#23545;&#31216;&#29615;&#22659;&#19979;&#30340;&#25237;&#31080;&#27169;&#22411;&#65292;&#21457;&#29616;&#27599;&#20010;&#20013;&#26399;&#20998;&#37197;&#27010;&#29575;&#37117;&#21487;&#20197;&#36890;&#36807;&#21512;&#26684;&#22810;&#25968;&#21644;&#21512;&#26684;&#21453;&#22810;&#25968;&#20004;&#32452;&#20915;&#31574;&#25237;&#31080;&#35268;&#21017;&#30340;&#20984;&#32452;&#21512;&#26469;&#23454;&#29616;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#19968;&#20010;&#23545;&#31216;&#29615;&#22659;&#19979;&#20855;&#26377;&#20004;&#20010;&#36873;&#25321;&#30340;&#25237;&#31080;&#27169;&#22411;&#12290;&#25105;&#20204;&#34920;&#24449;&#20102;&#21487;&#20197;&#36890;&#36807;&#23545;&#31216;&#21270;&#25237;&#31080;&#35268;&#21017;&#23454;&#29616;&#30340;&#20013;&#26399;&#20998;&#37197;&#27010;&#29575;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#27599;&#20010;&#36825;&#26679;&#30340;&#20013;&#26399;&#20998;&#37197;&#27010;&#29575;&#21487;&#20197;&#36890;&#36807;&#20004;&#31181;&#20915;&#31574;&#25237;&#31080;&#35268;&#21017;&#30340;&#20984;&#32452;&#21512;&#26469;&#23454;&#29616;&#65306;&#21512;&#26684;&#22810;&#25968;&#21644;&#21512;&#26684;&#21453;&#22810;&#25968;&#12290;&#25105;&#20204;&#36824;&#36890;&#36807;&#35201;&#27714;&#23545;&#31216;&#21333;&#35843;&#65288;&#25112;&#30053;&#26080;&#25928;&#65289;&#25237;&#31080;&#35268;&#21017;&#21644;&#23545;&#31216;&#19968;&#33268;&#25237;&#31080;&#35268;&#21017;&#23454;&#29616;&#31867;&#20284;&#30340;&#32467;&#26524;&#12290;&#25105;&#20204;&#24212;&#29992;&#25105;&#20204;&#30340;&#32467;&#26524;&#26469;&#23637;&#31034;&#19968;&#20010;&#21069;&#26399; Rawlsian &#35268;&#21017;&#26159;&#19968;&#23545;&#21512;&#26684;&#22810;&#25968;&#35268;&#21017;&#30340;&#20984;&#32452;&#21512;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study a model of voting with two alternatives in a symmetric environment. We characterize the interim allocation probabilities that can be implemented by a symmetric voting rule. We show that every such interim allocation probabilities can be implemented as a convex combination of two families of deterministic voting rules: qualified majority and qualified anti-majority. We also provide analogous results by requiring implementation by a symmetric monotone (strategy-proof) voting rule and by a symmetric unanimous voting rule. We apply our results to show that an ex-ante Rawlsian rule is a convex combination of a pair of qualified majority rules.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#20010;&#24635;&#32467;&#34913;&#37327;&#26631;&#20934;&#8212;&#8212;&#24179;&#22343;&#35843;&#25972;&#20851;&#32852;&#24230;&#65288;AAA&#65289;&#65292;&#29992;&#20110;&#35780;&#20272;&#19968;&#20010;&#20855;&#26377;&#28151;&#28102;&#24433;&#21709;&#30340;&#24322;&#36136;&#32676;&#20307;&#20013;&#30340;&#20851;&#32852;&#31243;&#24230;&#12290;&#24182;&#19988;&#25105;&#20204;&#25552;&#20986;&#20102;&#39640;&#25928;&#30340;&#20272;&#35745;&#26041;&#27861;&#65292;&#21487;&#29992;&#20110;&#21508;&#31181;&#37319;&#26679;&#22330;&#26223;&#12290;</title><link>http://arxiv.org/abs/2205.14048</link><description>&lt;p&gt;
&#24179;&#22343;&#35843;&#25972;&#20851;&#32852;&#24230;&#65306;&#39640;&#32500;&#28151;&#28102;&#22240;&#32032;&#30340;&#39640;&#25928;&#20272;&#35745;
&lt;/p&gt;
&lt;p&gt;
Average Adjusted Association: Efficient Estimation with High Dimensional Confounders. (arXiv:2205.14048v2 [stat.ME] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2205.14048
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#20010;&#24635;&#32467;&#34913;&#37327;&#26631;&#20934;&#8212;&#8212;&#24179;&#22343;&#35843;&#25972;&#20851;&#32852;&#24230;&#65288;AAA&#65289;&#65292;&#29992;&#20110;&#35780;&#20272;&#19968;&#20010;&#20855;&#26377;&#28151;&#28102;&#24433;&#21709;&#30340;&#24322;&#36136;&#32676;&#20307;&#20013;&#30340;&#20851;&#32852;&#31243;&#24230;&#12290;&#24182;&#19988;&#25105;&#20204;&#25552;&#20986;&#20102;&#39640;&#25928;&#30340;&#20272;&#35745;&#26041;&#27861;&#65292;&#21487;&#29992;&#20110;&#21508;&#31181;&#37319;&#26679;&#22330;&#26223;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#23545;&#25968;&#27604;&#29575;&#26159;&#34913;&#37327;&#20108;&#20803;&#32467;&#26524;&#21644;&#26292;&#38706;&#21464;&#37327;&#20851;&#32852;&#24230;&#30340;&#19968;&#31181;&#26082;&#23450;&#25351;&#26631;&#12290;&#23613;&#31649;&#20854;&#34987;&#24191;&#27867;&#20351;&#29992;&#65292;&#20294;&#26377;&#20851;&#22914;&#20309;&#36890;&#36807;&#24179;&#22343;&#26041;&#24335;&#24635;&#32467;&#20855;&#26377;&#28151;&#28102;&#22240;&#32032;&#30340;&#23545;&#25968;&#27604;&#29575;&#30340;&#35752;&#35770;&#21364;&#24456;&#26377;&#38480;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#24179;&#22343;&#35843;&#25972;&#20851;&#32852;&#24230;&#65288;AAA&#65289;&#65292;&#23427;&#26159;&#19968;&#20010;&#35843;&#25972;&#20102;&#35266;&#23519;&#21040;&#30340;&#28151;&#28102;&#22240;&#32032;&#30340;&#24322;&#36136;&#32676;&#20307;&#20013;&#30340;&#20851;&#32852;&#24230;&#30340;&#24635;&#32467;&#34913;&#37327;&#26631;&#20934;&#12290;&#20026;&#20102;&#26041;&#20415;&#20351;&#29992;&#65292;&#25105;&#20204;&#36824;&#24320;&#21457;&#20102;&#39640;&#25928;&#30340;&#21452;&#37325;/&#26080;&#20559;&#26426;&#22120;&#23398;&#20064;&#65288;DML&#65289;AAA&#20272;&#35745;&#22120;&#12290;&#25105;&#20204;&#30340;DML&#20272;&#35745;&#22120;&#20351;&#29992;&#20102;&#20004;&#31181;&#31561;&#25928;&#30340;&#26377;&#25928;&#24433;&#21709;&#20989;&#25968;&#24418;&#24335;&#65292;&#24182;&#36866;&#29992;&#20110;&#21508;&#31181;&#37319;&#26679;&#22330;&#26223;&#65292;&#21253;&#25324;&#38543;&#26426;&#37319;&#26679;&#65292;&#22522;&#20110;&#32467;&#26524;&#30340;&#37319;&#26679;&#21644;&#22522;&#20110;&#26292;&#38706;&#30340;&#37319;&#26679;&#12290;&#36890;&#36807;&#30495;&#23454;&#25968;&#25454;&#21644;&#27169;&#25311;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#25105;&#20204;&#25552;&#20986;&#30340;&#20272;&#31639;&#26041;&#27861;&#22312;&#27979;&#37327;AAA&#26041;&#38754;&#30340;&#23454;&#29992;&#24615;&#21644;&#26377;&#25928;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
The log odds ratio is a well-established metric for evaluating the association between binary outcome and exposure variables. Despite its widespread use, there has been limited discussion on how to summarize the log odds ratio as a function of confounders through averaging. To address this issue, we propose the Average Adjusted Association (AAA), which is a summary measure of association in a heterogeneous population, adjusted for observed confounders. To facilitate the use of it, we also develop efficient double/debiased machine learning (DML) estimators of the AAA. Our DML estimators use two equivalent forms of the efficient influence function, and are applicable in various sampling scenarios, including random sampling, outcome-based sampling, and exposure-based sampling. Through real data and simulations, we demonstrate the practicality and effectiveness of our proposed estimators in measuring the AAA.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;&#23545;N&#20154;&#21338;&#24328;&#24212;&#29992;&#30340;&#28216;&#25103;&#21464;&#25442;&#20013;&#65292;&#21738;&#20123;&#21464;&#25442;&#21487;&#20197;&#20445;&#25345;&#26368;&#20339;&#21453;&#24212;&#38598;&#25110;&#32435;&#20160;&#22343;&#34913;&#38598;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#27491;&#20223;&#23556;&#21464;&#25442;&#21487;&#20197;&#20445;&#25345;&#26368;&#20339;&#21453;&#24212;&#38598;&#12290;&#36825;&#20010;&#30740;&#31350;&#25552;&#20379;&#20102;&#19968;&#20010;&#26126;&#30830;&#30340;&#25551;&#36848;&#65292;&#35828;&#26126;&#21738;&#20123;&#28216;&#25103;&#21464;&#25442;&#21487;&#20197;&#20445;&#25345;&#26368;&#20339;&#21453;&#24212;&#38598;&#25110;&#32435;&#20160;&#22343;&#34913;&#38598;&#12290;</title><link>http://arxiv.org/abs/2111.00076</link><description>&lt;p&gt;
&#20445;&#25345;&#32435;&#20160;&#22343;&#34913;&#25110;&#26368;&#20339;&#21453;&#24212;&#38598;&#30340;&#28216;&#25103;&#21464;&#25442;
&lt;/p&gt;
&lt;p&gt;
Game Transformations That Preserve Nash Equilibria or Best Response Sets. (arXiv:2111.00076v2 [cs.GT] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2111.00076
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;&#23545;N&#20154;&#21338;&#24328;&#24212;&#29992;&#30340;&#28216;&#25103;&#21464;&#25442;&#20013;&#65292;&#21738;&#20123;&#21464;&#25442;&#21487;&#20197;&#20445;&#25345;&#26368;&#20339;&#21453;&#24212;&#38598;&#25110;&#32435;&#20160;&#22343;&#34913;&#38598;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#27491;&#20223;&#23556;&#21464;&#25442;&#21487;&#20197;&#20445;&#25345;&#26368;&#20339;&#21453;&#24212;&#38598;&#12290;&#36825;&#20010;&#30740;&#31350;&#25552;&#20379;&#20102;&#19968;&#20010;&#26126;&#30830;&#30340;&#25551;&#36848;&#65292;&#35828;&#26126;&#21738;&#20123;&#28216;&#25103;&#21464;&#25442;&#21487;&#20197;&#20445;&#25345;&#26368;&#20339;&#21453;&#24212;&#38598;&#25110;&#32435;&#20160;&#22343;&#34913;&#38598;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#21516;&#26102;&#38750;&#21512;&#20316;&#21338;&#24328;&#30340;&#25991;&#29486;&#20013;&#65292;&#24191;&#27867;&#20351;&#29992;&#30340;&#20107;&#23454;&#26159;&#65292;&#25928;&#29992;&#25910;&#30410;&#30340;&#27491;&#20223;&#23556;&#65288;&#32447;&#24615;&#65289;&#21464;&#25442;&#26082;&#19981;&#25913;&#21464;&#26368;&#20339;&#21453;&#24212;&#38598;&#65292;&#20063;&#19981;&#25913;&#21464;&#32435;&#20160;&#22343;&#34913;&#38598;&#12290;&#25105;&#20204;&#30740;&#31350;&#20102;&#21738;&#20123;&#20854;&#20182;&#28216;&#25103;&#21464;&#25442;&#22312;&#24212;&#29992;&#20110;&#20219;&#24847;N&#20154;&#28216;&#25103;&#65288;N&#8805;2&#65289;&#26102;&#20063;&#20855;&#26377;&#36825;&#20004;&#31181;&#23646;&#24615;&#20043;&#19968;&#65306;&#65288;i&#65289;&#32435;&#20160;&#22343;&#34913;&#38598;&#20445;&#25345;&#19981;&#21464;&#65307;&#65288;ii&#65289;&#26368;&#20339;&#21453;&#24212;&#38598;&#20445;&#25345;&#19981;&#21464;&#12290;&#23545;&#20110;&#20197;&#29609;&#23478;&#21644;&#31574;&#30053;&#20026;&#22522;&#30784;&#30340;&#28216;&#25103;&#21464;&#25442;&#65292;&#25105;&#20204;&#35777;&#26126;&#65288;i&#65289;&#24847;&#21619;&#30528;&#65288;ii&#65289;&#65292;&#20855;&#26377;&#23646;&#24615;&#65288;ii&#65289;&#30340;&#21464;&#25442;&#24517;&#39035;&#26159;&#27491;&#20223;&#23556;&#30340;&#12290;&#24471;&#21040;&#30340;&#31561;&#20215;&#38142;&#26126;&#30830;&#25551;&#36848;&#20102;&#37027;&#20123;&#24635;&#26159;&#20445;&#25345;&#32435;&#20160;&#22343;&#34913;&#38598;&#65288;&#25110;&#26368;&#20339;&#21453;&#24212;&#38598;&#65289;&#30340;&#28216;&#25103;&#21464;&#25442;&#12290;&#21516;&#26102;&#65292;&#25105;&#20204;&#33719;&#24471;&#20102;&#27491;&#20223;&#23556;&#21464;&#25442;&#31867;&#30340;&#20004;&#20010;&#26032;&#29305;&#24449;&#25551;&#36848;&#12290;
&lt;/p&gt;
&lt;p&gt;
In the literature on simultaneous non-cooperative games, it is a widely used fact that a positive affine (linear) transformation of the utility payoffs neither changes the best response sets nor the Nash equilibrium set. We investigate which other game transformations also possess one of these two properties when being applied to an arbitrary N-player game (N &gt;= 2):  (i) The Nash equilibrium set stays the same.  (ii) The best response sets stay the same.  For game transformations that operate player-wise and strategy-wise, we prove that (i) implies (ii) and that transformations with property (ii) must be positive affine. The resulting equivalence chain gives an explicit description of all those game transformations that always preserve the Nash equilibrium set (or, respectively, the best response sets). Simultaneously, we obtain two new characterizations of the class of positive affine transformations.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#22312;&#23384;&#22312;&#35823;&#25253;&#21644;&#31163;&#25955;&#22411;&#24037;&#20855;&#21464;&#37327;&#24773;&#20917;&#19979;&#65292;&#23545;&#36793;&#38469;&#27835;&#30103;&#25928;&#24212;&#36827;&#34892;&#37096;&#20998;&#35782;&#21035;&#30340;&#32467;&#26524;&#65292;&#21487;&#20197;&#29992;&#20110;&#30830;&#23450;&#39135;&#21697;&#21048;&#23545;&#20581;&#24247;&#30340;&#36793;&#38469;&#27835;&#30103;&#25928;&#24212;&#12290;</title><link>http://arxiv.org/abs/2110.06285</link><description>&lt;p&gt;
&#24212;&#29992;&#31163;&#25955;&#24037;&#20855;&#21644;&#35823;&#25253;&#22788;&#29702;&#23616;&#37096;&#36793;&#38469;&#27835;&#30103;&#25928;&#24212;&#30340;&#37096;&#20998;&#35782;&#21035;
&lt;/p&gt;
&lt;p&gt;
Partial Identification of Marginal Treatment Effects with discrete instruments and misreported treatment. (arXiv:2110.06285v3 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2110.06285
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#22312;&#23384;&#22312;&#35823;&#25253;&#21644;&#31163;&#25955;&#22411;&#24037;&#20855;&#21464;&#37327;&#24773;&#20917;&#19979;&#65292;&#23545;&#36793;&#38469;&#27835;&#30103;&#25928;&#24212;&#36827;&#34892;&#37096;&#20998;&#35782;&#21035;&#30340;&#32467;&#26524;&#65292;&#21487;&#20197;&#29992;&#20110;&#30830;&#23450;&#39135;&#21697;&#21048;&#23545;&#20581;&#24247;&#30340;&#36793;&#38469;&#27835;&#30103;&#25928;&#24212;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#22312;&#20108;&#20803;&#27835;&#30103;&#21464;&#37327;&#21487;&#33021;&#23384;&#22312;&#35823;&#25253;&#21644;&#24037;&#20855;&#21464;&#37327;&#20026;&#31163;&#25955;&#22411;&#30340;&#24773;&#20917;&#19979;&#65292;&#23545;&#36793;&#38469;&#27835;&#30103;&#25928;&#24212;&#65288;$MTE$&#65289;&#36827;&#34892;&#37096;&#20998;&#35782;&#21035;&#30340;&#32467;&#26524;&#12290;&#35782;&#21035;&#32467;&#26524;&#26159;&#22312;&#19981;&#21516;&#30340;&#38750;&#21442;&#25968;&#20551;&#35774;&#38598;&#19979;&#24471;&#20986;&#30340;&#12290;&#35813;&#35782;&#21035;&#32467;&#26524;&#34987;&#24212;&#29992;&#20110;&#30830;&#23450;&#39135;&#21697;&#21048;&#23545;&#20581;&#24247;&#30340;&#36793;&#38469;&#27835;&#30103;&#25928;&#24212;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper provides partial identification results for the marginal treatment effect ($MTE$) when the binary treatment variable is potentially misreported and the instrumental variable is discrete. Identification results are derived under different sets of nonparametric assumptions. The identification results are illustrated in identifying the marginal treatment effects of food stamps on health.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#26085;&#26412;&#36816;&#36755;&#24182;&#36141;&#65292;&#36890;&#36807;&#26410;&#21305;&#37197;&#20844;&#21496;&#30340;&#23384;&#22312;&#65292;&#20272;&#35745;&#20102;&#20869;&#29983;&#24182;&#36141;&#30340;&#25104;&#26412;&#65292;&#21457;&#29616;&#25216;&#26415;&#22810;&#26679;&#21270;&#30340;&#37325;&#35201;&#24615;&#22240;&#36816;&#33829;&#21830;&#21644;&#20844;&#21496;&#31867;&#22411;&#32780;&#24322;&#65292;&#22312;&#21453;&#20107;&#23454;&#27169;&#25311;&#20013;&#65292;&#25919;&#24220;&#25903;&#20986;&#21487;&#21066;&#20943;20&#65285;&#12290;</title><link>http://arxiv.org/abs/2108.12744</link><description>&lt;p&gt;
&#20272;&#35745;&#20869;&#29983;&#32852;&#21512;&#24182;&#36141;: &#24182;&#36141;&#25104;&#26412;&#21644;&#22823;&#23567;&#19982;&#19987;&#19994;&#24615;&#38388;&#30340;&#21516;&#36136;&#21270;
&lt;/p&gt;
&lt;p&gt;
Estimating Endogenous Coalitional Mergers: Merger Costs and Assortativeness of Size and Specialization. (arXiv:2108.12744v5 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2108.12744
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#26085;&#26412;&#36816;&#36755;&#24182;&#36141;&#65292;&#36890;&#36807;&#26410;&#21305;&#37197;&#20844;&#21496;&#30340;&#23384;&#22312;&#65292;&#20272;&#35745;&#20102;&#20869;&#29983;&#24182;&#36141;&#30340;&#25104;&#26412;&#65292;&#21457;&#29616;&#25216;&#26415;&#22810;&#26679;&#21270;&#30340;&#37325;&#35201;&#24615;&#22240;&#36816;&#33829;&#21830;&#21644;&#20844;&#21496;&#31867;&#22411;&#32780;&#24322;&#65292;&#22312;&#21453;&#20107;&#23454;&#27169;&#25311;&#20013;&#65292;&#25919;&#24220;&#25903;&#20986;&#21487;&#21066;&#20943;20&#65285;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#32467;&#26500;&#24615;&#23454;&#35777;&#27169;&#22411;&#65292;&#36890;&#36807;&#34917;&#20805;&#24615;&#19982;&#19968;&#23545;&#22810;&#21305;&#37197;&#26469;&#37327;&#21270;&#34917;&#36148;&#35774;&#35745;&#23545;&#20869;&#29983;&#24182;&#36141;&#21305;&#37197;&#30340;&#24433;&#21709;&#12290;&#26412;&#25991;&#35843;&#26597;&#20102;1964&#24180;&#26085;&#26412;&#30340;&#36816;&#36755;&#24182;&#36141;&#21644;&#25972;&#24182;&#65292;&#24403;&#26102;95&#23478;&#20844;&#21496;&#24418;&#25104;&#20102;&#20845;&#20010;&#22823;&#38598;&#22242;&#12290;&#30740;&#31350;&#21457;&#29616;&#26410;&#21305;&#37197;&#30340;&#20844;&#21496;&#30340;&#23384;&#22312;&#20351;&#25105;&#20204;&#33021;&#22815;&#24674;&#22797;&#24182;&#36141;&#25104;&#26412;&#65292;&#24182;&#19988;&#25216;&#26415;&#22810;&#26679;&#21270;&#30340;&#37325;&#35201;&#24615;&#22240;&#36816;&#33829;&#21830;&#21644;&#20844;&#21496;&#31867;&#22411;&#32780;&#24322;&#12290;&#21453;&#20107;&#23454;&#27169;&#25311;&#34920;&#26126;&#65292;&#25919;&#24220;&#34917;&#36148;&#25903;&#20986;&#30340;20&#65285;&#21487;&#20197;&#34987;&#21066;&#20943;&#12290;&#25919;&#24220;&#21487;&#33021;&#20250;&#25913;&#21464;&#24179;&#34913;&#29366;&#24577;&#19979;&#30340;&#38598;&#22242;&#25968;&#37327;&#65292;&#20174;&#19968;&#20010;&#21040;&#20845;&#20010;&#38598;&#22242;&#12290;
&lt;/p&gt;
&lt;p&gt;
I present a structural empirical model of a one-sided one-to-many matching with complementarities to quantify the effect of subsidy design on endogenous merger matching. I investigate shipping mergers and consolidations in Japan in 1964. At the time, 95 firms formed six large groups. I find that the existence of unmatched firms enables us to recover merger costs, and the importance of technological diversification varies across carrier and firm types. The counterfactual simulations show that 20 \% of government subsidy expenditures could have been cut. The government could have possibly changed the equilibrium number of groups to between one and six.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#24320;&#21457;&#20102;&#32852;&#37030;&#26041;&#27861;&#65292;&#22312;&#24322;&#26500;&#30340;&#26412;&#22320;&#25968;&#25454;&#20013;&#36827;&#34892;&#25688;&#35201;&#32479;&#35745;&#20449;&#24687;&#30340;&#35745;&#31639;&#65292;&#24182;&#22312;&#31449;&#28857;&#20043;&#38388;&#32858;&#21512;&#36825;&#20123;&#32479;&#35745;&#20449;&#24687;&#65292;&#20197;&#33719;&#24471;&#22810;&#31449;&#28857;&#25968;&#25454;&#30340;&#24179;&#22343;&#27835;&#30103;&#25928;&#26524;&#30340;&#28857;&#20272;&#35745;&#21644;&#26041;&#24046;&#20272;&#35745;&#12290;&#32858;&#21512;&#26041;&#26696;&#38656;&#35201;&#32771;&#34385;&#31449;&#28857;&#20043;&#38388;&#30340;&#27835;&#30103;&#20998;&#37197;&#24322;&#36136;&#24615;&#21644;&#32467;&#26524;&#30340;&#24322;&#36136;&#24615;&#65292;&#20197;&#20351;&#24471;&#20272;&#35745;&#37327;&#26159;&#19968;&#33268;&#30340;&#21644;&#28176;&#36817;&#27491;&#24120;&#30340;&#12290;</title><link>http://arxiv.org/abs/2107.11732</link><description>&lt;p&gt;
&#24322;&#26500;&#35266;&#27979;&#25968;&#25454;&#20013;&#32852;&#37030;&#22240;&#26524;&#25512;&#26029;
&lt;/p&gt;
&lt;p&gt;
Federated Causal Inference in Heterogeneous Observational Data. (arXiv:2107.11732v5 [cs.LG] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2107.11732
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#24320;&#21457;&#20102;&#32852;&#37030;&#26041;&#27861;&#65292;&#22312;&#24322;&#26500;&#30340;&#26412;&#22320;&#25968;&#25454;&#20013;&#36827;&#34892;&#25688;&#35201;&#32479;&#35745;&#20449;&#24687;&#30340;&#35745;&#31639;&#65292;&#24182;&#22312;&#31449;&#28857;&#20043;&#38388;&#32858;&#21512;&#36825;&#20123;&#32479;&#35745;&#20449;&#24687;&#65292;&#20197;&#33719;&#24471;&#22810;&#31449;&#28857;&#25968;&#25454;&#30340;&#24179;&#22343;&#27835;&#30103;&#25928;&#26524;&#30340;&#28857;&#20272;&#35745;&#21644;&#26041;&#24046;&#20272;&#35745;&#12290;&#32858;&#21512;&#26041;&#26696;&#38656;&#35201;&#32771;&#34385;&#31449;&#28857;&#20043;&#38388;&#30340;&#27835;&#30103;&#20998;&#37197;&#24322;&#36136;&#24615;&#21644;&#32467;&#26524;&#30340;&#24322;&#36136;&#24615;&#65292;&#20197;&#20351;&#24471;&#20272;&#35745;&#37327;&#26159;&#19968;&#33268;&#30340;&#21644;&#28176;&#36817;&#27491;&#24120;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#26088;&#22312;&#20272;&#35745;&#24212;&#29992;&#20110;&#22810;&#20010;&#31449;&#28857;&#20010;&#20307;&#30340;&#27835;&#30103;&#25928;&#24212;&#65292;&#20854;&#20013;&#27599;&#20010;&#31449;&#28857;&#23384;&#20648;&#26412;&#22320;&#25968;&#25454;&#65292;&#30001;&#20110;&#38544;&#31169;&#38480;&#21046;&#65292;&#20010;&#20307;&#32423;&#25968;&#25454;&#19981;&#33021;&#22312;&#31449;&#28857;&#20043;&#38388;&#20849;&#20139;;&#21516;&#26102;&#65292;&#36825;&#20123;&#31449;&#28857;&#21487;&#33021;&#20855;&#26377;&#24322;&#26500;&#30340;&#20154;&#21475;&#21644;&#27835;&#30103;&#20998;&#37197;&#26426;&#21046;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20123;&#38382;&#39064;&#65292;&#25105;&#20204;&#24320;&#21457;&#20102;&#32852;&#37030;&#26041;&#27861;&#65292;&#20197;&#23545;&#36328;&#31449;&#28857;&#21512;&#24182;&#25968;&#25454;&#30340;&#24179;&#22343;&#27835;&#30103;&#25928;&#26524;&#36827;&#34892;&#25512;&#26029;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#39318;&#20808;&#20351;&#29992;&#20542;&#21521;&#20998;&#25968;&#22312;&#26412;&#22320;&#35745;&#31639;&#25688;&#35201;&#32479;&#35745;&#20449;&#24687;&#65292;&#28982;&#21518;&#22312;&#31449;&#28857;&#20043;&#38388;&#32858;&#21512;&#36825;&#20123;&#32479;&#35745;&#20449;&#24687;&#65292;&#20197;&#33719;&#24471;&#24179;&#22343;&#27835;&#30103;&#25928;&#26524;&#30340;&#28857;&#20272;&#35745;&#21644;&#26041;&#24046;&#20272;&#35745;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#36825;&#20123;&#20272;&#35745;&#37327;&#26159;&#19968;&#33268;&#30340;&#21644;&#28176;&#36817;&#27491;&#24120;&#30340;&#12290;&#20026;&#20102;&#23454;&#29616;&#36825;&#20123;&#28176;&#36817;&#24615;&#36136;&#65292;&#25105;&#20204;&#21457;&#29616;&#32858;&#21512;&#26041;&#26696;&#38656;&#35201;&#32771;&#34385;&#31449;&#28857;&#20043;&#38388;&#30340;&#27835;&#30103;&#20998;&#37197;&#24322;&#36136;&#24615;&#21644;&#32467;&#26524;&#30340;&#24322;&#36136;&#24615;&#12290;&#25105;&#20204;&#36890;&#36807;&#23545;&#20004;&#20010;&#22823;&#22411;&#21307;&#23398;&#20020;&#24202;&#36827;&#34892;&#27604;&#36739;&#30740;&#31350;&#26469;&#35777;&#26126;&#25105;&#20204;&#32852;&#37030;&#26041;&#27861;&#30340;&#26377;&#25928;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
We are interested in estimating the effect of a treatment applied to individuals at multiple sites, where data is stored locally for each site. Due to privacy constraints, individual-level data cannot be shared across sites; the sites may also have heterogeneous populations and treatment assignment mechanisms. Motivated by these considerations, we develop federated methods to draw inference on the average treatment effects of combined data across sites. Our methods first compute summary statistics locally using propensity scores and then aggregate these statistics across sites to obtain point and variance estimators of average treatment effects. We show that these estimators are consistent and asymptotically normal. To achieve these asymptotic properties, we find that the aggregation schemes need to account for the heterogeneity in treatment assignments and in outcomes across sites. We demonstrate the validity of our federated methods through a comparative study of two large medical cl
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#20108;&#20803;&#27835;&#30103;&#21464;&#37327;&#34987;&#35823;&#20998;&#31867;&#26102;&#36793;&#38469;&#22788;&#29702;&#25928;&#24212;&#65288;MTE&#65289;&#30340;&#35782;&#21035;&#12290;&#25105;&#20204;&#35777;&#26126;&#22312;&#26631;&#20934;&#20551;&#35774;&#19979;&#65292;MTE&#21487;&#34987;&#35782;&#21035;&#20026;&#32473;&#23450;&#30495;&#23454;&#20542;&#21521;&#24471;&#20998;&#30340;&#35266;&#23519;&#32467;&#26524;&#26465;&#20214;&#26399;&#26395;&#30340;&#23548;&#25968;&#65292;&#25105;&#20204;&#30340;MTE&#30028;&#38480;&#27604;&#23616;&#37096;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#30340;&#29616;&#26377;&#30028;&#38480;&#26356;&#32039;&#12290;</title><link>http://arxiv.org/abs/2105.00358</link><description>&lt;p&gt;
&#34987;&#35823;&#20998;&#31867;&#22788;&#29702;&#30340;&#36793;&#38469;&#22788;&#29702;&#25928;&#24212;
&lt;/p&gt;
&lt;p&gt;
Marginal Treatment Effects with a Misclassified Treatment. (arXiv:2105.00358v6 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2105.00358
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#20108;&#20803;&#27835;&#30103;&#21464;&#37327;&#34987;&#35823;&#20998;&#31867;&#26102;&#36793;&#38469;&#22788;&#29702;&#25928;&#24212;&#65288;MTE&#65289;&#30340;&#35782;&#21035;&#12290;&#25105;&#20204;&#35777;&#26126;&#22312;&#26631;&#20934;&#20551;&#35774;&#19979;&#65292;MTE&#21487;&#34987;&#35782;&#21035;&#20026;&#32473;&#23450;&#30495;&#23454;&#20542;&#21521;&#24471;&#20998;&#30340;&#35266;&#23519;&#32467;&#26524;&#26465;&#20214;&#26399;&#26395;&#30340;&#23548;&#25968;&#65292;&#25105;&#20204;&#30340;MTE&#30028;&#38480;&#27604;&#23616;&#37096;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#30340;&#29616;&#26377;&#30028;&#38480;&#26356;&#32039;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#20108;&#20803;&#27835;&#30103;&#21464;&#37327;&#34987;&#35823;&#20998;&#31867;&#26102;&#36793;&#38469;&#22788;&#29702;&#25928;&#24212;&#65288;MTE&#65289;&#30340;&#35782;&#21035;&#12290;&#25105;&#20204;&#35777;&#26126;&#65292;&#22312;&#26631;&#20934;&#20551;&#35774;&#19979;&#65292;MTE&#21487;&#34987;&#35782;&#21035;&#20026;&#32473;&#23450;&#30495;&#23454;&#20542;&#21521;&#24471;&#20998;&#30340;&#35266;&#23519;&#32467;&#26524;&#26465;&#20214;&#26399;&#26395;&#30340;&#23548;&#25968;&#65292;&#32780;&#20542;&#21521;&#24471;&#20998;&#20165;&#34987;&#37096;&#20998;&#30830;&#23450;&#12290;&#25105;&#20204;&#21051;&#30011;&#20102;&#35813;&#20542;&#21521;&#24471;&#20998;&#30340;&#35782;&#21035;&#38598;&#65292;&#28982;&#21518;&#26159;MTE&#30340;&#35782;&#21035;&#38598;&#65292;&#35777;&#26126;&#20102;&#22312;&#19968;&#20123;&#28201;&#21644;&#30340;&#27491;&#21017;&#26465;&#20214;&#19979;&#65292;MTE&#30340;&#31526;&#21495;&#23616;&#37096;&#34987;&#30830;&#23450;&#12290;&#25105;&#20204;&#20351;&#29992;&#25105;&#20204;&#30340;MTE&#30028;&#38480;&#25512;&#23548;&#20102;&#25991;&#29486;&#20013;&#20854;&#20182;&#24120;&#29992;&#21442;&#25968;&#30340;&#30028;&#38480;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#25105;&#20204;&#30340;&#30028;&#38480;&#27604;&#23616;&#37096;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#30340;&#29616;&#26377;&#30028;&#38480;&#26356;&#32039;&#12290;&#25105;&#20204;&#36890;&#36807;&#19968;&#20123;&#25968;&#20540;&#21644;&#23454;&#35777;&#32467;&#26524;&#23637;&#31034;&#20102;&#25105;&#20204;&#24471;&#20986;&#30340;&#30028;&#38480;&#30340;&#23454;&#38469;&#30456;&#20851;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper studies identification of the marginal treatment effect (MTE) when a binary treatment variable is misclassified. We show under standard assumptions that the MTE is identified as the derivative of the conditional expectation of the observed outcome given the true propensity score, which is partially identified. We characterize the identified set for this propensity score, and then for the MTE. We show under some mild regularity conditions that the sign of the MTE is locally identified. We use our MTE bounds to derive bounds on other commonly used parameters in the literature. We show that our bounds are tighter than the existing bounds for the local average treatment effect. We illustrate the practical relevance of our derived bounds through some numerical and empirical results.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#26041;&#27861;&#65292;&#22240;&#23376;&#22270;&#24418;Lasso&#65288;FGL&#65289;&#65292;&#23558;&#22270;&#24418;&#27169;&#22411;&#19982;&#22240;&#23376;&#32467;&#26500;&#30456;&#32467;&#21512;&#65292;&#29992;&#20110;&#25237;&#36164;&#32452;&#21512;&#20998;&#37197;&#30340;&#32972;&#26223;&#19979;&#65292;&#36825;&#31181;&#26041;&#27861;&#23545;&#20110;&#37329;&#34701;&#24212;&#29992;&#26469;&#35828;&#20855;&#26377;&#20581;&#22766;&#24615;&#19988;&#21487;&#20197;&#25552;&#39640;&#25237;&#36164;&#32452;&#21512;&#34920;&#29616;&#12290;</title><link>http://arxiv.org/abs/2011.00435</link><description>&lt;p&gt;
&#20351;&#29992;&#22240;&#23376;&#22270;&#24418;Lasso&#30340;&#26368;&#20248;&#25237;&#36164;&#32452;&#21512;
&lt;/p&gt;
&lt;p&gt;
Optimal Portfolio Using Factor Graphical Lasso. (arXiv:2011.00435v5 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2011.00435
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#26041;&#27861;&#65292;&#22240;&#23376;&#22270;&#24418;Lasso&#65288;FGL&#65289;&#65292;&#23558;&#22270;&#24418;&#27169;&#22411;&#19982;&#22240;&#23376;&#32467;&#26500;&#30456;&#32467;&#21512;&#65292;&#29992;&#20110;&#25237;&#36164;&#32452;&#21512;&#20998;&#37197;&#30340;&#32972;&#26223;&#19979;&#65292;&#36825;&#31181;&#26041;&#27861;&#23545;&#20110;&#37329;&#34701;&#24212;&#29992;&#26469;&#35828;&#20855;&#26377;&#20581;&#22766;&#24615;&#19988;&#21487;&#20197;&#25552;&#39640;&#25237;&#36164;&#32452;&#21512;&#34920;&#29616;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22270;&#24418;&#27169;&#22411;&#26159;&#20272;&#35745;&#39640;&#32500;&#36870;&#21327;&#26041;&#24046;&#65288;&#31934;&#24230;&#65289;&#30697;&#38453;&#30340;&#24378;&#22823;&#24037;&#20855;&#65292;&#24050;&#24212;&#29992;&#20110;&#25237;&#36164;&#32452;&#21512;&#20998;&#37197;&#38382;&#39064;&#12290;&#36825;&#20123;&#27169;&#22411;&#25152;&#20570;&#30340;&#20551;&#35774;&#26159;&#31934;&#24230;&#30697;&#38453;&#30340;&#31232;&#30095;&#24615;&#12290;&#28982;&#32780;&#65292;&#24403;&#32929;&#31080;&#25910;&#30410;&#34987;&#20849;&#21516;&#22240;&#32032;&#39537;&#21160;&#26102;&#65292;&#36825;&#31181;&#20551;&#35774;&#19981;&#25104;&#31435;&#12290;&#25105;&#20204;&#35299;&#20915;&#20102;&#36825;&#20010;&#38480;&#21046;&#65292;&#24182;&#24320;&#21457;&#20102;&#19968;&#20010;&#26694;&#26550;&#65292;&#31216;&#20026;&#22240;&#23376;&#22270;&#24418;Lasso&#65288;FGL&#65289;&#65292;&#22312;&#25237;&#36164;&#32452;&#21512;&#20998;&#37197;&#30340;&#32972;&#26223;&#19979;&#23558;&#22270;&#24418;&#27169;&#22411;&#19982;&#22240;&#23376;&#32467;&#26500;&#30456;&#32467;&#21512;&#65292;&#36890;&#36807;&#23558;&#31934;&#24230;&#30697;&#38453;&#20998;&#35299;&#25104;&#20302;&#31209;&#21644;&#31232;&#30095;&#20998;&#37327;&#12290;&#25105;&#20204;&#30340;&#29702;&#35770;&#32467;&#26524;&#21644;&#27169;&#25311;&#34920;&#26126;&#65292;FGL consistently&#20272;&#35745;&#25237;&#36164;&#32452;&#21512;&#26435;&#37325;&#21644;&#39118;&#38505;&#25950;&#21475;&#65292;&#24182;&#19988;FGL&#23545;&#20110;&#37325;&#23614;&#20998;&#24067;&#26159;&#20581;&#22766;&#30340;&#65292;&#36825;&#20351;&#24471;&#25105;&#20204;&#30340;&#26041;&#27861;&#36866;&#29992;&#20110;&#37329;&#34701;&#24212;&#29992;&#12290;&#23454;&#35777;&#24212;&#29992;&#20013;&#65292;FGL&#22522;&#20110;&#30340;&#25237;&#36164;&#32452;&#21512;&#34920;&#29616;&#20248;&#20110;&#20960;&#20010;&#26174;&#30528;&#30340;&#31454;&#20105;&#23545;&#25163;&#65292;&#21253;&#25324;&#31561;&#26435;&#21644;&#25351;&#25968;&#25237;&#36164;&#32452;&#21512;&#12290;
&lt;/p&gt;
&lt;p&gt;
Graphical models are a powerful tool to estimate a high-dimensional inverse covariance (precision) matrix, which has been applied for a portfolio allocation problem. The assumption made by these models is a sparsity of the precision matrix. However, when stock returns are driven by common factors, such assumption does not hold. We address this limitation and develop a framework, Factor Graphical Lasso (FGL), which integrates graphical models with the factor structure in the context of portfolio allocation by decomposing a precision matrix into low-rank and sparse components. Our theoretical results and simulations show that FGL consistently estimates the portfolio weights and risk exposure and also that FGL is robust to heavy-tailed distributions which makes our method suitable for financial applications. FGL-based portfolios are shown to exhibit superior performance over several prominent competitors including equal-weighted and Index portfolios in the empirical application for the S&amp;
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#22914;&#20309;&#20351;&#29992;&#26377;&#30446;&#26631;&#24037;&#20855;&#26469;&#25511;&#21046;&#22810;&#20540;&#22788;&#29702;&#20013;&#30340;&#36873;&#25321;&#20559;&#24046;&#65292;&#24182;&#24314;&#31435;&#20102;&#32452;&#21512;&#32534;&#35793;&#22120;&#32676;&#20307;&#30340;&#26465;&#20214;&#26469;&#30830;&#23450;&#21453;&#20107;&#23454;&#24179;&#22343;&#20540;&#21644;&#22788;&#29702;&#25928;&#26524;&#12290;</title><link>http://arxiv.org/abs/2007.10432</link><description>&lt;p&gt;
&#26377;&#30446;&#26631;&#24037;&#20855;&#30340;&#36807;&#28388;&#19982;&#26410;&#36807;&#28388;&#22788;&#29702;&#25928;&#26524;
&lt;/p&gt;
&lt;p&gt;
Filtered and Unfiltered Treatment Effects with Targeting Instruments. (arXiv:2007.10432v3 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2007.10432
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#22914;&#20309;&#20351;&#29992;&#26377;&#30446;&#26631;&#24037;&#20855;&#26469;&#25511;&#21046;&#22810;&#20540;&#22788;&#29702;&#20013;&#30340;&#36873;&#25321;&#20559;&#24046;&#65292;&#24182;&#24314;&#31435;&#20102;&#32452;&#21512;&#32534;&#35793;&#22120;&#32676;&#20307;&#30340;&#26465;&#20214;&#26469;&#30830;&#23450;&#21453;&#20107;&#23454;&#24179;&#22343;&#20540;&#21644;&#22788;&#29702;&#25928;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#24212;&#29992;&#20013;&#65292;&#22810;&#20540;&#22788;&#29702;&#26159;&#24456;&#24120;&#35265;&#30340;&#12290;&#25105;&#20204;&#25506;&#35752;&#20102;&#22312;&#36825;&#31181;&#24773;&#20917;&#19979;&#20351;&#29992;&#31163;&#25955;&#24037;&#20855;&#26469;&#25511;&#21046;&#36873;&#25321;&#20559;&#24046;&#30340;&#26041;&#27861;&#12290;&#25105;&#20204;&#24378;&#35843;&#20102;&#26377;&#20851;&#23450;&#20301;&#65288;&#24037;&#20855;&#23450;&#20301;&#20110;&#21738;&#20123;&#22788;&#29702;&#65289;&#21644;&#36807;&#28388;&#65288;&#38480;&#21046;&#20998;&#26512;&#24072;&#23545;&#32473;&#23450;&#35266;&#27979;&#30340;&#22788;&#29702;&#20998;&#37197;&#30340;&#30693;&#35782;&#65289;&#30340;&#20551;&#35774;&#20316;&#29992;&#12290;&#36825;&#20801;&#35768;&#25105;&#20204;&#24314;&#31435;&#26465;&#20214;&#65292;&#20351;&#24471;&#38024;&#23545;&#32452;&#21512;&#32534;&#35793;&#22120;&#32676;&#20307;&#65292;&#21487;&#20197;&#30830;&#23450;&#21453;&#20107;&#23454;&#24179;&#22343;&#20540;&#21644;&#22788;&#29702;&#25928;&#26524;&#12290;&#25105;&#20204;&#36890;&#36807;&#23558;&#20854;&#24212;&#29992;&#20110;Head Start Impact Study&#21644;Student Achievement and Retention Project&#30340;&#25968;&#25454;&#26469;&#35828;&#26126;&#25105;&#20204;&#26694;&#26550;&#30340;&#23454;&#29992;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Multivalued treatments are commonplace in applications. We explore the use of discrete-valued instruments to control for selection bias in this setting. Our discussion stresses the role of assumptions on targeting (which instruments target which treatments) and filtering (limits on the analyst's knowledge of the treatment assigned to a given observation). It allows us to establish conditions under which counterfactual averages and treatment effects are identified for composite complier groups. We illustrate the usefulness of our framework by applying it to data from the Head Start Impact Study and the Student Achievement and Retention Project.
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#38024;&#23545;&#26102;&#38388;&#24207;&#21015;&#27169;&#22411;&#24320;&#21457;&#20102;&#19968;&#31867;&#27979;&#35797;&#26041;&#27861;&#65292;&#36890;&#36807;&#24341;&#20837;&#26032;&#30340;&#23610;&#24230;&#26657;&#27491;&#21644;&#20559;&#24046;&#26657;&#27491;&#26469;&#32771;&#34385;&#20854;&#22797;&#26434;&#24615;&#65292;&#20223;&#30495;&#30740;&#31350;&#34920;&#26126;&#40065;&#26834;&#21270;&#27979;&#35797;&#31243;&#24207;&#23545;&#20110;&#20445;&#35777;&#20934;&#30830;&#24615;&#21644;&#31283;&#20581;&#24615;&#26159;&#24456;&#37325;&#35201;&#30340;&#12290;</title><link>http://arxiv.org/abs/1911.08637</link><description>&lt;p&gt;
&#26080;&#38480;&#21644;&#22686;&#38271;&#32500;&#24230;&#26102;&#38388;&#24207;&#21015;&#22238;&#24402;&#30340;&#40065;&#26834;&#25512;&#26029;
&lt;/p&gt;
&lt;p&gt;
Robust Inference on Infinite and Growing Dimensional Time Series Regression. (arXiv:1911.08637v4 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/1911.08637
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#38024;&#23545;&#26102;&#38388;&#24207;&#21015;&#27169;&#22411;&#24320;&#21457;&#20102;&#19968;&#31867;&#27979;&#35797;&#26041;&#27861;&#65292;&#36890;&#36807;&#24341;&#20837;&#26032;&#30340;&#23610;&#24230;&#26657;&#27491;&#21644;&#20559;&#24046;&#26657;&#27491;&#26469;&#32771;&#34385;&#20854;&#22797;&#26434;&#24615;&#65292;&#20223;&#30495;&#30740;&#31350;&#34920;&#26126;&#40065;&#26834;&#21270;&#27979;&#35797;&#31243;&#24207;&#23545;&#20110;&#20445;&#35777;&#20934;&#30830;&#24615;&#21644;&#31283;&#20581;&#24615;&#26159;&#24456;&#37325;&#35201;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#38024;&#23545;&#26102;&#38388;&#24207;&#21015;&#27169;&#22411;&#65292;&#22914;&#22686;&#38271;&#32500;&#24230;&#30340;&#22810;&#20803;&#22238;&#24402;&#12289;&#26080;&#31351;&#38454;&#33258;&#22238;&#24402;&#21644;&#38750;&#21442;&#25968;&#31579;&#23376;&#22238;&#24402;&#65292;&#24320;&#21457;&#20102;&#19968;&#31867;&#27979;&#35797;&#26041;&#27861;&#12290;&#20854;&#20013;&#21253;&#25324;Chow&#27979;&#35797;&#21644;&#22686;&#38271;&#31209;$p$&#30340;&#19968;&#33324;&#32447;&#24615;&#38480;&#21046;&#27979;&#35797;&#12290;&#36890;&#36807;&#37319;&#29992;&#36880;&#28176;&#22686;&#22823;&#30340;$p$&#28176;&#36817;&#29702;&#35770;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#31181;&#26032;&#30340;&#23610;&#24230;&#26657;&#27491;&#21040;&#20256;&#32479;&#30340;&#27979;&#35797;&#32479;&#35745;&#37327;&#20013;&#65292;&#35813;&#26657;&#27491;&#32771;&#34385;&#20102;&#19968;&#20010;&#39640;&#38454;&#38271;&#26399;&#26041;&#24046;&#65288;HLV&#65289;&#65292;&#35813;HLV&#38543;&#30528;&#26679;&#26412;&#22823;&#23567;&#30340;&#22686;&#38271;&#32780;&#20135;&#29983;&#12290;&#25105;&#20204;&#36824;&#25552;&#20986;&#20102;&#19968;&#31181;&#20559;&#24046;&#26657;&#27491;&#26041;&#27861;&#65292;&#21363;&#29992;&#38646;&#20551;&#35774;&#24341;&#23548;&#30340;bootstrap&#26041;&#27861;&#26469;&#20943;&#36731;&#26377;&#38480;&#26679;&#26412;&#20559;&#24046;&#65292;&#32780;&#19981;&#20250;&#29306;&#29298;&#21151;&#29575;&#36807;&#22810;&#12290;&#20223;&#30495;&#30740;&#31350;&#34920;&#26126;&#65292;&#21363;&#20351;$p$&#26159;&#36866;&#24230;&#30340;&#65292;&#40065;&#26834;&#21270;&#27979;&#35797;&#31243;&#24207;&#20063;&#24456;&#37325;&#35201;&#12290;&#25105;&#20204;&#36890;&#36807;&#24212;&#29992;&#21040;Hamilton&#65288;2003&#65289;&#30340;&#27833;&#20215;&#22238;&#24402;&#20013;&#65292;&#35828;&#26126;&#20102;&#36825;&#20123;&#27979;&#35797;&#30340;&#20316;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;
We develop a class of tests for time series models such as multiple regression with growing dimension, infinite-order autoregression and nonparametric sieve regression. Examples include the Chow test and general linear restriction tests of growing rank $p$. Employing such increasing $p$ asymptotics, we introduce a new scale correction to conventional test statistics which accounts for a high-order long-run variance (HLV) that emerges as $ p $ grows with sample size. We also propose a bias correction via a null-imposed bootstrap to alleviate finite sample bias without sacrificing power unduly. A simulation study shows the importance of robustifying testing procedures against the HLV even when $ p $ is moderate. The tests are illustrated with an application to the oil regressions in Hamilton (2003).
&lt;/p&gt;</description></item></channel></rss>