<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#24179;&#28369;&#25351;&#31034;&#20989;&#25968;&#30340;&#26041;&#27861;&#65292;&#24182;&#20026;&#36825;&#31867;&#27169;&#22411;&#24320;&#21457;&#20102;&#28176;&#36817;&#20998;&#24067;&#29702;&#35770;&#65292;&#23637;&#29616;&#20102;&#20559;&#24046;&#21644;&#26041;&#24046;&#20043;&#38388;&#30340;&#25240;&#34935;&#20851;&#31995;&#65292;&#24182;&#30740;&#31350;&#20102;&#22914;&#20309;&#36873;&#25321;&#26368;&#20248;&#30340;&#24179;&#28369;&#31243;&#24230;&#21442;&#25968;&#12290;</title><link>https://arxiv.org/abs/2403.15934</link><description>&lt;p&gt;
&#24403;&#25351;&#31034;&#20989;&#25968;&#20013;&#20986;&#29616;&#24178;&#25200;&#21442;&#25968;&#26102;&#30340;&#21435;&#20559;&#26426;&#22120;&#23398;&#20064;
&lt;/p&gt;
&lt;p&gt;
Debiased Machine Learning when Nuisance Parameters Appear in Indicator Functions
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.15934
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#24179;&#28369;&#25351;&#31034;&#20989;&#25968;&#30340;&#26041;&#27861;&#65292;&#24182;&#20026;&#36825;&#31867;&#27169;&#22411;&#24320;&#21457;&#20102;&#28176;&#36817;&#20998;&#24067;&#29702;&#35770;&#65292;&#23637;&#29616;&#20102;&#20559;&#24046;&#21644;&#26041;&#24046;&#20043;&#38388;&#30340;&#25240;&#34935;&#20851;&#31995;&#65292;&#24182;&#30740;&#31350;&#20102;&#22914;&#20309;&#36873;&#25321;&#26368;&#20248;&#30340;&#24179;&#28369;&#31243;&#24230;&#21442;&#25968;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#24403;&#25351;&#31034;&#20989;&#25968;&#20013;&#20986;&#29616;&#24178;&#25200;&#21442;&#25968;&#26102;&#30340;&#21435;&#20559;&#26426;&#22120;&#23398;&#20064;&#12290;&#19968;&#20010;&#37325;&#35201;&#30340;&#20363;&#23376;&#26159;&#22312;&#26368;&#20248;&#27835;&#30103;&#20998;&#37197;&#35268;&#21017;&#19979;&#26368;&#22823;&#21270;&#24179;&#22343;&#31119;&#21033;&#12290;&#20026;&#20102;&#23545;&#24863;&#20852;&#36259;&#30340;&#21442;&#25968;&#36827;&#34892;&#28176;&#36817;&#26377;&#25928;&#25512;&#26029;&#65292;&#24403;&#21069;&#26377;&#20851;&#21435;&#20559;&#26426;&#22120;&#23398;&#20064;&#30340;&#25991;&#29486;&#20381;&#36182;&#20110;&#30697;&#26465;&#20214;&#20869;&#37096;&#20989;&#25968;&#30340;Gateaux&#21487;&#24494;&#24615;&#65292;&#24403;&#25351;&#31034;&#20989;&#25968;&#20013;&#20986;&#29616;&#24178;&#25200;&#21442;&#25968;&#26102;&#65292;&#36825;&#31181;&#21487;&#24494;&#24615;&#19981;&#25104;&#31435;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#24179;&#28369;&#25351;&#31034;&#20989;&#25968;&#30340;&#26041;&#27861;&#65292;&#24182;&#20026;&#36825;&#31867;&#27169;&#22411;&#24320;&#21457;&#20102;&#28176;&#36817;&#20998;&#24067;&#29702;&#35770;&#12290;&#25152;&#25552;&#20272;&#35745;&#37327;&#30340;&#28176;&#36817;&#34892;&#20026;&#34920;&#29616;&#20986;&#30001;&#20110;&#24179;&#28369;&#32780;&#20135;&#29983;&#30340;&#20559;&#24046;&#21644;&#26041;&#24046;&#20043;&#38388;&#30340;&#25240;&#34935;&#12290;&#25105;&#20204;&#30740;&#31350;&#20102;&#22914;&#20309;&#36873;&#25321;&#25511;&#21046;&#24179;&#28369;&#31243;&#24230;&#30340;&#21442;&#25968;&#20197;&#26368;&#23567;&#21270;&#28176;&#36817;&#22343;&#26041;&#35823;&#24046;&#30340;&#19978;&#38480;&#12290;&#33945;&#29305;&#21345;&#27931;&#27169;&#25311;&#25903;&#25345;&#20102;&#28176;&#36817;&#20998;&#24067;&#29702;&#35770;&#65292;&#24182;&#19988;&#23454;&#35777;&#32467;&#26524;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.15934v1 Announce Type: new  Abstract: This paper studies debiased machine learning when nuisance parameters appear in indicator functions. An important example is maximized average welfare under optimal treatment assignment rules. For asymptotically valid inference for a parameter of interest, the current literature on debiased machine learning relies on Gateaux differentiability of the functions inside moment conditions, which does not hold when nuisance parameters appear in indicator functions. In this paper, we propose smoothing the indicator functions, and develop an asymptotic distribution theory for this class of models. The asymptotic behavior of the proposed estimator exhibits a trade-off between bias and variance due to smoothing. We study how a parameter which controls the degree of smoothing can be chosen optimally to minimize an upper bound of the asymptotic mean squared error. A Monte Carlo simulation supports the asymptotic distribution theory, and an empirical
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#26680;&#23725;&#22238;&#24402;&#30340;&#31616;&#21333;&#38750;&#21442;&#25968;&#20272;&#35745;&#26041;&#27861;&#65292;&#21487;&#20197;&#29992;&#20110;&#20272;&#35745;&#20171;&#23548;&#21644;&#26102;&#21464;&#21058;&#37327;&#21709;&#24212;&#26354;&#32447;&#12290;&#36890;&#36807;&#24341;&#20837;&#24207;&#36143;&#26680;&#23884;&#20837;&#25216;&#26415;&#65292;&#25105;&#20204;&#23454;&#29616;&#20102;&#23545;&#22797;&#26434;&#22240;&#26524;&#20272;&#35745;&#30340;&#31616;&#21270;&#12290;&#36890;&#36807;&#27169;&#25311;&#23454;&#39564;&#21644;&#30495;&#23454;&#25968;&#25454;&#30340;&#20272;&#35745;&#32467;&#26524;&#65292;&#35777;&#26126;&#20102;&#35813;&#26041;&#27861;&#30340;&#24378;&#22823;&#24615;&#33021;&#21644;&#26222;&#36866;&#24615;&#12290;</title><link>http://arxiv.org/abs/2111.03950</link><description>&lt;p&gt;
&#24207;&#36143;&#26680;&#23884;&#20837;&#29992;&#20110;&#20171;&#23548;&#21644;&#26102;&#21464;&#21058;&#37327;&#21709;&#24212;&#26354;&#32447;
&lt;/p&gt;
&lt;p&gt;
Sequential Kernel Embedding for Mediated and Time-Varying Dose Response Curves. (arXiv:2111.03950v4 [stat.ME] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2111.03950
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#26680;&#23725;&#22238;&#24402;&#30340;&#31616;&#21333;&#38750;&#21442;&#25968;&#20272;&#35745;&#26041;&#27861;&#65292;&#21487;&#20197;&#29992;&#20110;&#20272;&#35745;&#20171;&#23548;&#21644;&#26102;&#21464;&#21058;&#37327;&#21709;&#24212;&#26354;&#32447;&#12290;&#36890;&#36807;&#24341;&#20837;&#24207;&#36143;&#26680;&#23884;&#20837;&#25216;&#26415;&#65292;&#25105;&#20204;&#23454;&#29616;&#20102;&#23545;&#22797;&#26434;&#22240;&#26524;&#20272;&#35745;&#30340;&#31616;&#21270;&#12290;&#36890;&#36807;&#27169;&#25311;&#23454;&#39564;&#21644;&#30495;&#23454;&#25968;&#25454;&#30340;&#20272;&#35745;&#32467;&#26524;&#65292;&#35777;&#26126;&#20102;&#35813;&#26041;&#27861;&#30340;&#24378;&#22823;&#24615;&#33021;&#21644;&#26222;&#36866;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#22522;&#20110;&#26680;&#23725;&#22238;&#24402;&#30340;&#20171;&#23548;&#21644;&#26102;&#21464;&#21058;&#37327;&#21709;&#24212;&#26354;&#32447;&#30340;&#31616;&#21333;&#38750;&#21442;&#25968;&#20272;&#35745;&#22120;&#12290;&#36890;&#36807;&#23884;&#20837;Pearl&#30340;&#20171;&#23548;&#20844;&#24335;&#21644;Robins&#30340;g&#20844;&#24335;&#19982;&#26680;&#20989;&#25968;&#65292;&#25105;&#20204;&#20801;&#35768;&#22788;&#29702;&#12289;&#20171;&#23548;&#32773;&#21644;&#21327;&#21464;&#37327;&#22312;&#19968;&#33324;&#31354;&#38388;&#20013;&#36830;&#32493;&#21464;&#21270;&#65292;&#20063;&#20801;&#35768;&#38750;&#32447;&#24615;&#30340;&#22788;&#29702;-&#28151;&#28102;&#22240;&#32032;&#21453;&#39304;&#12290;&#25105;&#20204;&#30340;&#20851;&#38190;&#21019;&#26032;&#26159;&#19968;&#31181;&#31216;&#20026;&#24207;&#36143;&#26680;&#23884;&#20837;&#30340;&#20877;&#29983;&#26680;&#24076;&#23572;&#20271;&#29305;&#31354;&#38388;&#25216;&#26415;&#65292;&#25105;&#20204;&#20351;&#29992;&#23427;&#26469;&#26500;&#24314;&#22797;&#26434;&#22240;&#26524;&#20272;&#35745;&#30340;&#31616;&#21333;&#20272;&#35745;&#22120;&#12290;&#25105;&#20204;&#30340;&#20272;&#35745;&#22120;&#20445;&#30041;&#20102;&#32463;&#20856;&#35782;&#21035;&#30340;&#26222;&#36866;&#24615;&#65292;&#21516;&#26102;&#23454;&#29616;&#20102;&#38750;&#28176;&#36827;&#22343;&#21248;&#25910;&#25947;&#36895;&#24230;&#12290;&#22312;&#20855;&#26377;&#35768;&#22810;&#21327;&#21464;&#37327;&#30340;&#38750;&#32447;&#24615;&#27169;&#25311;&#20013;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#24378;&#22823;&#30340;&#24615;&#33021;&#12290;&#25105;&#20204;&#20272;&#35745;&#20102;&#32654;&#22269;&#32844;&#19994;&#35757;&#32451;&#22242;&#30340;&#20171;&#23548;&#21644;&#26102;&#21464;&#21058;&#37327;&#21709;&#24212;&#26354;&#32447;&#65292;&#24182;&#28165;&#27905;&#21487;&#33021;&#25104;&#20026;&#26410;&#26469;&#24037;&#20316;&#22522;&#20934;&#30340;&#25968;&#25454;&#12290;&#25105;&#20204;&#23558;&#25105;&#20204;&#30340;&#32467;&#26524;&#25512;&#24191;&#21040;&#20171;&#23548;&#21644;&#26102;&#21464;&#22788;&#29702;&#25928;&#24212;&#20197;&#21450;&#21453;&#20107;&#23454;&#20998;&#24067;&#65292;&#39564;&#35777;&#20102;&#21322;&#21442;&#25968;&#25928;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;
We propose simple nonparametric estimators for mediated and time-varying dose response curves based on kernel ridge regression. By embedding Pearl's mediation formula and Robins' g-formula with kernels, we allow treatments, mediators, and covariates to be continuous in general spaces, and also allow for nonlinear treatment-confounder feedback. Our key innovation is a reproducing kernel Hilbert space technique called sequential kernel embedding, which we use to construct simple estimators for complex causal estimands. Our estimators preserve the generality of classic identification while also achieving nonasymptotic uniform rates. In nonlinear simulations with many covariates, we demonstrate strong performance. We estimate mediated and time-varying dose response curves of the US Job Corps, and clean data that may serve as a benchmark in future work. We extend our results to mediated and time-varying treatment effects and counterfactual distributions, verifying semiparametric efficiency 
&lt;/p&gt;</description></item></channel></rss>