<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#33487;&#26684;&#20848;&#30340;&#20004;&#20010;&#22810;&#36873;&#20030;&#24182;&#25214;&#21040;&#20102;&#21333;&#35843;&#24615;&#24726;&#35770;&#65292;&#26080;&#20154;&#20986;&#24109;&#21644;&#22996;&#21592;&#20250;&#22823;&#23567;&#24726;&#35770;&#31561;&#24322;&#24120;&#29616;&#35937;&#12290;</title><link>http://arxiv.org/abs/2305.20078</link><description>&lt;p&gt;
&#33487;&#26684;&#20848;&#20004;&#20010;&#22810;&#32988;&#36873;&#20030;&#20013;&#30340;&#24726;&#35770;&#22855;&#24322;&#24615;
&lt;/p&gt;
&lt;p&gt;
Paradoxical Oddities in Two Multiwinner Elections from Scotland. (arXiv:2305.20078v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.20078
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#33487;&#26684;&#20848;&#30340;&#20004;&#20010;&#22810;&#36873;&#20030;&#24182;&#25214;&#21040;&#20102;&#21333;&#35843;&#24615;&#24726;&#35770;&#65292;&#26080;&#20154;&#20986;&#24109;&#21644;&#22996;&#21592;&#20250;&#22823;&#23567;&#24726;&#35770;&#31561;&#24322;&#24120;&#29616;&#35937;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20197;&#25490;&#21517;&#25237;&#31080;&#26041;&#24335;&#20026;&#22522;&#30784;&#30340;&#36873;&#20030;&#20013;&#65292;&#21333;&#35843;&#24615;&#24726;&#35770;&#31561;&#24322;&#24120;&#29616;&#35937;&#32463;&#36807;&#21019;&#24314;&#20551;&#35774;&#24615;&#31034;&#20363;&#24182;&#22312;&#22810;&#31181;&#36873;&#27665;&#34892;&#20026;&#27169;&#22411;&#19979;&#29983;&#25104;&#36873;&#20030;&#24050;&#24471;&#21040;&#24191;&#27867;&#30740;&#31350;&#12290;&#20294;&#26159;&#65292;&#22312;&#30495;&#23454;&#19990;&#30028;&#20013;&#24456;&#23569;&#21457;&#29616;&#24182;&#20998;&#26512;&#21040;&#36825;&#26679;&#30340;&#25237;&#31080;&#24726;&#35770;&#12290;&#26412;&#25991;&#30740;&#31350;&#20102;&#33487;&#26684;&#20848;&#30340;&#20004;&#20010;&#21333;&#35760;&#21517;&#36873;&#31080;&#36873;&#20030;&#65292;&#36825;&#20123;&#36873;&#20030;&#23637;&#31034;&#20102;&#21333;&#35843;&#24615;, &#26080;&#20154;&#20986;&#24109;&#21644;&#22996;&#21592;&#20250;&#22823;&#23567;&#30340;&#24726;&#35770;&#12290;&#36825;&#20123;&#24726;&#35770;&#22312;&#30495;&#23454;&#19990;&#30028;&#36873;&#20030;&#20013;&#24456;&#23569;&#34987;&#35266;&#23519;&#21040;&#65292;&#36825;&#31687;&#25991;&#31456;&#26159;&#20851;&#20110;&#22810;&#32988;&#36873;&#20030;&#20013;&#27492;&#31867;&#24726;&#35770;&#30340;&#31532;&#19968;&#20010;&#26696;&#20363;&#30740;&#31350;&#12290;
&lt;/p&gt;
&lt;p&gt;
Ranked-choice voting anomalies such as monotonicity paradoxes have been extensively studied through creating hypothetical examples and generating elections under various models of voter behavior. However, very few real-world examples of such voting paradoxes have been found and analyzed. We investigate two single-transferable vote elections from Scotland that demonstrate upward monotonicity, downward monotonicity, no-show, and committee size paradoxes. These paradoxes are rarely observed in real-world elections, and this article is the first case study of such paradoxes in multiwinner elections.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#38754;&#26495;&#25968;&#25454;&#27169;&#22411;&#20013;&#30340;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#20272;&#35745;&#65292;&#24182;&#20351;&#29992;&#35813;&#26041;&#27861;&#39044;&#27979;&#20102;G7&#22269;&#23478;&#26032;&#20896;&#32954;&#28814;&#30149;&#20363;&#30340;&#36827;&#23637;&#24773;&#20917;&#12290;&#36890;&#36807;&#25171;&#24320;&#31070;&#32463;&#32593;&#32476;&#30340;&#8220;&#40657;&#30418;&#23376;&#8221;&#65292;&#21457;&#29616;&#20102;&#20851;&#38381;&#23398;&#26657;&#21644;&#24037;&#20316;&#22330;&#25152;&#26159;&#38480;&#21046;&#30123;&#24773;&#34067;&#24310;&#30340;&#26377;&#25928;&#25919;&#31574;&#12290;</title><link>http://arxiv.org/abs/2305.19921</link><description>&lt;p&gt;
&#38754;&#26495;&#25968;&#25454;&#27169;&#22411;&#20013;&#30340;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#20272;&#35745;
&lt;/p&gt;
&lt;p&gt;
Deep Neural Network Estimation in Panel Data Models. (arXiv:2305.19921v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.19921
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#38754;&#26495;&#25968;&#25454;&#27169;&#22411;&#20013;&#30340;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#20272;&#35745;&#65292;&#24182;&#20351;&#29992;&#35813;&#26041;&#27861;&#39044;&#27979;&#20102;G7&#22269;&#23478;&#26032;&#20896;&#32954;&#28814;&#30149;&#20363;&#30340;&#36827;&#23637;&#24773;&#20917;&#12290;&#36890;&#36807;&#25171;&#24320;&#31070;&#32463;&#32593;&#32476;&#30340;&#8220;&#40657;&#30418;&#23376;&#8221;&#65292;&#21457;&#29616;&#20102;&#20851;&#38381;&#23398;&#26657;&#21644;&#24037;&#20316;&#22330;&#25152;&#26159;&#38480;&#21046;&#30123;&#24773;&#34067;&#24310;&#30340;&#26377;&#25928;&#25919;&#31574;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#31070;&#32463;&#32593;&#32476;&#21450;&#20854;&#22312;&#38754;&#26495;&#25968;&#25454;&#27169;&#22411;&#20013;&#30340;&#36817;&#20284;&#33021;&#21147;&#12290;&#25105;&#20204;&#22522;&#20110;Farrell&#31561;&#20154;(2021)&#30340;&#24037;&#20316;&#65292;&#23545;&#26465;&#20214;&#22343;&#20540;&#30340;&#28145;&#23618;&#21069;&#39304;&#31070;&#32463;&#32593;&#32476;&#20272;&#35745;&#25552;&#20379;&#20102;&#28176;&#36817;&#20445;&#35777;&#65292;&#24182;&#25506;&#35752;&#20102;&#25130;&#38754;&#20013;&#30340;&#28508;&#22312;&#27169;&#24335;&#12290;&#25105;&#20204;&#20351;&#29992;&#25152;&#25552;&#20986;&#30340;&#20272;&#35745;&#26041;&#27861;&#39044;&#27979;&#20102;G7&#22269;&#23478;&#22312;&#30123;&#24773;&#26399;&#38388;&#26032;&#20896;&#32954;&#28814;&#30149;&#20363;&#30340;&#36827;&#23637;&#24773;&#20917;&#65292;&#24182;&#21457;&#29616;&#30456;&#23545;&#20110;&#32447;&#24615;&#38754;&#26495;&#21644;&#38750;&#32447;&#24615;&#26102;&#38388;&#24207;&#21015;&#27169;&#22411;&#65292;&#20855;&#26377;&#26174;&#33879;&#30340;&#39044;&#27979;&#25928;&#26524;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#30001;&#25919;&#24220;&#22312;&#22269;&#23478;&#32423;&#21035;&#19978;&#23454;&#26045;&#30340;&#23553;&#38145;&#25110;&#38480;&#21046;&#25919;&#31574;&#22312;&#26032;&#20896;&#32954;&#28814;&#30149;&#20363;&#30340;&#22806;&#37096;&#26679;&#26412;&#39044;&#27979;&#20013;&#20855;&#26377;&#39044;&#27979;&#33021;&#21147;&#12290;&#25105;&#20204;&#36824;&#38416;&#36848;&#20102;&#22914;&#20309;&#20351;&#29992;&#20559;&#23548;&#25968;&#26469;&#24110;&#21161;&#25171;&#24320;&#31070;&#32463;&#32593;&#32476;&#30340;&#8220;&#40657;&#30418;&#23376;&#8221;&#65292;&#24182;&#20419;&#36827;&#21322;&#32467;&#26500;&#20998;&#26512;&#65306;&#25105;&#20204;&#21457;&#29616;&#65292;&#20851;&#38381;&#23398;&#26657;&#21644;&#24037;&#20316;&#22330;&#25152;&#26159;&#38480;&#21046;&#30123;&#24773;&#22312;G7&#22269;&#23478;&#34067;&#24310;&#30340;&#26377;&#25928;&#25919;&#31574;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this paper we study neural networks and their approximating power in panel data models. We provide asymptotic guarantees on deep feed-forward neural network estimation of the conditional mean, building on the work of Farrell et al. (2021), and explore latent patterns in the cross-section. We use the proposed estimators to forecast the progression of new COVID-19 cases across the G7 countries during the pandemic. We find significant forecasting gains over both linear panel and nonlinear time series models. Containment or lockdown policies, as instigated at the national-level by governments, are found to have out-of-sample predictive power for new COVID-19 cases. We illustrate how the use of partial derivatives can help open the "black-box" of neural networks and facilitate semi-structural analysis: school and workplace closures are found to have been effective policies at restricting the progression of the pandemic across the G7 countries. But our methods illustrate significant heter
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#20934;&#24471;&#20998;&#21305;&#37197;&#30340;SAR&#27169;&#22411;&#20272;&#35745;&#26041;&#27861;&#65292;&#21487;&#20197;&#35299;&#20915;&#29616;&#23454;&#24212;&#29992;&#20013;&#26435;&#37325;&#30697;&#38453;&#21644;&#22238;&#24402;&#21464;&#37327;&#38543;&#26426;&#24102;&#26469;&#30340;&#38382;&#39064;&#65292;&#24182;&#19988;&#35745;&#31639;&#22797;&#26434;&#24230;&#30456;&#23545;&#36739;&#20302;&#12290;</title><link>http://arxiv.org/abs/2305.19721</link><description>&lt;p&gt;
&#38543;&#26426;&#26435;&#37325;&#30697;&#38453;&#21644;&#22238;&#24402;&#21464;&#37327;&#30340;&#31354;&#38388;&#33258;&#22238;&#24402;&#27169;&#22411;&#30340;&#20934;&#24471;&#20998;&#21305;&#37197;&#20272;&#35745;
&lt;/p&gt;
&lt;p&gt;
Quasi-Score Matching Estimation for Spatial Autoregressive Model with Random Weights Matrix and Regressors. (arXiv:2305.19721v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.19721
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#20934;&#24471;&#20998;&#21305;&#37197;&#30340;SAR&#27169;&#22411;&#20272;&#35745;&#26041;&#27861;&#65292;&#21487;&#20197;&#35299;&#20915;&#29616;&#23454;&#24212;&#29992;&#20013;&#26435;&#37325;&#30697;&#38453;&#21644;&#22238;&#24402;&#21464;&#37327;&#38543;&#26426;&#24102;&#26469;&#30340;&#38382;&#39064;&#65292;&#24182;&#19988;&#35745;&#31639;&#22797;&#26434;&#24230;&#30456;&#23545;&#36739;&#20302;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38543;&#30528;&#25968;&#25454;&#25910;&#38598;&#25216;&#26415;&#30340;&#24555;&#36895;&#21457;&#23637;&#65292;&#31354;&#38388;&#33258;&#22238;&#24402;&#65288;SAR&#65289;&#27169;&#22411;&#22312;&#23454;&#38469;&#20998;&#26512;&#20013;&#36234;&#26469;&#36234;&#26222;&#36941;&#65292;&#29305;&#21035;&#26159;&#22312;&#22788;&#29702;&#22823;&#35268;&#27169;&#25968;&#25454;&#38598;&#26102;&#12290;&#28982;&#32780;&#65292;&#24120;&#29992;&#30340;&#20934;&#26368;&#22823;&#20284;&#28982;&#20272;&#35745;&#65288;QMLE&#65289;&#23545;&#20110;&#22788;&#29702;&#22823;&#22411;&#25968;&#25454;&#19981;&#20855;&#22791;&#21487;&#25193;&#23637;&#24615;&#12290;&#27492;&#22806;&#65292;&#22312;&#32463;&#20856;&#30340;&#31354;&#38388;&#35745;&#37327;&#32463;&#27982;&#23398;&#20013;&#65292;&#24314;&#31435;SAR&#27169;&#22411;&#21442;&#25968;&#20272;&#35745;&#37327;&#30340;&#28176;&#36817;&#29305;&#24615;&#26102;&#65292;&#20551;&#35774;&#26435;&#37325;&#30697;&#38453;&#21644;&#22238;&#24402;&#21464;&#37327;&#22343;&#20026;&#38750;&#38543;&#26426;&#30340;&#65292;&#36825;&#22312;&#23454;&#38469;&#24212;&#29992;&#20013;&#21487;&#33021;&#19981;&#22826;&#29616;&#23454;&#12290;&#26412;&#25991;&#21463;&#21040;&#26426;&#22120;&#23398;&#20064;&#25991;&#29486;&#30340;&#21551;&#21457;&#65292;&#25552;&#20986;&#20102;SAR&#27169;&#22411;&#30340;&#20934;&#24471;&#20998;&#21305;&#37197;&#20272;&#35745;&#26041;&#27861;&#12290;&#36825;&#31181;&#26032;&#30340;&#20272;&#35745;&#26041;&#27861;&#20173;&#28982;&#22522;&#20110;&#20284;&#28982;&#65292;&#20294;&#26174;&#33879;&#38477;&#20302;&#20102;QMLE&#30340;&#35745;&#31639;&#22797;&#26434;&#24230;&#12290;&#24314;&#31435;&#20102;&#38543;&#26426;&#26435;&#37325;&#30697;&#38453;&#21644;&#22238;&#24402;&#21464;&#37327;&#19979;&#21442;&#25968;&#20272;&#35745;&#30340;&#28176;&#36817;&#29305;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
With the rapid advancements in technology for data collection, the application of the spatial autoregressive (SAR) model has become increasingly prevalent in real-world analysis, particularly when dealing with large datasets. However, the commonly used quasi-maximum likelihood estimation (QMLE) for the SAR model is not computationally scalable to handle the data with a large size. In addition, when establishing the asymptotic properties of the parameter estimators of the SAR model, both weights matrix and regressors are assumed to be nonstochastic in classical spatial econometrics, which is perhaps not realistic in real applications. Motivated by the machine learning literature, this paper proposes quasi-score matching estimation for the SAR model. This new estimation approach is still likelihood-based, but significantly reduces the computational complexity of the QMLE. The asymptotic properties of parameter estimators under the random weights matrix and regressors are established, whi
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#31616;&#21333;&#30340;&#21327;&#26041;&#24046;&#20272;&#35745;&#22120;&#25193;&#23637;&#26041;&#27861;&#65292;&#33021;&#22815;&#39044;&#27979;&#37329;&#34701;&#25910;&#30410;&#21521;&#37327;&#30340;&#26102;&#21464;&#21327;&#26041;&#24046;&#30697;&#38453;&#65292;&#24182;&#22312;&#26032;&#39062;&#30340;&#36951;&#25022;&#24230;&#35780;&#20272;&#26041;&#27861;&#19978;&#20248;&#20110;&#27969;&#34892;&#30340;MGARCH&#26041;&#27861;&#12290;</title><link>http://arxiv.org/abs/2305.19484</link><description>&lt;p&gt;
&#19968;&#31181;&#39044;&#27979;&#37329;&#34701;&#25910;&#30410;&#21327;&#26041;&#24046;&#30697;&#38453;&#30340;&#31616;&#21333;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
A Simple Method for Predicting Covariance Matrices of Financial Returns. (arXiv:2305.19484v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.19484
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#31616;&#21333;&#30340;&#21327;&#26041;&#24046;&#20272;&#35745;&#22120;&#25193;&#23637;&#26041;&#27861;&#65292;&#33021;&#22815;&#39044;&#27979;&#37329;&#34701;&#25910;&#30410;&#21521;&#37327;&#30340;&#26102;&#21464;&#21327;&#26041;&#24046;&#30697;&#38453;&#65292;&#24182;&#22312;&#26032;&#39062;&#30340;&#36951;&#25022;&#24230;&#35780;&#20272;&#26041;&#27861;&#19978;&#20248;&#20110;&#27969;&#34892;&#30340;MGARCH&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#39044;&#27979;&#37329;&#34701;&#25910;&#30410;&#21521;&#37327;&#30340;&#26102;&#21464;&#21327;&#26041;&#24046;&#30697;&#38453;&#30340;&#38382;&#39064;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#31616;&#21333;&#30340;&#21327;&#26041;&#24046;&#20272;&#35745;&#22120;&#25193;&#23637;&#26041;&#27861;&#65292;&#19981;&#38656;&#35201;&#25110;&#24456;&#23569;&#38656;&#35201;&#35843;&#25972;&#25110;&#25311;&#21512;&#65292;&#21487;&#20197;&#35299;&#37322;&#65292;&#19988;&#33267;&#23569;&#33021;&#22815;&#20135;&#29983;&#19982;&#22788;&#29702;&#22810;&#20010;&#36164;&#20135;&#30340;&#27969;&#34892;MGARCH&#30456;&#24403;&#30340;&#32467;&#26524;&#12290;&#25105;&#20204;&#20171;&#32461;&#20102;&#19968;&#20010;&#26032;&#39062;&#30340;&#26041;&#27861;&#26469;&#35780;&#20272;&#39044;&#27979;&#22120;&#65292;&#35813;&#26041;&#27861;&#36890;&#36807;&#35780;&#20272;&#19968;&#20010;&#23395;&#24230;&#31561;&#26102;&#38388;&#27573;&#20869;&#23545;&#25968;&#20284;&#28982;&#30340;&#36951;&#25022;&#26469;&#34913;&#37327;&#12290;&#36825;&#31181;&#24230;&#37327;&#26041;&#27861;&#19981;&#20165;&#21487;&#20197;&#30475;&#20986;&#19968;&#20010;&#21327;&#26041;&#24046;&#39044;&#27979;&#22120;&#30340;&#25972;&#20307;&#34920;&#29616;&#65292;&#20063;&#33021;&#22815;&#30475;&#20986;&#23427;&#23545;&#24066;&#22330;&#26465;&#20214;&#21464;&#21270;&#30340;&#21453;&#24212;&#36895;&#24230;&#12290;&#25105;&#20204;&#30340;&#31616;&#21333;&#39044;&#27979;&#22120;&#22312;&#21518;&#24724;&#24230;&#26041;&#38754;&#20248;&#20110;MGARCH&#12290;
&lt;/p&gt;
&lt;p&gt;
We consider the well-studied problem of predicting the time-varying covariance matrix of a vector of financial returns. Popular methods range from simple predictors like rolling window or exponentially weighted moving average (EWMA) to more sophisticated predictors such as generalized autoregressive conditional heteroscedastic (GARCH) type methods. Building on a specific covariance estimator suggested by Engle in 2002, we propose a relatively simple extension that requires little or no tuning or fitting, is interpretable, and produces results at least as good as MGARCH, a popular extension of GARCH that handles multiple assets. To evaluate predictors we introduce a novel approach, evaluating the regret of the log-likelihood over a time period such as a quarter. This metric allows us to see not only how well a covariance predictor does over all, but also how quickly it reacts to changes in market conditions. Our simple predictor outperforms MGARCH in terms of regret. We also test covari
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#20171;&#32461;&#20102;&#22522;&#20110;&#22343;&#34913;&#27010;&#24565;&#30340;&#20844;&#24179;&#20998;&#37197;&#31639;&#27861;A-CEEI&#65292;&#24320;&#21457;&#20102;&#19968;&#31181;&#26032;&#30340;&#21551;&#21457;&#24335;&#31639;&#27861;&#65292;&#20351;&#25105;&#20204;&#31532;&#19968;&#27425;&#33021;&#22815;&#23545;&#30495;&#23454;&#19990;&#30028;&#30340;&#36755;&#20837;&#36827;&#34892;&#23454;&#39564;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#21363;&#20351;&#22312;&#31526;&#21512;EF-TB&#21644;SP-L&#23646;&#24615;&#30340;&#29616;&#23454;&#23454;&#26045;&#20013;&#65292;&#20195;&#29702;&#20063;&#21487;&#33021;&#26377;&#24778;&#20154;&#32780;&#21512;&#29702;&#30340;&#19981;&#30495;&#23454;&#25253;&#21578;&#20559;&#31163;&#12290;</title><link>http://arxiv.org/abs/2305.11406</link><description>&lt;p&gt;
&#22522;&#20110;&#22343;&#34913;&#27010;&#24565;&#30340;&#20844;&#24179;&#20998;&#37197;&#30340;&#23454;&#29992;&#31639;&#27861;&#21644;&#23454;&#39564;&#35777;&#26126;&#65288;A-CEEI&#65289;
&lt;/p&gt;
&lt;p&gt;
Practical algorithms and experimentally validated incentives for equilibrium-based fair division (A-CEEI). (arXiv:2305.11406v1 [cs.GT])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.11406
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#22522;&#20110;&#22343;&#34913;&#27010;&#24565;&#30340;&#20844;&#24179;&#20998;&#37197;&#31639;&#27861;A-CEEI&#65292;&#24320;&#21457;&#20102;&#19968;&#31181;&#26032;&#30340;&#21551;&#21457;&#24335;&#31639;&#27861;&#65292;&#20351;&#25105;&#20204;&#31532;&#19968;&#27425;&#33021;&#22815;&#23545;&#30495;&#23454;&#19990;&#30028;&#30340;&#36755;&#20837;&#36827;&#34892;&#23454;&#39564;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#21363;&#20351;&#22312;&#31526;&#21512;EF-TB&#21644;SP-L&#23646;&#24615;&#30340;&#29616;&#23454;&#23454;&#26045;&#20013;&#65292;&#20195;&#29702;&#20063;&#21487;&#33021;&#26377;&#24778;&#20154;&#32780;&#21512;&#29702;&#30340;&#19981;&#30495;&#23454;&#25253;&#21578;&#20559;&#31163;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#8220;&#31561;&#25910;&#20837;&#36817;&#20284;&#31454;&#20105;&#22343;&#34913;&#8221;&#65288;A-CEEI&#65289;&#26159;&#19968;&#31181;&#22522;&#20110;&#22343;&#34913;&#27010;&#24565;&#29992;&#20110;&#23558;&#31163;&#25955;&#29289;&#21697;&#20844;&#24179;&#20998;&#37197;&#32473;&#24102;&#26377;&#32452;&#21512;&#38656;&#27714;&#30340;&#20195;&#29702;&#30340;&#35299;&#20915;&#26041;&#26696;&#27010;&#24565;&#12290;&#22312;&#29702;&#35770;&#19978;&#24050;&#32463;&#30693;&#36947;&#65292;&#22312;&#28176;&#36817;&#22823;&#24066;&#22330;&#19978;&#65292;&#23545;&#20110;&#28608;&#21169;&#25514;&#26045;&#65292;A-CEEI&#26426;&#21046;&#26159;&#8220;&#26080;&#23241;&#22930;&#21487;&#20294;&#39035;&#30772;&#22351;&#24179;&#25163;&#8221;&#30340;&#65288;EF-TB&#65289;&#65292;&#36825;&#24847;&#21619;&#30528;&#23427;&#26159;&#8220;&#22823;&#33539;&#22260;&#19978;&#30340;&#31574;&#30053;&#35777;&#26126;&#8221;&#65288;SP-L&#65289;&#12290;&#20174;&#35745;&#31639;&#30340;&#35282;&#24230;&#26469;&#30475;&#65292;&#35745;&#31639;&#22343;&#34913;&#35299;&#26159;&#19968;&#31181;&#35745;&#31639;&#19978;&#19981;&#21487;&#34892;&#30340;&#38382;&#39064;&#65288;&#22312;&#26368;&#22351;&#30340;&#24773;&#20917;&#19979;&#65292;&#20551;&#35774; $\textsf{PPAD} \neq \textsf {FP}$&#65289;&#12290;&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#31181;&#26032;&#30340;&#21551;&#21457;&#24335;&#31639;&#27861;&#65292;&#20854;&#24615;&#33021;&#27604;&#20043;&#21069;&#30340;&#26368;&#20808;&#36827;&#31639;&#27861;&#39640;&#20986;&#22810;&#20010;&#25968;&#37327;&#32423;&#12290;&#36825;&#31181;&#26356;&#24555;&#30340;&#26032;&#31639;&#27861;&#20351;&#25105;&#20204;&#31532;&#19968;&#27425;&#33021;&#22815;&#23545;&#30495;&#23454;&#19990;&#30028;&#30340;&#36755;&#20837;&#36827;&#34892;&#23454;&#39564;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#21363;&#20351;&#22312;&#31526;&#21512;EF-TB&#21644;SP-L&#23646;&#24615;&#30340;&#29616;&#23454;&#23454;&#26045;&#20013;&#65292;&#20195;&#29702;&#20063;&#21487;&#33021;&#26377;&#24778;&#20154;&#32780;&#21512;&#29702;&#30340;&#19981;&#30495;&#23454;&#25253;&#21578;&#20559;&#31163;&#12290;
&lt;/p&gt;
&lt;p&gt;
Approximate Competitive Equilibrium from Equal Incomes (A-CEEI) is an equilibrium-based solution concept for fair division of discrete items to agents with combinatorial demands. In theory, it is known that in asymptotically large markets:  1. For incentives, the A-CEEI mechanism is Envy-Free-but-for-Tie-Breaking (EF-TB), which implies that it is Strategyproof-in-the-Large (SP-L).  2. From a computational perspective, computing the equilibrium solution is unfortunately a computationally intractable problem (in the worst-case, assuming $\textsf{PPAD}\ne \textsf{FP}$).  We develop a new heuristic algorithm that outperforms the previous state-of-the-art by multiple orders of magnitude. This new, faster algorithm lets us perform experiments on real-world inputs for the first time. We discover that with real-world preferences, even in a realistic implementation that satisfies the EF-TB and SP-L properties, agents may have surprisingly simple and plausible deviations from truthful reporting 
&lt;/p&gt;</description></item></channel></rss>