<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#26412;&#25991;&#37325;&#26032;&#23457;&#35270;&#20102;&#20351;&#29992;&#21453;&#24212;&#26102;&#38388;&#26469;&#25512;&#26029;&#38382;&#39064;&#22797;&#26434;&#24615;&#30340;&#26377;&#25928;&#24615;&#65292;&#25552;&#20986;&#20102;&#19968;&#20010;&#26032;&#26041;&#27861;&#26469;&#27491;&#30830;&#25512;&#26029;&#38382;&#39064;&#30340;&#22797;&#26434;&#24615;&#65292;&#24378;&#35843;&#20102;&#22312;&#31616;&#21333;&#21644;&#22797;&#26434;&#38382;&#39064;&#20013;&#20915;&#31574;&#36895;&#24230;&#37117;&#24456;&#24555;&#30340;&#29305;&#28857;&#65292;&#24182;&#25506;&#35752;&#20102;&#21453;&#24212;&#26102;&#38388;&#19982;&#33021;&#21147;&#20043;&#38388;&#30340;&#38750;&#21333;&#35843;&#20851;&#31995;&#12290;</title><link>https://arxiv.org/abs/2403.11240</link><description>&lt;p&gt;
&#36895;&#24230;&#12289;&#20934;&#30830;&#24615;&#21644;&#22797;&#26434;&#24615;
&lt;/p&gt;
&lt;p&gt;
Speed, Accuracy, and Complexity
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.11240
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#37325;&#26032;&#23457;&#35270;&#20102;&#20351;&#29992;&#21453;&#24212;&#26102;&#38388;&#26469;&#25512;&#26029;&#38382;&#39064;&#22797;&#26434;&#24615;&#30340;&#26377;&#25928;&#24615;&#65292;&#25552;&#20986;&#20102;&#19968;&#20010;&#26032;&#26041;&#27861;&#26469;&#27491;&#30830;&#25512;&#26029;&#38382;&#39064;&#30340;&#22797;&#26434;&#24615;&#65292;&#24378;&#35843;&#20102;&#22312;&#31616;&#21333;&#21644;&#22797;&#26434;&#38382;&#39064;&#20013;&#20915;&#31574;&#36895;&#24230;&#37117;&#24456;&#24555;&#30340;&#29305;&#28857;&#65292;&#24182;&#25506;&#35752;&#20102;&#21453;&#24212;&#26102;&#38388;&#19982;&#33021;&#21147;&#20043;&#38388;&#30340;&#38750;&#21333;&#35843;&#20851;&#31995;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#37325;&#26032;&#23457;&#35270;&#20102;&#20351;&#29992;&#21453;&#24212;&#26102;&#38388;&#26469;&#25512;&#26029;&#38382;&#39064;&#22797;&#26434;&#24615;&#30340;&#26377;&#25928;&#24615;&#12290;&#37325;&#26032;&#23457;&#35270;&#20102;&#19968;&#20010;&#32463;&#20856;&#30340;Wald&#27169;&#22411;&#65292;&#23558;&#20449;&#22122;&#27604;&#20316;&#20026;&#38382;&#39064;&#22797;&#26434;&#24615;&#30340;&#24230;&#37327;&#12290;&#34429;&#28982;&#22312;&#38382;&#39064;&#22797;&#26434;&#24615;&#19978;&#65292;&#36873;&#25321;&#36136;&#37327;&#26159;&#21333;&#35843;&#30340;&#65292;&#20294;&#26399;&#26395;&#30340;&#20572;&#27490;&#26102;&#38388;&#26159;&#20498;U&#24418;&#30340;&#12290;&#20107;&#23454;&#19978;&#65292;&#20915;&#31574;&#22312;&#38750;&#24120;&#31616;&#21333;&#21644;&#38750;&#24120;&#22797;&#26434;&#30340;&#38382;&#39064;&#20013;&#37117;&#24456;&#24555;&#65306;&#22312;&#31616;&#21333;&#38382;&#39064;&#20013;&#24456;&#24555;&#23601;&#33021;&#29702;&#35299;&#21738;&#20010;&#36873;&#25321;&#26159;&#26368;&#22909;&#30340;&#65292;&#32780;&#22312;&#22797;&#26434;&#38382;&#39064;&#20013;&#23558;&#20250;&#25104;&#26412;&#36807;&#39640;--&#36825;&#19968;&#27934;&#23519;&#21147;&#20063;&#36866;&#29992;&#20110;&#19968;&#33324;&#30340;&#26114;&#36149;&#20449;&#24687;&#33719;&#21462;&#27169;&#22411;&#12290;&#36825;&#31181;&#38750;&#21333;&#35843;&#24615;&#20063;&#26500;&#25104;&#20102;&#21453;&#24212;&#26102;&#38388;&#19982;&#33021;&#21147;&#20043;&#38388;&#27169;&#31946;&#20851;&#31995;&#30340;&#22522;&#30784;&#65292;&#21363;&#26356;&#39640;&#30340;&#33021;&#21147;&#24847;&#21619;&#30528;&#22312;&#38750;&#24120;&#22797;&#26434;&#30340;&#38382;&#39064;&#20013;&#20915;&#31574;&#26356;&#24930;&#65292;&#20294;&#22312;&#31616;&#21333;&#38382;&#39064;&#20013;&#20915;&#31574;&#26356;&#24555;&#12290;&#26368;&#21518;&#65292;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#26041;&#27861;&#65292;&#26681;&#25454;&#36873;&#25321;&#23545;&#28608;&#21169;&#21464;&#21270;&#30340;&#21453;&#24212;&#26356;&#22810;&#26469;&#27491;&#30830;&#25512;&#26029;&#38382;&#39064;&#30340;&#22797;&#26434;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.11240v1 Announce Type: new  Abstract: This paper re-examines the validity of using response time to infer problem complexity. It revisits a canonical Wald model of optimal stopping, taking signal-to-noise ratio as a measure of problem complexity. While choice quality is monotone in problem complexity, expected stopping time is inverse $U$-shaped. Indeed decisions are fast in both very simple and very complex problems: in simple problems it is quick to understand which alternative is best, while in complex problems it would be too costly -- an insight which extends to general costly information acquisition models. This non-monotonicity also underlies an ambiguous relationship between response time and ability, whereby higher ability entails slower decisions in very complex problems, but faster decisions in simple problems. Finally, this paper proposes a new method to correctly infer problem complexity based on the finding that choices react more to changes in incentives in mo
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLMs&#65289;&#65292;&#29305;&#21035;&#26159;OpenAI&#30340;GPT4&#21644;LLaMA2&#30340;&#25237;&#31080;&#34892;&#20026;&#65292;&#24182;&#25581;&#31034;&#20102;LLMs&#19982;&#20154;&#31867;&#22312;&#20915;&#31574;&#21644;&#20559;&#35265;&#26041;&#38754;&#30340;&#24046;&#24322;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#22312;&#25237;&#31080;&#36741;&#21161;&#20013;&#20351;&#29992;LLMs&#21487;&#33021;&#20250;&#23548;&#33268;&#26356;&#21516;&#36136;&#21270;&#30340;&#38598;&#20307;&#32467;&#26524;&#65292;&#24378;&#35843;&#20102;&#35880;&#24910;&#23558;LLMs&#25972;&#21512;&#21040;&#27665;&#20027;&#36807;&#31243;&#20013;&#30340;&#24517;&#35201;&#24615;&#12290;</title><link>https://arxiv.org/abs/2402.01766</link><description>&lt;p&gt;
LLM&#25237;&#31080;&#65306;&#20154;&#31867;&#36873;&#25321;&#21644;AI&#38598;&#20307;&#20915;&#31574;
&lt;/p&gt;
&lt;p&gt;
LLM Voting: Human Choices and AI Collective Decision Making
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.01766
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLMs&#65289;&#65292;&#29305;&#21035;&#26159;OpenAI&#30340;GPT4&#21644;LLaMA2&#30340;&#25237;&#31080;&#34892;&#20026;&#65292;&#24182;&#25581;&#31034;&#20102;LLMs&#19982;&#20154;&#31867;&#22312;&#20915;&#31574;&#21644;&#20559;&#35265;&#26041;&#38754;&#30340;&#24046;&#24322;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#22312;&#25237;&#31080;&#36741;&#21161;&#20013;&#20351;&#29992;LLMs&#21487;&#33021;&#20250;&#23548;&#33268;&#26356;&#21516;&#36136;&#21270;&#30340;&#38598;&#20307;&#32467;&#26524;&#65292;&#24378;&#35843;&#20102;&#35880;&#24910;&#23558;LLMs&#25972;&#21512;&#21040;&#27665;&#20027;&#36807;&#31243;&#20013;&#30340;&#24517;&#35201;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLMs&#65289;&#65292;&#29305;&#21035;&#26159;OpenAI&#30340;GPT4&#21644;LLaMA2&#30340;&#25237;&#31080;&#34892;&#20026;&#65292;&#24182;&#19982;&#20154;&#31867;&#25237;&#31080;&#27169;&#24335;&#36827;&#34892;&#20102;&#23545;&#27604;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#21253;&#25324;&#36827;&#34892;&#20154;&#31867;&#25237;&#31080;&#23454;&#39564;&#20197;&#24314;&#31435;&#20154;&#31867;&#20559;&#22909;&#30340;&#22522;&#20934;&#65292;&#24182;&#19982;LLM&#20195;&#29702;&#36827;&#34892;&#24179;&#34892;&#23454;&#39564;&#12290;&#30740;&#31350;&#32858;&#28966;&#20110;&#38598;&#20307;&#32467;&#26524;&#21644;&#20010;&#20307;&#20559;&#22909;&#65292;&#25581;&#31034;&#20102;&#20154;&#31867;&#21644;LLMs&#20043;&#38388;&#22312;&#20915;&#31574;&#21644;&#22266;&#26377;&#20559;&#35265;&#26041;&#38754;&#30340;&#24046;&#24322;&#12290;&#25105;&#20204;&#35266;&#23519;&#21040;LLMs&#22312;&#20559;&#22909;&#22810;&#26679;&#24615;&#21644;&#19968;&#33268;&#24615;&#20043;&#38388;&#23384;&#22312;&#26435;&#34913;&#65292;&#30456;&#27604;&#20154;&#31867;&#36873;&#27665;&#30340;&#22810;&#26679;&#20559;&#22909;&#65292;LLMs&#26377;&#26356;&#36235;&#21521;&#20110;&#19968;&#33268;&#36873;&#25321;&#30340;&#20542;&#21521;&#12290;&#36825;&#19968;&#21457;&#29616;&#34920;&#26126;&#65292;&#22312;&#25237;&#31080;&#36741;&#21161;&#20013;&#20351;&#29992;LLMs&#21487;&#33021;&#20250;&#23548;&#33268;&#26356;&#21516;&#36136;&#21270;&#30340;&#38598;&#20307;&#32467;&#26524;&#65292;&#24378;&#35843;&#20102;&#35880;&#24910;&#23558;LLMs&#25972;&#21512;&#21040;&#27665;&#20027;&#36807;&#31243;&#20013;&#30340;&#24517;&#35201;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper investigates the voting behaviors of Large Language Models (LLMs), particularly OpenAI's GPT4 and LLaMA2, and their alignment with human voting patterns. Our approach included a human voting experiment to establish a baseline for human preferences and a parallel experiment with LLM agents. The study focused on both collective outcomes and individual preferences, revealing differences in decision-making and inherent biases between humans and LLMs. We observed a trade-off between preference diversity and alignment in LLMs, with a tendency towards more uniform choices as compared to the diverse preferences of human voters. This finding indicates that LLMs could lead to more homogenized collective outcomes when used in voting assistance, underscoring the need for cautious integration of LLMs into democratic processes.
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#22238;&#24402;&#30340;&#26041;&#27861;&#65292;&#29992;&#20110;&#20272;&#35745;&#20010;&#20307;&#23545;&#23545;&#31435;&#24773;&#20917;&#30340;&#21453;&#24212;&#12290;&#36890;&#36807;&#24212;&#29992;&#35813;&#26041;&#27861;&#20110;&#24847;&#22823;&#21033;&#30340;&#35843;&#26597;&#25968;&#25454;&#65292;&#30740;&#31350;&#21457;&#29616;&#32771;&#34385;&#20010;&#20307;&#30340;&#20449;&#24565;&#23545;&#31246;&#25910;&#25919;&#31574;&#23545;&#28040;&#36153;&#20915;&#31574;&#30340;&#24433;&#21709;&#24456;&#37325;&#35201;&#12290;</title><link>http://arxiv.org/abs/2310.09105</link><description>&lt;p&gt;
&#20272;&#35745;&#26126;&#22825;&#37325;&#35201;&#26102;&#30340;&#20010;&#20307;&#21453;&#24212;
&lt;/p&gt;
&lt;p&gt;
Estimating Individual Responses when Tomorrow Matters. (arXiv:2310.09105v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.09105
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#22238;&#24402;&#30340;&#26041;&#27861;&#65292;&#29992;&#20110;&#20272;&#35745;&#20010;&#20307;&#23545;&#23545;&#31435;&#24773;&#20917;&#30340;&#21453;&#24212;&#12290;&#36890;&#36807;&#24212;&#29992;&#35813;&#26041;&#27861;&#20110;&#24847;&#22823;&#21033;&#30340;&#35843;&#26597;&#25968;&#25454;&#65292;&#30740;&#31350;&#21457;&#29616;&#32771;&#34385;&#20010;&#20307;&#30340;&#20449;&#24565;&#23545;&#31246;&#25910;&#25919;&#31574;&#23545;&#28040;&#36153;&#20915;&#31574;&#30340;&#24433;&#21709;&#24456;&#37325;&#35201;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#22238;&#24402;&#30340;&#26041;&#27861;&#65292;&#29992;&#20110;&#20272;&#35745;&#20010;&#20307;&#30340;&#26399;&#26395;&#22914;&#20309;&#24433;&#21709;&#20182;&#20204;&#23545;&#23545;&#31435;&#24773;&#20917;&#30340;&#21453;&#24212;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#22522;&#20110;&#22238;&#24402;&#20272;&#35745;&#30340;&#24179;&#22343;&#20559;&#25928;&#24212;&#24674;&#22797;&#32467;&#26500;&#25928;&#24212;&#30340;&#26465;&#20214;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#20381;&#36182;&#20110;&#20027;&#35266;&#20449;&#24565;&#25968;&#25454;&#30340;&#23454;&#29992;&#30340;&#19977;&#27493;&#20272;&#35745;&#26041;&#27861;&#12290;&#25105;&#20204;&#22312;&#19968;&#20010;&#28040;&#36153;&#21644;&#20648;&#33988;&#27169;&#22411;&#20013;&#35828;&#26126;&#20102;&#25105;&#20204;&#30340;&#26041;&#27861;&#65292;&#37325;&#28857;&#20851;&#27880;&#19981;&#20165;&#25913;&#21464;&#24403;&#21069;&#25910;&#20837;&#32780;&#19988;&#24433;&#21709;&#23545;&#26410;&#26469;&#25910;&#20837;&#30340;&#20449;&#24565;&#30340;&#25152;&#24471;&#31246;&#30340;&#24433;&#21709;&#12290;&#36890;&#36807;&#23558;&#25105;&#20204;&#30340;&#26041;&#27861;&#24212;&#29992;&#20110;&#24847;&#22823;&#21033;&#30340;&#35843;&#26597;&#25968;&#25454;&#65292;&#25105;&#20204;&#21457;&#29616;&#32771;&#34385;&#20010;&#20307;&#30340;&#20449;&#24565;&#23545;&#35780;&#20272;&#31246;&#25910;&#25919;&#31574;&#23545;&#28040;&#36153;&#20915;&#31574;&#30340;&#24433;&#21709;&#24456;&#37325;&#35201;&#12290;
&lt;/p&gt;
&lt;p&gt;
We propose a regression-based approach to estimate how individuals' expectations influence their responses to a counterfactual change. We provide conditions under which average partial effects based on regression estimates recover structural effects. We propose a practical three-step estimation method that relies on subjective beliefs data. We illustrate our approach in a model of consumption and saving, focusing on the impact of an income tax that not only changes current income but also affects beliefs about future income. By applying our approach to survey data from Italy, we find that considering individuals' beliefs matter for evaluating the impact of tax policies on consumption decisions.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#22411;&#30340;&#21512;&#25104;&#23545;&#29031;&#26041;&#27861;&#65292;&#36890;&#36807;&#23494;&#24230;&#21305;&#37197;&#26469;&#35299;&#20915;&#29616;&#26377;SCMs&#20013;&#30340;&#38544;&#24335;&#20869;&#29983;&#24615;&#38382;&#39064;&#12290;&#35813;&#26041;&#27861;&#36890;&#36807;&#23558;&#32463;&#36807;&#22788;&#29702;&#21333;&#20803;&#30340;&#32467;&#26524;&#23494;&#24230;&#19982;&#26410;&#22788;&#29702;&#21333;&#20803;&#30340;&#23494;&#24230;&#36827;&#34892;&#21152;&#26435;&#24179;&#22343;&#26469;&#20272;&#35745;SC&#26435;&#37325;&#12290;</title><link>http://arxiv.org/abs/2307.11127</link><description>&lt;p&gt;
&#36890;&#36807;&#23494;&#24230;&#21305;&#37197;&#23454;&#29616;&#30340;&#21512;&#25104;&#23545;&#29031;&#26041;&#27861;&#19979;&#30340;&#38544;&#24335;&#20869;&#29983;&#24615;&#38382;&#39064;
&lt;/p&gt;
&lt;p&gt;
Synthetic Control Methods by Density Matching under Implicit Endogeneitiy. (arXiv:2307.11127v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.11127
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#22411;&#30340;&#21512;&#25104;&#23545;&#29031;&#26041;&#27861;&#65292;&#36890;&#36807;&#23494;&#24230;&#21305;&#37197;&#26469;&#35299;&#20915;&#29616;&#26377;SCMs&#20013;&#30340;&#38544;&#24335;&#20869;&#29983;&#24615;&#38382;&#39064;&#12290;&#35813;&#26041;&#27861;&#36890;&#36807;&#23558;&#32463;&#36807;&#22788;&#29702;&#21333;&#20803;&#30340;&#32467;&#26524;&#23494;&#24230;&#19982;&#26410;&#22788;&#29702;&#21333;&#20803;&#30340;&#23494;&#24230;&#36827;&#34892;&#21152;&#26435;&#24179;&#22343;&#26469;&#20272;&#35745;SC&#26435;&#37325;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21512;&#25104;&#23545;&#29031;&#26041;&#27861;&#65288;SCMs&#65289;&#24050;&#25104;&#20026;&#27604;&#36739;&#26696;&#20363;&#30740;&#31350;&#20013;&#22240;&#26524;&#25512;&#26029;&#30340;&#37325;&#35201;&#24037;&#20855;&#12290;SCMs&#30340;&#22522;&#26412;&#24605;&#24819;&#26159;&#36890;&#36807;&#20351;&#29992;&#26469;&#33258;&#26410;&#22788;&#29702;&#21333;&#20803;&#30340;&#35266;&#27979;&#32467;&#26524;&#30340;&#21152;&#26435;&#21644;&#26469;&#20272;&#35745;&#32463;&#36807;&#22788;&#29702;&#21333;&#20803;&#30340;&#21453;&#20107;&#23454;&#32467;&#26524;&#12290;&#21512;&#25104;&#23545;&#29031;&#65288;SC&#65289;&#30340;&#20934;&#30830;&#24615;&#23545;&#20110;&#20272;&#35745;&#22240;&#26524;&#25928;&#24212;&#33267;&#20851;&#37325;&#35201;&#65292;&#22240;&#27492;&#65292;SC&#26435;&#37325;&#30340;&#20272;&#35745;&#25104;&#20026;&#20102;&#30740;&#31350;&#30340;&#28966;&#28857;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#39318;&#20808;&#25351;&#20986;&#29616;&#26377;&#30340;SCMs&#23384;&#22312;&#19968;&#20010;&#38544;&#24335;&#20869;&#29983;&#24615;&#38382;&#39064;&#65292;&#21363;&#26410;&#22788;&#29702;&#21333;&#20803;&#30340;&#32467;&#26524;&#19982;&#21453;&#20107;&#23454;&#32467;&#26524;&#27169;&#22411;&#20013;&#30340;&#35823;&#24046;&#39033;&#20043;&#38388;&#30340;&#30456;&#20851;&#24615;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#36825;&#20010;&#38382;&#39064;&#20250;&#23545;&#22240;&#26524;&#25928;&#24212;&#20272;&#35745;&#22120;&#20135;&#29983;&#20559;&#24046;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#23494;&#24230;&#21305;&#37197;&#30340;&#26032;&#22411;SCM&#65292;&#20551;&#35774;&#32463;&#36807;&#22788;&#29702;&#21333;&#20803;&#30340;&#32467;&#26524;&#23494;&#24230;&#21487;&#20197;&#29992;&#26410;&#22788;&#29702;&#21333;&#20803;&#30340;&#23494;&#24230;&#30340;&#21152;&#26435;&#24179;&#22343;&#26469;&#36817;&#20284;&#65288;&#21363;&#28151;&#21512;&#27169;&#22411;&#65289;&#12290;&#22522;&#20110;&#36825;&#19968;&#20551;&#35774;&#65292;&#25105;&#20204;&#36890;&#36807;&#21305;&#37197;&#26469;&#20272;&#35745;SC&#26435;&#37325;&#12290;
&lt;/p&gt;
&lt;p&gt;
Synthetic control methods (SCMs) have become a crucial tool for causal inference in comparative case studies. The fundamental idea of SCMs is to estimate counterfactual outcomes for a treated unit by using a weighted sum of observed outcomes from untreated units. The accuracy of the synthetic control (SC) is critical for estimating the causal effect, and hence, the estimation of SC weights has been the focus of much research. In this paper, we first point out that existing SCMs suffer from an implicit endogeneity problem, which is the correlation between the outcomes of untreated units and the error term in the model of a counterfactual outcome. We show that this problem yields a bias in the causal effect estimator. We then propose a novel SCM based on density matching, assuming that the density of outcomes of the treated unit can be approximated by a weighted average of the densities of untreated units (i.e., a mixture model). Based on this assumption, we estimate SC weights by matchi
&lt;/p&gt;</description></item></channel></rss>