<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#32452;&#21512;&#22810;&#36718;&#36882;&#22686;&#25293;&#21334;&#26159;&#19968;&#31181;&#26032;&#30340;&#25293;&#21334;&#26684;&#24335;&#65292;&#22312;&#27431;&#27954;&#39057;&#35889;&#25293;&#21334;&#20013;&#24050;&#32463;&#20351;&#29992;&#12290;&#25105;&#20204;&#30740;&#31350;&#20102;&#25293;&#21334;&#32773;&#30340;&#30495;&#23454;&#20986;&#20215;&#12289;&#38656;&#27714;&#25193;&#22823;&#21644;&#38656;&#27714;&#20943;&#23569;&#30340;&#21518;&#26399;&#22343;&#34913;&#65292;&#21457;&#29616;&#30495;&#23454;&#21578;&#30693;&#30340;&#22343;&#34913;&#23545;&#25293;&#21334;&#32773;&#19978;&#38480;&#30340;&#23545;&#31216;&#24615;&#35201;&#27714;&#36739;&#39640;&#65292;&#32780;CMRA&#23481;&#26131;&#21463;&#21040;&#26080;&#39118;&#38505;&#21246;&#32467;&#30340;&#24433;&#21709;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26367;&#20195;&#30340;&#27963;&#21160;&#35268;&#21017;&#26469;&#38450;&#27490;&#21246;&#32467;&#12290;&#25105;&#20204;&#36824;&#35752;&#35770;&#20102;&#35813;&#29702;&#35770;&#19982;&#20025;&#40614;&#39057;&#35889;&#25293;&#21334;&#32467;&#26524;&#30340;&#19968;&#33268;&#24615;&#65292;&#24182;&#25552;&#20986;&#21033;&#29992;&#31454;&#26631;&#25968;&#25454;&#36827;&#34892;&#27979;&#35797;&#30340;&#26041;&#27861;&#12290;</title><link>https://arxiv.org/abs/2203.11783</link><description>&lt;p&gt;
&#32452;&#21512;&#22810;&#36718;&#36882;&#22686;&#25293;&#21334;
&lt;/p&gt;
&lt;p&gt;
The Combinatorial Multi-Round Ascending Auction
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2203.11783
&lt;/p&gt;
&lt;p&gt;
&#32452;&#21512;&#22810;&#36718;&#36882;&#22686;&#25293;&#21334;&#26159;&#19968;&#31181;&#26032;&#30340;&#25293;&#21334;&#26684;&#24335;&#65292;&#22312;&#27431;&#27954;&#39057;&#35889;&#25293;&#21334;&#20013;&#24050;&#32463;&#20351;&#29992;&#12290;&#25105;&#20204;&#30740;&#31350;&#20102;&#25293;&#21334;&#32773;&#30340;&#30495;&#23454;&#20986;&#20215;&#12289;&#38656;&#27714;&#25193;&#22823;&#21644;&#38656;&#27714;&#20943;&#23569;&#30340;&#21518;&#26399;&#22343;&#34913;&#65292;&#21457;&#29616;&#30495;&#23454;&#21578;&#30693;&#30340;&#22343;&#34913;&#23545;&#25293;&#21334;&#32773;&#19978;&#38480;&#30340;&#23545;&#31216;&#24615;&#35201;&#27714;&#36739;&#39640;&#65292;&#32780;CMRA&#23481;&#26131;&#21463;&#21040;&#26080;&#39118;&#38505;&#21246;&#32467;&#30340;&#24433;&#21709;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26367;&#20195;&#30340;&#27963;&#21160;&#35268;&#21017;&#26469;&#38450;&#27490;&#21246;&#32467;&#12290;&#25105;&#20204;&#36824;&#35752;&#35770;&#20102;&#35813;&#29702;&#35770;&#19982;&#20025;&#40614;&#39057;&#35889;&#25293;&#21334;&#32467;&#26524;&#30340;&#19968;&#33268;&#24615;&#65292;&#24182;&#25552;&#20986;&#21033;&#29992;&#31454;&#26631;&#25968;&#25454;&#36827;&#34892;&#27979;&#35797;&#30340;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#32452;&#21512;&#22810;&#36718;&#36882;&#22686;&#25293;&#21334;&#65288;Combinatorial Multi-Round Ascending Auction&#65292;CMRA&#65289;&#26159;&#19968;&#31181;&#26032;&#30340;&#25293;&#21334;&#26684;&#24335;&#65292;&#24050;&#32463;&#22312;&#20960;&#27425;&#26368;&#36817;&#30340;&#27431;&#27954;&#39057;&#35889;&#25293;&#21334;&#20013;&#20351;&#29992;&#12290;&#25105;&#20204;&#23545;&#25293;&#21334;&#29305;&#23450;&#30340;&#30495;&#23454;&#20986;&#20215;&#12289;&#38656;&#27714;&#25193;&#22823;&#21644;&#38656;&#27714;&#20943;&#23569;&#30340;&#21518;&#26399;&#22343;&#34913;&#36827;&#34892;&#20102;&#34920;&#24449;&#65292;&#23545;&#25293;&#21334;&#32773;&#30340;&#36793;&#38469;&#20215;&#20540;&#20026;&#36882;&#20943;&#25110;&#38750;&#36882;&#20943;&#30340;&#24773;&#20917;&#36827;&#34892;&#20102;&#30740;&#31350;&#12290;&#29305;&#21035;&#22320;&#65292;&#25105;&#20204;&#21457;&#29616;&#30495;&#23454;&#21578;&#30693;&#30340;&#22343;&#34913;&#23545;&#25293;&#21334;&#32773;&#30340;&#19978;&#38480;&#23384;&#22312;&#24494;&#23567;&#30340;&#19981;&#23545;&#31216;&#24615;&#26159;&#33030;&#24369;&#30340;&#12290;&#21478;&#19968;&#26041;&#38754;&#65292;&#22914;&#26524;&#25293;&#21334;&#32773;&#36275;&#22815;&#23545;&#31216;&#65292;CMRA&#23481;&#26131;&#21463;&#21040;&#26080;&#39118;&#38505;&#21246;&#32467;&#30340;&#24433;&#21709;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26367;&#20195;&#30340;&#27963;&#21160;&#35268;&#21017;&#65292;&#20197;&#38450;&#27490;&#36825;&#31181;&#21246;&#32467;&#31574;&#30053;&#65292;&#20294;&#20445;&#25345;&#20854;&#20182;&#22343;&#34913;&#19981;&#21464;&#12290;&#25105;&#20204;&#35752;&#35770;&#20102;&#25105;&#20204;&#30340;&#29702;&#35770;&#22312;&#20025;&#40614;&#39057;&#35889;&#25293;&#21334;&#20013;&#30340;&#19968;&#33268;&#24615;&#31243;&#24230;&#65292;&#20197;&#21450;&#22914;&#20309;&#21033;&#29992;&#31454;&#26631;&#25968;&#25454;&#26469;&#27979;&#35797;&#25105;&#20204;&#30340;&#39044;&#27979;&#12290;
&lt;/p&gt;
&lt;p&gt;
The Combinatorial Multi-Round Ascending Auction (CMRA) is a new auction format that has already been used in several recent European spectrum auctions. We characterize ex-post equilibria that feature auction-specific forms of truthful bidding, demand expansion, and demand reduction for settings where bidders have either decreasing or non-decreasing marginal values. In particular, we show that the truthtelling equilibrium is fragile to small asymmetries in the bidders' caps. On the other hand, if bidders are sufficiently symmetric, the CMRA is vulnerable to risk-free collusion. We propose an alternative activity rule that prevents such collusive strategies but keeps the other equilibria intact. We discuss to what extent our theory is consistent with outcomes in Danish spectrum auctions and how our predictions can be tested using bidding data.
&lt;/p&gt;</description></item></channel></rss>