<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#21452;&#37325;&#31283;&#20581;&#25512;&#26029;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#21487;&#29992;&#20110;&#26500;&#24314;&#22312;&#24046;&#20998;&#20013;&#30340;&#32452;&#26102;&#38388;&#26465;&#20214;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#20989;&#25968;&#30340;&#19968;&#33268;&#32622;&#20449;&#24102;&#12290;</title><link>http://arxiv.org/abs/2305.02185</link><description>&lt;p&gt;
&#21452;&#37325;&#31283;&#20581;&#19968;&#33268;&#32622;&#20449;&#24102;&#22312;&#24046;&#20998;&#20013;&#30340;&#32452;&#26102;&#38388;&#26465;&#20214;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#20013;&#30340;&#24212;&#29992;
&lt;/p&gt;
&lt;p&gt;
Doubly Robust Uniform Confidence Bands for Group-Time Conditional Average Treatment Effects in Difference-in-Differences. (arXiv:2305.02185v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.02185
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#21452;&#37325;&#31283;&#20581;&#25512;&#26029;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#21487;&#29992;&#20110;&#26500;&#24314;&#22312;&#24046;&#20998;&#20013;&#30340;&#32452;&#26102;&#38388;&#26465;&#20214;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#20989;&#25968;&#30340;&#19968;&#33268;&#32622;&#20449;&#24102;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#32771;&#34385;&#20102;&#23545;&#38754;&#26495;&#25968;&#25454;&#36827;&#34892;&#20998;&#26512;&#65292;&#20197;&#30740;&#31350;&#22312;Callaway&#21644;Sant'Anna&#65288;2021&#65289;&#30340;&#38169;&#20301;&#24046;&#20998;&#35774;&#32622;&#20013;&#65292;&#38024;&#23545;&#24863;&#20852;&#36259;&#30340;&#39044;&#22788;&#29702;&#21327;&#21464;&#37327;&#30340;&#27835;&#30103;&#25928;&#24212;&#24322;&#36136;&#24615;&#12290;&#22312;&#19968;&#32452;&#26631;&#20934;&#35782;&#21035;&#26465;&#20214;&#19979;&#65292;&#19968;&#20010;&#22522;&#20110;&#21327;&#21464;&#37327;&#30340;&#21452;&#37325;&#31283;&#20581;&#20272;&#35745;&#20540;&#35782;&#21035;&#20102;&#32473;&#23450;&#21327;&#21464;&#37327;&#30340;&#32452;&#26102;&#38388;&#26465;&#20214;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#12290;&#37492;&#20110;&#36825;&#20010;&#35782;&#21035;&#32467;&#26524;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#22522;&#20110;&#38750;&#21442;&#25968;&#23616;&#37096;&#32447;&#24615;&#22238;&#24402;&#21644;&#21442;&#25968;&#20272;&#35745;&#26041;&#27861;&#30340;&#19977;&#27493;&#20272;&#35745;&#31243;&#24207;&#65292;&#24182;&#24320;&#21457;&#20102;&#19968;&#20010;&#21452;&#37325;&#31283;&#20581;&#25512;&#26029;&#26041;&#27861;&#26469;&#26500;&#24314;&#32452;&#26102;&#38388;&#26465;&#20214;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#20989;&#25968;&#30340;&#19968;&#33268;&#32622;&#20449;&#24102;&#12290;
&lt;/p&gt;
&lt;p&gt;
This study considers a panel data analysis to examine the heterogeneity in treatment effects with respect to a pre-treatment covariate of interest in the staggered difference-in-differences setting in Callaway and Sant'Anna (2021). Under a set of standard identification conditions, a doubly robust estimand conditional on the covariate identifies the group-time conditional average treatment effect given the covariate. Given this identification result, we propose a three-step estimation procedure based on nonparametric local linear regressions and parametric estimation methods, and develop a doubly robust inference method to construct a uniform confidence band of the group-time conditional average treatment effect function.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21033;&#29992;&#38656;&#27714;&#39640;&#38454;&#30697;&#26469;&#20272;&#35745;&#24179;&#22343;&#31119;&#21033;&#25928;&#24212;&#30340;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#23545;&#26410;&#35266;&#23519;&#21040;&#30340;&#20559;&#22909;&#24322;&#36136;&#24615;&#24456;&#24378;&#65292;&#24182;&#19988;&#23545;&#31119;&#21033;&#21464;&#21270;&#30340;&#20998;&#24067;&#21487;&#20197;&#36827;&#34892;&#40065;&#26834;&#25512;&#26029;&#12290;&#21516;&#26102;&#65292;&#35770;&#25991;&#36824;&#24471;&#20986;&#20102;&#38656;&#27714;&#30697;&#24517;&#39035;&#28385;&#36275;&#26377;&#29702;&#28040;&#36153;&#32773;&#32676;&#20307;&#20551;&#35774;&#30340;&#26465;&#20214;&#12290;</title><link>http://arxiv.org/abs/2303.01231</link><description>&lt;p&gt;
&#20010;&#20307;&#24322;&#36136;&#24615;&#19979;&#30340;&#40065;&#26834;&#31119;&#21033;&#20998;&#26512;
&lt;/p&gt;
&lt;p&gt;
Robust Welfare Analysis under Individual Heterogeneity. (arXiv:2303.01231v2 [econ.TH] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.01231
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21033;&#29992;&#38656;&#27714;&#39640;&#38454;&#30697;&#26469;&#20272;&#35745;&#24179;&#22343;&#31119;&#21033;&#25928;&#24212;&#30340;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#23545;&#26410;&#35266;&#23519;&#21040;&#30340;&#20559;&#22909;&#24322;&#36136;&#24615;&#24456;&#24378;&#65292;&#24182;&#19988;&#23545;&#31119;&#21033;&#21464;&#21270;&#30340;&#20998;&#24067;&#21487;&#20197;&#36827;&#34892;&#40065;&#26834;&#25512;&#26029;&#12290;&#21516;&#26102;&#65292;&#35770;&#25991;&#36824;&#24471;&#20986;&#20102;&#38656;&#27714;&#30697;&#24517;&#39035;&#28385;&#36275;&#26377;&#29702;&#28040;&#36153;&#32773;&#32676;&#20307;&#20551;&#35774;&#30340;&#26465;&#20214;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#30446;&#21069;&#27979;&#37327;&#20215;&#26684;&#21464;&#21270;&#30340;&#31119;&#21033;&#25928;&#24212;&#36890;&#24120;&#20351;&#29992;&#27178;&#25130;&#38754;&#25968;&#25454;&#12290;&#20294;&#26159;&#65292;&#20351;&#29992;&#27178;&#25130;&#38754;&#25968;&#25454;&#26080;&#27861;&#35782;&#21035;&#38656;&#27714;&#65292;&#38500;&#38750;&#20551;&#35774;&#25152;&#26377;&#28040;&#36153;&#32773;&#37117;&#26159;&#30456;&#21516;&#30340;&#12290;&#26412;&#25991;&#21033;&#29992;&#20174;&#27178;&#25130;&#38754;&#25968;&#25454;&#20013;&#21487;&#35782;&#21035;&#30340;&#38656;&#27714;&#39640;&#38454;&#30697;&#26469;&#24320;&#21457;&#20272;&#35745;&#24179;&#22343;&#31119;&#21033;&#25928;&#24212;&#30340;&#26041;&#27861;&#65292;&#36825;&#31181;&#26041;&#27861;&#40065;&#26834;&#24615;&#23545;&#26410;&#35266;&#23519;&#21040;&#30340;&#20559;&#22909;&#24322;&#36136;&#24615;&#24456;&#24378;&#12290;&#25105;&#20204;&#30340;&#23616;&#37096;&#36817;&#20284;&#19981;&#23545;&#26410;&#35266;&#23519;&#21040;&#30340;&#19996;&#35199;&#26045;&#21152;&#20219;&#20309;&#38480;&#21046;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#30340;&#26041;&#27861;&#20351;&#24471;&#31119;&#21033;&#21464;&#21270;&#30340;&#20998;&#24067;&#21487;&#20197;&#36827;&#34892;&#40065;&#26834;&#25512;&#26029;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#24471;&#20986;&#20102;&#38656;&#27714;&#30697;&#24517;&#39035;&#28385;&#36275;&#26377;&#29702;&#28040;&#36153;&#32773;&#32676;&#20307;&#20551;&#35774;&#30340;&#26465;&#20214;&#12290;&#25105;&#20204;&#22312;&#33521;&#22269;&#23478;&#24237;&#39044;&#31639;&#35843;&#26597;&#25968;&#25454;&#19978;&#35828;&#26126;&#20102;&#25105;&#20204;&#30340;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
Welfare effects of price changes are often estimated with cross-sectional data. However, cross-sectional data do not identify demand unless all consumers are assumed to be identical. We exploit higher moments of demand, identifiable from cross-sectional data, to develop estimates of average welfare effects that are robust to unobserved preference heterogeneity. Our local approximations do not impose any restrictions on unobservables. In addition, our approach enables robust inference on the distribution of welfare changes. Finally, we obtain conditions that moments of demand must satisfy to arise from a population of rational consumers. We illustrate our methods on household budget survey data from the UK.
&lt;/p&gt;</description></item><item><title>Split Cycle&#26159;&#19968;&#31181;&#26032;&#30340;&#24247;&#22810;&#22622;&#19968;&#33268;&#30340;&#25237;&#31080;&#26041;&#27861;&#65292;&#29420;&#31435;&#20110;&#20811;&#38534;&#24182;&#23545;&#25915;&#20987;&#32773;&#20855;&#26377;&#20813;&#30123;&#24615;&#65292;&#23427;&#21487;&#20197;&#20943;&#36731;&#8220;&#30772;&#22351;&#32773;&#25928;&#24212;&#8221;&#21644;&#8220;&#24378;&#26080;&#34920;&#20915;&#24726;&#35770;&#8221;&#12290;</title><link>http://arxiv.org/abs/2004.02350</link><description>&lt;p&gt;
Split Cycle&#65306;&#19968;&#31181;&#26032;&#30340;&#24247;&#22810;&#22622;&#19968;&#33268;&#25237;&#31080;&#26041;&#27861;&#65292;&#29420;&#31435;&#20110;&#20811;&#38534;&#24182;&#23545;&#25915;&#20987;&#32773;&#20855;&#26377;&#20813;&#30123;&#24615;
&lt;/p&gt;
&lt;p&gt;
Split Cycle: A New Condorcet Consistent Voting Method Independent of Clones and Immune to Spoilers. (arXiv:2004.02350v9 [cs.GT] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2004.02350
&lt;/p&gt;
&lt;p&gt;
Split Cycle&#26159;&#19968;&#31181;&#26032;&#30340;&#24247;&#22810;&#22622;&#19968;&#33268;&#30340;&#25237;&#31080;&#26041;&#27861;&#65292;&#29420;&#31435;&#20110;&#20811;&#38534;&#24182;&#23545;&#25915;&#20987;&#32773;&#20855;&#26377;&#20813;&#30123;&#24615;&#65292;&#23427;&#21487;&#20197;&#20943;&#36731;&#8220;&#30772;&#22351;&#32773;&#25928;&#24212;&#8221;&#21644;&#8220;&#24378;&#26080;&#34920;&#20915;&#24726;&#35770;&#8221;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#24247;&#22810;&#22622;&#19968;&#33268;&#30340;&#25237;&#31080;&#26041;&#27861;&#65292;&#31216;&#20026;Split Cycle&#12290;Split Cycle&#23646;&#20110;&#24050;&#30693;&#30340;&#20960;&#31181;&#28385;&#36275;&#20811;&#38534;&#26080;&#20851;&#24615;&#30340;&#21453;&#25237;&#31080;&#20998;&#21106;&#26631;&#20934;&#30340;&#25237;&#31080;&#26041;&#27861;&#20043;&#19968;&#12290;&#22312;&#36825;&#20010;&#23478;&#26063;&#20013;&#65292;&#21482;&#26377;Split Cycle&#28385;&#36275;&#25105;&#20204;&#31216;&#20026;&#23545;&#25915;&#20987;&#32773;&#20855;&#26377;&#20813;&#30123;&#24615;&#30340;&#26032;&#26631;&#20934;&#65292;&#35813;&#26631;&#20934;&#28041;&#21450;&#21521;&#36873;&#20030;&#20013;&#28155;&#21152;&#20505;&#36873;&#20154;&#65292;&#20197;&#21450;&#28041;&#21450;&#21521;&#36873;&#20030;&#20013;&#28155;&#21152;&#36873;&#27665;&#30340;&#24050;&#30693;&#26631;&#20934;&#65292;&#21253;&#25324;&#27491;&#32467;&#31038;&#21644;&#36127;&#32467;&#31038;&#12290;&#22240;&#27492;&#65292;&#19982;&#20854;&#20182;&#20811;&#38534;&#26080;&#20851;&#30340;&#26041;&#27861;&#30456;&#27604;&#65292;Split Cycle&#20943;&#36731;&#20102;&#8220;&#30772;&#22351;&#32773;&#25928;&#24212;&#8221;&#21644;&#8220;&#24378;&#26080;&#34920;&#20915;&#24726;&#35770;&#8221;&#12290;
&lt;/p&gt;
&lt;p&gt;
We propose a Condorcet consistent voting method that we call Split Cycle. Split Cycle belongs to the small family of known voting methods satisfying the anti-vote-splitting criterion of independence of clones. In this family, only Split Cycle satisfies a new criterion we call immunity to spoilers, which concerns adding candidates to elections, as well as the known criteria of positive involvement and negative involvement, which concern adding voters to elections. Thus, in contrast to other clone-independent methods, Split Cycle mitigates both ``spoiler effects'' and ``strong no show paradoxes.''
&lt;/p&gt;</description></item></channel></rss>