<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#23545;&#32047;&#31215;&#38543;&#26426;&#23454;&#29616;&#30340;&#23614;&#37096;&#27010;&#29575;&#21644;&#26399;&#26395;&#32447;&#24615;&#25439;&#22833;&#30340;&#26032;&#30340;&#26356;&#23574;&#38160;&#30028;&#38480;&#65292;&#36825;&#20123;&#30028;&#38480;&#22312;&#22522;&#30784;&#20998;&#24067;&#21322;&#21442;&#25968;&#30340;&#24773;&#20917;&#19979;&#19981;&#21463;&#38480;&#21046;&#65292;&#34917;&#20805;&#20102;&#24050;&#26377;&#30340;&#32467;&#26524;&#65292;&#24320;&#36767;&#20102;&#20016;&#23500;&#30340;&#23454;&#38469;&#24212;&#29992;&#12290;</title><link>https://arxiv.org/abs/2404.02400</link><description>&lt;p&gt;
&#20851;&#20110;&#32047;&#31215;&#38543;&#26426;&#23454;&#29616;&#30340;&#23614;&#37096;&#27010;&#29575;&#21644;&#26399;&#26395;&#25439;&#22833;&#30340;&#25913;&#36827;&#21322;&#21442;&#25968;&#30028;&#38480;
&lt;/p&gt;
&lt;p&gt;
On Improved Semi-parametric Bounds for Tail Probability and Expected Loss
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2404.02400
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#23545;&#32047;&#31215;&#38543;&#26426;&#23454;&#29616;&#30340;&#23614;&#37096;&#27010;&#29575;&#21644;&#26399;&#26395;&#32447;&#24615;&#25439;&#22833;&#30340;&#26032;&#30340;&#26356;&#23574;&#38160;&#30028;&#38480;&#65292;&#36825;&#20123;&#30028;&#38480;&#22312;&#22522;&#30784;&#20998;&#24067;&#21322;&#21442;&#25968;&#30340;&#24773;&#20917;&#19979;&#19981;&#21463;&#38480;&#21046;&#65292;&#34917;&#20805;&#20102;&#24050;&#26377;&#30340;&#32467;&#26524;&#65292;&#24320;&#36767;&#20102;&#20016;&#23500;&#30340;&#23454;&#38469;&#24212;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#37325;&#26032;&#23457;&#35270;&#20102;&#24403;&#20010;&#21035;&#23454;&#29616;&#26159;&#29420;&#31435;&#30340;&#26102;&#65292;&#32047;&#31215;&#38543;&#26426;&#23454;&#29616;&#30340;&#23614;&#37096;&#34892;&#20026;&#30340;&#22522;&#26412;&#38382;&#39064;&#65292;&#24182;&#22312;&#21322;&#21442;&#25968;&#30340;&#22522;&#30784;&#20998;&#24067;&#26410;&#21463;&#38480;&#21046;&#30340;&#24773;&#20917;&#19979;&#65292;&#24320;&#21457;&#20102;&#23545;&#23614;&#37096;&#27010;&#29575;&#21644;&#26399;&#26395;&#32447;&#24615;&#25439;&#22833;&#30340;&#26032;&#30340;&#26356;&#23574;&#38160;&#30340;&#30028;&#38480;&#12290;&#25105;&#20204;&#30340;&#23574;&#38160;&#30028;&#38480;&#24456;&#22909;&#22320;&#34917;&#20805;&#20102;&#25991;&#29486;&#20013;&#24050;&#32463;&#24314;&#31435;&#30340;&#32467;&#26524;&#65292;&#21253;&#25324;&#22522;&#20110;&#32858;&#21512;&#30340;&#26041;&#27861;&#65292;&#21518;&#32773;&#32463;&#24120;&#26410;&#33021;&#20805;&#20998;&#32771;&#34385;&#29420;&#31435;&#24615;&#24182;&#20351;&#29992;&#19981;&#22815;&#20248;&#38597;&#30340;&#35777;&#26126;&#12290;&#26032;&#30340;&#35265;&#35299;&#21253;&#25324;&#22312;&#38750;&#30456;&#21516;&#24773;&#20917;&#19979;&#30340;&#35777;&#26126;&#65292;&#36798;&#21040;&#30028;&#38480;&#30340;&#20998;&#24067;&#20855;&#26377;&#30456;&#31561;&#30340;&#33539;&#22260;&#23646;&#24615;&#65292;&#24182;&#19988;&#27599;&#20010;&#38543;&#26426;&#21464;&#37327;&#23545;&#24635;&#21644;&#30340;&#26399;&#26395;&#20540;&#30340;&#24433;&#21709;&#21487;&#20197;&#36890;&#36807;&#23545;Korkine&#24658;&#31561;&#24335;&#30340;&#25512;&#24191;&#26469;&#23396;&#31435;&#20986;&#26469;&#12290;&#25105;&#20204;&#34920;&#26126;&#65292;&#26032;&#30340;&#30028;&#38480;&#19981;&#20165;&#34917;&#20805;&#20102;&#29616;&#26377;&#32467;&#26524;&#65292;&#32780;&#19988;&#24320;&#25299;&#20102;&#22823;&#37327;&#30340;&#23454;&#38469;&#24212;&#29992;&#65292;&#21253;&#25324;&#25913;&#36827;&#23450;&#20215;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2404.02400v1 Announce Type: new  Abstract: We revisit the fundamental issue of tail behavior of accumulated random realizations when individual realizations are independent, and we develop new sharper bounds on the tail probability and expected linear loss. The underlying distribution is semi-parametric in the sense that it remains unrestricted other than the assumed mean and variance. Our sharp bounds complement well-established results in the literature, including those based on aggregation, which often fail to take full account of independence and use less elegant proofs. New insights include a proof that in the non-identical case, the distributions attaining the bounds have the equal range property, and that the impact of each random variable on the expected value of the sum can be isolated using an extension of the Korkine identity. We show that the new bounds not only complement the extant results but also open up abundant practical applications, including improved pricing 
&lt;/p&gt;</description></item><item><title>&#20004;&#31181;&#20135;&#21697;&#21487;&#20197;&#25104;&#20026;&#28040;&#36153;&#32773;&#30340;&#20114;&#34917;&#21697;&#20294;&#23545;&#20013;&#38388;&#21830;&#26469;&#35828;&#26159;&#26367;&#20195;&#21697;&#65292;&#20174;&#32780;&#23548;&#33268;&#20215;&#26684;&#19978;&#28072;&#12290;</title><link>https://arxiv.org/abs/2402.12575</link><description>&lt;p&gt;
&#20849;&#21516;&#39038;&#23458;&#30340;&#36328;&#24066;&#22330;&#24182;&#36141;&#65306;&#20309;&#26102;&#65288;&#20197;&#21450;&#20026;&#20160;&#20040;&#65289;&#20250;&#22686;&#21152;&#35848;&#21028;&#20215;&#26684;&#65311;
&lt;/p&gt;
&lt;p&gt;
Cross-Market Mergers with Common Customers: When (and Why) Do They Increase Negotiated Prices?
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.12575
&lt;/p&gt;
&lt;p&gt;
&#20004;&#31181;&#20135;&#21697;&#21487;&#20197;&#25104;&#20026;&#28040;&#36153;&#32773;&#30340;&#20114;&#34917;&#21697;&#20294;&#23545;&#20013;&#38388;&#21830;&#26469;&#35828;&#26159;&#26367;&#20195;&#21697;&#65292;&#20174;&#32780;&#23548;&#33268;&#20215;&#26684;&#19978;&#28072;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#30740;&#31350;&#20102;&#20379;&#24212;&#21830;&#21040;&#20013;&#38388;&#21830;&#30340;&#36328;&#24066;&#22330;&#24182;&#36141;&#23545;&#20026;&#28040;&#36153;&#32773;&#25414;&#32465;&#20135;&#21697;&#30340;&#24433;&#21709;&#12290;&#36825;&#20123;&#24182;&#36141;&#22791;&#21463;&#20105;&#35758;&#12290;&#19968;&#20123;&#20154;&#35748;&#20026;&#20379;&#24212;&#21830;&#30340;&#20135;&#21697;&#20250;&#25104;&#20026;&#20013;&#38388;&#21830;&#30340;&#26367;&#20195;&#21697;&#65292;&#23613;&#31649;&#19981;&#26159;&#28040;&#36153;&#32773;&#30340;&#26367;&#20195;&#21697;&#12290;&#20854;&#20182;&#20154;&#35748;&#20026;&#65292;&#30001;&#20110;&#25414;&#32465;&#20351;&#20135;&#21697;&#25104;&#20026;&#28040;&#36153;&#32773;&#30340;&#20114;&#34917;&#20135;&#21697;&#65292;&#20135;&#21697;&#24517;&#39035;&#25104;&#20026;&#20013;&#38388;&#21830;&#30340;&#20114;&#34917;&#20135;&#21697;&#12290;&#25105;&#36890;&#36807;&#23637;&#31034;&#24403;&#20135;&#21697;&#22312;&#21560;&#24341;&#28040;&#36153;&#32773;&#36141;&#20080;&#25414;&#32465;&#21253;&#26102;&#21457;&#25381;&#31867;&#20284;&#20316;&#29992;&#26102;&#65292;&#20004;&#31181;&#20135;&#21697;&#21487;&#20197;&#25104;&#20026;&#28040;&#36153;&#32773;&#30340;&#20114;&#34917;&#21697;&#20294;&#23545;&#20013;&#38388;&#21830;&#26469;&#35828;&#26159;&#26367;&#20195;&#21697;&#65292;&#20026;&#36825;&#19968;&#36777;&#35770;&#20570;&#20986;&#20102;&#36129;&#29486;&#12290;&#36825;&#19968;&#32467;&#26524;&#24102;&#26469;&#20102;&#26032;&#30340;&#24314;&#35758;&#65292;&#24182;&#26377;&#21161;&#20110;&#35299;&#37322;&#20026;&#20160;&#20040;&#36328;&#24066;&#22330;&#21307;&#38498;&#24182;&#36141;&#20250;&#25552;&#39640;&#20215;&#26684;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.12575v1 Announce Type: new  Abstract: I examine the implications of cross-market mergers of suppliers to intermediaries that bundle products for consumers. These mergers are controversial. Some argue that suppliers' products will be substitutes for intermediaries, despite not being substitutes for consumers. Others contend that because bundling makes products complements for consumers, products must be complements for intermediaries. I contribute to this debate by showing that two products can be complements for consumers but substitutes for intermediaries when the products serve a similar role in attracting consumers to purchase the bundle. This result leads to new recommendations and helps explain why cross-market hospital mergers raise prices.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#37197;&#39069;&#26426;&#21046;&#22312;&#20195;&#29702;&#20154;&#38754;&#20020;&#22810;&#20010;&#20915;&#31574;&#19988;&#36135;&#24065;&#36716;&#31227;&#19981;&#21487;&#34892;&#26102;&#30340;&#24212;&#29992;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#38543;&#30528;&#20915;&#31574;&#25968;&#37327;&#30340;&#22686;&#21152;&#65292;&#37197;&#39069;&#26426;&#21046;&#21487;&#20197;&#23454;&#29616;&#19982;&#20351;&#29992;&#36716;&#31227;&#30340;&#29420;&#31435;&#26426;&#21046;&#30456;&#21516;&#30340;&#31038;&#20250;&#36873;&#25321;&#20989;&#25968;&#38598;&#21512;&#65292;&#24182;&#19988;&#23545;&#20110;&#20195;&#29702;&#23545;&#24444;&#27492;&#30340;&#20449;&#24565;&#26159;&#40065;&#26834;&#30340;&#12290;&#30740;&#31350;&#36824;&#21457;&#29616;&#65292;&#20026;&#20102;&#35774;&#32622;&#27491;&#30830;&#30340;&#37197;&#39069;&#65292;&#35774;&#35745;&#32773;&#24517;&#39035;&#23545;&#29615;&#22659;&#26377;&#31934;&#30830;&#30340;&#20102;&#35299;&#65292;&#21542;&#21017;&#21482;&#33021;&#23454;&#26045;&#24179;&#20961;&#30340;&#31038;&#20250;&#36873;&#25321;&#35268;&#21017;&#12290;&#21516;&#26102;&#65292;&#37197;&#39069;&#20351;&#24471;&#25253;&#21578;&#30340;&#20998;&#24067;&#25104;&#20026;&#20849;&#30693;&#12290;</title><link>http://arxiv.org/abs/2309.07363</link><description>&lt;p&gt;
&#38142;&#25509;&#26426;&#21046;&#65306;&#38480;&#21046;&#21644;&#40065;&#26834;&#24615;
&lt;/p&gt;
&lt;p&gt;
Linking Mechanisms: Limits and Robustness. (arXiv:2309.07363v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.07363
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#37197;&#39069;&#26426;&#21046;&#22312;&#20195;&#29702;&#20154;&#38754;&#20020;&#22810;&#20010;&#20915;&#31574;&#19988;&#36135;&#24065;&#36716;&#31227;&#19981;&#21487;&#34892;&#26102;&#30340;&#24212;&#29992;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#38543;&#30528;&#20915;&#31574;&#25968;&#37327;&#30340;&#22686;&#21152;&#65292;&#37197;&#39069;&#26426;&#21046;&#21487;&#20197;&#23454;&#29616;&#19982;&#20351;&#29992;&#36716;&#31227;&#30340;&#29420;&#31435;&#26426;&#21046;&#30456;&#21516;&#30340;&#31038;&#20250;&#36873;&#25321;&#20989;&#25968;&#38598;&#21512;&#65292;&#24182;&#19988;&#23545;&#20110;&#20195;&#29702;&#23545;&#24444;&#27492;&#30340;&#20449;&#24565;&#26159;&#40065;&#26834;&#30340;&#12290;&#30740;&#31350;&#36824;&#21457;&#29616;&#65292;&#20026;&#20102;&#35774;&#32622;&#27491;&#30830;&#30340;&#37197;&#39069;&#65292;&#35774;&#35745;&#32773;&#24517;&#39035;&#23545;&#29615;&#22659;&#26377;&#31934;&#30830;&#30340;&#20102;&#35299;&#65292;&#21542;&#21017;&#21482;&#33021;&#23454;&#26045;&#24179;&#20961;&#30340;&#31038;&#20250;&#36873;&#25321;&#35268;&#21017;&#12290;&#21516;&#26102;&#65292;&#37197;&#39069;&#20351;&#24471;&#25253;&#21578;&#30340;&#20998;&#24067;&#25104;&#20026;&#20849;&#30693;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#37197;&#39069;&#26426;&#21046;&#22312;&#20195;&#29702;&#38754;&#23545;&#22810;&#20010;&#20915;&#31574;&#19988;&#36135;&#24065;&#36716;&#31227;&#19981;&#21487;&#34892;&#26102;&#24120;&#34987;&#29992;&#20110;&#24341;&#20986;&#31169;&#20154;&#20449;&#24687;&#12290;&#24403;&#20915;&#31574;&#25968;&#37327;&#22686;&#21152;&#26102;&#65292;&#37197;&#39069;&#26426;&#21046;&#28176;&#36817;&#22320;&#23454;&#26045;&#19982;&#20351;&#29992;&#36716;&#31227;&#30340;&#29420;&#31435;&#26426;&#21046;&#30456;&#21516;&#30340;&#31038;&#20250;&#36873;&#25321;&#20989;&#25968;&#38598;&#21512;&#12290;&#25105;&#20204;&#20998;&#26512;&#20102;&#37197;&#39069;&#26426;&#21046;&#30340;&#40065;&#26834;&#24615;&#12290;&#20026;&#20102;&#35774;&#32622;&#27491;&#30830;&#30340;&#37197;&#39069;&#65292;&#35774;&#35745;&#32773;&#24517;&#39035;&#23545;&#29615;&#22659;&#26377;&#31934;&#30830;&#30340;&#20102;&#35299;&#12290;&#25105;&#20204;&#35777;&#26126;&#65292;&#27809;&#26377;&#36716;&#31227;&#30340;&#24773;&#20917;&#19979;&#65292;&#21482;&#26377;&#24179;&#20961;&#30340;&#31038;&#20250;&#36873;&#25321;&#35268;&#21017;&#21487;&#20197;&#20197;&#20808;&#39564;&#29420;&#31435;&#30340;&#26041;&#24335;&#23454;&#26045;&#12290;&#24403;&#37197;&#39069;&#19981;&#21305;&#37197;&#30495;&#23454;&#30340;&#31867;&#22411;&#20998;&#24067;&#26102;&#65292;&#25105;&#20204;&#24471;&#21040;&#20102;&#20915;&#31574;&#35823;&#24046;&#30340;&#32039;&#23494;&#30028;&#38480;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#35777;&#26126;&#22312;&#22810;&#20195;&#29702;&#30340;&#29615;&#22659;&#20013;&#65292;&#37197;&#39069;&#23545;&#20110;&#20195;&#29702;&#23545;&#24444;&#27492;&#30340;&#20449;&#24565;&#26159;&#40065;&#26834;&#30340;&#12290;&#20851;&#38190;&#26159;&#65292;&#37197;&#39069;&#20351;&#24471;&#25253;&#21578;&#30340;&#20998;&#24067;&#25104;&#20026;&#20849;&#30693;&#12290;
&lt;/p&gt;
&lt;p&gt;
Quota mechanisms are commonly used to elicit private information when agents face multiple decisions and monetary transfers are infeasible. As the number of decisions grows large, quotas asymptotically implement the same set of social choice functions as do separate mechanisms with transfers. We analyze the robustness of quota mechanisms. To set the correct quota, the designer must have precise knowledge of the environment. We show that, without transfers, only trivial social choice rules can be implemented in a prior-independent way. We obtain a tight bound on the decision error that results when the quota does not match the true type distribution. Finally, we show that in a multi-agent setting, quotas are robust to agents' beliefs about each other. Crucially, quotas make the distribution of reports common knowledge.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#38024;&#23545;&#20855;&#26377;&#21452;&#21521;&#22266;&#23450;&#25928;&#24212;&#30340;&#21160;&#24577;&#38750;&#32447;&#24615;&#27169;&#22411;&#30340;&#20998;&#26512;&#20559;&#24046;&#26657;&#27491;&#26041;&#27861;&#65292;&#36890;&#36807;&#26657;&#27491;&#21518;&#30340;&#20284;&#28982;&#20989;&#25968;&#24471;&#20986;&#30340;&#26816;&#39564;&#32479;&#35745;&#37327;&#21487;&#20197;&#24471;&#21040;&#26631;&#20934;&#28176;&#36817;&#20998;&#24067;&#65292;&#21516;&#26102;&#20063;&#21487;&#20197;&#24471;&#21040;&#32467;&#26500;&#21442;&#25968;&#30340;&#20559;&#24046;&#26657;&#27491;&#20272;&#35745;&#22120;&#12290;</title><link>http://arxiv.org/abs/2305.03134</link><description>&lt;p&gt;
&#20855;&#26377;&#21452;&#21521;&#22266;&#23450;&#25928;&#24212;&#30340;&#21160;&#24577;&#38750;&#32447;&#24615;&#27169;&#22411;&#30340;&#26080;&#20559;&#25512;&#26029;
&lt;/p&gt;
&lt;p&gt;
Debiased inference for dynamic nonlinear models with two-way fixed effects. (arXiv:2305.03134v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.03134
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#38024;&#23545;&#20855;&#26377;&#21452;&#21521;&#22266;&#23450;&#25928;&#24212;&#30340;&#21160;&#24577;&#38750;&#32447;&#24615;&#27169;&#22411;&#30340;&#20998;&#26512;&#20559;&#24046;&#26657;&#27491;&#26041;&#27861;&#65292;&#36890;&#36807;&#26657;&#27491;&#21518;&#30340;&#20284;&#28982;&#20989;&#25968;&#24471;&#20986;&#30340;&#26816;&#39564;&#32479;&#35745;&#37327;&#21487;&#20197;&#24471;&#21040;&#26631;&#20934;&#28176;&#36817;&#20998;&#24067;&#65292;&#21516;&#26102;&#20063;&#21487;&#20197;&#24471;&#21040;&#32467;&#26500;&#21442;&#25968;&#30340;&#20559;&#24046;&#26657;&#27491;&#20272;&#35745;&#22120;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38754;&#26495;&#25968;&#25454;&#27169;&#22411;&#36890;&#24120;&#20351;&#29992;&#22266;&#23450;&#25928;&#24212;&#26469;&#35299;&#37322;&#26410;&#35266;&#27979;&#21040;&#30340;&#24322;&#36136;&#24615;&#12290;&#36825;&#20123;&#22266;&#23450;&#25928;&#24212;&#36890;&#24120;&#26159;&#20598;&#28982;&#21442;&#25968;&#65292;&#23427;&#20204;&#30340;&#20272;&#35745;&#22120;&#30456;&#23545;&#20110;&#26679;&#26412;&#22823;&#23567;&#30340;&#24179;&#26041;&#26681;&#25910;&#25947;&#32531;&#24930;&#12290;&#22312;&#26368;&#22823;&#20284;&#28982;&#30340;&#19978;&#19979;&#25991;&#20013;&#65292;&#36825;&#20250;&#23548;&#33268;&#20284;&#28982;&#20989;&#25968;&#30340;&#28176;&#36817;&#20559;&#24046;&#12290;&#22240;&#27492;&#65292;&#20174;&#28176;&#36817;&#26377;&#20559;&#30340;&#20284;&#28982;&#20989;&#25968;&#24471;&#20986;&#30340;&#26816;&#39564;&#32479;&#35745;&#37327;&#19981;&#20877;&#36981;&#24490;&#20854;&#26631;&#20934;&#26497;&#38480;&#20998;&#24067;&#12290;&#36825;&#20250;&#23548;&#33268;&#26816;&#39564;&#22823;&#23567;&#30340;&#20005;&#37325;&#20559;&#24046;&#12290;&#25105;&#20204;&#32771;&#34385;&#19968;&#31867;&#20855;&#26377;&#21452;&#21521;&#22266;&#23450;&#25928;&#24212;&#30340;&#21160;&#24577;&#38750;&#32447;&#24615;&#27169;&#22411;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#20284;&#28982;&#20989;&#25968;&#30340;&#20998;&#26512;&#20559;&#24046;&#26657;&#27491;&#26041;&#27861;&#12290;&#25105;&#20204;&#27491;&#24335;&#35777;&#26126;&#20102;&#20174;&#26657;&#27491;&#21518;&#30340;&#20284;&#28982;&#20989;&#25968;&#24471;&#20986;&#30340;&#20284;&#28982;&#27604;&#12289;&#25289;&#26684;&#26391;&#26085;&#20056;&#25968;&#12289;&#21644; Wald &#26816;&#39564;&#32479;&#35745;&#37327;&#36981;&#24490;&#23427;&#20204;&#30340;&#26631;&#20934;&#28176;&#36817;&#20998;&#24067;&#12290;&#20316;&#20026;&#21103;&#20135;&#21697;&#65292;&#26657;&#27491;&#21518;&#30340;&#20284;&#28982;&#20989;&#25968;&#36824;&#21487;&#20197;&#24471;&#20986;&#32467;&#26500;&#21442;&#25968;&#30340;&#20559;&#24046;&#26657;&#27491;&#20272;&#35745;&#22120;&#12290;&#25105;&#20204;&#35780;&#20272;&#20102;&#35813;&#26041;&#27861;&#22312; Monte Carlo &#27169;&#25311;&#20013;&#30340;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;
Panel data models often use fixed effects to account for unobserved heterogeneities. These fixed effects are typically incidental parameters and their estimators converge slowly relative to the square root of the sample size. In the maximum likelihood context, this induces an asymptotic bias of the likelihood function. Test statistics derived from the asymptotically biased likelihood, therefore, no longer follow their standard limiting distributions. This causes severe distortions in test sizes. We consider a generic class of dynamic nonlinear models with two-way fixed effects and propose an analytical bias correction method for the likelihood function. We formally show that the likelihood ratio, the Lagrange-multiplier, and the Wald test statistics derived from the corrected likelihood follow their standard asymptotic distributions. As a by-product, a bias-corrected estimator of the structural parameter can also be derived from the corrected likelihood function. We evaluate the perfor
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;&#24314;&#31435;&#28176;&#36817;&#25512;&#26029;&#38750;&#23545;&#31216;&#30697;&#38453;&#29305;&#24449;&#21521;&#37327;&#31243;&#24207;&#30340;&#24517;&#35201;&#26465;&#20214;&#65292;&#24182;&#38024;&#23545;&#23436;&#20840;&#21521;&#37327;&#21644;&#27599;&#20010;&#31995;&#25968;&#20551;&#35774;&#20998;&#21035;&#24314;&#31435;&#20102; Wald &#21644; t &#26816;&#39564;&#30340;&#20998;&#24067;&#29702;&#35770;&#65292;&#26159;&#22810;&#20803;&#32479;&#35745;&#23398;&#20013;&#30340;&#19968;&#31181;&#26377;&#29992;&#24037;&#20855;&#12290;</title><link>http://arxiv.org/abs/2303.18233</link><description>&lt;p&gt;
&#38750;&#23545;&#31216;&#30697;&#38453;&#29305;&#24449;&#21521;&#37327;&#30340;&#25512;&#26029;
&lt;/p&gt;
&lt;p&gt;
Inference on eigenvectors of non-symmetric matrices. (arXiv:2303.18233v1 [math.ST])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.18233
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;&#24314;&#31435;&#28176;&#36817;&#25512;&#26029;&#38750;&#23545;&#31216;&#30697;&#38453;&#29305;&#24449;&#21521;&#37327;&#31243;&#24207;&#30340;&#24517;&#35201;&#26465;&#20214;&#65292;&#24182;&#38024;&#23545;&#23436;&#20840;&#21521;&#37327;&#21644;&#27599;&#20010;&#31995;&#25968;&#20551;&#35774;&#20998;&#21035;&#24314;&#31435;&#20102; Wald &#21644; t &#26816;&#39564;&#30340;&#20998;&#24067;&#29702;&#35770;&#65292;&#26159;&#22810;&#20803;&#32479;&#35745;&#23398;&#20013;&#30340;&#19968;&#31181;&#26377;&#29992;&#24037;&#20855;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#35748;&#20026;&#65292;Tyler&#65288;1981&#65289;&#30340;&#21487;&#23545;&#31216;&#21270;&#26465;&#20214;&#24182;&#38750;&#24314;&#31435;&#28176;&#36817;&#25512;&#26029;&#29305;&#24449;&#21521;&#37327;&#31243;&#24207;&#25152;&#24517;&#38656;&#30340;&#12290; &#25105;&#20204;&#20026;&#23436;&#20840;&#21521;&#37327;&#21644;&#27599;&#20010;&#31995;&#25968;&#20551;&#35774;&#20998;&#21035;&#24314;&#31435;&#20102; Wald &#21644; t &#26816;&#39564;&#30340;&#20998;&#24067;&#29702;&#35770;&#12290; &#25105;&#20204;&#30340;&#26816;&#39564;&#32479;&#35745;&#37327;&#26469;&#28304;&#20110;&#38750;&#23545;&#31216;&#30697;&#38453;&#30340;&#29305;&#24449;&#25237;&#24433;&#12290; &#36890;&#36807;&#23558;&#25237;&#24433;&#34920;&#31034;&#20026;&#20174;&#22522;&#30784;&#30697;&#38453;&#21040;&#20854;&#35889;&#25968;&#25454;&#30340;&#26144;&#23556;&#65292;&#25105;&#20204;&#36890;&#36807;&#35299;&#26512;&#25668;&#21160;&#29702;&#35770;&#25214;&#21040;&#20102;&#23548;&#25968;&#12290; &#36825;&#20123;&#32467;&#26524;&#28436;&#31034;&#20102; Sun&#65288;1991&#65289;&#30340;&#35299;&#26512;&#25668;&#21160;&#29702;&#35770;&#26159;&#22810;&#20803;&#32479;&#35745;&#23398;&#20013;&#30340;&#19968;&#31181;&#26377;&#29992;&#24037;&#20855;&#65292;&#24182;&#19988;&#20855;&#26377;&#29420;&#31435;&#30340;&#20852;&#36259;&#12290;&#20316;&#20026;&#19968;&#31181;&#24212;&#29992;&#65292;&#25105;&#20204;&#20026;&#30001;&#26377;&#21521;&#22270;&#24341;&#21457;&#30340;&#37051;&#25509;&#30697;&#38453;&#20272;&#35745;&#30340; Bonacich &#20013;&#24515;&#24615;&#23450;&#20041;&#32622;&#20449;&#21306;&#38388;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper argues that the symmetrisability condition in Tyler(1981) is not necessary to establish asymptotic inference procedures for eigenvectors. We establish distribution theory for a Wald and t-test for full-vector and individual coefficient hypotheses, respectively. Our test statistics originate from eigenprojections of non-symmetric matrices. Representing projections as a mapping from the underlying matrix to its spectral data, we find derivatives through analytic perturbation theory. These results demonstrate how the analytic perturbation theory of Sun(1991) is a useful tool in multivariate statistics and are of independent interest. As an application, we define confidence sets for Bonacich centralities estimated from adjacency matrices induced by directed graphs.
&lt;/p&gt;</description></item></channel></rss>