<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#35813;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#26041;&#27861;&#65292;&#22312;&#20272;&#35745;&#33258;&#22238;&#24402;&#27169;&#22411;&#26102;&#24341;&#20837;&#28508;&#22312;&#38750;&#24179;&#31283;&#22238;&#24402;&#21464;&#37327;&#30340;&#26435;&#37325;&#65292;&#33719;&#24471;&#20102;&#29702;&#35770;&#21644;&#23454;&#35777;&#32467;&#26524;&#26174;&#31034;&#36825;&#31181;&#26041;&#27861;&#22312;&#26816;&#27979;&#24179;&#31283;&#24615;&#26041;&#38754;&#30340;&#20248;&#21183;&#12290;</title><link>https://arxiv.org/abs/2402.16580</link><description>&lt;p&gt;
&#20351;&#29992;&#33258;&#36866;&#24212;Lasso&#36873;&#25321;&#24179;&#31283;&#21644;&#38750;&#24179;&#31283;&#33258;&#22238;&#24402;&#27169;&#22411;&#30340;&#20449;&#24687;&#22686;&#24378;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Information-Enriched Selection of Stationary and Non-Stationary Autoregressions using the Adaptive Lasso
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.16580
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#26041;&#27861;&#65292;&#22312;&#20272;&#35745;&#33258;&#22238;&#24402;&#27169;&#22411;&#26102;&#24341;&#20837;&#28508;&#22312;&#38750;&#24179;&#31283;&#22238;&#24402;&#21464;&#37327;&#30340;&#26435;&#37325;&#65292;&#33719;&#24471;&#20102;&#29702;&#35770;&#21644;&#23454;&#35777;&#32467;&#26524;&#26174;&#31034;&#36825;&#31181;&#26041;&#27861;&#22312;&#26816;&#27979;&#24179;&#31283;&#24615;&#26041;&#38754;&#30340;&#20248;&#21183;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#26041;&#27861;&#65292;&#36890;&#36807;&#20351;&#29992;&#33258;&#36866;&#24212;Lasso&#65292;&#22312;&#19968;&#33268;&#21644;&#22885;&#25289;&#20811;&#23572;&#25928;&#29575;&#20272;&#35745;&#33258;&#22238;&#24402;&#27169;&#22411;&#26102;&#24341;&#20837;&#19968;&#20010;&#28508;&#22312;&#38750;&#24179;&#31283;&#22238;&#24402;&#21464;&#37327;&#30340;&#26435;&#37325;&#12290;&#22686;&#24378;&#30340;&#26435;&#37325;&#24314;&#31435;&#22312;&#19968;&#20010;&#32479;&#35745;&#37327;&#19978;&#65292;&#35813;&#32479;&#35745;&#37327;&#21033;&#29992;OLS&#20272;&#35745;&#22120;&#22312;&#26102;&#38388;&#24207;&#21015;&#22238;&#24402;&#20013;&#30340;&#27010;&#29575;&#39034;&#24207;&#19981;&#21516;&#30340;&#29305;&#28857;&#65292;&#24403;&#31215;&#20998;&#31243;&#24230;&#19981;&#21516;&#26102;&#12290;&#25105;&#20204;&#22312;&#36873;&#25321;$\ell_1$&#24809;&#32602;&#21442;&#25968;&#26102;&#25552;&#20379;&#20102;&#29702;&#35770;&#32467;&#26524;&#65292;&#35777;&#26126;&#20102;&#25105;&#20204;&#30340;&#26041;&#27861;&#22312;&#26816;&#27979;&#24179;&#31283;&#24615;&#26041;&#38754;&#30340;&#20248;&#21183;&#12290;&#33945;&#29305;&#21345;&#27931;&#35777;&#25454;&#34920;&#26126;&#65292;&#25105;&#20204;&#30340;&#25552;&#35758;&#20248;&#20110;&#20351;&#29992;OLS&#22522;&#30784;&#26435;&#37325;&#65292;&#27491;&#22914;Kock&#24314;&#35758;&#30340;&#37027;&#26679;&#12290;&#25105;&#20204;&#23558;&#20462;&#25913;&#21518;&#30340;&#20272;&#35745;&#22120;&#24212;&#29992;&#20110;&#27431;&#20803;&#25512;&#20986;&#21518;&#24503;&#22269;&#36890;&#36135;&#33192;&#32960;&#29575;&#30340;&#27169;&#22411;&#36873;&#25321;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;&#33021;&#28304;&#21830;&#21697;&#20215;&#26684;&#36890;&#36135;&#33192;&#32960;&#21644;&#25972;&#20307;&#36890;&#36135;&#33192;&#32960;&#26368;&#22909;&#30001;&#24179;&#31283;&#33258;&#22238;&#24402;&#27169;&#22411;&#25551;&#36848;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.16580v1 Announce Type: cross  Abstract: We propose a novel approach to elicit the weight of a potentially non-stationary regressor in the consistent and oracle-efficient estimation of autoregressive models using the adaptive Lasso. The enhanced weight builds on a statistic that exploits distinct orders in probability of the OLS estimator in time series regressions when the degree of integration differs. We provide theoretical results on the benefit of our approach for detecting stationarity when a tuning criterion selects the $\ell_1$ penalty parameter. Monte Carlo evidence shows that our proposal is superior to using OLS-based weights, as suggested by Kock [Econom. Theory, 32, 2016, 243-259]. We apply the modified estimator to model selection for German inflation rates after the introduction of the Euro. The results indicate that energy commodity price inflation and headline inflation are best described by stationary autoregressions.
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#24182;&#35777;&#26126;&#20102;Arrow&#30340;&#19981;&#21487;&#33021;&#24615;&#23450;&#29702;&#30340;&#32452;&#21512;&#25299;&#25169;&#24191;&#20041;&#25512;&#24191;&#65292;&#22312;&#24341;&#20837;&#26497;&#21270;&#21644;&#22810;&#26679;&#24615;&#31867;&#30340;&#23450;&#20041;&#22495;&#38480;&#21046;&#19979;&#65292;&#36825;&#20010;&#25512;&#24191;&#21487;&#20197;&#36866;&#29992;&#20110;&#20219;&#24847;&#26377;&#38480;&#25968;&#37327;&#30340;&#22791;&#36873;&#26041;&#26696;&#12290;</title><link>https://arxiv.org/abs/2402.06024</link><description>&lt;p&gt;
Arrow&#30340;&#19981;&#21487;&#33021;&#24615;&#23450;&#29702;&#30340;&#32452;&#21512;&#25299;&#25169;&#24191;&#20041;&#25512;&#24191;
&lt;/p&gt;
&lt;p&gt;
A Generalization of Arrow's Impossibility Theorem Through Combinatorial Topology
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.06024
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#24182;&#35777;&#26126;&#20102;Arrow&#30340;&#19981;&#21487;&#33021;&#24615;&#23450;&#29702;&#30340;&#32452;&#21512;&#25299;&#25169;&#24191;&#20041;&#25512;&#24191;&#65292;&#22312;&#24341;&#20837;&#26497;&#21270;&#21644;&#22810;&#26679;&#24615;&#31867;&#30340;&#23450;&#20041;&#22495;&#38480;&#21046;&#19979;&#65292;&#36825;&#20010;&#25512;&#24191;&#21487;&#20197;&#36866;&#29992;&#20110;&#20219;&#24847;&#26377;&#38480;&#25968;&#37327;&#30340;&#22791;&#36873;&#26041;&#26696;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;Arrow&#30340;&#19981;&#21487;&#33021;&#24615;&#23450;&#29702;&#30340;&#19968;&#20010;&#24191;&#20041;&#25512;&#24191;&#65292;&#24182;&#21033;&#29992;&#32452;&#21512;&#25299;&#25169;&#26694;&#26550;&#23545;&#20854;&#36827;&#34892;&#35777;&#26126;&#12290;&#19982;&#20551;&#35774;&#26080;&#38480;&#21046;&#30340;&#23450;&#20041;&#22495;&#19981;&#21516;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#20010;&#31216;&#20026;&#26497;&#21270;&#21644;&#22810;&#26679;&#24615;&#31867;&#30340;&#23450;&#20041;&#22495;&#38480;&#21046;&#12290;&#36825;&#20010;&#31867;&#20013;&#30340;&#23450;&#20041;&#22495;&#35201;&#27714;&#31038;&#20250;&#22312;&#22914;&#20309;&#25490;&#21015;&#19977;&#20010;&#22791;&#36873;&#26041;&#26696;&#26041;&#38754;&#26159;&#24378;&#28872;&#20294;&#19981;&#23436;&#20840;&#20998;&#21270;&#30340;&#65292;&#24182;&#19988;&#36824;&#21253;&#25324;&#19968;&#20123;&#36829;&#21453;&#20540;&#38480;&#21046;&#26465;&#20214;&#30340;&#24773;&#20917;&#12290;&#20026;&#20102;&#35777;&#26126;&#36825;&#20010;&#32467;&#26524;&#65292;&#25105;&#20204;&#20351;&#29992;&#20102;Rajsbaum&#21644;Ravent\'os-Pujol&#22312;ACM&#20998;&#24067;&#24335;&#35745;&#31639;&#21407;&#21017;&#30740;&#35752;&#20250;(PODC)2022&#20013;&#24320;&#22987;&#20351;&#29992;&#30340;&#32452;&#21512;&#25299;&#25169;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#21448;&#22522;&#20110;Baryshnikov&#22312;1993&#24180;&#24320;&#22987;&#30340;&#20195;&#25968;&#25299;&#25169;&#26694;&#26550;&#12290;&#23613;&#31649;Rajsbaum&#21644;Ravent\'os-Pujol&#20351;&#29992;&#36825;&#31181;&#26041;&#27861;&#30740;&#31350;&#20102;&#20004;&#20301;&#36873;&#27665;&#21644;&#19977;&#20010;&#22791;&#36873;&#26041;&#26696;&#30340;&#24773;&#20917;&#19979;&#30340;Arrow&#19981;&#21487;&#33021;&#24615;&#23450;&#29702;&#21644;&#23450;&#20041;&#22495;&#38480;&#21046;&#65292;&#20294;&#25105;&#20204;&#23558;&#20854;&#25512;&#24191;&#21040;&#20102;&#20219;&#24847;&#26377;&#38480;&#25968;&#37327;&#30340;&#22791;&#36873;&#26041;&#26696;&#30340;&#19968;&#33324;&#24773;&#20917;&#12290;
&lt;/p&gt;
&lt;p&gt;
We present a generalization of Arrow's impossibility theorem and prove it using a combinatorial topology framework. Instead of assuming the unrestricted domain, we introduce a domain restriction called the class of polarization and diversity over triples. The domains in this class are defined by requiring profiles in which society is strongly, but not completely, polarized over how to rank triples of alternatives, as well as some profiles that violate the value-restriction condition. To prove this result, we use the combinatorial topology approach started by Rajsbaum and Ravent\'os-Pujol in the ACM Symposium on Principles of Distributed Computing (PODC) 2022, which in turn is based on the algebraic topology framework started by Baryshnikov in 1993. While Rajsbaum and Ravent\'os-Pujol employed this approach to study Arrow's impossibility theorem and domain restrictions for the case of two voters and three alternatives, we extend it for the general case of any finite number of alternativ
&lt;/p&gt;</description></item><item><title>&#30740;&#31350;&#20316;&#32773;&#36890;&#36807;&#24046;&#24322;&#20998;&#26512;&#33258;&#28982;&#23454;&#39564;&#21457;&#29616;&#65292;&#38750;&#27954;&#28023;&#24213;&#20114;&#32852;&#32593;&#30005;&#32518;&#30340;&#21040;&#26469;&#23545;&#20010;&#20154;&#21644;&#20225;&#19994;&#32423;&#23601;&#19994;&#20197;&#21450;&#22812;&#38388;&#20809;&#29031;&#25490;&#25918;&#20135;&#29983;&#20102;&#27491;&#38754;&#24433;&#21709;&#65292;&#20294;&#36825;&#20123;&#24433;&#21709;&#20027;&#35201;&#30001;&#20110;&#22320;&#29702;&#32534;&#30721;&#38169;&#35823;&#12289;&#21355;&#26143;&#26356;&#25442;&#24341;&#36215;&#30340;&#38388;&#26029;&#20197;&#21450;&#23545;&#24453;&#30103;&#21306;&#30340;&#23450;&#20041;&#19981;&#20934;&#30830;&#31561;&#21407;&#22240;&#32780;&#20135;&#29983;&#12290;</title><link>http://arxiv.org/abs/2401.13694</link><description>&lt;p&gt;
&#24555;&#36895;&#20114;&#32852;&#32593;&#30340;&#21040;&#26469;&#19982;&#38750;&#27954;&#23601;&#19994;&#65306;&#35780;&#35770;
&lt;/p&gt;
&lt;p&gt;
The Arrival of Fast Internet and Employment in Africa: Comment. (arXiv:2401.13694v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.13694
&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#20316;&#32773;&#36890;&#36807;&#24046;&#24322;&#20998;&#26512;&#33258;&#28982;&#23454;&#39564;&#21457;&#29616;&#65292;&#38750;&#27954;&#28023;&#24213;&#20114;&#32852;&#32593;&#30005;&#32518;&#30340;&#21040;&#26469;&#23545;&#20010;&#20154;&#21644;&#20225;&#19994;&#32423;&#23601;&#19994;&#20197;&#21450;&#22812;&#38388;&#20809;&#29031;&#25490;&#25918;&#20135;&#29983;&#20102;&#27491;&#38754;&#24433;&#21709;&#65292;&#20294;&#36825;&#20123;&#24433;&#21709;&#20027;&#35201;&#30001;&#20110;&#22320;&#29702;&#32534;&#30721;&#38169;&#35823;&#12289;&#21355;&#26143;&#26356;&#25442;&#24341;&#36215;&#30340;&#38388;&#26029;&#20197;&#21450;&#23545;&#24453;&#30103;&#21306;&#30340;&#23450;&#20041;&#19981;&#20934;&#30830;&#31561;&#21407;&#22240;&#32780;&#20135;&#29983;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
Hjort&#21644;Poulsen&#65288;2019&#65289;&#23558;&#20844;&#20803;2010&#24180;&#21069;&#21518;&#38750;&#27954;&#28023;&#23736;&#19978;&#30340;&#28023;&#24213;&#20114;&#32852;&#32593;&#30005;&#32518;&#30340;&#38169;&#20301;&#21040;&#36798;&#20316;&#20026;&#19968;&#31181;&#24046;&#24322;&#20998;&#26512;&#33258;&#28982;&#23454;&#39564;&#65292;&#30740;&#31350;&#20102;&#23485;&#24102;&#25509;&#20837;&#23545;&#20010;&#20154;&#21644;&#20225;&#19994;&#32423;&#23601;&#19994;&#20197;&#21450;&#22812;&#38388;&#20809;&#29031;&#25490;&#25918;&#30340;&#27491;&#38754;&#24433;&#21709;&#12290;&#26412;&#35770;&#25991;&#21457;&#29616;&#36825;&#20123;&#32467;&#26524;&#20027;&#35201;&#30001;&#20110;&#22320;&#29702;&#32534;&#30721;&#38169;&#35823;&#12289;2009&#24180;&#24213;&#21355;&#26143;&#26356;&#25442;&#24341;&#36215;&#30340;&#38388;&#26029;&#20197;&#21450;&#19968;&#20010;&#23545;&#24453;&#30103;&#21306;&#30340;&#23450;&#20041;&#19981;&#28165;&#26224;&#30340;&#25216;&#26415;&#22522;&#30784;&#12289;&#27604;&#20960;&#20046;&#25152;&#26377;&#25968;&#25454;&#26469;&#28304;&#30340;&#31354;&#38388;&#20998;&#36776;&#29575;&#31364;&#65292;&#19988;&#23545;&#23485;&#24102;&#21487;&#29992;&#24615;&#22320;&#29702;&#20998;&#24067;&#30340;&#20195;&#34920;&#24615;&#36739;&#24369;&#12290;
&lt;/p&gt;
&lt;p&gt;
Hjort and Poulsen (2019) frames the staggered arrival of submarine Internet cables on the shores of Africa circa 2010 as a difference-in-differences natural experiment in broadband access. The paper finds positive impacts on individual- and firm-level employment and nighttime light emissions. These results are largely ascribable to geocoding errors; to discontinuities from a satellite changeover at end-2009; and to a definition of the treated zone that has unclear technological basis, is narrower than the spatial resolution of nearly all the data sources, and is weakly representative of the geography of broadband availability.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#19981;&#23436;&#20840;&#20844;&#24320;&#30417;&#27979;&#30340;&#38543;&#26426;&#21338;&#24328;&#20013;&#25913;&#36827;&#30417;&#27979;&#22914;&#20309;&#24433;&#21709;&#26497;&#38480;&#22343;&#34913;&#25910;&#30410;&#38598;&#12290;&#25105;&#20204;&#36890;&#36807;&#24341;&#20837;&#21152;&#26435;&#28151;&#28102;&#20449;&#24687;&#32467;&#26500;&#65292;&#35777;&#26126;&#20102;&#26497;&#38480;&#23436;&#32654;&#20844;&#24320;&#22343;&#34913;&#25910;&#30410;&#38598;&#30340;&#21333;&#35843;&#24615;&#12290;&#25105;&#20204;&#36824;&#20171;&#32461;&#24182;&#35752;&#35770;&#20102;&#21478;&#19968;&#20010;&#36739;&#24369;&#30340;&#26465;&#20214;&#65292;&#29992;&#20110;&#25193;&#23637;&#26497;&#38480;&#22343;&#34913;&#25910;&#30410;&#38598;&#12290;</title><link>http://arxiv.org/abs/2308.09211</link><description>&lt;p&gt;
&#20851;&#20110;&#20449;&#24687;&#32467;&#26500;&#22312;&#38543;&#26426;&#21338;&#24328;&#20013;&#30340;&#20215;&#20540;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
On the Value of Information Structures in Stochastic Games. (arXiv:2308.09211v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.09211
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#19981;&#23436;&#20840;&#20844;&#24320;&#30417;&#27979;&#30340;&#38543;&#26426;&#21338;&#24328;&#20013;&#25913;&#36827;&#30417;&#27979;&#22914;&#20309;&#24433;&#21709;&#26497;&#38480;&#22343;&#34913;&#25910;&#30410;&#38598;&#12290;&#25105;&#20204;&#36890;&#36807;&#24341;&#20837;&#21152;&#26435;&#28151;&#28102;&#20449;&#24687;&#32467;&#26500;&#65292;&#35777;&#26126;&#20102;&#26497;&#38480;&#23436;&#32654;&#20844;&#24320;&#22343;&#34913;&#25910;&#30410;&#38598;&#30340;&#21333;&#35843;&#24615;&#12290;&#25105;&#20204;&#36824;&#20171;&#32461;&#24182;&#35752;&#35770;&#20102;&#21478;&#19968;&#20010;&#36739;&#24369;&#30340;&#26465;&#20214;&#65292;&#29992;&#20110;&#25193;&#23637;&#26497;&#38480;&#22343;&#34913;&#25910;&#30410;&#38598;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#25913;&#36827;&#30417;&#27979;&#22914;&#20309;&#24433;&#21709;&#19981;&#23436;&#20840;&#20844;&#24320;&#30417;&#27979;&#30340;&#38543;&#26426;&#21338;&#24328;&#30340;&#26497;&#38480;&#22343;&#34913;&#25910;&#30410;&#38598;&#12290;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#20010;&#31616;&#21333;&#30340;Blackwell&#28151;&#28102;&#30340;&#25512;&#24191;&#65292;&#31216;&#20026;&#21152;&#26435;&#28151;&#28102;&#65292;&#20197;&#20415;&#27604;&#36739;&#36825;&#31867;&#21338;&#24328;&#30340;&#19981;&#21516;&#20449;&#24687;&#32467;&#26500;&#12290;&#25105;&#20204;&#30340;&#20027;&#35201;&#32467;&#26524;&#26159;&#26497;&#38480;&#23436;&#32654;&#20844;&#24320;&#22343;&#34913;&#65288;PPE&#65289;&#25910;&#30410;&#38598;&#30456;&#23545;&#20110;&#36825;&#31181;&#20449;&#24687;&#39034;&#24207;&#30340;&#21333;&#35843;&#24615;&#65306;&#25105;&#20204;&#35777;&#26126;&#20102;&#22914;&#26524;&#21518;&#19968;&#31181;&#20449;&#24687;&#32467;&#26500;&#26159;&#21069;&#19968;&#31181;&#20449;&#24687;&#32467;&#26500;&#30340;&#21152;&#26435;&#28151;&#28102;&#65292;&#21017;&#25353;&#29366;&#24577;&#27604;&#36739;&#21518;&#19968;&#31181;&#20449;&#24687;&#32467;&#26500;&#30340;&#26497;&#38480;PPE&#25910;&#30410;&#38598;&#35201;&#22823;&#20110;&#21069;&#19968;&#31181;&#20449;&#24687;&#32467;&#26500;&#30340;&#26497;&#38480;PPE&#25910;&#30410;&#38598;&#12290;&#25105;&#20204;&#36824;&#35777;&#26126;&#20102;&#36825;&#31181;&#21333;&#35843;&#24615;&#32467;&#26524;&#22312;&#24378;&#23545;&#31216;&#22343;&#34913;&#31867;&#20013;&#20063;&#25104;&#31435;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#24341;&#20837;&#24182;&#35752;&#35770;&#20102;&#21478;&#19968;&#20010;&#36739;&#24369;&#30340;&#36275;&#22815;&#26465;&#20214;&#65292;&#29992;&#20110;&#25193;&#23637;&#26497;&#38480;PPE&#25910;&#30410;&#38598;&#12290;&#23613;&#31649;&#26356;&#21152;&#22797;&#26434;&#21644;&#38590;&#20197;&#39564;&#35777;&#65292;&#20294;&#22312;&#26576;&#20123;&#29305;&#27530;&#24773;&#20917;&#19979;&#24456;&#26377;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper studies how improved monitoring affects the limit equilibrium payoff set for stochastic games with imperfect public monitoring. We introduce a simple generalization of Blackwell garbling called weighted garbling in order to compare different information structures for this class of games. Our main result is the monotonicity of the limit perfect public equilibrium (PPE) payoff set with respect to this information order: we show that the limit PPE payoff sets with one information structure is larger than the limit PPE payoff sets with another information structure state by state if the latter information structure is a weighted garbling of the former. We show that this monotonicity result also holds for the class of strongly symmetric equilibrium. Finally, we introduce and discuss another weaker sufficient condition for the expansion of limit PPE payoff set. It is more complex and difficult to verify, but useful in some special cases.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#23616;&#37096;&#21270;&#31070;&#32463;&#32593;&#32476;&#30340;&#27169;&#22411;&#21644;&#32479;&#35745;&#31243;&#24207;&#26469;&#23545;&#30456;&#20851;&#25968;&#25454;&#36827;&#34892;&#20272;&#35745;&#21644;&#25512;&#26029;&#65292;&#35813;&#26041;&#27861;&#22312;&#28040;&#38500;&#25968;&#25454;&#20381;&#36182;&#24615;&#26041;&#38754;&#20855;&#26377;&#37325;&#35201;&#24847;&#20041;&#65292;&#33021;&#22815;&#38024;&#23545;&#19981;&#21516;&#31867;&#22411;&#30340;&#25968;&#25454;&#25552;&#20379;&#26377;&#25928;&#30340;&#25512;&#26029;&#12290;</title><link>http://arxiv.org/abs/2306.05593</link><description>&lt;p&gt;
&#19968;&#31181;&#22522;&#20110;&#23616;&#37096;&#21270;&#31070;&#32463;&#32593;&#32476;&#30340;&#30456;&#20851;&#25968;&#25454;&#20272;&#35745;&#21644;&#25512;&#26029;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
A Localized Neural Network with Dependent Data: Estimation and Inference. (arXiv:2306.05593v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.05593
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#23616;&#37096;&#21270;&#31070;&#32463;&#32593;&#32476;&#30340;&#27169;&#22411;&#21644;&#32479;&#35745;&#31243;&#24207;&#26469;&#23545;&#30456;&#20851;&#25968;&#25454;&#36827;&#34892;&#20272;&#35745;&#21644;&#25512;&#26029;&#65292;&#35813;&#26041;&#27861;&#22312;&#28040;&#38500;&#25968;&#25454;&#20381;&#36182;&#24615;&#26041;&#38754;&#20855;&#26377;&#37325;&#35201;&#24847;&#20041;&#65292;&#33021;&#22815;&#38024;&#23545;&#19981;&#21516;&#31867;&#22411;&#30340;&#25968;&#25454;&#25552;&#20379;&#26377;&#25928;&#30340;&#25512;&#26029;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#23616;&#37096;&#21270;&#31070;&#32463;&#32593;&#32476;&#65288;LNN&#65289;&#27169;&#22411;&#65292;&#24182;&#38024;&#23545;&#20855;&#26377;&#23450;&#37327;/&#23450;&#24615;&#32467;&#26524;&#30340;&#30456;&#20851;&#25968;&#25454;&#24320;&#21457;&#20102;LNN&#25152;&#22522;&#20110;&#30340;&#20272;&#35745;&#21644;&#25512;&#26029;&#31243;&#24207;&#12290;&#25105;&#20204;&#20174;&#38750;&#21442;&#25968;&#22238;&#24402;&#30340;&#35282;&#24230;&#25506;&#32034;&#20102;&#26631;&#35782;&#38480;&#21046;&#30340;&#20351;&#29992;&#65292;&#24182;&#22312;&#19968;&#32452;&#28201;&#21644;&#30340;&#26465;&#20214;&#19979;&#24314;&#31435;&#20102;LNN&#35774;&#32622;&#30340;&#20272;&#35745;&#29702;&#35770;&#12290;&#30456;&#24212;&#22320;&#23548;&#20986;&#20102;&#28176;&#36817;&#20998;&#24067;&#65292;&#24182;&#19988;&#25105;&#20204;&#34920;&#26126;&#65292;LNN&#22312;&#35745;&#31639;&#28176;&#36817;&#26041;&#24046;&#26102;&#33258;&#21160;&#28040;&#38500;&#20102;&#25968;&#25454;&#30340;&#20381;&#36182;&#24615;&#12290;&#36825;&#19968;&#21457;&#29616;&#26159;&#37325;&#35201;&#30340;&#65292;&#22240;&#20026;&#20154;&#20204;&#21487;&#20197;&#36731;&#26494;&#22320;&#20351;&#29992;&#19981;&#21516;&#31867;&#22411;&#30340;&#37326;&#34542;&#24341;&#23548;&#26041;&#27861;&#26469;&#33719;&#24471;&#26377;&#25928;&#30340;&#25512;&#26029;&#12290;&#29305;&#21035;&#22320;&#65292;&#23545;&#20110;&#23450;&#37327;&#32467;&#26524;&#65292;&#25152;&#25552;&#20986;&#30340;LNN&#26041;&#27861;&#20026;&#19968;&#20123;&#20851;&#38190;&#20272;&#35745;&#37327;&#30340;&#20272;&#35745;&#25552;&#20379;&#20102;&#23553;&#38381;&#24335;&#34920;&#36798;&#24335;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#36890;&#36807;&#24191;&#27867;&#30340;&#25968;&#20540;&#30740;&#31350;&#26469;&#26816;&#39564;&#25105;&#20204;&#30340;&#29702;&#35770;&#21457;&#29616;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this paper, we propose a localized neural network (LNN) model and then develop the LNN based estimation and inferential procedures for dependent data in both cases with quantitative/qualitative outcomes. We explore the use of identification restrictions from a nonparametric regression perspective, and establish an estimation theory for the LNN setting under a set of mild conditions. The asymptotic distributions are derived accordingly, and we show that LNN automatically eliminates the dependence of data when calculating the asymptotic variances. The finding is important, as one can easily use different types of wild bootstrap methods to obtain valid inference practically. In particular, for quantitative outcomes, the proposed LNN approach yields closed-form expressions for the estimates of some key estimators of interest. Last but not least, we examine our theoretical findings through extensive numerical studies.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#26679;&#26412;&#20998;&#23618;&#23454;&#39564;&#20013;&#30340;&#21327;&#21464;&#37327;&#35843;&#25972;&#26041;&#27861;&#65292;&#24182;&#21457;&#29616;&#23545;&#20110;&#20998;&#23618;&#35774;&#35745;&#65292;&#20256;&#32479;&#22238;&#24402;&#20272;&#35745;&#37327;&#36890;&#24120;&#26159;&#20302;&#25928;&#30340;&#12290;&#26681;&#25454;&#36825;&#19968;&#32467;&#26524;&#65292;&#25105;&#20204;&#25512;&#23548;&#20102;&#38024;&#23545;&#32473;&#23450;&#20998;&#23618;&#30340;&#28176;&#36817;&#26368;&#20248;&#32447;&#24615;&#21327;&#21464;&#37327;&#35843;&#25972;&#26041;&#27861;&#65292;&#24182;&#26500;&#24314;&#20102;&#20960;&#20010;&#21487;&#34892;&#30340;&#22823;&#26679;&#26412;&#20272;&#35745;&#22120;&#12290;</title><link>http://arxiv.org/abs/2302.03687</link><description>&lt;p&gt;
&#26679;&#26412;&#20998;&#23618;&#23454;&#39564;&#20013;&#30340;&#21327;&#21464;&#37327;&#35843;&#25972;
&lt;/p&gt;
&lt;p&gt;
Covariate Adjustment in Stratified Experiments. (arXiv:2302.03687v3 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2302.03687
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#26679;&#26412;&#20998;&#23618;&#23454;&#39564;&#20013;&#30340;&#21327;&#21464;&#37327;&#35843;&#25972;&#26041;&#27861;&#65292;&#24182;&#21457;&#29616;&#23545;&#20110;&#20998;&#23618;&#35774;&#35745;&#65292;&#20256;&#32479;&#22238;&#24402;&#20272;&#35745;&#37327;&#36890;&#24120;&#26159;&#20302;&#25928;&#30340;&#12290;&#26681;&#25454;&#36825;&#19968;&#32467;&#26524;&#65292;&#25105;&#20204;&#25512;&#23548;&#20102;&#38024;&#23545;&#32473;&#23450;&#20998;&#23618;&#30340;&#28176;&#36817;&#26368;&#20248;&#32447;&#24615;&#21327;&#21464;&#37327;&#35843;&#25972;&#26041;&#27861;&#65292;&#24182;&#26500;&#24314;&#20102;&#20960;&#20010;&#21487;&#34892;&#30340;&#22823;&#26679;&#26412;&#20272;&#35745;&#22120;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#26679;&#26412;&#20998;&#23618;&#23454;&#39564;&#20013;&#23545;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#36827;&#34892;&#21327;&#21464;&#37327;&#35843;&#25972;&#30340;&#26041;&#27861;&#12290;&#25105;&#20204;&#22312;&#19968;&#20010;&#36890;&#29992;&#30340;&#26694;&#26550;&#20013;&#24037;&#20316;&#65292;&#21253;&#25324;&#21305;&#37197;&#20803;&#32452;&#35774;&#35745;&#12289;&#31895;&#20998;&#23618;&#35774;&#35745;&#21644;&#23436;&#20840;&#38543;&#26426;&#21270;&#35774;&#35745;&#20316;&#20026;&#29305;&#20363;&#12290;&#24050;&#30693;&#23545;&#20110;&#23436;&#20840;&#38543;&#26426;&#21270;&#35774;&#35745;&#65292;&#21327;&#21464;&#37327;&#35843;&#25972;&#19982;&#22788;&#29702;-&#21327;&#21464;&#37327;&#20132;&#20114;&#39033;&#21487;&#20197;&#24369;&#21270;&#25928;&#29575;&#12290;&#28982;&#32780;&#65292;&#25105;&#20204;&#21457;&#29616;&#65292;&#23545;&#20110;&#20998;&#23618;&#35774;&#35745;&#65292;&#36825;&#31181;&#22238;&#24402;&#20272;&#35745;&#37327;&#36890;&#24120;&#26159;&#20302;&#25928;&#30340;&#65292;&#29978;&#33267;&#21487;&#33021;&#30456;&#23545;&#20110;&#26410;&#35843;&#25972;&#30340;&#22522;&#20934;&#20272;&#35745;&#37327;&#22686;&#21152;&#20272;&#35745;&#26041;&#24046;&#12290;&#22312;&#27492;&#32467;&#26524;&#30340;&#22522;&#30784;&#19978;&#65292;&#25105;&#20204;&#25512;&#23548;&#20986;&#38024;&#23545;&#32473;&#23450;&#20998;&#23618;&#30340;&#28176;&#36817;&#26368;&#20248;&#32447;&#24615;&#21327;&#21464;&#37327;&#35843;&#25972;&#12290;&#25105;&#20204;&#26500;&#24314;&#20102;&#20960;&#20010;&#21487;&#34892;&#30340;&#20272;&#35745;&#22120;&#65292;&#20197;&#20351;&#22823;&#26679;&#26412;&#20013;&#23454;&#29616;&#36825;&#31181;&#39640;&#25928;&#35843;&#25972;&#12290;&#20363;&#22914;&#65292;&#22312;&#21305;&#37197;&#23545;&#30340;&#29305;&#20363;&#20013;&#65292;&#21253;&#25324;&#22788;&#29702;&#12289;&#21327;&#21464;&#37327;&#21644;&#23545;&#22266;&#23450;&#25928;&#24212;&#30340;&#22238;&#24402;&#22312;&#28176;&#36817;&#19978;&#26159;&#26368;&#20248;&#30340;&#12290;&#25105;&#20204;&#36824;&#25552;&#20379;&#20102;&#26032;&#39062;&#30340;&#28176;&#36817;&#31934;&#30830;&#25512;&#26029;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper studies covariate adjusted estimation of the average treatment effect in stratified experiments. We work in a general framework that includes matched tuples designs, coarse stratification, and complete randomization as special cases. Regression adjustment with treatment-covariate interactions is known to weakly improve efficiency for completely randomized designs. By contrast, we show that for stratified designs such regression estimators are generically inefficient, potentially even increasing estimator variance relative to the unadjusted benchmark. Motivated by this result, we derive the asymptotically optimal linear covariate adjustment for a given stratification. We construct several feasible estimators that implement this efficient adjustment in large samples. In the special case of matched pairs, for example, the regression including treatment, covariates, and pair fixed effects is asymptotically optimal. We also provide novel asymptotically exact inference methods tha
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#19968;&#31181;&#32852;&#21512;&#26816;&#39564;&#31243;&#24207;&#26469;&#35299;&#20915;&#30446;&#21069;&#22238;&#24402;&#19981;&#36830;&#32493;&#35774;&#35745;&#30340;&#35786;&#26029;&#26816;&#39564;&#23384;&#22312;&#30340;&#22810;&#37325;&#26816;&#39564;&#38382;&#39064;&#65292;&#35813;&#31243;&#24207;&#32988;&#36807;Bonferroni&#26657;&#27491;&#12290;</title><link>http://arxiv.org/abs/2205.04345</link><description>&lt;p&gt;
&#22238;&#24402;&#19981;&#36830;&#32493;&#35774;&#35745;&#30340;&#32852;&#21512;&#35786;&#26029;&#26816;&#39564;&#65306;&#22810;&#37325;&#26816;&#39564;&#38382;&#39064;
&lt;/p&gt;
&lt;p&gt;
Joint diagnostic test of regression discontinuity designs: multiple testing problem. (arXiv:2205.04345v2 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2205.04345
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#19968;&#31181;&#32852;&#21512;&#26816;&#39564;&#31243;&#24207;&#26469;&#35299;&#20915;&#30446;&#21069;&#22238;&#24402;&#19981;&#36830;&#32493;&#35774;&#35745;&#30340;&#35786;&#26029;&#26816;&#39564;&#23384;&#22312;&#30340;&#22810;&#37325;&#26816;&#39564;&#38382;&#39064;&#65292;&#35813;&#31243;&#24207;&#32988;&#36807;Bonferroni&#26657;&#27491;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#30446;&#21069;&#22238;&#24402;&#19981;&#36830;&#32493;(RD)&#35774;&#35745;&#30340;&#35786;&#26029;&#26816;&#39564;&#23384;&#22312;&#22810;&#37325;&#26816;&#39564;&#38382;&#39064;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#22312;&#20116;&#20010;&#39030;&#32423;&#32463;&#27982;&#23398;&#26399;&#21002;&#20013;&#21457;&#34920;&#30340;&#23454;&#35777;RD&#30740;&#31350;&#20013;&#65292;&#37492;&#21035;&#38480;&#21046;&#34987;&#22823;&#37327;&#36807;&#24230;&#25298;&#32477;&#12290;&#27599;&#20010;&#26816;&#39564;&#30340;&#21517;&#20041;&#22823;&#23567;&#20026;5&#65285;&#65292;&#20294;&#27599;&#20010;&#30740;&#31350;&#30340;&#20013;&#20301;&#25968;&#27979;&#35797;&#27425;&#25968;&#20026;12&#12290;&#22240;&#27492;&#65292;&#36229;&#36807;&#19977;&#20998;&#20043;&#19968;&#30340;&#30740;&#31350;&#20013;&#33267;&#23569;&#25298;&#32477;&#20102;&#20854;&#20013;&#19968;&#20010;&#26816;&#39564;&#65292;&#20854;&#35786;&#26029;&#31243;&#24207;&#26080;&#27861;&#35777;&#26126;&#37492;&#21035;&#20551;&#35774;&#30340;&#27491;&#30830;&#24615;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#19968;&#31181;&#32852;&#21512;&#26816;&#39564;&#31243;&#24207;&#26469;&#35299;&#20915;&#22810;&#37325;&#26816;&#39564;&#38382;&#39064;&#12290;&#25105;&#20204;&#30340;&#31243;&#24207;&#22522;&#20110;&#26032;&#30340;&#23616;&#37096;&#32447;&#24615;&#20272;&#35745;&#21644;&#23616;&#37096;&#22810;&#39033;&#24335;&#23494;&#24230;&#20272;&#35745;&#32852;&#21512;&#28176;&#36817;&#27491;&#24577;&#24615;&#12290;&#22312;&#27169;&#25311;&#30740;&#31350;&#20013;&#65292;&#25105;&#20204;&#30340;&#32852;&#21512;&#26816;&#39564;&#31243;&#24207;&#32988;&#36807;&#20102;Bonferroni&#26657;&#27491;&#12290;
&lt;/p&gt;
&lt;p&gt;
Current diagnostic tests for regression discontinuity (RD) design face a multiple testing problem. We find a massive over-rejection of the identifying restriction among empirical RD studies published in top-five economics journals. Each test achieves a nominal size of 5%; however, the median number of tests per study is 12. Consequently, more than one-third of studies reject at least one of these tests and their diagnostic procedures are invalid for justifying the identifying assumption. We offer a joint testing procedure to resolve the multiple testing problem. Our procedure is based on a new joint asymptotic normality of local linear estimates and local polynomial density estimates. In simulation studies, our joint testing procedures outperform the Bonferroni correction.
&lt;/p&gt;</description></item></channel></rss>