<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#35299;&#37322;&#27491;&#20132;&#21270;&#27169;&#22411;&#31995;&#25968;&#30340;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#22240;&#26524;&#32463;&#27982;&#35299;&#37322;&#65292;&#24182;&#25193;&#23637;&#20102;&#26684;&#25289;&#22982;-&#26045;&#23494;&#29305;&#36807;&#31243;&#21040;&#21516;&#26102;&#22238;&#24402;&#32452;&#65292;&#35777;&#26126;&#20102;&#20854;&#20248;&#20110;&#26368;&#23567;&#20108;&#20056;&#27861;&#30340;&#31995;&#25968;&#24615;&#36136;&#12290;</title><link>https://arxiv.org/abs/2402.17103</link><description>&lt;p&gt;
&#22240;&#26524;&#27491;&#20132;&#21270;&#65306;&#22810;&#37325;&#20849;&#32447;&#24615;&#65292;&#32463;&#27982;&#21487;&#35299;&#37322;&#24615;&#21644;&#26684;&#25289;&#22982;-&#26045;&#23494;&#29305;&#36807;&#31243;
&lt;/p&gt;
&lt;p&gt;
Causal Orthogonalization: Multicollinearity, Economic Interpretability, and the Gram-Schmidt Process
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.17103
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#35299;&#37322;&#27491;&#20132;&#21270;&#27169;&#22411;&#31995;&#25968;&#30340;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#22240;&#26524;&#32463;&#27982;&#35299;&#37322;&#65292;&#24182;&#25193;&#23637;&#20102;&#26684;&#25289;&#22982;-&#26045;&#23494;&#29305;&#36807;&#31243;&#21040;&#21516;&#26102;&#22238;&#24402;&#32452;&#65292;&#35777;&#26126;&#20102;&#20854;&#20248;&#20110;&#26368;&#23567;&#20108;&#20056;&#27861;&#30340;&#31995;&#25968;&#24615;&#36136;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#35299;&#37322;&#27491;&#20132;&#21270;&#27169;&#22411;&#31995;&#25968;&#30340;&#38382;&#39064;&#12290;&#25105;&#20204;&#25512;&#23548;&#20102;&#26684;&#25289;&#22982;-&#26045;&#23494;&#29305;&#27491;&#20132;&#21270;&#36807;&#31243;&#30340;&#22240;&#26524;&#32463;&#27982;&#35299;&#37322;&#65292;&#24182;&#25552;&#20379;&#20102;&#20854;&#31561;&#25928;&#20110;&#26469;&#33258;&#36882;&#24402;&#26377;&#21521;&#22270;&#30340;&#24635;&#25928;&#24212;&#30340;&#26465;&#20214;&#12290;&#25105;&#20204;&#23558;&#26684;&#25289;&#22982;-&#26045;&#23494;&#29305;&#36807;&#31243;&#25193;&#23637;&#21040;&#32463;&#27982;&#25968;&#25454;&#38598;&#20013;&#24120;&#35265;&#30340;&#21516;&#26102;&#22238;&#24402;&#32452;&#65292;&#25512;&#23548;&#20854;&#26377;&#38480;&#26679;&#26412;&#24615;&#36136;&#65292;&#21457;&#29616;&#20854;&#31995;&#25968;&#26080;&#20559;&#12289;&#31283;&#23450;&#65292;&#24182;&#19988;&#27604;&#26368;&#23567;&#20108;&#20056;&#27861;&#30340;&#31995;&#25968;&#26356;&#26377;&#25928;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#23558;&#20272;&#35745;&#22120;&#24212;&#29992;&#20110;&#25511;&#21046;&#35832;&#22914;&#31181;&#26063;&#12289;&#25945;&#32946;&#21644;&#25910;&#20837;&#31561;&#39640;&#24230;&#20849;&#32447;&#29305;&#24449;&#30340;&#20799;&#31461;&#38405;&#35835;&#29702;&#35299;&#20998;&#25968;&#12290;&#35813;&#27169;&#22411;&#25193;&#23637;&#20102;Bohren&#31561;&#20154;&#23545;&#31995;&#32479;&#24615;&#27495;&#35270;&#30340;&#20998;&#35299;&#20026;&#29305;&#23450;&#36890;&#36947;&#25928;&#24212;&#65292;&#24182;&#25552;&#39640;&#20102;&#20854;&#31995;&#25968;&#30340;&#26174;&#33879;&#24615;&#27700;&#24179;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.17103v1 Announce Type: new  Abstract: This paper considers the problem of interpreting orthogonalization model coefficients. We derive a causal economic interpretation of the Gram-Schmidt orthogonalization process and provide the conditions for its equivalence to total effects from a recursive Directed Acyclic Graph. We extend the Gram-Schmidt process to groups of simultaneous regressors common in economic data sets and derive its finite sample properties, finding its coefficients to be unbiased, stable, and more efficient than those from Ordinary Least Squares. Finally, we apply the estimator to childhood reading comprehension scores, controlling for such highly collinear characteristics as race, education, and income. The model expands Bohren et al.'s decomposition of systemic discrimination into channel-specific effects and improves its coefficient significance levels.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#36890;&#36807;&#19968;&#20010;AI-Powered&#22260;&#26827;&#31243;&#24207;&#65288;APG&#65289;&#30340;&#24341;&#20837;&#65292;&#21457;&#29616;&#20154;&#31867;&#20174;&#20154;&#24037;&#26234;&#33021;&#20013;&#23398;&#20064;&#21487;&#20197;&#26174;&#33879;&#25552;&#39640;&#30528;&#27861;&#36136;&#37327;&#65292;&#24182;&#20943;&#23569;&#38169;&#35823;&#25968;&#37327;&#21644;&#22823;&#23567;&#12290;&#24180;&#36731;&#36873;&#25163;&#21644;&#25509;&#35302;&#36807;&#20154;&#24037;&#26234;&#33021;&#30340;&#22269;&#23478;&#30340;&#36873;&#25163;&#33719;&#24471;&#20102;&#26356;&#22823;&#30340;&#25913;&#36827;&#65292;&#25216;&#26415;&#36739;&#24046;&#30340;&#36873;&#25163;&#33719;&#24471;&#20102;&#26356;&#39640;&#30340;&#36793;&#38469;&#25928;&#30410;&#12290;</title><link>http://arxiv.org/abs/2310.08704</link><description>&lt;p&gt;
&#20154;&#24037;&#26234;&#33021;&#22914;&#20309;&#25552;&#21319;&#20154;&#31867;&#20915;&#31574;&#33021;&#21147;&#65311;&#26469;&#33258;AI-Powered&#22260;&#26827;&#31243;&#24207;&#30340;&#35777;&#25454;&#12290;
&lt;/p&gt;
&lt;p&gt;
How Does Artificial Intelligence Improve Human Decision-Making? Evidence from the AI-Powered Go Program. (arXiv:2310.08704v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.08704
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#36890;&#36807;&#19968;&#20010;AI-Powered&#22260;&#26827;&#31243;&#24207;&#65288;APG&#65289;&#30340;&#24341;&#20837;&#65292;&#21457;&#29616;&#20154;&#31867;&#20174;&#20154;&#24037;&#26234;&#33021;&#20013;&#23398;&#20064;&#21487;&#20197;&#26174;&#33879;&#25552;&#39640;&#30528;&#27861;&#36136;&#37327;&#65292;&#24182;&#20943;&#23569;&#38169;&#35823;&#25968;&#37327;&#21644;&#22823;&#23567;&#12290;&#24180;&#36731;&#36873;&#25163;&#21644;&#25509;&#35302;&#36807;&#20154;&#24037;&#26234;&#33021;&#30340;&#22269;&#23478;&#30340;&#36873;&#25163;&#33719;&#24471;&#20102;&#26356;&#22823;&#30340;&#25913;&#36827;&#65292;&#25216;&#26415;&#36739;&#24046;&#30340;&#36873;&#25163;&#33719;&#24471;&#20102;&#26356;&#39640;&#30340;&#36793;&#38469;&#25928;&#30410;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#20154;&#31867;&#22914;&#20309;&#20174;&#20154;&#24037;&#26234;&#33021;&#20013;&#23398;&#20064;&#65292;&#21033;&#29992;&#20102;&#19968;&#20010;&#31361;&#28982;&#20987;&#36133;&#26368;&#22909;&#30340;&#32844;&#19994;&#36873;&#25163;&#30340;AI-Powered&#22260;&#26827;&#31243;&#24207;&#65288;APG&#65289;&#30340;&#24341;&#20837;&#12290;&#25105;&#20204;&#27604;&#36739;&#20102;&#32844;&#19994;&#36873;&#25163;&#30340;&#30528;&#27861;&#36136;&#37327;&#21644;APG&#22312;&#20854;&#20844;&#24320;&#21457;&#24067;&#21069;&#21518;&#30340;&#21331;&#36234;&#35299;&#20915;&#26041;&#26696;&#30340;&#30528;&#27861;&#36136;&#37327;&#12290;&#25105;&#20204;&#20998;&#26512;&#20102;749,190&#20010;&#30528;&#27861;&#65292;&#21457;&#29616;&#20102;&#29609;&#23478;&#30528;&#27861;&#36136;&#37327;&#30340;&#26174;&#33879;&#25552;&#21319;&#65292;&#21516;&#26102;&#38169;&#35823;&#25968;&#37327;&#21644;&#22823;&#23567;&#30340;&#20943;&#23569;&#12290;&#36825;&#31181;&#25928;&#26524;&#22312;&#27604;&#36187;&#30340;&#21021;&#26399;&#38454;&#27573;&#23588;&#20026;&#26174;&#33879;&#65292;&#22240;&#20026;&#27492;&#26102;&#19981;&#30830;&#23450;&#24615;&#26368;&#22823;&#12290;&#27492;&#22806;&#65292;&#24180;&#36731;&#36873;&#25163;&#21644;&#37027;&#20123;&#22788;&#20110;&#25509;&#35302;&#36807;&#20154;&#24037;&#26234;&#33021;&#30340;&#22269;&#23478;&#30340;&#36873;&#25163;&#33719;&#24471;&#20102;&#26356;&#22823;&#30340;&#25913;&#36827;&#65292;&#36825;&#34920;&#26126;&#20102;&#20174;&#20154;&#24037;&#26234;&#33021;&#20013;&#23398;&#20064;&#21487;&#33021;&#23384;&#22312;&#30340;&#19981;&#24179;&#31561;&#38382;&#39064;&#12290;&#27492;&#22806;&#65292;&#34429;&#28982;&#21508;&#20010;&#27700;&#24179;&#30340;&#36873;&#25163;&#37117;&#33021;&#23398;&#20064;&#65292;&#20294;&#25216;&#26415;&#36739;&#24046;&#30340;&#36873;&#25163;&#33719;&#24471;&#20102;&#26356;&#39640;&#30340;&#36793;&#38469;&#25928;&#30410;&#12290;&#36825;&#20123;&#21457;&#29616;&#23545;&#20110;&#23547;&#27714;&#22312;&#32452;&#32455;&#20013;&#26377;&#25928;&#37319;&#29992;&#21644;&#21033;&#29992;&#20154;&#24037;&#26234;&#33021;&#30340;&#31649;&#29702;&#32773;&#20855;&#26377;&#37325;&#35201;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study how humans learn from AI, exploiting an introduction of an AI-powered Go program (APG) that unexpectedly outperformed the best professional player. We compare the move quality of professional players to that of APG's superior solutions around its public release. Our analysis of 749,190 moves demonstrates significant improvements in players' move quality, accompanied by decreased number and magnitude of errors. The effect is pronounced in the early stages of the game where uncertainty is highest. In addition, younger players and those in AI-exposed countries experience greater improvement, suggesting potential inequality in learning from AI. Further, while players of all levels learn, less skilled players derive higher marginal benefits. These findings have implications for managers seeking to adopt and utilize AI effectively within their organizations.
&lt;/p&gt;</description></item></channel></rss>