<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#20855;&#26377;&#26410;&#30693;&#25104;&#26412;&#30340;&#21322;&#31163;&#25955;&#26368;&#20248;&#36755;&#36816;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#37319;&#29992;&#22312;&#32447;&#23398;&#20064;&#21644;&#38543;&#26426;&#36924;&#36817;&#30456;&#32467;&#21512;&#30340;&#21322;&#23616;&#37096;&#31639;&#27861;&#65292;&#24182;&#35777;&#26126;&#20854;&#20855;&#26377;&#26368;&#20248;&#30340;&#25910;&#25947;&#36895;&#24230;&#12290;</title><link>http://arxiv.org/abs/2310.00786</link><description>&lt;p&gt;
&#20855;&#26377;&#26410;&#30693;&#25104;&#26412;&#30340;&#21322;&#31163;&#25955;&#26368;&#20248;&#36755;&#36816;
&lt;/p&gt;
&lt;p&gt;
Semidiscrete optimal transport with unknown costs. (arXiv:2310.00786v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.00786
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#20855;&#26377;&#26410;&#30693;&#25104;&#26412;&#30340;&#21322;&#31163;&#25955;&#26368;&#20248;&#36755;&#36816;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#37319;&#29992;&#22312;&#32447;&#23398;&#20064;&#21644;&#38543;&#26426;&#36924;&#36817;&#30456;&#32467;&#21512;&#30340;&#21322;&#23616;&#37096;&#31639;&#27861;&#65292;&#24182;&#35777;&#26126;&#20854;&#20855;&#26377;&#26368;&#20248;&#30340;&#25910;&#25947;&#36895;&#24230;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21322;&#31163;&#25955;&#26368;&#20248;&#36755;&#36816;&#26159;&#32447;&#24615;&#35268;&#21010;&#20013;&#32463;&#20856;&#36755;&#36816;&#38382;&#39064;&#30340;&#19968;&#31181;&#26377;&#25361;&#25112;&#24615;&#30340;&#25512;&#24191;&#12290;&#20854;&#30446;&#26631;&#26159;&#20197;&#22266;&#23450;&#36793;&#38469;&#20998;&#24067;&#30340;&#26041;&#24335;&#35774;&#35745;&#20004;&#20010;&#38543;&#26426;&#21464;&#37327;&#65288;&#19968;&#20010;&#36830;&#32493;&#65292;&#19968;&#20010;&#31163;&#25955;&#65289;&#30340;&#32852;&#21512;&#20998;&#24067;&#65292;&#20197;&#26368;&#23567;&#21270;&#26399;&#26395;&#25104;&#26412;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#36825;&#20010;&#38382;&#39064;&#30340;&#19968;&#20010;&#26032;&#22411;&#21464;&#20307;&#65292;&#20854;&#20013;&#25104;&#26412;&#20989;&#25968;&#26159;&#26410;&#30693;&#30340;&#65292;&#20294;&#21487;&#20197;&#36890;&#36807;&#22122;&#22768;&#35266;&#27979;&#23398;&#20064;&#65307;&#28982;&#32780;&#65292;&#27599;&#27425;&#21482;&#33021;&#37319;&#26679;&#19968;&#20010;&#20989;&#25968;&#12290;&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#31181;&#21322;&#23616;&#37096;&#31639;&#27861;&#65292;&#23558;&#22312;&#32447;&#23398;&#20064;&#19982;&#38543;&#26426;&#36924;&#36817;&#30456;&#32467;&#21512;&#65292;&#24182;&#35777;&#26126;&#20854;&#23454;&#29616;&#20102;&#26368;&#20248;&#30340;&#25910;&#25947;&#36895;&#24230;&#65292;&#23613;&#31649;&#38543;&#26426;&#26799;&#24230;&#30340;&#38750;&#20809;&#28369;&#24615;&#21644;&#30446;&#26631;&#20989;&#25968;&#30340;&#32570;&#20047;&#24378;&#20985;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Semidiscrete optimal transport is a challenging generalization of the classical transportation problem in linear programming. The goal is to design a joint distribution for two random variables (one continuous, one discrete) with fixed marginals, in a way that minimizes expected cost. We formulate a novel variant of this problem in which the cost functions are unknown, but can be learned through noisy observations; however, only one function can be sampled at a time. We develop a semi-myopic algorithm that couples online learning with stochastic approximation, and prove that it achieves optimal convergence rates, despite the non-smoothness of the stochastic gradient and the lack of strong concavity in the objective function.
&lt;/p&gt;</description></item></channel></rss>