<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#36825;&#31687;&#35770;&#25991;&#30740;&#31350;&#20102;&#22312;&#20195;&#29702;&#20154;&#21487;&#33021;&#20855;&#26377;&#19981;&#21516;&#32784;&#24515;&#27700;&#24179;&#30340;&#24773;&#20917;&#19979;&#65292;&#22914;&#20309;&#20844;&#24179;&#20998;&#37197;&#19968;&#31995;&#21015;&#26102;&#38388;&#27573;&#12290;&#30740;&#31350;&#32467;&#26524;&#32473;&#20986;&#20102;&#32784;&#24515;&#27700;&#24179;&#30340;&#19979;&#38480;&#21644;&#19978;&#38480;&#65292;&#20351;&#24471;&#33021;&#22815;&#23454;&#29616;&#27604;&#20363;&#20998;&#37197;&#21644;&#26080;&#23241;&#22930;&#20998;&#37197;&#12290;</title><link>http://arxiv.org/abs/2311.06092</link><description>&lt;p&gt;
&#32784;&#24515;&#30830;&#20445;&#20844;&#24179;&#24615;
&lt;/p&gt;
&lt;p&gt;
Patience ensures fairness. (arXiv:2311.06092v2 [econ.TH] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2311.06092
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#30740;&#31350;&#20102;&#22312;&#20195;&#29702;&#20154;&#21487;&#33021;&#20855;&#26377;&#19981;&#21516;&#32784;&#24515;&#27700;&#24179;&#30340;&#24773;&#20917;&#19979;&#65292;&#22914;&#20309;&#20844;&#24179;&#20998;&#37197;&#19968;&#31995;&#21015;&#26102;&#38388;&#27573;&#12290;&#30740;&#31350;&#32467;&#26524;&#32473;&#20986;&#20102;&#32784;&#24515;&#27700;&#24179;&#30340;&#19979;&#38480;&#21644;&#19978;&#38480;&#65292;&#20351;&#24471;&#33021;&#22815;&#23454;&#29616;&#27604;&#20363;&#20998;&#37197;&#21644;&#26080;&#23241;&#22930;&#20998;&#37197;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#37325;&#28201;&#20102;&#24403;&#20195;&#29702;&#20154;&#21487;&#33021;&#20855;&#26377;&#19981;&#21516;&#32784;&#24515;&#27700;&#24179;&#26102;&#20844;&#24179;&#20998;&#37197;&#26102;&#38388;&#27573;&#30340;&#38382;&#39064;&#65288;Mackenzie&#21644;Komornik&#65292;2023&#65289;&#12290;&#23545;&#20110;&#27599;&#20010;&#20195;&#29702;&#20154;&#25968;&#37327;&#65292;&#25105;&#20204;&#25552;&#20379;&#20102;&#32784;&#24515;&#27700;&#24179;&#30340;&#19979;&#38480;&#21644;&#19978;&#38480;&#65292;&#20351;&#24471;&#65288;i&#65289;&#22914;&#26524;&#27599;&#20010;&#20195;&#29702;&#20154;&#30340;&#32784;&#24515;&#27700;&#24179;&#33267;&#23569;&#36798;&#21040;&#19979;&#38480;&#65292;&#21017;&#23384;&#22312;&#27604;&#20363;&#20998;&#37197;&#65307;&#65288;ii&#65289;&#22914;&#26524;&#27599;&#20010;&#20195;&#29702;&#20154;&#30340;&#32784;&#24515;&#27700;&#24179;&#33267;&#23569;&#36798;&#21040;&#19978;&#38480;&#65292;&#24182;&#19988;&#23545;&#36739;&#26089;&#30340;&#26102;&#38388;&#27573;&#26377;&#24369;&#20559;&#22909;&#65292;&#21017;&#23384;&#22312;&#26080;&#23241;&#22930;&#20998;&#37197;&#12290;&#22312;&#20004;&#31181;&#24773;&#20917;&#19979;&#65292;&#35777;&#26126;&#26159;&#20855;&#20307;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
We revisit the problem of fairly allocating a sequence of time slots when agents may have different levels of patience (Mackenzie and Komornik, 2023). For each number of agents, we provide a lower threshold and an upper threshold on the level of patience such that (i) if each agent is at least as patient as the lower threshold, then there is a proportional allocation, and (ii) if each agent is at least as patient as the upper threshold and moreover has weak preference for earlier time slots, then there is an envy-free allocation. In both cases, the proof is constructive.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#38750;&#32447;&#24615;&#26102;&#38388;&#24207;&#21015;&#27169;&#22411;&#30340;&#33033;&#20914;&#21709;&#24212;&#20998;&#26512;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#26356;&#30452;&#25509;&#20381;&#36182;&#20110;&#24213;&#23618;&#27169;&#22411;&#23646;&#24615;&#30340;&#26041;&#27861;&#65292;&#24182;&#35752;&#35770;&#20102;&#30456;&#20851;&#30340;&#38750;&#21442;&#25968;&#20272;&#35745;&#21644;&#32467;&#26500;&#33033;&#20914;&#21709;&#24212;&#30340;&#25512;&#26029;&#12290;</title><link>http://arxiv.org/abs/2305.19089</link><description>&lt;p&gt;
&#32467;&#26500;&#38750;&#32447;&#24615;&#26102;&#38388;&#24207;&#21015;&#27169;&#22411;&#30340;&#33033;&#20914;&#21709;&#24212;&#20998;&#26512;
&lt;/p&gt;
&lt;p&gt;
Impulse Response Analysis for Structural Nonlinear Time Series Models. (arXiv:2305.19089v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.19089
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#38750;&#32447;&#24615;&#26102;&#38388;&#24207;&#21015;&#27169;&#22411;&#30340;&#33033;&#20914;&#21709;&#24212;&#20998;&#26512;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#26356;&#30452;&#25509;&#20381;&#36182;&#20110;&#24213;&#23618;&#27169;&#22411;&#23646;&#24615;&#30340;&#26041;&#27861;&#65292;&#24182;&#35752;&#35770;&#20102;&#30456;&#20851;&#30340;&#38750;&#21442;&#25968;&#20272;&#35745;&#21644;&#32467;&#26500;&#33033;&#20914;&#21709;&#24212;&#30340;&#25512;&#26029;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#32447;&#24615;&#26102;&#38388;&#24207;&#21015;&#27169;&#22411;&#26159;&#32467;&#26500;&#23439;&#35266;&#32463;&#27982;&#20998;&#26512;&#30340;&#37325;&#35201;&#24037;&#20855;&#65292;&#28982;&#32780;&#32463;&#27982;&#29702;&#35770;&#21644;&#23454;&#35777;&#25968;&#25454;&#37117;&#34920;&#26126;&#65292;&#38750;&#32447;&#24615;&#21644;&#19981;&#23545;&#31216;&#25928;&#24212;&#30340;&#30740;&#31350;&#20063;&#21313;&#20998;&#37325;&#35201;&#65292;&#20197;&#20102;&#35299;&#25919;&#31574;&#21046;&#23450;&#32773;&#30340;&#36873;&#25321;&#21487;&#33021;&#20135;&#29983;&#30340;&#24433;&#21709;&#12290;&#26412;&#25991;&#20197;&#21160;&#24577;&#31995;&#32479;&#35270;&#35282;&#65292;&#27604;&#36739;&#20102;&#24050;&#30693;&#30340;&#26500;&#24314;&#38750;&#32447;&#24615;&#26102;&#38388;&#24207;&#21015;&#27169;&#22411;&#33033;&#20914;&#21709;&#24212;&#30340;&#26041;&#27861;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#26356;&#30452;&#25509;&#20381;&#36182;&#20110;&#24213;&#23618;&#27169;&#22411;&#23646;&#24615;&#30340;&#26032;&#26041;&#27861;&#12290;&#35752;&#35770;&#20102;&#22312;&#33258;&#28982;&#29289;&#29702;&#20381;&#36182;&#20551;&#35774;&#19979;&#30340;&#33258;&#22238;&#24402;&#27169;&#22411;&#30340;&#38750;&#21442;&#25968;&#20272;&#35745;&#65292;&#20197;&#21450;&#32467;&#26500;&#33033;&#20914;&#21709;&#24212;&#30340;&#25512;&#26029;&#12290;
&lt;/p&gt;
&lt;p&gt;
Linear time series models are the workhorse of structural macroeconometric analysis. However, economic theory as well as data suggests that nonlinear and asymmetric effects might be important to study to understand the potential effects of policy makers' choices. Taking a dynamical system view, this paper compares known approaches to construct impulse responses in nonlinear time series models and proposes a new approach that more directly relies on the underlying model properties. Nonparametric estimation of autoregressive models is discussed under natural physical dependence assumptions as well as inference for structural impulse responses.
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#20855;&#26377;&#25215;&#35834;&#21147;&#37327;&#30340;&#20449;&#21495;&#20256;&#36882;&#21338;&#24328;&#65292;&#24182;&#25552;&#20986;&#20102;&#21457;&#20214;&#20154;&#21487;&#36798;&#21040;&#30340;&#25910;&#30410;&#30340;&#20960;&#20309;&#25551;&#36848;&#12290;&#30740;&#31350;&#32773;&#23558;&#20854;&#24212;&#29992;&#20110;&#19981;&#21516;&#39046;&#22495;&#65292;&#22914;&#20316;&#19994;&#24066;&#22330;&#20449;&#21495;&#20256;&#36882;&#12289;&#36890;&#20449;&#21644;&#25259;&#38706;&#12290;</title><link>http://arxiv.org/abs/2305.00777</link><description>&lt;p&gt;
&#25215;&#35834;&#19979;&#30340;&#20449;&#21495;&#20256;&#36882;
&lt;/p&gt;
&lt;p&gt;
Signaling With Commitment. (arXiv:2305.00777v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.00777
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#20855;&#26377;&#25215;&#35834;&#21147;&#37327;&#30340;&#20449;&#21495;&#20256;&#36882;&#21338;&#24328;&#65292;&#24182;&#25552;&#20986;&#20102;&#21457;&#20214;&#20154;&#21487;&#36798;&#21040;&#30340;&#25910;&#30410;&#30340;&#20960;&#20309;&#25551;&#36848;&#12290;&#30740;&#31350;&#32773;&#23558;&#20854;&#24212;&#29992;&#20110;&#19981;&#21516;&#39046;&#22495;&#65292;&#22914;&#20316;&#19994;&#24066;&#22330;&#20449;&#21495;&#20256;&#36882;&#12289;&#36890;&#20449;&#21644;&#25259;&#38706;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#20855;&#26377;&#25215;&#35834;&#21147;&#37327;&#30340;&#20449;&#21495;&#20256;&#36882;&#21338;&#24328;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#21457;&#20214;&#20154;&#21487;&#36798;&#21040;&#30340;&#25910;&#30410;&#30340;&#20960;&#20309;&#25551;&#36848;&#65292;&#30001;&#19982;&#19981;&#21516;&#21457;&#20214;&#20154;&#34892;&#21160;&#30456;&#20851;&#30340;&#21457;&#20214;&#20154;&#20020;&#26102;&#25903;&#20184;&#20989;&#25968;&#30340;&#22270;&#30340;&#25299;&#25169;&#32852;&#21512;&#25551;&#36848;&#12290;&#25105;&#20204;&#23558;&#36825;&#31181;&#24773;&#20917;&#19979;&#30340;&#21457;&#20214;&#20154;&#25910;&#30410;&#19982;&#20004;&#20010;&#22522;&#20934;&#36827;&#34892;&#27604;&#36739;&#12290;&#22312;&#31532;&#19968;&#20010;&#22522;&#20934;&#20013;&#65292;&#38500;&#20102;&#25215;&#35834;&#33258;&#24049;&#30340;&#34892;&#21160;&#22806;&#65292;&#21457;&#20214;&#20154;&#36824;&#21487;&#20197;&#25215;&#35834;&#21521;&#25509;&#25910;&#32773;&#25552;&#20379;&#39069;&#22806;&#30340;&#20449;&#24687;&#12290;&#22312;&#31532;&#20108;&#20010;&#22522;&#20934;&#20013;&#65292;&#21457;&#20214;&#20154;&#21482;&#33021;&#25215;&#35834;&#21457;&#24067;&#20449;&#24687;&#65292;&#20294;&#19981;&#33021;&#20445;&#35777;&#33258;&#24049;&#30340;&#34892;&#21160;&#12290;&#25105;&#20204;&#36824;&#23558;&#25105;&#20204;&#30340;&#32467;&#26524;&#24212;&#29992;&#20110;&#20316;&#19994;&#24066;&#22330;&#20449;&#21495;&#20256;&#36882;&#65292;&#20855;&#26377;&#34394;&#20551;&#25104;&#26412;&#30340;&#36890;&#20449;&#21644;&#25259;&#38706;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study the canonical signaling game, endowing the sender with commitment power. We provide a geometric characterization of the sender's attainable payoffs, described by the topological join of the graphs of the sender's interim payoff functions associated with different sender actions. We compare the sender's payoffs in this setting with two benchmarks. In the first, in addition to committing to her actions, the sender can commit to provide the receiver with additional information. In the second, the sender can only commit to release information, but cannot commit to her actions. We illustrate our results with applications to job market signaling, communication with lying costs, and disclosure.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#28608;&#21169;&#23545;&#25112;&#30053;&#28216;&#25103;&#20013;&#36873;&#25321;&#21644;&#20449;&#24565;&#30340;&#24433;&#21709;&#65292;&#36890;&#36807;&#23454;&#39564;&#35777;&#26126;&#22312;&#25903;&#37197;&#21487;&#35299;&#28216;&#25103;&#20013;&#65292;&#26356;&#39640;&#30340;&#28608;&#21169;&#27700;&#24179;&#21487;&#20197;&#25552;&#39640;&#34892;&#21160;&#30340;&#22797;&#26434;&#24615;&#21644;&#26368;&#20339;&#21709;&#24212;&#29575;&#65292;&#24182;&#20943;&#23569;&#38169;&#35823;&#20542;&#21521;&#65307;&#32780;&#22312;&#31616;&#21333;&#28216;&#25103;&#20013;&#65292;&#26356;&#39640;&#33258;&#36523;&#28608;&#21169;&#20250;&#20351;&#20449;&#24565;&#26356;&#21152;&#20934;&#30830;&#12290;&#20294;&#26159;&#65292;&#20855;&#26377;&#26356;&#39640;&#28608;&#21169;&#27700;&#24179;&#30340;&#23545;&#25163;&#26356;&#38590;&#39044;&#27979;&#19988;&#20449;&#24565;&#20063;&#26356;&#21152;&#26377;&#20559;&#35265;&#12290;&#30740;&#31350;&#36824;&#21457;&#29616;&#65292;&#28608;&#21169;&#21487;&#20197;&#24433;&#21709;&#35748;&#30693;&#21162;&#21147;&#21644;&#34920;&#29616;&#65292;&#20854;&#19982;&#36873;&#25321;&#21644;&#20449;&#24565;&#22797;&#26434;&#24615;&#30456;&#20851;&#12290;</title><link>http://arxiv.org/abs/2304.00412</link><description>&lt;p&gt;
&#28608;&#21169;&#23545;&#28216;&#25103;&#20013;&#36873;&#25321;&#21644;&#20449;&#24565;&#30340;&#24433;&#21709;&#65306;&#19968;&#20010;&#23454;&#39564;
&lt;/p&gt;
&lt;p&gt;
The Effects of Incentives on Choices and Beliefs in Games: An Experiment. (arXiv:2304.00412v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.00412
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#28608;&#21169;&#23545;&#25112;&#30053;&#28216;&#25103;&#20013;&#36873;&#25321;&#21644;&#20449;&#24565;&#30340;&#24433;&#21709;&#65292;&#36890;&#36807;&#23454;&#39564;&#35777;&#26126;&#22312;&#25903;&#37197;&#21487;&#35299;&#28216;&#25103;&#20013;&#65292;&#26356;&#39640;&#30340;&#28608;&#21169;&#27700;&#24179;&#21487;&#20197;&#25552;&#39640;&#34892;&#21160;&#30340;&#22797;&#26434;&#24615;&#21644;&#26368;&#20339;&#21709;&#24212;&#29575;&#65292;&#24182;&#20943;&#23569;&#38169;&#35823;&#20542;&#21521;&#65307;&#32780;&#22312;&#31616;&#21333;&#28216;&#25103;&#20013;&#65292;&#26356;&#39640;&#33258;&#36523;&#28608;&#21169;&#20250;&#20351;&#20449;&#24565;&#26356;&#21152;&#20934;&#30830;&#12290;&#20294;&#26159;&#65292;&#20855;&#26377;&#26356;&#39640;&#28608;&#21169;&#27700;&#24179;&#30340;&#23545;&#25163;&#26356;&#38590;&#39044;&#27979;&#19988;&#20449;&#24565;&#20063;&#26356;&#21152;&#26377;&#20559;&#35265;&#12290;&#30740;&#31350;&#36824;&#21457;&#29616;&#65292;&#28608;&#21169;&#21487;&#20197;&#24433;&#21709;&#35748;&#30693;&#21162;&#21147;&#21644;&#34920;&#29616;&#65292;&#20854;&#19982;&#36873;&#25321;&#21644;&#20449;&#24565;&#22797;&#26434;&#24615;&#30456;&#20851;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#19968;&#20010;&#23454;&#39564;&#65292;&#20197;&#30830;&#23450;&#28608;&#21169;&#27700;&#24179;&#23545;&#25112;&#30053;&#35774;&#32622;&#19979;&#36873;&#25321;&#21644;&#20449;&#24565;&#30340;&#22240;&#26524;&#25928;&#24212;&#65292;&#20854;&#20013;&#23545;&#25163;&#30340;&#34892;&#20026;&#34987;&#22266;&#23450;&#12290;&#22312;&#25903;&#37197;&#21487;&#35299;&#30340;&#28216;&#25103;&#20013;&#65292;&#26356;&#39640;&#30340;&#28608;&#21169;&#27700;&#24179;&#22686;&#21152;&#20102;&#34892;&#21160;&#30340;&#22797;&#26434;&#24615;&#21644;&#26368;&#20339;&#21709;&#24212;&#29575;&#65292;&#24182;&#20943;&#23569;&#20102;&#38169;&#35823;&#20542;&#21521;&#12290;&#22312;&#31616;&#21333;&#28216;&#25103;&#20013;&#65292;&#26356;&#39640;&#33258;&#36523;&#28608;&#21169;&#24448;&#24448;&#20351;&#24471;&#20449;&#24565;&#26356;&#21152;&#20934;&#30830;&#12290;&#28982;&#32780;&#65292;&#20855;&#26377;&#26356;&#39640;&#28608;&#21169;&#27700;&#24179;&#30340;&#23545;&#25163;&#26356;&#38590;&#39044;&#27979;&#65306;&#24403;&#23545;&#25163;&#20855;&#26377;&#26356;&#39640;&#28608;&#21169;&#27700;&#24179;&#26102;&#65292;&#20449;&#24565;&#20250;&#36319;&#36394;&#23545;&#25163;&#30340;&#34892;&#20026;&#65292;&#20294;&#23545;&#23545;&#25163;&#30340;&#20449;&#24565;&#20063;&#20250;&#21464;&#24471;&#26356;&#21152;&#26377;&#20559;&#35265;&#12290;&#25105;&#20204;&#25552;&#20379;&#35777;&#25454;&#34920;&#26126;&#28608;&#21169;&#24433;&#21709;&#20102;&#35748;&#30693;&#21162;&#21147;&#65292;&#24182;&#19988;&#26356;&#22823;&#30340;&#21162;&#21147;&#25552;&#39640;&#20102;&#34920;&#29616;&#65292;&#24182;&#19988;&#39044;&#27979;&#20102;&#36873;&#25321;&#21644;&#20449;&#24565;&#30340;&#22797;&#26434;&#24615;&#12290;&#24635;&#30340;&#26469;&#35828;&#65292;&#25968;&#25454;&#25903;&#25345;&#23558;&#20381;&#36182;&#20110;&#22238;&#25253;&#30340;&#38169;&#35823;&#19982;&#26114;&#36149;&#30340;&#25512;&#29702;&#30456;&#32467;&#21512;&#12290;
&lt;/p&gt;
&lt;p&gt;
How and why do incentive levels affect strategic behavior? This paper examines an experiment designed to identify the causal effect of scaling up incentives on choices and beliefs in strategic settings by holding fixed opponents' actions. In dominance-solvable games, higher incentives increase action sophistication and best-response rates and decrease mistake propensity. Beliefs tend to become more accurate with higher own incentives in simple games. However, opponents with higher incentive levels are harder to predict: while beliefs track opponents' behavior when they have higher incentive levels, beliefs about opponents also become more biased. We provide evidence that incentives affect cognitive effort and that greater effort increases performance and predicts choice and belief sophistication. Overall, the data lends support to combining both payoff-dependent mistakes and costly reasoning.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#19968;&#31181;&#39640;&#25928;&#30340;&#27807;&#36890;&#21327;&#35758;&#65292;&#23637;&#31034;&#20102;&#8220;&#20844;&#20849;&#20513;&#23548;&#8221;&#26159;&#21807;&#19968;&#30340;&#39640;&#25928;&#27807;&#36890;&#21327;&#35758;&#65292;&#24182;&#19988;&#25552;&#20379;&#20102;&#19968;&#20010;&#26032;&#30340;&#29702;&#35770;&#22522;&#30784;&#12290;</title><link>http://arxiv.org/abs/2211.13605</link><description>&lt;p&gt;
&#32452;&#32455;&#20013;&#30340;&#26377;&#25928;&#27807;&#36890;
&lt;/p&gt;
&lt;p&gt;
Efficient Communication in Organizations. (arXiv:2211.13605v2 [econ.TH] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2211.13605
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#19968;&#31181;&#39640;&#25928;&#30340;&#27807;&#36890;&#21327;&#35758;&#65292;&#23637;&#31034;&#20102;&#8220;&#20844;&#20849;&#20513;&#23548;&#8221;&#26159;&#21807;&#19968;&#30340;&#39640;&#25928;&#27807;&#36890;&#21327;&#35758;&#65292;&#24182;&#19988;&#25552;&#20379;&#20102;&#19968;&#20010;&#26032;&#30340;&#29702;&#35770;&#22522;&#30784;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#32452;&#32455;&#35774;&#35745;&#20854;&#27807;&#36890;&#32467;&#26500;&#20197;&#25913;&#21892;&#20915;&#31574;&#24182;&#38480;&#21046;&#28010;&#36153;&#30340;&#24433;&#21709;&#27963;&#21160;&#12290;&#19968;&#31181;&#39640;&#25928;&#30340;&#27807;&#36890;&#21327;&#35758;&#21487;&#20197;&#20026;&#32452;&#32455;&#20013;&#30340;&#25152;&#26377;&#25104;&#21592;&#25552;&#20379;&#23436;&#20840;&#20449;&#24687;&#25253;&#37228;&#65292;&#20174;&#32780;&#20811;&#26381;&#19981;&#23545;&#31216;&#20449;&#24687;&#38382;&#39064;&#32780;&#19981;&#20135;&#29983;&#25104;&#26412;&#12290;&#26412;&#25991;&#20551;&#23450;&#65306;(i)&#32452;&#32455;&#20869;&#30340;&#19968;&#20123;&#20195;&#29702;&#20154;&#20855;&#26377;&#36827;&#34892;&#26368;&#20248;&#20915;&#31574;&#25152;&#38656;&#30340;&#30693;&#35782;; (ii)&#32452;&#32455;&#21644;&#34987;&#21672;&#35810;&#30340;&#20195;&#29702;&#20154;&#37117;&#20250;&#20135;&#29983;&#19982;&#21457;&#25381;&#24433;&#21709;&#27963;&#21160;&#25104;&#27604;&#20363;&#30340;&#25439;&#22833;; (iii)&#30693;&#24773;&#20195;&#29702;&#21487;&#20197;&#22312;&#34987;&#21672;&#35810;&#20043;&#21069;&#35752;&#35770;&#20182;&#20204;&#30340;&#31574;&#30053; &#12290;&#22312;&#36825;&#20123;&#20551;&#35774;&#19979;&#65292;&#8220;&#20844;&#20849;&#20513;&#23548;&#8221;&#26159;&#21807;&#19968;&#30340;&#39640;&#25928;&#27807;&#36890;&#21327;&#35758;&#12290;&#36825;&#19968;&#32467;&#26524;&#20026;&#20844;&#20849;&#20513;&#23548;&#25552;&#20379;&#20102;&#26032;&#30340;&#29702;&#35770;&#22522;&#30784;&#12290;
&lt;/p&gt;
&lt;p&gt;
Organizations design their communication structures to improve decision-making while limiting wasteful influence activities. An efficient communication protocol grants complete-information payoffs to all organization members, thereby overcoming asymmetric information problems at no cost. This paper characterizes efficient protocols assuming that: (i) some agents within the organization have the knowledge required for optimal decision-making; (ii) both the organization and consulted agents incur losses proportional to the exerted influence activities; and (iii) informed agents can discuss their strategies before being consulted. Under these assumptions, "public advocacy" is the unique efficient communication protocol. This result provides a novel rationale for public advocacy.
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#21407;&#21017;&#30340;&#39044;&#27979;&#21306;&#38388;&#26041;&#27861;&#65292;&#29992;&#20110;&#37327;&#21270;&#21512;&#25104;&#23545;&#29031;&#39044;&#27979;&#25110;&#20272;&#35745;&#22312;&#38169;&#20301;&#22788;&#29702;&#37319;&#29992;&#30340;&#24773;&#20917;&#19979;&#30340;&#19981;&#30830;&#23450;&#24615;&#12290;</title><link>http://arxiv.org/abs/2210.05026</link><description>&lt;p&gt;
&#24102;&#26377;&#38169;&#20301;&#22788;&#29702;&#37319;&#29992;&#30340;&#21512;&#25104;&#23545;&#29031;&#20013;&#30340;&#19981;&#30830;&#23450;&#24615;&#37327;&#21270;
&lt;/p&gt;
&lt;p&gt;
Uncertainty Quantification in Synthetic Controls with Staggered Treatment Adoption. (arXiv:2210.05026v2 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2210.05026
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#21407;&#21017;&#30340;&#39044;&#27979;&#21306;&#38388;&#26041;&#27861;&#65292;&#29992;&#20110;&#37327;&#21270;&#21512;&#25104;&#23545;&#29031;&#39044;&#27979;&#25110;&#20272;&#35745;&#22312;&#38169;&#20301;&#22788;&#29702;&#37319;&#29992;&#30340;&#24773;&#20917;&#19979;&#30340;&#19981;&#30830;&#23450;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#22522;&#20110;&#21407;&#21017;&#30340;&#39044;&#27979;&#21306;&#38388;&#65292;&#29992;&#20110;&#37327;&#21270;&#22312;&#38169;&#20301;&#22788;&#29702;&#37319;&#29992;&#30340;&#24773;&#20917;&#19979;&#22823;&#31867;&#21512;&#25104;&#23545;&#29031;&#39044;&#27979;&#25110;&#20272;&#35745;&#30340;&#19981;&#30830;&#23450;&#24615;&#65292;&#25552;&#20379;&#31934;&#30830;&#30340;&#38750;&#28176;&#36817;&#35206;&#30422;&#27010;&#29575;&#20445;&#35777;&#12290;&#20174;&#26041;&#27861;&#35770;&#30340;&#35282;&#24230;&#26469;&#30475;&#65292;&#25105;&#20204;&#25552;&#20379;&#20102;&#23545;&#38656;&#35201;&#39044;&#27979;&#30340;&#19981;&#21516;&#22240;&#26524;&#37327;&#36827;&#34892;&#35814;&#32454;&#35752;&#35770;&#65292;&#25105;&#20204;&#31216;&#20854;&#20026;&#8220;&#22240;&#26524;&#39044;&#27979;&#37327;&#8221;&#65292;&#20801;&#35768;&#22312;&#21487;&#33021;&#19981;&#21516;&#26102;&#21051;&#36827;&#34892;&#22810;&#20010;&#22788;&#29702;&#21333;&#20803;&#30340;&#22788;&#29702;&#37319;&#29992;&#12290;&#20174;&#29702;&#35770;&#30340;&#35282;&#24230;&#26469;&#30475;&#65292;&#25105;&#20204;&#30340;&#19981;&#30830;&#23450;&#24615;&#37327;&#21270;&#26041;&#27861;&#25552;&#39640;&#20102;&#20043;&#21069;&#25991;&#29486;&#30340;&#27700;&#24179;&#65292;&#20855;&#20307;&#34920;&#29616;&#22312;&#65306;&#65288;i&#65289;&#35206;&#30422;&#20102;&#38169;&#20301;&#37319;&#29992;&#35774;&#32622;&#20013;&#30340;&#22823;&#31867;&#22240;&#26524;&#39044;&#27979;&#37327;&#65292;&#65288;ii&#65289;&#20801;&#35768;&#20855;&#26377;&#21487;&#33021;&#38750;&#32447;&#24615;&#32422;&#26463;&#30340;&#21512;&#25104;&#23545;&#29031;&#26041;&#27861;&#65292;&#65288;iii&#65289;&#25552;&#20986;&#21487;&#25193;&#23637;&#30340;&#40065;&#26834;&#38181;&#20248;&#21270;&#26041;&#27861;&#21644;&#22522;&#20110;&#21407;&#21017;&#30340;&#25968;&#25454;&#39537;&#21160;&#35843;&#21442;&#36873;&#25321;&#65292;&#65288;iv&#65289;&#25552;&#20379;&#20102;&#22312;&#21518;&#22788;&#29702;&#26399;&#38388;&#36827;&#34892;&#26377;&#25928;&#22343;&#21248;&#25512;&#26029;&#12290;&#25105;&#20204;&#36890;&#36807;&#23454;&#35777;&#24212;&#29992;&#23637;&#31034;&#20102;&#25105;&#20204;&#30340;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
We propose principled prediction intervals to quantify the uncertainty of a large class of synthetic control predictions or estimators in settings with staggered treatment adoption, offering precise non-asymptotic coverage probability guarantees. From a methodological perspective, we provide a detailed discussion of different causal quantities to be predicted, which we call `causal predictands', allowing for multiple treated units with treatment adoption at possibly different points in time. From a theoretical perspective, our uncertainty quantification methods improve on prior literature by (i) covering a large class of causal predictands in staggered adoption settings, (ii) allowing for synthetic control methods with possibly nonlinear constraints, (iii) proposing scalable robust conic optimization methods and principled data-driven tuning parameter selection, and (iv) offering valid uniform inference across post-treatment periods. We illustrate our methodology with an empirical appl
&lt;/p&gt;</description></item></channel></rss>