<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#35770;&#25991;&#25506;&#35752;&#20102;&#21738;&#20123;&#26426;&#21046;&#23481;&#26131;&#25805;&#20316;&#20197;&#21450;&#22914;&#20309;&#20351;&#21442;&#19982;&#32773;&#33021;&#22815;&#36731;&#26494;&#30475;&#20986;&#19968;&#20010;&#26426;&#21046;&#26159;&#28608;&#21169;&#30456;&#23481;&#30340;&#65292;&#24182;&#24635;&#32467;&#20102;&#19977;&#20010;&#19981;&#21516;&#26041;&#38754;&#20351;&#26426;&#21046;&#31616;&#21333;&#30340;&#26368;&#26032;&#31572;&#26696;&#12290;</title><link>https://arxiv.org/abs/2403.18694</link><description>&lt;p&gt;
&#35774;&#35745;&#31616;&#21333;&#26426;&#21046;
&lt;/p&gt;
&lt;p&gt;
Designing Simple Mechanisms
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.18694
&lt;/p&gt;
&lt;p&gt;
&#35770;&#25991;&#25506;&#35752;&#20102;&#21738;&#20123;&#26426;&#21046;&#23481;&#26131;&#25805;&#20316;&#20197;&#21450;&#22914;&#20309;&#20351;&#21442;&#19982;&#32773;&#33021;&#22815;&#36731;&#26494;&#30475;&#20986;&#19968;&#20010;&#26426;&#21046;&#26159;&#28608;&#21169;&#30456;&#23481;&#30340;&#65292;&#24182;&#24635;&#32467;&#20102;&#19977;&#20010;&#19981;&#21516;&#26041;&#38754;&#20351;&#26426;&#21046;&#31616;&#21333;&#30340;&#26368;&#26032;&#31572;&#26696;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21738;&#20123;&#26426;&#21046;&#23481;&#26131;&#25805;&#20316;&#65311;&#21442;&#19982;&#32773;&#20309;&#26102;&#33021;&#22815;&#36731;&#26494;&#22320;&#30475;&#21040;&#19968;&#20010;&#26426;&#21046;&#26159;&#28608;&#21169;&#30456;&#23481;&#30340;&#65311;&#25105;&#23558;&#20174;&#32463;&#27982;&#23398;&#23478;&#26159;&#22914;&#20309;&#25552;&#20986;&#36825;&#20123;&#38382;&#39064;&#30340;&#35282;&#24230;&#20837;&#25163;&#12290;&#28982;&#21518;&#25105;&#23558;&#35752;&#35770;&#19977;&#20010;&#26368;&#36817;&#24471;&#21040;&#30340;&#31572;&#26696;&#65292;&#28085;&#30422;&#20102;&#20351;&#26426;&#21046;&#31616;&#21333;&#30340;&#19981;&#21516;&#26041;&#38754;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.18694v1 Announce Type: new  Abstract: Which mechanisms are simple to play? When is it easy for participants to see that a mechanism is incentive-compatible? I will start by explaining how and why economists came to ask these questions. Then I will discuss three recent answers, that capture different aspects of what makes a mechanism simple.
&lt;/p&gt;</description></item><item><title>&#36825;&#39033;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#20989;&#25968;&#21487;&#24494;&#26041;&#27861;&#26469;&#35299;&#20915;&#32479;&#35745;&#26368;&#20248;&#20998;&#37197;&#38382;&#39064;&#65292;&#36890;&#36807;&#23545;&#25490;&#24207;&#36816;&#31639;&#31526;&#30340;&#19968;&#33324;&#23646;&#24615;&#36827;&#34892;&#35814;&#32454;&#20998;&#26512;&#65292;&#25512;&#23548;&#20986;&#20540;&#20989;&#25968;&#30340;Hadamard&#21487;&#24494;&#24615;&#65292;&#24182;&#23637;&#31034;&#20102;&#22914;&#20309;&#21033;&#29992;&#20989;&#25968;&#20559;&#24494;&#20998;&#27861;&#30452;&#25509;&#25512;&#23548;&#20986;&#20540;&#20989;&#25968;&#36807;&#31243;&#30340;&#28176;&#36817;&#24615;&#36136;&#12290;</title><link>https://arxiv.org/abs/2403.18248</link><description>&lt;p&gt;
&#32479;&#35745;&#25512;&#26029;&#20013;&#30340;&#26368;&#20248;&#20998;&#37197;I&#65306;&#35268;&#24459;&#24615;&#21450;&#20854;&#24433;&#21709;
&lt;/p&gt;
&lt;p&gt;
Statistical Inference of Optimal Allocations I: Regularities and their Implications
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.18248
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#20989;&#25968;&#21487;&#24494;&#26041;&#27861;&#26469;&#35299;&#20915;&#32479;&#35745;&#26368;&#20248;&#20998;&#37197;&#38382;&#39064;&#65292;&#36890;&#36807;&#23545;&#25490;&#24207;&#36816;&#31639;&#31526;&#30340;&#19968;&#33324;&#23646;&#24615;&#36827;&#34892;&#35814;&#32454;&#20998;&#26512;&#65292;&#25512;&#23548;&#20986;&#20540;&#20989;&#25968;&#30340;Hadamard&#21487;&#24494;&#24615;&#65292;&#24182;&#23637;&#31034;&#20102;&#22914;&#20309;&#21033;&#29992;&#20989;&#25968;&#20559;&#24494;&#20998;&#27861;&#30452;&#25509;&#25512;&#23548;&#20986;&#20540;&#20989;&#25968;&#36807;&#31243;&#30340;&#28176;&#36817;&#24615;&#36136;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#36825;&#31687;&#35770;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#20110;&#35299;&#20915;&#32479;&#35745;&#26368;&#20248;&#20998;&#37197;&#38382;&#39064;&#30340;&#20989;&#25968;&#21487;&#24494;&#26041;&#27861;&#12290;&#36890;&#36807;&#23545;&#25490;&#24207;&#36816;&#31639;&#31526;&#30340;&#19968;&#33324;&#23646;&#24615;&#36827;&#34892;&#35814;&#32454;&#20998;&#26512;&#65292;&#25105;&#20204;&#39318;&#20808;&#25512;&#23548;&#20986;&#20102;&#20540;&#20989;&#25968;&#30340;Hadamard&#21487;&#24494;&#24615;&#12290;&#22312;&#25105;&#20204;&#30340;&#26694;&#26550;&#20013;&#65292;Hausdorff&#27979;&#24230;&#30340;&#27010;&#24565;&#20197;&#21450;&#20960;&#20309;&#27979;&#24230;&#35770;&#20013;&#30340;&#38754;&#31215;&#21644;&#20849;&#38754;&#31215;&#31215;&#20998;&#20844;&#24335;&#26159;&#26680;&#24515;&#12290;&#22522;&#20110;&#25105;&#20204;&#30340;Hadamard&#21487;&#24494;&#24615;&#32467;&#26524;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#22914;&#20309;&#21033;&#29992;&#20989;&#25968;&#20559;&#24494;&#20998;&#27861;&#30452;&#25509;&#25512;&#23548;&#20986;&#20108;&#20803;&#32422;&#26463;&#26368;&#20248;&#20998;&#37197;&#38382;&#39064;&#30340;&#20540;&#20989;&#25968;&#36807;&#31243;&#20197;&#21450;&#20004;&#27493;ROC&#26354;&#32447;&#20272;&#35745;&#37327;&#30340;&#28176;&#36817;&#24615;&#36136;&#12290;&#27492;&#22806;&#65292;&#21033;&#29992;&#23545;&#20984;&#21644;&#23616;&#37096;Lipschitz&#27867;&#20989;&#30340;&#28145;&#21051;&#35265;&#35299;&#65292;&#25105;&#20204;&#24471;&#21040;&#20102;&#26368;&#20248;&#20998;&#37197;&#38382;&#39064;&#30340;&#20540;&#20989;&#25968;&#30340;&#39069;&#22806;&#19968;&#33324;Frechet&#21487;&#24494;&#24615;&#32467;&#26524;&#12290;&#36825;&#20123;&#24341;&#20154;&#20837;&#32988;&#30340;&#21457;&#29616;&#28608;&#21169;&#20102;&#25105;&#20204;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.18248v1 Announce Type: new  Abstract: In this paper, we develp a functional differentiability approach for solving statistical optimal allocation problems. We first derive Hadamard differentiability of the value function through a detailed analysis of the general properties of the sorting operator. Central to our framework are the concept of Hausdorff measure and the area and coarea integration formulas from geometric measure theory. Building on our Hadamard differentiability results, we demonstrate how the functional delta method can be used to directly derive the asymptotic properties of the value function process for binary constrained optimal allocation problems, as well as the two-step ROC curve estimator. Moreover, leveraging profound insights from geometric functional analysis on convex and local Lipschitz functionals, we obtain additional generic Fr\'echet differentiability results for the value functions of optimal allocation problems. These compelling findings moti
&lt;/p&gt;</description></item><item><title>&#24503;&#22269;&#30005;&#21147;&#24066;&#22330;&#30740;&#31350;&#20102;&#21306;&#22495;&#21644;&#33410;&#28857;&#23450;&#20215;&#27169;&#22411;&#30340;&#27604;&#36739;&#65292;&#21457;&#29616;&#19981;&#21516;&#37197;&#32622;&#19979;&#30340;&#24179;&#22343;&#20215;&#26684;&#24046;&#24322;&#23567;&#65292;&#24635;&#25104;&#26412;&#30456;&#20284;&#12290;</title><link>https://arxiv.org/abs/2403.09265</link><description>&lt;p&gt;
&#21306;&#22495;vs. &#33410;&#28857;&#23450;&#20215;&#65306;&#24503;&#22269;&#26085;&#21069;&#24066;&#22330;&#19981;&#21516;&#23450;&#20215;&#35268;&#21017;&#30340;&#20998;&#26512;
&lt;/p&gt;
&lt;p&gt;
Zonal vs. Nodal Pricing: An Analysis of Different Pricing Rules in the German Day-Ahead Market
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.09265
&lt;/p&gt;
&lt;p&gt;
&#24503;&#22269;&#30005;&#21147;&#24066;&#22330;&#30740;&#31350;&#20102;&#21306;&#22495;&#21644;&#33410;&#28857;&#23450;&#20215;&#27169;&#22411;&#30340;&#27604;&#36739;&#65292;&#21457;&#29616;&#19981;&#21516;&#37197;&#32622;&#19979;&#30340;&#24179;&#22343;&#20215;&#26684;&#24046;&#24322;&#23567;&#65292;&#24635;&#25104;&#26412;&#30456;&#20284;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#27431;&#27954;&#30005;&#21147;&#24066;&#22330;&#22522;&#20110;&#25317;&#26377;&#32479;&#19968;&#26085;&#21069;&#20215;&#26684;&#30340;&#22823;&#22411;&#23450;&#20215;&#21306;&#22495;&#12290;&#33021;&#28304;&#36716;&#22411;&#23548;&#33268;&#20379;&#38656;&#21464;&#21270;&#21644;&#20877;&#35843;&#24230;&#25104;&#26412;&#22686;&#21152;&#12290;&#20026;&#20102;&#30830;&#20445;&#24066;&#22330;&#28165;&#31639;&#39640;&#25928;&#21644;&#25317;&#22622;&#31649;&#29702;&#65292;&#27431;&#30431;&#22996;&#21592;&#20250;&#22996;&#25176;&#36827;&#34892;&#20986;&#20215;&#21306;&#22495;&#23457;&#26597;&#65288;BZR&#65289;&#20197;&#37325;&#26032;&#35780;&#20272;&#27431;&#27954;&#20986;&#20215;&#21306;&#22495;&#30340;&#37197;&#32622;&#12290;&#22522;&#20110;BZR&#32972;&#26223;&#19979;&#20844;&#24067;&#30340;&#29420;&#29305;&#25968;&#25454;&#38598;&#65292;&#25105;&#20204;&#27604;&#36739;&#20102;&#24503;&#22269;&#30005;&#21147;&#24066;&#22330;&#30340;&#21508;&#31181;&#23450;&#20215;&#35268;&#21017;&#12290;&#25105;&#20204;&#27604;&#36739;&#20102;&#22269;&#20869;&#12289;&#21306;&#22495;&#21644;&#33410;&#28857;&#27169;&#22411;&#30340;&#24066;&#22330;&#28165;&#31639;&#21644;&#23450;&#20215;&#65292;&#21253;&#25324;&#23427;&#20204;&#30340;&#21457;&#30005;&#25104;&#26412;&#21644;&#30456;&#20851;&#30340;&#20877;&#35843;&#24230;&#25104;&#26412;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#19981;&#21516;&#30340;&#38750;&#32479;&#19968;&#23450;&#20215;&#35268;&#21017;&#21450;&#20854;&#23545;&#24503;&#22269;&#30005;&#21147;&#24066;&#22330;&#30340;&#32463;&#27982;&#24433;&#21709;&#12290;&#25105;&#20204;&#30340;&#32467;&#26524;&#34920;&#26126;&#65292;&#19981;&#21516;&#21306;&#22495;&#30340;&#24179;&#22343;&#20215;&#26684;&#24046;&#24322;&#36739;&#23567;&#12290;&#19981;&#21516;&#37197;&#32622;&#19979;&#30340;&#24635;&#25104;&#26412;&#30456;&#20284;&#65292;&#38477;&#20302;&#20102;...
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.09265v1 Announce Type: new  Abstract: The European electricity market is based on large pricing zones with a uniform day-ahead price. The energy transition leads to shifts in supply and demand and increasing redispatch costs. In an attempt to ensure efficient market clearing and congestion management, the EU Commission has mandated the Bidding Zone Review (BZR) to reevaluate the configuration of European bidding zones. Based on a unique data set published in the context of the BZR, we compare various pricing rules for the German power market. We compare market clearing and pricing for national, zonal, and nodal models, including their generation costs and associated redispatch costs. Moreover, we investigate different non-uniform pricing rules and their economic implications for the German electricity market. Our results indicate that the differences in the average prices in different zones are small. The total costs across different configurations are similar and the reduct
&lt;/p&gt;</description></item><item><title>&#32463;&#27982;&#22797;&#26434;&#24615;&#38480;&#21046;&#20102;&#21033;&#29992;&#39640;&#26031;&#20998;&#24067;&#36827;&#34892;&#20215;&#26684;&#27010;&#29575;&#39044;&#27979;&#30340;&#20934;&#30830;&#24615;&#65292;&#22240;&#20026;&#39044;&#27979;&#38656;&#35201;&#23545;&#32463;&#27982;&#21464;&#37327;&#36827;&#34892;&#25551;&#36848;&#65292;&#32780;&#36825;&#20123;&#21464;&#37327;&#30340;&#32479;&#35745;&#30697;&#38656;&#35201;&#23545;&#32463;&#27982;&#25110;&#24066;&#22330;&#20132;&#26131;&#30340;&#24130;&#27425;&#36827;&#34892;&#35745;&#31639;&#12290;</title><link>http://arxiv.org/abs/2309.02447</link><description>&lt;p&gt;
&#39640;&#26031;&#20998;&#24067;&#22312;&#20215;&#26684;&#27010;&#29575;&#39044;&#27979;&#20013;&#30340;&#32463;&#27982;&#22797;&#26434;&#24615;&#38480;&#21046;
&lt;/p&gt;
&lt;p&gt;
Economic Complexity Limits Accuracy of Price Probability Predictions by Gaussian Distributions. (arXiv:2309.02447v1 [q-fin.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.02447
&lt;/p&gt;
&lt;p&gt;
&#32463;&#27982;&#22797;&#26434;&#24615;&#38480;&#21046;&#20102;&#21033;&#29992;&#39640;&#26031;&#20998;&#24067;&#36827;&#34892;&#20215;&#26684;&#27010;&#29575;&#39044;&#27979;&#30340;&#20934;&#30830;&#24615;&#65292;&#22240;&#20026;&#39044;&#27979;&#38656;&#35201;&#23545;&#32463;&#27982;&#21464;&#37327;&#36827;&#34892;&#25551;&#36848;&#65292;&#32780;&#36825;&#20123;&#21464;&#37327;&#30340;&#32479;&#35745;&#30697;&#38656;&#35201;&#23545;&#32463;&#27982;&#25110;&#24066;&#22330;&#20132;&#26131;&#30340;&#24130;&#27425;&#36827;&#34892;&#35745;&#31639;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20215;&#26684;&#21644;&#22238;&#25253;&#27010;&#29575;&#39044;&#27979;&#30340;&#20934;&#30830;&#24615;&#22312;&#36164;&#20135;&#23450;&#20215;&#21644;&#25237;&#36164;&#32452;&#21512;&#29702;&#35770;&#30340;&#21487;&#38752;&#24615;&#20013;&#20855;&#26377;&#37325;&#35201;&#20316;&#29992;&#12290;&#25105;&#20204;&#24320;&#21457;&#20102;&#36880;&#27493;&#36924;&#36817;&#30340;&#26041;&#27861;&#65292;&#23558;&#25972;&#20010;&#32929;&#24066;&#30340;&#24066;&#22330;&#27010;&#29575;&#39044;&#27979;&#19982;&#29305;&#23450;&#20844;&#21496;&#32929;&#31080;&#30340;&#20215;&#26684;&#21644;&#22238;&#25253;&#27010;&#29575;&#39044;&#27979;&#30456;&#36830;&#25509;&#65292;&#21516;&#26102;&#20063;&#23637;&#31034;&#20102;&#32463;&#27982;&#22797;&#26434;&#24615;&#38480;&#21046;&#20102;&#20219;&#20309;&#39044;&#27979;&#30340;&#20934;&#30830;&#24615;&#12290;&#36825;&#31181;&#38480;&#21046;&#30340;&#32463;&#27982;&#26681;&#28304;&#22312;&#20110;&#20215;&#26684;&#21644;&#22238;&#25253;&#30340;&#32479;&#35745;&#30697;&#38656;&#35201;&#23545;&#32463;&#27982;&#21464;&#37327;&#36827;&#34892;&#25551;&#36848;&#65292;&#36825;&#20123;&#21464;&#37327;&#26159;&#22312;&#24179;&#22343;&#26102;&#38388;&#38388;&#38548;&#20869;&#32463;&#27982;&#25110;&#24066;&#22330;&#20132;&#26131;&#30340;m&#27425;&#24130;&#20043;&#21644;&#12290;&#35797;&#22270;&#39044;&#27979;&#21463;&#21333;&#19968;&#39118;&#38505;&#24433;&#21709;&#30340;&#32929;&#31080;&#30340;&#31532;n&#20010;&#32479;&#35745;&#30697;&#20250;&#23548;&#33268;&#23545;&#32463;&#27982;&#20027;&#20307;&#30340;n&#32500;&#39118;&#38505;&#35780;&#32423;&#21521;&#37327;&#36827;&#34892;&#20272;&#35745;&#12290;&#32780;&#36825;&#20123;&#39118;&#38505;&#35780;&#32423;&#21521;&#37327;&#36215;&#21040;&#20102;&#22352;&#26631;&#30340;&#20316;&#29992;
&lt;/p&gt;
&lt;p&gt;
The accuracy of predictions of price and return probabilities substantially determines the reliability of asset pricing and portfolio theories. We develop successive approximations that link up predictions of the market-based probabilities of price and return for the whole stock market with predictions of price and return probabilities for stocks of a particular company and show that economic complexity limits the accuracy of any forecasts. The economic origin of the restrictions lies in the fact that the predictions of the m-th statistical moments of price and return require descriptions of the economic variables composed by sums of the m-th powers of economic or market transactions during an averaging time interval. The attempts to predict the n-th statistical moments of price and return of stocks that are under the action of a single risk result in estimates of the n-dimensional risk rating vectors for economic agents. In turn, the risk rating vectors play the role of coordinates fo
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#23545;&#23450;&#37327;&#34913;&#37327;&#21516;&#36136;&#20135;&#19994;&#20869;&#36164;&#28304;&#38169;&#37197;&#30340;&#24120;&#35268;&#26041;&#27861;&#36827;&#34892;&#20102;&#37325;&#26032;&#35780;&#20272;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#24050;&#35782;&#21035;&#30340;&#25919;&#31574;&#21464;&#21270;&#30340;&#27604;&#36739;&#20998;&#26512;&#31574;&#30053;&#12290;&#30740;&#31350;&#34920;&#26126;&#65292;&#37329;&#34701;&#21361;&#26426;&#23545;&#29983;&#20135;&#35201;&#32032;&#30340;&#24433;&#21709;&#23548;&#33268;&#36164;&#28304;&#37197;&#32622;&#20005;&#37325;&#22833;&#35843;&#65292;&#32780;&#25919;&#31574;&#24178;&#39044;&#21487;&#33021;&#20250;&#25439;&#23475;&#25972;&#20307;&#32463;&#27982;&#25928;&#29575;&#12290;</title><link>http://arxiv.org/abs/2306.08760</link><description>&lt;p&gt;
&#29983;&#20135;&#29575;&#12289;&#35201;&#32032;&#38169;&#37197;&#19982;&#37329;&#34701;&#21361;&#26426;
&lt;/p&gt;
&lt;p&gt;
Productivity, Inputs Misallocation, and the Financial Crisis. (arXiv:2306.08760v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.08760
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#23545;&#23450;&#37327;&#34913;&#37327;&#21516;&#36136;&#20135;&#19994;&#20869;&#36164;&#28304;&#38169;&#37197;&#30340;&#24120;&#35268;&#26041;&#27861;&#36827;&#34892;&#20102;&#37325;&#26032;&#35780;&#20272;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#24050;&#35782;&#21035;&#30340;&#25919;&#31574;&#21464;&#21270;&#30340;&#27604;&#36739;&#20998;&#26512;&#31574;&#30053;&#12290;&#30740;&#31350;&#34920;&#26126;&#65292;&#37329;&#34701;&#21361;&#26426;&#23545;&#29983;&#20135;&#35201;&#32032;&#30340;&#24433;&#21709;&#23548;&#33268;&#36164;&#28304;&#37197;&#32622;&#20005;&#37325;&#22833;&#35843;&#65292;&#32780;&#25919;&#31574;&#24178;&#39044;&#21487;&#33021;&#20250;&#25439;&#23475;&#25972;&#20307;&#32463;&#27982;&#25928;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#37325;&#26032;&#35780;&#20272;&#20102;&#23450;&#37327;&#34913;&#37327;&#21516;&#36136;&#20135;&#19994;&#20869;&#36164;&#28304;&#38169;&#37197;&#30340;&#24120;&#35268;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#36890;&#24120;&#20351;&#29992;&#19968;&#20010;&#36755;&#20837;&#36793;&#38469;&#20135;&#21697;&#30340;&#31163;&#25955;&#24230;&#26469;&#34913;&#37327;&#12290;&#25105;&#30340;&#30740;&#31350;&#21457;&#29616;&#65292;&#36825;&#19968;&#32479;&#35745;&#37327;&#21253;&#25324;&#22266;&#26377;&#30340;&#29983;&#20135;&#29575;&#24322;&#36136;&#24615;&#21644;&#29305;&#26377;&#30340;&#29983;&#20135;&#29575;&#20914;&#20987;&#65292;&#32780;&#19981;&#32771;&#34385;&#25152;&#30740;&#31350;&#30340;&#36755;&#20837;&#12290;&#21033;&#29992;&#32654;&#22269;&#21644;&#27431;&#27954;&#21046;&#36896;&#19994;&#20844;&#21496;&#30340;&#36164;&#20135;&#36127;&#20538;&#34920;&#25968;&#25454;&#65292;&#25105;&#21457;&#29616;&#24635;&#29983;&#20135;&#35201;&#32032;&#29983;&#20135;&#29575;&#27874;&#21160;&#20540;&#21344;&#36164;&#26412;&#36793;&#38469;&#20135;&#21697;&#30340;&#26041;&#24046;&#30340;7&#65285;&#65292;&#21171;&#21160;&#21147;&#20026;9&#65285;&#65292;&#26448;&#26009;&#36755;&#20837;&#20026;10&#65285;&#12290;&#22240;&#27492;&#65292;&#36825;&#20010;&#25351;&#25968;&#20197;&#34920;&#38754;&#20215;&#20540;&#34920;&#31034;&#26102;&#65292;&#26080;&#27861;&#35782;&#21035;&#20986;&#20219;&#20309;&#29983;&#20135;&#35201;&#32032;&#30340;&#25919;&#31574;&#24341;&#21457;&#30340;&#38169;&#37197;&#12290;&#20026;&#20102;&#20811;&#26381;&#36825;&#19968;&#23616;&#38480;&#24615;&#65292;&#25105;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#24050;&#35782;&#21035;&#30340;&#25919;&#31574;&#21464;&#21270;&#30340;&#27604;&#36739;&#20998;&#26512;&#31574;&#30053;&#12290;&#36825;&#31181;&#26041;&#27861;&#20801;&#35768;&#30740;&#31350;&#20154;&#21592;&#22312;&#30456;&#23545;&#30340;&#26465;&#20214;&#19979;&#35780;&#20272;&#35825;&#23548;&#22833;&#37197;&#65292;&#21516;&#26102;&#25511;&#21046;TFP&#27874;&#21160;&#24615;&#30340;&#24046;&#24322;&#12290;&#25105;&#21457;&#29616;&#37329;&#34701;&#21361;&#26426;&#23545;&#29983;&#20135;&#35201;&#32032;&#30340;&#24433;&#21709;&#26159;&#19981;&#22343;&#34913;&#30340;&#65292;&#23548;&#33268;&#36164;&#28304;&#37197;&#32622;&#20005;&#37325;&#22833;&#35843;&#12290;&#36890;&#36807;&#27604;&#36739;&#19981;&#21516;&#22320;&#21306;&#21644;&#34892;&#19994;&#30340;&#37329;&#34701;&#21361;&#26426;&#21069;&#21644;&#37329;&#34701;&#21361;&#26426;&#26399;&#38388;&#65292;&#32463;&#27982;&#37329;&#34701;&#29615;&#22659;&#31283;&#23450;&#30340;&#24773;&#20917;&#65292;&#25105;&#21457;&#29616;&#37329;&#34701;&#21361;&#26426;&#23545;&#21046;&#36896;&#19994;&#30340;&#36127;&#38754;&#24433;&#21709;&#27604;&#26381;&#21153;&#19994;&#26356;&#20026;&#26126;&#26174;&#65292;&#23545;&#27431;&#27954;&#19994;&#21153;&#26356;&#20026;&#20005;&#37325;&#65292;&#32780;&#19988;&#36825;&#31181;&#22833;&#35843;&#26159;&#30001;&#20110;&#37329;&#34701;&#32039;&#32553;&#25919;&#31574;&#24341;&#36215;&#30340;&#12290;&#36825;&#19968;&#30740;&#31350;&#34920;&#26126;&#65292;&#25919;&#31574;&#24178;&#39044;&#21487;&#33021;&#20250;&#23548;&#33268;&#36164;&#28304;&#37197;&#32622;&#22833;&#35843;&#65292;&#25439;&#23475;&#25972;&#20307;&#32463;&#27982;&#25928;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper reevaluates the conventional approach to quantifying within-industry resource misallocation, typically measured by the dispersion of an input marginal product. My findings suggest that this statistic incorporates inherent productivity heterogeneity and idiosyncratic productivity shocks, irrespective of the input under scrutiny. Using balance sheet data from American and European manufacturing firms, I show that total factor productivity (TFP) volatility accounts for 7% of the variance in the marginal product of capital, 9% for labor, and 10% for material inputs. Consequently, this index, taken at face value, fails to identify policy-induced misallocation for any production input. To overcome this limitation, I propose a comparative analysis strategy driven by an identified policy variation. This approach allows the researcher to assess induced misallocation in relative terms whilst controlling for differences in TFP volatility. I show that the financial crisis had an uneven 
&lt;/p&gt;</description></item><item><title>SPAC&#20013;&#30340;&#20248;&#36136;&#25237;&#36164;&#32773;&#21442;&#19982;&#21487;&#20197;&#21019;&#36896;&#20215;&#20540;&#65292;&#38750;&#20248;&#36136;&#25237;&#36164;&#32773;&#21017;&#20165;&#21442;&#19982;&#20132;&#25442;&#26465;&#20214;&#23433;&#25490;&#65292;&#36825;&#19981;&#20165;&#20165;&#26159;&#20195;&#29702;&#25104;&#26412;&#36824;&#33021;&#20351;&#26356;&#22810;&#20844;&#21496;&#19978;&#24066;&#12290;</title><link>http://arxiv.org/abs/2211.16643</link><description>&lt;p&gt;
SPAC&#30340;&#21457;&#34892;&#12289;&#26426;&#26500;&#25237;&#36164;&#32773;&#21644;&#20132;&#25442;&#26465;&#20214;&#65306;&#27934;&#23519;&#21147;
&lt;/p&gt;
&lt;p&gt;
Security Issuance, Institutional Investors and Quid Pro Quo: Insights from SPACs. (arXiv:2211.16643v3 [q-fin.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2211.16643
&lt;/p&gt;
&lt;p&gt;
SPAC&#20013;&#30340;&#20248;&#36136;&#25237;&#36164;&#32773;&#21442;&#19982;&#21487;&#20197;&#21019;&#36896;&#20215;&#20540;&#65292;&#38750;&#20248;&#36136;&#25237;&#36164;&#32773;&#21017;&#20165;&#21442;&#19982;&#20132;&#25442;&#26465;&#20214;&#23433;&#25490;&#65292;&#36825;&#19981;&#20165;&#20165;&#26159;&#20195;&#29702;&#25104;&#26412;&#36824;&#33021;&#20351;&#26356;&#22810;&#20844;&#21496;&#19978;&#24066;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35777;&#21048;&#21457;&#34892;&#21463;&#20449;&#24687;&#21644;&#20195;&#29702;&#25104;&#26412;&#30340;&#24433;&#21709;&#12290;&#28982;&#32780;&#65292;&#24456;&#38590;&#23558;&#23427;&#20204;&#20998;&#24320;&#32771;&#34385;&#12290;&#25105;&#20204;&#32771;&#34385;SPAC&#24182;&#20998;&#21035;&#35780;&#20272;&#36825;&#20123;&#24433;&#21709;&#12290;&#20026;&#27492;&#65292;&#25105;&#20204;&#30830;&#23450;&#20135;&#29983;&#20215;&#20540;&#30456;&#20851;&#20449;&#24687;&#30340;&#20248;&#36136;&#25237;&#36164;&#32773;&#65306;&#20182;&#20204;&#30340;&#21442;&#19982;&#19982;&#26356;&#39640;&#30340;SPAC&#25104;&#21151;&#21644;&#20844;&#21578;&#26085;&#22238;&#25253;&#30456;&#20851;&#12290;&#28982;&#32780;&#65292;&#38750;&#20248;&#36136;&#25237;&#36164;&#32773;&#20165;&#21442;&#19982;&#20132;&#25442;&#26465;&#20214;&#23433;&#25490;&#12290;&#20182;&#20204;&#20170;&#22825;&#20174;&#21457;&#34892;&#20154;&#65288;&#20248;&#24800;&#65289;&#33719;&#24471;&#39640;&#22238;&#25253;&#65292;&#36825;&#24847;&#21619;&#30528;&#20182;&#20204;&#26356;&#26377;&#21487;&#33021;&#21442;&#19982;&#30001;&#36825;&#20123;&#21457;&#34892;&#20154;&#21457;&#36215;&#30340;&#20302;&#22238;&#25253;&#26410;&#26469;&#20132;&#26131;&#65288;&#26465;&#20214;&#65289;&#12290;&#22240;&#27492;&#65292;&#20132;&#25442;&#26465;&#20214;&#19981;&#26159;&#32431;&#20195;&#29702;&#25104;&#26412;&#65292;&#32780;&#26159;&#37096;&#20998;&#20351;&#26356;&#22810;&#30340;&#20844;&#21496;&#19978;&#24066;&#30340;&#36716;&#31227;&#12290;
&lt;/p&gt;
&lt;p&gt;
Security issuance is subject to informational and agency-related frictions. However, it is difficult to separate their effects. We consider SPACs and assess those effects separately. To this end, we identify premium investors who produce value-relevant information: their participation is associated with higher SPAC success and announcement-day returns. Non-premium investors, however, engage only in quid pro quo arrangements. Their high returns today from issuers (quid) mean they are more likely to participate in low-returns future deals initiated by those issuers (quo). Thus quid pro quo is not pure agency cost but partly a transfer that enables more firms to go public.
&lt;/p&gt;</description></item><item><title>&#35768;&#22810;&#23398;&#32773;&#21628;&#21505;&#25552;&#39640;&#32479;&#35745;&#38556;&#30861;&#26469;&#38450;&#27490;&#38169;&#35823;&#21457;&#29616;&#65292;&#20294;&#32463;&#39564;&#35777;&#26126;&#36825;&#20123;&#21628;&#21505;&#22312;&#23454;&#36341;&#20013;&#19981;&#22826;&#21512;&#29702;&#12290;&#24050;&#21457;&#34920;&#30340;&#25968;&#25454;&#23384;&#22312;&#20559;&#24046;&#65292;&#26410;&#35266;&#23519;&#21040;&#30340;&#32467;&#26524;&#38656;&#35201;&#22806;&#25512;&#65292;&#23548;&#33268;&#20462;&#35746;&#38556;&#30861;&#30340;&#35782;&#21035;&#33021;&#21147;&#19981;&#24378;&#12290;&#19982;&#20043;&#30456;&#21453;&#65292;&#21482;&#38024;&#23545;&#24050;&#21457;&#34920;&#30340;&#21457;&#29616;&#36827;&#34892;&#32479;&#35745;&#20998;&#26512;&#21487;&#20197;&#24471;&#21040;&#36739;&#24378;&#30340;&#35782;&#21035;&#33021;&#21147;&#12290;</title><link>http://arxiv.org/abs/2204.10275</link><description>&lt;p&gt;
&#26159;&#21542;&#38656;&#35201;&#25552;&#39640;t-&#32479;&#35745;&#38556;&#30861;&#65311;
&lt;/p&gt;
&lt;p&gt;
Do t-Statistic Hurdles Need to be Raised?. (arXiv:2204.10275v2 [q-fin.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2204.10275
&lt;/p&gt;
&lt;p&gt;
&#35768;&#22810;&#23398;&#32773;&#21628;&#21505;&#25552;&#39640;&#32479;&#35745;&#38556;&#30861;&#26469;&#38450;&#27490;&#38169;&#35823;&#21457;&#29616;&#65292;&#20294;&#32463;&#39564;&#35777;&#26126;&#36825;&#20123;&#21628;&#21505;&#22312;&#23454;&#36341;&#20013;&#19981;&#22826;&#21512;&#29702;&#12290;&#24050;&#21457;&#34920;&#30340;&#25968;&#25454;&#23384;&#22312;&#20559;&#24046;&#65292;&#26410;&#35266;&#23519;&#21040;&#30340;&#32467;&#26524;&#38656;&#35201;&#22806;&#25512;&#65292;&#23548;&#33268;&#20462;&#35746;&#38556;&#30861;&#30340;&#35782;&#21035;&#33021;&#21147;&#19981;&#24378;&#12290;&#19982;&#20043;&#30456;&#21453;&#65292;&#21482;&#38024;&#23545;&#24050;&#21457;&#34920;&#30340;&#21457;&#29616;&#36827;&#34892;&#32479;&#35745;&#20998;&#26512;&#21487;&#20197;&#24471;&#21040;&#36739;&#24378;&#30340;&#35782;&#21035;&#33021;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35768;&#22810;&#23398;&#32773;&#21628;&#21505;&#25552;&#39640;&#32479;&#35745;&#38556;&#30861;&#65292;&#20197;&#38450;&#27490;&#23398;&#26415;&#20986;&#29256;&#29289;&#20013;&#30340;&#38169;&#35823;&#21457;&#29616;&#12290;&#25105;&#23637;&#31034;&#20102;&#36825;&#20123;&#21628;&#21505;&#22312;&#32463;&#39564;&#19978;&#19981;&#22826;&#21487;&#33021;&#34987;&#35777;&#26126;&#25104;&#31435;&#12290;&#24050;&#21457;&#34920;&#30340;&#25968;&#25454;&#23384;&#22312;&#20559;&#24046;&#65306;&#26410;&#33021;&#36798;&#21040;&#29616;&#26377;&#38556;&#30861;&#30340;&#32467;&#26524;&#32463;&#24120;&#26159;&#19981;&#21487;&#35266;&#27979;&#30340;&#12290;&#36825;&#20123;&#26410;&#35266;&#23519;&#21040;&#30340;&#32467;&#26524;&#24517;&#39035;&#36827;&#34892;&#22806;&#25512;&#65292;&#23548;&#33268;&#20462;&#35746;&#38556;&#30861;&#30340;&#35782;&#21035;&#33021;&#21147;&#19981;&#24378;&#12290;&#30456;&#27604;&#20043;&#19979;&#65292;&#21482;&#33021;&#38024;&#23545;&#24050;&#21457;&#34920;&#21457;&#29616;&#30340;&#32479;&#35745;&#26041;&#27861;&#65288;&#20363;&#22914;&#32463;&#39564;&#36125;&#21494;&#26031;&#25910;&#32553;&#21644;&#23616;&#37096;FDR&#65289;&#21487;&#20197;&#34987;&#24378;&#28872;&#35782;&#21035;&#65292;&#22240;&#20026;&#26377;&#20851;&#24050;&#21457;&#34920;&#21457;&#29616;&#30340;&#25968;&#25454;&#38750;&#24120;&#20016;&#23500;&#12290;&#25105;&#22312;&#19968;&#20010;&#19968;&#33324;&#29702;&#35770;&#21644;&#20851;&#20110;&#25130;&#38754;&#22238;&#25253;&#21487;&#39044;&#27979;&#24615;&#25991;&#29486;&#30340;&#23454;&#35777;&#20998;&#26512;&#20013;&#35777;&#26126;&#20102;&#36825;&#20123;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
Many scholars have called for raising statistical hurdles to guard against false discoveries in academic publications. I show these calls are unlikely to be justified empirically. Published data exhibit bias: results that fail to meet existing hurdles are often unobserved. These unobserved results must be extrapolated, leading to weak identification of revised hurdles. In contrast, statistics that can target only published findings (e.g. empirical Bayes shrinkage and the local FDR) can be strongly identified, as data on published findings is plentiful. I demonstrate these results in a general theory and in an empirical analysis of the cross-sectional return predictability literature.
&lt;/p&gt;</description></item></channel></rss>