<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#36890;&#36807;&#20351;&#29992;&#25289;&#32454;&#23391;&#21010;&#20998;&#38598;&#65292;&#25105;&#20204;&#33021;&#22815;&#22312;&#22240;&#23376;&#25968;&#25454;&#20013;&#31283;&#20581;&#22320;&#20272;&#35745;&#24322;&#36136;&#24615;&#65292;&#24182;&#23558;&#22240;&#23376;&#31354;&#38388;&#21010;&#20998;&#25104;&#21327;&#21464;&#37327;&#32452;&#21512;&#30340;&#8220;&#27744;&#8221;&#65292;&#20197;&#20415;&#21306;&#20998;&#32467;&#26524;&#30340;&#24046;&#24322;&#12290;</title><link>https://arxiv.org/abs/2404.02141</link><description>&lt;p&gt;
&#20351;&#29992;&#25289;&#32454;&#23391;&#21010;&#20998;&#22312;&#22240;&#23376;&#25968;&#25454;&#20013;&#31283;&#20581;&#20272;&#35745;&#24322;&#36136;&#24615;
&lt;/p&gt;
&lt;p&gt;
Robustly estimating heterogeneity in factorial data using Rashomon Partitions
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2404.02141
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#20351;&#29992;&#25289;&#32454;&#23391;&#21010;&#20998;&#38598;&#65292;&#25105;&#20204;&#33021;&#22815;&#22312;&#22240;&#23376;&#25968;&#25454;&#20013;&#31283;&#20581;&#22320;&#20272;&#35745;&#24322;&#36136;&#24615;&#65292;&#24182;&#23558;&#22240;&#23376;&#31354;&#38388;&#21010;&#20998;&#25104;&#21327;&#21464;&#37327;&#32452;&#21512;&#30340;&#8220;&#27744;&#8221;&#65292;&#20197;&#20415;&#21306;&#20998;&#32467;&#26524;&#30340;&#24046;&#24322;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35768;&#22810;&#32479;&#35745;&#20998;&#26512;&#65292;&#26080;&#35770;&#26159;&#22312;&#35266;&#27979;&#25968;&#25454;&#36824;&#26159;&#38543;&#26426;&#23545;&#29031;&#35797;&#39564;&#20013;&#65292;&#37117;&#20250;&#38382;&#65306;&#24863;&#20852;&#36259;&#30340;&#32467;&#26524;&#22914;&#20309;&#38543;&#21487;&#35266;&#23519;&#21327;&#21464;&#37327;&#32452;&#21512;&#21464;&#21270;&#65311;&#19981;&#21516;&#30340;&#33647;&#29289;&#32452;&#21512;&#22914;&#20309;&#24433;&#21709;&#20581;&#24247;&#32467;&#26524;&#65292;&#31185;&#25216;&#37319;&#32435;&#22914;&#20309;&#20381;&#36182;&#28608;&#21169;&#21644;&#20154;&#21475;&#32479;&#35745;&#23398;&#65311;&#25105;&#20204;&#30340;&#30446;&#26631;&#26159;&#23558;&#36825;&#20010;&#22240;&#23376;&#31354;&#38388;&#21010;&#20998;&#25104;&#21327;&#21464;&#37327;&#32452;&#21512;&#30340;&#8220;&#27744;&#8221;&#65292;&#22312;&#36825;&#20123;&#27744;&#20013;&#32467;&#26524;&#20250;&#21457;&#29983;&#24046;&#24322;&#65288;&#20294;&#27744;&#20869;&#37096;&#19981;&#20250;&#21457;&#29983;&#65289;&#65292;&#32780;&#29616;&#26377;&#26041;&#27861;&#35201;&#20040;&#23547;&#25214;&#19968;&#20010;&#21333;&#19968;&#30340;&#8220;&#26368;&#20248;&#8221;&#20998;&#21106;&#65292;&#35201;&#20040;&#20174;&#21487;&#33021;&#20998;&#21106;&#30340;&#25972;&#20010;&#38598;&#21512;&#20013;&#25277;&#26679;&#12290;&#36825;&#20004;&#31181;&#26041;&#27861;&#37117;&#24573;&#35270;&#20102;&#36825;&#26679;&#19968;&#20010;&#20107;&#23454;&#65306;&#29305;&#21035;&#26159;&#22312;&#21327;&#21464;&#37327;&#20043;&#38388;&#23384;&#22312;&#30456;&#20851;&#32467;&#26500;&#30340;&#24773;&#20917;&#19979;&#65292;&#21487;&#33021;&#20197;&#35768;&#22810;&#31181;&#26041;&#24335;&#21010;&#20998;&#21327;&#21464;&#37327;&#31354;&#38388;&#65292;&#22312;&#32479;&#35745;&#19978;&#26159;&#26080;&#27861;&#21306;&#20998;&#30340;&#65292;&#23613;&#31649;&#23545;&#25919;&#31574;&#25110;&#31185;&#23398;&#26377;&#30528;&#38750;&#24120;&#19981;&#21516;&#30340;&#24433;&#21709;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;&#25289;&#32454;&#23391;&#21010;&#20998;&#38598;&#30340;&#26367;&#20195;&#35270;&#35282;
&lt;/p&gt;
&lt;p&gt;
arXiv:2404.02141v1 Announce Type: cross  Abstract: Many statistical analyses, in both observational data and randomized control trials, ask: how does the outcome of interest vary with combinations of observable covariates? How do various drug combinations affect health outcomes, or how does technology adoption depend on incentives and demographics? Our goal is to partition this factorial space into ``pools'' of covariate combinations where the outcome differs across the pools (but not within a pool). Existing approaches (i) search for a single ``optimal'' partition under assumptions about the association between covariates or (ii) sample from the entire set of possible partitions. Both these approaches ignore the reality that, especially with correlation structure in covariates, many ways to partition the covariate space may be statistically indistinguishable, despite very different implications for policy or science. We develop an alternative perspective, called Rashomon Partition Set
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;&#38598;&#20307;&#35780;&#20272;&#20989;&#25968;&#30340;&#23646;&#24615;&#65292;&#24182;&#30830;&#23450;&#20102;&#30830;&#20445;&#28385;&#36275;&#22235;&#31181;&#19981;&#21516;&#32452;&#21512;&#23646;&#24615;&#30340;&#38598;&#20307;&#35780;&#20272;&#20989;&#25968;&#23384;&#22312;&#30340;&#35780;&#20272;&#33021;&#21147;&#37197;&#32622;&#25991;&#20214;&#30340;&#24517;&#35201;&#21644;&#20805;&#20998;&#26465;&#20214;&#12290;</title><link>https://arxiv.org/abs/2402.16309</link><description>&lt;p&gt;
&#38598;&#20307;&#35780;&#20272;&#38382;&#39064;
&lt;/p&gt;
&lt;p&gt;
Collective Evaluation Problem
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.16309
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;&#38598;&#20307;&#35780;&#20272;&#20989;&#25968;&#30340;&#23646;&#24615;&#65292;&#24182;&#30830;&#23450;&#20102;&#30830;&#20445;&#28385;&#36275;&#22235;&#31181;&#19981;&#21516;&#32452;&#21512;&#23646;&#24615;&#30340;&#38598;&#20307;&#35780;&#20272;&#20989;&#25968;&#23384;&#22312;&#30340;&#35780;&#20272;&#33021;&#21147;&#37197;&#32622;&#25991;&#20214;&#30340;&#24517;&#35201;&#21644;&#20805;&#20998;&#26465;&#20214;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#30740;&#31350;&#32858;&#28966;&#20110;&#36890;&#36807;&#25910;&#38598;&#26469;&#33258;&#22810;&#20010;&#20010;&#20307;&#30340;&#35780;&#20272;&#26469;&#35780;&#20272;&#26377;&#38480;&#30340;&#26367;&#20195;&#26041;&#26696;&#30340;&#24773;&#20917;&#65292;&#20854;&#20013;&#19968;&#20123;&#20010;&#20307;&#21487;&#33021;&#19981;&#35780;&#20272;&#29305;&#23450;&#30340;&#26367;&#20195;&#26041;&#26696;&#12290;&#20010;&#20307;&#65288;&#21487;&#65289;&#35780;&#20272;&#30340;&#26367;&#20195;&#26041;&#26696;&#23376;&#38598;&#30340;&#38598;&#21512;&#34987;&#31216;&#20026;&#35780;&#20272;&#33021;&#21147;&#37197;&#32622;&#25991;&#20214;&#12290;&#38024;&#23545;&#32473;&#23450;&#30340;&#35780;&#20272;&#33021;&#21147;&#37197;&#32622;&#25991;&#20214;&#65292;&#25105;&#20204;&#23450;&#20041;&#20102;&#19968;&#20010;&#38598;&#20307;&#35780;&#20272;&#20989;&#25968;&#65292;&#20854;&#36755;&#20837;&#26159;&#20010;&#20307;&#23545;&#20182;&#20204;&#35780;&#20272;&#30340;&#26367;&#20195;&#26041;&#26696;&#23376;&#38598;&#30340;&#35780;&#20272;&#39034;&#24207;&#12290;&#25105;&#20204;&#30740;&#31350;&#20102;&#38598;&#20307;&#35780;&#20272;&#20989;&#25968;&#30340;&#29305;&#24615;&#65292;&#36825;&#20123;&#29305;&#24615;&#26159;&#23545;&#20808;&#21069;&#30740;&#31350;&#20013;&#24341;&#20837;&#30340;&#29305;&#24615;&#30340;&#20462;&#25913;&#12290;&#25105;&#20204;&#30830;&#23450;&#20102;&#20851;&#20110;&#35780;&#20272;&#33021;&#21147;&#37197;&#32622;&#25991;&#20214;&#30340;&#20805;&#20998;&#24517;&#35201;&#26465;&#20214;&#65292;&#20197;&#30830;&#20445;&#23384;&#22312;&#28385;&#36275;&#36825;&#20123;&#29305;&#24615;&#20013;&#22235;&#31181;&#19981;&#21516;&#32452;&#21512;&#30340;&#38598;&#20307;&#35780;&#20272;&#20989;&#25968;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.16309v1 Announce Type: new  Abstract: This study focuses on situations where a finite set of alternatives is evaluated by collecting evaluations from several individuals, some of whom may not evaluate specific alternatives. The collection of subsets of alternatives that individuals (can) evaluate is referred to as an evaluability profile. For a given evaluability profile, we define a collective evaluation function whose inputs are the evaluation orders of individuals on the subsets of alternatives that they evaluate. We investigate the properties of collective evaluation functions, which are modifications of those introduced in previous studies. We identify the necessary and sufficient conditions on the evaluability profile that ensure the existence of collective evaluation functions satisfying four different combinations of these properties.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLMs&#65289;&#65292;&#29305;&#21035;&#26159;OpenAI&#30340;GPT4&#21644;LLaMA2&#30340;&#25237;&#31080;&#34892;&#20026;&#65292;&#24182;&#25581;&#31034;&#20102;LLMs&#19982;&#20154;&#31867;&#22312;&#20915;&#31574;&#21644;&#20559;&#35265;&#26041;&#38754;&#30340;&#24046;&#24322;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#22312;&#25237;&#31080;&#36741;&#21161;&#20013;&#20351;&#29992;LLMs&#21487;&#33021;&#20250;&#23548;&#33268;&#26356;&#21516;&#36136;&#21270;&#30340;&#38598;&#20307;&#32467;&#26524;&#65292;&#24378;&#35843;&#20102;&#35880;&#24910;&#23558;LLMs&#25972;&#21512;&#21040;&#27665;&#20027;&#36807;&#31243;&#20013;&#30340;&#24517;&#35201;&#24615;&#12290;</title><link>https://arxiv.org/abs/2402.01766</link><description>&lt;p&gt;
LLM&#25237;&#31080;&#65306;&#20154;&#31867;&#36873;&#25321;&#21644;AI&#38598;&#20307;&#20915;&#31574;
&lt;/p&gt;
&lt;p&gt;
LLM Voting: Human Choices and AI Collective Decision Making
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.01766
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLMs&#65289;&#65292;&#29305;&#21035;&#26159;OpenAI&#30340;GPT4&#21644;LLaMA2&#30340;&#25237;&#31080;&#34892;&#20026;&#65292;&#24182;&#25581;&#31034;&#20102;LLMs&#19982;&#20154;&#31867;&#22312;&#20915;&#31574;&#21644;&#20559;&#35265;&#26041;&#38754;&#30340;&#24046;&#24322;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#22312;&#25237;&#31080;&#36741;&#21161;&#20013;&#20351;&#29992;LLMs&#21487;&#33021;&#20250;&#23548;&#33268;&#26356;&#21516;&#36136;&#21270;&#30340;&#38598;&#20307;&#32467;&#26524;&#65292;&#24378;&#35843;&#20102;&#35880;&#24910;&#23558;LLMs&#25972;&#21512;&#21040;&#27665;&#20027;&#36807;&#31243;&#20013;&#30340;&#24517;&#35201;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLMs&#65289;&#65292;&#29305;&#21035;&#26159;OpenAI&#30340;GPT4&#21644;LLaMA2&#30340;&#25237;&#31080;&#34892;&#20026;&#65292;&#24182;&#19982;&#20154;&#31867;&#25237;&#31080;&#27169;&#24335;&#36827;&#34892;&#20102;&#23545;&#27604;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#21253;&#25324;&#36827;&#34892;&#20154;&#31867;&#25237;&#31080;&#23454;&#39564;&#20197;&#24314;&#31435;&#20154;&#31867;&#20559;&#22909;&#30340;&#22522;&#20934;&#65292;&#24182;&#19982;LLM&#20195;&#29702;&#36827;&#34892;&#24179;&#34892;&#23454;&#39564;&#12290;&#30740;&#31350;&#32858;&#28966;&#20110;&#38598;&#20307;&#32467;&#26524;&#21644;&#20010;&#20307;&#20559;&#22909;&#65292;&#25581;&#31034;&#20102;&#20154;&#31867;&#21644;LLMs&#20043;&#38388;&#22312;&#20915;&#31574;&#21644;&#22266;&#26377;&#20559;&#35265;&#26041;&#38754;&#30340;&#24046;&#24322;&#12290;&#25105;&#20204;&#35266;&#23519;&#21040;LLMs&#22312;&#20559;&#22909;&#22810;&#26679;&#24615;&#21644;&#19968;&#33268;&#24615;&#20043;&#38388;&#23384;&#22312;&#26435;&#34913;&#65292;&#30456;&#27604;&#20154;&#31867;&#36873;&#27665;&#30340;&#22810;&#26679;&#20559;&#22909;&#65292;LLMs&#26377;&#26356;&#36235;&#21521;&#20110;&#19968;&#33268;&#36873;&#25321;&#30340;&#20542;&#21521;&#12290;&#36825;&#19968;&#21457;&#29616;&#34920;&#26126;&#65292;&#22312;&#25237;&#31080;&#36741;&#21161;&#20013;&#20351;&#29992;LLMs&#21487;&#33021;&#20250;&#23548;&#33268;&#26356;&#21516;&#36136;&#21270;&#30340;&#38598;&#20307;&#32467;&#26524;&#65292;&#24378;&#35843;&#20102;&#35880;&#24910;&#23558;LLMs&#25972;&#21512;&#21040;&#27665;&#20027;&#36807;&#31243;&#20013;&#30340;&#24517;&#35201;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper investigates the voting behaviors of Large Language Models (LLMs), particularly OpenAI's GPT4 and LLaMA2, and their alignment with human voting patterns. Our approach included a human voting experiment to establish a baseline for human preferences and a parallel experiment with LLM agents. The study focused on both collective outcomes and individual preferences, revealing differences in decision-making and inherent biases between humans and LLMs. We observed a trade-off between preference diversity and alignment in LLMs, with a tendency towards more uniform choices as compared to the diverse preferences of human voters. This finding indicates that LLMs could lead to more homogenized collective outcomes when used in voting assistance, underscoring the need for cautious integration of LLMs into democratic processes.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#34920;&#26126;&#65292;&#22312;&#23616;&#37096;&#25237;&#24433;&#20998;&#26512;&#20013;&#65292;&#24212;&#35813;&#20351;&#29992;&#26174;&#33879;&#24615;&#24102;&#26469;&#35780;&#20272;&#25514;&#26045;&#23545;&#32467;&#26524;&#30340;&#24433;&#21709;&#65292;&#32780;&#19981;&#26159;&#20351;&#29992;&#24120;&#29992;&#30340;&#32622;&#20449;&#24230;&#24102;&#12290;</title><link>http://arxiv.org/abs/2306.03073</link><description>&lt;p&gt;
&#23616;&#37096;&#25237;&#24433;&#30340;&#26174;&#33879;&#24615;&#24102;
&lt;/p&gt;
&lt;p&gt;
Significance Bands for Local Projections. (arXiv:2306.03073v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.03073
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#34920;&#26126;&#65292;&#22312;&#23616;&#37096;&#25237;&#24433;&#20998;&#26512;&#20013;&#65292;&#24212;&#35813;&#20351;&#29992;&#26174;&#33879;&#24615;&#24102;&#26469;&#35780;&#20272;&#25514;&#26045;&#23545;&#32467;&#26524;&#30340;&#24433;&#21709;&#65292;&#32780;&#19981;&#26159;&#20351;&#29992;&#24120;&#29992;&#30340;&#32622;&#20449;&#24230;&#24102;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20914;&#20987;&#21453;&#24212;&#20989;&#25968;&#25551;&#36848;&#20102;&#21050;&#28608;&#25110;&#27835;&#30103;&#21518;&#32467;&#26524;&#21464;&#37327;&#30340;&#21160;&#24577;&#28436;&#21464;&#12290;&#19968;&#20010;&#24120;&#35265;&#30340;&#20852;&#36259;&#20551;&#35774;&#26159;&#27835;&#30103;&#26159;&#21542;&#24433;&#21709;&#20102;&#32467;&#26524;&#12290;&#25105;&#20204;&#34920;&#26126;&#65292;&#26368;&#22909;&#20351;&#29992;&#26174;&#33879;&#24615;&#24102;&#26469;&#35780;&#20272;&#36825;&#20010;&#20551;&#35774;&#65292;&#32780;&#19981;&#26159;&#20381;&#36182;&#20110;&#36890;&#24120;&#26174;&#31034;&#30340;&#32622;&#20449;&#24230;&#24102;&#12290;&#22312;&#38646;&#20551;&#35774;&#19979;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#20351;&#29992;LM&#21407;&#21017;&#21487;&#20197;&#20351;&#29992;&#26631;&#20934;&#32479;&#35745;&#36719;&#20214;&#36731;&#26494;&#26500;&#24314;&#26174;&#33879;&#24615;&#24102;&#65292;&#24182;&#19988;&#22312;&#22270;&#24418;&#21270;&#26174;&#31034;&#20914;&#20987;&#21453;&#24212;&#26102;&#24212;&#24403;&#20316;&#20026;&#24120;&#35268;&#25253;&#21578;&#12290;
&lt;/p&gt;
&lt;p&gt;
An impulse response function describes the dynamic evolution of an outcome variable following a stimulus or treatment. A common hypothesis of interest is whether the treatment affects the outcome. We show that this hypothesis is best assessed using significance bands rather than relying on commonly displayed confidence bands. Under the null hypothesis, we show that significance bands are trivial to construct with standard statistical software using the LM principle, and should be reported as a matter of routine when displaying impulse responses graphically.
&lt;/p&gt;</description></item></channel></rss>