<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#36890;&#36807;&#22312;&#32447;&#35270;&#39057;&#28216;&#25103;&#20013;&#30340;&#21019;&#26032;&#25968;&#25454;&#21644;&#33258;&#28982;&#23454;&#39564;&#65292;&#30740;&#31350;&#25581;&#38706;&#24615;&#21462;&#21521;&#23545;&#29609;&#23478;&#20559;&#22909;&#30340;&#24433;&#21709;&#12290;</title><link>https://arxiv.org/abs/2403.03649</link><description>&lt;p&gt;
&#25581;&#38706;&#30340;&#25104;&#26412;
&lt;/p&gt;
&lt;p&gt;
The Cost of Coming Out
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.03649
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#22312;&#32447;&#35270;&#39057;&#28216;&#25103;&#20013;&#30340;&#21019;&#26032;&#25968;&#25454;&#21644;&#33258;&#28982;&#23454;&#39564;&#65292;&#30740;&#31350;&#25581;&#38706;&#24615;&#21462;&#21521;&#23545;&#29609;&#23478;&#20559;&#22909;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#31038;&#20250;&#27745;&#21517;&#21644;&#27495;&#35270;&#30340;&#24656;&#24807;&#23548;&#33268;&#20840;&#29699;&#35768;&#22810;&#20010;&#20307;&#22312;&#20844;&#24320;&#25259;&#38706;&#20854;&#24615;&#21462;&#21521;&#26102;&#29369;&#35947;&#19981;&#20915;&#12290;&#37492;&#20110;&#38544;&#30610;&#36523;&#20221;&#30340;&#24040;&#22823;&#20195;&#20215;&#65292;&#29702;&#35299;&#21453;&#23545;LGB&#24773;&#32490;&#30340;&#31243;&#24230;&#21644;&#23545;&#20986;&#26588;&#30340;&#21453;&#24212;&#33267;&#20851;&#37325;&#35201;&#12290;&#28982;&#32780;&#65292;&#25259;&#38706;&#33258;&#24049;&#30340;&#24615;&#21462;&#21521;&#26159;&#20010;&#20154;&#36873;&#25321;&#65292;&#20351;&#24471;&#25968;&#25454;&#33719;&#21462;&#22797;&#26434;&#21270;&#24182;&#24341;&#20837;&#20869;&#29983;&#24615;&#38382;&#39064;&#12290;&#26412;&#25991;&#36890;&#36807;&#20351;&#29992;&#19968;&#31181;&#21019;&#26032;&#30340;&#25968;&#25454;&#28304;&#65288;&#19968;&#20010;&#28909;&#38376;&#22312;&#32447;&#35270;&#39057;&#28216;&#25103;&#65289;&#21644;&#19968;&#20010;&#33258;&#28982;&#23454;&#39564;&#26469;&#35299;&#20915;&#36825;&#20123;&#25361;&#25112;&#12290;&#25105;&#20204;&#21033;&#29992;&#21487;&#29609;&#35282;&#33394;&#36523;&#20221;&#30340;&#22806;&#29983;&#21464;&#21270;&#26469;&#35782;&#21035;&#20986;&#25259;&#38706;&#23545;&#29609;&#23478;&#23545;&#35813;&#35282;&#33394;&#30340;&#24050;&#26174;&#38706;&#20559;&#22909;&#30340;&#24433;&#21709;&#12290;&#20511;&#21161;&#35814;&#32454;&#30340;&#26085;&#24120;&#25968;&#25454;&#65292;&#25105;&#20204;&#30417;&#27979;&#29609;&#23478;&#22312;&#20840;&#29699;&#21508;&#22320;&#23545;&#35282;&#33394;&#30340;&#20559;&#22909;&#65292;&#24182;&#37319;&#29992;&#21512;&#25104;&#25511;&#21046;&#26041;&#27861;&#26469;&#20998;&#31163;&#25259;&#38706;&#23545;&#29609;&#23478;&#20559;&#22909;&#30340;&#24433;&#21709;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#21457;&#29616;&#20102;&#19968;&#20010;&#26174;&#33879;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.03649v1 Announce Type: new  Abstract: The fear of social stigma and discrimination leads many individuals worldwide to hesitate in openly disclosing their sexual orientation. Due to the large costs of concealing identity, it is crucial to understand the extent of anti-LGB sentiments and reactions to coming out. However, disclosing one's sexual orientation is a personal choice, complicating data access and introducing endogeneity issues. This paper tackles these challenges by using an innovative data source from a popular online video game together with a natural experiment. We exploit exogenous variation in the identity of a playable character to identify the effects of disclosure on players' revealed preferences for that character. Leveraging detailed daily data, we monitor players' preferences for the character across diverse regions globally and employ synthetic control methods to isolate the effect of the disclosure on players' preferences. Our findings reveal a substant
&lt;/p&gt;</description></item><item><title>&#36890;&#36807;&#23545;37&#31687;&#20351;&#29992;&#35266;&#23519;&#38754;&#26495;&#25968;&#25454;&#30340;&#25991;&#31456;&#36827;&#34892;&#22797;&#21046;&#21644;&#37325;&#26032;&#20998;&#26512;&#65292;&#25105;&#20204;&#21457;&#29616;&#21452;&#21521;&#22266;&#23450;&#25928;&#24212;&#27169;&#22411;&#30340;&#26680;&#24515;&#32467;&#35770;&#22312;&#26032;&#30340;&#24322;&#36136;&#27835;&#30103;&#25928;&#24212;&#40065;&#26834;&#20272;&#35745;&#22120;&#19979;&#22522;&#26412;&#20445;&#25345;&#19981;&#21464;&#65292;&#20294;&#24179;&#34892;&#36235;&#21183;&#20551;&#35774;&#36829;&#21453;&#21644;&#32479;&#35745;&#21147;&#37327;&#19981;&#36275;&#20173;&#28982;&#26159;&#21487;&#20449;&#25512;&#35770;&#30340;&#37325;&#35201;&#38556;&#30861;&#12290;</title><link>http://arxiv.org/abs/2309.15983</link><description>&lt;p&gt;
&#22914;&#20309;&#22312;&#24179;&#34892;&#36235;&#21183;&#19979;&#36827;&#34892;&#22240;&#26524;&#38754;&#26495;&#20998;&#26512;&#65306;&#19968;&#39033;&#22823;&#35268;&#27169;&#20877;&#20998;&#26512;&#30740;&#31350;&#30340;&#25945;&#35757;
&lt;/p&gt;
&lt;p&gt;
What To Do (and Not to Do) with Causal Panel Analysis under Parallel Trends: Lessons from A Large Reanalysis Study. (arXiv:2309.15983v1 [stat.ME])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.15983
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#23545;37&#31687;&#20351;&#29992;&#35266;&#23519;&#38754;&#26495;&#25968;&#25454;&#30340;&#25991;&#31456;&#36827;&#34892;&#22797;&#21046;&#21644;&#37325;&#26032;&#20998;&#26512;&#65292;&#25105;&#20204;&#21457;&#29616;&#21452;&#21521;&#22266;&#23450;&#25928;&#24212;&#27169;&#22411;&#30340;&#26680;&#24515;&#32467;&#35770;&#22312;&#26032;&#30340;&#24322;&#36136;&#27835;&#30103;&#25928;&#24212;&#40065;&#26834;&#20272;&#35745;&#22120;&#19979;&#22522;&#26412;&#20445;&#25345;&#19981;&#21464;&#65292;&#20294;&#24179;&#34892;&#36235;&#21183;&#20551;&#35774;&#36829;&#21453;&#21644;&#32479;&#35745;&#21147;&#37327;&#19981;&#36275;&#20173;&#28982;&#26159;&#21487;&#20449;&#25512;&#35770;&#30340;&#37325;&#35201;&#38556;&#30861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21452;&#21521;&#22266;&#23450;&#25928;&#24212;&#27169;&#22411;&#22312;&#25919;&#27835;&#31185;&#23398;&#20013;&#30340;&#22240;&#26524;&#38754;&#26495;&#20998;&#26512;&#20013;&#26222;&#36941;&#24212;&#29992;&#12290;&#28982;&#32780;&#65292;&#26368;&#36817;&#30340;&#26041;&#27861;&#35770;&#35752;&#35770;&#25361;&#25112;&#20102;&#20854;&#22312;&#23384;&#22312;&#24322;&#36136;&#27835;&#30103;&#25928;&#24212;&#21644;&#24179;&#34892;&#36235;&#21183;&#20551;&#35774;&#36829;&#21453;&#24773;&#20917;&#19979;&#30340;&#26377;&#25928;&#24615;&#12290;&#36825;&#19968;&#26032;&#20852;&#30340;&#25991;&#29486;&#24341;&#20837;&#20102;&#22810;&#20010;&#20272;&#35745;&#22120;&#21644;&#35786;&#26029;&#26041;&#27861;&#65292;&#23548;&#33268;&#23454;&#35777;&#30740;&#31350;&#20154;&#21592;&#22312;&#20004;&#20010;&#26041;&#38754;&#20135;&#29983;&#20102;&#22256;&#24785;&#65306;&#22522;&#20110;&#21452;&#21521;&#22266;&#23450;&#25928;&#24212;&#27169;&#22411;&#30340;&#29616;&#26377;&#32467;&#26524;&#30340;&#21487;&#38752;&#24615;&#21644;&#30446;&#21069;&#30340;&#26368;&#20339;&#23454;&#36341;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20123;&#38382;&#39064;&#65292;&#25105;&#20204;&#32771;&#23519;&#12289;&#22797;&#21046;&#21644;&#37325;&#26032;&#20998;&#26512;&#20102;&#19977;&#20010;&#39046;&#20808;&#25919;&#27835;&#31185;&#23398;&#26399;&#21002;&#19978;&#20849;37&#31687;&#36816;&#29992;&#35266;&#23519;&#38754;&#26495;&#25968;&#25454;&#21644;&#20108;&#20803;&#27835;&#30103;&#30340;&#25991;&#31456;&#12290;&#20351;&#29992;&#20845;&#31181;&#26032;&#24341;&#20837;&#30340;&#24322;&#36136;&#27835;&#30103;&#25928;&#24212;&#40065;&#26834;&#20272;&#35745;&#22120;&#65292;&#25105;&#20204;&#21457;&#29616;&#23613;&#31649;&#31934;&#30830;&#24615;&#21487;&#33021;&#21463;&#21040;&#24433;&#21709;&#65292;&#20294;&#22522;&#20110;&#21452;&#21521;&#22266;&#23450;&#25928;&#24212;&#20272;&#35745;&#30340;&#26680;&#24515;&#32467;&#35770;&#22312;&#24456;&#22823;&#31243;&#24230;&#19978;&#20445;&#25345;&#19981;&#21464;&#12290;&#28982;&#32780;&#65292;&#24179;&#34892;&#36235;&#21183;&#20551;&#35774;&#30340;&#36829;&#21453;&#21644;&#32479;&#35745;&#21147;&#37327;&#19981;&#36275;&#20173;&#28982;&#26159;&#21487;&#20449;&#25512;&#35770;&#30340;&#37325;&#35201;&#38556;&#30861;&#12290;
&lt;/p&gt;
&lt;p&gt;
Two-way fixed effects (TWFE) models are ubiquitous in causal panel analysis in political science. However, recent methodological discussions challenge their validity in the presence of heterogeneous treatment effects (HTE) and violations of the parallel trends assumption (PTA). This burgeoning literature has introduced multiple estimators and diagnostics, leading to confusion among empirical researchers on two fronts: the reliability of existing results based on TWFE models and the current best practices. To address these concerns, we examined, replicated, and reanalyzed 37 articles from three leading political science journals that employed observational panel data with binary treatments. Using six newly introduced HTE-robust estimators, we find that although precision may be affected, the core conclusions derived from TWFE estimates largely remain unchanged. PTA violations and insufficient statistical power, however, continue to be significant obstacles to credible inferences. Based 
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#23454;&#39564;&#20998;&#26512;&#20013;&#28041;&#21450;&#30340;&#22823;&#31867;&#22788;&#29702;&#25928;&#24212;&#21442;&#25968;&#30340;&#26377;&#25928;&#20272;&#35745;&#65292;&#21253;&#25324;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#12289;&#20998;&#20301;&#25968;&#22788;&#29702;&#25928;&#24212;&#12289;&#23616;&#37096;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#31561;&#12290;</title><link>http://arxiv.org/abs/2307.15181</link><description>&lt;p&gt;
&#20851;&#20110;&#32454;&#20998;&#23454;&#39564;&#25928;&#29575;&#30340;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
On the Efficiency of Finely Stratified Experiments. (arXiv:2307.15181v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.15181
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#23454;&#39564;&#20998;&#26512;&#20013;&#28041;&#21450;&#30340;&#22823;&#31867;&#22788;&#29702;&#25928;&#24212;&#21442;&#25968;&#30340;&#26377;&#25928;&#20272;&#35745;&#65292;&#21253;&#25324;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#12289;&#20998;&#20301;&#25968;&#22788;&#29702;&#25928;&#24212;&#12289;&#23616;&#37096;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#31561;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#23454;&#39564;&#20998;&#26512;&#20013;&#28041;&#21450;&#30340;&#22823;&#31867;&#22788;&#29702;&#25928;&#24212;&#21442;&#25968;&#30340;&#26377;&#25928;&#20272;&#35745;&#12290;&#22312;&#36825;&#37324;&#65292;&#25928;&#29575;&#26159;&#25351;&#23545;&#20110;&#19968;&#31867;&#24191;&#27867;&#30340;&#22788;&#29702;&#20998;&#37197;&#26041;&#26696;&#32780;&#35328;&#30340;&#65292;&#20854;&#20013;&#20219;&#20309;&#21333;&#20301;&#34987;&#20998;&#37197;&#21040;&#22788;&#29702;&#30340;&#36793;&#38469;&#27010;&#29575;&#31561;&#20110;&#39044;&#20808;&#25351;&#23450;&#30340;&#20540;&#65292;&#20363;&#22914;&#19968;&#21322;&#12290;&#37325;&#35201;&#30340;&#26159;&#65292;&#25105;&#20204;&#19981;&#35201;&#27714;&#22788;&#29702;&#29366;&#24577;&#26159;&#20197;i.i.d.&#30340;&#26041;&#24335;&#20998;&#37197;&#30340;&#65292;&#22240;&#27492;&#21487;&#20197;&#36866;&#24212;&#23454;&#36341;&#20013;&#20351;&#29992;&#30340;&#22797;&#26434;&#22788;&#29702;&#20998;&#37197;&#26041;&#26696;&#65292;&#22914;&#20998;&#23618;&#38543;&#26426;&#21270;&#21644;&#21305;&#37197;&#23545;&#12290;&#25152;&#32771;&#34385;&#30340;&#21442;&#25968;&#31867;&#21035;&#26159;&#21487;&#20197;&#34920;&#31034;&#20026;&#24050;&#30693;&#35266;&#27979;&#25968;&#25454;&#30340;&#19968;&#20010;&#24050;&#30693;&#20989;&#25968;&#30340;&#26399;&#26395;&#30340;&#32422;&#26463;&#30340;&#35299;&#30340;&#37027;&#20123;&#21442;&#25968;&#65292;&#20854;&#20013;&#21487;&#33021;&#21253;&#25324;&#22788;&#29702;&#20998;&#37197;&#36793;&#38469;&#27010;&#29575;&#30340;&#39044;&#20808;&#25351;&#23450;&#20540;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#36825;&#31867;&#21442;&#25968;&#21253;&#25324;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#12289;&#20998;&#20301;&#25968;&#22788;&#29702;&#25928;&#24212;&#12289;&#23616;&#37096;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#31561;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper studies the efficient estimation of a large class of treatment effect parameters that arise in the analysis of experiments. Here, efficiency is understood to be with respect to a broad class of treatment assignment schemes for which the marginal probability that any unit is assigned to treatment equals a pre-specified value, e.g., one half. Importantly, we do not require that treatment status is assigned in an i.i.d. fashion, thereby accommodating complicated treatment assignment schemes that are used in practice, such as stratified block randomization and matched pairs. The class of parameters considered are those that can be expressed as the solution to a restriction on the expectation of a known function of the observed data, including possibly the pre-specified value for the marginal probability of treatment assignment. We show that this class of parameters includes, among other things, average treatment effects, quantile treatment effects, local average treatment effect
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20351;&#29992;&#28151;&#21512;&#28145;&#24230;&#23398;&#20064;&#26041;&#27861;&#26469;&#20272;&#31639;&#21306;&#22495;&#25237;&#20837;&#20135;&#20986;&#34920;&#30340;&#36755;&#20837;&#31995;&#25968;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;&#35813;&#26041;&#27861;&#21487;&#20197;&#27604;&#38750;&#35843;&#26597;&#26041;&#27861;&#26356;&#20934;&#30830;&#22320;&#20272;&#31639;&#36755;&#20837;&#31995;&#25968;&#12290;</title><link>http://arxiv.org/abs/2305.01201</link><description>&lt;p&gt;
&#20351;&#29992;&#28151;&#21512;&#28145;&#24230;&#23398;&#20064;&#26041;&#27861;&#20272;&#31639;&#21306;&#22495;&#25237;&#20837;&#20135;&#20986;&#34920;&#30340;&#36755;&#20837;&#31995;&#25968;
&lt;/p&gt;
&lt;p&gt;
Estimating Input Coefficients for Regional Input-Output Tables Using Deep Learning with Mixup. (arXiv:2305.01201v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.01201
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20351;&#29992;&#28151;&#21512;&#28145;&#24230;&#23398;&#20064;&#26041;&#27861;&#26469;&#20272;&#31639;&#21306;&#22495;&#25237;&#20837;&#20135;&#20986;&#34920;&#30340;&#36755;&#20837;&#31995;&#25968;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;&#35813;&#26041;&#27861;&#21487;&#20197;&#27604;&#38750;&#35843;&#26597;&#26041;&#27861;&#26356;&#20934;&#30830;&#22320;&#20272;&#31639;&#36755;&#20837;&#31995;&#25968;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25237;&#20837;&#20135;&#20986;&#34920;&#26159;&#20998;&#26512;&#21306;&#22495;&#32463;&#27982;&#29366;&#20917;&#30340;&#37325;&#35201;&#25968;&#25454;&#12290;&#20294;&#26159;&#65292;&#26085;&#26412;&#27599;&#20010;&#22320;&#21306;&#30340;&#25237;&#20837;&#20135;&#20986;&#34920;&#24182;&#38750;&#24635;&#26159;&#20844;&#24320;&#30340;&#65292;&#38656;&#35201;&#36827;&#34892;&#20272;&#31639;&#12290;&#20026;&#20102;&#25552;&#39640;&#20272;&#31639;&#31934;&#24230;&#65292;&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#21033;&#29992;&#20154;&#24037;&#31070;&#32463;&#32593;&#32476;&#36924;&#36817;&#29983;&#25104;&#36807;&#31243;&#20197;&#20272;&#31639;&#36755;&#20837;&#31995;&#25968;&#30340;&#26041;&#27861;&#65292;&#24182;&#24341;&#20837;&#20102;&#25968;&#25454;&#22686;&#24378;&#25216;&#26415;mixup&#26469;&#22686;&#21152;&#25968;&#25454;&#37327;&#12290;&#35813;&#26041;&#27861;&#34987;&#24212;&#29992;&#20110;&#26085;&#26412;&#22320;&#21306;&#25237;&#20837;&#20135;&#20986;&#34920;&#30340;&#36755;&#20837;&#31995;&#25968;&#20272;&#31639;&#20013;&#65292;&#32467;&#26524;&#34920;&#26126;&#35813;&#26041;&#27861;&#21487;&#20197;&#27604;&#38750;&#35843;&#26597;&#26041;&#27861;&#26356;&#20934;&#30830;&#22320;&#20272;&#31639;&#36755;&#20837;&#31995;&#25968;&#12290;
&lt;/p&gt;
&lt;p&gt;
An input-output table is an important data for analyzing the economic situation of a region. Generally, the input-output table for each region (regional input-output table) in Japan is not always publicly available, so it is necessary to estimate the table. In particular, various methods have been developed for estimating input coefficients, which are an important part of the input-output table. Currently, non-survey methods are often used to estimate input coefficients because they require less data and computation, but these methods have some problems, such as discarding information and requiring additional data for estimation.  In this study, the input coefficients are estimated by approximating the generation process with an artificial neural network (ANN) to mitigate the problems of the non-survey methods and to estimate the input coefficients with higher precision. To avoid over-fitting due to the small data used, data augmentation, called mixup, is introduced to increase the dat
&lt;/p&gt;</description></item></channel></rss>