<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#26412;&#25991;&#32508;&#36848;&#20102;&#20351;&#29992;&#35768;&#22810;&#20202;&#22120;&#36827;&#34892;&#20272;&#35745;&#21644;&#32479;&#35745;&#25512;&#26029;&#30340;&#26368;&#26032;&#25991;&#29486;&#20013;&#30340;&#24605;&#24819;&#12290;&#25105;&#20204;&#35752;&#35770;&#20102;&#35780;&#20272;&#20202;&#22120;&#24378;&#24230;&#21644;&#22312;&#24322;&#26041;&#24046;&#24615;&#19979;&#36827;&#34892;&#30340;&#24369;&#21464;&#37327;&#40065;&#26834;&#25512;&#26029;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#22312;&#20445;&#30041;&#21076;&#38500;&#31471;&#25928;&#24212;&#30340;&#29305;&#24615;&#30340;&#21516;&#26102;&#65292;&#27491;&#30830;&#22320;&#23545;&#35768;&#22810;&#22806;&#29983;&#22238;&#24402;&#36827;&#34892;&#37096;&#20998;&#27714;&#35299;&#30340;&#27979;&#35797;&#26041;&#27861;&#12290;&#35813;&#27979;&#35797;&#26041;&#27861;&#20855;&#26377;&#32479;&#19968;&#27491;&#30830;&#30340;&#22823;&#23567;&#21644;&#33391;&#22909;&#30340;&#21151;&#25928;&#29305;&#24615;&#12290;</title><link>http://arxiv.org/abs/2308.09535</link><description>&lt;p&gt;
&#24369;&#30340;&#24037;&#20855;&#21464;&#37327;&#30340;&#35782;&#21035;&#19982;&#20247;&#22810;&#30340;&#20202;&#22120;
&lt;/p&gt;
&lt;p&gt;
Weak Identification with Many Instruments. (arXiv:2308.09535v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.09535
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#32508;&#36848;&#20102;&#20351;&#29992;&#35768;&#22810;&#20202;&#22120;&#36827;&#34892;&#20272;&#35745;&#21644;&#32479;&#35745;&#25512;&#26029;&#30340;&#26368;&#26032;&#25991;&#29486;&#20013;&#30340;&#24605;&#24819;&#12290;&#25105;&#20204;&#35752;&#35770;&#20102;&#35780;&#20272;&#20202;&#22120;&#24378;&#24230;&#21644;&#22312;&#24322;&#26041;&#24046;&#24615;&#19979;&#36827;&#34892;&#30340;&#24369;&#21464;&#37327;&#40065;&#26834;&#25512;&#26029;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#22312;&#20445;&#30041;&#21076;&#38500;&#31471;&#25928;&#24212;&#30340;&#29305;&#24615;&#30340;&#21516;&#26102;&#65292;&#27491;&#30830;&#22320;&#23545;&#35768;&#22810;&#22806;&#29983;&#22238;&#24402;&#36827;&#34892;&#37096;&#20998;&#27714;&#35299;&#30340;&#27979;&#35797;&#26041;&#27861;&#12290;&#35813;&#27979;&#35797;&#26041;&#27861;&#20855;&#26377;&#32479;&#19968;&#27491;&#30830;&#30340;&#22823;&#23567;&#21644;&#33391;&#22909;&#30340;&#21151;&#25928;&#29305;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#32447;&#24615;&#30340;&#24037;&#20855;&#21464;&#37327;&#22238;&#24402;&#24191;&#27867;&#29992;&#20110;&#20272;&#35745;&#22240;&#26524;&#25928;&#24212;&#12290;&#35768;&#22810;&#20202;&#22120;&#26469;&#33258;&#20110;&#20351;&#29992;&#30340;"&#25216;&#26415;"&#20202;&#22120;&#21644;&#26368;&#36817;&#30340;"&#27861;&#23448;&#35774;&#35745;"&#23454;&#35777;&#31574;&#30053;&#12290;&#26412;&#25991;&#32508;&#36848;&#20102;&#20851;&#20110;&#20247;&#22810;&#20202;&#22120;&#30340;&#20272;&#35745;&#21644;&#32479;&#35745;&#25512;&#26029;&#30340;&#36817;&#26399;&#25991;&#29486;&#20013;&#30340;&#24605;&#24819;&#12290;&#25105;&#20204;&#35752;&#35770;&#20102;&#22914;&#20309;&#35780;&#20272;&#20202;&#22120;&#30340;&#24378;&#24230;&#65292;&#24182;&#22312;&#24322;&#26041;&#24046;&#24615;&#19979;&#36827;&#34892;&#24369;&#21464;&#37327;&#40065;&#26834;&#25512;&#26029;&#12290;&#25105;&#20204;&#24314;&#31435;&#20102;&#25289;&#26684;&#26391;&#26085;&#20056;&#23376;(LM)&#26816;&#39564;&#32479;&#35745;&#37327;&#30340;&#26032;&#32467;&#26524;&#30340;&#21076;&#38500;&#31471;&#25928;&#24212;&#30340;&#29256;&#26412;&#12290;&#22312;&#23454;&#36341;&#20013;&#65292;&#32463;&#24120;&#20986;&#29616;&#35768;&#22810;&#22806;&#29983;&#22238;&#24402;&#20197;&#30830;&#20445;&#20202;&#22120;&#30340;&#26377;&#25928;&#24615;&#12290;&#25105;&#20204;&#23558;&#24369;&#21464;&#37327;&#40065;&#26834;&#27979;&#35797;&#25193;&#23637;&#21040;&#21516;&#26102;&#23384;&#22312;&#35768;&#22810;&#22806;&#29983;&#22238;&#24402;&#21644;&#35768;&#22810;&#20202;&#22120;&#30340;&#24773;&#20917;&#19979;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#27979;&#35797;&#26041;&#27861;&#65292;&#23427;&#22312;&#20445;&#30041;&#21076;&#38500;&#31471;&#25928;&#24212;&#30340;&#29305;&#24615;&#30340;&#21516;&#26102;&#65292;&#27491;&#30830;&#22320;&#23545;&#35768;&#22810;&#22806;&#29983;&#22238;&#24402;&#36827;&#34892;&#37096;&#20998;&#27714;&#35299;&#12290;&#35813;&#25552;&#20986;&#30340;&#27979;&#35797;&#26041;&#27861;&#20855;&#26377;&#32479;&#19968;&#27491;&#30830;&#30340;&#22823;&#23567;&#21644;&#33391;&#22909;&#30340;&#21151;&#25928;&#29305;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Linear instrumental variable regressions are widely used to estimate causal effects. Many instruments arise from the use of "technical" instruments and more recently from the empirical strategy of "judge design". This paper surveys and summarizes ideas from recent literature on estimation and statistical inferences with many instruments. We discuss how to assess the strength of the instruments and how to conduct weak identification-robust inference under heteroscedasticity. We establish new results for a jack-knifed version of the Lagrange Multiplier (LM) test statistic. Many exogenous regressors arise often in practice to ensure the validity of the instruments. We extend the weak-identification-robust tests to settings with both many exogenous regressors and many instruments. We propose a test that properly partials out many exogenous regressors while preserving the re-centering property of the jack-knife. The proposed tests have uniformly correct size and good power properties.
&lt;/p&gt;</description></item><item><title>&#36825;&#31687;&#35770;&#25991;&#36890;&#36807;&#23545;WallStreetBets&#35770;&#22363;&#30340;&#25968;&#25454;&#20998;&#26512;&#65292;&#25581;&#31034;&#20102;&#38646;&#21806;&#25237;&#36164;&#32773;&#30340;&#32676;&#38598;&#34892;&#20026;&#22312;&#36164;&#20135;&#20215;&#26684;&#27874;&#21160;&#20013;&#30340;&#37325;&#35201;&#20316;&#29992;&#12290;</title><link>http://arxiv.org/abs/2308.09485</link><description>&lt;p&gt;
&#20247;&#20154;&#30340;&#26234;&#24935;&#36824;&#26159;&#32676;&#20247;&#30340;&#26080;&#30693;&#65311;&#19968;&#20010;&#25968;&#25454;&#39537;&#21160;&#30340;&#23545;WSB&#30340;&#25351;&#21335;
&lt;/p&gt;
&lt;p&gt;
Wisdom of the Crowds or Ignorance of the Masses? A data-driven guide to WSB. (arXiv:2308.09485v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.09485
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#36890;&#36807;&#23545;WallStreetBets&#35770;&#22363;&#30340;&#25968;&#25454;&#20998;&#26512;&#65292;&#25581;&#31034;&#20102;&#38646;&#21806;&#25237;&#36164;&#32773;&#30340;&#32676;&#38598;&#34892;&#20026;&#22312;&#36164;&#20135;&#20215;&#26684;&#27874;&#21160;&#20013;&#30340;&#37325;&#35201;&#20316;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#32463;&#27982;&#23398;&#20013;&#19968;&#20010;&#24179;&#20961;&#20294;&#22522;&#26412;&#30340;&#38382;&#39064;&#26159;&#65306;&#26159;&#20160;&#20040;&#23548;&#33268;&#20102;&#36164;&#20135;&#20215;&#26684;&#30340;&#22823;&#24133;&#27874;&#21160;&#65311;2021&#24180;1&#26376;22&#26085;&#33267;28&#26085;&#26399;&#38388;&#65292;GameStop&#32929;&#31080;&#20215;&#26684;&#32763;&#20102;&#21313;&#20493;&#65292;&#36825;&#34920;&#26126;&#25955;&#25143;&#25237;&#36164;&#32773;&#30340;&#32676;&#38598;&#34892;&#20026;&#26159;&#19968;&#20010;&#37325;&#35201;&#30340;&#20419;&#25104;&#22240;&#32032;&#12290;&#26412;&#25991;&#25552;&#20379;&#20102;&#23545;&#24341;&#36215;&#28909;&#28526;&#30340;&#35770;&#22363;WallStreetBets&#65288;WSB&#65289;&#30340;&#25968;&#25454;&#39537;&#21160;&#25351;&#21335;&#12290;&#25105;&#20204;&#30340;&#21021;&#22987;&#23454;&#39564;&#20351;&#29992;&#22823;&#35268;&#27169;&#30340;&#35821;&#35328;&#20027;&#39064;&#27169;&#22411;&#21644;&#32593;&#32476;&#24037;&#20855;&#23545;&#35770;&#22363;&#36827;&#34892;&#20102;&#20998;&#35299;&#12290;&#20027;&#39064;&#27169;&#22411;&#25551;&#36848;&#20102;&#35770;&#22363;&#38543;&#26102;&#38388;&#30340;&#28436;&#21464;&#65292;&#24182;&#23637;&#31034;&#20102;&#26576;&#20123;&#20027;&#39064;&#65288;&#22914;&#24066;&#22330;/S\&amp;P500&#35752;&#35770;&#65289;&#30340;&#25345;&#20037;&#24615;&#65292;&#20197;&#21450;&#23545;&#20854;&#20182;&#20027;&#39064;&#65288;&#22914;COVID&#25110;&#21407;&#27833;&#65289;&#30340;&#38646;&#25955;&#20852;&#36259;&#12290;&#32593;&#32476;&#20998;&#26512;&#20351;&#25105;&#20204;&#33021;&#22815;&#22522;&#20110;&#29992;&#25143;&#30340;&#21457;&#24086;&#21644;&#35752;&#35770;&#20064;&#24815;&#23558;&#38646;&#21806;&#25237;&#36164;&#32773;&#30340;&#26223;&#35266;&#36827;&#34892;&#20998;&#35299;&#65307;&#20986;&#29616;&#20102;&#20960;&#20010;&#22823;&#30340;&#12289;&#30456;&#20851;&#30340;&#36164;&#20135;&#35752;&#35770;&#32676;&#38598;&#65292;&#21608;&#22260;&#26159;&#36739;&#23567;&#30340;&#12289;&#23567;&#20247;&#30340;&#32676;&#38598;&#12290;&#31532;&#20108;&#32452;&#23454;&#39564;&#35780;&#20272;&#20102;WSB&#35752;&#35770;&#23545;&#24066;&#22330;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
A trite yet fundamental question in economics is: What causes large asset price fluctuations? A tenfold rise in the price of GameStop equity, between the 22nd and 28th of January 2021, demonstrated that herding behaviour among retail investors is an important contributing factor. This paper presents a data-driven guide to the forum that started the hype -- WallStreetBets (WSB). Our initial experiments decompose the forum using a large language topic model and network tools. The topic model describes the evolution of the forum over time and shows the persistence of certain topics (such as the market / S\&amp;P500 discussion), and the sporadic interest in others, such as COVID or crude oil. Network analysis allows us to decompose the landscape of retail investors into clusters based on their posting and discussion habits; several large, correlated asset discussion clusters emerge, surrounded by smaller, niche ones. A second set of experiments assesses the impact that WSB discussions have had
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#36890;&#32960;&#20851;&#27880;&#24230;&#19982;&#36890;&#32960;&#28608;&#22686;&#20043;&#38388;&#30340;&#20851;&#31995;&#65292;&#21457;&#29616;&#22312;&#36890;&#32960;&#29575;&#20302;&#31283;&#23450;&#26102;&#65292;&#20154;&#20204;&#20851;&#27880;&#24230;&#36739;&#20302;&#65292;&#20294;&#19968;&#26086;&#36890;&#32960;&#29575;&#36229;&#36807;4%&#65292;&#20851;&#27880;&#24230;&#20250;&#26126;&#26174;&#22686;&#21152;&#65292;&#39640;&#20851;&#27880;&#21306;&#22495;&#30340;&#20851;&#27880;&#24230;&#26159;&#20302;&#20851;&#27880;&#21306;&#22495;&#30340;&#20004;&#20493;&#12290;&#36825;&#31181;&#20851;&#27880;&#38408;&#20540;&#30340;&#23384;&#22312;&#23548;&#33268;&#20102;&#29366;&#24577;&#20381;&#36182;&#25928;&#24212;&#65292;&#21363;&#22312;&#23485;&#26494;&#36135;&#24065;&#25919;&#31574;&#26102;&#65292;&#25104;&#26412;&#25512;&#21160;&#20914;&#20987;&#23545;&#36890;&#32960;&#30340;&#24433;&#21709;&#26356;&#22823;&#12290;&#36825;&#20123;&#32467;&#35770;&#26377;&#21161;&#20110;&#29702;&#35299;&#26368;&#36817;&#32654;&#22269;&#30340;&#36890;&#32960;&#28608;&#22686;&#29616;&#35937;&#12290;</title><link>http://arxiv.org/abs/2308.09480</link><description>&lt;p&gt;
&#36890;&#32960;&#20851;&#27880;&#38408;&#20540;&#19982;&#36890;&#32960;&#28608;&#22686;
&lt;/p&gt;
&lt;p&gt;
The Inflation Attention Threshold and Inflation Surges. (arXiv:2308.09480v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.09480
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#36890;&#32960;&#20851;&#27880;&#24230;&#19982;&#36890;&#32960;&#28608;&#22686;&#20043;&#38388;&#30340;&#20851;&#31995;&#65292;&#21457;&#29616;&#22312;&#36890;&#32960;&#29575;&#20302;&#31283;&#23450;&#26102;&#65292;&#20154;&#20204;&#20851;&#27880;&#24230;&#36739;&#20302;&#65292;&#20294;&#19968;&#26086;&#36890;&#32960;&#29575;&#36229;&#36807;4%&#65292;&#20851;&#27880;&#24230;&#20250;&#26126;&#26174;&#22686;&#21152;&#65292;&#39640;&#20851;&#27880;&#21306;&#22495;&#30340;&#20851;&#27880;&#24230;&#26159;&#20302;&#20851;&#27880;&#21306;&#22495;&#30340;&#20004;&#20493;&#12290;&#36825;&#31181;&#20851;&#27880;&#38408;&#20540;&#30340;&#23384;&#22312;&#23548;&#33268;&#20102;&#29366;&#24577;&#20381;&#36182;&#25928;&#24212;&#65292;&#21363;&#22312;&#23485;&#26494;&#36135;&#24065;&#25919;&#31574;&#26102;&#65292;&#25104;&#26412;&#25512;&#21160;&#20914;&#20987;&#23545;&#36890;&#32960;&#30340;&#24433;&#21709;&#26356;&#22823;&#12290;&#36825;&#20123;&#32467;&#35770;&#26377;&#21161;&#20110;&#29702;&#35299;&#26368;&#36817;&#32654;&#22269;&#30340;&#36890;&#32960;&#28608;&#22686;&#29616;&#35937;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#26368;&#36817;&#36890;&#32960;&#28608;&#22686;&#29190;&#21457;&#26102;&#65292;&#20844;&#20247;&#23545;&#36890;&#32960;&#30340;&#20851;&#27880;&#24230;&#24456;&#20302;&#65292;&#20294;&#19968;&#26086;&#36890;&#32960;&#24320;&#22987;&#19978;&#21319;&#65292;&#20851;&#27880;&#24230;&#36805;&#36895;&#22686;&#21152;&#12290;&#26412;&#25991;&#26500;&#24314;&#20102;&#19968;&#20010;&#19968;&#33324;&#22343;&#34913;&#36135;&#24065;&#27169;&#22411;&#65292;&#35813;&#27169;&#22411;&#22312;&#36890;&#32960;&#20302;&#32780;&#31283;&#23450;&#26102;&#65292;&#26368;&#20248;&#21270;&#30340;&#31574;&#30053;&#26159;&#23545;&#36890;&#32960;&#20851;&#27880;&#36739;&#23569;&#65292;&#20294;&#19968;&#26086;&#36890;&#32960;&#36229;&#36807;&#26576;&#20010;&#38408;&#20540;&#65292;&#23601;&#20250;&#22686;&#21152;&#20851;&#27880;&#24230;&#12290;&#21033;&#29992;&#35843;&#26597;&#38382;&#21367;&#20013;&#30340;&#36890;&#32960;&#39044;&#26399;&#65292;&#25105;&#20272;&#35745;&#20851;&#27880;&#38408;&#20540;&#22312;4%&#36890;&#32960;&#29575;&#65292;&#39640;&#20851;&#27880;&#21306;&#22495;&#30340;&#20851;&#27880;&#24230;&#26159;&#20302;&#20851;&#27880;&#21306;&#22495;&#30340;&#20004;&#20493;&#12290;&#24403;&#26657;&#20934;&#21040;&#36825;&#20123;&#21457;&#29616;&#26102;&#65292;&#35813;&#27169;&#22411;&#20135;&#29983;&#19982;&#32654;&#22269;&#26368;&#36817;&#36890;&#32960;&#28608;&#22686;&#19968;&#33268;&#30340;&#36890;&#32960;&#21644;&#36890;&#32960;&#39044;&#26399;&#21160;&#24577;&#12290;&#20851;&#27880;&#38408;&#20540;&#23548;&#33268;&#29366;&#24577;&#20381;&#36182;&#24615;&#65306;&#25104;&#26412;&#25512;&#21160;&#20914;&#20987;&#22312;&#36135;&#24065;&#23485;&#26494;&#25919;&#31574;&#26102;&#26356;&#21152;&#36890;&#32960;&#12290;&#36825;&#20123;&#29366;&#24577;&#20381;&#36182;&#24615;&#25928;&#24212;&#22312;&#24658;&#23450;&#20851;&#27880;&#25110;&#29702;&#24615;&#39044;&#26399;&#27169;&#22411;&#20013;&#26159;&#19981;&#23384;&#22312;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
At the outbreak of the recent inflation surge, the public's attention to inflation was low but increased rapidly once inflation started to rise. In this paper, I develop a general equilibrium monetary model where it is optimal for agents to pay little attention to inflation when inflation is low and stable, but in which they increase their attention once inflation exceeds a certain threshold. Using survey inflation expectations, I estimate the attention threshold to be at an inflation rate of 4%, with attention in the high-attention regime being twice as high as in the low-attention regime. When calibrated to match these findings, the model generates inflation and inflation expectation dynamics consistent with the recent inflation surge in the US. The attention threshold induces a state dependency: cost-push shocks become more inflationary in times of loose monetary policy. These state-dependent effects are absent in the model with constant attention or under rational expectations. Fol
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#20855;&#26377;&#20004;&#31181;&#21830;&#21697;&#21644;&#20004;&#31181;&#32784;&#24515;&#31867;&#22411;&#30340;&#32463;&#27982;&#20013;&#30340;&#22343;&#34913;&#21807;&#19968;&#24615;&#38382;&#39064;&#65292;&#24182;&#25552;&#20379;&#20102;&#20445;&#35777;&#21807;&#19968;&#24615;&#30340;&#20805;&#20998;&#26465;&#20214;&#12290;</title><link>http://arxiv.org/abs/2308.09347</link><description>&lt;p&gt;
&#36164;&#20135;&#12289;&#32784;&#24515;&#31867;&#22411;&#21644;&#20004;&#31181;&#21830;&#21697;HARA&#25928;&#29992;&#32463;&#27982;&#20013;&#30340;&#21807;&#19968;&#24615;
&lt;/p&gt;
&lt;p&gt;
Endowments, patience types, and uniqueness in two-good HARA utility economies. (arXiv:2308.09347v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.09347
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#20855;&#26377;&#20004;&#31181;&#21830;&#21697;&#21644;&#20004;&#31181;&#32784;&#24515;&#31867;&#22411;&#30340;&#32463;&#27982;&#20013;&#30340;&#22343;&#34913;&#21807;&#19968;&#24615;&#38382;&#39064;&#65292;&#24182;&#25552;&#20379;&#20102;&#20445;&#35777;&#21807;&#19968;&#24615;&#30340;&#20805;&#20998;&#26465;&#20214;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#22312;&#20855;&#26377;&#20004;&#31181;&#21830;&#21697;&#21644;&#20004;&#31181;&#32784;&#24515;&#31867;&#22411;&#30340;&#32463;&#27982;&#20013;&#65292;&#24314;&#31435;&#20102;&#36164;&#20135;&#12289;&#32784;&#24515;&#31867;&#22411;&#21644;HARA&#20271;&#21162;&#21033;&#25928;&#29992;&#20989;&#25968;&#21442;&#25968;&#20043;&#38388;&#30340;&#32852;&#31995;&#65292;&#20197;&#30830;&#20445;&#22343;&#34913;&#30340;&#21807;&#19968;&#24615;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#20445;&#35777;&#20219;&#24847;$\gamma$&#20540;&#19979;&#22343;&#34913;&#30340;&#21807;&#19968;&#24615;&#30340;&#20805;&#20998;&#26465;&#20214;&#12290;&#36825;&#39033;&#20998;&#26512;&#23545;&#20110;&#20855;&#26377;&#20004;&#31181;&#21830;&#21697;&#21644;&#20004;&#31181;&#20195;&#29702;&#20154;&#31867;&#22411;&#30340;&#32431;&#20132;&#25442;&#32463;&#27982;&#20013;&#30340;&#21807;&#19968;&#24615;&#30340;&#30740;&#31350;&#20570;&#20986;&#20102;&#36129;&#29486;&#65292;&#24182;&#25193;&#23637;&#20102;&#20043;&#21069;&#30340;&#30740;&#31350;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper establishes a link between endowments, patience types, and the parameters of the HARA Bernoulli utility function that ensure equilibrium uniqueness in an economy with two goods and two impatience types with additive separable preferences. We provide sufficient conditions that guarantee uniqueness of equilibrium for any possible value of $\gamma$ in the HARA utility function $\frac{\gamma}{1-\gamma}\left(b+\frac{a}{\gamma}x\right)^{1-\gamma}$. The analysis contributes to the literature on uniqueness in pure exchange economies with two-goods and two agent types and extends the result in [4].
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#19981;&#23436;&#20840;&#20844;&#24320;&#30417;&#27979;&#30340;&#38543;&#26426;&#21338;&#24328;&#20013;&#25913;&#36827;&#30417;&#27979;&#22914;&#20309;&#24433;&#21709;&#26497;&#38480;&#22343;&#34913;&#25910;&#30410;&#38598;&#12290;&#25105;&#20204;&#36890;&#36807;&#24341;&#20837;&#21152;&#26435;&#28151;&#28102;&#20449;&#24687;&#32467;&#26500;&#65292;&#35777;&#26126;&#20102;&#26497;&#38480;&#23436;&#32654;&#20844;&#24320;&#22343;&#34913;&#25910;&#30410;&#38598;&#30340;&#21333;&#35843;&#24615;&#12290;&#25105;&#20204;&#36824;&#20171;&#32461;&#24182;&#35752;&#35770;&#20102;&#21478;&#19968;&#20010;&#36739;&#24369;&#30340;&#26465;&#20214;&#65292;&#29992;&#20110;&#25193;&#23637;&#26497;&#38480;&#22343;&#34913;&#25910;&#30410;&#38598;&#12290;</title><link>http://arxiv.org/abs/2308.09211</link><description>&lt;p&gt;
&#20851;&#20110;&#20449;&#24687;&#32467;&#26500;&#22312;&#38543;&#26426;&#21338;&#24328;&#20013;&#30340;&#20215;&#20540;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
On the Value of Information Structures in Stochastic Games. (arXiv:2308.09211v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.09211
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#19981;&#23436;&#20840;&#20844;&#24320;&#30417;&#27979;&#30340;&#38543;&#26426;&#21338;&#24328;&#20013;&#25913;&#36827;&#30417;&#27979;&#22914;&#20309;&#24433;&#21709;&#26497;&#38480;&#22343;&#34913;&#25910;&#30410;&#38598;&#12290;&#25105;&#20204;&#36890;&#36807;&#24341;&#20837;&#21152;&#26435;&#28151;&#28102;&#20449;&#24687;&#32467;&#26500;&#65292;&#35777;&#26126;&#20102;&#26497;&#38480;&#23436;&#32654;&#20844;&#24320;&#22343;&#34913;&#25910;&#30410;&#38598;&#30340;&#21333;&#35843;&#24615;&#12290;&#25105;&#20204;&#36824;&#20171;&#32461;&#24182;&#35752;&#35770;&#20102;&#21478;&#19968;&#20010;&#36739;&#24369;&#30340;&#26465;&#20214;&#65292;&#29992;&#20110;&#25193;&#23637;&#26497;&#38480;&#22343;&#34913;&#25910;&#30410;&#38598;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#25913;&#36827;&#30417;&#27979;&#22914;&#20309;&#24433;&#21709;&#19981;&#23436;&#20840;&#20844;&#24320;&#30417;&#27979;&#30340;&#38543;&#26426;&#21338;&#24328;&#30340;&#26497;&#38480;&#22343;&#34913;&#25910;&#30410;&#38598;&#12290;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#20010;&#31616;&#21333;&#30340;Blackwell&#28151;&#28102;&#30340;&#25512;&#24191;&#65292;&#31216;&#20026;&#21152;&#26435;&#28151;&#28102;&#65292;&#20197;&#20415;&#27604;&#36739;&#36825;&#31867;&#21338;&#24328;&#30340;&#19981;&#21516;&#20449;&#24687;&#32467;&#26500;&#12290;&#25105;&#20204;&#30340;&#20027;&#35201;&#32467;&#26524;&#26159;&#26497;&#38480;&#23436;&#32654;&#20844;&#24320;&#22343;&#34913;&#65288;PPE&#65289;&#25910;&#30410;&#38598;&#30456;&#23545;&#20110;&#36825;&#31181;&#20449;&#24687;&#39034;&#24207;&#30340;&#21333;&#35843;&#24615;&#65306;&#25105;&#20204;&#35777;&#26126;&#20102;&#22914;&#26524;&#21518;&#19968;&#31181;&#20449;&#24687;&#32467;&#26500;&#26159;&#21069;&#19968;&#31181;&#20449;&#24687;&#32467;&#26500;&#30340;&#21152;&#26435;&#28151;&#28102;&#65292;&#21017;&#25353;&#29366;&#24577;&#27604;&#36739;&#21518;&#19968;&#31181;&#20449;&#24687;&#32467;&#26500;&#30340;&#26497;&#38480;PPE&#25910;&#30410;&#38598;&#35201;&#22823;&#20110;&#21069;&#19968;&#31181;&#20449;&#24687;&#32467;&#26500;&#30340;&#26497;&#38480;PPE&#25910;&#30410;&#38598;&#12290;&#25105;&#20204;&#36824;&#35777;&#26126;&#20102;&#36825;&#31181;&#21333;&#35843;&#24615;&#32467;&#26524;&#22312;&#24378;&#23545;&#31216;&#22343;&#34913;&#31867;&#20013;&#20063;&#25104;&#31435;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#24341;&#20837;&#24182;&#35752;&#35770;&#20102;&#21478;&#19968;&#20010;&#36739;&#24369;&#30340;&#36275;&#22815;&#26465;&#20214;&#65292;&#29992;&#20110;&#25193;&#23637;&#26497;&#38480;PPE&#25910;&#30410;&#38598;&#12290;&#23613;&#31649;&#26356;&#21152;&#22797;&#26434;&#21644;&#38590;&#20197;&#39564;&#35777;&#65292;&#20294;&#22312;&#26576;&#20123;&#29305;&#27530;&#24773;&#20917;&#19979;&#24456;&#26377;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper studies how improved monitoring affects the limit equilibrium payoff set for stochastic games with imperfect public monitoring. We introduce a simple generalization of Blackwell garbling called weighted garbling in order to compare different information structures for this class of games. Our main result is the monotonicity of the limit perfect public equilibrium (PPE) payoff set with respect to this information order: we show that the limit PPE payoff sets with one information structure is larger than the limit PPE payoff sets with another information structure state by state if the latter information structure is a weighted garbling of the former. We show that this monotonicity result also holds for the class of strongly symmetric equilibrium. Finally, we introduce and discuss another weaker sufficient condition for the expansion of limit PPE payoff set. It is more complex and difficult to verify, but useful in some special cases.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#24320;&#21457;&#20102;&#19968;&#31867;&#38381;&#24335;&#36817;&#20284;&#26041;&#27861;&#26469;&#35745;&#31639;&#36830;&#32493;&#26102;&#38388;&#39532;&#23572;&#21487;&#22827;&#27169;&#22411;&#30340;&#30697;&#21644;&#23494;&#24230;&#65292;&#21487;&#20197;&#24191;&#27867;&#24212;&#29992;&#20110;&#36339;&#36291;&#25193;&#25955;&#27169;&#22411;&#12290;&#35813;&#26041;&#27861;&#23558;&#20043;&#21069;&#30340;&#26041;&#27861;&#25193;&#23637;&#21040;&#20102;&#19968;&#33324;&#30340;&#39532;&#23572;&#21487;&#22827;&#36807;&#31243;&#65292;&#36830;&#25509;&#20102;&#30475;&#20284;&#19981;&#21516;&#30340;&#24605;&#24819;&#12290;&#38656;&#35201;&#27880;&#24847;&#30340;&#26159;&#65292;&#32423;&#25968;&#23637;&#24320;&#19981;&#20445;&#35777;&#25910;&#25947;&#65292;&#20294;&#22312;&#25968;&#20540;&#30740;&#31350;&#20013;&#34920;&#29616;&#33391;&#22909;&#12290;</title><link>http://arxiv.org/abs/2308.09009</link><description>&lt;p&gt;
&#36830;&#32493;&#26102;&#38388;&#39532;&#23572;&#21487;&#22827;&#27169;&#22411;&#30340;&#30697;&#21644;&#23494;&#24230;&#30340;&#38381;&#24335;&#36817;&#20284;
&lt;/p&gt;
&lt;p&gt;
Closed-form approximations of moments and densities of continuous-time Markov models. (arXiv:2308.09009v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.09009
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#24320;&#21457;&#20102;&#19968;&#31867;&#38381;&#24335;&#36817;&#20284;&#26041;&#27861;&#26469;&#35745;&#31639;&#36830;&#32493;&#26102;&#38388;&#39532;&#23572;&#21487;&#22827;&#27169;&#22411;&#30340;&#30697;&#21644;&#23494;&#24230;&#65292;&#21487;&#20197;&#24191;&#27867;&#24212;&#29992;&#20110;&#36339;&#36291;&#25193;&#25955;&#27169;&#22411;&#12290;&#35813;&#26041;&#27861;&#23558;&#20043;&#21069;&#30340;&#26041;&#27861;&#25193;&#23637;&#21040;&#20102;&#19968;&#33324;&#30340;&#39532;&#23572;&#21487;&#22827;&#36807;&#31243;&#65292;&#36830;&#25509;&#20102;&#30475;&#20284;&#19981;&#21516;&#30340;&#24605;&#24819;&#12290;&#38656;&#35201;&#27880;&#24847;&#30340;&#26159;&#65292;&#32423;&#25968;&#23637;&#24320;&#19981;&#20445;&#35777;&#25910;&#25947;&#65292;&#20294;&#22312;&#25968;&#20540;&#30740;&#31350;&#20013;&#34920;&#29616;&#33391;&#22909;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#24320;&#21457;&#20102;&#19968;&#31867;&#19968;&#33324;&#30697;&#20989;&#25968;&#30340;&#24130;&#32423;&#25968;&#23637;&#24320;&#65292;&#21253;&#25324;&#36830;&#32493;&#26102;&#38388;&#39532;&#23572;&#21487;&#22827;&#36807;&#31243;&#65288;&#21253;&#25324;&#36339;&#36291;&#25193;&#25955;&#65289;&#30340;&#36716;&#31227;&#23494;&#24230;&#21644;&#26399;&#26435;&#20215;&#26684;&#12290;&#35813;&#25552;&#35758;&#30340;&#23637;&#24320;&#23558;Kristensen&#21644;Mele&#65288;2011&#65289;&#30340;&#23637;&#24320;&#25193;&#23637;&#21040;&#28085;&#30422;&#19968;&#33324;&#30340;&#39532;&#23572;&#21487;&#22827;&#36807;&#31243;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#36825;&#31867;&#23637;&#24320;&#21253;&#21547;&#20102;Yang&#12289;Chen&#21644;Wan&#65288;2019&#65289;&#20197;&#21450;Wan&#21644;Yang&#65288;2021&#65289;&#24320;&#21457;&#30340;&#36716;&#31227;&#23494;&#24230;&#21644;&#26399;&#26435;&#20215;&#26684;&#23637;&#24320;&#20316;&#20026;&#29305;&#27530;&#24773;&#20917;&#65292;&#20174;&#32780;&#23558;&#30475;&#20284;&#19981;&#21516;&#30340;&#24605;&#24819;&#36830;&#25509;&#22312;&#19968;&#20010;&#32479;&#19968;&#30340;&#26694;&#26550;&#20013;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#22914;&#20309;&#23545;&#23436;&#20840;&#19968;&#33324;&#30340;&#36339;&#36291;&#25193;&#25955;&#27169;&#22411;&#23454;&#26045;&#19968;&#33324;&#30340;&#23637;&#24320;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#19968;&#20010;&#26032;&#30340;&#23637;&#24320;&#26377;&#25928;&#24615;&#29702;&#35770;&#65292;&#34920;&#26126;&#22312;&#19968;&#33324;&#24773;&#20917;&#19979;&#65292;&#32423;&#25968;&#23637;&#24320;&#19981;&#20445;&#35777;&#25910;&#25947;&#38543;&#30528;&#26356;&#22810;&#39033;&#30340;&#21152;&#20837;&#12290;&#22240;&#27492;&#65292;&#22312;&#20351;&#29992;&#36825;&#20123;&#26041;&#27861;&#26102;&#24212;&#35813;&#23567;&#24515;&#12290;&#21516;&#26102;&#65292;&#26412;&#25991;&#30340;&#25968;&#20540;&#30740;&#31350;&#35777;&#26126;&#20102;&#25152;&#25552;&#26041;&#27861;&#22312;&#23454;&#36341;&#20013;&#34920;&#29616;&#33391;&#22909;&#65292;&#24403;&#25968;&#25454;&#25968;&#37327;&#36739;&#23567;&#26102;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper develops power series expansions of a general class of moment functions, including transition densities and option prices, of continuous-time Markov processes, including jump--diffusions. The proposed expansions extend the ones in Kristensen and Mele (2011) to cover general Markov processes. We demonstrate that the class of expansions nests the transition density and option price expansions developed in Yang, Chen, and Wan (2019) and Wan and Yang (2021) as special cases, thereby connecting seemingly different ideas in a unified framework. We show how the general expansion can be implemented for fully general jump--diffusion models. We provide a new theory for the validity of the expansions which shows that series expansions are not guaranteed to converge as more terms are added in general. Thus, these methods should be used with caution. At the same time, the numerical studies in this paper demonstrate good performance of the proposed implementation in practice when a small 
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#36890;&#36807;&#32463;&#27982;&#35745;&#37327;&#23398;&#24314;&#27169;&#26041;&#27861;&#30740;&#31350;&#20102;STEM&#25919;&#31574;&#21464;&#21270;&#23545;&#20122;&#27954;&#23398;&#29983;&#22312;&#32654;&#22269;&#25253;&#32771;&#20915;&#31574;&#30340;&#24433;&#21709;&#65292;&#21457;&#29616;STE&#25919;&#31574;&#30340;&#23454;&#26045;&#23545;&#23398;&#29983;&#25253;&#32771;STEM&#19987;&#19994;&#20135;&#29983;&#20102;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2308.08972</link><description>&lt;p&gt;
&#32463;&#27982;&#35745;&#37327;&#23398;&#24314;&#27169;&#26041;&#27861;&#29992;&#20110;&#30740;&#31350;STEM&#25919;&#31574;&#21464;&#21270;&#23545;&#20122;&#27954;&#23398;&#29983;&#22312;&#32654;&#22269;&#30340;&#25253;&#32771;&#20915;&#31574;&#30340;&#24433;&#21709;
&lt;/p&gt;
&lt;p&gt;
Econometrics Modelling Approach to Examine the Effect of STEM Policy Changes on Asian Students Enrollment Decision in USA. (arXiv:2308.08972v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.08972
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#36890;&#36807;&#32463;&#27982;&#35745;&#37327;&#23398;&#24314;&#27169;&#26041;&#27861;&#30740;&#31350;&#20102;STEM&#25919;&#31574;&#21464;&#21270;&#23545;&#20122;&#27954;&#23398;&#29983;&#22312;&#32654;&#22269;&#25253;&#32771;&#20915;&#31574;&#30340;&#24433;&#21709;&#65292;&#21457;&#29616;STE&#25919;&#31574;&#30340;&#23454;&#26045;&#23545;&#23398;&#29983;&#25253;&#32771;STEM&#19987;&#19994;&#20135;&#29983;&#20102;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#23398;&#26415;&#30740;&#31350;&#34920;&#26126;&#65292;&#22269;&#38469;&#23398;&#29983;&#27969;&#21160;&#24615;&#24341;&#36215;&#20102;&#37325;&#22823;&#20851;&#27880;&#65292;&#20808;&#21069;&#30340;&#25991;&#29486;&#20027;&#35201;&#20174;&#25919;&#27835;&#21644;&#20844;&#20849;&#25919;&#31574;&#30340;&#35282;&#24230;&#20851;&#27880;&#36801;&#31227;&#34892;&#19994;&#12290;&#23545;&#20110;&#35768;&#22810;&#22269;&#23478;&#26469;&#35828;&#65292;&#22269;&#38469;&#23398;&#29983;&#27969;&#21160;&#24615;&#36890;&#36807;&#37329;&#34701;&#25910;&#30410;&#21644;&#21560;&#24341;&#26377;&#25216;&#33021;&#30340;&#31227;&#27665;&#22312;&#20854;&#32463;&#27982;&#20013;&#36215;&#21040;&#20102;&#33267;&#20851;&#37325;&#35201;&#30340;&#20316;&#29992;&#12290;&#34429;&#28982;&#20197;&#21069;&#30340;&#30740;&#31350;&#25506;&#35752;&#20102;&#36801;&#31227;&#21644;&#22269;&#23478;&#32463;&#27982;&#25919;&#31574;&#30340;&#20915;&#23450;&#22240;&#32032;&#65292;&#20294;&#21482;&#26377;&#23569;&#25968;&#30740;&#31350;&#32771;&#23519;&#20102;&#25919;&#31574;&#21464;&#21270;&#23545;&#36801;&#31227;&#36235;&#21183;&#30340;&#24433;&#21709;&#12290;&#22312;&#26412;&#30740;&#31350;&#20013;&#65292;&#30740;&#31350;&#20154;&#21592;&#35843;&#26597;&#20102;&#31227;&#27665;&#25919;&#31574;&#21464;&#21270;&#65292;&#23588;&#20854;&#26159;&#23545;STEM&#39033;&#30446;&#30340;&#36873;&#25321;&#24615;&#23454;&#20064;&#22521;&#35757;&#65288;OPT&#65289;&#24310;&#26399;&#23545;&#20122;&#27954;&#23398;&#29983;&#25253;&#32771;&#22823;&#23398;STEM&#19987;&#19994;&#30340;&#20559;&#22909;&#30340;&#24433;&#21709;&#12290;&#30740;&#31350;&#21033;&#29992;&#35266;&#27979;&#25968;&#25454;&#65292;&#37319;&#29992;&#20934;&#23454;&#39564;&#35774;&#35745;&#65292;&#20351;&#29992;&#24046;&#24322;&#27861;&#20998;&#26512;&#20449;&#24687;&#12290;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;STE&#25919;&#31574;&#30340;&#23454;&#26045;&#23545;&#23398;&#29983;&#25253;&#32771;STEM&#19987;&#19994;&#20135;&#29983;&#20102;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
Academic research has shown significant interest in international student mobility, with previous literature primarily focusing on the migration industry from a political and public policy perspective. For many countries, international student mobility plays a crucial role in bolstering their economies through financial gains and attracting skilled immigrants. While previous studies have explored the determinants of mobility and country economic policies, only a few have examined the impact of policy changes on mobility trends. In this study, the researchers investigate the influence of immigration policy changes, particularly the optional practical training (OPT) extension on STEM programs, on Asian students' preference for enrolling in STEM majors at universities. The study utilizes observational data and employs a quasi-experimental design, analysing the information using the difference-in-difference technique. The findings of the research indicate that the implementation of the STE
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20855;&#26377;&#22810;&#20010;&#35299;&#37322;&#21464;&#37327;&#30340;&#32447;&#24615;&#26102;&#38388;&#24207;&#21015;&#22238;&#24402;&#20013;&#30340;&#24369;&#22806;&#29983;&#24615;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#24369;&#22806;&#29983;&#24615;&#21487;&#33021;&#23548;&#33268;&#26174;&#33879;&#20559;&#24046;&#65292;&#24182;&#20351;OLS&#20272;&#35745;&#19981;&#19968;&#33268;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#20559;&#24046;&#26657;&#27491;&#26041;&#27861;&#65292;&#24471;&#21040;&#20102;&#20855;&#26377;&#25913;&#36827;&#24615;&#36136;&#30340;&#26032;&#20272;&#35745;&#37327;&#12290;</title><link>http://arxiv.org/abs/2308.08958</link><description>&lt;p&gt;
&#20855;&#26377;&#24369;&#22806;&#29983;&#24615;&#30340;&#32447;&#24615;&#22238;&#24402;
&lt;/p&gt;
&lt;p&gt;
Linear Regression with Weak Exogeneity. (arXiv:2308.08958v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.08958
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20855;&#26377;&#22810;&#20010;&#35299;&#37322;&#21464;&#37327;&#30340;&#32447;&#24615;&#26102;&#38388;&#24207;&#21015;&#22238;&#24402;&#20013;&#30340;&#24369;&#22806;&#29983;&#24615;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#24369;&#22806;&#29983;&#24615;&#21487;&#33021;&#23548;&#33268;&#26174;&#33879;&#20559;&#24046;&#65292;&#24182;&#20351;OLS&#20272;&#35745;&#19981;&#19968;&#33268;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#20559;&#24046;&#26657;&#27491;&#26041;&#27861;&#65292;&#24471;&#21040;&#20102;&#20855;&#26377;&#25913;&#36827;&#24615;&#36136;&#30340;&#26032;&#20272;&#35745;&#37327;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20855;&#26377;&#22810;&#20010;&#35299;&#37322;&#21464;&#37327;&#30340;&#32447;&#24615;&#26102;&#38388;&#24207;&#21015;&#22238;&#24402;&#12290;&#24369;&#22806;&#29983;&#24615;&#26159;&#26102;&#38388;&#24207;&#21015;&#20998;&#26512;&#20013;&#26368;&#24120;&#29992;&#30340;&#35782;&#21035;&#20551;&#35774;&#12290;&#24369;&#22806;&#29983;&#24615;&#35201;&#27714;&#32467;&#26500;&#35823;&#24046;&#22312;&#32473;&#23450;&#24403;&#21069;&#21644;&#36807;&#21435;&#35299;&#37322;&#21464;&#37327;&#20540;&#30340;&#26465;&#20214;&#19979;&#20855;&#26377;&#38646;&#26465;&#20214;&#26399;&#26395;&#65292;&#20801;&#35768;&#35823;&#24046;&#19982;&#26410;&#26469;&#35299;&#37322;&#21464;&#37327;&#30340;&#23454;&#29616;&#30456;&#20851;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#22312;&#20855;&#26377;&#22810;&#20010;&#25511;&#21046;&#21464;&#37327;&#30340;&#26102;&#38388;&#24207;&#21015;&#22238;&#24402;&#20013;&#65292;&#24369;&#22806;&#29983;&#24615;&#21487;&#33021;&#20135;&#29983;&#26174;&#33879;&#30340;&#20559;&#24046;&#65292;&#29978;&#33267;&#20351;&#26368;&#23567;&#20108;&#20056;&#65288;OLS&#65289;&#20272;&#35745;&#19981;&#19968;&#33268;&#12290;&#22312;&#20855;&#26377;&#22810;&#20010;&#35299;&#37322;&#21464;&#37327;&#30340;&#24773;&#20917;&#19979;&#65292;&#30001;&#20110;&#35268;&#33539;&#21270;&#30340;OLS&#35774;&#35745;&#30697;&#38453;&#20445;&#25345;&#28176;&#36817;&#38543;&#26426;&#65292;&#24182;&#19988;&#22312;&#20165;&#24369;&#22806;&#29983;&#24615;&#25104;&#31435;&#65288;&#20294;&#19981;&#26159;&#20005;&#26684;&#22806;&#29983;&#24615;&#65289;&#26102;&#19982;&#22238;&#24402;&#35823;&#24046;&#30456;&#20851;&#65292;&#22240;&#27492;&#20250;&#20986;&#29616;&#36825;&#31181;&#20559;&#24046;&#12290;&#36825;&#31181;&#20559;&#24046;&#22823;&#23567;&#38543;&#30528;&#35299;&#37322;&#21464;&#37327;&#25968;&#37327;&#21644;&#20854;&#24179;&#22343;&#33258;&#30456;&#20851;&#24615;&#30340;&#22686;&#21152;&#32780;&#22686;&#21152;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#20559;&#24046;&#26657;&#27491;&#26041;&#27861;&#65292;&#24471;&#21040;&#20102;&#30456;&#23545;&#20110;OLS&#20855;&#26377;&#26356;&#22909;&#24615;&#36136;&#30340;&#26032;&#20272;&#35745;&#37327;&#12290;&#25105;&#20204;&#24314;&#31435;&#20102;&#19968;&#33268;&#24615;&#21644;&#26465;&#20214;&#30028;&#23450;
&lt;/p&gt;
&lt;p&gt;
This paper studies linear time series regressions with many regressors. Weak exogeneity is the most used identifying assumption in time series. Weak exogeneity requires the structural error to have zero conditional expectation given the present and past regressor values, allowing errors to correlate with future regressor realizations. We show that weak exogeneity in time series regressions with many controls may produce substantial biases and even render the least squares (OLS) estimator inconsistent. The bias arises in settings with many regressors because the normalized OLS design matrix remains asymptotically random and correlates with the regression error when only weak (but not strict) exogeneity holds. This bias's magnitude increases with the number of regressors and their average autocorrelation. To address this issue, we propose an innovative approach to bias correction that yields a new estimator with improved properties relative to OLS. We establish consistency and conditiona
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#20998;&#26512;&#20102;&#27431;&#27954;&#33021;&#28304;&#31995;&#32479;&#22312;&#27809;&#26377;&#20420;&#32599;&#26031;&#22825;&#28982;&#27668;&#30340;&#24773;&#20917;&#19979;&#30340;&#20943;&#30899;&#31574;&#30053;&#65292;&#21457;&#29616;&#30005;&#21147;&#39046;&#22495;&#36880;&#28176;&#20943;&#23569;&#20351;&#29992;&#22825;&#28982;&#27668;&#24182;&#37319;&#29992;&#20855;&#26377;&#30899;&#25429;&#33719;&#19982;&#20648;&#23384;&#30340;&#29028;&#28845;&#21644;&#21487;&#20877;&#29983;&#33021;&#28304;&#21457;&#30005;&#65292;&#38050;&#38081;&#34892;&#19994;&#20063;&#37319;&#29992;&#20102;&#29028;&#28845;&#21644;&#27682;&#27668;&#26469;&#23454;&#29616;&#33073;&#30899;&#12290;</title><link>http://arxiv.org/abs/2308.08953</link><description>&lt;p&gt;
&#22312;&#27809;&#26377;&#20420;&#32599;&#26031;&#22825;&#28982;&#27668;&#30340;&#24773;&#20917;&#19979;&#20943;&#30899;&#27431;&#27954;&#33021;&#28304;&#31995;&#32479;&#65306;&#30005;&#21147;&#12289;&#28909;&#33021;&#21644;&#24037;&#19994;&#39046;&#22495;&#30340;&#27682;&#27668;&#21033;&#29992;&#21644;&#30899;&#25429;&#33719;&#21457;&#23637;
&lt;/p&gt;
&lt;p&gt;
Decarbonizing the European energy system in the absence of Russian gas: Hydrogen uptake and carbon capture developments in the power, heat and industry sectors. (arXiv:2308.08953v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.08953
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#20998;&#26512;&#20102;&#27431;&#27954;&#33021;&#28304;&#31995;&#32479;&#22312;&#27809;&#26377;&#20420;&#32599;&#26031;&#22825;&#28982;&#27668;&#30340;&#24773;&#20917;&#19979;&#30340;&#20943;&#30899;&#31574;&#30053;&#65292;&#21457;&#29616;&#30005;&#21147;&#39046;&#22495;&#36880;&#28176;&#20943;&#23569;&#20351;&#29992;&#22825;&#28982;&#27668;&#24182;&#37319;&#29992;&#20855;&#26377;&#30899;&#25429;&#33719;&#19982;&#20648;&#23384;&#30340;&#29028;&#28845;&#21644;&#21487;&#20877;&#29983;&#33021;&#28304;&#21457;&#30005;&#65292;&#38050;&#38081;&#34892;&#19994;&#20063;&#37319;&#29992;&#20102;&#29028;&#28845;&#21644;&#27682;&#27668;&#26469;&#23454;&#29616;&#33073;&#30899;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#27682;&#27668;&#21644;&#30899;&#25429;&#33719;&#19982;&#20648;&#23384;&#23545;&#20110;&#22312;&#21508;&#31181;&#36335;&#24452;&#24773;&#26223;&#20013;&#20943;&#30899;&#27431;&#27954;&#33021;&#28304;&#31995;&#32479;&#33267;&#20851;&#37325;&#35201;&#12290;&#28982;&#32780;&#65292;&#23427;&#20204;&#22312;&#19981;&#21516;&#39046;&#22495;&#21644;&#22269;&#23478;&#30340;&#21450;&#26102;&#37319;&#29992;&#21463;&#21040;&#21487;&#20877;&#29983;&#33021;&#28304;&#21644;&#21270;&#30707;&#33021;&#28304;&#20379;&#24212;&#36873;&#25321;&#30340;&#24433;&#21709;&#12290;&#26412;&#25991;&#20998;&#26512;&#20102;&#27431;&#27954;&#33021;&#28304;&#31995;&#32479;&#22312;2060&#24180;&#20043;&#21069;&#30340;&#20943;&#30899;&#24773;&#20917;&#65292;&#28085;&#30422;&#20102;&#30005;&#21147;&#12289;&#28909;&#33021;&#21644;&#24037;&#19994;&#39046;&#22495;&#65292;&#20197;&#21450;&#22312;&#27431;&#27954;&#33073;&#31163;&#20420;&#32599;&#26031;&#22825;&#28982;&#27668;&#21518;&#36825;&#20123;&#39046;&#22495;&#20013;&#27682;&#27668;&#21644;&#30899;&#25429;&#33719;&#19982;&#20648;&#23384;&#30340;&#20351;&#29992;&#21464;&#21270;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;&#22312;&#30005;&#21147;&#39046;&#22495;&#65292;&#22825;&#28982;&#27668;&#30340;&#20351;&#29992;&#26174;&#33879;&#20943;&#23569;&#65292;&#32780;&#20195;&#20043;&#20197;&#20855;&#26377;&#30899;&#25429;&#33719;&#19982;&#20648;&#23384;&#30340;&#29028;&#28845;&#65292;&#24182;&#36827;&#19968;&#27493;&#25193;&#22823;&#21487;&#20877;&#29983;&#21457;&#30005;&#35774;&#22791;&#12290;&#22312;&#38050;&#38081;&#34892;&#19994;&#20013;&#65292;&#24403;&#24573;&#30053;&#20420;&#32599;&#26031;&#22825;&#28982;&#27668;&#26102;&#65292;&#29028;&#28845;&#19982;&#30899;&#25429;&#33719;&#19982;&#20648;&#23384;&#20063;&#34987;&#29992;&#20316;&#20013;&#38388;&#27493;&#39588;&#65292;&#28982;&#21518;&#20877;&#23436;&#20840;&#20351;&#29992;&#27682;&#27668;&#23454;&#29616;&#33073;&#30899;&#12290;&#27682;&#27668;&#30340;&#29983;&#20135;&#22823;&#37096;&#20998;&#20381;&#36182;&#20855;&#26377;&#30899;&#25429;&#33719;&#19982;&#20648;&#23384;&#25216;&#26415;&#30340;&#22825;&#28982;&#27668;&#12290;
&lt;/p&gt;
&lt;p&gt;
Hydrogen and carbon capture and storage are pivotal to decarbonize the European energy system in a broad range of pathway scenarios. Yet, their timely uptake in different sectors and distribution across countries are affected by supply options of renewable and fossil energy sources. Here, we analyze the decarbonization of the European energy system towards 2060, covering the power, heat, and industry sectors, and the change in use of hydrogen and carbon capture and storage in these sectors upon Europe's decoupling from Russian gas. The results indicate that the use of gas is significantly reduced in the power sector, instead being replaced by coal with carbon capture and storage, and with a further expansion of renewable generators. Coal coupled with carbon capture and storage is also used in the steel sector as an intermediary step when Russian gas is neglected, before being fully decarbonized with hydrogen. Hydrogen production mostly relies on natural gas with carbon capture and stor
&lt;/p&gt;</description></item><item><title>&#36825;&#26412;&#20070;&#35752;&#35770;&#20102;&#39640;&#31561;&#25945;&#32946;&#22312;&#30693;&#35782;&#21019;&#36896;&#12289;&#25945;&#23398;&#21644;&#24212;&#29992;&#30740;&#31350;&#26041;&#38754;&#30340;&#35282;&#33394;&#65292;&#24182;&#20998;&#26512;&#20102;&#25104;&#21151;&#30340;&#23398;&#26415;&#21830;&#19994;&#21270;&#26696;&#20363;&#20197;&#21450;&#22823;&#23398;&#22914;&#20309;&#25512;&#21160;&#22320;&#21306;&#21644;&#22269;&#23478;&#30340;&#32463;&#27982;&#21457;&#23637;&#12290;</title><link>http://arxiv.org/abs/2308.08808</link><description>&lt;p&gt;
&#20225;&#19994;&#23478;&#24335;&#39640;&#31561;&#25945;&#32946;&#65306;&#25945;&#32946;&#12289;&#30693;&#35782;&#19982;&#36130;&#23500;&#21019;&#36896;
&lt;/p&gt;
&lt;p&gt;
Entrepreneurial Higher Education Education, Knowledge and Wealth Creation. (arXiv:2308.08808v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.08808
&lt;/p&gt;
&lt;p&gt;
&#36825;&#26412;&#20070;&#35752;&#35770;&#20102;&#39640;&#31561;&#25945;&#32946;&#22312;&#30693;&#35782;&#21019;&#36896;&#12289;&#25945;&#23398;&#21644;&#24212;&#29992;&#30740;&#31350;&#26041;&#38754;&#30340;&#35282;&#33394;&#65292;&#24182;&#20998;&#26512;&#20102;&#25104;&#21151;&#30340;&#23398;&#26415;&#21830;&#19994;&#21270;&#26696;&#20363;&#20197;&#21450;&#22823;&#23398;&#22914;&#20309;&#25512;&#21160;&#22320;&#21306;&#21644;&#22269;&#23478;&#30340;&#32463;&#27982;&#21457;&#23637;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#20070;&#35814;&#32454;&#35752;&#35770;&#20102;&#39640;&#31561;&#25945;&#32946;&#22312;&#22522;&#30784;&#30693;&#35782;&#21019;&#36896;&#12289;&#25945;&#23398;&#21644;&#24212;&#29992;&#30740;&#31350;&#20197;&#21830;&#19994;&#21270;&#26041;&#38754;&#30340;&#20316;&#29992;&#12290;&#26412;&#20070;&#25552;&#20379;&#20102;&#25945;&#32946;&#21382;&#21490;&#19978;&#22914;&#20309;&#35299;&#20915;&#36825;&#19968;&#25361;&#25112;&#65292;&#25104;&#21151;&#30340;&#23398;&#26415;&#21830;&#19994;&#21270;&#26696;&#20363;&#65292;&#22522;&#30784;&#31185;&#23398;&#19982;&#24212;&#29992;&#31185;&#23398;&#30340;&#32467;&#21512;&#20197;&#21450;&#22823;&#23398;&#22914;&#20309;&#21457;&#23637;&#22320;&#21306;&#21644;&#22269;&#23478;&#32463;&#27982;&#30340;&#21382;&#21490;&#36134;&#25143;&#12290;&#26412;&#20070;&#36824;&#35752;&#35770;&#20102;&#30740;&#31350;&#21830;&#19994;&#21270;&#20013;&#30340;&#25991;&#21270;&#21644;&#31038;&#20250;&#25361;&#25112;&#65292;&#20197;&#21450;&#25171;&#30772;&#29616;&#29366;&#30340;&#36884;&#24452;&#12290;
&lt;/p&gt;
&lt;p&gt;
This book presents detailed discussion on the role of higher education in terms of serving basic knowledge creation, teaching, and doing applied research for commercialization. The book presents an historical account on how this challenge was addressed earlier in education history, the cases of successful academic commercialization, the marriage between basic and applied science and how universities develop economies of the regions and countries. This book also discusses cultural and social challenges in research commercialization and pathways to break the status quo.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLMs&#65289;&#23545;&#20013;&#22269;&#21171;&#21160;&#24066;&#22330;&#30340;&#28508;&#22312;&#24433;&#21709;&#65292;&#24182;&#20998;&#26512;&#20102;&#32844;&#19994;&#23545;LLM&#33021;&#21147;&#30340;&#26292;&#38706;&#31243;&#24230;&#21450;&#20854;&#19982;&#24037;&#36164;&#27700;&#24179;&#21644;&#32463;&#39564;&#28322;&#20215;&#20043;&#38388;&#30340;&#20851;&#31995;&#12290;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;&#39640;&#34218;&#21644;&#32463;&#39564;&#23494;&#38598;&#22411;&#24037;&#20316;&#21487;&#33021;&#38754;&#20020;&#26356;&#22823;&#30340;&#26367;&#20195;&#39118;&#38505;&#12290;&#27492;&#22806;&#65292;&#30740;&#31350;&#36824;&#24320;&#21457;&#20102;&#19968;&#20010;&#32771;&#34385;&#34892;&#19994;&#26292;&#38706;&#30340;&#32463;&#27982;&#22686;&#38271;&#27169;&#22411;&#65292;&#20197;&#37327;&#21270;AI&#37319;&#29992;&#23545;&#29983;&#20135;&#21147;&#21644;&#23601;&#19994;&#20043;&#38388;&#30340;&#26435;&#34913;&#12290;&#36825;&#39033;&#30740;&#31350;&#20026;&#29702;&#35299;&#20013;&#22269;&#21171;&#21160;&#24066;&#22330;&#20013;&#36234;&#26469;&#36234;&#24378;&#22823;&#30340;AI&#31995;&#32479;&#30340;&#24433;&#21709;&#25552;&#20379;&#20102;&#22522;&#30784;&#12290;</title><link>http://arxiv.org/abs/2308.08776</link><description>&lt;p&gt;
&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#22312;&#20013;&#22269;&#21171;&#21160;&#24066;&#22330;&#30340;&#24212;&#29992;
&lt;/p&gt;
&lt;p&gt;
Large Language Models at Work in China's Labor Market. (arXiv:2308.08776v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.08776
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLMs&#65289;&#23545;&#20013;&#22269;&#21171;&#21160;&#24066;&#22330;&#30340;&#28508;&#22312;&#24433;&#21709;&#65292;&#24182;&#20998;&#26512;&#20102;&#32844;&#19994;&#23545;LLM&#33021;&#21147;&#30340;&#26292;&#38706;&#31243;&#24230;&#21450;&#20854;&#19982;&#24037;&#36164;&#27700;&#24179;&#21644;&#32463;&#39564;&#28322;&#20215;&#20043;&#38388;&#30340;&#20851;&#31995;&#12290;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;&#39640;&#34218;&#21644;&#32463;&#39564;&#23494;&#38598;&#22411;&#24037;&#20316;&#21487;&#33021;&#38754;&#20020;&#26356;&#22823;&#30340;&#26367;&#20195;&#39118;&#38505;&#12290;&#27492;&#22806;&#65292;&#30740;&#31350;&#36824;&#24320;&#21457;&#20102;&#19968;&#20010;&#32771;&#34385;&#34892;&#19994;&#26292;&#38706;&#30340;&#32463;&#27982;&#22686;&#38271;&#27169;&#22411;&#65292;&#20197;&#37327;&#21270;AI&#37319;&#29992;&#23545;&#29983;&#20135;&#21147;&#21644;&#23601;&#19994;&#20043;&#38388;&#30340;&#26435;&#34913;&#12290;&#36825;&#39033;&#30740;&#31350;&#20026;&#29702;&#35299;&#20013;&#22269;&#21171;&#21160;&#24066;&#22330;&#20013;&#36234;&#26469;&#36234;&#24378;&#22823;&#30340;AI&#31995;&#32479;&#30340;&#24433;&#21709;&#25552;&#20379;&#20102;&#22522;&#30784;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25506;&#35752;&#20102;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLMs&#65289;&#23545;&#20013;&#22269;&#21171;&#21160;&#24066;&#22330;&#30340;&#28508;&#22312;&#24433;&#21709;&#12290;&#25105;&#20204;&#36890;&#36807;&#32467;&#21512;&#20154;&#31867;&#19987;&#19994;&#30693;&#35782;&#21644;LLM&#20998;&#31867;&#65292;&#25353;&#29031;Eloundou&#31561;&#20154;&#65288;2023&#65289;&#30340;&#26041;&#27861;&#20998;&#26512;&#20102;&#32844;&#19994;&#23545;LLM&#33021;&#21147;&#30340;&#26292;&#38706;&#31243;&#24230;&#12290;&#28982;&#21518;&#23558;&#32844;&#19994;&#26292;&#38706;&#31243;&#24230;&#32858;&#21512;&#21040;&#34892;&#19994;&#27700;&#24179;&#19978;&#65292;&#24471;&#21040;&#34892;&#19994;&#26292;&#38706;&#24471;&#20998;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;&#32844;&#19994;&#26292;&#38706;&#21644;&#24037;&#36164;&#27700;&#24179;/&#32463;&#39564;&#28322;&#20215;&#20043;&#38388;&#23384;&#22312;&#27491;&#30456;&#20851;&#20851;&#31995;&#65292;&#34920;&#26126;&#39640;&#34218;&#21644;&#32463;&#39564;&#23494;&#38598;&#22411;&#30340;&#24037;&#20316;&#21487;&#33021;&#38754;&#20020;&#30528;LLM&#39537;&#21160;&#36719;&#20214;&#30340;&#26356;&#22823;&#26367;&#20195;&#39118;&#38505;&#12290;&#34892;&#19994;&#26292;&#38706;&#24471;&#20998;&#19982;&#19987;&#23478;&#35780;&#20272;&#21644;&#32463;&#27982;&#30452;&#35273;&#30456;&#19968;&#33268;&#12290;&#25105;&#20204;&#36824;&#24320;&#21457;&#20102;&#19968;&#20010;&#32771;&#34385;&#34892;&#19994;&#26292;&#38706;&#30340;&#32463;&#27982;&#22686;&#38271;&#27169;&#22411;&#65292;&#20197;&#37327;&#21270;AI&#37319;&#29992;&#24102;&#26469;&#30340;&#29983;&#20135;&#21147;&#21644;&#23601;&#19994;&#20043;&#38388;&#30340;&#26435;&#34913;&#12290;&#24635;&#20307;&#26469;&#35828;&#65292;&#26412;&#30740;&#31350;&#20026;&#29702;&#35299;&#20013;&#22269;&#36234;&#26469;&#36234;&#24378;&#22823;&#30340;AI&#31995;&#32479;&#23545;&#21171;&#21160;&#24066;&#22330;&#30340;&#24433;&#21709;&#25552;&#20379;&#20102;&#20998;&#26512;&#22522;&#30784;&#12290;&#20027;&#35201;&#21019;&#26032;&#21253;&#25324;&#32844;&#19994;&#27700;&#24179;&#30340;&#26292;&#38706;&#24773;&#20917;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper explores the potential impacts of large language models (LLMs) on the Chinese labor market. We analyze occupational exposure to LLM capabilities by incorporating human expertise and LLM classifications, following Eloundou et al. (2023)'s methodology. We then aggregate occupation exposure to the industry level to obtain industry exposure scores. The results indicate a positive correlation between occupation exposure and wage levels/experience premiums, suggesting higher-paying and experience-intensive jobs may face greater displacement risks from LLM-powered software. The industry exposure scores align with expert assessments and economic intuitions. We also develop an economic growth model incorporating industry exposure to quantify the productivity-employment trade-off from AI adoption. Overall, this study provides an analytical basis for understanding the labor market impacts of increasingly capable AI systems in China. Key innovations include the occupation-level exposure
&lt;/p&gt;</description></item><item><title>&#20013;&#22269;&#21644;&#32654;&#22269;&#22312;&#20840;&#29699;&#31185;&#23398;&#36164;&#37329;&#20013;&#25198;&#28436;&#30528;&#37325;&#35201;&#35282;&#33394;&#65292;&#20013;&#22269;&#22312;&#22269;&#20869;&#21644;&#22269;&#38469;&#36164;&#37329;&#26041;&#38754;&#30340;&#27963;&#21160;&#38750;&#24120;&#24378;&#21170;&#65292;&#32780;&#32654;&#22269;&#21017;&#20445;&#25345;&#30528;&#22823;&#22810;&#25968;&#22269;&#23478;&#30340;&#26368;&#37325;&#35201;&#30740;&#31350;&#21512;&#20316;&#20249;&#20276;&#22320;&#20301;&#12290;</title><link>http://arxiv.org/abs/2308.08630</link><description>&lt;p&gt;
&#20840;&#29699;&#31185;&#23398;&#36164;&#37329;&#30340;&#21512;&#20316;&#19982;&#30456;&#20114;&#20381;&#36182;
&lt;/p&gt;
&lt;p&gt;
Cooperation and interdependence in global science funding. (arXiv:2308.08630v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.08630
&lt;/p&gt;
&lt;p&gt;
&#20013;&#22269;&#21644;&#32654;&#22269;&#22312;&#20840;&#29699;&#31185;&#23398;&#36164;&#37329;&#20013;&#25198;&#28436;&#30528;&#37325;&#35201;&#35282;&#33394;&#65292;&#20013;&#22269;&#22312;&#22269;&#20869;&#21644;&#22269;&#38469;&#36164;&#37329;&#26041;&#38754;&#30340;&#27963;&#21160;&#38750;&#24120;&#24378;&#21170;&#65292;&#32780;&#32654;&#22269;&#21017;&#20445;&#25345;&#30528;&#22823;&#22810;&#25968;&#22269;&#23478;&#30340;&#26368;&#37325;&#35201;&#30740;&#31350;&#21512;&#20316;&#20249;&#20276;&#22320;&#20301;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#30740;&#21457;&#25237;&#36164;&#23545;&#31185;&#23398;&#21644;&#32463;&#27982;&#21457;&#23637;&#20197;&#21450;&#31038;&#20250;&#31119;&#31049;&#33267;&#20851;&#37325;&#35201;&#12290;&#30001;&#20110;&#31185;&#23398;&#30740;&#31350;&#38656;&#35201;&#22823;&#37327;&#36164;&#28304;&#65292;&#22269;&#23478;&#31185;&#23398;&#25237;&#36164;&#26159;&#31185;&#23398;&#20135;&#20986;&#30340;&#37325;&#35201;&#25512;&#21160;&#32773;&#12290;&#38543;&#30528;&#31185;&#23398;&#20135;&#20986;&#26085;&#30410;&#22269;&#38469;&#21270;&#65292;&#30740;&#31350;&#21508;&#22269;&#31185;&#23398;&#27963;&#21160;&#22312;&#22269;&#20869;&#21644;&#22269;&#38469;&#19978;&#30340;&#36164;&#37329;&#26469;&#28304;&#22914;&#20309;&#25104;&#20026;&#19968;&#20010;&#33267;&#20851;&#37325;&#35201;&#30340;&#30740;&#31350;&#35838;&#39064;&#12290;&#36890;&#36807;&#36861;&#36394;&#23398;&#26415;&#35770;&#25991;&#20013;&#24471;&#21040;&#25215;&#35748;&#30340;&#30740;&#31350;&#25320;&#27454;&#65292;&#25105;&#20204;&#30340;&#30740;&#31350;&#25581;&#31034;&#20102;&#20013;&#22269;&#21644;&#32654;&#22269;&#22312;&#20840;&#29699;&#36164;&#37329;&#26684;&#23616;&#20013;&#30340;&#21452;&#22836;&#22404;&#26029;&#65292;&#36164;&#37329;&#27169;&#24335;&#25130;&#28982;&#19981;&#21516;&#12290;&#23613;&#31649;&#20013;&#22269;&#22312;&#22269;&#20869;&#21644;&#22269;&#38469;&#36164;&#37329;&#26041;&#38754;&#30340;&#36164;&#37329;&#27963;&#21160;&#38750;&#24120;&#24378;&#21170;&#65292;&#36229;&#36807;&#20102;&#32654;&#22269;&#65292;&#20294;&#32654;&#22269;&#22312;&#20316;&#20026;&#22823;&#22810;&#25968;&#22269;&#23478;&#26368;&#37325;&#35201;&#30340;&#30740;&#31350;&#21512;&#20316;&#20249;&#20276;&#26041;&#38754;&#20173;&#28982;&#20445;&#25345;&#30528;&#26368;&#37325;&#35201;&#30340;&#22320;&#20301;&#12290;&#25105;&#20204;&#30340;&#32467;&#26524;&#36824;&#20984;&#26174;&#20102;&#20302;&#25910;&#20837;&#21644;&#20013;&#31561;&#25910;&#20837;&#22269;&#23478;&#23545;&#20840;&#29699;&#36164;&#37329;&#20013;&#26029;&#30340;&#19981;&#31283;&#23450;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Research and development investments are key to scientific and economic development and to the well-being of society. Because scientific research demands significant resources, national scientific investment is a crucial driver of scientific production. As scientific production becomes increasingly multinational, it is critically important to study how nations' scientific activities are funded both domestically and internationally. By tracing research grants acknowledged in scholarly publications, our study reveals a duopoly of China and the United States in the global funding landscape, with a contrasting funding pattern; while China has surpassed the United States both in acknowledged domestic and international funding with its strong funding activity for the Chinese institutions, the United States largely maintains its place as the most important research partner for most countries. Our results also highlight the precarity of low- and middle-income countries to global funding disrup
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#39318;&#27425;&#26126;&#30830;&#21015;&#20030;&#20102;&#22312;$n\leq 7$&#20010;&#36873;&#39033;&#19978;&#30340;&#25152;&#26377;&#26368;&#22823;Condorcet&#39046;&#22495;&#65292;&#36890;&#36807;&#24320;&#21457;&#26032;&#31639;&#27861;&#24182;&#22312;&#36229;&#32423;&#35745;&#31639;&#26426;&#19978;&#23454;&#29616;&#65292;&#35299;&#20915;&#20102;&#31038;&#20250;&#31185;&#23398;&#21644;&#25968;&#23398;&#39046;&#22495;&#30340;&#22810;&#20010;&#26410;&#35299;&#38382;&#39064;&#65292;&#21516;&#26102;&#32473;&#20986;&#20102;&#20851;&#20110;Condorcet&#39046;&#22495;&#23545;&#31216;&#24615;&#30340;&#26032;&#32467;&#26524;&#65292;&#20197;&#21450;&#19982;&#20854;&#20182;&#39046;&#22495;&#31867;&#22411;&#30340;&#32852;&#31995;&#12290;</title><link>http://arxiv.org/abs/2306.15993</link><description>&lt;p&gt;
&#26368;&#22810;&#19971;&#20010;&#36873;&#39033;&#30340;Condorcet&#39046;&#22495;
&lt;/p&gt;
&lt;p&gt;
Condorcet Domains of Degree at most Seven. (arXiv:2306.15993v2 [cs.DM] CROSS LISTED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.15993
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#39318;&#27425;&#26126;&#30830;&#21015;&#20030;&#20102;&#22312;$n\leq 7$&#20010;&#36873;&#39033;&#19978;&#30340;&#25152;&#26377;&#26368;&#22823;Condorcet&#39046;&#22495;&#65292;&#36890;&#36807;&#24320;&#21457;&#26032;&#31639;&#27861;&#24182;&#22312;&#36229;&#32423;&#35745;&#31639;&#26426;&#19978;&#23454;&#29616;&#65292;&#35299;&#20915;&#20102;&#31038;&#20250;&#31185;&#23398;&#21644;&#25968;&#23398;&#39046;&#22495;&#30340;&#22810;&#20010;&#26410;&#35299;&#38382;&#39064;&#65292;&#21516;&#26102;&#32473;&#20986;&#20102;&#20851;&#20110;Condorcet&#39046;&#22495;&#23545;&#31216;&#24615;&#30340;&#26032;&#32467;&#26524;&#65292;&#20197;&#21450;&#19982;&#20854;&#20182;&#39046;&#22495;&#31867;&#22411;&#30340;&#32852;&#31995;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#39318;&#27425;&#26126;&#30830;&#21015;&#20030;&#20102;&#25152;&#26377;&#22312;$n\leq 7$&#20010;&#36873;&#39033;&#19978;&#30340;&#26368;&#22823;Condorcet&#39046;&#22495;&#12290;&#36890;&#36807;&#24320;&#21457;&#19968;&#31181;&#26032;&#30340;&#26500;&#36896;Condorcet&#39046;&#22495;&#30340;&#31639;&#27861;&#65292;&#24182;&#22312;&#36229;&#32423;&#35745;&#31639;&#26426;&#19978;&#23454;&#29616;&#35813;&#31639;&#27861;&#30340;&#36816;&#34892;&#65292;&#25105;&#20204;&#23436;&#25104;&#20102;&#36825;&#19968;&#30446;&#26631;&#12290;&#38543;&#21518;&#65292;&#25105;&#20204;&#23545;&#25152;&#26377;&#26368;&#22823;Condorcet&#39046;&#22495;&#22312;&#24230;&#25968;&#20026;7&#30340;&#24773;&#20917;&#19979;&#30340;&#23646;&#24615;&#36827;&#34892;&#20102;&#39318;&#27425;&#35843;&#26597;&#65292;&#28041;&#21450;&#31038;&#20250;&#31185;&#23398;&#21644;&#25968;&#23398;&#25991;&#29486;&#20013;&#30740;&#31350;&#30340;&#35768;&#22810;&#23646;&#24615;&#12290;&#25105;&#20204;&#36890;&#36807;&#25968;&#25454;&#31034;&#20363;&#21644;&#23450;&#29702;&#35299;&#20915;&#20102;&#20854;&#20182;&#20316;&#32773;&#25552;&#20986;&#30340;&#20960;&#20010;&#26410;&#35299;&#30097;&#38382;&#12290;&#25105;&#20204;&#32473;&#20986;&#20102;&#19968;&#32452;&#20851;&#20110;Condorcet&#39046;&#22495;&#23545;&#31216;&#24615;&#30340;&#26032;&#32467;&#26524;&#65292;&#32479;&#19968;&#20102;&#20043;&#21069;&#30340;&#20316;&#21697;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#35752;&#35770;&#20102;&#19982;&#38750;&#29420;&#35009;&#39046;&#22495;&#21644;&#27867;&#21270;&#30340;&#21333;&#23792;&#39046;&#22495;&#31561;&#20854;&#20182;&#39046;&#22495;&#31867;&#22411;&#30340;&#32852;&#31995;&#12290;&#25105;&#20204;&#36890;&#36807;&#19968;&#20010;&#26032;&#30340;&#32593;&#31449;&#20813;&#36153;&#25552;&#20379;&#25152;&#26377;&#25968;&#25454;&#20379;&#20854;&#20182;&#30740;&#31350;&#32773;&#20351;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this paper we give the first explicit enumeration of all maximal Condorcet domains on $n\leq 7$ alternatives. This has been accomplished by developing a new algorithm for constructing Condorcet domains, and an implementation of that algorithm which has been run on a supercomputer.  We follow this up by the first survey of the properties of all maximal Condorcet domains up to degree 7, with respect to many properties studied in the social sciences and mathematical literature. We resolve several open questions posed by other authors, both by examples from our data and theorems. We give a new set of results on the symmetry properties of Condorcet domains which unify earlier works.  Finally we discuss connections to other domain types such as non-dictatorial domains and generalisations of single-peaked domains. All our data is made freely available for other researches via a new website.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#22806;&#37096;&#20449;&#24687;&#21644;&#20844;&#21496;&#25259;&#38706;&#30340;&#19981;&#30830;&#23450;&#30456;&#20851;&#24615;&#23545;&#25237;&#36164;&#32773;&#20449;&#24565;&#21644;&#24066;&#22330;&#20215;&#26684;&#30340;&#24433;&#21709;&#65292;&#32467;&#26524;&#34920;&#26126;&#25237;&#36164;&#32773;&#26356;&#20542;&#21521;&#20110;&#35823;&#35299;&#26377;&#21033;&#20110;&#20844;&#21496;&#30340;&#22806;&#37096;&#20449;&#21495;&#65292;&#20844;&#21496;&#30340;&#33258;&#24895;&#25259;&#38706;&#21487;&#33021;&#20250;&#23548;&#33268;&#20215;&#26684;&#19979;&#36300;&#12290;</title><link>http://arxiv.org/abs/2304.09262</link><description>&lt;p&gt;
&#24102;&#30528;&#19968;&#22359;&#30416;&#65306;&#22806;&#37096;&#20449;&#24687;&#19982;&#20844;&#21496;&#25259;&#38706;&#30340;&#19981;&#30830;&#23450;&#30456;&#20851;&#24615;
&lt;/p&gt;
&lt;p&gt;
With a Grain of Salt: Uncertain Relevance of External Information and Firm Disclosures. (arXiv:2304.09262v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.09262
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22806;&#37096;&#20449;&#24687;&#21644;&#20844;&#21496;&#25259;&#38706;&#30340;&#19981;&#30830;&#23450;&#30456;&#20851;&#24615;&#23545;&#25237;&#36164;&#32773;&#20449;&#24565;&#21644;&#24066;&#22330;&#20215;&#26684;&#30340;&#24433;&#21709;&#65292;&#32467;&#26524;&#34920;&#26126;&#25237;&#36164;&#32773;&#26356;&#20542;&#21521;&#20110;&#35823;&#35299;&#26377;&#21033;&#20110;&#20844;&#21496;&#30340;&#22806;&#37096;&#20449;&#21495;&#65292;&#20844;&#21496;&#30340;&#33258;&#24895;&#25259;&#38706;&#21487;&#33021;&#20250;&#23548;&#33268;&#20215;&#26684;&#19979;&#36300;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22806;&#37096;&#20449;&#21495;&#65288;&#20363;&#22914;&#26377;&#20851;&#31454;&#20105;&#23545;&#25163;&#25110;&#23439;&#35266;&#32463;&#27982;&#22240;&#32032;&#21464;&#21270;&#30340;&#26032;&#38395;&#65289;&#30456;&#20851;&#24615;&#30340;&#19981;&#30830;&#23450;&#24615;&#22914;&#20309;&#24433;&#21709;&#25237;&#36164;&#32773;&#20449;&#24565;&#12289;&#24066;&#22330;&#20215;&#26684;&#21644;&#20844;&#21496;&#33258;&#24895;&#25259;&#38706;&#12290;&#23613;&#31649;&#20551;&#35774;&#20449;&#21495;&#30456;&#20851;&#24615;&#19982;&#20844;&#21496;&#32463;&#29702;&#20449;&#24687;&#25317;&#26377;&#30456;&#20114;&#29420;&#31435;&#65292;&#25105;&#20204;&#30340;&#32467;&#26524;&#34920;&#26126;&#65306;&#65288;i&#65289;&#26377;&#21033;&#30340;&#22806;&#37096;&#20449;&#21495;&#34987;&#35748;&#20026;&#19981;&#37027;&#20040;&#37325;&#35201;&#65307;&#65288;ii&#65289;&#22240;&#20026;&#36825;&#20123;&#20449;&#21495;&#34987;&#8220;&#24102;&#30528;&#19968;&#22359;&#30416;&#8221;&#25509;&#21463;&#65292;&#25237;&#36164;&#32773;&#20449;&#24565;&#32463;&#29702;&#25317;&#26377;&#19981;&#21033;&#20449;&#24687;&#34987;&#21152;&#24378;&#12290;&#22240;&#27492;&#65292;&#25237;&#36164;&#32773;&#20449;&#24565;&#20013;&#30340;&#19981;&#36830;&#32493;&#24615;&#21644;&#32929;&#31080;&#20215;&#26684;&#30340;&#38750;&#21333;&#35843;&#24615;&#21487;&#33021;&#20250;&#23548;&#33268;&#26356;&#26377;&#21033;&#30340;&#22806;&#37096;&#20449;&#21495;&#20986;&#29616;&#30683;&#30462;&#22320;&#23548;&#33268;&#24066;&#22330;&#20272;&#20540;&#19979;&#38477;&#12290;&#19982;&#36825;&#19968;&#39046;&#22495;&#19981;&#26029;&#22686;&#38271;&#30340;&#23454;&#35777;&#35777;&#25454;&#19968;&#33268;&#65292;&#25105;&#20204;&#30340;&#27169;&#22411;&#39044;&#27979;&#20102;&#23545;&#26377;&#21033;&#21644;&#19981;&#21033;&#26032;&#38395;&#30340;&#19981;&#23545;&#31216;&#20215;&#26684;&#21453;&#24212;&#20197;&#21450;&#20844;&#21496;&#25259;&#38706;&#21518;&#21487;&#33021;&#20986;&#29616;&#30340;&#20215;&#26684;&#19979;&#38477;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper examines how uncertainty about the relevance of external signals (such as news about a competitor or about changes in macroeconomic factors) influences investor beliefs, market prices and voluntary disclosures by companies. Despite assuming independence between the signal relevance and the endowment with information of a firm manager, our results show that: (i) favorable external signals are perceived to be less relevant; (ii) because such signals are taken ``with a grain of salt," the investor beliefs that the manager is endowed with unfavorable information are reinforced. As a consequence, a discontinuity in investor beliefs and non-monotonicity in stock prices may occur, such that more favorable external signals could paradoxically lead to a decrease in market valuation. In line with the growing empirical evidence in this area, our model predicts asymmetric price reactions to favorable and unfavorable news as well as potential price declines following firm disclosures.
&lt;/p&gt;</description></item><item><title>&#30740;&#31350;&#35777;&#26126;&#65292;&#30456;&#23545;&#20110;&#20256;&#32479;&#22810;&#25968;&#31080;&#25237;&#31080;&#65292;&#30636;&#26102;&#25490;&#21517;&#25237;&#31080;&#22312;&#23545;&#31216;&#20998;&#24067;&#30340;&#36873;&#27665;&#20559;&#22909;&#26465;&#20214;&#19979;&#20855;&#26377;&#20013;&#21644;&#25928;&#24212;&#65292;&#21487;&#20197;&#36991;&#20813;&#36873;&#20986;&#26497;&#31471;&#20505;&#36873;&#20154;&#12290;</title><link>http://arxiv.org/abs/2303.09734</link><description>&lt;p&gt;
&#30636;&#26102;&#25490;&#21517;&#25237;&#31080;&#20013;&#30340;&#20013;&#21644;&#24615;&#20998;&#26512;
&lt;/p&gt;
&lt;p&gt;
Moderation in instant runoff voting. (arXiv:2303.09734v1 [cs.MA])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.09734
&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#35777;&#26126;&#65292;&#30456;&#23545;&#20110;&#20256;&#32479;&#22810;&#25968;&#31080;&#25237;&#31080;&#65292;&#30636;&#26102;&#25490;&#21517;&#25237;&#31080;&#22312;&#23545;&#31216;&#20998;&#24067;&#30340;&#36873;&#27665;&#20559;&#22909;&#26465;&#20214;&#19979;&#20855;&#26377;&#20013;&#21644;&#25928;&#24212;&#65292;&#21487;&#20197;&#36991;&#20813;&#36873;&#20986;&#26497;&#31471;&#20505;&#36873;&#20154;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36817;&#24180;&#26469;&#65292;&#30636;&#26102;&#25490;&#21517;&#25237;&#31080;&#65288;IRV&#65289;&#20316;&#20026;&#20256;&#32479;&#22810;&#25968;&#31080;&#25237;&#31080;&#30340;&#19968;&#31181;&#26367;&#20195;&#26041;&#24335;&#22791;&#21463;&#27426;&#36814;&#12290;&#25903;&#25345;&#32773;&#22768;&#31216;IRV&#30456;&#23545;&#20110;&#22810;&#25968;&#31080;&#25237;&#31080;&#30340;&#22909;&#22788;&#20043;&#19968;&#26159;&#23427;&#20542;&#21521;&#20110;&#20013;&#38388;&#27966;&#65306;&#23427;&#20135;&#29983;&#27604;&#22810;&#25968;&#31080;&#26356;&#20026;&#28201;&#21644;&#30340;&#32988;&#32773;&#65292;&#22240;&#27492;&#21487;&#20197;&#25104;&#20026;&#35299;&#20915;&#26497;&#21270;&#38382;&#39064;&#30340;&#26377;&#29992;&#24037;&#20855;&#12290;&#28982;&#32780;&#65292;&#23545;&#20110;&#36825;&#31181;&#35828;&#27861;&#65292;&#24456;&#23569;&#26377;&#29702;&#35770;&#25903;&#25345;&#65292;&#29616;&#26377;&#30340;&#35777;&#25454;&#37117;&#26159;&#22522;&#20110;&#27169;&#25311;&#21644;&#26696;&#20363;&#30740;&#31350;&#30340;&#12290;&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#22312;&#19968;&#32500;&#27431;&#20960;&#37324;&#24471;&#27169;&#22411;&#20013;&#30340;&#36873;&#27665;&#20559;&#22909;&#26465;&#20214;&#19979;&#65292;&#35777;&#26126;&#20102;IRV&#30456;&#23545;&#20110;&#20256;&#32479;&#30340;&#22810;&#25968;&#31080;&#25237;&#31080;&#20855;&#26377;&#19968;&#23450;&#30340;&#20013;&#21644;&#25928;&#24212;&#12290;&#25105;&#20204;&#30340;&#32467;&#26524;&#34920;&#26126;&#65292;&#21482;&#35201;&#36873;&#27665;&#30340;&#20998;&#24067;&#26159;&#23545;&#31216;&#30340;&#65292;&#24182;&#19988;&#19981;&#22826;&#38598;&#20013;&#20110;&#26497;&#31471;&#65292;IRV&#23601;&#19981;&#20250;&#36873;&#20986;&#36229;&#36807;&#20998;&#24067;&#23614;&#37096;&#26576;&#20010;&#38408;&#20540;&#20043;&#22806;&#30340;&#20505;&#36873;&#20154;&#65292;&#32780;&#22810;&#25968;&#31080;&#21017;&#21487;&#33021;&#20250;&#12290;&#23545;&#20110;&#22343;&#21248;&#20998;&#24067;&#65292;&#25105;&#20204;&#25552;&#20379;&#20102;&#25512;&#23548;&#20986;&#22810;&#25968;&#31080;&#21644;IRV&#31934;&#30830;&#20998;&#24067;&#30340;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
Instant runoff voting (IRV) has gained popularity in recent years as an alternative to traditional plurality voting. Advocates of IRV claim that one of its benefits relative to plurality voting is its tendency toward moderation: that it produces more moderate winners than plurality and could therefore be a useful tool for addressing polarization. However, there is little theoretical backing for this claim, and existing evidence has focused on simulations and case studies. In this work, we prove that IRV has a moderating effect relative to traditional plurality voting in a specific sense, developed in a 1-dimensional Euclidean model of voter preferences. Our results show that as long as voters are symmetrically distributed and not too concentrated at the extremes, IRV will not elect a candidate that is beyond a certain threshold in the tails of the distribution, while plurality can. For the uniform distribution, we provide an approach for deriving the exact distributions of the pluralit
&lt;/p&gt;</description></item><item><title>&#36229;&#32423;&#32534;&#35793;&#22120;&#26159;&#22312;&#20108;&#20803;&#22788;&#29702;&#24037;&#20855;&#21464;&#37327;&#26694;&#26550;&#19979;&#65292;&#23545;&#24453;&#36935;&#36164;&#26684;&#21644;&#32467;&#26524;&#31215;&#26497;&#21709;&#24212;&#30340;&#23376;&#32676;&#20307;&#65292;&#20855;&#26377;&#37325;&#35201;&#30340;&#25919;&#31574;&#24847;&#20041;&#65292;&#24182;&#19988;&#21487;&#20197;&#36890;&#36807;&#26631;&#20934;&#24037;&#20855;&#21464;&#37327;&#22238;&#24402;&#36827;&#34892;&#20272;&#35745;&#21644;&#25512;&#26029;&#12290;</title><link>http://arxiv.org/abs/2212.14105</link><description>&lt;p&gt;
&#36229;&#32423;&#32534;&#35793;&#22120;
&lt;/p&gt;
&lt;p&gt;
Supercompliers. (arXiv:2212.14105v2 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2212.14105
&lt;/p&gt;
&lt;p&gt;
&#36229;&#32423;&#32534;&#35793;&#22120;&#26159;&#22312;&#20108;&#20803;&#22788;&#29702;&#24037;&#20855;&#21464;&#37327;&#26694;&#26550;&#19979;&#65292;&#23545;&#24453;&#36935;&#36164;&#26684;&#21644;&#32467;&#26524;&#31215;&#26497;&#21709;&#24212;&#30340;&#23376;&#32676;&#20307;&#65292;&#20855;&#26377;&#37325;&#35201;&#30340;&#25919;&#31574;&#24847;&#20041;&#65292;&#24182;&#19988;&#21487;&#20197;&#36890;&#36807;&#26631;&#20934;&#24037;&#20855;&#21464;&#37327;&#22238;&#24402;&#36827;&#34892;&#20272;&#35745;&#21644;&#25512;&#26029;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#19968;&#20010;&#20108;&#20803;&#22788;&#29702;&#24037;&#20855;&#21464;&#37327;&#30340;&#26694;&#26550;&#19979;&#65292;&#25105;&#20204;&#23558;&#36229;&#32423;&#32534;&#35793;&#22120;&#23450;&#20041;&#20026;&#37027;&#20123;&#23545;&#24453;&#36935;&#36164;&#26684;&#31215;&#26497;&#21709;&#24212;&#24182;&#19988;&#23545;&#32467;&#26524;&#31215;&#26497;&#21709;&#24212;&#30340;&#23376;&#32676;&#20307;&#12290;&#36229;&#32423;&#32534;&#35793;&#22120;&#26159;&#21807;&#19968;&#20174;&#27835;&#30103;&#36164;&#26684;&#20013;&#21463;&#30410;&#30340;&#23376;&#32676;&#20307;&#65292;&#22240;&#27492;&#20855;&#26377;&#37325;&#35201;&#30340;&#25919;&#31574;&#24847;&#20041;&#12290;&#22312;&#19968;&#32452;&#32852;&#21512;&#21487;&#39564;&#35777;&#30340;&#20551;&#35774;&#21644;&#20108;&#20803;&#32467;&#26524;&#30340;&#21069;&#25552;&#19979;&#65292;&#25105;&#20204;&#21487;&#20197;&#23436;&#20840;&#30830;&#23450;&#36229;&#32423;&#32534;&#35793;&#22120;&#30340;&#29305;&#24449;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#25105;&#20204;&#38656;&#35201;&#26469;&#33258;&#23616;&#37096;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#25991;&#29486;&#30340;&#26631;&#20934;&#20551;&#35774;&#65292;&#20197;&#21450;&#32467;&#26524;&#21333;&#35843;&#24615;&#20551;&#35774;&#65288;&#21363;&#65292;&#27835;&#30103;&#26159;&#24369;&#26377;&#30410;&#30340;&#65289;&#12290;&#25105;&#20204;&#21487;&#20197;&#20351;&#29992;&#26631;&#20934;&#30340;&#24037;&#20855;&#21464;&#37327;&#22238;&#24402;&#20272;&#35745;&#21644;&#25512;&#26029;&#36229;&#32423;&#32534;&#35793;&#22120;&#30340;&#29305;&#24449;&#12290;
&lt;/p&gt;
&lt;p&gt;
In a binary-treatment instrumental variable framework, we define supercompliers as the subpopulation whose treatment take-up positively responds to eligibility and whose outcome positively responds to take-up. Supercompliers are the only subpopulation to benefit from treatment eligibility and, hence, are of great policy interest. Given a set of jointly testable assumptions and a binary outcome, we can completely identify the characteristics of supercompliers. Specifically, we require the standard assumptions from the local average treatment effect literature along with an outcome monotonicity assumption (i.e., treatment is weakly beneficial). We can estimate and conduct inference on supercomplier characteristics using standard instrumental variable regression.
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#21333;&#23792;&#20559;&#22909;&#19979;&#30340;&#32463;&#27982;&#20307;&#20013;&#36890;&#36807;&#35843;&#25972;&#27963;&#21160;&#20195;&#29702;&#20154;&#38598;&#21512;&#26469;&#25112;&#30053;&#24615;&#25197;&#26354;&#20877;&#20998;&#37197;&#35268;&#21017;&#30340;&#19981;&#21516;&#26041;&#24335;&#65292;&#24182;&#19988;&#25552;&#20986;&#20102;&#19968;&#31867;&#21333;&#35843;&#20877;&#20998;&#37197;&#35268;&#21017;&#65292;&#35777;&#26126;&#20102;&#20854;&#20855;&#26377;&#19968;&#23450;&#30340;&#24615;&#36136;&#65292;&#20294;&#24182;&#38750;&#20840;&#37096;&#20855;&#22791;&#12290;</title><link>http://arxiv.org/abs/2210.12794</link><description>&lt;p&gt;
&#21333;&#23792;&#20559;&#22909;&#19979;&#30340;&#32463;&#27982;&#20307;&#20013;&#21487;&#21464;&#20154;&#21475;&#35843;&#25972;&#35268;&#21017;
&lt;/p&gt;
&lt;p&gt;
Variable population manipulations of reallocation rules in economies with single-peaked preferences. (arXiv:2210.12794v2 [econ.TH] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2210.12794
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#21333;&#23792;&#20559;&#22909;&#19979;&#30340;&#32463;&#27982;&#20307;&#20013;&#36890;&#36807;&#35843;&#25972;&#27963;&#21160;&#20195;&#29702;&#20154;&#38598;&#21512;&#26469;&#25112;&#30053;&#24615;&#25197;&#26354;&#20877;&#20998;&#37197;&#35268;&#21017;&#30340;&#19981;&#21516;&#26041;&#24335;&#65292;&#24182;&#19988;&#25552;&#20986;&#20102;&#19968;&#31867;&#21333;&#35843;&#20877;&#20998;&#37197;&#35268;&#21017;&#65292;&#35777;&#26126;&#20102;&#20854;&#20855;&#26377;&#19968;&#23450;&#30340;&#24615;&#36136;&#65292;&#20294;&#24182;&#38750;&#20840;&#37096;&#20855;&#22791;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#20855;&#26377;&#21333;&#23792;&#20559;&#22909;&#21644;&#20010;&#20307;&#31104;&#36171;&#30340;&#21333;&#21830;&#21697;&#32463;&#27982;&#20307;&#20013;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#36890;&#36807;&#24433;&#21709;&#27963;&#21160;&#20195;&#29702;&#20154;&#38598;&#21512;&#32780;&#25112;&#30053;&#24615;&#25197;&#26354;&#20877;&#20998;&#37197;&#35268;&#21017;&#30340;&#19981;&#21516;&#26041;&#24335;&#12290;&#25105;&#20204;&#24341;&#20837;&#24182;&#25551;&#36848;&#20102;&#21333;&#35843;&#20877;&#20998;&#37197;&#35268;&#21017;&#23478;&#26063;&#65292;&#24182;&#35777;&#26126;&#20102;&#35813;&#31867;&#35268;&#21017;&#20013;&#30340;&#27599;&#20010;&#35268;&#21017;&#37117;&#26159;&#25277;&#21462;&#35777;&#26126;&#21644;&#31104;&#36171;&#21512;&#24182;&#35777;&#26126;&#30340;&#65292;&#24182;&#19988;&#33267;&#23569;&#26377;&#19968;&#20010;&#26159;&#31104;&#36171;&#20998;&#21106;&#35777;&#26126;&#30340;&#65292;&#20294;&#27809;&#26377;&#36825;&#26679;&#30340;&#35268;&#21017;&#26159;&#39044;&#20132;&#36135;&#35777;&#26126;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
In a one-commodity economy with single-peaked preferences and individual endowments, we study different ways in which reallocation rules can be strategically distorted by affecting the set of active agents. We introduce and characterize the family of monotonic reallocation rules and show that each rule in this class is withdrawal-proof and endowments-merging-proof, at least one is endowments-splitting-proof and that no such rule is pre-delivery-proof.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#36890;&#36807;&#24341;&#20837;&#27491;&#24335;&#21512;&#21516;&#30340;&#27010;&#24565;&#65292;&#35299;&#20915;&#20102;&#22810;&#26234;&#33021;&#20307;&#24378;&#21270;&#23398;&#20064;&#20013;&#20010;&#20307;&#28608;&#21169;&#21644;&#38598;&#20307;&#28608;&#21169;&#20998;&#27495;&#23548;&#33268;&#30340;&#27425;&#20248;&#34892;&#20026;&#38382;&#39064;&#12290;&#29702;&#35770;&#21644;&#23454;&#35777;&#32467;&#26524;&#34920;&#26126;&#65292;&#36890;&#36807;&#22312;&#39532;&#23572;&#21487;&#22827;&#21338;&#24328;&#20013;&#24341;&#20837;&#26377;&#32422;&#26463;&#30340;&#29366;&#24577;&#20381;&#36182;&#22870;&#21169;&#36716;&#31227;&#65292;&#23454;&#29616;&#20102;&#25152;&#26377;&#21487;&#35266;&#23519;&#39532;&#23572;&#21487;&#22827;&#21338;&#24328;&#30340;&#23376;&#21338;&#24328;&#23436;&#32654;&#22343;&#34913;&#34920;&#29616;&#20986;&#31038;&#20250;&#26368;&#20248;&#34892;&#20026;&#65292;&#24182;&#25552;&#21319;&#20102;&#31639;&#27861;&#30340;&#31038;&#20250;&#24615;&#33021;&#12290;</title><link>http://arxiv.org/abs/2208.10469</link><description>&lt;p&gt;
&#20889;&#19979;&#26469;&#21543;&#65306;&#27491;&#24335;&#21512;&#21516;&#32531;&#35299;&#22810;&#26234;&#33021;&#20307;&#24378;&#21270;&#23398;&#20064;&#20013;&#30340;&#31038;&#20250;&#22256;&#22659;
&lt;/p&gt;
&lt;p&gt;
Get It in Writing: Formal Contracts Mitigate Social Dilemmas in Multi-Agent RL. (arXiv:2208.10469v3 [cs.AI] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2208.10469
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#36890;&#36807;&#24341;&#20837;&#27491;&#24335;&#21512;&#21516;&#30340;&#27010;&#24565;&#65292;&#35299;&#20915;&#20102;&#22810;&#26234;&#33021;&#20307;&#24378;&#21270;&#23398;&#20064;&#20013;&#20010;&#20307;&#28608;&#21169;&#21644;&#38598;&#20307;&#28608;&#21169;&#20998;&#27495;&#23548;&#33268;&#30340;&#27425;&#20248;&#34892;&#20026;&#38382;&#39064;&#12290;&#29702;&#35770;&#21644;&#23454;&#35777;&#32467;&#26524;&#34920;&#26126;&#65292;&#36890;&#36807;&#22312;&#39532;&#23572;&#21487;&#22827;&#21338;&#24328;&#20013;&#24341;&#20837;&#26377;&#32422;&#26463;&#30340;&#29366;&#24577;&#20381;&#36182;&#22870;&#21169;&#36716;&#31227;&#65292;&#23454;&#29616;&#20102;&#25152;&#26377;&#21487;&#35266;&#23519;&#39532;&#23572;&#21487;&#22827;&#21338;&#24328;&#30340;&#23376;&#21338;&#24328;&#23436;&#32654;&#22343;&#34913;&#34920;&#29616;&#20986;&#31038;&#20250;&#26368;&#20248;&#34892;&#20026;&#65292;&#24182;&#25552;&#21319;&#20102;&#31639;&#27861;&#30340;&#31038;&#20250;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22810;&#26234;&#33021;&#20307;&#24378;&#21270;&#23398;&#20064;&#65288;MARL&#65289;&#26159;&#35757;&#32451;&#22312;&#20849;&#21516;&#29615;&#22659;&#20013;&#29420;&#31435;&#34892;&#21160;&#30340;&#33258;&#21160;&#21270;&#31995;&#32479;&#30340;&#24378;&#22823;&#24037;&#20855;&#12290;&#28982;&#32780;&#65292;&#24403;&#20010;&#20307;&#28608;&#21169;&#21644;&#38598;&#20307;&#28608;&#21169;&#20986;&#29616;&#20998;&#27495;&#26102;&#65292;&#23427;&#21487;&#33021;&#23548;&#33268;&#27425;&#20248;&#34892;&#20026;&#12290;&#20154;&#31867;&#22312;&#35299;&#20915;&#36825;&#20123;&#31038;&#20250;&#22256;&#22659;&#26041;&#38754;&#20855;&#26377;&#38750;&#20961;&#30340;&#33021;&#21147;&#12290;&#22312;MARL&#20013;&#22797;&#21046;&#36825;&#31181;&#21512;&#20316;&#34892;&#20026;&#23545;&#20110;&#33258;&#31169;&#30340;&#26234;&#33021;&#20307;&#26469;&#35828;&#26159;&#19968;&#20010;&#26410;&#35299;&#20915;&#30340;&#38382;&#39064;&#12290;&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#20511;&#37492;&#20102;&#32463;&#27982;&#23398;&#20013;&#27491;&#24335;&#21512;&#21516;&#30340;&#24605;&#24819;&#65292;&#20197;&#20811;&#26381;MARL&#20013;&#26234;&#33021;&#20307;&#20043;&#38388;&#30340;&#28608;&#21169;&#20998;&#27495;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#23545;&#39532;&#23572;&#21487;&#22827;&#21338;&#24328;&#36827;&#34892;&#22686;&#24378;&#30340;&#26041;&#27861;&#65292;&#26234;&#33021;&#20307;&#33258;&#24895;&#21516;&#24847;&#22312;&#39044;&#20808;&#35268;&#23450;&#30340;&#26465;&#20214;&#19979;&#36827;&#34892;&#26377;&#32422;&#26463;&#30340;&#29366;&#24577;&#20381;&#36182;&#22870;&#21169;&#36716;&#31227;&#12290;&#25105;&#20204;&#30340;&#36129;&#29486;&#26159;&#29702;&#35770;&#30340;&#21644;&#23454;&#35777;&#30340;&#12290;&#39318;&#20808;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#36825;&#31181;&#22686;&#24378;&#20351;&#24471;&#25152;&#26377;&#23436;&#20840;&#21487;&#35266;&#23519;&#39532;&#23572;&#21487;&#22827;&#21338;&#24328;&#30340;&#23376;&#21338;&#24328;&#23436;&#32654;&#22343;&#34913;&#37117;&#34920;&#29616;&#20986;&#31038;&#20250;&#26368;&#20248;&#34892;&#20026;&#65292;&#21482;&#35201;&#21512;&#21516;&#31354;&#38388;&#36275;&#22815;&#20016;&#23500;&#12290;&#25509;&#19979;&#26469;&#65292;&#25105;&#20204;&#36890;&#36807;&#23637;&#31034;&#26368;&#20808;&#36827;&#30340;&#24378;&#21270;&#23398;&#20064;&#31639;&#27861;&#22312;&#22686;&#24378;&#21518;&#30340;MARL&#20013;&#34920;&#29616;&#20986;&#26356;&#22909;&#30340;&#31038;&#20250;&#24615;&#33021;&#26469;&#34917;&#20805;&#25105;&#20204;&#30340;&#21338;&#24328;&#35770;&#20998;&#26512;&#12290;
&lt;/p&gt;
&lt;p&gt;
Multi-agent reinforcement learning (MARL) is a powerful tool for training automated systems acting independently in a common environment. However, it can lead to sub-optimal behavior when individual incentives and group incentives diverge. Humans are remarkably capable at solving these social dilemmas. It is an open problem in MARL to replicate such cooperative behaviors in selfish agents. In this work, we draw upon the idea of formal contracting from economics to overcome diverging incentives between agents in MARL. We propose an augmentation to a Markov game where agents voluntarily agree to binding state-dependent transfers of reward, under pre-specified conditions. Our contributions are theoretical and empirical. First, we show that this augmentation makes all subgame-perfect equilibria of all fully observed Markov games exhibit socially optimal behavior, given a sufficiently rich space of contracts. Next, we complement our game-theoretic analysis by showing that state-of-the-art R
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#23558;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#31639;&#27861;&#24212;&#29992;&#20110;&#26102;&#38388;&#24207;&#21015;&#39044;&#27979;&#65292;&#20197;&#25552;&#39640;&#38754;&#26495;&#25968;&#25454;&#20013;&#30340;&#22240;&#26524;&#25512;&#26029;&#20934;&#30830;&#24615;&#12290;&#36890;&#36807;&#23454;&#39564;&#35777;&#26126;&#65292;&#35813;&#31639;&#27861;&#22312;&#21508;&#31181;&#24773;&#26223;&#19979;&#26126;&#26174;&#20248;&#20110;&#29616;&#26377;&#26041;&#27861;&#65292;&#20026;&#38754;&#26495;&#25968;&#25454;&#30740;&#31350;&#25552;&#20379;&#20102;&#26032;&#30340;&#26041;&#27861;&#21644;&#24037;&#20855;&#12290;</title><link>http://arxiv.org/abs/2208.03489</link><description>&lt;p&gt;
&#38754;&#26495;&#25968;&#25454;&#22240;&#26524;&#25512;&#26029;&#30340;&#39044;&#27979;&#31639;&#27861;
&lt;/p&gt;
&lt;p&gt;
Forecasting Algorithms for Causal Inference with Panel Data. (arXiv:2208.03489v2 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2208.03489
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#23558;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#31639;&#27861;&#24212;&#29992;&#20110;&#26102;&#38388;&#24207;&#21015;&#39044;&#27979;&#65292;&#20197;&#25552;&#39640;&#38754;&#26495;&#25968;&#25454;&#20013;&#30340;&#22240;&#26524;&#25512;&#26029;&#20934;&#30830;&#24615;&#12290;&#36890;&#36807;&#23454;&#39564;&#35777;&#26126;&#65292;&#35813;&#31639;&#27861;&#22312;&#21508;&#31181;&#24773;&#26223;&#19979;&#26126;&#26174;&#20248;&#20110;&#29616;&#26377;&#26041;&#27861;&#65292;&#20026;&#38754;&#26495;&#25968;&#25454;&#30740;&#31350;&#25552;&#20379;&#20102;&#26032;&#30340;&#26041;&#27861;&#21644;&#24037;&#20855;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#31038;&#20250;&#31185;&#23398;&#30740;&#31350;&#20013;&#65292;&#20351;&#29992;&#38754;&#26495;&#25968;&#25454;&#36827;&#34892;&#22240;&#26524;&#25512;&#26029;&#26159;&#19968;&#39033;&#26680;&#24515;&#25361;&#25112;&#12290;&#25105;&#20204;&#23558;&#19968;&#31181;&#28145;&#24230;&#31070;&#32463;&#26550;&#26500;&#29992;&#20110;&#26102;&#38388;&#24207;&#21015;&#39044;&#27979;&#65288;N-BEATS&#31639;&#27861;&#65289;&#65292;&#20197;&#26356;&#20934;&#30830;&#22320;&#39044;&#27979;&#22312;&#26410;&#36827;&#34892;&#22788;&#29702;&#30340;&#24773;&#20917;&#19979;&#21463;&#27835;&#30103;&#21333;&#20301;&#30340;&#21453;&#20107;&#23454;&#28436;&#21464;&#12290;&#22312;&#21508;&#31181;&#24773;&#22659;&#19979;&#65292;&#25152;&#24471;&#21040;&#30340;&#20272;&#35745;&#22120;&#65288;&#8220;SyNBEATS&#8221;&#65289;&#22312;&#24615;&#33021;&#19978;&#26126;&#26174;&#20248;&#20110;&#24120;&#29992;&#26041;&#27861;&#65288;&#21512;&#25104;&#23545;&#29031;&#27861;&#12289;&#21452;&#21521;&#22266;&#23450;&#25928;&#24212;&#65289;&#65292;&#24182;&#19988;&#19982;&#26368;&#36817;&#25552;&#20986;&#30340;&#26041;&#27861;&#65288;&#21512;&#25104;&#24046;&#24322;&#27861;&#12289;&#30697;&#38453;&#34917;&#20840;&#65289;&#22312;&#20934;&#30830;&#24615;&#19978;&#36798;&#21040;&#20102;&#30456;&#24403;&#30340;&#27700;&#24179;&#25110;&#26356;&#39640;&#12290;&#25105;&#20204;&#30340;&#32467;&#26524;&#31361;&#26174;&#20102;&#22914;&#20309;&#21033;&#29992;&#39044;&#27979;&#25991;&#29486;&#30340;&#36827;&#23637;&#26469;&#25913;&#21892;&#38754;&#26495;&#25968;&#25454;&#29615;&#22659;&#19979;&#30340;&#22240;&#26524;&#25512;&#26029;&#12290;
&lt;/p&gt;
&lt;p&gt;
Conducting causal inference with panel data is a core challenge in social science research. We adapt a deep neural architecture for time series forecasting (the N-BEATS algorithm) to more accurately predict the counterfactual evolution of a treated unit had treatment not occurred. Across a range of settings, the resulting estimator ("SyNBEATS") significantly outperforms commonly employed methods (synthetic controls, two-way fixed effects), and attains comparable or more accurate performance compared to recently proposed methods (synthetic difference-in-differences, matrix completion). Our results highlight how advances in the forecasting literature can be harnessed to improve causal inference in panel data settings.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#19968;&#31181;&#35745;&#31639;&#38750;&#21487;&#24494;&#38656;&#27714;&#20989;&#25968;&#30340;&#25928;&#29992;&#20989;&#25968;&#30340;&#26041;&#27861;&#65292;&#24182;&#24471;&#21040;&#20102;&#20004;&#20010;&#26032;&#30340;&#20805;&#20998;&#21644;&#24517;&#35201;&#26465;&#20214;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36824;&#23637;&#31034;&#20102;&#21807;&#19968;&#24615;&#21644;&#24369;&#24207;&#30340;&#34920;&#31034;&#12290;&#25105;&#20204;&#23558;&#36825;&#20123;&#32467;&#26524;&#24212;&#29992;&#20110;&#35745;&#37327;&#32463;&#27982;&#29702;&#35770;&#65292;&#24182;&#24471;&#21040;&#20102;&#20851;&#20110;&#38656;&#27714;&#20989;&#25968;&#25910;&#25947;&#24615;&#21644;&#20855;&#26377;&#22343;&#21248;&#21033;&#26222;&#24076;&#33576;&#24120;&#25968;&#30340;&#32467;&#26524;&#12290;</title><link>http://arxiv.org/abs/2203.04770</link><description>&lt;p&gt;
&#38750;&#20809;&#28369;&#21487;&#31215;&#29702;&#35770;
&lt;/p&gt;
&lt;p&gt;
Non-Smooth Integrability Theory. (arXiv:2203.04770v3 [econ.TH] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2203.04770
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#19968;&#31181;&#35745;&#31639;&#38750;&#21487;&#24494;&#38656;&#27714;&#20989;&#25968;&#30340;&#25928;&#29992;&#20989;&#25968;&#30340;&#26041;&#27861;&#65292;&#24182;&#24471;&#21040;&#20102;&#20004;&#20010;&#26032;&#30340;&#20805;&#20998;&#21644;&#24517;&#35201;&#26465;&#20214;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36824;&#23637;&#31034;&#20102;&#21807;&#19968;&#24615;&#21644;&#24369;&#24207;&#30340;&#34920;&#31034;&#12290;&#25105;&#20204;&#23558;&#36825;&#20123;&#32467;&#26524;&#24212;&#29992;&#20110;&#35745;&#37327;&#32463;&#27982;&#29702;&#35770;&#65292;&#24182;&#24471;&#21040;&#20102;&#20851;&#20110;&#38656;&#27714;&#20989;&#25968;&#25910;&#25947;&#24615;&#21644;&#20855;&#26377;&#22343;&#21248;&#21033;&#26222;&#24076;&#33576;&#24120;&#25968;&#30340;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#19968;&#31181;&#20174;&#19968;&#20010;&#19981;&#21487;&#24494;&#20294;&#23616;&#37096;&#21033;&#26222;&#24076;&#33576;&#30340;&#38656;&#27714;&#20989;&#25968;&#20505;&#36873;&#20013;&#35745;&#31639;&#25928;&#29992;&#20989;&#25968;&#30340;&#26041;&#27861;&#12290;&#21033;&#29992;&#36825;&#31181;&#26041;&#27861;&#65292;&#25105;&#20204;&#24471;&#21040;&#20102;&#19968;&#20010;&#38656;&#27714;&#20989;&#25968;&#20505;&#36873;&#20026;&#38656;&#27714;&#20989;&#25968;&#30340;&#20004;&#20010;&#26032;&#30340;&#24517;&#35201;&#21644;&#20805;&#20998;&#26465;&#20214;&#12290;&#31532;&#19968;&#20010;&#26159;&#20851;&#20110;&#26031;&#25289;&#33576;&#22522;&#30697;&#38453;&#30340;&#26465;&#20214;&#65292;&#31532;&#20108;&#20010;&#26159;&#20851;&#20110;&#20559;&#24494;&#20998;&#26041;&#31243;&#30340;&#20985;&#35299;&#30340;&#23384;&#22312;&#24615;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36824;&#23637;&#31034;&#20102;&#23545;&#24212;&#20110;&#38656;&#27714;&#20989;&#25968;&#30340;&#19978;&#21322;&#36830;&#32493;&#24369;&#24207;&#26159;&#21807;&#19968;&#30340;&#65292;&#24182;&#19988;&#36825;&#20010;&#24369;&#24207;&#21487;&#20197;&#29992;&#25105;&#20204;&#35745;&#31639;&#20986;&#30340;&#25928;&#29992;&#20989;&#25968;&#34920;&#31034;&#12290;&#25105;&#20204;&#23558;&#36825;&#20123;&#32467;&#26524;&#24212;&#29992;&#20110;&#35745;&#37327;&#32463;&#27982;&#29702;&#35770;&#12290;&#39318;&#20808;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#22312;&#19968;&#20123;&#35201;&#27714;&#19979;&#65292;&#22914;&#26524;&#19968;&#20010;&#38656;&#27714;&#20989;&#25968;&#24207;&#21015;&#30456;&#23545;&#20110;&#32039;&#33268;&#25910;&#25947;&#24230;&#37327;&#25910;&#25947;&#21040;&#26576;&#20010;&#20989;&#25968;&#65292;&#37027;&#20040;&#26497;&#38480;&#20989;&#25968;&#20063;&#26159;&#19968;&#20010;&#38656;&#27714;&#20989;&#25968;&#12290;&#20854;&#27425;&#65292;&#23545;&#20110;&#22312;&#20219;&#20309;&#32039;&#33268;&#38598;&#19978;&#20855;&#26377;&#22343;&#21248;&#21033;&#26222;&#24076;&#33576;&#24120;&#25968;&#30340;&#38656;&#27714;&#20989;&#25968;&#31354;&#38388;&#22312;&#19978;&#36848;&#24230;&#37327;&#19979;&#26159;&#32039;&#33268;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study a method for calculating the utility function from a candidate of a demand function that is not differentiable, but is locally Lipschitz. Using this method, we obtain two new necessary and sufficient conditions for a candidate of a demand function to be a demand function. The first is conditions for the Slutsky matrix, and the second is the existence of a concave solution to a partial differential equation. Moreover, we show that the upper semi-continuous weak order that corresponds to the demand function is unique, and that this weak order is represented by our calculated utility function. We provide applications of these results to econometric theory. First, we show that, under several requirements, if a sequence of demand functions converges to some function with respect to the metric of compact convergence, then the limit is also a demand function. Second, the space of demand functions that have uniform Lipschitz constants on any compact set is compact under the above metr
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#36890;&#36807;&#25968;&#25454;&#32452;&#21512;&#35299;&#20915;&#20102;&#38271;&#26399;&#27835;&#30103;&#25928;&#26524;&#35782;&#21035;&#21644;&#20272;&#35745;&#20013;&#30340;&#25345;&#32493;&#26410;&#27979;&#37327;&#28151;&#28102;&#22240;&#32032;&#25361;&#25112;&#65292;&#24182;&#25552;&#20986;&#20102;&#19977;&#31181;&#26032;&#30340;&#35782;&#21035;&#31574;&#30053;&#21644;&#20272;&#35745;&#22120;&#12290;</title><link>http://arxiv.org/abs/2202.07234</link><description>&lt;p&gt;
&#38271;&#26399;&#25345;&#32493;&#28151;&#28102;&#24773;&#20917;&#19979;&#30340;&#22240;&#26524;&#25512;&#26029;&#19982;&#25968;&#25454;&#32452;&#21512;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Long-term Causal Inference Under Persistent Confounding via Data Combination. (arXiv:2202.07234v3 [stat.ME] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2202.07234
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#36890;&#36807;&#25968;&#25454;&#32452;&#21512;&#35299;&#20915;&#20102;&#38271;&#26399;&#27835;&#30103;&#25928;&#26524;&#35782;&#21035;&#21644;&#20272;&#35745;&#20013;&#30340;&#25345;&#32493;&#26410;&#27979;&#37327;&#28151;&#28102;&#22240;&#32032;&#25361;&#25112;&#65292;&#24182;&#25552;&#20986;&#20102;&#19977;&#31181;&#26032;&#30340;&#35782;&#21035;&#31574;&#30053;&#21644;&#20272;&#35745;&#22120;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#24403;&#23454;&#39564;&#25968;&#25454;&#21644;&#35266;&#23519;&#25968;&#25454;&#21516;&#26102;&#23384;&#22312;&#26102;&#65292;&#38271;&#26399;&#27835;&#30103;&#25928;&#26524;&#30340;&#35782;&#21035;&#21644;&#20272;&#35745;&#38382;&#39064;&#12290;&#30001;&#20110;&#38271;&#26399;&#32467;&#26524;&#20165;&#22312;&#38271;&#26102;&#38388;&#24310;&#36831;&#21518;&#25165;&#35266;&#23519;&#21040;&#65292;&#22312;&#23454;&#39564;&#25968;&#25454;&#20013;&#26080;&#27861;&#27979;&#37327;&#65292;&#20294;&#22312;&#35266;&#23519;&#25968;&#25454;&#20013;&#26377;&#35760;&#24405;&#12290;&#28982;&#32780;&#65292;&#36825;&#20004;&#31181;&#31867;&#22411;&#30340;&#25968;&#25454;&#37117;&#21253;&#21547;&#23545;&#19968;&#20123;&#30701;&#26399;&#32467;&#26524;&#30340;&#35266;&#23519;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#29420;&#29305;&#22320;&#35299;&#20915;&#20102;&#25345;&#32493;&#26410;&#27979;&#37327;&#28151;&#28102;&#22240;&#32032;&#30340;&#25361;&#25112;&#65292;&#21363;&#19968;&#20123;&#26410;&#27979;&#37327;&#28151;&#28102;&#22240;&#32032;&#21487;&#20197;&#21516;&#26102;&#24433;&#21709;&#27835;&#30103;&#12289;&#30701;&#26399;&#32467;&#26524;&#21644;&#38271;&#26399;&#32467;&#26524;&#65292;&#32780;&#36825;&#20250;&#20351;&#24471;&#20043;&#21069;&#25991;&#29486;&#20013;&#30340;&#35782;&#21035;&#31574;&#30053;&#26080;&#25928;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20010;&#25361;&#25112;&#65292;&#25105;&#20204;&#21033;&#29992;&#22810;&#20010;&#30701;&#26399;&#32467;&#26524;&#30340;&#36830;&#32493;&#32467;&#26500;&#65292;&#20026;&#24179;&#22343;&#38271;&#26399;&#27835;&#30103;&#25928;&#26524;&#25552;&#20986;&#20102;&#19977;&#31181;&#26032;&#30340;&#35782;&#21035;&#31574;&#30053;&#12290;&#25105;&#20204;&#36827;&#19968;&#27493;&#25552;&#20986;&#20102;&#19977;&#31181;&#23545;&#24212;&#30340;&#20272;&#35745;&#22120;&#65292;&#24182;&#35777;&#26126;&#20102;&#23427;&#20204;&#30340;&#28176;&#36817;&#19968;&#33268;&#24615;&#21644;&#28176;&#36817;&#27491;&#24577;&#24615;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#23558;&#25105;&#20204;&#30340;&#26041;&#27861;&#24212;&#29992;&#20110;&#20272;&#35745;&#38271;&#26399;&#27835;&#30103;&#25928;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study the identification and estimation of long-term treatment effects when both experimental and observational data are available. Since the long-term outcome is observed only after a long delay, it is not measured in the experimental data, but only recorded in the observational data. However, both types of data include observations of some short-term outcomes. In this paper, we uniquely tackle the challenge of persistent unmeasured confounders, i.e., some unmeasured confounders that can simultaneously affect the treatment, short-term outcomes and the long-term outcome, noting that they invalidate identification strategies in previous literature. To address this challenge, we exploit the sequential structure of multiple short-term outcomes, and develop three novel identification strategies for the average long-term treatment effect. We further propose three corresponding estimators and prove their asymptotic consistency and asymptotic normality. We finally apply our methods to esti
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#22522;&#20110;&#25581;&#31034;&#24615;&#20559;&#22909;&#30340;&#23130;&#23035;&#31283;&#23450;&#24615;&#21051;&#30011;&#65292;&#26126;&#30830;&#32771;&#34385;&#20102;&#35843;&#33410;&#23130;&#23035;&#35299;&#25955;&#30340;&#31163;&#23130;&#27861;&#24459;&#19979;&#30340;&#20114;&#24847;&#31163;&#23130;&#65292;&#20026;&#20102;&#35780;&#20272;&#35813;&#21051;&#30011;&#22312;&#30830;&#23450;&#23478;&#24237;&#20869;&#28040;&#36153;&#26041;&#38754;&#30340;&#28508;&#21147;&#65292;&#36824;&#36827;&#34892;&#20102;&#27169;&#25311;&#23454;&#39564;&#12290;</title><link>http://arxiv.org/abs/2110.10781</link><description>&lt;p&gt;
&#22522;&#20110;&#25581;&#31034;&#24615;&#20559;&#22909;&#30340;&#20114;&#24847;&#31163;&#23130;&#19979;&#23130;&#23035;&#31283;&#23450;&#24615;&#30340;&#21051;&#30011;
&lt;/p&gt;
&lt;p&gt;
Revealed preference characterization of marital stability under mutual consent divorce. (arXiv:2110.10781v3 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2110.10781
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#22522;&#20110;&#25581;&#31034;&#24615;&#20559;&#22909;&#30340;&#23130;&#23035;&#31283;&#23450;&#24615;&#21051;&#30011;&#65292;&#26126;&#30830;&#32771;&#34385;&#20102;&#35843;&#33410;&#23130;&#23035;&#35299;&#25955;&#30340;&#31163;&#23130;&#27861;&#24459;&#19979;&#30340;&#20114;&#24847;&#31163;&#23130;&#65292;&#20026;&#20102;&#35780;&#20272;&#35813;&#21051;&#30011;&#22312;&#30830;&#23450;&#23478;&#24237;&#20869;&#28040;&#36153;&#26041;&#38754;&#30340;&#28508;&#21147;&#65292;&#36824;&#36827;&#34892;&#20102;&#27169;&#25311;&#23454;&#39564;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#22522;&#20110;&#25581;&#31034;&#24615;&#20559;&#22909;&#30340;&#23130;&#23035;&#31283;&#23450;&#24615;&#21051;&#30011;&#65292;&#26126;&#30830;&#32771;&#34385;&#20102;&#35843;&#33410;&#23130;&#23035;&#35299;&#25955;&#30340;&#31163;&#23130;&#27861;&#24459;&#12290;&#25105;&#20204;&#37325;&#28857;&#30740;&#31350;&#20102;&#20114;&#24847;&#31163;&#23130;&#65292;&#21363;&#24403;&#20107;&#20154;&#21482;&#26377;&#22312;&#33719;&#24471;&#20102;&#23545;&#26041;&#30340;&#21516;&#24847;&#26102;&#25165;&#33021;&#31163;&#23130;&#12290;&#25105;&#20204;&#25552;&#20379;&#29702;&#35770;&#35265;&#35299;&#65292;&#25506;&#35752;&#20102;&#35813;&#21051;&#30011;&#22312;&#30830;&#23450;&#23478;&#24237;&#20869;&#28040;&#36153;&#26041;&#38754;&#30340;&#28508;&#21147;&#12290;&#25105;&#20204;&#20351;&#29992;&#20174;&#8220;&#31038;&#20250;&#31185;&#23398;&#30340;&#32593;&#32476;&#21270;&#32437;&#21521;&#30740;&#31350;&#8221;&#65288;LISS&#65289;&#23567;&#32452;&#25277;&#21462;&#30340;&#23478;&#24237;&#25968;&#25454;&#36827;&#34892;&#27169;&#25311;&#23454;&#39564;&#65292;&#32467;&#26524;&#25903;&#25345;&#20102;&#25105;&#20204;&#30340;&#29702;&#35770;&#21457;&#29616;&#12290;
&lt;/p&gt;
&lt;p&gt;
We present a revealed preference characterization of marital stability explicitly accounting for the divorce law governing marital dissolution. We focus on mutual consent divorce, where individuals can divorce their partner only if they can obtain their consent. We provide theoretical insights into the potential of the characterization for identifying intrahousehold consumption. Simulation exercises using household data drawn from the Longitudinal Internet Studies for the Social Sciences (LISS) panel support our theoretical findings.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#22312;&#19968;&#33324;&#31454;&#20105;&#26426;&#21046;&#21338;&#24328;&#20013;&#30340;&#31283;&#20581;&#32431;&#25928;&#30410;&#22343;&#34913;&#27010;&#24565;&#65292;&#24182;&#30830;&#23450;&#20102;&#20854;&#19982;&#20854;&#20182;&#31283;&#20581;&#27010;&#24565;&#30340;&#19968;&#33268;&#24615;&#12290;&#22914;&#26524;&#20195;&#29702;&#30340;&#25928;&#29992;&#20989;&#25968;&#21487;&#21152;&#21487;&#20998;&#65292;&#21017;&#21487;&#20197;&#36890;&#36807;&#36125;&#21494;&#26031;&#28608;&#21169;&#20860;&#23481;&#30452;&#25509;&#26426;&#21046;&#23545;&#31283;&#20581;&#32431;&#25928;&#30410;&#22343;&#34913;&#30340;&#22343;&#34913;&#20998;&#37197;&#36827;&#34892;&#20840;&#38754;&#21051;&#30011;&#12290;</title><link>http://arxiv.org/abs/2109.13177</link><description>&lt;p&gt;
&#19968;&#33324;&#31454;&#20105;&#26426;&#21046;&#21338;&#24328;&#20013;&#30340;&#31283;&#20581;&#22343;&#34913;
&lt;/p&gt;
&lt;p&gt;
Robust Equilibria in General Competing Mechanism Games. (arXiv:2109.13177v3 [econ.TH] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2109.13177
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#22312;&#19968;&#33324;&#31454;&#20105;&#26426;&#21046;&#21338;&#24328;&#20013;&#30340;&#31283;&#20581;&#32431;&#25928;&#30410;&#22343;&#34913;&#27010;&#24565;&#65292;&#24182;&#30830;&#23450;&#20102;&#20854;&#19982;&#20854;&#20182;&#31283;&#20581;&#27010;&#24565;&#30340;&#19968;&#33268;&#24615;&#12290;&#22914;&#26524;&#20195;&#29702;&#30340;&#25928;&#29992;&#20989;&#25968;&#21487;&#21152;&#21487;&#20998;&#65292;&#21017;&#21487;&#20197;&#36890;&#36807;&#36125;&#21494;&#26031;&#28608;&#21169;&#20860;&#23481;&#30452;&#25509;&#26426;&#21046;&#23545;&#31283;&#20581;&#32431;&#25928;&#30410;&#22343;&#34913;&#30340;&#22343;&#34913;&#20998;&#37197;&#36827;&#34892;&#20840;&#38754;&#21051;&#30011;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#22312;&#19981;&#23436;&#20840;&#20449;&#24687;&#30340;&#19968;&#33324;&#31454;&#20105;&#26426;&#21046;&#21338;&#24328;&#20013;&#30340;&#31283;&#20581;&#32431;&#25928;&#30410;&#22343;&#34913;&#65288;robust PBE&#65289;&#30340;&#27010;&#24565;&#65292;&#20854;&#20013;&#26426;&#21046;&#20801;&#35768;&#35774;&#35745;&#32773;&#22312;&#20195;&#29702;&#21457;&#36865;&#28040;&#24687;&#30340;&#21516;&#26102;&#32473;&#33258;&#24049;&#21457;&#36865;&#28040;&#24687;&#12290;&#35813;&#25991;&#30830;&#23450;&#20102;&#22312;&#25928;&#29992;&#29615;&#22659;&#20013;&#65292;&#31283;&#20581;&#32431;&#25928;&#30410;&#22343;&#34913;&#19982;&#24378;&#31283;&#20581;&#32431;&#25928;&#30410;&#22343;&#34913;&#65288;Epstein and Peters (1999), Han (2007)&#65289;&#20197;&#21450;&#31283;&#20581;&#32431;&#25928;&#30410;&#22343;&#34913;&#27010;&#24565;&#30456;&#19968;&#33268;&#30340;&#24773;&#20917;&#12290;&#22914;&#26524;&#27599;&#20010;&#20195;&#29702;&#30340;&#25928;&#29992;&#20989;&#25968;&#19982;&#36127;&#36131;&#20154;&#30340;&#34892;&#21160;&#26159;&#21487;&#21152;&#21487;&#20998;&#30340;&#65292;&#21017;&#21487;&#20197;&#22312;&#31283;&#20581;&#32431;&#25928;&#30410;&#22343;&#34913;&#21450;&#20854;&#21464;&#31181;&#30340;&#27010;&#24565;&#19979;&#65292;&#36890;&#36807;&#36125;&#21494;&#26031;&#28608;&#21169;&#20860;&#23481;&#65288;BIC&#65289;&#30452;&#25509;&#26426;&#21046;&#23545;&#22343;&#34913;&#20998;&#37197;&#36827;&#34892;&#20840;&#38754;&#21051;&#30011;&#65292;&#32780;&#26080;&#38656;&#24341;&#29992;&#21338;&#24328;&#20013;&#20801;&#35768;&#30340;&#20219;&#24847;&#19968;&#33324;&#26426;&#21046;&#38598;&#21512;&#12290;&#28982;&#32780;&#65292;&#22312;&#26631;&#20934;&#31454;&#20105;&#26426;&#21046;&#21338;&#24328;&#20013;&#65292;&#37319;&#29992;&#31283;&#20581;&#32431;&#25928;&#30410;&#22343;&#34913;&#20316;&#20026;&#35299;&#30340;&#27010;&#24565;&#65292;&#24182;&#19981;&#33021;&#36890;&#36807;BIC&#30452;&#25509;&#26426;&#21046;&#23545;&#22343;&#34913;&#20998;&#37197;&#36827;&#34892;&#20840;&#38754;&#21051;&#30011;&#65292;&#21363;&#20351;&#20351;&#29992;&#20102;&#38480;&#21046;&#24615;&#30340;&#26426;&#21046;&#38598;&#21512;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper proposes the notion of robust PBE in a general competing mechanism game of incomplete information where a mechanism allows its designer to send a message to himself at the same time agents send messages. It identifies the utility environments where the notion of robust PBE coincides with that of strongly robust PBE (Epstein and Peters (1999), Han (2007)) and with that of robust PBE respectively. If each agent's utility function is additively separable with respect to principals' actions, it is possible to provide the full characterization of equilibrium allocations under the notion of robust PBE and its variations, in terms of Bayesian incentive compatible (BIC) direct mechanisms, without reference to the set of arbitrary general mechanisms allowed in the game. However, in the standard competing mechanism agme, the adoption of robust PBE as the solution concept does not lead to the full characterization of equilibrium allocations in terms of BIC direct mechanisms even with a
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25551;&#36848;&#20102;&#19968;&#20010;&#36125;&#21494;&#26031;&#35828;&#26381;&#38382;&#39064;&#65292;&#30740;&#31350;&#20102;&#21457;&#36865;&#32773;&#21644;&#25509;&#25910;&#32773;&#20043;&#38388;&#30340;&#38646;&#21644;&#21338;&#24328;&#12290;&#21457;&#36865;&#32773;&#36890;&#36807;&#32447;&#24615;&#21270;&#20808;&#39564;&#20998;&#24067;&#65292;&#21019;&#24314;&#20102;&#19968;&#20010;&#22343;&#21248;&#20998;&#24067;&#30340;&#21518;&#39564;&#22343;&#20540;&#65292;&#22312;&#19981;&#21516;&#30340;&#32972;&#26223;&#19979;&#20248;&#21270;&#32467;&#26524;&#12290;</title><link>http://arxiv.org/abs/2109.11536</link><description>&lt;p&gt;
&#20855;&#26377;&#27169;&#31946;&#25509;&#25910;&#32773;&#20559;&#22909;&#30340;&#35828;&#26381;&#38382;&#39064;
&lt;/p&gt;
&lt;p&gt;
Persuasion with Ambiguous Receiver Preferences. (arXiv:2109.11536v5 [econ.TH] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2109.11536
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25551;&#36848;&#20102;&#19968;&#20010;&#36125;&#21494;&#26031;&#35828;&#26381;&#38382;&#39064;&#65292;&#30740;&#31350;&#20102;&#21457;&#36865;&#32773;&#21644;&#25509;&#25910;&#32773;&#20043;&#38388;&#30340;&#38646;&#21644;&#21338;&#24328;&#12290;&#21457;&#36865;&#32773;&#36890;&#36807;&#32447;&#24615;&#21270;&#20808;&#39564;&#20998;&#24067;&#65292;&#21019;&#24314;&#20102;&#19968;&#20010;&#22343;&#21248;&#20998;&#24067;&#30340;&#21518;&#39564;&#22343;&#20540;&#65292;&#22312;&#19981;&#21516;&#30340;&#32972;&#26223;&#19979;&#20248;&#21270;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25551;&#36848;&#20102;&#19968;&#20010;&#36125;&#21494;&#26031;&#35828;&#26381;&#38382;&#39064;&#65292;&#20854;&#20013;&#25509;&#25910;&#32773;&#20855;&#26377;&#20195;&#34920;&#36873;&#25321;&#21457;&#36865;&#32773;&#39318;&#36873;&#34892;&#21160;&#30340;&#31169;&#26377;&#31867;&#22411;&#65292;&#32780;&#21457;&#36865;&#32773;&#23545;&#24050;&#30693;&#22343;&#20540;&#21644;&#36793;&#30028;&#30340;&#25152;&#26377;&#25509;&#25910;&#32773;&#31867;&#22411;&#20998;&#24067;&#20855;&#26377;&#26368;&#22823;-&#26368;&#23567;&#20559;&#22909;&#12290;&#36825;&#20010;&#38382;&#39064;&#21487;&#20197;&#34920;&#31034;&#20026;&#19968;&#20010;&#38646;&#21644;&#28216;&#25103;&#65292;&#21457;&#36865;&#32773;&#36873;&#25321;&#19968;&#20010;&#21518;&#39564;&#22343;&#20540;&#20449;&#24565;&#30340;&#20998;&#24067;&#65292;&#35813;&#20998;&#24067;&#26159;&#29366;&#24577;&#20107;&#21069;&#20998;&#24067;&#30340;&#20445;&#24179;&#22343;&#25910;&#32553;&#65292;&#24182;&#19988;&#19968;&#20010;&#23545;&#25163;&#24615;&#36136;&#36873;&#25321;&#19968;&#20010;&#24050;&#30693;&#22343;&#20540;&#30340;&#25509;&#25910;&#32773;&#31867;&#22411;&#20998;&#24067;&#65307;&#36873;&#25321;&#30340;&#20998;&#24067;&#20013;&#36739;&#39640;&#30340;&#23454;&#29616;&#26041;&#33719;&#32988;&#12290;&#26412;&#25991;&#27491;&#24335;&#21270;&#20102;&#26368;&#22823;-&#26368;&#23567;&#35828;&#26381;&#21644;&#29992;&#20110;&#24314;&#27169;&#25919;&#27835;&#25903;&#20986;&#12289;&#20840;&#21592;&#31454;&#20215;&#21644;&#31454;&#20105;&#24615;&#35828;&#26381;&#30340;&#31867;&#20284;&#28216;&#25103;&#20043;&#38388;&#30340;&#20851;&#31995;&#12290;&#22312;&#26631;&#20934;&#20108;&#36827;&#21046;&#29366;&#24577;&#35774;&#32622;&#21644;&#26032;&#30340;&#36830;&#32493;&#29366;&#24577;&#35774;&#32622;&#20013;&#65292;&#21457;&#36865;&#32773;&#36890;&#36807;&#32447;&#24615;&#21270;&#29366;&#24577;&#20808;&#39564;&#20998;&#24067;&#26469;&#21019;&#24314;&#19968;&#20010;&#22343;&#21248;&#20998;&#24067;&#30340;&#21518;&#39564;&#22343;&#20540;&#65292;&#35813;&#20998;&#24067;&#22312;&#24050;&#30693;&#21306;&#38388;&#19978;&#26377;&#19968;&#20010;&#25903;&#25345;&#19979;&#30028;&#30340;&#21407;&#23376;&#12290;
&lt;/p&gt;
&lt;p&gt;
I describe a Bayesian persuasion problem where Receiver has a private type representing a cutoff for choosing Sender's preferred action, and Sender has maxmin preferences over all Receiver type distributions with known mean and bounds. This problem can be represented as a zero-sum game where Sender chooses a distribution of posterior mean beliefs that is a mean-preserving contraction of the prior over states, and an adversarial Nature chooses a Receiver type distribution with the known mean; the player with the higher realization from their chosen distribution wins. I formalize the connection between maxmin persuasion and similar games used to model political spending, all-pay auctions, and competitive persuasion. In both a standard binary-state setting and a new continuous-state setting, Sender optimally linearizes the prior distribution over states to create a distribution of posterior means that is uniform on a known interval with an atom at the lower bound of its support.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#24320;&#21457;&#20102;&#19968;&#31181;&#21322;&#21442;&#25968;&#26041;&#27861;&#65292;&#23558;&#23454;&#39564;&#30340;&#30701;&#26399;&#32467;&#26524;&#21644;&#35266;&#27979;&#20540;&#32467;&#21512;&#36215;&#26469;&#65292;&#20197;&#20272;&#35745;&#38271;&#26399;&#27835;&#30103;&#25928;&#26524;&#12290;&#36825;&#31181;&#26041;&#27861;&#21487;&#20197;&#24212;&#29992;&#20110;&#21508;&#31181;&#24773;&#20917;&#65292;&#24182;&#20855;&#26377;&#39640;&#25928;&#24615;&#21644;&#36739;&#22909;&#30340;&#20272;&#35745;&#25928;&#26524;&#12290;</title><link>http://arxiv.org/abs/2107.14405</link><description>&lt;p&gt;
&#38271;&#26399;&#27835;&#30103;&#25928;&#26524;&#30340;&#21322;&#21442;&#25968;&#20272;&#35745;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Semiparametric Estimation of Long-Term Treatment Effects. (arXiv:2107.14405v4 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2107.14405
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#24320;&#21457;&#20102;&#19968;&#31181;&#21322;&#21442;&#25968;&#26041;&#27861;&#65292;&#23558;&#23454;&#39564;&#30340;&#30701;&#26399;&#32467;&#26524;&#21644;&#35266;&#27979;&#20540;&#32467;&#21512;&#36215;&#26469;&#65292;&#20197;&#20272;&#35745;&#38271;&#26399;&#27835;&#30103;&#25928;&#26524;&#12290;&#36825;&#31181;&#26041;&#27861;&#21487;&#20197;&#24212;&#29992;&#20110;&#21508;&#31181;&#24773;&#20917;&#65292;&#24182;&#20855;&#26377;&#39640;&#25928;&#24615;&#21644;&#36739;&#22909;&#30340;&#20272;&#35745;&#25928;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#23454;&#39564;&#35780;&#20272;&#30340;&#38271;&#26399;&#32467;&#26524;&#24517;&#39035;&#22312;&#24456;&#38271;&#26102;&#38388;&#21518;&#25165;&#33021;&#35266;&#23519;&#21040;&#12290;&#25105;&#20204;&#24320;&#21457;&#20102;&#21322;&#21442;&#25968;&#26041;&#27861;&#65292;&#23558;&#23454;&#39564;&#30340;&#30701;&#26399;&#32467;&#26524;&#21644;&#30701;&#26399;&#21644;&#38271;&#26399;&#32467;&#26524;&#30340;&#35266;&#23519;&#27979;&#37327;&#20540;&#32467;&#21512;&#36215;&#26469;&#65292;&#20197;&#20272;&#35745;&#38271;&#26399;&#27835;&#30103;&#25928;&#26524;&#12290;&#25105;&#20204;&#23545;&#35813;&#38382;&#39064;&#30340;&#21508;&#31181;&#24773;&#20917;&#36827;&#34892;&#20102;&#21322;&#21442;&#25968;&#26377;&#25928;&#24615;&#30028;&#38480;&#30340;&#29305;&#24449;&#21270;&#12290;&#36825;&#20123;&#35745;&#31639;&#26377;&#21161;&#20110;&#26500;&#24314;&#22810;&#20010;&#20272;&#35745;&#22120;&#12290;&#25105;&#20204;&#20351;&#29992;&#26681;&#25454;&#25206;&#36139;&#35745;&#21010;&#38271;&#26399;&#24433;&#21709;&#35780;&#20272;&#25968;&#25454;&#26657;&#20934;&#30340;&#27169;&#25311;&#20998;&#26512;&#20102;&#36825;&#20123;&#20272;&#35745;&#37327;&#30340;&#26377;&#38480;&#26679;&#26412;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;
Long-term outcomes of experimental evaluations are necessarily observed after long delays. We develop semiparametric methods for combining the short-term outcomes of experiments with observational measurements of short-term and long-term outcomes, in order to estimate long-term treatment effects. We characterize semiparametric efficiency bounds for various instances of this problem. These calculations facilitate the construction of several estimators. We analyze the finite-sample performance of these estimators with a simulation calibrated to data from an evaluation of the long-term effects of a poverty alleviation program.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#22522;&#20110;&#20998;&#26512;&#22899;&#24615;&#36873;&#25321;&#22823;&#23398;&#19987;&#19994;&#30340;&#24773;&#20917;&#65292;&#20851;&#27880;&#20110;&#35282;&#33394;&#27169;&#22411;&#23545;&#36873;&#25321;&#21644;&#32467;&#26524;&#30340;&#24433;&#21709;&#12290;&#36890;&#36807;&#19968;&#20010;&#25193;&#23637;&#30340;&#32599;&#20234;&#27169;&#22411;&#65292;&#25105;&#20204;&#26681;&#25454;&#35266;&#27979;&#36873;&#25321;&#36716;&#21464;&#24471;&#20986;&#20102;&#34917;&#20607;&#24037;&#36164;&#24046;&#24322;&#30340;&#23574;&#38160;&#30028;&#38480;&#65292;&#36827;&#19968;&#27493;&#30740;&#31350;&#20102;STEM&#39046;&#22495;&#30340;&#25104;&#26412;&#12290;</title><link>http://arxiv.org/abs/2005.09095</link><description>&lt;p&gt;
&#26480;&#20986;&#30340;&#35282;&#33394;&#27169;&#22411;&#19982;STEM&#39046;&#22495;&#30340;&#24615;&#21035;&#29305;&#23450;&#25104;&#26412;&#65306;&#19968;&#20010;&#25193;&#23637;&#30340;&#32599;&#20234;&#27169;&#22411;&#30340;&#35201;&#32032;&#36873;&#25321;
&lt;/p&gt;
&lt;p&gt;
Role models and revealed gender-specific costs of STEM in an extended Roy model of major choice. (arXiv:2005.09095v4 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2005.09095
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#22522;&#20110;&#20998;&#26512;&#22899;&#24615;&#36873;&#25321;&#22823;&#23398;&#19987;&#19994;&#30340;&#24773;&#20917;&#65292;&#20851;&#27880;&#20110;&#35282;&#33394;&#27169;&#22411;&#23545;&#36873;&#25321;&#21644;&#32467;&#26524;&#30340;&#24433;&#21709;&#12290;&#36890;&#36807;&#19968;&#20010;&#25193;&#23637;&#30340;&#32599;&#20234;&#27169;&#22411;&#65292;&#25105;&#20204;&#26681;&#25454;&#35266;&#27979;&#36873;&#25321;&#36716;&#21464;&#24471;&#20986;&#20102;&#34917;&#20607;&#24037;&#36164;&#24046;&#24322;&#30340;&#23574;&#38160;&#30028;&#38480;&#65292;&#36827;&#19968;&#27493;&#30740;&#31350;&#20102;STEM&#39046;&#22495;&#30340;&#25104;&#26412;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#22312;&#19968;&#20010;&#25193;&#23637;&#30340;&#32599;&#20234;&#27169;&#22411;&#20013;&#23548;&#20986;&#20102;&#38750;&#28040;&#36153;&#25928;&#29992;&#20998;&#37327;&#30340;&#23574;&#38160;&#30028;&#38480;&#65292;&#23558;&#35813;&#38750;&#28040;&#36153;&#25928;&#29992;&#20998;&#37327;&#35299;&#37322;&#20026;&#19968;&#20010;&#34917;&#20607;&#24037;&#36164;&#24046;&#24322;&#12290;&#36825;&#20123;&#30028;&#38480;&#22312;&#20551;&#35774;&#27599;&#20010;&#39046;&#22495;&#30340;&#28508;&#22312;&#25928;&#29992;&#65288;&#20849;&#21516;&#65289;&#38543;&#30528;&#35266;&#27979;&#36873;&#25321;&#36716;&#21464;&#32780;&#38543;&#26426;&#21333;&#35843;&#30340;&#24773;&#20917;&#19979;&#24471;&#20986;&#12290;&#36825;&#39033;&#30740;&#31350;&#30340;&#21160;&#26426;&#26159;&#20998;&#26512;&#22899;&#24615;&#36873;&#25321;&#22823;&#23398;&#19987;&#19994;&#30340;&#24773;&#20917;&#65292;&#22905;&#20204;&#22312;&#25968;&#23398;&#23494;&#38598;&#39046;&#22495;&#30340;&#20195;&#34920;&#24615;&#19981;&#36275;&#20197;&#21450;&#35282;&#33394;&#27169;&#22411;&#23545;&#36873;&#25321;&#21644;&#32467;&#26524;&#30340;&#24433;&#21709;&#12290;&#20026;&#20102;&#35828;&#26126;&#25105;&#20204;&#30340;&#26041;&#27861;&#65292;&#25105;&#20204;&#20351;&#29992;&#24503;&#22269;&#30740;&#31350;&#29983;&#35843;&#26597;&#30340;&#25968;&#25454;&#30740;&#31350;&#20102;STEM&#39046;&#22495;&#30340;&#25104;&#26412;&#65292;&#24182;&#20351;&#29992;&#27597;&#20146;&#30340;&#25945;&#32946;&#27700;&#24179;&#21644;&#36873;&#25321;&#19987;&#19994;&#26102;STEM&#23398;&#38498;&#22899;&#24615;&#21344;&#27604;&#20316;&#20026;&#36873;&#25321;&#36716;&#21464;&#32773;&#12290;
&lt;/p&gt;
&lt;p&gt;
We derive sharp bounds on the non consumption utility component in an extended Roy model of sector selection. We interpret this non consumption utility component as a compensating wage differential. The bounds are derived under the assumption that potential utilities in each sector are (jointly) stochastically monotone with respect to an observed selection shifter. The research is motivated by the analysis of women's choice of university major, their under representation in mathematics intensive fields, and the impact of role models on choices and outcomes. To illustrate our methodology, we investigate the cost of STEM fields with data from a German graduate survey, and using the mother's education level and the proportion of women on the STEM faculty at the time of major choice as selection shifters.
&lt;/p&gt;</description></item></channel></rss>