<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#35813;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#21019;&#26032;&#26041;&#27861; UN--DID&#65292;&#29992;&#20110;&#20272;&#35745;&#20855;&#26377;&#19981;&#21487;&#28151;&#21512;&#25968;&#25454;&#30340;&#24046;&#24322;&#20013;&#30340;&#24046;&#24322;&#65292;&#24182;&#36890;&#36807;&#35843;&#25972;&#38468;&#21152;&#21327;&#21464;&#37327;&#12289;&#22810;&#32452;&#21644;&#38169;&#24320;&#37319;&#32435;&#26469;&#25552;&#20379;&#26377;&#20851;&#21463;&#35797;&#32773;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#65288;ATT&#65289;&#30340;&#20272;&#35745;&#12290;</title><link>https://arxiv.org/abs/2403.15910</link><description>&lt;p&gt;
&#20855;&#26377;&#19981;&#21487;&#28151;&#21512;&#25968;&#25454;&#30340;&#24046;&#24322;&#20013;&#30340;&#24046;&#24322;
&lt;/p&gt;
&lt;p&gt;
Difference-in-Differences with Unpoolable Data
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.15910
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#21019;&#26032;&#26041;&#27861; UN--DID&#65292;&#29992;&#20110;&#20272;&#35745;&#20855;&#26377;&#19981;&#21487;&#28151;&#21512;&#25968;&#25454;&#30340;&#24046;&#24322;&#20013;&#30340;&#24046;&#24322;&#65292;&#24182;&#36890;&#36807;&#35843;&#25972;&#38468;&#21152;&#21327;&#21464;&#37327;&#12289;&#22810;&#32452;&#21644;&#38169;&#24320;&#37319;&#32435;&#26469;&#25552;&#20379;&#26377;&#20851;&#21463;&#35797;&#32773;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#65288;ATT&#65289;&#30340;&#20272;&#35745;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#26412;&#30740;&#31350;&#20013;&#65292;&#25105;&#20204;&#30830;&#23450;&#24182;&#25918;&#23485;&#20102;&#24046;&#24322;&#20013;&#30340;&#24046;&#24322;&#65288;DID&#65289;&#20272;&#35745;&#20013;&#25968;&#25454;&#8220;&#21487;&#28151;&#21512;&#24615;&#8221;&#30340;&#20551;&#35774;&#12290;&#30001;&#20110;&#25968;&#25454;&#38544;&#31169;&#38382;&#39064;&#65292;&#24448;&#24448;&#26080;&#27861;&#32452;&#21512;&#26469;&#33258;&#21463;&#35797;&#32773;&#21644;&#23545;&#29031;&#32452;&#30340;&#35266;&#27979;&#25968;&#25454;&#65292;&#22240;&#27492;&#21487;&#28151;&#21512;&#24615;&#19981;&#21487;&#34892;&#12290;&#20363;&#22914;&#65292;&#23384;&#20648;&#22312;&#23433;&#20840;&#35774;&#26045;&#20013;&#30340;&#34892;&#25919;&#20581;&#24247;&#25968;&#25454;&#24448;&#24448;&#26080;&#27861;&#36328;&#19981;&#21516;&#21496;&#27861;&#31649;&#36758;&#21306;&#32452;&#21512;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#21019;&#26032;&#26041;&#27861;&#26469;&#20272;&#35745;&#20855;&#26377;&#19981;&#21487;&#28151;&#21512;&#25968;&#25454;&#30340;DID&#65306;UN--DID&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#21253;&#25324;&#23545;&#38468;&#21152;&#21327;&#21464;&#37327;&#12289;&#22810;&#32452;&#21644;&#38169;&#24320;&#37319;&#32435;&#36827;&#34892;&#35843;&#25972;&#12290;&#22312;&#27809;&#26377;&#21327;&#21464;&#37327;&#30340;&#24773;&#20917;&#19979;&#65292;UN--DID&#21644;&#20256;&#32479;DID&#32473;&#20986;&#20102;&#30456;&#21516;&#30340;&#21463;&#35797;&#32773;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#65288;ATT&#65289;&#20272;&#35745;&#12290;&#26377;&#21327;&#21464;&#37327;&#26102;&#65292;&#25105;&#20204;&#36890;&#36807;&#25968;&#23398;&#21644;&#27169;&#25311;&#34920;&#26126;UN--DID&#21644;&#20256;&#32479;DID&#25552;&#20379;&#20102;&#19981;&#21516;&#20294;&#21516;&#26679;&#20449;&#24687;&#20016;&#23500;&#30340;ATT&#20272;&#35745;&#12290;&#19968;&#20010;&#23454;&#35777;&#31034;&#20363;&#36827;&#19968;&#27493;&#24378;&#35843;&#20102;&#25105;&#20204;&#26041;&#27861;&#30340;&#23454;&#29992;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.15910v1 Announce Type: new  Abstract: In this study, we identify and relax the assumption of data "poolability" in difference-in-differences (DID) estimation. Poolability, or the combination of observations from treated and control units into one dataset, is often not possible due to data privacy concerns. For instance, administrative health data stored in secure facilities is often not combinable across jurisdictions. We propose an innovative approach to estimate DID with unpoolable data: UN--DID. Our method incorporates adjustments for additional covariates, multiple groups, and staggered adoption. Without covariates, UN--DID and conventional DID give identical estimates of the average treatment effect on the treated (ATT). With covariates, we show mathematically and through simulations that UN--DID and conventional DID provide different, but equally informative, estimates of the ATT. An empirical example further underscores the utility of our methodology. The UN--DID meth
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#22823;&#22411;&#36817;&#20284;&#21160;&#24577;&#22240;&#23376;&#27169;&#22411;&#30340;&#20027;&#25104;&#20998;&#20998;&#26512;&#20272;&#35745;&#21644;&#25512;&#26029;&#65292;&#25552;&#20379;&#20102;&#28176;&#36817;&#32467;&#26524;&#30340;&#26367;&#20195;&#25512;&#23548;&#65292;&#24182;&#19988;&#36890;&#36807;&#32463;&#20856;&#30340;&#26679;&#26412;&#21327;&#26041;&#24046;&#30697;&#38453;&#36827;&#34892;&#20272;&#35745;&#65292;&#24471;&#20986;&#23427;&#20204;&#31561;&#20215;&#20110;OLS&#30340;&#32467;&#35770;&#12290;</title><link>http://arxiv.org/abs/2211.01921</link><description>&lt;p&gt;
&#23545;&#22823;&#22411;&#36817;&#20284;&#21160;&#24577;&#22240;&#23376;&#27169;&#22411;&#36827;&#34892;&#20027;&#25104;&#20998;&#20998;&#26512;&#30340;&#20272;&#35745;&#21644;&#25512;&#26029;
&lt;/p&gt;
&lt;p&gt;
On Estimation and Inference of Large Approximate Dynamic Factor Models via the Principal Component Analysis. (arXiv:2211.01921v3 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2211.01921
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22823;&#22411;&#36817;&#20284;&#21160;&#24577;&#22240;&#23376;&#27169;&#22411;&#30340;&#20027;&#25104;&#20998;&#20998;&#26512;&#20272;&#35745;&#21644;&#25512;&#26029;&#65292;&#25552;&#20379;&#20102;&#28176;&#36817;&#32467;&#26524;&#30340;&#26367;&#20195;&#25512;&#23548;&#65292;&#24182;&#19988;&#36890;&#36807;&#32463;&#20856;&#30340;&#26679;&#26412;&#21327;&#26041;&#24046;&#30697;&#38453;&#36827;&#34892;&#20272;&#35745;&#65292;&#24471;&#20986;&#23427;&#20204;&#31561;&#20215;&#20110;OLS&#30340;&#32467;&#35770;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20379;&#20102;&#19968;&#31181;&#23545;&#22823;&#22411;&#36817;&#20284;&#22240;&#23376;&#27169;&#22411;&#20027;&#25104;&#20998;&#20272;&#35745;&#22120;&#30340;&#28176;&#36817;&#32467;&#26524;&#30340;&#26367;&#20195;&#25512;&#23548;&#12290;&#32467;&#26524;&#26159;&#22312;&#26368;&#23567;&#30340;&#20551;&#35774;&#38598;&#21512;&#19979;&#23548;&#20986;&#30340;&#65292;&#29305;&#21035;&#22320;&#65292;&#25105;&#20204;&#21482;&#38656;&#35201;&#23384;&#22312;4&#38454;&#30697;&#12290;&#22312;&#26102;&#38388;&#24207;&#21015;&#35774;&#32622;&#20013;&#32473;&#20104;&#20102;&#29305;&#21035;&#20851;&#27880;&#65292;&#36825;&#26159;&#20960;&#20046;&#25152;&#26377;&#26368;&#26032;&#35745;&#37327;&#24212;&#29992;&#22240;&#23376;&#27169;&#22411;&#30340;&#24773;&#20917;&#12290;&#22240;&#27492;&#65292;&#20272;&#35745;&#26159;&#22522;&#20110;&#32463;&#20856;&#30340;$n\times n$&#26679;&#26412;&#21327;&#26041;&#24046;&#30697;&#38453;&#65292;&#32780;&#19981;&#26159;&#25991;&#29486;&#20013;&#24120;&#32771;&#34385;&#30340;$T\times T$&#21327;&#26041;&#24046;&#30697;&#38453;&#12290;&#20107;&#23454;&#19978;&#65292;&#23613;&#31649;&#36825;&#20004;&#31181;&#26041;&#27861;&#22312;&#28176;&#36817;&#24847;&#20041;&#19979;&#31561;&#20215;&#65292;&#20294;&#21069;&#32773;&#26356;&#31526;&#21512;&#26102;&#38388;&#24207;&#21015;&#35774;&#32622;&#65292;&#24182;&#19988;&#23427;&#31435;&#21363;&#20801;&#35768;&#25105;&#20204;&#32534;&#20889;&#26356;&#30452;&#35266;&#30340;&#20027;&#25104;&#20998;&#20272;&#35745;&#28176;&#36817;&#23637;&#24320;&#65292;&#26174;&#31034;&#23427;&#20204;&#31561;&#20215;&#20110;OLS&#65292;&#21482;&#35201;$\sqrt n/T\to 0$&#21644;$\sqrt T/n\to 0$&#65292;&#21363;&#22312;&#26102;&#38388;&#24207;&#21015;&#22238;&#24402;&#20013;&#20272;&#35745;&#36733;&#33655;&#26102;&#20551;&#35774;&#22240;&#23376;&#24050;&#30693;&#65292;&#32780;&#22240;&#23376;&#21017;&#24050;&#30693;&#12290;
&lt;/p&gt;
&lt;p&gt;
We provide an alternative derivation of the asymptotic results for the Principal Components estimator of a large approximate factor model. Results are derived under a minimal set of assumptions and, in particular, we require only the existence of 4th order moments. A special focus is given to the time series setting, a case considered in almost all recent econometric applications of factor models. Hence, estimation is based on the classical $n\times n$ sample covariance matrix and not on a $T\times T$ covariance matrix often considered in the literature. Indeed, despite the two approaches being asymptotically equivalent, the former is more coherent with a time series setting and it immediately allows us to write more intuitive asymptotic expansions for the Principal Component estimators showing that they are equivalent to OLS as long as $\sqrt n/T\to 0$ and $\sqrt T/n\to 0$, that is the loadings are estimated in a time series regression as if the factors were known, while the factors a
&lt;/p&gt;</description></item></channel></rss>