<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#35299;&#20915;&#24191;&#20041;&#30697;&#37327;&#26041;&#27861;&#65288;GMM&#65289;&#26694;&#26550;&#19979;&#21464;&#37327;&#35823;&#24046;&#65288;EIV&#65289;&#38382;&#39064;&#30340;&#26041;&#27861;&#65292;&#23545;&#20110;&#20219;&#20309;&#21021;&#22987;&#30697;&#26465;&#20214;&#65292;&#35813;&#26041;&#27861;&#25552;&#20379;&#20102;&#32416;&#27491;&#21518;&#23545;EIV&#20855;&#26377;&#40065;&#26834;&#24615;&#30340;&#30697;&#26465;&#20214;&#38598;&#65292;&#36825;&#20351;&#24471;GMM&#20272;&#35745;&#37327;&#26159;&#26681;&#21495;&#19979;n&#19968;&#33268;&#30340;&#65292;&#26631;&#20934;&#26816;&#39564;&#21644;&#32622;&#20449;&#21306;&#38388;&#25552;&#20379;&#26377;&#25928;&#30340;&#25512;&#35770;&#65292;&#23545;&#20110;&#20855;&#26377;&#22810;&#20010;&#21327;&#21464;&#37327;&#21644;&#22810;&#20803;&#30340;&#65292;&#24207;&#36143;&#30456;&#20851;&#25110;&#38750;&#32463;&#20856;EIV&#30340;&#24212;&#29992;&#31243;&#24207;&#29305;&#21035;&#37325;&#35201;&#12290;</title><link>http://arxiv.org/abs/2306.14311</link><description>&lt;p&gt;
&#27979;&#37327;&#35823;&#24046;&#20013;&#21322;&#21442;&#25968;&#27169;&#22411;&#30340;&#31616;&#21333;&#20272;&#35745;
&lt;/p&gt;
&lt;p&gt;
Simple Estimation of Semiparametric Models with Measurement Errors. (arXiv:2306.14311v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.14311
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#35299;&#20915;&#24191;&#20041;&#30697;&#37327;&#26041;&#27861;&#65288;GMM&#65289;&#26694;&#26550;&#19979;&#21464;&#37327;&#35823;&#24046;&#65288;EIV&#65289;&#38382;&#39064;&#30340;&#26041;&#27861;&#65292;&#23545;&#20110;&#20219;&#20309;&#21021;&#22987;&#30697;&#26465;&#20214;&#65292;&#35813;&#26041;&#27861;&#25552;&#20379;&#20102;&#32416;&#27491;&#21518;&#23545;EIV&#20855;&#26377;&#40065;&#26834;&#24615;&#30340;&#30697;&#26465;&#20214;&#38598;&#65292;&#36825;&#20351;&#24471;GMM&#20272;&#35745;&#37327;&#26159;&#26681;&#21495;&#19979;n&#19968;&#33268;&#30340;&#65292;&#26631;&#20934;&#26816;&#39564;&#21644;&#32622;&#20449;&#21306;&#38388;&#25552;&#20379;&#26377;&#25928;&#30340;&#25512;&#35770;&#65292;&#23545;&#20110;&#20855;&#26377;&#22810;&#20010;&#21327;&#21464;&#37327;&#21644;&#22810;&#20803;&#30340;&#65292;&#24207;&#36143;&#30456;&#20851;&#25110;&#38750;&#32463;&#20856;EIV&#30340;&#24212;&#29992;&#31243;&#24207;&#29305;&#21035;&#37325;&#35201;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#22312;&#24191;&#20041;&#30697;&#37327;&#26041;&#27861;&#65288;GMM&#65289;&#26694;&#26550;&#19979;&#24320;&#21457;&#20102;&#19968;&#31181;&#35299;&#20915;&#21464;&#37327;&#35823;&#24046;&#65288;EIV&#65289;&#38382;&#39064;&#30340;&#23454;&#29992;&#26041;&#27861;&#12290;&#25105;&#20204;&#20851;&#27880;&#30340;&#26159;EIV&#30340;&#21487;&#21464;&#24615;&#26159;&#27979;&#37327;&#35823;&#24046;&#21464;&#37327;&#30340;&#19968;&#23567;&#37096;&#20998;&#30340;&#24773;&#20917;&#65292;&#36825;&#22312;&#23454;&#35777;&#24212;&#29992;&#20013;&#24456;&#24120;&#35265;&#12290;&#23545;&#20110;&#20219;&#20309;&#21021;&#22987;&#30697;&#26465;&#20214;&#65292;&#25105;&#20204;&#30340;&#26041;&#27861;&#25552;&#20379;&#20102;&#32416;&#27491;&#21518;&#23545;EIV&#20855;&#26377;&#40065;&#26834;&#24615;&#30340;&#30697;&#26465;&#20214;&#38598;&#12290;&#25105;&#20204;&#34920;&#26126;&#65292;&#22522;&#20110;&#36825;&#20123;&#30697;&#30340;GMM&#20272;&#35745;&#37327;&#26159;&#26681;&#21495;&#19979;n&#19968;&#33268;&#30340;&#65292;&#26631;&#20934;&#26816;&#39564;&#21644;&#32622;&#20449;&#21306;&#38388;&#25552;&#20379;&#26377;&#25928;&#30340;&#25512;&#35770;&#12290;&#21363;&#20351;EIV&#24456;&#22823;&#65292;&#26420;&#32032;&#20272;&#35745;&#37327;&#65288;&#24573;&#30053;EIV&#38382;&#39064;&#65289;&#21487;&#33021;&#20005;&#37325;&#20559;&#35823;&#24182;&#19988;&#32622;&#20449;&#21306;&#38388;&#30340;&#35206;&#30422;&#29575;&#20026;0&#65285;&#65292;&#25105;&#20204;&#30340;&#26041;&#27861;&#20063;&#33021;&#22788;&#29702;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#19981;&#28041;&#21450;&#38750;&#21442;&#25968;&#20272;&#35745;&#65292;&#36825;&#23545;&#20110;&#20855;&#26377;&#22810;&#20010;&#21327;&#21464;&#37327;&#21644;&#22810;&#20803;&#30340;&#65292;&#24207;&#36143;&#30456;&#20851;&#25110;&#38750;&#32463;&#20856;EIV&#30340;&#24212;&#29992;&#31243;&#24207;&#29305;&#21035;&#37325;&#35201;&#12290;
&lt;/p&gt;
&lt;p&gt;
We develop a practical way of addressing the Errors-In-Variables (EIV) problem in the Generalized Method of Moments (GMM) framework. We focus on the settings in which the variability of the EIV is a fraction of that of the mismeasured variables, which is typical for empirical applications. For any initial set of moment conditions our approach provides a corrected set of moment conditions that are robust to the EIV. We show that the GMM estimator based on these moments is root-n-consistent, with the standard tests and confidence intervals providing valid inference. This is true even when the EIV are so large that naive estimators (that ignore the EIV problem) may be heavily biased with the confidence intervals having 0% coverage. Our approach involves no nonparametric estimation, which is particularly important for applications with multiple covariates, and settings with multivariate, serially correlated, or non-classical EIV.
&lt;/p&gt;</description></item></channel></rss>