<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#36825;&#31687;&#35770;&#25991;&#30740;&#31350;&#20102;&#19968;&#20010;&#19977;&#23618;&#25968;&#25454;&#24066;&#22330;&#65292;&#20854;&#20013;&#29992;&#25143;&#36890;&#36807;&#19982;&#24179;&#21488;&#20849;&#20139;&#25968;&#25454;&#26469;&#33719;&#24471;&#26381;&#21153;&#65292;&#20294;&#20250;&#20135;&#29983;&#38544;&#31169;&#25439;&#22833;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#24403;&#36141;&#20080;&#26041;&#23545;&#29992;&#25143;&#25968;&#25454;&#30340;&#20215;&#20540;&#36739;&#39640;&#26102;&#65292;&#25152;&#26377;&#24179;&#21488;&#37117;&#21521;&#29992;&#25143;&#25552;&#20379;&#26381;&#21153;&#65292;&#32780;&#24403;&#36141;&#20080;&#26041;&#23545;&#29992;&#25143;&#25968;&#25454;&#30340;&#20215;&#20540;&#36739;&#20302;&#26102;&#65292;&#21482;&#26377;&#20302;&#25104;&#26412;&#30340;&#22823;&#22411;&#24179;&#21488;&#33021;&#22815;&#26381;&#21153;&#29992;&#25143;&#12290;</title><link>https://arxiv.org/abs/2402.09697</link><description>&lt;p&gt;
&#20851;&#20110;&#19977;&#23618;&#25968;&#25454;&#24066;&#22330;&#30340;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
On Three-Layer Data Markets
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.09697
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#30740;&#31350;&#20102;&#19968;&#20010;&#19977;&#23618;&#25968;&#25454;&#24066;&#22330;&#65292;&#20854;&#20013;&#29992;&#25143;&#36890;&#36807;&#19982;&#24179;&#21488;&#20849;&#20139;&#25968;&#25454;&#26469;&#33719;&#24471;&#26381;&#21153;&#65292;&#20294;&#20250;&#20135;&#29983;&#38544;&#31169;&#25439;&#22833;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#24403;&#36141;&#20080;&#26041;&#23545;&#29992;&#25143;&#25968;&#25454;&#30340;&#20215;&#20540;&#36739;&#39640;&#26102;&#65292;&#25152;&#26377;&#24179;&#21488;&#37117;&#21521;&#29992;&#25143;&#25552;&#20379;&#26381;&#21153;&#65292;&#32780;&#24403;&#36141;&#20080;&#26041;&#23545;&#29992;&#25143;&#25968;&#25454;&#30340;&#20215;&#20540;&#36739;&#20302;&#26102;&#65292;&#21482;&#26377;&#20302;&#25104;&#26412;&#30340;&#22823;&#22411;&#24179;&#21488;&#33021;&#22815;&#26381;&#21153;&#29992;&#25143;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#19968;&#20010;&#30001;&#29992;&#25143;&#65288;&#25968;&#25454;&#25152;&#26377;&#32773;&#65289;&#12289;&#24179;&#21488;&#21644;&#25968;&#25454;&#36141;&#20080;&#26041;&#32452;&#25104;&#30340;&#19977;&#23618;&#25968;&#25454;&#24066;&#22330;&#12290;&#27599;&#20010;&#29992;&#25143;&#36890;&#36807;&#20849;&#20139;&#25968;&#25454;&#33719;&#24471;&#24179;&#21488;&#26381;&#21153;&#65292;&#24403;&#20182;&#20204;&#30340;&#25968;&#25454;&#19982;&#36141;&#20080;&#26041;&#20849;&#20139;&#26102;&#65292;&#20250;&#21457;&#29983;&#38544;&#31169;&#25439;&#22833;&#65292;&#23613;&#31649;&#20197;&#22122;&#22768;&#24418;&#24335;&#20849;&#20139;&#12290;&#29992;&#25143;&#36873;&#25321;&#19982;&#21738;&#20123;&#24179;&#21488;&#20998;&#20139;&#25968;&#25454;&#65292;&#32780;&#24179;&#21488;&#22312;&#20986;&#21806;&#32473;&#36141;&#20080;&#26041;&#20043;&#21069;&#20915;&#23450;&#25968;&#25454;&#30340;&#22122;&#22768;&#27700;&#24179;&#21644;&#23450;&#20215;&#12290;&#36141;&#20080;&#26041;&#36873;&#25321;&#20174;&#21738;&#20123;&#24179;&#21488;&#36141;&#20080;&#25968;&#25454;&#12290;&#25105;&#20204;&#36890;&#36807;&#22810;&#38454;&#27573;&#21338;&#24328;&#27169;&#22411;&#26469;&#25551;&#36848;&#36825;&#20123;&#20114;&#21160;&#65292;&#37325;&#28857;&#30740;&#31350;&#23376;&#21338;&#24328;&#32435;&#20160;&#22343;&#34913;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#24403;&#36141;&#20080;&#26041;&#23545;&#29992;&#25143;&#25968;&#25454;&#30340;&#20215;&#20540;&#36739;&#39640;&#65288;&#24179;&#21488;&#33021;&#22815;&#33719;&#21462;&#39640;&#20215;&#26684;&#65289;&#26102;&#65292;&#25152;&#26377;&#24179;&#21488;&#37117;&#21521;&#29992;&#25143;&#25552;&#20379;&#26381;&#21153;&#65292;&#24182;&#19988;&#29992;&#25143;&#21152;&#20837;&#24182;&#19982;&#27599;&#20010;&#24179;&#21488;&#20998;&#20139;&#25968;&#25454;&#12290;&#30456;&#21453;&#65292;&#24403;&#36141;&#20080;&#26041;&#23545;&#29992;&#25143;&#25968;&#25454;&#30340;&#20272;&#20540;&#36739;&#20302;&#26102;&#65292;&#21482;&#26377;&#20302;&#25104;&#26412;&#30340;&#22823;&#22411;&#24179;&#21488;&#33021;&#22815;&#20026;&#29992;&#25143;&#25552;&#20379;&#26381;&#21153;&#12290;&#22312;&#36825;&#31181;&#24773;&#20917;&#19979;&#65292;&#29992;&#25143;&#21482;&#21152;&#20837;&#24182;&#19982;&#36825;&#20123;&#20302;&#25104;&#26412;&#24179;&#21488;&#20998;&#20139;&#25968;&#25454;&#12290;&#26377;&#36259;&#30340;&#26159;&#65292;&#22686;&#21152;&#24179;&#21488;&#25968;&#37327;&#20250;&#22686;&#21152;&#29992;&#25143;&#21442;&#19982;&#30340;&#24847;&#24895;&#65292;&#20294;&#20063;&#20250;&#25552;&#39640;&#24179;&#21488;&#20043;&#38388;&#30340;&#31454;&#20105;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.09697v1 Announce Type: new  Abstract: We study a three-layer data market comprising users (data owners), platforms, and a data buyer. Each user benefits from platform services in exchange for data, incurring privacy loss when their data, albeit noisily, is shared with the buyer. The user chooses platforms to share data with, while platforms decide on data noise levels and pricing before selling to the buyer. The buyer selects platforms to purchase data from. We model these interactions via a multi-stage game, focusing on the subgame Nash equilibrium. We find that when the buyer places a high value on user data (and platforms can command high prices), all platforms offer services to the user who joins and shares data with every platform. Conversely, when the buyer's valuation of user data is low, only large platforms with low service costs can afford to serve users. In this scenario, users exclusively join and share data with these low-cost platforms. Interestingly, increased
&lt;/p&gt;</description></item></channel></rss>