<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>RIVCoin&#26159;&#19968;&#31181;&#24314;&#31435;&#22312;Cosmos&#19978;&#30340;&#26367;&#20195;&#32508;&#21512;&#23384;&#20648;&#21152;&#23494;&#36135;&#24065;&#65292;&#36890;&#36807;&#22810;&#20803;&#21270;&#30340;CeFi&#21644;DeFi&#36164;&#20135;&#32452;&#21512;&#36827;&#34892;&#23436;&#20840;&#31283;&#23450;&#65292;&#24182;&#19988;&#22987;&#32456;&#30001;&#20445;&#38505;&#24211;&#30340;&#36164;&#20135;&#23436;&#20840;&#25903;&#25745;&#12290;</title><link>http://arxiv.org/abs/2401.05393</link><description>&lt;p&gt;
RIVCoin:&#19968;&#31181;&#26367;&#20195;&#30340;&#32508;&#21512;CeFi/DeFi&#23384;&#20648;&#21152;&#23494;&#36135;&#24065;
&lt;/p&gt;
&lt;p&gt;
RIVCoin: an alternative, integrated, CeFi/DeFi-Vaulted Cryptocurrency. (arXiv:2401.05393v1 [q-fin.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.05393
&lt;/p&gt;
&lt;p&gt;
RIVCoin&#26159;&#19968;&#31181;&#24314;&#31435;&#22312;Cosmos&#19978;&#30340;&#26367;&#20195;&#32508;&#21512;&#23384;&#20648;&#21152;&#23494;&#36135;&#24065;&#65292;&#36890;&#36807;&#22810;&#20803;&#21270;&#30340;CeFi&#21644;DeFi&#36164;&#20135;&#32452;&#21512;&#36827;&#34892;&#23436;&#20840;&#31283;&#23450;&#65292;&#24182;&#19988;&#22987;&#32456;&#30001;&#20445;&#38505;&#24211;&#30340;&#36164;&#20135;&#23436;&#20840;&#25903;&#25745;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30333;&#30382;&#20070;&#20171;&#32461;&#20102;RIVCoin&#65292;&#36825;&#26159;&#19968;&#31181;&#24314;&#31435;&#22312;Cosmos&#19978;&#30340;&#21152;&#23494;&#36135;&#24065;&#65292;&#36890;&#36807;&#22810;&#20803;&#21270;&#30340;CeFi&#21644;DeFi&#36164;&#20135;&#32452;&#21512;&#36827;&#34892;&#23436;&#20840;&#31283;&#23450;&#65292;&#24182;&#22312;&#19968;&#20010;&#21517;&#20026;RIV Wallet&#30340;&#25968;&#23383;&#12289;&#38750;&#25176;&#31649;&#38065;&#21253;&#20013;&#25552;&#20379;&#32473;&#29992;&#25143;&#20415;&#25463;&#35775;&#38382;&#21152;&#23494;&#36135;&#24065;&#24066;&#22330;&#30340;&#26041;&#24335;&#65292;&#31526;&#21512;&#26368;&#20005;&#26684;&#30340;AML&#27861;&#24459;&#21644;&#27861;&#35268;&#35201;&#27714;&#12290;&#35813;&#20195;&#24065;&#22987;&#32456;&#30001;&#19968;&#31726;&#23376;&#36164;&#20135;&#31283;&#23450;&#65292;&#20854;&#20013;&#20648;&#22791;&#36164;&#37329;&#34987;&#38271;&#26399;&#25237;&#36164;&#20110;50%&#30340;CeFi&#36164;&#20135;&#65288;&#21253;&#25324;&#22266;&#23450;&#25910;&#30410;&#12289;&#32929;&#26435;&#12289;&#20114;&#24800;&#22522;&#37329;&#21644;&#23545;&#20914;&#22522;&#37329;&#65289;&#21644;50%&#30340;&#22810;&#20803;&#21270;&#31574;&#30053;&#65292;&#20027;&#35201;&#38598;&#20013;&#22312;&#25968;&#23383;&#36164;&#20135;&#19978;&#65292;&#20027;&#35201;&#26159;&#20027;&#35201;&#32463;&#36807;&#23454;&#25112;&#27979;&#35797;&#30340;DeFi&#21327;&#35758;&#19978;&#30340;&#36136;&#25276;&#21644;&#27969;&#21160;&#24615;&#25366;&#30719;&#12290;&#19982;&#24067;&#38647;&#39039;&#26862;&#26519;&#20307;&#31995;&#20043;&#21069;&#30340;&#32654;&#20803;&#19968;&#26679;&#65292;&#36825;&#31181;&#21152;&#23494;&#36135;&#24065;&#22987;&#32456;&#30001;&#20445;&#38505;&#24211;&#30340;&#36164;&#20135;&#23436;&#20840;&#31283;&#23450;&#65292;&#23427;&#26159;&#30001;&#21435;&#20013;&#24515;&#21270;&#33258;&#27835;&#32452;&#32455;&#38136;&#36896;&#21644;&#31649;&#29702;&#30340;&#65292;&#24182;&#23436;&#20840;&#30001;&#19987;&#19994;&#29420;&#31435;&#31532;&#19977;&#26041;&#35780;&#20272;&#30340;&#36164;&#20135;&#31283;&#23450;&#12290;
&lt;/p&gt;
&lt;p&gt;
This whitepaper introduces RIVCoin, a cryptocurrency built on Cosmos, fully stabilized by a diversified portfolio of both CeFi and DeFi assets, available in a digital, non-custodial wallet called RIV Wallet, that aims to provide Users an easy way to access the cryptocurrency markets, compliant to the strictest AML laws and regulations up to date. The token is a cryptocurrency at any time stabilized by a basket of assets: reserves are invested in a portfolio composed long term by 50% of CeFi assets, comprised of Fixed Income, Equity, Mutual and Hedge Funds and 50% of diversified strategies focused on digital assets, mainly staking and LP farming on the major, battle tested DeFi protocols. The cryptocurrency, as well as the dollar before Bretton Woods, is always fully stabilized by vaulted proof of assets: it is born and managed as a decentralized token, minted by a Decentralized Autonomous Organization, and entirely stabilized by assets evaluated by professional independent third partie
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#20998;&#24067;&#24335;&#30693;&#35782;&#65292;&#23545;&#19981;&#21516;&#31181;&#31867;&#30340;&#20195;&#29702;&#20154;&#36827;&#34892;&#20998;&#31867;&#65292;&#24182;&#36890;&#36807;&#27169;&#22411;&#34920;&#36848;&#20132;&#27969;&#21644;&#25512;&#29702;&#36807;&#31243;&#65292;&#32473;&#20986;&#20102;&#20998;&#24067;&#24335;&#30693;&#35782;&#30340;&#20004;&#31181;&#29305;&#24449;&#25551;&#36848;&#65292;&#21363;&#30693;&#35782;&#36816;&#31639;&#31526;&#21644;&#21487;&#33021;&#20851;&#31995;&#65292;&#24182;&#25581;&#31034;&#20102;&#20004;&#31181;&#26174;&#30528;&#19981;&#21516;&#30340;&#20998;&#24067;&#24335;&#30693;&#35782;&#27169;&#22411;&#12290;</title><link>http://arxiv.org/abs/2305.08729</link><description>&lt;p&gt;
&#32676;&#20307;&#30693;&#35782;&#21644;&#20010;&#20307;&#20869;&#30465;
&lt;/p&gt;
&lt;p&gt;
Group knowledge and individual introspection. (arXiv:2305.08729v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.08729
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#20998;&#24067;&#24335;&#30693;&#35782;&#65292;&#23545;&#19981;&#21516;&#31181;&#31867;&#30340;&#20195;&#29702;&#20154;&#36827;&#34892;&#20998;&#31867;&#65292;&#24182;&#36890;&#36807;&#27169;&#22411;&#34920;&#36848;&#20132;&#27969;&#21644;&#25512;&#29702;&#36807;&#31243;&#65292;&#32473;&#20986;&#20102;&#20998;&#24067;&#24335;&#30693;&#35782;&#30340;&#20004;&#31181;&#29305;&#24449;&#25551;&#36848;&#65292;&#21363;&#30693;&#35782;&#36816;&#31639;&#31526;&#21644;&#21487;&#33021;&#20851;&#31995;&#65292;&#24182;&#25581;&#31034;&#20102;&#20004;&#31181;&#26174;&#30528;&#19981;&#21516;&#30340;&#20998;&#24067;&#24335;&#30693;&#35782;&#27169;&#22411;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20998;&#24067;&#24335;&#30693;&#35782;&#65292;&#21363;&#31169;&#20154;&#20449;&#24687;&#30340;&#19968;&#32452;&#20195;&#29702;&#20154;&#22312;&#33258;&#30001;&#20132;&#27969;&#26102;&#21487;&#33021;&#30693;&#36947;&#30340;&#20869;&#23481;&#12290;&#19982;&#29616;&#26377;&#25991;&#29486;&#19981;&#21516;&#65292;&#26412;&#25991;&#30740;&#31350;&#20102;&#19981;&#21516;&#20869;&#30465;&#20195;&#29702;&#20154;&#12290;&#32771;&#34385;&#19977;&#31867;&#20195;&#29702;&#20154;&#65306;&#38750;&#20869;&#30465;&#12289;&#31215;&#26497;&#20869;&#30465;&#21644;&#23436;&#20840;&#20869;&#30465;&#12290;&#24403;&#38750;&#20869;&#30465;&#20195;&#29702;&#20154;&#30693;&#36947;&#26576;&#20123;&#20107;&#24773;&#26102;&#65292;&#22905;&#21487;&#33021;&#19981;&#30693;&#36947;&#33258;&#24049;&#30693;&#36947;&#23427;&#12290;&#30456;&#21453;&#65292;&#24403;&#23436;&#20840;&#20869;&#30465;&#20195;&#29702;&#20154;&#30693;&#36947;&#26576;&#20123;&#20107;&#24773;&#26102;&#65292;&#22905;&#24635;&#26159;&#30693;&#36947;&#33258;&#24049;&#30693;&#36947;&#23427;&#12290;&#23436;&#20840;&#20869;&#30465;&#20195;&#29702;&#20154;&#26159;&#31215;&#26497;&#20869;&#30465;&#30340;&#65292;&#24403;&#22905;&#19981;&#30693;&#36947;&#26576;&#20123;&#20107;&#24773;&#26102;&#65292;&#22905;&#20063;&#30693;&#36947;&#33258;&#24049;&#19981;&#30693;&#36947;&#23427;&#12290;&#26412;&#25991;&#36890;&#36807;&#26126;&#30830;&#34920;&#36848;&#30693;&#35782;&#36816;&#31639;&#31526;&#21644;&#21487;&#33021;&#20851;&#31995;&#26469;&#32473;&#20986;&#20998;&#24067;&#24335;&#30693;&#35782;&#30340;&#20004;&#31181;&#31561;&#20215;&#29305;&#24449;&#25551;&#36848;&#12290;&#26412;&#25991;&#36890;&#36807;&#24314;&#27169;&#26126;&#30830;&#34920;&#36848;&#30693;&#35782;&#36816;&#31639;&#31526;&#21644;&#21487;&#33021;&#20851;&#31995;&#30340;&#20132;&#27969;&#21644;&#25512;&#29702;&#36807;&#31243;&#26469;&#30740;&#31350;&#20998;&#24067;&#24335;&#30693;&#35782;&#12290;&#26412;&#25991;&#34920;&#26126;&#65292;&#23384;&#22312;&#20004;&#31181;&#26174;&#30528;&#19981;&#21516;&#30340;&#20998;&#24067;&#24335;&#30693;&#35782;&#27169;&#22411;&#65306;&#26410;&#33021;&#20869;&#30465;&#21644;&#23436;&#20840;&#20869;&#30465;&#12290;
&lt;/p&gt;
&lt;p&gt;
I study distributed knowledge, which is what a group of privately informed agents can possibly know if they communicate freely with one another. Contrary to the extant literature, I study differently introspective agents. Three categories of agents are considered: non-introspective, positively introspective, and fully introspective. When a non-introspective agent knows something, she may fail to know that she knows it. On the contrary, when a fully introspective agent knows something, she always knows that she knows it. A fully introspective agent is positively introspective and, when she does not know something, she also knows that she does not know it. I give two equivalent characterizations of distributed knowledge: one in terms of knowledge operators and the other in terms of possibility relations, i.e., binary relations. I study distributed knowledge by modelling explicitly the communication and inference making process behind it. I show that there are two significantly different 
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#20855;&#26377;&#20132;&#20114;&#22266;&#23450;&#25928;&#24212;&#30340;&#38754;&#26495;&#25968;&#25454;&#20013;&#22238;&#24402;&#31995;&#25968;&#30340;&#20272;&#35745;&#21644;&#25512;&#26029;&#38382;&#39064;&#12290;&#36890;&#36807;&#37319;&#29992;&#25913;&#36827;&#30340;&#20272;&#35745;&#22120;&#21644;&#20559;&#20506;&#24863;&#30693;&#32622;&#20449;&#21306;&#38388;&#65292;&#25105;&#20204;&#33021;&#22815;&#35299;&#20915;&#22240;&#32032;&#24369;&#24341;&#36215;&#30340;&#20559;&#20506;&#21644;&#22823;&#23567;&#22833;&#30495;&#30340;&#38382;&#39064;&#65292;&#26080;&#35770;&#22240;&#32032;&#26159;&#21542;&#24378;&#22766;&#65292;&#37117;&#33021;&#24471;&#21040;&#32479;&#19968;&#26377;&#25928;&#30340;&#32467;&#26524;&#12290;</title><link>http://arxiv.org/abs/2210.06639</link><description>&lt;p&gt;
&#20855;&#26377;&#20132;&#20114;&#22266;&#23450;&#25928;&#24212;&#30340;&#38754;&#26495;&#25968;&#25454;&#20013;&#30340;&#40065;&#26834;&#20272;&#35745;&#21644;&#25512;&#26029;
&lt;/p&gt;
&lt;p&gt;
Robust Estimation and Inference in Panels with Interactive Fixed Effects. (arXiv:2210.06639v2 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2210.06639
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#20855;&#26377;&#20132;&#20114;&#22266;&#23450;&#25928;&#24212;&#30340;&#38754;&#26495;&#25968;&#25454;&#20013;&#22238;&#24402;&#31995;&#25968;&#30340;&#20272;&#35745;&#21644;&#25512;&#26029;&#38382;&#39064;&#12290;&#36890;&#36807;&#37319;&#29992;&#25913;&#36827;&#30340;&#20272;&#35745;&#22120;&#21644;&#20559;&#20506;&#24863;&#30693;&#32622;&#20449;&#21306;&#38388;&#65292;&#25105;&#20204;&#33021;&#22815;&#35299;&#20915;&#22240;&#32032;&#24369;&#24341;&#36215;&#30340;&#20559;&#20506;&#21644;&#22823;&#23567;&#22833;&#30495;&#30340;&#38382;&#39064;&#65292;&#26080;&#35770;&#22240;&#32032;&#26159;&#21542;&#24378;&#22766;&#65292;&#37117;&#33021;&#24471;&#21040;&#32479;&#19968;&#26377;&#25928;&#30340;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#32771;&#34385;&#20855;&#26377;&#20132;&#20114;&#22266;&#23450;&#25928;&#24212;&#65288;&#21363;&#20855;&#26377;&#22240;&#23376;&#32467;&#26500;&#65289;&#30340;&#38754;&#26495;&#25968;&#25454;&#20013;&#22238;&#24402;&#31995;&#25968;&#30340;&#20272;&#35745;&#21644;&#25512;&#26029;&#38382;&#39064;&#12290;&#25105;&#20204;&#21457;&#29616;&#20043;&#21069;&#24320;&#21457;&#30340;&#20272;&#35745;&#22120;&#21644;&#32622;&#20449;&#21306;&#38388;&#21487;&#33021;&#22312;&#19968;&#20123;&#22240;&#32032;&#36739;&#24369;&#30340;&#24773;&#20917;&#19979;&#23384;&#22312;&#20005;&#37325;&#30340;&#20559;&#20506;&#21644;&#22823;&#23567;&#22833;&#30495;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#20855;&#26377;&#25913;&#36827;&#25910;&#25947;&#36895;&#24230;&#21644;&#20559;&#20506;&#24863;&#30693;&#32622;&#20449;&#21306;&#38388;&#30340;&#20272;&#35745;&#22120;&#65292;&#26080;&#35770;&#22240;&#32032;&#26159;&#21542;&#24378;&#22766;&#37117;&#33021;&#20445;&#25345;&#32479;&#19968;&#26377;&#25928;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#37319;&#29992;&#26368;&#23567;&#21270;&#32447;&#24615;&#20272;&#35745;&#29702;&#35770;&#65292;&#22312;&#21021;&#22987;&#20132;&#20114;&#22266;&#23450;&#25928;&#24212;&#30340;&#35823;&#24046;&#19978;&#20351;&#29992;&#26680;&#33539;&#25968;&#32422;&#26463;&#26469;&#24418;&#25104;&#19968;&#20010;&#26080;&#20559;&#20272;&#35745;&#12290;&#25105;&#20204;&#21033;&#29992;&#25152;&#24471;&#20272;&#35745;&#26500;&#24314;&#19968;&#20010;&#32771;&#34385;&#21040;&#22240;&#32032;&#24369;&#24341;&#36215;&#30340;&#21097;&#20313;&#20559;&#24046;&#30340;&#20559;&#20506;&#24863;&#30693;&#32622;&#20449;&#21306;&#38388;&#12290;&#22312;&#33945;&#29305;&#21345;&#27931;&#23454;&#39564;&#20013;&#65292;&#25105;&#20204;&#21457;&#29616;&#22312;&#22240;&#32032;&#36739;&#24369;&#30340;&#24773;&#20917;&#19979;&#30456;&#36739;&#20110;&#20256;&#32479;&#26041;&#27861;&#26377;&#26174;&#33879;&#25913;&#36827;&#65292;&#24182;&#19988;&#22312;&#22240;&#32032;&#36739;&#24378;&#30340;&#24773;&#20917;&#19979;&#20960;&#20046;&#27809;&#26377;&#20272;&#35745;&#35823;&#24046;&#30340;&#25439;&#22833;&#12290;
&lt;/p&gt;
&lt;p&gt;
We consider estimation and inference for a regression coefficient in panels with interactive fixed effects (i.e., with a factor structure). We show that previously developed estimators and confidence intervals (CIs) might be heavily biased and size-distorted when some of the factors are weak. We propose estimators with improved rates of convergence and bias-aware CIs that are uniformly valid regardless of whether the factors are strong or not. Our approach applies the theory of minimax linear estimation to form a debiased estimate using a nuclear norm bound on the error of an initial estimate of the interactive fixed effects. We use the obtained estimate to construct a bias-aware CI taking into account the remaining bias due to weak factors. In Monte Carlo experiments, we find a substantial improvement over conventional approaches when factors are weak, with little cost to estimation error when factors are strong.
&lt;/p&gt;</description></item></channel></rss>