<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#36825;&#31687;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#22312;&#38754;&#26495;&#25968;&#25454;&#20013;&#20272;&#35745;&#36830;&#32493;&#22788;&#29702;&#25928;&#24212;&#30340;&#26032;&#30340;&#21322;&#21442;&#25968;&#20272;&#35745;&#22120;&#65292;&#24182;&#21033;&#29992;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#21644;&#21452;&#21435;&#20559;&#26426;&#22120;&#23398;&#20064;&#25216;&#26415;&#25552;&#39640;&#20102;&#20272;&#35745;&#30340;&#20934;&#30830;&#24615;&#12290;&#30740;&#31350;&#20351;&#29992;&#36825;&#19968;&#26041;&#27861;&#34913;&#37327;&#20102;&#26497;&#31471;&#39640;&#28201;&#23545;&#32654;&#22269;&#29577;&#31859;&#20135;&#37327;&#30340;&#24433;&#21709;&#65292;&#21457;&#29616;&#20854;&#25928;&#24212;&#27604;&#20256;&#32479;&#32447;&#24615;&#22238;&#24402;&#26041;&#27861;&#20272;&#35745;&#30340;&#25928;&#24212;&#22823;50%&#12290;</title><link>http://arxiv.org/abs/2207.08789</link><description>&lt;p&gt;
&#22312;&#38754;&#26495;&#25968;&#25454;&#20013;&#20351;&#29992;&#26426;&#22120;&#23398;&#20064;&#20272;&#35745;&#36830;&#32493;&#22788;&#29702;&#25928;&#24212;&#21450;&#20854;&#22312;&#27668;&#20505;&#30740;&#31350;&#20013;&#30340;&#24212;&#29992;
&lt;/p&gt;
&lt;p&gt;
Estimating Continuous Treatment Effects in Panel Data using Machine Learning with a Climate Application. (arXiv:2207.08789v2 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2207.08789
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#22312;&#38754;&#26495;&#25968;&#25454;&#20013;&#20272;&#35745;&#36830;&#32493;&#22788;&#29702;&#25928;&#24212;&#30340;&#26032;&#30340;&#21322;&#21442;&#25968;&#20272;&#35745;&#22120;&#65292;&#24182;&#21033;&#29992;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#21644;&#21452;&#21435;&#20559;&#26426;&#22120;&#23398;&#20064;&#25216;&#26415;&#25552;&#39640;&#20102;&#20272;&#35745;&#30340;&#20934;&#30830;&#24615;&#12290;&#30740;&#31350;&#20351;&#29992;&#36825;&#19968;&#26041;&#27861;&#34913;&#37327;&#20102;&#26497;&#31471;&#39640;&#28201;&#23545;&#32654;&#22269;&#29577;&#31859;&#20135;&#37327;&#30340;&#24433;&#21709;&#65292;&#21457;&#29616;&#20854;&#25928;&#24212;&#27604;&#20256;&#32479;&#32447;&#24615;&#22238;&#24402;&#26041;&#27861;&#20272;&#35745;&#30340;&#25928;&#24212;&#22823;50%&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#24182;&#35777;&#26126;&#20102;&#19968;&#31181;&#26032;&#30340;&#21322;&#21442;&#25968;&#20272;&#35745;&#22120;&#22312;&#38754;&#26495;&#25968;&#25454;&#20013;&#23545;&#36830;&#32493;&#22788;&#29702;&#25928;&#24212;&#20855;&#26377;&#28176;&#36817;&#27491;&#24577;&#24615;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#25105;&#20204;&#20272;&#35745;&#24179;&#22343;&#23548;&#25968;&#12290;&#25105;&#20204;&#30340;&#20272;&#35745;&#22120;&#21033;&#29992;&#38754;&#26495;&#25968;&#25454;&#30340;&#32467;&#26500;&#26469;&#32771;&#34385;&#19981;&#21487;&#35266;&#23519;&#30340;&#26102;&#38388;&#19981;&#21464;&#24322;&#36136;&#24615;&#65292;&#24182;&#20351;&#29992;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#26469;&#20445;&#25345;&#32479;&#35745;&#21151;&#25928;&#65292;&#21516;&#26102;&#24314;&#27169;&#39640;&#32500;&#20851;&#31995;&#12290;&#25105;&#20204;&#20351;&#29992;&#21452;&#21435;&#20559;&#26426;&#22120;&#23398;&#20064;&#65288;DML&#65289;&#25991;&#29486;&#20013;&#30340;&#24037;&#20855;&#26500;&#24314;&#25105;&#20204;&#30340;&#20272;&#35745;&#22120;&#12290;&#22312;&#38750;&#32447;&#24615;&#38754;&#26495;&#35774;&#32622;&#30340;&#33945;&#29305;&#21345;&#32599;&#27169;&#25311;&#20013;&#65292;&#25105;&#20204;&#30340;&#26041;&#27861;&#30456;&#23545;&#20110;&#20854;&#20182;&#26041;&#27861;&#20855;&#26377;&#20302;&#20559;&#24046;&#21644;&#26041;&#24046;&#30340;&#29305;&#28857;&#26469;&#20272;&#35745;&#24179;&#22343;&#23548;&#25968;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#20351;&#29992;&#25105;&#20204;&#30340;&#20272;&#35745;&#22120;&#26469;&#34913;&#37327;&#26497;&#31471;&#39640;&#28201;&#23545;&#32654;&#22269;&#29577;&#31859;&#20135;&#37327;&#30340;&#24433;&#21709;&#65292;&#22312;&#28789;&#27963;&#25511;&#21046;&#38477;&#27700;&#21644;&#20854;&#20182;&#27668;&#35937;&#35201;&#32032;&#20043;&#21518;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#20272;&#35745;&#30340;&#26497;&#31471;&#39640;&#28201;&#25928;&#24212;&#27604;&#32447;&#24615;&#22238;&#24402;&#20272;&#35745;&#30340;&#25928;&#24212;&#22823;50%&#12290;&#36825;&#31181;&#20272;&#35745;&#24046;&#24322;&#23545;&#24212;&#20110;...&#65288;&#27492;&#22788;&#30465;&#30053;&#65289;
&lt;/p&gt;
&lt;p&gt;
This paper introduces and proves asymptotic normality for a new semi-parametric estimator of continuous treatment effects in panel data. Specifically, we estimate the average derivative. Our estimator uses the panel structure of data to account for unobservable time-invariant heterogeneity and machine learning (ML) methods to preserve statistical power while modeling high-dimensional relationships. We construct our estimator using tools from double de-biased machine learning (DML) literature. Monte Carlo simulations in a nonlinear panel setting show that our method estimates the average derivative with low bias and variance relative to other approaches. Lastly, we use our estimator to measure the impact of extreme heat on United States (U.S.) corn production, after flexibly controlling for precipitation and other weather features. Our approach yields extreme heat effect estimates that are 50% larger than estimates using linear regression. This difference in estimates corresponds to an 
&lt;/p&gt;</description></item></channel></rss>