<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#36890;&#36807;&#21033;&#29992;&#23494;&#30721;&#35745;&#31639;&#24179;&#21488;&#25910;&#38598;&#21040;&#30340;&#24066;&#25919;&#26426;&#26500;&#25968;&#25454;&#65292;&#25105;&#20204;&#24314;&#31435;&#20102;&#22522;&#20110;&#25968;&#25454;&#39537;&#21160;&#30340;&#24066;&#25919;&#32593;&#32476;&#39118;&#38505;&#27169;&#22411;&#21644;&#32593;&#32476;&#23433;&#20840;&#22522;&#20934;&#65292;&#21487;&#20197;&#24110;&#21161;&#25351;&#23548;&#32593;&#32476;&#25919;&#31574;&#21046;&#23450;&#65292;&#37327;&#21270;&#32593;&#32476;&#39118;&#38505;&#65292;&#35782;&#21035;&#24046;&#36317;&#65292;&#20248;&#20808;&#32771;&#34385;&#25919;&#31574;&#24178;&#39044;&#65292;&#20197;&#21450;&#36319;&#36394;&#24178;&#39044;&#25514;&#26045;&#30340;&#36827;&#23637;&#12290;</title><link>https://rss.arxiv.org/abs/2402.01007</link><description>&lt;p&gt;
&#21033;&#29992;&#23494;&#30721;&#35745;&#31639;&#36827;&#34892;&#24066;&#25919;&#32593;&#32476;&#39118;&#38505;&#24314;&#27169;&#20197;&#20026;&#32593;&#32476;&#25919;&#31574;&#21046;&#23450;&#25552;&#20379;&#20449;&#24687;
&lt;/p&gt;
&lt;p&gt;
Municipal cyber risk modeling using cryptographic computing to inform cyber policymaking
&lt;/p&gt;
&lt;p&gt;
https://rss.arxiv.org/abs/2402.01007
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#21033;&#29992;&#23494;&#30721;&#35745;&#31639;&#24179;&#21488;&#25910;&#38598;&#21040;&#30340;&#24066;&#25919;&#26426;&#26500;&#25968;&#25454;&#65292;&#25105;&#20204;&#24314;&#31435;&#20102;&#22522;&#20110;&#25968;&#25454;&#39537;&#21160;&#30340;&#24066;&#25919;&#32593;&#32476;&#39118;&#38505;&#27169;&#22411;&#21644;&#32593;&#32476;&#23433;&#20840;&#22522;&#20934;&#65292;&#21487;&#20197;&#24110;&#21161;&#25351;&#23548;&#32593;&#32476;&#25919;&#31574;&#21046;&#23450;&#65292;&#37327;&#21270;&#32593;&#32476;&#39118;&#38505;&#65292;&#35782;&#21035;&#24046;&#36317;&#65292;&#20248;&#20808;&#32771;&#34385;&#25919;&#31574;&#24178;&#39044;&#65292;&#20197;&#21450;&#36319;&#36394;&#24178;&#39044;&#25514;&#26045;&#30340;&#36827;&#23637;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24066;&#25919;&#26426;&#26500;&#23481;&#26131;&#21463;&#21040;&#32593;&#32476;&#25915;&#20987;&#24182;&#36896;&#25104;&#28798;&#38590;&#24615;&#21518;&#26524;&#65292;&#20294;&#32570;&#20047;&#35780;&#20272;&#33258;&#36523;&#39118;&#38505;&#24182;&#19982;&#21516;&#34892;&#26426;&#26500;&#30340;&#23433;&#20840;&#29366;&#20917;&#36827;&#34892;&#27604;&#36739;&#30340;&#20851;&#38190;&#20449;&#24687;&#12290;&#25105;&#20204;&#21033;&#29992;&#36890;&#36807;&#23494;&#30721;&#35745;&#31639;&#24179;&#21488;&#25910;&#38598;&#30340;83&#20010;&#24066;&#25919;&#26426;&#26500;&#30340;&#25968;&#25454;&#65292;&#21253;&#25324;&#23433;&#20840;&#29366;&#20917;&#12289;&#23433;&#20840;&#20107;&#20214;&#12289;&#23433;&#20840;&#25511;&#21046;&#22833;&#25928;&#20197;&#21450;&#25439;&#22833;&#65292;&#24314;&#31435;&#22522;&#20110;&#25968;&#25454;&#39537;&#21160;&#30340;&#24066;&#25919;&#32593;&#32476;&#39118;&#38505;&#27169;&#22411;&#21644;&#32593;&#32476;&#23433;&#20840;&#22522;&#20934;&#12290;&#25105;&#20204;&#29983;&#25104;&#20102;&#19968;&#20010;&#34892;&#19994;&#20013;&#23433;&#20840;&#29366;&#20917;&#30340;&#22522;&#20934;&#12289;&#32593;&#32476;&#23433;&#20840;&#20107;&#20214;&#30340;&#39057;&#29575;&#12289;&#32452;&#32455;&#26681;&#25454;&#20854;&#38450;&#24481;&#29366;&#20917;&#39044;&#27979;&#30340;&#24180;&#24230;&#25439;&#22833;&#65292;&#20197;&#21450;&#26681;&#25454;&#21508;&#20010;&#25511;&#21046;&#25514;&#26045;&#30340;&#22833;&#25928;&#29575;&#21644;&#30456;&#20851;&#25439;&#22833;&#21152;&#26435;&#12290;&#32508;&#21512;&#36825;&#22235;&#39033;&#25351;&#26631;&#21487;&#20197;&#36890;&#36807;&#37327;&#21270;&#34892;&#19994;&#20013;&#30340;&#32593;&#32476;&#39118;&#38505;&#12289;&#35782;&#21035;&#38656;&#35201;&#35299;&#20915;&#30340;&#24046;&#36317;&#12289;&#20248;&#20808;&#32771;&#34385;&#25919;&#31574;&#24178;&#39044;&#65292;&#24182;&#36319;&#36394;&#36825;&#20123;&#24178;&#39044;&#25514;&#26045;&#30340;&#36827;&#23637;&#26469;&#25351;&#23548;&#32593;&#32476;&#25919;&#31574;&#21046;&#23450;&#12290;&#23545;&#20110;&#24066;&#25919;&#26426;&#26500;&#26469;&#35828;&#65292;&#36825;&#20123;&#26032;&#30340;&#25351;&#26631;&#21487;&#20197;&#24110;&#21161;&#20182;&#20204;&#35780;&#20272;&#33258;&#36523;&#32593;&#32476;&#39118;&#38505;&#24182;&#21046;&#23450;&#30456;&#24212;&#30340;&#25913;&#36827;&#25514;&#26045;&#12290;
&lt;/p&gt;
&lt;p&gt;
Municipalities are vulnerable to cyberattacks with devastating consequences, but they lack key information to evaluate their own risk and compare their security posture to peers. Using data from 83 municipalities collected via a cryptographically secure computation platform about their security posture, incidents, security control failures, and losses, we build data-driven cyber risk models and cyber security benchmarks for municipalities. We produce benchmarks of the security posture in a sector, the frequency of cyber incidents, forecasted annual losses for organizations based on their defensive posture, and a weighting of cyber controls based on their individual failure rates and associated losses. Combined, these four items can help guide cyber policymaking by quantifying the cyber risk in a sector, identifying gaps that need to be addressed, prioritizing policy interventions, and tracking progress of those interventions over time. In the case of the municipalities, these newly der
&lt;/p&gt;</description></item><item><title>&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#26694;&#26550;&#65292;&#29992;&#20110;&#35780;&#20272;&#22914;&#20309;&#26368;&#20248;&#22320;&#23545;&#24322;&#36136;&#33021;&#21147;&#30340;&#23398;&#29983;&#36827;&#34892;&#25490;&#24207;&#21644;&#20998;&#32423;&#12290;&#19968;&#20010;&#26368;&#20248;&#30340;&#23398;&#26657;&#31995;&#32479;&#22312;&#33021;&#21147;&#26041;&#38754;&#34920;&#29616;&#20986;&#31895;&#30053;&#20998;&#23618;&#65292;&#24182;&#19988;&#22312;&#39030;&#32423;&#23398;&#26657;&#27604;&#24213;&#32423;&#23398;&#26657;&#26356;&#23485;&#26494;&#22320;&#36827;&#34892;&#20998;&#32423;&#12290;</title><link>https://rss.arxiv.org/abs/2208.10894</link><description>&lt;p&gt;
&#25490;&#21517;&#21644;&#20998;&#32423;
&lt;/p&gt;
&lt;p&gt;
Sorting and Grading
&lt;/p&gt;
&lt;p&gt;
https://rss.arxiv.org/abs/2208.10894
&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#26694;&#26550;&#65292;&#29992;&#20110;&#35780;&#20272;&#22914;&#20309;&#26368;&#20248;&#22320;&#23545;&#24322;&#36136;&#33021;&#21147;&#30340;&#23398;&#29983;&#36827;&#34892;&#25490;&#24207;&#21644;&#20998;&#32423;&#12290;&#19968;&#20010;&#26368;&#20248;&#30340;&#23398;&#26657;&#31995;&#32479;&#22312;&#33021;&#21147;&#26041;&#38754;&#34920;&#29616;&#20986;&#31895;&#30053;&#20998;&#23618;&#65292;&#24182;&#19988;&#22312;&#39030;&#32423;&#23398;&#26657;&#27604;&#24213;&#32423;&#23398;&#26657;&#26356;&#23485;&#26494;&#22320;&#36827;&#34892;&#20998;&#32423;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#26694;&#26550;&#65292;&#29992;&#20110;&#35780;&#20272;&#22914;&#20309;&#26368;&#20248;&#22320;&#23545;&#24322;&#36136;&#33021;&#21147;&#30340;&#23398;&#29983;&#36827;&#34892;&#25490;&#24207;&#21644;&#20998;&#32423;&#12290;&#28508;&#22312;&#38599;&#20027;&#23545;&#20010;&#20307;&#30340;&#29983;&#20135;&#20215;&#20540;&#23384;&#22312;&#19981;&#30830;&#23450;&#24615;&#12290;&#20102;&#35299;&#20010;&#20307;&#25152;&#23601;&#35835;&#30340;&#23398;&#26657;&#20855;&#26377;&#20004;&#20010;&#29992;&#36884;&#65306;&#39318;&#20808;&#65292;&#23398;&#26657;&#30340;&#24179;&#22343;&#23398;&#29983;&#33021;&#21147;&#21487;&#33021;&#20250;&#26377;&#25152;&#19981;&#21516;&#65307;&#20854;&#27425;&#65292;&#19981;&#21516;&#23398;&#26657;&#21487;&#33021;&#20250;&#20351;&#29992;&#19981;&#21516;&#30340;&#35780;&#20998;&#35268;&#21017;&#65292;&#20174;&#32780;&#25552;&#20379;&#19981;&#21516;&#30340;&#28608;&#21169;&#26469;&#21162;&#21147;&#12290;&#19968;&#20010;&#26368;&#20248;&#30340;&#23398;&#26657;&#31995;&#32479;&#22312;&#33021;&#21147;&#26041;&#38754;&#34920;&#29616;&#20986;&#31895;&#30053;&#20998;&#23618;&#65292;&#24182;&#19988;&#22312;&#39030;&#32423;&#23398;&#26657;&#27604;&#24213;&#32423;&#23398;&#26657;&#26356;&#23485;&#26494;&#22320;&#36827;&#34892;&#20998;&#32423;&#12290;&#25105;&#20204;&#30340;&#35770;&#25991;&#23545;&#20110;&#20013;&#23398;&#36861;&#36394;&#25919;&#31574;&#30340;&#25345;&#32493;&#36777;&#35770;&#20570;&#20986;&#20102;&#36129;&#29486;&#12290;
&lt;/p&gt;
&lt;p&gt;
We propose a framework to assess how to optimally sort and grade students of heterogenous ability. Potential employers face uncertainty regarding an individual's productive value. Knowing which school an individual went to is useful for two reasons: firstly, average student ability may differ across schools; secondly, different schools may use different grading rules and thus provide varying incentives to exert effort. An optimal school system exhibits coarse stratification with respect to ability, and more lenient grading at the top-tier schools than at the bottom-tier schools. Our paper contributes to the ongoing policy debate on tracking in secondary schools.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#37319;&#29992;&#20844;&#29702;&#21270;&#26041;&#27861;&#30740;&#31350;&#20102;&#24403;&#20195;&#29702;&#20154;&#25253;&#21578;&#25910;&#20837;&#21644;&#38656;&#27714;&#26102;&#30340;&#20877;&#20998;&#37197;&#38382;&#39064;&#65292;&#24182;&#25552;&#20986;&#20102;&#19977;&#31181;&#28966;&#28857;&#35268;&#21017;&#65288;&#33258;&#30001;&#25918;&#20219;&#12289;&#23436;&#20840;&#20877;&#20998;&#37197;&#21644;&#38656;&#35201;&#35843;&#25972;&#30340;&#23436;&#20840;&#20877;&#20998;&#37197;&#65289;&#21450;&#20854;&#22949;&#21327;&#12290;&#36890;&#36807;&#20998;&#26512;&#25581;&#31034;&#20102;&#22949;&#21327;&#30340;&#32467;&#26500;&#65292;&#24182;&#25552;&#20379;&#20102;&#32447;&#24615;&#25152;&#24471;&#31246;&#21046;&#24230;&#30340;&#20844;&#29702;&#21270;&#29702;&#35770;&#20381;&#25454;&#12290;&#30740;&#31350;&#36824;&#36890;&#36807;Eurostat&#23478;&#24237;&#39044;&#31639;&#35843;&#26597;&#35828;&#26126;&#20102;&#27431;&#27954;&#22269;&#23478;&#32771;&#34385;&#38656;&#27714;&#30340;&#19981;&#21516;&#20877;&#20998;&#37197;&#27169;&#24335;&#12290;</title><link>https://arxiv.org/abs/2402.02802</link><description>&lt;p&gt;
&#24102;&#26377;&#38656;&#27714;&#30340;&#20877;&#20998;&#37197;&#38382;&#39064;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Redistribution with Needs
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.02802
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#37319;&#29992;&#20844;&#29702;&#21270;&#26041;&#27861;&#30740;&#31350;&#20102;&#24403;&#20195;&#29702;&#20154;&#25253;&#21578;&#25910;&#20837;&#21644;&#38656;&#27714;&#26102;&#30340;&#20877;&#20998;&#37197;&#38382;&#39064;&#65292;&#24182;&#25552;&#20986;&#20102;&#19977;&#31181;&#28966;&#28857;&#35268;&#21017;&#65288;&#33258;&#30001;&#25918;&#20219;&#12289;&#23436;&#20840;&#20877;&#20998;&#37197;&#21644;&#38656;&#35201;&#35843;&#25972;&#30340;&#23436;&#20840;&#20877;&#20998;&#37197;&#65289;&#21450;&#20854;&#22949;&#21327;&#12290;&#36890;&#36807;&#20998;&#26512;&#25581;&#31034;&#20102;&#22949;&#21327;&#30340;&#32467;&#26500;&#65292;&#24182;&#25552;&#20379;&#20102;&#32447;&#24615;&#25152;&#24471;&#31246;&#21046;&#24230;&#30340;&#20844;&#29702;&#21270;&#29702;&#35770;&#20381;&#25454;&#12290;&#30740;&#31350;&#36824;&#36890;&#36807;Eurostat&#23478;&#24237;&#39044;&#31639;&#35843;&#26597;&#35828;&#26126;&#20102;&#27431;&#27954;&#22269;&#23478;&#32771;&#34385;&#38656;&#27714;&#30340;&#19981;&#21516;&#20877;&#20998;&#37197;&#27169;&#24335;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#37319;&#29992;&#20844;&#29702;&#21270;&#26041;&#27861;&#30740;&#31350;&#24403;&#20195;&#29702;&#20154;&#25253;&#21578;&#25910;&#20837;&#21644;&#38656;&#27714;&#26102;&#30340;&#20877;&#20998;&#37197;&#38382;&#39064;&#12290;&#25105;&#20204;&#24418;&#24335;&#21270;&#20102;&#21453;&#26144;&#20262;&#29702;&#21644;&#36816;&#33829;&#21407;&#21017;&#30340;&#20844;&#29702;&#65292;&#22914;&#21487;&#21152;&#24615;&#12289;&#20844;&#27491;&#21644;&#20010;&#20307;&#21512;&#29702;&#24615;&#12290;&#36825;&#20123;&#20844;&#29702;&#30340;&#19981;&#21516;&#32452;&#21512;&#34920;&#24449;&#20102;&#19977;&#31181;&#28966;&#28857;&#35268;&#21017;&#65288;&#33258;&#30001;&#25918;&#20219;&#12289;&#23436;&#20840;&#20877;&#20998;&#37197;&#21644;&#38656;&#35201;&#35843;&#25972;&#30340;&#23436;&#20840;&#20877;&#20998;&#37197;&#65289;&#65292;&#20197;&#21450;&#23427;&#20204;&#20043;&#38388;&#30340;&#22949;&#21327;&#12290;&#25105;&#20204;&#36824;&#36890;&#36807;&#25506;&#35752;Lorenz&#21344;&#20248;&#20934;&#21017;&#21644;&#22810;&#25968;&#25237;&#31080;&#25581;&#31034;&#20102;&#22949;&#21327;&#30340;&#32467;&#26500;&#12290;&#25105;&#20204;&#30340;&#20998;&#26512;&#20026;&#32447;&#24615;&#25152;&#24471;&#31246;&#21046;&#24230;&#25552;&#20379;&#20102;&#20844;&#29702;&#21270;&#30340;&#29702;&#35770;&#20381;&#25454;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#20511;&#21161;&#26469;&#33258;&#27431;&#27954;&#22269;&#23478;&#30340;Eurostat&#23478;&#24237;&#39044;&#31639;&#35843;&#26597;&#26469;&#35828;&#26126;&#32771;&#34385;&#38656;&#27714;&#30340;&#19981;&#21516;&#20877;&#20998;&#37197;&#27169;&#24335;&#12290;
&lt;/p&gt;
&lt;p&gt;
We take an axiomatic approach to study redistribution problems when agents report income and needs. We formalize axioms reflecting ethical and operational principles such as additivity, impartiality and individual rationality. Different combinations of those axioms characterize three focal rules (laissez faire, full redistribution, and need-adjusted full redistribution) as well as compromises among them. We also uncover the structure of those compromises exploring the Lorenz dominance criterion as well as majority voting. Our analysis provides an axiomatic justification for a linear income tax system. We conclude our analysis resorting to Eurostat's Household Budget Survey from where we illustrate the different redistribution patterns accounting for needs across European countries.
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#22312;&#36830;&#32493;&#27835;&#30103;&#26465;&#20214;&#19979;&#30340;&#25919;&#31574;&#23398;&#20064;&#65292;&#36890;&#36807;&#20351;&#29992;&#26680;&#26041;&#27861;&#20272;&#35745;&#25919;&#31574;&#31119;&#21033;&#65292;&#24182;&#24341;&#20837;&#19968;&#31181;&#21322;&#25968;&#25454;&#39537;&#21160;&#30340;&#31574;&#30053;&#26469;&#24179;&#34913;&#31119;&#21033;&#25439;&#22833;&#30340;&#32452;&#25104;&#37096;&#20998;&#12290;</title><link>https://arxiv.org/abs/2402.02535</link><description>&lt;p&gt;
&#22522;&#20110;&#25968;&#25454;&#39537;&#21160;&#30340;&#36830;&#32493;&#27835;&#30103;&#25919;&#31574;&#23398;&#20064;
&lt;/p&gt;
&lt;p&gt;
Data-driven Policy Learning for a Continuous Treatment
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.02535
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#22312;&#36830;&#32493;&#27835;&#30103;&#26465;&#20214;&#19979;&#30340;&#25919;&#31574;&#23398;&#20064;&#65292;&#36890;&#36807;&#20351;&#29992;&#26680;&#26041;&#27861;&#20272;&#35745;&#25919;&#31574;&#31119;&#21033;&#65292;&#24182;&#24341;&#20837;&#19968;&#31181;&#21322;&#25968;&#25454;&#39537;&#21160;&#30340;&#31574;&#30053;&#26469;&#24179;&#34913;&#31119;&#21033;&#25439;&#22833;&#30340;&#32452;&#25104;&#37096;&#20998;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#38024;&#23545;&#36830;&#32493;&#27835;&#30103;&#21464;&#37327;&#26465;&#20214;&#19979;&#30340;&#25919;&#31574;&#23398;&#20064;&#36827;&#34892;&#20102;&#30740;&#31350;&#12290;&#25105;&#20204;&#37319;&#29992;&#22522;&#20110;&#26680;&#26041;&#27861;&#30340;&#20498;&#25968;&#20272;&#35745;&#26435;&#37325;(IPW)&#26041;&#27861;&#26469;&#20272;&#35745;&#25919;&#31574;&#31119;&#21033;&#12290;&#25105;&#20204;&#30340;&#30446;&#26631;&#26159;&#22312;&#30001;&#26080;&#31351;&#30340;Vapnik-Chervonenkis(VC)&#32500;&#24230;&#29305;&#24449;&#30340;&#20840;&#23616;&#25919;&#31574;&#31867;&#20013;&#36817;&#20284;&#26368;&#20248;&#25919;&#31574;&#12290;&#36890;&#36807;&#20351;&#29992;&#19968;&#31995;&#21015;&#20855;&#26377;&#26377;&#38480;VC&#32500;&#24230;&#30340;&#31579;&#36873;&#25919;&#31574;&#31867;&#65292;&#23454;&#29616;&#20102;&#36825;&#19968;&#30446;&#26631;&#12290;&#21021;&#27493;&#20998;&#26512;&#34920;&#26126;&#65292;&#31119;&#21033;&#25439;&#22833;&#21253;&#25324;&#19977;&#20010;&#32452;&#25104;&#37096;&#20998;&#65306;&#20840;&#23616;&#31119;&#21033;&#19981;&#36275;&#12289;&#26041;&#24046;&#21644;&#20559;&#24046;&#12290;&#36825;&#23548;&#33268;&#21516;&#26102;&#36873;&#25321;&#20272;&#35745;&#30340;&#26368;&#20248;&#24102;&#23485;&#21644;&#31119;&#21033;&#36817;&#20284;&#30340;&#26368;&#20248;&#25919;&#31574;&#31867;&#25104;&#20026;&#24517;&#35201;&#12290;&#20026;&#20102;&#24212;&#23545;&#36825;&#19968;&#25361;&#25112;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#31181;&#21322;&#25968;&#25454;&#39537;&#21160;&#30340;&#31574;&#30053;&#65292;&#37319;&#29992;&#20102;&#24809;&#32602;&#25216;&#26415;&#12290;&#36825;&#31181;&#26041;&#27861;&#20135;&#29983;&#20102;&#22885;&#25289;&#20811;&#19981;&#31561;&#24335;&#65292;&#33021;&#22815;&#22312;&#19981;&#20107;&#20808;&#20102;&#35299;&#31119;&#21033;&#19981;&#36275;&#30340;&#24773;&#20917;&#19979;&#65292;&#28789;&#27963;&#24179;&#34913;&#31119;&#21033;&#25439;&#22833;&#30340;&#19977;&#20010;&#32452;&#25104;&#37096;&#20998;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper studies policy learning under the condition of unconfoundedness with a continuous treatment variable. Our research begins by employing kernel-based inverse propensity-weighted (IPW) methods to estimate policy welfare. We aim to approximate the optimal policy within a global policy class characterized by infinite Vapnik-Chervonenkis (VC) dimension. This is achieved through the utilization of a sequence of sieve policy classes, each with finite VC dimension. Preliminary analysis reveals that welfare regret comprises of three components: global welfare deficiency, variance, and bias. This leads to the necessity of simultaneously selecting the optimal bandwidth for estimation and the optimal policy class for welfare approximation. To tackle this challenge, we introduce a semi-data-driven strategy that employs penalization techniques. This approach yields oracle inequalities that adeptly balance the three components of welfare regret without prior knowledge of the welfare deficie
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#36890;&#36807;&#20351;&#29992;&#21160;&#24577;&#22240;&#23376;&#27169;&#22411;&#21644;&#31232;&#30095;VAR&#29305;&#27530;&#20998;&#37327;&#65292;&#37325;&#26032;&#20272;&#35745;&#20102;&#39640;&#32500;&#20840;&#29699;&#38134;&#34892;&#32593;&#32476;&#36830;&#36890;&#24615;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#31995;&#32479;&#33539;&#22260;&#36830;&#36890;&#24230;&#65288;SWC&#65289;&#22312;&#20840;&#29699;&#21361;&#26426;&#26399;&#38388;&#24613;&#21095;&#19978;&#21319;&#65292;&#32780;&#35813;&#26041;&#27861;&#33021;&#22815;&#26368;&#23567;&#21270;&#23545;SWC&#20302;&#20272;&#30340;&#39118;&#38505;&#12290;</title><link>https://arxiv.org/abs/2402.02482</link><description>&lt;p&gt;
&#20840;&#29699;&#38134;&#34892;&#32593;&#32476;&#36830;&#36890;&#24615;&#30340;&#20877;&#25506;&#65306;&#20160;&#20040;&#26159;&#20849;&#21516;&#30340;&#65292;&#29305;&#27530;&#30340;&#21644;&#20309;&#26102;?
&lt;/p&gt;
&lt;p&gt;
Global bank network connectedness revisited: What is common, idiosyncratic and when?
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.02482
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#36890;&#36807;&#20351;&#29992;&#21160;&#24577;&#22240;&#23376;&#27169;&#22411;&#21644;&#31232;&#30095;VAR&#29305;&#27530;&#20998;&#37327;&#65292;&#37325;&#26032;&#20272;&#35745;&#20102;&#39640;&#32500;&#20840;&#29699;&#38134;&#34892;&#32593;&#32476;&#36830;&#36890;&#24615;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#31995;&#32479;&#33539;&#22260;&#36830;&#36890;&#24230;&#65288;SWC&#65289;&#22312;&#20840;&#29699;&#21361;&#26426;&#26399;&#38388;&#24613;&#21095;&#19978;&#21319;&#65292;&#32780;&#35813;&#26041;&#27861;&#33021;&#22815;&#26368;&#23567;&#21270;&#23545;SWC&#20302;&#20272;&#30340;&#39118;&#38505;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#37325;&#26032;&#23457;&#35270;&#20102;&#20272;&#35745;&#39640;&#32500;&#20840;&#29699;&#38134;&#34892;&#32593;&#32476;&#36830;&#36890;&#24615;&#30340;&#38382;&#39064;&#12290;&#19982;Demirer&#31561;&#20154;&#65288;2018&#65289;&#30452;&#25509;&#23545;&#23454;&#29616;&#30340;&#39640;&#32500;&#27874;&#21160;&#24615;&#21521;&#37327;&#36827;&#34892;&#27491;&#21017;&#21270;&#19981;&#21516;&#65292;&#25105;&#20204;&#20272;&#35745;&#20102;&#19968;&#20010;&#20855;&#26377;&#31232;&#30095;VAR&#29305;&#27530;&#20998;&#37327;&#30340;&#21160;&#24577;&#22240;&#23376;&#27169;&#22411;&#12290;&#36825;&#26679;&#21487;&#20197;&#21306;&#20998;&#65306;&#65288;I&#65289;&#31995;&#32479;&#33539;&#22260;&#36830;&#36890;&#24230;&#65288;SWC&#65289;&#30001;&#20849;&#21516;&#25104;&#20998;&#20914;&#20987;&#24341;&#36215;&#30340;&#37096;&#20998;&#65288;&#25105;&#20204;&#31216;&#20043;&#20026;&#8220;&#38134;&#34892;&#24066;&#22330;&#8221;&#65289;&#65292;&#20197;&#21450;&#65288;II&#65289;&#30001;&#29305;&#27530;&#20914;&#20987;&#24341;&#36215;&#30340;&#37096;&#20998;&#65288;&#21333;&#20010;&#38134;&#34892;&#65289;&#12290;&#25105;&#20204;&#20351;&#29992;Demirer&#31561;&#20154;&#65288;2018&#65289;&#30340;&#21407;&#22987;&#25968;&#25454;&#38598;&#65288;&#27599;&#26085;&#25968;&#25454;&#65292;2003-2013&#65289;&#20197;&#21450;&#26356;&#26032;&#30340;&#25968;&#25454;&#38598;&#65288;2014-2023&#65289;&#12290;&#23545;&#20110;&#20004;&#32773;&#65292;&#25105;&#20204;&#35745;&#31639;&#30001;&#65288;I&#65289;&#65292;&#65288;II&#65289;&#65292;&#65288;I+II&#65289;&#20135;&#29983;&#30340;SWC&#65292;&#24182;&#25552;&#20379;&#33258;&#21161;&#27861;&#32622;&#20449;&#21306;&#38388;&#12290;&#19982;&#25991;&#29486;&#19968;&#33268;&#65292;&#25105;&#20204;&#21457;&#29616;SWC&#22312;&#20840;&#29699;&#21361;&#26426;&#26399;&#38388;&#29467;&#22686;&#12290;&#28982;&#32780;&#65292;&#25105;&#20204;&#30340;&#26041;&#27861;&#23558;SWC&#20302;&#20272;&#30340;&#39118;&#38505;&#38477;&#33267;&#26368;&#20302;&#65292;&#36825;&#22312;&#39640;&#32500;&#25968;&#25454;&#38598;&#20013;&#65292;&#31995;&#32479;&#39118;&#38505;&#30340;&#21457;&#29983;&#21487;&#33021;&#26082;&#26222;&#36941;&#21448;&#29305;&#27530;&#30340;&#24773;&#20917;&#19979;&#33267;&#20851;&#37325;&#35201;&#12290;&#23454;&#38469;&#19978;&#65292;&#25105;&#20204;&#33021;&#22815;&#21306;&#20998;&#20986;...
&lt;/p&gt;
&lt;p&gt;
We revisit the problem of estimating high-dimensional global bank network connectedness. Instead of directly regularizing the high-dimensional vector of realized volatilities as in Demirer et al. (2018), we estimate a dynamic factor model with sparse VAR idiosyncratic components. This allows to disentangle: (I) the part of system-wide connectedness (SWC) due to the common component shocks (what we call the "banking market"), and (II) the part due to the idiosyncratic shocks (the single banks). We employ both the original dataset as in Demirer et al. (2018) (daily data, 2003-2013), as well as a more recent vintage (2014-2023). For both, we compute SWC due to (I), (II), (I+II) and provide bootstrap confidence bands. In accordance with the literature, we find SWC to spike during global crises. However, our method minimizes the risk of SWC underestimation in high-dimensional datasets where episodes of systemic risk can be both pervasive and idiosyncratic. In fact, we are able to disentangl
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#20998;&#26512;&#20102;&#35199;&#29677;&#29273;2001&#24180;&#33267;2021&#24180;&#26399;&#38388;&#22686;&#21152;&#26368;&#20302;&#24037;&#36164;&#23545;&#25910;&#20837;&#19981;&#24179;&#31561;&#30340;&#24433;&#21709;&#65292;&#32467;&#26524;&#26174;&#31034;&#25552;&#39640;&#26368;&#20302;&#24037;&#36164;&#21487;&#20197;&#20943;&#23569;&#25910;&#20837;&#19981;&#24179;&#31561;&#65292;&#19988;&#19981;&#20250;&#23548;&#33268;&#36890;&#32960;&#25110;&#22686;&#21152;&#22833;&#19994;&#12290;</title><link>https://arxiv.org/abs/2402.02402</link><description>&lt;p&gt;
2001&#24180;&#33267;2021&#24180;&#38388;&#65292;&#26426;&#22120;&#23398;&#20064;&#20998;&#26512;&#20102;&#35199;&#29677;&#29273;&#22686;&#21152;&#26368;&#20302;&#24037;&#36164;&#23545;&#25910;&#20837;&#19981;&#24179;&#31561;&#30340;&#24433;&#21709;
&lt;/p&gt;
&lt;p&gt;
Machine Learning Analysis of the Impact of Increasing the Minimum Wage on Income Inequality in Spain from 2001 to 2021
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.02402
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#20998;&#26512;&#20102;&#35199;&#29677;&#29273;2001&#24180;&#33267;2021&#24180;&#26399;&#38388;&#22686;&#21152;&#26368;&#20302;&#24037;&#36164;&#23545;&#25910;&#20837;&#19981;&#24179;&#31561;&#30340;&#24433;&#21709;&#65292;&#32467;&#26524;&#26174;&#31034;&#25552;&#39640;&#26368;&#20302;&#24037;&#36164;&#21487;&#20197;&#20943;&#23569;&#25910;&#20837;&#19981;&#24179;&#31561;&#65292;&#19988;&#19981;&#20250;&#23548;&#33268;&#36890;&#32960;&#25110;&#22686;&#21152;&#22833;&#19994;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20998;&#26512;&#20102;2001&#24180;&#33267;2021&#24180;&#26399;&#38388;&#35199;&#29677;&#29273;&#22269;&#23478;&#26368;&#20302;&#24037;&#36164;&#30340;&#24433;&#21709;&#12290;&#26368;&#20302;&#24037;&#36164;&#20174;2001&#24180;&#30340;505.7&#27431;&#20803;/&#26376;&#22686;&#21152;&#21040;2021&#24180;&#30340;1,108.3&#27431;&#20803;/&#26376;&#12290;&#21033;&#29992;&#35199;&#29677;&#29273;&#31246;&#21153;&#31649;&#29702;&#23616;&#25552;&#20379;&#30340;&#25968;&#25454;&#65292;&#21487;&#20197;&#20998;&#26512;&#20195;&#34920;&#25972;&#20010;&#20154;&#21475;&#30340;&#25968;&#25454;&#24211;&#12290;&#36825;&#20123;&#32479;&#35745;&#25968;&#25454;&#25552;&#20379;&#20102;&#26356;&#20934;&#30830;&#30340;&#32467;&#26524;&#21644;&#26356;&#39640;&#25928;&#30340;&#39044;&#27979;&#27169;&#22411;&#12290;&#26412;&#30740;&#31350;&#30340;&#29305;&#28857;&#22312;&#20110;&#20351;&#29992;&#30340;&#26159;&#20840;&#22269;&#20154;&#21475;&#26222;&#26597;&#25968;&#25454;&#65292;&#32780;&#19981;&#26159;&#26679;&#26412;&#25110;&#39044;&#27979;&#25968;&#25454;&#12290;&#22240;&#27492;&#65292;&#26412;&#30740;&#31350;&#22522;&#20110;&#35199;&#29677;&#29273;&#34218;&#36164;&#26222;&#26597;2001-2021&#24180;&#30340;&#21382;&#21490;&#25968;&#25454;&#65292;&#21453;&#26144;&#20102;&#32467;&#26524;&#21644;&#20998;&#26512;&#12290;&#21508;&#31181;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#34920;&#26126;&#65292;&#25552;&#39640;&#26368;&#20302;&#24037;&#36164;&#21487;&#20197;&#20943;&#23569;&#25910;&#20837;&#19981;&#24179;&#31561;&#12290;&#25552;&#39640;&#26368;&#20302;&#24037;&#36164;&#24182;&#26410;&#23548;&#33268;&#36890;&#32960;&#25110;&#22686;&#21152;&#22833;&#19994;&#12290;&#30456;&#21453;&#65292;&#23427;&#19982;&#22686;&#21152;&#20928;&#23601;&#19994;&#12289;&#25511;&#21046;&#29289;&#20215;&#21644;&#22686;&#21152;&#20225;&#19994;&#21033;&#28070;&#29575;&#20445;&#25345;&#19968;&#33268;&#12290;&#26368;&#37325;&#35201;&#30340;&#32467;&#35770;&#26159;&#65292;&#22312;&#20998;&#26512;&#26399;&#38388;&#25552;&#39640;&#26368;&#20302;&#24037;&#36164;&#21487;&#20197;&#20419;&#36827;&#32463;&#27982;&#21457;&#23637;&#65292;&#22686;&#21152;&#31119;&#21033;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper analyzes the impact of the National Minimum Wage from 2001 to 2021. The MNW increased from 505.7/month (2001) to 1,108.3/month (2021). Using the data provided by the Spanish Tax Administration Agency, databases that represent the entire population studied can be analyzed. More accurate results and more efficient predictive models are provided by these counts. This work is characterized by the database used, which is a national census and not a sample or projection. Therefore, the study reflects results and analyses based on historical data from the Spanish Salary Census 2001-2021. Various machine-learning models show that income inequality has been reduced by raising the minimum wage. Raising the minimum wage has not led to inflation or increased unemployment. On the contrary, it has been consistent with increased net employment, contained prices, and increased corporate profit margins. The most important conclusion is that an increase in the minimum wage in the period analy
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#24341;&#20837;&#21644;&#35774;&#35745;&#20102;&#20960;&#20010;&#23545;&#32447;&#24615;&#36153;&#33293;&#23572;&#24066;&#22330;&#65288;LFM&#65289;&#21644;&#19968;&#25163;&#20215;&#26684;&#31454;&#20215;&#22343;&#34913;&#65288;FPPE&#65289;&#36827;&#34892;&#32479;&#35745;&#26377;&#25928;&#33258;&#20030;&#25512;&#26029;&#30340;&#36807;&#31243;&#65292;&#20854;&#20013;&#26368;&#20855;&#25361;&#25112;&#24615;&#30340;&#26159;&#23545;&#19968;&#33324;FPPE&#36827;&#34892;&#33258;&#20030;&#12290;&#36890;&#36807;&#20351;&#29992;&#29615;&#25910;&#25947;&#29702;&#35770;&#30340;&#26377;&#21147;&#24037;&#20855;&#65292;&#22312;&#28201;&#21644;&#30340;&#36864;&#21270;&#26465;&#20214;&#19979;&#25104;&#21151;&#35774;&#35745;&#20102;FPPE&#30340;&#33258;&#20030;&#36807;&#31243;&#12290;</title><link>https://arxiv.org/abs/2402.02303</link><description>&lt;p&gt;
&#33258;&#20030;&#36153;&#33293;&#23572;&#24066;&#22330;&#22343;&#34913;&#21644;&#19968;&#25163;&#20215;&#26684;&#31454;&#20215;&#22343;&#34913;
&lt;/p&gt;
&lt;p&gt;
Bootstrapping Fisher Market Equilibrium and First-Price Pacing Equilibrium
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.02303
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#24341;&#20837;&#21644;&#35774;&#35745;&#20102;&#20960;&#20010;&#23545;&#32447;&#24615;&#36153;&#33293;&#23572;&#24066;&#22330;&#65288;LFM&#65289;&#21644;&#19968;&#25163;&#20215;&#26684;&#31454;&#20215;&#22343;&#34913;&#65288;FPPE&#65289;&#36827;&#34892;&#32479;&#35745;&#26377;&#25928;&#33258;&#20030;&#25512;&#26029;&#30340;&#36807;&#31243;&#65292;&#20854;&#20013;&#26368;&#20855;&#25361;&#25112;&#24615;&#30340;&#26159;&#23545;&#19968;&#33324;FPPE&#36827;&#34892;&#33258;&#20030;&#12290;&#36890;&#36807;&#20351;&#29992;&#29615;&#25910;&#25947;&#29702;&#35770;&#30340;&#26377;&#21147;&#24037;&#20855;&#65292;&#22312;&#28201;&#21644;&#30340;&#36864;&#21270;&#26465;&#20214;&#19979;&#25104;&#21151;&#35774;&#35745;&#20102;FPPE&#30340;&#33258;&#20030;&#36807;&#31243;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#32447;&#24615;&#36153;&#33293;&#23572;&#24066;&#22330;&#65288;LFM&#65289;&#26159;&#32463;&#27982;&#23398;&#20013;&#30340;&#19968;&#20010;&#22522;&#26412;&#22343;&#34913;&#27169;&#22411;&#65292;&#20063;&#22312;&#20844;&#24179;&#21644;&#39640;&#25928;&#30340;&#36164;&#28304;&#20998;&#37197;&#26041;&#38754;&#26377;&#24212;&#29992;&#12290;&#19968;&#25163;&#20215;&#26684;&#31454;&#20215;&#22343;&#34913;&#65288;FPPE&#65289;&#26159;&#19968;&#31181;&#25429;&#25417;&#31532;&#19968;&#20215;&#26684;&#25293;&#21334;&#20013;&#39044;&#31639;&#31649;&#29702;&#26426;&#21046;&#30340;&#27169;&#22411;&#12290;&#22312;&#26576;&#20123;&#23454;&#38469;&#24773;&#20917;&#19979;&#65292;&#22914;&#24191;&#21578;&#25293;&#21334;&#65292;&#22312;&#36825;&#20123;&#27169;&#22411;&#19978;&#36827;&#34892;&#32479;&#35745;&#25512;&#26029;&#20855;&#26377;&#19968;&#23450;&#30340;&#20852;&#36259;&#12290;&#19968;&#31181;&#24191;&#27867;&#24212;&#29992;&#20110;&#19968;&#33324;&#32479;&#35745;&#25512;&#26029;&#30340;&#24120;&#29992;&#26041;&#27861;&#26159;&#33258;&#20030;&#36807;&#31243;&#12290;&#28982;&#32780;&#65292;&#23545;&#20110;LFM&#21644;FPPE&#65292;&#30446;&#21069;&#19981;&#23384;&#22312;&#26377;&#25928;&#24212;&#29992;&#33258;&#20030;&#31243;&#24207;&#30340;&#29702;&#35770;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#24341;&#20837;&#24182;&#35774;&#35745;&#20102;&#20960;&#20010;&#23545;LFM&#21644;FPPE&#36827;&#34892;&#32479;&#35745;&#26377;&#25928;&#33258;&#20030;&#25512;&#26029;&#30340;&#36807;&#31243;&#12290;&#26368;&#20855;&#25361;&#25112;&#24615;&#30340;&#37096;&#20998;&#26159;&#23545;&#19968;&#33324;FPPE&#36827;&#34892;&#33258;&#20030;&#65292;&#36825;&#24402;&#32467;&#20026;&#33258;&#20030;&#32422;&#26463;M-&#20272;&#35745;&#37327;&#65292;&#36825;&#26159;&#19968;&#20010;&#24456;&#22823;&#31243;&#24230;&#19978;&#26410;&#24320;&#21457;&#30340;&#38382;&#39064;&#12290;&#25105;&#20204;&#36890;&#36807;&#20351;&#29992;&#29615;&#25910;&#25947;&#29702;&#35770;&#30340;&#26377;&#21147;&#24037;&#20855;&#65292;&#22312;&#28201;&#21644;&#30340;&#36864;&#21270;&#26465;&#20214;&#19979;&#20026;FPPE&#35774;&#35745;&#20102;&#19968;&#20010;&#33258;&#20030;&#36807;&#31243;&#12290;&#36890;&#36807;&#21512;&#25104;&#21644;&#23454;&#38469;&#25968;&#25454;&#30340;&#23454;&#39564;&#35777;&#26126;&#20102;&#25105;&#20204;&#30340;&#26041;&#27861;&#30340;&#26377;&#25928;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
The linear Fisher market (LFM) is a basic equilibrium model from economics, which also has applications in fair and efficient resource allocation. First-price pacing equilibrium (FPPE) is a model capturing budget-management mechanisms in first-price auctions. In certain practical settings such as advertising auctions, there is an interest in performing statistical inference over these models. A popular methodology for general statistical inference is the bootstrap procedure. Yet, for LFM and FPPE there is no existing theory for the valid application of bootstrap procedures. In this paper, we introduce and devise several statistically valid bootstrap inference procedures for LFM and FPPE. The most challenging part is to bootstrap general FPPE, which reduces to bootstrapping constrained M-estimators, a largely unexplored problem. We devise a bootstrap procedure for FPPE under mild degeneracy conditions by using the powerful tool of epi-convergence theory. Experiments with synthetic and s
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21333;&#33192;&#32960;&#38646;&#25130;&#26029;&#35745;&#25968;&#22238;&#24402;&#27169;&#22411;&#65292;&#29992;&#20110;&#35299;&#20915;&#22312;&#38646;&#25130;&#26029;&#35745;&#25968;&#25968;&#25454;&#20013;&#24120;&#35265;&#20294;&#26410;&#34987;&#35299;&#20915;&#30340;"&#21333;&#33192;&#32960;"&#29616;&#35937;&#12290;&#36890;&#36807;&#27169;&#25311;&#30740;&#31350;&#21644;&#30495;&#23454;&#25968;&#25454;&#38598;&#21457;&#29616;&#65292;&#25105;&#20204;&#30340;&#27169;&#22411;&#22312;&#22823;&#37096;&#20998;&#25968;&#25454;&#20013;&#20248;&#20110;&#20256;&#32479;&#27169;&#22411;&#65292;&#24182;&#25552;&#20379;&#20102;&#30456;&#24212;&#30340;&#20272;&#35745;&#12289;&#36793;&#38469;&#25928;&#24212;&#21644;&#26816;&#39564;&#26041;&#27861;&#12290;</title><link>https://arxiv.org/abs/2402.02272</link><description>&lt;p&gt;
&#21333;&#33192;&#32960;&#38646;&#25130;&#26029;&#35745;&#25968;&#22238;&#24402;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
One-inflated zero-truncated count regression models
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.02272
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21333;&#33192;&#32960;&#38646;&#25130;&#26029;&#35745;&#25968;&#22238;&#24402;&#27169;&#22411;&#65292;&#29992;&#20110;&#35299;&#20915;&#22312;&#38646;&#25130;&#26029;&#35745;&#25968;&#25968;&#25454;&#20013;&#24120;&#35265;&#20294;&#26410;&#34987;&#35299;&#20915;&#30340;"&#21333;&#33192;&#32960;"&#29616;&#35937;&#12290;&#36890;&#36807;&#27169;&#25311;&#30740;&#31350;&#21644;&#30495;&#23454;&#25968;&#25454;&#38598;&#21457;&#29616;&#65292;&#25105;&#20204;&#30340;&#27169;&#22411;&#22312;&#22823;&#37096;&#20998;&#25968;&#25454;&#20013;&#20248;&#20110;&#20256;&#32479;&#27169;&#22411;&#65292;&#24182;&#25552;&#20379;&#20102;&#30456;&#24212;&#30340;&#20272;&#35745;&#12289;&#36793;&#38469;&#25928;&#24212;&#21644;&#26816;&#39564;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#21457;&#29616;&#22312;&#38646;&#25130;&#26029;&#35745;&#25968;&#25968;&#25454;&#65288;y=1,2,...&#65289;&#20013;&#65292;&#20010;&#20307;&#22312;&#31532;&#19968;&#27425;&#35266;&#23519;&#65288;y=1&#65289;&#20013;&#24120;&#24120;&#33719;&#24471;&#20449;&#24687;&#65292;&#23548;&#33268;&#19968;&#31181;&#24120;&#35265;&#20294;&#26410;&#34987;&#35299;&#20915;&#30340;"&#21333;&#33192;&#32960;"&#29616;&#35937;&#12290;&#24403;&#21069;&#30340;&#26631;&#20934;&#27169;&#22411;&#65292;&#38646;&#25130;&#26029;&#36127;&#20108;&#39033;&#65288;ZTNB&#65289;&#27169;&#22411;&#65292;&#22312;&#23384;&#22312;&#21333;&#33192;&#32960;&#26102;&#34987;&#38169;&#35823;&#35774;&#23450;&#65292;&#23548;&#33268;&#20102;&#20559;&#24046;&#21644;&#19981;&#19968;&#33268;&#24615;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#31181;&#21333;&#33192;&#32960;&#38646;&#25130;&#26029;&#36127;&#20108;&#39033;&#65288;OIZTNB&#65289;&#22238;&#24402;&#27169;&#22411;&#12290;&#36890;&#36807;&#27169;&#25311;&#30740;&#31350;&#21644;&#23545;&#22235;&#20010;&#20256;&#32479;&#19978;&#20351;&#29992;ZTNB&#27169;&#22411;&#30340;&#25968;&#25454;&#38598;&#20013;&#21457;&#29616;&#30340;&#21333;&#33192;&#32960;&#29616;&#35937;&#30340;&#30740;&#31350;&#65292;&#25105;&#20204;&#24378;&#35843;&#20102;&#25105;&#20204;&#27169;&#22411;&#30340;&#37325;&#35201;&#24615;&#12290;&#25105;&#20204;&#25512;&#33616;&#22312;&#22823;&#37096;&#20998;&#25968;&#25454;&#20013;&#20351;&#29992;OIZTNB&#27169;&#22411;&#20195;&#26367;ZTNB&#27169;&#22411;&#65292;&#24182;&#25552;&#20379;&#20102;&#20272;&#35745;&#12289;&#36793;&#38469;&#25928;&#24212;&#21644;&#26816;&#39564;&#12290;&#20276;&#38543;&#30340;R&#21253;oneinfl&#25552;&#20379;&#36825;&#20123;&#21151;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;
We find that in zero-truncated count data (y=1,2,...), individuals often gain information at first observation (y=1), leading to a common but unaddressed phenomenon of "one-inflation". The current standard, the zero-truncated negative binomial (ZTNB) model, is misspecified under one-inflation, causing bias and inconsistency. To address this, we introduce the one-inflated zero-truncated negative binomial (OIZTNB) regression model. The importance of our model is highlighted through simulation studies, and through the discovery of one-inflation in four datasets that have traditionally championed ZTNB. We recommended OIZTNB over ZTNB for most data, and provide estimation, marginal effects, and testing in the accompanying R package oneinfl.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#25968;&#20540;&#35299;&#20915;&#26041;&#26696;&#65292;&#29992;&#20110;&#25551;&#36848;&#23454;&#29289;&#36164;&#26412;&#21644;&#25216;&#26415;&#36827;&#27493;&#28436;&#21270;&#36807;&#31243;&#30340;&#25243;&#29289;&#22411;ODE Solow&#27169;&#22411;&#65292;&#32771;&#34385;&#20102;&#36164;&#26412;&#21644;&#25216;&#26415;&#30340;&#31354;&#38388;&#25193;&#25955;&#12290;&#36890;&#36807;&#20351;&#29992;&#24191;&#20041;&#26377;&#38480;&#24046;&#20998;&#26041;&#27861;&#65292;&#35777;&#26126;&#20102;&#25968;&#20540;&#35299;&#19982;&#36830;&#32493;&#35299;&#30340;&#25910;&#25947;&#24615;&#65292;&#24182;&#36890;&#36807;&#22810;&#20010;&#31034;&#20363;&#39564;&#35777;&#20102;&#26041;&#27861;&#30340;&#20934;&#30830;&#24615;&#12290;</title><link>https://arxiv.org/abs/2402.02197</link><description>&lt;p&gt;
&#19968;&#31181;&#20855;&#26377;&#31354;&#38388;&#25193;&#25955;&#21644;&#25216;&#26415;&#35825;&#23548;&#31227;&#21160;&#24615;&#30340;&#25243;&#29289;&#22411;ODE Solow&#27169;&#22411;&#30340;&#25968;&#20540;&#35299;&#20915;&#26041;&#26696;
&lt;/p&gt;
&lt;p&gt;
Numerical solution to a Parabolic-ODE Solow model with spatial diffusion and technology-induced motility
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.02197
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#25968;&#20540;&#35299;&#20915;&#26041;&#26696;&#65292;&#29992;&#20110;&#25551;&#36848;&#23454;&#29289;&#36164;&#26412;&#21644;&#25216;&#26415;&#36827;&#27493;&#28436;&#21270;&#36807;&#31243;&#30340;&#25243;&#29289;&#22411;ODE Solow&#27169;&#22411;&#65292;&#32771;&#34385;&#20102;&#36164;&#26412;&#21644;&#25216;&#26415;&#30340;&#31354;&#38388;&#25193;&#25955;&#12290;&#36890;&#36807;&#20351;&#29992;&#24191;&#20041;&#26377;&#38480;&#24046;&#20998;&#26041;&#27861;&#65292;&#35777;&#26126;&#20102;&#25968;&#20540;&#35299;&#19982;&#36830;&#32493;&#35299;&#30340;&#25910;&#25947;&#24615;&#65292;&#24182;&#36890;&#36807;&#22810;&#20010;&#31034;&#20363;&#39564;&#35777;&#20102;&#26041;&#27861;&#30340;&#20934;&#30830;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#25551;&#36848;&#23454;&#29289;&#36164;&#26412;&#8220;k&#8221;&#21644;&#25216;&#26415;&#36827;&#27493;&#8220;A&#8221;&#28436;&#21270;&#36807;&#31243;&#30340;&#25243;&#29289;&#22411;ODE PDE&#31995;&#32479;&#65292;&#22312;&#19968;&#32500;&#21644;&#20108;&#32500;&#26377;&#30028;&#21306;&#22495;&#19978;&#20351;&#29992;&#26080;&#32593;&#26684;&#26041;&#27861;&#12290;&#36890;&#36807;&#32771;&#34385;&#36164;&#26412;&#21644;&#25216;&#26415;&#30340;&#31354;&#38388;&#25193;&#25955;&#26469;&#25193;&#23637;&#33879;&#21517;&#30340;Solow&#27169;&#22411;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36824;&#30740;&#31350;&#20102;&#25216;&#26415;&#36827;&#27493;&#27809;&#26377;&#31354;&#38388;&#25193;&#25955;&#30340;&#24773;&#20917;&#12290;&#23545;&#20110;&#36825;&#20123;&#27169;&#22411;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#22522;&#20110;&#24191;&#20041;&#26377;&#38480;&#24046;&#20998;&#26041;&#27861;&#30340;&#26041;&#26696;&#65292;&#24182;&#35777;&#26126;&#20102;&#25968;&#20540;&#35299;&#25910;&#25947;&#21040;&#36830;&#32493;&#35299;&#12290;&#22810;&#20010;&#31034;&#20363;&#23637;&#31034;&#20102;&#27169;&#22411;&#22312;&#24191;&#27867;&#21442;&#25968;&#33539;&#22260;&#20869;&#30340;&#21160;&#24577;&#29305;&#24615;&#65292;&#24182;&#39564;&#35777;&#20102;&#25968;&#20540;&#26041;&#27861;&#30340;&#20934;&#30830;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
This work studies a parabolic-ODE PDE's system which describes the evolution of the physical capital "$k$" and technological progress "$A$", using a meshless in one and two dimensional bounded domain with regular boundary. The well-known Solow model is extended by considering the spatial diffusion of both capital anf technology. Moreover, we study the case in which no spatial diffusion of the technology progress occurs. For such models, we propound schemes based on the Generalized Finite Difference method and proof the convergence of the numerical solution to the continuous one. Several examples show the dynamics of the model for a wide range of parameters. These examples illustrate the accuary of the numerical method.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#36890;&#36807;&#23545;&#33258;&#22238;&#24402;&#36816;&#21160;&#30340;&#35299;&#36827;&#34892;&#20998;&#26512;&#65292;&#25552;&#20379;&#20102;&#19968;&#20010;&#23436;&#25972;&#30340;&#25551;&#36848;&#65292;&#24182;&#32473;&#20986;&#20102;&#35299;&#30340;&#20998;&#35299;&#26041;&#24335;&#21644;&#21442;&#25968;&#21270;&#26041;&#27861;&#12290;</title><link>https://arxiv.org/abs/2402.01966</link><description>&lt;p&gt;
&#33258;&#22238;&#24402;&#36816;&#21160;&#30340;&#19968;&#33324;&#35299;&#20915;&#26041;&#26696;
&lt;/p&gt;
&lt;p&gt;
The general solution to an autoregressive law of motion
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.01966
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36890;&#36807;&#23545;&#33258;&#22238;&#24402;&#36816;&#21160;&#30340;&#35299;&#36827;&#34892;&#20998;&#26512;&#65292;&#25552;&#20379;&#20102;&#19968;&#20010;&#23436;&#25972;&#30340;&#25551;&#36848;&#65292;&#24182;&#32473;&#20986;&#20102;&#35299;&#30340;&#20998;&#35299;&#26041;&#24335;&#21644;&#21442;&#25968;&#21270;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20379;&#20102;&#19968;&#20010;&#26377;&#38480;&#32500;&#22797;&#21521;&#37327;&#31354;&#38388;&#20013;&#33258;&#22238;&#24402;&#36816;&#21160;&#30340;&#20840;&#37096;&#35299;&#30340;&#23436;&#25972;&#25551;&#36848;&#12290;&#25105;&#20204;&#35777;&#26126;&#27599;&#20010;&#35299;&#37117;&#21487;&#20197;&#20998;&#35299;&#20026;&#19977;&#20010;&#37096;&#20998;&#65292;&#20998;&#21035;&#23545;&#24212;&#20110;&#26102;&#38388;&#30340;&#27491;&#21521;&#27969;&#21160;&#12289;&#36127;&#21521;&#27969;&#21160;&#21644;&#20174;&#26102;&#38388;&#38646;&#24320;&#22987;&#30340;&#22806;&#21521;&#27969;&#21160;&#12290;&#36825;&#19977;&#20010;&#37096;&#20998;&#26159;&#36890;&#36807;&#23558;&#35299;&#24212;&#29992;&#19977;&#20010;&#20114;&#34917;&#30340;&#35889;&#25237;&#24433;&#33719;&#24471;&#30340;&#65292;&#36825;&#20123;&#35889;&#25237;&#24433;&#26681;&#25454;&#33258;&#22238;&#24402;&#31639;&#23376;&#30340;&#29305;&#24449;&#20540;&#26159;&#22312;&#12289;&#22806;&#25110;&#32773;&#22312;&#21333;&#20301;&#22278;&#19978;&#23558;&#20854;&#20998;&#31163;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#23545;&#25152;&#26377;&#35299;&#30340;&#26377;&#38480;&#32500;&#21442;&#25968;&#21270;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this article we provide a complete description of the set of all solutions to an autoregressive law of motion in a finite-dimensional complex vector space. Every solution is shown to be the sum of three parts, each corresponding to a directed flow of time. One part flows forward from the arbitrarily distant past; one flows backward from the arbitrarily distant future; and one flows outward from time zero. The three parts are obtained by applying three complementary spectral projections to the solution, these corresponding to a separation of the eigenvalues of the autoregressive operator according to whether they are inside, outside or on the unit circle. We provide a finite-dimensional parametrization of the set of all solutions.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#25918;&#23485;&#25237;&#36164;&#32452;&#21512;&#31232;&#30095;&#32422;&#26463;&#23545;&#20110;&#39118;&#38505;&#21388;&#24694;&#30340;&#25237;&#36164;&#32773;&#26469;&#35828;&#26159;&#21542;&#26377;&#21033;&#12290;&#36890;&#36807;&#26032;&#30340;&#31232;&#30095;&#20108;&#38454;&#38543;&#26426;&#36328;&#24230;&#20272;&#35745;&#36807;&#31243;&#65292;&#25105;&#20204;&#21457;&#29616;&#23558;&#31232;&#30095;&#26426;&#20250;&#38598;&#25193;&#23637;&#21040;45&#20010;&#36164;&#20135;&#20197;&#19978;&#27809;&#26377;&#22909;&#22788;&#12290;&#26368;&#20339;&#30340;&#31232;&#30095;&#32452;&#21512;&#25237;&#36164;&#20110;10&#20010;&#34892;&#19994;&#37096;&#38376;&#65292;&#22312;&#21361;&#26426;&#26102;&#26399;&#36164;&#20135;&#25968;&#37327;&#20943;&#23569;&#21040;25&#20010;&#65292;&#24182;&#21066;&#20943;&#23614;&#37096;&#39118;&#38505;&#12290;</title><link>https://arxiv.org/abs/2402.01951</link><description>&lt;p&gt;
&#31232;&#30095;&#36328;&#24230;&#32452;&#21512;&#19982;&#20108;&#38454;&#38543;&#26426;&#20248;&#21183;&#19979;&#30340;&#38750;&#22810;&#26679;&#21270;&#38382;&#39064;
&lt;/p&gt;
&lt;p&gt;
Sparse spanning portfolios and under-diversification with second-order stochastic dominance
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.01951
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#25918;&#23485;&#25237;&#36164;&#32452;&#21512;&#31232;&#30095;&#32422;&#26463;&#23545;&#20110;&#39118;&#38505;&#21388;&#24694;&#30340;&#25237;&#36164;&#32773;&#26469;&#35828;&#26159;&#21542;&#26377;&#21033;&#12290;&#36890;&#36807;&#26032;&#30340;&#31232;&#30095;&#20108;&#38454;&#38543;&#26426;&#36328;&#24230;&#20272;&#35745;&#36807;&#31243;&#65292;&#25105;&#20204;&#21457;&#29616;&#23558;&#31232;&#30095;&#26426;&#20250;&#38598;&#25193;&#23637;&#21040;45&#20010;&#36164;&#20135;&#20197;&#19978;&#27809;&#26377;&#22909;&#22788;&#12290;&#26368;&#20339;&#30340;&#31232;&#30095;&#32452;&#21512;&#25237;&#36164;&#20110;10&#20010;&#34892;&#19994;&#37096;&#38376;&#65292;&#22312;&#21361;&#26426;&#26102;&#26399;&#36164;&#20135;&#25968;&#37327;&#20943;&#23569;&#21040;25&#20010;&#65292;&#24182;&#21066;&#20943;&#23614;&#37096;&#39118;&#38505;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#24320;&#21457;&#24182;&#23454;&#26045;&#20102;&#30830;&#23450;&#22312;&#25237;&#36164;&#26426;&#20250;&#38598;&#20013;&#26159;&#21542;&#25918;&#23485;&#32452;&#21512;&#30340;&#31232;&#30095;&#32422;&#26463;&#23545;&#20110;&#39118;&#38505;&#21388;&#24694;&#30340;&#25237;&#36164;&#32773;&#26469;&#35828;&#26159;&#21542;&#26377;&#21033;&#30340;&#26041;&#27861;&#12290;&#25105;&#20204;&#22522;&#20110;&#36138;&#23146;&#31639;&#27861;&#21644;&#32447;&#24615;&#35268;&#21010;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#31232;&#30095;&#20108;&#38454;&#38543;&#26426;&#36328;&#24230;&#20272;&#35745;&#36807;&#31243;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#26080;&#35770;&#26159;&#21542;&#23384;&#22312;&#36328;&#24230;&#65292;&#31232;&#30095;&#35299;&#30340;&#26368;&#20339;&#24674;&#22797;&#22312;&#28176;&#36817;&#24847;&#20041;&#19979;&#25104;&#31435;&#12290;&#20174;&#22823;&#22411;&#32929;&#26435;&#25968;&#25454;&#38598;&#20013;&#65292;&#25105;&#20204;&#20272;&#35745;&#20102;&#21487;&#33021;&#30340;&#38750;&#22810;&#26679;&#21270;&#23548;&#33268;&#30340;&#39044;&#26399;&#25928;&#29992;&#25439;&#22833;&#65292;&#24182;&#21457;&#29616;&#23558;&#31232;&#30095;&#26426;&#20250;&#38598;&#25193;&#23637;&#21040;45&#20010;&#36164;&#20135;&#20197;&#19978;&#27809;&#26377;&#22909;&#22788;&#12290;&#26368;&#20339;&#30340;&#31232;&#30095;&#32452;&#21512;&#25237;&#36164;&#20110;10&#20010;&#34892;&#19994;&#37096;&#38376;&#65292;&#22312;&#19982;&#31232;&#30095;&#22343;&#20540;&#26041;&#24046;&#32452;&#21512;&#27604;&#36739;&#26102;&#21487;&#20197;&#21066;&#20943;&#23614;&#37096;&#39118;&#38505;&#12290;&#22312;&#28378;&#21160;&#31383;&#21475;&#22522;&#30784;&#19978;&#65292;&#36164;&#20135;&#25968;&#37327;&#22312;&#21361;&#26426;&#26102;&#26399;&#20943;&#23569;&#21040;25&#20010;&#65292;&#32780;&#26631;&#20934;&#30340;&#22240;&#23376;&#27169;&#22411;&#26080;&#27861;&#35299;&#37322;&#31232;&#30095;&#32452;&#21512;&#30340;&#34920;&#29616;&#12290;
&lt;/p&gt;
&lt;p&gt;
We develop and implement methods for determining whether relaxing sparsity con- straints on portfolios improves the investment opportunity set for risk-averse investors. We formulate a new estimation procedure for sparse second-order stochastic spanning based on a greedy algorithm and Linear Programming. We show the optimal recovery of the sparse solution asymptotically whether spanning holds or not. From large equity datasets, we estimate the expected utility loss due to possible under-diversification, and find that there is no benefit from expanding a sparse opportunity set beyond 45 assets. The optimal sparse portfolio invests in 10 industry sectors and cuts tail risk when compared to a sparse mean-variance portfolio. On a rolling-window basis, the number of assets shrinks to 25 assets in crisis periods, while standard factor models cannot explain the performance of the sparse portfolios.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25512;&#23548;&#20102;&#26410;&#26469;&#28040;&#36153;&#21697;&#20056;&#25968;&#29616;&#20540;&#30340;&#20844;&#24335;&#65292;&#24182;&#21033;&#29992;&#35813;&#20056;&#25968;&#26500;&#24314;&#20102;&#19968;&#20010;&#23439;&#35266;&#32463;&#27982;&#30340;&#36164;&#26412;&#24066;&#22330;&#21160;&#24577;&#27169;&#22411;&#65292;&#35813;&#27169;&#22411;&#23545;&#28040;&#36153;&#21697;&#29983;&#20135;&#21644;&#29983;&#20135;&#25163;&#27573;&#29983;&#20135;&#30340;&#25237;&#36164;&#20221;&#39069;&#21160;&#24577;&#25552;&#20379;&#20102;&#39069;&#22806;&#30340;&#39044;&#27979;&#12290;</title><link>https://arxiv.org/abs/2402.01938</link><description>&lt;p&gt;
&#26410;&#26469;&#28040;&#36153;&#21697;&#20056;&#25968;&#30340;&#29616;&#20540;
&lt;/p&gt;
&lt;p&gt;
Present Value of the Future Consumer Goods Multiplier
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.01938
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25512;&#23548;&#20102;&#26410;&#26469;&#28040;&#36153;&#21697;&#20056;&#25968;&#29616;&#20540;&#30340;&#20844;&#24335;&#65292;&#24182;&#21033;&#29992;&#35813;&#20056;&#25968;&#26500;&#24314;&#20102;&#19968;&#20010;&#23439;&#35266;&#32463;&#27982;&#30340;&#36164;&#26412;&#24066;&#22330;&#21160;&#24577;&#27169;&#22411;&#65292;&#35813;&#27169;&#22411;&#23545;&#28040;&#36153;&#21697;&#29983;&#20135;&#21644;&#29983;&#20135;&#25163;&#27573;&#29983;&#20135;&#30340;&#25237;&#36164;&#20221;&#39069;&#21160;&#24577;&#25552;&#20379;&#20102;&#39069;&#22806;&#30340;&#39044;&#27979;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#22522;&#20110;&#39044;&#26399;&#22312;&#28040;&#36153;&#21697;&#29983;&#20135;&#20013;&#25237;&#36164;&#20221;&#39069;&#19981;&#21464;&#30340;&#20551;&#35774;&#65292;&#25512;&#23548;&#20986;&#20102;&#26410;&#26469;&#28040;&#36153;&#21697;&#20056;&#25968;&#29616;&#20540;&#30340;&#20844;&#24335;&#12290;&#29616;&#20540;&#21576;&#26080;&#38480;&#20960;&#20309;&#24207;&#21015;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#20056;&#25968;&#27010;&#24565;&#22914;&#20309;&#24110;&#21161;&#25105;&#20204;&#36827;&#34892;&#23439;&#35266;&#32463;&#27982;&#20998;&#26512;&#65292;&#20197;&#21450;&#29702;&#35299;&#36164;&#26412;&#21644;&#25237;&#36164;&#21160;&#24577;&#30340;&#19968;&#20123;&#22522;&#26412;&#21407;&#29702;&#21644;&#36164;&#26412;&#24066;&#22330;&#22343;&#34913;&#12290;&#21033;&#29992;&#36825;&#20010;&#20056;&#25968;&#30340;&#27010;&#24565;&#65292;&#25105;&#20204;&#26500;&#24314;&#20102;&#19968;&#20010;&#23439;&#35266;&#32463;&#27982;&#30340;&#36164;&#26412;&#24066;&#22330;&#21160;&#24577;&#27169;&#22411;&#65292;&#23427;&#19982;&#32463;&#20856;&#27169;&#22411;&#30340;&#21547;&#20041;&#21644;&#24066;&#22330;&#22343;&#34913;&#26465;&#20214;&#19968;&#33268;&#65292;&#20294;&#22312;&#28040;&#36153;&#21697;&#29983;&#20135;&#21644;&#29983;&#20135;&#25163;&#27573;&#29983;&#20135;&#30340;&#25237;&#36164;&#20221;&#39069;&#21160;&#24577;&#26041;&#38754;&#25552;&#20379;&#20102;&#39069;&#22806;&#30340;&#23450;&#37327;&#21644;&#23450;&#24615;&#39044;&#27979;&#12290;&#25237;&#36164;&#37327;&#34987;&#24314;&#27169;&#20026;&#20056;&#25968;&#30340;&#20989;&#25968;&#65306;&#24403;&#20056;&#25968;&#30340;&#20540;&#22260;&#32469;i&#27874;&#21160;&#26102;&#65292;&#25237;&#36164;&#23558;&#36827;&#34892;&#35843;&#25972;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this paper, we derive a formula for the present value of future consumer goods multiplier based on the assumption that a constant share of investment in the production of consumer goods is expected. The present value appears to be an infinite geometric sequence. Moreover, we investigate how the notion of the multiplier can help us in macroeconomic analysis of capital and investment dynamics and in understanding some general principles of capital market equilibrium. Using the concept of this multiplier, we build a macroeconomic model of capital market dynamics which is consistent with the implications of classical models and with the market equilibrium condition but gives additional quantitative and qualitative predictions regarding the dynamics of shares of investment into the production of consumer goods and the production of means of production. The investment volume is modeled as a function of the multiplier: investments adjust when the value of the multiplier fluctuates around i
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#27169;&#22411;&#65292;&#38416;&#26126;&#20102;&#32654;&#22909;&#24187;&#24819;&#34892;&#20026;&#30340;&#26412;&#36136;&#20197;&#21450;&#20559;&#35265;&#20449;&#24565;&#25152;&#24102;&#26469;&#30340;&#25104;&#26412;&#21644;&#25910;&#30410;&#12290;&#36890;&#36807;&#36229;&#22411;&#25928;&#29992;&#26368;&#22823;&#21270;&#65292;&#25581;&#31034;&#20102;&#20048;&#35266;&#30340;&#20915;&#31574;&#32773;&#20559;&#22909;&#20110;&#20855;&#26377;&#27491;&#20559;&#24577;&#21644;&#22686;&#21152;&#39118;&#38505;&#29305;&#24449;&#30340;&#36873;&#25321;&#12290;</title><link>https://arxiv.org/abs/2402.01892</link><description>&lt;p&gt;
&#34987;&#23457;&#26597;&#30340;&#20449;&#20208;&#19982;&#32654;&#22909;&#24187;&#24819;
&lt;/p&gt;
&lt;p&gt;
Censored Beliefs and Wishful Thinking
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.01892
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#27169;&#22411;&#65292;&#38416;&#26126;&#20102;&#32654;&#22909;&#24187;&#24819;&#34892;&#20026;&#30340;&#26412;&#36136;&#20197;&#21450;&#20559;&#35265;&#20449;&#24565;&#25152;&#24102;&#26469;&#30340;&#25104;&#26412;&#21644;&#25910;&#30410;&#12290;&#36890;&#36807;&#36229;&#22411;&#25928;&#29992;&#26368;&#22823;&#21270;&#65292;&#25581;&#31034;&#20102;&#20048;&#35266;&#30340;&#20915;&#31574;&#32773;&#20559;&#22909;&#20110;&#20855;&#26377;&#27491;&#20559;&#24577;&#21644;&#22686;&#21152;&#39118;&#38505;&#29305;&#24449;&#30340;&#36873;&#25321;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#27169;&#22411;&#65292;&#38416;&#26126;&#20102;&#32654;&#22909;&#24187;&#24819;&#30340;&#26412;&#36136;&#65292;&#32508;&#21512;&#32771;&#34385;&#20102;&#20559;&#35265;&#20449;&#24565;&#25152;&#24102;&#26469;&#30340;&#25104;&#26412;&#21644;&#25910;&#30410;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;&#32654;&#22909;&#24187;&#24819;&#34892;&#20026;&#21487;&#20197;&#20934;&#30830;&#22320;&#25551;&#36848;&#20026;&#22312;&#20559;&#35265;&#20449;&#24565;&#25197;&#26354;&#25104;&#26412;&#20989;&#25968;&#39046;&#22495;&#20869;&#36827;&#34892;&#36229;&#22411;&#25928;&#29992;&#26368;&#22823;&#21270;&#12290;&#36890;&#36807;&#21033;&#29992;&#36825;&#31181;&#31561;&#20215;&#24615;&#65292;&#25105;&#20204;&#24471;&#20986;&#20102;&#24403;&#19968;&#20010;&#20048;&#35266;&#30340;&#20915;&#31574;&#32773;&#20559;&#22909;&#20110;&#20855;&#26377;&#27491;&#20559;&#24577;&#21644;&#22686;&#21152;&#39118;&#38505;&#29305;&#24449;&#30340;&#36873;&#25321;&#30340;&#26465;&#20214;&#12290;
&lt;/p&gt;
&lt;p&gt;
We present a model elucidating wishful thinking, which comprehensively incorporates both the costs and benefits associated with biased beliefs. Our findings reveal that wishful thinking behavior can be accurately characterized as equivalent to superquantile-utility maximization within the domain of threshold beliefs distortion cost functions. By leveraging this equivalence, we establish conditions that elucidate when an optimistic decision-maker exhibits a preference for choices characterized by positive skewness and increased risk.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#21033;&#29992;&#25991;&#26412;&#21644;&#22270;&#20687;&#22312;&#22240;&#26524;&#25512;&#26029;&#21644;&#27835;&#30103;&#25928;&#24212;&#20272;&#35745;&#20013;&#30340;&#21452;&#26426;&#22120;&#23398;&#20064;&#26694;&#26550;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#29983;&#25104;&#21322;&#21512;&#25104;&#25968;&#25454;&#38598;&#30340;&#26041;&#27861;&#29992;&#20110;&#35780;&#20272;&#22240;&#26524;&#25928;&#24212;&#20272;&#35745;&#30340;&#24615;&#33021;&#12290;&#36825;&#20123;&#26041;&#27861;&#21644;&#26550;&#26500;&#22312;&#21322;&#21512;&#25104;&#25968;&#25454;&#38598;&#19978;&#36827;&#34892;&#20102;&#35780;&#20272;&#65292;&#24182;&#19982;&#26631;&#20934;&#26041;&#27861;&#36827;&#34892;&#20102;&#27604;&#36739;&#65292;&#26174;&#31034;&#20102;&#30452;&#25509;&#20351;&#29992;&#25991;&#26412;&#21644;&#22270;&#20687;&#36827;&#34892;&#22240;&#26524;&#30740;&#31350;&#30340;&#28508;&#22312;&#22909;&#22788;&#12290;</title><link>https://arxiv.org/abs/2402.01785</link><description>&lt;p&gt;
DoubleMLDeep: &#21033;&#29992;&#22810;&#27169;&#24577;&#25968;&#25454;&#23545;&#22240;&#26524;&#25928;&#24212;&#36827;&#34892;&#20272;&#35745;
&lt;/p&gt;
&lt;p&gt;
DoubleMLDeep: Estimation of Causal Effects with Multimodal Data
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.01785
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#21033;&#29992;&#25991;&#26412;&#21644;&#22270;&#20687;&#22312;&#22240;&#26524;&#25512;&#26029;&#21644;&#27835;&#30103;&#25928;&#24212;&#20272;&#35745;&#20013;&#30340;&#21452;&#26426;&#22120;&#23398;&#20064;&#26694;&#26550;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#29983;&#25104;&#21322;&#21512;&#25104;&#25968;&#25454;&#38598;&#30340;&#26041;&#27861;&#29992;&#20110;&#35780;&#20272;&#22240;&#26524;&#25928;&#24212;&#20272;&#35745;&#30340;&#24615;&#33021;&#12290;&#36825;&#20123;&#26041;&#27861;&#21644;&#26550;&#26500;&#22312;&#21322;&#21512;&#25104;&#25968;&#25454;&#38598;&#19978;&#36827;&#34892;&#20102;&#35780;&#20272;&#65292;&#24182;&#19982;&#26631;&#20934;&#26041;&#27861;&#36827;&#34892;&#20102;&#27604;&#36739;&#65292;&#26174;&#31034;&#20102;&#30452;&#25509;&#20351;&#29992;&#25991;&#26412;&#21644;&#22270;&#20687;&#36827;&#34892;&#22240;&#26524;&#30740;&#31350;&#30340;&#28508;&#22312;&#22909;&#22788;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25506;&#35752;&#20102;&#22312;&#22240;&#26524;&#25512;&#26029;&#21644;&#27835;&#30103;&#25928;&#24212;&#20272;&#35745;&#20013;&#20351;&#29992;&#38750;&#32467;&#26500;&#21270;&#30340;&#22810;&#27169;&#24577;&#25968;&#25454;&#65292;&#21363;&#25991;&#26412;&#21644;&#22270;&#20687;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#36866;&#24212;&#20110;&#21452;&#26426;&#22120;&#23398;&#20064;&#65288;DML&#65289;&#26694;&#26550;&#65292;&#29305;&#21035;&#26159;&#37096;&#20998;&#32447;&#24615;&#27169;&#22411;&#30340;&#31070;&#32463;&#32593;&#32476;&#26550;&#26500;&#12290;&#25105;&#20204;&#35770;&#25991;&#30340;&#21478;&#19968;&#20010;&#36129;&#29486;&#26159;&#25552;&#20986;&#20102;&#19968;&#31181;&#29983;&#25104;&#21322;&#21512;&#25104;&#25968;&#25454;&#38598;&#30340;&#26032;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#21487;&#29992;&#20110;&#35780;&#20272;&#22312;&#25991;&#26412;&#21644;&#22270;&#20687;&#20316;&#20026;&#28151;&#28102;&#22240;&#32032;&#30340;&#24773;&#20917;&#19979;&#22240;&#26524;&#25928;&#24212;&#20272;&#35745;&#30340;&#24615;&#33021;&#12290;&#25105;&#20204;&#22312;&#21322;&#21512;&#25104;&#25968;&#25454;&#38598;&#19978;&#35780;&#20272;&#24182;&#19982;&#26631;&#20934;&#26041;&#27861;&#36827;&#34892;&#27604;&#36739;&#65292;&#31361;&#20986;&#20102;&#30452;&#25509;&#22312;&#22240;&#26524;&#30740;&#31350;&#20013;&#20351;&#29992;&#25991;&#26412;&#21644;&#22270;&#20687;&#30340;&#28508;&#22312;&#22909;&#22788;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#32467;&#26524;&#23545;&#32463;&#27982;&#23398;&#12289;&#24066;&#22330;&#33829;&#38144;&#12289;&#37329;&#34701;&#12289;&#21307;&#23398;&#21644;&#25968;&#25454;&#31185;&#23398;&#31561;&#39046;&#22495;&#30340;&#30740;&#31350;&#20154;&#21592;&#21644;&#20174;&#19994;&#32773;&#20855;&#26377;&#37325;&#35201;&#24847;&#20041;&#65292;&#20182;&#20204;&#24076;&#26395;&#20351;&#29992;&#38750;&#20256;&#32479;&#25968;&#25454;&#20272;&#35745;&#22240;&#26524;&#25968;&#37327;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper explores the use of unstructured, multimodal data, namely text and images, in causal inference and treatment effect estimation. We propose a neural network architecture that is adapted to the double machine learning (DML) framework, specifically the partially linear model. An additional contribution of our paper is a new method to generate a semi-synthetic dataset which can be used to evaluate the performance of causal effect estimation in the presence of text and images as confounders. The proposed methods and architectures are evaluated on the semi-synthetic dataset and compared to standard approaches, highlighting the potential benefit of using text and images directly in causal studies. Our findings have implications for researchers and practitioners in economics, marketing, finance, medicine and data science in general who are interested in estimating causal quantities using non-traditional data.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#37319;&#29992;&#22810;&#23618;&#27425;&#20465;&#20048;&#37096;&#25910;&#25947;&#26041;&#27861;&#30740;&#31350;&#27431;&#30431;28&#20010;&#25104;&#21592;&#22269;&#30340;&#28201;&#23460;&#27668;&#20307;&#25490;&#25918;&#24773;&#20917;&#65292;&#21457;&#29616;&#24635;&#20307;&#25910;&#25947;&#34987;&#25298;&#32477;&#65292;&#20294;&#26377;&#19968;&#20123;&#22269;&#23478;&#22312;&#25490;&#25918;&#20943;&#23569;&#36895;&#24230;&#26041;&#38754;&#34920;&#29616;&#20986;&#33394;&#12290;</title><link>https://arxiv.org/abs/2402.01784</link><description>&lt;p&gt;
&#27431;&#30431;28&#20010;&#25104;&#21592;&#22269;&#30340;&#28201;&#23460;&#27668;&#20307;&#25490;&#25918;&#12290;&#20851;&#20110;&#25490;&#25918;&#20132;&#26131;&#31995;&#32479;&#21644;&#21162;&#21147;&#20998;&#25285;&#20915;&#31574;&#26426;&#21046;&#30340;&#22810;&#23618;&#27425;&#20465;&#20048;&#37096;&#25910;&#25947;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
GHG emissions in the EU-28. A multilevel club convergence study of the Emission Trading System and Effort Sharing Decision mechanisms
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.01784
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#37319;&#29992;&#22810;&#23618;&#27425;&#20465;&#20048;&#37096;&#25910;&#25947;&#26041;&#27861;&#30740;&#31350;&#27431;&#30431;28&#20010;&#25104;&#21592;&#22269;&#30340;&#28201;&#23460;&#27668;&#20307;&#25490;&#25918;&#24773;&#20917;&#65292;&#21457;&#29616;&#24635;&#20307;&#25910;&#25947;&#34987;&#25298;&#32477;&#65292;&#20294;&#26377;&#19968;&#20123;&#22269;&#23478;&#22312;&#25490;&#25918;&#20943;&#23569;&#36895;&#24230;&#26041;&#38754;&#34920;&#29616;&#20986;&#33394;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#27431;&#30431;&#33268;&#21147;&#20110;&#24212;&#23545;&#27668;&#20505;&#21464;&#21270;&#12290;&#24378;&#21046;&#25191;&#34892;&#20849;&#21516;&#30340;&#29615;&#22659;&#20934;&#21017;&#30340;&#20851;&#38190;&#38382;&#39064;&#26159;&#29615;&#22659;&#25910;&#25947;&#12290;&#29615;&#22659;&#21464;&#37327;&#25910;&#25947;&#30340;&#22269;&#23478;&#39044;&#35745;&#33021;&#22815;&#20849;&#21516;&#21046;&#23450;&#21644;&#23454;&#26045;&#29615;&#22659;&#25919;&#31574;&#12290;&#29615;&#22659;&#25351;&#26631;&#30340;&#25910;&#25947;&#36824;&#26377;&#21161;&#20110;&#30830;&#23450;&#36825;&#20123;&#25919;&#31574;&#30340;&#25928;&#29575;&#21644;&#36895;&#24230;&#12290;&#26412;&#25991;&#37319;&#29992;&#22810;&#23618;&#27425;&#20465;&#20048;&#37096;&#25910;&#25947;&#26041;&#27861;&#65292;&#20998;&#26512;&#27431;&#30431;28&#20010;&#25104;&#21592;&#22269;&#28201;&#23460;&#27668;&#20307;&#25490;&#25918;&#30340;&#25910;&#25947;&#24773;&#20917;&#65292;&#23547;&#25214;&#36807;&#28193;&#20174;&#19981;&#24179;&#34913;&#21040;&#29305;&#23450;&#31283;&#24577;&#20301;&#32622;&#30340;&#22269;&#23478;&#12290;&#24635;&#20307;&#25910;&#25947;&#34987;&#25298;&#32477;&#65292;&#20465;&#20048;&#37096;&#30340;&#26500;&#25104;&#21462;&#20915;&#20110;&#29305;&#23450;&#26102;&#26399;&#65288;1990-2017&#65292;2005-2017&#65289;&#21644;&#20998;&#26512;&#30340;&#25490;&#25918;&#31867;&#21035;&#65288;&#20840;&#29699;&#65292;ETS&#65292;ESD&#65289;&#12290;&#19968;&#20123;&#22269;&#23478;&#65288;&#22914;&#33521;&#22269;&#21644;&#20025;&#40614;&#65289;&#22312;&#25972;&#20010;&#21644;&#26368;&#36817;&#26102;&#26399;&#30340;&#25490;&#25918;&#20943;&#23569;&#36895;&#24230;&#26041;&#38754;&#22987;&#32456;&#36229;&#36807;&#27431;&#30431;&#24179;&#22343;&#27700;&#24179;&#30340;&#20465;&#20048;&#37096;&#20013;&#12290;
&lt;/p&gt;
&lt;p&gt;
The European Union is engaged in the fight against climate change. A crucial issue to enforce common environmental guidelines is environmental convergence. States converging in environmental variables are expected to be able to jointly develop and implement environmental policies. Convergence in environmental indicators may also help determine the efficiency and speed of those policies. This paper employs a multilevel club convergence approach to analyze convergence in the evolution of GHG emissions among the EU-28 members, on a search for countries transitioning from disequilibrium to specific steady-state positions. Overall convergence is rejected, with club composition depending on the specific period (1990-2017, 2005-2017) and emissions categories (global, ETS, ESD) analyzed. Some countries (e.g. the United Kingdom and Denmark) are consistently located in clubs outperforming the EU's average in terms of speed of emissions reductions, for both the whole and the most recent periods, 
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLMs&#65289;&#65292;&#29305;&#21035;&#26159;OpenAI&#30340;GPT4&#21644;LLaMA2&#30340;&#25237;&#31080;&#34892;&#20026;&#65292;&#24182;&#25581;&#31034;&#20102;LLMs&#19982;&#20154;&#31867;&#22312;&#20915;&#31574;&#21644;&#20559;&#35265;&#26041;&#38754;&#30340;&#24046;&#24322;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#22312;&#25237;&#31080;&#36741;&#21161;&#20013;&#20351;&#29992;LLMs&#21487;&#33021;&#20250;&#23548;&#33268;&#26356;&#21516;&#36136;&#21270;&#30340;&#38598;&#20307;&#32467;&#26524;&#65292;&#24378;&#35843;&#20102;&#35880;&#24910;&#23558;LLMs&#25972;&#21512;&#21040;&#27665;&#20027;&#36807;&#31243;&#20013;&#30340;&#24517;&#35201;&#24615;&#12290;</title><link>https://arxiv.org/abs/2402.01766</link><description>&lt;p&gt;
LLM&#25237;&#31080;&#65306;&#20154;&#31867;&#36873;&#25321;&#21644;AI&#38598;&#20307;&#20915;&#31574;
&lt;/p&gt;
&lt;p&gt;
LLM Voting: Human Choices and AI Collective Decision Making
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.01766
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLMs&#65289;&#65292;&#29305;&#21035;&#26159;OpenAI&#30340;GPT4&#21644;LLaMA2&#30340;&#25237;&#31080;&#34892;&#20026;&#65292;&#24182;&#25581;&#31034;&#20102;LLMs&#19982;&#20154;&#31867;&#22312;&#20915;&#31574;&#21644;&#20559;&#35265;&#26041;&#38754;&#30340;&#24046;&#24322;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#22312;&#25237;&#31080;&#36741;&#21161;&#20013;&#20351;&#29992;LLMs&#21487;&#33021;&#20250;&#23548;&#33268;&#26356;&#21516;&#36136;&#21270;&#30340;&#38598;&#20307;&#32467;&#26524;&#65292;&#24378;&#35843;&#20102;&#35880;&#24910;&#23558;LLMs&#25972;&#21512;&#21040;&#27665;&#20027;&#36807;&#31243;&#20013;&#30340;&#24517;&#35201;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLMs&#65289;&#65292;&#29305;&#21035;&#26159;OpenAI&#30340;GPT4&#21644;LLaMA2&#30340;&#25237;&#31080;&#34892;&#20026;&#65292;&#24182;&#19982;&#20154;&#31867;&#25237;&#31080;&#27169;&#24335;&#36827;&#34892;&#20102;&#23545;&#27604;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#21253;&#25324;&#36827;&#34892;&#20154;&#31867;&#25237;&#31080;&#23454;&#39564;&#20197;&#24314;&#31435;&#20154;&#31867;&#20559;&#22909;&#30340;&#22522;&#20934;&#65292;&#24182;&#19982;LLM&#20195;&#29702;&#36827;&#34892;&#24179;&#34892;&#23454;&#39564;&#12290;&#30740;&#31350;&#32858;&#28966;&#20110;&#38598;&#20307;&#32467;&#26524;&#21644;&#20010;&#20307;&#20559;&#22909;&#65292;&#25581;&#31034;&#20102;&#20154;&#31867;&#21644;LLMs&#20043;&#38388;&#22312;&#20915;&#31574;&#21644;&#22266;&#26377;&#20559;&#35265;&#26041;&#38754;&#30340;&#24046;&#24322;&#12290;&#25105;&#20204;&#35266;&#23519;&#21040;LLMs&#22312;&#20559;&#22909;&#22810;&#26679;&#24615;&#21644;&#19968;&#33268;&#24615;&#20043;&#38388;&#23384;&#22312;&#26435;&#34913;&#65292;&#30456;&#27604;&#20154;&#31867;&#36873;&#27665;&#30340;&#22810;&#26679;&#20559;&#22909;&#65292;LLMs&#26377;&#26356;&#36235;&#21521;&#20110;&#19968;&#33268;&#36873;&#25321;&#30340;&#20542;&#21521;&#12290;&#36825;&#19968;&#21457;&#29616;&#34920;&#26126;&#65292;&#22312;&#25237;&#31080;&#36741;&#21161;&#20013;&#20351;&#29992;LLMs&#21487;&#33021;&#20250;&#23548;&#33268;&#26356;&#21516;&#36136;&#21270;&#30340;&#38598;&#20307;&#32467;&#26524;&#65292;&#24378;&#35843;&#20102;&#35880;&#24910;&#23558;LLMs&#25972;&#21512;&#21040;&#27665;&#20027;&#36807;&#31243;&#20013;&#30340;&#24517;&#35201;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper investigates the voting behaviors of Large Language Models (LLMs), particularly OpenAI's GPT4 and LLaMA2, and their alignment with human voting patterns. Our approach included a human voting experiment to establish a baseline for human preferences and a parallel experiment with LLM agents. The study focused on both collective outcomes and individual preferences, revealing differences in decision-making and inherent biases between humans and LLMs. We observed a trade-off between preference diversity and alignment in LLMs, with a tendency towards more uniform choices as compared to the diverse preferences of human voters. This finding indicates that LLMs could lead to more homogenized collective outcomes when used in voting assistance, underscoring the need for cautious integration of LLMs into democratic processes.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#20998;&#26512;&#20102;&#30740;&#31350;&#20154;&#21592;&#25552;&#20132;&#35770;&#25991;&#32473;&#19981;&#21516;&#36136;&#37327;&#30340;&#26399;&#21002;&#30340;&#26368;&#20339;&#39034;&#24207;&#38382;&#39064;&#65292;&#21457;&#29616;&#24403;&#26399;&#21002;&#21453;&#39304;&#19981;&#20250;&#25913;&#21464;&#35770;&#25991;&#36136;&#37327;&#26102;&#65292;&#30740;&#31350;&#20154;&#21592;&#30340;&#26368;&#20248;&#31574;&#30053;&#22312;&#25509;&#21463;&#22238;&#25253;&#19978;&#26159;&#21333;&#35843;&#30340;&#65292;&#24182;&#19988;&#25552;&#20132;&#25104;&#26412;&#25197;&#26354;&#20102;&#30740;&#31350;&#20154;&#21592;&#30340;&#26377;&#25928;&#25509;&#21463;&#22238;&#25253;&#65292;&#20294;&#20445;&#25345;&#20102;&#21333;&#35843;&#26368;&#20248;&#24615;&#12290;</title><link>https://arxiv.org/abs/2402.01745</link><description>&lt;p&gt;
&#20309;&#26102;&#20309;&#22320;&#25552;&#20132;&#35770;&#25991;
&lt;/p&gt;
&lt;p&gt;
When and Where To Submit A Paper
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.01745
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#20998;&#26512;&#20102;&#30740;&#31350;&#20154;&#21592;&#25552;&#20132;&#35770;&#25991;&#32473;&#19981;&#21516;&#36136;&#37327;&#30340;&#26399;&#21002;&#30340;&#26368;&#20339;&#39034;&#24207;&#38382;&#39064;&#65292;&#21457;&#29616;&#24403;&#26399;&#21002;&#21453;&#39304;&#19981;&#20250;&#25913;&#21464;&#35770;&#25991;&#36136;&#37327;&#26102;&#65292;&#30740;&#31350;&#20154;&#21592;&#30340;&#26368;&#20248;&#31574;&#30053;&#22312;&#25509;&#21463;&#22238;&#25253;&#19978;&#26159;&#21333;&#35843;&#30340;&#65292;&#24182;&#19988;&#25552;&#20132;&#25104;&#26412;&#25197;&#26354;&#20102;&#30740;&#31350;&#20154;&#21592;&#30340;&#26377;&#25928;&#25509;&#21463;&#22238;&#25253;&#65292;&#20294;&#20445;&#25345;&#20102;&#21333;&#35843;&#26368;&#20248;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#20998;&#26512;&#20102;&#19968;&#20010;&#27809;&#26377;&#21484;&#22238;&#30340;&#36830;&#32493;&#25628;&#32034;&#27169;&#22411;&#65292;&#30740;&#31350;&#20154;&#21592;&#23545;&#26399;&#21002;&#25552;&#20132;&#30340;&#39044;&#26399;&#20215;&#20540;&#21462;&#20915;&#20110;&#36807;&#21435;&#25552;&#20132;&#30340;&#21382;&#21490;&#12290;&#25509;&#21463;&#31435;&#21363;&#32456;&#27490;&#25628;&#32034;&#36807;&#31243;&#24182;&#33719;&#24471;&#19968;&#23450;&#30340;&#22238;&#25253;&#65292;&#32780;&#25298;&#32477;&#21017;&#25552;&#20379;&#26377;&#20851;&#35770;&#25991;&#36136;&#37327;&#30340;&#20449;&#24687;&#65292;&#24433;&#21709;&#30740;&#31350;&#20154;&#21592;&#23545;&#26410;&#26469;&#26399;&#21002;&#25509;&#21463;&#27010;&#29575;&#30340;&#20449;&#24565;&#12290;&#24403;&#26399;&#21002;&#21453;&#39304;&#19981;&#20250;&#25913;&#21464;&#35770;&#25991;&#36136;&#37327;&#26102;&#65292;&#30740;&#31350;&#20154;&#21592;&#30340;&#26368;&#20248;&#31574;&#30053;&#22312;&#25509;&#21463;&#22238;&#25253;&#19978;&#26159;&#21333;&#35843;&#30340;&#12290;&#25552;&#20132;&#25104;&#26412;&#25197;&#26354;&#20102;&#30740;&#31350;&#20154;&#21592;&#30340;&#26377;&#25928;&#25509;&#21463;&#22238;&#25253;&#65292;&#20294;&#20445;&#25345;&#20102;&#21333;&#35843;&#26368;&#20248;&#24615;&#12290;&#22914;&#26524;&#26399;&#21002;&#25552;&#20379;&#21487;&#20197;&#24433;&#21709;&#35770;&#25991;&#36136;&#37327;&#30340;&#21453;&#39304;&#65292;&#20363;&#22914;&#36890;&#36807;&#8220;&#23457;&#31295;&#25253;&#21578;&#8221;&#65292;&#21017;&#25628;&#32034;&#39034;&#24207;&#21487;&#20197;&#26681;&#25454;&#20195;&#29702;&#20154;&#23545;&#35770;&#25991;&#36136;&#37327;&#30340;&#20808;&#39564;&#20449;&#24565;&#32780;&#21457;&#29983;&#24040;&#22823;&#21464;&#21270;&#12290;&#28982;&#32780;&#65292;&#25105;&#30830;&#23450;&#20102;&#19968;&#32452;&#8220;&#37197;&#23545;&#21305;&#37197;&#8221;&#30340;&#24773;&#20917;&#12290;
&lt;/p&gt;
&lt;p&gt;
What is the optimal order in which a researcher should submit their papers to journals of differing quality? I analyze a sequential search model without recall where the researcher's expected value from journal submission depends on the history of past submissions. Acceptances immediately terminate the search process and deliver some payoff, while rejections carry information about the paper's quality, affecting the researcher's belief in acceptance probability over future journals. When journal feedback does not change the paper's quality, the researcher's optimal strategy is monotone in their acceptance payoff. Submission costs distort the researcher's effective acceptance payoff, but maintain monotone optimality. If journals give feedback which can affect the paper's quality, such as through \textit{referee reports}, the search order can change drastically depending on the agent's prior belief about their paper's quality. However, I identify a set of \textit{assortative matched} con
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#22914;&#20309;&#20351;&#39044;&#24207;&#21644;&#25299;&#25169;&#30456;&#23481;&#65292;&#25552;&#20379;&#20102;&#30456;&#23481;&#30340;&#29305;&#24449;&#21270;&#21644;&#25490;&#38500;&#20559;&#22909;&#36830;&#32493;&#24615;&#30340;&#26465;&#20214;&#12290;&#26681;&#25454;&#32467;&#26524;&#65292;&#25552;&#20379;&#20102;&#19982;&#36830;&#32493;&#31038;&#20250;&#36328;&#20195;&#20559;&#22909;&#30340;&#19968;&#20123;&#19981;&#21487;&#33021;&#23450;&#29702;&#30456;&#23545;&#24212;&#30340;&#21487;&#33021;&#24615;&#23545;&#29031;&#12290;&#20351;&#29992;&#20934;&#20266;&#24230;&#37327;&#20316;&#20026;&#35843;&#21644;&#25299;&#25169;&#21644;&#31038;&#20250;&#36328;&#20195;&#20559;&#22909;&#30340;&#23450;&#37327;&#24037;&#20855;&#12290;</title><link>https://arxiv.org/abs/2402.01699</link><description>&lt;p&gt;
&#36328;&#20195;&#20559;&#22909;&#19982;&#36830;&#32493;&#24615;&#65306;&#35843;&#21644;&#24207;&#21644;&#25299;&#25169;&#30340;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Intergenerational Preferences and Continuity: Reconciling Order and Topology
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.01699
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22914;&#20309;&#20351;&#39044;&#24207;&#21644;&#25299;&#25169;&#30456;&#23481;&#65292;&#25552;&#20379;&#20102;&#30456;&#23481;&#30340;&#29305;&#24449;&#21270;&#21644;&#25490;&#38500;&#20559;&#22909;&#36830;&#32493;&#24615;&#30340;&#26465;&#20214;&#12290;&#26681;&#25454;&#32467;&#26524;&#65292;&#25552;&#20379;&#20102;&#19982;&#36830;&#32493;&#31038;&#20250;&#36328;&#20195;&#20559;&#22909;&#30340;&#19968;&#20123;&#19981;&#21487;&#33021;&#23450;&#29702;&#30456;&#23545;&#24212;&#30340;&#21487;&#33021;&#24615;&#23545;&#29031;&#12290;&#20351;&#29992;&#20934;&#20266;&#24230;&#37327;&#20316;&#20026;&#35843;&#21644;&#25299;&#25169;&#21644;&#31038;&#20250;&#36328;&#20195;&#20559;&#22909;&#30340;&#23450;&#37327;&#24037;&#20855;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20027;&#35201;&#30740;&#31350;&#22914;&#20309;&#20351;&#19968;&#20010;&#39044;&#24207;&#21644;&#25299;&#25169;&#30456;&#23481;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#19982;&#36830;&#32493;&#24615;&#30456;&#23481;&#30340;&#19968;&#20010;&#29305;&#24449;&#21270;&#12290;&#36825;&#20010;&#29305;&#24449;&#21270;&#35828;&#26126;&#36825;&#26679;&#30340;&#25299;&#25169;&#24517;&#39035;&#27604;&#39044;&#24207;&#35825;&#23548;&#30340;&#19978;&#23618;&#25299;&#25169;&#26356;&#31934;&#32454;&#65292;&#20174;&#32780;&#28548;&#28165;&#20102;&#22312;&#20351;&#39044;&#24207;&#36830;&#32493;&#30340;&#25299;&#25169;&#20013;&#26368;&#23567;&#30340;&#26159;&#21738;&#19968;&#20010;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36824;&#25552;&#20379;&#20102;&#36275;&#22815;&#30340;&#26465;&#20214;&#65292;&#21487;&#20197;&#36731;&#26494;&#25490;&#38500;&#20559;&#22909;&#30340;&#36830;&#32493;&#24615;&#12290;&#26681;&#25454;&#25152;&#24471;&#32467;&#26524;&#65292;&#25105;&#20204;&#25552;&#20379;&#20102;&#19982;P. Diamond&#12289;L.G. Svensson&#21644;T. Sakai&#30340;&#36830;&#32493;&#31038;&#20250;&#36328;&#20195;&#20559;&#22909;&#30340;&#19968;&#20123;&#33879;&#21517;&#19981;&#21487;&#33021;&#23450;&#29702;&#30456;&#23545;&#24212;&#30340;&#21487;&#33021;&#24615;&#23545;&#29031;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36824;&#24314;&#35758;&#20351;&#29992;&#20934;&#20266;&#24230;&#37327;&#20316;&#20026;&#35843;&#21644;&#25299;&#25169;&#21644;&#31038;&#20250;&#36328;&#20195;&#20559;&#22909;&#30340;&#36866;&#24403;&#23450;&#37327;&#24037;&#20855;&#12290;&#22240;&#27492;&#65292;&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#31181;&#33021;&#22815;&#20445;&#35777;&#25152;&#36848;&#21487;&#33021;&#24615;&#23545;&#29031;&#30340;&#24230;&#37327;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this paper we focus our efforts on studying how a preorder and topology can be made compatible. Thus we provide a characterization of those that are continuous-compatible. Such a characterization states that such topologies must be finer than the so-called upper topology induced by the preorder and, thus, it clarifies which topology is the smallest one among those that make the preorder continuous. Moreover, we provide sufficient conditions that allows us to discard in an easy way the continuity of a preference. In the light of the obtained results, we provide possibility counterparts of the a few celebrate impossibility theorems for continuous social social intergenerational preferences due to P. Diamond, L.G. Svensson and T. Sakai. Furthermore, we suggest quasi-pseudo-metrics as appropriate quantitative tool for reconciling topology and social intergenerational preferences. Thus, we develop a metric type method which is able to guarantee possibility counterparts of the aforesaid i
&lt;/p&gt;</description></item><item><title>&#36825;&#39033;&#30740;&#31350;&#21033;&#29992;LSTM&#31070;&#32463;&#32593;&#32476;&#31639;&#27861;&#39044;&#27979;&#20102;&#36873;&#23450;&#30340;OECD&#25104;&#21592;&#22269;&#21644;&#20234;&#26391;&#22312;2021&#24180;&#21040;2025&#24180;&#30340;&#36827;&#21475;&#24773;&#20917;&#65292;&#32467;&#26524;&#34920;&#26126;&#20854;&#20934;&#30830;&#24615;&#36798;&#21040;&#20102;99%&#12290;</title><link>https://arxiv.org/abs/2402.01648</link><description>&lt;p&gt;
&#21033;&#29992;LSTM&#31070;&#32463;&#32593;&#32476;&#31639;&#27861;&#39044;&#27979;OECD&#25104;&#21592;&#22269;&#21644;&#20234;&#26391;&#30340;&#36827;&#21475;
&lt;/p&gt;
&lt;p&gt;
Forecasting Imports in OECD Member Countries and Iran by Using Neural Network Algorithms of LSTM
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.01648
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#30740;&#31350;&#21033;&#29992;LSTM&#31070;&#32463;&#32593;&#32476;&#31639;&#27861;&#39044;&#27979;&#20102;&#36873;&#23450;&#30340;OECD&#25104;&#21592;&#22269;&#21644;&#20234;&#26391;&#22312;2021&#24180;&#21040;2025&#24180;&#30340;&#36827;&#21475;&#24773;&#20917;&#65292;&#32467;&#26524;&#34920;&#26126;&#20854;&#20934;&#30830;&#24615;&#36798;&#21040;&#20102;99%&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20154;&#24037;&#31070;&#32463;&#32593;&#32476;&#65288;ANN&#65289;&#20316;&#20026;&#20154;&#24037;&#26234;&#33021;&#30340;&#19968;&#20010;&#20998;&#25903;&#65292;&#22312;&#35768;&#22810;&#24212;&#29992;&#20013;&#23637;&#31034;&#20102;&#20854;&#39640;&#20215;&#20540;&#65292;&#24182;&#34987;&#29992;&#20316;&#19968;&#31181;&#36866;&#21512;&#30340;&#39044;&#27979;&#26041;&#27861;&#12290;&#22240;&#27492;&#65292;&#26412;&#30740;&#31350;&#26088;&#22312;&#21033;&#29992;ANN&#39044;&#27979;&#36873;&#23450;&#30340;OECD&#25104;&#21592;&#22269;&#21644;&#20234;&#26391;&#22312;2021&#24180;&#21040;2025&#24180;&#30340;20&#20010;&#23395;&#24230;&#30340;&#36827;&#21475;&#24773;&#20917;&#12290;&#20174;1970&#24180;&#33267;2019&#24180;&#65292;&#36890;&#36807;&#20351;&#29992;&#19990;&#30028;&#38134;&#34892;&#12289;&#19990;&#30028;&#36152;&#26131;&#32452;&#32455;&#12289;&#22269;&#38469;&#36135;&#24065;&#22522;&#37329;&#32452;&#32455;&#31561;&#26377;&#25928;&#36164;&#28304;&#25910;&#38598;&#20102;&#36825;&#20123;&#22269;&#23478;&#36827;&#21475;&#30456;&#20851;&#30340;&#25968;&#25454;&#65292;&#24182;&#23558;&#25968;&#25454;&#36716;&#21270;&#20026;&#23395;&#24230;&#25968;&#25454;&#65292;&#20197;&#22686;&#21152;&#25910;&#38598;&#25968;&#25454;&#37327;&#65292;&#20197;&#25552;&#39640;&#32593;&#32476;&#24615;&#33021;&#21644;&#20934;&#30830;&#24615;&#12290;&#26412;&#30740;&#31350;&#20351;&#29992;LSTM&#22312;PyCharm&#20013;&#20998;&#26512;&#25968;&#25454;&#12290;&#20854;&#20013;75%&#30340;&#25968;&#25454;&#34987;&#35270;&#20026;&#35757;&#32451;&#25968;&#25454;&#65292;25%&#34987;&#35270;&#20026;&#27979;&#35797;&#25968;&#25454;&#65292;&#20998;&#26512;&#32467;&#26524;&#20197;99%&#30340;&#20934;&#30830;&#29575;&#36827;&#34892;&#39044;&#27979;&#65292;&#26174;&#31034;&#20102;&#36755;&#20986;&#30340;&#26377;&#25928;&#24615;&#21644;&#21487;&#38752;&#24615;&#12290;&#30001;&#20110;&#36827;&#21475;&#26159;&#19968;&#20010;&#28040;&#36153;&#20989;&#25968;&#65292;&#32780;&#28040;&#36153;&#21463;&#21040;...
&lt;/p&gt;
&lt;p&gt;
Artificial Neural Networks (ANN) which are a branch of artificial intelligence, have shown their high value in lots of applications and are used as a suitable forecasting method. Therefore, this study aims at forecasting imports in OECD member selected countries and Iran for 20 seasons from 2021 to 2025 by means of ANN. Data related to the imports of such countries collected over 50 years from 1970 to 2019 from valid resources including World Bank, WTO, IFM,the data turned into seasonal data to increase the number of collected data for better performance and high accuracy of the network by using Diz formula that there were totally 200 data related to imports. This study has used LSTM to analyse data in Pycharm. 75% of data considered as training data and 25% considered as test data and the results of the analysis were forecasted with 99% accuracy which revealed the validity and reliability of the output. Since the imports is consumption function and since the consumption is influenced 
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#20174;&#19968;&#33324;&#29615;&#22659;&#20013;&#23398;&#20064;&#22240;&#26524;&#34920;&#31034;&#30340;&#38382;&#39064;&#65292;&#25552;&#20379;&#20102;&#22522;&#20110;&#36825;&#31181;&#29615;&#22659;&#29983;&#25104;&#30340;&#25968;&#25454;&#30340;&#21487;&#36776;&#35782;&#24615;&#32467;&#26524;&#65292;&#24182;&#25351;&#20986;&#20102;&#21463;&#21040;&#22260;&#32469;&#33410;&#28857;&#27495;&#20041;&#30340;&#38480;&#21046;&#12290;&#21516;&#26102;&#25552;&#20986;&#20102;&#19968;&#20010;&#31639;&#27861;&#21487;&#20197;&#24674;&#22797;&#20986;&#22320;&#38754;&#30495;&#23454;&#27169;&#22411;</title><link>https://arxiv.org/abs/2311.12267</link><description>&lt;p&gt;
&#20174;&#19968;&#33324;&#29615;&#22659;&#20013;&#23398;&#20064;&#22240;&#26524;&#34920;&#31034;&#65306;&#21487;&#36776;&#35782;&#24615;&#21644;&#20869;&#22312;&#27495;&#20041;
&lt;/p&gt;
&lt;p&gt;
Learning Causal Representations from General Environments: Identifiability and Intrinsic Ambiguity
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2311.12267
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#20174;&#19968;&#33324;&#29615;&#22659;&#20013;&#23398;&#20064;&#22240;&#26524;&#34920;&#31034;&#30340;&#38382;&#39064;&#65292;&#25552;&#20379;&#20102;&#22522;&#20110;&#36825;&#31181;&#29615;&#22659;&#29983;&#25104;&#30340;&#25968;&#25454;&#30340;&#21487;&#36776;&#35782;&#24615;&#32467;&#26524;&#65292;&#24182;&#25351;&#20986;&#20102;&#21463;&#21040;&#22260;&#32469;&#33410;&#28857;&#27495;&#20041;&#30340;&#38480;&#21046;&#12290;&#21516;&#26102;&#25552;&#20986;&#20102;&#19968;&#20010;&#31639;&#27861;&#21487;&#20197;&#24674;&#22797;&#20986;&#22320;&#38754;&#30495;&#23454;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#22240;&#26524;&#34920;&#31034;&#23398;&#20064;&#65292;&#21363;&#20174;&#20302;&#32423;&#35266;&#27979;&#25968;&#25454;&#65288;&#22914;&#25991;&#26412;&#21644;&#22270;&#20687;&#65289;&#20013;&#24674;&#22797;&#39640;&#32423;&#28508;&#22312;&#21464;&#37327;&#21450;&#20854;&#22240;&#26524;&#20851;&#31995;&#30340;&#20219;&#21153;&#65292;&#20551;&#35774;&#21487;&#20197;&#35775;&#38382;&#20174;&#22810;&#20010;&#29615;&#22659;&#29983;&#25104;&#30340;&#35266;&#23519;&#32467;&#26524;&#12290;&#20043;&#21069;&#20851;&#20110;&#22240;&#26524;&#34920;&#31034;&#21487;&#36776;&#35782;&#24615;&#30340;&#32467;&#26524;&#36890;&#24120;&#20551;&#35774;&#21487;&#20197;&#35775;&#38382;&#21333;&#33410;&#28857;&#24178;&#39044;&#65292;&#20294;&#23454;&#38469;&#19978;&#36825;&#26159;&#19981;&#20999;&#23454;&#38469;&#30340;&#65292;&#22240;&#20026;&#28508;&#22312;&#21464;&#37327;&#26412;&#36523;&#23601;&#26410;&#30693;&#12290;&#22312;&#26412;&#30740;&#31350;&#20013;&#65292;&#25105;&#20204;&#25552;&#20379;&#20102;&#22522;&#20110;&#26469;&#33258;&#19968;&#33324;&#29615;&#22659;&#30340;&#25968;&#25454;&#30340;&#31532;&#19968;&#20010;&#21487;&#36776;&#35782;&#24615;&#32467;&#26524;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#23545;&#20110;&#32447;&#24615;&#22240;&#26524;&#27169;&#22411;&#65292;&#34429;&#28982;&#21487;&#20197;&#23436;&#20840;&#24674;&#22797;&#22240;&#26524;&#22270;&#65292;&#20294;&#28508;&#22312;&#21464;&#37327;&#21482;&#33021;&#34987;&#35782;&#21035;&#21040;&#21463;&#21040;&#22260;&#32469;&#33410;&#28857;&#27495;&#20041;&#65288;SNA&#65289;&#30340;&#31243;&#24230;&#19978;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#25105;&#20204;&#20445;&#35777;&#30340;&#23545;&#24212;&#23545;&#65292;&#35777;&#26126;&#20102;&#22312;&#25105;&#20204;&#30340;&#35774;&#32622;&#20013;SNA&#22522;&#26412;&#19978;&#26159;&#19981;&#21487;&#36991;&#20813;&#30340;&#12290;&#25105;&#20204;&#36824;&#25552;&#20986;&#20102;&#19968;&#20010;&#31639;&#27861;LiNGCReL&#65292;&#21487;&#20197;&#34987;&#35777;&#26126;&#21487;&#20197;&#24674;&#22797;&#20986;&#22320;&#38754;&#30495;&#23454;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
We study causal representation learning, the task of recovering high-level latent variables and their causal relationships in the form of a causal graph from low-level observed data (such as text and images), assuming access to observations generated from multiple environments. Prior results on the identifiability of causal representations typically assume access to single-node interventions which is rather unrealistic in practice, since the latent variables are unknown in the first place. In this work, we provide the first identifiability results based on data that stem from general environments. We show that for linear causal models, while the causal graph can be fully recovered, the latent variables are only identified up to the surrounded-node ambiguity (SNA) \citep{varici2023score}. We provide a counterpart of our guarantee, showing that SNA is basically unavoidable in our setting. We also propose an algorithm, \texttt{LiNGCReL} which provably recovers the ground-truth model up to
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#38598;&#32676;&#32593;&#32476;&#24178;&#25200;&#19979;&#20010;&#20307;&#21270;&#31574;&#30053;&#35780;&#20272;&#19982;&#23398;&#20064;&#30340;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#21482;&#20551;&#35774;&#21322;&#21442;&#25968;&#32467;&#26500;&#27169;&#22411;&#30340;&#26041;&#27861;&#65292;&#33021;&#22815;&#26356;&#20934;&#30830;&#22320;&#35780;&#20272;&#21644;&#23398;&#20064;&#26368;&#20248;&#30340;&#20010;&#20307;&#21270;&#22788;&#29702;&#35268;&#21017;&#12290;</title><link>https://arxiv.org/abs/2311.02467</link><description>&lt;p&gt;
&#38598;&#32676;&#32593;&#32476;&#24178;&#25200;&#19979;&#30340;&#20010;&#20307;&#21270;&#31574;&#30053;&#35780;&#20272;&#19982;&#23398;&#20064;
&lt;/p&gt;
&lt;p&gt;
Individualized Policy Evaluation and Learning under Clustered Network Interference
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2311.02467
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#38598;&#32676;&#32593;&#32476;&#24178;&#25200;&#19979;&#20010;&#20307;&#21270;&#31574;&#30053;&#35780;&#20272;&#19982;&#23398;&#20064;&#30340;&#38382;&#39064;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#21482;&#20551;&#35774;&#21322;&#21442;&#25968;&#32467;&#26500;&#27169;&#22411;&#30340;&#26041;&#27861;&#65292;&#33021;&#22815;&#26356;&#20934;&#30830;&#22320;&#35780;&#20272;&#21644;&#23398;&#20064;&#26368;&#20248;&#30340;&#20010;&#20307;&#21270;&#22788;&#29702;&#35268;&#21017;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#23613;&#31649;&#29616;&#22312;&#26377;&#24456;&#22810;&#20851;&#20110;&#25919;&#31574;&#35780;&#20272;&#21644;&#23398;&#20064;&#30340;&#25991;&#29486;&#65292;&#20294;&#22823;&#37096;&#20998;&#20043;&#21069;&#30340;&#24037;&#20316;&#37117;&#20551;&#35774;&#19968;&#20010;&#20010;&#20307;&#30340;&#22788;&#29702;&#20998;&#37197;&#19981;&#20250;&#24433;&#21709;&#21478;&#19968;&#20010;&#20010;&#20307;&#30340;&#32467;&#26524;&#12290;&#19981;&#24184;&#30340;&#26159;&#65292;&#24573;&#35270;&#24178;&#25200;&#21487;&#33021;&#23548;&#33268;&#35780;&#20272;&#20559;&#35823;&#21644;&#26080;&#25928;&#30340;&#23398;&#20064;&#31574;&#30053;&#12290;&#20363;&#22914;&#65292;&#22788;&#29702;&#26377;&#24456;&#22810;&#26379;&#21451;&#30340;&#26377;&#24433;&#21709;&#21147;&#30340;&#20010;&#20307;&#21487;&#33021;&#20135;&#29983;&#27491;&#21521;&#28322;&#20986;&#25928;&#24212;&#65292;&#20174;&#32780;&#25913;&#21892;&#20010;&#20307;&#21270;&#22788;&#29702;&#35268;&#21017;&#65288;ITR&#65289;&#30340;&#25972;&#20307;&#24615;&#33021;&#12290;&#25105;&#20204;&#32771;&#34385;&#22312;&#38598;&#32676;&#32593;&#32476;&#24178;&#25200;&#65288;&#20063;&#31216;&#20026;&#37096;&#20998;&#24178;&#25200;&#65289;&#19979;&#35780;&#20272;&#21644;&#23398;&#20064;&#26368;&#20248;ITR&#30340;&#38382;&#39064;&#65292;&#22312;&#35813;&#38382;&#39064;&#20013;&#65292;&#21333;&#20301;&#32858;&#31867;&#20174;&#19968;&#20010;&#24635;&#20307;&#20013;&#25277;&#26679;&#65292;&#24182;&#19988;&#22312;&#27599;&#20010;&#32858;&#31867;&#20013;&#21333;&#20301;&#20043;&#38388;&#21487;&#33021;&#20114;&#30456;&#24433;&#21709;&#12290;&#19982;&#20197;&#21069;&#30340;&#26041;&#27861;&#24378;&#21046;&#38480;&#21046;&#28322;&#20986;&#25928;&#24212;&#19981;&#21516;&#65292;&#25152;&#25552;&#20986;&#30340;&#26041;&#27861;&#21482;&#20551;&#35774;&#21322;&#21442;&#25968;&#32467;&#26500;&#27169;&#22411;&#65292;&#27599;&#20010;&#21333;&#20301;&#30340;&#32467;&#26524;&#26159;&#32858;&#31867;&#20013;&#30340;&#20010;&#20307;&#22788;&#29702;&#30340;&#21152;&#27861;&#20989;&#25968;&#12290;
&lt;/p&gt;
&lt;p&gt;
While there now exists a large literature on policy evaluation and learning, much of prior work assumes that the treatment assignment of one unit does not affect the outcome of another unit. Unfortunately, ignoring interference may lead to biased policy evaluation and ineffective learned policies. For example, treating influential individuals who have many friends can generate positive spillover effects, thereby improving the overall performance of an individualized treatment rule (ITR). We consider the problem of evaluating and learning an optimal ITR under clustered network interference (also known as partial interference) where clusters of units are sampled from a population and units may influence one another within each cluster. Unlike previous methods that impose strong restrictions on spillover effects, the proposed methodology only assumes a semiparametric structural model where each unit's outcome is an additive function of individual treatments within the cluster. Under this 
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#19968;&#20010;&#20195;&#29702;&#20154;&#22312;&#19982;&#26426;&#26500;&#24314;&#31435;&#20851;&#31995;&#26399;&#38388;&#25345;&#32493;&#38754;&#20020;&#25918;&#32622;&#25110;&#19981;&#25918;&#32622;&#20449;&#20219;&#30340;&#20915;&#31574;&#38382;&#39064;&#65292;&#24182;&#20351;&#29992;&#36125;&#21494;&#26031;&#23398;&#20064;&#21644;&#30446;&#20809;&#29421;&#31364;&#30340;&#21512;&#29702;&#24615;&#26469;&#20272;&#35745;&#26426;&#26500;&#30340;&#21487;&#20449;&#24230;&#12290;&#27492;&#22806;&#65292;&#35770;&#25991;&#36824;&#36890;&#36807;&#24314;&#27169;&#20004;&#20010;&#20449;&#20219;&#32773;&#20195;&#29702;&#20154;&#30340;&#20851;&#31995;&#65292;&#25506;&#35752;&#20102;&#20182;&#20204;&#20043;&#38388;&#30340;&#20132;&#27969;&#27169;&#24335;&#65292;&#24182;&#25512;&#23548;&#20986;&#20195;&#29702;&#20154;&#22312;&#20851;&#31995;&#20013;&#20572;&#27490;&#25918;&#32622;&#20449;&#20219;&#30340;&#27010;&#29575;&#20197;&#21450;&#20572;&#27490;&#20043;&#21518;&#25152;&#33457;&#36153;&#30340;&#26102;&#38388;&#12290;</title><link>https://arxiv.org/abs/2303.01921</link><description>&lt;p&gt;
&#20449;&#20219;&#65306;&#29420;&#33258;&#21644;&#20849;&#21516;&#30340;&#38382;&#39064;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Trusting: Alone and together
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2303.01921
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#19968;&#20010;&#20195;&#29702;&#20154;&#22312;&#19982;&#26426;&#26500;&#24314;&#31435;&#20851;&#31995;&#26399;&#38388;&#25345;&#32493;&#38754;&#20020;&#25918;&#32622;&#25110;&#19981;&#25918;&#32622;&#20449;&#20219;&#30340;&#20915;&#31574;&#38382;&#39064;&#65292;&#24182;&#20351;&#29992;&#36125;&#21494;&#26031;&#23398;&#20064;&#21644;&#30446;&#20809;&#29421;&#31364;&#30340;&#21512;&#29702;&#24615;&#26469;&#20272;&#35745;&#26426;&#26500;&#30340;&#21487;&#20449;&#24230;&#12290;&#27492;&#22806;&#65292;&#35770;&#25991;&#36824;&#36890;&#36807;&#24314;&#27169;&#20004;&#20010;&#20449;&#20219;&#32773;&#20195;&#29702;&#20154;&#30340;&#20851;&#31995;&#65292;&#25506;&#35752;&#20102;&#20182;&#20204;&#20043;&#38388;&#30340;&#20132;&#27969;&#27169;&#24335;&#65292;&#24182;&#25512;&#23548;&#20986;&#20195;&#29702;&#20154;&#22312;&#20851;&#31995;&#20013;&#20572;&#27490;&#25918;&#32622;&#20449;&#20219;&#30340;&#27010;&#29575;&#20197;&#21450;&#20572;&#27490;&#20043;&#21518;&#25152;&#33457;&#36153;&#30340;&#26102;&#38388;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#19968;&#20010;&#20195;&#29702;&#20154;&#36830;&#32493;&#38754;&#20020;&#30340;&#25918;&#32622;&#25110;&#19981;&#25918;&#32622;&#23545;&#26426;&#26500;&#20449;&#20219;&#30340;&#20915;&#31574;&#38382;&#39064;&#12290;&#20195;&#29702;&#20154;&#20351;&#29992;&#36125;&#21494;&#26031;&#23398;&#20064;&#26469;&#20272;&#35745;&#26426;&#26500;&#30340;&#30495;&#23454;&#20540;&#21644;&#26681;&#25454;&#30446;&#20809;&#29421;&#31364;&#30340;&#21512;&#29702;&#24615;&#26469;&#20915;&#23450;&#26159;&#21542;&#25918;&#32622;&#20449;&#20219;&#12290;&#20351;&#29992;&#20102;&#38543;&#26426;&#28216;&#21160;&#29702;&#35770;&#30340;&#20803;&#32032;&#65292;&#25105;&#20204;&#26126;&#30830;&#25512;&#23548;&#20102;&#36825;&#26679;&#19968;&#20010;&#20195;&#29702;&#20154;&#22312;&#20851;&#31995;&#20013;&#20309;&#26102;&#20572;&#27490;&#25918;&#32622;&#20449;&#20219;&#30340;&#27010;&#29575;&#65292;&#20197;&#21450;&#22312;&#25918;&#32622;&#20449;&#20219;&#20572;&#27490;&#20043;&#21518;&#25152;&#33457;&#36153;&#30340;&#39044;&#26399;&#26102;&#38388;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#32487;&#32493;&#24314;&#27169;&#20102;&#20004;&#20010;&#20449;&#20219;&#32773;&#20195;&#29702;&#20154;&#65292;&#20182;&#20204;&#21508;&#33258;&#19982;&#26426;&#26500;&#24314;&#31435;&#20102;&#20851;&#31995;&#12290;&#25105;&#20204;&#32771;&#34385;&#20102;&#20004;&#31181;&#20449;&#20219;&#32773;&#20043;&#38388;&#30340;&#33258;&#28982;&#20132;&#27969;&#27169;&#24335;&#12290;&#22312;&#31532;&#19968;&#31181;&#65288;&#8220;&#21487;&#35266;&#23519;&#22870;&#21169;&#8221;&#65289;&#20013;&#65292;&#20195;&#29702;&#20154;&#24444;&#27492;&#25259;&#38706;&#19982;&#26426;&#26500;&#30340;&#32463;&#39564;&#65292;&#32780;&#22312;&#31532;&#20108;&#31181;&#65288;&#8220;&#21487;&#35266;&#23519;&#21160;&#20316;&#8221;&#65289;&#20013;&#65292;&#20195;&#29702;&#20154;&#20165;&#30446;&#30585;&#20182;&#20204;&#37051;&#23621;&#30340;&#34892;&#21160;&#65292;&#21363;&#26159;&#25918;&#32622;&#25110;&#19981;&#25918;&#32622;&#20449;&#20219;&#12290;&#22312;&#19982;&#21333;&#19968;&#20195;&#29702;&#20154;&#24773;&#20917;&#19979;&#30340;&#30456;&#21516;&#20551;&#35774;&#19979;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study the problem of an agent continuously faced with the decision of placing or not placing trust in an institution. The agent makes use of Bayesian learning in order to estimate the institution's true trustworthiness and makes the decision to place trust based on myopic rationality. Using elements from random walk theory, we explicitly derive the probability that such an agent ceases placing trust at some point in the relationship, as well as the expected time spent placing trust conditioned on their discontinuation thereof.   We then continue by modelling two truster agents, each in their own relationship to the institution. We consider two natural models of communication between them. In the first (``observable rewards'') agents disclose their experiences with the institution with one another, while in the second (``observable actions'') agents merely witness the actions of their neighbour, i.e., placing or not placing trust. Under the same assumptions as in the single agent cas
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#30740;&#31350;&#20102;&#22312;&#31454;&#20105;&#21644;&#25805;&#32437;&#30340;&#26465;&#20214;&#19979;&#65292;&#36890;&#36807;&#27604;&#36187;&#31579;&#36873;&#20449;&#21495;&#25805;&#32437;&#20195;&#29702;&#21830;&#30340;&#35774;&#35745;&#12290;&#25105;&#20204;&#21457;&#29616;&#26368;&#22823;&#21270;&#31119;&#21033;&#30340;&#26426;&#21046;&#37319;&#29992;&#27604;&#36187;&#24418;&#24335;&#65292;&#24182;&#34920;&#24449;&#20102;&#26368;&#20248;&#30340;&#27604;&#36187;&#12290;&#24403;&#20195;&#29702;&#21830;&#36275;&#22815;&#22810;&#26102;&#65292;&#20840;&#32988;&#21046;&#30340;&#27604;&#36187;&#20174;&#19981;&#26159;&#26368;&#20248;&#30340;&#65292;&#35268;&#21010;&#32773;&#24635;&#26159;&#20174;&#23545;&#19968;&#20123;&#20195;&#29702;&#21830;&#30340;&#38543;&#26426;&#20998;&#37197;&#20013;&#33719;&#30410;&#12290;</title><link>https://arxiv.org/abs/2302.09168</link><description>&lt;p&gt;
&#36890;&#36807;&#27604;&#36187;&#31579;&#36873;&#20449;&#21495;&#25805;&#32437;&#20195;&#29702;&#21830;
&lt;/p&gt;
&lt;p&gt;
Screening Signal-Manipulating Agents via Contests
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2302.09168
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#30740;&#31350;&#20102;&#22312;&#31454;&#20105;&#21644;&#25805;&#32437;&#30340;&#26465;&#20214;&#19979;&#65292;&#36890;&#36807;&#27604;&#36187;&#31579;&#36873;&#20449;&#21495;&#25805;&#32437;&#20195;&#29702;&#21830;&#30340;&#35774;&#35745;&#12290;&#25105;&#20204;&#21457;&#29616;&#26368;&#22823;&#21270;&#31119;&#21033;&#30340;&#26426;&#21046;&#37319;&#29992;&#27604;&#36187;&#24418;&#24335;&#65292;&#24182;&#34920;&#24449;&#20102;&#26368;&#20248;&#30340;&#27604;&#36187;&#12290;&#24403;&#20195;&#29702;&#21830;&#36275;&#22815;&#22810;&#26102;&#65292;&#20840;&#32988;&#21046;&#30340;&#27604;&#36187;&#20174;&#19981;&#26159;&#26368;&#20248;&#30340;&#65292;&#35268;&#21010;&#32773;&#24635;&#26159;&#20174;&#23545;&#19968;&#20123;&#20195;&#29702;&#21830;&#30340;&#38543;&#26426;&#20998;&#37197;&#20013;&#33719;&#30410;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#22312;&#31454;&#20105;&#21644;&#25805;&#32437;&#30340;&#26465;&#20214;&#19979;&#65292;&#31579;&#36873;&#26426;&#21046;&#30340;&#35774;&#35745;&#12290;&#19968;&#20010;&#31038;&#20250;&#35268;&#21010;&#32773;&#21482;&#26377;&#26377;&#38480;&#30340;&#36164;&#28304;&#21487;&#20197;&#20998;&#37197;&#32473;&#22810;&#20010;&#20195;&#29702;&#21830;&#65292;&#21482;&#33021;&#20351;&#29992;&#36890;&#36807;&#26080;&#29983;&#20135;&#24615;&#21162;&#21147;&#25805;&#32437;&#30340;&#20449;&#21495;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#26368;&#22823;&#21270;&#31119;&#21033;&#30340;&#26426;&#21046;&#37319;&#29992;&#27604;&#36187;&#24418;&#24335;&#65292;&#24182;&#34920;&#24449;&#20102;&#26368;&#20248;&#30340;&#27604;&#36187;&#12290;&#25105;&#20204;&#23558;&#25105;&#20204;&#30340;&#32467;&#26524;&#24212;&#29992;&#20110;&#20004;&#31181;&#24773;&#20917;:&#35268;&#21010;&#32773;&#21482;&#26377;&#19968;&#20010;&#29289;&#21697;&#25110;&#32773;&#19982;&#20195;&#29702;&#21830;&#25968;&#37327;&#25104;&#27604;&#20363;&#30340;&#22810;&#20010;&#29289;&#21697;&#12290;&#25105;&#20204;&#35777;&#26126;&#65292;&#22312;&#36825;&#20004;&#31181;&#24773;&#20917;&#19979;&#65292;&#24403;&#20195;&#29702;&#21830;&#36275;&#22815;&#22810;&#30340;&#26102;&#20505;&#65292;&#20840;&#32988;&#21046;&#30340;&#27604;&#36187;&#20174;&#19981;&#26159;&#26368;&#20248;&#30340;&#12290;&#29305;&#21035;&#22320;&#65292;&#35268;&#21010;&#32773;&#24635;&#26159;&#20174;&#23545;&#19968;&#20123;&#20195;&#29702;&#21830;&#30340;&#38543;&#26426;&#20998;&#37197;&#20013;&#33719;&#30410;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study the design of screening mechanisms subject to competition and manipulation. A social planner has limited resources to allocate to multiple agents using only signals manipulable through unproductive effort. We show that the welfare-maximizing mechanism takes the form of a contest and characterize the optimal contest. We apply our results to two settings: either the planner has one item or a number of items proportional to the number of agents. We show that in both settings, with sufficiently many agents, a winner-takes-all contest is never optimal. In particular, the planner always benefits from randomizing the allocation to some agents.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#36866;&#29992;&#20110;&#36830;&#32493;&#27835;&#30103;&#29615;&#22659;&#30340;&#22810;&#37325;&#31283;&#20581;&#22240;&#26524;&#20013;&#20171;&#20998;&#26512;&#20272;&#35745;&#22120;&#65292;&#37319;&#29992;&#20102;&#26680;&#24179;&#28369;&#26041;&#27861;&#65292;&#24182;&#20855;&#26377;&#22810;&#37325;&#31283;&#20581;&#24615;&#21644;&#28176;&#36817;&#27491;&#24577;&#24615;&#12290;</title><link>https://arxiv.org/abs/2105.09254</link><description>&lt;p&gt;
&#22312;&#36830;&#32493;&#27835;&#30103;&#19979;&#30340;&#22810;&#37325;&#31283;&#20581;&#22240;&#26524;&#20013;&#20171;&#20998;&#26512;
&lt;/p&gt;
&lt;p&gt;
Multiply Robust Causal Mediation Analysis with Continuous Treatments
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2105.09254
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#36866;&#29992;&#20110;&#36830;&#32493;&#27835;&#30103;&#29615;&#22659;&#30340;&#22810;&#37325;&#31283;&#20581;&#22240;&#26524;&#20013;&#20171;&#20998;&#26512;&#20272;&#35745;&#22120;&#65292;&#37319;&#29992;&#20102;&#26680;&#24179;&#28369;&#26041;&#27861;&#65292;&#24182;&#20855;&#26377;&#22810;&#37325;&#31283;&#20581;&#24615;&#21644;&#28176;&#36817;&#27491;&#24577;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#35768;&#22810;&#24212;&#29992;&#20013;&#65292;&#30740;&#31350;&#20154;&#21592;&#23545;&#27835;&#30103;&#25110;&#26292;&#38706;&#23545;&#24863;&#20852;&#36259;&#30340;&#32467;&#26524;&#30340;&#30452;&#25509;&#21644;&#38388;&#25509;&#30340;&#22240;&#26524;&#25928;&#24212;&#12290;&#20013;&#20171;&#20998;&#26512;&#20026;&#37492;&#23450;&#21644;&#20272;&#35745;&#36825;&#20123;&#22240;&#26524;&#25928;&#24212;&#25552;&#20379;&#20102;&#19968;&#20010;&#20005;&#35880;&#30340;&#26694;&#26550;&#12290;&#23545;&#20110;&#20108;&#20803;&#27835;&#30103;&#65292;Tchetgen Tchetgen&#21644;Shpitser (2012)&#25552;&#20986;&#20102;&#30452;&#25509;&#21644;&#38388;&#25509;&#25928;&#24212;&#30340;&#39640;&#25928;&#20272;&#35745;&#22120;&#65292;&#22522;&#20110;&#21442;&#25968;&#30340;&#24433;&#21709;&#20989;&#25968;&#12290;&#36825;&#20123;&#20272;&#35745;&#22120;&#20855;&#26377;&#33391;&#22909;&#30340;&#24615;&#36136;&#65292;&#22914;&#22810;&#37325;&#31283;&#20581;&#24615;&#21644;&#28176;&#36817;&#27491;&#24577;&#24615;&#65292;&#21516;&#26102;&#20801;&#35768;&#23545;&#24178;&#25200;&#21442;&#25968;&#36827;&#34892;&#20302;&#20110;&#26681;&#21495;n&#30340;&#25910;&#25947;&#36895;&#24230;&#12290;&#28982;&#32780;&#65292;&#22312;&#28041;&#21450;&#36830;&#32493;&#27835;&#30103;&#30340;&#24773;&#20917;&#19979;&#65292;&#36825;&#20123;&#22522;&#20110;&#24433;&#21709;&#20989;&#25968;&#30340;&#20272;&#35745;&#22120;&#27809;&#26377;&#20934;&#22791;&#22909;&#24212;&#29992;&#65292;&#38500;&#38750;&#36827;&#34892;&#24378;&#21442;&#25968;&#20551;&#35774;&#12290;&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#21033;&#29992;&#26680;&#24179;&#28369;&#26041;&#27861;&#25552;&#20986;&#20102;&#19968;&#31181;&#36866;&#29992;&#20110;&#36830;&#32493;&#27835;&#30103;&#29615;&#22659;&#30340;&#20272;&#35745;&#22120;&#65292;&#21463;&#21040;Tchetgen Tchetgen&#30340;&#24433;&#21709;&#20989;&#25968;&#20272;&#35745;&#22120;&#30340;&#21551;&#21457;&#12290;
&lt;/p&gt;
&lt;p&gt;
In many applications, researchers are interested in the direct and indirect causal effects of a treatment or exposure on an outcome of interest. Mediation analysis offers a rigorous framework for identifying and estimating these causal effects. For binary treatments, efficient estimators for the direct and indirect effects are presented in Tchetgen Tchetgen and Shpitser (2012) based on the influence function of the parameter of interest. These estimators possess desirable properties, such as multiple-robustness and asymptotic normality, while allowing for slower than root-n rates of convergence for the nuisance parameters. However, in settings involving continuous treatments, these influence function-based estimators are not readily applicable without making strong parametric assumptions. In this work, utilizing a kernel-smoothing approach, we propose an estimator suitable for settings with continuous treatments inspired by the influence function-based estimator of Tchetgen Tchetgen an
&lt;/p&gt;</description></item><item><title>&#30740;&#31350;&#20351;&#29992;&#25193;&#23637;CDM&#27169;&#22411;&#21644;&#26080;&#26465;&#20214;&#20998;&#20301;&#25968;&#22238;&#24402;&#26041;&#27861;&#65292;&#21457;&#29616;&#32511;&#33394;&#21019;&#26032;&#23545;&#38750;&#37325;&#24230;&#27745;&#26579;&#20225;&#19994;&#30340;&#29983;&#20135;&#21147;&#24433;&#21709;&#26377;&#38480;&#65292;&#32780;&#22312;&#39640;&#27745;&#26579;&#21644;&#21046;&#36896;&#19994;&#39046;&#22495;&#65292;&#32511;&#33394;&#21019;&#26032;&#21644;&#38750;&#32511;&#33394;&#21019;&#26032;&#23545;&#29983;&#20135;&#21147;&#30340;&#25552;&#21319;&#25928;&#26524;&#30456;&#24403;&#12290;</title><link>http://arxiv.org/abs/2401.16030</link><description>&lt;p&gt;
&#32511;&#33394;&#21019;&#26032;&#26159;&#21542;&#25490;&#25380;&#20102;&#20225;&#19994;&#30340;&#20854;&#20182;&#21019;&#26032;&#65311;&#22522;&#20110;&#25193;&#23637;&#30340;CDM&#27169;&#22411;&#21644;&#26080;&#26465;&#20214;&#20998;&#20301;&#25968;&#22238;&#24402;&#30340;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Does green innovation crowd out other innovation of firms? Based on the extended CDM model and unconditional quantile regressions. (arXiv:2401.16030v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.16030
&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#20351;&#29992;&#25193;&#23637;CDM&#27169;&#22411;&#21644;&#26080;&#26465;&#20214;&#20998;&#20301;&#25968;&#22238;&#24402;&#26041;&#27861;&#65292;&#21457;&#29616;&#32511;&#33394;&#21019;&#26032;&#23545;&#38750;&#37325;&#24230;&#27745;&#26579;&#20225;&#19994;&#30340;&#29983;&#20135;&#21147;&#24433;&#21709;&#26377;&#38480;&#65292;&#32780;&#22312;&#39640;&#27745;&#26579;&#21644;&#21046;&#36896;&#19994;&#39046;&#22495;&#65292;&#32511;&#33394;&#21019;&#26032;&#21644;&#38750;&#32511;&#33394;&#21019;&#26032;&#23545;&#29983;&#20135;&#21147;&#30340;&#25552;&#21319;&#25928;&#26524;&#30456;&#24403;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#21487;&#25345;&#32493;&#21457;&#23637;&#26102;&#20195;&#65292;&#20225;&#19994;&#38754;&#20020;&#30528;&#22914;&#20309;&#25237;&#36164;&#20110;&#32511;&#33394;&#21019;&#26032;&#20197;&#21450;&#32511;&#33394;&#21019;&#26032;&#23545;&#20854;&#32463;&#27982;&#36712;&#36857;&#30340;&#24433;&#21709;&#30340;&#20915;&#31574;&#12290;&#26412;&#30740;&#31350;&#37319;&#29992;Crepon&#12289;Duguet&#21644;Mairesse&#65288;CDM&#65289;&#26694;&#26550;&#65292;&#36890;&#36807;&#21033;&#29992;&#27599;&#20010;&#38454;&#27573;&#30340;&#39044;&#27979;&#22240;&#21464;&#37327;&#26469;&#28040;&#38500;&#19981;&#21487;&#35266;&#23519;&#22240;&#32032;&#65292;&#26816;&#39564;&#20102;&#30740;&#21457;&#36164;&#37329;&#36716;&#21270;&#20026;&#19987;&#21033;&#20197;&#21450;&#20854;&#23545;&#29983;&#20135;&#21147;&#30340;&#24433;&#21709;&#12290;&#26412;&#30740;&#31350;&#22312;&#25193;&#23637;&#32463;&#20856;CDM&#27169;&#22411;&#30340;&#22522;&#30784;&#19978;&#65292;&#23545;&#27604;&#20102;&#32511;&#33394;&#21019;&#26032;&#21644;&#38750;&#32511;&#33394;&#21019;&#26032;&#30340;&#32463;&#27982;&#25928;&#24212;&#12290;&#32467;&#26524;&#26174;&#31034;&#65292;&#38750;&#32511;&#33394;&#19987;&#21033;&#20027;&#23548;&#30528;&#29983;&#20135;&#21147;&#30340;&#25552;&#21319;&#65292;&#32780;&#32511;&#33394;&#19987;&#21033;&#23545;&#38750;&#37325;&#24230;&#27745;&#26579;&#20225;&#19994;&#30340;&#24433;&#21709;&#26377;&#38480;&#12290;&#28982;&#32780;&#65292;&#22312;&#39640;&#27745;&#26579;&#21644;&#21046;&#36896;&#19994;&#39046;&#22495;&#65292;&#20004;&#31181;&#21019;&#26032;&#31867;&#22411;&#21516;&#26679;&#22686;&#24378;&#20102;&#29983;&#20135;&#21147;&#12290;&#36890;&#36807;&#26080;&#26465;&#20214;&#20998;&#20301;&#25968;&#22238;&#24402;&#65292;&#25105;&#21457;&#29616;&#32511;&#33394;&#21019;&#26032;&#30340;&#29983;&#20135;&#21147;&#24433;&#21709;&#21576;&#29616;&#20986;&#19968;&#20010;&#21453;U&#24418;&#29366;&#65292;&#32780;&#38750;&#32511;&#33394;&#21019;&#26032;&#21017;&#21576;&#29616;&#20986;&#19968;&#20010;U&#24418;&#29366;&#12290;&#20540;&#24471;&#27880;&#24847;&#30340;&#26159;&#65292;&#22312;&#31532;50&#21040;80&#20010;&#20998;&#20301;&#25968;&#20043;&#38388;&#65292;
&lt;/p&gt;
&lt;p&gt;
In the era of sustainability, firms grapple with the decision of how much to invest in green innovation and how it influences their economic trajectory. This study employs the Crepon, Duguet, and Mairesse (CDM) framework to examine the conversion of R&amp;D funds into patents and their impact on productivity, effectively addressing endogeneity by utilizing predicted dependent variables at each stage to exclude unobservable factors. Extending the classical CDM model, this study contrasts green and non-green innovations' economic effects. The results show non-green patents predominantly drive productivity gains, while green patents have a limited impact in non-heavy polluting firms. However, in high-pollution and manufacturing sectors, both innovation types equally enhance productivity. Using unconditional quantile regression, I found green innovation's productivity impact follows an inverse U-shape, unlike the U-shaped pattern of non-green innovation. Significantly, in the 50th to 80th prod
&lt;/p&gt;</description></item><item><title>&#30740;&#31350;&#35780;&#20272;&#20102;&#23545;&#29790;&#22763;&#26053;&#28216;&#30446;&#30340;&#22320;&#30340;&#20813;&#36153;&#20844;&#20849;&#20132;&#36890;&#25919;&#31574;&#23545;&#28216;&#23458;&#20986;&#34892;&#26041;&#24335;&#36873;&#25321;&#30340;&#24433;&#21709;&#65292;&#21457;&#29616;&#25919;&#31574;&#24179;&#22343;&#23548;&#33268;&#31169;&#23478;&#36710;&#21521;&#20844;&#20849;&#20132;&#36890;&#30340;&#36716;&#31227;&#22686;&#21152;&#20102;16.9&#21644;11.6&#20010;&#30334;&#20998;&#28857;&#65292;&#20026;&#26410;&#26469;&#35774;&#35745;&#26356;&#21487;&#25345;&#32493;&#30340;&#26053;&#34892;&#26041;&#26696;&#25552;&#20379;&#20102;&#37325;&#35201;&#21442;&#32771;&#12290;</title><link>http://arxiv.org/abs/2401.14945</link><description>&lt;p&gt;
&#20813;&#36153;&#20844;&#20849;&#20132;&#36890;&#21040;&#36798;&#30446;&#30340;&#22320;&#65306;&#23545;&#28216;&#23458;&#20986;&#34892;&#26041;&#24335;&#36873;&#25321;&#30340;&#22240;&#26524;&#20998;&#26512;
&lt;/p&gt;
&lt;p&gt;
Free public transport to the destination: A causal analysis of tourists' travel mode choice. (arXiv:2401.14945v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.14945
&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#35780;&#20272;&#20102;&#23545;&#29790;&#22763;&#26053;&#28216;&#30446;&#30340;&#22320;&#30340;&#20813;&#36153;&#20844;&#20849;&#20132;&#36890;&#25919;&#31574;&#23545;&#28216;&#23458;&#20986;&#34892;&#26041;&#24335;&#36873;&#25321;&#30340;&#24433;&#21709;&#65292;&#21457;&#29616;&#25919;&#31574;&#24179;&#22343;&#23548;&#33268;&#31169;&#23478;&#36710;&#21521;&#20844;&#20849;&#20132;&#36890;&#30340;&#36716;&#31227;&#22686;&#21152;&#20102;16.9&#21644;11.6&#20010;&#30334;&#20998;&#28857;&#65292;&#20026;&#26410;&#26469;&#35774;&#35745;&#26356;&#21487;&#25345;&#32493;&#30340;&#26053;&#34892;&#26041;&#26696;&#25552;&#20379;&#20102;&#37325;&#35201;&#21442;&#32771;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#35780;&#20272;&#20102;&#23545;&#29790;&#22763;&#26053;&#28216;&#30446;&#30340;&#22320;&#30340;&#36807;&#22812;&#28216;&#23458;&#23454;&#26045;&#20813;&#36153;&#20844;&#20849;&#20132;&#36890;&#25919;&#31574;&#23545;&#20986;&#34892;&#26041;&#24335;&#36873;&#25321;&#30340;&#24433;&#21709;&#12290;&#35813;&#25919;&#31574;&#30452;&#25509;&#38024;&#23545;&#22269;&#20869;&#20132;&#36890;&#24448;&#36820;&#30446;&#30340;&#22320;&#65292;&#35813;&#20132;&#36890;&#26041;&#24335;&#26159;&#36807;&#22812;&#26053;&#34892;&#20013;&#20108;&#27687;&#21270;&#30899;&#25490;&#25918;&#30340;&#20027;&#35201;&#36129;&#29486;&#32773;&#12290;&#22522;&#20110;&#19968;&#20010;&#35843;&#26597;&#26679;&#26412;&#65292;&#25105;&#20204;&#21033;&#29992;&#20449;&#24687;&#25552;&#20379;&#32773;&#65288;&#37202;&#24215;&#19994;&#20027;&#65289;&#27599;&#22825;&#21464;&#21270;&#30340;&#38543;&#26426;&#20803;&#32032;&#26469;&#30830;&#23450;&#25919;&#31574;&#30340;&#24433;&#21709;&#12290;&#25105;&#20204;&#36890;&#36807;&#20542;&#21521;&#24615;&#24471;&#20998;&#21305;&#37197;&#21644;&#22240;&#26524;&#26862;&#26519;&#30340;&#24212;&#29992;&#20272;&#35745;&#65292;&#31169;&#23478;&#36710;&#21521;&#20844;&#20849;&#20132;&#36890;&#30340;&#36716;&#31227;&#24179;&#22343;&#20026;16.9&#21644;11.6&#20010;&#30334;&#20998;&#28857;&#12290;&#36825;&#20123;&#32467;&#26524;&#23545;&#20110;&#20915;&#31574;&#32773;&#35774;&#35745;&#26410;&#26469;&#30340;&#26053;&#34892;&#26041;&#26696;&#65292;&#21253;&#25324;&#26356;&#21487;&#25345;&#32493;&#30340;&#26053;&#34892;&#26041;&#24335;&#21040;&#36798;&#30446;&#30340;&#22320;&#38750;&#24120;&#37325;&#35201;&#12290;&#24635;&#20307;&#19978;&#65292;&#26412;&#25991;&#23637;&#31034;&#20102;&#22914;&#20309;&#36890;&#36807;&#22240;&#26524;&#26694;&#26550;&#21644;&#22522;&#26412;&#20551;&#35774;&#27491;&#30830;&#30830;&#23450;&#26053;&#34892;&#21644;&#26053;&#28216;&#34892;&#19994;&#20013;&#31867;&#20284;&#33258;&#28982;&#23454;&#39564;&#30340;&#25928;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this paper, we assess the impact of a fare-free public transport policy for overnight guests on travel mode choice to a Swiss tourism destination. The policy directly targets domestic transport to and from a destination, the substantial contributor to the CO2 emissions of overnight trips. Based on a survey sample, we identify the effect with the help of the random element that the information on the offer from a hotelier to the guest varies in day-to-day business. We estimate a shift from private cars to public transport due to the policy of, on average, 16.9 and 11.6 percentage points, depending on the application of propensity score matching and causal forest. This knowledge is relevant for policy-makers to design future offers that include more sustainable travels to a destination. Overall, our paper exemplifies how such an effect of comparable natural experiments in the travel and tourism industry can be properly identified with a causal framework and underlying assumptions.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#30452;&#25509;&#36164;&#26412;&#29616;&#37329;&#36716;&#31227;&#23545;&#20110;&#36139;&#22256;&#21644;&#26497;&#31471;&#36139;&#22256;&#30340;&#20943;&#36731;&#20316;&#29992;&#12290;&#36890;&#36807;&#27169;&#25311;&#23478;&#24237;&#36164;&#26412;&#30340;Omega&#39118;&#38505;&#36807;&#31243;&#65292;&#21457;&#29616;&#22312;&#36164;&#26412;&#27700;&#24179;&#20302;&#20110;&#19968;&#23450;&#27700;&#24179;&#26102;&#65292;&#22806;&#37096;&#25903;&#25345;&#20197;&#30452;&#25509;&#36716;&#31227;&#24418;&#24335;&#25552;&#20379;&#65292;&#20197;&#24110;&#21161;&#23478;&#24237;&#25670;&#33073;&#36139;&#22256;&#38519;&#38449;&#12290;</title><link>http://arxiv.org/abs/2401.06141</link><description>&lt;p&gt;
&#30452;&#25509;&#36164;&#26412;&#29616;&#37329;&#36716;&#31227;&#23545;&#20110;&#36139;&#22256;&#21644;&#26497;&#31471;&#36139;&#22256;&#20943;&#36731;&#30340;&#20316;&#29992; -- &#19968;&#31181;Omega&#39118;&#38505;&#36807;&#31243;
&lt;/p&gt;
&lt;p&gt;
The Role of Direct Capital Cash Transfers Towards Poverty and Extreme Poverty Alleviation -- An Omega Risk Process. (arXiv:2401.06141v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.06141
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#30452;&#25509;&#36164;&#26412;&#29616;&#37329;&#36716;&#31227;&#23545;&#20110;&#36139;&#22256;&#21644;&#26497;&#31471;&#36139;&#22256;&#30340;&#20943;&#36731;&#20316;&#29992;&#12290;&#36890;&#36807;&#27169;&#25311;&#23478;&#24237;&#36164;&#26412;&#30340;Omega&#39118;&#38505;&#36807;&#31243;&#65292;&#21457;&#29616;&#22312;&#36164;&#26412;&#27700;&#24179;&#20302;&#20110;&#19968;&#23450;&#27700;&#24179;&#26102;&#65292;&#22806;&#37096;&#25903;&#25345;&#20197;&#30452;&#25509;&#36716;&#31227;&#24418;&#24335;&#25552;&#20379;&#65292;&#20197;&#24110;&#21161;&#23478;&#24237;&#25670;&#33073;&#36139;&#22256;&#38519;&#38449;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22256;&#22659;&#25351;&#30340;&#26159;&#23478;&#24237;&#38519;&#20837;&#36139;&#22256;&#21306;&#22495;&#30340;&#24773;&#20917;&#12290;&#29983;&#27963;&#22312;&#36139;&#22256;&#21306;&#22495;&#25110;&#38519;&#20837;&#36139;&#22256;&#21306;&#22495;&#30340;&#23478;&#24237;&#34987;&#31216;&#20026;&#36139;&#22256;&#38519;&#38449;&#30340;&#23478;&#24237;&#65292;&#36139;&#22256;&#38519;&#38449;&#26159;&#19968;&#31181;&#22312;&#27809;&#26377;&#22806;&#37096;&#24110;&#21161;&#30340;&#24773;&#20917;&#19979;&#38590;&#20197;&#36867;&#33073;&#30340;&#36139;&#22256;&#29366;&#24577;&#12290;&#21516;&#26679;&#65292;&#26497;&#31471;&#36139;&#22256;&#34987;&#35748;&#20026;&#26159;&#26368;&#20005;&#37325;&#30340;&#36139;&#22256;&#24418;&#24335;&#65292;&#23478;&#24237;&#22312;&#20854;&#20013;&#32463;&#21382;&#20005;&#37325;&#30340;&#22522;&#26412;&#20154;&#31867;&#38656;&#27714;&#19981;&#36275;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#32771;&#34385;&#20102;&#19968;&#20010;&#20855;&#26377;&#30830;&#23450;&#24615;&#22686;&#38271;&#21644;&#20056;&#24615;&#36339;&#36291;&#65288;&#23849;&#28291;&#65289;&#32467;&#26500;&#30340;Omega&#39118;&#38505;&#36807;&#31243;&#26469;&#27169;&#25311;&#23478;&#24237;&#30340;&#36164;&#26412;&#12290;&#20551;&#35774;&#24403;&#19968;&#20010;&#23478;&#24237;&#30340;&#36164;&#26412;&#27700;&#24179;&#39640;&#20110;&#30830;&#23450;&#36164;&#26412;&#22721;&#22418;&#27700;&#24179;&#26102;&#65292;&#30830;&#23450;&#23478;&#24237;&#26159;&#21542;&#26377;&#36164;&#26684;&#21442;&#21152;&#29616;&#37329;&#36164;&#26412;&#36716;&#31227;&#26041;&#26696;&#65292;&#20854;&#36164;&#26412;&#20250;&#25351;&#25968;&#22686;&#38271;&#12290;&#19968;&#26086;&#20854;&#36164;&#26412;&#38477;&#33267;&#36164;&#26412;&#22721;&#22418;&#27700;&#24179;&#20197;&#19979;&#65292;&#36164;&#26412;&#21160;&#24577;&#20250;&#24341;&#20837;&#30452;&#25509;&#36716;&#31227;&#65288;&#36164;&#26412;&#29616;&#37329;&#36716;&#31227;&#65289;&#30340;&#22806;&#37096;&#25903;&#25345;&#65292;&#36825;&#20123;&#25903;&#25345;&#30001;&#25424;&#21161;&#32773;&#25110;&#25919;&#24220;&#25552;&#20379;&#12290;&#21542;&#21017;
&lt;/p&gt;
&lt;p&gt;
Trapping refers to the event when a household falls into the area of poverty. Households that live or fall into the area of poverty are said to be in a poverty trap, where a poverty trap is a state of poverty from which it is difficult to escape without external help. Similarly, extreme poverty is considered as the most severe type of poverty, in which households experience severe deprivation of basic human needs. In this article, we consider an Omega risk process with deterministic growth and a multiplicative jump (collapse) structure to model the capital of a household. It is assumed that, when a household's capital level is above a certain capital barrier level that determines a household's eligibility for a capital cash transfer programme, its capital grows exponentially. As soon as its capital falls below the capital barrier level, the capital dynamics incorporate external support in the form of direct transfers (capital cash transfers) provided by donors or governments. Otherwise
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#20855;&#26377;&#24207;&#20559;&#22909;&#30340;&#31038;&#20250;&#36873;&#25321;&#29702;&#35770;&#20013;&#30340;&#21487;&#38450;&#24481;&#38598;&#21512;&#65292;&#35777;&#26126;&#20102;&#28385;&#36275;&#27491;&#21442;&#19982;&#24230;&#21644;&#24247;&#22810;&#22622;&#33719;&#32988;&#32773;&#20934;&#21017;&#30340;&#25237;&#31080;&#26041;&#27861;&#20250;&#23436;&#21892;&#35813;&#38598;&#21512;&#65292;&#28982;&#21518;&#36890;&#36807;&#24341;&#29702;&#35777;&#26126;&#20102;&#19968;&#20010;&#19981;&#21487;&#33021;&#23450;&#29702;&#65292;&#21363;&#27809;&#26377;&#19968;&#31181;&#25237;&#31080;&#26041;&#27861;&#33021;&#21516;&#26102;&#28385;&#36275;&#24247;&#22810;&#22622;&#36755;&#25481;&#32773;&#20934;&#21017;&#12289;&#21487;&#35299;&#24615;&#21644;&#24247;&#22810;&#22622;&#26041;&#27861;&#30340;&#26222;&#36941;&#19981;&#21464;&#24615;&#23646;&#24615;&#12290;</title><link>http://arxiv.org/abs/2401.05657</link><description>&lt;p&gt;
&#25237;&#31080;&#20013;&#30340;&#21487;&#38450;&#24481;&#38598;&#21512;&#21644;&#19968;&#20010;&#26032;&#30340;&#19981;&#21487;&#33021;&#23450;&#29702;
&lt;/p&gt;
&lt;p&gt;
The defensible set and a new impossibility theorem in voting. (arXiv:2401.05657v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.05657
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#20855;&#26377;&#24207;&#20559;&#22909;&#30340;&#31038;&#20250;&#36873;&#25321;&#29702;&#35770;&#20013;&#30340;&#21487;&#38450;&#24481;&#38598;&#21512;&#65292;&#35777;&#26126;&#20102;&#28385;&#36275;&#27491;&#21442;&#19982;&#24230;&#21644;&#24247;&#22810;&#22622;&#33719;&#32988;&#32773;&#20934;&#21017;&#30340;&#25237;&#31080;&#26041;&#27861;&#20250;&#23436;&#21892;&#35813;&#38598;&#21512;&#65292;&#28982;&#21518;&#36890;&#36807;&#24341;&#29702;&#35777;&#26126;&#20102;&#19968;&#20010;&#19981;&#21487;&#33021;&#23450;&#29702;&#65292;&#21363;&#27809;&#26377;&#19968;&#31181;&#25237;&#31080;&#26041;&#27861;&#33021;&#21516;&#26102;&#28385;&#36275;&#24247;&#22810;&#22622;&#36755;&#25481;&#32773;&#20934;&#21017;&#12289;&#21487;&#35299;&#24615;&#21644;&#24247;&#22810;&#22622;&#26041;&#27861;&#30340;&#26222;&#36941;&#19981;&#21464;&#24615;&#23646;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#20855;&#26377;&#24207;&#20559;&#22909;&#30340;&#31038;&#20250;&#36873;&#25321;&#29702;&#35770;&#32972;&#26223;&#19979;&#65292;&#25105;&#20204;&#31216;&#21487;&#38450;&#24481;&#38598;&#21512;&#20026;&#37027;&#20123;&#23545;&#20110;&#20219;&#20309;&#26367;&#20195;&#26041;&#26696;$x$&#65292;&#22914;&#26524;$y$&#22312;&#20004;&#20004;&#23545;&#27604;&#20013;&#20987;&#36133;$x$&#65292;&#21017;&#23384;&#22312;&#19968;&#20010;&#26367;&#20195;&#26041;&#26696;$z$&#65292;&#23427;&#22312;&#20004;&#20004;&#23545;&#27604;&#20013;&#20197;&#33267;&#23569;&#19982;$y$&#20987;&#36133;$x$&#30340;&#38388;&#38548;&#19968;&#26679;&#22823;&#30340;&#38388;&#38548;&#20987;&#36133;$y$&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#28385;&#36275;&#20004;&#20010;&#24050;&#30693;&#20844;&#29702;&#65288;&#27491;&#21442;&#19982;&#24230;&#21644;&#24247;&#22810;&#22622;&#33719;&#32988;&#32773;&#20934;&#21017;&#65289;&#30340;&#24207;&#27425;&#25237;&#31080;&#26041;&#27861;&#20250;&#23436;&#21892;&#21487;&#38450;&#24481;&#38598;&#21512;&#12290;&#21033;&#29992;&#36825;&#20010;&#24341;&#29702;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#19968;&#20010;&#19981;&#21487;&#33021;&#23450;&#29702;&#65306;&#27809;&#26377;&#19968;&#31181;&#21516;&#26102;&#36824;&#28385;&#36275;&#24247;&#22810;&#22622;&#36755;&#25481;&#32773;&#20934;&#21017;&#12289;&#21487;&#35299;&#24615;&#21644;&#24247;&#22810;&#22622;&#26041;&#27861;&#30340;&#26222;&#36941;&#19981;&#21464;&#24615;&#23646;&#24615;&#65292;&#21363;&#20915;&#32988;&#32773;&#30340;&#36873;&#25321;&#21482;&#21462;&#20915;&#20110;&#22810;&#25968;&#36793;&#38469;&#30340;&#30456;&#23545;&#22823;&#23567;&#30340;&#25237;&#31080;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
In the context of social choice theory with ordinal preferences, we say that the defensible set is the set of alternatives $x$ such that for any alternative $y$, if $y$ beats $x$ in a head-to-head majority comparison, then there is an alternative $z$ that beats $y$ in a head-to-head majority comparison by a margin at least as large as the margin by which $y$ beat $x$. We show that any ordinal voting method satisfying two well-known axioms from voting theory--positive involvement and the Condorcet winner criterion--refines the defensible set. Using this lemma, we prove an impossibility theorem: there is no such voting method that also satisfies the Condorcet loser criterion, resolvability, and a common invariance property for Condorcet methods, namely that the choice of winners depends only on the relative sizes of majority margins.
&lt;/p&gt;</description></item><item><title>&#36825;&#37324;&#26159;&#20013;&#25991;&#24635;&#32467;&#20986;&#30340;&#19968;&#21477;&#35805;&#35201;&#28857;&#65306;&#26412;&#30740;&#31350;&#20998;&#26512;&#20102;20&#19990;&#32426;&#21021;&#19996;&#20140;&#24037;&#20154;&#23478;&#24237;&#20013;&#30340;&#39118;&#38505;&#24212;&#23545;&#34892;&#20026;&#65292;&#21457;&#29616;&#20449;&#29992;&#36141;&#20080;&#23545;&#24179;&#28369;&#30701;&#26399;&#39135;&#21697;&#28040;&#36153;&#36215;&#21040;&#19968;&#23450;&#20316;&#29992;&#65292;&#24182;&#21457;&#29616;&#20102;&#25968;&#25454;&#32858;&#21512;&#20013;&#26085;&#26399;&#38169;&#35823;&#20998;&#37197;&#23548;&#33268;&#30340;&#20559;&#24046;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2311.14320</link><description>&lt;p&gt;
&#36825;&#37324;&#26159;&#32763;&#35793;&#36807;&#30340;&#35770;&#25991;&#26631;&#39064;&#65306;&#22823;&#37117;&#24066;&#20013;&#30340;&#28040;&#36153;&#24179;&#28369;&#21270;&#65306;&#25112;&#21069;&#19996;&#20140;&#24037;&#20154;&#38454;&#32423;&#23478;&#24237;&#30340;&#35777;&#25454;
&lt;/p&gt;
&lt;p&gt;
Consumption Smoothing in Metropolis: Evidence from the Working-class Households in Prewar Tokyo. (arXiv:2311.14320v3 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2311.14320
&lt;/p&gt;
&lt;p&gt;
&#36825;&#37324;&#26159;&#20013;&#25991;&#24635;&#32467;&#20986;&#30340;&#19968;&#21477;&#35805;&#35201;&#28857;&#65306;&#26412;&#30740;&#31350;&#20998;&#26512;&#20102;20&#19990;&#32426;&#21021;&#19996;&#20140;&#24037;&#20154;&#23478;&#24237;&#20013;&#30340;&#39118;&#38505;&#24212;&#23545;&#34892;&#20026;&#65292;&#21457;&#29616;&#20449;&#29992;&#36141;&#20080;&#23545;&#24179;&#28369;&#30701;&#26399;&#39135;&#21697;&#28040;&#36153;&#36215;&#21040;&#19968;&#23450;&#20316;&#29992;&#65292;&#24182;&#21457;&#29616;&#20102;&#25968;&#25454;&#32858;&#21512;&#20013;&#26085;&#26399;&#38169;&#35823;&#20998;&#37197;&#23548;&#33268;&#30340;&#20559;&#24046;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20998;&#26512;&#20102;20&#19990;&#32426;&#21021;&#19996;&#20140;&#30340;&#24037;&#21378;&#24037;&#20154;&#23478;&#24237;&#20013;&#30340;&#39118;&#38505;&#24212;&#23545;&#34892;&#20026;&#12290;&#25105;&#25968;&#23383;&#21270;&#20102;&#19968;&#20221;&#20851;&#20110;&#23478;&#24237;&#39044;&#31639;&#30340;&#29420;&#29305;&#30340;&#26085;&#24120;&#32437;&#21521;&#35843;&#26597;&#25968;&#25454;&#38598;&#65292;&#20197;&#32771;&#23519;&#20010;&#20307;&#20914;&#20987;&#23545;&#28040;&#36153;&#30340;&#24433;&#21709;&#31243;&#24230;&#12290;&#25105;&#21457;&#29616;&#65292;&#23613;&#31649;&#23478;&#24237;&#38750;&#24120;&#33030;&#24369;&#65292;&#20914;&#20987;&#24433;&#21709;&#20102;&#20182;&#20204;&#30340;&#28040;&#36153;&#27700;&#24179;&#65292;&#20294;&#39135;&#21697;&#28040;&#36153;&#30340;&#25910;&#20837;&#24377;&#24615;&#22312;&#30701;&#26399;&#20869;&#30456;&#23545;&#36739;&#20302;&#12290;&#26426;&#21046;&#20998;&#26512;&#30340;&#32467;&#26524;&#34920;&#26126;&#65292;&#20449;&#29992;&#36141;&#20080;&#22312;&#24179;&#28369;&#30701;&#26399;&#39135;&#21697;&#28040;&#36153;&#26041;&#38754;&#36215;&#21040;&#20102;&#19968;&#23450;&#20316;&#29992;&#12290;&#20351;&#29992;&#19981;&#33391;&#20581;&#24247;&#20914;&#20987;&#20316;&#20026;&#20010;&#20307;&#25910;&#20837;&#20914;&#20987;&#30340;&#20107;&#20214;&#30740;&#31350;&#20998;&#26512;&#35777;&#23454;&#20102;&#32467;&#26524;&#30340;&#31283;&#20581;&#24615;&#12290;&#25105;&#36824;&#21457;&#29616;&#35777;&#25454;&#34920;&#26126;&#65292;&#22312;&#25968;&#25454;&#32858;&#21512;&#20013;&#24037;&#36164;&#25903;&#20184;&#26085;&#26399;&#30340;&#38169;&#35823;&#20998;&#37197;&#23548;&#33268;&#20102;&#30001;&#20110;&#27979;&#37327;&#35823;&#24046;&#32780;&#20986;&#29616;&#31995;&#32479;&#24615;&#30340;&#20943;&#23569;&#20559;&#24046;&#12290;
&lt;/p&gt;
&lt;p&gt;
I analyze the risk-coping behaviors among factory worker households in early 20th-century Tokyo. I digitize a unique daily longitudinal survey dataset on household budgets to examine the extent to which consumption is affected by idiosyncratic shocks. I find that while the households were so vulnerable that the shocks impacted their consumption levels, the income elasticity for food consumption is relatively low in the short-run perspective. The result from mechanism analysis suggests that credit purchases played a role in smoothing the short-run food consumption. The event-study analysis using the adverse health shock as the idiosyncratic income shock confirms the robustness of the results. I also find evidence that the misassignment of payday in data aggregation results in a systematic attenuation bias due to measurement error.
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;&#21152;&#26435;&#35757;&#32451;&#30340;&#26041;&#27861;&#65292;&#29992;&#20110;&#35299;&#20915;A/B&#27979;&#35797;&#20013;&#30001;&#25968;&#25454;&#35757;&#32451;&#24490;&#29615;&#24341;&#36215;&#30340;&#24178;&#25200;&#12290;&#35813;&#26041;&#27861;&#36890;&#36807;&#35757;&#32451;&#27169;&#22411;&#39044;&#27979;&#27599;&#20010;&#25968;&#25454;&#28857;&#22312;&#23454;&#39564;&#32452;&#25110;&#25511;&#21046;&#32452;&#20013;&#20986;&#29616;&#30340;&#27010;&#29575;&#65292;&#24182;&#22312;&#27169;&#22411;&#35757;&#32451;&#36807;&#31243;&#20013;&#24212;&#29992;&#21152;&#26435;&#25439;&#22833;&#65292;&#20174;&#32780;&#23454;&#29616;&#20102;&#26368;&#23567;&#26041;&#24046;&#30340;&#20272;&#35745;&#32467;&#26524;&#65292;&#24182;&#19988;&#19981;&#20250;&#24341;&#36215;&#35757;&#32451;&#20998;&#24067;&#30340;&#21464;&#21270;&#12290;</title><link>http://arxiv.org/abs/2310.17496</link><description>&lt;p&gt;
&#35299;&#20915;A/B&#27979;&#35797;&#20013;&#25968;&#25454;&#35757;&#32451;&#24490;&#29615;&#24341;&#36215;&#30340;&#24178;&#25200;&#65306;&#19968;&#31181;&#21152;&#26435;&#35757;&#32451;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Tackling Interference Induced by Data Training Loops in A/B Tests: A Weighted Training Approach. (arXiv:2310.17496v1 [stat.ME])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.17496
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;&#21152;&#26435;&#35757;&#32451;&#30340;&#26041;&#27861;&#65292;&#29992;&#20110;&#35299;&#20915;A/B&#27979;&#35797;&#20013;&#30001;&#25968;&#25454;&#35757;&#32451;&#24490;&#29615;&#24341;&#36215;&#30340;&#24178;&#25200;&#12290;&#35813;&#26041;&#27861;&#36890;&#36807;&#35757;&#32451;&#27169;&#22411;&#39044;&#27979;&#27599;&#20010;&#25968;&#25454;&#28857;&#22312;&#23454;&#39564;&#32452;&#25110;&#25511;&#21046;&#32452;&#20013;&#20986;&#29616;&#30340;&#27010;&#29575;&#65292;&#24182;&#22312;&#27169;&#22411;&#35757;&#32451;&#36807;&#31243;&#20013;&#24212;&#29992;&#21152;&#26435;&#25439;&#22833;&#65292;&#20174;&#32780;&#23454;&#29616;&#20102;&#26368;&#23567;&#26041;&#24046;&#30340;&#20272;&#35745;&#32467;&#26524;&#65292;&#24182;&#19988;&#19981;&#20250;&#24341;&#36215;&#35757;&#32451;&#20998;&#24067;&#30340;&#21464;&#21270;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#29616;&#20195;&#25512;&#33616;&#31995;&#32479;&#20013;&#65292;&#26631;&#20934;&#27969;&#31243;&#28041;&#21450;&#20351;&#29992;&#21382;&#21490;&#25968;&#25454;&#35757;&#32451;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#26469;&#39044;&#27979;&#29992;&#25143;&#34892;&#20026;&#24182;&#25345;&#32493;&#25913;&#36827;&#25512;&#33616;&#12290;&#28982;&#32780;&#65292;&#36825;&#20123;&#25968;&#25454;&#35757;&#32451;&#24490;&#29615;&#21487;&#33021;&#22312;A/B&#27979;&#35797;&#20013;&#24341;&#20837;&#24178;&#25200;&#65292;&#20854;&#20013;&#25511;&#21046;&#32452;&#21644;&#23454;&#39564;&#32452;&#31639;&#27861;&#29983;&#25104;&#30340;&#25968;&#25454;&#65292;&#21487;&#33021;&#20855;&#26377;&#19981;&#21516;&#30340;&#20998;&#24067;&#65292;&#34987;&#21512;&#24182;&#22312;&#19968;&#36215;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20123;&#25361;&#25112;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#26041;&#27861;&#65292;&#31216;&#20026;&#21152;&#26435;&#35757;&#32451;&#12290;&#35813;&#26041;&#27861;&#21253;&#25324;&#35757;&#32451;&#19968;&#20010;&#27169;&#22411;&#26469;&#39044;&#27979;&#27599;&#20010;&#25968;&#25454;&#28857;&#20986;&#29616;&#22312;&#23454;&#39564;&#32452;&#25110;&#25511;&#21046;&#32452;&#25968;&#25454;&#20013;&#30340;&#27010;&#29575;&#65292;&#24182;&#22312;&#27169;&#22411;&#35757;&#32451;&#36807;&#31243;&#20013;&#24212;&#29992;&#21152;&#26435;&#25439;&#22833;&#12290;&#25105;&#20204;&#36890;&#36807;&#27169;&#25311;&#30740;&#31350;&#35777;&#26126;&#20102;&#36825;&#31181;&#26041;&#27861;&#22312;&#25152;&#26377;&#20272;&#35745;&#37327;&#20013;&#20855;&#26377;&#26368;&#23567;&#30340;&#26041;&#24046;&#65292;&#19988;&#19981;&#20250;&#23548;&#33268;&#35757;&#32451;&#20998;&#24067;&#21457;&#29983;&#21464;&#21270;&#12290;&#25105;&#20204;&#36890;&#36807;&#27169;&#25311;&#30740;&#31350;&#35777;&#26126;&#20102;&#19982;&#20854;&#20182;&#26041;&#27861;&#30456;&#27604;&#65292;&#25105;&#20204;&#30340;&#26041;&#27861;&#20855;&#26377;&#36739;&#20302;&#30340;&#20559;&#24046;&#21644;&#26041;&#24046;&#12290;
&lt;/p&gt;
&lt;p&gt;
In modern recommendation systems, the standard pipeline involves training machine learning models on historical data to predict user behaviors and improve recommendations continuously. However, these data training loops can introduce interference in A/B tests, where data generated by control and treatment algorithms, potentially with different distributions, are combined. To address these challenges, we introduce a novel approach called weighted training. This approach entails training a model to predict the probability of each data point appearing in either the treatment or control data and subsequently applying weighted losses during model training. We demonstrate that this approach achieves the least variance among all estimators without causing shifts in the training distributions. Through simulation studies, we demonstrate the lower bias and variance of our approach compared to other methods.
&lt;/p&gt;</description></item><item><title>RealFM &#26159;&#19968;&#20010;&#30495;&#23454;&#30340;&#32852;&#37030;&#26426;&#21046;&#65292;&#26088;&#22312;&#35299;&#20915;&#29616;&#23454;&#29615;&#22659;&#20013;&#32852;&#37030;&#23398;&#20064;&#20013;&#30340;&#39547;&#27850;&#32773;&#38382;&#39064;&#65292;&#36890;&#36807;&#27169;&#25311;&#35774;&#22791;&#25928;&#29992;&#12289;&#28608;&#21169;&#25968;&#25454;&#36129;&#29486;&#21644;&#35774;&#22791;&#21442;&#19982;&#65292;&#24182;&#25552;&#20379;&#20102;&#38750;&#32447;&#24615;&#20851;&#31995;&#30340;&#27169;&#22411;&#20934;&#30830;&#24615;&#21644;&#25928;&#29992;&#65292;&#20174;&#32780;&#25913;&#21892;&#20102;&#26381;&#21153;&#22120;&#21644;&#35774;&#22791;&#30340;&#25928;&#29992;&#21644;&#25968;&#25454;&#36129;&#29486;&#12290;</title><link>http://arxiv.org/abs/2310.13681</link><description>&lt;p&gt;
RealFM: &#19968;&#20010;&#30495;&#23454;&#26426;&#21046;&#65292;&#28608;&#21169;&#25968;&#25454;&#36129;&#29486;&#21644;&#35774;&#22791;&#21442;&#19982;
&lt;/p&gt;
&lt;p&gt;
RealFM: A Realistic Mechanism to Incentivize Data Contribution and Device Participation. (arXiv:2310.13681v1 [cs.GT])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.13681
&lt;/p&gt;
&lt;p&gt;
RealFM &#26159;&#19968;&#20010;&#30495;&#23454;&#30340;&#32852;&#37030;&#26426;&#21046;&#65292;&#26088;&#22312;&#35299;&#20915;&#29616;&#23454;&#29615;&#22659;&#20013;&#32852;&#37030;&#23398;&#20064;&#20013;&#30340;&#39547;&#27850;&#32773;&#38382;&#39064;&#65292;&#36890;&#36807;&#27169;&#25311;&#35774;&#22791;&#25928;&#29992;&#12289;&#28608;&#21169;&#25968;&#25454;&#36129;&#29486;&#21644;&#35774;&#22791;&#21442;&#19982;&#65292;&#24182;&#25552;&#20379;&#20102;&#38750;&#32447;&#24615;&#20851;&#31995;&#30340;&#27169;&#22411;&#20934;&#30830;&#24615;&#21644;&#25928;&#29992;&#65292;&#20174;&#32780;&#25913;&#21892;&#20102;&#26381;&#21153;&#22120;&#21644;&#35774;&#22791;&#30340;&#25928;&#29992;&#21644;&#25968;&#25454;&#36129;&#29486;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36793;&#32536;&#35774;&#22791;&#21442;&#19982;&#32852;&#37030;&#23398;&#20064;&#65288;FL&#65289;&#36890;&#24120;&#22312;&#35774;&#22791;-&#26381;&#21153;&#22120;&#36890;&#20449;&#30340;&#35270;&#35282;&#19979;&#36827;&#34892;&#30740;&#31350;&#65288;&#20363;&#22914;&#35774;&#22791;&#25481;&#32447;&#65289;&#65292;&#24182;&#20551;&#35774;&#36793;&#32536;&#35774;&#22791;&#26377;&#25345;&#32493;&#21442;&#19982;FL&#30340;&#24895;&#26395;&#12290;&#22240;&#27492;&#65292;&#22312;&#23454;&#38469;&#29615;&#22659;&#20013;&#23454;&#26045;&#24403;&#21069;&#30340;FL&#26694;&#26550;&#23384;&#22312;&#32570;&#38519;&#65292;&#35768;&#22810;&#26694;&#26550;&#36935;&#21040;&#20102;&#39547;&#27850;&#32773;&#38382;&#39064;&#12290;&#20026;&#20102;&#23558;FL&#25512;&#21521;&#26356;&#30495;&#23454;&#30340;&#29615;&#22659;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;RealFM&#65306;&#31532;&#19968;&#20010;&#30495;&#27491;&#30340;&#32852;&#37030;&#26426;&#21046;&#65292;&#23427;&#65288;1&#65289;&#23454;&#38469;&#22320;&#27169;&#25311;&#35774;&#22791;&#25928;&#29992;&#65292;&#65288;2&#65289;&#28608;&#21169;&#25968;&#25454;&#36129;&#29486;&#21644;&#35774;&#22791;&#21442;&#19982;&#65292;&#65288;3&#65289;&#21487;&#35777;&#26126;&#22320;&#28040;&#38500;&#20102;&#39547;&#27850;&#32773;&#29616;&#35937;&#12290;RealFM&#19981;&#38656;&#35201;&#25968;&#25454;&#20849;&#20139;&#65292;&#24182;&#20801;&#35768;&#27169;&#22411;&#20934;&#30830;&#24615;&#21644;&#25928;&#29992;&#20043;&#38388;&#23384;&#22312;&#38750;&#32447;&#24615;&#20851;&#31995;&#65292;&#30456;&#27604;&#20110;&#19981;&#21442;&#19982;&#21644;&#20854;&#20182;FL&#26426;&#21046;&#30340;&#35774;&#22791;&#65292;&#25552;&#39640;&#20102;&#26381;&#21153;&#22120;&#21644;&#21442;&#19982;&#35774;&#22791;&#30340;&#25928;&#29992;&#21644;&#25968;&#25454;&#36129;&#29486;&#12290;&#22312;&#30495;&#23454;&#25968;&#25454;&#19978;&#65292;RealFM&#25552;&#39640;&#20102;&#35774;&#22791;&#21644;&#26381;&#21153;&#22120;&#30340;&#25928;&#29992;&#20197;&#21450;&#25968;&#25454;&#36129;&#29486;&#65292;&#26368;&#22810;&#21487;&#36798;...
&lt;/p&gt;
&lt;p&gt;
Edge device participation in federating learning (FL) has been typically studied under the lens of device-server communication (e.g., device dropout) and assumes an undying desire from edge devices to participate in FL. As a result, current FL frameworks are flawed when implemented in real-world settings, with many encountering the free-rider problem. In a step to push FL towards realistic settings, we propose RealFM: the first truly federated mechanism which (1) realistically models device utility, (2) incentivizes data contribution and device participation, and (3) provably removes the free-rider phenomena. RealFM does not require data sharing and allows for a non-linear relationship between model accuracy and utility, which improves the utility gained by the server and participating devices compared to non-participating devices as well as devices participating in other FL mechanisms. On real-world data, RealFM improves device and server utility, as well as data contribution, by up t
&lt;/p&gt;</description></item><item><title>&#20154;&#24037;&#26234;&#33021;&#22312;&#37329;&#34701;&#30417;&#31649;&#26041;&#38754;&#30340;&#24212;&#29992;&#26377;&#21161;&#20110;&#24494;&#35266;&#30417;&#31649;&#65292;&#20294;&#23545;&#20110;&#23439;&#35266;&#30417;&#31649;&#26469;&#35828;&#23384;&#22312;&#25361;&#25112;&#12290;&#23613;&#31649;&#22914;&#27492;&#65292;&#30001;&#20110;&#25104;&#26412;&#25928;&#30410;&#21644;&#20934;&#30830;&#24615;&#30340;&#20248;&#21183;&#65292;AI&#24456;&#21487;&#33021;&#21462;&#20195;&#39640;&#27700;&#24179;&#30340;&#24314;&#35758;&#21644;&#20915;&#31574;&#12290;</title><link>http://arxiv.org/abs/2310.11293</link><description>&lt;p&gt;
&#20851;&#20110;&#20154;&#24037;&#26234;&#33021;&#22312;&#37329;&#34701;&#30417;&#31649;&#20013;&#30340;&#24212;&#29992;&#21450;&#23545;&#37329;&#34701;&#31283;&#23450;&#30340;&#24433;&#21709;
&lt;/p&gt;
&lt;p&gt;
On the use of artificial intelligence in financial regulations and the impact on financial stability. (arXiv:2310.11293v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.11293
&lt;/p&gt;
&lt;p&gt;
&#20154;&#24037;&#26234;&#33021;&#22312;&#37329;&#34701;&#30417;&#31649;&#26041;&#38754;&#30340;&#24212;&#29992;&#26377;&#21161;&#20110;&#24494;&#35266;&#30417;&#31649;&#65292;&#20294;&#23545;&#20110;&#23439;&#35266;&#30417;&#31649;&#26469;&#35828;&#23384;&#22312;&#25361;&#25112;&#12290;&#23613;&#31649;&#22914;&#27492;&#65292;&#30001;&#20110;&#25104;&#26412;&#25928;&#30410;&#21644;&#20934;&#30830;&#24615;&#30340;&#20248;&#21183;&#65292;AI&#24456;&#21487;&#33021;&#21462;&#20195;&#39640;&#27700;&#24179;&#30340;&#24314;&#35758;&#21644;&#20915;&#31574;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20154;&#24037;&#26234;&#33021;&#65288;AI&#65289;&#27491;&#22312;&#37329;&#34701;&#30417;&#31649;&#39046;&#22495;&#36805;&#36895;&#21457;&#23637;&#12290;&#23545;&#20110;&#24494;&#35266;&#30417;&#31649;&#65288;&#22914;&#28040;&#36153;&#32773;&#20445;&#25252;&#21644;&#24120;&#35268;&#38134;&#34892;&#30417;&#31649;&#65289;&#26469;&#35828;&#65292;&#30001;&#20110;&#25968;&#25454;&#20016;&#23500;&#12289;&#26102;&#38388;&#21608;&#26399;&#30701;&#12289;&#30446;&#26631;&#26126;&#30830;&#21644;&#37325;&#22797;&#20915;&#31574;&#65292;AI&#23558;&#21463;&#30410;&#12290;&#28982;&#32780;&#65292;&#23545;&#20110;&#20851;&#27880;&#25972;&#20010;&#37329;&#34701;&#31995;&#32479;&#31283;&#23450;&#30340;&#23439;&#35266;&#30417;&#31649;&#26469;&#35828;&#65292;&#30001;&#20110;&#19981;&#32463;&#24120;&#21457;&#29983;&#19988;&#22823;&#22810;&#25968;&#26159;&#29420;&#29305;&#20107;&#20214;&#65292;AI&#23398;&#20064;&#21463;&#21040;&#25361;&#25112;&#12290;&#22312;&#26497;&#24230;&#21387;&#21147;&#19979;&#65292;&#20998;&#24067;&#24335;&#30340;&#20154;&#31867;&#20915;&#31574;&#27604;&#38598;&#20013;&#24335;&#30340;AI&#20915;&#31574;&#26356;&#20855;&#20248;&#21183;&#65292;&#32780;&#19988;&#30001;&#20110;&#24040;&#22823;&#30340;&#38169;&#35823;&#25104;&#26412;&#65292;&#36825;&#20063;&#24341;&#21457;&#20102;&#23545;&#20110;&#23439;&#35266;&#30417;&#31649;&#20013;AI&#20351;&#29992;&#30340;&#36136;&#30097;&#12290;&#23613;&#31649;&#22914;&#27492;&#65292;&#30001;&#20110;&#25104;&#26412;&#25928;&#30410;&#12289;&#31283;&#20581;&#24615;&#21644;&#20934;&#30830;&#24615;&#20248;&#20110;&#20154;&#31867;&#30417;&#31649;&#32773;&#65292;AI&#24456;&#21487;&#33021;&#24708;&#28982;&#21462;&#20195;&#36234;&#26469;&#36234;&#39640;&#27700;&#24179;&#30340;&#24314;&#35758;&#21644;&#20915;&#31574;&#32780;&#34987;&#24191;&#27867;&#20351;&#29992;&#12290;&#25105;&#20204;&#25552;&#20986;&#20845;&#20010;&#21028;&#26029;AI&#20351;&#29992;&#36866;&#21512;&#24615;&#30340;&#26631;&#20934;&#12290;
&lt;/p&gt;
&lt;p&gt;
Artificial intelligence (AI) is making rapid inroads in financial regulations. It will benefit micro regulations, concerned with issues like consumer protection and routine banking regulations, because of ample data, short time horizons, clear objectives, and repeated decisions that leave plenty of data for AI to train on. It is different with macro regulations focused on the stability of the entire financial system. Here, infrequent and mostly unique events frustrate AI learning. Distributed human decision making in times of extreme stress has strong advantages over centralised AI decisions, which, coupled with the catastrophic cost of mistakes, raises questions about AI used in macro regulations. However, AI will likely become widely used by stealth as it takes over increasingly high level advice and decisions, driven by significant cost efficiencies, robustness and accuracy compared to human regulators. We propose six criteria against which to judge the suitability of AI use by the 
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#20351;&#29992;&#23457;&#35745;&#26041;&#27861;&#25506;&#32034;&#20102;ChatGPT&#22312;&#27714;&#32844;&#32773;&#31579;&#36873;&#20013;&#30340;&#31995;&#32479;&#20559;&#35265;&#65292;&#30740;&#31350;&#21457;&#29616;&#35821;&#35328;&#25552;&#31034;&#21644;&#30003;&#35831;&#32773;&#22995;&#21517;&#20013;&#30340;&#31181;&#26063;&#36523;&#20221;&#32447;&#32034;&#20250;&#24433;&#21709;ChatGPT&#30340;&#35780;&#20272;&#12290;</title><link>http://arxiv.org/abs/2309.07664</link><description>&lt;p&gt;
&#35745;&#31639;&#26426;&#35828;&#8220;&#19981;&#34892;&#8221;: &#20351;&#29992;&#23457;&#35745;&#26041;&#27861;&#25506;&#32034;ChatGPT&#20013;&#30340;&#31995;&#32479;&#25307;&#32856;&#20559;&#35265;
&lt;/p&gt;
&lt;p&gt;
Computer says 'no': Exploring systemic hiring bias in ChatGPT using an audit approach. (arXiv:2309.07664v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.07664
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#20351;&#29992;&#23457;&#35745;&#26041;&#27861;&#25506;&#32034;&#20102;ChatGPT&#22312;&#27714;&#32844;&#32773;&#31579;&#36873;&#20013;&#30340;&#31995;&#32479;&#20559;&#35265;&#65292;&#30740;&#31350;&#21457;&#29616;&#35821;&#35328;&#25552;&#31034;&#21644;&#30003;&#35831;&#32773;&#22995;&#21517;&#20013;&#30340;&#31181;&#26063;&#36523;&#20221;&#32447;&#32034;&#20250;&#24433;&#21709;ChatGPT&#30340;&#35780;&#20272;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#22312;&#20248;&#21270;&#32844;&#19994;&#27963;&#21160;&#26041;&#38754;&#20855;&#26377;&#37325;&#35201;&#28508;&#21147;&#65292;&#22914;&#31616;&#21270;&#20154;&#21592;&#36873;&#25300;&#31243;&#24207;&#12290;&#28982;&#32780;&#65292;&#20154;&#20204;&#25285;&#24515;&#36825;&#20123;&#27169;&#22411;&#20250;&#24310;&#32493;&#39044;&#35757;&#32451;&#25968;&#25454;&#20013;&#23884;&#20837;&#30340;&#31995;&#32479;&#20559;&#35265;&#12290;&#36825;&#39033;&#30740;&#31350;&#25506;&#35752;&#20102;ChatGPT&#22312;&#27714;&#32844;&#32773;&#31579;&#36873;&#26041;&#38754;&#26159;&#21542;&#34920;&#29616;&#20986;&#31181;&#26063;&#25110;&#24615;&#21035;&#20559;&#35265;&#65292;ChatGPT&#26159;&#19968;&#20010;&#33021;&#22815;&#29983;&#25104;&#31867;&#20284;&#20154;&#31867;&#22238;&#24212;&#30340;&#32842;&#22825;&#26426;&#22120;&#20154;&#12290;&#36890;&#36807;&#20351;&#29992;&#19968;&#31181;&#36890;&#20449;&#23457;&#35745;&#26041;&#27861;&#65292;&#25105;&#27169;&#25311;&#20102;&#19968;&#20010;&#31616;&#21382;&#31579;&#36873;&#20219;&#21153;&#65292;&#25351;&#31034;&#32842;&#22825;&#26426;&#22120;&#20154;&#35780;&#20215;&#34394;&#26500;&#30340;&#30003;&#35831;&#32773;&#31616;&#21382;&#65292;&#36825;&#20123;&#31616;&#21382;&#21482;&#26377;&#21517;&#23383;&#19981;&#21516;&#65292;&#20197;&#26263;&#31034;&#31181;&#26063;&#21644;&#24615;&#21035;&#36523;&#20221;&#12290;&#36890;&#36807;&#27604;&#36739;&#38463;&#25289;&#20271;&#12289;&#20122;&#27954;&#12289;&#32654;&#22269;&#40657;&#20154;&#12289;&#20013;&#38750;&#12289;&#33655;&#20848;&#12289;&#19996;&#27431;&#12289;&#35199;&#29677;&#29273;&#35028;&#12289;&#22303;&#32819;&#20854;&#21644;&#32654;&#22269;&#30333;&#20154;&#30007;&#24615;&#21644;&#22899;&#24615;&#30003;&#35831;&#32773;&#30340;&#35780;&#20998;&#65292;&#25105;&#21457;&#29616;&#31181;&#26063;&#21644;&#24615;&#21035;&#36523;&#20221;&#20250;&#24433;&#21709;ChatGPT&#30340;&#35780;&#20272;&#12290;&#31181;&#26063;&#20559;&#35265;&#20284;&#20046;&#37096;&#20998;&#28304;&#20110;&#25552;&#31034;&#35821;&#35328;&#65292;&#37096;&#20998;&#28304;&#20110;&#30003;&#35831;&#32773;&#22995;&#21517;&#20013;&#30340;&#31181;&#26063;&#36523;&#20221;&#32447;&#32034;&#12290;
&lt;/p&gt;
&lt;p&gt;
Large language models offer significant potential for optimising professional activities, such as streamlining personnel selection procedures. However, concerns exist about these models perpetuating systemic biases embedded into their pre-training data. This study explores whether ChatGPT, a chatbot producing human-like responses to language tasks, displays ethnic or gender bias in job applicant screening. Using a correspondence audit approach, I simulated a CV screening task in which I instructed the chatbot to rate fictitious applicant profiles only differing in names, signalling ethnic and gender identity. Comparing ratings of Arab, Asian, Black American, Central African, Dutch, Eastern European, Hispanic, Turkish, and White American male and female applicants, I show that ethnic and gender identity influence ChatGPT's evaluations. The ethnic bias appears to arise partly from the prompts' language and partly from ethnic identity cues in applicants' names. Although ChatGPT produces n
&lt;/p&gt;</description></item><item><title>&#20013;&#22269;&#21644;&#32654;&#22269;&#22312;&#20840;&#29699;&#31185;&#23398;&#36164;&#37329;&#20013;&#25198;&#28436;&#30528;&#37325;&#35201;&#35282;&#33394;&#65292;&#20013;&#22269;&#22312;&#22269;&#20869;&#21644;&#22269;&#38469;&#36164;&#37329;&#26041;&#38754;&#30340;&#27963;&#21160;&#38750;&#24120;&#24378;&#21170;&#65292;&#32780;&#32654;&#22269;&#21017;&#20445;&#25345;&#30528;&#22823;&#22810;&#25968;&#22269;&#23478;&#30340;&#26368;&#37325;&#35201;&#30740;&#31350;&#21512;&#20316;&#20249;&#20276;&#22320;&#20301;&#12290;</title><link>http://arxiv.org/abs/2308.08630</link><description>&lt;p&gt;
&#20840;&#29699;&#31185;&#23398;&#36164;&#37329;&#30340;&#21512;&#20316;&#19982;&#30456;&#20114;&#20381;&#36182;
&lt;/p&gt;
&lt;p&gt;
Cooperation and interdependence in global science funding. (arXiv:2308.08630v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.08630
&lt;/p&gt;
&lt;p&gt;
&#20013;&#22269;&#21644;&#32654;&#22269;&#22312;&#20840;&#29699;&#31185;&#23398;&#36164;&#37329;&#20013;&#25198;&#28436;&#30528;&#37325;&#35201;&#35282;&#33394;&#65292;&#20013;&#22269;&#22312;&#22269;&#20869;&#21644;&#22269;&#38469;&#36164;&#37329;&#26041;&#38754;&#30340;&#27963;&#21160;&#38750;&#24120;&#24378;&#21170;&#65292;&#32780;&#32654;&#22269;&#21017;&#20445;&#25345;&#30528;&#22823;&#22810;&#25968;&#22269;&#23478;&#30340;&#26368;&#37325;&#35201;&#30740;&#31350;&#21512;&#20316;&#20249;&#20276;&#22320;&#20301;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#30740;&#21457;&#25237;&#36164;&#23545;&#31185;&#23398;&#21644;&#32463;&#27982;&#21457;&#23637;&#20197;&#21450;&#31038;&#20250;&#31119;&#31049;&#33267;&#20851;&#37325;&#35201;&#12290;&#30001;&#20110;&#31185;&#23398;&#30740;&#31350;&#38656;&#35201;&#22823;&#37327;&#36164;&#28304;&#65292;&#22269;&#23478;&#31185;&#23398;&#25237;&#36164;&#26159;&#31185;&#23398;&#20135;&#20986;&#30340;&#37325;&#35201;&#25512;&#21160;&#32773;&#12290;&#38543;&#30528;&#31185;&#23398;&#20135;&#20986;&#26085;&#30410;&#22269;&#38469;&#21270;&#65292;&#30740;&#31350;&#21508;&#22269;&#31185;&#23398;&#27963;&#21160;&#22312;&#22269;&#20869;&#21644;&#22269;&#38469;&#19978;&#30340;&#36164;&#37329;&#26469;&#28304;&#22914;&#20309;&#25104;&#20026;&#19968;&#20010;&#33267;&#20851;&#37325;&#35201;&#30340;&#30740;&#31350;&#35838;&#39064;&#12290;&#36890;&#36807;&#36861;&#36394;&#23398;&#26415;&#35770;&#25991;&#20013;&#24471;&#21040;&#25215;&#35748;&#30340;&#30740;&#31350;&#25320;&#27454;&#65292;&#25105;&#20204;&#30340;&#30740;&#31350;&#25581;&#31034;&#20102;&#20013;&#22269;&#21644;&#32654;&#22269;&#22312;&#20840;&#29699;&#36164;&#37329;&#26684;&#23616;&#20013;&#30340;&#21452;&#22836;&#22404;&#26029;&#65292;&#36164;&#37329;&#27169;&#24335;&#25130;&#28982;&#19981;&#21516;&#12290;&#23613;&#31649;&#20013;&#22269;&#22312;&#22269;&#20869;&#21644;&#22269;&#38469;&#36164;&#37329;&#26041;&#38754;&#30340;&#36164;&#37329;&#27963;&#21160;&#38750;&#24120;&#24378;&#21170;&#65292;&#36229;&#36807;&#20102;&#32654;&#22269;&#65292;&#20294;&#32654;&#22269;&#22312;&#20316;&#20026;&#22823;&#22810;&#25968;&#22269;&#23478;&#26368;&#37325;&#35201;&#30340;&#30740;&#31350;&#21512;&#20316;&#20249;&#20276;&#26041;&#38754;&#20173;&#28982;&#20445;&#25345;&#30528;&#26368;&#37325;&#35201;&#30340;&#22320;&#20301;&#12290;&#25105;&#20204;&#30340;&#32467;&#26524;&#36824;&#20984;&#26174;&#20102;&#20302;&#25910;&#20837;&#21644;&#20013;&#31561;&#25910;&#20837;&#22269;&#23478;&#23545;&#20840;&#29699;&#36164;&#37329;&#20013;&#26029;&#30340;&#19981;&#31283;&#23450;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Research and development investments are key to scientific and economic development and to the well-being of society. Because scientific research demands significant resources, national scientific investment is a crucial driver of scientific production. As scientific production becomes increasingly multinational, it is critically important to study how nations' scientific activities are funded both domestically and internationally. By tracing research grants acknowledged in scholarly publications, our study reveals a duopoly of China and the United States in the global funding landscape, with a contrasting funding pattern; while China has surpassed the United States both in acknowledged domestic and international funding with its strong funding activity for the Chinese institutions, the United States largely maintains its place as the most important research partner for most countries. Our results also highlight the precarity of low- and middle-income countries to global funding disrup
&lt;/p&gt;</description></item><item><title>&#36825;&#39033;&#30740;&#31350;&#21457;&#23637;&#20102;&#19968;&#31181;&#22522;&#20110;&#32479;&#35745;&#36317;&#31163;&#30340;&#26041;&#27861;&#65292;&#25581;&#31034;&#20102;&#29702;&#24819;&#20027;&#20041;&#24605;&#32500;&#30340;&#39118;&#38505;&#24605;&#32500;&#65292;&#25506;&#35752;&#20102;&#29702;&#24819;&#20027;&#20041;&#20915;&#31574;&#32773;&#20559;&#26012;&#21644;&#39118;&#38505;&#36873;&#25321;&#30340;&#20559;&#22909;&#26465;&#20214;&#12290;</title><link>http://arxiv.org/abs/2307.02422</link><description>&lt;p&gt;
&#19968;&#31181;&#22522;&#20110;&#32479;&#35745;&#36317;&#31163;&#30340;&#26041;&#27861;&#25581;&#31034;&#20102;&#29702;&#24819;&#20027;&#20041;&#24605;&#32500;&#30340;&#39118;&#38505;&#24605;&#32500;
&lt;/p&gt;
&lt;p&gt;
Wishful Thinking is Risky Thinking: A Statistical-Distance Based Approach. (arXiv:2307.02422v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.02422
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#30740;&#31350;&#21457;&#23637;&#20102;&#19968;&#31181;&#22522;&#20110;&#32479;&#35745;&#36317;&#31163;&#30340;&#26041;&#27861;&#65292;&#25581;&#31034;&#20102;&#29702;&#24819;&#20027;&#20041;&#24605;&#32500;&#30340;&#39118;&#38505;&#24605;&#32500;&#65292;&#25506;&#35752;&#20102;&#29702;&#24819;&#20027;&#20041;&#20915;&#31574;&#32773;&#20559;&#26012;&#21644;&#39118;&#38505;&#36873;&#25321;&#30340;&#20559;&#22909;&#26465;&#20214;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#21457;&#23637;&#20102;&#19968;&#20010;&#29702;&#24819;&#20027;&#20041;&#24605;&#32500;&#27169;&#22411;&#65292;&#32771;&#34385;&#20102;&#20559;&#35265;&#20449;&#24565;&#30340;&#25104;&#26412;&#21644;&#25910;&#30410;&#12290;&#25105;&#20204;&#24314;&#31435;&#20102;&#25197;&#26354;&#20449;&#24565;&#19982;&#39118;&#38505;&#20043;&#38388;&#30340;&#32852;&#31995;&#65292;&#25581;&#31034;&#20102;&#29702;&#24819;&#20027;&#20041;&#24605;&#32500;&#22914;&#20309;&#20174;&#39118;&#38505;&#24230;&#37327;&#30340;&#35282;&#24230;&#29702;&#35299;&#12290;&#25105;&#20204;&#30340;&#27169;&#22411;&#21253;&#21547;&#26497;&#31471;&#20449;&#24565;&#65292;&#20801;&#35768;&#29702;&#24819;&#20027;&#20041;&#20915;&#31574;&#32773;&#23545;&#19981;&#33391;&#29366;&#24577;&#36171;&#20104;&#38646;&#27010;&#29575;&#65292;&#24182;&#23545;&#20854;&#20182;&#19981;&#21487;&#33021;&#29366;&#24577;&#36171;&#20104;&#27491;&#27010;&#29575;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36824;&#35777;&#26126;&#20102;&#38408;&#20540;&#20449;&#24565;&#25197;&#26354;&#25104;&#26412;&#20989;&#25968;&#31867;&#30340;&#29702;&#24819;&#20027;&#20041;&#24605;&#32500;&#34892;&#20026;&#31561;&#21516;&#20110;&#20998;&#20301;&#25968;&#25928;&#29992;&#26368;&#22823;&#21270;&#12290;&#26368;&#21518;&#65292;&#21033;&#29992;&#36825;&#20010;&#31561;&#20215;&#24615;&#65292;&#25105;&#20204;&#25512;&#23548;&#20986;&#20048;&#35266;&#30340;&#20915;&#31574;&#32773;&#26356;&#21916;&#27426;&#20559;&#26012;&#21644;&#26356;&#20855;&#39118;&#38505;&#30340;&#36873;&#25321;&#30340;&#26465;&#20214;&#12290;
&lt;/p&gt;
&lt;p&gt;
We develop a model of wishful thinking that incorporates the costs and benefits of biased beliefs. We establish the connection between distorted beliefs and risk, revealing how wishful thinking can be understood in terms of risk measures. Our model accommodates extreme beliefs, allowing wishful-thinking decision-makers to assign zero probability to undesirable states and positive probability to otherwise impossible states. Furthermore, we establish that wishful thinking behavior is equivalent to quantile-utility maximization for the class of threshold beliefs distortion cost functions. Finally, exploiting this equivalence, we derive conditions under which an optimistic decision-maker prefers skewed and riskier choices.
&lt;/p&gt;</description></item><item><title>&#30740;&#31350;&#21457;&#29616;&#29983;&#25104;&#24335; AI &#24037;&#20855; ChatGPT &#21487;&#20197;&#26356;&#26377;&#25928;&#22320;&#23637;&#31034;&#32929;&#31080;&#24066;&#22330;&#30456;&#20851;&#20449;&#24687;&#65292;&#25552;&#20986;&#20102;&#20449;&#24687;&#33192;&#32960;&#25351;&#26631;&#24182;&#35777;&#26126;&#20854;&#19982;&#36127;&#38754;&#30340;&#36164;&#26412;&#24066;&#22330;&#21518;&#26524;&#30456;&#20851;&#65292;&#21516;&#26102;&#23637;&#31034;&#20854;&#22312;&#26500;&#24314;&#38024;&#23545;&#24615;&#24635;&#32467;&#26041;&#38754;&#30340;&#25928;&#26524;&#12290;</title><link>http://arxiv.org/abs/2306.10224</link><description>&lt;p&gt;
&#33192;&#32960;&#30340;&#25259;&#38706;&#65306;ChatGPT&#26159;&#21542;&#33021;&#24110;&#21161;&#25237;&#36164;&#32773;&#22788;&#29702;&#36130;&#21153;&#20449;&#24687;&#65311;
&lt;/p&gt;
&lt;p&gt;
Bloated Disclosures: Can ChatGPT Help Investors Process Financial Information?. (arXiv:2306.10224v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.10224
&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#21457;&#29616;&#29983;&#25104;&#24335; AI &#24037;&#20855; ChatGPT &#21487;&#20197;&#26356;&#26377;&#25928;&#22320;&#23637;&#31034;&#32929;&#31080;&#24066;&#22330;&#30456;&#20851;&#20449;&#24687;&#65292;&#25552;&#20986;&#20102;&#20449;&#24687;&#33192;&#32960;&#25351;&#26631;&#24182;&#35777;&#26126;&#20854;&#19982;&#36127;&#38754;&#30340;&#36164;&#26412;&#24066;&#22330;&#21518;&#26524;&#30456;&#20851;&#65292;&#21516;&#26102;&#23637;&#31034;&#20854;&#22312;&#26500;&#24314;&#38024;&#23545;&#24615;&#24635;&#32467;&#26041;&#38754;&#30340;&#25928;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#29983;&#25104;&#24335; AI &#24037;&#20855;&#65288;&#22914; ChatGPT&#65289;&#21487;&#20197;&#20174;&#26681;&#26412;&#19978;&#25913;&#21464;&#25237;&#36164;&#32773;&#22788;&#29702;&#20449;&#24687;&#30340;&#26041;&#24335;&#12290;&#25105;&#20204;&#20351;&#29992;&#32929;&#31080;&#24066;&#22330;&#20316;&#20026;&#23454;&#39564;&#23460;&#65292;&#25506;&#31350;&#36825;&#20123;&#24037;&#20855;&#22312;&#24635;&#32467;&#22797;&#26434;&#30340;&#20844;&#21496;&#25259;&#38706;&#20449;&#24687;&#26102;&#30340;&#32463;&#27982;&#25928;&#29992;&#12290;&#24635;&#32467;&#25688;&#35201;&#26126;&#26174;&#26356;&#30701;&#65292;&#36890;&#24120;&#27604;&#21407;&#22987;&#25991;&#26412;&#32553;&#30701;&#36229;&#36807; 70%&#65292;&#32780;&#20449;&#24687;&#20869;&#23481;&#24471;&#21040;&#22686;&#24378;&#12290;&#24403;&#19968;&#20221;&#25991;&#20214;&#20855;&#26377;&#31215;&#26497;&#65288;&#28040;&#26497;&#65289;&#24773;&#24863;&#26102;&#65292;&#20854;&#24635;&#32467;&#21464;&#24471;&#26356;&#31215;&#26497;&#65288;&#28040;&#26497;&#65289;&#12290;&#26356;&#37325;&#35201;&#30340;&#26159;&#65292;&#24635;&#32467;&#23545;&#35299;&#37322;&#32929;&#24066;&#23545;&#25259;&#38706;&#20449;&#24687;&#30340;&#21453;&#24212;&#26356;&#26377;&#25928;&#12290;&#22522;&#20110;&#36825;&#20123;&#21457;&#29616;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#20449;&#24687;&#8220;&#33192;&#32960;&#8221;&#25351;&#26631;&#12290;&#25105;&#20204;&#26174;&#31034;&#65292;&#33192;&#32960;&#30340;&#25259;&#38706;&#19982;&#36127;&#38754;&#30340;&#36164;&#26412;&#24066;&#22330;&#21518;&#26524;&#30456;&#20851;&#65292;&#20363;&#22914;&#26356;&#20302;&#30340;&#20215;&#26684;&#26377;&#25928;&#24615;&#21644;&#26356;&#39640;&#30340;&#20449;&#24687;&#19981;&#23545;&#31216;&#24615;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#36825;&#20010;&#27169;&#22411;&#22312;&#26500;&#24314;&#38024;&#23545;&#24615;&#24635;&#32467;&#26041;&#38754;&#30340;&#26377;&#25928;&#24615;&#65292;&#20197;&#30830;&#23450;&#20844;&#21496;&#30340;&#65288;&#38750;&#65289;&#36130;&#21153;&#34920;&#29616;&#21644;&#39118;&#38505;&#12290;&#24635;&#20043;&#65292;&#25105;&#20204;&#30340;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;&#20687; ChatGPT &#36825;&#26679;&#30340;&#29983;&#25104;&#24335; AI &#24037;&#20855;&#21487;&#20197;&#26377;&#25928;&#22320;&#24110;&#21161;&#25237;&#36164;&#32773;&#26356;&#39640;&#25928;&#22320;&#22788;&#29702;&#36130;&#21153;&#20449;&#24687;&#12290;
&lt;/p&gt;
&lt;p&gt;
Generative AI tools such as ChatGPT can fundamentally change the way investors process information. We probe the economic usefulness of these tools in summarizing complex corporate disclosures using the stock market as a laboratory. The unconstrained summaries are dramatically shorter, often by more than 70% compared to the originals, whereas their information content is amplified. When a document has a positive (negative) sentiment, its summary becomes more positive (negative). More importantly, the summaries are more effective at explaining stock market reactions to the disclosed information. Motivated by these findings, we propose a measure of information "bloat." We show that bloated disclosure is associated with adverse capital markets consequences, such as lower price efficiency and higher information asymmetry. Finally, we show that the model is effective at constructing targeted summaries that identify firms' (non-)financial performance and risks. Collectively, our results indi
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#37325;&#26032;&#23457;&#35270;&#20102;&#26631;&#20934;&#30340;&#36947;&#24503;&#39118;&#38505;&#27169;&#22411;&#65292;&#25552;&#20986;&#20102;&#20048;&#35266;&#21644;&#36807;&#24230;&#33258;&#20449;&#30340;&#23450;&#20041;&#65292;&#24182;&#34920;&#24449;&#36825;&#20123;&#23450;&#20041;&#19982;&#35813;&#27169;&#22411;&#21442;&#25968;&#30340;&#20851;&#31995;&#12290;</title><link>http://arxiv.org/abs/2304.08343</link><description>&lt;p&gt;
&#20048;&#35266;&#19982;&#36807;&#24230;&#33258;&#20449;&#65288;&#32463;&#27982;&#23398;&#27169;&#22411;&#26041;&#38754;&#65289;
&lt;/p&gt;
&lt;p&gt;
Optimism and overconfidence. (arXiv:2304.08343v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.08343
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#37325;&#26032;&#23457;&#35270;&#20102;&#26631;&#20934;&#30340;&#36947;&#24503;&#39118;&#38505;&#27169;&#22411;&#65292;&#25552;&#20986;&#20102;&#20048;&#35266;&#21644;&#36807;&#24230;&#33258;&#20449;&#30340;&#23450;&#20041;&#65292;&#24182;&#34920;&#24449;&#36825;&#20123;&#23450;&#20041;&#19982;&#35813;&#27169;&#22411;&#21442;&#25968;&#30340;&#20851;&#31995;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#37325;&#26032;&#23457;&#35270;&#20102;&#26631;&#20934;&#36947;&#24503;&#39118;&#38505;&#27169;&#22411;&#65292;&#20854;&#20013;&#20195;&#29702;&#20154;&#23545;&#21512;&#21516;&#30340;&#20559;&#22909;&#28304;&#20110;&#20184;&#20986;&#26114;&#36149;&#30340;&#21162;&#21147;&#36873;&#25321;&#12290;&#20316;&#32773;&#36890;&#36807;&#23454;&#35777;&#26816;&#39564;&#30340;&#20844;&#29702;&#26469;&#34920;&#24449;&#27169;&#22411;&#30340;&#34892;&#20026;&#20869;&#23481;&#65292;&#24182;&#23637;&#31034;&#20102;&#35813;&#27169;&#22411;&#30340;&#21442;&#25968;&#34987;&#35782;&#21035;&#12290;&#20316;&#32773;&#25552;&#20986;&#30456;&#23545;&#65288;&#36807;&#24230;&#65289;&#33258;&#20449;&#21644;&#20048;&#35266;&#20027;&#20041;&#30340;&#19968;&#33324;&#34892;&#20026;&#23450;&#20041;&#65292;&#24182;&#25353;&#36947;&#24503;&#39118;&#38505;&#27169;&#22411;&#30340;&#21442;&#25968;&#26469;&#34920;&#24449;&#36825;&#20123;&#23450;&#20041;&#12290;&#27491;&#24335;&#32467;&#26524;&#22522;&#20110;&#19968;&#20010;&#31616;&#21333;&#32780;&#24378;&#22823;&#30340;&#27934;&#23519;&#21147;&#65306;&#36947;&#24503;&#39118;&#38505;&#27169;&#22411;&#19982;&#20247;&#25152;&#21608;&#30693;&#30340;&#8220;&#21464;&#20998;&#8221;&#19981;&#30830;&#23450;&#24615;&#36873;&#25321;&#27169;&#22411;&#23494;&#20999;&#30456;&#20851;&#12290;
&lt;/p&gt;
&lt;p&gt;
I revisit the standard moral-hazard model, in which an agent's preference over contracts is rooted in costly effort choice. I characterise the behavioural content of the model in terms of empirically testable axioms, and show that the model's parameters are identified. I propose general behavioural definitions of relative (over)confidence and optimism, and characterise these in terms of the parameters of the moral-hazard model. My formal results are rooted in a simple but powerful insight: that the moral-hazard model is closely related to the well-known 'variational' model of choice under uncertainty.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#20998;&#26512;&#20102;&#23545;&#31216;&#31867;&#22411;&#20998;&#24067;&#19979;&#30340;&#22810;&#20154;&#28040;&#32791;&#25112;&#21338;&#24328;&#65292;&#22312;&#21807;&#19968;&#22343;&#34913;&#20013;&#21457;&#29616;&#19981;&#23545;&#31216;&#24615;&#23548;&#33268;&#21442;&#19982;&#32773;&#20998;&#23618;&#34892;&#20026;&#27169;&#24335;&#12290;&#21442;&#19982;&#32773;&#30340;&#32784;&#24515;&#24230;&#12289;&#25552;&#20379;&#25104;&#26412;&#21644;&#20272;&#20540;&#20250;&#24433;&#21709;&#29289;&#21697;&#25552;&#20379;&#30340;&#36895;&#24230;&#12290;&#36890;&#36807;&#25511;&#21046;&#26368;&#24378;&#31867;&#22411;&#21487;&#20197;&#35843;&#33410;&#19981;&#23545;&#31216;&#24615;&#30340;&#25928;&#26524;&#12290;</title><link>http://arxiv.org/abs/2302.09427</link><description>&lt;p&gt;
&#23545;&#31216;&#31169;&#20154;&#20449;&#24687;&#19979;&#30340;&#22810;&#20154;&#28040;&#32791;&#25112;&#20998;&#26512;
&lt;/p&gt;
&lt;p&gt;
Multiplayer War of Attrition with Asymmetric Private Information. (arXiv:2302.09427v2 [econ.TH] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2302.09427
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20998;&#26512;&#20102;&#23545;&#31216;&#31867;&#22411;&#20998;&#24067;&#19979;&#30340;&#22810;&#20154;&#28040;&#32791;&#25112;&#21338;&#24328;&#65292;&#22312;&#21807;&#19968;&#22343;&#34913;&#20013;&#21457;&#29616;&#19981;&#23545;&#31216;&#24615;&#23548;&#33268;&#21442;&#19982;&#32773;&#20998;&#23618;&#34892;&#20026;&#27169;&#24335;&#12290;&#21442;&#19982;&#32773;&#30340;&#32784;&#24515;&#24230;&#12289;&#25552;&#20379;&#25104;&#26412;&#21644;&#20272;&#20540;&#20250;&#24433;&#21709;&#29289;&#21697;&#25552;&#20379;&#30340;&#36895;&#24230;&#12290;&#36890;&#36807;&#25511;&#21046;&#26368;&#24378;&#31867;&#22411;&#21487;&#20197;&#35843;&#33410;&#19981;&#23545;&#31216;&#24615;&#30340;&#25928;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20998;&#26512;&#20102;&#23545;&#31216;&#31867;&#22411;&#20998;&#24067;&#19979;&#30340;&#22810;&#20154;&#28040;&#32791;&#25112;&#21338;&#24328;&#65292;&#30740;&#31350;&#20102;&#22312;&#25552;&#20379;&#19981;&#21487;&#20998;&#21106;&#30340;&#20844;&#20849;&#29289;&#21697;&#30340;&#31169;&#20154;&#26426;&#21046;&#20013;&#30340;&#23545;&#31216;&#24615;&#12290;&#22312;&#21807;&#19968;&#22343;&#34913;&#20013;&#65292;&#19981;&#23545;&#31216;&#24615;&#23548;&#33268;&#20102;&#19968;&#31181;&#20998;&#23618;&#34892;&#20026;&#27169;&#24335;&#65292;&#20854;&#20013;&#19968;&#20010;&#21442;&#19982;&#32773;&#20197;&#19968;&#23450;&#27010;&#29575;&#31435;&#21363;&#25552;&#20379;&#29289;&#21697;&#65292;&#32780;&#20854;&#20182;&#21442;&#19982;&#32773;&#22312;&#26576;&#20010;&#29305;&#23450;&#26102;&#21051;&#20043;&#21069;&#27809;&#26377;&#25552;&#20379;&#30340;&#27010;&#29575;&#65292;&#24182;&#19988;&#36825;&#20010;&#26102;&#21051;&#23545;&#19981;&#21516;&#30340;&#21442;&#19982;&#32773;&#26159;&#29420;&#29305;&#30340;&#12290;&#27604;&#36739;&#38745;&#24577;&#20998;&#26512;&#34920;&#26126;&#65292;&#32784;&#24515;&#24230;&#26356;&#20302;&#12289;&#25552;&#20379;&#25104;&#26412;&#26356;&#20302;&#12289;&#20272;&#20540;&#26356;&#39640;&#30340;&#21442;&#19982;&#32773;&#33021;&#22815;&#26356;&#24555;&#22320;&#25552;&#20379;&#29289;&#21697;&#12290;&#24310;&#36831;&#25104;&#26412;&#20027;&#35201;&#30001;&#31435;&#21363;&#36864;&#20986;&#21442;&#19982;&#32773;&#30340;&#26368;&#24378;&#31867;&#22411;&#20915;&#23450;&#12290;&#26412;&#25991;&#36824;&#30740;&#31350;&#20102;&#20004;&#31181;&#19981;&#23545;&#31216;&#24615;&#30340;&#21464;&#21270;&#65306;&#25552;&#21319;&#26368;&#24378;&#31867;&#22411;&#20542;&#21521;&#20110;&#25552;&#39640;&#25928;&#29575;&#65292;&#32780;&#25511;&#21046;&#26368;&#24378;&#31867;&#22411;&#19982;&#23545;&#31216;&#24615;&#25104;&#26412;&#30340;&#31526;&#21495;&#30456;&#20851;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper analyzes a multiplayer war of attrition game with asymmetric type distributions in the setting of private provision of an indivisible public good. In the unique equilibrium, asymmetry leads to a stratified behavior pattern where one agent provides the good instantly with a positive probability, while each of the others has no probability of provision before a certain moment and this moment is idiosyncratic for different agents. Comparative statics show that an agent with less patience, lower cost of provision, and higher reputation in valuation provides the good uniformly faster. The cost of delay is mainly determined by the strongest type of the instant-exit agent. This paper investigates two types of variations of asymmetry: raising the strongest type tends to improve efficiency, whereas controlling the strongest type associates the effect of asymmetry with the sign of an intuitive measure of ``the cost of symmetry".
&lt;/p&gt;</description></item><item><title>&#25552;&#20986;&#20102;&#36890;&#36807;&#22312;&#24863;&#35273;&#21644;&#30693;&#35273;&#23618;&#38754;&#20307;&#39564;&#29983;&#27963;&#36136;&#37327;&#26469;&#27604;&#36739;&#19981;&#21516;&#25991;&#21270;&#30340;&#26041;&#27861;&#65292;&#24378;&#35843;&#20010;&#20307;&#24863;&#30693;&#29615;&#22659;&#31215;&#26497;&#22240;&#32032;&#30340;&#33021;&#21147;&#21644;&#23454;&#29616;&#26377;&#20215;&#20540;&#30340;&#34892;&#20026;&#21644;&#29366;&#24577;&#30340;&#24847;&#20041;&#65292;&#24182;&#36890;&#36807;&#30524;&#30555;&#24863;&#30693;&#19981;&#21516;&#39057;&#29575;&#21644;&#39057;&#29575;&#28151;&#21512;&#29289;&#30340;&#20363;&#23376;&#35777;&#26126;&#20102;&#36825;&#31181;&#20307;&#39564;&#30340;&#23458;&#35266;&#24615;&#12290;</title><link>http://arxiv.org/abs/2210.03639</link><description>&lt;p&gt;
&#29983;&#27963;&#36136;&#37327;&#19982;&#29615;&#22659;&#20307;&#39564;
&lt;/p&gt;
&lt;p&gt;
Quality of Life and the Experience of Context. (arXiv:2210.03639v1 [q-bio.NC] CROSS LISTED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2210.03639
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#36890;&#36807;&#22312;&#24863;&#35273;&#21644;&#30693;&#35273;&#23618;&#38754;&#20307;&#39564;&#29983;&#27963;&#36136;&#37327;&#26469;&#27604;&#36739;&#19981;&#21516;&#25991;&#21270;&#30340;&#26041;&#27861;&#65292;&#24378;&#35843;&#20010;&#20307;&#24863;&#30693;&#29615;&#22659;&#31215;&#26497;&#22240;&#32032;&#30340;&#33021;&#21147;&#21644;&#23454;&#29616;&#26377;&#20215;&#20540;&#30340;&#34892;&#20026;&#21644;&#29366;&#24577;&#30340;&#24847;&#20041;&#65292;&#24182;&#36890;&#36807;&#30524;&#30555;&#24863;&#30693;&#19981;&#21516;&#39057;&#29575;&#21644;&#39057;&#29575;&#28151;&#21512;&#29289;&#30340;&#20363;&#23376;&#35777;&#26126;&#20102;&#36825;&#31181;&#20307;&#39564;&#30340;&#23458;&#35266;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#25552;&#20986;&#65292;&#23613;&#31649;&#19981;&#21516;&#25991;&#21270;&#20043;&#38388;&#23384;&#22312;&#20215;&#20540;&#35266;&#24046;&#24322;&#65292;&#20294;&#21487;&#20197;&#36890;&#36807;&#22312;&#24863;&#35273;&#21644;&#30693;&#35273;&#23618;&#38754;&#20307;&#39564;&#29983;&#27963;&#36136;&#37327;&#26469;&#36827;&#34892;&#27604;&#36739;&#12290;&#25105;&#35748;&#20026;&#65292;&#35780;&#20272;&#29983;&#27963;&#36136;&#37327;&#30340;&#26041;&#27861;&#24212;&#35813;&#20851;&#27880;&#20010;&#20307;&#36890;&#36807;&#24863;&#30693;&#29615;&#22659;&#20013;&#31215;&#26497;&#22240;&#32032;&#30340;&#32452;&#21512;&#24182;&#23454;&#29616;&#26377;&#20215;&#20540;&#30340;&#34892;&#20026;&#21644;&#29366;&#24577;&#30340;&#33021;&#21147;&#65292;&#27604;&#30452;&#25509;&#20851;&#27880;&#29983;&#27963;&#25163;&#27573;&#21644;&#33258;&#30001;&#25163;&#27573;&#30340;&#24230;&#37327;&#26041;&#27861;&#26356;&#26377;&#24847;&#20041;&#12290;&#22240;&#20026;&#29983;&#27963;&#36136;&#37327;&#30340;&#24863;&#21463;&#20307;&#39564;&#26469;&#33258;&#26500;&#25104;&#29615;&#22659;&#25972;&#20307;&#32467;&#26500;&#30340;&#19968;&#31995;&#21015;&#22240;&#32032;&#65292;&#25152;&#20197;&#26080;&#27861;&#34987;&#35270;&#20026;&#20027;&#35266;&#20307;&#39564;&#12290;&#36890;&#36807;&#20197;&#30524;&#30555;&#24863;&#30693;&#19981;&#21516;&#39057;&#29575;&#21644;&#39057;&#29575;&#28151;&#21512;&#29289;&#20026;&#39068;&#33394;&#30340;&#31034;&#20363;&#65292;&#25105;&#35777;&#26126;&#20102;&#20154;&#31867;&#30340;&#35748;&#30693;&#35013;&#32622;&#30001;&#20110;&#19982;&#29615;&#22659;&#23384;&#22312;&#20851;&#32852;&#32780;&#21487;&#20197;&#20135;&#29983;&#36825;&#31181;&#20307;&#39564;&#12290;
&lt;/p&gt;
&lt;p&gt;
I propose that quality of life can be compared despite the difference in values across cultures when it is experienced at the sensory and perceptual level. I argue that an approach to assessing quality of life which focuses on an individual's ability to organize his or her context by perceiving positive constellations of factors in the environment and his or her ability to achieve valuable acts and realize valuable states of being is more meaningful than the approaches of metrics which focus directly, and often solely, on the means of living and the means of freedom. Because the felt experience of quality of life is derived from a constellation of factors which make up the indivisible structure of a milieu, the experience of quality of life cannot be regarded as a subjective experience. Through the example of how different frequencies, and mixtures of frequencies, of light are perceived as colour by the eye, I demonstrate that the human cognitive apparatus, because of its relation to t
&lt;/p&gt;</description></item></channel></rss>