<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#27169;&#22411;&#65292;&#38416;&#26126;&#20102;&#32654;&#22909;&#24187;&#24819;&#34892;&#20026;&#30340;&#26412;&#36136;&#20197;&#21450;&#20559;&#35265;&#20449;&#24565;&#25152;&#24102;&#26469;&#30340;&#25104;&#26412;&#21644;&#25910;&#30410;&#12290;&#36890;&#36807;&#36229;&#22411;&#25928;&#29992;&#26368;&#22823;&#21270;&#65292;&#25581;&#31034;&#20102;&#20048;&#35266;&#30340;&#20915;&#31574;&#32773;&#20559;&#22909;&#20110;&#20855;&#26377;&#27491;&#20559;&#24577;&#21644;&#22686;&#21152;&#39118;&#38505;&#29305;&#24449;&#30340;&#36873;&#25321;&#12290;</title><link>https://arxiv.org/abs/2402.01892</link><description>&lt;p&gt;
&#34987;&#23457;&#26597;&#30340;&#20449;&#20208;&#19982;&#32654;&#22909;&#24187;&#24819;
&lt;/p&gt;
&lt;p&gt;
Censored Beliefs and Wishful Thinking
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.01892
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#27169;&#22411;&#65292;&#38416;&#26126;&#20102;&#32654;&#22909;&#24187;&#24819;&#34892;&#20026;&#30340;&#26412;&#36136;&#20197;&#21450;&#20559;&#35265;&#20449;&#24565;&#25152;&#24102;&#26469;&#30340;&#25104;&#26412;&#21644;&#25910;&#30410;&#12290;&#36890;&#36807;&#36229;&#22411;&#25928;&#29992;&#26368;&#22823;&#21270;&#65292;&#25581;&#31034;&#20102;&#20048;&#35266;&#30340;&#20915;&#31574;&#32773;&#20559;&#22909;&#20110;&#20855;&#26377;&#27491;&#20559;&#24577;&#21644;&#22686;&#21152;&#39118;&#38505;&#29305;&#24449;&#30340;&#36873;&#25321;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#27169;&#22411;&#65292;&#38416;&#26126;&#20102;&#32654;&#22909;&#24187;&#24819;&#30340;&#26412;&#36136;&#65292;&#32508;&#21512;&#32771;&#34385;&#20102;&#20559;&#35265;&#20449;&#24565;&#25152;&#24102;&#26469;&#30340;&#25104;&#26412;&#21644;&#25910;&#30410;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;&#32654;&#22909;&#24187;&#24819;&#34892;&#20026;&#21487;&#20197;&#20934;&#30830;&#22320;&#25551;&#36848;&#20026;&#22312;&#20559;&#35265;&#20449;&#24565;&#25197;&#26354;&#25104;&#26412;&#20989;&#25968;&#39046;&#22495;&#20869;&#36827;&#34892;&#36229;&#22411;&#25928;&#29992;&#26368;&#22823;&#21270;&#12290;&#36890;&#36807;&#21033;&#29992;&#36825;&#31181;&#31561;&#20215;&#24615;&#65292;&#25105;&#20204;&#24471;&#20986;&#20102;&#24403;&#19968;&#20010;&#20048;&#35266;&#30340;&#20915;&#31574;&#32773;&#20559;&#22909;&#20110;&#20855;&#26377;&#27491;&#20559;&#24577;&#21644;&#22686;&#21152;&#39118;&#38505;&#29305;&#24449;&#30340;&#36873;&#25321;&#30340;&#26465;&#20214;&#12290;
&lt;/p&gt;
&lt;p&gt;
We present a model elucidating wishful thinking, which comprehensively incorporates both the costs and benefits associated with biased beliefs. Our findings reveal that wishful thinking behavior can be accurately characterized as equivalent to superquantile-utility maximization within the domain of threshold beliefs distortion cost functions. By leveraging this equivalence, we establish conditions that elucidate when an optimistic decision-maker exhibits a preference for choices characterized by positive skewness and increased risk.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#22810;&#21464;&#37327;&#29256;&#26412;&#30340;&#36866;&#24212;&#24615;&#20256;&#36755;&#65292;&#31216;&#20026;&#22810;&#22240;&#26524;&#20256;&#36755;&#65292;&#20854;&#20013;&#28041;&#21450;&#22810;&#20010;&#32463;&#36807;&#22240;&#26524;&#32422;&#26463;&#30340;&#36807;&#31243;&#12290;&#25105;&#20204;&#30740;&#31350;&#20102;&#20855;&#26377;&#22240;&#26524;&#21644;&#21452;&#22240;&#26524;&#26368;&#20248;&#20256;&#36755;&#30340;&#38543;&#26426;&#36807;&#31243;&#30340;&#37325;&#24515;&#38382;&#39064;&#65292;&#20197;&#21450;&#20854;&#19982;&#22810;&#22240;&#26524;&#20256;&#36755;&#38382;&#39064;&#30340;&#32852;&#31995;&#12290;&#25105;&#20204;&#36824;&#36890;&#36807;&#19968;&#39033;&#24212;&#29992;&#30740;&#31350;&#20102;&#21160;&#24577;&#29615;&#22659;&#19979;&#30340;&#21305;&#37197;&#38382;&#39064;&#65292;&#24182;&#23637;&#31034;&#20102;&#22343;&#34913;&#23384;&#22312;&#24615;&#12290;</title><link>http://arxiv.org/abs/2401.12748</link><description>&lt;p&gt;
&#22810;&#22240;&#26524;&#20256;&#36755;&#65306;&#37325;&#24515;&#21644;&#21160;&#24577;&#21305;&#37197;
&lt;/p&gt;
&lt;p&gt;
Multicausal transport: barycenters and dynamic matching. (arXiv:2401.12748v1 [math.PR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.12748
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#22810;&#21464;&#37327;&#29256;&#26412;&#30340;&#36866;&#24212;&#24615;&#20256;&#36755;&#65292;&#31216;&#20026;&#22810;&#22240;&#26524;&#20256;&#36755;&#65292;&#20854;&#20013;&#28041;&#21450;&#22810;&#20010;&#32463;&#36807;&#22240;&#26524;&#32422;&#26463;&#30340;&#36807;&#31243;&#12290;&#25105;&#20204;&#30740;&#31350;&#20102;&#20855;&#26377;&#22240;&#26524;&#21644;&#21452;&#22240;&#26524;&#26368;&#20248;&#20256;&#36755;&#30340;&#38543;&#26426;&#36807;&#31243;&#30340;&#37325;&#24515;&#38382;&#39064;&#65292;&#20197;&#21450;&#20854;&#19982;&#22810;&#22240;&#26524;&#20256;&#36755;&#38382;&#39064;&#30340;&#32852;&#31995;&#12290;&#25105;&#20204;&#36824;&#36890;&#36807;&#19968;&#39033;&#24212;&#29992;&#30740;&#31350;&#20102;&#21160;&#24577;&#29615;&#22659;&#19979;&#30340;&#21305;&#37197;&#38382;&#39064;&#65292;&#24182;&#23637;&#31034;&#20102;&#22343;&#34913;&#23384;&#22312;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#24341;&#20837;&#20102;&#36866;&#24212;&#24615;&#20256;&#36755;&#30340;&#22810;&#20803;&#29256;&#26412;&#65292;&#21629;&#21517;&#20026;&#22810;&#22240;&#26524;&#20256;&#36755;&#65292;&#20854;&#20013;&#28041;&#21450;&#22810;&#20010;&#34987;&#26045;&#21152;&#22240;&#26524;&#32422;&#26463;&#30340;&#36807;&#31243;&#12290;&#25509;&#19979;&#26469;&#65292;&#25105;&#20204;&#32771;&#34385;&#20855;&#26377;&#22240;&#26524;&#21644;&#21452;&#22240;&#26524;&#26368;&#20248;&#20256;&#36755;&#30340;&#38543;&#26426;&#36807;&#31243;&#30340;&#37325;&#24515;&#38382;&#39064;&#65292;&#24182;&#30740;&#31350;&#20854;&#19982;&#20855;&#20307;&#30340;&#22810;&#22240;&#26524;&#20256;&#36755;&#38382;&#39064;&#30340;&#32852;&#31995;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#21069;&#36848;&#38382;&#39064;&#30340;&#36798;&#21040;&#21644;&#23545;&#20598;&#24615;&#12290;&#20316;&#20026;&#19968;&#20010;&#24212;&#29992;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#19968;&#20010;&#21160;&#24577;&#29615;&#22659;&#19979;&#30340;&#21305;&#37197;&#38382;&#39064;&#65292;&#20854;&#20013;&#20195;&#29702;&#20154;&#30340;&#31867;&#22411;&#38543;&#26102;&#38388;&#28436;&#21464;&#12290;&#25105;&#20204;&#23558;&#20854;&#19982;&#22240;&#26524;&#37325;&#24515;&#38382;&#39064;&#32852;&#31995;&#36215;&#26469;&#65292;&#24182;&#20174;&#32780;&#23637;&#31034;&#20102;&#22343;&#34913;&#30340;&#23384;&#22312;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
We introduce a multivariate version of adapted transport, which we name multicausal transport, involving several filtered processes among which causality constraints are imposed. Subsequently, we consider the barycenter problem for stochastic processes with respect to causal and bicausal optimal transport, and study its connection to specific multicausal transport problems. Attainment and duality of the aforementioned problems are provided. As an application, we study a matching problem in a dynamic setting where agents' types evolve over time. We link this to a causal barycenter problem and thereby show existence of equilibria.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#31616;&#21333;&#30340;&#38543;&#26426;&#38750;&#32447;&#24615;AR&#27169;&#22411;&#65292;&#22312;&#25506;&#31350;&#27873;&#27819;&#21160;&#21147;&#23398;&#26102;&#20855;&#26377;&#37325;&#35201;&#24212;&#29992;&#12290;&#35813;&#27169;&#22411;&#30340;&#23616;&#37096;&#29190;&#21457;&#26426;&#21046;&#21487;&#20197;&#26377;&#25928;&#22320;&#25551;&#32472;&#27873;&#27819;&#30340;&#21160;&#24577;&#29305;&#24449;&#65292;&#24182;&#20351;&#29992;&#20102;&#20934;&#26368;&#22823;&#20284;&#28982;&#20272;&#35745;&#26041;&#27861;&#23545;&#20854;&#36827;&#34892;&#21442;&#25968;&#20272;&#35745;&#21644;&#27169;&#22411;&#25311;&#21512;&#12290;</title><link>http://arxiv.org/abs/2401.07038</link><description>&lt;p&gt;
&#19968;&#20010;&#31616;&#21333;&#30340;&#38543;&#26426;&#38750;&#32447;&#24615;AR&#27169;&#22411;&#21450;&#20854;&#22312;&#27873;&#27819;&#20013;&#30340;&#24212;&#29992;
&lt;/p&gt;
&lt;p&gt;
A simple stochastic nonlinear AR model with application to bubble. (arXiv:2401.07038v1 [math.ST])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.07038
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#31616;&#21333;&#30340;&#38543;&#26426;&#38750;&#32447;&#24615;AR&#27169;&#22411;&#65292;&#22312;&#25506;&#31350;&#27873;&#27819;&#21160;&#21147;&#23398;&#26102;&#20855;&#26377;&#37325;&#35201;&#24212;&#29992;&#12290;&#35813;&#27169;&#22411;&#30340;&#23616;&#37096;&#29190;&#21457;&#26426;&#21046;&#21487;&#20197;&#26377;&#25928;&#22320;&#25551;&#32472;&#27873;&#27819;&#30340;&#21160;&#24577;&#29305;&#24449;&#65292;&#24182;&#20351;&#29992;&#20102;&#20934;&#26368;&#22823;&#20284;&#28982;&#20272;&#35745;&#26041;&#27861;&#23545;&#20854;&#36827;&#34892;&#21442;&#25968;&#20272;&#35745;&#21644;&#27169;&#22411;&#25311;&#21512;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#32463;&#27982;&#21644;&#37329;&#34701;&#26102;&#38388;&#24207;&#21015;&#22312;&#24418;&#25104;&#27873;&#27819;&#26102;&#21487;&#33021;&#20250;&#34920;&#29616;&#20986;&#23616;&#37096;&#29190;&#21457;&#34892;&#20026;&#12290;&#32463;&#27982;&#25110;&#37329;&#34701;&#27873;&#27819;&#65292;&#29305;&#21035;&#26159;&#20854;&#21160;&#21147;&#23398;&#65292;&#26159;&#19968;&#20010;&#24341;&#20154;&#20837;&#32988;&#30340;&#35805;&#39064;&#65292;&#19968;&#30452;&#20197;&#26469;&#37117;&#21463;&#21040;&#20851;&#27880;&#12290;&#20026;&#20102;&#35828;&#26126;&#23616;&#37096;&#29190;&#21457;&#26412;&#36523;&#30340;&#21160;&#21147;&#23398;&#65292;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#26032;&#39062;&#12289;&#31616;&#21333;&#32780;&#26377;&#29992;&#30340;&#26102;&#38388;&#24207;&#21015;&#27169;&#22411;&#65292;&#31216;&#20026;&#38543;&#26426;&#38750;&#32447;&#24615;&#33258;&#22238;&#24402;&#27169;&#22411;&#65292;&#20855;&#26377;&#20005;&#26684;&#24179;&#31283;&#24615;&#21644;&#20960;&#20309;&#36941;&#21382;&#24615;&#65292;&#24182;&#33021;&#22815;&#20135;&#29983;&#22312;&#35768;&#22810;&#23439;&#35266;&#32463;&#27982;&#21464;&#37327;&#20013;&#35266;&#23519;&#21040;&#30340;&#38271;&#21608;&#26399;&#27874;&#21160;&#25110;&#25345;&#20037;&#24615;&#12290;&#24403;&#38750;&#32447;&#24615;&#33258;&#22238;&#24402;&#31995;&#25968;&#22312;&#26576;&#19968;&#33539;&#22260;&#20043;&#22806;&#26102;&#65292;&#35813;&#27169;&#22411;&#20250;&#20986;&#29616;&#21608;&#26399;&#24615;&#29190;&#21457;&#34892;&#20026;&#65292;&#24182;&#21487;&#20197;&#29992;&#26469;&#25551;&#32472;&#27873;&#27819;&#30340;&#21160;&#24577;&#12290;&#27492;&#22806;&#65292;&#23545;&#25105;&#20204;&#30340;&#27169;&#22411;&#36827;&#34892;&#20102;&#20934;&#26368;&#22823;&#20284;&#28982;&#20272;&#35745;&#65288;QMLE&#65289;&#65292;&#24182;&#22312;&#23545;&#21019;&#26032;&#37319;&#21462;&#26368;&#23567;&#20551;&#35774;&#30340;&#24773;&#20917;&#19979;&#65292;&#35777;&#26126;&#20102;&#20854;&#24378;&#19968;&#33268;&#24615;&#21644;&#28176;&#36817;&#27491;&#24577;&#24615;&#12290;&#36824;&#38024;&#23545;&#27169;&#22411;&#25311;&#21512;&#36827;&#34892;&#20102;&#26032;&#30340;&#27169;&#22411;&#35786;&#26029;&#26816;&#39564;&#32479;&#35745;&#37327;&#30340;&#24320;&#21457;&#12290;
&lt;/p&gt;
&lt;p&gt;
Economic and financial time series can feature locally explosive behavior when a bubble is formed. The economic or financial bubble, especially its dynamics, is an intriguing topic that has been attracting longstanding attention. To illustrate the dynamics of the local explosion itself, the paper presents a novel, simple, yet useful time series model, called the stochastic nonlinear autoregressive model, which is always strictly stationary and geometrically ergodic and can create long swings or persistence observed in many macroeconomic variables. When a nonlinear autoregressive coefficient is outside of a certain range, the model has periodically explosive behaviors and can then be used to portray the bubble dynamics. Further, the quasi-maximum likelihood estimation (QMLE) of our model is considered, and its strong consistency and asymptotic normality are established under minimal assumptions on innovation. A new model diagnostic checking statistic is developed for model fitting adequ
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#32593;&#32476;&#24178;&#25200;&#19979;&#35774;&#35745;&#38598;&#32676;&#23454;&#39564;&#26469;&#20272;&#35745;&#20840;&#23616;&#27835;&#30103;&#25928;&#26524;&#65292;&#24182;&#25552;&#20986;&#20102;&#36873;&#25321;&#26368;&#20248;&#32858;&#31867;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#20351;&#29992;&#29616;&#25104;&#30340;&#21322;&#23450;&#35268;&#21010;&#31639;&#27861;&#35745;&#31639;&#19968;&#20010;&#26032;&#22411;&#24809;&#32602;&#26368;&#23567;&#21106;&#20248;&#21270;&#38382;&#39064;&#30340;&#35299;&#26469;&#36817;&#20284;&#26368;&#20248;&#32858;&#31867;&#65292;&#21516;&#26102;&#36824;&#30830;&#23450;&#20102;&#36873;&#25321;&#31751;&#25110;&#20010;&#20307;&#32423;&#38543;&#26426;&#21270;&#20043;&#38388;&#26131;&#20110;&#26816;&#26597;&#30340;&#26465;&#20214;&#12290;</title><link>http://arxiv.org/abs/2310.14983</link><description>&lt;p&gt;
&#22240;&#26524;&#32858;&#31867;&#65306;&#22312;&#32593;&#32476;&#24178;&#25200;&#19979;&#35774;&#35745;&#38598;&#32676;&#23454;&#39564;
&lt;/p&gt;
&lt;p&gt;
Causal clustering: design of cluster experiments under network interference. (arXiv:2310.14983v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.14983
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#32593;&#32476;&#24178;&#25200;&#19979;&#35774;&#35745;&#38598;&#32676;&#23454;&#39564;&#26469;&#20272;&#35745;&#20840;&#23616;&#27835;&#30103;&#25928;&#26524;&#65292;&#24182;&#25552;&#20986;&#20102;&#36873;&#25321;&#26368;&#20248;&#32858;&#31867;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#20351;&#29992;&#29616;&#25104;&#30340;&#21322;&#23450;&#35268;&#21010;&#31639;&#27861;&#35745;&#31639;&#19968;&#20010;&#26032;&#22411;&#24809;&#32602;&#26368;&#23567;&#21106;&#20248;&#21270;&#38382;&#39064;&#30340;&#35299;&#26469;&#36817;&#20284;&#26368;&#20248;&#32858;&#31867;&#65292;&#21516;&#26102;&#36824;&#30830;&#23450;&#20102;&#36873;&#25321;&#31751;&#25110;&#20010;&#20307;&#32423;&#38543;&#26426;&#21270;&#20043;&#38388;&#26131;&#20110;&#26816;&#26597;&#30340;&#26465;&#20214;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#21333;&#19968;&#32593;&#32476;&#23384;&#22312;&#22806;&#28322;&#25928;&#24212;&#30340;&#24773;&#20917;&#19979;&#65292;&#35774;&#35745;&#38598;&#32676;&#23454;&#39564;&#26469;&#20272;&#35745;&#20840;&#23616;&#27835;&#30103;&#25928;&#26524;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#19968;&#20010;&#35745;&#37327;&#32463;&#27982;&#23398;&#30340;&#26694;&#26550;&#65292;&#36873;&#25321;&#26368;&#23567;&#21270;&#20272;&#35745;&#30340;&#20840;&#23616;&#27835;&#30103;&#25928;&#26524;&#30340;&#26368;&#22351;&#22343;&#26041;&#35823;&#24046;&#30340;&#32858;&#31867;&#26041;&#27861;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#26368;&#20248;&#32858;&#31867;&#26041;&#27861;&#21487;&#20197;&#36817;&#20284;&#20026;&#36890;&#36807;&#29616;&#25104;&#30340;&#21322;&#23450;&#35268;&#21010;&#31639;&#27861;&#35745;&#31639;&#30340;&#19968;&#31181;&#26032;&#22411;&#24809;&#32602;&#26368;&#23567;&#21106;&#20248;&#21270;&#38382;&#39064;&#30340;&#35299;&#12290;&#25105;&#20204;&#30340;&#20998;&#26512;&#36824;&#30830;&#23450;&#20102;&#36873;&#25321;&#31751;&#25110;&#20010;&#20307;&#32423;&#38543;&#26426;&#21270;&#20043;&#38388;&#26131;&#20110;&#26816;&#26597;&#30340;&#26465;&#20214;&#12290;&#25105;&#20204;&#20351;&#29992;&#26469;&#33258;Facebook&#29992;&#25143;&#23431;&#23449;&#30340;&#29420;&#29305;&#32593;&#32476;&#25968;&#25454;&#21644;&#29616;&#26377;&#30340;&#32593;&#32476;&#23454;&#39564;&#25968;&#25454;&#26469;&#35828;&#26126;&#35813;&#26041;&#27861;&#30340;&#29305;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper studies the design of cluster experiments to estimate the global treatment effect in the presence of spillovers on a single network. We provide an econometric framework to choose the clustering that minimizes the worst-case mean-squared error of the estimated global treatment effect. We show that the optimal clustering can be approximated as the solution of a novel penalized min-cut optimization problem computed via off-the-shelf semi-definite programming algorithms. Our analysis also characterizes easy-to-check conditions to choose between a cluster or individual-level randomization. We illustrate the method's properties using unique network data from the universe of Facebook's users and existing network data from a field experiment.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#20855;&#26377;&#37325;&#22797;&#27178;&#26029;&#38754;&#25968;&#25454;&#21644;&#26102;&#38388;&#27573;&#32452;&#25104;&#21464;&#21270;&#30340;&#24046;&#24322;&#25104;&#24046;&#27861;&#65288;DiD&#65289;&#35774;&#32622;&#65292;&#36890;&#36807;&#24341;&#20837;&#38750;&#21442;&#25968;&#20272;&#35745;&#22120;&#26469;&#36798;&#21040;&#21322;&#21442;&#25968;&#25928;&#29575;&#30028;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#32452;&#25104;&#21464;&#21270;&#30340;&#38750;&#21442;&#25968;Hausman&#22411;&#26816;&#39564;&#12290;</title><link>http://arxiv.org/abs/2304.13925</link><description>&lt;p&gt;
&#32452;&#25104;&#21464;&#21270;&#30340;&#24046;&#24322;&#25104;&#24046;&#27861;
&lt;/p&gt;
&lt;p&gt;
Difference-in-Differences with Compositional Changes. (arXiv:2304.13925v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.13925
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#20855;&#26377;&#37325;&#22797;&#27178;&#26029;&#38754;&#25968;&#25454;&#21644;&#26102;&#38388;&#27573;&#32452;&#25104;&#21464;&#21270;&#30340;&#24046;&#24322;&#25104;&#24046;&#27861;&#65288;DiD&#65289;&#35774;&#32622;&#65292;&#36890;&#36807;&#24341;&#20837;&#38750;&#21442;&#25968;&#20272;&#35745;&#22120;&#26469;&#36798;&#21040;&#21322;&#21442;&#25968;&#25928;&#29575;&#30028;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#32452;&#25104;&#21464;&#21270;&#30340;&#38750;&#21442;&#25968;Hausman&#22411;&#26816;&#39564;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#20855;&#26377;&#37325;&#22797;&#27178;&#26029;&#38754;&#25968;&#25454;&#21644;&#26102;&#38388;&#27573;&#32452;&#25104;&#21464;&#21270;&#30340;&#24046;&#24322;&#25104;&#24046;&#27861;&#65288;DiD&#65289;&#35774;&#32622;&#12290;&#25105;&#20204;&#36890;&#36807;&#25512;&#23548;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#65288;ATT&#65289;&#30340;&#26377;&#25928;&#24433;&#21709;&#20989;&#25968;&#21644;&#21322;&#21442;&#25968;&#25928;&#29575;&#30028;&#26469;&#24320;&#22987;&#20998;&#26512;&#12290;&#25105;&#20204;&#24341;&#20837;&#20102;&#38750;&#21442;&#25968;&#20272;&#35745;&#22120;&#65292;&#23427;&#20204;&#22312;&#26377;&#38480;&#30340;&#29575;&#26465;&#20214;&#19979;&#20272;&#35745;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36824;&#35760;&#24405;&#20102;&#19982;&#32452;&#25104;&#21464;&#21270;&#30456;&#20851;&#30340;&#26435;&#34913;&#65306;&#25105;&#20204;&#25512;&#23548;&#20102;DR DiD&#20272;&#35745;&#22120;&#30340;&#28176;&#36817;&#20559;&#24046;&#65292;&#24182;&#35828;&#26126;&#20102;&#24403;&#25105;&#20204;&#26410;&#33021;&#27491;&#30830;&#25490;&#38500;&#32452;&#25104;&#21464;&#21270;&#26102;&#65292;&#25928;&#29575;&#25439;&#22833;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#36825;&#20123;&#26435;&#34913;&#30340;&#32452;&#25104;&#21464;&#21270;&#30340;&#38750;&#21442;&#25968;Hausman&#22411;&#26816;&#39564;&#12290;&#36890;&#36807;&#33945;&#29305;&#21345;&#32599;&#23454;&#39564;&#21644;&#23454;&#35777;&#24212;&#29992;&#31243;&#24207;&#35780;&#20272;&#20102;&#25152;&#25552;&#20986;&#30340;DiD&#24037;&#20855;&#30340;&#26377;&#38480;&#26679;&#26412;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper studies difference-in-differences (DiD) setups with repeated cross-sectional data and potential compositional changes across time periods. We begin our analysis by deriving the efficient influence function and the semiparametric efficiency bound for the average treatment effect on the treated (ATT). We introduce nonparametric estimators that attain the semiparametric efficiency bound under mild rate conditions on the estimators of the nuisance functions, exhibiting a type of rate doubly-robust (DR) property. Additionally, we document a trade-off related to compositional changes: We derive the asymptotic bias of DR DiD estimators that erroneously exclude compositional changes and the efficiency loss when one fails to correctly rule out compositional changes. We propose a nonparametric Hausman-type test for compositional changes based on these trade-offs. The finite sample performance of the proposed DiD tools is evaluated through Monte Carlo experiments and an empirical appli
&lt;/p&gt;</description></item></channel></rss>