<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#22312;&#25112;&#30053;&#20449;&#24687;&#20256;&#36882;&#28216;&#25103;&#20013;&#65292;&#21033;&#29992;&#29420;&#31435;&#24378;&#21270;&#23398;&#20064;&#31639;&#27861;&#36827;&#34892;&#35757;&#32451;&#30340;&#21457;&#36865;&#32773;&#21644;&#25509;&#25910;&#32773;&#21487;&#20197;&#25910;&#25947;&#21040;&#25509;&#36817;&#26368;&#20248;&#22343;&#34913;&#31574;&#30053;&#65292;&#24182;&#19988;&#22312;&#20195;&#29702;&#20043;&#38388;&#30340;&#21033;&#30410;&#20914;&#31361;&#19979;&#23454;&#29616;&#20102;&#26368;&#22823;&#21270;&#30340;&#36890;&#20449;&#12290;&#36825;&#19968;&#32467;&#35770;&#31283;&#20581;&#65292;&#24182;&#23545;&#20449;&#24687;&#20256;&#36882;&#28216;&#25103;&#20013;&#30340;&#22343;&#34913;&#36873;&#25321;&#29702;&#35770;&#12289;&#35745;&#31639;&#26426;&#31185;&#23398;&#20013;&#30340;&#31639;&#27861;&#38388;&#36890;&#20449;&#21644;&#20154;&#24037;&#26234;&#33021;&#20195;&#29702;&#24066;&#22330;&#20013;&#30340;&#32463;&#27982;&#23398;&#20135;&#29983;&#20102;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2310.07867</link><description>&lt;p&gt;
&#24265;&#20215;&#23545;&#35805;&#31639;&#27861;
&lt;/p&gt;
&lt;p&gt;
Cheap Talking Algorithms. (arXiv:2310.07867v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.07867
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#22312;&#25112;&#30053;&#20449;&#24687;&#20256;&#36882;&#28216;&#25103;&#20013;&#65292;&#21033;&#29992;&#29420;&#31435;&#24378;&#21270;&#23398;&#20064;&#31639;&#27861;&#36827;&#34892;&#35757;&#32451;&#30340;&#21457;&#36865;&#32773;&#21644;&#25509;&#25910;&#32773;&#21487;&#20197;&#25910;&#25947;&#21040;&#25509;&#36817;&#26368;&#20248;&#22343;&#34913;&#31574;&#30053;&#65292;&#24182;&#19988;&#22312;&#20195;&#29702;&#20043;&#38388;&#30340;&#21033;&#30410;&#20914;&#31361;&#19979;&#23454;&#29616;&#20102;&#26368;&#22823;&#21270;&#30340;&#36890;&#20449;&#12290;&#36825;&#19968;&#32467;&#35770;&#31283;&#20581;&#65292;&#24182;&#23545;&#20449;&#24687;&#20256;&#36882;&#28216;&#25103;&#20013;&#30340;&#22343;&#34913;&#36873;&#25321;&#29702;&#35770;&#12289;&#35745;&#31639;&#26426;&#31185;&#23398;&#20013;&#30340;&#31639;&#27861;&#38388;&#36890;&#20449;&#21644;&#20154;&#24037;&#26234;&#33021;&#20195;&#29702;&#24066;&#22330;&#20013;&#30340;&#32463;&#27982;&#23398;&#20135;&#29983;&#20102;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#27169;&#25311;&#29420;&#31435;&#30340;&#24378;&#21270;&#23398;&#20064;&#31639;&#27861;&#22312;&#20811;&#21171;&#31119;&#24503;&#21644;&#32034;&#36125;&#23572;&#65288;1982&#65289;&#30340;&#25112;&#30053;&#20449;&#24687;&#20256;&#36882;&#28216;&#25103;&#20013;&#30340;&#34892;&#20026;&#12290;&#25105;&#20204;&#34920;&#26126;&#65292;&#19968;&#20010;&#21457;&#36865;&#32773;&#21644;&#19968;&#20010;&#25509;&#25910;&#32773;&#19968;&#36215;&#36827;&#34892;&#35757;&#32451;&#65292;&#25910;&#25947;&#21040;&#25509;&#36817;&#28216;&#25103;&#20808;&#39564;&#26368;&#20248;&#22343;&#34913;&#30340;&#31574;&#30053;&#12290;&#22240;&#27492;&#65292;&#36890;&#20449;&#22312;&#19982;&#20195;&#29702;&#20043;&#38388;&#30340;&#21033;&#30410;&#20914;&#31361;&#31243;&#24230;&#32473;&#20986;&#30340;&#32435;&#20160;&#22343;&#34913;&#19979;&#65292;&#25353;&#29031;&#26368;&#22823;&#31243;&#24230;&#36827;&#34892;&#12290;&#36825;&#19968;&#32467;&#35770;&#23545;&#36229;&#21442;&#25968;&#21644;&#28216;&#25103;&#30340;&#22791;&#36873;&#35268;&#33539;&#31283;&#20581;&#12290;&#25105;&#20204;&#35752;&#35770;&#20102;&#20449;&#24687;&#20256;&#36882;&#28216;&#25103;&#20013;&#22343;&#34913;&#36873;&#25321;&#29702;&#35770;&#12289;&#35745;&#31639;&#26426;&#31185;&#23398;&#20013;&#31639;&#27861;&#38388;&#26032;&#20852;&#36890;&#20449;&#24037;&#20316;&#20197;&#21450;&#30001;&#20154;&#24037;&#26234;&#33021;&#20195;&#29702;&#32452;&#25104;&#30340;&#24066;&#22330;&#20013;&#30340;&#23467;&#26007;&#32463;&#27982;&#23398;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
We simulate behaviour of independent reinforcement learning algorithms playing the Crawford and Sobel (1982) game of strategic information transmission. We show that a sender and a receiver training together converge to strategies close to the exante optimal equilibrium of the game. Hence, communication takes place to the largest extent predicted by Nash equilibrium given the degree of conflict of interest between agents. The conclusion is shown to be robust to alternative specifications of the hyperparameters and of the game. We discuss implications for theories of equilibrium selection in information transmission games, for work on emerging communication among algorithms in computer science and for the economics of collusions in markets populated by artificially intelligent agents.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#20998;&#26512;&#20102;&#20013;&#22830;&#38134;&#34892;&#25968;&#23383;&#36135;&#24065;&#65288;CBDC&#65289;&#24341;&#20837;&#21518;&#23545;&#37329;&#34701;&#31283;&#23450;&#24615;&#30340;&#39118;&#38505;&#12290;&#24403;CBDC&#21644;&#23384;&#27454;&#23436;&#20840;&#21487;&#26367;&#20195;&#26102;&#65292;&#20013;&#22830;&#38134;&#34892;&#21487;&#20197;&#36890;&#36807;&#25552;&#20379;&#36151;&#27454;&#26469;&#20013;&#24615;&#21270;CBDC&#30340;&#24433;&#21709;&#65292;&#36151;&#27454;&#21033;&#29575;&#21462;&#20915;&#20110;&#25269;&#25276;&#32422;&#26463;&#30340;&#20005;&#26684;&#31243;&#24230;&#12290;&#28982;&#32780;&#65292;&#24403;CBDC&#21644;&#23384;&#27454;&#19981;&#23436;&#20840;&#21487;&#26367;&#20195;&#26102;&#65292;&#20013;&#22830;&#38134;&#34892;&#26080;&#27861;&#20351;&#38134;&#34892;&#23545;&#26469;&#33258;CBDC&#30340;&#31454;&#20105;&#26080;&#25152;&#36866;&#20174;&#12290;</title><link>http://arxiv.org/abs/2308.10359</link><description>&lt;p&gt;
&#25581;&#31034;&#20013;&#22830;&#38134;&#34892;&#25968;&#23383;&#36135;&#24065;&#19982;&#38134;&#34892;&#23384;&#27454;&#20043;&#38388;&#30340;&#30456;&#20114;&#20316;&#29992;
&lt;/p&gt;
&lt;p&gt;
Unveiling the Interplay between Central Bank Digital Currency and Bank Deposits. (arXiv:2308.10359v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.10359
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#20998;&#26512;&#20102;&#20013;&#22830;&#38134;&#34892;&#25968;&#23383;&#36135;&#24065;&#65288;CBDC&#65289;&#24341;&#20837;&#21518;&#23545;&#37329;&#34701;&#31283;&#23450;&#24615;&#30340;&#39118;&#38505;&#12290;&#24403;CBDC&#21644;&#23384;&#27454;&#23436;&#20840;&#21487;&#26367;&#20195;&#26102;&#65292;&#20013;&#22830;&#38134;&#34892;&#21487;&#20197;&#36890;&#36807;&#25552;&#20379;&#36151;&#27454;&#26469;&#20013;&#24615;&#21270;CBDC&#30340;&#24433;&#21709;&#65292;&#36151;&#27454;&#21033;&#29575;&#21462;&#20915;&#20110;&#25269;&#25276;&#32422;&#26463;&#30340;&#20005;&#26684;&#31243;&#24230;&#12290;&#28982;&#32780;&#65292;&#24403;CBDC&#21644;&#23384;&#27454;&#19981;&#23436;&#20840;&#21487;&#26367;&#20195;&#26102;&#65292;&#20013;&#22830;&#38134;&#34892;&#26080;&#27861;&#20351;&#38134;&#34892;&#23545;&#26469;&#33258;CBDC&#30340;&#31454;&#20105;&#26080;&#25152;&#36866;&#20174;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25193;&#23637;&#20102;Niepelt&#65288;2022&#24180;&#65289;&#30340;&#23454;&#38469;&#21830;&#19994;&#21608;&#26399;&#27169;&#22411;&#65292;&#20998;&#26512;&#24341;&#20837;&#20013;&#22830;&#38134;&#34892;&#25968;&#23383;&#36135;&#24065;&#65288;CBDC&#65289;&#21518;&#38754;&#20020;&#30340;&#37329;&#34701;&#31283;&#23450;&#39118;&#38505;&#12290;CBDC&#19982;&#21830;&#19994;&#38134;&#34892;&#23384;&#27454;&#31454;&#20105;&#65292;&#25104;&#20026;&#23478;&#24237;&#30340;&#27969;&#21160;&#24615;&#26469;&#28304;&#12290;&#25105;&#20204;&#32771;&#34385;&#20102;&#25903;&#20184;&#24037;&#20855;&#20043;&#38388;&#30340;&#19981;&#21516;&#21487;&#26367;&#20195;&#24615;&#31243;&#24230;&#65292;&#24182;&#36890;&#36807;&#24341;&#20837;&#38134;&#34892;&#20174;&#20013;&#22830;&#38134;&#34892;&#20511;&#27454;&#26102;&#24517;&#39035;&#36981;&#23432;&#30340;&#25269;&#25276;&#32422;&#26463;&#26469;&#23457;&#26597;Niepelt&#65288;2022&#24180;&#65289;&#20013;&#30340;&#31561;&#20215;&#32467;&#26524;&#12290;&#24403;CBDC&#21644;&#23384;&#27454;&#23436;&#20840;&#21487;&#26367;&#20195;&#26102;&#65292;&#20013;&#22830;&#38134;&#34892;&#21487;&#20197;&#21521;&#38134;&#34892;&#25552;&#20379;&#36151;&#27454;&#65292;&#20351;&#24341;&#20837;CBDC&#23545;&#23454;&#20307;&#32463;&#27982;&#20013;&#24615;&#12290;&#25105;&#20204;&#34920;&#26126;&#65292;&#20013;&#22830;&#38134;&#34892;&#30340;&#36151;&#27454;&#21033;&#29575;&#30340;&#26368;&#20248;&#27700;&#24179;&#21462;&#20915;&#20110;&#25269;&#25276;&#32422;&#26463;&#30340;&#38480;&#21046;&#24615;&#31243;&#24230;&#65306;&#25269;&#25276;&#32422;&#26463;&#36234;&#20005;&#26684;&#65292;&#20013;&#22830;&#38134;&#34892;&#38656;&#35201;&#21457;&#24067;&#30340;&#36151;&#27454;&#21033;&#29575;&#36234;&#20302;&#12290;&#28982;&#32780;&#65292;&#24403;CBDC&#21644;&#23384;&#27454;&#19981;&#23436;&#20840;&#21487;&#26367;&#20195;&#26102;&#65292;&#20013;&#22830;&#38134;&#34892;&#26080;&#27861;&#20351;&#38134;&#34892;&#23545;&#26469;&#33258;CBDC&#30340;&#31454;&#20105;&#26080;&#25152;&#36866;&#20174;&#12290;&#22240;&#27492;&#65292;&#24341;&#20837;CBDC&#21518;&#23558;&#20986;&#29616;&#36127;&#38754;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
We extend the Real Business Cycle model in Niepelt (2022) to analyze the risk to financial stability following the introduction of a central bank digital currency (CBDC). CBDC competes with commercial bank deposits as households' source of liquidity. We consider different degrees of substitutability between payment instruments and review the equivalence result in Niepelt (2022) by introducing a collateral constraint banks must respect when borrowing from the central bank. When CBDC and deposits are perfect substitutes, the central bank can offer loans to banks that render the introduction of CBDC neutral to the real economy. We show that the optimal level of the central bank's lending rate depends on the restrictiveness of the collateral constraint: the tighter it is, the lower the loan rate the central bank needs to post. However, when CBDC and deposits are imperfect substitutes, the central bank cannot make banks indifferent to the competition from CBDC. It follows that the introduct
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#36866;&#29992;&#20110;&#39640;&#32500;&#21327;&#21464;&#37327;&#19979;&#30340;&#23616;&#37096;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#30340;&#26816;&#39564;&#32479;&#35745;&#37327;&#65292;&#35777;&#26126;&#20854;&#20855;&#26377;&#32479;&#19968;&#27491;&#30830;&#30340;&#22823;&#23567;&#65292;&#24182;&#36890;&#36807;&#21452;&#37325;/&#26080;&#20559;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#23454;&#29616;&#20102;&#25512;&#26029;&#21644;&#32622;&#20449;&#21306;&#38388;&#35745;&#31639;&#12290;&#27169;&#25311;&#32467;&#26524;&#34920;&#26126;&#65292;&#35813;&#26816;&#39564;&#20855;&#26377;&#40065;&#26834;&#24615;&#65292;&#21487;&#20197;&#26377;&#25928;&#22788;&#29702;&#35782;&#21035;&#21147;&#36739;&#24369;&#21644;&#39640;&#32500;&#35774;&#32622;&#19979;&#30340;&#25968;&#25454;&#12290;&#24212;&#29992;&#20110;&#23454;&#35777;&#30740;&#31350;&#20013;&#65292;&#35813;&#26041;&#27861;&#22312;&#38081;&#36335;&#36890;&#36798;&#23545;&#22478;&#24066;&#20154;&#21475;&#22686;&#38271;&#30340;&#24433;&#21709;&#30740;&#31350;&#20013;&#34920;&#29616;&#20986;&#26356;&#30701;&#30340;&#32622;&#20449;&#21306;&#38388;&#21644;&#26356;&#23567;&#30340;&#28857;&#20272;&#35745;&#12290;</title><link>http://arxiv.org/abs/2302.09756</link><description>&lt;p&gt;
&#39640;&#32500;&#21327;&#21464;&#37327;&#19979;&#30340;&#23616;&#37096;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#40065;&#26834;&#24615;&#25512;&#26029;
&lt;/p&gt;
&lt;p&gt;
Identification-robust inference for the LATE with high-dimensional covariates. (arXiv:2302.09756v2 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2302.09756
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#36866;&#29992;&#20110;&#39640;&#32500;&#21327;&#21464;&#37327;&#19979;&#30340;&#23616;&#37096;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#30340;&#26816;&#39564;&#32479;&#35745;&#37327;&#65292;&#35777;&#26126;&#20854;&#20855;&#26377;&#32479;&#19968;&#27491;&#30830;&#30340;&#22823;&#23567;&#65292;&#24182;&#36890;&#36807;&#21452;&#37325;/&#26080;&#20559;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#23454;&#29616;&#20102;&#25512;&#26029;&#21644;&#32622;&#20449;&#21306;&#38388;&#35745;&#31639;&#12290;&#27169;&#25311;&#32467;&#26524;&#34920;&#26126;&#65292;&#35813;&#26816;&#39564;&#20855;&#26377;&#40065;&#26834;&#24615;&#65292;&#21487;&#20197;&#26377;&#25928;&#22788;&#29702;&#35782;&#21035;&#21147;&#36739;&#24369;&#21644;&#39640;&#32500;&#35774;&#32622;&#19979;&#30340;&#25968;&#25454;&#12290;&#24212;&#29992;&#20110;&#23454;&#35777;&#30740;&#31350;&#20013;&#65292;&#35813;&#26041;&#27861;&#22312;&#38081;&#36335;&#36890;&#36798;&#23545;&#22478;&#24066;&#20154;&#21475;&#22686;&#38271;&#30340;&#24433;&#21709;&#30740;&#31350;&#20013;&#34920;&#29616;&#20986;&#26356;&#30701;&#30340;&#32622;&#20449;&#21306;&#38388;&#21644;&#26356;&#23567;&#30340;&#28857;&#20272;&#35745;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#39640;&#32500;&#21327;&#21464;&#37327;&#19979;&#30340;&#23616;&#37096;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;(LATE)&#65292;&#19981;&#35770;&#35782;&#21035;&#21147;&#22914;&#20309;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#39640;&#32500;LATE&#26816;&#39564;&#32479;&#35745;&#37327;&#65292;&#24182;&#35777;&#26126;&#20102;&#25105;&#20204;&#30340;&#26816;&#39564;&#22312;&#28176;&#36827;&#24773;&#20917;&#19979;&#20855;&#26377;&#32479;&#19968;&#27491;&#30830;&#30340;&#22823;&#23567;&#12290;&#36890;&#36807;&#37319;&#29992;&#21452;&#37325;/&#26080;&#20559;&#26426;&#22120;&#23398;&#20064;(DML)&#26041;&#27861;&#26469;&#20272;&#35745;&#24178;&#25200;&#21442;&#25968;&#65292;&#25105;&#20204;&#24320;&#21457;&#20102;&#31616;&#21333;&#26131;&#23454;&#26045;&#30340;&#31639;&#27861;&#26469;&#25512;&#26029;&#21644;&#35745;&#31639;&#39640;&#32500;LATE&#30340;&#32622;&#20449;&#21306;&#38388;&#12290;&#27169;&#25311;&#32467;&#26524;&#34920;&#26126;&#65292;&#25105;&#20204;&#30340;&#26816;&#39564;&#23545;&#20110;&#35782;&#21035;&#21147;&#36739;&#24369;&#21644;&#39640;&#32500;&#35774;&#32622;&#19979;&#30340;&#22823;&#23567;&#25511;&#21046;&#21644;&#21151;&#25928;&#34920;&#29616;&#20855;&#26377;&#40065;&#26834;&#24615;&#65292;&#20248;&#20110;&#20854;&#20182;&#20256;&#32479;&#26816;&#39564;&#26041;&#27861;&#12290;&#23558;&#25152;&#25552;&#20986;&#30340;&#26816;&#39564;&#24212;&#29992;&#20110;&#38081;&#36335;&#21644;&#20154;&#21475;&#25968;&#25454;&#65292;&#30740;&#31350;&#38081;&#36335;&#36890;&#36798;&#23545;&#22478;&#24066;&#20154;&#21475;&#22686;&#38271;&#30340;&#24433;&#21709;&#65292;&#25105;&#20204;&#35266;&#23519;&#21040;&#19982;&#20256;&#32479;&#26816;&#39564;&#30456;&#27604;&#65292;&#38081;&#36335;&#36890;&#36798;&#31995;&#25968;&#30340;&#32622;&#20449;&#21306;&#38388;&#38271;&#24230;&#26356;&#30701;&#65292;&#28857;&#20272;&#35745;&#26356;&#23567;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper investigates the local average treatment effect (LATE) with high-dimensional covariates, irrespective of the strength of identification. We propose a novel test statistic for the high-dimensional LATE, demonstrating that our test has uniformly correct asymptotic size. By employing the double/debiased machine learning (DML) method to estimate nuisance parameters, we develop easy-to-implement algorithms for inference and confidence interval calculation of the high-dimensional LATE. Simulations indicate that our test is robust against both weak identification and high-dimensional setting concerning size control and power performance, outperforming other conventional tests. Applying the proposed test to railroad and population data to study the effect of railroad access on urban population growth, we observe the shorter length of confidence intervals and smaller point estimates for the railroad access coefficients compared to the conventional tests.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#21521;&#37327;&#21333;&#35843;&#24615;&#20551;&#35774;&#30340;&#35266;&#28857;&#65292;&#35813;&#20551;&#35774;&#23545;&#20110;&#22810;&#20010;&#24037;&#20855;&#21464;&#37327;&#32452;&#21512;&#30340;&#30740;&#31350;&#20855;&#26377;&#37325;&#35201;&#24847;&#20041;&#12290;&#36890;&#36807;&#20551;&#35774;&#25152;&#26377;&#24037;&#20855;&#21464;&#37327;&#30340;&#27835;&#30103;&#25509;&#21463;&#31243;&#24230;&#26159;&#21333;&#35843;&#30340;&#65292;&#25105;&#20204;&#21487;&#20197;&#24471;&#21040;&#19968;&#20123;&#22240;&#26524;&#21442;&#25968;&#30340;&#28857;&#35782;&#21035;&#65292;&#24182;&#25552;&#20379;&#20102;&#30456;&#24212;&#30340;&#20272;&#35745;&#26041;&#27861;&#12290;</title><link>http://arxiv.org/abs/2009.00553</link><description>&lt;p&gt;
&#22810;&#20010;&#24037;&#20855;&#21464;&#37327;&#30340;&#21521;&#37327;&#21333;&#35843;&#24615;&#20551;&#35774;
&lt;/p&gt;
&lt;p&gt;
A Vector Monotonicity Assumption for Multiple Instruments. (arXiv:2009.00553v3 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2009.00553
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#21521;&#37327;&#21333;&#35843;&#24615;&#20551;&#35774;&#30340;&#35266;&#28857;&#65292;&#35813;&#20551;&#35774;&#23545;&#20110;&#22810;&#20010;&#24037;&#20855;&#21464;&#37327;&#32452;&#21512;&#30340;&#30740;&#31350;&#20855;&#26377;&#37325;&#35201;&#24847;&#20041;&#12290;&#36890;&#36807;&#20551;&#35774;&#25152;&#26377;&#24037;&#20855;&#21464;&#37327;&#30340;&#27835;&#30103;&#25509;&#21463;&#31243;&#24230;&#26159;&#21333;&#35843;&#30340;&#65292;&#25105;&#20204;&#21487;&#20197;&#24471;&#21040;&#19968;&#20123;&#22240;&#26524;&#21442;&#25968;&#30340;&#28857;&#35782;&#21035;&#65292;&#24182;&#25552;&#20379;&#20102;&#30456;&#24212;&#30340;&#20272;&#35745;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24403;&#30740;&#31350;&#20154;&#21592;&#23558;&#22810;&#20010;&#24037;&#20855;&#21464;&#37327;&#32452;&#21512;&#29992;&#20110;&#21333;&#19968;&#20108;&#20803;&#27835;&#30103;&#26102;&#65292;&#26412;&#22320;&#24179;&#22343;&#27835;&#30103;&#25928;&#24212;&#65288;LATE&#65289;&#26694;&#26550;&#30340;&#21333;&#35843;&#24615;&#20551;&#35774;&#21487;&#33021;&#21464;&#24471;&#36807;&#20110;&#38480;&#21046;&#24615;&#65306;&#23427;&#35201;&#27714;&#25152;&#26377;&#21333;&#20301;&#22312;&#20998;&#21035;&#25913;&#21464;&#24037;&#20855;&#21464;&#37327;&#26041;&#21521;&#26102;&#20855;&#26377;&#30456;&#21516;&#30340;&#21453;&#24212;&#26041;&#21521;&#12290;&#30456;&#27604;&#20043;&#19979;&#65292;&#25105;&#25152;&#31216;&#30340;&#21521;&#37327;&#21333;&#35843;&#24615;&#20165;&#20165;&#20551;&#35774;&#25152;&#26377;&#24037;&#20855;&#21464;&#37327;&#30340;&#27835;&#30103;&#25509;&#21463;&#31243;&#24230;&#26159;&#21333;&#35843;&#30340;&#65292;&#23427;&#26159;Mogstad&#31561;&#20154;&#24341;&#20837;&#30340;&#37096;&#20998;&#21333;&#35843;&#24615;&#20551;&#35774;&#30340;&#29305;&#27530;&#24773;&#20917;&#12290;&#22312;&#24037;&#20855;&#21464;&#37327;&#20026;&#20108;&#20803;&#21464;&#37327;&#26102;&#65292;&#25105;&#21051;&#30011;&#20102;&#22312;&#21521;&#37327;&#21333;&#35843;&#24615;&#19979;&#34987;&#28857;&#35782;&#21035;&#30340;&#22240;&#26524;&#21442;&#25968;&#31867;&#12290;&#35813;&#31867;&#21253;&#25324;&#23545;&#20219;&#20309;&#19968;&#31181;&#26041;&#24335;&#23545;&#24037;&#20855;&#21464;&#37327;&#38598;&#21512;&#20570;&#20986;&#21709;&#24212;&#30340;&#21333;&#20301;&#30340;&#24179;&#22343;&#27835;&#30103;&#25928;&#24212;&#65292;&#25110;&#23545;&#32473;&#23450;&#23376;&#38598;&#20570;&#20986;&#21709;&#24212;&#30340;&#21333;&#20301;&#30340;&#24179;&#22343;&#27835;&#30103;&#25928;&#24212;&#12290;&#35782;&#21035;&#32467;&#26524;&#26159;&#24314;&#35774;&#24615;&#30340;&#65292;&#24182;&#25552;&#20379;&#20102;&#23545;&#24050;&#35782;&#21035;&#30340;&#27835;&#30103;&#25928;&#24212;&#21442;&#25968;&#30340;&#31616;&#21333;&#20272;&#35745;&#22120;&#12290;
&lt;/p&gt;
&lt;p&gt;
When a researcher combines multiple instrumental variables for a single binary treatment, the monotonicity assumption of the local average treatment effects (LATE) framework can become restrictive: it requires that all units share a common direction of response even when separate instruments are shifted in opposing directions. What I call vector monotonicity, by contrast, simply assumes treatment uptake to be monotonic in all instruments, representing a special case of the partial monotonicity assumption introduced by Mogstad et al. (2021). I characterize the class of causal parameters that are point identified under vector monotonicity, when the instruments are binary. This class includes, for example, the average treatment effect among units that are in any way responsive to the collection of instruments, or those that are responsive to a given subset of them. The identification results are constructive and yield a simple estimator for the identified treatment effect parameters. An e
&lt;/p&gt;</description></item></channel></rss>