<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#26032;&#30340;&#39034;&#24207;&#39640;&#25928;&#20266;&#20284;&#28982;&#20272;&#35745;&#22120;(k-EPL)&#65292;&#21487;&#29992;&#20110;&#21160;&#24577;&#31163;&#25955;&#36873;&#25321;&#28216;&#25103;&#23384;&#22312;&#19981;&#23436;&#20840;&#20449;&#24687;&#24773;&#20917;&#19979;&#30340;&#20272;&#35745;&#12290;&#35813;&#26041;&#27861;&#20855;&#26377;&#28176;&#36827;&#26377;&#25928;&#24615;&#21644;&#25910;&#25947;&#24615;&#65292;&#24182;&#30456;&#24403;&#20110;&#26377;&#38480;&#26679;&#26412;&#26497;&#22823;&#20284;&#28982;&#20272;&#35745;&#12290;&#35813;&#26041;&#27861;&#30340;&#35745;&#31639;&#31616;&#21333;&#65292;&#27169;&#25311;&#32467;&#26524;&#35777;&#23454;&#20102;&#29702;&#35770;&#32467;&#26524;&#30340;&#23454;&#38469;&#25928;&#29992;&#12290;</title><link>http://arxiv.org/abs/1912.10488</link><description>&lt;p&gt;
&#21160;&#24577;&#19981;&#23436;&#20840;&#20449;&#24687;&#31163;&#25955;&#21338;&#24328;&#30340;&#39640;&#25928;&#21644;&#25910;&#25947;&#30340;&#39034;&#24207;&#20266;&#20284;&#28982;&#20272;&#35745;
&lt;/p&gt;
&lt;p&gt;
Efficient and Convergent Sequential Pseudo-Likelihood Estimation of Dynamic Discrete Games. (arXiv:1912.10488v3 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/1912.10488
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#26032;&#30340;&#39034;&#24207;&#39640;&#25928;&#20266;&#20284;&#28982;&#20272;&#35745;&#22120;(k-EPL)&#65292;&#21487;&#29992;&#20110;&#21160;&#24577;&#31163;&#25955;&#36873;&#25321;&#28216;&#25103;&#23384;&#22312;&#19981;&#23436;&#20840;&#20449;&#24687;&#24773;&#20917;&#19979;&#30340;&#20272;&#35745;&#12290;&#35813;&#26041;&#27861;&#20855;&#26377;&#28176;&#36827;&#26377;&#25928;&#24615;&#21644;&#25910;&#25947;&#24615;&#65292;&#24182;&#30456;&#24403;&#20110;&#26377;&#38480;&#26679;&#26412;&#26497;&#22823;&#20284;&#28982;&#20272;&#35745;&#12290;&#35813;&#26041;&#27861;&#30340;&#35745;&#31639;&#31616;&#21333;&#65292;&#27169;&#25311;&#32467;&#26524;&#35777;&#23454;&#20102;&#29702;&#35770;&#32467;&#26524;&#30340;&#23454;&#38469;&#25928;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#29992;&#20110;&#21160;&#24577;&#31163;&#25955;&#36873;&#25321;&#28216;&#25103;&#19981;&#23436;&#20840;&#20449;&#24687;&#30340;&#39034;&#24207;&#39640;&#25928;&#20266;&#20284;&#28982;&#20272;&#35745;&#22120;(k-EPL)&#12290;&#25105;&#20204;&#34920;&#26126;&#65292;k-EPL&#24207;&#21015;&#20013;&#30340;&#27599;&#27425;&#36845;&#20195;&#37117;&#26159;&#19968;&#33268;&#21644;&#28176;&#36817;&#26377;&#25928;&#30340;&#65292;&#22240;&#27492;&#65292;&#19968;&#38454;&#28176;&#36817;&#24615;&#36136;&#38543;&#30528;&#36845;&#20195;&#19981;&#21464;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#36825;&#20010;&#24207;&#21015;&#36798;&#21040;&#20102;&#26377;&#38480;&#26679;&#26412;&#26497;&#22823;&#20284;&#28982;&#20272;&#35745;&#30340;&#39640;&#38454;&#31561;&#25928;&#24615;&#65292;&#24182;&#19988;&#24403;&#25968;&#25454;&#30001;&#20219;&#20309;&#27491;&#21017;&#39532;&#23572;&#21487;&#22827;&#23436;&#32654;&#22343;&#34913;&#29983;&#25104;&#26102;&#65292;&#20272;&#35745;&#24207;&#21015;&#20960;&#20046;&#24517;&#28982;&#22320;&#20197;&#36817;&#36229;&#32447;&#24615;&#36895;&#29575;&#25910;&#25947;&#21040;&#26497;&#22823;&#20284;&#28982;&#20272;&#35745;&#12290;&#24403;&#25928;&#29992;&#32447;&#24615;&#21442;&#25968;&#26102;&#65292;k-EPL&#36845;&#20195;&#26159;&#35745;&#31639;&#19978;&#31616;&#21333;&#30340;&#65292;&#21482;&#38656;&#35201;&#30740;&#31350;&#20154;&#21592;&#35299;&#20915;&#32447;&#24615;&#26041;&#31243;&#32452;&#20197;&#29983;&#25104;&#20266;&#22238;&#24402;&#22120;&#65292;&#28982;&#21518;&#22312;&#38745;&#24577;logit/probit&#22238;&#24402;&#20013;&#20351;&#29992;&#23427;&#20204;&#12290;&#33945;&#29305;&#21345;&#32599;&#27169;&#25311;&#23637;&#31034;&#20102;&#29702;&#35770;&#32467;&#26524;&#30340;&#23454;&#38469;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
We propose a new sequential Efficient Pseudo-Likelihood (k-EPL) estimator for dynamic discrete choice games of incomplete information. We show that each iteration in the k-EPL sequence is consistent and asymptotically efficient, so the first-order asymptotic properties do not vary across iterations. Furthermore, we show the sequence achieves higher-order equivalence to the finite-sample maximum likelihood estimator with iteration and that the sequence of estimators converges almost surely to the maximum likelihood estimator at a nearly-superlinear rate when the data are generated by any regular Markov perfect equilibrium, including equilibria that lead to inconsistency of other sequential estimators. When utility is linear in parameters, k-EPL iterations are computationally simple, only requiring that the researcher solve linear systems of equations to generate pseudo-regressors which are used in a static logit/probit regression. Monte Carlo simulations demonstrate the theoretical resu
&lt;/p&gt;</description></item></channel></rss>