<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#26292;&#38706;&#20110;&#29983;&#25104;&#24335;AI&#25216;&#26415;&#30340;&#33258;&#30001;&#32844;&#19994;&#32773;&#22312;&#22312;&#32447;&#24037;&#20316;&#24179;&#21488;&#19978;&#20855;&#26377;&#26356;&#31215;&#26497;&#30340;&#25112;&#30053;&#34892;&#20026;&#65292;&#26356;&#20542;&#21521;&#20110;&#22312;&#29305;&#23450;&#39046;&#22495;&#38598;&#20013;&#30003;&#35831;&#24037;&#20316;&#32844;&#20301;&#12290;</title><link>https://arxiv.org/abs/2403.15262</link><description>&lt;p&gt;
&#22312;&#32447;&#24037;&#20316;&#24179;&#21488;&#19978;&#30340;AI&#26292;&#38706;&#21644;&#25112;&#30053;&#23450;&#20301;
&lt;/p&gt;
&lt;p&gt;
AI Exposure and Strategic Positioning on an Online Work Platform
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.15262
&lt;/p&gt;
&lt;p&gt;
&#26292;&#38706;&#20110;&#29983;&#25104;&#24335;AI&#25216;&#26415;&#30340;&#33258;&#30001;&#32844;&#19994;&#32773;&#22312;&#22312;&#32447;&#24037;&#20316;&#24179;&#21488;&#19978;&#20855;&#26377;&#26356;&#31215;&#26497;&#30340;&#25112;&#30053;&#34892;&#20026;&#65292;&#26356;&#20542;&#21521;&#20110;&#22312;&#29305;&#23450;&#39046;&#22495;&#38598;&#20013;&#30003;&#35831;&#24037;&#20316;&#32844;&#20301;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
AI&#25216;&#26415;&#26377;&#21487;&#33021;&#36890;&#36807;&#25552;&#39640;&#24037;&#20154;&#29983;&#20135;&#21147;&#21644;&#20943;&#23569;&#23545;&#26576;&#20123;&#25216;&#33021;&#25110;&#20219;&#21153;&#30340;&#38656;&#27714;&#26469;&#24433;&#21709;&#21171;&#21160;&#21147;&#24066;&#22330;&#32467;&#26524;&#12290;&#36825;&#20123;&#21464;&#21270;&#21487;&#33021;&#20250;&#23545;&#24037;&#20316;&#32773;&#23547;&#25214;&#24037;&#20316;&#21644;&#23450;&#20301;&#26041;&#24335;&#20135;&#29983;&#37325;&#35201;&#24433;&#21709;&#12290;&#22312;&#35813;&#39033;&#30446;&#20013;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#26292;&#38706;&#20110;&#29983;&#25104;&#24335;AI&#25216;&#26415;&#30340;&#33258;&#30001;&#32844;&#19994;&#32773;&#22312;2022&#24180;12&#26376;ChatGPT&#25512;&#20986;&#21518;&#20250;&#22914;&#20309;&#24433;&#21709;&#22312;&#32447;&#24037;&#20316;&#24179;&#21488;&#19978;&#30340;&#25112;&#30053;&#34892;&#20026;&#12290;&#30456;&#23545;&#20110;&#26292;&#38706;&#36739;&#23569;&#30340;&#21516;&#34892;&#65292;&#25105;&#20204;&#21457;&#29616;&#65292;&#26292;&#38706;&#24230;&#26356;&#39640;&#20110;&#35821;&#35328;&#24314;&#27169;&#25216;&#26415;&#30340;&#33258;&#30001;&#32844;&#19994;&#32773;&#22312;ChatGPT&#25512;&#20986;&#21518;&#20250;&#22312;&#35813;&#24179;&#21488;&#19978;&#30003;&#35831;&#26356;&#22810;&#30340;&#32844;&#20301;&#65292;&#24182;&#22686;&#21152;&#36825;&#20123;&#30003;&#35831;&#22312;&#29305;&#23450;&#19987;&#19994;&#20013;&#30340;&#38598;&#20013;&#24230;&#12290;&#25105;&#20204;&#35760;&#24405;&#20102;&#36825;&#31181;&#25928;&#24212;&#22312;&#33258;&#30001;&#32844;&#19994;&#32773;&#29305;&#24449;&#19978;&#30340;&#24322;&#36136;&#24615;&#65292;&#24182;&#32771;&#34385;&#36825;&#20123;&#34892;&#20026;&#22914;&#20309;&#22609;&#36896;&#25216;&#26415;&#20914;&#20987;&#26159;&#21542;&#20197;&#21450;&#22312;&#22810;&#22823;&#31243;&#24230;&#19978;&#24433;&#21709;&#33258;&#30001;&#32844;&#19994;&#32773;&#22312;&#24179;&#21488;&#19978;&#30340;&#34920;&#29616;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.15262v1 Announce Type: new  Abstract: AI technologies have the potential to affect labor market outcomes by both increasing worker productivity and reducing the demand for certain skills or tasks. Such changes may have important implications for the ways in which workers seek jobs and position themselves. In this project, we examine how exposure to generative AI technologies affects the strategic behavior of freelancer workers on an online work platform following the launch of ChatGPT in December 2022. Relative to their less exposed counterparts, we show that freelancers that are more exposed to language modeling technologies apply for more job posts on the platform following the launch of ChatGPT and increase the concentration of these applications across specializations. We document heterogeneity in this effect across freelancer characteristics and consider how such behaviors shape whether and to what extent the technological shock affects freelancer performance on the pla
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21333;&#33192;&#32960;&#38646;&#25130;&#26029;&#35745;&#25968;&#22238;&#24402;&#27169;&#22411;&#65292;&#29992;&#20110;&#35299;&#20915;&#22312;&#38646;&#25130;&#26029;&#35745;&#25968;&#25968;&#25454;&#20013;&#24120;&#35265;&#20294;&#26410;&#34987;&#35299;&#20915;&#30340;"&#21333;&#33192;&#32960;"&#29616;&#35937;&#12290;&#36890;&#36807;&#27169;&#25311;&#30740;&#31350;&#21644;&#30495;&#23454;&#25968;&#25454;&#38598;&#21457;&#29616;&#65292;&#25105;&#20204;&#30340;&#27169;&#22411;&#22312;&#22823;&#37096;&#20998;&#25968;&#25454;&#20013;&#20248;&#20110;&#20256;&#32479;&#27169;&#22411;&#65292;&#24182;&#25552;&#20379;&#20102;&#30456;&#24212;&#30340;&#20272;&#35745;&#12289;&#36793;&#38469;&#25928;&#24212;&#21644;&#26816;&#39564;&#26041;&#27861;&#12290;</title><link>https://arxiv.org/abs/2402.02272</link><description>&lt;p&gt;
&#21333;&#33192;&#32960;&#38646;&#25130;&#26029;&#35745;&#25968;&#22238;&#24402;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
One-inflated zero-truncated count regression models
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.02272
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21333;&#33192;&#32960;&#38646;&#25130;&#26029;&#35745;&#25968;&#22238;&#24402;&#27169;&#22411;&#65292;&#29992;&#20110;&#35299;&#20915;&#22312;&#38646;&#25130;&#26029;&#35745;&#25968;&#25968;&#25454;&#20013;&#24120;&#35265;&#20294;&#26410;&#34987;&#35299;&#20915;&#30340;"&#21333;&#33192;&#32960;"&#29616;&#35937;&#12290;&#36890;&#36807;&#27169;&#25311;&#30740;&#31350;&#21644;&#30495;&#23454;&#25968;&#25454;&#38598;&#21457;&#29616;&#65292;&#25105;&#20204;&#30340;&#27169;&#22411;&#22312;&#22823;&#37096;&#20998;&#25968;&#25454;&#20013;&#20248;&#20110;&#20256;&#32479;&#27169;&#22411;&#65292;&#24182;&#25552;&#20379;&#20102;&#30456;&#24212;&#30340;&#20272;&#35745;&#12289;&#36793;&#38469;&#25928;&#24212;&#21644;&#26816;&#39564;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#21457;&#29616;&#22312;&#38646;&#25130;&#26029;&#35745;&#25968;&#25968;&#25454;&#65288;y=1,2,...&#65289;&#20013;&#65292;&#20010;&#20307;&#22312;&#31532;&#19968;&#27425;&#35266;&#23519;&#65288;y=1&#65289;&#20013;&#24120;&#24120;&#33719;&#24471;&#20449;&#24687;&#65292;&#23548;&#33268;&#19968;&#31181;&#24120;&#35265;&#20294;&#26410;&#34987;&#35299;&#20915;&#30340;"&#21333;&#33192;&#32960;"&#29616;&#35937;&#12290;&#24403;&#21069;&#30340;&#26631;&#20934;&#27169;&#22411;&#65292;&#38646;&#25130;&#26029;&#36127;&#20108;&#39033;&#65288;ZTNB&#65289;&#27169;&#22411;&#65292;&#22312;&#23384;&#22312;&#21333;&#33192;&#32960;&#26102;&#34987;&#38169;&#35823;&#35774;&#23450;&#65292;&#23548;&#33268;&#20102;&#20559;&#24046;&#21644;&#19981;&#19968;&#33268;&#24615;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#31181;&#21333;&#33192;&#32960;&#38646;&#25130;&#26029;&#36127;&#20108;&#39033;&#65288;OIZTNB&#65289;&#22238;&#24402;&#27169;&#22411;&#12290;&#36890;&#36807;&#27169;&#25311;&#30740;&#31350;&#21644;&#23545;&#22235;&#20010;&#20256;&#32479;&#19978;&#20351;&#29992;ZTNB&#27169;&#22411;&#30340;&#25968;&#25454;&#38598;&#20013;&#21457;&#29616;&#30340;&#21333;&#33192;&#32960;&#29616;&#35937;&#30340;&#30740;&#31350;&#65292;&#25105;&#20204;&#24378;&#35843;&#20102;&#25105;&#20204;&#27169;&#22411;&#30340;&#37325;&#35201;&#24615;&#12290;&#25105;&#20204;&#25512;&#33616;&#22312;&#22823;&#37096;&#20998;&#25968;&#25454;&#20013;&#20351;&#29992;OIZTNB&#27169;&#22411;&#20195;&#26367;ZTNB&#27169;&#22411;&#65292;&#24182;&#25552;&#20379;&#20102;&#20272;&#35745;&#12289;&#36793;&#38469;&#25928;&#24212;&#21644;&#26816;&#39564;&#12290;&#20276;&#38543;&#30340;R&#21253;oneinfl&#25552;&#20379;&#36825;&#20123;&#21151;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;
We find that in zero-truncated count data (y=1,2,...), individuals often gain information at first observation (y=1), leading to a common but unaddressed phenomenon of "one-inflation". The current standard, the zero-truncated negative binomial (ZTNB) model, is misspecified under one-inflation, causing bias and inconsistency. To address this, we introduce the one-inflated zero-truncated negative binomial (OIZTNB) regression model. The importance of our model is highlighted through simulation studies, and through the discovery of one-inflation in four datasets that have traditionally championed ZTNB. We recommended OIZTNB over ZTNB for most data, and provide estimation, marginal effects, and testing in the accompanying R package oneinfl.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#20010;&#22522;&#20110;&#34892;&#20026;&#24515;&#29702;&#23398;&#29702;&#35770;&#30340;&#20998;&#26512;&#26694;&#26550;&#65292;&#36890;&#36807;&#35299;&#37322;&#24615;&#28508;&#21464;&#37327;&#26500;&#24314;&#26469;&#35299;&#37322;&#20154;&#20204;&#26356;&#20542;&#21521;&#20110;&#25317;&#26377;&#33258;&#21160;&#39550;&#39542;&#36710;&#36742;&#32780;&#19981;&#26159;&#20351;&#29992;&#20849;&#20139;&#33258;&#21160;&#39550;&#39542;&#36710;&#36742;(SAV)&#65292;&#20854;&#20013;&#21253;&#25324;&#23454;&#29992;&#20027;&#20041;&#20449;&#24565;&#21644;&#20139;&#20048;&#20027;&#20041;&#20449;&#24565;&#12290;</title><link>http://arxiv.org/abs/2309.03283</link><description>&lt;p&gt;
&#31169;&#20154;&#25317;&#26377;&#19982;&#20849;&#20139;&#33258;&#21160;&#39550;&#39542;&#36710;&#36742;: &#23454;&#29992;&#20027;&#20041;&#20449;&#24565;&#19982;&#20139;&#20048;&#20027;&#20041;&#20449;&#24565;&#30340;&#35282;&#33394;
&lt;/p&gt;
&lt;p&gt;
Privately-Owned versus Shared Automated Vehicle: The Roles of Utilitarian and Hedonic Beliefs. (arXiv:2309.03283v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.03283
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#20010;&#22522;&#20110;&#34892;&#20026;&#24515;&#29702;&#23398;&#29702;&#35770;&#30340;&#20998;&#26512;&#26694;&#26550;&#65292;&#36890;&#36807;&#35299;&#37322;&#24615;&#28508;&#21464;&#37327;&#26500;&#24314;&#26469;&#35299;&#37322;&#20154;&#20204;&#26356;&#20542;&#21521;&#20110;&#25317;&#26377;&#33258;&#21160;&#39550;&#39542;&#36710;&#36742;&#32780;&#19981;&#26159;&#20351;&#29992;&#20849;&#20139;&#33258;&#21160;&#39550;&#39542;&#36710;&#36742;(SAV)&#65292;&#20854;&#20013;&#21253;&#25324;&#23454;&#29992;&#20027;&#20041;&#20449;&#24565;&#21644;&#20139;&#20048;&#20027;&#20041;&#20449;&#24565;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38543;&#30528;&#33258;&#21160;&#39550;&#39542;&#36710;&#36742;&#65288;AV&#65289;&#30340;&#20986;&#29616;&#65292;&#20132;&#36890;&#31995;&#32479;&#26377;&#21487;&#33021;&#21457;&#29983;&#36716;&#21464;&#65292;&#20026;&#23433;&#20840;&#12289;&#20415;&#21033;&#21644;&#39640;&#25928;&#30340;&#20986;&#34892;&#25552;&#20379;&#21487;&#33021;&#65292;&#23588;&#20854;&#26159;&#22312;&#20849;&#20139;&#31995;&#32479;&#20013;&#20351;&#29992;&#26102;&#65288;&#20849;&#20139;AV&#25110;SAV&#65289;&#12290;&#28982;&#32780;&#65292;&#20154;&#20204;&#26356;&#20542;&#21521;&#20110;&#23558;AV&#20316;&#20026;&#31169;&#20154;&#36164;&#20135;&#25317;&#26377;&#65292;&#32780;&#19981;&#26159;&#20351;&#29992;SAV&#12290;&#36825;&#38656;&#35201;&#30740;&#31350;&#27604;&#36739;&#20010;&#20307;&#23545;AV&#21644;SAV&#30340;&#24577;&#24230;&#65292;&#20197;&#35748;&#35782;&#21040;&#20844;&#20247;&#20542;&#21521;&#20110;SAV&#30340;&#38556;&#30861;&#12290;&#20026;&#27492;&#65292;&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#20010;&#22522;&#20110;&#34892;&#20026;&#24515;&#29702;&#23398;&#29702;&#35770;&#30340;&#24314;&#27169;&#26694;&#26550;&#65292;&#20197;&#35299;&#37322;&#20010;&#20307;&#23545;&#25317;&#26377;AV&#32780;&#19981;&#26159;&#20351;&#29992;SAV&#30340;&#20559;&#22909;&#65292;&#35813;&#26694;&#26550;&#24314;&#31435;&#20102;&#19968;&#20010;&#28508;&#22312;&#65288;&#20027;&#35266;&#65289;&#24515;&#29702;&#27979;&#37327;&#26500;&#24314;&#65292;&#24182;&#21253;&#25324;&#19977;&#32452;&#35299;&#37322;&#21464;&#37327;&#26500;&#24314;&#65292;&#21253;&#25324;&#65306;(i) &#23545;&#21033;&#30410;&#25628;&#32034;&#30340;&#28212;&#26395;&#65292;&#21363;&#22806;&#22312;&#21160;&#26426;&#20307;&#29616;&#22312;&#23454;&#29992;&#20027;&#20041;&#20449;&#24565;&#20013;&#65307;(ii) &#23547;&#27714;&#24555;&#20048;&#21644;&#20139;&#21463;&#30340;&#20542;&#21521;&#65292;&#21363;&#20869;&#22312;&#21160;&#26426;&#20307;&#29616;&#22312;&#20139;&#20048;&#20027;&#20041;&#20449;&#24565;&#20013;&#65307;(iii) &#23545;&#19977;&#20010;&#37197;&#32622;&#30340;&#24577;&#24230;&#12290;
&lt;/p&gt;
&lt;p&gt;
Transportation systems will be likely transformed by the emergence of automated vehicles (AVs) promising for safe, convenient, and efficient mobility, especially if used in shared systems (shared AV or SAV). However, the potential tendency is observed towards owning AV as a private asset rather than using SAV. This calls for a research on investigating individuals' attitude towards AV in comparison with SAV to recognize the barriers to the public's tendency towards SAV. To do so, the present study proposes a modeling framework based on the theories in behavioral psychology to explain individuals' preference for owning AV over using SAV, built as a latent (subjective) psychometric construct, by three groups of explanatory latent constructs including: (i) desire for searching for benefits, i.e., extrinsic motive manifested in utilitarian beliefs; (ii) tendency towards seeking pleasure and joy, i.e., intrinsic motive reflected in hedonic beliefs; and (iii) attitude towards three configura
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21160;&#24577;&#22238;&#24402;&#19981;&#36830;&#32493;&#24615;&#35774;&#35745;&#26041;&#27861;&#65292;&#29992;&#20110;&#30830;&#23450;&#32463;&#27982;&#21487;&#35299;&#37322;&#30340;&#26102;&#38388;&#38388;&#38548;&#22788;&#29702;&#25928;&#24212;&#12290;&#30740;&#31350;&#37319;&#29992;&#20102;&#21160;&#24577;&#28508;&#22312;&#32467;&#26524;&#27169;&#22411;&#65292;&#24182;&#29305;&#21035;&#23545;&#26080;&#39044;&#26399;&#21644;&#20849;&#21516;&#36235;&#21183;&#38480;&#21046;&#36827;&#34892;&#20102;&#22788;&#29702;&#65292;&#20197;&#30830;&#23450;&#25351;&#23450;&#20999;&#28857;&#30340;&#20914;&#20987;&#21453;&#24212;&#12290;&#20272;&#35745;&#37327;&#21487;&#20197;&#36890;&#36807;&#26631;&#20934;&#30340;&#23616;&#37096;&#22810;&#39033;&#24335;&#26041;&#27861;&#36827;&#34892;&#35745;&#31639;&#12290;</title><link>http://arxiv.org/abs/2307.14203</link><description>&lt;p&gt;
&#21160;&#24577;&#22238;&#24402;&#19981;&#36830;&#32493;&#24615;&#65306;&#19968;&#31181;&#20869;&#37096;&#35774;&#35745;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
Dynamic Regression Discontinuity: A Within-Design Approach. (arXiv:2307.14203v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.14203
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21160;&#24577;&#22238;&#24402;&#19981;&#36830;&#32493;&#24615;&#35774;&#35745;&#26041;&#27861;&#65292;&#29992;&#20110;&#30830;&#23450;&#32463;&#27982;&#21487;&#35299;&#37322;&#30340;&#26102;&#38388;&#38388;&#38548;&#22788;&#29702;&#25928;&#24212;&#12290;&#30740;&#31350;&#37319;&#29992;&#20102;&#21160;&#24577;&#28508;&#22312;&#32467;&#26524;&#27169;&#22411;&#65292;&#24182;&#29305;&#21035;&#23545;&#26080;&#39044;&#26399;&#21644;&#20849;&#21516;&#36235;&#21183;&#38480;&#21046;&#36827;&#34892;&#20102;&#22788;&#29702;&#65292;&#20197;&#30830;&#23450;&#25351;&#23450;&#20999;&#28857;&#30340;&#20914;&#20987;&#21453;&#24212;&#12290;&#20272;&#35745;&#37327;&#21487;&#20197;&#36890;&#36807;&#26631;&#20934;&#30340;&#23616;&#37096;&#22810;&#39033;&#24335;&#26041;&#27861;&#36827;&#34892;&#35745;&#31639;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#35770;&#35777;&#26041;&#27861;&#65292;&#29992;&#26469;&#22312;&#21160;&#24577;&#22238;&#24402;&#19981;&#36830;&#32493;&#24615;&#35774;&#35745;&#20013;&#30830;&#23450;&#32463;&#27982;&#21487;&#35299;&#37322;&#30340;&#26102;&#38388;&#38388;&#38548;&#22788;&#29702;&#25928;&#24212;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#25105;&#21457;&#23637;&#20102;&#19968;&#20010;&#21160;&#24577;&#28508;&#22312;&#32467;&#26524;&#27169;&#22411;&#65292;&#24182;&#29305;&#22320;&#23545;&#24046;&#24322;-in-differences&#25991;&#29486;&#20013;&#30340;&#20004;&#20010;&#20551;&#35774;&#36827;&#34892;&#20102;&#19987;&#38376;&#21270;&#22788;&#29702;&#65292;&#21363;&#26080;&#39044;&#26399;&#21644;&#20849;&#21516;&#36235;&#21183;&#38480;&#21046;&#65292;&#20197;&#30830;&#23450;&#25351;&#23450;&#20999;&#28857;&#30340;&#20914;&#20987;&#21453;&#24212;&#12290;&#19982;&#27599;&#20010;&#30446;&#26631;&#21442;&#25968;&#30456;&#20851;&#30340;&#20272;&#35745;&#37327;&#21487;&#20197;&#34920;&#31034;&#20026;&#20004;&#20010;&#38745;&#24577;&#22238;&#24402;&#19981;&#36830;&#32493;&#24615;&#35774;&#35745;&#32467;&#26524;&#23545;&#27604;&#30340;&#21644;&#65292;&#20174;&#32780;&#21487;&#20197;&#36890;&#36807;&#26631;&#20934;&#30340;&#23616;&#37096;&#22810;&#39033;&#24335;&#24037;&#20855;&#36827;&#34892;&#20272;&#35745;&#12290;&#25105;&#21033;&#29992;&#26377;&#38480;&#36335;&#24452;&#29420;&#31435;&#24615;&#20551;&#35774;&#26469;&#38477;&#20302;&#38382;&#39064;&#30340;&#32500;&#24230;&#12290;
&lt;/p&gt;
&lt;p&gt;
I propose a novel argument to point identify economically interpretable intertemporal treatment effects in dynamic regression discontinuity designs (RDDs). Specifically, I develop a dynamic potential outcomes model and specialize two assumptions of the difference-in-differences literature, the no anticipation and common trends restrictions, to point identify cutoff-specific impulse responses. The estimand associated with each target parameter can be expressed as the sum of two static RDD outcome contrasts, thereby allowing for estimation via standard local polynomial tools. I leverage a limited path independence assumption to reduce the dimensionality of the problem.
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#38271;&#26399;&#39033;&#30446;&#20013;&#38599;&#20323;&#20195;&#29702;&#20154;&#30340;&#26816;&#26597;&#31574;&#30053;&#12290;&#21608;&#26399;&#24615;&#26816;&#26597;&#36866;&#29992;&#20110;&#20195;&#29702;&#20154;&#30340;&#34892;&#20026;&#20027;&#35201;&#21152;&#36895;&#31361;&#30772;&#65292;&#38543;&#26426;&#26816;&#26597;&#36866;&#29992;&#20110;&#20195;&#29702;&#20154;&#30340;&#34892;&#20026;&#20027;&#35201;&#24310;&#36831;&#23849;&#28291;&#12290;&#20195;&#29702;&#20154;&#30340;&#34892;&#20026;&#20915;&#23450;&#20102;&#20182;&#22312;&#24809;&#32602;&#26102;&#38388;&#26041;&#38754;&#30340;&#39118;&#38505;&#24577;&#24230;&#12290;</title><link>http://arxiv.org/abs/2304.01385</link><description>&lt;p&gt;
&#26816;&#26597;&#26102;&#38388;&#21487;&#39044;&#27979;&#21527;&#65311;
&lt;/p&gt;
&lt;p&gt;
Should the Timing of Inspections be Predictable?. (arXiv:2304.01385v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2304.01385
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#38271;&#26399;&#39033;&#30446;&#20013;&#38599;&#20323;&#20195;&#29702;&#20154;&#30340;&#26816;&#26597;&#31574;&#30053;&#12290;&#21608;&#26399;&#24615;&#26816;&#26597;&#36866;&#29992;&#20110;&#20195;&#29702;&#20154;&#30340;&#34892;&#20026;&#20027;&#35201;&#21152;&#36895;&#31361;&#30772;&#65292;&#38543;&#26426;&#26816;&#26597;&#36866;&#29992;&#20110;&#20195;&#29702;&#20154;&#30340;&#34892;&#20026;&#20027;&#35201;&#24310;&#36831;&#23849;&#28291;&#12290;&#20195;&#29702;&#20154;&#30340;&#34892;&#20026;&#20915;&#23450;&#20102;&#20182;&#22312;&#24809;&#32602;&#26102;&#38388;&#26041;&#38754;&#30340;&#39118;&#38505;&#24577;&#24230;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#19968;&#20301;&#22996;&#25176;&#20154;&#32856;&#35831;&#19968;&#20010;&#20195;&#29702;&#20154;&#38271;&#26399;&#20174;&#20107;&#24037;&#20316;&#65292;&#35813;&#24037;&#20316;&#20250;&#22312;&#26576;&#20010;&#26102;&#21051;&#31361;&#30772;&#25110;&#32773;&#23849;&#28291;&#12290;&#22312;&#27599;&#20010;&#26102;&#21051;&#65292;&#20195;&#29702;&#20154;&#20250;&#31169;&#19979;&#36873;&#25321;&#24037;&#20316;&#25110;&#36867;&#36991;&#36131;&#20219;&#12290;&#24037;&#20316;&#21487;&#20197;&#22686;&#21152;&#31361;&#30772;&#21040;&#26469;&#30340;&#36895;&#24230;&#24182;&#20943;&#23569;&#23849;&#28291;&#21040;&#26469;&#30340;&#36895;&#24230;&#12290;&#20026;&#20102;&#28608;&#21169;&#20195;&#29702;&#20154;&#24037;&#20316;&#65292;&#22996;&#25176;&#20154;&#20250;&#36827;&#34892;&#26114;&#36149;&#30340;&#26816;&#26597;&#65292;&#22914;&#26524;&#21457;&#29616;&#20195;&#29702;&#20154;&#22312;&#36867;&#36991;&#36131;&#20219;&#65292;&#23601;&#20250;&#35299;&#38599;&#20182;&#12290;&#25105;&#20204;&#30830;&#23450;&#20102;&#22996;&#25176;&#20154;&#30340;&#26368;&#20339;&#26816;&#26597;&#31574;&#30053;&#12290;&#24403;&#24037;&#20316;&#20027;&#35201;&#21152;&#36895;&#31361;&#30772;&#26102;&#65292;&#21608;&#26399;&#24615;&#26816;&#26597;&#26159;&#26368;&#20248;&#30340;&#12290;&#24403;&#24037;&#20316;&#20027;&#35201;&#24310;&#36831;&#23849;&#28291;&#26102;&#65292;&#38543;&#26426;&#26816;&#26597;&#26159;&#26368;&#20248;&#30340;&#12290;&#33267;&#20851;&#37325;&#35201;&#30340;&#26159;&#65292;&#20195;&#29702;&#20154;&#30340;&#34892;&#20026;&#20915;&#23450;&#20102;&#20182;&#22312;&#24809;&#32602;&#26102;&#38388;&#26041;&#38754;&#30340;&#39118;&#38505;&#24577;&#24230;&#12290;
&lt;/p&gt;
&lt;p&gt;
A principal hires an agent to work on a long-term project that culminates in a breakthrough or a breakdown. At each time, the agent privately chooses to work or shirk. Working increases the arrival rate of breakthroughs and decreases the arrival rate of breakdowns. To motivate the agent to work, the principal conducts costly inspections. She fires the agent if shirking is detected. We characterize the principal's optimal inspection policy. Periodic inspections are optimal if work primarily speeds up breakthroughs. Random inspections are optimal if work primarily delays breakdowns. Crucially, the agent's actions determine his risk-attitude over the timing of punishments.
&lt;/p&gt;</description></item></channel></rss>