<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21452;&#37325;&#31283;&#20581;&#20272;&#35745;&#26041;&#27861;&#65292;&#29992;&#20110;&#20272;&#35745;&#26426;&#22120;&#23398;&#20064;&#19979;&#30340;&#30452;&#25509;&#21644;&#38388;&#25509;&#20998;&#20301;&#27835;&#30103;&#25928;&#24212;&#65292;&#36890;&#36807;&#26426;&#22120;&#23398;&#20064;&#21644;&#20132;&#21449;&#25311;&#21512;&#26469;&#22788;&#29702;&#21487;&#35266;&#27979;&#36873;&#25321;&#20559;&#24046;&#65292;&#24182;&#25552;&#20986;&#20102;&#20056;&#27861;&#33258;&#21161;&#27861;&#36827;&#34892;&#32479;&#35745;&#25512;&#26029;&#12290;</title><link>http://arxiv.org/abs/2307.01049</link><description>&lt;p&gt;
&#21452;&#37325;&#31283;&#20581;&#20272;&#35745;&#26426;&#22120;&#23398;&#20064;&#19979;&#30340;&#30452;&#25509;&#21644;&#38388;&#25509;&#20998;&#20301;&#27835;&#30103;&#25928;&#24212;
&lt;/p&gt;
&lt;p&gt;
Doubly Robust Estimation of Direct and Indirect Quantile Treatment Effects with Machine Learning. (arXiv:2307.01049v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.01049
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21452;&#37325;&#31283;&#20581;&#20272;&#35745;&#26041;&#27861;&#65292;&#29992;&#20110;&#20272;&#35745;&#26426;&#22120;&#23398;&#20064;&#19979;&#30340;&#30452;&#25509;&#21644;&#38388;&#25509;&#20998;&#20301;&#27835;&#30103;&#25928;&#24212;&#65292;&#36890;&#36807;&#26426;&#22120;&#23398;&#20064;&#21644;&#20132;&#21449;&#25311;&#21512;&#26469;&#22788;&#29702;&#21487;&#35266;&#27979;&#36873;&#25321;&#20559;&#24046;&#65292;&#24182;&#25552;&#20986;&#20102;&#20056;&#27861;&#33258;&#21161;&#27861;&#36827;&#34892;&#32479;&#35745;&#25512;&#26029;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#21452;&#37325;/&#26080;&#20559;&#30340;&#26426;&#22120;&#23398;&#20064;&#20272;&#35745;&#26041;&#27861;&#65292;&#29992;&#20110;&#22788;&#29702;&#21487;&#35266;&#27979;&#36873;&#25321;&#20559;&#24046;&#30340;&#24773;&#20917;&#19979;&#30340;&#30452;&#25509;&#21644;&#38388;&#25509;&#20998;&#20301;&#27835;&#30103;&#25928;&#24212;&#12290;&#36825;&#20351;&#24471;&#33021;&#22815;&#23558;&#20108;&#36827;&#21046;&#27835;&#30103;&#30340;&#22240;&#26524;&#25928;&#24212;&#22312;&#29305;&#23450;&#32467;&#26524;&#25490;&#21517;&#19978;&#20998;&#35299;&#20026;&#36890;&#36807;&#20013;&#20171;&#21464;&#37327;&#65288;&#31216;&#20026;&#20013;&#20171;&#22240;&#23376;&#65289;&#38388;&#25509;&#24433;&#21709;&#21644;&#65288;&#26410;&#32463;&#20013;&#20171;&#30340;&#65289;&#30452;&#25509;&#24433;&#21709;&#30340;&#32452;&#25104;&#37096;&#20998;&#12290;&#25152;&#25552;&#26041;&#27861;&#22522;&#20110;&#28508;&#22312;&#32467;&#26524;&#30340;&#32047;&#31215;&#20998;&#24067;&#20989;&#25968;&#30340;&#26377;&#25928;&#24471;&#20998;&#20989;&#25968;&#65292;&#23545;&#20110;&#26576;&#20123;&#22266;&#23450;&#21442;&#25968;&#30340;&#20559;&#24046;&#65292;&#22914;&#32467;&#26524;&#12289;&#22788;&#29702;&#21644;&#20013;&#20171;&#27169;&#22411;&#65292;&#26159;&#31283;&#20581;&#30340;&#12290;&#25105;&#20204;&#36890;&#36807;&#26426;&#22120;&#23398;&#20064;&#26469;&#20272;&#35745;&#36825;&#20123;&#22266;&#23450;&#21442;&#25968;&#65292;&#24182;&#20351;&#29992;&#20132;&#21449;&#25311;&#21512;&#26469;&#20943;&#23567;&#23545;&#30452;&#25509;&#21644;&#38388;&#25509;&#20998;&#20301;&#27835;&#30103;&#25928;&#24212;&#20272;&#35745;&#30340;&#36807;&#25311;&#21512;&#20559;&#24046;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#25105;&#20204;&#25928;&#26524;&#20272;&#35745;&#37327;&#30340;&#19968;&#33268;&#24615;&#21644;&#28176;&#36817;&#27491;&#24577;&#24615;&#12290;&#25105;&#20204;&#36824;&#25552;&#20986;&#20102;&#19968;&#20010;&#20056;&#27861;&#33258;&#21161;&#27861;&#36827;&#34892;&#32479;&#35745;&#25512;&#26029;&#65292;&#24182;&#23637;&#31034;&#20102;&#20056;&#27861;&#33258;&#21161;&#27861;&#30340;&#26377;&#25928;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
We suggest double/debiased machine learning estimators of direct and indirect quantile treatment effects under a selection-on-observables assumption. This permits disentangling the causal effect of a binary treatment at a specific outcome rank into an indirect component that operates through an intermediate variable called mediator and an (unmediated) direct impact. The proposed method is based on the efficient score functions of the cumulative distribution functions of potential outcomes, which are robust to certain misspecifications of the nuisance parameters, i.e., the outcome, treatment, and mediator models. We estimate these nuisance parameters by machine learning and use cross-fitting to reduce overfitting bias in the estimation of direct and indirect quantile treatment effects. We establish uniform consistency and asymptotic normality of our effect estimators. We also propose a multiplier bootstrap for statistical inference and show the validity of the multiplier bootstrap. Fina
&lt;/p&gt;</description></item><item><title>&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#22522;&#20110;$\ell_1$&#24809;&#32602;&#30340;&#39640;&#32500;&#39044;&#26399;&#19979;&#36300;&#22343;&#20540;&#22238;&#24402;&#27169;&#22411;&#30340;&#20272;&#35745;&#22120;&#65292;&#36866;&#29992;&#20110;&#37325;&#23614;&#26102;&#38388;&#24207;&#21015;&#25968;&#25454;&#65292;&#24182;&#19988;&#32473;&#20986;&#20102;&#39044;&#27979;&#21644;&#20272;&#35745;&#35823;&#24046;&#30340;&#38750;&#28176;&#36817;&#30028;&#38480;&#21644;&#19968;&#33268;&#24615;&#26465;&#20214;&#12290;&#22312;&#23454;&#35777;&#24212;&#29992;&#20013;&#65292;&#25105;&#20204;&#21457;&#29616;&#38750;&#32447;&#24615;&#27169;&#22411;&#34920;&#29616;&#20248;&#20110;&#32447;&#24615;&#27169;&#22411;&#12290;</title><link>http://arxiv.org/abs/2307.01033</link><description>&lt;p&gt;
&#39044;&#26399;&#19979;&#36300;&#22343;&#20540;&#22238;&#24402;LASSO&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
Expected Shortfall LASSO. (arXiv:2307.01033v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.01033
&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#22522;&#20110;$\ell_1$&#24809;&#32602;&#30340;&#39640;&#32500;&#39044;&#26399;&#19979;&#36300;&#22343;&#20540;&#22238;&#24402;&#27169;&#22411;&#30340;&#20272;&#35745;&#22120;&#65292;&#36866;&#29992;&#20110;&#37325;&#23614;&#26102;&#38388;&#24207;&#21015;&#25968;&#25454;&#65292;&#24182;&#19988;&#32473;&#20986;&#20102;&#39044;&#27979;&#21644;&#20272;&#35745;&#35823;&#24046;&#30340;&#38750;&#28176;&#36817;&#30028;&#38480;&#21644;&#19968;&#33268;&#24615;&#26465;&#20214;&#12290;&#22312;&#23454;&#35777;&#24212;&#29992;&#20013;&#65292;&#25105;&#20204;&#21457;&#29616;&#38750;&#32447;&#24615;&#27169;&#22411;&#34920;&#29616;&#20248;&#20110;&#32447;&#24615;&#27169;&#22411;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#22522;&#20110;$\ell_1$&#24809;&#32602;&#30340;&#39640;&#32500;&#39044;&#26399;&#19979;&#36300;&#22343;&#20540;&#22238;&#24402;&#65288;Expected Shortfall&#65289;&#27169;&#22411;&#30340;&#20272;&#35745;&#22120;&#12290;&#35813;&#20272;&#35745;&#22120;&#26159;&#36890;&#36807;&#27714;&#35299;&#19968;&#20010;&#26368;&#23567;&#20108;&#20056;&#38382;&#39064;&#24471;&#21040;&#30340;&#65292;&#20854;&#20013;&#36741;&#21161;&#22240;&#21464;&#37327;&#26159;&#20381;&#36182;&#21464;&#37327;&#21644;&#39044;&#20272;&#23614;&#37096;&#20998;&#20301;&#25968;&#30340;&#36716;&#25442;&#12290;&#21033;&#29992;&#31232;&#30095;&#24615;&#26465;&#20214;&#65292;&#25105;&#20204;&#23548;&#20986;&#20102;&#39044;&#26399;&#19979;&#36300;&#22343;&#20540;&#22238;&#24402;&#20272;&#35745;&#22120;&#30340;&#39044;&#27979;&#21644;&#20272;&#35745;&#35823;&#24046;&#30340;&#38750;&#28176;&#36817;&#30028;&#38480;&#65292;&#32771;&#34385;&#20102;&#20381;&#36182;&#21464;&#37327;&#30340;&#20272;&#35745;&#35823;&#24046;&#65292;&#24182;&#32473;&#20986;&#20102;&#20272;&#35745;&#22120;&#19968;&#33268;&#24615;&#30340;&#26465;&#20214;&#12290;&#25105;&#20204;&#30340;&#20272;&#35745;&#22120;&#36866;&#29992;&#20110;&#37325;&#23614;&#26102;&#38388;&#24207;&#21015;&#25968;&#25454;&#65292;&#24182;&#19988;&#21457;&#29616;&#27169;&#22411;&#20013;&#30340;&#21442;&#25968;&#25968;&#37327;&#21487;&#33021;&#38543;&#26679;&#26412;&#37327;&#21644;&#25968;&#25454;&#20013;&#30340;&#30456;&#20851;&#24615;&#21644;&#37325;&#23614;&#24615;&#32780;&#22686;&#38271;&#12290;&#22312;&#19968;&#20010;&#23454;&#35777;&#24212;&#29992;&#20013;&#65292;&#25105;&#20204;&#32771;&#34385;&#20102;&#31995;&#32479;&#39118;&#38505;&#24230;&#37327;CoES&#65292;&#24182;&#32771;&#34385;&#20102;&#19968;&#32452;&#29366;&#24577;&#21464;&#37327;&#30340;&#38750;&#32447;&#24615;&#36716;&#25442;&#20316;&#20026;&#22238;&#24402;&#21464;&#37327;&#12290;&#25105;&#20204;&#21457;&#29616;&#38750;&#32447;&#24615;&#27169;&#22411;&#34920;&#29616;&#20248;&#20110;&#19968;&#20010;&#32447;&#24615;&#27169;&#22411;&#12290;
&lt;/p&gt;
&lt;p&gt;
We propose an $\ell_1$-penalized estimator for high-dimensional models of Expected Shortfall (ES). The estimator is obtained as the solution to a least-squares problem for an auxiliary dependent variable, which is defined as a transformation of the dependent variable and a pre-estimated tail quantile. Leveraging a sparsity condition, we derive a nonasymptotic bound on the prediction and estimator errors of the ES estimator, accounting for the estimation error in the dependent variable, and provide conditions under which the estimator is consistent. Our estimator is applicable to heavy-tailed time-series data and we find that the amount of parameters in the model may grow with the sample size at a rate that depends on the dependence and heavy-tailedness in the data. In an empirical application, we consider the systemic risk measure CoES and consider a set of regressors that consists of nonlinear transformations of a set of state variables. We find that the nonlinear model outperforms an
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#22312;&#32473;&#23450;&#36793;&#38469;&#20998;&#24067;&#30340;&#26497;&#31471;&#24066;&#22330;&#27169;&#22411;&#19979;&#65292;&#37329;&#34701;&#34893;&#29983;&#21697;&#30340;&#22797;&#21046;&#38382;&#39064;&#12290;&#40065;&#26834;&#37329;&#34701;&#27169;&#22411;&#26159;&#19968;&#31181;&#33021;&#22815;&#32771;&#34385;&#37329;&#34701;&#24066;&#22330;&#19981;&#30830;&#23450;&#24615;&#21644;&#21464;&#21160;&#30340;&#27169;&#22411;&#65292; Martingale Optimal Transport&#26159;&#20854;&#20013;&#30340;&#37325;&#35201;&#30740;&#31350;&#26041;&#21521;&#12290;</title><link>http://arxiv.org/abs/2307.00807</link><description>&lt;p&gt;
&#22312;&#32473;&#23450;&#36793;&#38469;&#20998;&#24067;&#30340;&#26497;&#31471;&#24066;&#22330;&#27169;&#22411;&#19979;&#30340;&#37329;&#34701;&#34893;&#29983;&#21697;&#22797;&#21046;
&lt;/p&gt;
&lt;p&gt;
Replication of financial derivatives under extreme market models given marginals. (arXiv:2307.00807v1 [q-fin.MF])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.00807
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#22312;&#32473;&#23450;&#36793;&#38469;&#20998;&#24067;&#30340;&#26497;&#31471;&#24066;&#22330;&#27169;&#22411;&#19979;&#65292;&#37329;&#34701;&#34893;&#29983;&#21697;&#30340;&#22797;&#21046;&#38382;&#39064;&#12290;&#40065;&#26834;&#37329;&#34701;&#27169;&#22411;&#26159;&#19968;&#31181;&#33021;&#22815;&#32771;&#34385;&#37329;&#34701;&#24066;&#22330;&#19981;&#30830;&#23450;&#24615;&#21644;&#21464;&#21160;&#30340;&#27169;&#22411;&#65292; Martingale Optimal Transport&#26159;&#20854;&#20013;&#30340;&#37325;&#35201;&#30740;&#31350;&#26041;&#21521;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
Black-Scholes-Merton&#27169;&#22411;&#26159;&#25551;&#36848;&#37329;&#34701;&#24066;&#22330;&#21160;&#24577;&#30340;&#25968;&#23398;&#27169;&#22411;&#65292;&#21253;&#25324;&#34893;&#29983;&#21697;&#25237;&#36164;&#24037;&#20855;&#65292;&#36890;&#36807;&#35813;&#27169;&#22411;&#30340;&#20844;&#24335;&#21487;&#20197;&#25552;&#20379;&#27431;&#24335;&#26399;&#26435;&#30340;&#29702;&#35770;&#20215;&#26684;&#20272;&#35745;&#12290;&#35813;&#27169;&#22411;&#30340;&#22522;&#26412;&#24605;&#24819;&#26159;&#36890;&#36807;&#20197;&#29305;&#23450;&#26041;&#24335;&#36141;&#20080;&#21644;&#20986;&#21806;&#22522;&#30784;&#36164;&#20135;&#26469;&#23545;&#20914;&#26399;&#26435;&#30340;&#39118;&#38505;&#65292;&#21363;&#36890;&#36807;&#19968;&#20010;&#36164;&#20135;&#32452;&#21512;&#26469;&#22797;&#21046;&#26399;&#26435;&#30340;&#22238;&#25253;&#65292;&#35813;&#36164;&#20135;&#32452;&#21512;&#22312;&#27599;&#20010;&#26102;&#38388;&#28857;&#30340;&#20215;&#20540;&#26159;&#21487;&#20197;&#39564;&#35777;&#30340;&#12290;&#36825;&#20010;&#20219;&#21153;&#30340;&#19968;&#20010;&#26368;&#20851;&#38190;&#20294;&#38480;&#21046;&#24615;&#30340;&#20551;&#35774;&#26159;&#24066;&#22330;&#36981;&#24490;&#20960;&#20309;&#24067;&#26391;&#36816;&#21160;&#65292;&#36825;&#31181;&#20551;&#35774;&#24050;&#32463;&#34987;&#25918;&#26494;&#21644;&#25512;&#24191;&#20102;&#21508;&#31181;&#26041;&#24335;&#12290;&#40065;&#26834;&#37329;&#34701;&#30340;&#27010;&#24565;&#22260;&#32469;&#30528;&#24320;&#21457;&#33021;&#22815;&#32771;&#34385;&#37329;&#34701;&#24066;&#22330;&#30340;&#19981;&#30830;&#23450;&#24615;&#21644;&#21464;&#21160;&#30340;&#27169;&#22411;&#12290;&#21033;&#29992;&#38797;&#28857;&#32763;&#36716;&#29702;&#35770;&#26469;&#25512;&#23548;&#30340;&#40065;&#26834;&#37329;&#34701;&#27169;&#22411;&#26159;&#20854;&#20013;&#26368;&#37325;&#35201;&#30340;&#26041;&#21521;&#20043;&#19968;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;... (&#20869;&#23481;&#22826;&#38271;&#65292;&#21518;&#32493;&#30465;&#30053;)
&lt;/p&gt;
&lt;p&gt;
The Black-Scholes-Merton model is a mathematical model for the dynamics of a financial market that includes derivative investment instruments, and its formula provides a theoretical price estimate of European-style options. The model's fundamental idea is to eliminate risk by hedging the option by purchasing and selling the underlying asset in a specific way, that is, to replicate the payoff of the option with a portfolio (which continuously trades the underlying) whose value at each time can be verified. One of the most crucial, yet restrictive, assumptions for this task is that the market follows a geometric Brownian motion, which has been relaxed and generalized in various ways.  The concept of robust finance revolves around developing models that account for uncertainties and variations in financial markets. Martingale Optimal Transport, which is an adaptation of the Optimal Transport theory to the robust financial framework, is one of the most prominent directions. In this paper, 
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#36890;&#36807;&#26368;&#20248;&#36755;&#36816;&#37327;&#21270;&#36793;&#38469;&#38382;&#39064;&#20013;&#30340;&#20998;&#24067;&#27169;&#22411;&#39118;&#38505;&#65292;&#24182;&#24314;&#31435;&#20102;&#24378;&#23545;&#20598;&#24615;&#12289;&#26377;&#38480;&#24615;&#21644;&#23384;&#22312;&#24615;&#30340;&#32467;&#26524;&#12290;&#27492;&#22806;&#65292;&#36824;&#36890;&#36807;&#22235;&#20010;&#23454;&#38469;&#24212;&#29992;&#23637;&#31034;&#20102;&#23545;&#24453;&#22788;&#29702;&#25928;&#24212;&#30340;&#37096;&#20998;&#35782;&#21035;&#21644;&#40065;&#26834;&#31119;&#21033;&#20989;&#25968;&#30340;&#22806;&#37096;&#26377;&#25928;&#27835;&#30103;&#36873;&#25321;&#31561;&#26041;&#38754;&#30340;&#32467;&#26524;&#12290;</title><link>http://arxiv.org/abs/2307.00779</link><description>&lt;p&gt;
&#36890;&#36807;&#26368;&#20248;&#36755;&#36816;&#37327;&#21270;&#36793;&#38469;&#38382;&#39064;&#20013;&#30340;&#20998;&#24067;&#27169;&#22411;&#39118;&#38505;
&lt;/p&gt;
&lt;p&gt;
Quantifying Distributional Model Risk in Marginal Problems via Optimal Transport. (arXiv:2307.00779v1 [math.OC])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.00779
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36890;&#36807;&#26368;&#20248;&#36755;&#36816;&#37327;&#21270;&#36793;&#38469;&#38382;&#39064;&#20013;&#30340;&#20998;&#24067;&#27169;&#22411;&#39118;&#38505;&#65292;&#24182;&#24314;&#31435;&#20102;&#24378;&#23545;&#20598;&#24615;&#12289;&#26377;&#38480;&#24615;&#21644;&#23384;&#22312;&#24615;&#30340;&#32467;&#26524;&#12290;&#27492;&#22806;&#65292;&#36824;&#36890;&#36807;&#22235;&#20010;&#23454;&#38469;&#24212;&#29992;&#23637;&#31034;&#20102;&#23545;&#24453;&#22788;&#29702;&#25928;&#24212;&#30340;&#37096;&#20998;&#35782;&#21035;&#21644;&#40065;&#26834;&#31119;&#21033;&#20989;&#25968;&#30340;&#22806;&#37096;&#26377;&#25928;&#27835;&#30103;&#36873;&#25321;&#31561;&#26041;&#38754;&#30340;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#36793;&#38469;&#38382;&#39064;&#20013;&#30340;&#20998;&#24067;&#27169;&#22411;&#39118;&#38505;&#65292;&#20854;&#20013;&#27599;&#20010;&#36793;&#38469;&#27979;&#24230;&#34987;&#20551;&#35774;&#22312;&#20197;&#32473;&#23450;&#21322;&#24452;&#20026;&#20013;&#24515;&#30340;Wasserstein&#29699;&#20869;&#65292;&#19982;&#19968;&#20010;&#22266;&#23450;&#30340;&#21442;&#32771;&#27979;&#24230;&#30456;&#23545;&#24212;&#12290;&#22312;&#29702;&#35770;&#19978;&#65292;&#25105;&#20204;&#24314;&#31435;&#20102;&#20960;&#20010;&#22522;&#26412;&#32467;&#26524;&#65292;&#21253;&#25324;&#24378;&#23545;&#20598;&#24615;&#12289;&#25152;&#25552;&#20986;&#30340;Wasserstein&#20998;&#24067;&#27169;&#22411;&#39118;&#38505;&#30340;&#26377;&#38480;&#24615;&#65292;&#20197;&#21450;&#22312;&#27599;&#20010;&#21322;&#24452;&#19978;&#23384;&#22312;&#26368;&#20248;&#35299;&#30340;&#23384;&#22312;&#24615;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36824;&#23637;&#31034;&#20102;Wasserstein&#20998;&#24067;&#27169;&#22411;&#39118;&#38505;&#20316;&#20026;&#21322;&#24452;&#20989;&#25968;&#30340;&#36830;&#32493;&#24615;&#12290;&#21033;&#29992;&#24378;&#23545;&#20598;&#24615;&#65292;&#25105;&#20204;&#23558;&#29992;&#20110;&#32473;&#23450;&#36793;&#38469;&#30340;&#38543;&#26426;&#21464;&#37327;&#21644;&#30340;&#20998;&#24067;&#20989;&#25968;&#30340;&#33879;&#21517;Makarov&#30028;&#25193;&#23637;&#21040;Wasserstein&#20998;&#24067;&#40065;&#26834;Markarov&#30028;&#12290;&#22312;&#23454;&#36341;&#20013;&#65292;&#25105;&#20204;&#36890;&#36807;&#22235;&#20010;&#19981;&#21516;&#30340;&#24212;&#29992;&#26469;&#35828;&#26126;&#25105;&#20204;&#30340;&#32467;&#26524;&#65292;&#24403;&#26679;&#26412;&#20449;&#24687;&#26469;&#33258;&#22810;&#20010;&#25968;&#25454;&#28304;&#19988;&#21482;&#26377;&#19968;&#20123;&#36793;&#38469;&#21442;&#32771;&#27979;&#24230;&#34987;&#30830;&#23450;&#26102;&#12290;&#23427;&#20204;&#26159;&#65306;&#23545;&#24453;&#22788;&#29702;&#25928;&#24212;&#30340;&#37096;&#20998;&#35782;&#21035;&#65307;&#36890;&#36807;&#40065;&#26834;&#31119;&#21033;&#20989;&#25968;&#30340;&#22806;&#37096;&#26377;&#25928;&#27835;&#30103;&#36873;&#25321;
&lt;/p&gt;
&lt;p&gt;
This paper studies distributional model risk in marginal problems, where each marginal measure is assumed to lie in a Wasserstein ball centered at a fixed reference measure with a given radius. Theoretically, we establish several fundamental results including strong duality, finiteness of the proposed Wasserstein distributional model risk, and the existence of an optimizer at each radius. In addition, we show continuity of the Wasserstein distributional model risk as a function of the radius. Using strong duality, we extend the well-known Makarov bounds for the distribution function of the sum of two random variables with given marginals to Wasserstein distributionally robust Markarov bounds. Practically, we illustrate our results on four distinct applications when the sample information comes from multiple data sources and only some marginal reference measures are identified. They are: partial identification of treatment effects; externally valid treatment choice via robust welfare fu
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#20844;&#29702;&#35201;&#27714;&#65292;&#21363;&#24102;&#30528;&#34394;&#25311;&#20154;&#30340;&#39034;&#24207;&#32500;&#25345;&#65292;&#26469;&#35299;&#20915;&#21338;&#29289;&#39302;&#36890;&#34892;&#35777;&#25910;&#20837;&#20998;&#37197;&#38382;&#39064;&#12290;&#36890;&#36807;&#26367;&#25442;&#20256;&#32479;&#30340;&#34394;&#25311;&#20154;&#20844;&#29702;&#65292;&#25105;&#20204;&#24471;&#21040;&#20102;&#20960;&#20010;&#35268;&#21017;&#23478;&#26063;&#65292;&#36825;&#20123;&#35268;&#21017;&#23478;&#26063;&#26159;&#22343;&#21248;&#21644;Shapley&#26041;&#27861;&#30340;&#20984;&#32452;&#21512;&#65292;&#20174;&#32780;&#25512;&#24191;&#20102;&#29616;&#26377;&#25991;&#29486;&#20013;&#30340;&#30740;&#31350;&#32467;&#26524;&#12290;</title><link>http://arxiv.org/abs/2307.00622</link><description>&lt;p&gt;
&#22312;&#21338;&#29289;&#39302;&#36890;&#34892;&#35777;&#38382;&#39064;&#20013;&#30340;&#34394;&#25311;&#20154;&#32500;&#25345;&#39034;&#24207;
&lt;/p&gt;
&lt;p&gt;
Order preservation with dummies in the musseum pass problem. (arXiv:2307.00622v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.00622
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#20844;&#29702;&#35201;&#27714;&#65292;&#21363;&#24102;&#30528;&#34394;&#25311;&#20154;&#30340;&#39034;&#24207;&#32500;&#25345;&#65292;&#26469;&#35299;&#20915;&#21338;&#29289;&#39302;&#36890;&#34892;&#35777;&#25910;&#20837;&#20998;&#37197;&#38382;&#39064;&#12290;&#36890;&#36807;&#26367;&#25442;&#20256;&#32479;&#30340;&#34394;&#25311;&#20154;&#20844;&#29702;&#65292;&#25105;&#20204;&#24471;&#21040;&#20102;&#20960;&#20010;&#35268;&#21017;&#23478;&#26063;&#65292;&#36825;&#20123;&#35268;&#21017;&#23478;&#26063;&#26159;&#22343;&#21248;&#21644;Shapley&#26041;&#27861;&#30340;&#20984;&#32452;&#21512;&#65292;&#20174;&#32780;&#25512;&#24191;&#20102;&#29616;&#26377;&#25991;&#29486;&#20013;&#30340;&#30740;&#31350;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#20174;&#20844;&#29702;&#30340;&#35282;&#24230;&#30740;&#31350;&#20102;&#38144;&#21806;&#21338;&#29289;&#39302;&#36890;&#34892;&#35777;&#25152;&#33719;&#24471;&#30340;&#25910;&#20837;&#30340;&#38382;&#39064;&#12290;&#22312;&#36825;&#20010;&#35774;&#32622;&#20013;&#65292;&#25105;&#20204;&#24314;&#35758;&#29992;&#19968;&#20010;&#26356;&#28201;&#21644;&#30340;&#35201;&#27714;&#26469;&#20195;&#26367;&#36890;&#24120;&#30340;&#34394;&#25311;&#20154;&#20844;&#29702;&#65306;&#24102;&#30528;&#34394;&#25311;&#20154;&#30340;&#39034;&#24207;&#32500;&#25345;&#12290;&#36825;&#20010;&#26032;&#30340;&#20844;&#29702;&#24418;&#24335;&#21270;&#20102;&#21746;&#23398;&#24605;&#24819;&#65292;&#21363;&#21363;&#20351;&#26159;&#31354;&#20195;&#29702;/&#21338;&#29289;&#39302;&#65292;&#22312;&#20998;&#20139;&#30340;&#24773;&#20917;&#19979;&#20063;&#26377;&#26435;&#21033;&#33719;&#24471;&#26368;&#23567;&#30340;&#20998;&#37197;&#12290;&#36890;&#36807;&#29992;&#24102;&#26377;&#34394;&#25311;&#20154;&#30340;&#39034;&#24207;&#32500;&#25345;&#20195;&#26367;&#34394;&#25311;&#20154;&#65292;&#25105;&#20204;&#34920;&#24449;&#20102;&#20960;&#20010;&#35268;&#21017;&#23478;&#26063;&#65292;&#23427;&#20204;&#26159;&#22343;&#21248;&#21644;Shapley&#26041;&#27861;&#30340;&#20984;&#32452;&#21512;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#32467;&#26524;&#27010;&#25324;&#20102;&#25991;&#29486;&#20013;&#24050;&#26377;&#30340;&#20960;&#20010;&#32467;&#26524;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#32771;&#34385;&#30340;&#38382;&#39064;&#39046;&#22495;&#27604;Ginsburgh&#21644;Zang&#22312;&#20182;&#20204;&#20851;&#20110;&#21338;&#29289;&#39302;&#36890;&#34892;&#35777;&#38382;&#39064;&#30340;&#24320;&#21019;&#24615;&#35770;&#25991;&#20013;&#25552;&#20986;&#30340;&#39046;&#22495;&#26356;&#20026;&#20016;&#23500;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study the problem of sharing the revenue obtained by selling museum passes from the axiomatic perspective. In this setting, we propose replacing the usual dummy axiom with a milder requirement: order preservation with dummies. This new axiom formalizes the philosophical idea that even null agents/museums may have the right to receive a minimum allocation in a sharing situation. By replacing dummy with order preservation with dummies, we characterize several families of rules, which are convex combinations of the uniform and Shapley approaches. Our findings generalize several existing results in the literature. Also, we consider a domain of problems that is richer than the domain proposed by Ginsburgh and Zang (2003) in their seminal paper on the museum pass problem.
&lt;/p&gt;</description></item><item><title>&#36825;&#31687;&#35770;&#25991;&#20171;&#32461;&#24182;&#24418;&#24335;&#21270;&#20102;&#20379;&#27714;&#32463;&#20856;&#35266;&#28857;&#65292;&#25552;&#20986;&#20102;&#22522;&#20110;&#20080;&#26041;&#21644;&#21334;&#26041;&#20445;&#30041;&#20215;&#26684;&#30340;&#20379;&#27714;&#27169;&#22411;&#65292;&#20026;&#23454;&#39564;&#32463;&#27982;&#23398;&#21644;&#20132;&#26131;&#35268;&#21017;&#30340;&#30740;&#31350;&#22880;&#23450;&#20102;&#22522;&#30784;&#12290;</title><link>http://arxiv.org/abs/2307.00413</link><description>&lt;p&gt;
&#20379;&#27714;&#32463;&#20856;&#29702;&#35770;
&lt;/p&gt;
&lt;p&gt;
The Classical Theory of Supply and Demand. (arXiv:2307.00413v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.00413
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#20171;&#32461;&#24182;&#24418;&#24335;&#21270;&#20102;&#20379;&#27714;&#32463;&#20856;&#35266;&#28857;&#65292;&#25552;&#20986;&#20102;&#22522;&#20110;&#20080;&#26041;&#21644;&#21334;&#26041;&#20445;&#30041;&#20215;&#26684;&#30340;&#20379;&#27714;&#27169;&#22411;&#65292;&#20026;&#23454;&#39564;&#32463;&#27982;&#23398;&#21644;&#20132;&#26131;&#35268;&#21017;&#30340;&#30740;&#31350;&#22880;&#23450;&#20102;&#22522;&#30784;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#24182;&#24418;&#24335;&#21270;&#20102;&#20379;&#27714;&#32463;&#20856;&#35266;&#28857;&#65292;&#25105;&#20204;&#35748;&#20026;&#36825;&#31181;&#35266;&#28857;&#19982;&#26032;&#21476;&#20856;&#29702;&#35770;&#20855;&#26377;&#29420;&#31435;&#24615;&#21644;&#29420;&#29305;&#24615;&#12290;&#22312;&#36793;&#38469;&#38761;&#21629;&#20043;&#21069;&#65292;&#38656;&#27714;&#21644;&#20379;&#32473;&#30340;&#23450;&#20041;&#19981;&#26159;&#36890;&#36807;&#19968;&#20010;&#19981;&#21487;&#35266;&#27979;&#30340;&#20934;&#21017;&#65288;&#22914;&#25928;&#29992;&#20989;&#25968;&#65289;&#65292;&#32780;&#26159;&#36890;&#36807;&#19968;&#20010;&#21487;&#35266;&#27979;&#30340;&#36135;&#24065;&#21464;&#37327;&#8220;&#20445;&#30041;&#20215;&#26684;&#8221;&#26469;&#30830;&#23450;&#65306;&#20080;&#26041;&#30340;&#65288;&#26368;&#22823;&#65289;&#24895;&#24847;&#25903;&#20184;&#65288;WTP&#65289;&#20540;&#65288;&#28508;&#22312;&#20215;&#26684;&#65289;&#20197;&#21450;&#21334;&#26041;&#30340;&#65288;&#26368;&#20302;&#65289;&#24895;&#24847;&#25509;&#21463;&#65288;WTA&#65289;&#20540;&#65288;&#28508;&#22312;&#20215;&#26684;&#65289;&#12290;&#24066;&#22330;&#30340;&#38656;&#27714;&#21644;&#20379;&#32473;&#20998;&#21035;&#26159;&#20080;&#26041;&#21644;&#21334;&#26041;&#20445;&#30041;&#20215;&#26684;&#30340;&#32047;&#31215;&#20998;&#24067;&#12290;&#36825;&#31181;&#20379;&#27714;&#32463;&#20856;&#35266;&#28857;&#24418;&#25104;&#20102;&#23454;&#39564;&#32463;&#27982;&#23398;&#20013;&#24066;&#22330;&#21442;&#19982;&#32773;&#30340;&#28608;&#21169;&#26041;&#24335;&#65292;&#23613;&#31649;&#23454;&#39564;&#32463;&#27982;&#23398;&#23478;&#65288;&#21463;&#36807;&#26032;&#21476;&#20856;&#32463;&#27982;&#23398;&#22521;&#35757;&#65289;&#24182;&#19981;&#30693;&#36947;&#23427;&#20204;&#19982;&#36807;&#21435;&#30340;&#32852;&#31995;&#12290;&#22312;&#36825;&#20010;&#22522;&#30784;&#19978;&#65292;&#24314;&#31435;&#20102;&#22823;&#37327;&#26377;&#20851;&#21508;&#31181;&#26426;&#26500;&#30340;&#20132;&#26131;&#35268;&#21017;&#30340;&#25991;&#29486;&#65292;&#21253;&#25324;&#29616;&#20195;&#26426;&#26500;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper introduces and formalizes the classical view on supply and demand, which, we argue, has an integrity independent and distinct from the neoclassical theory. Demand and supply, before the marginal revolution, are defined not by an unobservable criterion such as a utility function, but by an observable monetary variable, the reservation price: the buyer's (maximum) willingness to pay (WTP) value (a potential price) and the seller's (minimum) willingness to accept (WTA) value (a potential price) at the marketplace. Market demand and supply are the cumulative distribution of the buyers' and sellers' reservation prices, respectively. This WTP-WTA classical view of supply and demand formed the means whereby market participants were motivated in experimental economics although experimentalists (trained in neoclassical economics) were not cognizant of their link to the past. On this foundation was erected a vast literature on the rules of trading for a host of institutions, modern an
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#37325;&#26032;&#35780;&#20272;&#20102;&#20122;&#24403;&#183;&#26031;&#23494;&#30340;&#20215;&#20540;&#29702;&#35770;&#65292;&#35748;&#20026;&#20854;&#23545;&#20110;&#29616;&#20195;&#24066;&#22330;&#20215;&#26684;&#24418;&#25104;&#29702;&#35770;&#30340;&#24314;&#35774;&#25552;&#20379;&#20102;&#26377;&#30410;&#30340;&#22522;&#30784;&#12290;</title><link>http://arxiv.org/abs/2307.00412</link><description>&lt;p&gt;
&#20122;&#24403;&#183;&#26031;&#23494;&#30340;&#20215;&#20540;&#29702;&#35770;&#65306;&#23545;&#21476;&#20856;&#20215;&#26684;&#21457;&#29616;&#30340;&#37325;&#26032;&#35780;&#20272;
&lt;/p&gt;
&lt;p&gt;
Adam Smith's Theory of Value: A Reappraisal of Classical Price Discovery. (arXiv:2307.00412v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.00412
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#37325;&#26032;&#35780;&#20272;&#20102;&#20122;&#24403;&#183;&#26031;&#23494;&#30340;&#20215;&#20540;&#29702;&#35770;&#65292;&#35748;&#20026;&#20854;&#23545;&#20110;&#29616;&#20195;&#24066;&#22330;&#20215;&#26684;&#24418;&#25104;&#29702;&#35770;&#30340;&#24314;&#35774;&#25552;&#20379;&#20102;&#26377;&#30410;&#30340;&#22522;&#30784;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20122;&#24403;&#183;&#26031;&#23494;&#22312;&#29702;&#35299;&#20154;&#31867;&#36947;&#24503;&#21644;&#31038;&#20250;&#24615;&#26041;&#38754;&#30340;&#30456;&#20851;&#24615;&#22312;&#21508;&#20010;&#23398;&#31185;&#32972;&#26223;&#30340;&#23398;&#32773;&#20013;&#24471;&#21040;&#20102;&#25215;&#35748;&#65292;&#32780;&#22312;&#32463;&#27982;&#23398;&#23478;&#20013;&#65292;&#20122;&#24403;&#183;&#26031;&#23494;&#30340;&#32463;&#27982;&#20215;&#20540;&#29702;&#35770;&#30340;&#37325;&#35201;&#24615;&#21364;&#19981;&#22914;&#21069;&#12290;&#28982;&#32780;&#65292;&#26412;&#25991;&#35748;&#20026;&#65292;&#20122;&#24403;&#183;&#26031;&#23494;&#20851;&#20110;&#24066;&#22330;&#20215;&#26684;&#24418;&#25104;&#30340;&#27010;&#36848;&#20197;&#21450;&#26356;&#19968;&#33324;&#26469;&#35828;&#65292;&#21476;&#20856;&#23398;&#27966;&#23558;&#31454;&#20105;&#35270;&#20026;&#19968;&#20010;&#38598;&#20307;&#35752;&#20215;&#36824;&#20215;&#30340;&#36807;&#31243;&#65292;&#20026;&#26500;&#24314;&#29616;&#20195;&#24066;&#22330;&#20215;&#26684;&#24418;&#25104;&#29702;&#35770;&#25552;&#20379;&#20102;&#26377;&#30410;&#30340;&#22522;&#30784;&#12290;
&lt;/p&gt;
&lt;p&gt;
The relevance of Adam Smith for understanding human morality and sociality is recognized in the growing interest in his work on moral sentiments among scholars of various academic backgrounds. But, paradoxically, Adam Smith's theory of economic value enjoys a less prominent stature today among economists, who, while they view him as the 'father of modern economics', considered him more as having had the right intuitions about a market economy than as having developed the right concepts and the technical tools for studying it. Yet the neoclassical tradition, which replaced the classical school around 1870, failed to provide a satisfactory theory of market price formation. Adam Smith's sketch of market price formation (Ch. VII, Book I, Wealth of Nations), and more generally the classical view of competition as a collective higgling and bargaining process, as this paper argues, offers a helpful foundation on which to build a modern theory of market price formation, despite any shortcoming
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#36890;&#36807;&#24341;&#20837;&#32463;&#20856;&#35266;&#28857;&#65292;&#23558;&#31454;&#20105;&#35270;&#20026;&#22522;&#20110;&#39044;&#23450;&#20215;&#26684;&#30340;&#38598;&#20307;&#35752;&#20215;&#36824;&#20215;&#36807;&#31243;&#65292;&#24182;&#23558;&#20854;&#24212;&#29992;&#20110;&#35299;&#37322;&#25237;&#26426;&#24615;&#36164;&#20135;&#20215;&#26684;&#30340;&#27874;&#21160;&#29305;&#24449;&#12290;&#36890;&#36807;&#23454;&#39564;&#39564;&#35777;&#65292;&#35813;&#27169;&#22411;&#25104;&#21151;&#35299;&#37322;&#20102;&#36807;&#24230;&#27874;&#21160;&#12289;&#23614;&#37096;&#21402;&#23614;&#21644;&#32858;&#31867;&#27874;&#21160;&#31561;&#29616;&#35937;&#12290;</title><link>http://arxiv.org/abs/2307.00410</link><description>&lt;p&gt;
&#22238;&#39038;&#24615;&#22320;&#65292;&#23545;&#20110;&#31454;&#20105;&#24066;&#22330;&#34892;&#20026;&#30340;&#23454;&#39564;&#21457;&#29616;&#21628;&#21796;&#20102;&#26087;&#30340;&#12289;&#32463;&#20856;&#30340;&#31454;&#20105;&#35266;&#28857;&#30340;&#22797;&#20852;&#65292;&#23558;&#31454;&#20105;&#35270;&#20026;&#19968;&#20010;&#38598;&#20307;&#35752;&#20215;&#36824;&#20215;&#36807;&#31243;&#65288;&#32780;&#19981;&#26159;&#20215;&#26684;&#25509;&#21463;&#34892;&#20026;&#65289;&#65292;&#35813;&#36807;&#31243;&#22522;&#20110;&#39044;&#23450;&#20215;&#26684;&#65288;&#32780;&#38750;&#25928;&#29992;&#20989;&#25968;&#65289;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#23558;&#32463;&#20856;&#26041;&#27861;&#29305;&#21270;&#20197;&#22788;&#29702;&#20215;&#26684;&#31283;&#23450;&#24615;&#30340;&#19968;&#20010;&#37325;&#35201;&#38459;&#30861;&#8212;&#8212;&#25237;&#26426;&#34892;&#20026;&#12290;&#35813;&#27169;&#22411;&#28041;&#21450;&#21040;&#19968;&#20010;&#29616;&#22330;&#25110;&#23454;&#39564;&#23460;&#36164;&#20135;&#24066;&#22330;&#35774;&#32622;&#30340;&#20856;&#22411;&#29305;&#24449;&#65292;&#24182;&#21487;&#29992;&#20110;&#23545;&#20854;&#29305;&#23450;&#39044;&#27979;&#36827;&#34892;&#23454;&#39564;&#35777;&#26126;&#65307;&#22312;&#36825;&#37324;&#65292;&#25105;&#20204;&#20351;&#29992;&#35813;&#27169;&#22411;&#26469;&#35299;&#37322;&#19977;&#20010;&#19968;&#33324;&#30340;&#29305;&#24449;&#20107;&#23454;&#65292;&#36825;&#20123;&#20107;&#23454;&#22312;&#32463;&#39564;&#21644;&#23454;&#39564;&#19978;&#37117;&#34987;&#20805;&#20998;&#39564;&#35777;&#65306;&#25237;&#26426;&#24615;&#36164;&#20135;&#20215;&#26684;&#30340;&#36807;&#24230;&#27874;&#21160;&#12289;&#23614;&#37096;&#21402;&#23614;&#21644;&#32858;&#31867;&#27874;&#21160;&#12290;&#23614;&#37096;&#21402;&#23614;&#22312;&#27169;&#22411;&#20013;&#30001;&#20110;&#25237;&#26426;&#24615;&#36136;&#30340;&#25918;&#22823;&#23548;&#33268;&#65292;&#20135;&#29983;&#20102;&#19968;&#20010;&#38543;&#26426;&#31995;&#25968;&#33258;&#22238;&#24402;&#25910;&#30410;&#36807;&#31243;&#65288;&#20197;&#21450;&#24130;&#24459;&#23614;&#37096;&#65289;&#65307;&#27874;&#21160;&#30340;&#32858;&#31867;&#24615;&#36136;&#26159;&#30001;&#20132;&#26131;&#32773;&#23545;&#26032;&#38395;&#30340;&#38271;&#26399;&#35760;&#24518;&#25152;&#24341;&#36215;&#30340;&#65307;&#27873;&#27819;&#26159;&#19968;&#31181;
&lt;/p&gt;
&lt;p&gt;
A Classical Model of Speculative Asset Price Dynamics. (arXiv:2307.00410v1 [q-fin.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.00410
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#36890;&#36807;&#24341;&#20837;&#32463;&#20856;&#35266;&#28857;&#65292;&#23558;&#31454;&#20105;&#35270;&#20026;&#22522;&#20110;&#39044;&#23450;&#20215;&#26684;&#30340;&#38598;&#20307;&#35752;&#20215;&#36824;&#20215;&#36807;&#31243;&#65292;&#24182;&#23558;&#20854;&#24212;&#29992;&#20110;&#35299;&#37322;&#25237;&#26426;&#24615;&#36164;&#20135;&#20215;&#26684;&#30340;&#27874;&#21160;&#29305;&#24449;&#12290;&#36890;&#36807;&#23454;&#39564;&#39564;&#35777;&#65292;&#35813;&#27169;&#22411;&#25104;&#21151;&#35299;&#37322;&#20102;&#36807;&#24230;&#27874;&#21160;&#12289;&#23614;&#37096;&#21402;&#23614;&#21644;&#32858;&#31867;&#27874;&#21160;&#31561;&#29616;&#35937;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22238;&#39038;&#24615;&#22320;&#65292;&#23545;&#31454;&#20105;&#24066;&#22330;&#34892;&#20026;&#30340;&#23454;&#39564;&#21457;&#29616;&#24341;&#21457;&#20102;&#23545;&#32463;&#20856;&#31454;&#20105;&#35266;&#28857;&#30340;&#22797;&#20852;&#65292;&#23558;&#31454;&#20105;&#35270;&#20026;&#22522;&#20110;&#39044;&#23450;&#20215;&#26684;&#30340;&#38598;&#20307;&#35752;&#20215;&#36824;&#20215;&#36807;&#31243;&#65292;&#32780;&#19981;&#26159;&#20215;&#26684;&#25509;&#21463;&#34892;&#20026;&#12290;&#26412;&#25991;&#23558;&#32463;&#20856;&#26041;&#27861;&#24212;&#29992;&#20110;&#22788;&#29702;&#20215;&#26684;&#31283;&#23450;&#24615;&#30340;&#37325;&#35201;&#38556;&#30861;&#20043;&#19968;&#8212;&#8212;&#25237;&#26426;&#34892;&#20026;&#12290;&#35813;&#27169;&#22411;&#26159;&#22522;&#20110;&#29616;&#22330;&#25110;&#23454;&#39564;&#23460;&#36164;&#20135;&#24066;&#22330;&#35774;&#32622;&#30340;&#20856;&#22411;&#29305;&#24449;&#65292;&#24182;&#21487;&#29992;&#20110;&#23454;&#39564;&#39564;&#35777;&#20854;&#20855;&#20307;&#39044;&#27979;&#12290;&#26412;&#25991;&#21033;&#29992;&#35813;&#27169;&#22411;&#35299;&#37322;&#20102;&#25237;&#26426;&#24615;&#36164;&#20135;&#20215;&#26684;&#30340;&#19977;&#20010;&#32463;&#39564;&#21644;&#23454;&#39564;&#19978;&#24050;&#32463;&#20805;&#20998;&#39564;&#35777;&#30340;&#19968;&#33324;&#29305;&#24449;&#65306;&#36807;&#24230;&#27874;&#21160;&#12289;&#23614;&#37096;&#21402;&#23614;&#21644;&#32858;&#31867;&#27874;&#21160;&#12290;&#27169;&#22411;&#20013;&#30340;&#23614;&#37096;&#21402;&#23614;&#26159;&#30001;&#20110;&#25237;&#26426;&#24615;&#36136;&#30340;&#25918;&#22823;&#36896;&#25104;&#30340;&#65292;&#20174;&#32780;&#20135;&#29983;&#20102;&#38543;&#26426;&#31995;&#25968;&#33258;&#22238;&#24402;&#30340;&#25910;&#30410;&#36807;&#31243;&#65288;&#20197;&#21450;&#24130;&#24459;&#23614;&#37096;&#65289;&#65307;&#27874;&#21160;&#30340;&#32858;&#31867;&#24615;&#36136;&#26159;&#30001;&#20132;&#26131;&#32773;&#23545;&#26032;&#38395;&#30340;&#38271;&#26399;&#35760;&#24518;&#25152;&#24341;&#36215;&#30340;&#65307;&#32780;&#27873;&#27819;&#26159;&#24066;&#22330;&#30340;&#30701;&#26399;&#20559;&#31163;&#39044;&#26399;&#30340;&#32467;&#26524;&#65292;&#20135;&#29983;&#20102;&#19981;&#21487;&#25345;&#32493;&#30340;&#36164;&#20135;&#20215;&#26684;&#19978;&#28072;&#12290;
&lt;/p&gt;
&lt;p&gt;
In retrospect, the experimental findings on competitive market behavior called for a revival of the old, classical, view of competition as a collective higgling and bargaining process (as opposed to price-taking behaviors) founded on reservation prices (in place of the utility function). In this paper, we specialize the classical methodology to deal with speculation, an important impediment to price stability. The model involves typical features of a field or lab asset market setup and lends itself to an experimental test of its specific predictions; here we use the model to explain three general stylized facts, well established both empirically and experimentally: the excess, fat-tailed, and clustered volatility of speculative asset prices. The fat tails emerge in the model from the amplifying nature of speculation, leading to a random-coefficient autoregressive return process (and power-law tails); the volatility clustering is due to the traders' long memory of news; bubbles are a pe
&lt;/p&gt;</description></item><item><title>Yule-Frisch-Waugh-Lovell&#23450;&#29702;&#30340;&#21457;&#23637;&#21382;&#31243;&#21644;&#20998;&#26512;&#65292;&#23558;&#35813;&#23450;&#29702;&#26356;&#21517;&#20026;YFWL&#23450;&#29702;&#20197;&#25215;&#35748;Yule&#30340;&#36129;&#29486;&#65292;&#23558;&#35813;&#23450;&#29702;&#25193;&#23637;&#21040;&#27604;&#36739;&#22810;&#20010;&#21644;&#37096;&#20998;&#22238;&#24402;&#30340;&#31995;&#25968;&#30340;&#20272;&#35745;&#21327;&#26041;&#24046;&#30697;&#38453;&#65292;&#24182;&#25552;&#20379;&#20102;&#22312;Ding&#32467;&#26524;&#19981;&#36866;&#29992;&#24773;&#20917;&#19979;&#30340;&#25512;&#26029;&#26041;&#27861;&#12290;</title><link>http://arxiv.org/abs/2307.00369</link><description>&lt;p&gt;
Yule-Frisch-Waugh-Lovell&#23450;&#29702;&#30340;&#21457;&#23637;&#21382;&#31243;&#21644;&#20998;&#26512;
&lt;/p&gt;
&lt;p&gt;
The Yule-Frisch-Waugh-Lovell Theorem. (arXiv:2307.00369v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.00369
&lt;/p&gt;
&lt;p&gt;
Yule-Frisch-Waugh-Lovell&#23450;&#29702;&#30340;&#21457;&#23637;&#21382;&#31243;&#21644;&#20998;&#26512;&#65292;&#23558;&#35813;&#23450;&#29702;&#26356;&#21517;&#20026;YFWL&#23450;&#29702;&#20197;&#25215;&#35748;Yule&#30340;&#36129;&#29486;&#65292;&#23558;&#35813;&#23450;&#29702;&#25193;&#23637;&#21040;&#27604;&#36739;&#22810;&#20010;&#21644;&#37096;&#20998;&#22238;&#24402;&#30340;&#31995;&#25968;&#30340;&#20272;&#35745;&#21327;&#26041;&#24046;&#30697;&#38453;&#65292;&#24182;&#25552;&#20379;&#20102;&#22312;Ding&#32467;&#26524;&#19981;&#36866;&#29992;&#24773;&#20917;&#19979;&#30340;&#25512;&#26029;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36861;&#28335;&#20102;&#32463;&#27982;&#35745;&#37327;&#23398;&#25991;&#29486;&#20013;&#34987;&#31216;&#20026;Frisch-Waugh-Lovell&#23450;&#29702;&#30340;&#21382;&#21490;&#21644;&#20998;&#26512;&#21457;&#23637;&#12290;&#35813;&#23450;&#29702;&#35777;&#26126;&#20102;&#22312;&#22810;&#20803;&#22238;&#24402;&#20013;&#20219;&#24847;&#23376;&#38598;&#30340;&#31995;&#25968;&#31561;&#20110;&#22312;&#27531;&#24046;&#21270;&#30340;&#22240;&#21464;&#37327;&#21644;&#27531;&#24046;&#21270;&#30340;&#23376;&#38598;&#19978;&#30340;&#22238;&#24402;&#20013;&#30340;&#31995;&#25968;&#65292;&#20854;&#20013;&#27531;&#24046;&#21270;&#20351;&#29992;&#24863;&#20852;&#36259;&#30340;&#23376;&#38598;&#30340;&#34917;&#38598;&#12290;&#26412;&#25991;&#24314;&#35758;&#23558;&#35813;&#23450;&#29702;&#26356;&#21517;&#20026;Yule-Frisch-Waugh-Lovell&#65288;YFWL&#65289;&#23450;&#29702;&#65292;&#20197;&#25215;&#35748;&#32479;&#35745;&#23398;&#23478;G. Udny Yule&#22312;&#20854;&#21457;&#23637;&#20013;&#30340;&#24320;&#21019;&#24615;&#36129;&#29486;&#12290;&#20854;&#27425;&#65292;&#25105;&#24378;&#35843;&#20102;&#32479;&#35745;&#23398;&#23478;P. Ding&#30340;&#26368;&#26032;&#24037;&#20316;&#65292;&#35813;&#24037;&#20316;&#23558;YFWL&#23450;&#29702;&#25193;&#23637;&#21040;&#22810;&#20010;&#21644;&#37096;&#20998;&#65288;&#21363;&#27531;&#24046;&#21270;&#65289;&#22238;&#24402;&#30340;&#31995;&#25968;&#30340;&#20272;&#35745;&#21327;&#26041;&#24046;&#30697;&#38453;&#30340;&#27604;&#36739;&#12290;&#31532;&#19977;&#65292;&#25105;&#23637;&#31034;&#20102;&#22312;Ding&#30340;&#32467;&#26524;&#19981;&#36866;&#29992;&#30340;&#24773;&#20917;&#19979;&#65292;&#20173;&#28982;&#21487;&#20197;&#20351;&#29992;&#35745;&#31639;&#26041;&#27861;&#36827;&#34892;&#32479;&#35745;&#25512;&#26029;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper traces the historical and analytical development of what is known in the econometrics literature as the Frisch-Waugh-Lovell theorem. This theorem demonstrates that the coefficients on any subset of covariates in a multiple regression is equal to the coefficients in a regression of the residualized outcome variable on the residualized subset of covariates, where residualization uses the complement of the subset of covariates of interest. In this paper, I suggest that the theorem should be renamed as the Yule-Frisch-Waugh-Lovell (YFWL) theorem to recognize the pioneering contribution of the statistician G. Udny Yule in its development. Second, I highlight recent work by the statistician, P. Ding, which has extended the YFWL theorem to a comparison of estimated covariance matrices of coefficients from multiple and partial, i.e. residualized regressions. Third, I show that, in cases where Ding's results do not apply, one can still resort to a computational method to conduct stat
&lt;/p&gt;</description></item><item><title>&#35813;&#30740;&#31350;&#30740;&#31350;&#20102;&#24403;&#22303;&#22320;&#26082;&#20316;&#20026;&#29983;&#20135;&#35201;&#32032;&#21448;&#20316;&#20026;&#20215;&#20540;&#23384;&#20648;&#26102;&#65292;&#22303;&#22320;&#20215;&#26684;&#30340;&#38271;&#26399;&#34892;&#20026;&#12290;&#24403;&#38750;&#22303;&#22320;&#37096;&#38376;&#30340;&#25216;&#26415;&#36827;&#27493;&#26356;&#24555;&#24182;&#19988;&#26367;&#20195;&#24377;&#24615;&#36229;&#36807;1&#26102;&#65292;&#20250;&#20986;&#29616;&#19981;&#24179;&#34913;&#22686;&#38271;&#65292;&#24182;&#23548;&#33268;&#22303;&#22320;&#22312;&#38271;&#26399;&#36235;&#21183;&#19978;&#30456;&#23545;&#20110;&#22522;&#26412;&#20215;&#20540;&#36807;&#24230;&#20272;&#20540;&#12290;</title><link>http://arxiv.org/abs/2307.00349</link><description>&lt;p&gt;
&#19981;&#24179;&#34913;&#22686;&#38271;&#65292;&#26367;&#20195;&#24377;&#24615;&#21644;&#22303;&#22320;&#36807;&#24230;&#20272;&#20540;
&lt;/p&gt;
&lt;p&gt;
Unbalanced Growth, Elasticity of Substitution, and Land Overvaluation. (arXiv:2307.00349v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.00349
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#30740;&#31350;&#20102;&#24403;&#22303;&#22320;&#26082;&#20316;&#20026;&#29983;&#20135;&#35201;&#32032;&#21448;&#20316;&#20026;&#20215;&#20540;&#23384;&#20648;&#26102;&#65292;&#22303;&#22320;&#20215;&#26684;&#30340;&#38271;&#26399;&#34892;&#20026;&#12290;&#24403;&#38750;&#22303;&#22320;&#37096;&#38376;&#30340;&#25216;&#26415;&#36827;&#27493;&#26356;&#24555;&#24182;&#19988;&#26367;&#20195;&#24377;&#24615;&#36229;&#36807;1&#26102;&#65292;&#20250;&#20986;&#29616;&#19981;&#24179;&#34913;&#22686;&#38271;&#65292;&#24182;&#23548;&#33268;&#22303;&#22320;&#22312;&#38271;&#26399;&#36235;&#21183;&#19978;&#30456;&#23545;&#20110;&#22522;&#26412;&#20215;&#20540;&#36807;&#24230;&#20272;&#20540;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#24403;&#22303;&#22320;&#26082;&#20805;&#24403;&#29983;&#20135;&#35201;&#32032;&#21448;&#20316;&#20026;&#20215;&#20540;&#23384;&#20648;&#26102;&#65292;&#22303;&#22320;&#20215;&#26684;&#30340;&#38271;&#26399;&#34892;&#20026;&#12290;&#22312;&#29616;&#20195;&#32463;&#27982;&#20013;&#65292;&#38750;&#22303;&#22320;&#37096;&#38376;&#30340;&#25216;&#26415;&#36827;&#27493;&#26356;&#24555;&#65292;&#24403;&#26367;&#20195;&#24377;&#24615;&#22312;&#39640;&#36755;&#20837;&#27700;&#24179;&#19978;&#36229;&#36807;1&#26102;&#65288;&#22914;&#26524;&#38750;&#22303;&#22320;&#35201;&#32032;&#19981;&#23436;&#20840;&#25240;&#26087;&#30340;&#35805;&#65292;&#36825;&#24635;&#26159;&#25104;&#31435;&#30340;&#65289;&#65292;&#23601;&#20250;&#20986;&#29616;&#19981;&#24179;&#34913;&#22686;&#38271;&#65292;&#20351;&#24471;&#22303;&#22320;&#22312;&#38271;&#26399;&#36235;&#21183;&#19978;&#30456;&#23545;&#20110;&#22320;&#31199;&#29616;&#20540;&#23450;&#20041;&#30340;&#22522;&#26412;&#20215;&#20540;&#36807;&#24230;&#20272;&#20540;&#12290;&#22312;&#36235;&#21183;&#32447;&#38468;&#36817;&#65292;&#22303;&#22320;&#20215;&#26684;&#20986;&#29616;&#21608;&#26399;&#24615;&#30340;&#38543;&#26426;&#27874;&#21160;&#65292;&#21253;&#25324;&#22303;&#22320;&#36807;&#24230;&#20272;&#20540;&#30340;&#25193;&#24352;&#21644;&#25910;&#32553;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study the long-run behavior of land prices when land plays the dual role of a factor of production and a store of value. In modern economies where technological progress is faster in non-land sectors, when the elasticity of substitution exceeds 1 at high input levels (which always holds if non-land factors do not fully depreciate), unbalanced growth occurs and land becomes overvalued on the long-run trend relative to the fundamental value defined by the present value of land rents. Around the trend, recurrent stochastic fluctuations in land prices occur, with expansions and contractions in the size of land overvaluation.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#20351;&#29992;&#24046;&#24322;&#25511;&#21046;&#19982;&#20107;&#20214;&#30740;&#31350;&#26041;&#27861;&#25506;&#35752;&#20102;&#22320;&#26041;&#35302;&#21457;&#26242;&#20572;&#39537;&#36880;&#20196;&#26159;&#21542;&#23548;&#33268;COVID-19&#30149;&#20363;&#21644;&#27515;&#20129;&#20154;&#25968;&#22686;&#21152;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#35299;&#38500;&#36825;&#20123;&#26242;&#20572;&#25514;&#26045;&#23545;COVID-19&#20256;&#25773;&#24433;&#21709;&#29978;&#24494;&#12290;</title><link>http://arxiv.org/abs/2307.00251</link><description>&lt;p&gt;
&#22320;&#26041;&#39537;&#36880;&#26242;&#20572;&#25514;&#26045;&#19982;COVID-19&#30340;&#20256;&#25773;
&lt;/p&gt;
&lt;p&gt;
Local Eviction Moratoria and the Spread of COVID-19. (arXiv:2307.00251v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.00251
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#20351;&#29992;&#24046;&#24322;&#25511;&#21046;&#19982;&#20107;&#20214;&#30740;&#31350;&#26041;&#27861;&#25506;&#35752;&#20102;&#22320;&#26041;&#35302;&#21457;&#26242;&#20572;&#39537;&#36880;&#20196;&#26159;&#21542;&#23548;&#33268;COVID-19&#30149;&#20363;&#21644;&#27515;&#20129;&#20154;&#25968;&#22686;&#21152;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#35299;&#38500;&#36825;&#20123;&#26242;&#20572;&#25514;&#26045;&#23545;COVID-19&#20256;&#25773;&#24433;&#21709;&#29978;&#24494;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;COVID-19&#22823;&#27969;&#34892;&#30340;&#21021;&#26399;&#38454;&#27573;&#65292;&#21508;&#20010;&#32654;&#22269;&#24030;&#21644;&#22320;&#26041;&#25919;&#24220;&#23454;&#26045;&#20102;&#39537;&#36880;&#26242;&#20572;&#25514;&#26045;&#12290;&#36825;&#20123;&#26242;&#20572;&#25514;&#26045;&#30340;&#20027;&#35201;&#30446;&#30340;&#20043;&#19968;&#26159;&#20943;&#32531;COVID-19&#24863;&#26579;&#30340;&#20256;&#25773;&#12290;&#25105;&#20204;&#37319;&#29992;&#21322;&#21442;&#25968;&#24046;&#24322;&#25511;&#21046;&#19982;&#20107;&#20214;&#30740;&#31350;&#35268;&#33539;&#26469;&#27979;&#35797;&#36825;&#20123;&#22320;&#26041;&#26242;&#20572;&#25514;&#26045;&#35299;&#38500;&#26159;&#21542;&#23548;&#33268;COVID-19&#30149;&#20363;&#21644;&#27515;&#20129;&#20154;&#25968;&#30340;&#22686;&#21152;&#12290;&#25105;&#20204;&#30340;&#20027;&#35201;&#21457;&#29616;&#65292;&#22312;&#32771;&#34385;&#23454;&#38469;&#39537;&#36880;&#24773;&#20917;&#24182;&#22312;&#21439;&#32423;&#36827;&#34892;&#20998;&#26512;&#21518;&#65292;&#21508;&#31181;&#35268;&#33539;&#19979;&#30340;&#32467;&#26524;&#24182;&#19981;&#19968;&#33268;&#12290;&#25105;&#20204;&#35748;&#20026;&#65292;&#22312;&#36825;&#31181;&#24773;&#20917;&#19979;&#65292;&#26368;&#36817;&#21457;&#23637;&#30340;&#22686;&#24378;&#21512;&#25104;&#25511;&#21046;&#65288;ASCM&#65289;&#26041;&#27861;&#26356;&#20026;&#36866;&#29992;&#12290;&#25105;&#20204;&#30340;ASCM&#32467;&#26524;&#36824;&#34920;&#26126;&#65292;&#35299;&#38500;&#39537;&#36880;&#26242;&#20572;&#25514;&#26045;&#23545;COVID-19&#30149;&#20363;&#21644;&#27515;&#20129;&#20154;&#25968;&#20960;&#20046;&#27809;&#26377;&#24433;&#21709;&#12290;&#22240;&#27492;&#65292;&#20284;&#20046;&#39537;&#36880;&#26242;&#20572;&#25514;&#26045;&#23545;&#20943;&#23569;COVID-19&#20256;&#25773;&#30340;&#24433;&#21709;&#24456;&#23567;&#12290;
&lt;/p&gt;
&lt;p&gt;
At various stages during the initial onset of the COVID-19 pandemic, various US states and local municipalities enacted eviction moratoria. One of the main aims of these moratoria was to slow the spread of COVID-19 infections. We deploy a semiparametric difference-in-differences approach with an event study specification to test whether the lifting of these local moratoria led to an increase in COVID-19 cases and deaths. Our main findings, across a range of specifications, are inconclusive regarding the impact of the moratoria especially after accounting for the number of actual evictions and conducting the analysis at the county level. We argue that recently developed augmented synthetic control (ASCM) methods are more appropriate in this setting. Our ASCM results also suggest that the lifting of eviction moratoria had little to no impact on COVID-19 cases and deaths. Thus, it seems that eviction moratoria had little to no robust effect on reducing the spread of COVID-19 throwing in
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#36890;&#36807;&#20351;&#29992;&#32452;&#21512;&#26368;&#20339;&#20248;&#20808;&#31639;&#27861;&#21644;&#20108;&#27425;&#35268;&#21010;&#65292;&#25193;&#23637;&#20102;&#38543;&#26426;&#20018;&#34892;&#29420;&#35009;&#30340;&#29305;&#24449;&#21040;$n\le5$&#30340;&#24773;&#20917;&#65292;&#25509;&#36817;&#35299;&#20915;&#35813;&#29305;&#24449;&#26159;&#21542;&#36866;&#29992;&#20110;&#20219;&#24847;$n$&#30340;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2303.11976</link><description>&lt;p&gt;
&#25551;&#36848;&#38543;&#26426;&#20018;&#34892;&#29420;&#35009;&#30340;&#29305;&#24449;
&lt;/p&gt;
&lt;p&gt;
Characterizing Random Serial Dictatorship. (arXiv:2303.11976v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.11976
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36890;&#36807;&#20351;&#29992;&#32452;&#21512;&#26368;&#20339;&#20248;&#20808;&#31639;&#27861;&#21644;&#20108;&#27425;&#35268;&#21010;&#65292;&#25193;&#23637;&#20102;&#38543;&#26426;&#20018;&#34892;&#29420;&#35009;&#30340;&#29305;&#24449;&#21040;$n\le5$&#30340;&#24773;&#20917;&#65292;&#25509;&#36817;&#35299;&#20915;&#35813;&#29305;&#24449;&#26159;&#21542;&#36866;&#29992;&#20110;&#20219;&#24847;$n$&#30340;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38543;&#26426;&#20018;&#34892;&#29420;&#35009;&#26159;&#19968;&#31181;&#38543;&#26426;&#20998;&#37197;&#35268;&#21017;&#65292;&#23427;&#32473;&#23450;&#20102;&#19968;&#32452;&#23545;$n$&#20010;&#25151;&#23627;&#30340;&#36873;&#25321;&#20855;&#26377;&#20005;&#26684;&#20559;&#22909;&#30340;$n$&#20010;&#20195;&#29702;&#20154;&#65292;&#28385;&#36275;&#24179;&#31561;&#23545;&#24453;&#12289;&#21518;&#39564;&#25928;&#29575;&#21644;&#31574;&#30053;&#26080;&#20851;&#24615;&#12290;&#23545;&#20110;$n \le 3$&#65292;Bogomolnaia&#21644;Moulin&#65288;2001&#65289;&#24050;&#32463;&#34920;&#26126;&#38543;&#26426;&#20018;&#34892;&#29420;&#35009;&#20197;&#36825;&#19977;&#20010;&#20844;&#29702;&#20026;&#29305;&#24449;&#12290;&#26412;&#25991;&#21033;&#29992;&#32452;&#21512;&#26368;&#20339;&#20248;&#20808;&#25628;&#32034;&#21644;&#20108;&#27425;&#35268;&#21010;&#23558;&#36825;&#20010;&#29305;&#24449;&#25193;&#23637;&#21040;$n \le 5$&#65292;&#26356;&#25509;&#36817;&#22238;&#31572;&#38271;&#26399;&#23384;&#22312;&#30340;&#24320;&#25918;&#24615;&#38382;&#39064;&#65292;&#21363;&#36825;&#20010;&#29305;&#24449;&#26159;&#21542;&#36866;&#29992;&#20110;&#20219;&#24847;$n$&#12290;&#22312;&#27492;&#36807;&#31243;&#20013;&#65292;&#25105;&#20204;&#25551;&#36848;&#20102;&#21518;&#39564;&#25928;&#29575;&#21644;&#31574;&#30053;&#26080;&#20851;&#24615;&#30340;&#21066;&#24369;&#24418;&#24335;&#65292;&#36825;&#20123;&#24418;&#24335;&#36275;&#20197;&#28385;&#36275;&#25105;&#20204;&#30340;&#29305;&#24449;&#65292;&#24182;&#30830;&#23450;&#22312;&#38024;&#23545;&#26356;&#22823;$n$&#26102;&#20570;&#20986;&#38472;&#36848;&#26102;&#23384;&#22312;&#30340;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;
Random serial dictatorship (RSD) is a randomized assignment rule that - given a set of $n$ agents with strict preferences over $n$ houses - satisfies equal treatment of equals, ex post efficiency, and strategyproofness. For $n \le 3$, Bogomolnaia and Moulin (2001) have shown that RSD is characterized by these three axioms. Using best first search in combination with quadratic programming, we extend this characterization to $n \le 5$, getting closer to answering the long-standing open question whether the characterization holds for arbitrary $n$. On the way, we describe weakenings of ex post efficiency and strategyproofness that are sufficient for our characterization and identify problems when making statements for larger $n$.
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#20010;&#20851;&#20110;&#22312;&#32593;&#32476;&#19978;&#36827;&#34892;&#30340;&#25512;&#33616;&#25293;&#21334;&#30340;&#26368;&#20248;&#35774;&#35745;&#65292;&#36890;&#36807;&#25552;&#20379;&#19968;&#20010;&#31867;&#20284;&#20110;Myerson&#30340;&#28608;&#21169;&#30456;&#23481;&#25293;&#21334;&#30340;&#29305;&#24449;&#12290;&#30740;&#31350;&#32773;&#35777;&#26126;&#20102;&#24403;&#21069;&#24050;&#30693;&#30340;&#25293;&#21334;&#37117;&#23646;&#20110;&#36825;&#31867;&#38543;&#26426;&#25293;&#21334;&#30340;&#33539;&#30068;&#12290;</title><link>http://arxiv.org/abs/2208.09326</link><description>&lt;p&gt;
&#26368;&#20248;&#25512;&#33616;&#25293;&#21334;&#35774;&#35745;
&lt;/p&gt;
&lt;p&gt;
Optimal Referral Auction Design. (arXiv:2208.09326v2 [cs.GT] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2208.09326
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#20010;&#20851;&#20110;&#22312;&#32593;&#32476;&#19978;&#36827;&#34892;&#30340;&#25512;&#33616;&#25293;&#21334;&#30340;&#26368;&#20248;&#35774;&#35745;&#65292;&#36890;&#36807;&#25552;&#20379;&#19968;&#20010;&#31867;&#20284;&#20110;Myerson&#30340;&#28608;&#21169;&#30456;&#23481;&#25293;&#21334;&#30340;&#29305;&#24449;&#12290;&#30740;&#31350;&#32773;&#35777;&#26126;&#20102;&#24403;&#21069;&#24050;&#30693;&#30340;&#25293;&#21334;&#37117;&#23646;&#20110;&#36825;&#31867;&#38543;&#26426;&#25293;&#21334;&#30340;&#33539;&#30068;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21333;&#20214;&#19981;&#21487;&#20998;&#21106;&#29289;&#21697;&#30340;&#25293;&#21334;&#26159;&#26426;&#21046;&#35774;&#35745;&#20013;&#26368;&#24191;&#27867;&#35752;&#35770;&#30340;&#38382;&#39064;&#20043;&#19968;&#12290;&#23613;&#31649;&#20854;&#31616;&#21333;&#24615;&#65292;&#20294;&#23427;&#25552;&#20379;&#20102;&#25991;&#29486;&#20013;&#21487;&#33021;&#26159;&#26368;&#24178;&#20928;&#21644;&#26368;&#26377;&#27934;&#23519;&#21147;&#30340;&#32467;&#26524;&#12290;&#24403;&#27599;&#20010;&#21442;&#19982;&#32773;&#37117;&#30693;&#36947;&#25293;&#21334;&#27491;&#22312;&#36827;&#34892;&#26102;&#65292;Myerson [20]&#25552;&#20379;&#20102;&#19968;&#20010;&#20855;&#26377;&#21019;&#36896;&#24615;&#30340;&#32467;&#26524;&#65292;&#20197;&#30830;&#23450;&#28608;&#21169;&#30456;&#23481;&#30340;&#25293;&#21334;&#21644;&#26368;&#22823;&#25910;&#20837;&#12290;&#28982;&#32780;&#65292;&#22312;&#32593;&#32476;&#19978;&#30340;&#25293;&#21334;&#20013;&#65292;&#36825;&#26679;&#30340;&#32467;&#26524;&#24182;&#19981;&#25104;&#31435;&#65292;&#22240;&#20026;&#25293;&#21334;&#30340;&#20449;&#24687;&#26159;&#36890;&#36807;&#20195;&#29702;&#20256;&#25773;&#30340;&#65292;&#20182;&#20204;&#38656;&#35201;&#28608;&#21169;&#26469;&#20256;&#36882;&#20449;&#24687;&#12290;&#26368;&#36817;&#65292;&#19968;&#20123;&#25293;&#21334;&#65288;&#20363;&#22914;[13, 18]&#65289;&#34987;&#35774;&#35745;&#25104;&#36866;&#24403;&#28608;&#21169;&#32593;&#32476;&#19978;&#30340;&#20013;&#38388;&#33410;&#28857;&#26469;&#20256;&#25773;&#20449;&#24687;&#32473;&#26356;&#26377;&#20215;&#20540;&#30340;&#31454;&#26631;&#32773;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#25552;&#20379;&#20102;&#19968;&#20010;&#31867;&#20284;&#20110;Myerson&#30340;&#28608;&#21169;&#30456;&#23481;&#25293;&#21334;&#30340;&#29305;&#24449;&#65292;&#24182;&#19988;&#34920;&#26126;&#24403;&#21069;&#24050;&#30693;&#30340;&#25293;&#21334;&#23646;&#20110;&#36825;&#31867;&#38543;&#26426;&#25293;&#21334;&#30340;&#33539;&#30068;&#12290;
&lt;/p&gt;
&lt;p&gt;
The auction of a single indivisible item is one of the most celebrated problems in mechanism design with transfers. Despite its simplicity, it provides arguably the cleanest and most insightful results in the literature. When the information that the auction is running is available to every participant, Myerson [20] provided a seminal result to characterize the incentive-compatible auctions along with revenue optimality. However, such a result does not hold in an auction on a network, where the information of the auction is spread via the agents, and they need incentives to forward the information. In recent times, a few auctions (e.g., [13, 18]) were designed that appropriately incentivized the intermediate nodes on the network to promulgate the information to potentially more valuable bidders. In this paper, we provide a Myerson-like characterization of incentive-compatible auctions on a network and show that the currently known auctions fall within this class of randomized auctions.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#19968;&#31181;&#26032;&#30340;&#26465;&#20214;&#65292;&#20351;&#24471;&#21363;&#20351;&#24178;&#25200;&#20989;&#25968;&#26159;&#24369;&#26631;&#35782;&#30340;&#65292;&#20063;&#21487;&#20197;&#23545;&#21151;&#33021;&#36827;&#34892;&#24378;&#26631;&#35782;&#24182;&#36827;&#34892;&#25512;&#29702;&#12290;</title><link>http://arxiv.org/abs/2208.08291</link><description>&lt;p&gt;
&#20851;&#20110;&#24369;&#26631;&#35782;&#20989;&#25968;&#30340;&#24378;&#26631;&#35782;&#21151;&#33021;&#30340;&#25512;&#29702;
&lt;/p&gt;
&lt;p&gt;
Inference on Strongly Identified Functionals of Weakly Identified Functions. (arXiv:2208.08291v3 [stat.ME] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2208.08291
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#19968;&#31181;&#26032;&#30340;&#26465;&#20214;&#65292;&#20351;&#24471;&#21363;&#20351;&#24178;&#25200;&#20989;&#25968;&#26159;&#24369;&#26631;&#35782;&#30340;&#65292;&#20063;&#21487;&#20197;&#23545;&#21151;&#33021;&#36827;&#34892;&#24378;&#26631;&#35782;&#24182;&#36827;&#34892;&#25512;&#29702;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#21508;&#31181;&#24212;&#29992;&#20013;&#65292;&#21253;&#25324;&#38750;&#21442;&#25968;&#24037;&#20855;&#21464;&#37327;(NPIV)&#20998;&#26512;&#12289;&#26410;&#27979;&#21040;&#28151;&#28102;&#19979;&#30340;&#36817;&#22240;&#26524;&#25512;&#29702;&#21644;&#32570;&#22833;&#38750;&#38543;&#26426;&#25968;&#25454;&#19982;&#38544;&#34255;&#21464;&#37327;&#65292;&#25105;&#20204;&#23545;&#26465;&#20214;&#30697;&#38480;&#21046;&#23450;&#20041;&#30340;&#24178;&#25200;&#20989;&#25968;(&#20363;&#22914;&#24179;&#22343;&#22240;&#26524;&#25928;&#24212;)&#36827;&#34892;&#25512;&#29702;&#12290;&#36825;&#20123;&#24178;&#25200;&#20989;&#25968;&#36890;&#24120;&#26159;&#24369;&#26631;&#35782;&#30340;&#65292;&#21363;&#26465;&#20214;&#30697;&#38480;&#21046;&#21487;&#20197;&#20005;&#37325;&#19981;&#33391;&#65292;&#21516;&#26102;&#20063;&#21487;&#20197;&#26377;&#22810;&#20010;&#35299;&#12290;&#26377;&#26102;&#65292;&#36890;&#36807;&#26045;&#21152;&#33021;&#22815;&#20351;&#20989;&#25968;&#20197;&#20351;&#20851;&#20110;&#21151;&#33021;&#30340;&#25512;&#29702;&#25104;&#20026;&#21487;&#33021;&#30340;&#36895;&#29575;&#26469;&#20272;&#35745;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#19968;&#31181;&#26032;&#30340;&#26465;&#20214;&#65292;&#29992;&#20110;&#21151;&#33021;&#30340;&#24378;&#26631;&#35782;&#65292;&#21363;&#20351;&#24178;&#25200;&#20989;&#25968;&#19981;&#26159;&#65307;&#20063;&#23601;&#26159;&#35828;&#65292;&#21151;&#33021;&#21487;&#20197;&#20197;$\sqrt{n}$&#30340;&#36895;&#29575;&#36827;&#34892;&#28176;&#36817;&#27491;&#24577;&#20272;&#35745;&#12290;&#36825;&#20010;&#26465;&#20214;&#24847;&#21619;&#30528;&#20462;&#27491;&#24178;&#25200;&#20989;&#25968;&#30340;&#23384;&#22312;&#65292;
&lt;/p&gt;
&lt;p&gt;
In a variety of applications, including nonparametric instrumental variable (NPIV) analysis, proximal causal inference under unmeasured confounding, and missing-not-at-random data with shadow variables, we are interested in inference on a continuous linear functional (e.g., average causal effects) of nuisance function (e.g., NPIV regression) defined by conditional moment restrictions. These nuisance functions are generally weakly identified, in that the conditional moment restrictions can be severely ill-posed as well as admit multiple solutions. This is sometimes resolved by imposing strong conditions that imply the function can be estimated at rates that make inference on the functional possible. In this paper, we study a novel condition for the functional to be strongly identified even when the nuisance function is not; that is, the functional is amenable to asymptotically-normal estimation at $\sqrt{n}$-rates. The condition implies the existence of debiasing nuisance functions, and
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#21033;&#29992;&#20840;&#29699;&#20844;&#21496;&#29615;&#22659;&#23454;&#36341;&#30340;&#25968;&#25454;&#24471;&#20986;&#32467;&#35770;&#65306;&#20844;&#21496;&#30340;&#29615;&#22659;&#24433;&#21709;&#19982;&#20854;&#35268;&#27169;&#25104;&#31616;&#21333;&#30340;&#24130;&#24459;&#20851;&#31995;&#65292;&#21487;&#20197;&#26500;&#24314;&#19968;&#20010;&#29305;&#23450;&#20110;&#34892;&#19994;&#12289;&#22823;&#23567;&#30456;&#20851;&#30340;&#22522;&#20934;&#26469;&#35780;&#20272;&#20844;&#21496;&#30340;&#29615;&#22659;&#32489;&#25928;&#65292;&#24182;&#23454;&#26045;&#36825;&#26679;&#30340;&#22522;&#20934;&#21487;&#33021;&#20250;&#23548;&#33268;15%&#30340;&#25490;&#25918;&#20943;&#23569;&#12290;</title><link>http://arxiv.org/abs/2206.03148</link><description>&lt;p&gt;
&#20197;&#20840;&#29699;&#20844;&#21496;&#20026;&#22522;&#20934;&#30340;&#35268;&#27169;&#23450;&#24459;&#20316;&#20026;&#35780;&#20272;&#29615;&#22659;&#32489;&#25928;&#30340;&#22522;&#30784;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Scaling laws in global corporations as a benchmarking approach to assess environmental performance. (arXiv:2206.03148v3 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2206.03148
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#21033;&#29992;&#20840;&#29699;&#20844;&#21496;&#29615;&#22659;&#23454;&#36341;&#30340;&#25968;&#25454;&#24471;&#20986;&#32467;&#35770;&#65306;&#20844;&#21496;&#30340;&#29615;&#22659;&#24433;&#21709;&#19982;&#20854;&#35268;&#27169;&#25104;&#31616;&#21333;&#30340;&#24130;&#24459;&#20851;&#31995;&#65292;&#21487;&#20197;&#26500;&#24314;&#19968;&#20010;&#29305;&#23450;&#20110;&#34892;&#19994;&#12289;&#22823;&#23567;&#30456;&#20851;&#30340;&#22522;&#20934;&#26469;&#35780;&#20272;&#20844;&#21496;&#30340;&#29615;&#22659;&#32489;&#25928;&#65292;&#24182;&#23454;&#26045;&#36825;&#26679;&#30340;&#22522;&#20934;&#21487;&#33021;&#20250;&#23548;&#33268;15%&#30340;&#25490;&#25918;&#20943;&#23569;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20840;&#29699;&#26368;&#22823;&#30340;6,529&#23478;&#36328;&#22269;&#20844;&#21496;&#36127;&#36131;&#20102;&#36817;30%&#30340;&#20840;&#29699;CO2e&#25490;&#25918;&#37327;&#12290;&#36234;&#26469;&#36234;&#22810;&#30340;&#32929;&#19996;&#21644;&#21033;&#30410;&#30456;&#20851;&#32773;&#24847;&#35782;&#21040;&#20225;&#19994;&#22312;&#21487;&#25345;&#32493;&#21457;&#23637;&#36947;&#36335;&#19978;&#30340;&#20316;&#29992;&#65292;&#22240;&#27492;&#20182;&#20204;&#36861;&#27714;&#36234;&#26469;&#36234;&#20005;&#26684;&#21644;&#38596;&#24515;&#21187;&#21187;&#30340;&#29615;&#22659;&#30446;&#26631;&#12290;&#20294;&#26159;&#65292;&#22914;&#20309;&#23458;&#35266;&#39640;&#25928;&#22320;&#35780;&#20272;&#20225;&#19994;&#30340;&#29615;&#22659;&#32489;&#25928;&#20173;&#28982;&#26159;&#19968;&#20010;&#24748;&#32780;&#26410;&#20915;&#30340;&#38382;&#39064;&#12290;&#26412;&#30740;&#31350;&#25581;&#31034;&#20102;&#21487;&#20197;&#29992;&#26469;&#26500;&#24314;&#20844;&#21496;&#29615;&#22659;&#24433;&#21709;&#30340;&#23450;&#37327;&#32479;&#19968;&#22270;&#29255;&#30340;&#22522;&#26412;&#21160;&#24577;&#21644;&#32467;&#26500;&#12290;&#26412;&#30740;&#31350;&#34920;&#26126;&#65292;&#20844;&#21496;&#30340;&#29615;&#22659;&#24433;&#21709;&#65288;&#26032;&#38472;&#20195;&#35874;&#65289;CO2e&#33021;&#28304;&#20351;&#29992;&#65292;&#27700;&#21462;&#27700;&#21644;&#24223;&#21697;&#29983;&#20135;&#30340;&#35268;&#27169;&#19982;&#20854;&#35268;&#27169;&#25104;&#31616;&#21333;&#30340;&#24130;&#24459;&#20851;&#31995;&#65292;&#36825;&#24448;&#24448;&#26159;&#27425;&#32447;&#24615;&#30340;&#65292;&#24182;&#19988;&#21487;&#20197;&#29992;&#26469;&#25512;&#23548;&#20986;&#19968;&#20010;&#29305;&#23450;&#20110;&#34892;&#19994;&#65292;&#22823;&#23567;&#30456;&#20851;&#30340;&#22522;&#20934;&#26469;&#26126;&#30830;&#35780;&#20272;&#20844;&#21496;&#30340;&#29615;&#22659;&#32489;&#25928;&#12290;&#23454;&#26045;&#36825;&#26679;&#30340;&#22522;&#20934;&#21487;&#33021;&#20250;&#23548;&#33268;15%&#30340;&#25490;&#25918;&#20943;&#23569;&#12290;
&lt;/p&gt;
&lt;p&gt;
The largest 6,529 international corporations are accountable for almost 30% of global CO2e emissions. A growing awareness of the role of the corporate world in the path toward sustainability has led many shareholders and stakeholders to pursue increasingly stringent and ambitious environmental goals. However, how to assess the corporate environmental performance objectively and efficiently remains an open question. This study reveals underlying dynamics and structures that can be used to construct a unified quantitative picture of the environmental impact of companies. This study shows that the environmental impact (metabolism) of companies CO2e energy used, water withdrawal and waste production, scales with their size according to a simple power law which is often sublinear, and can be used to derive a sector-specific, size-dependent benchmark to asses unambiguously a company's environmental performance. Enforcing such a benchmark would potentially result in a 15% emissions reduction,
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#22806;&#37096;&#26377;&#25928;&#30340;&#20010;&#24615;&#21270;&#27835;&#30103;&#31574;&#30053;&#30340;&#23398;&#20064;&#38382;&#39064;&#12290;&#30740;&#31350;&#34920;&#26126;&#65292;&#26368;&#22823;&#21270;&#31119;&#21033;&#30340;&#27835;&#30103;&#31574;&#30053;&#23545;&#20110;&#23454;&#39564;&#21644;&#30446;&#26631;&#20154;&#32676;&#20043;&#38388;&#30340;&#32467;&#26524;&#20998;&#24067;&#21464;&#21270;&#20855;&#26377;&#40065;&#26834;&#24615;&#12290;&#36890;&#36807;&#24320;&#21457;&#26032;&#30340;&#26041;&#27861;&#65292;&#20316;&#32773;&#25552;&#20986;&#20102;&#23545;&#32467;&#26524;&#21644;&#29305;&#24449;&#21464;&#21270;&#20855;&#26377;&#40065;&#26834;&#24615;&#30340;&#31574;&#30053;&#23398;&#20064;&#26041;&#27861;&#65292;&#24182;&#24378;&#35843;&#23454;&#39564;&#20154;&#32676;&#20869;&#30340;&#27835;&#30103;&#25928;&#26524;&#24322;&#36136;&#24615;&#23545;&#31574;&#30053;&#26222;&#36866;&#24615;&#30340;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2205.05561</link><description>&lt;p&gt;
&#22806;&#37096;&#26377;&#25928;&#30340;&#31574;&#30053;&#36873;&#25321;
&lt;/p&gt;
&lt;p&gt;
Externally Valid Policy Choice. (arXiv:2205.05561v2 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2205.05561
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22806;&#37096;&#26377;&#25928;&#30340;&#20010;&#24615;&#21270;&#27835;&#30103;&#31574;&#30053;&#30340;&#23398;&#20064;&#38382;&#39064;&#12290;&#30740;&#31350;&#34920;&#26126;&#65292;&#26368;&#22823;&#21270;&#31119;&#21033;&#30340;&#27835;&#30103;&#31574;&#30053;&#23545;&#20110;&#23454;&#39564;&#21644;&#30446;&#26631;&#20154;&#32676;&#20043;&#38388;&#30340;&#32467;&#26524;&#20998;&#24067;&#21464;&#21270;&#20855;&#26377;&#40065;&#26834;&#24615;&#12290;&#36890;&#36807;&#24320;&#21457;&#26032;&#30340;&#26041;&#27861;&#65292;&#20316;&#32773;&#25552;&#20986;&#20102;&#23545;&#32467;&#26524;&#21644;&#29305;&#24449;&#21464;&#21270;&#20855;&#26377;&#40065;&#26834;&#24615;&#30340;&#31574;&#30053;&#23398;&#20064;&#26041;&#27861;&#65292;&#24182;&#24378;&#35843;&#23454;&#39564;&#20154;&#32676;&#20869;&#30340;&#27835;&#30103;&#25928;&#26524;&#24322;&#36136;&#24615;&#23545;&#31574;&#30053;&#26222;&#36866;&#24615;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#32771;&#34385;&#23398;&#20064;&#20010;&#24615;&#21270;&#27835;&#30103;&#31574;&#30053;&#30340;&#38382;&#39064;&#65292;&#36825;&#20123;&#31574;&#30053;&#26159;&#22806;&#37096;&#26377;&#25928;&#25110;&#24191;&#20041;&#21270;&#30340;&#65306;&#23427;&#20204;&#22312;&#38500;&#20102;&#23454;&#39564;&#65288;&#25110;&#35757;&#32451;&#65289;&#20154;&#32676;&#22806;&#30340;&#20854;&#20182;&#30446;&#26631;&#20154;&#32676;&#20013;&#34920;&#29616;&#33391;&#22909;&#12290;&#25105;&#20204;&#39318;&#20808;&#35777;&#26126;&#65292;&#23545;&#20110;&#23454;&#39564;&#20154;&#32676;&#32780;&#35328;&#65292;&#26368;&#22823;&#21270;&#31119;&#21033;&#30340;&#31574;&#30053;&#23545;&#20110;&#23454;&#39564;&#21644;&#30446;&#26631;&#20154;&#32676;&#20043;&#38388;&#30340;&#32467;&#26524;&#65288;&#20294;&#19981;&#26159;&#29305;&#24449;&#65289;&#20998;&#24067;&#21464;&#21270;&#20855;&#26377;&#40065;&#26834;&#24615;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#24320;&#21457;&#20102;&#26032;&#30340;&#26041;&#27861;&#26469;&#23398;&#20064;&#23545;&#32467;&#26524;&#21644;&#29305;&#24449;&#21464;&#21270;&#20855;&#26377;&#40065;&#26834;&#24615;&#30340;&#31574;&#30053;&#12290;&#22312;&#36825;&#26679;&#20570;&#26102;&#65292;&#25105;&#20204;&#24378;&#35843;&#20102;&#23454;&#39564;&#20154;&#32676;&#20869;&#30340;&#27835;&#30103;&#25928;&#26524;&#24322;&#36136;&#24615;&#22914;&#20309;&#24433;&#21709;&#31574;&#30053;&#30340;&#26222;&#36866;&#24615;&#12290;&#25105;&#20204;&#30340;&#26041;&#27861;&#21487;&#20197;&#20351;&#29992;&#23454;&#39564;&#25110;&#35266;&#23519;&#25968;&#25454;&#65288;&#20854;&#20013;&#27835;&#30103;&#26159;&#20869;&#29983;&#30340;&#65289;&#12290;&#25105;&#20204;&#30340;&#35768;&#22810;&#26041;&#27861;&#21487;&#20197;&#20351;&#29992;&#32447;&#24615;&#35268;&#21010;&#23454;&#29616;&#12290;
&lt;/p&gt;
&lt;p&gt;
We consider the problem of learning personalized treatment policies that are externally valid or generalizable: they perform well in other target populations besides the experimental (or training) population from which data are sampled. We first show that welfare-maximizing policies for the experimental population are robust to shifts in the distribution of outcomes (but not characteristics) between the experimental and target populations. We then develop new methods for learning policies that are robust to shifts in outcomes and characteristics. In doing so, we highlight how treatment effect heterogeneity within the experimental population affects the generalizability of policies. Our methods may be used with experimental or observational data (where treatment is endogenous). Many of our methods can be implemented with linear programming.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#24046;&#24322;&#24615;&#21306;&#21035;&#20272;&#35745;&#22120;&#65292;&#36866;&#29992;&#20110;&#27599;&#20010;&#26102;&#26399;&#36830;&#32493;&#20998;&#24067;&#30340;&#22788;&#29702;&#24773;&#20917;&#65292;&#19982;&#20256;&#32479;&#30340;&#21452;&#21521;&#22266;&#23450;&#25928;&#24212;&#22238;&#24402;&#27169;&#22411;&#30456;&#27604;&#65292;&#35813;&#26041;&#27861;&#20165;&#20381;&#36182;&#20110;&#24182;&#34892;&#36235;&#21183;&#20551;&#35774;&#12290;&#36890;&#36807;&#27604;&#36739;&#20855;&#26377;&#30456;&#21516;&#31532;&#19968;&#26102;&#26399;&#22788;&#29702;&#30340;&#20999;&#25442;&#32773;&#21644;&#20445;&#25345;&#32773;&#65292;&#26377;&#25928;&#36991;&#20813;&#20102;&#22788;&#29702;&#25928;&#24212;&#38543;&#26102;&#38388;&#21464;&#21270;&#30340;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2201.06898</link><description>&lt;p&gt;
&#22312;&#27599;&#20010;&#26102;&#26399;&#36830;&#32493;&#20998;&#24067;&#30340;&#22788;&#29702;&#20013;&#36827;&#34892;&#24046;&#24322;&#24615;&#21306;&#21035;&#20272;&#35745;&#22120;
&lt;/p&gt;
&lt;p&gt;
Difference-in-Differences Estimators for Treatments Continuously Distributed at Every Period. (arXiv:2201.06898v2 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2201.06898
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#24046;&#24322;&#24615;&#21306;&#21035;&#20272;&#35745;&#22120;&#65292;&#36866;&#29992;&#20110;&#27599;&#20010;&#26102;&#26399;&#36830;&#32493;&#20998;&#24067;&#30340;&#22788;&#29702;&#24773;&#20917;&#65292;&#19982;&#20256;&#32479;&#30340;&#21452;&#21521;&#22266;&#23450;&#25928;&#24212;&#22238;&#24402;&#27169;&#22411;&#30456;&#27604;&#65292;&#35813;&#26041;&#27861;&#20165;&#20381;&#36182;&#20110;&#24182;&#34892;&#36235;&#21183;&#20551;&#35774;&#12290;&#36890;&#36807;&#27604;&#36739;&#20855;&#26377;&#30456;&#21516;&#31532;&#19968;&#26102;&#26399;&#22788;&#29702;&#30340;&#20999;&#25442;&#32773;&#21644;&#20445;&#25345;&#32773;&#65292;&#26377;&#25928;&#36991;&#20813;&#20102;&#22788;&#29702;&#25928;&#24212;&#38543;&#26102;&#38388;&#21464;&#21270;&#30340;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#38024;&#23545;&#22312;&#27599;&#20010;&#26102;&#26399;&#36830;&#32493;&#20998;&#24067;&#30340;&#22788;&#29702;&#30340;&#26032;&#30340;&#24046;&#24322;&#24615;&#21306;&#21035;&#20272;&#35745;&#22120;&#65292;&#36825;&#31181;&#24773;&#20917;&#32463;&#24120;&#21457;&#29983;&#22312;&#36152;&#26131;&#20851;&#31246;&#25110;&#28201;&#24230;&#31561;&#24773;&#20917;&#19979;&#12290;&#25105;&#20204;&#39318;&#20808;&#20551;&#35774;&#35813;&#25968;&#25454;&#20165;&#26377;&#20004;&#20010;&#26102;&#26399;&#12290;&#25105;&#20204;&#36824;&#20551;&#35774;&#22312;&#31532;&#19968;&#26102;&#26399;&#21040;&#31532;&#20108;&#26102;&#26399;&#65292;&#26576;&#20123;&#21333;&#20301;&#65288;&#21363;&#20999;&#25442;&#32773;&#65289;&#30340;&#22788;&#29702;&#21457;&#29983;&#20102;&#21464;&#21270;&#65292;&#32780;&#20854;&#20182;&#21333;&#20301;&#65288;&#21363;&#20445;&#25345;&#32773;&#65289;&#30340;&#22788;&#29702;&#27809;&#26377;&#21464;&#21270;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#30340;&#20272;&#35745;&#22120;&#23558;&#20999;&#25442;&#32773;&#21644;&#20445;&#25345;&#32773;&#22312;&#31532;&#19968;&#26102;&#26399;&#30340;&#22788;&#29702;&#20540;&#30456;&#21516;&#30340;&#24773;&#20917;&#19979;&#30340;&#32467;&#26524;&#28436;&#21464;&#36827;&#34892;&#27604;&#36739;&#12290;&#25105;&#20204;&#30340;&#20272;&#35745;&#22120;&#20165;&#20381;&#36182;&#20110;&#24182;&#34892;&#36235;&#21183;&#20551;&#35774;&#65292;&#19981;&#20687;&#24120;&#29992;&#30340;&#21452;&#21521;&#22266;&#23450;&#25928;&#24212;&#22238;&#24402;&#27169;&#22411;&#36824;&#20381;&#36182;&#20110;&#22343;&#21248;&#22788;&#29702;&#25928;&#24212;&#20551;&#35774;&#12290;&#27604;&#36739;&#20855;&#26377;&#30456;&#21516;&#31532;&#19968;&#26102;&#26399;&#22788;&#29702;&#30340;&#20999;&#25442;&#32773;&#21644;&#20445;&#25345;&#32773;&#26159;&#24456;&#37325;&#35201;&#30340;&#65306;&#26080;&#26465;&#20214;&#27604;&#36739;&#20999;&#25442;&#32773;&#21644;&#20445;&#25345;&#32773;&#38544;&#21547;&#22320;&#20551;&#35774;&#22788;&#29702;&#25928;&#24212;&#38543;&#26102;&#38388;&#20445;&#25345;&#19981;&#21464;&#12290;&#23545;&#20110;&#36830;&#32493;&#22788;&#29702;&#65292;&#20999;&#25442;&#32773;&#26080;&#27861;&#19982;&#20855;&#26377;&#23436;&#20840;&#30456;&#21516;&#31532;&#19968;&#26102;&#26399;&#22788;&#29702;&#30340;&#20445;&#25345;&#32773;&#21305;&#37197;&#12290;
&lt;/p&gt;
&lt;p&gt;
We propose new difference-in-difference (DID) estimators for treatments continuously distributed at every time period, as is often the case of trade tariffs, or temperatures. We start by assuming that the data only has two time periods. We also assume that from period one to two, the treatment of some units, the switchers, changes, while the treatment of other units, the stayers, does not change. Then, our estimators compare the outcome evolution of switchers and stayers with the same value of the treatment at period one. Our estimators only rely on parallel trends assumptions, unlike commonly used two-way fixed effects regressions that also rely on homogeneous treatment effect assumptions. Comparing switchers and stayers with the same period-one treatment is important: unconditional comparisons of switchers and stayers implicitly assume constant treatment effects over time. With a continuous treatment, switchers cannot be matched to stayers with exactly the same period-one treatment, 
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#24191;&#20041;&#24418;&#24335;&#21338;&#24328;&#22343;&#34913;&#30340;&#25351;&#25968;&#29702;&#35770;&#65292;&#24212;&#29992;&#20110;&#31574;&#30053;&#38598;&#20026;&#26222;&#36890;&#22810;&#38754;&#20307;&#19988;&#25910;&#30410;&#20989;&#25968;&#20026;&#22810;&#32447;&#24615;&#30340;&#21338;&#24328;&#12290;</title><link>http://arxiv.org/abs/2201.02098</link><description>&lt;p&gt;
&#22810;&#38754;&#20307;&#21338;&#24328;&#21644;&#24191;&#20041;&#24418;&#24335;&#21338;&#24328;&#30340;&#25351;&#25968;/&#24230;&#37327;&#29702;&#35770;
&lt;/p&gt;
&lt;p&gt;
Polytope-form games and Index/Degree Theories for Extensive form games. (arXiv:2201.02098v3 [econ.TH] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2201.02098
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#24191;&#20041;&#24418;&#24335;&#21338;&#24328;&#22343;&#34913;&#30340;&#25351;&#25968;&#29702;&#35770;&#65292;&#24212;&#29992;&#20110;&#31574;&#30053;&#38598;&#20026;&#26222;&#36890;&#22810;&#38754;&#20307;&#19988;&#25910;&#30410;&#20989;&#25968;&#20026;&#22810;&#32447;&#24615;&#30340;&#21338;&#24328;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#24191;&#20041;&#24418;&#24335;&#21338;&#24328;&#22343;&#34913;&#30340;&#25351;&#25968;&#29702;&#35770;&#12290;&#36825;&#38656;&#35201;&#24320;&#21457;&#19968;&#20010;&#25351;&#25968;&#29702;&#35770;&#29992;&#20110;&#31574;&#30053;&#38598;&#20026;&#26222;&#36890;&#22810;&#38754;&#20307;&#19988;&#25910;&#30410;&#20989;&#25968;&#22312;&#36825;&#20123;&#22810;&#38754;&#20307;&#31215;&#20013;&#20026;&#22810;&#32447;&#24615;&#30340;&#21338;&#24328;&#12290;&#36825;&#20123;&#22810;&#38754;&#20307;&#26469;&#33258;&#20110;&#35782;&#21035;&#65288;&#22312;&#25299;&#25169;&#19978;&#31561;&#20215;&#30340;&#65289;&#28151;&#21512;&#31574;&#30053;&#30340;&#27491;&#24120;&#24418;&#24335;&#21338;&#24328;&#12290;
&lt;/p&gt;
&lt;p&gt;
We present an index theory of equilibria for extensive form games. This requires developing an index theory for games where the strategy sets of players are general polytopes and their payoff functions are multiaffine in the product of these polytopes. Such polytopes arise from identifying (topologically) equivalent mixed strategies of a normal form game.
&lt;/p&gt;</description></item><item><title>&#25552;&#20986;&#19968;&#31181;&#32479;&#19968;&#30340;&#39057;&#22495;&#20132;&#21449;&#39564;&#35777;&#26041;&#27861;&#65292;&#29992;&#20110;&#20272;&#35745;&#24322;&#26041;&#24046;&#24615;&#21644;&#33258;&#30456;&#20851;&#19968;&#33268;&#30340;&#26631;&#20934;&#35823;&#24046;&#12290;&#35813;&#26041;&#27861;&#21516;&#26102;&#36873;&#25321;&#21442;&#25968;&#21270;&#21644;&#38750;&#21442;&#25968;&#21270;&#35889;&#20272;&#35745;&#22120;&#30340;&#27169;&#22411;/&#35843;&#25972;&#21442;&#25968;&#65292;&#36890;&#36807;&#27169;&#25311;&#24471;&#21040;&#20102;&#33391;&#22909;&#30340;&#25928;&#26524;&#12290;</title><link>http://arxiv.org/abs/2108.06093</link><description>&lt;p&gt;
&#19968;&#31181;&#32479;&#19968;&#30340;&#39057;&#22495;&#20132;&#21449;&#39564;&#35777;&#26041;&#27861;&#29992;&#20110;HAC&#26631;&#20934;&#35823;&#24046;&#20272;&#35745;
&lt;/p&gt;
&lt;p&gt;
A Unified Frequency Domain Cross-Validatory Approach to HAC Standard Error Estimation. (arXiv:2108.06093v2 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2108.06093
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#19968;&#31181;&#32479;&#19968;&#30340;&#39057;&#22495;&#20132;&#21449;&#39564;&#35777;&#26041;&#27861;&#65292;&#29992;&#20110;&#20272;&#35745;&#24322;&#26041;&#24046;&#24615;&#21644;&#33258;&#30456;&#20851;&#19968;&#33268;&#30340;&#26631;&#20934;&#35823;&#24046;&#12290;&#35813;&#26041;&#27861;&#21516;&#26102;&#36873;&#25321;&#21442;&#25968;&#21270;&#21644;&#38750;&#21442;&#25968;&#21270;&#35889;&#20272;&#35745;&#22120;&#30340;&#27169;&#22411;/&#35843;&#25972;&#21442;&#25968;&#65292;&#36890;&#36807;&#27169;&#25311;&#24471;&#21040;&#20102;&#33391;&#22909;&#30340;&#25928;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#32479;&#19968;&#30340;&#39057;&#22495;&#20132;&#21449;&#39564;&#35777;&#65288;FDCV&#65289;&#26041;&#27861;&#65292;&#20197;&#33719;&#24471;&#24322;&#26041;&#24046;&#24615;&#21644;&#33258;&#30456;&#20851;&#19968;&#33268;&#30340;&#65288;HAC&#65289;&#26631;&#20934;&#35823;&#24046;&#12290;&#35813;&#26041;&#27861;&#21487;&#20197;&#21516;&#26102;&#36873;&#25321;&#21442;&#25968;&#21270;&#21644;&#38750;&#21442;&#25968;&#21270;&#35889;&#20272;&#35745;&#22120;&#30340;&#27169;&#22411;/&#35843;&#25972;&#21442;&#25968;&#12290;&#35813;&#26041;&#27861;&#30340;&#20505;&#36873;&#31867;&#21253;&#25324;&#22522;&#20110;&#38480;&#21046;&#26368;&#22823;&#20284;&#28982;&#30340;&#33258;&#22238;&#24402;&#35889;&#20272;&#35745;&#22120;&#21644;&#20855;&#26377;Parzen&#20869;&#26680;&#30340;&#28382;&#21518;&#26435;&#37325;&#20272;&#35745;&#22120;&#12290;&#27492;&#22806;&#65292;&#36824;&#25552;&#20379;&#20102;&#19968;&#31181;&#35745;&#31639;&#33258;&#22238;&#24402;&#27169;&#22411;&#30340;REML&#20272;&#35745;&#22120;&#30340;&#39640;&#25928;&#25216;&#26415;&#12290;&#36890;&#36807;&#27169;&#25311;&#65292;&#35777;&#26126;&#20102;FDCV&#26041;&#27861;&#30340;&#21487;&#38752;&#24615;&#65292;&#19982;&#27969;&#34892;&#30340;HAC&#20272;&#35745;&#22120;&#65288;&#22914;Andrews-Monahan&#21644;Newey-West&#65289;&#30456;&#27604;&#20855;&#26377;&#26356;&#22909;&#30340;&#25928;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
A unified frequency domain cross-validation (FDCV) method is proposed to obtain a heteroskedasticity and autocorrelation consistent (HAC) standard error. This method enables model/tuning parameter selection across both parametric and nonparametric spectral estimators simultaneously. The candidate class for this approach consists of restricted maximum likelihood-based (REML) autoregressive spectral estimators and lag-weights estimators with the Parzen kernel. Additionally, an efficient technique for computing the REML estimators of autoregressive models is provided. Through simulations, the reliability of the FDCV method is demonstrated, comparing favorably with popular HAC estimators such as Andrews-Monahan and Newey-West.
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#20171;&#32461;&#20102;&#22312;&#20844;&#20849;&#21355;&#29983;&#32039;&#24613;&#24773;&#20917;&#19979;&#65292;&#20256;&#32479;&#30340;&#20248;&#20808;&#32423;&#31995;&#32479;&#22312;&#20998;&#37197;&#31232;&#32570;&#25937;&#29983;&#36164;&#28304;&#20013;&#30340;&#23616;&#38480;&#24615;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#24066;&#22330;&#35774;&#35745;&#26041;&#27861;&#65292;&#21363;&#20648;&#22791;&#31995;&#32479;&#65292;&#20197;&#35299;&#20915;&#36825;&#20123;&#23616;&#38480;&#24615;&#12290;&#35813;&#35770;&#25991;&#23545;Covid-19&#30340;&#25919;&#31574;&#21644;&#23454;&#36341;&#20135;&#29983;&#20102;&#19968;&#23450;&#30340;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2008.00374</link><description>&lt;p&gt;
&#30123;&#33495;&#12289;&#21628;&#21560;&#26426;&#21644;&#25239;&#30149;&#27602;&#27835;&#30103;&#29289;&#30340;&#20844;&#24179;&#20998;&#37197;&#65306;&#22312;&#21355;&#29983;&#20445;&#20581;&#37197;&#32473;&#20013;&#19981;&#36951;&#28431;&#20219;&#20309;&#20262;&#29702;&#20215;&#20540;
&lt;/p&gt;
&lt;p&gt;
Fair Allocation of Vaccines, Ventilators and Antiviral Treatments: Leaving No Ethical Value Behind in Health Care Rationing. (arXiv:2008.00374v3 [econ.TH] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2008.00374
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#20171;&#32461;&#20102;&#22312;&#20844;&#20849;&#21355;&#29983;&#32039;&#24613;&#24773;&#20917;&#19979;&#65292;&#20256;&#32479;&#30340;&#20248;&#20808;&#32423;&#31995;&#32479;&#22312;&#20998;&#37197;&#31232;&#32570;&#25937;&#29983;&#36164;&#28304;&#20013;&#30340;&#23616;&#38480;&#24615;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#24066;&#22330;&#35774;&#35745;&#26041;&#27861;&#65292;&#21363;&#20648;&#22791;&#31995;&#32479;&#65292;&#20197;&#35299;&#20915;&#36825;&#20123;&#23616;&#38480;&#24615;&#12290;&#35813;&#35770;&#25991;&#23545;Covid-19&#30340;&#25919;&#31574;&#21644;&#23454;&#36341;&#20135;&#29983;&#20102;&#19968;&#23450;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#20844;&#20849;&#21355;&#29983;&#32039;&#24613;&#24773;&#20917;&#19979;&#65292;&#20256;&#32479;&#30340;&#20248;&#20808;&#32423;&#31995;&#32479;&#19968;&#30452;&#26159;&#31232;&#32570;&#25937;&#29983;&#36164;&#28304;&#20998;&#37197;&#30340;&#36873;&#25321;&#21327;&#35758;&#12290;Covid-19&#25581;&#31034;&#20102;&#36825;&#31181;&#20998;&#37197;&#35268;&#21017;&#30340;&#23616;&#38480;&#24615;&#12290;&#35768;&#22810;&#20154;&#35748;&#20026;&#65292;&#20248;&#20808;&#32423;&#31995;&#32479;&#36890;&#36807;&#27495;&#35270;&#24369;&#21183;&#31038;&#21306;&#32780;&#25243;&#24323;&#20102;&#20844;&#24179;&#31561;&#20262;&#29702;&#20215;&#20540;&#35266;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#20256;&#32479;&#20248;&#20808;&#32423;&#31995;&#32479;&#30340;&#38480;&#21046;&#24615;&#29305;&#24449;&#22312;&#24456;&#22823;&#31243;&#24230;&#19978;&#25512;&#21160;&#20102;&#36825;&#20123;&#23616;&#38480;&#24615;&#12290;&#36981;&#24490;&#26368;&#23567;&#24066;&#22330;&#35774;&#35745;&#21407;&#21017;&#65292;&#36825;&#26159;&#19968;&#20010;&#25972;&#21512;&#20102;&#30740;&#31350;&#21644;&#25919;&#31574;&#24037;&#20316;&#30340;&#26426;&#26500;&#35774;&#35745;&#33539;&#20363;&#65292;&#25105;&#20204;&#23558;&#31232;&#32570;&#25937;&#29983;&#36164;&#28304;&#30340;&#22823;&#27969;&#34892;&#20998;&#37197;&#24418;&#24335;&#21270;&#20026;&#24066;&#22330;&#35774;&#35745;&#30340;&#19968;&#20010;&#26032;&#24212;&#29992;&#12290;&#21482;&#24178;&#39044;&#20248;&#20808;&#32423;&#31995;&#32479;&#30340;&#38480;&#21046;&#29305;&#24449;&#26469;&#35299;&#20915;&#20854;&#32570;&#28857;&#65292;&#25105;&#20204;&#21046;&#23450;&#20102;&#20648;&#22791;&#31995;&#32479;&#20316;&#20026;&#26367;&#20195;&#20998;&#37197;&#35268;&#21017;&#12290;&#25105;&#20204;&#30340;&#29702;&#35770;&#20998;&#26512;&#21457;&#23637;&#20986;&#20102;&#19968;&#20010;&#20648;&#22791;&#35774;&#35745;&#30340;&#36890;&#29992;&#29702;&#35770;&#12290;&#25105;&#20204;&#23558;&#25105;&#20204;&#30340;&#20998;&#26512;&#19982;Covid-19&#26399;&#38388;&#30340;&#35752;&#35770;&#32852;&#31995;&#36215;&#26469;&#65292;&#24182;&#25551;&#36848;&#20102;&#25105;&#20204;&#30340;&#35770;&#25991;&#23545;&#25919;&#31574;&#21644;&#23454;&#36341;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
A priority system has traditionally been the protocol of choice for the allocation of scarce life-saving resources during public health emergencies. Covid-19 revealed the limitations of this allocation rule. Many argue that priority systems abandon ethical values such as equity by discriminating against disadvantaged communities. We show that a restrictive feature of the traditional priority system largely drives these limitations. Following minimalist market design, an institution design paradigm that integrates research and policy efforts, we formulate pandemic allocation of scarce life-saving resources as a new application of market design. Interfering only with the restrictive feature of the priority system to address its shortcomings, we formulate a reserve system as an alternative allocation rule. Our theoretical analysis develops a general theory of reserve design. We relate our analysis to debates during Covid-19 and describe the impact of our paper on policy and practice.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20379;&#20102;&#20998;&#26512;&#26234;&#33021;&#20307;&#38169;&#35823;&#35299;&#35835;&#25110;&#38169;&#35823;&#24863;&#30693;&#30495;&#23454;&#20915;&#31574;&#38382;&#39064;&#30340;&#29702;&#35770;&#26694;&#26550;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#34892;&#20026;&#23450;&#20041;&#26469;&#35780;&#20272;&#26234;&#33021;&#20307;&#22240;&#26524;&#24605;&#32500;&#27700;&#24179;&#65292;&#21516;&#26102;&#25552;&#20379;&#20102;&#19968;&#31181;&#31574;&#30053;&#26469;&#35782;&#21035;&#26234;&#33021;&#20307;&#22312;&#32570;&#20047;&#23436;&#20840;&#29702;&#24615;&#30340;&#24773;&#20917;&#19979;&#30340;&#20449;&#24565;&#12290;</title><link>http://arxiv.org/abs/2007.07703</link><description>&lt;p&gt;
&#12298;&#22240;&#26524;&#24605;&#32500;&#22833;&#36133;&#12299;
&lt;/p&gt;
&lt;p&gt;
Failures of Contingent Thinking. (arXiv:2007.07703v3 [cs.AI] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2007.07703
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20379;&#20102;&#20998;&#26512;&#26234;&#33021;&#20307;&#38169;&#35823;&#35299;&#35835;&#25110;&#38169;&#35823;&#24863;&#30693;&#30495;&#23454;&#20915;&#31574;&#38382;&#39064;&#30340;&#29702;&#35770;&#26694;&#26550;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#34892;&#20026;&#23450;&#20041;&#26469;&#35780;&#20272;&#26234;&#33021;&#20307;&#22240;&#26524;&#24605;&#32500;&#27700;&#24179;&#65292;&#21516;&#26102;&#25552;&#20379;&#20102;&#19968;&#31181;&#31574;&#30053;&#26469;&#35782;&#21035;&#26234;&#33021;&#20307;&#22312;&#32570;&#20047;&#23436;&#20840;&#29702;&#24615;&#30340;&#24773;&#20917;&#19979;&#30340;&#20449;&#24565;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20379;&#20102;&#19968;&#20010;&#29702;&#35770;&#26694;&#26550;&#26469;&#20998;&#26512;&#19968;&#20010;&#38169;&#35823;&#35299;&#35835;&#25110;&#38169;&#35823;&#24863;&#30693;&#30495;&#23454;&#20915;&#31574;&#38382;&#39064;&#30340;&#26234;&#33021;&#20307;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#19968;&#31995;&#21015;&#34892;&#20026;&#22312;&#23454;&#39564;&#29615;&#22659;&#20013;&#35266;&#23519;&#21040;&#30340;&#34920;&#29616;&#20026;&#26080;&#27861;&#29702;&#35299;&#21547;&#20041;&#65292;&#25442;&#21477;&#35805;&#35828;&#65292;&#26080;&#27861;&#27491;&#30830;&#32771;&#34385;&#21508;&#31181;&#19982;&#20851;&#38190;&#25903;&#20184;&#30456;&#20851;&#30340;&#24773;&#20917;&#20043;&#38388;&#30340;&#36923;&#36753;&#20851;&#31995;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#23545;&#24863;&#30693;&#22240;&#26524;&#20851;&#31995;&#30340;&#34892;&#20026;&#23450;&#20041;&#65292;&#20174;&#32780;&#25552;&#20379;&#20102;&#19968;&#31181;&#24341;&#23548;&#25216;&#26415;&#65292;&#24182;&#23637;&#31034;&#20102;&#19968;&#20010;&#26234;&#33021;&#20307;&#23545;&#22240;&#26524;&#20851;&#31995;&#30340;&#35299;&#37322;&#30830;&#23450;&#20102;&#20854;&#34892;&#20026;&#30340;&#20027;&#35266;&#29366;&#24577;&#31354;&#38388;&#12290;&#36890;&#36807;&#20998;&#26512;&#36825;&#20010;&#29366;&#24577;&#31354;&#38388;&#65292;&#25105;&#20204;&#25551;&#36848;&#20102;&#39537;&#21160;&#32463;&#39564;&#29616;&#35937;&#30340;&#36923;&#36753;&#22797;&#26434;&#24615;&#30340;&#19981;&#21516;&#22522;&#20934;&#12290;&#25105;&#20204;&#21306;&#20998;&#20102;&#38745;&#24577;&#21644;&#21160;&#24577;&#30340;&#29702;&#24615;&#12290;&#22240;&#27492;&#65292;&#25105;&#20204;&#30340;&#26694;&#26550;&#26082;&#25552;&#20379;&#20102;&#35780;&#20272;&#26234;&#33021;&#20307;&#22240;&#26524;&#24605;&#32500;&#27700;&#24179;&#30340;&#26041;&#27861;&#65292;&#21448;&#25552;&#20379;&#20102;&#22312;&#27809;&#26377;&#23436;&#20840;&#29702;&#24615;&#30340;&#24773;&#20917;&#19979;&#35782;&#21035;&#20854;&#20449;&#24565;&#30340;&#31574;&#30053;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this paper, we provide a theoretical framework to analyze an agent who misinterprets or misperceives the true decision problem she faces. We show that a wide range of behavior observed in experimental settings manifest as failures to perceive implications, in other words, to properly account for the logical relationships between various payoff relevant contingencies. We present a behavioral definition of perceived implication, thereby providing an elicitation technique, and show that an agent's account of implication identifies a subjective state-space that underlies her behavior. By analyzing this state-space, we characterize distinct benchmarks of logical sophistication that drive empirical phenomena. We disentangle static and dynamic rationality. Thus, our framework delivers both a methodology for assessing an agent's level of contingent thinking and a strategy for identifying her beliefs in the absence full rationality.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#24314;&#31435;&#20102;&#19968;&#20010;&#24102;&#26377;p-hacking&#30340;&#20551;&#35774;&#26816;&#39564;&#27169;&#22411;&#65292;&#36890;&#36807;&#35813;&#27169;&#22411;&#24471;&#20986;&#30340;&#20855;&#26377;&#25239;&#24178;&#25200;&#33021;&#21147;&#30340;&#20020;&#30028;&#20540;&#20801;&#35768;p-hacking&#65292;&#20174;&#32780;&#20462;&#27491;&#20102;&#20256;&#32479;&#20551;&#35774;&#26816;&#39564;&#29702;&#35770;&#22312;&#29616;&#23454;&#20013;&#30340;&#23616;&#38480;&#24615;&#12290;</title><link>http://arxiv.org/abs/2005.04141</link><description>&lt;p&gt;
&#20855;&#26377;&#25239;p-hacking&#33021;&#21147;&#30340;&#20020;&#30028;&#20540;
&lt;/p&gt;
&lt;p&gt;
Critical Values Robust to P-hacking. (arXiv:2005.04141v6 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2005.04141
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#24314;&#31435;&#20102;&#19968;&#20010;&#24102;&#26377;p-hacking&#30340;&#20551;&#35774;&#26816;&#39564;&#27169;&#22411;&#65292;&#36890;&#36807;&#35813;&#27169;&#22411;&#24471;&#20986;&#30340;&#20855;&#26377;&#25239;&#24178;&#25200;&#33021;&#21147;&#30340;&#20020;&#30028;&#20540;&#20801;&#35768;p-hacking&#65292;&#20174;&#32780;&#20462;&#27491;&#20102;&#20256;&#32479;&#20551;&#35774;&#26816;&#39564;&#29702;&#35770;&#22312;&#29616;&#23454;&#20013;&#30340;&#23616;&#38480;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
P-hacking&#22312;&#29616;&#23454;&#20013;&#24456;&#26222;&#36941;&#65292;&#20294;&#22312;&#32463;&#20856;&#30340;&#20551;&#35774;&#26816;&#39564;&#29702;&#35770;&#20013;&#21364;&#27809;&#26377;&#20986;&#29616;&#12290;&#22240;&#27492;&#65292;&#22312;&#38646;&#20551;&#35774;&#23454;&#38469;&#25104;&#31435;&#30340;&#24773;&#20917;&#19979;&#65292;&#26174;&#33879;&#32467;&#26524;&#27604;&#39044;&#26399;&#35201;&#24120;&#35265;&#24471;&#22810;&#12290;&#26412;&#25991;&#24314;&#31435;&#20102;&#19968;&#20010;&#24102;&#26377;p-hacking&#30340;&#20551;&#35774;&#26816;&#39564;&#27169;&#22411;&#12290;&#36890;&#36807;&#35813;&#27169;&#22411;&#65292;&#25105;&#20204;&#26500;&#24314;&#20102;&#20020;&#30028;&#20540;&#65292;&#22914;&#26524;&#20351;&#29992;&#36825;&#20123;&#20540;&#26469;&#30830;&#23450;&#26174;&#33879;&#24615;&#65292;&#24182;&#19988;&#31185;&#23398;&#23478;&#30340;p-hacking&#34892;&#20026;&#31526;&#21512;&#26032;&#30340;&#26174;&#33879;&#24615;&#26631;&#20934;&#65292;&#37027;&#20040;&#26174;&#33879;&#32467;&#26524;&#20250;&#20197;&#26399;&#26395;&#39057;&#29575;&#20986;&#29616;&#12290;&#36825;&#26679;&#30340;&#25239;&#24178;&#25200;&#20020;&#30028;&#20540;&#20801;&#35768;p-hacking&#65292;&#22240;&#27492;&#23427;&#20204;&#27604;&#32463;&#20856;&#30340;&#20020;&#30028;&#20540;&#35201;&#22823;&#12290;&#20026;&#20102;&#35828;&#26126;p-hacking&#25152;&#38656;&#30340;&#20462;&#27491;&#37327;&#65292;&#25105;&#20204;&#21033;&#29992;&#21307;&#23398;&#31185;&#23398;&#30340;&#35777;&#25454;&#23545;&#27169;&#22411;&#36827;&#34892;&#20102;&#26657;&#20934;&#12290;&#22312;&#26657;&#20934;&#30340;&#27169;&#22411;&#20013;&#65292;&#20219;&#20309;&#27979;&#35797;&#32479;&#35745;&#37327;&#30340;&#25239;&#24178;&#25200;&#20020;&#30028;&#20540;&#37117;&#26159;&#30456;&#21516;&#27979;&#35797;&#32479;&#35745;&#37327;&#30340;&#32463;&#20856;&#20020;&#30028;&#20540;&#30340;&#20116;&#20998;&#20043;&#19968;&#12290;
&lt;/p&gt;
&lt;p&gt;
P-hacking is prevalent in reality but absent from classical hypothesis testing theory. As a consequence, significant results are much more common than they are supposed to be when the null hypothesis is in fact true. In this paper, we build a model of hypothesis testing with p-hacking. From the model, we construct critical values such that, if the values are used to determine significance, and if scientists' p-hacking behavior adjusts to the new significance standards, significant results occur with the desired frequency. Such robust critical values allow for p-hacking so they are larger than classical critical values. To illustrate the amount of correction required by p-hacking, we calibrate the model using evidence from the medical sciences. In the calibrated model the robust critical value for any test statistic is the classical critical value for the same test statistic with one fifth of the significance level.
&lt;/p&gt;</description></item></channel></rss>