<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#29992;&#20110;&#32852;&#21512;&#35780;&#20272;&#22810;&#21464;&#37327;&#26041;&#21521;&#39044;&#27979;&#25216;&#33021;&#30340;&#31616;&#21333;&#26041;&#27861;&#65292;&#24182;&#21033;&#29992;&#27888;&#22269;&#19977;&#20010;&#32452;&#32455;&#22312;2001&#24180;&#33267;2021&#24180;&#38388;&#30340;GDP&#22686;&#38271;&#21644;&#36890;&#32960;&#39044;&#27979;&#25968;&#25454;&#65292;&#23637;&#31034;&#20102;&#35813;&#26041;&#27861;&#30340;&#24212;&#29992;&#12290;</title><link>https://rss.arxiv.org/abs/2402.01142</link><description>&lt;p&gt;
&#19968;&#31181;&#29992;&#20110;&#22810;&#21464;&#37327;&#26041;&#21521;&#39044;&#27979;&#25216;&#33021;&#32852;&#21512;&#35780;&#20272;&#30340;&#31616;&#21333;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
A simple method for joint evaluation of skill in directional forecasts of multiple variables
&lt;/p&gt;
&lt;p&gt;
https://rss.arxiv.org/abs/2402.01142
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#29992;&#20110;&#32852;&#21512;&#35780;&#20272;&#22810;&#21464;&#37327;&#26041;&#21521;&#39044;&#27979;&#25216;&#33021;&#30340;&#31616;&#21333;&#26041;&#27861;&#65292;&#24182;&#21033;&#29992;&#27888;&#22269;&#19977;&#20010;&#32452;&#32455;&#22312;2001&#24180;&#33267;2021&#24180;&#38388;&#30340;GDP&#22686;&#38271;&#21644;&#36890;&#32960;&#39044;&#27979;&#25968;&#25454;&#65292;&#23637;&#31034;&#20102;&#35813;&#26041;&#27861;&#30340;&#24212;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20027;&#35201;&#23439;&#35266;&#32463;&#27982;&#21464;&#37327;&#30340;&#39044;&#27979;&#36890;&#24120;&#30001;&#21516;&#19968;&#32452;&#32455;&#21516;&#26102;&#36827;&#34892;&#65292;&#24182;&#19988;&#22312;&#25919;&#31574;&#20998;&#26512;&#21644;&#20915;&#31574;&#20013;&#19968;&#36215;&#21576;&#29616;&#21644;&#20351;&#29992;&#12290;&#22240;&#27492;&#65292;&#20102;&#35299;&#39044;&#27979;&#32773;&#26159;&#21542;&#20855;&#22791;&#36275;&#22815;&#30340;&#25216;&#33021;&#26469;&#39044;&#27979;&#36825;&#20123;&#21464;&#37327;&#30340;&#26410;&#26469;&#20540;&#38750;&#24120;&#37325;&#35201;&#12290;&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#29992;&#20110;&#32852;&#21512;&#35780;&#20272;&#22810;&#21464;&#37327;&#26041;&#21521;&#39044;&#27979;&#25216;&#33021;&#30340;&#31616;&#21333;&#26041;&#27861;&#12290;&#35813;&#26041;&#27861;&#26131;&#20110;&#20351;&#29992;&#65292;&#19981;&#20381;&#36182;&#20110;&#20256;&#32479;&#32479;&#35745;&#26041;&#27861;&#20013;&#34913;&#37327;&#26041;&#21521;&#39044;&#27979;&#20934;&#30830;&#24615;&#25152;&#38656;&#30340;&#22797;&#26434;&#20551;&#35774;&#12290;&#37319;&#29992;&#27888;&#22269;&#19977;&#20010;&#32452;&#32455;&#65288;&#27888;&#22269;&#38134;&#34892;&#12289;&#36130;&#25919;&#25919;&#31574;&#21150;&#20844;&#23460;&#21644;&#22269;&#23478;&#32463;&#27982;&#21644;&#31038;&#20250;&#21457;&#23637;&#22996;&#21592;&#20250;&#21150;&#20844;&#23460;&#65289;&#20851;&#20110;2001&#24180;&#33267;2021&#24180;&#38388;&#27888;&#22269;GDP&#22686;&#38271;&#21644;&#36890;&#32960;&#39044;&#27979;&#20197;&#21450;&#23454;&#38469;&#25968;&#25454;&#65292;&#20197;&#28436;&#31034;&#35813;&#26041;&#27861;&#22914;&#20309;&#29992;&#20110;&#35780;&#20272;&#39044;&#27979;&#32773;&#30340;&#25216;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;
Forecasts for key macroeconomic variables are almost always made simultaneously by the same organizations, presented together, and used together in policy analyses and decision-makings. It is therefore important to know whether the forecasters are skillful enough to forecast the future values of those variables. Here a method for joint evaluation of skill in directional forecasts of multiple variables is introduced. The method is simple to use and does not rely on complicated assumptions required by the conventional statistical methods for measuring accuracy of directional forecast. The data on GDP growth and inflation forecasts of three organizations from Thailand, namely, the Bank of Thailand, the Fiscal Policy Office, and the Office of the National Economic and Social Development Council as well as the actual data on GDP growth and inflation of Thailand between 2001 and 2021 are employed in order to demonstrate how the method could be used to evaluate the skills of forecasters in pr
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#21457;&#29616;&#27888;&#22269;&#30340;&#25910;&#20837;&#20998;&#37197;&#20855;&#26377;&#23610;&#24230;&#19981;&#21464;&#24615;&#65292;&#22312;&#36817;&#19977;&#21313;&#24180;&#26469;&#20445;&#25345;&#19981;&#21464;&#65292;&#24847;&#21619;&#30528;&#25913;&#21464;&#25910;&#20837;&#20998;&#37197;&#38656;&#35201;&#36827;&#34892;&#31867;&#20284;&#29289;&#29702;&#23398;&#20013;&#29289;&#36136;&#30456;&#21464;&#30340;&#36807;&#31243;&#12290;</title><link>https://rss.arxiv.org/abs/2402.01141</link><description>&lt;p&gt;
&#27888;&#22269;&#30340;&#25910;&#20837;&#20998;&#37197;&#20855;&#26377;&#23610;&#24230;&#19981;&#21464;&#24615;
&lt;/p&gt;
&lt;p&gt;
Income distribution in Thailand is scale-invariant
&lt;/p&gt;
&lt;p&gt;
https://rss.arxiv.org/abs/2402.01141
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#21457;&#29616;&#27888;&#22269;&#30340;&#25910;&#20837;&#20998;&#37197;&#20855;&#26377;&#23610;&#24230;&#19981;&#21464;&#24615;&#65292;&#22312;&#36817;&#19977;&#21313;&#24180;&#26469;&#20445;&#25345;&#19981;&#21464;&#65292;&#24847;&#21619;&#30528;&#25913;&#21464;&#25910;&#20837;&#20998;&#37197;&#38656;&#35201;&#36827;&#34892;&#31867;&#20284;&#29289;&#29702;&#23398;&#20013;&#29289;&#36136;&#30456;&#21464;&#30340;&#36807;&#31243;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#32771;&#23519;&#20102;&#27888;&#22269;&#30340;&#25910;&#20837;&#20998;&#37197;&#26159;&#21542;&#20855;&#26377;&#23610;&#24230;&#19981;&#21464;&#24615;&#25110;&#24180;&#24230;&#33258;&#30456;&#20284;&#24615;&#12290;&#36890;&#36807;&#20351;&#29992;1988&#24180;&#33267;2021&#24180;&#27888;&#22269;&#20116;&#20998;&#20301;&#21644;&#21313;&#20998;&#20301;&#30340;&#25910;&#20837;&#20221;&#39069;&#25968;&#25454;&#65292;306&#20010;&#37197;&#23545;&#30340;Kolmogorov-Smirnov&#26816;&#39564;&#32467;&#26524;&#34920;&#26126;&#65292;&#27888;&#22269;&#30340;&#25910;&#20837;&#20998;&#37197;&#22312;&#32479;&#35745;&#19978;&#20855;&#26377;&#23610;&#24230;&#19981;&#21464;&#24615;&#25110;&#24180;&#24230;&#33258;&#30456;&#20284;&#24615;&#65292;p&#20540;&#33539;&#22260;&#22312;0.988&#33267;1.000&#20043;&#38388;&#12290;&#26681;&#25454;&#36825;&#20123;&#23454;&#35777;&#32467;&#26524;&#65292;&#26412;&#30740;&#31350;&#35748;&#20026;&#65292;&#20026;&#20102;&#25913;&#21464;&#25345;&#32493;&#20102;&#19977;&#21313;&#22810;&#24180;&#30340;&#27888;&#22269;&#25910;&#20837;&#20998;&#37197;&#27169;&#24335;&#65292;&#21464;&#38761;&#26412;&#36523;&#19981;&#33021;&#26159;&#28176;&#36827;&#30340;&#65292;&#32780;&#24212;&#35813;&#20687;&#29289;&#29702;&#23398;&#20013;&#30340;&#30456;&#21464;&#36807;&#31243;&#19968;&#26679;&#12290;
&lt;/p&gt;
&lt;p&gt;
This study examines whether income distribution in Thailand has a property of scale invariance or self-similarity across years. By using the data on income shares by quintile and by decile of Thailand from 1988 to 2021, the results from 306-pairwise Kolmogorov-Smirnov tests indicate that income distribution in Thailand is statistically scale-invariant or self-similar across years with p-values ranging between 0.988 and 1.000. Based on these empirical findings, this study would like to propose that, in order to change income distribution in Thailand whose pattern had persisted for over three decades, the change itself cannot be gradual but has to be like a phase transition of substance in physics.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#25968;&#25454;&#39537;&#21160;&#30340;&#30697;&#38453;&#22635;&#34917;&#26041;&#27861;&#65292;&#29992;&#20110;&#22240;&#26524;&#38754;&#26495;&#25968;&#25454;&#27169;&#22411;&#30340;&#27169;&#22411;&#36873;&#25321;&#12290;&#37319;&#29992;&#26680;&#33539;&#25968;&#26368;&#23567;&#21270;&#35843;&#25972;&#28508;&#22312;&#22240;&#23376;&#27169;&#22411;&#30340;&#31209;&#65292;&#24182;&#36890;&#36807;&#27491;&#21017;&#21270;&#32553;&#23567;&#27169;&#22411;&#22823;&#23567;&#12290;&#37319;&#29992;&#25490;&#21015;&#26041;&#27861;&#36827;&#34892;&#26377;&#25928;&#30340;&#26377;&#38480;&#26679;&#26412;&#25512;&#26029;&#65292;&#27169;&#25311;&#23454;&#39564;&#39564;&#35777;&#20102;&#20272;&#35745;&#22120;&#30340;&#19968;&#33268;&#24615;&#12290;&#23545;&#24503;&#22269;&#20844;&#20849;&#21355;&#29983;&#25919;&#31574;&#30340;&#24212;&#29992;&#32467;&#26524;&#26174;&#31034;&#26053;&#34892;&#38480;&#21046;&#23545;&#20005;&#37325;Covid-19&#24863;&#26579;&#30340;&#25511;&#21046;&#27809;&#26377;&#24433;&#21709;&#12290;</title><link>https://rss.arxiv.org/abs/2402.01069</link><description>&lt;p&gt;
&#22522;&#20110;&#25968;&#25454;&#39537;&#21160;&#30340;&#30697;&#38453;&#22635;&#34917;&#26041;&#27861;&#30340;&#22240;&#26524;&#38754;&#26495;&#25968;&#25454;&#27169;&#22411;&#36873;&#25321;
&lt;/p&gt;
&lt;p&gt;
Data-driven model selection within the matrix completion method for causal panel data models
&lt;/p&gt;
&lt;p&gt;
https://rss.arxiv.org/abs/2402.01069
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#25968;&#25454;&#39537;&#21160;&#30340;&#30697;&#38453;&#22635;&#34917;&#26041;&#27861;&#65292;&#29992;&#20110;&#22240;&#26524;&#38754;&#26495;&#25968;&#25454;&#27169;&#22411;&#30340;&#27169;&#22411;&#36873;&#25321;&#12290;&#37319;&#29992;&#26680;&#33539;&#25968;&#26368;&#23567;&#21270;&#35843;&#25972;&#28508;&#22312;&#22240;&#23376;&#27169;&#22411;&#30340;&#31209;&#65292;&#24182;&#36890;&#36807;&#27491;&#21017;&#21270;&#32553;&#23567;&#27169;&#22411;&#22823;&#23567;&#12290;&#37319;&#29992;&#25490;&#21015;&#26041;&#27861;&#36827;&#34892;&#26377;&#25928;&#30340;&#26377;&#38480;&#26679;&#26412;&#25512;&#26029;&#65292;&#27169;&#25311;&#23454;&#39564;&#39564;&#35777;&#20102;&#20272;&#35745;&#22120;&#30340;&#19968;&#33268;&#24615;&#12290;&#23545;&#24503;&#22269;&#20844;&#20849;&#21355;&#29983;&#25919;&#31574;&#30340;&#24212;&#29992;&#32467;&#26524;&#26174;&#31034;&#26053;&#34892;&#38480;&#21046;&#23545;&#20005;&#37325;Covid-19&#24863;&#26579;&#30340;&#25511;&#21046;&#27809;&#26377;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#22240;&#26524;&#38754;&#26495;&#25968;&#25454;&#27169;&#22411;&#20013;&#65292;&#20351;&#29992;&#30697;&#38453;&#22635;&#34917;&#20272;&#35745;&#22120;&#36890;&#36807;&#26680;&#33539;&#25968;&#26368;&#23567;&#21270;&#35843;&#25972;&#28508;&#22312;&#22240;&#23376;&#27169;&#22411;&#30340;&#31209;&#12290;&#35813;&#20984;&#20248;&#21270;&#38382;&#39064;&#20801;&#35768;&#21516;&#26102;&#23545;&#28508;&#22312;&#39640;&#32500;&#21327;&#21464;&#37327;&#38598;&#21512;&#36827;&#34892;&#27491;&#21017;&#21270;&#65292;&#20197;&#32553;&#23567;&#27169;&#22411;&#22823;&#23567;&#12290;&#20026;&#20102;&#36827;&#34892;&#26377;&#25928;&#30340;&#26377;&#38480;&#26679;&#26412;&#25512;&#26029;&#65292;&#25105;&#20204;&#37319;&#29992;&#22522;&#20110;&#25490;&#21015;&#30340;&#26041;&#27861;&#65292;&#24182;&#35777;&#26126;&#20854;&#23545;&#20219;&#20309;&#22788;&#29702;&#20998;&#37197;&#26426;&#21046;&#37117;&#26159;&#26377;&#25928;&#30340;&#12290;&#27169;&#25311;&#23454;&#39564;&#26174;&#31034;&#20102;&#25152;&#25552;&#20986;&#20272;&#35745;&#22120;&#22312;&#21442;&#25968;&#20272;&#35745;&#21644;&#21464;&#37327;&#36873;&#25321;&#26041;&#38754;&#30340;&#19968;&#33268;&#24615;&#12290;&#23545;&#24503;&#22269;&#20844;&#20849;&#21355;&#29983;&#25919;&#31574;&#30340;&#24212;&#29992;&#23637;&#31034;&#20102;&#22522;&#20110;&#25968;&#25454;&#39537;&#21160;&#30340;&#27169;&#22411;&#36873;&#25321;&#29305;&#24615;&#65292;&#24182;&#21457;&#29616;&#26053;&#34892;&#38480;&#21046;&#23545;&#20005;&#37325;Covid-19&#24863;&#26579;&#30340;&#25511;&#21046;&#27809;&#26377;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
Matrix completion estimators are employed in causal panel data models to regulate the rank of the underlying factor model using nuclear norm minimization. This convex optimization problem enables concurrent regularization of a potentially high-dimensional set of covariates to shrink the model size. For valid finite sample inference, we adopt a permutation-based approach and prove its validity for any treatment assignment mechanism. Simulations illustrate the consistency of the proposed estimator in parameter estimation and variable selection. An application to public health policies in Germany demonstrates the data-driven model selection feature on empirical data and finds no effect of travel restrictions on the containment of severe Covid-19 infections.
&lt;/p&gt;</description></item><item><title>&#36890;&#36807;&#21033;&#29992;&#23494;&#30721;&#35745;&#31639;&#24179;&#21488;&#25910;&#38598;&#21040;&#30340;&#24066;&#25919;&#26426;&#26500;&#25968;&#25454;&#65292;&#25105;&#20204;&#24314;&#31435;&#20102;&#22522;&#20110;&#25968;&#25454;&#39537;&#21160;&#30340;&#24066;&#25919;&#32593;&#32476;&#39118;&#38505;&#27169;&#22411;&#21644;&#32593;&#32476;&#23433;&#20840;&#22522;&#20934;&#65292;&#21487;&#20197;&#24110;&#21161;&#25351;&#23548;&#32593;&#32476;&#25919;&#31574;&#21046;&#23450;&#65292;&#37327;&#21270;&#32593;&#32476;&#39118;&#38505;&#65292;&#35782;&#21035;&#24046;&#36317;&#65292;&#20248;&#20808;&#32771;&#34385;&#25919;&#31574;&#24178;&#39044;&#65292;&#20197;&#21450;&#36319;&#36394;&#24178;&#39044;&#25514;&#26045;&#30340;&#36827;&#23637;&#12290;</title><link>https://rss.arxiv.org/abs/2402.01007</link><description>&lt;p&gt;
&#21033;&#29992;&#23494;&#30721;&#35745;&#31639;&#36827;&#34892;&#24066;&#25919;&#32593;&#32476;&#39118;&#38505;&#24314;&#27169;&#20197;&#20026;&#32593;&#32476;&#25919;&#31574;&#21046;&#23450;&#25552;&#20379;&#20449;&#24687;
&lt;/p&gt;
&lt;p&gt;
Municipal cyber risk modeling using cryptographic computing to inform cyber policymaking
&lt;/p&gt;
&lt;p&gt;
https://rss.arxiv.org/abs/2402.01007
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#21033;&#29992;&#23494;&#30721;&#35745;&#31639;&#24179;&#21488;&#25910;&#38598;&#21040;&#30340;&#24066;&#25919;&#26426;&#26500;&#25968;&#25454;&#65292;&#25105;&#20204;&#24314;&#31435;&#20102;&#22522;&#20110;&#25968;&#25454;&#39537;&#21160;&#30340;&#24066;&#25919;&#32593;&#32476;&#39118;&#38505;&#27169;&#22411;&#21644;&#32593;&#32476;&#23433;&#20840;&#22522;&#20934;&#65292;&#21487;&#20197;&#24110;&#21161;&#25351;&#23548;&#32593;&#32476;&#25919;&#31574;&#21046;&#23450;&#65292;&#37327;&#21270;&#32593;&#32476;&#39118;&#38505;&#65292;&#35782;&#21035;&#24046;&#36317;&#65292;&#20248;&#20808;&#32771;&#34385;&#25919;&#31574;&#24178;&#39044;&#65292;&#20197;&#21450;&#36319;&#36394;&#24178;&#39044;&#25514;&#26045;&#30340;&#36827;&#23637;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24066;&#25919;&#26426;&#26500;&#23481;&#26131;&#21463;&#21040;&#32593;&#32476;&#25915;&#20987;&#24182;&#36896;&#25104;&#28798;&#38590;&#24615;&#21518;&#26524;&#65292;&#20294;&#32570;&#20047;&#35780;&#20272;&#33258;&#36523;&#39118;&#38505;&#24182;&#19982;&#21516;&#34892;&#26426;&#26500;&#30340;&#23433;&#20840;&#29366;&#20917;&#36827;&#34892;&#27604;&#36739;&#30340;&#20851;&#38190;&#20449;&#24687;&#12290;&#25105;&#20204;&#21033;&#29992;&#36890;&#36807;&#23494;&#30721;&#35745;&#31639;&#24179;&#21488;&#25910;&#38598;&#30340;83&#20010;&#24066;&#25919;&#26426;&#26500;&#30340;&#25968;&#25454;&#65292;&#21253;&#25324;&#23433;&#20840;&#29366;&#20917;&#12289;&#23433;&#20840;&#20107;&#20214;&#12289;&#23433;&#20840;&#25511;&#21046;&#22833;&#25928;&#20197;&#21450;&#25439;&#22833;&#65292;&#24314;&#31435;&#22522;&#20110;&#25968;&#25454;&#39537;&#21160;&#30340;&#24066;&#25919;&#32593;&#32476;&#39118;&#38505;&#27169;&#22411;&#21644;&#32593;&#32476;&#23433;&#20840;&#22522;&#20934;&#12290;&#25105;&#20204;&#29983;&#25104;&#20102;&#19968;&#20010;&#34892;&#19994;&#20013;&#23433;&#20840;&#29366;&#20917;&#30340;&#22522;&#20934;&#12289;&#32593;&#32476;&#23433;&#20840;&#20107;&#20214;&#30340;&#39057;&#29575;&#12289;&#32452;&#32455;&#26681;&#25454;&#20854;&#38450;&#24481;&#29366;&#20917;&#39044;&#27979;&#30340;&#24180;&#24230;&#25439;&#22833;&#65292;&#20197;&#21450;&#26681;&#25454;&#21508;&#20010;&#25511;&#21046;&#25514;&#26045;&#30340;&#22833;&#25928;&#29575;&#21644;&#30456;&#20851;&#25439;&#22833;&#21152;&#26435;&#12290;&#32508;&#21512;&#36825;&#22235;&#39033;&#25351;&#26631;&#21487;&#20197;&#36890;&#36807;&#37327;&#21270;&#34892;&#19994;&#20013;&#30340;&#32593;&#32476;&#39118;&#38505;&#12289;&#35782;&#21035;&#38656;&#35201;&#35299;&#20915;&#30340;&#24046;&#36317;&#12289;&#20248;&#20808;&#32771;&#34385;&#25919;&#31574;&#24178;&#39044;&#65292;&#24182;&#36319;&#36394;&#36825;&#20123;&#24178;&#39044;&#25514;&#26045;&#30340;&#36827;&#23637;&#26469;&#25351;&#23548;&#32593;&#32476;&#25919;&#31574;&#21046;&#23450;&#12290;&#23545;&#20110;&#24066;&#25919;&#26426;&#26500;&#26469;&#35828;&#65292;&#36825;&#20123;&#26032;&#30340;&#25351;&#26631;&#21487;&#20197;&#24110;&#21161;&#20182;&#20204;&#35780;&#20272;&#33258;&#36523;&#32593;&#32476;&#39118;&#38505;&#24182;&#21046;&#23450;&#30456;&#24212;&#30340;&#25913;&#36827;&#25514;&#26045;&#12290;
&lt;/p&gt;
&lt;p&gt;
Municipalities are vulnerable to cyberattacks with devastating consequences, but they lack key information to evaluate their own risk and compare their security posture to peers. Using data from 83 municipalities collected via a cryptographically secure computation platform about their security posture, incidents, security control failures, and losses, we build data-driven cyber risk models and cyber security benchmarks for municipalities. We produce benchmarks of the security posture in a sector, the frequency of cyber incidents, forecasted annual losses for organizations based on their defensive posture, and a weighting of cyber controls based on their individual failure rates and associated losses. Combined, these four items can help guide cyber policymaking by quantifying the cyber risk in a sector, identifying gaps that need to be addressed, prioritizing policy interventions, and tracking progress of those interventions over time. In the case of the municipalities, these newly der
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#36890;&#36807;&#23545;&#21487;&#20877;&#29983;&#21830;&#21697;&#20215;&#26684;&#30340;&#20914;&#20987;&#30340;&#25345;&#20037;&#24615;&#36827;&#34892;&#31283;&#20581;&#20998;&#26512;&#65292;&#21457;&#29616;&#22823;&#37096;&#20998;&#31995;&#21015;&#26174;&#31034;&#20986;&#38750;&#32447;&#24615;&#29305;&#24449;&#21644;&#20307;&#21046;&#36716;&#21464;&#65292;&#24182;&#24471;&#20986;&#32422;&#19968;&#21322;&#30340;&#31995;&#21015;&#26159;&#25972;&#21512;&#30340;&#32467;&#35770;&#12290;</title><link>https://rss.arxiv.org/abs/2402.01005</link><description>&lt;p&gt;
&#21487;&#20877;&#29983;&#21830;&#21697;&#30340;&#20215;&#26684;:&#19968;&#20010;&#24378;&#20581;&#30340;&#24179;&#31283;&#24615;&#20998;&#26512;
&lt;/p&gt;
&lt;p&gt;
The prices of renewable commodities: A robust stationarity analysis
&lt;/p&gt;
&lt;p&gt;
https://rss.arxiv.org/abs/2402.01005
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36890;&#36807;&#23545;&#21487;&#20877;&#29983;&#21830;&#21697;&#20215;&#26684;&#30340;&#20914;&#20987;&#30340;&#25345;&#20037;&#24615;&#36827;&#34892;&#31283;&#20581;&#20998;&#26512;&#65292;&#21457;&#29616;&#22823;&#37096;&#20998;&#31995;&#21015;&#26174;&#31034;&#20986;&#38750;&#32447;&#24615;&#29305;&#24449;&#21644;&#20307;&#21046;&#36716;&#21464;&#65292;&#24182;&#24471;&#20986;&#32422;&#19968;&#21322;&#30340;&#31995;&#21015;&#26159;&#25972;&#21512;&#30340;&#32467;&#35770;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#35299;&#20915;&#20102;&#27979;&#35797;&#21487;&#20877;&#29983;&#21830;&#21697;&#20215;&#26684;&#21463;&#20914;&#20987;&#30340;&#25345;&#20037;&#24615;&#38382;&#39064;&#65292;&#36825;&#23545;&#31283;&#23450;&#25919;&#31574;&#21644;&#32463;&#27982;&#39044;&#27979;&#31561;&#39046;&#22495;&#20855;&#26377;&#28508;&#22312;&#24433;&#21709;&#12290;&#37319;&#29992;&#20102;&#19968;&#31181;&#24378;&#20581;&#30340;&#26041;&#27861;&#65292;&#21487;&#20197;&#30830;&#23450;&#31995;&#21015;&#20013;&#28508;&#22312;&#23384;&#22312;&#30340;&#21363;&#26102;/&#28176;&#36827;&#24615;&#32467;&#26500;&#21464;&#21270;&#30340;&#25968;&#37327;&#65292;&#24182;&#26681;&#25454;&#26816;&#27979;&#21040;&#30340;&#21464;&#21270;&#28857;&#36827;&#34892;&#26465;&#20214;&#24179;&#31283;&#24615;&#27979;&#35797;&#12290;&#35813;&#26041;&#27861;&#24212;&#29992;&#20110;1900&#24180;&#33267;2018&#24180;&#38388;&#30340;&#21313;&#20843;&#31181;&#21487;&#20877;&#29983;&#21830;&#21697;&#30340;&#24180;&#24230;&#23454;&#38469;&#20215;&#26684;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;&#22823;&#37096;&#20998;&#31995;&#21015;&#26174;&#31034;&#20986;&#38750;&#32447;&#24615;&#29305;&#24449;&#65292;&#21253;&#25324;&#20108;&#27425;&#27169;&#24335;&#21644;&#24120;&#24120;&#19982;&#20247;&#25152;&#21608;&#30693;&#30340;&#25919;&#27835;&#21644;&#32463;&#27982;&#20107;&#20214;&#30456;&#21563;&#21512;&#30340;&#20307;&#21046;&#36716;&#21464;&#12290;&#24179;&#31283;&#24615;&#27979;&#35797;&#30340;&#32467;&#35770;&#34920;&#26126;&#65292;&#22823;&#32422;&#19968;&#21322;&#30340;&#31995;&#21015;&#26159;&#25972;&#21512;&#30340;&#12290;&#23545;&#31918;&#39135;&#32780;&#35328;&#65292;&#24179;&#31283;&#24615;&#19981;&#34987;&#25298;&#32477;&#65292;&#32780;&#22823;&#22810;&#25968;&#29298;&#30044;&#21644;&#32442;&#32455;&#21697;&#21017;&#34987;&#25298;&#32477;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper addresses the problem of testing for persistence in the effects of the shocks affecting the prices of renewable commodities, which have potential implications on stabilization policies and economic forecasting, among other areas. A robust methodology is employed that enables the determination of the potential presence and number of instant/gradual structural changes in the series, stationarity testing conditional on the number of changes detected, and the detection of change points. This procedure is applied to the annual real prices of eighteen renewable commodities over the period of 1900-2018. Results indicate that most of the series display non-linear features, including quadratic patterns and regime transitions that often coincide with well-known political and economic episodes. The conclusions of stationarity testing suggest that roughly half of the series are integrated. Stationarity fails to be rejected for grains, whereas most livestock and textile commodities do re
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#22238;&#39038;&#20102;&#31454;&#20105;&#22343;&#34913;&#30340;&#21807;&#19968;&#24615;&#21644;&#22810;&#26679;&#24615;&#22312;&#25968;&#23398;&#32463;&#27982;&#23398;&#12289;&#37329;&#34701;&#23398;&#12289;&#23439;&#35266;&#32463;&#27982;&#23398;&#21644;&#36152;&#26131;&#20013;&#30340;&#26368;&#26032;&#36827;&#23637;&#12290;</title><link>https://rss.arxiv.org/abs/2402.00998</link><description>&lt;p&gt;
&#31454;&#20105;&#22343;&#34913;&#21807;&#19968;&#24615;&#30340;&#26368;&#26032;&#36827;&#23637;
&lt;/p&gt;
&lt;p&gt;
Recent Advances on Uniqueness of Competitive Equilibrium
&lt;/p&gt;
&lt;p&gt;
https://rss.arxiv.org/abs/2402.00998
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#22238;&#39038;&#20102;&#31454;&#20105;&#22343;&#34913;&#30340;&#21807;&#19968;&#24615;&#21644;&#22810;&#26679;&#24615;&#22312;&#25968;&#23398;&#32463;&#27982;&#23398;&#12289;&#37329;&#34701;&#23398;&#12289;&#23439;&#35266;&#32463;&#27982;&#23398;&#21644;&#36152;&#26131;&#20013;&#30340;&#26368;&#26032;&#36827;&#23637;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#32508;&#36848;&#20102;&#25968;&#23398;&#32463;&#27982;&#23398;&#12289;&#37329;&#34701;&#23398;&#12289;&#23439;&#35266;&#32463;&#27982;&#23398;&#21644;&#36152;&#26131;&#20013;&#28041;&#21450;&#30340;&#27169;&#22411;&#20013;&#31454;&#20105;&#22343;&#34913;&#30340;&#21807;&#19968;&#24615;&#21644;&#22810;&#26679;&#24615;&#30340;&#26368;&#26032;&#36827;&#23637;&#12290;
&lt;/p&gt;
&lt;p&gt;
This article reviews the recent advances in the uniqueness and multiplicity of competitive equilibria in models arising in mathematical economics, finance, macroeconomics, and trade.
&lt;/p&gt;</description></item><item><title>&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#26694;&#26550;&#65292;&#29992;&#20110;&#35780;&#20272;&#22914;&#20309;&#26368;&#20248;&#22320;&#23545;&#24322;&#36136;&#33021;&#21147;&#30340;&#23398;&#29983;&#36827;&#34892;&#25490;&#24207;&#21644;&#20998;&#32423;&#12290;&#19968;&#20010;&#26368;&#20248;&#30340;&#23398;&#26657;&#31995;&#32479;&#22312;&#33021;&#21147;&#26041;&#38754;&#34920;&#29616;&#20986;&#31895;&#30053;&#20998;&#23618;&#65292;&#24182;&#19988;&#22312;&#39030;&#32423;&#23398;&#26657;&#27604;&#24213;&#32423;&#23398;&#26657;&#26356;&#23485;&#26494;&#22320;&#36827;&#34892;&#20998;&#32423;&#12290;</title><link>https://rss.arxiv.org/abs/2208.10894</link><description>&lt;p&gt;
&#25490;&#21517;&#21644;&#20998;&#32423;
&lt;/p&gt;
&lt;p&gt;
Sorting and Grading
&lt;/p&gt;
&lt;p&gt;
https://rss.arxiv.org/abs/2208.10894
&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#26694;&#26550;&#65292;&#29992;&#20110;&#35780;&#20272;&#22914;&#20309;&#26368;&#20248;&#22320;&#23545;&#24322;&#36136;&#33021;&#21147;&#30340;&#23398;&#29983;&#36827;&#34892;&#25490;&#24207;&#21644;&#20998;&#32423;&#12290;&#19968;&#20010;&#26368;&#20248;&#30340;&#23398;&#26657;&#31995;&#32479;&#22312;&#33021;&#21147;&#26041;&#38754;&#34920;&#29616;&#20986;&#31895;&#30053;&#20998;&#23618;&#65292;&#24182;&#19988;&#22312;&#39030;&#32423;&#23398;&#26657;&#27604;&#24213;&#32423;&#23398;&#26657;&#26356;&#23485;&#26494;&#22320;&#36827;&#34892;&#20998;&#32423;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#26694;&#26550;&#65292;&#29992;&#20110;&#35780;&#20272;&#22914;&#20309;&#26368;&#20248;&#22320;&#23545;&#24322;&#36136;&#33021;&#21147;&#30340;&#23398;&#29983;&#36827;&#34892;&#25490;&#24207;&#21644;&#20998;&#32423;&#12290;&#28508;&#22312;&#38599;&#20027;&#23545;&#20010;&#20307;&#30340;&#29983;&#20135;&#20215;&#20540;&#23384;&#22312;&#19981;&#30830;&#23450;&#24615;&#12290;&#20102;&#35299;&#20010;&#20307;&#25152;&#23601;&#35835;&#30340;&#23398;&#26657;&#20855;&#26377;&#20004;&#20010;&#29992;&#36884;&#65306;&#39318;&#20808;&#65292;&#23398;&#26657;&#30340;&#24179;&#22343;&#23398;&#29983;&#33021;&#21147;&#21487;&#33021;&#20250;&#26377;&#25152;&#19981;&#21516;&#65307;&#20854;&#27425;&#65292;&#19981;&#21516;&#23398;&#26657;&#21487;&#33021;&#20250;&#20351;&#29992;&#19981;&#21516;&#30340;&#35780;&#20998;&#35268;&#21017;&#65292;&#20174;&#32780;&#25552;&#20379;&#19981;&#21516;&#30340;&#28608;&#21169;&#26469;&#21162;&#21147;&#12290;&#19968;&#20010;&#26368;&#20248;&#30340;&#23398;&#26657;&#31995;&#32479;&#22312;&#33021;&#21147;&#26041;&#38754;&#34920;&#29616;&#20986;&#31895;&#30053;&#20998;&#23618;&#65292;&#24182;&#19988;&#22312;&#39030;&#32423;&#23398;&#26657;&#27604;&#24213;&#32423;&#23398;&#26657;&#26356;&#23485;&#26494;&#22320;&#36827;&#34892;&#20998;&#32423;&#12290;&#25105;&#20204;&#30340;&#35770;&#25991;&#23545;&#20110;&#20013;&#23398;&#36861;&#36394;&#25919;&#31574;&#30340;&#25345;&#32493;&#36777;&#35770;&#20570;&#20986;&#20102;&#36129;&#29486;&#12290;
&lt;/p&gt;
&lt;p&gt;
We propose a framework to assess how to optimally sort and grade students of heterogenous ability. Potential employers face uncertainty regarding an individual's productive value. Knowing which school an individual went to is useful for two reasons: firstly, average student ability may differ across schools; secondly, different schools may use different grading rules and thus provide varying incentives to exert effort. An optimal school system exhibits coarse stratification with respect to ability, and more lenient grading at the top-tier schools than at the bottom-tier schools. Our paper contributes to the ongoing policy debate on tracking in secondary schools.
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#40065;&#26834;&#30340;&#31532;&#19977;&#24230;&#20215;&#26684;&#27495;&#35270;&#27169;&#22411;&#65292;&#22312;&#20080;&#26041;&#20272;&#20540;&#26410;&#30693;&#30340;&#24773;&#20917;&#19979;&#65292;&#36890;&#36807;&#21521;&#21334;&#26041;&#36879;&#38706;&#20449;&#24687;&#26469;&#26368;&#22823;&#21270;&#20080;&#26041;&#21097;&#20313;&#65292;&#24182;&#24471;&#21040;&#20102;&#20851;&#20110;&#36951;&#25022;&#24230;&#30340;&#30028;&#38480;&#12290;</title><link>http://arxiv.org/abs/2401.16942</link><description>&lt;p&gt;
&#40065;&#26834;&#30340;&#20215;&#26684;&#27495;&#35270;
&lt;/p&gt;
&lt;p&gt;
Robust Price Discrimination. (arXiv:2401.16942v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.16942
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#40065;&#26834;&#30340;&#31532;&#19977;&#24230;&#20215;&#26684;&#27495;&#35270;&#27169;&#22411;&#65292;&#22312;&#20080;&#26041;&#20272;&#20540;&#26410;&#30693;&#30340;&#24773;&#20917;&#19979;&#65292;&#36890;&#36807;&#21521;&#21334;&#26041;&#36879;&#38706;&#20449;&#24687;&#26469;&#26368;&#22823;&#21270;&#20080;&#26041;&#21097;&#20313;&#65292;&#24182;&#24471;&#21040;&#20102;&#20851;&#20110;&#36951;&#25022;&#24230;&#30340;&#30028;&#38480;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#32771;&#34385;&#20102;&#19968;&#20010;&#31532;&#19977;&#24230;&#20215;&#26684;&#27495;&#35270;&#30340;&#27169;&#22411;&#65292;&#20854;&#20013;&#21334;&#26041;&#23545;&#20135;&#21697;&#30340;&#20272;&#20540;&#26410;&#30693;&#20110;&#24066;&#22330;&#35774;&#35745;&#32773;&#65292;&#21518;&#32773;&#36890;&#36807;&#21521;&#21334;&#26041;&#36879;&#38706;&#20080;&#26041;&#20272;&#20540;&#30340;&#20449;&#24687;&#26469;&#26368;&#22823;&#21270;&#20080;&#26041;&#21097;&#20313;&#12290;&#25105;&#20204;&#30340;&#20027;&#35201;&#32467;&#26524;&#34920;&#26126;&#65292;&#36951;&#25022;&#24230;&#38480;&#21046;&#20026;$U^*(0)/e$&#65292;&#20854;&#20013; $U^*(0)$&#26159;&#22312;&#21334;&#26041;&#23545;&#20135;&#21697;&#27809;&#26377;&#20272;&#20540;&#30340;&#24773;&#20917;&#19979;&#30340;&#26368;&#20248;&#20080;&#26041;&#21097;&#20313;&#12290;&#35813;&#38480;&#21046;&#36890;&#36807;&#38543;&#26426;&#25277;&#21462;&#21334;&#26041;&#20272;&#20540;&#24182;&#24212;&#29992;Bergemann&#31561;&#20154;&#65288;2015&#65289;&#23545;&#20110;&#25277;&#21462;&#20272;&#20540;&#30340;&#20998;&#21106;&#26041;&#27861;&#24471;&#21040;&#12290;&#25105;&#20204;&#36824;&#35777;&#26126;&#20102;&#22312;&#20108;&#20998;&#31867;&#20080;&#26041;&#20272;&#20540;&#30340;&#24773;&#20917;&#19979;&#65292;$U^*(0)/e$&#38480;&#21046;&#26159;&#32039;&#23494;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
We consider a model of third-degree price discrimination, in which the seller has a valuation for the product which is unknown to the market designer, who aims to maximize the buyers' surplus by revealing information regarding the buyer's valuation to the seller. Our main result shows that the regret is bounded by $U^*(0)/e$, where $U^*(0)$ is the optimal buyer surplus in the case where the seller has zero valuation for the product. This bound is attained by randomly drawing a seller valuation and applying the segmentation of Bergemann et al. (2015) with respect to the drawn valuation. We show that the $U^*(0)/e$ bound is tight in the case of binary buyer valuation.
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#24320;&#21457;&#20102;&#19968;&#20010;&#32771;&#34385;&#30456;&#20851;&#24615;&#30340;&#20998;&#26512;&#24066;&#22330;&#65292;&#36890;&#36807;&#37319;&#29992;Shapley&#20540;&#30340;&#24402;&#22240;&#31574;&#30053;&#26469;&#20998;&#37197;&#25910;&#20837;&#65292;&#20419;&#36827;&#20102;&#25968;&#25454;&#20849;&#20139;&#20197;&#25552;&#39640;&#33021;&#28304;&#39044;&#27979;&#30340;&#20934;&#30830;&#24615;&#12290;</title><link>http://arxiv.org/abs/2310.06000</link><description>&lt;p&gt;
&#40723;&#21169;&#25968;&#25454;&#20849;&#20139;&#20197;&#36827;&#34892;&#33021;&#28304;&#39044;&#27979;&#65306;&#20855;&#26377;&#30456;&#20851;&#25968;&#25454;&#30340;&#20998;&#26512;&#24066;&#22330;
&lt;/p&gt;
&lt;p&gt;
Incentivizing Data Sharing for Energy Forecasting: Analytics Markets with Correlated Data. (arXiv:2310.06000v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.06000
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#24320;&#21457;&#20102;&#19968;&#20010;&#32771;&#34385;&#30456;&#20851;&#24615;&#30340;&#20998;&#26512;&#24066;&#22330;&#65292;&#36890;&#36807;&#37319;&#29992;Shapley&#20540;&#30340;&#24402;&#22240;&#31574;&#30053;&#26469;&#20998;&#37197;&#25910;&#20837;&#65292;&#20419;&#36827;&#20102;&#25968;&#25454;&#20849;&#20139;&#20197;&#25552;&#39640;&#33021;&#28304;&#39044;&#27979;&#30340;&#20934;&#30830;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20934;&#30830;&#22320;&#39044;&#27979;&#19981;&#30830;&#23450;&#30340;&#30005;&#21147;&#20135;&#37327;&#23545;&#20110;&#30005;&#21147;&#24066;&#22330;&#30340;&#31038;&#20250;&#31119;&#21033;&#20855;&#26377;&#30410;&#22788;&#65292;&#21487;&#20197;&#20943;&#23569;&#24179;&#34913;&#36164;&#28304;&#30340;&#38656;&#27714;&#12290;&#23558;&#36825;&#31181;&#39044;&#27979;&#25551;&#36848;&#20026;&#19968;&#39033;&#20998;&#26512;&#20219;&#21153;&#65292;&#24403;&#21069;&#25991;&#29486;&#25552;&#20986;&#20102;&#20197;&#20998;&#26512;&#24066;&#22330;&#20316;&#20026;&#28608;&#21169;&#25163;&#27573;&#26469;&#25913;&#21892;&#31934;&#24230;&#30340;&#25968;&#25454;&#20849;&#20139;&#26041;&#27861;&#65292;&#20363;&#22914;&#21033;&#29992;&#26102;&#31354;&#30456;&#20851;&#24615;&#12290;&#25361;&#25112;&#22312;&#20110;&#65292;&#24403;&#30456;&#20851;&#25968;&#25454;&#29992;&#20316;&#39044;&#27979;&#30340;&#36755;&#20837;&#29305;&#24449;&#26102;&#65292;&#37325;&#21472;&#20449;&#24687;&#30340;&#20215;&#20540;&#22312;&#20110;&#25910;&#20837;&#20998;&#37197;&#26041;&#38754;&#20351;&#24066;&#22330;&#35774;&#35745;&#22797;&#26434;&#21270;&#65292;&#22240;&#20026;&#36825;&#31181;&#20215;&#20540;&#22312;&#26412;&#36136;&#19978;&#26159;&#32452;&#21512;&#30340;&#12290;&#25105;&#20204;&#20026;&#39118;&#21147;&#39044;&#27979;&#24212;&#29992;&#24320;&#21457;&#20102;&#19968;&#20010;&#32771;&#34385;&#30456;&#20851;&#24615;&#30340;&#20998;&#26512;&#24066;&#22330;&#12290;&#20026;&#20102;&#20998;&#37197;&#25910;&#20837;&#65292;&#25105;&#20204;&#37319;&#29992;&#20102;&#22522;&#20110;Shapley&#20540;&#30340;&#24402;&#22240;&#31574;&#30053;&#65292;&#23558;&#20195;&#29702;&#20154;&#30340;&#29305;&#24449;&#35270;&#20026;&#29609;&#23478;&#65292;&#23558;&#20182;&#20204;&#30340;&#30456;&#20114;&#20316;&#29992;&#35270;&#20026;&#19968;&#20010;&#29305;&#24449;&#20989;&#25968;&#21338;&#24328;&#12290;&#25105;&#20204;&#35828;&#26126;&#20102;&#25551;&#36848;&#36825;&#31181;&#21338;&#24328;&#30340;&#22810;&#31181;&#36873;&#39033;&#65292;&#27599;&#20010;&#36873;&#39033;&#37117;&#26377;&#22240;&#26524;&#32454;&#24494;&#24046;&#21035;&#65292;&#24433;&#21709;&#30528;&#29305;&#24449;&#30456;&#20851;&#26102;&#30340;&#24066;&#22330;&#34892;&#20026;&#12290;
&lt;/p&gt;
&lt;p&gt;
Reliably forecasting uncertain power production is beneficial for the social welfare of electricity markets by reducing the need for balancing resources. Describing such forecasting as an analytics task, the current literature proposes analytics markets as an incentive for data sharing to improve accuracy, for instance by leveraging spatio-temporal correlations. The challenge is that, when used as input features for forecasting, correlated data complicates the market design with respect to the revenue allocation, as the value of overlapping information is inherently combinatorial. We develop a correlation-aware analytics market for a wind power forecasting application. To allocate revenue, we adopt a Shapley value-based attribution policy, framing the features of agents as players and their interactions as a characteristic function game. We illustrate that there are multiple options to describe such a game, each having causal nuances that influence market behavior when features are cor
&lt;/p&gt;</description></item></channel></rss>