<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21160;&#24577;&#22238;&#24402;&#19981;&#36830;&#32493;&#24615;&#35774;&#35745;&#26041;&#27861;&#65292;&#29992;&#20110;&#30830;&#23450;&#32463;&#27982;&#21487;&#35299;&#37322;&#30340;&#26102;&#38388;&#38388;&#38548;&#22788;&#29702;&#25928;&#24212;&#12290;&#30740;&#31350;&#37319;&#29992;&#20102;&#21160;&#24577;&#28508;&#22312;&#32467;&#26524;&#27169;&#22411;&#65292;&#24182;&#29305;&#21035;&#23545;&#26080;&#39044;&#26399;&#21644;&#20849;&#21516;&#36235;&#21183;&#38480;&#21046;&#36827;&#34892;&#20102;&#22788;&#29702;&#65292;&#20197;&#30830;&#23450;&#25351;&#23450;&#20999;&#28857;&#30340;&#20914;&#20987;&#21453;&#24212;&#12290;&#20272;&#35745;&#37327;&#21487;&#20197;&#36890;&#36807;&#26631;&#20934;&#30340;&#23616;&#37096;&#22810;&#39033;&#24335;&#26041;&#27861;&#36827;&#34892;&#35745;&#31639;&#12290;</title><link>http://arxiv.org/abs/2307.14203</link><description>&lt;p&gt;
&#21160;&#24577;&#22238;&#24402;&#19981;&#36830;&#32493;&#24615;&#65306;&#19968;&#31181;&#20869;&#37096;&#35774;&#35745;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
Dynamic Regression Discontinuity: A Within-Design Approach. (arXiv:2307.14203v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.14203
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21160;&#24577;&#22238;&#24402;&#19981;&#36830;&#32493;&#24615;&#35774;&#35745;&#26041;&#27861;&#65292;&#29992;&#20110;&#30830;&#23450;&#32463;&#27982;&#21487;&#35299;&#37322;&#30340;&#26102;&#38388;&#38388;&#38548;&#22788;&#29702;&#25928;&#24212;&#12290;&#30740;&#31350;&#37319;&#29992;&#20102;&#21160;&#24577;&#28508;&#22312;&#32467;&#26524;&#27169;&#22411;&#65292;&#24182;&#29305;&#21035;&#23545;&#26080;&#39044;&#26399;&#21644;&#20849;&#21516;&#36235;&#21183;&#38480;&#21046;&#36827;&#34892;&#20102;&#22788;&#29702;&#65292;&#20197;&#30830;&#23450;&#25351;&#23450;&#20999;&#28857;&#30340;&#20914;&#20987;&#21453;&#24212;&#12290;&#20272;&#35745;&#37327;&#21487;&#20197;&#36890;&#36807;&#26631;&#20934;&#30340;&#23616;&#37096;&#22810;&#39033;&#24335;&#26041;&#27861;&#36827;&#34892;&#35745;&#31639;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#35770;&#35777;&#26041;&#27861;&#65292;&#29992;&#26469;&#22312;&#21160;&#24577;&#22238;&#24402;&#19981;&#36830;&#32493;&#24615;&#35774;&#35745;&#20013;&#30830;&#23450;&#32463;&#27982;&#21487;&#35299;&#37322;&#30340;&#26102;&#38388;&#38388;&#38548;&#22788;&#29702;&#25928;&#24212;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#25105;&#21457;&#23637;&#20102;&#19968;&#20010;&#21160;&#24577;&#28508;&#22312;&#32467;&#26524;&#27169;&#22411;&#65292;&#24182;&#29305;&#22320;&#23545;&#24046;&#24322;-in-differences&#25991;&#29486;&#20013;&#30340;&#20004;&#20010;&#20551;&#35774;&#36827;&#34892;&#20102;&#19987;&#38376;&#21270;&#22788;&#29702;&#65292;&#21363;&#26080;&#39044;&#26399;&#21644;&#20849;&#21516;&#36235;&#21183;&#38480;&#21046;&#65292;&#20197;&#30830;&#23450;&#25351;&#23450;&#20999;&#28857;&#30340;&#20914;&#20987;&#21453;&#24212;&#12290;&#19982;&#27599;&#20010;&#30446;&#26631;&#21442;&#25968;&#30456;&#20851;&#30340;&#20272;&#35745;&#37327;&#21487;&#20197;&#34920;&#31034;&#20026;&#20004;&#20010;&#38745;&#24577;&#22238;&#24402;&#19981;&#36830;&#32493;&#24615;&#35774;&#35745;&#32467;&#26524;&#23545;&#27604;&#30340;&#21644;&#65292;&#20174;&#32780;&#21487;&#20197;&#36890;&#36807;&#26631;&#20934;&#30340;&#23616;&#37096;&#22810;&#39033;&#24335;&#24037;&#20855;&#36827;&#34892;&#20272;&#35745;&#12290;&#25105;&#21033;&#29992;&#26377;&#38480;&#36335;&#24452;&#29420;&#31435;&#24615;&#20551;&#35774;&#26469;&#38477;&#20302;&#38382;&#39064;&#30340;&#32500;&#24230;&#12290;
&lt;/p&gt;
&lt;p&gt;
I propose a novel argument to point identify economically interpretable intertemporal treatment effects in dynamic regression discontinuity designs (RDDs). Specifically, I develop a dynamic potential outcomes model and specialize two assumptions of the difference-in-differences literature, the no anticipation and common trends restrictions, to point identify cutoff-specific impulse responses. The estimand associated with each target parameter can be expressed as the sum of two static RDD outcome contrasts, thereby allowing for estimation via standard local polynomial tools. I leverage a limited path independence assumption to reduce the dimensionality of the problem.
&lt;/p&gt;</description></item></channel></rss>