<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#26412;&#25991;&#25552;&#20986;&#19968;&#31181;&#31616;&#21333;&#30340;&#26041;&#27861;&#29992;&#20110;&#24179;&#34913;&#22240;&#26524;&#25512;&#26029;&#20013;&#35266;&#23519;&#24615;&#30740;&#31350;&#20013;&#30340;&#21327;&#21464;&#37327;&#20998;&#24067;&#65292;&#36890;&#36807;&#20462;&#25913;&#29109;&#24179;&#34913;&#26041;&#27861;&#21644;&#21327;&#21464;&#37327;&#24179;&#34913;&#20542;&#21521;&#35780;&#20998;&#26041;&#27861;&#23454;&#29616;&#23545;&#22788;&#29702;&#32452;&#21644;&#23545;&#29031;&#32452;&#30340;&#20998;&#24067;&#24179;&#34913;&#12290;</title><link>http://arxiv.org/abs/2310.11969</link><description>&lt;p&gt;
&#35843;&#26597;&#26657;&#20934;&#30340;&#22240;&#26524;&#25512;&#26029;&#26041;&#27861;&#65306;&#19968;&#31181;&#24179;&#34913;&#21327;&#21464;&#37327;&#20998;&#24067;&#30340;&#31616;&#21333;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Survey calibration for causal inference: a simple method to balance covariate distributions. (arXiv:2310.11969v1 [stat.ME])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.11969
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#19968;&#31181;&#31616;&#21333;&#30340;&#26041;&#27861;&#29992;&#20110;&#24179;&#34913;&#22240;&#26524;&#25512;&#26029;&#20013;&#35266;&#23519;&#24615;&#30740;&#31350;&#20013;&#30340;&#21327;&#21464;&#37327;&#20998;&#24067;&#65292;&#36890;&#36807;&#20462;&#25913;&#29109;&#24179;&#34913;&#26041;&#27861;&#21644;&#21327;&#21464;&#37327;&#24179;&#34913;&#20542;&#21521;&#35780;&#20998;&#26041;&#27861;&#23454;&#29616;&#23545;&#22788;&#29702;&#32452;&#21644;&#23545;&#29031;&#32452;&#30340;&#20998;&#24067;&#24179;&#34913;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#35266;&#23519;&#24615;&#30740;&#31350;&#30340;&#22240;&#26524;&#25512;&#26029;&#30340;&#31616;&#21333;&#26041;&#27861;&#65292;&#29992;&#20110;&#24179;&#34913;&#21327;&#21464;&#37327;&#30340;&#20998;&#24067;&#12290;&#35813;&#26041;&#27861;&#21487;&#20197;&#24179;&#34913;&#20219;&#24847;&#25968;&#37327;&#30340;&#20998;&#20301;&#25968;&#65288;&#20363;&#22914;&#20013;&#20301;&#25968;&#12289;&#22235;&#20998;&#20301;&#25968;&#25110;&#21313;&#20998;&#20301;&#25968;&#65289;&#65292;&#22914;&#26524;&#24517;&#35201;&#30340;&#35805;&#36824;&#21487;&#20197;&#24179;&#34913;&#22343;&#20540;&#12290;&#25152;&#25552;&#20986;&#30340;&#26041;&#27861;&#22522;&#20110;&#26657;&#27491;&#20272;&#35745;&#22120;&#30340;&#29702;&#35770;&#65288;Deville&#21644;Sarndal&#65292;1992&#65289;&#65292;&#23588;&#20854;&#26159;Harms&#21644;Duchesne&#65288;2006&#65289;&#25552;&#20986;&#30340;&#20998;&#20301;&#25968;&#26657;&#20934;&#20272;&#35745;&#22120;&#12290;&#36890;&#36807;&#20462;&#25913;&#29109;&#24179;&#34913;&#26041;&#27861;&#21644;&#21327;&#21464;&#37327;&#24179;&#34913;&#20542;&#21521;&#35780;&#20998;&#26041;&#27861;&#65292;&#21487;&#20197;&#24179;&#34913;&#22788;&#29702;&#32452;&#21644;&#23545;&#29031;&#32452;&#30340;&#20998;&#24067;&#12290;&#35813;&#26041;&#27861;&#19981;&#38656;&#35201;&#25968;&#20540;&#31215;&#20998;&#12289;&#26680;&#23494;&#24230;&#20272;&#35745;&#25110;&#23545;&#20998;&#24067;&#30340;&#20219;&#20309;&#20551;&#35774;&#65307;&#21487;&#20197;&#36890;&#36807;&#21033;&#29992;&#29616;&#26377;&#30340;&#28176;&#36817;&#29702;&#35770;&#24471;&#21040;&#26377;&#25928;&#30340;&#20272;&#35745;&#12290;&#27169;&#25311;&#30740;&#31350;&#30340;&#32467;&#26524;&#34920;&#26126;&#65292;&#35813;&#26041;&#27861;&#21487;&#20197;&#26377;&#25928;&#22320;&#20272;&#35745;&#34987;&#22788;&#29702;&#32452;&#30340;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#65288;ATT&#65289;&#12289;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#65288;ATE&#65289;&#21644;&#22788;&#29702;&#32452;&#30340;&#24635;&#22788;&#29702;&#25928;&#24212;&#65288;ATE&#65289;&#31561;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper proposes a simple method for balancing distributions of covariates for causal inference based on observational studies. The method makes it possible to balance an arbitrary number of quantiles (e.g., medians, quartiles, or deciles) together with means if necessary. The proposed approach is based on the theory of calibration estimators (Deville and S\"arndal 1992), in particular, calibration estimators for quantiles, proposed by Harms and Duchesne (2006). By modifying the entropy balancing method and the covariate balancing propensity score method, it is possible to balance the distributions of the treatment and control groups. The method does not require numerical integration, kernel density estimation or assumptions about the distributions; valid estimates can be obtained by drawing on existing asymptotic theory. Results of a simulation study indicate that the method efficiently estimates average treatment effects on the treated (ATT), the average treatment effect (ATE), th
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26426;&#22120;&#23398;&#20064;&#24046;&#24322;-&#24046;&#24322;&#65288;MLDID&#65289;&#26041;&#27861;&#65292;&#32467;&#21512;&#20102;&#20004;&#31181;&#38750;&#21442;&#25968;&#24046;&#24322;-&#24046;&#24322;&#26041;&#27861;&#65292;&#29992;&#20110;&#30740;&#31350;&#38169;&#20301;&#37319;&#29992;&#29615;&#22659;&#20013;&#30340;&#27835;&#30103;&#25928;&#26524;&#24322;&#36136;&#24615;&#12290;&#25105;&#20204;&#36890;&#36807;&#27169;&#25311;&#23454;&#39564;&#35777;&#26126;MLDID&#33021;&#22815;&#20934;&#30830;&#35782;&#21035;&#20986;&#27835;&#30103;&#25928;&#26524;&#24322;&#36136;&#24615;&#30340;&#39044;&#27979;&#22240;&#32032;&#65292;&#24182;&#21033;&#29992;&#35813;&#26041;&#27861;&#35780;&#20272;&#20102;&#24052;&#35199;&#23478;&#24237;&#20581;&#24247;&#35745;&#21010;&#23545;&#23156;&#20799;&#27515;&#20129;&#29575;&#30340;&#24322;&#36136;&#24433;&#21709;&#65292;&#21457;&#29616;&#36139;&#22256;&#20154;&#21475;&#21644;&#22478;&#24066;&#22320;&#21306;&#27604;&#20854;&#20182;&#32676;&#20307;&#26356;&#24555;&#22320;&#21463;&#21040;&#25919;&#31574;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2310.11962</link><description>&lt;p&gt;
&#29992;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#30740;&#31350;&#38169;&#20301;&#24046;&#24322;-&#24046;&#24322;&#21644;&#21160;&#24577;&#27835;&#30103;&#25928;&#26524;&#24322;&#36136;&#24615;
&lt;/p&gt;
&lt;p&gt;
Machine Learning for Staggered Difference-in-Differences and Dynamic Treatment Effect Heterogeneity. (arXiv:2310.11962v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.11962
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26426;&#22120;&#23398;&#20064;&#24046;&#24322;-&#24046;&#24322;&#65288;MLDID&#65289;&#26041;&#27861;&#65292;&#32467;&#21512;&#20102;&#20004;&#31181;&#38750;&#21442;&#25968;&#24046;&#24322;-&#24046;&#24322;&#26041;&#27861;&#65292;&#29992;&#20110;&#30740;&#31350;&#38169;&#20301;&#37319;&#29992;&#29615;&#22659;&#20013;&#30340;&#27835;&#30103;&#25928;&#26524;&#24322;&#36136;&#24615;&#12290;&#25105;&#20204;&#36890;&#36807;&#27169;&#25311;&#23454;&#39564;&#35777;&#26126;MLDID&#33021;&#22815;&#20934;&#30830;&#35782;&#21035;&#20986;&#27835;&#30103;&#25928;&#26524;&#24322;&#36136;&#24615;&#30340;&#39044;&#27979;&#22240;&#32032;&#65292;&#24182;&#21033;&#29992;&#35813;&#26041;&#27861;&#35780;&#20272;&#20102;&#24052;&#35199;&#23478;&#24237;&#20581;&#24247;&#35745;&#21010;&#23545;&#23156;&#20799;&#27515;&#20129;&#29575;&#30340;&#24322;&#36136;&#24433;&#21709;&#65292;&#21457;&#29616;&#36139;&#22256;&#20154;&#21475;&#21644;&#22478;&#24066;&#22320;&#21306;&#27604;&#20854;&#20182;&#32676;&#20307;&#26356;&#24555;&#22320;&#21463;&#21040;&#25919;&#31574;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#32467;&#21512;&#20102;&#20004;&#31181;&#26368;&#36817;&#25552;&#20986;&#30340;&#38750;&#21442;&#25968;&#24046;&#24322;-&#24046;&#24322;&#26041;&#27861;&#65292;&#23558;&#23427;&#20204;&#25193;&#23637;&#21040;&#20351;&#29992;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#22312;&#38169;&#20301;&#37319;&#29992;&#29615;&#22659;&#20013;&#30740;&#31350;&#27835;&#30103;&#25928;&#26524;&#24322;&#36136;&#24615;&#12290;&#25152;&#25552;&#20986;&#30340;&#26041;&#27861;&#65292;&#26426;&#22120;&#23398;&#20064;&#24046;&#24322;-&#24046;&#24322;&#65288;MLDID&#65289;&#65292;&#20801;&#35768;&#20272;&#35745;&#22788;&#29702;&#32452;&#30340;&#26102;&#21464;&#26465;&#20214;&#24179;&#22343;&#27835;&#30103;&#25928;&#24212;&#65292;&#20174;&#32780;&#21487;&#20197;&#23545;&#27835;&#30103;&#25928;&#26524;&#24322;&#36136;&#24615;&#30340;&#39537;&#21160;&#22240;&#32032;&#36827;&#34892;&#35814;&#32454;&#25512;&#26029;&#12290;&#25105;&#20204;&#36827;&#34892;&#27169;&#25311;&#23454;&#39564;&#26469;&#35780;&#20272;MLDID&#30340;&#24615;&#33021;&#65292;&#24182;&#21457;&#29616;&#23427;&#33021;&#20934;&#30830;&#35782;&#21035;&#20986;&#27835;&#30103;&#25928;&#26524;&#24322;&#36136;&#24615;&#30340;&#30495;&#23454;&#39044;&#27979;&#22240;&#32032;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#20351;&#29992;MLDID&#26469;&#35780;&#20272;&#24052;&#35199;&#23478;&#24237;&#20581;&#24247;&#35745;&#21010;&#23545;&#23156;&#20799;&#27515;&#20129;&#29575;&#30340;&#24322;&#36136;&#24433;&#21709;&#65292;&#24182;&#21457;&#29616;&#36139;&#22256;&#20154;&#21475;&#21644;&#22478;&#24066;&#22320;&#21306;&#27604;&#20854;&#20182;&#23376;&#32676;&#20307;&#26356;&#24555;&#22320;&#21463;&#21040;&#25919;&#31574;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
We combine two recently proposed nonparametric difference-in-differences methods, extending them to enable the examination of treatment effect heterogeneity in the staggered adoption setting using machine learning. The proposed method, machine learning difference-in-differences (MLDID), allows for estimation of time-varying conditional average treatment effects on the treated, which can be used to conduct detailed inference on drivers of treatment effect heterogeneity. We perform simulations to evaluate the performance of MLDID and find that it accurately identifies the true predictors of treatment effect heterogeneity. We then use MLDID to evaluate the heterogeneous impacts of Brazil's Family Health Program on infant mortality, and find those in poverty and urban locations experienced the impact of the policy more quickly than other subgroups.
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#38899;&#20048;&#27969;&#23186;&#20307;&#24179;&#21488;&#19978;&#22914;&#20309;&#20998;&#20139;&#35746;&#38405;&#36153;&#29992;&#30340;&#38382;&#39064;&#12290;&#20316;&#32773;&#25552;&#20379;&#20102;&#27604;&#20363;&#20998;&#25104;&#21644;&#20197;&#29992;&#25143;&#20026;&#20013;&#24515;&#30340;&#20998;&#25104;&#20004;&#31181;&#26041;&#27861;&#30340;&#22522;&#30784;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31995;&#21015;&#25240;&#20013;&#26041;&#27861;&#65292;&#20197;&#26356;&#22909;&#22320;&#21327;&#35843;&#33402;&#26415;&#23478;&#12289;&#31881;&#19997;&#21644;&#27969;&#23186;&#20307;&#26381;&#21153;&#30340;&#21033;&#30410;&#12290;</title><link>http://arxiv.org/abs/2310.11861</link><description>&lt;p&gt;
&#38899;&#20048;&#27969;&#23186;&#20307;&#24179;&#21488;&#19978;&#30340;&#20998;&#25104;&#38382;&#39064;
&lt;/p&gt;
&lt;p&gt;
Revenue sharing at music streaming platforms. (arXiv:2310.11861v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.11861
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#38899;&#20048;&#27969;&#23186;&#20307;&#24179;&#21488;&#19978;&#22914;&#20309;&#20998;&#20139;&#35746;&#38405;&#36153;&#29992;&#30340;&#38382;&#39064;&#12290;&#20316;&#32773;&#25552;&#20379;&#20102;&#27604;&#20363;&#20998;&#25104;&#21644;&#20197;&#29992;&#25143;&#20026;&#20013;&#24515;&#30340;&#20998;&#25104;&#20004;&#31181;&#26041;&#27861;&#30340;&#22522;&#30784;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31995;&#21015;&#25240;&#20013;&#26041;&#27861;&#65292;&#20197;&#26356;&#22909;&#22320;&#21327;&#35843;&#33402;&#26415;&#23478;&#12289;&#31881;&#19997;&#21644;&#27969;&#23186;&#20307;&#26381;&#21153;&#30340;&#21033;&#30410;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#22312;&#38899;&#20048;&#27969;&#23186;&#20307;&#24179;&#21488;&#19978;&#20998;&#20139;&#35746;&#38405;&#36153;&#29992;&#30340;&#38382;&#39064;&#65292;&#20854;&#20013;&#21253;&#25324;&#30452;&#25509;&#12289;&#20844;&#29702;&#21644;&#21338;&#24328;&#35770;&#22522;&#30784;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#20004;&#31181;&#22312;&#23454;&#36341;&#20013;&#24191;&#27867;&#20351;&#29992;&#30340;&#26041;&#27861;&#30340;&#22522;&#30784;&#65306;&#27604;&#20363;&#20998;&#25104;&#21644;&#20197;&#29992;&#25143;&#20026;&#20013;&#24515;&#30340;&#20998;&#25104;&#12290;&#21069;&#32773;&#26681;&#25454;&#33402;&#26415;&#23478;&#30340;&#24635;&#25773;&#25918;&#27425;&#25968;&#26469;&#22870;&#21169;&#20182;&#20204;&#12290;&#21518;&#32773;&#25353;&#29031;&#29992;&#25143;&#25152;&#25773;&#25918;&#30340;&#33402;&#26415;&#23478;&#26469;&#23558;&#29992;&#25143;&#30340;&#35746;&#38405;&#36153;&#24179;&#22343;&#20998;&#37197;&#32473;&#33402;&#26415;&#23478;&#12290;&#25105;&#20204;&#36824;&#25552;&#20379;&#20102;&#19968;&#31995;&#21015;&#26041;&#27861;&#30340;&#22522;&#30784;&#65292;&#36825;&#20123;&#26041;&#27861;&#22312;&#21069;&#20004;&#31181;&#26041;&#27861;&#20043;&#38388;&#36827;&#34892;&#26435;&#34913;&#65292;&#35299;&#20915;&#20102;&#38899;&#20048;&#34892;&#19994;&#23545;&#25506;&#32034;&#26356;&#22909;&#22320;&#21327;&#35843;&#33402;&#26415;&#23478;&#12289;&#31881;&#19997;&#21644;&#27969;&#23186;&#20307;&#26381;&#21153;&#21033;&#30410;&#30340;&#26032;&#27969;&#23186;&#20307;&#27169;&#22411;&#30340;&#20851;&#20999;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study the problem of sharing the revenues raised from subscriptions to music streaming platforms among content providers. We provide direct, axiomatic and game-theoretical foundations for two focal (and somewhat polar) methods widely used in practice: pro-rata and user-centric. The former rewards artists proportionally to their number of total streams. With the latter, each user's subscription fee is proportionally divided among the artists streamed by that user. We also provide foundations for a family of methods compromising among the previous two, which addresses the rising concern in the music industry to explore new streaming models that better align the interests of artists, fans and streaming services.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#22312;&#30456;&#20851;&#24322;&#36136;&#24615;&#19979;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#20462;&#21098;&#22343;&#20540;&#32452;&#65288;TMG&#65289;&#20272;&#35745;&#22120;&#65292;&#21487;&#20197;&#22312;&#38754;&#26495;&#25968;&#25454;&#26102;&#38388;&#32500;&#24230;&#24456;&#23567;&#30340;&#24773;&#20917;&#19979;&#20197;&#19981;&#35268;&#21017;&#30340;&#36895;&#24230;&#20445;&#25345;&#19968;&#33268;&#24615;&#12290;&#35813;&#26041;&#27861;&#20855;&#26377;&#36739;&#22909;&#30340;&#24615;&#36136;&#21644;&#24615;&#33021;&#65292;&#24182;&#25552;&#20379;&#20102;&#30456;&#20851;&#24322;&#36136;&#24615;&#30340;&#26816;&#39564;&#26041;&#27861;&#12290;&#36890;&#36807;&#23454;&#35777;&#24212;&#29992;&#23637;&#31034;&#20102;&#35813;&#26041;&#27861;&#30340;&#23454;&#29992;&#24615;&#12290;</title><link>http://arxiv.org/abs/2310.11680</link><description>&lt;p&gt;
&#22312;&#30456;&#20851;&#24322;&#36136;&#24615;&#19979;&#65292;&#30701;&#26399;&#38754;&#26495;&#20013;&#20851;&#20110;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#30340;&#20462;&#21098;&#22343;&#20540;&#32452;&#20272;&#35745;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Trimmed Mean Group Estimation of Average Treatment Effects in Ultra Short T Panels under Correlated Heterogeneity. (arXiv:2310.11680v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.11680
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#22312;&#30456;&#20851;&#24322;&#36136;&#24615;&#19979;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#20462;&#21098;&#22343;&#20540;&#32452;&#65288;TMG&#65289;&#20272;&#35745;&#22120;&#65292;&#21487;&#20197;&#22312;&#38754;&#26495;&#25968;&#25454;&#26102;&#38388;&#32500;&#24230;&#24456;&#23567;&#30340;&#24773;&#20917;&#19979;&#20197;&#19981;&#35268;&#21017;&#30340;&#36895;&#24230;&#20445;&#25345;&#19968;&#33268;&#24615;&#12290;&#35813;&#26041;&#27861;&#20855;&#26377;&#36739;&#22909;&#30340;&#24615;&#36136;&#21644;&#24615;&#33021;&#65292;&#24182;&#25552;&#20379;&#20102;&#30456;&#20851;&#24322;&#36136;&#24615;&#30340;&#26816;&#39564;&#26041;&#27861;&#12290;&#36890;&#36807;&#23454;&#35777;&#24212;&#29992;&#23637;&#31034;&#20102;&#35813;&#26041;&#27861;&#30340;&#23454;&#29992;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#30456;&#20851;&#24322;&#36136;&#24615;&#19979;&#65292;&#24120;&#29992;&#30340;&#20004;&#36335;&#22266;&#23450;&#25928;&#24212;&#20272;&#35745;&#26041;&#27861;&#23384;&#22312;&#20559;&#24046;&#24182;&#21487;&#33021;&#23548;&#33268;&#35823;&#23548;&#24615;&#25512;&#26029;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#20462;&#21098;&#22343;&#20540;&#32452;&#20272;&#35745;&#22120;&#65288;TMG estimator&#65289;&#65292;&#21363;&#20351;&#38754;&#26495;&#30340;&#26102;&#38388;&#32500;&#24230;&#19982;&#22238;&#24402;&#21464;&#37327;&#25968;&#30446;&#19968;&#26679;&#23567;&#65292;&#20063;&#33021;&#20197;&#19981;&#35268;&#21017;&#30340;n^{1/3}&#36895;&#24230;&#20445;&#25345;&#19968;&#33268;&#24615;&#12290;&#26412;&#25991;&#36824;&#25552;&#20379;&#20102;&#36866;&#29992;&#20110;&#20855;&#26377;&#26102;&#38388;&#25928;&#24212;&#30340;&#38754;&#26495;&#30340;&#25193;&#23637;&#26041;&#27861;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#30456;&#20851;&#24322;&#36136;&#24615;&#30340;&#35946;&#26031;&#26364;&#24335;&#26816;&#39564;&#12290;&#36890;&#36807;&#33945;&#29305;&#21345;&#27931;&#23454;&#39564;&#65292;&#30740;&#31350;&#20102;TMG&#20272;&#35745;&#22120;&#65288;&#24102;&#26377;&#21644;&#19981;&#24102;&#26377;&#26102;&#38388;&#25928;&#24212;&#65289;&#22312;&#23567;&#26679;&#26412;&#24773;&#20917;&#19979;&#30340;&#24615;&#36136;&#65292;&#32467;&#26524;&#34920;&#26126;&#20854;&#24615;&#33021;&#20196;&#20154;&#28385;&#24847;&#65292;&#20248;&#20110;&#25991;&#29486;&#20013;&#25552;&#20986;&#30340;&#20854;&#20182;&#20462;&#21098;&#20272;&#35745;&#22120;&#12290;&#21516;&#26102;&#65292;&#25152;&#25552;&#20986;&#30340;&#30456;&#20851;&#24322;&#36136;&#24615;&#26816;&#39564;&#26174;&#31034;&#20986;&#27491;&#30830;&#30340;&#22823;&#23567;&#21644;&#20196;&#20154;&#28385;&#24847;&#30340;&#21151;&#25928;&#12290;&#36890;&#36807;&#23454;&#35777;&#24212;&#29992;&#65292;&#23637;&#31034;&#20102;TMG&#26041;&#27861;&#30340;&#23454;&#29992;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Under correlated heterogeneity, the commonly used two-way fixed effects estimator is biased and can lead to misleading inference. This paper proposes a new trimmed mean group (TMG) estimator which is consistent at the irregular rate of n^{1/3} even if the time dimension of the panel is as small as the number of its regressors. Extensions to panels with time effects are provided, and a Hausman-type test of correlated heterogeneity is proposed. Small sample properties of the TMG estimator (with and without time effects) are investigated by Monte Carlo experiments and shown to be satisfactory and perform better than other trimmed estimators proposed in the literature. The proposed test of correlated heterogeneity is also shown to have the correct size and satisfactory power. The utility of the TMG approach is illustrated with an empirical application.
&lt;/p&gt;</description></item><item><title>&#20840;&#29699;&#22240;&#32032;&#23545;&#21457;&#36798;&#32463;&#27982;&#20307;&#38134;&#34892;&#20307;&#31995;&#20013;&#38750;&#26680;&#24515;&#19982;&#26680;&#24515;&#36164;&#37329;&#27604;&#29575;&#30340;&#27874;&#21160;&#36215;&#20027;&#23548;&#20316;&#29992;&#65292;&#27719;&#29575;&#28789;&#27963;&#24615;&#33021;&#22815;&#22312;2008-2009&#24180;&#20197;&#22806;&#30340;&#26102;&#26399;&#20943;&#23567;&#36825;&#31181;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2310.11552</link><description>&lt;p&gt;
&#38750;&#26680;&#24515;&#38134;&#34892;&#36164;&#37329;&#21644;&#27719;&#29575;&#28789;&#27963;&#24615;&#20013;&#30340;&#20840;&#29699;&#22240;&#32032;
&lt;/p&gt;
&lt;p&gt;
Global Factors in Non-core Bank Funding and Exchange Rate Flexibility. (arXiv:2310.11552v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.11552
&lt;/p&gt;
&lt;p&gt;
&#20840;&#29699;&#22240;&#32032;&#23545;&#21457;&#36798;&#32463;&#27982;&#20307;&#38134;&#34892;&#20307;&#31995;&#20013;&#38750;&#26680;&#24515;&#19982;&#26680;&#24515;&#36164;&#37329;&#27604;&#29575;&#30340;&#27874;&#21160;&#36215;&#20027;&#23548;&#20316;&#29992;&#65292;&#27719;&#29575;&#28789;&#27963;&#24615;&#33021;&#22815;&#22312;2008-2009&#24180;&#20197;&#22806;&#30340;&#26102;&#26399;&#20943;&#23567;&#36825;&#31181;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#23637;&#31034;&#20102;&#21457;&#36798;&#32463;&#27982;&#20307;&#38134;&#34892;&#20307;&#31995;&#20013;&#38750;&#26680;&#24515;&#19982;&#26680;&#24515;&#36164;&#37329;&#27604;&#29575;&#30340;&#27874;&#21160;&#30001;&#23569;&#25968;&#20960;&#20010;&#26082;&#26377;&#23454;&#29289;&#24615;&#21448;&#26377;&#37329;&#34701;&#24615;&#36136;&#30340;&#20840;&#29699;&#22240;&#32032;&#39537;&#21160;&#65292;&#22269;&#23478;&#29305;&#23450;&#22240;&#32032;&#27809;&#26377;&#21457;&#25381;&#37325;&#35201;&#20316;&#29992;&#12290;&#27719;&#29575;&#28789;&#27963;&#24615;&#26377;&#21161;&#20110;&#20943;&#23567;&#38750;&#26680;&#24515;&#19982;&#26680;&#24515;&#27604;&#29575;&#21463;&#21040;&#20840;&#29699;&#22240;&#32032;&#30340;&#24433;&#21709;&#65292;&#20294;&#20165;&#22312;&#37325;&#22823;&#20840;&#29699;&#37329;&#34701;&#38663;&#33633;&#26399;&#38388;&#65288;&#22914;2008-2009&#24180;&#65289;&#26126;&#26174;&#36215;&#20316;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;
We show that fluctuations in the ratio of non-core to core funding in the banking systems of advanced economies are driven by a handful of global factors of both real and financial natures, with country-specific factors playing no significant roles. Exchange rate flexibility helps insulate the non-core to core ratio from such global factors but only significantly so outside periods of major global financial disruptions, as in 2008-2009.
&lt;/p&gt;</description></item><item><title>&#36890;&#36807;&#34701;&#21512;Rawlsian&#29702;&#35770;&#21644;&#31639;&#27861;&#25163;&#27573;&#65292;&#26412;&#25991;&#30740;&#31350;&#20102;&#27700;&#36164;&#28304;&#20998;&#37197;&#20013;&#30340;&#20844;&#24179;&#24615;&#38382;&#39064;&#12290;&#34507;&#31957;&#20999;&#21106;&#27169;&#22411;&#22312;&#32771;&#34385;&#25112;&#30053;&#22240;&#32032;&#30340;&#21516;&#26102;&#65292;&#23547;&#25214;&#19982;Rawlsian&#20844;&#24179;&#21407;&#21017;&#30456;&#19968;&#33268;&#30340;&#35299;&#20915;&#26041;&#26696;&#65292;&#20026;&#35299;&#20915;&#23612;&#32599;&#27827;&#27700;&#36164;&#28304;&#20105;&#31471;&#25552;&#20379;&#20102;&#26377;&#20215;&#20540;&#30340;&#26041;&#27861;&#12290;</title><link>http://arxiv.org/abs/2310.11472</link><description>&lt;p&gt;
&#23612;&#32599;&#27827;&#19978;&#30340;&#28023;&#32501;&#34507;&#31957;&#22256;&#22659;&#65306;&#36890;&#36807;Rawlsian&#29702;&#35770;&#21644;&#31639;&#27861;&#23454;&#29616;&#36164;&#28304;&#20998;&#37197;&#30340;&#20844;&#24179;&#24615;
&lt;/p&gt;
&lt;p&gt;
The Sponge Cake Dilemma over the Nile: Achieving Fairness in Resource Allocation through Rawlsian Theory and Algorithms. (arXiv:2310.11472v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.11472
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#34701;&#21512;Rawlsian&#29702;&#35770;&#21644;&#31639;&#27861;&#25163;&#27573;&#65292;&#26412;&#25991;&#30740;&#31350;&#20102;&#27700;&#36164;&#28304;&#20998;&#37197;&#20013;&#30340;&#20844;&#24179;&#24615;&#38382;&#39064;&#12290;&#34507;&#31957;&#20999;&#21106;&#27169;&#22411;&#22312;&#32771;&#34385;&#25112;&#30053;&#22240;&#32032;&#30340;&#21516;&#26102;&#65292;&#23547;&#25214;&#19982;Rawlsian&#20844;&#24179;&#21407;&#21017;&#30456;&#19968;&#33268;&#30340;&#35299;&#20915;&#26041;&#26696;&#65292;&#20026;&#35299;&#20915;&#23612;&#32599;&#27827;&#27700;&#36164;&#28304;&#20105;&#31471;&#25552;&#20379;&#20102;&#26377;&#20215;&#20540;&#30340;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36890;&#36807;&#25972;&#21512;&#35268;&#33539;&#21644;&#23454;&#35777;&#30340;&#35270;&#35282;&#65292;&#30740;&#31350;&#20102;&#27700;&#36164;&#28304;&#20105;&#31471;&#12290;&#32422;&#32752;&#183;&#32599;&#23572;&#26031;&#30340;&#27491;&#20041;&#29702;&#35770;&#25552;&#20379;&#20102;&#36947;&#24503;&#25351;&#23548;&#65292;&#32500;&#25252;&#25152;&#26377;&#27969;&#22495;&#22269;&#23478;&#30340;&#21512;&#29702;&#33719;&#21462;&#26435;&#21033;&#12290;&#28982;&#32780;&#65292;&#36890;&#36807;&#34507;&#31957;&#20999;&#21106;&#27169;&#22411;&#36827;&#34892;&#23454;&#35777;&#20998;&#26512;&#25581;&#31034;&#20102;&#29616;&#23454;&#19990;&#30028;&#20013;&#30340;&#25112;&#30053;&#32422;&#26463;&#12290;&#34429;&#28982;&#32599;&#23572;&#26031;&#23450;&#20041;&#20102;&#26399;&#26395;&#30340;&#30446;&#26631;&#65292;&#20294;&#34507;&#31957;&#20999;&#21106;&#25552;&#20379;&#20102;&#22522;&#20110;&#23454;&#38469;&#34892;&#20026;&#30340;&#31639;&#27861;&#25163;&#27573;&#12290;&#23612;&#32599;&#27827;&#27969;&#22495;&#20105;&#31471;&#35828;&#26126;&#20102;&#36825;&#31181;&#32508;&#21512;&#12290;&#32599;&#23572;&#26031;&#35748;&#20026;&#27700;&#36164;&#28304;&#20855;&#26377;&#22825;&#28982;&#26435;&#21033;&#65292;&#20294;&#26080;&#38480;&#21046;&#30340;&#31454;&#20105;&#21487;&#33021;&#23548;&#33268;&#22404;&#26029;&#12290;&#22312;&#33258;&#21033;&#31561;&#23616;&#38480;&#24615;&#23384;&#22312;&#30340;&#24773;&#20917;&#19979;&#65292;&#20182;&#30340;&#21407;&#21017;&#26412;&#36523;&#26080;&#27861;&#38450;&#27490;&#19981;&#21033;&#30340;&#32467;&#26524;&#12290;&#36825;&#23601;&#26159;&#34507;&#31957;&#20999;&#21106;&#22312;&#23384;&#22312;&#20559;&#35265;&#20027;&#24352;&#30340;&#24773;&#20917;&#19979;&#25552;&#20379;&#20215;&#20540;&#30340;&#22320;&#26041;&#12290;&#20854;&#27169;&#22411;&#30830;&#23450;&#20102;&#19982;&#32599;&#23572;&#26031;&#20844;&#24179;&#21407;&#21017;&#30456;&#31526;&#30340;&#23433;&#25490;&#65292;&#24182;&#32435;&#20837;&#20102;&#25112;&#30053;&#32771;&#34385;&#12290;&#26412;&#25991;&#35814;&#32454;&#20171;&#32461;&#20102;&#34507;&#31957;&#20999;&#21106;&#29702;&#35770;&#65292;&#22238;&#39038;&#20102;&#27700;&#36164;&#28304;&#20914;&#31361;&#25991;&#29486;&#65292;&#30740;&#31350;&#20102;&#23612;&#32599;&#27827;&#26696;&#20363;&#65292;&#25506;&#35752;&#20102;&#21512;&#20316;&#19982;&#38750;&#21512;&#20316;&#30340;&#24773;&#20917;&#12290;
&lt;/p&gt;
&lt;p&gt;
This article examines water disputes through an integrated framework combining normative and positive perspectives. John Rawls' theory of justice provides moral guidance, upholding rights to reasonable access for all riparian states. However, positive analysis using cake-cutting models reveals real-world strategic constraints. While Rawls defines desired ends, cake-cutting offers algorithmic means grounded in actual behaviors. The Nile River basin dispute illustrates this synthesis. Rawls suggests inherent rights to water, but unrestricted competition could enable monopoly. His principles alone cannot prevent unfavorable outcomes, given limitations like self-interest. This is where cake-cutting provides value despite biased claims. Its models identify arrangements aligning with Rawlsian fairness while incorporating strategic considerations. The article details the cake-cutting theory, reviews water conflicts literature, examines the Nile case, explores cooperative vs. non-cooperative g
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#35752;&#35770;&#20102;&#31185;&#23398;&#30740;&#31350;&#21644;&#31454;&#20105;&#32972;&#26223;&#19979;&#21331;&#36234;&#30340;&#27010;&#24565;&#12290;</title><link>http://arxiv.org/abs/2310.09588</link><description>&lt;p&gt;
"&#20851;&#20110;&#31185;&#23398;&#21331;&#36234;&#19982;&#31454;&#20105;&#30340;&#35770;&#25991;"
&lt;/p&gt;
&lt;p&gt;
\"Uber wissenschaftliche Exzellenz und Wettbewerb. (arXiv:2310.09588v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.09588
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#35752;&#35770;&#20102;&#31185;&#23398;&#30740;&#31350;&#21644;&#31454;&#20105;&#32972;&#26223;&#19979;&#21331;&#36234;&#30340;&#27010;&#24565;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36861;&#27714;&#21331;&#36234;&#20284;&#20046;&#26159;&#23398;&#26415;&#30028;&#30340;&#30495;&#27491;&#30446;&#26631;&#12290;&#21331;&#36234;&#26159;&#20160;&#20040;&#24847;&#24605;&#65311;&#33021;&#21542;&#34913;&#37327;&#21331;&#36234;&#65311;&#26412;&#25991;&#35752;&#35770;&#20102;&#22312;&#30740;&#31350;&#21644;&#31454;&#20105;&#30340;&#32972;&#26223;&#19979;&#21331;&#36234;&#30340;&#27010;&#24565;&#12290;
&lt;/p&gt;
&lt;p&gt;
The pursuit of excellence seems to be the True North of academia. What is meant by excellence? Can excellence be measured? This article discusses the concept of excellence in the context of research and competition.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#37325;&#26032;&#32771;&#34385;&#20102;&#37096;&#20998;&#35782;&#21035;&#27169;&#22411;&#20272;&#35745;&#20013;&#30340;&#26368;&#20248;&#24615;&#27010;&#24565;&#65292;&#24182;&#25552;&#20986;&#20102;&#22312;&#25152;&#26377;&#35774;&#35745;&#20013;&#25910;&#25947;&#20110;&#35782;&#21035;&#21306;&#22495;&#30340;&#26367;&#20195;&#26041;&#27861;&#12290;</title><link>http://arxiv.org/abs/2310.02414</link><description>&lt;p&gt;
&#20851;&#20110;&#37096;&#20998;&#35782;&#21035;&#20108;&#39033;&#36873;&#25321;&#27169;&#22411;&#30340;&#26368;&#20248;&#38598;&#20272;&#35745;
&lt;/p&gt;
&lt;p&gt;
On Optimal Set Estimation for Partially Identified Binary Choice Models. (arXiv:2310.02414v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.02414
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#37325;&#26032;&#32771;&#34385;&#20102;&#37096;&#20998;&#35782;&#21035;&#27169;&#22411;&#20272;&#35745;&#20013;&#30340;&#26368;&#20248;&#24615;&#27010;&#24565;&#65292;&#24182;&#25552;&#20986;&#20102;&#22312;&#25152;&#26377;&#35774;&#35745;&#20013;&#25910;&#25947;&#20110;&#35782;&#21035;&#21306;&#22495;&#30340;&#26367;&#20195;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#37325;&#26032;&#32771;&#34385;&#20102;&#37096;&#20998;&#35782;&#21035;&#27169;&#22411;&#20272;&#35745;&#20013;&#30340;&#26368;&#20248;&#24615;&#27010;&#24565;&#12290;&#25105;&#20204;&#20197;&#21322;&#21442;&#25968;&#20108;&#39033;&#36873;&#25321;&#27169;&#22411;&#20026;&#20363;&#65292;&#20197;&#31163;&#25955;&#21327;&#21464;&#37327;&#20316;&#20026;&#31034;&#20363;&#65292;&#35828;&#26126;&#20102;&#19968;&#33324;&#38382;&#39064;&#12290;&#35813;&#27169;&#22411;&#22312;&#19968;&#23450;&#31243;&#24230;&#19978;&#26159;&#37096;&#20998;&#35782;&#21035;&#30340;&#65292;&#20363;&#22914;Bierens&#21644;Hartog&#65288;1988&#65289;&#25152;&#31034;&#12290;&#36890;&#36807;&#23454;&#26045;Manski&#65288;1975&#65289;&#25552;&#20986;&#30340;&#26368;&#22823;&#20998;&#25968;&#31243;&#24207;&#65292;&#21487;&#20197;&#26500;&#24314;&#27169;&#22411;&#20013;&#22238;&#24402;&#31995;&#25968;&#30340;&#38598;&#21512;&#20272;&#35745;&#12290;&#23545;&#20110;&#35768;&#22810;&#35774;&#35745;&#65292;&#35813;&#26041;&#27861;&#25910;&#25947;&#20110;&#36825;&#20123;&#21442;&#25968;&#30340;&#35782;&#21035;&#38598;&#65292;&#22240;&#27492;&#22312;&#26576;&#31181;&#24847;&#20041;&#19978;&#26159;&#26368;&#20248;&#30340;&#12290;&#20294;&#26159;&#65292;&#27491;&#22914;Komarova&#65288;2013&#65289;&#25152;&#31034;&#65292;&#23545;&#20110;&#20854;&#20182;&#24773;&#20917;&#65292;&#26368;&#22823;&#20998;&#25968;&#30446;&#26631;&#20989;&#25968;&#32473;&#20986;&#20102;&#35782;&#21035;&#38598;&#30340;&#36793;&#30028;&#21306;&#22495;&#12290;&#36825;&#28608;&#21457;&#20102;&#23547;&#27714;&#20854;&#20182;&#20248;&#21270;&#26041;&#27861;&#30340;&#21160;&#21147;&#65292;&#36825;&#20123;&#26041;&#27861;&#22312;&#25152;&#26377;&#35774;&#35745;&#20013;&#37117;&#25910;&#25947;&#20110;&#35782;&#21035;&#21306;&#22495;&#65292;&#24182;&#19988;&#25105;&#20204;&#25552;&#20986;&#24182;&#27604;&#36739;&#20102;&#36825;&#20123;&#26041;&#27861;&#12290;&#19968;&#20010;&#26159;Hodges&#31867;&#22411;&#30340;&#20272;&#35745;&#22120;&#65292;&#23558;&#26368;&#22823;&#20998;&#25968;&#20272;&#35745;&#22120;&#19982;&#29616;&#26377;&#31243;&#24207;&#30456;&#32467;&#21512;&#12290;&#31532;&#20108;&#20010;&#26159;&#20004;&#27493;&#27861;
&lt;/p&gt;
&lt;p&gt;
In this paper we reconsider the notion of optimality in estimation of partially identified models. We illustrate the general problem in the context of a semiparametric binary choice model with discrete covariates as an example of a model which is partially identified as shown in, e.g. Bierens and Hartog (1988). A set estimator for the regression coefficients in the model can be constructed by implementing the Maximum Score procedure proposed by Manski (1975). For many designs this procedure converges to the identified set for these parameters, and so in one sense is optimal. But as shown in Komarova (2013) for other cases the Maximum Score objective function gives an outer region of the identified set. This motivates alternative methods that are optimal in one sense that they converge to the identified region in all designs, and we propose and compare such procedures. One is a Hodges type estimator combining the Maximum Score estimator with existing procedures. A second is a two step e
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#22522;&#20110;&#21333;&#22240;&#32032;&#39532;&#23572;&#21487;&#22827;&#26694;&#26550;&#30340;&#22810;&#26399;&#27431;&#24335;&#26399;&#26435;&#30340;&#38745;&#24577;&#23545;&#20914;&#65292;&#24182;&#23545;&#30456;&#23545;&#24615;&#33021;&#36827;&#34892;&#20102;&#23454;&#39564;&#27604;&#36739;&#12290;</title><link>http://arxiv.org/abs/2310.01104</link><description>&lt;p&gt;
&#22810;&#26399;&#27431;&#24335;&#26399;&#26435;&#30340;&#38745;&#24577;&#23545;&#20914;
&lt;/p&gt;
&lt;p&gt;
Multi-period static hedging of European options. (arXiv:2310.01104v1 [q-fin.MF])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.01104
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22522;&#20110;&#21333;&#22240;&#32032;&#39532;&#23572;&#21487;&#22827;&#26694;&#26550;&#30340;&#22810;&#26399;&#27431;&#24335;&#26399;&#26435;&#30340;&#38745;&#24577;&#23545;&#20914;&#65292;&#24182;&#23545;&#30456;&#23545;&#24615;&#33021;&#36827;&#34892;&#20102;&#23454;&#39564;&#27604;&#36739;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#32771;&#34385;&#20102;&#22312;&#22522;&#30784;&#36164;&#20135;&#20215;&#26684;&#36981;&#24490;&#21333;&#22240;&#32032;&#39532;&#23572;&#21487;&#22827;&#26694;&#26550;&#30340;&#24773;&#20917;&#19979;&#23545;&#27431;&#24335;&#26399;&#26435;&#36827;&#34892;&#23545;&#20914;&#12290;Carr&#21644;Wu [1]&#22312;&#36825;&#26679;&#30340;&#35774;&#32622;&#19979;&#65292;&#23548;&#20986;&#20102;&#32473;&#23450;&#26399;&#26435;&#19982;&#22312;&#21516;&#19968;&#36164;&#20135;&#19978;&#20889;&#30340;&#19968;&#31995;&#21015;&#36739;&#30701;&#26399;&#38480;&#26399;&#26435;&#20043;&#38388;&#30340;&#36328;&#24230;&#20851;&#31995;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#23558;&#20182;&#20204;&#30340;&#26041;&#27861;&#25193;&#23637;&#21040;&#21516;&#26102;&#21253;&#25324;&#22810;&#20010;&#30701;&#26399;&#21040;&#26399;&#30340;&#26399;&#26435;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#20351;&#29992;&#39640;&#26031;&#27714;&#31215;&#26041;&#27861;&#36890;&#36807;&#26377;&#38480;&#30340;&#19968;&#32452;&#30701;&#26399;&#26399;&#26435;&#30830;&#23450;&#23545;&#20914;&#35823;&#24046;&#30340;&#23454;&#38469;&#23454;&#29616;&#12290;&#25105;&#20204;&#23545;\textit{Black-Scholes}&#21644;\textit{Merton Jump Diffusion}&#27169;&#22411;&#36827;&#34892;&#20102;&#24191;&#27867;&#30340;&#23454;&#39564;&#65292;&#23637;&#31034;&#20102;&#36825;&#20004;&#31181;&#26041;&#27861;&#30340;&#27604;&#36739;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;
We consider the hedging of European options when the price of the underlying asset follows a single-factor Markovian framework. By working in such a setting, Carr and Wu \cite{carr2014static} derived a spanning relation between a given option and a continuum of shorter-term options written on the same asset. In this paper, we have extended their approach to simultaneously include options over multiple short maturities. We then show a practical implementation of this with a finite set of shorter-term options to determine the hedging error using a Gaussian Quadrature method. We perform a wide range of experiments for both the \textit{Black-Scholes} and \textit{Merton Jump Diffusion} models, illustrating the comparative performance of the two methods.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#37325;&#26032;&#35780;&#20272;&#20102;&#20351;&#29992;&#32447;&#24615;&#27169;&#22411;&#26469;&#36817;&#20284;&#20108;&#20803;&#32467;&#26524;&#30340;&#21709;&#24212;&#27010;&#29575;&#30340;&#37096;&#20998;&#25928;&#24212;&#30340;&#21033;&#24330;&#65292;&#24182;&#37325;&#28857;&#30740;&#31350;&#20102;&#24179;&#22343;&#37096;&#20998;&#25928;&#24212;&#32780;&#19981;&#26159;&#24213;&#23618;&#32447;&#24615;&#25351;&#25968;&#30340;&#21442;&#25968;&#12290;&#36890;&#36807;&#27169;&#25311;&#23454;&#39564;&#65292;&#21457;&#29616;OLS&#36817;&#20284;&#25110;&#19981;&#36817;&#20284;APE&#30340;&#21508;&#31181;&#24773;&#20917;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#23454;&#29992;&#30340;&#26041;&#27861;&#26469;&#20943;&#23569;OLS&#30340;&#26377;&#38480;&#26679;&#26412;&#20559;&#24046;&#65292;&#32467;&#26524;&#34920;&#26126;&#35813;&#26041;&#27861;&#19982;&#38750;&#32447;&#24615;&#26368;&#23567;&#20108;&#20056;&#65288;NLS&#65289;&#20272;&#35745;&#25968;&#20540;&#19978;&#30456;&#31561;&#12290;</title><link>http://arxiv.org/abs/2308.15338</link><description>&lt;p&gt;
&#23545;&#32447;&#24615;&#27010;&#29575;&#27169;&#22411;&#21644;&#38750;&#32447;&#24615;&#25351;&#25968;&#27169;&#22411;&#30340;&#20877;&#24605;&#32771;
&lt;/p&gt;
&lt;p&gt;
Another Look at the Linear Probability Model and Nonlinear Index Models. (arXiv:2308.15338v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.15338
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#37325;&#26032;&#35780;&#20272;&#20102;&#20351;&#29992;&#32447;&#24615;&#27169;&#22411;&#26469;&#36817;&#20284;&#20108;&#20803;&#32467;&#26524;&#30340;&#21709;&#24212;&#27010;&#29575;&#30340;&#37096;&#20998;&#25928;&#24212;&#30340;&#21033;&#24330;&#65292;&#24182;&#37325;&#28857;&#30740;&#31350;&#20102;&#24179;&#22343;&#37096;&#20998;&#25928;&#24212;&#32780;&#19981;&#26159;&#24213;&#23618;&#32447;&#24615;&#25351;&#25968;&#30340;&#21442;&#25968;&#12290;&#36890;&#36807;&#27169;&#25311;&#23454;&#39564;&#65292;&#21457;&#29616;OLS&#36817;&#20284;&#25110;&#19981;&#36817;&#20284;APE&#30340;&#21508;&#31181;&#24773;&#20917;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#23454;&#29992;&#30340;&#26041;&#27861;&#26469;&#20943;&#23569;OLS&#30340;&#26377;&#38480;&#26679;&#26412;&#20559;&#24046;&#65292;&#32467;&#26524;&#34920;&#26126;&#35813;&#26041;&#27861;&#19982;&#38750;&#32447;&#24615;&#26368;&#23567;&#20108;&#20056;&#65288;NLS&#65289;&#20272;&#35745;&#25968;&#20540;&#19978;&#30456;&#31561;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#37325;&#26032;&#32771;&#34385;&#20102;&#20351;&#29992;&#32447;&#24615;&#27169;&#22411;&#26469;&#36817;&#20284;&#20108;&#20803;&#32467;&#26524;&#30340;&#21709;&#24212;&#27010;&#29575;&#30340;&#37096;&#20998;&#25928;&#24212;&#30340;&#21033;&#24330;&#12290;&#29305;&#21035;&#22320;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;Horrace&#21644;Oaxaca (2006)&#20013;&#30340;&#26012;&#22369;&#27169;&#22411;&#65292;&#20294;&#25105;&#20204;&#30340;&#37325;&#28857;&#26159;&#24179;&#22343;&#37096;&#20998;&#25928;&#24212;(APE)&#65292;&#32780;&#19981;&#26159;&#24213;&#23618;&#32447;&#24615;&#25351;&#25968;&#30340;&#21442;&#25968;&#12290;&#25105;&#20204;&#20351;&#29992;&#29616;&#26377;&#30340;&#29702;&#35770;&#32467;&#26524;&#26469;&#39564;&#35777;&#32447;&#24615;&#25237;&#24433;&#21442;&#25968;&#65288;&#36825;&#20123;&#21442;&#25968;&#24635;&#26159;&#34987;&#26222;&#36890;&#26368;&#23567;&#20108;&#20056;&#27861;&#65288;OLS&#65289;&#19968;&#33268;&#20272;&#35745;&#65289;&#21487;&#33021;&#19982;&#25351;&#25968;&#21442;&#25968;&#19981;&#21516;&#65292;&#20294;&#22312;&#26576;&#20123;&#24773;&#20917;&#19979;&#20173;&#28982;&#19982;APE&#30456;&#21516;&#12290;&#20351;&#29992;&#27169;&#25311;&#65292;&#25105;&#20204;&#25551;&#36848;&#20102;OLS&#36817;&#20284;&#25110;&#19981;&#36817;&#20284;APE&#30340;&#20854;&#20182;&#24773;&#20917;&#65292;&#24182;&#21457;&#29616;&#22312;[0,1]&#33539;&#22260;&#20869;&#20855;&#26377;&#22823;&#27604;&#20363;&#30340;&#25311;&#21512;&#20540;&#26082;&#19981;&#26159;&#24517;&#35201;&#30340;&#65292;&#20063;&#19981;&#26159;&#20805;&#20998;&#30340;&#12290;&#20943;&#23569;OLS&#26377;&#38480;&#26679;&#26412;&#20559;&#24046;&#30340;&#23454;&#29992;&#26041;&#27861;&#26159;&#36845;&#20195;&#20462;&#21098;&#36229;&#20986;&#21333;&#20301;&#38388;&#38548;&#30340;&#35266;&#27979;&#20540;&#65292;&#25105;&#20204;&#21457;&#29616;&#36825;&#20135;&#29983;&#30340;&#20272;&#35745;&#37327;&#22312;&#25968;&#20540;&#19978;&#31561;&#21516;&#20110;&#38750;&#32447;&#24615;&#26368;&#23567;&#20108;&#20056;&#65288;NLS&#65289;&#20272;&#35745;&#12290;
&lt;/p&gt;
&lt;p&gt;
We reconsider the pros and cons of using a linear model to approximate partial effects on a response probability for a binary outcome. In particular, we study the ramp model in Horrace and Oaxaca (2006), but focus on average partial effects (APE) rather than the parameters of the underlying linear index. We use existing theoretical results to verify that the linear projection parameters (which are always consistently estimated by ordinary least squares (OLS)) may differ from the index parameters, yet still be identical to the APEs in some cases. Using simulations, we describe other cases where OLS either does or does not approximate the APEs, and we find that having a large fraction of fitted values in [0,1] is neither necessary nor sufficient. A practical approach to reduce the finite sample bias of OLS is to iteratively trim the observations with fitted values outside the unit interval, which we find produces estimates numerically equivalent to nonlinear least squares (NLS) estimatio
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25506;&#31350;&#20102;&#31354;&#34989;&#23545;20&#19990;&#32426;&#26085;&#26412;&#29983;&#32946;&#29575;&#30340;&#28145;&#36828;&#24433;&#21709;&#65292;&#24182;&#35777;&#26126;&#20102;&#25112;&#20105;&#30772;&#22351;&#30340;&#21306;&#22495;&#24433;&#21709;&#21363;&#20351;&#22312;&#26410;&#30452;&#25509;&#21463;&#24433;&#21709;&#30340;&#22320;&#21306;&#20063;&#23384;&#22312;&#12290;</title><link>http://arxiv.org/abs/2306.05770</link><description>&lt;p&gt;
&#20108;&#25112;&#26399;&#38388;&#36720;&#28856;&#23545;20&#19990;&#32426;&#26085;&#26412;&#29983;&#32946;&#29575;&#30340;&#28145;&#36828;&#24433;&#21709;
&lt;/p&gt;
&lt;p&gt;
The far-reaching effects of bombing on fertility in mid-20th century Japan. (arXiv:2306.05770v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.05770
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25506;&#31350;&#20102;&#31354;&#34989;&#23545;20&#19990;&#32426;&#26085;&#26412;&#29983;&#32946;&#29575;&#30340;&#28145;&#36828;&#24433;&#21709;&#65292;&#24182;&#35777;&#26126;&#20102;&#25112;&#20105;&#30772;&#22351;&#30340;&#21306;&#22495;&#24433;&#21709;&#21363;&#20351;&#22312;&#26410;&#30452;&#25509;&#21463;&#24433;&#21709;&#30340;&#22320;&#21306;&#20063;&#23384;&#22312;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25112;&#20105;&#21644;&#20914;&#31361;&#20043;&#21518;&#30340;&#29983;&#32946;&#21464;&#21270;&#22312;&#20840;&#29699;&#33539;&#22260;&#20869;&#24471;&#21040;&#20102;&#35266;&#23519;&#12290;&#26412;&#30740;&#31350;&#26088;&#22312;&#30740;&#31350;&#21306;&#22495;&#25112;&#20105;&#30772;&#22351;&#26159;&#21542;&#20250;&#24433;&#21709;&#25112;&#21518;&#29983;&#32946;&#65292;&#21363;&#20351;&#26159;&#26410;&#30452;&#25509;&#21463;&#21040;&#24433;&#21709;&#20294;&#38752;&#36817;&#21463;&#25439;&#22320;&#21306;&#30340;&#22320;&#21306;&#12290;&#20026;&#20102;&#36798;&#21040;&#36825;&#20010;&#30446;&#30340;&#65292;&#25105;&#20204;&#21033;&#29992;&#20102;&#26085;&#26412;&#20108;&#25112;&#26399;&#38388;&#30340;&#31354;&#34989;&#32463;&#21382;&#12290;&#21033;&#29992;1935&#24180;&#21644;1947&#24180;&#36817;&#30079;&#22320;&#21306;&#30340;&#24066;&#30010;&#26449;&#32423;&#21035;&#29983;&#32946;&#25968;&#25454;&#20197;&#21450;&#22478;&#24066;&#31354;&#34989;&#25439;&#22833;&#25968;&#25454;&#65292;&#25105;&#20204;&#21457;&#29616;&#36720;&#28856;&#23545;&#20110;15&#20844;&#37324;&#20869;&#22478;&#38215;&#21644;&#20065;&#26449;&#30340;&#25112;&#21518;&#29983;&#32946;&#29575;&#23384;&#22312;&#24433;&#21709;&#65292;&#23613;&#31649;&#36825;&#20123;&#22320;&#21306;&#26410;&#30452;&#25509;&#21463;&#21040;&#25439;&#23475;&#12290;&#28982;&#32780;&#65292;&#38388;&#25509;&#24433;&#21709;&#30340;&#26041;&#21521;&#26159;&#28151;&#21512;&#30340;&#12290;&#20272;&#35745;&#32467;&#26524;&#34920;&#26126;&#65292;&#37051;&#36817;&#22478;&#24066;&#30340;&#20005;&#37325;&#31354;&#34989;&#22686;&#21152;&#20102;&#29983;&#32946;&#29575;&#65292;&#32780;&#36739;&#36731;&#30340;&#31354;&#34989;&#21017;&#38477;&#20302;&#20102;&#29983;&#32946;&#29575;&#12290;&#27492;&#22806;&#65292;&#25311;&#23454;&#39564;&#27861;&#30340;&#32467;&#26524;&#34920;&#26126;&#65292;&#20005;&#37325;&#30340;&#31354;&#34989;&#24656;&#24807;&#22312;&#25112;&#21518;&#26399;&#38388;&#22686;&#21152;&#20102;&#29983;&#32946;&#29575;&#12290;&#26412;&#30740;&#31350;&#20026;&#25112;&#21518;&#29983;&#32946;&#21464;&#21270;&#30340;&#25991;&#29486;&#25552;&#20379;&#20102;&#35777;&#25454;&#65292;&#21363;&#36720;&#28856;&#23545;&#20110;&#29983;&#32946;&#29575;&#26377;&#28145;&#36828;&#24433;&#21709;&#65292;&#21363;&#20351;&#26159;&#34987;&#25112;&#20105;&#25439;&#23475;&#38388;&#25509;&#24433;&#21709;&#30340;&#22320;&#21306;&#12290;
&lt;/p&gt;
&lt;p&gt;
Fertility changes after wars and conflicts have been observed worldwide. This study examines whether regional war damage affects postwar fertility even in areas that were not directly affected but were close to the damaged areas. In order to accomplish this, we exploit the air-raid experience in Japan during World War II. Using the municipality-level fertility data in the Kinki region in 1935 and 1947 and the data on damages from air raids in cities, we find the effects of bombing on postwar fertility in towns and villages within 15 kilometers, despite no direct damages. However, the direction of the indirect effects is mixed. The estimation results suggest that severe air raids in neighboring cities increased fertility, whereas minor air raids decreased it. Moreover, the results of the quasi-experimental approach indicate that intense fears of air raids increased the fertility rate in the postwar period. Our study contributes to the literature on fertility changes in the postwar perio
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#20998;&#26512;&#20102;&#33487;&#26684;&#20848;1,079&#20010;&#22320;&#26041;&#25919;&#24220;STV&#36873;&#20030;&#65292;&#21457;&#29616;&#20854;&#20013;41&#27425;&#20986;&#29616;&#26576;&#31181;&#21333;&#35843;&#24615;&#24322;&#24120;&#65292;&#19988;&#36825;&#20123;&#24322;&#24120;&#29575;&#19982;&#20043;&#21069;&#30340;&#32463;&#39564;&#30740;&#31350;&#30456;&#20284;&#65292;&#36828;&#20302;&#20110;&#22823;&#22810;&#25968;&#29702;&#35770;&#30740;&#31350;&#21457;&#29616;&#30340;&#24322;&#24120;&#29575;&#12290;</title><link>http://arxiv.org/abs/2305.17741</link><description>&lt;p&gt;
&#33487;&#26684;&#20848;&#22320;&#26041;&#25919;&#24220;&#36873;&#20030;&#20013;&#30340;&#21333;&#35843;&#24615;&#24322;&#24120;&#29616;&#35937;
&lt;/p&gt;
&lt;p&gt;
Monotonicity Anomalies in Scottish Local Government Elections. (arXiv:2305.17741v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.17741
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#20998;&#26512;&#20102;&#33487;&#26684;&#20848;1,079&#20010;&#22320;&#26041;&#25919;&#24220;STV&#36873;&#20030;&#65292;&#21457;&#29616;&#20854;&#20013;41&#27425;&#20986;&#29616;&#26576;&#31181;&#21333;&#35843;&#24615;&#24322;&#24120;&#65292;&#19988;&#36825;&#20123;&#24322;&#24120;&#29575;&#19982;&#20043;&#21069;&#30340;&#32463;&#39564;&#30740;&#31350;&#30456;&#20284;&#65292;&#36828;&#20302;&#20110;&#22823;&#22810;&#25968;&#29702;&#35770;&#30740;&#31350;&#21457;&#29616;&#30340;&#24322;&#24120;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21333;&#19968;&#21487;&#36716;&#31227;&#36873;&#31080;&#65288;STV&#65289;&#25237;&#31080;&#26041;&#27861;&#29992;&#20110;&#36873;&#20030;&#25490;&#21517;&#36873;&#20030;&#20013;&#30340;&#22810;&#20010;&#20505;&#36873;&#20154;&#12290;STV&#30340;&#19968;&#20010;&#24369;&#28857;&#26159;&#23427;&#26410;&#33021;&#36890;&#36807;&#19982;&#21333;&#35843;&#24615;&#21644;&#26080;&#34920;&#20915;&#24726;&#35770;&#30456;&#20851;&#30340;&#22810;&#20010;&#20844;&#24179;&#26631;&#20934;&#12290;&#25105;&#20204;&#20998;&#26512;&#20102;&#33487;&#26684;&#20848;1,079&#20010;&#22320;&#26041;&#25919;&#24220;STV&#36873;&#20030;&#65292;&#20197;&#20272;&#35745;&#29616;&#23454;&#19990;&#30028;&#36873;&#20030;&#20013;&#27492;&#31867;&#21333;&#35843;&#24615;&#24322;&#24120;&#30340;&#39057;&#29575;&#65292;&#24182;&#23558;&#32467;&#26524;&#19982;&#20851;&#20110;&#27492;&#31867;&#24322;&#24120;&#20986;&#29616;&#29575;&#30340;&#20808;&#21069;&#32463;&#39564;&#21644;&#29702;&#35770;&#30740;&#31350;&#36827;&#34892;&#27604;&#36739;&#12290;&#22312;1079&#27425;&#36873;&#20030;&#20013;&#65292;&#25105;&#20204;&#21457;&#29616;41&#27425;&#20986;&#29616;&#26576;&#31181;&#21333;&#35843;&#24615;&#24322;&#24120;&#12290;&#25105;&#20204;&#36890;&#24120;&#21457;&#29616;&#24322;&#24120;&#29575;&#19982;&#20043;&#21069;&#30340;&#32463;&#39564;&#30740;&#31350;&#30456;&#20284;&#65292;&#36828;&#20302;&#20110;&#22823;&#22810;&#25968;&#29702;&#35770;&#30740;&#31350;&#21457;&#29616;&#30340;&#24322;&#24120;&#29575;&#12290;&#25105;&#20204;&#21457;&#29616;&#30340;&#22823;&#22810;&#25968;STV&#24322;&#24120;&#37117;&#26159;&#31532;&#19968;&#27425;&#22312;&#23454;&#38469;&#36873;&#20030;&#20013;&#35760;&#24405;&#21040;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
The single transferable vote (STV) voting method is used to elect multiple candidates in ranked-choice elections. One weakness of STV is that it fails multiple fairness criteria related to monotonicity and no-show paradoxes. We analyze 1,079 local government STV elections in Scotland to estimate the frequency of such monotonicity anomalies in real-world elections, and compare our results with prior empirical and theoretical research about the rates at which such anomalies occur. In 41 of the 1079 elections we found some kind of monotonicity anomaly. We generally find that the rates of anomalies are similar to prior empirical research and much lower than what most theoretical research has found. Most of the STV anomalies we find are the first of their kind to be documented in real-world elections.
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#26102;&#38388;&#24207;&#21015;&#22238;&#24402;&#20013;&#30340;&#40065;&#26834;&#25512;&#26029;&#38382;&#39064;&#65292;&#25351;&#20986;&#20102;&#23558;HAC&#20272;&#35745;&#25216;&#26415;&#24212;&#29992;&#20110;&#26102;&#38388;&#24207;&#21015;&#29615;&#22659;&#26102;&#30340;&#22256;&#38590;&#65292;&#24182;&#35752;&#35770;&#20102;OLS&#21442;&#25968;&#20272;&#35745;&#19981;&#19968;&#33268;&#12289;HAC&#22238;&#24402;&#21442;&#25968;&#20272;&#35745;&#20302;&#25928;&#20197;&#21450;HAC&#26465;&#20214;&#39044;&#27979;&#20302;&#25928;&#31561;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2203.04080</link><description>&lt;p&gt;
&#20851;&#20110;&#26102;&#38388;&#24207;&#21015;&#22238;&#24402;&#20013;&#30340;&#40065;&#26834;&#25512;&#26029;
&lt;/p&gt;
&lt;p&gt;
On Robust Inference in Time Series Regression. (arXiv:2203.04080v2 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2203.04080
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#26102;&#38388;&#24207;&#21015;&#22238;&#24402;&#20013;&#30340;&#40065;&#26834;&#25512;&#26029;&#38382;&#39064;&#65292;&#25351;&#20986;&#20102;&#23558;HAC&#20272;&#35745;&#25216;&#26415;&#24212;&#29992;&#20110;&#26102;&#38388;&#24207;&#21015;&#29615;&#22659;&#26102;&#30340;&#22256;&#38590;&#65292;&#24182;&#35752;&#35770;&#20102;OLS&#21442;&#25968;&#20272;&#35745;&#19981;&#19968;&#33268;&#12289;HAC&#22238;&#24402;&#21442;&#25968;&#20272;&#35745;&#20302;&#25928;&#20197;&#21450;HAC&#26465;&#20214;&#39044;&#27979;&#20302;&#25928;&#31561;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#27178;&#25130;&#38754;&#29615;&#22659;&#20013;&#65292;&#20855;&#26377;&#24322;&#26041;&#24046;&#21644;&#33258;&#30456;&#20851;&#19968;&#33268;&#65288;HAC&#65289;&#26631;&#20934;&#35823;&#30340;&#26368;&#23567;&#20108;&#20056;&#22238;&#24402;&#38750;&#24120;&#26377;&#29992;&#12290;&#28982;&#32780;&#65292;&#22312;&#23558;HAC&#20272;&#35745;&#25216;&#26415;&#24212;&#29992;&#20110;&#26102;&#38388;&#24207;&#21015;&#29615;&#22659;&#26102;&#65292;&#20250;&#38754;&#20020;&#20960;&#20010;&#24120;&#24120;&#34987;&#24573;&#35270;&#30340;&#20027;&#35201;&#22256;&#38590;&#12290;&#39318;&#20808;&#65292;&#22312;&#21487;&#33021;&#20986;&#29616;&#24378;&#22806;&#29983;&#24615;&#22833;&#36133;&#30340;&#26102;&#38388;&#24207;&#21015;&#29615;&#22659;&#20013;&#65292;OLS&#21442;&#25968;&#20272;&#35745;&#21487;&#33021;&#19981;&#19968;&#33268;&#65292;&#22240;&#27492;&#21363;&#20351;&#28176;&#36817;&#19979;&#20063;&#26080;&#27861;&#36827;&#34892;HAC&#25512;&#26029;&#12290;&#20854;&#27425;&#65292;&#22823;&#22810;&#25968;&#32463;&#27982;&#26102;&#38388;&#24207;&#21015;&#20855;&#26377;&#24378;&#33258;&#30456;&#20851;&#24615;&#65292;&#36825;&#20351;&#24471;HAC&#22238;&#24402;&#21442;&#25968;&#20272;&#35745;&#38750;&#24120;&#20302;&#25928;&#12290;&#31532;&#19977;&#65292;&#24378;&#33258;&#30456;&#20851;&#24615;&#21516;&#26679;&#20351;&#24471;HAC&#26465;&#20214;&#39044;&#27979;&#38750;&#24120;&#20302;&#25928;&#12290;&#26368;&#21518;&#65292;&#27969;&#34892;&#30340;HAC&#20272;&#35745;&#22120;&#30340;&#32467;&#26500;&#19981;&#36866;&#21512;&#25429;&#25417;&#36890;&#24120;&#23384;&#22312;&#20110;&#32463;&#27982;&#26102;&#38388;&#24207;&#21015;&#20013;&#30340;&#33258;&#22238;&#24402;&#33258;&#30456;&#20851;&#24615;&#65292;&#36825;&#20250;&#20135;&#29983;&#36739;&#22823;&#30340;&#35268;&#27169;&#25197;&#26354;&#21644;HAC&#20551;&#35774;&#26816;&#39564;&#20013;&#30340;&#21151;&#25928;&#38477;&#20302;&#65292;&#38500;&#38750;&#26679;&#26412;&#25968;&#37327;&#38750;&#24120;&#22823;&#12290;
&lt;/p&gt;
&lt;p&gt;
Least squares regression with heteroskedasticity and autocorrelation consistent (HAC) standard errors has proved very useful in cross section environments. However, several major difficulties, which are generally overlooked, must be confronted when transferring the HAC estimation technology to time series environments. First, in plausible time-series environments involving failure of strong exogeneity, OLS parameter estimates can be inconsistent, so that HAC inference fails even asymptotically. Second, most economic time series have strong autocorrelation, which renders HAC regression parameter estimates highly inefficient. Third, strong autocorrelation similarly renders HAC conditional predictions highly inefficient. Finally, The structure of popular HAC estimators is ill-suited for capturing the autoregressive autocorrelation typically present in economic time series, which produces large size distortions and reduced power in HACbased hypothesis testing, in all but the largest sample
&lt;/p&gt;</description></item></channel></rss>