<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#36825;&#31687;&#35770;&#25991;&#30740;&#31350;&#20102;&#19968;&#31181;&#26032;&#30340;&#20998;&#37197;&#38382;&#39064;&#65292;&#32771;&#34385;&#20102;&#20195;&#29702;&#30340;&#24207;&#25968;&#24378;&#24230;&#65292;&#25552;&#20986;&#20102;&#22522;&#20110;&#25490;&#21517;&#30340;&#20934;&#21017;&#65292;&#23450;&#20041;&#20102;&#24378;&#24230;&#39640;&#25928;&#30340;&#20998;&#37197;&#12290;&#35770;&#25991;&#21021;&#27493;&#35752;&#35770;&#20102;&#36825;&#31181;&#20998;&#37197;&#30340;&#23384;&#22312;&#24615;&#21644;&#38750;&#23384;&#22312;&#24615;&#12290;</title><link>https://arxiv.org/abs/2011.04306</link><description>&lt;p&gt;
&#24207;&#25968;&#24378;&#24230;&#39640;&#25928;&#20998;&#37197;
&lt;/p&gt;
&lt;p&gt;
Ordinal Intensity-Efficient Allocations
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2011.04306
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#30740;&#31350;&#20102;&#19968;&#31181;&#26032;&#30340;&#20998;&#37197;&#38382;&#39064;&#65292;&#32771;&#34385;&#20102;&#20195;&#29702;&#30340;&#24207;&#25968;&#24378;&#24230;&#65292;&#25552;&#20986;&#20102;&#22522;&#20110;&#25490;&#21517;&#30340;&#20934;&#21017;&#65292;&#23450;&#20041;&#20102;&#24378;&#24230;&#39640;&#25928;&#30340;&#20998;&#37197;&#12290;&#35770;&#25991;&#21021;&#27493;&#35752;&#35770;&#20102;&#36825;&#31181;&#20998;&#37197;&#30340;&#23384;&#22312;&#24615;&#21644;&#38750;&#23384;&#22312;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#20998;&#37197;&#38382;&#39064;&#65292;&#20854;&#20013;&#20195;&#29702;&#38500;&#20102;&#20855;&#26377;&#24207;&#25968;&#20559;&#22909;&#22806;&#65292;&#36824;&#20855;&#26377;"&#24207;&#25968;&#24378;&#24230;"&#65306;&#20182;&#20204;&#21487;&#20197;&#36827;&#34892;&#31616;&#21333;&#21644;&#20869;&#37096;&#19968;&#33268;&#30340;&#27604;&#36739;&#65292;&#20363;&#22914;&#8220;&#25105;&#26356;&#21916;&#27426;$a$&#32780;&#19981;&#26159;$b$&#65292;&#27604;&#25105;&#26356;&#21916;&#27426;$c$&#32780;&#19981;&#26159;$d$&#8221;&#65292;&#32780;&#19981;&#19968;&#23450;&#33021;&#22815;&#37327;&#21270;&#23427;&#20204;&#12290;&#22312;&#36825;&#31181;&#26032;&#30340;&#20449;&#24687;&#31038;&#20250;&#36873;&#25321;&#29615;&#22659;&#20013;&#65292;&#25105;&#20204;&#39318;&#20808;&#24341;&#20837;&#20102;&#19968;&#20010;&#22522;&#20110;&#25490;&#21517;&#30340;&#20934;&#21017;&#65292;&#20351;&#24471;&#21487;&#20197;&#36827;&#34892;&#36825;&#20123;&#24207;&#25968;&#24378;&#24230;&#30340;&#36328;&#20010;&#20154;&#27604;&#36739;&#12290;&#22522;&#20110;&#36825;&#20010;&#20934;&#21017;&#65292;&#25105;&#20204;&#23450;&#20041;&#20102;&#19968;&#31181;&#20998;&#37197;&#20026;&#8220;&#24378;&#24230;&#39640;&#25928;&#8221;&#65292;&#22914;&#26524;&#23427;&#22312;&#20195;&#29702;&#30340;&#24378;&#24230;&#24341;&#21457;&#30340;&#20559;&#22909;&#26041;&#38754;&#26159;&#24085;&#32047;&#25176;&#26377;&#25928;&#30340;&#65292;&#24182;&#19988;&#24403;&#21478;&#19968;&#31181;&#20998;&#37197;&#20197;&#30456;&#21516;&#30340;&#26041;&#24335;&#23558;&#30456;&#21516;&#30340;&#29289;&#21697;&#23545;&#20998;&#37197;&#32473;&#30456;&#21516;&#30340;&#20195;&#29702;&#23545;&#26102;&#65292;&#21069;&#19968;&#31181;&#20998;&#37197;&#23558;&#27599;&#23545;&#20013;&#26222;&#36941;&#26356;&#21463;&#20559;&#22909;&#30340;&#29289;&#21697;&#20998;&#37197;&#32473;&#26356;&#21916;&#27426;&#23427;&#30340;&#20195;&#29702;&#12290;&#25105;&#20204;&#22312;&#19981;&#23545;&#20559;&#22909;&#26045;&#21152;&#38480;&#21046;&#30340;&#24773;&#20917;&#19979;&#25552;&#20986;&#20102;&#20851;&#20110;&#36825;&#31181;&#20998;&#37197;&#30340;&#19968;&#20123;&#21021;&#27493;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study the assignment problem in situations where, in addition to having ordinal preferences, agents also have *ordinal intensities*: they can make simple and internally consistent comparisons such as "I prefer $a$ to $b$ more than I prefer $c$ to $d$" without necessarily being able to quantify them. In this new informational social-choice environment we first introduce a rank-based criterion that enables interpersonal comparability of such ordinal intensities. Building on this criterion, we define an allocation to be *"intensity-efficient"* if it is Pareto efficient with respect to the preferences induced by the agents' intensities and also such that, when another allocation assigns the same pairs of items to the same pairs of agents but in a "flipped" way, the former allocation assigns the commonly preferred item in every such pair to the agent who prefers it more. We present some first results on the (non-)existence of such allocations without imposing restrictions on preferences 
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#20171;&#32461;&#20102;&#22522;&#20110;&#36125;&#21494;&#26031;&#19978;&#19979;&#25991;&#26641;&#29366;&#24577;&#31354;&#38388;&#27169;&#22411;&#30340;&#26102;&#38388;&#24207;&#21015;&#24314;&#27169;&#21644;&#39044;&#27979;&#26041;&#27861;&#65292;&#36890;&#36807;&#23618;&#32423;&#36125;&#21494;&#26031;&#26694;&#26550;&#23558;&#31163;&#25955;&#29366;&#24577;&#21644;&#23454;&#20540;&#26102;&#38388;&#24207;&#21015;&#27169;&#22411;&#32452;&#21512;&#65292;&#26500;&#24314;&#20986;&#28789;&#27963;&#19988;&#21487;&#35299;&#37322;&#30340;&#28151;&#21512;&#27169;&#22411;&#65292;&#24182;&#25552;&#20986;&#20102;&#26377;&#25928;&#30340;&#31639;&#27861;&#26469;&#36827;&#34892;&#36125;&#21494;&#26031;&#25512;&#26029;&#21644;&#39044;&#27979;&#12290;</title><link>http://arxiv.org/abs/2308.00913</link><description>&lt;p&gt;
&#22522;&#20110;&#36125;&#21494;&#26031;&#19978;&#19979;&#25991;&#26641;&#29366;&#24577;&#31354;&#38388;&#27169;&#22411;&#30340;&#26102;&#38388;&#24207;&#21015;&#24314;&#27169;&#21644;&#39044;&#27979;
&lt;/p&gt;
&lt;p&gt;
The Bayesian Context Trees State Space Model for time series modelling and forecasting. (arXiv:2308.00913v1 [stat.ME])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.00913
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#20171;&#32461;&#20102;&#22522;&#20110;&#36125;&#21494;&#26031;&#19978;&#19979;&#25991;&#26641;&#29366;&#24577;&#31354;&#38388;&#27169;&#22411;&#30340;&#26102;&#38388;&#24207;&#21015;&#24314;&#27169;&#21644;&#39044;&#27979;&#26041;&#27861;&#65292;&#36890;&#36807;&#23618;&#32423;&#36125;&#21494;&#26031;&#26694;&#26550;&#23558;&#31163;&#25955;&#29366;&#24577;&#21644;&#23454;&#20540;&#26102;&#38388;&#24207;&#21015;&#27169;&#22411;&#32452;&#21512;&#65292;&#26500;&#24314;&#20986;&#28789;&#27963;&#19988;&#21487;&#35299;&#37322;&#30340;&#28151;&#21512;&#27169;&#22411;&#65292;&#24182;&#25552;&#20986;&#20102;&#26377;&#25928;&#30340;&#31639;&#27861;&#26469;&#36827;&#34892;&#36125;&#21494;&#26031;&#25512;&#26029;&#21644;&#39044;&#27979;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24341;&#20837;&#20102;&#19968;&#20010;&#23618;&#32423;&#36125;&#21494;&#26031;&#26694;&#26550;&#65292;&#29992;&#20110;&#24320;&#21457;&#29992;&#20110;&#30495;&#23454;&#20540;&#26102;&#38388;&#24207;&#21015;&#30340;&#20016;&#23500;&#28151;&#21512;&#27169;&#22411;&#65292;&#20197;&#21450;&#19968;&#31995;&#21015;&#26377;&#25928;&#30340;&#23398;&#20064;&#21644;&#25512;&#26029;&#24037;&#20855;&#12290;&#22312;&#39030;&#23618;&#65292;&#36890;&#36807;&#36866;&#24403;&#37327;&#21270;&#26368;&#36817;&#26679;&#26412;&#30340;&#19968;&#20123;&#26377;&#24847;&#20041;&#30340;&#31163;&#25955;&#29366;&#24577;&#26469;&#36827;&#34892;&#37492;&#23450;&#12290;&#36825;&#20123;&#21487;&#35266;&#23519;&#29366;&#24577;&#30340;&#38598;&#21512;&#34987;&#25551;&#36848;&#20026;&#31163;&#25955;&#30340;&#19978;&#19979;&#25991;&#26641;&#27169;&#22411;&#12290;&#28982;&#21518;&#65292;&#22312;&#24213;&#23618;&#65292;&#23558;&#19968;&#20010;&#19981;&#21516;&#30340;&#12289;&#20219;&#24847;&#30340;&#23454;&#20540;&#26102;&#38388;&#24207;&#21015;&#27169;&#22411;&#65288;&#22522;&#26412;&#27169;&#22411;&#65289;&#19982;&#27599;&#20010;&#29366;&#24577;&#30456;&#20851;&#32852;&#12290;&#36825;&#23450;&#20041;&#20102;&#19968;&#20010;&#38750;&#24120;&#36890;&#29992;&#30340;&#26694;&#26550;&#65292;&#21487;&#20197;&#19982;&#20219;&#20309;&#29616;&#26377;&#27169;&#22411;&#31867;&#19968;&#36215;&#20351;&#29992;&#65292;&#26500;&#24314;&#28789;&#27963;&#19988;&#21487;&#35299;&#37322;&#30340;&#28151;&#21512;&#27169;&#22411;&#12290;&#25105;&#20204;&#23558;&#20854;&#31216;&#20026;&#36125;&#21494;&#26031;&#19978;&#19979;&#25991;&#26641;&#29366;&#24577;&#31354;&#38388;&#27169;&#22411;&#65292;&#25110;&#32773;BCT-X&#26694;&#26550;&#12290;&#24341;&#20837;&#20102;&#39640;&#25928;&#30340;&#31639;&#27861;&#65292;&#21487;&#20197;&#23454;&#29616;&#26377;&#25928;&#30340;&#12289;&#31934;&#30830;&#30340;&#36125;&#21494;&#26031;&#25512;&#26029;&#65307;&#29305;&#21035;&#26159;&#21487;&#20197;&#30830;&#23450;&#26368;&#22823;&#21518;&#39564;&#27010;&#29575;&#65288;MAP&#65289;&#19978;&#19979;&#25991;&#26641;&#27169;&#22411;&#12290;&#36825;&#20123;&#31639;&#27861;&#21487;&#20197;&#39034;&#24207;&#26356;&#26032;&#65292;&#20197;&#20415;&#23454;&#29616;&#26377;&#25928;&#30340;&#25512;&#26029;&#21644;&#39044;&#27979;&#12290;
&lt;/p&gt;
&lt;p&gt;
A hierarchical Bayesian framework is introduced for developing rich mixture models for real-valued time series, along with a collection of effective tools for learning and inference. At the top level, meaningful discrete states are identified as appropriately quantised values of some of the most recent samples. This collection of observable states is described as a discrete context-tree model. Then, at the bottom level, a different, arbitrary model for real-valued time series - a base model - is associated with each state. This defines a very general framework that can be used in conjunction with any existing model class to build flexible and interpretable mixture models. We call this the Bayesian Context Trees State Space Model, or the BCT-X framework. Efficient algorithms are introduced that allow for effective, exact Bayesian inference; in particular, the maximum a posteriori probability (MAP) context-tree model can be identified. These algorithms can be updated sequentially, facili
&lt;/p&gt;</description></item></channel></rss>