<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#26412;&#25991;&#35777;&#26126;&#20102;&#23545;&#20110;&#19968;&#33324;&#30340;Savage&#29366;&#24577;&#31354;&#38388;&#65292;&#29366;&#24577;&#30456;&#20851;&#20559;&#22909;&#28385;&#36275;&#28857;&#28857;&#36830;&#32493;&#24615;&#65292;&#20174;&#32780;&#31215;&#26497;&#22238;&#31572;&#20102;&#19968;&#20010;&#37325;&#35201;&#29468;&#24819;&#65292;&#24182;&#36827;&#19968;&#27493;&#24471;&#21040;&#20102;&#26465;&#20214;Chisini&#22343;&#20540;&#30340;&#26174;&#24335;&#34920;&#31034;&#24418;&#24335;&#12290;</title><link>http://arxiv.org/abs/2401.09054</link><description>&lt;p&gt;
&#20851;&#20110;&#29366;&#24577;&#30456;&#20851;&#25928;&#29992;&#30340;&#36830;&#32493;&#24615;
&lt;/p&gt;
&lt;p&gt;
On continuity of state-dependent utilities. (arXiv:2401.09054v1 [q-fin.MF])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.09054
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#35777;&#26126;&#20102;&#23545;&#20110;&#19968;&#33324;&#30340;Savage&#29366;&#24577;&#31354;&#38388;&#65292;&#29366;&#24577;&#30456;&#20851;&#20559;&#22909;&#28385;&#36275;&#28857;&#28857;&#36830;&#32493;&#24615;&#65292;&#20174;&#32780;&#31215;&#26497;&#22238;&#31572;&#20102;&#19968;&#20010;&#37325;&#35201;&#29468;&#24819;&#65292;&#24182;&#36827;&#19968;&#27493;&#24471;&#21040;&#20102;&#26465;&#20214;Chisini&#22343;&#20540;&#30340;&#26174;&#24335;&#34920;&#31034;&#24418;&#24335;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;Wakker&#21644;Zank&#65288;1999&#65289;&#30340;&#35770;&#25991;&#20013;&#35777;&#26126;&#65292;&#23545;&#20110;&#19968;&#33324;&#30340;Savage&#29366;&#24577;&#31354;&#38388;&#65292;&#21482;&#35201;&#20551;&#35774;&#20559;&#22909;&#25490;&#24207;&#26159;&#28857;&#28857;&#36830;&#32493;&#30340;&#65292;&#23601;&#21487;&#20197;&#36890;&#36807;&#29366;&#24577;&#30456;&#20851;&#25928;&#29992;&#30340;&#31215;&#20998;&#24418;&#24335;&#26469;&#34920;&#31034;&#29366;&#24577;&#30456;&#20851;&#20559;&#22909;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#36825;&#31181;&#29366;&#24577;&#30456;&#20851;&#20989;&#25968;&#20174;&#20559;&#22909;&#25490;&#24207;&#20013;&#32487;&#25215;&#20102;&#28857;&#28857;&#36830;&#32493;&#24615;&#65292;&#20174;&#32780;&#31215;&#26497;&#22238;&#31572;&#20102;&#21069;&#36848;&#37325;&#35201;&#24037;&#20316;&#20013;&#30340;&#19968;&#20010;&#29468;&#24819;&#12290;&#25105;&#20204;&#36827;&#19968;&#27493;&#24212;&#29992;&#36825;&#20010;&#32467;&#26524;&#65292;&#20197;&#33719;&#24471;&#26465;&#20214;Chisini&#22343;&#20540;&#30340;&#26174;&#24335;&#34920;&#31034;&#65292;&#36825;&#20010;&#34920;&#31034;&#24418;&#24335;&#26159;&#19968;&#20010;&#26465;&#20214;&#31561;&#20540;&#12290;
&lt;/p&gt;
&lt;p&gt;
State-dependent preferences for a general Savage's state space were shown in Wakker and Zank (1999) to admit a numerical representation in the form of the integral of a state-dependent utility, as soon as pointwise continuity of the preference ordering is assumed. In this paper we prove that such a state-dependent function inherits pointwise continuity from the preference ordering, providing in this way a positive answer to a conjecture posed in the aforementioned seminal work. We further apply this result to obtain an explicit representation of conditional Chisini means in the form of a conditional certainty equivalent.
&lt;/p&gt;</description></item></channel></rss>