<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#20351;&#29992;&#26032;&#30340;&#22788;&#29702;&#26041;&#24335;&#36827;&#34892;&#25919;&#31574;&#23398;&#20064;&#30340;&#38382;&#39064;&#65292;&#36890;&#36807;&#23545;&#22788;&#29702;&#21453;&#24212;&#30340;&#24418;&#29366;&#38480;&#21046;&#36827;&#34892;&#37096;&#20998;&#35782;&#21035;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#26368;&#23567;&#21518;&#24724;&#20934;&#21017;&#27604;&#36739;&#19981;&#21516;&#25919;&#31574;&#30340;&#26041;&#27861;&#65292;&#24182;&#24212;&#29992;&#20110;&#32943;&#23612;&#20122;&#20892;&#26449;&#30005;&#32593;&#36830;&#25509;&#30340;&#26377;&#38024;&#23545;&#24615;&#30340;&#34917;&#36148;&#35774;&#35745;&#12290;</title><link>http://arxiv.org/abs/2210.04703</link><description>&lt;p&gt;
&#20351;&#29992;&#26032;&#30340;&#22788;&#29702;&#26041;&#24335;&#36827;&#34892;&#25919;&#31574;&#23398;&#20064;
&lt;/p&gt;
&lt;p&gt;
Policy Learning with New Treatments. (arXiv:2210.04703v2 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2210.04703
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#20351;&#29992;&#26032;&#30340;&#22788;&#29702;&#26041;&#24335;&#36827;&#34892;&#25919;&#31574;&#23398;&#20064;&#30340;&#38382;&#39064;&#65292;&#36890;&#36807;&#23545;&#22788;&#29702;&#21453;&#24212;&#30340;&#24418;&#29366;&#38480;&#21046;&#36827;&#34892;&#37096;&#20998;&#35782;&#21035;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#26368;&#23567;&#21518;&#24724;&#20934;&#21017;&#27604;&#36739;&#19981;&#21516;&#25919;&#31574;&#30340;&#26041;&#27861;&#65292;&#24182;&#24212;&#29992;&#20110;&#32943;&#23612;&#20122;&#20892;&#26449;&#30005;&#32593;&#36830;&#25509;&#30340;&#26377;&#38024;&#23545;&#24615;&#30340;&#34917;&#36148;&#35774;&#35745;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#30740;&#31350;&#20102;&#20915;&#31574;&#32773;&#26681;&#25454;&#23454;&#39564;&#25968;&#25454;&#36873;&#25321;&#25919;&#31574;&#20197;&#22312;&#24322;&#36136;&#20154;&#32676;&#20013;&#20998;&#37197;&#22788;&#29702;&#26041;&#24335;&#30340;&#38382;&#39064;&#65292;&#35813;&#23454;&#39564;&#25968;&#25454;&#20165;&#21253;&#25324;&#21487;&#33021;&#22788;&#29702;&#26041;&#24335;&#30340;&#23376;&#38598;&#12290;&#26032;&#30340;&#22788;&#29702;&#26041;&#24335;&#30340;&#25928;&#26524;&#26159;&#36890;&#36807;&#23545;&#22788;&#29702;&#21453;&#24212;&#30340;&#24418;&#29366;&#38480;&#21046;&#36827;&#34892;&#37096;&#20998;&#35782;&#21035;&#30340;&#12290;&#26681;&#25454;&#26368;&#23567;&#21518;&#24724;&#20934;&#21017;&#27604;&#36739;&#19981;&#21516;&#30340;&#25919;&#31574;&#65292;&#24182;&#19988;&#25105;&#35777;&#26126;&#20102;&#20154;&#21475;&#20915;&#31574;&#38382;&#39064;&#30340;&#32463;&#39564;&#31867;&#27604;&#20855;&#26377;&#21487;&#34892;&#30340;&#32447;&#24615;&#21644;&#25972;&#25968;&#35268;&#21010;&#24418;&#24335;&#12290;&#25105;&#35777;&#26126;&#20102;&#20272;&#35745;&#25919;&#31574;&#30340;&#26368;&#22823;&#21518;&#24724;&#25910;&#25947;&#20110;&#26368;&#20302;&#30340;&#26368;&#22823;&#21518;&#24724;&#65292;&#20854;&#36895;&#24230;&#26159;N^-1/2&#21644;&#23454;&#39564;&#25968;&#25454;&#20013;&#26465;&#20214;&#24179;&#22343;&#22788;&#29702;&#25928;&#24212;&#20272;&#35745;&#30340;&#36895;&#24230;&#30340;&#26368;&#22823;&#20540;&#12290;&#25105;&#24212;&#29992;&#25105;&#30340;&#32467;&#26524;&#35774;&#35745;&#20102;&#32943;&#23612;&#20122;&#20892;&#26449;&#30005;&#32593;&#36830;&#25509;&#30340;&#26377;&#38024;&#23545;&#24615;&#30340;&#34917;&#36148;&#65292;&#20272;&#35745;&#26377;97%&#30340;&#20154;&#21475;&#24212;&#35813;&#24471;&#21040;&#26410;&#22312;&#23454;&#39564;&#20013;&#23454;&#26045;&#30340;&#22788;&#29702;&#26041;&#24335;&#12290;
&lt;/p&gt;
&lt;p&gt;
I study the problem of a decision maker choosing a policy which allocates treatment to a heterogeneous population on the basis of experimental data that includes only a subset of possible treatment values. The effects of new treatments are partially identified by shape restrictions on treatment response. Policies are compared according to the minimax regret criterion, and I show that the empirical analog of the population decision problem has a tractable linear- and integer-programming formulation. I prove the maximum regret of the estimated policy converges to the lowest possible maximum regret at a rate which is the maximum of N^-1/2 and the rate at which conditional average treatment effects are estimated in the experimental data. I apply my results to design targeted subsidies for electrical grid connections in rural Kenya, and estimate that 97% of the population should be given a treatment not implemented in the experiment.
&lt;/p&gt;</description></item></channel></rss>