<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#35813;&#30740;&#31350;&#23545;&#20256;&#32479;&#30340;&#21452;&#21521;&#22266;&#23450;&#25928;&#24212;&#65288;TWFE&#65289;&#20272;&#35745;&#22120;&#23384;&#22312;&#30340;&#38382;&#39064;&#36827;&#34892;&#20102;&#35814;&#32454;&#38416;&#36848;&#65292;&#24182;&#25552;&#20986;&#20102;&#26032;&#39062;&#30340;&#21160;&#24577;&#24046;&#20998;&#27861;&#20272;&#35745;&#22120;&#20316;&#20026;&#26367;&#20195;&#26041;&#26696;&#12290;&#20351;&#29992;&#33945;&#29305;&#21345;&#27931;&#27169;&#25311;&#35780;&#20272;&#20102;&#21160;&#24577;&#24046;&#20998;&#27861;&#20272;&#35745;&#22120;&#22312;&#20551;&#35774;&#36829;&#21453;&#19979;&#30340;&#24615;&#33021;&#34920;&#29616;&#12290;</title><link>https://arxiv.org/abs/2402.09928</link><description>&lt;p&gt;
&#20309;&#26102;&#21487;&#20197;&#20351;&#29992;&#21452;&#21521;&#22266;&#23450;&#25928;&#24212;&#65288;TWFE&#65289;&#65306;&#23545;&#27604;TWFE&#21644;&#26032;&#39062;&#30340;&#21160;&#24577;&#24046;&#20998;&#27861;&#20272;&#35745;&#22120;
&lt;/p&gt;
&lt;p&gt;
When Can We Use Two-Way Fixed-Effects (TWFE): A Comparison of TWFE and Novel Dynamic Difference-in-Differences Estimators
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.09928
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#23545;&#20256;&#32479;&#30340;&#21452;&#21521;&#22266;&#23450;&#25928;&#24212;&#65288;TWFE&#65289;&#20272;&#35745;&#22120;&#23384;&#22312;&#30340;&#38382;&#39064;&#36827;&#34892;&#20102;&#35814;&#32454;&#38416;&#36848;&#65292;&#24182;&#25552;&#20986;&#20102;&#26032;&#39062;&#30340;&#21160;&#24577;&#24046;&#20998;&#27861;&#20272;&#35745;&#22120;&#20316;&#20026;&#26367;&#20195;&#26041;&#26696;&#12290;&#20351;&#29992;&#33945;&#29305;&#21345;&#27931;&#27169;&#25311;&#35780;&#20272;&#20102;&#21160;&#24577;&#24046;&#20998;&#27861;&#20272;&#35745;&#22120;&#22312;&#20551;&#35774;&#36829;&#21453;&#19979;&#30340;&#24615;&#33021;&#34920;&#29616;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26368;&#36817;&#30340;&#25991;&#29486;&#25581;&#31034;&#20102;&#22312;&#27835;&#30103;&#25928;&#24212;&#20855;&#26377;&#24322;&#36136;&#24615;&#26102;&#65292;&#20256;&#32479;&#30340;&#21452;&#21521;&#22266;&#23450;&#25928;&#24212;&#65288;TWFE&#65289;&#20272;&#35745;&#22120;&#23384;&#22312;&#28508;&#22312;&#32570;&#38519;&#12290;&#23398;&#32773;&#20204;&#24320;&#21457;&#20102;&#26032;&#39062;&#30340;&#21160;&#24577;&#24046;&#20998;&#27861;&#20272;&#35745;&#22120;&#26469;&#35299;&#20915;&#36825;&#20123;&#28508;&#22312;&#32570;&#38519;&#12290;&#28982;&#32780;&#65292;&#22312;&#24212;&#29992;&#30740;&#31350;&#20013;&#20173;&#23384;&#22312;&#23545;&#20110;&#20256;&#32479;TWFE&#20309;&#26102;&#23384;&#22312;&#20559;&#24046;&#20197;&#21450;&#26032;&#39062;&#20272;&#35745;&#22120;&#33021;&#21542;&#35299;&#20915;&#38382;&#39064;&#30340;&#28151;&#28102;&#12290;&#22312;&#26412;&#30740;&#31350;&#20013;&#65292;&#25105;&#20204;&#39318;&#20808;&#30452;&#35266;&#22320;&#35299;&#37322;&#20102;TWFE&#30340;&#38382;&#39064;&#24182;&#38416;&#26126;&#20102;&#26032;&#39062;&#26367;&#20195;&#24046;&#20998;&#27861;&#20272;&#35745;&#22120;&#30340;&#20851;&#38190;&#29305;&#28857;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#31995;&#32479;&#22320;&#23637;&#31034;&#20102;&#20256;&#32479;TWFE&#22312;&#21738;&#20123;&#26465;&#20214;&#19979;&#26159;&#19981;&#19968;&#33268;&#30340;&#12290;&#25105;&#20204;&#37319;&#29992;&#33945;&#29305;&#21345;&#27931;&#27169;&#25311;&#26469;&#35780;&#20272;&#21160;&#24577;&#24046;&#20998;&#27861;&#20272;&#35745;&#22120;&#22312;&#20851;&#38190;&#20551;&#35774;&#36829;&#21453;&#19979;&#30340;&#24615;&#33021;&#65292;&#32780;&#36825;&#22312;&#23454;&#38469;&#24212;&#29992;&#20013;&#21487;&#33021;&#21457;&#29983;&#12290;&#23613;&#31649;&#26032;&#30340;&#21160;&#24577;&#24046;&#20998;&#27861;&#20272;&#35745;&#22120;&#25552;&#20379;&#20102;&#26174;&#33879;&#30340;&#20248;&#21183;&#65292;
&lt;/p&gt;
&lt;p&gt;
arXiv:2402.09928v1 Announce Type: new  Abstract: The conventional Two-Way Fixed-Effects (TWFE) estimator has been under strain lately. Recent literature has revealed potential shortcomings of TWFE when the treatment effects are heterogeneous. Scholars have developed new advanced dynamic Difference-in-Differences (DiD) estimators to tackle these potential shortcomings. However, confusion remains in applied research as to when the conventional TWFE is biased and what issues the novel estimators can and cannot address. In this study, we first provide an intuitive explanation of the problems of TWFE and elucidate the key features of the novel alternative DiD estimators. We then systematically demonstrate the conditions under which the conventional TWFE is inconsistent. We employ Monte Carlo simulations to assess the performance of dynamic DiD estimators under violations of key assumptions, which likely happens in applied cases. While the new dynamic DiD estimators offer notable advantages 
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#23398;&#20064;&#27169;&#22411;&#26469;&#27169;&#25311;&#29616;&#23454;&#30340;&#22312;&#32447;&#24191;&#21578;&#25293;&#21334;&#29615;&#22659;&#65292;&#24182;&#21457;&#29616;&#22312;&#36825;&#26679;&#30340;&#29615;&#22659;&#20013;&#65292;&#20351;&#29992;"&#36719;&#24213;&#20215;"&#21487;&#20197;&#25552;&#39640;&#20851;&#38190;&#32489;&#25928;&#25351;&#26631;&#65292;&#21363;&#20351;&#25237;&#26631;&#32773;&#26469;&#33258;&#30456;&#21516;&#30340;&#20154;&#32676;&#12290;</title><link>http://arxiv.org/abs/2307.11732</link><description>&lt;p&gt;
&#25512;&#36827;&#24191;&#21578;&#25293;&#21334;&#30340;&#29616;&#23454;&#24615;&#65306;&#23454;&#38469;&#35265;&#35299;&#19982;&#24314;&#27169;&#24433;&#21709;
&lt;/p&gt;
&lt;p&gt;
Advancing Ad Auction Realism: Practical Insights &amp; Modeling Implications. (arXiv:2307.11732v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.11732
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#23398;&#20064;&#27169;&#22411;&#26469;&#27169;&#25311;&#29616;&#23454;&#30340;&#22312;&#32447;&#24191;&#21578;&#25293;&#21334;&#29615;&#22659;&#65292;&#24182;&#21457;&#29616;&#22312;&#36825;&#26679;&#30340;&#29615;&#22659;&#20013;&#65292;&#20351;&#29992;"&#36719;&#24213;&#20215;"&#21487;&#20197;&#25552;&#39640;&#20851;&#38190;&#32489;&#25928;&#25351;&#26631;&#65292;&#21363;&#20351;&#25237;&#26631;&#32773;&#26469;&#33258;&#30456;&#21516;&#30340;&#20154;&#32676;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#22312;&#32447;&#24191;&#21578;&#25293;&#21334;&#23398;&#20064;&#27169;&#22411;&#65292;&#20801;&#35768;&#32771;&#34385;&#24403;&#20195;&#22312;&#32447;&#25293;&#21334;&#30340;&#22235;&#20010;&#20851;&#38190;&#29616;&#23454;&#29305;&#24449;&#65306;&#65288;1&#65289;&#24191;&#21578;&#27133;&#21487;&#20197;&#26681;&#25454;&#29992;&#25143;&#30340;&#25628;&#32034;&#26597;&#35810;&#20855;&#26377;&#19981;&#21516;&#30340;&#20215;&#20540;&#21644;&#28857;&#20987;&#29575;&#65292;&#65288;2&#65289;&#31454;&#20105;&#24191;&#21578;&#21830;&#30340;&#25968;&#37327;&#21644;&#36523;&#20221;&#26159;&#19981;&#21487;&#35266;&#23519;&#30340;&#65292;&#24182;&#19988;&#22312;&#27599;&#27425;&#31454;&#25293;&#20013;&#20250;&#21457;&#29983;&#26356;&#25913;&#65292;&#65288;3&#65289;&#24191;&#21578;&#21830;&#20165;&#25509;&#25910;&#21040;&#37096;&#20998;&#30340;&#27719;&#24635;&#21453;&#39304;&#65292;&#65288;4&#65289;&#20184;&#27454;&#35268;&#21017;&#21482;&#37096;&#20998;&#30830;&#23450;&#12290;&#25105;&#20204;&#23558;&#24191;&#21578;&#21830;&#24314;&#27169;&#20026;&#21463;&#23545;&#25239;&#24615;&#36172;&#21338;&#31639;&#27861;&#39537;&#21160;&#30340;&#20195;&#29702;&#65292;&#29420;&#31435;&#20110;&#25293;&#21334;&#26426;&#21046;&#30340;&#22797;&#26434;&#24615;&#12290;&#25105;&#20204;&#30340;&#30446;&#26631;&#26159;&#20026;&#20102;&#27169;&#25311;&#24191;&#21578;&#21830;&#30340;&#34892;&#20026;&#65292;&#36827;&#34892;&#21453;&#20107;&#23454;&#20998;&#26512;&#12289;&#39044;&#27979;&#21644;&#25512;&#29702;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;&#22312;&#36825;&#31181;&#26356;&#22797;&#26434;&#30340;&#29615;&#22659;&#20013;&#65292;&#21363;&#20351;&#25237;&#26631;&#32773;&#26469;&#33258;&#30456;&#21516;&#30340;&#20154;&#32676;&#65292;"&#36719;&#24213;&#20215;"&#20063;&#21487;&#20197;&#25552;&#39640;&#20851;&#38190;&#32489;&#25928;&#25351;&#26631;&#12290;&#25105;&#20204;&#36827;&#19968;&#27493;&#23637;&#31034;&#20102;&#22914;&#20309;&#20174;&#35266;&#23519;&#21040;&#30340;&#31454;&#26631;&#20013;&#25512;&#26029;&#24191;&#21578;&#21830;&#20215;&#20540;&#20998;&#24067;&#65292;&#20174;&#32780;&#35777;&#23454;&#20102;&#35813;&#26041;&#27861;&#30340;&#23454;&#38469;&#21151;&#25928;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper proposes a learning model of online ad auctions that allows for the following four key realistic characteristics of contemporary online auctions: (1) ad slots can have different values and click-through rates depending on users' search queries, (2) the number and identity of competing advertisers are unobserved and change with each auction, (3) advertisers only receive partial, aggregated feedback, and (4) payment rules are only partially specified. We model advertisers as agents governed by an adversarial bandit algorithm, independent of auction mechanism intricacies. Our objective is to simulate the behavior of advertisers for counterfactual analysis, prediction, and inference purposes. Our findings reveal that, in such richer environments, "soft floors" can enhance key performance metrics even when bidders are drawn from the same population. We further demonstrate how to infer advertiser value distributions from observed bids, thereby affirming the practical efficacy of o
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#23545;&#23450;&#37327;&#34913;&#37327;&#21516;&#36136;&#20135;&#19994;&#20869;&#36164;&#28304;&#38169;&#37197;&#30340;&#24120;&#35268;&#26041;&#27861;&#36827;&#34892;&#20102;&#37325;&#26032;&#35780;&#20272;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#24050;&#35782;&#21035;&#30340;&#25919;&#31574;&#21464;&#21270;&#30340;&#27604;&#36739;&#20998;&#26512;&#31574;&#30053;&#12290;&#30740;&#31350;&#34920;&#26126;&#65292;&#37329;&#34701;&#21361;&#26426;&#23545;&#29983;&#20135;&#35201;&#32032;&#30340;&#24433;&#21709;&#23548;&#33268;&#36164;&#28304;&#37197;&#32622;&#20005;&#37325;&#22833;&#35843;&#65292;&#32780;&#25919;&#31574;&#24178;&#39044;&#21487;&#33021;&#20250;&#25439;&#23475;&#25972;&#20307;&#32463;&#27982;&#25928;&#29575;&#12290;</title><link>http://arxiv.org/abs/2306.08760</link><description>&lt;p&gt;
&#29983;&#20135;&#29575;&#12289;&#35201;&#32032;&#38169;&#37197;&#19982;&#37329;&#34701;&#21361;&#26426;
&lt;/p&gt;
&lt;p&gt;
Productivity, Inputs Misallocation, and the Financial Crisis. (arXiv:2306.08760v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.08760
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#23545;&#23450;&#37327;&#34913;&#37327;&#21516;&#36136;&#20135;&#19994;&#20869;&#36164;&#28304;&#38169;&#37197;&#30340;&#24120;&#35268;&#26041;&#27861;&#36827;&#34892;&#20102;&#37325;&#26032;&#35780;&#20272;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#24050;&#35782;&#21035;&#30340;&#25919;&#31574;&#21464;&#21270;&#30340;&#27604;&#36739;&#20998;&#26512;&#31574;&#30053;&#12290;&#30740;&#31350;&#34920;&#26126;&#65292;&#37329;&#34701;&#21361;&#26426;&#23545;&#29983;&#20135;&#35201;&#32032;&#30340;&#24433;&#21709;&#23548;&#33268;&#36164;&#28304;&#37197;&#32622;&#20005;&#37325;&#22833;&#35843;&#65292;&#32780;&#25919;&#31574;&#24178;&#39044;&#21487;&#33021;&#20250;&#25439;&#23475;&#25972;&#20307;&#32463;&#27982;&#25928;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#37325;&#26032;&#35780;&#20272;&#20102;&#23450;&#37327;&#34913;&#37327;&#21516;&#36136;&#20135;&#19994;&#20869;&#36164;&#28304;&#38169;&#37197;&#30340;&#24120;&#35268;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#36890;&#24120;&#20351;&#29992;&#19968;&#20010;&#36755;&#20837;&#36793;&#38469;&#20135;&#21697;&#30340;&#31163;&#25955;&#24230;&#26469;&#34913;&#37327;&#12290;&#25105;&#30340;&#30740;&#31350;&#21457;&#29616;&#65292;&#36825;&#19968;&#32479;&#35745;&#37327;&#21253;&#25324;&#22266;&#26377;&#30340;&#29983;&#20135;&#29575;&#24322;&#36136;&#24615;&#21644;&#29305;&#26377;&#30340;&#29983;&#20135;&#29575;&#20914;&#20987;&#65292;&#32780;&#19981;&#32771;&#34385;&#25152;&#30740;&#31350;&#30340;&#36755;&#20837;&#12290;&#21033;&#29992;&#32654;&#22269;&#21644;&#27431;&#27954;&#21046;&#36896;&#19994;&#20844;&#21496;&#30340;&#36164;&#20135;&#36127;&#20538;&#34920;&#25968;&#25454;&#65292;&#25105;&#21457;&#29616;&#24635;&#29983;&#20135;&#35201;&#32032;&#29983;&#20135;&#29575;&#27874;&#21160;&#20540;&#21344;&#36164;&#26412;&#36793;&#38469;&#20135;&#21697;&#30340;&#26041;&#24046;&#30340;7&#65285;&#65292;&#21171;&#21160;&#21147;&#20026;9&#65285;&#65292;&#26448;&#26009;&#36755;&#20837;&#20026;10&#65285;&#12290;&#22240;&#27492;&#65292;&#36825;&#20010;&#25351;&#25968;&#20197;&#34920;&#38754;&#20215;&#20540;&#34920;&#31034;&#26102;&#65292;&#26080;&#27861;&#35782;&#21035;&#20986;&#20219;&#20309;&#29983;&#20135;&#35201;&#32032;&#30340;&#25919;&#31574;&#24341;&#21457;&#30340;&#38169;&#37197;&#12290;&#20026;&#20102;&#20811;&#26381;&#36825;&#19968;&#23616;&#38480;&#24615;&#65292;&#25105;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#24050;&#35782;&#21035;&#30340;&#25919;&#31574;&#21464;&#21270;&#30340;&#27604;&#36739;&#20998;&#26512;&#31574;&#30053;&#12290;&#36825;&#31181;&#26041;&#27861;&#20801;&#35768;&#30740;&#31350;&#20154;&#21592;&#22312;&#30456;&#23545;&#30340;&#26465;&#20214;&#19979;&#35780;&#20272;&#35825;&#23548;&#22833;&#37197;&#65292;&#21516;&#26102;&#25511;&#21046;TFP&#27874;&#21160;&#24615;&#30340;&#24046;&#24322;&#12290;&#25105;&#21457;&#29616;&#37329;&#34701;&#21361;&#26426;&#23545;&#29983;&#20135;&#35201;&#32032;&#30340;&#24433;&#21709;&#26159;&#19981;&#22343;&#34913;&#30340;&#65292;&#23548;&#33268;&#36164;&#28304;&#37197;&#32622;&#20005;&#37325;&#22833;&#35843;&#12290;&#36890;&#36807;&#27604;&#36739;&#19981;&#21516;&#22320;&#21306;&#21644;&#34892;&#19994;&#30340;&#37329;&#34701;&#21361;&#26426;&#21069;&#21644;&#37329;&#34701;&#21361;&#26426;&#26399;&#38388;&#65292;&#32463;&#27982;&#37329;&#34701;&#29615;&#22659;&#31283;&#23450;&#30340;&#24773;&#20917;&#65292;&#25105;&#21457;&#29616;&#37329;&#34701;&#21361;&#26426;&#23545;&#21046;&#36896;&#19994;&#30340;&#36127;&#38754;&#24433;&#21709;&#27604;&#26381;&#21153;&#19994;&#26356;&#20026;&#26126;&#26174;&#65292;&#23545;&#27431;&#27954;&#19994;&#21153;&#26356;&#20026;&#20005;&#37325;&#65292;&#32780;&#19988;&#36825;&#31181;&#22833;&#35843;&#26159;&#30001;&#20110;&#37329;&#34701;&#32039;&#32553;&#25919;&#31574;&#24341;&#36215;&#30340;&#12290;&#36825;&#19968;&#30740;&#31350;&#34920;&#26126;&#65292;&#25919;&#31574;&#24178;&#39044;&#21487;&#33021;&#20250;&#23548;&#33268;&#36164;&#28304;&#37197;&#32622;&#22833;&#35843;&#65292;&#25439;&#23475;&#25972;&#20307;&#32463;&#27982;&#25928;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper reevaluates the conventional approach to quantifying within-industry resource misallocation, typically measured by the dispersion of an input marginal product. My findings suggest that this statistic incorporates inherent productivity heterogeneity and idiosyncratic productivity shocks, irrespective of the input under scrutiny. Using balance sheet data from American and European manufacturing firms, I show that total factor productivity (TFP) volatility accounts for 7% of the variance in the marginal product of capital, 9% for labor, and 10% for material inputs. Consequently, this index, taken at face value, fails to identify policy-induced misallocation for any production input. To overcome this limitation, I propose a comparative analysis strategy driven by an identified policy variation. This approach allows the researcher to assess induced misallocation in relative terms whilst controlling for differences in TFP volatility. I show that the financial crisis had an uneven 
&lt;/p&gt;</description></item></channel></rss>