<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#26041;&#27861;&#65292;&#21487;&#20197;&#22312;&#23616;&#37096;&#25237;&#24433;&#20013;&#24341;&#20837;&#39640;&#32500;&#21327;&#21464;&#37327;&#65292;&#32780;&#19981;&#20381;&#36182;&#20110;&#31232;&#30095;&#24615;&#20551;&#35774;&#12290;&#36825;&#31181;&#26041;&#27861;&#22312;&#20914;&#20987;&#21709;&#24212;&#20998;&#26512;&#20013;&#20855;&#26377;&#31283;&#20581;&#24615;&#21644;&#21487;&#35299;&#37322;&#24615;&#12290;</title><link>https://arxiv.org/abs/2402.07743</link><description>&lt;p&gt;
&#36229;&#36234;&#31232;&#30095;&#24615;&#65306;&#20351;&#29992;&#39640;&#32500;&#21327;&#21464;&#37327;&#30340;&#23616;&#37096;&#25237;&#24433;&#25512;&#26029;
&lt;/p&gt;
&lt;p&gt;
Beyond Sparsity: Local Projections Inference with High-Dimensional Covariates
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.07743
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#26041;&#27861;&#65292;&#21487;&#20197;&#22312;&#23616;&#37096;&#25237;&#24433;&#20013;&#24341;&#20837;&#39640;&#32500;&#21327;&#21464;&#37327;&#65292;&#32780;&#19981;&#20381;&#36182;&#20110;&#31232;&#30095;&#24615;&#20551;&#35774;&#12290;&#36825;&#31181;&#26041;&#27861;&#22312;&#20914;&#20987;&#21709;&#24212;&#20998;&#26512;&#20013;&#20855;&#26377;&#31283;&#20581;&#24615;&#21644;&#21487;&#35299;&#37322;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20914;&#20987;&#21709;&#24212;&#20998;&#26512;&#30740;&#31350;&#32463;&#27982;&#22914;&#20309;&#23545;&#20914;&#20987;&#65288;&#22914;&#21033;&#29575;&#21464;&#21270;&#65289;&#20316;&#20986;&#21453;&#24212;&#65292;&#24182;&#24110;&#21161;&#25919;&#31574;&#21046;&#23450;&#32773;&#31649;&#29702;&#36825;&#20123;&#24433;&#21709;&#12290;&#23613;&#31649;&#24102;&#26377;&#32467;&#26500;&#20551;&#35774;&#30340;&#21521;&#37327;&#33258;&#22238;&#24402;&#27169;&#22411;&#65288;VAR&#65289;&#22312;&#20272;&#35745;&#20914;&#20987;&#21709;&#24212;&#26041;&#38754;&#20256;&#32479;&#19978;&#21344;&#20027;&#23548;&#22320;&#20301;&#65292;&#20294;&#26368;&#36817;&#23616;&#37096;&#25237;&#24433;&#22240;&#20854;&#31283;&#20581;&#24615;&#21644;&#21487;&#35299;&#37322;&#24615;&#32780;&#21463;&#21040;&#20851;&#27880;&#12290;&#25552;&#20986;&#23558;&#35768;&#22810;&#28382;&#21518;&#20316;&#20026;&#25511;&#21046;&#21464;&#37327;&#30340;&#26041;&#27861;&#26469;&#22686;&#24378;&#31283;&#20581;&#24615;&#65292;&#24182;&#19988;&#21253;&#21547;&#26356;&#20016;&#23500;&#30340;&#25511;&#21046;&#21464;&#37327;&#26377;&#21161;&#20110;&#35299;&#37322;&#20854;&#20316;&#20026;&#22240;&#26524;&#21442;&#25968;&#30340;&#21547;&#20041;&#12290;&#22312;&#36825;&#20004;&#31181;&#24773;&#20917;&#19979;&#65292;&#22823;&#37327;&#25511;&#21046;&#21464;&#37327;&#30340;&#32771;&#34385;&#20351;&#24471;&#39640;&#32500;&#25216;&#26415;&#25104;&#20026;&#24517;&#35201;&#12290;&#23613;&#31649;&#23384;&#22312;&#20687;LASSO&#36825;&#26679;&#30340;&#26041;&#27861;&#65292;&#20294;&#23427;&#20204;&#22823;&#22810;&#20381;&#36182;&#20110;&#31232;&#30095;&#24615;&#20551;&#35774;-&#22823;&#22810;&#25968;&#21442;&#25968;&#20026;&#38646;&#65292;&#36825;&#22312;&#23494;&#38598;&#25968;&#25454;&#29983;&#25104;&#36807;&#31243;&#20013;&#26377;&#23616;&#38480;&#24615;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22312;&#23616;&#37096;&#25237;&#24433;&#20013;&#32467;&#21512;&#39640;&#32500;&#21327;&#21464;&#37327;&#30340;&#26032;&#26041;&#27861;&#65292;&#32780;&#19981;&#20381;&#36182;&#20110;&#31232;&#30095;&#24615;&#20551;&#35774;&#12290;
&lt;/p&gt;
&lt;p&gt;
Impulse response analysis studies how the economy responds to shocks, such as changes in interest rates, and helps policymakers manage these effects. While Vector Autoregression Models (VARs) with structural assumptions have traditionally dominated the estimation of impulse responses, local projections, the projection of future responses on current shock, have recently gained attention for their robustness and interpretability. Including many lags as controls is proposed as a means of robustness, and including a richer set of controls helps in its interpretation as a causal parameter. In both cases, an extensive number of controls leads to the consideration of high-dimensional techniques. While methods like LASSO exist, they mostly rely on sparsity assumptions - most of the parameters are exactly zero, which has limitations in dense data generation processes. This paper proposes a novel approach that incorporates high-dimensional covariates in local projections without relying on spars
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#22522;&#20110;&#26426;&#22120;&#23398;&#20064;&#31639;&#27861;&#30340;&#39044;&#27979;&#27169;&#22411;&#65292;&#21487;&#20197;&#26681;&#25454;&#27178;&#26029;&#38754;&#21644;&#32437;&#21521;&#25968;&#25454;&#39044;&#27979;&#20219;&#20309;&#20154;&#32676;&#25110;&#23376;&#20154;&#32676;&#30340;&#29305;&#24449;&#65292;&#24182;&#20998;&#26512;&#20102;&#22312;&#23454;&#38469;&#29983;&#27963;&#20013;&#26356;&#37325;&#35201;&#30340;&#32972;&#26223;&#19979;&#30340;&#24615;&#33021;&#12290;</title><link>https://arxiv.org/abs/2402.07521</link><description>&lt;p&gt;
&#26426;&#22120;&#23398;&#20064;&#19982;&#23567;&#21306;&#22495;&#20272;&#35745;&#30340;&#25972;&#21512;&#27493;&#39588;
&lt;/p&gt;
&lt;p&gt;
A step towards the integration of machine learning and small area estimation
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.07521
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#22522;&#20110;&#26426;&#22120;&#23398;&#20064;&#31639;&#27861;&#30340;&#39044;&#27979;&#27169;&#22411;&#65292;&#21487;&#20197;&#26681;&#25454;&#27178;&#26029;&#38754;&#21644;&#32437;&#21521;&#25968;&#25454;&#39044;&#27979;&#20219;&#20309;&#20154;&#32676;&#25110;&#23376;&#20154;&#32676;&#30340;&#29305;&#24449;&#65292;&#24182;&#20998;&#26512;&#20102;&#22312;&#23454;&#38469;&#29983;&#27963;&#20013;&#26356;&#37325;&#35201;&#30340;&#32972;&#26223;&#19979;&#30340;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26426;&#22120;&#23398;&#20064;&#25216;&#26415;&#30340;&#24212;&#29992;&#24050;&#32463;&#22312;&#35768;&#22810;&#30740;&#31350;&#39046;&#22495;&#24471;&#21040;&#20102;&#21457;&#23637;&#12290;&#30446;&#21069;&#65292;&#22312;&#32479;&#35745;&#23398;&#20013;&#65292;&#21253;&#25324;&#27491;&#24335;&#32479;&#35745;&#23398;&#22312;&#20869;&#65292;&#20063;&#24191;&#27867;&#24212;&#29992;&#20110;&#25968;&#25454;&#25910;&#38598;&#65288;&#22914;&#21355;&#26143;&#22270;&#20687;&#12289;&#32593;&#32476;&#29228;&#21462;&#21644;&#25991;&#26412;&#25366;&#25496;&#12289;&#25968;&#25454;&#28165;&#27927;&#12289;&#38598;&#25104;&#21644;&#25554;&#34917;&#65289;&#20197;&#21450;&#25968;&#25454;&#20998;&#26512;&#12290;&#28982;&#32780;&#65292;&#22312;&#35843;&#26597;&#25277;&#26679;&#21253;&#25324;&#23567;&#21306;&#22495;&#20272;&#35745;&#26041;&#38754;&#65292;&#36825;&#20123;&#26041;&#27861;&#30340;&#20351;&#29992;&#20173;&#28982;&#38750;&#24120;&#26377;&#38480;&#12290;&#22240;&#27492;&#65292;&#25105;&#20204;&#25552;&#20986;&#19968;&#20010;&#30001;&#36825;&#20123;&#31639;&#27861;&#25903;&#25345;&#30340;&#39044;&#27979;&#27169;&#22411;&#65292;&#21487;&#20197;&#26681;&#25454;&#27178;&#26029;&#38754;&#21644;&#32437;&#21521;&#25968;&#25454;&#39044;&#27979;&#20219;&#20309;&#20154;&#32676;&#25110;&#23376;&#20154;&#32676;&#30340;&#29305;&#24449;&#12290;&#26426;&#22120;&#23398;&#20064;&#26041;&#27861;&#24050;&#32463;&#26174;&#31034;&#20986;&#22312;&#35782;&#21035;&#21644;&#24314;&#27169;&#21464;&#37327;&#20043;&#38388;&#22797;&#26434;&#21644;&#38750;&#32447;&#24615;&#20851;&#31995;&#26041;&#38754;&#38750;&#24120;&#24378;&#22823;&#65292;&#36825;&#24847;&#21619;&#30528;&#22312;&#24378;&#28872;&#20559;&#31163;&#32463;&#20856;&#20551;&#35774;&#30340;&#24773;&#20917;&#19979;&#65292;&#23427;&#20204;&#20855;&#26377;&#38750;&#24120;&#22909;&#30340;&#24615;&#33021;&#12290;&#22240;&#27492;&#65292;&#25105;&#20204;&#20998;&#26512;&#20102;&#25105;&#20204;&#30340;&#27169;&#22411;&#22312;&#19968;&#31181;&#19981;&#21516;&#30340;&#32972;&#26223;&#19979;&#30340;&#34920;&#29616;&#65292;&#36825;&#20010;&#32972;&#26223;&#22312;&#25105;&#20204;&#30475;&#26469;&#22312;&#23454;&#38469;&#29983;&#27963;&#20013;&#26356;&#37325;&#35201;&#12290;
&lt;/p&gt;
&lt;p&gt;
The use of machine-learning techniques has grown in numerous research areas. Currently, it is also widely used in statistics, including the official statistics for data collection (e.g. satellite imagery, web scraping and text mining, data cleaning, integration and imputation) but also for data analysis. However, the usage of these methods in survey sampling including small area estimation is still very limited. Therefore, we propose a predictor supported by these algorithms which can be used to predict any population or subpopulation characteristics based on cross-sectional and longitudinal data. Machine learning methods have already been shown to be very powerful in identifying and modelling complex and nonlinear relationships between the variables, which means that they have very good properties in case of strong departures from the classic assumptions. Therefore, we analyse the performance of our proposal under a different set-up, in our opinion of greater importance in real-life s
&lt;/p&gt;</description></item><item><title>&#25105;&#20204;&#25552;&#20986;&#20102;HALO&#27861;&#35268;&#27169;&#24335;&#65292;&#20351;&#29992;&#28608;&#32032;&#20998;&#26512;&#26469;&#35843;&#33410;&#20154;&#24037;&#26234;&#33021;&#30340;&#34892;&#20026;&#27169;&#24335;&#65292;&#20197;&#35299;&#20915;&#20215;&#20540;&#35013;&#36733;&#38382;&#39064;&#20013;&#30340;&#8220;&#22238;&#24418;&#38024;&#26368;&#22823;&#21270;&#22120;&#8221;&#22330;&#26223;&#12290;</title><link>https://arxiv.org/abs/2402.07462</link><description>&lt;p&gt;
&#20215;&#20540;&#35013;&#36733;&#38382;&#39064;&#30340;&#28608;&#32032;&#36866;&#24212;&#26041;&#27861;&#65306;&#39044;&#38450;&#22238;&#24418;&#38024;&#21551;&#31034;&#24405;&#65311;
&lt;/p&gt;
&lt;p&gt;
A Hormetic Approach to the Value-Loading Problem: Preventing the Paperclip Apocalypse?
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.07462
&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;HALO&#27861;&#35268;&#27169;&#24335;&#65292;&#20351;&#29992;&#28608;&#32032;&#20998;&#26512;&#26469;&#35843;&#33410;&#20154;&#24037;&#26234;&#33021;&#30340;&#34892;&#20026;&#27169;&#24335;&#65292;&#20197;&#35299;&#20915;&#20215;&#20540;&#35013;&#36733;&#38382;&#39064;&#20013;&#30340;&#8220;&#22238;&#24418;&#38024;&#26368;&#22823;&#21270;&#22120;&#8221;&#22330;&#26223;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20215;&#20540;&#35013;&#36733;&#38382;&#39064;&#23545;&#20110;&#30740;&#31350;&#20154;&#21592;&#26469;&#35828;&#26159;&#19968;&#20010;&#37325;&#35201;&#30340;&#25361;&#25112;&#65292;&#20182;&#20204;&#26088;&#22312;&#21019;&#24314;&#19982;&#20154;&#31867;&#20215;&#20540;&#35266;&#21644;&#20559;&#22909;&#30456;&#19968;&#33268;&#30340;&#20154;&#24037;&#26234;&#33021;&#31995;&#32479;&#12290;&#35813;&#38382;&#39064;&#38656;&#35201;&#19968;&#31181;&#26041;&#27861;&#26469;&#23450;&#20041;&#21644;&#35268;&#33539;&#20154;&#24037;&#26234;&#33021;&#34892;&#20026;&#30340;&#23433;&#20840;&#21644;&#26368;&#20248;&#38480;&#21046;&#12290;&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;HALO&#65288;&#28608;&#32032;&#36866;&#24212;&#36890;&#36807;&#23545;&#25163;&#36807;&#31243;&#65289;&#36825;&#20010;&#27861;&#35268;&#27169;&#24335;&#65292;&#23427;&#20351;&#29992;&#28608;&#32032;&#20998;&#26512;&#26469;&#35843;&#33410;&#20154;&#24037;&#26234;&#33021;&#30340;&#34892;&#20026;&#27169;&#24335;&#12290;&#34892;&#20026;&#28608;&#32032;&#36866;&#24212;&#26159;&#19968;&#31181;&#29616;&#35937;&#65292;&#20302;&#39057;&#29575;&#30340;&#34892;&#20026;&#20855;&#26377;&#30410;&#22788;&#65292;&#32780;&#39640;&#39057;&#29575;&#30340;&#34892;&#20026;&#21017;&#26377;&#23475;&#12290;&#36890;&#36807;&#23558;&#34892;&#20026;&#24314;&#27169;&#20026;&#21464;&#24577;&#23545;&#25163;&#36807;&#31243;&#65292;&#25105;&#20204;&#21487;&#20197;&#20351;&#29992;&#34892;&#20026;&#39057;&#29575;&#21709;&#24212;&#20998;&#26512;&#65288;BFRA&#65289;&#25110;&#34892;&#20026;&#35745;&#25968;&#21709;&#24212;&#20998;&#26512;&#65288;BCRA&#65289;&#26469;&#37327;&#21270;&#21487;&#37325;&#22797;&#34892;&#20026;&#30340;&#28608;&#32032;&#38480;&#21046;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#22914;&#20309;&#20351;&#29992;HALO&#26469;&#35299;&#20915;&#8220;&#22238;&#24418;&#38024;&#26368;&#22823;&#21270;&#22120;&#8221;&#22330;&#26223;&#65292;&#36825;&#26159;&#19968;&#20010;&#24605;&#24819;&#23454;&#39564;&#65292;&#20854;&#20013;&#19968;&#20010;&#26410;&#21463;&#31649;&#21046;&#30340;&#20154;&#24037;&#26234;&#33021;&#20219;&#21153;&#26159;&#23558;&#25152;&#26377;&#29289;&#36136;&#36716;&#21270;&#20026;&#22238;&#24418;&#38024;&#12290;
&lt;/p&gt;
&lt;p&gt;
The value-loading problem is a significant challenge for researchers aiming to create artificial intelligence (AI) systems that align with human values and preferences. This problem requires a method to define and regulate safe and optimal limits of AI behaviors. In this work, we propose HALO (Hormetic ALignment via Opponent processes), a regulatory paradigm that uses hormetic analysis to regulate the behavioral patterns of AI. Behavioral hormesis is a phenomenon where low frequencies of a behavior have beneficial effects, while high frequencies are harmful. By modeling behaviors as allostatic opponent processes, we can use either Behavioral Frequency Response Analysis (BFRA) or Behavioral Count Response Analysis (BCRA) to quantify the hormetic limits of repeatable behaviors. We demonstrate how HALO can solve the 'paperclip maximizer' scenario, a thought experiment where an unregulated AI tasked with making paperclips could end up converting all matter in the universe into paperclips. 
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#24182;&#34892;&#30340;&#39044;&#31639;&#25511;&#21046;&#30340;A/B&#27979;&#35797;&#35774;&#35745;&#65292;&#36890;&#36807;&#24066;&#22330;&#32454;&#20998;&#30340;&#26041;&#24335;&#22312;&#26356;&#22823;&#30340;&#24066;&#22330;&#20013;&#35782;&#21035;&#23376;&#24066;&#22330;&#65292;&#24182;&#22312;&#27599;&#20010;&#23376;&#24066;&#22330;&#19978;&#36827;&#34892;&#24182;&#34892;&#23454;&#39564;&#12290;</title><link>https://arxiv.org/abs/2402.07322</link><description>&lt;p&gt;
&#31532;&#19968;&#20215;&#25293;&#21334;&#22343;&#34913;&#20013;&#30340;&#24178;&#25200;&#65306;&#20559;&#24046;&#21644;&#26041;&#24046;&#20998;&#26512;
&lt;/p&gt;
&lt;p&gt;
Interference Among First-Price Pacing Equilibria: A Bias and Variance Analysis
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.07322
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#24182;&#34892;&#30340;&#39044;&#31639;&#25511;&#21046;&#30340;A/B&#27979;&#35797;&#35774;&#35745;&#65292;&#36890;&#36807;&#24066;&#22330;&#32454;&#20998;&#30340;&#26041;&#24335;&#22312;&#26356;&#22823;&#30340;&#24066;&#22330;&#20013;&#35782;&#21035;&#23376;&#24066;&#22330;&#65292;&#24182;&#22312;&#27599;&#20010;&#23376;&#24066;&#22330;&#19978;&#36827;&#34892;&#24182;&#34892;&#23454;&#39564;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#20114;&#32852;&#32593;&#34892;&#19994;&#20013;&#65292;&#22312;&#32447;A/B&#27979;&#35797;&#34987;&#24191;&#27867;&#29992;&#20110;&#20915;&#31574;&#26032;&#21151;&#33021;&#30340;&#25512;&#20986;&#12290;&#28982;&#32780;&#23545;&#20110;&#22312;&#32447;&#24066;&#22330;&#65288;&#22914;&#24191;&#21578;&#24066;&#22330;&#65289;&#65292;&#26631;&#20934;&#30340;A/B&#27979;&#35797;&#26041;&#27861;&#21487;&#33021;&#23548;&#33268;&#32467;&#26524;&#20986;&#29616;&#20559;&#24046;&#65292;&#22240;&#20026;&#20080;&#23478;&#22312;&#39044;&#31639;&#32422;&#26463;&#19979;&#36816;&#20316;&#65292;&#35797;&#39564;&#32452;&#30340;&#39044;&#31639;&#28040;&#32791;&#20250;&#24433;&#21709;&#23545;&#29031;&#32452;&#30340;&#34920;&#29616;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#31181;&#24178;&#25200;&#65292;&#21487;&#20197;&#37319;&#29992;&#8220;&#39044;&#31639;&#20998;&#21106;&#35774;&#35745;&#8221;&#65292;&#21363;&#27599;&#20010;&#23454;&#39564;&#32452;&#37117;&#26377;&#19968;&#20010;&#29420;&#31435;&#30340;&#39044;&#31639;&#32422;&#26463;&#65292;&#24182;&#19988;&#27599;&#20010;&#23454;&#39564;&#32452;&#25509;&#25910;&#30456;&#31561;&#30340;&#39044;&#31639;&#20221;&#39069;&#65292;&#20174;&#32780;&#23454;&#29616;&#8220;&#39044;&#31639;&#25511;&#21046;&#30340;A/B&#27979;&#35797;&#8221;&#12290;&#23613;&#31649;&#39044;&#31639;&#25511;&#21046;&#30340;A/B&#27979;&#35797;&#26377;&#26126;&#26174;&#30340;&#20248;&#21183;&#65292;&#20294;&#24403;&#39044;&#31639;&#20998;&#21106;&#24471;&#22826;&#23567;&#26102;&#65292;&#24615;&#33021;&#20250;&#19979;&#38477;&#65292;&#38480;&#21046;&#20102;&#36825;&#31181;&#31995;&#32479;&#30340;&#24635;&#21534;&#21520;&#37327;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#24182;&#34892;&#30340;&#39044;&#31639;&#25511;&#21046;&#30340;A/B&#27979;&#35797;&#35774;&#35745;&#65292;&#36890;&#36807;&#24066;&#22330;&#32454;&#20998;&#30340;&#26041;&#24335;&#22312;&#26356;&#22823;&#30340;&#24066;&#22330;&#20013;&#35782;&#21035;&#23376;&#24066;&#22330;&#65292;&#24182;&#22312;&#27599;&#20010;&#23376;&#24066;&#22330;&#19978;&#36827;&#34892;&#24182;&#34892;&#23454;&#39564;&#12290;&#25105;&#20204;&#30340;&#36129;&#29486;&#22914;&#19979;&#65306;&#39318;&#20808;&#65292;&#24341;&#20837;&#20102;&#19968;&#31181;&#26032;&#30340;&#26041;&#27861;&#26469;&#20998;&#26512;&#31532;&#19968;&#20215;&#25293;&#21334;&#30340;&#22343;&#34913;&#29366;&#20917;&#65292;&#25581;&#31034;&#20102;&#20854;&#20013;&#30340;&#20559;&#24046;&#21644;&#26041;&#24046;&#12290;
&lt;/p&gt;
&lt;p&gt;
Online A/B testing is widely used in the internet industry to inform decisions on new feature roll-outs. For online marketplaces (such as advertising markets), standard approaches to A/B testing may lead to biased results when buyers operate under a budget constraint, as budget consumption in one arm of the experiment impacts performance of the other arm. To counteract this interference, one can use a budget-split design where the budget constraint operates on a per-arm basis and each arm receives an equal fraction of the budget, leading to ``budget-controlled A/B testing.'' Despite clear advantages of budget-controlled A/B testing, performance degrades when budget are split too small, limiting the overall throughput of such systems. In this paper, we propose a parallel budget-controlled A/B testing design where we use market segmentation to identify submarkets in the larger market, and we run parallel experiments on each submarket.   Our contributions are as follows: First, we introdu
&lt;/p&gt;</description></item><item><title>&#35813;&#30740;&#31350;&#35780;&#20272;&#20102;K-12&#23398;&#26657;&#22312;&#23485;&#24102;&#20114;&#32852;&#32593;&#37319;&#36141;&#20013;&#36890;&#36807;&#25414;&#32465;&#38656;&#27714;&#30340;&#25928;&#26524;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#21442;&#19982;&#32773;&#30340;&#20215;&#26684;&#24179;&#22343;&#19979;&#38477;&#20102;&#19977;&#20998;&#20043;&#19968;&#65292;&#36141;&#20080;&#30340;&#23485;&#24102;&#36895;&#24230;&#22686;&#21152;&#20102;&#20845;&#20493;&#12290;&#21442;&#19982;&#23398;&#26657;&#33410;&#30465;&#30340;&#37329;&#39069;&#33267;&#23569;&#31561;&#20110;&#32852;&#37030;&#25919;&#24220;&#30340;&#34917;&#36148;&#37329;&#39069;&#12290;&#26681;&#25454;&#24369;&#20551;&#35774;&#65292;&#21442;&#19982;&#23398;&#26657;&#33719;&#24471;&#20102;&#24040;&#22823;&#30340;&#31119;&#21033;&#25552;&#21319;&#12290;</title><link>https://arxiv.org/abs/2402.07277</link><description>&lt;p&gt;
K-12&#23485;&#24102;&#37319;&#36141;&#20013;&#30340;&#38656;&#27714;&#25414;&#32465;&#25928;&#24212;
&lt;/p&gt;
&lt;p&gt;
Bundling Demand in K-12 Broadband Procurement
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.07277
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#35780;&#20272;&#20102;K-12&#23398;&#26657;&#22312;&#23485;&#24102;&#20114;&#32852;&#32593;&#37319;&#36141;&#20013;&#36890;&#36807;&#25414;&#32465;&#38656;&#27714;&#30340;&#25928;&#26524;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#21442;&#19982;&#32773;&#30340;&#20215;&#26684;&#24179;&#22343;&#19979;&#38477;&#20102;&#19977;&#20998;&#20043;&#19968;&#65292;&#36141;&#20080;&#30340;&#23485;&#24102;&#36895;&#24230;&#22686;&#21152;&#20102;&#20845;&#20493;&#12290;&#21442;&#19982;&#23398;&#26657;&#33410;&#30465;&#30340;&#37329;&#39069;&#33267;&#23569;&#31561;&#20110;&#32852;&#37030;&#25919;&#24220;&#30340;&#34917;&#36148;&#37329;&#39069;&#12290;&#26681;&#25454;&#24369;&#20551;&#35774;&#65292;&#21442;&#19982;&#23398;&#26657;&#33719;&#24471;&#20102;&#24040;&#22823;&#30340;&#31119;&#21033;&#25552;&#21319;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#35780;&#20272;&#20102;K-12&#23398;&#26657;&#36890;&#36807;&#25414;&#32465;&#38656;&#27714;&#33719;&#24471;&#23485;&#24102;&#20114;&#32852;&#32593;&#30340;&#25928;&#26524;&#12290;2014&#24180;&#65292;&#26032;&#27901;&#35199;&#24030;&#20174;&#20998;&#25955;&#30340;&#37319;&#36141;&#26041;&#24335;&#36716;&#21464;&#20026;&#23558;&#23398;&#26657;&#20998;&#20026;&#22235;&#20010;&#21306;&#22495;&#32452;&#21512;&#30340;&#26032;&#37319;&#36141;&#31995;&#32479;&#12290;&#37319;&#29992;&#20107;&#20214;&#30740;&#31350;&#26041;&#27861;&#65292;&#25105;&#20204;&#21457;&#29616;&#21442;&#19982;&#32773;&#30340;&#20215;&#26684;&#24179;&#22343;&#19979;&#38477;&#20102;&#19977;&#20998;&#20043;&#19968;&#65292;&#36141;&#20080;&#30340;&#23485;&#24102;&#36895;&#24230;&#22686;&#21152;&#20102;&#20845;&#20493;&#12290;&#25105;&#20204;&#23545;&#35813;&#35745;&#21010;&#23548;&#33268;&#30340;&#23398;&#26657;&#25903;&#20986;&#21464;&#21270;&#36827;&#34892;&#20102;&#30028;&#23450;&#65292;&#21457;&#29616;&#21442;&#19982;&#32773;&#33410;&#30465;&#30340;&#37329;&#39069;&#33267;&#23569;&#31561;&#20110;&#20182;&#20204;&#20174;&#32852;&#37030;&#25919;&#24220;&#33719;&#24471;&#30340;"E-rate"&#34917;&#36148;&#24635;&#39069;&#12290;&#22312;&#23545;&#38656;&#27714;&#36827;&#34892;&#24369;&#20551;&#35774;&#30340;&#24773;&#20917;&#19979;&#65292;&#25105;&#20204;&#34920;&#26126;&#21442;&#19982;&#23398;&#26657;&#33719;&#24471;&#20102;&#24040;&#22823;&#30340;&#31119;&#21033;&#25552;&#21319;&#12290;
&lt;/p&gt;
&lt;p&gt;
We evaluate the effects of bundling demand for broadband internet by K-12 schools. In 2014, New Jersey switched from decentralized procurements to a new procurement system that bundled schools into four regional groups. Using an event study approach, we find that, on average, prices for participants decreased by one-third, and broadband speed purchased increased sixfold. We bound the change in school expenditures due to the program and find that participants saved at least as much as their total "E-rate" subsidy from the federal government. Under weak assumptions on demand, we show that participating schools experienced large welfare gains.
&lt;/p&gt;</description></item><item><title>&#32654;&#22269;&#36135;&#24065;&#25919;&#31574;&#32039;&#32553;&#23545;&#26032;&#20852;&#24066;&#22330;&#20135;&#20986;&#20135;&#29983;&#26174;&#33879;&#24433;&#21709;&#65292;&#23588;&#20854;&#26159;&#24403;&#20276;&#38543;&#30528;&#36135;&#24065;&#25919;&#31574;&#19981;&#30830;&#23450;&#24615;&#30340;&#22686;&#21152;&#26102;&#65292;&#34920;&#29616;&#20986;&#26356;&#22823;&#30340;&#12289;&#26356;&#25345;&#20037;&#30340;&#19979;&#38477;&#12290;&#20840;&#29699;&#36152;&#26131;&#19968;&#20307;&#21270;&#36827;&#19968;&#27493;&#21152;&#21095;&#20102;&#36825;&#31181;&#24433;&#21709;&#12290;</title><link>https://arxiv.org/abs/2402.07266</link><description>&lt;p&gt;
&#32654;&#22269;&#36135;&#24065;&#25919;&#31574;&#23545;&#26032;&#20852;&#24066;&#22330;&#30340;&#28322;&#20986;&#25928;&#24212;&#8212;&#8212;&#19981;&#30830;&#23450;&#24615;&#20043;&#38469;&#30340;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Spillover Effects of US Monetary Policy on Emerging Markets Amidst Uncertainty
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.07266
&lt;/p&gt;
&lt;p&gt;
&#32654;&#22269;&#36135;&#24065;&#25919;&#31574;&#32039;&#32553;&#23545;&#26032;&#20852;&#24066;&#22330;&#20135;&#20986;&#20135;&#29983;&#26174;&#33879;&#24433;&#21709;&#65292;&#23588;&#20854;&#26159;&#24403;&#20276;&#38543;&#30528;&#36135;&#24065;&#25919;&#31574;&#19981;&#30830;&#23450;&#24615;&#30340;&#22686;&#21152;&#26102;&#65292;&#34920;&#29616;&#20986;&#26356;&#22823;&#30340;&#12289;&#26356;&#25345;&#20037;&#30340;&#19979;&#38477;&#12290;&#20840;&#29699;&#36152;&#26131;&#19968;&#20307;&#21270;&#36827;&#19968;&#27493;&#21152;&#21095;&#20102;&#36825;&#31181;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#21033;&#29992;&#20840;&#29699;&#21521;&#37327;&#33258;&#22238;&#24402;&#27169;&#22411;&#21644;&#38543;&#26426;&#27874;&#21160;&#29575;&#65292;&#30740;&#31350;&#32654;&#22269;&#36135;&#24065;&#25919;&#31574;&#32039;&#32553;&#23545;&#26032;&#20852;&#24066;&#22330;&#30340;&#24433;&#21709;&#65292;&#21306;&#20998;&#20102;&#30452;&#25509;&#21644;&#38388;&#25509;&#30340;&#28322;&#20986;&#25928;&#24212;&#12290;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;&#32654;&#22269;&#21033;&#29575;&#30340;&#19978;&#21319;&#26174;&#33879;&#38477;&#20302;&#26032;&#20852;&#24066;&#22330;&#30340;&#20135;&#20986;&#65292;&#23548;&#33268;&#36739;&#22823;&#12289;&#36739;&#38271;&#21644;&#25345;&#20037;&#30340;&#19979;&#38477;&#12290;&#20840;&#29699;&#36152;&#26131;&#19968;&#20307;&#21270;&#36827;&#19968;&#27493;&#22686;&#24378;&#20102;&#36825;&#31181;&#24433;&#21709;&#65292;&#23548;&#33268;&#20135;&#20986;&#19979;&#38477;&#26356;&#21152;&#21095;&#28872;&#20294;&#31245;&#24494;&#26356;&#24555;&#22320;&#22238;&#24377;&#12290;&#24403;&#32654;&#22269;&#36135;&#24065;&#25919;&#31574;&#32039;&#32553;&#20276;&#38543;&#30528;&#36135;&#24065;&#25919;&#31574;&#19981;&#30830;&#23450;&#24615;&#30340;&#22686;&#21152;&#26102;&#65292;&#28322;&#20986;&#25928;&#24212;&#26174;&#33879;&#25918;&#22823;&#12290;&#26368;&#21518;&#65292;&#26032;&#20852;&#24066;&#22330;&#23545;&#32654;&#22269;&#36135;&#24065;&#25919;&#31574;&#20914;&#20987;&#30340;&#21453;&#24212;&#23384;&#22312;&#26174;&#33879;&#30340;&#24322;&#36136;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper examines the impact of US monetary policy tightening on emerging markets, distinguishing between direct and indirect spillover effects using the global vector autoregression with stochastic volatility covering 32 countries. The paper demonstrates that an increase in the US interest rate significantly reduces output for emerging markets, leading to larger, more prolonged, and persistent declines. Such an impact is further intensified by global trade integration, causing a sharper yet slightly quicker rebounding output drop. The spillover effects are significantly amplified when US monetary policy tightening is accompanied by an increase in monetary policy uncertainty. Finally, emerging markets exhibit considerable heterogeneity in their responses to US monetary policy shocks.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#21457;&#29616;&#32654;&#22269;&#22269;&#31435;&#21355;&#29983;&#30740;&#31350;&#38498;&#65288;NIH&#65289;&#25320;&#27454;&#24310;&#36831;&#23545;&#30740;&#31350;&#20154;&#21592;&#32844;&#19994;&#21457;&#23637;&#20135;&#29983;&#20102;&#26174;&#33879;&#24433;&#21709;&#65292;&#21253;&#25324;&#22686;&#21152;&#20102;&#26410;&#22312;&#32654;&#22269;&#23601;&#19994;&#30340;&#27010;&#29575;&#12289;&#27704;&#20037;&#31163;&#24320;&#32654;&#22269;&#30340;&#36235;&#21183;&#20197;&#21450;&#21457;&#34920;&#25991;&#31456;&#30340;&#21487;&#33021;&#24615;&#38477;&#20302;&#12290;&#21463;&#24433;&#21709;&#30340;&#20154;&#21592;&#22312;&#32487;&#32493;&#22312;&#32654;&#22269;&#24037;&#20316;&#26102;&#30340;&#25910;&#20837;&#20063;&#19979;&#38477;&#20102;20%&#12290;</title><link>https://arxiv.org/abs/2402.07235</link><description>&lt;p&gt;
&#31185;&#23398;&#20154;&#25165;&#27969;&#22833;&#19982;&#36164;&#37329;&#32570;&#21475;
&lt;/p&gt;
&lt;p&gt;
Scientific Talent Leaks Out of Funding Gaps
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.07235
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#21457;&#29616;&#32654;&#22269;&#22269;&#31435;&#21355;&#29983;&#30740;&#31350;&#38498;&#65288;NIH&#65289;&#25320;&#27454;&#24310;&#36831;&#23545;&#30740;&#31350;&#20154;&#21592;&#32844;&#19994;&#21457;&#23637;&#20135;&#29983;&#20102;&#26174;&#33879;&#24433;&#21709;&#65292;&#21253;&#25324;&#22686;&#21152;&#20102;&#26410;&#22312;&#32654;&#22269;&#23601;&#19994;&#30340;&#27010;&#29575;&#12289;&#27704;&#20037;&#31163;&#24320;&#32654;&#22269;&#30340;&#36235;&#21183;&#20197;&#21450;&#21457;&#34920;&#25991;&#31456;&#30340;&#21487;&#33021;&#24615;&#38477;&#20302;&#12290;&#21463;&#24433;&#21709;&#30340;&#20154;&#21592;&#22312;&#32487;&#32493;&#22312;&#32654;&#22269;&#24037;&#20316;&#26102;&#30340;&#25910;&#20837;&#20063;&#19979;&#38477;&#20102;20%&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;&#32654;&#22269;&#22269;&#31435;&#21355;&#29983;&#30740;&#31350;&#38498;&#65288;NIH&#65289;&#25320;&#27454;&#24310;&#36831;&#23545;&#30740;&#31350;&#20154;&#21592;&#32844;&#19994;&#21457;&#23637;&#30340;&#24433;&#21709;&#12290;&#21033;&#29992;&#19982;&#22823;&#23398;&#20132;&#26131;&#25968;&#25454;&#30456;&#36830;&#30340;&#20840;&#38754;&#25910;&#20837;&#21644;&#31246;&#25910;&#35760;&#24405;&#65292;&#20197;&#21450;&#24046;&#24322;&#24615;&#21453;&#24046;&#35774;&#35745;&#65292;&#25105;&#20204;&#21457;&#29616;&#36229;&#36807;30&#22825;&#30340;&#25320;&#27454;&#20013;&#26029;&#23545;&#20110;&#22312;&#21482;&#33719;&#24471;&#19968;&#39033;NIH R01&#30740;&#31350;&#25320;&#27454;&#30340;&#23454;&#39564;&#23460;&#24037;&#20316;&#30340;&#20154;&#21592;&#30340;&#23601;&#19994;&#23433;&#32622;&#26377;&#30528;&#26174;&#33879;&#24433;&#21709;&#65292;&#21253;&#25324;&#26410;&#22312;&#32654;&#22269;&#23601;&#19994;&#30340;&#27010;&#29575;&#22686;&#21152;3&#20010;&#30334;&#20998;&#28857;&#65288;40%&#65289;&#12290;&#32467;&#21512;&#20840;&#38754;&#30340;2020&#20154;&#21475;&#26222;&#26597;&#25968;&#25454;&#21644;&#20986;&#29256;&#29289;&#25968;&#25454;&#65292;&#25105;&#20204;&#21457;&#29616;&#26377;&#22823;&#32422;&#19968;&#21322;&#20915;&#23450;&#19981;&#23601;&#19994;&#30340;&#20154;&#20284;&#20046;&#27704;&#20037;&#31163;&#24320;&#32654;&#22269;&#65292;&#24182;&#19988;&#21457;&#34920;&#25991;&#31456;&#30340;&#21487;&#33021;&#24615;&#38477;&#20302;&#20102;90%&#65292;&#23545;&#20110;&#22521;&#35757;&#20154;&#21592;&#65288;&#21338;&#22763;&#21518;&#21644;&#30740;&#31350;&#29983;&#65289;&#30340;&#24433;&#21709;&#26356;&#22823;&#12290;&#22312;&#32487;&#32493;&#22312;&#32654;&#22269;&#24037;&#20316;&#30340;&#20154;&#21592;&#20013;&#65292;&#25105;&#20204;&#21457;&#29616;&#20013;&#26029;&#30340;&#20154;&#21592;&#30340;&#25910;&#20837;&#30456;&#27604;&#36830;&#32493;&#25320;&#27454;&#30340;&#21516;&#34892;&#19979;&#38477;&#20102;20%&#65292;&#20854;&#20013;&#19979;&#38477;&#26368;&#20026;&#26174;&#33879;&#30340;&#38598;&#20013;&#22312;&#22521;&#35757;&#20154;&#21592;&#21644;&#20854;&#20182;&#38750;&#25945;&#32844;&#20154;&#21592;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study how delays in NIH grant funding affect the career outcomes of research personnel. Using comprehensive earnings and tax records linked to university transaction data along with a difference-in-differences design, we find that a funding interruption of more than 30 days has a substantial effect on job placements for personnel who work in labs with a single NIH R01 research grant, including a 3 percentage point (40%) increase in the probability of not working in the US. Incorporating information from the full 2020 Decennial Census and data on publications, we find that about half of those induced into nonemployment appear to permanently leave the US and are 90% less likely to publish in a given year, with even larger impacts for trainees (postdocs and graduate students). Among personnel who continue to work in the US, we find that interrupted personnel earn 20% less than their continuously-funded peers, with the largest declines concentrated among trainees and other non-faculty p
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#20998;&#26512;&#20102;&#26085;&#26412;&#12289;&#20854;&#20182;&#22269;&#23478;&#21644;&#22269;&#38469;&#21407;&#23376;&#33021;&#26426;&#26500;&#22312;&#31119;&#23707;&#26680;&#24223;&#27700;&#25490;&#25918;&#20915;&#31574;&#20013;&#30340;&#25112;&#30053;&#20114;&#21160;&#65292;&#25581;&#31034;&#20102;&#26102;&#38388;&#24310;&#36831;&#23545;&#20915;&#31574;&#31283;&#23450;&#24615;&#21644;&#28436;&#21270;&#36712;&#36857;&#30340;&#26174;&#33879;&#24433;&#21709;&#65292;&#24378;&#35843;&#20102;&#39640;&#25928;&#24223;&#27700;&#22788;&#29702;&#25216;&#26415;&#12289;&#20986;&#21475;&#31246;&#25910;&#25439;&#22833;&#23545;&#26085;&#26412;&#31574;&#30053;&#30340;&#24433;&#21709;&#20197;&#21450;&#22269;&#38469;&#21512;&#20316;&#30340;&#37325;&#35201;&#24615;&#12290;</title><link>https://arxiv.org/abs/2402.07227</link><description>&lt;p&gt;
&#22312;&#31119;&#23707;&#26680;&#24223;&#27700;&#25490;&#25918;&#20915;&#31574;&#32972;&#26223;&#19979;&#65292;&#20851;&#20110;&#26085;&#26412;&#12289;&#20854;&#20182;&#22269;&#23478;&#21644;&#22269;&#38469;&#21407;&#23376;&#33021;&#26426;&#26500;&#20043;&#38388;&#30340;&#24310;&#26102;&#21338;&#24328;&#31574;&#30053;&#20998;&#26512;
&lt;/p&gt;
&lt;p&gt;
Time-Delayed Game Strategy Analysis Among Japan, Other Nations, and the International Atomic Energy Agency in the Context of Fukushima Nuclear Wastewater Discharge Decision
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.07227
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#20998;&#26512;&#20102;&#26085;&#26412;&#12289;&#20854;&#20182;&#22269;&#23478;&#21644;&#22269;&#38469;&#21407;&#23376;&#33021;&#26426;&#26500;&#22312;&#31119;&#23707;&#26680;&#24223;&#27700;&#25490;&#25918;&#20915;&#31574;&#20013;&#30340;&#25112;&#30053;&#20114;&#21160;&#65292;&#25581;&#31034;&#20102;&#26102;&#38388;&#24310;&#36831;&#23545;&#20915;&#31574;&#31283;&#23450;&#24615;&#21644;&#28436;&#21270;&#36712;&#36857;&#30340;&#26174;&#33879;&#24433;&#21709;&#65292;&#24378;&#35843;&#20102;&#39640;&#25928;&#24223;&#27700;&#22788;&#29702;&#25216;&#26415;&#12289;&#20986;&#21475;&#31246;&#25910;&#25439;&#22833;&#23545;&#26085;&#26412;&#31574;&#30053;&#30340;&#24433;&#21709;&#20197;&#21450;&#22269;&#38469;&#21512;&#20316;&#30340;&#37325;&#35201;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#23398;&#26415;&#35770;&#25991;&#26088;&#22312;&#20998;&#26512;&#26085;&#26412;&#12289;&#20854;&#20182;&#22269;&#23478;&#21644;&#22269;&#38469;&#21407;&#23376;&#33021;&#26426;&#26500;&#65288;IAEA&#65289;&#22312;&#31119;&#23707;&#31532;&#19968;&#26680;&#30005;&#31449;&#25490;&#25918;&#32463;&#22788;&#29702;&#30340;&#26680;&#24223;&#27700;&#36827;&#20837;&#28023;&#27915;&#30340;&#20915;&#31574;&#20013;&#30340;&#25112;&#30053;&#20114;&#21160;&#12290;&#23427;&#24341;&#20837;&#20102;&#19968;&#20010;&#25903;&#20184;&#30697;&#38453;&#21644;&#22797;&#21046;&#32773;&#21160;&#24577;&#26041;&#31243;&#20013;&#30340;&#24310;&#26102;&#20803;&#32032;&#65292;&#20197;&#27169;&#25311;&#29616;&#23454;&#19990;&#30028;&#30340;&#20915;&#31574;&#24310;&#36831;&#12290;&#35813;&#35770;&#25991;&#36890;&#36807;&#32447;&#24615;&#21270;&#31995;&#32479;&#30340;&#29305;&#24449;&#26681;&#21644;&#25968;&#20540;&#27169;&#25311;&#20998;&#26512;&#20102;&#31574;&#30053;&#30340;&#31283;&#23450;&#24615;&#21644;&#19981;&#21516;&#31283;&#23450;&#29366;&#24577;&#30340;&#26465;&#20214;&#12290;&#30740;&#31350;&#24471;&#20986;&#32467;&#35770;&#65292;&#26102;&#38388;&#24310;&#36831;&#26174;&#33879;&#24433;&#21709;&#26680;&#24223;&#27700;&#22788;&#29702;&#31574;&#30053;&#30340;&#20915;&#31574;&#31283;&#23450;&#24615;&#21644;&#28436;&#21270;&#36712;&#36857;&#12290;&#30740;&#31350;&#31361;&#20986;&#20102;&#39640;&#25928;&#24223;&#27700;&#22788;&#29702;&#25216;&#26415;&#30340;&#37325;&#35201;&#24615;&#12289;&#20986;&#21475;&#31246;&#25910;&#25439;&#22833;&#23545;&#26085;&#26412;&#31574;&#30053;&#30340;&#24433;&#21709;&#20197;&#21450;&#22269;&#38469;&#21512;&#20316;&#30340;&#20316;&#29992;&#12290;&#30740;&#31350;&#30340;&#21019;&#26032;&#20043;&#22788;&#22312;&#20110;&#23558;&#26469;&#33258;&#28023;&#27915;&#21160;&#21147;&#23398;&#21644;&#25919;&#24220;&#20915;&#31574;&#39046;&#22495;&#30340;&#26102;&#38388;&#24310;&#36831;&#20803;&#32032;&#25972;&#21512;&#36827;&#26469;&#12290;
&lt;/p&gt;
&lt;p&gt;
This academic paper examines the strategic interactions between Japan, other nations, and the International Atomic Energy Agency (IAEA) regarding Japan's decision to release treated nuclear wastewater from the Fukushima Daiichi Nuclear Power Plant into the sea. It introduces a payoff matrix and time-delay elements in replicator dynamic equations to mirror real-world decision-making delays. The paper analyzes the stability of strategies and conditions for different stable states using characteristic roots of a linearized system and numerical simulations. It concludes that time delays significantly affect decision-making stability and evolution trajectories in nuclear wastewater disposal strategies. The study highlights the importance of efficient wastewater treatment technology, the impact of export tax revenue losses on Japan's strategies, and the role of international cooperation. The novelty of the research lies in integrating time-delay elements from ocean dynamics and governmental 
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#21033;&#29992;&#36827;&#21270;&#21338;&#24328;&#35770;&#20998;&#26512;&#20102;&#31119;&#23707;&#26680;&#24223;&#27700;&#25490;&#25918;&#20107;&#20214;&#20013;&#26085;&#26412;&#12289;&#20854;&#20182;&#22269;&#23478;&#21644;&#26085;&#26412;&#28180;&#19994;&#21327;&#20250;&#20043;&#38388;&#30340;&#25112;&#30053;&#21160;&#24577;&#65292;&#30830;&#23450;&#20102;&#19977;&#31181;&#36827;&#21270;&#31283;&#23450;&#31574;&#30053;&#65292;&#24182;&#36890;&#36807;&#25968;&#20540;&#27169;&#25311;&#20998;&#26512;&#12290;&#30740;&#31350;&#32467;&#26524;&#24378;&#35843;&#20102;&#22269;&#38469;&#21512;&#20316;&#12289;&#31185;&#23398;&#30740;&#31350;&#12289;&#20844;&#20247;&#25945;&#32946;&#21644;&#24223;&#27700;&#22788;&#29702;&#26041;&#27861;&#30340;&#37325;&#35201;&#24615;&#12290;</title><link>https://arxiv.org/abs/2402.07210</link><description>&lt;p&gt;
&#31119;&#23707;&#26680;&#24223;&#27700;&#25490;&#25918;&#65306;&#19968;&#31181;&#22522;&#20110;&#36827;&#21270;&#21338;&#24328;&#35770;&#30340;&#22269;&#38469;&#21644;&#22269;&#20869;&#20114;&#21160;&#19982;&#25112;&#30053;&#20915;&#31574;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Fukushima Nuclear Wastewater Discharge: An Evolutionary Game Theory Approach to International and Domestic Interaction and Strategic Decision-Making
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.07210
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#21033;&#29992;&#36827;&#21270;&#21338;&#24328;&#35770;&#20998;&#26512;&#20102;&#31119;&#23707;&#26680;&#24223;&#27700;&#25490;&#25918;&#20107;&#20214;&#20013;&#26085;&#26412;&#12289;&#20854;&#20182;&#22269;&#23478;&#21644;&#26085;&#26412;&#28180;&#19994;&#21327;&#20250;&#20043;&#38388;&#30340;&#25112;&#30053;&#21160;&#24577;&#65292;&#30830;&#23450;&#20102;&#19977;&#31181;&#36827;&#21270;&#31283;&#23450;&#31574;&#30053;&#65292;&#24182;&#36890;&#36807;&#25968;&#20540;&#27169;&#25311;&#20998;&#26512;&#12290;&#30740;&#31350;&#32467;&#26524;&#24378;&#35843;&#20102;&#22269;&#38469;&#21512;&#20316;&#12289;&#31185;&#23398;&#30740;&#31350;&#12289;&#20844;&#20247;&#25945;&#32946;&#21644;&#24223;&#27700;&#22788;&#29702;&#26041;&#27861;&#30340;&#37325;&#35201;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
2023&#24180;8&#26376;24&#26085;&#65292;&#26085;&#26412;&#20915;&#23450;&#23558;&#31119;&#23707;&#31532;&#19968;&#26680;&#30005;&#31449;&#30340;&#26680;&#24223;&#27700;&#25490;&#25918;&#21040;&#28023;&#27915;&#20013;&#65292;&#24341;&#21457;&#20102;&#28608;&#28872;&#30340;&#22269;&#20869;&#21644;&#20840;&#29699;&#20105;&#35758;&#12290;&#26412;&#30740;&#31350;&#20351;&#29992;&#36827;&#21270;&#21338;&#24328;&#35770;&#20998;&#26512;&#26085;&#26412;&#12289;&#20854;&#20182;&#22269;&#23478;&#21644;&#26085;&#26412;&#28180;&#19994;&#21327;&#20250;&#20043;&#38388;&#30340;&#25112;&#30053;&#21160;&#24577;&#12290;&#36890;&#36807;&#32467;&#21512;&#32463;&#27982;&#12289;&#27861;&#24459;&#12289;&#22269;&#38469;&#25588;&#21161;&#21644;&#29615;&#22659;&#31561;&#22240;&#32032;&#65292;&#30740;&#31350;&#30830;&#23450;&#20102;&#19977;&#31181;&#36827;&#21270;&#31283;&#23450;&#31574;&#30053;&#65292;&#24182;&#36890;&#36807;&#25968;&#20540;&#27169;&#25311;&#36827;&#34892;&#20998;&#26512;&#12290;&#37325;&#28857;&#22312;&#20110;&#26085;&#26412;&#20174;&#24223;&#27700;&#25490;&#25918;&#36716;&#21464;&#20026;&#20572;&#27490;&#25490;&#25918;&#36807;&#31243;&#20013;&#30340;&#22810;&#31181;&#24433;&#21709;&#22240;&#32032;&#20197;&#21450;&#23545;&#21033;&#30410;&#30456;&#20851;&#32773;&#20915;&#31574;&#30340;&#24433;&#21709;&#12290;&#37325;&#35201;&#30340;&#27934;&#23519;&#25581;&#31034;&#20102;&#22269;&#38469;&#21512;&#20316;&#12289;&#20005;&#35880;&#30340;&#31185;&#23398;&#30740;&#31350;&#12289;&#20844;&#20247;&#25945;&#32946;&#21644;&#26377;&#25928;&#30340;&#24223;&#27700;&#22788;&#29702;&#26041;&#27861;&#30340;&#38656;&#27714;&#12290;&#26412;&#30740;&#31350;&#26088;&#22312;&#25552;&#20379;&#26032;&#30340;&#29702;&#35770;&#35270;&#35282;&#21644;&#23454;&#36341;&#25351;&#23548;&#65292;&#20419;&#36827;&#20840;&#29699;&#20851;&#20110;&#26680;&#24223;&#27700;&#31649;&#29702;&#30340;&#20849;&#35782;&#30340;&#24418;&#25104;&#12290;
&lt;/p&gt;
&lt;p&gt;
On August 24, 2023, Japan controversially decided to discharge nuclear wastewater from the Fukushima Daiichi Nuclear Power Plant into the ocean, sparking intense domestic and global debates. This study uses evolutionary game theory to analyze the strategic dynamics between Japan, other countries, and the Japan Fisheries Association. By incorporating economic, legal, international aid, and environmental factors, the research identifies three evolutionarily stable strategies, analyzing them via numerical simulations. The focus is on Japan's shift from wastewater release to its cessation, exploring the myriad factors influencing this transition and their effects on stakeholders' decisions. Key insights highlight the need for international cooperation, rigorous scientific research, public education, and effective wastewater treatment methods. Offering both a fresh theoretical perspective and practical guidance, this study aims to foster global consensus on nuclear wastewater management, cr
&lt;/p&gt;</description></item><item><title>&#36825;&#26412;&#20070;&#20840;&#38754;&#20998;&#26512;&#20102;&#24052;&#35199;&#33322;&#31354;&#36816;&#36755;&#19994;&#30340;&#32463;&#27982;&#21644;&#20844;&#20849;&#25919;&#31574;&#65292;&#24182;&#24378;&#35843;&#20102;&#20854;&#23545;&#22269;&#23478;&#32463;&#27982;&#30340;&#37325;&#35201;&#24615;&#12290;&#23427;&#30740;&#31350;&#20102;&#33322;&#31354;&#36816;&#36755;&#30340;&#32463;&#27982;&#29305;&#24449;&#12289;&#19982;&#22269;&#20869;&#33322;&#31354;&#24037;&#19994;&#30340;&#20114;&#21160;&#12289;&#24066;&#22330;&#21160;&#24577;&#21644;&#38656;&#27714;&#20998;&#26512;&#65292;&#20197;&#21450;&#33322;&#31354;&#36816;&#36755;&#30340;&#30417;&#31649;&#21407;&#21017;&#21644;&#20844;&#20849;&#25919;&#31574;&#12290;</title><link>https://arxiv.org/abs/2402.07190</link><description>&lt;p&gt;
&#33322;&#31354;&#36816;&#36755;&#65306;&#32463;&#27982;&#21644;&#20844;&#20849;&#25919;&#31574;
&lt;/p&gt;
&lt;p&gt;
Transporte Aereo: Economia e Politicas Publicas
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.07190
&lt;/p&gt;
&lt;p&gt;
&#36825;&#26412;&#20070;&#20840;&#38754;&#20998;&#26512;&#20102;&#24052;&#35199;&#33322;&#31354;&#36816;&#36755;&#19994;&#30340;&#32463;&#27982;&#21644;&#20844;&#20849;&#25919;&#31574;&#65292;&#24182;&#24378;&#35843;&#20102;&#20854;&#23545;&#22269;&#23478;&#32463;&#27982;&#30340;&#37325;&#35201;&#24615;&#12290;&#23427;&#30740;&#31350;&#20102;&#33322;&#31354;&#36816;&#36755;&#30340;&#32463;&#27982;&#29305;&#24449;&#12289;&#19982;&#22269;&#20869;&#33322;&#31354;&#24037;&#19994;&#30340;&#20114;&#21160;&#12289;&#24066;&#22330;&#21160;&#24577;&#21644;&#38656;&#27714;&#20998;&#26512;&#65292;&#20197;&#21450;&#33322;&#31354;&#36816;&#36755;&#30340;&#30417;&#31649;&#21407;&#21017;&#21644;&#20844;&#20849;&#25919;&#31574;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#20070;&#20197;&#33889;&#33796;&#29273;&#35821;&#25776;&#20889;&#65292;&#20840;&#38754;&#20998;&#26512;&#20102;&#24052;&#35199;&#30340;&#33322;&#31354;&#36816;&#36755;&#19994;&#65292;&#30528;&#37325;&#24378;&#35843;&#20854;&#23545;&#22269;&#23478;&#32463;&#27982;&#30340;&#37325;&#35201;&#24615;&#12290;&#23427;&#25506;&#35752;&#20102;&#35813;&#34892;&#19994;&#30340;&#22797;&#26434;&#24615;&#65292;&#20174;&#32463;&#27982;&#29305;&#24449;&#21040;&#19982;&#22269;&#20869;&#33322;&#31354;&#24037;&#19994;&#30340;&#20114;&#21160;&#65292;&#36890;&#36807;&#21171;&#21160;&#21147;&#30340;&#19987;&#19994;&#21270;&#21644;&#24066;&#22330;&#38656;&#27714;&#20998;&#26512;&#12290;&#26412;&#20070;&#28145;&#20837;&#30740;&#31350;&#20102;&#33322;&#31354;&#36816;&#36755;&#30340;&#32463;&#27982;&#30417;&#31649;&#65292;&#24182;&#36861;&#28335;&#20102;&#20005;&#26684;&#30417;&#31649;&#26102;&#26399;&#21040;&#33258;&#30001;&#21270;&#21644;&#21462;&#28040;&#30417;&#31649;&#38454;&#27573;&#30340;&#28436;&#21464;&#65292;&#21516;&#26102;&#36824;&#20998;&#26512;&#20102;&#24066;&#22330;&#21160;&#24577;&#65292;&#37325;&#28857;&#20851;&#27880;&#38598;&#20013;&#24230;&#21644;&#31454;&#20105;&#21147;&#12290;&#23427;&#36824;&#36890;&#36807;&#26696;&#20363;&#30740;&#31350;&#20998;&#26512;&#20102;&#38656;&#27714;&#21644;&#20379;&#24212;&#65292;&#35843;&#26597;&#20102;&#20174;&#24052;&#35199;&#22269;&#20869;&#26053;&#28216;&#32773;&#21040;&#22269;&#22303;&#35206;&#30422;&#21644;&#33322;&#31354;&#31080;&#20215;&#30340;&#21508;&#20010;&#26041;&#38754;&#12290;&#26368;&#21518;&#65292;&#26412;&#20070;&#25552;&#20986;&#20102;&#33322;&#31354;&#37096;&#38376;&#30340;&#30417;&#31649;&#21407;&#21017;&#21644;&#20844;&#20849;&#25919;&#31574;&#65292;&#24378;&#35843;&#20056;&#23458;&#20248;&#20808;&#12289;&#21830;&#19994;&#29615;&#22659;&#12289;&#33322;&#31354;&#36816;&#36755;&#30340;&#21487;&#33719;&#24471;&#24615;&#21644;&#32463;&#27982;&#25928;&#30410;&#12290;
&lt;/p&gt;
&lt;p&gt;
This book, written in Portuguese, presents a comprehensive analysis of the air transport industry in Brazil, highlighting its vital importance to the country's economy. It explores the sector's complexity, from economic characteristics to interaction with the national aeronautical industry, through the specialization of the workforce and market demand analysis. The book delves into the economic regulation of air transport, tracing the evolution from periods of strict regulation to phases of liberalization and deregulation, and examines market dynamics, focusing on concentration and competitiveness. It also analyzes demand and supply through case studies, investigating everything from tourists traveling within Brazil to the coverage of the national territory and the prices of air tickets. Finally, the book proposes principles for the regulation and public policies of the air sector, emphasizing the priority of the passenger, the business environment, access to air transport, and economi
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#20197;&#28023;&#21335;&#30465;&#20026;&#30740;&#31350;&#23545;&#35937;&#65292;&#25506;&#31350;&#20102;&#25968;&#23383;&#32463;&#27982;&#23545;&#20892;&#26449;&#25391;&#20852;&#30340;&#24433;&#21709;&#12290;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;&#25968;&#23383;&#32463;&#27982;&#23545;&#20892;&#26449;&#25391;&#20852;&#26377;&#31215;&#26497;&#30340;&#24433;&#21709;&#65292;&#24182;&#19988;&#38543;&#30528;&#36130;&#25919;&#25903;&#20986;&#27700;&#24179;&#30340;&#25552;&#39640;&#32780;&#22686;&#21152;&#12290;&#25968;&#23383;&#20154;&#27665;&#24065;&#30340;&#21457;&#34892;&#21644;&#28023;&#21335;&#33258;&#30001;&#36152;&#26131;&#28207;&#30340;&#24314;&#31435;&#20063;&#23545;&#20892;&#26449;&#25391;&#20852;&#21457;&#25381;&#20102;&#20419;&#36827;&#20316;&#29992;&#12290;</title><link>https://arxiv.org/abs/2402.07170</link><description>&lt;p&gt;
&#22522;&#20110;GPM&#27169;&#22411;&#30340;&#25968;&#23383;&#32463;&#27982;&#23545;&#28023;&#21335;&#30465;&#20892;&#26449;&#25391;&#20852;&#30340;&#22810;&#38454;&#27573;&#24433;&#21709;&#30340;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Research on the multi-stage impact of digital economy on rural revitalization in Hainan Province based on GPM model
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.07170
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#20197;&#28023;&#21335;&#30465;&#20026;&#30740;&#31350;&#23545;&#35937;&#65292;&#25506;&#31350;&#20102;&#25968;&#23383;&#32463;&#27982;&#23545;&#20892;&#26449;&#25391;&#20852;&#30340;&#24433;&#21709;&#12290;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;&#25968;&#23383;&#32463;&#27982;&#23545;&#20892;&#26449;&#25391;&#20852;&#26377;&#31215;&#26497;&#30340;&#24433;&#21709;&#65292;&#24182;&#19988;&#38543;&#30528;&#36130;&#25919;&#25903;&#20986;&#27700;&#24179;&#30340;&#25552;&#39640;&#32780;&#22686;&#21152;&#12290;&#25968;&#23383;&#20154;&#27665;&#24065;&#30340;&#21457;&#34892;&#21644;&#28023;&#21335;&#33258;&#30001;&#36152;&#26131;&#28207;&#30340;&#24314;&#31435;&#20063;&#23545;&#20892;&#26449;&#25391;&#20852;&#21457;&#25381;&#20102;&#20419;&#36827;&#20316;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25968;&#23383;&#32463;&#27982;&#30340;&#24555;&#36895;&#21457;&#23637;&#23545;&#20892;&#26449;&#25391;&#20852;&#25112;&#30053;&#30340;&#23454;&#26045;&#20135;&#29983;&#20102;&#28145;&#36828;&#24433;&#21709;&#12290;&#22522;&#20110;&#27492;&#65292;&#26412;&#30740;&#31350;&#20197;&#28023;&#21335;&#30465;&#20026;&#30740;&#31350;&#23545;&#35937;&#65292;&#28145;&#20837;&#25506;&#35752;&#25968;&#23383;&#32463;&#27982;&#21457;&#23637;&#23545;&#20892;&#26449;&#25391;&#20852;&#30340;&#24433;&#21709;&#12290;&#30740;&#31350;&#25910;&#38598;&#20102;2003&#24180;&#33267;2022&#24180;&#30340;&#38754;&#26495;&#25968;&#25454;&#65292;&#26500;&#24314;&#20102;&#25968;&#23383;&#32463;&#27982;&#19982;&#20892;&#26449;&#25391;&#20852;&#35780;&#20215;&#25351;&#26631;&#20307;&#31995;&#65292;&#24182;&#37319;&#29992;&#38754;&#26495;&#22238;&#24402;&#20998;&#26512;&#31561;&#26041;&#27861;&#65292;&#25506;&#31350;&#20102;&#25968;&#23383;&#32463;&#27982;&#23545;&#20892;&#26449;&#25391;&#20852;&#30340;&#20419;&#36827;&#25928;&#26524;&#12290;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;&#25968;&#23383;&#32463;&#27982;&#23545;&#20892;&#26449;&#25391;&#20852;&#20855;&#26377;&#26174;&#33879;&#30340;&#27491;&#21521;&#24433;&#21709;&#65292;&#19988;&#36825;&#31181;&#24433;&#21709;&#38543;&#30528;&#36130;&#25919;&#25903;&#20986;&#27700;&#24179;&#30340;&#25552;&#39640;&#32780;&#22686;&#21152;&#12290;&#25968;&#23383;&#20154;&#27665;&#24065;&#30340;&#21457;&#34892;&#36827;&#19968;&#27493;&#21457;&#25381;&#20102;&#30417;&#31649;&#20316;&#29992;&#65292;&#25512;&#21160;&#20102;&#25968;&#23383;&#32463;&#27982;&#21457;&#23637;&#21644;&#20892;&#26449;&#25391;&#20852;&#30340;&#36827;&#31243;&#12290;&#21516;&#26102;&#65292;&#28023;&#21335;&#33258;&#30001;&#36152;&#26131;&#28207;&#30340;&#24314;&#31435;&#20063;&#22312;&#20892;&#26449;&#25391;&#20852;&#20013;&#36215;&#21040;&#20102;&#31215;&#26497;&#20316;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;
The rapid development of the digital economy has had a profound impact on the implementation of the rural revitalization strategy. Based on this, this study takes Hainan Province as the research object to deeply explore the impact of digital economic development on rural revitalization. The study collected panel data from 2003 to 2022 to construct an evaluation index system for the digital economy and rural revitalization and used panel regression analysis and other methods to explore the promotion effect of the digital economy on rural revitalization. Research results show that the digital economy has a significant positive impact on rural revitalization, and this impact increases as the level of fiscal expenditure increases. The issuance of digital RMB has further exerted a regulatory effect and promoted the development of the digital economy and the process of rural revitalization. At the same time, the establishment of the Hainan Free Trade Port has also played a positive role in p
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#24052;&#35199;&#24030;&#38469;&#26053;&#34892;&#24066;&#22330;&#30340;&#24052;&#22763;&#21644;&#33322;&#31354;&#20844;&#21496;&#20043;&#38388;&#30340;&#22810;&#24335;&#32852;&#36816;&#31454;&#20105;&#65292;&#24182;&#35780;&#20272;&#20102;&#33258;&#30001;&#21270;&#25514;&#26045;&#23545;&#31454;&#20105;&#30340;&#25928;&#26524;&#12290;&#30740;&#31350;&#21457;&#29616;&#24052;&#22763;&#21644;&#33322;&#31354;&#20844;&#21496;&#20043;&#38388;&#30340;&#20114;&#21160;&#38750;&#24120;&#37325;&#35201;&#65292;&#21487;&#33021;&#26159;&#22240;&#20026;&#20182;&#20204;&#20105;&#22842;&#30528;&#19968;&#20010;&#23567;&#20294;&#19981;&#26029;&#22686;&#38271;&#30340;&#39640;&#31471;&#23458;&#25143;&#32676;&#12290;</title><link>https://arxiv.org/abs/2402.07125</link><description>&lt;p&gt;
&#24052;&#35199;&#24030;&#38469;&#26053;&#34892;&#24066;&#22330;&#30340;&#22810;&#24335;&#32852;&#36816;&#31454;&#20105;
&lt;/p&gt;
&lt;p&gt;
Intermodal competition in the Brazilian interstate travel market
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.07125
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#24052;&#35199;&#24030;&#38469;&#26053;&#34892;&#24066;&#22330;&#30340;&#24052;&#22763;&#21644;&#33322;&#31354;&#20844;&#21496;&#20043;&#38388;&#30340;&#22810;&#24335;&#32852;&#36816;&#31454;&#20105;&#65292;&#24182;&#35780;&#20272;&#20102;&#33258;&#30001;&#21270;&#25514;&#26045;&#23545;&#31454;&#20105;&#30340;&#25928;&#26524;&#12290;&#30740;&#31350;&#21457;&#29616;&#24052;&#22763;&#21644;&#33322;&#31354;&#20844;&#21496;&#20043;&#38388;&#30340;&#20114;&#21160;&#38750;&#24120;&#37325;&#35201;&#65292;&#21487;&#33021;&#26159;&#22240;&#20026;&#20182;&#20204;&#20105;&#22842;&#30528;&#19968;&#20010;&#23567;&#20294;&#19981;&#26029;&#22686;&#38271;&#30340;&#39640;&#31471;&#23458;&#25143;&#32676;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36890;&#36807;&#26816;&#39564;&#24052;&#35199;&#38271;&#36884;&#24052;&#22763;&#21644;&#33322;&#31354;&#20844;&#21496;&#20043;&#38388;&#30340;&#22810;&#24335;&#32852;&#36816;&#30456;&#20114;&#20316;&#29992;&#65292;&#20197;&#26816;&#26597;&#36817;&#26399;&#26088;&#22312;&#20419;&#36827;&#20004;&#20010;&#34892;&#19994;&#31454;&#20105;&#30340;&#33258;&#30001;&#21270;&#25514;&#26045;&#30340;&#25928;&#26524;&#12290;&#24052;&#35199;&#22269;&#20869;&#30340;&#24030;&#38469;&#26053;&#34892;&#26381;&#21153;&#20027;&#35201;&#30001;&#24052;&#22763;&#25552;&#20379;&#65292;&#24182;&#19988;&#35813;&#31995;&#32479;&#23436;&#20840;&#30001;&#31169;&#33829;&#37096;&#38376;&#22312;&#20844;&#20849;&#22996;&#25176;&#19979;&#36890;&#36807;&#35768;&#21487;&#35777;&#21644;&#25480;&#26435;&#36816;&#33829;&#12290;2002&#24180;&#24341;&#20837;&#20102;&#22522;&#20110;&#26426;&#26500;&#30340;&#30417;&#31649;&#20197;&#21450;&#26088;&#22312;&#25552;&#39640;&#26681;&#25454;&#38656;&#27714;&#21644;&#25104;&#26412;&#26465;&#20214;&#28789;&#27963;&#35843;&#25972;&#31080;&#20215;&#30340;&#20215;&#26684;&#19978;&#38480;&#21046;&#24230;&#12290;&#36890;&#36807;&#20351;&#29992;&#22522;&#20110;&#21453;&#24212;&#20989;&#25968;&#30340;&#24052;&#22763;&#36816;&#33829;&#21830;&#22312;&#24030;&#38469;&#26053;&#34892;&#24066;&#22330;&#19978;&#30340;&#23450;&#20215;&#20915;&#31574;&#27169;&#22411;&#65292;&#25105;&#20204;&#22312;&#21516;&#26102;&#26041;&#31243;&#30340;&#26694;&#26550;&#20013;&#20272;&#35745;&#20102;&#24052;&#22763;&#31080;&#20215;&#21464;&#21270;&#23545;&#33322;&#31354;&#20844;&#21496;&#31080;&#20215;&#21464;&#21270;&#30340;&#25935;&#24863;&#24615;&#12290;&#21457;&#29616;&#24052;&#22763;&#36816;&#33829;&#21830;&#21644;&#33322;&#31354;&#20844;&#21496;&#20043;&#38388;&#30340;&#22810;&#24335;&#32852;&#36816;&#30456;&#20114;&#20316;&#29992;&#20855;&#26377;&#39640;&#24230;&#30340;&#37325;&#35201;&#24615;&#65292;&#21487;&#33021;&#26159;&#22240;&#20026;&#20182;&#20204;&#31454;&#20105;&#19968;&#23567;&#37096;&#20998;&#20294;&#19981;&#26029;&#22686;&#21152;&#30340;&#39640;&#31471;&#12289;&#36136;&#37327;&#22909;&#30340;&#23458;&#25143;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper presents a test of intermodal interaction between coaches and airlines in Brazil in order to check for the efficacy of recent liberalization measures designed to promote competition in both industries. Interstate travel service in the country is heavily provided by coaches, and the system is fully operated by the private sector under public delegation through permits and authorizations. Agency-based regulation was introduced in 2002 along with a price cap regime aimed at enhancing the flexibility to change fares in response to demand and cost conditions. By making use of a reaction function-based model of coach operators' pricing decisions in the interstate travel market, we then estimate the sensitivity of the changes in coach fares to the changes in airline fares in a simultaneous-equation framework. Intermodal interaction among coach operators and airlines is found to be highly significant and probably due to the competition for a small but increasing set of premium, qual
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#36890;&#36807;&#32463;&#27982;&#35745;&#37327;&#20998;&#26512;&#20272;&#35745;&#20551;&#26399;&#23545;&#26426;&#31080;&#20215;&#26684;&#30340;&#24433;&#21709;&#65292;&#29305;&#21035;&#24378;&#35843;&#20102;&#19977;&#22825;&#20551;&#26399;&#27963;&#21160;&#12290;&#20351;&#29992;&#24052;&#35199;&#22307;&#20445;&#32599;&#24066;&#30340;&#25968;&#25454;&#36827;&#34892;&#20998;&#26512;&#65292;&#20027;&#35201;&#26041;&#27861;&#36129;&#29486;&#26159;&#23545;&#26102;&#38388;&#25928;&#24212;&#36827;&#34892;&#20102;&#20998;&#35299;&#12290;&#32467;&#26524;&#20801;&#35768;&#23545;&#22307;&#20445;&#32599;&#24066;&#20013;&#24515;&#21644;&#22269;&#38469;&#26426;&#22330;&#30340;&#24615;&#33021;&#36827;&#34892;&#27604;&#36739;&#20998;&#26512;&#12290;</title><link>https://arxiv.org/abs/2402.07124</link><description>&lt;p&gt;
&#32463;&#27982;&#35745;&#37327;&#20998;&#26512;&#20272;&#35745;&#20551;&#26399;&#23545;&#26426;&#31080;&#20215;&#26684;&#30340;&#24433;&#21709;
&lt;/p&gt;
&lt;p&gt;
Econometric analysis to estimate the impact of holidays on airfares
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.07124
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36890;&#36807;&#32463;&#27982;&#35745;&#37327;&#20998;&#26512;&#20272;&#35745;&#20551;&#26399;&#23545;&#26426;&#31080;&#20215;&#26684;&#30340;&#24433;&#21709;&#65292;&#29305;&#21035;&#24378;&#35843;&#20102;&#19977;&#22825;&#20551;&#26399;&#27963;&#21160;&#12290;&#20351;&#29992;&#24052;&#35199;&#22307;&#20445;&#32599;&#24066;&#30340;&#25968;&#25454;&#36827;&#34892;&#20998;&#26512;&#65292;&#20027;&#35201;&#26041;&#27861;&#36129;&#29486;&#26159;&#23545;&#26102;&#38388;&#25928;&#24212;&#36827;&#34892;&#20102;&#20998;&#35299;&#12290;&#32467;&#26524;&#20801;&#35768;&#23545;&#22307;&#20445;&#32599;&#24066;&#20013;&#24515;&#21644;&#22269;&#38469;&#26426;&#22330;&#30340;&#24615;&#33021;&#36827;&#34892;&#27604;&#36739;&#20998;&#26512;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#33258;&#19978;&#19990;&#32426;90&#24180;&#20195;&#26411;&#20197;&#26469;&#65292;&#24052;&#35199;&#20551;&#26399;&#26399;&#38388;&#30340;&#33322;&#31354;&#26053;&#23458;&#25968;&#37327;&#26174;&#33879;&#22686;&#38271;&#12290;&#20854;&#20013;&#19968;&#20010;&#21407;&#22240;&#26159;&#32463;&#27982;&#33258;&#30001;&#21270;&#24102;&#26469;&#30340;&#33322;&#31354;&#31080;&#20215;&#31454;&#20105;&#21152;&#21095;&#12290;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#33322;&#31354;&#20844;&#21496;&#23450;&#20215;&#30340;&#35745;&#37327;&#32463;&#27982;&#27169;&#22411;&#65292;&#26088;&#22312;&#20272;&#35745;&#20551;&#26399;&#23545;&#31080;&#20215;&#30340;&#24433;&#21709;&#65292;&#29305;&#21035;&#24378;&#35843;&#20102;&#19977;&#22825;&#20551;&#26399;&#27963;&#21160;&#12290;&#23427;&#21033;&#29992;&#20102;&#19968;&#20010;&#25968;&#25454;&#24211;&#65292;&#35813;&#25968;&#25454;&#24211;&#25910;&#38598;&#20102;2008&#24180;&#33267;2010&#24180;&#26399;&#38388;&#24052;&#35199;&#20027;&#35201;&#22478;&#24066;&#22307;&#20445;&#32599;&#30340;&#20114;&#32852;&#32593;&#27599;&#22825;&#30340;&#25968;&#25454;&#12290;&#32463;&#27982;&#38754;&#26495;&#25968;&#25454;&#27169;&#22411;&#37319;&#29992;&#20102;&#20004;&#20010;&#38169;&#35823;&#25104;&#20221;&#30340;&#8220;&#20869;&#37096;&#8221;&#20272;&#35745;&#22120;&#65292;&#25511;&#21046;&#20102;&#33322;&#31354;&#20844;&#21496;/&#26426;&#22330;&#23545;&#21644;&#25253;&#20215;&#21644;&#20986;&#21457;&#26376;&#20221;&#30340;&#24433;&#21709;&#12290;&#26102;&#38388;&#25928;&#24212;&#22312;&#25253;&#20215;&#21644;&#20986;&#21457;&#26376;&#20221;&#20043;&#38388;&#30340;&#20998;&#35299;&#26159;&#26412;&#25991;&#30340;&#20027;&#35201;&#26041;&#27861;&#36129;&#29486;&#12290;&#32467;&#26524;&#20801;&#35768;&#23545;&#22307;&#20445;&#32599;&#24066;&#20013;&#24515;&#21644;&#22269;&#38469;&#26426;&#22330;&#65288;&#20998;&#21035;&#20026;CGH&#21644;Guarulhos&#65289;&#30340;&#24615;&#33021;&#36827;&#34892;&#27604;&#36739;&#20998;&#26512;&#12290;
&lt;/p&gt;
&lt;p&gt;
The number of air transportation passengers during the holidays in Brazil has grown notably since the late nineties. One of the reasons is greater competition in airfares made possible by economic liberalization. This paper presents an econometric model of airline pricing aiming at estimating the impacts of holiday periods on fares, with special emphasis on three-day holiday events. It makes use of a database with daily collected data from the internet between 2008 and 2010 for the major Brazilian city, Sao Paulo. The econometric panel data model employs a two-way error components "within" estimator, controlling for airline/airport-pair fixed effect along with quotation and departure months effects. The decomposition of time effects between quotation and departure month effects is the main methodological contribution of the paper. Results allow for a comparative analysis of the performance of Sao Paulo's downtown and international airports - respectively, Congonhas (CGH), and Guarulhos
&lt;/p&gt;</description></item><item><title>&#36825;&#39033;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#20010;&#36890;&#29992;&#30340;&#26368;&#20248;&#20572;&#27490;&#38382;&#39064;&#65292;&#36866;&#29992;&#20110;&#21508;&#31181;&#38750;&#24179;&#31283;&#29615;&#22659;&#12290;&#30740;&#31350;&#32467;&#26524;&#21253;&#25324;&#20102;&#38382;&#39064;&#30340;&#35299;&#23384;&#22312;&#24615;&#12289;&#27604;&#36739;&#38745;&#24577;&#32467;&#26524;&#30340;&#25512;&#23548;&#21644;&#36895;&#24230;-&#31934;&#24230;&#26435;&#34913;&#30340;&#20998;&#26512;&#12290;&#36890;&#36807;&#30740;&#31350;&#21487;&#20197;&#21457;&#29616;&#65292;&#20915;&#31574;&#20934;&#30830;&#24615;&#20250;&#38543;&#30528;&#25240;&#29616;&#29575;&#12289;&#23398;&#20064;&#36895;&#24230;&#21644;&#25130;&#27490;&#26399;&#24341;&#36215;&#30340;&#26102;&#38388;&#21387;&#21147;&#21464;&#21270;&#32780;&#21464;&#21270;&#12290;</title><link>https://arxiv.org/abs/2402.06999</link><description>&lt;p&gt;
&#22312;&#38750;&#24179;&#31283;&#29615;&#22659;&#20013;&#30340;&#26368;&#20248;&#20572;&#27490;&#38382;&#39064;&#30340;&#27604;&#36739;&#38745;&#24577;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Under Pressure: Comparative Statics for Optimal Stopping Problems in Nonstationary Environments
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.06999
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#20010;&#36890;&#29992;&#30340;&#26368;&#20248;&#20572;&#27490;&#38382;&#39064;&#65292;&#36866;&#29992;&#20110;&#21508;&#31181;&#38750;&#24179;&#31283;&#29615;&#22659;&#12290;&#30740;&#31350;&#32467;&#26524;&#21253;&#25324;&#20102;&#38382;&#39064;&#30340;&#35299;&#23384;&#22312;&#24615;&#12289;&#27604;&#36739;&#38745;&#24577;&#32467;&#26524;&#30340;&#25512;&#23548;&#21644;&#36895;&#24230;-&#31934;&#24230;&#26435;&#34913;&#30340;&#20998;&#26512;&#12290;&#36890;&#36807;&#30740;&#31350;&#21487;&#20197;&#21457;&#29616;&#65292;&#20915;&#31574;&#20934;&#30830;&#24615;&#20250;&#38543;&#30528;&#25240;&#29616;&#29575;&#12289;&#23398;&#20064;&#36895;&#24230;&#21644;&#25130;&#27490;&#26399;&#24341;&#36215;&#30340;&#26102;&#38388;&#21387;&#21147;&#21464;&#21270;&#32780;&#21464;&#21270;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#36890;&#29992;&#30340;&#26368;&#20248;&#20572;&#27490;&#38382;&#39064;&#65292;&#36866;&#29992;&#20110;&#24191;&#27867;&#30340;&#38750;&#24179;&#31283;&#29615;&#22659;&#12290;&#36825;&#20123;&#29615;&#22659;&#21253;&#25324;&#20915;&#31574;&#32773;&#32784;&#24515;&#65288;&#21363;&#25240;&#29616;&#29575;&#65289;&#12289;&#26102;&#38388;&#21387;&#21147;&#65288;&#21363;&#38543;&#26426;&#25130;&#27490;&#26399;&#30340;&#21040;&#36798;&#29575;&#65289;&#12289;&#23398;&#20064;&#36895;&#24230;&#65288;&#21363;&#25193;&#25955;&#36807;&#31243;&#30340;&#27874;&#21160;&#24615;&#65289;&#31561;&#21487;&#20197;&#38543;&#26102;&#38388;&#36880;&#28176;&#25110;&#31361;&#28982;&#21464;&#21270;&#30340;&#24773;&#26223;&#12290;&#25105;&#20204;&#30340;&#35770;&#25991;&#25552;&#20379;&#20102;&#19977;&#20010;&#20027;&#35201;&#36129;&#29486;&#12290;&#39318;&#20808;&#65292;&#25105;&#20204;&#35777;&#26126;&#22312;&#28201;&#21644;&#30340;&#27491;&#21017;&#26465;&#20214;&#19979;&#65292;&#36825;&#20010;&#36890;&#29992;&#38382;&#39064;&#26377;&#19968;&#20010;&#21512;&#29702;&#23450;&#20041;&#30340;&#35299;&#12290;&#20854;&#27425;&#65292;&#25105;&#20204;&#24320;&#21457;&#20102;&#20840;&#38754;&#30340;&#27604;&#36739;&#38745;&#24577;&#32467;&#26524;&#65292;&#23545;&#20110;&#25551;&#36848;&#22312;&#24191;&#27867;&#31867;&#21035;&#30340;&#21333;&#35843;&#29615;&#22659;&#20013;&#20572;&#27490;&#21306;&#22495;&#30340;&#24418;&#29366;&#26159;&#33267;&#20851;&#37325;&#35201;&#30340;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#21033;&#29992;&#36825;&#20123;&#27604;&#36739;&#38745;&#24577;&#32467;&#26524;&#65292;&#26469;&#30740;&#31350;&#21508;&#31181;&#20449;&#24687;&#33719;&#21462;&#38382;&#39064;&#20013;&#30340;&#36895;&#24230;-&#31934;&#24230;&#26435;&#34913;&#65292;&#22312;&#25240;&#29616;&#29575;&#12289;&#23398;&#20064;&#36895;&#24230;&#25110;&#25130;&#27490;&#26399;&#24341;&#36215;&#30340;&#26102;&#38388;&#21387;&#21147;&#21457;&#29983;&#21464;&#21270;&#26102;&#65292;&#25581;&#31034;&#20915;&#31574;&#20934;&#30830;&#24615;&#22914;&#20309;&#38543;&#26102;&#38388;&#21464;&#21270;&#12290;&#20540;&#24471;&#27880;&#24847;&#30340;&#26159;&#65292;&#25105;&#20204;&#30340;&#20027;&#35201;&#27604;&#36739;&#38745;&#24577;&#32467;&#26524;&#21487;&#20197;&#25512;&#24191;&#33267;&#20854;&#20182;&#26368;&#20248;&#20572;&#27490;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;
We present a general optimal stopping problem accommodating a broad spectrum of nonstationary environments. These include scenarios where the decision maker's patience (i.e., discount rate), time pressure (i.e., arrival rate of a stochastic deadline), learning speed (i.e., volatility of the diffusion process) can change over time both gradually and abruptly. Our paper offers three main contributions. First, we prove this general problem has a well-defined solution under mild regularity conditions. Second, we develop comprehensive comparative statics results that are crucial to characterize the shape of the stopping region in the broad class of \textit{monotone environments}. Finally, we leverage these comparative statics to examine the speed-accuracy tradeoffs in various information acquisition problems, revealing how decision accuracy varies over time in response to changes in the discount rate, learning speed, or deadline-induced time pressure. Notably, our main comparative static re
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#23436;&#32654;&#36125;&#21494;&#26031;&#35828;&#26381;&#38382;&#39064;&#65292;&#30740;&#31350;&#20102;&#21457;&#36865;&#26041;&#22312;&#23454;&#39564;&#36873;&#25321;&#28608;&#21169;&#19979;&#30340;&#22343;&#34913;&#25910;&#30410;&#20197;&#21450;&#22312;&#19981;&#23436;&#32654;&#25215;&#35834;&#19979;&#30340;&#40065;&#26834;&#24615;&#12290;</title><link>https://arxiv.org/abs/2402.06765</link><description>&lt;p&gt;
&#23436;&#32654;&#30340;&#36125;&#21494;&#26031;&#35828;&#26381;
&lt;/p&gt;
&lt;p&gt;
Perfect Bayesian Persuasion
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.06765
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#23436;&#32654;&#36125;&#21494;&#26031;&#35828;&#26381;&#38382;&#39064;&#65292;&#30740;&#31350;&#20102;&#21457;&#36865;&#26041;&#22312;&#23454;&#39564;&#36873;&#25321;&#28608;&#21169;&#19979;&#30340;&#22343;&#34913;&#25910;&#30410;&#20197;&#21450;&#22312;&#19981;&#23436;&#32654;&#25215;&#35834;&#19979;&#30340;&#40065;&#26834;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21457;&#36865;&#26041;&#25215;&#35834;&#36827;&#34892;&#19968;&#20010;&#23454;&#39564;&#26469;&#35828;&#26381;&#25509;&#25910;&#26041;&#12290;&#32771;&#34385;&#21040;&#21457;&#36865;&#26041;&#36827;&#34892;&#23454;&#39564;&#36873;&#25321;&#30340;&#28608;&#21169;&#22240;&#32032;&#65292;&#24182;&#19988;&#19981;&#20551;&#35774;&#22312;&#25509;&#25910;&#26041;&#27604;&#36739;&#26102;&#26377;&#19968;&#20010;&#20915;&#23450;&#35268;&#21017;&#65292;&#25105;&#20204;&#30830;&#23450;&#20102;&#24403;&#21457;&#36865;&#26041;&#30340;&#22343;&#34913;&#25910;&#30410;&#26159;&#21807;&#19968;&#30340;&#26102;&#20505;&#65292;&#23427;&#19982;&#22905;&#30340;"&#36125;&#21494;&#26031;&#35828;&#26381;"&#20215;&#20540;&#26159;&#19968;&#33268;&#30340;&#12290;&#22312;&#26377;&#38480;&#27169;&#22411;&#20013;&#19968;&#20010;&#20805;&#20998;&#26465;&#20214;&#26159;&#65292;&#27599;&#20010;&#22312;&#26576;&#31181;&#20449;&#24565;&#19979;&#26159;&#25509;&#25910;&#26041;&#26368;&#20248;&#30340;&#34892;&#21160;&#65292;&#22312;&#20854;&#20182;&#26576;&#31181;&#20449;&#24565;&#19979;&#26159;&#21807;&#19968;&#26368;&#20248;&#30340;--&#36825;&#26159;&#19968;&#31181;&#26222;&#36941;&#29305;&#24615;&#12290;&#25105;&#20204;&#21516;&#26679;&#23637;&#31034;&#20102;&#22312;&#26377;&#24207;&#27169;&#22411;&#20013;&#22343;&#34913;&#21457;&#36865;&#26041;&#25910;&#30410;&#36890;&#24120;&#26159;&#21807;&#19968;&#30340;&#12290;&#22312;&#19968;&#20010;&#25193;&#23637;&#20013;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#21807;&#19968;&#24615;&#23545;&#20110;&#19981;&#23436;&#32654;&#30340;&#21457;&#36865;&#26041;&#25215;&#35834;&#26159;&#40065;&#26834;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
A sender commits to an experiment to persuade a receiver. Accounting for the sender's experiment-choice incentives, and not presupposing a receiver tie-breaking rule when indifferent, we characterize when the sender's equilibrium payoff is unique and so coincides with her "Bayesian persuasion" value. A sufficient condition in finite models is that every action which is receiver-optimal at some belief is uniquely optimal at some other belief -- a generic property. We similarly show the equilibrium sender payoff is typically unique in ordered models. In an extension, we show uniqueness generates robustness to imperfect sender commitment.
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#25506;&#35752;&#20102;&#22914;&#20309;&#23450;&#20041;&#12289;&#37327;&#21270;&#21644;&#27604;&#36739;&#21487;&#21464;&#21487;&#20877;&#29983;&#33021;&#28304;&#30701;&#32570;&#20107;&#20214;&#65292;&#35752;&#35770;&#20102;&#19981;&#21516;&#26041;&#27861;&#30340;&#20248;&#32570;&#28857;&#65292;&#24182;&#25552;&#20986;&#20102;&#36827;&#19968;&#27493;&#30340;&#30740;&#31350;&#26041;&#27861;&#12290;</title><link>https://arxiv.org/abs/2402.06758</link><description>&lt;p&gt;
&#27979;&#37327;Dunkelflaute&#65306;&#22914;&#20309;&#65288;&#19981;&#65289;&#20998;&#26512;&#21487;&#21464;&#21487;&#20877;&#29983;&#33021;&#28304;&#30701;&#32570;
&lt;/p&gt;
&lt;p&gt;
Measuring the Dunkelflaute: How (not) to analyze variable renewable energy shortage
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.06758
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25506;&#35752;&#20102;&#22914;&#20309;&#23450;&#20041;&#12289;&#37327;&#21270;&#21644;&#27604;&#36739;&#21487;&#21464;&#21487;&#20877;&#29983;&#33021;&#28304;&#30701;&#32570;&#20107;&#20214;&#65292;&#35752;&#35770;&#20102;&#19981;&#21516;&#26041;&#27861;&#30340;&#20248;&#32570;&#28857;&#65292;&#24182;&#25552;&#20986;&#20102;&#36827;&#19968;&#27493;&#30340;&#30740;&#31350;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38543;&#30528;&#21487;&#21464;&#21487;&#20877;&#29983;&#33021;&#28304;&#22312;&#20840;&#29699;&#33021;&#28304;&#31995;&#32479;&#20013;&#30340;&#37325;&#35201;&#24615;&#26085;&#30410;&#22686;&#21152;&#65292;&#20154;&#20204;&#23545;&#20110;&#20102;&#35299;&#21487;&#21464;&#21487;&#20877;&#29983;&#33021;&#28304;&#30701;&#32570;&#65288;&#8220;Dunkelflauten&#8221;&#65289;&#26102;&#26399;&#30340;&#20852;&#36259;&#20063;&#36234;&#26469;&#36234;&#22823;&#12290;&#22312;&#19981;&#21516;&#30340;&#21487;&#20877;&#29983;&#33021;&#28304;&#21457;&#30005;&#25216;&#26415;&#21644;&#22320;&#28857;&#20043;&#38388;&#23450;&#20041;&#12289;&#37327;&#21270;&#21644;&#27604;&#36739;&#36825;&#31181;&#30701;&#32570;&#20107;&#20214;&#65292;&#26159;&#19968;&#20010;&#38750;&#24120;&#22797;&#26434;&#30340;&#25361;&#25112;&#12290;&#19981;&#21516;&#25991;&#29486;&#20013;&#23384;&#22312;&#30528;&#21508;&#31181;&#26041;&#27861;&#65292;&#22914;&#27700;&#25991;&#23398;&#12289;&#39118;&#33021;&#21644;&#22826;&#38451;&#33021;&#20998;&#26512;&#65292;&#25110;&#33021;&#28304;&#31995;&#32479;&#24314;&#27169;&#12290;&#20808;&#21069;&#20998;&#26512;&#30340;&#30740;&#31350;&#23545;&#35937;&#33539;&#22260;&#20174;&#29305;&#23450;&#20301;&#32622;&#30340;&#21333;&#19968;&#25216;&#26415;&#21040;&#22810;&#20010;&#22320;&#21306;&#30340;&#22810;&#26679;&#21270;&#25216;&#26415;&#32452;&#21512;&#65292;&#35201;&#20040;&#20851;&#27880;&#21487;&#21464;&#21487;&#20877;&#29983;&#33021;&#28304;&#30340;&#20379;&#24212;&#65292;&#35201;&#20040;&#20851;&#27880;&#20854;&#19982;&#30005;&#21147;&#38656;&#27714;&#30340;&#19981;&#21305;&#37197;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#19968;&#31181;&#37327;&#21270;&#21487;&#21464;&#21487;&#20877;&#29983;&#33021;&#28304;&#30701;&#32570;&#30340;&#26041;&#27861;&#27010;&#36848;&#12290;&#25105;&#20204;&#35299;&#37322;&#24182;&#25209;&#21028;&#24615;&#22320;&#35752;&#35770;&#20102;&#19981;&#21516;&#26041;&#27861;&#22312;&#23450;&#20041;&#21644;&#35782;&#21035;&#30701;&#32570;&#20107;&#20214;&#26041;&#38754;&#30340;&#20248;&#28857;&#21644;&#25361;&#25112;&#65292;&#24182;&#25552;&#20986;&#20102;&#36827;&#19968;&#27493;&#30340;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
As variable renewable energy sources increasingly gain importance in global energy systems, there is a growing interest in understanding periods of variable renewable energy shortage (``Dunkelflauten''). Defining, quantifying, and comparing such shortage events across different renewable generation technologies and locations presents a surprisingly intricate challenge. Various approaches exist in different bodies of literature, such as hydrology, wind and solar energy analysis, or energy system modeling. The subject of interest in previous analyses ranges from single technologies in specific locations to diverse technology portfolios across multiple regions, focusing either on supply from variable renewables or its mismatch with electricity demand. We provide an overview of methods for quantifying variable renewable energy shortage. We explain and critically discuss the merits and challenges of different approaches for defining and identifying shortage events and propose further method
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#24341;&#20837;&#21644;&#35774;&#35745;&#20102;&#20960;&#20010;&#23545;&#32447;&#24615;&#36153;&#33293;&#23572;&#24066;&#22330;&#65288;LFM&#65289;&#21644;&#19968;&#25163;&#20215;&#26684;&#31454;&#20215;&#22343;&#34913;&#65288;FPPE&#65289;&#36827;&#34892;&#32479;&#35745;&#26377;&#25928;&#33258;&#20030;&#25512;&#26029;&#30340;&#36807;&#31243;&#65292;&#20854;&#20013;&#26368;&#20855;&#25361;&#25112;&#24615;&#30340;&#26159;&#23545;&#19968;&#33324;FPPE&#36827;&#34892;&#33258;&#20030;&#12290;&#36890;&#36807;&#20351;&#29992;&#29615;&#25910;&#25947;&#29702;&#35770;&#30340;&#26377;&#21147;&#24037;&#20855;&#65292;&#22312;&#28201;&#21644;&#30340;&#36864;&#21270;&#26465;&#20214;&#19979;&#25104;&#21151;&#35774;&#35745;&#20102;FPPE&#30340;&#33258;&#20030;&#36807;&#31243;&#12290;</title><link>https://arxiv.org/abs/2402.02303</link><description>&lt;p&gt;
&#33258;&#20030;&#36153;&#33293;&#23572;&#24066;&#22330;&#22343;&#34913;&#21644;&#19968;&#25163;&#20215;&#26684;&#31454;&#20215;&#22343;&#34913;
&lt;/p&gt;
&lt;p&gt;
Bootstrapping Fisher Market Equilibrium and First-Price Pacing Equilibrium
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.02303
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#24341;&#20837;&#21644;&#35774;&#35745;&#20102;&#20960;&#20010;&#23545;&#32447;&#24615;&#36153;&#33293;&#23572;&#24066;&#22330;&#65288;LFM&#65289;&#21644;&#19968;&#25163;&#20215;&#26684;&#31454;&#20215;&#22343;&#34913;&#65288;FPPE&#65289;&#36827;&#34892;&#32479;&#35745;&#26377;&#25928;&#33258;&#20030;&#25512;&#26029;&#30340;&#36807;&#31243;&#65292;&#20854;&#20013;&#26368;&#20855;&#25361;&#25112;&#24615;&#30340;&#26159;&#23545;&#19968;&#33324;FPPE&#36827;&#34892;&#33258;&#20030;&#12290;&#36890;&#36807;&#20351;&#29992;&#29615;&#25910;&#25947;&#29702;&#35770;&#30340;&#26377;&#21147;&#24037;&#20855;&#65292;&#22312;&#28201;&#21644;&#30340;&#36864;&#21270;&#26465;&#20214;&#19979;&#25104;&#21151;&#35774;&#35745;&#20102;FPPE&#30340;&#33258;&#20030;&#36807;&#31243;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#32447;&#24615;&#36153;&#33293;&#23572;&#24066;&#22330;&#65288;LFM&#65289;&#26159;&#32463;&#27982;&#23398;&#20013;&#30340;&#19968;&#20010;&#22522;&#26412;&#22343;&#34913;&#27169;&#22411;&#65292;&#20063;&#22312;&#20844;&#24179;&#21644;&#39640;&#25928;&#30340;&#36164;&#28304;&#20998;&#37197;&#26041;&#38754;&#26377;&#24212;&#29992;&#12290;&#19968;&#25163;&#20215;&#26684;&#31454;&#20215;&#22343;&#34913;&#65288;FPPE&#65289;&#26159;&#19968;&#31181;&#25429;&#25417;&#31532;&#19968;&#20215;&#26684;&#25293;&#21334;&#20013;&#39044;&#31639;&#31649;&#29702;&#26426;&#21046;&#30340;&#27169;&#22411;&#12290;&#22312;&#26576;&#20123;&#23454;&#38469;&#24773;&#20917;&#19979;&#65292;&#22914;&#24191;&#21578;&#25293;&#21334;&#65292;&#22312;&#36825;&#20123;&#27169;&#22411;&#19978;&#36827;&#34892;&#32479;&#35745;&#25512;&#26029;&#20855;&#26377;&#19968;&#23450;&#30340;&#20852;&#36259;&#12290;&#19968;&#31181;&#24191;&#27867;&#24212;&#29992;&#20110;&#19968;&#33324;&#32479;&#35745;&#25512;&#26029;&#30340;&#24120;&#29992;&#26041;&#27861;&#26159;&#33258;&#20030;&#36807;&#31243;&#12290;&#28982;&#32780;&#65292;&#23545;&#20110;LFM&#21644;FPPE&#65292;&#30446;&#21069;&#19981;&#23384;&#22312;&#26377;&#25928;&#24212;&#29992;&#33258;&#20030;&#31243;&#24207;&#30340;&#29702;&#35770;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#24341;&#20837;&#24182;&#35774;&#35745;&#20102;&#20960;&#20010;&#23545;LFM&#21644;FPPE&#36827;&#34892;&#32479;&#35745;&#26377;&#25928;&#33258;&#20030;&#25512;&#26029;&#30340;&#36807;&#31243;&#12290;&#26368;&#20855;&#25361;&#25112;&#24615;&#30340;&#37096;&#20998;&#26159;&#23545;&#19968;&#33324;FPPE&#36827;&#34892;&#33258;&#20030;&#65292;&#36825;&#24402;&#32467;&#20026;&#33258;&#20030;&#32422;&#26463;M-&#20272;&#35745;&#37327;&#65292;&#36825;&#26159;&#19968;&#20010;&#24456;&#22823;&#31243;&#24230;&#19978;&#26410;&#24320;&#21457;&#30340;&#38382;&#39064;&#12290;&#25105;&#20204;&#36890;&#36807;&#20351;&#29992;&#29615;&#25910;&#25947;&#29702;&#35770;&#30340;&#26377;&#21147;&#24037;&#20855;&#65292;&#22312;&#28201;&#21644;&#30340;&#36864;&#21270;&#26465;&#20214;&#19979;&#20026;FPPE&#35774;&#35745;&#20102;&#19968;&#20010;&#33258;&#20030;&#36807;&#31243;&#12290;&#36890;&#36807;&#21512;&#25104;&#21644;&#23454;&#38469;&#25968;&#25454;&#30340;&#23454;&#39564;&#35777;&#26126;&#20102;&#25105;&#20204;&#30340;&#26041;&#27861;&#30340;&#26377;&#25928;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
The linear Fisher market (LFM) is a basic equilibrium model from economics, which also has applications in fair and efficient resource allocation. First-price pacing equilibrium (FPPE) is a model capturing budget-management mechanisms in first-price auctions. In certain practical settings such as advertising auctions, there is an interest in performing statistical inference over these models. A popular methodology for general statistical inference is the bootstrap procedure. Yet, for LFM and FPPE there is no existing theory for the valid application of bootstrap procedures. In this paper, we introduce and devise several statistically valid bootstrap inference procedures for LFM and FPPE. The most challenging part is to bootstrap general FPPE, which reduces to bootstrapping constrained M-estimators, a largely unexplored problem. We devise a bootstrap procedure for FPPE under mild degeneracy conditions by using the powerful tool of epi-convergence theory. Experiments with synthetic and s
&lt;/p&gt;</description></item><item><title>&#36825;&#31687;&#35770;&#25991;&#30740;&#31350;&#20102;&#32654;&#22269;&#23485;&#24102;&#22522;&#30784;&#35774;&#26045;&#34917;&#36148;&#21644;&#25237;&#36164;&#35745;&#21010;&#23545;&#22269;&#20869;&#29983;&#20135;&#24635;&#20540;&#30340;&#36129;&#29486;&#12290;&#36890;&#36807;&#25237;&#20837;&#20135;&#20986;&#27169;&#22411;&#25506;&#32034;&#20102;&#23485;&#24102;&#25903;&#20986;&#23545;&#23439;&#35266;&#32463;&#27982;&#30340;&#24433;&#21709;&#12290;</title><link>https://arxiv.org/abs/2311.02431</link><description>&lt;p&gt;
&#32654;&#22269;&#23485;&#24102;&#22522;&#30784;&#35774;&#26045;&#34917;&#36148;&#21644;&#25237;&#36164;&#35745;&#21010;&#23545;&#22269;&#20869;&#29983;&#20135;&#24635;&#20540;&#30340;&#36129;&#29486;&#65306;&#22522;&#20110;&#25237;&#20837;&#20135;&#20986;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
The contribution of US broadband infrastructure subsidy and investment programs to GDP using input-output modeling
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2311.02431
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#30740;&#31350;&#20102;&#32654;&#22269;&#23485;&#24102;&#22522;&#30784;&#35774;&#26045;&#34917;&#36148;&#21644;&#25237;&#36164;&#35745;&#21010;&#23545;&#22269;&#20869;&#29983;&#20135;&#24635;&#20540;&#30340;&#36129;&#29486;&#12290;&#36890;&#36807;&#25237;&#20837;&#20135;&#20986;&#27169;&#22411;&#25506;&#32034;&#20102;&#23485;&#24102;&#25903;&#20986;&#23545;&#23439;&#35266;&#32463;&#27982;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#23613;&#31649;&#34987;&#20844;&#35748;&#20026;&#19968;&#31181;&#37325;&#35201;&#30340;&#31119;&#21033;&#65292;&#36229;&#36807;&#20116;&#20998;&#20043;&#19968;&#30340;&#32654;&#22269;&#20154;&#21475;&#27809;&#26377;&#35746;&#38405;&#22266;&#23450;&#23485;&#24102;&#26381;&#21153;&#12290;&#20363;&#22914;&#65292;&#23613;&#31649;&#24180;&#25910;&#20837;&#36229;&#36807;7&#19975;&#32654;&#20803;&#30340;&#24066;&#27665;&#20013;&#21482;&#26377;&#19981;&#21040;4%&#27809;&#26377;&#23485;&#24102;&#65292;&#20294;&#25910;&#20837;&#20302;&#20110;2&#19975;&#32654;&#20803;&#30340;&#24066;&#27665;&#20013;&#26377;26%&#27809;&#26377;&#23485;&#24102;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;&#25308;&#30331;&#25919;&#24220;&#36890;&#36807;&#12298;&#20004;&#20826;&#22522;&#30784;&#35774;&#26045;&#27861;&#12299;&#23454;&#26045;&#20102;&#26377;&#21490;&#20197;&#26469;&#35268;&#27169;&#26368;&#22823;&#30340;&#23485;&#24102;&#25237;&#36164;&#35745;&#21010;&#65292;&#26088;&#22312;&#35299;&#20915;&#36825;&#31181;&#24046;&#36317;&#65292;&#24182;&#23558;&#23485;&#24102;&#36830;&#25509;&#25193;&#23637;&#21040;&#25152;&#26377;&#20844;&#27665;&#12290;&#25903;&#25345;&#32773;&#34920;&#31034;&#65292;&#36825;&#23558;&#20174;&#26681;&#26412;&#19978;&#20943;&#23569;&#32654;&#22269;&#30340;&#25968;&#23383;&#40511;&#27807;&#12290;&#28982;&#32780;&#65292;&#25209;&#35780;&#32773;&#35748;&#20026;&#65292;&#35813;&#35745;&#21010;&#23548;&#33268;&#32463;&#27982;&#21608;&#26399;&#30340;&#21518;&#26399;&#20986;&#29616;&#20102;&#21069;&#25152;&#26410;&#26377;&#30340;&#20511;&#36151;&#65292;&#30041;&#19979;&#20102;&#24456;&#23569;&#30340;&#36130;&#25919;&#20313;&#22320;&#12290;&#22240;&#27492;&#65292;&#22312;&#36825;&#31687;&#35770;&#25991;&#20013;&#65292;&#25105;&#20204;&#23558;&#30740;&#31350;&#23485;&#24102;&#30340;&#21487;&#29992;&#24615;&#12289;&#37319;&#29992;&#24773;&#20917;&#21644;&#38656;&#27714;&#65292;&#28982;&#21518;&#26500;&#24314;&#19968;&#20010;&#25237;&#20837;&#20135;&#20986;&#27169;&#22411;&#65292;&#20197;&#25506;&#32034;&#23485;&#24102;&#25903;&#20986;&#23545;&#22269;&#20869;&#29983;&#20135;&#24635;&#20540;&#65288;GDP&#65289;&#30340;&#23439;&#35266;&#32463;&#27982;&#24433;&#21709;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#37327;&#21270;&#20102;&#37096;&#38376;&#38388;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
More than one-fifth of the US population does not subscribe to a fixed broadband service despite being a recognized merit good. For example, less than 4% of citizens earning more than US \$70k annually do not have broadband, compared to 26% of those earning below US \$20k annually. To address this, the Biden Administration has undertaken one of the largest broadband investment programs ever via The Bipartisan Infrastructure Law, with the aim of addressing this disparity and expanding broadband connectivity to all citizens. Proponents state this will reduce the US digital divide once-and-for-all. However, detractors say the program leads to unprecedented borrowing at a late stage of the economic cycle, leaving little fiscal headroom. Subsequently, in this paper, we examine broadband availability, adoption, and need and then construct an input-output model to explore the macroeconomic impacts of broadband spending in Gross Domestic Product (GDP) terms. Finally, we quantify inter-sectoral
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#22522;&#20110;&#24066;&#22330;&#30340;&#32929;&#31080;&#22238;&#25253;&#27010;&#29575;&#65292;&#21457;&#29616;&#24066;&#22330;&#25317;&#26377;&#32929;&#31080;&#22238;&#25253;&#30340;&#25152;&#26377;&#20449;&#24687;&#65292;&#24182;&#25506;&#35752;&#20102;&#22238;&#25253;&#30340;&#32479;&#35745;&#23398;&#29305;&#24449;&#19982;&#24403;&#21069;&#21644;&#36807;&#21435;&#20132;&#26131;&#20540;&#30340;&#32479;&#35745;&#23398;&#29305;&#24449;&#21644;&#30456;&#20851;&#24615;&#20043;&#38388;&#30340;&#20851;&#31995;&#12290;</title><link>https://arxiv.org/abs/2302.07935</link><description>&lt;p&gt;
&#22522;&#20110;&#24066;&#22330;&#30340;&#32929;&#31080;&#22238;&#25253;&#27010;&#29575;
&lt;/p&gt;
&lt;p&gt;
Market-Based Probability of Stock Returns
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2302.07935
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#22522;&#20110;&#24066;&#22330;&#30340;&#32929;&#31080;&#22238;&#25253;&#27010;&#29575;&#65292;&#21457;&#29616;&#24066;&#22330;&#25317;&#26377;&#32929;&#31080;&#22238;&#25253;&#30340;&#25152;&#26377;&#20449;&#24687;&#65292;&#24182;&#25506;&#35752;&#20102;&#22238;&#25253;&#30340;&#32479;&#35745;&#23398;&#29305;&#24449;&#19982;&#24403;&#21069;&#21644;&#36807;&#21435;&#20132;&#26131;&#20540;&#30340;&#32479;&#35745;&#23398;&#29305;&#24449;&#21644;&#30456;&#20851;&#24615;&#20043;&#38388;&#30340;&#20851;&#31995;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24066;&#22330;&#25317;&#26377;&#20851;&#20110;&#32929;&#31080;&#22238;&#25253;&#30340;&#25152;&#26377;&#21487;&#29992;&#20449;&#24687;&#12290;&#24066;&#22330;&#20132;&#26131;&#30340;&#38543;&#26426;&#24615;&#20915;&#23450;&#20102;&#32929;&#31080;&#22238;&#25253;&#30340;&#32479;&#35745;&#23398;&#29305;&#24449;&#12290;&#26412;&#25991;&#25551;&#36848;&#20102;&#32929;&#31080;&#22238;&#25253;&#30340;&#21069;&#22235;&#20010;&#22522;&#20110;&#24066;&#22330;&#30340;&#32479;&#35745;&#23398;&#29305;&#24449;&#19982;&#24403;&#21069;&#21644;&#36807;&#21435;&#20132;&#26131;&#20540;&#30340;&#32479;&#35745;&#23398;&#29305;&#24449;&#21644;&#30456;&#20851;&#24615;&#20043;&#38388;&#30340;&#20381;&#36182;&#20851;&#31995;&#12290;&#22312;&#21152;&#26435;&#24179;&#22343;&#26399;&#38388;&#36827;&#34892;&#20132;&#26131;&#30340;&#24179;&#22343;&#22238;&#25253;&#19982;&#39532;&#31185;&#23041;&#33576;&#23545;&#25237;&#36164;&#32452;&#21512;&#20215;&#20540;&#21152;&#26435;&#22238;&#25253;&#30340;&#23450;&#20041;&#30456;&#21563;&#21512;&#12290;&#25105;&#20204;&#25512;&#23548;&#20102;&#22522;&#20110;&#24066;&#22330;&#30340;&#22238;&#25253;&#27874;&#21160;&#29575;&#21644;&#22238;&#25253;-&#20215;&#20540;&#30456;&#20851;&#24615;&#12290;&#36890;&#36807;&#26377;&#38480;&#25968;&#37327;&#30340;&#22522;&#20110;&#24066;&#22330;&#30340;&#32479;&#35745;&#23398;&#29305;&#24449;&#30340;&#29305;&#24449;&#20989;&#25968;&#21644;&#27010;&#29575;&#24230;&#37327;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#23545;&#32929;&#31080;&#22238;&#25253;&#30340;&#36817;&#20284;&#39044;&#27979;&#26041;&#27861;&#12290;&#35201;&#39044;&#27979;&#22522;&#20110;&#24066;&#22330;&#30340;&#24179;&#22343;&#22238;&#25253;&#25110;&#22238;&#25253;&#27874;&#21160;&#29575;&#65292;&#24517;&#39035;&#21516;&#26102;&#39044;&#27979;&#24403;&#21069;&#21644;&#36807;&#21435;&#24066;&#22330;&#20132;&#26131;&#20540;&#30340;&#32479;&#35745;&#23398;&#29305;&#24449;&#21644;&#30456;&#20851;&#24615;&#65292;&#20197;&#30456;&#21516;&#30340;&#26102;&#38388;&#36328;&#24230;&#12290;
&lt;/p&gt;
&lt;p&gt;
Markets possess all available information on stock returns. The randomness of market trade determines the statistics of stock returns. This paper describes the dependence of the first four market-based statistical moments of stock returns on statistical moments and correlations of current and past trade values. The mean return of trades during the averaging period coincides with Markowitz's definition of portfolio value weighted return. We derive the market-based volatility of return and return-value correlations. We present approximations of the characteristic functions and probability measures of stock return by a finite number of market-based statistical moments. To forecast market-based average return or volatility of return, one should predict the statistical moments and correlations of current and past market trade values at the same time horizon.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#30417;&#30563;&#23398;&#20064;&#38598;&#25104;&#26694;&#26550;&#8212;&#8212;&#26426;&#22120;&#21327;&#20316;&#65288;MaC&#65289;&#65292;&#36890;&#36807;&#24490;&#29615;&#21644;&#20132;&#20114;&#30340;&#23398;&#20064;&#26041;&#24335;&#65292;&#20351;&#22522;&#30784;&#26426;&#22120;&#33021;&#22815;&#24490;&#29615;&#20256;&#36882;&#20449;&#24687;&#24182;&#30456;&#24212;&#22320;&#26356;&#26032;&#32467;&#26500;&#21644;&#21442;&#25968;&#12290;&#23454;&#39564;&#35777;&#26126;&#65292;MaC&#22312;&#22823;&#22810;&#25968;&#24773;&#20917;&#19979;&#34920;&#29616;&#20248;&#20110;&#20854;&#20182;&#20808;&#36827;&#26041;&#27861;&#12290;</title><link>https://arxiv.org/abs/2105.02569</link><description>&lt;p&gt;
&#26426;&#22120;&#21327;&#20316;
&lt;/p&gt;
&lt;p&gt;
Machine Collaboration
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2105.02569
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#30417;&#30563;&#23398;&#20064;&#38598;&#25104;&#26694;&#26550;&#8212;&#8212;&#26426;&#22120;&#21327;&#20316;&#65288;MaC&#65289;&#65292;&#36890;&#36807;&#24490;&#29615;&#21644;&#20132;&#20114;&#30340;&#23398;&#20064;&#26041;&#24335;&#65292;&#20351;&#22522;&#30784;&#26426;&#22120;&#33021;&#22815;&#24490;&#29615;&#20256;&#36882;&#20449;&#24687;&#24182;&#30456;&#24212;&#22320;&#26356;&#26032;&#32467;&#26500;&#21644;&#21442;&#25968;&#12290;&#23454;&#39564;&#35777;&#26126;&#65292;MaC&#22312;&#22823;&#22810;&#25968;&#24773;&#20917;&#19979;&#34920;&#29616;&#20248;&#20110;&#20854;&#20182;&#20808;&#36827;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#30417;&#30563;&#23398;&#20064;&#38598;&#25104;&#26694;&#26550;&#65292;&#31216;&#20026;&#26426;&#22120;&#21327;&#20316;&#65288;MaC&#65289;&#65292;&#21033;&#29992;&#19968;&#32452;&#22522;&#30784;&#26426;&#22120;&#36827;&#34892;&#39044;&#27979;&#20219;&#21153;&#12290;&#19982;&#24182;&#34892;&#19988;&#29420;&#31435;&#30340;bagging/stacking&#26694;&#26550;&#21644;&#39034;&#24207;&#19988;&#33258;&#19978;&#32780;&#19979;&#30340;boosting&#26694;&#26550;&#19981;&#21516;&#65292;MaC&#26159;&#19968;&#31181;&#24490;&#29615;&#21644;&#20132;&#20114;&#23398;&#20064;&#26694;&#26550;&#12290;&#24490;&#29615;&#21644;&#20132;&#20114;&#29305;&#24615;&#24110;&#21161;&#22522;&#30784;&#26426;&#22120;&#24490;&#29615;&#20256;&#36882;&#20449;&#24687;&#24182;&#30456;&#24212;&#22320;&#26356;&#26032;&#20854;&#32467;&#26500;&#21644;&#21442;&#25968;&#12290;&#23545;&#20110;&#20174;MaC&#24471;&#20986;&#30340;&#20272;&#35745;&#22120;&#30340;&#39118;&#38505;&#30028;&#30340;&#29702;&#35770;&#32467;&#26524;&#34920;&#26126;&#65292;&#24490;&#29615;&#21644;&#20132;&#20114;&#29305;&#24615;&#21487;&#20197;&#24110;&#21161;MaC&#36890;&#36807;&#31616;&#27905;&#30340;&#38598;&#25104;&#20943;&#23569;&#39118;&#38505;&#12290;&#25105;&#20204;&#22312;&#27169;&#25311;&#25968;&#25454;&#21644;119&#20010;&#22522;&#20934;&#30495;&#23454;&#25968;&#25454;&#38598;&#19978;&#36827;&#34892;&#20102;&#22823;&#37327;&#23454;&#39564;&#35777;&#26126;&#65292;&#22312;&#22823;&#22810;&#25968;&#24773;&#20917;&#19979;&#65292;MaC&#30340;&#24615;&#33021;&#26174;&#33879;&#20248;&#20110;&#21253;&#25324;&#20998;&#31867;&#22238;&#24402;&#26641;&#12289;&#31070;&#32463;&#32593;&#32476;&#12289;&#22534;&#21472;&#21644;&#25552;&#21319;&#22312;&#20869;&#30340;&#20854;&#20182;&#20960;&#31181;&#26368;&#20808;&#36827;&#30340;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
We propose a new ensemble framework for supervised learning, called machine collaboration (MaC), using a collection of base machines for prediction tasks. Unlike bagging/stacking (a parallel &amp; independent framework) and boosting (a sequential &amp; top-down framework), MaC is a type of circular &amp; interactive learning framework. The circular &amp; interactive feature helps the base machines to transfer information circularly and update their structures and parameters accordingly. The theoretical result on the risk bound of the estimator from MaC reveals that the circular &amp; interactive feature can help MaC reduce risk via a parsimonious ensemble. We conduct extensive experiments on MaC using both simulated data and 119 benchmark real datasets. The results demonstrate that in most cases, MaC performs significantly better than several other state-of-the-art methods, including classification and regression trees, neural networks, stacking, and boosting.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#31526;&#21495;&#26816;&#39564;&#30340;&#20004;&#20010;&#26377;&#38480;&#26679;&#26412;&#24615;&#36136;&#12290;&#39318;&#20808;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#23545;&#20110;&#29420;&#31435;&#38750;&#21516;&#20998;&#24067;&#30340;&#25968;&#25454;&#65292;&#31526;&#21495;&#26816;&#39564;&#26159;&#26080;&#20559;&#30340;&#12290;&#20854;&#27425;&#65292;&#25105;&#20204;&#21457;&#29616;&#24403;&#25968;&#25454;&#23384;&#22312;&#30456;&#20851;&#24615;&#26102;&#65292;&#31526;&#21495;&#26816;&#39564;&#20250;&#36807;&#24230;&#25298;&#32477;&#12290;&#36825;&#20123;&#32467;&#26524;&#23545;&#20110;&#20102;&#35299;&#23569;&#25968;&#32676;&#38598;&#19979;&#30340;&#36817;&#20284;&#38543;&#26426;&#21270;&#26816;&#39564;&#30340;&#24615;&#36136;&#26159;&#26377;&#24110;&#21161;&#30340;&#12290;</title><link>https://arxiv.org/abs/2103.01412</link><description>&lt;p&gt;
&#19968;&#20123;&#20851;&#20110;&#31526;&#21495;&#26816;&#39564;&#30340;&#26377;&#38480;&#26679;&#26412;&#24615;&#36136;
&lt;/p&gt;
&lt;p&gt;
Some Finite Sample Properties of the Sign Test
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2103.01412
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#31526;&#21495;&#26816;&#39564;&#30340;&#20004;&#20010;&#26377;&#38480;&#26679;&#26412;&#24615;&#36136;&#12290;&#39318;&#20808;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#23545;&#20110;&#29420;&#31435;&#38750;&#21516;&#20998;&#24067;&#30340;&#25968;&#25454;&#65292;&#31526;&#21495;&#26816;&#39564;&#26159;&#26080;&#20559;&#30340;&#12290;&#20854;&#27425;&#65292;&#25105;&#20204;&#21457;&#29616;&#24403;&#25968;&#25454;&#23384;&#22312;&#30456;&#20851;&#24615;&#26102;&#65292;&#31526;&#21495;&#26816;&#39564;&#20250;&#36807;&#24230;&#25298;&#32477;&#12290;&#36825;&#20123;&#32467;&#26524;&#23545;&#20110;&#20102;&#35299;&#23569;&#25968;&#32676;&#38598;&#19979;&#30340;&#36817;&#20284;&#38543;&#26426;&#21270;&#26816;&#39564;&#30340;&#24615;&#36136;&#26159;&#26377;&#24110;&#21161;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#21253;&#21547;&#20102;&#20851;&#20110;&#31526;&#21495;&#26816;&#39564;&#30340;&#20004;&#20010;&#26377;&#38480;&#26679;&#26412;&#32467;&#26524;&#12290;&#39318;&#20808;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#22312;&#19968;&#20391;&#21644;&#21452;&#20391;&#20551;&#35774;&#19979;&#65292;&#31526;&#21495;&#26816;&#39564;&#23545;&#20110;&#29420;&#31435;&#38750;&#21516;&#20998;&#24067;&#30340;&#25968;&#25454;&#26159;&#26080;&#20559;&#30340;&#12290;&#23545;&#20110;&#21452;&#20391;&#20551;&#35774;&#65292;&#35777;&#26126;&#22522;&#20110;&#19968;&#31181;&#26032;&#39062;&#30340;&#35770;&#35777;&#65292;&#23558;&#21151;&#25928;&#20989;&#25968;&#30340;&#23548;&#25968;&#19982;&#27491;&#21017;&#20108;&#37096;&#22270;&#32852;&#31995;&#36215;&#26469;&#12290;&#36890;&#36807;&#23384;&#22312;&#23436;&#32654;&#21305;&#37197;&#65292;&#25105;&#20204;&#21487;&#20197;&#24471;&#21040;&#26080;&#20559;&#24615;&#12290;&#20854;&#27425;&#65292;&#25105;&#20204;&#32473;&#20986;&#20102;&#19968;&#20010;&#31616;&#21333;&#30340;&#29702;&#35770;&#21453;&#20363;&#65292;&#35777;&#26126;&#20102;&#24403;&#25968;&#25454;&#23384;&#22312;&#30456;&#20851;&#24615;&#26102;&#65292;&#31526;&#21495;&#26816;&#39564;&#20250;&#20986;&#29616;&#36807;&#24230;&#25298;&#32477;&#30340;&#24773;&#20917;&#12290;&#25105;&#20204;&#30340;&#32467;&#26524;&#23545;&#20110;&#29702;&#35299;&#20855;&#26377;&#23569;&#25968;&#32676;&#38598;&#30340;&#36817;&#20284;&#38543;&#26426;&#21270;&#26816;&#39564;&#30340;&#24615;&#36136;&#26159;&#26377;&#29992;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper contains two finite-sample results concerning the sign test. First, we show that the sign-test is unbiased with independent, non-identically distributed data for both one-sided and two-sided hypotheses. The proof for the two-sided case is based on a novel argument that relates the derivatives of the power function to a regular bipartite graph. Unbiasedness then follows from the existence of perfect matchings on such graphs. Second, we provide a simple theoretical counterexample to show that the sign test over-rejects when the data exhibits correlation. Our results can be useful for understanding the properties of approximate randomization tests in settings with few clusters.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#20855;&#26377;&#24207;&#20559;&#22909;&#30340;&#31038;&#20250;&#36873;&#25321;&#29702;&#35770;&#20013;&#30340;&#21487;&#38450;&#24481;&#38598;&#21512;&#65292;&#35777;&#26126;&#20102;&#28385;&#36275;&#27491;&#21442;&#19982;&#24230;&#21644;&#24247;&#22810;&#22622;&#33719;&#32988;&#32773;&#20934;&#21017;&#30340;&#25237;&#31080;&#26041;&#27861;&#20250;&#23436;&#21892;&#35813;&#38598;&#21512;&#65292;&#28982;&#21518;&#36890;&#36807;&#24341;&#29702;&#35777;&#26126;&#20102;&#19968;&#20010;&#19981;&#21487;&#33021;&#23450;&#29702;&#65292;&#21363;&#27809;&#26377;&#19968;&#31181;&#25237;&#31080;&#26041;&#27861;&#33021;&#21516;&#26102;&#28385;&#36275;&#24247;&#22810;&#22622;&#36755;&#25481;&#32773;&#20934;&#21017;&#12289;&#21487;&#35299;&#24615;&#21644;&#24247;&#22810;&#22622;&#26041;&#27861;&#30340;&#26222;&#36941;&#19981;&#21464;&#24615;&#23646;&#24615;&#12290;</title><link>http://arxiv.org/abs/2401.05657</link><description>&lt;p&gt;
&#25237;&#31080;&#20013;&#30340;&#21487;&#38450;&#24481;&#38598;&#21512;&#21644;&#19968;&#20010;&#26032;&#30340;&#19981;&#21487;&#33021;&#23450;&#29702;
&lt;/p&gt;
&lt;p&gt;
The defensible set and a new impossibility theorem in voting. (arXiv:2401.05657v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.05657
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#20855;&#26377;&#24207;&#20559;&#22909;&#30340;&#31038;&#20250;&#36873;&#25321;&#29702;&#35770;&#20013;&#30340;&#21487;&#38450;&#24481;&#38598;&#21512;&#65292;&#35777;&#26126;&#20102;&#28385;&#36275;&#27491;&#21442;&#19982;&#24230;&#21644;&#24247;&#22810;&#22622;&#33719;&#32988;&#32773;&#20934;&#21017;&#30340;&#25237;&#31080;&#26041;&#27861;&#20250;&#23436;&#21892;&#35813;&#38598;&#21512;&#65292;&#28982;&#21518;&#36890;&#36807;&#24341;&#29702;&#35777;&#26126;&#20102;&#19968;&#20010;&#19981;&#21487;&#33021;&#23450;&#29702;&#65292;&#21363;&#27809;&#26377;&#19968;&#31181;&#25237;&#31080;&#26041;&#27861;&#33021;&#21516;&#26102;&#28385;&#36275;&#24247;&#22810;&#22622;&#36755;&#25481;&#32773;&#20934;&#21017;&#12289;&#21487;&#35299;&#24615;&#21644;&#24247;&#22810;&#22622;&#26041;&#27861;&#30340;&#26222;&#36941;&#19981;&#21464;&#24615;&#23646;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#20855;&#26377;&#24207;&#20559;&#22909;&#30340;&#31038;&#20250;&#36873;&#25321;&#29702;&#35770;&#32972;&#26223;&#19979;&#65292;&#25105;&#20204;&#31216;&#21487;&#38450;&#24481;&#38598;&#21512;&#20026;&#37027;&#20123;&#23545;&#20110;&#20219;&#20309;&#26367;&#20195;&#26041;&#26696;$x$&#65292;&#22914;&#26524;$y$&#22312;&#20004;&#20004;&#23545;&#27604;&#20013;&#20987;&#36133;$x$&#65292;&#21017;&#23384;&#22312;&#19968;&#20010;&#26367;&#20195;&#26041;&#26696;$z$&#65292;&#23427;&#22312;&#20004;&#20004;&#23545;&#27604;&#20013;&#20197;&#33267;&#23569;&#19982;$y$&#20987;&#36133;$x$&#30340;&#38388;&#38548;&#19968;&#26679;&#22823;&#30340;&#38388;&#38548;&#20987;&#36133;$y$&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#28385;&#36275;&#20004;&#20010;&#24050;&#30693;&#20844;&#29702;&#65288;&#27491;&#21442;&#19982;&#24230;&#21644;&#24247;&#22810;&#22622;&#33719;&#32988;&#32773;&#20934;&#21017;&#65289;&#30340;&#24207;&#27425;&#25237;&#31080;&#26041;&#27861;&#20250;&#23436;&#21892;&#21487;&#38450;&#24481;&#38598;&#21512;&#12290;&#21033;&#29992;&#36825;&#20010;&#24341;&#29702;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#19968;&#20010;&#19981;&#21487;&#33021;&#23450;&#29702;&#65306;&#27809;&#26377;&#19968;&#31181;&#21516;&#26102;&#36824;&#28385;&#36275;&#24247;&#22810;&#22622;&#36755;&#25481;&#32773;&#20934;&#21017;&#12289;&#21487;&#35299;&#24615;&#21644;&#24247;&#22810;&#22622;&#26041;&#27861;&#30340;&#26222;&#36941;&#19981;&#21464;&#24615;&#23646;&#24615;&#65292;&#21363;&#20915;&#32988;&#32773;&#30340;&#36873;&#25321;&#21482;&#21462;&#20915;&#20110;&#22810;&#25968;&#36793;&#38469;&#30340;&#30456;&#23545;&#22823;&#23567;&#30340;&#25237;&#31080;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
In the context of social choice theory with ordinal preferences, we say that the defensible set is the set of alternatives $x$ such that for any alternative $y$, if $y$ beats $x$ in a head-to-head majority comparison, then there is an alternative $z$ that beats $y$ in a head-to-head majority comparison by a margin at least as large as the margin by which $y$ beat $x$. We show that any ordinal voting method satisfying two well-known axioms from voting theory--positive involvement and the Condorcet winner criterion--refines the defensible set. Using this lemma, we prove an impossibility theorem: there is no such voting method that also satisfies the Condorcet loser criterion, resolvability, and a common invariance property for Condorcet methods, namely that the choice of winners depends only on the relative sizes of majority margins.
&lt;/p&gt;</description></item><item><title>&#36890;&#36807;&#30740;&#31350;&#25968;&#25454;&#30340;&#30697;&#25968;&#37327;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#39640;&#32500;&#39640;&#26031;&#36817;&#20284;&#30340;&#30456;&#21464;&#26465;&#20214;&#65292;&#21363;&#39640;&#26031;&#36817;&#20284;&#30340;&#26377;&#25928;&#24615;&#21462;&#20915;&#20110;&#32500;&#24230;&#21644;&#30697;&#25968;&#37327;&#30340;&#20851;&#31995;&#12290;</title><link>http://arxiv.org/abs/2310.12863</link><description>&lt;p&gt;
&#39640;&#32500;&#39640;&#26031;&#36817;&#20284;&#20013;&#30340;&#20381;&#36182;&#30697;&#30340;&#30456;&#21464;
&lt;/p&gt;
&lt;p&gt;
Moment-dependent phase transitions in high-dimensional Gaussian approximations. (arXiv:2310.12863v1 [math.ST])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.12863
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#30740;&#31350;&#25968;&#25454;&#30340;&#30697;&#25968;&#37327;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#39640;&#32500;&#39640;&#26031;&#36817;&#20284;&#30340;&#30456;&#21464;&#26465;&#20214;&#65292;&#21363;&#39640;&#26031;&#36817;&#20284;&#30340;&#26377;&#25928;&#24615;&#21462;&#20915;&#20110;&#32500;&#24230;&#21644;&#30697;&#25968;&#37327;&#30340;&#20851;&#31995;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#39640;&#32500;&#20013;&#24515;&#26497;&#38480;&#23450;&#29702;&#24050;&#32463;&#24471;&#21040;&#20102;&#24191;&#27867;&#30740;&#31350;&#65292;&#37325;&#28857;&#22823;&#22810;&#38598;&#20013;&#22312;&#25968;&#25454;&#26159;&#20122;&#39640;&#26031;&#25110;&#20122;&#25351;&#25968;&#20998;&#24067;&#30340;&#24773;&#20917;&#12290;&#28982;&#32780;&#65292;&#22312;&#23454;&#36341;&#20013;&#65292;&#26356;&#37325;&#30340;&#23614;&#24052;&#26159;&#26222;&#36941;&#23384;&#22312;&#30340;&#12290;&#22312;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#32500;&#24230; $d$ &#19979;&#30340;&#20020;&#30028;&#22686;&#38271;&#36895;&#29575;&#65292;&#36229;&#36807;&#36825;&#20010;&#36895;&#29575;&#39640;&#26031;&#36817;&#20284;&#23601;&#19981;&#20877;&#26377;&#25928;&#12290;&#25105;&#20204;&#29305;&#21035;&#20851;&#27880;&#35266;&#27979;&#37327;&#20855;&#26377;&#30340;&#30697;&#30340;&#25968;&#37327; $m$ &#23545;&#20110;&#36825;&#20123;&#38408;&#20540;&#30340;&#24433;&#21709;&#12290;&#23545;&#20110;&#27599;&#20010; $m\in(2,\infty)$&#65292;&#25105;&#20204;&#26500;&#36896;&#20102;&#22312; $\mathbb{R}^d$ &#20013;&#29420;&#31435;&#21516;&#20998;&#24067;&#30340;&#38543;&#26426;&#21521;&#37327; $\textbf{X}_1,...,\textbf{X}_n$&#65292;&#20854;&#20998;&#37327;&#26159;&#29420;&#31435;&#30340;&#65292;&#24182;&#20855;&#26377;&#19968;&#20010;&#19982; $n$ &#21644; $d$ &#26080;&#20851;&#30340;&#20998;&#24067;&#65292;&#19988;&#20855;&#26377;&#26377;&#38480;&#30340;&#31532; $m$ &#20010;&#32477;&#23545;&#30697;&#12290;&#23545;&#20110;&#36825;&#26679;&#30340;&#21521;&#37327;&#65292;&#22914;&#26524;&#23384;&#22312;&#19968;&#20010; $\varepsilon\in(0,\infty)$&#65292;&#20351;&#24471; $d/n^{m/2-1+\varepsilon}\not\to 0$&#65292;&#37027;&#20040;&#39640;&#26031;&#36817;&#20284;&#35823;&#24046; (Gaussian approximation error, GAE) &#28385;&#36275; $$  \limsup_{n\to\infty}\sup_{t\in\mathbb{R}}\left[\mathbb{P}\left(\max_{1\leq j\le
&lt;/p&gt;
&lt;p&gt;
High-dimensional central limit theorems have been intensively studied with most focus being on the case where the data is sub-Gaussian or sub-exponential. However, heavier tails are omnipresent in practice. In this article, we study the critical growth rates of dimension $d$ below which Gaussian approximations are asymptotically valid but beyond which they are not. We are particularly interested in how these thresholds depend on the number of moments $m$ that the observations possess. For every $m\in(2,\infty)$, we construct i.i.d. random vectors $\textbf{X}_1,...,\textbf{X}_n$ in $\mathbb{R}^d$, the entries of which are independent and have a common distribution (independent of $n$ and $d$) with finite $m$th absolute moment, and such that the following holds: if there exists an $\varepsilon\in(0,\infty)$ such that $d/n^{m/2-1+\varepsilon}\not\to 0$, then the Gaussian approximation error (GAE) satisfies $$  \limsup_{n\to\infty}\sup_{t\in\mathbb{R}}\left[\mathbb{P}\left(\max_{1\leq j\le
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#20351;&#29992;&#23457;&#35745;&#26041;&#27861;&#25506;&#32034;&#20102;ChatGPT&#22312;&#27714;&#32844;&#32773;&#31579;&#36873;&#20013;&#30340;&#31995;&#32479;&#20559;&#35265;&#65292;&#30740;&#31350;&#21457;&#29616;&#35821;&#35328;&#25552;&#31034;&#21644;&#30003;&#35831;&#32773;&#22995;&#21517;&#20013;&#30340;&#31181;&#26063;&#36523;&#20221;&#32447;&#32034;&#20250;&#24433;&#21709;ChatGPT&#30340;&#35780;&#20272;&#12290;</title><link>http://arxiv.org/abs/2309.07664</link><description>&lt;p&gt;
&#35745;&#31639;&#26426;&#35828;&#8220;&#19981;&#34892;&#8221;: &#20351;&#29992;&#23457;&#35745;&#26041;&#27861;&#25506;&#32034;ChatGPT&#20013;&#30340;&#31995;&#32479;&#25307;&#32856;&#20559;&#35265;
&lt;/p&gt;
&lt;p&gt;
Computer says 'no': Exploring systemic hiring bias in ChatGPT using an audit approach. (arXiv:2309.07664v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.07664
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#20351;&#29992;&#23457;&#35745;&#26041;&#27861;&#25506;&#32034;&#20102;ChatGPT&#22312;&#27714;&#32844;&#32773;&#31579;&#36873;&#20013;&#30340;&#31995;&#32479;&#20559;&#35265;&#65292;&#30740;&#31350;&#21457;&#29616;&#35821;&#35328;&#25552;&#31034;&#21644;&#30003;&#35831;&#32773;&#22995;&#21517;&#20013;&#30340;&#31181;&#26063;&#36523;&#20221;&#32447;&#32034;&#20250;&#24433;&#21709;ChatGPT&#30340;&#35780;&#20272;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#22312;&#20248;&#21270;&#32844;&#19994;&#27963;&#21160;&#26041;&#38754;&#20855;&#26377;&#37325;&#35201;&#28508;&#21147;&#65292;&#22914;&#31616;&#21270;&#20154;&#21592;&#36873;&#25300;&#31243;&#24207;&#12290;&#28982;&#32780;&#65292;&#20154;&#20204;&#25285;&#24515;&#36825;&#20123;&#27169;&#22411;&#20250;&#24310;&#32493;&#39044;&#35757;&#32451;&#25968;&#25454;&#20013;&#23884;&#20837;&#30340;&#31995;&#32479;&#20559;&#35265;&#12290;&#36825;&#39033;&#30740;&#31350;&#25506;&#35752;&#20102;ChatGPT&#22312;&#27714;&#32844;&#32773;&#31579;&#36873;&#26041;&#38754;&#26159;&#21542;&#34920;&#29616;&#20986;&#31181;&#26063;&#25110;&#24615;&#21035;&#20559;&#35265;&#65292;ChatGPT&#26159;&#19968;&#20010;&#33021;&#22815;&#29983;&#25104;&#31867;&#20284;&#20154;&#31867;&#22238;&#24212;&#30340;&#32842;&#22825;&#26426;&#22120;&#20154;&#12290;&#36890;&#36807;&#20351;&#29992;&#19968;&#31181;&#36890;&#20449;&#23457;&#35745;&#26041;&#27861;&#65292;&#25105;&#27169;&#25311;&#20102;&#19968;&#20010;&#31616;&#21382;&#31579;&#36873;&#20219;&#21153;&#65292;&#25351;&#31034;&#32842;&#22825;&#26426;&#22120;&#20154;&#35780;&#20215;&#34394;&#26500;&#30340;&#30003;&#35831;&#32773;&#31616;&#21382;&#65292;&#36825;&#20123;&#31616;&#21382;&#21482;&#26377;&#21517;&#23383;&#19981;&#21516;&#65292;&#20197;&#26263;&#31034;&#31181;&#26063;&#21644;&#24615;&#21035;&#36523;&#20221;&#12290;&#36890;&#36807;&#27604;&#36739;&#38463;&#25289;&#20271;&#12289;&#20122;&#27954;&#12289;&#32654;&#22269;&#40657;&#20154;&#12289;&#20013;&#38750;&#12289;&#33655;&#20848;&#12289;&#19996;&#27431;&#12289;&#35199;&#29677;&#29273;&#35028;&#12289;&#22303;&#32819;&#20854;&#21644;&#32654;&#22269;&#30333;&#20154;&#30007;&#24615;&#21644;&#22899;&#24615;&#30003;&#35831;&#32773;&#30340;&#35780;&#20998;&#65292;&#25105;&#21457;&#29616;&#31181;&#26063;&#21644;&#24615;&#21035;&#36523;&#20221;&#20250;&#24433;&#21709;ChatGPT&#30340;&#35780;&#20272;&#12290;&#31181;&#26063;&#20559;&#35265;&#20284;&#20046;&#37096;&#20998;&#28304;&#20110;&#25552;&#31034;&#35821;&#35328;&#65292;&#37096;&#20998;&#28304;&#20110;&#30003;&#35831;&#32773;&#22995;&#21517;&#20013;&#30340;&#31181;&#26063;&#36523;&#20221;&#32447;&#32034;&#12290;
&lt;/p&gt;
&lt;p&gt;
Large language models offer significant potential for optimising professional activities, such as streamlining personnel selection procedures. However, concerns exist about these models perpetuating systemic biases embedded into their pre-training data. This study explores whether ChatGPT, a chatbot producing human-like responses to language tasks, displays ethnic or gender bias in job applicant screening. Using a correspondence audit approach, I simulated a CV screening task in which I instructed the chatbot to rate fictitious applicant profiles only differing in names, signalling ethnic and gender identity. Comparing ratings of Arab, Asian, Black American, Central African, Dutch, Eastern European, Hispanic, Turkish, and White American male and female applicants, I show that ethnic and gender identity influence ChatGPT's evaluations. The ethnic bias appears to arise partly from the prompts' language and partly from ethnic identity cues in applicants' names. Although ChatGPT produces n
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#26368;&#23567;&#21333;&#32431;&#32463;&#27982;&#65292;&#35777;&#26126;&#20102;&#27599;&#20010;&#20223;&#23556;&#32463;&#27982;&#37117;&#23384;&#22312;&#31454;&#20105;&#22343;&#34913;&#65292;&#24182;&#19988;&#21457;&#29616;&#31454;&#20105;&#22343;&#34913;&#21487;&#20197;&#22312;&#20219;&#20309;&#26368;&#23567;&#21333;&#32431;&#32463;&#27982;&#20013;&#20869;&#22312;&#30830;&#23450;&#12290;</title><link>http://arxiv.org/abs/2309.03784</link><description>&lt;p&gt;
&#20851;&#20110;&#26368;&#23567;&#21333;&#32431;&#32463;&#27982;&#30340;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
On the minimal simplex economy. (arXiv:2309.03784v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.03784
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#26368;&#23567;&#21333;&#32431;&#32463;&#27982;&#65292;&#35777;&#26126;&#20102;&#27599;&#20010;&#20223;&#23556;&#32463;&#27982;&#37117;&#23384;&#22312;&#31454;&#20105;&#22343;&#34913;&#65292;&#24182;&#19988;&#21457;&#29616;&#31454;&#20105;&#22343;&#34913;&#21487;&#20197;&#22312;&#20219;&#20309;&#26368;&#23567;&#21333;&#32431;&#32463;&#27982;&#20013;&#20869;&#22312;&#30830;&#23450;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#25105;&#20204;&#20043;&#21069;&#30340;&#35770;&#25991;&#20013;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#27599;&#20010;&#20223;&#23556;&#32463;&#27982;&#37117;&#23384;&#22312;&#31454;&#20105;&#22343;&#34913;&#12290;&#20026;&#20102;&#25214;&#21040;&#33021;&#22815;&#35745;&#31639;&#31454;&#20105;&#22343;&#34913;&#30340;&#24773;&#20917;&#65292;&#25105;&#20204;&#23450;&#20041;&#20102;&#19968;&#20010;&#31616;&#21333;&#22411;&#32463;&#27982;&#65292;&#21363;&#23545;&#21830;&#21697;&#25968;&#37327;&#36827;&#34892;&#37325;&#22797;&#21464;&#21270;&#30340;&#24773;&#20917;&#65292;&#20854;&#20013;&#28040;&#36153;&#32773;&#30340;&#25968;&#37327;&#20195;&#34920;&#20102;&#20559;&#22909;&#65292;&#32780;&#36716;&#25442;&#30697;&#38453;&#21017;&#23450;&#20041;&#20102;&#21021;&#22987;&#31104;&#36171;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#31454;&#20105;&#22343;&#34913;&#21487;&#20197;&#22312;&#20219;&#20309;&#26368;&#23567;&#21333;&#32431;&#32463;&#27982;&#20013;&#20869;&#22312;&#30830;&#23450;&#12290;
&lt;/p&gt;
&lt;p&gt;
In our previous paper we proved that every affine economy has a competitive equilibrium. In order to find a situation in which it is possible to compute it, we define a simplex economy as a variation with repetition of the number of commodities taking the number of consumers (representing the preferences), and a transition matrix (defining the initial endowments). We show that a competitive equilibrium can be intrinsically determined in any minimal simplex economy.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;iCOS&#30340;&#26399;&#26435;&#38544;&#21547;&#20613;&#37324;&#21494;&#20313;&#24358;&#26041;&#27861;&#65292;&#29992;&#20110;&#26080;&#21442;&#25968;&#20272;&#35745;&#39118;&#38505;&#20013;&#24615;&#23494;&#24230;&#12289;&#26399;&#26435;&#20215;&#26684;&#21644;&#26399;&#26435;&#25935;&#24863;&#24615;&#12290;&#35813;&#26041;&#27861;&#19981;&#20381;&#36182;&#20110;&#23545;&#24213;&#23618;&#36164;&#20135;&#20215;&#26684;&#21160;&#24577;&#30340;&#20219;&#20309;&#27169;&#22411;&#20551;&#35774;&#65292;&#26159;&#23436;&#20840;&#26080;&#21442;&#25968;&#30340;&#65292;&#20855;&#26377;&#24191;&#27867;&#36866;&#29992;&#24615;&#21644;&#35745;&#31639;&#21560;&#24341;&#21147;&#12290;</title><link>http://arxiv.org/abs/2309.00943</link><description>&lt;p&gt;
iCOS: &#26399;&#26435;&#38544;&#21547;COS&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
iCOS: Option-Implied COS Method. (arXiv:2309.00943v1 [q-fin.ST])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.00943
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;iCOS&#30340;&#26399;&#26435;&#38544;&#21547;&#20613;&#37324;&#21494;&#20313;&#24358;&#26041;&#27861;&#65292;&#29992;&#20110;&#26080;&#21442;&#25968;&#20272;&#35745;&#39118;&#38505;&#20013;&#24615;&#23494;&#24230;&#12289;&#26399;&#26435;&#20215;&#26684;&#21644;&#26399;&#26435;&#25935;&#24863;&#24615;&#12290;&#35813;&#26041;&#27861;&#19981;&#20381;&#36182;&#20110;&#23545;&#24213;&#23618;&#36164;&#20135;&#20215;&#26684;&#21160;&#24577;&#30340;&#20219;&#20309;&#27169;&#22411;&#20551;&#35774;&#65292;&#26159;&#23436;&#20840;&#26080;&#21442;&#25968;&#30340;&#65292;&#20855;&#26377;&#24191;&#27867;&#36866;&#29992;&#24615;&#21644;&#35745;&#31639;&#21560;&#24341;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26399;&#26435;&#38544;&#21547;&#20613;&#37324;&#21494;&#20313;&#24358;&#26041;&#27861;iCOS&#65292;&#29992;&#20110;&#26080;&#21442;&#25968;&#20272;&#35745;&#39118;&#38505;&#20013;&#24615;&#23494;&#24230;&#12289;&#26399;&#26435;&#20215;&#26684;&#21644;&#26399;&#26435;&#25935;&#24863;&#24615;&#12290;iCOS&#26041;&#27861;&#21033;&#29992;&#20102;Fang&#21644;Oosterlee&#65288;2008&#65289;&#25552;&#20986;&#30340;&#22522;&#20110;&#20613;&#37324;&#21494;&#20313;&#24358;&#25216;&#26415;&#30340;COS&#26041;&#27861;&#65292;&#36890;&#36807;&#21033;&#29992;&#26399;&#26435;&#38544;&#21547;&#20313;&#24358;&#32423;&#25968;&#31995;&#25968;&#12290;&#20540;&#24471;&#27880;&#24847;&#30340;&#26159;&#65292;&#35813;&#26041;&#27861;&#19981;&#20381;&#36182;&#20110;&#23545;&#24213;&#23618;&#36164;&#20135;&#20215;&#26684;&#21160;&#24577;&#30340;&#20219;&#20309;&#27169;&#22411;&#20551;&#35774;&#65292;&#26159;&#23436;&#20840;&#26080;&#21442;&#25968;&#30340;&#65292;&#19981;&#28041;&#21450;&#20219;&#20309;&#25968;&#20540;&#20248;&#21270;&#12290;&#36825;&#20123;&#29305;&#28857;&#20351;&#24471;&#23427;&#20855;&#26377;&#24191;&#27867;&#36866;&#29992;&#24615;&#21644;&#35745;&#31639;&#21560;&#24341;&#21147;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#23548;&#20986;&#20102;&#25152;&#25552;&#20986;&#30340;&#38750;&#21442;&#25968;&#20272;&#35745;&#22120;&#30340;&#28176;&#36817;&#24615;&#36136;&#65292;&#24182;&#22312;&#33945;&#29305;&#21345;&#27931;&#27169;&#25311;&#20013;&#30740;&#31350;&#20102;&#23427;&#20204;&#30340;&#26377;&#38480;&#26679;&#26412;&#34892;&#20026;&#12290;&#25105;&#20204;&#20351;&#29992;S&amp;P 500&#25351;&#25968;&#26399;&#26435;&#21644;&#20122;&#39532;&#36874;&#32929;&#31080;&#26399;&#26435;&#30340;&#23454;&#35777;&#20998;&#26512;&#35828;&#26126;&#20102;iCOS&#26041;&#27861;&#22312;&#19981;&#21516;&#24066;&#22330;&#26465;&#20214;&#19979;&#20174;&#26399;&#26435;&#20215;&#26684;&#20013;&#25552;&#21462;&#26377;&#20215;&#20540;&#20449;&#24687;&#30340;&#25928;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper proposes the option-implied Fourier-cosine method, iCOS, for non-parametric estimation of risk-neutral densities, option prices, and option sensitivities. The iCOS method leverages the Fourier-based COS technique, proposed by Fang and Oosterlee (2008), by utilizing the option-implied cosine series coefficients. Notably, this procedure does not rely on any model assumptions about the underlying asset price dynamics, it is fully non-parametric, and it does not involve any numerical optimization. These features make it rather general and computationally appealing. Furthermore, we derive the asymptotic properties of the proposed non-parametric estimators and study their finite-sample behavior in Monte Carlo simulations. Our empirical analysis using S&amp;P 500 index options and Amazon equity options illustrates the effectiveness of the iCOS method in extracting valuable information from option prices under different market conditions.
&lt;/p&gt;</description></item><item><title>&#35813;&#30740;&#31350;&#25506;&#35752;&#20102;&#20849;&#20139;&#32852;&#21512;&#30740;&#31350;&#30340;&#36129;&#29486;&#65292;&#21457;&#29616;&#31616;&#21333;&#30340;&#21512;&#21516;&#20998;&#37197;&#21644;&#20165;&#22312;&#31361;&#30772;&#26102;&#21512;&#21516;&#21270;&#21162;&#21147;&#21487;&#20197;&#24674;&#22797;&#25928;&#29575;&#12290;</title><link>http://arxiv.org/abs/2307.12104</link><description>&lt;p&gt;
&#20849;&#20139;&#32852;&#21512;&#30740;&#31350;&#30340;&#36129;&#29486;
&lt;/p&gt;
&lt;p&gt;
Sharing Credit for Joint Research. (arXiv:2307.12104v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.12104
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#25506;&#35752;&#20102;&#20849;&#20139;&#32852;&#21512;&#30740;&#31350;&#30340;&#36129;&#29486;&#65292;&#21457;&#29616;&#31616;&#21333;&#30340;&#21512;&#21516;&#20998;&#37197;&#21644;&#20165;&#22312;&#31361;&#30772;&#26102;&#21512;&#21516;&#21270;&#21162;&#21147;&#21487;&#20197;&#24674;&#22797;&#25928;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#32771;&#34385;&#20102;&#19968;&#20010;&#25112;&#30053;&#23454;&#39564;&#27169;&#22411;&#65292;&#20195;&#29702;&#20154;&#21442;&#19982;&#20855;&#26377;&#22238;&#25253;&#22806;&#37096;&#24615;&#30340;&#39118;&#38505;&#30740;&#31350;&#65307;&#31361;&#30772;&#24615;&#30340;&#25104;&#26524;&#20351;&#24471;&#21457;&#29616;&#32773;&#65288;&#36194;&#23478;&#65289;&#19982;&#26410;&#21457;&#29616;&#32773;&#65288;&#36755;&#23478;&#65289;&#33719;&#24471;&#19981;&#21516;&#30340;&#22238;&#25253;&#12290;&#25105;&#23545;&#26368;&#20248;&#35299;&#36827;&#34892;&#20102;&#25551;&#36848;&#65292;&#24182;&#35777;&#26126;&#20102;&#38750;&#21512;&#20316;&#21338;&#24328;&#36890;&#24120;&#26159;&#20302;&#25928;&#30340;&#12290;&#31616;&#21333;&#30340;&#21512;&#21516;&#23558;&#36194;&#23478;&#21644;&#36755;&#23478;&#20043;&#38388;&#30340;&#22238;&#25253;&#20998;&#37197;&#36827;&#34892;&#20849;&#20139;&#65292;&#21363;&#20351;&#34892;&#21160;&#19981;&#21487;&#35266;&#27979;&#65292;&#20063;&#33021;&#24674;&#22797;&#25928;&#29575;&#12290;&#21478;&#19968;&#26041;&#38754;&#65292;&#22914;&#26524;&#36194;&#23478;&#30340;&#36523;&#20221;&#26080;&#27861;&#21512;&#21516;&#21270;&#65292;&#22312;&#31361;&#30772;&#26102;&#20165;&#23545;&#21162;&#21147;&#36827;&#34892;&#21512;&#21516;&#21270;&#20063;&#33021;&#24674;&#22797;&#25928;&#29575;&#12290;&#36825;&#20123;&#32467;&#26524;&#34920;&#26126;&#65292;&#23613;&#31649;&#25112;&#30053;&#23454;&#39564;&#36890;&#24120;&#23548;&#33268;&#20302;&#25928;&#65292;&#20294;&#20849;&#20139;&#36129;&#29486;&#26159;&#19968;&#31181;&#31283;&#20581;&#19988;&#26377;&#25928;&#30340;&#35299;&#20915;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
I consider a model of strategic experimentation where agents partake in risky research with payoff externalities; a breakthrough grants the discoverer (winner) a different payoff than the non-discoverers (losers). I characterize the first-best solution and show that the noncooperative game is generically inefficient. Simple contracts sharing payoffs between winner and losers restore efficiency, even when actions are unobserved. Alternatively, if the winner's identity is not contractible, contracting on effort only at the time of breakthrough also restores efficiency. These results suggest that although strategic experimentation generically entails inefficiency, sharing credit is a robust and effective remedy.
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#20027;&#35201;&#30740;&#31350;&#20102;&#36777;&#35828;&#27169;&#22411;&#20013;&#30340;&#27604;&#36739;&#38745;&#24577;&#38382;&#39064;&#65292;&#36890;&#36807;&#30028;&#23450;&#21457;&#20449;&#26041;&#20013;&#26399;&#22238;&#25253;&#21464;&#21270;&#30340;&#26465;&#20214;&#65292;&#30830;&#23450;&#20102;&#21457;&#20449;&#26041;&#22312;&#36873;&#25321;&#20449;&#21495;&#26102;&#20250;&#26356;&#20542;&#21521;&#20110;&#36873;&#25321;&#20855;&#26377;&#26356;&#22810;&#20449;&#24687;&#37327;&#30340;&#20449;&#21495;&#12290;&#27492;&#22806;&#65292;&#35770;&#25991;&#36824;&#30740;&#31350;&#20102;&#21457;&#20449;&#26041;&#21644;&#25509;&#25910;&#26041;&#20852;&#36259;&#19968;&#33268;&#31243;&#24230;&#22686;&#21152;&#23545;&#27604;&#36739;&#38745;&#24577;&#30340;&#24433;&#21709;&#65292;&#24182;&#25506;&#35752;&#20102;&#30456;&#20851;&#24212;&#29992;&#12290;</title><link>http://arxiv.org/abs/2204.07474</link><description>&lt;p&gt;
&#36777;&#35828;&#30340;&#27604;&#36739;&#38745;&#24577;
&lt;/p&gt;
&lt;p&gt;
The comparative statics of persuasion. (arXiv:2204.07474v2 [econ.TH] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2204.07474
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#20027;&#35201;&#30740;&#31350;&#20102;&#36777;&#35828;&#27169;&#22411;&#20013;&#30340;&#27604;&#36739;&#38745;&#24577;&#38382;&#39064;&#65292;&#36890;&#36807;&#30028;&#23450;&#21457;&#20449;&#26041;&#20013;&#26399;&#22238;&#25253;&#21464;&#21270;&#30340;&#26465;&#20214;&#65292;&#30830;&#23450;&#20102;&#21457;&#20449;&#26041;&#22312;&#36873;&#25321;&#20449;&#21495;&#26102;&#20250;&#26356;&#20542;&#21521;&#20110;&#36873;&#25321;&#20855;&#26377;&#26356;&#22810;&#20449;&#24687;&#37327;&#30340;&#20449;&#21495;&#12290;&#27492;&#22806;&#65292;&#35770;&#25991;&#36824;&#30740;&#31350;&#20102;&#21457;&#20449;&#26041;&#21644;&#25509;&#25910;&#26041;&#20852;&#36259;&#19968;&#33268;&#31243;&#24230;&#22686;&#21152;&#23545;&#27604;&#36739;&#38745;&#24577;&#30340;&#24433;&#21709;&#65292;&#24182;&#25506;&#35752;&#20102;&#30456;&#20851;&#24212;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#32463;&#20856;&#30340;&#36777;&#35828;&#27169;&#22411;&#20013;&#65292;&#27604;&#36739;&#38745;&#24577;&#19968;&#30452;&#26159;&#19968;&#20010;&#26410;&#35299;&#20915;&#30340;&#38382;&#39064;&#12290;&#25105;&#20204;&#22238;&#31572;&#20102;&#36825;&#20010;&#38382;&#39064;&#65292;&#30028;&#23450;&#20102;&#21738;&#20123;&#26465;&#20214;&#19979;&#21457;&#20449;&#26041;&#30340;&#20013;&#26399;&#22238;&#25253;&#21464;&#21270;&#20250;&#20351;&#20854;&#26368;&#20248;&#36873;&#25321;&#26356;&#20855;&#20449;&#24687;&#37327;&#30340;&#20449;&#21495;&#12290;&#25105;&#20204;&#30340;&#31532;&#19968;&#20010;&#23450;&#29702;&#30830;&#23450;&#20102;&#19968;&#20010;&#31895;&#30053;&#27010;&#24565;&#30340;&#8220;&#22686;&#21152;&#20984;&#24615;&#8221;&#65292;&#25105;&#20204;&#35777;&#26126;&#36825;&#20010;&#23450;&#29702;&#21051;&#30011;&#20102;&#21457;&#20449;&#26041;&#20013;&#26399;&#22238;&#25253;&#21464;&#21270;&#20351;&#20854;&#26368;&#20248;&#36873;&#25321;&#26356;&#21152;&#20449;&#24687;&#37327;&#19981;&#20943;&#30340;&#24773;&#20917;&#12290;&#20026;&#20102;&#21152;&#24378;&#36825;&#20010;&#32467;&#35770;&#20026;&#8220;&#26356;&#20855;&#20449;&#24687;&#37327;&#8221;&#38656;&#35201;&#36827;&#19968;&#27493;&#30340;&#20551;&#35774;&#65306;&#25105;&#20204;&#30340;&#31532;&#20108;&#20010;&#23450;&#29702;&#26126;&#30830;&#20102;&#21457;&#20449;&#26041;&#20013;&#26399;&#22238;&#25253;&#30340;&#24517;&#35201;&#21644;&#20805;&#20998;&#26465;&#20214;&#65292;&#36825;&#20010;&#26465;&#20214;&#20005;&#26684;&#25512;&#24191;&#20102;&#25991;&#29486;&#20013;&#24120;&#35265;&#30340;&#8220;S&#8221;&#24418;&#29366;&#12290;&#25105;&#20204;&#30830;&#23450;&#20102;&#21457;&#20449;&#26041;&#21644;&#25509;&#25910;&#26041;&#20852;&#36259;&#19968;&#33268;&#31243;&#24230;&#22686;&#21152;&#20250;&#23548;&#33268;&#27604;&#36739;&#38745;&#24577;&#30340;&#26465;&#20214;&#65292;&#24182;&#30740;&#31350;&#20102;&#24212;&#29992;&#22330;&#26223;&#12290;
&lt;/p&gt;
&lt;p&gt;
In the canonical persuasion model, comparative statics has been an open question. We answer it, delineating which shifts of the sender's interim payoff lead her optimally to choose a more informative signal. Our first theorem identifies a coarse notion of 'increased convexity' that we show characterises those shifts of the sender's interim payoff that lead her optimally to choose no less informative signals. To strengthen this conclusion to 'more informative' requires further assumptions: our second theorem identifies the necessary and sufficient condition on the sender's interim payoff, which strictly generalises the 'S' shape commonly imposed in the literature. We identify conditions under which increased alignment of interests between sender and receiver lead to comparative statics, and study applications.
&lt;/p&gt;</description></item></channel></rss>