<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#19968;&#31181;&#32852;&#21512;&#26816;&#39564;&#31243;&#24207;&#26469;&#35299;&#20915;&#30446;&#21069;&#22238;&#24402;&#19981;&#36830;&#32493;&#35774;&#35745;&#30340;&#35786;&#26029;&#26816;&#39564;&#23384;&#22312;&#30340;&#22810;&#37325;&#26816;&#39564;&#38382;&#39064;&#65292;&#35813;&#31243;&#24207;&#32988;&#36807;Bonferroni&#26657;&#27491;&#12290;</title><link>http://arxiv.org/abs/2205.04345</link><description>&lt;p&gt;
&#22238;&#24402;&#19981;&#36830;&#32493;&#35774;&#35745;&#30340;&#32852;&#21512;&#35786;&#26029;&#26816;&#39564;&#65306;&#22810;&#37325;&#26816;&#39564;&#38382;&#39064;
&lt;/p&gt;
&lt;p&gt;
Joint diagnostic test of regression discontinuity designs: multiple testing problem. (arXiv:2205.04345v2 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2205.04345
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#19968;&#31181;&#32852;&#21512;&#26816;&#39564;&#31243;&#24207;&#26469;&#35299;&#20915;&#30446;&#21069;&#22238;&#24402;&#19981;&#36830;&#32493;&#35774;&#35745;&#30340;&#35786;&#26029;&#26816;&#39564;&#23384;&#22312;&#30340;&#22810;&#37325;&#26816;&#39564;&#38382;&#39064;&#65292;&#35813;&#31243;&#24207;&#32988;&#36807;Bonferroni&#26657;&#27491;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#30446;&#21069;&#22238;&#24402;&#19981;&#36830;&#32493;(RD)&#35774;&#35745;&#30340;&#35786;&#26029;&#26816;&#39564;&#23384;&#22312;&#22810;&#37325;&#26816;&#39564;&#38382;&#39064;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#22312;&#20116;&#20010;&#39030;&#32423;&#32463;&#27982;&#23398;&#26399;&#21002;&#20013;&#21457;&#34920;&#30340;&#23454;&#35777;RD&#30740;&#31350;&#20013;&#65292;&#37492;&#21035;&#38480;&#21046;&#34987;&#22823;&#37327;&#36807;&#24230;&#25298;&#32477;&#12290;&#27599;&#20010;&#26816;&#39564;&#30340;&#21517;&#20041;&#22823;&#23567;&#20026;5&#65285;&#65292;&#20294;&#27599;&#20010;&#30740;&#31350;&#30340;&#20013;&#20301;&#25968;&#27979;&#35797;&#27425;&#25968;&#20026;12&#12290;&#22240;&#27492;&#65292;&#36229;&#36807;&#19977;&#20998;&#20043;&#19968;&#30340;&#30740;&#31350;&#20013;&#33267;&#23569;&#25298;&#32477;&#20102;&#20854;&#20013;&#19968;&#20010;&#26816;&#39564;&#65292;&#20854;&#35786;&#26029;&#31243;&#24207;&#26080;&#27861;&#35777;&#26126;&#37492;&#21035;&#20551;&#35774;&#30340;&#27491;&#30830;&#24615;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#19968;&#31181;&#32852;&#21512;&#26816;&#39564;&#31243;&#24207;&#26469;&#35299;&#20915;&#22810;&#37325;&#26816;&#39564;&#38382;&#39064;&#12290;&#25105;&#20204;&#30340;&#31243;&#24207;&#22522;&#20110;&#26032;&#30340;&#23616;&#37096;&#32447;&#24615;&#20272;&#35745;&#21644;&#23616;&#37096;&#22810;&#39033;&#24335;&#23494;&#24230;&#20272;&#35745;&#32852;&#21512;&#28176;&#36817;&#27491;&#24577;&#24615;&#12290;&#22312;&#27169;&#25311;&#30740;&#31350;&#20013;&#65292;&#25105;&#20204;&#30340;&#32852;&#21512;&#26816;&#39564;&#31243;&#24207;&#32988;&#36807;&#20102;Bonferroni&#26657;&#27491;&#12290;
&lt;/p&gt;
&lt;p&gt;
Current diagnostic tests for regression discontinuity (RD) design face a multiple testing problem. We find a massive over-rejection of the identifying restriction among empirical RD studies published in top-five economics journals. Each test achieves a nominal size of 5%; however, the median number of tests per study is 12. Consequently, more than one-third of studies reject at least one of these tests and their diagnostic procedures are invalid for justifying the identifying assumption. We offer a joint testing procedure to resolve the multiple testing problem. Our procedure is based on a new joint asymptotic normality of local linear estimates and local polynomial density estimates. In simulation studies, our joint testing procedures outperform the Bonferroni correction.
&lt;/p&gt;</description></item></channel></rss>