<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#38750;&#21442;&#25968;&#30340;&#21452;&#37325;&#40065;&#26834;&#24615;&#26041;&#27861;&#65292;&#29992;&#20110;&#35782;&#21035;&#36830;&#32493;&#22788;&#29702;&#30340;&#22240;&#26524;&#25928;&#24212;&#65292;&#36890;&#36807;&#31163;&#25955;&#20202;&#22120;&#36827;&#34892;&#20272;&#35745;&#12290;&#30740;&#31350;&#32467;&#26524;&#26174;&#31034;&#65292;&#36825;&#31181;&#26041;&#27861;&#22312;&#20272;&#35745;&#30561;&#30496;&#23545;&#24184;&#31119;&#24863;&#30340;&#24433;&#21709;&#26041;&#38754;&#19982;&#20256;&#32479;&#30340;2SLS&#20272;&#35745;&#32467;&#26524;&#30456;&#21563;&#21512;&#12290;</title><link>http://arxiv.org/abs/2310.18504</link><description>&lt;p&gt;
&#38750;&#21442;&#25968;&#21452;&#37325;&#40065;&#26834;&#24615;&#26041;&#27861;&#29992;&#20110;&#20351;&#29992;&#31163;&#25955;&#20202;&#22120;&#35782;&#21035;&#36830;&#32493;&#22788;&#29702;&#30340;&#22240;&#26524;&#25928;&#24212;&#30340;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Nonparametric Doubly Robust Identification of Causal Effects of a Continuous Treatment using Discrete Instruments. (arXiv:2310.18504v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.18504
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#38750;&#21442;&#25968;&#30340;&#21452;&#37325;&#40065;&#26834;&#24615;&#26041;&#27861;&#65292;&#29992;&#20110;&#35782;&#21035;&#36830;&#32493;&#22788;&#29702;&#30340;&#22240;&#26524;&#25928;&#24212;&#65292;&#36890;&#36807;&#31163;&#25955;&#20202;&#22120;&#36827;&#34892;&#20272;&#35745;&#12290;&#30740;&#31350;&#32467;&#26524;&#26174;&#31034;&#65292;&#36825;&#31181;&#26041;&#27861;&#22312;&#20272;&#35745;&#30561;&#30496;&#23545;&#24184;&#31119;&#24863;&#30340;&#24433;&#21709;&#26041;&#38754;&#19982;&#20256;&#32479;&#30340;2SLS&#20272;&#35745;&#32467;&#26524;&#30456;&#21563;&#21512;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35768;&#22810;&#23454;&#35777;&#30740;&#31350;&#20272;&#35745;&#20351;&#29992;&#20108;&#36827;&#21046;&#20202;&#22120;&#22788;&#29702;&#30340;&#36830;&#32493;&#20869;&#29983;&#21464;&#37327;&#65288;&#22788;&#29702;&#65289;&#30340;&#22240;&#26524;&#25928;&#24212;&#12290;&#36890;&#24120;&#36890;&#36807;&#32447;&#24615;2SLS&#36827;&#34892;&#20272;&#35745;&#12290;&#36825;&#31181;&#26041;&#27861;&#38656;&#35201;&#22788;&#29702;&#21464;&#21270;&#30340;&#24179;&#22343;&#20540;&#65292;&#24182;&#19988;&#22240;&#26524;&#35299;&#37322;&#38656;&#35201;&#31532;&#19968;&#38454;&#27573;&#30340;LATE&#22411;&#21333;&#35843;&#24615;&#12290;&#26367;&#20195;&#26041;&#27861;&#26159;&#25506;&#32034;&#22788;&#29702;&#30340;&#20998;&#24067;&#21464;&#21270;&#65292;&#20854;&#20013;&#31532;&#19968;&#38454;&#27573;&#30340;&#38480;&#21046;&#26159;&#22788;&#29702;&#30340;&#31561;&#32423;&#30456;&#20284;&#24615;&#12290;&#25105;&#20204;&#25552;&#20986;&#19968;&#31181;&#21452;&#37325;&#40065;&#26834;&#24615;&#30340;&#22240;&#26524;&#20272;&#35745;&#65292;&#23427;&#20204;&#22312;&#36825;&#20004;&#20010;&#38480;&#21046;&#19979;&#37117;&#26159;&#26377;&#25928;&#30340;&#12290;&#25105;&#20204;&#24212;&#29992;&#21452;&#37325;&#40065;&#26834;&#20272;&#35745;&#26469;&#20272;&#35745;&#30561;&#30496;&#23545;&#24184;&#31119;&#24863;&#30340;&#24433;&#21709;&#12290;&#25105;&#20204;&#30340;&#32467;&#26524;&#25903;&#25345;&#36890;&#24120;&#30340;2SLS&#20272;&#35745;&#12290;
&lt;/p&gt;
&lt;p&gt;
Many empirical applications estimate causal effects of a continuous endogenous variable (treatment) using a binary instrument. Estimation is typically done through linear 2SLS. This approach requires a mean treatment change and causal interpretation requires the LATE-type monotonicity in the first stage. An alternative approach is to explore distributional changes in the treatment, where the first-stage restriction is treatment rank similarity. We propose causal estimands that are doubly robust in that they are valid under either of these two restrictions. We apply the doubly robust estimation to estimate the impacts of sleep on well-being. Our results corroborate the usual 2SLS estimates.
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#25209;&#21028;&#24615;&#22320;&#20998;&#26512;&#20102;&#39321;&#28207;-&#20329;&#22855;&#23450;&#29702;&#65292;&#22312;&#25506;&#35752;&#38598;&#20307;&#26234;&#33021;&#20013;&#22810;&#26679;&#24615;&#21644;&#33021;&#21147;&#30340;&#30456;&#20114;&#20316;&#29992;&#26102;&#65292;&#25581;&#31034;&#20102;&#20854;&#22266;&#26377;&#30340;&#32570;&#38519;&#21644;&#35823;&#35299;&#12290;&#21516;&#26102;&#65292;&#35813;&#35770;&#25991;&#24378;&#35843;&#22312;&#24212;&#29992;&#25968;&#23398;&#21407;&#21017;&#20110;&#31038;&#20250;&#31185;&#23398;&#26102;&#35201;&#36991;&#20813;&#28389;&#29992;&#65292;&#24182;&#24378;&#35843;&#20102;&#8220;&#33021;&#21147;&#8221;&#30340;&#37325;&#35201;&#24615;&#12290;</title><link>http://arxiv.org/abs/2307.04709</link><description>&lt;p&gt;
&#39321;&#28207;-&#20329;&#22855;&#23450;&#29702;&#21644;Landemore&#30340;&#35748;&#35782;&#35770;&#35770;&#35777;&#20013;&#30340;&#33268;&#21629;&#25968;&#23398;&#38169;&#35823;
&lt;/p&gt;
&lt;p&gt;
Fatal mathematical errors in Hong-Page Theorem and Landemore's epistemic argument. (arXiv:2307.04709v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.04709
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25209;&#21028;&#24615;&#22320;&#20998;&#26512;&#20102;&#39321;&#28207;-&#20329;&#22855;&#23450;&#29702;&#65292;&#22312;&#25506;&#35752;&#38598;&#20307;&#26234;&#33021;&#20013;&#22810;&#26679;&#24615;&#21644;&#33021;&#21147;&#30340;&#30456;&#20114;&#20316;&#29992;&#26102;&#65292;&#25581;&#31034;&#20102;&#20854;&#22266;&#26377;&#30340;&#32570;&#38519;&#21644;&#35823;&#35299;&#12290;&#21516;&#26102;&#65292;&#35813;&#35770;&#25991;&#24378;&#35843;&#22312;&#24212;&#29992;&#25968;&#23398;&#21407;&#21017;&#20110;&#31038;&#20250;&#31185;&#23398;&#26102;&#35201;&#36991;&#20813;&#28389;&#29992;&#65292;&#24182;&#24378;&#35843;&#20102;&#8220;&#33021;&#21147;&#8221;&#30340;&#37325;&#35201;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#29702;&#35299;&#38598;&#20307;&#26234;&#33021;&#30340;&#36807;&#31243;&#20013;&#65292;&#39321;&#28207;-&#20329;&#22855;&#23450;&#29702;&#34987;&#25552;&#20986;&#20316;&#20026;&#22810;&#26679;&#24615;&#21644;&#33021;&#21147;&#30456;&#20114;&#20316;&#29992;&#30340;&#22522;&#30707;&#12290;&#28982;&#32780;&#65292;&#22312;&#32463;&#36807;&#20005;&#26684;&#30340;&#23457;&#26597;&#21518;&#65292;&#36825;&#20123;&#23450;&#29702;&#20013;&#20284;&#20046;&#23384;&#22312;&#30528;&#22266;&#26377;&#30340;&#32570;&#38519;&#21644;&#35823;&#35299;&#12290;H&#233;l&#232;ne Landemore&#22312;&#22905;&#30340;&#35748;&#35782;&#35770;&#35770;&#35777;&#21644;&#25919;&#27835;&#25552;&#26696;&#20013;&#23545;&#36825;&#20123;&#23450;&#29702;&#30340;&#24212;&#29992;&#23637;&#31034;&#20102;&#23545;&#25968;&#23398;&#21407;&#21017;&#30340;&#19981;&#24403;&#20351;&#29992;&#12290;&#26412;&#25991;&#23545;&#39321;&#28207;-&#20329;&#22855;&#23450;&#29702;&#36827;&#34892;&#20102;&#25209;&#21028;&#24615;&#21078;&#26512;&#65292;&#25581;&#31034;&#20102;&#37325;&#22823;&#30340;&#19981;&#19968;&#33268;&#24615;&#21644;&#30095;&#24573;&#65292;&#24182;&#24378;&#35843;&#20102;&#22312;&#32676;&#20307;&#38382;&#39064;&#35299;&#20915;&#32972;&#26223;&#19979;&#65292;&#8220;&#33021;&#21147;&#8221;&#30340;&#19981;&#21487;&#25110;&#32570;&#24615;&#12290;&#26412;&#25991;&#26088;&#22312;&#24378;&#35843;&#19981;&#28389;&#29992;&#25968;&#23398;&#21407;&#21017;&#30340;&#21361;&#38505;&#20197;&#21450;&#22312;&#23558;&#20854;&#24212;&#29992;&#20110;&#31038;&#20250;&#31185;&#23398;&#26102;&#26356;&#21152;&#32454;&#33268;&#30340;&#29702;&#35299;&#25968;&#23398;&#32467;&#26524;&#30340;&#24517;&#35201;&#24615;&#65292;&#32780;&#19981;&#26159;&#21066;&#24369;&#22810;&#26679;&#24615;&#30340;&#37325;&#35201;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
In the pursuit of understanding collective intelligence, the Hong-Page Theorems have been presented as cornerstones of the interplay between diversity and ability. However, upon rigorous examination, there seem to be inherent flaws and misinterpretations within these theorems. H\'el\`ene Landemore's application of these theorems in her epistemic argument and her political proposal showcases a rather unsettling misuse of mathematical principles. This paper critically dissects the HongPage Theorems, revealing significant inconsistencies and oversights, and underscores the indispensable role of 'ability' in group problem-solving contexts. This paper aims not to undermine the importance of diversity, but rather to highlight the dangers of misusing mathematical principles and the necessity for a more nuanced comprehension of mathematical results when applying them to social sciences.
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#22312;&#21322;&#21442;&#25968;&#31163;&#25955;&#36873;&#25321;&#27169;&#22411;&#20013;&#24212;&#29992;&#21305;&#37197;&#35782;&#21035;&#26041;&#27861;&#26469;&#30740;&#31350;&#32465;&#23450;&#65292;&#20854;&#21487;&#20197;&#22788;&#29702;&#36873;&#25321;&#20043;&#38388;&#30340;&#24178;&#25200;&#20013;&#20855;&#26377;&#24322;&#26041;&#24046;&#24615;&#21644;&#20219;&#24847;&#30456;&#20851;&#24615;&#12290;&#35813;&#25991;&#25552;&#20986;&#20102;&#20004;&#31181;&#27169;&#22411;&#65306;&#20132;&#21449;&#21644;&#38754;&#26495;&#25968;&#25454;&#27169;&#22411;&#12290;</title><link>http://arxiv.org/abs/2306.04135</link><description>&lt;p&gt;
&#21322;&#21442;&#25968;&#31163;&#25955;&#36873;&#25321;&#27169;&#22411;&#22312;&#32465;&#23450;&#20013;&#30340;&#24212;&#29992;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Semiparametric Discrete Choice Models for Bundles. (arXiv:2306.04135v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.04135
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#22312;&#21322;&#21442;&#25968;&#31163;&#25955;&#36873;&#25321;&#27169;&#22411;&#20013;&#24212;&#29992;&#21305;&#37197;&#35782;&#21035;&#26041;&#27861;&#26469;&#30740;&#31350;&#32465;&#23450;&#65292;&#20854;&#21487;&#20197;&#22788;&#29702;&#36873;&#25321;&#20043;&#38388;&#30340;&#24178;&#25200;&#20013;&#20855;&#26377;&#24322;&#26041;&#24046;&#24615;&#21644;&#20219;&#24847;&#30456;&#20851;&#24615;&#12290;&#35813;&#25991;&#25552;&#20986;&#20102;&#20004;&#31181;&#27169;&#22411;&#65306;&#20132;&#21449;&#21644;&#38754;&#26495;&#25968;&#25454;&#27169;&#22411;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#20272;&#35745;&#21644;&#25512;&#26029;&#26041;&#27861;&#65292;&#29992;&#20110;&#36827;&#34892;&#21322;&#21442;&#25968;&#31163;&#25955;&#36873;&#25321;&#27169;&#22411;&#22312;&#20132;&#21449;&#21644;&#38754;&#26495;&#25968;&#25454;&#35774;&#32622;&#20013;&#23545;&#32465;&#23450;&#30340;&#30740;&#31350;&#12290;&#25105;&#20204;&#30340;&#21305;&#37197;&#35782;&#21035;&#26041;&#27861;&#20801;&#35768;&#22312;&#36873;&#25321;&#20043;&#38388;&#30340;&#24178;&#25200;&#20013;&#20855;&#26377;&#26576;&#20123;&#24418;&#24335;&#30340;&#24322;&#26041;&#24046;&#24615;&#21644;&#20219;&#24847;&#30456;&#20851;&#24615;&#12290;&#23545;&#20110;&#20132;&#21449;&#27169;&#22411;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26680;&#21152;&#26435;&#31561;&#32423;&#31243;&#24207;&#65292;&#24182;&#23637;&#31034;&#20102;&#38750;&#21442;&#25968;bootstrap&#22312;&#25512;&#26029;&#20013;&#30340;&#26377;&#25928;&#24615;&#12290;&#23545;&#20110;&#38754;&#26495;&#25968;&#25454;&#27169;&#22411;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#23616;&#37096;&#26368;&#22823;&#20998;&#25968;&#20272;&#35745;&#37327;&#65292;&#24182;&#34920;&#26126;&#25968;&#20540;bootstrap&#26159;&#19968;&#31181;&#26377;&#25928;&#30340;&#25512;&#26029;&#26041;&#27861;&#12290;&#33945;&#29305;&#21345;&#32599;&#23454;&#39564;&#34920;&#26126;&#65292;&#25105;&#20204;&#25552;&#20986;&#30340;&#20272;&#35745;&#21644;&#25512;&#26029;&#31243;&#24207;&#22312;&#26377;&#38480;&#26679;&#26412;&#20013;&#34920;&#29616;&#33391;&#22909;&#12290;
&lt;/p&gt;
&lt;p&gt;
We propose methods of estimation and inference for use in semiparametric discrete choice models for bundles in both cross-sectional and panel data settings. Our matching-based identification approach permits certain forms of heteroskedasticity and arbitrary correlation in the disturbances across choices. For the cross-sectional model, we propose a kernel-weighted rank procedure and show the validity of the nonparametric bootstrap for the inference. For the panel data model, we propose localized maximum score estimators and show that the numerical bootstrap is a valid inference method. Monte Carlo experiments demonstrate that our proposed estimation and inference procedures perform adequately in finite samples.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;GPT&#22312;&#32463;&#27982;&#29702;&#24615;&#26041;&#38754;&#30340;&#33021;&#21147;&#65292;&#36890;&#36807;&#25351;&#31034;&#20854;&#22312;4&#20010;&#39046;&#22495;&#20013;&#20570;&#20986;&#39044;&#31639;&#20915;&#31574;&#65292;&#21457;&#29616;GPT&#20915;&#31574;&#22522;&#26412;&#19978;&#26159;&#21512;&#29702;&#30340;&#65292;&#24182;&#19988;&#27604;&#20154;&#31867;&#26356;&#20855;&#26377;&#29702;&#24615;&#12290;</title><link>http://arxiv.org/abs/2305.12763</link><description>&lt;p&gt;
GPT&#30340;&#32463;&#27982;&#29702;&#24615;&#20986;&#29616;
&lt;/p&gt;
&lt;p&gt;
The Emergence of Economic Rationality of GPT. (arXiv:2305.12763v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.12763
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;GPT&#22312;&#32463;&#27982;&#29702;&#24615;&#26041;&#38754;&#30340;&#33021;&#21147;&#65292;&#36890;&#36807;&#25351;&#31034;&#20854;&#22312;4&#20010;&#39046;&#22495;&#20013;&#20570;&#20986;&#39044;&#31639;&#20915;&#31574;&#65292;&#21457;&#29616;GPT&#20915;&#31574;&#22522;&#26412;&#19978;&#26159;&#21512;&#29702;&#30340;&#65292;&#24182;&#19988;&#27604;&#20154;&#31867;&#26356;&#20855;&#26377;&#29702;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38543;&#30528;&#20687;GPT&#36825;&#26679;&#30340;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#36234;&#26469;&#36234;&#26222;&#36941;&#65292;&#35780;&#20272;&#23427;&#20204;&#22312;&#35821;&#35328;&#22788;&#29702;&#20043;&#22806;&#30340;&#33021;&#21147;&#33267;&#20851;&#37325;&#35201;&#12290;&#26412;&#25991;&#36890;&#36807;&#25351;&#31034;GPT&#22312;&#39118;&#38505;&#12289;&#26102;&#38388;&#12289;&#31038;&#20132;&#21644;&#39135;&#21697;&#20559;&#22909;&#30340;&#22235;&#20010;&#39046;&#22495;&#20013;&#36827;&#34892;&#39044;&#31639;&#20915;&#31574;&#26469;&#30740;&#31350;GPT&#30340;&#32463;&#27982;&#29702;&#24615;&#12290;&#25105;&#20204;&#36890;&#36807;&#35780;&#20272;GPT&#20915;&#31574;&#19982;&#21476;&#20856;&#25581;&#31034;&#20559;&#22909;&#29702;&#35770;&#20013;&#30340;&#25928;&#29992;&#26368;&#22823;&#21270;&#19968;&#33268;&#24615;&#26469;&#34913;&#37327;&#32463;&#27982;&#29702;&#24615;&#12290;&#25105;&#20204;&#21457;&#29616;GPT&#22312;&#27599;&#20010;&#39046;&#22495;&#30340;&#20915;&#31574;&#22522;&#26412;&#19978;&#26159;&#21512;&#29702;&#30340;&#65292;&#24182;&#19988;&#34920;&#29616;&#20986;&#27604;&#25991;&#29486;&#25253;&#36947;&#30340;&#20154;&#31867;&#26356;&#39640;&#30340;&#29702;&#24615;&#24471;&#20998;&#12290;&#25105;&#20204;&#36824;&#21457;&#29616;&#65292;&#29702;&#24615;&#24471;&#20998;&#23545;&#20110;&#38543;&#26426;&#31243;&#24230;&#21644;&#20154;&#21475;&#32479;&#35745;&#23398;&#35774;&#32622;&#65288;&#22914;&#24180;&#40836;&#21644;&#24615;&#21035;&#65289;&#26159;&#31283;&#20581;&#30340;&#65292;&#20294;&#23545;&#22522;&#20110;&#36873;&#25321;&#24773;&#22659;&#30340;&#35821;&#35328;&#26694;&#26550;&#30340;&#19978;&#19979;&#25991;&#25935;&#24863;&#12290;&#36825;&#20123;&#32467;&#26524;&#34920;&#26126;&#20102;LLM&#20316;&#20986;&#33391;&#22909;&#20915;&#31574;&#30340;&#28508;&#21147;&#65292;&#20197;&#21450;&#38656;&#35201;&#36827;&#19968;&#27493;&#20102;&#35299;&#23427;&#20204;&#30340;&#33021;&#21147;&#12289;&#23616;&#38480;&#24615;&#21644;&#22522;&#26412;&#26426;&#21046;&#12290;
&lt;/p&gt;
&lt;p&gt;
As large language models (LLMs) like GPT become increasingly prevalent, it is essential that we assess their capabilities beyond language processing. This paper examines the economic rationality of GPT by instructing it to make budgetary decisions in four domains: risk, time, social, and food preferences. We measure economic rationality by assessing the consistency of GPT decisions with utility maximization in classic revealed preference theory. We find that GPT decisions are largely rational in each domain and demonstrate higher rationality scores than those of humans reported in the literature. We also find that the rationality scores are robust to the degree of randomness and demographic settings such as age and gender, but are sensitive to contexts based on the language frames of the choice situations. These results suggest the potential of LLMs to make good decisions and the need to further understand their capabilities, limitations, and underlying mechanisms.
&lt;/p&gt;</description></item><item><title>&#31227;&#27665;&#22312;&#19968;&#20010;&#37197;&#32473;&#32844;&#20301;&#30340;&#21305;&#37197;&#27169;&#22411;&#20013;&#21487;&#33021;&#38477;&#20302;&#26412;&#22320;&#24037;&#20154;&#30340;&#23601;&#19994;&#29575;&#65292;&#20294;&#31227;&#27665;&#23545;&#26412;&#22320;&#31119;&#21033;&#30340;&#24635;&#20307;&#24433;&#21709;&#21462;&#20915;&#20110;&#21171;&#21160;&#21147;&#24066;&#22330;&#30340;&#29366;&#24577;&#65292;&#24403;&#21171;&#21160;&#21147;&#24066;&#22330;&#32321;&#33635;&#26102;&#65292;&#31227;&#27665;&#30340;&#24433;&#21709;&#21487;&#33021;&#26159;&#27491;&#38754;&#30340;&#12290;</title><link>http://arxiv.org/abs/2303.13319</link><description>&lt;p&gt;
&#20026;&#20160;&#20040;&#31227;&#27665;&#24635;&#34987;&#25351;&#36131;&#31363;&#21462;&#20154;&#20204;&#30340;&#24037;&#20316;?
&lt;/p&gt;
&lt;p&gt;
Why Are Immigrants Always Accused of Stealing People's Jobs?. (arXiv:2303.13319v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.13319
&lt;/p&gt;
&lt;p&gt;
&#31227;&#27665;&#22312;&#19968;&#20010;&#37197;&#32473;&#32844;&#20301;&#30340;&#21305;&#37197;&#27169;&#22411;&#20013;&#21487;&#33021;&#38477;&#20302;&#26412;&#22320;&#24037;&#20154;&#30340;&#23601;&#19994;&#29575;&#65292;&#20294;&#31227;&#27665;&#23545;&#26412;&#22320;&#31119;&#21033;&#30340;&#24635;&#20307;&#24433;&#21709;&#21462;&#20915;&#20110;&#21171;&#21160;&#21147;&#24066;&#22330;&#30340;&#29366;&#24577;&#65292;&#24403;&#21171;&#21160;&#21147;&#24066;&#22330;&#32321;&#33635;&#26102;&#65292;&#31227;&#27665;&#30340;&#24433;&#21709;&#21487;&#33021;&#26159;&#27491;&#38754;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#31227;&#27665;&#24635;&#26159;&#34987;&#25351;&#36131;&#31363;&#21462;&#20154;&#20204;&#30340;&#24037;&#20316;&#12290;&#28982;&#32780;&#65292;&#22312;&#21171;&#21160;&#21147;&#24066;&#22330;&#30340;&#26032;&#21476;&#20856;&#27169;&#22411;&#20013;&#65292;&#27599;&#20010;&#20154;&#37117;&#26377;&#24037;&#20316;&#21487;&#20570;&#65292;&#20063;&#27809;&#26377;&#24037;&#20316;&#21487;&#34987;&#31363;&#21462;&#65288;&#27809;&#26377;&#22833;&#19994;&#65292;&#22240;&#27492;&#24819;&#24037;&#20316;&#30340;&#20154;&#37117;&#21487;&#20197;&#24037;&#20316;&#65289;&#12290;&#22312;&#26631;&#20934;&#21305;&#37197;&#27169;&#22411;&#20013;&#65292;&#23384;&#22312;&#19968;&#20123;&#22833;&#19994;&#65292;&#20294;&#30001;&#20110;&#21171;&#21160;&#21147;&#38656;&#27714;&#23436;&#20840;&#24377;&#24615;&#65292;&#22240;&#27492;&#26032;&#36827;&#20837;&#21171;&#21160;&#21147;&#24066;&#22330;&#30340;&#20154;&#34987;&#21560;&#25910;&#26102;&#19981;&#20250;&#24433;&#21709;&#27714;&#32844;&#32773;&#30340;&#21069;&#26223;&#12290;&#20877;&#27425;&#35828;&#26126;&#65292;&#24403;&#31227;&#27665;&#21040;&#36798;&#26102;&#27809;&#26377;&#24037;&#20316;&#20250;&#34987;&#31363;&#21462;&#12290;&#26412;&#25991;&#26174;&#31034;&#65292;&#22312;&#19968;&#20010;&#20855;&#26377;&#23601;&#19994;&#37197;&#32473;&#30340;&#21305;&#37197;&#27169;&#22411;&#20013;&#65292;&#31227;&#27665;&#30340;&#36827;&#20837;&#20250;&#38477;&#20302;&#26412;&#22320;&#24037;&#20154;&#30340;&#23601;&#19994;&#29575;&#12290;&#27492;&#22806;&#65292;&#24403;&#21171;&#21160;&#21147;&#24066;&#22330;&#19981;&#26223;&#27668;&#26102;&#65292;&#23601;&#19994;&#29575;&#30340;&#38477;&#24133;&#26356;&#22823;&#65292;&#22240;&#20026;&#37027;&#26102;&#24037;&#20316;&#26356;&#21152;&#31232;&#32570;&#12290;&#22240;&#20026;&#31227;&#27665;&#38477;&#20302;&#20102;&#21171;&#21160;&#21147;&#24066;&#22330;&#30340;&#32039;&#24352;&#31243;&#24230;&#65292;&#20351;&#24471;&#20844;&#21496;&#26356;&#23481;&#26131;&#25307;&#32856;&#65292;&#24182;&#25913;&#21892;&#20844;&#21496;&#21033;&#28070;&#12290;&#31227;&#27665;&#23545;&#26412;&#22320;&#31119;&#21033;&#30340;&#24635;&#20307;&#24433;&#21709;&#21462;&#20915;&#20110;&#21171;&#21160;&#21147;&#24066;&#22330;&#30340;&#29366;&#24577;&#12290;&#24403;&#21171;&#21160;&#21147;&#24066;&#22330;&#20986;&#29616;&#34928;&#36864;&#26102;&#24635;&#20307;&#24433;&#21709;&#22987;&#32456;&#26159;&#36127;&#38754;&#30340;&#65292;&#24182;&#19988;&#24403;&#21171;&#21160;&#21147;&#24066;&#22330;&#32321;&#33635;&#26102;&#21487;&#33021;&#26159;&#27491;&#38754;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
Immigrants are always accused of stealing people's jobs. Yet, in a neoclassical model of the labor market, there are jobs for everybody and no jobs to steal. (There is no unemployment, so anybody who wants to work can work.) In standard matching models, there is some unemployment, but labor demand is perfectly elastic so new entrants into the labor force are absorbed without affecting jobseekers' prospects. Once again, no jobs are stolen when immigrants arrive. This paper shows that in a matching model with job rationing, in contrast, the entry of immigrants reduces the employment rate of native workers. Moreover, the reduction in employment rate is sharper when the labor market is depressed -- because jobs are more scarce then. Because immigration reduces labor-market tightness, it makes it easier for firms to recruit and improves firm profits. The overall effect of immigration on native welfare depends on the state of the labor market. It is always negative when the labor market is i
&lt;/p&gt;</description></item><item><title>&#36825;&#31687;&#35770;&#25991;&#23637;&#31034;&#20102;&#22312;&#22810;&#20010;&#24322;&#26500;&#29289;&#21697;&#30340;&#26426;&#21046;&#35774;&#35745;&#38382;&#39064;&#19982;&#22312;&#30456;&#21516;&#29289;&#21697;&#30340;&#26426;&#21046;&#35774;&#35745;&#38382;&#39064;&#20043;&#38388;&#30340;&#31561;&#20215;&#24615;&#65292;&#21516;&#26102;&#25552;&#20986;&#20102;&#20445;&#25345;&#25490;&#21517;&#30340;&#23545;&#31216;&#21644;&#28608;&#21169;&#30456;&#23481;&#26426;&#21046;&#65292;&#24182;&#22312;&#19977;&#20010;&#24212;&#29992;&#20013;&#36827;&#34892;&#20102;&#20351;&#29992;&#12290;</title><link>http://arxiv.org/abs/2209.10137</link><description>&lt;p&gt;
&#20445;&#25345;&#25490;&#21517;&#30340;&#22810;&#32500;&#24230;&#26426;&#21046;
&lt;/p&gt;
&lt;p&gt;
Rank-Preserving Multidimensional Mechanisms. (arXiv:2209.10137v3 [econ.TH] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2209.10137
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#23637;&#31034;&#20102;&#22312;&#22810;&#20010;&#24322;&#26500;&#29289;&#21697;&#30340;&#26426;&#21046;&#35774;&#35745;&#38382;&#39064;&#19982;&#22312;&#30456;&#21516;&#29289;&#21697;&#30340;&#26426;&#21046;&#35774;&#35745;&#38382;&#39064;&#20043;&#38388;&#30340;&#31561;&#20215;&#24615;&#65292;&#21516;&#26102;&#25552;&#20986;&#20102;&#20445;&#25345;&#25490;&#21517;&#30340;&#23545;&#31216;&#21644;&#28608;&#21169;&#30456;&#23481;&#26426;&#21046;&#65292;&#24182;&#22312;&#19977;&#20010;&#24212;&#29992;&#20013;&#36827;&#34892;&#20102;&#20351;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#23637;&#31034;&#20102;&#23545;&#20110;&#19968;&#20010;&#22404;&#26029;&#32773;&#21521;&#19968;&#20010;&#20855;&#26377;&#21069;&#26399;&#23545;&#31216;&#21644;&#21487;&#21152;&#20540;&#30340;&#20080;&#23478;&#20986;&#21806;&#22810;&#20010;&#24322;&#26500;&#29289;&#21697;&#30340;&#26426;&#21046;&#35774;&#35745;&#38382;&#39064;&#19982;&#23545;&#20110;&#19968;&#20010;&#21521;&#19968;&#20010;&#20855;&#26377;&#36882;&#20943;&#36793;&#38469;&#20540;&#30340;&#20080;&#23478;&#20986;&#21806;&#30456;&#21516;&#29289;&#21697;&#30340;&#22404;&#26029;&#32773;&#30340;&#26426;&#21046;&#35774;&#35745;&#38382;&#39064;&#26159;&#31561;&#20215;&#30340;&#12290;&#23545;&#20110;&#24322;&#26500;&#29289;&#21697;&#65292;&#23545;&#31216;&#21644;&#28608;&#21169;&#30456;&#23481;&#30340;&#26426;&#21046;&#26159;&#20445;&#25345;&#25490;&#21517;&#30340;&#65292;&#21363;&#39640;&#20215;&#20540;&#29289;&#21697;&#20855;&#26377;&#26356;&#39640;&#30340;&#20998;&#37197;&#27010;&#29575;&#12290;&#22312;&#30456;&#21516;&#29289;&#21697;&#27169;&#22411;&#20013;&#65292;&#27599;&#20010;&#26426;&#21046;&#37117;&#26159;&#20445;&#25345;&#25490;&#21517;&#30340;&#12290;&#36825;&#20419;&#36827;&#20102;&#25105;&#20204;&#22312;&#19977;&#20010;&#24212;&#29992;&#20013;&#30340;&#31561;&#20215;&#24615;&#30340;&#20351;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;
We show that the mechanism-design problem for a monopolist selling multiple, heterogeneous objects to a buyer with ex ante symmetric and additive values is equivalent to the mechanism-design problem for a monopolist selling identical objects to a buyer with decreasing marginal values. Symmetric and incentive-compatible mechanisms for heterogeneous objects are rank preserving, i.e., higher-valued objects are assigned with a higher probability. In the identical-objects model, every mechanism is rank preserving. This facilitates the equivalence, which we use in three applications.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#20225;&#19994;&#32929;&#19996;&#25511;&#21046;&#26435;&#30340;&#20135;&#29983;&#26426;&#21046;&#65292;&#21457;&#29616;&#26368;&#39640;1&#21495;&#32929;&#19996;&#25317;&#26377;&#26368;&#20248;&#25511;&#21046;&#26435;&#30340;&#27010;&#29575;&#25353;&#26000;&#27874;&#37027;&#22865;&#25968;&#21015;&#30340;&#27169;&#24335;&#38543;&#26102;&#38388;&#28436;&#21464;&#65292;&#22312;12&#23567;&#26102;&#30340;&#26102;&#38388;&#21608;&#26399;&#20869;&#28014;&#21160;&#22312;1/2&#33267;2/3&#20043;&#38388;&#65292;&#30456;&#20851;&#25968;&#25454;&#25903;&#25345;&#20102;&#39044;&#27979;&#12290;</title><link>http://arxiv.org/abs/2106.01681</link><description>&lt;p&gt;
&#12298;&#20225;&#19994;&#25511;&#21046;&#26435;&#30340;&#36215;&#28304;&#12299;
&lt;/p&gt;
&lt;p&gt;
The Origin of Corporate Control Power. (arXiv:2106.01681v10 [econ.TH] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2106.01681
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#20225;&#19994;&#32929;&#19996;&#25511;&#21046;&#26435;&#30340;&#20135;&#29983;&#26426;&#21046;&#65292;&#21457;&#29616;&#26368;&#39640;1&#21495;&#32929;&#19996;&#25317;&#26377;&#26368;&#20248;&#25511;&#21046;&#26435;&#30340;&#27010;&#29575;&#25353;&#26000;&#27874;&#37027;&#22865;&#25968;&#21015;&#30340;&#27169;&#24335;&#38543;&#26102;&#38388;&#28436;&#21464;&#65292;&#22312;12&#23567;&#26102;&#30340;&#26102;&#38388;&#21608;&#26399;&#20869;&#28014;&#21160;&#22312;1/2&#33267;2/3&#20043;&#38388;&#65292;&#30456;&#20851;&#25968;&#25454;&#25903;&#25345;&#20102;&#39044;&#27979;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20225;&#19994;&#32929;&#19996;&#30340;&#25511;&#21046;&#26435;&#26159;&#22914;&#20309;&#20135;&#29983;&#30340;&#65311;&#22522;&#20110;&#32463;&#27982;&#23398;&#30340;&#22522;&#26412;&#21407;&#29702;&#65292;&#25105;&#20204;&#21457;&#29616;&#26368;&#39640;1&#21495;&#32929;&#19996;&#25317;&#26377;&#26368;&#20248;&#25511;&#21046;&#26435;&#30340;&#27010;&#29575;&#26159;&#20197;&#26000;&#27874;&#37027;&#22865;&#25968;&#21015;&#27169;&#24335;&#28436;&#21464;&#30340;&#65292;&#24182;&#22312;&#27599;12&#23567;&#26102;&#30340;&#26102;&#38388;&#21608;&#26399;&#20869;&#28014;&#21160;&#22312;1/2&#33267;2/3&#20043;&#38388;&#12290;&#36825;&#19968;&#26032;&#39062;&#29305;&#28857;&#34920;&#26126;&#20102;&#20225;&#19994;&#32929;&#19996;&#26435;&#21033;&#21644;&#26435;&#21147;&#20998;&#37197;&#30340;&#25928;&#29575;&#12290;&#20013;&#22269;&#32929;&#24066;&#30340;&#25968;&#25454;&#25903;&#25345;&#20102;&#36825;&#19968;&#39044;&#27979;&#12290;
&lt;/p&gt;
&lt;p&gt;
How does the control power of corporate shareholder arise? On the fundamental principles of economics, we discover that the probability of top1 shareholder possessing optimal control power evolves in Fibonacci series pattern and emerges as the wave between 1/2 and 2/3 along with time in period of 12h (h is the time distance between the state and state of the evolution). This novel feature suggests the efficiency of the allocation of corporate shareholders' right and power. Data on the Chinese stock market support this prediction.
&lt;/p&gt;</description></item></channel></rss>