<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#20004;&#31181;&#26041;&#27861;&#26469;&#20272;&#35745;&#21322;&#21442;&#25968;&#30340;&#31163;&#25955;&#36873;&#25321;&#27169;&#22411;&#65292;&#19968;&#31181;&#26159;&#22522;&#20110;&#21305;&#37197;&#30340;&#26680;&#21152;&#26435;&#31209;&#20272;&#35745;&#22120;&#65292;&#21478;&#19968;&#31181;&#26159;&#22810;&#25351;&#26631;&#26368;&#23567;&#32477;&#23545;&#20559;&#24046;&#20272;&#35745;&#22120;&#12290;&#36825;&#20123;&#26041;&#27861;&#37117;&#33021;&#32771;&#34385;&#25200;&#21160;&#30340;&#30456;&#20851;&#24615;&#65292;&#24182;&#21487;&#20197;&#22312;&#22791;&#36873;&#21644;&#20010;&#20307;&#29305;&#23450;&#30340;&#22238;&#24402;&#21464;&#37327;&#19978;&#20272;&#35745;&#20559;&#22909;&#21442;&#25968;&#12290;</title><link>http://arxiv.org/abs/2311.00013</link><description>&lt;p&gt;
&#21487;&#20379;&#36873;&#25321;&#30340;&#21322;&#21442;&#25968;&#31163;&#25955;&#36873;&#25321;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
Semiparametric Discrete Choice Models for Bundles. (arXiv:2311.00013v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2311.00013
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#20004;&#31181;&#26041;&#27861;&#26469;&#20272;&#35745;&#21322;&#21442;&#25968;&#30340;&#31163;&#25955;&#36873;&#25321;&#27169;&#22411;&#65292;&#19968;&#31181;&#26159;&#22522;&#20110;&#21305;&#37197;&#30340;&#26680;&#21152;&#26435;&#31209;&#20272;&#35745;&#22120;&#65292;&#21478;&#19968;&#31181;&#26159;&#22810;&#25351;&#26631;&#26368;&#23567;&#32477;&#23545;&#20559;&#24046;&#20272;&#35745;&#22120;&#12290;&#36825;&#20123;&#26041;&#27861;&#37117;&#33021;&#32771;&#34385;&#25200;&#21160;&#30340;&#30456;&#20851;&#24615;&#65292;&#24182;&#21487;&#20197;&#22312;&#22791;&#36873;&#21644;&#20010;&#20307;&#29305;&#23450;&#30340;&#22238;&#24402;&#21464;&#37327;&#19978;&#20272;&#35745;&#20559;&#22909;&#21442;&#25968;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#20004;&#31181;&#26041;&#27861;&#26469;&#20272;&#35745;&#21322;&#21442;&#25968;&#30340;&#31163;&#25955;&#36873;&#25321;&#27169;&#22411;&#12290;&#25105;&#20204;&#30340;&#31532;&#19968;&#31181;&#26041;&#27861;&#26159;&#22522;&#20110;&#21305;&#37197;&#30340;&#35782;&#21035;&#31574;&#30053;&#30340;&#26680;&#21152;&#26435;&#31209;&#20272;&#35745;&#22120;&#12290;&#25105;&#20204;&#24314;&#31435;&#20102;&#20854;&#23436;&#25972;&#30340;&#28176;&#36817;&#24615;&#36136;&#65292;&#24182;&#35777;&#26126;&#20102;&#38750;&#21442;&#25968;&#33258;&#21161;&#27861;&#30340;&#25512;&#26029;&#26377;&#25928;&#24615;&#12290;&#28982;&#21518;&#65292;&#25105;&#20204;&#20171;&#32461;&#20102;&#19968;&#31181;&#26032;&#30340;&#22810;&#25351;&#26631;&#26368;&#23567;&#32477;&#23545;&#20559;&#24046;&#65288;LAD&#65289;&#20272;&#35745;&#22120;&#20316;&#20026;&#26367;&#20195;&#26041;&#27861;&#65292;&#20854;&#20027;&#35201;&#20248;&#28857;&#26159;&#33021;&#22815;&#22312;&#22791;&#36873;&#21644;&#20010;&#20307;&#29305;&#23450;&#30340;&#22238;&#24402;&#21464;&#37327;&#19978;&#20272;&#35745;&#20559;&#22909;&#21442;&#25968;&#12290;&#36825;&#20004;&#31181;&#26041;&#27861;&#37117;&#33021;&#22815;&#32771;&#34385;&#36873;&#25321;&#20043;&#38388;&#20219;&#24847;&#30340;&#25200;&#21160;&#30456;&#20851;&#24615;&#65292;&#21069;&#32773;&#36824;&#21487;&#20197;&#32771;&#34385;&#20154;&#38469;&#24322;&#26041;&#24046;&#24615;&#12290;&#25105;&#20204;&#36824;&#35777;&#26126;&#20102;&#36825;&#20123;&#31243;&#24207;&#32972;&#21518;&#30340;&#35782;&#21035;&#31574;&#30053;&#21487;&#20197;&#33258;&#28982;&#22320;&#25512;&#24191;&#21040;&#38754;&#26495;&#25968;&#25454;&#35774;&#32622;&#65292;&#20174;&#32780;&#20135;&#29983;&#31867;&#20284;&#30340;&#23616;&#37096;&#26497;&#22823;&#20540;&#20272;&#35745;&#22120;&#21644;&#29992;&#20110;&#20272;&#35745;&#24102;&#26377;&#22266;&#23450;&#25928;&#24212;&#30340;&#25414;&#32465;&#36873;&#25321;&#27169;&#22411;&#30340;LAD&#20272;&#35745;&#22120;&#12290;&#25105;&#20204;&#25512;&#23548;&#20986;&#20102;&#36825;&#20123;&#20272;&#35745;&#22120;&#30340;&#26497;&#38480;&#20998;&#24067;&#12290;
&lt;/p&gt;
&lt;p&gt;
We propose two approaches to estimate semiparametric discrete choice models for bundles. Our first approach is a kernel-weighted rank estimator based on a matching-based identification strategy. We establish its complete asymptotic properties and prove the validity of the nonparametric bootstrap for inference. We then introduce a new multi-index least absolute deviations (LAD) estimator as an alternative, of which the main advantage is its capacity to estimate preference parameters on both alternative- and agent-specific regressors. Both methods can account for arbitrary correlation in disturbances across choices, with the former also allowing for interpersonal heteroskedasticity. We also demonstrate that the identification strategy underlying these procedures can be extended naturally to panel data settings, producing an analogous localized maximum score estimator and a LAD estimator for estimating bundle choice models with fixed effects. We derive the limiting distribution of the for
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#36890;&#36807;&#23558;&#20154;&#31867;&#21442;&#19982;&#32773;&#19982;&#26426;&#22120;&#20154;&#29609;&#23478;&#37197;&#23545;&#65292;&#21457;&#29616;&#24403;&#19982;&#26426;&#22120;&#20154;&#37197;&#23545;&#26102;&#65292;&#20010;&#20307;&#34920;&#29616;&#20986;&#36739;&#39640;&#30340;&#29702;&#24615;&#27700;&#24179;&#65292;&#24182;&#22312;&#19981;&#21516;&#28216;&#25103;&#20013;&#20445;&#25345;&#31283;&#23450;&#27700;&#24179;&#12290;&#36825;&#20026;&#35780;&#20272;&#20010;&#20307;&#25112;&#30053;&#33021;&#21147;&#25552;&#20379;&#20102;&#19968;&#31181;&#26032;&#26041;&#27861;&#12290;</title><link>http://arxiv.org/abs/2309.07427</link><description>&lt;p&gt;
&#29992;&#20449;&#24565;&#25511;&#21046;&#26469;&#34913;&#37327;&#39640;&#38454;&#29702;&#24615;
&lt;/p&gt;
&lt;p&gt;
Measuring Higher-Order Rationality with Belief Control. (arXiv:2309.07427v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.07427
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#36890;&#36807;&#23558;&#20154;&#31867;&#21442;&#19982;&#32773;&#19982;&#26426;&#22120;&#20154;&#29609;&#23478;&#37197;&#23545;&#65292;&#21457;&#29616;&#24403;&#19982;&#26426;&#22120;&#20154;&#37197;&#23545;&#26102;&#65292;&#20010;&#20307;&#34920;&#29616;&#20986;&#36739;&#39640;&#30340;&#29702;&#24615;&#27700;&#24179;&#65292;&#24182;&#22312;&#19981;&#21516;&#28216;&#25103;&#20013;&#20445;&#25345;&#31283;&#23450;&#27700;&#24179;&#12290;&#36825;&#20026;&#35780;&#20272;&#20010;&#20307;&#25112;&#30053;&#33021;&#21147;&#25552;&#20379;&#20102;&#19968;&#31181;&#26032;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20165;&#22522;&#20110;&#36873;&#25321;&#25968;&#25454;&#30830;&#23450;&#20010;&#20307;&#30340;&#25112;&#30053;&#25512;&#29702;&#33021;&#21147;&#26159;&#19968;&#39033;&#22797;&#26434;&#30340;&#20219;&#21153;&#12290;&#36825;&#31181;&#22797;&#26434;&#24615;&#28304;&#20110;&#22797;&#26434;&#30340;&#29609;&#23478;&#21487;&#33021;&#23545;&#20854;&#20182;&#20154;&#26377;&#38750;&#22343;&#34913;&#30340;&#20449;&#24565;&#65292;&#23548;&#33268;&#38750;&#22343;&#34913;&#30340;&#34892;&#20026;&#12290;&#22312;&#25105;&#20204;&#30340;&#30740;&#31350;&#20013;&#65292;&#25105;&#20204;&#23558;&#20154;&#31867;&#21442;&#19982;&#32773;&#19982;&#24050;&#30693;&#23436;&#20840;&#29702;&#24615;&#30340;&#35745;&#31639;&#26426;&#29609;&#23478;&#37197;&#23545;&#12290;&#36890;&#36807;&#20351;&#29992;&#26426;&#22120;&#20154;&#29609;&#23478;&#65292;&#25105;&#20204;&#33021;&#22815;&#23558;&#26377;&#38480;&#30340;&#25512;&#29702;&#33021;&#21147;&#19982;&#20449;&#24565;&#24418;&#25104;&#21644;&#31038;&#20250;&#20559;&#24046;&#30456;&#21306;&#20998;&#24320;&#26469;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;&#24403;&#19982;&#26426;&#22120;&#20154;&#37197;&#23545;&#26102;&#65292;&#34987;&#35797;&#34920;&#29616;&#20986;&#22987;&#32456;&#36739;&#39640;&#30340;&#29702;&#24615;&#27700;&#24179;&#65292;&#24182;&#22312;&#19981;&#21516;&#28216;&#25103;&#20013;&#20445;&#25345;&#31283;&#23450;&#30340;&#29702;&#24615;&#27700;&#24179;&#65292;&#30456;&#27604;&#20043;&#19979;&#19982;&#20154;&#31867;&#37197;&#23545;&#26102;&#21017;&#19981;&#28982;&#12290;&#36825;&#34920;&#26126;&#25112;&#30053;&#25512;&#29702;&#21487;&#33021;&#30340;&#30830;&#26159;&#20010;&#20307;&#30340;&#19968;&#31181;&#19968;&#36143;&#29305;&#24449;&#12290;&#27492;&#22806;&#65292;&#30830;&#23450;&#30340;&#29702;&#24615;&#38480;&#21046;&#21487;&#20197;&#20316;&#20026;&#35780;&#20272;&#20010;&#20307;&#23545;&#20182;&#20154;&#20449;&#24565;&#36866;&#24403;&#25511;&#21046;&#26102;&#30340;&#25112;&#30053;&#33021;&#21147;&#30340;&#25351;&#26631;&#12290;
&lt;/p&gt;
&lt;p&gt;
Determining an individual's strategic reasoning capability based solely on choice data is a complex task. This complexity arises because sophisticated players might have non-equilibrium beliefs about others, leading to non-equilibrium actions. In our study, we pair human participants with computer players known to be fully rational. This use of robot players allows us to disentangle limited reasoning capacity from belief formation and social biases. Our results show that, when paired with robots, subjects consistently demonstrate higher levels of rationality and maintain stable rationality levels across different games compared to when paired with humans. This suggests that strategic reasoning might indeed be a consistent trait in individuals. Furthermore, the identified rationality limits could serve as a measure for evaluating an individual's strategic capacity when their beliefs about others are adequately controlled.
&lt;/p&gt;</description></item></channel></rss>