<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#36890;&#36807;&#36845;&#20195;&#22256;&#22659;&#21338;&#24328;&#29702;&#35770;&#21644;&#21452;&#36793;&#25774;&#21512;&#24066;&#22330;&#35270;&#35282;&#65292;&#30740;&#31350;&#20102;&#34394;&#20551;&#26032;&#38395;&#20256;&#25773;&#21644;&#20107;&#23454;&#26680;&#26597;&#25104;&#26412;&#23545;&#20449;&#24687;&#24066;&#22330;&#24179;&#34913;&#30340;&#24433;&#21709;&#65292;&#25506;&#35752;&#20102;&#26032;&#38395;&#25552;&#20379;&#32773;&#22312;&#36873;&#25321;&#25112;&#30053;&#26102;&#38754;&#20020;&#30340;&#25361;&#25112;&#20197;&#21450;&#26368;&#22823;&#22870;&#21169;&#21644;&#26368;&#23567;&#21270;&#25104;&#26412;&#36335;&#24452;&#20248;&#21270;&#30340;&#31574;&#30053;&#12290;</title><link>https://arxiv.org/abs/2403.18837</link><description>&lt;p&gt;
&#22312;&#20998;&#24067;&#20449;&#24687;&#20013;&#20351;&#29992;&#28404;&#23450;&#37197;&#39069;&#30456;&#20114;&#20316;&#29992;&#30340;&#37325;&#22797;&#22256;&#22659;&#28216;&#25103;&#65306;&#26757;&#20811;&#26041;&#27861;&#23545;&#26368;&#22823;&#34917;&#20607;&#21644;&#26368;&#23567;&#25104;&#26412;&#36335;&#32447;&#30340;&#24433;&#21709;&#22312;&#21452;&#36793;&#25774;&#21512;&#24066;&#22330;&#30340;&#20449;&#24687;&#35282;&#33394;&#20013;&#30340;&#36793;&#38469;&#36129;&#29486;
&lt;/p&gt;
&lt;p&gt;
Repetitive Dilemma Games in Distribution Information Using Interplay of Droop Quota: Meek's Method in Impact of Maximum Compensation and Minimum Cost Routes in Information Role of Marginal Contribution in Two-Sided Matching Markets
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.18837
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#36845;&#20195;&#22256;&#22659;&#21338;&#24328;&#29702;&#35770;&#21644;&#21452;&#36793;&#25774;&#21512;&#24066;&#22330;&#35270;&#35282;&#65292;&#30740;&#31350;&#20102;&#34394;&#20551;&#26032;&#38395;&#20256;&#25773;&#21644;&#20107;&#23454;&#26680;&#26597;&#25104;&#26412;&#23545;&#20449;&#24687;&#24066;&#22330;&#24179;&#34913;&#30340;&#24433;&#21709;&#65292;&#25506;&#35752;&#20102;&#26032;&#38395;&#25552;&#20379;&#32773;&#22312;&#36873;&#25321;&#25112;&#30053;&#26102;&#38754;&#20020;&#30340;&#25361;&#25112;&#20197;&#21450;&#26368;&#22823;&#22870;&#21169;&#21644;&#26368;&#23567;&#21270;&#25104;&#26412;&#36335;&#24452;&#20248;&#21270;&#30340;&#31574;&#30053;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#26159;&#30740;&#31350;&#35745;&#21010;&#30340;&#21021;&#27493;&#25253;&#21578;&#21644;&#32467;&#26524;&#35752;&#35770;&#25688;&#35201;&#12290;&#30740;&#31350;&#25506;&#35752;&#20102;&#34394;&#20551;&#26032;&#38395;&#20256;&#25773;&#21644;&#20107;&#23454;&#26680;&#26597;&#25104;&#26412;&#22312;&#20449;&#24687;&#24066;&#22330;&#26694;&#26550;&#20869;&#30340;&#22797;&#26434;&#21160;&#24577;&#65292;&#24182;&#21033;&#29992;&#28404;&#23450;&#37197;&#39069;&#12289;&#26757;&#20811;&#26041;&#27861;&#21644;&#36793;&#38469;&#36129;&#29486;&#27010;&#24565;&#20998;&#26512;&#20102;&#20379;&#38656;&#20043;&#38388;&#30340;&#24179;&#34913;&#12290;&#36890;&#36807;&#37319;&#29992;&#21452;&#36793;&#25774;&#21512;&#24066;&#22330;&#35270;&#35282;&#65292;&#25105;&#20204;&#28145;&#20837;&#30740;&#31350;&#20102;&#22312;&#24066;&#22330;&#20013;&#31283;&#23450;&#30340;&#24773;&#20917;&#19979;&#20551;&#26032;&#38395;&#34987;&#35270;&#20026;&#30495;&#30456;&#30340;&#24433;&#21709;&#20197;&#21450;&#21487;&#20449;&#24230;&#21344;&#20248;&#21183;&#30340;&#24773;&#26223;&#12290;&#36890;&#36807;&#36845;&#20195;&#22256;&#22659;&#21338;&#24328;&#29702;&#35770;&#30340;&#24212;&#29992;&#65292;&#25105;&#20204;&#35843;&#26597;&#20102;&#21463;&#21040;&#20256;&#25773;&#34394;&#20551;&#26032;&#38395;&#21644;&#20107;&#23454;&#26680;&#26597;&#21162;&#21147;&#25104;&#26412;&#24433;&#21709;&#30340;&#26032;&#38395;&#25552;&#20379;&#32773;&#30340;&#25112;&#30053;&#36873;&#25321;&#12290;&#25105;&#20204;&#36827;&#19968;&#27493;&#30740;&#31350;&#20102;&#26368;&#22823;&#22870;&#21169;&#38382;&#39064;&#20197;&#21450;&#26368;&#23567;&#21270;&#20256;&#25773;&#34394;&#20551;&#26032;&#38395;&#25104;&#26412;&#36335;&#24452;&#30340;&#31574;&#30053;&#65292;&#24182;&#32771;&#34385;&#20102;&#23545;&#24066;&#22330;&#32454;&#20998;&#20026;&#8220;...
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.18837v1 Announce Type: new  Abstract: This paper is a preliminary report of the research plan and a digest of the results and discussions. On research note explores the complex dynamics of fake news dissemination and fact-checking costs within the framework of information markets and analyzes the equilibrium between supply and demand using the concepts of droop quotas, Meek's method, and marginal contributions. By adopting a two-sided matching market perspective, we delve into scenarios in which markets are stable under the influence of fake news perceived as truth and those in which credibility prevails. Through the application of iterated dilemma game theory, we investigate the strategic choices of news providers affected by the costs associated with spreading fake news and fact-checking efforts. We further examine the maximum reward problem and strategies to minimize the cost path for spreading fake news, and consider a nuanced understanding of market segmentation into "c
&lt;/p&gt;</description></item><item><title>&#20840;&#29699;&#36896;&#33337;&#21378;&#23481;&#37327;&#38480;&#21046;&#20102;&#20840;&#29699;&#27682;&#22522;&#20132;&#36890;&#30340;&#25193;&#23637;&#65292;&#30740;&#31350;&#21457;&#29616;&#22914;&#26524;&#20165;&#20381;&#36182;&#28082;&#27682;&#21487;&#33021;&#20250;&#20986;&#29616;&#29942;&#39048;&#38382;&#39064;&#65292;&#21487;&#20197;&#36890;&#36807;&#22686;&#21152;&#26412;&#22320;&#27682;&#27668;&#29983;&#20135;&#12289;&#21033;&#29992;&#31649;&#36947;&#25110;&#20351;&#29992;&#28082;&#27688;&#35268;&#36991;&#36825;&#19968;&#38382;&#39064;</title><link>https://arxiv.org/abs/2403.09272</link><description>&lt;p&gt;
&#38480;&#21046;&#20840;&#29699;&#27682;&#22522;&#20132;&#36890;&#21457;&#23637;&#30340;&#20840;&#29699;&#36896;&#33337;&#21378;&#23481;&#37327;&#38382;&#39064;
&lt;/p&gt;
&lt;p&gt;
Global Shipyard Capacities Limiting the Ramp-Up of Global Hydrogen-based Transportation
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.09272
&lt;/p&gt;
&lt;p&gt;
&#20840;&#29699;&#36896;&#33337;&#21378;&#23481;&#37327;&#38480;&#21046;&#20102;&#20840;&#29699;&#27682;&#22522;&#20132;&#36890;&#30340;&#25193;&#23637;&#65292;&#30740;&#31350;&#21457;&#29616;&#22914;&#26524;&#20165;&#20381;&#36182;&#28082;&#27682;&#21487;&#33021;&#20250;&#20986;&#29616;&#29942;&#39048;&#38382;&#39064;&#65292;&#21487;&#20197;&#36890;&#36807;&#22686;&#21152;&#26412;&#22320;&#27682;&#27668;&#29983;&#20135;&#12289;&#21033;&#29992;&#31649;&#36947;&#25110;&#20351;&#29992;&#28082;&#27688;&#35268;&#36991;&#36825;&#19968;&#38382;&#39064;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35299;&#30899;&#20840;&#29699;&#33021;&#28304;&#31995;&#32479;&#38656;&#35201;&#22823;&#35268;&#27169;&#25193;&#23637;&#21487;&#20877;&#29983;&#33021;&#28304;&#25216;&#26415;&#12290;&#37492;&#20110;&#25104;&#26412;&#25928;&#30410;&#30340;&#21487;&#20877;&#29983;&#33021;&#28304;&#24182;&#19981;&#19968;&#23450;&#20301;&#20110;&#20840;&#29699;&#26368;&#22823;&#33021;&#28304;&#38656;&#27714;&#20013;&#24515;&#38468;&#36817;&#65292;&#22240;&#27492;&#38656;&#35201;&#36827;&#34892;&#20302;&#30899;&#33021;&#28304;&#25215;&#36816;&#30340;&#28023;&#27915;&#36816;&#36755;&#65292;&#22914;&#22522;&#20110;&#21487;&#20877;&#29983;&#33021;&#28304;&#30340;&#27682;&#27668;&#25110;&#27688;&#27668;&#12290;&#28982;&#32780;&#65292;&#29616;&#26377;&#36896;&#33337;&#21378;&#26159;&#21542;&#20855;&#22791;&#25552;&#20379;&#24517;&#35201;&#30340;&#20840;&#29699;&#33328;&#38431;&#25152;&#38656;&#23481;&#37327;&#23578;&#26410;&#24471;&#21040;&#35299;&#31572;&#12290;&#22240;&#27492;&#65292;&#26412;&#30740;&#31350;&#26681;&#25454;&#20840;&#29699;&#27682;&#27668;&#38656;&#27714;&#39044;&#27979;&#20272;&#31639;&#20840;&#29699;&#27833;&#36718;&#38656;&#27714;&#65292;&#21516;&#26102;&#23558;&#36825;&#20123;&#39044;&#27979;&#19982;&#21382;&#21490;&#36896;&#33337;&#21378;&#20135;&#37327;&#36827;&#34892;&#27604;&#36739;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#32467;&#26524;&#26174;&#31034;&#65292;&#22914;&#26524;&#20165;&#20165;&#20381;&#36182;&#28082;&#27682;&#65292;&#21487;&#33021;&#20986;&#29616;&#29942;&#39048;&#38382;&#39064;&#65292;&#38656;&#31561;&#24453;&#33267;2033-2039&#24180;&#35299;&#20915;&#12290;&#36825;&#19968;&#29942;&#39048;&#21487;&#20197;&#36890;&#36807;&#22686;&#21152;&#26412;&#22320;&#27682;&#27668;&#29983;&#20135;&#12289;&#21033;&#29992;&#31649;&#36947;&#25110;&#23558;&#28082;&#27688;&#20316;&#20026;&#27682;&#27668;&#30340;&#33021;&#28304;&#25215;&#36816;&#32773;&#26469;&#35268;&#36991;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.09272v1 Announce Type: new  Abstract: Decarbonizing the global energy system requires significant expansions of renewable energy technologies. Given that cost-effective renewable sources are not necessarily situated in proximity to the largest energy demand centers globally, the maritime transportation of low-carbon energy carriers, such as renewable-based hydrogen or ammonia, will be needed. However, whether existent shipyards possess the required capacity to provide the necessary global fleet has not yet been answered. Therefore, this study estimates global tanker demand based on projections for global hydrogen demand, while comparing these projections with historic shipyard production. Our findings reveal a potential bottleneck until 2033-2039 if relying on liquefied hydrogen exclusively. This bottleneck could be circumvented by increasing local hydrogen production, utilizing pipelines, or liquefied ammonia as an energy carrier for hydrogen. Furthermore, the regional conc
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#20855;&#26377;&#31169;&#20154;&#20449;&#24687;&#30340;&#32972;&#21253;&#38382;&#39064;&#65292;&#36890;&#36807;&#30740;&#31350;&#19977;&#31181;&#23454;&#38469;&#25293;&#21334;&#20316;&#20026;&#20132;&#26131;&#35268;&#21017;&#30340;&#21487;&#33021;&#20505;&#36873;&#39033;&#65292;&#25581;&#31034;&#20102;&#22312;&#36825;&#31181;&#35774;&#32622;&#19979;&#30340;&#31454;&#26631;&#34892;&#20026;&#12289;&#25910;&#20837;&#21644;&#25928;&#29575;&#12290;</title><link>https://arxiv.org/abs/2403.07928</link><description>&lt;p&gt;
&#38024;&#23545;&#32972;&#21253;&#25293;&#21334;&#30340;&#25112;&#30053;&#31454;&#26631;
&lt;/p&gt;
&lt;p&gt;
Strategic Bidding in Knapsack Auctions
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.07928
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#20855;&#26377;&#31169;&#20154;&#20449;&#24687;&#30340;&#32972;&#21253;&#38382;&#39064;&#65292;&#36890;&#36807;&#30740;&#31350;&#19977;&#31181;&#23454;&#38469;&#25293;&#21334;&#20316;&#20026;&#20132;&#26131;&#35268;&#21017;&#30340;&#21487;&#33021;&#20505;&#36873;&#39033;&#65292;&#25581;&#31034;&#20102;&#22312;&#36825;&#31181;&#35774;&#32622;&#19979;&#30340;&#31454;&#26631;&#34892;&#20026;&#12289;&#25910;&#20837;&#21644;&#25928;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#32972;&#21253;&#38382;&#39064;&#20013;&#65292;&#19968;&#32452;&#19981;&#21487;&#20998;&#21106;&#30340;&#23545;&#35937;&#65292;&#27599;&#20010;&#23545;&#35937;&#20855;&#26377;&#19981;&#21516;&#30340;&#20215;&#20540;&#21644;&#22823;&#23567;&#65292;&#24517;&#39035;&#34987;&#25918;&#20837;&#19968;&#20010;&#22266;&#23450;&#22823;&#23567;&#30340;&#32972;&#21253;&#20013;&#65292;&#20197;&#26368;&#22823;&#21270;&#24635;&#20215;&#20540;&#12290;&#21363;&#20351;&#22312;&#23545;&#20215;&#20540;&#21644;&#22823;&#23567;&#26377;&#23436;&#20840;&#20449;&#24687;&#30340;&#24773;&#20917;&#19979;&#65292;&#32972;&#21253;&#38382;&#39064;&#20063;&#34987;&#35748;&#20026;&#26159;&#19968;&#20010;NP&#38590;&#39064;&#12290;&#28982;&#32780;&#65292;&#22312;&#35768;&#22810;&#23454;&#38469;&#24773;&#20917;&#19979;&#65292;&#23545;&#35937;&#30340;&#20215;&#20540;&#26159;&#31169;&#20154;&#20449;&#24687;&#65292;&#36825;&#22686;&#21152;&#20102;&#21478;&#19968;&#20010;&#22797;&#26434;&#32500;&#24230;&#12290;&#26412;&#25991;&#36890;&#36807;&#30740;&#31350;&#19977;&#31181;&#23454;&#38469;&#25293;&#21334;&#20316;&#20026;&#20132;&#26131;&#35268;&#21017;&#30340;&#21487;&#33021;&#20505;&#36873;&#39033;&#65292;&#25506;&#35752;&#20102;&#20855;&#26377;&#31169;&#20154;&#20449;&#24687;&#30340;&#32972;&#21253;&#38382;&#39064;&#65292;&#22312;&#36825;&#31181;&#35774;&#32622;&#20013;&#65292;&#32972;&#21253;&#25152;&#26377;&#32773;&#36890;&#36807;&#25293;&#21334;&#23558;&#31354;&#38388;&#21334;&#32473;&#23545;&#35937;&#25152;&#26377;&#32773;&#12290;&#36825;&#19977;&#31181;&#25293;&#21334;&#20998;&#21035;&#26159;&#27495;&#35270;&#20215;&#26684;&#25293;&#21334;&#12289;&#24191;&#20041;&#31532;&#20108;&#20215;&#26684;&#25293;&#21334;&#21644;&#32479;&#19968;&#20215;&#26684;&#25293;&#21334;&#12290;&#36890;&#36807;&#20351;&#29992;&#19968;&#31181;&#36138;&#23146;&#31639;&#27861;&#26469;&#20998;&#37197;&#23545;&#35937;&#65292;&#25105;&#20204;&#20351;&#29992;&#29702;&#35770;&#12289;&#23454;&#39564;&#23460;&#23454;&#39564;&#21644;AI&#22686;&#24378;&#27169;&#25311;&#65292;&#20998;&#26512;&#20102;&#36825;&#19977;&#31181;&#25293;&#21334;&#30340;&#31454;&#26631;&#34892;&#20026;&#12289;&#25910;&#20837;&#21644;&#25928;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.07928v1 Announce Type: cross  Abstract: In the Knapsack Problem a set of indivisible objects, each with different values and sizes, must be packed into a fixed-size knapsack to maximize the total value. The knapsack problem is known to be an NP-hard problem even when there is full information regarding values and sizes. In many real-world situations, however, the values of objects are private information, which adds another dimension of complexity. In this paper we examine the knapsack problem with private information by investigating three practical auctions as possible candidates for payment rules in a setup where the knapsack owner sells the space to object owners via an auction. The three auctions are the discriminatory price, the generalized second-price and the uniform-price auctions. Using a Greedy algorithm for allocating objects, we analyze bidding behavior, revenue and efficiency of these three auctions using theory, lab experiments, and AI-enriched simulations. Ou
&lt;/p&gt;</description></item><item><title>&#36890;&#36807;&#30740;&#31350;&#26368;&#22823;&#34917;&#20607;&#38382;&#39064;&#21644;&#24809;&#32602;&#20248;&#21183;&#38382;&#39064;&#65292;&#22312;&#20449;&#24687;&#20256;&#25773;&#20013;&#35774;&#35745;&#20102;&#19968;&#31181;&#31574;&#30053;&#26469;&#26368;&#22823;&#31243;&#24230;&#22320;&#20943;&#23569;&#34394;&#20551;&#26032;&#38395;&#20256;&#25773;&#24182;&#26368;&#22823;&#21270;&#21487;&#20449;&#20449;&#24687;&#20256;&#25773;&#65292;&#20197;&#37325;&#26032;&#35780;&#20272;&#26032;&#38395;&#25552;&#20379;&#32773;&#30340;&#28608;&#21169;&#25514;&#26045;&#23545;&#20449;&#24687;&#24066;&#22330;&#24179;&#34913;&#30340;&#24433;&#21709;&#12290;</title><link>https://arxiv.org/abs/2403.02342</link><description>&lt;p&gt;
&#32416;&#32544;: &#22312;&#20107;&#23454;&#26680;&#23454;&#20013;&#24179;&#34913;&#24809;&#32602;&#21644;&#34917;&#20607;&#30340;&#26368;&#22823;&#34917;&#20607;&#38382;&#39064;&#37325;&#22797;&#22256;&#22659;&#21338;&#24328;&#20998;&#26512;&#65292;&#34394;&#20551;&#26032;&#38395;&#19982;&#24369;&#27779;&#21202;&#26031;&#23450;&#24459;&#26696;&#20363;
&lt;/p&gt;
&lt;p&gt;
Entanglement: Balancing Punishment and Compensation, Repeated Dilemma Game-Theoretic Analysis of Maximum Compensation Problem for Bypass and Least Cost Paths in Fact-Checking, Case of Fake News with Weak Wallace's Law
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.02342
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#30740;&#31350;&#26368;&#22823;&#34917;&#20607;&#38382;&#39064;&#21644;&#24809;&#32602;&#20248;&#21183;&#38382;&#39064;&#65292;&#22312;&#20449;&#24687;&#20256;&#25773;&#20013;&#35774;&#35745;&#20102;&#19968;&#31181;&#31574;&#30053;&#26469;&#26368;&#22823;&#31243;&#24230;&#22320;&#20943;&#23569;&#34394;&#20551;&#26032;&#38395;&#20256;&#25773;&#24182;&#26368;&#22823;&#21270;&#21487;&#20449;&#20449;&#24687;&#20256;&#25773;&#65292;&#20197;&#37325;&#26032;&#35780;&#20272;&#26032;&#38395;&#25552;&#20379;&#32773;&#30340;&#28608;&#21169;&#25514;&#26045;&#23545;&#20449;&#24687;&#24066;&#22330;&#24179;&#34913;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#30740;&#31350;&#31508;&#35760;&#20197;&#19968;&#31181;&#26032;&#39062;&#30340;&#26041;&#27861;&#26469;&#35299;&#20915;&#19982;&#34394;&#20551;&#26032;&#38395;&#20256;&#25773;&#21644;&#26377;&#25928;&#20107;&#23454;&#26680;&#23454;&#30456;&#20851;&#30340;&#38382;&#39064;&#12290;&#37325;&#28857;&#25918;&#22312;&#26368;&#23567;&#25104;&#26412;&#36335;&#24452;&#38382;&#39064;&#19978;&#65292;&#35752;&#35770;&#22260;&#32469;&#30528;&#20351;&#29992;Metzler&#20989;&#25968;&#21644;Metzler&#30697;&#38453;&#26469;&#27169;&#25311;&#26032;&#38395;&#25552;&#20379;&#32773;&#20043;&#38388;&#20449;&#24687;&#20256;&#25773;&#21160;&#24577;&#30340;&#26041;&#27861;&#12290;&#25105;&#20204;&#35774;&#35745;&#20102;&#19968;&#31181;&#31574;&#30053;&#26469;&#26368;&#23567;&#21270;&#34394;&#20551;&#26032;&#38395;&#30340;&#20256;&#25773;&#65292;&#21516;&#26102;&#26368;&#22823;&#21270;&#21487;&#20449;&#20449;&#24687;&#30340;&#20256;&#25773;&#12290;&#36890;&#36807;&#24809;&#32602;&#20248;&#21183;&#38382;&#39064;&#21644;&#26368;&#22823;&#34917;&#20607;&#38382;&#39064;&#65292;&#25105;&#20204;&#24320;&#21457;&#24182;&#30740;&#31350;&#20102;&#19968;&#31181;&#37325;&#26032;&#35780;&#20272;&#26032;&#38395;&#25552;&#20379;&#32773;&#28608;&#21169;&#25514;&#26045;&#30340;&#36335;&#24452;&#65292;&#24182;&#20998;&#26512;&#23427;&#20204;&#23545;&#20449;&#24687;&#24066;&#22330;&#24179;&#34913;&#30340;&#24433;&#21709;&#12290;&#36890;&#36807;&#23558;&#32416;&#32544;&#27010;&#24565;&#24212;&#29992;&#20110;&#20449;&#24687;&#20256;&#25773;&#30340;&#32972;&#26223;&#20013;&#65292;&#25105;&#20204;&#25581;&#31034;&#20102;&#26032;&#38395;&#25552;&#20379;&#32773;&#20043;&#38388;&#30456;&#20114;&#20316;&#29992;&#30340;&#22797;&#26434;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.02342v1 Announce Type: cross  Abstract: This research note is organized with respect to a novel approach to solving problems related to the spread of fake news and effective fact-checking. Focusing on the least-cost routing problem, the discussion is organized with respect to the use of Metzler functions and Metzler matrices to model the dynamics of information propagation among news providers. With this approach, we designed a strategy to minimize the spread of fake news, which is detrimental to informational health, while at the same time maximizing the spread of credible information. In particular, through the punitive dominance problem and the maximum compensation problem, we developed and examined a path to reassess the incentives of news providers to act and to analyze their impact on the equilibrium of the information market. By applying the concept of entanglement to the context of information propagation, we shed light on the complexity of interactions among news pr
&lt;/p&gt;</description></item><item><title>&#25552;&#20986;&#20102;&#19968;&#31181;&#38024;&#23545;&#38271;&#26102;&#38388;&#24207;&#21015;&#25968;&#25454;&#30340;Arellano-Bond&#20272;&#35745;&#22120;&#20559;&#24046;&#38382;&#39064;&#30340;&#20004;&#27493;&#27861;&#12290;&#39318;&#20808;&#21033;&#29992;LASSO&#36873;&#25321;&#20449;&#24687;&#37327;&#26368;&#22823;&#30340;&#30697;&#26465;&#20214;&#65292;&#28982;&#21518;&#20351;&#29992;&#36825;&#20123;&#26465;&#20214;&#26500;&#36896;&#24037;&#20855;&#21464;&#37327;&#36827;&#34892;&#32447;&#24615;&#20202;&#22120;&#21464;&#37327;&#20272;&#35745;&#12290;&#35813;&#26041;&#27861;&#36890;&#36807;&#26679;&#26412;&#20999;&#20998;&#21644;&#20132;&#21449;&#25311;&#21512;&#26469;&#36991;&#20813;&#36807;&#25311;&#21512;&#20559;&#24046;&#65292;&#24182;&#19988;&#22312;&#23545;&#26102;&#38388;&#24207;&#21015;&#32500;&#24230;$T$&#30340;&#26465;&#20214;&#35201;&#27714;&#26356;&#24369;&#30340;&#24773;&#20917;&#19979;&#26159;&#19968;&#33268;&#30340;&#21644;&#28176;&#36817;&#27491;&#24577;&#30340;&#12290;</title><link>https://arxiv.org/abs/2402.00584</link><description>&lt;p&gt;
Arellano-Bond LASSO&#20272;&#35745;&#22120;&#29992;&#20110;&#21160;&#24577;&#32447;&#24615;&#38754;&#26495;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
Arellano-Bond LASSO Estimator for Dynamic Linear Panel Models
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2402.00584
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#38024;&#23545;&#38271;&#26102;&#38388;&#24207;&#21015;&#25968;&#25454;&#30340;Arellano-Bond&#20272;&#35745;&#22120;&#20559;&#24046;&#38382;&#39064;&#30340;&#20004;&#27493;&#27861;&#12290;&#39318;&#20808;&#21033;&#29992;LASSO&#36873;&#25321;&#20449;&#24687;&#37327;&#26368;&#22823;&#30340;&#30697;&#26465;&#20214;&#65292;&#28982;&#21518;&#20351;&#29992;&#36825;&#20123;&#26465;&#20214;&#26500;&#36896;&#24037;&#20855;&#21464;&#37327;&#36827;&#34892;&#32447;&#24615;&#20202;&#22120;&#21464;&#37327;&#20272;&#35745;&#12290;&#35813;&#26041;&#27861;&#36890;&#36807;&#26679;&#26412;&#20999;&#20998;&#21644;&#20132;&#21449;&#25311;&#21512;&#26469;&#36991;&#20813;&#36807;&#25311;&#21512;&#20559;&#24046;&#65292;&#24182;&#19988;&#22312;&#23545;&#26102;&#38388;&#24207;&#21015;&#32500;&#24230;$T$&#30340;&#26465;&#20214;&#35201;&#27714;&#26356;&#24369;&#30340;&#24773;&#20917;&#19979;&#26159;&#19968;&#33268;&#30340;&#21644;&#28176;&#36817;&#27491;&#24577;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#24403;&#25968;&#25454;&#30340;&#26102;&#38388;&#24207;&#21015;&#32500;&#24230;$T$&#36739;&#38271;&#26102;&#65292;Arellano-Bond&#20272;&#35745;&#22120;&#21487;&#33021;&#20986;&#29616;&#20005;&#37325;&#20559;&#24046;&#12290;&#20559;&#24046;&#30340;&#26469;&#28304;&#26159;&#36807;&#24230;&#35782;&#21035;&#30340;&#31243;&#24230;&#36807;&#22823;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#31616;&#21333;&#30340;&#20004;&#27493;&#26041;&#27861;&#26469;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#12290;&#31532;&#19968;&#27493;&#22312;&#27599;&#20010;&#26102;&#38388;&#27573;&#23545;&#27178;&#25130;&#38754;&#25968;&#25454;&#24212;&#29992;LASSO&#36873;&#25321;&#26368;&#26377;&#20449;&#24687;&#37327;&#30340;&#30697;&#26465;&#20214;&#12290;&#31532;&#20108;&#27493;&#20351;&#29992;&#20174;&#31532;&#19968;&#27493;&#36873;&#25321;&#30340;&#30697;&#26465;&#20214;&#26500;&#36896;&#30340;&#24037;&#20855;&#21464;&#37327;&#20272;&#35745;&#32447;&#24615;&#20202;&#22120;&#12290;&#36890;&#36807;&#26679;&#26412;&#20999;&#20998;&#21644;&#20132;&#21449;&#25311;&#21512;&#20004;&#20010;&#38454;&#27573;&#26469;&#36991;&#20813;&#36807;&#25311;&#21512;&#20559;&#24046;&#12290;&#20351;&#29992;&#38543;&#30528;&#26679;&#26412;&#22823;&#23567;&#22686;&#38271;&#30340;&#28176;&#36817;&#24207;&#21015;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#26032;&#30340;&#20272;&#35745;&#22120;&#22312;&#23545;$T$&#30340;&#26465;&#20214;&#35201;&#27714;&#27604;Arellano-Bond&#20272;&#35745;&#22120;&#35201;&#24369;&#30340;&#24773;&#20917;&#19979;&#26159;&#19968;&#33268;&#30340;&#21644;&#28176;&#36817;&#27491;&#24577;&#30340;&#12290;&#25105;&#20204;&#30340;&#29702;&#35770;&#28085;&#30422;&#20102;&#21253;&#25324;&#20381;&#36182;&#21464;&#37327;&#30340;&#22810;&#20010;&#28382;&#21518;&#31561;&#39640;&#32500;&#21327;&#21464;&#37327;&#22312;&#20869;&#30340;&#27169;&#22411;&#65292;&#36825;&#22312;&#29616;&#20195;&#24212;&#29992;&#20013;&#24456;&#24120;&#35265;&#12290;
&lt;/p&gt;
&lt;p&gt;
The Arellano-Bond estimator can be severely biased when the time series dimension of the data, $T$, is long. The source of the bias is the large degree of overidentification. We propose a simple two-step approach to deal with this problem. The first step applies LASSO to the cross-section data at each time period to select the most informative moment conditions. The second step applies a linear instrumental variable estimator using the instruments constructed from the moment conditions selected in the first step. The two stages are combined using sample-splitting and cross-fitting to avoid overfitting bias. Using asymptotic sequences where the two dimensions of the panel grow with the sample size, we show that the new estimator is consistent and asymptotically normal under much weaker conditions on $T$ than the Arellano-Bond estimator. Our theory covers models with high dimensional covariates including multiple lags of the dependent variable, which are common in modern applications. We
&lt;/p&gt;</description></item><item><title>&#35813;&#30740;&#31350;&#35843;&#26597;&#20102;&#20154;&#24037;&#26234;&#33021;&#65288;AI&#65289;&#32534;&#20889;&#30340;&#34394;&#20551;&#22312;&#32447;&#35780;&#35770;&#23545;&#28040;&#36153;&#32773;&#20915;&#31574;&#30340;&#24433;&#21709;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#34394;&#20551;&#35780;&#35770;&#26816;&#27979;&#27169;&#22411;&#20316;&#20026;&#35299;&#20915;&#26041;&#26696;&#12290;</title><link>http://arxiv.org/abs/2401.11345</link><description>&lt;p&gt;
&#20266;&#36896;&#30340;&#35895;&#27468;&#39184;&#21381;&#35780;&#35770;&#23545;&#28040;&#36153;&#32773;&#21644;&#39184;&#21381;&#30340;&#24433;&#21709;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Fake Google restaurant reviews and the implications for consumers and restaurants. (arXiv:2401.11345v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.11345
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#35843;&#26597;&#20102;&#20154;&#24037;&#26234;&#33021;&#65288;AI&#65289;&#32534;&#20889;&#30340;&#34394;&#20551;&#22312;&#32447;&#35780;&#35770;&#23545;&#28040;&#36153;&#32773;&#20915;&#31574;&#30340;&#24433;&#21709;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#31181;&#34394;&#20551;&#35780;&#35770;&#26816;&#27979;&#27169;&#22411;&#20316;&#20026;&#35299;&#20915;&#26041;&#26696;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#28040;&#36153;&#32773;&#20013;&#65292;&#20351;&#29992;&#22312;&#32447;&#35780;&#35770;&#26469;&#36741;&#21161;&#36141;&#20080;&#20915;&#31574;&#26159;&#27969;&#34892;&#30340;&#65292;&#22240;&#20026;&#23427;&#26159;&#19968;&#31181;&#31616;&#21333;&#30340;&#21551;&#21457;&#24335;&#24037;&#20855;&#65292;&#22522;&#20110;&#20854;&#20182;&#28040;&#36153;&#32773;&#30340;&#25253;&#21578;&#32463;&#39564;&#12290;&#28982;&#32780;&#65292;&#24182;&#19981;&#26159;&#25152;&#26377;&#30340;&#22312;&#32447;&#35780;&#35770;&#37117;&#26159;&#30495;&#23454;&#28040;&#36153;&#32773;&#20889;&#30340;&#25110;&#21453;&#26144;&#30495;&#23454;&#32463;&#21382;&#30340;&#65292;&#36825;&#23545;&#28040;&#36153;&#32773;&#21644;&#20225;&#19994;&#37117;&#24102;&#26469;&#20102;&#24433;&#21709;&#12290;&#26412;&#30740;&#31350;&#35843;&#26597;&#20102;&#20154;&#24037;&#26234;&#33021;&#65288;AI&#65289;&#32534;&#20889;&#30340;&#34394;&#20551;&#22312;&#32447;&#35780;&#35770;&#23545;&#28040;&#36153;&#32773;&#20915;&#31574;&#30340;&#24433;&#21709;&#12290;&#35843;&#26597;&#23545;&#35937;&#36890;&#36807;&#22312;&#32447;&#38382;&#21367;&#65288;n=351&#65289;&#22238;&#31572;&#20102;&#20851;&#20110;&#20182;&#20204;&#22312;&#22312;&#32447;&#35780;&#35770;&#26041;&#38754;&#30340;&#24577;&#24230;&#21644;&#20064;&#24815;&#65292;&#24182;&#21442;&#19982;&#20102;&#19968;&#39033;&#39184;&#21381;&#36873;&#25321;&#23454;&#39564;&#65292;&#20854;&#20013;&#20351;&#29992;&#20102;&#19981;&#21516;&#27604;&#20363;&#30340;&#34394;&#20551;&#21644;&#30495;&#23454;&#35780;&#35770;&#12290;&#30740;&#31350;&#32467;&#26524;&#35777;&#23454;&#20102;&#20197;&#21069;&#30340;&#30740;&#31350;&#65292;&#21516;&#26102;&#36824;&#33719;&#24471;&#20102;&#20851;&#20110;&#24403;&#20154;&#20204;&#30456;&#20449;AI&#32534;&#20889;&#30340;&#35780;&#35770;&#32780;&#19981;&#26159;&#30495;&#23454;&#35780;&#35770;&#26102;&#30340;&#28040;&#36153;&#32773;&#22256;&#24785;&#21644;&#20225;&#19994;&#21518;&#26524;&#30340;&#26032;&#35265;&#35299;&#12290;&#35813;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#34394;&#20551;&#35780;&#35770;&#26816;&#27979;&#27169;&#22411;&#65292;&#20351;&#29992;&#36923;&#36753;&#22238;&#24402;&#24314;&#27169;&#26469;&#23545;&#35780;&#35770;&#36827;&#34892;&#35780;&#20998;&#21644;&#26631;&#35760;&#65292;&#20316;&#20026;&#35299;&#20915;&#26041;&#26696;&#12290;
&lt;/p&gt;
&lt;p&gt;
The use of online reviews to aid with purchase decisions is popular among consumers as it is a simple heuristic tool based on the reported experiences of other consumers. However, not all online reviews are written by real consumers or reflect actual experiences, and present implications for consumers and businesses. This study examines the effects of fake online reviews written by artificial intelligence (AI) on consumer decision making. Respondents were surveyed about their attitudes and habits concerning online reviews using an online questionnaire (n=351), and participated in a restaurant choice experiment using varying proportions of fake and real reviews. While the findings confirm prior studies, new insights are gained about the confusion for consumers and consequences for businesses when reviews written by AI are believed rather than real reviews. The study presents a fake review detection model using logistic regression modeling to score and flag reviews as a solution.
&lt;/p&gt;</description></item><item><title>&#25552;&#20986;&#20102;&#19968;&#20010;&#26032;&#30340;&#32447;&#24615;&#20272;&#35745;&#30340;&#25935;&#24863;&#24615;&#20998;&#26512;&#26694;&#26550;&#65292;&#21487;&#20197;&#22788;&#29702;&#37492;&#21035;&#22833;&#36133;&#21644;&#20551;&#35774;&#36829;&#21453;&#30340;&#38382;&#39064;&#65292;&#24182;&#32473;&#20986;&#20102;&#30456;&#24212;&#30340;&#23574;&#38160;&#36793;&#30028;&#29305;&#24449;&#12290;</title><link>http://arxiv.org/abs/2309.06305</link><description>&lt;p&gt;
&#32447;&#24615;&#20272;&#35745;&#30340;&#25935;&#24863;&#24615;&#20998;&#26512;
&lt;/p&gt;
&lt;p&gt;
Sensitivity Analysis for Linear Estimands. (arXiv:2309.06305v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.06305
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#20010;&#26032;&#30340;&#32447;&#24615;&#20272;&#35745;&#30340;&#25935;&#24863;&#24615;&#20998;&#26512;&#26694;&#26550;&#65292;&#21487;&#20197;&#22788;&#29702;&#37492;&#21035;&#22833;&#36133;&#21644;&#20551;&#35774;&#36829;&#21453;&#30340;&#38382;&#39064;&#65292;&#24182;&#32473;&#20986;&#20102;&#30456;&#24212;&#30340;&#23574;&#38160;&#36793;&#30028;&#29305;&#24449;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#26032;&#30340;&#32447;&#24615;&#20272;&#35745;&#30340;&#25935;&#24863;&#24615;&#20998;&#26512;&#26694;&#26550;&#65292;&#24403;&#37492;&#21035;&#22833;&#36133;&#21487;&#20197;&#34987;&#30475;&#20316;&#26159;&#30475;&#21040;&#20102;&#38169;&#35823;&#30340;&#32467;&#26524;&#20998;&#24067;&#26102;&#12290;&#25105;&#20204;&#30340;&#20551;&#35774;&#26063;&#38480;&#23450;&#20102;&#35266;&#23519;&#21040;&#30340;&#21644;&#30495;&#23454;&#26465;&#20214;&#32467;&#26524;&#20998;&#24067;&#20043;&#38388;&#30340;&#23494;&#24230;&#27604;&#12290;&#36825;&#20010;&#26694;&#26550;&#33258;&#28982;&#22320;&#19982;&#36873;&#25321;&#27169;&#22411;&#30456;&#20851;&#32852;&#65292;&#25512;&#24191;&#20102;&#22238;&#24402;&#19981;&#36830;&#32493;&#24615;&#65288;RD&#65289;&#21644;&#20498;&#25968;&#27010;&#29575;&#21152;&#26435;&#24230;&#37327;&#65288;IPW&#65289;&#30340;&#29616;&#26377;&#20551;&#35774;&#65292;&#24182;&#38024;&#23545;&#26222;&#36890;&#26368;&#23567;&#20108;&#20056;&#27861;&#65288;OLS&#65289;&#30340;&#37492;&#21035;&#20551;&#35774;&#36829;&#21453;&#25552;&#20379;&#20102;&#19968;&#31181;&#26032;&#30340;&#38750;&#21442;&#25968;&#35270;&#35282;&#12290;&#25105;&#20204;&#30340;&#23574;&#38160;&#37096;&#20998;&#37492;&#21035;&#32467;&#26524;&#23558;&#29616;&#26377;&#30340;IPW&#32467;&#26524;&#25512;&#24191;&#21040;&#20854;&#20182;&#20272;&#35745;&#21644;&#20801;&#35768;&#26080;&#30028;&#20284;&#28982;&#27604;&#30340;&#20551;&#35774;&#65292;&#20174;&#32780;&#22312;&#20687;Masten&#21644;Poirier&#65288;2018&#24180;&#65289;&#30340;c&#20381;&#36182;&#24615;&#20551;&#35774;&#19979;&#25552;&#20379;&#20102;&#31616;&#21333;&#32780;&#32479;&#19968;&#30340;&#36793;&#30028;&#29305;&#24449;&#12290;&#23574;&#38160;&#36793;&#30028;&#21487;&#20197;&#20889;&#25104;&#25968;&#25454;&#30340;&#31616;&#21333;&#38381;&#21512;&#24418;&#24335;&#30697;&#12289;&#22312;&#20027;&#35201;&#20998;&#26512;&#20013;&#20272;&#35745;&#30340;&#26080;&#20851;&#20989;&#25968;&#21644;&#26465;&#20214;&#20989;&#25968;&#30340;&#20056;&#31215;&#12290;
&lt;/p&gt;
&lt;p&gt;
We propose a novel sensitivity analysis framework for linear estimands when identification failure can be viewed as seeing the wrong distribution of outcomes. Our family of assumptions bounds the density ratio between the observed and true conditional outcome distribution. This framework links naturally to selection models, generalizes existing assumptions for the Regression Discontinuity (RD) and Inverse Propensity Weighting (IPW) estimand, and provides a novel nonparametric perspective on violations of identification assumptions for ordinary least squares (OLS). Our sharp partial identification results extend existing results for IPW to cover other estimands and assumptions that allow even unbounded likelihood ratios, yielding a simple and unified characterization of bounds under assumptions like c-dependence of Masten and Poirier (2018). The sharp bounds can be written as a simple closed form moment of the data, the nuisance functions estimated in the primary analysis, and the condi
&lt;/p&gt;</description></item><item><title>DeepVol&#26159;&#19968;&#31181;&#29992;&#20110;&#36890;&#29992;&#36164;&#20135;&#27874;&#21160;&#24615;&#24314;&#27169;&#30340;&#28145;&#24230;&#36801;&#31227;&#23398;&#20064;&#26041;&#27861;&#65292;&#36890;&#36807;&#19968;&#20010;&#36890;&#29992;&#27169;&#22411;&#26377;&#25928;&#22320;&#25429;&#25417;&#21644;&#24314;&#27169;&#25152;&#26377;&#37329;&#34701;&#36164;&#20135;&#30340;&#27874;&#21160;&#24615;&#21160;&#24577;&#65292;&#21487;&#33021;&#25913;&#21464;&#23545;&#27874;&#21160;&#24615;&#30340;&#29702;&#35299;&#21644;&#39044;&#27979;&#26041;&#24335;&#12290;</title><link>http://arxiv.org/abs/2309.02072</link><description>&lt;p&gt;
DeepVol&#65306;&#19968;&#31181;&#29992;&#20110;&#36890;&#29992;&#36164;&#20135;&#27874;&#21160;&#24615;&#24314;&#27169;&#30340;&#28145;&#24230;&#36801;&#31227;&#23398;&#20064;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
DeepVol: A Deep Transfer Learning Approach for Universal Asset Volatility Modeling. (arXiv:2309.02072v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.02072
&lt;/p&gt;
&lt;p&gt;
DeepVol&#26159;&#19968;&#31181;&#29992;&#20110;&#36890;&#29992;&#36164;&#20135;&#27874;&#21160;&#24615;&#24314;&#27169;&#30340;&#28145;&#24230;&#36801;&#31227;&#23398;&#20064;&#26041;&#27861;&#65292;&#36890;&#36807;&#19968;&#20010;&#36890;&#29992;&#27169;&#22411;&#26377;&#25928;&#22320;&#25429;&#25417;&#21644;&#24314;&#27169;&#25152;&#26377;&#37329;&#34701;&#36164;&#20135;&#30340;&#27874;&#21160;&#24615;&#21160;&#24577;&#65292;&#21487;&#33021;&#25913;&#21464;&#23545;&#27874;&#21160;&#24615;&#30340;&#29702;&#35299;&#21644;&#39044;&#27979;&#26041;&#24335;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#26032;&#30340;&#28145;&#24230;&#23398;&#20064;&#27874;&#21160;&#24615;&#27169;&#22411;DeepVol&#65292;&#23427;&#22312;&#27169;&#22411;&#30340;&#24191;&#27867;&#24615;&#26041;&#38754;&#20248;&#20110;&#20256;&#32479;&#30340;&#35745;&#37327;&#32463;&#27982;&#27169;&#22411;&#12290;DeepVol&#21033;&#29992;&#36801;&#31227;&#23398;&#20064;&#30340;&#33021;&#21147;&#65292;&#36890;&#36807;&#19968;&#20010;&#36890;&#29992;&#27169;&#22411;&#26377;&#25928;&#22320;&#25429;&#25417;&#21644;&#24314;&#27169;&#25152;&#26377;&#37329;&#34701;&#36164;&#20135;&#30340;&#27874;&#21160;&#24615;&#21160;&#24577;&#65292;&#21253;&#25324;&#20197;&#21069;&#26410;&#35265;&#36807;&#30340;&#36164;&#20135;&#12290;&#36825;&#19982;&#35745;&#37327;&#32463;&#27982;&#23398;&#25991;&#29486;&#20013;&#30340;&#20027;&#27969;&#20570;&#27861;&#24418;&#25104;&#40092;&#26126;&#23545;&#27604;&#65292;&#21518;&#32773;&#38656;&#35201;&#20026;&#19981;&#21516;&#25968;&#25454;&#38598;&#35757;&#32451;&#21333;&#29420;&#30340;&#27169;&#22411;&#12290;&#24341;&#20837;DeepVol&#20026;&#37329;&#34701;&#34892;&#19994;&#30340;&#27874;&#21160;&#24615;&#24314;&#27169;&#21644;&#39044;&#27979;&#24320;&#36767;&#20102;&#26032;&#30340;&#36884;&#24452;&#65292;&#21487;&#33021;&#20250;&#25913;&#21464;&#23545;&#27874;&#21160;&#24615;&#30340;&#29702;&#35299;&#21644;&#39044;&#27979;&#26041;&#24335;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper introduces DeepVol, a promising new deep learning volatility model that outperforms traditional econometric models in terms of model generality. DeepVol leverages the power of transfer learning to effectively capture and model the volatility dynamics of all financial assets, including previously unseen ones, using a single universal model. This contrasts to the prevailing practice in econometrics literature, which necessitates training separate models for individual datasets. The introduction of DeepVol opens up new avenues for volatility modeling and forecasting in the finance industry, potentially transforming the way volatility is understood and predicted.
&lt;/p&gt;</description></item><item><title>&#35813;&#30740;&#31350;&#20998;&#26512;&#20102;&#36719;&#36829;&#32422;&#65288;&#36926;&#26399;90&#22825;&#20197;&#19978;&#65289;&#23545;&#20010;&#20154;&#36712;&#36857;&#30340;&#24433;&#21709;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#36719;&#36829;&#32422;&#23545;&#20449;&#29992;&#35780;&#20998;&#12289;&#20449;&#29992;&#39069;&#24230;&#24635;&#25968;&#12289;&#20303;&#25151;&#25152;&#26377;&#26435;&#21644;&#25910;&#20837;&#26041;&#38754;&#20135;&#29983;&#20102;&#38271;&#26399;&#19988;&#37325;&#22823;&#30340;&#36127;&#38754;&#24433;&#21709;&#65292;&#35813;&#24433;&#21709;&#20250;&#25345;&#32493;&#21313;&#24180;&#24038;&#21491;&#12290;</title><link>http://arxiv.org/abs/2306.00574</link><description>&lt;p&gt;
&#36719;&#36829;&#32422;&#21518;&#30340;&#29983;&#27963;
&lt;/p&gt;
&lt;p&gt;
Life after (Soft) Default. (arXiv:2306.00574v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.00574
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#20998;&#26512;&#20102;&#36719;&#36829;&#32422;&#65288;&#36926;&#26399;90&#22825;&#20197;&#19978;&#65289;&#23545;&#20010;&#20154;&#36712;&#36857;&#30340;&#24433;&#21709;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#36719;&#36829;&#32422;&#23545;&#20449;&#29992;&#35780;&#20998;&#12289;&#20449;&#29992;&#39069;&#24230;&#24635;&#25968;&#12289;&#20303;&#25151;&#25152;&#26377;&#26435;&#21644;&#25910;&#20837;&#26041;&#38754;&#20135;&#29983;&#20102;&#38271;&#26399;&#19988;&#37325;&#22823;&#30340;&#36127;&#38754;&#24433;&#21709;&#65292;&#35813;&#24433;&#21709;&#20250;&#25345;&#32493;&#21313;&#24180;&#24038;&#21491;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#20998;&#26512;&#20102;&#36719;&#36829;&#32422;&#65288;&#21363;&#36926;&#26399;90&#22825;&#20197;&#19978;&#30340;&#24773;&#20917;&#65289;&#23545;&#20010;&#20154;&#36712;&#36857;&#30340;&#24433;&#21709;&#12290;&#20351;&#29992;&#19968;&#20221;&#32422;200&#19975;&#20154;&#30340;&#19987;&#26377;&#25968;&#25454;&#38598;&#65292;&#26102;&#38388;&#27573;&#20026;2004&#24180;&#21040;2020&#24180;&#65292;&#25105;&#20204;&#21457;&#29616;&#36719;&#36829;&#32422;&#23545;&#20449;&#29992;&#35780;&#20998;&#12289;&#20449;&#29992;&#39069;&#24230;&#24635;&#25968;&#12289;&#20303;&#25151;&#25152;&#26377;&#26435;&#29366;&#20917;&#21644;&#25910;&#20837;&#31561;&#26041;&#38754;&#37117;&#20135;&#29983;&#20102;&#37325;&#22823;&#19988;&#38271;&#26399;&#30340;&#65288;&#21363;&#20107;&#20214;&#21457;&#29983;&#21518;&#38271;&#36798;&#21313;&#24180;&#30340;&#65289;&#36127;&#38754;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
We analyze the impact of soft credit default (i.e. a delinquency of 90+ days) on individual trajectories. Using a proprietary dataset on about 2 million individuals for the years 2004 to 2020, we find that a soft default has substantial and long-lasting (i.e. up to ten years after the event) negative effects on credit score, total credit limit, home-ownership status, and income.
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#21160;&#24577;&#23398;&#20064;&#27169;&#22411;&#65292;&#30740;&#31350;&#20102;&#26234;&#21147;&#26410;&#30693;&#30340;&#20195;&#29702;&#32773;&#19982;&#19981;&#21516;&#36136;&#37327;&#39033;&#30446;&#20043;&#38388;&#30340;&#21305;&#37197;&#12290;&#30740;&#31350;&#21457;&#29616;&#22686;&#21152;&#20250;&#38754;&#29575;&#20250;&#25193;&#22823;&#39640;&#36136;&#37327;&#39033;&#30446;&#30340;&#36873;&#25321;&#65292;&#32780;&#23545;&#20110;&#20302;&#36136;&#37327;&#39033;&#30446;&#22312;&#26576;&#20123;&#21306;&#22495;&#20250;&#20808;&#25193;&#22823;&#20877;&#32553;&#23567;&#12290;</title><link>http://arxiv.org/abs/2201.01813</link><description>&lt;p&gt;
&#22768;&#35465;&#12289;&#23398;&#20064;&#21644;&#25705;&#25830;&#32463;&#27982;&#20013;&#30340;&#39033;&#30446;&#36873;&#25321;
&lt;/p&gt;
&lt;p&gt;
Reputation, Learning and Project Choice in Frictional Economies. (arXiv:2201.01813v3 [econ.TH] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2201.01813
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#21160;&#24577;&#23398;&#20064;&#27169;&#22411;&#65292;&#30740;&#31350;&#20102;&#26234;&#21147;&#26410;&#30693;&#30340;&#20195;&#29702;&#32773;&#19982;&#19981;&#21516;&#36136;&#37327;&#39033;&#30446;&#20043;&#38388;&#30340;&#21305;&#37197;&#12290;&#30740;&#31350;&#21457;&#29616;&#22686;&#21152;&#20250;&#38754;&#29575;&#20250;&#25193;&#22823;&#39640;&#36136;&#37327;&#39033;&#30446;&#30340;&#36873;&#25321;&#65292;&#32780;&#23545;&#20110;&#20302;&#36136;&#37327;&#39033;&#30446;&#22312;&#26576;&#20123;&#21306;&#22495;&#20250;&#20808;&#25193;&#22823;&#20877;&#32553;&#23567;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#24341;&#20837;&#20102;&#19968;&#20010;&#21160;&#24577;&#30340;&#23398;&#20064;&#27169;&#22411;&#65292;&#28041;&#21450;&#21040;&#19968;&#20010;&#38271;&#23551;&#21629;&#26234;&#21147;&#26410;&#30693;&#30340;&#20195;&#29702;&#32773;&#19982;&#21487;&#35266;&#23519;&#21697;&#36136;&#30340;&#24322;&#36136;&#39033;&#30446;&#20043;&#38388;&#30340;&#38543;&#26426;&#21305;&#37197;&#12290;&#20195;&#29702;&#32773;&#19982;&#39033;&#30446;&#30340;&#21305;&#37197;&#32467;&#26524;&#20915;&#23450;&#20102;&#22905;&#23545;&#33258;&#24049;&#26234;&#21147;&#30340;&#21518;&#39564;&#20449;&#24565;&#65288;&#21363;&#22768;&#35465;&#65289;&#12290;&#22312;&#19968;&#20010;&#33258;&#36523;&#31867;&#22411;&#23398;&#20064;&#26694;&#26550;&#20013;&#65292;&#22806;&#29983;&#36873;&#25321;&#26159;&#20869;&#29983;&#21270;&#30340;&#65292;&#25105;&#25214;&#21040;&#20102;&#20195;&#29702;&#32773;&#30340;&#26368;&#20248;&#39033;&#30446;&#36873;&#25321;&#31574;&#30053;&#65292;&#36825;&#20915;&#23450;&#20102;&#20195;&#29702;&#32773;&#22312;&#19968;&#23450;&#22768;&#35465;&#27700;&#24179;&#19979;&#25509;&#21463;&#21738;&#20123;&#31867;&#22411;&#30340;&#39033;&#30446;&#12290;&#26368;&#20248;&#21305;&#37197;&#38598;&#30340;&#19968;&#20123;&#37096;&#20998;&#25104;&#20026;&#19981;&#26029;&#22686;&#21152;&#30340;&#21306;&#38388;&#65292;&#22312;&#19981;&#21516;&#31867;&#22411;&#30340;&#39033;&#30446;&#20043;&#38388;&#26377;&#19981;&#21516;&#30340;&#25130;&#27490;&#28857;&#12290;&#22686;&#21152;&#20250;&#38754;&#29575;&#23545;&#21305;&#37197;&#38598;&#30340;&#19981;&#21516;&#37096;&#20998;&#26377;&#19981;&#23545;&#31216;&#30340;&#24433;&#21709;&#65306;&#23427;&#26126;&#30830;&#25193;&#22823;&#39640;&#36136;&#37327;&#39033;&#30446;&#30340;&#37096;&#20998;&#65292;&#32780;&#23545;&#20110;&#20302;&#36136;&#37327;&#39033;&#30446;&#30340;&#26576;&#20123;&#21306;&#22495;&#65292;&#23427;&#20250;&#24320;&#22987;&#25193;&#22823;&#28982;&#21518;&#32553;&#23567;&#21305;&#37197;&#38598;&#12290;
&lt;/p&gt;
&lt;p&gt;
I introduce a dynamic model of learning and random meetings between a long-lived agent with unknown ability and heterogeneous projects with observable qualities. The outcomes of the agent's matches with the projects determine her posterior belief about her ability (i.e., her reputation). In a self-type learning framework with endogenous outside option, I find the optimal project selection strategy of the agent, that determines what types of projects the agent with a certain level of reputation will accept. Sections of the optimal matching set become increasing intervals, with different cutoffs across different types of the projects. Increasing the meeting rate has asymmetric effects on the sections of the matching sets: it unambiguously expands the section for the high type projects, while on some regions, it initially expands and then shrinks the section of the low type projects.
&lt;/p&gt;</description></item><item><title>&#36825;&#31687;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#26032;&#30340;&#20840;&#29699;&#25935;&#24863;&#24615;&#20998;&#26512;&#26041;&#27861;&#65292;&#21487;&#20197;&#22788;&#29702;&#20855;&#26377;&#26377;&#38480;&#21464;&#21270;&#36755;&#20837;&#21644;&#38543;&#26426;&#21151;&#33021;&#36755;&#20986;&#30340;&#24773;&#20917;&#65292;&#24182;&#24212;&#29992;&#20110;&#27668;&#20505;&#32463;&#27982;&#27169;&#22411;&#12290;</title><link>http://arxiv.org/abs/2006.13850</link><description>&lt;p&gt;
&#20840;&#29699;&#25935;&#24863;&#24615;&#21644;&#39046;&#22495;&#36873;&#25321;&#24615;&#27979;&#35797;&#29992;&#20110;&#20989;&#25968;&#20540;&#21709;&#24212;&#65306;&#24212;&#29992;&#20110;&#27668;&#20505;&#32463;&#27982;&#27169;&#22411;&#30340;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Global Sensitivity and Domain-Selective Testing for Functional-Valued Responses: An Application to Climate Economy Models. (arXiv:2006.13850v3 [stat.ME] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2006.13850
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#26032;&#30340;&#20840;&#29699;&#25935;&#24863;&#24615;&#20998;&#26512;&#26041;&#27861;&#65292;&#21487;&#20197;&#22788;&#29702;&#20855;&#26377;&#26377;&#38480;&#21464;&#21270;&#36755;&#20837;&#21644;&#38543;&#26426;&#21151;&#33021;&#36755;&#20986;&#30340;&#24773;&#20917;&#65292;&#24182;&#24212;&#29992;&#20110;&#27668;&#20505;&#32463;&#27982;&#27169;&#22411;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#29702;&#35299;&#27668;&#20505;&#21464;&#21270;&#30340;&#21160;&#21147;&#23398;&#21644;&#28436;&#21270;&#20197;&#21450;&#30456;&#20851;&#19981;&#30830;&#23450;&#24615;&#23545;&#20110;&#35774;&#35745;&#31283;&#20581;&#30340;&#25919;&#31574;&#34892;&#21160;&#33267;&#20851;&#37325;&#35201;&#12290;&#35745;&#31639;&#26426;&#27169;&#22411;&#26159;&#36825;&#20010;&#31185;&#23398;&#21162;&#21147;&#20013;&#30340;&#20851;&#38190;&#24037;&#20855;&#65292;&#36825;&#20123;&#27169;&#22411;&#24050;&#32463;&#36798;&#21040;&#20102;&#39640;&#24230;&#22797;&#26434;&#21644;&#22797;&#26434;&#30340;&#27700;&#24179;&#12290;&#27169;&#22411;&#23457;&#35745;&#26159;&#24517;&#35201;&#30340;&#65292;&#20197;&#26356;&#22909;&#22320;&#29702;&#35299;&#23427;&#20204;&#30340;&#32467;&#26524;&#65292;&#24182;&#22788;&#29702;&#36825;&#26679;&#30340;&#20107;&#23454;&#65306;&#36825;&#20123;&#27169;&#22411;&#23545;&#20110;&#20854;&#20869;&#37096;&#24037;&#20316;&#36234;&#26469;&#36234;&#19981;&#36879;&#26126;&#12290;&#24403;&#21069;&#30340;&#25216;&#26415;&#65292;&#22914;&#20840;&#29699;&#25935;&#24863;&#24615;&#20998;&#26512;&#65288;GSA&#65289;&#65292;&#23616;&#38480;&#20110;&#22788;&#29702;&#22810;&#21464;&#37327;&#36755;&#20986;&#12289;&#38543;&#26426;&#36755;&#20986;&#25110;&#26377;&#38480;&#21464;&#21270;&#36755;&#20837;&#12290;&#36825;&#38480;&#21046;&#20102;&#23427;&#20204;&#23545;&#20110;&#26410;&#26469;&#28201;&#23460;&#27668;&#20307;&#36335;&#24452;&#31561;&#26102;&#38388;&#21464;&#21270;&#21464;&#37327;&#30340;&#36866;&#29992;&#24615;&#12290;&#20026;&#20102;&#22312;&#27169;&#22411;&#38598;&#21512;&#30340;&#20998;&#26512;&#20013;&#25552;&#20379;&#38468;&#21152;&#30340;&#35821;&#20041;&#65292;&#25105;&#20204;&#25552;&#20379;&#20102;&#19968;&#20010;&#25193;&#23637;GSA&#26041;&#27861;&#30340;&#26041;&#27861;&#65292;&#26469;&#35299;&#20915;&#20855;&#26377;&#26377;&#38480;&#21464;&#21270;&#36755;&#20837;&#30340;&#38543;&#26426;&#21151;&#33021;&#36755;&#20986;&#30340;&#24773;&#20917;&#12290;&#20026;&#20102;&#22788;&#29702;&#26377;&#38480;&#21464;&#21270;&#30340;&#36755;&#20837;&#21644;&#21151;&#33021;&#36755;&#20986;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#24403;&#21069;&#21487;&#29992;&#30340;GSA&#26041;&#27861;&#30340;&#25193;&#23637;&#12290;
&lt;/p&gt;
&lt;p&gt;
Understanding the dynamics and evolution of climate change and associated uncertainties is key for designing robust policy actions. Computer models are key tools in this scientific effort, which have now reached a high level of sophistication and complexity. Model auditing is needed in order to better understand their results, and to deal with the fact that such models are increasingly opaque with respect to their inner workings. Current techniques such as Global Sensitivity Analysis (GSA) are limited to dealing either with multivariate outputs, stochastic ones, or finite-change inputs. This limits their applicability to time-varying variables such as future pathways of greenhouse gases. To provide additional semantics in the analysis of a model ensemble, we provide an extension of GSA methodologies tackling the case of stochastic functional outputs with finite change inputs. To deal with finite change inputs and functional outputs, we propose an extension of currently available GSA me
&lt;/p&gt;</description></item></channel></rss>