<rss version="2.0"><channel><title>Chat Arxiv econ</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for econ</description><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#36890;&#36807;&#22522;&#20110;&#32593;&#32476;&#34920;&#31034;&#30340;&#21160;&#24577;&#31163;&#25955;&#36873;&#25321;&#27169;&#22411;&#36827;&#34892;&#22810;&#37325;&#31163;&#25955;&#36873;&#25321;&#20998;&#26512;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#24341;&#20837;&#22522;&#20110;DAG&#30340;&#36873;&#25321;&#34920;&#31034;&#26469;&#20943;&#23569;&#27169;&#22411;&#21442;&#25968;&#25968;&#37327;&#65292;&#24182;&#25429;&#25417;&#20154;&#20204;&#22312;&#36873;&#25321;&#20013;&#30340;&#26102;&#38388;&#20381;&#36182;&#24615;&#12290;</title><link>http://arxiv.org/abs/2306.04606</link><description>&lt;p&gt;
&#22522;&#20110;&#32593;&#32476;&#34920;&#31034;&#30340;&#21160;&#24577;&#31163;&#25955;&#36873;&#25321;&#27169;&#22411;&#29992;&#20110;&#22810;&#37325;&#31163;&#25955;&#36873;&#25321;&#20998;&#26512;
&lt;/p&gt;
&lt;p&gt;
Network-based Representations and Dynamic Discrete Choice Models for Multiple Discrete Choice Analysis. (arXiv:2306.04606v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.04606
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#36890;&#36807;&#22522;&#20110;&#32593;&#32476;&#34920;&#31034;&#30340;&#21160;&#24577;&#31163;&#25955;&#36873;&#25321;&#27169;&#22411;&#36827;&#34892;&#22810;&#37325;&#31163;&#25955;&#36873;&#25321;&#20998;&#26512;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#24341;&#20837;&#22522;&#20110;DAG&#30340;&#36873;&#25321;&#34920;&#31034;&#26469;&#20943;&#23569;&#27169;&#22411;&#21442;&#25968;&#25968;&#37327;&#65292;&#24182;&#25429;&#25417;&#20154;&#20204;&#22312;&#36873;&#25321;&#20013;&#30340;&#26102;&#38388;&#20381;&#36182;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#35768;&#22810;&#36873;&#25321;&#24314;&#27169;&#24212;&#29992;&#20013;&#65292;&#20154;&#20204;&#30340;&#38656;&#27714;&#36890;&#24120;&#34987;&#25551;&#36848;&#20026;&#22810;&#37325;&#31163;&#25955;&#65292;&#36825;&#24847;&#21619;&#30528;&#20154;&#20204;&#21516;&#26102;&#36873;&#25321;&#22810;&#20010;&#39033;&#30446;&#12290;&#22312;&#22810;&#37325;&#31163;&#25955;&#36873;&#25321;&#24773;&#20917;&#19979;&#65292;&#23545;&#20154;&#20204;&#34892;&#20026;&#36827;&#34892;&#20998;&#26512;&#21644;&#39044;&#27979;&#38754;&#20020;&#30528;&#20960;&#20010;&#25361;&#25112;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#38543;&#26426;&#25928;&#29992;&#26368;&#22823;&#21270;&#65288;RUM&#65289;&#30340;&#27169;&#22411;&#65292;&#23558;&#27599;&#20010;&#36873;&#25321;&#26367;&#20195;&#38598;&#21512;&#35270;&#20026;&#22797;&#21512;&#26367;&#20195;&#38598;&#21512;&#65292;&#20854;&#20013;&#20010;&#20307;&#26681;&#25454;RUM&#26694;&#26550;&#36873;&#25321;&#19968;&#20010;&#23376;&#38598;&#12290;&#34429;&#28982;&#36825;&#31181;&#26041;&#27861;&#20026;&#22810;&#37325;&#36873;&#25321;&#20998;&#26512;&#25552;&#20379;&#20102;&#19968;&#31181;&#33258;&#28982;&#21644;&#30452;&#35266;&#30340;&#24314;&#27169;&#26041;&#27861;&#65292;&#20294;&#26159;&#21046;&#23450;&#20013;&#36873;&#25321;&#26367;&#20195;&#38598;&#21512;&#30340;&#25968;&#37327;&#20247;&#22810;&#65292;&#20351;&#24471;&#20854;&#20272;&#35745;&#21644;&#24212;&#29992;&#38590;&#20197;&#22788;&#29702;&#12290;&#20026;&#20102;&#20811;&#26381;&#36825;&#20010;&#25361;&#25112;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#22522;&#20110;&#26377;&#21521;&#26080;&#29615;&#22270;&#65288;DAG&#65289;&#30340;&#36873;&#25321;&#34920;&#31034;&#65292;&#20351;&#24471;DAG&#30340;&#27599;&#20010;&#33410;&#28857;&#37117;&#19982;&#19968;&#20010;&#22522;&#26412;&#22791;&#36873;&#26041;&#26696;&#20197;&#21450;&#39069;&#22806;&#20449;&#24687;&#30456;&#20851;&#32852;&#65292;&#27604;&#22914;&#25152;&#36873;&#25321;&#30340;&#22522;&#26412;&#22791;&#36873;&#26041;&#26696;&#25968;&#37327;&#12290;&#25105;&#20204;&#30340;&#21019;&#26032;&#22312;&#20110;&#23637;&#31034;&#20102;&#36825;&#20123;&#22522;&#20110;DAG&#34920;&#31034;&#30340;&#26041;&#27861;&#22914;&#20309;&#29992;&#20110;&#20943;&#23569;&#20272;&#35745;&#27169;&#22411;&#25152;&#38656;&#30340;&#21442;&#25968;&#25968;&#37327;&#65292;&#20197;&#21450;&#22914;&#20309;&#19982;&#21160;&#24577;&#31163;&#25955;&#36873;&#25321;&#27169;&#22411;&#30456;&#32467;&#21512;&#65292;&#20197;&#25429;&#25417;&#20154;&#20204;&#36873;&#25321;&#20013;&#30340;&#26102;&#38388;&#20381;&#36182;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
In many choice modeling applications, people demand is frequently characterized as multiple discrete, which means that people choose multiple items simultaneously. The analysis and prediction of people behavior in multiple discrete choice situations pose several challenges. In this paper, to address this, we propose a random utility maximization (RUM) based model that considers each subset of choice alternatives as a composite alternative, where individuals choose a subset according to the RUM framework. While this approach offers a natural and intuitive modeling approach for multiple-choice analysis, the large number of subsets of choices in the formulation makes its estimation and application intractable. To overcome this challenge, we introduce directed acyclic graph (DAG) based representations of choices where each node of the DAG is associated with an elemental alternative and additional information such that the number of selected elemental alternatives. Our innovation is to show
&lt;/p&gt;</description></item><item><title>&#36890;&#36807;&#21033;&#29992;&#20195;&#29702;&#20154;&#22312;&#21487;&#25805;&#32437;&#24615;&#21644;&#29420;&#35009;&#26435;&#20043;&#38388;&#30340;&#26435;&#34913;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;Gibbard-Satterthwaite&#23450;&#29702;&#12290;</title><link>http://arxiv.org/abs/2306.04587</link><description>&lt;p&gt;
&#21487;&#25805;&#32437;&#24615;&#21644;&#29420;&#35009;&#26435;&#20043;&#38388;&#30340;&#26435;&#34913;&#65306;Gibbard-Satterthwaite&#23450;&#29702;&#30340;&#35777;&#26126;
&lt;/p&gt;
&lt;p&gt;
Trade-off between manipulability and dictatorial power: a proof of the Gibbard-Satterthwaite Theorem. (arXiv:2306.04587v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.04587
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#21033;&#29992;&#20195;&#29702;&#20154;&#22312;&#21487;&#25805;&#32437;&#24615;&#21644;&#29420;&#35009;&#26435;&#20043;&#38388;&#30340;&#26435;&#34913;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;Gibbard-Satterthwaite&#23450;&#29702;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#36171;&#20104;&#20165;&#39030;&#37096;&#21644;&#39640;&#25928;&#30340;&#31038;&#20250;&#36873;&#25321;&#20934;&#21017;&#19968;&#31181;&#21452;&#37325;&#24207;&#32467;&#26500;&#65292;&#21033;&#29992;&#35268;&#21017;&#20801;&#35768;&#20195;&#29702;&#20154;&#20855;&#26377;&#19981;&#21516;&#31243;&#24230;&#30340;&#21487;&#25805;&#32437;&#24615;&#21644;&#29420;&#35009;&#26435;&#20043;&#38388;&#30340;&#26435;&#34913;&#65292;&#25105;&#20204;&#25552;&#20379;&#20102;Gibbard-Satterthwaite&#23450;&#29702;&#30340;&#35777;&#26126;&#12290;
&lt;/p&gt;
&lt;p&gt;
By endowing the class of tops-only and efficient social choice rules with a dual order structure that exploits the trade-off between different degrees of manipulability and dictatorial power rules allow agents to have, we provide a proof of the Gibbard-Satterthwaite Theorem.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#27431;&#27954;&#22830;&#34892;&#21033;&#29575;&#30340;&#22269;&#38469;&#28322;&#20986;&#25928;&#24212;&#65292;&#24182;&#35777;&#26126;&#24573;&#30053;&#20449;&#24687;&#25928;&#24212;&#20250;&#23548;&#33268;&#20854;&#22269;&#38469;&#28322;&#20986;&#22833;&#30495;&#12290;&#20316;&#32773;&#36890;&#36807;&#23558;&#32431;&#36135;&#24065;&#25919;&#31574;&#20914;&#20987;&#19982;&#20449;&#24687;&#25928;&#24212;&#21306;&#20998;&#24320;&#26469;&#65292;&#21457;&#29616;&#20854;&#22269;&#38469;&#20135;&#37327;&#12289;&#27719;&#29575;&#21644;&#32929;&#31080;&#25351;&#25968;&#30340;&#28322;&#20986;&#25928;&#24212;&#27604;&#26631;&#20934;&#31574;&#30053;&#39640;2&#21040;3&#20493;&#12290;</title><link>http://arxiv.org/abs/2306.04562</link><description>&lt;p&gt;
&#27431;&#27954;&#22830;&#34892;&#21033;&#29575;&#30340;&#22269;&#38469;&#28322;&#20986;&#25928;&#24212;&#65306;&#36135;&#24065;&#25919;&#31574;&#21644;&#20449;&#24687;&#25928;&#24212;
&lt;/p&gt;
&lt;p&gt;
International Spillovers of ECB Interest Rates: Monetary Policy &amp; Information Effects. (arXiv:2306.04562v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.04562
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#27431;&#27954;&#22830;&#34892;&#21033;&#29575;&#30340;&#22269;&#38469;&#28322;&#20986;&#25928;&#24212;&#65292;&#24182;&#35777;&#26126;&#24573;&#30053;&#20449;&#24687;&#25928;&#24212;&#20250;&#23548;&#33268;&#20854;&#22269;&#38469;&#28322;&#20986;&#22833;&#30495;&#12290;&#20316;&#32773;&#36890;&#36807;&#23558;&#32431;&#36135;&#24065;&#25919;&#31574;&#20914;&#20987;&#19982;&#20449;&#24687;&#25928;&#24212;&#21306;&#20998;&#24320;&#26469;&#65292;&#21457;&#29616;&#20854;&#22269;&#38469;&#20135;&#37327;&#12289;&#27719;&#29575;&#21644;&#32929;&#31080;&#25351;&#25968;&#30340;&#28322;&#20986;&#25928;&#24212;&#27604;&#26631;&#20934;&#31574;&#30053;&#39640;2&#21040;3&#20493;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#23637;&#31034;&#20102;&#26080;&#35270;&#27431;&#27954;&#22830;&#34892;&#36135;&#24065;&#25919;&#31574;&#20915;&#31574;&#20844;&#21578;&#21608;&#22260;&#30340;&#20449;&#24687;&#25928;&#24212;&#20250;&#23548;&#33268;&#20854;&#22269;&#38469;&#28322;&#20986;&#22833;&#30495;&#12290;&#20351;&#29992;23&#20010;&#32463;&#27982;&#20307;&#30340;&#25968;&#25454;&#65292;&#21253;&#25324;&#26032;&#20852;&#24066;&#22330;&#21644;&#21457;&#36798;&#24066;&#22330;&#65292;&#20316;&#32773;&#23637;&#31034;&#20102;&#36981;&#24490;&#23558;&#32431;&#36135;&#24065;&#25919;&#31574;&#20914;&#20987;&#19982;&#20449;&#24687;&#25928;&#24212;&#21306;&#20998;&#24320;&#26469;&#30340;&#35782;&#21035;&#31574;&#30053;&#65292;&#23558;&#24341;&#36215;&#30340;&#22269;&#38469;&#20135;&#37327;&#12289;&#27719;&#29575;&#21644;&#32929;&#31080;&#25351;&#25968;&#30340;&#28322;&#20986;&#25928;&#24212;&#65292;&#20854;&#25968;&#37327;&#32423;&#27604;&#36981;&#24490;&#26631;&#20934;&#39640;&#39057;&#29575;&#35782;&#21035;&#31574;&#30053;&#24341;&#36215;&#30340;&#28322;&#20986;&#25928;&#24212;&#39640;2&#21040;3&#20493;&#12290;&#36825;&#31181;&#20559;&#24046;&#26159;&#30001;&#20110;&#32431;&#36135;&#24065;&#25919;&#31574;&#21644;&#20449;&#24687;&#25928;&#24212;&#22312;&#22269;&#38469;&#28322;&#20986;&#26041;&#38754;&#26377;&#30452;&#35266;&#30456;&#21453;&#30340;&#20316;&#29992;&#12290;&#23545;&#20110;&#19968;&#31995;&#21015;&#31283;&#20581;&#24615;&#26816;&#39564;&#65292;&#22914;&#23376;&#26679;&#26412;&#8220;&#25509;&#36817;&#8221;&#21644;&#8220;&#36828;&#31163;&#8221;&#22269;&#23478;&#12289;&#26032;&#20852;&#24066;&#22330;&#21644;&#21457;&#36798;&#24066;&#22330;&#12289;&#20351;&#29992;&#26412;&#22320;&#25237;&#24433;&#25216;&#26415;&#21644;&#25511;&#21046;&#8220;&#20449;&#24687;&#25928;&#24212;&#8221;&#30340;&#26367;&#20195;&#26041;&#27861;&#37117;&#24471;&#21040;&#20102;&#32467;&#26524;&#12290;&#20316;&#32773;&#35748;&#20026;&#36825;&#31181;&#20559;&#24046;&#21487;&#33021;&#23548;&#33268;&#20102;...
&lt;/p&gt;
&lt;p&gt;
This paper shows that disregarding the information effects around the European Central Bank monetary policy decision announcements biases its international spillovers. Using data from 23 economies, both Emerging and Advanced, I show that following an identification strategy that disentangles pure monetary policy shocks from information effects lead to international spillovers on industrial production, exchange rates and equity indexes which are between 2 to 3 times larger in magnitude than those arising from following the standard high frequency identification strategy. This bias is driven by pure monetary policy and information effects having intuitively opposite international spillovers. Results are present for a battery of robustness checks: for a sub-sample of ``close'' and ``further away'' countries, for both Emerging and Advanced economies, using local projection techniques and for alternative methods that control for ``information effects''. I argue that this biases may have led
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#25552;&#20379;&#20102;&#19968;&#20010;&#32479;&#19968;&#30340;&#20559;&#24046;&#37492;&#21035;&#32467;&#26524;&#65292;&#20197;&#35780;&#20272;&#30417;&#31649;&#25919;&#31574;&#23545;&#31038;&#20250;&#31119;&#21033;&#30340;&#24433;&#21709;&#65292;&#21033;&#29992;&#20102;copula&#31283;&#23450;&#20551;&#35774;&#65292;&#21487;&#20197;&#23481;&#32435;&#36136;&#37327;&#28857;&#21644;&#19981;&#36830;&#32493;&#65292;&#21516;&#26102;&#32771;&#34385;&#19981;&#21487;&#35266;&#23519;&#30340;&#36873;&#25321;&#21644;&#38750;&#31283;&#24577;&#30340;&#32467;&#26524;&#20998;&#24067;&#12290;</title><link>http://arxiv.org/abs/2306.04494</link><description>&lt;p&gt;
&#22312;&#24046;&#24322;&#24615;-in-Difference&#35774;&#32622;&#20013;&#35780;&#20272;&#30417;&#31649;&#25919;&#31574;&#23545;&#31038;&#20250;&#31119;&#21033;&#30340;&#24433;&#21709;
&lt;/p&gt;
&lt;p&gt;
Evaluating the Impact of Regulatory Policies on Social Welfare in Difference-in-Difference Settings. (arXiv:2306.04494v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.04494
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20379;&#20102;&#19968;&#20010;&#32479;&#19968;&#30340;&#20559;&#24046;&#37492;&#21035;&#32467;&#26524;&#65292;&#20197;&#35780;&#20272;&#30417;&#31649;&#25919;&#31574;&#23545;&#31038;&#20250;&#31119;&#21033;&#30340;&#24433;&#21709;&#65292;&#21033;&#29992;&#20102;copula&#31283;&#23450;&#20551;&#35774;&#65292;&#21487;&#20197;&#23481;&#32435;&#36136;&#37327;&#28857;&#21644;&#19981;&#36830;&#32493;&#65292;&#21516;&#26102;&#32771;&#34385;&#19981;&#21487;&#35266;&#23519;&#30340;&#36873;&#25321;&#21644;&#38750;&#31283;&#24577;&#30340;&#32467;&#26524;&#20998;&#24067;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#37327;&#21270;&#30417;&#31649;&#25919;&#31574;&#23545;&#31038;&#20250;&#31119;&#21033;&#30340;&#24433;&#21709;&#36890;&#24120;&#38656;&#35201;&#30830;&#23450;&#21453;&#20107;&#23454;&#20998;&#24067;&#12290;&#35768;&#22810;&#36825;&#31181;&#25919;&#31574;&#65288;&#22914;&#26368;&#20302;&#24037;&#36164;&#25110;&#26368;&#20302;&#24037;&#20316;&#26102;&#38388;&#65289;&#20250;&#22312;&#32467;&#26524;&#20998;&#24067;&#20013;&#29983;&#25104;&#36136;&#37327;&#28857;&#21644;/&#25110;&#19981;&#36830;&#32493;&#24615;&#12290;&#24046;&#24322;-in-difference&#25991;&#29486;&#20013;&#29616;&#26377;&#30340;&#26041;&#27861;&#26080;&#27861;&#23481;&#32435;&#36825;&#20123;&#19981;&#36830;&#32493;&#24615;&#65292;&#21516;&#26102;&#32771;&#34385;&#21040;&#19981;&#21487;&#35266;&#23519;&#30340;&#36873;&#25321;&#21644;&#38750;&#31283;&#24577;&#30340;&#32467;&#26524;&#20998;&#24067;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#19968;&#20010;&#32479;&#19968;&#30340;&#37096;&#20998;&#35782;&#21035;&#32467;&#26524;&#65292;&#21487;&#20197;&#35299;&#37322;&#36825;&#20123;&#29305;&#24449;&#12290;&#25105;&#20204;&#30340;&#20027;&#35201;&#35782;&#21035;&#20551;&#35774;&#26159;&#26410;&#32463;&#22788;&#29702;&#30340;&#28508;&#22312;&#32467;&#26524;&#20998;&#24067;&#21644;&#32452;&#25104;&#21592;&#36164;&#26684;&#65288;&#27835;&#30103;&#20998;&#37197;&#65289;&#20043;&#38388;&#30340;&#20381;&#36182;&#20851;&#31995;&#65288;copula&#65289;&#22312;&#26102;&#38388;&#19978;&#30340;&#31283;&#23450;&#24615;&#12290;&#21033;&#29992;&#36825;&#20010;copula&#31283;&#23450;&#24615;&#20551;&#35774;&#65292;&#25105;&#20204;&#21487;&#20197;&#25552;&#20379;&#19968;&#20010;&#19982;&#21333;&#35843;&#21464;&#25442;&#26080;&#20851;&#30340;&#35782;&#21035;&#32467;&#26524;&#12290;&#25105;&#20204;&#25552;&#20379;&#20102;&#36866;&#29992;&#20110;&#20219;&#20309;&#32467;&#26524;&#30340;&#27835;&#30103;&#32452;&#21453;&#20107;&#23454;&#20998;&#24067;&#30340;&#38160;&#21033;&#36793;&#30028;&#12290;
&lt;/p&gt;
&lt;p&gt;
Quantifying the impact of regulatory policies on social welfare generally requires the identification of counterfactual distributions. Many of these policies (e.g. minimum wages or minimum working time) generate mass points and/or discontinuities in the outcome distribution. Existing approaches in the difference-in-difference literature cannot accommodate these discontinuities while accounting for selection on unobservables and non-stationary outcome distributions. We provide a unifying partial identification result that can account for these features. Our main identifying assumption is the stability of the dependence (copula) between the distribution of the untreated potential outcome and group membership (treatment assignment) across time. Exploiting this copula stability assumption allows us to provide an identification result that is invariant to monotonic transformations. We provide sharp bounds on the counterfactual distribution of the treatment group suitable for any outcome, wh
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25506;&#35752;&#20102;&#26368;&#39640;&#27861;&#38498;&#22312;Chevron&#20915;&#23450;&#19979;&#23545;&#26426;&#26500;&#39044;&#38450;&#25514;&#26045;&#30340;&#35299;&#37322;&#24212;&#35813;&#36981;&#20174;&#21738;&#20123;&#35268;&#21017;&#65292;&#23545;&#20256;&#32479;&#24030;&#26435;&#39046;&#22495;&#20869;&#30340;&#22269;&#20250;&#24847;&#22270;&#37319;&#21462;&#39640;&#24230;&#37325;&#35270;&#12290;</title><link>http://arxiv.org/abs/2306.04463</link><description>&lt;p&gt;
&#39044;&#20808;&#38459;&#27490;&#25480;&#26435;&#30340;Chevron&#26657;&#20934;
&lt;/p&gt;
&lt;p&gt;
Calibrating Chevron for Preemption. (arXiv:2306.04463v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.04463
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25506;&#35752;&#20102;&#26368;&#39640;&#27861;&#38498;&#22312;Chevron&#20915;&#23450;&#19979;&#23545;&#26426;&#26500;&#39044;&#38450;&#25514;&#26045;&#30340;&#35299;&#37322;&#24212;&#35813;&#36981;&#20174;&#21738;&#20123;&#35268;&#21017;&#65292;&#23545;&#20256;&#32479;&#24030;&#26435;&#39046;&#22495;&#20869;&#30340;&#22269;&#20250;&#24847;&#22270;&#37319;&#21462;&#39640;&#24230;&#37325;&#35270;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#33258;&#21010;&#26102;&#20195;&#30340;Chevron&#20915;&#23450;&#20197;&#26469;&#65292;&#20960;&#20046;&#24050;&#32463;&#36807;&#21435;&#20102;&#23558;&#36817;&#19977;&#21313;&#24180;&#65292;&#26368;&#39640;&#27861;&#38498;&#23578;&#26410;&#38416;&#26126;&#35813;&#26696;&#30340;&#26426;&#26500;&#27861;&#35299;&#37322;&#21407;&#21017;&#19982;&#25105;&#20204;&#36825;&#20010;&#26102;&#20195;&#26368;&#20855;&#20105;&#35758;&#30340;&#32852;&#37030;&#20027;&#20041;&#38382;&#39064;&#20043;&#19968;&#8212;&#8212;&#24030;&#27861;&#35268;&#31649;&#36758;&#26435;&#8212;&#8212;&#20043;&#38388;&#30340;&#20851;&#31995;&#12290;&#27861;&#38498;&#24212;&#35813;&#22312;Chevron&#19979;&#36981;&#20174;&#38459;&#27490;&#26426;&#26500;&#30340;&#35299;&#37322;&#65292;&#36824;&#26159;&#39044;&#20808;&#38450;&#27490;&#30340;&#32852;&#37030;&#20027;&#20041;&#24433;&#21709;&#35201;&#27714;&#25552;&#20986;&#19968;&#31181;&#19981;&#22826;&#39034;&#20174;&#30340;&#35299;&#20915;&#26041;&#26696;&#65311;&#35780;&#35770;&#21592;&#25552;&#20379;&#20102;&#26080;&#25968;&#21487;&#33021;&#30340;&#35299;&#20915;&#26041;&#26696;&#65292;&#20294;&#36804;&#20170;&#20026;&#27490;&#65292;&#27861;&#38498;&#24050;&#32463;&#25269;&#21046;&#20102;&#25152;&#26377;&#36825;&#20123;&#35299;&#20915;&#26041;&#26696;&#12290;&#26412;&#25991;&#23545;&#36825;&#22330;&#36777;&#35770;&#20316;&#20986;&#20102;&#20004;&#20010;&#36129;&#29486;&#12290;&#39318;&#20808;&#65292;&#36890;&#36807;&#23545;&#27861;&#38498;&#26368;&#36817;&#30340;&#26426;&#26500;&#38459;&#27490;&#20915;&#23450;&#36827;&#34892;&#35814;&#32454;&#20998;&#26512;&#65292;&#36861;&#36394;&#20854;&#23545;&#21508;&#31181;&#25552;&#20986;&#30340;&#35268;&#21017;&#29369;&#35947;&#19981;&#20915;&#30340;&#24577;&#24230;&#65292;&#24182;&#20307;&#29616;&#20986;&#23545;&#20256;&#32479;&#24030;&#26435;&#39046;&#22495;&#30340;&#22269;&#20250;&#24847;&#22270;&#30340;&#39640;&#24230;&#37325;&#35270;&#12290;&#27861;&#38498;&#35748;&#35782;&#21040;&#65292;&#25480;&#26435;&#38459;&#27490;&#30340;&#22269;&#20250;&#24847;&#22270;&#22312;&#27599;&#20010;&#26696;&#20214;&#20013;&#37117;&#26377;&#25152;&#19981;&#21516;&#65292;&#22240;&#27492;&#19968;&#30452;&#29369;&#35947;&#37319;&#29992;&#20840;&#38754;&#30340;&#35268;&#21017;&#12290;
&lt;/p&gt;
&lt;p&gt;
Now almost three decades since its seminal Chevron decision, the Supreme Court has yet to articulate how that case's doctrine of deference to agency statutory interpretations relates to one of the most compelling federalism issues of our time: regulatory preemption of state law. Should courts defer to preemptive agency interpretations under Chevron, or do preemption's federalism implications demand a less deferential approach? Commentators have provided no shortage of possible solutions, but thus far the Court has resisted all of them.  This Article makes two contributions to the debate. First, through a detailed analysis of the Court's recent agency-preemption decisions, I trace its hesitancy to adopt any of the various proposed rules to its high regard for congressional intent where areas of traditional state sovereignty are at risk. Recognizing that congressional intent to delegate preemptive authority varies from case to case, the Court has hesitated to adopt an across-the-board ru
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#23454;&#35777;&#20998;&#26512;&#20102;&#26368;&#39640;&#27861;&#38498;&#38556;&#30861;&#29289;&#25250;&#20808;&#26435;&#30340;&#20915;&#23450;&#65292;&#24182;&#25581;&#31034;&#20102;&#20196;&#20154;&#24778;&#35766;&#30340;&#21453;&#38556;&#30861;&#29289;&#25250;&#20808;&#26435;&#32852;&#30431;&#30340;&#24418;&#25104;&#65292;&#35813;&#32852;&#30431;&#30001;&#25176;&#39532;&#26031;&#22823;&#27861;&#23448;&#36880;&#28176;&#19982;&#27861;&#38498;&#33258;&#30001;&#20826;&#27966;&#32452;&#25104;&#30340;&#20116;&#20010;&#27861;&#23448;&#25237;&#31080;&#38598;&#22242;&#12290;</title><link>http://arxiv.org/abs/2306.04462</link><description>&lt;p&gt;
&#26368;&#39640;&#27861;&#38498;&#38556;&#30861;&#29289;&#25250;&#20808;&#26435;&#30340;&#23454;&#35777;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
An Empirical Study of Obstacle Preemption in the Supreme Court. (arXiv:2306.04462v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.04462
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#23454;&#35777;&#20998;&#26512;&#20102;&#26368;&#39640;&#27861;&#38498;&#38556;&#30861;&#29289;&#25250;&#20808;&#26435;&#30340;&#20915;&#23450;&#65292;&#24182;&#25581;&#31034;&#20102;&#20196;&#20154;&#24778;&#35766;&#30340;&#21453;&#38556;&#30861;&#29289;&#25250;&#20808;&#26435;&#32852;&#30431;&#30340;&#24418;&#25104;&#65292;&#35813;&#32852;&#30431;&#30001;&#25176;&#39532;&#26031;&#22823;&#27861;&#23448;&#36880;&#28176;&#19982;&#27861;&#38498;&#33258;&#30001;&#20826;&#27966;&#32452;&#25104;&#30340;&#20116;&#20010;&#27861;&#23448;&#25237;&#31080;&#38598;&#22242;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26368;&#39640;&#27861;&#38498;&#32852;&#37030;&#25250;&#20808;&#26435;&#20915;&#23450;&#26159;&#20986;&#20102;&#21517;&#30340;&#19981;&#21487;&#39044;&#27979;&#12290;&#20256;&#32479;&#30340;&#24038;&#21491;&#38453;&#33829;&#25237;&#31080;&#22312;&#31454;&#20105;&#24615;&#24847;&#35782;&#24418;&#24577;&#30340;&#25289;&#21160;&#19979;&#29926;&#35299;&#20102;&#12290;&#21487;&#39044;&#27979;&#25237;&#31080;&#38598;&#22242;&#30340;&#29926;&#35299;&#20351;&#24471;&#26368;&#21463;&#32852;&#37030;&#25250;&#20808;&#26435;&#24433;&#21709;&#30340;&#21830;&#19994;&#21033;&#30410;&#26041;&#26080;&#27861;&#30830;&#23450;&#28508;&#22312;&#31532;&#19977;&#26041;&#21463;&#23475;&#36131;&#20219;&#30340;&#33539;&#22260;&#65292;&#29978;&#33267;&#19981;&#30830;&#23450;&#26410;&#26469;&#30340;&#32034;&#36180;&#20250;&#36866;&#29992;&#24030;&#27861;&#36824;&#26159;&#32852;&#37030;&#27861;&#12290;&#26412;&#25991;&#23545;&#26368;&#36817;&#21313;&#20116;&#24180;&#27861;&#38498;&#21028;&#20915;&#30340;&#23454;&#35777;&#20998;&#26512;&#25581;&#31034;&#20102;&#27861;&#38498;&#22312;&#38556;&#30861;&#29289;&#25250;&#20808;&#26435;&#26696;&#20214;&#20013;&#29420;&#29305;&#30340;&#25237;&#31080;&#32852;&#30431;&#12290;&#19968;&#20010;&#20196;&#20154;&#24778;&#35766;&#30340;&#21453;&#38556;&#30861;&#29289;&#25250;&#20808;&#26435;&#32852;&#30431;&#27491;&#22312;&#24418;&#25104;&#65292;&#38543;&#30528;&#25176;&#39532;&#26031;&#22823;&#27861;&#23448;&#36880;&#28176;&#19982;&#27861;&#38498;&#33258;&#30001;&#20826;&#27966;&#31449;&#22312;&#19968;&#36215;&#65292;&#24418;&#25104;&#19968;&#20010;&#21453;&#23545;&#38556;&#30861;&#29289;&#25250;&#20808;&#26435;&#30340;&#20116;&#20010;&#27861;&#23448;&#25237;&#31080;&#38598;&#22242;&#12290;
&lt;/p&gt;
&lt;p&gt;
The Supreme Court's federal preemption decisions are notoriously unpredictable. Traditional left-right voting alignments break down in the face of competing ideological pulls. The breakdown of predictable voting blocs leaves the business interests most affected by federal preemption uncertain of the scope of potential liability to injured third parties and unsure even of whether state or federal law will be applied to future claims.  This empirical analysis of the Court's decisions over the last fifteen years sheds light on the Court's unique voting alignments in obstacle preemption cases. A surprising anti-obstacle preemption coalition is forming as Justice Thomas gradually positions himself alongside the Court's liberals to form a five-justice voting bloc opposing obstacle preemption.
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#39044;&#27979;&#24066;&#22330;&#26426;&#21046;&#65292;&#20801;&#35768;&#22312;&#26080;&#27861;&#39564;&#35777;&#32467;&#26524;&#30340;&#24773;&#20917;&#19979;&#20174;&#19968;&#32452;&#20195;&#29702;&#20013;&#25910;&#38598;&#20449;&#24687;&#21644;&#27719;&#24635;&#39044;&#27979;&#65292;&#20351;&#29992;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#65292;&#23454;&#29616;&#33258;&#27835;&#20197;&#21450;&#36991;&#20813;&#20102;&#38656;&#36827;&#19968;&#27493;&#30340;&#39564;&#35777;&#25110;&#24178;&#39044;&#12290;</title><link>http://arxiv.org/abs/2306.04305</link><description>&lt;p&gt;
&#26080;&#27861;&#39564;&#35777;&#32467;&#26524;&#30340;&#33258;&#21160;&#35299;&#20915;&#39044;&#27979;&#24066;&#22330;
&lt;/p&gt;
&lt;p&gt;
Self-Resolving Prediction Markets for Unverifiable Outcomes. (arXiv:2306.04305v1 [cs.GT])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.04305
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#39044;&#27979;&#24066;&#22330;&#26426;&#21046;&#65292;&#20801;&#35768;&#22312;&#26080;&#27861;&#39564;&#35777;&#32467;&#26524;&#30340;&#24773;&#20917;&#19979;&#20174;&#19968;&#32452;&#20195;&#29702;&#20013;&#25910;&#38598;&#20449;&#24687;&#21644;&#27719;&#24635;&#39044;&#27979;&#65292;&#20351;&#29992;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#65292;&#23454;&#29616;&#33258;&#27835;&#20197;&#21450;&#36991;&#20813;&#20102;&#38656;&#36827;&#19968;&#27493;&#30340;&#39564;&#35777;&#25110;&#24178;&#39044;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#39044;&#27979;&#24066;&#22330;&#36890;&#36807;&#26681;&#25454;&#39044;&#27979;&#26159;&#21542;&#25509;&#36817;&#21487;&#39564;&#35777;&#30340;&#26410;&#26469;&#32467;&#26524;&#21521;&#20195;&#29702;&#25903;&#20184;&#36153;&#29992;&#26469;&#28608;&#21169;&#21644;&#27719;&#24635;&#20449;&#24565;&#12290;&#28982;&#32780;&#65292;&#35768;&#22810;&#37325;&#35201;&#38382;&#39064;&#30340;&#32467;&#26524;&#38590;&#20197;&#39564;&#35777;&#25110;&#19981;&#21487;&#39564;&#35777;&#65292;&#22240;&#20026;&#21487;&#33021;&#24456;&#38590;&#25110;&#19981;&#21487;&#33021;&#33719;&#21462;&#23454;&#38469;&#24773;&#20917;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#32780;&#21448;&#19981;&#30452;&#35266;&#30340;&#32467;&#26524;&#65292;&#34920;&#26126;&#21487;&#20197;&#36890;&#36807;&#21521;&#20195;&#29702;&#25903;&#20184;&#20854;&#39044;&#27979;&#19982;&#31934;&#24515;&#36873;&#25321;&#30340;&#21442;&#32771;&#20195;&#29702;&#30340;&#39044;&#27979;&#20043;&#38388;&#30340;&#36127;&#20132;&#21449;&#29109;&#26469;&#36816;&#34892;&#19968;&#20010;&#949;-&#28608;&#21169;&#20860;&#23481;&#30340;&#39044;&#27979;&#24066;&#22330;&#65292;&#20174;&#20195;&#29702;&#27744;&#20013;&#33719;&#21462;&#20449;&#24687;&#24182;&#36827;&#34892;&#26377;&#25928;&#30340;&#27719;&#24635;&#65292;&#32780;&#19981;&#38656;&#35201;&#35266;&#23519;&#32467;&#26524;&#12290;&#25105;&#20204;&#30340;&#26426;&#21046;&#21033;&#29992;&#19968;&#20010;&#31163;&#32447;&#30340;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#65292;&#35813;&#27169;&#22411;&#26681;&#25454;&#24066;&#22330;&#35774;&#35745;&#32773;&#24050;&#30693;&#30340;&#19968;&#32452;&#29305;&#24449;&#26469;&#39044;&#27979;&#32467;&#26524;&#65292;&#20174;&#32780;&#20351;&#24066;&#22330;&#33021;&#22815;&#22312;&#35266;&#23519;&#21040;&#32467;&#26524;&#21518;&#33258;&#34892;&#35299;&#20915;&#24182;&#31435;&#21363;&#21521;&#20195;&#29702;&#25903;&#20184;&#25253;&#37228;&#65292;&#32780;&#19981;&#38656;&#35201;&#36827;&#19968;&#27493;&#30340;&#39564;&#35777;&#25110;&#24178;&#39044;&#12290;&#25105;&#20204;&#23545;&#25105;&#20204;&#30340;&#26426;&#21046;&#30340;&#25928;&#29575;&#12289;&#28608;&#21169;&#20860;&#23481;&#24615;&#21644;&#25910;&#25947;&#24615;&#25552;&#20379;&#20102;&#29702;&#35770;&#20445;&#35777;&#65292;&#21516;&#26102;&#22312;&#20960;&#20010;&#30495;&#23454;&#19990;&#30028;&#30340;&#25968;&#25454;&#38598;&#19978;&#36827;&#34892;&#20102;&#39564;&#35777;&#12290;
&lt;/p&gt;
&lt;p&gt;
Prediction markets elicit and aggregate beliefs by paying agents based on how close their predictions are to a verifiable future outcome. However, outcomes of many important questions are difficult to verify or unverifiable, in that the ground truth may be hard or impossible to access. Examples include questions about causal effects where it is infeasible or unethical to run randomized trials; crowdsourcing and content moderation tasks where it is prohibitively expensive to verify ground truth; and questions asked over long time horizons, where the delay until the realization of the outcome skews agents' incentives to report their true beliefs. We present a novel and unintuitive result showing that it is possible to run an $\varepsilon-$incentive compatible prediction market to elicit and efficiently aggregate information from a pool of agents without observing the outcome by paying agents the negative cross-entropy between their prediction and that of a carefully chosen reference agen
&lt;/p&gt;</description></item><item><title>&#36825;&#31687;&#35770;&#25991;&#20171;&#32461;&#20102;&#22312;&#37327;&#23376;&#36864;&#28779;&#22120;&#19978;&#20351;&#29992;&#21160;&#24577;&#35268;&#21010;&#35299;&#20915;&#32463;&#27982;&#27169;&#22411;&#30340;&#26041;&#27861;&#65292;&#24182;&#21462;&#24471;&#20102;&#25968;&#37327;&#32423;&#30340;&#21152;&#36895;&#65292;&#36825;&#23545;&#20110;&#35299;&#20915;&#26356;&#20855;&#25361;&#25112;&#24615;&#30340;&#32463;&#27982;&#38382;&#39064;&#20855;&#26377;&#28508;&#22312;&#20215;&#20540;&#12290;</title><link>http://arxiv.org/abs/2306.04285</link><description>&lt;p&gt;
&#37327;&#23376;&#36864;&#28779;&#20013;&#30340;&#21160;&#24577;&#35268;&#21010;&#65306;&#35299;&#20915;RBC&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
Dynamic Programming on a Quantum Annealer: Solving the RBC Model. (arXiv:2306.04285v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.04285
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#20171;&#32461;&#20102;&#22312;&#37327;&#23376;&#36864;&#28779;&#22120;&#19978;&#20351;&#29992;&#21160;&#24577;&#35268;&#21010;&#35299;&#20915;&#32463;&#27982;&#27169;&#22411;&#30340;&#26041;&#27861;&#65292;&#24182;&#21462;&#24471;&#20102;&#25968;&#37327;&#32423;&#30340;&#21152;&#36895;&#65292;&#36825;&#23545;&#20110;&#35299;&#20915;&#26356;&#20855;&#25361;&#25112;&#24615;&#30340;&#32463;&#27982;&#38382;&#39064;&#20855;&#26377;&#28508;&#22312;&#20215;&#20540;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#20171;&#32461;&#20102;&#19968;&#31181;&#26032;&#26041;&#27861;&#65292;&#20351;&#29992;&#37327;&#23376;&#36864;&#28779;&#22120;&#35299;&#20915;&#21160;&#24577;&#35268;&#21010;&#38382;&#39064;&#65292;&#20363;&#22914;&#35768;&#22810;&#32463;&#27982;&#27169;&#22411;&#20013;&#30340;&#38382;&#39064;&#12290;&#37327;&#23376;&#36864;&#28779;&#22120;&#26159;&#19968;&#31181;&#19987;&#38376;&#29992;&#20110;&#32452;&#21512;&#20248;&#21270;&#30340;&#35774;&#22791;&#65292;&#23427;&#23581;&#35797;&#36890;&#36807;&#22312;&#25152;&#26377;&#29366;&#24577;&#30340;&#37327;&#23376;&#21472;&#21152;&#24577;&#20013;&#24320;&#22987;&#65292;&#20197;&#27627;&#31186;&#20026;&#21333;&#20301;&#29983;&#25104;&#20505;&#36873;&#30340;&#20840;&#23616;&#35299;&#65292;&#32780;&#19981;&#32771;&#34385;&#38382;&#39064;&#35268;&#27169;&#12290;&#20351;&#29992;&#29616;&#26377;&#30340;&#37327;&#23376;&#30828;&#20214;&#65292;&#25105;&#20204;&#22312;&#35299;&#20915;&#23454;&#38469;&#21830;&#19994;&#21608;&#26399;&#27169;&#22411;&#26041;&#38754;&#21462;&#24471;&#20102;&#25968;&#37327;&#32423;&#30340;&#21152;&#36895;&#65292;&#20248;&#20110;&#25991;&#29486;&#20013;&#30340;&#22522;&#20934;&#12290;&#25105;&#20204;&#36824;&#35814;&#32454;&#20171;&#32461;&#20102;&#37327;&#23376;&#36864;&#28779;&#65292;&#24182;&#35752;&#35770;&#20102;&#23427;&#22312;&#35299;&#20915;&#26356;&#20855;&#25361;&#25112;&#24615;&#30340;&#32463;&#27982;&#38382;&#39064;&#26041;&#38754;&#30340;&#28508;&#22312;&#29992;&#36884;&#12290;
&lt;/p&gt;
&lt;p&gt;
We introduce a novel approach to solving dynamic programming problems, such as those in many economic models, on a quantum annealer, a specialized device that performs combinatorial optimization. Quantum annealers attempt to solve an NP-hard problem by starting in a quantum superposition of all states and generating candidate global solutions in milliseconds, irrespective of problem size. Using existing quantum hardware, we achieve an order-of-magnitude speed-up in solving the real business cycle model over benchmarks in the literature. We also provide a detailed introduction to quantum annealing and discuss its potential use for more challenging economic problems.
&lt;/p&gt;</description></item><item><title>&#30830;&#23450;&#21442;&#25968;&#27169;&#22411;&#30340;&#24191;&#20041;&#20542;&#21521;&#24471;&#20998;&#21487;&#24369;&#21270;&#25928;&#29575;&#12290;&#21363;&#20351;&#27169;&#22411;&#24456;&#22823;&#65292;&#30693;&#36947;&#20542;&#21521;&#24471;&#20998;&#30340;&#21442;&#25968;&#32467;&#26500;&#36824;&#26159;&#20250;&#25552;&#39640;&#25928;&#29575;&#12290;&#30693;&#36947;&#20998;&#23618;&#32467;&#26500;&#21487;&#20197;&#25552;&#39640;&#25928;&#29575;&#65292;&#29305;&#21035;&#26159;&#24403;&#27599;&#20010;&#23618;&#27425;&#32452;&#20214;&#30340;&#22823;&#23567;&#36739;&#23567;&#26102;&#12290;</title><link>http://arxiv.org/abs/2306.04177</link><description>&lt;p&gt;
&#24191;&#20041;&#20542;&#21521;&#24471;&#20998;&#30340;&#21442;&#25968;&#38480;&#21046;&#23545;&#21322;&#21442;&#25968;&#25928;&#29575;&#30340;&#25552;&#21319;
&lt;/p&gt;
&lt;p&gt;
Semiparametric Efficiency Gains from Parametric Restrictions on the Generalized Propensity Score. (arXiv:2306.04177v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.04177
&lt;/p&gt;
&lt;p&gt;
&#30830;&#23450;&#21442;&#25968;&#27169;&#22411;&#30340;&#24191;&#20041;&#20542;&#21521;&#24471;&#20998;&#21487;&#24369;&#21270;&#25928;&#29575;&#12290;&#21363;&#20351;&#27169;&#22411;&#24456;&#22823;&#65292;&#30693;&#36947;&#20542;&#21521;&#24471;&#20998;&#30340;&#21442;&#25968;&#32467;&#26500;&#36824;&#26159;&#20250;&#25552;&#39640;&#25928;&#29575;&#12290;&#30693;&#36947;&#20998;&#23618;&#32467;&#26500;&#21487;&#20197;&#25552;&#39640;&#25928;&#29575;&#65292;&#29305;&#21035;&#26159;&#24403;&#27599;&#20010;&#23618;&#27425;&#32452;&#20214;&#30340;&#22823;&#23567;&#36739;&#23567;&#26102;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20102;&#35299;&#20542;&#21521;&#24471;&#20998;&#21487;&#20197;&#22312;&#20272;&#35745;&#22240;&#26524;&#21442;&#25968;&#26102;&#24369;&#21270;&#25928;&#29575;&#65292;&#20294;&#21738;&#31181;&#30693;&#35782;&#26356;&#26377;&#29992;&#65311;&#20026;&#20102;&#30740;&#31350;&#36825;&#20010;&#38382;&#39064;&#65292;&#39318;&#20808;&#25105;&#20204;&#25512;&#23548;&#20102;&#22312;&#27491;&#30830;&#25351;&#23450;&#21442;&#25968;&#27169;&#22411;&#30340;&#24773;&#20917;&#19979;&#65292;&#22810;&#20540;&#27835;&#30103;&#25928;&#26524;&#30340;&#21322;&#21442;&#25968;&#25928;&#29575;&#19979;&#30028;&#12290;&#28982;&#21518;&#25105;&#20204;&#25581;&#31034;&#20102;&#21738;&#31181;&#20542;&#21521;&#24471;&#20998;&#30340;&#21442;&#25968;&#32467;&#26500;&#21363;&#20351;&#27169;&#22411;&#24456;&#22823;&#20063;&#20250;&#25552;&#39640;&#25928;&#29575;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#23558;&#25105;&#20204;&#24320;&#21457;&#30340;&#19968;&#33324;&#29702;&#35770;&#24212;&#29992;&#20110;&#20998;&#23618;&#23454;&#39564;&#35774;&#32622;&#65292;&#24182;&#21457;&#29616;&#30693;&#36947;&#23618;&#27425;&#32467;&#26500;&#21487;&#20197;&#25552;&#39640;&#25928;&#29575;&#65292;&#29305;&#21035;&#26159;&#24403;&#27599;&#20010;&#23618;&#27425;&#32452;&#20214;&#30340;&#22823;&#23567;&#36739;&#23567;&#26102;&#12290;
&lt;/p&gt;
&lt;p&gt;
Knowledge of the propensity score weakly improves efficiency when estimating causal parameters, but what kind of knowledge is more useful? To examine this, we first derive the semiparametric efficiency bound of multivalued treatment effects when the propensity score is correctly specified by a parametric model. We then reveal which parametric structure on the propensity score enhances the efficiency even when the the model is large. Finally, we apply the general theory we develop to a stratified experiment setup and find that knowing the strata improves the efficiency, especially when the size of each stratum component is small.
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#22312;&#21322;&#21442;&#25968;&#31163;&#25955;&#36873;&#25321;&#27169;&#22411;&#20013;&#24212;&#29992;&#21305;&#37197;&#35782;&#21035;&#26041;&#27861;&#26469;&#30740;&#31350;&#32465;&#23450;&#65292;&#20854;&#21487;&#20197;&#22788;&#29702;&#36873;&#25321;&#20043;&#38388;&#30340;&#24178;&#25200;&#20013;&#20855;&#26377;&#24322;&#26041;&#24046;&#24615;&#21644;&#20219;&#24847;&#30456;&#20851;&#24615;&#12290;&#35813;&#25991;&#25552;&#20986;&#20102;&#20004;&#31181;&#27169;&#22411;&#65306;&#20132;&#21449;&#21644;&#38754;&#26495;&#25968;&#25454;&#27169;&#22411;&#12290;</title><link>http://arxiv.org/abs/2306.04135</link><description>&lt;p&gt;
&#21322;&#21442;&#25968;&#31163;&#25955;&#36873;&#25321;&#27169;&#22411;&#22312;&#32465;&#23450;&#20013;&#30340;&#24212;&#29992;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Semiparametric Discrete Choice Models for Bundles. (arXiv:2306.04135v1 [econ.EM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.04135
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#22312;&#21322;&#21442;&#25968;&#31163;&#25955;&#36873;&#25321;&#27169;&#22411;&#20013;&#24212;&#29992;&#21305;&#37197;&#35782;&#21035;&#26041;&#27861;&#26469;&#30740;&#31350;&#32465;&#23450;&#65292;&#20854;&#21487;&#20197;&#22788;&#29702;&#36873;&#25321;&#20043;&#38388;&#30340;&#24178;&#25200;&#20013;&#20855;&#26377;&#24322;&#26041;&#24046;&#24615;&#21644;&#20219;&#24847;&#30456;&#20851;&#24615;&#12290;&#35813;&#25991;&#25552;&#20986;&#20102;&#20004;&#31181;&#27169;&#22411;&#65306;&#20132;&#21449;&#21644;&#38754;&#26495;&#25968;&#25454;&#27169;&#22411;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#20272;&#35745;&#21644;&#25512;&#26029;&#26041;&#27861;&#65292;&#29992;&#20110;&#36827;&#34892;&#21322;&#21442;&#25968;&#31163;&#25955;&#36873;&#25321;&#27169;&#22411;&#22312;&#20132;&#21449;&#21644;&#38754;&#26495;&#25968;&#25454;&#35774;&#32622;&#20013;&#23545;&#32465;&#23450;&#30340;&#30740;&#31350;&#12290;&#25105;&#20204;&#30340;&#21305;&#37197;&#35782;&#21035;&#26041;&#27861;&#20801;&#35768;&#22312;&#36873;&#25321;&#20043;&#38388;&#30340;&#24178;&#25200;&#20013;&#20855;&#26377;&#26576;&#20123;&#24418;&#24335;&#30340;&#24322;&#26041;&#24046;&#24615;&#21644;&#20219;&#24847;&#30456;&#20851;&#24615;&#12290;&#23545;&#20110;&#20132;&#21449;&#27169;&#22411;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26680;&#21152;&#26435;&#31561;&#32423;&#31243;&#24207;&#65292;&#24182;&#23637;&#31034;&#20102;&#38750;&#21442;&#25968;bootstrap&#22312;&#25512;&#26029;&#20013;&#30340;&#26377;&#25928;&#24615;&#12290;&#23545;&#20110;&#38754;&#26495;&#25968;&#25454;&#27169;&#22411;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#23616;&#37096;&#26368;&#22823;&#20998;&#25968;&#20272;&#35745;&#37327;&#65292;&#24182;&#34920;&#26126;&#25968;&#20540;bootstrap&#26159;&#19968;&#31181;&#26377;&#25928;&#30340;&#25512;&#26029;&#26041;&#27861;&#12290;&#33945;&#29305;&#21345;&#32599;&#23454;&#39564;&#34920;&#26126;&#65292;&#25105;&#20204;&#25552;&#20986;&#30340;&#20272;&#35745;&#21644;&#25512;&#26029;&#31243;&#24207;&#22312;&#26377;&#38480;&#26679;&#26412;&#20013;&#34920;&#29616;&#33391;&#22909;&#12290;
&lt;/p&gt;
&lt;p&gt;
We propose methods of estimation and inference for use in semiparametric discrete choice models for bundles in both cross-sectional and panel data settings. Our matching-based identification approach permits certain forms of heteroskedasticity and arbitrary correlation in the disturbances across choices. For the cross-sectional model, we propose a kernel-weighted rank procedure and show the validity of the nonparametric bootstrap for the inference. For the panel data model, we propose localized maximum score estimators and show that the numerical bootstrap is a valid inference method. Monte Carlo experiments demonstrate that our proposed estimation and inference procedures perform adequately in finite samples.
&lt;/p&gt;</description></item><item><title>&#35813;&#25991;&#26500;&#24314;&#20102;&#21160;&#24577;&#27169;&#22411;&#65292;&#24212;&#29992;&#21487;&#25345;&#32493;&#24615;&#26631;&#20934;&#38544;&#21547;&#22806;&#37096;&#24615;&#23450;&#20215;&#65292;&#24471;&#20986;&#26368;&#20248;&#37319;&#20240;&#36827;&#24230;&#65292;&#24182;&#25581;&#31034;&#22806;&#37096;&#24615;&#23450;&#20215;&#23545;&#37319;&#20240;&#36827;&#24230;&#30340;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2306.04065</link><description>&lt;p&gt;
&#36164;&#28304;&#37319;&#38598;&#30340;&#21487;&#25345;&#32493;&#24615;&#26631;&#20934;&#38544;&#21547;&#22806;&#37096;&#24615;&#23450;&#20215;
&lt;/p&gt;
&lt;p&gt;
Sustainability criterion implied externality pricing for resource extraction. (arXiv:2306.04065v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.04065
&lt;/p&gt;
&lt;p&gt;
&#35813;&#25991;&#26500;&#24314;&#20102;&#21160;&#24577;&#27169;&#22411;&#65292;&#24212;&#29992;&#21487;&#25345;&#32493;&#24615;&#26631;&#20934;&#38544;&#21547;&#22806;&#37096;&#24615;&#23450;&#20215;&#65292;&#24471;&#20986;&#26368;&#20248;&#37319;&#20240;&#36827;&#24230;&#65292;&#24182;&#25581;&#31034;&#22806;&#37096;&#24615;&#23450;&#20215;&#23545;&#37319;&#20240;&#36827;&#24230;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35813;&#25991;&#26500;&#24314;&#20102;&#19968;&#20010;&#21160;&#24577;&#27169;&#22411;&#65292;&#23558;&#22806;&#37096;&#24615;&#24341;&#20837;&#21040;Hartwick&#21644;Van Long&#65288;2020&#65289;&#30340;&#20869;&#29983;&#36148;&#29616;&#35774;&#32622;&#20013;&#65292;&#24182;&#35810;&#38382;&#36825;&#23545;&#20855;&#26377;&#24658;&#23450;&#28040;&#36153;&#30340;&#33258;&#28982;&#36164;&#28304;&#26368;&#20248;&#37319;&#21462;&#30340;&#24433;&#21709;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;Hotelling&#21644;Hartwick&#35268;&#21017;&#30340;&#20462;&#25913;&#24418;&#24335;&#20173;&#28982;&#36866;&#29992;&#65292;&#20854;&#20013;&#20215;&#26684;&#30340;&#22806;&#37096;&#24615;&#37096;&#20998;&#26159;&#30636;&#26102;&#29992;&#25143;&#25104;&#26412;&#21644;&#20132;&#21449;&#20215;&#26684;&#24377;&#24615;&#30340;&#29305;&#23450;&#20989;&#25968;&#12290;&#23427;&#35777;&#26126;&#20102;&#21097;&#20313;&#33258;&#28982;&#20648;&#22791;&#30340;&#22806;&#37096;&#24615;&#35843;&#25972;&#36793;&#38469;&#29992;&#25143;&#25104;&#26412;&#31561;&#20110;&#25237;&#36164;&#20110;&#20154;&#36896;&#20877;&#29983;&#36164;&#26412;&#30340;&#24050;&#24320;&#37319;&#36164;&#28304;&#30340;&#36793;&#38469;&#29992;&#25143;&#25104;&#26412;&#12290;&#36825;&#23548;&#33268;&#20102;&#20855;&#26377;&#30452;&#35266;&#32463;&#27982;&#35299;&#37322;&#30340;&#31163;&#25955;&#24418;&#24335;&#65292;&#35299;&#37322;&#20102;&#22806;&#37096;&#24615;&#23450;&#20215;&#23545;&#26368;&#20248;&#37319;&#20240;&#36827;&#24230;&#30340;&#36880;&#27493;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
A dynamic model is constructed that generalises the Hartwick and Van Long (2020) endogenous discounting setup by introducing externalities and asks what implications this has for optimal natural resource extraction with constant consumption. It is shown that a modified form of the Hotelling and Hartwick rule holds in which the externality component of price is a specific function of the instantaneous user costs and cross price elasticities. It is demonstrated that the externality adjusted marginal user cost of remaining natural reserves is equal to the marginal user cost of extracted resources invested in human-made reproducible capital. This lends itself to a discrete form with a readily intuitive economic interpretation that illuminates the stepwise impact of externality pricing on optimal extraction schedules.
&lt;/p&gt;</description></item><item><title>&#30740;&#31350;&#34920;&#26126;&#65292;&#28082;&#24577;&#27665;&#20027;&#21487;&#25552;&#39640;&#31119;&#21033;&#21644;&#20449;&#24687;&#32858;&#21512;&#25928;&#26524;&#65292;&#26356;&#26131;&#20110;&#36873;&#27665;&#21327;&#35843;&#26377;&#25928;&#24179;&#34913;&#28857;&#65292;&#36866;&#29992;&#20110;&#24322;&#36136;&#20449;&#24687;&#30340;&#24773;&#20917;&#12290;</title><link>http://arxiv.org/abs/2306.03960</link><description>&lt;p&gt;
&#24102;&#26377;&#25237;&#31080;&#25480;&#26435;&#30340;&#20449;&#24687;&#27719;&#24635;
&lt;/p&gt;
&lt;p&gt;
Information aggregation with delegation of votes. (arXiv:2306.03960v1 [econ.TH])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.03960
&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#34920;&#26126;&#65292;&#28082;&#24577;&#27665;&#20027;&#21487;&#25552;&#39640;&#31119;&#21033;&#21644;&#20449;&#24687;&#32858;&#21512;&#25928;&#26524;&#65292;&#26356;&#26131;&#20110;&#36873;&#27665;&#21327;&#35843;&#26377;&#25928;&#24179;&#34913;&#28857;&#65292;&#36866;&#29992;&#20110;&#24322;&#36136;&#20449;&#24687;&#30340;&#24773;&#20917;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#28082;&#24577;&#27665;&#20027;&#26159;&#19968;&#31181;&#32467;&#21512;&#20102;&#30452;&#25509;&#27665;&#20027;&#21644;&#20195;&#35758;&#21046;&#30340;&#21046;&#24230;&#65292;&#20801;&#35768;&#36873;&#27665;&#30452;&#25509;&#25237;&#31080;&#25110;&#23558;&#20854;&#36873;&#31080;&#22996;&#25176;&#32473;&#20182;&#20154;&#12290;&#26412;&#25991;&#30740;&#31350;&#20102;&#28082;&#24577;&#27665;&#20027;&#22312;&#24322;&#36136;&#20449;&#24687;&#30340;&#24773;&#20917;&#19979;&#30340;&#20449;&#24687;&#32858;&#21512;&#29305;&#24615;&#65292;&#21363;&#24076;&#26395;&#36873;&#20030;&#32467;&#26524;&#19982;&#19990;&#30028;&#30495;&#23454;&#29366;&#24577;&#30456;&#21305;&#37197;&#30340;&#23547;&#27714;&#30495;&#30456;&#30340;&#36873;&#27665;&#21644;&#20826;&#27966;&#36873;&#27665;&#12290;&#25105;&#20204;&#35777;&#26126;&#28082;&#24577;&#27665;&#20027;&#21487;&#25552;&#39640;&#31119;&#21033;&#21644;&#20449;&#24687;&#32858;&#21512;&#25928;&#26524;&#65292;&#24182;&#24471;&#21040;&#20102;&#24179;&#34913;&#28857;&#65292;&#24403;&#36873;&#27665;&#30340;&#20559;&#22909;&#21644;&#20449;&#24687;&#31934;&#24230;&#26159;&#20844;&#24320;&#25110;&#31169;&#20154;&#24050;&#30693;&#30340;&#26102;&#20505;&#12290;&#28082;&#24577;&#27665;&#20027;&#36824;&#23384;&#22312;&#27604;&#20854;&#20182;&#20004;&#31181;&#21046;&#24230;&#26356;&#24046;&#30340;&#24179;&#34913;&#28857;&#12290;&#25105;&#20204;&#35752;&#35770;&#20102;&#26377;&#25928;&#21644;&#26080;&#25928;&#24179;&#34913;&#28857;&#30340;&#29305;&#28857;&#65292;&#24182;&#25552;&#20379;&#20102;&#36873;&#27665;&#26356;&#23481;&#26131;&#22312;&#28082;&#24577;&#27665;&#20027;&#20013;&#21327;&#35843;&#26377;&#25928;&#24179;&#34913;&#28857;&#30340;&#26465;&#20214;&#12290;
&lt;/p&gt;
&lt;p&gt;
Liquid democracy is a system that combines aspects of direct democracy and representative democracy by allowing voters to either vote directly themselves, or delegate their votes to others. In this paper we study the information aggregation properties of liquid democracy in a setting with heterogeneously informed truth-seeking voters -- who want the election outcome to match an underlying state of the world -- and partisan voters. We establish that liquid democracy admits equilibria which improve welfare and information aggregation over direct and representative democracy when voters' preferences and information precisions are publicly or privately known. Liquid democracy also admits equilibria which do worse than the other two systems. We discuss features of efficient and inefficient equilibria and provide conditions under which voters can more easily coordinate on the efficient equilibria in liquid democracy than the other two systems.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#26500;&#24314;&#20102;&#20013;&#22269;40&#20010;&#20027;&#35201;&#22478;&#24066;&#27004;&#23431;&#24314;&#31569;&#38754;&#31215;&#25968;&#25454;&#38598;&#24182;&#21033;&#29992;&#22810;&#20219;&#21153;&#23545;&#35937;&#20998;&#21106;&#22120;&#26041;&#27861;&#23398;&#20064;&#20102;&#24314;&#31569;&#29289;&#21344;&#22320;&#38754;&#31215;&#21644;&#39640;&#24230;&#65292;&#20026;&#22478;&#24066;&#35268;&#21010;&#25552;&#20379;&#25968;&#25454;&#25903;&#25345;&#12290;</title><link>http://arxiv.org/abs/2303.02230</link><description>&lt;p&gt;
&#20013;&#22269;&#27004;&#23431;&#24314;&#31569;&#38754;&#31215;&#25968;&#25454;&#38598;&#19982;&#23398;&#20064;&#27969;&#31243;&#30340;&#26500;&#24314;
&lt;/p&gt;
&lt;p&gt;
Building Floorspace in China: A Dataset and Learning Pipeline. (arXiv:2303.02230v2 [cs.CV] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.02230
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#26500;&#24314;&#20102;&#20013;&#22269;40&#20010;&#20027;&#35201;&#22478;&#24066;&#27004;&#23431;&#24314;&#31569;&#38754;&#31215;&#25968;&#25454;&#38598;&#24182;&#21033;&#29992;&#22810;&#20219;&#21153;&#23545;&#35937;&#20998;&#21106;&#22120;&#26041;&#27861;&#23398;&#20064;&#20102;&#24314;&#31569;&#29289;&#21344;&#22320;&#38754;&#31215;&#21644;&#39640;&#24230;&#65292;&#20026;&#22478;&#24066;&#35268;&#21010;&#25552;&#20379;&#25968;&#25454;&#25903;&#25345;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20379;&#20102;&#20013;&#22269;40&#20010;&#20027;&#35201;&#22478;&#24066;&#27004;&#23431;&#24314;&#31569;&#38754;&#31215;&#65288;&#24314;&#31569;&#29289;&#21344;&#22320;&#38754;&#31215;&#21644;&#39640;&#24230;&#65289;&#27979;&#37327;&#30340;&#31532;&#19968;&#20010;&#37324;&#31243;&#30865;&#12290;&#25105;&#20204;&#21033;&#29992;&#22810;&#20219;&#21153;&#23545;&#35937;&#20998;&#21106;&#22120;&#26041;&#27861;&#22312;&#21516;&#19968;&#26694;&#26550;&#20013;&#23398;&#20064;&#24314;&#31569;&#29289;&#21344;&#22320;&#38754;&#31215;&#21644;&#39640;&#24230;&#65292;&#21033;&#29992;Sentinel-1&#21644;-2&#21355;&#26143;&#22270;&#20687;&#20316;&#20026;&#20027;&#35201;&#25968;&#25454;&#28304;&#12290;&#26412;&#25991;&#25552;&#20379;&#20102;&#35814;&#32454;&#30340;&#25968;&#25454;&#38598;&#26500;&#24314;&#21644;&#23398;&#20064;&#27969;&#31243;&#35828;&#26126;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper provides a first milestone in measuring the floorspace of buildings (that is, building footprint and height) for 40 major Chinese cities. The intent is to maximize city coverage and, eventually provide longitudinal data. Doing so requires building on imagery that is of a medium-fine-grained granularity, as larger cross sections of cities and longer time series for them are only available in such format. We use a multi-task object segmenter approach to learn the building footprint and height in the same framework in parallel: (1) we determine the surface area is covered by any buildings (the square footage of occupied land); (2) we determine floorspace from multi-image representations of buildings from various angles to determine the height of buildings. We use Sentinel-1 and -2 satellite images as our main data source. The benefits of these data are their large cross-sectional and longitudinal scope plus their unrestricted accessibility. We provide a detailed description of 
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22312;&#22823;&#35268;&#27169;&#31283;&#23450;&#21305;&#37197;&#20013;&#33719;&#24471;&#23454;&#38469;&#21305;&#37197;&#27010;&#29575;&#30340;&#38598;&#20013;&#19981;&#31561;&#24335;&#12290;&#36825;&#23558;&#25552;&#20379;&#22823;&#25968;&#37327;&#32423;&#23450;&#24459;&#21644;&#20854;&#20182;&#32479;&#35745;&#37327;&#65292;&#22914;&#29992;&#20110;&#22823;&#21305;&#37197;&#24066;&#22330;&#30340;&#23454;&#35777;&#20998;&#26512;&#30340;&#32479;&#35745;&#37327;&#12290;</title><link>http://arxiv.org/abs/2101.00399</link><description>&lt;p&gt;
&#22823;&#35268;&#27169;&#31283;&#23450;&#21305;&#37197;&#20013;&#22823;&#25968;&#37327;&#32423;&#23450;&#24459;
&lt;/p&gt;
&lt;p&gt;
The Law of Large Numbers for Large Stable Matchings. (arXiv:2101.00399v6 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2101.00399
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22312;&#22823;&#35268;&#27169;&#31283;&#23450;&#21305;&#37197;&#20013;&#33719;&#24471;&#23454;&#38469;&#21305;&#37197;&#27010;&#29575;&#30340;&#38598;&#20013;&#19981;&#31561;&#24335;&#12290;&#36825;&#23558;&#25552;&#20379;&#22823;&#25968;&#37327;&#32423;&#23450;&#24459;&#21644;&#20854;&#20182;&#32479;&#35745;&#37327;&#65292;&#22914;&#29992;&#20110;&#22823;&#21305;&#37197;&#24066;&#22330;&#30340;&#23454;&#35777;&#20998;&#26512;&#30340;&#32479;&#35745;&#37327;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#22823;&#35268;&#27169;&#21452;&#36793;&#21305;&#37197;&#30340;&#23454;&#35777;&#30740;&#31350;&#20013;&#65292;&#22914;&#22823;&#23398;&#20837;&#23398;&#20013;&#30340;&#38382;&#39064;&#65292;&#30740;&#31350;&#32773;&#36890;&#24120;&#22312;&#20551;&#35774;&#20182;&#20204;&#35266;&#23519;&#21040;&#19968;&#20010;&#22823;&#21305;&#37197;&#24066;&#22330;&#30340;&#38543;&#26426;&#26679;&#26412;&#30340;&#24773;&#20917;&#19979;&#36827;&#34892;&#32479;&#35745;&#25512;&#26029;&#12290;&#26412;&#25991;&#32771;&#34385;&#30740;&#31350;&#32773;&#35266;&#23519;&#21040;&#31283;&#23450;&#21305;&#37197;&#30340;&#20840;&#37096;&#25110;&#37096;&#20998;&#32467;&#26524;&#30340;&#24773;&#20917;&#12290;&#22312;&#20551;&#35774;&#23398;&#26657;&#20559;&#22909;&#24378;&#30456;&#20851;&#19988;&#20801;&#35768;&#23398;&#29983;&#20559;&#22909;&#23436;&#20840;&#24322;&#36136;&#30340;&#24773;&#20917;&#19979;&#65292;&#25105;&#20204;&#24314;&#31435;&#20102;&#23454;&#38469;&#21305;&#37197;&#27010;&#29575;&#30340;&#38598;&#20013;&#19981;&#31561;&#24335;&#12290;&#25105;&#20204;&#30340;&#38598;&#20013;&#19981;&#31561;&#24335;&#20026;&#24120;&#29992;&#30340;&#32479;&#35745;&#37327;&#22914;&#23454;&#35777;&#20998;&#26512;&#20013;&#22823;&#21305;&#37197;&#24066;&#22330;&#20013;&#30340;&#23454;&#38469;&#21305;&#37197;&#27010;&#29575;&#21644;&#20854;&#20182;&#32479;&#35745;&#37327;&#25552;&#20379;&#20102;&#22823;&#25968;&#37327;&#32423;&#23450;&#24459;&#12290;&#20026;&#20102;&#23637;&#31034;&#25105;&#20204;&#30340;&#38598;&#20013;&#19981;&#31561;&#24335;&#30340;&#23454;&#29992;&#24615;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#26465;&#20214;&#21305;&#37197;&#27010;&#29575;&#30340;&#20272;&#35745;&#22120;&#21450;&#27491;&#21521;&#37197;&#23545;&#30340;&#27979;&#37327;&#32467;&#26524;&#30340;&#19968;&#33268;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
In many empirical studies of a large two-sided matching market (such as in a college admissions problem), the researcher performs statistical inference under the assumption that they observe a random sample from a large matching market. In this paper, we consider a setting in which the researcher observes either all or a nontrivial fraction of outcomes from a stable matching. We establish a concentration inequality for empirical matching probabilities assuming strong correlation among the colleges' preferences while allowing students' preferences to be fully heterogeneous. Our concentration inequality yields laws of large numbers for the empirical matching probabilities and other statistics commonly used in empirical analyses of a large matching market. To illustrate the usefulness of our concentration inequality, we prove consistency for estimators of conditional matching probabilities and measures of positive assortative matching.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20004;&#31181;&#26368;&#23567;&#21270;&#20984;&#30446;&#26631;&#20989;&#25968;&#30340;&#26032;&#20272;&#35745;&#26041;&#27861;&#65292;&#20854;&#20013;&#26680;&#33539;&#25968;&#32602;&#39033;&#26377;&#21161;&#20110;&#35299;&#20915;&#20302;&#31209;&#22238;&#24402;&#22120;&#19979;&#30340;&#20132;&#20114;&#22266;&#23450;&#25928;&#24212;&#27169;&#22411;&#30340;&#28508;&#22312;&#35782;&#21035;&#38382;&#39064;&#65292;&#24182;&#19988;&#20855;&#26377;&#24456;&#37325;&#35201;&#30340;&#35745;&#31639;&#20248;&#21183;&#12290;</title><link>http://arxiv.org/abs/1810.10987</link><description>&lt;p&gt;
&#38754;&#26495;&#22238;&#24402;&#27169;&#22411;&#30340;&#26680;&#33539;&#25968;&#35268;&#21017;&#21270;&#20272;&#35745;
&lt;/p&gt;
&lt;p&gt;
Nuclear Norm Regularized Estimation of Panel Regression Models. (arXiv:1810.10987v3 [econ.EM] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/1810.10987
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20004;&#31181;&#26368;&#23567;&#21270;&#20984;&#30446;&#26631;&#20989;&#25968;&#30340;&#26032;&#20272;&#35745;&#26041;&#27861;&#65292;&#20854;&#20013;&#26680;&#33539;&#25968;&#32602;&#39033;&#26377;&#21161;&#20110;&#35299;&#20915;&#20302;&#31209;&#22238;&#24402;&#22120;&#19979;&#30340;&#20132;&#20114;&#22266;&#23450;&#25928;&#24212;&#27169;&#22411;&#30340;&#28508;&#22312;&#35782;&#21035;&#38382;&#39064;&#65292;&#24182;&#19988;&#20855;&#26377;&#24456;&#37325;&#35201;&#30340;&#35745;&#31639;&#20248;&#21183;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20855;&#26377;&#20132;&#20114;&#22266;&#23450;&#25928;&#24212;&#30340;&#38754;&#26495;&#22238;&#24402;&#27169;&#22411;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#20004;&#31181;&#22522;&#20110;&#26368;&#23567;&#21270;&#20984;&#30446;&#26631;&#20989;&#25968;&#30340;&#26032;&#20272;&#35745;&#26041;&#27861;&#12290;&#31532;&#19968;&#31181;&#26041;&#27861;&#26368;&#23567;&#21270;&#27531;&#24046;&#24179;&#26041;&#21644;&#65292;&#24102;&#26377;&#26680;&#65288;&#36857;&#65289;&#33539;&#25968;&#35268;&#21017;&#21270;&#12290;&#31532;&#20108;&#31181;&#26041;&#27861;&#26368;&#23567;&#21270;&#27531;&#24046;&#30340;&#26680;&#33539;&#25968;&#12290;&#25105;&#20204;&#24314;&#31435;&#20102;&#20004;&#20010;&#20272;&#35745;&#22120;&#30340;&#19968;&#33268;&#24615;&#12290;&#36825;&#20123;&#20272;&#35745;&#22120;&#19982;&#29616;&#26377;&#30340;&#26368;&#23567;&#20108;&#20056;&#65288;LS&#65289;&#20272;&#35745;&#22120;&#30456;&#27604;&#20855;&#26377;&#38750;&#24120;&#37325;&#35201;&#30340;&#35745;&#31639;&#20248;&#21183;&#65292;&#22240;&#20026;&#23427;&#20204;&#34987;&#23450;&#20041;&#20026;&#20984;&#30446;&#26631;&#20989;&#25968;&#30340;&#26368;&#23567;&#21270;&#22120;&#12290;&#27492;&#22806;&#65292;&#26680;&#33539;&#25968;&#32602;&#39033;&#26377;&#21161;&#20110;&#35299;&#20915;&#20132;&#20114;&#22266;&#23450;&#25928;&#24212;&#27169;&#22411;&#30340;&#28508;&#22312;&#35782;&#21035;&#38382;&#39064;&#65292;&#23588;&#20854;&#26159;&#24403;&#22238;&#24402;&#22120;&#26159;&#20302;&#31209;&#30340;&#19988;&#22240;&#32032;&#25968;&#37327;&#26410;&#30693;&#26102;&#12290;&#25105;&#20204;&#36824;&#23637;&#31034;&#20102;&#22914;&#20309;&#36890;&#36807;&#20351;&#29992;&#25105;&#20204;&#30340;&#26680;&#33539;&#25968;&#35268;&#21017;&#21270;&#20272;&#35745;&#22120;&#26500;&#36896;&#28176;&#36817;&#31561;&#25928;&#20110;Bai&#65288;2009&#24180;&#65289;&#21644;Moon&#21644;Weidner&#65288;2017&#24180;&#65289;&#26368;&#23567;&#20108;&#20056;&#65288;LS&#65289;&#20272;&#35745;&#22120;&#30340;&#20272;&#35745;&#22120;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this paper we investigate panel regression models with interactive fixed effects. We propose two new estimation methods that are based on minimizing convex objective functions. The first method minimizes the sum of squared residuals with a nuclear (trace) norm regularization. The second method minimizes the nuclear norm of the residuals. We establish the consistency of the two resulting estimators. Those estimators have a very important computational advantage compared to the existing least squares (LS) estimator, in that they are defined as minimizers of a convex objective function. In addition, the nuclear norm penalization helps to resolve a potential identification problem for interactive fixed effect models, in particular when the regressors are low-rank and the number of the factors is unknown. We also show how to construct estimators that are asymptotically equivalent to the least squares (LS) estimator in Bai (2009) and Moon and Weidner (2017) by using our nuclear norm regul
&lt;/p&gt;</description></item></channel></rss>