<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#20010;CAV&#20934;&#22791;&#26694;&#26550;&#65288;CRF&#65289;&#65292;&#20197;&#25903;&#25345;&#36947;&#36335;&#31649;&#29702;&#26426;&#26500;&#35780;&#20272;&#20854;&#20934;&#22791;&#24773;&#20917;&#65292;&#23450;&#20041;C-ITS&#26381;&#21153;&#30340;&#35201;&#27714;&#65292;&#24182;&#30830;&#23450;&#26410;&#26469;&#30340;&#21457;&#23637;&#36335;&#24452;&#12290;&#35813;&#26694;&#26550;&#21487;&#20197;&#24110;&#21161;&#25552;&#20379;&#23433;&#20840;&#39640;&#25928;&#30340;&#20132;&#36890;&#65292;&#20943;&#36731;&#36947;&#36335;&#36710;&#36742;&#23545;&#29615;&#22659;&#30340;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2311.01268</link><description>&lt;p&gt;
&#20026;&#25903;&#25345;&#36947;&#36335;&#31649;&#29702;&#26426;&#26500;&#30340;C-ITS&#26381;&#21153;&#32780;&#35774;&#35745;&#30340;&#36830;&#25509;&#21644;&#33258;&#21160;&#21270;&#36710;&#36742;&#20934;&#22791;&#26694;&#26550;
&lt;/p&gt;
&lt;p&gt;
A connected and automated vehicle readiness framework to support road authorities for C-ITS services. (arXiv:2311.01268v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2311.01268
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#20010;CAV&#20934;&#22791;&#26694;&#26550;&#65288;CRF&#65289;&#65292;&#20197;&#25903;&#25345;&#36947;&#36335;&#31649;&#29702;&#26426;&#26500;&#35780;&#20272;&#20854;&#20934;&#22791;&#24773;&#20917;&#65292;&#23450;&#20041;C-ITS&#26381;&#21153;&#30340;&#35201;&#27714;&#65292;&#24182;&#30830;&#23450;&#26410;&#26469;&#30340;&#21457;&#23637;&#36335;&#24452;&#12290;&#35813;&#26694;&#26550;&#21487;&#20197;&#24110;&#21161;&#25552;&#20379;&#23433;&#20840;&#39640;&#25928;&#30340;&#20132;&#36890;&#65292;&#20943;&#36731;&#36947;&#36335;&#36710;&#36742;&#23545;&#29615;&#22659;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36830;&#25509;&#21644;&#33258;&#21160;&#21270;&#36710;&#36742;&#65288;CAVs&#65289;&#23545;&#20132;&#36890;&#31995;&#32479;&#26377;&#30528;&#28145;&#36828;&#30340;&#24433;&#21709;&#12290;&#28982;&#32780;&#65292;&#22823;&#37096;&#20998;&#30340;&#33258;&#21160;&#21270;&#21644;&#36830;&#25509;&#24615;&#37117;&#38656;&#35201;&#36947;&#36335;&#22522;&#30784;&#35774;&#26045;&#30340;&#25903;&#25345;&#12290;&#39069;&#22806;&#30340;&#25903;&#25345;&#65292;&#22914;&#21512;&#20316;&#26234;&#33021;&#20132;&#36890;&#31995;&#32479;&#65288;C-ITS&#65289;&#26381;&#21153;&#65292;&#21487;&#20197;&#20419;&#36827;&#23433;&#20840;&#39640;&#25928;&#30340;&#20132;&#36890;&#65292;&#20943;&#36731;&#36947;&#36335;&#36710;&#36742;&#23545;&#29615;&#22659;&#30340;&#24433;&#21709;&#12290;&#28982;&#32780;&#65292;&#30001;&#20110;&#25216;&#26415;&#30340;&#24555;&#36895;&#21457;&#23637;&#65292;C-ITS&#26381;&#21153;&#30340;&#37096;&#32626;&#35201;&#27714;&#24182;&#19981;&#24635;&#26159;&#28165;&#26224;&#30340;&#12290;&#27492;&#22806;&#65292;&#22522;&#30784;&#35774;&#26045;&#25237;&#36164;&#30340;&#25104;&#26412;&#21644;&#25910;&#30410;&#20063;&#23384;&#22312;&#24040;&#22823;&#30340;&#19981;&#30830;&#23450;&#24615;&#12290;&#26412;&#30740;&#31350;&#37319;&#29992;&#32467;&#26500;&#21270;&#26041;&#27861;&#26469;&#38416;&#36848;&#36825;&#20123;&#35201;&#27714;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#20010;CAV&#20934;&#22791;&#26694;&#26550;&#65288;CRF&#65289;&#30340;&#24314;&#35758;&#12290;&#35813;CRF&#30340;&#20027;&#35201;&#30446;&#30340;&#26159;&#35753;&#36947;&#36335;&#31649;&#29702;&#26426;&#26500;&#35780;&#20272;&#20854;&#29289;&#29702;&#21644;&#25968;&#23383;&#22522;&#30784;&#35774;&#26045;&#30340;&#20934;&#22791;&#24773;&#20917;&#65292;&#23450;&#20041;C-ITS&#26381;&#21153;&#30340;&#35201;&#27714;&#65292;&#24182;&#30830;&#23450;&#26410;&#26469;&#30340;&#21457;&#23637;&#36335;&#24452;&#65292;&#20197;&#36798;&#21040;&#26356;&#39640;&#27700;&#24179;&#30340;&#20934;&#22791;&#65292;&#20197;&#25903;&#25345;&#36890;&#36807;&#21551;&#29992;C-ITS&#26381;&#21153;&#26469;&#25903;&#25345;CAVs&#12290;
&lt;/p&gt;
&lt;p&gt;
Connected and Automated Vehicles (CAVs) can have a profound influence on transport systems. However, most levels of automation and connectivity require support from the road infrastructure. Additional support such as Cooperative Intelligent Transport Systems (C-ITS) services can facilitate safe and efficient traffic, and alleviate the environmental impacts of road surface vehicles. However, due to the rapidly evolving technology, C-ITS service deployment requirements are not always clear. Furthermore, the costs and benefits of infrastructure investments are subject to tremendous uncertainty. This study articulates the requirements using a structured approach to propose a CAV-Readiness Framework (CRF). The main purpose of the CRF is allowing road authorities to assess their physical and digital infrastructure readiness, define requirements for C-ITS services, and identify future development paths to reach higher levels of readiness to support CAVs by enabling C-ITS services. The CRF is 
&lt;/p&gt;</description></item><item><title>"&#26412;&#25991;&#30740;&#31350;&#20102;&#22841;&#24515;Volterra&#27874;&#21160;&#27169;&#22411;&#20013;&#30340;&#24130;&#24459;&#34892;&#20026;&#65292;&#24182;&#25552;&#20379;&#20102;&#20998;&#26512;&#35777;&#26126;&#12290;&#27492;&#22806;&#65292;&#36824;&#35777;&#26126;&#20102;&#19968;&#20010;&#36890;&#29992;&#30340;Malliavin&#20056;&#31215;&#35268;&#21017;&#12290;"</title><link>http://arxiv.org/abs/2311.01228</link><description>&lt;p&gt;
"&#22841;&#24515;Volterra&#27874;&#21160;&#27169;&#22411;&#20013;&#30340;&#24130;&#24459;&#34892;&#20026;&#30740;&#31350;"
&lt;/p&gt;
&lt;p&gt;
Power law in Sandwiched Volterra Volatility model. (arXiv:2311.01228v1 [q-fin.MF])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2311.01228
&lt;/p&gt;
&lt;p&gt;
"&#26412;&#25991;&#30740;&#31350;&#20102;&#22841;&#24515;Volterra&#27874;&#21160;&#27169;&#22411;&#20013;&#30340;&#24130;&#24459;&#34892;&#20026;&#65292;&#24182;&#25552;&#20379;&#20102;&#20998;&#26512;&#35777;&#26126;&#12290;&#27492;&#22806;&#65292;&#36824;&#35777;&#26126;&#20102;&#19968;&#20010;&#36890;&#29992;&#30340;Malliavin&#20056;&#31215;&#35268;&#21017;&#12290;"
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
"&#26412;&#25991;&#36890;&#36807;&#20998;&#26512;&#35777;&#26126;&#65292;&#22841;&#24515;Volterra&#27874;&#21160;&#65288;SVV&#65289;&#27169;&#22411;&#33021;&#22815;&#22312;&#27491;&#30830;&#36873;&#25321;Volterra&#26680;&#30340;&#24773;&#20917;&#19979;&#65292;&#37325;&#24314;&#29616;&#36135;&#38544;&#21547;&#27874;&#21160;&#29575;&#20559;&#26012;&#30340;&#24130;&#24459;&#34892;&#20026;&#12290;&#20026;&#20102;&#24471;&#21040;&#36825;&#20010;&#32467;&#26524;&#65292;&#25105;&#20204;&#35780;&#20272;&#20102;&#27874;&#21160;&#36807;&#31243;&#30340;&#20108;&#38454;Malliavin&#21487;&#24494;&#24615;&#65292;&#24182;&#30740;&#31350;&#23548;&#33268;Malliavin&#23548;&#25968;&#29190;&#28856;&#34892;&#20026;&#30340;&#26465;&#20214;&#12290;&#20316;&#20026;&#19968;&#20010;&#34917;&#20805;&#32467;&#26524;&#65292;&#25105;&#20204;&#36824;&#35777;&#26126;&#20102;&#19968;&#20010;&#36890;&#29992;&#30340;Malliavin&#20056;&#31215;&#35268;&#21017;&#12290;"
&lt;/p&gt;
&lt;p&gt;
In this paper, we present analytical proof demonstrating that the Sandwiched Volterra Volatility (SVV) model is able to reproduce the power-law behavior of the at-the-money implied volatility skew, provided the correct choice of the Volterra kernel. To obtain this result, we assess the second-order Malliavin differentiability of the volatility process and investigate the conditions that lead to explosive behavior in the Malliavin derivative. As a supplementary result, we also prove a general Malliavin product rule.
&lt;/p&gt;</description></item><item><title>&#30740;&#31350;&#25506;&#35752;&#20102;&#37329;&#34701;&#21253;&#23481;&#24615;&#23545;&#20013;&#22269;&#23478;&#24237;&#25237;&#36164;&#32452;&#21512;&#36873;&#25321;&#21644;&#25237;&#36164;&#25928;&#29575;&#30340;&#24433;&#21709;&#65292;&#32467;&#26524;&#34920;&#26126;&#26356;&#39640;&#30340;&#37329;&#34701;&#21253;&#23481;&#24615;&#40723;&#21169;&#23478;&#24237;&#25237;&#36164;&#20110;&#39118;&#38505;&#36164;&#20135;&#24182;&#22686;&#21152;&#25237;&#36164;&#25928;&#29575;&#12290;</title><link>http://arxiv.org/abs/2311.01206</link><description>&lt;p&gt;
&#20013;&#22269;&#23478;&#24237;&#25237;&#36164;&#32452;&#21512;&#36873;&#25321;&#22312;&#37329;&#34701;&#21253;&#23481;&#24615;&#26041;&#38754;&#30340;&#21464;&#21270;&#26159;&#22914;&#20309;&#30340;&#65311;
&lt;/p&gt;
&lt;p&gt;
How Does China's Household Portfolio Selection Vary with Financial Inclusion?. (arXiv:2311.01206v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2311.01206
&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#25506;&#35752;&#20102;&#37329;&#34701;&#21253;&#23481;&#24615;&#23545;&#20013;&#22269;&#23478;&#24237;&#25237;&#36164;&#32452;&#21512;&#36873;&#25321;&#21644;&#25237;&#36164;&#25928;&#29575;&#30340;&#24433;&#21709;&#65292;&#32467;&#26524;&#34920;&#26126;&#26356;&#39640;&#30340;&#37329;&#34701;&#21253;&#23481;&#24615;&#40723;&#21169;&#23478;&#24237;&#25237;&#36164;&#20110;&#39118;&#38505;&#36164;&#20135;&#24182;&#22686;&#21152;&#25237;&#36164;&#25928;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25237;&#36164;&#32452;&#21512;&#30340;&#19981;&#20805;&#20998;&#22810;&#26679;&#21270;&#26159;&#23478;&#24237;&#29983;&#21629;&#21608;&#26399;&#20013;&#26368;&#26114;&#36149;&#30340;&#25439;&#22833;&#20043;&#19968;&#12290;&#25105;&#20204;&#20351;&#29992;2015&#24180;&#12289;2017&#24180;&#21644;2019&#24180;&#30340;&#20013;&#22269;&#23478;&#24237;&#35843;&#30740;&#25968;&#25454;&#65292;&#25552;&#20379;&#20102;&#20851;&#20110;&#37329;&#34701;&#21253;&#23481;&#26381;&#21153;&#23545;&#23478;&#24237;&#25237;&#36164;&#32452;&#21512;&#36873;&#25321;&#21644;&#25237;&#36164;&#25928;&#29575;&#30340;&#24433;&#21709;&#30340;&#26032;&#35777;&#25454;&#12290;&#25105;&#20204;&#20551;&#35774;&#26356;&#39640;&#30340;&#37329;&#34701;&#21253;&#23481;&#28183;&#36879;&#29575;&#40723;&#21169;&#23478;&#24237;&#21442;&#19982;&#37329;&#34701;&#24066;&#22330;&#65292;&#20174;&#32780;&#23454;&#29616;&#26356;&#22909;&#30340;&#25237;&#36164;&#32452;&#21512;&#22810;&#26679;&#21270;&#21644;&#25237;&#36164;&#25928;&#29575;&#12290;&#22522;&#20934;&#27169;&#22411;&#30340;&#32467;&#26524;&#19982;&#25105;&#20204;&#25552;&#20986;&#30340;&#20551;&#35774;&#19968;&#33268;&#65292;&#21363;&#26356;&#39640;&#30340;&#37329;&#34701;&#21253;&#23481;&#24615;&#20419;&#20351;&#23478;&#24237;&#25237;&#36164;&#20110;&#39118;&#38505;&#36164;&#20135;&#24182;&#22686;&#21152;&#25237;&#36164;&#25928;&#29575;&#12290;&#25105;&#20204;&#36827;&#19968;&#27493;&#20272;&#35745;&#20102;&#19968;&#20010;&#21160;&#24577;&#21452;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#65292;&#23450;&#37327;&#30740;&#31350;&#38750;&#32447;&#24615;&#22240;&#26524;&#25928;&#24212;&#24182;&#36319;&#36394;&#36825;&#20123;&#25928;&#24212;&#38543;&#26102;&#38388;&#30340;&#21160;&#24577;&#21464;&#21270;&#12290;&#25105;&#20204;&#35266;&#23519;&#21040;&#36793;&#38469;&#25928;&#24212;&#38543;&#26102;&#38388;&#22686;&#21152;&#65292;&#24182;&#19988;&#36825;&#20123;&#25928;&#24212;&#22312;&#20302;&#36164;&#20135;&#12289;&#36739;&#20302;&#25945;&#32946;&#31243;&#24230;&#30340;&#23478;&#24237;&#20013;&#26356;&#20026;&#26126;&#26174;&#12290;
&lt;/p&gt;
&lt;p&gt;
Portfolio underdiversification is one of the most costly losses accumulated over a household's life cycle. We provide new evidence on the impact of financial inclusion services on households' portfolio choice and investment efficiency using 2015, 2017, and 2019 survey data for Chinese households. We hypothesize that higher financial inclusion penetration encourages households to participate in the financial market, leading to better portfolio diversification and investment efficiency. The results of the baseline model are consistent with our proposed hypothesis that higher accessibility to financial inclusion encourages households to invest in risky assets and increases investment efficiency. We further estimate a dynamic double machine learning model to quantitatively investigate the non-linear causal effects and track the dynamic change of those effects over time. We observe that the marginal effect increases over time, and those effects are more pronounced among low-asset, less-educ
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#19968;&#31181;&#38750;&#38646;&#21644;&#21338;&#24328;&#65292;&#29609;&#23478;&#37319;&#29992;Bermudan&#31574;&#30053;&#65292;&#24182;&#20248;&#21270;&#38750;&#32447;&#24615;&#35780;&#20272;&#20989;&#25968;&#30340;&#25910;&#30410;&#12290;&#36890;&#36807;&#36882;&#24402;&#26500;&#36896;&#65292;&#35777;&#26126;&#20102;&#35813;&#21338;&#24328;&#23384;&#22312;&#32435;&#20160;&#22343;&#34913;&#28857;&#12290;</title><link>http://arxiv.org/abs/2311.01086</link><description>&lt;p&gt;
&#38750;&#32447;&#24615;&#38750;&#38646;&#21644;&#30340;Bermudan&#31574;&#30053;Dynkin&#21338;&#24328;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Non-linear non-zero-sum Dynkin games with Bermudan strategies. (arXiv:2311.01086v1 [math.OC])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2311.01086
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#19968;&#31181;&#38750;&#38646;&#21644;&#21338;&#24328;&#65292;&#29609;&#23478;&#37319;&#29992;Bermudan&#31574;&#30053;&#65292;&#24182;&#20248;&#21270;&#38750;&#32447;&#24615;&#35780;&#20272;&#20989;&#25968;&#30340;&#25910;&#30410;&#12290;&#36890;&#36807;&#36882;&#24402;&#26500;&#36896;&#65292;&#35777;&#26126;&#20102;&#35813;&#21338;&#24328;&#23384;&#22312;&#32435;&#20160;&#22343;&#34913;&#28857;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#19968;&#31181;&#21253;&#21547;&#20004;&#20010;&#29609;&#23478;&#30340;&#38750;&#38646;&#21644;&#21338;&#24328;&#65292;&#27599;&#20010;&#29609;&#23478;&#20351;&#29992;&#25152;&#35859;&#30340;Bermudan&#31574;&#30053;&#65292;&#24182;&#20248;&#21270;&#19968;&#20010;&#36890;&#29992;&#30340;&#38750;&#32447;&#24615;&#35780;&#20272;&#20989;&#25968;&#30340;&#25910;&#30410;&#12290;&#36890;&#36807;&#20351;&#29992;&#36882;&#24402;&#26500;&#36896;&#65292;&#25105;&#20204;&#35777;&#26126;&#35813;&#21338;&#24328;&#23384;&#22312;&#32435;&#20160;&#22343;&#34913;&#28857;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this paper, we study a non-zero-sum game with two players, where each of the players plays what we call Bermudan strategies and optimizes a general non-linear assessment functional of the pay-off. By using a recursive construction, we show that the game has a Nash equilibrium point.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#37329;&#34701;&#31185;&#25216;&#24212;&#29992;&#20013;&#23547;&#25214;&#39640;&#36136;&#37327;&#30340;&#21452;&#30446;&#26631; Pareto &#26368;&#20248;&#27450;&#35784;&#39044;&#38450;&#35268;&#21017;&#38598;&#30340;&#38382;&#39064;&#12290;&#36890;&#36807;&#37319;&#29992; Pareto &#26368;&#20248;&#24615;&#27010;&#24565;&#21644;&#21551;&#21457;&#24335;&#26694;&#26550; PORS&#65292;&#25105;&#20204;&#25104;&#21151;&#25552;&#20986;&#20102;&#19968;&#32452;&#38750;&#25903;&#37197;&#30340;&#35268;&#21017;&#23376;&#38598;&#65292;&#24182;&#36890;&#36807;&#23454;&#35777;&#35780;&#20272;&#35777;&#26126;&#20102;&#20854;&#26377;&#25928;&#24615;&#12290;</title><link>http://arxiv.org/abs/2311.00964</link><description>&lt;p&gt;
&#22312;&#37329;&#34701;&#31185;&#25216;&#24212;&#29992;&#20013;&#23547;&#25214;&#21452;&#30446;&#26631; Pareto &#26368;&#20248;&#27450;&#35784;&#39044;&#38450;&#35268;&#21017;&#38598;
&lt;/p&gt;
&lt;p&gt;
On Finding Bi-objective Pareto-optimal Fraud Prevention Rule Sets for Fintech Applications. (arXiv:2311.00964v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2311.00964
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#37329;&#34701;&#31185;&#25216;&#24212;&#29992;&#20013;&#23547;&#25214;&#39640;&#36136;&#37327;&#30340;&#21452;&#30446;&#26631; Pareto &#26368;&#20248;&#27450;&#35784;&#39044;&#38450;&#35268;&#21017;&#38598;&#30340;&#38382;&#39064;&#12290;&#36890;&#36807;&#37319;&#29992; Pareto &#26368;&#20248;&#24615;&#27010;&#24565;&#21644;&#21551;&#21457;&#24335;&#26694;&#26550; PORS&#65292;&#25105;&#20204;&#25104;&#21151;&#25552;&#20986;&#20102;&#19968;&#32452;&#38750;&#25903;&#37197;&#30340;&#35268;&#21017;&#23376;&#38598;&#65292;&#24182;&#36890;&#36807;&#23454;&#35777;&#35780;&#20272;&#35777;&#26126;&#20102;&#20854;&#26377;&#25928;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#35268;&#21017;&#22312;&#37329;&#34701;&#31185;&#25216;&#26426;&#26500;&#20013;&#34987;&#24191;&#27867;&#29992;&#20110;&#36827;&#34892;&#27450;&#35784;&#39044;&#38450;&#20915;&#31574;&#65292;&#22240;&#20026;&#35268;&#21017;&#20855;&#26377;&#30452;&#35266;&#30340; if-then &#32467;&#26500;&#65292;&#26131;&#20110;&#29702;&#35299;&#12290;&#22312;&#23454;&#36341;&#20013;&#65292;&#22823;&#22411;&#37329;&#34701;&#31185;&#25216;&#26426;&#26500;&#36890;&#24120;&#37319;&#29992;&#20004;&#38454;&#27573;&#27450;&#35784;&#39044;&#38450;&#20915;&#31574;&#35268;&#21017;&#38598;&#25366;&#25496;&#26694;&#26550;&#12290;&#26412;&#25991;&#20851;&#27880;&#20110;&#20174;&#21021;&#22987;&#35268;&#21017;&#38598;&#20013;&#25214;&#21040;&#39640;&#36136;&#37327;&#30340;&#35268;&#21017;&#23376;&#38598;&#65292;&#20197;&#21452;&#30446;&#26631;&#31354;&#38388;&#65288;&#22914;&#31934;&#30830;&#29575;&#21644;&#21484;&#22238;&#29575;&#65289;&#20026;&#22522;&#30784;&#12290;&#20026;&#27492;&#65292;&#25105;&#20204;&#37319;&#29992; Pareto &#26368;&#20248;&#24615;&#27010;&#24565;&#65292;&#26088;&#22312;&#25214;&#21040;&#19968;&#32452;&#38750;&#25903;&#37197;&#30340;&#35268;&#21017;&#23376;&#38598;&#65292;&#26500;&#25104;&#19968;&#20010; Pareto &#21069;&#27839;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#22522;&#20110;&#21551;&#21457;&#24335;&#30340;&#26694;&#26550; PORS&#65292;&#24182;&#30830;&#23450;&#20102; PORS &#30340;&#26680;&#24515;&#38382;&#39064;&#26159;&#21069;&#27839;&#35299;&#20915;&#26041;&#26696;&#36873;&#25321;&#65288;SSF&#65289;&#38382;&#39064;&#12290;&#25105;&#20204;&#23545; SSF &#38382;&#39064;&#36827;&#34892;&#20102;&#31995;&#32479;&#20998;&#31867;&#65292;&#24182;&#22312;&#20844;&#24320;&#21644;&#19987;&#26377;&#25968;&#25454;&#38598;&#19978;&#36827;&#34892;&#20102;&#20840;&#38754;&#30340;&#23454;&#35777;&#35780;&#20272;&#12290;&#25105;&#20204;&#36824;&#24341;&#20837;&#20102;&#19968;&#31181;&#21517;&#20026; SpectralRules &#30340;&#26032;&#39062;&#21464;&#20307;&#30340;&#39034;&#24207;&#35206;&#30422;&#31639;&#27861;&#65292;&#20197;&#40723;&#21169;&#35268;&#21017;&#30340;&#22810;&#26679;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Rules are widely used in Fintech institutions to make fraud prevention decisions, since rules are highly interpretable thanks to their intuitive if-then structure. In practice, a two-stage framework of fraud prevention decision rule set mining is usually employed in large Fintech institutions. This paper is concerned with finding high-quality rule subsets in a bi-objective space (such as precision and recall) from an initial pool of rules. To this end, we adopt the concept of Pareto optimality and aim to find a set of non-dominated rule subsets, which constitutes a Pareto front. We propose a heuristic-based framework called PORS and we identify that the core of PORS is the problem of solution selection on the front (SSF). We provide a systematic categorization of the SSF problem and a thorough empirical evaluation of various SSF methods on both public and proprietary datasets. We also introduce a novel variant of sequential covering algorithm called SpectralRules to encourage the diver
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#26500;&#24314;&#20102;&#19968;&#20010;&#27169;&#22411;&#65292;&#24182;&#20351;&#29992;&#36339;&#36291;&#36807;&#31243;&#21644;&#26631;&#20934;&#24067;&#26391;&#36816;&#21160;&#39044;&#27979;&#20102;&#29577;&#31859;&#21644;&#22823;&#35910;&#24066;&#22330;&#20013;&#30340;VaR&#20540;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;&#22312;&#26377;&#36339;&#36291;&#21644;&#26080;&#36339;&#36291;&#24773;&#20917;&#19979;&#65292;VaR&#20540;&#23384;&#22312;&#26174;&#33879;&#24046;&#24322;&#12290;</title><link>http://arxiv.org/abs/2311.00832</link><description>&lt;p&gt;
&#20351;&#29992;&#36339;&#36291;&#36807;&#31243;&#20272;&#35745;VaR&#65306;&#22312;&#29577;&#31859;&#21644;&#22823;&#35910;&#24066;&#22330;&#20013;&#30340;&#24212;&#29992;
&lt;/p&gt;
&lt;p&gt;
Estimation of VaR with jump process: application in corn and soybean markets. (arXiv:2311.00832v1 [q-fin.MF])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2311.00832
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#26500;&#24314;&#20102;&#19968;&#20010;&#27169;&#22411;&#65292;&#24182;&#20351;&#29992;&#36339;&#36291;&#36807;&#31243;&#21644;&#26631;&#20934;&#24067;&#26391;&#36816;&#21160;&#39044;&#27979;&#20102;&#29577;&#31859;&#21644;&#22823;&#35910;&#24066;&#22330;&#20013;&#30340;VaR&#20540;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;&#22312;&#26377;&#36339;&#36291;&#21644;&#26080;&#36339;&#36291;&#24773;&#20917;&#19979;&#65292;VaR&#20540;&#23384;&#22312;&#26174;&#33879;&#24046;&#24322;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
VaR&#26159;&#19968;&#20010;&#29992;&#20110;&#35780;&#20272;&#25237;&#36164;&#25110;&#36164;&#26412;&#28508;&#22312;&#25439;&#22833;&#39118;&#38505;&#30340;&#23450;&#37327;&#25351;&#26631;&#12290;VaR&#30340;&#20272;&#35745;&#28041;&#21450;&#22312;&#29305;&#23450;&#26102;&#38388;&#27573;&#20869;&#65292;&#22312;&#27491;&#24120;&#24066;&#22330;&#26465;&#20214;&#19979;&#65292;&#20351;&#29992;&#19968;&#23450;&#30340;&#21487;&#33021;&#24615;&#23545;&#25237;&#36164;&#32452;&#21512;&#30340;&#28508;&#22312;&#25439;&#22833;&#36827;&#34892;&#37327;&#21270;&#12290;&#26412;&#25991;&#30340;&#30446;&#26631;&#26159;&#26500;&#24314;&#19968;&#20010;&#27169;&#22411;&#65292;&#24182;&#23545;&#30001;&#26631;&#20934;&#24067;&#26391;&#36816;&#21160;&#21644;&#36339;&#36291;&#36807;&#31243;&#39537;&#21160;&#30340;&#22810;&#20010;&#29616;&#37329;&#21830;&#21697;&#22836;&#23544;&#32452;&#25104;&#30340;&#22810;&#26679;&#21270;&#25237;&#36164;&#32452;&#21512;&#36827;&#34892;VaR&#20272;&#35745;&#12290;&#38543;&#21518;&#65292;&#23545;&#35813;&#25552;&#20986;&#30340;&#27169;&#22411;&#36827;&#34892;&#20102;&#20840;&#38754;&#30340;VaR&#20998;&#26512;&#20272;&#35745;&#12290;&#32467;&#26524;&#24212;&#29992;&#20110;&#20004;&#31181;&#19981;&#21516;&#30340;&#21830;&#21697; -- &#29577;&#31859;&#21644;&#22823;&#35910; -- &#22312;&#26377;&#36339;&#36291;&#21644;&#26080;&#36339;&#36291;&#24773;&#20917;&#19979;&#23545;VaR&#20540;&#36827;&#34892;&#20102;&#20840;&#38754;&#27604;&#36739;&#12290;
&lt;/p&gt;
&lt;p&gt;
Value at Risk (VaR) is a quantitative measure used to evaluate the risk linked to the potential loss of investment or capital. Estimation of the VaR entails the quantification of prospective losses in a portfolio of investments, using a certain likelihood, under normal market conditions within a specific time period. The objective of this paper is to construct a model and estimate the VaR for a diversified portfolio consisting of multiple cash commodity positions driven by standard Brownian motions and jump processes. Subsequently, a thorough analytical estimation of the VaR is conducted for the proposed model. The results are then applied to two distinct commodities -- corn and soybean -- enabling a comprehensive comparison of the VaR values in the presence and absence of jumps.
&lt;/p&gt;</description></item><item><title>&#36890;&#36807;&#24341;&#20837;&#20999;&#25442;&#21046;&#24230;&#27874;&#21160;&#27169;&#22411;&#65292;&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#26356;&#36866;&#21512;&#37327;&#23376;&#35745;&#31639;&#20248;&#21183;&#30340;&#37329;&#34701;&#39118;&#38505;&#27169;&#25311;&#26041;&#27861;&#12290;&#30740;&#31350;&#21253;&#25324;&#20351;&#29992;&#22522;&#20110;&#38376;&#30340;&#37327;&#23376;&#35745;&#31639;&#26426;&#36827;&#34892;&#20449;&#29992;&#39118;&#38505;&#21644;&#26399;&#26435;&#23450;&#20215;&#20272;&#35745;&#12290;&#36825;&#20123;&#27169;&#22411;&#23558;&#37327;&#23376;&#35745;&#31639;&#24102;&#20837;&#20102;&#23454;&#38469;&#24212;&#29992;&#39046;&#22495;&#12290;</title><link>http://arxiv.org/abs/2311.00825</link><description>&lt;p&gt;
&#37327;&#23376;&#35745;&#31639;&#31639;&#27861;&#22312;&#20999;&#25442;&#32463;&#27982;&#20013;&#30340;&#34893;&#29983;&#21697;&#23450;&#20215;&#21644;&#20449;&#29992;&#39118;&#38505;&#20013;&#30340;&#24212;&#29992;
&lt;/p&gt;
&lt;p&gt;
Quantum Computational Algorithms for Derivative Pricing and Credit Risk in a Regime Switching Economy. (arXiv:2311.00825v1 [quant-ph])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2311.00825
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#24341;&#20837;&#20999;&#25442;&#21046;&#24230;&#27874;&#21160;&#27169;&#22411;&#65292;&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#31181;&#26356;&#36866;&#21512;&#37327;&#23376;&#35745;&#31639;&#20248;&#21183;&#30340;&#37329;&#34701;&#39118;&#38505;&#27169;&#25311;&#26041;&#27861;&#12290;&#30740;&#31350;&#21253;&#25324;&#20351;&#29992;&#22522;&#20110;&#38376;&#30340;&#37327;&#23376;&#35745;&#31639;&#26426;&#36827;&#34892;&#20449;&#29992;&#39118;&#38505;&#21644;&#26399;&#26435;&#23450;&#20215;&#20272;&#35745;&#12290;&#36825;&#20123;&#27169;&#22411;&#23558;&#37327;&#23376;&#35745;&#31639;&#24102;&#20837;&#20102;&#23454;&#38469;&#24212;&#29992;&#39046;&#22495;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#30446;&#21069;&#30340;&#37327;&#23376;&#35745;&#31639;&#26426;&#36824;&#26080;&#27861;&#20026;&#37329;&#34701;&#20998;&#26512;&#24072;&#24120;&#29992;&#30340;&#23454;&#38469;&#38543;&#26426;&#25193;&#25955;&#27169;&#22411;&#25552;&#20379;&#35745;&#31639;&#20248;&#21183;&#12290;&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31867;&#26082;&#33021;&#30495;&#23454;&#27169;&#25311;&#37329;&#34701;&#24066;&#22330;&#39118;&#38505;&#21448;&#26356;&#26131;&#20110;&#28508;&#22312;&#30340;&#37327;&#23376;&#35745;&#31639;&#20248;&#21183;&#30340;&#38543;&#26426;&#36807;&#31243;&#12290;&#25105;&#20204;&#30740;&#31350;&#30340;&#27169;&#22411;&#22522;&#20110;&#30001;&#21487;&#35266;&#27979;&#29366;&#24577;&#30340;Markov&#38142;&#39537;&#21160;&#30340;&#20999;&#25442;&#21046;&#24230;&#27874;&#21160;&#27169;&#22411;&#12290;&#22522;&#26412;&#27169;&#22411;&#20855;&#26377;&#30001;Markov&#38142;&#30340;&#26377;&#38480;&#29366;&#24577;&#20915;&#23450;&#30340;&#20960;&#20309;&#24067;&#26391;&#36816;&#21160;&#30340;&#28418;&#31227;&#21644;&#27874;&#21160;&#29575;&#21442;&#25968;&#12290;&#25105;&#20204;&#30740;&#31350;&#20102;&#22312;&#22522;&#20110;&#38376;&#30340;&#37327;&#23376;&#35745;&#31639;&#26426;&#19978;&#20272;&#35745;&#20449;&#29992;&#39118;&#38505;&#21644;&#26399;&#26435;&#23450;&#20215;&#30340;&#31639;&#27861;&#12290;&#36825;&#20123;&#27169;&#22411;&#20351;&#25105;&#20204;&#26356;&#25509;&#36817;&#23454;&#38469;&#24066;&#22330;&#29615;&#22659;&#65292;&#20174;&#32780;&#23558;&#37327;&#23376;&#35745;&#31639;&#26356;&#21152;&#36148;&#36817;&#23454;&#38469;&#24212;&#29992;&#39046;&#22495;&#12290;
&lt;/p&gt;
&lt;p&gt;
Quantum computers are not yet up to the task of providing computational advantages for practical stochastic diffusion models commonly used by financial analysts. In this paper we introduce a class of stochastic processes that are both realistic in terms of mimicking financial market risks as well as more amenable to potential quantum computational advantages. The type of models we study are based on a regime switching volatility model driven by a Markov chain with observable states. The basic model features a Geometric Brownian Motion with drift and volatility parameters determined by the finite states of a Markov chain. We study algorithms to estimate credit risk and option pricing on a gate-based quantum computer. These models bring us closer to realistic market settings, and therefore quantum computing closer the realm of practical applications.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#25968;&#25454;&#39537;&#21160;&#26041;&#27861;&#65292;&#20351;&#29992;&#32593;&#32476;&#29702;&#35770;&#23545;&#24052;&#35199;&#30340;&#24037;&#20154;&#21644;&#24037;&#20316;&#36827;&#34892;&#20998;&#31867;&#65292;&#25581;&#31034;&#20102;&#26631;&#20934;&#20998;&#31867;&#26041;&#27861;&#24573;&#35270;&#30340;&#37325;&#35201;&#32500;&#24230;&#12290;&#22522;&#20110;&#27492;&#20998;&#31867;&#30340;&#22343;&#34913;&#27169;&#22411;&#26356;&#20934;&#30830;&#22320;&#39044;&#27979;&#20102;&#24037;&#36164;&#21464;&#21270;&#65292;&#24182;&#26174;&#31034;&#24403;&#20351;&#29992;&#27492;&#20998;&#31867;&#26102;&#65292;&#21171;&#21160;&#24066;&#22330;&#20914;&#20987;&#23545;&#24037;&#20154;&#25910;&#20837;&#30340;&#24433;&#21709;&#23558;&#22823;&#22823;&#22686;&#21152;&#12290;</title><link>http://arxiv.org/abs/2311.00777</link><description>&lt;p&gt;
&#20160;&#20040;&#26159;&#21171;&#21160;&#21147;&#24066;&#22330;&#65311;&#20351;&#29992;&#32593;&#32476;&#29702;&#35770;&#23545;&#24037;&#20154;&#21644;&#24037;&#20316;&#36827;&#34892;&#20998;&#31867;&#12290;
&lt;/p&gt;
&lt;p&gt;
What is a Labor Market? Classifying Workers and Jobs Using Network Theory. (arXiv:2311.00777v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2311.00777
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#25968;&#25454;&#39537;&#21160;&#26041;&#27861;&#65292;&#20351;&#29992;&#32593;&#32476;&#29702;&#35770;&#23545;&#24052;&#35199;&#30340;&#24037;&#20154;&#21644;&#24037;&#20316;&#36827;&#34892;&#20998;&#31867;&#65292;&#25581;&#31034;&#20102;&#26631;&#20934;&#20998;&#31867;&#26041;&#27861;&#24573;&#35270;&#30340;&#37325;&#35201;&#32500;&#24230;&#12290;&#22522;&#20110;&#27492;&#20998;&#31867;&#30340;&#22343;&#34913;&#27169;&#22411;&#26356;&#20934;&#30830;&#22320;&#39044;&#27979;&#20102;&#24037;&#36164;&#21464;&#21270;&#65292;&#24182;&#26174;&#31034;&#24403;&#20351;&#29992;&#27492;&#20998;&#31867;&#26102;&#65292;&#21171;&#21160;&#24066;&#22330;&#20914;&#20987;&#23545;&#24037;&#20154;&#25910;&#20837;&#30340;&#24433;&#21709;&#23558;&#22823;&#22823;&#22686;&#21152;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36890;&#36807;&#23558;&#32593;&#32476;&#29702;&#35770;&#30340;&#23454;&#35777;&#24037;&#20855;&#24212;&#29992;&#20110;&#24052;&#35199;&#22823;&#35268;&#27169;&#31649;&#29702;&#25968;&#25454;&#65292;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#25968;&#25454;&#39537;&#21160;&#26041;&#27861;&#26469;&#25551;&#36848;&#28508;&#22312;&#30340;&#24037;&#20154;&#25216;&#33021;&#21644;&#24037;&#20316;&#20219;&#21153;&#30340;&#24322;&#36136;&#24615;&#12290;&#25105;&#20204;&#20351;&#29992;&#19968;&#31181;&#26631;&#20934;&#30340;&#22343;&#34913;&#27169;&#22411;&#23558;&#36825;&#31181;&#24037;&#20855;&#24494;&#35266;&#21270;&#65292;&#35813;&#27169;&#22411;&#26681;&#25454;&#27604;&#36739;&#20248;&#21183;&#20351;&#24037;&#20154;&#19982;&#24037;&#20316;&#21305;&#37197;&#12290;&#25105;&#20204;&#30340;&#20998;&#31867;&#35782;&#21035;&#20986;&#26631;&#20934;&#22522;&#20110;&#32844;&#19994;&#21644;&#34892;&#19994;&#30340;&#20998;&#31867;&#24573;&#35270;&#30340;&#24037;&#20154;&#21644;&#24037;&#20316;&#24322;&#36136;&#24615;&#30340;&#37325;&#35201;&#32500;&#24230;&#12290;&#22522;&#20110;&#25105;&#20204;&#30340;&#20998;&#31867;&#30340;&#22343;&#34913;&#27169;&#22411;&#27604;&#22522;&#20110;&#32844;&#19994;&#21644;&#34892;&#19994;&#30340;&#27169;&#22411;&#26356;&#20934;&#30830;&#22320;&#39044;&#27979;&#20102;&#23545;2016&#24180;&#22885;&#36816;&#20250;&#30340;&#24037;&#36164;&#21464;&#21270;&#12290;&#27492;&#22806;&#65292;&#23545;&#20110;&#19968;&#27425;&#23545;&#24037;&#20154;&#38656;&#27714;&#30340;&#22823;&#35268;&#27169;&#27169;&#25311;&#20914;&#20987;&#65292;&#25105;&#20204;&#34920;&#26126;&#24403;&#20351;&#29992;&#25105;&#20204;&#30340;&#20998;&#31867;&#32780;&#19981;&#26159;&#32844;&#19994;&#21644;&#34892;&#19994;&#36827;&#34892;&#24037;&#20154;&#21644;&#24037;&#20316;&#30340;&#20998;&#31867;&#26102;&#65292;&#21171;&#21160;&#21147;&#24066;&#22330;&#20914;&#20987;&#26292;&#38706;&#23545;&#24037;&#20154;&#25910;&#20837;&#30340;&#24433;&#21709;&#30340;&#31616;&#21270;&#24418;&#24335;&#20272;&#35745;&#20540;&#23558;&#22823;&#32422;&#22686;&#21152;4&#20493;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper develops a new data-driven approach to characterizing latent worker skill and job task heterogeneity by applying an empirical tool from network theory to large-scale Brazilian administrative data on worker--job matching. We microfound this tool using a standard equilibrium model of workers matching with jobs according to comparative advantage. Our classifications identify important dimensions of worker and job heterogeneity that standard classifications based on occupations and sectors miss. The equilibrium model based on our classifications more accurately predicts wage changes in response to the 2016 Olympics than a model based on occupations and sectors. Additionally, for a large simulated shock to demand for workers, we show that reduced form estimates of the effects of labor market shock exposure on workers' earnings are nearly 4 times larger when workers and jobs are classified using our classifications as opposed to occupations and sectors.
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#27169;&#22411;&#19981;&#30830;&#23450;&#24615;&#19979;&#32654;&#24335;&#26399;&#26435;&#30340;&#26368;&#20248;&#34892;&#26435;&#20915;&#31574;&#38382;&#39064;&#65292;&#22522;&#20110;&#32473;&#23450;&#30340;&#36793;&#38469;&#20998;&#24067;&#20449;&#24687;&#65292;&#25512;&#23548;&#20986;&#20102;&#19968;&#31867;&#32654;&#24335;&#26399;&#26435;&#20215;&#26684;&#30340;&#19978;&#30028;&#65292;&#24182;&#35777;&#26126;&#20102;&#19982;&#26368;&#22823;&#21270;&#26399;&#26395;&#26399;&#26435;&#25910;&#30410;&#30456;&#32852;&#30340;&#20219;&#20309;&#24066;&#22330;&#27169;&#22411;&#30340;&#20219;&#20309;&#26399;&#26435;&#34892;&#26435;&#26041;&#26696;&#24517;&#28982;&#26159;&#38750;&#38543;&#26426;&#30340;&#12290;</title><link>http://arxiv.org/abs/2310.14473</link><description>&lt;p&gt;
&#27169;&#22411;&#19981;&#30830;&#23450;&#24615;&#19979;&#32654;&#24335;&#26399;&#26435;&#30340;&#26368;&#20248;&#34892;&#26435;&#20915;&#31574;
&lt;/p&gt;
&lt;p&gt;
Optimal exercise decision of American options under model uncertainty. (arXiv:2310.14473v1 [math.PR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.14473
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#27169;&#22411;&#19981;&#30830;&#23450;&#24615;&#19979;&#32654;&#24335;&#26399;&#26435;&#30340;&#26368;&#20248;&#34892;&#26435;&#20915;&#31574;&#38382;&#39064;&#65292;&#22522;&#20110;&#32473;&#23450;&#30340;&#36793;&#38469;&#20998;&#24067;&#20449;&#24687;&#65292;&#25512;&#23548;&#20986;&#20102;&#19968;&#31867;&#32654;&#24335;&#26399;&#26435;&#20215;&#26684;&#30340;&#19978;&#30028;&#65292;&#24182;&#35777;&#26126;&#20102;&#19982;&#26368;&#22823;&#21270;&#26399;&#26395;&#26399;&#26435;&#25910;&#30410;&#30456;&#32852;&#30340;&#20219;&#20309;&#24066;&#22330;&#27169;&#22411;&#30340;&#20219;&#20309;&#26399;&#26435;&#34892;&#26435;&#26041;&#26696;&#24517;&#28982;&#26159;&#38750;&#38543;&#26426;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#32473;&#23450;&#26410;&#26469;&#20004;&#20010;&#26102;&#38388;&#28857;T1&#21644;T2&#19979;&#22522;&#30784;&#36164;&#20135;&#20215;&#26684;&#30340;&#36793;&#38469;&#20998;&#24067;&#20449;&#24687;&#65292;&#25105;&#20204;&#32771;&#34385;&#30830;&#23450;&#19968;&#31181;&#26080;&#27169;&#22411;&#30340;&#20851;&#20110;&#19968;&#31867;&#32654;&#24335;&#26399;&#26435;&#20215;&#26684;&#30340;&#19978;&#30028;&#65292;&#36825;&#20123;&#26399;&#26435;&#22312;T1&#25110;&#32773;T2&#24517;&#39035;&#34987;&#34892;&#26435;&#12290;&#32473;&#23450;&#36793;&#38469;&#20449;&#24687;&#30340;&#27169;&#22411;&#19981;&#30830;&#23450;&#24615;&#21487;&#20197;&#25551;&#36848;&#20026;&#38789;&#26368;&#20248;&#36816;&#36755;&#38382;&#39064;&#12290;&#25105;&#20204;&#35777;&#26126;&#22914;&#26524;&#32654;&#24335;&#26399;&#26435;&#28385;&#36275;&#36866;&#24403;&#30340;&#20984;&#24615;&#26465;&#20214;&#65292;&#37027;&#20040;&#19982;&#26368;&#22823;&#21270;&#26399;&#26395;&#26399;&#26435;&#25910;&#30410;&#30456;&#32852;&#30340;&#20219;&#20309;&#24066;&#22330;&#27169;&#22411;&#30340;&#20219;&#20309;&#26399;&#26435;&#34892;&#26435;&#26041;&#26696;&#24517;&#28982;&#26159;&#38750;&#38543;&#26426;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
Given the marginal distribution information of the underlying asset price at two future times $T_1$ and $T_2$, we consider the problem of determining a model-free upper bound on the price of a class of American options that must be exercised at either $T_1$ or $T_2$. The model uncertainty consistent with the given marginal information is described as the martingale optimal transport problem. We show that if the American option payoff satisfies a suitable convexity condition, then any option exercise scheme associated with any market model that jointly maximizes the expected option payoff must be nonrandomized.
&lt;/p&gt;</description></item><item><title>&#29983;&#25104;&#24335;AI&#33021;&#22815;&#20934;&#30830;&#39044;&#27979;&#20154;&#31867;&#22312;&#20915;&#31574;&#20013;&#24179;&#34913;&#33258;&#36523;&#21033;&#30410;&#19982;&#20182;&#20154;&#21033;&#30410;&#30340;&#34892;&#20026;&#27169;&#24335;&#65292;&#20294;&#23384;&#22312;&#39640;&#20272;&#20182;&#20154;&#20851;&#27880;&#34892;&#20026;&#30340;&#20542;&#21521;&#65292;&#36825;&#23545;AI&#30340;&#24320;&#21457;&#32773;&#21644;&#29992;&#25143;&#20855;&#26377;&#37325;&#35201;&#24847;&#20041;&#12290;</title><link>http://arxiv.org/abs/2307.12776</link><description>&lt;p&gt;
&#39044;&#27979;&#20154;&#31867;&#22914;&#20309;&#22312;&#33258;&#36523;&#21033;&#30410;&#19982;&#20182;&#20154;&#21033;&#30410;&#20043;&#38388;&#24179;&#34913;&#30340;&#21487;&#39044;&#27979;&#24615;
&lt;/p&gt;
&lt;p&gt;
Predict-AI-bility of how humans balance self-interest with the interest of others. (arXiv:2307.12776v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.12776
&lt;/p&gt;
&lt;p&gt;
&#29983;&#25104;&#24335;AI&#33021;&#22815;&#20934;&#30830;&#39044;&#27979;&#20154;&#31867;&#22312;&#20915;&#31574;&#20013;&#24179;&#34913;&#33258;&#36523;&#21033;&#30410;&#19982;&#20182;&#20154;&#21033;&#30410;&#30340;&#34892;&#20026;&#27169;&#24335;&#65292;&#20294;&#23384;&#22312;&#39640;&#20272;&#20182;&#20154;&#20851;&#27880;&#34892;&#20026;&#30340;&#20542;&#21521;&#65292;&#36825;&#23545;AI&#30340;&#24320;&#21457;&#32773;&#21644;&#29992;&#25143;&#20855;&#26377;&#37325;&#35201;&#24847;&#20041;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#29983;&#25104;&#24335;&#20154;&#24037;&#26234;&#33021;&#20855;&#26377;&#38761;&#21629;&#24615;&#30340;&#28508;&#21147;&#65292;&#21487;&#20197;&#25913;&#21464;&#20174;&#26085;&#24120;&#29983;&#27963;&#21040;&#39640;&#39118;&#38505;&#22330;&#26223;&#30340;&#20915;&#31574;&#36807;&#31243;&#12290;&#28982;&#32780;&#65292;&#30001;&#20110;&#35768;&#22810;&#20915;&#31574;&#20855;&#26377;&#31038;&#20250;&#24433;&#21709;&#65292;&#20026;&#20102;&#20351;AI&#33021;&#22815;&#25104;&#20026;&#21487;&#38752;&#30340;&#20915;&#31574;&#21161;&#25163;&#65292;&#23427;&#24517;&#39035;&#33021;&#22815;&#25429;&#25417;&#33258;&#36523;&#21033;&#30410;&#19982;&#20182;&#20154;&#21033;&#30410;&#20043;&#38388;&#30340;&#24179;&#34913;&#12290;&#25105;&#20204;&#23545;&#19977;&#31181;&#26368;&#20808;&#36827;&#30340;&#32842;&#22825;&#26426;&#22120;&#20154;&#23545;&#26469;&#33258;12&#20010;&#22269;&#23478;&#30340;78&#20010;&#23454;&#39564;&#30340;&#29420;&#35009;&#32773;&#28216;&#25103;&#20915;&#31574;&#36827;&#34892;&#20102;&#30740;&#31350;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#21482;&#26377;GPT-4&#65288;&#32780;&#19981;&#26159;Bard&#25110;Bing&#65289;&#33021;&#22815;&#27491;&#30830;&#25429;&#25417;&#21040;&#34892;&#20026;&#27169;&#24335;&#30340;&#23450;&#24615;&#29305;&#24449;&#65292;&#35782;&#21035;&#20986;&#19977;&#31181;&#20027;&#35201;&#30340;&#34892;&#20026;&#31867;&#21035;&#65306;&#33258;&#31169;&#30340;&#12289;&#19981;&#20844;&#24179;&#21388;&#24694;&#30340;&#21644;&#23436;&#20840;&#26080;&#31169;&#30340;&#12290;&#28982;&#32780;&#65292;GPT-4&#19968;&#30452;&#39640;&#20272;&#20102;&#20182;&#20154;&#20851;&#27880;&#34892;&#20026;&#65292;&#22840;&#22823;&#20102;&#19981;&#20844;&#24179;&#21388;&#24694;&#21644;&#23436;&#20840;&#26080;&#31169;&#21442;&#19982;&#32773;&#30340;&#27604;&#20363;&#12290;&#36825;&#31181;&#20559;&#35265;&#23545;&#20110;AI&#24320;&#21457;&#20154;&#21592;&#21644;&#29992;&#25143;&#20855;&#26377;&#37325;&#35201;&#24847;&#20041;&#12290;
&lt;/p&gt;
&lt;p&gt;
Generative artificial intelligence holds enormous potential to revolutionize decision-making processes, from everyday to high-stake scenarios. However, as many decisions carry social implications, for AI to be a reliable assistant for decision-making it is crucial that it is able to capture the balance between self-interest and the interest of others. We investigate the ability of three of the most advanced chatbots to predict dictator game decisions across 78 experiments with human participants from 12 countries. We find that only GPT-4 (not Bard nor Bing) correctly captures qualitative behavioral patterns, identifying three major classes of behavior: self-interested, inequity-averse, and fully altruistic. Nonetheless, GPT-4 consistently overestimates other-regarding behavior, inflating the proportion of inequity-averse and fully altruistic participants. This bias has significant implications for AI developers and users.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#20013;&#38388;&#36793;&#38469;&#20998;&#24067;&#23545;&#39532;&#19969;&#26684;&#23572;&#26368;&#20248;&#36755;&#36816;&#38382;&#39064;&#30340;&#24433;&#21709;&#65292;&#24182;&#21457;&#29616;&#32771;&#34385;&#21040;&#39321;&#33609;&#26399;&#26435;&#19978;&#30340;&#39069;&#22806;&#20215;&#26684;&#20449;&#24687;&#21487;&#33021;&#23545;&#26080;&#27169;&#22411;&#23450;&#20215;&#19979;&#30028;&#20135;&#29983;&#37325;&#35201;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2307.09710</link><description>&lt;p&gt;
&#20851;&#20110;&#39532;&#19969;&#26684;&#23572;&#26368;&#20248;&#36755;&#36816;&#20013;&#38388;&#36793;&#38469;&#30340;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
On intermediate Marginals in Martingale Optimal Transportation. (arXiv:2307.09710v1 [q-fin.MF])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.09710
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#20013;&#38388;&#36793;&#38469;&#20998;&#24067;&#23545;&#39532;&#19969;&#26684;&#23572;&#26368;&#20248;&#36755;&#36816;&#38382;&#39064;&#30340;&#24433;&#21709;&#65292;&#24182;&#21457;&#29616;&#32771;&#34385;&#21040;&#39321;&#33609;&#26399;&#26435;&#19978;&#30340;&#39069;&#22806;&#20215;&#26684;&#20449;&#24687;&#21487;&#33021;&#23545;&#26080;&#27169;&#22411;&#23450;&#20215;&#19979;&#30028;&#20135;&#29983;&#37325;&#35201;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#39069;&#22806;&#20013;&#38388;&#36793;&#38469;&#20998;&#24067;&#23545;&#39532;&#19969;&#26684;&#23572;&#26368;&#20248;&#36755;&#36816;&#38382;&#39064;&#20215;&#20540;&#30340;&#24433;&#21709;&#12290;&#20174;&#37329;&#34701;&#35282;&#24230;&#26469;&#30475;&#65292;&#36825;&#24847;&#21619;&#30528;&#19981;&#20165;&#32771;&#34385;&#37027;&#20123;&#26399;&#26435;&#21040;&#26399;&#26102;&#38388;&#19982;&#26576;&#20123;&#24322;&#24577;&#34893;&#29983;&#21697;&#21040;&#26399;&#26102;&#38388;&#30456;&#19968;&#33268;&#30340;&#26399;&#26435;&#20215;&#26684;&#65292;&#36824;&#32771;&#34385;&#39069;&#22806;&#30340;&#21040;&#26399;&#26102;&#38388;&#65292;&#24182;&#30740;&#31350;&#23545;&#24322;&#24577;&#34893;&#29983;&#21697;&#30340;&#26080;&#27169;&#22411;&#23450;&#20215;&#19979;&#30028;&#30340;&#24433;&#21709;&#12290;&#25105;&#20204;&#34920;&#24449;&#20102;&#24066;&#22330;&#35774;&#32622;&#65292;&#21363;&#24322;&#24577;&#34893;&#29983;&#21697;&#30340;&#22238;&#25253;&#12289;&#26399;&#26435;&#20215;&#26684;&#21644;&#36793;&#38469;&#20998;&#24067;&#30340;&#32452;&#21512;&#65292;&#21487;&#20197;&#20445;&#35777;&#25913;&#36827;&#30340;&#20215;&#26684;&#19979;&#30028;&#65292;&#20197;&#21450;&#37027;&#20123;&#25490;&#38500;&#20219;&#20309;&#25913;&#36827;&#30340;&#24066;&#22330;&#35774;&#32622;&#12290;&#26368;&#21518;&#65292;&#25105;&#20204;&#36890;&#36807;&#22810;&#20010;&#31034;&#20363;&#23637;&#31034;&#65292;&#32771;&#34385;&#21040;&#39321;&#33609;&#26399;&#26435;&#19978;&#30340;&#39069;&#22806;&#20215;&#26684;&#20449;&#24687;&#21487;&#33021;&#23545;&#20135;&#29983;&#30340;&#26080;&#27169;&#22411;&#23450;&#20215;&#19979;&#30028;&#20135;&#29983;&#30456;&#24403;&#22823;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study the influence of additional intermediate marginal distributions on the value of the martingale optimal transport problem. From a financial point of view, this corresponds to taking into account call option prices not only, as usual, for those call options where the respective future maturities coincide with the maturities of some exotic derivative but also additional maturities and then to study the effect on model-independent price bounds for the exotic derivative. We characterize market settings, i.e., combinations of the payoff of exotic derivatives, call option prices and marginal distributions that guarantee improved price bounds as well as those market settings that exclude any improvement.  Eventually, we showcase in numerous examples that the consideration of additional price information on vanilla options may have a considerable impact on the resultant model-independent price bounds.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#36866;&#29992;&#20110;&#21452;&#22240;&#26524;&#26368;&#20248;&#20256;&#36755;&#38382;&#39064;&#30340;&#25311;&#21512;&#20540;&#36845;&#20195;&#26041;&#27861;&#65292;&#33021;&#22815;&#22312;&#20445;&#35777;&#31934;&#24230;&#30340;&#21516;&#26102;&#20855;&#26377;&#33391;&#22909;&#30340;&#21487;&#25193;&#23637;&#24615;&#65292;&#25968;&#20540;&#23454;&#39564;&#32467;&#26524;&#20063;&#35777;&#26126;&#20102;&#35813;&#26041;&#27861;&#30340;&#20248;&#36234;&#24615;&#12290;</title><link>http://arxiv.org/abs/2306.12658</link><description>&lt;p&gt;
&#25311;&#21512;&#20540;&#36845;&#20195;&#26041;&#27861;&#27714;&#35299;&#36866;&#24212;&#32467;&#26500;&#21452;&#22240;&#26524;&#26368;&#20248;&#20256;&#36755;&#38382;&#39064;
&lt;/p&gt;
&lt;p&gt;
Fitted Value Iteration Methods for Bicausal Optimal Transport. (arXiv:2306.12658v1 [stat.ML])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.12658
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#36866;&#29992;&#20110;&#21452;&#22240;&#26524;&#26368;&#20248;&#20256;&#36755;&#38382;&#39064;&#30340;&#25311;&#21512;&#20540;&#36845;&#20195;&#26041;&#27861;&#65292;&#33021;&#22815;&#22312;&#20445;&#35777;&#31934;&#24230;&#30340;&#21516;&#26102;&#20855;&#26377;&#33391;&#22909;&#30340;&#21487;&#25193;&#23637;&#24615;&#65292;&#25968;&#20540;&#23454;&#39564;&#32467;&#26524;&#20063;&#35777;&#26126;&#20102;&#35813;&#26041;&#27861;&#30340;&#20248;&#36234;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#19968;&#31181;&#25311;&#21512;&#20540;&#36845;&#20195;&#26041;&#27861;(FVI)&#29992;&#20110;&#35745;&#31639;&#20855;&#26377;&#36866;&#24212;&#32467;&#26500;&#30340;&#21452;&#22240;&#26524;&#26368;&#20248;&#20256;&#36755;(OT)&#12290;&#22522;&#20110;&#21160;&#24577;&#35268;&#21010;&#30340;&#24418;&#24335;&#21270;&#34920;&#36848;&#65292;FVI&#37319;&#29992;&#20989;&#25968;&#31867;&#29992;&#20110;&#36817;&#20284;&#21452;&#22240;&#26524;OT&#20013;&#30340;&#20540;&#20989;&#25968;&#12290;&#22312;&#21487;&#38598;&#20013;&#26465;&#20214;&#21644;&#36817;&#20284;&#23436;&#22791;&#24615;&#20551;&#35774;&#19979;&#65292;&#25105;&#20204;&#20351;&#29992;&#65288;&#23616;&#37096;&#65289;Rademacher&#22797;&#26434;&#24230;&#35777;&#26126;&#20102;&#26679;&#26412;&#22797;&#26434;&#24230;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#28145;&#24230;&#22810;&#23618;&#31070;&#32463;&#32593;&#32476;&#20855;&#26377;&#36866;&#24403;&#32467;&#26500;&#65292;&#28385;&#36275;&#26679;&#26412;&#22797;&#26434;&#24230;&#35777;&#26126;&#25152;&#38656;&#30340;&#20851;&#38190;&#20551;&#35774;&#26465;&#20214;&#12290;&#25968;&#20540;&#23454;&#39564;&#34920;&#26126;&#65292;FVI&#22312;&#26102;&#38388;&#36328;&#24230;&#22686;&#21152;&#26102;&#20248;&#20110;&#32447;&#24615;&#35268;&#21010;&#21644;&#36866;&#24212;&#24615;Sinkhorn&#26041;&#27861;&#65292;&#22312;&#20445;&#25345;&#21487;&#25509;&#21463;&#31934;&#24230;&#30340;&#21516;&#26102;&#20855;&#26377;&#24456;&#22909;&#30340;&#21487;&#25193;&#23637;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
We develop a fitted value iteration (FVI) method to compute bicausal optimal transport (OT) where couplings have an adapted structure. Based on the dynamic programming formulation, FVI adopts a function class to approximate the value functions in bicausal OT. Under the concentrability condition and approximate completeness assumption, we prove the sample complexity using (local) Rademacher complexity. Furthermore, we demonstrate that multilayer neural networks with appropriate structures satisfy the crucial assumptions required in sample complexity proofs. Numerical experiments reveal that FVI outperforms linear programming and adapted Sinkhorn methods in scalability as the time horizon increases, while still maintaining acceptable accuracy.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#31038;&#20132;&#23186;&#20307;&#34920;&#36798;&#30340;&#24773;&#24863;&#22914;&#20309;&#24433;&#21709;&#21021;&#27425;&#20844;&#24320;&#21457;&#34892;&#65288;IPO&#65289;&#32929;&#31080;&#30340;&#38169;&#20215;&#12290;&#31038;&#20132;&#23186;&#20307;&#19978;&#20998;&#20139;&#30340;&#22823;&#37327;&#20449;&#24687;&#21644;&#35266;&#28857;&#21487;&#20197;&#24341;&#21457;&#28818;&#20316;&#65292;&#23548;&#33268;&#25237;&#36164;&#32773;&#38750;&#29702;&#24615;&#20080;&#21334;&#20915;&#31574;&#65292;&#20174;&#32780;&#22312;&#30701;&#26399;&#20869;&#39640;&#20272;&#32929;&#31080;&#65292;&#20294;&#32463;&#24120;&#22312;&#38271;&#26399;&#20869;&#24471;&#21040;&#20462;&#27491;&#12290;&#21457;&#29616;&#25237;&#36164;&#32773;&#28909;&#24773;&#39640;&#28072;&#30340;IPO&#25317;&#26377;&#26356;&#39640;&#30340;&#22238;&#25253;&#29575;&#65292;&#20294;&#36825;&#31181;&#28909;&#24773;&#21487;&#33021;&#26159;&#38169;&#25918;&#30340;&#65292;&#38656;&#35201;&#26356;&#38271;&#30340;&#26102;&#38388;&#25165;&#33021;&#23454;&#29616;&#21487;&#25345;&#32493;&#30340;&#25104;&#38271;&#12290;</title><link>http://arxiv.org/abs/2306.12602</link><description>&lt;p&gt;
&#31038;&#20132;&#23186;&#20307;&#24773;&#24863;&#19982;IPO&#22238;&#25253;
&lt;/p&gt;
&lt;p&gt;
Social Media Emotions and IPO Returns. (arXiv:2306.12602v1 [q-fin.PR])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.12602
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#31038;&#20132;&#23186;&#20307;&#34920;&#36798;&#30340;&#24773;&#24863;&#22914;&#20309;&#24433;&#21709;&#21021;&#27425;&#20844;&#24320;&#21457;&#34892;&#65288;IPO&#65289;&#32929;&#31080;&#30340;&#38169;&#20215;&#12290;&#31038;&#20132;&#23186;&#20307;&#19978;&#20998;&#20139;&#30340;&#22823;&#37327;&#20449;&#24687;&#21644;&#35266;&#28857;&#21487;&#20197;&#24341;&#21457;&#28818;&#20316;&#65292;&#23548;&#33268;&#25237;&#36164;&#32773;&#38750;&#29702;&#24615;&#20080;&#21334;&#20915;&#31574;&#65292;&#20174;&#32780;&#22312;&#30701;&#26399;&#20869;&#39640;&#20272;&#32929;&#31080;&#65292;&#20294;&#32463;&#24120;&#22312;&#38271;&#26399;&#20869;&#24471;&#21040;&#20462;&#27491;&#12290;&#21457;&#29616;&#25237;&#36164;&#32773;&#28909;&#24773;&#39640;&#28072;&#30340;IPO&#25317;&#26377;&#26356;&#39640;&#30340;&#22238;&#25253;&#29575;&#65292;&#20294;&#36825;&#31181;&#28909;&#24773;&#21487;&#33021;&#26159;&#38169;&#25918;&#30340;&#65292;&#38656;&#35201;&#26356;&#38271;&#30340;&#26102;&#38388;&#25165;&#33021;&#23454;&#29616;&#21487;&#25345;&#32493;&#30340;&#25104;&#38271;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#21021;&#27425;&#20844;&#24320;&#21457;&#34892;&#65288;IPO&#65289;&#22238;&#25253;&#30340;&#20004;&#20010;&#32463;&#39564;&#20107;&#23454;&#32972;&#21518;&#30340;&#28508;&#22312;&#26426;&#21046;&#12290;&#36890;&#36807;&#20998;&#26512;&#22312;StockTwits&#21644;Twitter&#19978;&#34920;&#36798;&#30340;&#25237;&#36164;&#32773;&#24773;&#32490;&#65292;&#21457;&#29616;&#36825;&#20123;&#31038;&#20132;&#23186;&#20307;&#24179;&#21488;&#20256;&#36798;&#30340;&#24773;&#24863;&#21487;&#20197;&#24110;&#21161;&#35299;&#37322;IPO&#32929;&#31080;&#30340;&#38169;&#20215;&#12290;&#31038;&#20132;&#23186;&#20307;&#19978;&#20998;&#20139;&#30340;&#22823;&#37327;&#20449;&#24687;&#21644;&#35266;&#28857;&#21487;&#33021;&#20250;&#24341;&#21457;&#23545;&#26576;&#20123;&#32929;&#31080;&#30340;&#28818;&#20316;&#65292;&#23548;&#33268;&#25237;&#36164;&#32773;&#30340;&#38750;&#29702;&#24615;&#20080;&#21334;&#20915;&#31574;&#12290;&#36825;&#21487;&#33021;&#23548;&#33268;&#32929;&#31080;&#22312;&#30701;&#26399;&#20869;&#34987;&#39640;&#20272;&#65292;&#20294;&#24120;&#24120;&#20250;&#22312;&#38271;&#26399;&#20869;&#24471;&#21040;&#20462;&#27491;&#65292;&#22240;&#20026;&#32929;&#31080;&#30340;&#34920;&#29616;&#26410;&#33021;&#28385;&#36275;&#36807;&#39640;&#30340;&#26399;&#26395;&#12290;&#29305;&#21035;&#26159;&#65292;&#21457;&#29616;&#22312;&#19978;&#24066;&#21069;&#25237;&#36164;&#32773;&#28909;&#24773;&#39640;&#28072;&#30340;IPO&#65292;&#20854;&#31532;&#19968;&#22825;&#22238;&#25253;&#29575;&#26126;&#26174;&#26356;&#39640;&#65292;&#20026;29.54&#65285;&#65292;&#32780;&#19978;&#24066;&#21069;&#25237;&#36164;&#32773;&#28909;&#24773;&#36739;&#20302;&#30340;IPO&#65292;&#20854;&#24179;&#22343;&#31532;&#19968;&#22825;&#22238;&#25253;&#29575;&#20026;16.91&#65285;&#12290;&#20294;&#26159;&#65292;&#36825;&#31181;&#21021;&#22987;&#28909;&#24773;&#21487;&#33021;&#26159;&#38169;&#25918;&#30340;&#65292;&#22240;&#20026;&#19978;&#24066;&#21069;&#25237;&#36164;&#32773;&#28909;&#24773;&#24456;&#39640;&#30340;IPO&#21487;&#33021;&#38656;&#35201;&#26356;&#38271;&#30340;&#26102;&#38388;&#25165;&#33021;&#23454;&#29616;&#21487;&#25345;&#32493;&#30340;&#25104;&#38271;&#12290;
&lt;/p&gt;
&lt;p&gt;
I examine potential mechanisms behind two stylized facts of initial public offerings (IPOs) returns. By analyzing investor sentiment expressed on StockTwits and Twitter, I find that emotions conveyed through these social media platforms can help explain the mispricing of IPO stocks. The abundance of information and opinions shared on social media can generate hype around certain stocks, leading to investors' irrational buying and selling decisions. This can result in an overvaluation of the stock in the short term but often leads to a correction in the long term as the stock's performance fails to meet the inflated expectations. In particular, I find that IPOs with high levels of pre-IPO investor enthusiasm tend to have a significantly higher first-day return of 29.54%, compared to IPOs with lower levels of pre-IPO investor enthusiasm, which have an average first-day return of 16.91%. However, this initial enthusiasm may be misplaced, as IPOs with high pre-IPO investor enthusiasm demon
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#24212;&#29992;&#20110;&#33021;&#28304;&#24066;&#22330;&#30340;Heat-Jarrow-Morton&#26694;&#26550;&#65292;&#37325;&#28857;&#25918;&#22312;&#23454;&#36341;&#26041;&#38754;&#12290;&#20316;&#20026;&#24212;&#29992;&#65292;&#25105;&#20204;&#37325;&#28857;&#20851;&#27880;&#27431;&#27954;&#30005;&#21147;&#21644;&#22825;&#28982;&#27668;&#24066;&#22330;&#12290;</title><link>http://arxiv.org/abs/2305.01485</link><description>&lt;p&gt;
&#19968;&#31181;&#24212;&#29992;&#20110;&#33021;&#28304;&#24066;&#22330;&#30340;Heat-Jarrow-Morton&#26694;&#26550;&#65306;&#23454;&#29992;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
A Heat-Jarrow-Morton framework for energy markets: a pragmatic approach. (arXiv:2305.01485v1 [q-fin.MF])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.01485
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#24212;&#29992;&#20110;&#33021;&#28304;&#24066;&#22330;&#30340;Heat-Jarrow-Morton&#26694;&#26550;&#65292;&#37325;&#28857;&#25918;&#22312;&#23454;&#36341;&#26041;&#38754;&#12290;&#20316;&#20026;&#24212;&#29992;&#65292;&#25105;&#20204;&#37325;&#28857;&#20851;&#27880;&#27431;&#27954;&#30005;&#21147;&#21644;&#22825;&#28982;&#27668;&#24066;&#22330;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#35752;&#35770;&#20102;&#23558;Heat-Jarrow-Morton&#26694;&#26550;&#24212;&#29992;&#20110;&#33021;&#28304;&#24066;&#22330;&#30340;&#26041;&#27861;&#12290;&#26412;&#25991;&#30340;&#30446;&#30340;&#26159;&#35814;&#32454;&#20171;&#32461;&#35813;&#20027;&#39064;&#65292;&#37325;&#28857;&#25918;&#22312;&#23454;&#36341;&#26041;&#38754;&#32780;&#38750;&#24050;&#26377;&#22823;&#37327;&#25991;&#29486;&#25506;&#35752;&#30340;&#29702;&#35770;&#26041;&#38754;&#12290;&#26412;&#25991;&#26088;&#22312;&#25104;&#20026;&#20174;&#19994;&#20154;&#21592;&#20197;&#21450;&#25152;&#26377;&#20174;&#20107;&#36825;&#31181;&#26041;&#27861;&#30340;&#33021;&#28304;&#24066;&#22330;&#23454;&#38469;&#38382;&#39064;&#22788;&#29702;&#30340;&#20154;&#30340;&#25351;&#21335;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#25105;&#20204;&#20851;&#27880;&#24066;&#22330;&#32467;&#26500;&#12289;&#21033;&#29992;&#20027;&#25104;&#20998;&#20998;&#26512;&#65288;PCA&#65289;&#36827;&#34892;&#27169;&#22411;&#26657;&#20934;&#12289;&#33945;&#29305;&#21345;&#32599;&#27169;&#25311;&#21644;&#34893;&#29983;&#21697;&#23450;&#20215;&#12290;&#20316;&#20026;&#24212;&#29992;&#65292;&#25105;&#20204;&#37325;&#28857;&#20851;&#27880;&#27431;&#27954;&#30005;&#21147;&#21644;&#22825;&#28982;&#27668;&#24066;&#22330;&#65306;&#25105;&#20204;&#23558;&#27169;&#22411;&#26657;&#20934;&#20026;&#21382;&#21490;&#26399;&#36135;&#25253;&#20215;&#65292;&#36827;&#34892;&#26399;&#36135;&#21644;&#29616;&#36135;&#27169;&#25311;&#24182;&#20998;&#26512;&#32467;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this article we discuss the application of the Heat-Jarrow-Morton framework Heath et al. [26] to energy markets. The goal of the article is to give a detailed overview of the topic, focusing on practical aspects rather than on theory, which has been widely studied in literature. This work aims to be a guide for practitioners and for all those who deal with the practical issues of this approach to energy market. In particular, we focus on the markets' structure, model calibration by dimension reduction with Principal Component Analysis (PCA), Monte Carlo simulations and derivatives pricing. As application, we focus on European power and gas markets: we calibrate the model on historical futures quotations, we perform futures and spot simulations and we analyze the results.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#36890;&#36807;&#25552;&#20986;&#26032;&#30340;&#26041;&#27861;&#65292;&#35299;&#20915;&#20102;&#20043;&#21069;&#22312;&#26576;&#20123;&#24322;&#36136;&#24615;&#20195;&#29702;&#20154;&#19981;&#23436;&#20840;&#24066;&#22330;&#27169;&#22411;&#30340;&#23439;&#35266;&#32463;&#27982;&#22343;&#34913;&#35299;&#20915;&#26041;&#26696;&#30340;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2303.12567</link><description>&lt;p&gt;
&#32463;&#27982;&#20027;&#20307;&#30340;&#21160;&#24577;&#36816;&#36755;
&lt;/p&gt;
&lt;p&gt;
Dynamic Transportation of Economic Agents. (arXiv:2303.12567v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2303.12567
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36890;&#36807;&#25552;&#20986;&#26032;&#30340;&#26041;&#27861;&#65292;&#35299;&#20915;&#20102;&#20043;&#21069;&#22312;&#26576;&#20123;&#24322;&#36136;&#24615;&#20195;&#29702;&#20154;&#19981;&#23436;&#20840;&#24066;&#22330;&#27169;&#22411;&#30340;&#23439;&#35266;&#32463;&#27982;&#22343;&#34913;&#35299;&#20915;&#26041;&#26696;&#30340;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#26159;&#22312;&#21457;&#29616;&#20102;&#19968;&#20010;&#20849;&#21516;&#30340;&#31574;&#30053;&#26410;&#33021;&#23558;&#26576;&#20123;&#24322;&#36136;&#24615;&#20195;&#29702;&#20154;&#19981;&#23436;&#20840;&#24066;&#22330;&#27169;&#22411;&#30340;&#23439;&#35266;&#32463;&#27982;&#22343;&#34913;&#23450;&#20301;&#21040;&#24191;&#27867;&#24341;&#29992;&#30340;&#22522;&#20934;&#30740;&#31350;&#20013;&#32780;&#24341;&#21457;&#30340;&#12290;&#36890;&#36807;&#27169;&#20223;Dumas&#21644;Lyasoff&#65288;2012&#65289;&#25552;&#20986;&#30340;&#26041;&#27861;&#65292;&#26412;&#25991;&#25552;&#20379;&#20102;&#19968;&#20010;&#26032;&#30340;&#25551;&#36848;&#65292;&#22312;&#38754;&#23545;&#19981;&#21487;&#20445;&#38505;&#30340;&#24635;&#20307;&#21644;&#20010;&#20307;&#39118;&#38505;&#30340;&#22823;&#37327;&#20114;&#21160;&#32463;&#27982;&#20307;&#20195;&#34920;&#30340;&#31169;&#20154;&#29366;&#24577;&#20998;&#24067;&#30340;&#36816;&#21160;&#23450;&#24459;&#12290;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#31639;&#27861;&#65292;&#29992;&#20110;&#30830;&#23450;&#22238;&#25253;&#12289;&#26368;&#20248;&#31169;&#20154;&#37197;&#32622;&#21644;&#24179;&#34913;&#29366;&#24577;&#19979;&#30340;&#20154;&#21475;&#36816;&#36755;&#65292;&#24182;&#22312;&#20004;&#20010;&#20247;&#25152;&#21608;&#30693;&#30340;&#22522;&#20934;&#30740;&#31350;&#20013;&#36827;&#34892;&#20102;&#27979;&#35797;&#12290;
&lt;/p&gt;
&lt;p&gt;
The paper was prompted by the surprising discovery that the common strategy, adopted in a large body of research, for producing macroeconomic equilibrium in certain heterogeneous-agent incomplete-market models fails to locate the equilibrium in a widely cited benchmark study. By mimicking the approach proposed by Dumas and Lyasoff (2012), the paper provides a novel description of the law of motion of the distribution over the range of private states of a large population of interacting economic agents faced with uninsurable aggregate and idiosyncratic risk. A new algorithm for identifying the returns, the optimal private allocations, and the population transport in the state of equilibrium is developed and is tested in two well known benchmark studies.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#27169;&#22411;&#19981;&#30830;&#23450;&#24615;&#21644;&#20449;&#24687;&#24310;&#36831;&#19979;&#65292;&#22810;&#25805;&#20316;&#26399;&#26435;&#30340;&#36229;&#23545;&#20914;&#38382;&#39064;&#12290;&#36890;&#36807;&#24341;&#20837;&#25193;&#22823;&#30340;&#31354;&#38388;&#23558;&#35813;&#38382;&#39064;&#37325;&#26500;&#20026;&#27431;&#24335;&#26399;&#26435;&#38382;&#39064;&#65292;&#24182;&#35777;&#26126;&#20102;&#23450;&#20215;-&#23545;&#20914;&#20108;&#37325;&#24615;&#12290;&#21516;&#26102;&#65292;&#32473;&#20986;&#20102;&#24403;&#26399;&#26435;&#20080;&#26041;&#30340;&#34892;&#21160;&#34987;&#21334;&#26041;&#35266;&#23519;&#21040;&#26102;&#30340;&#36229;&#23545;&#20914;&#20215;&#26684;&#19982;&#26399;&#26435;&#20080;&#26041;&#33021;&#22815;&#39044;&#27979;&#26410;&#26469;&#30340;&#20851;&#31995;&#12290;</title><link>http://arxiv.org/abs/2111.14502</link><description>&lt;p&gt;
&#22312;&#27169;&#22411;&#19981;&#30830;&#23450;&#24615;&#21644;&#20449;&#24687;&#24310;&#36831;&#19979;&#65292;&#22810;&#25805;&#20316;&#26399;&#26435;&#30340;&#36229;&#23545;&#20914;&#20108;&#37325;&#24615;
&lt;/p&gt;
&lt;p&gt;
Superhedging duality for multi-action options under model uncertainty with information delay. (arXiv:2111.14502v2 [q-fin.MF] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2111.14502
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#22312;&#27169;&#22411;&#19981;&#30830;&#23450;&#24615;&#21644;&#20449;&#24687;&#24310;&#36831;&#19979;&#65292;&#22810;&#25805;&#20316;&#26399;&#26435;&#30340;&#36229;&#23545;&#20914;&#38382;&#39064;&#12290;&#36890;&#36807;&#24341;&#20837;&#25193;&#22823;&#30340;&#31354;&#38388;&#23558;&#35813;&#38382;&#39064;&#37325;&#26500;&#20026;&#27431;&#24335;&#26399;&#26435;&#38382;&#39064;&#65292;&#24182;&#35777;&#26126;&#20102;&#23450;&#20215;-&#23545;&#20914;&#20108;&#37325;&#24615;&#12290;&#21516;&#26102;&#65292;&#32473;&#20986;&#20102;&#24403;&#26399;&#26435;&#20080;&#26041;&#30340;&#34892;&#21160;&#34987;&#21334;&#26041;&#35266;&#23519;&#21040;&#26102;&#30340;&#36229;&#23545;&#20914;&#20215;&#26684;&#19982;&#26399;&#26435;&#20080;&#26041;&#33021;&#22815;&#39044;&#27979;&#26410;&#26469;&#30340;&#20851;&#31995;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#32771;&#34385;&#22312;&#31163;&#25955;&#26102;&#38388;&#20013;&#65292;&#38750;&#25903;&#37197;&#27169;&#22411;&#19981;&#30830;&#23450;&#24615;&#19979;&#65292;&#24322;&#22269;&#26399;&#26435;&#30340;&#36229;&#23545;&#20914;&#20215;&#26684;&#12290;&#22312;&#35813;&#27169;&#22411;&#20013;&#65292;&#26399;&#26435;&#20080;&#26041;&#22312;&#27599;&#20010;&#26102;&#38388;&#27493;&#20013;&#20174;&#19968;&#20010;&#65288;&#19981;&#21487;&#25968;&#30340;&#65289;&#25805;&#20316;&#31354;&#38388;&#20013;&#36873;&#25321;&#26576;&#31181;&#34892;&#21160;&#12290;&#36890;&#36807;&#24341;&#20837;&#19968;&#20010;&#25193;&#22823;&#30340;&#31354;&#38388;&#65292;&#25105;&#20204;&#23558;&#36825;&#31181;&#24322;&#22269;&#26399;&#26435;&#30340;&#36229;&#23545;&#20914;&#38382;&#39064;&#37325;&#26500;&#20026;&#19968;&#20010;&#27431;&#24335;&#26399;&#26435;&#38382;&#39064;&#65292;&#20174;&#32780;&#35777;&#26126;&#20102;&#23450;&#20215;-&#23545;&#20914;&#20108;&#37325;&#24615;&#12290;&#25509;&#19979;&#26469;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#20108;&#37325;&#24615;&#32467;&#26524;&#65292;&#21363;&#24403;&#26399;&#26435;&#20080;&#26041;&#30340;&#34892;&#21160;&#22312;&#20043;&#21518;&#30340;$l$&#20010;&#21608;&#26399;&#20869;&#34987;&#21334;&#26041;&#35266;&#23519;&#21040;&#26102;&#65292;&#36229;&#23545;&#20914;&#20215;&#26684;&#31561;&#20110;&#22522;&#20110;&#27169;&#22411;&#30340;&#20215;&#26684;&#65292;&#20854;&#20013;&#26399;&#26435;&#20080;&#26041;&#26377;&#33021;&#21147;&#39044;&#27979;&#26410;&#26469;$l$&#20010;&#21608;&#26399;&#12290;
&lt;/p&gt;
&lt;p&gt;
We consider the superhedging price of an exotic option under nondominated model uncertainty in discrete time in which the option buyer chooses some action from an (uncountable) action space at each time step. By introducing an enlarged space we reformulate the superhedging problem for such an exotic option as a problem for a European option, which enables us to prove the pricing-hedging duality. Next, we present a duality result that, when the option buyers action is observed by the seller up to $l$ periods later, the superhedging price equals the model-based price where the option buyer has the power to look into the future for $l$ periods.
&lt;/p&gt;</description></item></channel></rss>