<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#35813;&#30740;&#31350;&#27979;&#37327;&#20102;&#25910;&#20837;&#20914;&#20987;&#23545;&#28040;&#36153;&#20445;&#38505;&#30340;&#24433;&#21709;&#31243;&#24230;&#65292;&#35777;&#23454;&#23614;&#37096;&#25910;&#20837;&#39118;&#38505;&#23545;&#28040;&#36153;&#20855;&#26377;&#37325;&#35201;&#24433;&#21709;&#65292;&#25910;&#20837;&#36127;&#38754;&#20914;&#20987;&#23545;&#28040;&#36153;&#30340;&#20256;&#23548;&#29575;&#22823;&#20110;&#27491;&#38754;&#20914;&#20987;&#12290;</title><link>http://arxiv.org/abs/2306.13208</link><description>&lt;p&gt;
&#22312;&#23614;&#37096;&#25910;&#20837;&#39118;&#38505;&#30340;&#23384;&#22312;&#19979;&#65292;&#28040;&#36153;&#37096;&#20998;&#20445;&#38505;
&lt;/p&gt;
&lt;p&gt;
Consumption Partial Insurance in the Presence of Tail Income Risk. (arXiv:2306.13208v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.13208
&lt;/p&gt;
&lt;p&gt;
&#35813;&#30740;&#31350;&#27979;&#37327;&#20102;&#25910;&#20837;&#20914;&#20987;&#23545;&#28040;&#36153;&#20445;&#38505;&#30340;&#24433;&#21709;&#31243;&#24230;&#65292;&#35777;&#23454;&#23614;&#37096;&#25910;&#20837;&#39118;&#38505;&#23545;&#28040;&#36153;&#20855;&#26377;&#37325;&#35201;&#24433;&#21709;&#65292;&#25910;&#20837;&#36127;&#38754;&#20914;&#20987;&#23545;&#28040;&#36153;&#30340;&#20256;&#23548;&#29575;&#22823;&#20110;&#27491;&#38754;&#20914;&#20987;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#36890;&#36807;&#32771;&#34385;&#25910;&#20837;&#20998;&#24067;&#39640;&#38454;&#30697;&#30340;&#24433;&#21709;&#65292;&#34913;&#37327;&#20102;&#25910;&#20837;&#20914;&#20987;&#23545;&#28040;&#36153;&#20445;&#38505;&#30340;&#24433;&#21709;&#31243;&#24230;&#12290;&#25105;&#20204;&#23548;&#20986;&#20102;&#19968;&#20010;&#38750;&#32447;&#24615;&#28040;&#36153;&#20989;&#25968;&#65292;&#20854;&#20013;&#20445;&#38505;&#31243;&#24230;&#38543;&#30528;&#25910;&#20837;&#20914;&#20987;&#30340;&#31526;&#21495;&#21644;&#22823;&#23567;&#32780;&#21464;&#21270;&#12290;&#21033;&#29992;PSID&#25968;&#25454;&#65292;&#25105;&#20204;&#20272;&#35745;&#20102;&#22351;&#30340;&#30456;&#23545;&#20110;&#22909;&#30340;&#27704;&#20037;&#24615;&#20914;&#20987;&#30340;&#38750;&#23545;&#31216;&#20256;&#23548;&#29575;-- 3 sigma&#36127;&#20914;&#20987;&#30340;&#30340;17%&#20256;&#23548;&#21040;&#28040;&#36153;&#65292;&#32780;&#30456;&#21516;&#22823;&#23567;&#30340;&#27491;&#20914;&#20987;&#21482;&#26377;9%&#20256;&#23548;&#21040;&#28040;&#36153;-- &#38543;&#30528;&#20914;&#20987;&#24694;&#21270;&#65292;&#20256;&#23548;&#29575;&#22686;&#21152;&#12290;&#25105;&#20204;&#30340;&#32467;&#26524;&#19982;&#23545;&#20551;&#24819;&#20107;&#20214;&#28040;&#36153;&#21453;&#24212;&#30340;&#35843;&#26597;&#19968;&#33268;&#65292;&#24182;&#34920;&#26126;&#23614;&#37096;&#25910;&#20837;&#39118;&#38505;&#23545;&#28040;&#36153;&#20855;&#26377;&#37325;&#35201;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
We measure the extent of consumption insurance to income shocks accounting for high-order moments of the income distribution. We derive a nonlinear consumption function, in which the extent of insurance varies with the sign and magnitude of income shocks. Using PSID data, we estimate an asymmetric pass-through of bad versus good permanent shocks -- 17% of a 3 sigma negative shock transmits to consumption compared to 9% of an equal-sized positive shock -- and the pass-through increases as the shock worsens. Our results are consistent with surveys of consumption responses to hypothetical events and suggest that tail income risk matters substantially for consumption.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#22312;&#39118;&#38505;&#25935;&#24863;&#30340;&#22343;&#22330;&#21338;&#24328;&#20013;&#24341;&#20837;&#20102;&#19968;&#20010;&#20027;&#35201;&#20195;&#29702;&#65292;&#19982;&#20247;&#22810;&#27425;&#35201;&#20195;&#29702;&#30456;&#20114;&#20316;&#29992;&#65292;&#23545;&#27425;&#35201;&#20195;&#29702;&#20135;&#29983;&#37325;&#22823;&#24433;&#21709;&#65292;&#20026;&#39118;&#38505;&#25935;&#24863;&#29702;&#35770;&#30340;&#36827;&#19968;&#27493;&#21457;&#23637;&#25552;&#20379;&#20102;&#24605;&#36335;&#12290;</title><link>http://arxiv.org/abs/2305.15364</link><description>&lt;p&gt;
LQG&#39118;&#38505;&#25935;&#24863;&#22343;&#22330;&#21338;&#24328;&#20013;&#30340;&#20027;&#35201;&#20195;&#29702;&#21830;&#65306;&#19968;&#31181;&#21464;&#20998;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
LQG Risk-Sensitive Mean Field Games with a Major Agent: A Variational Approach. (arXiv:2305.15364v1 [math.OC])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.15364
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#22312;&#39118;&#38505;&#25935;&#24863;&#30340;&#22343;&#22330;&#21338;&#24328;&#20013;&#24341;&#20837;&#20102;&#19968;&#20010;&#20027;&#35201;&#20195;&#29702;&#65292;&#19982;&#20247;&#22810;&#27425;&#35201;&#20195;&#29702;&#30456;&#20114;&#20316;&#29992;&#65292;&#23545;&#27425;&#35201;&#20195;&#29702;&#20135;&#29983;&#37325;&#22823;&#24433;&#21709;&#65292;&#20026;&#39118;&#38505;&#25935;&#24863;&#29702;&#35770;&#30340;&#36827;&#19968;&#27493;&#21457;&#23637;&#25552;&#20379;&#20102;&#24605;&#36335;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#39118;&#38505;&#25935;&#24863;&#22312;&#37329;&#34701;&#21644;&#32463;&#27982;&#30740;&#31350;&#20013;&#25198;&#28436;&#37325;&#35201;&#35282;&#33394;&#65292;&#39118;&#38505;&#20013;&#24615;&#27169;&#22411;&#26080;&#27861;&#25429;&#25417;&#24182;&#35777;&#26126;&#29616;&#23454;&#20013;&#35266;&#23519;&#21040;&#30340;&#25152;&#26377;&#32463;&#27982;&#34892;&#20026;&#12290;&#26368;&#36817;&#21457;&#23637;&#20102;&#39118;&#38505;&#25935;&#24863;&#22343;&#22330;&#21338;&#24328;&#29702;&#35770;&#65292;&#29992;&#20110;&#23384;&#22312;&#22823;&#37327;&#19981;&#21487;&#21306;&#20998;&#12289;&#28176;&#36817;&#21487;&#24573;&#30053;&#21644;&#24322;&#36136;&#30340;&#39118;&#38505;&#25935;&#24863;&#29609;&#23478;&#36890;&#36807;&#20154;&#21475;&#29366;&#24577;&#32463;&#39564;&#20998;&#24067;&#30456;&#32806;&#21512;&#30340;&#31995;&#32479;&#12290;&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#23558;&#32447;&#24615;&#20108;&#27425;&#39640;&#26031;&#39118;&#38505;&#25935;&#24863;&#22343;&#22330;&#21338;&#24328;&#29702;&#35770;&#25193;&#23637;&#21040;&#23384;&#22312;&#19968;&#20010;&#20027;&#35201;&#20195;&#29702;&#21644;&#22823;&#37327;&#27425;&#35201;&#20195;&#29702;&#30340;&#35774;&#32622;&#20013;&#12290;&#20027;&#35201;&#20195;&#29702;&#23545;&#27599;&#20010;&#27425;&#35201;&#20195;&#29702;&#20135;&#29983;&#37325;&#22823;&#24433;&#21709;&#65292;&#24182;&#19988;&#20854;&#24433;&#21709;&#19981;&#20250;&#38543;&#30528;&#27425;&#35201;&#20195;&#29702;&#25968;&#37327;&#30340;&#22686;&#21152;&#32780;&#23849;&#28291;&#12290;&#27599;&#20010;&#20195;&#29702;&#37117;&#21463;&#21040;&#20855;&#26377;&#25351;&#25968;-&#31215;&#20998;&#20108;&#27425;&#20195;&#20215;&#20989;&#25968;&#30340;&#32447;&#24615;&#21160;&#24577;&#24433;&#21709;&#12290;&#27492;&#22806;&#65292;&#25152;&#26377;&#20195;&#29702;&#36890;&#36807;&#27425;&#35201;&#20195;&#29702;&#30340;&#24179;&#22343;&#29366;&#24577;&#65288;&#25152;&#35859;&#30340;&#32463;&#39564;&#24179;&#22343;&#22330;&#65289;&#21644;&#20027;&#35201;&#20195;&#29702;&#30340;&#29366;&#24577;&#30456;&#20114;&#20316;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;
Risk sensitivity plays an important role in the study of finance and economics as risk-neutral models cannot capture and justify all economic behaviors observed in reality. Risk-sensitive mean field game theory was developed recently for systems where there exists a large number of indistinguishable, asymptotically negligible and heterogeneous risk-sensitive players, who are coupled via the empirical distribution of state across population. In this work, we extend the theory of Linear Quadratic Gaussian risk-sensitive mean-field games to the setup where there exists one major agent as well as a large number of minor agents. The major agent has a significant impact on each minor agent and its impact does not collapse with the increase in the number of minor agents. Each agent is subject to linear dynamics with an exponential-of-integral quadratic cost functional. Moreover, all agents interact via the average state of minor agents (so-called empirical mean field) and the major agent's st
&lt;/p&gt;</description></item></channel></rss>