<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#23558;&#24378;&#21270;&#23398;&#20064;&#24212;&#29992;&#20110;&#26399;&#26435;&#23450;&#20215;&#21644;&#23545;&#20914;&#30340;&#26041;&#27861;&#65292;&#24182;&#20171;&#32461;&#20102;Q&#23398;&#20064;Black Scholes&#26041;&#27861;&#12290;&#35813;&#26041;&#27861;&#33021;&#22815;&#20197;&#38750;&#27169;&#22411;&#21644;&#25968;&#25454;&#39537;&#21160;&#30340;&#26041;&#24335;&#36827;&#34892;&#26399;&#26435;&#23450;&#20215;&#21644;&#23545;&#20914;&#65292;&#24182;&#22312;&#19981;&#21516;&#29366;&#24577;&#21464;&#37327;&#21644;&#22330;&#26223;&#19979;&#34920;&#29616;&#20986;&#31283;&#20581;&#30340;&#24615;&#33021;&#12290;</title><link>http://arxiv.org/abs/2310.04336</link><description>&lt;p&gt;
&#23558;&#24378;&#21270;&#23398;&#20064;&#24212;&#29992;&#20110;&#26399;&#26435;&#23450;&#20215;&#21644;&#23545;&#20914;&#30340;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Applying Reinforcement Learning to Option Pricing and Hedging. (arXiv:2310.04336v1 [q-fin.CP])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.04336
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#30740;&#31350;&#20102;&#23558;&#24378;&#21270;&#23398;&#20064;&#24212;&#29992;&#20110;&#26399;&#26435;&#23450;&#20215;&#21644;&#23545;&#20914;&#30340;&#26041;&#27861;&#65292;&#24182;&#20171;&#32461;&#20102;Q&#23398;&#20064;Black Scholes&#26041;&#27861;&#12290;&#35813;&#26041;&#27861;&#33021;&#22815;&#20197;&#38750;&#27169;&#22411;&#21644;&#25968;&#25454;&#39537;&#21160;&#30340;&#26041;&#24335;&#36827;&#34892;&#26399;&#26435;&#23450;&#20215;&#21644;&#23545;&#20914;&#65292;&#24182;&#22312;&#19981;&#21516;&#29366;&#24577;&#21464;&#37327;&#21644;&#22330;&#26223;&#19979;&#34920;&#29616;&#20986;&#31283;&#20581;&#30340;&#24615;&#33021;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#27010;&#36848;&#20102;&#36817;&#24180;&#26469;&#22312;&#37329;&#34701;&#20135;&#21697;&#23450;&#20215;&#21644;&#23545;&#20914;&#20013;&#24212;&#29992;&#24378;&#21270;&#23398;&#20064;&#30340;&#26368;&#26032;&#36827;&#23637;&#65292;&#37325;&#28857;&#20171;&#32461;&#20102;&#30001;Halperin&#65288;2017&#65289;&#25552;&#20986;&#30340;Q&#23398;&#20064;Black Scholes&#26041;&#27861;&#30340;&#35814;&#32454;&#35299;&#37322;&#12290;&#36825;&#31181;&#24378;&#21270;&#23398;&#20064;&#26041;&#27861;&#23558;&#20256;&#32479;&#30340;Black and Scholes&#65288;1973&#65289;&#27169;&#22411;&#19982;&#26032;&#39062;&#30340;&#20154;&#24037;&#26234;&#33021;&#31639;&#27861;&#30456;&#32467;&#21512;&#65292;&#20197;&#23436;&#20840;&#30340;&#38750;&#27169;&#22411;&#21644;&#25968;&#25454;&#39537;&#21160;&#30340;&#26041;&#24335;&#36827;&#34892;&#26399;&#26435;&#23450;&#20215;&#21644;&#23545;&#20914;&#12290;&#26412;&#25991;&#36824;&#30740;&#31350;&#20102;&#35813;&#31639;&#27861;&#22312;&#19981;&#21516;&#29366;&#24577;&#21464;&#37327;&#21644;&#22330;&#26223;&#19979;&#23545;&#27431;&#24335;&#30475;&#36300;&#26399;&#26435;&#30340;&#34920;&#29616;&#12290;&#32467;&#26524;&#34920;&#26126;&#65292;&#35813;&#27169;&#22411;&#22312;&#19981;&#21516;&#27874;&#21160;&#29575;&#21644;&#23545;&#20914;&#39057;&#29575;&#27700;&#24179;&#19979;&#20855;&#26377;&#36739;&#39640;&#30340;&#20934;&#30830;&#24615;&#12290;&#27492;&#22806;&#65292;&#35813;&#26041;&#27861;&#22312;&#19981;&#21516;&#26399;&#26435;&#24179;&#20215;&#28857;&#30340;&#27700;&#24179;&#19978;&#34920;&#29616;&#20986;&#31283;&#20581;&#30340;&#24615;&#33021;&#12290;&#26368;&#21518;&#65292;&#35813;&#31639;&#27861;&#21253;&#25324;&#27604;&#20363;&#20132;&#26131;&#25104;&#26412;&#65292;&#34920;&#26126;&#19981;&#21516;&#29366;&#24577;&#21464;&#37327;&#30340;&#32479;&#35745;&#29305;&#24615;&#23545;&#25910;&#30410;&#21644;&#25439;&#22833;&#20135;&#29983;&#19981;&#21516;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
This thesis provides an overview of the recent advances in reinforcement learning in pricing and hedging financial instruments, with a primary focus on a detailed explanation of the Q-Learning Black Scholes approach, introduced by Halperin (2017). This reinforcement learning approach bridges the traditional Black and Scholes (1973) model with novel artificial intelligence algorithms, enabling option pricing and hedging in a completely model-free and data-driven way. This paper also explores the algorithm's performance under different state variables and scenarios for a European put option. The results reveal that the model is an accurate estimator under different levels of volatility and hedging frequency. Moreover, this method exhibits robust performance across various levels of option's moneyness. Lastly, the algorithm incorporates proportional transaction costs, indicating diverse impacts on profit and loss, affected by different statistical properties of the state variables.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#36890;&#36807;&#30740;&#31350;&#32654;&#22269;&#12289;&#33521;&#22269;&#12289;&#29790;&#20856;&#12289;&#24847;&#22823;&#21033;&#12289;&#27874;&#20848;&#21644;&#20044;&#24178;&#36798;&#30340;&#26696;&#20363;&#65292;&#32467;&#21512;&#25512;&#21368;&#36131;&#20219;&#25991;&#29486;&#65292;&#21457;&#29616;&#25919;&#24220;&#21019;&#24314;&#20020;&#26102;&#31185;&#23398;&#21672;&#35810;&#26426;&#26500;&#30340;&#30446;&#30340;&#26159;&#20026;&#20102;&#20026;&#19981;&#21463;&#27426;&#36814;&#30340;&#25919;&#31574;&#24320;&#33073;&#36131;&#20219;&#65292;ahSABs&#25104;&#21592;&#36890;&#24120;&#20195;&#34920;&#20102;&#19968;&#20010;&#29421;&#31364;&#30340;&#35266;&#28857;&#33539;&#22260;&#12290;&#23545;&#20110;&#27809;&#26377;&#21019;&#24314;ahSABs&#30340;&#29790;&#20856;&#30340;&#24322;&#24120;&#26696;&#20363;&#65292;&#36827;&#19968;&#27493;&#35777;&#23454;&#20102;&#36825;&#19968;&#21407;&#21017;&#12290;&#25919;&#31574;&#25512;&#35770;&#26159;&#65292;&#24212;&#35813;&#36890;&#36807;&#31435;&#27861;&#26426;&#26500;&#23545;ahSABs&#25104;&#21592;&#36827;&#34892;&#23457;&#26680;&#65292;&#20197;&#30830;&#20445;&#24191;&#27867;&#30340;&#25104;&#21592;&#20195;&#34920;&#24615;&#12290;</title><link>http://arxiv.org/abs/2310.04312</link><description>&lt;p&gt;
&#23450;&#21046;&#26367;&#32618;&#32650;&#65306;&#31185;&#23398;&#21672;&#35810;&#26426;&#26500;&#19982;&#26032;&#20896;&#30123;&#24773;&#21450;&#20854;&#21518;&#32493;&#20013;&#30340;&#25512;&#21368;&#36131;&#20219;&#65288;arXiv:2310.04312v1 [econ.GN]&#65289;
&lt;/p&gt;
&lt;p&gt;
Bespoke scapegoats: Scientific advisory bodies and blame avoidance in the Covid-19 pandemic and beyond. (arXiv:2310.04312v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.04312
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36890;&#36807;&#30740;&#31350;&#32654;&#22269;&#12289;&#33521;&#22269;&#12289;&#29790;&#20856;&#12289;&#24847;&#22823;&#21033;&#12289;&#27874;&#20848;&#21644;&#20044;&#24178;&#36798;&#30340;&#26696;&#20363;&#65292;&#32467;&#21512;&#25512;&#21368;&#36131;&#20219;&#25991;&#29486;&#65292;&#21457;&#29616;&#25919;&#24220;&#21019;&#24314;&#20020;&#26102;&#31185;&#23398;&#21672;&#35810;&#26426;&#26500;&#30340;&#30446;&#30340;&#26159;&#20026;&#20102;&#20026;&#19981;&#21463;&#27426;&#36814;&#30340;&#25919;&#31574;&#24320;&#33073;&#36131;&#20219;&#65292;ahSABs&#25104;&#21592;&#36890;&#24120;&#20195;&#34920;&#20102;&#19968;&#20010;&#29421;&#31364;&#30340;&#35266;&#28857;&#33539;&#22260;&#12290;&#23545;&#20110;&#27809;&#26377;&#21019;&#24314;ahSABs&#30340;&#29790;&#20856;&#30340;&#24322;&#24120;&#26696;&#20363;&#65292;&#36827;&#19968;&#27493;&#35777;&#23454;&#20102;&#36825;&#19968;&#21407;&#21017;&#12290;&#25919;&#31574;&#25512;&#35770;&#26159;&#65292;&#24212;&#35813;&#36890;&#36807;&#31435;&#27861;&#26426;&#26500;&#23545;ahSABs&#25104;&#21592;&#36827;&#34892;&#23457;&#26680;&#65292;&#20197;&#30830;&#20445;&#24191;&#27867;&#30340;&#25104;&#21592;&#20195;&#34920;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#23398;&#32773;&#20204;&#27809;&#26377;&#25506;&#31350;&#20026;&#20160;&#20040;&#36825;&#20040;&#22810;&#25919;&#24220;&#22312;&#24212;&#23545;&#26032;&#20896;&#30123;&#24773;&#26102;&#21019;&#24314;&#20102;&#20020;&#26102;&#31185;&#23398;&#21672;&#35810;&#26426;&#26500;&#65288;ahSABs&#65289;&#32780;&#19981;&#20381;&#36182;&#29616;&#26377;&#30340;&#20844;&#20849;&#21355;&#29983;&#22522;&#30784;&#35774;&#26045;&#12290;&#25105;&#20204;&#36890;&#36807;&#23545;&#32654;&#22269;&#12289;&#33521;&#22269;&#12289;&#29790;&#20856;&#12289;&#24847;&#22823;&#21033;&#12289;&#27874;&#20848;&#21644;&#20044;&#24178;&#36798;&#30340;&#26696;&#20363;&#30740;&#31350;&#20197;&#21450;&#23545;&#25512;&#21368;&#36131;&#20219;&#25991;&#29486;&#30340;&#20511;&#37492;&#65292;&#22238;&#31572;&#20102;&#36825;&#20010;&#34987;&#24573;&#35270;&#30340;&#38382;&#39064;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;ahSABs&#30340;&#21019;&#24314;&#26159;&#20026;&#20102;&#20026;&#19981;&#21463;&#27426;&#36814;&#30340;&#25919;&#31574;&#24320;&#33073;&#36131;&#20219;&#65292;&#20107;&#24773;&#20986;&#38382;&#39064;&#26102;&#25104;&#20026;&#26367;&#32618;&#32650;&#12290;&#22240;&#27492;&#65292;ahSABs&#30340;&#25104;&#21592;&#36890;&#24120;&#20195;&#34920;&#20102;&#19968;&#20010;&#29421;&#31364;&#30340;&#35266;&#28857;&#33539;&#22260;&#12290;ahSABs&#26159;&#19968;&#20010;&#22909;&#30340;&#26367;&#32618;&#32650;&#65292;&#22240;&#20026;&#23427;&#23545;&#20943;&#23569;&#25919;&#24220;&#30340;&#33258;&#30001;&#35009;&#37327;&#26435;&#20960;&#20046;&#27809;&#26377;&#24110;&#21161;&#65292;&#24182;&#19988;&#22312;&#36716;&#23233;&#36131;&#20219;&#32473;&#25919;&#24220;&#26041;&#38754;&#33021;&#21147;&#26377;&#38480;&#12290;&#25105;&#20204;&#23545;&#29790;&#20856;&#27809;&#26377;&#21019;&#24314;ahSABs&#30340;&#24322;&#24120;&#26696;&#20363;&#30340;&#35299;&#37322;&#36827;&#19968;&#27493;&#35777;&#23454;&#20102;&#25105;&#20204;&#30340;&#19968;&#33324;&#21407;&#21017;&#12290;&#25105;&#20204;&#24471;&#20986;&#30340;&#25919;&#31574;&#25512;&#35770;&#26159;&#65292;&#24212;&#35813;&#36890;&#36807;&#31435;&#27861;&#26426;&#26500;&#23545;ahSABs&#25104;&#21592;&#36827;&#34892;&#23457;&#26680;&#65292;&#20197;&#30830;&#20445;&#24191;&#27867;&#30340;&#25104;&#21592;&#20195;&#34920;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Scholars have not asked why so many governments created ad hoc scientific advisory bodies (ahSABs) to address the Covid-19 pandemic instead of relying on existing public health infrastructure. We address this neglected question with an exploratory study of the US, UK, Sweden, Italy, Poland, and Uganda. Drawing on our case studies and the blame-avoidance literature, we find that ahSABs are created to excuse unpopular policies and take the blame should things go wrong. Thus, membership typically represents a narrow range of perspectives. An ahSAB is a good scapegoat because it does little to reduce government discretion and has limited ability to deflect blame back to government. Our explanation of our deviant case of Sweden, that did not create and ahSAB, reinforces our general principles. We draw the policy inference that ahSAB membership should be vetted by the legislature to ensure broad membership.
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;MIS&#30340;&#22810;&#34892;&#19994;&#27010;&#29575;&#27169;&#22411;&#65292;&#36890;&#36807;&#20351;&#29992;&#20027;&#39064;&#24314;&#27169;&#23558;&#20225;&#19994;&#28789;&#27963;&#22320;&#20998;&#37197;&#21040;&#23613;&#21487;&#33021;&#22810;&#30340;&#34892;&#19994;&#20013;&#65292;&#20811;&#26381;&#20102;&#24403;&#21069;&#34892;&#19994;&#20998;&#31867;&#26631;&#20934; GICS &#30340;&#23616;&#38480;&#24615;&#12290;</title><link>http://arxiv.org/abs/2310.04280</link><description>&lt;p&gt;
&#22810;&#34892;&#19994;Simplex&#65306;GICS&#30340;&#27010;&#29575;&#25193;&#23637;
&lt;/p&gt;
&lt;p&gt;
Multi-Industry Simplex : A Probabilistic Extension of GICS. (arXiv:2310.04280v1 [q-fin.PM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.04280
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21517;&#20026;MIS&#30340;&#22810;&#34892;&#19994;&#27010;&#29575;&#27169;&#22411;&#65292;&#36890;&#36807;&#20351;&#29992;&#20027;&#39064;&#24314;&#27169;&#23558;&#20225;&#19994;&#28789;&#27963;&#22320;&#20998;&#37197;&#21040;&#23613;&#21487;&#33021;&#22810;&#30340;&#34892;&#19994;&#20013;&#65292;&#20811;&#26381;&#20102;&#24403;&#21069;&#34892;&#19994;&#20998;&#31867;&#26631;&#20934; GICS &#30340;&#23616;&#38480;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20934;&#30830;&#30340;&#34892;&#19994;&#20998;&#31867;&#26159;&#35768;&#22810;&#36164;&#20135;&#31649;&#29702;&#24212;&#29992;&#31243;&#24207;&#30340;&#37325;&#35201;&#24037;&#20855;&#12290;&#23613;&#31649;&#24403;&#21069;&#30340;&#34892;&#19994;&#40644;&#37329;&#26631;&#20934;GICS&#65288;&#20840;&#29699;&#34892;&#19994;&#20998;&#31867;&#26631;&#20934;&#65289;&#22312;&#35768;&#22810;&#29615;&#22659;&#19979;&#24050;&#34987;&#35777;&#26126;&#26159;&#21487;&#38752;&#21644;&#31283;&#20581;&#30340;&#65292;&#20294;&#23427;&#23384;&#22312;&#19968;&#20123;&#19981;&#21487;&#24573;&#35270;&#30340;&#23616;&#38480;&#24615;&#12290;&#20174;&#26681;&#26412;&#19978;&#35828;&#65292;GICS&#26159;&#19968;&#20010;&#21333;&#19968;&#34892;&#19994;&#27169;&#22411;&#65292;&#27599;&#20010;&#20225;&#19994;&#37117;&#34987;&#20998;&#37197;&#21040;&#19968;&#20010;&#32452;&#65292;&#19981;&#31649;&#35813;&#20225;&#19994;&#30340;&#22810;&#26679;&#21270;&#31243;&#24230;&#22914;&#20309;&#12290;&#36825;&#31181;&#26041;&#27861;&#22312;&#20687;&#20122;&#39532;&#36874;&#36825;&#26679;&#30340;&#22823;&#22411;&#20225;&#19994;&#20013;&#22833;&#25928;&#65292;&#36825;&#20123;&#20225;&#19994;&#30340;&#39118;&#38505;&#25950;&#21475;&#20998;&#24067;&#22312;&#22810;&#20010;&#37096;&#38376;&#12290;&#25105;&#20204;&#35797;&#22270;&#36890;&#36807;&#24320;&#21457;MIS&#65288;Multi-Industry Simplex&#65289;&#26469;&#20811;&#26381;&#36825;&#20123;&#23616;&#38480;&#24615;&#65292;&#36825;&#26159;&#19968;&#20010;&#27010;&#29575;&#27169;&#22411;&#65292;&#21487;&#20197;&#26681;&#25454;&#25968;&#25454;&#28789;&#27963;&#22320;&#23558;&#20225;&#19994;&#20998;&#37197;&#32473;&#23613;&#21487;&#33021;&#22810;&#30340;&#34892;&#19994;&#12290;&#29305;&#21035;&#26159;&#65292;&#25105;&#20204;&#21033;&#29992;&#20027;&#39064;&#24314;&#27169;&#65292;&#21363;&#33258;&#28982;&#35821;&#35328;&#22788;&#29702;&#26041;&#27861;&#65292;&#21033;&#29992;&#19994;&#21153;&#25551;&#36848;&#25552;&#21462;&#21644;&#35782;&#21035;&#30456;&#24212;&#30340;&#34892;&#19994;&#12290;&#27599;&#20010;&#35782;&#21035;&#30340;&#34892;&#19994;&#37117;&#38468;&#24102;&#30528;&#19968;&#20010;&#30456;&#20851;&#27010;&#29575;&#65292;&#21487;&#20197;&#36827;&#34892;&#39640;&#24230;&#35299;&#37322;&#12290;
&lt;/p&gt;
&lt;p&gt;
Accurate industry classification is a critical tool for many asset management applications. While the current industry gold-standard GICS (Global Industry Classification Standard) has proven to be reliable and robust in many settings, it has limitations that cannot be ignored. Fundamentally, GICS is a single-industry model, in which every firm is assigned to exactly one group regardless of how diversified that firm may be. This approach breaks down for large conglomerates like Amazon, which have risk exposure spread out across multiple sectors. We attempt to overcome these limitations by developing MIS (Multi-Industry Simplex), a probabilistic model that can flexibly assign a firm to as many industries as can be supported by the data. In particular, we utilize topic modeling, an natural language processing approach that utilizes business descriptions to extract and identify corresponding industries. Each identified industry comes with a relevance probability, allowing for high interp
&lt;/p&gt;</description></item><item><title>&#36825;&#39033;&#30740;&#31350;&#20171;&#32461;&#20102;&#19968;&#31181;&#26032;&#30340;&#21152;&#26435;&#20215;&#26684;&#25351;&#25968;S-FCPIw&#65292;&#21033;&#29992;&#20013;&#22269;&#25195;&#25551;&#20202;&#22823;&#25968;&#25454;&#26500;&#24314;&#65292;&#33021;&#26356;&#39057;&#32321;&#21644;&#26356;&#20016;&#23500;&#22320;&#21453;&#26144;&#21830;&#21697;&#20215;&#26684;&#30340;&#21464;&#21160;&#65292;&#19982;CPI&#21644;&#39135;&#21697;CPI&#23384;&#22312;&#26174;&#33879;&#20851;&#31995;&#12290;&#25195;&#25551;&#20202;&#22823;&#25968;&#25454;&#21487;&#20197;&#34917;&#20805;&#20013;&#22269;&#20256;&#32479;&#30340;CPI&#35745;&#31639;&#26041;&#27861;&#65292;&#24182;&#25552;&#20379;&#26032;&#30340;&#23439;&#35266;&#32463;&#27982;&#36235;&#21183;&#21644;&#36890;&#32960;&#39044;&#27979;&#35265;&#35299;&#12290;</title><link>http://arxiv.org/abs/2310.04242</link><description>&lt;p&gt;
&#20013;&#22269;&#22522;&#20110;&#25195;&#25551;&#20202;&#22823;&#25968;&#25454;&#26500;&#24314;&#30340;&#26032;&#21152;&#26435;&#39135;&#21697;CPI
&lt;/p&gt;
&lt;p&gt;
A New Weighted Food CPI from Scanner Big Data in China. (arXiv:2310.04242v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.04242
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#30740;&#31350;&#20171;&#32461;&#20102;&#19968;&#31181;&#26032;&#30340;&#21152;&#26435;&#20215;&#26684;&#25351;&#25968;S-FCPIw&#65292;&#21033;&#29992;&#20013;&#22269;&#25195;&#25551;&#20202;&#22823;&#25968;&#25454;&#26500;&#24314;&#65292;&#33021;&#26356;&#39057;&#32321;&#21644;&#26356;&#20016;&#23500;&#22320;&#21453;&#26144;&#21830;&#21697;&#20215;&#26684;&#30340;&#21464;&#21160;&#65292;&#19982;CPI&#21644;&#39135;&#21697;CPI&#23384;&#22312;&#26174;&#33879;&#20851;&#31995;&#12290;&#25195;&#25551;&#20202;&#22823;&#25968;&#25454;&#21487;&#20197;&#34917;&#20805;&#20013;&#22269;&#20256;&#32479;&#30340;CPI&#35745;&#31639;&#26041;&#27861;&#65292;&#24182;&#25552;&#20379;&#26032;&#30340;&#23439;&#35266;&#32463;&#27982;&#36235;&#21183;&#21644;&#36890;&#32960;&#39044;&#27979;&#35265;&#35299;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25195;&#25551;&#20202;&#22823;&#25968;&#25454;&#26377;&#28508;&#21147;&#26500;&#24314;&#28040;&#36153;&#20215;&#26684;&#25351;&#25968;&#65288;CPI&#65289;&#12290;&#26412;&#30740;&#31350;&#20171;&#32461;&#20102;&#19968;&#31181;&#26032;&#30340;&#21152;&#26435;&#20215;&#26684;&#25351;&#25968;S-FCPIw&#65292;&#35813;&#25351;&#25968;&#21033;&#29992;&#20013;&#22269;&#38646;&#21806;&#38144;&#21806;&#30340;&#25195;&#25551;&#20202;&#22823;&#25968;&#25454;&#26500;&#24314;&#12290;&#25105;&#20204;&#35299;&#20915;&#20102;&#20013;&#22269;CPI&#23384;&#22312;&#30340;&#39640;&#25104;&#26412;&#21644;&#21450;&#26102;&#24615;&#21457;&#24067;&#26041;&#38754;&#30340;&#23616;&#38480;&#24615;&#65292;&#24182;&#36890;&#36807;&#19982;&#29616;&#26377;&#20215;&#26684;&#25351;&#25968;&#30340;&#27604;&#36739;&#35777;&#26126;&#20102;S-FCPIw&#30340;&#21487;&#38752;&#24615;&#12290;S-FCPIw&#19981;&#20165;&#33021;&#26356;&#39057;&#32321;&#21644;&#26356;&#20016;&#23500;&#22320;&#21453;&#26144;&#21830;&#21697;&#20215;&#26684;&#30340;&#21464;&#21160;&#65292;&#32780;&#19988;&#20998;&#26512;&#32467;&#26524;&#26174;&#31034;S-FCPIw&#19982;CPI&#21644;&#39135;&#21697;CPI&#23384;&#22312;&#26174;&#33879;&#19988;&#24378;&#28872;&#30340;&#20851;&#31995;&#12290;&#30740;&#31350;&#32467;&#26524;&#34920;&#26126;&#65292;&#25195;&#25551;&#20202;&#22823;&#25968;&#25454;&#21487;&#20197;&#34917;&#20805;&#20013;&#22269;&#20256;&#32479;&#30340;CPI&#35745;&#31639;&#26041;&#27861;&#65292;&#24182;&#20026;&#23439;&#35266;&#32463;&#27982;&#36235;&#21183;&#21644;&#36890;&#32960;&#39044;&#27979;&#25552;&#20379;&#26032;&#30340;&#35265;&#35299;&#12290;&#25105;&#20204;&#24050;&#32463;&#20844;&#24320;&#20102;S-FCPIw&#24182;&#19988;&#27599;&#21608;&#26356;&#26032;&#65292;&#20197;&#20419;&#36827;&#35813;&#39046;&#22495;&#30340;&#36827;&#19968;&#27493;&#30740;&#31350;&#12290;
&lt;/p&gt;
&lt;p&gt;
Scanner big data has potential to construct Consumer Price Index (CPI). The study introduces a new weighted price index called S-FCPIw, which is constructed using scanner big data from retail sales in China. We address the limitations of China's CPI especially for its high cost and untimely release, and demonstrate the reliability of S-FCPIw by comparing it with existing price indices. S-FCPIw can not only reflect the changes of goods prices in higher frequency and richer dimension, and the analysis results show that S-FCPIw has a significant and strong relationship with CPI and Food CPI. The findings suggest that scanner big data can supplement traditional CPI calculations in China and provide new insights into macroeconomic trends and inflation prediction. We have made S-FCPIw publicly available and update it on a weekly basis to facilitate further study in this field.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#36817;&#20284;&#35745;&#31639;&#20984;&#21338;&#24328;&#20013;&#30340;&#32435;&#20160;&#22343;&#34913;&#35299;&#38598;&#21512;&#65292;&#35777;&#26126;&#20102;&#32435;&#20160;&#22343;&#34913;&#35299;&#38598;&#21512;&#21487;&#20197;&#31561;&#20215;&#22320;&#34920;&#31034;&#20026;&#22810;&#20010;&#22810;&#30446;&#26631;&#38382;&#39064;&#30340;&#24085;&#32047;&#25176;&#26368;&#20248;&#28857;&#30340;&#20132;&#38598;&#12290;</title><link>http://arxiv.org/abs/2310.04176</link><description>&lt;p&gt;
&#36817;&#20284;&#35745;&#31639;&#20984;&#21338;&#24328;&#20013;&#32435;&#20160;&#22343;&#34913;&#35299;&#38598;&#21512;
&lt;/p&gt;
&lt;p&gt;
Approximating the set of Nash equilibria for convex games. (arXiv:2310.04176v1 [math.OC])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.04176
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#36817;&#20284;&#35745;&#31639;&#20984;&#21338;&#24328;&#20013;&#30340;&#32435;&#20160;&#22343;&#34913;&#35299;&#38598;&#21512;&#65292;&#35777;&#26126;&#20102;&#32435;&#20160;&#22343;&#34913;&#35299;&#38598;&#21512;&#21487;&#20197;&#31561;&#20215;&#22320;&#34920;&#31034;&#20026;&#22810;&#20010;&#22810;&#30446;&#26631;&#38382;&#39064;&#30340;&#24085;&#32047;&#25176;&#26368;&#20248;&#28857;&#30340;&#20132;&#38598;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;Feinstein&#21644;Rudloff&#65288;2023&#65289;&#20013;&#65292;&#20182;&#20204;&#35777;&#26126;&#20102;&#23545;&#20110;&#20219;&#24847;&#38750;&#21512;&#20316;$N$&#20154;&#21338;&#24328;&#65292;&#32435;&#20160;&#22343;&#34913;&#35299;&#38598;&#21512;&#19982;&#20855;&#26377;&#38750;&#20984;&#39034;&#24207;&#38181;&#30340;&#26576;&#20010;&#21521;&#37327;&#20248;&#21270;&#38382;&#39064;&#30340;&#24085;&#32047;&#25176;&#26368;&#20248;&#28857;&#38598;&#21512;&#26159;&#19968;&#33268;&#30340;&#12290;&#20026;&#20102;&#36991;&#20813;&#22788;&#29702;&#38750;&#20984;&#39034;&#24207;&#38181;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#23558;&#32435;&#20160;&#22343;&#34913;&#35299;&#38598;&#21512;&#31561;&#20215;&#22320;&#34920;&#31034;&#20026;$N$&#20010;&#22810;&#30446;&#26631;&#38382;&#39064;&#65288;&#21363;&#20855;&#26377;&#33258;&#28982;&#39034;&#24207;&#38181;&#65289;&#30340;&#24085;&#32047;&#25176;&#26368;&#20248;&#28857;&#30340;&#20132;&#38598;&#12290;&#30446;&#21069;&#65292;&#35745;&#31639;&#22810;&#30446;&#26631;&#38382;&#39064;&#30340;&#31934;&#30830;&#24085;&#32047;&#25176;&#26368;&#20248;&#28857;&#38598;&#21512;&#30340;&#31639;&#27861;&#20165;&#36866;&#29992;&#20110;&#32447;&#24615;&#38382;&#39064;&#30340;&#31867;&#21035;&#65292;&#36825;&#23558;&#23548;&#33268;&#36825;&#20123;&#31639;&#27861;&#21482;&#33021;&#29992;&#20110;&#35299;&#32447;&#24615;&#21338;&#24328;&#30340;&#30495;&#23454;&#32435;&#20160;&#22343;&#34913;&#38598;&#21512;&#30340;&#21487;&#33021;&#24615;&#38477;&#20302;&#12290;&#26412;&#25991;&#20013;&#65292;&#25105;&#20204;&#23558;&#32771;&#34385;&#26356;&#22823;&#31867;&#21035;&#30340;&#20984;&#21338;&#24328;&#12290;&#30001;&#20110;&#36890;&#24120;&#21482;&#33021;&#20026;&#20984;&#21521;&#37327;&#20248;&#21270;&#38382;&#39064;&#35745;&#31639;&#36817;&#20284;&#35299;&#65292;&#25105;&#20204;&#39318;&#20808;&#23637;&#31034;&#20102;&#31867;&#20284;&#20110;&#19978;&#36848;&#32467;&#26524;&#30340;&#32467;&#26524;&#65292;&#21363;$\epsilon$-&#36817;&#20284;&#32435;&#20160;&#22343;&#34913;&#35299;&#38598;&#21512;&#19982;&#38382;&#39064;&#23436;&#20840;&#30456;&#20284;&#12290;
&lt;/p&gt;
&lt;p&gt;
In Feinstein and Rudloff (2023), it was shown that the set of Nash equilibria for any non-cooperative $N$ player game coincides with the set of Pareto optimal points of a certain vector optimization problem with non-convex ordering cone. To avoid dealing with a non-convex ordering cone, an equivalent characterization of the set of Nash equilibria as the intersection of the Pareto optimal points of $N$ multi-objective problems (i.e.\ with the natural ordering cone) is proven. So far, algorithms to compute the exact set of Pareto optimal points of a multi-objective problem exist only for the class of linear problems, which reduces the possibility of finding the true set of Nash equilibria by those algorithms to linear games only.  In this paper, we will consider the larger class of convex games. As, typically, only approximate solutions can be computed for convex vector optimization problems, we first show, in total analogy to the result above, that the set of $\epsilon$-approximate Nash
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22312;&#31895;&#31961;Heston&#27169;&#22411;&#20013;&#39640;&#25928;&#19988;&#20934;&#30830;&#30340;&#27169;&#25311;&#26041;&#26696;&#65292;&#36890;&#36807;&#20302;&#32500;&#39532;&#23572;&#21487;&#22827;&#36924;&#36817;&#23454;&#29616;&#23545;&#35813;&#27169;&#22411;&#30340;&#24369;&#36924;&#36817;&#12290;&#35813;&#26041;&#26696;&#22312;&#35745;&#31639;&#25104;&#26412;&#26041;&#38754;&#20855;&#26377;&#32447;&#24615;&#22686;&#21152;&#65292;&#24182;&#34920;&#29616;&#20986;&#20108;&#38454;&#24369;&#25910;&#25947;&#24615;&#12290;&#22312;&#23545;&#22810;&#31181;&#31867;&#22411;&#26399;&#26435;&#36827;&#34892;&#30340;&#25968;&#20540;&#27979;&#35797;&#20013;&#23637;&#31034;&#20102;&#26041;&#26696;&#30340;&#20934;&#30830;&#24615;&#21644;&#25928;&#29575;&#12290;</title><link>http://arxiv.org/abs/2310.04146</link><description>&lt;p&gt;
&#20351;&#29992;&#24369;&#27169;&#25311;&#26041;&#26696;&#22312;&#31895;&#31961;Heston&#27169;&#22411;&#20013;&#36827;&#34892;&#39640;&#25928;&#30340;&#26399;&#26435;&#23450;&#20215;
&lt;/p&gt;
&lt;p&gt;
Efficient option pricing in the rough Heston model using weak simulation schemes. (arXiv:2310.04146v1 [q-fin.CP])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.04146
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22312;&#31895;&#31961;Heston&#27169;&#22411;&#20013;&#39640;&#25928;&#19988;&#20934;&#30830;&#30340;&#27169;&#25311;&#26041;&#26696;&#65292;&#36890;&#36807;&#20302;&#32500;&#39532;&#23572;&#21487;&#22827;&#36924;&#36817;&#23454;&#29616;&#23545;&#35813;&#27169;&#22411;&#30340;&#24369;&#36924;&#36817;&#12290;&#35813;&#26041;&#26696;&#22312;&#35745;&#31639;&#25104;&#26412;&#26041;&#38754;&#20855;&#26377;&#32447;&#24615;&#22686;&#21152;&#65292;&#24182;&#34920;&#29616;&#20986;&#20108;&#38454;&#24369;&#25910;&#25947;&#24615;&#12290;&#22312;&#23545;&#22810;&#31181;&#31867;&#22411;&#26399;&#26435;&#36827;&#34892;&#30340;&#25968;&#20540;&#27979;&#35797;&#20013;&#23637;&#31034;&#20102;&#26041;&#26696;&#30340;&#20934;&#30830;&#24615;&#21644;&#25928;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20379;&#20102;&#19968;&#31181;&#22312;&#26631;&#20934;&#65288;$H&gt;0$&#65289;&#21644;&#36229;&#31895;&#31961;&#65288;$H&gt;-1/2$&#65289;&#33539;&#22260;&#20869;&#23545;&#31895;&#31961;Heston&#27169;&#22411;&#36827;&#34892;&#39640;&#25928;&#32780;&#20934;&#30830;&#30340;&#27169;&#25311;&#26041;&#26696;&#12290;&#35813;&#26041;&#26696;&#22522;&#20110;&#23545;&#31895;&#31961;Heston&#36807;&#31243;&#30340;&#20302;&#32500;&#39532;&#23572;&#21487;&#22827;&#36924;&#36817;&#65292;&#24182;&#25552;&#20379;&#23545;&#31895;&#31961;Heston&#36807;&#31243;&#30340;&#24369;&#36924;&#36817;&#12290;&#25968;&#20540;&#23454;&#39564;&#34920;&#26126;&#65292;&#26032;&#26041;&#26696;&#34920;&#29616;&#20986;&#20108;&#38454;&#24369;&#25910;&#25947;&#24615;&#65292;&#32780;&#35745;&#31639;&#25104;&#26412;&#19982;&#26102;&#38388;&#27493;&#38271;&#30340;&#25968;&#37327;&#32447;&#24615;&#22686;&#21152;&#12290;&#30456;&#27604;&#20043;&#19979;&#65292;&#22522;&#20110;&#23545;&#28508;&#22312;&#38543;&#26426;Volterra&#31215;&#20998;&#30340;&#31163;&#25955;&#21270;&#30340;&#29616;&#26377;&#26041;&#26696;&#65288;&#22914;Gatheral&#30340;HQE&#26041;&#26696;&#65289;&#35745;&#31639;&#25104;&#26412;&#21576;&#20108;&#27425;&#20381;&#36182;&#20851;&#31995;&#12290;&#23545;&#26631;&#20934;&#21644;&#36335;&#24452;&#20381;&#36182;&#27431;&#24335;&#26399;&#26435;&#20197;&#21450;&#30334;&#24917;&#22823;&#26399;&#26435;&#36827;&#34892;&#30340;&#22823;&#37327;&#25968;&#20540;&#27979;&#35797;&#26174;&#31034;&#20102;&#35813;&#26041;&#27861;&#30340;&#20934;&#30830;&#24615;&#21644;&#25928;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;
We provide an efficient and accurate simulation scheme for the rough Heston model in the standard ($H&gt;0$) as well as the hyper-rough regime ($H &gt; -1/2$). The scheme is based on low-dimensional Markovian approximations of the rough Heston process derived in [Bayer and Breneis, arXiv:2309.07023], and provides weak approximation to the rough Heston process. Numerical experiments show that the new scheme exhibits second order weak convergence, while the computational cost increases linear with respect to the number of time steps. In comparison, existing schemes based on discretization of the underlying stochastic Volterra integrals such as Gatheral's HQE scheme show a quadratic dependence of the computational cost. Extensive numerical tests for standard and path-dependent European options and Bermudan options show the method's accuracy and efficiency.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21033;&#29992;&#25193;&#23637;&#21345;&#23572;&#26364;&#28388;&#27874;&#22120;&#20934;&#30830;&#20272;&#35745;&#26102;&#38388;&#21464;&#24322;&#33258;&#22238;&#24402;&#27169;&#22411;&#20013;&#24066;&#22330;&#25928;&#29575;&#36807;&#31243;&#30340;&#38544;&#34255;&#21160;&#21147;&#23398;&#30340;&#26041;&#27861;&#12290;</title><link>http://arxiv.org/abs/2310.04125</link><description>&lt;p&gt;
&#22522;&#20110;&#25193;&#23637;&#21345;&#23572;&#26364;&#28388;&#27874;&#26041;&#27861;&#30340;&#26102;&#38388;&#21464;&#24322;&#33258;&#22238;&#24402;&#27169;&#22411;&#20013;&#24066;&#22330;&#25928;&#29575;&#36807;&#31243;&#30340;&#20272;&#35745;
&lt;/p&gt;
&lt;p&gt;
Estimation of market efficiency process within time-varying autoregressive models by extended Kalman filtering approach. (arXiv:2310.04125v1 [math.OC])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.04125
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#21033;&#29992;&#25193;&#23637;&#21345;&#23572;&#26364;&#28388;&#27874;&#22120;&#20934;&#30830;&#20272;&#35745;&#26102;&#38388;&#21464;&#24322;&#33258;&#22238;&#24402;&#27169;&#22411;&#20013;&#24066;&#22330;&#25928;&#29575;&#36807;&#31243;&#30340;&#38544;&#34255;&#21160;&#21147;&#23398;&#30340;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25506;&#35752;&#20102;&#36866;&#24212;&#24615;&#24066;&#22330;&#20551;&#35774;&#65288;AMH&#65289;&#20013;&#30340;&#24369;&#24335;&#24066;&#22330;&#25928;&#29575;&#30340;&#26102;&#38388;&#21464;&#24322;&#29256;&#26412;&#12290;&#22312;&#35266;&#23519;&#21040;&#30340;&#22238;&#25253;&#24207;&#21015;&#30340;&#24207;&#21015;&#33258;&#30456;&#20851;&#20998;&#26512;&#20013;&#65292;&#24314;&#27169;&#21644;&#20272;&#35745;&#24066;&#22330;&#25928;&#29575;&#31243;&#24230;&#30340;&#26368;&#24120;&#35265;&#26041;&#27861;&#20043;&#19968;&#26159;&#37319;&#29992;&#26102;&#38388;&#21464;&#24322;&#33258;&#22238;&#24402;&#65288;AR&#65289;&#36807;&#31243;&#65292;&#24182;&#19988;&#20256;&#32479;&#19978;&#36890;&#36807;&#21345;&#23572;&#26364;&#28388;&#27874;&#22120;&#65288;KF&#65289;&#36827;&#34892;&#20272;&#35745;&#12290;&#28982;&#32780;&#65292;&#20316;&#20026;&#32447;&#24615;&#20272;&#35745;&#22120;&#65292;KF&#24456;&#38590;&#36319;&#36394;&#38544;&#21547;&#30340;&#38750;&#32447;&#24615;&#21160;&#21147;&#23398;&#65292;&#32780;&#36825;&#26159;&#25152;&#30740;&#31350;&#27169;&#22411;&#30340;&#37325;&#35201;&#29305;&#24449;&#12290;&#26412;&#25991;&#30340;&#36129;&#29486;&#20855;&#20307;&#26377;&#19977;&#20010;&#26041;&#38754;&#65306;&#39318;&#20808;&#65292;&#25105;&#20204;&#31616;&#35201;&#20171;&#32461;&#20102;&#35745;&#37327;&#32463;&#27982;&#23398;&#25991;&#29486;&#20013;&#29992;&#20110;&#27979;&#35797;&#24369;&#24335;&#24066;&#22330;&#25928;&#29575;&#30340;&#26102;&#38388;&#21464;&#24322;AR&#27169;&#22411;&#21644;&#20272;&#35745;&#26041;&#27861;&#65307;&#20854;&#27425;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#20934;&#30830;&#20272;&#35745;&#26041;&#27861;&#65292;&#29992;&#20110;&#24674;&#22797;&#19981;&#26029;&#28436;&#21270;&#30340;&#24066;&#22330;&#25928;&#29575;&#27700;&#24179;&#30340;&#38544;&#34255;&#36807;&#31243;&#65292;&#35813;&#26041;&#27861;&#22522;&#20110;&#25193;&#23637;&#21345;&#23572;&#26364;&#28388;&#27874;&#22120;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper explores a time-varying version of weak-form market efficiency that is a key component of the so-called Adaptive Market Hypothesis (AMH). One of the most common methodologies used for modeling and estimating a degree of market efficiency lies in an analysis of the serial autocorrelation in observed return series. Under the AMH, a time-varying market efficiency level is modeled by time-varying autoregressive (AR) process and traditionally estimated by the Kalman filter (KF). Being a linear estimator, the KF is hardly capable to track the hidden nonlinear dynamics that is an essential feature of the models under investigation. The contribution of this paper is threefold. We first provide a brief overview of time-varying AR models and estimation methods utilized for testing a weak-form market efficiency in econometrics literature. Secondly, we propose novel accurate estimation approach for recovering the hidden process of evolving market efficiency level by the extended Kalman 
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#36890;&#36807;&#24341;&#20837;&#26816;&#32034;&#22686;&#24378;&#22411;&#30340;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#26694;&#26550;&#65292;&#25552;&#21319;&#37329;&#34701;&#24773;&#24863;&#20998;&#26512;&#30340;&#25928;&#26524;&#65292;&#24182;&#35299;&#20915;&#20102;&#20256;&#32479;&#27169;&#22411;&#22312;&#21442;&#25968;&#35268;&#27169;&#21644;&#35757;&#32451;&#25968;&#25454;&#33539;&#22260;&#26041;&#38754;&#30340;&#38480;&#21046;&#12290;</title><link>http://arxiv.org/abs/2310.04027</link><description>&lt;p&gt;
&#36890;&#36807;&#26816;&#32034;&#22686;&#24378;&#30340;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#25552;&#21319;&#37329;&#34701;&#24773;&#24863;&#20998;&#26512;
&lt;/p&gt;
&lt;p&gt;
Enhancing Financial Sentiment Analysis via Retrieval Augmented Large Language Models. (arXiv:2310.04027v1 [cs.CL])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2310.04027
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#36890;&#36807;&#24341;&#20837;&#26816;&#32034;&#22686;&#24378;&#22411;&#30340;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#26694;&#26550;&#65292;&#25552;&#21319;&#37329;&#34701;&#24773;&#24863;&#20998;&#26512;&#30340;&#25928;&#26524;&#65292;&#24182;&#35299;&#20915;&#20102;&#20256;&#32479;&#27169;&#22411;&#22312;&#21442;&#25968;&#35268;&#27169;&#21644;&#35757;&#32451;&#25968;&#25454;&#33539;&#22260;&#26041;&#38754;&#30340;&#38480;&#21046;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#37329;&#34701;&#24773;&#24863;&#20998;&#26512;&#23545;&#20110;&#20272;&#20540;&#21644;&#25237;&#36164;&#20915;&#31574;&#33267;&#20851;&#37325;&#35201;&#12290;&#28982;&#32780;&#65292;&#20256;&#32479;&#30340;&#33258;&#28982;&#35821;&#35328;&#22788;&#29702;&#27169;&#22411;&#21463;&#20854;&#21442;&#25968;&#35268;&#27169;&#21644;&#35757;&#32451;&#25968;&#25454;&#38598;&#33539;&#22260;&#30340;&#38480;&#21046;&#65292;&#20854;&#27867;&#21270;&#33021;&#21147;&#21644;&#22312;&#35813;&#39046;&#22495;&#30340;&#26377;&#25928;&#24615;&#21463;&#21040;&#20102;&#38480;&#21046;&#12290;&#26368;&#36817;&#65292;&#20197;&#24191;&#27867;&#35821;&#26009;&#24211;&#36827;&#34892;&#39044;&#35757;&#32451;&#30340;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLMs&#65289;&#30001;&#20110;&#20854;&#20196;&#20154;&#31216;&#36190;&#30340;&#38646;&#26679;&#26412;&#33021;&#21147;&#65292;&#22312;&#21508;&#31181;&#33258;&#28982;&#35821;&#35328;&#22788;&#29702;&#20219;&#21153;&#20013;&#23637;&#31034;&#20102;&#20248;&#36234;&#30340;&#24615;&#33021;&#12290;&#28982;&#32780;&#65292;&#30452;&#25509;&#23558;LLMs&#24212;&#29992;&#20110;&#37329;&#34701;&#24773;&#24863;&#20998;&#26512;&#23384;&#22312;&#25361;&#25112;&#65306;LLMs&#30340;&#39044;&#35757;&#32451;&#30446;&#26631;&#19982;&#24773;&#24863;&#26631;&#31614;&#39044;&#27979;&#20043;&#38388;&#30340;&#24046;&#24322;&#21487;&#33021;&#20250; compromise&#20854;&#39044;&#27979;&#24615;&#33021;&#12290;&#27492;&#22806;&#65292;&#37329;&#34701;&#26032;&#38395;&#30340;&#31616;&#27905;&#24615;&#65292;&#24120;&#24120;&#32570;&#20047;&#36275;&#22815;&#30340;&#19978;&#19979;&#25991;&#65292;&#20063;&#21487;&#33021;&#20250;&#26174;&#33879;&#38477;&#20302;LLMs&#30340;&#24773;&#24863;&#20998;&#26512;&#21487;&#38752;&#24615;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20123;&#25361;&#25112;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#29992;&#20110;&#37329;&#34701;&#24773;&#24863;&#20998;&#26512;&#30340;&#26816;&#32034;&#22686;&#24378;&#22411;LLMs&#26694;&#26550;&#12290;
&lt;/p&gt;
&lt;p&gt;
Financial sentiment analysis is critical for valuation and investment decision-making. Traditional NLP models, however, are limited by their parameter size and the scope of their training datasets, which hampers their generalization capabilities and effectiveness in this field. Recently, Large Language Models (LLMs) pre-trained on extensive corpora have demonstrated superior performance across various NLP tasks due to their commendable zero-shot abilities. Yet, directly applying LLMs to financial sentiment analysis presents challenges: The discrepancy between the pre-training objective of LLMs and predicting the sentiment label can compromise their predictive performance. Furthermore, the succinct nature of financial news, often devoid of sufficient context, can significantly diminish the reliability of LLMs' sentiment analysis. To address these challenges, we introduce a retrieval-augmented LLMs framework for financial sentiment analysis. This framework includes an instruction-tuned L
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#20998;&#26512;&#20102;&#21271;&#39532;&#20854;&#39039;&#30340;&#25910;&#20837;&#27969;&#21160;&#24615;&#21644;&#28151;&#21512;&#24230;&#65292;&#21457;&#29616;90&#24180;&#20195;&#30340;&#27969;&#21160;&#24615;&#36739;&#22823;&#65292;&#20294;&#20043;&#21518;&#21576;&#19979;&#38477;&#36235;&#21183;&#65292;&#28151;&#21512;&#26102;&#38388;&#31283;&#23450;&#22312;&#32422;4&#24180;&#24038;&#21491;&#12290;&#36890;&#36807;&#20351;&#29992;MFPT&#25351;&#26631;&#65292;&#30740;&#31350;&#36824;&#26174;&#31034;&#20102;1995&#24180;&#21040;2006&#24180;&#20043;&#38388;MFPT&#26126;&#26174;&#19978;&#21319;&#65292;&#38543;&#21518;&#19979;&#38477;&#30452;&#33267;2017&#24180;&#65292;&#28982;&#21518;&#20877;&#27425;&#19978;&#21319;&#33267;2021&#24180;&#30340;&#23792;&#20540;&#12290;&#36825;&#20123;&#32467;&#26524;&#20026;&#21271;&#39532;&#20854;&#39039;&#30340;&#25910;&#20837;&#27969;&#21160;&#24615;&#25552;&#20379;&#20102;&#22522;&#30784;&#24615;&#30340;&#35270;&#35282;&#12290;</title><link>http://arxiv.org/abs/2309.17268</link><description>&lt;p&gt;
North Macedonia&#30340;&#25910;&#20837;&#27969;&#21160;&#24615;&#21644;&#28151;&#21512;&#24230;&#20998;&#26512;
&lt;/p&gt;
&lt;p&gt;
Income Mobility and Mixing in North Macedonia. (arXiv:2309.17268v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.17268
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#20998;&#26512;&#20102;&#21271;&#39532;&#20854;&#39039;&#30340;&#25910;&#20837;&#27969;&#21160;&#24615;&#21644;&#28151;&#21512;&#24230;&#65292;&#21457;&#29616;90&#24180;&#20195;&#30340;&#27969;&#21160;&#24615;&#36739;&#22823;&#65292;&#20294;&#20043;&#21518;&#21576;&#19979;&#38477;&#36235;&#21183;&#65292;&#28151;&#21512;&#26102;&#38388;&#31283;&#23450;&#22312;&#32422;4&#24180;&#24038;&#21491;&#12290;&#36890;&#36807;&#20351;&#29992;MFPT&#25351;&#26631;&#65292;&#30740;&#31350;&#36824;&#26174;&#31034;&#20102;1995&#24180;&#21040;2006&#24180;&#20043;&#38388;MFPT&#26126;&#26174;&#19978;&#21319;&#65292;&#38543;&#21518;&#19979;&#38477;&#30452;&#33267;2017&#24180;&#65292;&#28982;&#21518;&#20877;&#27425;&#19978;&#21319;&#33267;2021&#24180;&#30340;&#23792;&#20540;&#12290;&#36825;&#20123;&#32467;&#26524;&#20026;&#21271;&#39532;&#20854;&#39039;&#30340;&#25910;&#20837;&#27969;&#21160;&#24615;&#25552;&#20379;&#20102;&#22522;&#30784;&#24615;&#30340;&#35270;&#35282;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#39318;&#27425;&#20998;&#26512;&#20102;1995&#24180;&#33267;2021&#24180;&#26399;&#38388;&#21271;&#39532;&#20854;&#39039;&#30340;&#25910;&#20837;&#27969;&#21160;&#24615;&#65292;&#20351;&#29992;&#20102;&#28151;&#21512;&#26102;&#38388;&#21644;&#24179;&#22343;&#39318;&#27425;&#36890;&#34892;&#26102;&#38388;&#65288;MFPT&#65289;&#24230;&#37327;&#12290;&#25105;&#20204;&#21457;&#29616;&#22312;90&#24180;&#20195;&#30340;&#27969;&#21160;&#24615;&#26356;&#22823;&#65288;&#20197;&#28151;&#21512;&#26102;&#38388;&#34913;&#37327;&#65289;&#65292;&#20294;&#22312;1999&#24180;&#20043;&#21069;&#27969;&#21160;&#24615;&#21576;&#19979;&#38477;&#36235;&#21183;&#12290;&#27492;&#21518;&#65292;&#28151;&#21512;&#26102;&#38388;&#20445;&#25345;&#22312;&#32422;4&#24180;&#24038;&#21491;&#30340;&#31283;&#23450;&#20540;&#12290;&#36890;&#36807;&#20351;&#29992;MFPT&#65292;&#25105;&#20204;&#31361;&#20986;&#20102;&#20010;&#20154;&#22312;&#36861;&#27714;&#26356;&#39640;&#25910;&#20837;&#23618;&#27425;&#26102;&#25152;&#38754;&#20020;&#30340;&#19981;&#26029;&#21464;&#21270;&#30340;&#25361;&#25112;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#25105;&#20204;&#21457;&#29616;&#20174;1995&#24180;&#21040;2006&#24180;&#65292;MFPT&#21576;&#26126;&#26174;&#19978;&#21319;&#36235;&#21183;&#65292;&#38543;&#21518;&#19979;&#38477;&#30452;&#33267;2017&#24180;&#65292;&#28982;&#21518;&#20877;&#27425;&#19978;&#21319;&#65292;&#36798;&#21040;2021&#24180;&#30340;&#23792;&#20540;&#12290;&#36825;&#20123;&#21457;&#29616;&#20026;&#25105;&#20204;&#25552;&#20379;&#20102;&#20851;&#20110;&#21271;&#39532;&#20854;&#39039;&#30340;&#25910;&#20837;&#27969;&#21160;&#24615;&#30340;&#22522;&#30784;&#24615;&#35270;&#35282;&#12290;
&lt;/p&gt;
&lt;p&gt;
This study presents the inaugural analysis of income mobility in North Macedonia from 1995-2021 using the Mixing Time and Mean First Passage Time (MFPT) metrics. We document larger mobility (in terms of Mixing Time) during the '90s, with and decreasing trend (in terms of mobility) until 1999. After this year the Mixing time has been consistent with a value of around 4 years. Using the MFPT, we highlight the evolving challenges individuals face when aspiring to higher income tiers. Namely, we show that there was a noticeable upward trend in MFPT from 1995 to 2006, a subsequent decline until 2017, and then an ascent again, peaking in 2021. These findings provide a foundational perspective on the income mobility in North Macedonia.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#21033;&#29992;&#25195;&#25551;&#20202;&#22823;&#25968;&#25454;&#26500;&#24314;&#20102;&#20013;&#22269;&#30340;&#25195;&#25551;&#20202;&#39135;&#21697;&#28040;&#36153;&#20215;&#26684;&#25351;&#25968;&#65288;S-FCPI&#65289;&#65292;&#24182;&#22522;&#20110;&#35813;&#25351;&#25968;&#24314;&#31435;&#20102;&#22810;&#20010;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#65292;&#25104;&#21151;&#39044;&#27979;&#20102;CPI&#22686;&#38271;&#29575;&#21644;&#36235;&#21183;&#12290;&#35813;&#30740;&#31350;&#20026;&#20013;&#22269;&#21033;&#29992;&#25195;&#25551;&#20202;&#22823;&#25968;&#25454;&#26500;&#24314;&#21644;&#39044;&#27979;&#20215;&#26684;&#25351;&#25968;&#25552;&#20379;&#20102;&#26032;&#36884;&#24452;&#12290;</title><link>http://arxiv.org/abs/2211.16641</link><description>&lt;p&gt;
&#21033;&#29992;&#25195;&#25551;&#20202;&#22823;&#25968;&#25454;&#39044;&#27979;&#20013;&#22269;&#30340;&#28040;&#36153;&#32773;&#29289;&#20215;&#25351;&#25968;
&lt;/p&gt;
&lt;p&gt;
Predicting China's CPI by Scanner Big Data. (arXiv:2211.16641v3 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2211.16641
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#21033;&#29992;&#25195;&#25551;&#20202;&#22823;&#25968;&#25454;&#26500;&#24314;&#20102;&#20013;&#22269;&#30340;&#25195;&#25551;&#20202;&#39135;&#21697;&#28040;&#36153;&#20215;&#26684;&#25351;&#25968;&#65288;S-FCPI&#65289;&#65292;&#24182;&#22522;&#20110;&#35813;&#25351;&#25968;&#24314;&#31435;&#20102;&#22810;&#20010;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#65292;&#25104;&#21151;&#39044;&#27979;&#20102;CPI&#22686;&#38271;&#29575;&#21644;&#36235;&#21183;&#12290;&#35813;&#30740;&#31350;&#20026;&#20013;&#22269;&#21033;&#29992;&#25195;&#25551;&#20202;&#22823;&#25968;&#25454;&#26500;&#24314;&#21644;&#39044;&#27979;&#20215;&#26684;&#25351;&#25968;&#25552;&#20379;&#20102;&#26032;&#36884;&#24452;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25195;&#25551;&#20202;&#22823;&#25968;&#25454;&#26377;&#28508;&#21147;&#26500;&#24314;&#28040;&#36153;&#32773;&#29289;&#20215;&#25351;&#25968;&#65288;CPI&#65289;&#12290;&#26412;&#30740;&#31350;&#21033;&#29992;&#20013;&#22269;&#34434;&#34433;&#21830;&#25143;&#32852;&#30431;&#25552;&#20379;&#30340;&#36229;&#24066;&#38646;&#21806;&#38144;&#21806;&#30340;&#25195;&#25551;&#20202;&#25968;&#25454;&#65292;&#26500;&#24314;&#20013;&#22269;&#30340;&#25195;&#25551;&#20202;&#39135;&#21697;&#28040;&#36153;&#20215;&#26684;&#25351;&#25968;&#65288;S-FCPI&#65289;&#65292;&#24182;&#36890;&#36807;&#20854;&#20182;&#23439;&#35266;&#25351;&#26631;&#65292;&#29305;&#21035;&#26159;&#20013;&#22269;&#30340;CPI&#26469;&#39564;&#35777;&#25351;&#25968;&#30340;&#21487;&#38752;&#24615;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#22522;&#20110;S-FCPI&#26500;&#24314;&#20102;&#22810;&#20010;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#65292;&#20197;&#23450;&#37327;&#39044;&#27979;&#26376;&#24230;CPI&#22686;&#38271;&#29575;&#65292;&#24182;&#23450;&#24615;&#39044;&#27979;&#20854;&#26041;&#21521;&#21644;&#27700;&#24179;&#12290;&#19982;&#29616;&#26377;&#30740;&#31350;&#20013;&#30340;&#20256;&#32479;&#26102;&#38388;&#24207;&#21015;&#27169;&#22411;&#30456;&#27604;&#65292;&#39044;&#27979;&#27169;&#22411;&#30340;&#24615;&#33021;&#26174;&#33879;&#25552;&#39640;&#12290;&#36825;&#39033;&#24037;&#20316;&#20026;&#21033;&#29992;&#25195;&#25551;&#20202;&#22823;&#25968;&#25454;&#26500;&#24314;&#21644;&#39044;&#27979;&#20215;&#26684;&#25351;&#25968;&#22312;&#20013;&#22269;&#38138;&#24179;&#20102;&#36947;&#36335;&#12290;S-FCPI&#19981;&#20165;&#21487;&#20197;&#20197;&#27604;CPI&#26356;&#39640;&#30340;&#39057;&#29575;&#21644;&#26356;&#24191;&#27867;&#30340;&#22320;&#29702;&#32500;&#24230;&#21453;&#26144;&#21830;&#21697;&#20215;&#26684;&#30340;&#21464;&#21270;&#65292;&#36824;&#21487;&#20197;&#20026;&#30417;&#27979;&#23439;&#35266;&#32463;&#27982;&#36816;&#34892;&#12289;&#39044;&#27979;&#36890;&#32960;&#21644;&#29702;&#35299;&#32463;&#27982;&#36235;&#21183;&#25552;&#20379;&#26032;&#30340;&#35270;&#35282;&#12290;
&lt;/p&gt;
&lt;p&gt;
Scanner big data has potential to construct Consumer Price Index (CPI). This work utilizes the scanner data of supermarket retail sales, which are provided by China Ant Business Alliance (CAA), to construct the Scanner-data Food Consumer Price Index (S-FCPI) in China, and the index reliability is verified by other macro indicators, especially by China's CPI. And not only that, we build multiple machine learning models based on S-FCPI to quantitatively predict the CPI growth rate in months, and qualitatively predict those directions and levels. The prediction models achieve much better performance than the traditional time series models in existing research. This work paves the way to construct and predict price indexes through using scanner big data in China. S-FCPI can not only reflect the changes of goods prices in higher frequency and wider geographic dimension than CPI, but also provide a new perspective for monitoring macroeconomic operation, predicting inflation and understanding
&lt;/p&gt;</description></item><item><title>&#36825;&#31687;&#35770;&#25991;&#30740;&#31350;&#20102;&#19968;&#20010;&#20855;&#26377;&#31454;&#20105;&#21644;&#19981;&#30830;&#23450;&#24615;&#30340;&#36864;&#20986;&#38543;&#26426;&#28216;&#25103;&#65292;&#22312;&#20854;&#20013;&#29609;&#23478;&#36890;&#36807;&#20351;&#29992;&#29366;&#24577;&#21464;&#37327;&#21644;&#21518;&#39564;&#20449;&#24565;&#36807;&#31243;&#30340;&#22797;&#26434;&#36864;&#20986;&#31574;&#30053;&#26469;&#30830;&#23450;&#36864;&#20986;&#26102;&#26426;&#65292;&#24182;&#26500;&#24314;&#20102;&#19968;&#31181;&#22343;&#34913;&#35299;&#12290;&#36825;&#31181;&#22343;&#34913;&#35299;&#22312;&#19968;&#31867;&#23545;&#31216;&#36125;&#21494;&#26031;&#22343;&#34913;&#20013;&#26159;&#21807;&#19968;&#30340;&#12290;</title><link>http://arxiv.org/abs/2210.01610</link><description>&lt;p&gt;
&#20855;&#26377;&#31169;&#20154;&#20449;&#24687;&#30340;&#36864;&#20986;&#28216;&#25103;
&lt;/p&gt;
&lt;p&gt;
Exit game with private information. (arXiv:2210.01610v2 [math.OC] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2210.01610
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#30740;&#31350;&#20102;&#19968;&#20010;&#20855;&#26377;&#31454;&#20105;&#21644;&#19981;&#30830;&#23450;&#24615;&#30340;&#36864;&#20986;&#38543;&#26426;&#28216;&#25103;&#65292;&#22312;&#20854;&#20013;&#29609;&#23478;&#36890;&#36807;&#20351;&#29992;&#29366;&#24577;&#21464;&#37327;&#21644;&#21518;&#39564;&#20449;&#24565;&#36807;&#31243;&#30340;&#22797;&#26434;&#36864;&#20986;&#31574;&#30053;&#26469;&#30830;&#23450;&#36864;&#20986;&#26102;&#26426;&#65292;&#24182;&#26500;&#24314;&#20102;&#19968;&#31181;&#22343;&#34913;&#35299;&#12290;&#36825;&#31181;&#22343;&#34913;&#35299;&#22312;&#19968;&#31867;&#23545;&#31216;&#36125;&#21494;&#26031;&#22343;&#34913;&#20013;&#26159;&#21807;&#19968;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#30830;&#23450;&#36864;&#20986;&#26102;&#26426;&#26159;&#19968;&#39033;&#37325;&#35201;&#20294;&#22256;&#38590;&#30340;&#21830;&#19994;&#20915;&#31574;&#65292;&#23588;&#20854;&#26159;&#22312;&#31454;&#20105;&#19982;&#19981;&#30830;&#23450;&#24615;&#20043;&#19979;&#12290;&#21463;&#21040;&#36825;&#20010;&#38382;&#39064;&#30340;&#21551;&#21457;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#19968;&#31181;&#36864;&#20986;&#30340;&#38543;&#26426;&#28216;&#25103;&#65292;&#20854;&#20013;&#29609;&#23478;&#23545;&#31454;&#20105;&#23545;&#25163;&#30340;&#36864;&#20986;&#20215;&#20540;&#23384;&#22312;&#19981;&#30830;&#23450;&#24615;&#12290;&#25105;&#20204;&#26500;&#24314;&#20102;&#19968;&#31181;&#22343;&#34913;&#35299;&#65292;&#36866;&#29992;&#20110;&#21463;&#19968;&#32500;&#25193;&#25955;&#39537;&#21160;&#30340;&#22823;&#31867;&#25903;&#20184;&#27969;&#12290;&#22312;&#22343;&#34913;&#20013;&#65292;&#29609;&#23478;&#37319;&#29992;&#22797;&#26434;&#30340;&#36864;&#20986;&#31574;&#30053;&#65292;&#28041;&#21450;&#29366;&#24577;&#21464;&#37327;&#21644;&#21518;&#39564;&#20449;&#24565;&#36807;&#31243;&#12290;&#36825;&#20123;&#31574;&#30053;&#21487;&#20197;&#26126;&#30830;&#22320;&#29992;&#38382;&#39064;&#25968;&#25454;&#21644;&#36741;&#21161;&#26368;&#20248;&#20572;&#27490;&#38382;&#39064;&#30340;&#35299;&#26469;&#34920;&#31034;&#12290;&#25105;&#20204;&#24471;&#21040;&#30340;&#22343;&#34913;&#34987;&#36827;&#19968;&#27493;&#35777;&#26126;&#22312;&#19968;&#31867;&#23545;&#31216;&#36125;&#21494;&#26031;&#22343;&#34913;&#20013;&#26159;&#21807;&#19968;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
The timing of strategic exit is one of the most important but difficult business decisions, especially under competition and uncertainty. Motivated by this problem, we examine a stochastic game of exit in which players are uncertain about their competitor's exit value. We construct an equilibrium for a large class of payoff flows driven by a general one-dimensional diffusion. In the equilibrium, the players employ sophisticated exit strategies involving both the state variable and the posterior belief process. These strategies are specified explicitly in terms of the problem data and a solution to an auxiliary optimal stopping problem. The equilibrium we obtain is further shown to be unique within a wide subclass of symmetric Bayesian equilibria.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#21033;&#29992;&#22810;&#26234;&#33021;&#20307;&#24378;&#21270;&#23398;&#20064;&#25552;&#20986;&#26657;&#20934;&#34893;&#29983;&#21697;&#23450;&#20215;&#27169;&#22411;&#38382;&#39064;&#30340;&#21338;&#24328;&#35770;&#35299;&#20915;&#26041;&#26696;&#65292;&#24182;&#24076;&#26395;&#35813;&#26041;&#27861;&#21487;&#29992;&#20110;&#35299;&#20915;&#20854;&#20182;&#37329;&#34701;&#39046;&#22495;&#30340;&#38382;&#39064;&#12290;&#23454;&#39564;&#35777;&#26126;&#65292;&#35813;&#31639;&#27861;&#33021;&#22815;&#23398;&#20064;&#23616;&#37096;&#27874;&#21160;&#29575;&#20197;&#21450;&#26368;&#23567;&#21270;&#30334;&#24917;&#22823;&#26399;&#26435;&#20215;&#26684;&#25152;&#38656;&#30340;&#36335;&#24452;&#20381;&#36182;&#24615;&#12290;</title><link>http://arxiv.org/abs/2203.06865</link><description>&lt;p&gt;
&#34893;&#29983;&#21697;&#23450;&#20215;&#27169;&#22411;&#30340;&#26657;&#20934;&#65306;&#22810;&#26234;&#33021;&#20307;&#24378;&#21270;&#23398;&#20064;&#35266;&#28857;
&lt;/p&gt;
&lt;p&gt;
Calibration of Derivative Pricing Models: a Multi-Agent Reinforcement Learning Perspective. (arXiv:2203.06865v3 [q-fin.CP] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2203.06865
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#21033;&#29992;&#22810;&#26234;&#33021;&#20307;&#24378;&#21270;&#23398;&#20064;&#25552;&#20986;&#26657;&#20934;&#34893;&#29983;&#21697;&#23450;&#20215;&#27169;&#22411;&#38382;&#39064;&#30340;&#21338;&#24328;&#35770;&#35299;&#20915;&#26041;&#26696;&#65292;&#24182;&#24076;&#26395;&#35813;&#26041;&#27861;&#21487;&#29992;&#20110;&#35299;&#20915;&#20854;&#20182;&#37329;&#34701;&#39046;&#22495;&#30340;&#38382;&#39064;&#12290;&#23454;&#39564;&#35777;&#26126;&#65292;&#35813;&#31639;&#27861;&#33021;&#22815;&#23398;&#20064;&#23616;&#37096;&#27874;&#21160;&#29575;&#20197;&#21450;&#26368;&#23567;&#21270;&#30334;&#24917;&#22823;&#26399;&#26435;&#20215;&#26684;&#25152;&#38656;&#30340;&#36335;&#24452;&#20381;&#36182;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#37327;&#21270;&#37329;&#34701;&#20013;&#26368;&#22522;&#26412;&#30340;&#38382;&#39064;&#20043;&#19968;&#26159;&#23384;&#22312;&#36866;&#21512;&#32473;&#23450;&#19968;&#32452;&#26399;&#26435;&#24066;&#22330;&#20215;&#26684;&#30340;&#36830;&#32493;&#26102;&#38388;&#25193;&#25955;&#27169;&#22411;&#12290;&#20256;&#32479;&#19978;&#65292;&#20154;&#20204;&#20351;&#29992;&#30452;&#35273;&#12289;&#29702;&#35770;&#21644;&#32463;&#39564;&#20998;&#26512;&#30340;&#28151;&#21512;&#26041;&#27861;&#26469;&#23547;&#25214;&#23454;&#29616;&#31934;&#30830;&#25110;&#36817;&#20284;&#21305;&#37197;&#30340;&#27169;&#22411;&#12290;&#25105;&#20204;&#30340;&#36129;&#29486;&#22312;&#20110;&#23637;&#31034;&#22914;&#20309;&#36890;&#36807;&#36866;&#24403;&#30340;&#21338;&#24328;&#29702;&#35770;&#24418;&#24335;&#21270;&#38382;&#39064;&#65292;&#20511;&#21161;&#29616;&#20195;&#28145;&#24230;&#22810;&#26234;&#33021;&#20307;&#24378;&#21270;&#23398;&#20064;&#30340;&#29616;&#26377;&#36827;&#23637;&#26469;&#25628;&#32034;&#38543;&#26426;&#36807;&#31243;&#31354;&#38388;&#65292;&#20197;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#12290;&#26356;&#37325;&#35201;&#30340;&#26159;&#65292;&#25105;&#20204;&#24076;&#26395;&#25105;&#20204;&#30340;&#25216;&#26415;&#21487;&#20197;&#34987;&#31038;&#21306;&#21033;&#29992;&#21644;&#25193;&#23637;&#65292;&#20197;&#35299;&#20915;&#35813;&#39046;&#22495;&#30340;&#37325;&#35201;&#38382;&#39064;&#65292;&#22914;&#32852;&#21512;SPX-VIX&#26657;&#20934;&#38382;&#39064;&#12290;&#25105;&#20204;&#30340;&#23454;&#39564;&#34920;&#26126;&#65292;&#25105;&#20204;&#33021;&#22815;&#23398;&#20064;&#23616;&#37096;&#27874;&#21160;&#29575;&#20197;&#21450;&#22312;&#27874;&#21160;&#29575;&#36807;&#31243;&#20013;&#25152;&#38656;&#30340;&#36335;&#24452;&#20381;&#36182;&#24615;&#65292;&#20197;&#26368;&#23567;&#21270;&#30334;&#24917;&#22823;&#26399;&#26435;&#30340;&#20215;&#26684;&#12290;&#25105;&#20204;&#30340;&#31639;&#27861;&#21487;&#20197;&#30475;&#20316;&#26159;&#19968;&#31181;&#31890;&#23376;&#26041;&#27861;&#65292;&#31867;&#20284;&#20110;Guyon et Henry-Labordere&#30340;&#26041;&#27861;&#12290;
&lt;/p&gt;
&lt;p&gt;
One of the most fundamental questions in quantitative finance is the existence of continuous-time diffusion models that fit market prices of a given set of options. Traditionally, one employs a mix of intuition, theoretical and empirical analysis to find models that achieve exact or approximate fits. Our contribution is to show how a suitable game theoretical formulation of this problem can help solve this question by leveraging existing developments in modern deep multi-agent reinforcement learning to search in the space of stochastic processes. More importantly, we hope that our techniques can be leveraged and extended by the community to solve important problems in that field, such as the joint SPX-VIX calibration problem. Our experiments show that we are able to learn local volatility, as well as path-dependence required in the volatility process to minimize the price of a Bermudan option. Our algorithm can be seen as a particle method \`{a} la Guyon et Henry-Labordere where partic
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#36890;&#36807;&#23558;&#20572;&#36710;&#36873;&#25321;&#20316;&#20026;&#20986;&#34892;&#27169;&#24335;&#36873;&#25321;&#27169;&#22411;&#30340;&#20869;&#29983;&#20915;&#31574;&#65292;&#32508;&#21512;&#32771;&#34385;&#24577;&#24230;&#22240;&#32032;&#21644;&#24314;&#31569;&#29615;&#22659;&#21464;&#37327;&#65292;&#22635;&#34917;&#20102;&#21333;&#29420;&#32771;&#34385;&#20986;&#34892;&#26041;&#24335;&#21644;&#20572;&#36710;&#36873;&#25321;&#34892;&#20026;&#20043;&#38388;&#26435;&#34913;&#30340;&#31354;&#30333;&#12290;</title><link>http://arxiv.org/abs/2109.01045</link><description>&lt;p&gt;
&#21033;&#29992;&#32852;&#21512;&#20572;&#36710;&#21644;&#20986;&#34892;&#27169;&#24335;&#36873;&#25321;&#27169;&#22411;&#20998;&#26512;&#36890;&#21220;&#32773;&#20986;&#34892;&#20915;&#31574;&#30340;&#21475;&#21619;&#24322;&#36136;&#24615;&#65306;&#20197;&#21360;&#24230;&#22478;&#24066;&#20026;&#20363;
&lt;/p&gt;
&lt;p&gt;
Analysis of taste heterogeneity in commuters travel decisions using joint parking and mode choice model: A case from urban India. (arXiv:2109.01045v3 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2109.01045
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#36890;&#36807;&#23558;&#20572;&#36710;&#36873;&#25321;&#20316;&#20026;&#20986;&#34892;&#27169;&#24335;&#36873;&#25321;&#27169;&#22411;&#30340;&#20869;&#29983;&#20915;&#31574;&#65292;&#32508;&#21512;&#32771;&#34385;&#24577;&#24230;&#22240;&#32032;&#21644;&#24314;&#31569;&#29615;&#22659;&#21464;&#37327;&#65292;&#22635;&#34917;&#20102;&#21333;&#29420;&#32771;&#34385;&#20986;&#34892;&#26041;&#24335;&#21644;&#20572;&#36710;&#36873;&#25321;&#34892;&#20026;&#20043;&#38388;&#26435;&#34913;&#30340;&#31354;&#30333;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20132;&#36890;&#38656;&#27714;&#31649;&#29702;&#30340;&#27010;&#24565;&#36890;&#36807;&#22312;&#22478;&#24066;&#20013;&#23454;&#29616;&#26368;&#20339;&#24179;&#34913;&#30340;&#20132;&#36890;&#27169;&#24335;&#20221;&#39069;&#26469;&#20419;&#36827;&#21487;&#25345;&#32493;&#20986;&#34892;&#30340;&#21457;&#23637;&#65292;&#32780;&#27169;&#24335;&#20221;&#39069;&#31649;&#29702;&#30452;&#25509;&#21453;&#26144;&#20102;&#27599;&#20010;&#20132;&#36890;&#23376;&#31995;&#32479;&#65292;&#21253;&#25324;&#20572;&#36710;&#22330;&#30340;TDM&#12290;&#22312;&#21457;&#23637;&#20013;&#22269;&#23478;&#65292;&#25919;&#31574;&#21046;&#23450;&#32773;&#20027;&#35201;&#20851;&#27880;&#20379;&#32473;&#20391;&#25514;&#26045;&#65292;&#32780;&#38656;&#27714;&#20391;&#25514;&#26045;&#22312;&#25919;&#31574;&#24433;&#21709;&#26041;&#38754;&#23578;&#26410;&#24471;&#21040;&#35299;&#20915;&#12290;&#26377;&#22823;&#37327;&#30340;&#25991;&#29486;&#20171;&#32461;&#20102;TDM&#31574;&#30053;&#30340;&#21709;&#24212;&#65292;&#20294;&#22823;&#22810;&#25968;&#30740;&#31350;&#21333;&#29420;&#32771;&#34385;&#20102;&#20986;&#34892;&#26041;&#24335;&#21644;&#20572;&#36710;&#36873;&#25321;&#34892;&#20026;&#65292;&#32780;&#27809;&#26377;&#32771;&#34385;&#23427;&#20204;&#20043;&#38388;&#30340;&#26435;&#34913;&#12290;&#19981;&#36825;&#26679;&#20570;&#21487;&#33021;&#20250;&#23548;&#33268;&#20559;&#35265;&#27169;&#22411;&#20272;&#35745;&#21644;&#25919;&#31574;&#24212;&#29992;&#30340;&#19981;&#24403;&#12290;&#26412;&#25991;&#35797;&#22270;&#36890;&#36807;&#23558;&#20572;&#36710;&#36873;&#25321;&#20316;&#20026;&#27169;&#24335;&#36873;&#25321;&#34892;&#20026;&#27169;&#22411;&#20013;&#30340;&#20869;&#29983;&#20915;&#31574;&#26469;&#22635;&#34917;&#36825;&#19968;&#31354;&#30333;&#12290;&#26412;&#30740;&#31350;&#23558;&#24577;&#24230;&#22240;&#32032;&#21644;&#24314;&#31569;&#29615;&#22659;&#21464;&#37327;&#19982;&#20572;&#36710;&#21644;&#20986;&#34892;&#23646;&#24615;&#30456;&#32467;&#21512;&#65292;&#20197;&#24320;&#21457;&#32508;&#21512;&#30340;&#32852;&#21512;&#20572;&#36710;&#21644;&#20986;&#34892;&#27169;&#24335;&#36873;&#25321;&#27169;&#22411;&#12290;
&lt;/p&gt;
&lt;p&gt;
The concept of transportation demand management (TDM) upholds the development of sustainable mobility through the triumph of optimally balanced transport modal share in cities. The modal split management directly reflects on TDM of each transport subsystem, including parking. In developing countries, the policy-makers have largely focused on supply-side measures, yet demand-side measures have remained unaddressed in policy implications. Ample literature is available presenting responses of TDM strategies, but most studies account mode choice and parking choice behaviour separately rather than considering trade-offs between them. Failing to do so may lead to biased model estimates and impropriety in policy implications. This paper seeks to fill this gap by admitting parking choice as an endogenous decision within the model of mode choice behaviour. This study integrates attitudinal factors and built-environment variables in addition to parking and travel attributes for developing compre
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#22522;&#20110;&#22870;&#24809;&#31995;&#32479;&#30340;&#32593;&#32476;&#39118;&#38505;&#20445;&#38505;&#27169;&#22411;&#65292;&#36890;&#36807;&#35843;&#25972;&#39118;&#38505;&#36716;&#31227;&#20135;&#21697;&#30340;&#20445;&#36153;&#20197;&#28608;&#21169;&#32593;&#32476;&#25439;&#22833;&#20943;&#23569;&#65292;&#35299;&#20915;&#36947;&#24503;&#39118;&#38505;&#38382;&#39064;&#24182;&#35753;&#20445;&#38505;&#21830;&#21463;&#30410;&#30340;&#21487;&#33021;&#24615;&#12290;</title><link>http://arxiv.org/abs/2102.05568</link><description>&lt;p&gt;
&#22522;&#20110;&#22870;&#24809;&#31995;&#32479;&#30340;&#32593;&#32476;&#39118;&#38505;&#20445;&#38505;&#19982;&#26368;&#20248;&#32593;&#32476;&#23433;&#20840;&#37197;&#32622;&#26694;&#26550;
&lt;/p&gt;
&lt;p&gt;
A Bonus-Malus Framework for Cyber Risk Insurance and Optimal Cybersecurity Provisioning. (arXiv:2102.05568v3 [math.OC] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2102.05568
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#22522;&#20110;&#22870;&#24809;&#31995;&#32479;&#30340;&#32593;&#32476;&#39118;&#38505;&#20445;&#38505;&#27169;&#22411;&#65292;&#36890;&#36807;&#35843;&#25972;&#39118;&#38505;&#36716;&#31227;&#20135;&#21697;&#30340;&#20445;&#36153;&#20197;&#28608;&#21169;&#32593;&#32476;&#25439;&#22833;&#20943;&#23569;&#65292;&#35299;&#20915;&#36947;&#24503;&#39118;&#38505;&#38382;&#39064;&#24182;&#35753;&#20445;&#38505;&#21830;&#21463;&#30410;&#30340;&#21487;&#33021;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#34429;&#28982;&#32593;&#32476;&#25439;&#22833;&#30340;&#35268;&#27169;&#36234;&#26469;&#36234;&#22823;&#19988;&#32593;&#32476;&#25439;&#22833;&#20107;&#20214;&#30340;&#21457;&#29983;&#29575;&#20063;&#22312;&#22686;&#21152;&#65292;&#20294;&#32593;&#32476;&#39118;&#38505;&#20445;&#38505;&#24066;&#22330;&#20173;&#22788;&#20110;&#21457;&#23637;&#30340;&#21021;&#32423;&#38454;&#27573;&#12290;&#29616;&#26377;&#30340;&#32593;&#32476;&#39118;&#38505;&#20445;&#38505;&#20135;&#21697;&#21644;&#23398;&#26415;&#30740;&#31350;&#19968;&#30452;&#20851;&#27880;&#23545;&#32593;&#32476;&#25439;&#22833;&#20107;&#20214;&#36827;&#34892;&#20998;&#31867;&#21644;&#27169;&#22411;&#24320;&#21457;&#65292;&#20294;&#24456;&#23569;&#20851;&#27880;&#36890;&#36807;&#35843;&#25972;&#39118;&#38505;&#36716;&#31227;&#20135;&#21697;&#30340;&#20445;&#36153;&#20197;&#28608;&#21169;&#32593;&#32476;&#25439;&#22833;&#20943;&#23569;&#30340;&#20445;&#38505;&#39118;&#38505;&#36716;&#31227;&#31574;&#30053;&#30340;&#25552;&#20986;&#12290;&#20026;&#20102;&#22635;&#34917;&#36825;&#19968;&#37325;&#35201;&#30171;&#28857;&#65292;&#25105;&#20204;&#24320;&#21457;&#20102;&#19968;&#20010;&#22522;&#20110;&#22870;&#24809;&#31995;&#32479;&#30340;&#32593;&#32476;&#39118;&#38505;&#20445;&#38505;&#27169;&#22411;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#32593;&#32476;&#39118;&#38505;&#20445;&#38505;&#21644;&#32593;&#32476;&#23433;&#20840;&#37197;&#32622;&#30340;&#25968;&#23398;&#27169;&#22411;&#65292;&#24182;&#25903;&#25345;&#21160;&#24577;&#35268;&#21010;&#30340;&#39640;&#25928;&#25968;&#20540;&#31639;&#27861;&#12290;&#36890;&#36807;&#25968;&#20540;&#23454;&#39564;&#65292;&#25105;&#20204;&#28436;&#31034;&#20102;&#19968;&#20010;&#27491;&#30830;&#35774;&#35745;&#30340;&#22522;&#20110;&#22870;&#24809;&#31995;&#32479;&#30340;&#32593;&#32476;&#39118;&#38505;&#20445;&#38505;&#21512;&#21516;&#22914;&#20309;&#35299;&#20915;&#36947;&#24503;&#39118;&#38505;&#30340;&#38382;&#39064;&#24182;&#35753;&#20445;&#38505;&#21830;&#21463;&#30410;&#30340;&#21487;&#33021;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
The cyber risk insurance market is at a nascent stage of its development, even as the magnitude of cyber losses is significant and the rate of cyber loss events is increasing. Existing cyber risk insurance products as well as academic studies have been focusing on classifying cyber loss events and developing models of these events, but little attention has been paid to proposing insurance risk transfer strategies that incentivise mitigation of cyber loss through adjusting the premium of the risk transfer product. To address this important gap, we develop a Bonus-Malus model for cyber risk insurance. Specifically, we propose a mathematical model of cyber risk insurance and cybersecurity provisioning supported with an efficient numerical algorithm based on dynamic programming. Through a numerical experiment, we demonstrate how a properly designed cyber risk insurance contract with a Bonus-Malus system can resolve the issue of moral hazard and benefit the insurer.
&lt;/p&gt;</description></item></channel></rss>