<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#30740;&#31350;&#20102;&#22312;&#28385;&#36275;&#21333;&#35843;&#24615;&#21644;&#19979;&#21322;&#36830;&#32493;&#24615;&#30340;&#26465;&#20214;&#19979;&#65292;&#30456;&#23545;&#20110;&#31532;&#19968;&#39034;&#24207;&#38543;&#26426;&#20248;&#21183;&#26465;&#20214;&#30340;&#26368;&#22823;&#31283;&#23450;&#24615;&#65292;&#25552;&#20986;&#20102;&#28385;&#36275;&#26368;&#22823;&#31283;&#23450;&#24615;&#24615;&#36136;&#30340;&#27867;&#20989;&#21487;&#20197;&#34920;&#31034;&#20026;&#19968;&#20010;&#21452;&#21464;&#37327;&#20989;&#25968;&#30340;&#26497;&#20540;&#28857;&#30340;&#34920;&#31034;&#23450;&#29702;</title><link>https://arxiv.org/abs/2403.13138</link><description>&lt;p&gt;
&#31532;&#19968;&#39034;&#24207;&#38543;&#26426;&#20248;&#21183;&#26465;&#20214;&#19979;&#30340;&#26368;&#22823;&#31283;&#23450;&#24615;
&lt;/p&gt;
&lt;p&gt;
Max-stability under first-order stochastic dominance
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.13138
&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#20102;&#22312;&#28385;&#36275;&#21333;&#35843;&#24615;&#21644;&#19979;&#21322;&#36830;&#32493;&#24615;&#30340;&#26465;&#20214;&#19979;&#65292;&#30456;&#23545;&#20110;&#31532;&#19968;&#39034;&#24207;&#38543;&#26426;&#20248;&#21183;&#26465;&#20214;&#30340;&#26368;&#22823;&#31283;&#23450;&#24615;&#65292;&#25552;&#20986;&#20102;&#28385;&#36275;&#26368;&#22823;&#31283;&#23450;&#24615;&#24615;&#36136;&#30340;&#27867;&#20989;&#21487;&#20197;&#34920;&#31034;&#20026;&#19968;&#20010;&#21452;&#21464;&#37327;&#20989;&#25968;&#30340;&#26497;&#20540;&#28857;&#30340;&#34920;&#31034;&#23450;&#29702;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26368;&#22823;&#31283;&#23450;&#24615;&#26159;&#25351;&#23545;&#20004;&#20010;&#36755;&#20837;&#21462;&#26368;&#22823;&#20540;&#20250;&#23548;&#33268;&#20004;&#20010;&#36755;&#20986;&#20013;&#30340;&#26368;&#22823;&#20540;&#12290;&#25105;&#20204;&#30740;&#31350;&#20102;&#30456;&#23545;&#20110;&#31532;&#19968;&#39034;&#24207;&#38543;&#26426;&#20248;&#21183;&#26465;&#20214;&#30340;&#26368;&#22823;&#31283;&#23450;&#24615;&#65292;&#36825;&#26159;&#20915;&#31574;&#29702;&#35770;&#20013;&#26368;&#22522;&#26412;&#30340;&#38543;&#26426;&#20248;&#21183;&#27010;&#24565;&#12290;&#22312;&#21152;&#20837;&#20102;&#21333;&#35843;&#24615;&#21644;&#19979;&#21322;&#36830;&#32493;&#24615;&#30340;&#20004;&#20010;&#26631;&#20934;&#20844;&#29702;&#21518;&#65292;&#25105;&#20204;&#24314;&#31435;&#20102;&#19968;&#20010;&#20851;&#20110;&#28385;&#36275;&#26368;&#22823;&#31283;&#23450;&#24615;&#24615;&#36136;&#30340;&#27867;&#20989;&#30340;&#34920;&#31034;&#23450;&#29702;&#65292;&#32467;&#26524;&#34920;&#26126;&#36825;&#20123;&#27867;&#20989;&#21487;&#20197;&#34920;&#31034;&#20026;&#19968;&#20010;&#21452;&#21464;&#37327;&#20989;&#25968;&#30340;&#26497;&#20540;&#28857;&#12290;&#25105;&#20204;&#34920;&#24449;&#30340;&#27867;&#20989;&#21253;&#25324;&#20102;&#39118;&#38505;&#24230;&#37327;&#25991;&#29486;&#20013;&#30340;&#29305;&#27530;&#31867;&#21035;&#65292;&#22914;&#22522;&#20934;&#25439;&#22833;Value at Risk (VaR) &#21644; $\Lambda$-&#20998;&#20301;&#25968;&#12290;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.13138v1 Announce Type: new  Abstract: Max-stability is the property that taking a maximum between two inputs results in a maximum between two outputs. We investigate max-stability with respect to first-order stochastic dominance, the most fundamental notion of stochastic dominance in decision theory. Under two additional standard axioms of monotonicity and lower semicontinuity, we establish a representation theorem for functionals satisfying max-stability, which turns out to be represented by the supremum of a bivariate function. Our characterized functionals encompass special classes of functionals in the literature of risk measures, such as benchmark-loss Value at Risk (VaR) and $\Lambda$-quantile.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#36890;&#36807;&#23545;181&#20010;&#22269;&#23478;&#24120;&#35265;&#38144;&#21806;&#30340;811&#31181;&#38646;&#21806;&#39135;&#21697;&#30340;&#20215;&#26684;&#19982;&#29615;&#22659;&#24433;&#21709;&#12289;&#33829;&#20859;&#20449;&#24687;&#30340;&#21305;&#37197;&#65292;&#21457;&#29616;&#20215;&#26684;&#36739;&#20302;&#30340;&#39135;&#21697;&#20855;&#26377;&#36739;&#20302;&#30340;&#30899;&#36275;&#36857;&#21644;&#27700;&#36275;&#36857;&#65292;&#29305;&#21035;&#26159;&#21160;&#29289;&#28304;&#24615;&#39135;&#21697;&#12290;&#21516;&#26102;&#65292;&#20215;&#26684;&#19982;&#33829;&#20859;&#20449;&#24687;&#20043;&#38388;&#30340;&#20851;&#31995;&#22240;&#39135;&#21697;&#32452;&#12289;&#20215;&#26684;&#33539;&#22260;&#21644;&#33829;&#20859;&#23646;&#24615;&#32780;&#26377;&#25152;&#19981;&#21516;&#12290;</title><link>http://arxiv.org/abs/2401.13159</link><description>&lt;p&gt;
181&#20010;&#22269;&#23478;&#24120;&#35265;&#38646;&#21806;&#39135;&#21697;&#30340;&#29615;&#22659;&#24433;&#21709;&#12289;&#33829;&#20859;&#20449;&#24687;&#21644;&#38646;&#21806;&#20215;&#26684;: &#19968;&#39033;&#35266;&#23519;&#24615;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Environmental impacts, nutritional profiles, and retail prices of commonly sold retail food items in 181 countries: an observational study. (arXiv:2401.13159v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2401.13159
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#36890;&#36807;&#23545;181&#20010;&#22269;&#23478;&#24120;&#35265;&#38144;&#21806;&#30340;811&#31181;&#38646;&#21806;&#39135;&#21697;&#30340;&#20215;&#26684;&#19982;&#29615;&#22659;&#24433;&#21709;&#12289;&#33829;&#20859;&#20449;&#24687;&#30340;&#21305;&#37197;&#65292;&#21457;&#29616;&#20215;&#26684;&#36739;&#20302;&#30340;&#39135;&#21697;&#20855;&#26377;&#36739;&#20302;&#30340;&#30899;&#36275;&#36857;&#21644;&#27700;&#36275;&#36857;&#65292;&#29305;&#21035;&#26159;&#21160;&#29289;&#28304;&#24615;&#39135;&#21697;&#12290;&#21516;&#26102;&#65292;&#20215;&#26684;&#19982;&#33829;&#20859;&#20449;&#24687;&#20043;&#38388;&#30340;&#20851;&#31995;&#22240;&#39135;&#21697;&#32452;&#12289;&#20215;&#26684;&#33539;&#22260;&#21644;&#33829;&#20859;&#23646;&#24615;&#32780;&#26377;&#25152;&#19981;&#21516;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36127;&#25285;&#33021;&#21147;&#24120;&#34987;&#35270;&#20026;&#28040;&#36153;&#21487;&#25345;&#32493;&#39278;&#39135;&#30340;&#38556;&#30861;&#12290;&#26412;&#30740;&#31350;&#39318;&#27425;&#22312;&#20840;&#29699;&#33539;&#22260;&#20869;&#27979;&#35797;&#20102;&#38646;&#21806;&#39135;&#21697;&#20215;&#26684;&#19982;&#32463;&#39564;&#20272;&#35745;&#30340;&#29615;&#22659;&#24433;&#21709;&#21644;&#33829;&#20859;&#35780;&#20998;&#20043;&#38388;&#20197;&#21450;&#39135;&#21697;&#32452;&#20869;&#30340;&#20851;&#31995;&#12290;&#25105;&#20204;&#20351;&#29992;2011&#24180;&#21644;2017&#24180;&#22312;181&#20010;&#22269;&#23478;&#24120;&#35265;&#38144;&#21806;&#30340;811&#31181;&#38646;&#21806;&#39135;&#21697;&#30340;&#20215;&#26684;&#19982;&#20272;&#35745;&#30340;&#30899;&#36275;&#36857;&#12289;&#27700;&#36275;&#36857;&#21644;&#33829;&#20859;&#20449;&#24687;&#36827;&#34892;&#21305;&#37197;&#65292;&#27979;&#35797;&#26356;&#20581;&#24247;&#21644;&#26356;&#29615;&#22659;&#21487;&#25345;&#32493;&#30340;&#39135;&#21697;&#22312;&#39135;&#21697;&#32452;&#20869;&#21644;&#39135;&#21697;&#32452;&#38388;&#26159;&#21542;&#26356;&#26114;&#36149;&#12290;&#25105;&#20204;&#21457;&#29616;&#22312;&#20960;&#20046;&#25152;&#26377;&#39135;&#21697;&#32452;&#20013;&#65292;&#20215;&#26684;&#36739;&#20302;&#30340;&#29289;&#21697;&#20855;&#26377;&#26174;&#33879;&#36739;&#20302;&#30340;&#30899;&#36275;&#36857;&#21644;&#27700;&#36275;&#36857;&#12290;&#23545;&#20110;&#21160;&#29289;&#28304;&#24615;&#39135;&#21697;&#65292;&#30456;&#20851;&#24615;&#26368;&#24378;&#65292;&#27599;&#38477;&#20302;10%&#30340;&#20215;&#26684;&#19982;&#27599;100kcal&#30340;&#20108;&#27687;&#21270;&#30899;&#24403;&#37327;&#30899;&#20943;&#23569;20&#20811;&#21644;&#27700;&#36275;&#36857;&#20943;&#23569;5&#21319;&#12290;&#20215;&#26684;&#19982;&#33829;&#20859;&#20449;&#24687;&#20043;&#38388;&#30340;&#26799;&#24230;&#22240;&#39135;&#21697;&#32452;&#12289;&#20215;&#26684;&#33539;&#22260;&#21644;&#33829;&#20859;&#23646;&#24615;&#32780;&#24322;&#12290;&#30456;&#27604;&#20043;&#19979;&#65292;&#20215;&#26684;&#36739;&#20302;&#30340;&#29289;&#21697;&#20855;&#26377;&#36739;&#20302;&#30340;&#33829;&#20859;&#20449;&#24687;&#12290;
&lt;/p&gt;
&lt;p&gt;
Affordability is often seen as a barrier to consuming sustainable diets. This study provides the first worldwide test of how retail food prices relate to empirically estimated environmental impacts and nutritional profile scores between and within food groups. We use prices for 811 retail food items commonly sold in 181 countries during 2011 and 2017, matched to estimated carbon and water footprints and nutritional profiles, to test whether healthier and more environmentally sustainable foods are more expensive between and within food groups. We find that within almost all groups, less expensive items have significantly lower carbon and water footprints. Associations are strongest for animal source foods, where each 10% lower price is associated with 20 grams lower CO2-equivalent carbon and 5 liters lower water footprint per 100kcal. Gradients between price and nutritional profile vary by food group, price range, and nutritional attribute. In contrast, lower-priced items have lower nut
&lt;/p&gt;</description></item></channel></rss>