<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#25552;&#20986;&#20102;&#19968;&#31181;&#29983;&#25104;&#23545;&#25239;&#32593;&#32476;&#65288;GAN&#65289;&#26041;&#27861;&#65292;&#29992;&#20110;&#35299;&#20915;&#19968;&#33324;&#21644;&#29616;&#23454;&#35774;&#32622;&#19979;&#30340;&#31283;&#20581;&#25928;&#29992;&#20248;&#21270;&#38382;&#39064;&#65292;&#35813;&#26041;&#27861;&#22312;&#23454;&#35777;&#30740;&#31350;&#20013;&#34920;&#29616;&#20986;&#33394;&#65292;&#33021;&#22312;&#27809;&#26377;&#24050;&#30693;&#26368;&#20339;&#31574;&#30053;&#30340;&#24773;&#20917;&#19979;&#32988;&#36807;&#25152;&#26377;&#20854;&#20182;&#21442;&#32771;&#31574;&#30053;</title><link>https://arxiv.org/abs/2403.15243</link><description>&lt;p&gt;
&#36890;&#36807;GAN&#26041;&#27861;&#23454;&#29616;&#31283;&#20581;&#25928;&#29992;&#20248;&#21270;
&lt;/p&gt;
&lt;p&gt;
Robust Utility Optimization via a GAN Approach
&lt;/p&gt;
&lt;p&gt;
https://arxiv.org/abs/2403.15243
&lt;/p&gt;
&lt;p&gt;
&#25552;&#20986;&#20102;&#19968;&#31181;&#29983;&#25104;&#23545;&#25239;&#32593;&#32476;&#65288;GAN&#65289;&#26041;&#27861;&#65292;&#29992;&#20110;&#35299;&#20915;&#19968;&#33324;&#21644;&#29616;&#23454;&#35774;&#32622;&#19979;&#30340;&#31283;&#20581;&#25928;&#29992;&#20248;&#21270;&#38382;&#39064;&#65292;&#35813;&#26041;&#27861;&#22312;&#23454;&#35777;&#30740;&#31350;&#20013;&#34920;&#29616;&#20986;&#33394;&#65292;&#33021;&#22312;&#27809;&#26377;&#24050;&#30693;&#26368;&#20339;&#31574;&#30053;&#30340;&#24773;&#20917;&#19979;&#32988;&#36807;&#25152;&#26377;&#20854;&#20182;&#21442;&#32771;&#31574;&#30053;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#31283;&#20581;&#25928;&#29992;&#20248;&#21270;&#20351;&#25237;&#36164;&#32773;&#33021;&#22815;&#20197;&#32467;&#26500;&#21270;&#26041;&#24335;&#22788;&#29702;&#24066;&#22330;&#19981;&#30830;&#23450;&#24615;&#65292;&#26088;&#22312;&#26368;&#22823;&#21270;&#26368;&#22351;&#24773;&#20917;&#30340;&#32467;&#26524;&#12290;&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#29983;&#25104;&#23545;&#25239;&#32593;&#32476;&#65288;GAN&#65289;&#26041;&#27861;&#65292;&#65288;&#36817;&#20284;&#22320;&#65289;&#35299;&#20915;&#19968;&#33324;&#21644;&#29616;&#23454;&#35774;&#32622;&#19979;&#30340;&#31283;&#20581;&#25928;&#29992;&#20248;&#21270;&#38382;&#39064;&#12290;&#29305;&#21035;&#22320;&#65292;&#25105;&#20204;&#36890;&#36807;&#31070;&#32463;&#32593;&#32476;&#65288;NN&#65289;&#23545;&#25237;&#36164;&#32773;&#21644;&#24066;&#22330;&#36827;&#34892;&#24314;&#27169;&#65292;&#24182;&#22312;&#26497;&#23567;&#26497;&#22823;&#38646;&#21644;&#21338;&#24328;&#20013;&#35757;&#32451;&#23427;&#20204;&#12290;&#36825;&#31181;&#26041;&#27861;&#36866;&#29992;&#20110;&#20219;&#20309;&#36830;&#32493;&#25928;&#29992;&#20989;&#25968;&#65292;&#24182;&#22312;&#20855;&#26377;&#20132;&#26131;&#25104;&#26412;&#30340;&#29616;&#23454;&#24066;&#22330;&#35774;&#32622;&#20013;&#65292;&#21482;&#33021;&#20351;&#29992;&#24066;&#22330;&#30340;&#21487;&#35266;&#23519;&#20449;&#24687;&#12290;&#22823;&#37327;&#23454;&#35777;&#30740;&#31350;&#26174;&#31034;&#20102;&#25105;&#20204;&#26041;&#27861;&#30340;&#22810;&#21151;&#33021;&#24615;&#12290;&#27599;&#24403;&#23384;&#22312;&#26368;&#20339;&#21442;&#32771;&#31574;&#30053;&#26102;&#65292;&#25105;&#20204;&#30340;&#26041;&#27861;&#37117;&#33021;&#19982;&#20043;&#23218;&#32654;&#65292;&#22312;&#27809;&#26377;&#24050;&#30693;&#26368;&#20339;&#31574;&#30053;&#30340;&#65288;&#35768;&#22810;&#65289;&#35774;&#32622;&#20013;&#65292;&#25105;&#20204;&#30340;&#26041;&#27861;&#32988;&#36807;&#25152;&#26377;&#20854;&#20182;&#21442;&#32771;&#31574;&#30053;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#21487;&#20197;&#20174;&#30740;&#31350;&#20013;&#24471;&#20986;&#32467;&#35770;
&lt;/p&gt;
&lt;p&gt;
arXiv:2403.15243v1 Announce Type: cross  Abstract: Robust utility optimization enables an investor to deal with market uncertainty in a structured way, with the goal of maximizing the worst-case outcome. In this work, we propose a generative adversarial network (GAN) approach to (approximately) solve robust utility optimization problems in general and realistic settings. In particular, we model both the investor and the market by neural networks (NN) and train them in a mini-max zero-sum game. This approach is applicable for any continuous utility function and in realistic market settings with trading costs, where only observable information of the market can be used. A large empirical study shows the versatile usability of our method. Whenever an optimal reference strategy is available, our method performs on par with it and in the (many) settings without known optimal strategy, our method outperforms all other reference strategies. Moreover, we can conclude from our study that the tr
&lt;/p&gt;</description></item></channel></rss>