<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#26368;&#22823;&#29305;&#24449;&#20540;&#30340;&#21464;&#24322;&#24615;&#26469;&#27979;&#37327;&#22240;&#26524;&#20851;&#31995;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#20998;&#26512;&#28382;&#21518;&#30456;&#20851;&#30697;&#38453;&#30340;&#29305;&#24449;&#20540;&#30340;&#20998;&#24067;&#26469;&#27979;&#35797;&#26102;&#38388;&#21464;&#37327;&#20043;&#38388;&#30340;&#32467;&#26500;&#20851;&#31995;&#65292;&#24182;&#24212;&#29992;&#20110;&#20998;&#26512;&#38646;&#21806;&#32463;&#32426;&#21830;&#27599;&#26085;&#36135;&#24065;&#27969;&#37327;&#20043;&#38388;&#30340;&#22240;&#26524;&#20381;&#36182;&#20851;&#31995;&#12290;</title><link>http://arxiv.org/abs/2307.04953</link><description>&lt;p&gt;
&#29992;&#26368;&#22823;&#29305;&#24449;&#20540;&#30340;&#21464;&#24322;&#24615;&#27979;&#37327;&#22240;&#26524;&#20851;&#31995;
&lt;/p&gt;
&lt;p&gt;
Measuring Cause-Effect with the Variability of the Largest Eigenvalue. (arXiv:2307.04953v1 [q-fin.PM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2307.04953
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#29992;&#26368;&#22823;&#29305;&#24449;&#20540;&#30340;&#21464;&#24322;&#24615;&#26469;&#27979;&#37327;&#22240;&#26524;&#20851;&#31995;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#20998;&#26512;&#28382;&#21518;&#30456;&#20851;&#30697;&#38453;&#30340;&#29305;&#24449;&#20540;&#30340;&#20998;&#24067;&#26469;&#27979;&#35797;&#26102;&#38388;&#21464;&#37327;&#20043;&#38388;&#30340;&#32467;&#26500;&#20851;&#31995;&#65292;&#24182;&#24212;&#29992;&#20110;&#20998;&#26512;&#38646;&#21806;&#32463;&#32426;&#21830;&#27599;&#26085;&#36135;&#24065;&#27969;&#37327;&#20043;&#38388;&#30340;&#22240;&#26524;&#20381;&#36182;&#20851;&#31995;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#27979;&#35797;&#21644;&#30417;&#27979;&#26102;&#38388;&#21464;&#37327;&#20043;&#38388;&#32467;&#26500;&#20851;&#31995;&#30340;&#26041;&#27861;&#12290;&#20351;&#29992;&#28382;&#21518;&#30456;&#20851;&#30697;&#38453;&#30340;&#31532;&#19968;&#20010;&#29305;&#24449;&#20540;&#30340;&#20998;&#24067;&#65288;Tracy-Widom&#20998;&#24067;&#65289;&#65292;&#26469;&#27979;&#35797;&#21464;&#37327;&#20043;&#38388;&#30340;&#32467;&#26500;&#26102;&#38388;&#20851;&#31995;&#19982;&#22791;&#36873;&#20551;&#35774;&#65288;&#29420;&#31435;&#24615;&#65289;&#30456;&#23545;&#12290;&#35813;&#20998;&#24067;&#30740;&#31350;&#20102;&#26368;&#22823;&#29305;&#24449;&#20540;&#38543;&#28382;&#21518;&#30340;&#28176;&#36817;&#21160;&#24577;&#12290;&#36890;&#36807;&#20998;&#26512;&#20855;&#26377;&#19981;&#21516;&#28382;&#21518;&#30340;$2\times 2$&#30456;&#20851;&#30697;&#38453;&#30340;&#26368;&#22823;&#29305;&#24449;&#20540;&#30340;&#26631;&#20934;&#24046;&#30340;&#26102;&#38388;&#24207;&#21015;&#65292;&#25105;&#20204;&#21487;&#20197;&#20998;&#26512;&#19982;Tracy-Widom&#20998;&#24067;&#30340;&#20559;&#31163;&#65292;&#20197;&#27979;&#35797;&#36825;&#20004;&#20010;&#26102;&#38388;&#21464;&#37327;&#20043;&#38388;&#30340;&#32467;&#26500;&#20851;&#31995;&#65292;&#36825;&#20123;&#20851;&#31995;&#21487;&#20197;&#19982;&#22240;&#26524;&#20851;&#31995;&#30456;&#20851;&#32852;&#12290;&#25105;&#20204;&#20351;&#29992;&#19981;&#21516;&#28382;&#21518;&#30340;&#31532;&#19968;&#20010;&#29305;&#24449;&#20540;&#30340;&#26631;&#20934;&#24046;&#20316;&#20026;&#27979;&#35797;&#21644;&#30417;&#27979;&#32467;&#26500;&#22240;&#26524;&#20851;&#31995;&#30340;&#20195;&#29702;&#12290;&#35813;&#26041;&#27861;&#34987;&#24212;&#29992;&#20110;&#20998;&#26512;&#38646;&#21806;&#32463;&#32426;&#21830;&#27599;&#26085;&#36135;&#24065;&#27969;&#37327;&#20043;&#38388;&#30340;&#22240;&#26524;&#20381;&#36182;&#20851;&#31995;&#12290;
&lt;/p&gt;
&lt;p&gt;
We present a method to test and monitor structural relationships between time variables. The distribution of the first eigenvalue for lagged correlation matrices (Tracy-Widom distribution) is used to test structural time relationships between variables against the alternative hypothesis (Independence). This distribution studies the asymptotic dynamics of the largest eigenvalue as a function of the lag in lagged correlation matrices. By analyzing the time series of the standard deviation of the greatest eigenvalue for $2\times 2$ correlation matrices with different lags we can analyze deviations from the Tracy-Widom distribution to test structural relationships between these two time variables. These relationships can be related to causality. We use the standard deviation of the first eigenvalue at different lags as a proxy for testing and monitoring structural causal relationships. The method is applied to analyse causal dependencies between daily monetary flows in a retail brokerage b
&lt;/p&gt;</description></item></channel></rss>