<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#39118;&#38505;&#38477;&#20302;&#35774;&#35745;&#21644;&#36816;&#33829;&#24037;&#20855;&#21253;&#65288;RDOT&#65289;&#20013;&#30340;90&#31181;&#31574;&#30053;&#65292;&#36825;&#20123;&#31574;&#30053;&#21487;&#22312;&#39640;&#24230;&#19981;&#30830;&#23450;&#30340;&#20915;&#31574;&#38382;&#39064;&#20013;&#25552;&#20379;&#26377;&#25928;&#30340;&#21709;&#24212;&#12290;&#36825;&#20123;&#31574;&#30053;&#21253;&#25324;&#23558;&#31283;&#20581;&#24615;&#32435;&#20837;&#35774;&#35745;&#12289;&#20107;&#21518;&#39044;&#38450;&#25514;&#26045;&#31561;&#65292;&#33021;&#22815;&#24110;&#21161;&#24037;&#31243;&#24072;&#12289;&#20844;&#20849;&#35268;&#21010;&#32773;&#21644;&#20854;&#20182;&#20915;&#31574;&#32773;&#24212;&#23545;&#25361;&#25112;&#12290;</title><link>http://arxiv.org/abs/2309.03133</link><description>&lt;p&gt;
&#39118;&#38505;&#38477;&#20302;&#35774;&#35745;&#21644;&#36816;&#33829;&#24037;&#20855;&#21253;: &#31649;&#29702;&#20915;&#31574;&#38382;&#39064;&#20013;&#30340;&#39118;&#38505;&#21644;&#19981;&#30830;&#23450;&#24615;&#30340;90&#31181;&#31574;&#30053;
&lt;/p&gt;
&lt;p&gt;
Risk-reducing design and operations toolkit: 90 strategies for managing risk and uncertainty in decision problems. (arXiv:2309.03133v1 [q-fin.RM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.03133
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#39118;&#38505;&#38477;&#20302;&#35774;&#35745;&#21644;&#36816;&#33829;&#24037;&#20855;&#21253;&#65288;RDOT&#65289;&#20013;&#30340;90&#31181;&#31574;&#30053;&#65292;&#36825;&#20123;&#31574;&#30053;&#21487;&#22312;&#39640;&#24230;&#19981;&#30830;&#23450;&#30340;&#20915;&#31574;&#38382;&#39064;&#20013;&#25552;&#20379;&#26377;&#25928;&#30340;&#21709;&#24212;&#12290;&#36825;&#20123;&#31574;&#30053;&#21253;&#25324;&#23558;&#31283;&#20581;&#24615;&#32435;&#20837;&#35774;&#35745;&#12289;&#20107;&#21518;&#39044;&#38450;&#25514;&#26045;&#31561;&#65292;&#33021;&#22815;&#24110;&#21161;&#24037;&#31243;&#24072;&#12289;&#20844;&#20849;&#35268;&#21010;&#32773;&#21644;&#20854;&#20182;&#20915;&#31574;&#32773;&#24212;&#23545;&#25361;&#25112;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#19981;&#30830;&#23450;&#24615;&#26159;&#20915;&#31574;&#20998;&#26512;&#20013;&#26222;&#36941;&#23384;&#22312;&#30340;&#25361;&#25112;&#65292;&#20915;&#31574;&#29702;&#35770;&#25215;&#35748;&#20004;&#31867;&#35299;&#20915;&#26041;&#26696;: &#27010;&#29575;&#27169;&#22411;&#21644;&#35748;&#30693;&#21551;&#21457;&#24335;&#12290;&#28982;&#32780;&#65292;&#24037;&#31243;&#24072;&#12289;&#20844;&#20849;&#35268;&#21010;&#32773;&#21644;&#20854;&#20182;&#20915;&#31574;&#32773;&#20351;&#29992;&#30340;&#26159;&#21478;&#19968;&#31867;&#34987;&#31216;&#20026;RDOT&#65288;&#39118;&#38505;&#38477;&#20302;&#35774;&#35745;&#21644;&#36816;&#33829;&#24037;&#20855;&#21253;&#65289;&#30340;&#31574;&#30053;&#12290;&#36825;&#20123;&#31574;&#30053;&#21253;&#25324;&#23558;&#31283;&#20581;&#24615;&#32435;&#20837;&#35774;&#35745;&#12289;&#20107;&#21518;&#39044;&#38450;&#25514;&#26045;&#31561;&#65292;&#24182;&#19981;&#23646;&#20110;&#27010;&#29575;&#27169;&#22411;&#25110;&#35748;&#30693;&#21551;&#21457;&#24335;&#30340;&#31867;&#21035;&#12290;&#27492;&#22806;&#65292;&#30456;&#21516;&#30340;&#31574;&#30053;&#20986;&#29616;&#22312;&#22810;&#20010;&#39046;&#22495;&#21644;&#23398;&#31185;&#20013;&#65292;&#25351;&#21521;&#20102;&#19968;&#20010;&#37325;&#35201;&#30340;&#20849;&#20139;&#24037;&#20855;&#21253;&#12290;&#26412;&#25991;&#30340;&#37325;&#28857;&#26159;&#24320;&#21457;&#36825;&#20123;&#31574;&#30053;&#30340;&#30446;&#24405;&#24182;&#20026;&#20854;&#24320;&#21457;&#19968;&#20010;&#26694;&#26550;&#12290;&#26412;&#25991;&#21457;&#29616;&#20102;&#36229;&#36807;90&#20010;&#23646;&#20110;&#20845;&#20010;&#24191;&#27867;&#31867;&#21035;&#30340;&#36825;&#26679;&#30340;&#31574;&#30053;&#65292;&#24182;&#35748;&#20026;&#23427;&#20204;&#23545;&#20110;&#30001;&#20110;&#39640;&#24230;&#19981;&#30830;&#23450;&#24615;&#32780;&#20284;&#20046;&#26840;&#25163;&#30340;&#20915;&#31574;&#38382;&#39064;&#25552;&#20379;&#20102;&#39640;&#25928;&#30340;&#21709;&#24212;&#12290;&#28982;&#21518;&#65292;&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#23558;&#23427;&#20204;&#32435;&#20837;&#20915;&#31574;&#27169;&#22411;&#30340;&#26694;&#26550;&#12290;
&lt;/p&gt;
&lt;p&gt;
Uncertainty is a pervasive challenge in decision analysis, and decision theory recognizes two classes of solutions: probabilistic models and cognitive heuristics. However, engineers, public planners and other decision-makers instead use a third class of strategies that could be called RDOT (Risk-reducing Design and Operations Toolkit). These include incorporating robustness into designs, contingency planning, and others that do not fall into the categories of probabilistic models or cognitive heuristics. Moreover, identical strategies appear in several domains and disciplines, pointing to an important shared toolkit.  The focus of this paper is to develop a catalog of such strategies and develop a framework for them. The paper finds more than 90 examples of such strategies falling into six broad categories and argues that they provide an efficient response to decision problems that are seemingly intractable due to high uncertainty. It then proposes a framework to incorporate them into 
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#21033;&#29992;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#20998;&#26512;&#32929;&#31080;&#24066;&#22330;&#19978;&#19978;&#24066;&#20844;&#21496;&#30340;&#24180;&#24230;&#25253;&#21578;&#65292;&#29983;&#25104;&#27934;&#23519;&#65292;&#24182;&#36890;&#36807;&#21382;&#21490;&#32929;&#20215;&#25968;&#25454;&#35757;&#32451;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#65292;&#21462;&#24471;&#30456;&#23545;&#26631;&#26222;500&#25351;&#25968;&#30340;&#36229;&#39069;&#22238;&#25253;&#12290;</title><link>http://arxiv.org/abs/2309.03079</link><description>&lt;p&gt;
GPT-InvestAR: &#21033;&#29992;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#22686;&#24378;&#32929;&#31080;&#25237;&#36164;&#31574;&#30053;&#36890;&#36807;&#24180;&#24230;&#25253;&#21578;&#20998;&#26512;
&lt;/p&gt;
&lt;p&gt;
GPT-InvestAR: Enhancing Stock Investment Strategies through Annual Report Analysis with Large Language Models. (arXiv:2309.03079v1 [q-fin.ST])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.03079
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#21033;&#29992;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#20998;&#26512;&#32929;&#31080;&#24066;&#22330;&#19978;&#19978;&#24066;&#20844;&#21496;&#30340;&#24180;&#24230;&#25253;&#21578;&#65292;&#29983;&#25104;&#27934;&#23519;&#65292;&#24182;&#36890;&#36807;&#21382;&#21490;&#32929;&#20215;&#25968;&#25454;&#35757;&#32451;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#65292;&#21462;&#24471;&#30456;&#23545;&#26631;&#26222;500&#25351;&#25968;&#30340;&#36229;&#39069;&#22238;&#25253;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#19978;&#24066;&#20844;&#21496;&#30340;&#24180;&#24230;&#25253;&#21578;&#21253;&#21547;&#20102;&#20851;&#20110;&#20854;&#36130;&#21153;&#29366;&#20917;&#30340;&#37325;&#35201;&#20449;&#24687;&#65292;&#21487;&#20197;&#24110;&#21161;&#35780;&#20272;&#20854;&#23545;&#32929;&#31080;&#20215;&#26684;&#30340;&#28508;&#22312;&#24433;&#21709;&#12290;&#36825;&#20123;&#25253;&#21578;&#30340;&#20869;&#23481;&#38750;&#24120;&#20840;&#38754;&#65292;&#26377;&#26102;&#29978;&#33267;&#36229;&#36807;100&#39029;&#12290;&#21363;&#20351;&#23545;&#20110;&#19968;&#20010;&#20844;&#21496;&#26469;&#35828;&#65292;&#20998;&#26512;&#36825;&#20123;&#25253;&#21578;&#20063;&#26159;&#19968;&#39033;&#32321;&#29712;&#30340;&#24037;&#20316;&#65292;&#26356;&#19981;&#29992;&#35828;&#25972;&#20010;&#20844;&#21496;&#32676;&#20307;&#20102;&#12290;&#22810;&#24180;&#26469;&#65292;&#37329;&#34701;&#19987;&#23478;&#24050;&#32463;&#33021;&#22815;&#30456;&#23545;&#24555;&#36895;&#22320;&#20174;&#36825;&#20123;&#25991;&#20214;&#20013;&#25552;&#21462;&#26377;&#20215;&#20540;&#30340;&#20449;&#24687;&#12290;&#28982;&#32780;&#65292;&#36825;&#38656;&#35201;&#22810;&#24180;&#30340;&#23454;&#36341;&#21644;&#32463;&#39564;&#12290;&#26412;&#25991;&#26088;&#22312;&#36890;&#36807;&#21033;&#29992;&#22823;&#22411;&#35821;&#35328;&#27169;&#22411;&#65288;LLMs&#65289;&#30340;&#33021;&#21147;&#65292;&#31616;&#21270;&#23545;&#25152;&#26377;&#20844;&#21496;&#24180;&#24230;&#25253;&#21578;&#30340;&#35780;&#20272;&#36807;&#31243;&#12290;LLM&#29983;&#25104;&#30340;&#27934;&#23519;&#21147;&#34987;&#27719;&#32534;&#22312;&#19968;&#20010;&#37327;&#21270;&#39118;&#26684;&#30340;&#25968;&#25454;&#38598;&#20013;&#65292;&#24182;&#36890;&#36807;&#21382;&#21490;&#32929;&#20215;&#25968;&#25454;&#36827;&#34892;&#34917;&#20805;&#12290;&#28982;&#21518;&#20351;&#29992;LLM&#36755;&#20986;&#20316;&#20026;&#29305;&#24449;&#35757;&#32451;&#19968;&#31181;&#26426;&#22120;&#23398;&#20064;&#27169;&#22411;&#12290;&#21069;&#21521;&#27979;&#35797;&#32467;&#26524;&#26174;&#31034;&#30456;&#23545;&#20110;&#26631;&#26222;500&#25351;&#25968;&#33719;&#24471;&#20102;&#26377;&#24076;&#26395;&#30340;&#36229;&#39069;&#22238;&#25253;&#12290;&#26412;&#25991;&#26088;&#22312;
&lt;/p&gt;
&lt;p&gt;
Annual Reports of publicly listed companies contain vital information about their financial health which can help assess the potential impact on Stock price of the firm. These reports are comprehensive in nature, going up to, and sometimes exceeding, 100 pages. Analysing these reports is cumbersome even for a single firm, let alone the whole universe of firms that exist. Over the years, financial experts have become proficient in extracting valuable information from these documents relatively quickly. However, this requires years of practice and experience. This paper aims to simplify the process of assessing Annual Reports of all the firms by leveraging the capabilities of Large Language Models (LLMs). The insights generated by the LLM are compiled in a Quant styled dataset and augmented by historical stock price data. A Machine Learning model is then trained with LLM outputs as features. The walkforward test results show promising outperformance wrt S&amp;P500 returns. This paper intends
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20379;&#20102;&#37329;&#34701;&#24066;&#22330;&#26032;&#23450;&#20041;&#30340;&#35777;&#26126;&#65292;&#36890;&#36807;&#26500;&#36896;&#23450;&#29702;&#26469;&#30830;&#23450;&#26032;&#23450;&#20041;&#20013;&#30340;&#25928;&#29992;&#26354;&#32447;&#24418;&#29366;&#12290;&#19982;&#26631;&#20934;&#29702;&#35770;&#19981;&#21516;&#65292;&#26032;&#23450;&#20041;&#20013;&#20986;&#29616;&#20102;&#20005;&#26684;&#20985;&#24615;&#12289;&#20005;&#26684;&#20984;&#24615;&#25110;&#32447;&#24615;&#30340;&#24773;&#20917;&#12290;</title><link>http://arxiv.org/abs/2309.03003</link><description>&lt;p&gt;
&#37329;&#34701;&#24066;&#22330;&#26032;&#23450;&#20041;&#30340;&#35777;&#26126;
&lt;/p&gt;
&lt;p&gt;
Proofs for the New Definitions in Financial Markets. (arXiv:2309.03003v1 [q-fin.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.03003
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20379;&#20102;&#37329;&#34701;&#24066;&#22330;&#26032;&#23450;&#20041;&#30340;&#35777;&#26126;&#65292;&#36890;&#36807;&#26500;&#36896;&#23450;&#29702;&#26469;&#30830;&#23450;&#26032;&#23450;&#20041;&#20013;&#30340;&#25928;&#29992;&#26354;&#32447;&#24418;&#29366;&#12290;&#19982;&#26631;&#20934;&#29702;&#35770;&#19981;&#21516;&#65292;&#26032;&#23450;&#20041;&#20013;&#20986;&#29616;&#20102;&#20005;&#26684;&#20985;&#24615;&#12289;&#20005;&#26684;&#20984;&#24615;&#25110;&#32447;&#24615;&#30340;&#24773;&#20917;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26500;&#36896;&#23450;&#29702;&#21487;&#20197;&#24110;&#21161;&#30830;&#23450;&#37329;&#34701;&#24066;&#22330;&#26032;&#23450;&#20041;&#20013;&#26500;&#25104;&#30340;&#26576;&#20123;&#25928;&#29992;&#26354;&#32447;&#30340;&#24418;&#29366;&#12290;&#26412;&#30740;&#31350;&#26088;&#22312;&#20026;&#36825;&#20123;&#23450;&#29702;&#25552;&#20379;&#35777;&#26126;&#12290;&#23613;&#31649;&#39118;&#38505;&#21388;&#24694;&#12289;&#39118;&#38505;&#29233;&#22909;&#21644;&#39118;&#38505;&#20013;&#24615;&#31561;&#26415;&#35821;&#22312;&#26631;&#20934;&#29702;&#35770;&#20013;&#20998;&#21035;&#31561;&#21516;&#20110;&#20005;&#26684;&#20985;&#24615;&#12289;&#20005;&#26684;&#20984;&#24615;&#21644;&#32447;&#24615;&#65292;&#20294;&#26576;&#20123;&#26032;&#23450;&#20041;&#28385;&#36275;&#20005;&#26684;&#20985;&#24615;&#25110;&#20005;&#26684;&#20984;&#24615;&#65292;&#25110;&#32447;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Constructing theorems can help to determine the shape of certain utility curves that make up the new definitions in financial markets. The aim of this study was to present proofs for these theorems. Although the terms of risk-averse, risk-loving, and risk-neutral are equivalent to strict concavity, strict convexity, and linearity, respectively, in standard theory, certain new definitions satisfy strict concavity or strict convexity, or linearity.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#20010;&#31163;&#32447;&#23398;&#20064;&#26041;&#27861;&#65292;&#36890;&#36807;&#38750;&#21442;&#25968;&#20272;&#35745;&#20256;&#25773;&#27169;&#22411;&#65292;&#24182;&#24341;&#20837;&#24754;&#35266;&#30340;&#25439;&#22833;&#21151;&#33021;&#26469;&#32771;&#34385;&#20272;&#35745;&#30340;&#20256;&#25773;&#22120;&#30340;&#19981;&#30830;&#23450;&#24615;&#12290;</title><link>http://arxiv.org/abs/2309.02994</link><description>&lt;p&gt;
&#19968;&#20010;&#31163;&#32447;&#23398;&#20064;&#26041;&#27861;&#29992;&#20110;&#20256;&#25773;&#27169;&#22411;
&lt;/p&gt;
&lt;p&gt;
An Offline Learning Approach to Propagator Models. (arXiv:2309.02994v1 [math.OC])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.02994
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25552;&#20986;&#20102;&#19968;&#20010;&#31163;&#32447;&#23398;&#20064;&#26041;&#27861;&#65292;&#36890;&#36807;&#38750;&#21442;&#25968;&#20272;&#35745;&#20256;&#25773;&#27169;&#22411;&#65292;&#24182;&#24341;&#20837;&#24754;&#35266;&#30340;&#25439;&#22833;&#21151;&#33021;&#26469;&#32771;&#34385;&#20272;&#35745;&#30340;&#20256;&#25773;&#22120;&#30340;&#19981;&#30830;&#23450;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#32771;&#34385;&#20102;&#19968;&#20010;&#31163;&#32447;&#23398;&#20064;&#38382;&#39064;&#65292;&#20854;&#20013;&#19968;&#20010;&#20195;&#29702;&#39318;&#20808;&#20174;&#38745;&#24577;&#25968;&#25454;&#38598;&#20013;&#20272;&#35745;&#26410;&#30693;&#30340;&#20215;&#26684;&#20914;&#20987;&#26680;&#65292;&#28982;&#21518;&#35774;&#35745;&#31574;&#30053;&#20197;&#24179;&#20179;&#39118;&#38505;&#36164;&#20135;&#21516;&#26102;&#20135;&#29983;&#30701;&#26242;&#30340;&#20215;&#26684;&#20914;&#20987;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#26041;&#27861;&#65292;&#36890;&#36807;&#21253;&#21547;&#30456;&#20851;&#20215;&#26684;&#36712;&#36857;&#12289;&#20132;&#26131;&#20449;&#21495;&#21644;&#20803;&#35746;&#21333;&#30340;&#25968;&#25454;&#38598;&#23545;&#20256;&#25773;&#32773;&#36827;&#34892;&#38750;&#21442;&#25968;&#20272;&#35745;&#12290;&#25105;&#20204;&#20351;&#29992;&#19968;&#20010;&#21462;&#20915;&#20110;&#25968;&#25454;&#38598;&#30340;&#24230;&#37327;&#26631;&#20934;&#26469;&#37327;&#21270;&#20272;&#35745;&#20256;&#25773;&#22120;&#30340;&#20934;&#30830;&#24615;&#12290;&#25105;&#20204;&#34920;&#26126;&#65292;&#19968;&#20010;&#20165;&#22522;&#20110;&#20272;&#35745;&#30340;&#20256;&#25773;&#32773;&#20351;&#29992;&#36138;&#23146;&#31574;&#30053;&#26469;&#23613;&#37327;&#20943;&#23569;&#20132;&#26131;&#25104;&#26412;&#30340;&#20132;&#26131;&#32773;&#20250;&#30001;&#20110;&#20132;&#26131;&#31574;&#30053;&#19982;&#20272;&#35745;&#22120;&#20043;&#38388;&#25152;&#35859;&#30340;&#20266;&#30456;&#20851;&#24615;&#20197;&#21450;&#30001;&#20110;&#26377;&#20559;&#25104;&#26412;&#21151;&#33021;&#24341;&#36215;&#30340;&#22266;&#26377;&#19981;&#30830;&#23450;&#24615;&#32780;&#36935;&#21040;&#27425;&#20248;&#24615;&#12290;&#36890;&#36807;&#37319;&#29992;&#31163;&#32447;&#24378;&#21270;&#23398;&#20064;&#26041;&#27861;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#20010;&#24754;&#35266;&#30340;&#25439;&#22833;&#21151;&#33021;&#65292;&#23558;&#20272;&#35745;&#30340;&#20256;&#25773;&#22120;&#30340;&#19981;&#30830;&#23450;&#24615;&#32771;&#34385;&#22312;&#20869;&#65292;&#24182;&#24102;&#26377;&#20248;&#21270;&#22120;&#12290;
&lt;/p&gt;
&lt;p&gt;
We consider an offline learning problem for an agent who first estimates an unknown price impact kernel from a static dataset, and then designs strategies to liquidate a risky asset while creating transient price impact. We propose a novel approach for a nonparametric estimation of the propagator from a dataset containing correlated price trajectories, trading signals and metaorders. We quantify the accuracy of the estimated propagator using a metric which depends explicitly on the dataset. We show that a trader who tries to minimise her execution costs by using a greedy strategy purely based on the estimated propagator will encounter suboptimality due to so-called spurious correlation between the trading strategy and the estimator and due to intrinsic uncertainty resulting from a biased cost functional. By adopting an offline reinforcement learning approach, we introduce a pessimistic loss functional taking the uncertainty of the estimated propagator into account, with an optimiser wh
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#39282;&#26009;&#25104;&#26412;&#39118;&#38505;&#23545;&#27700;&#20135;&#20859;&#27542;&#20272;&#20540;&#21644;&#20915;&#31574;&#30340;&#24433;&#21709;&#65292;&#24182;&#25104;&#21151;&#25552;&#20986;&#20102;&#20351;&#29992;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#25512;&#26029;&#20915;&#31574;&#36793;&#30028;&#30340;&#26041;&#27861;&#65292;&#23545;&#20110;&#25913;&#36827;&#20256;&#32479;&#26041;&#27861;&#30340;&#22238;&#24402;&#21644;&#26354;&#32447;&#25311;&#21512;&#26041;&#27861;&#24050;&#21462;&#24471;&#20102;&#26174;&#33879;&#30340;&#25913;&#21892;&#12290;</title><link>http://arxiv.org/abs/2309.02970</link><description>&lt;p&gt;
&#20851;&#20110;&#39282;&#26009;&#25104;&#26412;&#39118;&#38505;&#23545;&#27700;&#20135;&#20859;&#27542;&#20272;&#20540;&#21644;&#20915;&#31574;&#30340;&#24433;&#21709;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
On the Impact of Feeding Cost Risk in Aquaculture Valuation and Decision Making. (arXiv:2309.02970v1 [q-fin.RM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.02970
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#30740;&#31350;&#20102;&#39282;&#26009;&#25104;&#26412;&#39118;&#38505;&#23545;&#27700;&#20135;&#20859;&#27542;&#20272;&#20540;&#21644;&#20915;&#31574;&#30340;&#24433;&#21709;&#65292;&#24182;&#25104;&#21151;&#25552;&#20986;&#20102;&#20351;&#29992;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#25512;&#26029;&#20915;&#31574;&#36793;&#30028;&#30340;&#26041;&#27861;&#65292;&#23545;&#20110;&#25913;&#36827;&#20256;&#32479;&#26041;&#27861;&#30340;&#22238;&#24402;&#21644;&#26354;&#32447;&#25311;&#21512;&#26041;&#27861;&#24050;&#21462;&#24471;&#20102;&#26174;&#33879;&#30340;&#25913;&#21892;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#39282;&#26009;&#25104;&#26412;&#30340;&#38543;&#26426;&#24615;&#23545;&#20197;&#21160;&#29289;&#20026;&#22522;&#30784;&#30340;&#21830;&#21697;&#30340;&#24433;&#21709;&#65292;&#29305;&#21035;&#20851;&#27880;&#27700;&#20135;&#20859;&#27542;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#25105;&#20204;&#20351;&#29992;&#22823;&#35910;&#26399;&#36135;&#26469;&#25512;&#26029;&#40081;&#40060;&#39282;&#26009;&#30340;&#38543;&#26426;&#34892;&#20026;&#65292;&#25105;&#20204;&#20551;&#35774;&#20854;&#36981;&#24490;Schwartz-2&#22240;&#23376;&#27169;&#22411;&#12290;&#25105;&#20204;&#27604;&#36739;&#20102;&#20197;&#30830;&#23450;&#24615;&#25110;&#38543;&#26426;&#39282;&#26009;&#25104;&#26412;&#65288;&#21363;&#21253;&#25324;&#39282;&#26009;&#25104;&#26412;&#39118;&#38505;&#65289;&#20570;&#20986;&#25910;&#33719;&#40081;&#40060;&#30340;&#20915;&#31574;&#35268;&#21017;&#12290;&#25105;&#20204;&#30830;&#23450;&#20102;&#32771;&#34385;&#38543;&#26426;&#39282;&#26009;&#25104;&#26412;&#26102;&#20250;&#26377;&#26126;&#26174;&#25913;&#21892;&#30340;&#24773;&#20917;&#65292;&#20063;&#26377;&#30830;&#23450;&#24615;&#39282;&#26009;&#25104;&#26412;&#36275;&#22815;&#22909;&#30340;&#24773;&#20917;&#12290;&#28982;&#32780;&#65292;&#22312;&#25152;&#26377;&#36825;&#20123;&#24773;&#20917;&#19979;&#65292;&#26032;&#25512;&#23548;&#20986;&#30340;&#35268;&#21017;&#22343;&#26174;&#31034;&#20986;&#20248;&#36234;&#30340;&#24615;&#33021;&#65292;&#32780;&#38468;&#21152;&#30340;&#35745;&#31639;&#25104;&#26412;&#20960;&#20046;&#21487;&#20197;&#24573;&#30053;&#19981;&#35745;&#12290;&#20174;&#26041;&#27861;&#35770;&#19978;&#26469;&#35828;&#65292;&#25105;&#20204;&#23637;&#31034;&#20102;&#22914;&#20309;&#21033;&#29992;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#26469;&#25512;&#26029;&#20915;&#31574;&#36793;&#30028;&#65292;&#20197;&#30830;&#23450;&#25910;&#33719;&#25110;&#24310;&#32493;&#65292;&#25913;&#36827;&#20102;&#26356;&#20256;&#32479;&#30340;&#22238;&#24402;&#21644;&#26354;&#32447;&#25311;&#21512;&#26041;&#27861;&#12290;&#20026;&#20102;&#23454;&#29616;&#36825;&#19968;&#30446;&#26631;&#65292;&#25105;&#20204;&#20351;&#29992;&#20102;
&lt;/p&gt;
&lt;p&gt;
We study the effect of stochastic feeding costs on animal-based commodities with particular focus on aquaculture. More specifically, we use soybean futures to infer on the stochastic behaviour of salmon feed, which we assume to follow a Schwartz-2-factor model. We compare the decision of harvesting salmon using a decision rule assuming either deterministic or stochastic feeding costs, i.e. including feeding cost risk. We identify cases, where accounting for stochastic feeding costs leads to significant improvements as well as cases where deterministic feeding costs are a good enough proxy. Nevertheless, in all of these cases, the newly derived rules show superior performance, while the additional computational costs are negligible. From a methodological point of view, we demonstrate how to use Deep-Neural-Networks to infer on the decision boundary that determines harvesting or continuation, improving on more classical regression-based and curve-fitting methods. To achieve this we use a
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#29420;&#31435;&#35780;&#20272;&#20102;&#35199;&#29677;&#29273;&#21644;&#33889;&#33796;&#29273;&#25919;&#24220;&#20110;2022&#24180;6&#26376;&#24341;&#20837;&#30340;&#20234;&#27604;&#21033;&#20122;&#20363;&#22806;&#65288;IE&#65289;&#23545;&#20110;&#28040;&#36153;&#32773;&#21644;&#36890;&#32960;&#30340;&#32463;&#27982;&#25928;&#24212;&#12290;&#36890;&#36807;&#23545;&#21069;100&#22825;&#30005;&#21147;&#24066;&#22330;&#30340;&#25968;&#25454;&#36827;&#34892;&#20998;&#26512;&#65292;&#20316;&#32773;&#23545;&#25919;&#24220;&#23545;&#20110;&#36825;&#19968;&#25514;&#26045;&#23545;&#21463;&#24433;&#21709;&#30340;&#28040;&#36153;&#32773;&#20135;&#29983;&#31215;&#26497;&#24433;&#21709;&#30340;&#20272;&#35745;&#25552;&#20986;&#20102;&#36136;&#30097;&#12290;</title><link>http://arxiv.org/abs/2309.02608</link><description>&lt;p&gt;
&#12298;&#20234;&#27604;&#21033;&#20122;&#20363;&#22806;&#65306;&#21069;100&#22825;&#30340;&#24433;&#21709;&#27010;&#36848;&#12299;
&lt;/p&gt;
&lt;p&gt;
The Iberian Exception: An overview of its effects over its first 100 days. (arXiv:2309.02608v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.02608
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#29420;&#31435;&#35780;&#20272;&#20102;&#35199;&#29677;&#29273;&#21644;&#33889;&#33796;&#29273;&#25919;&#24220;&#20110;2022&#24180;6&#26376;&#24341;&#20837;&#30340;&#20234;&#27604;&#21033;&#20122;&#20363;&#22806;&#65288;IE&#65289;&#23545;&#20110;&#28040;&#36153;&#32773;&#21644;&#36890;&#32960;&#30340;&#32463;&#27982;&#25928;&#24212;&#12290;&#36890;&#36807;&#23545;&#21069;100&#22825;&#30005;&#21147;&#24066;&#22330;&#30340;&#25968;&#25454;&#36827;&#34892;&#20998;&#26512;&#65292;&#20316;&#32773;&#23545;&#25919;&#24220;&#23545;&#20110;&#36825;&#19968;&#25514;&#26045;&#23545;&#21463;&#24433;&#21709;&#30340;&#28040;&#36153;&#32773;&#20135;&#29983;&#31215;&#26497;&#24433;&#21709;&#30340;&#20272;&#35745;&#25552;&#20986;&#20102;&#36136;&#30097;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#23545;&#20110;&#35199;&#29677;&#29273;&#21644;&#33889;&#33796;&#29273;&#25919;&#24220;&#20110;2022&#24180;6&#26376;&#24341;&#20837;&#30340;&#20234;&#27604;&#21033;&#20122;&#20363;&#22806;&#65288;IE&#65289;&#30340;&#26576;&#20123;&#32463;&#27982;&#25928;&#24212;&#36827;&#34892;&#20102;&#29420;&#31435;&#35780;&#20272;&#12290;&#20182;&#20204;&#25152;&#22768;&#26126;&#30340;&#30446;&#26631;&#26159;&#38477;&#20302;&#21361;&#26426;&#30340;&#35745;&#21010;&#30005;&#21147;&#20215;&#26684;&#65288;&#30001;&#20110;&#19982;&#20420;&#32599;&#26031;&#20837;&#20405;&#20044;&#20811;&#20848;&#26377;&#20851;&#30340;&#32039;&#24352;&#22269;&#38469;&#22825;&#28982;&#27668;&#24066;&#22330;&#23548;&#33268;&#30340;&#20215;&#26684;&#19978;&#28072;&#65289;&#65292;&#20174;&#32780;&#38477;&#20302;&#20197;&#35813;&#35745;&#21010;&#30005;&#21147;&#24066;&#22330;&#20026;&#22522;&#20934;&#30340;&#28040;&#36153;&#32773;&#30340;&#38646;&#21806;&#30005;&#21147;&#20215;&#26684;&#12290;&#21478;&#19968;&#20010;&#30446;&#26631;&#26159;&#38477;&#20302;&#19982;&#25903;&#25345;&#20197;&#35745;&#21010;&#30005;&#21147;&#24066;&#22330;&#20026;&#22522;&#20934;&#30340;&#38646;&#21806;&#20215;&#26684;&#30456;&#20851;&#30340;&#35199;&#29677;&#29273;&#36890;&#32960;&#12290;&#20316;&#32773;&#20351;&#29992;&#20102;IE&#21069;100&#22825;&#30340;&#27599;&#23567;&#26102;&#30005;&#21147;&#24066;&#22330;&#25968;&#25454;&#65292;&#23545;&#25919;&#24220;&#23545;&#20110;&#23545;&#21463;&#24433;&#21709;&#30340;&#28040;&#36153;&#32773;&#65288;&#20854;&#20013;&#21253;&#25324;&#36229;&#36807;1000&#19975;&#20010;&#23567;&#28040;&#36153;&#32773;&#20197;&#21450;&#35768;&#22810;&#22823;&#28040;&#36153;&#32773;&#65289;&#30340;&#25514;&#26045;&#20135;&#29983;&#31215;&#26497;&#25928;&#26524;&#30340;&#20272;&#35745;&#36827;&#34892;&#20102;&#36136;&#30097;&#12290;&#20182;&#20204;&#35748;&#20026;&#23545;&#38646;&#21806;&#20215;&#26684;&#30340;IE&#30340;&#20272;&#35745;&#25928;&#26524;&#21462;&#20915;&#20110;&#20551;&#35774;&#30340;&#21453;&#20107;&#23454;&#24773;&#20917;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper offers an independent assessment of certain economic effects of the Iberian Exception (IE) which was introduced in June 2022 by the Spanish and Portuguese governments. Their stated aim was to reduce wholesale spot electricity prices (which were rising alarmingly due to tight international gas markets related to Russia s invasion of Ukraine) and thereby reduce retail electricity prices for consumers whose prices were linked to that wholesale market. Another aim was to reduce Spanish inflation, which was linked to a regulated electricity retail price indexed to the wholesale spot market. Using hourly data on the wholesale electricity market for the first 100 days of the IE, the authors question the Spanish Governments estimate of the beneficial effects of the measure for affected consumers, which included over 10 million small consumers as well as many large ones. They argue that the estimated effect of the IE on retail prices depends on the assumed counterfactual. Although co
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#30001;&#30072;&#21464;&#20989;&#25968;&#29983;&#25104;&#30340;&#21160;&#24577;&#39118;&#38505;&#24230;&#37327;&#21644;&#30456;&#24212;&#30340;&#21160;&#24577;&#19968;&#33268;&#21487;&#25509;&#21463;&#25351;&#25968;(DCAIs)&#12290;&#35777;&#26126;&#20102;Choquet&#31215;&#20998;&#30340;&#26465;&#20214;&#29256;&#26412;&#26159;&#21160;&#24577;&#19968;&#33268;&#39118;&#38505;&#24230;&#37327;(DCRMs)&#65292;&#24182;&#24341;&#20837;&#20102;&#21160;&#24577;&#21152;&#26435;&#39118;&#38505;&#24230;&#37327;&#30340;&#31867;&#12290;&#35777;&#26126;&#20102;&#36825;&#20004;&#31867;&#39118;&#38505;&#24230;&#37327;&#26159;&#19968;&#33268;&#30340;&#12290;&#30740;&#31350;&#20102;&#30001;&#30072;&#21464;&#20989;&#25968;&#29983;&#25104;&#30340;DCRMs&#30340;&#19968;&#20123;&#24615;&#36136;&#20197;&#21450;&#23427;&#20204;&#30340;&#26102;&#19968;&#33268;&#24615;&#12290;</title><link>http://arxiv.org/abs/2309.02570</link><description>&lt;p&gt;
&#21160;&#24577;&#39118;&#38505;&#24230;&#37327;&#21644;&#30072;&#21464;&#20989;&#25968;&#29983;&#25104;&#30340;&#21160;&#24577;&#24615;&#33021;&#24230;&#37327;&#30340;&#26102;&#19968;&#33268;&#24615;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Time consistency of dynamic risk measures and dynamic performance measures generated by distortion functions. (arXiv:2309.02570v1 [q-fin.RM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.02570
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#30001;&#30072;&#21464;&#20989;&#25968;&#29983;&#25104;&#30340;&#21160;&#24577;&#39118;&#38505;&#24230;&#37327;&#21644;&#30456;&#24212;&#30340;&#21160;&#24577;&#19968;&#33268;&#21487;&#25509;&#21463;&#25351;&#25968;(DCAIs)&#12290;&#35777;&#26126;&#20102;Choquet&#31215;&#20998;&#30340;&#26465;&#20214;&#29256;&#26412;&#26159;&#21160;&#24577;&#19968;&#33268;&#39118;&#38505;&#24230;&#37327;(DCRMs)&#65292;&#24182;&#24341;&#20837;&#20102;&#21160;&#24577;&#21152;&#26435;&#39118;&#38505;&#24230;&#37327;&#30340;&#31867;&#12290;&#35777;&#26126;&#20102;&#36825;&#20004;&#31867;&#39118;&#38505;&#24230;&#37327;&#26159;&#19968;&#33268;&#30340;&#12290;&#30740;&#31350;&#20102;&#30001;&#30072;&#21464;&#20989;&#25968;&#29983;&#25104;&#30340;DCRMs&#30340;&#19968;&#20123;&#24615;&#36136;&#20197;&#21450;&#23427;&#20204;&#30340;&#26102;&#19968;&#33268;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#26088;&#22312;&#30740;&#31350;&#22312;&#21160;&#24577;&#31163;&#25955;&#26102;&#38388;&#35774;&#32622;&#20013;&#30001;&#30072;&#21464;&#20989;&#25968;&#29983;&#25104;&#30340;&#39118;&#38505;&#24230;&#37327;&#65292;&#24182;&#30740;&#31350;&#30456;&#24212;&#30340;&#21160;&#24577;&#19968;&#33268;&#21487;&#25509;&#21463;&#25351;&#25968;(DCAIs)&#12290;&#39318;&#20808;&#25105;&#20204;&#35777;&#26126;&#20102;Choquet&#31215;&#20998;&#30340;&#26465;&#20214;&#29256;&#26412;&#30830;&#23454;&#26159;&#21160;&#24577;&#19968;&#33268;&#39118;&#38505;&#24230;&#37327;(DCRMs)&#65292;&#24182;&#24341;&#20837;&#20102;&#21160;&#24577;&#21152;&#26435;&#39118;&#38505;&#24230;&#37327;&#30340;&#31867;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#36825;&#20004;&#31867;&#39118;&#38505;&#24230;&#37327;&#26159;&#19968;&#33268;&#30340;&#12290;&#22312;&#21160;&#24577;&#19968;&#33268;&#21487;&#25509;&#21463;&#25351;&#25968;&#30340;&#40065;&#26834;&#34920;&#31034;&#23450;&#29702;&#30340;&#31934;&#31070;&#19979;&#65292;&#25105;&#20204;&#24314;&#31435;&#20102;&#30001;&#30072;&#21464;&#20989;&#25968;&#29983;&#25104;&#30340;&#21160;&#24577;&#19968;&#33268;&#39118;&#38505;&#24230;&#37327;&#26063;&#30340;&#19968;&#20123;&#30456;&#20851;&#24615;&#36136;&#65292;&#24182;&#23450;&#20041;&#21644;&#30740;&#31350;&#20102;&#30456;&#24212;&#30340;DCAIs&#12290;&#20854;&#27425;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#30001;&#30072;&#21464;&#20989;&#25968;&#29983;&#25104;&#30340;&#21160;&#24577;&#19968;&#33268;&#39118;&#38505;&#24230;&#37327;&#21644;DCAIs&#30340;&#26102;&#19968;&#33268;&#24615;&#12290;&#29305;&#21035;&#22320;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#36825;&#26679;&#30340;DCRMs&#26159;&#27425;&#39532;&#19969;&#26684;&#23572;&#26102;&#19968;&#33268;&#30340;&#65292;&#20294;&#19981;&#26159;&#36229;&#39532;&#19969;&#26684;&#23572;&#26102;&#19968;&#33268;&#30340;&#12290;&#25105;&#20204;&#36824;&#35777;&#26126;&#20102;&#30001;&#30072;&#21464;&#20989;&#25968;&#29983;&#25104;&#30340;DCRMs&#24182;&#19981;&#26159;&#24369;&#25509;&#21463;&#26102;&#19968;&#33268;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
The aim of this work is to study risk measures generated by distortion functions in a dynamic discrete time setup, and to investigate the corresponding dynamic coherent acceptability indices (DCAIs) generated by families of such risk measures. First we show that conditional version of Choquet integrals indeed are dynamic coherent risk measures (DCRMs), and also introduce the class of dynamic weighted value at risk measures. We prove that these two classes of risk measures coincides. In the spirit of robust representations theorem for DCAIs, we establish some relevant properties of families of DCRMs generated by distortion functions, and then define and study the corresponding DCAIs. Second, we study the time consistency of DCRMs and DCAIs generated by distortion functions. In particular, we prove that such DCRMs are sub-martingale time consistent, but they are not super-martingale time consistent. We also show that DCRMs generated by distortion functions are not weakly acceptance time 
&lt;/p&gt;</description></item><item><title>&#32463;&#27982;&#22797;&#26434;&#24615;&#38480;&#21046;&#20102;&#21033;&#29992;&#39640;&#26031;&#20998;&#24067;&#36827;&#34892;&#20215;&#26684;&#27010;&#29575;&#39044;&#27979;&#30340;&#20934;&#30830;&#24615;&#65292;&#22240;&#20026;&#39044;&#27979;&#38656;&#35201;&#23545;&#32463;&#27982;&#21464;&#37327;&#36827;&#34892;&#25551;&#36848;&#65292;&#32780;&#36825;&#20123;&#21464;&#37327;&#30340;&#32479;&#35745;&#30697;&#38656;&#35201;&#23545;&#32463;&#27982;&#25110;&#24066;&#22330;&#20132;&#26131;&#30340;&#24130;&#27425;&#36827;&#34892;&#35745;&#31639;&#12290;</title><link>http://arxiv.org/abs/2309.02447</link><description>&lt;p&gt;
&#39640;&#26031;&#20998;&#24067;&#22312;&#20215;&#26684;&#27010;&#29575;&#39044;&#27979;&#20013;&#30340;&#32463;&#27982;&#22797;&#26434;&#24615;&#38480;&#21046;
&lt;/p&gt;
&lt;p&gt;
Economic Complexity Limits Accuracy of Price Probability Predictions by Gaussian Distributions. (arXiv:2309.02447v1 [q-fin.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.02447
&lt;/p&gt;
&lt;p&gt;
&#32463;&#27982;&#22797;&#26434;&#24615;&#38480;&#21046;&#20102;&#21033;&#29992;&#39640;&#26031;&#20998;&#24067;&#36827;&#34892;&#20215;&#26684;&#27010;&#29575;&#39044;&#27979;&#30340;&#20934;&#30830;&#24615;&#65292;&#22240;&#20026;&#39044;&#27979;&#38656;&#35201;&#23545;&#32463;&#27982;&#21464;&#37327;&#36827;&#34892;&#25551;&#36848;&#65292;&#32780;&#36825;&#20123;&#21464;&#37327;&#30340;&#32479;&#35745;&#30697;&#38656;&#35201;&#23545;&#32463;&#27982;&#25110;&#24066;&#22330;&#20132;&#26131;&#30340;&#24130;&#27425;&#36827;&#34892;&#35745;&#31639;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20215;&#26684;&#21644;&#22238;&#25253;&#27010;&#29575;&#39044;&#27979;&#30340;&#20934;&#30830;&#24615;&#22312;&#36164;&#20135;&#23450;&#20215;&#21644;&#25237;&#36164;&#32452;&#21512;&#29702;&#35770;&#30340;&#21487;&#38752;&#24615;&#20013;&#20855;&#26377;&#37325;&#35201;&#20316;&#29992;&#12290;&#25105;&#20204;&#24320;&#21457;&#20102;&#36880;&#27493;&#36924;&#36817;&#30340;&#26041;&#27861;&#65292;&#23558;&#25972;&#20010;&#32929;&#24066;&#30340;&#24066;&#22330;&#27010;&#29575;&#39044;&#27979;&#19982;&#29305;&#23450;&#20844;&#21496;&#32929;&#31080;&#30340;&#20215;&#26684;&#21644;&#22238;&#25253;&#27010;&#29575;&#39044;&#27979;&#30456;&#36830;&#25509;&#65292;&#21516;&#26102;&#20063;&#23637;&#31034;&#20102;&#32463;&#27982;&#22797;&#26434;&#24615;&#38480;&#21046;&#20102;&#20219;&#20309;&#39044;&#27979;&#30340;&#20934;&#30830;&#24615;&#12290;&#36825;&#31181;&#38480;&#21046;&#30340;&#32463;&#27982;&#26681;&#28304;&#22312;&#20110;&#20215;&#26684;&#21644;&#22238;&#25253;&#30340;&#32479;&#35745;&#30697;&#38656;&#35201;&#23545;&#32463;&#27982;&#21464;&#37327;&#36827;&#34892;&#25551;&#36848;&#65292;&#36825;&#20123;&#21464;&#37327;&#26159;&#22312;&#24179;&#22343;&#26102;&#38388;&#38388;&#38548;&#20869;&#32463;&#27982;&#25110;&#24066;&#22330;&#20132;&#26131;&#30340;m&#27425;&#24130;&#20043;&#21644;&#12290;&#35797;&#22270;&#39044;&#27979;&#21463;&#21333;&#19968;&#39118;&#38505;&#24433;&#21709;&#30340;&#32929;&#31080;&#30340;&#31532;n&#20010;&#32479;&#35745;&#30697;&#20250;&#23548;&#33268;&#23545;&#32463;&#27982;&#20027;&#20307;&#30340;n&#32500;&#39118;&#38505;&#35780;&#32423;&#21521;&#37327;&#36827;&#34892;&#20272;&#35745;&#12290;&#32780;&#36825;&#20123;&#39118;&#38505;&#35780;&#32423;&#21521;&#37327;&#36215;&#21040;&#20102;&#22352;&#26631;&#30340;&#20316;&#29992;
&lt;/p&gt;
&lt;p&gt;
The accuracy of predictions of price and return probabilities substantially determines the reliability of asset pricing and portfolio theories. We develop successive approximations that link up predictions of the market-based probabilities of price and return for the whole stock market with predictions of price and return probabilities for stocks of a particular company and show that economic complexity limits the accuracy of any forecasts. The economic origin of the restrictions lies in the fact that the predictions of the m-th statistical moments of price and return require descriptions of the economic variables composed by sums of the m-th powers of economic or market transactions during an averaging time interval. The attempts to predict the n-th statistical moments of price and return of stocks that are under the action of a single risk result in estimates of the n-dimensional risk rating vectors for economic agents. In turn, the risk rating vectors play the role of coordinates fo
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;&#19968;&#31181;&#38754;&#23545;&#22810;&#31181;&#27169;&#22411;&#19981;&#30830;&#23450;&#24615;&#30340;&#20877;&#20445;&#38505;&#21830;&#31574;&#30053;&#65292;&#20854;&#36890;&#36807;&#35774;&#35745;&#26368;&#22823;&#21270;&#39044;&#26399;&#36130;&#23500;&#30340;&#20877;&#20445;&#38505;&#21512;&#21516;&#65292;&#24182;&#22312;&#20445;&#38505;&#21830;&#27169;&#22411;&#30340;&#37325;&#24515;&#22833;&#30495;&#19979;&#23450;&#20215;&#65292;&#35299;&#20915;&#20102;&#36830;&#32493;&#26102;&#38388;&#30340;&#39046;&#23548;&#32773;-&#36861;&#38543;&#32773;&#21338;&#24328;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2308.11828</link><description>&lt;p&gt;
&#22810;&#23478;&#20445;&#38505;&#21830;&#30340;&#26368;&#20248;&#40065;&#26834;&#20877;&#20445;&#38505;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Optimal Robust Reinsurance with Multiple Insurers. (arXiv:2308.11828v1 [q-fin.RM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.11828
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#25506;&#35752;&#20102;&#19968;&#31181;&#38754;&#23545;&#22810;&#31181;&#27169;&#22411;&#19981;&#30830;&#23450;&#24615;&#30340;&#20877;&#20445;&#38505;&#21830;&#31574;&#30053;&#65292;&#20854;&#36890;&#36807;&#35774;&#35745;&#26368;&#22823;&#21270;&#39044;&#26399;&#36130;&#23500;&#30340;&#20877;&#20445;&#38505;&#21512;&#21516;&#65292;&#24182;&#22312;&#20445;&#38505;&#21830;&#27169;&#22411;&#30340;&#37325;&#24515;&#22833;&#30495;&#19979;&#23450;&#20215;&#65292;&#35299;&#20915;&#20102;&#36830;&#32493;&#26102;&#38388;&#30340;&#39046;&#23548;&#32773;-&#36861;&#38543;&#32773;&#21338;&#24328;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#19968;&#23478;&#38754;&#20020;&#22810;&#20010;&#27169;&#22411;&#19981;&#30830;&#23450;&#24615;&#30340;&#20877;&#20445;&#38505;&#21830;&#12290;&#20877;&#20445;&#38505;&#21830;&#21521;$n$&#23478;&#20445;&#38505;&#21830;&#25552;&#20379;&#21512;&#21516;&#65292;&#20854;&#32034;&#36180;&#36981;&#24490;&#19981;&#21516;&#30340;&#22797;&#21512;&#27850;&#26494;&#36807;&#31243;&#12290;&#30001;&#20110;&#20877;&#20445;&#38505;&#21830;&#23545;&#20110;&#20445;&#38505;&#21830;&#30340;&#32034;&#36180;&#20005;&#37325;&#31243;&#24230;&#20998;&#24067;&#21644;&#39057;&#29575;&#23384;&#22312;&#19981;&#30830;&#23450;&#24615;&#65292;&#20182;&#20204;&#35774;&#35745;&#20102;&#26368;&#22823;&#21270;&#39044;&#26399;&#36130;&#23500;&#30340;&#20877;&#20445;&#38505;&#21512;&#21516;&#65292;&#21516;&#26102;&#36824;&#38656;&#35201;&#25215;&#25285;&#19968;&#20010;&#29109;&#24809;&#32602;&#12290;&#32780;&#20445;&#38505;&#21830;&#21017;&#23547;&#27714;&#22312;&#26080;&#27495;&#20041;&#30340;&#24773;&#20917;&#19979;&#26368;&#22823;&#21270;&#20182;&#20204;&#30340;&#39044;&#26399;&#25928;&#29992;&#12290;&#25105;&#20204;&#35299;&#20915;&#20102;&#36825;&#20010;&#36830;&#32493;&#26102;&#38388;&#30340;&#39046;&#23548;&#32773;-&#36861;&#38543;&#32773;&#21338;&#24328;&#38382;&#39064;&#65292;&#24471;&#21040;&#20877;&#20445;&#38505;&#21830;&#22312;&#20445;&#38505;&#21830;&#27169;&#22411;&#30340;&#37325;&#24515;&#22833;&#30495;&#19979;&#30340;&#23450;&#20215;&#26041;&#24335;&#12290;&#25105;&#20204;&#23558;&#36825;&#20123;&#32467;&#26524;&#24212;&#29992;&#21040;&#27604;&#20363;&#20877;&#20445;&#38505;&#21644;&#36229;&#39069;&#25439;&#22833;&#20877;&#20445;&#38505;&#21512;&#21516;&#65292;&#24182;&#36827;&#34892;&#20102;&#25968;&#20540;&#35299;&#26512;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36824;&#35299;&#20915;&#20102;&#20877;&#20445;&#38505;&#21830;&#22312;&#27169;&#31946;&#24773;&#20917;&#19979;&#26368;&#22823;&#21270;&#20182;&#20204;&#30340;&#39044;&#26399;&#25928;&#29992;&#30340;&#30456;&#20851;&#38382;&#39064;&#65292;&#24182;&#27604;&#36739;&#20102;&#35299;&#30340;&#19981;&#21516;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study a reinsurer who faces multiple sources of model uncertainty. The reinsurer offers contracts to $n$ insurers whose claims follow different compound Poisson processes. As the reinsurer is uncertain about the insurers' claim severity distributions and frequencies, they design reinsurance contracts that maximise their expected wealth subject to an entropy penalty. Insurers meanwhile seek to maximise their expected utility without ambiguity. We solve this continuous-time Stackelberg game for general reinsurance contracts and find that the reinsurer prices under a distortion of the barycentre of the insurers' models. We apply our results to proportional reinsurance and excess-of-loss reinsurance contracts, and illustrate the solutions numerically. Furthermore, we solve the related problem where the reinsurer maximises, still under ambiguity, their expected utility and compare the solutions.
&lt;/p&gt;</description></item><item><title>&#36890;&#36807;&#30740;&#31350;&#19968;&#20010;&#31616;&#21333;&#30340;&#37325;&#22797;&#21338;&#24328;&#27169;&#22411;&#65292;&#25105;&#20204;&#21457;&#29616;&#19981;&#21516;&#35266;&#28857;&#23545;&#32676;&#20307;&#29983;&#20135;&#32489;&#25928;&#26377;&#30528;&#19981;&#21516;&#30340;&#24433;&#21709;&#12290;&#19981;&#21516;&#30340;&#35266;&#28857;&#20250;&#23548;&#33268;&#19981;&#21516;&#30340;&#25216;&#26415;&#21644;&#21162;&#21147;&#36873;&#25321;&#65292;&#32780;&#35266;&#28857;&#20043;&#38388;&#30340;&#20998;&#27495;&#22312;&#19968;&#23450;&#31243;&#24230;&#19978;&#21487;&#20197;&#28608;&#21169;&#20048;&#35266;&#20027;&#20041;&#32773;&#26356;&#21162;&#21147;&#22320;&#24037;&#20316;&#65292;&#20294;&#20063;&#21487;&#33021;&#38477;&#20302;&#24576;&#30097;&#20027;&#20041;&#32773;&#30340;&#21162;&#21147;&#12290;&#22312;&#23384;&#22312;&#36275;&#22815;&#24378;&#30340;&#22806;&#37096;&#24615;&#19979;&#65292;&#19968;&#20010;&#20855;&#26377;&#20998;&#27495;&#35266;&#28857;&#30340;&#22242;&#38431;&#21487;&#20197;&#22312;&#39044;&#26399;&#20135;&#20986;&#26041;&#38754;&#36229;&#36807;&#19968;&#20010;&#26377;&#31867;&#20284;&#35266;&#28857;&#30340;&#22242;&#38431;&#12290;</title><link>http://arxiv.org/abs/2308.06607</link><description>&lt;p&gt;
&#19981;&#21516;&#35266;&#28857;&#22914;&#20309;&#24433;&#21709;&#19968;&#20010;&#32676;&#20307;&#30340;&#29983;&#20135;&#32489;&#25928;&#65306;&#19968;&#20010;&#31616;&#21333;&#30340;&#37325;&#22797;&#21338;&#24328;&#27169;&#22411;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
The Disagreement Dividend. (arXiv:2308.06607v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2308.06607
&lt;/p&gt;
&lt;p&gt;
&#36890;&#36807;&#30740;&#31350;&#19968;&#20010;&#31616;&#21333;&#30340;&#37325;&#22797;&#21338;&#24328;&#27169;&#22411;&#65292;&#25105;&#20204;&#21457;&#29616;&#19981;&#21516;&#35266;&#28857;&#23545;&#32676;&#20307;&#29983;&#20135;&#32489;&#25928;&#26377;&#30528;&#19981;&#21516;&#30340;&#24433;&#21709;&#12290;&#19981;&#21516;&#30340;&#35266;&#28857;&#20250;&#23548;&#33268;&#19981;&#21516;&#30340;&#25216;&#26415;&#21644;&#21162;&#21147;&#36873;&#25321;&#65292;&#32780;&#35266;&#28857;&#20043;&#38388;&#30340;&#20998;&#27495;&#22312;&#19968;&#23450;&#31243;&#24230;&#19978;&#21487;&#20197;&#28608;&#21169;&#20048;&#35266;&#20027;&#20041;&#32773;&#26356;&#21162;&#21147;&#22320;&#24037;&#20316;&#65292;&#20294;&#20063;&#21487;&#33021;&#38477;&#20302;&#24576;&#30097;&#20027;&#20041;&#32773;&#30340;&#21162;&#21147;&#12290;&#22312;&#23384;&#22312;&#36275;&#22815;&#24378;&#30340;&#22806;&#37096;&#24615;&#19979;&#65292;&#19968;&#20010;&#20855;&#26377;&#20998;&#27495;&#35266;&#28857;&#30340;&#22242;&#38431;&#21487;&#20197;&#22312;&#39044;&#26399;&#20135;&#20986;&#26041;&#38754;&#36229;&#36807;&#19968;&#20010;&#26377;&#31867;&#20284;&#35266;&#28857;&#30340;&#22242;&#38431;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#22312;&#19968;&#20010;&#24102;&#26377;&#26367;&#20195;&#29983;&#20135;&#25216;&#26415;&#21644;&#27491;&#22806;&#37096;&#24615;&#30340;&#31616;&#21333;&#37325;&#22797;&#21338;&#24328;&#20013;&#65292;&#35266;&#28857;&#19981;&#21516;&#22914;&#20309;&#24433;&#21709;&#32676;&#20307;&#30340;&#29983;&#20135;&#32489;&#25928;&#12290;&#21442;&#19982;&#32773;&#21487;&#20197;&#25345;&#26377;&#19981;&#21516;&#30340;&#35266;&#28857;&#65292;&#21363;&#23545;&#25216;&#26415;&#30340;&#29305;&#24615;&#21644;&#36136;&#37327;&#25345;&#26377;&#19981;&#21516;&#30340;&#30475;&#27861;&#12290;&#36825;&#31181;&#20998;&#27495;&#26377;&#20004;&#20010;&#20027;&#35201;&#29305;&#28857;&#12290;&#39318;&#20808;&#65292;&#19981;&#21516;&#30340;&#35266;&#28857;&#20250;&#23548;&#33268;&#19981;&#21516;&#30340;&#25216;&#26415;&#21644;&#21162;&#21147;&#36873;&#25321;--&#8220;&#20048;&#35266;&#8221;&#30340;&#35266;&#28857;&#20250;&#23548;&#33268;&#27604;&#8220;&#24576;&#30097;&#8221;&#30340;&#35266;&#28857;&#26356;&#39640;&#30340;&#21162;&#21147;&#31243;&#24230;&#12290;&#20854;&#27425;&#65292;&#35266;&#28857;&#26159;&#26377;&#38887;&#24615;&#30340;--&#21482;&#26377;&#22312;&#20986;&#20046;&#24847;&#26009;&#30340;&#35777;&#25454;&#35777;&#26126;&#20854;&#20026;&#38169;&#35823;&#26102;&#25165;&#20250;&#21457;&#29983;&#21464;&#21270;&#12290;&#24403;&#21482;&#26377;&#19968;&#31181;&#29983;&#20135;&#25216;&#26415;&#21487;&#29992;&#26102;&#65292;&#23545;&#20854;&#29983;&#20135;&#21147;&#30340;&#20998;&#27495;(i)&#28608;&#21169;&#20048;&#35266;&#20027;&#20041;&#32773;&#27604;&#19982;&#26377;&#31867;&#20284;&#35266;&#28857;&#30340;&#29609;&#23478;&#21305;&#37197;&#26102;&#26356;&#21162;&#21147;&#22320;&#24037;&#20316;&#65307;(ii)&#21487;&#20197;&#38477;&#20302;&#24576;&#30097;&#20027;&#20041;&#32773;&#30340;&#21162;&#21147;&#12290;&#31532;&#19968;&#20010;&#21147;&#37327;&#26500;&#25104;&#20102;&#25105;&#20204;&#25152;&#35859;&#30340;&#8220;&#20998;&#27495;&#32418;&#21033;&#8221;&#30340;&#26680;&#24515;&#12290;&#25105;&#20204;&#23637;&#31034;&#20102;&#22914;&#26524;&#22806;&#37096;&#24615;&#36275;&#22815;&#24378;&#65292;&#19968;&#20010;&#26377;&#31867;&#20284;&#35266;&#28857;&#30340;&#20048;&#35266;&#20027;&#20041;&#32773;&#22242;&#38431;&#22312;&#39044;&#26399;&#20135;&#20986;&#26041;&#38754;&#20250;&#34987;&#19968;&#20010;&#20855;&#26377;&#20998;&#27495;&#35266;&#28857;&#30340;&#22242;&#38431;&#22312;&#34920;&#29616;&#19978;&#36229;&#36807;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study how disagreement influences the productive performance of a group in a simple repeated game with alternative production technologies and positive externalities. Players can disagree, i.e. hold different views about the characteristics and quality of the technologies. This disagreement has two main characteristics. First, different views lead to different technology and effort choices -- "optimistic" views justify higher effort than "skeptical" views. Second, views are resilient -- changed only if falsified by surprising evidence. When only one production technology is available, disagreement over its productivity (i) incentivizes the optimistic agent to work harder than when matched with a like-minded player; (ii) can reduce the effort of the skeptic agent. The first force lies at the core of what we call the "disagreement dividend." We show that if externalities are sufficiently strong, a team of like-minded optimists is outperformed -- in terms of expected output -- by a dis
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#30005;&#21147;&#24066;&#22330;&#20013;&#30340;&#30005;&#20215;&#27874;&#21160;&#27169;&#22411;&#65292;&#24182;&#21457;&#29616;&#22312;&#38750;&#21361;&#26426;&#26102;&#26399;&#22235;&#22240;&#23376;&#27169;&#22411;&#27604;&#19977;&#22240;&#23376;&#27169;&#22411;&#26356;&#20026;&#36866;&#29992;&#12290;</title><link>http://arxiv.org/abs/2306.07731</link><description>&lt;p&gt;
&#30005;&#21147;&#24066;&#22330;&#20013;&#30340;&#22823;&#22411;&#30005;&#20215;&#27874;&#21160;&#24314;&#27169;
&lt;/p&gt;
&lt;p&gt;
Modeling Large Spot Price Deviations in Electricity Markets. (arXiv:2306.07731v1 [q-fin.MF])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.07731
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#30005;&#21147;&#24066;&#22330;&#20013;&#30340;&#30005;&#20215;&#27874;&#21160;&#27169;&#22411;&#65292;&#24182;&#21457;&#29616;&#22312;&#38750;&#21361;&#26426;&#26102;&#26399;&#22235;&#22240;&#23376;&#27169;&#22411;&#27604;&#19977;&#22240;&#23376;&#27169;&#22411;&#26356;&#20026;&#36866;&#29992;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36807;&#21435;&#20004;&#24180;&#37324;&#65292;&#33021;&#28304;&#24066;&#22330;&#30340;&#19981;&#30830;&#23450;&#24615;&#22686;&#21152;&#65292;&#23548;&#33268;&#30005;&#21147;&#21363;&#26399;&#20215;&#26684;&#20986;&#29616;&#20102;&#22823;&#24133;&#27874;&#21160;&#12290;&#26412;&#25991;&#30740;&#31350;&#20102;&#32463;&#20856;&#19977;&#22240;&#23376;&#27169;&#22411;&#19982;&#39640;&#26031;&#22522;&#20449;&#21495;&#12289;&#19968;&#20010;&#27491;&#36339;&#36291;&#20449;&#21495;&#21644;&#19968;&#20010;&#36127;&#36339;&#36291;&#20449;&#21495;&#30340;&#25311;&#21512;&#65292;&#20197;&#21450;&#22312;&#36825;&#20010;&#26032;&#30340;&#24066;&#22330;&#29615;&#22659;&#19979;&#28155;&#21152;&#31532;&#20108;&#20010;&#39640;&#26031;&#22522;&#20449;&#21495;&#30340;&#24433;&#21709;&#12290;&#25105;&#20204;&#20351;&#29992;&#22522;&#20110;&#25152;&#35859;&#30340;Gibbs&#37319;&#26679;&#30340;&#39532;&#23572;&#21487;&#22827;&#38142;&#33945;&#29305;&#21345;&#32599;&#31639;&#27861;&#26469;&#26657;&#20934;&#27169;&#22411;&#12290;&#23558;&#24471;&#21040;&#30340;&#22235;&#22240;&#23376;&#27169;&#22411;&#19982;&#29305;&#23450;&#26102;&#26399;&#30340;&#19977;&#22240;&#23376;&#27169;&#22411;&#36827;&#34892;&#27604;&#36739;&#65292;&#24182;&#20351;&#29992;&#21518;&#39564;&#39044;&#27979;&#26816;&#39564;&#36827;&#34892;&#35780;&#20272;&#12290;&#27492;&#22806;&#65292;&#25105;&#20204;&#36824;&#25512;&#23548;&#20986;&#20102;&#22522;&#20110;&#22235;&#22240;&#23376;&#21363;&#26399;&#20215;&#26684;&#27169;&#22411;&#30340;&#26399;&#36135;&#21512;&#32422;&#20215;&#26684;&#30340;&#38381;&#24335;&#35299;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#22235;&#22240;&#23376;&#27169;&#22411;&#22312;&#38750;&#21361;&#26426;&#26102;&#26399;&#30340;&#34920;&#29616;&#20248;&#20110;&#19977;&#22240;&#23376;&#27169;&#22411;&#12290;&#22312;&#21361;&#26426;&#26102;&#26399;&#65292;&#31532;&#20108;&#20010;&#39640;&#26031;&#22522;&#20449;&#21495;&#24182;&#27809;&#26377;&#23548;&#33268;&#26356;&#22909;&#30340;&#25311;&#21512;&#25928;&#26524;&#12290;
&lt;/p&gt;
&lt;p&gt;
Increased insecurities on the energy markets have caused massive fluctuations of the electricity spot price within the past two years. In this work, we investigate the fit of a classical 3-factor model with a Gaussian base signal as well as one positive and one negative jump signal in this new market environment. We also study the influence of adding a second Gaussian base signal to the model. For the calibration of our model we use a Markov Chain Monte Carlo algorithm based on the so-called Gibbs sampling. The resulting 4-factor model is than compared to the 3-factor model in different time periods of particular interest and evaluated using posterior predictive checking. Additionally, we derive closed-form solutions for the price of futures contracts in our 4-factor spot price model. We find that the 4-factor model outperforms the 3-factor model in times of non-crises. In times of crises, the second Gaussian base signal does not lead to a better the fit of the model. To the best of ou
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#21152;&#23494;&#36135;&#24065;&#20132;&#26131;&#23545;&#30340;&#26368;&#20248;&#35774;&#32622;&#38382;&#39064;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#20010;&#20004;&#38454;&#27573;&#36807;&#31243;&#26469;&#35299;&#20915;&#36825;&#20010;&#20248;&#21270;&#38382;&#39064;&#12290;&#35813;&#38382;&#39064;&#30340;&#29305;&#27530;&#20043;&#22788;&#22312;&#20110;&#22823;&#37096;&#20998;&#21487;&#33021;&#30340;&#20132;&#26131;&#23545;&#20043;&#38388;&#30340;&#20132;&#26131;&#37327;&#26080;&#27861;&#30452;&#25509;&#35266;&#23519;&#65292;&#19988;&#38656;&#35201;&#28385;&#36275;&#36830;&#36890;&#24615;&#32422;&#26463;&#12290;</title><link>http://arxiv.org/abs/2210.10971</link><description>&lt;p&gt;
&#21152;&#23494;&#36135;&#24065;&#20132;&#26131;&#23545;&#30340;&#26368;&#20248;&#35774;&#32622;
&lt;/p&gt;
&lt;p&gt;
Optimal Settings for Cryptocurrency Trading Pairs. (arXiv:2210.10971v2 [q-fin.TR] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2210.10971
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#21152;&#23494;&#36135;&#24065;&#20132;&#26131;&#23545;&#30340;&#26368;&#20248;&#35774;&#32622;&#38382;&#39064;&#65292;&#24182;&#25552;&#20986;&#20102;&#19968;&#20010;&#20004;&#38454;&#27573;&#36807;&#31243;&#26469;&#35299;&#20915;&#36825;&#20010;&#20248;&#21270;&#38382;&#39064;&#12290;&#35813;&#38382;&#39064;&#30340;&#29305;&#27530;&#20043;&#22788;&#22312;&#20110;&#22823;&#37096;&#20998;&#21487;&#33021;&#30340;&#20132;&#26131;&#23545;&#20043;&#38388;&#30340;&#20132;&#26131;&#37327;&#26080;&#27861;&#30452;&#25509;&#35266;&#23519;&#65292;&#19988;&#38656;&#35201;&#28385;&#36275;&#36830;&#36890;&#24615;&#32422;&#26463;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#21152;&#23494;&#36135;&#24065;&#30340;&#30446;&#26631;&#26159;&#21435;&#20013;&#24515;&#21270;&#65292;&#25152;&#26377;&#36135;&#24065;&#21407;&#21017;&#19978;&#22320;&#20301;&#30456;&#31561;&#12290;&#19982;&#20256;&#32479;&#32929;&#24066;&#19981;&#21516;&#65292;&#27809;&#26377;&#40664;&#35748;&#30340;&#36135;&#24065;&#21333;&#20301;&#65288;&#27861;&#24065;&#65289;&#65292;&#22240;&#27492;&#21487;&#20197;&#33258;&#30001;&#35774;&#32622;&#20132;&#26131;&#23545;&#12290;&#28982;&#32780;&#65292;&#20026;&#27599;&#20004;&#31181;&#36135;&#24065;&#20043;&#38388;&#24314;&#31435;&#19968;&#20010;&#20132;&#26131;&#24066;&#22330;&#26159;&#19981;&#20999;&#23454;&#38469;&#30340;&#12290;&#20026;&#20102;&#25511;&#21046;&#31649;&#29702;&#25104;&#26412;&#24182;&#30830;&#20445;&#36275;&#22815;&#30340;&#27969;&#21160;&#24615;&#65292;&#25105;&#20204;&#24517;&#39035;&#20248;&#20808;&#32771;&#34385;&#37027;&#20123;&#22823;&#37327;&#20132;&#26131;&#30340;&#20132;&#26131;&#23545;&#65292;&#24182;&#30830;&#20445;&#25152;&#26377;&#36135;&#24065;&#37117;&#26159;&#21487;&#20197;&#20132;&#26131;&#30340;&#12290;&#25105;&#20204;&#27880;&#24847;&#21040;&#36825;&#26159;&#19968;&#20010;&#20248;&#21270;&#38382;&#39064;&#65292;&#20854;&#29305;&#27530;&#20043;&#22788;&#22312;&#20110;&#65306;1&#65289;&#22823;&#37096;&#20998;&#65288;&gt;99.5%&#65289;&#21487;&#33021;&#30340;&#20132;&#26131;&#23545;&#20043;&#38388;&#30340;&#20132;&#26131;&#37327;&#26080;&#27861;&#30452;&#25509;&#35266;&#23519;&#12290;2&#65289;&#23427;&#28385;&#36275;&#36830;&#36890;&#24615;&#32422;&#26463;&#65292;&#21363;&#20445;&#35777;&#25152;&#26377;&#36135;&#24065;&#37117;&#21487;&#20197;&#20132;&#26131;&#12290;&#20026;&#20102;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;&#25105;&#20204;&#37319;&#29992;&#20102;&#19968;&#20010;&#20004;&#38454;&#27573;&#30340;&#36807;&#31243;&#65306;1&#65289;&#22522;&#20110;&#27491;&#21017;&#21270;&#30340;&#25130;&#26029;&#29305;&#24449;&#20540;&#20998;&#35299;&#22635;&#20805;&#32570;&#22833;&#20540;&#65292;&#20854;&#20013;&#27491;&#21017;&#21270;&#39033;&#29992;&#20110;&#25511;&#21046;&#32570;&#22833;&#20540;&#34987;&#38480;&#21046;&#20026;&#38646;&#30340;&#31243;&#24230;&#12290;
&lt;/p&gt;
&lt;p&gt;
The goal of cryptocurrencies is decentralization. In principle, all currencies have equal status. Unlike traditional stock markets, there is no default currency of denomination (fiat), thus the trading pairs can be set freely. However, it is impractical to set up a trading market between every two currencies. In order to control management costs and ensure sufficient liquidity, we must give priority to covering those large-volume trading pairs and ensure that all coins are reachable. We note that this is an optimization problem. Its particularity lies in: 1) the trading volume between most (&gt;99.5%) possible trading pairs cannot be directly observed. 2) It satisfies the connectivity constraint, that is, all currencies are guaranteed to be tradable.  To solve this problem, we use a two-stage process: 1) Fill in missing values based on a regularized, truncated eigenvalue decomposition, where the regularization term is used to control what extent missing values should be limited to zero. 2
&lt;/p&gt;</description></item></channel></rss>