<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#26412;&#25991;&#26500;&#24314;&#20102;ADO-Heston&#27169;&#22411;&#65292;&#36890;&#36807;&#21512;&#36866;&#36873;&#25321;&#30340;&#24066;&#22330;&#39118;&#38505;&#20215;&#26684;&#21644;&#38381;&#24335;&#34920;&#36798;&#24335;&#65292;&#33021;&#22815;&#36817;&#20284;&#20877;&#29616;&#39321;&#33609;&#26399;&#26435;&#30340;&#24050;&#30693;&#34892;&#20026;&#12290;</title><link>http://arxiv.org/abs/2309.15044</link><description>&lt;p&gt;
ADO-Heston&#27169;&#22411;&#20013;&#30340;ATM&#38544;&#21547;&#27874;&#21160;&#29575;&#20542;&#26012;
&lt;/p&gt;
&lt;p&gt;
The ATM implied skew in the ADO-Heston model. (arXiv:2309.15044v1 [q-fin.CP])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.15044
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#26500;&#24314;&#20102;ADO-Heston&#27169;&#22411;&#65292;&#36890;&#36807;&#21512;&#36866;&#36873;&#25321;&#30340;&#24066;&#22330;&#39118;&#38505;&#20215;&#26684;&#21644;&#38381;&#24335;&#34920;&#36798;&#24335;&#65292;&#33021;&#22815;&#36817;&#20284;&#20877;&#29616;&#39321;&#33609;&#26399;&#26435;&#30340;&#24050;&#30693;&#34892;&#20026;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#26500;&#24314;&#20102;ADO-Heston&#27169;&#22411;&#65292;&#35813;&#27169;&#22411;&#26159;&#31895;&#31961;Heston-like&#27874;&#21160;&#29575;&#27169;&#22411;&#30340;&#19968;&#20010;&#39532;&#23572;&#21487;&#22827;&#36817;&#20284;&#12290;&#36890;&#36807;&#39118;&#38505;&#20013;&#24615;&#21644;&#23454;&#38469;&#24230;&#37327;&#25512;&#23548;&#20102;&#35813;&#27169;&#22411;&#30340;&#29305;&#24449;&#20989;&#25968;&#65288;CF&#65289;&#65292;&#36825;&#26159;&#19968;&#20010;&#19981;&#31283;&#23450;&#30340;&#19977;&#32500;&#20559;&#24494;&#20998;&#26041;&#31243;&#65292;&#20854;&#31995;&#25968;&#26159;&#26102;&#38388;$t$&#21644;Hurst&#25351;&#25968;$H$&#30340;&#20989;&#25968;&#12290;&#36890;&#36807;&#21512;&#29702;&#36873;&#25321;&#24066;&#22330;&#39118;&#38505;&#20215;&#26684;&#24182;&#25214;&#21040;&#23545;&#25968;&#20215;&#26684;&#21644;ATM&#38544;&#21547;&#27874;&#21160;&#29575;&#30340;&#38381;&#24335;&#34920;&#36798;&#24335;&#65292;&#25105;&#20204;&#33021;&#22815;&#22797;&#21046;&#24066;&#22330;&#38544;&#21547;&#27874;&#21160;&#29575;&#20542;&#26012;&#30340;&#24050;&#30693;&#34892;&#20026;&#12290;&#36890;&#36807;&#25552;&#20379;&#30340;&#31034;&#20363;&#65292;&#25105;&#20204;&#22768;&#31216;ADO-Heston&#27169;&#22411;&#65288;&#32431;&#25193;&#25955;&#27169;&#22411;&#65292;&#20294;&#20855;&#26377;&#26041;&#24046;&#36807;&#31243;&#30340;&#38543;&#26426;&#22343;&#20540;&#22238;&#24402;&#36895;&#24230;&#65292;&#25110;&#32773;&#26159;&#31895;&#31961;Heston&#27169;&#22411;&#30340;&#39532;&#23572;&#21487;&#22827;&#36817;&#20284;&#65289;&#33021;&#22815;&#65288;&#36817;&#20284;&#22320;&#65289;&#20877;&#29616;&#23567;$T$&#26102;&#26399;&#39321;&#33609;&#26399;&#26435;&#30340;&#24050;&#30693;&#34892;&#20026;&#12290;&#25105;&#20204;&#24471;&#20986;&#32467;&#35770;&#35748;&#20026;&#25105;&#20204;&#30340;&#38544;&#21547;&#27874;&#21160;&#29575;&#20542;&#26012;&#26354;&#32447;${\cal S}(T) \prop$
&lt;/p&gt;
&lt;p&gt;
In this paper similar to [P. Carr, A. Itkin, 2019] we construct another Markovian approximation of the rough Heston-like volatility model - the ADO-Heston model. The characteristic function (CF) of the model is derived under both risk-neutral and real measures which is an unsteady three-dimensional PDE with some coefficients being functions of the time $t$ and the Hurst exponent $H$. To replicate known behavior of the market implied skew we proceed with a wise choice of the market price of risk, and then find a closed form expression for the CF of the log-price and the ATM implied skew. Based on the provided example, we claim that the ADO-Heston model (which is a pure diffusion model but with a stochastic mean-reversion speed of the variance process, or a Markovian approximation of the rough Heston model) is able (approximately) to reproduce the known behavior of the vanilla implied skew at small $T$. We conclude that the behavior of our implied volatility skew curve ${\cal S}(T) \prop
&lt;/p&gt;</description></item><item><title>&#36825;&#31687;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#21160;&#24577;&#31995;&#32479;&#26041;&#27861;&#26469;&#21033;&#29992;&#31038;&#20250;&#36716;&#25240;&#30340;&#28508;&#21147;&#65292;&#20197;&#23454;&#29616;&#20928;&#38646;&#28201;&#23460;&#27668;&#20307;&#25490;&#25918;&#30446;&#26631;&#12290;&#35813;&#26041;&#27861;&#21253;&#25324;&#31995;&#32479;&#35266;&#12289;&#23450;&#21521;&#25968;&#25454;&#25910;&#38598;&#21644;&#20840;&#29699;&#32508;&#21512;&#27169;&#22411;&#31561;&#22810;&#23618;&#38754;&#32771;&#34385;&#12290;</title><link>http://arxiv.org/abs/2309.14964</link><description>&lt;p&gt;
&#21160;&#24577;&#31995;&#32479;&#26041;&#27861;&#26469;&#21033;&#29992;&#31038;&#20250;&#36716;&#25240;&#30340;&#28508;&#21147;
&lt;/p&gt;
&lt;p&gt;
A dynamic systems approach to harness the potential of social tipping. (arXiv:2309.14964v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.14964
&lt;/p&gt;
&lt;p&gt;
&#36825;&#31687;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#21160;&#24577;&#31995;&#32479;&#26041;&#27861;&#26469;&#21033;&#29992;&#31038;&#20250;&#36716;&#25240;&#30340;&#28508;&#21147;&#65292;&#20197;&#23454;&#29616;&#20928;&#38646;&#28201;&#23460;&#27668;&#20307;&#25490;&#25918;&#30446;&#26631;&#12290;&#35813;&#26041;&#27861;&#21253;&#25324;&#31995;&#32479;&#35266;&#12289;&#23450;&#21521;&#25968;&#25454;&#25910;&#38598;&#21644;&#20840;&#29699;&#32508;&#21512;&#27169;&#22411;&#31561;&#22810;&#23618;&#38754;&#32771;&#34385;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#31038;&#20250;&#36716;&#25240;&#28857;&#26159;&#23454;&#29616;&#20928;&#38646;&#28201;&#23460;&#27668;&#20307;&#25490;&#25918;&#30446;&#26631;&#30340;&#26377;&#24076;&#26395;&#30340;&#25163;&#27573;&#12290;&#22914;&#26524;&#35302;&#21457;&#32423;&#32852;&#30340;&#27491;&#21453;&#39304;&#26426;&#21046;&#65292;&#23427;&#20204;&#25551;&#36848;&#20102;&#31038;&#20250;&#12289;&#25919;&#27835;&#12289;&#32463;&#27982;&#25110;&#25216;&#26415;&#31995;&#32479;&#22914;&#20309;&#36805;&#36895;&#36716;&#20837;&#26032;&#29366;&#24577;&#12290;&#20998;&#26512;&#31038;&#20250;&#36716;&#25240;&#23545;&#24555;&#36895;&#33073;&#30899;&#30340;&#28508;&#21147;&#38656;&#35201;&#32771;&#34385;&#31038;&#20250;&#31995;&#32479;&#22266;&#26377;&#30340;&#22797;&#26434;&#24615;&#12290;&#22312;&#36825;&#37324;&#65292;&#25105;&#20204;&#25351;&#20986;&#29616;&#26377;&#30340;&#31185;&#23398;&#25991;&#29486;&#20542;&#21521;&#20110;&#22522;&#20110;&#21465;&#20107;&#30340;&#31038;&#20250;&#36716;&#25240;&#35760;&#36848;&#65292;&#32570;&#20047;&#24191;&#27867;&#30340;&#23454;&#35777;&#26694;&#26550;&#21644;&#22810;&#31995;&#32479;&#35270;&#35282;&#12290;&#38543;&#21518;&#65292;&#25105;&#20204;&#27010;&#36848;&#20102;&#19968;&#20010;&#21160;&#24577;&#31995;&#32479;&#26041;&#27861;&#65292;&#21253;&#25324;&#65288;i&#65289;&#28041;&#21450;&#30456;&#20114;&#20851;&#32852;&#30340;&#21453;&#39304;&#26426;&#21046;&#30340;&#31995;&#32479;&#35266;&#65307;
&lt;/p&gt;
&lt;p&gt;
Social tipping points are promising levers to achieve net-zero greenhouse gas emission targets. They describe how social, political, economic or technological systems can move rapidly into a new state if cascading positive feedback mechanisms are triggered. Analysing the potential of social tipping for rapid decarbonization requires considering the inherent complexity of social systems. Here, we identify that existing scientific literature is inclined to a narrative-based account of social tipping, lacks a broad empirical framework and a multi-systems view. We subsequently outline a dynamic systems approach that entails (i) a systems outlook involving interconnected feedback mechanisms alongside cross-system and cross-scale interactions, and including a socioeconomic and environmental injustice perspective (ii) directed data collection efforts to provide empirical evidence for and monitor social tipping dynamics, (iii) global, integrated, descriptive modelling to project future dynamic
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#36890;&#36807;&#32593;&#32476;&#24314;&#27169;&#26041;&#27861;&#35843;&#26597;&#20102;&#27874;&#20848;&#31038;&#20250;&#23545;&#33021;&#28304;&#30340;&#24577;&#24230;&#65292;&#21457;&#29616;&#25919;&#27835;&#24847;&#35782;&#24418;&#24577;&#12289;&#29615;&#22659;&#24577;&#24230;&#12289;&#39118;&#38505;&#24863;&#30693;&#12289;&#23433;&#20840;&#39038;&#34385;&#21644;&#32463;&#27982;&#21464;&#37327;&#31561;&#22240;&#32032;&#23545;&#33021;&#28304;&#25509;&#21463;&#24230;&#36215;&#37325;&#35201;&#20316;&#29992;&#12290;&#30740;&#31350;&#32467;&#26524;&#20026;&#25913;&#21892;&#27874;&#20848;&#33021;&#28304;&#25919;&#31574;&#25552;&#20379;&#20102;&#22522;&#30784;&#65292;&#24378;&#35843;&#20102;&#19982;&#27874;&#20848;&#20154;&#21475;&#30340;&#22810;&#26679;&#21270;&#20215;&#20540;&#35266;&#12289;&#20449;&#20208;&#21644;&#20559;&#22909;&#30456; resonating &#30340;&#25919;&#31574;&#30340;&#37325;&#35201;&#24615;&#12290;</title><link>http://arxiv.org/abs/2309.14869</link><description>&lt;p&gt;
&#27874;&#20848;&#30340;&#26680;&#33021;&#25509;&#21463;&#24230;&#65306;&#20174;&#31038;&#20250;&#24577;&#24230;&#21040;&#26377;&#25928;&#25919;&#31574;&#31574;&#30053;--&#32593;&#32476;&#24314;&#27169;&#26041;&#27861;
&lt;/p&gt;
&lt;p&gt;
Nuclear Energy Acceptance in Poland: From Societal Attitudes to Effective Policy Strategies -- Network Modeling Approach. (arXiv:2309.14869v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.14869
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#36890;&#36807;&#32593;&#32476;&#24314;&#27169;&#26041;&#27861;&#35843;&#26597;&#20102;&#27874;&#20848;&#31038;&#20250;&#23545;&#33021;&#28304;&#30340;&#24577;&#24230;&#65292;&#21457;&#29616;&#25919;&#27835;&#24847;&#35782;&#24418;&#24577;&#12289;&#29615;&#22659;&#24577;&#24230;&#12289;&#39118;&#38505;&#24863;&#30693;&#12289;&#23433;&#20840;&#39038;&#34385;&#21644;&#32463;&#27982;&#21464;&#37327;&#31561;&#22240;&#32032;&#23545;&#33021;&#28304;&#25509;&#21463;&#24230;&#36215;&#37325;&#35201;&#20316;&#29992;&#12290;&#30740;&#31350;&#32467;&#26524;&#20026;&#25913;&#21892;&#27874;&#20848;&#33021;&#28304;&#25919;&#31574;&#25552;&#20379;&#20102;&#22522;&#30784;&#65292;&#24378;&#35843;&#20102;&#19982;&#27874;&#20848;&#20154;&#21475;&#30340;&#22810;&#26679;&#21270;&#20215;&#20540;&#35266;&#12289;&#20449;&#20208;&#21644;&#20559;&#22909;&#30456; resonating &#30340;&#25919;&#31574;&#30340;&#37325;&#35201;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#27874;&#20848;&#33021;&#28304;&#37096;&#38376;&#30446;&#21069;&#27491;&#32463;&#21382;&#37325;&#22823;&#36716;&#22411;&#65292;&#36194;&#24471;&#20844;&#20247;&#25903;&#25345;&#23545;&#20854;&#33021;&#28304;&#25919;&#31574;&#30340;&#25104;&#21151;&#33267;&#20851;&#37325;&#35201;&#12290;&#25105;&#20204;&#36890;&#36807;&#19982;338&#21517;&#27874;&#20848;&#21442;&#19982;&#32773;&#36827;&#34892;&#30740;&#31350;&#65292;&#35843;&#26597;&#20102;&#31038;&#20250;&#23545;&#21508;&#31181;&#33021;&#28304;&#26469;&#28304;&#30340;&#24577;&#24230;&#65292;&#21253;&#25324;&#26680;&#33021;&#21644;&#21487;&#20877;&#29983;&#33021;&#28304;&#12290;&#24212;&#29992;&#20102;&#19968;&#31181;&#26032;&#39062;&#30340;&#32593;&#32476;&#26041;&#27861;&#65292;&#25105;&#20204;&#30830;&#23450;&#20102;&#24433;&#21709;&#33021;&#28304;&#25509;&#21463;&#24230;&#30340;&#22810;&#31181;&#22240;&#32032;&#12290;&#25919;&#27835;&#24847;&#35782;&#24418;&#24577;&#26159;&#22609;&#36896;&#20844;&#20247;&#25509;&#21463;&#24230;&#30340;&#26680;&#24515;&#22240;&#32032;&#65292;&#28982;&#32780;&#25105;&#20204;&#36824;&#21457;&#29616;&#29615;&#22659;&#24577;&#24230;&#12289;&#39118;&#38505;&#24863;&#30693;&#12289;&#23433;&#20840;&#39038;&#34385;&#21644;&#32463;&#27982;&#21464;&#37327;&#20063;&#36215;&#30528;&#37325;&#35201;&#20316;&#29992;&#12290;&#37492;&#20110;&#26680;&#33021;&#30340;&#38271;&#26399;&#25215;&#35834;&#21644;&#20854;&#22312;&#27874;&#20848;&#33021;&#28304;&#36716;&#22411;&#20013;&#30340;&#35282;&#33394;&#65292;&#25105;&#20204;&#30340;&#30740;&#31350;&#20026;&#25913;&#21892;&#27874;&#20848;&#30340;&#33021;&#28304;&#25919;&#31574;&#25552;&#20379;&#20102;&#22522;&#30784;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#24378;&#35843;&#20102;&#19982;&#20154;&#21475;&#30340;&#22810;&#26679;&#21270;&#20215;&#20540;&#35266;&#12289;&#20449;&#20208;&#21644;&#20559;&#22909;&#30456; resonating &#30340;&#25919;&#31574;&#30340;&#37325;&#35201;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;
Poland is currently undergoing substantial transformation in its energy sector, and gaining public support is pivotal for the success of its energy policies. We conducted a study with 338 Polish participants to investigate societal attitudes towards various energy sources, including nuclear energy and renewables. Applying a novel network approach, we identified a multitude of factors influencing energy acceptance. Political ideology is the central factor in shaping public acceptance, however we also found that environmental attitudes, risk perception, safety concerns, and economic variables play substantial roles. Considering the long-term commitment associated with nuclear energy and its role in Poland's energy transformation, our findings provide a foundation for improving energy policy in Poland. Our research underscores the importance of policies that resonate with the diverse values, beliefs, and preferences of the population. While the risk-risk trade-off and technology-focused s
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#21033;&#29992;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#36924;&#36817;&#38543;&#26426;&#27874;&#21160;&#24615;&#27169;&#22411;&#30340;&#23450;&#37327;&#35823;&#24046;&#30028;&#38480;&#65292;&#35777;&#26126;&#20102;&#22312;&#36866;&#24403;&#20551;&#35774;&#19979;&#65292;&#21487;&#20197;&#36890;&#36807;&#36739;&#23567;&#30340;&#32593;&#32476;&#35268;&#27169;&#23398;&#20064;&#24471;&#21040;&#26399;&#26435;&#20215;&#26684;&#65292;&#32780;&#19981;&#20250;&#21463;&#21040;&#32500;&#24230;&#28798;&#38590;&#30340;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2309.14784</link><description>&lt;p&gt;
&#23545;&#65288;&#31895;&#31961;&#65289;&#38543;&#26426;&#27874;&#21160;&#24615;&#27169;&#22411;&#36827;&#34892;&#28145;&#24230;&#26657;&#20934;&#30340;&#36924;&#36817;&#36895;&#29575;
&lt;/p&gt;
&lt;p&gt;
Approximation Rates for Deep Calibration of (Rough) Stochastic Volatility Models. (arXiv:2309.14784v1 [q-fin.MF])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.14784
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#21033;&#29992;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;&#36924;&#36817;&#38543;&#26426;&#27874;&#21160;&#24615;&#27169;&#22411;&#30340;&#23450;&#37327;&#35823;&#24046;&#30028;&#38480;&#65292;&#35777;&#26126;&#20102;&#22312;&#36866;&#24403;&#20551;&#35774;&#19979;&#65292;&#21487;&#20197;&#36890;&#36807;&#36739;&#23567;&#30340;&#32593;&#32476;&#35268;&#27169;&#23398;&#20064;&#24471;&#21040;&#26399;&#26435;&#20215;&#26684;&#65292;&#32780;&#19981;&#20250;&#21463;&#21040;&#32500;&#24230;&#28798;&#38590;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25512;&#23548;&#20102;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;(DNN)&#36924;&#36817;$d$&#32500;&#39118;&#38505;&#36164;&#20135;&#26399;&#26435;&#20215;&#26684;&#30340;&#23450;&#37327;&#35823;&#24046;&#30028;&#38480;&#65292;&#36825;&#20123;&#30028;&#38480;&#19982;&#22522;&#30784;&#27169;&#22411;&#21442;&#25968;&#12289;&#25903;&#20184;&#21442;&#25968;&#21644;&#21021;&#22987;&#26465;&#20214;&#30456;&#20851;&#12290;&#25105;&#20204;&#28085;&#30422;&#20102;&#39532;&#23572;&#21487;&#22827;&#24615;&#36136;&#30340;&#24191;&#20041;&#38543;&#26426;&#27874;&#21160;&#24615;&#27169;&#22411;&#20197;&#21450;&#31895;&#31961;Bergomi&#27169;&#22411;&#12290;&#29305;&#21035;&#22320;&#65292;&#22312;&#36866;&#24403;&#20551;&#35774;&#19979;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#22312;DNN&#30340;&#32593;&#32476;&#35268;&#27169;&#20165;&#27425;&#20110;&#36164;&#20135;&#21521;&#37327;&#32500;&#24230;$d$&#21644;&#31934;&#24230;&#30340;&#20498;&#25968;$\varepsilon^{-1}$&#26102;&#65292;&#26399;&#26435;&#20215;&#26684;&#21487;&#20197;&#34987;&#23398;&#20064;&#24471;&#21040;&#30340;&#35823;&#24046;&#21487;&#20197;&#20219;&#24847;&#23567;&#20110;&#19968;&#20010;&#23567;&#20110;1/2&#30340;&#35823;&#24046;$\varepsilon$&#12290;&#22240;&#27492;&#65292;&#36825;&#31181;&#36924;&#36817;&#19981;&#20250;&#21463;&#21040;&#32500;&#24230;&#28798;&#38590;&#30340;&#24433;&#21709;&#12290;&#30001;&#20110;&#22312;&#25105;&#20204;&#30340;&#35774;&#32622;&#20013;&#65292;&#36866;&#29992;&#20110;DNN&#30340;&#23450;&#37327;&#36924;&#36817;&#32467;&#26524;&#26159;&#22522;&#20110;&#32039;&#33268;&#23450;&#20041;&#22495;&#19978;&#30340;&#20989;&#25968;&#65292;&#22240;&#27492;&#25105;&#20204;&#39318;&#20808;&#32771;&#34385;&#20102;&#36164;&#20135;&#20215;&#26684;&#38480;&#21046;&#22312;&#32039;&#33268;&#38598;&#21512;&#19978;&#30340;&#24773;&#20917;&#65292;&#28982;&#21518;&#20877;&#36890;&#36807;&#23545;&#26399;&#26435;&#20215;&#26684;&#30340;&#25910;&#25947;&#24615;&#35770;&#35777;&#23558;&#36825;&#20123;&#32467;&#26524;&#25512;&#24191;&#21040;&#19968;&#33324;&#24773;&#20917;&#19979;&#12290;
&lt;/p&gt;
&lt;p&gt;
We derive quantitative error bounds for deep neural networks (DNNs) approximating option prices on a $d$-dimensional risky asset as functions of the underlying model parameters, payoff parameters and initial conditions. We cover a general class of stochastic volatility models of Markovian nature as well as the rough Bergomi model. In particular, under suitable assumptions we show that option prices can be learned by DNNs up to an arbitrary small error $\varepsilon \in (0,1/2)$ while the network size grows only sub-polynomially in the asset vector dimension $d$ and the reciprocal $\varepsilon^{-1}$ of the accuracy. Hence, the approximation does not suffer from the curse of dimensionality. As quantitative approximation results for DNNs applicable in our setting are formulated for functions on compact domains, we first consider the case of the asset price restricted to a compact set, then we extend these results to the general case by using convergence arguments for the option prices.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#23637;&#31034;&#20102;&#19968;&#31181;&#36890;&#36807;&#22312;&#21516;&#19968;&#32929;&#31080;&#24066;&#22330;&#36827;&#34892;&#20132;&#26131;&#30340;&#26041;&#24335;&#65292;&#21033;&#29992;&#28784;&#30418;&#26041;&#27861;&#23545;&#22522;&#20110;&#28145;&#24230;&#24378;&#21270;&#23398;&#20064;&#30340;&#20132;&#26131;&#20195;&#29702;&#36827;&#34892;&#25915;&#20987;&#30340;&#21487;&#33021;&#24615;&#12290;&#36825;&#31181;&#26041;&#27861;&#21487;&#20197;&#24212;&#23545;&#20132;&#26131;&#20195;&#29702;&#21463;&#21040;&#23545;&#25163;&#25805;&#32437;&#30340;&#38382;&#39064;&#12290;</title><link>http://arxiv.org/abs/2309.14615</link><description>&lt;p&gt;
&#28145;&#24230;&#24378;&#21270;&#23398;&#20064;&#20132;&#26131;&#20195;&#29702;&#30340;&#28784;&#30418;&#23545;&#25239;&#25915;&#20987;
&lt;/p&gt;
&lt;p&gt;
Gray-box Adversarial Attack of Deep Reinforcement Learning-based Trading Agents. (arXiv:2309.14615v1 [cs.LG])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.14615
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#23637;&#31034;&#20102;&#19968;&#31181;&#36890;&#36807;&#22312;&#21516;&#19968;&#32929;&#31080;&#24066;&#22330;&#36827;&#34892;&#20132;&#26131;&#30340;&#26041;&#24335;&#65292;&#21033;&#29992;&#28784;&#30418;&#26041;&#27861;&#23545;&#22522;&#20110;&#28145;&#24230;&#24378;&#21270;&#23398;&#20064;&#30340;&#20132;&#26131;&#20195;&#29702;&#36827;&#34892;&#25915;&#20987;&#30340;&#21487;&#33021;&#24615;&#12290;&#36825;&#31181;&#26041;&#27861;&#21487;&#20197;&#24212;&#23545;&#20132;&#26131;&#20195;&#29702;&#21463;&#21040;&#23545;&#25163;&#25805;&#32437;&#30340;&#38382;&#39064;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#36817;&#24180;&#26469;&#65292;&#28145;&#24230;&#24378;&#21270;&#23398;&#20064;&#65288;Deep RL&#65289;&#24050;&#25104;&#21151;&#24212;&#29992;&#20110;&#35832;&#22914;&#22797;&#26434;&#28216;&#25103;&#12289;&#33258;&#21160;&#39550;&#39542;&#27773;&#36710;&#21644;&#32842;&#22825;&#26426;&#22120;&#20154;&#31561;&#35768;&#22810;&#31995;&#32479;&#20013;&#65292;&#20854;&#20013;&#19968;&#20010;&#26377;&#36259;&#30340;&#24212;&#29992;&#26696;&#20363;&#26159;&#23558;&#20854;&#20316;&#20026;&#33258;&#21160;&#21270;&#32929;&#31080;&#20132;&#26131;&#20195;&#29702;&#12290;&#19968;&#33324;&#26469;&#35828;&#65292;&#20219;&#20309;&#33258;&#21160;&#21270;&#20132;&#26131;&#20195;&#29702;&#37117;&#23481;&#26131;&#21463;&#21040;&#20132;&#26131;&#29615;&#22659;&#20013;&#30340;&#23545;&#25163;&#30340;&#25805;&#32437;&#65292;&#22240;&#27492;&#30740;&#31350;&#20854;&#40065;&#26834;&#24615;&#23545;&#20110;&#20854;&#23454;&#36341;&#25104;&#21151;&#33267;&#20851;&#37325;&#35201;&#12290;&#28982;&#32780;&#65292;&#29992;&#20110;&#30740;&#31350;RL&#40065;&#26834;&#24615;&#30340;&#20856;&#22411;&#26426;&#21046;&#65292;&#21363;&#22522;&#20110;&#30333;&#30418;&#26799;&#24230;&#22522;&#30784;&#30340;&#23545;&#25239;&#26679;&#26412;&#29983;&#25104;&#25216;&#26415;&#65288;&#22914;FGSM&#65289;&#65292;&#23545;&#20110;&#36825;&#31181;&#29992;&#20363;&#26469;&#35828;&#24050;&#32463;&#36807;&#26102;&#65292;&#22240;&#20026;&#27169;&#22411;&#21463;&#21040;&#23433;&#20840;&#30340;&#22269;&#38469;&#20132;&#26131;&#25152;API&#30340;&#20445;&#25252;&#65292;&#22914;&#32435;&#26031;&#36798;&#20811;&#12290;&#22312;&#36825;&#39033;&#30740;&#31350;&#20013;&#65292;&#25105;&#20204;&#35777;&#26126;&#20102;&#19968;&#31181;&#8220;&#28784;&#30418;&#8221;&#26041;&#27861;&#21487;&#20197;&#25915;&#20987;&#22522;&#20110;Deep RL&#30340;&#20132;&#26131;&#20195;&#29702;&#65292;&#20165;&#36890;&#36807;&#22312;&#21516;&#19968;&#32929;&#31080;&#24066;&#22330;&#36827;&#34892;&#20132;&#26131;&#65292;&#32780;&#26080;&#38656;&#39069;&#22806;&#25509;&#35302;&#20132;&#26131;&#20195;&#29702;&#12290;&#22312;&#25105;&#20204;&#25552;&#20986;&#30340;&#26041;&#27861;&#20013;&#65292;&#23545;&#25163;&#20195;&#29702;&#20351;&#29992;&#20102;&#19968;&#20010;&#28151;&#21512;&#30340;&#28145;&#24230;&#31070;&#32463;&#32593;&#32476;
&lt;/p&gt;
&lt;p&gt;
In recent years, deep reinforcement learning (Deep RL) has been successfully implemented as a smart agent in many systems such as complex games, self-driving cars, and chat-bots. One of the interesting use cases of Deep RL is its application as an automated stock trading agent. In general, any automated trading agent is prone to manipulations by adversaries in the trading environment. Thus studying their robustness is vital for their success in practice. However, typical mechanism to study RL robustness, which is based on white-box gradient-based adversarial sample generation techniques (like FGSM), is obsolete for this use case, since the models are protected behind secure international exchange APIs, such as NASDAQ. In this research, we demonstrate that a "gray-box" approach for attacking a Deep RL-based trading agent is possible by trading in the same stock market, with no extra access to the trading agent. In our proposed approach, an adversary agent uses a hybrid Deep Neural Netwo
&lt;/p&gt;</description></item><item><title>&#36825;&#39033;&#30740;&#31350;&#22635;&#34917;&#20102;&#20851;&#20110;&#30005;&#23376;&#21830;&#21153;&#24179;&#21488;&#25512;&#33616;&#31639;&#27861;&#22312;&#31639;&#27861;&#21246;&#32467;&#30740;&#31350;&#20013;&#34987;&#24573;&#35270;&#30340;&#31354;&#30333;&#65292;&#24182;&#21457;&#29616;&#25512;&#33616;&#31639;&#27861;&#21487;&#20197;&#20915;&#23450;&#22522;&#20110;AI&#30340;&#23450;&#20215;&#31639;&#27861;&#30340;&#31454;&#20105;&#25110;&#21246;&#32467;&#21160;&#24577;&#12290;</title><link>http://arxiv.org/abs/2309.14548</link><description>&lt;p&gt;
&#31639;&#27861;&#21246;&#32467;&#36824;&#26159;&#31454;&#20105;&#65306;&#24179;&#21488;&#25512;&#33616;&#31995;&#32479;&#30340;&#35282;&#33394;
&lt;/p&gt;
&lt;p&gt;
Algorithmic Collusion or Competition: the Role of Platforms' Recommender Systems. (arXiv:2309.14548v1 [cs.AI])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.14548
&lt;/p&gt;
&lt;p&gt;
&#36825;&#39033;&#30740;&#31350;&#22635;&#34917;&#20102;&#20851;&#20110;&#30005;&#23376;&#21830;&#21153;&#24179;&#21488;&#25512;&#33616;&#31639;&#27861;&#22312;&#31639;&#27861;&#21246;&#32467;&#30740;&#31350;&#20013;&#34987;&#24573;&#35270;&#30340;&#31354;&#30333;&#65292;&#24182;&#21457;&#29616;&#25512;&#33616;&#31639;&#27861;&#21487;&#20197;&#20915;&#23450;&#22522;&#20110;AI&#30340;&#23450;&#20215;&#31639;&#27861;&#30340;&#31454;&#20105;&#25110;&#21246;&#32467;&#21160;&#24577;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26368;&#36817;&#30340;&#23398;&#26415;&#30740;&#31350;&#24191;&#27867;&#25506;&#35752;&#20102;&#22522;&#20110;&#20154;&#24037;&#26234;&#33021;(AI)&#30340;&#21160;&#24577;&#23450;&#20215;&#31639;&#27861;&#23548;&#33268;&#30340;&#31639;&#27861;&#21246;&#32467;&#12290;&#28982;&#32780;&#65292;&#30005;&#23376;&#21830;&#21153;&#24179;&#21488;&#20351;&#29992;&#25512;&#33616;&#31639;&#27861;&#26469;&#20998;&#37197;&#19981;&#21516;&#20135;&#21697;&#30340;&#26333;&#20809;&#65292;&#32780;&#36825;&#19968;&#37325;&#35201;&#26041;&#38754;&#22312;&#20808;&#21069;&#30340;&#31639;&#27861;&#21246;&#32467;&#30740;&#31350;&#20013;&#34987;&#22823;&#37096;&#20998;&#24573;&#35270;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#22635;&#34917;&#20102;&#25991;&#29486;&#20013;&#36825;&#19968;&#37325;&#35201;&#30340;&#31354;&#30333;&#65292;&#24182;&#26816;&#39564;&#20102;&#25512;&#33616;&#31639;&#27861;&#22914;&#20309;&#20915;&#23450;&#22522;&#20110;AI&#30340;&#23450;&#20215;&#31639;&#27861;&#30340;&#31454;&#20105;&#25110;&#21246;&#32467;&#21160;&#24577;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#25105;&#20204;&#30740;&#31350;&#20102;&#20004;&#31181;&#24120;&#29992;&#30340;&#25512;&#33616;&#31639;&#27861;&#65306;(i)&#20197;&#26368;&#22823;&#21270;&#21334;&#23478;&#24635;&#21033;&#28070;&#20026;&#30446;&#26631;&#30340;&#25512;&#33616;&#31995;&#32479;&#21644;(ii)&#20197;&#26368;&#22823;&#21270;&#24179;&#21488;&#19978;&#20135;&#21697;&#38656;&#27714;&#20026;&#30446;&#26631;&#30340;&#25512;&#33616;&#31995;&#32479;&#12290;&#25105;&#20204;&#26500;&#24314;&#20102;&#19968;&#20010;&#37325;&#22797;&#21338;&#24328;&#26694;&#26550;&#65292;&#23558;&#21334;&#23478;&#30340;&#23450;&#20215;&#31639;&#27861;&#21644;&#24179;&#21488;&#30340;&#25512;&#33616;&#31639;&#27861;&#36827;&#34892;&#20102;&#25972;&#21512;&#12290;
&lt;/p&gt;
&lt;p&gt;
Recent academic research has extensively examined algorithmic collusion resulting from the utilization of artificial intelligence (AI)-based dynamic pricing algorithms. Nevertheless, e-commerce platforms employ recommendation algorithms to allocate exposure to various products, and this important aspect has been largely overlooked in previous studies on algorithmic collusion. Our study bridges this important gap in the literature and examines how recommendation algorithms can determine the competitive or collusive dynamics of AI-based pricing algorithms. Specifically, two commonly deployed recommendation algorithms are examined: (i) a recommender system that aims to maximize the sellers' total profit (profit-based recommender system) and (ii) a recommender system that aims to maximize the demand for products sold on the platform (demand-based recommender system). We construct a repeated game framework that incorporates both pricing algorithms adopted by sellers and the platform's recom
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#36890;&#36807;&#20998;&#26512;iTunes&#38899;&#20048;&#21830;&#24215;&#20013;&#27468;&#26354;&#25688;&#24405;&#30340;&#20934;&#23454;&#39564;&#21464;&#21270;&#65292;&#21457;&#29616;&#24310;&#38271;&#25688;&#24405;&#26102;&#38388;&#21487;&#20197;&#26174;&#33879;&#22686;&#21152;&#27468;&#26354;&#30340;&#29420;&#31435;&#27599;&#26376;&#21548;&#20247;&#65292;&#29305;&#21035;&#26159;&#23545;&#20110;&#38476;&#29983;&#27468;&#26354;&#21644;&#38476;&#29983;&#33402;&#26415;&#23478;&#30340;&#25928;&#26524;&#26356;&#20026;&#26174;&#33879;&#12290;&#27492;&#22806;&#65292;&#25688;&#24405;&#30340;&#37325;&#22797;&#24615;&#21644;&#21487;&#39044;&#27979;&#24615;&#23545;&#38656;&#27714;&#30340;&#22686;&#24378;&#25928;&#26524;&#26377;&#19968;&#23450;&#30340;&#21387;&#21046;&#20316;&#29992;&#12290;&#22240;&#27492;&#65292;&#35813;&#30740;&#31350;&#25903;&#25345;&#24179;&#21488;&#37319;&#29992;&#26356;&#38271;&#30340;&#25688;&#24405;&#26102;&#38388;&#26469;&#25913;&#21892;&#20869;&#23481;&#21457;&#29616;&#12290;</title><link>http://arxiv.org/abs/2309.14475</link><description>&lt;p&gt;
&#35774;&#35745;&#26377;&#25928;&#30340;&#38899;&#20048;&#25688;&#24405;
&lt;/p&gt;
&lt;p&gt;
Designing Effective Music Excerpts. (arXiv:2309.14475v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2309.14475
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#36890;&#36807;&#20998;&#26512;iTunes&#38899;&#20048;&#21830;&#24215;&#20013;&#27468;&#26354;&#25688;&#24405;&#30340;&#20934;&#23454;&#39564;&#21464;&#21270;&#65292;&#21457;&#29616;&#24310;&#38271;&#25688;&#24405;&#26102;&#38388;&#21487;&#20197;&#26174;&#33879;&#22686;&#21152;&#27468;&#26354;&#30340;&#29420;&#31435;&#27599;&#26376;&#21548;&#20247;&#65292;&#29305;&#21035;&#26159;&#23545;&#20110;&#38476;&#29983;&#27468;&#26354;&#21644;&#38476;&#29983;&#33402;&#26415;&#23478;&#30340;&#25928;&#26524;&#26356;&#20026;&#26174;&#33879;&#12290;&#27492;&#22806;&#65292;&#25688;&#24405;&#30340;&#37325;&#22797;&#24615;&#21644;&#21487;&#39044;&#27979;&#24615;&#23545;&#38656;&#27714;&#30340;&#22686;&#24378;&#25928;&#26524;&#26377;&#19968;&#23450;&#30340;&#21387;&#21046;&#20316;&#29992;&#12290;&#22240;&#27492;&#65292;&#35813;&#30740;&#31350;&#25903;&#25345;&#24179;&#21488;&#37319;&#29992;&#26356;&#38271;&#30340;&#25688;&#24405;&#26102;&#38388;&#26469;&#25913;&#21892;&#20869;&#23481;&#21457;&#29616;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#38899;&#20048;&#25688;&#24405;&#34987;&#24191;&#27867;&#29992;&#20110;&#39044;&#35272;&#21644;&#25512;&#24191;&#38899;&#20048;&#20316;&#21697;&#12290;&#26377;&#25928;&#30340;&#25688;&#24405;&#21487;&#20197;&#20419;&#20351;&#28304;&#38899;&#20048;&#20316;&#21697;&#30340;&#28040;&#36153;&#65292;&#20174;&#32780;&#20135;&#29983;&#25910;&#20837;&#12290;&#28982;&#32780;&#65292;&#20160;&#20040;&#20351;&#24471;&#25688;&#24405;&#26377;&#25928;&#20173;&#28982;&#26410;&#34987;&#25506;&#32034;&#12290;&#25105;&#20204;&#21033;&#29992;&#33529;&#26524;&#30340;&#19968;&#39033;&#25919;&#31574;&#21464;&#21270;&#65292;&#36890;&#36807;iTunes&#38899;&#20048;&#21830;&#24215;&#20013;&#27468;&#26354;&#25688;&#24405;&#30340;&#20934;&#23454;&#39564;&#21464;&#21270;&#65292;&#20272;&#35745;&#25688;&#24405;&#26102;&#38388;&#24310;&#38271;60&#31186;&#21487;&#20197;&#24179;&#22343;&#22686;&#21152;&#27468;&#26354;&#30340;&#29420;&#31435;&#27599;&#26376;&#21548;&#20247;5.4&#65285;&#65292;&#38476;&#29983;&#27468;&#26354;&#22686;&#21152;9.7&#65285;&#65292;&#38476;&#29983;&#33402;&#26415;&#23478;&#22686;&#21152;11.1&#65285;&#12290;&#36825;&#30456;&#24403;&#20110;&#34987;&#25910;&#24405;&#22312;Spotify&#20840;&#29699;Top 50&#25773;&#25918;&#21015;&#34920;&#20013;&#30340;&#24433;&#21709;&#12290;&#25105;&#20204;&#24320;&#21457;&#20102;&#38899;&#20048;&#37325;&#22797;&#24615;&#21644;&#19981;&#21487;&#39044;&#27979;&#24615;&#30340;&#34913;&#37327;&#25351;&#26631;&#65292;&#20197;&#32771;&#23519;&#20449;&#24687;&#25552;&#20379;&#20316;&#20026;&#19968;&#31181;&#26426;&#21046;&#65292;&#24182;&#21457;&#29616;&#24403;&#25688;&#24405;&#36807;&#20110;&#37325;&#22797;&#12289;&#36807;&#20110;&#21487;&#39044;&#27979;&#25110;&#36807;&#20110;&#19981;&#21487;&#39044;&#27979;&#26102;&#65292;&#24310;&#38271;&#25688;&#24405;&#26102;&#38388;&#23545;&#38656;&#27714;&#30340;&#22686;&#24378;&#25928;&#26524;&#20250;&#34987;&#21387;&#21046;&#12290;&#25105;&#20204;&#30340;&#21457;&#29616;&#25903;&#25345;&#24179;&#21488;&#37319;&#29992;&#26356;&#38271;&#30340;&#25688;&#24405;&#26469;&#25913;&#21892;&#20869;&#23481;&#21457;&#29616;&#65292;&#32780;&#25105;&#20204;&#30340;&#34913;&#37327;&#25351;&#26631;&#21487;&#20197;&#24110;&#21161;&#25552;&#20379;&#25688;&#24405;&#36873;&#25321;&#30340;&#20449;&#24687;&#12290;
&lt;/p&gt;
&lt;p&gt;
Excerpts are widely used to preview and promote musical works. Effective excerpts induce consumption of the source musical work and thus generate revenue. Yet, what makes an excerpt effective remains unexplored. We leverage a policy change by Apple that generates quasi-exogenous variation in the excerpts of songs in the iTunes Music Store to estimate that having a 60 second longer excerpt increases songs' unique monthly listeners by 5.4% on average, by 9.7% for lesser known songs, and by 11.1% for lesser known artists. This is comparable to the impact of being featured on the Spotify Global Top 50 playlist. We develop measures of musical repetition and unpredictability to examine information provision as a mechanism, and find that the demand-enhancing effect of longer excerpts is suppressed when they are repetitive, too predictable, or too unpredictable. Our findings support platforms' adoption of longer excerpts to improve content discovery and our measures can help inform excerpt sel
&lt;/p&gt;</description></item><item><title>&#22320;&#21306;&#33322;&#31354;&#20844;&#21496;&#30340;&#20849;&#21516;&#23376;&#25215;&#21253;&#19968;&#26041;&#38754;&#20250;&#23548;&#33268;&#26356;&#20302;&#30340;&#20215;&#26684;&#65292;&#21478;&#19968;&#26041;&#38754;&#20250;&#23548;&#33268;&#26356;&#39640;&#30340;&#20215;&#26684;&#65292;&#36825;&#34920;&#26126;&#22320;&#21306;&#33322;&#31354;&#20844;&#21496;&#30340;&#22686;&#38271;&#21487;&#33021;&#23545;&#33322;&#31354;&#19994;&#20135;&#29983;&#21453;&#31454;&#20105;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2301.05999</link><description>&lt;p&gt;
&#20849;&#21516;&#23376;&#25215;&#21253;&#21644;&#33322;&#31354;&#20215;&#26684;
&lt;/p&gt;
&lt;p&gt;
Common Subcontracting and Airline Prices. (arXiv:2301.05999v2 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2301.05999
&lt;/p&gt;
&lt;p&gt;
&#22320;&#21306;&#33322;&#31354;&#20844;&#21496;&#30340;&#20849;&#21516;&#23376;&#25215;&#21253;&#19968;&#26041;&#38754;&#20250;&#23548;&#33268;&#26356;&#20302;&#30340;&#20215;&#26684;&#65292;&#21478;&#19968;&#26041;&#38754;&#20250;&#23548;&#33268;&#26356;&#39640;&#30340;&#20215;&#26684;&#65292;&#36825;&#34920;&#26126;&#22320;&#21306;&#33322;&#31354;&#20844;&#21496;&#30340;&#22686;&#38271;&#21487;&#33021;&#23545;&#33322;&#31354;&#19994;&#20135;&#29983;&#21453;&#31454;&#20105;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#32654;&#22269;&#33322;&#31354;&#19994;&#20013;&#65292;&#29420;&#31435;&#30340;&#22320;&#21306;&#33322;&#31354;&#20844;&#21496;&#20195;&#34920;&#20960;&#23478;&#20840;&#22269;&#33322;&#31354;&#20844;&#21496;&#22312;&#19981;&#21516;&#30340;&#24066;&#22330;&#19978;&#20026;&#20056;&#23458;&#39134;&#34892;&#65292;&#36825;&#20135;&#29983;&#20102;&#8220;&#20849;&#21516;&#23376;&#25215;&#21253;&#8221;&#30340;&#24773;&#20917;&#12290;&#19968;&#26041;&#38754;&#65292;&#25105;&#20204;&#21457;&#29616;&#23376;&#25215;&#21253;&#19982;&#36739;&#20302;&#30340;&#20215;&#26684;&#26377;&#20851;&#65292;&#36825;&#31526;&#21512;&#22320;&#21306;&#33322;&#31354;&#20844;&#21496;&#27604;&#20027;&#35201;&#33322;&#31354;&#20844;&#21496;&#26356;&#20302;&#25104;&#26412;&#36816;&#36755;&#20056;&#23458;&#30340;&#24819;&#27861;&#12290;&#21478;&#19968;&#26041;&#38754;&#65292;&#25105;&#20204;&#21457;&#29616;&#8220;&#20849;&#21516;&#8221;&#23376;&#25215;&#21253;&#19982;&#26356;&#39640;&#30340;&#20215;&#26684;&#26377;&#20851;&#12290;&#36825;&#20004;&#31181;&#30456;&#20114;&#20914;&#31361;&#30340;&#25928;&#24212;&#34920;&#26126;&#65292;&#22320;&#21306;&#33322;&#31354;&#20844;&#21496;&#30340;&#22686;&#38271;&#21487;&#33021;&#23545;&#35813;&#34892;&#19994;&#20135;&#29983;&#21453;&#31454;&#20105;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
In the US airline industry, independent regional airlines fly passengers on behalf of several national airlines across different markets, giving rise to $\textit{common subcontracting}$. On the one hand, we find that subcontracting is associated with lower prices, consistent with the notion that regional airlines tend to fly passengers at lower costs than major airlines. On the other hand, we find that $\textit{common}$ subcontracting is associated with higher prices. These two countervailing effects suggest that the growth of regional airlines can have anticompetitive implications for the industry.
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#34920;&#26126;&#65292;&#25216;&#33021;&#30340;&#20215;&#20540;&#24456;&#22823;&#31243;&#24230;&#19978;&#30001;&#20114;&#34917;&#24615;&#20915;&#23450;&#65292;&#22823;&#22810;&#25968;&#25216;&#33021;&#22312;&#19982;&#19981;&#21516;&#31867;&#22411;&#30340;&#25216;&#33021;&#32452;&#21512;&#20351;&#29992;&#26102;&#20215;&#20540;&#26368;&#39640;&#12290;&#20154;&#24037;&#26234;&#33021;&#25216;&#33021;&#30001;&#20110;&#20854;&#24378;&#22823;&#30340;&#20114;&#34917;&#24615;&#21644;&#36817;&#24180;&#26469;&#19981;&#26029;&#22686;&#38271;&#30340;&#38656;&#27714;&#65292;&#20854;&#20215;&#20540;&#23588;&#20026;&#31361;&#20986;&#65292;&#24179;&#22343;&#25552;&#39640;&#24037;&#20154;&#24037;&#36164;21&#65285;&#12290;</title><link>http://arxiv.org/abs/2210.01535</link><description>&lt;p&gt;
&#25216;&#33021;&#30340;&#20215;&#26684;&#26159;&#22810;&#23569;&#65311;&#20114;&#34917;&#24615;&#30340;&#20215;&#20540;
&lt;/p&gt;
&lt;p&gt;
What is the Price of a Skill? The Value of Complementarity. (arXiv:2210.01535v3 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2210.01535
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#34920;&#26126;&#65292;&#25216;&#33021;&#30340;&#20215;&#20540;&#24456;&#22823;&#31243;&#24230;&#19978;&#30001;&#20114;&#34917;&#24615;&#20915;&#23450;&#65292;&#22823;&#22810;&#25968;&#25216;&#33021;&#22312;&#19982;&#19981;&#21516;&#31867;&#22411;&#30340;&#25216;&#33021;&#32452;&#21512;&#20351;&#29992;&#26102;&#20215;&#20540;&#26368;&#39640;&#12290;&#20154;&#24037;&#26234;&#33021;&#25216;&#33021;&#30001;&#20110;&#20854;&#24378;&#22823;&#30340;&#20114;&#34917;&#24615;&#21644;&#36817;&#24180;&#26469;&#19981;&#26029;&#22686;&#38271;&#30340;&#38656;&#27714;&#65292;&#20854;&#20215;&#20540;&#23588;&#20026;&#31361;&#20986;&#65292;&#24179;&#22343;&#25552;&#39640;&#24037;&#20154;&#24037;&#36164;21&#65285;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#20840;&#29699;&#21171;&#21160;&#21147;&#34987;&#25958;&#20419;&#19981;&#26029;&#25552;&#21319;&#33258;&#24049;&#30340;&#25216;&#33021;&#65292;&#22240;&#20026;&#25216;&#26415;&#21464;&#38761;&#20559;&#22909;&#26576;&#20123;&#26032;&#25216;&#33021;&#65292;&#21516;&#26102;&#20351;&#20854;&#20182;&#25216;&#33021;&#21464;&#24471;&#22810;&#20313;&#12290;&#20294;&#26159;&#23545;&#20110;&#24037;&#20154;&#21644;&#20844;&#21496;&#26469;&#35828;&#65292;&#21738;&#20123;&#25216;&#33021;&#26159;&#19968;&#20010;&#22909;&#30340;&#25237;&#36164;&#21602;&#65311;&#30001;&#20110;&#25216;&#33021;&#24456;&#23569;&#26159;&#23396;&#31435;&#24212;&#29992;&#30340;&#65292;&#25105;&#20204;&#25552;&#20986;&#20114;&#34917;&#24615;&#24378;&#28872;&#20915;&#23450;&#20102;&#25216;&#33021;&#30340;&#32463;&#27982;&#20215;&#20540;&#12290;&#25105;&#20204;&#23545;962&#31181;&#25216;&#33021;&#36827;&#34892;&#20102;&#30740;&#31350;&#65292;&#35777;&#26126;&#20102;&#23427;&#20204;&#30340;&#20215;&#20540;&#22312;&#24456;&#22823;&#31243;&#24230;&#19978;&#30001;&#20114;&#34917;&#24615;&#20915;&#23450;-&#21363;&#19968;&#20010;&#33021;&#21147;&#21487;&#20197;&#19982;&#22810;&#23569;&#19981;&#21516;&#30340;&#25216;&#33021;&#29702;&#24819;&#24773;&#20917;&#19979;&#32467;&#21512;&#65292;&#36825;&#20123;&#25216;&#33021;&#20855;&#26377;&#24456;&#39640;&#30340;&#20215;&#20540;&#12290;&#25105;&#20204;&#26174;&#31034;&#65292;&#25216;&#33021;&#30340;&#20215;&#20540;&#26159;&#30456;&#23545;&#30340;&#65292;&#22240;&#20026;&#23427;&#21462;&#20915;&#20110;&#24037;&#20154;&#30340;&#25216;&#33021;&#32972;&#26223;&#12290;&#23545;&#20110;&#22823;&#22810;&#25968;&#25216;&#33021;&#26469;&#35828;&#65292;&#24403;&#19982;&#19981;&#21516;&#31867;&#22411;&#30340;&#25216;&#33021;&#32452;&#21512;&#20351;&#29992;&#26102;&#65292;&#23427;&#20204;&#30340;&#20215;&#20540;&#26368;&#39640;&#12290;&#25105;&#20204;&#29992;&#19982;&#20154;&#24037;&#26234;&#33021;&#65288;AI&#65289;&#30456;&#20851;&#30340;&#25216;&#33021;&#38598;&#23545;&#25105;&#20204;&#30340;&#27169;&#22411;&#36827;&#34892;&#20102;&#27979;&#35797;&#12290;&#25105;&#20204;&#21457;&#29616;&#65292;&#20154;&#24037;&#26234;&#33021;&#25216;&#33021;&#23588;&#20854;&#26377;&#20215;&#20540;-&#24179;&#22343;&#25552;&#39640;&#24037;&#20154;&#24037;&#36164;21&#65285;-&#36825;&#26159;&#22240;&#20026;&#23427;&#20204;&#30340;&#20114;&#34917;&#24615;&#24378;&#22823;&#65292;&#24182;&#19988;&#36817;&#24180;&#26469;&#38656;&#27714;&#19981;&#26029;&#22686;&#21152;&#12290;&#27169;&#22411;&#21644;&#25351;&#26631;
&lt;/p&gt;
&lt;p&gt;
The global workforce is urged to constantly reskill, as technological change favours particular new skills while making others redundant. But which skills are a good investment for workers and firms? As skills are seldomly applied in isolation, we propose that complementarity strongly determines a skill's economic value. For 962 skills, we demonstrate that their value is strongly determined by complementarity - that is, how many different skills, ideally of high value, a competency can be combined with. We show that the value of a skill is relative, as it depends on the skill background of the worker. For most skills, their value is highest when used in combination with skills of a different type. We put our model to the test with a set of skills related to Artificial Intelligence (AI). We find that AI skills are particularly valuable - increasing worker wages by 21% on average - because of their strong complementarities and their rising demand in recent years. The model and metrics of
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#20855;&#26377;&#21322;&#38789;&#31574;&#30053;&#30340;&#26368;&#20248;&#32452;&#21512;&#28165;&#31639;&#38382;&#39064;&#65292;&#35777;&#26126;&#20102;&#20215;&#20540;&#20989;&#25968;&#37319;&#29992;&#32447;&#24615;-&#20108;&#27425;&#24418;&#24335;&#65292;&#19988;&#26368;&#20248;&#31574;&#30053;&#20165;&#22312;&#20132;&#26131;&#26399;&#30340;&#24320;&#22987;&#21644;&#32467;&#26463;&#26102;&#36827;&#34892;&#36339;&#36291;&#12290;</title><link>http://arxiv.org/abs/2207.00446</link><description>&lt;p&gt;
&#20855;&#26377;&#21322;&#38789;&#31574;&#30053;&#30340;&#26368;&#20248;&#32452;&#21512;&#28165;&#31639;&#22343;&#20540;&#22330;&#25511;&#21046;&#38382;&#39064;
&lt;/p&gt;
&lt;p&gt;
A Mean-Field Control Problem of Optimal Portfolio Liquidation with Semimartingale Strategies. (arXiv:2207.00446v2 [q-fin.MF] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2207.00446
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#20855;&#26377;&#21322;&#38789;&#31574;&#30053;&#30340;&#26368;&#20248;&#32452;&#21512;&#28165;&#31639;&#38382;&#39064;&#65292;&#35777;&#26126;&#20102;&#20215;&#20540;&#20989;&#25968;&#37319;&#29992;&#32447;&#24615;-&#20108;&#27425;&#24418;&#24335;&#65292;&#19988;&#26368;&#20248;&#31574;&#30053;&#20165;&#22312;&#20132;&#26131;&#26399;&#30340;&#24320;&#22987;&#21644;&#32467;&#26463;&#26102;&#36827;&#34892;&#36339;&#36291;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#32771;&#34385;&#20102;&#19968;&#20010;&#20855;&#26377;&#30636;&#24577;&#24066;&#22330;&#24433;&#21709;&#21644;&#33258;&#28608;&#21169;&#35746;&#21333;&#27969;&#30340;&#32452;&#21512;&#28165;&#31639;&#27169;&#22411;&#65292;&#20854;&#20013;&#28041;&#21450;&#21040; c\`adl\`ag &#21322;&#38789;&#31574;&#30053;&#30340;&#22343;&#20540;&#22330;&#25511;&#21046;&#38382;&#39064;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#20215;&#20540;&#20989;&#25968;&#20165;&#36890;&#36807;&#20854;&#20998;&#24067;&#20381;&#36182;&#20110;&#29366;&#24577;&#36807;&#31243;&#65292;&#24182;&#19988;&#23427;&#37319;&#29992;&#32447;&#24615;-&#20108;&#27425;&#24418;&#24335;&#65292;&#20854;&#31995;&#25968;&#28385;&#36275;&#38750;&#26631;&#20934; Riccati &#31867;&#22411;&#26041;&#31243;&#30340;&#32806;&#21512;&#31995;&#32479;&#12290;&#36890;&#36807;&#30001;&#31163;&#25955;&#26102;&#38388;&#27169;&#22411;&#36716;&#25442;&#21040;&#36830;&#32493;&#26102;&#38388;&#26497;&#38480;&#26469;&#21551;&#21457;&#24335;&#22320;&#33719;&#24471; Riccati &#26041;&#31243;&#12290;&#36890;&#36807;&#22797;&#26434;&#30340;&#21464;&#25442;&#65292;&#25105;&#20204;&#21487;&#20197;&#23558;&#31995;&#32479;&#24102;&#20837;&#26631;&#20934; Riccati &#24418;&#24335;&#65292;&#20174;&#32780;&#25512;&#26029;&#20986;&#20840;&#23616;&#35299;&#30340;&#23384;&#22312;&#24615;&#12290;&#25105;&#20204;&#30340;&#20998;&#26512;&#34920;&#26126;&#65292;&#26368;&#20248;&#31574;&#30053;&#20165;&#22312;&#20132;&#26131;&#26399;&#30340;&#24320;&#22987;&#21644;&#32467;&#26463;&#26102;&#36827;&#34892;&#36339;&#36291;&#12290;
&lt;/p&gt;
&lt;p&gt;
We consider a mean-field control problem with c\`adl\`ag semimartingale strategies arising in portfolio liquidation models with transient market impact and self-exciting order flow. We show that the value function depends on the state process only through its law, and that it is of linear-quadratic form and that its coefficients satisfy a coupled system of non-standard Riccati-type equations. The Riccati equations are obtained heuristically by passing to the continuous-time limit from a sequence of discrete-time models. A sophisticated transformation shows that the system can be brought into standard Riccati form from which we deduce the existence of a global solution. Our analysis shows that the optimal strategy jumps only at the beginning and the end of the trading period.
&lt;/p&gt;</description></item><item><title>&#25991;&#31456;&#20351;&#29992;&#32929;&#19996;&#22823;&#20250;&#26102;&#38388;&#24046;&#24322;&#30340;&#26041;&#27861;&#30740;&#31350;&#20102;&#32929;&#19996;&#20559;&#22909;&#21644;&#23545;&#20844;&#21496;&#21033;&#20182;&#20915;&#31574;&#30340;&#24433;&#21709;&#65292;&#21457;&#29616;&#36861;&#27714;&#65288;&#26576;&#20123;&#65289;&#32929;&#19996;&#30340;&#20215;&#20540;&#20855;&#26377;&#20998;&#37197;&#25104;&#26412;&#65292;&#20294;&#22823;&#32929;&#19996;&#30340;&#30417;&#25511;&#21487;&#20197;&#36991;&#20813;&#36825;&#31181;&#30001;&#20559;&#22909;&#24322;&#36136;&#24615;&#39537;&#21160;&#30340;&#25104;&#26412;&#12290;</title><link>http://arxiv.org/abs/2103.12138</link><description>&lt;p&gt;
&#36861;&#27714;&#32929;&#19996;&#20215;&#20540;&#30340;&#20849;&#21516;&#25104;&#26412;
&lt;/p&gt;
&lt;p&gt;
The Shared Cost of Pursuing Shareholder Value. (arXiv:2103.12138v9 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2103.12138
&lt;/p&gt;
&lt;p&gt;
&#25991;&#31456;&#20351;&#29992;&#32929;&#19996;&#22823;&#20250;&#26102;&#38388;&#24046;&#24322;&#30340;&#26041;&#27861;&#30740;&#31350;&#20102;&#32929;&#19996;&#20559;&#22909;&#21644;&#23545;&#20844;&#21496;&#21033;&#20182;&#20915;&#31574;&#30340;&#24433;&#21709;&#65292;&#21457;&#29616;&#36861;&#27714;&#65288;&#26576;&#20123;&#65289;&#32929;&#19996;&#30340;&#20215;&#20540;&#20855;&#26377;&#20998;&#37197;&#25104;&#26412;&#65292;&#20294;&#22823;&#32929;&#19996;&#30340;&#30417;&#25511;&#21487;&#20197;&#36991;&#20813;&#36825;&#31181;&#30001;&#20559;&#22909;&#24322;&#36136;&#24615;&#39537;&#21160;&#30340;&#25104;&#26412;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#37319;&#29992;&#20934;&#23454;&#39564;&#24615;&#30340;&#26041;&#27861;&#65292;&#26681;&#25454;&#20844;&#21496;&#32929;&#19996;&#22823;&#20250;&#65288;AGMs&#65289;&#30340;&#26102;&#38388;&#24046;&#24322;&#65292;&#25552;&#20986;&#20102;&#19968;&#20010;&#21487;&#31227;&#26893;&#30340;&#26694;&#26550;&#65292;&#25512;&#26029;&#32929;&#19996;&#30340;&#20559;&#22909;&#21644;&#23545;&#20844;&#21496;&#21033;&#20182;&#20915;&#31574;&#30340;&#24433;&#21709;&#65292;&#24182;&#23558;&#20854;&#24212;&#29992;&#20110;covid&#30456;&#20851;&#25424;&#36192;&#12289;&#26368;&#36817;&#38024;&#23545;&#20420;&#32599;&#26031;&#30340;&#31169;&#20154;&#21046;&#35009;&#20197;&#21450;&#20844;&#21496;2012-19&#24180;&#30340;&#21033;&#20182;&#31435;&#22330;&#12290;AGMs&#30340;&#23186;&#20307;&#26333;&#20809;&#24102;&#26469;&#30340;&#24418;&#35937;&#25910;&#30410;&#65292;&#20351;&#24471;&#19982;&#20844;&#21496;&#21516;&#20041;&#30340;&#32929;&#19996;&#65288;&#22914;&#23494;&#20999;&#30456;&#20851;&#30340;&#20010;&#20154;&#65289;&#25903;&#25345;&#26114;&#36149;&#30340;&#21033;&#20182;&#21464;&#38761;&#65292;&#32780;&#20854;&#20182;&#32929;&#19996;&#65288;&#22914;&#37329;&#34701;&#20844;&#21496;&#65289;&#21453;&#23545;&#36825;&#20123;&#21464;&#38761;&#12290;&#25903;&#25345;&#36825;&#20123;&#21464;&#38761;&#30340;&#24433;&#21709;&#20351;&#25910;&#30410;&#19979;&#38477;&#20102;30&#65285;&#65306;&#36861;&#27714;&#65288;&#26576;&#20123;&#65289;&#32929;&#19996;&#30340;&#20215;&#20540;&#20855;&#26377;&#20998;&#37197;&#25104;&#26412;&#65292;&#22823;&#32929;&#19996;&#30340;&#30417;&#25511;&#21487;&#20197;&#36991;&#20813;&#30001;&#20559;&#22909;&#24322;&#36136;&#24615;&#39537;&#21160;&#30340;&#25104;&#26412;&#12290;
&lt;/p&gt;
&lt;p&gt;
Using quasi-experimental variations from the timing of firms' Annual General Meetings (AGMs), we propose a portable framework to infer shareholders' preferences and influences on firms' prosocial decisions and apply it to covid-related donations, recent private sanctions on Russia, and firms' prosocial stances over 2012-19. Image gains from AGMs' media exposure drive shareholders synonymous with a firm, like closely-connected individuals, to support costly prosocial changes, while others, like financial corporations, oppose them. Influence supporting these changes lowers earnings by 30\%: pursuing the values of (some) shareholders has distributional costs, which the monitoring of large shareholders motivated by heterogeneous preferences could prevent.
&lt;/p&gt;</description></item></channel></rss>