<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#26412;&#25991;&#31995;&#32479;&#24635;&#32467;&#20102;&#36807;&#21435;&#21313;&#24180;&#25968;&#23398;&#26041;&#27861;&#22312;&#25351;&#25968;&#36319;&#36394;&#20013;&#30340;&#36827;&#23637;&#65292;&#26088;&#22312;&#25214;&#21040;&#26356;&#23454;&#38469;&#30340;&#35299;&#20915;&#26041;&#26696;&#65292;&#20197;&#26500;&#24314;&#19968;&#20010;&#36319;&#36394;&#29305;&#23450;&#25351;&#25968;&#30340;&#32452;&#21512;&#65292;&#20854;&#20132;&#26131;&#25104;&#26412;&#38477;&#20302;&#65292;&#21516;&#26102;&#28085;&#30422;&#20102;&#37325;&#35201;&#38382;&#39064;&#65292;&#20363;&#22914;&#26368;&#30456;&#20851;&#30340;&#30740;&#31350;&#39046;&#22495;&#65292;&#35299;&#20915;&#26041;&#27861;&#21644;&#27169;&#22411;&#32467;&#26500;&#12290;</title><link>http://arxiv.org/abs/2306.01660</link><description>&lt;p&gt;
&#36807;&#21435;&#21313;&#24180;&#25351;&#25968;&#36319;&#36394;&#38382;&#39064;&#30340;&#35299;&#20915;&#26041;&#27861;&#30340;&#31995;&#32479;&#25991;&#29486;&#32508;&#36848;
&lt;/p&gt;
&lt;p&gt;
A systematic literature review on solution approaches for the index tracking problem in the last decade. (arXiv:2306.01660v1 [q-fin.PM])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.01660
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#31995;&#32479;&#24635;&#32467;&#20102;&#36807;&#21435;&#21313;&#24180;&#25968;&#23398;&#26041;&#27861;&#22312;&#25351;&#25968;&#36319;&#36394;&#20013;&#30340;&#36827;&#23637;&#65292;&#26088;&#22312;&#25214;&#21040;&#26356;&#23454;&#38469;&#30340;&#35299;&#20915;&#26041;&#26696;&#65292;&#20197;&#26500;&#24314;&#19968;&#20010;&#36319;&#36394;&#29305;&#23450;&#25351;&#25968;&#30340;&#32452;&#21512;&#65292;&#20854;&#20132;&#26131;&#25104;&#26412;&#38477;&#20302;&#65292;&#21516;&#26102;&#28085;&#30422;&#20102;&#37325;&#35201;&#38382;&#39064;&#65292;&#20363;&#22914;&#26368;&#30456;&#20851;&#30340;&#30740;&#31350;&#39046;&#22495;&#65292;&#35299;&#20915;&#26041;&#27861;&#21644;&#27169;&#22411;&#32467;&#26500;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#34987;&#21160;&#31649;&#29702;&#26041;&#27861;&#20026;&#20445;&#23432;&#25237;&#36164;&#32773;&#25552;&#20379;&#20102;&#19968;&#31181;&#38477;&#20302;&#24066;&#22330;&#39118;&#38505;&#30340;&#26041;&#24335;&#12290;&#36825;&#31181;&#25237;&#36164;&#31574;&#30053;&#26088;&#22312;&#22797;&#21046;&#29305;&#23450;&#30340;&#25351;&#25968;&#65292;&#22914;&#32435;&#26031;&#36798;&#20811;&#32508;&#21512;&#25351;&#25968;&#25110;&#23500;&#26102;100&#25351;&#25968;&#12290;&#38382;&#39064;&#26159;&#36141;&#20080;&#25152;&#26377;&#25351;&#25968;&#36164;&#20135;&#20250;&#20135;&#29983;&#39640;&#26114;&#30340;&#20877;&#24179;&#34913;&#25104;&#26412;&#65292;&#36825;&#20250;&#25439;&#23475;&#26410;&#26469;&#30340;&#22238;&#25253;&#12290;&#25351;&#25968;&#36319;&#36394;&#38382;&#39064;&#28041;&#21450;&#26500;&#24314;&#19968;&#20010;&#36319;&#36394;&#29305;&#23450;&#22522;&#20934;&#30340;&#32452;&#21512;&#65292;&#20854;&#20132;&#26131;&#25104;&#26412;&#36739;&#20302;&#12290;&#30001;&#20110;&#38656;&#35201;&#19968;&#20010;&#36164;&#20135;&#23376;&#38598;&#26469;&#35299;&#20915;&#25351;&#25968;&#38382;&#39064;&#65292;&#22240;&#27492;&#36825;&#31867;&#38382;&#39064;&#26159;NP&#38590;&#30340;&#65292;&#36817;&#24180;&#26469;&#65292;&#30740;&#31350;&#20154;&#21592;&#19968;&#30452;&#22312;&#30740;&#31350;&#35299;&#20915;&#26041;&#26696;&#20197;&#26356;&#21152;&#23454;&#38469;&#22320;&#33719;&#24471;&#36319;&#36394;&#32452;&#21512;&#12290;&#26412;&#30740;&#31350;&#23545;&#36807;&#21435;&#21313;&#24180;&#20013;&#25968;&#23398;&#26041;&#27861;&#22312;&#25351;&#25968;&#36319;&#36394;&#20013;&#30340;&#36827;&#23637;&#36827;&#34892;&#20102;&#20840;&#38754;&#30340;&#20998;&#26512;&#12290;&#31995;&#32479;&#25991;&#29486;&#32508;&#36848;&#28085;&#30422;&#20102;&#19968;&#20123;&#37325;&#35201;&#38382;&#39064;&#65292;&#20363;&#22914;&#26368;&#30456;&#20851;&#30340;&#30740;&#31350;&#39046;&#22495;&#65292;&#35299;&#20915;&#26041;&#27861;&#21644;&#27169;&#22411;&#32467;&#26500;&#12290;&#29305;&#21035;&#20851;&#27880;&#20102;&#20803;&#20998;&#26512;&#30340;&#25506;&#32034;&#21644;&#20998;&#26512;&#12290;
&lt;/p&gt;
&lt;p&gt;
The passive management approach offers conservative investors a way to reduce risk concerning the market. This investment strategy aims at replicating a specific index, such as the NASDAQ Composite or the FTSE100 index. The problem is that buying all the index's assets incurs high rebalancing costs, and this harms future returns. The index tracking problem concerns building a portfolio that follows a specific benchmark with fewer transaction costs. Since a subset of assets is required to solve the index problem this class of problems is NP-hard, and in the past years, researchers have been studying solution approaches to obtain tracking portfolios more practically. This work brings an analysis, spanning the last decade, of the advances in mathematical approaches for index tracking. The systematic literature review covered important issues, such as the most relevant research areas, solution methods, and model structures. Special attention was given to the exploration and analysis of met
&lt;/p&gt;</description></item><item><title>&#26412;&#30740;&#31350;&#27979;&#35797;&#20102;12&#20010;&#21457;&#36798;&#32463;&#27982;&#20307;&#20013;&#24343;&#37324;&#24503;&#26364;&#33879;&#21517;&#30340;&#20225;&#19994;&#21608;&#26399;&#39076;&#21160;&#29702;&#35770;&#30340;&#22269;&#38469;&#36866;&#29992;&#24615;&#65292;&#21457;&#29616;&#22833;&#19994;&#29575;&#30340;&#27874;&#21160;&#24615;&#36739;&#23567;&#65292;&#20135;&#20986;&#22797;&#33487;&#22312;&#21508;&#22269;&#20043;&#38388;&#24046;&#24322;&#36739;&#23567;&#65292;&#21046;&#36896;&#19994;&#19979;&#38477;&#36890;&#24120;&#20250;&#23436;&#20840;&#36870;&#36716;&#65292;&#32780;&#24314;&#31569;&#19994;&#39537;&#21160;&#30340;&#32463;&#27982;&#34928;&#36864;&#24448;&#24448;&#26159;&#25345;&#32493;&#24615;&#30340;&#12290;</title><link>http://arxiv.org/abs/2306.01552</link><description>&lt;p&gt;
&#20225;&#19994;&#21608;&#26399;&#30340;&#24418;&#24577;&#65306;&#23545;&#24343;&#37324;&#24503;&#26364;&#30340;&#39076;&#21160;&#29702;&#35770;&#36827;&#34892;&#36328;&#22269;&#20998;&#26512;
&lt;/p&gt;
&lt;p&gt;
The shape of business cycles: a cross-country analysis of Friedman s plucking theory. (arXiv:2306.01552v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.01552
&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#27979;&#35797;&#20102;12&#20010;&#21457;&#36798;&#32463;&#27982;&#20307;&#20013;&#24343;&#37324;&#24503;&#26364;&#33879;&#21517;&#30340;&#20225;&#19994;&#21608;&#26399;&#39076;&#21160;&#29702;&#35770;&#30340;&#22269;&#38469;&#36866;&#29992;&#24615;&#65292;&#21457;&#29616;&#22833;&#19994;&#29575;&#30340;&#27874;&#21160;&#24615;&#36739;&#23567;&#65292;&#20135;&#20986;&#22797;&#33487;&#22312;&#21508;&#22269;&#20043;&#38388;&#24046;&#24322;&#36739;&#23567;&#65292;&#21046;&#36896;&#19994;&#19979;&#38477;&#36890;&#24120;&#20250;&#23436;&#20840;&#36870;&#36716;&#65292;&#32780;&#24314;&#31569;&#19994;&#39537;&#21160;&#30340;&#32463;&#27982;&#34928;&#36864;&#24448;&#24448;&#26159;&#25345;&#32493;&#24615;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#30740;&#31350;&#27979;&#35797;&#20102;&#24343;&#37324;&#24503;&#26364;&#33879;&#21517;&#30340;&#20225;&#19994;&#21608;&#26399;&#39076;&#21160;&#29702;&#35770;&#22312;1970&#24180;&#33267;2021&#24180;&#38388;12&#20010;&#21457;&#36798;&#32463;&#27982;&#20307;&#20013;&#30340;&#22269;&#38469;&#36866;&#29992;&#24615;&#12290;&#30740;&#31350;&#21457;&#29616;&#65292;&#23545;&#20110;&#21171;&#21160;&#21147;&#24066;&#22330;&#28789;&#27963;&#30340;&#22269;&#23478;&#65288;&#28595;&#22823;&#21033;&#20122;&#12289;&#21152;&#25343;&#22823;&#12289;&#33521;&#22269;&#21644;&#32654;&#22269;&#65289;&#65292;&#22833;&#19994;&#29575;&#36890;&#24120;&#20250;&#22238;&#21040;&#32463;&#27982;&#21361;&#26426;&#21069;&#30340;&#27700;&#24179;&#65292;&#31526;&#21512;&#24343;&#37324;&#24503;&#26364;&#29702;&#35770;&#12290;&#22312;&#20854;&#20182;&#22269;&#23478;&#65292;&#22833;&#19994;&#29575;&#30340;&#27874;&#21160;&#24615;&#36739;&#23567;&#12290;&#20135;&#20986;&#22797;&#33487;&#22312;&#21508;&#22269;&#20043;&#38388;&#24046;&#24322;&#36739;&#23567;&#65292;&#20294;&#22312;&#19981;&#21516;&#30340;&#32463;&#27982;&#21608;&#26399;&#20043;&#38388;&#24046;&#24322;&#36739;&#22823;&#65306;&#24179;&#22343;&#32780;&#35328;&#65292;&#22312;&#32463;&#27982;&#34928;&#36864;&#26399;&#38388;GDP&#19979;&#38477;&#30340;&#19968;&#21322;&#20173;&#28982;&#20250;&#25345;&#32493;&#23384;&#22312;&#12290;&#22312;&#34892;&#19994;&#26041;&#38754;&#65292;&#21046;&#36896;&#19994;&#19979;&#38477;&#36890;&#24120;&#20250;&#23436;&#20840;&#36870;&#36716;&#12290;&#30456;&#27604;&#20043;&#19979;&#65292;&#24314;&#31569;&#19994;&#39537;&#21160;&#30340;&#32463;&#27982;&#34928;&#36864;&#65292;&#36890;&#24120;&#26159;&#19982;&#25151;&#22320;&#20135;&#20215;&#26684;&#27873;&#27819;&#30772;&#35010;&#26377;&#20851;&#30340;&#65292;&#24448;&#24448;&#26159;&#25345;&#32493;&#24615;&#30340;&#12290;
&lt;/p&gt;
&lt;p&gt;
We test the international applicability of Friedman s famous plucking theory of the business cycle in 12 advanced economies between 1970 and 2021. We find that in countries where labour markets are flexible (Australia, Canada, United Kingdom and United States), unemployment rates typically return to pre-recession levels, in line with Friedman s theory. Elsewhere, unemployment rates are less cyclical. Output recoveries differ less across countries, but more across episodes: on average, half of the decline in GDP during a recession persists. In terms of sectors, declines in manufacturing are typically fully reversed. In contrast, construction-driven recessions, which are often associated with bursting property price bubbles, tend to be persistent.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#25552;&#20986;&#32463;&#27982;&#25968;&#25454;&#25345;&#20037;&#24615;&#30340;&#24179;&#28369;&#21464;&#21270;&#27169;&#22411;&#65292;&#36890;&#36807;&#23616;&#37096;&#22238;&#24402;&#20174;&#25968;&#25454;&#20013;&#30830;&#23450;&#20016;&#23500;&#30340;&#25345;&#20037;&#24615;&#32467;&#26500;&#12290;&#30740;&#31350;&#21457;&#29616;&#36825;&#31181;&#21160;&#24577;&#25345;&#32493;&#24615;&#33258;&#28982;&#32780;&#28982;&#22320;&#26469;&#28304;&#20110;&#19981;&#21516;&#25345;&#32493;&#24615;&#30340;&#32463;&#27982;&#20914;&#20987;&#65292;&#21253;&#25324;&#25919;&#31574;&#21046;&#23450;&#20013;&#36215;&#20851;&#38190;&#20316;&#29992;&#30340;&#36890;&#36135;&#33192;&#32960;&#21644;&#23545;&#20110;&#39118;&#38505;&#21644;&#24066;&#22330;&#20998;&#26512;&#33267;&#20851;&#37325;&#35201;&#30340;&#32929;&#31080;&#27874;&#21160;&#29575;&#12290;</title><link>http://arxiv.org/abs/2306.01511</link><description>&lt;p&gt;
&#32463;&#27982;&#20914;&#20987;&#30340;&#21160;&#24577;&#25345;&#20037;&#24615;
&lt;/p&gt;
&lt;p&gt;
The Dynamic Persistence of Economic Shocks. (arXiv:2306.01511v1 [q-fin.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.01511
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#32463;&#27982;&#25968;&#25454;&#25345;&#20037;&#24615;&#30340;&#24179;&#28369;&#21464;&#21270;&#27169;&#22411;&#65292;&#36890;&#36807;&#23616;&#37096;&#22238;&#24402;&#20174;&#25968;&#25454;&#20013;&#30830;&#23450;&#20016;&#23500;&#30340;&#25345;&#20037;&#24615;&#32467;&#26500;&#12290;&#30740;&#31350;&#21457;&#29616;&#36825;&#31181;&#21160;&#24577;&#25345;&#32493;&#24615;&#33258;&#28982;&#32780;&#28982;&#22320;&#26469;&#28304;&#20110;&#19981;&#21516;&#25345;&#32493;&#24615;&#30340;&#32463;&#27982;&#20914;&#20987;&#65292;&#21253;&#25324;&#25919;&#31574;&#21046;&#23450;&#20013;&#36215;&#20851;&#38190;&#20316;&#29992;&#30340;&#36890;&#36135;&#33192;&#32960;&#21644;&#23545;&#20110;&#39118;&#38505;&#21644;&#24066;&#22330;&#20998;&#26512;&#33267;&#20851;&#37325;&#35201;&#30340;&#32929;&#31080;&#27874;&#21160;&#29575;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#25552;&#20986;&#20102;&#19968;&#20010;&#27169;&#22411;&#65292;&#29992;&#20110;&#24179;&#28369;&#21464;&#21270;&#30340;&#32463;&#27982;&#25968;&#25454;&#25345;&#20037;&#24615;&#12290;&#25105;&#20204;&#35748;&#20026;&#36825;&#31181;&#21160;&#24577;&#25345;&#32493;&#24615;&#33258;&#28982;&#32780;&#28982;&#22320;&#26469;&#28304;&#20110;&#19981;&#21516;&#25345;&#32493;&#24615;&#32463;&#27982;&#20914;&#20987;&#30340;&#21160;&#24577;&#29305;&#24615;&#12290;&#36890;&#36807;&#20351;&#29992;&#23616;&#37096;&#22238;&#24402;&#20174;&#25968;&#25454;&#20013;&#30830;&#23450;&#36825;&#31181;&#21160;&#24577;&#25345;&#32493;&#24615;&#12290;&#32463;&#39564;&#35777;&#26126;&#65292;&#22312;&#20004;&#20010;&#37325;&#35201;&#25968;&#25454;&#38598;&#65288;&#25919;&#31574;&#21046;&#23450;&#20013;&#36215;&#20851;&#38190;&#20316;&#29992;&#30340;&#36890;&#36135;&#33192;&#32960;&#21644;&#23545;&#20110;&#39118;&#38505;&#21644;&#24066;&#22330;&#20998;&#26512;&#33267;&#20851;&#37325;&#35201;&#30340;&#32929;&#31080;&#27874;&#21160;&#29575;&#65289;&#20013;&#65292;&#25105;&#20204;&#30830;&#23450;&#20102;&#24179;&#31283;&#21464;&#21270;&#30340;&#20016;&#23500;&#25345;&#32493;&#24615;&#32467;&#26500;&#12290;
&lt;/p&gt;
&lt;p&gt;
This paper presents a model for smoothly varying heterogeneous persistence of economic data. We argue that such dynamics arise naturally from the dynamic nature of economic shocks with various degree of persistence. The identification of such dynamics from data is done using localised regressions. Empirically, we identify rich persistence structures that change smoothly over time in two important data sets: inflation, which plays a key role in policy formulation, and stock volatility, which is crucial for risk and market analysis.
&lt;/p&gt;</description></item><item><title>&#30740;&#31350;&#21457;&#29616;&#65292;&#22312;&#39640;&#27169;&#22411;&#19981;&#30830;&#23450;&#24615;&#19979;&#65292;&#37319;&#29992;&#32479;&#19968;&#22810;&#20803;&#21270;&#31574;&#30053;&#26159;&#26399;&#26395;&#25928;&#29992;&#26368;&#22823;&#21270;&#30340;&#26368;&#20248;&#31574;&#30053;&#12290;</title><link>http://arxiv.org/abs/2306.01503</link><description>&lt;p&gt;
&#39640;&#27169;&#22411;&#19981;&#30830;&#23450;&#24615;&#19979;&#65292;&#32479;&#19968;&#22810;&#20803;&#21270;&#31574;&#30053;&#26159;&#26399;&#26395;&#25928;&#29992;&#26368;&#22823;&#21270;&#30340;&#26368;&#20248;&#31574;&#30053;
&lt;/p&gt;
&lt;p&gt;
The uniform diversification strategy is optimal for expected utility maximization under high model ambiguity. (arXiv:2306.01503v1 [math.OC])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.01503
&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#21457;&#29616;&#65292;&#22312;&#39640;&#27169;&#22411;&#19981;&#30830;&#23450;&#24615;&#19979;&#65292;&#37319;&#29992;&#32479;&#19968;&#22810;&#20803;&#21270;&#31574;&#30053;&#26159;&#26399;&#26395;&#25928;&#29992;&#26368;&#22823;&#21270;&#30340;&#26368;&#20248;&#31574;&#30053;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#19968;&#20010;&#22312;&#27169;&#22411;&#19981;&#30830;&#23450;&#24615;&#19979;&#30340;&#26399;&#26395;&#25928;&#29992;&#26368;&#22823;&#21270;&#38382;&#39064;&#65292;&#30740;&#31350;&#23545;&#35937;&#20026;&#19968;&#20010;&#19968;&#26399;&#37329;&#34701;&#24066;&#22330;&#12290;&#26412;&#25991;&#36890;&#36807;&#26367;&#25442;&#27010;&#29575;&#27979;&#24230;&#31354;&#38388;&#20013;$\mathbb{P}$&#30340;&#19968;&#20010;&#19981;&#33391;&#36873;&#25321;&#65292;&#24418;&#25104;&#21322;&#24452;&#20026;$ k $&#30340;Wasserstein&#29699;&#26469;&#25429;&#25417;&#27169;&#22411;&#19981;&#30830;&#23450;&#24615;&#65292;&#24182;&#32771;&#34385;&#30456;&#24212;&#30340;Wasserstein&#20998;&#24067;&#40065;&#26834;&#20248;&#21270;&#38382;&#39064;&#12290;&#25105;&#20204;&#34920;&#26126;&#65292;&#24403;&#19981;&#30830;&#23450;&#24615;&#19981;&#26029;&#22686;&#22823;&#26102;&#65292;&#20063;&#23601;&#26159;&#24403;&#21322;&#24452;$ k $&#36235;&#36817;&#20110;&#26080;&#31351;&#22823;&#26102;&#65292;&#26368;&#20248;&#35299;&#23558;&#25910;&#25947;&#20110;&#32479;&#19968;&#22810;&#20803;&#21270;&#31574;&#30053;&#12290;
&lt;/p&gt;
&lt;p&gt;
We investigate an expected utility maximization problem under model uncertainty in a one-period financial market. We capture model uncertainty by replacing the baseline model $\mathbb{P}$ with an adverse choice from a Wasserstein ball of radius $k$ around $\mathbb{P}$ in the space of probability measures and consider the corresponding Wasserstein distributionally robust optimization problem. We show that optimal solutions converge to the uniform diversification strategy when uncertainty is increasingly large, i.e. when the radius $k$ tends to infinity.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#20351;&#29992;&#19968;&#31181;&#22522;&#20110;&#26234;&#33021;&#20307;&#27169;&#22411;&#30340;&#26032;&#26041;&#27861;&#65292;&#30740;&#31350;&#20102;&#30123;&#21518;&#36890;&#32960;&#19982;&#36135;&#24065;&#25919;&#31574;&#30340;&#22256;&#22659;&#65292;&#36890;&#36807;&#30740;&#31350;&#19977;&#31181;&#22806;&#37096;&#20914;&#20987;&#30340;&#24433;&#21709;&#65292;&#25506;&#31350;&#30417;&#31649;&#25919;&#31574;&#23545;&#36890;&#32960;&#21160;&#24577;&#30340;&#24433;&#21709;&#12290;</title><link>http://arxiv.org/abs/2306.01284</link><description>&lt;p&gt;
&#30123;&#21518;&#36890;&#32960;&#19982;&#36135;&#24065;&#25919;&#31574;&#22256;&#22659;&#65306;&#19968;&#39033;&#22522;&#20110;&#26234;&#33021;&#20307;&#22330;&#26223;&#20998;&#26512;&#30340;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Post-COVID Inflation &amp; the Monetary Policy Dilemma: An Agent-Based Scenario Analysis. (arXiv:2306.01284v1 [econ.GN])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.01284
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20351;&#29992;&#19968;&#31181;&#22522;&#20110;&#26234;&#33021;&#20307;&#27169;&#22411;&#30340;&#26032;&#26041;&#27861;&#65292;&#30740;&#31350;&#20102;&#30123;&#21518;&#36890;&#32960;&#19982;&#36135;&#24065;&#25919;&#31574;&#30340;&#22256;&#22659;&#65292;&#36890;&#36807;&#30740;&#31350;&#19977;&#31181;&#22806;&#37096;&#20914;&#20987;&#30340;&#24433;&#21709;&#65292;&#25506;&#31350;&#30417;&#31649;&#25919;&#31574;&#23545;&#36890;&#32960;&#21160;&#24577;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
COVID-19&#24102;&#26469;&#30340;&#32463;&#27982;&#20914;&#20987;&#20984;&#26174;&#20102;&#25551;&#36848;&#21644;&#39044;&#27979;&#36890;&#32960;&#21160;&#24577;&#30340;&#22256;&#38590;&#65292;&#26412;&#25991;&#25552;&#20379;&#20102;&#19968;&#31181;&#26367;&#20195;&#24314;&#27169;&#26041;&#27861;&#12290;&#25105;&#20204;&#20351;&#29992;&#32463;&#36807;&#33391;&#22909;&#30740;&#31350;&#30340;Mark-0&#26234;&#33021;&#20307;&#27169;&#22411;&#65292;&#30740;&#31350;2020-2023&#24180;&#30340;&#24773;&#20917;&#65292;&#24182;&#21253;&#25324;&#19968;&#31181;&#26426;&#21046;&#65292;&#20351;&#32463;&#27982;&#20027;&#20307;&#23545;&#20013;&#22830;&#38134;&#34892;&#30340;&#20449;&#20219;&#21487;&#20197;&#35299;&#38500;&#12290;&#25105;&#20204;&#30740;&#31350;&#20102;&#30417;&#31649;&#25919;&#31574;&#23545;&#30001;COVID-19&#24341;&#21457;&#30340;&#19977;&#31181;&#22806;&#37096;&#20914;&#20987;&#25152;&#23548;&#33268;&#30340;&#36890;&#32960;&#21160;&#24577;&#30340;&#24433;&#21709;&#65306;&#30001;COVID&#30456;&#20851;&#23553;&#38145;&#24341;&#36215;&#30340;&#29983;&#20135;/&#28040;&#36153;&#20914;&#20987;&#12289;&#20379;&#24212;&#38142;&#20914;&#20987;&#20197;&#21450;&#20420;&#32599;&#26031;&#20837;&#20405;&#20044;&#20811;&#20848;&#21152;&#21095;&#30340;&#33021;&#28304;&#20215;&#26684;&#20914;&#20987;&#12290;&#36890;&#36807;&#22312;&#19981;&#21516;&#30340;&#36135;&#24065;&#25919;&#31574;&#25928;&#21147;&#21644;&#20256;&#23548;&#28192;&#36947;&#30340;&#20551;&#35774;&#19979;&#25506;&#31350;&#36825;&#20123;&#20914;&#20987;&#30340;&#24433;&#21709;&#65292;&#25105;&#20204;&#22238;&#39038;&#20102;&#21508;&#31181;&#35299;&#37322;&#12290;
&lt;/p&gt;
&lt;p&gt;
The economic shocks that followed the COVID-19 pandemic have brought to light the difficulty, both for academics and policy makers, of describing and predicting the dynamics of inflation. This paper offers an alternative modelling approach. We study the 2020-2023 period within the well-studied Mark-0 Agent-Based Model, in which economic agents act and react according to plausible behavioural rules. We include in particular a mechanism through which trust of economic agents in the Central Bank can de-anchor. We investigate the influence of regulatory policies on inflationary dynamics resulting from three exogenous shocks, calibrated on those that followed the COVID-19 pandemic: a production/consumption shock due to COVID-related lockdowns, a supply-chain shock, and an energy price shock exacerbated by the Russian invasion of Ukraine. By exploring the impact of these shocks under different assumptions about monetary policy efficacy and transmission channels, we review various explanation
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#21306;&#22359;&#38142;&#30340;&#21435;&#20013;&#24515;&#21270;&#32852;&#21512;&#27835;&#29702;&#27169;&#22411;&#65292;&#26088;&#22312;&#35299;&#20915;&#20256;&#32479;&#20247;&#31609;&#26041;&#27861;&#20013;&#23384;&#22312;&#30340;&#38382;&#39064;&#65292;&#21253;&#25324;&#39640;&#20132;&#26131;&#25104;&#26412;&#12289;&#32570;&#20047;&#36879;&#26126;&#24230;&#12289;&#27450;&#35784;&#21644;&#20302;&#25928;&#30340;&#36164;&#28304;&#20998;&#37197;&#12290;&#36825;&#20010;&#27169;&#22411;&#36890;&#36807;&#19977;&#26041;&#20849;&#27835;&#32467;&#26500;&#23454;&#29616;&#65292;&#20855;&#26377;&#21171;&#21160;&#12289;&#36164;&#26412;&#21644;&#27835;&#29702;&#31038;&#21306;&#65292;&#20026;&#20013;&#23567;&#24494;&#20225;&#19994;&#21644;&#21019;&#26032;&#39033;&#30446;&#25552;&#20379;&#21487;&#25345;&#32493;&#20247;&#31609;&#30340;&#35299;&#20915;&#26041;&#26696;&#12290;</title><link>http://arxiv.org/abs/2306.00869</link><description>&lt;p&gt;
&#22522;&#20110;&#21306;&#22359;&#38142;&#30340;&#21435;&#20013;&#24515;&#21270;&#32852;&#21512;&#27835;&#29702;&#65306;&#21487;&#25345;&#32493;&#20247;&#31609;&#30340;&#21019;&#26032;&#21644;&#35299;&#20915;&#26041;&#26696;&#12290;
&lt;/p&gt;
&lt;p&gt;
Blockchain-based Decentralized Co-governance: Innovations and Solutions for Sustainable Crowdfunding. (arXiv:2306.00869v1 [cs.CY])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2306.00869
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#21306;&#22359;&#38142;&#30340;&#21435;&#20013;&#24515;&#21270;&#32852;&#21512;&#27835;&#29702;&#27169;&#22411;&#65292;&#26088;&#22312;&#35299;&#20915;&#20256;&#32479;&#20247;&#31609;&#26041;&#27861;&#20013;&#23384;&#22312;&#30340;&#38382;&#39064;&#65292;&#21253;&#25324;&#39640;&#20132;&#26131;&#25104;&#26412;&#12289;&#32570;&#20047;&#36879;&#26126;&#24230;&#12289;&#27450;&#35784;&#21644;&#20302;&#25928;&#30340;&#36164;&#28304;&#20998;&#37197;&#12290;&#36825;&#20010;&#27169;&#22411;&#36890;&#36807;&#19977;&#26041;&#20849;&#27835;&#32467;&#26500;&#23454;&#29616;&#65292;&#20855;&#26377;&#21171;&#21160;&#12289;&#36164;&#26412;&#21644;&#27835;&#29702;&#31038;&#21306;&#65292;&#20026;&#20013;&#23567;&#24494;&#20225;&#19994;&#21644;&#21019;&#26032;&#39033;&#30446;&#25552;&#20379;&#21487;&#25345;&#32493;&#20247;&#31609;&#30340;&#35299;&#20915;&#26041;&#26696;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#28145;&#20837;&#25506;&#35752;&#20102;&#21435;&#20013;&#24515;&#21270;&#32852;&#21512;&#27835;&#29702;&#20247;&#31609;&#65288;DCC&#65289;&#29983;&#24577;&#31995;&#32479;&#65292;&#36825;&#26159;&#19968;&#31181;&#26032;&#30340;&#35299;&#20915;&#26041;&#26696;&#65292;&#26088;&#22312;&#35299;&#20915;&#20013;&#23567;&#24494;&#20225;&#19994;&#21644;&#21019;&#26032;&#39033;&#30446;&#25152;&#38754;&#20020;&#30340;&#20256;&#32479;&#20247;&#31609;&#26041;&#27861;&#20013;&#23384;&#22312;&#30340;&#38382;&#39064;&#12290;&#23427;&#35797;&#22270;&#32531;&#35299;&#30340;&#38382;&#39064;&#21253;&#25324;&#39640;&#20132;&#26131;&#25104;&#26412;&#12289;&#32570;&#20047;&#36879;&#26126;&#24230;&#12289;&#27450;&#35784;&#21644;&#20302;&#25928;&#30340;&#36164;&#28304;&#20998;&#37197;&#12290;&#36890;&#36807;&#20840;&#38754;&#35780;&#20272;&#29616;&#26377;&#25991;&#29486;&#23545;&#20247;&#31609;&#32463;&#27982;&#27963;&#21160;&#20197;&#21450;&#21306;&#22359;&#38142;&#23545;&#32452;&#32455;&#27835;&#29702;&#24433;&#21709;&#30340;&#30740;&#31350;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#22522;&#20110;&#25968;&#23383;&#20195;&#24065;&#21644;&#21435;&#20013;&#24515;&#21270;&#32852;&#21512;&#27835;&#29702;&#30340;&#36716;&#22411;&#31038;&#20250;&#32463;&#27982;&#27169;&#22411;&#12290;&#36825;&#20010;&#29983;&#24577;&#31995;&#32479;&#20855;&#26377;&#19977;&#26041;&#20849;&#27835;&#32467;&#26500;&#8212;&#8212;&#21171;&#21160;&#12289;&#36164;&#26412;&#21644;&#27835;&#29702;&#31038;&#21306;&#8212;&#8212;&#27599;&#20010;&#31038;&#21306;&#22312;&#29983;&#24577;&#31995;&#32479;&#30340;&#36816;&#33829;&#20013;&#37117;&#26377;&#20854;&#29420;&#29305;&#30340;&#36129;&#29486;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#23637;&#31034;&#20102;DCC&#29983;&#24577;&#31995;&#32479;&#30340;&#28436;&#21464;&#65292;&#25552;&#20379;&#20102;&#19968;&#31181;&#26032;&#30340;&#29702;&#35299;&#21435;&#20013;&#24515;&#21270;&#25968;&#23383;&#19990;&#30028;&#30340;&#31038;&#20250;&#32463;&#27982;&#21160;&#24577;&#12290;&#25105;&#20204;&#30340;&#30740;&#31350;&#36824;&#28145;&#20837;&#25506;&#35752;&#20102;DCC&#29983;&#24577;&#31995;&#32479;&#19981;&#21516;&#38454;&#27573;&#30340;&#20869;&#22312;&#22797;&#26434;&#24615;&#21644;&#27835;&#29702;&#26426;&#21046;&#12290;
&lt;/p&gt;
&lt;p&gt;
This thesis provides an in-depth exploration of the Decentralized Co-governance Crowdfunding (DCC) Ecosystem, a novel solution addressing prevailing challenges in conventional crowdfunding methods faced by MSMEs and innovative projects. Among the problems it seeks to mitigate are high transaction costs, lack of transparency, fraud, and inefficient resource allocation. Leveraging a comprehensive review of the existing literature on crowdfunding economic activities and blockchain's impact on organizational governance, we propose a transformative socio-economic model based on digital tokens and decentralized co-governance. This ecosystem is marked by a tripartite community structure - the Labor, Capital, and Governance communities - each contributing uniquely to the ecosystem's operation. Our research unfolds the evolution of the DCC ecosystem through distinct phases, offering a novel understanding of socioeconomic dynamics in a decentralized digital world. It also delves into the intrica
&lt;/p&gt;</description></item><item><title>&#37329;&#34701;&#39044;&#27979;&#20013;&#27169;&#22411;&#30340;&#19968;&#33268;&#24615;&#23545;&#20110;&#24314;&#31435;&#29992;&#25143;&#20449;&#20219;&#33267;&#20851;&#37325;&#35201;&#65292;&#20294;&#30446;&#21069;&#37329;&#34701;&#39044;&#27979;&#26041;&#27861;&#24456;&#23569;&#32771;&#34385;&#36825;&#19968;&#28857;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#35780;&#20272;&#37329;&#34701;&#25991;&#26412;&#36923;&#36753;&#19968;&#33268;&#24615;&#30340;&#35780;&#20272;&#24037;&#20855;FinTrust&#65292;&#24182;&#20351;&#29992;&#23427;&#21457;&#29616;&#26368;&#20808;&#36827;&#30340;&#37329;&#34701;&#39044;&#27979;NLP&#27169;&#22411;&#30340;&#19968;&#33268;&#24615;&#36739;&#24046;&#12290;</title><link>http://arxiv.org/abs/2305.08524</link><description>&lt;p&gt;
&#22522;&#20110;&#25991;&#26412;&#30340;&#37329;&#34701;&#39044;&#27979;&#27169;&#22411;&#30340;&#19968;&#33268;&#24615;&#35780;&#20272;
&lt;/p&gt;
&lt;p&gt;
Measuring Consistency in Text-based Financial Forecasting Models. (arXiv:2305.08524v1 [cs.CL])
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2305.08524
&lt;/p&gt;
&lt;p&gt;
&#37329;&#34701;&#39044;&#27979;&#20013;&#27169;&#22411;&#30340;&#19968;&#33268;&#24615;&#23545;&#20110;&#24314;&#31435;&#29992;&#25143;&#20449;&#20219;&#33267;&#20851;&#37325;&#35201;&#65292;&#20294;&#30446;&#21069;&#37329;&#34701;&#39044;&#27979;&#26041;&#27861;&#24456;&#23569;&#32771;&#34385;&#36825;&#19968;&#28857;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#31181;&#35780;&#20272;&#37329;&#34701;&#25991;&#26412;&#36923;&#36753;&#19968;&#33268;&#24615;&#30340;&#35780;&#20272;&#24037;&#20855;FinTrust&#65292;&#24182;&#20351;&#29992;&#23427;&#21457;&#29616;&#26368;&#20808;&#36827;&#30340;&#37329;&#34701;&#39044;&#27979;NLP&#27169;&#22411;&#30340;&#19968;&#33268;&#24615;&#36739;&#24046;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#37329;&#34701;&#39044;&#27979;&#26159;&#26426;&#22120;&#23398;&#20064;&#30740;&#31350;&#20013;&#19968;&#20010;&#37325;&#35201;&#19988;&#27963;&#36291;&#30340;&#39046;&#22495;&#65292;&#22240;&#20026;&#21363;&#20351;&#26159;&#26368;&#23567;&#30340;&#39044;&#27979;&#20934;&#30830;&#29575;&#25552;&#39640;&#20063;&#21487;&#20197;&#36716;&#21270;&#20026;&#24040;&#22823;&#30340;&#36130;&#21153;&#25910;&#30410;&#12290;&#33258;&#28982;&#35821;&#35328;&#22788;&#29702;&#26041;&#38754;&#30340;&#26368;&#26032;&#36827;&#23637;&#24102;&#26469;&#20102;&#21033;&#29992;&#25991;&#26412;&#25968;&#25454;&#65288;&#22914;&#19978;&#24066;&#20844;&#21496;&#30340;&#30408;&#21033;&#25253;&#21578;&#65289;&#26469;&#39044;&#27979;&#36164;&#20135;&#25910;&#30410;&#29575;&#30340;&#26426;&#20250;&#12290;&#28982;&#32780;&#65292;&#22312;&#22788;&#29702;&#36825;&#31181;&#25935;&#24863;&#20219;&#21153;&#26102;&#65292;&#27169;&#22411;&#30340;&#19968;&#33268;&#24615;&#8212;&#8212;&#21363;&#22312;&#36755;&#20837;&#30340;&#20445;&#30041;&#24847;&#20041;&#25913;&#21464;&#26102;&#23545;&#27169;&#22411;&#30340;&#24433;&#21709;&#26159;&#19968;&#20010;&#24314;&#31435;&#29992;&#25143;&#20449;&#20219;&#30340;&#20851;&#38190;&#23646;&#24615;&#65292;&#20294;&#24403;&#21069;&#30340;&#37329;&#34701;&#39044;&#27979;&#26041;&#27861;&#21364;&#27809;&#26377;&#32771;&#34385;&#21040;&#36825;&#19968;&#28857;&#12290;&#22240;&#27492;&#65292;&#25105;&#20204;&#25552;&#20986;&#20102;FinTrust&#65292;&#19968;&#31181;&#35780;&#20272;&#37329;&#34701;&#25991;&#26412;&#20013;&#36923;&#36753;&#19968;&#33268;&#24615;&#30340;&#35780;&#20272;&#24037;&#20855;&#12290;&#20351;&#29992;FinTrust&#65292;&#25105;&#20204;&#21457;&#29616;&#30446;&#21069;&#26368;&#20808;&#36827;&#30340;&#37329;&#34701;&#39044;&#27979;NLP&#27169;&#22411;&#30340;&#19968;&#33268;&#24615;&#36739;&#24046;&#12290;&#25105;&#20204;&#23545;&#20445;&#30041;&#24847;&#20041;&#25913;&#21464;&#24341;&#36215;&#30340;&#24615;&#33021;&#38477;&#32423;&#36827;&#34892;&#20998;&#26512;&#65292;&#32467;&#26524;&#34920;&#26126;...
&lt;/p&gt;
&lt;p&gt;
Financial forecasting has been an important and active area of machine learning research, as even the most modest advantage in predictive accuracy can be parlayed into significant financial gains. Recent advances in natural language processing (NLP) bring the opportunity to leverage textual data, such as earnings reports of publicly traded companies, to predict the return rate for an asset. However, when dealing with such a sensitive task, the consistency of models -- their invariance under meaning-preserving alternations in input -is a crucial property for building user trust. Despite this, current financial forecasting methods do not consider consistency. To address this problem, we propose FinTrust, an evaluation tool that assesses logical consistency in financial text. Using FinTrust, we show that the consistency of state-of-the-art NLP models for financial forecasting is poor. Our analysis of the performance degradation caused by meaning-preserving alternations suggests that cur
&lt;/p&gt;</description></item><item><title>&#30740;&#31350;&#21457;&#29616;&#65292;COVID-19&#22823;&#27969;&#34892;&#26399;&#38388;&#8220;&#23621;&#23478;&#20196;&#8221;&#23545;&#32463;&#27982;&#19981;&#30830;&#23450;&#24615;&#21644;&#24773;&#24863;&#24433;&#21709;&#19981;&#26174;&#33879;&#65292;&#20294;&#26159;&#22686;&#21152;&#20102;&#20581;&#24247;&#21644;&#25919;&#27835;&#26041;&#38754;&#30340;&#19981;&#30830;&#23450;&#24615;&#21644;&#26356;&#28040;&#26497;&#30340;&#25919;&#27835;&#24773;&#32490;&#12290;</title><link>http://arxiv.org/abs/2212.01705</link><description>&lt;p&gt;
&#25171;&#30772;&#23553;&#38145;&#65306;COVID-19&#22823;&#27969;&#34892;&#26399;&#38388;&#8220;&#23621;&#23478;&#20196;&#8221;&#23545;&#19981;&#30830;&#23450;&#24615;&#21644;&#24773;&#24863;&#30340;&#22240;&#26524;&#24433;&#21709;
&lt;/p&gt;
&lt;p&gt;
Breaking Down the Lockdown: The Causal Effects of Stay-At-Home Mandates on Uncertainty and Sentiments During the COVID-19 Pandemic. (arXiv:2212.01705v3 [stat.AP] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2212.01705
&lt;/p&gt;
&lt;p&gt;
&#30740;&#31350;&#21457;&#29616;&#65292;COVID-19&#22823;&#27969;&#34892;&#26399;&#38388;&#8220;&#23621;&#23478;&#20196;&#8221;&#23545;&#32463;&#27982;&#19981;&#30830;&#23450;&#24615;&#21644;&#24773;&#24863;&#24433;&#21709;&#19981;&#26174;&#33879;&#65292;&#20294;&#26159;&#22686;&#21152;&#20102;&#20581;&#24247;&#21644;&#25919;&#27835;&#26041;&#38754;&#30340;&#19981;&#30830;&#23450;&#24615;&#21644;&#26356;&#28040;&#26497;&#30340;&#25919;&#27835;&#24773;&#32490;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#30740;&#31350;&#20102;&#23553;&#38145;&#25514;&#26045;&#23545;&#25512;&#29305;&#19978;&#19981;&#30830;&#23450;&#24615;&#21644;&#24773;&#24863;&#30340;&#22240;&#26524;&#24433;&#21709;&#12290;&#25105;&#20204;&#21033;&#29992;&#31532;&#19968;&#27425;COVID-19&#23553;&#38145;&#8212;&#8212;&#24847;&#22823;&#21033;&#22312;2020&#24180;2&#26376;&#23454;&#26045;&#30340;&#24847;&#22806;&#23553;&#38145;&#30340;&#25311;&#23454;&#39564;&#26694;&#26550;&#12290;&#25105;&#20204;&#20351;&#29992;&#28145;&#24230;&#23398;&#20064;&#21644;&#22522;&#20110;&#35789;&#20856;&#30340;&#26041;&#27861;&#27979;&#37327;&#20102;&#22312;&#21463;&#38480;&#21306;&#22495;&#20869;&#21644;&#38468;&#36817;&#22320;&#21306;&#22320;&#29702;&#23450;&#20301;&#30340;&#27599;&#26085;&#25512;&#25991;&#30340;&#25991;&#26412;&#65292;&#20197;&#35780;&#20272;&#27835;&#30103;&#21069;&#21518;&#20844;&#20247;&#24773;&#24863;&#30340;&#21464;&#21270;&#12290;&#25105;&#20204;&#23558;&#25512;&#25991;&#20998;&#20026;&#32463;&#27982;&#12289;&#20581;&#24247;&#12289;&#25919;&#27835;&#21644;&#23553;&#38145;&#25919;&#31574;&#22235;&#31867;&#65292;&#20197;&#26816;&#26597;&#25919;&#31574;&#22914;&#20309;&#24322;&#36136;&#22320;&#24433;&#21709;&#24773;&#24863;&#12290;&#20351;&#29992;&#38169;&#20301;&#24046;&#20998;&#21644;&#24046;&#20998;&#26041;&#27861;&#65292;&#25105;&#20204;&#26174;&#31034;&#23553;&#38145;&#23545;&#32463;&#27982;&#19981;&#30830;&#23450;&#24615;&#21644;&#24773;&#24863;&#27809;&#26377;&#26174;&#30528;&#30340;&#31283;&#20581;&#24433;&#21709;&#12290;&#28982;&#32780;&#65292;&#36825;&#39033;&#25919;&#31574;&#30340;&#20195;&#20215;&#26159;&#22686;&#21152;&#20102;&#20581;&#24247;&#21644;&#25919;&#27835;&#26041;&#38754;&#30340;&#19981;&#30830;&#23450;&#24615;&#20197;&#21450;&#26356;&#28040;&#26497;&#30340;&#25919;&#27835;&#24773;&#32490;&#12290;&#36825;&#20123;&#32467;&#26524;&#32463;&#36807;&#20102;&#19968;&#31995;&#21015;&#40065;&#26834;&#24615;&#27979;&#35797;&#30340;&#39564;&#35777;&#65292;&#34920;&#26126;&#23553;&#38145;&#25514;&#26045;&#20855;&#26377;&#37325;&#35201;&#30340;&#38750;
&lt;/p&gt;
&lt;p&gt;
We study the causal effects of lockdown measures on uncertainty and sentiment on Twitter. To this end, we exploit the quasi-experimental framework created by the first COVID-19 lockdown in a high-income economy--the unexpected Italian lockdown in February 2020. We measure changes in public sentiment using deep learning and dictionary-based methods on the text of daily tweets geolocated within and near the locked-down areas, before and after the treatment. We classify tweets into four categories--economics, health, politics, and lockdown policy--to examine how the policy affected emotions heterogeneously. Using a staggered difference-in-differences approach, we show that the lockdown did not have a significantly robust impact on economic uncertainty and sentiment. However, the policy came at the price of higher uncertainty on health and politics and more negative political sentiments. These results, which are robust to a battery of robustness tests, show that lockdowns have relevant non
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#39118;&#38505;&#31867;&#22411;&#65292;&#31216;&#20026;&#20849;&#21516;&#30340;&#29305;&#24322;&#24615;&#20998;&#20301;&#25968;&#39118;&#38505;&#65292;&#20854;&#25581;&#31034;&#20102;&#25237;&#36164;&#32773;&#22914;&#20309;&#23450;&#20215;&#27491;&#21521;&#21644;&#36127;&#21521;&#39118;&#38505;&#30340;&#26032;&#35265;&#35299;&#65292;&#23545;&#24635;&#20307;&#24066;&#22330;&#22238;&#25253;&#20063;&#20855;&#26377;&#39044;&#27979;&#33021;&#21147;&#12290;</title><link>http://arxiv.org/abs/2208.14267</link><description>&lt;p&gt;
&#20849;&#21516;&#30340;&#29305;&#24322;&#24615;&#20998;&#20301;&#25968;&#39118;&#38505;
&lt;/p&gt;
&lt;p&gt;
Common Idiosyncratic Quantile Risk. (arXiv:2208.14267v2 [q-fin.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2208.14267
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25552;&#20986;&#20102;&#19968;&#31181;&#26032;&#30340;&#39118;&#38505;&#31867;&#22411;&#65292;&#31216;&#20026;&#20849;&#21516;&#30340;&#29305;&#24322;&#24615;&#20998;&#20301;&#25968;&#39118;&#38505;&#65292;&#20854;&#25581;&#31034;&#20102;&#25237;&#36164;&#32773;&#22914;&#20309;&#23450;&#20215;&#27491;&#21521;&#21644;&#36127;&#21521;&#39118;&#38505;&#30340;&#26032;&#35265;&#35299;&#65292;&#23545;&#24635;&#20307;&#24066;&#22330;&#22238;&#25253;&#20063;&#20855;&#26377;&#39044;&#27979;&#33021;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#21457;&#29616;&#20102;&#19968;&#31181;&#26032;&#30340;&#39118;&#38505;&#31867;&#22411;&#65292;&#20854;&#29305;&#24449;&#22312;&#20110;&#36164;&#20135;&#22238;&#25253;&#30340;&#27178;&#25130;&#38754;&#20998;&#20301;&#25968;&#20855;&#26377;&#20849;&#24615;&#12290;&#25105;&#20204;&#25552;&#20986;&#30340;&#26032;&#22411;&#20998;&#20301;&#25968;&#39118;&#38505;&#22240;&#23376;&#19982;&#29305;&#23450;&#20998;&#20301;&#25968;&#30340;&#39118;&#38505;&#28322;&#37228;&#30456;&#20851;&#65292;&#24182;&#25581;&#31034;&#20102;&#25237;&#36164;&#32773;&#22914;&#20309;&#23450;&#20215;&#27491;&#21521;&#21644;&#36127;&#21521;&#39118;&#38505;&#30340;&#26032;&#35265;&#35299;&#12290;&#19982;&#20197;&#24448;&#25991;&#29486;&#30456;&#27604;&#65292;&#25105;&#20204;&#22312;&#19981;&#20570;&#28151;&#28102;&#20551;&#35774;&#25110;&#27719;&#24635;&#21487;&#33021;&#30340;&#38750;&#32447;&#24615;&#20449;&#24687;&#30340;&#24773;&#20917;&#19979;&#24674;&#22797;&#20102;&#27178;&#25130;&#38754;&#20998;&#20301;&#25968;&#30340;&#20849;&#21516;&#32467;&#26500;&#12290;&#25105;&#20204;&#35752;&#35770;&#20102;&#26032;&#30340;&#20998;&#20301;&#25968;&#39118;&#38505;&#22240;&#23376;&#19982;&#27969;&#34892;&#30340;&#27874;&#21160;&#29575;&#21644;&#19979;&#34892;&#39118;&#38505;&#22240;&#23376;&#30340;&#19981;&#21516;&#20043;&#22788;&#65292;&#24182;&#30830;&#23450;&#20102;&#21738;&#20123;&#20998;&#20301;&#25968;&#20381;&#36182;&#24615;&#39118;&#38505;&#24212;&#35813;&#24471;&#21040;&#26356;&#22823;&#30340;&#34917;&#20607;&#12290;&#20998;&#20301;&#25968;&#22240;&#23376;&#20063;&#20855;&#26377;&#23545;&#24635;&#20307;&#24066;&#22330;&#22238;&#25253;&#30340;&#39044;&#27979;&#33021;&#21147;&#12290;
&lt;/p&gt;
&lt;p&gt;
We identify a new type of risk that is characterised by commonalities in the quantiles of the cross-sectional distribution of asset returns. Our newly proposed quantile risk factor is associated with a quantile-specific risk premium and provides new insights into how upside and downside risks are priced by investors. In contrast to the previous literature, we recover the common structure in cross-sectional quantiles without making confounding assumptions or aggregating potentially non-linear information. We discuss how the new quantile-based risk factor differs from popular volatility and downside risk factors, and we identify where the quantile-dependent risks deserve greater compensation. Quantile factors also have predictive power for aggregate market returns.
&lt;/p&gt;</description></item><item><title>&#26412;&#35770;&#25991;&#25506;&#31350;&#20102;&#25512;&#33616;&#31995;&#32479;&#20013;&#20010;&#24615;&#21270;&#20869;&#23481;&#30340;&#20379;&#32473;&#20391;&#22343;&#34913;&#38382;&#39064;&#65292;&#20854;&#29305;&#28857;&#26159;&#29983;&#20135;&#32773;&#20915;&#31574;&#31354;&#38388;&#26159;&#22810;&#32500;&#30340;&#21644;&#29992;&#25143;&#32676;&#20307;&#26159;&#24322;&#26500;&#30340;&#65292;&#39640;&#32500;&#24230;&#21644;&#24322;&#36136;&#24615;&#30340;&#27169;&#22411;&#21019;&#36896;&#20102;&#19987;&#19994;&#21270;&#30340;&#21487;&#33021;&#24615;&#12290;</title><link>http://arxiv.org/abs/2206.13489</link><description>&lt;p&gt;
&#25512;&#33616;&#31995;&#32479;&#20013;&#30340;&#20379;&#32473;&#20391;&#22343;&#34913;
&lt;/p&gt;
&lt;p&gt;
Supply-Side Equilibria in Recommender Systems. (arXiv:2206.13489v2 [cs.GT] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2206.13489
&lt;/p&gt;
&lt;p&gt;
&#26412;&#35770;&#25991;&#25506;&#31350;&#20102;&#25512;&#33616;&#31995;&#32479;&#20013;&#20010;&#24615;&#21270;&#20869;&#23481;&#30340;&#20379;&#32473;&#20391;&#22343;&#34913;&#38382;&#39064;&#65292;&#20854;&#29305;&#28857;&#26159;&#29983;&#20135;&#32773;&#20915;&#31574;&#31354;&#38388;&#26159;&#22810;&#32500;&#30340;&#21644;&#29992;&#25143;&#32676;&#20307;&#26159;&#24322;&#26500;&#30340;&#65292;&#39640;&#32500;&#24230;&#21644;&#24322;&#36136;&#24615;&#30340;&#27169;&#22411;&#21019;&#36896;&#20102;&#19987;&#19994;&#21270;&#30340;&#21487;&#33021;&#24615;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#31639;&#27861;&#25512;&#33616;&#31995;&#32479;&#65288;&#22914;Spotify&#21644;Netflix&#65289;&#19981;&#20165;&#24433;&#21709;&#28040;&#36153;&#32773;&#34892;&#20026;&#65292;&#32780;&#19988;&#24433;&#21709;&#29983;&#20135;&#32773;&#30340;&#28608;&#21169;&#12290;&#29983;&#20135;&#32773;&#35797;&#22270;&#21019;&#24314;&#23558;&#34987;&#25512;&#33616;&#31639;&#27861;&#26174;&#31034;&#30340;&#20869;&#23481;&#65292;&#36825;&#21487;&#33021;&#24433;&#21709;&#20182;&#20204;&#20869;&#23481;&#30340;&#22810;&#26679;&#24615;&#21644;&#36136;&#37327;&#12290;&#26412;&#25991;&#30740;&#31350;&#20010;&#24615;&#21270;&#20869;&#23481;&#25512;&#33616;&#31995;&#32479;&#20013;&#30340;&#20379;&#32473;&#20391;&#22343;&#34913;&#12290;&#25105;&#20204;&#23558;&#29992;&#25143;&#21644;&#20869;&#23481;&#24314;&#27169;&#20026; $D$ &#32500;&#21521;&#37327;&#65292;&#25512;&#33616;&#31639;&#27861;&#26174;&#31034;&#27599;&#20010;&#29992;&#25143;&#19982;&#20043;&#26368;&#39640;&#28857;&#31215;&#30340;&#20869;&#23481;&#65292;&#29983;&#20135;&#32773;&#26368;&#22823;&#21270;&#34987;&#25512;&#33616;&#20854;&#20869;&#23481;&#30340;&#29992;&#25143;&#25968;&#20943;&#21435;&#29983;&#20135;&#25104;&#26412;&#12290;&#25105;&#20204;&#27169;&#22411;&#30340;&#20004;&#20010;&#20851;&#38190;&#29305;&#24449;&#26159;&#29983;&#20135;&#32773;&#20915;&#31574;&#31354;&#38388;&#26159;&#22810;&#32500;&#30340;&#65292;&#29992;&#25143;&#32676;&#20307;&#26159;&#24322;&#26500;&#30340;&#65292;&#36825;&#19982;&#32463;&#20856;&#20302;&#32500;&#27169;&#22411;&#19981;&#21516;&#12290;&#22810;&#32500;&#24615;&#21644;&#24322;&#36136;&#24615;&#21019;&#36896;&#20102;&#19987;&#19994;&#21270;&#30340;&#21487;&#33021;&#24615;&#65292;&#19981;&#21516;&#30340;&#29983;&#20135;&#32773;&#22312;&#22343;&#34913;&#29366;&#24577;&#19979;&#21019;&#24314;&#19981;&#21516;&#31867;&#22411;&#30340;&#20869;&#23481;&#12290;&#20351;&#29992;&#23545;&#20598;&#35770;&#35777;&#27861;
&lt;/p&gt;
&lt;p&gt;
Algorithmic recommender systems such as Spotify and Netflix affect not only consumer behavior but also producer incentives. Producers seek to create content that will be shown by the recommendation algorithm, which can impact both the diversity and quality of their content. In this work, we investigate the resulting supply-side equilibria in personalized content recommender systems. We model users and content as $D$-dimensional vectors, the recommendation algorithm as showing each user the content with highest dot product, and producers as maximizing the number of users who are recommended their content minus the cost of production. Two key features of our model are that the producer decision space is multi-dimensional and the user base is heterogeneous, which contrasts with classical low-dimensional models.  Multi-dimensionality and heterogeneity create the potential for specialization, where different producers create different types of content at equilibrium. Using a duality argumen
&lt;/p&gt;</description></item><item><title>&#35813;&#35770;&#25991;&#25581;&#31034;&#20102;&#36991;&#38505;&#21644;&#25237;&#36164;&#20135;&#21697;&#20043;&#38388;&#30340;&#20960;&#20309;&#32467;&#26500;&#65292;&#24182;&#25552;&#20379;&#20102;&#26368;&#20248;&#20135;&#21697;&#35774;&#35745;&#20013;&#30340;&#20449;&#24687;&#12290;</title><link>http://arxiv.org/abs/2206.08753</link><description>&lt;p&gt;
&#39118;&#38505;&#21644;&#22238;&#25253;&#30340;&#20449;&#24687;&#20960;&#20309;
&lt;/p&gt;
&lt;p&gt;
Information Geometry of Risks and Returns. (arXiv:2206.08753v3 [econ.GN] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2206.08753
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#25581;&#31034;&#20102;&#36991;&#38505;&#21644;&#25237;&#36164;&#20135;&#21697;&#20043;&#38388;&#30340;&#20960;&#20309;&#32467;&#26500;&#65292;&#24182;&#25552;&#20379;&#20102;&#26368;&#20248;&#20135;&#21697;&#35774;&#35745;&#20013;&#30340;&#20449;&#24687;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#25105;&#20204;&#25581;&#31034;&#20102;&#36991;&#38505;&#21644;&#25237;&#36164;&#20135;&#21697;&#20043;&#38388;&#30340;&#20960;&#20309;&#32467;&#26500;&#12290;&#36825;&#20010;&#32467;&#26500;&#26159;&#26681;&#25454;&#19968;&#20010;&#31616;&#21333;&#30340;&#20844;&#24335;&#65292;&#22312;&#22238;&#25253;&#26041;&#38754;&#34920;&#36798;&#25237;&#36164;&#39118;&#38505;&#25152;&#24418;&#25104;&#30340;&#12290;&#36825;&#20026;&#26368;&#20248;&#20135;&#21697;&#35774;&#35745;&#25552;&#20379;&#20102;&#20449;&#24687;&#12290;&#25105;&#20204;&#32771;&#34385;&#20102;&#26368;&#20248;&#30340;&#32431;&#36991;&#38505;(&#21253;&#25324;&#25104;&#26412;&#26368;&#20302;&#30340;&#20135;&#21697;)&#21644;&#28151;&#21512;&#36991;&#38505;(&#20854;&#20013;&#37096;&#20998;&#39118;&#38505;&#34987;&#32435;&#20837;&#26368;&#20339;&#25237;&#36164;&#20135;&#21697;&#20013;)&#12290;&#36991;&#38505;&#21644;&#25237;&#36164;&#20043;&#38388;&#30340;&#23545;&#20598;&#24615;&#34987;&#35777;&#26126;&#65292;&#24182;&#24212;&#29992;&#20110;&#26368;&#20248;&#39118;&#38505;&#22238;&#25910;&#12290;&#25105;&#20204;&#25552;&#20986;&#20102;&#19968;&#20010;&#20851;&#20110;&#21512;&#29702;&#24615;&#30340;&#20960;&#20309;&#35299;&#37322;&#12290;
&lt;/p&gt;
&lt;p&gt;
We reveal a geometric structure underlying both hedging and investment products. The structure follows from a simple formula expressing investment risks in terms of returns. This informs optimal product designs. Optimal pure hedging (including cost-optimal products) and hybrid hedging (where a partial hedge is built into an optimal investment product) are considered. Duality between hedging and investment is demonstrated with applications to optimal risk recycling. A geometric interpretation of rationality is presented.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#30740;&#31350;&#20102;&#21033;&#29992;&#21069;&#39304;&#31070;&#32463;&#32593;&#32476;&#36827;&#34892;&#37325;&#35201;&#24615;&#25277;&#26679;&#30340;&#26399;&#26435;&#23450;&#20215;&#65292;&#35777;&#26126;&#20102;&#20854;&#22312;&#39640;&#26031;&#27979;&#24230;&#30340;&#25299;&#25169;&#31354;&#38388;&#20013;&#20855;&#26377;&#36890;&#29992;&#36924;&#36817;&#24615;&#36136;&#65292;&#24182;&#36890;&#36807;&#25968;&#20540;&#30740;&#31350;&#35777;&#26126;&#20102;&#20854;&#22312;&#23450;&#20215;&#36335;&#24452;&#22411;&#27431;&#24335;&#26399;&#26435;&#31561;&#26041;&#38754;&#30340;&#24212;&#29992;&#21069;&#26223;&#12290;</title><link>http://arxiv.org/abs/2112.14247</link><description>&lt;p&gt;
&#21033;&#29992;&#21069;&#39304;&#31070;&#32463;&#32593;&#32476;&#36827;&#34892;&#26399;&#26435;&#23450;&#20215;&#30340;&#37325;&#35201;&#24615;&#25277;&#26679;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Importance sampling for option pricing with feedforward neural networks. (arXiv:2112.14247v2 [q-fin.CP] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2112.14247
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#21033;&#29992;&#21069;&#39304;&#31070;&#32463;&#32593;&#32476;&#36827;&#34892;&#37325;&#35201;&#24615;&#25277;&#26679;&#30340;&#26399;&#26435;&#23450;&#20215;&#65292;&#35777;&#26126;&#20102;&#20854;&#22312;&#39640;&#26031;&#27979;&#24230;&#30340;&#25299;&#25169;&#31354;&#38388;&#20013;&#20855;&#26377;&#36890;&#29992;&#36924;&#36817;&#24615;&#36136;&#65292;&#24182;&#36890;&#36807;&#25968;&#20540;&#30740;&#31350;&#35777;&#26126;&#20102;&#20854;&#22312;&#23450;&#20215;&#36335;&#24452;&#22411;&#27431;&#24335;&#26399;&#26435;&#31561;&#26041;&#38754;&#30340;&#24212;&#29992;&#21069;&#26223;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#30740;&#31350;&#20102;&#36890;&#36807;&#23545;&#37319;&#26679;&#27979;&#24230;&#36827;&#34892;&#36866;&#24403;&#25913;&#21464;&#26469;&#20943;&#23569;&#33945;&#29305;&#21345;&#32599;&#20272;&#35745;&#30340;&#26041;&#24046;&#30340;&#38382;&#39064;&#65292;&#36825;&#20123;&#37319;&#26679;&#27979;&#24230;&#26159;&#30001;&#21069;&#39304;&#31070;&#32463;&#32593;&#32476;&#24341;&#21457;&#30340;&#12290;&#25105;&#20204;&#22312;&#21521;&#37327;&#38543;&#26426;&#31215;&#20998;&#30340;&#27010;&#24565;&#22522;&#30784;&#19978;&#65292;&#21051;&#30011;&#20102;&#30001;&#24102;&#26377;&#30830;&#23450;&#24615;&#21327;&#26041;&#24046;&#30340;&#21521;&#37327;&#20540;&#36830;&#32493;&#23616;&#37096;&#38789;&#24341;&#21457;&#30340;&#19968;&#31867;&#39640;&#26031;&#27979;&#24230;&#30340;Cameron-Martin&#31354;&#38388;&#12290;&#25105;&#20204;&#35777;&#26126;&#20102;&#21069;&#39304;&#31070;&#32463;&#32593;&#32476;&#22312;&#36825;&#20123;&#25299;&#25169;&#31354;&#38388;&#20013;&#20855;&#26377;&#36890;&#29992;&#36924;&#36817;&#24615;&#36136;&#65292;&#26368;&#32456;&#24471;&#20986;&#20102;&#32467;&#35770;&#65306;&#30001;&#21069;&#39304;&#31070;&#32463;&#32593;&#32476;&#29983;&#25104;&#30340;&#37319;&#26679;&#27979;&#24230;&#21487;&#20197;&#20219;&#24847;&#25509;&#36817;&#26368;&#20248;&#37319;&#26679;&#27979;&#24230;&#12290;&#22312;&#27492;&#22522;&#30784;&#19978;&#65292;&#25105;&#20204;&#23545;&#19968;&#20123;&#21253;&#21547;&#19994;&#21153;&#27963;&#21160;&#21464;&#21270;&#12289;&#25970;&#20986;&#22721;&#22418;&#12289;&#21160;&#24577;&#30456;&#20851;&#24615;&#21644;&#39640;&#32500;&#31726;&#23376;&#31561;&#22240;&#32032;&#30340;&#36164;&#20135;&#20215;&#26684;&#27169;&#22411;&#36827;&#34892;&#20102;&#20840;&#38754;&#30340;&#25968;&#20540;&#30740;&#31350;&#65292;&#23450;&#20215;&#36335;&#24452;&#22411;&#27431;&#24335;&#26399;&#26435;&#12290;
&lt;/p&gt;
&lt;p&gt;
We study the problem of reducing the variance of Monte Carlo estimators through performing suitable changes of the sampling measure which are induced by feedforward neural networks. To this end, building on the concept of vector stochastic integration, we characterize the Cameron-Martin spaces of a large class of Gaussian measures which are induced by vector-valued continuous local martingales with deterministic covariation. We prove that feedforward neural networks enjoy, up to an isometry, the universal approximation property in these topological spaces. We then prove that sampling measures which are generated by feedforward neural networks can approximate the optimal sampling measure arbitrarily well. We conclude with a comprehensive numerical study pricing path-dependent European options for asset price models that incorporate factors such as changing business activity, knock-out barriers, dynamic correlations, and high-dimensional baskets.
&lt;/p&gt;</description></item><item><title>&#26412;&#25991;&#20998;&#26512;&#20102;&#31895;&#31961;Volterra&#38543;&#26426;&#27874;&#21160;&#27169;&#22411;&#22312;&#24066;&#22330;&#26657;&#20934;&#36807;&#31243;&#20013;&#30340;&#40065;&#26834;&#24615;&#21644;&#25935;&#24863;&#24615;&#65292;&#24182;&#38024;&#23545;&#25968;&#25454;&#38598;&#36827;&#34892;&#20102;&#23454;&#35777;&#30740;&#31350;&#12290;</title><link>http://arxiv.org/abs/2107.12462</link><description>&lt;p&gt;
&#31895;&#31961;Volterra&#38543;&#26426;&#27874;&#21160;&#27169;&#22411;&#30340;&#40065;&#26834;&#24615;&#21644;&#25935;&#24863;&#24615;&#20998;&#26512;
&lt;/p&gt;
&lt;p&gt;
Robustness and sensitivity analyses for rough Volterra stochastic volatility models. (arXiv:2107.12462v2 [q-fin.PR] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2107.12462
&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20998;&#26512;&#20102;&#31895;&#31961;Volterra&#38543;&#26426;&#27874;&#21160;&#27169;&#22411;&#22312;&#24066;&#22330;&#26657;&#20934;&#36807;&#31243;&#20013;&#30340;&#40065;&#26834;&#24615;&#21644;&#25935;&#24863;&#24615;&#65292;&#24182;&#38024;&#23545;&#25968;&#25454;&#38598;&#36827;&#34892;&#20102;&#23454;&#35777;&#30740;&#31350;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#26412;&#25991;&#20998;&#26512;&#20102;&#21508;&#31181;&#36830;&#32493;&#26102;&#38388;&#31895;&#31961;Volterra&#38543;&#26426;&#27874;&#21160;&#27169;&#22411;&#22312;&#24066;&#22330;&#26657;&#20934;&#36807;&#31243;&#20013;&#30340;&#40065;&#26834;&#24615;&#21644;&#25935;&#24863;&#24615;&#12290;&#20174;&#26399;&#26435;&#20215;&#26684;&#20272;&#35745;&#21644;&#21442;&#25968;&#20272;&#35745;&#23545;&#26399;&#26435;&#25968;&#25454;&#32467;&#26500;&#21464;&#21270;&#30340;&#25935;&#24863;&#24615;&#20004;&#20010;&#35282;&#24230;&#32771;&#34385;&#27169;&#22411;&#30340;&#40065;&#26834;&#24615;&#12290;&#36827;&#19968;&#27493;&#65292;&#36827;&#34892;&#25935;&#24863;&#24615;&#20998;&#26512;&#65292;&#36890;&#36807;&#32479;&#35745;&#26816;&#39564;&#26469;&#30830;&#23450;&#30740;&#31350;&#27169;&#22411;&#26159;&#21542;&#23545;&#26399;&#26435;&#32467;&#26500;&#21464;&#21270;&#25935;&#24863;&#65292;&#22522;&#20110;&#21442;&#25968;&#20272;&#35745;&#20998;&#24067;&#36827;&#34892;&#20998;&#26512;&#12290;&#38024;&#23545;&#30001;2015&#24180;4&#26376;&#21644;5&#26376;&#33529;&#26524;&#20844;&#21496;&#32929;&#31080;&#26399;&#26435;&#20132;&#26131;&#24418;&#25104;&#30340;&#25968;&#25454;&#38598;&#36827;&#34892;&#20102;&#23454;&#35777;&#30740;&#31350;&#65292;&#29305;&#21035;&#25552;&#20379;&#20102;RFSV&#12289;rBergomi&#21644;&#945;RFSV&#27169;&#22411;&#30340;&#32467;&#26524;&#24182;&#19982;Heston&#12289;Bates&#21644;AFSVJD&#27169;&#22411;&#30340;&#32467;&#26524;&#36827;&#34892;&#20102;&#27604;&#36739;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this paper, we analyze the robustness and sensitivity of various continuous-time rough Volterra stochastic volatility models in relation to the process of market calibration. Model robustness is examined from two perspectives: the sensitivity of option price estimates and the sensitivity of parameter estimates to changes in the option data structure. The following sensitivity analysis consists of statistical tests to determine whether a given studied model is sensitive to changes in the option data structure based on the distribution of parameter estimates. Empirical study is performed on a data set consisting of Apple Inc. equity options traded on four different days in April and May 2015. In particular, the results for RFSV, rBergomi and $\alpha$RFSV models are provided and compared to the results for Heston, Bates, and AFSVJD models.
&lt;/p&gt;</description></item></channel></rss>