<rss version="2.0"><channel><title>Chat Arxiv q-fin</title><link>https://github.com/qhduan/cn-chat-arxiv</link><description>This is arxiv RSS feed for q-fin</description><item><title>&#35813;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#20855;&#26377;&#38543;&#26426;&#21160;&#24577;&#21644;&#20869;&#29983;&#22256;&#22659;&#20256;&#26579;&#30340;&#38134;&#34892;&#38388;&#20132;&#26131;&#27169;&#22411;&#65292;&#20854;&#20013;&#32771;&#34385;&#20102;&#32593;&#32476;&#20869;&#23545;&#26410;&#26469;&#36829;&#32422;&#30340;&#25285;&#24551;&#12290;&#35813;&#27169;&#22411;&#36890;&#36807;&#26465;&#20214;&#27010;&#29575;&#26469;&#30830;&#23450;&#24403;&#26085;&#30340;&#36164;&#20135;&#36127;&#20538;&#34920;&#65292;&#24182;&#25552;&#20379;&#20102;&#31995;&#32479;&#39118;&#38505;&#24863;&#30693;&#30340;&#26399;&#38480;&#32467;&#26500;&#12290;</title><link>http://arxiv.org/abs/2211.15431</link><description>&lt;p&gt;
&#21160;&#24577;&#38134;&#34892;&#38388;&#20132;&#26131;&#27169;&#22411;&#20013;&#30340;&#20869;&#29983;&#22256;&#22659;&#20256;&#26579;&#30740;&#31350;
&lt;/p&gt;
&lt;p&gt;
Endogenous Distress Contagion in a Dynamic Interbank Model. (arXiv:2211.15431v2 [q-fin.MF] UPDATED)
&lt;/p&gt;
&lt;p&gt;
http://arxiv.org/abs/2211.15431
&lt;/p&gt;
&lt;p&gt;
&#35813;&#35770;&#25991;&#20171;&#32461;&#20102;&#19968;&#31181;&#20855;&#26377;&#38543;&#26426;&#21160;&#24577;&#21644;&#20869;&#29983;&#22256;&#22659;&#20256;&#26579;&#30340;&#38134;&#34892;&#38388;&#20132;&#26131;&#27169;&#22411;&#65292;&#20854;&#20013;&#32771;&#34385;&#20102;&#32593;&#32476;&#20869;&#23545;&#26410;&#26469;&#36829;&#32422;&#30340;&#25285;&#24551;&#12290;&#35813;&#27169;&#22411;&#36890;&#36807;&#26465;&#20214;&#27010;&#29575;&#26469;&#30830;&#23450;&#24403;&#26085;&#30340;&#36164;&#20135;&#36127;&#20538;&#34920;&#65292;&#24182;&#25552;&#20379;&#20102;&#31995;&#32479;&#39118;&#38505;&#24863;&#30693;&#30340;&#26399;&#38480;&#32467;&#26500;&#12290;
&lt;/p&gt;
&lt;p&gt;

&lt;/p&gt;
&lt;p&gt;
&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#65292;&#25105;&#20204;&#24341;&#20837;&#20102;&#19968;&#20010;&#20855;&#26377;&#38543;&#26426;&#21160;&#24577;&#30340;&#38134;&#34892;&#38388;&#32593;&#32476;&#65292;&#24182;&#32771;&#34385;&#20102;&#32593;&#32476;&#20869;&#23545;&#26410;&#26469;&#36829;&#32422;&#30340;&#25285;&#24551;&#25152;&#24341;&#36215;&#30340;&#20869;&#29983;&#22256;&#22659;&#20256;&#26579;&#12290;&#20855;&#20307;&#32780;&#35328;&#65292;&#36825;&#28041;&#21450;&#21040;&#19968;&#31181;&#27491;&#21521;-&#21453;&#21521;&#26041;&#27861;&#26469;&#30830;&#23450;&#22343;&#34913;&#21160;&#21147;&#23398;&#65292;&#36890;&#36807;&#24066;&#22330;&#20215;&#20540;&#35843;&#25972;&#26469;&#30830;&#20445;&#38134;&#34892;&#38388;&#20538;&#26435;&#30340;&#20272;&#20540;&#65292;&#24182;&#36890;&#36807;&#26465;&#20214;&#27010;&#29575;&#26469;&#30830;&#23450;&#24403;&#26085;&#30340;&#36164;&#20135;&#36127;&#20538;&#34920;&#12290;&#19982;&#38745;&#24577;&#27169;&#22411;&#19981;&#21516;&#65292;&#25152;&#24471;&#21040;&#30340;&#22256;&#22659;&#20256;&#26579;&#20316;&#20026;&#19968;&#39033;&#38543;&#26426;&#27874;&#21160;&#29575;&#39033;&#65292;&#20869;&#29983;&#22320;&#23548;&#33268;&#20102;&#27874;&#21160;&#29575;&#32858;&#31867;&#21644;&#26174;&#33879;&#30340;&#19979;&#34892;&#26464;&#26438;&#25928;&#24212;&#12290;&#27492;&#22806;&#65292;&#36890;&#36807;&#32771;&#34385;&#22810;&#20010;&#21040;&#26399;&#26085;&#65292;&#25105;&#20204;&#30340;&#27169;&#22411;&#20026;&#38134;&#34892;&#38388;&#20538;&#26435;&#25552;&#20379;&#20102;&#31995;&#32479;&#39118;&#38505;&#24863;&#30693;&#30340;&#26399;&#38480;&#32467;&#26500;&#12290;&#25105;&#20204;&#20998;&#20026;&#20004;&#20010;&#37096;&#20998;&#36827;&#34892;&#20998;&#26512;&#65306;(i) &#21333;&#19968;&#21040;&#26399;&#26085;&#35774;&#32622;&#65292;&#19982;&#20256;&#32479;&#30340;&#38134;&#34892;&#38388;&#32593;&#32476;&#25991;&#29486;&#38750;&#24120;&#21305;&#37197;&#65292;(ii) &#22810;&#20010;&#21040;&#26399;&#26085;&#35774;&#32622;&#65292;&#20197;&#30740;&#31350;&#31995;&#32479;&#39118;&#38505;&#23545;&#25972;&#20010;&#26399;&#38480;&#32467;&#26500;&#30340;&#24433;&#21709;&#12290;
&lt;/p&gt;
&lt;p&gt;
In this work we introduce an interbank network with stochastic dynamics subject to an endogenous notion of distress contagion that accounts for worries about future defaults within the network. Specifically, this entails a forward-backward approach to the equilibrium dynamics, enforced by a mark-to-market valuation adjustment for interbank claims, whereby the conditional probabilities of future defaults are required to determine today's balance sheets. Distinct from static models, the resulting distress contagion acts as a stochastic volatility term which leads, endogenously, to volatility clustering and a marked downside leverage effect. Moreover, by considering multiple maturities, our model provides a systemic risk-aware term structure for interbank claims. We present the analysis in two parts: (i) a single maturity setting that closely matches the traditional interbank network literature, and (ii) a multiple maturity setting to examine the impact of systemic risk on the full term s
&lt;/p&gt;</description></item></channel></rss>